{
  "title": "Paper_544",
  "abstract": "pmc Nucleic Acids Res Nucleic Acids Res 4 nar nar Nucleic Acids Research 0305-1048 1362-4962 Oxford University Press PMC12481014 PMC12481014.1 12481014 12481014 41036618 10.1093/nar/gkaf977 gkaf977 1 AcademicSubjects/SCI00010 Gene regulation, Chromatin and Epigenetics WDR5 serves in co-activation and influences genome targeting of KLF3 Yang Lu  School of Biotechnology and Biomolecular Sciences, UNSW Sydney Sydney NSW 2052 Australia https://orcid.org/0000-0003-1390-5450 Shah Manan  School of Biotechnology and Biomolecular Sciences, UNSW Sydney Sydney NSW 2052 Australia Chavalit Tanit  School of Biotechnology and Biomolecular Sciences, UNSW Sydney Sydney NSW 2052 Australia Spek Annalise M  School of Biotechnology and Biomolecular Sciences, UNSW Sydney Sydney NSW 2052 Australia Lim Wooi F  School of Biotechnology and Biomolecular Sciences, UNSW Sydney Sydney NSW 2052 Australia Zhong Ling  Bioanalytical Mass Spectrometry Facility, UNSW Sydney Sydney NSW 2052 Australia Nejad Safari Vala  School of Biotechnology and Biomolecular Sciences, UNSW Sydney Sydney NSW 2052 Australia Haddad Mahdi  School of Biotechnology and Biomolecular Sciences, UNSW Sydney Sydney NSW 2052 Australia Vu Thu H  School of Life and Environmental Sciences, University of Sydney Australia https://orcid.org/0000-0001-7508-8033 Mackay Joel P  School of Life and Environmental Sciences, University of Sydney Australia Raftery Mark J  Bioanalytical Mass Spectrometry Facility, UNSW Sydney Sydney NSW 2052 Australia Wilkins Marc R  School of Biotechnology and Biomolecular Sciences, UNSW Sydney Sydney NSW 2052 Australia Mathews Jacqueline M  School of Life and Environmental Sciences, University of Sydney Australia https://orcid.org/0000-0002-5722-8183 Quinlan Kate G R  School of Biotechnology and Biomolecular Sciences, UNSW Sydney Sydney NSW 2052 Australia https://orcid.org/0000-0003-2057-3642 Crossley Merlin  School of Biotechnology and Biomolecular Sciences, UNSW Sydney Sydney NSW 2052 Australia To whom correspondence should be addressed. Email: m.crossley@unsw.edu.au Lu Yang, Manan Shah, Kate GR Quinlan and Merlin Crossley should be regarded as Joint First and Joint Last Authors. 14 10 2025 30 9 2025 53 18 497355 gkaf977 08 9 2025 29 8 2025 02 8 2025 30 09 2025 01 10 2025 03 10 2025 © The Author(s) 2025. Published by Oxford University Press. 2025 https://creativecommons.org/licenses/by/4.0/ This is an Open Access article distributed under the terms of the Creative Commons Attribution License ( https://creativecommons.org/licenses/by/4.0/ Abstract Krüppel-like factor 3 (KLF3) is a member of the archetypal SP/KLF family of transcription factors that bind GC-rich elements and CACCC boxes in promoters and enhancers via three classical zinc fingers (ZFs) at or near their C-termini. KLF3 can both repress and activate transcription. It represses by recruiting CtBP co-repressors via its N-terminal domain but the mechanism by which it activates was unknown. Here, we show that KLF3 associates with WDR5 and this interaction is associated with gene activation. We also demonstrate that this interaction is required for proper genomic targeting of KLF3. This helps explain previous results indicating that both the C-terminal ZF DNA-binding domain and N-terminal functional domain are required for KLF3 to identify its target genes. This result adds to only a handful of examples that transcriptional co-regulators, in addition to facilitating activation and repression, can also influence target gene selection. Graphical Abstract  Graphical Abstract Australian Research Council 10.13039/501100000923 DP170101786 DP220101489 DP250103666 National Collaborative Research Infrastructure Strategy (NCRIS) China Scholarship Council 10.13039/501100004543 Royal Thai Government scholarship Research Training Program UNSW Sydney University pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement yes pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes Introduction Transcription factors are often considered to be composed of two components: a sequence-specific DNA-binding domain (DBD) and a functional (activation/repression) domain (FD). The localization of the transcription factor to its target genes is usually attributed to the DBD, since it can bind directly to specific sequences in DNA. The FD is considered to control activation or repression of the target gene [ 1 We have focussed on one member of the archetypal SP/KLF family, Krüppel-like factor 3 (KLF3) [ 2 3 4–6 7–9 There is accumulating evidence that DBDs alone are not necessarily sufficient for the localization of transcription factors to their target genes. From a theoretical perspective, the DNA-recognition elements for transcription factors are typically very short (often 5–8 nucleotides) and transcription factors only localize to a subset of potential binding sites in the genome. In the case of KLF3, we have found that the DBD of KLF3 is not sufficient for proper localization of KLF3 to all its target genes [ 9 10 9 10 To investigate how the FD serves to localize the protein to specific target genes, and with a view to revealing co-activators of transcription, we sought to identify partner proteins of the FD (non-DNA-binding domain) of KLF3. We constructed a cell line stably expressing an epitope-tagged KLF3 FD and performed co-immunoprecipitation coupled mass spectrometry (CoIP/MS) to identify partner proteins. Encouragingly, we isolated a previously known partner, CtBP [ 8 Detailed mapping of the region of KLF3 bound by WDR5 enabled us to create a KLF3 point mutant that was impaired in its association with WDR5. ChIP (chromatin immunoprecipitation)-seq experiments demonstrated that disrupting the interaction of KLF3 and WDR5 significantly affected the localization of KLF3 to a subset of its targets. RNA-seq revealed that the majority of the mis-regulated genes that were bound by KLF3 and WDR5 relied on these proteins for activation, thus establishing WDR5 as the first co-activator found to associate with KLF3. Accordingly, the association with WDR5 helps explain both the activation function and genomic localization of KLF3. Taken together, our results identify WDR5 as a co-activator of KLF3 that acts not only in activating specific KLF3 target genes but also more fundamentally in localizing KLF3 to a subset of its targets. This has implications for our understanding of how transcription factors identify their target genes in the context of the chromatin landscape, and suggests that different co-regulators, as well as serving a role in activation or repression, also direct transcription factors to different target genes. Materials and methods Cell culture Human embryonic kidney (HEK293) cells, mouse embryonic fibroblast (MEF) cells, and COS-1 monkey kidney (COS) cells were cultured in Dulbecco’s modified Eagle’s medium (DMEM; Life Technologies, CA, USA) supplemented with 1% (v/v) penicillin–streptomycin–glutamine (PSG) solution (Life Technologies, CA, USA) and 10% (v/v) fetal bovine serum (FBS; Life Technologies, CA, USA). Cells were grown at 37°C in a 5% CO 2 Cell transient transfection COS cells were transiently transfected with pMT3-HA-KLF3 plasmid, pMT3-FLAG-WDR5 plasmid, and various deletion constructs using the FuGENE ® 6 ® ® ® 2 Generation of stable cell lines (retroviral transduction) The Klf3 −/− Klf3 −/− 11 9 ® Co-immunoprecipitation for mass spectrometry HEK293 stable cell lines [ 10 g 2 g 2 2 g g Mass spectrometry analysis The trypsinized eluate was used to perform mass spectrometry at the Bioanalytical Mass Spectrometry Facility, UNSW. Digested peptides were separated by nano-LC using an UltiMate 3000 UPLC and autosampler system (Thermo Fisher Scientific, San Jose, CA, USA). Samples (2.5 μl) were concentrated and desalted onto a micro C18 precolumn (300 μm × 5 mm; Thermo) with H 2 2 2 A survey scan of m z m z q m z Peak lists were generated using Mascot Daemon/extract_msn (Matrix Science, London, UK, Thermo) using the default parameters, and submitted to the database search program Mascot (version 2.3, Matrix Science). Search parameters were as follows: precursor tolerance 4 ppm and product ion tolerances ±0.4 Da; met(O) carboxyamidomethyl-Cys specified as variable modification; enzyme specificity was trypsin; one missed cleavage was possible; and the non-redundant protein database from SwissProt (Jan 2016) searched. Mascot search results were analysed with Scaffold (Proteome software). Protein identifications were selected with this criteria: 99% protein threshold, three minimum peptides, and 95% peptide threshold. Co-immunoprecipitation COS cells transfected with pMT3-HA-KLF3 plasmid, pMT3-FLAG-WDR5 plasmid, and various deletion constructs were used in this experiment. Transfected cells were harvested after 48 h. Monolayer cells were washed with 1 ml cold PBS and centrifuged at 300 × g g g g Western blot Nuclear extracts were made as previously described [ 12 ® ( Chromatin immunoprecipitation ChIP experiments were performed as previously described [ 11 7 8 g DNA library preparation and next-generation sequencing DNA library preparation was performed using the TruSeq DNA Sample Preparation Kit (Illumina, Cat# FC-121-2001) according to the manufacturer’s instructions. Adapter sequences were diluted 1/40 before use and following adapter ligation, the library size extracted from the gel was 100–280 bp (excluding adapters) in line with the size of sonicated fragments. Libraries from eight samples were multiplexed into four lanes such that there were two samples per lane. Samples were sequenced using 75 bp read chemistry on the NextSeq 500 (Illumina). Sequencing was performed by the Ramaciotti Centre for Genomics, an internal core sequencing facility at UNSW Sydney. RNA extraction Total RNA was extracted from wildtype KLF3 MEF cells and R254A mutant KLF3 MEF cells with TRI Reagent according to the manufacturer’s protocol (Qiagen, Cat# 74004). Two-hundred microlitres of chloroform was added to 1 ml TRI Reagent and vortexed for 10 s. The mixture was spun at 12 000 × g RNA library preparation and next-generation sequencing Coding RNA was pulled down by virtue of the poly A tail and was converted into a library of template molecules of known strand origin using the TruSeq Stranded mRNA Sample Preparation Kits ( ChIP-seq analysis After quality filtering and adapter trimming using Trimmomatic v0.3.3 using the default parameters (LEADING:3 TRAILING:3 SLIDINGWINDOW:4:15 MINLEN:36) [ 13 Mus musculus 14 15 Peak calling for all datasets was done using the SPP package [ 16 17 17 18 19 20 21 22 2 De no vo 23 Read coverage tracks were generated using deepTools bamCoverage [ 24 For average summary plots, computeMatrix followed by plotProfile from deepTools [ 24 RNA-seq analysis Raw FASTQ files were quantified using Salmon v1.6.0 [ 25 26 Mus musculus 27 28 2 P ChIP-seq and RNA-seq combined analysis For the combined ChIP-seq and RNA-seq analysis, the KLF3 and WDR5 DiffBind peaksets were used. Using BEDTools intersect, these peaksets were then overlapped with each other and a BED file of all promoters (−1000 to +1000 bp from the transcription start site (TSS) of any known transcript) generated using the gencode vM20 comprehensive gtf annotation file. This set of peaks with corresponding promoter and gene information was then combined with the RNA-seq data using R. This dataset that contained peak and differential binding information, KLF3 and WDR5 overlap information, and RNA-seq data was then filtered according to the different scenarios tested in Fig. 6 Results WDR5 associates with the KLF3 functional domain To identify partners of the KLF3 FD, we performed CoIP/MS in HEK293 cells stably expressing a V5-epitope-tagged KLF3 FD fragment, KLF3-FD-V5 (1–262) [ 10 1A Figure 1 Identification of WDR5 as a KLF3 partner protein. ( A B C D To identify proteins from immunoprecipitations, peptide fragmentation spectra were matched against the human proteome using the Mascot search engine. Background proteins that were detected in the negative control HEK293 line, which did not express KLF3-FD-V5, were discarded. The experiments successfully recovered the well-characterized KLF3 partners, CtBP1 and 2 (Fig. 1B Supplementary Table S1 29 To verify the interaction between KLF3 and WDR5, a number of additional experiments were carried out. Full-length wild-type HA-epitope-tagged KLF3 (KLF3 1–344 WT) or full-length HA-KLF3 containing a mutation at the CtBP interaction site (KLF3 1–344 ΔDL) was co-expressed with FLAG-epitope-tagged WDR5 (FLAG-WDR5) and CoIP assays performed. Both KLF3 1–344 WT and KLF3 1–344 ΔDL were co-immunoprecipitated by FLAG-WDR5 (Fig. 1C 1D Supplementary Fig. S1 WDR5 associates via a short motif in the KLF3 functional domain To identify the WDR5 association interface on KLF3, we generated a series of KLF3 deletion constructs and tested their interaction with WDR5, using CoIP assays (Fig. 2A 2 2B Figure 2 KLF3 N-terminal deletion mapping determines an association interface with WDR5 at KLF3 residues 250–268. The WDR5 association motif in KLF3 was mapped using successive 30 amino acid KLF3 N-terminal deletions from residues 1 to 268 by CoIP. ( A B To further define the WDR5 association motif in KLF3 amino acids (Fig. 3A 3B 3C Supplementary Fig. S2 Figure 3 An R254A mutation in KLF3 disrupts association with WDR5. ( A B C The amino acid sequence of KLF3 between 251 and 260 was aligned with two previously characterized WDR5 binding motifs: WDR5-binding motif (WBM) [ 30–32 33–35 Supplementary Fig. S3 Disrupting the KLF3/WDR5 association via the R254A mutation causes significant changes in the transcriptome and in genome-wide KLF3 and WDR5 binding To investigate the functional role of the KLF3/WDR5 interaction, we generated KLF3 knock-out MEF cells stably rescued with either WT KLF3-V5 (WT KLF3 MEFs) or R254A KLF3-V5 (R254A KLF3 MEFs) (Fig. 4A 4B 4C P adj 5A Figure 4 Generation of MEF cells stably overexpressing WT and R254A KLF3. ( A B C Figure 5 The R254A mutation causes significant transcriptome and genome-wide binding changes to both KLF3 and WDR5. ( A 2 P adj B C 2 10 D 2 10 E F G De novo E To investigate which genes were directly bound and thus might be directly regulated by the KLF3/WDR5 complex, we performed KLF3-V5 and WDR5 chromatin immunoprecipitation followed by next-generation sequencing (ChIP-seq) on two clones stably expressing WT KLF3-V5 and two clones stably expressing R254A KLF3-V5 to similar levels (Fig. 4C In the MEF cells rescued with WT KLF3, ∼21 000 KLF3 ChIP-seq peaks and ∼24 000 WDR5 peaks were identified. We also analysed the genomic localization of both proteins in cells rescued with the KLF3 R254A mutant that cannot bind WDR5 (Fig. 5B To further assess the effect of the R254A mutation on both KLF3 and WDR5 genome-wide binding, we performed differential binding analysis using DiffBind [ 22 5C 5D We next asked whether KLF3 and WDR5 were co-localized in the genome. A significant proportion, namely about a third of the peaks, contained both KLF3 and WDR5, consistent with the view that KLF3 and WDR5 associate and co-localize at particular loci (Fig. 5E 5F We also performed de novo 24 5G The KLF3/WDR5 complex is implicated in gene activation To determine the effect on the transcription of genes that are co-occupied by both KLF3 and WDR5 at their promoter (±1 kb TSS), we combined the RNA-seq and ChIP-seq data. We specifically sought to determine the impact of abrogating the contact between KLF3 and WDR5 via the R254A mutation in KLF3. The expression of many genes was unaffected, but we focussed on those genes whose expression was altered and that showed KLF3 and WDR5 peaks in the WT sample. We then divided these genes into three subsets: those where the R254A mutation reduced the KLF3 ChIP-seq peak, those where it reduced the WDR5 peak, and those where both peaks were reduced. We found that when either only KLF3 binding (13/21) or only WDR5 binding (14/21) was reduced, most genes had reduced expression (Fig. 6A 6A 6B D Supplementary Fig. S4 Figure 6 The KLF3/WDR5 complex is associated with gene activation. ( A 2 P adj B C D Discussion Here, we have identified WDR5 as a functional partner of KLF3. ChIP-seq data indicate that KLF3 and WDR5 co-localize at >8500 sites in MEFs. RNA-seq data demonstrated that at the co-occupied genes whose expression is affected, the majority are reduced in expression when a mutant version of KLF3, R254A, that is unable to contact WDR5, was used. This suggests that the KLF3/WDR5 association facilitates gene activation. This may be consistent with WDR5 serving in co-activation when present as part of the WHHERE complex; however, further validation is needed to determine whether KLF3 associates only with WDR5 or also associates with other members of the WHHERE complex [ 29 36 Most interesting perhaps is the observation that abrogating the interaction between KLF3 and WDR5 via the R254A mutation affected the proper localization of both proteins to the full set of their target genes. The R254A mutation in KLF3 impaired the association of KLF3 with about a third of its genomic target sites. In addition, WDR5 was also lost from about a third of its usual sites. Thus, the protein–protein interaction between WDR5 and KLF3 is required for the proper genomic localization of both proteins to sites that would normally be co-occupied by KLF3 and WDR5. This result fits with previous work that shows that WDR5 is required for the proper localization of c-Myc to its target genes [ 32 37 38 This raises the question of the mechanism by which co-operative targeting operates. Both KLF3 and c-Myc have well-defined sequence-specific DBDs that enable their localization to their recognition sequences in DNA and thus it is clear that they can help localize WDR5 to particular parts of the genome via this simple mechanism. How WDR5, in turn, influences (directs or stabilizes) the genomic targeting of KLF3 (or in other partners, such as c-Myc) is not yet clear. This is in part as we do not yet know whether the KLF3–WDR5 association is direct or indirect (i.e. via both proteins being part of the same multi-protein complex). WDR5 can make numerous protein–protein interactions and could therefore contact various different DNA-bound transcription factors or other co-regulators or regulatory complexes [ 39 40 41 The realization that transcriptional co-regulators, rather than simply being recruited by transcription factors to activate or repress gene expression, might have an active role in contributing to target gene selection offers a perspective on how genes are regulated. Co-regulators can be considered not simply as functional effectors but also as partners in target gene identification that stabilize or direct their partners to target genes. Thus, the availability of co-regulators or the control of their association with transcription factors via signalling pathways and post-translational modifications may not merely determine whether or not a transcription factor can activate or repress its target gene, it may also be decisive in determining whether a transcription factor like KLF3 can even find that gene. Additionally, the association of transcription factors with different co-regulators in different tissues or under different physiological conditions could lead to the binding to different target genes, perhaps helping to explain why even ubiquitous transcription factors can regulate different targets in different cellular environments. Hitherto, it has been generally thought that the binding of transcription factors depended on whether chromatin was ‘open’ or ‘closed’, with pioneer factors required to remodel and open chromatin, but it may be simply that different landscapes of bound proteins are required. In summary, the historic view of transcription factors was that they contain a DBD that localizes them to their target genes and an FD that recruits co-regulators that activate or repress gene expression. We provide evidence that KLF3 at least, and presumably other transcription factors such as c-Myc and GATA-1, instead work with co-regulators to identify specific sets of target genes partly through DNA–protein interactions but also through protein–protein or protein–histone code binding of specific loci that are decorated by resident protein epitopes or histone marks. The different landscapes in different tissues may explain why even ubiquitous transcription factors bind different genes in different cell types. Supplementary Material gkaf977_Supplemental_Files Acknowledgements  Author contributions Supplementary data  Supplementary data Conflict of interest None declared. Funding This work was supported by funding from the Australian Research Council to M.C. and K.G.R.Q. (DP170101786, DP220101489, DP250103666). M.R.W. acknowledges support from the Australian Government National Collaborative Research Infrastructure Strategy (NCRIS) scheme. L.Y. was supported by the China Scholarship Council scholarship granted by the Chinese Government. T.C. was supported by the Royal Thai Government scholarship granted by Thai Government. M.S., A.M.S., and M.H. were supported by the Australian Government Research Training Program (RTP) Scholarship and V.N.S. was supported by the UNSW Sydney University Postgraduate Award (UPA). Funding to pay the Open Access publication charges for this article was provided by University of New South Wales (UNSW Sydney). Data availability ChIP-seq and RNA-seq data generated in this study have been uploaded to GEO under accession number GSE199657 https://www.ncbi.nlm.nih.gov/geo/query/acc.cgi?acc=GSE199657 https://genome-asia.ucsc.edu/s/mshah/KLF3_WDR5%20R254A%20ChIP%2Dseq https://www.ebi.ac.uk/pride/archive/projects/PXD033888 References 1. Mitchell PJ Tjian R Transcriptional regulation in mammalian cells by sequence-specific DNA binding proteins Science 1989 245 371 8 10.1126/science.2667136 2667136 2. Kaczynski J Cook T Urrutia R Sp1- and Krüppel-like transcription factors Genome Biol 2003 4 206 10.1186/gb-2003-4-2-206 12620113 PMC151296 3. Pearson R Fleetwood J Eaton S et al Krüppel-like transcription factors: a functional family Int J Biochem Cell Biol 2008 40 1996 2001 10.1016/j.biocel.2007.07.018 17904406 4. Pearson RCM Funnell APW Crossley M The mammalian zinc finger transcription factor Krüppel-like factor 3 (KLF3/BKLF) IUBMB Life 2011 63 86 93 10.1002/iub.422 21360637 5. Chen X Xu H Yuan P et al Integration of external signaling pathways with the core transcriptional network in embryonic stem cells Cell 2008 133 1106 17 10.1016/j.cell.2008.04.043 18555785 6. Tallack MR Magor GW Dartigues B et al Novel roles for KLF1 in erythropoiesis revealed by mRNA-seq Genome Res 2012 22 2385 98 10.1101/gr.135707.111 22835905 PMC3514668 7. Crossley M Whitelaw E Perkins A et al Isolation and characterization of the cDNA encoding BKLF/TEF-2, a major CACCC-box-binding protein in erythroid cells and selected other cells Mol Cell Biol 1996 16 1695 705 10.1128/MCB.16.4.1695 8657145 PMC231156 8. Turner J Crossley M Cloning and characterization of mCtBP2, a co-repressor that associates with basic Krüppel-like factor and other mammalian transcriptional regulators EMBO J 1998 17 5129 40 10.1093/emboj/17.17.5129 9724649 PMC1170841 9. Burdach J Funnell APW Mak KS et al Regions outside the DNA-binding domain are critical for proper in vivo Nucleic Acids Res 2014 42 276 89 10.1093/nar/gkt895 24106088 PMC3874204 10. Lim WF Burdach J Funnell APW et al Directing an artificial zinc finger protein to new targets by fusion to a non-DNA-binding domain Nucleic Acids Res 2016 44 3118 30 10.1093/nar/gkv1380 26673701 PMC4838343 11. Schmidt D Wilson MD Spyrou C et al ChIP-seq: using high-throughput sequencing to discover protein–DNA interactions Methods 2009 48 240 8 10.1016/j.ymeth.2009.03.001 19275939 PMC4052679 12. Andrews NC Faller DV A rapid micropreparation technique for extraction of DNA-binding proteins from limiting numbers of mammalian cells Nucleic Acids Res 1991 19 2499 10.1093/nar/19.9.2499 2041787 PMC329467 13. Bolger AM Lohse M Usadel B Trimmomatic: a flexible trimmer for Illumina sequence data Bioinformatics 2014 30 2114 20 10.1093/bioinformatics/btu170 24695404 PMC4103590 14. Langmead B Salzberg SL Fast gapped-read alignment with Bowtie 2 Nat Methods 2012 9 357 9 10.1038/nmeth.1923 22388286 PMC3322381 15. Danecek P Bonfield JK Liddle J et al Twelve years of SAMtools and BCFtools Gigascience 2021 10 giab008 10.1093/gigascience/giab008 33590861 PMC7931819 16. Kharchenko PV Tolstorukov MY Park PJ Design and analysis of ChIP-seq experiments for DNA-binding proteins Nat Biotechnol 2008 26 1351 9 10.1038/nbt.1508 19029915 PMC2597701 17. Landt SG Marinov GK Kundaje A et al ChIP-seq guidelines and practices of the ENCODE and modENCODE consortia Genome Res 2012 22 1813 31 10.1101/gr.136184.111 22955991 PMC3431496 18. Li Q Brown JB Huang H et al Measuring reproducibility of high-throughput experiments Ann Appl Stat 2011 5 1752 79 10.1214/11-AOAS466 19. Heinz S Benner C Spann N et al Simple combinations of lineage-determining transcription factors prime cis Mol Cell 2010 38 576 89 10.1016/j.molcel.2010.05.004 20513432 PMC2898526 20. Yu G Wang L-G He Q-Y ChIPseeker: an R/Bioconductor package for ChIP peak annotation, comparison and visualization Bioinformatics 2015 31 2382 3 10.1093/bioinformatics/btv145 25765347 21. Quinlan AR Hall IM BEDTools: a flexible suite of utilities for comparing genomic features Bioinformatics 2010 26 841 2 10.1093/bioinformatics/btq033 20110278 PMC2832824 22. Ross-Innes CS Stark R Teschendorff AE et al Differential oestrogen receptor binding is associated with clinical outcome in breast cancer Nature 2012 481 389 93 10.1038/nature10730 22217937 PMC3272464 23. Machanick P Bailey TL MEME-ChIP: motif analysis of large DNA datasets Bioinformatics 2011 27 1696 7 10.1093/bioinformatics/btr189 21486936 PMC3106185 24. Ramírez F Ryan DP Grüning B et al deepTools2: a next generation web server for deep-sequencing data analysis Nucleic Acids Res 2016 44 W160 5 27079975 10.1093/nar/gkw257 PMC4987876 25. Patro R Duggal G Love MI et al Salmon provides fast and bias-aware quantification of transcript expression Nat Methods 2017 14 417 9 10.1038/nmeth.4197 28263959 PMC5600148 26. Frankish A Diekhans M Ferreira A-M et al GENCODE reference annotation for the human and mouse genomes Nucleic Acids Res 2019 47 D766 73 10.1093/nar/gky955 30357393 PMC6323946 27. Soneson C Love MI Robinson MD Differential analyses for RNA-seq: transcript-level estimates improve gene-level inferences F1000Res 2015 4 1521 10.12688/f1000research.7563.1 26925227 PMC4712774 28. Love MI Huber W Anders S Moderated estimation of fold change and dispersion for RNA-seq data with DESeq2 Genome Biol 2014 15 550 10.1186/s13059-014-0550-8 25516281 PMC4302049 29. Vilhais-Neto GC Fournier M Plassat J-L et al The WHHERE coactivator complex is required for retinoic acid-dependent regulation of embryonic symmetry Nat Commun 2017 8 728 10.1038/s41467-017-00593-6 28959017 PMC5620087 30. Dharmarajan V Lee J-H Patel A et al Structural basis for WDR5 interaction (Win) motif recognition in human SET1 family histone methyltransferases J Biol Chem 2012 287 27275 89 10.1074/jbc.M112.364125 22665483 PMC3431640 31. Odho Z Southall SM Wilson JR Characterization of a novel WDR5-binding site that recruits RbBP5 through a conserved motif to enhance methylation of histone H3 lysine 4 by mixed lineage leukemia protein-1 J Biol Chem 2010 285 32967 76 10.1074/jbc.M110.159921 20716525 PMC2963364 32. Thomas LR Wang Q Grieb BC et al Interaction with WDR5 promotes target gene recognition and tumorigenesis by MYC Mol Cell 2015 58 440 52 10.1016/j.molcel.2015.02.028 25818646 PMC4427524 33. Ee L-S McCannell KN Tang Y et al An embryonic stem cell-specific NuRD complex functions through iInteraction with WDR5 Stem Cell Reports 2017 8 1488 96 10.1016/j.stemcr.2017.04.020 28528697 PMC5470077 34. Song J-J Kingston RE WDR5 interacts with mixed lineage leukemia (MLL) protein via the histone H3-binding pocket J Biol Chem 2008 283 35258 64 10.1074/jbc.M806900200 18840606 PMC2596411 35. Trievel RC Shilatifard A WDR5, a complexed protein Nat Struct Mol Biol 2009 16 678 80 10.1038/nsmb0709-678 19578375 36. Göös H Kinnunen M Salokas K et al Human transcription factor protein interaction networks Nat Commun 2022 13 766 35140242 10.1038/s41467-022-28341-5 PMC8828895 37. Pal S Cantor AB Johnson KD et al Coregulator-dependent facilitation of chromatin occupancy by GATA-1 Proc Natl Acad Sci USA 2004 101 980 5 10.1073/pnas.0307612100 14715908 PMC327128 38. Chlon TM Doré LC Crispino JD Cofactor-mediated restriction of GATA-1 chromatin occupancy coordinates lineage-specific gene expression Mol Cell 2012 47 608 21 10.1016/j.molcel.2012.05.051 22771118 PMC3432917 39. Schuettengruber B Martinez A-M Iovino N et al Trithorax group proteins: switching genes on and keeping them active Nat Rev Mol Cell Biol 2011 12 799 814 10.1038/nrm3230 22108599 40. Migliori V Müller J Phalke S et al Symmetric dimethylation of H3R2 is a newly identified histone mark that supports euchromatin maintenance Nat Struct Mol Biol 2012 19 136 44 10.1038/nsmb.2209 22231400 41. Zhao J Chen W Pan Y et al Structural insights into the recognition of histone H3Q5 serotonylation by WDR5 Sci Adv 2021 7 eabf4291 10.1126/sciadv.abf4291 34144982 PMC8213231 ",
  "metadata": {
    "Title of this paper": "Structural insights into the recognition of histone H3Q5 serotonylation by WDR5",
    "Journal it was published in:": "Nucleic Acids Research",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12481014/"
  }
}