{
  "title": "Paper_646",
  "abstract": "J Maxillofac Oral Surg J Maxillofac Oral Surg 1433 jmos Journal of Maxillofacial & Oral Surgery 0972-8279 0974-942X Springer PMC11456006 PMC11456006.1 11456006 11456006 39376758 10.1007/s12663-023-01931-6 1931 1 Original Article Shame and Stigma Over Long-Term Survival in Postoperative Cases of Head and Neck Cancer http://orcid.org/0000-0001-7391-4207 Goyal Atul Kumar atlgyl@gmail.com 1 Bakshi Jaimanti 1 Panda Naresh K. 1 Kapoor Rakesh 2 Vir Dharam 1 Kumar Krishan 3 Aneja Pankaj 4 1 https://ror.org/009nfym65 grid.415131.3 0000 0004 1767 2903 Department of Otolaryngology and Head and Neck Surgery, Post Graduate Institute of Medical Education and Research, 2 https://ror.org/009nfym65 grid.415131.3 0000 0004 1767 2903 Department of Radiation Oncology, Post Graduate Institute of Medical Education and Research, 3 https://ror.org/009nfym65 grid.415131.3 0000 0004 1767 2903 Department of Psychiatry, Post Graduate Institute of Medical Education and Research, 4 https://ror.org/009nfym65 grid.415131.3 0000 0004 1767 2903 Post Graduate Institute of Medical Education and Research, 14 5 2023 10 2024 23 5 472260 1057 1062 19 7 2021 29 4 2023 01 10 2025 01 10 2025 07 10 2024 01 10 2025 © The Association of Oral and Maxillofacial Surgeons of India 2023. Springer Nature or its licensor (e.g. a society or other partner) holds exclusive rights to this article under a publishing agreement with the author(s) or other rightsholder(s); author self-archiving of the accepted manuscript version of this article is solely governed by the terms of such publishing agreement and applicable law. 2023 Background Surgical excision of the tumor remains the primary choice for the treatment of head and neck cancer patients, but it often leads to facial disfigurement, which further causes mutilation in the patients. Mutilation causes shame and stigma, which imparts significant psychological strain on patients, and tends to impair their quality of life. Objective The present study aimed to assess the shame and stigma over long-term postoperative survival duration in head and neck cancer patients. Methodology Total 100 postoperative patients of head and neck cancer were recruited from the outpatient department of the host institute, and shame and stigma was assessed using the Hindi version of the shame and stigma scale. Results The global shame and stigma score was 22.67 ± 16.22, with the highest perceived stigma due to changes in appearance (11.94 ± 8.805), followed by impaired speech (4.490 ± 3.243), feeling of regret (3.950 ± 3.313), and feeling of stigma (4.490 ± 3.243). The shame and stigma was found to be significantly higher in maxillary cancer patients (33.22 ± 16.60), followed by larynx cancer patients (22.06 ± 13.41) and oral cancer patients (21.53 ± 16.49). Patients with stage III and stage IV of cancer were found to perceive higher shame and stigma (35.91 ± 22.23 and 27.36 ± 14.71, respectively) compared to the patients having stage I and stage II cancer (9.583 ± 9.709 and 16.44 ± 11.82, respectively). A significantly declining linear trend was found between shame and stigma and postoperative survival duration. Conclusion We concluded that shame and stigma act as important determinants of quality of life over long-term survival in head and neck cancer patients, and should be considered while designing psychological interventions and surgical reconstruction protocols. The present study will help clinicians to assess the mutilation among head and neck cancer patients in a better way and will help in devising new psychological strategies to manage psychological aspects associated with mutilation, which will ultimately enhance the quality of life of patients. Keywords Shame Stigma Psychology Cancer Survival http://dx.doi.org/10.13039/501100001411 indian council of medical research Award no. 3/13/JRF -2015/HRD Goyal Atul Kumar pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access no pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement no pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes issue-copyright-statement © The Association of Oral and Maxillofacial Surgeons of India 2024 ",
  "metadata": {
    "Title of this paper": "Shame and Stigma Over Long-Term Survival in Postoperative Cases of Head and Neck Cancer",
    "Journal it was published in:": "Journal of Maxillofacial & Oral Surgery",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC11456006/"
  }
}