{
  "title": "Paper_576",
  "abstract": "pmc NPJ Breast Cancer NPJ Breast Cancer 3134 npjbcancer NPJ Breast Cancer 2374-4677 Nature Publishing Group PMC12480482 PMC12480482.1 12480482 12480482 41022825 10.1038/s41523-025-00829-5 829 1 Review Antibody–drug conjugates in breast cancer: mechanisms of resistance and future therapeutic perspectives Valle Irene 1 2 Grinda Thomas 1 Antonuzzo Lorenzo 3 Pistilli Barbara barbara.pistilli@gustaveroussy.fr 1 4 1 https://ror.org/0321g0743 grid.14925.3b 0000 0001 2284 9388 Medical Oncology Department, Gustave Roussy Cancer Campus, 2 https://ror.org/04jr1s763 grid.8404.8 0000 0004 1757 2304 Oncology Unit, Careggi University Hospital, University of Florence, 3 https://ror.org/04jr1s763 grid.8404.8 0000 0004 1757 2304 Department of Experimental and Clinical Medicine, University of Florence, Careggi University Hospital, 4 https://ror.org/0321g0743 grid.14925.3b 0000 0001 2284 9388 INSERM 1279, Gustave Roussy, 29 9 2025 2025 11 478466 102 29 6 2025 7 9 2025 29 09 2025 01 10 2025 01 10 2025 © The Author(s) 2025 2025 https://creativecommons.org/licenses/by-nc-nd/4.0/ Open Access http://creativecommons.org/licenses/by-nc-nd/4.0/ Although antibody–drug conjugates (ADCs) revolutionized cancer treatment, especially in breast cancer, resistance remains a major challenge. It may involve target expression and distribution, linker stability, ADC intratumor penetration and intracellular internalization, payload activity but also interaction with the tumor microenvironment. Strategies to overcome resistance under investigation include combination therapies, novel payloads, and next-generation ADC designs. The identification of predictive biomarkers may also help guide treatment selection and prevent resistance. Subject terms Biomarkers Cancer Drug discovery Oncology pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement no pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes issue-copyright-statement © Springer Nature Limited 2025 Introduction Antibody drug conjugates (ADCs) have revolutionized tumor treatment, but resistance often limits long-term efficacy 1 ADC structure and main mechanisms of action ADCs present three key components: a humanized monoclonal antibody (mAb) targeting a tumor antigen, a cytotoxic payload, and a linker connecting them 2 1 3 4 5 1 6 7 7 8 Payloads currently fall into two main categories: microtubule inhibitors and DNA-damaging agents like topoisomerase I inhibitors (TOP1i) 5 5 Several ADCs are approved for breast cancer (BC) across different countries: trastuzumab emtansine (T-DM1), trastuzumab deruxtecan (T-DXd), sacituzumab govitecan (SG), datopotamab deruxtecan (Dato-DXd), and sacituzumab tirumotecan (Sac-TMT) 9 10 8 10 11 Possible mechanisms of resistance to ADCs ADC stability and penetration ADC stability in circulation is critical for efficacy and safety, depending on both antibody choice and stable linker to prevent premature payload release, which can cause off-target toxicity and reduce tumor delivery, compromising selectivity and therapeutic benefit 8 12 12 Intratumoral distribution is also a critical factor in ADC efficacy 13 1a 14 16 1 17 Fig. 1 Mechanisms of resistance to ADCs. a b c d e f Some preliminary clinical evidence also pointed out the relevance of the ADC intratumoral distribution 18 In the ICARUS-BREAST01 trial with patritumab deruxtecan (HER3-DXd), exploratory analysis from on-treatment tumor biopsies suggested that the intratumoral distribution of the ADC may influence response, highlighting the need to optimize ADC delivery 19 Reduction of target expression and localization Target expression and localization play a key role in enabling adequate ADC tumor distribution through binding to tumor cells 5 20 1b Regarding target expression, although T-DM1 is ineffective in HER2-negative or HER2-low BC, newer-generation ADCs like T-DXd have shown activity in tumors with low HER2 expression 21 22 23 However, the benefit of T-DXd remains associated with HER2 expression levels, as shown in the phase 2 DAISY trial, evaluating this ADC in mBC, which reported objective response rates (ORRs) of 70.6% (95% Confidence Interval [CI], 58.3–81.0) in HER2-overexpressing, 37.5% (95% CI, 26.4–49.7) in HER2-low, and 29.7% (95% CI, 15.9–47.0) in HER2-negative disease, indicating a direct correlation between HER2 expression and efficacy 24 Exploratory biomarker analyses from the ASCENT and TROPiCS-02 phase 3 trials suggested a trend toward improved ORR and median progression-free survival (mPFS) with higher TROP2 expression. In ASCENT (pretreated metastatic triple-negative [mTN]BC), SG showed longer PFS (6.9, 5.6, and 2.7 months, 95% CI) and higher ORR (44%, 38%, and 22%) in patients with high, medium, and low TROP2 expression, respectively, though benefit was observed across all subgroups 25 Similarly, in the TROPiCS-02 trial (pretreated, endocrine-resistant [Hormone receptors] HR-positive/HER2-negative mBC), a post hoc analysis showed improved outcomes with SG versus control regardless of TROP2 expression (histochemical score [H-score]; range, 0–300), with a trend toward longer mPFS in patients with H-score ≥100 vs <100 (6.4 vs 5.3, 95% CI) 26 ADCs can also induce resistance by downregulating antigen expression and promoting tumor cell tolerance 27 28 29 30 U31402 31 24 Furthermore, the spatial distribution of the target within the tumor also plays a critical role in shaping the response to therapy, as it can affect the interactions of the ADC with the tumor cells and therefore the drug accessibility. In the DAISY study, non-responder tumors in the HER2-positive cohort exhibited a higher proportion of cluster 6, characterized by low HER2 staining and prevalence of stromal component 24 Similarly, HER2 heterogeneity was linked to resistance to T-DM1 plus pertuzumab and lower pathologic complete response (pCR) rates (55% vs 0%, P 32 13 33 Altered internalization and intracellular trafficking pathways Once bound to their target, ADCs promote antigen clustering and internalization, mainly via clathrin-mediated endocytosis, though alternative pathways exist 15 22 34 35 22 34 36 1c Resistance to T-DM1 may emerge through multiple interconnected internalization-related mechanisms in preclinical data: altered lysosomal trafficking, increased lysosomal pH, and sequestration in Caveolin-1-positive compartments with a neutral pH 37 39 40 Preclinical studies described that epidermal growth factor receptor (EGFR) can form heterodimers with HER2, altering trafficking and reducing T-DXd internalization, while HER3/HER2 dimerization seemed to affect trastuzumab efficacy 35 41 Heregulin-induced HER2/HER3/HER4 dimerization also showed to reduce T-DM1 cytotoxicity in both preclinical and early-phase clinical studies 42 43 Target internalization capability can also exert a key role; prior preclinical data pointed out that TROP2 cellular localization and endocytosis may vary across different tumor types 44 45 This is in line with the recent findings of an exploratory analysis of TROPION-Lung01 trial, showing that patients with TROP2 QCS-positive tumors (reflecting higher TROP2 internalization) had improved outcomes with Dato-DXd versus docetaxel (mPFS: 6.9 vs 4.1 months; Hazard Ratio [HR] 0.57, 95% CI, 0.41–0.79) 46 Payload-associated resistance Several resistance mechanisms to ADC payloads have been described, involving both reduced intracellular drug concentration and impaired payload activity. Efflux transporter upregulation Many payload-related mechanisms of resistance mirror classic chemotherapy resistance, such as the upregulation of ATP-binding cassette (ABC) transporters 47 48 1d 28 49 One potential strategy to overcome this type of resistance involves the use of ADCs less susceptible to efflux pumps: in HER2-positive resistant mouse models, disitamab vedotin (DV) outperformed T-DM1 and T-DXd, suggesting a role for efflux pumps, although mechanisms remain unclear 50 51 Payload target mutations Mutations in genes involved in payload activity may also determine ADC resistance (Fig. 1d RB1 52 With respect to BC data, in the DAISY trial, SLX4 24 30 53 Extracellular vesicles (EVs) mediated resistance Extracellular vesicles (EVs) also influence ADC response in preclinical models (Fig. 1d 54 55 Bypass mechanisms related to payloads A possible alternative mechanism of resistance to the payload is the activation of compensatory survival pathways (Fig. 1e 56 57 58 59 Regarding data on T-DXd, studies in resistant models have shown that a VDAC3-derived circular RNA (crRNA) inhibits Heat Shock Protein (HSP) Beta-1 ubiquitination, thereby contributing to resistance 60 ADC cross-resistance Finally, also real-world data indirectly showed resistance pattern linked to the payload, by reporting limited PFS benefit when ADCs with the same payload class (e.g., TOP1i) are used sequentially 53 61 65 Conversely, sequencing HER2-targeted ADCs with different payloads appears more effective. In the phase 3 DESTINY-Breast02 trial, T-DXd significantly improved mPFS versus physician’s choice in HER2-positive mBC patients after T-DM1 (17.8 vs 6.9 months; HR 0.36, 95% CI, P 66 67 24 49 1 Table 1 Ongoing clinical trials evaluating sequencing strategies after prior ADC exposure in BC Clinical trial (name/NCT ID) Phase Type of sequencing Setting SATEEN/ NCT06100874 2 SG + Trastuzumab after PD on T-DXd HER2+ mBC TRADE-DXd/ NCT06533826 2 Dato-DXd or T-DXd after PD on prior ADC HER2- (HER2-low or HER2-0) mBC SERIES/ NCT06263543 2 SG after PD on T-DXd HR+/HER2-low mBC ACE-Breast-03/ NCT04829604 2 ARX788 after PD on T-DXd HER2+ mBC ICARUSBREAST02/ NCT06298084 1b/2 HER3-DXd + Olaparib after PD on T-DXd HER2-low mBC ADC mBC TNBC HER2 + HR SG Dato-DXd T-DXd HER3-DXd PD This is a non-exhaustive list intended to illustrate examples. Role of the tumor microenvironment (TME) Beyond intracellular mechanisms, the TME plays a crucial role in ADC response and resistance (Fig. 1f 68 The immune cells present in the TME may also have a major role in determining the ADC activity. Among the various forms of regulated cell death, immunogenic cell death (ICD) has emerged as a key process in promoting tumor antigen-specific immunity and enhancing responses to anticancer therapies. Comparative studies indicate that the DXd payload induces stronger hallmarks of ICD than DM1, including higher HMGB1 release and increased calreticulin surface exposure on dying tumor cells, suggesting a more potent capacity to stimulate antitumor immune activation 68 68 68 Other prior preclinical studies consistently showed that ADCs reduce TME immunosuppression, activate dendritic cells (DC) and CD8 + T cells, and upregulate Programmed Death-Ligand 1 (PD-L1) and Major Histocompatibility Complex class I (MHC-I) expression on tumor cells 69 71 Emerging clinical trials are starting to validate some of this evidence. In the ICARUS-BREAST01 clinical trial, response to HER3-DXd was associated with upregulation of immune-related pathways such as interferon-alpha and gamma pathways 19 Finally, ADCs can also modulate cancer stem cells (CSCs), known for their chemo-resistance and stem-like properties, by promoting receptor tyrosine kinase-like orphan receptor 72 74 75 20 75 Possible strategies to overcome ADC resistance ADC combination Combining ADCs with other therapies may overcome resistance and enhance efficacy, especially in heterogeneous tumors. However, careful patient selection and clinical context are crucial to balance benefits with the risk of increased adverse events (AEs) (Fig. 2a 2 Fig. 2 Strategies to overcome ADC resistance. a b c Table 2 Ongoing clinical trials evaluating ADCs in combination strategies for breast cancer Clinical trial identifier Phase Investigational combination Setting Study name ADC + ICI  NCT06508216 1b/2 Dato-DXd + durvalumab Early-relapsing mTNBC COMPASS-TNBC  NCT03742102 1b/2 Dato-DXd + durvalumab PD-L1 + LA/mTNBC BEGONIA (Arm 8)  NCT05353361 1b/2 SHR-A1811 + adebrelimab (or pyrotinib or pertuzumab) LA/mTNBC —  NCT01042379 2 Neoadjuvant Dato-DXd + durvalumab HER2-/Immune-positive early BC I-SPY2.2  NCT05629585 3 Adjuvant Dato-DXd ± durvalumab TNBC with residual disease post-NAST TROPION-Breast03  NCT04873362 3 Adjuvant T-DM1 + atezolizumab Early HER2 + BC with residual disease ASTEFANIA  NCT05633654 3 Adjuvant SG + pembrolizumab TNBC with residual disease post-NAST ASCENT-05/ OptimICE-RD  NCT04042701 3 Dato-DXd ± durvalumab first-line PD-L1 + LA/mTNBC TROPION-Breast05  NCT06112379 3 Neoadjuvant Dato-DXd + Durva (Adj. Durva) Early-stage TNBC or HR-low/HER2- BC TROPION-Breast04  NCT04740918 3 T-DM1 + atezolizumab HER2+ and PD-L1 + LA/mBC KATE 3  NCT06312176 3 Sacituzumab tirumotecan± pembrolizumab HR + / HER2- LA/mBC TroFuse-010  NCT06841354 3 Sacituzumab tirumotecan± pembrolizumab PD-L1 < 10 LA/mTNBC TroFuse-011 ADC + rDDRinh  NCT04039230 1b/2 SG + talazoparib mBC —  NCT06298084 1b/2 HER3-DXd + olaparib HER2-low mBC post-T-DXd ICARUSBREAST02 ADC + targeted therapy  NCT06331169 1 T-DXd + anlotinib HER2-low LA/mBC ALTER-BC-Ib-01  NCT05575804 1b/2 GQ1001 + pyrotinib HER2+ mBC —  NCT06157892 1b/2 DV + tucatinib HER2 + LA/mBC or gastric/GEJC —  NCT04983121 2 Neoadjuvant ARX788 + pyrotinib HER2 + BC —  NCT04539938 2 T-DXd + tucatinib HER2+ mBC ± active brain metastasis HER2CLIMB-04  NCT06000033 2 DV + anlotinib HR–, HER2-low mBC —  NCT06015113 NA DV + pyrotinib or neratinib HER2+ mBC + brain metastasis —  NCT06278870 3 DV + pyrotinib first-line HER2+ mBC —  NCT06927180 2 Neoadjuvant SHR-A1811 + pertuzumab HER2 + BC — ADC ICI rDDRinh mBC TNBC LA HER2 HR PD-L1 SCLC SCNEC GEJC DV SG Dato-DXd T-DM1 T-DXd HER3-DXd This is a non-exhaustive list intended to illustrate examples. ADC+ immune checkpoint inhibitor (ICI) The rationale for this combination is based on data showing that combining ADCs with ICIs enhances CD8 + T cell infiltration and activity 70 76 77 78 79 80 71 81 82 2 In DS8201-A-U105 phase 1b trial, T-DXd plus nivolumab yielded ORRs of 65.6% (95% CI, 46.8–81.4%) and 50.0% (95% CI, 24.7–75.3%) for pretreated HER2-positive and HER2-low mBC, regardless of PD-L1 status, though limited by small sample sizes 83 The MORPHEUS-panBC umbrella study in untreated PD-L1-positive mTNBC reported a 76.7% ORR for SG plus atezolizumab vs 66.7% in the control arm, with responses linked to TROP2 and stromal Tumor-Infiltrating Lymphocytes (TILs) 84 In the Phase 3 ASCENT-04/KEYNOTE-D19 trial (treatment-naïve, PD-L1–positive locally advanced [LA]/mTNBC), SG plus pembrolizumab improved PFS over chemo-pembrolizumab (HR 0.65; 95% CI 0.51–0.84, P 85 Encouraging response rates were also reported in the early BC setting; in early TNBC, Arm A2 of the phase 2 NeoSTAR trial tested neoadjuvant SG plus pembrolizumab, achieving a protocol-defined pCR of 34% (16/50; 95% CI, 19.5–46.7) 86 87 2 ADC + DNA-damage response inhibitor (DDRinh) Combining ADC with a DDRinh offers a promising strategy to overcome resistance to TOP1i payloads through “synthetic lethality”. TOP1i cause DNA damage, which is normally repaired via Poly(ADP-ribose) Polymerase (PARP)-dependent pathways. PARP inhibition blocks this repair, determining DNA breaks accumulation and enhanced cell death 1 34 88 89 P 89 However, tolerability, especially myelosuppression, remains a key limitation 34 90 91 91 In the NCT04039230 90 2 ADC + targeted therapy Incorporating tyrosine kinase inhibitors (TKIs) into dual-targeted approaches may enhance ADC efficacy and selectivity, though data on resistance are still limited 1 92 93 Similarly, HER2-targeting TKIs also enhance T-DM1 efficacy: lapatinib increases HER2 expression, neratinib promotes internalization, while tucatinib’s impact is less defined 1 94 97 98 NCT05575804 99 100 In HER2CLIMB-02 phase 3 trial, tucatinib plus T-DM1 improved PFS (HR 0.76, 95% CI, P 101 102 Modulating tumor vasculature through antiangiogenic agents may improve ADC delivery 1 103 104 105 Combining T-DXd with EGFR mAbs (cetuximab or panitumumab) may overcome resistance by enhancing endocytosis of HER2–EGFR heterodimers and target-bound T-DXd, thereby improving its efficacy 35 Dual HER2 inhibition, like T-DM1 plus pertuzumab, may improve ADC tumor distribution 43 106 107 In the phase 3 MARIANNE trial, T-DM1 ± pertuzumab was noninferior to the control arm (mOS 51.8 vs 50.9, HR 0.86, 97.5% CI, 0.67–1.11) in first-line HER2-positive mBC 108 109 P 110 Targeting resistance pathways is promising in preclinical studies. STAT3 inhibition (napabucasin), HSP90 inhibition (geldanamycin), and Phosphoinositide 3-Kinase ([PI3K] CDC-0941) enhanced T-DM1 efficacy in HER2-positive models, though toxicity remains a concern 58 111 113 2 ADC + ADC Combining ADCs with non-overlapping toxicities may enhance efficacy. In the phase 1 DAD trial, SG plus enfortumab vedotin showed a 70% ORR (95% CI, 47–87%) in metastatic urothelial carcinoma 114 New-generation payloads Cytotoxic payloads To overcome ADC resistance, one strategy is using payloads less susceptible to efflux or resistance mechanisms (Fig. 2b 115 116 117 118 3 Table 3 Active clinical trials of innovative ADC platforms in breast cancer Clinical trial identifier Phase Investigational agent Setting Platform type NCT05511844 1 ORM-5029 HER2+ advanced solid tumors MAC NCT05399654 2 TAC-001 Advanced solid tumor ISAC NCT05070247 1/2 TAK-500 ± Pembrolizumab LA/m solid tumor ISAC NCT05514717 1 XMT-2056 HER2+ advanced/recurrent Solid tumors ISAC NCT04561362 1/2 BT8009 ± Pembrolizumab Nectin-4+ advanced malignancies Small format NCT04180371 1/2 BT5528 ± Nivolumab EphA2+ advanced solid tumors Small format NCT06042894 2 SI-B003 ± BL-B01D1 HER2– LA/mBC BsADC NCT06382142 3 BL-B01D1 + Chemotherapy LA/mTNBC BsADC NCT05470348 1 BL-B01D1 LA/mBC and solid tumors BsADC NCT06471205 2 BL-B01D1 + anti-PD-1 LA/mTNBC BsADC NCT06343948 3 BL-B01D1 + Chemotherapy HR+/ HER2– LA/mBC BsADC NCT06846437 3 JSKN003 Pretreated HER2 + LA/mBC BsADC NCT06079983 3 JSKN003 Pretreated LA/mBC BsADC NCT06592417 1 JSKN016 Advanced solid tumors BsADC NCT05735496 1 TQB2102 Advanced solid tumors BsADC NCT06452706 2 TQB2102 HER2– mBC BsADC NCT07008976 3 TQB2102 HER2+ mBC BsADC NCT06198751 2 TQB2102 neoadjuvant Early HER2 + BC BsADC NCT06561607 3 TQB2102 HER2-low BC BsADC NCT07003074 3 TQB2102 HER2+ recurrent/mBC BsADC NCT06942234 1/2 JSKN016 + combination therapy HER2– LA/mBC BsADC NCT06349408 1 IBI3001 Solid tumors BsADC NCT06418061 1 IBI3005 Solid tumors BsADC NCT06493864 1 BL-B16D1 BC and other solid tumors BsADC NCT06475937 1 DM001 Advanced solid tumors BsADC NCT06554795 1/2 DB-1419 Advanced/m solid tumors BsADC NCT06725381 1 SKB571 Advanced solid tumors BsADC NCT06707610 1 ALK202 Advanced solid tumors BsADC NCT06685068 1/2 GEN1286 Advanced solid tumors BsADC NCT06751329 1 DM002 Advanced solid tumors BsADC NCT05785039 2 BL-B01D1 Urinary system and other solid tumors New Linker/Conj. NCT04829604 2 ARX788 HER2+ mBC New Linker/Conj. NCT05377996 1 XMT-1660 Solid tumors New Linker/Conj. NCT 04257110 1 BB-1701 LA/m HER2+ Solid Tumors Bystander effect NCT06188559 2 BB-1701 HER2 + / HER2-low mBC Bystander effect ADC MAC ISAC LA m BC Small format BsADC TNBC HR+ HER2 PD-1 HNSCC Conj. This is a non-exhaustive list intended to illustrate examples. Trastuzumab rezetecan (SHR-A1811), an HER2-targeting ADC carrying a TOP1i payload, showed promising results in a phase 1 trial with ORRs in HER2-positive BC (76.3%), in HER2-low BC (60.4%), and non-breast tumors (45.9%) 119 120 ADC with multi-payloads Dual-drug ADCs aim to overcome tumor heterogeneity by enhancing antitumor activity and accumulation, while avoiding binding competition seen with co-administered single-drug ADCs 121 2b 122 124 Degrader–antibody conjugates (DACs) Proteolysis-targeting chimeras (PROTACs) are heterobifunctional molecules that induce targeted protein degradation by recruiting E3 ligases to specific intracellular proteins 125 115 126 127 2b Structurally similar to ADCs, DACs carry higher DARs due to PROTACs’ lower potency. After receptor-mediated endocytosis, PROTACs are released into the cytoplasm to trigger degradation 128 129 Molecular glues and glue–antibody conjugates (MACs) MACs represent a novel ADC class using monovalent degraders (molecular glues) as payloads that recruit E3 ligases like cereblon to trigger proteasomal degradation of neo substrates proteins, such as G1 to S phase transition 1 (GSPT1), often overexpressed in cancer, including BC 130 131 2b 132 133 3 Immune-stimulating antibody conjugates (ISACs) ISACs combine a tumor-targeting antibody, non-cleavable linker, and immunostimulatory payload to boost anti-tumor immunity by activating innate and adaptive immune responses within TME, overcoming some limitations of conventional ADCs (Fig. 2b 134 134 135 136 137 3 TLRs recognize pathogen-associated patterns to initiate immune responses 134 NCT04460456 NCT05091528 138 139 3 Antibody–oligonucleotide conjugates (AOCs) AOCs combine the gene-silencing ability of oligonucleotides, like small interfering RNA (siRNA) and anti-sense oligonucleotides, with the target deliverability of antibodies, with the goal of improving serum stability, membrane permeability, and tissue specificity (Fig. 2b 140 141 Innovative ADC structures Small-format drug conjugates Smaller antibody formats, like single-chain variable fragment (scFvs) and Fabs, improve tumor penetration and internalization, due to their reduced size compared to full-length immunoglobulins 142 2c 13 142 115 3 Bispecific antibody–drug conjugates (BsADCs) BsADCs are bispecific antibody conjugates targeting two distinct epitopes on the same or different antigens, improving tumor selectivity and internalization in heterogeneous or resistant tumors 143 2c 144 , 145 Andreev et al. developed a HER2/ Prolactin Receptor (PRLR) BsADC that enhanced HER2 degradation and outperformed HER2-ADCs in dual-expressing tumors 146 13 147 BL-B01D1, targeting EGFR/HER3 with a camptothecin payload, showed promising activity in early trials 148 149 3 149 TQB2102, a BsADC targeting HER2 extracellular domains II and IV, showed preliminary antitumor activity in a phase 1 study ( NCT05735496 150 JSKN016, a TROP2/HER3-targeting BsADC, showed preliminary antitumor activity (ORR 80%) and a manageable safety profile in pretreated mTNBC in an ongoing phase 1 trial ( NCT06592417 151 A list of ongoing trials is provided in Table 3 Prodrug-conjugated antibodies (PDCs) Emerging ADCs aim to mitigate on-target, off-tumor toxicity, especially when targeting antigens like EGFR or TROP2, also found on normal tissues 7 8 2c 7 152 New linkers and novel conjugation strategies Increasing linker hydrophilicity is a key strategy to enhance ADC efficacy and overcome resistance (Fig. 2c Hydrophilic linkers, like polyethylene glycol-4 Maleimide (PEG4Mal), improve antitumor activity and reduce clearance, especially in MDR-expressing tumors, outperforming hydrophobic linkers 47 115 7 115 153 GQ1001, a trastuzumab–DM1 ADC using ligase-dependent conjugation, reduces free DM1 toxicity and showed 40% ORR with manageable side effects in a phase 1 trial 154 155 156 3 P 157 Emlitatug ledadotin, a site-specific B7-H4 ADC, showed promising activity (ORR 23%; 95% CI, 5–54%) in heavily pretreated B7-H4–high mTNBC 158 In addition, branched linkers, such as Kumar’s hetero-trifunctional linker, enable higher DARs or dual-payload designs, further enhancing ADC potency 124 3 Conclusion Understanding resistance mechanisms to ADCs is essential for developing new agents capable of overcoming them. Although many have been identified in preclinical studies, further research is needed to clarify their clinical relevance. To address resistance in clinical practice, several strategies are currently under development. These include combination therapies with other agents, such as ICI, DDRinh, and TKI, as well as the use of new-generation payloads and alternative formats, such as DACs, MACs, ISACs, AOCs, or multi-payload ADCs. Another promising approach involves moving beyond the traditional ADC structure, with the development of small-format drug conjugates, BsADCs, PDCs, and optimization of the bystander effect, linker technologies, and conjugation strategies. Multiple clinical trials are currently ongoing to assess the efficacy and safety of these approaches. In addition, the identification of predictive dynamic biomarkers, such as ctDNA, plasma copy number variations, and artificial intelligence-based analyses, may enable real-time monitoring of ADC efficacy and resistance development. Publisher’s note Author contributions I.V. and T.G.: conceptualization, design, and initial drafting of the manuscript. B.P.: conceptualization, design, and critical revision of the manuscript. T.G., L.A., and B.P.: critical revision of the manuscript. All authors reviewed and approved the final version of the manuscript. Data availability No datasets were generated or analyzed during the current study. Competing interests I.V. declares no competing interests. T.G. reports having received travel support from AstraZeneca, Gilead, and Pfizer; has served in a consulting/advisory role for AstraZeneca and Cancerologie-Pratique; and has received research funding from Amgen. L.A. reports relationships with Amgen, Roche, AstraZeneca, and Novartis involving royalties, and has served in an advisory role for Merck Serono. B.P. has received consulting fees (institutional) from AstraZeneca, Seagen, Gilead, Novartis, Lilly, MSD, and Pierre Fabre; personal consulting fees from Pierre Fabre and Daiichi-Sankyo; research funding (institutional) from AstraZeneca, Daiichi-Sankyo, Gilead, Seagen, and MSD; and travel support from AstraZeneca, Pierre Fabre, Lilly, Daiichi-Sankyo, and MSD. References 1. Wei Q The promise and challenges of combination therapies with antibody-drug conjugates in solid tumors J. Hematol. Oncol. J. Hematol. Oncol. 2024 17 1 10.1186/s13045-023-01509-2 38178200 PMC10768262 Wei, Q. et al. The promise and challenges of combination therapies with antibody-drug conjugates in solid tumors. J. Hematol. Oncol. J. Hematol. Oncol. 17 38178200 10.1186/s13045-023-01509-2 PMC10768262 2. Chau CH Steeg PS Figg WD Antibody-drug conjugates for cancer Lancet 2019 394 793 804 10.1016/S0140-6736(19)31774-X 31478503 Chau, C. H., Steeg, P. S. & Figg, W. D. Antibody-drug conjugates for cancer. Lancet 394 31478503 10.1016/S0140-6736(19)31774-X 3. Pommier Y Thomas A New life of topoisomerase I inhibitors as antibody-drug conjugate warheads Clin. Cancer Res. J. Am. Assoc. Cancer Res. 2023 29 991 993 10.1158/1078-0432.CCR-22-3640 PMC10023384 36637483 Pommier, Y. & Thomas, A. New life of topoisomerase I inhibitors as antibody-drug conjugate warheads. Clin. Cancer Res. J. Am. Assoc. Cancer Res. 29 10.1158/1078-0432.CCR-22-3640 PMC10023384 36637483 4. Ko S An Fc variant with two mutations confers prolonged serum half-life and enhanced effector functions on IgG antibodies Exp. Mol. Med. 2022 54 1850 1861 10.1038/s12276-022-00870-5 36319752 PMC9628495 Ko, S. et al. An Fc variant with two mutations confers prolonged serum half-life and enhanced effector functions on IgG antibodies. Exp. Mol. Med. 54 36319752 10.1038/s12276-022-00870-5 PMC9628495 5. Khoury R Mechanisms of resistance to antibody-drug conjugates Int. J. Mol. Sci. 2023 24 9674 10.3390/ijms24119674 37298631 PMC10253543 Khoury, R. et al. Mechanisms of resistance to antibody-drug conjugates. Int. J. Mol. Sci. 24 37298631 10.3390/ijms24119674 PMC10253543 6. Criscitiello C Morganti S Curigliano G Antibody-drug conjugates in solid tumors: a look into novel targets J. Hematol. Oncol. 2021 14 20 10.1186/s13045-021-01035-z 33509252 PMC7844898 Criscitiello, C., Morganti, S. & Curigliano, G. Antibody-drug conjugates in solid tumors: a look into novel targets. J. Hematol. Oncol. 14 33509252 10.1186/s13045-021-01035-z PMC7844898 7. Tsuchikama K Anami Y Ha SYY Yamazaki CM Exploring the next generation of antibody-drug conjugates Nat. Rev. Clin. Oncol. 2024 21 203 223 10.1038/s41571-023-00850-2 38191923 Tsuchikama, K., Anami, Y., Ha, S. Y. Y. & Yamazaki, C. M. Exploring the next generation of antibody-drug conjugates. Nat. Rev. Clin. Oncol. 21 38191923 10.1038/s41571-023-00850-2 8. Colombo R Tarantino P Rich JR LoRusso PM de Vries EGE The journey of antibody-drug conjugates: lessons learned from 40 years of development Cancer Discov. 2024 14 2089 2108 10.1158/2159-8290.CD-24-0708 39439290 Colombo, R., Tarantino, P., Rich, J. R., LoRusso, P. M. & de Vries, E. G. E. The journey of antibody-drug conjugates: lessons learned from 40 years of development. Cancer Discov. 14 39439290 10.1158/2159-8290.CD-24-0708 9. Saleh ÉA Mechanisms of action and resistance to anti-HER2 antibody-drug conjugates in breast cancer Cancer Drug Resist. 2024 7 22 39050884 10.20517/cdr.2024.06 PMC11267152 Saleh, É. A. et al. Mechanisms of action and resistance to anti-HER2 antibody-drug conjugates in breast cancer. Cancer Drug Resist. 7 39050884 10.20517/cdr.2024.06 PMC11267152 10. Larose ÉA Antibody-drug conjugates in breast cancer treatment: resistance mechanisms and the role of therapeutic sequencing Cancer Drug Resist. 2025 8 11 40201309 10.20517/cdr.2024.180 PMC11977375 Larose, ÉA. et al. Antibody-drug conjugates in breast cancer treatment: resistance mechanisms and the role of therapeutic sequencing. Cancer Drug Resist. 8 40201309 10.20517/cdr.2024.180 PMC11977375 11. Yin, Y. et al. Sacituzumab tirumotecan in previously treated metastatic triple-negative breast cancer: a randomized phase 3 trial. Nat. Med 10.1038/s41591-025-03630-w 40217078 12. Lucas AT Factors affecting the pharmacology of antibody-drug conjugates Antibodies 2018 7 10 10.3390/antib7010010 31544862 PMC6698819 Lucas, A. T. et al. Factors affecting the pharmacology of antibody-drug conjugates. Antibodies 7 31544862 10.3390/antib7010010 PMC6698819 13. Cilliers C Menezes B Nessler I Linderman J Thurber GM Improved tumor penetration and single-cell targeting of antibody-drug conjugates increases anticancer efficacy and host survival Cancer Res. 2018 78 758 768 10.1158/0008-5472.CAN-17-1638 29217763 PMC5903206 Cilliers, C., Menezes, B., Nessler, I., Linderman, J. & Thurber, G. M. Improved tumor penetration and single-cell targeting of antibody-drug conjugates increases anticancer efficacy and host survival. Cancer Res. 78 29217763 10.1158/0008-5472.CAN-17-1638 PMC5903206 14. Heldin C-H Rubin K Pietras K Ostman A High interstitial fluid pressure—an obstacle in cancer therapy Nat. Rev. Cancer 2004 4 806 813 10.1038/nrc1456 15510161 Heldin, C.-H., Rubin, K., Pietras, K. & Ostman, A. High interstitial fluid pressure—an obstacle in cancer therapy. Nat. Rev. Cancer 4 15510161 10.1038/nrc1456 15. Cilliers C Guo H Liao J Christodolu N Thurber GM Multiscale modeling of antibody-drug conjugates: connecting tissue and cellular distribution to whole animal pharmacokinetics and potential implications for efficacy AAPS J. 2016 18 1117 1130 10.1208/s12248-016-9940-z 27287046 PMC4996726 Cilliers, C., Guo, H., Liao, J., Christodolu, N. & Thurber, G. M. Multiscale modeling of antibody-drug conjugates: connecting tissue and cellular distribution to whole animal pharmacokinetics and potential implications for efficacy. AAPS J. 18 27287046 10.1208/s12248-016-9940-z PMC4996726 16. Jain RK Normalization of tumor vasculature: an emerging concept in antiangiogenic therapy Science 2005 307 58 62 10.1126/science.1104819 15637262 Jain, R. K. Normalization of tumor vasculature: an emerging concept in antiangiogenic therapy. Science 307 15637262 10.1126/science.1104819 17. Fujimori K Covell DG Fletcher JE Weinstein JN A modeling analysis of monoclonal antibody percolation through tumors: a binding-site barrier J. Nucl. Med. 1990 31 1191 1198 2362198 Fujimori, K., Covell, D. G., Fletcher, J. E. & Weinstein, J. N. A modeling analysis of monoclonal antibody percolation through tumors: a binding-site barrier. J. Nucl. Med. 31 2362198 18. Ponte JF Antibody co-administration can improve systemic and local distribution of antibody-drug conjugates to increase in vivo efficacy Mol. Cancer Ther. 2021 20 203 212 10.1158/1535-7163.MCT-20-0451 33177153 PMC7790875 Ponte, J. F. et al. Antibody co-administration can improve systemic and local distribution of antibody-drug conjugates to increase in vivo efficacy. Mol. Cancer Ther. 20 33177153 10.1158/1535-7163.MCT-20-0451 PMC7790875 19. Pistilli B 340O Efficacy, safety and biomarker analysis of ICARUS-BREAST01: a phase II study of patritumab deruxtecan (HER3-DXd) in patients (pts) with HR+/HER2- advanced breast cancer (ABC) Ann. Oncol. 2024 35 S357 10.1016/j.annonc.2024.08.288 Pistilli, B. et al. 340O Efficacy, safety and biomarker analysis of ICARUS-BREAST01: a phase II study of patritumab deruxtecan (HER3-DXd) in patients (pts) with HR+/HER2- advanced breast cancer (ABC). Ann. Oncol. 35 20. Corti C Future potential targets of antibody-drug conjugates in breast cancer Breast 2023 69 312 322 10.1016/j.breast.2023.03.007 36996620 PMC10063401 Corti, C. et al. Future potential targets of antibody-drug conjugates in breast cancer. Breast 69 36996620 10.1016/j.breast.2023.03.007 PMC10063401 21. Ogitani Y DS-8201a, a novel HER2-targeting ADC with a novel DNA topoisomerase I inhibitor, demonstrates a promising antitumor efficacy with differentiation from T-DM1 Clin. Cancer Res. 2016 22 5097 5108 10.1158/1078-0432.CCR-15-2822 27026201 Ogitani, Y. et al. DS-8201a, a novel HER2-targeting ADC with a novel DNA topoisomerase I inhibitor, demonstrates a promising antitumor efficacy with differentiation from T-DM1. Clin. Cancer Res. 22 27026201 10.1158/1078-0432.CCR-15-2822 22. Barok M Joensuu H Isola J Trastuzumab emtansine: mechanisms of action and drug resistance Breast Cancer Res. BCR 2014 16 209 10.1186/bcr3621 24887180 PMC4058749 Barok, M., Joensuu, H. & Isola, J. Trastuzumab emtansine: mechanisms of action and drug resistance. Breast Cancer Res. BCR 16 24887180 10.1186/bcr3621 PMC4058749 23. Tarantino P Antibody–drug conjugates: smart chemotherapy delivery across tumor histologies CA Cancer J. Clin. 2022 72 165 182 34767258 10.3322/caac.21705 Tarantino, P. et al. Antibody–drug conjugates: smart chemotherapy delivery across tumor histologies. CA Cancer J. Clin. 72 34767258 10.3322/caac.21705 24. Mosele F Trastuzumab deruxtecan in metastatic breast cancer with variable HER2 expression: the phase 2 DAISY trial Nat. Med. 2023 29 2110 2120 10.1038/s41591-023-02478-2 37488289 PMC10427426 Mosele, F. et al. Trastuzumab deruxtecan in metastatic breast cancer with variable HER2 expression: the phase 2 DAISY trial. Nat. Med. 29 37488289 10.1038/s41591-023-02478-2 PMC10427426 25. Bardia A Biomarker analyses in the phase III ASCENT study of sacituzumab govitecan versus chemotherapy in patients with metastatic triple-negative breast cancer☆ Ann. Oncol. 2021 32 1148 1156 10.1016/j.annonc.2021.06.002 34116144 Bardia, A. et al. Biomarker analyses in the phase III ASCENT study of sacituzumab govitecan versus chemotherapy in patients with metastatic triple-negative breast cancer☆. Ann. Oncol. 32 34116144 10.1016/j.annonc.2021.06.002 26. Rugo HS Overall survival with sacituzumab govitecan in hormone receptor-positive and human epidermal growth factor receptor 2-negative metastatic breast cancer (TROPiCS-02): a randomised, open-label, multicentre, phase 3 trial Lancet 2023 402 1423 1433 10.1016/S0140-6736(23)01245-X 37633306 Rugo, H. S. et al. Overall survival with sacituzumab govitecan in hormone receptor-positive and human epidermal growth factor receptor 2-negative metastatic breast cancer (TROPiCS-02): a randomised, open-label, multicentre, phase 3 trial. Lancet 402 37633306 10.1016/S0140-6736(23)01245-X 27. Li S Resistance to antibody–drug conjugates: a review Acta Pharm. Sin. B 2025 15 737 756 10.1016/j.apsb.2024.12.036 40177568 PMC11959940 Li, S. et al. Resistance to antibody–drug conjugates: a review. Acta Pharm. Sin. B 15 40177568 10.1016/j.apsb.2024.12.036 PMC11959940 28. Loganzo F Tumor cells chronically treated with a trastuzumab-maytansinoid antibody-drug conjugate develop varied resistance mechanisms but respond to alternate treatments Mol. Cancer Ther. 2015 14 952 963 10.1158/1535-7163.MCT-14-0862 25646013 Loganzo, F. et al. Tumor cells chronically treated with a trastuzumab-maytansinoid antibody-drug conjugate develop varied resistance mechanisms but respond to alternate treatments. Mol. Cancer Ther. 14 25646013 10.1158/1535-7163.MCT-14-0862 29. Li W-F OBI-992, a novel TROP2-targeted antibody-drug conjugate, demonstrates antitumor activity in multiple cancer models Mol. Cancer Ther. 2025 24 163 175 10.1158/1535-7163.MCT-24-0588 39786401 PMC11791482 Li, W.-F. et al. OBI-992, a novel TROP2-targeted antibody-drug conjugate, demonstrates antitumor activity in multiple cancer models. Mol. Cancer Ther. 24 39786401 10.1158/1535-7163.MCT-24-0588 PMC11791482 30. Coates JT Parallel genomic alterations of antigen and payload targets mediate polyclonal acquired clinical resistance to sacituzumab govitecan in triple-negative breast cancer Cancer Discov. 2021 11 2436 2445 10.1158/2159-8290.CD-21-0702 34404686 PMC8495771 Coates, J. T. et al. Parallel genomic alterations of antigen and payload targets mediate polyclonal acquired clinical resistance to sacituzumab govitecan in triple-negative breast cancer. Cancer Discov. 11 34404686 10.1158/2159-8290.CD-21-0702 PMC8495771 31. Yu HA Translational insights and overall survival in the U31402-A-U102 study of patritumab deruxtecan (HER3-DXd) in EGFR-mutated NSCLC Ann. Oncol. 2024 35 437 447 10.1016/j.annonc.2024.02.003 38369013 Yu, H. A. et al. Translational insights and overall survival in the U31402-A-U102 study of patritumab deruxtecan (HER3-DXd) in EGFR-mutated NSCLC. Ann. Oncol. 35 38369013 10.1016/j.annonc.2024.02.003 32. Filho OM Impact of HER2 heterogeneity on treatment response of early-stage HER2-positive breast cancer: phase II neoadjuvant clinical trial of T-DM1 combined with pertuzumab Cancer Discov. 2021 11 2474 2487 10.1158/2159-8290.CD-20-1557 33941592 PMC8598376 Filho, O. M. et al. Impact of HER2 heterogeneity on treatment response of early-stage HER2-positive breast cancer: phase II neoadjuvant clinical trial of T-DM1 combined with pertuzumab. Cancer Discov. 11 33941592 10.1158/2159-8290.CD-20-1557 PMC8598376 33. Hurvitz SA Neoadjuvant trastuzumab, pertuzumab, and chemotherapy versus trastuzumab emtansine plus pertuzumab in patients with HER2-positive breast cancer (KRISTINE): a randomised, open-label, multicentre, phase 3 trial Lancet Oncol. 2018 19 115 126 10.1016/S1470-2045(17)30716-7 29175149 Hurvitz, S. A. et al. Neoadjuvant trastuzumab, pertuzumab, and chemotherapy versus trastuzumab emtansine plus pertuzumab in patients with HER2-positive breast cancer (KRISTINE): a randomised, open-label, multicentre, phase 3 trial. Lancet Oncol. 19 29175149 10.1016/S1470-2045(17)30716-7 34. Chang HL Schwettmann B McArthur HL Chan IS Antibody-drug conjugates in breast cancer: overcoming resistance and boosting immune response J. Clin. Invest. 2023 133 e172156 10.1172/JCI172156 37712425 PMC10503805 Chang, H. L., Schwettmann, B., McArthur, H. L. & Chan, I. S. Antibody-drug conjugates in breast cancer: overcoming resistance and boosting immune response. J. Clin. Invest. 133 37712425 10.1172/JCI172156 PMC10503805 35. Gupta A EGFR-directed antibodies promote HER2 ADC internalization and efficacy Cell Rep. Med. 2024 5 101792 10.1016/j.xcrm.2024.101792 39437778 PMC11604483 Gupta, A. et al. EGFR-directed antibodies promote HER2 ADC internalization and efficacy. Cell Rep. Med. 5 39437778 10.1016/j.xcrm.2024.101792 PMC11604483 36. Kalim M Intracellular trafficking of new anticancer therapeutics: antibody-drug conjugates Drug Des. Dev. Ther. 2017 11 2265 2276 10.2147/DDDT.S135571 PMC5546728 28814834 Kalim, M. et al. Intracellular trafficking of new anticancer therapeutics: antibody-drug conjugates. Drug Des. Dev. Ther. 11 10.2147/DDDT.S135571 PMC5546728 28814834 37. Ríos-Luci C Resistance to the antibody-drug conjugate T-DM1 is based in a reduction in lysosomal proteolytic activity Cancer Res. 2017 77 4639 4651 10.1158/0008-5472.CAN-16-3127 28687619 Ríos-Luci, C. et al. Resistance to the antibody-drug conjugate T-DM1 is based in a reduction in lysosomal proteolytic activity. Cancer Res. 77 28687619 10.1158/0008-5472.CAN-16-3127 38. Sung M Caveolae-mediated endocytosis as a novel mechanism of resistance to trastuzumab emtansine (T-DM1) Mol. Cancer Ther. 2018 17 243 253 10.1158/1535-7163.MCT-17-0403 29054985 Sung, M. et al. Caveolae-mediated endocytosis as a novel mechanism of resistance to trastuzumab emtansine (T-DM1). Mol. Cancer Ther. 17 29054985 10.1158/1535-7163.MCT-17-0403 39. Baldassarre T Truesdell P Craig AW Endophilin A2 promotes HER2 internalization and sensitivity to trastuzumab-based therapy in HER2-positive breast cancers Breast Cancer Res. BCR 2017 19 110 10.1186/s13058-017-0900-z 28974266 PMC5627411 Baldassarre, T., Truesdell, P. & Craig, A. W. Endophilin A2 promotes HER2 internalization and sensitivity to trastuzumab-based therapy in HER2-positive breast cancers. Breast Cancer Res. BCR 19 28974266 10.1186/s13058-017-0900-z PMC5627411 40. Hamblett KJ SLC46A3 is required to transport catabolites of noncleavable antibody maytansine conjugates from the lysosome to the cytoplasm Cancer Res. 2015 75 5329 5340 10.1158/0008-5472.CAN-15-1610 26631267 Hamblett, K. J. et al. SLC46A3 is required to transport catabolites of noncleavable antibody maytansine conjugates from the lysosome to the cytoplasm. Cancer Res. 75 26631267 10.1158/0008-5472.CAN-15-1610 41. Baselga J Relationship between tumor biomarkers and efficacy in EMILIA, a phase III study of trastuzumab emtansine in HER2-positive metastatic breast cancer Clin. Cancer Res. 2016 22 3755 3763 10.1158/1078-0432.CCR-15-2499 26920887 PMC5485412 Baselga, J. et al. Relationship between tumor biomarkers and efficacy in EMILIA, a phase III study of trastuzumab emtansine in HER2-positive metastatic breast cancer. Clin. Cancer Res. 22 26920887 10.1158/1078-0432.CCR-15-2499 PMC5485412 42. Breuleux M Role of heregulin in human cancer Cell. Mol. Life Sci. CMLS 2007 64 2358 2377 10.1007/s00018-007-7120-0 17530167 PMC11138466 Breuleux, M. Role of heregulin in human cancer. Cell. Mol. Life Sci. CMLS 64 17530167 10.1007/s00018-007-7120-0 PMC11138466 43. Phillips GDL Dual targeting of HER2-positive cancer with trastuzumab emtansine and pertuzumab: critical role for neuregulin blockade in antitumor response to combination therapy Clin. Cancer Res. 2014 20 456 468 10.1158/1078-0432.CCR-13-0358 24097864 Phillips, G. D. L. et al. Dual targeting of HER2-positive cancer with trastuzumab emtansine and pertuzumab: critical role for neuregulin blockade in antitumor response to combination therapy. Clin. Cancer Res. 20 24097864 10.1158/1078-0432.CCR-13-0358 44. Ambrogi F Trop-2 is a determinant of breast cancer survival PLoS ONE 2014 9 e96993 10.1371/journal.pone.0096993 24824621 PMC4019539 Ambrogi, F. et al. Trop-2 is a determinant of breast cancer survival. PLoS ONE 9 24824621 10.1371/journal.pone.0096993 PMC4019539 45. Trerotola M Upregulation of Trop-2 quantitatively stimulates human cancer growth Oncogene 2013 32 222 233 10.1038/onc.2012.36 22349828 Trerotola, M. et al. Upregulation of Trop-2 quantitatively stimulates human cancer growth. Oncogene 32 22349828 10.1038/onc.2012.36 46. Garassino MC PL02.11 normalized membrane ratio of TROP2 by quantitative continuous scoring is predictive of clinical outcomes in TROPION-Lung 01 J. Thorac. Oncol. 2024 19 S2 S3 10.1016/j.jtho.2024.09.015 Garassino, M. C. et al. PL02.11 normalized membrane ratio of TROP2 by quantitative continuous scoring is predictive of clinical outcomes in TROPION-Lung 01. J. Thorac. Oncol. 19 47. Kovtun YV Antibody-maytansinoid conjugates designed to bypass multidrug resistance Cancer Res. 2010 70 2528 2537 10.1158/0008-5472.CAN-09-3546 20197459 Kovtun, Y. V. et al. Antibody-maytansinoid conjugates designed to bypass multidrug resistance. Cancer Res. 70 20197459 10.1158/0008-5472.CAN-09-3546 48. Cianfriglia M The biology of MDR1-P-glycoprotein (MDR1-Pgp) in designing functional antibody drug conjugates (ADCs): the experience of gemtuzumab ozogamicin Ann. Ist. Super. Sanita 2013 49 150 168 23771260 10.4415/ANN_13_02_07 Cianfriglia, M. The biology of MDR1-P-glycoprotein (MDR1-Pgp) in designing functional antibody drug conjugates (ADCs): the experience of gemtuzumab ozogamicin. Ann. Ist. Super. Sanita 49 23771260 10.4415/ANN_13_02_07 49. Takegawa N DS-8201a, a new HER2-targeting antibody-drug conjugate incorporating a novel DNA topoisomerase I inhibitor, overcomes HER2-positive gastric cancer T-DM1 resistance Int. J. Cancer 2017 141 1682 1689 10.1002/ijc.30870 28677116 Takegawa, N. et al. DS-8201a, a new HER2-targeting antibody-drug conjugate incorporating a novel DNA topoisomerase I inhibitor, overcomes HER2-positive gastric cancer T-DM1 resistance. Int. J. Cancer 141 28677116 10.1002/ijc.30870 50. Pourjamal N Comparison of trastuzumab emtansine, trastuzumab deruxtecan, and disitamab vedotin in a multiresistant HER2-positive breast cancer lung metastasis model Clin. Exp. Metastasis 2024 41 91 102 10.1007/s10585-024-10278-2 38367127 PMC10973002 Pourjamal, N. et al. Comparison of trastuzumab emtansine, trastuzumab deruxtecan, and disitamab vedotin in a multiresistant HER2-positive breast cancer lung metastasis model. Clin. Exp. Metastasis 41 38367127 10.1007/s10585-024-10278-2 PMC10973002 51. Sledge G Abstract PS13-09: mechanisms of resistance to trastuzumab deruxtecan in breast cancer elucidated by multi-omic molecular profiling Clin. Cancer Res. 2025 31 PS13-09 10.1158/1557-3265.SABCS24-PS13-09 Sledge, G. et al. Abstract PS13-09: mechanisms of resistance to trastuzumab deruxtecan in breast cancer elucidated by multi-omic molecular profiling. Clin. Cancer Res. 31 52. Gupta A Jatwani K Gupta K Qiu J Dy GK Loss of Rb1 associated with the onset of acquired resistance to trastuzumab deruxtecan in TP53-/HER2-mutated non-small-cell lung cancer: case series JCO Precis. Oncol. 2023 7 e2200476 10.1200/PO.22.00476 36809053 Gupta, A., Jatwani, K., Gupta, K., Qiu, J. & Dy, G. K. Loss of Rb1 associated with the onset of acquired resistance to trastuzumab deruxtecan in TP53-/HER2-mutated non-small-cell lung cancer: case series. JCO Precis. Oncol. 7 36809053 10.1200/PO.22.00476 53. Abelman RO TOP1 mutations and cross-resistance to antibody-drug conjugates in patients with metastatic breast cancer Clin. Cancer Res. 2025 10.1158/1078-0432.CCR-24-2771 39745368 PMC12079096 Abelman, R. O. et al. TOP1 mutations and cross-resistance to antibody-drug conjugates in patients with metastatic breast cancer. Clin. Cancer Res. 39745368 10.1158/1078-0432.CCR-24-2771 PMC12079096 54. Barok M Puhka M Yazdi N Joensuu H Extracellular vesicles as modifiers of antibody-drug conjugate efficacy J. Extracell. Vesicles 2021 10 e12070 10.1002/jev2.12070 33613875 PMC7881363 Barok, M., Puhka, M., Yazdi, N. & Joensuu, H. Extracellular vesicles as modifiers of antibody-drug conjugate efficacy. J. Extracell. Vesicles 10 33613875 10.1002/jev2.12070 PMC7881363 55. Le Joncour V A novel anti-HER2 antibody-drug conjugate XMT-1522 for HER2-positive breast and gastric cancers resistant to trastuzumab emtansine Mol. Cancer Ther. 2019 18 1721 1730 10.1158/1535-7163.MCT-19-0207 31292166 Le Joncour, V. et al. A novel anti-HER2 antibody-drug conjugate XMT-1522 for HER2-positive breast and gastric cancers resistant to trastuzumab emtansine. Mol. Cancer Ther. 18 31292166 10.1158/1535-7163.MCT-19-0207 56. Sabbaghi M Defective cyclin B1 induction in trastuzumab-emtansine (T-DM1) acquired resistance in HER2-positive breast cancer Clin. Cancer Res. 2017 23 7006 7019 10.1158/1078-0432.CCR-17-0696 28821558 Sabbaghi, M. et al. Defective cyclin B1 induction in trastuzumab-emtansine (T-DM1) acquired resistance in HER2-positive breast cancer. Clin. Cancer Res. 23 28821558 10.1158/1078-0432.CCR-17-0696 57. Saatci Ö Targeting PLK1 overcomes T-DM1 resistance via CDK1-dependent phosphorylation and inactivation of Bcl-2/xL in HER2-positive breast cancer Oncogene 2018 37 2251 2269 10.1038/s41388-017-0108-9 29391599 Saatci, Ö. et al. Targeting PLK1 overcomes T-DM1 resistance via CDK1-dependent phosphorylation and inactivation of Bcl-2/xL in HER2-positive breast cancer. Oncogene 37 29391599 10.1038/s41388-017-0108-9 58. Wang L STAT3 activation confers trastuzumab-emtansine (T-DM1) resistance in HER2-positive breast cancer Cancer Sci. 2018 109 3305 3315 10.1111/cas.13761 30076657 PMC6172075 Wang, L. et al. STAT3 activation confers trastuzumab-emtansine (T-DM1) resistance in HER2-positive breast cancer. Cancer Sci. 109 30076657 10.1111/cas.13761 PMC6172075 59. Sauveur J Esophageal cancer cells resistant to T-DM1 display alterations in cell adhesion and the prostaglandin pathway Oncotarget 2018 9 21141 21155 10.18632/oncotarget.24975 29765526 PMC5940380 Sauveur, J. et al. Esophageal cancer cells resistant to T-DM1 display alterations in cell adhesion and the prostaglandin pathway. Oncotarget 9 29765526 10.18632/oncotarget.24975 PMC5940380 60. Zou Y crVDAC3 alleviates ferroptosis by impeding HSPB1 ubiquitination and confers trastuzumab deruxtecan resistance in HER2-low breast cancer Drug Resist. Update. Rev. Comment. Antimicrob. Anticancer Chemother. 2024 77 101126 10.1016/j.drup.2024.101126 39243601 Zou, Y. et al. crVDAC3 alleviates ferroptosis by impeding HSPB1 ubiquitination and confers trastuzumab deruxtecan resistance in HER2-low breast cancer. Drug Resist. Update. Rev. Comment. Antimicrob. Anticancer Chemother. 77 10.1016/j.drup.2024.101126 39243601 61. Huppert LA Multicenter retrospective cohort study of the sequential use of the antibody-drug conjugates (ADCs) trastuzumab deruxtecan (T-DXd) and sacituzumab govitecan (SG) in patients with HER2-low metastatic breast cancer (MBC): updated data and subgroup analyses by age, sites of disease, and use of intervening therapies J. Clin. Oncol. 2024 42 1083 1083 10.1200/JCO.2024.42.16_suppl.1083 PMC12000457 40234477 Huppert, L. A. et al. Multicenter retrospective cohort study of the sequential use of the antibody-drug conjugates (ADCs) trastuzumab deruxtecan (T-DXd) and sacituzumab govitecan (SG) in patients with HER2-low metastatic breast cancer (MBC): updated data and subgroup analyses by age, sites of disease, and use of intervening therapies. J. Clin. Oncol. 42 10.1038/s41523-025-00748-5 PMC12000457 40234477 62. Poumeaud F Abstract PS08-02: efficacy of sacituzumab-govitecan (sg) post trastuzumab-deruxtecan (T-DXd) and vice versa for HER2low advanced or metastatic breast cancer (MBC): a French multicentre retrospective study Cancer Res. 2024 84 PS08-02 10.1158/1538-7445.SABCS23-PS08-02 Poumeaud, F. et al. Abstract PS08-02: efficacy of sacituzumab-govitecan (sg) post trastuzumab-deruxtecan (T-DXd) and vice versa for HER2low advanced or metastatic breast cancer (MBC): a French multicentre retrospective study. Cancer Res. 84 63. Abelman RO Abstract PS08-03: sequencing antibody-drug conjugate after antibody-drug conjugate in metastatic breast cancer (A3 study): multi-institution experience and biomarker analysis Cancer Res. 2024 84 PS08-03 10.1158/1538-7445.SABCS23-PS08-03 Abelman, R. O. et al. Abstract PS08-03: sequencing antibody-drug conjugate after antibody-drug conjugate in metastatic breast cancer (A3 study): multi-institution experience and biomarker analysis. Cancer Res. 84 64. Mai N Real world outcomes of sequential ADC therapy in metastatic breast cancer: patients treated with sacituzumab govitecan and trastuzumab deruxtecan J. Clin. Oncol. 2024 42 1085 1085 10.1200/JCO.2024.42.16_suppl.1085 Mai, N. et al. Real world outcomes of sequential ADC therapy in metastatic breast cancer: patients treated with sacituzumab govitecan and trastuzumab deruxtecan. J. Clin. Oncol. 42 65. Tarantino, P. et al. Outcomes of subsequent treatment regimens after trastuzumab deruxtecan in patients with metastatic breast cancer. JNCI J. Natl. Cancer Inst 10.1093/jnci/djaf220 40811144 66. André F Trastuzumab deruxtecan versus treatment of physician’s choice in patients with HER2-positive metastatic breast cancer (DESTINY-Breast02): a randomised, open-label, multicentre, phase 3 trial Lancet 2023 401 1773 1785 10.1016/S0140-6736(23)00725-0 37086745 André, F. et al. Trastuzumab deruxtecan versus treatment of physician’s choice in patients with HER2-positive metastatic breast cancer (DESTINY-Breast02): a randomised, open-label, multicentre, phase 3 trial. Lancet 401 37086745 10.1016/S0140-6736(23)00725-0 67. Fasching PA 322P Human epidermal growth factor receptor 2 (HER2)-directed therapies administered after trastuzumab deruxtecan (T-DXd) remain effective in patients (pts) with metastatic breast cancer (mBC): exploratory analysis from DESTINY-Breast02 and -03 ESMO Open 2025 10 104894 10.1016/j.esmoop.2025.104894 Fasching, P. A. et al. 322P Human epidermal growth factor receptor 2 (HER2)-directed therapies administered after trastuzumab deruxtecan (T-DXd) remain effective in patients (pts) with metastatic breast cancer (mBC): exploratory analysis from DESTINY-Breast02 and -03. ESMO Open 10 68. Tsao L-C Effective extracellular payload release and immunomodulatory interactions govern the therapeutic effect of trastuzumab deruxtecan (T-DXd) Nat. Commun. 2025 16 3167 10.1038/s41467-025-58266-8 40175391 PMC11965298 Tsao, L.-C. et al. Effective extracellular payload release and immunomodulatory interactions govern the therapeutic effect of trastuzumab deruxtecan (T-DXd). Nat. Commun. 16 40175391 10.1038/s41467-025-58266-8 PMC11965298 69. Müller P Microtubule-depolymerizing agents used in antibody-drug conjugates induce antitumor immunity by stimulation of dendritic cells Cancer Immunol. Res. 2014 2 741 755 10.1158/2326-6066.CIR-13-0198 24916470 Müller, P. et al. Microtubule-depolymerizing agents used in antibody-drug conjugates induce antitumor immunity by stimulation of dendritic cells. Cancer Immunol. Res. 2 24916470 10.1158/2326-6066.CIR-13-0198 70. Iwata TN A HER2-targeting antibody-drug conjugate, trastuzumab deruxtecan (DS-8201a), enhances antitumor immunity in a mouse model Mol. Cancer Ther. 2018 17 1494 1503 10.1158/1535-7163.MCT-17-0749 29703841 Iwata, T. N. et al. A HER2-targeting antibody-drug conjugate, trastuzumab deruxtecan (DS-8201a), enhances antitumor immunity in a mouse model. Mol. Cancer Ther. 17 29703841 10.1158/1535-7163.MCT-17-0749 71. Schmid P BEGONIA: phase 1b/2 study of durvalumab (D) combinations in locally advanced/metastatic triple-negative breast cancer (TNBC)—initial results from arm 1, d+paclitaxel (P), and arm 6, d+trastuzumab deruxtecan (T-DXd) J. Clin. Oncol. 2021 39 1023 1023 10.1200/JCO.2021.39.15_suppl.1023 Schmid, P. et al. BEGONIA: phase 1b/2 study of durvalumab (D) combinations in locally advanced/metastatic triple-negative breast cancer (TNBC)—initial results from arm 1, d+paclitaxel (P), and arm 6, d+trastuzumab deruxtecan (T-DXd). J. Clin. Oncol. 39 72. Lee K-L Kuo Y-C Ho Y-S Huang Y-H Triple-negative breast cancer: current understanding and future therapeutic breakthrough targeting cancer stemness Cancers 2019 11 1334 10.3390/cancers11091334 31505803 PMC6769912 Lee, K.-L., Kuo, Y.-C., Ho, Y.-S. & Huang, Y.-H. Triple-negative breast cancer: current understanding and future therapeutic breakthrough targeting cancer stemness. Cancers 11 31505803 10.3390/cancers11091334 PMC6769912 73. Liu S Wicha MS Targeting breast cancer stem cells J. Clin. Oncol. 2010 28 4006 4012 10.1200/JCO.2009.27.5388 20498387 PMC4872314 Liu, S. & Wicha, M. S. Targeting breast cancer stem cells. J. Clin. Oncol. 28 20498387 10.1200/JCO.2009.27.5388 PMC4872314 74. Fultang N Chakraborty M Peethambaran B Regulation of cancer stem cells in triple negative breast cancer Cancer Drug Resist 2021 4 321 342 35582030 10.20517/cdr.2020.106 PMC9019272 Fultang, N., Chakraborty, M. & Peethambaran, B. Regulation of cancer stem cells in triple negative breast cancer. Cancer Drug Resist 4 35582030 10.20517/cdr.2020.106 PMC9019272 75. Islam SS Antibody-drug conjugate T-DM1 treatment for HER2+ breast cancer induces ROR1 and confers resistance through activation of Hippo transcriptional coactivator YAP1 EBioMedicine 2019 43 211 224 10.1016/j.ebiom.2019.04.061 31085100 PMC6558306 Islam, S. S. et al. Antibody-drug conjugate T-DM1 treatment for HER2+ breast cancer induces ROR1 and confers resistance through activation of Hippo transcriptional coactivator YAP1. EBioMedicine 43 31085100 10.1016/j.ebiom.2019.04.061 PMC6558306 76. Gerber H-P Sapra P Loganzo F May C Combining antibody-drug conjugates and immune-mediated cancer therapy: what to expect? Biochem. Pharmacol. 2016 102 1 6 10.1016/j.bcp.2015.12.008 26686577 Gerber, H.-P., Sapra, P., Loganzo, F. & May, C. Combining antibody-drug conjugates and immune-mediated cancer therapy: what to expect?. Biochem. Pharmacol. 102 26686577 10.1016/j.bcp.2015.12.008 77. Müller P Trastuzumab emtansine (T-DM1) renders HER2+ breast cancer highly susceptible to CTLA-4/PD-1 blockade Sci. Transl. Med. 2015 7 315ra188 10.1126/scitranslmed.aac4925 26606967 Müller, P. et al. Trastuzumab emtansine (T-DM1) renders HER2+ breast cancer highly susceptible to CTLA-4/PD-1 blockade. Sci. Transl. Med. 7 26606967 10.1126/scitranslmed.aac4925 78. Emens LA Trastuzumab emtansine plus atezolizumab versus trastuzumab emtansine plus placebo in previously treated, HER2-positive advanced breast cancer (KATE2): a phase 2, multicentre, randomised, double-blind trial Lancet Oncol. 2020 21 1283 1295 10.1016/S1470-2045(20)30465-4 33002436 Emens, L. A. et al. Trastuzumab emtansine plus atezolizumab versus trastuzumab emtansine plus placebo in previously treated, HER2-positive advanced breast cancer (KATE2): a phase 2, multicentre, randomised, double-blind trial. Lancet Oncol. 21 33002436 10.1016/S1470-2045(20)30465-4 79. Loi, S. et al. 329TiP KATE3: a phase III study of trastuzumab emtansine (T-DM1) in combination with atezolizumab or placebo in patients with previously treated HER2-positive and PD-L1–positive locally advanced or metastatic breast cancer. Ann. Oncol. 32 80. Schmid P 379MO datopotamab deruxtecan (Dato-DXd) + durvalumab (D) as first-line (1L) treatment for unresectable locally advanced/metastatic triple-negative breast cancer (a/mTNBC): updated results from BEGONIA, a phase Ib/II study. Am. Oncol. 2023 34 S337 Schmid, P. et al. 379MO datopotamab deruxtecan (Dato-DXd) + durvalumab (D) as first-line (1L) treatment for unresectable locally advanced/metastatic triple-negative breast cancer (a/mTNBC): updated results from BEGONIA, a phase Ib/II study. Am. Oncol. 34 81. Schmid, P. et al. Abstract PD11-08: PD11-08 Trastuzumab deruxtecan (T-DXd) + durvalumab (D) as first-line (1L) treatment for unresectable locally advanced/metastatic hormone receptor-negative (HR−), HER2-low breast cancer: updated results from BEGONIA, a phase 1b/2 study (2023). 82. Schmid P Abstract PO1-19-10: durvalumab + datopotamab deruxtecan in patients with PD-L1 positive advanced/metastatic triple-negative breast cancer: arm 8 of the phase 1b/2, open label, platform BEGONIA study Cancer Res. 2024 84 PO1 19–10 10.1158/1538-7445.SABCS23-PO1-19-10 Schmid, P. et al. Abstract PO1-19-10: durvalumab + datopotamab deruxtecan in patients with PD-L1 positive advanced/metastatic triple-negative breast cancer: arm 8 of the phase 1b/2, open label, platform BEGONIA study. Cancer Res. 84 83. Hamilton E Trastuzumab deruxtecan with nivolumab in HER2-expressing metastatic breast or urothelial cancer: analysis of the phase Ib DS8201-A-U105 study Clin. Cancer Res. 2024 30 5548 5558 10.1158/1078-0432.CCR-24-1513 39405343 PMC11647201 Hamilton, E. et al. Trastuzumab deruxtecan with nivolumab in HER2-expressing metastatic breast or urothelial cancer: analysis of the phase Ib DS8201-A-U105 study. Clin. Cancer Res. 30 39405343 10.1158/1078-0432.CCR-24-1513 PMC11647201 84. Schmid, P. et al. Abstract 181O Interim analysis (IA) of the atezolizumab (atezo) + sacituzumab govitecan (SG) arm in patients (pts) with triple-negative breast cancer (TNBC) in MORPHEUS-pan BC: a phase Ib/II study of multiple treatment (tx) combinations in pts with locally advanced/metastatic BC (LA/mBC). ESMO Open 9 85. Tolaney, S. M. et al. Abstract LBA109: Sacituzumab govitecan (SG) + pembrolizumab (pembro) vs chemotherapy (chemo) + pembro in previously untreated PD-L1-positive advanced triple-negative breast cancer (TNBC): primary results from the randomized phase 3 ASCENT-04/KEYNOTE-D19 study. J. Clin. Oncol 43 86. Abelman RO A phase 2 study of response-guided neoadjuvant sacituzumab govitecan and pembrolizumab (SG/P) in patients with early-stage triple-negative breast cancer: results from the NeoSTAR trial J. Clin. Oncol. 2025 43 511 511 10.1200/JCO.2025.43.16_suppl.511 Abelman, R. O. et al. A phase 2 study of response-guided neoadjuvant sacituzumab govitecan and pembrolizumab (SG/P) in patients with early-stage triple-negative breast cancer: results from the NeoSTAR trial. J. Clin. Oncol. 43 87. Shatsky RA Datopotamab–deruxtecan plus durvalumab in early-stage breast cancer: the sequential multiple assignment randomized I-SPY2.2 phase 2 trial Nat. Med. 2024 30 3737 3747 10.1038/s41591-024-03267-1 39277672 PMC12089997 Shatsky, R. A. et al. Datopotamab–deruxtecan plus durvalumab in early-stage breast cancer: the sequential multiple assignment randomized I-SPY2.2 phase 2 trial. Nat. Med. 30 39277672 10.1038/s41591-024-03267-1 PMC12089997 88. Smith LM Willmore E Austin CA Curtin NJ The novel poly(ADP-Ribose) polymerase inhibitor, AG14361, sensitizes cells to topoisomerase I poisons by increasing the persistence of DNA strand breaks Clin. Cancer Res. 2005 11 8449 8457 10.1158/1078-0432.CCR-05-1224 16322308 Smith, L. M., Willmore, E., Austin, C. A. & Curtin, N. J. The novel poly(ADP-Ribose) polymerase inhibitor, AG14361, sensitizes cells to topoisomerase I poisons by increasing the persistence of DNA strand breaks. Clin. Cancer Res. 11 16322308 10.1158/1078-0432.CCR-05-1224 89. Cardillo TM Synthetic lethality exploitation by an anti-trop-2-SN-38 antibody-drug conjugate, IMMU-132, plus PARP inhibitors in BRCA1/2-wild-type triple-negative breast cancer Clin. Cancer Res. 2017 23 3405 3415 10.1158/1078-0432.CCR-16-2401 28069724 Cardillo, T. M. et al. Synthetic lethality exploitation by an anti-trop-2-SN-38 antibody-drug conjugate, IMMU-132, plus PARP inhibitors in BRCA1/2-wild-type triple-negative breast cancer. Clin. Cancer Res. 23 28069724 10.1158/1078-0432.CCR-16-2401 90. Bardia A Antibody–drug conjugate sacituzumab govitecan enables a sequential TOP1/PARP inhibitor therapy strategy in patients with breast cancer Clin. Cancer Res. 2024 30 2917 2924 10.1158/1078-0432.CCR-24-0428 38709212 PMC11247314 Bardia, A. et al. Antibody–drug conjugate sacituzumab govitecan enables a sequential TOP1/PARP inhibitor therapy strategy in patients with breast cancer. Clin. Cancer Res. 30 38709212 10.1158/1078-0432.CCR-24-0428 PMC11247314 91. Yap TA Phase Ib SEASTAR study: combining rucaparib and sacituzumab govitecan in patients with cancer with or without mutations in homologous recombination repair genes JCO Precis. Oncol. 2022 6 e2100456 10.1200/PO.21.00456 35138920 PMC8865521 Yap, T. A. et al. Phase Ib SEASTAR study: combining rucaparib and sacituzumab govitecan in patients with cancer with or without mutations in homologous recombination repair genes. JCO Precis. Oncol. 6 35138920 10.1200/PO.21.00456 PMC8865521 92. La Monica S Trastuzumab emtansine delays and overcomes resistance to the third-generation EGFR-TKI osimertinib in NSCLC EGFR mutated cell lines J. Exp. Clin. Cancer Res. CR 2017 36 174 29202823 10.1186/s13046-017-0653-7 PMC5716361 La Monica, S. et al. Trastuzumab emtansine delays and overcomes resistance to the third-generation EGFR-TKI osimertinib in NSCLC EGFR mutated cell lines. J. Exp. Clin. Cancer Res. CR 36 29202823 10.1186/s13046-017-0653-7 PMC5716361 93. Haikala HM EGFR inhibition enhances the cellular uptake and antitumor-activity of the HER3 antibody-drug conjugate HER3-DXd Cancer Res. 2022 82 130 141 10.1158/0008-5472.CAN-21-2426 34548332 PMC8732289 Haikala, H. M. et al. EGFR inhibition enhances the cellular uptake and antitumor-activity of the HER3 antibody-drug conjugate HER3-DXd. Cancer Res. 82 34548332 10.1158/0008-5472.CAN-21-2426 PMC8732289 94. Abraham J Safety and efficacy of T-DM1 plus neratinib in patients with metastatic HER2-positive breast cancer: NSABP Foundation Trial FB-10 J. Clin. Onco. 2019 37 2601 2609 10.1200/JCO.19.00858 PMC6784849 31442103 Abraham, J. et al. Safety and efficacy of T-DM1 plus neratinib in patients with metastatic HER2-positive breast cancer: NSABP Foundation Trial FB-10. J. Clin. Onco. 37 10.1200/JCO.19.00858 PMC6784849 31442103 95. Kulukian A Abstract PS10-08: tucatinib potentiates the activity of the antibody-drug conjugate T-DM1 in preclinical models of HER2-positive breast cancer Cancer Res. 2021 81 PS10-08 10.1158/1538-7445.SABCS20-PS10-08 PMC10519189 37721518 Kulukian, A. et al. Abstract PS10-08: tucatinib potentiates the activity of the antibody-drug conjugate T-DM1 in preclinical models of HER2-positive breast cancer. Cancer Res. 81 10.1158/2767-9764.CRC-23-0302 PMC10519189 37721518 96. Murthy RK Tucatinib, trastuzumab, and capecitabine for HER2-positive metastatic breast cancer N. Engl. J. Med. 2020 382 597 609 10.1056/NEJMoa1914609 31825569 Murthy, R. K. et al. Tucatinib, trastuzumab, and capecitabine for HER2-positive metastatic breast cancer. N. Engl. J. Med. 382 31825569 10.1056/NEJMoa1914609 97. Scaltriti M Lapatinib, a HER2 tyrosine kinase inhibitor, induces stabilization and accumulation of HER2 and potentiates trastuzumab-dependent cell cytotoxicity Oncogene 2009 28 803 814 10.1038/onc.2008.432 19060928 Scaltriti, M. et al. Lapatinib, a HER2 tyrosine kinase inhibitor, induces stabilization and accumulation of HER2 and potentiates trastuzumab-dependent cell cytotoxicity. Oncogene 28 19060928 10.1038/onc.2008.432 98. Patel TA A randomized, controlled phase II trial of neoadjuvant ado-trastuzumab emtansine, lapatinib, and nab-paclitaxel versus trastuzumab, pertuzumab, and paclitaxel in HER2-positive breast cancer (TEAL study) Breast Cancer Res. BCR 2019 21 100 10.1186/s13058-019-1186-0 31477168 PMC6720931 Patel, T. A. et al. A randomized, controlled phase II trial of neoadjuvant ado-trastuzumab emtansine, lapatinib, and nab-paclitaxel versus trastuzumab, pertuzumab, and paclitaxel in HER2-positive breast cancer (TEAL study). Breast Cancer Res. BCR 21 31477168 10.1186/s13058-019-1186-0 PMC6720931 99. Wang B. et al. Abstract e13020: Safety and preliminary efficacy of GQ1001, a next generation HER2-targeting ADC, combined with pyrotinib in pretreated patients with HER2-positive metastatic breast cancer: a phase 1b clinical trial. J. Clin. Oncol. 100. Qu F Li W Yi Y 397P Efficacy and safety of the recombinant humanized anti-HER2 monoclonal antibody-MMAE conjugate RC48-ADC in patients with HER2-positive or HER2-low expressing, locally advanced or metastatic breast cancer: a single-arm phase II study Ann. Oncol. 2023 34 S348 10.1016/j.annonc.2023.09.574 Qu, F., Li, W. & Yi, Y. 397P Efficacy and safety of the recombinant humanized anti-HER2 monoclonal antibody-MMAE conjugate RC48-ADC in patients with HER2-positive or HER2-low expressing, locally advanced or metastatic breast cancer: a single-arm phase II study. Ann. Oncol. 34 101. Masuda N 67TiP HER2CLIMB-02: a randomized, double-blind, phase III study of tucatinib or placebo with T-DM1 for unresectable locally-advanced or metastatic HER2+ breast cancer Ann. Oncol. 2020 31 S1267 S1268 10.1016/j.annonc.2020.10.087 Masuda, N. et al. 67TiP HER2CLIMB-02: a randomized, double-blind, phase III study of tucatinib or placebo with T-DM1 for unresectable locally-advanced or metastatic HER2+ breast cancer. Ann. Oncol. 31 102. Hurvitz S Abstract GS01-10: HER2CLIMB-02: randomized, double-blind phase 3 trial of tucatinib and trastuzumab emtansine for previously treated HER2-positive metastatic breast cancer Cancer Res. 2024 84 GS01 GS10 10.1158/1538-7445.SABCS23-GS01-10 Hurvitz, S. et al. Abstract GS01-10: HER2CLIMB-02: randomized, double-blind phase 3 trial of tucatinib and trastuzumab emtansine for previously treated HER2-positive metastatic breast cancer. Cancer Res. 84 103. Ponte JF Mirvetuximab soravtansine (IMGN853), a Folate receptor alpha-targeting antibody-drug conjugate, potentiates the activity of standard of care therapeutics in ovarian cancer models Neoplasia 2016 18 775 784 10.1016/j.neo.2016.11.002 27889646 PMC5126132 Ponte, J. F. et al. Mirvetuximab soravtansine (IMGN853), a Folate receptor alpha-targeting antibody-drug conjugate, potentiates the activity of standard of care therapeutics in ovarian cancer models. Neoplasia 18 27889646 10.1016/j.neo.2016.11.002 PMC5126132 104. Quanz M Anetumab ravtansine inhibits tumor growth and shows additive effect in combination with targeted agents and chemotherapy in mesothelin-expressing human ovarian cancer models Oncotarget 2018 9 34103 34121 10.18632/oncotarget.26135 30344925 PMC6183338 Quanz, M. et al. Anetumab ravtansine inhibits tumor growth and shows additive effect in combination with targeted agents and chemotherapy in mesothelin-expressing human ovarian cancer models. Oncotarget 9 30344925 10.18632/oncotarget.26135 PMC6183338 105. Gilbert L Safety and efficacy of mirvetuximab soravtansine, a folate receptor alpha (FRα)-targeting antibody-drug conjugate (ADC), in combination with bevacizumab in patients with platinum-resistant ovarian cancer Gynecol. Oncol. 2023 170 241 247 10.1016/j.ygyno.2023.01.020 36736157 Gilbert, L. et al. Safety and efficacy of mirvetuximab soravtansine, a folate receptor alpha (FRα)-targeting antibody-drug conjugate (ADC), in combination with bevacizumab in patients with platinum-resistant ovarian cancer. Gynecol. Oncol. 170 36736157 10.1016/j.ygyno.2023.01.020 106. Bordeau BM Yang Y Balthasar JP Transient competitive inhibition bypasses the binding site barrier to improve tumor penetration of trastuzumab and enhance T-DM1 efficacy Cancer Res. 2021 81 4145 4154 10.1158/0008-5472.CAN-20-3822 33727230 PMC8338739 Bordeau, B. M., Yang, Y. & Balthasar, J. P. Transient competitive inhibition bypasses the binding site barrier to improve tumor penetration of trastuzumab and enhance T-DM1 efficacy. Cancer Res. 81 33727230 10.1158/0008-5472.CAN-20-3822 PMC8338739 107. Miller KD Phase IIa trial of trastuzumab emtansine with pertuzumab for patients with human epidermal growth factor receptor 2-positive, locally advanced, or metastatic breast cancer J. Clin. Oncol. 2014 32 1437 1444 10.1200/JCO.2013.52.6590 24733796 Miller, K. D. et al. Phase IIa trial of trastuzumab emtansine with pertuzumab for patients with human epidermal growth factor receptor 2-positive, locally advanced, or metastatic breast cancer. J. Clin. Oncol. 32 24733796 10.1200/JCO.2013.52.6590 108. Perez EA Trastuzumab emtansine with or without pertuzumab versus trastuzumab with taxane for human epidermal growth factor receptor 2-positive advanced breast cancer: final results from MARIANNE Cancer 2019 125 3974 3984 10.1002/cncr.32392 31318460 Perez, E. A. et al. Trastuzumab emtansine with or without pertuzumab versus trastuzumab with taxane for human epidermal growth factor receptor 2-positive advanced breast cancer: final results from MARIANNE. Cancer 125 31318460 10.1002/cncr.32392 109. Hurvitz SA Neoadjuvant trastuzumab emtansine and pertuzumab in human epidermal growth factor receptor 2-positive breast cancer: three-year outcomes from the phase III KRISTINE Study J. Clin. Oncol. 2019 37 2206 2216 10.1200/JCO.19.00882 31157583 PMC6774816 Hurvitz, S. A. et al. Neoadjuvant trastuzumab emtansine and pertuzumab in human epidermal growth factor receptor 2-positive breast cancer: three-year outcomes from the phase III KRISTINE Study. J. Clin. Oncol. 37 31157583 10.1200/JCO.19.00882 PMC6774816 110. Tolaney SM Trastuzumab deruxtecan (T-DXd) + pertuzumab (P) vs taxane + trastuzumab + pertuzumab (THP) for first-line (1L) treatment of patients (pts) with human epidermal growth factor receptor 2-positive (HER2+) advanced/metastatic breast cancer (a/mBC): interim results from DESTINY-Breast09 J. Clin. Oncol. 2025 43 LBA1008 LBA1008 10.1200/JCO.2025.43.17_suppl.LBA1008 Tolaney, S. M. et al. Trastuzumab deruxtecan (T-DXd) + pertuzumab (P) vs taxane + trastuzumab + pertuzumab (THP) for first-line (1L) treatment of patients (pts) with human epidermal growth factor receptor 2-positive (HER2+) advanced/metastatic breast cancer (a/mBC): interim results from DESTINY-Breast09. J. Clin. Oncol. 43 111. Tolaney SM 328TiP Phase III study of trastuzumab deruxtecan (T-DXd) with or without pertuzumab vs a taxane, trastuzumab and pertuzumab in first-line (1L), human epidermal growth factor receptor 2-positive (HER2+) metastatic breast cancer (mBC): DESTINY-Breast09 Ann. Oncol. 2021 32 S507 S508 10.1016/j.annonc.2021.08.611 Tolaney, S. M. et al. 328TiP Phase III study of trastuzumab deruxtecan (T-DXd) with or without pertuzumab vs a taxane, trastuzumab and pertuzumab in first-line (1L), human epidermal growth factor receptor 2-positive (HER2+) metastatic breast cancer (mBC): DESTINY-Breast09. Ann. Oncol. 32 112. Fukuyo Y Hunt CR Horikoshi N Geldanamycin and its anti-cancer activities Cancer Lett. 2010 290 24 35 10.1016/j.canlet.2009.07.010 19850405 Fukuyo, Y., Hunt, C. R. & Horikoshi, N. Geldanamycin and its anti-cancer activities. Cancer Lett. 290 19850405 10.1016/j.canlet.2009.07.010 113. McCombs JR Chang HP Shah DK Owen SC Antibody-drug conjugate and free geldanamycin combination therapy enhances anti-cancer efficacy Int. J. Pharm. 2021 610 121272 10.1016/j.ijpharm.2021.121272 34763035 McCombs, J. R., Chang, H. P., Shah, D. K. & Owen, S. C. Antibody-drug conjugate and free geldanamycin combination therapy enhances anti-cancer efficacy. Int. J. Pharm. 610 34763035 10.1016/j.ijpharm.2021.121272 114. McGregor BA The double antibody drug conjugate (DAD) phase I trial: sacituzumab govitecan plus enfortumab vedotin for metastatic urothelial carcinoma Ann. Oncol. 2024 35 91 97 10.1016/j.annonc.2023.09.3114 37871703 McGregor, B. A. et al. The double antibody drug conjugate (DAD) phase I trial: sacituzumab govitecan plus enfortumab vedotin for metastatic urothelial carcinoma. Ann. Oncol. 35 37871703 10.1016/j.annonc.2023.09.3114 115. Conilh L Sadilkova L Viricel W Dumontet C Payload diversification: a key step in the development of antibody-drug conjugates J. Hematol. Oncol. 2023 16 3 10.1186/s13045-022-01397-y 36650546 PMC9847035 Conilh, L., Sadilkova, L., Viricel, W. & Dumontet, C. Payload diversification: a key step in the development of antibody-drug conjugates. J. Hematol. Oncol. 16 36650546 10.1186/s13045-022-01397-y PMC9847035 116. Takahashi M Eribulin penetrates brain tumor tissue and prolongs survival of mice harboring intracerebral glioblastoma xenografts Cancer Sci. 2019 110 2247 2257 10.1111/cas.14067 31099446 PMC6609810 Takahashi, M. et al. Eribulin penetrates brain tumor tissue and prolongs survival of mice harboring intracerebral glioblastoma xenografts. Cancer Sci. 110 31099446 10.1111/cas.14067 PMC6609810 117. Wang Y Preclinical studies of BB-1701, a HER2-targeting eribulin-containing ADC with potent bystander effect and ICD activity Antib. Ther. 2024 7 221 232 39036069 10.1093/abt/tbae019 PMC11259758 Wang, Y. et al. Preclinical studies of BB-1701, a HER2-targeting eribulin-containing ADC with potent bystander effect and ICD activity. Antib. Ther. 7 39036069 10.1093/abt/tbae019 PMC11259758 118. Ma F Updated safety and antitumor activity of BB-1701 from study 101 in the multiple dose level cohort of patients with locally advanced/metastatic HER2-low expressing breast cancer J. Clin. Oncol. 2024 42 1110 1110 10.1200/JCO.2024.42.16_suppl.1110 Ma, F. et al. Updated safety and antitumor activity of BB-1701 from study 101 in the multiple dose level cohort of patients with locally advanced/metastatic HER2-low expressing breast cancer. J. Clin. Oncol. 42 119. Yao H Safety, efficacy, and pharmacokinetics of SHR-A1811, a human epidermal growth factor receptor 2-directed antibody-drug conjugate, in human epidermal growth factor receptor 2-expressing or mutated advanced solid tumors: a global phase I trial J. Clin. Oncol. 2024 42 3453 3465 10.1200/JCO.23.02044 38900984 Yao, H. et al. Safety, efficacy, and pharmacokinetics of SHR-A1811, a human epidermal growth factor receptor 2-directed antibody-drug conjugate, in human epidermal growth factor receptor 2-expressing or mutated advanced solid tumors: a global phase I trial. J. Clin. Oncol. 42 38900984 10.1200/JCO.23.02044 120. Yao H Abstract CT175: safety, tolerability, pharmacokinetics, and antitumor activity of SHR-A1811 in HER2-expressing/mutated advanced solid tumors: a global phase 1, multi-center, first-in-human study Cancer Res. 2023 83 CT175 10.1158/1538-7445.AM2023-CT175 Yao, H. et al. Abstract CT175: safety, tolerability, pharmacokinetics, and antitumor activity of SHR-A1811 in HER2-expressing/mutated advanced solid tumors: a global phase 1, multi-center, first-in-human study. Cancer Res. 83 121. Yamazaki CM Antibody-drug conjugates with dual payloads for combating breast tumor heterogeneity and drug resistance Nat. Commun. 2021 12 3528 10.1038/s41467-021-23793-7 34112795 PMC8192907 Yamazaki, C. M. et al. Antibody-drug conjugates with dual payloads for combating breast tumor heterogeneity and drug resistance. Nat. Commun. 12 34112795 10.1038/s41467-021-23793-7 PMC8192907 122. Dong W Wang W Cao C The evolution of antibody-drug conjugates: toward accurate DAR and multi-specificity Chem Med Chem 2024 19 e202400109 10.1002/cmdc.202400109 38758596 Dong, W., Wang, W. & Cao, C. The evolution of antibody-drug conjugates: toward accurate DAR and multi-specificity. Chem Med Chem 19 38758596 10.1002/cmdc.202400109 123. Nilchan N. et al. Dual-mechanistic antibody-drug conjugate via site-specific selenocysteine/cysteine conjugation. Antibody Ther. 2 10.1093/abt/tbz009 PMC6953743 31930187 124. Kumar A Synthesis of a heterotrifunctional linker for the site-specific preparation of antibody-drug conjugates with two distinct warheads Bioorg. Med. Chem. Lett. 2018 28 3617 3621 10.1016/j.bmcl.2018.10.043 30389292 Kumar, A. et al. Synthesis of a heterotrifunctional linker for the site-specific preparation of antibody-drug conjugates with two distinct warheads. Bioorg. Med. Chem. Lett. 28 30389292 10.1016/j.bmcl.2018.10.043 125. Li J Chen X Lu A Liang C Targeted protein degradation in cancers: orthodox PROTACs and beyond Innovation 2023 4 100413 37033156 10.1016/j.xinn.2023.100413 PMC10074253 Li, J., Chen, X., Lu, A. & Liang, C. Targeted protein degradation in cancers: orthodox PROTACs and beyond. Innovation 4 37033156 10.1016/j.xinn.2023.100413 PMC10074253 126. Tecalco-Cruz AC Zepeda-Cervantes J Ramírez-Jarquín JO Rojas-Ochoa A Proteolysis-targeting chimeras and their implications in breast cancer Explor. Target. Anti-Tumor Ther. 2021 2 496 510 10.37349/etat.2021.00060 PMC9400758 36046115 Tecalco-Cruz, A. C., Zepeda-Cervantes, J., Ramírez-Jarquín, J. O. & Rojas-Ochoa, A. Proteolysis-targeting chimeras and their implications in breast cancer. Explor. Target. Anti-Tumor Ther. 2 10.37349/etat.2021.00060 PMC9400758 36046115 127. Ocaña A Pandiella A Proteolysis targeting chimeras (PROTACs) in cancer therapy J. Exp. Clin. Cancer Res. CR 2020 39 189 32933565 10.1186/s13046-020-01672-1 PMC7493969 Ocaña, A. & Pandiella, A. Proteolysis targeting chimeras (PROTACs) in cancer therapy. J. Exp. Clin. Cancer Res. CR 39 32933565 10.1186/s13046-020-01672-1 PMC7493969 128. Hong KB An H Degrader–antibody conjugates: emerging new modality J. Med. Chem. 2023 66 140 148 10.1021/acs.jmedchem.2c01791 36580273 Hong, K. B. & An, H. Degrader–antibody conjugates: emerging new modality. J. Med. Chem. 66 36580273 10.1021/acs.jmedchem.2c01791 129. Maneiro MA Antibody-PROTAC conjugates enable HER2-dependent targeted protein degradation of BRD4 ACS Chem. Biol. 2020 15 1306 1312 10.1021/acschembio.0c00285 32338867 PMC7309268 Maneiro, M. A. et al. Antibody-PROTAC conjugates enable HER2-dependent targeted protein degradation of BRD4. ACS Chem. Biol. 15 32338867 10.1021/acschembio.0c00285 PMC7309268 130. Poudel YB Thakore RR Chekler EP The new frontier: merging molecular glue degrader and antibody–drug conjugate modalities to overcome strategic challenges J. Med. Chem. 2024 67 15996 16001 10.1021/acs.jmedchem.4c01289 39231796 Poudel, Y. B., Thakore, R. R. & Chekler, E. P. The new frontier: merging molecular glue degrader and antibody–drug conjugate modalities to overcome strategic challenges. J. Med. Chem. 67 39231796 10.1021/acs.jmedchem.4c01289 131. Zhang D Lin P Lin J Molecular glues targeting GSPT1 in cancers: a potent therapy Bioorg. Chem. 2024 143 107000 10.1016/j.bioorg.2023.107000 38029571 Zhang, D., Lin, P. & Lin, J. Molecular glues targeting GSPT1 in cancers: a potent therapy. Bioorg. Chem. 143 38029571 10.1016/j.bioorg.2023.107000 132. Palacino J Abstract 3933: ORM-5029: a first-in-class targeted protein degradation therapy using antibody neodegrader conjugate (AnDC) for HER2-expressing breast cancer Cancer Res. 2022 82 3933 10.1158/1538-7445.AM2022-3933 Palacino, J. et al. Abstract 3933: ORM-5029: a first-in-class targeted protein degradation therapy using antibody neodegrader conjugate (AnDC) for HER2-expressing breast cancer. Cancer Res. 82 133. Hurvitz S. A. et al. Abstract TPS1114: A phase 1, first-in-human, open label, escalation and expansion study of ORM-5029, a highly potent GSPT1 degrader targeting HER2, in patients with HER2-expressing advanced solid tumors. J. Clin. Oncol. 134. Fu C When will the immune-stimulating antibody conjugates (ISACs) be transferred from bench to bedside? Pharmacol. Res. 2024 203 107160 10.1016/j.phrs.2024.107160 38547937 Fu, C. et al. When will the immune-stimulating antibody conjugates (ISACs) be transferred from bench to bedside?. Pharmacol. Res. 203 38547937 10.1016/j.phrs.2024.107160 135. Barber GN STING: infection, inflammation and cancer Nat. Rev. Immunol. 2015 15 760 770 10.1038/nri3921 26603901 PMC5004891 Barber, G. N. STING: infection, inflammation and cancer. Nat. Rev. Immunol. 15 26603901 10.1038/nri3921 PMC5004891 136. Wu Y-T Tumor-targeted delivery of a STING agonist improvescancer immunotherapy Proc. Natl. Acad. Sci. USA 2022 119 e2214278119 10.1073/pnas.2214278119 36442099 PMC9894229 Wu, Y.-T. et al. Tumor-targeted delivery of a STING agonist improvescancer immunotherapy. Proc. Natl. Acad. Sci. USA 119 36442099 10.1073/pnas.2214278119 PMC9894229 137. Bukhalid, R. A. et al. XMT-2056, a HER2-directed STING agonist antibody-drug conjugate, induces innate anti-tumor immune responses by acting on cancer cells and tumor-resident immune cells. Clin. Cancer Res 10.1158/1078-0432.CCR-24-2449 PMC12010966 40029253 138. Metz H SBT6050, a HER2-directed TLR8 therapeutic, as a systemically administered, tumor-targeted human myeloid cell agonist J. Clin. Oncol. 2020 38 3110 3110 10.1200/JCO.2020.38.15_suppl.3110 Metz, H. et al. SBT6050, a HER2-directed TLR8 therapeutic, as a systemically administered, tumor-targeted human myeloid cell agonist. J. Clin. Oncol. 38 139. Klempner, S. et al. 393 A phase 1/2 study of SBT6050 combined with trastuzumab deruxtecan (T-DXd) or trastuzumab and tucatinib with or without capecitabine in patients with HER2-expressing or HER2-amplified cancers. J. Immunother. Cancer 9 140. Dugal-Tessier J Thirumalairajan S Jain N Antibody-oligonucleotide conjugates: a twist to antibody-drug conjugates J. Clin. Med. 2021 10 838 10.3390/jcm10040838 33670689 PMC7922418 Dugal-Tessier, J., Thirumalairajan, S. & Jain, N. Antibody-oligonucleotide conjugates: a twist to antibody-drug conjugates. J. Clin. Med. 10 33670689 10.3390/jcm10040838 PMC7922418 141. Yao Y Targeted delivery of PLK1-siRNA by ScFv suppresses Her2+ breast cancer growth and metastasis Sci. Transl. Med. 2012 4 130ra48 130ra48 10.1126/scitranslmed.3003601 22517885 Yao, Y. et al. Targeted delivery of PLK1-siRNA by ScFv suppresses Her2+ breast cancer growth and metastasis. Sci. Transl. Med. 4 22517885 10.1126/scitranslmed.3003601 142. Deonarain MP Small-format drug conjugates: a viable alternative to ADCs for solid tumours? Antibodies 2018 7 16 10.3390/antib7020016 31544868 PMC6698822 Deonarain, M. P. et al. Small-format drug conjugates: a viable alternative to ADCs for solid tumours?. Antibodies 7 31544868 10.3390/antib7020016 PMC6698822 143. Gu Y Wang Z Wang Y Bispecific antibody drug conjugates: making 1+1>2 Acta Pharm. Sin. B 2024 14 1965 1986 10.1016/j.apsb.2024.01.009 38799638 PMC11119582 Gu, Y., Wang, Z. & Wang, Y. Bispecific antibody drug conjugates: making 1+1>2. Acta Pharm. Sin. B 14 38799638 10.1016/j.apsb.2024.01.009 PMC11119582 144. Kast F Engineering an anti-HER2 biparatopic antibody with a multimodal mechanism of action Nat. Commun. 2021 12 3790 10.1038/s41467-021-23948-6 34145240 PMC8213836 Kast, F. et al. Engineering an anti-HER2 biparatopic antibody with a multimodal mechanism of action. Nat. Commun. 12 34145240 10.1038/s41467-021-23948-6 PMC8213836 145. Li JY A biparatopic HER2-targeting antibody-drug conjugate induces tumor regression in primary models refractory to or ineligible for HER2-targeted therapy Cancer Cell 2016 29 117 129 10.1016/j.ccell.2015.12.008 26766593 Li, J. Y. et al. A biparatopic HER2-targeting antibody-drug conjugate induces tumor regression in primary models refractory to or ineligible for HER2-targeted therapy. Cancer Cell 29 26766593 10.1016/j.ccell.2015.12.008 146. Andreev J Bispecific antibodies and antibody-drug conjugates (ADCs) bridging HER2 and prolactin receptor improve efficacy of HER2 ADCs Mol. Cancer Ther. 2017 16 681 693 10.1158/1535-7163.MCT-16-0658 28108597 Andreev, J. et al. Bispecific antibodies and antibody-drug conjugates (ADCs) bridging HER2 and prolactin receptor improve efficacy of HER2 ADCs. Mol. Cancer Ther. 16 28108597 10.1158/1535-7163.MCT-16-0658 147. Hassani D A novel tumor inhibitory hybridoma monoclonal antibody with dual specificity for HER3 and HER2 Curr. Res. Transl. Med. 2021 69 103277 33639587 10.1016/j.retram.2021.103277 Hassani, D. et al. A novel tumor inhibitory hybridoma monoclonal antibody with dual specificity for HER3 and HER2. Curr. Res. Transl. Med. 69 33639587 10.1016/j.retram.2021.103277 148. Ma Y BL-B01D1, a first-in-class EGFR–HER3 bispecific antibody–drug conjugate, in patients with locally advanced or metastatic solid tumours: a first-in-human, open-label, multicentre, phase 1 study Lancet Oncol. 2024 25 901 911 10.1016/S1470-2045(24)00159-1 38823410 Ma, Y. et al. BL-B01D1, a first-in-class EGFR–HER3 bispecific antibody–drug conjugate, in patients with locally advanced or metastatic solid tumours: a first-in-human, open-label, multicentre, phase 1 study. Lancet Oncol. 25 38823410 10.1016/S1470-2045(24)00159-1 149. Zhang, J. et al. Abstract 302MO: Phase I study of iza-bren (BL-B01D1), an EGFR x HER3 bispecific antibody-drug conjugate (ADC), in patients with locally advanced or metastatic breast cancer (BC). ESMO Open 10 150. Xu R-H Safety and efficacy of TQB2102, a novel bispecific anti-HER2 antibody–drug conjugate, in patients with advanced solid tumors: preliminary data from the first-in-human phase 1 trial J. Clin. Oncol. 2025 43 3003 3003 10.1200/JCO.2025.43.16_suppl.3003 Xu, R.-H. et al. Safety and efficacy of TQB2102, a novel bispecific anti-HER2 antibody–drug conjugate, in patients with advanced solid tumors: preliminary data from the first-in-human phase 1 trial. J. Clin. Oncol. 43 151. Yao H. et al. Abstract e13138: First-in-human study of JSKN016, a bispecific anti-TROP2/HER3 antibody drug conjugate (ADC): antitumor activity in patients (pts) with metastatic triple-negative breast cancer (mTNBC) and safety results. J. Clin. Oncol. 152. Rautio J Meanwell NA Di L Hageman MJ The expanding role of prodrugs in contemporary drug design and development Nat. Rev. Drug Discov. 2018 17 559 587 10.1038/nrd.2018.46 29700501 Rautio, J., Meanwell, N. A., Di, L. & Hageman, M. J. The expanding role of prodrugs in contemporary drug design and development. Nat. Rev. Drug Discov. 17 29700501 10.1038/nrd.2018.46 153. Fu Z Li S Han S Shi C Zhang Y Antibody drug conjugate: the “biological missile” for targeted cancer therapy Signal Transduct. Target. Ther. 2022 7 1 25 35318309 10.1038/s41392-022-00947-7 PMC8941077 Fu, Z., Li, S., Han, S., Shi, C. & Zhang, Y. Antibody drug conjugate: the “biological missile” for targeted cancer therapy. Signal Transduct. Target. Ther. 7 35318309 10.1038/s41392-022-00947-7 PMC8941077 154. Bhagyalalitha M Advances in HER2-targeted therapies: from monoclonal antibodies to dual inhibitors developments in cancer treatment Bioorg. Chem. 2024 151 107695 10.1016/j.bioorg.2024.107695 39137598 Bhagyalalitha, M. et al. Advances in HER2-targeted therapies: from monoclonal antibodies to dual inhibitors developments in cancer treatment. Bioorg. Chem. 151 39137598 10.1016/j.bioorg.2024.107695 155. Zhou C A phase Ia study of a novel anti-HER2 antibody–drug conjugate GQ1001 in patients with previously treated HER2 positive advanced solid tumors J. Transl. Med. 2025 23 37 10.1186/s12967-024-05985-z 39789619 PMC11720520 Zhou, C. et al. A phase Ia study of a novel anti-HER2 antibody–drug conjugate GQ1001 in patients with previously treated HER2 positive advanced solid tumors. J. Transl. Med. 23 39789619 10.1186/s12967-024-05985-z PMC11720520 156. Lu JM Targeting HER2-positive metastatic breast cancer with ARX788, a novel anti-HER2 antibody-drug conjugate in patients whose disease is resistant or refractory to T-DM1, and/or T-DXd, and/or tucatinib-containing regimens J. Clin. Oncol. 2022 40 TPS1112 TPS1112 10.1200/JCO.2022.40.16_suppl.TPS1112 Lu, J. M. et al. Targeting HER2-positive metastatic breast cancer with ARX788, a novel anti-HER2 antibody-drug conjugate in patients whose disease is resistant or refractory to T-DM1, and/or T-DXd, and/or tucatinib-containing regimens. J. Clin. Oncol. 40 157. Hu X ACE-Breast-02: a randomized phase III trial of ARX788 versus lapatinib plus capecitabine for HER2-positive advanced breast cancer Signal Transduct. Target. Ther. 2025 10 56 10.1038/s41392-025-02149-3 39956849 PMC11830773 Hu, X. et al. ACE-Breast-02: a randomized phase III trial of ARX788 versus lapatinib plus capecitabine for HER2-positive advanced breast cancer. Signal Transduct. Target. Ther. 10 39956849 10.1038/s41392-025-02149-3 PMC11830773 158. Hamilton, E. et al. Abstract 298MO: Clinical activity of emiltatug ledadotin (Emi-Le), a B7-H4-directed ADC, in patients with TNBC who received at least one prior topoisomerase-1 inhibitor (Topo-1) ADC. ESMO Open 10 ",
  "metadata": {
    "Title of this paper": "ACE-Breast-02: a randomized phase III trial of ARX788 versus lapatinib plus capecitabine for HER2-positive advanced breast cancer",
    "Journal it was published in:": "NPJ Breast Cancer",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12480482/"
  }
}