{
  "title": "Paper_582",
  "abstract": "pmc Discov Oncol Discov Oncol 4139 discon Discover Oncology 2730-6011 Springer PMC12480298 PMC12480298.1 12480298 12480298 41021077 10.1007/s12672-025-03600-1 3600 1 Analysis Multiomic Mendelian randomization analysis of metabolic gene methylation expression and protein levels in lung adenocarcinoma Wang Qing 1 Liu Gang 1 Zhang Jun 2 Zou Qinguang 21215402@qq.com 3 Geng Junfeng drgengjunfeng@163.com 1 1 https://ror.org/0220qvk04 grid.16821.3c 0000 0004 0368 8293 Department of Thoracic Surgery, Shanghai Chest Hospital, School of Medicine, Shanghai Jiao Tong University, 2 https://ror.org/042g3qa69 grid.440299.2 Department of Thoracic Surgery, The Second People’s Hospital of Weifang, 3 https://ror.org/00vgek070 grid.440230.1 0000 0004 1789 4901 Department of Thoracic Surgery, Jilin Provincial Cancer Hospital, 29 9 2025 12 2025 16 478248 1759 23 2 2025 6 9 2025 29 09 2025 01 10 2025 01 10 2025 © The Author(s) 2025 2025 https://creativecommons.org/licenses/by-nc-nd/4.0/ Open Access http://creativecommons.org/licenses/by-nc-nd/4.0/ Background Metabolic reprogramming is a hallmark of cancer development, including in lung adenocarcinoma (LUAD). This study aimed to explore the relationships between metabolic gene methylation, expression, and protein levels with LUAD risk using Mendelian randomization, leveraging multi-omic data to identify potential molecular targets for early detection and treatment. Methods The study utilized summary-level data from methylation, expression, and protein quantitative trait loci (QTL) studies. Genetic associations with LUAD risk were sourced from the TRICL Consortium for discovery analysis and validated using data from the FinnGen cohort. Mendelian randomization was conducted to evaluate associations between metabolic gene-related molecular features and LUAD risk, while colocalization analyses were performed to assess whether the identified signals shared causal genetic variants. Results The analysis highlighted significant associations between LUAD risk and specific molecular features of metabolic genes. Among these, CHRNA3 emerged as a key gene of interest, with methylation at two sites significantly associated with increased LUAD risk, supported by strong colocalization evidence. Validation in the FinnGen cohort confirmed the association of one methylation site, strengthening its role in LUAD development. Additionally, expression analyses identified FLOT1 and HYKK as genes with moderate but meaningful associations with LUAD risk, with robust colocalization evidence linking their expression to disease susceptibility. Protective associations were observed for specific protein levels, notably for POGLUT3, which displayed a significant inverse relationship with LUAD risk. These findings collectively identify a set of tier 1 metabolic genes, including CHRNA3, FLOT1, HYKK, and POGLUT3, as central players in the metabolic dysregulation underlying LUAD. Conclusion This multi-omic Mendelian randomization study provides compelling evidence of the role of metabolic genes in LUAD risk. Methylation changes in CHRNA3, altered expression of FLOT1 and HYKK, and protective protein levels of POGLUT3 represent key molecular features associated with disease susceptibility. These findings offer valuable insights into potential molecular targets for early LUAD detection and therapeutic strategies. Supplementary Information The online version contains supplementary material available at 10.1007/s12672-025-03600-1. Keywords Lung adenocarcinoma Metabolic gene methylation Gene expression Protein quantification Mendelian randomization CHRNA3 FLOT1 HYKK POGLUT3 Multi-omic insights. Shanghai Chest Hospital Internal Incubation Foundation General Program Shanghai Chest Hospital \"Four-in-One\" Talent Training Program This study was supported by The Medical Engineering Cross research fund of Shanghai Jiaotong University \"Star of Jiaotong University\" program 24X010301595 Liu Gang pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement yes pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes issue-copyright-statement © Springer Science+Business Media LLC, part of Springer Nature 2025 Introduction Lung adenocarcinoma (LUAD) stands as a primary subtype of non-small cell lung cancer NSCLC, which accounts for a significant portion of cancer-related mortalities worldwide [ 1 2 3 5 6 7 The metabolism of cancer cells is markedly reprogrammed to support rapid proliferation and adapt to hypoxic and nutrient-poor environments, a phenomenon well-documented in LUAD [ 8 9 10 11 To dissect the intricate link between LUAD and metabolism, Mendelian Randomization (MR) and Quantitative Trait Loci (QTLs) analyses emerge as powerful tools. MR leverages genetic variation as instrumental variables to infer causality between modifiable risk factors and diseases, bypassing confounding and reverse causation [ 12 13 13 Methods Study design Figure 1 S1  Fig. 1 Study design. Overview of the analytical workflow integrating multiple quantitative trait loci (QTL) datasets. Summary-based Mendelian randomization (SMR) was performed across methylation QTLs, expression QTLs, and protein QTLs in relation to lung adenocarcinoma (LUAD) risk from the TRICL consortium. Significant associations were further evaluated with colocalization analysis (posterior probability of H4, PPH4) and external replication. SMR, summary-based Mendelian randomization; QTL, quantitative trait loci; LUAD, lung adenocarcinoma; TRICL, Transdisciplinary Research Into Cancer of the Lung; PPH4, posterior probability of H4 Data sources of methylation, expression, and protein QTLs The acquisition and integration of multi-omic data are instrumental in decoding the intricate molecular networks implicated in mitochondrial dysfunction in LUAD. QTLs offer insights into how single nucleotide polymorphisms (SNPs) relate to DNA methylation, gene expression, and protein abundance, thereby illuminating the genetic underpinnings of disease. For our study, SNP-CpG associations were sourced from the mQTL data gathered by McRae et al. on 1,980 individuals of European descent [ 14 15 16 To examine the tissue-specific expression of genes with potential causative links to LUAD, we tapped into the Genotype-Tissue Expression (GTEx) portal. The GTEx v8 dataset is a rich compilation of genetic data from 838 donors across 52 tissue types and two cell lines [ 17 Metabolism-related genes were identified using Gene Set Enrichment Analysis (GSEA) C5 oncology gene sets, which contains an updated inventory of 9044 human metabolic genes (See supplementary file 1). Leveraging the inventory, we systematically identified metabolic genes within the QTL datasets. After thorough screening, we identified 6941 methylation genes, 6092 expressed genes, and 950 proteins, each associated with significant instruments (mQTLs, eQTLs, and pQTLs with P − 8 LUAD outcome datasets Summary-level data for LUAD and its two subtypes were obtained from the TRICL, and the FinnGen study. All participants in the TRICL study were of European ancestry and included 11,245 cases and 54,619 controls for LUAD. The LUAD diagnoses were defined according to the International Classification of Diseases (ICD), 9th Revision (ICD-9) and ICD-10. Summary-level data of genetic associations with LUAD and its subtype were also obtained from the publicly available R10 data release of the FinnGen study. The diagnosis of LUAD and its subtype was based on the ICD codes and confirmed by the Social Insurance Institution codes, which totaled 1,590 cases and 314,193 controls for LUAD. The discovery stage of the research utilized the TRICL dataset, while the replication stage involved the utilization of data from the the FinnGen study. There was no sample overlap among these three datasets. Summary-data-based MR analysis Summary-data-based Mendelian randomization (SMR) analysis was employed to evaluate the association of metabolic gene methylation, expression, and protein abundance with the risk of LUAD. This approach utilizes the top associated cis-QTLs, allowing SMR to achieve significantly higher statistical power than traditional MR methods, particularly when the exposure and outcome data originate from two independent large-sample cohorts [ 18 The selection of the top associated cis-QTLs was based on a defined genomic window centered on the target gene (± 1000 kb), with a significance threshold set at P − 8 18 The SMR and HEIDI tests were conducted using the SMR software tool (version 1.3.1) [ 18 Colocalization analysis Colocalization analysis was conducted to ascertain shared causal variants between LUAD and identified metabolic-related mQTLs, eQTLs, or pQTLs using the coloc R package (version 5.2.3) [ 19 For colocalization of pQTL-GWAS [ 20 21 22 23 Integrating results from multi-omics level of evidence To integrate genetic signals across methylation, transcription, and protein levels, we performed SMR for mQTL–eQTL, mQTL–pQTL, and eQTL–pQTL pairs, applying Bonferroni-corrected P-SMR < 0.05 and HEIDI P 24 19 25 26 Results Metabolic gene methylation and LUAD The effects of metabolic gene methylation on LUAD in TRICL Consortium are presented in Figs. 2 S2 P 2 − 25 − 5  Fig. 2 Mendelian randomization associations of metabolic genes with lung adenocarcinoma. Forest plots showing associations of A B C D The validation study using FinnGen data yielded significant results for methylation at CpG probes in relation to LUAD risk (Table S3). The methylation at probe cg04882995 on the CHRNA3 gene is associated with an increased risk of LUAD (OR 1.442, 95% CI 1.287–1.617) with strong statistical significance ( P − 10 P − 5 P P P P p p P Metabolic gene expression and LUAD In 6092 eGene-SNP pairs, we identified a total of 435 eQTLs with a standard of P-HEIDI higher than 0.01 and P-SMR less than 0,05. After Bonferroni adjustment for multiple comparisons, 7 eQTLs remained (Table S4 and Fig. 2 In the FinnGen validation cohort for metabolic gene expression (eQTL) and LUAD, the results varied compared to the primary cohort (Table S5). For FLOT1 and IER3, the ORs were 1.039 (95% CI 0.837–1.291, P P P P P P − 6 P We further explored causal associations of the expression of metabolic genes with LUAD in lung tissue (Fig. 2 − 9 Metabolic protein and LUAD There was a total of 67 pQTLs left after a filtration of P-HEIDI higher than 0.01 and P-SMR less than 0,05 (Table S7), while three metabolic gene encoded protein showed significance after multiple adjustment with Bonferroni method. PCYOX1 displayed a negative beta, indicating a protective effect against LUAD with an odds ratio (OR) of 0.889 (95% CI 0.837–0.944), with a post-Bonferroni adjusted P-value of 0.0076 and a high PPH4 of 0.918, suggesting strong colocalization. SFTPB also showed a negative association with an OR of 0.838 (95% CI 0.772–0.909) and a significant post-Bonferroni P-value of 0.0014, accompanied by an even higher PPH4 of 0.980, indicating very strong evidence of colocalization. POGLUT3’s expression was inversely correlated with LUAD risk (OR 0.803, 95% CI 0.725–0.89), and this remained significant after Bonferroni adjustment with a P-value of 0.0018, along with a PPH4 of 0.984, supporting strong colocalization. The SMR regional plot and colocalization stack association plot of predicted metabolic gene protein was shown in Fig. 3  Fig. 3 Regional association and colocalization plots of representative metabolic gene proteins. ( A C E B D F In the FinnGen cohort validation study (Table S8-9), POGLUT3 showed a strong negative association with LUAD, with a substantial decrease in risk (OR 0.576, 95% CI 0.419–0.79, P P P Multi-omics evidence of metabolic genes and LUAD In MR analyses aimed at understanding the impact of genetically predicted methylation, expression, and protein levels on LUAD risk, the candidate metabolic genes PCYOX1, SFTPB, and POGLUT3 demonstrated varying results (Table 1 P P P P P − 4 P P − 5 p P − 5 2 P  Table 1 Genetically predicted methylation, expression, and protein of candidate metabolic gene with LUAD in Mendelian randomization analysis Gene mQTL eQTL pQTL Probe OR (95%CI) P-value* OR (95%CI) P-value* OR (95%CI) P-value* PCYOX1 cg06620837 1.079(0.943–1.234) 0.269 1.027(0.8–1.319) 0.834 0.889(0.837–0.944) 1.21E-04 cg12850242 0.876(0.795–0.964) 0.007 cg21989299 0.863(0.791–0.941) 0.001 cg22701032 0.856(0.765–0.958) 0.007 SFTPB cg03380645 0.971(0.846–1.116) 0.681 1.38(1.05–1.813) 0.021 0.838(0.772–0.909) 2.30E-05 cg07313956 0.962(0.871–1.061) 0.438 cg26394380 0.992(0.953–1.032) 0.680 POGLUT3 cg11658159 0.99(0.845–1.16) 0.904 0.989(0.93–1.052) 0.724 0.803(0.725–0.89) 2.88E-05 cg14473297 0.982(0.886–1.088) 0.723 cg24473292 0.992(0.877–1.122) 0.897 LUAD, Lung adenocarcinoma; QTL, quantitative trait loci. *un-adjusted P-SMR value  Table 2 Association between methylation and expression, methylation and protein abundance, expression and protein abundance of metabolism-related genes Gene mQTL → eQTL mQTL → pQTL eQTL → pQTL Probe Beta SE P-value* Beta SE P-value* Beta SE P-value* PCYOX1 cg22701032 -0.112 0.037 2.681E-03 0.613 0.032 1.78E-80 0.170 0.017 1.18E-23 cg21989299 -0.102 0.034 2.657E-03 0.535 0.026 5.47E-93 cg12850242 -0.272 0.025 4.142E-28 0.583 0.028 3.46E-93 cg06620837 -0.478 0.069 3.759E-12 -0.819 0.105 6.19E-15 SFTPB cg03380645 0.281 0.050 2.162E-08 -0.234 0.035 3.20E-11 -1.235 0.095 6.96E-39 cg07313956 -0.271 0.036 9.844E-14 0.114 0.034 7.86E-04 cg26394380 0.078 0.024 1.232E-03 0.266 0.033 6.82E-16 POGLUT3 cg14473297 1.585 0.114 3.728E-44 0.571 0.114 4.98E-07 0.369 0.088 2.77E-05 cg24473292 0.042 0.038 2.679E-01 0.405 0.064 2.97E-10 cg11658159 -0.006 0.045 8.929E-01 0.613 0.032 1.78E-80 QTL, quantitative trait loci; SE, standard error. *un-adjusted P-SMR value In the results of our MR analysis, we delineated the relationship between genetically predicted methylation (mQTL), expression (eQTL), and protein levels (pQTL) of candidate metabolic genes and their associations with LUAD risk. The genes were stratified into three tiers based on the strength of their association and evidence of colocalization (Fig. 4  Fig. 4 Hierarchical classification of metabolic genes associated with lung adenocarcinoma. Graphical summary of the three-tier evidence framework. Tier 3 includes genes supported only by significant SMR associations; Tier 2 requires both SMR significance and high colocalization probability (PPH4 > 0.70); Tier 1 comprises Tier 2 genes replicated in external datasets (FinnGen or GTEx). LUAD, lung adenocarcinoma; QTL, quantitative trait loci Discussion In our investigation into LUAD, a significant connection emerged between metabolic gene regulation and disease risk, highlighting the gene CHRNA3 as a pivotal element. Notably, two methylation sites on CHRNA3—cg04882995 and cg24506363—exhibited a marked increase in LUAD risk, with compelling colocalization evidence underscoring their potential role in the disease’s pathogenesis. The expression analyses of genes FLOT1 and HYKK also revealed a moderate elevation in risk, further substantiated by robust colocalization data. In contrast, the protein levels of PCYOX1, SFTPB, and POGLUT3 presented a protective association against LUAD. These pivotal findings, particularly the significant methylation sites on CHRNA3 and the differential expression and protein quantifications of FLOT1, HYKK, and POGLUT3, pave the way for a deeper understanding of LUAD’s etiology and present promising targets for early detection and therapeutic intervention. DNA methylation, an epigenetic mechanism regulating gene expression, has been extensively documented for its role in cancer pathogenesis, including LUAD [ 27 29 27 30 31 32 28 33 34 35 Expression analysis is a critical tool in elucidating the role of specific genes in disease pathogenesis. Our study focuses on the genes FLOT1 and HYKK, which have shown a substantial relationship with LUAD risk, highlighting their potential involvement in LUAD development and progression. FLOT1, a lipid raft-associated scaffolding protein, has been shown to drive tumor cell proliferation and growth. FLOT1 is involved in endocytosis and signal transduction, and previous studies have shown its role in cancer progression via the PI3K-AKT-ERK1/2-P70S6K pathway [ 36 37 38 39 39 40 POGLUT3 has been identified as a gene of significant interest in the study of LUAD given its role in protein modification and its implications in cellular signaling pathways. Our research brings to light its involvement in LUAD pathogenesis, with expression analysis indicating a protective association against LUAD (OR 0.803, 95% CI 0.725–0.89), which remained significant after adjustment for multiple comparisons​​. POGLUT3, known for its activity as a protein O-glucosyltransferase, has been implicated in modifying Notch receptor EGF repeats, influencing Notch signaling, a pathway known for its contributions to cancer development, including LUAD​​ [ 41 42 43 41 42 Our study leverages the strengths of MR and colocalization analyses to infer the causal effects of metabolic gene methylation, expression, and protein abundance on LUAD risk. This approach, enhanced by the integration of multi-omic data, strengthens the causal relationships between specific metabolic genes and LUAD, while reducing bias from confounding and reverse causality. Utilizing large-scale GWAS datasets also improves our statistical power, adding robustness to our findings across multiple datasets. However, there are important limitations to consider. First, the gene CHRNA3, one of our key findings, is well known to be strongly associated with smoking behavior, which is itself a major risk factor for LUAD. Because our analyses relied on summary-level data, we were unable to directly adjust for smoking status. This raises the possibility of residual confounding due to shared genetic architecture between smoking behavior and lung cancer risk. While MR and colocalization approaches are designed to mitigate traditional confounding, they cannot fully eliminate the influence of pleiotropic pathways such as those related to smoking. Unfortunately, sensitivity analyses stratified by smoking status or incorporating smoking-related instruments were not feasible with the available datasets, and we acknowledge this as a key limitation that warrants cautious interpretation. Future studies with access to individual-level data and stratified analyses could help disentangle direct genetic effects from smoking-mediated effects. Second, the scope of metabolic-related proteins in our pQTL dataset was not comprehensive, potentially omitting significant proteins affecting LUAD risk. Third, interpreting colocalization probabilities (PPH4) demands caution, as low PPH4 values, especially when accompanied by low PPH3, might reflect insufficient statistical power rather than a definitive lack of colocalization. Finally, a further limitation is the inconsistency of covariate assessment in the QTL models across different cohorts. Since the QTL data were derived from independent studies, variations existed in the covariates adjusted for in each dataset, potentially influencing the reliability of causal inference drawn from MR analyses. This inconsistency could introduce residual confounding, reducing comparability across results. Therefore, interpretation of our findings requires caution, as unmeasured or inadequately adjusted covariates may influence the observed associations. Future studies should aim for harmonization of covariate adjustments across datasets or explicitly explore the sensitivity of MR results to variations in covariate adjustments. Last, it is important to note that our entire analysis was based on European ancestry datasets (TRICL and FinnGen). While this design reduces population stratification within analyses, it may limit the generalizability of our findings to other ethnic groups. Genetic architecture, allele frequencies, and linkage disequilibrium patterns vary substantially across populations, and therefore causal inferences derived here may not fully capture risk mechanisms in non-European ancestries. Taken together, these aspects highlight important limitations and opportunities for further research to deepen our understanding of LUAD’s complex etiology. In conclusion, this Mendelian randomization MR study provides evidence supporting potential causal relationships between metabolic gene methylation, expression, and protein abundance and the risk of LUAD. By integrating multi-omic data, the study contributes to a more comprehensive understanding of the molecular mechanisms that may underlie LUAD development. The findings highlight several metabolism-related genes that warrant further investigation as potential biomarkers or therapeutic targets in the context of LUAD. Supplementary Information Below is the link to the electronic supplementary material.  Supplementary Material 1  Supplementary Material 2 Abbreviations LUAD Lung adenocarcinoma NSCLC Non-small cell lung cancer MR Mendelian randomization QTLs Quantitative trait loci mQTLs Methylation quantitative trait loci eQTLs Expression quantitative trait loci pQTLs Protein quantitative trait loci GWAS Genome-wide association study TRICL Transdisciplinary research into cancer of the lung SNPs Single nucleotide polymorphisms GTEx Genotype-tissue expression GSEA Gene set enrichment analysis ICD International classification of diseases SMR Summary-data-based Mendelian randomization LD Linkage disequilibrium HEIDI Heterogeneity in dependent instruments PPH4 Posterior probability hypothesis 4 nAChRs Nicotinic acetylcholine receptors Publisher’s note Springer Nature remains neutral with regard to jurisdictional claims in published maps and institutional affiliations. Qing Wang, Gang Liu and Jun Zhang contributed equally to this work. Acknowledgements We thank all participants and investigator involved in the McRae AF. et al. genome-wide association analysis on methylation, the eQTLGen consortium, the Genotype-Tissue Expression (GTEx) project, Ferkingstad E. et al. genome-wide association analysis on proteome, the TRICL, the FinnGen study for sharing data. We thank Dr. Lv and Dr. Liu for their help in instruction for SMR and Colocalization analysis. Research registration unique identifying number (UIN) Not applicable. Provenance and peer review Not applicable. Author contributions QW, and GL contributed equally to the conception and design of the study. QW, and JZ collected, analyzed, and interpreted the multi-omic data. QW and QZ drafted the initial version of the manuscript. JG supervised the study, provided critical intellectual input, and revised the manuscript for important intellectual content. All authors reviewed and approved the final manuscript. Data availability Summary data used for this study can be accessed through the following links: mQTL dataset by McRae et al. at PubMed ID 30514905; eQTL dataset from the eQTLGen Consortium at https://www.eqtlgen.org/cis-eqtls.html; Tissue-specific eQTL data from The Genotype-Tissue Expression project at https://gtexportal.org/home/datasets; pQTL dataset by Ferkingstad et al. at PubMed ID 34857953; Lung adenocarcinoma data from the Transdisciplinary Research Into Cancer of the Lung (TRICL) at https://gwas.mrcieu.ac.uk/datasets/ieu-a-984/ and The FinnGen study at [https://storage.googleapis.com/finngen-public-data-r10/summary\\_stats/finngen\\_R10\\_C3\\_NSCLC\\_ADENO\\_EXALLC.gz](https:/storage.googleapis.com/finngen-public-data-r10/summary_stats/finngen_R10_C3_NSCLC_ADENO_EXALLC.gz) .The analysis scripts and code used in this study are publicly available on GitHub at: https://github.com/drpillawang/LUAD-MultiOmics-MR. Declarations Ethics approval and consent to participate There was no need to get informed consent or ethical approval for this study again because all of the data were taken from published sources, and the informed consent and approval were received. Consent for publication Not applicable. Competing interests The authors declare no competing interests. References 1. Jokhadze N, Das A, Dizon DS. Global cancer statistics: A healthy population relies on population health. CA Cancer J Clin. 2024. 10.3322/caac.21838 38572764 2. Chen P Liu Y Wen Y Zhou C Non-small cell lung cancer in China Cancer Commun (Lond) 2022 42 10 937 70 10.1002/cac2.12359 36075878 PMC9558689 Chen P, Liu Y, Wen Y, Zhou C. Non-small cell lung cancer in China. Cancer Commun (Lond). 2022;42(10):937–70. 36075878 10.1002/cac2.12359 PMC9558689 3. Xi Y, Xi L, Tan J, Yu C, Shen W, Yu B. Comprehensive analysis of lung adenocarcinoma: unveiling differential gene expression, survival-linked genes, subtype stratification, and immune landscape implications. Environ Toxicol. 2024. 10.1002/tox.24282 38619376 4. Wen S Peng W Chen Y Du X Xia J Shen B Four differentially expressed genes can predict prognosis and microenvironment immune infiltration in lung cancer: a study based on data from the GEO BMC Cancer 2022 22 1 193 10.1186/s12885-022-09296-8 35184748 PMC8859904 Wen S, Peng W, Chen Y, Du X, Xia J, Shen B, et al. Four differentially expressed genes can predict prognosis and microenvironment immune infiltration in lung cancer: a study based on data from the GEO. BMC Cancer. 2022;22(1):193. 35184748 10.1186/s12885-022-09296-8 PMC8859904 5. Dai Z-T, Wang J, Zhao K, Xiang Y, Li JP, Zhang H-M et al. Integrated TCGA and GEO analysis showed that SMAD7 is an independent prognostic factor for lung adenocarcinoma. Medicine. 2020;99(44). 10.1097/MD.0000000000022861 PMC7598801 33126329 6. Kondo KK Rahman B Ayers CK Relevo R Griffin JC Halpern MT Lung cancer diagnosis and mortality beyond 15 years since quit in individuals with a 20 + pack-year history: A systematic review CA Cancer J Clin 2024 74 1 84 114 37909870 10.3322/caac.21808 Kondo KK, Rahman B, Ayers CK, Relevo R, Griffin JC, Halpern MT. Lung cancer diagnosis and mortality beyond 15 years since quit in individuals with a 20 + pack-year history: A systematic review. CA Cancer J Clin. 2024;74(1):84–114. 37909870 10.3322/caac.21808 7. Casolino R, Beer PA, Chakravarty D, Davis MB, Malapelle U, Mazzarella L et al. Interpreting and integrating genomic tests results in clinical cancer care: overview and practical guidance. CA Cancer J Clin. 2024. 10.3322/caac.21825 38174605 8. Martínez-Reyes I Chandel NS Cancer metabolism: looking forward Nat Rev Cancer 2021 21 10 669 80 10.1038/s41568-021-00378-6 34272515 Martínez-Reyes I, Chandel NS. Cancer metabolism: looking forward. Nat Rev Cancer. 2021;21(10):669–80. 34272515 10.1038/s41568-021-00378-6 9. Icard P Simula L Fournel L Leroy K Lupo A Damotte D The strategic roles of four enzymes in the interconnection between metabolism and oncogene activation in non-small cell lung cancer: therapeutic implications Drug Resist Updat 2022 63 100852 10.1016/j.drup.2022.100852 35849943 Icard P, Simula L, Fournel L, Leroy K, Lupo A, Damotte D, et al. The strategic roles of four enzymes in the interconnection between metabolism and oncogene activation in non-small cell lung cancer: therapeutic implications. Drug Resist Updat. 2022;63:100852. 35849943 10.1016/j.drup.2022.100852 10. Kannampuzha S, Mukherjee AG, Wanjari UR, Gopalakrishnan AV, Murali R, Namachivayam A et al. A systematic role of metabolomics, metabolic pathways, and chemical metabolism in lung cancer. Vaccines (Basel). 2023;11(2). 10.3390/vaccines11020381 PMC9960365 36851259 11. Mariën H, Derveaux E, Vanhove K, Adriaensens P, Thomeer M, Mesotten L. Changes in metabolism as a diagnostic tool for lung cancer. Syst Rev Metabolites. 2022;12(6). 10.3390/metabo12060545 PMC9229104 35736478 12. Jin C, Lee B, Shen L, Long Q. Integrating multi-omics summary data using a Mendelian randomization framework. Brief Bioinform. 2022;23(6). 10.1093/bib/bbac376 PMC9677504 36094096 13. Zhang Z Fang T Chen L Ji F Chen J Multi-omics Mendelian randomization integrating GWAS, eQTL, and mQTL data identified genes associated with breast cancer Am J Cancer Res 2024 14 3 1433 45 10.62347/BCZW1355 38590415 PMC10998764 Zhang Z, Fang T, Chen L, Ji F, Chen J. Multi-omics Mendelian randomization integrating GWAS, eQTL, and mQTL data identified genes associated with breast cancer. Am J Cancer Res. 2024;14(3):1433–45. 38590415 10.62347/BCZW1355 PMC10998764 14. McRae AF Marioni RE Shah S Yang J Powell JE Harris SE Identification of 55,000 replicated DNA methylation QTL Sci Rep 2018 8 1 17605 10.1038/s41598-018-35871-w 30514905 PMC6279736 McRae AF, Marioni RE, Shah S, Yang J, Powell JE, Harris SE, et al. Identification of 55,000 replicated DNA methylation QTL. Sci Rep. 2018;8(1):17605. 30514905 10.1038/s41598-018-35871-w PMC6279736 15. Võsa U Claringbould A Westra H-J Bonder MJ Deelen P Zeng B Large-scale cis- and trans-eQTL analyses identify thousands of genetic loci and polygenic scores that regulate blood gene expression Nat Genet 2021 53 9 1300 10 10.1038/s41588-021-00913-z 34475573 PMC8432599 Võsa U, Claringbould A, Westra H-J, Bonder MJ, Deelen P, Zeng B, et al. Large-scale cis- and trans-eQTL analyses identify thousands of genetic loci and polygenic scores that regulate blood gene expression. Nat Genet. 2021;53(9):1300–10. 34475573 10.1038/s41588-021-00913-z PMC8432599 16. Ferkingstad E Sulem P Atlason BA Sveinbjornsson G Magnusson MI Styrmisdottir EL Large-scale integration of the plasma proteome with genetics and disease Nat Genet 2021 53 12 1712 21 10.1038/s41588-021-00978-w 34857953 Ferkingstad E, Sulem P, Atlason BA, Sveinbjornsson G, Magnusson MI, Styrmisdottir EL, et al. Large-scale integration of the plasma proteome with genetics and disease. Nat Genet. 2021;53(12):1712–21. 34857953 10.1038/s41588-021-00978-w 17. Consortium G The GTEx consortium atlas of genetic regulatory effects across human tissues Science 2020 369 6509 1318 30 10.1126/science.aaz1776 32913098 PMC7737656 Consortium G. The GTEx consortium atlas of genetic regulatory effects across human tissues. Science. 2020;369(6509):1318–30. 32913098 10.1126/science.aaz1776 PMC7737656 18. Zhu Z Zhang F Hu H Bakshi A Robinson MR Powell JE Integration of summary data from GWAS and eQTL studies predicts complex trait gene targets Nat Genet 2016 48 5 481 7 10.1038/ng.3538 27019110 Zhu Z, Zhang F, Hu H, Bakshi A, Robinson MR, Powell JE, et al. Integration of summary data from GWAS and eQTL studies predicts complex trait gene targets. Nat Genet. 2016;48(5):481–7. 27019110 10.1038/ng.3538 19. Giambartolomei C Vukcevic D Schadt EE Franke L Hingorani AD Wallace C Bayesian test for colocalisation between pairs of genetic association studies using summary statistics PLoS Genet 2014 10 5 e1004383 10.1371/journal.pgen.1004383 24830394 PMC4022491 Giambartolomei C, Vukcevic D, Schadt EE, Franke L, Hingorani AD, Wallace C, et al. Bayesian test for colocalisation between pairs of genetic association studies using summary statistics. PLoS Genet. 2014;10(5):e1004383. 24830394 10.1371/journal.pgen.1004383 PMC4022491 20. Yoshiji S Butler-Laporte G Lu T Willett JDS Su C-Y Nakanishi T Proteome-wide Mendelian randomization implicates nephronectin as an actionable mediator of the effect of obesity on COVID-19 severity Nat Metabolism 2023 5 2 248 64 10.1038/s42255-023-00742-w PMC9940690 36805566 Yoshiji S, Butler-Laporte G, Lu T, Willett JDS, Su C-Y, Nakanishi T, et al. Proteome-wide Mendelian randomization implicates nephronectin as an actionable mediator of the effect of obesity on COVID-19 severity. Nat Metabolism. 2023;5(2):248–64. 10.1038/s42255-023-00742-w PMC9940690 36805566 21. Mohammadi Pejman 5 6 park YoSon 11 Parsana princy 12 Segrè Ayellet V. 1 strober Benjamin J. 9 Zappala Zachary 7 8 gclaafbaacsedjrhyjb, P. 19 volpi Simona 19 npmaagpkslarlncmhmrasj, 16 PSLBMEBPA, 137 NCFNCR. Genetic effects on gene expression across human tissues Nature 2017 550 7675 204 13 29022597 10.1038/nature24277 PMC5776756 Mohammadi, Pejman. 5 6 park YoSon 11 Parsana princy 12 Segrè Ayellet V. 1 strober Benjamin J. 9 Zappala Zachary 7 8 gclaafbaacsedjrhyjb, P. 19 volpi Simona 19 npmaagpkslarlncmhmrasj, 16 PSLBMEBPA, 137 NCFNCR. Genetic effects on gene expression across human tissues. Nature. 2017;550(7675):204–13. 29022597 10.1038/nature24277 PMC5776756 22. Morrow JD Glass K Cho MH Hersh CP Pinto-Plata V Celli B Human lung DNA methylation quantitative trait loci colocalize with chronic obstructive pulmonary disease Genome-Wide association loci Am J Respir Crit Care Med 2018 197 10 1275 84 10.1164/rccm.201707-1434OC 29313708 PMC5955059 Morrow JD, Glass K, Cho MH, Hersh CP, Pinto-Plata V, Celli B, et al. Human lung DNA methylation quantitative trait loci colocalize with chronic obstructive pulmonary disease Genome-Wide association loci. Am J Respir Crit Care Med. 2018;197(10):1275–84. 29313708 10.1164/rccm.201707-1434OC PMC5955059 23. Chen J Ruan X Sun Y Lu S Hu S Yuan S Multi-omic insight into the molecular networks of mitochondrial dysfunction in the pathogenesis of inflammatory bowel disease EBioMedicine 2024 99 104934 10.1016/j.ebiom.2023.104934 38103512 PMC10765009 Chen J, Ruan X, Sun Y, Lu S, Hu S, Yuan S, et al. Multi-omic insight into the molecular networks of mitochondrial dysfunction in the pathogenesis of inflammatory bowel disease. EBioMedicine. 2024;99:104934. 38103512 10.1016/j.ebiom.2023.104934 PMC10765009 24. Pavlides JM Zhu Z Gratten J McRae AF Wray NR Yang J Predicting gene targets from integrative analyses of summary data from GWAS and eQTL studies for 28 human complex traits Genome Med 2016 8 1 84 10.1186/s13073-016-0338-4 27506385 PMC4979185 Pavlides JM, Zhu Z, Gratten J, McRae AF, Wray NR, Yang J. Predicting gene targets from integrative analyses of summary data from GWAS and eQTL studies for 28 human complex traits. Genome Med. 2016;8(1):84. 27506385 10.1186/s13073-016-0338-4 PMC4979185 25. Wallace C Eliciting priors and relaxing the single causal variant assumption in colocalisation analyses PLoS Genet 2020 16 4 e1008720 10.1371/journal.pgen.1008720 32310995 PMC7192519 Wallace C. Eliciting priors and relaxing the single causal variant assumption in colocalisation analyses. PLoS Genet. 2020;16(4):e1008720. 32310995 10.1371/journal.pgen.1008720 PMC7192519 26. Hemani G Bowden J Davey Smith G Evaluating the potential role of Pleiotropy in Mendelian randomization studies Hum Mol Genet 2018 27 R2 R195 208 10.1093/hmg/ddy163 29771313 PMC6061876 Hemani G, Bowden J, Davey Smith G. Evaluating the potential role of Pleiotropy in Mendelian randomization studies. Hum Mol Genet. 2018;27(R2):R195–208. 29771313 10.1093/hmg/ddy163 PMC6061876 27. Nishiyama A Nakanishi M Navigating the DNA methylation landscape of cancer Trends Genet 2021 37 11 1012 27 10.1016/j.tig.2021.05.002 34120771 Nishiyama A, Nakanishi M. Navigating the DNA methylation landscape of cancer. Trends Genet. 2021;37(11):1012–27. 34120771 10.1016/j.tig.2021.05.002 28. Shu M, Huang L, Chen Y, Wang Y, Xie Z, Li S et al. Identification of a DNA-methylome-based signature for prognosis prediction in driver gene-negative lung adenocarcinoma. Cancer Lett. 2024:216835. 10.1016/j.canlet.2024.216835 38548216 29. Dasgupta S Systems biology and machine learning identify genetic overlaps between lung cancer and gastroesophageal reflux disease OMICS 2024 28 10 492 503 10.1089/omi.2024.0150 39269895 Dasgupta S. Systems biology and machine learning identify genetic overlaps between lung cancer and gastroesophageal reflux disease. OMICS. 2024;28(10):492–503. 39269895 10.1089/omi.2024.0150 30. Fahrmann JF Grapov DD Wanichthanarak K DeFelice BC Salemi MR Rom WN Integrated metabolomics and proteomics highlight altered Nicotinamide- and polyamine pathways in lung adenocarcinoma Carcinogenesis 2017 38 3 271 80 28049629 10.1093/carcin/bgw205 PMC5862279 Fahrmann JF, Grapov DD, Wanichthanarak K, DeFelice BC, Salemi MR, Rom WN, et al. Integrated metabolomics and proteomics highlight altered Nicotinamide- and polyamine pathways in lung adenocarcinoma. Carcinogenesis. 2017;38(3):271–80. 28049629 10.1093/carcin/bgw205 PMC5862279 31. Yang L Yang Z Zuo C Lv X Liu T Jia C Epidemiological evidence for associations between variants in CHRNA genes and risk of lung cancer and chronic obstructive pulmonary disease Front Oncol 2022 12 1001864 10.3389/fonc.2022.1001864 36276121 PMC9582127 Yang L, Yang Z, Zuo C, Lv X, Liu T, Jia C, et al. Epidemiological evidence for associations between variants in CHRNA genes and risk of lung cancer and chronic obstructive pulmonary disease. Front Oncol. 2022;12:1001864. 36276121 10.3389/fonc.2022.1001864 PMC9582127 32. Pérez-Morales R González-Zamora A González-Delgado MF Calleros Rincón EY Olivas Calderón EH Martínez-Ramírez OC CHRNA3 rs1051730 and CHRNA5 rs16969968 polymorphisms are associated with heavy smoking, lung cancer, and chronic obstructive pulmonary disease in a Mexican population Ann Hum Genet 2018 82 6 415 24 10.1111/ahg.12264 29993116 Pérez-Morales R, González-Zamora A, González-Delgado MF, Calleros Rincón EY, Olivas Calderón EH, Martínez-Ramírez OC, et al. CHRNA3 rs1051730 and CHRNA5 rs16969968 polymorphisms are associated with heavy smoking, lung cancer, and chronic obstructive pulmonary disease in a Mexican population. Ann Hum Genet. 2018;82(6):415–24. 29993116 10.1111/ahg.12264 33. Le Marchand L Derby KS Murphy SE Hecht SS Hatsukami D Carmella SG Smokers with the CHRNA lung cancer-associated variants are exposed to higher levels of nicotine equivalents and a carcinogenic tobacco-specific Nitrosamine Cancer Res 2008 68 22 9137 40 10.1158/0008-5472.CAN-08-2271 19010884 PMC2587068 Le Marchand L, Derby KS, Murphy SE, Hecht SS, Hatsukami D, Carmella SG, et al. Smokers with the CHRNA lung cancer-associated variants are exposed to higher levels of nicotine equivalents and a carcinogenic tobacco-specific Nitrosamine. Cancer Res. 2008;68(22):9137–40. 19010884 10.1158/0008-5472.CAN-08-2271 PMC2587068 34. Balassiano K Lima S Jenab M Overvad K Tjonneland A Boutron-Ruault MC Aberrant DNA methylation of cancer-associated genes in gastric cancer in the European prospective investigation into cancer and nutrition (EPIC–EURGAST) Cancer Lett 2011 311 1 85 95 10.1016/j.canlet.2011.06.038 21831520 Balassiano K, Lima S, Jenab M, Overvad K, Tjonneland A, Boutron-Ruault MC, et al. Aberrant DNA methylation of cancer-associated genes in gastric cancer in the European prospective investigation into cancer and nutrition (EPIC–EURGAST). Cancer Lett. 2011;311(1):85–95. 21831520 10.1016/j.canlet.2011.06.038 35. Berrettini WH Doyle GA The CHRNA5-A3-B4 gene cluster in nicotine addiction Mol Psychiatry 2012 17 9 856 66 10.1038/mp.2011.122 21968931 Berrettini WH, Doyle GA. The CHRNA5-A3-B4 gene cluster in nicotine addiction. Mol Psychiatry. 2012;17(9):856–66. 21968931 10.1038/mp.2011.122 36. Yu W Liang J Fang T Jiang J Zhao R Li R EIF4A3 acts on the PI3K-AKT-ERK1/2-P70S6K pathway through FLOT1 to influence the development of lung adenocarcinoma Mol Cancer Res 2023 21 7 713 25 10.1158/1541-7786.MCR-22-0984 37011005 PMC10320473 Yu W, Liang J, Fang T, Jiang J, Zhao R, Li R, et al. EIF4A3 acts on the PI3K-AKT-ERK1/2-P70S6K pathway through FLOT1 to influence the development of lung adenocarcinoma. Mol Cancer Res. 2023;21(7):713–25. 37011005 10.1158/1541-7786.MCR-22-0984 PMC10320473 37. Arkhipova KA Sheyderman AN Laktionov KK Mochalnikova VV Zborovskaya IB Simultaneous expression of flotillin-1, flotillin-2, stomatin and caveolin-1 in non-small cell lung cancer and soft tissue sarcomas BMC Cancer 2014 14 100 10.1186/1471-2407-14-100 24533441 PMC3936811 Arkhipova KA, Sheyderman AN, Laktionov KK, Mochalnikova VV, Zborovskaya IB. Simultaneous expression of flotillin-1, flotillin-2, stomatin and caveolin-1 in non-small cell lung cancer and soft tissue sarcomas. BMC Cancer. 2014;14:100. 24533441 10.1186/1471-2407-14-100 PMC3936811 38. Lin C Wu Z Lin X Yu C Shi T Zeng Y Knockdown of FLOT1 impairs cell proliferation and tumorigenicity in breast cancer through upregulation of FOXO3a Clin Cancer Res 2011 17 10 3089 99 10.1158/1078-0432.CCR-10-3068 21447726 Lin C, Wu Z, Lin X, Yu C, Shi T, Zeng Y, et al. Knockdown of FLOT1 impairs cell proliferation and tumorigenicity in breast cancer through upregulation of FOXO3a. Clin Cancer Res. 2011;17(10):3089–99. 21447726 10.1158/1078-0432.CCR-10-3068 39. Wang J Liu Q Yuan S Xie W Liu Y Xiang Y Genetic predisposition to lung cancer: comprehensive literature integration, meta-analysis, and multiple evidence assessment of candidate-gene association studies Sci Rep 2017 7 1 8371 10.1038/s41598-017-07737-0 28827732 PMC5567126 Wang J, Liu Q, Yuan S, Xie W, Liu Y, Xiang Y, et al. Genetic predisposition to lung cancer: comprehensive literature integration, meta-analysis, and multiple evidence assessment of candidate-gene association studies. Sci Rep. 2017;7(1):8371. 28827732 10.1038/s41598-017-07737-0 PMC5567126 40. Liang X, Tong X, Miao Y, Xue X, Liu A, Guan F. Effect of smoking cessation medications on intracranial aneurysm risk: A Mendelian randomization study. Tob Induc Dis. 2024;22. 10.18332/tid/186171 PMC11059939 38690207 41. Williamson DB Haltiwanger RS Identification, function, and biological relevance of POGLUT2 and POGLUT3 Biochem Soc Trans 2022 50 2 1003 12 10.1042/BST20210850 35411374 Williamson DB, Haltiwanger RS. Identification, function, and biological relevance of POGLUT2 and POGLUT3. Biochem Soc Trans. 2022;50(2):1003–12. 35411374 10.1042/BST20210850 42. Takeuchi H Schneider M Williamson DB Ito A Takeuchi M Handford PA Two novel protein O-glucosyltransferases that modify sites distinct from POGLUT1 and affect Notch trafficking and signaling Proc Natl Acad Sci U S A 2018 115 36 E8395 402 10.1073/pnas.1804005115 30127001 PMC6130362 Takeuchi H, Schneider M, Williamson DB, Ito A, Takeuchi M, Handford PA, et al. Two novel protein O-glucosyltransferases that modify sites distinct from POGLUT1 and affect Notch trafficking and signaling. Proc Natl Acad Sci U S A. 2018;115(36):E8395–402. 30127001 10.1073/pnas.1804005115 PMC6130362 43. Williamson DB Sohn CJ Ito A Haltiwanger RS POGLUT2 and POGLUT3 O-glucosylate multiple EGF repeats in fibrillin-1, -2, and LTBP1 and promote secretion of fibrillin-1 J Biol Chem 2021 297 3 101055 10.1016/j.jbc.2021.101055 34411563 PMC8405936 Williamson DB, Sohn CJ, Ito A, Haltiwanger RS. POGLUT2 and POGLUT3 O-glucosylate multiple EGF repeats in fibrillin-1, -2, and LTBP1 and promote secretion of fibrillin-1. J Biol Chem. 2021;297(3):101055. 34411563 10.1016/j.jbc.2021.101055 PMC8405936 ",
  "metadata": {
    "Title of this paper": "POGLUT2 and POGLUT3 O-glucosylate multiple EGF repeats in fibrillin-1, -2, and LTBP1 and promote secretion of fibrillin-1",
    "Journal it was published in:": "Discover Oncology",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12480298/"
  }
}