{
  "title": "Paper_247",
  "abstract": "pmc JCI Insight JCI Insight 3101 jciinsight JCI Insight JCI Insight 2379-3708 American Society for Clinical Investigation PMC12487834 PMC12487834.1 12487834 12487834 40811032 10.1172/jci.insight.190149 190149 1 Research Article Photon and particle radiotherapy induce redundant modular chemotaxis of human lymphocytes Kraske Joscha A. j.kraske@dkfz.de 1 2 3 Allers Michael M. m.allers@dkfz-heidelberg.de 2 3 Smirnov Aleksei aleksei.smirnov@dkfz-heidelberg.de 2 3 Lenoir Bénédicte benedicte.lenoir@dkfz-heidelberg.de 4 Ahmed Azaz Azaz.Ahmed@med.uni-heidelberg.de 1 5 Suarez-Carmona Meggy meggy.suarez-carmona@dkfz-heidelberg.de 5 6 Hampel Mareike Mareike.Hampel@med.uni-heidelberg.de 4 5 Krunic Damir D.Krunic@dkfz-heidelberg.de 7 Tietz-Dalfuß Alexandra a.tietz@dkfz-heidelberg.de 2 3 Beikert Tizian Tizian.Beikert@med.uni-heidelberg.de 2 3 Schneeweiss Jonathan M. jonathan.schneeweiss@dkfz-heidelberg.de 2 3 Brons Stephan stephan.brons@med.uni-heidelberg.de 8 9 Albrecht Dorothee d.albrecht@dkfz-heidelberg.de 2 3 Trinh Thuy s.trinh@dkfz-heidelberg.de 2 3 Liu Muzi muzi.liu@dkfz-heidelberg.de 2 3 Giese Nathalia A. nathalia.giese@med.uni-heidelberg.de 10 Glowa Christin christin.glowa@medma.uni-heidelberg.de 2 9 11 Liermann Jakob jakob.liermann@med.uni-heidelberg.de 2 8 9 Lopez Perez Ramon 2 3 Jäger Dirk dirk.jaeger@nct-heidelberg.de 1 4 Debus Jürgen j.debus@dkfz-heidelberg.de 2 8 9 12 Halama Niels nhalama@protonmail.com 1 5 6 13 Huber Peter E. p.huber@dkfz.de 2 3 8 9 Walle Thomas t.walle@dkfz-heidelberg.de 1 3 1 2 3 4 5 6 7 8 9 10 11 12 13 Address correspondence to: Peter E. Huber, German Cancer Research Center, Im Neuenheimer Feld 280, 69120 Heidelberg, Germany. Phone: 00496221422516; Email: p.huber@dkfz.de thomas.walle@med.uni-heidelberg.de Authorship note: 14 8 2025 23 9 2025 10 18 498101 e190149 12 12 2024 11 8 2025 14 08 2025 02 10 2025 02 10 2025 © 2025 Kraske et al. 2025 Kraske et al. https://creativecommons.org/licenses/by/4.0/ This work is licensed under the Creative Commons Attribution 4.0 International License. To view a copy of this license, visit http://creativecommons.org/licenses/by/4.0/ This article is available online at https://insight.jci.org/articles/view/190149 Radiotherapy triggers chemokine release and leukocyte infiltration in preclinical models through activation of the senescence-associated secretory phenotype (SASP). However, effects of irradiation on senescence and SASP in human tissue and in the context of particle radiotherapy remain unclear. Here, we analyzed chemokine patterns after radiotherapy of human pancreatic tumors and cancer cell lines. We show that irradiated tumor cells coexpressed SASP chemokines in defined modules. These chemokine modules correlated with infiltration of distinct leukocyte subtypes expressing cognate receptors. We developed a patient-derived pancreatic tumor explant system, which verified our identified radiation-induced chemokine modules. Chemokine modules were partially conserved in cancer cells in response to photon and particle irradiation, showing a dose-dependent plateau effect, and induced subsequent migration of NK and T cell populations. Hence, our work reveals redundant interactions of cancer cells and immune cells in human tissue, suggesting that targeting multiple chemokines is required to efficiently perturb leukocyte infiltration after photon or particle radiotherapy. Immunology Oncology Cellular senescence Chemokines Radiation therapy Kompetenzverbund Strahlenforschung (KVSF) of the German Ministries for Education, Research and Environment, Bundesministerien für Bildung, Forschung und Umwelt (BMBF/BMU) 03NUK004AC Deutsche Krebshilfe https://doi.org/10.13039/501100005972 70112928 to P.E.H to J.A.K pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement yes pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes Introduction Cellular senescence is a conserved stress response in which cells pause their regular cell cycle to mitigate damage ( 1 3 1 4 5 Cytotoxic therapies, such as radiotherapy, initiate cellular senescence and SASP by generating DNA double-strand breaks ( 5 6 2 The impact of radiation-induced cellular senescence on tumor growth is context dependent. SASP promotes tumor invasiveness and metastasis; however, SASP factors can also promote the infiltration of antitumor effector immune cells and improve immunotherapy outcomes ( 7 9 The immune cell composition within the tumor microenvironment (TME) is controlled by chemokine signaling ( 10 12 13 13 15 16 18 Individual chemokines have been described as part of the SASP after radiotherapy, leading to infiltration of immune cells, which, depending on the context, can either promote or suppress tumor growth ( 8 19 22 23 Conventional radiotherapy for solid tumors, including pancreatic adenocarcinoma (PDAC), usually uses small fractions of around 2 Gy photon radiation over 5–6 weeks to achieve cumulative doses of more than 50 Gy ( 24 24 26 27 30 27 30 31 Here, we systematically study the role of radiotherapy in chemokine release by human cancers. We reveal an unappreciated modularity of chemokine expression in irradiated human pancreatic tumors. Using a potentially novel explant system to study SASP in primary human pancreatic tumor samples ( 32 34 Results Modular SASP chemokine expression and leukocyte infiltration in irradiated patients with PDAC. To identify cell type–specific patterns of chemokine expression, we analyzed a single-nucleus sequencing dataset of 21 patients with PDAC (97,987 cells), who received neoadjuvant photon chemoradiotherapy (normo-/hypofractionated or SBRT) ( Figure 1A Supplemental Figure 1 https://doi.org/10.1172/jci.insight.190149DS1 35 Figure 1B 20 21 36 38 Figure 1B Figure 1B Cancer cells were the main nonimmune cell source of chemokines in the irradiated pancreatic cancer microenvironment ( Figure 1B Figure 1C Supplemental Figure 1C Figure 1D Supplemental Figure 2 Figure 1C Figure 1D Figure 1D Figure 1C Figure 1C Figure 1D On immune cells, cognate chemokine receptors showed similar modularity, which was also computationally robust and not driven by individual patients ( Figure 1C Supplemental Figure 1C Figure 1E dim We hypothesized that the observed expression modularity may result in redundant interactions between modules of chemokines in cancer cells and modules of receptors in immune cells, which explain radiation-induced chemotaxis into tumor tissue. To test this hypothesis, we modified an established permutation test ( 23 Figure 1C P P Figure 1F Radiotherapy induces modular SASP in a patient-derived pancreatic tumor explant model. Interindividual heterogeneity and the difficulty of obtaining repeated longitudinal tissue biopsies complicate studying radiotherapy-induced SASP in patients with cancer. Cell lines and organoid systems can only partially account for the complex cell type composition, which determines chemokine concentrations in the irradiated TME because of cell type–specific expression patterns ( Figure 1 Figure 2A Supplemental Table 2 Supplemental Figure 3A Figure 2, B and C Supplemental Figure 3B Figure 2D Figure 2E Supplemental Figure 3C Supplemental Table 3 We next asked whether photon irradiation of our explant model induced the chemokine modules we identified above in PDAC tissue of patients who received neoadjuvant chemoradiotherapy. Irradiation with a single dose of 10 or 20 Gy homogenously induced module 1 chemokines (CCL4, CCL5, CXCL9, CXCL10, CXCL12) and module 4 chemokines (CCL2, CCL11, CCL27, CXCL1, CXCL8) ( Figure 2F Supplemental Figure 3C Hence, radiotherapy simultaneously induces senescence features and modular chemokine release in primary human tumor tissue. Radiation induces modular chemotaxis by cancer cell–intrinsic effects. Radiation can induce chemokines by cancer cell–intrinsic effects, such as cGAS/stimulator of interferon genes (STING) and NF-κB signaling, or through activation of tumor-infiltrating immune cells or fibroblasts sensing tumor cell death ( 2 13 To test whether cell-intrinsic effects induced modular chemokine expression after radiotherapy, we also studied radiation effects on human cancer cell lines in vitro. Using semiautomated microscopic quantification, we determined the dose dependencies and kinetics of cellular senescence based on SA-β-Gal staining (Methods and Supplemental Figure 4 Figure 3A Supplemental Figure 5A P P P Figure 3, A and B Supplemental Figure 5 We next analyzed chemokine release from irradiated senescent cancer cells using multiplex protein assays. We found that radiation dose-dependently induced several chemokines in cancer cells, as observed in our tissue chemokine modules. Doses of at least 4 Gy induced module 1 (e.g., CCL5, CXCL10) and module 4 (e.g., CCL20, CXCL8) chemokines in pancreatic cancer cells, with larger effects using higher radiation doses ( Figure 3, C and D Figure 3E Figure 3F Similar to their expression across different patients with cancer, radiotherapy with 40 Gy induced module 1 and 4 chemokines across various investigated cell lines ( Figure 4A P P P P P P In patients with PDAC we found chemokine modules correlating with multiple immune cell populations, suggesting redundant chemokine receptor interactions with their cognate receptors ( Figure 1 Supplemental Figure 6A Figure 4B Supplemental Figure 6B dim P P P Figure 4B 8 39 bright P P Figure 4B + P + P P Figure 4B Hence, radiation induced the simultaneous expression of several SASP chemokines by cancer cell–intrinsic effects, resulting in the chemotaxis of multiple lymphocyte subsets bearing cognate receptors. Radiation-induced modular chemotaxis is conserved across photon and particle radiotherapy. Radiotherapy using charged particles, such as protons or carbon ions, is an advanced radiation treatment strategy enabling more precise physical dose distribution with higher RBE. While many effects of particle radiation have been well characterized, e.g., on clonogenic survival and proliferation ( 31 40 41 In line with previous studies ( 42 43 10 10 10 Figure 5A 10 10 10 Figure 5A Figure 5B Supplemental Figure 7A Supplemental Figure 8A Supplemental Figure 7B 10 P P P P P P P P P P P P Figure 5B Having established the robust induction of senescence by particle irradiation, we next compared the induction of senescence-associated chemokines. At biological equivalent doses, particle and photon irradiation induced comparable release of module 1 and 4 chemokines ( Figure 5C Figure 5C Figure 5C Supplemental Figure 8 Moreover, we found similar chemotactic patterns comparing photon and particle radiation–induced immune cell chemotaxis with PANC-1 and SK-MEL 28 cells using modified Boyden chamber assays ( Supplemental Figure 6A dim Figure 6, A and B + + Figure 6A dim Figure 6B Collectively, our results suggest that modular induction of multiple chemokines is a conserved feature of radiotherapy-induced SASP across different radiation types, which is associated with chemotaxis of several lymphocyte subsets. However, radiation-induced chemokine secretion saturates at higher dose ranges, resulting in similar chemokine release and chemotactic patterns after high-dose particle or photon radiotherapy. Discussion Radiotherapy effects on human tissues have not been studied systematically regarding chemokine release and recruitment of leukocyte subsets. Our analysis of single-nucleus sequencing data from irradiated pancreatic cancers revealed that radiotherapy-induced SASP chemokines are expressed in defined modules, correlating with immune cell infiltration. By introducing a potentially novel patient-derived pancreatic tumor explant model to study radiation-induced effects ex vivo, we provide experimental evidence that radiotherapy induces these SASP chemokine modules in human tissue. We show that specific chemokines from our identified modules were also induced in cancer cell lines in vitro, suggesting cancer cell–intrinsic mechanisms of radiation-induced SASP. Cognate receptors for these SASP chemokines were broadly expressed across different immune cells, and consequently, we observed chemotaxis of different lymphocyte subsets after radiotherapy. These effects were highly conserved across different types of radiation, suggesting that similar chemotactic patterns may be triggered by charged particle therapy compared with conventional photon therapy, though with a different dose-response relationship. The modularity we observed for both SASP chemokines and their cognate receptors, paired with chemokine pleiotropy and redundancy ( 12 44 Dose and fractionation are key parameters of radiation effects, with high impact on preclinical and clinical radiotherapy studies. Here, we found that chemokine induction was generally strongest at high single doses of at least 10 Gy. However, we also observed robust and conserved SASP features across a wide range of radiotherapy protocols. Senescence and chemokine release occurred at doses as low as 4 Gy single dose and with 5 × 2 Gy conventionally fractionated protocols. Our findings are therefore relevant to both standard fractionation regimens and the higher single doses applied in SBRT. SBRT is increasingly utilized in the treatment of radioresistant tumors, such as pancreatic cancer, and has shown promising clinical outcomes ( 24 26 45 25 46 47 Studying senescence and SASP in tissue is challenging, as many methods to detect senescence and SASP are primarily validated for in vitro use, and corresponding methods for the assessment of treatment effects in tissues are lacking ( 48 49 We observed the induction of specific chemokines from our identified SASP chemokine modules in cancer cell lines, suggesting a cancer cell–intrinsic effect. The radiation-induced release of chemokines was also associated with chemotaxis of several lymphocyte subsets in vitro. In line with our previous findings ( 8 Particle radiotherapy inflicts disparate DNA damage patterns compared with photon radiotherapy, resulting in stronger inhibition of clonogenic survival and therefore increased RBE ( 27 30 2 50 53 Limitations of our study include the modest sample size of the available patient data obtained from a single pancreatic cancer study, without serial biopsies and with heterogenous radiotherapy protocols. To validate our results, future studies should ideally include samples before and after radiotherapy. Similarly, our sample size of patient-derived tissue was limited, resulting in substantial variance in biological endpoints due to interindividual heterogeneity. An important challenge of this model is the substantial level of necrosis observed in pancreatic tissue. While complicating downstream analyses, necrosis is also a common cell fate in cancer ( 54 55 56 58 4 5 In summary, our study shows that photon radiotherapy induces distinct chemokine programs with subsequent chemotaxis of lymphocytes in patients with PDAC and in ex vivo and in vitro tumor models. Our results highlight an unappreciated degree of modularity and redundancy in radiation-induced chemotaxis in human tissue. While some aspects of radiation-induced SASP are cancer cell intrinsic and can be modeled with cancer cell lines, our explant model will facilitate studying more complex SASP interactions in human pancreatic tissue. Shaping the immune contexture of tumors in patients with cancer through radiotherapy-induced lymphocyte recruitment might facilitate immunotherapeutic approaches. Simultaneous targeting of multiple chemokines and accounting for plateau effects at high doses may be required to relevantly alter radiation-induced leukocyte migration. Hence, our findings have important implications for developing more effective radiotherapy-immunotherapy combinations in cancer. Methods Sex as a biological variable. Both men and women were included in this study. However, we did not consider sex as a biological variable in this study, and sex-specific analyses were not performed because of the limited sample size. Given the consistency of the observed effects across samples, we believe the findings can be generalized irrespective of sex. Single-nucleus RNA-Seq data analysis. Processed.h5ad files containing single-nucleus RNA-Seq (snRNA-Seq) data ( n 35 GSE202051 n 59 Cell type annotations. Principal components (PCs) were calculated as the smallest number of PCs explaining at least 25% of the total variance or the first 50 PCs, whichever number was higher, with a maximum of 100 PCs used. Based on this strategy, we calculated the first 50 PCs, which explained 30.96% of the total variance on the 2,667 selected genes (highly variable and marker genes). We calculated a neighbor graph (k = 15) and a UMAP embedding using the scanpy implementations scanpy.pp.neighbors and scanpy.tl.umap, respectively, with standard parameters. We clustered the data in the PC space using the scanpy implementation of PhenoGraph across a range of k parameters 10–100, selecting a k of 20, which showed high clustering stability with clusterings based on adjacent k parameters (pairwise rand index > 0.8 with k=30 and k=40) and accurately separated major immune lineages, which we annotated based on previously published marker gene signatures in the cytopus knowledge base ( https://github.com/wallet-maker/cytopus 60 Supplemental Table 1 We then partitioned the data into the T/innate lymphoid cell (ILC), B/plasma cell, and myeloid lineage to obtain more granular annotations as described previously ( 8 dim bright Finally, we mapped the annotations obtained on the partitioned data back to the data containing all tumor-infiltrating leukocytes as well as the authors’ annotations for the nonimmune populations. Analyzing chemokine and chemokine receptor expression. For all the following analyses we used only the 21 irradiated patients from this dataset ( n n n r Supplemental Figure 1C RL interaction permutation test. To determine interactions between chemokines and their chemokine receptor modules, we modified an established permutation test ( 23 P Patient-derived pancreatic tumor explant models. Fresh pancreatic tumor tissue from male and female patients was resected at the Department of Surgery at Heidelberg University Hospital and immediately transferred in 0.9% NaCl on ice to the laboratory for downstream processing. Transit time was generally less than 1 hour. Specimens were cut in approximately 5 mm × 5 mm × 0.5 mm slices and cultured in DMEM Glutamax (10566016, Thermo Fisher Scientific) supplemented with 1% Penicillin-Streptomycin (25030081, Thermo Fisher Scientific) solution and 10% Panexin CD (P04-930500, PAN-Biotech) on gas-permeable culture plates (150-000-362, Miltenyi Biotec). H&E staining was used to confirm histology. Samples were irradiated or left untreated and cultivated in a cell culture incubator for 4–5 days. Growth medium was exchanged daily. Tissue was then embedded and frozen in a cryopreservation matrix (41-3011-00, Medite) and stored at –80°C or formalin-fixed and paraffin-embedded. FFPE blocks were sectioned and stained with H&E. Cellularity was manually quantified through microscopy by a trained physician. Frozen tissue blocks were sectioned and protein lysates were generated for subsequent analysis (see below). All studies were performed in accordance to the Declaration of Helsinki. Patient characteristics are listed in Supplemental Table 2 Multiplex cytokine profiling of pancreatic tumor explants. Quantification of cytokines was performed as previously described ( 32 Supplemental Table 3 Western blot. Sections of pancreatic tumor explants were lysed using the Bio-Plex Cell Lysis Kit (171304011, Bio-Rad) according to manufacturer’s protocol. Lysates were then diluted to an equal concentration and 5 μg of protein was denatured in LDS sample buffer (NP0007, Thermo Fisher Scientific) and reducing agent (NP0004, Thermo Fisher Scientific). We loaded 30 μL of samples or 5 μL of PageRuler prestained protein ladder (26617, Thermo Fisher Scientific) on individual lanes of a Tris-glycine gel (consisting of a running gel and a stacking gel prepared using acrylamide, H 2 Cell culture. Human tumor cell lines were obtained from the American Type Culture Collection and cultured in RPMI (A1049101, Thermo Fisher Scientific) supplemented with 10% fetal bovine serum (S181B-500, Biowest), 2 mM l 2 SA-β-Gal assay and semiautomated quantification of senescence. To comprehensively assess the capacity of photon radiation to induce senescence in cancer cells, we established an unbiased, semiautomated macro-based quantification approach based on SA-β-Gal staining. For in vitro experiments cells were irradiated at indicated doses or left untreated and transferred to 24-well plates containing sterile microscopy coverslips. After 4 days, cells were stained for SA-β-Gal using a dedicated staining kit (9860S, Cell Signaling Technology) as per manufacturer instructions. In short, cells were washed with PBS and fixated for 10–15 minutes. Then, after rinsing the plates with PBS, cells were incubated in β-Galactosidase staining solution at pH 6 overnight at 37°C. pH was determined using a pH meter (pH meter 766, Knick) and adjusted with HCl or NaOH if needed. Next, after washing, nuclei were stained with DAPI (6335.2, Carl Roth) by incubation of cells in a 1 μg/mL DAPI in H 2 2 Images of SA-β-Gal and DAPI costained cells were analyzed using an ImageJ (v1.52d) (NIH) macro that counts the total cell number based on DAPI-positive nuclei and quantifies the amount of β-galactosidase–positive cells by measuring color intensity maxima in bright-field images. The macro and a detailed manual are provided elsewhere ( https://github.com/WALL-E-Lab/senescence-quantifier The macro reliably identified senescent cells and was sufficient to quantify senescence in irradiated cells and untreated controls ( Supplemental Figure 4A R 2 Supplemental Figure 4 For SA-β-Gal staining in pancreatic tumor explants, frozen sections of tumor tissue were thawed, and staining was performed with the SA-β-Gal staining kit (9860S, Cell Signaling Technology) as described above. Subsequently samples were counterstained with eosin before image acquisition. Irradiation. For photon radiation treatment, cells were irradiated in suspension with a Cesium-137 source using a Gammacell 1000 device (Atomic Energy of Canada Ltd.) and then transferred into cell culture flasks. Human pancreatic tumor explants and cells for the experiments in Figures 5 6 For particle irradiation, protons and carbon ions were generated in the patient treatment–grade HIT cyclotron. Ion beams were delivered with raster scanning technique in a horizontal beamline with an 8 mm spread-out Bragg peak that was adjusted using a 30 mm water-equivalent range shifter. For protons, energy levels of 64–70 MeV/u with an average linear energy transfer of ~5.1 keV/μm were used. For carbon ions, energy levels of 123–137 MeV/u with an average linear energy transfer of ~100 keV/μm were used. Dosimetry was performed on a routine basis by medical physicists. Bead-based multiplex protein assays. For the quantification of soluble proteins in the supernatants of cancer cells, LEGENDplex multiplex bead-based assays (740985, BioLegend) were used according to the manufacturer’s instructions. Briefly, supernatants were incubated with antibodies coupled to fluorescence-encoded beads and detection antibodies in 96-well, V-bottom, low–protein-binding polypropylene microplates (651201, Greiner Bio One). Subsequently, staining with Streptavidin-PE was performed, and beads were analyzed on a flow cytometer as described below. Concentrations were interpolated from a standard curve using 5-parameter logistic regression calculated with LEGENDplex 8.0 Software (BioLegend). Isolation of human PBMCs. Fresh buffy coats from male and female healthy blood donors were acquired through Deutsches Rotes Kreuz DRK-Blutspendedienst Baden-Württemberg-Hessen gGmbH (Mannheim, Germany). All studies were performed in accordance with the Declaration of Helsinki. Human PBMCs were separated from buffy coats using density gradient centrifugation with a polysucrose separating solution (L6115, Biochrom) and immediately used for downstream experiments. PBMC migration assay. Leukocyte migration toward conditioned media of irradiated or nonirradiated cancer cells was assessed using a modified Boyden chamber assay. Cell-free conditioned media of treated or untreated cancer cells were collected 5 days after irradiation. At 24 hours before collection of supernatants, growth medium was changed into RPMI containing 0.5% BSA. Cells and fragments were removed from supernatants by repeated centrifugation and filtration using a PVDF Filter (P666.1, Carl Roth). Cell-free conditioned media were then filled in the lower well of Transwell migration plates (3421, Corning) as per manufacturer’s instructions. Human PBMCs were freshly isolated as described above and placed in the upper chamber. Cells were then incubated for 4 hours at 37°C in a cell culture incubator. Migrated cells in the lower chamber were harvested and stained for surface antigens as described below. Quantification was done using flow cytometry. For cell counting equal numbers of Accudrop beads (345249, BD) were added to each sample, and identical numbers of beads were acquired per sample. All samples were gated for singlets, 7-aminoactinomycin D (7AAD) negativity, and subset-specific markers: CD4 + + + + + + + dim dim + bright bright – Flow cytometry. For flow cytometry, cells were transferred to 96-well, U-bottom plates (92697, TPP) and washed repeatedly with flow cytometry buffer (PBS + 3% FBS and 0.05% NaN 3 Clonogenic survival assay. To determine differences in radiosensitivity of cancer cells to irradiation with photons, protons, or carbon ions, clonogenic survival assays were performed. For this, cells were irradiated with different doses of different radiation types, and colony formation was assessed after 6–8 days. Cells were then fixed with 33% acetic acid in methanol before staining with crystal violet. Colonies with more than 50 cells were counted and surviving fractions calculated. The linear quadratic model was applied to fit survival curves using SigmaPlot v13. To estimate biological equivalent doses of particles, the RBE at 10% clonogenic cell survival (RBE 10 61 62 ELISA. For the quantification of CXCL8 in conditioned media, ELISA (DY208, R&D Systems) was performed according to the manufacturers’ instructions. In brief, the capture antibody was incubated on 96-well, flat-bottom microplates (655061, Greiner Bio One) overnight. Then, samples and standards were loaded after plate blocking with a buffer containing 1% BSA. After incubation with the detection antibody, streptavidin-HRP was added. The color reaction was started with TMB substrate solution (T0440, Merck) and stopped with H 2 4 Statistics. snRNA-Seq data were analyzed as described above. Statistical analysis of ex vivo and in vitro studies was performed using Prism 8.4 (GraphPad Software). P t P Study approval. Human pancreatic tumor tissue was obtained after written informed consent as approved by the institutional review board at Heidelberg University (Ethikkomission I, Heidelberg University, approval number: S-457/2019). Fresh buffy coats from male and female healthy blood donors were acquired through Deutsches Rotes Kreuz DRK-Blutspendedienst Baden-Württemberg-Hessen gGmbH (Mannheim, Germany), and written informed consent was obtained from all participants. Institutional review board approval was obtained from Ethikkomission I (S-308/2025), Heidelberg University, Medical Faculty Heidelberg, Heidelberg, Germany, and Ethikkomission II (87/04), Heidelberg University, Medical Faculty Mannheim, Mannheim, Germany. Data availability. The analyzed snRNA-Seq data in this study were obtained from the Gene Expression Omnibus at GSE202051 https://github.com/wallet-maker/2023_Particle_SASP https://github.com/WALL-E-Lab/senescence-quantifier Supporting Data Values Author contributions The project was conceptualized by JAK, PEH, and TW. Investigation was conducted by JAK, MMA, AS, BL, AA, MSC, MH, DK, ATD, TB, JMS, DA, TT, ML, RLP, and TW. Methodology was developed and implemented by JAK, BL, AA, MSC, DK, SB, NAG, CG, RLP, DJ, JD, NH, PEH, and TW. Data curation, formal analysis, and visualization were done by JAK and TW. Resources were provided by NAG, DJ, JD, NH, PEH, and TW. Funding acquisition was carried out by JAK, PEH, and TW. The original draft was written by JAK, JL, PEH, and TW. All authors contributed to review and editing of the manuscript. Supplementary Material Supplemental data Unedited blot and gel images Supplemental table 1 Supporting data values We thank Felix Bestvater and the DKFZ Light Microscopy Facility for providing and maintaining fluorescence microscopes. We thank Steffen Schmidt and the DKFZ flow cytometry core facility for providing and maintaining flow cytometers. We thank Alexander Rölle from Medical Faculty Heidelberg, Heidelberg University, for advice on human tissue explant models. We especially thank all patients donating tissue and blood in this study. Funding sources were Deutsche Krebshilfe e.V. (German Cancer Aid) to JAK; DKFZ Clinician Scientist Program, supported by the Dieter Morszeck Foundation, to TW; and Kompetenzverbund Strahlenforschung of the German Ministries for Education, Research, and Environment, Bundesministerien für Bildung, Forschung und Umwelt: 03NUK004A,C to PEH. 1 Muñoz-Espín D Serrano M Cellular senescence: from physiology to pathology Nat Rev Mol Cell Biol 2014 15 7 482 496 10.1038/nrm3823 24954210 2 Herranz N Gil J Mechanisms and functions of cellular senescence J Clin Invest 2018 128 4 1238 1246 10.1172/JCI95148 29608137 PMC5873888 3 López-Otín C et al The hallmarks of aging Cell 2013 153 6 1194 1217 10.1016/j.cell.2013.05.039 23746838 PMC3836174 4 Lopes-Paciencia S et al The senescence-associated secretory phenotype and its regulation Cytokine 2019 117 15 22 10.1016/j.cyto.2019.01.013 30776684 5 Coppé J-P et al Senescence-associated secretory phenotypes reveal cell-nonautonomous functions of oncogenic RAS and the p53 tumor suppressor PLoS Biol 2008 6 12 2853 2868 10.1371/journal.pbio.0060301 19053174 PMC2592359 6 Maier P et al Cellular pathways in response to ionizing radiation and their targetability for tumor radiosensitization Int J Mol Sci 2016 17 1 102 10.3390/ijms17010102 26784176 PMC4730344 7 Wang B et al Senescent cells in cancer therapy: friends or foes? Trends Cancer 2020 6 10 838 857 10.1016/j.trecan.2020.05.004 32482536 8 Walle T et al Radiotherapy orchestrates natural killer cell dependent antitumor immune responses through CXCL8 Sci Adv 2022 8 12 eabh4050 10.1126/sciadv.abh4050 35319989 PMC8942354 9 Ruscetti M et al NK cell-mediated cytotoxicity contributes to tumor control by a cytostatic drug combination Science 2018 362 6421 1416 1422 10.1126/science.aas9090 30573629 PMC6711172 10 Stoll G et al Impact of chemotactic factors and receptors on the cancer immune infiltrate: a bioinformatics study revealing homogeneity and heterogeneity among patient cohorts Oncoimmunology 2018 7 10 e1484980 10.1080/2162402X.2018.1484980 30288345 PMC6169589 11 Jacquelot N et al Targeting chemokines and chemokine receptors in melanoma and other cancers Front Immunol 2018 9 2480 10.3389/fimmu.2018.02480 30420855 PMC6215820 12 Nagarsheth N et al Chemokines in the cancer microenvironment and their relevance in cancer immunotherapy Nat Rev Immunol 2017 17 9 559 572 10.1038/nri.2017.49 28555670 PMC5731833 13 Weichselbaum RR et al Radiotherapy and immunotherapy: a beneficial liaison? Nat Rev Clin Oncol 2017 14 6 365 379 10.1038/nrclinonc.2016.211 28094262 14 Formenti SC Demaria S Combining radiotherapy and cancer immunotherapy: a paradigm shift J Natl Cancer Inst 2013 105 4 256 265 10.1093/jnci/djs629 23291374 PMC3576324 15 Kroemer G et al Immunogenic cell death in cancer therapy Annu Rev Immunol 2013 31 51 72 10.1146/annurev-immunol-032712-100008 23157435 16 Kang J et al Current clinical trials testing the combination of immunotherapy with radiotherapy J Immunother Cancer 2016 4 51 10.1186/s40425-016-0156-7 27660705 PMC5028964 17 Antonia SJ et al Overall survival with durvalumab after chemoradiotherapy in stage III NSCLC N Engl J Med 2018 379 24 2342 2350 10.1056/NEJMoa1809697 30280658 18 Turchan WT et al Radiotherapy and immunotherapy combinations in the treatment of patients with metastatic disease: current status and future focus Clin Cancer Res 2021 27 19 5188 5194 10.1158/1078-0432.CCR-21-0145 34140404 19 Mills BN et al Stereotactic body radiation and interleukin-12 combination therapy eradicates pancreatic tumors by repolarizing the immune microenvironment Cell Rep 2019 29 2 406 421 10.1016/j.celrep.2019.08.095 31597100 PMC6919969 20 Yoon MS et al Irradiation of breast cancer cells enhances CXCL16 ligand expression and induces the migration of natural killer cells expressing the CXCR6 receptor Cytotherapy 2016 18 12 1532 1542 10.1016/j.jcyt.2016.08.006 27720639 21 Matsumura S et al Radiation-induced CXCL16 release by breast cancer cells attracts effector T cells J Immunol 2008 181 5 3099 3107 10.4049/jimmunol.181.5.3099 18713980 PMC2587101 22 Wang L et al Exploiting senescence for the treatment of cancer Nat Rev Cancer 2022 22 6 340 355 10.1038/s41568-022-00450-9 35241831 23 Burdziak C et al Epigenetic plasticity cooperates with cell-cell interactions to direct pancreatic tumorigenesis Science 2023 380 6645 eadd5327 10.1126/science.add5327 37167403 PMC10316746 24 Zhong J et al Outcomes for patients with locally advanced pancreatic adenocarcinoma treated with stereotactic body radiation therapy versus conventionally fractionated radiation Cancer 2017 123 18 3486 3493 10.1002/cncr.30706 28493288 PMC5589506 25 Song CW et al Biological principles of stereotactic body radiation therapy (SBRT) and stereotactic radiation surgery (SRS): indirect cell death Int J Radiat Oncol Biol Phys 2019 110 1 21 34 10.1016/j.ijrobp.2019.02.047 30836165 26 Ludmir EB et al Addition of metastasis-directed therapy to systemic therapy for oligometastatic pancreatic ductal adenocarcinoma (EXTEND): a multicenter, randomized phase II trial J Clin Oncol 2024 42 32 3795 3805 10.1200/JCO.24.00081 39102622 PMC11540734 27 Baumann M et al Radiation oncology in the era of precision medicine Nat Rev Cancer 2016 16 4 234 249 10.1038/nrc.2016.18 27009394 28 Yuan T-Z et al New frontiers in proton therapy: applications in cancers Cancer Commun (Lond) 2019 39 1 61 10.1186/s40880-019-0407-3 31640788 PMC6805548 29 Liermann J et al Effectiveness of carbon ion radiation in locally advanced pancreatic cancer Front Oncol 2021 11 708884 10.3389/fonc.2021.708884 34336696 PMC8318663 30 Durante M et al Charged-particle therapy in cancer: clinical uses and future perspectives Nat Rev Clin Oncol 2017 14 8 483 495 10.1038/nrclinonc.2017.30 28290489 31 Durante M New challenges in high-energy particle radiobiology Br J Radiol 2014 87 1035 20130626 10.1259/bjr.20130626 24198199 PMC4064605 32 Halama N et al Tumoral immune cell exploitation in colorectal cancer metastases can be targeted effectively by anti-CCR5 therapy in cancer patients Cancer Cell 2016 29 4 587 601 10.1016/j.ccell.2016.03.005 27070705 33 Voabil P et al An ex vivo tumor fragment platform to dissect response to PD-1 blockade in cancer Nat Med 2021 27 7 1250 1261 10.1038/s41591-021-01398-3 34239134 34 Pelly VS et al Anti-inflammatory drugs remodel the tumor immune environment to enhance immune checkpoint blockade efficacy Cancer Discov 2021 11 10 2602 2619 10.1158/2159-8290.CD-20-1815 34031121 PMC7611767 35 Hwang WL et al Single-nucleus and spatial transcriptome profiling of pancreatic cancer identifies multicellular dynamics associated with neoadjuvant treatment Nat Genet 2022 54 8 1178 1191 10.1038/s41588-022-01134-8 35902743 PMC10290535 36 Walle T et al Radiation effects on antitumor immune responses: current perspectives and challenges Ther Adv Med Oncol 2018 10 1758834017742575 10.1177/1758834017742575 29383033 PMC5784573 37 Liu Q et al Radiotherapy programs neutrophils to an antitumor phenotype by inducing mesenchymal-epithelial transition Transl Lung Cancer Res 2021 10 3 1424 1443 10.21037/tlcr-21-152 33889520 PMC8044478 38 Rutihinda C et al Inhibition of the CCR6-CCL20 axis prevents regulatory T cell recruitment and sensitizes head and neck squamous cell carcinoma to radiation therapy Cancer Immunol Immunother 2023 72 5 1089 1102 10.1007/s00262-022-03313-2 36326893 PMC10991657 39 Campbell JJ et al Unique subpopulations of CD56+ NK and NK-T peripheral blood lymphocytes identified by chemokine receptor expression repertoire J Immunol 2001 166 11 6477 6482 10.4049/jimmunol.166.11.6477 11359797 40 Fokas E et al Ion beam radiobiology and cancer: time to update ourselves Biochim Biophys Acta 2009 1796 2 216 229 10.1016/j.bbcan.2009.07.005 19682551 41 Schlaff CD et al Bringing the heavy: carbon ion therapy in the radiobiological and clinical context Radiat Oncol 2014 9 1 88 10.1186/1748-717X-9-88 24679134 PMC4002206 42 Karger CP Peschke P RBE and related modeling in carbon-ion therapy Phys Med Biol 2017 63 1 01TR02 10.1088/1361-6560/aa9102 28976361 43 Paganetti H Relative biological effectiveness (RBE) values for proton beam therapy. Variations as a function of biological endpoint, dose, and linear energy transfer Phys Med Biol 2014 59 22 R419 R472 10.1088/0031-9155/59/22/R419 25361443 44 Proudfoot AEI Chemokine receptors: multifaceted therapeutic targets Nat Rev Immunol 2002 2 2 106 115 10.1038/nri722 11910892 PMC7097668 45 Toesca DAS et al Intensified systemic therapy and stereotactic ablative radiotherapy dose for patients with unresectable pancreatic adenocarcinoma Radiother Oncol 2020 152 63 69 10.1016/j.radonc.2020.07.053 32763253 46 Galluzzi L et al Emerging evidence for adapting radiotherapy to immunotherapy Nat Rev Clin Oncol 2023 20 8 543 557 10.1038/s41571-023-00782-x 37280366 47 Demaria S et al Radiation dose and fraction in immunotherapy: one-size regimen does not fit all settings, so how does one choose? J Immunother Cancer 2021 9 4 e002038 10.1136/jitc-2020-002038 33827904 PMC8031689 48 González-Gualda E et al A guide to assessing cellular senescence in vitro and in vivo FEBS J 2021 288 1 56 80 10.1111/febs.15570 32961620 49 Gorgoulis V et al Cellular senescence: defining a path forward Cell 2019 179 4 813 827 10.1016/j.cell.2019.10.005 31675495 50 Richmond A Nf-kappa B, chemokine gene transcription and tumour growth Nat Rev Immunol 2002 2 9 664 674 10.1038/nri887 12209135 PMC2668257 51 Taniguchi K Karin M NF-κB, inflammation, immunity and cancer: coming of age Nat Rev Immunol 2018 18 5 309 324 10.1038/nri.2017.142 29379212 52 Afonina IS et al Limiting inflammation-the negative regulation of NF-κB and the NLRP3 inflammasome Nat Immunol 2017 18 8 861 869 10.1038/ni.3772 28722711 53 Jiang M et al cGAS-STING, an important pathway in cancer immunotherapy J Hematol Oncol 2020 13 1 81 10.1186/s13045-020-00916-z 32571374 PMC7310007 54 Yan J et al Necroptosis and tumor progression Trends Cancer 2022 8 1 21 27 10.1016/j.trecan.2021.09.003 34627742 PMC8702466 55 Richards CH et al The prognostic value of histological tumor necrosis in solid organ malignant disease: a systematic review Future Oncol 2011 7 10 1223 1235 10.2217/fon.11.99 21992733 56 Hiraoka N et al Tumour necrosis is a postoperative prognostic marker for pancreatic cancer patients with a high interobserver reproducibility in histological evaluation Br J Cancer 2010 103 7 1057 1065 10.1038/sj.bjc.6605854 20736942 PMC2965866 57 Yang S et al Is tumor necrosis a clinical prognostic factor in hepato-biliary-pancreatic cancers? A systematic review and meta-analysis Cancer Med 2023 12 10 11166 11176 10.1002/cam4.5742 36951535 PMC10242339 58 Lee PJ Papachristou GI New insights into acute pancreatitis Nat Rev Gastroenterol Hepatol 2019 16 8 479 496 10.1038/s41575-019-0158-2 31138897 59 Wolf FA et al SCANPY: large-scale single-cell gene expression data analysis Genome Biol 2018 19 1 15 10.1186/s13059-017-1382-0 29409532 PMC5802054 60 Kunes RZ et al Supervised discovery of interpretable gene programs from single-cell data Nat Biotechnol 2023 42 7 1084 1095 10.1038/s41587-023-01940-3 37735262 PMC10958532 61 Friedrich T et al Systematic analysis of RBE and related quantities using a database of cell survival experiments with ion beam irradiation J Radiat Res 2013 54 3 494 514 10.1093/jrr/rrs114 23266948 PMC3650740 62 Lopez Perez R et al DNA damage response of clinical carbon ion versus photon radiation in human glioblastoma cells Radiother Oncol 2019 133 77 86 10.1016/j.radonc.2018.12.028 30935585 Version 1 08/14/2025 In-Press Preview Version 2 09/23/2025 Electronic publication Figure 1 Modular chemokine expression enables redundant leukocyte cancer cell interactions in irradiated pancreatic cancer. ( A 35 n B z n C n n D n E n F n P Figure 2 Photon irradiation induces modular SASP chemokine responses in an ex vivo pancreatic tumor model. ( A B C B C P t D E n P t F n Figure 3 Photon irradiation induces dose-dependent senescence and chemokine release in vitro. ( A P P P P B P t C D n C z D E D E P F P t Figure 4 Photon irradiation–induced SASP triggers directional lymphocyte chemotaxis in vitro. ( A P t B n P t Figure 5 Particle irradiation induces cellular senescence and SASP. ( A n P B n P t C z n n n Figure 6 Particle irradiation induces directional lymphocyte migration. Photon, proton, and carbon ion irradiation of ( A B n P t ",
  "metadata": {
    "Title of this paper": "DNA damage response of clinical carbon ion versus photon radiation in human glioblastoma cells",
    "Journal it was published in:": "JCI Insight",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12487834/"
  }
}