{
  "title": "Paper_164",
  "abstract": "pmc JAMA Netw Open JAMA Netw Open 3211 jamasd JAMA Network Open 2574-3805 pmc-is-collection-domain yes pmc-collection-title JAMA Network PMC12489673 PMC12489673.1 12489673 12489673 41032297 10.1001/jamanetworkopen.2025.34960 zoi250977 1 Research Original Investigation Online Only Obstetrics and Gynecology Cost-Effectiveness of HPV Self-Testing Options for Cervical Cancer Screening Cost-Effectiveness of HPV Self-Testing Options for Cervical Cancer Screening Cost-Effectiveness of HPV Self-Testing Options for Cervical Cancer Screening Meenan Richard T. PhD MPH MBA  1 Lacey Catherine PhD MPH  2 Buist Diana S. M. PhD MPH  2  3  4 Tiro Jasmin A. PhD  5 Lin John BA  2 Anderson Melissa L. MS  3 Green Beverly B. MD MPH  3  6  7 Winer Rachel L. PhD MPH  2  3 1 2 3 4 5 6 7 Article Information Accepted for Publication: Published: 10.1001/jamanetworkopen.2025.34960 Open Access: CC-BY License JAMA Network Open Corresponding Author: rlw@uw.edu Author Contributions: Concept and design: Acquisition, analysis, or interpretation of data: Drafting of the manuscript: Critical review of the manuscript for important intellectual content: Statistical analysis: Obtained funding: Administrative, technical, or material support: Supervision: Conflict of Interest Disclosures: Funding/Support: Role of the Funder/Sponsor: Meeting Presentation: Data Sharing Statement: Supplement 3 1 10 2025 10 2025 8 10 498177 e2534960 9 4 2025 1 8 2025 01 10 2025 03 10 2025 03 10 2025 Copyright 2025 Meenan RT et al. JAMA Network Open https://creativecommons.org/licenses/by/4.0/ This is an open access article distributed under the terms of the CC-BY License. jamanetwopen-e2534960.pdf Key Points Question What is the cost-effectiveness of mailed human papillomavirus (HPV) self-sampling kits (direct-to-all or opt-in) relative to usual care for increasing cervical cancer screening among members of a US health care system with varying screening histories? Findings In this economic evaluation of 31 355 participants from a randomized clinical trial, the direct mailing of HPV kits was highly cost-effective among cervical cancer screening adherent and overdue members as was an opt-in approach among members, with unknown screening histories. Meaning These findings suggest that within US-based private integrated health care systems, directly mailing HPV kits for cervical cancer screening is cost-effective and affordable. This economic evaluation examines the cost-effectiveness of mailed human papillomavirus (HPV) self-sampling kits among members of a US health care system with adherent, overdue, or unknown screening histories. Importance Mailing human papillomavirus (HPV) self-sampling kits to underscreened individuals increases cervical cancer screening and can be cost-effective. However, cost-effectiveness has not been evaluated across other screening histories. Objective To conduct an economic evaluation of mailed HPV self-sampling among members of a US health care system with adherent, overdue, or unknown screening histories. Design, Setting, and Participants This economic evaluation was a cost-effectiveness analysis (CEA) and budget impact analysis (BIA) based on results of a randomized clinical trial (RCT) conducted between November 20, 2020, to July 29, 2022, in an integrated health care system in Washington State. Intervention delivery costs were calculated from Kaiser Permanente Washington and Medicare perspectives and used wellness-based or screening-only visit costs. Participants included female members aged 30 to 64 years identified through electronic medical records. Data were analyzed from August 1, 2022, to July 29, 2025. Intervention Members were randomized by screening history. Adherent participants were assigned to 4 groups: usual care (UC), patient reminders, clinician electronic health record [HER] alerts), education (UC and mailed educational materials), direct mail (UC, education, and mailed self-sampling kit), or opt-in (UC, education, and mailed invitation to request kit). Overdue participants were assigned to 3 groups: UC, education, or direct mail. Participants with unknown adherence were assigned to UC, education, or opt-in. Main Outcome and Measures Primary RCT outcome was screening completion 6 months postrandomization. CEA outcome was incremental cost-effectiveness ratio for screening completion. BIA outcome was annual program implementation cost over 4 years. Results Analyses included 31 355 individuals (mean [SD] age, 45.9 [10.4] years). Among screening adherent members, direct mail dominated all other strategies (more effective and cost-saving). Among overdue members, direct mail was also more effective than UC and generated an additional completed screen at a cost ranging from −$19 (95% CI, −$21 to −$16) (cost saving) to $63 (95% CI, $39 to $87) depending on cost basis and visit type. Among unknown members, opt-in generally dominated UC (more effective and cost-saving). The BIA indicated that although the screening adherent subgroup had the largest year 1 program budget, its budget declined fastest and, by year 4, was lowest among the 3 subgroups. Conversely, the smallest annual budget decreases were among eligible individuals with unknown history. Conclusions and Relevance In this economic analysis of a randomized clinical trial, directly mailing HPV kits to individuals who were screening adherent and overdue for screening was economically dominant over other strategies. Program costs declined rapidly over 4 years. Results support directly mailing HPV kits to eligible individuals as an effective, efficient, and affordable outreach strategy. pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf no pmc-prop-has-supplement yes pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes Introduction Screening has significantly reduced cervical cancer incidence and mortality, 1 2 3 4 5 6 7 8 7 9 To generalize the HOME findings beyond underscreened populations, the STEP (Self-Testing options in the Era for Primary HPV screening for cervical cancer) randomized clinical trial was conducted within Kaiser Permanente Washington (KPWA), an integrated health care system in Washington state. 10 11 11 This study explored the cost-effectiveness of home-based cervical cancer screening interventions among individuals with adherent, nonadherent, and unknown screening histories. This information could inform health care systems on optimal strategies for implementing home-based cervical cancer screening programs. To date, most HPV self-sampling cost-effectiveness research has been conducted in European countries with organized national screening programs. 12 13 14 15 16 17 18 19 20 21 10 11 22 Methods Settings and Participants Study design, recruitment details, and results from the STEP clinical trial have been published previously. 10 11 CHEERS 23 STEP Trial Intervention and Procedures Eligible individuals were KPWA members with 3 distinct cervical screening histories: adherent (previously screened, due within 3 months), overdue (Papanicolaou and HPV co-testing more than 5.25 years ago, Papanicolaou testing alone more than 3.25 years ago, or no Papanicolaou testing with minimum continuous KPWA enrollment of 3.25 years), and unknown (KPWA enrollment between 6 months and 3.25 years, no recorded screenings). Inclusion criteria were female sex, age 30 to 64 years, current KPWA enrollment (including assignment to a KPWA primary care clinician), intact cervix, and being due or overdue for cervical cancer screening. Exclusion criteria included electronic health record (EHR) indication of a prior abnormal screen and a nonroutine screening schedule, current pregnancy, or need for an interpreter (kit materials were English-only). Within each screening history subgroup, individuals were block randomized to usual care (regular mailed patient reminders and clinician EHR alerts), education (usual care and a mailed informational packet including educational materials), direct mail (usual care and educational materials and a mailed HPV self-sampling kit 1 week later), or opt-in (usual care and educational materials with a toll-free number and website link for requesting a self-sampling kit, sent 1 week after request). 10 11 10 11 10 11 Outcomes The primary STEP trial outcome was screening completion within 6 months after randomization defined as (1) in-clinic screening, (2) kit return with negative or positive HPV 16 or HPV 18 results, or (3) kit return with in-clinic Papanicolaou testing follow-up for other high-risk HPV-positive or unsatisfactory results. Screening completion was assessed using EHR and claims data. Cost-effectiveness was a prespecified secondary objective in the trial protocol, and incremental cost-effectiveness ratio (ICER) for screening completion by outreach approach and prior screening behavior was a prespecified secondary outcome. Focusing on the intermediate outcome of completion, rather than a more distal outcome, such as QALYs, was considered more salient to US-based health care systems and payers. The BIA was not a prespecified analysis. The outcome of the BIA was the estimated 4-year cost of implementing, within a US-based private health care system, such as KPWA, a direct mail screening program among adherent and overdue members or an opt-in program among members with unknown screening history. Cost Measurement Intervention costs, expressed in 2022 US dollars, were defined as the value of resources used to implement the mailed HPV kit program during the trial and were measured from the health care system perspective. Intervention resources were microcosted and classified as labor or nonlabor, including visit type costs, laboratory processing costs by modality (HPV self-sampling kit-based, in-clinic Papanicolaou-based, clinician-collected HPV-based, and co-test screening), and kit outgoing/incoming mailing and component costs ( Table 1 24 Current Procedural Technology 25 Table 1. Intervention Unit Costs (2022 US Dollars) a Intervention unit Unit cost by cost basis, $ KPWA CMS Primary care visit Age 18-39 y Wellness 458.00 160.62 Screening only 209.05 83.36 Age 40-64 y Wellness 476.00 167.74 Screening only 209.05 83.36 Mailing costs b Initial Education c 1.37 1.37 Direct mail and opt-in d 1.93 1.93 Kit Outbound e 6.23 6.23 Return f 2.74 2.74 Processing costs Co-testing Any normal or unsatisfactory result on Papanicolaou or HPV test 165.00 55.35 Any abnormal result on Papanicolaou or HPV test 228.00 78.39 Primary HPV screening (clinician collected) Negative or positive result for HPV-16 and/or HPV-18 113.00 35.09 Other positive result for high-risk HPV (negative result for HPV-16 and HPV-18) and normal or unsatisfactory result on Papanicolaou test 165.00 55.35 Other positive result for high-risk HPV (negative result for HPV-16 and HPV-18) and abnormal result on Papanicolaou test 228.00 78.39 Papanicolaou based screening g Normal or unsatisfactory 52.00 20.26 LSIL or greater 115.00 43.30 ASCUS and any reflex HPV result 228.00 78.39 HPV test kit screening Negative or positive result for HPV-16 and/or HPV-18 113.00 35.09 Unsatisfactory or other positive result for high-risk HPV (negative result for HPV-16 and HPV-18), AND normal or unsatisfactory result on Papanicolaou test 165.00 55.35 Unsatisfactory or other positive result for high-risk HPV (negative result for HPV-16 and HPV-18) AND abnormal result on Papanicolaou test 228.00 78.39 Abbreviations: ASCUS, atypical squamous cells of undetermined significance; CMS, Centers for Medicare & Medicaid Services; HPV, human papillomavirus; KPWA, Kaiser Permanente Washington; LSIL, low grade squamous intraepithelial lesion.  a 2022 intervention unit costs in 2022 US dollars.  b Mailing costs are based on actual research costs in the trial and, therefore, do not vary by KPWA or CMS.  c Includes costs of the envelope, brochure, and postage.  d Includes costs of the envelope, brochure, kit information sheet, and postage.  e Includes costs of the mailer, instructions, HPV self-collect kit, return mailer, and postage.  f Includes costs of the return postage.  g Papanicolaou testing with reflex HPV testing if Papanicolaou result is either unsatisfactory for review or ASCUS. Statistical Analysis The cost-effectiveness analyses were prespecified in the analysis plan. 10 26 27 The BIA used parameter values from the underlying STEP clinical trial and costs as described previously to generate total program cost estimates over 4 years for hypothetical target populations of 5000 members each for the screening adherent, overdue, and unknown screening history subgroups. Year 1 screening completion rates were applied for each subsequent year’s remaining eligible individuals. The BIA focused on the direct mail strategy for the adherent and overdue subgroups, and the opt-in strategy for the unknown subgroup. We assumed that only self-sampling kits were sent to health plan members, not educational materials, given the limited effectiveness of such materials in increasing screening rates in the STEP trial. 11 28 29 30 P 31 Results STEP Trial Results Analyses included 31 355 individuals (mean [SD] age, 45.9 [10.4] years). Between November 2020 and January 2022, randomization was conducted for 13 356 individuals who were screening adherent (40.8%), 8682 who were overdue for screening (26.5%), and 10 733 individuals with unknown screening histories (32.8%). After excluding 1416 randomized in error, 31 355 were included in analyses (13 069 screening adherent [41.4%]; 8311 overdue [26.3%]; 9975 unknown [31.6%]). Baseline characteristics were similar by intervention group within shared screening history. 11 Prespecified primary analyses for the trial compared direct mail or opt-in individuals with those randomized to the education group. Among the 13 069 individuals who were screening adherent, screening was completed by 914 individuals (61.7%) randomized to direct mail and 2020 (51.1%) randomized to opt-in vs 1885 (47.6%) in the education group. The screening completion absolute difference for direct mail compared with education was 14.1 (95% CI, 11.2 to 16.9) percentage points. For the opt-in group compared with education group, the absolute difference for screening completion was 3.5 (95% CI, 1.2 to 5.7) percentage points. For direct mail compared with opt-in, the absolute difference for screening completion was 10.6 (95% CI, 7.7 to 13.5) percentage points. 11 Among the 8311 individuals who were overdue, 1408 individuals (35.7%) randomized to direct mail completed screening vs 3506 (18.8%) randomized to education (absolute difference, 16.9 [95% CI, 13.8 to 20.0] percentage points). Among those with an unknown screening history, the 9975 individuals (18.1%) in the opt-in group completed screening vs 3486 (15.9%) in the education group (absolute difference, 2.2 [95.% CI, 0.5 to 3.9] percentage points). Among the 10 063 individuals who completed screening, 593 (64.9%) returned an HPV self-sampling kit (vs screening in-clinic) in the screening adherent and direct mail group, 430 (21.3%) in the screening adherent and opt-in group, 320 (63.4%) in the overdue and direct mail group, and 113 (17.8%) in the unknown history and opt-in group. Comparisons between education and usual care were not significant, regardless of screening history. 11 Economic Results The unit costs of the STEP trial intervention are shown in Table 1 Table 2 Table 3 Supplement 1 Table 2. Total 12-Month Intervention Costs by Study Group in 2022 US Dollars Screening history by randomization group No. Intervention cost by cost basis and visit type, $ KPWA CMS Wellness Screening only Wellness Screening only  Adherent Usual Care 3671 686 018 263 369 357 042 214 596 Education 3960 754 024 292 787 394 936 239 493 Opt-in 3956 666 283 270 636 360 970 227 864 Direct Mail 1482 172 879 85 152 108 833 79 252  Overdue Usual Care 5488 413 875 159 882 215 535 129 829 Education 1408 106 731 42 259 56 426 34 712 Direct Mail 1415 100 905 51 571 64 960 48 342  Unknown Usual Care 2983 208 742 81 046 108 235 65 717 Education 3486 225 250 90 278 118 959 74 023 Opt-in 3506 220 787 92 620 120 814 78 148 Abbreviations: CMS, Centers for Medicare & Medicaid Services; KPWA, Kaiser Permanente Washington. Table 3. Baseline Incremental Cost-Effectiveness Ratios (ICERs) in 2022 US Dollars Screening history by cost basis/visit type ICER (95% CI), $ ED to UC OI to UC DM to UC OI to ED DM to ED DM to OI  Adherent KPWA Wellness 575 (572-577) c 446 (434-457) a 461 (336-586) a 626 (608-643) a 506 (402- 610) a 467 (383-551) a Screening only 357 (357-358) c 80 (80-80) a 91 (79-104) a 158 (156-160) a 111 (94-128) a 96 (88-103) a CMS Wellness 402 (401-404) c 145 (144-146) a 154 (127-181) a 242 (238-246) a 178 (145- 211) a 157 (141-174) a Screening only 329 (329-330) c 21 (20-22) a 30 (29-30) a 83 (82-83) a 45 (42-48) a 33 (32-33) a  Overdue KPWA Wellness 459 (456-462) b NA 19 (16-21) a NA 22 (17-27) a NA Screening only 753 (752-754) b NA 44 (38-52) c NA 39 (35- 43) c NA CMS Wellness 711 (709-712) b NA 41 (38-45) c NA 35 (35-36) c NA Screening only 832 (831-832) b NA 63 (39-87) c NA 56 (40-72) c NA  Unknown KPWA Wellness 295 (294-296) c 1265 (1265-1266) a NA 53 (51-56) a NA NA Screening only 66 (66-67) c 95 (95-96) a NA 30 (29-31) c NA NA CMS Wellness 116 (115-117) c 295 (294-296) a NA 24 (22-27) c NA NA Screening only 40 (39-40) c 95 (95-96) c NA 52 (52-53) c NA NA Abbreviations: CMS, Centers for Medicare & Medicaid Services; DM, direct mail; ED, education; KPWA, Kaiser Permanente Washington; NA, not applicable; OI, opt-in; UC, usual care.  a Comparator strategy dominated the baseline strategy (more effective and cost-saving).  b Comparator strategy was dominated by the baseline strategy (less effective and more expensive).  c Comparator strategy was more effective and more expensive than the baseline strategy. Table 4 Figure Table 4 Table 4. Budget Impact Analysis of Step Mailed HPV Test Program Over 4 Years, by Screening History Subgroup (5000 Eligible Health Plan Members Per Subgroup) a Screening history by randomization group Program cost by cost base and visit type, $ KPWA CMS Wellness Screening only Wellness Screening only  Adherent Direct mail Year 1 1 003 707 681 154 366 971 262 236 Year 2 369 256 250 591 135 006 96 474 Year 3 128 233 87 024 46 884 33 503 Year 4 149 773 101 642 54 759 39 131 Total 1 650 969 1 120 411 603 619 431 344 PMPM 16.73 11.35 6.12 4.37  Overdue Direct mail Year 1 592 820 405 180 225 888 165 393 Year 2 373 477 255 264 142 309 104 198 Year 3 232 658 159 017 88 652 64 910 Year 4 180 033 123 049 68 600 50 228 Total 1 378 988 942 509 525 449 384 729 PMPM 9.88 6.75 3.76 2.76  Unknown Opt-in Year 1 506 419 319 420 205 146 139 772 Year 2 415 568 257 133 165 143 112 516 Year 3 333 324 206 245 132 460 90 249 Year 4 301 594 186 612 119 851 81 658 Total 1 556 905 969 411 622 599 424 195 PMPM 8.44 5.32 3.42 2.33 Abbreviations: CMS, Centers for Medicare & Medicaid Services; KPWA, Kaiser Permanente Washington; PMPM, per member per month.  a Estimates assume: (1) individuals continuously enrolled for 4 years; (2) does not account for individuals ages 62 to 64 years in year 1 that may age out of screening prior to year 4; (3) age distribution of sample: 18% aged 30 to 39 years and 82% aged 40 to 64 years; (4) proportion of KPWA population aging into eligible population: 0.8%; (5) proportion of KPWA membership aging into eligible population: 2.0%; (6) negative Papanicolaou procedure removes member from screening pool for 3 years; (7) negative HPV test result removes member from screening pool for 5 years; (8) positive HPV-16 or HPV-18 test result permanently removes member from screening pool. Figure. Projected Annual Budget Over 4 Years for STEP Direct Mail Program (5000 Eligible Health Plan Members Per Subgroup) The per-member per-month (PMPM) program cost (inclusive of in-clinic screening) per screening adherent member (KPWA wellness visit) was $16.73 vs $9.88 for screening-overdue members and $8.44 for members with unknown screening histories. Comparable PMPM values for CMS screening only were as low as $4.37, $2.76, and $2.33, respectively. BIA calculations for the KPWA/wellness scenario are provided in eTables 1 to 3 in Supplement 1 Discussion In this cost-effectiveness analysis of a randomized trial within a US-based integrated health care system, directly mailing HPV self-sampling kits economically dominated other screening strategies among screening adherent members (more effective and cost-saving) and appeared cost-effective among members overdue for screening (more effective, and either cost-saving or with a minimal additional cost per screen). Similarly, inviting members to opt in to receive an HPV kit largely dominated usual care among members with unknown screening histories. However, while opt-in was cost-effective compared with usual care and resulted in cost savings, the absolute increase in screening was small. We also note that our BIA results are broadly comparable to published cost estimates for screening an individual for cervical cancer of $95 (including an office visit) and $32 (without an office visit). 32 Results are consistent with our previous economic evaluation of the predecessor HOME trial intervention, which focused on increasing cervical cancer screening among underscreened individuals within a US-based private health care system. 9 12 33 To our knowledge, we conducted the first BIA of a single US-based HPV self-sampling trial. Although a 2019 systematic review 34 35 36 37 38 39 As with our economic evaluation of HOME, 9 21 Our analysis benefited from the randomized trial design, combined with a large sample size, which allowed us to evaluate cost-effectiveness within different screening history subgroups. Also, by using both KPWA and CMS cost bases, we were able to compare representative US-based private and public payers. As in the HOME trial analysis, 9 Limitations This study has limitations. The trial was conducted within a single US region in a mixed-model health system, where all participants had health insurance and a primary care clinician, which exceeds national averages (86% insured, 75% with a primary care clinician). 40 41 11 42 43 44 Conclusions In this economic evaluation of various strategies for promoting HPV self-sampling among individuals with different cervical screening histories, directly mailing HPV kits to screening adherent and screening-overdue individuals was economically dominant over other strategies. Direct mail program delivery costs declined rapidly over 4 years. Our results support the direct mailing of HPV self-sampling kits to eligible individuals as an efficient and affordable outreach strategy for raising screening rates in US health systems. Direct mailing may become even more efficient as the use of HPV self-sampling expands in the US, which should be a focus of future economic evaluations. References 1 Noone AM Howlader N Krapcho M https://seer.cancer.gov/archive/csr/1975_2015/results_figure/sect_01_intro1_6pgs.pdf 2 Cervix cancer screening, volume 10. International Agency for Research on Cancer. Accessed August 26, 2025. https://publications.iarc.fr/Book-And-Report-Series/Iarc-Handbooks-Of-Cancer-Prevention/Cervix-Cancer-Screening-2005 3 Star J Bandi P Nargis N Updated review of major cancer risk factors and screening test use in the united states, with a focus on changes during the COVID-19 pandemic Cancer Epidemiol Biomark Prev 2023 32 7 879 888 10.1158/1055-9965.EPI-23-0114 37129858 4 Arbyn M Castle PE Offering self-sampling kits for HPV testing to reach women who do not attend in the regular cervical cancer screening program Cancer Epidemiol Biomarkers Prev 2015 24 5 769 772 10.1158/1055-9965.EPI-14-1417 25713024 5 Limmer K LoBiondo-Wood G Dains J Predictors of cervical cancer screening adherence in the United States: a systematic review J Adv Pract Oncol 2014 5 1 31 41 25032031 PMC4093462 6 Crawford A Benard V King J Thomas CC Understanding barriers to cervical cancer screening in women with access to care, behavioral risk factor surveillance system, 2014 Prev Chronic Dis 2016 13 E154 10.5888/pcd13.160225 27831682 PMC5109933 7 Winer RL Lin J Tiro JA Effect of mailed human papillomavirus test kits vs usual care reminders on cervical cancer screening uptake, precancer detection, and treatment: a randomized clinical trial JAMA Netw Open 2019 2 11 e1914729 10.1001/jamanetworkopen.2019.14729 31693128 PMC6865279 8 Verdoodt F Jentschke M Hillemanns P Racey CS Snijders PJF Arbyn M Reaching women who do not participate in the regular cervical cancer screening programme by offering self-sampling kits: a systematic review and meta-analysis of randomised trials Eur J Cancer 2015 51 16 2375 2385 10.1016/j.ejca.2015.07.006 26296294 9 Meenan RT Troja C Buist DSM Economic evaluation of mailed home-based human papillomavirus self-sampling kits for cervical cancer screening JAMA Netw Open 2023 6 3 e234052 10.1001/jamanetworkopen.2023.4052 36947040 PMC10034577 10 Winer RL Lin J Anderson ML Design of a pragmatic randomized controlled trial of home-based human papillomavirus (HPV) self-sampling for increasing cervical cancer screening uptake in a US healthcare system: the STEP trial Contemp Clin Trials 2022 106960 10.1016/j.cct.2022.106960 36241145 PMC10164445 11 Winer RL Lin J Anderson ML Strategies to Increase Cervical Cancer Screening With Mailed Human Papillomavirus Self-Sampling Kits: A Randomized Clinical Trial JAMA 2023 330 20 1971 1981 10.1001/jama.2023.21471 38015219 PMC10685881 12 Malone C Barnabas RV Buist DSM Tiro JA Winer RL Cost-effectiveness studies of HPV self-sampling: a systematic review Prev Med 2020 132 105953 10.1016/j.ypmed.2019.105953 31911163 PMC7219564 13 Broberg G Gyrd-Hansen D Miao Jonasson J Increasing participation in cervical cancer screening: offering a HPV self-test to long-term non-attendees as part of RACOMIP, a Swedish randomized controlled trial Int J Cancer 2014 134 9 2223 2230 10.1002/ijc.28545 24127304 14 Burger EA Sy S Nygård M Kim JJ The cost-effectiveness of cervical self-sampling to improve routine cervical cancer screening: the importance of respondent screening history and compliance Cancer Epidemiol Biomarkers Prev 2017 26 1 95 103 10.1158/1055-9965.EPI-16-0350 27624639 PMC5225039 15 Haguenoer K Sengchanh S Gaudy-Graffin C Vaginal self-sampling is a cost-effective way to increase participation in a cervical cancer screening programme: a randomised trial Br J Cancer 2014 111 11 2187 2196 10.1038/bjc.2014.510 25247320 PMC4260034 16 Virtanen A Anttila A Nieminen P The costs of offering HPV-testing on self-taken samples to non-attendees of cervical screening in Finland BMC Womens Health 2015 15 99 10.1186/s12905-015-0261-7 26542953 PMC4635548 17 Portnoy A Pedersen K Sy S Cost-effectiveness of primary human papillomavirus triage approaches among vaccinated women in Norway: a model-based analysis Int J Cancer 2024 154 6 1073 1081 10.1002/ijc.34804 38088449 18 Huntington S Puri Sudhir K Schneider V Two self-sampling strategies for HPV primary cervical cancer screening compared with clinician-collected sampling: an economic evaluation BMJ Open 2023 13 6 e068940 10.1136/bmjopen-2022-068940 37280031 PMC10254906 19 Kositamongkol C Kanchanasurakit S Mepramoon E Cost-utility and budget impact analyses of cervical cancer screening using self-collected samples for HPV DNA testing in Thailand BMC Public Health 2023 23 1 2413 10.1186/s12889-023-17358-0 38049773 PMC10696797 20 Spees LP Biddell CB Smith JS Cost-effectiveness of human papillomavirus (HPV) self-collection intervention on cervical cancer screening uptake among underscreened US persons with a cervix Cancer Epidemiol Biomark Prev 2023 32 8 1097 1106 10.1158/1055-9965.EPI-22-1267 PMC10524653 37204419 21 Torbica A Fornaro G Tarricone R Drummond MF Do social values and institutional context shape the use of economic evaluation in reimbursement decisions? an empirical analysis Value Health 2020 23 1 17 24 10.1016/j.jval.2019.11.001 31952668 22 Budget impact analysis. Health Economics Resource Center. Accessed February 17, 2024. https://www.herc.research.va.gov/include/page.asp?id=budget-impact-analysis 23 Husereau D Drummond M Augustovski F Consolidated Health Economic Evaluation Reporting Standards (CHEERS) 2022 explanation and elaboration: a report of the ISPOR CHEERS II good practices task force Value Health 2022 25 1 10 31 10.1016/j.jval.2021.10.008 35031088 24 Physician fee schedule, 2022. Centers for Medicare & Medicaid Services. Accessed June 12, 2023. https://www.cms.gov/medicare/payment/fee-schedules/physician 25 CPT (current procedural terminology). American Medical Association. Accessed August 17, 2023. https://www.ama-assn.org/amaone/cpt-current-procedural-terminology 26 Willan AR O’Brien BJ Confidence intervals for cost-effectiveness ratios: an application of Fieller’s theorem Health Econ 1996 5 4 297 305 10.1002/(SICI)1099-1050(199607)5:4&#x0003c;297::AID-HEC216&#x0003e;3.0.CO;2-T 8880166 27 Polsky D Glick HA Willke R Schulman K Confidence intervals for cost-effectiveness ratios: a comparison of four methods Health Econ 1997 6 3 243 252 10.1002/(SICI)1099-1050(199705)6:3&#x0003c;243::AID-HEC269&#x0003e;3.0.CO;2-Z 9226142 28 Curry SJ Krist AH Owens DK US Preventive Services Task Force Screening for cervical cancer: US Preventive Services Task Force recommendation statement JAMA 2018 320 7 674 686 10.1001/jama.2018.10897 30140884 29 Fontham ETH Wolf AMD Church TR Cervical cancer screening for individuals at average risk: 2020 guideline update from the American Cancer Society CA Cancer J Clin 2020 70 5 321 346 10.3322/caac.21628 32729638 30 Draft recommendation: cervical cancer: screening. United States Perventive Services Taskforce. Accessed December 10, 2024. https://www.uspreventiveservicestaskforce.org/uspstf/index.php/draft-recommendation/cervical-cancer-screening-adults-adolescents#fullrecommendationstart 31 Stata statistical software: release 18. StataCorp. Accessed August 26, 2025. https://www.stata.com/ 32 Ekwueme DU Subramanian S Trogdon JG Cost of services provided by the National Breast and Cervical Cancer Early Detection Program Cancer 2014 120 Suppl 16 2604 2611 10.1002/cncr.28816 25099904 PMC5822677 33 Pedersen BT Sonne SB Pedersen H Participation and relative cost of attendance by direct-mail compared to opt-in invitation strategy for HPV self-sampling targeting cervical screening non-attenders: a large-scale, randomized, pragmatic study Int J Cancer 2025 156 8 1594 1605 10.1002/ijc.35263 39579017 PMC11826108 34 Jahn B Todorovic J Bundo M Budget impact analysis of cancer screening: a methodological review Appl Health Econ Health Policy 2019 17 4 493 511 10.1007/s40258-019-00475-6 31016686 35 Petry KU Barth C Wasem J Neumann A A model to evaluate the costs and clinical effectiveness of human papilloma virus screening compared with annual papanicolaou cytology in Germany Eur J Obstet Gynecol Reprod Biol 2017 212 132 139 10.1016/j.ejogrb.2017.03.029 28363186 36 Wright T Huang J Baker E Garfield S Hertz D Cox JT The budget impact of cervical cancer screening using HPV primary screening Am J Manag Care 2016 22 3 e95 e105 26978241 37 Shi JF Chen JF Canfell K Estimation of the costs of cervical cancer screening, diagnosis and treatment in rural Shanxi Province, China: a micro-costing study BMC Health Serv Res 2012 12 123 10.1186/1472-6963-12-123 22624619 PMC3461448 38 Pista A Costa C Saldanha C Budget impact analysis of cervical cancer screening in Portugal: comparison of cytology and primary HPV screening strategies BMC Public Health 2019 19 1 235 10.1186/s12889-019-6536-4 30808324 PMC6391842 39 Sroczynski G Hallsson L Mühlberger N PCN55 budget IMPACT of implementing HPV testing in cervical cancer screening in Austria—a MODEL based analysis Value Health 2020 23 S431 10.1016/j.jval.2020.08.192 40 Cha AE Cohen RA Demographic variation in health insurance coverage: United States, 2020 Natl Health Stat Report 2022 169 1 15 35166656 41 Levine DM Linder JA Landon BE Characteristics of Americans with primary care and changes over time, 2002-2015 JAMA Intern Med 2020 180 3 463 466 10.1001/jamainternmed.2019.6282 31841583 PMC6990950 42 Allahqoli L Mazidimoradi A Salehiniya H Alkatout I Impact of COVID-19 on cancer screening: a global perspective Curr Opin Support Palliat Care 2022 16 3 102 109 10.1097/SPC.0000000000000602 35862881 PMC9451605 43 Miller MJ Xu L Qin J Impact of COVID-19 on cervical cancer screening rates among women aged 21-65 years in a large integrated health care system—Southern California, January 1 to September 30, 2019, and January 1 to September 30, 2020 MMWR Morb Mortal Wkly Rep 2021 70 4 109 113 10.15585/mmwr.mm7004a1 33507893 PMC7842810 44 Wong ELY Wong CNS Cheung AWL Wong AYK Tam ZPY Feasibility of human papillomavirus self-sampling to combat COVID-19-related disruptions to cervical cancer screening: a cross-sectional survey Lancet Oncol 2022 23 S16 10.1016/S1470-2045(22)00415-6 Supplement 1. eTable 1. Budget Impact Analysis For KPWA/Wellness Cost Basis (Adherent Screening History) eTable 2. Budget Impact Analysis For KPWA/Wellness Cost Basis (Overdue Screening History) eTable 3. Budget Impact Analysis For KPWA/Wellness Cost Basis (Unknown Screening History) eFigure 1. Cost-Effectiveness Acceptability Curves For KPWA/Wellness Cost Basis (Adherent Screening History) eFigure 2. Cost-Effectiveness Acceptability Curves For KPWA/Wellness Cost Basis (Overdue Screening History) eFigure 3. Cost-Effectiveness Acceptability Curves For KPWA/Wellness Cost Basis (Unknown Screening History) Supplement 2. Statistical Analysis Plan and Trial Protocol Supplement 3. Data Sharing Statement ",
  "metadata": {
    "Title of this paper": "Feasibility of human papillomavirus self-sampling to combat COVID-19-related disruptions to cervical cancer screening: a cross-sectional survey",
    "Journal it was published in:": "JAMA Network Open",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12489673/"
  }
}