{
  "title": "Paper_109",
  "abstract": "J Med Imaging (Bellingham) J Med Imaging (Bellingham) 2760 jmi JMI Journal of Medical Imaging 2329-4302 2329-4310 Society of Photo-Optical Instrumentation Engineers PMC11447382 PMC11447382.1 11447382 11447382 39372519 10.1117/1.JMI.11.5.055502 24059GRRR 1 Image Perception, Observer Performance, and Technology Assessment Paper Optimizing mammography interpretation education: leveraging deep learning for cohort-specific error detection to enhance radiologist training https://orcid.org/0000-0002-7669-7241 Tao Xuetong a * xtao6383@uni.sydney.edu.au https://orcid.org/0000-0002-8937-2198 Reed Warren M. a warren.reed@sydney.edu.au https://orcid.org/0000-0003-4956-765X Li Tong b c t.li@sydney.edu.au https://orcid.org/0000-0001-8611-7258 Brennan Patrick C. a patrick.brennan@sydney.edu.au Gandomkar Ziba a ziba.gandomkar@sydney.edu.au a The University of Sydney Australia b The University of Sydney a joint venture with Cancer Council NSW Australia c The University of Sydney Australia * xtao6383@uni.sydney.edu.au 3 10 2024 9 2024 11 5 469711 055502 24 2 2024 31 7 2024 10 9 2024 03 10 2025 03 10 2025 04 10 2024 03 10 2025 © 2024 Society of Photo-Optical Instrumentation Engineers (SPIE) 2024 Society of Photo-Optical Instrumentation Engineers 2329-4302/2024/ $28.00 Abstract. Purpose Accurate interpretation of mammograms presents challenges. Tailoring mammography training to reader profiles holds the promise of an effective strategy to reduce these errors. This proof-of-concept study investigated the feasibility of employing convolutional neural networks (CNNs) with transfer learning to categorize regions associated with false-positive (FP) errors within screening mammograms into categories of “low” or “high” likelihood of being a false-positive detection for radiologists sharing similar geographic characteristics. Approach Mammography test sets assessed by two geographically distant cohorts of radiologists (cohorts A and B) were collected. FP patches within these mammograms were segmented and categorized as “difficult” or “easy” based on the number of readers committing FP errors. Patches outside 1.5 times the interquartile range above the upper quartile were labeled as difficult, whereas the remaining patches were labeled as easy. Using transfer learning, a patch-wise CNN model for binary patch classification was developed utilizing ResNet as the feature extractor, with modified fully connected layers for the target task. Model performance was assessed using 10-fold cross-validation. Results Compared with other architectures, the transferred ResNet-50 achieved the highest performance, obtaining receiver operating characteristics area under the curve values of 0.933 ( ± 0.012 ± 0.011 Conclusions The findings highlight the feasibility of employing CNN-based transfer learning to predict the difficulty levels of local FP patches in screening mammograms for specific radiologist cohort with similar geographic characteristics. Keywords: mammography diagnostic errors diagnostic performance deep learning customized mammography training Cancer Institute NSW Early Career Fellowship 2022/ECF1420 2022/ECF1426 National Breast Cancer Foundation https://doi.org/10.13039/501100001026 IIRS-22-087 pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access no pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement no pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes running-head Tao et al.: Optimizing mammography interpretation education: leveraging deep… ",
  "metadata": {
    "Title of this paper": "Optimizing mammography interpretation education: leveraging deep learning for cohort-specific error detection to enhance radiologist training",
    "Journal it was published in:": "Journal of Medical Imaging",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC11447382/"
  }
}