{
  "title": "Paper_1055",
  "abstract": "pmc Medicina (Kaunas) Medicina (Kaunas) 3494 medicina medicina Medicina 1010-660X 1648-9144 Multidisciplinary Digital Publishing Institute  (MDPI) PMC12471519 PMC12471519.1 12471519 12471519 41011095 10.3390/medicina61091704 medicina-61-01704 1 Article Health-Related Quality of Life, Illness Perception, Stigmatization and Optimism Among Hematology Patients: Two Exploratory Path Models https://orcid.org/0000-0003-4875-4891 Kiss Hedvig Conceptualization Methodology Formal analysis Investigation Data curation Writing – original draft 1 * https://orcid.org/0000-0003-4027-3452 Müller Vanessa Methodology Formal analysis Investigation Data curation Writing – original draft Visualization 1 Dani Kristóf Tamás Conceptualization Investigation Data curation Writing – original draft Project administration 2 https://orcid.org/0000-0002-3072-9615 Pikó Bettina Franciska 1 Pop Raluca Maria Academic Editor 1 2 * kiss.hedvig@med.u-szeged.hu 19 9 2025 9 2025 61 9 497654 1704 18 8 2025 11 9 2025 17 9 2025 19 09 2025 27 09 2025 29 09 2025 © 2025 by the authors. 2025 https://creativecommons.org/licenses/by/4.0/ Published by MDPI on behalf of the Lithuanian University of Health Sciences. Licensee MDPI, Basel, Switzerland. This article is an open access article distributed under the terms and conditions of the Creative Commons Attribution (CC BY) license ( https://creativecommons.org/licenses/by/4.0/ Background and Objectives: Materials and Methods: Results: p p p p p p Conclusions: health-related quality of life illness perception stigmatization optimism exploratory path model National Research, Development and Innovation Fund #ÚNKP-22-4-SZTE-301 This research was funded by the New National Excellence Program of the Ministry for Culture and Innovation from the source of the National Research, Development and Innovation Fund, grant number: #ÚNKP-22-4-SZTE-301. pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement no pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes 1. Introduction Hematological conditions, ranging from benign disorders like anemia and clotting abnormalities to malignant cancers such as certain types of leukemia, lymphoma, and multiple myeloma, represent a major burden on global health and significantly impact patients’ quality of life [ 1 2 The conceptual framework most often referenced when examining HRQoL is the Wilson and Cleary model [ 3 4 5 6 7 8 9 10 11 12 13 Among these psychological variables, illness perception has emerged as a particularly influential factor [ 14 15 A special aspect of illness perception is stigmatization, which can particularly worsen HRQoL. While social stigma stems from stigmatizing attitudes towards a person living with illness, self-stigma is the perception of stigmatization within the stigmatized person [ 16 17 18 19 Additionally, optimism, defined as a generalized expectation that good things will happen, has been proposed as a protective psychological factor that can buffer the negative impact of illness-related stressors [ 20 21 Given these considerations, the present study aimed to investigate the direct and indirect effects of illness perception and emotional functioning on physical and social functioning—two key aspects of HRQoL—in patients with hematological diseases. We further explored the potential moderating role of optimism in these relationships. Two exploratory regression-based path models were developed to examine links between psychological variables and HRQoL dimensions. These two separate models were selected to address the distinct and multifaceted ways that psychological factors impact both physical and social functioning. The first model focused on physical functioning, exploring associations with illness perception, optimism, role, and cognitive functioning. The second model centered on social functioning, incorporating illness perception, optimism, emotional functioning, and stigmatization. This dual approach allows for a nuanced understanding of how different psychological domains affect these two critical aspects of HRQoL, with the goal of informing targeted supportive care interventions. 2. Materials and Methods 2.1. Study Type This cross-sectional survey was conducted at a tertiary care health center in southern Hungary from October 2022 to January 2023. Participants were recruited from the hematology department, and eligibility included being 18 years or older, undergoing treatment for a hematological disease, and being physically able to complete the survey. Written informed consent was obtained from all participants. 2.2. Sample As shown in Table 1 22 n 23 2.3. Measures HRQoL was assessed using the validated Hungarian version of the EORTC Quality of Life Questionnaire v3.0. This 30-item questionnaire covers three domains; the present study focused on the functioning domain, including physical, role, cognitive, emotional, and social functioning. Items refer to the past week and are rated on a four-point Likert scale (1–4), with higher scores indicating better functioning. Internal consistency values were acceptable (>0.70) for all subscales except cognitive functioning (0.78 physical, 0.87 role, 0.86 emotional, 0.60 cognitive, 0.80 social functioning), consistent with previous findings [ 24 Illness perceptions were measured with the Hungarian version of the Brief Illness Perception Questionnaire [ 25 26 Stigmatization was assessed using the Hungarian adaptation of the Stigma Scale for Chronic Illness-8 [ 27 Optimism was measured with the Hungarian version of the Revised Life Orientation Test [ 28 29 2.4. Statistical Analysis Data were analyzed using SPSS software (Version 25.0). Missing data were excluded using pairwise deletion. Pearson correlation coefficients explored relationships between variables. Multicollinearity was assessed using the Variance Inflation Factor (VIF) with VIF values ≥ 5.0 and tolerance values < 0.2 indicating considerable collinearity. The estimated model for all variables with statistically significant correlations was informed by the theoretical background and bivariate correlation matrix. To ensure the conditions were met for mediation and moderation, the study followed the recommendations of Baron and Kenny [ 30 31 32 Table 2 2.5. Ethical Approval The study was conducted in accordance with the Declaration of Helsinki and approved by the National Scientific and Ethical Committee of the Medical Research Council (ETT-TUKEB, Hungary) (protocol code: #BMEÜ/2299/2022/EKU, issued: 3 October 2022). 3. Results 3.1. Descriptive Statistics and Bivariate Relationships Table 3 p p p p p p p p 3.2. Exploratory Path Models 3.2.1. Path Model for Physical Functioning The first model ( Figure 1 p p p p p p p p p 3.2.2. Path Model for Social Functioning The second model ( Figure 2 p p p p p p p p 4. Discussion This study aimed to explore the interconnectedness of various aspects of HRQoL among Hungarian hematology patients and their association with psychological factors, using exploratory path models. Participants reported relatively poor illness perception, a finding consistent with existing literature [ 33 34 35 36 Illness perception had statistically significant negative correlations with optimism and all HRQoL subscales, except stigmatization, which negatively impacted all HRQoL function scales, consistent with prior research [ 37 38 The first model highlighted the direct impact of illness perception on physical functioning, with cognitive and role functioning as mediators, and optimism as a moderator. Subjectively poor illness perception, coupled with less adaptive coping strategies and declined functional abilities across roles, has been previously shown to impair HRQoL [ 39 33 14 40 41 In contrast to previous studies [ 13 42 43 The second model revealed a direct link between emotional and social functioning, consistent with existing literature [ 9 44 17 45 This study contributes to the literature by focusing on Hungarian hematology patients and examining HRQoL in a dimensional way. A novel aspect is the focus on two dimensions—physical and social functioning—which are among the most important in the literature, emphasizing their interrelationships. The findings highlight the importance of optimism in managing illness and its impact on daily life. Clinical implications include the need for tailored interventions targeting both physical and emotional aspects of illness, and enhanced communication training for healthcare professionals to better support patients’ emotional well-being. Healthcare providers should be educated about HRQoL and its dimensions to better understand which aspects matter most to each patient, allowing for personalized care. Developing practical courses on holistic patient care could help healthcare professionals improve HRQoL by making them more aware of the importance and interconnections between HRQoL dimensions. In the context of the patient population, offering educational materials that focus on managing emotional issues related to disease, such as stigmatization, could be crucial. The study has limitations. Its cross-sectional design limits causal inferences, and the small sample size restricts generalizability. Data were collected from patients with sufficient physical and cognitive abilities, and the study relied on self-reported data. In addition, the relationships between the examined variables can be more complex depending on patients’ illness characteristics. Another limitation is that information on marital status was not collected, although it may be an important factor influencing optimism and overall HRQoL. Furthermore, due to the limited sample size, we were not able to stratify patients by disease type or age group, although different diseases and age groups may be associated with distinct illness perceptions. Longitudinal studies with larger, more diverse populations could provide a more comprehensive view of the relationships between these variables and enhance generalizability. Combining quantitative and qualitative methods could offer deeper insights, and further research into factors such as social support could help clarify the role of psychosocial variables in HRQoL. Finally, some scales need further validation due to relatively low reliability values, ensuring robustness and accuracy of the measures used in this research. Nevertheless, as the first study examining HRQoL in hematology patients in Hungary, these findings highlight the significant associations between illness perception and its correlates. 5. Conclusions In conclusion, the study achieved its aim of exploring the psychological determinants of health-related quality of life in detail in patients with hematological diseases. Illness perception and emotional functioning were identified as key determinants of HRQoL, while optimism appeared to moderate these relationships. By developing two separate path models, we demonstrated that psychological variables influence physical and social functioning in distinct ways. Applying this dual approach represents a novelty of this paper, as it enables the identification of nuanced differences in the path structure of various dimensions of HRQoL. The current sample adds further novelty, given that only a few studies have included patients with hematological diseases while examining different dimensions of HRQoL. Furthermore, the inclusion of both favorable (e.g., optimism) and unfavorable (e.g., stigmatization) psychological variables also contributes to the originality of our study. These results highlight the importance of integrating psychosocial support into routine hematology care. Targeted interventions aimed at improving emotional well-being and addressing maladaptive illness beliefs may enhance patients’ physical, emotional, and social functioning, ultimately contributing to better overall quality of life. Multidisciplinary supportive care strategies that promote optimism and adaptive coping could therefore play a critical role in comprehensive cancer care. Acknowledgments The authors would like to thank the department authorities for access and also the participants for agreeing to voluntarily participate in this study. Disclaimer/Publisher’s Note: Author Contributions Conceptualization, H.K., K.T.D. and B.F.P.; methodology, H.K., V.M. and B.F.P.; formal analysis, H.K. and V.M.; investigation, H.K., V.M. and K.T.D.; data curation, H.K., V.M. and K.T.D.; writing—original draft preparation, H.K., V.M. and K.T.D.; writing—review and editing, B.F.P.; visualization, V.M.; supervision, B.F.P.; project administration, K.T.D. All authors have read and agreed to the published version of the manuscript. Institutional Review Board Statement The study was conducted in accordance with the Declaration of Helsinki and approved by the National Scientific and Ethical Committee of the Medical Research Council (ETT-TUKEB, Hungary) (protocol code: #BMEÜ/2299/2022/EKU, issued: 3 October 2022). Informed Consent Statement Informed consent was obtained from all subjects involved in the study. Data Availability Statement The datasets generated and analyzed during the current study have not been deposited into a publicly available repository. Data will be made available on request. Conflicts of Interest The authors declare no conflicts of interest. References 1. Zhang N. Wu J. Wang Q. Liang Y. Li X. Chen G. Ma L. Liu X. Zhou F. Global burden of hematologic malignancies and evolution patterns over the past 30 years Blood Cancer J. 2023 13 82 10.1038/s41408-023-00853-3 37193689 PMC10188596 2. Youron P. Singh C. Jindal N. Malhotra P. Khadwal A. Jain A. Prakash G. Varma N. Varma S. Lad D.P. Quality of life in patients of chronic lymphocytic leukemia using the EORTC QLQ-C30 and QLQ-CLL17 questionnaire Eur. J. Haematol. 2020 105 755 762 10.1111/ejh.13503 32748412 3. Wilson I.B. Cleary P.D. Linking clinical variables with health-related quality of life: A conceptual model of patient outcomes JAMA 1995 273 59 65 Available online: https://pubmed.ncbi.nlm.nih.gov/7996652/ (accessed on 2 April 2025) 10.1001/jama.1995.03520250075037 7996652 4. Ojelabi A.O. Graham Y. Haighton C. Ling J. A systematic review of the application of Wilson and Cleary health-related quality of life model in chronic diseases Health Qual. Life Outcomes 2017 15 241 10.1186/s12955-017-0818-2 29228977 PMC5725920 5. Ferrans C.E. Zerwic J.J. Wilbur J.E. Larson J.L. Conceptual model of health-related quality of life J. Nurs. Scholarsh. 2005 37 336 342 10.1111/j.1547-5069.2005.00058.x 16396406 6. Bakas T. McLennon S.M. Carpenter J.S. Buelow J.M. Otte J.L. Hanna K.M. Ellett M.L. Hadler K.A. Welch J.L. Systematic review of health-related quality of life models Health Qual. Life Outcomes 2012 10 134 10.1186/1477-7525-10-134 23158687 PMC3548743 7. Goyal N.G. Maddocks K.J. Johnson A.J. Byrd J.C. Westbrook T.D. Andersen B.L. Cancer-specific stress and trajectories of psychological and physical functioning in patients with relapsed/refractory chronic lymphocytic leukemia Ann. Behav. Med. 2018 52 287 298 10.1093/abm/kax004 30084895 PMC6408323 8. Sun F.K. Lu C.Y. Yao Y. Chiang C.Y. Social functioning, depression, and quality of life among breast cancer patients: A path analysis Eur. J. Oncol. Nurs. 2023 62 102237 10.1016/j.ejon.2022.102237 36455513 9. Alhamss M.M. Mathbout L.F. Nassri R.B. Alabdaljabar M.S. Hashmi S. Muhsen I.N. Quality of life in hematologic malignancy in the eastern Mediterranean region: A systematic review Cureus 2022 14 e32436 10.7759/cureus.32436 36644089 PMC9833332 10. Johnsen A.T. Tholstrup D. Petersen M.A. Pedersen L. Groenvold M. Health-related quality of life in a nationally representative sample of haematological patients Eur. J. Haematol. 2009 83 139 148 10.1111/j.1600-0609.2009.01250.x 19284418 PMC2730555 11. Schmidt M.E. Scherer S. Wiskemann J. Steindorf K. Return to work after breast cancer: The role of treatment-related side effects and potential impact on quality of life Eur. J. Cancer Care 2019 28 e13051 10.1111/ecc.13051 31033073 12. Aydın Sayılan A. Demir Doğan M. Illness perception, perceived social support, and quality of life in patients with diagnosis of cancer Eur. J. Cancer Care 2020 29 e13252 10.1111/ecc.13252 32495471 13. Ruiz-Rodríguez I. Hombrados-Mendieta I. Melguizo-Garín A. Martos-Méndez M.J. The importance of social support, optimism, and resilience on the quality of life of cancer patients Front. Psychol. 2022 13 833176 10.3389/fpsyg.2022.833176 35356348 PMC8959607 14. Ośmiałowska E. Staś J. Chabowski M. Jankowska-Polańska B. Illness perception and quality of life in patients with breast cancer Cancers 2022 14 1214 10.3390/cancers14051214 35267522 PMC8909179 15. Porkert S. Lehner-Baumgartner E. Valencak J. Knobler R. Riedl E. Jonak C. Patients’ illness perception as a tool to improve individual disease management in primary cutaneous lymphomas Acta Derm.-Venereol. 2018 98 240 245 10.2340/00015555-2819 29048099 16. Nguyen T. Li X. Understanding public-stigma and self-stigma in the context of dementia: A systematic review of the global literature Dementia 2020 19 148 181 10.1177/1471301218800122 31920117 17. Ernst J. Mehnert A. Dietz A. Hornemann B. Esser P. Perceived stigmatization and its impact on quality of life: Results from a large register-based study including breast, colon, prostate, and lung cancer patients BMC Cancer 2017 17 741 10.1186/s12885-017-3742-2 29121876 PMC5680772 18. Uzun S. Ediz C. Mohammadnezhad M. Hematology patients’ metaphorical perceptions of the disease and psychosocial support needs in the treatment process: A phenomenological study from a rural region of Türkiye Support Care Cancer 2025 33 222 10.1007/s00520-025-09278-z 40000464 PMC11860990 19. Naik R.P. Haywood C. Jr. Sickle cell trait diagnosis: Clinical and social implications Hematol. Am. Soc. Hematol. Educ. Program. 2015 2015 160 167 10.1182/asheducation-2015.1.160 PMC4697437 26637716 20. Carver C.S. Scheier M.F. Dispositional optimism Trends Cogn. Sci. 2014 18 293 299 10.1016/j.tics.2014.02.003 24630971 PMC4061570 21. Colby D.A. Shifren K. Optimism, mental health, and quality of life: A study among breast cancer patients Psychol. Health Med. 2013 18 10 20 10.1080/13548506.2012.686619 22690751 22. Oken M.M. Creech R.H. Tormey D.C. Horton J. Davis T.E. McFadden E.T. Carbone P.P. Toxicity and response criteria of the Eastern Cooperative Oncology Group Am. J. Clin. Oncol. 1982 5 649 655 Available online: https://pubmed.ncbi.nlm.nih.gov/7165009/ (accessed on 4 April 2025) 10.1097/00000421-198212000-00014 7165009 23. Castaños-Cervantes S. Domínguez-González A. Depression in Mexican medical students: A path model analysis Heliyon 2020 6 e04178 10.1016/j.heliyon.2020.e04178 32566786 PMC7298399 24. Silpakit C. Sirilerttrakul S. Jirajarus M. Sirisinha T. Sirachainan E. Ratanatharathorn V. The European Organization for Research and Treatment of Cancer Quality of Life Questionnaire (EORTC QLQ-C30): Validation study of the Thai version Qual. Life Res. 2006 15 167 172 10.1007/s11136-005-0449-7 16411041 25. Látos M. Lázár G. Csabai M. A Rövid Betegségpercepció Kérdőív magyar változatának megbízhatósági vizsgálata [The reliability and validity of the Hungarian version of the Brief Illness Perception Questionnaire] Orvosi Hetil. 2021 162 212 218 10.1556/650.2021.31999 33550273 26. Timmermans I. Versteeg H. Meine M. Pedersen S.S. Denollet J. Illness perceptions in patients with heart failure and an implantable cardioverter defibrillator: Dimensional structure, validity, and correlates of the brief illness perception questionnaire in Dutch, French and German patients J. Psychosom. Res. 2017 97 1 8 10.1016/j.jpsychores.2017.03.014 28606488 27. Szőcs H. Horváth Z. Vizin G. A szégyen mediációs szerepe a stigma és az életminőség kapcsolatában coeliakiában szenvedő betegek körében: A 8 tételes Stigmatizáció Krónikus Betegségekben Kérdőív magyar adaptálás [The Hungarian adaptation of the Stigma Scale for Chronic Illness-8: Shame mediates the relationship between stigma and quality of life among patients with coeliac disease] Orvosi Hetil. 2021 162 1968 1976 10.1556/650.2021.32258 34864639 28. Bérdi M. Köteles F. Az optimizmus mérése: Az Életszemlélet Teszt átdolgozott változatának (LOT–R) pszichometriai jellemzői hazai mintán. [The measurement of optimism: The psychometric properties of the Hungarian version of the Revised Life Orientation Test (LOT–R)] Hung. J. Psychol. 2010 65 273 294 10.1556/mpszle.65.2010.2.7 29. Hinz A. Schulte T. Finck C. Gómez Y. Brähler E. Zenger M. Körner A. Tibubos A.-N. Psychometric evaluations of the Life Orientation Test-Revised (LOT-R), based on nine samples Psychol. Health 2022 37 767 779 10.1080/08870446.2021.1892111 33754894 30. Baron R.M. Kenny D.A. The moderator-mediator variable distinction in social psychological research: Conceptual, strategic, and statistical considerations J. Pers. Soc. Psychol. 1986 51 1173 1182 10.1037/0022-3514.51.6.1173 3806354 31. Preacher K.J. Hayes A.F. Asymptotic and resampling strategies for assessing and comparing indirect effects in multiple mediator models Behav. Res. Methods 2008 40 879 891 10.3758/BRM.40.3.879 18697684 32. Hayes A.F. Introduction to Mediation, Moderation, and Conditional Process Analysis: A Regression-Based Approach 3rd ed. The Guilford Press New York, NY, USA 2022 33. Ames S.C. Lange L. Ames G.E. Heckman M.G. White L.J. Roy V. Foran J.M. A prospective study of the relationship between illness perception, depression, anxiety, and quality of life in hematopoietic stem cell transplant patients Cancer Med. 2024 13 e6906 10.1002/cam4.6906 38205943 PMC10905249 34. Lekarakou C. Koulierakis G. Pontikoglou C. Illness perceptions and illness outcomes in patients with hematologic diseases: A narrative review Psychology 2024 15 444 462 10.4236/psych.2024.154028 35. Blake A. Asnani V. Leger R.R. Harris J. Odesina V. Hemmings D.L. Morris D.A. Knight-Madden J. Wagner L. Asnani M.R. Stigma and illness uncertainty: Adding to the burden of sickle cell disease Hematology 2018 23 122 130 10.1080/10245332.2017.1359898 28766464 36. Allart-Vorelli P. Porro B. Baguet F. Michel A. Cousson-Gélie F. Haematological cancer and quality of life: A systematic literature review Blood Cancer J. 2015 5 e305 10.1038/bcj.2015.29 25909835 PMC4450328 37. Yıldız K. Koç Z. Stigmatization, discrimination and illness perception among oncology patients: A cross-sectional and correlational study Eur. J. Oncol. Nurs. 2021 54 102000 10.1016/j.ejon.2021.102000 34492525 38. Amonoo H.L. Barclay M.E. El-Jawahri A. Traeger L.N. Lee S.J. Huffman J.C. Positive psychological constructs and health outcomes in hematopoietic stem cell transplantation patients: A systematic review Biol. Blood Marrow Transplant. 2019 25 e5 e16 10.1016/j.bbmt.2018.09.030 30308327 39. Megari K. Quality of life in chronic disease patients Health Psychol. Res. 2013 1 e27 10.4081/hpr.2013.932 26973912 PMC4768563 40. Knowles S.R. Apputhurai P. Jenkins Z. O’fLaherty E. Ierino F. Langham R. Ski C.F. Thompson D.R. Castle D.J. Impact of chronic kidney disease on illness perceptions, coping, self-efficacy, psychological distress and quality of life Psychol. Health Med. 2023 28 1963 1976 10.1080/13548506.2023.2179644 36794381 41. Westbrook T.D. Morrison E.J. Maddocks K.J. Awan F.T. Jones J.A. Woyach J.A. Johnson A.J. Byrd J.C. Andersen B.L. Illness perceptions in chronic lymphocytic leukemia: Testing Leventhal’s self-regulatory model Ann. Behav. Med. 2019 53 839 848 10.1093/abm/kay093 30590383 PMC6696900 42. Wong W.S. Fielding R. Quality of life and pain in Chinese lung cancer patients: Is optimism a moderator or mediator? Qual. Life Res. 2007 16 53 63 10.1007/s11136-006-9106-z 17091368 43. Applebaum A.J. Stein E.M. Lord-Bessen J. Pessin H. Rosenfeld B. Breitbart W. Optimism, social support, and mental health outcomes in patients with advanced cancer Psychooncology 2014 23 299 306 10.1002/pon.3418 24123339 PMC4001848 44. Quinn B. Ludwig H. Bailey A. Khela K. Marongiu A. Carlson K.B. Rider A. Seesaghur A. Physical, emotional and social pain communication by patients diagnosed and living with multiple myeloma Pain Manag. 2022 12 59 74 10.2217/pmt-2021-0013 34139887 45. Shen Z. Shi S. Li C. Ruan C. The influence of social constraints on the quality of life of hematopoietic stem cell transplantation survivors: The chain mediating effect of illness perceptions and the fear of cancer recurrence Front. Psychol. 2022 13 1017561 10.3389/fpsyg.2022.1017561 36506995 PMC9732518 Figure 1 The observed model shows physical functioning as the outcome variable, illness perception as a predictor, cognitive and role functioning as mediators with the moderation of optimism. * p p p Figure 2 The observed model shows social functioning as the outcome variable, emotional functioning as a predictor, illness perception and stigmatization as mediators with the moderation of optimism. * p p medicina-61-01704-t001_Table 1 Table 1 Participants’ demographic and clinical characteristics ( n Variable n Mean (SD) Biological sex    Female 54 (56.3)   Male 42 (43.8) Age (years)  56.45 (15.55)  18–49 29 (30.2)   50–64 30 (31.3)  65– 37 (38.5) Educational status    Primary education 35 (36.5)   Secondary education 36 (37.5)  Tertiary education or higher 25 (26.0) Permanent residence (number of residents)    Village or smaller (0–5000) 26 (27.1)   Small town (5–20,000) 23 (24.1)  Medium town (20–100,000) 25 (26.1)  Large city (>100,000) 22 (22.9) Socioeconomic status    Lower and lower middle class 32 (33.3)   Middle class 55 (57.3)  Upper middle and upper class 9 (9.4) Type of disease    Leukemias and chronic myeloproliferative disease 52 (54.2)   Lymphomas 32 (33.3)  Multiple myeloma 9 (9.4)  Other non-malignant diseases (ET, PNH, TTP) 3 (3.1) Health condition (ECOG status 0–5)  0.48 (0.69)  0—fully active, able to carry on all pre-disease performance without restriction 58 (60.4)   1—Restricted in physically strenuous activity but ambulatory and able to carry out work of a light or sedentary nature, e.g., light housework, office work 30 (31.3)  2—Ambulatory and capable of all selfcare but unable to carry out any work activities; up and about more than 50% of waking hours 8 (8.3) Note. Definitions of abbreviations: ET = essential thrombocytosis; TTP = thrombotic microangiopathy; PNH = paroxysmal nocturnal hemoglobinuria. medicina-61-01704-t002_Table 2 Table 2 Items and reliability of latent variables (congeneric estimation). Construct and Item Description Loading α CR AVE Illness perception – 0.64 0.91 0.60 IP1 0.78    IP2 0.94    IP3 0.80    IP4 0.73    IP5 0.59    IP6 0.81    IP7 0.56    IP8 0.86    Stigmatization – 0.75 0.89 0.54 STIG1 0.87    STIG2 0.99    STIG3 0.82    STIG4 0.62    STIG5 0.89    STIG6 0.40    STIG7 0.59    STIG8 0.48    Optimism – 0.72 0.90 0.51 OPT1 0.65    OPT2 0.74    OPT3 0.69    OPT4 0.62    OPT5 0.58    OPT6 0.88    OPT7 0.78    OPT8 0.69    OPT9 0.82    OPT10 0.58    Physical functioning – 0.78 0.91 0.69 PH1 0.75    PH2 0.83    PH3 0.92    PH4 0.61    PH5 0.98    Role functioning – 0.87 0.74 0.59 R1 0.99    R2 0.89    Emotional functioning – 0.85 0.74 0.58 EF1 0.76    EF2 0.78    EF3 0.82    EF4 0.68    Cognitive functioning – 0.61 0.79 0.65 CF1 0.98    CF2 0.60    Social functioning – 0.79 0.73 0.59 SF1 0.88    SF1 0.99    Note. Definitions of abbreviations: CR = composite reliability; AVE = average variance extracted; IP = illness perception; STIG = stigmatization; OPT = optimism; PH = physical functioning; R = role functioning; EF = emotional functioning; CF = cognitive functioning; SF = social functioning. medicina-61-01704-t003_Table 3 Table 3 Correlation matrix of the relationship between the study variables. Variable Mean (SD) Range (Min–Max) 1. 2. 3. 4. 5. 6. 7. 8. 1. Illness perception 40.52 (11.86) 57 (10–67) (0.64)        2. Stigmatization 10.87 (3.49) 21 (8–29) 0.19 (0.79)       3. Optimism 37.05 (4.75) 23 (26–49) −0.29 ** −0.05 (0.60)      4. Physical functioning 3.38 (0.602) 3 (1–4) −0.46 ** −0.26 * 0.23 * (0.78)     5. Role functioning 3.20 (0.98) 3 (1–4) −0.42 ** −0.23 * 0.08 0.63 ** (0.87)    6. Emotional functioning 3.13 (0.69) 3 (1–4) −0.48 ** −0.32 ** 0.33 * 0.40 ** 0.44 ** (0.86)   7. Cognitive functioning 3.54 (0.66) 3 (1–4) −0.29 ** −0.49 ** 0.10 0.44 ** 0.45 ** 0.62 ** (0.60)  8. Social functioning 3.13 (0.95) 3 (1–4) −0.41 ** −0.46 ** 0.10 0.34 ** 0.51 ** 0.58 ** 0.46 ** (0.80) Note. Alpha values on the diagonal and correlation coefficients above the diagonal. Probability notes for p p p ",
  "metadata": {
    "Title of this paper": "The influence of social constraints on the quality of life of hematopoietic stem cell transplantation survivors: The chain mediating effect of illness perceptions and the fear of cancer recurrence",
    "Journal it was published in:": "Medicina",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12471519/"
  }
}