{
  "title": "Paper_271",
  "abstract": "pmc J Exp Clin Cancer Res J Exp Clin Cancer Res 618 jeccr Journal of Experimental & Clinical Cancer Research : CR 0392-9078 1756-9966 BMC PMC12487280 PMC12487280.1 12487280 12487280 41029457 10.1186/s13046-025-03534-0 3534 1 Research O-GlcNAcylation of UBAP2L regulates stress granule formation and sunitinib resistance in clear cell renal cell carcinoma Xing Jiajun Li Baochao Wang Songbo Wang Zengjun zengjunwang@njmu.edu.cn Miao Chenkui medicalmck@163.com https://ror.org/04py1g812 grid.412676.0 0000 0004 1799 0784 Department of Urology, The First Affiliated Hospital of Nanjing Medical University, 30 9 2025 2025 44 478191 273 4 6 2025 27 8 2025 30 09 2025 02 10 2025 02 10 2025 © The Author(s) 2025 2025 https://creativecommons.org/licenses/by/4.0/ Open Access http://creativecommons.org/licenses/by/4.0/ http://creativecommons.org/publicdomain/zero/1.0/ Background Sunitinib resistance is one of the main reasons for the poor prognosis of clear renal cell carcinoma (ccRCC). Moreover, Stress granules (SGs) was found to enhance the stress adaptation capability of tumor cells, becoming an important mechanism for drug resistance in various cancers. Methods We developed sunitinib-resistant patient-derived xenograft (PDX) and organoid (PDO) models to investigate sunitinib resistance in ccRCC. Proteomic analysis identified UBAP2L as a key mediator of this resistance. To explore its role in stress granule formation and sunitinib resistance, we conducted both in vitro and in vivo studies. We further elucidated the regulatory mechanisms of UBAP2L O-GlcNAcylation using immunoprecipitation, mass spectrometry, modification-based proteomics, RNA sequencing (RNA-seq), and RNA immunoprecipitation sequencing (RIP-seq). Results In this study, enrichment of UBAP2L was elucidated to be significantly associated with sunitinib-resistant ccRCC patient-derived xenograft (PDX) model. Functional experiments showed that UBAP2L protected ccRCC from apoptosis and promoted ccRCC prolifecation and angiogenesis upon sunitinib treatment, thus enhancing drug resistance of ccRCC cells. Furthermore, mechanistic investigation demonstrated that O-GlcNAcylation of UBAP2L promoted its protein stability via inhibiting TRIM37-mediated ubiquitination and it regulated stress granule formation, thereby enhancing the mRNA stability of Melk and activating the PI3K signaling pathways. Conclusions These results validated the significant roles of O-GlcNAcylation of UBAP2L in ccRCC sunitinib resistance, which provided an innovative theoretical basis for the clinical diagnosis and therapy of ccRCC. Supplementary Information The online version contains supplementary material available at 10.1186/s13046-025-03534-0. Graphical abstract  Supplementary Information The online version contains supplementary material available at 10.1186/s13046-025-03534-0. Keywords UBAP2L Renal cell carcinoma Patient-derived xenograft Sunitinib resistance O-GlcNAcylation Stress granule formation Jiangsu Province Capability Improvement Project through Science, Technology and Education ZDXK202219 Wang Zengjun National Natural Science Foundation of China 82203115 Miao Chenkui pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement yes pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes issue-copyright-statement © Italian National Cancer Institute ‘Regina Elena’ 2025 Introduction Renal cell carcinoma (RCC), a heterogeneous malignancy originating from the renal epithelium, accounts for approximately 3% of adult cancers globally, with rising incidence rates observed over the past decade [ 1 Clear cell RCC (ccRCC), the predominant histological subtype, is characterized by the inactivation of the von Hippel-Lindau (VHL) tumor suppressor gene and subsequent activation of hypoxia-inducible factors (HIFs), which drive angiogenesis and tumor progression [ 2 3 4 5 6 Emerging evidence suggests that sunitinib resistance arises from a multifaceted interplay of oncogenic signaling adaptations and remodeling of the tumor microenvironment (TME) [ 7 8 11 12 13 14 17 Current therapeutic strategies aim to overcome resistance through combination therapies targeting co-activated pathways. Preclinical models demonstrate the synergistic effects of sunitinib with mTOR inhibitors (temsirolimus) or epigenetic modulators, while ongoing clinical trials are investigating immune checkpoint inhibitors in refractory ccRCC [ 18 20 Stress granules (SGs) represent pivotal adaptive mechanisms in eukaryotic cells under environmental stress, dynamically regulating mRNA translation and degradation to enhance survival [ 21 22 24 Clinically, UBAP2L overexpression correlates with advanced tumor phenotypes and poor prognosis in multiple carcinomas [ 25 26 21 27 O-GlcNAcylation, a nutrient-sensitive post-translational modification, dynamically regulates protein functions by covalently attaching to serine/threonine residues through the enzymatic cycling of O-GlcNAc transferase (OGT) and O-GlcNAcase (OGA) [ 28 29 30 Herein, we constructed the acquired sunitinib-resistant ccRCC PDX model and cell models and demonstrated that UBAP2L regulates sunitinib resistance in renal cell carcinoma by modulating stress granule assembly. Mechanistically, UBAP2L undergoes O-GlcNAcylation mediated by OGT, enhancing its protein stability by suppressing TRIM37-triggered ubiquitination. As a critical assembly factor of stress granules, O-GlcNAcylated UBAP2L enhanced the mRNA stability of Melk and activating the PI3K signaling pathways through its dynamics, thereby promoting therapeutic resistance. Our findings suggest that targeting the O-GlcNAcylation of UBAP2L represents a novel therapeutic strategy for treating clear cell renal cell carcinoma. Method Clinical samples and database We obtained transcriptional and clinical data from the official website of The Cancer Genome Atlas (TCGA). All patients diagnosed with ccRCC were recruited from the Department of Urology at the First Affiliated Hospital of Nanjing Medical University at the time of surgery. The collection and analysis of tumor samples were conducted in accordance with the approval of the Ethics Committee of Nanjing Medical University, and all patients provided informed consent. The histological features of the tissue were independently examined by two pathologists according to WHO standards. Sunitinib-resistant RCC cell models and PDX models Cells (786-O and Caki-1) were intermittently exposed to increasing sunitinib concentrations (starting at 5µM) during logarithmic growth phases. Drug concentration was incrementally escalated to 20µM following confirmed tolerance. Resistance (786-O-R and Caki-1-R) were confirmed via CCK-8 assays under sunitinib pressure. Fresh tumor tissues from treatment-naive ccRCC patients were obtained. Tumor specimens (3–5 mm³ pieces) were washed in cold PBS containing 10% fetal bovine serum (FBS) and penicillin/streptomycin and subcutaneously implanted into 6-week-old male NOD-scid-IL2rg⁻/⁻ (NSG) mice. First-generation (P0) PDXs were passaged to subsequent generations (P1-P3) by re-implanting tumor fragments into new cohorts of mice. To induce sunitinib resistance, mice bearing established PDXs (tumor volume: ∼200 mm³) were orally administered sunitinib (40 mg/kg/day) for 6 weeks. Resistance was confirmed by tumor regrowth after an initial response phase (≥ 90% volume reduction). RCC Patient-derived organoid (PDO) construction Cut renal cell cancer tissue samples into approximately 1–3 mm³ tissue blocks under sterile conditions. Add digestion solution and digest at 37 °C for 15–30 min, then terminate digestion. Filter using a 100 μm filter. Collect the filtrate into a 15 ml centrifuge tube, and after a 5-minute enrichment centrifugation at 300 g and 4 °C, remove the supernatant. Add matrix gel to the cell pellet, mix by pipetting, and then perform plating. Place the prepared culture plates in a 37 °C incubator for 40–60 min to gel, then add 500–750 µl organoid culture medium for culture. Cell lines and culture The human renal cell carcinoma cell lines 786-O (CVCL_1051) and Caki-1 (CVCL_0234) were purchased from Procell Life Science & Technology (Wuhan, China). The human embryonic kidney cell line 293T (CVCL_0063) were purchased from American Type Culture Collection (ATCC, USA). The 786-O (Procell) and Caki-1 (Procell) were cultured in RPMI-1640 medium (Gibco) supplemented with 10% fetal bovine serum (FBS, Gibco), 100 U/mL penicillin, and 100 µg/mL streptomycin. The 293T (ATCC) was maintained in Dulbecco’s Modified Eagle Medium (DMEM, Gibco) containing 10% FBS. All cell lines were authenticated by short tandem repeat (STR) profiling and routinely tested for mycoplasma contamination using MycoAlert kits every 6 months. Cells were incubated at 37 °C in a humidified atmosphere with 5% CO 2 Stress granule fractionation and enrichment In brief, 786-O and Caki-1 cell lines were treated with 2µM sunitinib for 24 h. The cells were subjected to a brief treatment with digitonin to render the membrane permeable, followed by homogenization and lysis using a specific lysis buffer. In a low-temperature environment, impurities and unpelleted components were removed by gradually increasing the centrifugation speed and duration (8500 g for 2 min, followed by 18000 g for 20 min), ultimately yielding a high-purity stress granule (SG) core component (S850) [ 31 Co-Immunoprecipitation, silver staining, and MS analysis Cells were lysed in ice-cold RIPA buffer (Thermo Fisher Scientific) containing 1% Triton X − 100, 150 mM NaCl, 50 mM Tris - HCl (pH 7.5), and protease inhibitor cocktail. Lysates were centrifuged at 12,000 × g for 15 min at 4 °C to remove debris. Supernatants were pre - cleared with Protein A/G - agarose beads (Selleck) and incubated with specific primary antibodies or IgG control overnight at 4 °C with rotation. Immunocomplexes were captured with Protein A/G magnetic beads (Thermo Fisher Scientific) at 4 °C for 2 h. Beads were washed 5 times with lysis buffer, resuspended in SDS sample buffer, and boiled at 95 °C for 10 min. Proteins were separated by SDS - PAGE and analyzed by immunoblotting with appropriate secondary antibodies. Non - specific IgG controls were included for antibody specificity confirmation. For Co-Immunoprecipitation (Co-IP) to identify interacting proteins, precipitated protein complexes were visualized by silver staining. Protein samples from Co-IP assays were separated by 10% SDS-PAGE. After electrophoresis, gels were fixed and processed using a Fast Silver Stain Kit (Beyotime, P0017S) as per the manufacturer’s instructions. Silver-stained bands were visualized under white light. Selected bands of interest were excised for subsequent mass spectrometry (MS) identification. Parallel negative controls with non-specific IgG antibodies were set for specificity confirmation. MS analysis was performed by Shanghai Applied Protein Technology. Antibodies, chemicals, plasmids and lentivirus The antibodies used as follows: β-Actin (66009-1-Ig, Proteintech), UBAP2L (A300-533 A, BETHYL, ), Melk (2274, Cell Signaling Technology), GAPDH (2118, Cell Signaling Technology), Flag (14793, Cell Signaling Technology), cleaved caspase-3 (TA327916, Origene), caspase-3 (19677-1-AP, Proteintech), Ubiquitin (20326, Cell Signaling Technology), O-GlcNAc (9875, Cell Signaling Technology), HA (3724, Cell Signaling Technology), Myc (2276, Cell Signaling Technology). The chemicals used as follows: Sunitinib (S7781), 3-MA (S2726), MG132 (S2619), Cycloheximide (S7418) were purchased from Selleck. The sources of the remaining reagents are marked clearly in each section. Plasmids and Lentivirus were constructed by GENECHEM Biotech and Corues Biotechnology. The sequences of all short-hairpin RNAs (shRNAs) and sgRNA are listed in Supplementary Table S1 RNA Immunoprecipitation RNA Immunoprecipitation (RIP) was performed using the Magna RIP™ Kit (17–700, Millipore). The 10 7 S2 Glutathione S-transferase (GST) pull-down assay Glutathione S-transferase (GST) pull-down assay was performed to examine protein-protein interactions. GST or GST-tagged recombinant proteins were expressed in Escherichia coli BL21 and immobilized onto Anti-GST Magnetic Beads (Beyotime, P2138) in binding buffer. After incubation with cell lysates overnight at 4 °C with gentle rotation, beads were washed 5 times with ice-cold lysis buffer. Bound proteins were eluted using SDS loading buffer and analyzed by SDS-PAGE followed by Coomassie blue staining and immunoblotting with specific antibodies. Control experiments with GST alone were conducted in parallel to confirm interaction specificity. Subcutaneous xenograft tumor model Male NOD-SCID mice (4 weeks old) were subcutaneously injected with 1 × 10 7 Apoptosis assay and detection of caspase-3 activity and TUNEL staining assay For apoptosis analysis, cells were harvested, washed with PBS, and stained with Annexin V-APC and 7-AAD using apoptosis kits (KeyGEN BioTECH, KGA1106) according to the manufacturer’s instructions. After 15 min incubation in the dark, samples were analyzed by flow cytometry. Caspase3 activity was measured via spectrophotometry using a kit (Absin, abs50025), where enzymatic cleavage of the caspase-3-specific substrate (pNA) was quantified by absorbance at 405 nm. For TUNEL staining, apoptotic cells were labeled using a TUNEL assay kit (Vazyme). Human umbilical vein endothelial cell (HUVEC) tubule formation assay HUVECs were co-cultured with treated cells. 48-well plates were precoated with 150 µL of Matrigel (Corning, USA) per well and polymerized at 37 °C for 30 min. Subsequently, HUVECs (1 × 10 4 CCK-8 assay and colony formation assay Cells were seeded into 96-well plates at a density of 2 × 10 3 Cells (1000 cells/well) were seeded into 6-well plates and cultured for 7–14 days. Colonies were fixed with 4% paraformaldehyde and stained with 0.5% crystal violet (Beyotime) for 30 min. Visible colonies (> 50 cells per colony) were counted using ImageJ software. Dual-luciferase reporter assay Cells were seeded in 6-well plates and transfected at 70–80% confluence with the indicated dual-luciferase reporter plasmids (Corues Biotechnology), using transfection reagents such as Lipo3000 (Thermo Fisher Scientific). After 48 h of incubation, cells were lysed, and luciferase activities were measured using a Dual-Luciferase Reporter Assay System (Vazyme) according to manufacturer protocols. Firefly luciferase activity was normalized to Renilla luciferase activity to account for variations in transfection efficiency. Statistical analysis Consistent with established literature, experimental data are presented as mean ± standard deviation, with the number of experimental samples detailed in this paper. Statistical analyses were conducted using GraphPad 8.0. Data from two groups were assessed using a two-tailed t-test, while significant differences among more than two groups were determined using one-way ANOVA. P Result Overexpression of UBAP2L is associated with acquired resistance to sunitinib in ccRCC To investigate the mechanisms that potentially contribute to the development of sunitinib resistance in ccRCC, we established PDX and patient-derived organoid (PDO) models from samples obtained from a surgically resected ccRCC patient. Six ccRCC PDX models were randomly assigned to two groups ( n 1 S1 1 2 S2 S3 p 1 1  Fig. 1 UBAP2L is highly expressed in sunitinib-resistant ccRCC PDX and is associated with poor prognosis. ( A B 2 2 P C P D http://biocc.hrbmu.edu.cn/CancerSEA/ E n n F G  Fig. 2 UBAP2L promotes sunitinib resistance of ccRCC cells in vitro. ( A-B C-E F G P P P P H-L H I J-K L P P P To investigate the connection between UBAP2L and acquired sunitinib resistance in ccRCC, we first assessed UBAP2L expression in both drug-resistant and drug-sensitive PDX models. UBAP2L expression levels were significantly higher in the sunitinib-resistant PDX group compared to the control group (Fig. 1 S1 1 1 S1 S1 UBAP2L regulates stress granule formation and promotes the resistance to sunitinib of ccRCC in vitro Initially, we suppressed the expression of UBAP2L using two independent shRNAs targeting UBAP2L (shUBAP2L-1 and shUBAP2L-2) in the 786-O and Caki-1 and their drug-resistant cell lines. Following knockdown, the expression level of UBAP2L in each cell line was assessed through Western blot assays (Fig. 2 S3 2 S3 Subsequently, we examined the sunitinib resistance associated with UBAP2L in vitro using CCK8 assays and colony formation techniques. Notably, UBAP2L knockdown resulted in diminished cell viability, decreased maximal inhibitory concentration (IC50) values, and a reduction in both the number and size of colonies in ccRCC cells following sunitinib treatment (Fig. 2 S3 S3 2 S3 2 S3 S3 2 S4 2 S4 3  Fig. 3 UBAP2L regulates stress granule formation and promoted the resistance to sunitinib of ccRCC in vitro. ( A B P P C D E n F G H H&E Collectively, these findings indicate that UBAP2L is crucial for the proliferation and angiogenesis of ccRCC and plays a pivotal role in regulating the sensitivity of ccRCC cells to sunitinib. Reports indicated that UBAP2L is a crucial component of stress granules (SGs) and is essential for their assembly [ 21 32 3 S4 S4 3 S4 Targeting UBAP2L synergizes the efficacy of sunitinib in ccRCC treatment To investigate the effect of UBAP2L and sunitinib in vivo, orthotopic xenograft models in mice were established using 786-O cells. (Fig. 3 3 3 Notably, sunitinib combined with UBAP2L knockdown impressively mitigated tumor growth compared with the control group, whereas UBAP2L knockdown or sunitinib alone exhibited a partial inhibitory effect. The apoptotic marker (cleaved caspase 3) and proliferation marker (Ki67 and PCNA) staining ascertained that UBAP2L knockdown enhance the anti-tumor activity of sunitinib in vivo through the inhibition of proliferation and the promotion of apoptosis (Fig. 3 UBAP2L is O-GlcNAcylated by OGT at conserved serine 305 Based on the observed mRNA and protein levels in clinical samples, we found that the increase in UBAP2L protein levels was more pronounced than the increase in mRNA levels in sunitinib-resistant ccRCC cells. This suggests the involvement of post-translational modifications in the regulation of UBAP2L (Fig. 1 S1 Sliver staining for gel electrophoresis of Flag-UBAP2L-immunoprecipitation in 786-O cells was conducted to show potential interactions based on molecular weight (Fig. 4 4 S5 4 4 4 4 S5 4 4  Fig. 4 UBAP2L interacts with OGT. ( A B C D E F G H- I J K Next, given that OGT is the only enzyme known to catalyze O-GlcNAc modification, we examined whether UBAP2L could be O-GlcNAcylated. Western blot analysis using an anti-O-GlcNAc antibody showed a positive signal in the UBAP2L immunoprecipitated from ccRCC cells (Fig. 5 5  Fig. 5 O-GlcNAcylation of UBAP2L at serine 305 regulates stress granule formation and sunitinib resistance in renal cell carcinoma. ( A B C D P E F P P G-H I-J K n Moreover, the O-GlcNAcylated proteins immunoprecipitated from ccRCC cells were analyzed using electron transfer dissociation mass spectrometry, which revealed the S305 site of UBAP2L as the O-GlcNAcylation site. We also employed the YinOYang 1.2 Server to predict other potential O-GlcNAcylation sites on UBAP2L, identifying S439 and S751 as having the highest probability of modification. To ascertain which site is primarily responsible for O-GlcNAcylation, we mutated each site to alanine in HEK293T cells. The most significant reduction in UBAP2L O-GlcNAcylation occurred when the S305 site was mutated (Fig. 5 5 In addition, we generated overexpression models of UBAP2L wild type (WT) and a catalytic inactive mutant (MUT) in ccRCC cells. As anticipated, overexpression of UBAP2L-WT increased sunitinib resistance in 786-O and Caki-1 cells compared to both control and UBAP2L-MUT overexpression cells (Fig. 5 5 S5 5 S5 To investigate whether O-GlcNAcylation of UBAP2L is essential for stress granule (SG) formation, we treated UBAP2L-WT and UBAP2L-S305A overexpression ccRCC cells with sunitinib and performed immunostaining for UBAP2L and G3BP1. As illustrated in Fig. 5 S6 O-GlcNAcylation of UBAP2L promotes its protein stability via inhibiting TRIM37-mediated ubiquitination We subsequently investigated the influence of O-GlcNAcylation on UBAP2L. Our results demonstrated that OGT and the O-GlcNAcylation levels of UBAP2L, were significantly elevated in sunitinib-resistant ccRCC cells (Fig. 6 S6 6 6 6 6 6  Fig. 6 O-GlcNAcylation of UBAP2L promotes its protein stability. ( A-B C-D E F-G H Previous studies have shown that UBAP2L is degraded via the ubiquitin-proteasome system (UPS). In ccRCC cells, treatment with the proteasome inhibitor MG132 significantly increased UBAP2L protein levels, while treatment with the autophagy inhibitor 3-MA had no effect on UBAP2L expression, suggesting that UBAP2L degradation occurs primarily through the UPS (Fig. 7 S6 7 4 7 S6 7 S6 7 7 7 7 7  Fig. 7 O-GlcNAcylation protects UBAP2L from TRIM37 mediated ubiquitination. ( A B C D E F G H I UBAP2L directly binds Melk and enhances its mRNA stability via regulating stress granule formation to activate PI3K signaling in ccRCC To decipher the mechanism through which the UBAP2L modulates sunitinib resistance in ccRCC, we conducted multiomics analysis to pinpoint downstream targets regulated by UBAP2L. UBAP2L-binding transcripts were determined by UBAP2L RNA immunoprecipitation sequencing (RIP-seq) analyses (Fig. 8 8 P S7 8  Fig. 8 UBAP2L regulates mRNA stability of Melk activating the PI3K signaling pathways to enhance sunitinib resistance in ccRCC. ( A B C D P P E P P P F-G P P H I P J K To determine whether there exists a bona fide interaction between UBAP2L and Melk, the RIP assay confirmed the direct binding of UBAP2L to the Melk transcript (Fig. 8 8 8 S8 The protein expression of Melk and its target genes, including p-PI3K, p-AKT, and p-mTOR, was significantly reduced following knockdown of either Melk or UBAP2L in ccRCC cell lines (Fig. 8 8 S8 To validate whether Melk acts as a downstream effector of UBAP2L in regulating ccRCC sunitinib resistance, we performed rescue assays by overexpressing Melk in UBAP2L knockdown 786-O and Caki-1 cells. Functional assays revealed that Melk overexpression significantly promoted proliferation and drug resistance to sunitinib in UBAP2L knockdown ccRCC cells (Fig. 9 S8 9  Fig. 9 Ectopic expression of Melk rescues ccRCC sunitinib resistance in UBAP2L knockdown in vitro and in vivo and pharmacological decreases in the O-GlcNAcylation of UBAP2L inhibits stress granule formation and restores the sunitinib sensitivity of ccRCC. ( A B C D E F G H P I J K P Pharmacological decreases in the O-GlcNAcylation of UBAP2L restores the sunitinib sensitivity of ccRCC To translate our findings into a clinical context, we investigated the effects of reduced O-GlcNAcylation of UBAP2L in ccRCC. Our results indicated that OSMI-1, an inhibitor of OGT, significantly decreased O-GlcNAcylation in ccRCC cells, as well as the expression levels of UBAP2L and components of the Melk-PI3K-AKT-mTOR signaling pathway (Fig. 9 9 S8 Furthermore, we examined the impact of OSMI-1 on stress granule (SG) formation. 786-O and Caki-1 cells were treated with OSMI-1 and sunitinib, followed by immunostaining for UBAP2L and G3BP1. As illustrated in Fig. 9 S9 In line with our in vitro results, the patient-derived xenograft (PDX) ccRCC mouse model receiving 1 mg/kg OSMI-1 treatment for 40 days (administered every two days from day 30 to day 70 post-tumor implantation) exhibited slower tumor growth and enhanced survival compared to the vehicle-treated control group (Fig. 9 Additionally, we utilized a patient-derived organoid (PDO) model to further investigate the function of OSMI-1. As illustrated in Fig. S8 Collectively, these findings indicate that OSMI-1 treatment may effectively suppress stress granule formation by reducing UBAP2L O-GlcNAcylation. This suppression subsequently decreases the mRNA stability of Melk and inhibits the PI3K signaling pathways, thereby increasing sunitinib sensitivity in clear cell renal cell carcinoma. Discussion Sunitinib has served as a cornerstone in the treatment of metastatic ccRCC for over 10 years. However, the molecular mechanisms underlying both intrinsic and acquired resistance remain poorly understood. In our study, we developed sunitinib-resistant PDX models and identified UBAP2L as a critical mediator of sunitinib resistance. This research uncovers a novel regulatory axis that O-GlcNAcylation of UBAP2L promoted its protein stability via inhibiting TRIM37-mediated ubiquitination and regulated stress granule formation, thereby enhancing the mRNA stability of Melk and activating the PI3K signaling pathway. Previous research has implicated UBAP2L in drug resistance across various cancer types. However, its role in ccRCC has not been previously defined. In this study, we demonstrate that UBAP2L is upregulated in sunitinib-resistant ccRCC PDX models, clinical tissues, and cell lines. Functional validation indicates that its overexpression promotes sunitinib resistance both in vitro and in vivo. This finding is consistent with the established roles of UBAP2L in enhancing tumor progression through pathways such as PI3K/AKT and NF-κB in gastric cancer, suggesting that its functions in oncogenesis are conserved yet context-specific [ 33 A central finding of our work is the involvement of UBAP2L in orchestrating stress granule (SG) formation, a critical adaptive response that enables cancer cells to survive therapeutic stress. We show that UBAP2L acts as a core component of SGs in ccRCC, driving SG nucleation, thereby mediating sunitinib resistance. SGs function as hubs for mRNA storage and translational repression, fostering resistance by modulating apoptosis, stress tolerance, and interactions within the tumor microenvironment [ 34 36 37 38 27 39 O-GlcNAcylation has emerged as a critical regulator of UBAP2L stability. We identified OGT as the enzyme that mediates O-GlcNAcylation of UBAP2L at serine 305 (S305), a modification that protects UBAP2L from TRIM37-dependent ubiquitin-proteasomal degradation. The finding bridges two vital post-translational regulatory systems—O-GlcNAcylation and ubiquitination—in controlling UBAP2L levels, a balance that is pivotal for SG assembly and subsequent sunitinib resistance. Mechanistically, stabilized UBAP2L promotes resistance by enhancing Melk mRNA stability, thus activating the PI3K-AKT-mTOR pathway, a known driver of therapeutic resistance. O-GlcNAcylation enhances protein stability by inhibiting ubiquitination-mediated degradation, corroborating earlier findings. Specifically, O-GlcNAcylation interrupts the ubiquitination process and subsequent proteasomal degradation by obstructing the interaction between β-catenin and β-TrCP, a subunit of the E3 ubiquitin ligase complex, which ultimately leads to increased protein stability [ 40 41 42 Clinically, targeting the OGT-UBAP2L axis with the small-molecule inhibitor OMSI-1 replicates reduced UBAP2L expression, suppressed PI3K-AKT-mTOR signaling, and restored sunitinib sensitivity in resistant ccRCC cells. This suggests that disrupting O-GlcNAcylation-dependent UBAP2L stabilization may represent a viable strategy to overcome sunitinib resistance. Our work aligns with emerging efforts to target SGs and post-translational modifications in cancer therapy, such as MPN-based SG inhibitors in hepatocellular carcinoma and G3BP2-targeted approaches in breast cancer, underscoring the translational potential of targeting stress response pathways [ 34 43 A limitation of this study is the need for a larger number of PDX and PDO models to validate our conclusions concerning the clinical application of drug-resistant targets. Furthermore, the role of stress granules in promoting tumor drug resistance may involve a dual mechanism, necessitating further investigation into the potential interactions between UBAP2L and stress granules. Additionally, O-GlcNAcylation is a dynamic and reversible modification, therefore, a more thorough exploration of the balance between O-GlcNAcylation and de-O-GlcNAcylation of UBAP2L in ccRCC is warranted. Conclusions This study delineates a novel mechanism by which OGT-mediated O-GlcNAcylation of UBAP2L enhances stress granule formation and Melk mRNA stability, thereby driving sunitinib resistance in ccRCC. These findings not only advance our understanding of treatment resistance in renal cell carcinoma but also underscore UBAP2L and its regulatory modifications as promising targets for overcoming therapeutic challenges. Future research should investigate the interplay between UBAP2L-dependent SG functions and broader metabolic or immune pathways in ccRCC, as well as validate OGT inhibition in preclinical and clinical settings. Supplementary Information Below is the link to the electronic supplementary material.  Supplementary Material 1 Publisher’s note Springer Nature remains neutral with regard to jurisdictional claims in published maps and institutional affiliations. Jiajun Xing, Baochao Li and Songbo Wang contributed equally to this work. Acknowledgements Not applicable. Author contributions C.M. conceived the project, designed the experiments, analyzed the data, and wrote the paper. J.X performed the experiments, analyzed the data, and wrote the paper. S.W. and B.L. performed the experiments. Z.W. and C.M. analyzed the data and edited the manuscript. Funding This work was supported by the National Natural Science Foundation of China (Grant No: 82203115 to C.M.), Jiangsu Province Capability Improvement Project through Science, Technology and Education (No: ZDXK202219 to Z.W); Natural Science Foundation of Jiangsu Province (No: BK20220726 to C.M.); Project funded by China Postdoctoral Science Foundation (No: 2022M711407 to C.M.); Nanjing Science and Technology Innovation Project for Overseas Scholars (No: BSHNJ200201 to C.M.). Data availability No datasets were generated or analysed during the current study. Declarations Ethics approval and consent to participate Informed written consent was obtained from all patients. The collection and analysis of tumor and clinical data were approved by the Ethics Committee of Nanjing Medical University (approval No. 2021-SR-430), and the research adhered to established ethical standards. Animal studies were conducted following approval from the Institutional Animal Care and Use Committee (IACUC) of Nanjing Medical University (approval No. 2406068). The construction of the xenotransplantation model complied with institutional guidelines and received approval from the IACUC of Nanjing Medical University. Consent for publication All the authors consent for this manuscript publication. Competing interests The authors declare no competing interests. References 1. Meric-Bernstam F Tannir NM Iliopoulos O Lee RJ Telli ML Fan AC DeMichele A Haas NB Patel MR Harding JJ Telaglenastat plus Cabozantinib or everolimus for advanced or metastatic renal cell carcinoma: an Open-Label phase I trial Clin Cancer Res 2022 28 8 1540 8 10.1158/1078-0432.CCR-21-2972 35140121 PMC9164172 Meric-Bernstam F, Tannir NM, Iliopoulos O, Lee RJ, Telli ML, Fan AC, DeMichele A, Haas NB, Patel MR, Harding JJ, et al. Telaglenastat plus Cabozantinib or everolimus for advanced or metastatic renal cell carcinoma: an Open-Label phase I trial. Clin Cancer Res. 2022;28(8):1540–8. 35140121 10.1158/1078-0432.CCR-21-2972 PMC9164172 2. Hsieh JJ Chen D Wang PI Marker M Redzematovic A Chen YB Selcuklu SD Weinhold N Bouvier N Huberman KH Genomic biomarkers of a randomized trial comparing First-line everolimus and Sunitinib in patients with metastatic renal cell carcinoma Eur Urol 2017 71 3 405 14 10.1016/j.eururo.2016.10.007 27751729 PMC5431298 Hsieh JJ, Chen D, Wang PI, Marker M, Redzematovic A, Chen YB, Selcuklu SD, Weinhold N, Bouvier N, Huberman KH, et al. Genomic biomarkers of a randomized trial comparing First-line everolimus and Sunitinib in patients with metastatic renal cell carcinoma. Eur Urol. 2017;71(3):405–14. 27751729 10.1016/j.eururo.2016.10.007 PMC5431298 3. Chamie K Donin NM Klöpfer P Bevan P Fall B Wilhelm O Störkel S Said J Gambla M Hawkins RE Adjuvant weekly Girentuximab following nephrectomy for High-Risk renal cell carcinoma: the ARISER randomized clinical trial JAMA Oncol 2017 3 7 913 20 10.1001/jamaoncol.2016.4419 27787547 PMC5824229 Chamie K, Donin NM, Klöpfer P, Bevan P, Fall B, Wilhelm O, Störkel S, Said J, Gambla M, Hawkins RE, et al. Adjuvant weekly Girentuximab following nephrectomy for High-Risk renal cell carcinoma: the ARISER randomized clinical trial. JAMA Oncol. 2017;3(7):913–20. 27787547 10.1001/jamaoncol.2016.4419 PMC5824229 4. Ito T Kutikov A Kidney cancer in 2014: key advances promise progress for kidney cancer patients Nat Rev Urol 2015 12 2 69 70 10.1038/nrurol.2014.356 25600094 Ito T, Kutikov A. Kidney cancer in 2014: key advances promise progress for kidney cancer patients. Nat Rev Urol. 2015;12(2):69–70. 25600094 10.1038/nrurol.2014.356 5. Voutouri C Kirkpatrick ND Chung E Mpekris F Baish JW Munn LL Fukumura D Stylianopoulos T Jain RK Experimental and computational analyses reveal dynamics of tumor vessel cooption and optimal treatment strategies Proc Natl Acad Sci USA 2019 116 7 2662 71 10.1073/pnas.1818322116 30700544 PMC6377457 Voutouri C, Kirkpatrick ND, Chung E, Mpekris F, Baish JW, Munn LL, Fukumura D, Stylianopoulos T, Jain RK. Experimental and computational analyses reveal dynamics of tumor vessel cooption and optimal treatment strategies. Proc Natl Acad Sci USA. 2019;116(7):2662–71. 30700544 10.1073/pnas.1818322116 PMC6377457 6. Molina AM Lin X Korytowsky B Matczak E Lechuga MJ Wiltshire R Motzer RJ Sunitinib objective response in metastatic renal cell carcinoma: analysis of 1059 patients treated on clinical trials Eur J Cancer 2014 50 2 351 8 10.1016/j.ejca.2013.08.021 24051327 Molina AM, Lin X, Korytowsky B, Matczak E, Lechuga MJ, Wiltshire R, Motzer RJ. Sunitinib objective response in metastatic renal cell carcinoma: analysis of 1059 patients treated on clinical trials. Eur J Cancer. 2014;50(2):351–8. 24051327 10.1016/j.ejca.2013.08.021 7. Jin J Xie Y Zhang JS Wang JQ Dai SJ He WF Li SY Ashby CR Jr Chen ZS He Q Sunitinib resistance in renal cell carcinoma: from molecular mechanisms to predictive biomarkers Drug Resist Updates: Reviews Commentaries Antimicrob Anticancer Chemother 2023 67 100929 10.1016/j.drup.2023.100929 36739809 Jin J, Xie Y, Zhang JS, Wang JQ, Dai SJ, He WF, Li SY, Ashby CR Jr., Chen ZS, He Q. Sunitinib resistance in renal cell carcinoma: from molecular mechanisms to predictive biomarkers. Drug Resist Updates: Reviews Commentaries Antimicrob Anticancer Chemother. 2023;67:100929. 10.1016/j.drup.2023.100929 36739809 8. Schoumacher M Burbridge M Key roles of AXL and MER receptor tyrosine kinases in resistance to multiple anticancer therapies Curr Oncol Rep 2017 19 3 19 10.1007/s11912-017-0579-4 28251492 PMC5332501 Schoumacher M, Burbridge M. Key roles of AXL and MER receptor tyrosine kinases in resistance to multiple anticancer therapies. Curr Oncol Rep. 2017;19(3):19. 28251492 10.1007/s11912-017-0579-4 PMC5332501 9. Zhou L Liu XD Sun M Zhang X German P Bai S Ding Z Tannir N Wood CG Matin SF Targeting MET and AXL overcomes resistance to Sunitinib therapy in renal cell carcinoma Oncogene 2016 35 21 2687 97 10.1038/onc.2015.343 26364599 PMC4791213 Zhou L, Liu XD, Sun M, Zhang X, German P, Bai S, Ding Z, Tannir N, Wood CG, Matin SF, et al. Targeting MET and AXL overcomes resistance to Sunitinib therapy in renal cell carcinoma. Oncogene. 2016;35(21):2687–97. 26364599 10.1038/onc.2015.343 PMC4791213 10. Pan Y Lu X Shu G Cen J Lu J Zhou M Huang K Dong J Li J Lin H Extracellular Vesicle-Mediated transfer of LncRNA IGFL2-AS1 confers Sunitinib resistance in renal cell carcinoma Cancer Res 2023 83 1 103 16 10.1158/0008-5472.CAN-21-3432 36264173 PMC9811158 Pan Y, Lu X, Shu G, Cen J, Lu J, Zhou M, Huang K, Dong J, Li J, Lin H, et al. Extracellular Vesicle-Mediated transfer of LncRNA IGFL2-AS1 confers Sunitinib resistance in renal cell carcinoma. Cancer Res. 2023;83(1):103–16. 36264173 10.1158/0008-5472.CAN-21-3432 PMC9811158 11. Wei Z Ye Y Liu C Wang Q Zhang Y Chen K Cheng G Zhang X MIER2/PGC1A elicits Sunitinib resistance via lipid metabolism in renal cell carcinoma J Adv Res 2025 70 287 305 10.1016/j.jare.2024.04.032 38702028 PMC11976417 Wei Z, Ye Y, Liu C, Wang Q, Zhang Y, Chen K, Cheng G, Zhang X. MIER2/PGC1A elicits Sunitinib resistance via lipid metabolism in renal cell carcinoma. J Adv Res. 2025;70:287–305. 38702028 10.1016/j.jare.2024.04.032 PMC11976417 12. Ding H Chen Z Wu K Huang SM Wu WL LeBoeuf SE Pillai RG Rabinowitz JD Papagiannakopoulos T Activation of the NRF2 antioxidant program sensitizes tumors to G6PD Inhibition Sci Adv 2021 7 47 eabk1023 10.1126/sciadv.abk1023 34788087 PMC8598006 Ding H, Chen Z, Wu K, Huang SM, Wu WL, LeBoeuf SE, Pillai RG, Rabinowitz JD, Papagiannakopoulos T. Activation of the NRF2 antioxidant program sensitizes tumors to G6PD Inhibition. Sci Adv. 2021;7(47):eabk1023. 34788087 10.1126/sciadv.abk1023 PMC8598006 13. Huang Q Liu L Xiao D Huang Z Wang W Zhai K Fang X Kim J Liu J Liang W CD44(+) lung cancer stem cell-derived pericyte-like cells cause brain metastases through GPR124-enhanced trans-endothelial migration Cancer Cell 2023 41 9 1621 e16361628 10.1016/j.ccell.2023.07.012 37595587 Huang Q, Liu L, Xiao D, Huang Z, Wang W, Zhai K, Fang X, Kim J, Liu J, Liang W, et al. CD44(+) lung cancer stem cell-derived pericyte-like cells cause brain metastases through GPR124-enhanced trans-endothelial migration. Cancer Cell. 2023;41(9):1621–e16361628. 37595587 10.1016/j.ccell.2023.07.012 14. Chen Y Lu Z Qi C Yu C Li Y Huan W Wang R Luo W Shen D Ding L N(6)-methyladenosine-modified TRAF1 promotes Sunitinib resistance by regulating apoptosis and angiogenesis in a METTL14-dependent manner in renal cell carcinoma Mol Cancer 2022 21 1 111 10.1186/s12943-022-01549-1 35538475 PMC9087993 Chen Y, Lu Z, Qi C, Yu C, Li Y, Huan W, Wang R, Luo W, Shen D, Ding L, et al. N(6)-methyladenosine-modified TRAF1 promotes Sunitinib resistance by regulating apoptosis and angiogenesis in a METTL14-dependent manner in renal cell carcinoma. Mol Cancer. 2022;21(1):111. 35538475 10.1186/s12943-022-01549-1 PMC9087993 15. Holle AW Young JL Spatz JP In vitro cancer cell-ECM interactions inform in vivo cancer treatment Adv Drug Deliv Rev 2016 97 270 9 10.1016/j.addr.2015.10.007 26485156 Holle AW, Young JL, Spatz JP. In vitro cancer cell-ECM interactions inform in vivo cancer treatment. Adv Drug Deliv Rev. 2016;97:270–9. 26485156 10.1016/j.addr.2015.10.007 16. Muranen T Selfors LM Worster DT Iwanicki MP Song L Morales FC Gao S Mills GB Brugge JS Inhibition of PI3K/mTOR leads to adaptive resistance in matrix-attached cancer cells Cancer Cell 2012 21 2 227 39 10.1016/j.ccr.2011.12.024 22340595 PMC3297962 Muranen T, Selfors LM, Worster DT, Iwanicki MP, Song L, Morales FC, Gao S, Mills GB, Brugge JS. Inhibition of PI3K/mTOR leads to adaptive resistance in matrix-attached cancer cells. Cancer Cell. 2012;21(2):227–39. 22340595 10.1016/j.ccr.2011.12.024 PMC3297962 17. Holohan C Van Schaeybroeck S Longley DB Johnston PG Cancer drug resistance: an evolving paradigm Nat Rev Cancer 2013 13 10 714 26 10.1038/nrc3599 24060863 Holohan C, Van Schaeybroeck S, Longley DB, Johnston PG. Cancer drug resistance: an evolving paradigm. Nat Rev Cancer. 2013;13(10):714–26. 24060863 10.1038/nrc3599 18. Dong Y Eskandari R Ray C Granlund KL Santos-Cunha LD Miloushev VZ Tee SS Jeong S Aras O Chen YB Hyperpolarized MRI visualizes Warburg effects and predicts treatment response to mTOR inhibitors in Patient-Derived CcRCC xenograft models Cancer Res 2019 79 1 242 50 10.1158/0008-5472.CAN-18-2231 30459151 PMC6318024 Dong Y, Eskandari R, Ray C, Granlund KL, Santos-Cunha LD, Miloushev VZ, Tee SS, Jeong S, Aras O, Chen YB, et al. Hyperpolarized MRI visualizes Warburg effects and predicts treatment response to mTOR inhibitors in Patient-Derived CcRCC xenograft models. Cancer Res. 2019;79(1):242–50. 30459151 10.1158/0008-5472.CAN-18-2231 PMC6318024 19. Wu FTH Xu P Chow A Man S Krüger J Khan KA Paez-Ribes M Pham E Kerbel RS Pre- and post-operative anti-PD-L1 plus anti-angiogenic therapies in mouse breast or renal cancer models of micro- or macro-metastatic disease Br J Cancer 2019 120 2 196 206 10.1038/s41416-018-0297-1 30498230 PMC6342972 Wu FTH, Xu P, Chow A, Man S, Krüger J, Khan KA, Paez-Ribes M, Pham E, Kerbel RS. Pre- and post-operative anti-PD-L1 plus anti-angiogenic therapies in mouse breast or renal cancer models of micro- or macro-metastatic disease. Br J Cancer. 2019;120(2):196–206. 30498230 10.1038/s41416-018-0297-1 PMC6342972 20. Wang Y Liu X Gong L Ding W Hao W Peng Y Zhang J Cai W Gao Y Mechanisms of Sunitinib resistance in renal cell carcinoma and associated opportunities for therapeutics Br J Pharmacol 2023 180 23 2937 55 10.1111/bph.16252 37740648 Wang Y, Liu X, Gong L, Ding W, Hao W, Peng Y, Zhang J, Cai W, Gao Y. Mechanisms of Sunitinib resistance in renal cell carcinoma and associated opportunities for therapeutics. Br J Pharmacol. 2023;180(23):2937–55. 37740648 10.1111/bph.16252 21. Huang C Chen Y Dai H Zhang H Xie M Zhang H Chen F Kang X Bai X Chen Z UBAP2L arginine methylation by PRMT1 modulates stress granule assembly Cell Death Differ 2020 27 1 227 41 10.1038/s41418-019-0350-5 31114027 PMC7205891 Huang C, Chen Y, Dai H, Zhang H, Xie M, Zhang H, Chen F, Kang X, Bai X, Chen Z. UBAP2L arginine methylation by PRMT1 modulates stress granule assembly. Cell Death Differ. 2020;27(1):227–41. 31114027 10.1038/s41418-019-0350-5 PMC7205891 22. Cirillo L Cieren A Barbieri S Khong A Schwager F Parker R Gotta M UBAP2L forms distinct cores that act in nucleating stress granules upstream of G3BP1 Curr Biol 2020 30 4 698 e707696 10.1016/j.cub.2019.12.020 31956030 Cirillo L, Cieren A, Barbieri S, Khong A, Schwager F, Parker R, Gotta M. UBAP2L forms distinct cores that act in nucleating stress granules upstream of G3BP1. Curr Biol. 2020;30(4):698–e707696. 31956030 10.1016/j.cub.2019.12.020 23. Riggs CL, Kedersha N, Amarsanaa M, Zubair SN, Ivanov P, Anderson P. UBAP2L contributes to formation of P-bodies and modulates their association with stress granules. J Cell Biol 2024, 223(10). 10.1083/jcb.202307146 PMC11248227 39007803 24. Luo EC Nathanson JL Tan FE Schwartz JL Schmok JC Shankar A Markmiller S Yee BA Sathe S Pratt GA Large-scale tethered function assays identify factors that regulate mRNA stability and translation Nat Struct Mol Biol 2020 27 10 989 1000 10.1038/s41594-020-0477-6 32807991 PMC8221285 Luo EC, Nathanson JL, Tan FE, Schwartz JL, Schmok JC, Shankar A, Markmiller S, Yee BA, Sathe S, Pratt GA, et al. Large-scale tethered function assays identify factors that regulate mRNA stability and translation. Nat Struct Mol Biol. 2020;27(10):989–1000. 32807991 10.1038/s41594-020-0477-6 PMC8221285 25. Antal CE Oh TG Aigner S Luo EC Yee BA Campos T Tiriac H Rothamel KL Cheng Z Jiao H A super-enhancer-regulated RNA-binding protein cascade drives pancreatic cancer Nat Commun 2023 14 1 5195 10.1038/s41467-023-40798-6 37673892 PMC10482938 Antal CE, Oh TG, Aigner S, Luo EC, Yee BA, Campos T, Tiriac H, Rothamel KL, Cheng Z, Jiao H, et al. A super-enhancer-regulated RNA-binding protein cascade drives pancreatic cancer. Nat Commun. 2023;14(1):5195. 37673892 10.1038/s41467-023-40798-6 PMC10482938 26. Guerber L Pangou E Sumara I Ubiquitin binding protein 2-Like (UBAP2L): is it so NICE after all?? Front Cell Dev Biol 2022 10 931115 10.3389/fcell.2022.931115 35794863 PMC9250975 Guerber L, Pangou E, Sumara I. Ubiquitin binding protein 2-Like (UBAP2L): is it so NICE after all?? Front Cell Dev Biol. 2022;10:931115. 35794863 10.3389/fcell.2022.931115 PMC9250975 27. Ye T Xu J Du L Mo W Liang Y Xia J Downregulation of UBAP2L inhibits the Epithelial-Mesenchymal transition via SNAIL1 regulation in hepatocellular carcinoma cells Cell Physiol Biochemistry: Int J Experimental Cell Physiol Biochem Pharmacol 2017 41 4 1584 95 10.1159/000470824 28334716 Ye T, Xu J, Du L, Mo W, Liang Y, Xia J. Downregulation of UBAP2L inhibits the Epithelial-Mesenchymal transition via SNAIL1 regulation in hepatocellular carcinoma cells. Cell Physiol Biochemistry: Int J Experimental Cell Physiol Biochem Pharmacol. 2017;41(4):1584–95. 10.1159/000470824 28334716 28. Slawson C Hart GW O-GlcNAc signalling: implications for cancer cell biology Nat Rev Cancer 2011 11 9 678 84 10.1038/nrc3114 21850036 PMC3291174 Slawson C, Hart GW. O-GlcNAc signalling: implications for cancer cell biology. Nat Rev Cancer. 2011;11(9):678–84. 21850036 10.1038/nrc3114 PMC3291174 29. Yang X Qian K Protein O-GlcNAcylation: emerging mechanisms and functions Nat Rev Mol Cell Biol 2017 18 7 452 65 10.1038/nrm.2017.22 28488703 PMC5667541 Yang X, Qian K. Protein O-GlcNAcylation: emerging mechanisms and functions. Nat Rev Mol Cell Biol. 2017;18(7):452–65. 28488703 10.1038/nrm.2017.22 PMC5667541 30. Liu Y Yu K Zhang K Niu M Chen Q Liu Y Wang L Zhang N Li W Zhong X O-GlcNAcylation promotes topoisomerase IIα catalytic activity in breast cancer chemoresistance EMBO Rep 2023 24 7 e56458 10.15252/embr.202256458 37249035 PMC10328065 Liu Y, Yu K, Zhang K, Niu M, Chen Q, Liu Y, Wang L, Zhang N, Li W, Zhong X, et al. O-GlcNAcylation promotes topoisomerase IIα catalytic activity in breast cancer chemoresistance. EMBO Rep. 2023;24(7):e56458. 37249035 10.15252/embr.202256458 PMC10328065 31. Wheeler JR Jain S Khong A Parker R Isolation of yeast and mammalian stress granule cores Methods 2017 126 12 7 10.1016/j.ymeth.2017.04.020 28457979 PMC5924690 Wheeler JR, Jain S, Khong A, Parker R. Isolation of yeast and mammalian stress granule cores. Methods. 2017;126:12–7. 28457979 10.1016/j.ymeth.2017.04.020 PMC5924690 32. Youn JY Dunham WH Hong SJ Knight JDR Bashkurov M Chen GI Bagci H Rathod B MacLeod G Eng SWM High-Density proximity mapping reveals the subcellular organization of mRNA-Associated granules and bodies Mol Cell 2018 69 3 517 e532511 10.1016/j.molcel.2017.12.020 29395067 Youn JY, Dunham WH, Hong SJ, Knight JDR, Bashkurov M, Chen GI, Bagci H, Rathod B, MacLeod G, Eng SWM, et al. High-Density proximity mapping reveals the subcellular organization of mRNA-Associated granules and bodies. Mol Cell. 2018;69(3):517–e532511. 29395067 10.1016/j.molcel.2017.12.020 33. Li O Zhao C Zhang J Li FN Yang ZY Liu SL Cai C Jia ZY Gong W Shu YJ UBAP2L promotes gastric cancer metastasis by activating NF-κB through PI3K/AKT pathway Cell Death Discovery 2022 8 1 123 10.1038/s41420-022-00916-7 35304439 PMC8933503 Li O, Zhao C, Zhang J, Li FN, Yang ZY, Liu SL, Cai C, Jia ZY, Gong W, Shu YJ, et al. UBAP2L promotes gastric cancer metastasis by activating NF-κB through PI3K/AKT pathway. Cell Death Discovery. 2022;8(1):123. 35304439 10.1038/s41420-022-00916-7 PMC8933503 34. Zhou Y Zhang T Wang S Jiao Z Lu K Liu X Li H Jiang W Zhang X Metal-polyphenol-network coated R612F nanoparticles reduce drug resistance in hepatocellular carcinoma by inhibiting stress granules Cell Death Discovery 2024 10 1 384 10.1038/s41420-024-02161-6 39198406 PMC11358291 Zhou Y, Zhang T, Wang S, Jiao Z, Lu K, Liu X, Li H, Jiang W, Zhang X. Metal-polyphenol-network coated R612F nanoparticles reduce drug resistance in hepatocellular carcinoma by inhibiting stress granules. Cell Death Discovery. 2024;10(1):384. 39198406 10.1038/s41420-024-02161-6 PMC11358291 35. Hua X Jin L Fang Z Weng Y Zhang Y Zhang J Xie D Tang Y Guo S Huang Y TIA1-Mediated stress granules promote the neuroinflammation and demyelination in experimental autoimmune encephalomyelitis through upregulating IL-31RA signaling Adv Sci (Weinh) 2025 12 14 e2409086 10.1002/advs.202409086 39804990 PMC11984900 Hua X, Jin L, Fang Z, Weng Y, Zhang Y, Zhang J, Xie D, Tang Y, Guo S, Huang Y, et al. TIA1-Mediated stress granules promote the neuroinflammation and demyelination in experimental autoimmune encephalomyelitis through upregulating IL-31RA signaling. Adv Sci (Weinh). 2025;12(14):e2409086. 39804990 10.1002/advs.202409086 PMC11984900 36. Mateju D Eichenberger B Voigt F Eglinger J Roth G Chao JA Single-Molecule imaging reveals translation of mRNAs localized to stress granules Cell 2020 183 7 1801 e18121813 10.1016/j.cell.2020.11.010 33308477 Mateju D, Eichenberger B, Voigt F, Eglinger J, Roth G, Chao JA. Single-Molecule imaging reveals translation of mRNAs localized to stress granules. Cell. 2020;183(7):1801–e18121813. 33308477 10.1016/j.cell.2020.11.010 37. Thedieck K Holzwarth B Prentzell MT Boehlke C Kläsener K Ruf S Sonntag AG Maerz L Grellscheid SN Kremmer E Inhibition of mTORC1 by Astrin and stress granules prevents apoptosis in cancer cells Cell 2013 154 4 859 74 10.1016/j.cell.2013.07.031 23953116 Thedieck K, Holzwarth B, Prentzell MT, Boehlke C, Kläsener K, Ruf S, Sonntag AG, Maerz L, Grellscheid SN, Kremmer E, et al. Inhibition of mTORC1 by Astrin and stress granules prevents apoptosis in cancer cells. Cell. 2013;154(4):859–74. 23953116 10.1016/j.cell.2013.07.031 38. Takahashi M Higuchi M Matsuki H Yoshita M Ohsawa T Oie M Fujii M Stress granules inhibit apoptosis by reducing reactive oxygen species production Mol Cell Biol 2013 33 4 815 29 10.1128/MCB.00763-12 23230274 PMC3571346 Takahashi M, Higuchi M, Matsuki H, Yoshita M, Ohsawa T, Oie M, Fujii M. Stress granules inhibit apoptosis by reducing reactive oxygen species production. Mol Cell Biol. 2013;33(4):815–29. 23230274 10.1128/MCB.00763-12 PMC3571346 39. Xu Q Deng B Li M Chen Y Zhuan L circRNA-UBAP2 promotes the proliferation and inhibits apoptosis of ovarian cancer though miR-382-5p/PRPF8 axis J Ovarian Res 2020 13 1 81 10.1186/s13048-020-00685-w 32690086 PMC7372761 Xu Q, Deng B, Li M, Chen Y, Zhuan L. circRNA-UBAP2 promotes the proliferation and inhibits apoptosis of ovarian cancer though miR-382-5p/PRPF8 axis. J Ovarian Res. 2020;13(1):81. 32690086 10.1186/s13048-020-00685-w PMC7372761 40. Zhu Y Hart GW Dual-specificity RNA aptamers enable manipulation of target-specific O-GlcNAcylation and unveil functions of O-GlcNAc on β-catenin Cell 2023 186 2 428 e445427 10.1016/j.cell.2022.12.016 36626902 PMC9868088 Zhu Y, Hart GW. Dual-specificity RNA aptamers enable manipulation of target-specific O-GlcNAcylation and unveil functions of O-GlcNAc on β-catenin. Cell. 2023;186(2):428–e445427. 36626902 10.1016/j.cell.2022.12.016 PMC9868088 41. Zhu G Qian M Lu L Chen Y Zhang X Wu Q Liu Y Bian Z Yang Y Guo S O-GlcNAcylation of YY1 stimulates tumorigenesis in colorectal cancer cells by targeting SLC22A15 and AANAT Carcinogenesis 2019 40 9 1121 31 30715269 10.1093/carcin/bgz010 Zhu G, Qian M, Lu L, Chen Y, Zhang X, Wu Q, Liu Y, Bian Z, Yang Y, Guo S, et al. O-GlcNAcylation of YY1 stimulates tumorigenesis in colorectal cancer cells by targeting SLC22A15 and AANAT. Carcinogenesis. 2019;40(9):1121–31. 30715269 10.1093/carcin/bgz010 42. Park SY Kim HS Kim NH Ji S Cha SY Kang JG Ota I Shimada K Konishi N Nam HW Snail1 is stabilized by O-GlcNAc modification in hyperglycaemic condition Embo J 2010 29 22 3787 96 10.1038/emboj.2010.254 20959806 PMC2989108 Park SY, Kim HS, Kim NH, Ji S, Cha SY, Kang JG, Ota I, Shimada K, Konishi N, Nam HW, et al. Snail1 is stabilized by O-GlcNAc modification in hyperglycaemic condition. Embo J. 2010;29(22):3787–96. 20959806 10.1038/emboj.2010.254 PMC2989108 43. Gupta N Badeaux M Liu Y Naxerova K Sgroi D Munn LL Jain RK Garkavtsev I Stress granule-associated protein G3BP2 regulates breast tumor initiation Proc Natl Acad Sci USA 2017 114 5 1033 8 10.1073/pnas.1525387114 28096337 PMC5293063 Gupta N, Badeaux M, Liu Y, Naxerova K, Sgroi D, Munn LL, Jain RK, Garkavtsev I. Stress granule-associated protein G3BP2 regulates breast tumor initiation. Proc Natl Acad Sci USA. 2017;114(5):1033–8. 28096337 10.1073/pnas.1525387114 PMC5293063 ",
  "metadata": {
    "Title of this paper": "Stress granule-associated protein G3BP2 regulates breast tumor initiation",
    "Journal it was published in:": "Journal of Experimental & Clinical Cancer Research : CR",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12487280/"
  }
}