{
  "title": "Paper_1136",
  "abstract": "pmc Gels Gels 3575 gels gels Gels 2310-2861 Multidisciplinary Digital Publishing Institute  (MDPI) PMC12469877 PMC12469877.1 12469877 12469877 41002498 10.3390/gels11090724 gels-11-00724 1 Review Click Chemistry-Based Hydrogels for Tissue Engineering https://orcid.org/0000-0002-2729-4163 Sojdeh Soheil Panjipour Amirhosein https://orcid.org/0009-0009-5555-6421 Yaghmour Amal https://orcid.org/0009-0004-0996-4014 Arabpour Zohreh * Djalilian Ali R. * Parvinzadeh Gashti Mazeyar Academic Editor Department of Ophthalmology and Visual Science, University of Illinois, Chicago, IL 60612, USA; sojdesoheil@gmail.com * arabpour@uic.edu adjalili@uic.edu 11 9 2025 9 2025 11 9 497641 724 20 8 2025 05 9 2025 08 9 2025 11 09 2025 27 09 2025 27 09 2025 © 2025 by the authors. 2025 https://creativecommons.org/licenses/by/4.0/ Licensee MDPI, Basel, Switzerland. This article is an open access article distributed under the terms and conditions of the Creative Commons Attribution (CC BY) license ( https://creativecommons.org/licenses/by/4.0/ Click chemistry has become a powerful and flexible approach for designing hydrogels used in tissue engineering thanks to its high specificity, fast reaction rates, and compatibility with biological systems. In this review, we introduce the core principles of click chemistry, including efficiency, orthogonality, and modularity, and highlight the main types of reactions commonly used in hydrogel formation, such as azide-alkyne c-cloadditions, thiol-ene/yne reactions, Diels–Alder cycloadditions, and tetrazine–norbornene couplings. These chemistries allow researchers to create covalently crosslinked hydrogels that are injectable, responsive to environmental stimuli, biodegradable, or multifunctional. We also explore strategies to enhance bioactivity, such as incorporating peptides, growth factors, or extracellular matrix components, and enabling precise spatial and temporal control over biological cues. Click-based hydrogels have shown promise across a wide range of tissue engineering applications, from cartilage and skin repair to neural regeneration, corneal healing, and cardiovascular scaffolds, as well as in 3D bioprinting technologies. Despite the many advantages of click chemistry such as mild reaction conditions and customizable material properties, some challenges remain, including concerns around copper toxicity, the cost of specialized reagents, and scalability. Finally, we discuss the status of clinical translation, regulatory considerations, and future directions, including integration with advanced bio fabrication methods, the design of dual-click systems, and the emerging role of in vivo click chemistry in creating next-generation biomaterials. click chemistry crosslinked hydrogel tissue engineering NIH Core Grant for Vision Research EY01792 Department of Defense VR240031 Department from Research to Prevent Blindness This work was supported by NIH Core Grant for Vision Research EY01792 from NEI/NIH, the Vision Research Program-Congressionally Directed Medical Research Program VR240031 from the Department of Defense, and the Unrestricted Grant to the Department from Research to Prevent Blindness. pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement no pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes 1. Introduction Hydrogels are polymeric materials with three-dimensional network structures, whose unique combination of high water content, tunable mechanical properties, and biocompatibility has led to a wide range of applications in various fields, especially in biomedicine [ 1 2 3 4 Hydrogels can be physically or chemically crosslinked. Physically crosslinked hydrogels are stabilized by noncovalent interactions such as ionic bonds, hydrogen bonds, or polymer entanglements, whereas chemically crosslinked hydrogels rely on covalent bonds and provide greater mechanical stability and durability [ 5 6 In recent years, click chemistry has emerged as a highly versatile and powerful strategy for hydrogel synthesis. Click reactions are rapid, selective, high-yielding, and often produce minimal or benign side products under mild conditions, making them well-suited for biomedical applications. These features have enabled the creation of a wide range of functional materials with applications in medicine, agriculture, and biotechnology [ 7 8 While the application of click chemistry for fabricating hydrogels has been extensively documented in previous reviews, with their focus largely on fundamental reactions, basic material properties, and established models, this review builds upon that foundation to offer a distinct and timely contribution. We move beyond these established concepts to critically explore the cutting-edge potential of click-crosslinked hydrogels, with a distinct focus on emerging applications that point toward the future of the field. This includes a dedicated exploration of their transformative role in precision medicine, spatiotemporally controlled drug delivery systems, and the bio fabrication of hierarchically complex tissues. To contextualize their versatility, we first introduce common click reactions and highlight their parallel advancements in fields like nucleic acid chemistry, a connection often overlooked in tissue engineering-focused articles. Furthermore, we synthesize these insights to provide a forward-looking roadmap, offering practical design considerations and clear future perspectives aimed at empowering researchers to develop the next-generation of clinically impactful and translational hydrogel-based therapies. 2. Fundamentals of Click Chemistry in Hydrogel Design Tissue regeneration is facilitated by intelligent biomaterials that include biological components. Biomaterials spatially localize and control the release of growth factors while promoting cell migration and proliferation. Tissue regeneration requires the development and building of sophisticated biomaterial platforms. Hydrogels are among the most significant educational biomaterials because of their three-dimensional (3D) water-saturated polymeric networks [ 9 10 Crosslinking hydrogels may be performed chemically or physically [ 11 12 13 14 Figure 1 As illustrated in Figure 1 15 16 17 18 19 As a result, it is one of the most widely used methods for producing hydrogel for regenerative medical applications such as wound healing, bone regeneration, spinal cord regeneration, cartilage regeneration, and corneal regeneration, hydrogels have shown promise [ 20 21 22 8 Definition and Key Principles of Click Chemistry In order to develop biohydrogels for tissue healing, Hubbell and associates were the first to use click chemistry for hydrogel production [ 23 24 25 26 27 28 29 “Click” chemistry hydrogels are becoming more and more popular in the hydrogel space because of their improved selectivity and physiologically induced biorthogonal reactions [ 17 30 31 Table 1 3. Major Click Reactions Used in Hydrogels Over the last decade, advancements in hydrogel production techniques have enabled researchers to alter or synthesize innovative polymers with multifunctional characteristics for applications in tissue engineering [ 44 45 46 47 48 16 Consequently, researchers choose copper-free click chemistry for the production of hydrogels in tissue engineering and regenerative medicine [ 49 50 51 52 53 17 54 55 56 57 58 Figure 2 3.1. Azide–Alkyne Cycloaddition (Cu/SPAAC) A terminal alkyne and an aliphatic azide, when combined with a copper catalyst, produce a 1,4-disubstituted 1,2,3-triazole. Cycloaddition processes, although exothermic, exhibit a significant activation barrier for the reagent compounds, leading to diminished reaction rates even at elevated temperatures. Copper (I) facilitates gelation at physiological temperature, with durations varying from seconds to hours based on catalyst or monomer concentration and the structural characteristics of the polymer components [ 59 60 61 17 62 63 64 Numerous investigations used water-soluble chelating agents or ligands such as bipyridine, bis(L-histidine), and bis [tert-butyl triazoyl) methyl] to address this challenge. Guo et al. synthesized mussel-inspired citrate-based bio-adhesive hydrogels using 4-(2-hydroxyethyl)-1-piperazineethanesulfonic acid as a copper chelating agent in CuAAC procedures. These hydrogels exhibit excellent bioadhesive properties and robust antibacterial efficacy, making them appropriate for invasive applications. As the concentration of periodate increased, the length of gelation decreased somewhat, presumably owing to crosslinking of catechol groups rather than click crosslinking [ 64 65 66 67 49 68 69 Chen et al. developed a hydrogel consisting of bio-orthogonally crosslinked hyaluronate and collagen for application in corneal stroma, as reported in recent publications. The hydrogel demonstrates potential as a vision-enhancing material by creating a transparent, smooth anterior curvature on corneal wound beds and allowing for control over this curvature during the gelling process. Therapeutic applications, including point-of-care settings and operating rooms, align effectively with the gelation time, which is quantified in minutes. The material effectively addresses stromal defects without the use of sutures and facilitates crosslinking in ambient water conditions, eliminating the need for light irradiation or additional triggers or initiators. Both in vitro and in vivo studies demonstrated that this hydrogel effectively supported epithelialization and exhibited significant cytocompatibility. The material’s ability to restore functional vision in cases of corneal abnormalities that threaten eyesight necessitates further investigation [ 70 Liu et al. developed an innovative injectable bone cement system using organic-inorganic nanohybrids (click-ON) crosslinked by SPAAC click chemistry for biomedical purposes. RBMSC stem cells exhibited superior adhesion, proliferation, and differentiation on crosslinked click-ON scaffolds. A rat cranial defect model demonstrated that the click-ON device facilitates bone repair with little cytotoxicity. The click-ON cement exhibits reduced cytotoxicity, diminished heat production, and enhanced biodegradability compared to the clinically used poly (methyl methacrylate) (PMMA) bone cement. This injectable click-on cement technology has distinctive features that may enhance bone tissue engineering and many biological applications [ 71 72 Furthermore, Chang et al. revealed that stoichiometric integration of cholesterol into azide-functionalized hyaluronic acid (HA) can selectively modify the microstructures and hydrophilic amphiphilicity of HA by SPAAC. The dynamic crosslinking of cholesteryl hyaluronic acid into physical gels with improved and recoverable viscosity transpires at low cholesterol concentrations due to hydrophobic interactions among cholesterol moieties. The chemical and physical interactions among cholesteryl HA crosslinks are illustrated by the crosslinking of residual azides by SPAAC. At elevated cholesterol concentrations, cholesterol-HA self-assembles into multilamellar nanoparticles (NPs) including an inner core comprising alternating layers of cholesterol and HA, with an outside layer that is hydrated and abundant in HA. Cholesterol HA with customized amphiphilicity can be utilized to create versatile macromolecular building blocks for regenerative medicine applications, such as viscoelastic physical gels, dual-crosslinked gels, and multilamellar nanoparticles [ 73 Table 2 3.2. Thiol-Ene Based Click Hydrogels Alkene and thiol functional groups serve as the reactants in the thiol-ene click reaction. This method enables the formation of orthogonal networks because of its high efficiency, quick reaction rates, strong selectivity, lack of a necessary initiator, resistance to oxygen and moisture, and superior biocompatibility. The thiol-ene technique utilizes both step-growth and chain-growth polymerization methods. Following the generation of radicals, the initiator produces thiyl radicals by abstracting protons from the thiol groups of the reactants. Thiyl radicals subsequently produce carbon-based radicals, so commencing the creation of carbon–carbon double bonds. The created carbon-based radical may move through a carbon–carbon double bond, undergo chain transfer, or react with a new thiol group to produce a thiyl radical [ 80 81 Granja’s group used thiol-ene photo-crosslinking to create a pectin-based hydrogel that is degradable by cells. The cell-instructive hydrogel system included norbornene-functionalized pectin, monocysteine cell-adhesive ligands for integrin interaction, and an enzymatically cleavable biscysteine peptide crosslink. Researchers used gel-encapsulated dermal fibroblast cells to investigate the formation of skin tissue in a laboratory setting. High-homogeneity thiol-norbornene hydrogel networks may facilitate tissue growth by establishing a specific environment. Furthermore, there was an absence of chains or homo-polymerization of strained norbornene groups in thiol-norbornene reactions [ 82 83 84 63 Modifications to the norbornene group are often favored because to their rapid responsiveness and high safety for cellular applications [ 82 85 86 In addition, Liang et al. synthesized a composite hydrogel composed of silk fibroin (SF) and poly (ethylene glycol) diacrylate (PEGDA). A thiol-ene click reaction induced by UV light at 405 nm linked the glutathione on the silk fibroin with the acrylate moiety on the polyethylene glycol backbones. The crosslinked PEGDA/SF hydrogel effectively released rhodamine B due to its low swelling ratio and high biocompatibility in vivo [ 87 88 89 90 91 Employing azide-alkyne click chemistry, Takemoto’s team has conjugated hydrogels with biological cells and tissues. They incorporated an alkyne group into alginate and modified live cells and tissues with an azide group to target sialic acid residues on the cell surface. We cultivated azide-modified cells with alkyne-modified hydrogels to synthesize gels. Live cells based on hydrogel exhibited a higher likelihood of survival [ 92 93 In accordance with recent research, Afonso et al. employed alginate, gelatin, and carboxymethyl cellulose, incorporating norbornene and thiol groups for optimal substitution. These modifications enhanced polymer reactivity and facilitated thiol–ene click reactions to produce orthogonally photo-crosslinked hydrogels. The equimolar combination of these polymers with AuNR colloids resulted in improved bioprinting, cell culture, and biosensing inks. Chemically stable hydrogels incorporating diverse polymers and gold nanorods (AuNRs) serve as SERS substrates for the detection of physiologically significant chemicals. They evaluated the rheology, swelling, degradation, microstructure, and biocompatibility of the hydrogels to identify appropriate plasmonic inks for 3D-printed scaffolds [ 94 In another interesting research by Bailey et al., thiol-ene click chemistry is suitable for investigating how modifications to HPMC’s hydrophobic, steric, or pi stacking features might be utilized to modify PNP hydrogel characteristics. PNP hydrogels can be synthesized with consistent network density and diffusion, while exhibiting varied in vivo retention durations, so offering a novel method for regulating therapeutic cargo release. This article outlines a straightforward thiol–ene click derivatization process for modifying PNP hydrogels using HPMC. This technique significantly enhances research on polymer–nanoparticle interactions due to the plethora of commercially available thiol-containing compounds and cysteine-containing peptides. Rheometry demonstrated that the identification of the HPMC pendant group could significantly alter the stiffness, flow, and recovery characteristics of bulk materials. Adjustable mechanical properties may be employed to modify hydrogel retention times in vivo, illustrating the potential for customized therapeutic delivery [ 95 Moreover, Atmani et al. demonstrated the straightforward modular synthesis of water-soluble allyl-functionalized polysaccharide carbamates (AFCs). The thiol–ene reaction chemically crosslinked AFC derivatives into hydrogels within seconds of exposure to UV light at 365 nm. The gels were thoroughly characterized and exhibited significant mechanical strength, swelling capacity, porosity, and a uniform pore structure. AFCs were optimal for 3D printing because of their rapid gelation and superior properties. This will enhance biomedical applications for biobased polymers. The synthesis of isotropic gel materials using partial UV irradiation is a simple and intriguing technique. Extensive investigations on 3D printing equipment are now being conducted to enhance process parameters and printability [ 96 Oxidizing agents and neutral pH facilitate the oxidation of two thiol groups, resulting in the formation of disulphide bonds [ 97 98 99 Utilizing activated disulphide (pyridyl disulphide) to synthesize hydrogels by disulphide exchange processes, rather than thiol oxidation, might expedite gelation; nevertheless, it produces tiny molecular byproducts that may be detrimental in tissue engineering. This crosslinking technique is beneficial as the disulphide bonds respond to reductive environments, characterized by elevated concentrations of reducing agents (e.g., glutathione or dithiothreitol) and/or marginally reduced local pH levels, commonly found at various disease or infection sites [ 100 101 102 Direct encapsulations of cells inside disulfide-bonded hydrogels are also effective. In vitro growth of disulphide crosslinked hyaluronan hydrogels sustained L-929 murine fibroblasts for 3 days, while many cell types, including fibroblasts, endothelial cells, and mesenchymal stem cells, exhibited viability after 7 days (as assessed by a live-dead test) [ 103 Table 3 3.3. Boronated Ester Click Chemistry Boronic acid interacts with a diol to produce boronate ester bonds. Choosing the appropriate boronic acid may facilitate rapid gelation at physiological temperature and pH levels (pH 8–9). This exothermic reaction occurs rapidly [ 107 108 109 109 110 111 111 112 31 To augment the anticancer efficacy, Jung et al. devised a sophisticated thermos-responsive injectable hydrogel derived from a copolymer including boronic acid and consisting of poly (ε-caprolactone-co-lactide)-b-poly (ethyleneglycol)-b-poly (ε-caprolactone-co-lactide) (PCLA). The results indicate that PCLA copolymers are promising as injectable depots and suitable carriers for the targeted delivery of DOX in the treatment of hepatocellular carcinoma [ 113 114 Furthermore, Miki et al. developed two FBA-HA/Gluca-HA systems and demonstrated that the system with the highest degree of substitution (pH 3.90) rapidly gelled in a buffer solution at physiological pH (pH 7.4). The in situ gelation of the HDS was unaffected by the presence of 5.5 mM Glc in the buffer solution into which the FBA-HA/Gluca-HA system was introduced, despite its competition with boronate ester crosslinking. This makes it a viable clinical contender. The boronate ester-crosslinking sites of the polymers increase markedly when pH transitions from acidic to physiological, leading to the creation of a resilient gel. The study revealed that pH-responsive in situ gelation necessitated elevated degrees of substitution (DS) and potassium (K), with Gluca serving as an advantageous cis-diol-containing moiety for BA derivative-modified polymers. The FBA-HA/Gluca-HA combination, which rapidly gels under physiological conditions, may enhance drug delivery, cell engineering, and wound dressings [ 115 116 Table 4 3.4. Diels–Alder Click Chemistry Diels–Alder click chemistry reactions typically entail a diene and an alkene without the necessity of a coupling agent and catalyst. Aqueous DA reactions, like to click chemistry reactions, are rapid, adaptable, selective, and efficient [ 124 125 17 62 126 In another study, Wang et al. synthesized HA/PEG hydrogel with injectable characteristics using a dual-crosslinking procedure. The injectable HA/PEG hydrogel may rapidly gel within 30 s through a photo-crosslinking reaction between HA-Furan and LAP, which preserves encapsulated cell viability and facilitates clinical application. The thermally generated DA click chemistry progressively transpired between Furan and Mal groups, which incrementally enhanced the crosslinking density and mechanical characteristics of the hydrogel. The injectable HA/PEG hydrogel effectively contained the ATDC-5 cells in situ and demonstrated excellent cytocompatibility. The aforementioned results indicate that the injectable hydrogel, exhibiting progressively enhanced mechanical characteristics through a photo-crosslinking reaction and thermally induced DA click chemistry, holds significant promise for applications in cartilage tissue engineering [ 127 Koehler et al. synthesized DA-based hydrogels for drug release and osteogenic differentiation utilizing the Diels–Alder reaction and maleimide PEG macromer and furan dexamethasone peptide. Hydrogels increased mineralization and alkaline phosphatase activity by sixfold [ 128 129 In addition, Shoichet’s group identified that Diels–Alder-synthesized furan-modified hyaluronic acid and bis-maleimide polyethylene glycol hydrogels could spatially sequester biomolecules (galactose) within a two-photon laser photo pattern. They elucidated the effects of cryo-gelation and thawing temperature on porosity and pore dimensions. The substitution of furan modified the mechanical properties of the hydrogel [ 130 131 132 Furthermore, Madl et al. found that fulvenes and maleimide dienophiles quickly crosslink multi-arm poly (ethylene glycol) (PEG) hydrogels and hybrid PEG-engineered protein hydrogels with better cell encapsulation stability [ 133 134 135 136 Yu et al. synthesized cartilage utilizing tissue-adhesive DA click chemistry hydrogels. Dimaleimide PEG, furan adipic dihydrazide, and furan aldehyde were incorporated into HA to create the double-crosslinked network hydrogel. Hydrogels enhance mechanical properties, swelling capacity, self-repairing abilities, and cartilage adhesion [ 125 137 Retro-DA chemistry has the potential to compromise crosslinks. The degradation of some DA-crosslinked hydrogels is postponed under physiological circumstances. DA-crosslinked chitosan-based hydrogels exhibited a 98% cell viability after 21 days in vitro, whereas Pluronic F127/Gelatin/PEG demonstrated over 95% viability. Uncrosslinked chitosan had an 82% degradation in lysozymes and a 47% degradation in PBS after 14 days [ 136 41 42 138 139 140 141 3.5. Oxime and Hydrazone Formation In oxime click chemistry, amino-oxy groups undergo reactions with aldehydes or ketones. Rapid reactions interact with biomolecules and cells in an orthogonal manner. Water is generated in the absence of a catalyst, UV light, or external temperature [ 24 142 143 144 145 146 142 147 148 Boehnke et al. developed tunable degradation hydrogels utilizing a PEG-based imine hydrogel platform that integrates the biocompatibility and stability of oxime bonds with the reversibility of hydrazone bonds. The facile functionalization of PEG permits the modification of these gels with hydrazide and hydroxylamine groups. The amalgamation of oxime and hydrazone chemistries enhanced hydrogel stability from 24 h to 7 days. High cell viability was observed with covalently attached RGD peptides. This system is applicable for cell delivery and tissue engineering in both research and clinical contexts, as it allows for the modulation of hydrogel mechanical properties and degradation while encapsulating cells [ 149 Grover et al. employed 8-arm amino-oxy-PEG, RGD peptides, and glutaraldehyde to create oxime click chemistry-derived hydrogels for live MSC encapsulation. The researchers hypothesized that amino-oxy groups forming persistent oxime connections in aqueous settings stabilize hydrogels better than amine groups forming imine bonds [ 40 148 Hardy et al. explored amino-oxy modified PEG and aldehyde-modified HA-based oxime-crosslinked biodegradable, biocompatible hydrogels for soft nerve tissue engineering with adjustable mechanical properties. Hydrogel cell adhesion was examined using human MSCs, whilst Schwann cells were employed for cytotoxic tests. Both demonstrated potential for nerve tissue regeneration upon the incorporation of collagen I into hydrogels [ 150 As an interesting study, Baker et al. conducted a compelling study that identified an injectable oxime-crosslinked hydrogel as a biomimetic substitute for the vitreous body. Subsequently, they developed a hyaluronan-based hydrogel crosslinked via oxime chemistry to replicate the vitreous body. This system involved the modification of hyaluronan with aldehyde and ketone groups, which were then crosslinked with poly (ethylene glycol)-tetraoxyamine. This approach facilitated tunable gelation kinetics and yielded a hydrogel exhibiting optical and physical properties akin to natural vitreous. The hydrogel demonstrated minimal swelling, could be administered using fine needles, and was safe for retinal photoreceptors in vitro. In rabbit models, the oxime-crosslinked hydrogel preserved intraocular pressure, retinal structure, and function for up to 90 days before biodegradation commenced around day 28. These results underscore the potential of oxime chemistry in the development of injectable, stable, biodegradable vitreous substitutes with superior biocompatibility, thereby advancing clinically applicable materials for retinal repair [ 147 A biorthogonal oxime click chemistry-derived hydrogel for 3D cell culture was described by Farahani et al. This work generated a cell-encapsulated hydrogel utilizing moderate UV light photopolymerization. The photo-mediated oxime reaction immobilized proteins with alkoxyamines in UV-exposed areas. Sample sites are polymerized by photo-mediated oxime reactions. All UV-irradiated polymer solution gelled except photo-masked portions [ 53 151 152 Table 5 The straightforwardness, specificity, and water compatibility of dynamic covalent chemistry for hydrazone and oxime connections make it attractive. Wang et al. examined the influence of ions on the kinetics of hydrazone and oxime reactions. Researchers discovered that fundamental salts such as sodium chloride (NaCl) may stabilize the rate-limiting transition state and enhance oxime production at neutral pH with aldehyde and less reactive keto substrates, hence accelerating dehydration. NaCl or divalent salts such as MgCl 2 2 156 3.6. Pseudo-Click Hydrogels Thiol-Michael pseudo click chemistry creates thioester bonds by adding a thiol group to a vinyl sulfone, acrylate, or maleimide double bond with or without a catalyst [ 157 158 159 160 161 Recently, Pupkaite et al. demonstrated that injectable hydrogels based on extracellular matrix-derived polymers show much promise in the field of tissue engineering and regenerative medicine. However, the hydrogels reported to date have at least one characteristic that limits their potential for clinical use, such as excessive swelling, complicated and potentially toxic crosslinking process, or lack of shear thinning and self-healing properties. They hypothesized that a collagen hydrogel crosslinked using thiol-Michael addition click reaction would be able to overcome these limitations. To this end, collagen was modified to introduce thiol groups, and hydrogels were prepared by crosslinking with 8-arm polyethylene glycol-maleimide. Rheological measurements on the hydrogels revealed excellent shear-thinning and self-healing properties. Additionally, only minimal swelling (6%) was observed over a period of 1 month in an aqueous buffer solution. The reported thiolated-collagen hydrogel crosslinked using thiol-Michael addition click reaction overcomes most of the challenges in the injectable hydrogel design and is an excellent candidate for cell delivery in regenerative medicine and tissue engineering applications [ 162 In hydrogel formation, thiol–acrylate and thiol–maleimide linkages are commonly used to establish durable, covalently bonded networks with tunable stiffness and gelation profiles. The adaptability of this method allows for precise regulation of hydrogel properties, including degradation behavior, functionalization level, and biological responsiveness. Due to its biocompatibility and reaction specificity, Michael addition is especially suitable for developing injectable hydrogels, in situ forming gels, and ocular bioadhesives where controlled crosslinking is essential. Subsequently, Tortora et al. present a pioneering approach for the formation of poly (vinyl alcohol) (PVA)-based hydrogels using the Michael addition strategy, specifically designed for safe in situ vitreous replacement. Recognizing the risks associated with radical initiators in conventional crosslinking methods, the authors devised a two-component system: methacryloyl-modified PVA and thiol end-capped PVA, synthesized via selective oxidation and cysteine conjugation. Upon mixing in physiological conditions, these macromers undergo a Michael-type nucleophilic addition, forming a stable hydrogel network without the need for radicals or photo initiators. The resulting hydrogels exhibit tunable gelation times compatible with surgical requirements, as well as favorable viscoelastic and swelling properties that can be tailored by adjusting the macromer composition. This strategy not only minimizes potential cytotoxicity but also enables precise control over network structure and mechanical characteristics, making these PVA hydrogels highly promising for biomedical applications such as vitreous substitutes, where biocompatibility, transparency, and mechanical integrity are critical [ 163 Instead of acrylate, researchers used highly reactive vinyl sulfone in thiol-Michael reactions due to its strong links and electron-withdrawing properties [ 164 165 166 167 The thiol-Michael addition process can be initiated by several catalysts, including bases, metals, organometals, Lewis’s acids, and nucleophiles. Among these catalysts, bases and nucleophiles have the highest efficiency, demonstrating minimal propensity for side reactions. Both base- and nucleophile-catalyzed thiol Michael reactions occur swiftly, achieving high conversion rates under moderate circumstances; nevertheless, their processes exhibit subtle variations. The base extracts a proton from the thiol, producing a thiolate anion that participates in the thiol-Michael addition process. The nucleophile interacts with the electron-deficient double bond, forming an intermediate carbanion that subsequently deprotonates the thiol, yielding another thiolate anion. Under physiological settings, Liu et al. synthesized an in situ thiol-Michael hydrogel utilizing glycidyl methacrylate-modified dextran backbones crosslinked by dithiothreitol. The mechanical characteristics, gelation time, and swelling behavior of the hydrogel exhibited significant pH dependence. Moreover, 3D cell encapsulation experiments demonstrated elevated viability of MSC and NIH/3T3 fibroblasts [ 168 Aldehyde-hydrazide pseudo reactions, like other click chemistry reactions, are straightforward, adaptable, and reversible, yielding non-toxic end products. Numerous polysaccharides were treated with aldehyde and ADH derivatives to produce hydrogels. Bulpitt and Aeschlimann synthesized the inaugural hydrogel utilizing HA-ADH and HA-aldehyde [ 169 170 171 In addition, Chang et al. presented the design and evaluation of an in situ-forming zwitterionic hydrogel for long-term vitreous substitution, utilizing the Michael addition strategy for crosslinking. The hydrogel is synthesized from a zwitterionic copolymer, poly (MPDSA-co-AC), which combines sulfobetaine methacrylamide for ultra-low biofouling and biocompatibility, and acryloyl cystamine to introduce thiol groups. Crosslinking occurs via a thiol–ene Michael addition reaction with α-PEG-maleimide as the crosslinker, enabling rapid in situ gelation under physiological conditions. The resulting hydrogels exhibit desirable properties for ocular implantation, including high transparency, controllable gelation time, tunable mechanical strength, and low swelling. In vivo studies in a rabbit model demonstrated that hydrogels with a thiol–ene ratio of 2:1 formed stable, space-filling, and transparent implants that remained biocompatible and intact for at least two months. This work highlights the advantages of the Michael addition strategy for hydrogel crosslinking, offering a promising, minimally invasive approach to create injectable, long-lasting, and biocompatible vitreous substitutes and potentially other soft tissue replacements [ 172 Martinez-Sanz et al. created an injectable hydrogel composed of BMP-2-loaded HA for in vivo bone tissue development. These stable gels were synthesized using amidation and selective oxidation. Gelation occurred in 30 s, while BMP-incorporated hydrogel samples were cured at ambient temperature for 3 h. In vivo investigations utilized cured samples [ 173 13 174 175 176 13 174 175 176 177 3.7. Schiff Base Reaction Schiff base chemistry is a technique commonly utilized to form dynamic covalent bonds in hydrogel systems. It is distinguished for its exceptional biocompatibility, reversibility, and uncomplicated reaction mechanism. The formation of imine bonds (–C=N–) occurs through the condensation of primary amines with aldehydes or ketones. These processes are especially beneficial for biomedical applications, such as ocular adhesives, injectable gels, and tissue engineering matrices, as they occur effectively in aqueous environments under moderate conditions, obviating the necessity for harmful catalysts or initiators. Hydrogels can dynamically adjust to their biological environments owing to the exceptional pH sensitivity and self-healing characteristics of Schiff base linkages. Imine bonds are often unstable in acidic conditions and prone to hydrolysis over time, unlike more robust covalent bonds such as oximes. Schiff base-crosslinked hydrogels are exceptionally appropriate for targeted drug delivery, corneal regeneration, and ocular tissue repair owing to their extensive polymer compatibility, customizable mechanical properties, and rapid gelation [ 178 179 180 Chen’s team created a unique biocompatible polysaccharide-based self-healing hydrogel, composed of N-carboxyethyl chitosan, adipic acid dihydrazide, and oxidized sodium alginate. The outcomes of rheological recovery testing, macroscopic observation, and beam-shaped strain compression measurement demonstrated exceptional self-healing capability with a high healing efficiency (≈95%). Furthermore, NIH3T3 fibroblast cells were enclosed during gel formation, preserving good viability and proliferative potential [ 181 182 183 Chand et al. created a dual-crosslinked interpenetrating network (IPN) hydrogel using Schiff base chemistry and photo crosslinking to fabricate biomimetic corneal stroma equivalents. Gelatin methacryloyl (GelMA) and oxidized carboxymethylcellulose (OxiCMC) create a hydrogel that enables primary crosslinking via the formation of dynamic imine (Schiff base) connections between their aldehyde groups and the amine groups of GelMA. UV-induced photopolymerization of GelMA guarantees network stability. This dual crosslinking method produces hydrogels with an improved compressive modulus (106.3 ± 7.7 kPa), significant optical clarity, and superior printability for DLP 3D bioprinting. The engineered structures exhibited favorable porosity, interconnected networks, superior cell viability (>93%) of encapsulated human corneal keratocytes, and robust structural integrity and reproducibility. The technique eliminates synthetic polymers and detrimental crosslinkers, ensuring ocular tissue creation is safe, biocompatible, and structurally sound [ 184 Table 6 As illustrated in Figure 3 124 4. Applications in Tissue Engineering Hydrogels have found several applications in fields such as cell culture, medication delivery, tissue regeneration, and more. Hydrogel preparation relies heavily on “click” chemistry. Here, we look at some of the many uses for hydrogels made using “click” chemistry, including Cartilage and bone regeneration, Skin and wound healing, Neural and spinal cord scaffolds, Ocular and corneal regeneration, and Bioprinting and 3D fabrication. In the realm of biomedicine, regenerative medicine has paramount importance. The injectability, controlled release, biocompatibility, and degradability of biomaterials used for tissue regeneration, often hydrogels, are of the utmost importance. Researchers have often opted for “click” chemistry when developing hydrogels for tissue regeneration due to the difficulty of achieving a broad chemical crosslinking approach ( Figure 4 126 4.1. Cartilage and Bone Tissue Engineering The body cannot repair damage to cartilage tissue, leading to a lasting condition. Joint injuries may be effectively managed by the rapid development and placement of cells sourced from bone tissue [ 189 190 The extracellular matrix encases a small aggregation of chondrocytes inside cartilage lacunae. Jeon et al. reproduced this structure in human-derived nasal septal chondrocytes using TA-based clustering and click chemistry-based hydrogel. This technique facilitates efficient patient harvesting, stemness, and differentiation. They used TA binding to create lacunae-like hNC clusters. Hydrogel encapsulation of hNC clusters was achieved using click chemistry linking modified PEG and gelatin. A hydrogel using click chemistry demonstrated increased hNC cluster viability and chondrogenic differentiation. Immunohistochemical staining demonstrated cartilage regeneration after the injection of hNC clusters in hydrogel into a rat osteochondral lesion model. These results underscore the potential of the lacuna-mimic structure for in vivo cartilage regeneration using hNC clusters and click chemistry-based hydrogels [ 191 Contemporary bone cement solutions often need free radical or metal-based initiators and catalysts for crosslinking, which may provide risks. The substantial scaffolds have a protracted degradation rate, hence complicating the cellular process of tissue regeneration. Liu et al. created a porous organic–inorganic nanohybrid cement (PO-click-ON) that employs metal-free biorthogonal click chemistry for crosslinking, resulting in a porous architecture akin to natural bone tissue via particle leaching. The strain-promoted click reaction efficiently crosslinks polymer chains without using hazardous initiators or catalysts. PO-click-ON implants exhibited exceptional in vitro adherence of stem cells and facilitated their osteogenic development, with a significant number of stem cells infiltrating the scaffolds extensively. The PO-click-ON device exhibited significant cell adsorption, neovascularization, and osseous development in a rat cranial lesion model. This study introduces a porous click cement those functions as a viable multifunctional platform for bone and tissue engineering [ 192 Joint pain and diminished mobility impact 500 million people worldwide owing to the deterioration of articular cartilage (AC) resulting from osteoarthritis (OA). The load-bearing capacity of AC, along with its restricted regenerative potential and particular limitations in patients, has driven research into customized 3D-printed hydrogel scaffolds. Although elaborate multi-network hydrogel scaffolds may be fabricated, a mechanically robust and uncomplicated single-network scaffold is the preferred choice. Arickx et al. investigated the mechanical and swelling characteristics of thiol-ene photopolymerized poly (ethylene oxide) (PEO) hydrogels. Homogeneous polymer networks with diverse topologies were synthesized by selectively crosslinking three-arm (1k) and four-arm (2k) PEO thiol building blocks with linear (6k, 10k, 20k) or four-arm (20k) PEO norbornene. The assessment of mechanical and swelling properties was performed using nonconfined uniaxial compression testing, supplemented by both empirical and theoretical swelling analysis. Gelation velocity evaluated for single-layer DLP printing. The augmentation of building block branching led to enhanced homogeneity of the hydrogel network and better mechanical and swelling properties. Thiol four-arm PEO (2k) and 20k norbornene hydrogels can withstand 90% compression without failure, exhibiting E-moduli of 895 ± 10 kPa and maximum stresses of 16.4 ± 0.6 MPa, equivalent to the strength of AC. All four-arm thiol gels demonstrated superior printing quality and gelled in 2 s. Hydrogels with enhanced branching demonstrated reduced swelling; yet their mesh size is still unacceptably tiny for biological applications. This research demonstrates that network design results in the formation of resilient and uncomplicated hydrogels [ 193 A hydrogel for wound healing was shown by Qu and colleagues. It is composed of chitosan and PF127-aldehydes that were crosslinked via a “click” reaction. This hydrogel has characteristics including adhesion, self-healing capacity, antimicrobial activities, and haemostasis. More than twice as effective in healing as regular commercial dressings [ 194 195 196 4.2. Skin and Wound Healing The skin, being the body’s biggest organ, is essential for safeguarding against several hazards, including diseases, radiation, and severe temperatures. Burns, abrasions, or lacerations are the predominant causes of dermal damage. Although minor skin lesions may heal spontaneously, full thickness burns, and other severe injuries need medical intervention to expedite the healing process. Haemostasis, inflammation, proliferation, and remodeling are the four primary phases in the normal wound healing process. Various cell types, bioactive compounds, and extracellular matrix components are involved in this process. The first phases of wound healing include inflammation and haemostasis. To regulate hemorrhage and eradicate infections, the immune system and platelets are activated throughout both periods [ 197 Recent advancements in bioactive modulation demonstrated the role of hydrogels as bioactive materials in activating platelets and regulating the chemotaxis of immune cells, and controlling cell expression [ 198 199 Recent advancements in bioactive modulation demonstrated the role of hydrogels as bioactive materials in activating platelets and regulating the chemotaxis of immune cells, and controlling cell expression [ 198 Huang et al. created a hydrogel platform capable of cell printing, using thiolated γ-polyglutamic acid (γ-PGA-SH), glycidyl methacrylate-conjugated γ-polyglutamic acid (γ-PGA-GMA), and thiolated arginine-glycine-aspartate (RGDC) sequences. In this configuration, RGDC functions as an integrin receptor, facilitating cell attachment and dispersion. This platform is created with an optimized gelation technique, emphasizing the efficiency and accuracy intrinsic to the thiol-ene click reaction. The peptide-based hydrogel platform shows potential as effective carriers for cell and growth factor administration, concurrently creating a living material that closely resembles the physicochemical properties of skin tissue [ 200 201 Lu’s research group focused on wound healing using click chemistry. Employing NIR-responsive substrates, Lu et al. procured cell sheets and affixed fibronectin to their surfaces. They synthesized fibronectin-attached cell sheets (FACS) by metabolic glycoengineering of non-natural sugars, carbon diimide chemistry, and click chemistry. The biological assessment revealed that the binding of fibronectin and the whole biochemical reaction cascade were biocompatible, further promoting cell migration and proliferation. In Vivo experiments on wound healing revealed that FACS efficiently integrated the therapeutic advantages of fibronectin and cell sheets, resulting in superior wound repair compared to conventional cell sheets (CS). FACS have the capability to enhance the regeneration of the dermis, epidermis, hair follicles, and blood vessels. It may accelerate collagen deposition and reduce inflammatory reactions, demonstrating significant practical potential in regenerative medicine [ 202 Wang et al. have formulated a multifunctional hydrogel dressing (FHE hydrogel) that is crosslinked via the Schiff base reaction, using Pluronic F127 (F127), oxidized hyaluronic acid (HA), and ε-εpolylysine (EPL). This hydrogel has several activities, including fast haemostasis, self-healing, tissue adhesion, high-efficiency antibacterial activity, and resistance to various drug-resistant bacteria. Exosomes obtained from adipose-derived MSCs were integrated into the hydrogel via electrostatic interactions, yielding a hydrogel that exhibited prolonged pH-responsive release characteristics. Research in rats indicated that exosome-infused hydrogel dressings may augment angiogenesis in injured tissue, therefore promoting wound healing. Furthermore, it may promote cell proliferation, granulation tissue development, collagen deposition, remodeling, and re-epithelialization, leading to expedited healing of severe wounds [ 203 Chen et al. developed a self-healing hydrogel-encapsulated chlorhexidine acetate and basic fibroblast growth factor for wound healing. This facilitated the rapid delivery of the chlorhexidine acetate, to inhibit inflammation at the early stages of wound repair, and the sustainable release of the basic fibroblast growth factor to stimulate cell proliferation and wound repair at the wound site. The results indicated that the hydrogel promoted wound healing by reducing inflammation, promoting collagen fiber growth and fibroblast proliferation [ 204 4.3. Neural and Spinal Cord Scaffolds The spinal cord is vital to the central nervous system. Sensory and motor impulses are conveyed between the brain and peripheral nerves via the spinal cord. The spinal cord also governs fundamental reflexes, including urination and defecation. Significant central nervous system injuries, including spinal cord injuries (SCI), may impair sensory and motor skills below the lesion site. Individuals with spinal cord injuries often encounter pressure ulcers, urinary issues, breathing difficulties, deep vein thrombosis, pulmonary embolism, spasms, pain, autonomic dysreflexia, and osteoporosis, in addition to neurological deficits. The patient’s quality of life may be diminished, and these complications might obstruct rehabilitation efforts and provide life-threatening dangers. Annually, there are between 13,300 and 22,600 new instances of spinal cord injury globally. Substantial medical costs, prolonged recovery, and employment loss profoundly affect family members. Regeneration of the spinal cord is crucial; however, it poses considerable problems. Hydrogel-assisted tissue engineering may facilitate the healing of spinal cord injury. Stem cells possess the capacity for self-renewal and differentiation into tissue cells, rendering them essential as fundamental cells in tissue regeneration and repair processes. Various cells, including mesenchymal stem cells, neural stem cells, embryonic stem cells, olfactory unsheathing cells, and oligodendrocytes, are transplanted to address spinal cord injury [ 205 206 Zhang et al. documented the creation of injectable hydrogels modified with clickable methylprednisolone (MP) and a cellular adhesion peptide, using free radical polymerisation to promote nerve regeneration after spinal cord damage (SCI). Hydrogels conjugated with MP may affect the immunoinflammatory milieu of spinal cord injury and promote neuronal survival. Hydrogels with varying stiffness levels were developed by altering concentration ratios to evaluate appropriate mechanical stimulation. In a dorsal root ganglion model, hydrogels modified with MP and displaying mechanical signals like those in adult rat spinal cords shown improved efficacy in promoting the formation of dorsal root ganglion. Hydrogels modified with MPs has the capability to regulate the immune-inflammatory milieu and improve the restoration of motor and sensory functioning. The positive outcomes demonstrated that the interplay between immunomodulation and mechanical signals is crucial for improving nerve regeneration, underscoring the significant potential of hydrogels as a therapeutic approach for spinal cord injury repair [ 207 Li et al. used a crosslinked HA hydrogel combined with a binding PPFLMLLKGSTR peptide to encapsulate MSCs and MnO2 nanoparticles. Animal studies indicated that the implantation of mesenchymal stem cells (MSCs) promoted the development of neuronal cells in spinal cord injury, hence improving motor function recovery in SCI rats [ 208 In another study, Tigner et al. evaluated in situ constructed poly (ethylene glycol) (PEG)-based granular hydrogels for the administration of neural progenitor cells (NPC) in a mouse model of spinal cord injury. Thiol-norbornene click chemistry is used to synthesis microgel precursors by the reaction of four-armed PEG-amide-norbornene with peptides that are enzymatically degradable and cell-adhesive. In situ, assembly into scaffolds is accomplished with unreacted norbornene groups in conjunction with a PEG-di-tetrazine linker. The granular hydrogel scaffolds exhibit superior biocompatibility and do not adversely affect the inflammatory response after spinal cord injury. Moreover, the granular hydrogel scaffolds, employed for NPC delivery, enhanced NPC engraftment, did not adversely affect the immune response to the NPC grafts, and successfully encouraged graft differentiation into neuronal or astrocytic lineages, as well as axonal extension into the host tissue. The findings together endorse the use of PEG-based granular hydrogel scaffolds as a suitable biomaterial substrate for NPC distribution and need further research, particularly for more severe spinal cord injuries [ 209 In addition to motor function losses, damage at the spinal cord injury site may initiate a series of subsequent pathophysiological reactions. This encompasses ischemia and hypoxia, the invasion of inflammatory cells, and the release of excitatory amino acids and free radicals. These processes may cause the deterioration of axons and myelin sheaths, potentially culminating in the death of nerve cells. Consequently, the incorporation of hydrogel materials at the spinal cord injury site enhances immunomodulation throughout the healing phase of spinal cord injuries. Zhang et al. synthesized an antioxidant hydrogel using the Schiff base reaction, which included crosslinking between aldehyde HA, adipic acid dihydrazide graft HA, and 2,2,6,6-tetramethylpiperidinyloxy. The antioxidant hydrogel exhibited substantial antioxidant properties in the in vitro simulated peroxidized microenvironment. Following implantation, the hydrogel exhibited a significant improvement in motor function recovery in rats subjected to spinal cord transection [ 210 Noncovalent interactions between cells and external stimuli are recognized as crucial physiological connections that affect cellular activity. The influence of covalent bonds between cells and biomaterials on cellular behavior has yet to be investigated. Liu et al. presented an approach that combines covalent coupling of biomaterials (collagen fibers/lipid nanoparticles) with several cell types (exogenous neural progenitor cells/astrocytes/endogenous tissue-resident cells) to improve neural regeneration after spinal cord injury. Our results demonstrate that metabolic azido-labeled human brain progenitor cells adhered to dibenzo cyclooctyne-modified collagen fibers significantly improved cell adherence, spreading, and differentiation relative to noncovalent adhesion. Dibenzo cyclooctyne-modified lipid nanoparticles encapsulating edaravone, a recognized reactive oxygen species scavenger, may also selectively target azide-labeled spinal cord tissues or transplanted azide-modified astrocytes to improve the spinal cord injury microenvironment. In a rat spinal cord injury model, the use of several covalent conjugation techniques collectively improved neural regeneration, suggesting that the interactions between cells and biomaterials are very promising for tissue regeneration [ 211 4.4. Ocular and Corneal Regeneration The cornea is a transparent, thin tissue that envelops the front portion of the eyeball. It constitutes one-sixth of the thickness of the extraocular fiber membrane, functioning to mechanically safeguard the eyeball and prevent the ingress of dangerous chemicals into the eye. The cornea operates akin to a camera lens, allowing light to traverse the pupil and concentrate on the retina’s funds for imaging. The cornea, being the outermost layer of ocular tissue, is very vulnerable to damage. Corneal injury may result from ocular trauma, including mechanical and chemical traumas, in addition to bacterial infections, burns, and viral infections. The repair of corneal injuries involves several components, including growth factors, extracellular matrix remodeling, and the participation of corneal cells, namely epithelial, stromal, and endothelial cells. Thus, the regeneration of the cornea poses considerable difficulties. Researchers are developing novel materials for corneal restoration and regeneration as tissue engineering advances in regenerative medicine. Materials for corneal regeneration must closely resemble the normal cornea regarding water content, light transmittance, and ion transmission rate. They must provide enough mechanical strength to withstand surgical sutures and post-operative care, while simultaneously exhibiting stability (resistance to enzymatic hydrolysis) and biocompatibility to promote the proliferation of corneal epithelial cells. Research on corneal regeneration mostly focusses on hydrogels because of their critical properties [ 212 213 Hydrogels based on poly (ethylene glycol) (PEG) are widely acknowledged as highly promising three-dimensional scaffolds for cells, finding extensive applications in tissue regrowth and regeneration. Nonetheless, obtaining functionalized PEG hydrogels that offer dynamic, cell-instructive microenvironments continues to be inherently difficult. Lei et al. utilized the specificity of the click reaction to develop a range of hydrogels made from 4-arm PEG tetraazide (4-arm-PEG-N3) and di-propagated peptides (GRGDG and GRDGG), showcasing customizable physicochemical properties ideal for 3D cell scaffolds. The interaction between the azide groups of PEGS and the alkynyl groups of peptides, facilitated by copper, resulted in the formation of triazole rings, leading to the creation of a crosslinked hydrogel. The duration of gelation and the mechanical integrity of the hydrogels varied according to the PEG/peptide feed ratio. The hydrogel exhibited a distinctive porous structure along with suitable swelling characteristics. The cytotoxicity assay conducted in vitro showed that the resulting hydrogels displayed no notable cytotoxic effects on human corneal epithelial cells (HCECs). The co-incubation with HCECs had a significant impact on cell adhesion, spread ability, and proliferation, which depended on the density of RGD, and peptide sequences present in the hydrogels. The hydrogel proposed showed notable ocular biocompatibility following subconjunctival implantation in the eyes of rabbits. The findings suggest that biofunctional hydrogels made from PEG and RGD motifs, created through a controlled click reaction, could be effective as 3D cell scaffolds for the regeneration of corneal epithelium [ 214 Li et al. created photocurable hydrogels using acrylate and thiolated gelatin as a reparative substance intended for the regeneration of localized corneal injuries. Animal experiments demonstrated that the hydrogel had remarkable biocompatibility in vivo with rabbit corneas and facilitated the healing of localized corneal injuries, attaining epithelial wound covering after just 3 days [ 215 Rosenquinst et al. created an injectable hydrogel in a separate investigation by crosslinking acetyl thiol collagen with PEG-maleimide via a thiol-maleimide click reaction. Upon combining the gel constituents, this hydrogel may be positioned in an aqueous buffer while preserving its form. The synthesized hydrogel can be maintained in an aqueous buffer for at least one year without significant swelling or changes in form. The mechanical characteristics of hydrogels may be readily modified by changing the ratio of the two components, obviating the need for new synthesis or design. The created thiol collagen hydrogels are entirely transparent, enzymatically degradable, and promote the adhesion and proliferation of human corneal epithelial cells. The hydrogels produced demonstrate a lap shear strength akin to that of fibrin glue, regarded as the gold standard for tissue adhesives in clinical applications, and possess the ability to seal porcine corneas, allowing them to withstand a higher mean pressure than the average intraocular pressure in humans. This discovery lays the groundwork for the future use of this hydrogel in healing corneal perforations, in situ tectonic filling of corneal holes, and the possible delivery of therapeutic cells and proteins [ 216 Koivusalo et al. developed tissue sticky HA-DOPA hydrogels by integrating dopamine moieties into hydrazine crosslinked hyaluronic acid for corneal regeneration. The entrapment of human adipose-derived stem cells (hASCs) in HA-DOPA hydrogels exhibited advantageous proliferation and cellular elongation properties. The HA-DOPA hydrogels exhibited superior tissue adherence after implantation in a porcine ocular organ. This hydrogel has significant promise as a reparative material for facilitating corneal regeneration, as seen by the findings [ 217 4.5. Bioprinting and 3D Fabrication Using Click-Based Inks Recently, diverse reaction techniques have facilitated the creation of new innovative multifunctional hydrogel biomaterials, identified as bioinks for 3D bioprinting [ 218 219 220 221 Bock et al. encapsulated patient-derived breast cancer cells in bioprinted hydrogels composed of polyethylene glycol (PEG), which were functionalized with adhesion peptides such as RGD, GFOGER, and DYIGSR, alongside gelatin-derived hydrogels including gelatin methacryloyl (GelMA) and thiolated-gelatin crosslinked with PEG-4MAL (GelSH) [ 222 223 Based on recent research, High sensitivity in molecular identification inside biological contexts may be attained by surface-enhanced Raman spectroscopy (SERS). Incorporating SERS sensors into 3D models may provide resilient platforms for investigating biological responses to medicines, metabolic pathways, signaling, and intercellular interactions. Afonso et al. introduced a library of plasmonic hydrogels including gelatin, alginate, and carboxymethylcellulose, which may be orthogonally photo-crosslinked using thiol–ene click chemistry. They also determined the main physicochemical parameters that enhance their SERS performance. Swelling, porosity, and chemical composition were recognized as critical elements affecting their capacity to detect diverse compounds by SERS. Furthermore, the biocompatibility and printability of these hydrogels must be evaluated to ensure they meet the standards for use as 3D cellular scaffolds, emphasizing their capability for real-time and in situ detection of biorelevant metabolites [ 94 In another study, Bebiano et al. proposes a bioinspired design methodology for bioengineering double crosslinked pectin-based bioinks. This technique seeks to emulate the mechanical characteristics and organization of cell-adhesive ligands and protease-sensitive regions present in the dermal extracellular matrix, thereby enabling the bioprinting of bilayer 3D skin models. Pectin modified with methacrylate acted as a primary biomaterial, enabling hydrogel production by either chain-growth or step-growth photopolymerization. This method facilitated the autonomous modulation of bioink rheology, in conjunction with the mechanical and biochemical cues present in the cellular environment. By modifying the concentrations of the crosslinker and polymer in the bioink formulation, dermal constructions were bioprinted with varying stiffnesses that were physiologically relevant, resulting in significant site-specific differences in the morphology and spreading of dermal fibroblasts. The synthesized thiol-ene photo-clickable bioinks facilitate the bioprinting of skin models in diverse configurations, aiding in the reconstruction of both dermal and epidermal layers. The tailored bioinks expand the range of printable biomaterials for the extrusion bioprinting of 3D cell-laden hydrogels and provide a versatile platform to investigate the influence of material cues on cell destiny, offering prospects for in vitro skin modeling [ 224 Stichler et al. recently published a comparable method that integrates thiol-ene click chemistry with 3D bioprinting to fabricate three-dimensional objects. Polyglycidol-based hydrogels were used, crosslinked by UV light, and cytotoxicity assessments were performed using hMSCs derived from bone marrow. High molecular weight hyaluronic acid was integrated to alter the rheological characteristics, enabling the printing of 20-layered structures with remarkable repeatability. Recently, several scientists have documented this combinatorial method that employs click chemistry in conjunction with 3D bioprinting for diverse applications in tissue engineering [ 225 226 5. Advantages and Limitations of Click Chemistry in Hydrogels Click chemistry provides rapid, selective, and bioorthogonal hydrogel formation with tunable mechanical and biological properties, while enabling cell and bioactive molecule incorporation. Metal-free and catalyst-free strategies further improve biocompatibility. Key advantages and limitations are summarized in Figure 5 5.1. Advantages Rapid Gelation under physiological conditions: 227 Bio-orthogonality and Cytocompatibility: 89 Catalyst Free and Metal Free Strategies: 228 Tunable Mechanical and Chemical properties: 229 Gustavo et al. investigated the effect of molecular weight and size on PEG-based, metal-free catalyzed hydrogels, demonstrating their influence on mechanical properties and gelation time. Increasing the molecular weight enhanced the elasticity of the hydrogels. While these hydrogels were designed to be porous for skin regeneration, controlling the molecular size also allowed for improved mechanical performance [ 230 Collins et al. used the increasing of the degree of crosslinking strategy for improving their oxime-boronate bonded hydrogel. The use of boronate linkage increased the crosslinking so that the doubled the shear modulus of the hydrogel [ 231 Shao et al. investigates the dynamic and static mechanical properties of the CNC-PEG click based hydrogel. The resultant hydrogel showed fracture elongation of about 700%. Also, the fatigue related properties are investigated for dynamic situation performance showed self-recovery nature of the bonds used helped for antifatigue properties of the hydrogel. This study highlights not only the Mw and crosslinking density are important factor on the mechanical properties but also the bond’s nature in the molecular structure plays a crucial role especially in the dynamic situations like fatigue [ 232 233 234 Wei et al. studied a dextran-based self-healing hydrogel fabricated using reversible Diels–Alder click chemistry. Using fulvene modified dextran as the main polymer chain. The theological examination showed the structural recovery that confirms shear thining behavior. Complete healing of hydrogel showed to occur after only 7 h in physiological temperature [ 235 Tan et al. also investigated the self-healing characteristic of a hyaluronic-based hydrogel formed using reversible Diels–Alder click chemistry. This gel showed transition from gel-like structure to solid form after about 25 min. Although it is relatively high time compared to other typical methods of click chemistry, the resultant hydrogel showed great potential balancing specificity in proteins encapsulation, cytotoxicity and stable mechanical properties after 20 days [ 233 Yu et al. used combination of Diels Alder click reaction and acylhydrazone bond. The DA reaction maintained the hydrogel’s mechanical properties and makes the basis of structural integrity of hydrogel while the dynamic covalent acylhydrazone bond resulted in self-healing property of hydrogel [ 125 Liu et al. investigated Diels–Alder click reactions as a tool for tuning the mechanical properties in hydrogels. The kinetic control via DA click reaction enabled precise controlling of crosslinking density and rate, which influenced stiffness, viscoelasticity and self-healing capabilities of hydrogel. The other thing studied in this study was faster kinetic reaction; Electron-demand, click reaction showed denser molecular structure which enhanced the mechanical toughness of the hydrogel [ 236 Another advantage of this controllability is the ability to design hydrogels that can be triggered or patterned using light or ultrasound. For example, visible light has been used to activate thiol–ene hydrogels for bone fragment adhesion and regeneration, while focused ultrasound has been applied to trigger Diels–Alder PEG hydrogels for localized release of bone morphogenetic protein-2 (BMP-2) [ 134 5.2. Disadvantages Biocompatibility Concerns from Catalysts, Light and Reactive Intermediates: 237 238 Mechanical Limitations: Challenges in Degradation Control: 239 240 Complex and Costly Manufacturing: 53 6. Summary and Outlook Click chemistry-based hydrogels are emerging as a versatile and powerful platform for regenerative medicine, tissue engineering, and drug delivery. Their precision, modularity, and unique adaptability position them to overcome many of the limitations associated with traditional biomaterials, such as uncontrolled crosslinking, poor reproducibility, and limited biological integration. By providing powerful yet tunable chemical strategies, click reactions allow the design of hydrogels with highly defined structures, predictable functionality, and flexibility to incorporate diverse bioactive cues. Importantly, these systems are not limited to academic development. They have great potential for real world applications. Their compatibility with aqueous environments, rapid reaction kinetics, and their orthogonality to biological systems make them particularly suitable for clinical applications. As a result, click-based hydrogels may accelerate the development of advanced wound dressings, injectable therapies, ophthalmic adhesives, and scaffolds for complex tissue regeneration. However, realizing this promise will require ongoing interdisciplinary collaboration. Chemists must continue to refine reaction tools for safety and efficacy. Engineers must advance scalable manufacturing and delivery methods; biologists must evaluate cellular responses and regenerative outcomes; and physicians will play a pivotal role in defining practical needs and guiding regulatory transformation. Ultimately, the convergence of chemistry, biology, and engineering in this field may reshape the future of biomedical sciences and translate into tangible healthcare solutions that improve quality of life. Disclaimer/Publisher’s Note: Author Contributions Conceptualization and draft design, A.R.D. and Z.A.; writing—original draft preparation and figure preparation, S.S., A.P. and A.Y.; supervision and project guidance, A.R.D.; funding acquisition, A.R.D. All authors have read and agreed to the published version of the manuscript. Data Availability Statement Not applicable. Conflicts of Interest The authors declare no conflicts of interest. References 1. Arabpour Z. Salehi M. An S. Moghtader A. Anwar K.N. Baharnoori S.M. Shah R.J. Abedi F. Djalilian A.R. Exploring hydrogel nanoparticle systems for enhanced ocular drug delivery Gels 2024 10 589 10.3390/gels10090589 39330191 PMC11430953 2. Waqar M.A. Mubarak N. Khan A.M. Shaheen F. Mustafa M.A. Riaz T. Recent advances in polymers, preparation techniques, applications and future perspectives of hydrogels Int. J. Polym. Mater. Polym. Biomater. 2025 74 265 284 10.1080/00914037.2024.2335163 3. Mahheidari N. Alizadeh M. Farahani M.K. Arabpour Z. Djalilian A.R. Salehi M. Regeneration of the skin wound by two different crosslinkers: In vitro and in vivo studies Iran. J. Basic Med. Sci. 2025 28 194 39850117 10.22038/ijbms.2024.80137.17361 PMC11756729 4. El-Sayed N.S. Fahmy T.Y. Kamel S. Stimuli-responsive hydrogels derived from agricultural residues: An overview Chem. Pap. 2025 79 3475 3491 10.1007/s11696-025-03994-w 5. Sojdeh S. Panjipour A. Bejandi Z.B. Salehi M. Yaghmour A. Arabpour Z. Djalilian A.R. Chan R.V.P. Hydrogel-Based Vitreous Substitutes Int. J. Mol. Sci. 2025 26 8406 10.3390/ijms26178406 40943326 PMC12428293 6. Arabpour Z. Youseffi M. Soon C.F. Sultana N. Bazgeir M.R. Masoud M. Sefat F. Designing biomaterials for regenerative medicine: State-of-the-art and future perspectives Tissue Engineering Strategies for Organ Regeneration CRC Press Boca Raton, FL, USA 2020 1 9 7. Nie L. Sun Y. Okoro O.V. Deng Y. Jiang G. Shavandi A. Click chemistry for 3D bioprinting Mater. Horiz. 2023 10 2727 2763 10.1039/D3MH00516J 37170645 8. Li Y. Wang X. Han Y. Sun H.-Y. Hilborn J. Shi L. Click chemistry-based biopolymeric hydrogels for regenerative medicine Biomed. Mater. 2021 16 022003 10.1088/1748-605X/abc0b3 33049725 9. Zhou Y. Gao L. Peng J. Xing M. Han Y. Wang X. Xu Y. Chang J. Bioglass activated albumin hydrogels for wound healing Adv. Healthc. Mater. 2018 7 1800144 10.1002/adhm.201800144 29845777 10. Gao G. Jiang Y.-W. Jia H.-R. Wu F.-G. Near-infrared light-controllable on-demand antibiotics release using thermo-sensitive hydrogel-based drug reservoir for combating bacterial infection Biomaterials 2019 188 83 95 10.1016/j.biomaterials.2018.09.045 30339942 11. Ullah A. Lim S.I. Bioinspired tunable hydrogels: An update on methods of preparation, classification, and biomedical and therapeutic applications Int. J. Pharm. 2022 612 121368 10.1016/j.ijpharm.2021.121368 34896566 12. Haider A. Kortz U. Afridi S. Sohail M. Joshi S.A. Iqbal J. Novel pH responsive supramolecular hydrogels of chitosan hydrochloride and polyoxometalate: In-vitro, in-vivo and preliminary safety evaluation Int. J. Pharm. 2017 533 125 137 28947244 10.1016/j.ijpharm.2017.09.034 13. Li S. Xia Y. Qiu Y. Chen X. Shi S. Preparation and property of starch nanoparticles reinforced aldehyde–hydrazide covalently crosslinked PNIPAM hydrogels J. Appl. Polym. Sci. 2018 135 45761 10.1002/app.45761 14. Patel P. Thareja P. Hydrogels differentiated by length scales: A review of biopolymer-based hydrogel preparation methods, characterization techniques, and targeted applications Eur. Polym. J. 2022 163 110935 10.1016/j.eurpolymj.2021.110935 15. Lowe A.B. Thiol-ene “click” reactions and recent applications in polymer and materials synthesis Polym. Chem. 2010 1 17 36 10.1039/B9PY00216B 16. DeForest C.A. Anseth K.S. Cytocompatible click-based hydrogels with dynamically tunable properties through orthogonal photoconjugation and photocleavage reactions Nat. Chem. 2011 3 925 931 10.1038/nchem.1174 22109271 PMC3229165 17. Jiang Y. Chen J. Deng C. Suuronen E.J. Zhong Z. Click hydrogels, microgels and nanogels: Emerging platforms for drug delivery and tissue engineering Biomaterials 2014 35 4969 4985 10.1016/j.biomaterials.2014.03.001 24674460 18. Truong V.X. Tsang K.M. Forsythe J.S. Nonswelling click-cross-linked gelatin and PEG hydrogels with tunable properties using pluronic linkers Biomacromolecules 2017 18 757 766 10.1021/acs.biomac.6b01601 28195689 19. Dimatteo R. Darling N.J. Segura T. In situ forming injectable hydrogels for drug delivery and wound repair Adv. Drug Deliv. Rev. 2018 127 167 184 10.1016/j.addr.2018.03.007 29567395 PMC6003852 20. Li X. Xiong Y. Application of “click” chemistry in biomedical hydrogels ACS Omega 2022 7 36918 36928 10.1021/acsomega.2c03931 36312409 PMC9608400 21. Moradi M. Parvizpour F. Arabpour Z. Zargarzadeh N. Nazari M. Rashnavadi H. Sefat F. Dehghani S. Latifi M. Jafarian A. Articular cartilage injury; current status and future direction Curr. Stem Cell Res. Ther. 2024 19 653 661 10.2174/1574888X18666230418121122 37073663 22. Sawhney A.S. Pathak C.P. van Rensburg J.J. Dunn R.C. Hubbell J.A. Optimization of photopolymerized bioerodible hydrogel properties for adhesion prevention J. Biomed. Mater. Res. 1994 28 831 838 10.1002/jbm.820280710 8083251 23. Hubbell J.A. Hydrogel systems for barriers and local drug delivery in the control of wound healing J. Control. Release 1996 39 305 313 10.1016/0168-3659(95)00162-X 24. Kolb H.C. Finn M. Sharpless K.B. Click chemistry: Diverse chemical function from a few good reactions Angew. Chem. Int. Ed. 2001 40 2004 2021 10.1002/1521-3773(20010601)40:11&#x0003c;2004::AID-ANIE2004&#x0003e;3.0.CO;2-5 11433435 25. Barner-Kowollik C. Du Prez F.E. Espeel P. Hawker C.J. Junkers T. Schlaad H. Van Camp W. “Clicking” polymers or just efficient linking: What is the difference Angew. Chem. Int. Ed. 2011 50 60 62 10.1002/anie.201003707 21132684 26. Yang W. Chen J. Yan J. Liu S. Yan Y. Zhang Q. Advance of click chemistry in anion exchange membranes for energy application J. Polym. Sci. 2022 60 627 649 10.1002/pol.20210819 27. Tan W. Zhang J. Mi Y. Dong F. Li Q. Guo Z. Enhanced antifungal activity of novel cationic chitosan derivative bearing triphenylphosphonium salt via azide-alkyne click reaction Int. J. Biol. Macromol. 2020 165 1765 1772 10.1016/j.ijbiomac.2020.10.019 33031850 28. Fan J. Bao B. Wang Z. Xu R. Wang W. Yu D. High tri-stimulus response photochromic cotton fabrics based on spiropyran dye by thiol-ene click chemistry Cellulose 2020 27 493 510 10.1007/s10570-019-02786-2 29. Franco C.A. da Silva T.I. Dias M.G. Ferreira B.W. de Sousa B.L. Bousada G.M. Barreto R.W. Vaz B.G. Lima G.d.S. Dos Santos M.H. Synthesis of tyrosol 1, 2, 3-triazole derivatives and their phytotoxic activity against Euphorbia heterophylla J. Agric. Food Chem. 2022 70 2806 2816 10.1021/acs.jafc.1c06012 35225607 30. Gopinathan J. Noh I. Click chemistry-based injectable hydrogels and bioprinting inks for tissue engineering applications Tissue Eng. Regen. Med. 2018 15 531 546 10.1007/s13770-018-0152-8 30603577 PMC6171698 31. Mueller E. Poulin I. Bodnaryk W.J. Hoare T. Click chemistry hydrogels for extrusion bioprinting: Progress, challenges, and opportunities Biomacromolecules 2022 23 619 640 10.1021/acs.biomac.1c01105 34989569 32. Sletten E.M. Bertozzi C.R. Bioorthogonal chemistry: Fishing for selectivity in a sea of functionality Angew. Chem. Int. Ed. 2009 48 6974 6998 10.1002/anie.200900942 19714693 PMC2864149 33. Debets M.F. Van Berkel S.S. Schoffelen S. Rutjes F.P. Van Hest J.C. Van Delft F.L. Aza-dibenzocyclooctynes for fast and efficient enzyme PEGylation via copper-free (3 + 2) cycloaddition Chem. Commun. 2010 46 97 99 10.1039/B917797C 20024305 34. Hoyle C.E. Bowman C.N. Thiol–ene click chemistry Angew. Chem. Int. Ed. 2010 49 1540 1573 10.1002/anie.200903924 20166107 35. Fairbanks B.D. Schwartz M.P. Bowman C.N. Anseth K.S. Photoinitiated polymerization of PEG-diacrylate with lithium phenyl-2, 4, 6-trimethylbenzoylphosphinate: Polymerization rate and cytocompatibility Biomaterials 2009 30 6702 6707 10.1016/j.biomaterials.2009.08.055 19783300 PMC2896013 36. Briou B. Améduri B. Boutevin B. Trends in the Diels–Alder reaction in polymer chemistry Chem. Soc. Rev. 2021 50 11055 11097 10.1039/D0CS01382J 34605835 37. Lutolf M.P. Hubbell J. Synthetic biomaterials as instructive extracellular microenvironments for morphogenesis in tissue engineering Nat. Biotechnol. 2005 23 47 55 10.1038/nbt1055 15637621 38. Phelps E.A. Landázuri N. Thulé P.M. Taylor W.R. García A.J. Bioartificial matrices for therapeutic vascularization Proc. Natl. Acad. Sci. USA 2010 107 3323 3328 10.1073/pnas.0905447107 20080569 PMC2840448 39. Dirksen A. Hackeng T.M. Dawson P.E. Nucleophilic catalysis of oxime ligation Angew. Chem. 2006 118 7743 7746 10.1002/ange.200602877 17051631 40. Grover G.N. Lam J. Nguyen T.H. Segura T. Maynard H.D. Biocompatible hydrogels by oxime click chemistry Biomacromolecules 2012 13 3013 3017 10.1021/bm301346e 22970829 PMC3474544 41. Oliveira A.B. Guo Z. Bernardes G. Inverse electron demand Diels–Alder reactions in chemical biology Chem. Soc. Rev. 2017 46 4895 4950 10.1039/C7CS00184C 28660957 42. Blackman M.L. Royzen M. Fox J.M. Tetrazine ligation: Fast bioconjugation based on inverse-electron-demand Diels− Alder reactivity J. Am. Chem. Soc. 2008 130 13518 13519 10.1021/ja8053805 18798613 PMC2653060 43. Dong J. Krasnova L. Finn M. Sharpless K.B. Sulfur (VI) fluoride exchange (SuFEx): Another good reaction for click chemistry Angew. Chem. Int. Ed. 2014 53 9430 9448 10.1002/anie.201309399 25112519 44. Barrow A. Smedley C. Zheng Q. Li S. Dong J. Moses J. The growing applications of SuFEx click chemistry Chem. Soc. Rev. 2019 48 4731 4758 10.1039/C8CS00960K 31364998 45. Lee S.M. Jang W.-D. Polyion complex micelle formed from tetraphenylethene containing block copolymer Biomater. Res. 2017 21 17 10.1186/s40824-017-0103-9 29046822 PMC5634832 46. Yi G. Son J. Yoo J. Park C. Koo H. Application of click chemistry in nanoparticle modification and its targeted delivery Biomater. Res. 2018 22 13 10.1186/s40824-018-0123-0 29686885 PMC5899385 47. Lee S.Y. Lee Y. Le Thi P. Oh D.H. Park K.D. Sulfobetaine methacrylate hydrogel-coated anti-fouling surfaces for implantable biomedical devices Biomater. Res. 2018 22 3 10.1186/s40824-017-0113-7 29449959 PMC5808389 48. Buwalda S.J. Vermonden T. Hennink W.E. Hydrogels for therapeutic delivery: Current developments and future directions Biomacromolecules 2017 18 316 330 10.1021/acs.biomac.6b01604 28027640 49. Agard N.J. Prescher J.A. Bertozzi C.R. A strain-promoted [3 + 2] azide− alkyne cycloaddition for covalent modification of biomolecules in living systems J. Am. Chem. Soc. 2004 126 15046 15047 10.1021/ja044996f 15547999 50. Zou Y. Zhang L. Yang L. Zhu F. Ding M. Lin F. Wang Z. Li Y. “Click” chemistry in polymeric scaffolds: Bioactive materials for tissue engineering J. Control. Release 2018 273 160 179 10.1016/j.jconrel.2018.01.023 29382547 51. Macdougall L.J. Wiley K.L. Kloxin A.M. Dove A.P. Design of synthetic extracellular matrices for probing breast cancer cell growth using robust cyctocompatible nucleophilic thiol-yne addition chemistry Biomaterials 2018 178 435 447 10.1016/j.biomaterials.2018.04.046 29773227 PMC6699181 52. Macdougall L.J. Truong V.X. Dove A.P. Efficient in situ nucleophilic thiol-yne click chemistry for the synthesis of strong hydrogel materials with tunable properties ACS Macro Lett. 2017 6 93 97 10.1021/acsmacrolett.6b00857 35632898 53. Farahani P.E. Adelmund S.M. Shadish J.A. DeForest C.A. Photomediated oxime ligation as a bioorthogonal tool for spatiotemporally-controlled hydrogel formation and modification J. Mater. Chem. B 2017 5 4435 4442 10.1039/C6TB03400D 32263971 PMC8296977 54. Aleahmad F. Ebrahimi S. Salmannezhad M. Azarnia M. Jaberipour M. Hoseini M. Talaei-Khozani T. Heparin/collagen 3D scaffold accelerates hepatocyte differentiation of Wharton’s jelly-derived mesenchymal stem cells Tissue Eng. Regen. Med. 2017 14 443 452 10.1007/s13770-017-0048-z 30603500 PMC6171614 55. Jung C.S. Kim B.K. Lee J. Min B.-H. Park S.-H. Development of printable natural cartilage matrix bioink for 3D printing of irregular tissue shape Tissue Eng. Regen. Med. 2018 15 155 162 10.1007/s13770-017-0104-8 30603543 PMC6171689 56. Gopinathan J. Noh I. Recent trends in bioinks for 3D printing Biomater. Res. 2018 22 11 10.1186/s40824-018-0122-1 29636985 PMC5889544 57. Cheng S. Yang J. Song J. Cao X. Zhou B. Yang L. Li C. Wang Y. A motion-responsive injectable lubricative hydrogel for efficient Achilles tendon adhesion prevention Mater. Today Bio 2025 30 101458 10.1016/j.mtbio.2025.101458 PMC11762619 39866793 58. Ye Y. Liu Y. Ma S. Li X. Wang W. Chen X. Zheng J. Fan Z. Jiang Y. Liao Y. Multifunctional DNA hydrogels with light-triggered gas-therapy and controlled G-Exos release for infected wound healing Bioact. Mater. 2025 52 422 437 10.1016/j.bioactmat.2025.06.004 40585387 PMC12206045 59. Hein J.E. Fokin V.V. Copper-catalyzed azide–alkyne cycloaddition (CuAAC) and beyond: New reactivity of copper (I) acetylides Chem. Soc. Rev. 2010 39 1302 1315 10.1039/b904091a 20309487 PMC3073167 60. Sun Z. Liu S. Li K. Tan L. Cen L. Fu G. Well-defined and biocompatible hydrogels with toughening and reversible photoresponsive properties Soft Matter 2016 12 2192 2199 10.1039/C5SM02129D 26744299 61. Pickens C.J. Johnson S.N. Pressnall M.M. Leon M.A. Berkland C.J. Practical considerations, challenges, and limitations of bioconjugation via azide–alkyne cycloaddition Bioconjugate Chem. 2017 29 686 701 10.1021/acs.bioconjchem.7b00633 PMC6310217 29287474 62. Xu Z. Bratlie K.M. Click chemistry and material selection for in situ fabrication of hydrogels in tissue engineering applications ACS Biomater. Sci. Eng. 2018 4 2276 2291 10.1021/acsbiomaterials.8b00230 33435096 63. Tseng T.-C. Hsieh F.-Y. Theato P. Wei Y. Hsu S.-h. Glucose-sensitive self-healing hydrogel as sacrificial materials to fabricate vascularized constructs Biomaterials 2017 133 20 28 10.1016/j.biomaterials.2017.04.008 28414976 64. Guo J. Kim G.B. Shan D. Kim J.P. Hu J. Wang W. Hamad F.G. Qian G. Rizk E.B. Yang J. Click chemistry improved wet adhesion strength of mussel-inspired citrate-based antimicrobial bioadhesives Biomaterials 2017 112 275 286 10.1016/j.biomaterials.2016.10.010 27770631 PMC5121090 65. Guo J. Meng F. Jing X. Huang Y. Combination of Anti-Biofouling and Ion-Interaction by Click Chemistry for Endotoxin Selective Removal from Protein Solution Adv. Healthc. Mater. 2013 2 784 789 10.1002/adhm.201200157 23184863 66. Kennedy D.C. McKay C.S. Legault M.C. Danielson D.C. Blake J.A. Pegoraro A.F. Stolow A. Mester Z. Pezacki J.P. Cellular consequences of copper complexes used to catalyze bioorthogonal click reactions J. Am. Chem. Soc. 2011 133 17993 18001 10.1021/ja2083027 21970470 67. Baskin J.M. Prescher J.A. Laughlin S.T. Agard N.J. Chang P.V. Miller I.A. Lo A. Codelli J.A. Bertozzi C.R. Copper-free click chemistry for dynamic in vivo imaging Proc. Natl. Acad. Sci. USA 2007 104 16793 16797 10.1073/pnas.0707090104 17942682 PMC2040404 68. Han S.-S. Yoon H.Y. Yhee J.Y. Cho M.O. Shim H.-E. Jeong J.-E. Lee D.-E. Kim K. Guim H. Lee J.H. In situ cross-linkable hyaluronic acid hydrogels using copper free click chemistry for cartilage tissue engineering Polym. Chem. 2018 9 20 27 10.1039/C7PY01654A 69. Fan M. Ma Y. Mao J. Zhang Z. Tan H. Cytocompatible in situ forming chitosan/hyaluronan hydrogels via a metal-free click chemistry for soft tissue engineering Acta Biomater. 2015 20 60 68 10.1016/j.actbio.2015.03.033 25839124 70. Chen F. Le P. Fernandes-Cunha G.M. Heilshorn S.C. Myung D. Bio-orthogonally crosslinked hyaluronate-collagen hydrogel for suture-free corneal defect repair Biomaterials 2020 255 120176 10.1016/j.biomaterials.2020.120176 32559566 PMC7396293 71. Liu X. Camilleri E.T. Li L. Gaihre B. Rezaei A. Park S. Miller II A.L. Tilton M. Waletzki B.E. Terzic A. Injectable catalyst-free “click” organic-inorganic nanohybrid (click-ON) cement for minimally invasive in vivo bone repair Biomaterials 2021 276 121014 10.1016/j.biomaterials.2021.121014 34280821 PMC8916681 72. Zhou P. Brown L. Madl C.M. Bioorthogonal Engineering of Cellular Microenvironments Using Isonitrile Ligations Adv. Funct. Mater. 2025 2422047 10.1002/adfm.202422047 40837579 PMC12360401 73. Chang S.-Y. McAnena A.P. Kim J. Song J. Tuning Hyaluronic Acid Microstructures by Engineered Amphiphilicity: From Dynamically Cross-Linked Gels to Multilayered Nanoparticles ACS Appl. Mater. Interfaces 2025 17 31909 31922 10.1021/acsami.5c04736 40415248 PMC12140878 74. Jain E. Neal S. Graf H. Tan X. Balasubramaniam R. Huebsch N. Copper-free azide–alkyne cycloaddition for peptide modification of alginate hydrogels ACS Appl. Bio Mater. 2021 4 1229 1237 10.1021/acsabm.0c00976 35014476 75. Neves M.I. Magalhães M.V. Bidarra S.J. Moroni L. Barrias C.C. Versatile click alginate hydrogels with protease-sensitive domains as cell responsive/instructive 3D microenvironments Carbohydr. Polym. 2023 320 121226 10.1016/j.carbpol.2023.121226 37659815 76. Degirmenci A. Sanyal R. Sanyal A. Metal-free click-chemistry: A powerful tool for fabricating hydrogels for biomedical applications Bioconjugate Chem. 2024 35 433 452 10.1021/acs.bioconjchem.4c00003 PMC11036366 38516745 77. Luu T. Gristwood K. Knight J.C. Jorg M. Click chemistry: Reaction rates and their suitability for biomedical applications Bioconjugate Chem. 2024 35 715 731 10.1021/acs.bioconjchem.4c00084 PMC11191409 38775705 78. Neves M.I. Bidarra S.J. Magalhães M.V. Torres A.L. Moroni L. Barrias C.C. Microstructured click hydrogels for cell contact guidance in 3D Mater. Today Bio 2023 19 100604 10.1016/j.mtbio.2023.100604 36969695 PMC10034521 79. Testore D. Zoso A. Paoletti C. Groppo S. Marcello E. Chiono V. Bio-orthogonally double cross-linked alginate-gelatin hydrogels with tunable viscoelasticity for cardiac tissue engineering Mater. Today Bio 2025 34 102121 10.1016/j.mtbio.2025.102121 40791796 PMC12336692 80. Rydholm A.E. Bowman C.N. Anseth K.S. Degradable thiol-acrylate photopolymers: Polymerization and degradation behavior of an in situ forming biomaterial Biomaterials 2005 26 4495 4506 10.1016/j.biomaterials.2004.11.046 15722118 81. Xi W. Scott T.F. Kloxin C.J. Bowman C.N. Click chemistry in materials science Adv. Funct. Mater. 2014 24 2572 2590 10.1002/adfm.201302847 82. Pereira R.F. Barrias C.C. Bártolo P.J. Granja P.L. Cell-instructive pectin hydrogels crosslinked via thiol-norbornene photo-click chemistry for skin tissue engineering Acta Biomater. 2018 66 282 293 10.1016/j.actbio.2017.11.016 29128530 83. Brown T.E. Carberry B.J. Worrell B.T. Dudaryeva O.Y. McBride M.K. Bowman C.N. Anseth K.S. Photopolymerized dynamic hydrogels with tunable viscoelastic properties through thioester exchange Biomaterials 2018 178 496 503 10.1016/j.biomaterials.2018.03.060 29653871 PMC6054801 84. Lin C.-C. Raza A. Shih H. PEG hydrogels formed by thiol-ene photo-click chemistry and their effect on the formation and recovery of insulin-secreting cell spheroids Biomaterials 2011 32 9685 9695 10.1016/j.biomaterials.2011.08.083 21924490 PMC3195847 85. Colak B. Di Cio S. Gautrot J.E. Biofunctionalized patterned polymer brushes via thiol–ene coupling for the control of cell adhesion and the formation of cell arrays Biomacromolecules 2018 19 1445 1455 10.1021/acs.biomac.7b01436 29294284 86. Sharma S. Floren M. Ding Y. Stenmark K.R. Tan W. Bryant S.J. A photoclickable peptide microarray platform for facile and rapid screening of 3-D tissue microenvironments Biomaterials 2017 143 17 28 10.1016/j.biomaterials.2017.07.025 28756193 87. Liang J. Zhang X. Chen Z. Li S. Yan C. Thiol–Ene click reaction initiated rapid gelation of PEGDA/silk fibroin hydrogels Polymers 2019 11 2102 10.3390/polym11122102 31847404 PMC6960922 88. Lueckgen A. Garske D.S. Ellinghaus A. Mooney D.J. Duda G.N. Cipitria A. Enzymatically-degradable alginate hydrogels promote cell spreading and in vivo tissue infiltration Biomaterials 2019 217 119294 10.1016/j.biomaterials.2019.119294 31276949 89. Zhang Y. Liu S. Li T. Zhang L. Azhar U. Ma J. Zhai C. Zong C. Zhang S. Cytocompatible and non-fouling zwitterionic hyaluronic acid-based hydrogels using thiol-ene “click” chemistry for cell encapsulation Carbohydr. Polym. 2020 236 116021 10.1016/j.carbpol.2020.116021 32172841 90. Ding H. Li B. Liu Z. Liu G. Pu S. Feng Y. Jia D. Zhou Y. Decoupled pH-and thermo-responsive injectable chitosan/PNIPAM hydrogel via thiol-ene click chemistry for potential applications in tissue engineering Adv. Healthc. Mater. 2020 9 2000454 10.1002/adhm.202000454 32548983 91. Zhou Y. Zhao S. Zhang C. Liang K. Li J. Yang H. Gu S. Bai Z. Ye D. Xu W. Photopolymerized maleilated chitosan/thiol-terminated poly (vinyl alcohol) hydrogels as potential tissue engineering scaffolds Carbohydr. Polym. 2018 184 383 389 10.1016/j.carbpol.2018.01.009 29352933 92. Nagahama K. Kimura Y. Takemoto A. Living functional hydrogels generated by bioorthogonal cross-linking reactions of azide-modified cells with alkyne-modified polymers Nat. Commun. 2018 9 2195 10.1038/s41467-018-04699-3 29875358 PMC5989231 93. Ding Y. Xu X. Sharma S. Floren M. Stenmark K. Bryant S.J. Neu C.P. Tan W. Biomimetic soft fibrous hydrogels for contractile and pharmacologically responsive smooth muscle Acta Biomater. 2018 74 121 130 10.1016/j.actbio.2018.05.015 29753912 PMC6004336 94. Troncoso-Afonso L. Henríquez-Banegas Y.M. Vinnacombe-Willson G.A. Gutierrez J. Gallastegui G. Liz-Marzán L.M. García-Astrain C. Using thiol–ene click chemistry to engineer 3D printed plasmonic hydrogel scaffolds for SERS biosensing Biomater. Sci. 2025 13 2936 2950 10.1039/D4BM01529K 40237173 PMC12001321 95. Bailey S.J. Eckman N. Brunel E.S. Jons C.K. Sen S. Appel E.A. A thiol–ene click-based strategy to customize injectable polymer–nanoparticle hydrogel properties for therapeutic delivery Biomater. Sci. 2025 13 1323 1334 10.1039/D4BM01315H 39898598 PMC11789556 96. Atmani Z. Steindorfer T. Kargl R. Kleinschek K.S. Heinze T. Gericke M. Allyl-Functionalized Polysaccharides for 3D Printable Hydrogels Through Thiol–Ene Click Chemistry Polysaccharides 2025 6 13 10.3390/polysaccharides6010013 97. Bakaic E. Smeets N.M. Hoare T. Injectable hydrogels based on poly (ethylene glycol) and derivatives as functional biomaterials RSC Adv. 2015 5 35469 35486 10.1039/C4RA13581D 98. Hu B.-H. Su J. Messersmith P.B. Hydrogels cross-linked by native chemical ligation Biomacromolecules 2009 10 2194 2200 10.1021/bm900366e 19601644 PMC2790863 99. Gyarmati B. Némethy Á. Szilágyi A. Reversible disulphide formation in polymer networks: A versatile functional group from synthesis to applications Eur. Polym. J. 2013 49 1268 1286 10.1016/j.eurpolymj.2013.03.001 100. Zhang B.Y. He W.D. Li L.Y. Sun X.L. Li W.T. Zhang K.R. Reducibly degradable hydrogels of PNIPAM and PDMAEMA: Synthesis, stimulus-response and drug release J. Polym. Sci. Part A Polym. Chem. 2010 48 3604 3612 10.1002/pola.24141 101. Meng F. Hennink W.E. Zhong Z. Reduction-sensitive polymers and bioconjugates for biomedical applications Biomaterials 2009 30 2180 2198 10.1016/j.biomaterials.2009.01.026 19200596 102. Beaupre D.M. Weiss R.G. Thiol-and disulfide-based stimulus-responsive soft materials and self-assembling systems Molecules 2021 26 3332 10.3390/molecules26113332 34206043 PMC8199128 103. Ye X. Yuan J. Jiang Z. Wang S. Wang P. Wang Q. Cui L. Thiol-ene photoclick reaction: An eco-friendly and facile approach for preparation of MPEG-g-keratin biomaterial Eng. Life Sci. 2020 20 17 25 10.1002/elsc.201900105 32625043 PMC6999080 104. Wojda S.J. Marozas I.A. Anseth K.S. Yaszemski M.J. Donahue S.W. Thiol-ene Hydrogels for Local Delivery of PTH for Bone Regeneration in Critical Size defects J. Orthop. Res. 2020 38 536 544 10.1002/jor.24502 31709588 105. Kudaibergen G. Akhmetkarimova Z. Yildirim E. Baidarbekov M. Thiol-ene clickable gelatin–hyaluronic acid cryogels J. Mater. Sci. 2023 58 10821 10831 10.1007/s10853-023-08693-z 106. Choh S.-Y. Cross D. Wang C. Facile synthesis and characterization of disulfide-cross-linked hyaluronic acid hydrogels for protein delivery and cell encapsulation Biomacromolecules 2011 12 1126 1136 10.1021/bm101451k 21384907 107. Huang Z. Delparastan P. Burch P. Cheng J. Cao Y. Messersmith P.B. Injectable dynamic covalent hydrogels of boronic acid polymers cross-linked by bioactive plant-derived polyphenols Biomater. Sci. 2018 6 2487 2495 10.1039/C8BM00453F 30069570 PMC6107875 108. Marco-Dufort B. Tibbitt M.W. Design of moldable hydrogels for biomedical applications using dynamic covalent boronic esters Mater. Today Chem. 2019 12 16 33 10.1016/j.mtchem.2018.12.001 109. Amaral A.J. Gaspar V.M. Mano J.F. Responsive laminarin-boronic acid self-healing hydrogels for biomedical applications Polym. J. 2020 52 997 1006 10.1038/s41428-020-0348-3 110. Cho S. Hwang S.Y. Oh D.X. Park J. Recent progress in self-healing polymers and hydrogels based on reversible dynamic B–O bonds: Boronic/boronate esters, borax, and benzoxaborole J. Mater. Chem. A 2021 9 14630 14655 10.1039/D1TA02308J 111. Wu D. Wang W. Diaz-Dussan D. Peng Y.-Y. Chen Y. Narain R. Hall D.G. In situ forming, dual-crosslink network, self-healing hydrogel enabled by a bioorthogonal nopoldiol–benzoxaborolate click reaction with a wide pH range Chem. Mater. 2019 31 4092 4102 10.1021/acs.chemmater.9b00769 112. Liu Y. Liu Y. Wang Q. Han Y. Chen H. Tan Y. Doubly dynamic hydrogel formed by combining boronate ester and acylhydrazone bonds Polymers 2020 12 487 10.3390/polym12020487 32098242 PMC7077654 113. Jung J.M. Kim S.H. Phan V.G. Thambi T. Lee D.S. Therapeutic effects of boronate ester cross-linked injectable hydrogels for the treatment of hepatocellular carcinoma Biomater. Sci. 2021 9 7275 7286 10.1039/D1BM00881A 34609388 114. Wang T. Ma L. Zhang H. Cui L. Bai X. Kong L. Yang S. Wang J. Preparation and Properties of Direct Ink Writing 3D Printing Hydrogel Ink Based on Dynamic Boronic Ester Bond J. Appl. Polym. Sci. 2025 e57632 10.1002/app.57632 115. Miki R. Yamaki T. Uchida M. Natsume H. Phenylboronate-salicylate ester cross-linked self-healing hydrogel composed of modified hyaluronan at physiological pH Soft Matter 2024 20 2926 2936 10.1039/D3SM01417G 38466036 116. Miki R. Yamaki T. Uchida M. Natsume H. pH-responsive in situ gelation via phenylboronate-glucamine ester-crosslinking in modified hyaluronan at physiological pH Colloid Polym. Sci. 2025 1 11 10.1007/s00396-025-05463-y 117. An H. Bo Y. Chen D. Wang Y. Wang H. He Y. Qin J. Cellulose-based self-healing hydrogel through boronic ester bonds with excellent biocompatibility and conductivity RSC Adv. 2020 10 11300 11310 10.1039/C9RA10736C 35495323 PMC9050428 118. Banach Ł. Williams G.T. Fossey J.S. Insulin delivery using dynamic covalent boronic acid/ester-controlled release Adv. Ther. 2021 4 2100118 10.1002/adtp.202100118 119. Unger K. Coclite A.M. Glucose-responsive boronic acid hydrogel thin films obtained via initiated chemical vapor deposition Biomacromolecules 2022 23 4289 4295 10.1021/acs.biomac.2c00762 36053563 PMC9554909 120. Liu Y. Yuan Z. Liu S. Zhong X. Wang Y. Xie R. Song W. Ren L. Bioactive Phenylboronic Acid-Functionalized Hyaluronic Acid Hydrogels Induce Chondro-Aggregates and Promote Chondrocyte Phenotype Macromol. Biosci. 2023 23 2300153 10.1002/mabi.202300153 37400079 121. Zhang X. Nan K. Zhang Y. Song K. Geng Z. Shang D. Guan X. Fan L. A novel injectable hydrogel prepared from phenylboronic acid modified gelatin and oxidized-dextran for bone tissue engineering Int. J. Biol. Macromol. 2024 261 129666 10.1016/j.ijbiomac.2024.129666 38272405 122. Liu F. Li G. An Z. Wang S. Xu S. Liu H. Dynamic Boronate Ester Based Hydrogel with Enhanced Mechanical Properties and Multi-Stimuli-Triggered Release for Tissue Repair and Antioxidant Therapy Gels 2025 11 370 10.3390/gels11050370 40422389 PMC12111388 123. Terriac L. Helesbeux J.-J. Maugars Y. Guicheux J. Tibbitt M.W. Delplace V. Boronate ester hydrogels for biomedical applications: Challenges and opportunities Chem. Mater. 2024 36 6674 6695 10.1021/acs.chemmater.4c00507 39070669 PMC11270748 124. Yigit S. Sanyal R. Sanyal A. Fabrication and functionalization of hydrogels through “click” chemistry Chem.–Asian J. 2011 6 2648 2659 10.1002/asia.201100440 21954074 125. Yu F. Cao X. Du J. Wang G. Chen X. Multifunctional hydrogel with good structure integrity, self-healing, and tissue-adhesive property formed by combining Diels–Alder click reaction and acylhydrazone bond ACS Appl. Mater. Interfaces 2015 7 24023 24031 10.1021/acsami.5b06896 26466997 126. Nimmo C.M. Owen S.C. Shoichet M.S. Diels− Alder click cross-linked hyaluronic acid hydrogels for tissue engineering Biomacromolecules 2011 12 824 830 10.1021/bm101446k 21314111 127. Morozova S.M. Recent advances in hydrogels via Diels–Alder crosslinking: Design and applications Gels 2023 9 102 10.3390/gels9020102 36826272 PMC9956184 128. Koehler K.C. Alge D.L. Anseth K.S. Bowman C.N. A Diels–Alder modulated approach to control and sustain the release of dexamethasone and induce osteogenic differentiation of human mesenchymal stem cells Biomaterials 2013 34 4150 4158 10.1016/j.biomaterials.2013.02.020 23465826 PMC3604741 129. Smith L.J. Taimoory S.M. Tam R.Y. Baker A.E. Binth Mohammad N. Trant J.F. Shoichet M.S. Diels–Alder click-cross-linked hydrogels with increased reactivity enable 3D cell encapsulation Biomacromolecules 2018 19 926 935 10.1021/acs.biomac.7b01715 29443512 130. Owen S.C. Fisher S.A. Tam R.Y. Nimmo C.M. Shoichet M.S. Hyaluronic acid click hydrogels emulate the extracellular matrix Langmuir 2013 29 7393 7400 10.1021/la305000w 23343008 131. Bai X. Lü S. Cao Z. Gao C. Duan H. Xu X. Sun L. Gao N. Feng C. Liu M. Self-reinforcing injectable hydrogel with both high water content and mechanical strength for bone repair Chem. Eng. J. 2016 288 546 556 10.1016/j.cej.2015.12.021 132. Fan M. Ma Y. Zhang Z. Mao J. Tan H. Hu X. Biodegradable hyaluronic acid hydrogels to control release of dexamethasone through aqueous Diels–Alder chemistry for adipose tissue engineering Mater. Sci. Eng. C 2015 56 311 317 10.1016/j.msec.2015.04.004 26249595 133. Madl C.M. Heilshorn S.C. Rapid diels–alder cross-linking of cell encapsulating hydrogels Chem. Mater. 2019 31 8035 8043 10.1021/acs.chemmater.9b02485 32410775 PMC7224313 134. Lü S. Bai X. Liu H. Ning P. Wang Z. Gao C. Ni B. Liu M. An injectable and self-healing hydrogel with covalent cross-linking in vivo for cranial bone repair J. Mater. Chem. B 2017 5 3739 3748 10.1039/C7TB00776K 32264062 135. Li S. Wang L. Yu X. Wang C. Wang Z. Synthesis and characterization of a novel double cross-linked hydrogel based on Diels-Alder click reaction and coordination bonding Mater. Sci. Eng. C 2018 82 299 309 10.1016/j.msec.2017.08.031 29025662 136. Abandansari H.S. Ghanian M.H. Varzideh F. Mahmoudi E. Rajabi S. Taheri P. Nabid M.R. Baharvand H. In situ formation of interpenetrating polymer network using sequential thermal and click crosslinking for enhanced retention of transplanted cells Biomaterials 2018 170 12 25 10.1016/j.biomaterials.2018.04.007 29635108 137. Bai X. Lü S. Liu H. Cao Z. Ning P. Wang Z. Gao C. Ni B. Ma D. Liu M. Polysaccharides based injectable hydrogel compositing bio-glass for cranial bone repair Carbohydr. Polym. 2017 175 557 564 10.1016/j.carbpol.2017.08.020 28917901 138. Madl C.M. Heilshorn S.C. Bioorthogonal strategies for engineering extracellular matrices Adv. Funct. Mater. 2018 28 1706046 10.1002/adfm.201706046 31558890 PMC6761700 139. Haiber L.M. Kufleitner M. Wittmann V. Application of the inverse-electron-demand Diels-Alder reaction for metabolic glycoengineering Front. Chem. 2021 9 654932 10.3389/fchem.2021.654932 33928067 PMC8076787 140. Pagel M. Inverse electron demand Diels–Alder (IEDDA) reactions in peptide chemistry J. Pept. Sci. 2019 25 e3141 10.1002/psc.3141 30585397 141. Handula M. Chen K.-T. Seimbille Y. IEDDA: An attractive bioorthogonal reaction for biomedical applications Molecules 2021 26 4640 10.3390/molecules26154640 34361793 PMC8347371 142. Kalia J. Raines R.T. Hydrolytic stability of hydrazones and oximes Angew. Chem. Int. Ed. 2008 47 7523 7526 10.1002/anie.200802651 PMC2743602 18712739 143. Christman K.L. Broyer R.M. Schopf E. Kolodziej C.M. Chen Y. Maynard H.D. Protein nanopatterns by oxime bond formation Langmuir 2011 27 1415 1418 10.1021/la103978x 21192671 PMC3050016 144. He W. Wang Y. Li X. Ji Y. Yuan J. Yang W. Yan S. Yan J. Sealing the Pandora’s vase of pancreatic fistula through entrapping the digestive enzymes within a dextrorotary (D)-peptide hydrogel Nat. Commun. 2024 15 7235 10.1038/s41467-024-51734-7 39174548 PMC11341566 145. Qi H. Jing X. Hu Y. Wu P. Zhang X. Li Y. Zhao H. Ma Q. Dong X. Mahadevan C. Electrospun green fluorescent-highly anisotropic conductive Janus-type nanoribbon hydrogel array film for multiple stimulus response sensors Compos. Part B Eng. 2025 288 111933 10.1016/j.compositesb.2024.111933 146. Baskin J.M. Dehnert K.W. Laughlin S.T. Amacher S.L. Bertozzi C.R. Visualizing enveloping layer glycans during zebrafish early embryogenesis Proc. Natl. Acad. Sci. USA 2010 107 10360 10365 10.1073/pnas.0912081107 20489181 PMC2890823 147. Baker A.E. Cui H. Ballios B.G. Ing S. Yan P. Wolfer J. Wright T. Dang M. Gan N.Y. Cooke M.J. Stable oxime-crosslinked hyaluronan-based hydrogel as a biomimetic vitreous substitute Biomaterials 2021 271 120750 10.1016/j.biomaterials.2021.120750 33725584 148. Sánchez-Morán H. Ahmadi A. Vogler B. Roh K.-H. Oxime cross-linked alginate hydrogels with tunable stress relaxation Biomacromolecules 2019 20 4419 4429 10.1021/acs.biomac.9b01100 31638775 149. Boehnke N. Cam C. Bat E. Segura T. Maynard H.D. Imine hydrogels with tunable degradability for tissue engineering Biomacromolecules 2015 16 2101 2108 10.1021/acs.biomac.5b00519 26061010 PMC4583069 150. Hardy J.G. Lin P. Schmidt C.E. Biodegradable hydrogels composed of oxime crosslinked poly (ethylene glycol), hyaluronic acid and collagen: A tunable platform for soft tissue engineering J. Biomater. Sci. Polym. Ed. 2015 26 143 161 10.1080/09205063.2014.975393 25555089 151. Hentzen N.B. Smeenk L.E. Witek J. Riniker S. Wennemers H. Cross-linked collagen triple helices by oxime ligation J. Am. Chem. Soc. 2017 139 12815 12820 10.1021/jacs.7b07498 28872857 152. Tamura T. Song Z. Amaike K. Lee S. Yin S. Kiyonaka S. Hamachi I. Affinity-guided oxime chemistry for selective protein acylation in live tissue systems J. Am. Chem. Soc. 2017 139 14181 14191 10.1021/jacs.7b07339 28915034 153. Fujita M. Policastro G.M. Burdick A. Lam H.T. Ungerleider J.L. Braden R.L. Huang D. Osborn K.G. Omens J.H. Madani M.M. Preventing post-surgical cardiac adhesions with a catechol-functionalized oxime hydrogel Nat. Commun. 2021 12 3764 10.1038/s41467-021-24104-w 34145265 PMC8213776 154. Borelli A.N. Young M.W. Kirkpatrick B.E. Jaeschke M.W. Mellett S. Porter S. Blatchley M.R. Rao V.V. Sridhar B.V. Anseth K.S. Stress relaxation and composition of hydrazone-crosslinked hybrid biopolymer-synthetic hydrogels determine spreading and secretory properties of MSCs Adv. Healthc. Mater. 2022 11 2200393 10.1002/adhm.202200393 PMC9308669 35575970 155. Zhang M. Chen X. Yang K. Dong Q. Yang H. Gu S. Xu W. Zhou Y. Dual-crosslinked hyaluronic acid hydrogel with self-healing capacity and enhanced mechanical properties Carbohydr. Polym. 2023 301 120372 10.1016/j.carbpol.2022.120372 36446503 156. Wang S. Nawale G.N. Oommen O.P. Hilborn J. Varghese O.P. Influence of ions to modulate hydrazone and oxime reaction kinetics to obtain dynamically cross-linked hyaluronic acid hydrogels Polym. Chem. 2019 10 4322 4327 10.1039/C9PY00862D 157. Mather B.D. Viswanathan K. Miller K.M. Long T.E. Michael addition reactions in macromolecular design for emerging technologies Prog. Polym. Sci. 2006 31 487 531 10.1016/j.progpolymsci.2006.03.001 158. Hoyle C.E. Lowe A.B. Bowman C.N. Thiol-click chemistry: A multifaceted toolbox for small molecule and polymer synthesis Chem. Soc. Rev. 2010 39 1355 1387 10.1039/b901979k 20309491 159. Elbert D.L. Pratt A.B. Lutolf M.P. Halstenberg S. Hubbell J.A. Protein delivery from materials formed by self-selective conjugate addition reactions J. Control. Release 2001 76 11 25 10.1016/S0168-3659(01)00398-4 11532309 160. Kim M.S. Choi Y.J. Noh I. Tae G. Synthesis and characterization of in situ chitosan-based hydrogel via grafting of carboxyethyl acrylate J. Biomed. Mater. Res. Part A Off. J. Soc. Biomater. Jpn. Soc. Biomater. Aust. Soc. Biomater. Korean Soc. Biomater. 2007 83 674 682 10.1002/jbm.a.31278 17530630 161. Young J.L. Engler A.J. Hydrogels with time-dependent material properties enhance cardiomyocyte differentiation in vitro Biomaterials 2011 32 1002 1009 10.1016/j.biomaterials.2010.10.020 21071078 PMC3000555 162. Pupkaite J. Rosenquist J. Hilborn J. Samanta A. Injectable shape-holding collagen hydrogel for cell encapsulation and delivery cross-linked using thiol-michael addition click reaction Biomacromolecules 2019 20 3475 3484 10.1021/acs.biomac.9b00769 31408340 163. Tortora M. Cavalieri F. Chiessi E. Paradossi G. Michael-type addition reactions for the in situ formation of poly (vinyl alcohol)-based hydrogels Biomacromolecules 2007 8 209 214 10.1021/bm0607269 17206809 164. Chatani S. Nair D.P. Bowman C.N. Relative reactivity and selectivity of vinyl sulfones and acrylates towards the thiol–Michael addition reaction and polymerization Polym. Chem. 2013 4 1048 1055 10.1039/C2PY20826A 165. Jin R. Teixeira L.M. Krouwels A. Dijkstra P.J. Van Blitterswijk C. Karperien M. Feijen J. Synthesis and characterization of hyaluronic acid–poly (ethylene glycol) hydrogels via Michael addition: An injectable biomaterial for cartilage repair Acta Biomater. 2010 6 1968 1977 10.1016/j.actbio.2009.12.024 20025999 166. Baldwin A.D. Kiick K.L. Reversible maleimide–thiol adducts yield glutathione-sensitive poly (ethylene glycol)–heparin hydrogels Polym. Chem. 2013 4 133 143 10.1039/C2PY20576A 23766781 PMC3677572 167. Bang S. Jung U.-W. Noh I. Synthesis and biocompatibility characterizations of in situ chondroitin sulfate–gelatin hydrogel for tissue engineering Tissue Eng. Regen. Med. 2018 15 25 35 10.1007/s13770-017-0089-3 30603532 PMC6171642 168. Liu Z.Q. Wei Z. Zhu X.L. Huang G.Y. Xu F. Yang J.H. Osada Y. Zrínyi M. Li J.H. Chen Y.M. Dextran-based hydrogel formed by thiol-Michael addition reaction for 3D cell encapsulation Colloids Surf. B Biointerfaces 2015 128 140 148 10.1016/j.colsurfb.2015.02.005 25744162 169. Bulpitt P. Aeschlimann D. New strategy for chemical modification of hyaluronic acid: Preparation of functionalized derivatives and their use in the formation of novel biocompatible hydrogels J. Biomed. Mater. Res. 1999 47 152 169 10.1002/(SICI)1097-4636(199911)47:2&#x0003c;152::AID-JBM5&#x0003e;3.0.CO;2-I 10449626 170. Tian W. Zhang C. Hou S. Yu X. Cui F. Xu Q. Sheng S. Cui H. Li H. Hyaluronic acid hydrogel as Nogo-66 receptor antibody delivery system for the repairing of injured rat brain: In vitro J. Control. Release 2005 102 13 22 10.1016/j.jconrel.2004.09.025 15653130 171. Dahlmann J. Krause A. Möller L. Kensah G. Möwes M. Diekmann A. Martin U. Kirschning A. Gruh I. Dräger G. Fully defined in situ cross-linkable alginate and hyaluronic acid hydrogels for myocardial tissue engineering Biomaterials 2013 34 940 951 10.1016/j.biomaterials.2012.10.008 23141898 172. Chang J. Tao Y. Wang B. Guo B.-h. Xu H. Jiang Y.-r. Huang Y. An in situ-forming zwitterionic hydrogel as vitreous substitute J. Mater. Chem. B 2015 3 1097 1105 10.1039/C4TB01775G 32261988 173. Martínez-Sanz E. Ossipov D.A. Hilborn J. Larsson S. Jonsson K.B. Varghese O.P. Bone reservoir: Injectable hyaluronic acid hydrogel for minimal invasive bone augmentation J. Control. Release 2011 152 232 240 10.1016/j.jconrel.2011.02.003 21315118 174. Karvinen J. Joki T. Ylä-Outinen L. Koivisto J.T. Narkilahti S. Kellomäki M. Soft hydrazone crosslinked hyaluronan-and alginate-based hydrogels as 3D supportive matrices for human pluripotent stem cell-derived neuronal cells React. Funct. Polym. 2018 124 29 39 10.1016/j.reactfunctpolym.2017.12.019 175. Zhu D. Wang H. Trinh P. Heilshorn S.C. Yang F. Elastin-like protein-hyaluronic acid (ELP-HA) hydrogels with decoupled mechanical and biochemical cues for cartilage regeneration Biomaterials 2017 127 132 140 10.1016/j.biomaterials.2017.02.010 28268018 PMC5772736 176. Wang L.L. Highley C.B. Yeh Y.C. Galarraga J.H. Uman S. Burdick J.A. Three-dimensional extrusion bioprinting of single-and double-network hydrogels containing dynamic covalent crosslinks J. Biomed. Mater. Res. Part A 2018 106 865 875 10.1002/jbm.a.36323 29314616 PMC5826872 177. Huang J. Jiang X. Injectable and degradable pH-responsive hydrogels via spontaneous amino–yne click reaction ACS Appl. Mater. Interfaces 2018 10 361 370 10.1021/acsami.7b18141 29235844 178. Schwarz S. Kuth S. Distler T. Gögele C. Stölzel K. Detsch R. Boccaccini A.R. Schulze-Tanzil G. 3D printing and characterization of human nasoseptal chondrocytes laden dual crosslinked oxidized alginate-gelatin hydrogels for cartilage repair approaches Mater. Sci. Eng. C 2020 116 111189 10.1016/j.msec.2020.111189 32806255 179. Distler T. Polley C. Shi F. Schneidereit D. Ashton M.D. Friedrich O. Kolb J.F. Hardy J.G. Detsch R. Seitz H. Electrically conductive and 3D-printable oxidized alginate-gelatin polypyrrole: PSS hydrogels for tissue engineering Adv. Healthc. Mater. 2021 10 2001876 10.1002/adhm.202001876 33711199 PMC11469227 180. Chen H. Liao R. Du Q. Li C. Xiao X. Shan Y. Injectable hyaluronic acid/oxidized chitosan hydrogels with hypochlorous acid released for instant disinfection and antibacterial effects Front. Mater. 2022 9 935096 10.3389/fmats.2022.935096 181. Wei Z. Yang J.H. Liu Z.Q. Xu F. Zhou J.X. Zrínyi M. Osada Y. Chen Y.M. Novel biocompatible polysaccharide-based self-healing hydrogel Adv. Funct. Mater. 2015 25 1352 1359 10.1002/adfm.201401502 182. Yan S. Wang W. Li X. Ren J. Yun W. Zhang K. Li G. Yin J. Preparation of mussel-inspired injectable hydrogels based on dual-functionalized alginate with improved adhesive, self-healing, and mechanical properties J. Mater. Chem. B 2018 6 6377 6390 10.1039/C8TB01928B 32254646 183. Kisiel M. Martino M.M. Ventura M. Hubbell J.A. Hilborn J. Ossipov D.A. Improving the osteogenic potential of BMP-2 with hyaluronic acid hydrogel modified with integrin-specific fibronectin fragment Biomaterials 2013 34 704 712 10.1016/j.biomaterials.2012.10.015 23103154 184. Chand R. Janarthanan G. Elkhoury K. Vijayavenkataraman S. Digital light processing 3D bioprinting of biomimetic corneal stroma equivalent using gelatin methacryloyl and oxidized carboxymethylcellulose interpenetrating network hydrogel Biofabrication 2025 17 025011 10.1088/1758-5090/adab27 39819884 185. Ma W. Yang M. Wu C. Wang S. Du M. Bioinspired self-healing injectable nanocomposite hydrogels based on oxidized dextran and gelatin for growth-factor-free bone regeneration Int. J. Biol. Macromol. 2023 251 126145 10.1016/j.ijbiomac.2023.126145 37544566 186. Sajjadi M. Jamali R. Kiyani T. Mohamadnia Z. Moradi A.-R. Characterization of Schiff base self-healing hydrogels by dynamic speckle pattern analysis Sci. Rep. 2024 14 27950 10.1038/s41598-024-79499-5 39543160 PMC11564514 187. He Q. Ding X. Deng J. Zhang Y. Wang X. Zhan D. Okoro O.V. Yan L. Shavandi A. Nie L. Fabrication of injectable, adhesive, self-healing, superabsorbent hydrogels based on quaternary ammonium chitosan and oxidized pullulan Heliyon 2024 10 e38577 10.1016/j.heliyon.2024.e38577 39435091 PMC11491910 188. Nascimento S.d.P.D. de Souza R.R.M. Sobral M.V. Xavier-Junior F.H. da Silva M.V.S. Viana M.M. da Silva F.F. Serpe M.J. de Souza A.L. Gelatin-Oxidized Alginate and Chitosan-Coated Zein Nanoparticle Hydrogel Composite to Enhance Breast Cancer Cytotoxicity in Dual-Drug Delivery ACS Omega 2024 9 45190 45202 10.1021/acsomega.4c06404 39554428 PMC11561619 189. Afewerki S. Bassous N. Harb S.V. Corat M.A.F. Maharjan S. Ruiz-Esparza G.U. de Paula M.M. Webster T.J. Tim C.R. Viana B.C. Engineering multifunctional bactericidal nanofibers for abdominal hernia repair Commun. Biol. 2021 4 233 10.1038/s42003-021-01758-2 33608611 PMC7896057 190. de Sousa Araújo E. Stocco T.D. de Sousa G.F. Afewerki S. Marciano F.R. Corat M.A.F. de Paula M.M.M. Verde T.F.C.L. Silva M.C.M. Lobo A.O. Oxygen-generating microparticles in chondrocytes-laden hydrogels by facile and versatile click chemistry strategy Colloids Surf. B Biointerfaces 2021 205 111850 10.1016/j.colsurfb.2021.111850 34015729 191. Jeon J.H. Cheon S.Y. Park S.H. Lee H. Yoo S.-Y. Ahn M.Y. Lee D. Kim M.S. Park J.H. Hollister S.J. Lacuna-mimic human-derived nasal septal chondrocyte clusters encapsulated in click chemistry-based hydrogel for in vivo cartilage regeneration Chem. Eng. J. 2025 165965 10.1016/j.cej.2025.165965 192. Liu X. Gaihre B. Li L. Rezaei A. Tilton M. Elder B.D. Lu L. Bioorthogonal “click chemistry” bone cement with bioinspired natural mimicking microstructures for bone repair ACS Biomater. Sci. Eng. 2023 9 1585 1597 10.1021/acsbiomaterials.2c01482 36854041 PMC10123962 193. Arickx U. Fabrication of Highly Robust Thiol-Ene Click Chemistry-Based Hydrogel Scaffold for 3D DLP Printing Master’s Thesis Maastricht University Maastricht, The Netherlands 2023 194. Qu J. Zhao X. Liang Y. Xu Y. Ma P.X. Guo B. Degradable conductive injectable hydrogels as novel antibacterial, anti-oxidant wound dressings for wound healing Chem. Eng. J. 2019 362 548 560 10.1016/j.cej.2019.01.028 195. Liu C. Wu J. Gan D. Li Z. Shen J. Tang P. Luo S. Li P. Lu X. Zheng W. The characteristics of mussel-inspired nHA/OSA injectable hydrogel and repaired bone defect in rabbit J. Biomed. Mater. Res. Part B Appl. Biomater. 2020 108 1814 1825 10.1002/jbm.b.34524 31774242 196. Ocando C. Dinescu S. Samoila I. Ghitulica C.D. Cucuruz A. Costache M. Averous L. Fabrication and properties of alginate-hydroxyapatite biocomposites as efficient biomaterials for bone regeneration Eur. Polym. J. 2021 151 110444 10.1016/j.eurpolymj.2021.110444 197. Fan Z. Liu B. Wang J. Zhang S. Lin Q. Gong P. Ma L. Yang S. A novel wound dressing based on Ag/graphene polymer hydrogel: Effectively kill bacteria and accelerate wound healing Adv. Funct. Mater. 2014 24 3933 3943 10.1002/adfm.201304202 198. Li R. Liu K. Huang X. Li D. Ding J. Liu B. Chen X. Bioactive materials promote wound healing through modulation of cell behaviors Adv. Sci. 2022 9 2105152 10.1002/advs.202105152 35138042 PMC8981489 199. Leclère F.M. Casoli V. Use of bioartificial dermal regeneration template for skin restoration in combat casualty injuries Regen. Med. 2016 11 359 360 10.2217/rme-2016-0044 27250674 200. Huang J. Yang R. Jiao J. Li Z. Wang P. Liu Y. Li S. Chen C. Li Z. Qu G. A click chemistry-mediated all-peptide cell printing hydrogel platform for diabetic wound healing Nat. Commun. 2023 14 7856 10.1038/s41467-023-43364-2 38030636 PMC10687272 201. Hu J. Quan Y. Lai Y. Zheng Z. Hu Z. Wang X. Dai T. Zhang Q. Cheng Y. A smart aminoglycoside hydrogel with tunable gel degradation, on-demand drug release, and high antibacterial activity J. Control. Release 2017 247 145 152 10.1016/j.jconrel.2017.01.003 28077265 202. Xu W. He M. Lu Q. Fibronectin connecting cell sheet based on click chemistry for wound repair Adv. Sci. 2024 11 2306746 10.1002/advs.202306746 PMC10953575 38164116 203. Wang C. Wang M. Xu T. Zhang X. Lin C. Gao W. Xu H. Lei B. Mao C. Engineering bioactive self-healing antibacterial exosomes hydrogel for promoting chronic diabetic wound healing and complete skin regeneration Theranostics 2019 9 65 10.7150/thno.29766 30662554 PMC6332800 204. Chen M. Tian J. Liu Y. Cao H. Li R. Wang J. Wu J. Zhang Q. Dynamic covalent constructed self-healing hydrogel for sequential delivery of antibacterial agent and growth factor in wound healing Chem. Eng. J. 2019 373 413 424 10.1016/j.cej.2019.05.043 205. Selvarajah S. Hammond E.R. Haider A.H. Abularrage C.J. Becker D. Dhiman N. Hyder O. Gupta D. Black III J.H. Schneider E.B. The burden of acute traumatic spinal cord injury among adults in the united states: An update J. Neurotrauma 2014 31 228 238 10.1089/neu.2013.3098 24138672 206. Kumar D. Gandhamal A. Talbar S. Hani A.F.M. Knee articular cartilage segmentation from MR images: A review ACM Comput. Surv. (CSUR) 2018 51 97 10.1145/3230631 207. Zhang L. Wei J. Huang Y. Wang L. Gao H. Yang Y. Clickable immune-microenvironment modulated hydrogels for spinal cord injury repair J. Colloid Interface Sci. 2025 679 1079 1092 10.1016/j.jcis.2024.10.113 39504844 208. Li L. Xiao B. Mu J. Zhang Y. Zhang C. Cao H. Chen R. Patra H.K. Yang B. Feng S. A MnO2 nanoparticle-dotted hydrogel promotes spinal cord repair via regulating reactive oxygen species microenvironment and synergizing with mesenchymal stem cells ACS Nano 2019 13 14283 14293 10.1021/acsnano.9b07598 31769966 209. Tigner T.J. Dampf G. Tucker A. Huang Y.C. Jagrit V. Clevenger A.J. Mohapatra A. Raghavan S.A. Dulin J.N. Alge D.L. Clickable granular hydrogel scaffolds for delivery of neural progenitor cells to sites of spinal cord injury Adv. Healthc. Mater. 2024 13 2303912 10.1002/adhm.202303912 PMC11390979 38470994 210. Zhang Y. Li L. Mu J. Chen J. Feng S. Gao J. Implantation of a functional TEMPO-hydrogel induces recovery from rat spinal cord transection through promoting nerve regeneration and protecting bladder tissue Biomater. Sci. 2020 8 1695 1701 10.1039/C9BM01530B 31989134 211. Liu W. Xu B. Zhao S. Han S. Quan R. Liu W. Ji C. Chen B. Xiao Z. Yin M. Spinal cord tissue engineering via covalent interaction between biomaterials and cells Sci. Adv. 2023 9 eade8829 10.1126/sciadv.ade8829 36753555 PMC9908024 212. Tsai I.-L. Hsu C.-C. Hung K.-H. Chang C.-W. Cheng Y.-H. Applications of biomaterials in corneal wound healing J. Chin. Med. Assoc. 2015 78 212 217 10.1016/j.jcma.2014.09.011 25455161 213. Meller D. Peters K. Meller K. Human cornea and sclera studied by atomic force microscopy Cell Tissue Res. 1997 288 111 118 10.1007/s004410050798 9042778 214. Lei L. Hu Y. Shi H. Bao Z. Wu Y. Jiang J. Li X. Biofunctional peptide-click PEG-based hydrogels as 3D cell scaffolds for corneal epithelial regeneration J. Mater. Chem. B 2022 10 5938 5945 10.1039/D2TB00983H 35894700 215. Li L. Lu C. Wang L. Chen M. White J. Hao X. McLean K.M. Chen H. Hughes T.C. Gelatin-based photocurable hydrogels for corneal wound repair ACS Appl. Mater. Interfaces 2018 10 13283 13292 10.1021/acsami.7b17054 29620862 216. Rosenquist J. Folkesson M. Hoglund L. Pupkaite J. Hilborn J.n. Samanta A. An injectable, shape-retaining collagen hydrogel cross-linked using thiol-maleimide click chemistry for sealing corneal perforations ACS Appl. Mater. Interfaces 2023 15 34407 34418 10.1021/acsami.3c03963 37435912 PMC10375477 217. Koivusalo L. Kauppila M. Samanta S. Parihar V.S. Ilmarinen T. Miettinen S. Oommen O.P. Skottman H. Tissue adhesive hyaluronic acid hydrogels for sutureless stem cell delivery and regeneration of corneal epithelium and stroma Biomaterials 2019 225 119516 10.1016/j.biomaterials.2019.119516 31574405 218. Guo L. Fu Z. Li H. Wei R. Guo J. Wang H. Qi J. Smart hydrogel: A new platform for cancer therapy Adv. Colloid Interface Sci. 2025 340 103470 10.1016/j.cis.2025.103470 40086017 219. Du H. Zhang A. Zhang Q. Sun Y. Zhu H. Wang H. Tan Z. Zhang X. Chen G. Fabrication of recoverable Bi 2 2 5 7 0 2 2 Sep. Purif. Technol. 2025 359 130597 10.1016/j.seppur.2024.130597 220. Fu S. Dong H. Deng X. Zhuo R. Zhong Z. Injectable hyaluronic acid/poly (ethylene glycol) hydrogels crosslinked via strain-promoted azide-alkyne cycloaddition click reaction Carbohydr. Polym. 2017 169 332 340 10.1016/j.carbpol.2017.04.028 28504153 221. Truong V.X. Tsang K.M. Simon G.P. Boyd R.L. Evans R.A. Thissen H. Forsythe J.S. Photodegradable gelatin-based hydrogels prepared by bioorthogonal click chemistry for cell encapsulation and release Biomacromolecules 2015 16 2246 2253 10.1021/acs.biomac.5b00706 26056855 222. Bock N. Forouz F. Hipwood L. Clegg J. Jeffery P. Gough M. van Wyngaard T. Pyke C. Adams M.N. Bray L.J. GelMA, click-chemistry gelatin and bioprinted polyethylene glycol-based hydrogels as 3D ex vivo drug testing platforms for patient-derived breast cancer organoids Pharmaceutics 2023 15 261 10.3390/pharmaceutics15010261 36678890 PMC9867511 223. Li S. Xu Y. Yu J. Becker M.L. Enhanced osteogenic activity of poly (ester urea) scaffolds using facile post-3D printing peptide functionalization strategies Biomaterials 2017 141 176 187 10.1016/j.biomaterials.2017.06.038 28688288 224. Bebiano L.B. Presa R. Vieira F. Lourenço B.N. Pereira R.F. Bioinspired and photo-clickable thiol-ene bioinks for the extrusion bioprinting of mechanically tunable 3D skin models Biomimetics 2024 9 228 10.3390/biomimetics9040228 38667239 PMC11048463 225. Stichler S. Jungst T. Schamel M. Zilkowski I. Kuhlmann M. Böck T. Blunk T. Teßmar J. Groll J. Thiol-ene clickable poly (glycidol) hydrogels for biofabrication Ann. Biomed. Eng. 2017 45 273 285 10.1007/s10439-016-1633-3 27177637 226. Yin R. Zhang N. Wang K. Long H. Xing T. Nie J. Zhang H. Zhang W. Material design and photo-regulated hydrolytic degradation behavior of tissue engineering scaffolds fabricated via 3D fiber deposition J. Mater. Chem. B 2017 5 329 340 10.1039/C6TB02884E 32263551 227. Jiang P. Lin P. Yang C. Qin H. Wang X. Zhou F. 3D printing of dual-physical cross-linking hydrogel with ultrahigh strength and toughness Chem. Mater. 2020 32 9983 9995 10.1021/acs.chemmater.0c02941 228. Becer C.R. Hoogenboom R. Schubert U.S. Click chemistry beyond metal-catalyzed cycloaddition Angew. Chem. Int. Ed. 2009 48 4900 4908 10.1002/anie.200900755 19475588 229. Fares M.M. Jabani Z.H. Abu-Haniyi L.A. Synthesis of novel bioadhesive hydrogels via facile Thiol-Ene click chemistry for wound healing applications Int. J. Biol. Macromol. 2024 270 132501 10.1016/j.ijbiomac.2024.132501 38763241 230. Sousa G.F. Afewerki S. Dittz D. Santos F.E.P. Gontijo D.O. Scalzo S.R.A. Santos A.L.C. Guimaraes L.C. Pereira E.M. Barcelos L.S. Catalyst-Free Click Chemistry for Engineering Chondroitin Sulfate-Multiarmed PEG Hydrogels for Skin Tissue Engineering J. Funct. Biomater. 2022 13 45 10.3390/jfb13020045 35466227 PMC9036249 231. Collins J. Nadgorny M. Xiao Z. Connal L.A. Doubly dynamic self-healing materials based on oxime click chemistry and boronic acids Macromol. Rapid Commun. 2017 38 1600760 10.1002/marc.201600760 28117503 232. Shao C. Wang M. Chang H. Xu F. Yang J. A self-healing cellulose nanocrystal-poly (ethylene glycol) nanocomposite hydrogel via Diels–Alder click reaction ACS Sustain. Chem. Eng. 2017 5 6167 6174 10.1021/acssuschemeng.7b01060 233. Tan Y. Huang H. Ayers D.C. Song J. Modulating viscoelasticity, stiffness, and degradation of synthetic cellular niches via stoichiometric tuning of covalent versus dynamic noncovalent cross-linking ACS Cent. Sci. 2018 4 971 981 10.1021/acscentsci.8b00170 30159394 PMC6107872 234. Tang S. Ma H. Tu H.C. Wang H.R. Lin P.C. Anseth K.S. Adaptable fast relaxing boronate-based hydrogels for probing cell—Matrix interactions Adv. Sci. 2018 5 1800638 10.1002/advs.201800638 30250802 PMC6145256 235. Wei Z. Yang J.H. Du X.J. Xu F. Zrinyi M. Osada Y. Li F. Chen Y.M. Dextran-based self-healing hydrogels formed by reversible Diels–Alder reaction under physiological conditions Macromol. Rapid Commun. 2013 34 1464 1470 10.1002/marc.201300494 23929621 236. Liu F. Paton R.S. Kim S. Liang Y. Houk K. Zee Fall Women’s 2018 Winter 19 Denim 34 Wi57 Yes P335 Jeans 0q4a0fdn--melodic.giftedhandscateringdc.com J. Am. Chem. Soc 2013 135 15642 15649 10.1021/ja408437u 24044412 237. Soriano del Amo D. Wang W. Jiang H. Besanceney C. Yan A.C. Levy M. Liu Y. Marlow F.L. Wu P. Biocompatible copper (I) catalysts for in vivo imaging of glycans J. Am. Chem. Soc. 2010 132 16893 16899 10.1021/ja106553e 21062072 PMC3021957 238. Li L. Zhang Z. Development and applications of the copper-catalyzed azide-alkyne cycloaddition (CuAAC) as a bioorthogonal reaction Molecules 2016 21 1393 10.3390/molecules21101393 27783053 PMC6273301 239. Zhang Z. He C. Chen X. Hydrogels based on pH-responsive reversible carbon–nitrogen double-bond linkages for biomedical applications Mater. Chem. Front. 2018 2 1765 1778 10.1039/C8QM00317C 240. Han G.S. Domaille D.W. Tuning the exchange dynamics of boronic acid hydrazones and oximes with pH and redox control Org. Biomol. Chem. 2021 19 4986 4991 10.1039/D1OB00191D 34008683 Figure 1 Schematic of the most important click chemistry reactions based on their various mechanisms. Figure 2 Types of hydrogel fabrication mechanisms based on the click reaction chemistry. Figure 3 Illustration of functional groups and dynamic covalent chemistries employed to design injectable click chemistry hydrogels, where reagents of matching colors undergo specific reactions under defined conditions to form crosslinked networks with tunable properties, self-healing ability, and excellent biocompatibility for biomedical applications. Figure 4 The multidisciplinary pillars of modern regenerative medicine: showcasing advanced research in skin wound healing, corneal and ocular repair, cartilage and bone regeneration, neural scaffold engineering for spinal cord injuries, and the transformative technology of 3D bioprinting and fabrication. Figure 5 Summary of advantages and disadvantages of click chemistry synthesis methods. gels-11-00724-t001_Table 1 Table 1 Common click chemistry reactions used for hydrogel crosslinking in tissue engineering applications. Reaction Type Mechanism Advantages Limitations Applications [Ref.]  Azide–Alkyne Cycloaddition Copper(I)-catalyzed or strain-promoted reaction between azides and alkynes High specificity, bioorthogonal, efficient under mild conditions Copper catalyst may be cytotoxic (CuAAC); strain-promoted versions more expensive Injectable hydrogels, cell encapsulation, drug delivery [ 32 33  Thiol–Ene Reaction Radical-mediated addition of thiols to alkenes Fast kinetics, no metal catalysts, tunable crosslinking Requires photoinitiator or thermal initiator In situ gelation, biofunctionalization, 3D cell culture [ 34 35  Diels–Alder Reaction [4+2] Cycloaddition between a diene and a dienophile Reversible under thermal control, catalyst-free Temperature sensitivity may affect biological components Injectable hydrogels, drug release systems [ 16 36  Michael Addition Nucleophilic addition of thiols to electron-deficient vinyl groups Mild conditions, high yield, no need for catalyst Sensitivity to pH and competing nucleophiles Cell-laden hydrogels, tissue engineering scaffolds [ 37 38  Oxime/Hydrazone Formation Reaction between aldehydes/ketones and hydrazides or aminooxy groups Chemoselective, compatible with aqueous environments Hydrolysis-sensitive; slow gelation in some cases Injectable matrices, bioadhesives [ 39 40  Tetrazine–Norbornene Reaction Inverse electron-demand Diels–Alder reaction Ultra-fast kinetics, catalyst-free, excellent bioorthogonality Tetrazine compounds can be costly Real-time cell encapsulation, dynamic biomaterials [ 41 42  SuFEx (Sulfur Fluoride Exchange) Click reaction involving sulfur-fluoride bonds High yield, stable products, emerging tool in bio-click chemistry Limited current use in hydrogels; less biocompatibility data Future directions in robust hydrogel crosslinking [ 43 44 gels-11-00724-t002_Table 2 Table 2 Recent research on azide–alkyne cycloaddition-based hydrogels for tissue engineering, including both (CuAAC) and (SPAAC) approaches. Hydrogel Composition Click Type Application Ref. Alginate grafted with BCN/cyclooctyne; azide-peptides (e.g., Az-cRGD) SPAAC Peptide functionalisation of alginate preserving peptide bioactivity for 2D/3D cell assays; cell-friendly, in-presence-of-cells coupling. [ 74 Cyclooctyne-modified alginate (ALG-K) conjugated to bis-azide MMP-sensitive peptides (PVGLIG) SPAAC Tunable protease-sensitive alginate hydrogels that support cell spreading and matrix remodeling; modular and bioorthogonal. [ 75 Review covering many metal-free click reactions (SPAAC emphasis) applied to PEG, HA, alginate, gelatin hydrogels. SPAAC & other metal-free clicks Comprehensive summary of metal-free click chemistries for cell-laden hydrogels and translational potential; practical reagent notes. [ 76 Review/analysis of kinetics across click classes (CuAAC, SPAAC, IEDDA, etc.) relevant to hydrogel design. CuAAC vs. SPAAC (comparison) Practical guidance: CuAAC = fast but requires Cu(I) management; SPAAC = biocompatible (no copper) but reagent cost/kinetics tradeoffs—crucial when choosing for cell-laden gels. [ 77 Alginate hydrogels microstructured and functionalised via SPAAC for injectable cell delivery and morphogenesis guidance. SPAAC Demonstrated injectable, microstructured, cell-instructive hydrogels produced using bioorthogonal SPAAC; supports 3D cell patterning. [ 78 Alginate–gelatin hybrid hydrogels dual-crosslinked using SPAAC (bioorthogonal) plus ionic or secondary covalent crosslinks. SPAAC (primary) + secondary crosslinks Improved mechanics and cell-instructive environment; on viscoelastic tuning for cardiac TE (long-term in vivo results still pending) [ 79 gels-11-00724-t003_Table 3 Table 3 Recent studies on thiol–ene click hydrogels for tissue engineering, covering both synthetic and natural polymer systems. Hydrogel Composition Application/Highlight Ref. Methoxy-PEG grafted to keratin via thiol-ene photoclick Eco-friendly fabrication of keratin-based hydrogel, potential for biomaterial scaffolding. [ 104 Thiol-ene hydrogel combined with poly (propylene fumarate) (PPF) scaffold Local PTH delivery in critical-size bone defects, sustained bioactivity through 21 days, promoting bone healing. [ 105 Gelatin–hyaluronic acid modified for thiol-ene crosslinking 3D-printable cryogel scaffolds, enhanced mechanical stability, biocompatibility, potentially useful in cartilage or soft tissue. [ 106 Hydroxypropyl methylcellulose (HPMC) derivatives via thiol-ene, forming PNP hydrogels with PEG–PLA nanoparticles Injectable polymer–nanoparticle hydrogels featuring tunable mechanics, retention time, and bioactive peptide loading, ideal for cell/drug delivery. [ 95 Alginate/gelatin/CMC functionalized with thiol/norbornene for thiol-ene photo-crosslinking, incorporating SERS nanorods 3D-printed plasmonic scaffolds enabling real-time metabolic sensing in 3D cell cultures, biosensing + structural scaffold in one. [ 94 gels-11-00724-t004_Table 4 Table 4 Representative studies on boronate ester–crosslinked hydrogels for tissue engineering. Hydrogel Composition Crosslink Type (Boronate-Based) Application/Highlight Ref. Cellulose derivatives functionalized with boronic-acid/diol motifs to form reversible boronate esters. Boronate-ester dynamic crosslinking (self-healing) Self-healing, conductive hydrogel with good cytocompatibility, candidate for soft tissue repair and bioelectronic interfaces. [ 117 Various polymer backbones (PVA, PEG, polysaccharides) crosslinked by bis-boronic acids to give glucose-responsive networks. Boronate ester crosslinks responsive to glucose/pH Closed-loop insulin delivery platforms illustrating how BE hydrogels can be tuned for biomedical, implantable drug-release applications. [ 118 Thin-film hydrogels of polymers bearing phenylboronic acid (PBA) for glucose binding and reversible crosslinking. PBA–diol boronate esters (glucose competitive) Glucose-sensitive swelling/optical response; useful as biosensing layers and for smart biomaterials in regenerative medicine workflows. [ 119 Hyaluronic acid (HA) chemically modified with phenylboronic acid groups to form reversible networks with diol-bearing partners. PBA–diol boronate ester network (dynamic) Supports 2D/3D culture of articular chondrocytes, promising for cartilage tissue engineering and cell-friendly, dynamic ECM mimicry. [ 120 Gelatin modified with phenylboronic acid crosslinked to oxidized dextran (diol/aldehyde components present) to form an injectable gel. Boronate ester (PBA–diol) dynamic crosslinks (plus secondary interactions) Injectable, biodegradable hydrogel for bone TE; good cell viability and in vitro osteogenic markers reported. [ 121 Multi-component hydrogel combining PBA-functionalized polymers with catechol/diol units and ROS-scavenging moieties. Boronate ester dynamic bonds (pH/glucose/ROS responsive) Injectable, multi-stimuli-responsive system demonstrating controllable drug release, antioxidant effect and promising in vitro biocompatibility for wound/tissue repair. [ 122 Review summarizing PEG, PVA, HA, dextran, gelatin systems that exploit BE dynamics at physiological pH. Survey of boronate ester chemistries, pH tuning, and strategies to operate near physiological conditions State-of-the-art review covering materials design, pH/glucose responsiveness, self-healing, and translational challenges (stability, in vivo data, scale-up). Good starting point for application-directed design. [ 123 gels-11-00724-t005_Table 5 Table 5 Representative studies on oxime and hydrazone–crosslinked hydrogels for tissue engineering. Hydrogel Composition Crosslink Type Application/Highlight Ref. Aldehyde-PEG + aminooxy-PEG (oxime), Rapid in situ gelation on wet tissue; physiological pH Oxime Strong wet-tissue adhesion/retention; anti-fouling surface [ 153 HA-aldehyde + aminooxy crosslinker, Physiological pH/ionic strength Oxime Transparent, vitreous-like modulus; enzymatic stability [ 147 HA-aldehyde/HA-hydrazide + benzaldehyde/hydrazide, Mild, aqueous; tunable stress relaxation Hydrazone (acylhydrazone) Viscoelastic (stress-relaxing) networks modulate MSC spreading & secretome [ 154 HA-aldehyde + dihydrazide crosslinker, Fast gelation; pH-responsive Hydrazone (acylhydrazone) Self-healing, enhanced mechanics; cytocompatible [ 155 gels-11-00724-t006_Table 6 Table 6 Representative studies on Schiff-base–crosslinked hydrogels for tissue engineering. Hydrogel Composition Crosslink Type Application/Highlight Ref. Alginate dialdehyde (ADA) + gelatin (GEL) Schiff base (imine) between ADA aldehydes and GEL amines; printable grids 3D-printed ADA–GEL scaffolds for cartilage tissue engineering; supports chondrocyte function. [ 178 Oxidized alginate + chitosan (plus conductive phase) Schiff base (aldehyde–amine) gives self-healing; printable under mild conditions Conductive, self-healing, 3D-printable hydrogels aimed at TE scaffolds (soft tissues). [ 179 Hyaluronic acid + oxidized chitosan (OCS) Schiff base; physiological, tissue-adhesive, self-healing Antibacterial, adhesive injectable hydrogel; promising wound-healing/soft-tissue TE dressing. [ 180 Oxidized dextran (ODex) + gelatin (GEL) + nano-fillers Schiff base; injectable, self-healing Growth-factor-free bone regeneration in vivo; enhanced osteogenesis from dynamic imine network. [ 185 Oxidized alginate + gelatin (with microspheres) Schiff base; in situ gelation Biocompatible composite scaffolds with improved mechanics for TE applications. [ 185 Gelatin + hyaluronic acid (one oxidized) Dynamic mine; self-healing Biodegradable, conductive, self-healing hydrogel; broadly relevant to TE and wound repair. [ 186 Quaternary-ammonium chitosan + oxidized partner Schiff base; mild, injectable Adhesive, antibacterial hydrogels suitable for tissue repair dressings and cell delivery. [ 187 Gelatin + oxidized alginate (Schiff base) + NPs Imine crosslinking; injectable Localized therapy platform: ADA–GEL imine network is a canonical TE matrix (drug/cell co-delivery). [ 188 ",
  "metadata": {
    "Title of this paper": "Tuning the exchange dynamics of boronic acid hydrazones and oximes with pH and redox control",
    "Journal it was published in:": "Gels",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12469877/"
  }
}