{
  "title": "Paper_1223",
  "abstract": "pmc Cells Cells 2106 cells cells Cells 2073-4409 Multidisciplinary Digital Publishing Institute  (MDPI) PMC12468703 PMC12468703.1 12468703 12468703 41002418 10.3390/cells14181453 cells-14-01453 1 Review Advances in Non-Small Cell Lung Cancer Cellular Immunotherapy: A Progress in Dendritic Cell, T-Cell, and NK Cell Vaccines Masroor Ali Beg Mirza 1 † Aslam Mohammad 2 † https://orcid.org/0000-0002-7596-8513 Ayaz Asma 3 † https://orcid.org/0000-0002-5486-4408 Akhtar Muhammad Saeed 4 * https://orcid.org/0000-0001-6864-2366 Zaman Wajid 5 * Brest Patrick Academic Editor Lorico Aurelio Academic Editor 1 mirzamasroor1@gmail.com 2 mohammadaslam13@yu.ac.kr 3 asma@nbu.edu.cn 4 5 * msakhtar@yu.ac.kr wajidzaman@yu.ac.kr † These authors contributed equally to this work. 16 9 2025 9 2025 14 18 496658 1453 23 6 2025 11 9 2025 12 9 2025 16 09 2025 27 09 2025 27 09 2025 © 2025 by the authors. 2025 https://creativecommons.org/licenses/by/4.0/ Licensee MDPI, Basel, Switzerland. This article is an open access article distributed under the terms and conditions of the Creative Commons Attribution (CC BY) license ( https://creativecommons.org/licenses/by/4.0/ Over the past decade, cellular immunotherapy has emerged as a transformative strategy for non-small cell lung cancer (NSCLC), with dendritic-cell (DC) vaccines, T-cell vaccines, and natural killer (NK)-cell therapies demonstrating distinct mechanisms and clinical potential. DC vaccines capitalize on antigen presentation to prime tumor-specific T-cell responses, showing excellent safety profiles limited mainly to injection-site reactions and flu-like symptoms. While monotherapy has shown limited efficacy, combinations with checkpoint inhibitors or chemotherapy enhance immune activation and survival outcomes. Recent innovations, including neoantigen-loaded, mRNA-electroporated, and exosome-pulsed DCs, demonstrate improved immunogenicity and personalized approaches. T-cell vaccines, designed to activate cytotoxic CD8+ T-cell responses, have been tested across multiple platforms, including peptide-based (MAGE-A3), viral vector (TG4010/MUC1), and mRNA (CV9201/92) formulations. While the phase III MAGRIT trial presented no disease-free survival (DFS) benefit with adjuvant MAGE-A3 vaccination, the TG4010 vaccine improved progression-free survival (PFS; HR 0.66) and overall survival (OS; HR 0.67) in MUC1-positive NSCLC when combined with chemotherapy. Current strategies focus on personalized neoantigen vaccines and KRAS-targeted approaches (e.g., ELI-002), with ongoing phase III trials evaluating their potential in resectable NSCLC. NK-cell therapies have also shown promise, with early trials establishing the feasibility of autologous and allogeneic infusions, while engineered CAR-NK cells enhance tumor-specific targeting. Combination strategies with checkpoint inhibitors significantly improve response rates and PFS, revealing synergies between innate and adaptive immunity. Recent advances include cytokine-enhanced, memory-like NK cells to overcome immunosuppression and “off-the-shelf” products for broader clinical use. Together, these cellular immunotherapies represent a versatile and evolving frontier in NSCLC treatment, with ongoing research optimizing combinations, delivery platforms, and patient selection to maximize therapeutic benefit. non-small cell lung cancer cell-based immunotherapy dendritic cell T cell NK-cell vaccines clinical outcomes combination therapy biomarkers safety adverse events This research received no external funding. pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement no pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes 1. Introduction Lung cancer remains the leading cause of cancer-associated mortality worldwide, accounting for approximately 1.8 million deaths each year [ 1 2 3 4 5 Substantial advances in immuno-oncology have not eliminated relapse or primary resistance, prompting a shift toward more precise, individualized strategies, such as cellular immunotherapies [ 6 7 8 Combination treatments are also gaining attention; co-administration of epidermal growth factor receptor tyrosine kinase inhibitors (EGFR-TKIs) with invariant NK T cells demonstrated acceptable safety and preliminary synergy in patients with EGFR-mutant NSCLC [ 9 10 Despite these challenges, immunotherapy is redefining the therapeutic landscape for NSCLC. Unlike cytotoxic chemotherapy or radiotherapy, which indiscriminately damage healthy tissue, immunotherapy harnesses the patient’s immune system to selectively eradicate malignant cells, thereby reducing toxicity and potentially improving outcomes [ 11 12 13 4 Modern cancer immunotherapy now extends beyond checkpoint inhibitors and CAR-T cells to include bispecific T-cell engagers, neoantigen vaccines, and modulation of myeloid cells. Bispecific antibodies that concurrently bind T lymphocytes and tumor-associated antigens precisely redirect cytotoxicity toward malignant cells, increasing antitumor efficacy while limiting off-target toxicity [ 14 15 16 2. Materials and Methods This study combined data from ongoing and published clinical trials and studies assessing adoptive cellular treatments (ACTs) for NSCLC published between 2015 and 2025. We focused on three main therapeutic platforms: dendritic-cell (DC) vaccines, T-cell-based vaccines, and natural killer (NK)-cell therapies. The analysis considered both completed research and ongoing clinical trials to provide a comprehensive picture of recent developments. We found relevant studies by carefully searching medical literature databases and clinical trial registries. The studies that are included must address at least one of three crucial elements: safety profiles, immunologic activity (such as DC cell, T cell, or NK cell responses), or clinical efficacy metrics like objective response rates (ORR), progression-free survival (PFS), and overall survival (OS). 3. Dendritic Cell (DC) Vaccines in NSCLC A novel immunotherapeutic strategy for NSCLC is the use of DC vaccines, which capitalize on the DCs’ potent antigen-presenting capacity to provoke tumor-specific T-cell responses. DCs are expert antigen-presenting cells that can prime naïve T cells and elicit robust adaptive immune responses against antigens associated with cancer. The most common method for creating ex vivo DC vaccines for NSCLC is to separate patient autologous monocytes, turn them into DCs, and then load them with tumor-associated antigens (TAAs), like mucin 1 (MUC1), Wilms’ tumor 1 (WT1), or customized neoantigens. These antigen-loaded DCs are re-administered to the patient after maturing in order to trigger cytotoxic T lymphocyte (CTL) responses that specifically target cancerous cells ( Figure 1 The primary feature of dendritic cell (DC) vaccines’ favorable safety profile is their low-grade adverse events. Local injection site reactions and transient constitutional symptoms like fatigue and myalgia are the most common toxicities; dose-limiting toxicities have not been observed in more recent trials [ 17 18 19 20 19 20 Over the past decade, there has been a significant shift in the research on dendritic-cell (DC) vaccines for NSCLC. More recent efforts have clearly shifted toward customization, improved antigen delivery, and sensible combinations with systemic therapies, even though early-stage vaccines based on peptides and lysates established a good safety and immunogenicity baseline. Early trials conducted using the WT1- and MUC1-peptide methods [ 21 22 23 Randomized and single-arm combination experiments attempted to use chemotherapy-induced antigen release and immunogenic cell death in the hope that concurrent DC vaccination could benefit from increased antigen availability. Trial design heterogeneity, small sample sizes, and inconsistent endpoint reporting complicate definitive efficacy claims, even though some analyses show modest improvements in PFS in particular subgroups, and interim data demonstrate acceptable tolerability and enhancement of peripheral immune markers [ 24 A fundamental conceptual shift was brought in that neoantigen-directed DC vaccinations (ongoing neoantigen trials) are feasible within clinical timescales and may increase the availability of private neoantigen-specific T cell clones, a crucial development for personalization. Neoantigen vaccines address tumor heterogeneity by targeting mutational epitopes specific to each patient. They have repeatedly shown strong immunogenicity with occasional partial responses, suggesting that tailored antigen selection can have more profound biological effects than tumor-associated antigens that are sold commercially [ 25 26 27 28 29 The majority of adverse effects are mild injection site reactions, transient fever, or fatigue; all vaccines are safe. Reproducible immunogenicity is indicated by the formation of T cell receptor clonotypes, IFN-γ ELISPOTs, multimer staining, and, in some cases, an increase in tumor-infiltrating lymphocytes. Clinical efficacy as monotherapy is still low in advanced, heavily pretreated populations, although the most compelling indications are in combination treatments, earlier adjuvant settings, or when vaccines are truly customized. Some of the methodological issues that require attention include small and heterogeneous patient populations, different results (immune vs. clinical), limited randomized comparisons, and variations in DC manufacturing (source cells, maturation cocktails, antigen-loading procedure). Furthermore, to turn frequent immunologic responses into steady, long-lasting clinical effects, adjuvant immune modulators may need to be integrated with multi-platform antigen delivery (neoantigen peptides, mRNA, exosomes). Overall, DC vaccines have been proven to be safe and physiologically active in NSCLC during the 2015–2025 decade, and current tendencies toward combination and personalization techniques offer a viable way to improve patient outcomes, pending the outcomes of larger, ongoing, well-controlled trials ( Table 1 4. T-Cell-Based Vaccines in NSCLC NSCLC is treated with T-cell vaccinations, a form of targeted immunotherapy that stimulates the patient’s adaptive immune system to distinguish and eradicate tumor cells ( Figure 2 32 33 34 35 36 Between 2015 and 2025, a variety of T-cell-based vaccines, such as peptide, viral vector, and mRNA vaccine platforms, were tested in NSCLC. These tactics aimed to enhance tumor-specific T-cell responses by employing tailored neoantigens or tumor-associated antigens (TAAs). The results of completed and ongoing trials indicate that the efficacy profile is variable, with immune activation being more consistent than survival benefits. One of the earliest and most well-known studies was TIME, which assessed TG4010, a modified vaccinia Ankara (MVA) viral vector that contained the tumor-associated antigen MUC1 and interleukin-2 (IL-2). TG4010 and first-line chemotherapy significantly improved overall survival (OS) (HR 0.67, p p 37 The START study evaluated a peptide vaccine that targets the melanoma-associated antigen A3 (MAGE-A3) in combination with treatment for stage IIIB/IV NSCLC. When compared to chemotherapy alone, the vaccination did not produce a statistically significant improvement in PFS or OS, despite being immunogenic [ 38 39 40 41 In recent years, there has been an expansion into customized mRNA vaccination strategies. The current INTerpath-009 (mRNA-4157/V940) trial by Moderna and Merck is evaluating a patient-specific mRNA neoantigen vaccination plus pembrolizumab in the adjuvant context for resected high-risk NSCLC. This global phase III trial is recruiting patients who did not show a pathological complete response after neoadjuvant therapy, with the main objective being DFS; however, the results are expected after 2025 [ 42 The ELI-002 (AMPLIFY) initiative uses commercially available KRAS mutant peptides (G12/G13) and a lymph node-targeted amphiphile peptide vaccination platform. Expansion into NSCLC cohorts was prompted by early phase I findings showing substantial immunogenicity in minimum residual disease groups. The platform’s architecture improves the delivery of antigen to lymphoid tissue, which may increase the priming effectiveness of CD8 T cells [ 43 Personalized neoantigen mRNA vaccines have been assessed in advanced non-small cell lung cancer in several early-phase trials. The majority of patients experience detectable neoantigen-specific T-cell responses, and manufacturing viability has been validated across trials. Combinations with immune checkpoint inhibitors (ICIs) seem to increase immunogenicity and clinical activity, and safety profiles have been positive [ 44 45 Table 2 5. Natural Killer (NK)-Cell-Based Vaccines in NSCLC Natural killer (NK)-cell-based vaccines and treatments are examples of new immunotherapeutic approaches for NSCLC. By using death receptor signaling, perforin/granzyme release, and antibody-dependent cellular cytotoxicity (ADCC), NK cells, innate lymphocytes, can eliminate tumor cells without first sensitizing the cells [ 46 47 Figure 3 From 2015 to 2025, clinical research has steadily increased our understanding of NK-cell-based therapies for NSCLC, highlighting the therapeutic potential and safety in a variety of settings and patient populations. A phase I trial involved autologous NK cell adoptive transfer and IL-2 in patients with advanced NSCLC. The treatment was well tolerated, with few side effects, and some patients showed signs of immune activation along with partial tumor reduction, suggesting that NK cell treatments could be used safely in this population [ 48 49 49 50 51 52 A Phase I/II study combining NK-cell therapy with pembrolizumab in advanced metastatic NSCLC demonstrated that the treatment was safe and well tolerated, enhanced anti-tumor activity, and improved objective response rate (ORR) and progression-free survival (PFS) [ 53 54 NCT03941457 NCT04551885 55 56 There are significant safety challenges in developing cancer vaccines, particularly in selecting TAAs. Many TAAs have similar regions, called shared epitopes, that are also present in normal human proteins, even though they are commonly selected because they are primarily found in cancer cells. Because common sequences in antigens linked to tumors may cause autoimmune reactions by inadvertently targeting healthy tissues, cancer vaccines pose safety risks. This risk is greater for tissue-specific antigens like ASCL2, KLK2, TPTE, CLDN6, and PSMA, which may evade early detection in initial testing or become more severe when taken with checkpoint inhibitors. By activating regulatory T cells, these shared sequences may reduce efficacy, even when there are no obvious autoimmune reactions. Therefore, developing safer and more effective vaccines in the future requires careful target sequence selection and sophisticated antigen design [ 57 Table 3 6. Conclusions Over the past ten years, cellular immunotherapies, such as T-cell, NK-cell, and dendritic-cell (DC) vaccines, have emerged as promising treatments for NSCLC. DC vaccinations can boost the immune system and are safe, but they work best when combined with other therapies. T-cell vaccines, particularly those that employ specific neoantigen techniques, have been shown to elicit potent anti-tumor immune responses. NK cell treatments have advanced from straightforward infusions to intricate customized forms with improved efficacy and durability. Although these treatments are generally well tolerated, there are still challenges in overcoming the tumor’s immune system resistance and ensuring consistent responses in each patient. The most successful strategies combine these cellular therapies with drugs that have already received approval, like checkpoint inhibitors or chemotherapy. Future research should focus on improving patient selection using biomarkers, standardizing production processes, and refining these combinations to make these innovative medications accessible to more NSCLC patients. Disclaimer/Publisher’s Note: Author Contributions Conceptualization, M.M.A.B., M.A., and A.A.; Methodology, M.M.A.B., M.A., and A.A.; Validation, M.M.A.B., M.A., and A.A.; Formal analysis, M.M.A.B., M.A., and A.A.; Investigation, M.M.A.B., M.A., and A.A.; Data curation, M.M.A.B., M.A., and A.A.; Writing—original draft, M.M.A.B., M.A., and A.A.; Writing—review and editing, M.M.A.B., M.A., and A.A.; Visualization, M.M.A.B., M.A., and A.A.; software, M.S.A. and W.Z.; validation, M.S.A. and W.Z.; formal analysis. M.S.A. and W.Z.; resources, M.S.A. and W.Z.; supervision, M.S.A. and W.Z.; project administration, M.S.A. and W.Z.; and funding acquisition; M.S.A. and W.Z. All authors have read and agreed to the published version of the manuscript. Data Availability Statement This published paper contains all of the information generated or analyzed during this research. However, the reader can ask the corresponding author for any additional data that were used or examined in this study on reasonable request. Conflicts of Interest The authors declare no conflicts of interest. References 1. Sung H. Ferlay J. Siegel R.L. Laversanne M. Soerjomataram I. Jemal A. Bray F. Global cancer statistics 2020: GLOBOCAN estimates of incidence and mortality worldwide for 36 cancers in 185 countries CA Cancer J. Clin. 2021 71 209 249 10.3322/caac.21660 33538338 2. Siegel R.L. Miller K.D. Wagle N.S. Jemal A. Cancer statistics, 2023 CA Cancer J. Clin. 2023 73 17 48 10.3322/caac.21763 36633525 3. Siegel R.L. Giaquinto A.N. Jemal A. Cancer statistics, 2024 CA Cancer J Clin. 2024 74 12 49 10.3322/caac.21820 38230766 4. Kimura H. Matsuda T. Fujita H. Ono A. Toyoda M. Saito R. Nakamura Y. Terao K. Mizuguchi H. Tanaka M. Randomized controlled phase III trial of adjuvant chemoimmunotherapy with activated cytotoxic T cells and dendritic cells from regional lymph nodes of patients with lung cancer Cancer Immunol Immunother. 2018 67 1231 1238 10.1007/s00262-018-2180-6 29855695 PMC6097784 5. Blumenschein G.R. Johnson M.L. Patel M.R. Lakhani N.J. Ahn M.J. Pant S. Liu S.V. Heymach J.V. Gomez D.R. Lee J. Phase I clinical trial evaluating the safety and efficacy of ADP-A2M10 SPEAR T cells in patients with MAGE-A10+ advanced non-small cell lung cancer J. Immunother. Cancer 2022 10 e003581 10.1136/jitc-2021-003581 35086946 PMC8796260 6. June C.H. Sadelain M. Chimeric antigen receptor therapy N. Engl. J. Med. 2018 379 64 73 10.1056/NEJMra1706169 29972754 PMC7433347 7. Melero I. Berman D.M. Aznar M.A. Korman A.J. Gracia J.L. Haanen J. Evolving synergistic combinations of targeted immunotherapies to combat cancer Nat. Rev. Cancer 2015 15 457 472 10.1038/nrc3973 26205340 8. Liu E. Marin D. Banerjee P. Macapinlac H.A. Thompson P. Basar R. Nassif Kerbauy L. Overman B. Thall P. Kaplan M. Use of CAR-transduced natural killer cells in CD19-positive lymphoid tumors N. Engl. J. Med. 2020 382 545 553 10.1056/NEJMoa1910607 32023374 PMC7101242 9. Yu W. Ye F. Yuan X. Ma Y. Mao C. Li X. Li J. Dai C. Qian F. Li J. A Phase I/II Clinical Trial on the Efficacy and Safety of NKT Cells Combined with Gefitinib for Advanced EGFR-Mutated Non-Small-Cell Lung Cancer BMC Cancer 2021 21 877 10.1186/s12885-021-08590-1 34332557 PMC8325186 10. Reck M. Remon J. Hellmann M.D. First-line immunotherapy for non–small-cell lung cancer J. Clin. Oncol. 2022 40 586 597 10.1200/JCO.21.01497 34985920 11. Herbst R.S. Morgensztern D. Boshoff C. The biology and management of non-small cell lung cancer Nature 2018 553 446 454 10.1038/nature25183 29364287 12. Stevanović S. Draper L.M. Langhan M.M. Campbell T.E. Kwong M.L. Wunderlich J.R. Dudley M.E. Yang J.C. Sherry R.M. Kammula U.S. Complete regression of metastatic cervical cancer after treatment with human papillomavirus–targeted tumor-infiltrating T cells J. Clin. Oncol. 2021 39 763 772 10.1200/JCO.2014.58.9093 25823737 PMC4417725 13. Rosenberg S.A. Restifo N.P. Adoptive cell transfer as personalized immunotherapy for human cancer Science 2015 348 62 68 10.1126/science.aaa4967 25838374 PMC6295668 14. Ribas A. Wolchok J.D. Cancer immunotherapy using checkpoint blockade Science 2018 359 1350 1355 10.1126/science.aar4060 29567705 PMC7391259 15. Sahin U. Oehm P. Derhovanessian E. Jabulowsky R.A. Vormehr M. Gold M. Maurus D. Schwarck-Kokarakis D. Kuhn A.N. Omokoko T. An RNA vaccine drives immunity in checkpoint-inhibitor-treated melanoma Nature 2020 585 107 112 10.1038/s41586-020-2537-9 32728218 16. Kumar V. Donthireddy L. Marvel D. Condamine T. Wang F. Lavilla-Alonso S. Hashimoto A. Vonteddu P. Behera R. Goins M.A. Cancer-associated fibroblasts neutralize the anti-tumor effect of CSF1 receptor blockade by inducing PMN-MDSC infiltration of tumors Cancer Cell. 2017 32 654 668.e5 10.1016/j.ccell.2017.10.005 29136508 PMC5827952 17. Borch T.H. Engell-Noerregaard L. Zeeberg Iversen T. Ellebaek E. Met Ö. Hansen M. Andersen M.H. Straten P.T. Svane I.M. mRNA-transfected dendritic cell vaccine in combination with metronomic cyclophosphamide as treatment for patients with advanced malignant melanoma Oncoimmunology 2016 5 e1207842 10.1080/2162402X.2016.1207842 27757300 PMC5048758 18. Carreno B.M. Magrini V. Becker-Hapak M. Kaabinejadian S. Hundal J. Petti A.A. Ly A. Lie W.R. Hildebrand W.H. Mardis E.R. A dendritic cell vaccine increases the breadth and diversity of melanoma neoantigen-specific T cells Science 2015 348 803 808 10.1126/science.aaa3828 25837513 PMC4549796 19. ClinicalTrials.gov NCT02018458 2025 Available online: https://clinicaltrials.gov/study/NCT02018458?tab=history (accessed on 12 August 2025) 20. Palucka K. Banchereau J. Cancer immunotherapy via dendritic cells Nat. Rev. Cancer 2023 23 75 92 10.1038/nrc3258 PMC3433802 22437871 21. Matsuda T. Takeuchi H. Sakurai T. Mayanagi S. Booka E. Fujita T. Higuchi H. Taguchi J. Hamamoto Y. Takaishi H. Pilot study of WT1 peptide-pulsed dendritic cell vaccination with docetaxel in esophageal cancer Oncol Lett. 2018 16 1348 1356 10.3892/ol.2018.8734 29963201 PMC6019898 22. Zhang R. Inagawa H. Takahashi M. Kawanishi H. Kazumura K. Tsuchiya H. Morishita N. Kobayashi Y. Masaki T. Kobara H. Measurement of the phagocytic activity of human peripheral blood using a highly sensitive fluorometric detection device without hemolysis Anticancer Res. 2017 37 3897 3903 10.21873/anticanres.11771 28668892 23. Lee K.S. Kim B.H. Oh H.-K. Kim D.-W. Kang S.-B. Kim H. Shin E. Programmed cell death ligand-1 protein expression and CD274/PD-L1 gene amplification in colorectal cancer: Implications for prognosis Cancer Sci. 2018 109 2957 2969 10.1111/cas.13716 29949671 PMC6125474 24. Zhao H. Wang Y. Yu J. Wei F. Cao S. Zhang X. Dong N. Li H. Ren X. Autologous cytokine-induced killer cells improves overall survival of metastatic colorectal cancer patients: Results from a phase II clinical trial Clin Color. Cancer 2016 15 228 235 10.1016/j.clcc.2016.02.005 27052743 25. Zhong R. Ling X. Cao S. Xu J. Zhang B. Zhang X. Wang H. Han B. Zhong H. Safety and efficacy of dendritic cell-based immunotherapy (DCVAC/LuCa) combined with carboplatin/pemetrexed for patients with advanced non-squamous non-small-cell lung cancer without oncogenic drivers ESMO Open 2022 7 100334 10.1016/j.esmoop.2021.100334 34959168 PMC8718955 26. Garris C.S. Arlauckas S.P. Kohler R.H. Trefny M.P. Garren S. Piot C. Engblom C. Pfirschke C. Siwicki M. Gungabeesoon J. Successful anti-PD-1 cancer immunotherapy requires T cell-dendritic cell crosstalk involving the cytokines IFN-γ and IL-12 Immunity 2022 55 1749 10.1016/j.immuni.2022.07.021 36103861 27. ClinicalTrials.gov NCT05190185 Available online: https://clinicaltrials.gov/study/NCT05190185 (accessed on 12 August 2025) 28. National Institutes of Health (US) Bethesda (MD): National Library of Medicine (US). Personalized Cancer Vaccine in Treating Patients with Advanced Non-Small Cell Lung Cancer. ClinicalTrials.gov Identifier: NCT02956551 4 November 2016 [Cited 13 May 2024] Available online: https://clinicaltrials.gov/study/NCT02956551 (accessed on 12 August 2025) 29. Wang S. Wang Z. Efficacy and safety of dendritic cells co-cultured with cytokine-induced killer cells immunotherapy for non-small-cell lung cancer Int. Immunopharmacol. 2015 28 22 28 10.1016/j.intimp.2015.05.021 26013109 30. ClinicalTrials.gov NCT02639858 Available online: https://clinicaltrials.gov/study/NCT02639858 (accessed on 12 August 2025) 31. Guo Z. Yuan Y. Chen C. Lin J. Ma Q. Liu G. Gao Y. Huang Y. Chen L. Chen L.Z. Durable complete response to nivolumab for lung cancer after dendritic cell vaccination following anti-PD-1 therapy in metastatic gastric cancer NPJ Precis. Oncol. 2022 6 34 10.1038/s41698-022-00279-3 35661819 PMC9166775 32. Sharma P. Allison J.P. The future of immune checkpoint therapy Science 2015 348 56 61 10.1126/science.aaa8172 25838373 33. Ott P.A. Hu Z. Keskin D.B. Shukla S.A. Sun J. Bozym D.J. Zhang W. Luoma A. Giobbie-Hurder A. Peter L. An immunogenic personal neoantigen vaccine for patients with melanoma Nature 2017 547 217 221 10.1038/nature22991 28678778 PMC5577644 34. Mellman I. Coukos G. Dranoff G. Cancer immunotherapy comes of age Nature 2011 480 480 489 10.1038/nature10673 22193102 PMC3967235 35. Vansteenkiste J.F. Cho B.C. Vanakesa T. De Pas T. Zielinski M. Kim M.S. Jassem J. Yoshimura M. Dahabreh J. Nakayama H. Efficacy of the MAGE-A3 cancer immunotherapeutic as adjuvant therapy in patients with resected MAGE-A3-positive non-small-cell lung cancer (MAGRIT): A randomised, double-blind, placebo-controlled, phase 3 trial Lancet Oncol. 2016 17 822 835 10.1016/S1470-2045(16)00099-1 27132212 36. Garon E.B. Rizvi N.A. Hui R. Leighl N. Balmanoukian A.S. Eder J.P. Patnaik A. Aggarwal C. Gubens M. Horn L. Pembrolizumab for the treatment of Non–Small-Cell Lung Cancer N. Engl. J Med. 2015 372 2018 2028 10.1056/NEJMoa1501824 25891174 37. Quoix E. Ramlau R. Westeel V. Papai Z. Madroszyk A. Riviere A. Koralewski P. Breton J.-L. Stoelben E. Braun D. Therapeutic vaccination with TG4010 and first-line chemotherapy in advanced non–small-cell lung cancer: A controlled phase IIb trial Lancet Oncol. 2011 12 1125 1133 10.1016/S1470-2045(11)70259-5 22019520 38. Vansteenkiste J. Zielinski M. Linder A. Dahabreh J. Gonzalez E.E. Malinowski W. Lopez-Brea M. Vanakesa T. Jassem J. Kalofonos H. Adjuvant MAGE-A3 immunotherapy in resected non-small-cell lung cancer: Phase II randomized study results J. Clin. Oncol. 2013 31 2396 2403 10.1200/JCO.2012.43.7103 23715567 39. Tyagi P. Mirakhur B. MAGRIT: The largest-ever phase III lung cancer trial aims to establish a novel tumor-specific approach to therapy Clin. Lung Cancer 2009 10 371 374 10.3816/CLC.2009.n.052 19808198 40. Du X. Li F. Lizee G. Hwu P. Deng L. Talukder A. Hawke D. Zou Q. Roszik J. Stairs M. 1177PD—Clinical study of personalized neoantigen peptide vaccination in advanced NSCLC patients Ann. Oncol. 2019 30 v478 v479 10.1093/annonc/mdz253.003 41. Hibino M. Uryu K. Takeda T. Kunimatsu Y. Shiotsu S. Uchino J. Hirai S. Yamada T. Okada A. Hasegawa Y. Safety and Immunogenicity of mRNA Vaccines Against Severe Acute Respiratory Syndrome Coronavirus 2 in Patients with Lung Cancer Receiving Immune Checkpoint Inhibitors: A Multicenter Observational Study in Japan J. Thorac. Oncol. 2022 17 1002 1013 10.1016/j.jtho.2022.05.015 35752437 PMC9220466 42. Spicer J.D. Nair S.M. Khattak A. Lee J.M. Brown M. Meehan R.S. Shariati N. Deng X. Samkari A. Chaft J.E. CT281: The phase 3 INTerpath-002 study design: Individualized neoantigen therapy (INT) V940 (mRNA-4157) plus pembrolizumab vs placebo plus pembrolizumab for resected early-stage non–small-cell lung cancer (NSCLC) J. Clin. Oncol. 2024 42 TPS8116 10.1158/1538-7445.AM2024-CT281 43. Pant S. Wainberg Z.A. Weekes C.D. Furqan M. Kasi P.M. Devoe C.E. Leal A.D. Chung V. Basturk O. VanWyk H. Lymph-node-targeted, mKRAS-specific amphiphile vaccine in pancreatic and colorectal cancer: The phase 1 AMPLIFY-201 trial Nat. Med. 2024 30 531 542 10.1038/s41591-023-02760-3 38195752 PMC10878978 44. Ding Z. Li Q. Zhang R. Xie L. Shu Y. Gao S. Wang P. Su X. Qin Y. Wang Y. Personalized neoantigen pulsed dendritic cell vaccine for advanced lung cancer Signal Transduct. Target. Ther. 2021 6 26 10.1038/s41392-020-00448-5 33473101 PMC7817684 45. Saxena M. Marron T.U. Kodysh J. Finnigan J.P. Onkar S. Jr. Kaminska A. Tuballes K. Guo R. Sabado R.L. Meseck M. PGV001 multi peptide personalized Neoantigen Vaccine Platform: Phase I Study in Patients with Solid and Hematologic Malignancies in the Adjuvant Setting Cancer Discov. 2025 15 930 947 10.1158/2159-8290.CD-24-0934 40094414 46. Myers J.A. Miller J.S. Exploring the NK cell platform for cancer immunotherapy Nat Rev Clin Oncol. 2021 18 85 100 10.1038/s41571-020-0426-7 32934330 PMC8316981 47. Vivier E. Tomasello E. Baratin M. Walzer T. Ugolini S. Functions of natural killer cells Nat. Immunol. 2008 9 503 510 10.1038/ni1582 18425107 48. Hsu J. Hodgins J.J. Marathe M. Nicolai C.J. Bourgeois-Daigneault M.C. Trevino T.N. Azimi C.S. Scheer A.K. Randolph H.E. Thompson T.W. Contribution of NK cells to immunotherapy mediated by PD-1/PD-L1 blockade J. Clin. Investig. 2018 128 4654 4668 10.1172/JCI99317 30198904 PMC6159991 49. Liem N.T. Van Phong N. Kien N.T. Anh B.V. Huyen T.L. Thao C.T. Tu N.D. Hiep D.T. Hoai Thu D.T. Nhung H.T.M. Phase I Clinical Trial Using Autologous Ex Vivo Expanded NK Cells and Cytotoxic T Lymphocytes for Cancer Treatment in Vietnam Int. J. Mol. Sci. 2019 20 3166 10.3390/ijms20133166 31261712 PMC6651639 50. Choi M.G. Son G.W. Choi M.Y. Jung J.S. Rho J.K. Ji W. Yoon B.G. Jo J.M. Kim Y.M. Ko D.H. Safety and efficacy of SNK01 (autologous natural killer cells) in combination with cytotoxic chemotherapy and/or cetuximab after failure of prior tyrosine kinase inhibitor in non-small cell lung cancer: Non-clinical mouse model and phase I/IIa clinical study J. Immunother. Cancer 2024 12 e008585 10.1136/jitc-2023-008585 38538093 PMC10982808 51. Iliopoulou E.G. Kountourakis P. Karamouzis M.V. Doufexis D. Ardavanis A. Baxevanis C.N. Rigatos G. Papamichail M. Perez S.A. A phase I trial of adoptive transfer of allogeneic natural killer cells in patients with advanced non-small cell lung cancer Cancer Immunol. Immunother. 2010 59 1781 1789 10.1007/s00262-010-0904-3 20703455 PMC11030924 52. City of Hope Medical Center Genetically Engineered Natural Killer (NK) Cells with or Without Atezolizumab for the Treatment of Non-small Cell Lung Cancer Previously Treated with PD-1 and/or PD-L1 Immune Checkpoint Inhibitors. ClinicalTrials.gov Identifier: NCT05334329 Updated 2023 Available online: https://clinicaltrials.gov/study/NCT05334329 (accessed on 12 August 2025) 53. Lin M. Luo H. Liang S. Chen J. Liu A. Niu L. Jiang Y. Pembrolizumab plus allogeneic NK cells in advanced non-small cell lung cancer patients J. Clin. Investig. 2020 130 2560 2569 10.1172/JCI132712 32027620 PMC7190908 54. Wang Y. Deng L. Wang J. Zhang T. Wang W. Wang X. Liu W. Wu Y. Lv J. Feng Q. Induction PD-1 inhibitor toripalimab plus chemotherapy followed by concurrent chemoradiotherapy and consolidation toripalimab for bulky locally advanced non-small-cell lung cancer: Protocol for a randomized phase II trial (InTRist study) Front. Immunol. 2024 14 1341584 10.3389/fimmu.2023.1341584 38288117 PMC10822928 55. ClinicalTrials.gov ID NCT03619954 Available online: https://clinicaltrials.gov/study/NCT03619954 (accessed on 12 August 2025) 56. Multhoff G. Seier S. Stangl S. Sievert W. Shevtsov M. Werner C. Pockley A.G. Blankenstein C. Hildebrandt M. Offner R. Targeted Natural Killer Cell-Based Adoptive Immunotherapy for the Treatment of Patients with NSCLC after Radiochemotherapy: A Randomized Phase II Clinical Trial Clin. Cancer Res. Off. J. Am. Assoc. Cancer Res. 2020 26 5368 5379 10.1158/1078-0432.CCR-20-1141 32873573 57. Kellermann G. Mograbi B. Hofman P. Brest P. Shared epitopes create safety and efficacy concerns in several cancer vaccines J. Immunother. Cancer 2025 13 e012217 10.1136/jitc-2025-012217 40645662 PMC12248204 Figure 1 Diagram of dendritic-cell vaccine production and mechanism of action: From patient blood collection to tumor-specific T-cell activation. Figure 2 Demonstration of T-cell vaccine preparation and administration in NSCLC, and illustration of the treatment approach. Figure 3 Demonstration of the NK-cell vaccine mechanism in NSCLC, and illustration of the treatment approach. cells-14-01453-t001_Table 1 Table 1 Summary of completed and ongoing clinical trials of dendritic-cell (DC) vaccines in NSCLC, highlighting safety, immunogenicity, and efficacy outcomes. Year Phase & Design Intervention Population Key Outcomes Reference 2017 Phase I, pilot study Autologous DCs pulsed with WT1 peptide + chemotherapy Advanced NSCLC Combination therapy was safe and feasible. WT1-specific immune responses were observed and correlated with a trend towards improved survival [ 21 2018 Phase II, randomized Allogeneic DCs/CIK cells + Chemotherapy vs. Chemotherapy alone Stage IIIB/IV NSCLC Improved ORR and DCR. Significantly longer PFS (6.5 vs. 4.3 mo) and OS (21.0 vs. 14.5 mo) in the combination group. [ 24 2017 Phase I/II, open-label DCs with MUC1 peptide Advanced NSCLC, refractory cases Safe, PR 2/16, SD 7/16, increased MUC1-specific T-cell responses [ 22 2018 Phase I, open-label DCs with WT1 + MUC1 peptides Post-first-line chemotherapy Safe, enhanced antigen-specific CTL activity, median PFS ~4.5 months [ 23 2020 Phase I and II, single arm DCVAC/LuCa (allogeneic dendritic cell vaccine) + Carboplatin/Pemetrexed chemotherapy Advanced NSCLC Promising median Overall Survival (OS) of 15.5 months. Disease Control Rate (DCR) of 70.6%. Associated with increased cytotoxic T-cell and NK cell activity. [ 25 2020 Phase II, randomized DCs + chemotherapy Stage III NSCLC post-CRT Ongoing, interim safety confirmed, PFS results awaited [ 30 2021 Phase I/II, open-label Autologous DCs pulsed with tumor lysate + Nivolumab Advanced NSCLC Well-tolerated and induced neoantigen-specific T-cell activation, culminating in a durable complete response, demonstrating preliminary efficacy [ 31 2016 Phase I, open-label Autologous DCs electroporated with mRNA encoding personalized neoantigens Advanced NSCLC Well-tolerated, robust mutation-specific T-cell responses in in a patient with PD-1 blockade-resistant NSCLC [ 28 2015 Phase II, multi-centre Allogeneic DC/CIK + Anti-PD-1 Advanced NSCLC post-IO failure Enhanced ORR and DCR; prolonged PFS; well-tolerated. [ 29 20125 Phase I/II, open-label DCs with exosome pulsed tumor antigens Advanced NSCLC Ongoing, early immune response data are promising [ 27 cells-14-01453-t002_Table 2 Table 2 T-cell-based vaccines in NSCLC (2015–2025) show a decade of clinical trials, key outcomes, and future directions. Year Phase & Design Intervention Population Key Outcomes Reference 2015 Phase IIb, randomized Viral-vector (MVA) vaccine encoding MUC1 + IL-2 Advanced MUC1-positive NSCLC, first line In the TrPAL-low subgroup: improved PFS (HR 0.66) and OS (HR 0.67), epitope spreading, tolerable safety [ 37 2012 Phase II, randomized Peptide vaccine + chemotherapy Stage IIIB/IV NSCLC Immunogenic but no significant PFS/OS benefit, acceptable safety [ 38 2017 Phase III, randomized (adjuvant) Adjuvant peptide vaccine Completely resected NSCLC (IB-IIIA) No DFS benefit, safe, program halted for NSCLC [ 39 2019 Phase I, open-label Personalized peptide neoantigen vaccine ± chemo Advanced NSCLC post-chemo Induced neoantigen-specific CD8 + [ 40 2022 Phase I/II, open-label mRNA multivalent vaccine + PD-L1 blockade Advanced NSCLC Safe, immune activation, disease control in subsets with ICIs [ 41 2024 Phase III, randomized (adjuvant) Personalized mRNA neoantigen vaccine + pembrolizumab Resected high-risk NSCLC Recruiting; primary endpoint DFS, results pending [ 42 2023 Phase I Lymph node-targeted amphiphile peptide vaccine KRAS-mutant solid tumors; lung planned High immunogenicity in MRD cohorts; expansion to lung planned, favorable safety [ 43 2023–2025 Phase I, single-arm Personalized neoantigen mRNA vaccines Advanced NSCLC Feasible manufacturing; strong immunogenicity, safe, clinical activity variable [ 44 2024–2025 Phase I Personalized multi-peptide vaccine + ICI Mixed solid tumors including NSCLC Feasible, immunogenic, early disease control signals [ 45 cells-14-01453-t003_Table 3 Table 3 The clinical trial environment for natural killer (NK) cell immunotherapy in NSCLC (2015–2025), with safety, efficacy, and emerging patterns. Year Phase & Design Intervention Population Key Outcomes Reference 2018 Preclinical PD-1/PD-L1 immune checkpoint blockade with focus on NK cell contribution Advanced NSCLC efficacy; their loss reduced benefit, highlighting NK cell–intrinsic PD-1/PD-L1 signaling in tumor immunity [ 48 2019 Phase I Ex vivo-expanded NK cells + cytotoxic T lymphocytes NSCLC, relapsed or refractory Good safety, enhanced NK cell cytotoxicity [ 49 2024 Phase I/IIb, open-label Autologous NK cells + cytotoxic chemotherapy ± cetuximab NSCLC, heavily pretreated Safe, no dose-limiting toxicities; 25% objective response rate, 100% disease control, median PFS 143 days [ 50 2010 Phase I Allogeneic NK-cell therapy Advanced NSCLC Feasibility and safety demonstrated [ 51 2023 Phase I Engineered NK cells) ± Atezolizumab Advanced NSCLC patients Safety, tolerability, preliminary efficacy [ 52 2020 Phase I/II NK-cell + Pembrolizumab Advanced Metastatic NSCLC Safe and well-tolerated; enhanced anti-tumor activity; improved ORR and PFS [ 53 2021 Phase II, randomized NK-cell vaccine + anti-PD-1 therapy Advanced NSCLC Improved PFS vs. control, manageable toxicity [ 54 2020 Phase I/II NK cell infusion + chemotherapy Advanced NSCLC Ongoing, safety data pending [ 55 2020 Phase II Allogeneic NK-cell vaccine + chemotherapy Metastatic NSCLC Ongoing [ 56 ",
  "metadata": {
    "Title of this paper": "Shared epitopes create safety and efficacy concerns in several cancer vaccines",
    "Journal it was published in:": "Cells",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12468703/"
  }
}