{
  "title": "Paper_755",
  "abstract": "pmc Clin Transl Med Clin Transl Med 1991 clintransmed CTM2 Clinical and Translational Medicine 2001-1326 Wiley PMC12477549 PMC12477549.1 12477549 12477549 41020351 10.1002/ctm2.70474 CTM270474 1 Review Review Colorectal cancer molecular profiling: Opportunities for early detection SALA et al. Sala Alexandra https://orcid.org/0000-0001-6417-9706  1 alexandra.sala@dxcover.com van den Driest Lisa  2 Rattray Nicholas J. W.  2 Johnson Caroline H.  3 Cameron James M.  1 Khan Sajid A.  4 Palmer David S.  1  5 Baker Matthew J.  1  6 matthew.baker@dxcover.com MBaker10@lancashire.co.uk   1 Dxcover Ltd Glasgow UK   2 Strathclyde Institute of Pharmacy and Biomedical Sciences (SIPBS) University of Strathclyde Glasgow UK   3 Yale School of Public Health Yale University New Haven Connecticut USA   4 Yale School of Medicine Yale University New Haven Connecticut USA   5 Department of Pure and Applied Chemistry University of Strathclyde Glasgow UK   6 School of Medicine Faculty of Clinical and Biomedical Sciences University of Lancashire Preston UK * Correspondence alexandra.sala@dxcover.com matthew.baker@dxcover.com MBaker10@lancashire.co.uk 29 9 2025 10 2025 15 10 497549 10.1002/ctm2.v15.10 e70474 22 8 2025 16 5 2025 27 8 2025 29 09 2025 30 09 2025 30 09 2025 © 2025 The Author(s). Clinical and Translational Medicine https://creativecommons.org/licenses/by/4.0/ This is an open access article under the terms of the http://creativecommons.org/licenses/by/4.0/ Abstract Colorectal cancer (CRC) is one of the most common and deadliest cancers worldwide, and incidence rates are rising. However, early detection and intervention can improve the survival rates and quality of life of affected patients. Current screening tests used to streamline patients into colonoscopy either lack test adherence or sensitivity for detecting premalignant and early‐stage CRC, reducing the advantages of screening measures. Cost‐effective and minimally invasive diagnostic tests which can detect immune system and metabolic changes are key to lower the incidence of CRC advanced stages. We herein discuss the statistics, risk factors and unique genetic characteristics of CRC, focussing on the importance of understanding non tumour‐derived information in premalignant states for developing comprehensive techniques to achieve earlier diagnosis of CRC. Moreover, the advantages and limitations of current UK and USA screening programmes and emerging detection tools are discussed, along with prospective diagnostics such as genomics, proteomics and spectroscopy.  cancer colorectal CRC detection diagnostics early‐onset early‐stage liquid biopsy pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement no pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes source-schema-version-number 2.0 cover-date October 2025 details-of-publishers-convertor Converter:WILEY_ML3GV2_TO_JATSPMC version:6.6.4 mode:remove_FC converted:29.09.2025  Sala A van den Driest L Rattray NJW Colorectal cancer molecular profiling: Opportunities for early detection Clin Transl Med 2025 15 e70474 10.1002/ctm2.70474 1 EARLIER DETECTION OF CRC IS NEEDED: WHY NOW AND HOW? Colorectal cancer (CRC) incidence has been predicted to rise steadily in the next two decades, with cases among young people already on the rise.  1  2  3  3  4  5  6  7  8 Worldwide, colonoscopy is still considered the gold standard technique for the diagnosis of CRC. However, in many international healthcare systems, it is often prioritized for high risk patients, with suspected gastro‐intestinal symptoms or positive screening results.  9  10 In this review article, we discuss the statistics, risk factors and genetic characteristics of CRC. Moreover, we assess the current state of CRC diagnostic pathways in UK and USA. Emerging screening and diagnostic tools are also discussed, along with their advantages and limitations. 2 COLORECTAL CANCER: DEMOGRAPHICS AND STATISTICS CRC is the third most common cancer worldwide, accounting for around 2 million new cases every year and representing over 10% of all new cancer cases per year.  11  11  3  3  11 3 TUMORIGENESIS: FROM ADENOMA TO MALIGNANT GROWTH The development of CRC begins with the acquisition of mutations that initiate the formation of benign adenomatous polyps. Polyps are growths that originate from mucous membranes, and can present characteristic of an adenoma, a benign tumour that is prone to become cancerous.  12 A primary driver mutation known to initiate the transition from healthy cell into adenoma is the inactivation of the adenomatous polyposis coli (APC) tumour suppressor gene, found in about 80% of CRC.  13  14  15 The transition from adenoma to carcinoma is often accompanied by the acquisition of additional mutations in tumour suppressor genes such as KRAS, TP53, or SMAD2 and SMAD4 genes of the transforming growth factor β (TGF‐ β) pathway. In addition to driver mutations, at least three major molecular pathways have been identified; the most common (70%), is chromosomal instability (CIN) pathway, characterized by the accumulation of chromosomal abnormalities.  13  16  13  17 1  17  18 FIGURE 1 Overview of consensus molecular subtypes (CMS) in colorectal cancer. The figure specifies differences in incidence, localization, pathways enrichment and molecular features among the four CMS subtypes. CMS1 is characterized by high MSI and CIMP, with a high incidence of BRAF mutations. CMS2 is defined by high CIN and overexpression of Wnt and MYC pathways. CMS3 is characterized by metabolic dysregulation and KRAS mutations. CMS4 also displays high CIN, as well as over‐enrichment of VEGF/VEGFR and Integrin‐β3 pathways. Additional distinctions include differences in methylation and mutation statuses across subtypes. [BRAF, B‐Raf proto‐oncogene; CMS, consensus molecular subtypes; CIMP, CpG island methylator phenotype; CIN, chromosomal instability; JAK, Janus kinase; KRAS, KRAS proto‐oncogene; MSI, microsatellite instability; STAT, signal transducer and activator of transcription; SRC, SRC proto‐oncogene; MSS, microsatellite stable; VEGF, vascular endothelial growth factor; VEGFR, vascular endothelial growth factor receptor]. 3.1 The early‐onset case Early‐onset of CRC is a phenomenon that has been gaining interest in the past few decades and is discussed in several reviews.  2  4  5  19  20 et al.  1  1 Statistical research conducted over a decade ago estimated that CRC diagnosis in individuals aged younger than 50 would increase steadily by approximately 10–12% by 2030.  4  5  6  4  21  22 A birth cohort effect (i.e., variation in the risk of a health outcome based on the birth year) has been linked to the increasing incidence of early‐onset CRC in individuals aged 50 to 54, and the flattening of a previously decreasing incidence in those aged 55 to 74, which are due to shared exposures among people born after 1960.  23  24  25 Dietary patterns, such as the Western diet which includes “fast foods” (i.e., low fibre, high fat and ultra‐processed foods), and individual dietary constituents such as sugar‐sweetened beverages and processed meat, as well as diet‐associated disparities such as food insecurity, have all been associated with increased risk of early‐onset in isolated studies.  23  26  20 It is still unclear whether early‐onset CRC completely differs from CRC (i.e., late‐onset). Nonetheless, evidence suggests variance in clinical and pathological features, invasive behaviour and molecular profiles. Early‐onset CRC often present at a more aggressive and advanced stage (i.e., III‐IV) at diagnosis than late‐onset CRC, resulting in a greater impact on life for younger patients.  4  5  19  27  28 3.2 The unmet need of early detection Early detection can allow patients to receive timely surgical resection and therapeutics, positively impacting overall outcomes. There are various methods for detecting CRC; including colonoscopy, imaging, tissue biopsy, and biomarker tests. However, each of methods have their own limitations. Colonoscopy is the gold standard diagnostic test for CRC, but it is invasive, and resources are limited in some healthcare systems, making it a poor candidate for population screening. Less invasive methods, such as stool‐based or blood‐based tests, are preferable screening techniques, but current methods lack in diagnostic accuracy. For example, the faecal immunochemical test (FIT) is a non‐invasive test that detects for traces of blood in a stool sample, but the diagnostic performance is limited, particularly for early‐stage CRC cancers and pre‐cancerous conditions. In a systematic‐review by Monahan et al.  29 et al.  30  31 Additional difficulties contributing to the delayed diagnosis, and consequently increased incidence of advanced‐stage disease in CRC patients, can be lower disease awareness, lack of screening, underappreciation of symptoms and reluctance to seek medical care due to fear and/or negative perception around stool specimen collection and colonoscopy.  19 3.3 Metabolic and immune responses in the pre‐cancerous state As a pathological and molecularly heterogeneous cancer, CRC is influenced by both exogenous and endogenous factors.  32 2  32  33 FIGURE 2 Colorectal cancer stage development and key diagnostic information. Non tumour‐derived and tumour‐derived information are shed in different quantities throughout cancer development. Clinical performance evaluations suggest that current genomics and proteomics techniques do not sufficiently detect non tumour‐derived information in preliminary stages of the disease. The reprogramming of cell metabolism—an established hallmark of cancer—occurs in both malignant and premalignant stages of CRC, suggesting its pivotal role in the progression of CRC carcinogenesis.  33  34  35  33 et al.  36  33  37 Polymorphic microbiomes also play a role in CRC pathogenesis. Research suggests that in genetically predisposed FAP patients, intestinal microbial dysbiosis and the loss of T cells (i.e., immune cells) impair mucosal immunity and tumour surveillance.  38  39  40 4 CURRENT COLORECTAL CANCER DIAGNOSTIC TESTING 4.1 Screening programmes CRC screening programmes were introduced around 20 years ago worldwide and are now widely employed in an attempt to identify CRC at early stages of the disease, before symptoms appear.  41 3  42  43 3  44 FIGURE 3 Current colorectal cancer screening options in the UK and US with testing and follow‐up timelines. Their workflow is self‐explanatory through figure related text. [FIT: faecal immunochemical test; gFOBT: guaiac‐based faecal occult blood test; mt‐sDNA: multitargeted stool DNA; CT: computed tomography]. Access to screening differs depending on the governing healthcare system. In the UK, people can receive a FIT screening kit from the age of 50 years old in Scotland, 51 in Wales and 60 in England and Northern Ireland, up to 74 years old.  42  45  46 The decision to lower the minimum age for coverage of CRC screening has been praised for addressing the great burden of early‐onset CRC in younger people aged 45‐49. However, the incidence of CRC in younger people is still lower than in older people, hence prevalence and positive predictive values will be diminished, leading to significant costs associated with reducing the screening age, which could negatively impact the funds allocated to those at higher risk, due to socioeconomic or environmental factors. Furthermore, the possibility of over‐burdened healthcare systems and longer waiting times is a consideration;  21 4.2 New tests for colorectal cancer detection Until last year, only two U.S. FDA approved diagnostic technologies were available as an alternative to FIT: Cologuard™ (Exact Science) and Epi proColon™ ((Epigenomics AG), also known as ColoVantage™ and commercialized by Quest Diagnostics). However, the FDA approved three additional tests in 2024. ColoSense™ (Geneoscopy) and Shield™ (Guardant Health) were approved in May and July 2024 respectively;  31  47  48 1  30  49  50  51  52 TABLE 1 Current tests for colorectal cancer (CRC) detection. Name Company Test category Technology Specificity for CRC % ( n Sensitivity for CRC % ( n Sensitivity for CRC Stage I % ( n Sensitivity for AA % ( n Study/Trial Cost FIT N/A Stool‐based Haemoglobin detection assay  95 (17 934)  67 (98)  50 (30)  23 (2144) BLUE‐C  30 Available under $100 Cologuard Exact Sciences Stool‐based mt‐sDNA assay  90 (4457)  92 (65)  90 (29)  42 (757) DeeP‐C  49 $500   * Exact Sciences Stool‐based mt‐sDNA assay  91 (17 934)  94 (98)  87 (30)  43 (2144) BLUE‐C  30 $790   * Geneoscopy Stool‐based mt‐sRNA assay  88 (3760)  94 (36)  100 (14)  46 (606) CRC‐PREVENT  50 Product not yet available Epi proColon (ColoVantage) Epigenomics AG (Quest Diagnostics) Blood‐based Plasma methylated SEPT9 DNA assay  79 (444)  68 (44)  41 (17)  22 (621) PRESEPT  51 $800   * Guardant Health Blood‐based Plasma cell‐free DNA assay  90 (6680)  83 (65)  65 (17)  13 (1116) ECLIPSE  52 $1,500 * Recently approved by the FDA in 2024.  31  47  48 . John Wiley & Sons, Ltd. Other liquid biopsies can also be used when CRC is suspected. Carcinoembryonic antigen (CEA) is a common biomarker in blood that is investigated for colorectal abnormalities. However, CEA is not specific for CRC; it can indicate the presence of several cancers when elevated, and it is mainly indicated for prognosis and treatment management.  53 Most screening methods on the market for the detection of CRC still lack sensitivity for early‐stage cancer. The FDA approval of newer tests with higher sensitivity for stage I CRC represents a step forward for early diagnostics.  31  47  50  52  54  55  33  56 Whether blood‐based liquid biopsies can fully replace stool‐based tests, or be offered as an alternative, remains to be seen. Technologies are striving to improve their performance through the combination of results with clinical markers, such as metabolomics and proteomics biomarkers, and specific risk factors (e.g., age, diet, concurrent diseases).  33  56 5 PROSPECTIVE DIAGNOSTICS FOR COLORECTAL CANCER Liquid biopsy research has attracted vast interest in recent years, particularly in the field of CRC diagnostics.  57  58 ®  59  60 2  60  61  62 ® TABLE 2 Emerging diagnostic tests for colorectal cancer (CRC) detection. Name Company Test category Technology Specificity for CRC % ( n Sensitivity for CRC % ( n Sensitivity for CRC Stage I % ( n Sensitivity for AA % ( n Study/Trial Cost EarlyTect ® Genomictree Stool‐based Plasma methylated SDC2 DNA assay  90 (245)  90 (245)  85 (55)  67 (3) NEXT CRC  61 Price not publicly disclosed Freenome CRC Test Freenome Blood‐based Plasma cell‐free DNA assay  92 (24 567)  79 (72)  57 (28)  13 (2567) PREEMPT CRC  59  60 Price not publicly disclosed ColoxNGS Novigenix Blood‐based 29‐gene panel and plasma biomarkers assay  90 (149)  80 (97)  67 (44)‡  55 (103) DGNP‐COL‐0310  62  $350 (CHF 279)  ‡ ColoxNGS results include both CRC stage I and II. John Wiley & Sons, Ltd. 5.1 Prospective proteomics for CRC The application of protein screening technologies to identify diagnostic cancer biomarkers has also seen a significant increase, owing to industry driven standardisation and application to a range of large‐scale biobanking facilities. Proteins and their derivatives are increasingly recognised as promising biomarkers for the early detection of cancer. Their structural complexity and dynamic changes during tumorigenesis offer valuable insights into disease‐specific molecular alterations. Glycoproteins (i.e., proteins with carbohydrate chains) are involved in key physiological processes including cell signalling, immune modulation and maintenance of tissue architecture. Aberrant glycosylation is a hallmark of malignant transformation and occurs early in CRC progression, making glycoproteins attractive candidates for non‐invasive biomarker development.  63 et al.  64 et al. Proteomic technologies—such as Olink ® ® ®  65 5.1.1 Olink ® The Olink platform is an oligonucleotide amplification‐based approach where paired antibodies are used to complex with a protein target of interest (Figure 4A  66 et al.  67 n n n et al.  68 FIGURE 4 Mechanistic workflows of prospective proteomics for CRC diagnostics. Olink (A), SomaScan (B) and Seer (C) analytic platforms select and identify proteins; their workflow is self‐explanatory through figure related text. [PEA, proximity extension assay; qPCR, quantitative polymerase chain reaction; LC‐MSMS, liquid chromatography tandem mass spectrometry]. 5.1.2 SomaScan ® The SomaScan platform is based onto proprietary aptamers use. Their aptamers, which are molecular binders, are defined as SOMAmers and consist of single stranded oligonucleotides that fold into defined architectures and can be tuned towards selected proteins (Figure 4B  66  69 et al. n n  70 5.1.3 Seer ® ™ The Seer platform uses a magnetic nano‐particle approach that focusses on analysing the deep proteome by preselecting ultra‐low level abundance proteins. A magnetic nano‐particle mixture is added to a plate containing serum or plasma and, depending upon the structure of the magnetic particle, a specific protein complex to form a unique protein corona (Figure 4C  71  72 5.2 The importance of non tumour‐derived information Metabolic and immune system mechanisms are key factors that have been investigated to comprehend the signals to examine non tumour‐derived information in order to achieve earlier cancer detection. However, the specific biomarkers that can determine premalignant and earlier stages of cancer have yet to be identified.  33  73  74  75  76  77 Diagnostic tools that detect chronic inflammation driven by immune cells, microbial imbalance in the gut microbiome also affecting the metabolism, and hereditary cancer syndromes could inform risk assessment, early detection, and personalized treatment plans.  36  78 5.3 Multi‐omic spectral analysis There are various other analytical techniques that do not naturally fit under the single ‘‐omic’ umbrella, such as infrared (IR) spectroscopy. The interest in IR spectroscopy for biomedical applications has gradually increased due to the need for tests that are robust, affordable, easy‐to‐use and minimally invasive. There are a plethora of proof‐of‐concept studies that have demonstrated the effectiveness of the technique for the analysis of biofluids and tissue specimens.  79  80  33  81 5.3.1 Infrared spectroscopy IR spectroscopy is based on the interaction between IR light and the molecules contained in biological and chemical compounds. When IR light interacts with these molecules, their bonds vibrate at different but specific wavelengths. The vibrations are based on the atoms and bonds in the sample's molecules. For example, proteins are formed by amino acids, which are connected through amide groups known as peptide bonds; these are structurally different from molecular bonds in carbohydrates, and therefore these two macro‐compounds vibrate at different wavelengths in the IR spectral range.  33 The spectrum of a biological fluid, such as human blood serum, can be seen in Figure 5  41  42 FIGURE 5 Infrared spectrum detailing the main components of blood serum. Human blood serum spectral signature contains the information regarding proteins (e.g., amino acids), lipids (e.g., cholesterol), phosphates (e.g., DNA) and carbohydrates (e.g., glucose) present in a blood sample. An IR spectroscopy‐based liquid biopsy for cancer detection (Dxcover Ltd.) has shown promise in recent years.  82  83  84  85 In a multi‐cancer study, human blood serum of 200 CRC patients was analysed against serum from 459 patients which were suspected of having cancer, but ultimately had a negative diagnosis (i.e., no presence of malignancy).  85  85 6 CONCLUSIONS CRC is becoming a disturbing healthcare burden with the number of cases likely to increase steadily over the next decade, with growing concern over the rise in early‐onset cases.  1  45  46 Emerging diagnostics aim to increase the accuracy of current detection tools (e.g., FIT), obtaining high sensitivity with a set ≥ 90% specificity. Blood‐based liquid biopsies from leading companies reported validation studies with impressive results, yet lack in sensitivity for early‐stage cancer and pre‐cancer. These technologies employ genomics and proteomics assays with high sensitivity for targeted genes/proteins, which are generally present only at later stages of tumorigenesis. Some stool‐based tests (e.g., Cologuard) boast a higher sensitivity for early‐stage CRC, but stool‐based tests reportedly have low adherence compared to blood‐based liquid biopsies.  54  55 A better understanding of tumour progression from premalignant stages into CRC and the related changes in cancer biology are vital for the future of CRC diagnostics. Multi‐omic tests that examine various phenomena, rather than solely focussing on one single‐omics, such as solely genomics, are likely to be at the forefront of liquid biopsy research. Innovative technologies that assess signals related to the tumour and the non‐tumour environment may pave the way for the earlier detection of CRC. AUTHOR CONTRIBUTIONS  Alexandra Sala Lisa van den Driest Nicholas J. W. Rattray Caroline H. Johnson James M. Cameron Sajid A. Khan David S. Palmer Matthew J. Baker FUNDING INFORMATION All funding has been allocated from Dxcover Ltd. CONFLICT OF INTEREST STATEMENT Alexandra Sala and James M. Cameron are the employees of Dxcover Ltd. David S. Palmer and Matthew J. Baker are the founders and directors of Dxcover Ltd. CONSENT FOR PUBLICATION Not applicable. ETHICS STATEMENT The authors have nothing to report. ACKNOWLEDGEMENTS The authors acknowledge BioRender.com for the partial use of images/icons during the creation of figures for this manuscript. DATA AVAILABILITY STATEMENT Not applicable. REFERENCES 1 Siegel RL Giaquinto AN Jemal A Cancer statistics, 2024 CA Cancer J Clin 2024 74 12 49 10.3322/caac.21820 38230766 2 Willauer AN Liu Y Pereira AAL Clinical and molecular characterization of early‐onset colorectal cancer Cancer 2019 125 2002 2010 10.1002/cncr.31994 30854646 PMC6583775 3 WHO IARC. Cancer Tomorrow n.d https://gco.iarc.who.int/tomorrow/(accessed 2025 4 Ullah F Pillai AB Omar N Dima D Harichand S Early‐onset colorectal cancer: current insights Cancers (Basel). 2023 15 3202 10.3390/cancers15123202 37370811 PMC10296149 5 Mauri G Sartore‐Bianchi A Russo A Marsoni S Bardelli A Siena S Early‐onset colorectal cancer in young individuals Mol Oncol 2019 13 109 131 10.1002/1878-0261.12417 30520562 PMC6360363 6 Bailey CE Hu C‐Y You YN Increasing disparities in the age‐related incidences of colon and rectal cancers in the United States, 1975‐2010 JAMA Surg 2015 150 17 22 10.1001/jamasurg.2014.1756 25372703 PMC4666003 7 Siegel RL Kratzer TB Giaquinto AN Sung H Jemal A Cancer statistics, 2025 CA: A Cancer Journal for Clinicians 2025 75 10 45 10.3322/caac.21871 39817679 PMC11745215 8 Siegel RL Miller KD Fuchs HE Jemal A Cancer statistics, 2022 CA A Cancer J Clinicians 2022 72 7 33 10.3322/caac.21708 35020204 9 Gimeno‐García AZ Quintero E Role of colonoscopy in colorectal cancer screening: available evidence Best Practice & Research Clinical Gastroenterology 2023 66 101838 10.1016/j.bpg.2023.101838 37852706 10 Monahan KJ Bradshaw N Dolwani S Guidelines for the management of hereditary colorectal cancer from the British Society of Gastroenterology (BSG)/Association of Coloproctology of Great Britain and Ireland (ACPGBI)/United Kingdom Cancer Genetics Group (UKCGG) Gut 2020 69 411 444 10.1136/gutjnl-2019-319915 31780574 PMC7034349 11 WHO IARC. Cancer Today n.d https://gco.iarc.who.int/today/(accessed 12 NIH Screening Tests to Detect Colorectal Cancer and Polyps—NCI 2024 https://www.cancer.gov/types/colorectal/screening‐fact‐sheet 13 Sadien I Davies R Wheeler J The genomics of sporadic and hereditary colorectal cancer Ann R Coll Surg Engl 2024 106 313 320 10.1308/rcsann.2024.0024 38555871 PMC10981993 14 Abbott J Näthke IS The adenomatous polyposis coli protein 30 years on Seminars in Cell & Developmental Biology 2023 10.1016/j.semcdb.2023.04.004 37095033 15 Parker TW Neufeld KL APC controls Wnt‐induced β‐catenin destruction complex recruitment in human colonocytes Sci Rep 2020 10 2957 10.1038/s41598-020-59899-z 32076059 PMC7031393 16 Grady WM Genomic instability and colon cancer Cancer Metastasis Rev 2004 23 11 27 10.1023/a:1025861527711 15000146 17 Fontana E Eason K Cervantes A Salazar R Sadanandam A Context matters—consensus molecular subtypes of colorectal cancer as biomarkers for clinical trials Ann Oncol 2019 30 520 527 10.1093/annonc/mdz052 30796810 PMC6503627 18 Guinney J Dienstmann R Wang X The consensus molecular subtypes of colorectal cancer Nat Med 2015 21 1350 1356 10.1038/nm.3967 26457759 PMC4636487 19 Akimoto N Ugai T Zhong R Rising incidence of early‐onset colorectal cancer—a call to action Nat Rev Clin Oncol 2021 18 230 243 10.1038/s41571-020-00445-1 33219329 PMC7994182 20 Spaander MCW Zauber AG Syngal S Young‐onset colorectal cancer Nat Rev Dis Primers 2023 9 1 21 10.1038/s41572-023-00432-7 37105987 PMC10589420 21 Anderson JC Samadder JN To screen or not to screen adults 45‐49 years of age: that is the question Am J Gastroenterol 2018 113 1750 1753 10.1038/s41395-018-0402-3 30385833 PMC6768580 22 Wolf AMD Fontham ETH Church TR Colorectal cancer screening for average‐risk adults: 2018 guideline update from the American Cancer Society CA: A Cancer Journal for Clinicians 2018 68 250 281 10.3322/caac.21457 29846947 23 Gupta S May FP Kupfer SS Murphy CC Birth cohort colorectal cancer (CRC): implications for research and practice Clin Gastroenterol Hepatol 2024 22 455 469 10.1016/j.cgh.2023.11.040 38081492 PMC11304405 24 Li H Boakye D Chen X Associations of body mass index at different ages with early‐onset colorectal cancer Gastroenterology 2022 162 1088 1097 10.1053/j.gastro.2021.12.239 34914944 25 Jin EH Han K Shin CM Sex and Tumor‐site differences in the association of alcohol intake with the risk of early‐onset colorectal cancer J Clin Oncol 2023 41 3816 3825 10.1200/JCO.22.01895 37315287 PMC10419447 26 Hur J Otegbeye E Joh H‐K Sugar‐sweetened beverage intake in adulthood and adolescence and risk of early‐onset colorectal cancer among women Gut 2021 70 2330 2336 10.1136/gutjnl-2020-323450 33958435 PMC8571123 27 Saraiva MR Rosa I Claro I Early‐onset colorectal cancer: a review of current knowledge World Journal of Gastroenterology 2023 29 1289 1303 10.3748/wjg.v29.i8.1289 36925459 PMC10011966 28 Mauri G Patelli G Sartore‐Bianchi A Early‐onset cancers: biological bases and clinical implications Cell Reports Medicine 2024 5 101737 10.1016/j.xcrm.2024.101737 39260369 PMC11525030 29 Monahan KJ Davies MM Abulafi M Faecal immunochemical testing (FIT) in patients with signs or symptoms of suspected colorectal cancer (CRC): a joint guideline from the Association of Coloproctology of Great Britain and Ireland (ACPGBI) and the British Society of Gastroenterology (BSG) Gut 2022 71 1939 1962 10.1136/gutjnl-2022-327985 35820780 PMC9484376 30 Imperiale TF Porter K Zella J Next‐generation multitarget stool DNA test for colorectal cancer screening N Engl J Med 2024 390 984 993 10.1056/NEJMoa2310336 38477986 31 Press Release Guardant Health's ShieldTM Blood Test Approved by FDA as a Primary Screening Option, Clearing Path for Medicare Reimbursement and a New Era of Colorectal Cancer Screening 2024 https://investors.guardanthealth.com/press‐releases/press‐releases/2024/Guardant‐Healths‐Shield‐Blood‐Test‐Approved‐by‐FDA‐as‐a‐Primary‐Screening‐Option‐Clearing‐Path‐for‐Medicare‐Reimbursement‐and‐a‐New‐Era‐of‐Colorectal‐Cancer‐Screening/default.aspx 32 Nguyen HT Duong H‐Q The molecular characteristics of colorectal cancer: implications for diagnosis and therapy Oncol Lett 2018 16 9 18 10.3892/ol.2018.8679 29928381 PMC6006272 33 Sala A Cameron JM Brennan PM Global serum profiling: an opportunity for earlier cancer detection Journal of Experimental & Clinical Cancer Research 2023 42 207 10.1186/s13046-023-02786-y 37580713 PMC10426107 34 Hanahan D Hallmarks of Cancer: new Dimensions Cancer Discovery 2022 12 31 46 10.1158/2159-8290.CD-21-1059 35022204 35 Cruz MD Ledbetter S Chowdhury S Metabolic reprogramming of the premalignant colonic mucosa is an early event in carcinogenesis Oncotarget 2017 8 20543 10.18632/oncotarget.16129 28423551 PMC5400525 36 Hardbower DM Coburn LA Asim M EGFR‐mediated macrophage activation promotes colitis‐associated tumorigenesis Oncogene 2017 36 3807 3819 10.1038/onc.2017.23 28263971 PMC5501754 37 Bui TM Butin‐Israeli V Wiesolek HL Neutrophils alter DNA repair landscape to impact survival and shape distinct therapeutic phenotypes of colorectal cancer Gastroenterology 2021 161 225 238 10.1053/j.gastro.2021.03.027 33753103 38 Noble A Durant L Dilke SM Altered mucosal immune‐microbiota interactions in familial adenomatous polyposis Clinical and Translational Gastroenterology 2022 13 e00428 10.14309/ctg.0000000000000428 35297393 PMC10476795 39 Piciocchi A Germinario EAP Garcia Etxebarria K Association of Polygenic Risk Score and Bacterial Toxins at Screening Colonoscopy with Colorectal Cancer Progression: a Multicenter Case‐Control Study Toxins 2021 13 569 10.3390/toxins13080569 34437440 PMC8402601 40 Bai X Wei H Liu W Cigarette smoke promotes colorectal cancer through modulation of gut microbiota and related metabolites Gut 2022 71 2439 2450 10.1136/gutjnl-2021-325021 35387878 PMC9664112 41 Navarro M Nicolas A Ferrandez A Lanas A Colorectal cancer population screening programs worldwide in 2016: an update World J Gastroenterol 2017 23 3632 3642 10.3748/wjg.v23.i20.3632 28611516 PMC5449420 42 Cancer Research UK Bowel cancer screening n.d https://www.cancerresearchuk.org/about‐cancer/bowel‐cancer/getting‐diagnosed/screening 43 American Cancer Society Testing for Colorectal Cancer | How Is Colorectal Cancer Diagnosed https://www.cancer.org/cancer/types/colon‐rectal‐cancer/detection‐diagnosis‐staging/how‐diagnosed.html 44 National Comprehensive Cancer Network Clinical Practice Guidelines in Oncology—Colorectal Cancer Screening—Version 1 2024 https://www.nccn.org/guidelines/guidelines‐detail?category=2&id=1429 45 Centers for Medicare & Medicaid Services MLN Matters: MM13017; Related CR 13017 ‐ Removal of a National Coverage Determination & Expansion of Coverage of Colorectal Cancer Screening 2023 https://www.cms.gov/files/document/mm13017‐removal‐national‐coverage‐determination‐expansion‐coverage‐colorectal‐cancer‐screening.pdf 46 Centers for Medicare & Medicaid Services NCD—Colorectal Cancer Screening Tests 2103 https://www.cms.gov/medicare‐coverage‐database/view/ncd.aspx?NCDId=281 47 Press Release FDA Approves ColoSenseTM—Geneoscopy's Noninvasive Multi‐target Stool RNA (mt‐sRNA) Colorectal Cancer Screening Test—Geneoscopy—Transforming Gastrointestinal Health 2024 https://www.geneoscopy.com/fda‐approves‐colosense‐geneoscopys‐noninvasive‐multi‐target‐stool‐rna‐mtrna‐colorectal‐cancer‐screening‐test/ 48 Press Release FDA Approves Exact Sciences’ Cologuard Plus Test, Setting A New Benchmark in Non‐Invasive Colorectal Cancer Screening 2024 https://www.exactsciences.com/newsroom/press‐releases/fda‐approves‐exact‐sciences‐cologuard‐plus‐test 49 Imperiale TF Ransohoff DF Itzkowitz SH Multitarget stool DNA testing for colorectal‐cancer screening New England Journal of Medicine 2014 370 1287 1297 10.1056/NEJMoa1311194 24645800 50 Barnell EK Wurtzler EM La Rocca J Multitarget Stool RNA Test for Colorectal Cancer Screening JAMA 2023 330 1760 1768 10.1001/jama.2023.22231 37870871 PMC10594178 51 Potter NT Hurban P White MN Validation of a real‐time PCR‐based qualitative assay for the detection of methylated SEPT9 DNA in human plasma Clin Chem 2014 60 1183 1191 10.1373/clinchem.2013.221044 24938752 52 Chung DC Gray DM Singh H A cell‐free DNA blood‐based test for colorectal cancer screening New England Journal of Medicine 2024 390 973 983 10.1056/NEJMoa2304714 38477985 53 Kankanala VL Mukkamalla SKR Carcinoembryonic Antigen StatPearls Publishing 2024 35201700 54 Fisher DA Princic N Miller‐Wilson L‐A Adherence to fecal immunochemical test screening among adults at average risk for colorectal cancer Int J Colorectal Dis 2022 37 719 721 10.1007/s00384-021-04055-w 34729622 PMC8885483 55 Raymond V Foster G Hong Y S295 Implementation of Blood‐Based Colorectal Cancer Screening: real‐world clinical experience Official Journal of the American College of Gastroenterology | ACG 2023 118 S218 10.14309/01.ajg.0000950820.05087.2c 56 Connal S Cameron JM Sala A Liquid biopsies: the future of cancer early detection Journal of Translational Medicine 2023 21 118 10.1186/s12967-023-03960-8 36774504 PMC9922467 57 Chun J Kim J‐H Youn YH Park H Noninvasive testing for colorectal cancer screening: where are we now? Korean Society of Gastrointestinal Cancer 2023 11 85 92 10.52927/jdcr.2023.11.2.85 58 Hanna M Dey N Grady WM Emerging tests for noninvasive colorectal cancer screening Clinical Gastroenterology and Hepatology 2023 21 604 616 10.1016/j.cgh.2022.12.008 36539002 PMC9974876 59 Press Release Freenome Announces Topline Results for PREEMPT CRC® to Validate the First Version of its Blood‐Based Test for the Early Detection of Colorectal Cancer 2024 https://www.freenome.com/newsroom/freenome‐announces‐topline‐results‐for‐preempt‐crc‐to‐validate‐the‐first‐version‐of‐its‐blood‐based‐test‐for‐the‐early‐detection‐of‐colorectal‐cancer/ 60 Shaukat A Burke CA Chan AT Clinical validation of a circulating tumor DNA–based blood test to screen for colorectal cancer JAMA 2025 334 56 63 10.1001/jama.2025.7515 40455622 PMC12131177 61 Han YD Oh TJ Chung T‐H Early detection of colorectal cancer based on presence of methylated syndecan‐2 (SDC2) in stool DNA Clinical Epigenetics 2019 11 51 10.1186/s13148-019-0642-0 30876480 PMC6419806 62 Ciarloni L Ehrensberger SH Imaizumi N Development and clinical validation of a blood test based on 29‐gene expression for early detection of colorectal cancer Clinical Cancer Research 2016 22 4604 4611 10.1158/1078-0432.CCR-15-2057 27126992 63 Thomas D Rathinavel AK Radhakrishnan P Altered glycosylation in cancer: a promising target for biomarkers and therapeutics Biochim Biophys Acta Rev Cancer 2021 1875 188464 10.1016/j.bbcan.2020.188464 33157161 PMC7855613 64 Takakura D Ohashi S Kobayashi N Tokuhisa M Ichikawa Y Kawasaki N Targeted O‐glycoproteomics for the development of diagnostic markers for advanced colorectal cancer Front Oncol 2023 13 10.3389/fonc.2023.1104936 PMC9948623 36845686 65 Viode A van Zalm P Smolen KK A simple, time‐ and cost‐effective, high‐throughput depletion strategy for deep plasma proteomics Science Advances 2023 9 eadf9717 10.1126/sciadv.adf9717 36989362 PMC10058233 66 Eldjarn GH Ferkingstad E Lund SH Large‐scale plasma proteomics comparisons through genetics and disease associations Nature 2023 622 348 358 10.1038/s41586-023-06563-x 37794188 PMC10567571 67 Bhardwaj M Gies A Weigl K Evaluation and Validation of plasma proteins using two different protein detection methods for early detection of colorectal cancer Cancers 2019 11 1426 10.3390/cancers11101426 31557860 PMC6826652 68 Qian J Tikk K Werner S Biomarker discovery study of inflammatory proteins for colorectal cancer early detection demonstrated importance of screening setting validation Journal of Clinical Epidemiology 2018 104 24 34 10.1016/j.jclinepi.2018.07.016 30076979 69 Xu Y Ritchie SC Liang Y An atlas of genetic scores to predict multi‐omic traits Nature 2023 616 123 131 10.1038/s41586-023-05844-9 36991119 PMC10323211 70 Li H Vanarsa K Zhang T Comprehensive aptamer‐based screen of 1317 proteins uncovers improved stool protein markers of colorectal cancer J Gastroenterol 2021 56 659 672 10.1007/s00535-021-01795-y 34117903 71 Suhre K Venkataraman GR Guturu H Nanoparticle enrichment mass‐spectrometry proteomics identifies protein‐altering variants for precise pQTL mapping Nat Commun 2024 15 989 10.1038/s41467-024-45233-y 38307861 PMC10837160 72 Press Release Seer's Proteograph Platform Enables Unprecedented 20,000‐Sample Proteomics Study with Korea University to Develop AI‐Driven Diagnostics for Cancers in Young Adults | Seer, Inc https://investor.seer.bio/news‐releases/news‐release‐details/seers‐proteograph‐platform‐enables‐unprecedented‐20000‐sample 73 Sun J Zhao J Jiang F Identification of novel protein biomarkers and drug targets for colorectal cancer by integrating human plasma proteome with genome Genome Medicine 2023 15 75 10.1186/s13073-023-01229-9 37726845 PMC10508028 74 Sun X Shu X‐O Lan Q Prospective proteomic study identifies potential circulating protein biomarkers for colorectal cancer risk Cancers (Basel) 2022 14 3261 10.3390/cancers14133261 35805033 PMC9265260 75 Sun BB Chiou J Traylor M Plasma proteomic associations with genetics and health in the UK Biobank Nature 2023 622 329 338 10.1038/s41586-023-06592-6 37794186 PMC10567551 76 Liu C‐Y Huang T‐T Chen J‐L Significance of kynurenine 3‐monooxygenase expression in colorectal cancer Front Oncol 2021 11 620361 10.3389/fonc.2021.620361 33937026 PMC8085544 77 Cui W Guo M Liu D Gut microbial metabolite facilitates colorectal cancer development via ferroptosis inhibition Nat Cell Biol 2024 26 124 137 10.1038/s41556-023-01314-6 38168770 78 Cai J Sun L Gonzalez FJ Gut microbiota‐derived bile acids in intestinal immunity, inflammation, and tumorigenesis Cell Host & Microbe 2022 30 289 300 10.1016/j.chom.2022.02.004 35271802 PMC8923532 79 Bel'skaya LV Use of IR spectroscopy in cancer diagnosis. A review J Appl Spectrosc 2019 86 187 205 10.1007/s10812-019-00800-w 80 Paraskevaidi M Matthew BJ Holly BJ Clinical applications of infrared and Raman spectroscopy in the fields of cancer and infectious diseases Applied Spectroscopy Reviews 2021 56 804 868 10.1080/05704928.2021.1946076 81 Sala A Anderson DJ Brennan PM Biofluid diagnostics by FTIR spectroscopy: a platform technology for cancer detection Cancer Letters 2020 477 122 130 10.1016/j.canlet.2020.02.020 32112901 82 Dxcover Dxcover PANAROMIC Platform For Earlier Detection of Cancer 2024 https://www.dxcover.com/panaromic/ 83 Cameron JM Rinaldi C Butler HJ Stratifying brain tumour histological sub‐types: the application of ATR‐FTIR serum spectroscopy in secondary care Cancers (Basel). 2020 12 1710 10.3390/cancers12071710 32605100 PMC7408619 84 Sala A Cameron JM Jenkins CA Liquid biopsy for pancreatic cancer detection using infrared spectroscopy Cancers 2022 14 3048 10.3390/cancers14133048 35804820 PMC9264892 85 Cameron JM Sala A Antoniou G A spectroscopic liquid biopsy for the earlier detection of multiple cancer types Br J Cancer 2023 129 1658 1666 10.1038/s41416-023-02423-7 37717120 PMC10645969 ",
  "metadata": {
    "Title of this paper": "A spectroscopic liquid biopsy for the earlier detection of multiple cancer types",
    "Journal it was published in:": "Clinical and Translational Medicine",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12477549/"
  }
}