{
  "title": "Paper_291",
  "abstract": "pmc BMC Anesthesiol BMC Anesthesiol 11 bmcanes BMC Anesthesiology 1471-2253 BMC PMC12486637 PMC12486637.1 12486637 12486637 41034847 10.1186/s12871-025-03304-7 3304 1 Systematic Review Efficacy of paravertebral block on postoperative nausea and vomiting: a meta-analysis of randomized controlled trial Zeng Jinfang 1 Cao Qian 1 Hong Aonan 2 Gu Zhen 1 Jian Jinjin zjfjjj@126.com 3 Liang Xiao 9862023142@jiangnan.edu.cn 1 1 https://ror.org/02afcvw97 grid.260483.b 0000 0000 9530 8833 Department of Anesthesiology and Pain Medicine, Affiliated Wuxi Clinical College of Nantong University (Wuxi No. 2 People’s Hospital, Jiangnan University Medical Center), 2 https://ror.org/04523zj19 grid.410745.3 0000 0004 1765 1045 Department of Anesthesiology, Affiliated Hospital of Nanjing University of Chinese Medicine, Jiangsu Province Hospital of Chinese Medicine, 3 https://ror.org/02ar02c28 grid.459328.1 0000 0004 1758 9149 Department of Anesthesiology, Affiliated Hospital of Jiangnan University, 1 10 2025 2025 25 478165 474 24 9 2024 29 7 2025 01 10 2025 02 10 2025 03 10 2025 © The Author(s) 2025 2025 https://creativecommons.org/licenses/by-nc-nd/4.0/ Open Access http://creativecommons.org/licenses/by-nc-nd/4.0/ Background Postoperative nausea and vomiting (PONV) often occur after anesthesia and may cause dissatisfaction among patients. Occasionally, PONV may result in complications after surgery. Steering clear of PONV stands as a crucial and pertinent objective in anesthesia. The use of paravertebral block (PVB) offers potent pain relief in surgical interventions. Nonetheless, the evidence is inadequate to prove its benefits in treating nausea and vomiting. This meta-analysis aimed to calculate the impact of PVB on PONV. Methods A pair of autonomous investigators carried out investigations for randomized controlled trials (RCTs) across Embase, PubMed, and the Cochrane Central Register of Controlled Trials.We used Review Manager software for the meta-analysis. Results Twenty-three trials with 2955 patients were included in this meta-analysis. The results showed that PVB reduced postoperative nausea (risk difference (RD) = -0.18, 95% confidence interval (CI): -0.24 to -0.13) compared with no PVB. Compared to no PVB approaches, PVB significantly reduced opioid consumption, as evidenced by standardized mean difference (SMD) of -0.87 (95% CI: -1.63 to -0.11) for fentanyl, -1.48 (95% CI: -1.90 to -1.06) for sufentanil, and − 1.47 (95% CI: -2.27 to -0.68) for morphine. PVB could reduce the VAS rest at 0–2 h (SMD = -2.78, 95% CI: -4.20 to -1.36), at 4–6 h (SMD = -1.31, 95% CI: -1.90 to -0.72) and 24 h (SMD = -0.84, 95% CI: -1.16 to -0.52), shortened hospitalization (SMD = -0.74, 95% CI: -1.32 to -0.17), prolonged time to rescue analgesia (SMD = 5.79, 95% CI: 2.42 to 9.16) and reduced the incidence of pruritus (SMD = -0.05, 95% CI: -0.09 to -0.02). GRADE showed this meta-analysis to have moderate or low or very low confidence. Trial sequential analysis for mortality indicated sufficient sample size for a definitive judgment for lower incidence of nausea and vomiting . Conclusion This meta-analysis indicates that PVB could lower PONV occurrences.and its effectiveness might be affected by variables like the amount of local anesthetic used, and its concentration. Supplementary Information The online version contains supplementary material available at 10.1186/s12871-025-03304-7. Keywords Paravertebral block Meta-analysis Nausea Vomiting Science Popularization Work Creation Project of Wuxi Municipal Health Commission P202310 Liang Xiao pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement yes pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes issue-copyright-statement © BioMed Central Ltd., part of Springer Nature 2025 Introduction Postoperative nausea and vomiting (PONV) remains a prevalent and distressing complication following anesthesia, affecting 30–80% of surgical patients depending on risk factors [ 1 2 3 4 5 6 7 8 9 10 11 12 14 15 16 17 18 19 20 12 14 This meta-analysis addresses this gap by synthesizing data from 23 RCTs to quantify the impact of PVB on PONV incidence, with subgroup analyses to explore the influence of local anesthetic type, dosage, and operation type. Our systematic review and meta-analysis therefore aims to determine the overall effect of PVB on PONV incidence. These findings will provide evidence-based guidance for incorporating PVB into multimodal PONV prophylaxis strategies. Methods An extensive meta-analysis was conducted to assess the effects of PVB on PONV, adhering to the protocols outlined in the PRISMA statement. The registration number of the study in PROSPERO is CRD42023469347. In the context of a meta-analysis, obtaining ethical consent and obtaining patient approval is not mandatory. The primary outcome was the frequency of postoperative nausea (PON) or vomiting (POV). PON was defined as the presence of nausea, regardless of whether vomiting occurred. POV was defined as the occurrence of vomiting, regardless of nausea. In studies where PONV was reported as a composite outcome, we extracted the data as PON, as PONV includes patients with nausea, with or without vomiting. However, if a study reported only PON (nausea without vomiting), we did not substitute PONV data, as this would inaccurately include patients with vomiting. To assess the effects of antiemetics, a standard 24-hour timeframe was used, and for longer or shorter periods, the one nearest to the 24-hour mark was selected. Search approach and eligibility standards Z.J.F. and J.J.J. systematically searched PubMed, Embase, and the Cochrane Central Register of Controlled Trials from inception to January 13, 2025 using a comprehensive strategy combining (“paravertebral block” OR “paravertebral anesthesia” OR “paravertebral analgesia” OR PVB) for intervention terms, (“postoperative nausea and vomiting” OR PONV OR “nausea” OR “vomiting” OR “emesis”) for outcomes, and (“randomized controlled trial” OR RCT OR “randomly assigned”) for study design, with Boolean operators (AND/OR) and database-specific subject headings (e.g., MeSH in PubMed) applied without language restrictions, supplemented by manual searches of reference lists from identified articles, reviews, and case studies to ensure literature saturation. Research selection The investigation encompassed the author’s identity, year of publication, type/duration of anesthesia and surgery, types of interventions, instances of nausea/vomiting, and the overall patient count. Two authors (H.A.N. and L.X.) Articles were evaluated independently to determine their eligibility, and any disagreements were deliberated by every author. Inclusion criteria Studies were included if they met all eligibility criteria, stated as (1) population: adult patients (18 years or older) receiving surgery while under general anesthesia; (2) intervention: PVB with local anesthetics. (3) comparator: PVB with placebo or no treatment; (4) primary outcomes: frequency of nausea and vomiting; secondary outcomes: VAS, opioid use after surgery, duration of hospitalization, time to rescue analgesia and probability of pruritus; (5) types of studies: randomized controlled trials (RCTs). Exclusion criteria (1) Solely the registration number or abstract; (2) Absence of data; (3) Incorrect statistical evaluation; (4) Comparing PVB with other nerve blocks. Studies comparing PVB with other nerve blocks (e.g., epidural, erector spinae block) were excluded because (1) Primary objective: To isolate the specific effect of PVB vs. no regional anesthesia (avoiding confounding by alternative techniques). (2) Clinical relevance: Guidelines recommend evaluating new interventions against placebo/no treatment before head-to-head comparisons. (3) Heterogeneity: Technical variations (e.g., catheter vs. single-shot) and drug selection in other blocks would obscure PVB’s intrinsic antiemetic properties. Information extraction and evaluation of bias risk A pair of researchers (L.X. and G.Z) separately evaluated the quality of the study employing the Cochrane Collaboration’s bias risk instrument. Our assessment encompassed six distinct areas: selective reporting, partial result data, various biases, generation of random sequences, concealment of allocation, and the use of blind methods. Each category is categorized into high risk, low risk, or ambiguous risk. Discrepancy Resolution. Two independent reviewers (H.A.N. and L.X.) screened studies and assessed bias risk using the Cochrane Collaboration tool. Initial disagreements (e.g., eligibility criteria interpretation, bias judgment) were resolved through: Step 1: Re-examination of the original study and protocol. Step 2: Discussion with a third reviewer (Z.J.F.) for consensus. Quality analysis of evidence The overall reliability of the evidence was assessed through the Grading of Recommendations Assessment, Development and Evaluation (GRADE) system, utilizing the Guideline Development Tool.3.4.Quality of evidence. An evaluation was conducted to determine the likelihood of systematic (bias) and random errors, along with assessing the overall reliability of the evidence following the GRADE guidelines.Studies were categorized as extremely low, low, moderate, or high-caliber, depending on bias risk, result inconsistency, lack of precision, publication bias, and the extent of treatment impacts. GRADE Assessment Process. Step 1: Independent Ratings Two reviewers (Q.C. and Z.G.) independently graded evidence quality using the GRADEpro GDT tool, evaluating: Risk of bias, inconsistency, indirectness, imprecision, and publication bias for each outcome. Step 2: Discrepancy Resolution Initial disagreements (e.g., “moderate” vs. “low” rating due to imprecision thresholds) were resolved by: Re-examining original study data and GRADE handbook criteria. Consulting a third reviewer (X.L.) for arbitration if consensus was unmet. Trial sequential analysis The Trial Sequential Analysis (TSA) was conducted utilizing the version of Trial Sequential Analysis software. 0.9.5.10 beta [Computer program].The sufficiency of the patient count was evaluated, and TSA procedures were conducted to determine the need for additional research.The necessary size of the information, adjusted for diversity, was computed.The concept of diversity, which represents the rate of variation among trials, is calculated by summing the differences between trials with a predicted sampling error based on the required size of information. The TSA was implemented to maintain a steady 5% likelihood of a type I error, a standard for various meta-analyses and systematic reviews. The essential data size was also ascertained (including an alpha error of 5% and a β error of 20%). Persuasive evidence is likely when the trial’s sequential monitoring threshold is exceeded before achieving the required level of information, but if this threshold is maintained, the likelihood of proceeding with trials increases significantly. Outcome measures The Z-test served to ascertain the significance of the overall impact. A p-value less than 0.05 was deemed to hold statistical significance. The study employed a model based on random effects. To assess PVB’s effectiveness against nausea and vomiting, the combined risk difference (RD) was determined, considering factors like administration timing, type of surgery, local anesthetic type, bupivacaine and ropivacaine levels and dosages. To assess VAS, fentanyl, sufentanil, and morphine intake, hospital stay duration, pain relief time, and pruritus likelihood, the combined standardized mean difference (SMD) was employed, accompanied by a 95% confidence interval (CI). Analyses of subgroups were performed considering factors such as the local anesthetic type, dosage, concentration, surgical procedure, and duration of administration. Sensitivity analyses were employed to assess the strength of the findings, focusing solely on reevaluating data from studies with low and uncertain risks. Heterogeneity was assessed using I²statistics. Clinically meaningful thresholds were pre-defined: - Pain VAS: Reduction ≥ 1.3 points (0–10) or SMD ≥ 0.5 - Opioid use: Reduction ≥ 30% from control. Results Study selection The flow diagram (Fig. 1 12 16 21 38  Fig. 1 Flow diagram of the inclusion and exclusion process Study characteristic Among the studies considered, 23 trials [ 12 16 21 38 1  Table 1 General information of patients with incidence of postoperative nausea and vomiting Author Year Age Sex(Male/Female) Type of sugery Comparisons Time of administration Nausea Vomiting Total Abdallah, F. W. 2013 18–85 years 0/33 Breast tumor resection PVB Group 0.5% ropivacaine 125 mg Preoperatively 3 - 33 0/31 Control Group 0.9% saline 25 ml 12 - 31 Albi-Feldzer, A. 2021 18–85 years 0/178 0/174 Breast cancer surgery PVB Group 0.75% ropivacaine 0.35 ml/kg Preoperative 11 - 178 Control Group 0.9% saline 0.35 ml/kg 13 - 174 Amlong, C. 2015 > 18 years 26/23 Video-assisted thoracoscopic surgery PVB Group 0.5% bupivacaine 150 mg Prior to surgery 4 - 49 16/13 Control Group 0.9% saline 30 ml 12 - 29 Aufforth, R. 2012 - 0/337 Breast cancer surgery PVB Group 0.25% bupivacaine 60 mg 30 min prior to surgery 11 - 337 0/96 Control Group 0.9% saline 24 ml 4 - 96 Aydin, G 2018 18–75 years 5/25 Laparoscopic cholecystectomy PVB Group 0.5% bupivacaine 100 mg Before or after the operation 6 - 30 10/20 Control Group 0.9% saline 20 ml 14 - 30 Bhuvaneswari, V. 0.25%bupivacaine 2012 - 0/12 Mastectomy PVB Group 0.25% bupivacaine 0.3 ml/kg Before induction of general anaesthesia 0 - 12 0/12 Control Group 0.9% saline 0.3 ml/kg 1 - 12 Bhuvaneswari, V. 0.5%bupivacaine 2012 - 0/12 PVB Group 0.5% bupivacaine 0.3 ml/kg 0 - 12 0/12 Control Group 0.9% saline 0.3 ml/kg 1 - 12 Dongjie, Q. 2023 60-80years 59/44 Thoracoscopic lobectomy PVB Group 0.375% ropivacaine 75 mg After induction 32 - 103 67/38 Control Group 0.9% saline 20 ml 40 - 105 Fahy, A. S. 2014 > 18 years 0/232 Mastectomy PVB Group 0.5% bupivacaine 100 mg Before the operation 90 - 232 0/294 Control Group 0.9% saline 20 ml 167 - 294 Feng, M. 2022 18–80 years 51/35 Thoracoscopic lung adenocarcinoma surgery PVB Group 0.375% ropivacaine 75 mg Before induction of general anaesthesia 3 - 86 57/52 Control Group 0.9% saline 20 ml 13 - 109 Hadzic, A. 2006 18–70 years 22/2 Inguinal hernia Repair PVB Group 0.75% ropivacaine 187.5 mg Before induction of general anaesthesia 4 0 24 19/5 Control Group 0.9% saline 25 ml 10 1 24 Kairaluoma, P. M. 2004 - 0/30 Breast cancer PVB Group 0.5% bupivacaine 0.3 ml/kg Before anesthesia 10 - 30 0/30 Control Group 0.9% saline 0.3 ml/kg 17 - 30 Li, N. L. 2011 20–70 years 0/15 Breast surgery PVB Group 0.5% bupivacaine 100 mg After induction 1 - 15 0/25 Control Group 0.9% saline 20 ml 16 - 25 Ma, T. 2024 - 18/22 Video-assisted thoracic surgery PVB Group 0.25% ropivacaine 50 mg After induction 1 1 40 - 21/19 Control Group 0.9% saline 20 ml 12 8 40 Moussa, A. A. 2008 18–50 years 9/3 Right lobe donor hepatic resection PVB Group 0.25% bupivacaine 62.5 mg Before induction of general anesthesia - 3 12 10/2 Control Group 0.9% saline 25 ml - 7 12 Murat Yayik, A. 2020 18–65 years 11/9 Percutaneous nephrolithotomy PVB Group 0.25% bupivacaine 50 mg After the surgical operation ended 5 3 20 12/8 Control Group 0.9% saline 20 ml 6 5 20 Naja, M. Z. 2004 > 18 years 9/21 Laparoscopic cholecystectomy PVB Group 2%lidocaine 6 ml + 0.5%bupivacaine 5 ml + fentanyl 1 ml (50 microg/ml) and clonidine 2 ml (150 microg/ml) Before induction of general anesthesia 7 4 30 5/25 Control Group 0.9% saline 0.30 ml/kg 21 11 30 Okoye, N. U. 2022 18–65 years 0/30 Simple mastectomy PVB Group 0.5% bupivacaine 150 mg before anesthesia 0 2 30 0/29 Control Group 0.9% saline 30 ml 8 6 29 Qiu, Y. 2020 > 18 years 14/16 Video-assisted thoracoscopic surgery PVB Group 0.375% ropivacaine 112.5 mg After induction of 9 - 30 general anaesthesia 14/16 Control Group 0.9% saline 30 ml 15 - 30 Rao, F. 2021 18–60 years 0/34 Unilateral modified radical mastectomy PVB Group 0.5% ropivacaine 100 mg 30 min before the induction of anesthesia. 2 - 34 0/34 Control Group 0.9% saline 20 ml 8 - 34 Rivedal, D. D. 2018 - 0/55 Reduction mammaplasty PVB Group 0.5% bupivacaine 150 mg Preoperatively 8 - 55 0/209 Control Group 0.9% saline 30 ml 69 - 209 Xiong, Y. F. 2024 18–75 years 16/12 Transarterial chemoembolization and microwave ablation PVB Group 0.375% ropivacaine 150 mg Preoperatively 2 1 28 18/12 Control Group 0.9% saline 40 ml 8 5 30 Yan, Z. 2023 18–65 years 22/14 Unilateral percutaneous nephrolithotomy PVB Group 0.5% ropivacaine 100 mg 30 min before surgery 2 - 36 16/18 Control Group 0.9% saline 20 ml 9 - 34 Yin, G. 2024 18–70 years, 25/25 robot-assisted laparoscopic nephrectomy PVB Group 0.5% ropivacaine 0.3 ml/kg After anesthesia induction 3 2 50 26/24 Control Group 0.9% saline ml 0.3 ml/kg 9 6 50 The methodological quality of the included studies Twenty-three trials [ 12 16 21 38 12 15 16 21 24 28 30 35 37 13 14 27 32 34 25 26 24 30 12 15 22 28 12 16 21 38 12 16 21 38 12 16 21 38 2  Fig. 2 Summary of the risk of bias of the included studies Quality of evidence GRADE system grades of evidence showed that having a serious risk of bias. Bhuvaneswari, V.2012, Li, N. L.2011, Moussa, A. A. 2008, Murat Yayik, A.2017, Rao, F.2021, Rivedal, D. D.2018 lacked blinding. Seventeen studies lack allocation concealment. Three studies have a high risk of bias. With that total population size is less than 400. All studies were designed with randomized methods, the quality of efficacy of PVB on nausea was evaluated as moderate evidence. The quality of efficacy of PVB on need for rescue o analgesia, pruritus, VAS rest at 0–2 h, VAS rest at 24 h, VAS movement at 2 h, VAS movement at 24 h, duration in the hospital was also evaluated as moderate evidence, others was evaluated as low evidence. (Supplementary Table 3). Results of meta-analysis PVB on PONV A total of twenty-three [ 12 16 21 38 3 P P 4 1  Fig. 3 Results of the incidence of nausea and vomiting  Fig. 4 Results of the Begg’s test and Egger’s test Additionally, the elements influencing nausea and vomiting were assessed using the following subgroup analysis: Type of local anesthetic PVB markedly decreased nausea occurrences with ropivacaine as the local anesthetic (pooled RD of 11 trials [ 12 13 15 21 25 27 28 31 37 38 14 16 22 24 26 29 30 33 35 5  Fig. 5 Results of the type of local anesthetic Local anesthetic dosage PVB notably decreased nausea occurrences when ropivacaine was 100 mg or more(pooled RD of six trials [ 12 13 15 28 36 37 14 22 26 35 25 27 31 16 23 30 33 6 Local anesthetic concentration 12 13 15 25 27 31 36 38 14 22 24 26 29 30 34 35 16 24 33 21 28 6  Fig. 6 Results of local anesthetic dosage and concentration Operation type PVB markedly decreased nausea rates (pooled RD of ten trials [ 13 16 21 24 26 29 30 35 22 25 27 31 33 23 28 33 34 37 38 7  Fig. 7 Results of operation type Antiemetic efficacy outcomes No included studies reported rescue antiemetic use. However, we recognize its clinical importance and recommend its inclusion in future trials, as its absence limits real-world applicability. VAS rest at 0–2 h, 4–6 h, 24 h and 48 h PVB could reduce the VAS rest at 0–2 h (pooled SMD of five trials [ 12 13 25 32 33 25 33 34 36 12 22 25 33 34 36 12 25 34 36 2 VAS movement at 2 h and 24 h PVB could reduce the VAS movement at 2 h (pooled SMD of three trials [ 12 13 33 12 22 33 34 3 Consumption of fentanyl, sufentanil and morphine PVB could reduce the consumption of fentanyl (pooled SMD of four trials [ 24 29 31 33 4 12 25 27 36 4 15 21 26 32 35 4 Duration of hospitalization, time to rescue analgesia and probability of pruritus PVB could reduce the duration of hospitalization (pooled SMD of four trials [ 15 27 31 34 15 30 32 35 13 27 31 33 35 37 5 Trial sequential analysis TSA was conducted on nausea and vomiting and usage data from all twenty-three randomized controlled trials, encompassing 2995 patients. The estimated size of the information, modified for necessary diversity, aims to address a 5% chance of type I error and a 20% chance of type II error. The aggregate Z curve crossed the boundaries of both futility and monitoring prior to attaining the informational magnitude, signifying solid proof of PVB’s substantial superior ity over the control group in alleviating nausea and vomiting (Fig. 8  Fig. 8 A Trial sequential analysis for nausea and vomiting Discussion The main findings were as follows: (1) The incidence of nausea and vomiting was lower in patients receiving PVB, though heterogeneity in nausea outcomes (I²=79%) warrants caution. (2) PVB reduced the incidence of nausea in all surgery type. (3) PVB reduced the incidence of nausea with concentration ≤ 0.5% of ropivacaine and bupivacaine dosage > 100 mg and concentration was 0.5%. (4) PVB could reduce the VAS rest at 0–2 h, at 4–6 h, and 24 h, but not at 48 h. PVB could reduce the VAS movement at 2 h and 24 h. (5) PVB could reduce the consumption of fentanyl, sufentanil and morphine. (6) PVB could reduce the duration of hospitalization, prolong the time to rescue analgesia and reduce the probability of pruritus. Clinically, these findings suggest PVB may be most beneficial in breast and thoracic surgeries. Our analysis shows PVB significant reduces both morphine use (−47%, SMD − 1.47) and early postoperative pain (VAS − 2.78 points at 0–2 h). These exceed established clinical thresholds (30% opioid reduction, 1.3-point VAS improvement, confirming PVB’s dual benefit for enhanced recovery. The effects diminish by 48 h, suggesting need for prolonged techniques. PONV remains a significant clinical challenge, affecting 30–80% of surgical patients depending on risk factors [ 1 2 3 4 39 Opioids effectively manage surgical pain but can cause side effects like dizziness, PONV, and respiratory depression [ 40 41 42 43 45 46 47 48 PVB reduces opioid use and related complications, aiding bowel recovery, minimizing PONV, and accelerating recovery [ 49 50 51 Our study found higher ropivacaine concentrations (> 0.5%) reduced PVB’s antiemetic efficacy [ 52 53 Current guidelines identify key PONV risk factors including female gender, postoperative opioids, non-smoking status, and history of motion sickness [ 3 54 34 35 Although rescue antiemetic requirement is an important outcome, it was not consistently reported across the included studies, precluding its inclusion in our quantitative analysis. Future studies should aim to standardize the reporting of this outcome to facilitate more comprehensive meta-analyses. The substantial heterogeneity in nausea outcomes (I²= 79%) likely reflects variations in PVB techniques (e.g., local anesthetic type, concentration) and surgical contexts. For instance, subgroup analyses indicated greater PONV reduction with ropivacaine ≤ 0.5% and bupivacaine > 100 mg at 0.5%, but these findings are exploratory due to limited studies in subgroups like urological surgeries. While heterogeneity complicates definitive conclusions, it underscores the need for standardized protocols in future research. Potential publication bias was identified via Begg’s ( P P PVB may reduce PONV through several proposed mechanisms. One possibility is that by alleviating postoperative pain, PVB helps decrease PONV associated with surgical trauma and psychological distress, though the extent of this relationship remains uncertain [ 55 56 57 58 Limitations and suggestions for practice The meta-analysis presented multiple limitations. The primary constraint of the research lies in the absence of sensory examinations to identify the specific block region that could ascertain the precise extent of the block’s pain-relieving impact. The initiation of sensory blockage by the TPVB wasn’t evaluated, leaving the precise length of pain relief offered by TPVB indeterminable. Secondly, there was a lack of standardization in the antiemetic and opioid treatments administered to patients. Improved antiemetic treatments, like ondansetron or a mix of therapies, might have contributed to lowering the occurrence of nausea and vomiting. Thirdly, the applicability of our findings might be constrained, given that the fundamental state of our population was comparatively robust. Fourth, the use of binary dose classifications (< 100 mg vs. ≥ 100 mg), while clinically practical, may have oversimplified more complex dose-response relationships. The available data did not permit continuous dose-response modeling due to [heterogeneous dosing regimens in included studies/small sample size per dose stratum]. Future prospective trials should systematically evaluate graded dose effects. Additionally, our subgroup analyses (e.g., by surgical type or local anesthetic dose/type) provide clinically useful insights, their interpretation requires caution. Several subgroups (notably urological surgeries and ropivacaine doses < 100 mg) included fewer than five trials, increasing the risk of Type II errors. These findings should therefore be considered exploratory and confirmed in larger, adequately powered studies. While excluding studies comparing PVB to other blocks strengthened internal validity, it limits direct applicability to clinical scenarios where multiple regional options exist. Future network meta-analyses could rank PVB against alternatives. Last, according to the GRADE system, the certainty of our findings ranked very low across different outcomes, the main limiting factors that contribute to the low quality included the serious risk of bias. Conclusion and recommendations In conclusion, this meta-analysis suggests that PVB may be associated with a reduction in PONV incidence, particularly in breast and thoracic surgeries, potentially through opioid-sparing and analgesic effects. However, given the substantial heterogeneity and the low GRADE quality of evidence, these findings should be interpreted with caution. The potential benefits of PVB in PONV prevention require further high-quality, well-designed studies to confirm its efficacy, clarify underlying mechanisms, and assess its applicability across diverse surgical populations. Supplementary Information Supplementary Material 1: Supplementary Fig.1 Results of the trim-and-fill test Supplementary Material 2: Supplementary Fig. 2. Results of VAS rest at 0–2 h(A), 4–6 h(B), 24 h(C) and 48 h (D) Supplementary Material 3: Supplementary Fig. 3. Results of VAS movement at 2 h(A) and 24 h(B) Supplementary Material 4: Supplementary Fig. 4. Results of the consumption of fentanyl(A), sufentanil(B) and morphine(C) Supplementary Material 5: Supplementary Fig. 5. Results of the duration of hospitalization(A), time to rescue analgesia (B)and probability of pruritus (C) Supplementary Material 6 Supplementary Material 7 Supplementary Material 8: Supplementary Table 3. GRADE summary of efficacy of paravertebral block Supplementary Material 9 Abbreviations PONV Postoperative nausea and vomiting PVB paravertebral block RCTs randomized controlled trials PACU Post-anesthetic care unit Publisher’s Note Springer Nature remains neutral with regard to jurisdictional claims in published maps and institutional affiliations. Jinfang Zeng and Qian Cao contributed equally to this work. Acknowledgements This study was supported by funds from Guiding Project of Qinghai Provincial Health Commission (2023-wjzdx-99), Science Popularization Work Creation Project of Wuxi Municipal Health Commission (P202310) and Jiangsu Province Program of Science and Technology of Administration of Traditional Chinese Medicine (ZYKJ202011). Authors’ contributions L.X. designed and supervised the study. Z.J.f. performed all database searches. C.Q. and G.Z. extracted the data. H.A.N. and J.J.J. conducted qualitative analysis. All authors participated in manuscript writing, contributed to critical comments, and revised the manuscript. Funding Not applicable. Data availability Data is provided within the manuscript or supplementary information files. Declarations Ethics approval and consent to participate The article is following ethical standards. Consent for publication Not applicable. Competing interests The authors declare no competing interests. References 1. Chen L He W Liu X Lv F Li Y Application of opioid-free general anesthesia for gynecological laparoscopic surgery under ERAS protocol: a non-inferiority randomized controlled trial BMC Anesthesiol 2023 23 1 34 10.1186/s12871-023-01994-5 36707777 PMC9881250 Chen L, He W, Liu X, Lv F, Li Y. Application of opioid-free general anesthesia for gynecological laparoscopic surgery under ERAS protocol: a non-inferiority randomized controlled trial. BMC Anesthesiol. 2023;23(1):34. 10.1186/s12871-023-01994-5. 36707777 10.1186/s12871-023-01994-5 PMC9881250 2. Kranke P Meybohm P Diemunsch P Eberhart LHJ Risk-adapted strategy or universal multimodal approach for PONV prophylaxis? Best Pract Res Clin Anaesthesiol 2020 34 4 721 34 10.1016/j.bpa.2020.05.003 33288122 Kranke P, Meybohm P, Diemunsch P, Eberhart LHJ. Risk-adapted strategy or universal multimodal approach for PONV prophylaxis? Best Pract Res Clin Anaesthesiol. 2020;34(4):721–34. 33288122 10.1016/j.bpa.2020.05.003 3. Rajan N Joshi GP Management of postoperative nausea and vomiting in adults: current controversies Curr Opin Anaesthesiol 2021 34 6 695 702 10.1097/ACO.0000000000001063 34560688 Rajan N, Joshi GP. Management of postoperative nausea and vomiting in adults: current controversies. Curr Opin Anaesthesiol. 2021;34(6):695–702. 34560688 10.1097/ACO.0000000000001063 4. Meyer TA Hutson LR Jr Morris PM McAllister RK A postoperative nausea and vomiting update: current information on new drugs, old drugs, rescue/treatment, combination therapies and nontraditional modalities Adv Anesth 2023 41 1 17 38 10.1016/j.aan.2023.05.002 38251617 Meyer TA, Hutson LR Jr., Morris PM, McAllister RK. A postoperative nausea and vomiting update: current information on new drugs, old drugs, rescue/treatment, combination therapies and nontraditional modalities. Adv Anesth. 2023;41(1):17–38. 38251617 10.1016/j.aan.2023.05.002 5. Moore CC Bledsoe LTR Bonds CR Keller M King CH Preventing postoperative nausea and vomiting during an ondansetron shortage Aana J 2021 89 2 161 7 33832577 Moore CC, Bledsoe LTR, Bonds CR, Keller M, King CH. Preventing postoperative nausea and vomiting during an ondansetron shortage. Aana J. 2021;89(2):161–7. 33832577 6. Elvir-Lazo OL, White PF, Yumul R, Cruz Eng H. Management strategies for the treatment and prevention of postoperative/postdischarge nausea and vomiting: an updated review. F1000Res . 10.12688/f1000research.21832.1 PMC7429924 32913634 7. Xu ZZ Li X Zhang Z Liu ZY Song LL Li XY Zhang H Ultrasound-guided erector spinae plane block versus thoracic paravertebral block on postoperative analgesia after laparoscopic nephroureterectomy: study protocol of a randomized, double-blinded, non-inferiority design trial Trials 2021 22 1 249 10.1186/s13063-021-05173-0 33823924 PMC8022408 Xu ZZ, Li X, Zhang Z, Liu ZY, Song LL, Li XY, Zhang H. Ultrasound-guided erector spinae plane block versus thoracic paravertebral block on postoperative analgesia after laparoscopic nephroureterectomy: study protocol of a randomized, double-blinded, non-inferiority design trial. Trials. 2021;22(1):249. 33823924 10.1186/s13063-021-05173-0 PMC8022408 8. Ben Aziz M, Mukhdomi J. Thoracic Paravertebral Block. In: StatPearls [Internet]. Treasure Island (FL): StatPearls Publishing; 2025. 34033322 9. Shelley B Goebel A Grant S Jackson L Jarrett H Jepson M Kerr A Marczin N Mehta R Melody T Study protocol for a randomised controlled trial to investigate the effectiveness of thoracic epidural and paravertebral blockade in reducing chronic post-thoracotomy pain: 2 (TOPIC 2) Trials 2023 24 1 748 10.1186/s13063-023-07463-1 37996898 PMC10666334 Shelley B, Goebel A, Grant S, Jackson L, Jarrett H, Jepson M, Kerr A, Marczin N, Mehta R, Melody T, et al. Study protocol for a randomised controlled trial to investigate the effectiveness of thoracic epidural and paravertebral blockade in reducing chronic post-thoracotomy pain: 2 (TOPIC 2). Trials. 2023;24(1):748. 37996898 10.1186/s13063-023-07463-1 PMC10666334 10. Wittayapairoj A Sinthuchao N Somintara O Thincheelong V Somdee W A randomized double-blind controlled study comparing erector spinae plane block and thoracic paravertebral block for postoperative analgesia after breast surgery Anesth Pain Med 2022 17 4 445 53 10.17085/apm.22157 PMC9663954 36317438 Wittayapairoj A, Sinthuchao N, Somintara O, Thincheelong V, Somdee W. A randomized double-blind controlled study comparing erector spinae plane block and thoracic paravertebral block for postoperative analgesia after breast surgery. Anesth Pain Med. 2022;17(4):445–53. 10.17085/apm.22157 PMC9663954 36317438 11. Heesen M Klimek M Rossaint R Imberger G Straube S Paravertebral block and persistent postoperative pain after breast surgery: meta-analysis and trial sequential analysis Anaesthesia 2016 71 12 1471 81 10.1111/anae.13649 27714754 Heesen M, Klimek M, Rossaint R, Imberger G, Straube S. Paravertebral block and persistent postoperative pain after breast surgery: meta-analysis and trial sequential analysis. Anaesthesia. 2016;71(12):1471–81. 27714754 10.1111/anae.13649 12. Qiu Y, Wu J, Huang Q, Lu Y, Xu M, Mascha EJ, Yang D, Ince I, Sessler DI. Acute pain after serratus anterior plane or thoracic paravertebral blocks for video-assisted thoracoscopic surgery: a noninferiority randomised trial. Eur J Anaesthesiol. 2021;38 (Suppl 2):S97–105. 10.1097/EJA.0000000000001450 34170884 13. Rao F Wang Z Chen X Liu L Qian B Guo Y Ultrasound-guided thoracic paravertebral block enhances the quality of recovery after modified radical mastectomy: a randomized controlled trial J Pain Res 2021 14 2563 70 10.2147/JPR.S325627 34456586 PMC8385420 Rao F, Wang Z, Chen X, Liu L, Qian B, Guo Y. Ultrasound-guided thoracic paravertebral block enhances the quality of recovery after modified radical mastectomy: a randomized controlled trial. J Pain Res. 2021;14:2563–70. 34456586 10.2147/JPR.S325627 PMC8385420 14. Rivedal DD Nayar HS Israel JS Leverson G Schulz AJ Chambers T Afifi AM Blake JM Poore SO Paravertebral block associated with decreased opioid use and less nausea and vomiting after reduction mammaplasty J Surg Res 2018 228 307 13 10.1016/j.jss.2018.03.018 29907226 Rivedal DD, Nayar HS, Israel JS, Leverson G, Schulz AJ, Chambers T, Afifi AM, Blake JM, Poore SO. Paravertebral block associated with decreased opioid use and less nausea and vomiting after reduction mammaplasty. J Surg Res. 2018;228:307–13. 29907226 10.1016/j.jss.2018.03.018 15. Abdallah FW Morgan PJ Cil T McNaught A Escallon JM Semple JL Wu W Chan VW Ultrasound-guided multilevel paravertebral blocks and total intravenous anesthesia improve the quality of recovery after ambulatory breast tumor resection Anesthesiology 2014 120 3 703 13 10.1097/ALN.0000436117.52143.bc 24071616 Abdallah FW, Morgan PJ, Cil T, McNaught A, Escallon JM, Semple JL, Wu W, Chan VW. Ultrasound-guided multilevel paravertebral blocks and total intravenous anesthesia improve the quality of recovery after ambulatory breast tumor resection. Anesthesiology. 2014;120(3):703–13. 24071616 10.1097/ALN.0000436117.52143.bc 16. Aufforth R Jain J Morreale J Baumgarten R Falk J Wesen C Paravertebral blocks in breast cancer surgery: is there a difference in postoperative pain, nausea, and vomiting? Ann Surg Oncol 2012 19 2 548 52 10.1245/s10434-011-1899-5 21769470 Aufforth R, Jain J, Morreale J, Baumgarten R, Falk J, Wesen C. Paravertebral blocks in breast cancer surgery: is there a difference in postoperative pain, nausea, and vomiting? Ann Surg Oncol. 2012;19(2):548–52. 21769470 10.1245/s10434-011-1899-5 17. Wang Q Wei S Li S Yu J Zhang G Ni C Sun L Zheng H Comparison of the analgesic effect of ultrasound-guided paravertebral block and ultrasound-guided retrolaminar block in uniportal video-assisted thoracoscopic surgery: a prospective, randomized study BMC Cancer 2021 21 1 1229 10.1186/s12885-021-08938-7 34784889 PMC8594110 Wang Q, Wei S, Li S, Yu J, Zhang G, Ni C, Sun L, Zheng H. Comparison of the analgesic effect of ultrasound-guided paravertebral block and ultrasound-guided retrolaminar block in uniportal video-assisted thoracoscopic surgery: a prospective, randomized study. BMC Cancer. 2021;21(1):1229. 34784889 10.1186/s12885-021-08938-7 PMC8594110 18. Xu M Zhang G Gong J Yang J Comparison of erector spinae plane and paravertebral nerve blocks for postoperative analgesia in children after the Nuss procedure: study protocol for a randomized controlled non-inferiority clinical trial Trials 2022 23 1 139 10.1186/s13063-022-06044-y 35164831 PMC8842927 Xu M, Zhang G, Gong J, Yang J. Comparison of erector spinae plane and paravertebral nerve blocks for postoperative analgesia in children after the Nuss procedure: study protocol for a randomized controlled non-inferiority clinical trial. Trials. 2022;23(1):139. 35164831 10.1186/s13063-022-06044-y PMC8842927 19. Sabouri AS Crawford L Bick SK Nozari A Anderson TA Is a retrolaminar approach to the thoracic paravertebral space possible?? A human cadaveric study Reg Anesth Pain Med 2018 43 8 864 8 29923954 10.1097/AAP.0000000000000828 Sabouri AS, Crawford L, Bick SK, Nozari A, Anderson TA. Is a retrolaminar approach to the thoracic paravertebral space possible?? A human cadaveric study. Reg Anesth Pain Med. 2018;43(8):864–8. 29923954 10.1097/AAP.0000000000000828 20. Frohm RM Raw RM Haider N Boezaart AP Epidural spread after continuous cervical paravertebral block: a case report Reg Anesth Pain Med 2006 31 3 279 81 16701196 10.1016/j.rapm.2005.02.010 Frohm RM, Raw RM, Haider N, Boezaart AP. Epidural spread after continuous cervical paravertebral block: a case report. Reg Anesth Pain Med. 2006;31(3):279–81. 16701196 10.1016/j.rapm.2005.02.010 21. Albi-Feldzer A Dureau S Ghimouz A Raft J Soubirou JL Gayraud G Jayr C Preoperative paravertebral block and chronic pain after breast cancer surgery: a double-blind randomized trial Anesthesiology 2021 135 6 1091 103 10.1097/ALN.0000000000003989 34618889 Albi-Feldzer A, Dureau S, Ghimouz A, Raft J, Soubirou JL, Gayraud G, Jayr C. Preoperative paravertebral block and chronic pain after breast cancer surgery: a double-blind randomized trial. Anesthesiology. 2021;135(6):1091–103. 34618889 10.1097/ALN.0000000000003989 22. Amlong C Guy M Schroeder KM Donnelly MJ Out-of-plane ultrasound-guided paravertebral blocks improve analgesic outcomes in patients undergoing video-assisted thoracoscopic surgery Locoregional Anesth 2015 8 123 8 10.2147/LRA.S86853 PMC4694661 26730208 Amlong C, Guy M, Schroeder KM, Donnelly MJ. Out-of-plane ultrasound-guided paravertebral blocks improve analgesic outcomes in patients undergoing video-assisted thoracoscopic surgery. Locoregional Anesth. 2015;8:123–8. 10.2147/LRA.S86853 PMC4694661 26730208 23. Aydin G, Aydin O. The efficacy of ultrasound-guided paravertebral block in laparoscopic cholecystectomy. Medicina (Kaunas). 2018;54(5):75. 10.3390/medicina54050075 PMC6262619 30360531 24. Bhuvaneswari V Wig J Mathew PJ Singh G Post-operative pain and analgesic requirements after paravertebral block for mastectomy: a randomized controlled trial of different concentrations of bupivacaine and fentanyl Indian J Anaesth 2012 56 1 34 9 10.4103/0019-5049.93341 22529417 PMC3327067 Bhuvaneswari V, Wig J, Mathew PJ, Singh G. Post-operative pain and analgesic requirements after paravertebral block for mastectomy: a randomized controlled trial of different concentrations of bupivacaine and fentanyl. Indian J Anaesth. 2012;56(1):34–9. 22529417 10.4103/0019-5049.93341 PMC3327067 25. Dongjie Q Longbiao Z Peng L Li J Hongmeng X Zhiyan C Long Y Effects of thoracic paravertebral nerve block on postoperative pain and postoperative delirium in elderly patients undergoing thoracoscopic lobectomy Medicine (Baltimore) 2023 102 8 e32907 10.1097/MD.0000000000032907 36827015 PMC11309621 Dongjie Q, Longbiao Z, Peng L, Li J, Hongmeng X, Zhiyan C, Long Y. Effects of thoracic paravertebral nerve block on postoperative pain and postoperative delirium in elderly patients undergoing thoracoscopic lobectomy. Medicine (Baltimore). 2023;102(8):e32907. 36827015 10.1097/MD.0000000000032907 PMC11309621 26. Fahy AS Boughey JC Eldin NS Dy B Harmsen WS Sviggum H Jakub JW Paravertebral block in patients undergoing mastectomy - improves pain control and decreases postoperative nausea and vomiting Ann Surg Oncol 2014 21 47 8 10.1245/s10434-014-3923-z 25034821 Fahy AS, Boughey JC, Eldin NS, Dy B, Harmsen WS, Sviggum H, Jakub JW. Paravertebral block in patients undergoing mastectomy - improves pain control and decreases postoperative nausea and vomiting. Ann Surg Oncol. 2014;21:47–8. 10.1245/s10434-014-3923-z 25034821 27. Feng M Wang L Sun J Chen Z Fu J Liu D Zhang R Li Y Zhang Y Zhang H Thoracic paravertebral block combined with general anaesthesia or general anaesthesia alone for thoracoscopic lung adenocarcinoma surgery: A retrospective study Cancer Manage Res 2022 14 953 65 10.2147/CMAR.S346285 PMC8901418 35264885 Feng M, Wang L, Sun J, Chen Z, Fu J, Liu D, Zhang R, Li Y, Zhang Y, Zhang H, et al. Thoracic paravertebral block combined with general anaesthesia or general anaesthesia alone for thoracoscopic lung adenocarcinoma surgery: A retrospective study. Cancer Manage Res. 2022;14:953–65. 10.2147/CMAR.S346285 PMC8901418 35264885 28. Hadzic A Kerimoglu B Loreio D Karaca PE Claudio RE Yufa M Wedderburn R Santos AC Thys DM Paravertebral blocks provide superior same-day recovery over general anesthesia for patients undergoing inguinal hernia repair Anesth Analg 2006 102 4 1076 81 10.1213/01.ane.0000196532.56221.f2 16551902 Hadzic A, Kerimoglu B, Loreio D, Karaca PE, Claudio RE, Yufa M, Wedderburn R, Santos AC, Thys DM. Paravertebral blocks provide superior same-day recovery over general anesthesia for patients undergoing inguinal hernia repair. Anesth Analg. 2006;102(4):1076–81. 16551902 10.1213/01.ane.0000196532.56221.f2 29. Kairaluoma PM Bachmann MS Korpinen AK Rosenberg PH Pere PJ Single-injection paravertebral block before general anesthesia enhances analgesia after breast cancer surgery with and without associated lymph node biopsy Anesth Analg 2004 99 6 1837 43 10.1213/01.ANE.0000136775.15566.87 15562083 Kairaluoma PM, Bachmann MS, Korpinen AK, Rosenberg PH, Pere PJ. Single-injection paravertebral block before general anesthesia enhances analgesia after breast cancer surgery with and without associated lymph node biopsy. Anesth Analg. 2004;99(6):1837–43. 15562083 10.1213/01.ANE.0000136775.15566.87 30. Li NL Yu BL Tseng SC Hsu CC Lai WJ Hsieh PF Peng WL Chen CM The effect on improvement of recovery and pain scores of paravertebral block immediately before breast surgery Acta Anaesthesiol Taiwan 2011 49 3 91 5 10.1016/j.aat.2011.08.006 21982169 Li NL, Yu BL, Tseng SC, Hsu CC, Lai WJ, Hsieh PF, Peng WL, Chen CM. The effect on improvement of recovery and pain scores of paravertebral block immediately before breast surgery. Acta Anaesthesiol Taiwan. 2011;49(3):91–5. 21982169 10.1016/j.aat.2011.08.006 31. Ma T Yu Y Cao H Wang H Wang M Effect of intermittent thoracic paravertebral block on postoperative nausea and vomiting following thoracoscopic radical resection of the lung cancer: a prospective randomized trial J Pain Res 2024 17 931 9 10.2147/JPR.S453615 38469556 PMC10926915 Ma T, Yu Y, Cao H, Wang H, Wang M. Effect of intermittent thoracic paravertebral block on postoperative nausea and vomiting following thoracoscopic radical resection of the lung cancer: a prospective randomized trial. J Pain Res. 2024;17:931–9. 38469556 10.2147/JPR.S453615 PMC10926915 32. Moussa AA Opioid saving strategy: bilateral single-site thoracic paravertebral block in right lobe donor hepatectomy Middle East J Anaesthesiol 2008 19 4 789 801 18630766 Moussa AA. Opioid saving strategy: bilateral single-site thoracic paravertebral block in right lobe donor hepatectomy. Middle East J Anaesthesiol. 2008;19(4):789–801. 18630766 33. Yayik AM, Ahiskalioglu A, Demirdogen SO, Ahiskalioglu EO, Alici HA, Kursad H. Ultrasound-guided low thoracic paravertebral block versus peritubal infiltration for percutaneous nephrolithotomy: a prospective randomized study. Urolithiasis. 2020;48(3):235–44. 10.1007/s00240-018-01106-w 30564847 34. Naja MZ Ziade MF Lönnqvist PA General anaesthesia combined with bilateral paravertebral blockade (T5-6) vs. general anaesthesia for laparoscopic cholecystectomy: a prospective, randomized clinical trial Eur J Anaesthesiol 2004 21 6 489 95 15248630 10.1017/s026502150400612x Naja MZ, Ziade MF, Lönnqvist PA. General anaesthesia combined with bilateral paravertebral blockade (T5-6) vs. general anaesthesia for laparoscopic cholecystectomy: a prospective, randomized clinical trial. Eur J Anaesthesiol. 2004;21(6):489–95. 15248630 10.1017/s026502150400612x 35. Okoye NU Majekodunmi AA Ilori IU Analgesic and opioid sparing effects of preoperative thoracic paravertebral block: a double blind evaluation of 0.5% bupivacaine with adrenaline in patients scheduled for simple mastectomy Niger Postgrad Med J 2021 28 2 102 7 10.4103/npmj.npmj_460_21 34494595 Okoye NU, Majekodunmi AA, Ilori IU. Analgesic and opioid sparing effects of preoperative thoracic paravertebral block: a double blind evaluation of 0.5% bupivacaine with adrenaline in patients scheduled for simple mastectomy. Niger Postgrad Med J. 2021;28(2):102–7. 34494595 10.4103/npmj.npmj_460_21 36. Xiong YF Wei BZ Wang YF Li XF Liu C Paravertebral block’s effect on analgesia and inflammation in advanced gastric cancer patients undergoing transarterial chemoembolization and microwave ablation World J Gastrointest Surg 2024 16 1 196 204 10.4240/wjgs.v16.i1.196 38328336 PMC10845272 Xiong YF, Wei BZ, Wang YF, Li XF, Liu C. Paravertebral block’s effect on analgesia and inflammation in advanced gastric cancer patients undergoing transarterial chemoembolization and microwave ablation. World J Gastrointest Surg. 2024;16(1):196–204. 38328336 10.4240/wjgs.v16.i1.196 PMC10845272 37. Yan Z Lin H Yang Y Yang J Li X Yao Y Efficacy of ultrasound-guided thoracic paravertebral block on postoperative quality of recovery in patients undergoing percutaneous nephrolithotomy: a randomized double-blind placebo-controlled trial J Pain Res 2023 16 1301 10 10.2147/JPR.S405657 37155532 PMC10122848 Yan Z, Lin H, Yang Y, Yang J, Li X, Yao Y. Efficacy of ultrasound-guided thoracic paravertebral block on postoperative quality of recovery in patients undergoing percutaneous nephrolithotomy: a randomized double-blind placebo-controlled trial. J Pain Res. 2023;16:1301–10. 37155532 10.2147/JPR.S405657 PMC10122848 38. Yin G, Li Y, Wei P, Ma X, Li B, Gan G, Song X. Analgesic effect of the ultrasound-guided thoracolumbar paravertebral block in patients undergoing robot-assisted laparoscopic nephrectomy: a randomized controlled trial. BMC Anesthesiol. 2024;24(1):69. 10.1186/s12871-024-02460-6 PMC10882795 38388893 39. Qasemi F Aini T Ali W Dost W Rasully MQ Anwari M Dost W Zaheer R Dost R Talpur AS The effectiveness of ondansetron and dexamethasone in preventing postoperative nausea and vomiting after laparoscopic cholecystectomy Cureus 2023 15 4 e37419 37181978 10.7759/cureus.37419 PMC10174678 Qasemi F, Aini T, Ali W, Dost W, Rasully MQ, Anwari M, Dost W, Zaheer R, Dost R, Talpur AS. The effectiveness of ondansetron and dexamethasone in preventing postoperative nausea and vomiting after laparoscopic cholecystectomy. Cureus. 2023;15(4):e37419. 37181978 10.7759/cureus.37419 PMC10174678 40. He ZJ Kangjie KJ Huang ZX Fang J [Effect of reducing-opioids consumption on postoperative delirium incidence in elderly patients after gastric cancer surgery] Zhonghua Yi Xue Za Zhi 2022 102 5 326 31 35092972 10.3760/cma.j.cn112137-20210901-01989 He ZJ, Kangjie KJ, Huang ZX, Fang J. [Effect of reducing-opioids consumption on postoperative delirium incidence in elderly patients after gastric cancer surgery]. Zhonghua Yi Xue Za Zhi. 2022;102(5):326–31. 35092972 10.3760/cma.j.cn112137-20210901-01989 41. Yuan D Zou Z Li X Cheng N Guo N Sun G Liu D A new side-effect of sufentanil: increased monocyte-endothelial adhesion BMC Anesthesiol 2021 21 1 267 10.1186/s12871-021-01487-3 34732147 PMC8565079 Yuan D, Zou Z, Li X, Cheng N, Guo N, Sun G, Liu D. A new side-effect of sufentanil: increased monocyte-endothelial adhesion. BMC Anesthesiol. 2021;21(1):267. 34732147 10.1186/s12871-021-01487-3 PMC8565079 42. Slinchenkova K Lee K Choudhury S Sundarapandiyan D Gritsenko K A review of the paravertebral block: benefits and complications Curr Pain Headache Rep 2023 27 8 203 8 10.1007/s11916-023-01118-1 37294514 Slinchenkova K, Lee K, Choudhury S, Sundarapandiyan D, Gritsenko K. A review of the paravertebral block: benefits and complications. Curr Pain Headache Rep. 2023;27(8):203–8. 37294514 10.1007/s11916-023-01118-1 43. Jiang M Huang W Yang Y Liang Y Li C Wang L Liu T Xu C Paravertebral block under direct vision versus local anesthetic infiltration for pediatric thoracoscopic surgery Journal of Laparoendoscopic & Advanced Surgical Techniques 2023 33 8 814 20 10.1089/lap.2022.0431 37163293 Jiang M, Huang W, Yang Y, Liang Y, Li C, Wang L, Liu T, Xu C. Paravertebral block under direct vision versus local anesthetic infiltration for pediatric thoracoscopic surgery. Journal of Laparoendoscopic & Advanced Surgical Techniques. 2023;33(8):814–20. 37163293 10.1089/lap.2022.0431 44. Sagun A Rumeli S Ozdemir L Azizoglu M Berkesoglu M Mutlu V Intraoperative pectoral block versus thoracic paravertebral block for postoperative analgesia after breast cancer surgery: a randomized controlled trial J Surg Oncol 2022 126 3 425 32 10.1002/jso.26914 35536730 Sagun A, Rumeli S, Ozdemir L, Azizoglu M, Berkesoglu M, Mutlu V. Intraoperative pectoral block versus thoracic paravertebral block for postoperative analgesia after breast cancer surgery: a randomized controlled trial. J Surg Oncol. 2022;126(3):425–32. 35536730 10.1002/jso.26914 45. D’Ercole F Arora H Kumar PA Paravertebral block for thoracic surgery J Cardiothorac Vasc Anesth 2018 32 2 915 27 10.1053/j.jvca.2017.10.003 29169795 D’Ercole F, Arora H, Kumar PA. Paravertebral block for thoracic surgery. J Cardiothorac Vasc Anesth. 2018;32(2):915–27. 29169795 10.1053/j.jvca.2017.10.003 46. Chen Q Yang H Zhao D Tang X Liu H Anesthetic spread of Ultrasound-Guided paraspinal blocks in Video-Assisted thoracoscopic surgery: A Three-Dimensional reconstruction image study Pain Physician 2023 26 4 E383 7 10.36076/ppj.2023.26.E383 37535785 Chen Q, Yang H, Zhao D, Tang X, Liu H. Anesthetic spread of Ultrasound-Guided paraspinal blocks in Video-Assisted thoracoscopic surgery: A Three-Dimensional reconstruction image study. Pain Physician. 2023;26(4):E383–7. 37535785 47. Richardson J Jones J Atkinson R The effect of thoracic paravertebral blockade on intercostal somatosensory evoked potentials Anesth Analg 1998 87 2 373 6 10.1213/00000539-199808000-00025 9706933 Richardson J, Jones J, Atkinson R. The effect of thoracic paravertebral blockade on intercostal somatosensory evoked potentials. Anesth Analg. 1998;87(2):373–6. 9706933 10.1097/00000539-199808000-00025 48. Ozonur VA Salviz EA Sivrikoz N Kozanoglu E Karaali S Gokduman HC Polat H Emekli U Tugrul MK Orhan-Sungur M Single and double injection paravertebral block comparison in reduction mammaplasty cases: a randomized controlled study Anesth Pain Med 2023 18 4 421 30 10.17085/apm.23029 PMC10635849 37919926 Ozonur VA, Salviz EA, Sivrikoz N, Kozanoglu E, Karaali S, Gokduman HC, Polat H, Emekli U, Tugrul MK, Orhan-Sungur M. Single and double injection paravertebral block comparison in reduction mammaplasty cases: a randomized controlled study. Anesth Pain Med. 2023;18(4):421–30. 10.17085/apm.23029 PMC10635849 37919926 49. Wang Y Shi M Huang S He X Gu X Ma Z Ultrasound-guided serratus anterior plane block versus paravertebral block on postoperation analgesia and safety following the video-assisted thoracic surgery: a prospective, randomized, double-blinded non-inferiority clinical trial Asian J Surg 2023 46 10 4215 21 10.1016/j.asjsur.2022.11.125 36517403 Wang Y, Shi M, Huang S, He X, Gu X, Ma Z. Ultrasound-guided serratus anterior plane block versus paravertebral block on postoperation analgesia and safety following the video-assisted thoracic surgery: a prospective, randomized, double-blinded non-inferiority clinical trial. Asian J Surg. 2023;46(10):4215–21. 36517403 10.1016/j.asjsur.2022.11.125 50. Aoyama Y Sakura S Tsuchiya R Wittayapairoj A Saito Y Erector spinae plane block and paravertebral block for breast surgery: a retrospective propensity-matched noninferiority trial J Pain Res 2020 13 2367 76 10.2147/JPR.S265015 33061552 PMC7520143 Aoyama Y, Sakura S, Tsuchiya R, Wittayapairoj A, Saito Y. Erector spinae plane block and paravertebral block for breast surgery: a retrospective propensity-matched noninferiority trial. J Pain Res. 2020;13:2367–76. 33061552 10.2147/JPR.S265015 PMC7520143 51. Zhang L Hu Y Liu H Qi X Chen H Cao W Wang L Zhang Y Wu Y Analgesic efficacy of combined thoracic paravertebral block and erector spinae plane block for video-assisted thoracic surgery: a prospective randomized clinical trial Med Sci Monitor: Int Med J Experimental Clin Res 2023 29 e940247 10.12659/MSM.940247 PMC10334846 37408302 Zhang L, Hu Y, Liu H, Qi X, Chen H, Cao W, Wang L, Zhang Y, Wu Y. Analgesic efficacy of combined thoracic paravertebral block and erector spinae plane block for video-assisted thoracic surgery: a prospective randomized clinical trial. Med Sci Monitor: Int Med J Experimental Clin Res. 2023;29: e940247. 10.12659/MSM.940247 PMC10334846 37408302 52. Xu D, Luo W. Effect of ropivacaine combined with small doses of triamcinolone and continuous nerve block of unilateral paravertebral canal guided by ultrasound on metastasis after radical treatment of lung cancer. J Oncol. 2022;2022:6310081. 10.1155/2022/6310081 PMC9259295 35813861 53. Suljević I Šurković I Turan M Bajraktarević A Mušija E Suljević O Clinical effects of hyperbaric lidocaine and bupivacaine in spinal anesthesia - our experience Acta Clin Croat 2022 61 Suppl 2 22 7 36824625 10.20471/acc.2022.61.s2.03 PMC9942473 Suljević I, Šurković I, Turan M, Bajraktarević A, Mušija E, Suljević O. Clinical effects of hyperbaric lidocaine and bupivacaine in spinal anesthesia - our experience. Acta Clin Croat. 2022;61(Suppl 2):22–7. 36824625 10.20471/acc.2022.61.s2.03 PMC9942473 54. Kienbaum P Schaefer MS Weibel S Schlesinger T Meybohm P Eberhart LH Kranke P [Update on PONV-What is new in prophylaxis and treatment of postoperative nausea and vomiting? Summary of recent consensus recommendations and Cochrane reviews on prophylaxis and treatment of postoperative nausea and vomiting] Anaesthesist 2022 71 2 123 8 10.1007/s00101-021-01045-z 34596699 Kienbaum P, Schaefer MS, Weibel S, Schlesinger T, Meybohm P, Eberhart LH, Kranke P. [Update on PONV-What is new in prophylaxis and treatment of postoperative nausea and vomiting? Summary of recent consensus recommendations and Cochrane reviews on prophylaxis and treatment of postoperative nausea and vomiting]. Anaesthesist. 2022;71(2):123–8. 34596699 10.1007/s00101-021-01045-z 55. Schlesinger T Meybohm P Kranke P Postoperative nausea and vomiting: risk factors, prediction tools, and algorithms Curr Opin Anaesthesiol 2023 36 1 117 23 10.1097/ACO.0000000000001220 36550611 Schlesinger T, Meybohm P, Kranke P. Postoperative nausea and vomiting: risk factors, prediction tools, and algorithms. Curr Opin Anaesthesiol. 2023;36(1):117–23. 36550611 10.1097/ACO.0000000000001220 56. Imam MZ Kuo A Ghassabian S Smith MT Progress in understanding mechanisms of opioid-induced gastrointestinal adverse effects and respiratory depression Neuropharmacology 2018 131 238 55 10.1016/j.neuropharm.2017.12.032 29273520 Imam MZ, Kuo A, Ghassabian S, Smith MT. Progress in understanding mechanisms of opioid-induced gastrointestinal adverse effects and respiratory depression. Neuropharmacology. 2018;131:238–55. 29273520 10.1016/j.neuropharm.2017.12.032 57. Bansal P Saxena KN Taneja B Sareen B A comparative randomized study of paravertebral block versus wound infiltration of bupivacaine in modified radical mastectomy J Anaesthesiol Clin Pharmacol 2012 28 1 76 80 10.4103/0970-9185.92449 22345951 PMC3275978 Bansal P, Saxena KN, Taneja B, Sareen B. A comparative randomized study of paravertebral block versus wound infiltration of bupivacaine in modified radical mastectomy. J Anaesthesiol Clin Pharmacol. 2012;28(1):76–80. 22345951 10.4103/0970-9185.92449 PMC3275978 58. Khanna SS Mohammed Abdul MS Fatima U Garlapati H Qayyum MA Gulia SK Role of general anesthetic agents in postoperative nausea and vomiting: a review of literature Natl J Maxillofac Surg 2022 13 2 190 4 10.4103/njms.NJMS_146_20 36051800 PMC9426712 Khanna SS, Mohammed Abdul MS, Fatima U, Garlapati H, Qayyum MA, Gulia SK. Role of general anesthetic agents in postoperative nausea and vomiting: a review of literature. Natl J Maxillofac Surg. 2022;13(2):190–4. 36051800 10.4103/njms.NJMS_146_20 PMC9426712 ",
  "metadata": {
    "Title of this paper": "Role of general anesthetic agents in postoperative nausea and vomiting: a review of literature",
    "Journal it was published in:": "BMC Anesthesiology",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12486637/"
  }
}