{
  "title": "Paper_843",
  "abstract": "pmc J Cancer Res Clin Oncol J Cancer Res Clin Oncol 4687 jcrco Journal of Cancer Research and Clinical Oncology 0171-5216 1432-1335 Springer PMC12476334 PMC12476334.1 12476334 12476334 41014426 10.1007/s00432-025-06336-1 6336 1 Research Management of hepatotoxicity associated with CDK4/6 inhibitors and rechallenge strategies in metastatic hormone-positive, HER2-negative breast cancer İlhan Nurullah nurullahilhan07@gmail.com 1 Baş Süleyman 2 Alkan Onur 3 Doğan Akif 1 Majidova Nargiz 4 Tunç Mustafa Alperen 5 Erdemoğlu Engin 6 Öztosun Buğra 7 Ökten İlker Nihat 3 Gümüş Mahmut 3 1 https://ror.org/03k7bde87 grid.488643.5 0000 0004 5894 3909 Department of Medical Oncology, Health Sciences University, Sancaktepe Şehit Prof. Dr. İlhan Varank Training and Research Hospital, 2 https://ror.org/03k7bde87 grid.488643.5 0000 0004 5894 3909 Department of Internal Medicine, Health Sciences University, Sancaktepe Şehit Prof. Dr. İlhan Varank Training and Research Hospital, 3 https://ror.org/05j1qpr59 grid.411776.2 0000 0004 0454 921X Department of Medical Oncology, Faculty of Medicine, Istanbul Medeniyet University, 4 5 https://ror.org/02kswqa67 grid.16477.33 0000 0001 0668 8422 Department of Medical Oncology, Faculty of Medicine, Marmara University, 6 7 27 9 2025 10 2025 151 10 496926 270 27 4 2025 18 9 2025 27 09 2025 29 09 2025 29 09 2025 © The Author(s) 2025 2025 https://creativecommons.org/licenses/by-nc-nd/4.0/ Open Access http://creativecommons.org/licenses/by-nc-nd/4.0/ Background Cyclin-dependent kinase 4/6 (CDK4/6) inhibitors combined with endocrine therapy have significantly improved clinical outcomes in patients with hormone receptor-positive, human epidermal growth factor receptor 2-negative (HR + /HER2−) metastatic breast cancer. Hepatotoxicity is a known class-related adverse event that may interrupt or modify treatment. However, real-world evidence on its incidence, risk factors, and management strategies—particularly rechallenge approaches—remains limited. This study aimed to evaluate the frequency and clinical characteristics of CDK4/6 inhibitor-associated hepatotoxicity, to identify risk factors, and to assess the outcomes and safety of rechallenge following liver injury. Methods This retrospective multicenter study included 544 patients with HR+ /HER2− metastatic breast cancer who were treated with ribociclib or palbociclib between January 2017 and July 2024 in oncology centers across Turkey. Abemaciclib was not included due to reimbursement limitations during the study period. Patient characteristics, comorbidities, concomitant medications, and herbal or dietary supplement use were recorded. Liver function tests and viral hepatitis serologies were analyzed. Hepatotoxicity was graded using the Common Terminology Criteria for Adverse Events (CTCAE v5.0), and causality was assessed with the Roussel Uclaf Causality Assessment Method (RUCAM). Management strategies—including dose interruption, dose reduction, switching to another CDK4/6 inhibitor, and outcomes of rechallenge were evaluated. Results Hepatotoxicity occurred in 10.5% of patients, most commonly in a hepatocellular pattern. Ribociclib was the most frequently used agent. Younger age, herbal supplement use, and hepatitis B carrier status were significantly associated with increased risk of hepatotoxicity. All hepatotoxic events were managed conservatively. None of the patients developed acute liver failure or required invasive evaluation . Conclusion CDK4/6 inhibitor-related hepatotoxicity is manageable with careful monitoring and individualized strategies. Timely dose interruption, switching agents, or cautious rechallenge allowed most patients to resume therapy safely. These findings support the continued use of CDK4/6 inhibitors in eligible patients, even after hepatotoxicity events. Keywords CDK4/6 inhibitors Palbociclib Ribociclib Hepatotoxicity Rechallenge Metastatic breast cancer pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement no pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes issue-copyright-statement © Springer-Verlag GmbH Germany, part of Springer Nature 2025 Introduction Breast cancer is the most commonly diagnosed malignancy among women worldwide and remains a significant cause of cancer-related morbidity and mortality (Siegel et al. 2022 2023 2018 2017 2016 2020 2018 2018 2018 2018 2021 2025 2021 Aithal et al. 2011 2010 2010 2019 Hypertransaminasemia is a recognized adverse effect of ribociclib and abemaciclib, prompting regulatory agencies to recommend routine liver function monitoring (Lin et al. 2024 2019 2018 2021 2021 2021 2018 2025 2024 Materials and methods We collected patient data from electronic medical records and archived patient files across participating oncology centers. Collected variables included demographic characteristics, comorbidities, baseline liver function, concomitant medications, and prior treatment exposures. Patients who developed CDK4/6 inhibitor-induced hepatotoxicity were identified, and their clinical course, laboratory trends, management strategies (dose adjustment, interruption, or discontinuation), and treatment outcomes were analyzed. In addition, the safety and efficacy of sequential CDK4/6 inhibitor administration were assessed in cases where treatment was discontinued due to hepatotoxicity. Specifically, rechallenge approaches (e.g., dose reduction or switching agents) and recurrence rates of hepatotoxicity were evaluated to determine treatment feasibility and tolerability in a real-world, multicenter setting. Study design and population This retrospective, multicenter study evaluated the clinical and biochemical characteristics of liver toxicity associated with CDK4/6 inhibitors in patients with HR+/HER2− metastatic breast cancer. Patients who were monitored and treated at multiple oncology centers across Turkey between January 2017 and July 2024 were included in the analysis. CDK4/6 inhibitor treatment Due to national reimbursement regulations in Turkey, abemaciclib is not used for HR+/HER2− disease. Consequently, none of the patients in this study received abemaciclib. All patients were treated with ribociclib or palbociclib or received both agents sequentially during therapy. Data collection Demographic characteristics, ECOG performance status, comorbidities, concomitant medications, metastatic disease features, type of endocrine therapy used, type and duration of CDK4/6 inhibitor treatment, and laboratory parameters (including liver function tests) were retrospectively collected from electronic medical records or archived files. Ethical approval Ethical approval for this study was obtained from the Ethics Committee of Sancaktepe Şehit Prof. Dr. İlhan Varank Training and Research Hospital (Decision No: 300, Date: 18.09.2024). The study was conducted in accordance with the 1964 Declaration of Helsinki and its later amendments. As this was a retrospective study using fully anonymized patient data with no identifiable information collected or stored, the requirement for written informed consent was waived by the Ethics Committee. Definition of hepatotoxicity Liver injury was defined as ALT or AST ≥5× ULN, ALP ≥2× ULN, or total bilirubin ≥2× ULN with ALT ≥3× ULN relative to baseline (Food and Administration 2009 2019 2010 Statistical analysis Statistical analyses were performed using IBM SPSS Statistics version 25.0 (IBM Corp., Armonk, NY, USA). Descriptive statistical methods (mean, standard deviation, median, interquartile range, frequency, and percentage) were used to evaluate the study data. The normality of distribution for continuous variables was assessed using the Kolmogorov-Smirnov and Shapiro-Wilk tests. Variables with a normal distribution were expressed as mean ± standard deviation, while non-normally distributed variables were presented as median [interquartile range, IQR]. For comparisons between two groups, the Independent t-test was used for normally distributed variables, and the Mann-Whitney U test was applied for non-normally distributed variables. Categorical variables were compared using the Chi-square test or Fisher’s Exact test, as appropriate. A p Results The cohort consisted of 544 patients diagnosed with metastatic hormone receptor-positive, HER2-negative breast cancer. The vast majority were female, comprising 99.1% (n = 539), while 0.9% (n = 5) were male. The mean age at CDK4/6 inhibitor initiation was 57.99 ± 13.18 years. Baseline ECOG performance status was 0 in 55.5% (n = 302), 1 in 32.9% (n = 179), 2 in 11.0% (n = 60), and 3 in 0.6% (n = 3). Ribociclib was the most commonly used agent (57.4%, n = 312), followed by palbociclib (42.6%, n = 232). CDK4/6 inhibitors were used as first-line therapy in 65.3% (n = 355), second-line in 20.0% (n = 109), and third-line or beyond in 14.7% (n = 80). Letrozole was the most commonly combined endocrine agent (63.4%, n = 345), followed by fulvestrant (29.4%, n = 160), and other agents (7.2%, n = 39). Prior chemotherapy was administered in the adjuvant setting in 36.4% (n = 198), metastatic setting in 16.5% (n = 90), and both in 11.0% (n = 60); 36.0% (n = 196) had no prior chemotherapy. Comorbidities were present in 25.7% of patients (n = 140), with the most common being hypertension (11.9%), diabetes mellitus (7.9%), hypothyroidism (3.9%), and dyslipidemia (2.6%). No cases of autoimmune hepatitis were observed. Regarding viral hepatitis, 0.6% (n = 3) had chronic hepatitis B managed with antiviral therapy, and 0.7% (n = 4) were inactive carriers; no hepatitis C cases were recorded. The median follow-up duration was 582.50 [358–906.75] days (Table 1 Table 1 Demographic and clinical characteristics of HR+/HER2− metastatic breast cancer treated with CDK4/6 inhibitors Characteristic Category/value Patients (n  =  544) Sex (Female) 539 (99.1%) Age at initiation of CDK4/6 inhibitor therapy (years), mean ± SD 57.99 ± 13.18 ECOG performance status before therapy 0 302 (55.5%) 1 179 (32.9%) 2 60 (11%) 3 3 (0.6%) CDK4/6 Inhibitor used as first-line treatment Palbociclib 232 (42.6%) Ribociclib 312 (57.4%) Line of CDK4/6 inhibitor treatment 1 355 (65.3%) 2 109 (20%) ≥ 3 80 (14.7%) Endocrine therapy combined with CDK4/6 inhibitor Letrozole 345 (63.4%) Fulvestrant 160 (29.4%) Others 39 (7.2%) Chemotherapy status before CDK4/6 therapy Adjuvant chemotherapy 198 (36.4%) Metastatic chemotherapy 90 (16.5%) Adjuvant + metastatic chemotherapy 60 (11%) No chemotherapy 196 (36%) Metastatic sites before CDK4/6 therapy Liver metastasis 127 (23.3%) Visceral metastasis 304 (55.9%) Herbal and dietary supplement use 3 (0.6%) Comorbidities 140 (25.7%) Diabetes 43 (7.9%) Dyslipidemia 14 (2.6%) Hypertension 65 (11.9%) Hypothyroidism 21 (3.9%) Autoimmune hepatitis 0 (0%) Viral hepatitis Hepatitis B 3 (0.6%) Inactive carrier 4 (0.7%) Hepatitis C 0 No viral hepatitis 537 (98.7%) Follow-up period (days), Median [IQR] 582.50 [358 – 906.75] Summary ECOG, Eastern Cooperative Oncology Group; IQR, interquartile range; CDK4/6, cyclin-dependent kinase 4/6 inhibitor, HR+, hormone receptor positive, HER2− , human epidermal growth factor receptor 2 negative The sex distribution was similar between the two groups, with females comprising the vast majority (99.1% vs. 99%, p p p p p p 2 Table 2 Patient characteristics by CDK4/6 inhibitor type in HR+/HER2− metastatic breast cancer Characteristic Palbociclib (n = 232) Ribociclib (n = 312) p Sex (Female) 230 (99.1%) 309 (99%) 1.000 a Age at initiation of CDK4/6i therapy (years), Mean ± SD 60.72 ± 13.38 55.96 ± 12.67 < 0.001 b , ECOG Performance Status before therapy < 0.001 c , 0 108 (46.6%) 194 (62.2%) k 1 85 (36.6%) 94 (30.1%) 2 36 (15.5%) l 3 3 (1.3%) 0 (0%) Line of CDK4/6 inhibitor treatment 0.993 c 1 152 (65.5%) 203 (65.1%) 2 46 (19.8%) 63 (20.2%) ≥ 3 34 (14.7%) 46 (14.7%) Endocrine therapy combined with CDK4/6i 0.465 c Letrozole 150 (64.7%) 195 (62.5%) Fulvestrant 69 (29.7%) 91 (29.2%) Others 13 (5.6%) 26 (8.3%) Metastatic sites before CDK4/6i therapy Liver metastasis 58 (25%) 69 (22.1%) 0.432 c Visceral metastasis 136 (58.6%) 168 (53.8%) 0.267 c Hepatotoxicity 19 (8.2%) 38 (12.2%) 0.132 c Follow-up period (days), Median [IQR] 573.50 [379.75–887.25] 589.50 [335.25–914.25] 0.965 d Summary p ECOG, Eastern Cooperative Oncology Group; IQR, interquartile range; CDK4/6, cyclin-dependent kinase 4/6 inhibitor, HR + , hormone receptor positive, HER2 − , human epidermal growth factor receptor 2 negative a b c d k,l *Values in bold indicate statistical significance ( p Hepatotoxicity was observed more frequently in the ribociclib group (12.2%) than in the palbociclib group (8.2%), though this difference was not statistically significant ( p p 2 A total of 57 patients (100% female) developed CDK4/6 inhibitor-associated hepatotoxicity. Ribociclib was the predominant agent (66.6%), followed by palbociclib (33.3%). The median time to onset of hepatotoxicity was 83 days [33–322.5] days. Liver metastases were present in 26.3% and visceral metastases in 52.6%. Letrozole was the most frequently co-administered endocrine agent (84.2%), while fulvestrant use was less common (10.5%) (Table 3 Table 3 Comparison of clinical characteristics with and without CDK4/6i-induced hepatotoxicity Hepatotoxicity (n = 57) No hepatotoxicity (n = 487) p Demographic and clinical features Sex (Female) 57 (100%) 482 (99%) 1.000 a Age at CDK4/6-i treatment (years), Mean ± SD 54.14 ± 12.55 58.44 ± 13.19 0.020 b , ECOG performance status (before therapy) 0.400 c 0 28 (49.1%) 274 (56.3%) 1 23 (40.4%) 156 (32%) 2 5 (8.8%) 55 (11.3%) 3 1 (1.8%) 2 (0.4%) CDK4/6 inhibitor used 0.132 c Palbociclib 19 (33.3%) 213 (43.7%) Ribociclib 38 (66.6%) 274 (56.3%) Line of CDK4/6 treatment 0.051 c 1st line 45 (78.9%) 310 (63.7%) 2nd line 6 (10.5%) 103 (21.1%) 3rd line or later 6 (10.5%) 74 (15.2%) Endocrine therapy used with CDK4/6 inhibitors 0.001 c , * Letrozole 48 (84.2%) 297 (61%) Fulvestrant 6 (10.5%) 154 (31.6%) Others 3 (5.3%) 36 (7.4%) Chemotherapy status (before CDK4/6-i therapy) 0.004 c , Adjuvant chemotherapy 18 (31.6%) 180 (37%) Metastatic chemotherapy 4 (7%) 86 (17.7%) Adjuvant + metastatic chemotherapy 3 (5.3%) 57 (11.7%) No Chemotherapy 32 (56.1%) 164 (33.7%) Viral hepatitis status 0.045 c , * Hepatitis B 2 (3.5%) 1 (0.2%) Inactive carrier 1 (1.8%) 3 (0.6%) Hepatitis C 0 0 None 54 (94.7%) 483 (99.2%) Herbal and dietary supplements 3 (5.3%) 0 (0%) 0.001 a , Hepatotoxicity-specific details Time to DILI (days), Median [IQR] 83 [33–322.5] – – Clinical presentation Asymptomatic 47 (82.5%) – – Nausea/Asthenia 8 (14%) – – Pruritus 1 (1.8%) – – Jaundice 1 (1.8%) – – Laboratory findings at onset of hepatitis, median [IQR] ALT (U/L) 95 [58.5–158.5] – – AST (U/L) 73 [44–118.5] – – ALP (U/L) 116 [77.5–175] – – GGT (U/L) 50 [34–189.5] – – Direct Bilirubin (mg/dL) 0.30 [0.20–0.45] – – Total Bilirubin (mg/dL) 0.66 [0.50–0.96] – – Laboratory findings at peak of hepatitis, median [IQR] ALT (U/L) 150 [76.5–248.5] – – AST (U/L) 103 [63.5–185.5] – – GGT (U/L) 67 [38–263] – – Direct Bilirubin (mg/dL) 0.30 [0.23–0.56] – – Total Bilirubin (mg/dL) 0.70 [0.53–1.27] – – Hepatitis pattern Hepatocellular 43 (75.4%) – – Mixed 11 (19.3%) – – Cholestatic 3 (5.3%) – – RUCAM Score, Median [IQR] 5 [4–7.50] Corticosteroid Treatment 8 (14%) – – Corticosteroid Duration (days), Mean ± SD 73.5 ± 22.7 – – Hepatotoxicity grade Grade 1 27 (47.4%) – – Grade 2 5 (8.8%) – – Grade 3 19 (33.3%) – – Grade 4 6 (10.5%) – – Summary p p p p p p ECOG, Eastern Cooperative Oncology Group; IQR, interquartile range; CDK4/6, cyclin-dependent kinase 4/6 inhibitor; ALT, alanine aminotransferase; AST, aspartate aminotransferase; ALP, alkaline phosphatase; GGT, gamma-glutamyl transferase; IQR, interquartile range; RUCAM, Roussel Uclaf Causality Assessment Method a b c *Values in bold indicate statistical significance ( p Most patients (82.5%) were asymptomatic at diagnosis, while nausea/asthenia (14%), pruritus (1.8%), and jaundice (1.8%) were infrequent. No cases of autoimmune hepatitis occurred, and liver biopsy was not performed. Herbal or dietary supplement use was documented in 3 patients, all of whom developed hepatotoxicity that resolved after discontinuing these agents (Table 3 The predominant biochemical pattern was hepatocellular (75.4%), followed by mixed (19.3%) and cholestatic (5.3%). Median peak ALT and AST were 150 [76.5-248.5] U/L and 103 [63.5–185.5] U/L, respectively, with only mild bilirubin elevations (Table 3 Corticosteroids were administered to 14% of patients (n = 8), primarily for Grade ≥3 hepatotoxicity or suspected immune-mediated mechanisms, with a mean duration of 73.5 ± 22.7 days. According to CTCAE v5.0, hepatotoxicity grades were: Grade 1 (47.4%), Grade 2 (8.8%), Grade 3 (33.3%), and Grade 4 (10.5%). Median RUCAM score was 5 [4–7.50] (Table 3 Rechallenge was attempted in 19.3% of patients (n = 11) after enzyme normalization, with only one recurrence (1.8%) and 10 patients tolerating retreatment successfully. Comparative analysis showed that patients with hepatotoxicity were younger (54.1 ± 12.6 vs. 58.4 ± 13.2 years; p p p 3 Hepatitis B infection was significantly higher in the hepatotoxicity group (3.5% vs. 0.2%; p p 3 Among the 57 patients with CDK4/6 inhibitor-induced liver injury, 14% (n = 8) received corticosteroids, all for Grade ≥3 hepatotoxicity. Ribociclib was the sole agent in the corticosteroid-treated group (100%), whereas 61.2% of the non-corticosteroid group received ribociclib and 38.8% received palbociclib ( p p p p p 4  Table 4 Characteristics of patients with CDK4/6 inhibitor-induced liver injury according to corticosteroid treatment Without corticosteroids (n = 49) With corticosteroids (n = 8) p Age at CDK4/6-i Treatment (years), Mean ± SD 53.47 ± 13.04 58.25 ± 8.53 0.323 a CDK4/6 inhibitor 0.042 b , Palbociclib 19 (38.8%) 0 (0%) Ribociclib 30 (61.2%) 8 (100%) Metastatic sites before therapy Liver metastasis 11 (22.4%) 4 (50%) 0.188 b Visceral metastasis 26 (53.1%) 4 (50%) 1.000 b Endocrine therapy used with CDK4/6-i 0.621 c Letrozole 41 (83.7%) 7 (87.5%) Fulvestrant 5 (10.2%) 1 (12.5%) Others 3 (6.1%) 0 (0%) Time anti-CDK4/6 to DILI (days), Median [IQR] 84 [39–361] 45.5 [12.25–149.25] 0.096 d Clinical presentation 0.855 c Asymptomatic 40 (81.6%) 7 (87.5%) Nausea/Asthenia 7 (14.3%) 1 (12.5%) Pruritus 1 (2%) 0 (0%) Jaundice 1 (2%) 0 (0%) Hepatitis pattern 0.591 c Hepatocellular 37 (75.5%) 6 (75%) Mixed 9 (18.4%) 2 (25%) Cholestatic 3 (6.1%) 0 (0%) Laboratory findings at onset of hepatitis, median [IQR] ALT (U/L) 88 [52–158] 144 [66–207.25] 0.329 d AST (U/L) 73 [43–109.5] 73.5 [54.5–194] 0.364 d ALP (U/L) 114 [67.5–155.5] 148 [83–227] 0.312 d GGT (U/L) 50 [28.5–220] 56.5 [42–82.5] 0.765 d Direct Bilirubin (mg/dL) 0.30 [0.20–0.40] 0.30 [0.30–0.50] 0.350 d Total Bilirubin (mg/dL) 0.66 [0.48–0.90] 0.76 [0.50–1.20] 0.565 d Laboratory findings at peak of hepatitis, median [IQR] ALT (U/L) 125 [73.5–219] 583.5 [563.5–672]  < 0.001 d , * AST (U/L) 96 [54–137] 376 [317–678]  < 0.001 d , * GGT (U/L) 58 [36–301.5] 94 [68.25–136] 0.513 d Direct Bilirubin (mg/dL) 0.30 [0.20–0.51] 0.40 [0.30–0.70] 0.290 d - Total Bilirubin (mg/dL) 0.70 [0.53–1.16] 1.04 [0.52–1.53] 0.534 d Hepatotoxicity Grade  < 0.001 c , * Grade 1 27 (55.1%) 0 (0%) Grade 2 5 (10.2%) 0 (0%) Grade 3 17 (34.7%) 2 (25%) Grade 4 0 (0%) 6 (75%) RUCAM Score, Median [IQR] 4 [3.5–6] 10 [9.25–12.75]  < 0.001 d , * Grouping based on RUCAM scoring  < 0.001 b , * Group 1 (RUCAM > 8) 3 (6.1%) 7 (87.5%) Group 2 (RUCAM 6–8) 11 (22.4%) 1 (12.5%) Group 3 (RUCAM 3–5) 35 (71.4%) 0 (0%) Hepatotoxicity after CDK4/6 inhibitor switch (ribociclib to palbociclib) 0.145 c Yes 1 (2%) 0 (0%) No 10 (20.4%) 0 (0%) No rechallenge 38 (77.6%) 8 (100%) Summary p ECOG, Eastern Cooperative Oncology Group; IQR, interquartile range; CDK4/6, cyclin-dependent kinase 4/6 inhibitor; ALT, alanine aminotransferase; AST, aspartate aminotransferase; ALP, alkaline phosphatase; GGT, gamma-glutamyl transferase; IQR, interquartile range; RUCAM, Roussel Uclaf Causality Assessment Method a b c d *Values in bold indicate statistical significance ( p Among these patients, CDK4/6 inhibitor therapy was continued without interruption but with dose reduction in 32 cases: 13 (22.8%) received palbociclib and 19 (33.3%) received ribociclib.A total of 11 patients (19.3%) were switched from ribociclib to palbociclib as a rechallenge strategy. In 14 patients (24.6%), treatment was temporarily interrupted and subsequently restarted with the same CDK4/6 inhibitor at a reduced dose: 8 patients (57.1%) resumed ribociclib, and 6 (42.9%) resumed palbociclib (Table 5  Table 5 Rechallenge strategies and treatment following CDK4/6 inhibitor-induced hepatotoxicity (n = 57) Strategy details n (%) Continued treatment (same drug, dose reduced) Palbociclib 13 (22.8%) Ribociclib 19 (33.3%) Switched between CDK4/6 Inhibitors Ribociclib → Palbociclib 11 (19.3%) Treatment interrupted, then restarted (same drug, dose reduced) Total 14 (24.6%) Ribociclib 8 (57.1% of 14) Palbociclib 6 (42.9% of 14) Hepatotoxicity after switching (Ribociclib → Palbociclib) Yes 1 (1.8%) No 10 (17.5%) No switching performed 46 (80.7%) Summary CDK4/6, cyclin-dependent kinase 4/6 inhibitor In the subgroup switched from ribociclib to palbociclib, hepatotoxicity recurred in only one patient (1.8%), whereas the remaining 10 patients (17.5%) tolerated rechallenge without further events (Table 5 Discussıon This study provides a comprehensive evaluation of the demographic, clinical, and treatment characteristics of patients with metastatic hormone receptor-positive, HER2-negative breast cancer receiving CDK4/6 inhibitors, with a particular focus on hepatotoxicity and its management strategies. In this study, the incidence of hepatotoxicity was 10.5%, which aligns closely with previously reported real-world data and clinical trial results, where hepatotoxicity rates associated with CDK4/6 inhibitors range from 6 to 13.1% (Sledge et al. 2017 2016 2020 2024 2023 . 2024 2024 In our cohort, younger age was associated with a higher risk of hepatotoxicity (mean age 54.14 vs. 58.44 years, p p \" 2015 These findings underscore that in patients who experience CDK4/6 inhibitor-induced hepatotoxicity, strategies such as dose reduction, temporary treatment interruption followed by rechallenge, or switching to an alternative CDK4/6 inhibitor are feasible and generally well tolerated. These approaches enable the continuation of clinically beneficial therapy without substantially compromising safety or efficacy, provided that appropriate monitoring is implemented. Thus, with individualized management, most patients can safely resume CDK4/6 inhibitor therapy following liver-related adverse events. When evaluated within the context of viral hepatitis, hepatitis B carrier status emerged as a significant risk factor for CDK4/6 inhibitor-associated hepatotoxicity in our cohort (3.5% vs. 0.2%, p 2004 2017 2016 2020 2014 In our study, the use of herbal and dietary supplements was significantly associated with CDK4/6 inhibitor-induced hepatotoxicity ( p 2022 2023 2021 Previous case reports of ribociclib-induced liver injury have consistently shown a hepatocellular pattern of damage. In these cases, transaminase levels continued to rise for several weeks despite the immediate cessation of ribociclib once liver abnormalities were detected. None of the reported cases resulted in fatal outcomes, and mild grade 1 hepatic encephalopathy was described in only one patient. Jahan et al. ( 2021 2016 p 2017 Limitations This study has several limitations that should be acknowledged. First, its retrospective design may introduce selection bias, and causality cannot be firmly established. Second, due to national reimbursement policies in Turkey, abemaciclib is not approved for use in HR+/HER2 breast cancer. Consequently, none of the patients in our cohort received abemaciclib. All participants were treated with ribociclib, palbociclib, or both agents sequentially during their treatment course. This limits the ability to compare the hepatotoxicity profiles of all three CDK4/6 inhibitors within the same real-world setting. Third, liver biopsies were not performed in any patient, as most hepatotoxic events were clinically manageable and resolved with dose modifications or treatment interruption. While this approach reflects standard clinical practice, the lack of histopathological data limits further characterization of liver injury patterns. Additionally, due to the relatively low number of patients experiencing severe hepatotoxicity, the statistical power for subgroup analyses was limited, which may have affected the ability to detect significant associations. Finally, although this study included a large real-world cohort, the external generalizability of our findings may be restricted due to regional differences in clinical practice, patient characteristics, and drug accessibility. Conclusion and evaluation CDK4/6 inhibitor-associated hepatotoxicity is generally infrequent, reversible, and manageable in real-world practice. Our findings indicate that with close monitoring and individualized management—including timely dose adjustments, temporary interruptions, and rechallenge strategies—CDK4/6 inhibitors can be safely resumed after hepatotoxicity, enabling patients to continue benefiting from these agents. Further studies are needed to establish standardized rechallenge protocols and to include broader patient cohorts that also encompass abemaciclib use. Abbreviations ALT Alanine aminotransferase AST Aspartate aminotransferase BSEP Bile salt export pump CDK Cyclin-dependent kinase CDKI Cyclin-dependent kinase inhibitor CIOMS Council for International Organizations of Medical Sciences CTCAE Common terminology criteria for adverse events DILI Drug-induced liver injury ECOG Eastern Cooperative Oncology Group HR + Hormone receptor-positive HER2 Human epidermal growth factor receptor 2 MBC Metastatic breast cancer NCI National Cancer Institute ORR Overall response rate Rb Retinoblastoma RUCAM Roussel Uclaf Causality Assessment Method STAT3 Signal transducer and activator of transcription 3 Publisher's Note Springer Nature remains neutral with regard to jurisdictional claims in published maps and institutional affiliations. Acknowledgements Not applicable. Author contributions Nurullah İlhan conceptualized the study, collected and analyzed the data, interpreted the results, and drafted the manuscript. Funding This research received no external funding. Data availability No datasets were generated or analysed during the current study. Declarations Conflict of interest The authors declare no competing interests. Ethical approval and consent to participate This study was approved by the Ethics Committee of Sancaktepe Şehit Prof. Dr. İlhan Varank Training and Research Hospital (Approval number: 2024/300; Approval date: 18 September 2024). All participants provided written informed consent to participate. Consent for publication Not applicable. References Aithal GP Watkins PB Andrade RJ Larrey D Molokhia M Takikawa H Case definition and phenotype standardization in drug-induced liver injury Clin Pharmacol Ther 2011 89 6 806 815 10.1038/clpt.2011.58 21544079 Aithal GP, Watkins PB, Andrade RJ, Larrey D, Molokhia M, Takikawa H et al (2011) Case definition and phenotype standardization in drug-induced liver injury. Clin Pharmacol Ther 89(6):806–815. 10.1038/clpt.2011.58 21544079 10.1038/clpt.2011.58 Bessone F García-Cortés M Medina-Caliz I Hernandez N Parana R Mendizabal M Schinoni MI Ridruejo E Nunes V Peralta M Santos G Anders M Chiodi D Tagle M Montes P Carrera E Arrese M Lizarzabal MI Alvarez-Alvarez I Caballano-Infantes E Niu H Pinazo J Cabello MR Lucena MI Andrade RJ Herbal and dietary supplements-induced liver injury in Latin America: experience from the LATINDILI network Clin Gastroenterol Hepatol 2022 20 3 e548 10.1016/j.cgh.2021.01.011 33434654 Bessone F, García-Cortés M, Medina-Caliz I, Hernandez N, Parana R, Mendizabal M, Schinoni MI, Ridruejo E, Nunes V, Peralta M, Santos G, Anders M, Chiodi D, Tagle M, Montes P, Carrera E, Arrese M, Lizarzabal MI, Alvarez-Alvarez I, Caballano-Infantes E, Niu H, Pinazo J, Cabello MR, Lucena MI, Andrade RJ (2022) Herbal and dietary supplements-induced liver injury in Latin America: experience from the LATINDILI network. Clin Gastroenterol Hepatol 20(3):e548. 10.1016/j.cgh.2021.01.011 33434654 10.1016/j.cgh.2021.01.011 Braal CL Jongbloed EM Wilting SM Mathijssen RHJ Koolen SLW Jager A Inhibiting CDK4/6 in breast cancer with Palbociclib, Ribociclib, and Abemaciclib: similarities and differences Drugs 2021 81 3 317 331 10.1007/s40265-020-01461-2 33369721 PMC7952354 Braal CL, Jongbloed EM, Wilting SM, Mathijssen RHJ, Koolen SLW, Jager A (2021) Inhibiting CDK4/6 in breast cancer with Palbociclib, Ribociclib, and Abemaciclib: similarities and differences. Drugs 81(3):317–331. 10.1007/s40265-020-01461-2 33369721 10.1007/s40265-020-01461-2 PMC7952354 Cohen EB Patwardhan M Raheja R Alpers DH Andrade RJ Avigan MI Lewis JH Rockey DC Chui F Iacob AM Linardi CC Regev A Shick J Lucena MI Drug-induced liver injury in the elderly: consensus statements and recommendations from the IQ-DILI initiative Drug Saf 2024 47 4 301 319 10.1007/s40264-023-01390-5 38217833 PMC10954848 Cohen EB, Patwardhan M, Raheja R, Alpers DH, Andrade RJ, Avigan MI, Lewis JH, Rockey DC, Chui F, Iacob AM, Linardi CC, Regev A, Shick J, Lucena MI (2024) Drug-induced liver injury in the elderly: consensus statements and recommendations from the IQ-DILI initiative. Drug Saf 47(4):301–319. 10.1007/s40264-023-01390-5 38217833 10.1007/s40264-023-01390-5 PMC10954848 Cristofanilli M Turner NC Bondarenko I Ro J Im SA Masuda N Colleoni M DeMichele A Loi S Verma S Iwata H Harbeck N Zhang K Theall KP Jiang Y Bartlett CH Koehler M Slamon D Fulvestrant plus palbociclib versus fulvestrant plus placebo for treatment of hormone-receptor-positive, HER2-negative metastatic breast cancer that progressed on previous endocrine therapy (PALOMA-3): final analysis of the multicentre, double-blind, phase 3 randomised controlled trial Lancet Oncol 2016 17 4 425 439 10.1016/S1470-2045(15)00613-0 26947331 Cristofanilli M, Turner NC, Bondarenko I, Ro J, Im SA, Masuda N, Colleoni M, DeMichele A, Loi S, Verma S, Iwata H, Harbeck N, Zhang K, Theall KP, Jiang Y, Bartlett CH, Koehler M, Slamon D (2016) Fulvestrant plus palbociclib versus fulvestrant plus placebo for treatment of hormone-receptor-positive, HER2-negative metastatic breast cancer that progressed on previous endocrine therapy (PALOMA-3): final analysis of the multicentre, double-blind, phase 3 randomised controlled trial. Lancet Oncol 17(4):425–439. 10.1016/S1470-2045(15)00613-0 26947331 10.1016/S1470-2045(15)00613-0 Dara L Liu ZX Kaplowitz N Mechanisms of adaptation and progression in idiosyncratic drug-induced liver injury: clinical implications Liver Int 2016 36 2 158 165 10.1111/liv.12988 26484420 PMC4718752 Dara L, Liu ZX, Kaplowitz N (2016) Mechanisms of adaptation and progression in idiosyncratic drug-induced liver injury: clinical implications. Liver Int 36(2):158–165. 10.1111/liv.12988 26484420 10.1111/liv.12988 PMC4718752 EASL Clinical Practice Guidelines Drug-induced liver injury J Hepatol 2019 10.1016/j.jhep.2019.02.014 30926241 EASL Clinical Practice Guidelines (2019) Drug-induced liver injury. J Hepatol. 10.1016/j.jhep.2019.02.014 10.1016/j.jhep.2019.02.014 30926241 El Rassy E Bakouny Z Assi T Kattan J Different inhibitors for the same target in metastatic luminal breast cancer: is there any difference? Futur Oncol (Lond, Engl) 2018 14 9 891 895 10.2217/fon-2017-0532 29527939 El Rassy E, Bakouny Z, Assi T, Kattan J (2018) Different inhibitors for the same target in metastatic luminal breast cancer: is there any difference? Futur Oncol (Lond, Engl) 14(9):891–895. 10.2217/fon-2017-0532 10.2217/fon-2017-0532 29527939 Finnsdottir S Sverrisdottir A Björnsson ES Hepatotoxicity associated with ribociclib among breast cancer patients Acta Oncol 2021 60 2 195 198 10.1080/0284186X.2020.1853228 33272079 Finnsdottir S, Sverrisdottir A, Björnsson ES (2021) Hepatotoxicity associated with ribociclib among breast cancer patients. Acta Oncol 60(2):195–198. 10.1080/0284186X.2020.1853228 33272079 10.1080/0284186X.2020.1853228 Fradley MG Nguyen NHK Madnick D Chen Y DeMichele A Makhlin I Dent S Lefebvre B Carver J Upshaw JN DeRemer D Ky B Guha A Gong Y Adverse cardiovascular events associated with cyclin-dependent kinase 4/6 inhibitors in patients with metastatic breast cancer J Am Heart Assoc 2023 12 12 e029361 10.1161/JAHA.123.029361 37301767 PMC10356048 Fradley MG, Nguyen NHK, Madnick D, Chen Y, DeMichele A, Makhlin I, Dent S, Lefebvre B, Carver J, Upshaw JN, DeRemer D, Ky B, Guha A, Gong Y (2023) Adverse cardiovascular events associated with cyclin-dependent kinase 4/6 inhibitors in patients with metastatic breast cancer. J Am Heart Assoc 12(12):e029361. 10.1161/JAHA.123.029361 37301767 10.1161/JAHA.123.029361 PMC10356048 Goel S DeCristo MJ McAllister SS Zhao JJ CDK4/6 inhibition in cancer: beyond cell cycle arrest Trends Cell Biol 2018 28 11 911 925 10.1016/j.tcb.2018.07.002 30061045 PMC6689321 Goel S, DeCristo MJ, McAllister SS, Zhao JJ (2018) CDK4/6 inhibition in cancer: beyond cell cycle arrest. Trends Cell Biol 28(11):911–925. 10.1016/j.tcb.2018.07.002 30061045 10.1016/j.tcb.2018.07.002 PMC6689321 Hoofnagle JH Björnsson ES Drug-induced liver injury - types and phenotypes N Engl J Med 2019 381 3 264 273 10.1056/NEJMra1816149 31314970 Hoofnagle JH, Björnsson ES (2019) Drug-induced liver injury - types and phenotypes. N Engl J Med 381(3):264–273. 10.1056/NEJMra1816149 31314970 10.1056/NEJMra1816149 Hortobagyi GN Stemmer SM Burris HA Yap YS Sonke GS Paluch-Shimon S Campone M Petrakova K Blackwell KL Winer EP Janni W Verma S Conte P Arteaga CL Cameron DA Mondal S Su F Miller M Elmeliegy M Germa C O'Shaughnessy J Updated results from MONALEESA-2, a phase III trial of first-line ribociclib plus letrozole versus placebo plus letrozole in hormone receptor-positive, HER2-negative advanced breast cancer Ann Oncol 2018 29 7 1541 1547 10.1093/annonc/mdy155 29718092 Hortobagyi GN, Stemmer SM, Burris HA, Yap YS, Sonke GS, Paluch-Shimon S, Campone M, Petrakova K, Blackwell KL, Winer EP, Janni W, Verma S, Conte P, Arteaga CL, Cameron DA, Mondal S, Su F, Miller M, Elmeliegy M, Germa C, O’Shaughnessy J (2018) Updated results from MONALEESA-2, a phase III trial of first-line ribociclib plus letrozole versus placebo plus letrozole in hormone receptor-positive, HER2-negative advanced breast cancer. Ann Oncol 29(7):1541–1547. 10.1093/annonc/mdy155 29718092 10.1093/annonc/mdy155 İlhan N Doğan A Erölmez HN Atalah F Baş S Yasar S Odabaş H Gümüş M The incidence and clinical characteristics of interstitial lung disease associated with CDK4/6 inhibitors in breast cancer patients: a retrospective multicenter study Medicina (Kaunas) 2025 61 3 549 10.3390/medicina61030549 40142360 PMC11944207 İlhan N, Doğan A, Erölmez HN, Atalah F, Baş S, Yasar S, Odabaş H, Gümüş M (2025) The incidence and clinical characteristics of interstitial lung disease associated with CDK4/6 inhibitors in breast cancer patients: a retrospective multicenter study. Medicina (Kaunas) 61(3):549. 10.3390/medicina61030549 40142360 10.3390/medicina61030549 PMC11944207 Jacquet E Lardy-Cléaud A Pistilli B Franck S Cottu P Delaloge S Debled M Vanlemmens L Leheurteur M Guizard AV Laborde L Uwer L Jacot W Berchery D Desmoulins I Ferrero JM Perrocheau G Courtinard C Brain E Chabaud S Robain M Bachelot T Endocrine therapy or chemotherapy as first-line therapy in hormone receptor-positive HER2-negative metastatic breast cancer patients Eur J Cancer 2018 95 93 101 10.1016/j.ejca.2018.03.013 29655061 Jacquet E, Lardy-Cléaud A, Pistilli B, Franck S, Cottu P, Delaloge S, Debled M, Vanlemmens L, Leheurteur M, Guizard AV, Laborde L, Uwer L, Jacot W, Berchery D, Desmoulins I, Ferrero JM, Perrocheau G, Courtinard C, Brain E, Chabaud S, Robain M, Bachelot T (2018) Endocrine therapy or chemotherapy as first-line therapy in hormone receptor-positive HER2-negative metastatic breast cancer patients. Eur J Cancer 95:93–101. 10.1016/j.ejca.2018.03.013 29655061 10.1016/j.ejca.2018.03.013 Jahan N Wongsaengsak S Rehman S Adhikari N Tijani LA Raghunath A Relative risk of hepatotoxicity associated with cyclin-dependent kinase inhibitors (CDK4/6i): a systematic review and meta-analysis of phase 3 randomized controlled trials J Clin Oncol 2021 39 15 Suppl. e13037 10.1200/JCO.2021.39.15_suppl.e13037 Jahan N, Wongsaengsak S, Rehman S, Adhikari N, Tijani LA, Raghunath A (2021) Relative risk of hepatotoxicity associated with cyclin-dependent kinase inhibitors (CDK4/6i): a systematic review and meta-analysis of phase 3 randomized controlled trials. J Clin Oncol 39(15 Suppl.):e13037. 10.1200/JCO.2021.39.15_suppl.e13037 Johnston S Martin M Di Leo A Im SA Awada A Forrester T Frenzel M Hardebeck MC Cox J Barriga S Toi M Iwata H Goetz MP MONARCH 3 final PFS: a randomized study of abemaciclib as initial therapy for advanced breast cancer NPJ Breast Cancer 2019 5 5 10.1038/s41523-018-0097-z 30675515 PMC6336880 Johnston S, Martin M, Di Leo A, Im SA, Awada A, Forrester T, Frenzel M, Hardebeck MC, Cox J, Barriga S, Toi M, Iwata H, Goetz MP (2019) MONARCH 3 final PFS: a randomized study of abemaciclib as initial therapy for advanced breast cancer. NPJ Breast Cancer 5:5. 10.1038/s41523-018-0097-z 30675515 10.1038/s41523-018-0097-z PMC6336880 Kahraman S Hizal M Demirel BC Activity of CDK4/6 inhibitors and parameters affecting survival in elderly patients in age subgroups: Turkish Oncology Group (TOG) retrospective study BMC Cancer 2024 24 1592 10.1186/s12885-024-13357-5 39736618 PMC11687141 Kahraman S, Hizal M, Demirel BC et al (2024) Activity of CDK4/6 inhibitors and parameters affecting survival in elderly patients in age subgroups: Turkish Oncology Group (TOG) retrospective study. BMC Cancer 24:1592. 10.1186/s12885-024-13357-5 39736618 10.1186/s12885-024-13357-5 PMC11687141 Li W Wertheimer A Narrative review: the FDA's perfunctory approach of dietary supplement regulations giving rise to copious reports of adverse events Innov Pharm 2023 14 1 10.24926/iip.v14i1.4989 10.24926/iip.v14i1.4989 PMC10686678 38035313 Li W, Wertheimer A (2023) Narrative review: the FDA’s perfunctory approach of dietary supplement regulations giving rise to copious reports of adverse events. Innov Pharm 14(1):10.24926/iip.v14i1.4989. 10.24926/iip.v14i1.4989 10.24926/iip.v14i1.4989 PMC10686678 38035313 Lin W Zeng Y Weng L Comparative analysis of adverse events associated with CDK4/6 inhibitors based on FDA’s adverse event reporting system: a case-control pharmacovigilance study BMC Pharmacol Toxicol 2024 25 47 10.1186/s40360-024-00770-6 39123221 PMC11312934 Lin W, Zeng Y, Weng L et al (2024) Comparative analysis of adverse events associated with CDK4/6 inhibitors based on FDA’s adverse event reporting system: a case-control pharmacovigilance study. BMC Pharmacol Toxicol 25:47. 10.1186/s40360-024-00770-6 39123221 10.1186/s40360-024-00770-6 PMC11312934 Martin M Zielinski C Ruiz-Borrego M Carrasco E Turner N Ciruelos EM Muñoz M Bermejo B Margeli M Anton A Kahan Z Csöszi T Casas MI Murillo L Morales S Alba E Gal-Yam E Guerrero-Zotano A Calvo L de la Haba-Rodriguez J Gil-Gil M Palbociclib in combination with endocrine therapy versus capecitabine in hormonal receptor-positive, human epidermal growth factor 2-negative, aromatase inhibitor-resistant metastatic breast cancer: a phase III randomised controlled trial-PEARL Ann Oncol 2021 32 4 488 499 10.1016/j.annonc.2020.12.013 33385521 Martin M, Zielinski C, Ruiz-Borrego M, Carrasco E, Turner N, Ciruelos EM, Muñoz M, Bermejo B, Margeli M, Anton A, Kahan Z, Csöszi T, Casas MI, Murillo L, Morales S, Alba E, Gal-Yam E, Guerrero-Zotano A, Calvo L, de la Haba-Rodriguez J, Gil-Gil M (2021) Palbociclib in combination with endocrine therapy versus capecitabine in hormonal receptor-positive, human epidermal growth factor 2-negative, aromatase inhibitor-resistant metastatic breast cancer: a phase III randomised controlled trial-PEARL. Ann Oncol 32(4):488–499. 10.1016/j.annonc.2020.12.013 33385521 10.1016/j.annonc.2020.12.013 Navarro VJ Barnhart H Bonkovsky HL Davern T Fontana RJ Grant L Reddy KR Seeff LB Serrano J Sherker AH Stolz A Talwalkar J Vega M Vuppalanchi R Liver injury from herbals and dietary supplements in the U.S. drug-induced liver injury Network Hepatology 2014 60 4 1399 1408 10.1002/hep.27317 25043597 PMC4293199 Navarro VJ, Barnhart H, Bonkovsky HL, Davern T, Fontana RJ, Grant L, Reddy KR, Seeff LB, Serrano J, Sherker AH, Stolz A, Talwalkar J, Vega M, Vuppalanchi R (2014) Liver injury from herbals and dietary supplements in the U.S. drug-induced liver injury Network. Hepatology 60(4):1399–1408. 10.1002/hep.27317 25043597 10.1002/hep.27317 PMC4293199 Peng Y Zhou Y Zhou X Jia X Zhong Y A disproportionality analysis of CDK4/6 inhibitors in the FDA adverse event reporting system (FAERS) Expert Opin Drug Saf 2024 24 1 25 33 10.1080/14740338.2024.2387323 39083396 Peng Y, Zhou Y, Zhou X, Jia X, Zhong Y (2024) A disproportionality analysis of CDK4/6 inhibitors in the FDA adverse event reporting system (FAERS). Expert Opin Drug Saf 24(1):25–33. 10.1080/14740338.2024.2387323 39083396 10.1080/14740338.2024.2387323 Perrillo RP Martin P Lok AS Preventing hepatitis B reactivation due to immunosuppressive drug treatments JAMA 2015 313 16 1617 1618 10.1001/jama.2015.2571 25790287 Perrillo RP, Martin P, Lok AS (2015) Preventing hepatitis B reactivation due to immunosuppressive drug treatments. JAMA 313(16):1617–1618. 10.1001/jama.2015.2571 25790287 10.1001/jama.2015.2571 Rockey DC Seeff LB Rochon J Freston J Chalasani N Bonacini M Fontana RJ Hayashi PH US Drug-Induced Liver Injury Network Causality assessment in drug-induced liver injury using a structured expert opinion process: comparison to the Roussel-Uclaf causality assessment method Hepatology (Baltimore, MD) 2010 51 6 2117 2126 10.1002/hep.23577 20512999 PMC3249230 Rockey DC, Seeff LB, Rochon J, Freston J, Chalasani N, Bonacini M, Fontana RJ, Hayashi PH, US Drug-Induced Liver Injury Network (2010) Causality assessment in drug-induced liver injury using a structured expert opinion process: comparison to the Roussel-Uclaf causality assessment method. Hepatology (Baltimore, MD) 51(6):2117–2126. 10.1002/hep.23577 20512999 10.1002/hep.23577 PMC3249230 Rugo HS Huober J García-Sáenz JA Masuda N Sohn JH Andre VAM Barriga S Cox J Goetz M Management of abemaciclib-associated adverse events in patients with hormone receptor-positive, human epidermal growth factor receptor 2-negative advanced breast cancer: safety analysis of MONARCH 2 and MONARCH 3 Oncologist 2021 26 1 e53 10.1002/onco.13531 32955138 PMC7794176 Rugo HS, Huober J, García-Sáenz JA, Masuda N, Sohn JH, Andre VAM, Barriga S, Cox J, Goetz M (2021) Management of abemaciclib-associated adverse events in patients with hormone receptor-positive, human epidermal growth factor receptor 2-negative advanced breast cancer: safety analysis of MONARCH 2 and MONARCH 3. Oncologist 26(1):e53. 10.1002/onco.13531 32955138 10.1002/onco.13531 PMC7794176 Siegel RL Miller KD Wagle NS Jemal A Cancer statistics, 2023 CA Cancer J Clin 2022 73 1 17 48 10.3322/caac.21763 36633525 Siegel RL, Miller KD, Wagle NS, Jemal A (2022) Cancer statistics, 2023. CA Cancer J Clin 73(1):17–48. 10.3322/caac.21763 10.3322/caac.21763 36633525 Slamon DJ Neven P Chia S Fasching PA De Laurentiis M Im SA Petrakova K Bianchi GV Esteva FJ Martín M Nusch A Sonke GS la De Cruz-Merino L Beck JT Pivot X Sondhi M Wang Y Chakravartty A Rodriguez-Lorenc K Taran T Jerusalem G Overall survival with ribociclib plus fulvestrant in advanced breast cancer N Engl J Med 2020 6 6 514 524 10.1056/NEJMoa1911149 31826360 Slamon DJ, Neven P, Chia S, Fasching PA, De Laurentiis M, Im SA, Petrakova K, Bianchi GV, Esteva FJ, Martín M, Nusch A, Sonke GS, la De Cruz-Merino L, Beck JT, Pivot X, Sondhi M, Wang Y, Chakravartty A, Rodriguez-Lorenc K, Taran T, Jerusalem G (2020) Overall survival with ribociclib plus fulvestrant in advanced breast cancer. N Engl J Med 6(6):514–524. 10.1056/NEJMoa1911149 10.1056/NEJMoa1911149 31826360 Sledge GW Jr Toi M Neven P Sohn J Inoue K Pivot X Burdaeva O Okera M Masuda N Kaufman PA Koh H Grischke EM Frenzel M Lin Y Barriga S Smith IC Bourayou N Llombart-Cussac A MONARCH 2: abemaciclib in combination with fulvestrant in women With HR+/HER2- advanced breast cancer who had progressed while receiving endocrine therapy J Clin Oncol Icial J Am Soc Clin Oncol 2017 35 25 2875 2884 10.1200/JCO.2017.73.7585 28580882 Sledge GW Jr, Toi M, Neven P, Sohn J, Inoue K, Pivot X, Burdaeva O, Okera M, Masuda N, Kaufman PA, Koh H, Grischke EM, Frenzel M, Lin Y, Barriga S, Smith IC, Bourayou N, Llombart-Cussac A (2017) MONARCH 2: abemaciclib in combination with fulvestrant in women With HR+/HER2- advanced breast cancer who had progressed while receiving endocrine therapy. J Clin Oncol Icial J Am Soc Clin Oncol 35(25):2875–2884. 10.1200/JCO.2017.73.7585 10.1200/JCO.2017.73.7585 28580882 Tang Y Li Y Zhang C Ye Y Qiu T Zhu Z Zhao J Hepatic adverse events with CDK4/6 inhibitors: a systematic review combining meta-analysis and FAERS database Expert Opin Drug Saf 2025 10.1080/14740338.2025.2468357 39960238 Tang Y, Li Y, Zhang C, Ye Y, Qiu T, Zhu Z, Zhao J (2025) Hepatic adverse events with CDK4/6 inhibitors: a systematic review combining meta-analysis and FAERS database. Expert Opin Drug Saf. 10.1080/14740338.2025.2468357 39960238 10.1080/14740338.2025.2468357 U.S. Food and Drug Administration (2009) Guidance for industry: drug-induced liver injury—Premarketing clinical evaluation. [FDA Guidance Document]. Available via https://www.fda.gov/media/116737/download Yeo W Zee B Zhong S Chan PK Wong WL Ho WM Lam KC Johnson PJ Comprehensive analysis of risk factors associated with Hepatitis B virus (HBV) reactivation in cancer patients undergoing cytotoxic chemotherapy Br J Cancer 2004 90 7 1306 1311 10.1038/sj.bjc.6601699 15054446 PMC2409681 Yeo W, Zee B, Zhong S, Chan PK, Wong WL, Ho WM, Lam KC, Johnson PJ (2004) Comprehensive analysis of risk factors associated with Hepatitis B virus (HBV) reactivation in cancer patients undergoing cytotoxic chemotherapy. Br J Cancer 90(7):1306–1311. 10.1038/sj.bjc.6601699 15054446 10.1038/sj.bjc.6601699 PMC2409681 Zagami P Esposito A TaurelliSalimbeni B BertonGiachetti PPM Scafetta R Lambertini M Di Maio M Curigliano G Criscitiello C Cinieri S 235P advancing treatment choices: CDK4/6 inhibitor switching in HR+/HER2- metastatic breast cancer ESMO Open. 2024 9 103256 10.1016/j.esmoop.2024.103256 Zagami P, Esposito A, TaurelliSalimbeni B, BertonGiachetti PPM, Scafetta R, Lambertini M, Di Maio M, Curigliano G, Criscitiello C, Cinieri S (2024) 235P advancing treatment choices: CDK4/6 inhibitor switching in HR+/HER2- metastatic breast cancer. ESMO Open. 9:103256. 10.1016/j.esmoop.2024.103256 Zhang X Molecular classification of breast cancer: relevance and challenges Arch Pathol Lab Med 2023 147 1 46 51 10.5858/arpa.2022-0070-RA 36136295 Zhang X (2023) Molecular classification of breast cancer: relevance and challenges. Arch Pathol Lab Med 147(1):46–51. 10.5858/arpa.2022-0070-RA 36136295 10.5858/arpa.2022-0070-RA ",
  "metadata": {
    "Title of this paper": "Molecular classification of breast cancer: relevance and challenges",
    "Journal it was published in:": "Journal of Cancer Research and Clinical Oncology",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12476334/"
  }
}