{
  "title": "Paper_632",
  "abstract": "J Assist Reprod Genet J Assist Reprod Genet 595 jarg Journal of Assisted Reproduction and Genetics 1058-0468 1573-7330 Springer PMC11535109 PMC11535109.1 11535109 11535109 39083108 10.1007/s10815-024-03217-3 3217 1 Fertility Preservation Counseling and cryopreservation: evaluation of patient-reported counseling and choice on method of cancer-related fertility preservation http://orcid.org/0000-0002-7285-8693 Pecoriello Jillian Jillian.Pecoriello@nyulangone.org 1 Quinn Gwendolyn P. 2 Hade Erinn 3 Reinecke Joyce 4 1 https://ror.org/0190ak572 grid.137628.9 0000 0004 1936 8753 New York University Grossman School of Medicine, 2 https://ror.org/0190ak572 grid.137628.9 0000 0004 1936 8753 Department of Obstetrics and Gynecology, New York University, 3 https://ror.org/0190ak572 grid.137628.9 0000 0004 1936 8753 Department of Population Health, New York University, 4 31 7 2024 10 2024 41 10 474337 2807 2812 6 2 2024 22 7 2024 01 10 2025 01 10 2025 06 11 2024 01 10 2025 © The Author(s), under exclusive licence to Springer Science+Business Media, LLC, part of Springer Nature 2024. Springer Nature or its licensor (e.g. a society or other partner) holds exclusive rights to this article under a publishing agreement with the author(s) or other rightsholder(s); author self-archiving of the accepted manuscript version of this article is solely governed by the terms of such publishing agreement and applicable law. 2024 Purpose Prior to cancer treatment, patients make decisions on whether to undergo fertility preservation (FP) and the method of FP. We sought to learn more about counseling and decision-making on the method of cancer-related FP. Methods A cross-sectional 26-item online survey was administered to patients with ovaries who underwent cancer-related FP. Associations between demographics and the FP method were made through estimates of risk difference, with a 95% confidence interval. Open-ended responses were analyzed using the constant comparative method. Results A total of 240 respondents completed the survey: 52% underwent oocyte cryopreservation (OC), 29% underwent embryo cryopreservation (EC), and 19% underwent both oocyte and embryo cryopreservation (OC/EC). Most respondents agreed that if they were to go through the process again, they would make the same decision about FP (80% EC, 72% OC, 59% OC/EC). Women ≥ 35 years reported being counseled more that embryos were superior compared to younger women (risk difference 46%, CI 32.8, 59.1), however were not more likely to freeze embryos (risk difference 6.2%, CI − 9.8, 22.2). Women in long-term relationships reported they were counseled more that embryos were superior compared to those single/dating (risk difference 27%, CI 18.1, 35.9). All women in long-term relationships reported undergoing EC, while the majority of single/dating women reported undergoing OC (74.6%). Conclusion Most women who have undergone cancer-related FP reported they would choose the same FP method again. Women in long-term relationships or ≥ 35 years reported they were more likely to be counseled that EC is superior; however, only women in long-term relationships were more likely to freeze embryos. Keywords Oncofertility Fertility preservation Patient education Oocyte cryopreservation Embryo cryopreservation pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access no pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement no pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes issue-copyright-statement © Springer Science+Business Media, LLC, part of Springer Nature 2024 ",
  "metadata": {
    "Title of this paper": "Counseling and cryopreservation: evaluation of patient-reported counseling and choice on method of cancer-related fertility preservation",
    "Journal it was published in:": "Journal of Assisted Reproduction and Genetics",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC11535109/"
  }
}