{
  "title": "Paper_174",
  "abstract": "pmc Nucleic Acids Res Nucleic Acids Res 4 nar nar Nucleic Acids Research 0305-1048 1362-4962 Oxford University Press PMC12489474 PMC12489474.1 12489474 12489474 41036627 10.1093/nar/gkaf967 gkaf967 1 AcademicSubjects/SCI00010 Molecular and Structural Biology New structural insights into the control of the retinoic acid receptors RAR/RXR by DNA, ligands, and transcriptional coregulators https://orcid.org/0000-0002-4073-9227 Tambones Izabella  Center for Structural Biology (CBS), University of Montpellier, CNRS UMR 5048, INSERM U 1054 Montpellier 34090 France Sagar Amin  Center for Structural Biology (CBS), University of Montpellier, CNRS UMR 5048, INSERM U 1054 Montpellier 34090 France  BicycleTx Ltd. Cambridge CB21 6GS United Kingdom Vankova Pavla  Institute of Biotechnology of the Czech Academy of Sciences, Division BioCeV, Prumyslova 595 Vestec 25250 Czech Republic Loginov Dmitry  Institute of Microbiology of the Czech Academy of Sciences, Division BioCeV, Prumyslova 595 Vestec 25250 Czech Republic Carivenc Coralie  Center for Structural Biology (CBS), University of Montpellier, CNRS UMR 5048, INSERM U 1054 Montpellier 34090 France https://orcid.org/0000-0002-3573-5889 Rochel Natacha  Institute of Genetics and Molecular and Cellular Biology, University of Strasbourg, CNRS UMR7104, INSERM U 1258 Illkirch-Graffenstaden 67404 France Bourguet William  Center for Structural Biology (CBS), University of Montpellier, CNRS UMR 5048, INSERM U 1054 Montpellier 34090 France Man Petr  Institute of Microbiology of the Czech Academy of Sciences, Division BioCeV, Prumyslova 595 Vestec 25250 Czech Republic Bernadó Pau  Center for Structural Biology (CBS), University of Montpellier, CNRS UMR 5048, INSERM U 1054 Montpellier 34090 France https://orcid.org/0000-0003-3336-2158 le Maire Albane  Center for Structural Biology (CBS), University of Montpellier, CNRS UMR 5048, INSERM U 1054 Montpellier 34090 France To whom correspondence should be addressed. Email: albane.lemaire@cbs.cnrs.fr Correspondence may also be addressed to Amin Sagar. Email: aamin.sagar@gmail.com 14 10 2025 02 10 2025 53 18 497355 gkaf967 05 9 2025 05 8 2025 18 3 2025 02 10 2025 03 10 2025 03 10 2025 © The Author(s) 2025. Published by Oxford University Press. 2025 https://creativecommons.org/licenses/by/4.0/ This is an Open Access article distributed under the terms of the Creative Commons Attribution License ( https://creativecommons.org/licenses/by/4.0/ Abstract Retinoic acid receptors (RARs) are ligand-dependent transcription factors essential for various biological processes, including embryogenesis, differentiation, and apoptosis. RARs function as heterodimers with retinoid X receptors (RXRs) and regulate gene expression via retinoic acid response elements (RAREs). Their transcriptional activity is modulated by coregulators, with corepressors maintaining repression in the absence of ligand and coactivators enabling transcription upon ligand binding. Structural studies reveal that DNA binding induces conformational changes affecting coregulator interactions. However, the precise structural organization of RAR/RXR–coregulator complexes and the allosteric influence of DNA on receptor function remain incompletely understood. Our study presents an integrative analysis of the RAR/RXR heterodimer bound to four distinct and relevant RAREs (DR0, DR1, DR5, and IR0) in complex with either a corepressor (NCoR) or a coactivator (TIF-2) nuclear receptor interaction domain. By combining small-angle X-ray scattering, hydrogen/deuterium exchange mass spectrometry, and molecular dynamics simulations, we revealed that the heterodimer adopts distinct conformations depending on the DNA sequence, influencing interdomain distances and receptor interactions. Additionally, we uncovered the dynamic interplay between ligand, DNA, and coregulator binding. This study provides new insights into the structural features of coregulator proteins and highlights the allosteric influence of RAREs on receptor function. Graphical Abstract  Graphical Abstract Institut National du Cancer 10.13039/501100006364 ANR 10.13039/100020806 ANR-21-CE11-0005-01 APPID: 2524 BioCeV CMS PID: 22 036 EPIC-XS 10.13039/100017790 EPIC-XS-0000264 CMS BIOCEV MEYS LM2023042 CZ.02.01.01/00/23_015/0008175 INTER-MICRO CZ.02.01.01/00/22_008/0004597 French National Research Agency 10.13039/501100001665 ANR-10-INBS-05 Grenoble Instruct-ERIC UAR 3518 CNRS-CEA-UGA-EMBL FRISBI 10.13039/501100011658 ANR-10-INBS-0005-02 GRAL French National Research Agency 10.13039/501100001665 ANR-10-INBS-05 GENCI 10.13039/501100010190 2022-A0130713813 2022-AD010713745 pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement yes pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes Introduction Retinoic acid receptors (RARs or NR1Bs) function as ligand-dependent transcription factors belonging to the nuclear receptors (NRs) superfamily that play multiple central roles in vertebrates, such as embryogenesis, organogenesis, cell growth, differentiation, and apoptosis [ 1 2 3 4 5–9 7 8 10 Moreover, the biological functions of RARs rely on transcriptional coregulator exchanges mainly controlled by ligand binding [ 11 12 13 14 15 16 17 18 17 cis- 19 20 21 Over the past 15 years, structural data on integral NRs in various functional states, obtained through a combination of different biophysical and structural methods, have provided a better understanding of the mechanisms involved in molecular regulation. Notably, a limited number of full-length NR structures have unveiled the higher-order organization of these complexes on DNA (LXRβ/RXR [ 22 23 24 25 26 27 28 29 30–34 31 32 35 36 37 The low-resolution models of full-length RAR/RXR heterodimers bound to DR5 and DR1 RAREs derived from small-angle X-ray scattering (SAXS) and Förster resonance energy transfer (FRET) revealed that the response elements direct the relative position of the DNA recognition helix and the LBDs, which in turn define the binding site of the coregulators [ 38 24 39 Materials and methods Ligands The ligands AM580, BMS493, and CD3254 were purchased from Tocris Bioscience. All compound stock solutions were prepared at 10 mM in Dimethyl sulfoxide (DMSO). DNA preparation The forward and reverse oligonucleotides corresponding to the different RAREs motifs (DR0, DR0L, DR1, DR5, and IR0) were purchased from Integrated DNA Technologies (IDT) ( Supplementary Table S1 Supplementary Fig. S1A Constructs, expression, and purification of proteins and complexes MmRARAΔABF (82-421, Uniprot entry P11416 P19793 Escherichia coli 40 41 2 Q60974 42 et al. 43 et al. 42 Steady-state fluorescence anisotropy Interaction with DNA in different liganded states Fluorescent anisotropy assays were performed using a Safire microplate reader (TECAN) with the excitation wavelength set at 635 nm and emission measured at 680 nm for Cy5-labeled DNAs. The buffer solution for assays was 20 mM Tris–HCl, pH 7.5, 75 mM NaCl, 75 mM KCl, 2 mM CHAPS, 4 mM MgCl 2 44–46 K d K d RT T Interaction of TIF-2NRID with the different DNA-bound heterodimers Fluorescent anisotropy assays were performed using a Safire microplate reader (TECAN) with the excitation wavelength set at 470 nm and emission measured at 530 nm for Alexa488-labeled TIF-2NRID [ 42 2 44–46 Microscale thermophoresis The Atto647N-labeled N-CoR NID et al. 43 2 K d K d K d 2 Hydrogen deuterium exchange coupled with mass spectrometry We used the four different RR–DNA complexes in the presence and absence of NCoRNID or TIF-2NRID. The HDX reaction was conducted at 4°C where 20 μM of the complex sample was diluted 10-fold into the deuterated buffer (20 mM Tris, pD 7.5, 75 mM NaCl, 75 mM KCl, 4 mM MgCl 2 Subsequently, each sample was quickly thawed and injected into the LC system with a protease column containing immobilized nepenthesin-2 [ 47 −1 −1 48 49 Following the separation, the protease column was washed with a 150 mM triethyl ammonium acetate, 4 M urea, pH 8.0 solution followed by 5% acetonitrile, 5% isopropanol, and 20% acetic acid solution. Similarly, the trap and analytical columns were washed using 150 mM triethyl ammonium acetate/80% acetonitrile, pH 8.0 solution by 1260 Infinity II Quaternary pump (Agilent Technologies). With the same LC system and gradient elution but an ESI-timsTOF Pro mass spectrometer (Bruker Daltonics, Bremen, Germany), data-dependent LC-MS/MS measurement was used to identify the peptides arising from digestion of each protein. Data were searched using MASCOT v 2.7 (Matrix Science) against a database combining the sequences of RAR, RXR, NCoRNID, TIF-2NRID, and contaminants from the cRAP database. Decoy search was enabled and the false discovery ratio was set to 1%. Ion score cut-off was set to 20. Other search parameters were no-enzyme, precursor mass tolerance: 5 ppm, fragment ion mass tolerance: 0.05 Da, and no modifications enabled. Small-angle X-ray scattering SEC-coupled SEC–SAXS experiments were conducted at the SWING beamline on the SOLEIL synchrotron (Saint-Aubin, France) [ 50 2 −1 −1 q q 51 q −1 q max q max ^-1 q -1 https://www.synchrotron-soleil.fr/en/beamlines/swing 52 53 54 R g P r D max 55 56 Molecular dynamics simulation RR–DNA complexes structure preparation The LBDs for RAR/RXR for all simulations were taken from the crystal structure of the RAR/RXR heterodimer complexed with DR1 (PDB ID: 5UAN) [ 24 39 39 https://scfbio-iitd.res.in/software/drugdesign/bdna.jsp ) 57 NRR–DNA complexes structure preparation NCoRNID was added to the RR–DNA systems prepared above using the structure of the two NCoRNID-binding motifs from Cordeiro et al. 43 57 58 58 57 Simulation system setup For all simulations, the hydrogens atoms were added to the DNAs using Chimera before the RR–DNA complex was used to setup the simulations using the tools available with Gromacs-2022.6, including addition of hydrogens to the protein atoms to protein residues, solvation and ionization to achieve a final salt concentration of 0.15 M with Na + − 59 60 Molecular dynamics simulation All simulations were performed using AMBER22 [ 61 Data analysis The initial processing of the simulations, including imaging and removal of solvent and ions was performed using CPPTRAJ. Distances and contact maps were calculated using the MDAnalysis library [ 62 63 64 Results DNA-binding affinity to the RAR/RXR heterodimer in active and repressive states To assess and compare the RAR/RXR heterodimer’s binding affinities to distinct RARE-binding sites, we performed fluorescence anisotropy measurements in the presence and absence of the cognate ligands. For this, we expressed and purified the RAR/RXR heterodimer without the NR flexible regions (the N-terminal A/B and C-terminal F domains; Supplementary Fig. S1B Supplementary Fig. S1C Supplementary Table S1 7 9 24 39 1 Supplementary Fig. S2A D 7 8 24 65 K d K d K d K d 7 39 Table 1. RAR/RXR affinity for the different DNA elements DNA Ligand  K d SD (nM) DR0 Apo 33.5 16.4  AM580 + CD325 24.1 17.3  BMS493 100.7 48.1 DR1 Apo 6.1 2.2  AM580 + CD325 8.7 2.9  BMS493 24.6 5.0 DR5 Apo 1.7 0.8  AM580 + CD325 2.4 0.9  BMS493 15.0 2.0 IR0 Apo 1.9 1.3  AM580 + CD325 3.8 3.1  BMS493 29.1 24.2 Dissociation constant ( K d DNA-driven structural adaptations of the RAR/RXR heterodimer Seeking to explore how the DNA binding could influence the conformational states of the RAR/RXR heterodimer, we conducted SEC–SAXS experiments on the various RR–DNA complexes. The scattering intensities as a function of the momentum transfer vector, Q 1A D 1A D R g P r D max Supplementary Table S2 P r 1E H Supplementary Fig. S3A–F P r r P r 66 1H 1F 1E 39 1A Supplementary Table S2 P r Figure 1. SEC–SAXS data measured on RAR/RXR complexes bound to different DNA-binding sites in the presence and absence of NCoR NID A D NID E H P r P r To further describe the conformations and dynamics of RR–DNA complexes, we conducted all-atom MD simulations running 10 independent 1 μs trajectories per DNA condition using the DES-Amber-3.20 force field, which was developed to sample the conformational landscapes of protein–DNA complexes [ 67 24 39 Supplementary Tables S3 S4 Supplementary Fig. S4 Across all the RR–DNA simulations, we observed that the folded regions of RAR/RXR remained well-ordered and formed a stable complex with the DNA. Next, we computed the SAXS theoretical intensity profiles for the four RR–DNA complex trajectories. The excellent fitting between the averaged theoretical profiles and the experimental SAXS data for the RR–DR5 complex highlighted the robustness of our simulation model for this DNA condition (Fig. 1C Supplementary Table S2 64 1A B D Supplementary Table S2 Supplementary Fig. S3G 2A 2A 2C Figure 2. Molecular dynamics and H/D exchange based analysis of RAR/RXR complexes bound to different DNA elements. ( A D E H \\documentclass[12pt]{minimal}\n\\usepackage{amsmath}\n\\usepackage{wasysym}\n\\usepackage{amsfonts}\n\\usepackage{amssymb}\n\\usepackage{amsbsy}\n\\usepackage{upgreek}\n\\usepackage{mathrsfs}\n\\setlength{\\oddsidemargin}{-69pt}\n\\begin{document}\n$\\rho$\\end{document} \\documentclass[12pt]{minimal}\n\\usepackage{amsmath}\n\\usepackage{wasysym}\n\\usepackage{amsfonts}\n\\usepackage{amssymb}\n\\usepackage{amsbsy}\n\\usepackage{upgreek}\n\\usepackage{mathrsfs}\n\\setlength{\\oddsidemargin}{-69pt}\n\\begin{document}\n$\\rho$\\end{document} I J K L 68 Since domain positioning can influence interdomain interfaces, we estimated residue contact probabilities within the RR–DNAs complexes (Fig. 2E H 2E 24 69 70 Supplementary Fig. S3H–K et al. 24 2G Supplementary Fig. S3J 2H 2E H Long-range allosteric effects in the RAR/RXR heterodimer upon DNA binding We then experimentally investigated the direct and long-range effects induced by DNAs on the RAR/RXR heterodimer. To this end, we employed HDX-MS to monitor dynamic conformational changes in the different RAR and RXR domains upon DNA binding (Fig. 2I K Supplementary Fig. S1D Supplementary Figs S5 S6 2J 2E H Supplementary Fig. S3L 2J Supplementary Fig. S7A 1 71 36 72 Although less pronounced than in the DBD, the DNA binding also influenced more distant regions of the heterodimer, including the hinge and LBDs (Fig. 2J 2L 2J 2K 2L 2K DNA conformational signature persists during repressive complex formation with NCoRNID In the absence of its cognate ligand, RAR/RXR bound to RAREs forms a repressive complex by recruiting corepressor molecules such as NCoR. We tested if and how DNA could play a role in the interactions within these repressive complexes. Thus, to quantify the interaction affinity between the different RR–DNA complexes and the corepressor NCoRNID, we performed microscale thermophoresis (MST) experiments, in the presence and absence of the BMS493 ligand. MST experiments were more suitable than fluorescence anisotropy for studying interactions with NCoRNID, due to its disordered nature and size relative to the RAR/RXR heterodimer, which hindered the acquisition of reproducible anisotropy measurements. Our measurements indicated an affinity of NCoRNID for RAR/RXR around K d 2 Supplementary Fig. S2B E K d 43 2 Supplementary Fig. S2C E Table 2. RAR/RXR and RR–DNA affinity for coregulators  Protein  Complex  Ligand   K d  Confidence range (nM) NCoRNID RAR/RXR Apo 490 387–593   BMS493 368 296–440  RR–DR1 Apo 531 391–671z   BMS493 499 375–623   AM580 + CD3254 5300 3125–7475  RR–DR0 Apo 414 292–536   BMS493 244 177–491  RR–DR5 Apo 283 237–329   BMS493 335 212–458  RR–IR0 Apo 289 213–365   BMS493 289 178–400 NCoRNID mut1 RR–DR1 Apo 347 287–527 NCoRNID mut2 RR–DR5 Apo 576 421–731   BMS493 538 511–430  Protein  Complex  Ligand   K d  SD (nM) TIF-2NRID RAR/RXR AM580 + CD3254 125.6 10.3  RR–DR0 AM580 + CD3254 55.1 4.7  RR–DR1 AM580 + CD3254 30.1 5.7  RR–DR5 AM580 + CD3254 27.7 3.9  RR–IR0 AM580 + CD3254 22.7 4.4 Dissociation constant ( K d K d To explore the structural and dynamic basis of these variations, we first investigated whether NCoRNID binding influences the DNA-dependent conformational patterns of the RAR/RXR heterodimer. The complexes between RR–DNA and NCoRNID were formed in the presence of BMS493 to reinforce the repressive interactions. As already observed for the RAR/RXR–LBD–NCoRNID complex [ 41 Supplementary Fig. S1C E R g D max Supplementary Table S2 43 P r 1E H P r Supplementary Fig. S3M Subsequently, we performed 10 independent 0.5 μs all-atom MD simulations of RR–DNA in complexes with NCoRNID binding to both the RAR and RXR (deck model) and generated models of NRR–DNA complexes by using simulated heterodimer, followed by the addition of NCoRNID bound to RAR (asymmetric model), previously generated by Cordeiro et al. 43 1A D 3A D 3B D Figure 3. The interaction of RR–BMS493 bound to DNA with the NCoR NID A D NID E F NID E F G NID NID H NID I J K L M 24 N NID NID O NID To identify contact variations associated with corepressor binding, we calculated the differential contact probabilities within the RAR/RXR heterodimer in NRR–DNA relative to RR–DNA complexes (Fig. 3E Supplementary Fig. S3O–R 17 43 Supplementary Fig. S3S–V Structural and functional characterization of NCoRNID interactions with RAR/RXR bound to different DNA elements To track the direct and long-range effects induced by NCoRNID and DNA binding and gain insight into their interplay, we performed HDX-MS experiments on RAR/RXR and RR–DNA complexes in the presence of NCoRNID. Due to the disordered nature of NCoRNID transient interactions, it was crucial to run the experiments at low temperature (4°C) to slow down the exchange and collect very short exchange times. Details into the sequence coverage for the NRR–DNA complex are available as Supplementary Material ( Supplementary Figs S5 S6 S8 Supplementary Fig. S1C E We first report the structural changes of H/D exchange in RR and RR–DNA complexes induced by the interaction with the ligand and NCoRNID (Fig. 3G I 3 3H M 3H M 17 Supplementary Fig. S3O–R 3H K Differences in H/D exchange protection in RR–NCoRNID following DNA binding (Fig. 3J L 3K 2J 3I 2K 3L Supplementary Fig. S7B 24 Subsequently, we analyzed the effects of RAR/RXR and RR–DNA complexes on NCoRNID to identify its interacting regions (Fig. 3N 3O Supplementary Fig. S7C 43 3O Supplementary Fig. S7C 43 To gain deeper insight into the role of IR in the overall interaction of NCoRNID with the RAR/RXR heterodimer, we modeled the repressive complex using AlphaFold3.0 [ 68 Supplementary Fig. S9A Supplementary Fig. S9B Supplementary Fig. S9C 3O Supplementary Fig. S9D 2 Supplementary Figs. S2E S9F Coactivator interaction dynamics with RAR/RXR and its DNA intercommunication We next investigated whether DNA binding could also impact the dynamics of the RAR/RXR heterodimer in its active state, meaning in the presence of RAR and RXR agonist ligands. RAR/RXR heterodimer was prepared, bound to the different DNA-binding sites in the presence of AM580 and CD3254, and subjected to HDX-MS ( Supplementary Figs S5 S6 S8 4A 4B 2J Supplementary Fig. S7D Supplementary Fig. S7E 4C Supplementary Fig. S7E Figure 4. Differential HDX-MS reveals coactivator interaction on RAR and RXR and cooperativity with the DNA. ( A B C D E F G H I J K 24 J K L M Subsequently, we evaluated how the variations in DNA binding could impact the coactivator interaction with RAR/RXR. We first measured the affinity between TIF-2NRID and the agonist-bound RR–DNA complexes by fluorescence anisotropy experiments (Table 2 Supplementary Fig. S2C E K d 42 7 8 To probe the interaction surfaces and the dynamic changes induced by the coactivator binding to RAR/RXR and to evaluate how DNA binding affects the coactivator interaction with the heterodimer, we completed the set of HDX-MS experiments on RAR/RXR and all the RR–DNA complexes prepared in the presence of TIF-2NRID ( Supplementary Figs S1E S4D G 42 Supplementary Fig. S1E 4D F 4G I 4E J 11 Supplementary Fig. S7E 4E 4H K 4F 4F I Next, we explored the effect of RAR/RXR and RR–DNA complexes on TIF-2NRID to highlight its interacting regions (Fig. 4L 4M 73 74 4E 4M Discussion We combined several structural and biophysical methods with advanced molecular modeling to provide new insights into the dynamics and molecular interfaces at play in the RAR/RXR heterodimer, revealing correlations between conformational variations, DNA, ligand, and coregulators binding. The excellent agreement between the SAXS intensity curves and the MD simulations provided us strong confidence in the analysis of the subtle differences between the different RARE-bound RAR/RXR heterodimers. Moreover, the use of model ensembles to describe each of the studied conditions allowed us to capture the dynamics of individual domains within the RAR/RXR heterodimer. Rather than adopting exclusively compact or extended conformations, the RARE-bound RAR/RXR heterodimers presented an equilibrium among interdomain distances depending on the RARE sequences (Fig. 5 24 39 Figure 5. Interplay of DNA and coregulator binding in RAR/RXR transcriptional regulation. Schematic representation of RAR/RXR heterodimer DNA binding and conformational variations across different RAREs (DR0, DR1, DR5, and IR0). Stars indicate direct contacts, while arrows represent the allosteric effects induced by DNA binding across DBD and LBD domains. Coregulator interaction motifs are labeled numerically, corresponding to NCoRNID (corepressor) and TIF-2NRID (coactivator). Our results indicate that DNA binding drives conformational changes in RAR/RXR, establishing distinct patterns of interdomain contacts and allosteric stabilization across the heterodimer domains, assigning a unique pattern to each DNA-bound complex. The DNA-specific conformational signature is maintained upon coregulator binding, influencing its interaction dynamics and fine-tuning coregulator engagement, ultimately shaping the complex’s transcriptional response. Our data also showed that DNA binding induced significant changes to solvent accessibility in the unliganded heterodimer LBDs, especially on the ligand binding pocket and in the region of interaction with coregulators. Furthermore, we observed that the RAR and RXR hinges established interdomain contacts depending on the DNA-bound complex. These findings underscored the functional relevance of the hinges, beyond merely providing flexibility, in mediating allosteric communication across the RAR/RXR complex [ 70 75 24 32 In this work, we also provided the first structural evidence of DNA’s impact on coregulators complexed with NRs, despite the challenges posed by their highly dynamic and disordered nature. In the agonist bound complex, the stabilization of RAR/RXR mainly comes from the ligand, although the DNA provided an additional stabilization of RAR and a destabilization of RXR. A similar effect was observed by isothermal titration calorimetry (ITC) on affinity measurements with the RXR/PPARγ heterodimer, where the DNA caused a reduction in the conformational entropy of the complex and energetically favored the interaction with the coactivator SRC–2NRID [ 31 The protein constructs used in this study lacked the intrinsically disordered N- and C-terminal regions of RXR and RAR, corresponding to the the A/B and F domains. However, we cannot rule out the possibility that these regions contribute to the modulation of interdomain communication and coregulator recruitment described here [ 39 76 77 70 78 79 Extending structural studies on intact complexes comprising NR heterodimers, ligands and coregulator proteins could further advance our understanding of signal propagation within these functional assemblies and step further on their functioning. Whereas structural techniques such as X-ray crystallography and cryo-electron microscopy can be pivotal in deciphering the structures of NRs, integrative studies such as ours, combining molecular dynamics with solution methods, prove very powerful in describing ligand, DNA, and coregulator-induced conformations and dynamics for these highly flexible NR complexes, and can be applied to enhance the understanding of other NRs beyond RAR/RXR. Supplementary Material gkaf967_Supplemental_File Acknowledgements We thank the SWING beamline at the SOLEIL synchrotron (Saint-Aubin, France) for regular beamtime allocation (Block Allocation Group, proposal No. 20201085) and assistance during data collection. We thank P. Germain for critical reading and discussion. We thank N. Sibille for the TIF-2NRID plasmid. We thank P. Poussin-Courmontagne for technical help, A. McEwen for help with X-ray data, and the staff of Proxima 1 at synchrotron SOLEIL for assistance in using the beamline. We thank Christine Ueda from D.E. Shaw Research for providing the DES amber 3.20 force field files. We thank L.F. Rodrigues for generously providing the SAXS data plotting scripts and for their support in data analysis. We thank C. Royer for BioEQS calculations.  Author contributions NID Supplementary data  Supplementary data Conflict of interest All authors have nothing to declare. Funding A.L.M. acknowledges support from the Institut National du Cancer (French National Cancer Institute)/Canceropole Grand Sud-Ouest (Grant Emergence) and the ANR [grant ANR-21-CE11-0005-01]. This work benefited from an Instruct internship program (APPID: 2524) to the BioCeV CMS (PID: 22 036), an Instruct-ERIC center, as well as from the H2020 EU grant EPIC-XS (EPIC-XS-0000264) and CIISB support to CMS BIOCEV (MEYS LM2023042 and CZ.02.01.01/00/23_015/0008175). P.M. acknowledges support from the OP JAK project INTER-MICRO (CZ.02.01.01/00/22_008/0004597). The Center for Structural Biology is supported by the French Infrastructure for Integrated Structural Biology (FRISBI), a national infrastructure supported by the French National Research Agency (ANR-10-INBS-05).This work used the platforms of the Grenoble Instruct-ERIC center (ISBG; UAR 3518 CNRS-CEA-UGA-EMBL) within the Grenoble Partnership for Structural Biology (PSB), supported by FRISBI (ANR-10-INBS-0005-02) and GRAL, financed within the University Grenoble Alpes graduate school (Ecoles Universitaires de Recherche) CBH-EUR-GS (ANR-17-EURE-0003), and through Instruct-funded access (PID: 25766), as well as the PIBBS platform supported by the French National Research Agency (ANR-10-INBS-05). This project was provided with HPC computing and storage resources by GENCI at IDRIS, through grants 2022-A0130713813 and 2022-AD010713745, on the Jean Zay supercomputer’s A100 and V100 partitions, respectively.Funding to cover the Open Access publication charges for this article was provided by the ANR [grant ANR-21-CE11-0005 01]. Data availability The structure has been deposited at the Protein Data Bank under the accession code 9QJ9. The mass spectrometry proteomics data have been deposited to the ProteomeXchange Consortium via the PRIDE [ 80 References 1. Di Masi A Leboffe L De Marinis E et al Retinoic acid receptors: from molecular mechanisms to cancer therapy Mol Aspects Med 2015 41 1 115 10.1016/j.mam.2014.12.003 25543955 2. Mattei MG Rivière M Krust A et al Chromosomal assignment of retinoic acid receptor (RAR) genes in the human, mouse, and rat genomes Genomics 1991 10 1061 9 10.1016/0888-7543(91)90199-O 1655630 3. Bourguet W Ruff M Chambon P et al Crystal structure of the ligand-binding domain of the human nuclear receptor RXR-α Nature 1995 375 377 82 10.1038/375377a0 7760929 4. Germain P Chambon P Eichele G et al International Union of Pharmacology. LX. Retinoic Acid Receptors Pharmacol Rev 2006 58 712 25 10.1124/pr.58.4.4 17132850 5. Rochette-Egly C Chambon P F9 embryocarcinoma cells: a cell autonomous model to study the functional selectivity of RARs and RXRs in retinoid signaling Histol Histopathol 2001 16 909 22 11510982 10.14670/HH-16.909 6. Rochette-Egly C Germain P Dynamic and combinatorial control of gene expression by nuclear retinoic acid receptors (RARs) Nucl Recept Signal 2009 7 e005 10.1621/nrs.07005 19471584 PMC2686084 7. Moutier E Ye T Choukrallah M-A et al Retinoic acid receptors recognize the mouse genome through binding elements with diverse spacing and topology J Biol Chem 2012 287 26328 41 10.1074/jbc.M112.361790 22661711 PMC3406717 8. Chatagnon A Veber P Morin V et al RAR/RXR binding dynamics distinguish pluripotency from differentiation associated cis-regulatory elements Nucleic Acids Res 2015 43 4833 54 10.1093/nar/gkv370 25897113 PMC4446430 9. Bhimsaria D Rodríguez-Martínez JA Mendez-Johnson JL et al Hidden modes of DNA binding by human nuclear receptors Nat Commun 2023 14 4179 10.1038/s41467-023-39577-0 37443151 PMC10345098 10. Ross-Innes CS Stark R Holmes KA et al Cooperative interaction between retinoic acid receptor-alpha and estrogen receptor in breast cancer Genes Dev 2010 24 171 82 10.1101/gad.552910 20080953 PMC2807352 11. le Maire A Bourguet W Retinoic acid receptors: structural basis for coregulator interaction and exchange Subcell Biochem 2014 70 37 54 24962880 10.1007/978-94-017-9050-5_3 12. Hörlein AJ Näär AM Heinzel T et al Ligand-independent repression by the thyroid hormone receptor mediated by a nuclear receptor co-repressor Nature 1995 377 397 404 7566114 10.1038/377397a0 13. Chen JD Evans RM A transcriptional co-repressor that interacts with nuclear hormone receptors Nature 1995 377 454 7 10.1038/377454a0 7566127 14. Perissi V Rosenfeld MG Controlling nuclear receptors: the circular logic of cofactor cycles Nat Rev Mol Cell Biol 2005 6 542 54 10.1038/nrm1680 15957004 15. Hu X Lazar MA The CoRNR motif controls the recruitment of corepressors by nuclear hormone receptors Nature 1999 402 93 6 10.1038/47069 10573424 16. Hu X Li Y Lazar MA Determinants of CoRNR-dependent repression complex assembly on nuclear hormone receptors Mol Cell Biol 2001 21 1747 58 10.1128/MCB.21.5.1747-1758.2001 11238912 PMC86726 17. le Maire A Teyssier C Erb C et al A unique secondary-structure switch controls constitutive gene repression by retinoic acid receptor Nat Struct Mol Biol 2010 17 801 7 10.1038/nsmb.1855 20543827 18. Ghosh JC Yang X Zhang A et al Interactions that determine the assembly of a retinoid X receptor/corepressor complex Proc Natl Acad Sci USA 2002 99 5842 7 10.1073/pnas.092043399 11972046 PMC122864 19. Oñate SA Tsai SY Tsai M-J et al Sequence and characterization of a coactivator for the steroid hormone receptor superfamily Science 1995 270 1354 7 7481822 10.1126/science.270.5240.1354 20. Voegel JJ Heine MJS Zechel C et al TIF2, a 160 kDa transcriptional mediator for the ligand-dependent activation function AF-2 of nuclear receptors EMBO J 1996 15 3667 75 10.1002/j.1460-2075.1996.tb00736.x 8670870 PMC452006 21. McInerney EM Rose DW Flynn SE et al Determinants of coactivator LXXLL motif specificity in nuclear receptor transcriptional activation Genes Dev 1998 12 3357 68 10.1101/gad.12.21.3357 9808623 PMC317227 22. Lou X Toresson G Benod C et al Structure of the retinoid X receptor α–liver X receptor β (RXRα–LXRβ) heterodimer on DNA Nat Struct Mol Biol 2014 21 277 81 10.1038/nsmb.2778 24561505 23. Chandra V Huang P Hamuro Y et al Structure of the intact PPAR-γ–RXR-α nuclear receptor complex on DNA Nature 2008 456 350 6 10.1038/nature07413 19043829 PMC2743566 24. Chandra V Wu D Li S et al The quaternary architecture of RARβ–RXRα heterodimer facilitates domain–domain signal transmission Nat Commun 2017 8 868 10.1038/s41467-017-00981-y 29021580 PMC5636793 25. Orlov I Rochel N Moras D et al Structure of the full human RXR/VDR nuclear receptor heterodimer complex with its DR3 target DNA EMBO J 2012 31 291 300 10.1038/emboj.2011.445 22179700 PMC3261568 26. Chandra V Huang P Potluri N et al Multidomain integration in the structure of the HNF-4α nuclear receptor complex Nature 2013 495 394 8 10.1038/nature11966 23485969 PMC3606643 27. Huang W Peng Y Kiselar J et al Multidomain architecture of estrogen receptor reveals interfacial cross-talk between its DNA-binding and ligand-binding domains Nat Commun 2018 9 3520 10.1038/s41467-018-06034-2 30166540 PMC6117352 28. Maletta M Orlov I Roblin P et al The palindromic DNA-bound USP/EcR nuclear receptor adopts an asymmetric organization with allosteric domain positioning Nat Commun 2014 5 4139 10.1038/ncomms5139 24942373 29. Seacrist CD Kuenze G Hoffmann RM et al Integrated structural modeling of full-length LRH-1 reveals inter-domain interactions contribute to receptor structure and function Structure 2020 28 830 46 10.1016/j.str.2020.04.020 32433991 PMC7347456 30. Meijsing SH Pufall MA So AY et al DNA binding site sequence directs glucocorticoid receptor structure and activity Science 2009 324 407 10 10.1126/science.1164265 19372434 PMC2777810 31. de Vera IMS Zheng J Novick S et al Synergistic regulation of coregulator/nuclear receptor interaction by ligand and DNA Structure 2017 25 1506 18 10.1016/j.str.2017.07.019 28890360 PMC5653230 32. Zhang J Chalmers MJ Stayrook KR et al DNA binding alters coactivator interaction surfaces of the intact VDR–RXR complex Nat Struct Mol Biol 2011 18 556 63 10.1038/nsmb.2046 21478866 PMC3087838 33. Watson LC Kuchenbecker KM Schiller BJ et al The glucocorticoid receptor dimer interface allosterically transmits sequence-specific DNA signals Nat Struct Mol Biol 2013 20 876 83 10.1038/nsmb.2595 23728292 PMC3702670 34. Schöne S Jurk M Helabad MB et al Sequences flanking the core-binding site modulate glucocorticoid receptor structure and activity Nat Commun 2016 7 12621 27581526 10.1038/ncomms12621 PMC5025757 35. Bernardes A Batista FAH de Oliveira Neto M et al Low-resolution molecular models reveal the oligomeric state of the PPAR and the conformational organization of its domains in solution PLoS One 2012 7 e31852 10.1371/journal.pone.0031852 22363753 PMC3283691 36. Zheng J Chang MR Stites RE et al HDX reveals the conformational dynamics of DNA sequence specific VDR co-activator interactions Nat Commun 2017 8 923 10.1038/s41467-017-00978-7 29030554 PMC5640644 37. Gronemeyer H Bourguet W Allosteric effects govern nuclear receptor action: DNA appears as a player Sci Signal 2009 2 pe34 10.1126/scisignal.273pe34 19491383 38. Rochel N Ciesielski F Godet J et al Common architecture of nuclear receptor heterodimers on DNA direct repeat elements with different spacings Nat Struct Mol Biol 2011 18 564 70 10.1038/nsmb.2054 21478865 39. Osz J McEwen AG Bourguet M et al Structural basis for DNA recognition and allosteric control of the retinoic acid receptors RAR–RXR Nucleic Acids Res 2020 48 9969 85 10.1093/nar/gkaa697 32974652 PMC7515732 40. Kersten S Kelleher D Chambon P et al Retinoid X receptor α forms tetramers in solution Proc Natl Acad Sci USA 1995 92 8645 9 10.1073/pnas.92.19.8645 7567990 PMC41023 41. Dong D Noy N Heterodimer formation by retinoid X receptor: regulation by ligands and by the receptor's self-association properties Biochemistry 1998 37 10691 700 10.1021/bi980561r 9692959 42. Senicourt L le Maire A Allemand F et al Structural insights into the interaction of the intrinsically disordered co-activator TIF2 with retinoic acid receptor heterodimer (RXR/RAR) J Mol Biol 2021 433 166899 10.1016/j.jmb.2021.166899 33647291 43. Cordeiro TN Sibille N Germain P et al Interplay of protein disorder in retinoic acid receptor heterodimer and its corepressor regulates gene expression Structure 2019 27 1270 85 10.1016/j.str.2019.05.001 31178221 44. Rosales T Royer CA A graphical user interface for BIOEQS: a program for simulating and analyzing complex biomolecular interactions Anal Biochem 2008 381 270 2 10.1016/j.ab.2008.05.056 18644343 PMC2596913 45. Royer CA Beechem JM Numerical analysis of binding data: advantages, practical aspects, and implications Methods Enzymol 1992 210 481 505 1584048 10.1016/0076-6879(92)10025-9 46. Royer CA Smith WR Beechem JM Analysis of binding in macromolecular complexes: a generalized numerical approach Anal Biochem 1990 191 287 94 10.1016/0003-2697(90)90221-T 2085174 47. Yang M Hoeppner M Rey M et al Recombinant nepenthesin II for hydrogen/deuterium exchange mass spectrometry Anal Chem 2015 87 6681 7 10.1021/acs.analchem.5b00831 25993527 48. Trcka F Durech M Vankova P et al Human stress-inducible Hsp70 has a high propensity to form ATP-dependent antiparallel dimers that are differentially regulated by cochaperone binding Mol Cell Proteomics 2019 18 320 37 10.1074/mcp.RA118.001044 30459217 PMC6356074 49. Kavan D Man P MSTools—web based application for visualization and presentation of HXMS data Int J Mass Spectrom 2011 302 53 8 10.1016/j.ijms.2010.07.030 50. Thureau A Roblin P Pérez J BioSAXS on the SWING beamline at synchrotron SOLEIL J Appl Crystallogr 2021 54 1698 710 10.1107/S1600576721008736 51. Blanchet CE Svergun DI Small-angle X-Ray scattering on biological macromolecules and nanocomposites in solution Annu Rev Phys Chem 2013 64 37 54 10.1146/annurev-physchem-040412-110132 23216378 52. Panjkovich A Svergun DI CHROMIXS: automatic and interactive analysis of chromatography-coupled small-angle X-ray scattering data Bioinformatics 2018 34 1944 6 10.1093/bioinformatics/btx846 29300836 PMC5972624 53. Manalastas-Cantos K Konarev PV Hajizadeh NR et al ATSAS 3.0: expanded functionality and new tools for small-angle scattering data analysis J Appl Crystallogr 2021 54 343 55 10.1107/S1600576720013412 33833657 PMC7941305 54. Konarev PV Volkov VV Sokolova AV et al PRIMUS: a Windows PC-based system for small-angle scattering data analysis J Appl Crystallogr 2003 36 1277 82 10.1107/S0021889803012779 55. Hajizadeh NR Franke D Jeffries CM et al Consensus Bayesian assessment of protein molecular mass from solution X-ray scattering data Sci Rep 2018 8 7204 10.1038/s41598-018-25355-2 29739979 PMC5940760 56. Svergun DI Determination of the regularization parameter in indirect-transform methods using perceptual criteria J Appl Crystallogr 1992 25 495 503 10.1107/S0021889892001663 57. Barozet A Molloy K Vaisset M et al MoMA-LoopSampler: a web server to exhaustively sample protein loop conformations Bioinformatics 2022 38 552 3 10.1093/bioinformatics/btab584 34432000 58. Bernadó P Mylonas E Petoukhov MV et al Structural characterization of flexible proteins using small-angle X-ray scattering J Am Chem Soc 2007 129 5656 64 10.1021/ja069124n 17411046 59. Tucker MR Piana S Tan D et al Development of force field parameters for the simulation of single- and double-stranded DNA molecules and DNA–protein complexes J Phys Chem B 2022 126 4442 57 10.1021/acs.jpcb.1c10971 35694853 PMC9234960 60. Shirts MR Klein C Swails JM et al Lessons learned from comparing molecular dynamics engines on the SAMPL5 dataset J Comput Aided Mol Des 2017 31 147 61 10.1007/s10822-016-9977-1 27787702 PMC5581938 61. Case DA Aktulga HM Belfon K et al AmberTools J Chem Inf Model 2023 63 6183 91 10.1021/acs.jcim.3c01153 37805934 PMC10598796 62. Gowers R Linke M Barnoud J et al MDAnalysis: a Python Package for the Rapid Analysis of Molecular Dynamics Simulations 2016 98 105 63. Manalastas-Cantos K Konarev PV Hajizadeh NR et al ATSAS 3.0: expanded functionality and new tools for small-angle scattering data analysis J Appl Crystallogr 54 343 55 10.1107/S1600576720013412 PMC7941305 33833657 64. Köfinger J Hummer G Empirical optimization of molecular simulation force fields by Bayesian inference Europ Phys J B 2021 94 245 65. Penvose A Keenan JL Bray D et al Comprehensive study of nuclear receptor DNA binding provides a revised framework for understanding receptor specificity Nat Commun 2019 10 2514 10.1038/s41467-019-10264-3 31175293 PMC6555819 66. Koch MHJ Vachette P Svergun DI Small-angle scattering: a view on the properties, structures and structural changes of biological macromolecules in solution Quart Rev Biophys 2003 36 147 227 10.1017/S0033583503003871 14686102 67. Tucker MR Piana S Tan D et al Development of force field parameters for the simulation of single- and double-stranded DNA molecules and DNA–protein complexes J Phys Chem B 2022 126 4442 57 10.1021/acs.jpcb.1c10971 35694853 PMC9234960 68. Abramson J Adler J Dunger J et al Accurate structure prediction of biomolecular interactions with AlphaFold 3 Nature 2024 630 493 500 10.1038/s41586-024-07487-w 38718835 PMC11168924 69. Rastinejad F Retinoic acid receptor structures: the journey from single domains to full-length complex J Mol Endocrinol 2022 69 T25 36 10.1530/JME-22-0113 36069789 PMC11376212 70. Rastinejad F Allosteric communications between domains of nuclear receptors Steroids 2025 214 109551 10.1016/j.steroids.2024.109551 39653158 71. Rastinejad F Wagner T Zhao Q et al Structure of the RXR–RAR DNA-binding complex on the retinoic acid response element DR1 EMBO J 2000 19 1045 54 10.1093/emboj/19.5.1045 10698945 PMC305643 72. Sheng Y Guo Y Zhao B et al Structural basis for the asymmetric binding of coactivator SRC1 to FXR-RXRα and allosteric communication within the complex Commun Biol 2025 8 425 10.1038/s42003-025-07854-x 40082595 PMC11906777 73. Germain P Iyer J Zechel C et al Co-regulator recruitment and the mechanism of retinoic acid receptor synergy Nature 2002 415 187 92 10.1038/415187a 11805839 74. Pogenberg V Guichoul JF Vivat-Hannah V et al Characterization of the interaction between retinoic acid receptor/retinoid X receptor (RAR/RXR) heterodimers and transcriptional coactivators through structural and fluorescence anisotropy studies J Biol Chem 2005 280 1625 33 10.1074/jbc.M409302200 15528208 75. Hazarika S Yu T Biswas A et al Nuclear receptor interdomain communication is mediated by the hinge with ligand specificity J Mol Biol 2024 436 168805 10.1016/j.jmb.2024.168805 39332668 76. Chebaro Y Sirigu S Amal I et al Allosteric regulation in the ligand binding domain of retinoic acid receptorγ PLoS One 2017 12 e0171043 10.1371/journal.pone.0171043 28125680 PMC5268703 77. Guillien M le Maire A Mouhand A et al IDPs and their complexes in GPCR and nuclear receptor signaling Prog Mol Biol Transl Sci 2020 174 105 55 32828464 10.1016/bs.pmbts.2020.05.001 78. Brodie J McEwan IJ Intra-domain communication between the N-terminal and DNA-binding domains of the androgen receptor: modulation of androgen response element DNA binding J Mol Endocrinol 2005 34 603 15 10.1677/jme.1.01723 15956332 79. Katsu Y Oka K Baker ME Evolution of human, chicken, alligator, frog, and zebrafish mineralocorticoid receptors: allosteric influence on steroid specificity Sci Signal 2018 11 eaao1520 10.1126/scisignal.aao1520 29970600 80. Perez-Riverol Y Bandla C Kundu DJ et al The PRIDE database at 20 years: 2025 update Nucleic Acids Res 2025 53 D543 53 10.1093/nar/gkae1011 39494541 PMC11701690 ",
  "metadata": {
    "Title of this paper": "The PRIDE database at 20 years: 2025 update",
    "Journal it was published in:": "Nucleic Acids Research",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12489474/"
  }
}