{
  "title": "Paper_647",
  "abstract": "J Maxillofac Oral Surg J Maxillofac Oral Surg 1433 jmos Journal of Maxillofacial & Oral Surgery 0972-8279 0974-942X Springer PMC11455826 PMC11455826.1 11455826 11455826 39376772 10.1007/s12663-023-01991-8 1991 1 Original Article Radioguided Surgery for the Localisation of Specific Adenopathies in the Head and Neck Area http://orcid.org/0000-0003-4037-3082 de las Fuentes Monreal Miren mirendelasfuentes@gmail.com 1 Morales Valentina Castillo 2 Pérez Isabel Hernández 2 Villar Isabel Lopez 2 Hernández Verónica Escorial 1 Muñoz-Guerra Mario Fernando 1 1 grid.411251.2 0000 0004 1767 647X Oral and Maxillofacial Surgery Deparment, University Hospital La Princesa, 2 grid.411251.2 0000 0004 1767 647X Nuclear Medicine Deparment, University Hospital La Princesa, 17 8 2023 10 2024 23 5 472260 1289 1295 24 1 2023 3 8 2023 01 10 2025 01 10 2025 07 10 2024 01 10 2025 © The Association of Oral and Maxillofacial Surgeons of India 2023. Springer Nature or its licensor (e.g. a society or other partner) holds exclusive rights to this article under a publishing agreement with the author(s) or other rightsholder(s); author self-archiving of the accepted manuscript version of this article is solely governed by the terms of such publishing agreement and applicable law. 2023 Purpose Intraoperative identification and excision of specific lymphadenopathies is not always easy; it is, therefore, important to have complementary techniques that help us in the identification of these structures intraoperatively. The aim of this study is to present preliminary results of the use of ROLL technique (radioguided occult lesion localisation) as a method of excisional biopsy in the head and neck territory. Material and methods We present 10 cases of patients with difficult to localise lymphadenopathies in the head and neck territory that underwent the ROLL technique. The radiotracer was only injected in the nodes that we wanted to study; in this way, all of them were correctly identified and extracted without resecting those that had no signs of pathology avoiding removing healthy lymphatic tissue and reducing morbidity. Results The ROLL technique is a useful technique, since in all of the patients, the previously marked adenopathy was accurately identified and excised; we reduced the intraoperative time and avoided the complications derived from more aggressive cervical exploratory surgeries. Keywords ROLL Radioguided surgery Lymphadenopathy Head and neck pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access no pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement no pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes issue-copyright-statement © The Association of Oral and Maxillofacial Surgeons of India 2024 ",
  "metadata": {
    "Title of this paper": "Radioguided Surgery for the Localisation of Specific Adenopathies in the Head and Neck Area",
    "Journal it was published in:": "Journal of Maxillofacial & Oral Surgery",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC11455826/"
  }
}