{
  "title": "Paper_769",
  "abstract": "pmc Front Public Health Front Public Health 2277 frontpubhealth Front. Public Health Frontiers in Public Health 2296-2565 Frontiers Media SA PMC12477242 PMC12477242.1 12477242 12477242 41030358 10.3389/fpubh.2025.1621402 1 Public Health Original Research Knowledge, attitudes, and practices toward osteoporosis: a questionnaire survey Xue Min  1  *  † Xia Jiesheng  2  † You Xiaohui  3  † Zhu Xun  4 Zheng Li  4 Wei Qi  5 Zheng Miao  5 Tao Jialong  6 Shen Yuntian  7 Zhou Qi  8 Qian Jiani  9 Chu Minjie  10 Xu Youjia  11  * 1 Department of Ultrasound, The Second Affiliated Hospital of Soochow University Suzhou China 2 Department of Ultrasound, Haimen People's Hospital Nantong China 3 Center for Medical Ultrasound, Suzhou Municipal Hospital, The Affiliated Suzhou Hospital of Nanjing Medical University, Gusu School, Nanjing Medical University Suzhou China 4 Department of Thyroid and Breast Surgery, The Second Affiliated Hospital of Soochow University Suzhou China 5 The Osteoporosis Clinical Center, The Second Affiliated Hospital of Soochow University Suzhou China 6 Department of Oncology, The Second Affiliated Hospital of Soochow University Suzhou China 7 Department of Radiotherapy & Oncology, The Second Affiliated Hospital of Soochow University Suzhou China 8 Functional Department of Changshu Fifth People's Hospital Changshu China 9 Department of Pathology, The Second Affiliated Hospital of Soochow University Suzhou China 10 Department of Epidemiology, School of Public Health, Nantong University Nantong China 11 Department of Orthopaedics, The Second Affiliated Hospital of Soochow University Suzhou China Edited by: Siqi Hu Reviewed by: Ann-Charlotte Grahn Kronhed Lucretia Udrescu *Correspondence: Youjia Xu, xuyoujia@suda.edu.cn Saysay198212@163.com † 15 9 2025 2025 13 480651 1621402 01 5 2025 18 8 2025 15 09 2025 30 09 2025 01 10 2025 Copyright © 2025 Xue, Xia, You, Zhu, Zheng, Wei, Zheng, Tao, Shen, Zhou, Qian, Chu and Xu. 2025 Xue, Xia, You, Zhu, Zheng, Wei, Zheng, Tao, Shen, Zhou, Qian, Chu and Xu https://creativecommons.org/licenses/by/4.0/ This is an open-access article distributed under the terms of the Creative Commons Attribution License (CC BY). The use, distribution or reproduction in other forums is permitted, provided the original author(s) and the copyright owner(s) are credited and that the original publication in this journal is cited, in accordance with accepted academic practice. No use, distribution or reproduction is permitted which does not comply with these terms. Background Osteoporosis is a prevalent yet often underdiagnosed condition that leads to significant morbidity and healthcare burdens. This study explores the knowledge, attitudes, and practices (KAP) of the community-dwelling adults concerning osteoporosis and its daily management. Methods The cross-sectional study was conducted from June 1, 2024 to February 1, 2025 at the Second Affiliated Hospital of Soochow University and included outpatients aged 18 years and older. Demographic data and KAP scores were collected, and differences across demographic groups were analyzed. Structural equation modeling examined the relationships and mediation effects among knowledge, attitudes, and practices. Results A total of 776 valid questionnaires were analyzed. Among the respondents, 458 (59.02%) were female, 376 (48.45%) had taken basic bone health supplements, and 100 (12.89%) had participated in osteoporosis education. The median age of the participants was 39 years (range: 18–76). The mean scores for knowledge, attitude, and practice were 14.66 ± 9.06 (possible range: 0–38), 43.41 ± 5.00 (possible range: 12–60), and 54.00 ± 13.66 (possible range: 17–85), respectively. Significant positive correlations were found between knowledge and attitude ( r p r p r p β p β p β p β p Conclusion The study sample demonstrated insufficient knowledge, positive attitudes, and suboptimal primary osteoporosis prevention practices. Results indicated that knowledge directly influenced attitude and practice, while attitude directly influenced practice. Targeted educational interventions are crucial to enhance osteoporosis awareness and promote evidence-based preventive behaviors, ultimately improving bone health and reducing the risk of osteoporosis-related complications. osteoporosis knowledge, attitudes, and practices cross-sectional study health education risk factor self-management The author(s) declare that financial support was received for the research and/or publication of this article. This work was supported by the Second Affiliated Hospital of Soochow University Standardized Training Capacity Building Lift Project Teaching Top Talent Lift Project (ZPTJ-RC202417); National Key R&D Program of China (2021YFC2501700, 2021YFC2501702); and Jiangsu Provincial Medical Key Laboratory Cultivation Unit (JSDW202254). pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement yes pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes section-at-acceptance Public Health Education and Promotion Introduction Osteoporosis is a chronic skeletal disease characterized by reduced bone density and deterioration of bone microstructure, significantly increasing the risk of fractures and leading to substantial health issues ( 1 2 3 4 5 6 7 The Knowledge-Attitude-Practice (KAP) framework provides a structured approach to evaluating health-related behaviors and has been widely used in healthcare research. This model posits that knowledge positively influences attitudes, which subsequently shape individual practices and health behaviors ( 8 9 In the context of osteoporosis, the KAP framework is particularly valuable for identifying gaps in understanding and barriers to optimal self-management. Despite the availability of effective preventive measures and treatments, osteoporosis remains underdiagnosed and undertreated in many regions, including Europe, South Korea, and Latin America ( 10–12 13 14 Understanding the community-dwelling adults’ KAP regarding osteoporosis in China is particularly important given the country’s rapidly aging population and the significant proportion of individuals at risk ( 15 While numerous studies have investigated healthcare professionals’ knowledge and attitudes toward osteoporosis ( 16 17 18 19 20 21 Materials and methods Study design and participants This cross-sectional study was conducted from June 1, 2024 to February 1, 2025 at the Second Affiliated Hospital of Soochow University, involving outpatients as the study population. Ethical approval was obtained from the Ethics Committee of the Second Affiliated Hospital of Soochow University (Approval No.: JD-LK2024058-I01), and informed consent was secured from all participants prior to their enrollment. Inclusion Criteria: (1) Adults aged 18 years and older. (2) Individuals with basic reading and comprehension skills capable of independently completing the questionnaire. (3) Participants who voluntarily agree to participate. Exclusion Criteria: (1) Individuals with cognitive impairments or any condition that prevents them from independently completing the questionnaire. (2) Individuals with a known diagnosis of osteoporosis. (3) Individuals currently using medications that may affect bone metabolism (e.g., hormonal therapy, anti-epileptic drugs) or those who have received osteoporosis-related treatments (e.g., physical therapy, surgical intervention). Questionnaire design The questionnaire was developed based on a comprehensive review of the literature ( 22 23 To validate content accuracy and multidisciplinary applicability, the Delphi method was employed. Experts from six clinical specialties, including breast surgery and rheumatology (non-orthopedic specialties comprising 33%), were invited to assess content validity. Three rounds of iterative modifications were conducted to eliminate specialty-specific cognitive biases and enhance interdisciplinary generalizability. Furthermore, the study underwent an institutional-level audit, which included a double review process by an academic committee and a methodological review group. This step optimized the logical structure of the research design, improved statistical efficiency, and ensured that the questionnaire adhered to epidemiological investigation standards. For reliability and validity assessment, a pre-test was conducted and the Cronbach’s α p The final questionnaire, conducted in Chinese, consisted of four dimensions totaling 52 items: 22 focused on demographics, 8 on knowledge (including sub-items in items 2 and 4, where item 2 covers typical symptoms such as bone pain, spinal deformity, and increased fracture risk, and item 4 includes risk factors such as smoking, physical inactivity, vitamin D deficiency, and gastrectomy), 12 on attitude, and 10 on practice (with sub-items in items 8 and 9, where item 8 addresses attention to environmental risk factors for falls—such as assistive devices, lighting, and obstacles—and item 9 covers behavioral and physiological fall prevention strategies, including anxiety control, nutrition, vision correction, and vitamin D supplementation) ( Supplementary material 24 Questionnaire distribution and quality control The electronic questionnaire was hosted on Sojump, 1 E-roll electronic posters were displayed in three waiting areas of the Second Affiliated Hospital of Soochow University: the ultrasound outpatient waiting area, the orthopedic outpatient waiting area, and the osteoporosis outpatient waiting area. These posters featured the research topic, common symptoms of osteoporosis, a QR code linking to the questionnaire, and the contact details of the responsible doctor. Interested participants could scan the QR code, access the questionnaire through the “Questionnaire Star” program, provide informed consent, and complete the survey. WeChat sharing was utilized to further distribute the questionnaire. The research introduction, common symptoms of osteoporosis, the QR code for the questionnaire, and contact information were shared via WeChat Moments. Users who were interested could scan the QR code, enter the questionnaire page, provide informed consent, and complete the survey. Before answering the questions, all participants were required to click “I agree to participate in this study” at the beginning of the e-questionnaire. All data were collected anonymously, and to prevent duplicate responses, an IP restriction was implemented, allowing only one survey completion per IP address. Sample size Sample size was calculated using the formula for cross-sectional studies: α  n = ( Z 1 − α / 2 δ ) 2 × p × ( 1 − p )  Z 1 − α / 2 α p δ Statistical analysis Statistical analysis was conducted using Statistical Package for the Social Sciences (SPSS) version 27.0 (IBM Corp., Armonk, NY, USA) and Analysis of Moment Structures (AMOS) version 26.0 (IBM Corp., Armonk, NY, USA). Continuous variables were assessed for normality and described as means with standard deviations (SD) or medians with interquartile ranges (IQR), depending on the distribution. Categorical variables were presented as frequencies and percentages ( n p Results Demographic characteristics and KAP scores Initially, a total of 797 questionnaire responses were collected. The following responses were excluded: 2 responses with a completion time of less than 90 s, 4 responses from individuals under 18 years old, 11 responses with abnormal height and weight values, and 4 responses exhibiting a patterned answering style. This resulted in 776 valid questionnaires. Of these respondents, 458 (59.02%) were female, 291 (37.5%) had a BMI in the overweight or obese range, 533 (68.69%) resided in urban areas, 395 (50.9%) held an associate or bachelor’s degree, 515 (66.37%) were employed, 108 (13.92%) were current smokers, 43 (5.54%) had been diagnosed with osteoporosis, 130 (16.75%) had relatives diagnosed with osteoporosis, 376 (48.45%) had taken basic bone health supplements, and 100 (12.89%) had participated in osteoporosis education. The median age of participants was 43 years (range: 18–76), with males (IQR: 28–55) at 43 years and females (IQR: 31–54) at 43 years ( p Figure 1 Figure 1 Age distribution by gender. Violin plot showing age distribution by gender. The plot has two sections: red for males and blue for females. Both distributions are centered around fifty years, with a spread from about twenty-five to seventy-five years. Males show slightly more variation in age distribution. The mean scores for knowledge, attitude, and practice were 14.66 ± 9.06 (possible range: 0–38), 43.41 ± 5.00 (possible range: 12–60), and 54.00 ± 13.66 (possible range: 17–85), respectively. Analysis of demographic characteristics revealed that participants’ knowledge, attitude, and practice scores varied significantly based on gender ( p p p p p p p p p p p p p p p p p p p p p p p p p p p Supplementary Table S6 Distribution of response to knowledge, attitude, and practice The distribution of knowledge dimensions showed that the three questions with the highest number of participants choosing the “Unclear” option were “Gastrectomy can contribute to osteoporosis” (K4.8) with 65.34%, “Typical symptoms of osteoporosis include sudden growth stagnation in adolescents” (K2.5) with 54.38%, and “Smoking can contribute to osteoporosis” (K4.1) with 52.84% ( Supplementary Table S1 Responses to the attitude dimension showed that 18.04% strongly agreed and 54.64% agreed that they would be very worried about getting a fracture when accidentally falling or sustaining an injury (A4), 17.27% strongly agreed and 50.52% agreed that they would feel very anxious when developing osteoporosis or even suffering a fracture (A5), and 5.41% strongly agreed and 18.17% agreed that osteoporosis in old age is completely normal and does not require much attention (A3) ( Supplementary Table S2 Responses to the practice dimension showed that 30.41% rarely and 16.37% never actively practice balance training (P3), 27.71% rarely and 16.62% never take calcium supplements and vitamin D (P5), 20.1% rarely and 19.72% never install assistive devices in the bathroom (P8.1) ( Supplementary Table S3 Correlations between KAP In the correlation analysis, significant positive correlations were found between knowledge and attitude (r = 0.434, p r p r p Table 1 Table 1 Correlation analysis. Dimension Knowledge Attitude Practice Knowledge 1 Attitude 0.434 ( p 1 Practice 0.441 ( p 0.463 ( p 1 Data represent Pearson correlation coefficients between knowledge, attitude, and practice scores. All correlations were statistically significant ( p Univariate and multivariate analysis for practice Multivariate logistic regression showed that knowledge score [OR = 1.066, 95% CI: (1.041–1.093), p p p p p Table 2 Table 2 Univariate and multivariate regression for practice. Variables Univariate Multivariate OR (95%CI)  p OR (95%CI)  p Knowledge score 1.100 (1.078–1.121) <0.001 1.066 (1.041–1.093) <0.001 Attitude score 1.219 (1.172–1.269) <0.001 1.163 (1.110–1.218) <0.001 Gender Male 0.696 (0.514–0.941) 0.018 0.643 (0.413–1.001) 0.050 Female ref ref Age 1.000 (0.995–1.005) 0.932 ≤43 ref >43 1.063 (0.793–1.424) 0.684 BMI Light 1.054 (0.528–2.105) 0.881 Normal ref Overweight or obese 0.963 (0.708–1.310) 0.810 Residence Rural ref ref Urban 1.849 (1.262–2.709) 0.002 1.343 (0.847–2.130) 0.210 Suburban 1.631 (0.903–2.943) 0.105 1.221 (0.614–2.427) 0.569 Education Primary school or below ref Junior high school 1.096 (0.465–2.583) 0.834 High school /technical secondary school 1.548 (0.668–3.585) 0.308 Associate/bachelor’s degree 1.846 (0.842–4.045) 0.126 Master’s degree and above 2.115 (0.896–4.990) 0.087 Employment status Retired 1.021 (0.568–1.833) 0.946 Employed 0.776 (0.461–1.306) 0.340 Other 0.912 (0.413–2.011) 0.819 Unemployed ref Healthcare professional Yes 1.607 (1.107–2.333) 0.013 0.522 (0.319–0.857) 0.010 No ref ref Marital status Married 1.053 (0.759–1.460) 0.757 Unmarried (including single, divorced, widowed) ref Live alone Yes 0.826 (0.575–1.187) 0.302 No ref Underlying diseases (multiple choice) Yes 0.703 (0.517–0.958) 0.025 0.795 (0.542–1.167) 0.241 No ref ref Smoking habit Never ref ref Used to smoke 0.936 (0.532–1.647) 0.820 1.046 (0.500–2.189) 0.905 Currently smoking 0.399 (0.243–0.655) <0.001 0.575 (0.295–1.119) 0.103 Drinking habit Never ref ref Used to drink 1.256 (0.821–1.921) 0.294 1.036 (0.599–1.790) 0.900 Currently drinking 0.638 (0.440–0.925) 0.018 0.977 (0.607–1.572) 0.923 Medical insurance or commercial insurance Yes 1.145 (0.736–1.780) 0.549 No ref Diagnosed with osteoporosis Yes 1.279 (0.685–2.388) 0.440 No ref Relatives diagnosed with osteoporosis Yes 1.464 (0.970–2.212) 0.070 0.796 (0.483–1.312) 0.372 No ref ref Not sure 0.637 (0.459–0.885) 0.007 0.548 (0.374–0.803) 0.002 Aware of osteoporosis outpatient services in hospitals Yes 2.199 (1.624–2.977) <0.001 1.069 (0.732–1.561) 0.731 No ref ref Taken basic bone health supplements Yes 2.122 (1.575–2.859) <0.001 1.438 (0.984–2.100) 0.060 No ref ref Taken anti-osteoporosis medications Yes 0.772 (0.495–1.204) 0.254 No ref Long-term use of glucocorticoids Yes 0.919 (0.453–1.864) 0.814 No ref Undergone bone density testing Yes 1.633 (1.124–2.372) 0.010 0.918 (0.573–1.470) 0.720 No ref ref Experienced non-violent fractures Yes 1.529 (0.896–2.609) 0.120 No ref Participated in osteoporosis education Yes 5.395 (3.401–8.560) <0.001 3.282 (1.892–5.691) <0.001 No ref ref Results from univariate and multivariate logistic regression analyses evaluating factors associated with good osteoporosis-related practice. OR, Odds Ratio; CI, Confidence Interval. An OR > 1 indicates increased odds of engaging in good practice, whereas an OR < 1 indicates decreased odds. Variables with p SEM for KAP The SEM yielded acceptable model fit indices (CMIN/DF = 4.177, RMSEA = 0.064, IFI = 0.872, TLI = 0.864, CFI = 0.871) ( Supplementary Table S4 Supplementary Table S5 Figure 2 β p β p β p β p Table 3 Figure 2 SEM model. A structural equation model showing relationships between Knowledge, Attitude, and Practice. Variables K1 to K8 relate to Knowledge, A1 to A12 to Attitude, and P1 to P10 to Practice. Arrows indicate causal paths with corresponding coefficients. Connections from Knowledge to Attitude and Practice, and from Attitude to Practice, are highlighted with coefficients of .49, .30, and .40 respectively. Error terms e1 to e50 are associated with each observed variable. Table 3 SEM results. Model paths Standardized Total effects Standardized direct effects Standardized indirect effects β  p β  p β  p Knowledge → Attitude 0.491 (0.386–0.559) 0.023 0.491 (0.386–0.559) 0.023 Knowledge → Practice 0.494 (0.424–0.558) 0.012 0.297 (0.197–0.366) 0.020 Attitude → Practice 0.401 (0.319–0.485) 0.009 0.401 (0.319–0.485) 0.009 Knowledge → Practice 0.197 (0.147–0.261) 0.012 Standardized total, direct, and indirect effects among knowledge, attitude, and practice are presented. Total effects include both direct and indirect influences. p Discussion The study sample demonstrated inadequate knowledge, positive attitudes, and inactive practices regarding osteoporosis management, with knowledge and attitudes significantly influencing practice behaviors. Targeted educational interventions that enhance osteoporosis-related knowledge and foster positive attitudes may improve preventive practices, ultimately reducing the disease burden and associated healthcare costs. The findings of this study reveal that while the study sample generally holds positive attitudes toward osteoporosis management, their knowledge remains inadequate, and their practices are not sufficiently proactive. This pattern aligns with previous research showing that osteoporosis awareness often surpasses actual engagement in preventive measures, suggesting a persistent gap between perception and action ( 25 26 27 28 The statistical analyses provide deeper insights into these interrelationships. Correlation analysis indicated significant associations between knowledge, attitudes, and practices, supporting the widely recognized KAP framework, which suggests that increased knowledge fosters positive attitudes and, in turn, encourages preventive behaviors ( 29 30 Multivariate regression analysis identified several key predictors of proactive osteoporosis-related behaviors. Knowledge and attitudes emerged as significant independent factors influencing engagement in preventive practices, which has been consistently reported in previous studies on chronic disease management ( 20 31 Many respondents lacked familiarity with key risk factors, including the role of lifestyle behaviors such as smoking, alcohol consumption, and dietary habits in osteoporosis development. Additionally, while a majority of respondents acknowledged osteoporosis as a serious condition, uncertainty regarding effective prevention strategies persisted. Similar patterns have been observed in other chronic conditions, where public awareness campaigns have improved general knowledge but have not always led to behavior change due to inadequate comprehension of actionable steps ( 32 33 Attitudinal responses revealed a general willingness to learn more about osteoporosis and a strong inclination to participate in screening programs. However, a notable portion of participants exhibited neutral attitudes toward the necessity of osteoporosis prevention, suggesting that some individuals still perceive the disease as an inevitable consequence of aging rather than a preventable condition. This belief has been reported in multiple studies, particularly among older adults, where osteoporosis is often regarded as an unavoidable aspect of aging rather than a manageable health risk ( 34 35 Despite these generally positive attitudes, reported practices were largely inactive, with many participants failing to engage in routine osteoporosis screenings, regular exercise, or adequate dietary calcium and vitamin D intake. These findings are consistent with previous research showing that despite recognizing the importance of bone health, individuals often do not translate this awareness into daily habits ( 36 37 38 39 40 To address these gaps, a multifaceted approach is necessary. On a systemic level, integrating osteoporosis education into primary healthcare services and routine medical consultations could enhance awareness and facilitate early prevention. Previous studies have demonstrated that embedding health education within clinical encounters significantly improves patient engagement and adherence to preventive measures ( 41 42 43 44 45 46 47 48 Public health campaigns should focus on improving understanding of osteoporosis risk factors, emphasizing the role of modifiable lifestyle behaviors in prevention. Although broad prevention programs can reduce the overall burden of osteoporosis, they may offer limited visible benefits to individuals, a challenge known as the prevention paradox ( 49 50 51 52 53 54 55 56 57 From a behavioral perspective, interventions should be designed to reinforce the link between attitudes and actions. Personalized goal-setting, self-monitoring, and peer support networks have been found to be effective in promoting adherence to osteoporosis prevention strategies in previous studies ( 58 59 60 This study has several limitations. First, as a cross-sectional survey, it cannot establish causal relationships between knowledge, attitudes, and practices. Second, self-reported data may be subject to recall and social desirability biases, potentially affecting the accuracy of responses. Third, the study sample was limited to a specific population, which may restrict the generalizability of the findings to broader demographic groups. In conclusion, the study sample demonstrated inadequate knowledge, positive attitudes, and inactive practices regarding osteoporosis management, highlighting a gap between awareness and behavioral implementation. Targeted educational interventions and public health initiatives are essential to bridge this gap, emphasizing both knowledge enhancement and attitude-driven behavioral change to improve osteoporosis prevention and management.  1 http://www.sojump.com Data availability statement The original contributions presented in the study are included in the article/ Supplementary material Ethics statement The study was approved by The Ethics Committee of the Second Affiliated Hospital of Soochow University (JD-LK2024058-IR01). All participants were informed about the study protocol and provided written informed consent to participate in the study. I confirm that all methods were performed in accordance with the relevant guidelines. All procedures were performed in accordance with the ethical standards laid down in the 1964 Declaration of Helsinki and its later amendments. Author contributions MX: Conceptualization, Data curation, Formal analysis, Writing – original draft, Writing – review & editing. JX: Conceptualization, Data curation, Writing – original draft, Writing – review & editing. XY: Conceptualization, Formal analysis, Writing – original draft, Writing – review & editing. XZ: Data curation, Formal analysis, Writing – original draft, Writing – review & editing. LZ: Conceptualization, Writing – original draft, Writing – review & editing. QW: Data curation, Writing – original draft, Writing – review & editing. MZ: Formal analysis, Writing – original draft, Writing – review & editing. JT: Conceptualization, Writing – original draft, Writing – review & editing. YS: Writing – original draft, Writing – review & editing. QZ: Writing – original draft, Writing – review & editing. JQ: Writing – original draft, Writing – review & editing. MC: Writing – original draft, Writing – review & editing. YX: Writing – original draft, Writing – review & editing. Conflict of interest The authors declare that the research was conducted in the absence of any commercial or financial relationships that could be construed as a potential conflict of interest. Generative AI statement The authors declare that no Gen AI was used in the creation of this manuscript. Any alternative text (alt text) provided alongside figures in this article has been generated by Frontiers with the support of artificial intelligence and reasonable efforts have been made to ensure accuracy, including review by the authors wherever possible. If you identify any issues, please contact us. Publisher’s note All claims expressed in this article are solely those of the authors and do not necessarily represent those of their affiliated organizations, or those of the publisher, the editors and the reviewers. Any product that may be evaluated in this article, or claim that may be made by its manufacturer, is not guaranteed or endorsed by the publisher. Supplementary material The Supplementary material for this article can be found online at: https://www.frontiersin.org/articles/10.3389/fpubh.2025.1621402/full#supplementary-material References 1. Assessment of fracture risk and its application to screening for postmenopausal osteoporosis. Report of a WHO study group World Health Organ Tech Rep Ser 1994 843 1 129 7941614 2. Morin SN Leslie WD Schousboe JT Osteoporosis: a review JAMA 2025 10.1001/jama.2025.6003 40587168 3. Wang L Yu W Yin X Cui L Tang S Jiang N Prevalence of osteoporosis and fracture in China: the China osteoporosis prevalence study JAMA Netw Open 2021 4 e2121106 10.1001/jamanetworkopen.2021.21106 34398202 PMC8369359 4. Rubæk M Hitz MF Holmberg T Schønwandt BMT Andersen S Effectiveness of patient education for patients with osteoporosis: a systematic review Osteoporos Int 2022 33 959 77 10.1007/s00198-021-06226-5 34773131 5. Rentzeperi E Pegiou S Tsakiridis I Kalogiannidis I Kourtis A Mamopoulos A Diagnosis and Management of Osteoporosis: a comprehensive review of guidelines Obstet Gynecol Surv 2023 78 657 81 10.1097/OGX.0000000000001181 38134337 6. Hsieh C Novielli KD Diamond JJ Cheruva D Health beliefs and attitudes toward the prevention of osteoporosis in older women Menopause 2001 8 372 6 10.1097/00042192-200109000-00013 11528365 7. Merle B Haesebaert J Bedouet A Barraud L Flori M Schott AM Osteoporosis prevention: where are the barriers to improvement in French general practitioners? A qualitative study PLoS One 2019 14 e0219681 10.1371/journal.pone.0219681 31310619 PMC6634405 8. Khalid A Haque S Alvi S Ferdous M Genereux O Chowdhury N Promoting health literacy about Cancer screening among Muslim immigrants in Canada: perspectives of imams on the role they can play in community J Prim Care Community Health 2022 13 21501319211063051 10.1177/21501319211063051 35118911 PMC8819818 9. Li L Zhang J Qiao Q Wu L Chen L Development, reliability, and validity of the \"knowledge-attitude-practice\" questionnaire of foreigners on traditional Chinese medicine treatment Evid Based Complement Alternat Med 2020 2020 8527320 10.1155/2020/8527320 33144871 PMC7596425 10. Kanis JA Norton N Harvey NC Jacobson T Johansson H Lorentzon M SCOPE 2021: a new scorecard for osteoporosis in Europe Arch Osteoporos 2021 16 82 10.1007/s11657-020-00871-9 34080059 PMC8172408 11. Kim KJ Kim KM Lee YK Kim J Jang H Kim J Twenty-year trends in osteoporosis treatment and post-fracture Care in South Korea: a Nationwide study J Bone Metab 2025 32 57 66 10.11005/jbm.24.829 40098430 PMC11960296 12. Aziziyeh R Amin M Habib M Garcia Perlaza J Szafranski K McTavish RK The burden of osteoporosis in four Latin American countries: Brazil, Mexico, Colombia, and Argentina J Med Econ 2019 22 638 44 10.1080/13696998.2019.1590843 30835577 13. Kung AW Fan T Xu L Xia WB Park IH Kim HS Factors influencing diagnosis and treatment of osteoporosis after a fragility fracture among postmenopausal women in Asian countries: a retrospective study BMC Womens Health 2013 13 7 10.1186/1472-6874-13-7 23410131 PMC3637813 14. Tan J Luo L Zhang M Chen H Zhang D Dong C A Chinese and Western medication adherence scale in patients with chronic kidney disease Patient Prefer Adherence 2019 13 1487 95 10.2147/PPA.S207693 31507316 PMC6720156 15. Wang J Shu B Tang D-z Li C-g Xie X-w Jiang L-j The prevalence of osteoporosis in China, a community based cohort study of osteoporosis Front Public Health 2023 11 1084005 10.3389/fpubh.2023.1084005 36875399 PMC9978786 16. Fogelman Y Goldshtein I Segal E Ish-Shalom S Managing osteoporosis: a survey of knowledge, attitudes and practices among primary care physicians in Israel PLoS One 2016 11 e0160661 10.1371/journal.pone.0160661 27494284 PMC4975485 17. Mahdaviazad H Keshtkar V Emami MJ Osteoporosis guideline awareness among Iranian family physicians: results of a knowledge, attitudes, and practices survey Prim Health Care Res Dev 2018 19 485 91 10.1017/S1463423618000014 29380714 PMC6452934 18. Wu Y Xu Z Dong J Zhang W Li J Ji H Knowledge, attitudes, and practices of patients with knee osteoarthritis regarding osteoporosis and its prevention: a Cross-sectional study in China Int J Gen Med 2024 17 3699 709 10.2147/IJGM.S471924 39219673 PMC11363913 19. Xu P Zhao N Wang J Knowledge, attitude, and practice toward osteoporosis among patients with chronic kidney disease in Zhejiang Medicine (Baltimore) 2024 103 e38153 10.1097/MD.0000000000038153 38758880 PMC11098230 20. Ahmed S Farooqui AJ Pradhan NA Zehra N Majid H Jafri L Assessing the knowledge, attitude and practice of osteoporosis among Pakistani women: a national social-media based survey PLoS One 2023 18 e0288057 10.1371/journal.pone.0288057 37948412 PMC10637646 21. Barzanji AT Alamri FA Mohamed AG Osteoporosis: a study of knowledge, attitude and practice among adults in Riyadh, Saudi Arabia J Community Health 2013 38 1098 105 10.1007/s10900-013-9719-4 23780302 22. Wang Y Yang S Wang F Liu Z Long-term effects of left-behind experience on adult depression: social trust as mediating factor Front Public Health 2022 10 957324 10.3389/fpubh.2022.957324 36159254 PMC9500461 23. Cooper A Osteoporosis guideline Br J Gen Pract 2009 59 451 10.3399/bjgp09X421030 19520034 PMC2688055 24. Salman M Mustafa ZU Rao AZ Khan QU Asif N Hussain K Serious inadequacies in high alert medication-related knowledge among Pakistani nurses: findings of a large, multicenter, cross-sectional survey Front Pharmacol 2020 11 1026 10.3389/fphar.2020.01026 32765259 PMC7381221 25. LeBoff MS Greenspan SL Insogna KL Lewiecki EM Saag KG Singer AJ The clinician's guide to prevention and treatment of osteoporosis Osteoporos Int 2022 33 2049 102 10.1007/s00198-021-05900-y 35478046 PMC9546973 26. Yong EL Logan S Menopausal osteoporosis: screening, prevention and treatment Singapore Med J 2021 62 159 66 10.11622/smedj.2021036 33948669 PMC8801823 27. Ayers C Kansagara D Lazur B Fu R Kwon A Harrod C Effectiveness and safety of treatments to prevent fractures in people with Low bone mass or primary osteoporosis: a living systematic review and network Meta-analysis for the American College of Physicians Ann Intern Med 2023 176 182 95 10.7326/M22-0684 36592455 28. Muñoz M Robinson K Shibli-Rahhal A Bone health and osteoporosis prevention and treatment Clin Obstet Gynecol 2020 63 770 87 10.1097/GRF.0000000000000572 33017332 29. Saltık H Öztürk F Emiroğlu C Hekimoğlu B Aypak C Knowledge, attitude, and behavior levels of postmenopausal women about osteoporosis J Bone Metab 2023 30 347 54 10.11005/jbm.2023.30.4.347 38073268 PMC10721378 30. Mujamammi AH Sabi EM Alseffay AU Alqarni RM Alshiekh AI Aleidan AA Knowledge, attitude and practice about osteoporosis among young adults in RIYADH 2019 J Family Med Prim Care 2021 10 4493 6 10.4103/jfmpc.jfmpc_970_21 35280641 PMC8884311 31. Alani Q Yassir M Mansoor R Flayyih R Ali Saifuddin Yaqoob N Rafeeq H Knowledge, attitude, and practices towards osteoporosis among adults in the United Arab Emirates (UAE) in 2023 Cureus 2024 16 e56084 10.7759/cureus.56084 38618442 PMC11011242 32. Ojo O Adegboye ARA The effects of nutrition on chronic conditions Nutrients 2023 15 1066 10.3390/nu15051066 36904066 PMC10004789 33. Temkin SM Barr E Moore H Caviston JP Regensteiner JG Clayton JA Chronic conditions in women: the development of a National Institutes of health framework BMC Womens Health 2023 23 162 10.1186/s12905-023-02319-x 37024841 PMC10077654 34. Foessl I Dimai HP Obermayer-Pietsch B Long-term and sequential treatment for osteoporosis Nat Rev Endocrinol 2023 19 520 33 10.1038/s41574-023-00866-9 37464088 35. Gregson CL Armstrong DJ Bowden J Cooper C Edwards J Gittoes NJL UK clinical guideline for the prevention and treatment of osteoporosis Arch Osteoporos 2022 17 58 10.1007/s11657-022-01061-5 35378630 PMC8979902 36. Anam AK Insogna K Update on osteoporosis screening and management Med Clin North Am 2021 105 1117 34 10.1016/j.mcna.2021.05.016 34688418 37. Imamudeen N Basheer A Iqbal AM Manjila N Haroon NN Manjila S Management of osteoporosis and spinal fractures: contemporary guidelines and evolving paradigms Clin Med Res 2022 20 95 106 10.3121/cmr.2021.1612 35478096 PMC9242734 38. Röben T van Oostrom S Benning F Smit D Proper K Preventive health measures in small and medium-sized enterprises: a scoping review on implementation strategies Appl Ergon 2024 119 104303 10.1016/j.apergo.2024.104303 38714103 39. Harris K Zagar CA Lawrence KV Osteoporosis: common questions and answers Am Fam Physician 2023 107 238 46 36920813 40. Kanis JA Hans D Cooper C Baim S Bilezikian JP Binkley N Interpretation and use of FRAX in clinical practice Osteoporos Int 2011 22 2395 411 10.1007/s00198-011-1713-z 21779818 41. Management of osteoporosis in postmenopausal women: the 2021 position statement of the North American Menopause Society Menopause 2021 28 973 97 10.1097/GME.0000000000001831 34448749 42. Ortega R Jiménez Ortega AI Martínez García RM Cuadrado Soto E Aparicio A López-Sobaler AM Nutrition in the prevention and control of osteoporosis Nutr Hosp 2021 37 63 6 10.20960/nh.03360 32993301 43. Carey JJ Chih-Hsing WP Bergin D Risk assessment tools for osteoporosis and fractures in 2022 Best Pract Res Clin Rheumatol 2022 36 101775 10.1016/j.berh.2022.101775 36050210 44. de Villiers TJ Bone health and menopause: osteoporosis prevention and treatment Best Pract Res Clin Endocrinol Metab 2024 38 101782 10.1016/j.beem.2023.101782 37230869 45. Lindqvist K Timpka T Schelp L Ten years of experiences from a participatory community-based injury prevention program in Motala, Sweden Public Health 1996 110 339 46 10.1016/S0033-3506(96)80005-9 8979749 46. Waller J Eriksson O Foldevi M Kronhed AC Larsson L Löfman O Knowledge of osteoporosis in a Swedish municipality--a prospective study Prev Med 2002 34 485 91 10.1006/pmed.2002.1007 11914055 47. Grahn Kronhed AC Blomberg C Löfman O Timpka T Möller M Evaluation of an osteoporosis and fall risk intervention program for community-dwelling elderly. A quasi-experimental study of behavioral modifications Aging Clin Exp Res 2006 18 235 41 10.1007/BF03324654 16804370 48. Grahn Kronhed AC Blomberg C Karlsson N Löfman O Timpka T Möller M Impact of a community-based osteoporosis and fall prevention program on fracture incidence Osteoporos Int 2005 16 700 6 10.1007/s00198-004-1732-0 15917986 49. Hunt K Emslie C Commentary: the prevention paradox in lay epidemiology--rose revisited Int J Epidemiol 2001 30 442 6 10.1093/ije/30.3.442 11416061 50. Ebeling PR Daly RM Kerr DA Kimlin MG Building healthy bones throughout life: an evidence-informed strategy to prevent osteoporosis in Australia Med J Aust 2013 199 S1 S46 10.5694/j.1326-5377.2013.tb04225.x 25370432 51. Amin U McPartland A O'Sullivan M Silke C An overview of the management of osteoporosis in the aging female population Womens Health (Lond) 2023 19 17455057231176655 10.1177/17455057231176655 37218715 PMC10214060 52. She P Huang C Peng L Yang J Wang L Liu Q The effects of osteoporosis education program for patients with fragility fracture in China Int J Orthop Trauma Nurs 2024 52 101064 10.1016/j.ijotn.2023.101064 37956632 53. She P Yang J Xu L Xiong Y Zhang Z Wu Z The effects of WeChat official account based osteoporosis education for patients with fragility fracture in China Int J Orthop Trauma Nurs 2022 47 100975 10.1016/j.ijotn.2022.100975 36403316 54. Kostenuik PJ Binkley N Anderson PA Advances in osteoporosis therapy: focus on Osteoanabolic agents, secondary fracture prevention, and perioperative bone health Curr Osteoporos Rep 2023 21 386 400 10.1007/s11914-023-00793-8 37289382 PMC10393898 55. Lobo RA Gompel A Management of menopause: a view towards prevention Lancet Diabetes Endocrinol 2022 10 457 70 10.1016/S2213-8587(21)00269-2 35526556 56. Proia P Amato A Drid P Korovljev D Vasto S Baldassano S The impact of diet and physical activity on bone health in children and adolescents Front Endocrinol (Lausanne) 2021 12 704647 10.3389/fendo.2021.704647 34589054 PMC8473684 57. Heidemann M Jespersen E Holst R Schou AJ Husby S Mølgaard C The impact on children's bone health of a school-based physical education program and participation in leisure time sports: the childhood health, activity and motor performance school (the CHAMPS) study, Denmark Prev Med 2013 57 87 91 10.1016/j.ypmed.2013.04.015 23643934 58. Reid IR A broader strategy for osteoporosis interventions Nat Rev Endocrinol 2020 16 333 9 10.1038/s41574-020-0339-7 32203407 59. Qaseem A Hicks LA Etxeandia-Ikobaltzeta I Shamliyan T Cooney TG Cross JT Jr Pharmacologic treatment of primary osteoporosis or low bone mass to prevent fractures in adults: a living clinical guideline from the American College of Physicians Ann Intern Med 2023 176 224 38 10.7326/M22-1034 36592456 PMC10885682 60. Ishimoto AK Shah AA Screening and early treatment for osteoporosis: who are we missing under age 65? Maturitas 2024 187 108044 10.1016/j.maturitas.2024.108044 38885594 ",
  "metadata": {
    "Title of this paper": "Screening and early treatment for osteoporosis: who are we missing under age 65?",
    "Journal it was published in:": "Frontiers in Public Health",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12477242/"
  }
}