{
  "title": "Paper_418",
  "abstract": "pmc Front Genet Front Genet 1681 frontgene Front. Genet. Frontiers in Genetics 1664-8021 Frontiers Media SA PMC12483910 PMC12483910.1 12483910 12483910 41040657 10.3389/fgene.2025.1588581 1588581 1 Genetics Original Research Uncovering differential gene expression between mtRNA-positive and -negative osteosarcoma cells: implications beyond mitochondrial function Meng et al. 10.3389/fgene.2025.1588581 Meng Xiaoyuan  1 Han Zhongcheng  2 * Yeerken Wuerkan  1 Wang Zhigang  1 Ma Le  3 Liu Hongbo  2  1 Department of Orthopedics, People’s Hospital of Xinjiang Uygur Autonomous Region Urumqi China  2 Department of Oncology, People’s Hospital of Xinjiang Uygur Autonomous Region Urumqi China  3 Operating Theater, People’s Hospital of Xinjiang Uygur Autonomous Region Urumqi China  Edited by: Weihang Li  Reviewed by: Feng Gao  Federica Scotto di Carlo *Correspondence: Zhongcheng Han, 2465431781@qq.com 17 9 2025 2025 16 481198 1588581 20 3 2025 11 8 2025 17 09 2025 02 10 2025 03 10 2025 Copyright © 2025 Meng, Han, Yeerken, Wang, Ma and Liu. 2025 Meng, Han, Yeerken, Wang, Ma and Liu https://creativecommons.org/licenses/by/4.0/ This is an open-access article distributed under the terms of the Creative Commons Attribution License (CC BY). The use, distribution or reproduction in other forums is permitted, provided the original author(s) and the copyright owner(s) are credited and that the original publication in this journal is cited, in accordance with accepted academic practice. No use, distribution or reproduction is permitted which does not comply with these terms. Background Long-term clinical outcomes for patients with osteosarcoma have shown little improvement over the past few decades. Identifying novel molecular targets to inhibit osteosarcoma cell growth remains an urgent challenge. Methods Explore the function of mtRNA in the occurrence and development of osteosarcoma utilizing bioinformatics analysis of the Gene Expression Omnibus (GEO) microarray dataset. The Network Analyst tool was used to analyze GSE73120 Results A total of 104 DEGs were identified, including 89 upregulated and 15 downregulated genes. GO and KEGG analyses revealed that these DEGs were enriched in pathways related to connective tissue development, collagen trimer, and extracellular matrix structural components. The PPI network analysis identified seven hub genes. Among them, COL1A1, PDGFRB, and SPARC were confirmed as sarcoma-related genes using the GEPIA database. Conclusion Our findings suggest that COL1A1, PDGFRB, and SPARC may be involved in mtRNA-driven tumorigenesis and could serve as promising therapeutic targets for osteosarcoma. osteosarcoma mtRNA hub genes bioinformatics analysis COL1A1 The author(s) declare that financial support was received for the research and/or publication of this article. This work was supported by grants obtained from the Natural Science Foundation of Xinjiang Uygur Autonomous Region (2022D01C139). pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement yes pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes section-at-acceptance Computational Genomics 1 Introduction Osteosarcoma arises from primitive mesenchymal cells that produce osteoid or immature bone. It is the most common primary malignant bone tumor in adolescents and young adults. Incidence peaks between ages 0 and 24, reaching approximately 4.4 cases per million annually in this age group ( Mirabello et al., 2009 Ge et al., 2022 Guillon et al., 2011 Xing et al., 2014 Yu and Yao, 2024 Misaghi et al., 2018 Bernthal et al., 2012 In human cells, mitochondrial RNA (mtRNA) codes 13 essential proteins of the oxidative phosphorylation (OXPHOS) system, along with 22 mitochondrial tRNAs (mt-tRNAs) and 2 mitochondrial RNAs (mt-RNAs) ( Taanman, 1999 Jedynak-Slyvka et al., 2021 Wallace, 2012 Seyfried et al., 2020 Tufail et al., 2024 Shapovalov et al., 2011 To investigate the role of mtRNA in osteosarcoma, we analyzed the GSE73120 2 Materials and methods 2.1 Data sources We queried GEO with “osteosarcoma” and “ Homo sapiens GSE73120 Lee et al., 2016 GPL10558 Lee et al., 2016 2.2 Differential expression analysis DEGs were identified using GEO2R ( https://www.ncbi.nlm.nih.gov/geo/geo2r/ Love et al., 2014 2.3 Enrichment analyses Functional enrichment of DEGs was performed using Metascape ( https://metascape.org/gp/index.html#/main/step1 http://www.webgestalt.org/ Zhou et al., 2019 https://www.xiantao.love/ 2.4 PPI network analysis and the hub genes The STRING ( https://cn.string-db.org/ 2.5 Hub gene expression in sarcoma Hub genes were validated using the GEPIA database ( http://gepia.cancer-pku.cn/index.html 2.6 Statistical analysis All statistical evaluations were performed using R (version 4.1.0). GEO2R and enrichment tools applied built-in corrections (Benjamini–Hochberg FDR). Spearman’s rank correlation was employed for gene co-expression analysis. A two-tailed p-value <0.05 was considered statistically significant throughout. 3 Results 3.1 Identification of DEGs in GSE73120 Analysis of GSE73120 Figure 1A Supplementary Table S1 Figures 1B,C FIGURE 1 Identification of DEGs in the GSE73120 (A) (B) (C) Panel A shows a box plot comparing expression levels of selected samples from dataset GSE73120 3.2 Functional enrichment analysis of mitochondria-related DEGs By uploading the mitochondria-related DEGs into the Xiantao webpage and Metascape, the results of the enrichment analyses indicated that the mitochondria-related DEGs were involved in extracellular matrix structural constituents, regulation of hepatic stellate cell activation, biological regulation, membrane, and protein binding ( Figures 2A–D 3A–C Supplementary Table S2 Figures 2E–G 3A–C FIGURE 2 The enrichment pathway analysis of DEGs. (A) (B) (C) (D) (E–G) A collection of charts and plots related to gene enrichment analysis: (A) A bar chart illustrating different categories like platelet-derived growth factor binding, colored by type (BP, CC, MF) as -Log(FDR). (B) A scatter plot with GO terms labeled, showing enrichment scores and log fold change. (C) Three bar charts of biological process, cellular component, and molecular function categories colored red, blue, and green, displaying various processes and their counts. (D) A bar chart of pathways with normalized enrichment scores showing FDR thresholds. (E-F-G) Enrichment plots for connective tissue development, collagen trimer, and extracellular matrix structural constituent, each with line and histogram views. FIGURE 3 The enrichment pathway analysis of DEGs. The pathways network of DEGs using Metascape: (A) (B) (C) Network diagrams and bar chart from Metascape analysis. Panel A shows a network of biological pathways with various node colors representing different processes. Panel B displays a related but distinct network with similar structure. Panel C is a bar chart indicating pathways and processes with their significance levels, using -log10(P) values. Each bar represents a biological term with color gradients suggesting significance. 3.3 PPI analysis of mitochondria-related DEGs The PPI network was constructed using STRING and Cytoscape and revealed a densely interconnected module ( Figure 4A Supplementary Table S3 Figure 4B Figure 4C FIGURE 4 The PPI analysis of DEGs. (A) (B) (C) A scientific figure includes three panels: A) A network diagram showing connected genes represented as nodes, with MMP9 as a central hub in a larger cluster of turquoise nodes.B) A color-coded network focusing on key interactions among genes, with COL5A1 and COL1A1 highlighted in red as central nodes.C) A Venn diagram comparing hub genes and MCODE analysis, showing three unique hub genes, seven common between both, and none unique to MCODE. 3.4 Validation of hub gene expression in sarcoma Gene expression data for sarcoma were extracted and analyzed using the GEPIA database ( Figure 5A Figure 6A FIGURE 5 The distribution of differently expressed genes and their correlation in SARC. (A) (B) Differentially expressed genes on chromosomes are shown in a bar chart. Over-expressed genes are marked in red, while under-expressed genes are marked in green, across various chromosomes based on GRCh38.p2 with 3,195 genes. Below, three scatter plots illustrate relationships between expression levels: log2(PDGFRB TPM) vs. log2(COL1A1 TPM), log2(SPARC TPM) vs. log2(COL1A1 TPM), and log2(SPARC TPM) vs. log2(PDGFRB TPM), with respective p-values and correlation coefficients. FIGURE 6 COL1A1 expression in cancer. (A) (B) (C) (D) A four-panel image with data visualizations: Panel A shows a bar graph of transcripts per million across various tissues. Panel B is a Kaplan-Meier survival curve comparing low and high COL1A1 transcript levels over time. Panel C features a box plot for SARC with sample size (T=262, N=2). Panel D consists of two anatomical drawings indicating tissue expression levels in different colors. PDGFRB exhibited high expression in six tumor cell lines, including DLBC, HNSC, LIHC, PAAD, STAD, and THYM, and low expression in 12 tumor cell lines, including adrenocortical carcinoma (ACC), bladder urothelial carcinoma (BLCA), KICH, kidney renal papillary cell carcinoma (KIRP), LUAD, LUSC, ovarian serous cystadenocarcinoma (OV), prostate adenocarcinoma (PRAD), skin cutaneous melanoma (SKCM), THCA, UCEC, and uterine carcinosarcoma (UCS) ( Figure 7A FIGURE 7 PDGFRB expression in cancer. (A) (B) (C) (D) Panel A displays a line chart of transcripts per million (TPM) across various conditions. Panel B is a Kaplan-Meier plot illustrating overall survival, comparing low and high PDGFRB TPM. Panel C shows a box plot comparing transcripts in sarcoma tissue (SARC) with normal tissue. Panel D contains anatomical diagrams highlighting expression levels in different body organs. SPARC was highly expressed in 15 tumor cell lines, such as ACC, BRCA, colon adenocarcinoma (COAD), DLBC, ESCA, GBM, HNSC, kidney renal clear cell carcinoma (KIRC), brain lower-grade glioma (LGG), LIHC, PAAD, rectum adenocarcinoma (READ), SKCM, STAD, and THYM, and was expressed at a low level in UCEC ( Figure 8A Figure 5B Figures 6B,7B,8B Figures 6C,7C,8C,D FIGURE 8 SPARC expression in cancer. (A) SPARC expression profile across all tumor samples and paired normal tissues in TCGA; (B) the overall survival analysis of SPARC expression in SARC; (C) expression of SPARC in SARC on box plots; (D) the median expression of tumor and normal samples in BodyMap. Red, tumor samples; green, normal samples. Panel A displays a dot plot of transcript levels (TPM) across various cancer types with significant variation. Panel B shows a Kaplan-Meier survival curve comparing patients with high and low SPARC TPM levels, indicating similar overall survival. Panel C features a box plot comparing SPARC expression in tumor versus normal samples, highlighting higher expression in tumors. Panel D illustrates anatomical diagrams with tissue-specific SPARC expression, with darker shades indicating higher expression on a log2 scale. 4 Discussion Mitochondria, the cell’s powerhouses, generate ATP through oxidative OXPHOS, relying critically on mitochondrial RNA (mtRNA) for expression of OXPHOS components. Notably, osteosarcoma is characterized by increased OXPHOS and ATP production, which correlate with increased cell migration and aggressive phenotypes ( Huan et al., 2024 Han et al., 2021 Yu et al., 2021 Huan et al., 2024 Han et al., 2021 Yu et al., 2021 Li et al., 2023 Kong et al., 2024 GSE73120 Analysis of the GSE73120 COL1A1, encoding the pro-alpha1 chains of type I collagen, which is a fibril-forming collagen abundant in bone, cornea, dermis, and tendon, has also been linked to mitochondrial homeostasis ( Dalgleish et al., 2008 Yuan et al., 2020 Fu et al., 2019 Tang et al., 2022 An et al., 2024 Xiang et al., 2023 Zhang et al., 2007 Extending beyond intracellular metabolism, SPARC serves as a bridge between mitochondrial health and ECM dynamics ( Wei et al., 2012 McCurdy et al., 2011 Melouane et al., 2019 Melouane et al., 2018 Cai et al., 2023 Gaspar et al., 2023 5 Limitations This study has limitations. First, pathway enrichment analyses such as GO and KEGG, while informative, may produce false negatives or biased results due to underlying method assumptions and gene correlations ( Ge et al., 2022 Tamayo et al., 2016 Glass and Girvan, 2014 Qiu et al., 2021 GSE73120 in vivo 6 Conclusion Our analysis of GSE73120 Data availability statement The original contributions presented in the study are included in the article/ Supplementary Material Author contributions XM: Conceptualization, Data curation, Formal Analysis, Investigation, Methodology, Project administration, Resources, Software, Supervision, Validation, Visualization, Writing – original draft, Writing – review and editing. ZH: Conceptualization, Data curation, Formal Analysis, Funding acquisition, Investigation, Methodology, Project administration, Resources, Software, Supervision, Validation, Visualization, Writing – original draft, Writing – review and editing. WY: Data curation, Formal Analysis, Investigation, Resources, Software, Validation, Visualization, Writing – original draft, Writing – review and editing. ZW: Data curation, Formal Analysis, Investigation, Resources, Software, Validation, Visualization, Writing – original draft, Writing – review and editing. LM: Data curation, Formal Analysis, Investigation, Resources, Software, Validation, Visualization, Writing – original draft, Writing – review and editing. HL: Data curation, Formal Analysis, Investigation, Resources, Software, Validation, Visualization, Writing – original draft, Writing – review and editing. Conflict of interest The authors declare that the research was conducted in the absence of any commercial or financial relationships that could be construed as a potential conflict of interest. Generative AI statement The author(s) declare that no Generative AI was used in the creation of this manuscript. Any alternative text (alt text) provided alongside figures in this article has been generated by Frontiers with the support of artificial intelligence and reasonable efforts have been made to ensure accuracy, including review by the authors wherever possible. If you identify any issues, please contact us. Publisher’s note All claims expressed in this article are solely those of the authors and do not necessarily represent those of their affiliated organizations, or those of the publisher, the editors and the reviewers. Any product that may be evaluated in this article, or claim that may be made by its manufacturer, is not guaranteed or endorsed by the publisher. Supplementary material The Supplementary Material for this article can be found online at: https://www.frontiersin.org/articles/10.3389/fgene.2025.1588581/full#supplementary-material SUPPLEMENTARY TABLE 1 Identification of de-expressed genes in GSE7312. SUPPLEMENTARY TABLE 2 Functional enrichment analyses of DEGs. SUPPLEMENTARY TABLE 3 PPI network analysis of DEGs. Abbreviations DEGs, different expression genes; GEO, Gene Expression Omnibus; mtRNA, mitochondrial RNA; NCBI, National Center of Biotechnology Information. References An F. Chang W. Song J. Zhang J. Li Z. Gao P. 2024 Reprogramming of glucose metabolism: metabolic alterations in the progression of osteosarcoma J. Bone Oncol. 44 100521 10.1016/j.jbo.2024.100521 38288377 PMC10823108 Bernthal N. M. Federman N. Eilber F. R. Nelson S. D. Eckardt J. J. Eilber F. C. 2012 Long-term results (>25 years) of a randomized, prospective clinical trial evaluating chemotherapy in patients with high-grade, operable osteosarcoma Cancer 118 23 5888 5893 10.1002/cncr.27651 22648705 Cai L. Shi L. Peng Z. Sun Y. Chen J. 2023 Ageing of skeletal muscle extracellular matrix and mitochondria: finding a potential link Ann. Med. 55 2 2240707 10.1080/07853890.2023.2240707 37643318 PMC10732198 Dalgleish T. Rolfe J. Golden A. M. Dunn B. D. Barnard P. J. 2008 Reduced autobiographical memory specificity and posttraumatic stress: exploring the contributions of impaired executive control and affect regulation J. Abnorm. Psychol. 117 1 236 241 10.1037/0021-843X.117.1.236 18266501 Fu X. H. Chen C. Z. Wang Y. Peng Y. X. Wang W. H. Yuan B. 2019 COL1A1 affects apoptosis by regulating oxidative stress and autophagy in Bovine cumulus cells Theriogenology 139 81 89 10.1016/j.theriogenology.2019.07.024 31377650 Gaspar R. S. Katashima C. K. Crisol B. M. Carneiro F. S. Sampaio I. Silveira L. D. R. 2023 Physical exercise elicits UPR(mt) in the skeletal muscle: the role of c-Jun N-terminal kinase Mol. Metab. 78 101816 10.1016/j.molmet.2023.101816 37821006 PMC10590869 Ge W. Yue M. Wang Y. Wang Y. Xue S. Shentu D. 2022 A novel molecular signature of cancer-associated fibroblasts predicts prognosis and immunotherapy response in pancreatic cancer Int. J. Mol. Sci. 24 1 156 10.3390/ijms24010156 36613599 PMC9820557 Glass K. Girvan M. 2014 Annotation enrichment analysis: an alternative method for evaluating the functional properties of gene sets Sci. Rep. 4 4191 10.1038/srep04191 24569707 PMC3935204 Guillon M. A. Mary P. M. Brugière L. Marec-Bérard P. Pacquement H. D. Schmitt C. 2011 Clinical characteristics and prognosis of osteosarcoma in young children: a retrospective series of 15 cases BMC Cancer 11 407 10.1186/1471-2407-11-407 21942935 PMC3188515 Han Q. C. Zhang X. Y. Yan P. H. Chen S. F. Liu F. F. Zhu Y. R. 2021 Identification of mitochondrial RNA polymerase as a potential therapeutic target of osteosarcoma Cell Death Discov. 7 1 393 10.1038/s41420-021-00780-x 34907167 PMC8671410 Huan M. J. Fu P. P. Chen X. Wang Z. X. Ma Z. R. Cai S. Z. 2024 Identification of the central role of RNA polymerase mitochondrial for angiogenesis Cell Commun. Signal 22 1 343 10.1186/s12964-024-01712-9 38907279 PMC11191269 Jedynak-Slyvka M. Jabczynska A. Szczesny R. J. 2021 Human mitochondrial RNA processing and modifications: overview Int. J. Mol. Sci. 22 15 7999 10.3390/ijms22157999 34360765 PMC8348895 Kong Y. Li X. Zhang H. Fu B. Jiang H. Y. Yang H. L. 2024 Targeting POLRMT by a first-in-class inhibitor IMT1 inhibits osteosarcoma cell growth in vitro in vivo Cell Death Dis. 15 1 57 10.1038/s41419-024-06444-9 38228583 PMC10791695 Lee W. T. Cain J. E. Cuddihy A. Johnson J. Dickinson A. Yeung K. Y. 2016 Mitochondrial DNA plasticity is an essential inducer of tumorigenesis Cell Death Discov. 2 16016 10.1038/cddiscovery.2016.16 27551510 PMC4979526 Li X. Yao L. Wang T. Gu X. Wu Y. Jiang T. 2023 Identification of the mitochondrial protein POLRMT as a potential therapeutic target of prostate cancer Cell Death Dis. 14 10 665 10.1038/s41419-023-06203-2 37816734 PMC10564732 Love M. I. Huber W. Anders S. 2014 Moderated estimation of fold change and dispersion for RNA-seq data with DESeq2 Genome Biol. 15 12 550 10.1186/s13059-014-0550-8 25516281 PMC4302049 McCurdy S. M. Dai Q. Zhang J. Zamilpa R. Ramirez T. A. Dayah T. 2011 SPARC mediates early extracellular matrix remodeling following myocardial infarction Am. J. Physiol. Heart Circ. Physiol. 301 2 H497 H505 10.1152/ajpheart.01070.2010 21602472 PMC3154667 Melouane A. Carbonell A. Yoshioka M. Puymirat J. St-Amand J. 2018 Implication of SPARC in the modulation of the extracellular matrix and mitochondrial function in muscle cells PLoS One 13 2 e0192714 10.1371/journal.pone.0192714 29420632 PMC5805355 Melouane A. Yoshioka M. Kanzaki M. St-Amand J. 2019 Sparc, an EPS-induced gene, modulates the extracellular matrix and mitochondrial function via Life Sci. 229 277 287 10.1016/j.lfs.2019.05.070 31150687 Mirabello L. Troisi R. J. Savage S. A. 2009 Osteosarcoma incidence and survival rates from 1973 to 2004: data from the Surveillance, Epidemiology, and End Results Program Cancer 115 7 1531 1543 10.1002/cncr.24121 19197972 PMC2813207 Misaghi A. Goldin A. Awad M. Kulidjian A. A. 2018 Osteosarcoma: a comprehensive review Sicot J. 4 12 10.1051/sicotj/2017028 29629690 PMC5890448 Qiu Z. Du X. Chen K. Dai Y. Wang S. Xiao J. 2021 Gene signatures with predictive and prognostic survival values in human osteosarcoma PeerJ 9 e10633 10.7717/peerj.10633 33520450 PMC7812922 Seyfried T. N. Arismendi-Morillo G. Mukherjee P. Chinopoulos C. 2020 On the origin of ATP synthesis in cancer iScience 23 11 101761 10.1016/j.isci.2020.101761 33251492 PMC7677709 Shapovalov Y. Hoffman D. Zuch D. de Mesy Bentley K. L. Eliseev R. A. 2011 Mitochondrial dysfunction in cancer cells due to aberrant mitochondrial replication J. Biol. Chem. 286 25 22331 22338 10.1074/jbc.M111.250092 21536680 PMC3121380 Taanman J. W. 1999 The mitochondrial genome: structure, transcription, translation and replication Biochim. Biophys. Acta 1410 2 103 123 10.1016/s0005-2728(98)00161-3 10076021 Tamayo P. Steinhardt G. Liberzon A. Mesirov J. P. 2016 The limitations of simple gene set enrichment analysis assuming gene Independence Stat. Methods Med. Res. 25 1 472 487 10.1177/0962280212460441 23070592 PMC3758419 Tang H. Y. Guo J. Q. Sang B. T. Cheng J. N. Wu X. M. 2022 PDGFRβ modulates aerobic glycolysis in osteosarcoma HOS cells via Biochem. Cell Biol. 100 1 75 84 10.1139/bcb-2021-0305 34678088 Tufail M. Jiang C. H. Li N. 2024 Altered metabolism in cancer: insights into energy pathways and therapeutic targets Mol. Cancer 23 1 203 10.1186/s12943-024-02119-3 39294640 PMC11409553 Wallace D. C. 2012 Mitochondria and cancer Nat. Rev. Cancer 12 10 685 698 10.1038/nrc3365 23001348 PMC4371788 Wei H. Y. Liu J. L. Lv B. J. Xing L. Fu S. Y. 2012 SPARC modulates expression of extracellular matrix genes in human trabecular meshwork cells Acta Ophthalmol. 90 2 e138 e143 10.1111/j.1755-3768.2011.02283.x 22136411 Xiang Y. Yang Y. Liu J. Yang X. 2023 Functional role of MicroRNA/PI3K/AKT axis in osteosarcoma Front. Oncol. 13 1219211 10.3389/fonc.2023.1219211 37404761 PMC10315918 Xing D. Qasem S. A. Owusu K. Zhang K. Siegal G. P. Wei S. 2014 Changing prognostic factors in osteosarcoma: analysis of 381 cases from two institutions Hum. Pathol. 45 8 1688 1696 10.1016/j.humpath.2014.04.010 24931466 Yu S. Yao X. 2024 Advances on immunotherapy for osteosarcoma Mol. Cancer 23 1 192 10.1186/s12943-024-02105-9 39245737 PMC11382402 Yu H. J. Xiao G. L. Zhao Y. Y. Wang X. X. Lan R. 2021 Targeting mitochondrial metabolism and RNA polymerase POLRMT to overcome multidrug resistance in cancer Front. Chem. 9 775226 10.3389/fchem.2021.775226 34976949 PMC8716502 Yuan M. Gong M. Zhang Z. Meng L. Tse G. Zhao Y. 2020 Hyperglycemia induces endoplasmic reticulum stress in atrial cardiomyocytes, and Mitofusin-2 downregulation prevents mitochondrial dysfunction and subsequent cell death Oxid. Med. Cell Longev. 2020 6569728 10.1155/2020/6569728 33149811 PMC7603626 Zhang H. Bajraszewski N. Wu E. Wang H. Moseman A. P. Dabora S. L. 2007 PDGFRs are critical for PI3K/Akt activation and negatively regulated by mTOR J. Clin. Invest 117 3 730 738 10.1172/JCI28984 17290308 PMC1784000 Zhou Y. Zhou B. Pache L. Chang M. Khodabakhshi A. H. Tanaseichuk O. 2019 Metascape provides a biologist-oriented resource for the analysis of systems-level datasets Nat. Commun. 10 1 1523 10.1038/s41467-019-09234-6 30944313 PMC6447622 ",
  "metadata": {
    "Title of this paper": "Metascape provides a biologist-oriented resource for the analysis of systems-level datasets",
    "Journal it was published in:": "Frontiers in Genetics",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12483910/"
  }
}