{
  "title": "Paper_4",
  "abstract": "pmc eLife Elife 1894 elife eLife eLife 2050-084X eLife Sciences Publications, Ltd PMC12490858 PMC12490858.1 12490858 12490858 41036778 10.7554/eLife.105915 105915 1 version of record Research Article Chromosomes and Gene Expression Genome organization by SATB1 binding to base-unpairing regions (BURs) provides a scaffold for SATB1-regulated gene expression Kohwi Yoshinori https://orcid.org/0000-0002-5443-0909 YKohwi@lbl.gov 1 2 Wong Xianrong https://orcid.org/0000-0002-1995-7043 3 † Grange Mari 1 Sexton Thomas https://orcid.org/0000-0002-7824-1846 4 Richards Hunter W https://orcid.org/0000-0001-9913-089X 1 Kitagawa Yohko 5 ‡ Sakaguchi Shimon https://orcid.org/0000-0001-8265-6094 5 Liang Ya-Chen https://orcid.org/0000-0001-7813-8921 6 Chuong Cheng-Ming https://orcid.org/0000-0001-9673-3994 6 Botchkarev Vladimir A https://orcid.org/0000-0002-5212-5353 7 Taniuchi Ichiro https://orcid.org/0000-0002-9853-9068 8 Reddy Karen L https://orcid.org/0000-0003-4548-5999 3 Kohwi-Shigematsu Terumi https://orcid.org/0000-0002-5988-0669 TKohwi-Shigematsu@lbl.gov 1 2  1 https://ror.org/043mz5j54 Department of Orofacial Sciences, University of California, San Francisco San Francisco United States  2 https://ror.org/02jbv0t02 Lawrence Berkeley National Laboratory Berkeley United States  3 https://ror.org/00za53h95 Department of Biological Chemistry, School of Medicine, Johns Hopkins University Baltimore United States  4 https://ror.org/0015ws592 Institute of Genetics and Molecular and Cellular Biology (IGBMC) Illkirch France  5 https://ror.org/035t8zc32 Laboratory of Experimental Immunology, Immunology Frontier Research Center, Osaka University Osaka Japan  6 https://ror.org/03taz7m60 Department of Pathology, University of Southern California Los Angeles United States  7 https://ror.org/05qwgg493 Department of Dermatology, Boston University School of Medicine Boston United States  8 https://ror.org/04mb6s476 Laboratory for Transcriptional Regulation, RIKEN Center for Integrative Medical Sciences Yokohama Japan Hauf Silke Reviewing Editor  https://ror.org/02smfhw86 Virginia Tech United States Hauf Silke Senior Editor  https://ror.org/02smfhw86 Virginia Tech United States † Agency for Science, Technology, and Research (A*STAR) Skin Research Labs (A*SRL), Singapore, Singapore. ‡ Center of iPS Research and Applications, Kyoto University, Kyoto, Japan. 02 10 2025 2025 14 478904 RP105915 14 1 2025 02 10 2025 03 10 2025 03 10 2025 This manuscript was published as a preprint. 09 1 2025 This manuscript was published as a reviewed preprint. 13 3 2025 The reviewed preprint was revised. 28 5 2025 https://creativecommons.org/publicdomain/zero/1.0/ This is an open-access article, free of all copyright, and may be freely reproduced, distributed, transmitted, modified, built upon, or otherwise used by anyone for any lawful purpose. The work is made available under the Creative Commons CC0 public domain dedication 10.1101/2021.12.19.473323 10.7554/eLife.105915.1 10.7554/eLife.105915.2 Mammalian genomes are organized by multi-level folding; yet how this organization contributes to cell-type-specific transcription remains unclear. SATB1 forms a nuclear substructure that resists high-salt extraction. SATB1 binds base-unpairing regions (BURs), genomic elements with high unwinding propensities. In mouse thymocytes, we found that SATB1 establishes a two-tiered chromatin organization: one through indirect binding to transcriptionally active DNase 1-accessible chromatin and another by direct binding to BURs in the DNase 1-inaccessible nuclear substructure. Recently published ChIP-seq datasets show SATB1 binding to accessible chromatin at enhancers and CTCF sites, but not to BURs. By employing urea ChIP-seq, which retains only directly bound protein:DNA complexes, we found that BURs, but not CTCF sites, are direct SATB1 binding targets genome-wide. BURs bound to the SATB1 nuclear substructure interact with accessible chromatin, crossing multiple topologically associated domains (TADs). SATB1 is required for these megabase-scale interactions linked to cell-type-specific gene expression. BURs are highly enriched within transcriptionally repressive lamina-associated domains (LADs). Besides these BURs, SATB1 anchors some BURs (18%) outside LADs near genes in otherwise accessible chromatin to the SATB1 nuclear substructure. Only a subset of total BURs is bound to SATB1, depending on cell type. Notably, despite the mutually exclusive SATB1-binding profiles uncovered by the two ChIP-seq methods, we found most peaks in both profiles are valid and require SATB1. Based on these and previous data, we propose that the SATB1 protein network forms a chromatin scaffold, providing an interface that connects accessible chromatin to a subnuclear architectural structure, thereby facilitating the three-dimensional organization linked to cell-type-specific gene expression. SATB1 chromatin organization base-unpairing region urea ChIP-seq gene expression lamina-associated domains Research organism Mouse http://dx.doi.org/10.13039/100000002 National Institutes of Health R31CA39581 Kohwi-Shigematsu Terumi http://dx.doi.org/10.13039/100000002 National Institutes of Health R01ES023854 Kohwi-Shigematsu Terumi http://dx.doi.org/10.13039/100000002 National Institutes of Health R01AR071727 Botchkarev Vladimir A Kohwi-Shigematsu Terumi http://dx.doi.org/10.13039/100000002 National Institutes of Health AR047364 Chuong Cheng-Ming Kohwi-Shigematsu Terumi http://dx.doi.org/10.13039/100000002 National Institutes of Health R01GM132427 Reddy Karen L The funders had no role in study design, data collection and interpretation, or the decision to submit the work for publication. pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement yes pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes Author impact statement Modified ChIP-seq and 4C-seq approaches, using urea-purified crosslinked chromatin, uncovered a two-tiered chromatin organization mediated by SATB1 that is linked to gene expression. publishing-route prc Introduction Three-dimensional (3D) chromatin architecture, formed by chromatin folding at multiple hierarchical levels, is thought to play a fundamental role in genome activity such as gene expression ( Politz et al., 2013 van Steensel and Belmont, 2017 Schoenfelder and Fraser, 2019 Bashkirova and Lomvardas, 2019 Göndör and Ohlsson, 2018 Loubiere et al., 2020 Misteli, 2020 Lieberman-Aiden et al., 2009 Guelen et al., 2008 Kind et al., 2015 van Steensel et al., 2001 Guelen et al., 2008 Peric-Hupkes et al., 2010 At sub-megabase scales, using Hi-C, chromatin domains called ‘topological-associated domains’ (TADs) were previously detected that are relatively insulated from adjacent TADs by preferentially making intra-domain contacts via looping ( Dixon et al., 2012 Nora et al., 2012 Sexton et al., 2012 Sanborn et al., 2015 Fudenberg et al., 2016 Dixon et al., 2012 Rao et al., 2014 Guelen et al., 2008 Nora et al., 2017 Rao et al., 2017 Wutz et al., 2017 Schwarzer et al., 2017 Cattoni et al., 2017 Bintu et al., 2018 Finn et al., 2019 Gabriele et al., 2022 Mach et al., 2022 Gabriele et al., 2022 Chi et al., 2022 Chen et al., 2023 Hafner et al., 2023 SATB1 was originally identified by virtue of its specific binding to genomic sequences called Base Unpairing Regions (BURs). Previous in vitro studies have shown that SATB1 directly binds BURs without requiring additional molecules, such as RNA or proteins ( Kohwi-Shigematsu and Kohwi, 1990 Bode et al., 1992 Dickinson et al., 1992 Kohwi-Shigematsu and Kohwi, 1990 Kohwi-Shigematsu and Kohwi, 1992 Kohwi-Shigematsu and Kohwi, 1990 Dickinson et al., 1992 Dickinson et al., 1992 Fessing et al., 2011 Alvarez et al., 2000 Zhang et al., 2019 Balamotis et al., 2012 Huang et al., 2011 Cai et al., 2003 Balamotis et al., 2012 Cai et al., 2003 de Belle et al., 1998 Kohwi-Shigematsu et al., 2013 Cai et al., 2006 Fessing et al., 2011 Balamotis et al., 2012 Alvarez et al., 2000 Zhang et al., 2019 Skowronska-Krawczyk et al., 2014 Hao et al., 2015 Kakugawa et al., 2017 Kitagawa et al., 2017 Yasuda et al., 2019 Goolam and Zernicka-Goetz, 2017 Satoh et al., 2013 Kohwi-Shigematsu et al., 2013 Han et al., 2008 Ordinario et al., 2012 Frömberg et al., 2018 + + + Kakugawa et al., 2017 Kitagawa et al., 2017 Yasuda et al., 2019 Cai et al., 2006 Han et al., 2008 Although BURs have been identified to be specific and direct binding target sequences of SATB1, mysteriously, the genome-wide SATB1 binding profiles obtained by the widely used, standard chromatin immunoprecipitation-deep sequencing (ChIP-seq) do not detect SATB1 interaction with BURs. Instead, SATB1 has been mapped mainly to enhancers and to a region that would become an active super-enhancer upon differentiation ( Hao et al., 2015 Kakugawa et al., 2017 Kitagawa et al., 2017 Feng et al., 2022 Zelenka et al., 2022 Wang et al., 2023 ChIP-seq has been a gold standard for profiling chromatin-protein interactions. However, standard ChIP-seq approaches have several drawbacks. First, chromatin structure can introduce biases into ChIP-seq analysis. Fragmentation of crosslinked chromatin in whole cells/nuclei can result in biased capture of transcriptionally active, highly accessible ‘open’ chromatin and generation of false-positive ‘phantom’ peaks ( Jain et al., 2015 Park et al., 2013 Teytelman et al., 2013 Meyer and Liu, 2014 Baumgarten and Bryant, 2022 direct Results Development of urea ChIP-seq method to detect genome-wide SATB1-binding profiles Unlike many nuclear proteins (e.g. transcription and chromatin modifying factors), SATB1 resides in nuclear substructures exhibiting resistance to extraction with high salt or lithium 3,5-diidosalicylate (LIS) ( de Belle et al., 1998 Skowronska-Krawczyk et al., 2014 Cai et al., 2003 Satb1 -/- Figure 1A Cai et al., 2003 Gesson et al., 2016 Figure 1. Scheme of urea ChIP-seq and difference from standard ChIP-seq. ( A Cai et al., 2003 Satb1 +/+ Satb1 -/- B C To detect BURs as the primary targets of SATB1 genome-wide, we devised a urea ChIP-seq method to purify genomic DNA with only its directly bound proteins. Through this approach, we found that a vast majority of in vivo SATB1-binding sites are BURs in the genome. In this method, cells are first crosslinked with formaldehyde. Then, cells are lysed in a 4% SDS-containing buffer and subjected to ultracentrifugation with 8 M urea. In this manner, crosslinked chromatin is stringently purified by removing all free-floating proteins and proteins bound to DNA indirectly. Therefore, urea ChIP-seq is performed with the genomic DNA retaining only directly bound proteins. It is important to note that without prior formaldehyde crosslinking, urea centrifugation removes 99.9% of chromatin-associated protein from chromatin and sediments unsheared pure genomic DNA at the bottom of the tube ( Kohwi-Shigematsu et al., 1998 Das and Mukhopadhyay, 2009 Raghunathan et al., 2020 Oprzeska-Zingrebe and Smiatek, 2018 Kohwi-Shigematsu et al., 2012 Kourilsky et al., 1970 Kourilsky et al., 1971 Hegedüs et al., 2009 Summer et al., 2009 Critically, the urea ChIP-seq method ( Kohwi-Shigematsu et al., 2012 Figure 1B Figure 1C Gesson et al., 2016 de Belle et al., 1998 Urea ChIP-seq detects BURs as direct binding targets of SATB1 in vivo To determine whether SATB1 binds to BURs in vivo, it is essential to validate in vivo SATB1-bound sites as BURs. We previously generated a genome-wide BUR reference map by deep sequencing DNA fragments generated from purified genomic DNA bound by recombinant SATB1 protein in vitro ( Kohwi-Shigematsu et al., 2012 We performed urea ChIP-seq for SATB1 in thymocytes and compared the results with standard ChIP-seq for this protein and the BUR reference map. Strikingly, urea ChIP-seq produced SATB1 binding profiles that are entirely different from those produced by the standard ChIP-seq method ( Figure 2A Supplementary files 1 and 2 Figure 2A Figure 2A , track 3 Figure 2A , tracks 1 and 2 Figure 2A , tracks 3–5 Figure 2B , tracks 1–3 Figure 2B , tracks 4 and 5 versus track 6 Figure 2B tracks 7 and 8 Figure 2B , tracks 1,2,6–9 Figure 2B Figure 2—figure supplement 1A and B Figure 2B track 4 and 5 Figure 2—figure supplement 1C Figure 2C bootRanges Mu et al., 2023 Figure 2C Figure 2D Figure 2E Figure 2C and D Figure 2. Identification of BURs as direct targets of SATB1 in vivo by urea ChIP-seq. ( A B C Supplementary file 1 D E Figure 2—figure supplement 1. Zoomed-in view of Figure 2B ( A Figure 2B B C CTCF-binding profiles remain unchanged between urea and standard ChIP-seq To investigate the potential cause for the discrepancy in the SATB1-binding profiles between the two ChIP-seq approaches, we applied the urea ChIP-seq method to other factors and asked whether binding profiles differed between urea and standard ChIP-seq. We investigated the DNA-binding profile for CTCF by urea ChIP-seq and found its profile to be very similar to that obtained by standard ChIP-seq from ENCODE, which largely overlapped with DNase 1 HS peaks ( Davis et al., 2018 Figure 3A , tracks 2, 4, 5, and 6 Peng et al., 2009 Figure 3—figure supplement 1 Feng et al., 2022 Zelenka et al., 2022 Wang et al., 2023 Supplementary file 1 Supplementary file 1 Figures 2A 3A Figure 3. Identical CTCF-binding profiles are produced by urea and standard ChIP-seq, independent of SATB1. ( A Satb1 +/+ Satb1 -/- B Satb1 +/+ Satb1 -/- C D Satb1 +/+ Cd4 Satb1 fl/fl Cd4 E r Satb1  Figure 3—source data 1. Original raw data for ChIP-Western results shown in Figure 3C  Figure 3—source data 2. Original raw data for ChIP-Western results shown in Figure 3C Figure 3—figure supplement 1. Similar DNA binding profiles for PRC2 core subunits obtained by standard ChIP-seq and Urea ChIP-seq. The DNA binding profiles of PRC2 core subunits, Jarid2, Suz12, and Ezh2 obtained by standard ChIP-seq ( Peng et al., 2009 GSE18776 Figure 3—figure supplement 2. SATB1 does not directly co-bind chromatin with CTCF and RAD21 or has a role in TAD formation. ( A Figure 3C Figure 3—source data 1 B C D E F CTCF and SATB1 have distinct and independent binding profiles Our results above indicate that CTCF and SATB1 direct Wang et al., 2023 Satb1 -/- Satb1 +/+ Figure 3A , compare tracks 2 and 3 Figure 3B To corroborate the independence of CTCF/cohesin and SATB1, we next examined whether SATB1 interacts with CTCF and/or cohesin or both, components known to be important for loop formation. Distinct from protein-protein co-immunoprecipitation (co-IP) using whole cell or nuclear extracts, we examined the direct co-binding status on chromatin in vivo of SATB1 and CTCF or cohesin by urea ChIP-Western. Urea-purified crosslinked-chromatin fragments immunoprecipitated with anti-SATB1 antibody (SATB1-bound urea-ChIP fragments) contained SATB1 as expected, detected by western blot of the de-crosslinked urea-ChIP sample. However, neither CTCF nor RAD21 (a cohesin complex component) was detected in the SATB1 urea-ChIP samples. Reciprocal experiments using either CTCF or RAD21-bound urea ChIP samples confirmed lack of SATB1 co-binding to these chromatin fragments ( Figure 3C Figure 3—figure supplement 2A , Figure 3—source data 1 Figure 3—source data 2 Figure 3C Figure 3A and B If cohesin and CTCF bind directly to chromatin for loop formation according to the loop extrusion model, then we expect that the urea ChIP-Western results will show that cohesin-bound DNA fragments are co-bound by CTCF at the base of loops. As expected, we do find co-binding; however, fragments co-bound by RAD21 and CTCF represent only a small fraction of either total RAD21-bound or CTCF-bound chromatin fragments ( Figure 3C Gabriele et al., 2022 Given that CTCF deletion causes most TADs to disappear, we next examined whether SATB1 depletion has any effects on TAD formation. We compared bulk Hi-C results between thymocytes isolated from wild-type ( Satb1 +/+ Cd4-Cre Satb1 fl/fl Figure 3—figure supplement 2B Figure 3D Figure 3—figure supplement 2C Figure 3—figure supplement 2D Feng et al., 2022 Zelenka et al., 2022 Nora et al., 2017 Figure 3E Figure 3—figure supplement 2E Figure 3—figure supplement 2F Non-specific peaks appear in Satb1 -/- An important question is whether SATB1-binding profiles obtained by standard ChIP-seq are strictly SATB1 dependent. If so, these binding sites likely reflect real but indirect SATB1 association with chromatin. To address this question, we performed standard ChIP-seq on Satb1 -/- Figure 4—figure supplement 1A and B , top and bottom, tracks 9 and 10 Jain et al., 2015 Park et al., 2013 Teytelman et al., 2013 Meyer and Liu, 2014 Baumgarten and Bryant, 2022 Supplementary files 3 and 4 Supplementary files 3 and 4 After validation with SATB1-KO cells, we conclude that most SATB1 sites detected from standard ChIP-seq are bound by SATB1, but most likely through indirect binding, as these peaks are not detected by urea ChIP-seq, which removes any indirect binding proteins by urea ultracentrifugation. SATB1 proteins are found in high salt-resistant fraction as well as salt-extracted fraction ( de Belle et al., 1998 Rag1 Rag2 Hao et al., 2015 Foxp3 Kitagawa et al., 2017 Runx3 Kakugawa et al., 2017 Figure 4 Rag1/2 Foxp3 Runx3 Figure 4 , track 3 Figure 4 , tracks 7 and 9 for Rag/Rag2 Runx3 and tracks 9 and 11 for Foxp3 Figure 4 tracks 8 and 10 for Rag1/Rag2 and Runx 3, and tracks 10 and 12 for Foxp3 Rag1 Rag2 Rag 1 Rag 2 Hao et al., 2015 + Foxp3 Kitagawa et al., 2017 Satb1 fl/fl Satb1 fl/fl Foxp3 Kitagawa et al., 2017 Kakugawa et al., 2017 Kitagawa et al., 2017 Tanaka et al., 2017 Kondo et al., 2016 + + Kakugawa et al., 2017 Runx3 Kakugawa et al., 2017 Rag1/Rag2 Runx3 Foxp3 Figure 4. SATB1-bound sites identified by standard ChIP-seq at regulatory regions are SATB1 dependent. SATB1-binding profiles in immature thymocytes determined by urea ChIP-seq (Urea) and standard ChIP-seq (Std) covering three loci at Rag1/Rag2 Foxp3 Runx3 Satb1 +/+ Satb1 -/- Rag 1/2 Runx3 Foxp3 Rag1/Rag2 Runx3 Foxp3 Rag1/Rag2 Runx3 Foxp3 Kitagawa et al., 2017 Rag1/Rag2 Runx3 Foxp3 Kitagawa et al., 2017 Figure 4—figure supplement 1. Standard ChIP-seq for SATB1 produces non-specific peaks in Satb1-/- thymocytes. ( A B Long-distance chromatin interactions involving a BUR depend on SATB1 We next explored whether there is any three-dimensional relationship between SATB1-bound BURs detected by urea-ChIP-seq and SATB1-bound sites in the open chromatin region detected by standard ChIP-seq. We hypothesized that SATB1-rich nuclear substructure where BURs are directly bound to SATB1 may interact with open chromatin regions by SATB1’s indirect association with their chromatin-bound protein complexes. If so, such interactions would necessarily be dependent on SATB1, and they might be correlated to gene expression. If so, such interactions would necessarily be dependent on SATB1, and they might be correlated to gene expression. To address these questions, we studied a gene-rich region in chromosome 2 that contains the Rag1 Rag2 Hao et al., 2015 Figure 4 , top track 2 urea ChIP-seq as well as Figure 5A and Figure 5B Rag1 Rag2 Figure 4 , top, track2 , Rag1 Rag2 Yannoutsos et al., 2004 Figure 5B Figure 5. SATB1 mediates dense chromatin interactions over Rag1/2 ( A Rag1 Rag2 Satb1 +/+ Satb1 -/- Rag1 Rag2 B Rag1 Rag2 Hind Hind Hind Hind Hind Figure 5—figure supplement 1. Urea 4C-seq protocol. Starting with urea-ultracentrifugation purified formaldehyde crosslinked chromatin: ( 1 Hind Hind Hind 2 3 4 Hae 5 Xho1 Hae Xho 6 Xho 7 8 9 Hind 10 Figure 5—figure supplement 2. Long-range chromatin interactions from BUR-1 traverse TADs. BUR-1 interactions determined by urea 4C-seq for wild type (WT) and SATB1-KO thymocytes cover the entire 5.75 Mb gene-rich region and these interactions bypass multiple small TADs revealed by the Hi-C heatmap (mm10) generated in the same region. Dotted line indicates the position of BUR-1. Figure 5—figure supplement 3. Long-distance interactions covering distal gene-rich regions by BUR-1. ( A Satb1 -/- Chen et al., 2018 B Satb1 +/+ Satb1 -/- Figure 5—figure supplement 4. SATB1-dependent genes identified within the three gene-rich regions that interact with BUR-1. Genes showing differential expression depending on SATB1 with adjusted p value (FDR)<0.05 are shown in red (SATB1 activated) and in blue (SATB1 repressed). The three gene-rich regions are accessible chromatin regions (enriched in DNase 1 hypersensitive sites) indicated by blue bars in Figure 5—figure supplement 3 Zelenka et al., 2022 To study interactions from the SATB1-bound BUR, we performed 4C-seq using urea-purified chromatin (urea 4C-seq, one-to-all) to better access and capture BUR-mediated interactions, which are expected to emanate from the SATB1 subnuclear architectural structure. In our urea 4C-seq, we used Hind Hind Dpn Dpn Hind Hind While urea purification removes indirectly associated protein and thus may reduce some chromatin interactions, we speculated that the overall 3D chromatin structure of fixed chromatin will still retain its proximity events, especially in the environment of chromatin which is strongly anchored to the nuclear substructure (as we predicted for SATB1 scaffold anchoring at BURs) to enable detection in urea 4C-seq. In the ChIP-seq protocol (in general), we expect that in the absence of a ligation step as is routinely done in 4 C protocols (as described below), subsequent steps for ChIP-seq (sonication, stringent washes of immunoprecipitated fragments, etc) result in dissociation of interacting fragments. We carried out urea 4C-seq experiments to test if we could indeed detect such strong SATB1-mediated 3D interactions. Briefly, for urea 4C-seq (outlined in Figure 5—figure supplement 1 Hind Ben Zouari et al., 2019 de Wit et al., 2013 Geeven et al., 2018 Krijger et al., 2020 Noordermeer et al., 2011 Wijchers et al., 2016 Figure 5—figure supplement 1 In wild-type thymocytes, we detected BUR-1 making extensive long-distance interactions covering most of the ~5.8 Mb adjacent gene-rich region ( Figure 5A Figure 5A , top track for urea SATB1 ChIP-seq, Figure 5—figure supplement 2 Rag1 Rag2 Figure 5A , track KO-BUR1 Hind B230118H07Rik Figure 5B Figure 5—figure supplement 2 Figure 5 Figure 5—figure supplement 3A and B A zoomed-in view (chr2:101,308,846–101,599,827; 291 Kb) of BUR-1 interactions confirmed a marked difference in BUR-1 interactions (~200 Kb) over the Rag1 Rag 2 Satb1 -/- Figure 5B Figure 5B Rag1 Rag2 Figure 5A Zelenka et al., 2022 Rag1 Rag2 Prrg4 Figure 5—figure supplement 3A and B Figure 5—figure supplement 4 SATB1 binds BURs in a cell-type-dependent manner We next examined whether SATB1 binds different subsets of BURs depending on cell type, by studying SATB1-binding profiles in three different types of mouse tissues – thymus, frontal cortex, and skin – that contain SATB1-expressing cells. SATB1 expression is primarily restricted to adult progenitor cells, such as thymocytes and in the basal layer of epidermis. SATB1 is also expressed in differentiated neurons in specific brain subregions (e.g. frontal cortex and amygdala). We compared UCSC browser images of two selected regions, a ~2.4 Mb region in chromosome 6 containing the Cd4 Figure 6A Gabra2 Gabrg1 Figure 6B Figure 6A tracks 11-13 Figure 6. SATB1 binds to BURs in a cell-type-dependent manner. ( A Cd4 Supplementary files 1 and 2 B Gabra2 Gabrg1 C Supplementary file 1 D We analyzed whether BURs are targeted by SATB1 depending on cell type. Consistent with the cell-type-specific function of SATB1, we observed cell-type-dependent differences in BUR occupancy by SATB1. For all three types of cells, high percentages of urea ChIP-seq peaks (close to 80%, Supplementary file 1 Ramírez et al., 2016 Figure 6C Supplementary file 1 Supplementary file 2 Figure 6D Supplementary file 2 Dickinson and Kohwi-Shigematsu, 1995 BURs are enriched in LADs LADs are large mostly heterochromatic domains in close contact with the nuclear lamina and are known to be enriched in AT-rich sequences ( Meuleman et al., 2013 Kohwi-Shigematsu et al., 2013 Chen et al., 2018 Vogel et al., 2007 Reddy and Wong, 2025 A Gabrg1, Gabra1, Gaba6, Gabrb2 Figure 7A Figure 7—figure supplement 1 Figure 7. BURs largely co-map with LADs. ( A Chen et al., 2018 Gabrg1 Gabra2, Gabra4, Gabrb1 Supplementary files 1 and 2 B C D E Figure 7—figure supplement 1. BURs and BUR-bound SATB1 largely co-map with LaminB1-DamID. The BUR distribution assessed by the BUR reference map (tracks 2) was compared against Lamin B1-DamID (track 1) over a 47.4 Mbp region in chromosome 3. Lamin B1-DamID data are from Chen et al., 2018 Figure 7—figure supplement 2. Some SATB1-bound BURs located in SATB1-dependent gene loci are outside of LADs. SATB1-bound BURs shown in Figure 4 Rag1/Rag2 Foxp3 Runx3 Chen et al., 2018 Figure 7—figure supplement 3. SATB1 occupancy relative to BURs, and BUR signal relative to SATB1-bound loci. (Left) Heatmaps showing SATB1 ChIP-seq signal intensity centered on all BUR elements, stratified by lamina association (LAD vs interLAD). Signal is plotted within ±3 kb of each BUR center using 50 bp bins using EnrichedHeatmap package (v1.30.0). The line plots above the heatmaps display the average SATB1 signal across all regions. Only a subset of BURs exhibits strong SATB1 binding, consistent with selective occupancy. (Right) Heatmaps showing BUR signal intensity centered on SATB1-bound regions (from ChIP-seq peaks), also separated into LAD and iLAD groups. The vast majority of SATB1 binding events are positioned within BURs, as evidenced by sharp, centered BUR signal at nearly all SATB1 peaks. Line plots reflect the average BUR signal profile across all SATB1 sites in each domain class. BUR intensities are derived from in vitro SATB1 BUR-binding assays. Figure 7—figure supplement 4. Interaction sites from BUR-1 or BUR-2 are mostly confined to the inter-LAD region. The region containing BUR-1 and BUR-2 as baits is light gray shaded with a pink arrowhead. This region is near the border of a LAD and an inter-LAD region, shown by LADs identified by Lamin B-DamID. Interaction profiles from either BUR-1 and BUR-2 obtained in wild-type thymocytes (WT-BUR1 or WT-BUR2) are found in a region surrounded by LADs. These interactions are greatly reduced in Satb1-KO thymocytes (KO-BUR1). Many interaction sites are close to H3Kme1 and H3K27ac sites. H3Kme1 and H3K27ac data are from ENCODE (LICR). Lamin B-DamID data shown is from Chen et al., 2018 We then examined the relationship between BUR and LAD distribution in mouse thymocytes at the genome-wide scale. We compared the genomic proximity to lamin B1 (as measured by Dam), SATB1-bound genomic sites (from standard ChIP-seq), SATB1-bound BURs (from urea ChIP-seq) over LADs and flanking regions (±10% outside of the LADs). We found that the genome-wide distribution of LADs coincides with the majority of SATB1-bound BURs, but it is mutually exclusive with SATB1-bound genomic sites that are mapped by standard ChIP-seq, which avoid LADs ( Figure 7B Figure 2A Figure 7C Guelen et al., 2008 Figure 7B and C Figure 7C Within larger LAD domains identified, there are smaller regions (<10 kb) that display localized looping away from the lamina ( Wen et al., 2012 Leemans et al., 2019 Luperchio et al., 2017 Figure 7D We also examined SATB1-bound BURs outside LADs (inter-LADs) in thymocytes. As a specific example, we showed SATB1-bound BUR distribution in close vicinity to genes in inter-LADs containing Rag1/Rag2 : Foxp3 Runx3 Figure 7—figure supplement 2 Figure 7D and E Figure 7—figure supplement 3 Figure 7—figure supplement 4 Discussion Here, we used a systematic approach to compare and interrogate the chromatin binding profiles of a genome organizing protein SATB1 detected by two alternative ChIP-seq approaches. Critically, by establishing a urea purification-based ChIP-seq method that enriches for direct DNA-binding events, we found that SATB1 directly binds BURs genome-wide. This is in stark contrast to previously identified SATB1 binding to enhancers and promoters in open chromatin by standard ChIP-seq. Nevertheless, the two contrasting DNA-binding profiles for SATB1 are both valid, requiring SATB1 for the ChIP-seq peaks. These differing SATB1-binding profiles suggest that SATB1 is engaged in chromatin organization through both direct binding to BURs, anchoring them to the subnuclear SATB1 protein meshwork, as well as by indirect binding to the DNase 1-accessible (active) chromatin region, enriched in genes and regulatory regions. We show that SATB1 is required for megabase-level interactions, connecting select BURs to ‘open’ chromatin, and that such interactions are linked with cell-type-specific gene expression regulated by SATB1 in thymocytes. Using urea ChIP-seq, which stringently purifies chromatin, we identified a new type of chromatin organization formed by direct binding of SATB1 with BURs, genomic elements distributed across the mouse genome. While this SATB1-mediated chromatin organization contrasts with previous data from standard ChIP-seq or CUT&Tag assays, which indicate SATB1 mainly interacts with enhancers and promoters located within the ‘open chromatin’ regions, our data agree with even earlier in vitro findings that SATB1 binds to AT-rich BURs. Thus, standard ChIP-seq (or Cut&Tag) and urea ChIP-seq enrich different and almost mutually exclusive SATB1 profiles, suggesting that these approaches are interrogating the genome in different ways. It is important to note that while urea ChIP-seq and standard ChIP-seq for SATB1 showed very different profiles, the binding profiles of CTCF and other proteins did not differ between the two methods. This is consistent with SATB1 interacting with chromatin in a unique way by forming a subnuclear proteinaceous network anchoring a subset of BURs ( Cai et al., 2003 Differences between standard and urea ChIP-seq In order to understand why chromatin binding proteins might show different binding modalities in urea ChIP-seq versus more standard approaches, it is important to understand the differences in the protocols. Standard ChIP-seq protocols use crosslinked whole cells or nuclei without purification of crosslinked chromatin, and immunoprecipitation is typically performed with the ‘cleared’ suspension after extracts of sonicated crosslinked chromatin are centrifuged, thus removing most of the insoluble material. Even if this fraction is not cleared in this way, the insoluble material does not perform well in immunoprecipitation assays ( Gesson et al., 2016 Cai et al., 2003 de Belle et al., 1998 Feng et al., 2022 Zelenka et al., 2022 Wang et al., 2023 Supplementary files 3 and 4 Galande et al., 2001 Dickinson et al., 1997 Nakagomi et al., 1994 Wang et al., 2014 Cai et al., 2003 Cai et al., 2006 Skowronska-Krawczyk et al., 2014 Han et al., 2008 Pavan Kumar et al., 2006 Notani et al., 2011 Stephen et al., 2017 Yasui et al., 2002 Notani et al., 2010 Two-tiered chromatin organization mediated by SATB1 Considering that the two contrasting SATB1-binding profiles require SATB1, an important question emerges as to whether there is a functional or structural link between the two SATB1-bound chromatin regions. We conceive that SATB1 might have a role in bringing together chromatin structure formed by BURs tightly bound to nuclear substructure and a highly accessible ‘open’ chromatin enriched in transcription-related proteins. Our urea 4C-seq results suggest that these two regions are connected via SATB1-mediated interactions involving BURs. The ligation step in urea 4C-seq enabled us to capture chromatin sites that were in close spatial proximity to the bait site (e.g. a BUR) at the time of crosslinking. Apparently, 3D structures fixed by formaldehyde retained sufficient chromatin proximity after urea purification to enable capture of BUR-interacting fragments. The urea 4C-seq revealed that a SATB1-bound BUR site (BUR-1 as a bait), located at the border of a gene desert and a gene-rich region containing SATB1-regulated genes ( Rag 1 Rag2 The SATB1-mediated chromatin interactions from BUR-1 and BUR-2 (validation control) as baits, covering the 5.8 Mb Rag1/Rag2 Rag1, Rag2 and Prrg4 Figure 5—figure supplement 3 Cai et al., 2006 Feng et al., 2022 Zelenka et al., 2022 Wang et al., 2023 Figure 8 Skowronska-Krawczyk et al., 2014 Figure 8. A model for SATB1-mediated chromatin organization with direct and indirect binding of SATB1 with chromatin. This model is based on the chromatin-binding profile of SATB1 obtained from urea ChIP-seq, which shows direct binding of SATB1 to BURs, and from standard ChIP-seq, which indicates presumably indirect binding of SATB1 to gene-rich, accessible chromatin regions. Additionally, the model incorporates chromatin interactions of selected SATB1-bound BURs detected by urea 4C-seq in this study. Once BURs are bound by SATB1, they are tightly anchored to the SATB1-rich nuclear substructure, which resists high salt extraction, as demonstrated in previous studies ( Cai et al., 2003 de Belle et al., 1998 Additional research will deepen our understanding of how SATB1 regulates cell-type-specific gene expression. The Wnt signaling pathway plays pivotal roles in carcinogenesis and development ( Song et al., 2024 Zhan et al., 2017 Nickerson et al., 1989 Nickerson, 2022 Thakur and Henikoff, 2020 Michieletto and Gilbert, 2019 Lack of overlapping function for SATB1 and CTCF Results obtained using urea-purified crosslinked chromatin show no relationship between CTCF and SATB1. Several pieces of evidence support this conclusion. First, genome-wide CTCF-binding profiles and Hi-C profiles remained largely unaltered by SATB1 deletion in thymocyte ( Figure 3 Feng et al., 2022 Zelenka et al., 2022 Zelenka et al., 2022 Wang et al., 2023 Potential biological significance of BURs mostly enriched in LADs We identify BURs as genomic elements enriched in LADs which are large chromatin domains located proximal to the nuclear lamina. LADs and LAD borders have critical roles in gene regulation (e.g. the Tcrb van Steensel and Belmont, 2017 Chen et al., 2018 Kohwi-Shigematsu et al., 2013 Peric-Hupkes et al., 2010 Zhao et al., 2015 hunchback Drosophila Lucas et al., 2021 van Steensel and Belmont, 2017 Solovei et al., 2009 Kind et al., 2013 Bian et al., 2013 Wong et al., 2014 Harr et al., 2015 Wong et al., 2021 Myc Cai et al., 2003 Cai et al., 2003 Future studies are needed to investigate the spatial context of a subset of BURs and LADs in relation to SATB1 subnuclear architecture, depending on the cell type. For instance, many SATB1-bound BURs are identified in the Gabrg1 Gabra2 Figure 6B Rag1/Rag2, Foxp3, Runx3 Watson and Tsai, 2017 Balamotis et al., 2012 Close et al., 2012 A broader significance of BUR-binding proteins beyond SATB1 Importantly, SATB1 is not the only BUR-binding protein, indicating the broader biological significance of BURs as genomic elements. Although SATB1 confers by far the highest affinity to BURs, several other nuclear factors (e.g. nucleolin, HMGI/Y, PARP1, Ku70/86 heterodimer) have also been verified to directly and specifically bind BURs in vitro ( Dickinson and Kohwi-Shigematsu, 1995 Galande and Kohwi-Shigematsu, 1999 Liu et al., 1999 Drosophila Batut et al., 2022 Levo et al., 2022 Drosophila Mohana et al., 2023 Lizana and Schwartz, 2024 Materials and methods Key resources table Reagent type (species) or resource Designation Source or reference Identifiers Additional information Genetic reagent  Satb1 fl/fl This paper  Satb1cKO Maintained on a C57BL/6J background Genetic reagent  Satb1 fl/fl Kakugawa et al., 2017 Kitagawa et al., 2017  Satb1 fl/fl Maintained on a C57BL/6J background Genetic reagent  Satb1 -/- Alvarez et al., 2000 Satb1 Maintained on a C57BL/6J background Genetic reagent  Satb1 +/+ The Jackson Laboratory WT C57BL/6J IMSR_JAX:000664 Antibody Anti-CTCF (Rabbit polyclonal) Active MOTIF Catalog # 61311 ChIP Antibody Anti-CTCF (Rabbit monoclonal) Abcam Catalog # Ab70303 Western (1:1000) Antibody Anti-CTCF (Rabbit polyclonal) Millipore Catalog # 7–729 ChIP Antibody Anti-RAD21 (Rabbit polyclonal) ABclonal Science Catalog # A18850 Western (1:1000) Antibody Anti-SATB1 (Rabbit polyclonal) Generated by Kohwi’s Lab 1583D ChIP (after SATB2 absorption) Antibody Anti-SATB1 (Rabbit monoclonal) Abcam Catalog # Ab109122 ChIP Antibody Anti-Histone H3 Abcam Catalog # Ab1791 Western (1:4000) Chemical compound, drug; Proteinase inhibitor; cOmplete Tablets Roche Catalog # 4693132001 Chemical compound, drug; Urea Sigma Catalog # U5378-500G Other RNase inhibitor New England Biolabs Catalog # M030L Other RNaseA ThermoFisher Catalog # EN0531 Other AmpliTaq Gold DNA polymerase AppliedBiosystems Catalog # 4311806 Other Dynabeads Protein A (protein purification beads) Invitrogen Catalog # 10001D Other Dynabeads Protein A/G (protein purification beads) ThermoFisher Catalog # 26,157 X Commercial assay or kit Quick PCR purification kit Invitrogen Catalog # K310001 Commercial assay or kit Quick PCR purification kit Macherey-Nagel (MN) Catalog # 740609.25 Commercial assay or kit TruPLEX DNA-seq kit Rubicon Genomics Catalog # QAM-150–001 Commercial assay or kit NEBNext Ultra II DNA Library Prep Kit for Illumina New England Biolab Catalog # NEB #71035 L Commercial assay or kit Arima HiC +kit Arima Genomics Catalog # A510008 Other SPRIselect (DNA purification beads) Beckman Coulter Catalog # B23317 Sequence-based reagent Linker top strand (Biotin modified) This paper Linker oligomer aattcggtacctctagagat*at* Sequence-based reagent Linker bottom strand This paper Linker oligomer aagcttctcgagcgatcggatatc Sequence-based reagent Illumina sequence-BUR-1-bait oligomer This paper Sequence primer AATGATACGGCGACCACCGAGATCTACACTCTTTCCCTACACGAC Sequence-based reagent Illumina sequence-BUR-2-bait oligomer This paper Sequence primer AATGATACGGCGACCACCGAGATCTACACTCTTTCCCTACACGAC Sequence-based reagent Illumina sequence-linker oligomer This paper Sequence primer CAAGCAGAAGACGGCATACGAGAT GTGACTGGAGTTC Sequence-based reagent BUR-1-bait sequence oligomer: This paper Sequence primer CTTTCCCTACACGAC Sequence-based reagent BUR-2-bait sequence oligomer This paper Sequence primer ACTCTTTCCCTACACGAC Sequence-based reagent Linker specific barcode oligomer This paper Sequence primer gaattcggtacctctagagatatccgatcgc- GAACTCCAGTCAC Sequence-based reagent Satb1 fl/fl This paper PCR primer ACGCAAACAGAACCCACTG Sequence-based reagent Satb1 fl/fl This paper PCR primer ACCAGGCAGAAAAATCATTG Mice Satb1 fl/fl Satb1 Satb1 fl/fl Satb1 ACGCAAACAGAACCCACTG ACCAGGCAGAAAAATCATTG Satb1 fl/fl Satb1 fl/fl Satb1 fl/fl Cd4-Cre Kakugawa et al., 2017 Kitagawa et al., 2017 Satb1 -/- Alvarez et al., 2000 Primary cells Thymi were isolated from 2-week-old Satb1 +/+ Satb1 -/- Satb1 +/+ Cd4 Cre Satb1 fl/fl Cre Satb1 +/+ Poterlowicz et al., 2017 Antibodies Antibodies used and for their purposes are the following. CTCF for ChIP-seq: Active MOTIF (61311, lot# 34614003), CTCF for Western: Abcam (ab70303) and Millipore (07–729; lot#–3429114), RAD21 for ChIP-seq and Western: ABclonal (A18850, lot# 3521809001), SATB1 for ChIP-seq and Western: rabbit polyclonal 1583D prepared by Kohwi-Shigematsu’s laboratory and Abcam (ab109122, lot#GR137720-13) and Histone H3 for Western: Abcam (ab1791, lotGR3236305-2). Anti-SATB1 antibody (1583D) was used after SATB2 absorption. Urea-purified chromatin immunoprecipitation and urea ChIP-seq Thymocytes and single-cell suspension prepared for cortex and skin were cross-linked with 1% formaldehyde for 10 min at room temperature, followed by addition of glycine at 0.125 M for 5 min to quench cross-linking reaction. These cells were washed with 1 X PBS, suspended in 1% BSA-PBS, and cells were precipitated in a tube. These cells were re-suspended in lysis buffer (4% SDS, 50 mM Tris-HCl [pH 8.0], 10 mM EDTA, 100 mM NaCl) with Protease inhibitor (Roche) and RNase inhibitor. The resulting cell lysate was incubated for 30 min at room temperature and loaded on top of 8 M urea followed by ultracentrifugation in a Beckman TL-100 Ultracentrifuge for 4–5 hrs at 45 K rpm (181,000 g, g=relative centrifugation force or RCF; TLS55 rotor). Recovered chromatin pellet was sonicated to generate fragment size ranging 300–1000 bp using Branson sonifier (20% power, 10 s on and 30 s off for 4–6 cycles) in 300 μl of sonication buffer [0.5% Na-laurylsarcosine, 0.1% deoxycholate (DOC), 1 mM EDTA, 0.5 mM EGTA, 10 mM TrisHCl, 100 mM NaCl] with Protease inhibitor and RNase inhibitor. Note: urea-purified crosslinked chromatin is highly vulnerable to sonication; therefore, it needs to adjust the sonication condition depending on cell type and/or the size of the precipitate DNA. The sonicated chromatin with 1% Triton X-100 was dialyzed against dialysis buffer (10 mM Tris-HCl [pH 8.0], 100 mM NaCl, 1 mM EDTA, 5% glycerol) and dialyzed for 16 hr at 4 °C (this dialysis is optional). The chromatin sample was centrifuged at 15,000 × g Standard ChIP-seq For standard ChIP-seq, the protocol described by Kitagawa et al was employed ( Kitagawa et al., 2017 Urea chromatin immunoprecipitation (urea ChIP)-western analysis Urea-purified chromatin prepared as described above (~10 μg of chromatin-DNA) was immunoprecipitated with indicated antibody to produce urea ChIP samples, and the chromatin fragments bound by the antibody were trapped by Protein-A beads. The antibody-bound chromatin fragment-trapped beads were washed with binding buffer/washing buffer/NaCl-TE (total 6 times), and the chromatin fragments were released and isolated from beads (65 °C for 20 min) in 100 μl of 1% SDS, 10 mM Tris, pH7.6, 1 mM EDTA, 100 mM NaCl solution. The isolated chromatin fragments were subjected to reverse-crosslinking by incubation at 65 °C for an additional 6 hr. The released proteins were dissolved in the Laemmli buffer, boiled, and subjected to western blot assay. To compare multiple samples, we confirmed that we used a similar amount of original urea-purified crosslinked chromatin before ChIP by subjecting each chromatin sample to Western blot using anti-H3 antibody. The similar amount of urea-purified crosslinked chromatin was then used for ChIP-western studies. Urea 4C-seq Urea-purified crosslinked chromatin (described above for its preparation) was processed for urea-4C-seq basically as described ( Kohwi-Shigematsu et al., 2012 Hind Hind Hind Hae Hind Hae Hind Hae Linker-top strand sequence with Biotin modified (marked by *): 5’- aattc ctcgag(XhoI HindIII Linker-bottom strand sequence: 5’-aagcttctcgagcgatcggatatctctagaggtaccgaatt-3 Kohwi-Shigematsu et al., 2012 Xho Hind Xho Kohwi-Shigematsu et al., 2012 o o o o o 5’ gaagggggtaggaaagaaagctt 3 5’ cgactcattcctactgaagctt 3 Hind The library was constructed by amplification using either Illumina sequence-BUR-1-bait or Illumina sequence-BUR-2-bait primer with Illumina sequence-linker oligomer. (Capital letters represent Illumina sequence, lower case letters represent bait sequences or the linker sequence) Illumina sequence-BUR-1-bait oligomer:  5’-AATGATACGGCGACCACCGAGATCTACACTCTTTCCCTACACGAC-gaagggggtaggaaagaaagct Illumina sequence-BUR-2-bait oligomer:  5’-AATGATACGGCGACCACCGAGATCTACACTCTTTCCCTACACGAC-cgactcattcctactgaagctt Illumina sequence-linker oligomer: 5’-CAAGCAGAAGACGGCATACGAGAT GTGACTGGAGTTC-gcgatcggatatctctagaggtaccgaattc To validate successful experiments, we confirmed that no PCR amplified product was generated by using either the bait oligomer or linker oligomer alone. For the library construction, Taq-Gold polymerase (NEB) was used for PCR by the following condition: 94 °C for 5–10 min (one cycle), 94 °C for 30 s, 55 °C for 30 s, 72 °C for 60 s (for 5–10 cycles), 94 °C for 30 s, 65 °C for 30 s, 72 °C for 60 s (for 20 cycles), followed by 72 °C for 10 min. PCR products were purified by phenol-chloroform extraction twice, CHCl3 extraction once, followed by EtOH precipitation (Optional; PCR purification by spin column, Qiagen). The 4 C libraries were sequenced by Illumina-HiSeq4000, using BUR-1-bait sequence and BUR-2-bait sequence as custom sequence oligomers as follows: BUR-1-bait sequence oligomer: 5’-CTTTCCCTACACGAC-gaagggggtaggaaagaaagctt BUR-2-bait sequence oligomer: 5’-ACTCTTTCCCTACACGAC-cgactcattcctactgaagctt Each library sequence was identified with Linker-specific barcode oligomer; 5’-gaattcggtacctctagagatatccgatcgc- GAACTCCAGTCAC Hi-C Hi-C was performed as described ( Rao et al., 2014 Satb1 +/+ Cd4 Satb1 fl/fl Cd4 + Statistical analysis Significance of overlap of SATB1 with BURS We used the bootRanges nullranges Mu et al., 2023 Huber et al., 2015 Olshen et al., 2004 Gel et al., 2016 For genome-wide heatmaps, we quantified SATB1 chromatin occupancy relative to mapped base unpairing regions (BURs). BURs were provided in narrowPeak format, and the SATB1 ChIP-seq peaks were obtained from a processed peak file containing signal intensity. Using the normalizeToMatrix function from the EnrichedHeatmap package (v1.30.0; Gu et al., 2018 Chen et al., 2018 Reddy and Wong, 2025 Gu et al., 2014 To assess the alignment of BURs to SATB1-bound loci, we performed the inverse analysis by quantifying BUR signal intensity around SATB1 binding peaks. SATB1 peaks were split into LAD- and iLAD-associated groups using genomic overlap with LAD intervals. BURs were used as a quantitative signal (score column from the narrowPeak file), and enrichment around each SATB1 site was computed in 50 bp bins across a±3 kb window using normalizeToMatrix function from the EnrichedHeatmap R package (v1.30.0). The resulting matrices were visualized as heatmaps and line plots of average BUR signal genome-wide or in each domain context (LAD vs iLAD). All visualizations were constructed using ComplexHeatmap (v2.18.0). Hi-C data processing Hi-C datasets were analyzed using the HiC-bench platform ( Lazaris et al., 2017 Kloetgen et al., 2020 Langmead and Salzberg, 2012 --very-sensitive-local --local Tsirigos et al., 2012 Imakaev et al., 2012 Gong et al., 2018 Lazaris et al., 2017 Durand et al., 2016 Quality control The total numbers of reads per biological replicate for each genotype ranged from 200 to 230 million reads. The percentage of reads aligned was >98% in all samples. The percentage of accepted reads (‘ds-accepted-intra’ and ‘ds-accepted-inter’) was in the range of 50–55.5%. The absolute number of accepted intra-chromosomal read pairs was ~90–100 million reads for each sample. We analyzed data from individual samples as well as combined data from two replicates (~200 million reads) for each genotype. A scaling plot was performed by aggregating the counts per 10 kb distance bins. Values were cpm-normalized by dividing by the total number of valid intra-chromosomal pairs. Compartments Compartment analysis was performed using the Homer pipeline (v4.6; Heinz et al., 2010 http://homer.ucsd.edu/homer/interactions/HiCpca.html urea ChIP-seq analysis Sequenced reads were quality-checked using FastQC prior to downstream analysis. Unaligned reads were mapped to the mouse reference genome (NCBI37/mm9) using bowtie2 (version 2.3.1) ( Langmead and Salzberg, 2012 Zhang et al., 2008 r p m Kent et al., 2010 Ramírez et al., 2016 urea 4C-seq analysis Reads were mapped with Bowtie, then assigned to HindIII Ben Zouari et al., 2019 Analysis of SATB1-bound sites and other genomic features LADs were identified as genomic intervals using the previously described LADetector algorithm ( https://github.com/thereddylab/pyLAD Sauria and Luperchio, 2019 https://github.com/thereddylab/LADetector Luperchio, 2018 Harr et al., 2015 Zullo et al., 2012 Favorov et al., 2012 To generate genome-wide line plots of averages of intensities (relative score) of DamID and ChIP-seq peak data were generated over inter-LAD (10% of the size of the adjacent LAD)/border flanked LADs scaled to the same relative size using the Genomation R package ( Akalin et al., 2015 Quinlan and Hall, 2010 Funding Information This paper was supported by the following grants: http://dx.doi.org/10.13039/100000002 National Institutes of Health R31CA39581 http://dx.doi.org/10.13039/100000002 National Institutes of Health R01ES023854 http://dx.doi.org/10.13039/100000002 National Institutes of Health R01AR071727 http://dx.doi.org/10.13039/100000002 National Institutes of Health AR047364 http://dx.doi.org/10.13039/100000002 National Institutes of Health R01GM132427 Acknowledgements We thank Dr. Aristotelis Tsirigos, Ziyan Lin, and Javier Rodriguez Hernaez at New York University School of Medicine for Hi-C and intersection analyses, Dr. Anthony Schmitt from Arima Genomics for help with Hi-C experiments. We also thank Dr. Elphege Nora for reviewing Hi-C results and providing critical and productive comments on the manuscript and Ms. Bao Ho for providing technical assistance. We thank Dr. Minoree Kohwi for critical reviewing of the manuscript and Dr. Peter Krijger for kindly testing our samples and Dr. Elzo de Wit for discussion on the 4C-seq analysis. National Institutes of Health grant R31CA39681 (TKS) National Institutes of Health grant R01ES023854 (TKS) National Institutes of Health grant R01GM132427 (KLR) National Institutes of Health grant R01AR071727 (VAB and TKS) National Institutes of Health grant R01 AR047364 (C-MC and TKS). Additional information Competing interests No competing interests declared. Author contributions Conceptualization, Resources, Data curation, Formal analysis, Supervision, Validation, Investigation, Methodology, Writing – original draft, Project administration, Writing – review and editing, Devised and optimized the urea ChIP-seq method. Data curation, Software, Formal analysis, Validation, Investigation, Analyzed the relative positions of LADs, BURs, and SATB1-binding sites. Data curation, Formal analysis. Data curation, Software, Formal analysis, Validation, Methodology, Processed and validated urea 4C-seq data. Data curation, Formal analysis. Resources, Data curation, Writing – review and editing. Resources, Data curation, Writing – review and editing. Formal analysis. Funding acquisition, Writing – review and editing. Resources, Funding acquisition. Resources, Writing – review and editing. Formal analysis, Supervision, Funding acquisition, Validation, Investigation, Methodology, Writing – original draft, Writing – review and editing, Supervised the work on LADs in this study. Conceptualization, Resources, Data curation, Formal analysis, Supervision, Funding acquisition, Validation, Investigation, Visualization, Methodology, Writing – original draft, Project administration, Writing – review and editing, Designed all experiments and supervised the project. Ethics This study was performed in strict accordance with the Guides for the Care and Use of Laboratory Animals of the National Institutes of Health. All the animals were handled according to approve institutional animal care and use committee (IACUC) protocols AN192808-01C and AN206117-00 of University of California, San Francisco. Additional files MDAR checklist Supplementary file 1. Intersection analysis of ChIP-seq samples. Supplementary file 2. ChIP-seq sample identification and peak number. Supplementary file 3. Intersection analysis of WT and KO ChIP-seq samples. Supplementary file 4. WT and KO ChIP-seq sample identification and total peak number. Data availability All sequencing data for ChIP-seq and Hi-C in this study have been deposited in Gene Expression Omnibus (GEO) database and are available under the accession number GSE191146 Satb1fl/fl:Cd4-Cre Kitagawa et al., 2017 GSE18776 Peng et al., 2009 Satb1fl/fl:Cd4-Cre GSE173476 Zelenka et al., 2022 The following dataset was generated:  Kohwi Y Wong X Grange M Sexton T Richards HW Liang Y Chuong C Kitagawa Y Sakaguchi S Botchkarev VA Taniuchi I Reddy KL Kohwi-Shigematsu T 2021 Deeply hidden genome organization mediated by base-unpairing regions (BURs) directly bound by SATB1 linked to transcription NCBI Gene Expression Omnibus GSE191146 The following previously published datasets were used:  Zelenka T Klonizakis A Tsoukatou D Papamatheakis DA 2022 The 3D enhancer network of the developing T cell genome is shaped by SATB1 NCBI Gene Expression Omnibus GSE173476 10.1038/s41467-022-34345-y PMC9663569 36376298  Yohko K Naganari O Yujiro K Alexis V Keiji H Ryoji K Daisuke M Shota N Motonari K Ichiro T Terumi KS Shimon S 2017 Guidance of regulatory T cell development by Satb1-dependent super-enhancer establishment NCBI Sequence Read Archive DRP003376  Peng JC Valouev A Swigut T Zhang J Zhao J Sidow Y Wysocka A 2009 Jarid2/Jumonji coordinates control of PRC2 enzymatic activity and target gene occupancy in pluripotent cells NCBI Gene Expression Omnibus GSE18776 10.1016/j.cell.2009.12.002 PMC2911953 20064375 References Akalin A Franke V Vlahoviček K Mason CE Schübeler D 2015 Genomation: a toolkit to summarize, annotate and visualize genomic intervals Bioinformatics 31 1127 1129 10.1093/bioinformatics/btu775 25417204 Alvarez JD Yasui DH Niida H Joh T Loh DY Kohwi-Shigematsu T 2000 The MAR-binding protein SATB1 orchestrates temporal and spatial expression of multiple genes during T-cell development Genes & Development 14 521 535 10.1101/gad.14.5.521 10716941 PMC316425 Balamotis MA Tamberg N Woo YJ Li J Davy B Kohwi-Shigematsu T Kohwi Y 2012 Satb1 ablation alters temporal expression of immediate early genes and reduces dendritic spine density during postnatal brain development Molecular and Cellular Biology 32 333 347 10.1128/MCB.05917-11 22064485 PMC3255767 Bashkirova E Lomvardas S 2019 Olfactory receptor genes make the case for inter-chromosomal interactions Current Opinion in Genetics & Development 55 106 113 10.1016/j.gde.2019.07.004 31491591 PMC6759391 Batut PJ Bing XY Sisco Z Raimundo J Levo M Levine MS 2022 Genome organization controls transcriptional dynamics during development Science 375 566 570 10.1126/science.abi7178 35113722 PMC10368186 Baumgarten S Bryant J 2022 Chromatin structure can introduce systematic biases in genome-wide analyses of Plasmodium falciparum Open Research Europe 2 75 10.12688/openreseurope.14836.2 37645349 PMC10445928 Ben Zouari Y Platania A Molitor AM Sexton T 2019 4See: a flexible browser to explore 4c data Frontiers in Genetics 10 1372 10.3389/fgene.2019.01372 32038719 PMC6985583 Bian Q Khanna N Alvikas J Belmont AS 2013 β-Globin cis-elements determine differential nuclear targeting through epigenetic modifications Journal of Cell Biology 203 767 783 10.1083/jcb.201305027 24297746 PMC3857487 Bintu B Mateo LJ Su JH Sinnott-Armstrong NA Parker M Kinrot S Yamaya K Boettiger AN Zhuang X 2018 Super-resolution chromatin tracing reveals domains and cooperative interactions in single cells Science 362 eaau1783 10.1126/science.aau1783 30361340 PMC6535145 Bode J Kohwi Y Dickinson L Joh T Klehr D Mielke C Kohwi-Shigematsu T 1992 Biological significance of unwinding capability of nuclear matrix-associating DNAs Science 255 195 197 10.1126/science.1553545 1553545 Cai S Han HJ Kohwi-Shigematsu T 2003 Tissue-specific nuclear architecture and gene expression regulated by SATB1 Nature Genetics 34 42 51 10.1038/ng1146 12692553 Cai S Lee CC Kohwi-Shigematsu T 2006 SATB1 packages densely looped, transcriptionally active chromatin for coordinated expression of cytokine genes Nature Genetics 38 1278 1288 10.1038/ng1913 17057718 Cattoni DI Cardozo Gizzi AM Georgieva M Di Stefano M Valeri A Chamousset D Houbron C Déjardin S Fiche J-B González I Chang J-M Sexton T Marti-Renom MA Bantignies F Cavalli G Nollmann M 2017 Single-cell absolute contact probability detection reveals chromosomes are organized by multiple low-frequency yet specific interactions Nature Communications 8 1753 10.1038/s41467-017-01962-x 29170434 PMC5700980 Chen S Luperchio TR Wong X Doan EB Byrd AT Roy Choudhury K Reddy KL Krangel MS 2018 A lamina-associated domain border governs nuclear lamina interactions, transcription, and recombination of the tcrb locus Cell Reports 25 1729 1740 10.1016/j.celrep.2018.10.052 30428344 PMC6287930 Chen LF Lee J Boettiger A 2023 Recent progress and challenges in single-cell imaging of enhancer-promoter interaction Current Opinion in Genetics & Development 79 102023 10.1016/j.gde.2023.102023 36854248 Chi Y Shi J Xing D Tan L 2022 Every gene everywhere all at once: high-precision measurement of 3D chromosome architecture with single-cell Hi-C Frontiers in Molecular Biosciences 9 959688 10.3389/fmolb.2022.959688 36275628 PMC9583135 Close J Xu H De Marco García N Batista-Brito R Rossignol E Rudy B Fishell G 2012 Satb1 is an activity-modulated transcription factor required for the terminal differentiation and connectivity of medial ganglionic eminence-derived cortical interneurons The Journal of Neuroscience 32 17690 17705 10.1523/JNEUROSCI.3583-12.2012 23223290 PMC3654406 Das A Mukhopadhyay C 2009 Urea-mediated protein denaturation: a consensus view The Journal of Physical Chemistry. B 113 12816 12824 10.1021/jp906350s 19708649 Davis CA Hitz BC Sloan CA Chan ET Davidson JM Gabdank I Hilton JA Jain K Baymuradov UK Narayanan AK Onate KC Graham K Miyasato SR Dreszer TR Strattan JS Jolanki O Tanaka FY Cherry JM 2018 The Encyclopedia of DNA elements (ENCODE): data portal update Nucleic Acids Research 46 D794 D801 10.1093/nar/gkx1081 29126249 PMC5753278 de Belle I Cai S Kohwi-Shigematsu T 1998 The genomic sequences bound to special AT-rich sequence-binding protein 1 (SATB1) in vivo in Jurkat T cells are tightly associated with the nuclear matrix AT the bases of the chromatin loops The Journal of Cell Biology 141 335 348 10.1083/jcb.141.2.335 9548713 PMC2148460 de Wit E Bouwman BAM Zhu Y Klous P Splinter E Verstegen MJAM Krijger PHL Festuccia N Nora EP Welling M Heard E Geijsen N Poot RA Chambers I de Laat W 2013 The pluripotent genome in three dimensions is shaped around pluripotency factors Nature 501 227 231 10.1038/nature12420 23883933 Dickinson LA Joh T Kohwi Y Kohwi-Shigematsu T 1992 A tissue-specific MAR/SAR DNA-binding protein with unusual binding site recognition Cell 70 631 645 10.1016/0092-8674(92)90432-c 1505028 Dickinson LA Kohwi-Shigematsu T 1995 Nucleolin is a matrix attachment region DNA-binding protein that specifically recognizes a region with high base-unpairing potential Molecular and Cellular Biology 15 456 465 10.1128/MCB.15.1.456 7799955 PMC231991 Dickinson LA Dickinson CD Kohwi-Shigematsu T 1997 An atypical homeodomain in SATB1 promotes specific recognition of the key structural element in a matrix attachment region The Journal of Biological Chemistry 272 11463 11470 10.1074/jbc.272.17.11463 9111059 Dixon JR Selvaraj S Yue F Kim A Li Y Shen Y Hu M Liu JS Ren B 2012 Topological domains in mammalian genomes identified by analysis of chromatin interactions Nature 485 376 380 10.1038/nature11082 22495300 PMC3356448 Durand NC Shamim MS Machol I Rao SSP Huntley MH Lander ES Aiden EL 2016 Juicer provides a one-click system for analyzing loop-resolution Hi-C experiments Cell Systems 3 95 98 10.1016/j.cels.2016.07.002 27467249 PMC5846465 Favorov A Mularoni L Cope LM Medvedeva Y Mironov AA Makeev VJ Wheelan SJ 2012 Exploring massive, genome scale datasets with the GenometriCorr package PLOS Computational Biology 8 e1002529 10.1371/journal.pcbi.1002529 22693437 PMC3364938 Feng D Chen Y Dai R Bian S Xue W Zhu Y Li Z Yang Y Zhang Y Zhang J Bai J Qin L Kohwi Y Shi W Kohwi-Shigematsu T Ma J Liao S Hao B 2022 Chromatin organizer SATB1 controls the cell identity of CD4+ CD8+ double-positive thymocytes by regulating the activity of super-enhancers Nature Communications 13 5554 10.1038/s41467-022-33333-6 PMC9500044 36138028 Fessing MY Mardaryev AN Gdula MR Sharov AA Sharova TY Rapisarda V Gordon KB Smorodchenko AD Poterlowicz K Ferone G Kohwi Y Missero C Kohwi-Shigematsu T Botchkarev VA 2011 p63 regulates Satb1 Journal of Cell Biology 194 825 839 10.1083/jcb.201101148 21930775 PMC3207288 Finn EH Pegoraro G Brandão HB Valton A-L Oomen ME Dekker J Mirny L Misteli T 2019 Extensive heterogeneity and intrinsic variation in spatial genome organization Cell 176 1502 1515 10.1016/j.cell.2019.01.020 30799036 PMC6408223 Frömberg A Engeland K Aigner A 2018 The Special AT-rich sequence binding protein 1 (SATB1) and its role in solid tumors Cancer Letters 417 96 111 10.1016/j.canlet.2017.12.031 29306014 Fudenberg G Imakaev M Lu C Goloborodko A Abdennur N Mirny LA 2016 Formation of chromosomal domains by loop extrusion Cell Reports 15 2038 2049 10.1016/j.celrep.2016.04.085 27210764 PMC4889513 Gabriele M Brandão HB Grosse-Holz S Jha A Dailey GM Cattoglio C Hsieh T-HS Mirny L Zechner C Hansen AS 2022 Dynamics of CTCF- and cohesin-mediated chromatin looping revealed by live-cell imaging Science 376 496 501 10.1126/science.abn6583 35420890 PMC9069445 Galande S Kohwi-Shigematsu T 1999 Poly(ADP-ribose) polymerase and Ku autoantigen form a complex and synergistically bind to matrix attachment sequences The Journal of Biological Chemistry 274 20521 20528 10.1074/jbc.274.29.20521 10400681 Galande S Dickinson LA Mian IS Sikorska M Kohwi-Shigematsu T 2001 SATB1 cleavage by caspase 6 disrupts PDZ domain-mediated dimerization, causing detachment from chromatin early in T-cell apoptosis Molecular and Cellular Biology 21 5591 5604 10.1128/MCB.21.16.5591-5604.2001 11463840 PMC87280 Geeven G Teunissen H de Laat W de Wit E 2018 peakC: a flexible, non-parametric peak calling package for 4C and Capture-C data Nucleic Acids Research 46 e91 10.1093/nar/gky443 29800273 PMC6125690 Gel B Díez-Villanueva A Serra E Buschbeck M Peinado MA Malinverni R 2016 regioneR: an R/Bioconductor package for the association analysis of genomic regions based on permutation tests Bioinformatics 32 289 291 10.1093/bioinformatics/btv562 26424858 PMC4708104 Gesson K Rescheneder P Skoruppa MP von Haeseler A Dechat T Foisner R 2016 A-type lamins bind both hetero- and euchromatin, the latter being regulated by lamina-associated polypeptide 2 alpha Genome Research 26 462 473 10.1101/gr.196220.115 26798136 PMC4817770 Göndör A Ohlsson R 2018 Enhancer functions in three dimensions: beyond the flat world perspective F1000Research 7 F1000 Faculty Rev-681 10.12688/f1000research.13842.1 29904581 PMC5981187 Gong Y Lazaris C Sakellaropoulos T Lozano A Kambadur P Ntziachristos P Aifantis I Tsirigos A 2018 Stratification of TAD boundaries reveals preferential insulation of super-enhancers by strong boundaries Nature Communications 9 542 10.1038/s41467-018-03017-1 29416042 PMC5803259 Goolam M Zernicka-Goetz M 2017 The chromatin modifier Satb1 regulates cell fate through Fgf signalling in the early mouse embryo Development 144 1450 1461 10.1242/dev.144139 28289135 PMC5399666 Gu Z Gu L Eils R Schlesner M Brors B 2014 circlize Implements and enhances circular visualization in R Bioinformatics 30 2811 2812 10.1093/bioinformatics/btu393 24930139 Gu Z Eils R Schlesner M Ishaque N 2018 EnrichedHeatmap: an R/Bioconductor package for comprehensive visualization of genomic signal associations BMC Genomics 19 234 10.1186/s12864-018-4625-x 29618320 PMC5885322 Guelen L Pagie L Brasset E Meuleman W Faza MB Talhout W Eussen BH de Klein A Wessels L de Laat W van Steensel B 2008 Domain organization of human chromosomes revealed by mapping of nuclear lamina interactions Nature 453 948 951 10.1038/nature06947 18463634 Hafner A Park M Berger SE Murphy SE Nora EP Boettiger AN 2023 Loop stacking organizes genome folding from TADs to chromosomes Molecular Cell 83 1377 1392 10.1016/j.molcel.2023.04.008 37146570 PMC10167645 Han HJ Russo J Kohwi Y Kohwi-Shigematsu T 2008 SATB1 reprogrammes gene expression to promote breast tumour growth and metastasis Nature 452 187 193 10.1038/nature06781 18337816 Hao B Naik AK Watanabe A Tanaka H Chen L Richards HW Kondo M Taniuchi I Kohwi Y Kohwi-Shigematsu T Krangel MS 2015 An anti-silencer- and SATB1-dependent chromatin hub regulates Rag1 and Rag2 gene expression during thymocyte development The Journal of Experimental Medicine 212 809 824 10.1084/jem.20142207 25847946 PMC4419350 Harr JC Luperchio TR Wong X Cohen E Wheelan SJ Reddy KL 2015 Directed targeting of chromatin to the nuclear lamina is mediated by chromatin state and A-type lamins The Journal of Cell Biology 208 33 52 10.1083/jcb.201405110 25559185 PMC4284222 Hegedüs E Kókai E Kotlyar A Dombrádi V Szabó G 2009 Separation of 1-23-kb complementary DNA strands by urea-agarose gel electrophoresis Nucleic Acids Research 37 e112 10.1093/nar/gkp539 19553189 PMC2761254 Heinz S Benner C Spann N Bertolino E Lin YC Laslo P Cheng JX Murre C Singh H Glass CK 2010 Simple combinations of lineage-determining transcription factors prime cis-regulatory elements required for macrophage and B cell identities Molecular Cell 38 576 589 10.1016/j.molcel.2010.05.004 20513432 PMC2898526 Huang Y Zhang L Song NN Hu ZL Chen JY Ding YQ 2011 Distribution of Satb1 in the central nervous system of adult mice Neuroscience Research 71 12 21 10.1016/j.neures.2011.05.015 21658419 Huber W Carey VJ Gentleman R Anders S Carlson M Carvalho BS Bravo HC Davis S Gatto L Girke T Gottardo R Hahne F Hansen KD Irizarry RA Lawrence M Love MI MacDonald J Obenchain V Oleś AK Pagès H Reyes A Shannon P Smyth GK Tenenbaum D Waldron L Morgan M 2015 Orchestrating high-throughput genomic analysis with Bioconductor Nature Methods 12 115 121 10.1038/nmeth.3252 25633503 PMC4509590 Imakaev M Fudenberg G McCord RP Naumova N Goloborodko A Lajoie BR Dekker J Mirny LA 2012 Iterative correction of Hi-C data reveals hallmarks of chromosome organization Nature Methods 9 999 1003 10.1038/nmeth.2148 22941365 PMC3816492 Jain D Baldi S Zabel A Straub T Becker PB 2015 Active promoters give rise to false positive “Phantom Peaks” in ChIP-seq experiments Nucleic Acids Research 43 6959 6968 10.1093/nar/gkv637 26117547 PMC4538825 Kakugawa K Kojo S Tanaka H Seo W Endo TA Kitagawa Y Muroi S Tenno M Yasmin N Kohwi Y Sakaguchi S Kowhi-Shigematsu T Taniuchi I 2017 Essential roles of SATB1 in Specifying T lymphocyte subsets Cell Reports 19 1176 1188 10.1016/j.celrep.2017.04.038 28494867 Kent WJ Zweig AS Barber G Hinrichs AS Karolchik D 2010 BigWig and BigBed: enabling browsing of large distributed datasets Bioinformatics 26 2204 2207 10.1093/bioinformatics/btq351 20639541 PMC2922891 Kind J Pagie L Ortabozkoyun H Boyle S de Vries SS Janssen H Amendola M Nolen LD Bickmore WA van Steensel B 2013 Single-cell dynamics of genome-nuclear lamina interactions Cell 153 178 192 10.1016/j.cell.2013.02.028 23523135 Kind J Pagie L de Vries SS Nahidiazar L Dey SS Bienko M Zhan Y Lajoie B de Graaf CA Amendola M Fudenberg G Imakaev M Mirny LA Jalink K Dekker J van Oudenaarden A van Steensel B 2015 Genome-wide maps of nuclear lamina interactions in single human cells Cell 163 134 147 10.1016/j.cell.2015.08.040 26365489 PMC4583798 Kitagawa Y Ohkura N Kidani Y Vandenbon A Hirota K Kawakami R Yasuda K Motooka D Nakamura S Kondo M Taniuchi I Kohwi-Shigematsu T Sakaguchi S 2017 Guidance of regulatory T cell development by Satb1-dependent super-enhancer establishment Nature Immunology 18 173 183 10.1038/ni.3646 27992401 PMC5582804 Kloetgen A Thandapani P Ntziachristos P Ghebrechristos Y Nomikou S Lazaris C Chen X Hu H Bakogianni S Wang J Fu Y Boccalatte F Zhong H Paietta E Trimarchi T Zhu Y Van Vlierberghe P Inghirami GG Lionnet T Aifantis I Tsirigos A 2020 Three-dimensional chromatin landscapes in T cell acute lymphoblastic leukemia Nature Genetics 52 388 400 10.1038/s41588-020-0602-9 32203470 PMC7138649 Kohwi-Shigematsu T Kohwi Y 1990 Torsional stress stabilizes extended base unpairing in suppressor sites flanking immunoglobulin heavy chain enhancer Biochemistry 29 9551 9560 10.1021/bi00493a009 2125477 Kohwi-Shigematsu T Kohwi Y 1992 Detection of non-B-DNA structures at specific sites in supercoiled plasmid DNA and chromatin with haloacetaldehyde and diethyl pyrocarbonate Methods in Enzymology 212 155 180 10.1016/0076-6879(92)12011-e 1518447 Kohwi-Shigematsu T deBelle I Dickinson LA Galande S Kohwi Y 1998 Identification of base-unpairing region-binding proteins and characterization of their in vivo binding sequences Methods in Cell Biology 53 323 354 10.1016/s0091-679x(08)60885-7 9348515 Kohwi-Shigematsu T Kohwi Y Takahashi K Richards HW Ayers SD Han HJ Cai S 2012 SATB1-mediated functional packaging of chromatin into loops Methods 58 243 254 10.1016/j.ymeth.2012.06.019 22782115 PMC4029128 Kohwi-Shigematsu T Poterlowicz K Ordinario E Han HJ Botchkarev VA Kohwi Y 2013 Genome organizing function of SATB1 in tumor progression Seminars in Cancer Biology 1 e101-0 10.1016/j.semcancer.2012.06.009 PMC4048061 22771615 Kondo M Tanaka Y Kuwabara T Naito T Kohwi-Shigematsu T Watanabe A 2016 SATB1 plays a critical role in establishment of immune tolerance Journal of Immunology 196 563 572 10.4049/jimmunol.1501429 26667169 Kourilsky P Manteuil S Zamansky MH Gros F 1970 DNA-RNA hybridization at low temperature in the presence of urea Biochemical and Biophysical Research Communications 41 1080 1087 10.1016/0006-291x(70)90196-8 4920471 Kourilsky P Leidner J Tremblay GY 1971 DNA-DNA hybridization on filters at low temperature in the presence of formamide or urea Biochimie 53 1111 1114 10.1016/s0300-9084(71)80201-8 4948624 Krijger PHL Geeven G Bianchi V Hilvering CRE de Laat W 2020 4C-seq from beginning to end: a detailed protocol for sample preparation and data analysis Methods 170 17 32 10.1016/j.ymeth.2019.07.014 31351925 Langmead B Salzberg SL 2012 Fast gapped-read alignment with Bowtie 2 Nature Methods 9 357 359 10.1038/nmeth.1923 22388286 PMC3322381 Lazaris C Kelly S Ntziachristos P Aifantis I Tsirigos A 2017 HiC-bench: comprehensive and reproducible Hi-C data analysis designed for parameter exploration and benchmarking BMC Genomics 18 22 10.1186/s12864-016-3387-6 28056762 PMC5217551 Leemans C van der Zwalm MCH Brueckner L Comoglio F van Schaik T Pagie L van Arensbergen J van Steensel B 2019 Promoter-intrinsic and local chromatin features determine gene repression in LADs Cell 177 852 864 10.1016/j.cell.2019.03.009 30982597 PMC6506275 Levo M Raimundo J Bing XY Sisco Z Batut PJ Ryabichko S Gregor T Levine MS 2022 Transcriptional coupling of distant regulatory genes in living embryos Nature 605 754 760 10.1038/s41586-022-04680-7 35508662 PMC9886134 Lieberman-Aiden E van Berkum NL Williams L Imakaev M Ragoczy T Telling A Amit I Lajoie BR Sabo PJ Dorschner MO Sandstrom R Bernstein B Bender MA Groudine M Gnirke A Stamatoyannopoulos J Mirny LA Lander ES Dekker J 2009 Comprehensive mapping of long-range interactions reveals folding principles of the human genome Science 326 289 293 10.1126/science.1181369 19815776 PMC2858594 Liu WM Guerra-Vladusic FK Kurakata S Lupu R Kohwi-Shigematsu T 1999 HMG-I(Y) recognizes base-unpairing regions of matrix attachment sequences and its increased expression is directly linked to metastatic breast cancer phenotype Cancer Research 59 5695 5703 10582687 Lizana L Schwartz YB 2024 The scales, mechanisms, and dynamics of the genome architecture Science Advances 10 eadm8167 10.1126/sciadv.adm8167 38598632 PMC11006219 Loubiere V Papadopoulos GL Szabo Q Martinez AM Cavalli G 2020 Widespread activation of developmental gene expression characterized by PRC1-dependent chromatin looping Science Advances 6 eaax4001 10.1126/sciadv.aax4001 31950077 PMC6954061 Lucas T Hafer TL Zhang HG Molotkova N Kohwi M 2021 Discrete cis-acting element regulates developmentally timed gene-lamina relocation and neural progenitor competence in vivo Developmental Cell 56 2649 2663 10.1016/j.devcel.2021.08.020 34529940 PMC8629127 Luperchio TR Sauria MEG Wong X Gaillard MC Tsang P Pekrun K Ach RA Yamada NA Taylor J Reddy KL 2017 Chromosome conformation paints reveal the role of lamina association in genome organization and regulation bioRxiv 10.1101/122226 Luperchio T 2018 LADetector 39705ab GitHub https://github.com/thereddylab/LADetector Mach P Kos PI Zhan Y Cramard J Gaudin S Tünnermann J Marchi E Eglinger J Zuin J Kryzhanovska M Smallwood S Gelman L Roth G Nora EP Tiana G Giorgetti L 2022 Cohesin and CTCF control the dynamics of chromosome folding Nature Genetics 54 1907 1918 10.1038/s41588-022-01232-7 36471076 PMC9729113 Meuleman W Peric-Hupkes D Kind J Beaudry J-B Pagie L Kellis M Reinders M Wessels L van Steensel B 2013 Constitutive nuclear lamina-genome interactions are highly conserved and associated with A/T-rich sequence Genome Research 23 270 280 10.1101/gr.141028.112 23124521 PMC3561868 Meyer CA Liu XS 2014 Identifying and mitigating bias in next-generation sequencing methods for chromatin biology Nature Reviews. Genetics 15 709 721 10.1038/nrg3788 25223782 PMC4473780 Michieletto D Gilbert N 2019 Role of nuclear RNA in regulating chromatin structure and transcription Current Opinion in Cell Biology 58 120 125 10.1016/j.ceb.2019.03.007 31009871 PMC6694202 Misteli T 2020 The self-organizing genome: principles of genome architecture and function Cell 183 28 45 10.1016/j.cell.2020.09.014 32976797 PMC7541718 Mohana G Dorier J Li X Mouginot M Smith RC Malek H Leleu M Rodriguez D Khadka J Rosa P Cousin P Iseli C Restrepo S Guex N McCabe BD Jankowski A Levine MS Gambetta MC 2023 Chromosome-level organization of the regulatory genome in the Drosophila Cell 186 3826 3844 10.1016/j.cell.2023.07.008 37536338 PMC10529364 Mu W Davis ES Lee S Dozmorov MG Phanstiel DH Love MI 2023 bootRanges: flexible generation of null sets of genomic ranges for hypothesis testing Bioinformatics 39 btad190 10.1093/bioinformatics/btad190 37042725 PMC10159650 Nakagomi K Kohwi Y Dickinson LA Kohwi-Shigematsu T 1994 A novel DNA-binding motif in the nuclear matrix attachment DNA-binding protein SATB1 Molecular and Cellular Biology 14 1852 1860 10.1128/mcb.14.3.1852-1860.1994 8114718 PMC358543 Nickerson JA Krochmalnic G Wan KM Penman S 1989 Chromatin architecture and nuclear RNA PNAS 86 177 181 10.1073/pnas.86.1.177 2911567 PMC286427 Nickerson JA 2022 The ribonucleoprotein network of the nucleus: a historical perspective Current Opinion in Genetics & Development 75 101940 10.1016/j.gde.2022.101940 35777349 Noordermeer D Leleu M Splinter E Rougemont J De Laat W Duboule D 2011 The dynamic architecture of Hox gene clusters Science 334 222 225 10.1126/science.1207194 21998387 Nora EP Lajoie BR Schulz EG Giorgetti L Okamoto I Servant N Piolot T van Berkum NL Meisig J Sedat J Gribnau J Barillot E Blüthgen N Dekker J Heard E 2012 Spatial partitioning of the regulatory landscape of the X-inactivation centre Nature 485 381 385 10.1038/nature11049 22495304 PMC3555144 Nora EP Goloborodko A Valton AL Gibcus JH Uebersohn A Abdennur N Dekker J Mirny LA Bruneau BG 2017 Targeted Degradation of CTCF decouples local insulation of chromosome domains from genomic compartmentalization Cell 169 930 944 10.1016/j.cell.2017.05.004 28525758 PMC5538188 Notani D Gottimukkala KP Jayani RS Limaye AS Damle MV Mehta S Purbey PK Joseph J Galande S 2010 Global regulator SATB1 recruits beta-catenin and regulates T(H)2 differentiation in Wnt-dependent manner PLOS Biology 8 e1000296 10.1371/journal.pbio.1000296 20126258 PMC2811152 Notani D Ramanujam PL Kumar PP Gottimukkala KP Kumar-Sinha C Galande S 2011 N-terminal PDZ-like domain of chromatin organizer SATB1 contributes towards its function as transcription regulator Journal of Biosciences 36 461 469 10.1007/s12038-011-9091-4 21799257 Olshen AB Venkatraman ES Lucito R Wigler M 2004 Circular binary segmentation for the analysis of array-based DNA copy number data Biostatistics 5 557 572 10.1093/biostatistics/kxh008 15475419 Oprzeska-Zingrebe EA Smiatek J 2018 Preferential binding of urea to single-stranded DNA structures: a molecular dynamics study Biophysical Journal 114 1551 1562 10.1016/j.bpj.2018.02.013 29642026 PMC5954286 Ordinario E Han HJ Furuta S Heiser LM Jakkula LR Rodier F Spellman PT Campisi J Gray JW Bissell MJ Kohwi Y Kohwi-Shigematsu T 2012 ATM suppresses SATB1-induced malignant progression in breast epithelial cells PLOS ONE 7 e51786 10.1371/journal.pone.0051786 23251624 PMC3519734 Park D Lee Y Bhupindersingh G Iyer VR 2013 Widespread misinterpretable ChIP-seq bias in yeast PLOS ONE 8 e83506 10.1371/journal.pone.0083506 24349523 PMC3857294 Pavan Kumar P Purbey PK Sinha CK Notani D Limaye A Jayani RS Galande S 2006 Phosphorylation of SATB1, a global gene regulator, acts as a molecular switch regulating its transcriptional activity in vivo Molecular Cell 22 231 243 10.1016/j.molcel.2006.03.010 16630892 Peng JC Valouev A Swigut T Zhang J Zhao Y Sidow A Wysocka J 2009 Jarid2/Jumonji coordinates control of PRC2 enzymatic activity and target gene occupancy in pluripotent cells Cell 139 1290 1302 10.1016/j.cell.2009.12.002 20064375 PMC2911953 Peric-Hupkes D Meuleman W Pagie L Bruggeman SWM Solovei I Brugman W Gräf S Flicek P Kerkhoven RM van Lohuizen M Reinders M Wessels L van Steensel B 2010 Molecular maps of the reorganization of genome-nuclear lamina interactions during differentiation Molecular Cell 38 603 613 10.1016/j.molcel.2010.03.016 20513434 PMC5975946 Politz JCR Scalzo D Groudine M 2013 Something silent this way forms: the functional organization of the repressive nuclear compartment Annual Review of Cell and Developmental Biology 29 241 270 10.1146/annurev-cellbio-101512-122317 23834025 PMC3999972 Poterlowicz K Yarker JL Malashchuk I Lajoie BR Mardaryev AN Gdula MR Sharov AA Kohwi-Shigematsu T Botchkarev VA Fessing MY 2017 5C analysis of the Epidermal Differentiation Complex locus reveals distinct chromatin interaction networks between gene-rich and gene-poor TADs in skin epithelial cells PLOS Genetics 13 e1006966 10.1371/journal.pgen.1006966 28863138 PMC5599062 Quinlan AR Hall IM 2010 BEDTools: a flexible suite of utilities for comparing genomic features Bioinformatics 26 841 842 10.1093/bioinformatics/btq033 20110278 PMC2832824 Raghunathan S Jaganade T Priyakumar UD 2020 Urea-aromatic interactions in biology Biophysical Reviews 12 65 84 10.1007/s12551-020-00620-9 32067192 PMC7040157 Ramírez F Ryan DP Grüning B Bhardwaj V Kilpert F Richter AS Heyne S Dündar F Manke T 2016 deepTools2: a next generation web server for deep-sequencing data analysis Nucleic Acids Research 44 W160 W165 10.1093/nar/gkw257 27079975 PMC4987876 Rao SSP Huntley MH Durand NC Stamenova EK Bochkov ID Robinson JT Sanborn AL Machol I Omer AD Lander ES Aiden EL 2014 A 3D map of the human genome at kilobase resolution reveals principles of chromatin looping Cell 159 1665 1680 10.1016/j.cell.2014.11.021 25497547 PMC5635824 Rao SSP Huang SC Glenn St Hilaire B Engreitz JM Perez EM Kieffer-Kwon KR Sanborn AL Johnstone SE Bascom GD Bochkov ID Huang X Shamim MS Shin J Turner D Ye Z Omer AD Robinson JT Schlick T Bernstein BE Casellas R Lander ES Aiden EL 2017 Cohesin loss eliminates all loop domains Cell 171 305 320 10.1016/j.cell.2017.09.026 28985562 PMC5846482 Reddy KL Wong X 2025 An optimized adaptation of DamID for NGS applications Methods in Molecular Biology 2866 245 262 10.1007/978-1-0716-4192-7_14 39546207 Sanborn AL Rao SSP Huang SC Durand NC Huntley MH Jewett AI Bochkov ID Chinnappan D Cutkosky A Li J Geeting KP Gnirke A Melnikov A McKenna D Stamenova EK Lander ES Aiden EL 2015 Chromatin extrusion explains key features of loop and domain formation in wild-type and engineered genomes PNAS 112 E6456 E6465 10.1073/pnas.1518552112 26499245 PMC4664323 Satoh Y Yokota T Sudo T Kondo M Lai A Kincade PW Kouro T Iida R Kokame K Miyata T Habuchi Y Matsui K Tanaka H Matsumura I Oritani K Kohwi-Shigematsu T Kanakura Y 2013 The Satb1 protein directs hematopoietic stem cell differentiation toward lymphoid lineages Immunity 38 1105 1115 10.1016/j.immuni.2013.05.014 23791645 PMC3777575 Sauria M Luperchio T 2019 PyLAD 64a44b9 GitHub https://github.com/thereddylab/pyLAD Schoenfelder S Fraser P 2019 Long-range enhancer-promoter contacts in gene expression control Nature Reviews. Genetics 20 437 455 10.1038/s41576-019-0128-0 31086298 Schwarzer W Abdennur N Goloborodko A Pekowska A Fudenberg G Loe-Mie Y Fonseca NA Huber W Haering CH Mirny L Spitz F 2017 Two independent modes of chromatin organization revealed by cohesin removal Nature 551 51 56 10.1038/nature24281 29094699 PMC5687303 Sexton T Yaffe E Kenigsberg E Bantignies F Leblanc B Hoichman M Parrinello H Tanay A Cavalli G 2012 Three-dimensional folding and functional organization principles of the Drosophila Cell 148 458 472 10.1016/j.cell.2012.01.010 22265598 Skowronska-Krawczyk D Ma Q Schwartz M Scully K Li W Liu Z Taylor H Tollkuhn J Ohgi KA Notani D Kohwi Y Kohwi-Shigematsu T Rosenfeld MG 2014 Required enhancer-matrin-3 network interactions for a homeodomain transcription program Nature 514 257 261 10.1038/nature13573 25119036 PMC4358797 Solovei I Kreysing M Lanctôt C Kösem S Peichl L Cremer T Guck J Joffe B 2009 Nuclear architecture of rod photoreceptor cells adapts to vision in mammalian evolution Cell 137 356 368 10.1016/j.cell.2009.01.052 19379699 Song P Gao Z Bao Y Chen L Huang Y Liu Y Dong Q Wei X 2024 Wnt/β-catenin signaling pathway in carcinogenesis and cancer therapy Journal of Hematology & Oncology 17 46 10.1186/s13045-024-01563-4 38886806 PMC11184729 Stephen TL Payne KK Chaurio RA Allegrezza MJ Zhu H Perez-Sanz J Perales-Puchalt A Nguyen JM Vara-Ailor AE Eruslanov EB Borowsky ME Zhang R Laufer TM Conejo-Garcia JR 2017 SATB1 expression governs epigenetic repression of PD-1 in tumor-reactive T Cells Immunity 46 51 64 10.1016/j.immuni.2016.12.015 28099864 PMC5336605 Summer H Grämer R Dröge P 2009 Denaturing urea polyacrylamide gel electrophoresis (Urea PAGE) Journal of Visualized Experiments 1 1485 10.3791/1485 19865070 PMC3329804 Tanaka Y Sotome T Inoue A Mukozu T Kuwabara T Mikami T Kowhi-Shigematsu T Kondo M 2017 SATB1 conditional knockout results in sjögren’s syndrome in mice Journal of Immunology 199 4016 4022 10.4049/jimmunol.1700550 29127143 Teytelman L Thurtle DM Rine J van Oudenaarden A 2013 Highly expressed loci are vulnerable to misleading ChIP localization of multiple unrelated proteins PNAS 110 18602 18607 10.1073/pnas.1316064110 24173036 PMC3831989 Thakur J Henikoff S 2020 Architectural RNA in chromatin organization Biochemical Society Transactions 48 1967 1978 10.1042/BST20191226 32897323 PMC7609026 Tsirigos A Haiminen N Bilal E Utro F 2012 GenomicTools: a computational platform for developing high-throughput analytics in genomics Bioinformatics 28 282 283 10.1093/bioinformatics/btr646 22113082 van Steensel B Delrow J Henikoff S 2001 Chromatin profiling using targeted DNA adenine methyltransferase Nature Genetics 27 304 308 10.1038/85871 11242113 van Steensel B Belmont AS 2017 Lamina-associated domains: links with chromosome architecture, heterochromatin, and gene repression Cell 169 780 791 10.1016/j.cell.2017.04.022 28525751 PMC5532494 Vogel MJ Peric-Hupkes D van Steensel B 2007 Detection of in vivo protein-DNA interactions using DamID in mammalian cells Nature Protocols 2 1467 1478 10.1038/nprot.2007.148 17545983 Wang Z Yang X Guo S Yang Y Su XC Shen Y Long J 2014 Crystal structure of the ubiquitin-like domain-CUT repeat-like tandem of special AT-rich sequence binding protein 1 (SATB1) reveals a coordinating DNA-binding mechanism The Journal of Biological Chemistry 289 27376 27385 10.1074/jbc.M114.562314 25124042 PMC4183778 Wang B Ji L Bian Q 2023 SATB1 regulates 3D genome architecture in T cells by constraining chromatin interactions surrounding CTCF-binding sites Cell Reports 42 112323 10.1016/j.celrep.2023.112323 37000624 Watson LA Tsai LH 2017 In the loop: how chromatin topology links genome structure to function in mechanisms underlying learning and memory Current Opinion in Neurobiology 43 48 55 10.1016/j.conb.2016.12.002 28024185 PMC5447486 Wen B Wu H Loh YH Briem E Daley GQ Feinberg AP 2012 Euchromatin islands in large heterochromatin domains are enriched for CTCF binding and differentially DNA-methylated regions BMC Genomics 13 566 10.1186/1471-2164-13-566 23102236 PMC3507770 Wijchers PJ Krijger PHL Geeven G Zhu Y Denker A Verstegen MJAM Valdes-Quezada C Vermeulen C Janssen M Teunissen H Anink-Groenen LCM Verschure PJ de Laat W 2016 Cause and consequence of tethering a SubTAD to different nuclear compartments Molecular Cell 61 461 473 10.1016/j.molcel.2016.01.001 26833089 PMC4747903 Wong X Luperchio TR Reddy KL 2014 NET gains and losses: the role of changing nuclear envelope proteomes in genome regulation Current Opinion in Cell Biology 28 105 120 10.1016/j.ceb.2014.04.005 24886773 Wong X Hoskins VE Melendez-Perez AJ Harr JC Gordon M Reddy KL 2021 Lamin C is required to establish genome organization after mitosis Genome Biology 22 305 10.1186/s13059-021-02516-7 34775987 PMC8591896 Wutz G Várnai C Nagasaka K Cisneros DA Stocsits RR Tang W Schoenfelder S Jessberger G Muhar M Hossain MJ Walther N Koch B Kueblbeck M Ellenberg J Zuber J Fraser P Peters J-M 2017 Topologically associating domains and chromatin loops depend on cohesin and are regulated by CTCF, WAPL, and PDS5 proteins The EMBO Journal 36 3573 3599 10.15252/embj.201798004 29217591 PMC5730888 Yannoutsos N Barreto V Misulovin Z Gazumyan A Yu W Rajewsky N Peixoto BR Eisenreich T Nussenzweig MC 2004 A cis element in the recombination activating gene locus regulates gene expression by counteracting a distant silencer Nature Immunology 5 443 450 10.1038/ni1053 15021880 Yasuda K Kitagawa Y Kawakami R Isaka Y Watanabe H Kondoh G Kohwi-Shigematsu T Sakaguchi S Hirota K 2019 Satb1 regulates the effector program of encephalitogenic tissue Th17 cells in chronic inflammation Nature Communications 10 549 10.1038/s41467-019-08404-w 30710091 PMC6358604 Yasui D Miyano M Cai S Varga-Weisz P Kohwi-Shigematsu T 2002 SATB1 targets chromatin remodelling to regulate genes over long distances Nature 419 641 645 10.1038/nature01084 12374985 Zelenka T Klonizakis A Tsoukatou D Papamatheakis DA Franzenburg S Tzerpos P Tzonevrakis IR Papadogkonas G Kapsetaki M Nikolaou C Plewczynski D Spilianakis C 2022 The 3D enhancer network of the developing T cell genome is shaped by SATB1 Nature Communications 13 6954 10.1038/s41467-022-34345-y 36376298 PMC9663569 Zhan T Rindtorff N Boutros M 2017 Wnt signaling in cancer Oncogene 36 1461 1473 10.1038/onc.2016.304 27617575 PMC5357762 Zhang Y Liu T Meyer CA Eeckhoute J Johnson DS Bernstein BE Nusbaum C Myers RM Brown M Li W Liu XS 2008 Model-based analysis of chIP-Seq (MACS) Genome Biology 9 R137 10.1186/gb-2008-9-9-r137 18798982 PMC2592715 Zhang Y Zheng L Le M Nakano Y Chan B Huang Y Torbaty PM Kohwi Y Marcucio R Habelitz S Den Besten PK Kohwi-Shigematsu T 2019 SATB1 establishes ameloblast cell polarity and regulates directional amelogenin secretion for enamel formation BMC Biology 17 104 10.1186/s12915-019-0722-9 31830989 PMC6909472 Zhao H Sifakis EG Sumida N Millán-Ariño L Scholz BA Svensson JP Chen X Ronnegren AL Mallet de Lima CD Varnoosfaderani FS Shi C Loseva O Yammine S Israelsson M Rathje L-S Németi B Fredlund E Helleday T Imreh MP Göndör A 2015 PARP1- and CTCF-Mediated interactions between active and repressed chromatin at the lamina promote oscillating transcription Molecular Cell 59 984 997 10.1016/j.molcel.2015.07.019 26321255 Zullo JM Demarco IA Piqué-Regi R Gaffney DJ Epstein CB Spooner CJ Luperchio TR Bernstein BE Pritchard JK Reddy KL Singh H 2012 DNA sequence-dependent compartmentalization and silencing of chromatin at the nuclear lamina Cell 149 1474 1487 10.1016/j.cell.2012.04.035 22726435 10.7554/eLife.105915.3.sa0 eLife Assessment Hauf Silke Reviewing Editor  Virginia Tech United States Compelling Important This is a very important compelling 10.7554/eLife.105915.3.sa1 Reviewer #1 (Public review): Reviewer Summary: The nuclear protein SATB1 was originally identified as a protein of the 'nuclear matrix', an aggregate of nuclear components that arose upon extracting nuclei with high salt. While the protein was assumed to have a global function in chromatin organization, it has subsequently been linked to a variety of pathological conditions, notably cancer. The mapping of the factor by conventional ChIP procedures showed strong enrichment in active, accessible chromatin, suggesting a direct role in gene regulation, perhaps in enhancer-promoter communication. These findings did not explain why SATB1-chromatin interaction resisted the 2 M salt extraction during early biochemical fractionation of nuclei. The authors, who have studied SATB1 for many years, now developed an unusual variation of the ChIP procedure, in which they purify crosslinked chromatin by centrifugation through 8 M urea. Remarkably, while they lose all previously mapped signals for SATB1 in active chromatin, they now gain many binding events in silent regions of the genome, represented by lamin-associated domains (LADs). SATB1 had previously been shown by the authors and others to bind to DNA with special properties, termed BUR for 'base-unpairing regions'. BURs are AT-rich and apparently enriched in equally AT-rich LADs. The 'urea-ChIP' pattern is essentially complementary to the classical ChIP pattern. The authors now speculate that the previously known SATB1 binding pattern determined by standard ChIP, which does not overlap BURs particularly well, is due to indirect chromatin binding, whereas they consider the urea-ChIP profile, which fits better to the BUR distribution on the chromosome, to be due to direct binding. Building on the success with urea-ChIP the authors adapted the 4C-procedure of chromosome conformation mapping to work with urea-purified chromatin. The data suggest a model according to which BUR-bound SATB1 mediates long-distance interaction between active loci and some kind of scaffold structure formed by SATB1. Because cell type-specific differences are observed, they suggest that the SATB1 interactions are functionally relevant. Strengths: Given the unusual findings of essentially mutually exclusive 'standard ChIP' and 'urea-ChIP' profiles, the authors conducted many appropriate controls. They showed that all SATB1 peaks in urea-ChIP and 96% of peaks in standard-ChIP represent true signals, as they are not observed in a SATB1 knockout cell line. They also show that the urea-ChIP and standard ChIP yield similar profiles for CTCF and polycomb complex subunits. The data appear reproducible judged by at least two replicates and triangulation. The SATB1 KO cells provide a nice control for the specificity of signals, including those that arise from their elaborately modified 4C protocol. In their revised manuscript the authors provide relevant background information concerning the effect of urea on the denaturation of macromolecules. Importantly, they argue convincingly that urea does not denature DNA under their conditions. Weaknesses: Despite the authors' efforts to explain their findings along with a lot of background information, some readers may be left confused due to the complexity of the system. BURs are found enriched in LADs, but are also present in active chromatin. SATB1 binds a subset of BURs, but the reason for discrimination remains unclear. SATB1 appears to bind chromatin in at least two modes with differing diffusion properties and exactly how this relates to the indirect and direct chromatin binding modes is mechanistically unclear. The authors resort to the term 'SATB1-enriched subnuclear structure' to describe the profile gained through denaturing ChIP, thus avoiding strong statements about involvement of known nuclear structures (such as LADs or heterochromatin) and about functional implications. The authors acknowledge a potential for RNA to be involved in modulating SATB1 interactions with chromatin, but leave this for future investigation. Comment on revised version: The authors revised their manuscript to my satisfaction. 10.7554/eLife.105915.3.sa2 Reviewer #2 (Public review): Reviewer Summary: This study describes the key observation that SATB1 binds directly to so-called BUR elements. This is in contrast to several other reports describing SATB1 binding to promoters and enhancers. This discrepancy is explained by the authors to depend on the features of the ChIP technique being used. Urea-ChIP, innovated by the authors, strips off protein-protein interactions that compound conventional ChIP methods. The authors convincingly make the case that SATB1 and a key genome organiser, CTCF, largely bind different sites, as particularly evident in Figure 2A. In contrast, standard ChIP shows considerable overlap between their sites (Figure 2-figure supplement 1). The report documents convincingly that SATB1 partitions the genome independent of so-called TADs to influence expression patterns. SATB1 controls long-range interactions in thymocytes, and knock down of SATB1 does not affect the TAD patterns. Strengths: A new and innovative adaptation of ChIP-seq (urea ChIP-seq) has enabled the authors to successfully question existing data on the patterns of SATB1 binding to the genome. The authors provide a wealth of data to reinforce their claims. This report thus rectifies misconceptions about SATB1 function, which is particularly important given its role in metastasising cancer cells. Weaknesses: None 10.7554/eLife.105915.3.sa3 Author response Kohwi-Shigematsu Terumi Author  University of California, San Francisco San Francisco United States Kohwi Yoshinori Author  University of California, San Francisco San Francisco United States Wong Xianrong Author  Johns Hopkins University Baltimore United States Grange Mari Author  University of California, San Francisco San Francisco United States Sexton Thomas Author  IGBMC (Institute of Genetics and Molecular and Cellular Biology) Illkirch France Richards Hunter W Author  University of California, San Francisco San Francisco United States Kitagawa Yohko Author  Osaka University Osaka Japan Sakaguchi Shimon Author  The University of Osaka Osaka Japan Liang Ya-Chen Author  University of Southern California Los Angeles United States Chuong Cheng-Ming Author  University of Southern California Los Angeles United States Botchkarev Vladimir Author  Boston University School of Medicine Boston United States Taniuchi Ichiro Author  RIKEN Center for Integrative Medical Sciences Yokohama Japan Reddy Karen L Author  The Johns Hopkins University School of Medicine Baltimore United States The following is the authors’ response to the original reviews  Reviewer #1: (1) 8 molar urea not only denatures proteins but also denatures DNA. Obviously, this does not affect the ChIP, since antibodies often recognize small linear epitopes and the proteins are crosslinked. However, under high urea conditions the BUR elements should be rendered single-stranded, and one wonders whether this has any effect on the procedure. The authors should alert the reader of these circumstances. Thank you for raising this important question about the effects of 8M urea. We have added a brief paragraph explaining this point in the revised manuscript. Despite common misconceptions, 8M urea by itself does not actively convert double-stranded DNA to single-stranded DNA. For this conversion to occur, a heat denaturation step is required. Once DNA is heat-denatured to become single-stranded, urea can maintain this configuration. This is why the addition of 8M urea to acrylamide gel electrophoresis is a standard method for analyzing single-stranded oligonucleotides, but the DNA must first be denatured by heat (Summer et al., J. Vis. Exp. (32), e1485, DOI : 10.3791/1485). This is clearly described in published work comparing the status of DNA with and without heat treatment in an 8M urea-containing buffer Hegedus et al., Nucl.Acids Res. 2009 (doi:10.1093/nar/gkp539). We have additional evidence supporting this conclusion in the context of our urea ultracentrifugation experiment. Both crosslinked and un-crosslinked genomic DNA purified by 8M urea centrifugation can be digested with restriction enzymes, which indicates that the DNA remains double-stranded. For instance, we previously published SATB1 ChIP-3C results using Sau3A-digested DNA after urea purification. In the current paper, we used Hind vitro We have now added a sentence noting that SATB1 is a double-stranded DNA-binding protein that does not bind to single-stranded DNA, as we have previously shown (Dickinson et al., 1992, Ref 32). (2) An important conclusion is that urea-ChIP reveals direct DNA binding events, whereas standard ChIP shows indirect binding (which is stripped off by urea). I do not see any evidence for direct binding. At low resolution, predicted BUR elements are enriched in domains where SATB-1 is mapped by urea-ChIP. A statement like 'In a zoomed-in view, covering a 430 kb region, SATB1 sites identified from urea ChIP-seq precisely coincided with BUR peaks' is certainly not correct: most BUR peaks do not show significant SATB-1 binding. The randomly chosen regions shown in Figure 4 – Supplement 1 show how poor the overlap of SATB-1 and BURs is; indeed, they show that SATB-1 binds DNA mostly at non-BUR sites. I see Figure 2D, but such cumulative plots can be highly biased by very few cases. I suggest showing these data in heat maps instead. We believe there may be some confusion regarding the interpretation of our figures. Looking at Track 3 (BUR reference map, RED peaks) and urea SATB1 Tracks 4 and 5 (replicas from two independent experiments) in Figure 2B, the SATB1 peaks detected by urea ChIP-seq do indeed coincide with BUR peaks. In the revised manuscript, we have provided a further ‘zoomed-in’ view to better illustrate this point and also provided the underlying BUR sequence from one of these SATB1-bound regions (Figure 2—supplement figure 1). It is true that many more BURs exist than SATB1-bound BURs, especially in gene-poor regions where BURs are clustered. However, from the perspective of SATB1-bound peaks, the majority of these coincide with BURs, as shown by both deepTools analyses and new heatmap, as suggested (Figure 2E, and Figure 7—supplement figure 3). The results from our genome-wide quantitative analyses using deepTools to compare peaks from urea SATB1 ChIP-seq data and the BUR reference map shown in Supplementary Tables 1 and 2 are consistent with the heatmap analyses. We must apologize for an error in the scaling of the y-axis in Figure 4-supplement figure 1 that likely contributed to some confusion. We have corrected our mistake in the revised manuscript. As we were preparing our figures, when placed in the figure and axes relabeled for legibility, the BUR reference peaks were mislabeled on their y-axis. In the figure the peaks were erroneously labeled on a scale of 0.1-1 read counts/million reads, but the data shown is actually scaled at 0.1 to 2 read counts per million reads. Unfortunately, we did not realize this error and, using the figure as a guide for scaling, provided urea SATB1 ChIP-seq peaks at a scale of 0.1-1 read counts/million reads to match the mislabeled BUR reference track. This had the effect of reducing the signal/noise in the SATB1 ChIP-seq data (Figure 1). We have now standardized the y-axis for fair comparison using a scaling of the y-axis at 0.1-2 for all tracks. This will more clearly show that there are indeed more BUR peaks than SATB1-bound sites, consistent with our quantitative analysis. We hope that these clarifications as well as the added heatmaps and binding site example allay the concerns about the specificity and overlap of SATB1 binding on BURS. (3) In Figure 6C 'peaks' are compared. However, looking at Figure 4 - Supplement 1 again it is clear that peak calling can yield a misleading impression. Figure 6D suggests that there are more BURs than SATB-1 peaks but this is not true from looking at the browser. We thank the reviewer for this observation. As noted in our response to point 2 above, the inconsistent y-axis scaling in Figure 4-supplement figure 1 created a misleading impression, which we have corrected in the revised manuscript. When properly displayed with consistent y-axis scaling, the browser view aligns with our quantitative data showing that there are indeed many more BURs than SATB1-bound sites. As mentioned under 2 above, we have performed genome-wide quantitative analysis by deepTools (Supplementary Tables 1 and 2) to confirm the results shown by bar graphs in Fig. 6C, 6D and Fig. 2D. In Figure 6C, the bars show the percentage of SATB1-bound peaks in each cell type (denominator) that overlap with confirmed BUR sites in the BUR reference map (numerator). In Figure 6D, we show the percentage of total BUR sites in the BUR reference map (denominator) that are bound by SATB1 from urea ChIP-seq (numerator). To avoid any confusion, we have added brief subtitles to Figures 6C and 6D in the revised manuscript. (4) An important conclusion is that urea-ChIP reveals direct DNA binding events, whereas standard ChIP shows indirect binding (which is stripped off by urea). I do not yet see any evidence for direct binding. It cannot be excluded that the binding is RNA-mediated. The authors mention in passing that urea-ChIP material still contains (specific!) RNA. Given that this is a new procedure, the authors should document the RNA content of urea-ChIP and RNase-treat their samples prior to ChIP to monitor an RNA contribution. Thank you for raising this important point. The direct binding of SATB1 to BURs is well-established in our previous work. Indeed, this was the main motivation to explore the reason for the lack of evidence for genome-wide SATB1 binding to BURs in the DNA-binding profile by standard ChIP-seq. This has been a major point of confusion for us for many years. SATB1 was originally identified through a search for mammalian proteins that could recognize BURs specifically and not just any A+T-rich sequence. The Satb1 We do agree with the reviewer, however, that there is a possibility that RNA can redirect SATB1 to different subsets of BURs and/or to interact indirectly with different regulatory regions depending on cell type or developmental stage. Although urea ultracentrifugation clearly separates most RNA (found in the middle region of the tube) from genomic DNA (pelleted at the bottom) (de Belle et al., 1998), upon crosslinking cells, a small quantity of RNA is found co-pelleted with DNA (our recent unpublished results). This RNA, tightly associated with crosslinked chromatin, may have some impact on SATB1 function. Based on our preliminary data, we are currently planning to study the impact of RNA using RNase A as well as by targeting specific RNAs employing an anti-sense approach. We believe that thoroughly addressing the impact of RNA warrants a full paper, including the potential roles of specific non-coding RNAs in SATB1 function, and thus is beyond the scope of the current paper. However, we have now added discussion of this important point in the manuscript. (5) An important aspect of the model is that SATB1 tethers active genes to inactive LADs. However, in the 4C experiment the BUR elements used to anchor the looping are both in the accessible, active chromatin domain. If the authors want to maintain their statement, they must show a 4C result that connects the 2 distinct domains and transverses A/B domain boundaries. Currently, the data only show a looping within accessible chromatin. We appreciate REVIEWER 1 for bringing up the important point that our model could potentially be interpreted as “SATB1 tethers active genes to inactive LADs.” Since we describe that BURs are enriched in LADs and that SATB1 binds a subset of BURs, readers may assume that we aim to demonstrate, through urea 4C-seq, that SATB1 tethers active genes to transcriptionally-inactive LADs (via BURs). However, this is not our intention in the model (Figure 8). In the experiment we designed for our present study, we selected BUR-1 and BUR-2 as viewpoints from a non-LAD gene-rich region (inter-LAD). Because these BURs are bound by SATB1, it indicates that these BURs are part of the “hard-to-access” SATB1-rich subnuclear structure, which resists extraction, in contrast to accessible chromatin. Thus, we illustrate in the model that BURs anchored to the SATB1-rich nuclear substructure make contact with accessible chromatin over long distances in a SATB1-dependent manner. Therefore, we do not intend to conclude that SATB1 mediates interactions between LADs and inter-LADs (accessible chromatin) from our current study: this would be a topic for future research. In the original model in the submitted manuscript, we used the terms “inaccessible” and “accessible.” In the revised version, we clarified this in the model by changing “inaccessible” to “SATB1-rich subnuclear structure” and carefully revised the text in the Figure 8 legend to clarify the model. At this time, we do not know exactly how LADs and SATB1 nuclear architecture are related spatially and functionally. While LADs are mapped as genomic domains in proximity to Lamin B1 by LaminB1-DamID, BURs are mapped at ~300-500 bp resolution by urea ChIP-seq. To gain further insight into this important question, a large body of DNA-FISH and immunoDNA-FISH experiments will be required, comparing different cell types to see whether and how specific BURs move between LADs and SATB1 nuclear architecture. Such experiments may benefit from testing the Gabrg1 and Gabra2 loci, where many BURs are anchored to SATB1 in neurons but not in thymocytes, for instance. This is included in Discussion in the revised manuscript. Regarding the reviewer's second point about showing more extended domains for 4C interactions, we would like to highlight that Figure 5—supplement figure 3 in our submitted manuscript addresses this concern. This figure shows that BUR-interactions extend to multiple gene-rich regions across intervening gene-poor regions. Interestingly, BUR-1 and BUR-2 interactions skip a transcriptionally silent gene-rich region containing olfactory receptor genes but interact with subsequent gene-rich regions containing active genes. These data demonstrate that BUR-interactions do indeed traverse A- and B-compartment boundaries. In the revised manuscript (in Figure 5—supplement figure 3), we newly added a Lamin B1-DamID (thymocyte) track. Comparing with LADs, BUR-1 interactions occur mostly in non-LAD regions. Some minor overlap with LADs was detected in high resolution views (not shown). Future experiments testing BUR viewpoints that reside within LADs are required to assess whether SATB1 mediates interactions between B and A compartments. (6) The description of the urea-co-immunoprecipitation experiment (Figure 3C) could be improved to make it unequivocally clear that co-binding to chromatin is tested, not protein-protein interaction (which is destroyed by urea). Thank you for this helpful suggestion. We have revised the text in the manuscript by stating “Distinct from protein-protein co-immunoprecipitation (co-IP) using whole cell or nuclear extracts, we examined the direct co-binding status on chromatin in vivo of SATB1 and CTCF or cohesin by urea ChIP-Western” .  Reviewer #2: (1) Since SATB1 has been described to interact with beta-catenin, I wonder if the authors have looked at TCF4/TCF7l2 binding patterns and their potential overlap with SATB1 binding patterns. This might appear a trivial request. However, uncontrolled WNT signalling is a major feature of cancer undergoing metastasis - a process that the authors have earlier associated with unscheduled SATB1 expression in triple-negative breast cancer. We thank the reviewer for highlighting this important point about the potential relationship between SATB1 and TCF4/TCF7l2 binding patterns. Based on published observations with other factors (Rad21, CTCF, BRG1, RUNX) that show substantial overlap with SATB1 in standard ChIP-seq peaks(Kakugawa et al., Cell Rep 19, 1176-1188 (2017). DOI: 10.1016/j.celrep.2017.04.038. Poterlowicz et al., PLoS Genet, 2017 DOI: 10.1371/journal.pgen.1006966), we would anticipate that TCF4 might also show significant overlap with SATB1. An important question is whether the DNA binding profile of TCF4 depends on SATB1. We have not yet generated ChIP-seq data for TCF4 in the presence and absence of SATB1, but we agree that such experiments could provide important insights into cancer progression as well as brain function. This represents an interesting direction for future work. We have added this point in our discussion based on your kind suggestion. (2) The CTCF sizes indicated in the western blot analyses of Figures 3C and Figure 3 - supplement figure 2 do not display the normal size, which is around 130 kDa. Either the issue is erroneous marking or a so-called salt effect to slow the migration in the gel. Alternatively, it reflects a slower migrating form of CTCF generated by for example PARylation (by PARP1) that is known to approach 180 kDa. It would be useful if the authors could clarify this minor issue. We appreciate the reviewer pointing out this discrepancy. As the reviewer correctly noted, CTCF can appear at a higher molecular weight due to post-translational modifications such as PARylation and O-GlcNAcylation, which alter its migration during electrophoresis. Upon re-examination of our raw data for Figure 3—supplement figure 2A, we discovered that the marker lane for the CTCF panel was broken, and the 150kDa band was erroneously assigned. This led to the 150kDa marker being placed below the CTCF migration position, which is clearly an error. We thank the reviewer for bringing this to our attention. We have checked our other data and consistently observe CTCF migrating below the 150kDa band, similar to the pattern shown on the Abcam website for the antibody we used (ab128873) (Figure 2). For Figure 3-supplement figure 2, we will use a marker lane from a parallel gel with identical composition and run time to correctly indicate the molecular weight. We havealso corrected the marker position in Figure 3C.  Reviewing Editor (Recommendations for the authors): (1) The introduction states that urea ChIP-seq is \"unbiased\", which is difficult to unambiguously determine and therefore might be an overstatement. Maybe the authors could consider rephrasing. We agree with the reviewer's assessment and have rephrased our description of the urea ChIP-seq method to avoid using the term \"unbiased.\" (2) The authors propose that in standard ChIP, most SATB1 is in the insoluble fraction. This seems easy to test and demonstrating it may help to further clarify the differences between the protocols. We appreciate this suggestion and would like to clarify our description. What we stated in the manuscript was: \"We envision that SATB1 bound to inaccessible nuclear regions may be lost in the insoluble fraction.\" This refers specifically to a subpopulation of SATB1 that is bound to the high-salt extraction-resistant nuclear substructure, not to the total SATB1 protein. We also noted elsewhere in the manuscript that: \"SATB1 proteins are found in high salt-resistant fraction as well as salt-extracted fraction (40). Thus, it is possible that soluble SATB1 may associate with open chromatin.\" Our unpublished results show that SATB1 proteins exist in at least two distinct forms based on protein mobility: SATB1 with high mobility and another with very low or no mobility. While we have identified the SATB1 domain responsible for each of these distinct mobility patterns, we have not yet identified biochemical differences that would allow us to distinguish them conclusively. Therefore, an experiment to test the distribution of SATB1 in soluble versus insoluble fractions would show SATB1 in both fractions but would not necessarily provide information about the functional significance of these different populations. We believe this is an important area for future research and are working to develop tools to specifically distinguish and characterize SATB1 in the soluble versus insoluble fractions. ",
  "metadata": {
    "Title of this paper": "Author response",
    "Journal it was published in:": "eLife",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12490858/"
  }
}