{
  "title": "Paper_715",
  "abstract": "pmc Int J Womens Health Int J Womens Health 1312 intjwh ijwh International Journal of Women's Health 1179-1411 Dove Press PMC12478218 PMC12478218.1 12478218 12478218 41031332 10.2147/IJWH.S529541 529541 1 Original Research Global Mapping and Visualization Analysis of Almost Five Decades of Egg Freezing Research: Trends, Hotspots and Prospects Peng et al Peng et al Peng Xiandong 1 Sun Hongxia 1 Chen Jiazhou 1 1 Obstetrics & Gynecology Hospital of Fudan University, Shanghai JIAI Genetics & IVF Institute Shanghai 200011 People’s Republic of China Correspondence: Jiazhou Chen, Obstetrics & Gynecology Hospital of Fudan University, Shanghai JIAI Genetics & IVF Institute Shanghai 200011 People’s Republic of China Tel +86-13636346092 25 9 2025 2025 17 479209 3241 3257 20 3 2025 20 9 2025 25 09 2025 30 09 2025 01 10 2025 © 2025 Peng et al. 2025 Peng et al. https://creativecommons.org/licenses/by-nc/4.0/ This work is published and licensed by Dove Medical Press Limited. The full terms of this license are available at https://www.dovepress.com/terms.php http://creativecommons.org/licenses/by-nc/4.0/ https://www.dovepress.com/terms.php Background Egg freezing, also known as oocyte cryopreservation, has become an increasingly significant topic in reproductive medicine. A large number of articles have been published on egg freezing; however, there is still a lack of studies that use visualization methods for bibliometric analysis of relevant literature. This study aimed to explore the publication landscape and identify key trends, influential authors, institutions, and emerging topics in egg freezing research using bibliometric analysis. Methods Publications related to egg freezing from 1979 to 2024 were retrieved from the Web of Science Core Collection. A bibliometric analysis was conducted using Excel 365, VOSviewer (version 1.6.20), CiteSpace (version 6.3.R1), and R 4.3.3 to map co-authorship networks, institutional collaborations, and keyword co-occurrence patterns. Results A total of 1072 publications were identified, with an annual growth rate of 9.68%. The research was contributed by 4392 authors and originated from 1380 institutions in 59 countries. The United States leads with 337 publications accounting for 31.4%, followed by Italy and China. The Royal Women’s Hospital in Australia was prominent institutional contributors. Oktay Kutluk. ranks first with 18 articles published and a 18 H-index. The leading journals included Fertility and Sterility, Reproductive Biomedicine Online Human Reproduction Conclusion This bibliometric analysis provides valuable insights into the global trends and research hotspots in egg freezing. The research highlights a growing focus on the technological aspects of egg freezing. Moving forward, researchers should focus on the social aspects of egg freezing, such as public education and awareness regarding egg freezing options. Keywords egg freezing bibliometrics VOSviewer citespace trends funds The authors declare that no funds, grants, or other support were received during the preparation of this manuscript. pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement no pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes Introduction In recent years, a notable trend has emerged among women delaying childbearing, with the average age of first childbirth now surpassing 30 in numerous countries. 1 2 3 4 5 6 7 8 Despite the advantages associated with egg freezing, evidence concerning the outcomes for live-born children remains limited, and the risks linked to in vitro fertilization and later-life pregnancies are well-documented. 9 10 11 12 The increasing interest in egg freezing has stimulated a growing body of research across various domains, including reproductive medicine, ethics, and social sciences. 13–16 17 18 Materials and Methods Search Strategies and Data Sources A comprehensive literature search was conducted using the Web of Science Core Collection (WoSCC) database. 19 Figure 1 Figure 1 Literature search and screening flowchart. Data Analysis and Visualization For the bibliometric analysis and data visualization, we utilized three tools: VOSviewer (version 1.6.20), CiteSpace (version 6.3.R1), and R 4.3.3. VOSviewer was used to map co-authorship networks, institutional collaborations, co-citation relationships, and keyword co-occurrence patterns, providing a comprehensive view of the collaborative and citation structures within the field of egg freezing research. To further understand emerging trends and research hotspots, we conducted keyword burst detection by CiteSpace, which was used to visualize and identify the keywords with the strongest citation bursts in this study. In the resulting visualizations, the size of each node represented the number of publications, the thickness of the connecting lines indicated the strength of the connections, and the colors corresponded to different time periods. R 4.3.3 was employed to conduct a bibliometric analysis and trend mapping, which facilitated the ranking of countries, institutions, and authors, as well as the creation of trend charts detailing publication volume and citation metrics over time. Impact factor (IF) is obtained from the latest version of Journal Citation Reports (JCR). H-index, a critical metric for evaluating the scientific contributions of researchers, was calculated for each author using data obtained from WoSCC, offering a predictive measure of their future scholarly achievements, 20 21 Results Overview of Publication Status A total 1796 studies identified using WOS database from 1979 to 2024 were screened. After exclusion of abstract, meeting, review, etc., 1,072 studies were ultimately selected for further analysis, contributed by 4392 authors, 297 journals, 1380 institutions and 59 countries/regions ( Figures 1 and 2A Figure 2 General information. ( A B Furthermore, the annual publication trend is shown in Figure 2B Analysis of the Contributions of Countries The bibliometric analysis indicates that the publications originated from 59 different countries and regions. The United States leads with 337 publications accounting for 31.4%, followed by Italy (112, 10.4%), China (71, 6.6%), United Kingdom (64, 6%) and Australia (50, 4.7%). The remaining countries/regions have fewer than 50 publications ( Figure 3A Table 1 Figure 3A Figure 3B Table 1 Publication and Citation Profiles of Leading Countries Country Articles Freq SCP MCP MCP_Ratio TP TP_Rank TC TC_Rank Average Citations USA 337 0.314 295 42 0.125 929 1 14,374 1 42.7 Italy 112 0.104 93 19 0.17 392 2 4816 2 43 China 71 0.066 59 12 0.169 217 3 1005 9 14.2 United Kingdom 64 0.06 57 7 0.109 177 6 1800 3 28.1 Australia 50 0.047 39 11 0.22 181 5 1559 6 31.2 Israel 42 0.039 31 11 0.262 153 7 879 11 20.9 France 41 0.038 31 10 0.244 192 4 1068 8 26 Belgium 40 0.037 27 13 0.325 116 9 1774 4 44.4 Canada 33 0.031 22 11 0.333 91 10 985 10 29.8 Japan 30 0.028 26 4 0.133 121 8 1236 7 41.2 Spain 25 0.023 21 4 0.16 59 13 1649 5 66 Germany 19 0.018 12 7 0.368 53 15 363 15 19.1 Korea 19 0.018 14 5 0.263 59 12 330 17 17.4 Netherlands 18 0.017 15 3 0.167 70 11 604 12 33.6 Turkey 16 0.015 10 6 0.375 48 16 264 18 16.5 Brazil 14 0.013 11 3 0.214 41 17 444 14 31.7 Iran 13 0.012 12 1 0.077 37 18 73 23 5.6 Denmark 12 0.011 10 2 0.167 34 19 209 19 17.4 Sweden 12 0.011 10 2 0.167 56 14 477 13 39.8 Switzerland 9 0.008 5 4 0.444 18 23 62 25 6.9 Notes Abbreviations Figure 3 Analysis of countries. ( A B Analysis of the Contributions of Institutions A total of 1,380 institutions were involved in research on egg freezing. To explore institutions’ contributions to egg freezing, the number of publications from various institutions was analyzed. The top 10 productive institutions were displayed in Figure 4A Figure 4 Analysis of institutions. ( A B To further investigate collaboration between institutions, a co-authorship analysis was conducted. Among the 208 institutions involved in international collaborations with a minimum of 3 articles, Royal Women’s Hospital has the highest number of collaborations with other countries (70), followed by Yale University (63) and University of Melbourne (57), reflecting a broad engagement across multiple countries and enhancing the exchange of knowledge and expertise. The collaboration network further highlights the central role of European and American institutions ( Figure 4B Analysis of the Contributions by High-Impact Authors A total of 4,392 authors participated in research on egg freezing. We ranked authors based on the H-index to identify high-impact researchers ( Table 2 Figure 5 Journal of Clinical Oncology Reproductive BioMedicine Online Lancet Fertility and Sterility Human Reproduction Open Table 2 Publication and Citation Profiles of High-Impact Authors Author h-Index g-Index m-Index PY_Start TP TP_Frac TP_Rank TC TC_Rank Oktay Kutluk 18 18 0.947 2006 18 6.37 1 3096 1 Noyes Nicole 13 17 0.813 2009 17 3.71 2 913 8 Chian Ri-Cheng 12 12 0.667 2007 12 2.82 4 594 9 Patrizio Pasquale 11 13 0.846 2012 13 2.53 3 428 10 Flamigni C 10 10 0.357 1997 10 1.65 7 1393 3 Cobo Ana 9 10 0.529 2008 10 1.85 7 1580 2 Goldman Kara N. 8 12 0.667 2013 12 2.48 4 342 12 Gracia Clarisa 8 8 0.5 2009 8 1.15 13 924 7 Nagy Zsolt Peter 8 8 0.471 2008 8 1.79 13 326 13 Porcu E 8 8 0.286 1997 8 2.04 13 1051 5 Tan Seang Lin 8 8 0.444 2007 8 1.71 13 323 14 Birenbaum-Carmeli Daphna 7 9 0.875 2017 9 2.73 10 145 20 Blakemore Jennifer K. 7 11 1.167 2019 11 2.59 6 156 18 Borini Andrea 7 9 0.412 2008 9 2.16 10 237 16 Fabbri R 7 7 0.25 1997 7 1.04 18 1001 6 Grifo James A. 7 10 0.438 2009 10 2.21 7 383 11 Inhorn Marcia C. 7 9 0.875 2017 9 2.06 10 149 19 Remohi Jose 7 8 0.412 2008 8 1.45 13 1356 4 Baldwin Kylie 6 7 0.6 2015 7 4.95 18 294 15 Chang Ching-Chien 6 6 0.353 2008 6 1.39 20 216 17 Notes Abbreviations Figure 5 Visualization map depicting the collaboration among different authors. Analysis of Contributions of Influential Journals Publications related to egg freezing were published in 297 journals. Among the most prominent journals, Fertility and Sterility Human Reproduction Reproductive Biomedicine Online Table 3 Figure 6A Figure 6B Fertility and Sterility Human Reproduction Reproductive Biomedicine Online Fertility and Sterility Reproductive Biomedicine Online Human Reproduction Table 3 Bibliometric Indicators of High-Impact Journals Journal H_Index IF 2023 JCR 2023 TP TP_Rank TC TC_Rank PY_Start Fertility and Sterility 50 6.6 1 100 2 7119 1 1997 Human Reproduction 45 6 1 98 3 5890 2 1992 Reproductive Biomedicine Online 33 3.7 1 78 4 2459 3 2004 Journal of Assisted Reproduction and Genetics 24 3.2 1 106 1 1173 4 1992 Cryobiology 17 2.3 2 28 5 1048 5 1998 Theriogenology 15 2.4 1 22 6 905 6 1992 Current Opinion in Obstetrics & Gynecology 11 2.2 2 13 11 188 24 1991 Seminars in Reproductive Medicine 11 1.9 3 16 8 134 33 2001 European Journal of Obstetrics & Gynecology and Reproductive Biology 9 2.1 2 17 7 235 18 2004 PLoS One 9 2.9 1 13 12 211 20 2008 Reproductive Biology and Endocrinology 9 4.2 1 15 10 210 21 2009 Acta Obstetricia Et Gynecologica Scandinavica 8 3.5 1 10 15 279 16 2016 Gynecological Endocrinology 8 2 2 12 13 120 35 2012 Molecular Reproduction and Development 8 2.7 2 9 19 483 11 1991 Biology of Reproduction 7 3.1 2 7 22 702 9 1998 Best Practice & Research Clinical Obstetrics & Gynaecology 6 3.9 1 7 21 63 72 2010 Frontiers in Endocrinology 6 3.9 2 10 16 101 41 2019 Human Fertility 6 2.1 2 15 9 146 30 2009 Cryoletters 5 1 3 11 14 66 68 2013 Journal of Medical Ethics 5 3.3 1 7 23 80 58 2012 Notes Abbreviations Figure 6 Visualization analysis of influential journals. ( A B Analysis of the Keywords Keyword co-occurrence analysis offers a detailed representation of the thematic scope within the field. The keyword co-occurrence network was performed in Figure 7A Figure 7 Analysis of keywords. ( A B Keyword co-occurrence analysis offers a detailed representation of the thematic scope within the field. Using VOSviewer, 151 keywords appeared more than 10 times were used to generate the time-overlay visualization map in Figure 7B In Figure 8 Figure 8 Top 20 keywords with the strongest citation bursts. Discussion This bibliometric analysis aimed to explore global trends and hotspots in the field of egg freezing by analyzing publications from 1979 to 2024. The key findings reveal significant growth in the number of publications, with the USA, Italy, and China leading in contributions, and journals like Fertility and Sterility Reproductive Biomedicine Online General Information: Authors, Countries, Institutions, and Journals A total of 4,392 authors contributed to this body of literature, underscoring significant collaboration across various disciplines. Notably, institutions from 59 countries and regions participated in this research, with the United States emerging as the leading contributor, accruing 14,374 citations. This reflects the nation’s prominent role in advancing research, likely attributable to its well-established fertility preservation programs and substantial funding. Key institutions, such as Assistance Publique Hôpitaux de Paris and Northwestern University, each made significant contributions through a considerable number of published articles. Analyzing the distribution of these publications and collaborations can assist researchers in identifying major research hubs and key institutions for future partnerships. Furthermore, Fertility and Sterility The analysis of authorship shows that certain individuals, such as Pasquale Patrizio and Nicole Noyes, have had substantial influence in this area, contributing both in terms of volume and citation impact. Identifying these leading contributors provides guidance for those looking to collaborate or understand seminal work in the field. Keyword Analysis and Research Focus Keywords provide a critical lens to uncover shifting research priorities and emerging themes. The co-occurrence network revealed three major clusters, each representing different dimensions of this field, including egg freezing technology, fertility preservation for young women scheduled for chemotherapy, and social recognition on egg freezing. Egg Freezing Technology (Red Cluster) This cluster, featuring keywords such as “vitrification”, “frozen”, and “1,2-propanediol”, reflected the rapid development of technology of egg freezing. Successful cryopreservation of living cells relies on pre-venting the formation of ice crystals that may cause cryodamage and minimising the toxic effects of exposure to cryoprotectant agents. 22 23 24 25 26 Fertility Preservation (Green Cluster) The green cluster included keywords like “childhood-cancer”, “pregnancy”, and “chemotherapy”. As 5-year survival rates of childhood cancer patients have continued to improve over the last few decades, with >80% of patients surviving into adulthood. 27 27 28 29 30 31 32 27 33 Social Recognition (Blue Cluster) This cluster highlighted social recognition on egg freezing, featuring keywords such as “intentions”, “knowledge”, and “attitudes”. With the advancement of the social economy and the popularization of education in developed countries, women’s ages at marriage and childbirth have been continuously delayed, 34 34 35 36 37 34 38 39 38 The reproductive window is narrower in women than in men due to significant decrease of women’s fertility after the mid-thirties, 40 38 41 Social survey found low knowledge level of egg freezing and overly optimistic views among some members of the general public regarding age-related fertility decline, 42 43 42 44 38 45 Taken together, improving technical safety and reducing the cost of egg freezing will be the focus of future technological development. Various forms of education for popular science knowledge on egg freezing is discussed to improve people’s awareness such that people can make informed fertility decisions. The keyword burst analysis highlights emerging trends and future directions in egg freezing research, as following: Meiotic Spindle The keyword “meiotic spindle” experienced a significant citation burst from 1991 to 2011, reflecting a period when preserving spindle integrity during oocyte freezing and thawing was a primary focus of research. 46 47 25 24 Fertilization From 1996 to 2010, research efforts largely concentrated on enhancing fertilization rates following the thawing of cryopreserved oocytes, as successful fertilization has been a key focus in assisted reproductive technologies. 48 24 49 38 50 Intracytoplasmic Sperm Injection (ICSI) ICSI is often paired with egg freezing, a combination that gained significant attention from 1997 to 2010 due to its role in improving fertilization outcomes, particularly in cases of male infertility. 51 52 53 Knowledge Since 2015, research has increasingly focused on public awareness and understanding of fertility preservation options, with particular attention to egg freezing. This growing interest highlights how women perceive and make decisions about egg freezing, motivated by both medical needs and social factors. 40 9 54 Limitations Despite its strengths, the analysis does have limitations. The inclusion of only one database limits the breadth of literature reviewed, potentially omitting important contributions found in other sources such as books or editorials. Additionally, while this analysis covers a wide range of publications, there may be emerging research topics that were not captured due to the evolving nature of keyword usage. Some emerging keywords may have been overlooked, as new terms might not yet have enough citations to appear prominently in the dataset. Conclusion This bibliometric study provides a comprehensive overview of the global trends and hotspots in egg freezing research from 1979 to 2024. The research highlights a growing focus on the technological aspects of egg freezing. Moving forward, researchers should focus on the social aspects of egg freezing, such as public education and awareness regarding egg freezing options. Abbreviations EEF, elective egg freezing; ASRM, American Society for Reproductive Medicine; SART, Society for Assisted Reproductive Technology; WoSCC, Web of Science Core Collection; IF, Impact factor; TC, total citations; ART, assisted reproductive technologies; ICSI, Intracytoplasmic sperm injection. Data Sharing Statement All data generated or analysed during this study are included in this published article. Author Contributions All authors made a significant contribution to the work reported, whether that is in the conception, study design, execution, acquisition of data, analysis and interpretation, or in all these areas; took part in drafting, revising or critically reviewing the article; gave final approval of the version to be published; have agreed on the journal to which the article has been submitted; and agree to be accountable for all aspects of the work. Disclosure The authors have no relevant financial or non-financial interests to disclose for this work. References 1. Sandhu S Hickey M Lew R The development and phase 1 evaluation of a decision aid for elective egg freezing BMC Med Inform Decis Mak 2023 23 1 83 10.1186/s12911-023-02178-4 37147687 PMC10161420 2. ACOG Committee opinion no. 584: oocyte cryopreservation Obstet Gynecol 2014 123 1 221 222 10.1097/01.AOG.0000441355.66434.6d 24463693 3. Inhorn MC Birenbaum-Carmeli D Patrizio P Medical and elective (Social) egg freezing: key insights from women’s perspectives Schenker JG Genazzani AR Sciarra JJ Mettler L Birkhaeuser MH Clinical Management of Infertility: Problems and Solutions Cham Springer International Publishing 2021 247 255 4. Bénard J Calvo J Comtet M Benoit A Sifer C Grynberg M Fertility preservation in women of the childbearing age: indications and strategies J Gynecol Obstet Biol Reprod 2016 45 5 424 444 10.1016/j.jgyn.2016.02.005 27021926 5. Chaput L Grémeau AS Vorilhon S Fertility preservation in oncology Bull Cancer 2018 105 1 99 110 29221621 10.1016/j.bulcan.2017.11.001 6. Harada M Osuga Y Fertility preservation for female cancer patients Int J Clin Oncol 2019 24 1 28 33 10.1007/s10147-018-1252-0 29502284 7. Rousset-Jablonski C Chevillon F Dhedin N Poirot C Fertility preservation in adolescents and young adults with cancer Bull Cancer 2016 103 12 1019 1034 10.1016/j.bulcan.2016.10.008 27817861 8. Ethics Committee of the American Society for Reproductive Medicine Planned oocyte cryopreservation to preserve future reproductive potential: an ethics committee opinion Fertil Steril 2024 121 4 604 612 10.1016/j.fertnstert.2023.12.030 38430080 9. Petropanagos A Cattapan A Baylis F Leader A Social egg freezing: risk, benefits and other considerations CMAJ 2015 187 9 666 669 10.1503/cmaj.141605 25869870 PMC4467930 10. Suthersan D Kennedy S Chapman M Physical symptoms throughout IVF cycles Human Fertility 2011 14 2 122 128 10.3109/14647273.2011.571748 21631247 11. Shmorgun D Claman P The diagnosis and management of ovarian hyperstimulation syndrome J Obstetrics Gynaecol CANADA 2011 33 11 1156 1162 10.1016/S1701-2163(16)35085-X 22082791 12. OOCYTE M Mature oocyte cryopreservation: a guideline Fertil Sterility 2013 99 1 37 43 10.1016/j.fertnstert.2012.09.028 23083924 13. Alteri A Pisaturo V Nogueira D D’Angelo A Elective egg freezing without medical indications Acta Obstet Gynecol Scand 2019 98 5 647 652 10.1111/aogs.13573 30758059 14. Lahoti U Pajai S Shegekar T Juganavar A Exploring the landscape of social egg freezing: navigating medical advancements, ethical dilemmas, and societal impacts Cureus 2023 15 10 e47956 10.7759/cureus.47956 38034211 PMC10685323 15. Pomeroy KO Comizzoli P Rushing JS Lersten IL Nel-Themaat L The ART of cryopreservation and its changing landscape Fertil Steril 2022 117 3 469 476 10.1016/j.fertnstert.2022.01.018 35219471 16. Szamatowicz M Assisted reproductive technology in reproductive medicine - possibilities and limitations Ginekol Pol 2016 87 12 820 823 10.5603/GP.2016.0095 28098933 17. Xiong X Gao X Zhong J Bibliometric analysis of research on temporomandibular joint and occlusion from 2000 to 2022 J Pain Res 2023 16 2847 2860 10.2147/JPR.S418362 37605745 PMC10440111 18. Wu F Gao J Kang J Knowledge mapping of exosomes in autoimmune diseases: a bibliometric analysis (2002-2021) Front Immunol 2022 13 939433 35935932 10.3389/fimmu.2022.939433 PMC9353180 19. Wu H Cheng K Guo Q Mapping knowledge structure and themes trends of osteoporosis in rheumatoid arthritis: a bibliometric analysis Front Med 2021 8 787228 10.3389/fmed.2021.787228 PMC8650090 34888333 20. Bertoli-Barsotti L Lando T A theoretical model of the relationship between the h-index and other simple citation indicators Scientometrics 2017 111 3 1415 1448 28596626 10.1007/s11192-017-2351-9 PMC5438441 21. Hirsch JE An index to quantify an individual’s scientific research output Proc Natl Acad Sci USA 2005 102 46 16569 16572 10.1073/pnas.0507655102 16275915 PMC1283832 22. Bolton VN Hayden C Robinson M Abdo D Pericleous-Smith A Human oocyte cryopreservation: revised evidence for practice Human Fertility 2023 26 1 2 16 10.1080/14647273.2023.2190987 36970984 23. Whaley D Damyar K Witek RP Mendoza A Alexander M Lakey JR Cryopreservation: an overview of principles and cell-specific considerations Cell Transpl 2021 30 963689721999617 10.1177/0963689721999617 PMC7995302 33757335 24. Casciani V Monseur B Cimadomo D Alvero R Rienzi L Oocyte and embryo cryopreservation in assisted reproductive technology: past achievements and current challenges Fertil Sterility 2023 120 3 506 520 10.1016/j.fertnstert.2023.06.005 37290552 25. Rienzi L Gracia C Maggiulli R Oocyte, embryo and blastocyst cryopreservation in ART: systematic review and meta-analysis comparing slow-freezing versus vitrification to produce evidence for the development of global guidance Human Reproduction Update 2017 23 2 139 155 10.1093/humupd/dmw038 27827818 PMC5850862 26. Najafzadeh V Bojsen-Møller Secher J Pihl M Vitrification yields higher cryo-survival rate than slow freezing in biopsied bovine in vitro produced blastocysts Theriogenology 2021 171 44 54 10.1016/j.theriogenology.2021.04.020 34023618 27. Li H Xiang W Feng HL Oocyte cryopreservation in women after childhood and adolescent cancer Fertil Sterility 2021 116 4 1096 1097 10.1016/j.fertnstert.2021.08.003 34489084 28. Rives N Courbière B Almont T What should be done in terms of fertility preservation for patients with cancer? The French 2021 guidelines Eur J Cancer 2022 173 146 166 35932626 10.1016/j.ejca.2022.05.013 29. Zhao P Guo C Du H Chemotherapy-induced ovarian damage and protective strategies Human Fertility 2023 26 4 887 900 10.1080/14647273.2023.2275764 38054300 30. Filippi F Meazza C Somigliana E Fertility preservation in childhood and adolescent female tumor survivors Fertil Sterility 2021 116 4 1087 1095 10.1016/j.fertnstert.2021.06.012 34238574 31. Anderson RA Amant F Braat D ESHRE guideline: female fertility preservation Hum Reprod Open 2020 2020 4 hoaa052 33225079 10.1093/hropen/hoaa052 PMC7666361 32. Cobo A García-Velasco J Domingo J Pellicer A Remohí J Elective and Onco-fertility preservation: factors related to IVF outcomes Human Reproduc 2018 33 12 2222 2231 10.1093/humrep/dey321 30383235 33. Azem F Brener A Malinger G Bypassing physiological puberty, a novel procedure of oocyte cryopreservation at age 7: a case report and review of the literature Fertil Sterility 2020 114 2 374 378 10.1016/j.fertnstert.2020.03.009 32386868 34. Zhou Y Li X Ou S Perceptions and attitudes towards elective egg freezing of Chinese college students: a survey from eastern China J Assisted Reproduct Genetics 2022 39 6 1383 1392 10.1007/s10815-022-02502-3 PMC9174412 35499778 35. Stoop D Social oocyte freezing Facts Views Vision ObGyn 2010 2 1 31 34 PMC4154335 25206964 36. Nasab S Ulin L Nkele C Shah J Abdallah ME Sibai BM Elective egg freezing: what is the vision of women around the globe? Future Science OA 2020 6 5 Fso468 10.2144/fsoa-2019-0068 PMC7273395 32518683 37. Ben-Rafael Z The dilemma of social oocyte freezing: usage rate is too low to make it cost-effective Reprod Biomed Online 2018 37 4 443 448 10.1016/j.rbmo.2018.06.024 30396456 38. Katsani D Paraschou N Panagouli E Social egg freezing-a trend or modern reality? J Clin Med 2024 13 2 390 10.3390/jcm13020390 38256524 PMC10816669 39. Akhondi MM Ardakani ZB Warmelink JC Haghani S Ranjbar F Knowledge and beliefs about oocyte cryopreservation for medical and social reasons in female students: a cross-sectional survey BMC Womens Health 2023 23 1 336 10.1186/s12905-023-02481-2 37355576 PMC10290784 40. Varlas VN Bors RG Albu D Social freezing: pressing pause on fertility Int J Environ Res Public Health 2021 18 15 8088 10.3390/ijerph18158088 34360381 PMC8345795 41. Chronopoulou E Raperport C Sfakianakis A Srivastava G Homburg R Elective oocyte cryopreservation for age-related fertility decline J Assisted Reproduct Genetics 2021 38 5 1177 1186 10.1007/s10815-021-02072-w PMC7894970 33608838 42. Platts S Trigg B Bracewell-Milnes T Exploring women’s attitudes, knowledge, and intentions to use oocyte freezing for non-medical reasons: a systematic review Acta obstetricia et gynecologica Scandinavica 2021 100 3 383 393 10.1111/aogs.14030 33078391 43. Cil AP Bang H Oktay K Age-specific probability of live birth with oocyte cryopreservation: an individual patient data meta-analysis Fertil Sterility 2013 100 2 492 499.e493 10.1016/j.fertnstert.2013.04.023 PMC3888550 23706339 44. Jones BP Kasaven L L’Heveder A Perceptions, outcomes, and regret following social egg freezing in the UK; a cross-sectional survey Acta obstetricia et gynecologica Scandinavica 2020 99 3 324 332 10.1111/aogs.13763 31667820 45. Teo UL Kakkar P El-Toukhy T Current perspectives on social oocyte freezing Jobstetrics Gynaecol 2022 42 3 370 378 10.1080/01443615.2021.1904220 34027777 46. Porcu E Bazzocchi A Notarangelo L Paradisi R Landolfo C Venturoli S Human oocyte cryopreservation in infertility and oncology Curr Opinion Endocrinol Diabetes Obesity 2008 15 6 529 535 10.1097/MED.0b013e3283199129 18971682 47. Mogessie B Scheffler K Schuh M Assembly and positioning of the oocyte meiotic spindle Annu Rev Cell Dev Biol 2018 34 1 381 403 10.1146/annurev-cellbio-100616-060553 30028643 48. Paramanantham J Talmor AJ Osianlis T Weston GC Cryopreserved oocytes: update on clinical applications and success rates Obstetrical Gynecol Surv 2015 70 2 97 114 10.1097/OGX.0000000000000152 25671372 49. Chhagani N What is better – fresh eggs or frozen eggs? A comprehensive guide for intended parents 2024 Available from https://www.ivfconceptions.com/what-is-better-fresh-eggs-or-frozen-eggs/ Accessed September 23 50. Song BB Quinn MM Planned oocyte cryopreservation: a review of current evidence on outcomes, safety and risks Obstet Gynecol Clin North Am 2023 50 4 707 719 37914489 10.1016/j.ogc.2023.08.005 51. O’Neill CL Chow S Rosenwaks Z Palermo GD Development of ICSI Reproduction 2018 156 1 F51 f58 10.1530/REP-18-0011 29636404 52. Potdar N Gelbaya TA Nardo LG Oocyte vitrification in the 21st century and post-warming fertility outcomes: a systematic review and meta-analysis Reprod Biomed Online 2014 29 2 159 176 10.1016/j.rbmo.2014.03.024 24931362 53. Agarwal A Sharma R Gupta S Sperm morphology assessment in the era of intracytoplasmic sperm injection: reliable results require focus on standardization, quality control, and training World J Mens Health 2022 40 3 347 360 10.5534/wjmh.210054 34169687 PMC9253798 54. De Vos M Grynberg M Ho TM Yuan Y Albertini DF Gilchrist RB Perspectives on the development and future of oocyte IVM in clinical practice J Assisted Reproduct Genetics 2021 38 6 1265 1280 10.1007/s10815-021-02263-5 PMC8266966 34218388 ",
  "metadata": {
    "Title of this paper": "Perspectives on the development and future of oocyte IVM in clinical practice",
    "Journal it was published in:": "International Journal of Women's Health",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12478218/"
  }
}