{
  "title": "Paper_344",
  "abstract": "pmc Mol Cancer Ther Mol Cancer Ther 4147 aacrsd Molecular Cancer Therapeutics 1535-7163 1538-8514 pmc-is-collection-domain yes pmc-collection-title AACR Open Access PMC12485382 PMC12485382.1 12485382 12485382 40062380 10.1158/1535-7163.MCT-24-0906 MCT-24-0906 1 Version of Record Chemotherapy Gynecological Cancers Ovarian Cancer Immunotherapy Cancer Vaccines Combination Immunotherapy Preclinical Models Animal Models of Cancer Models and Technologies Specific Genetic Mutations Impact Chemotherapy Resistance and Therapeutic Efficacy of Oncolytic Viruses in Ovarian Cancer Ovarian Cancer Genetic Mutations and Response to Therapy https://orcid.org/0009-0002-4764-8771 Cudmore Alison O. 1 2  # https://orcid.org/0000-0002-5366-6047 Rodriguez Galaxia M. 1 2  # https://orcid.org/0000-0003-1674-5421 Maranda Vincent 1 https://orcid.org/0009-0003-5535-7090 Farokhi Boroujeni Salar 1 2 https://orcid.org/0009-0004-6083-1452 Murshed Humaira 1 https://orcid.org/0000-0002-3154-9632 Macdonald Elizabeth A. 1 2 https://orcid.org/0009-0004-1655-7740 Grondin Melanie 1 2 https://orcid.org/0000-0002-6360-6515 Garson Kenneth 1 2 https://orcid.org/0000-0002-7269-8538 Matuszewska Kathy 3 https://orcid.org/0000-0002-4862-2795 Diallo Jean-Simon 1 4 https://orcid.org/0000-0001-7102-637X Petrik James J. 3 https://orcid.org/0000-0002-7644-7189 Vanderhyden Barbara C. 1 2 *  1  2  3  4 * Corresponding Author: bvanderhyden@ohri.ca Mol Cancer Ther 2025;24:1626–39 # A.O. Cudmore and G.M. Rodriguez contributed equally to this article. 01 10 2025 08 3 2025 24 10 498054 1626 1639 09 10 2024 28 1 2025 04 3 2025 01 10 2025 02 10 2025 03 10 2025 ©2025 The Authors; Published by the American Association for Cancer Research 2025 American Association for Cancer Research https://creativecommons.org/licenses/by-nc-nd/4.0/ This open access article is distributed under the Creative Commons Attribution-NonCommercial-NoDerivatives 4.0 International (CC BY-NC-ND 4.0) license. Abstract Epithelial ovarian cancer (EOC) is the most lethal gynecologic cancer, and those affected are in urgent need of new therapeutic strategies. Standard treatment is surgery followed by taxane- and platinum-based chemotherapy. However, the rate of relapse is high, and the 5-year survival is only 45%. Oncolytic viruses (OV) are a promising approach to EOC therapy through remodeling the immune composition of the tumor microenvironment. Treatment response in EOC tumors can differ based on the presence of key tumorigenic mutations. This study evaluated the impact of specific tumor mutations on the response to the current standard-of-care carboplatin, two promising OV candidates VSVΔM51 and MG1, an infected cell vaccine (ICV-MG1) regimen, and the antiangiogenic drug Fc3TSR. Mice with tumors harboring constitutive K-Ras activation showed an enhanced response to carboplatin and VSVΔM51 treatment. Additionally, VSVΔM51 treatment prolonged survival of syngeneic mice bearing tumors with mutations in Pten Kras Pten Trp53 Trp53 Brca2 + + Trp53 −/− Canadian Institutes of Health Research (CIHR) http://dx.doi.org/10.13039/501100000024 PJT-156139 Vanderhyden B.C. Ovarian Cancer Canada (OCC) http://dx.doi.org/10.13039/100017292 Petrik J.J. Vanderhyden B.C. pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement yes pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes Introduction Ovarian cancer is the most lethal gynecologic cancer. Most patients are diagnosed at an advanced stage and face a 5-year survival rate of only 45% ( 1 2 Poor prognosis is associated with an advanced disease stage at the time of detection when significant metastases have developed within lymph nodes (LN) and organs of the peritoneal region (stage III) or beyond (stage IV; ref. 3 4 5 6 7 8 9 BRCA 10 11 PTEN NF1 9 The immunosuppressive TME, which serves as a negative predictor of patient prognosis, poses a critical barrier to successful EOC therapy ( 12 13 14 15 16 18 Oncolytic viruses (OV) are a promising candidate for EOC immunotherapy because they can trigger at least two modes of cancer cell killing: direct oncolysis of infected tumor cells and indirect tumor cell death elicited by the host immune system ( 19 20 19 20 Rhabdoviridae 21 22 in vitro 23 24 25 Viral infection promotes the generation of antiviral responses that can eventually decrease the efficacy of OVs. To circumvent resistance mechanisms, cells can be exploited as carriers of viruses to the tumor niche as an oncolytic vaccine platform consisting of tumor cells infected with an OV ( 26 27 28 29 Vascular normalization can also be used to enhance the efficacy of OV delivery and infection and promote immune function within the tumor niche. Fc3TSR is an antiangiogenic fusion protein that links two peptides of the three type I repeat region (3TSR) of thrombospondin-1 with a non-immunostimulatory human IgG. 3TSR has previously been shown to induce vascular normalization, reduce tumor hypoxia, and enhance the uptake and efficacy of chemotherapy ( 30 31 32 Herein, we investigated the impact of different genetic mutations in murine EOC models on the efficacy of standard and new therapeutic approaches, including OVs, an ICV, and Fc3TSR treatment. We selected EOC murine models refractory to standard carboplatin therapy and OV treatment to test two unique OV therapeutic approaches: ICV delivering IL15 and IL21 and OV infection with Fc3TSR. These therapeutic strategies enhanced OV efficacy by overcoming the immunosuppressive TME and delivery challenges typical in EOC models. Materials and Methods Cell lines and mouse models ID8 cells (RRID: CVCL_IU14) were obtained in 2017 from Dr. Kathy Roby (University of Kansas Medical Center, Kansas City, Kansas). ( 8 Trp53 −/− Brca1 −/− Brca2 −/− Nf1 −/− Pten −/− 33 34 . 7 35 Pten shRNA Kras G12V Trp53 R273H 4 5 Trp53 −/− 36 37 15 2 Mycoplasma in vivo Virus strains and propagation All viruses were made available by Drs. Jean-Simon Diallo and John Bell at the Ottawa Hospital Research Institute, purified via OptiPrep gradient, quantified via plaque assay, and stored at −80°C. Propagation of Rhabdovirus 38 39 Generation of Maraba MG1 virus variants For in vivo 24 27 alamarBlue assays ID8-, STOSE-, and MOE-derived cell lines were treated in vitro 39 Incucyte live-cell analysis Cell proliferation rates were measured using the Incucyte Live-Cell Analysis system. Cells were seeded at a low density in 96-well plates (ID8/STOSE = 4,500 cells/well; MOE = 7,500 cells/well) under standard growth conditions. Confluence was measured every 2 hours until all cell lines reached the growth plateau (up to 48 hours). Raw data were normalized to align a 20% to 25% starting confluence at 0 hour timepoint. The mean confluence was compared using statistical analysis. A logistic regression was fit to each cell line, and the 95% interval was calculated. A one-way ANOVA and Tukey post hoc qPCR Cells were pretreated with VSVΔM51-GFP at an MOI of 0.1 for 6 hours or 12 hours and compared with mock conditions. RNA was extracted using the RNeasy Mini Spin kit (Qiagen; #74106) or RNeasy Plus Mini Spin kit (Qiagen; #74136) as per the manufacturer’s protocol. A NanoDrop One Microvolume UV-Vis spectrophotometer (Thermo Fisher Scientific) was used to determine the RNA quantity and quality. cDNA was prepared from each sample using the iScript Reverse Transcription Supermix (Bio-Rad; #1708841) and amplified by qPCR using primers that were validated in-house. Murine Gapdh Hrpt1 β-actin  In vivo Carboplatin Syngeneic tumor models were created using the following cell lines: ID8-C3, ID8- Trp53 −/− Trp53 −/− 36 Trp53 −/− Brca2 −/− Pten shRNA Trp53 R273H Pten shRNA Kras G12V 6 15 n n VSVΔM51 VSVΔM51 was injected intraperitoneally at 3 × 10 8 n ICV ICVs were generated by lethally irradiating ID8- Trp53 −/− 6 in vitro 7 27 n 7 36 TME remodeling An orthotopic mouse model of EOC was generated as we have done previously ( 40 41 6 For all mouse experiments, mice were monitored for loss of wellness by veterinary staff blinded to the treatment and euthanized when a humane endpoint was reached. Upon euthanasia, a necropsy was performed to measure the volume of ascites, spleen weight, and tumor weight of each mouse. ELISA To confirm IL15 and IL21 production by MG1 variants, ICV supernatants were collected at 2, 24, and 48 hours after viral infection in vitro Gaussia and firefly luciferase assays To monitor tumor burden in ID8- Trp53 −/− 36 D 2 Flow cytometry ID8- Trp53 −/− Brca2 −/− Pten shRNA Kras G12V n 15 in vivo 7 Tumor cell apoptosis Primary ovarian tumors were collected following treatment with Fc3TSR and/or VSVΔM51 as described above and were fixed in neutral-buffered formalin overnight, washed with 70% ethanol for 24 hours, and transferred to PBS. Tissues were embedded in paraffin wax and cut into 5-μm sections using a rotary microtome. Prior to staining, tissues were deparaffinized using reagent-grade xylene and subjected to a series of decreasing ethanol concentrations for rehydration. Endogenous peroxidase activity was quenched through a 10-minute incubation period in 3% hydrogen peroxide followed by antigen retrieval using citrate buffer with Tween 20. To reduce nonspecific antibody binding, tissues were blocked in 5% BSA (with 0.02% sodium azide) for 10 minutes at room temperature. Tumor sections were exposed to anti–cleaved caspase-3 (1:200 dilution; Cell Signaling Technology, Cat# 9661, RRID: AB_2341188) overnight at 4°C. A biotin-conjugated antirabbit secondary antibody (1:100; Invitrogen) was added for 2 hours at room temperature, followed by treatment with ExtrAvidin (1:50, Sigma-Aldrich) for 1 hour. Tissues were exposed to SIGMAFAST 3,3’-diaminobenzidine (Sigma-Aldrich) for visualization of staining and counterstained using Carazzi’s hematoxylin. For each tumor, five regions of interest were imaged, and analysis was performed by manual count of cell nuclei and reported as a percentage of positive cells against total cells. Vascular morphology Evaluation of microvessel density in tumors of treated mice was performed. Vessel maturity was evaluated through co-localization of endothelial cell marker CD31 and pericyte marker α-smooth muscle actin (SMA) staining in tissues from mice treated with VSVΔM51 and/or Fc3TSR for 4 weeks. Cryosections of tumor tissue were blocked with 5% BSA in PBS for 10 minutes and then incubated with a cocktail of rabbit anti-CD31 (1:50 dilution; Abcam) and mouse anti-SMA (1:600 dilution; Santa Cruz Biotechnology Inc.) overnight at 4°C. Following the overnight incubation, tissues were incubated for 1 hour with a secondary antibody cocktail of Alexa Fluor 488–conjugated anti–mouse (RRID: AB_2534069) and Alexa Fluor 594–conjugated anti–rabbit (RRID: AB_141637) IgG secondary antibodies (1:100 dilution; Life Technologies Inc.). After rinsing with PBS, tissues were stained with 4′6-diamidino-2-phenylindole (0.05 μL/mL; Sigma-Aldrich Canada Ltd.) for 1 minute to counterstain nuclei blue. Quantification of vessel maturity was performed as a percentage of vessels exhibiting SMA-positive staining to total CD31-positive vessels. Statistical analysis Visualization and statistical analyses were performed using GraphPad Prism version 9.0 (RRID: SCR_002798). Survival studies were depicted in Kaplan–Meier plots, and statistical significance was tested by log-rank (Mantel–Cox) tests. A Student t post hoc P P P P P Data availability The data generated in this study are presented within the article and its Supplementary Data files. Raw data are available from the corresponding author upon request. Results Specific mutations alter carboplatin sensitivity in murine EOC models To assess how specific genetic mutations can influence the response to a chemotherapeutic agent, a panel of 10 murine cell lines derived from the OSE (ID8 and STOSE) or the FTE (MOE) harboring key oncogenic mutations including Trp53 Brca1/2 Nf1 Pten Kras in vitro Fig. 1A Trp53 −/− Trp53 −/− Nf1 −/− 50 Trp53 −/− 50 Trp53 −/− Brca1 −/− Brca2 −/− Pten shRNA 50 50 Pten shRNA 50 Trp53 R273H 50 Kras G12V Pten shRNA 50 50 Figure 1. Sensitivity of murine HGSC models to a high-dose regimen of carboplatin treatment. A, 50 in vitro post hoc n B, in vivo n P P P P To determine if the response to carboplatin in vitro in vivo Trp53 −/− Trp53 −/−- Brca2 −/− Pten shRNA -Trp53 R273H Pten shRNA Kras G12V Fig. 1B Trp53 −/− P in vitro Pten shRNA Kras G12V in vitro P Trp53 Nf1 EOC murine models with BRCA2 −/− Kras G12V in vitro in vivo Although high-dose carboplatin can provide antitumoral protection ( Fig. 1B 42 Fig. 2A B Fig. 2A Pten shRNA Trp53 R273H Kras G12V Pten shRNA Fig. 2B Figure 2. Screening of two OV platforms in vitro A B, A B y n post hoc P P P C D, n To explore potential mechanisms underlying different sensitivities to OV infection, we determined the level of expression of low-density lipoprotein receptor (LDLr), the entry receptor of MG1 and VSVΔM51, and the following antiviral response genes: IFN-β IFN-γ H2D/Kb H2Kq B2M Ldlr Ifnb1 Fig. 2C D Ifnb1 Pten shRNA Ifng Trp53 −/− Pten shRNA H2kb/q H2db B2m Pten shRNA Next, VSVΔM51 therapy was tested in six in vivo Trp53 −/− Trp53 −/− Brca2 −/− Pten shRNA -Trp53 R273H Pten shRNA -Kras G12V Trp53 −/− Brca2 −/− Pten shRNA -Trp53 R273H Pten shRNA -Kras G12V Fig. 3A in vivo Trp53 −/− Brca2 −/− Pten shRNA -Kras G12V + + + Fig. 3B Trp53 −/− Brca2 −/− Pten shRNA -Kras G12V Figure 3. VSVΔM51 treatment confers antitumoral protection against ovarian cancer in syngeneic models. C57BL/6 mice bearing intraperitoneal tumors were treated starting at 25% of expected length of survival with 3 × 10 8 A, B, + post hoc P P P C, Further immune profiling comparing activation markers of immune cells from each sample revealed that NK cells dominantly responded to VSVΔM51 treatment with increased expression of CD25, PD-1, NKp46, and/or NKG2D and decreased inhibitory marker LAG3 ( Fig. 3C + Trp53 −/−- Brca2 −/− Pten shRNA -Kras G12V in vivo BRCA 43 Delivery of IL15 and IL21 in an ICV enables strong antitumor immunity in refractory ovarian cancer models Most EOCs are refractory to immunotherapies, so modulating the TME to increase immunogenicity is needed. In preliminary experiments, MG1 infection was insufficient to confer antitumoral protection in vivo + 29 Trp53 −/− 15 37 Fig. 2A 23 Trp53 −/− in vitro 24 26 in vivo 27 IL15 IL21 44 Trp53 −/− Fig. 4A Trp53 −/− Fig. 4B C Figure 4. Delivery of IL15 and IL21 with an ICV confers significant antitumoral protection. A, Trp53 −/− B, C n D E, Trp53 −/− D E, n P P P P To determine if the delivery of either IL15 or IL21, or both could improve the antitumoral properties of MG1, we tested a single dose of the ICV-MG1 variants (Supplementary Fig. S1C) because multiple and high doses of IL15 and IL21 can cause adverse side effects ( 45 46 Trp53 −/− 7 6 Trp53 −/− Fig. 4D Trp53 −/− Fig. 4E Fig. 4E 15 Trp53 −/− IL21 and IL15 + IL21 delivered in an ICV promote sustained antitumoral protection Given the survival advantage observed following a single treatment with ICV-MG1-IL15 and/or IL-21 variants, we sought to determine if increasing the frequency could lead to prolonged survival. Studies in peritoneal carcinomatosis and melanoma have shown that when administered in a prime-boost regimen, MG1 vaccine rapidly generated strong antigen-specific T-cell immune responses ( 47 48 Fig. 5A Fig. 5B Figure 5. Three doses of ICV delivering IL15 and IL21 confer superior protection against ovarian tumor growth. Eight-week-old mice were injected with ( A Trp53 −/− B 7 n C E, 7 C, + D, + + + E, + + n P P P P < To gain insights into the immune responses that may have contributed to these therapeutic outcomes, the immune subsets recruited in response to ICV-MG1 variants were determined in the TME (peritoneal cavity) and mLNs by flow cytometry (Supplementary Fig. S2). A dramatic decrease in the total leukocyte population was identified in the TME of mice treated with ICV-MG1-IL15 [ Fig. 5C Fig. 5C Fig. 5C + Fig. 5D + Fig. 5E These findings highlight the benefits of IL-15 and IL-21 delivery using an ICV-MG1 platform, showing a greater promotion of potent antitumoral immunity. ICV-MG1-IL21 can promote greater recruitment of CD8 + TME remodeling potentiates the effects of VSVΔM51 Fc3TSR has been shown to induce vascular normalization and reduce the expression of immunosuppressive cytokines within the ovarian TME, facilitating the uptake and efficacy of chemotherapies and OVs ( 30 31 Fig. 6A Fig. 6A Fig. 6B Fig. 6C Fig. 6C Figure 6. The antiangiogenic compound Fc3TSR and VSV induce tumor regression and vascular normalization in an orthotopic, syngeneic mouse model of ovarian cancer. After 50 days of tumor growth, mice were injected with PBS, Fc3TSR, or VSV alone or in combination. A, B, C, P P P < Discussion In this study, we tested 10 syngeneic murine models of EOC derived from the OSE and FTE, harboring relevant mutations in Trp53 Brca1/2 Nf1 Pten Kras 9 3 Brca1 −/− Brca2 −/− 50 49 In vivo Trp53 −/− Trp53 −/− Brca2 −/− Pten shRNA -Trp53 R273H Pten R273H Kras G12V Brca2 −/− 50 in vitro in vivo BRCA 51 OVs are a promising new immunotherapy gaining attractiveness in clinical trials based on positive results in preclinical studies ( 52 in vitro in vivo 53 Pten shRNA Kras G12V in vivo KRas in vitro 15 ID8-derived cell lines were responsive to viral infection in vitro Brca2 in vivo BRCA1/2 43 54 + + The current challenge of EOC therapy is to increase treatment efficacy of ovarian tumors that are refractory and resistant to chemotherapy, which accounts for >75% of women diagnosed with advanced disease ( 3 The immunosuppressive TME of ovarian cancer is a notable limitation that restricts the efficacy of immunotherapies for this disease. An ICV-MG1 treatment regimen delivering IL15 and/or IL21 to the models with the most immunosuppressive TMEs, ID8- Trp53 −/− + 55 Trp53 −/− 15 36 37 Trp53 56 An important consideration in the treatment of ovarian cancer is the barriers inherent in the TME. The TME is characterized by dysregulated vasculature, which impairs perfusion and leads to significant tumor hypoxia ( 57 58 31 32 59 In this study, a thorough analysis of the response to treatments in vitro in vivo Trp53 BRCA2 K-Ras Supplementary Material Supplementary Figure 1 Supplementary Figure 1 Supplementary Figure 2 Supplementary Figure 2 Supplementary Figure 3 Supplementary Figure 3 Supplementary Figure 4 Supplementary Figure 4 Supplementary Figure 5 Supplementary Figure 5 Supplementary Figure 6 Supplementary Figure 6 Supplementary Figure 7 Supplementary Figure 7 Supplementary Figure 8 Supplementary Figure 8 Supplementary Tables Supplementary Tables Acknowledgments This work was supported by a grant from the Canadian Institutes of Health Research (PJT-156139; to B.C. Vanderhyden) and by funding provided by Health Canada to Ovarian Cancer Canada in support of the OvCAN research initiative (to B.C. Vanderhyden and J.J. Petrik). Additional support was provided by an Ontario Graduate Scholarship (A.O. Cudmore), a fellowship from the Fonds de recherche du Québec (G.M. Rodriguez), and a Canadian Institutes of Health Research Canada Graduate Scholarship (S. Farokhi Boroujeni). We thank Dr. Michael A. Kennedy for his valuable input in cloning IL15 and IL21 into MG1 and Shashankan Ramesh for his technical assistance with tissue culture work. The laboratory members of J.-S. Diallo shared their expertise in virology. We also thank Dr. Sarah Nersesian for her help with the figures and for editing the final version. We are also grateful for the services provided by the Flow Cytometry & Virometry Core (RRID: SCR_023306) and the Preclinical Imaging Core at the University of Ottawa.  Note: http://mct.aacrjournals.org/ Authors’ Disclosures A.O. Cudmore reports grants from Ovarian Cancer Canada and Canadian Institutes of Health Research during the conduct of the study. H. Murshed reports grants from Ottawa Hospital Research Institute during the conduct of the study. E.A. Macdonald reports grants from Canadian Institutes of Health Research and Ovarian Cancer Canada during the conduct of the study. M. Grondin reports grants from Canadian Institutes of Health Research and Ovarian Cancer Canada during the conduct of the study. B.C. Vanderhyden reports grants from Canadian Institutes of Health Research and Ovarian Cancer Canada during the conduct of the study. No disclosures were reported by the other authors. Authors’ Contributions  A.O. Cudmore: G.M. Rodriguez: V. Maranda: S. Farokhi Boroujeni: H. Murshed: E.A. Macdonald: M. Grondin: K. Garson: K. Matuszewska: J.-S. Diallo: J.J. Petrik: B.C. Vanderhyden: References 1. Baldwin LA Huang B Miller RW Tucker T Goodrich ST Podzielinski I Ten-year relative survival for epithelial ovarian cancer Obstet Gynecol 2012 120 612 8 22914471 10.1097/AOG.0b013e318264f794 2. Huang J Chan WC Ngai CH Lok V Zhang L Lucero-Prisno DE Worldwide burden, risk factors, and temporal trends of ovarian cancer: a global study Cancers 2022 14 2230 35565359 10.3390/cancers14092230 PMC9102475 3. Lheureux S Gourley C Vergote I Oza AM Epithelial ovarian cancer The Lancet 2019 393 1240 53 10.1016/S0140-6736(18)32552-2 30910306 4. Eddie SL Quartuccio SM Ó hAinmhir E Moyle-Heyrman G Lantvit DD Wei J-J Tumorigenesis and peritoneal colonization from fallopian tube epithelium Oncotarget 2015 6 20500 12 25971410 10.18632/oncotarget.3985 PMC4653021 5. Quartuccio SM Karthikeyan S Eddie SL Lantvit DD Ó hAinmhire E Modi DA Mutant p53 expression in fallopian tube epithelium drives cell migration Int J Cancer 2015 137 1528 38 25810107 10.1002/ijc.29528 PMC4503498 6. Shih I-M Wang Y Wang T-L The origin of ovarian cancer species and precancerous landscape Am J Pathol 2021 191 26 39 33011111 10.1016/j.ajpath.2020.09.006 PMC7786078 7. McCloskey CW Goldberg RL Carter LE Gamwell LF Al-Hujaily EM Collins O A new spontaneously transformed syngeneic model of high-grade serous ovarian cancer with a tumor-initiating cell population Front Oncol 2014 4 53 24672774 10.3389/fonc.2014.00053 PMC3957277 8. Roby KF Taylor CC Sweetwood JP Cheng Y Pace JL Tawfik O Development of a syngeneic mouse model for events related to ovarian cancer Carcinogenesis 2000 21 585 91 10753190 10.1093/carcin/21.4.585 9. Cancer Genome Atlas Research Network Integrated genomic analyses of ovarian carcinoma Nature 2011 474 609 15 21720365 10.1038/nature10166 PMC3163504 10. Ramus SJ Gayther SA The contribution of BRCA1 and BRCA2 to ovarian cancer Mol Oncol 2009 3 138 50 19383375 10.1016/j.molonc.2009.02.001 PMC5527889 11. Roy R Chun J Powell SN BRCA1 and BRCA2: different roles in a common pathway of genome protection Nat Rev Cancer 2011 12 68 78 22193408 10.1038/nrc3181 PMC4972490 12. Rodriguez GM Galpin KJC McCloskey CW Vanderhyden BC The tumor microenvironment of epithelial ovarian cancer and its influence on response to immunotherapy Cancers 2018 10 E242 10.3390/cancers10080242 PMC6116043 30042343 13. Glasgow MA Argenta P Abrahante JE Shetty M Talukdar S Croonquist PA Biological insights into chemotherapy resistance in ovarian cancer Int J Mol Sci 2019 20 2131 31052165 10.3390/ijms20092131 PMC6547356 14. McCloskey CW Rodriguez GM Galpin KJC Vanderhyden BC Ovarian cancer immunotherapy: preclinical models and emerging therapeutics Cancers 2018 10 244 30049987 10.3390/cancers10080244 PMC6115831 15. Rodriguez GM Galpin KJC Cook DP Yakubovich E Maranda V Macdonald EA The tumor immune profile of murine ovarian cancer models: an essential tool for ovarian cancer immunotherapy research Cancer Res Commun 2022 2 417 33 36311166 10.1158/2767-9764.CRC-22-0017 PMC9616009 16. Iyer S Zhang S Yucel S Horn H Smith SG Reinhardt F Genetically defined syngeneic mouse models of ovarian cancer as tools for the discovery of combination immunotherapy Cancer Discov 2021 11 384 407 33158843 10.1158/2159-8290.CD-20-0818 PMC8344888 17. Jardim DL Goodman A de Melo Gagliato D Kurzrock R Kurzrock R The challenges of tumor mutational burden as an immunotherapy biomarker Cancer Cell 2021 39 154 73 33125859 10.1016/j.ccell.2020.10.001 PMC7878292 18. Shakfa N Li D Conseil G Lightbody ED Wilson-Sanchez J Hamade A Cancer cell genotype associated tumor immune microenvironment exhibits differential response to therapeutic STING pathway activation in high-grade serous ovarian cancer J Immunother Cancer 2023 11 e006170 37015760 10.1136/jitc-2022-006170 PMC10083863 19. Galluzzi L Buqué A Kepp O Zitvogel L Kroemer G Immunogenic cell death in cancer and infectious disease Nat Rev Immunol 2017 17 97 111 27748397 10.1038/nri.2016.107 20. Russell SJ Peng K-W Oncolytic virotherapy: a contest between apples and oranges Mol Ther J 2017 25 1107 16 10.1016/j.ymthe.2017.03.026 PMC5417845 28392162 21. Bishnoi S Tiwari R Gupta S Byrareddy SN Nayak D Oncotargeting by vesicular stomatitis virus (VSV): advances in cancer therapy Viruses 2018 10 90 29473868 10.3390/v10020090 PMC5850397 22. Orzechowska BU Jędryka M Zwolińska K Matkowski R VSV based virotherapy in ovarian cancer: the past, the present and …future? J Cancer 2017 8 2369 83 28819441 10.7150/jca.19473 PMC5560156 23. Tong JG Valdes YR Barrett JW Bell JC Stojdl D McFadden G Evidence for differential viral oncolytic efficacy in an in vitro model of epithelial ovarian cancer metastasis Mol Ther Oncolytics 2015 2 15013 27119108 10.1038/mto.2015.13 PMC4782950 24. Brun J McManus D Lefebvre C Hu K Falls T Atkins H Identification of genetically modified Maraba virus as an oncolytic Rhabdovirus Mol Ther 2010 18 1440 9 20551913 10.1038/mt.2010.103 PMC2927055 25. Breitbach CJ Considerations for clinical translation of MG1 Maraba virus Methods Mol Biol 2020 2058 285 93 31486046 10.1007/978-1-4939-9794-7_19 26. Lemay CG Rintoul JL Kus A Paterson JM Garcia V Falls TJ Harnessing oncolytic virus-mediated antitumor immunity in an infected cell vaccine Mol Ther 2012 20 1791 9 22760544 10.1038/mt.2012.128 PMC3437573 27. Alkayyal AA Tai L-H Kennedy MA de Souza CT Zhang J Lefebvre C NK-cell recruitment is necessary for eradication of peritoneal carcinomatosis with an IL12-expressing Maraba virus cellular vaccine Cancer Immunol Res 2017 5 211 21 28159747 10.1158/2326-6066.CIR-16-0162 28. Pulliam SR Uzhachenko RV Adunyah SE Shanker A Common gamma chain cytokines in combinatorial immune strategies against cancer Immunol Lett 2016 169 61 72 26597610 10.1016/j.imlet.2015.11.007 PMC4710466 29. Zeng R Spolski R Finkelstein SE Oh S Kovanen PE Hinrichs CS Synergy of IL-21 and IL-15 in regulating CD8 + J Exp Med 2005 201 139 48 15630141 10.1084/jem.20041057 PMC2212766 30. Russell S Duquette M Liu J Drapkin R Lawler J Petrik J Combined therapy with thrombospondin-1 type I repeats (3TSR) and chemotherapy induces regression and significantly improves survival in a preclinical model of advanced stage epithelial ovarian cancer FASEB J 2015 29 576 88 25395453 10.1096/fj.14-261636 PMC4314231 31. Matuszewska K Santry LA van Vloten JP AuYeung AWK Major PP Lawler J Combining vascular normalization with an oncolytic virus enhances immunotherapy in a preclinical model of advanced-stage ovarian cancer Clin Cancer Res 2019 25 1624 38 30206160 10.1158/1078-0432.CCR-18-0220 32. Matuszewska K Ten Kortenaar S Pereira M Santry LA Petrik D Lo K-M Addition of an Fc-IgG induces receptor clustering and increases the in vitro efficacy and in vivo anti-tumor properties of the thrombospondin-1 type I repeats (3TSR) in a mouse model of advanced stage ovarian cancer Gynecol Oncol 2022 164 154 69 34799137 10.1016/j.ygyno.2021.11.006 33. Walton J Blagih J Ennis D Leung E Dowson S Farquharson M CRISPR/Cas9-mediated Trp53 and Brca2 knockout to generate improved murine models of ovarian high grade serous carcinoma Cancer Res 2016 76 6118 29 27530326 10.1158/0008-5472.CAN-16-1272 PMC5802386 34. Walton JB Farquharson M Mason S Port J Kruspig B Dowson S CRISPR/Cas9-derived models of ovarian high grade serous carcinoma targeting Brca1, Pten and Nf1, and correlation with platinum sensitivity Sci Rep 2017 7 16827 29203787 10.1038/s41598-017-17119-1 PMC5715106 35. Alwosaibai K Abedini A Al-Hujaily EM Tang Y Garson K Collins O PAX2 maintains the differentiation of mouse oviductal epithelium and inhibits the transition to a stem cell-like state Oncotarget 2017 8 76881 97 29100356 10.18632/oncotarget.20173 PMC5652750 36. Rodriguez GM Yakubovich E Murshed H Maranda V Galpin KJC Cudmore A NLRC5 overexpression in ovarian tumors remodels the tumor microenvironment and increases T-cell reactivity toward autologous tumor-associated antigens Front Immunol 2024 14 1295208 38235131 10.3389/fimmu.2023.1295208 PMC10791902 37. Cook DP Galpin KJC Rodriguez GM Shakfa N Wilson-Sanchez J Echaibi M Comparative analysis of syngeneic mouse models of high-grade serous ovarian cancer Commun Biol 2023 6 1 11 37957414 10.1038/s42003-023-05529-z PMC10643551 38. Diallo J-S Vähä-Koskela M Le Boeuf F Bell J Propagation, purification, and in vivo testing of oncolytic vesicular stomatitis virus strains Methods Mol Biol 2012 797 127 40 21948474 10.1007/978-1-61779-340-0_10 39. Zhang J Tai L-H Ilkow CS Alkayyal AA Ananth AA de Souza CT Maraba MG1 virus enhances natural killer cell function via conventional dendritic cells to reduce postoperative metastatic disease Mol Ther 2014 22 1320 32 24695102 10.1038/mt.2014.60 PMC4088996 40. Greenaway J Henkin J Lawler J Moorehead R Petrik J ABT-510 induces tumor cell apoptosis and inhibits ovarian tumor growth in an orthotopic, syngeneic model of epithelial ovarian cancer Mol Cancer Ther 2009 8 64 74 19139114 10.1158/1535-7163.MCT-08-0864 PMC3383797 41. Greenaway JB Petrik JJ Orthotopic, syngeneic mouse model to study the effects of epithelial-stromal interaction Methods Mol Biol 2013 1049 409 23 23913234 10.1007/978-1-62703-547-7_31 42. Oun R Moussa YE Wheate NJ The side effects of platinum-based chemotherapy drugs: a review for chemists Dalton Trans 2018 47 6645 53 29632935 10.1039/c8dt00838h 43. Farokhi Boroujeni S Rodriguez G Galpin K Yakubovich E Murshed H Ibrahim D BRCA1 and BRCA2 deficient tumour models generate distinct ovarian tumour microenvironments and differential responses to therapy J Ovarian Res 2023 16 231 38017453 10.1186/s13048-023-01313-z PMC10683289 44. Stephenson KB Barra NG Davies E Ashkar AA Lichty BD Expressing human interleukin-15 from oncolytic vesicular stomatitis virus improves survival in a murine metastatic colon adenocarcinoma model through the enhancement of anti-tumor immunity Cancer Gene Ther 2012 19 238 46 22158521 10.1038/cgt.2011.81 45. Waldmann TA Lugli E Roederer M Perera LP Smedley JV Macallister RP Safety (toxicity), pharmacokinetics, immunogenicity, and impact on elements of the normal immune system of recombinant human IL-15 in rhesus macaques Blood 2011 117 4787 95 21385847 10.1182/blood-2010-10-311456 PMC3100690 46. Petrella TM Tozer R Belanger K Savage KJ Wong R Smylie M Interleukin-21 has activity in patients with metastatic melanoma: a phase II study J Clin Oncol 2012 30 3396 401 22915661 10.1200/JCO.2011.40.0655 47. Alkayyal AA Mahmoud AB Auer RC Interleukin-12-expressing oncolytic virus: a promising strategy for cancer immunotherapy J Taibah Univ Med Sci 2016 11 187 93 48. Pol JG Zhang L Bridle BW Stephenson KB Rességuier J Hanson S Maraba virus as a potent oncolytic vaccine vector Mol Ther 2014 22 420 9 24322333 10.1038/mt.2013.249 PMC3916044 49. Prakash R Zhang Y Feng W Jasin M Homologous recombination and human health: the roles of BRCA1, BRCA2, and associated proteins Cold Spring Harb Perspect Biol 2015 7 a016600 25833843 10.1101/cshperspect.a016600 PMC4382744 50. Wang S Zhang H Cheng L Evans C Pan C-X Analysis of the cytotoxic activity of carboplatin and gemcitabine combination Anticancer Res 2010 30 4573 8 21115908 PMC4562399 51. Tan DSP Kaye SB Chemotherapy for patients with BRCA1 and BRCA2–mutated ovarian cancer: same or different? Am Soc Clin Oncol Educ Book 2015 114 21 25993149 10.14694/EdBook_AM.2015.35.114 52. Chen L Zuo M Zhou Q Wang Y Oncolytic virotherapy in cancer treatment: challenges and optimization prospects Front Immunol 2023 14 1308890 38169820 10.3389/fimmu.2023.1308890 PMC10758479 53. Rodriguez GM Yakubovich E Vanderhyden BC Unveiling the immunogenicity of ovarian tumors as the crucial catalyst for therapeutic success Cancers 2023 15 5694 38067396 10.3390/cancers15235694 PMC10705691 54. Han Y Rovella V Smirnov A Buonomo OC Mauriello A Perretta T A BRCA2 germline mutation and high expression of immune checkpoints in a TNBC patient Cell Death Discov 2023 9 370 10.1038/s41420-023-01651-3 PMC10562433 37813891 55. Spolski R Leonard WJ Interleukin-21: basic biology and implications for cancer and autoimmunity Annu Rev Immunol 2008 26 57 79 17953510 10.1146/annurev.immunol.26.021607.090316 56. Chasov V Zaripov M Mirgayazova R Khadiullina R Zmievskaya E Ganeeva I Promising new tools for targeting p53 mutant cancers: humoral and cell-based immunotherapies Front Immunol 2021 12 707734 34484205 10.3389/fimmu.2021.707734 PMC8411701 57. Matuszewska K Pereira M Petrik D Lawler J Petrik J Normalizing tumor vasculature to reduce hypoxia, enhance perfusion, and optimize therapy uptake Cancers 2021 13 4444 34503254 10.3390/cancers13174444 PMC8431369 58. Jain RK Delivery of molecular and cellular medicine to solid tumors Adv Drug Deliv Rev 2012 64 353 65 24511174 10.1016/j.addr.2012.09.011 PMC3914635 59. Stegelmeier AA Santry LA Guilleman MM Matuszewska K Minott JA Yates JGE AAV-vectored expression of the vascular normalizing agents 3TSR and Fc3TSR, and the anti-angiogenic Bevacizumab extends survival in a murine model of end-stage epithelial ovarian carcinoma Biomedicines 2022 10 362 35203573 10.3390/biomedicines10020362 PMC8962366 ",
  "metadata": {
    "Title of this paper": "AAV-vectored expression of the vascular normalizing agents 3TSR and Fc3TSR, and the anti-angiogenic Bevacizumab extends survival in a murine model of end-stage epithelial ovarian carcinoma",
    "Journal it was published in:": "Molecular Cancer Therapeutics",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12485382/"
  }
}