{
  "title": "Paper_1153",
  "abstract": "pmc Healthcare (Basel) Healthcare (Basel) 2994 healthcare healthcare Healthcare 2227-9032 Multidisciplinary Digital Publishing Institute  (MDPI) PMC12469657 PMC12469657.1 12469657 12469657 41008500 10.3390/healthcare13182371 healthcare-13-02371 1 Article Inflammatory Profile and Risk of Post-Intervention Infection in Relation to Myocardial Necrosis Markers Buzle Alexandra Manuela Conceptualization 1 Pantea-Roșan Larisa Renata 1 https://orcid.org/0000-0002-6386-4442 Moisi Mădălina Ioana 2 Matache Priscilla 2 Ghitea Marc Cristian Formal analysis 3 Ghitea Evelin Claudia Investigation 3 Gîtea Maria Flavia Resources 3 https://orcid.org/0000-0001-8981-1958 Ghitea Timea Claudia Conceptualization Writing – original draft Writing – review & editing Visualization Supervision 4 * https://orcid.org/0000-0002-8273-4416 Popescu Mircea Ioachim Formal analysis 1 Mistiaen Wilhelm P. Academic Editor 1 buzlealexandramanuela@student.uoradea.ro larisa.rosan@didactic.uoradea.ro procardia_oradea@yahoo.com 2 moisi.madalina.ioana@didactic.uoradea.ro priscilla_pasc@uoradea.ro 3 ghitea.marccristian@student.uoradea.ro ghitea.evelinclaudia@student.uoradea.ro gitea.mariaflavia@student.uoradea.ro 4 * timea.ghitea@csud.uoradea.ro 21 9 2025 9 2025 13 18 497454 2371 04 8 2025 18 9 2025 19 9 2025 21 09 2025 27 09 2025 29 09 2025 © 2025 by the authors. 2025 https://creativecommons.org/licenses/by/4.0/ Licensee MDPI, Basel, Switzerland. This article is an open access article distributed under the terms and conditions of the Creative Commons Attribution (CC BY) license ( https://creativecommons.org/licenses/by/4.0/ Background: Methods: n Results: p p p p Conclusions: acute coronary syndrome percutaneous coronary intervention hs-cTn infection CRP ESR NT-proBNP University of Oradea The APC was funded by the University of Oradea, Oradea, Romania. pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement yes pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes 1. Introduction Nosocomial and post-interventional infections remain important complications in patients with acute coronary syndrome (ACS) undergoing percutaneous coronary intervention (PCI), contributing to higher morbidity, prolonged hospitalization, and increased costs [ 1 2 3 4 According to the Centers for Disease Control and Prevention/National Healthcare Safety Network (CDC/NHSN), HAIs are defined as infections not present on admission and meeting standardized clinical, laboratory, and/or radiologic criteria, including bloodstream infection (BSI), pneumonia, urinary tract infection (UTI), and surgical site infection (SSI) [CDC/NHSN 2023]. Adoption of these definitions reduces diagnostic variability and allows comparability across cohorts. High-sensitivity cardiac troponin (hs-cTn) is the biomarker of choice for detecting myocardial necrosis in ACS [ 5 6 7 8 9 10 11 12 However, in the PCI setting, evidence is conflicting. A multicenter Chinese cohort of non–ST-elevation ACS patients undergoing PCI [ 13 14 15 16 Understanding the relationship between hs-cTn and infection risk could refine early monitoring and guide supportive care. At the same time, it is important to distinguish between systemic inflammation, which may accompany myocardial injury, from true infection, which represents a separate pathological process with specific diagnostic criteria [ 17 18 19 20 21 Elevated hs-cTn levels have been observed not only in ACS but also in systemic infections such as influenza and COVID-19, where they are associated with adverse outcomes and systemic inflammatory responses [ 7 8 15 16 The aim of this study was to evaluate whether hs-cTn levels measured at 24- and 48-h post-PCI are associated with in-hospital infection in ACS patients, using CDC/NHSN-aligned infection definitions. In addition, we assessed correlations with classical inflammatory markers (CRP, ESR, and leukocyte count [ 17 18 19 20 21 2. Materials and Methods 2.1. Study Design and Setting This was a retrospective, single-center pilot study conducted at the Interventional Cardiology Unit of the University of Oradea Clinical Emergency Hospital (Oradea, Romania). This study included consecutive patients admitted with acute coronary syndrome (ACS) and treated with percutaneous coronary intervention (PCI) between January 2023 and December 2024. The study protocol was approved by the Institutional Review Board (approval no. 2379/21 January 2025). Given the retrospective design and use of anonymized data, a waiver of individual informed consent was granted. 2.2. Study Population Inclusion criteria: Age ≥ 18 years; ACS diagnosis confirmed by clinical presentation, ECG findings, and elevated hs-cTn above the 99th-percentile upper reference limit (URL), and undergoing successful PCI during the index hospitalization. Exclusion criteria: Active infection or fever at admission; Autoimmune disease, active malignancy, or immunosuppressive therapy; Missing hs-cTn or inflammatory marker values at 24-h or 48-h post-PCI; Major complications (e.g., surgery and mechanical circulatory support) are likely to confound the inflammatory status. STROBE flow diagram: A total of 224 patients with ACS undergoing PCI were screened. Of these, 43 were excluded (21 had incomplete biomarker data, 12 had infection at admission, 6 were on immunosuppressive therapy, and 4 had missing infection adjudication data), leaving 181 patients for the final analysis ( Figure 1 2.3. Outcome Definition: In-Hospital Infection The primary outcome was any in-hospital infection occurring between PCI and discharge (median surveillance window: 7 days, IQR 5–10). Infections were defined using CDC/NHSN criteria (2023) and classified as follows: Bloodstream infection (BSI); Pneumonia; Urinary tract infection (UTI); Surgical site infection (SSI). Each case was further categorized as a hospital-acquired infection (HAI) or present-on-admission (POA) using NHSN Chapter 2 criteria. Adjudication: Two independent physicians, blinded to troponin values, reviewed cases. Disagreements were resolved by consensus with a third reviewer. Of the 9 infections, 5 (55%) were microbiologically confirmed, while 4 (45%) were diagnosed clinically using CDC/NHSN-compatible criteria. We acknowledge that the reliance on clinical diagnosis without microbiological confirmation in nearly half of the cases increases the risk of outcome misclassification. 2.4. Index Test and Laboratory Assays High-sensitivity cardiac troponin (hs-cTn) was measured using the Roche Elecsys hs-cTnT (Roche Diagnostics GmbH, Mannheim, Germany) assay (5th generation), with the following analytical characteristics: Limit of detection: 3 ng/L; 99th-percentile URL: 14 ng/L; Coefficient of variation (CV) <10% at the URL. Here, hs-cTn was collected at 24 ± 4 h and 48 ± 4 h after PCI completion (sheath removal) and expressed in ng/L. Other biomarkers: C-reactive protein (CRP, mg/dL); Erythrocyte sedimentation rate (ESR, mm/h); Leukocyte count (×10 3 NT-proBNP (pg/mL). 2.5. Covariates and Confounding Potential confounders were pre-specified based on prior PCI infection risk models [ 18 19 Demographics (age and sex); Clinical characteristics (ACS type, Killip class, diabetes, chronic kidney disease [eGFR], and hemodynamic shock); Procedural characteristics (vascular access site, number of stents, procedure duration, and contrast volume); Peri-procedural exposures (mechanical ventilation, central venous or urinary catheters, and prophylactic antibiotics). Missing data were <5% for all variables and were handled by complete case analysis. Due to the very low number of infection events ( n 2.6. Sample Size Considerations Of the 181 patients, 9 (5.0%) developed infections. Given the events per variable (EPV) < 10, multivariable logistic regression would risk overfitting. We therefore restricted analyses to descriptive comparisons, univariate logistic regression, and ROC evaluation, and this study was explicitly framed as hypothesis-generating. The limited number of events is acknowledged as a major limitation, and future studies with larger cohorts are warranted [ 22 2.7. Statistical Analysis All analyses were performed using SPSS v30 (IBM Corp) and Python 3.10 statsmodels. Descriptive data are presented as mean ± SD or median (IQR) for continuous variables and as n Group comparisons (infected vs. non-infected) were made using the Mann–Whitney U test for continuous variables and Fisher’s exact test for categorical variables. Effect sizes were reported as mean/median differences with 95% CIs or odds ratios (ORs) with 95% CIs. Binary logistic regression (univariate) was used to evaluate the association between hs-cTn and infection, limited to univariate models only due to sample size constraints. ROC analysis was performed for hs-cTn48h, with AUC and bootstrapped 95% CIs (2000 resamples). Calibration was not formally assessed due to limited events and should be evaluated in larger cohorts. Correlations between hs-cTn and other biomarkers were evaluated using Spearman’s ρ with 95% CI. A p 3. Results 3.1. Study Population and Flow A total of 224 patients with ACS undergoing PCI were screened between January 2023 and December 2024; 43 were excluded (21 with incomplete biomarker data, 12 with infection at admission, 6 receiving immunosuppressive therapy/with active malignancy, and 4 missing infection adjudication), leaving 181 patients for analysis ( Figure 1 3.2. Demographics and Baseline Characteristics The study population included 181 patients diagnosed with acute coronary syndrome (ACS) and treated with percutaneous coronary intervention (PCI). Of these, 65.7% were male ( n n Laboratory data obtained at statistical admission revealed elevated levels of inflammatory and myocardial injury markers. The mean leukocyte count was 12.31 ± 4.15 × 10 3 3 3 Regarding myocardial injury, the initial hs-cTn level was markedly elevated, with a mean of 3223.07 ± 8644.81 ng/L, and with acute coronary syndrome. All baseline characteristics and continuous variables showed statistically significant deviation from the normal reference distribution ( p t Figure 2 3 3.3. Discrimination of hs-cTn48h for Infection Receiver operating characteristic (ROC) analysis for hs-cTn48h yielded AUC = 0.49 (95% CI, 0.30–0.68), indicating no discrimination, essentially equivalent to chance. The Youden-optimal cutoff in this cohort was ~1026 ng/L, but the corresponding sensitivity/specificity values were low and offered no clinical utility ( Figure 3 Supplementary Table S1 3.4. Troponin Distribution by Affected Coronary Artery This subsection analyzes the relationship between troponin levels and the location of coronary artery lesions. The bar chart displays the mean hs-cTn values for patients with involvement of the anterior descending artery, right-statistic coronary artery, and circumflex artery. Among these, the anterior descending artery (ADA) showed the highest mean troponin levels, reflecting the greater extent of myocardial damage typically associated with its occlusion. This pattern is consistent with the anatomical role of the ADA in supplying a large portion of the anterior left ventricular wall, which, when compromised, results in extensive myocardial necrosis and significantly elevated troponin levels. In contrast, lesions in the right coronary artery (RCA) and the circumflex artery (Cx) were associated with lower mean troponin values, suggesting either smaller infarct areas or more collateral circulation in these territories. Additionally, the repetition of artery names in Figure 4 3.5. ROC Analysis: hs-cTn as a Predictor of Infectious Risk To evaluate the potential of hs-cTn as a biomarker for post-interventional infection, a receiver operating characteristic (ROC) analysis was conducted using the 48-h post-PCI troponin values (hs-cTn48h). The analysis revealed an area under the ROC curve (AUC) of 0.49, indicating a lack of discriminatory power—essentially equivalent to random chance. Logistic regression models were univariate, evaluating hs-cTn24h, hs-cTn48h, CRP, ESR, and leukocytes individually as predictors of infection. The optimal cutoff point suggested by the Youden index was 1026.4 ng/L. However, predictive performance at this threshold was clinically irrelevant, with poor sensitivity and specificity values that do not support its use in risk stratification. The AUC for hs-cTn48h was 0.49, suggesting that troponin levels at 48-h post-PCI, rather than showing no association. These findings suggest that, in this cohort, elevated troponin levels at 48-h post-PCI are not associated with an increased risk of infection. Despite their role as reliable markers of myocardial necrosis, hs-cTn values appear insufficient for predicting susceptibility to infectious complications in the acute post-procedural phase. 3.6. Correlations Between hs-cTn and Systemic Biomarkers Notably, hs-cTn48h correlated weakly and non-significantly with CRP (ρ ≈ 0.13), ESR (ρ ≈ 0.12), and fibrinogen (ρ ≈ 0.13), but correlated modestly with NT-proBNP (ρ ≈ 0.23, p Figure 5 Table 1 In contrast, weak and nonsignificant-statistic positive correlations were found between hs-cTn48h and inflammatory markers: CRP: ρ = 0.126, p ESR: ρ = 0.119, p Fibrinogen: ρ = 0.134, p NT-proBNP: ρ = 0.232, p Correlations with inflammatory markers were weak and non-significant, while hs-cTn correlated modestly with NT-proBNP. This may reflect the link between myocardial injury and ventricular stress rather than systemic infection. Although none of these correlations reached statistical significance, their direction suggests a potential low-grade systemic inflammatory response accompanying myocardial necrosis. Taken together, the results indicate that NT-proBNP is more robustly associated with the extent of myocardial damage than inflammatory markers in the immediate post-PCI period. Troponin appears to reflect functional myocardial stress rather than systemic inflammation or risk of infection. Univariate odds ratios for selected biomarkers (hs-cTn24h, hs-cTn48h, and leukocyte counts at admission, post-PCI, and 48 h) are shown in Figure 6 4. Discussion In this pilot cohort of ACS patients undergoing PCI, hs-cTn levels measured at 24 h and 48 h did not predict in-hospital infection. ROC analysis for hs-cTn48h yielded an AUC of 0.49 (95% CI, 0.30–0.68), indicating non-informative performance and no discriminatory ability [ 12 23 24 25 26 27 28 29 30 31 24 25 26 27 28 29 30 31 32 33 34 Our results align with the established role of hs-cTn as the gold standard biomarker of myocardial necrosis, quantifying the extent of ischemia and infarction [ 5 6 34 14 35 Our results are consistent with the established literature: In sepsis and critical illness, troponin elevations are common and correlate with severity or mortality before adjustment, but often lose independent predictive value after controlling for confounders [ 28 36 37 In ACS, validated infection risk scores rely on clinical variables (age, Killip class, albumin, WBC count, vascular access, and device exposure) rather than hs-cTn [ 21 24 Several factors may explain this unexpected finding. First, patients with larger infarcts and higher hs-cTn levels may have received more intensive monitoring, early antibiotic prophylaxis, and invasive care pathways, reducing their infection risk. Second, some infections were likely catheter-associated or community-acquired and not directly related to infarct size or myocardial injury. Third, infection susceptibility may be more strongly driven by frailty, comorbidities (e.g., diabetes and chronic kidney disease), or procedural complexity, rather than the extent of necrosis reflected by troponin levels [ 23 24 25 26 27 Previous studies have reported associations between elevated troponin levels and systemic inflammation or infection, particularly in septic or critically ill populations [ 28 29 30 31 32 33 34 In this context, troponin alone appears insufficient to stratify infectious risk, reinforcing the multifactorial nature of post-PCI complications. Mechanistically, this discrepancy may be explained using the different biological origins of troponin release. In ACS, hs-cTn is released due to myocyte necrosis from ischemia-reperfusion injury, independent of infection risk. In systemic infections and sepsis, however, troponin elevations are thought to reflect multifactorial injury mechanisms, including inflammatory cytokine-mediated myocyte apoptosis, endothelial dysfunction, and microcirculatory failure. Therefore, the lack of association between hs-cTn and infection in our study is consistent with the pathophysiological distinction between ischemic necrosis and systemic inflammation [ 24 25 Multivariate adjustment for confounders (e.g., age, diabetes, baseline CRP, and renal function) was not performed due to the small number of infection cases, limiting model stability. Future studies with larger sample sizes are required to build adjusted risk models. Nearly half of infection cases were diagnosed clinically without microbiological confirmation, which may have resulted in diagnostic variability and underestimation or overestimation of infection incidence. Correlation analyses between hs-cTn and inflammatory markers (CRP, ESR, and leukocyte count) were weak or non-significant, further supporting the notion that myocardial injury and systemic infection are only partially overlapping processes in the early post-procedural phase [ 14 35 4.1. Possible Explanations Several factors may explain the absence of predictive value: outcome heterogeneity meaning nearly half of infections were clinically diagnosed without microbiological confirmation, increasing the risk of misclassification; small event count which refer to only nine infections (5%) precluded robust modeling and increased uncertainty in effect estimates; multifactorial risk representing that infection after PCI is more strongly driven by comorbidities, frailty, procedural exposures, and immune status than by infarct size or myocardial injury; clinical practice factors that explain that patients with higher hs-cTn (larger infarcts) may have received more intensive monitoring or early antibiotics, potentially mitigating infection risk. 4.2. Study Limitations This study has several important limitations. Its limited generalizability design restricts causal inference and generalizability. The small sample size ( n 4.3. Clinical Implications These findings indicate that hs-cTn should not be used as an infection risk marker in ACS patients following PCI. Instead, hs-cTn should continue to be interpreted strictly as a marker of myocardial necrosis, while infection risk assessment should rely on inflammatory biomarkers (e.g., CRP and leukocyte count) and standardized surveillance criteria, integrated with clinical and procedural risk factors. This study should be interpreted as hypothesis-generating rather than definitive. 5. Conclusions In this retrospective pilot cohort of ACS patients undergoing PCI, hs-cTn measured at 24 h and 48 h showed no predictive value for in-hospital infection. ROC analysis confirmed a non-informative AUC (≈0.49), and correlations with inflammatory markers were weak. These findings indicate that hs-cTn should continue to be interpreted solely as a marker of myocardial necrosis rather than infectious risk. Given the small sample size, limited events, and diagnostic variability, these results must be interpreted cautiously and viewed as hypothesis-generating. Larger, prospective studies are necessary before excluding the potential role for hs-cTn in infection risk stratification. This study demonstrates that hs-cTn48h is not a reliable predictor of infection risk in ACS patients undergoing PCI. These findings challenge the conventional assumption that higher myocardial injury equates to greater infectious vulnerability and emphasize the complexity of infection risk stratification in post-PCI care. Future multicenter, prospective studies incorporating microbiological adjudication, adjustment for clinical confounders, and expanded biomarker panels (e.g., procalcitonin and IL-6) are required to clarify mechanisms and establish reliable infection risk models after PCI. While hs-cTn remains essential for evaluating ACS severity, its role as an infection biomarker appears limited and should be interpreted with caution. Acknowledgments The authors would like to thank the University of Oradea for supporting the payment of the invoice through an internal project. Disclaimer/Publisher’s Note: Supplementary Materials The following supporting information can be downloaded at https://www.mdpi.com/article/10.3390/healthcare13182371/s1 Author Contributions Conceptualization, A.M.B. and T.C.G.; methodology, L.R.P.-R.; software, M.I.M.; validation, M.I.P.; formal analysis, M.C.G.; investigation, E.C.G.; resources, M.F.G.; data curation, T.C.G.; writing—original draft preparation, T.C.G.; writing—review and editing, T.C.G.; visualization, T.C.G.; supervision, T.C.G.; project administration, T.C.G. and P.M.; funding acquisition, T.C.G. and P.M. All authors have read and agreed to the published version of the manuscript. Institutional Review Board Statement This study was conducted in accordance with the Declaration of Helsinki and approved by the University of Oradea (approval number 2379, dated 21 January 2025). Informed Consent Statement Given the retrospective design using anonymized clinical data, the requirement for individual informed consent was waived by the Ethics Committee. Data Availability Statement All the data processed in this article are part of the research for a doctoral thesis, and are archived in the database of the corresponding author, where the interventions were performed. Conflicts of Interest The authors declare no conflicts of interest. References 1. Dadi N.C.T. Radochová B. Vargová J. Bujdáková H. Impact of healthcare-associated infections connected to medical devices-an update Microorganisms 2021 9 2332 10.3390/microorganisms9112332 34835457 PMC8618630 2. Tang X. Gong Y. Chen Y. Zhou Y. Wang Y. Impact of treatment management on the hospital stay in patients with acute coronary syndrome BMC Cardiovasc. Disord. 2024 24 630 10.1186/s12872-024-04304-0 39522008 PMC11549769 3. Kim H.I. Park S. Sepsis: Early recognition and optimized treatment Tuberc. Respir. Dis. 2019 82 6 14 10.4046/trd.2018.0041 PMC6304323 30302954 4. Papiol E. Ferrer R. Ruiz-Rodríguez J.C. Díaz E. Zaragoza R. Borges-Sa M. Berrueta J. Gómez J. Bodí M. Sancho S. Machine learning-based identification of risk factors for icu mortality in 8902 critically ill patients with pandemic viral infection J. Clin. Med. 2025 14 5383 10.3390/jcm14155383 40807005 PMC12346979 5. Lazar D.R. Lazar F.L. Homorodean C. Cainap C. Focsan M. Cainap S. Olinic D.M. High-sensitivity troponin: A review on characteristics, assessment, and clinical implications Dis. Markers 2022 2022 9713326 10.1155/2022/9713326 35371340 PMC8965602 6. Sandoval Y. Apple F.S. Mahler S.A. Body R. Collinson P.O. Jaffe A.S. on behalf of the International Federation of Clinical Chemistry and Laboratory Medicine Committee on the Clinical Application of Cardiac Biomarkers High-sensitivity cardiac troponin and the 2021 aha/acc/ase/chest/saem/scct/scmr guidelines for the evaluation and diagnosis of acute chest pain Circulation 2022 146 569 581 10.1161/CIRCULATIONAHA.122.059678 35775423 7. Lippi G. Sanchis-Gomar F. Cardiac troponin elevation in patients with influenza virus infections Biomed. J. 2021 44 183 189 10.1016/j.bj.2020.06.001 33097442 PMC8178554 8. Matteucci A. Massaro G. Sergi D. Bonanni M. Stifano G. Matino M. Zerillo B. Rogliani P. Romeo F. Electrocardiographic modifications and cardiac involvement in COVID-19 patients: Results from an italian cohort J. Cardiovasc. Med. 2021 22 190 196 10.2459/JCM.0000000000001166 33512975 9. Buckel M. Maclean P. Knight J.C. Lawler P.R. Proudfoot A.G. Extending the ‘host response’ paradigm from sepsis to cardiogenic shock: Evidence, limitations and opportunities Crit. Care 2023 27 460 10.1186/s13054-023-04752-8 38012789 PMC10683227 10. Babuin L. Jaffe A.S. Troponin: The biomarker of choice for the detection of cardiac injury Can. Med Assoc. J. 2005 173 1191 1202 10.1503/cmaj/051291 16275971 PMC1277047 11. Tucker B. Vaidya K. Cochran B.J. Patel S. Inflammation during percutaneous coronary intervention-prognostic value, mechanisms and therapeutic targets Cells 2021 10 1391 10.3390/cells10061391 34199975 PMC8230292 12. Qu C. Li X. Gao H. The impact of systemic inflammation response index on the prognosis of patients with st-segment elevation myocardial infarction undergoing percutaneous coronary intervention Rev. Cardiovasc. Med. 2023 24 153 10.31083/j.rcm2405153 39076749 PMC11273006 13. Roe M.T. Peterson E.D. Li Y. Pollack C.V. Jr. Christenson R.H. Peacock W.F. Fesmire F.M. Newby L.K. Jesse R.L. Hoekstra J.W. Relationship between risk stratification by cardiac troponin level and adherence to guidelines for non-st-segment elevation acute coronary syndromes Arch. Intern. Med. 2005 165 1870 1876 10.1001/archinte.165.16.1870 16157831 14. Sayed Masri S.N.N. Basri F. Yunus S.N. Cheah S.K. Cardiac troponin as a prognostic indicator for major adverse cardiac events in non-cardiac surgery: A narrative review Diagnostics 2025 15 1061 10.3390/diagnostics15091061 40361879 PMC12071672 15. Ansar W. Ghosh S. Inflammation and inflammatory diseases, markers, and mediators: Role of crp in some inflammatory diseases Biology of C Reactive Protein in Health and Disease Springer New Delhi, India 2016 16. Bholasingh R. Cornel J.H. Kamp O. van Straalen J.P. Sanders G.T. Dijksman L. Tijssen J.G. de Winter R.J. The prognostic value of markers of inflammation in patients with troponin t-negative chest pain before discharge from the emergency department Am. J. Med. 2003 115 521 528 10.1016/j.amjmed.2003.08.006 14599630 17. Brzezinski R.Y. Melloul A. Berliner S. Goldiner I. Stark M. Rogowski O. Banai S. Shenhar-Tsarfaty S. Shacham Y. Early detection of inflammation-prone stemi patients using the crp troponin test (ctt) J. Clin. Med. 2022 11 2453 10.3390/jcm11092453 35566579 PMC9105044 18. Murvai G.F. Ghitea T.C. Cavalu S. Comparing metabolic preconditioning and diabetes as risk factors in knee arthroplasty complications Cureus 2024 16 e56634 10.7759/cureus.56634 38646213 PMC11032089 19. Neagu O.M. Ghitea T. Marian E. Vlase L. Vlase A.M. Ciavoi G. Fehér P. Pallag A. Bácskay I. Nemes D. Formulation and characterization of mucoadhesive polymeric films containing extracts of taraxaci folium and matricariae flos Molecules 2023 28 4002 10.3390/molecules28104002 37241746 PMC10220881 20. Riley R.D. Ensor J. Snell K.I. Harrell F.E. Martin G.P. Reitsma J.B. Moons K.G. Collins G. Van Smeden M. Calculating the sample size required for developing a clinical prediction model BMJ 2020 368 m441 10.1136/bmj.m441 32188600 21. Chen P.-Y. Liu Y.-H. Duan C.-Y. Jiang L. Wei X.-B. Guo W. Chen J.-Y. Tan N. He P.-C. Pattern Group Impact of infection in patients with non-st elevation acute coronary syndrome undergoing percutaneous coronary intervention: Insight from a multicentre observational cohort from china BMJ Open 2020 10 e038551 10.1136/bmjopen-2020-038551 PMC7490952 32928861 22. Liu Y. Wang L. Chen P. Dai Y. Lin Y. Chen W. Xu Z. Zeng L. Fan H. Xue L. Risk estimation for infection in patients with st-segment elevation myocardial infarction undergoing percutaneous coronary intervention: Development and validation of a predictive score Front. Cardiovasc. Med. 2022 9 845307 10.3389/fcvm.2022.845307 35497986 PMC9051071 23. Zhang Y. Hao Y. Liu J. Yang N. Smith S.C. Huo Y. Fonarow G.C. Ge J. Morgan L. Sun Z. Percutaneous coronary intervention in patients with acute coronary syndromes and increased platelet count Arch. Cardiovasc. Dis. 2025 118 304 311 10.1016/j.acvd.2025.01.005 39984408 24. Murg S.I. Matiș L. Moldovan A.F. Popovici D.I. Negru A.G. Ghitea T.C. Popescu M.I. Association between advanced tnm stages and increased risk of cardiac dysfunction in patients with lvef < 50% Medicina 2025 61 301 10.3390/medicina61020301 40005419 PMC11857368 25. Murg S.I. Matiș L. Moldovan A.F. Schwarz-Madar A.F. Trifan D.F. Ghitea T.C. Popescu M.I. Cardiotoxicity in breast cancer: Impact of clinical classifications and treatment on heart health Cancers 2024 16 4281 10.3390/cancers16244281 39766180 PMC11674351 26. Zochios V. Valchanov K. Raised cardiac troponin in intensive care patients with sepsis, in the absence of angiographically documented coronary artery disease: A systematic review J. Intensive Care Soc. 2015 16 52 57 10.1177/1751143714555303 28979375 PMC5593290 27. Sharma Y. Horwood C. Chua A. Hakendorf P. Thompson C. Prognostic impact of high sensitive troponin in predicting 30-day mortality among patients admitted to hospital with influenza IJC Heart Vasc. 2021 32 100682 10.1016/j.ijcha.2020.100682 PMC7744942 33354619 28. Lorson W. Veve M.P. Heidel E. Shorman M.A. Elevated troponin level as a predictor of inpatient mortality in patients with infective endocarditis in the southeast united states BMC Infect. Dis. 2020 20 24 10.1186/s12879-019-4755-z 31914949 PMC6950987 29. Khaloo P. Shaqdan A. Ledesma P.A. Uzomah U.A. Galvin J. Ptaszek L.M. Ruskin J.N. Distinct etiologies of high-sensitivity troponin t elevation predict different mortality risks for patients hospitalized with COVID-19 Int. J. Cardiol. 2022 351 118 125 10.1016/j.ijcard.2021.12.029 34952038 PMC8690225 30. Daubert M.A. Jeremias A. The utility of troponin measurement to detect myocardial infarction: Review of the current findings Vasc. Health Risk Manag. 2010 6 691 699 10.2147/vhrm.s5306 20859540 PMC2941782 31. Maayah M. Grubman S. Allen S. Ye Z. Park D.Y. Vemmou E. Gokhan I. Sun W.W. Possick S. Kwan J.M. Clinical interpretation of serum troponin in the era of high-sensitivity testing Diagnostics 2024 14 503 10.3390/diagnostics14050503 38472975 PMC10930800 32. Garcia M.A. Rucci J.M. Thai K.K. Lu Y. Kipnis P. Go A.S. Desai M. Bosch N.A. Martinez A. Clancy H. Association between troponin i levels during sepsis and postsepsis cardiovascular complications Am. J. Respir. Crit. Care Med. 2021 204 557 565 10.1164/rccm.202103-0613OC 34038701 PMC8491250 33. Yildirim I. Hur E. Kokturk F. Inflammatory markers: C-reactive protein, erythrocyte sedimentation rate, and leukocyte count in vitamin d deficient patients with and without chronic kidney disease Int. J. Endocrinol. 2013 2013 802165 10.1155/2013/802165 23878538 PMC3710598 34. Che W. Jin Y. Chang S. Sun Y. Hou A. Wang C. Prediction of myocardial ischemia–reperfusion injury post-pci: Role of sst2 levels in stemi patients BMC Cardiovasc. Disord. 2025 25 280 10.1186/s12872-025-04708-6 40217168 PMC11987365 35. Apple F.S. Collinson P.O. Analytical characteristics of high-sensitivity cardiac troponin assays Clin. Chem. 2012 58 54 61 10.1373/clinchem.2011.165795 21965555 36. Gajardo A.I.J. Ferrière-Steinert S. Jiménez J.V. Araya S.H. Carvajal T.K. Ramos-Rojas J. Medel J.N. Early high-sensitivity troponin elevation and short-term mortality in sepsis: A systematic review with meta-analysis Crit. Care 2025 29 76 10.1186/s13054-025-05249-2 39953561 PMC11829436 37. Djuric O. Markovic-Denic L. Jovanovic B. Bumbasirevic V. Agreement between cdc/nhsn surveillance definitions and ecdc criteria in diagnosis of healthcare-associated infections in serbian trauma patients PLoS ONE 2018 13 e0204893 10.1371/journal.pone.0204893 30286119 PMC6171870 Figure 1 Flow diagram. Figure 2 Demographics and baseline characteristics. ( A B 3 Figure 3 ROC curve for hs-cTn48h predicting in-hospital infection. ROC analysis demonstrated no discriminatory power (AUC = 0.49, 95% CI: 0.30–0.68). The shaded area represents the 95% confidence interval, based on 2000 bootstrap resamples. Figure 4 Mean troponin levels according to affected coronary artery. This bar chart displays the average hs-cTn values associated with lesions in the anterior descending, right coronary, and circumflex arteries. Elevated troponin levels are most pronounced in patients with anterior descending artery involvement, consistent with its role in supplying a larger portion of the left ventricle. Figure 5 Correlation between hs-cTn48h and NT-proBNP. Scatterplot with LOWESS smoothing demonstrates a modest positive correlation (ρ = 0.23 and p Figure 6 Univariate odds ratios for in-hospital infection. Forest plot displaying odds ratios (OR) with 95% confidence intervals for selected biomarkers, comparing high vs. low values (defined by a median split). The vertical dashed line represents the null value (OR = 1). While elevated leukocyte counts showed numerically higher ORs, all estimates had wide confidence intervals and crossed unity, indicating no statistically significant associations. Both hs-cTn24h and hs-cTn48h demonstrated no predictive value for infection risk in this cohort. Calibration analysis was omitted due to insufficient events. healthcare-13-02371-t001_Table 1 Table 1 Baseline demographic and clinical characteristics stratified using the in-hospital infection status. We report standardized differences rather than p Parameter Infection ( n No Infection ( n Std. Diff Gender, male 6 (66.7%) 113 (65.7%) 0.02 Environment, urban 5 (55.6%) 0.07 Age, years (mean ± SD) 64 ± 12 63 ± 11 0.09 Leukocytes at admission (×10 3 13.2 ± 4.8 12.3 ± 4.1 0.22 Neutrophils at admission (×10 3 9.7 ± 4.0 9.1 ± 3.8 0.16 Lymphocytes at admission (×10 3 3.4 ± 4.8 3.6 ± 5.0 0.04 hs-cTn at admission (ng/L, median [IQR]) 2850 [1300–7500] 3200 [1150–8600] 0.11 Std. Diff = standardized difference. hs-cTn = high-sensitivity cardiac troponin. ",
  "metadata": {
    "Title of this paper": "Agreement between cdc/nhsn surveillance definitions and ecdc criteria in diagnosis of healthcare-associated infections in serbian trauma patients",
    "Journal it was published in:": "Healthcare",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12469657/"
  }
}