{
  "title": "Paper_124",
  "abstract": "pmc Acta Clin Croat Acta Clin Croat 3604 actaclincroat ACC Acta Clinica Croatica 0353-9466 1333-9451 Sestre Milosrdnice University Hospital Center PMC12490469 PMC12490469.1 12490469 12490469 10.20471/acc.2024.63.03-04.24 acc-63-647 1 Original Scientific Papers LYMPHOSCINTIGRAPHY IN LYMPHEDEMA Iskra Igor  1 Bogović Crnčić Tatjana  1  2 Girotto Neva  1  2 1 Clinical Department of Nuclear Medicine University Hospital Center Rijeka Croatia 2 Department of Nuclear Medicine, Faculty of Medicine University of Rijeka Rijeka Croatia Correspondence to: Assoc. Prof. Tatjana Bogović Crnčić, MD, PhD tatjanabc@uniri.hr 12 2024 12 2024 63 3-4 498197 647 655 06 3 2023 28 6 2023 01 12 2024 03 10 2025 03 10 2025 Sestre Milosrdnice University Hospital 2024 Sestre Milosrdnice University Hospital https://creativecommons.org/licenses/by-nc-nd/4.0/ This is an open-access article distributed under the terms of the Creative Commons Attribution Non-Commercial No Derivatives (CC BY-NC-ND) 4.0 License. SUMMARY Lymphedema is a chronic, progressive condition caused by impaired lymphatic transport, leading to edema in the lower and/or upper extremities, depending on the underlying cause. The diagnosis is based on clinical examination, ultrasound findings, and imaging tests. Treatment is mostly conservative, usually long-term, and often yielding unsatisfactory results. Recently, surgical options have also become available. Lymphoscintigraphy, a non-invasive and simple nuclear medicine imaging technique, is considered the method of choice in diagnostic workup. It consists of intracutaneous or subcutaneous application of colloidal particles labelled with radioactive technetium-99m and two-dimensional or three-dimensional gamma camera imaging. Lymphoscintigraphy helps differentiate lymphedema from edema of another origin, assess disease severity, and evaluate surgery outcome. However, the procedure is not fully standardized, especially in terms of semiquantitative methods, which are additionally used in disease staging; however, their implementation varies depending on local experience and expertise. Keywords: Lymphedema lymphoscintigraphy technetium Tc 99m-nanocolloid pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement no pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes Introduction Lymphedema is a chronic disease characterized by tissue swelling caused by impaired transport of lymphatic fluid ( 1 3 4 5 1 3 Mb Milroy l. praecox l. tardum 3 6 3 6 According to the International Society of Lymphology, lymphedema is classified into three stages ( Table 1 7 8 Table 1 Clinical staging of lymphedema  STAGE 0 Clinically normal extremity with confirmed lymph transport impairment  STAGE 1 Early edema that subsides with elevation of extremity  STAGE 2 Pitting edema that rarely subsides with elevation of extremity; in late stage 2, pitting may not be present  STAGE 3 Lymphostatic elephantiasis, usually without pitting, accompanied by trophic skin changes Patients with lymphedema can also have recurring infections. Treatment is typically long-term and conservative, with moderate success, which consists of slowing down the natural progression of the disease. Recently, there have been some advances in surgical methods, such as lymphovenous anastomosis and free functional lymphatic transfer, which include different flap procedures ( 9 Diagnosis of lymphedema In most cases, an accurate diagnosis of lymphedema can be made based on the clinical history and physical examination of the patient ( 4 1 4 6 9 Therefore, lymphedema should be accurately diagnosed as soon as possible. If clinical presentation is not reliable enough, ultrasound examination should be performed as the first step in the diagnostic process, with color Doppler to exclude vascular abnormalities. Radiological lymphography using direct injection of oil-based contrast into lymph vessels is now considered obsolete. Magnetic resonance imaging (MRI) and/or computerized tomography (CT) are used as additional diagnostic methods ( 7 8 10 7 10 7 10 A more recent diagnostic method, fluorescence lymphography, includes subcutaneous injection of the combination of fluorescent sodium and indocyanine green (ICG). ICG activation by infrared emission causes fluorescence, which can be detected with infrared camera ( 4 10 Lymphoscintigraphy The most valuable and definitive diagnostic test for lymphedema is lymphoscintigraphy ( 1 4 1 4 6 8 99m 1 4 6 8 11 6 11 The procedure Patient preparation is not needed. Lymphoscintigraphy of lower extremities is usually performed with human serum albumin (HSA) nanocolloid particles radiolabeled with 99m The procedure used in our institution involves two separate syringes, each containing 0.2-0.3 mL of around 37 MBq of technetium-labelled nanocolloid, which are simultaneously injected subcutaneously into the first interdigital space (between the first and second toes) of each foot ( Fig. 1 Fig. 2 Fig. 1 Subcutaneous administration of 99mTc-nanocolloid in the first interdigital space of each foot. Fig. 2 Lymphoscintigraphy – normal findings: whole body images in anterior and posterior projection 30 and 60 minutes after the subcutaneous administration of 99mTc nanocolloid in the first interdigital space of each foot. At 30 minutes (A), symmetrical lymph paths through both legs and bilateral accumulation of 99mTc nanocolloid in the inguinal lymph nodes is registered. At 60 minutes (B), accumulation in the iliac and abdominal lymph nodes and liver can be seen. When lymphedema of arms is suspected, the tracer is injected in the first interdigital space of each hand and lymphatic flow is followed by adjusting gamma camera field of view. It can start with both arms beside the body or laid on the collimator ( Fig. 3 Fig. 3 Positioning of the patient for lymphoscintigraphy of the upper extremities after the subcutaneous administration of 99mTc nanocolloid in the first interdigital space of each hand. The imaging is usually completed within 2–3 hours. Single-photon emission computed tomography/ computed tomography (SPECT/CT) of a specific region is performed when nanocolloid accumulation shows unusual pattern to check for possible morphological changes. The interpretation If lymphatic anatomy and function are normal, lymphatic transport of radiotracer should be symmetrical and lymphatic vessels should be visualized as a single path throughout the leg, leading to the respective femoral/inguinal regions. Femoral and inguinal lymph nodes on each side should be visible within 20 minutes from injection. Their number and appearance should be symmetrical, with iliac and abdominal nodes seen in continuation ( 12 12 In patients with primary lymphedema, mostly bilateral poor or non-visualization of lymph vessels, and/or lymph nodes can be noted ( Fig. 4 Fig. 5 Fig. 6 2 4 6 8 11 12 Fig. 4 Lymphoscintigraphy: Whole body images in anterior and posterior projection of an 18-year-old girl with a history of repetitive pleural effusions (chylothorax) and persistent edema of both legs few years after surgical ligation of the thoracic duct ( 22 Fig. 5 Lymphoscintigraphy: Whole body images in anterior and posterior projection of a 64-year-old woman with a history of the right leg swelling, skin changes, and recurrence of erysipelas of the right foot. Previously she had trauma of the right leg and implantation of endoprostheses in the left hip and right knee. At the time of imaging, she was free of symptoms on the left side. Lymph vessels and nodes are poorly visualized on the right side, and a popliteal lymph node on the left side can be seen due to bilateral secondary lymphedema. Fig. 6 Lymphoscintigraphy: Whole body images in anterior and posterior projection of a 70-year-old woman with two years of history of left leg swelling, major pelvic surgery 10 years ago, and left thigh trauma in childhood (possible muscle rupture). Lymph vessels and nodes are poorly visualized on the left side, with extensive dermal backflow in the left thigh due to unilateral secondary lymphedema. To facilitate the evaluation of lymphoscintigraphy findings, several staging and scoring systems have been proposed ( Table 2 4 13 et al. 14 et al. 6 15 Table 2 Examples of lymphoscintigraphy staging: A – Lymphoscintigraphy staging from Lee and Bergan (15), B – Evaluation of transport index (13), C – Taiwan lymphoscintigraphy staging (4)  A Lymphoscintigraphy staging by Lee and Bergan Degree of lymph node uptake Presence of dermal backflow Visualization of collateral lymphatics Visualization of main lymphatics Clearance of tracer from injection site Grade I / none good decreased decreased Grade IIa none < half of each limb decreased poor or no visualization greater decrease Grade IIb none > half of each limb decreased poor or no visualization greater decrease Grade III none present poor none visualized no clearance Grade IV none poor or no visualization none visualized none visualized no clearance NB: A minimum of two or more findings are required for staging  B Evaluation of Transport index (TI) on lymphoscintigrams K D T N V 0 points no delay normal distribution n clearly demonstrated clearly demonstrated 3 points low-grade delay partially diffuse faint visualization faint visualization 5 points extreme delay diffuse hardly recognizable hardly recognizable 9 points no transport transport stop no appearance no visualization no visualization TI = K + D + 0.04xT + N + V  C Taiwan lymphoscintigraphy staging L-0 normal lymphatic drainage P-1 decreased linear lymphatic ducts without dermal backflow P-2 dilated distal lymphatic ducts with proximal or distal dermal backflow P-3 entire dermal backflow T-4 no lymphatic ducts visible and presence of distal dermal backflow T-5 no lymphatic ducts visible and presence of entire dermal backflow T-6 no movement of injected radiotracer L-0: normal lymphatic drainage; P-1, P-2, P-3: partial obstruction; T-4, T-5, T-6: total obstruction The methods proposed by Pecking ( 16 17 16 et al. 18 The authors of editorial, Pappalardo and Cheng ( 4 Discussion Lymphedema is a chronic and debilitating condition manifesting as unilateral or bilateral limb swelling, which can be congenital or acquired. Initially, edema resolves with rest, but as it progresses to proximal parts of the extremity, it remains present to some degree. Later, swelling cannot be reduced without treatment. Finally, irreversible, chronic skin changes develop and patients suffer from repeated infections. Management of lymphedema is difficult, requires multidisciplinary approach, and is frequently unrewarding. The diagnosis is based on patient history, physical examination, and diagnostic test results. Lymphoscintigraphy is a simple, non-invasive nuclear medicine procedure used to differentiate extremity lymphedema from edema of another origin, assess lymphatic drainage, identify patients at high risk of developing lymphedema after lymph node dissection, and semi-quantify lymphatic flow. The presence of specific features, such as absent radiotracer progression from the injection site, absent lymph node visualization, dermal backflow, or visualization of collateral lymphatics, can be considered specific for lymphedema. Lymphoscintigraphy can also help in assessing the number and functional status of regional lymph nodes and patent communication between lymphatic and venous system. Its sensitivity is 70%–96%, but when combined with quantitative data, it may reach 100%. Specificity even without quantification analysis reaches 100% ( 11 19 20 1 21 Other diagnostic imaging procedures have lower diagnostic sensitivity and specificity in lymphedema, but they can provide additional data on morphology and vasculature ( 4 1 Quantification methods listed in this article can increase the sensitivity and are a helpful tool in some equivocal cases; however, their implementation depends on physician’s individual experience and expertise ( 4 4 13 Conclusion Lymphoscintigraphy is a non-invasive nuclear medicine procedure with an excellent safety profile, which makes it acceptable even in newborns and infants. It should be the first-choice procedure for lymphedema evaluation because it is easy to perform and has high sensitivity and specificity. However, the procedure has not been standardized, and the use of semiquantitative methods, which could improve specificity, depends on local experience and expertise. References 1 Hassanein AH Maclellan RA Grant FD Greene AK Diagnostic accuracy of lymphoscintigraphy for lymphedema and analysis of false-negative tests. Plast Reconstr Surg Glob Open 2017 5 7 e1396 10.1097/GOX.0000000000001396 28831342 PMC5548565 2 Kalawat TC Chittoria R Reddy P Suneetha B Narayan R Ravi P Role of lymphoscintigraphy in diagnosis and management of patients with leg swelling of unclear etiology. Indian J Nucl Med 2012 27 4 226 30 10.4103/0972-3919.115392 24019651 PMC3759082 3 Moshiri M Katz DS Boris M Yung E Using lymphoscintigraphy to evaluate suspected lymphedema of the extremities. AJR Am J Roentgenol 2002 178 405 12 10.2214/ajr.178.2.1780405 11804905 4 Pappalardo M Cheng MH Lymphoscintigraphy for the diagnosis of extremity lymphedema: Current controversies regarding protocol, interpretation, and clinical application. J Surg Oncol 2020 121 1 37 47 10.1002/jso.25526 31209893 5 Smeltzer DM Stickler GB Schirger A Primary lymphedema in children and adolescents: a follow-up study and review. Pediatrics 1985 76 2 206 18 4022694 6 Szuba A Shin WS Strauss W Rockson S The third circulation: radionuclide lymphoscintigraphy in the evaluation of lymphedema. J Nucl Med 2003 44 1 43 57 12515876 7 Executive Committee of the International Society of Lymphology The diagnosis and treatment of peripheral lymphedema: 2020 Consensus Document of the International Society of Lymphology. Lymphology 2020 53 1 3 19 32521126 8 Greene AK Goss JA Diagnosis and Staging of Lymphedema. Semin Plast Surg 2018 32 12 6 10.1055/s-0038-1635117 29636648 PMC5891654 9 Lin WC Safa B Buntic RF Approach to lymphedema management. Semin Plast Surg 2022 36 4 260 73 10.1055/s-0042-1758691 36561430 PMC9762993 10 van Heumen S Riksen JJM Bramer WM van Soest G Vasilic D Imaging of the lymphatic vessels for surgical planning: a systematic review. Ann Surg Oncol 2023 30 1 462 79 [Erratum in: Ann Surg Oncol. 2022 Dec;29] [Suppl 3] [:628. doi. org/10.1245/s10434-022-12552-7] 10.1245/s10434-022-12552-7 36171528 PMC9726677 11 Keeley V The use of lymphoscintigraphy in the management of chronic oedema. J Lymphoedema 2006 1 42 57 12 Sadeghi R Kazemzadeh G Keshtgar M Diagnostic application of lymphoscintigraphy in the management of lymphoedema. Hell J Nucl Med 2010 13 1 6 10 20411162 13 Kleinhans E Baumeister RH Hahn D Siuda S Büll U Moser E Evaluation of transport kinetics in lymphoscintigraphy: follow-up study in patients with transplanted lymphatic vessels. Eur J Nucl Med 1985 10 7-8 349 52 10.1007/BF00251310 4006977 14 Cambria RA Gloviczki P Naessens JM Wahner HW Noninvasive evaluation of the lymphatic system with lymphoscintigraphy: a prospective, semiquantitative analysis in 386 extremities. J Vasc Surg 1993 18 5 773 82 10.1016/0741-5214(93)90331-F 8230563 15 Lee BB Bergan JJ New clinical and laboratory staging system to improve management of chronic lymphedema. Lymphology 2005 38 3 122 9 16353489 16 Pecking AP Albérini JL Wartski M Edeline V Cluzan RV Relationship between lymphoscintigraphy and clinical findings in lower limb lymphedema (LO): toward a comprehensive staging. Lymphology 2008 41 1 1 10 18581953 17 Maegawa J Mikami T Yamamoto Y Satake T Kobayashi S Types of lymphoscintigraphy and indications for lymphati-covenous anastomosis. Microsurgery 2010 30 6 437 42 10.1002/micr.20772 20878726 18 Ebrahim M Savitcheva I Axelsson R Reliability of a scoring system for qualitative evaluation of lymphoscintigraphy of the lower extremities. J Nucl Med Technol 2017 45 3 219 24 10.2967/jnmt.116.185710 28473462 19 Gloviczki P Calcagno D Schirger A Pairolero PC Cherry KJ Hallett JW Noninvasive evaluation of the swollen extremity: experiences with 190 lymphoscintigraphic examinations. J Vasc Surg 1989 9 5 683 9 10.1016/S0741-5214(89)70040-9 2724456 20 Rockson SG Advances in lymphedema. Circ Res 2021 128 12 2003 16 10.1161/CIRCRESAHA.121.318307 34110905 21 Fujiyoshi T Mikami T Hashimoto K Asano S Adachi E Kagimoto S Pathological changes in the lymphatic system of patients with secondary lower limb lymphedema based on single photon-emission computed tomography/ computed tomography/lymphoscintigraphy images. Lymphat Res Biol 2022 20 2 144 52 10.1089/lrb.2021.0040 34415778 PMC9081006 22 Leović D Pastorčić Grgić M Gugić Radojković I Blivajs I Matoc L Gršić K Management of chyle leak following head and neck surgery: review of current treatment strategies and algorithmic approach to the treatment. Acta Clin Croat 2022 61 88 95 10.20471/acc.2022.61.s4.11 37250658 PMC10218081 ",
  "metadata": {
    "Title of this paper": "Management of chyle leak following head and neck surgery: review of current treatment strategies and algorithmic approach to the treatment.",
    "Journal it was published in:": "Acta Clinica Croatica",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12490469/"
  }
}