{
  "title": "Paper_1200",
  "abstract": "pmc PLoS One PLoS One 440 plosone plos PLOS One 1932-6203 PLOS PMC12468984 PMC12468984.1 12468984 12468984 41004439 10.1371/journal.pone.0330653 PONE-D-24-55239 1 Research Article Medicine and Health Sciences Oncology Cancers and Neoplasms Carcinoma Hepatocellular Carcinoma Medicine and Health Sciences Oncology Cancers and Neoplasms Gastrointestinal Tumors Hepatocellular Carcinoma Medicine and Health Sciences Gastroenterology and Hepatology Liver Diseases Hepatocellular Carcinoma Medicine and Health Sciences Oncology Cancers and Neoplasms Medicine and Health Sciences Oncology Cancers and Neoplasms Malignant Tumors Medicine and Health Sciences Oncology Cancer Treatment Medicine and Health Sciences Nephrology Renal Cancer Medicine and Health Sciences Oncology Cancers and Neoplasms Gastrointestinal Tumors Gastric Cancer Biology and Life Sciences Genetics Gene Expression Biology and life sciences Molecular biology Molecular biology techniques Sequencing techniques RNA sequencing Research and analysis methods Molecular biology techniques Sequencing techniques RNA sequencing Regulatory influence of α-Pinene on MATN3 expression in hepatocellular carcinoma: Extending to pan-cancer analysis α-Pinene’s effect on MATN3 across cancers Zhao Binyu Conceptualization Methodology Writing – original draft  1  2 Qiu Wenliang Data curation Formal analysis  2 Xu Wenhui Data curation Formal analysis  2 Wu Lixin Investigation Validation  2 Zhao Jiayin Investigation Validation  2 Zhao Haocheng Software Visualization  3 Wei Fengxiang Funding acquisition Project administration Supervision Writing – review & editing  4 * https://orcid.org/0009-0008-6550-3166 Qiu Bing Funding acquisition Project administration Supervision Writing – review & editing  2 * 1 Jiamusi University, Jiamusi City, Heilongjiang Province, China 2 Department of Gastroenterology, Heilongjiang Provincial Hospital, Harbin City, Heilongjiang Province, China 3 Mudanjiang Medical University, Mudanjiang City, Heilongjiang Province, China 4 The Genetics Laboratory, Longgang District, Maternity & Child Healthcare Hospital of Shenzhen, Guangdong Province, China Zakki Shahbaz Ahmad Editor  The University of Haripur, PAKISTAN Competing Interests: * E-mail: haowei727499@163.com qiubing@fsu.edu.pa 26 9 2025 2025 20 9 496058 e0330653 2 12 2024 23 7 2025 26 09 2025 27 09 2025 27 09 2025 © 2025 Zhao et al 2025 Zhao et al https://creativecommons.org/licenses/by/4.0/ This is an open access article distributed under the terms of the Creative Commons Attribution License In the search for novel therapeutic strategies against cancer, natural compounds such as α-Pinene, a bioactive monoterpene predominantly found in coniferous trees, have emerged as potential modulators of oncogenic processes. The primary objective of this study was to investigate whether α-Pinene can regulate the expression of MATN3 (Matrilin-3), a gene previously associated with poor prognosis in various cancers. Our central hypothesis is that α-Pinene exerts its anticancer effects, at least in part, by downregulating MATN3, thereby impacting oncogenic signaling. The rationale for selecting MATN3 as a target lies in its demonstrated overexpression in multiple cancer types and its established role as both a prognostic marker and a contributor to tumor progression. Extending our research through a comprehensive pan-cancer analysis, we confirmed the association between high MATN3 expression and poor prognosis across multiple cancer types. Further exploration revealed a strong correlation between MATN3 expression and immune infiltration, as well as significant associations with key immunomodulatory genes, suggesting an intricate role of MATN3 in the tumor immune environment. Enrichment analysis pointed to the involvement of MATN3 in the PI3K-AKT signaling pathway. Additionally, we identified connections between MATN3 and extracellular matrix (ECM)-related mechanisms.The downregulation of MATN3 by α-Pinene in HepG2 cells suggests a novel mechanism by which α-Pinene may exert anticancer effects, potentially through the disruption of key oncogenic and immune-related pathways. This study not only underscores the anticancer potential of α-Pinene but also establishes MATN3 as a critical target and biomarker across a spectrum of cancers. Our findings advocate for further clinical investigations into α-Pinene’s therapeutic potential, particularly focusing on its impact on MATN3 and related pathways in diverse cancer contexts. Heilongjiang Provincial Postdoctoral Science Foundation Project LBH-Z15152 Heilongjiang Provincial Postdoctoral Research Initiation Fund LBH-Q17160 This research was funded by Heilongjiang Provincial Postdoctoral Science Foundation Project (LBH-Z15152) and Heilongjiang Provincial Postdoctoral Research Initiation Fund (LBH-Q17160). The funders had no role in study design, data collection and analysis, decision to publish, or preparation of the manuscript. pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement yes pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes Data Availability TCGA: Data were obtained via UCSC Xena (GDC TCGA hub; “TCGA Pan-Cancer (PANCAN) gene expression RNA-seq” HTSeq counts/FPKM/TPM) and the GDC Data Portal; DOI 10.1038/ng.2764; no single accession ( https://xenabrowser.net/datapages/?cohort=TCGA%20Pan-Cancer%20(PANCAN)) https://xenabrowser.net/datapages/?cohort=TCGA%20TARGET%20GTEx) https://sites.broadinstitute.org/ccle) https://www.cbioportal.org) https://ngdc.cncb.ac.cn/omix/release/OMIX011684) Data Availability TCGA: Data were obtained via UCSC Xena (GDC TCGA hub; “TCGA Pan-Cancer (PANCAN) gene expression RNA-seq” HTSeq counts/FPKM/TPM) and the GDC Data Portal; DOI 10.1038/ng.2764; no single accession ( https://xenabrowser.net/datapages/?cohort=TCGA%20Pan-Cancer%20(PANCAN)) https://xenabrowser.net/datapages/?cohort=TCGA%20TARGET%20GTEx) https://sites.broadinstitute.org/ccle) https://www.cbioportal.org) https://ngdc.cncb.ac.cn/omix/release/OMIX011684) Introduction In the relentless pursuit of innovative cancer therapeutics, the exploration of natural compounds has unveiled promising avenues for intervention [ 1 2 3 6 7 6 8 12 13 MATN3 is correlated with patient survival in several cancers, particularly in gastric cancer, where it may play a pivotal role. However, the potential functions of MATN3 have not been discovered in a broader array of tumors [ 14 18 19 Method Data acquisition We obtained the expression data for MATN3 in both cancerous and normal tissues from the TCGA (The Cancer Genome Atlas) and GTEx (Genotype-Tissue Expression) datasets through the XENA database ( https://xenabrowser.net/ 20 https://sites.broadinstitute.org/ccle/ 21 https://www.cbioportal.org/ https://xenabrowser.net/datapages/?cohort=TCGA%20Pan-Cancer%20(PANCAN GTEx: We used GTEx RNA-seq gene expression from the GTEx Portal and UCSC Xena (GTEx hub; “GTEx RNA-seq”); DOI 10.1126/science.aaz1776; no accession number ( https://xenabrowser.net/datapages/?cohort=TCGA%20TARGET%20GTEx CCLE: RNA-seq expression from the DepMap/CCLE resource with accession PRJNA523380 and DOI 10.1038/s41586-019-1186-3; retrieval via DepMap → Data → Downloads → “CCLE_expression” with matching annotations ( https://sites.broadinstitute.org/ccle cBioPortal: Portal used to access harmonized matrices and clinical/alteration summaries; no accessions or DOIs ( https://www.cbioportal.org OMIX (this study): RNA-seq count data from HepG2 after 24 h α-Pinene (50 μM) treatment are deposited under OMIX011684; file “OMIX011684-01 Count Data”; BioProject PRJCA042366; no DOI ( https://ngdc.cncb.ac.cn/omix/release/OMIX011684 Survival analysis We downloaded curated clinical data from the XENA database, which includes survival information for all TCGA patients [ 20 22 Tumor heterogeneity Drawing upon previous literature [ 23 24 25 24 26 Immune infiltration and immune genes We employed three distinct algorithms—EPIC, ESTIMATE, and TIMER—to calculate immune cell infiltration scores for each sample [ 27 31 For immune-related genes, we referenced previous studies to obtain corresponding gene expression matrices from the XENA database [ 23 32 33 Protein interaction network Using the STRING (Search Tool for the Retrieval of Interacting Genes/Proteins) database ( https://cn.string-db.org/ 34 37 Enrichment and differential analysis We conducted enrichment analysis using the “clusterProfiler” package [ 38 39 Cell culture Two hepatocellular carcinoma (HCC) cell lines, HepG2 and Hep3B, were employed in this study. The cells were procured from MeisenCTCC. Both cell lines were cultured in Eagle’s Minimum Essential Medium (EMEM) (MeisenCTCC, Cat. CTCC-009–011) supplemented with 10% fetal bovine serum (FBS) (GIBCO, Cat. 10099141C) and 1% Penicillin-Streptomycin (Invitrogen, Cat. 15140−122). The cell cultures were maintained at 37°C in an environment containing 5% carbon dioxide. Cell proliferation assay We conducted cell proliferation assays using the CCK8 (Cell Counting Kit-8) kit (Biosharp, Cat. BS350B CCK8). The cells were treated with varying concentrations of α-Pinene (MCE, Cat. HY-N0549), and post-treatment cell viability was compared with the control group. Cells were treated with α-Pinene at concentrations of 0, 25, 50, and 100 μM. These concentrations were selected based on preliminary dose-response studies [ 7 10 12 RNA extraction and RT-qPCR RNA was extracted using Trizol reagent (Thermo Fisher, Cat. 15596026). Reverse transcription was performed with the Go Script Reverse Transcription System (Promega, Cat. A5000-1). Quantitative PCR (qPCR) was carried out using the GoTaq qPCR Master Mix (Promega, Cat. A6001). All procedures were conducted according to the manufacturers’ protocols. The primer sequences for MATN3 (5’-3’) are as follows: Forward Primer: TCTCCCGGATAATCGACACTC Reverse Primer: CAAGGGTGTGATTCGACCCA The primer sequences for GAPDH (5’-3’) are as follows: Forward Primer: GTCTCCTCTGACTTCAACAGCG Reverse Primer: ACCACCCTGTTGCTGTAGCCAA Western blot Cells were treated with DMSO (Dimethyl Sulfoxide) as control, 50 μM α-Pinene, or 100 μM α-Pinene for 24 hours. Total protein was extracted using RIPA lysis buffer supplemented with protease and phosphatase inhibitors (Beyotime, China). Protein concentrations were determined by BCA protein assay kit (Beyotime, China), and equal amounts of protein were separated by SDS-PAGE and transferred to PVDF membranes (Millipore, USA). Membranes were blocked with 10% non-fat milk in TBST for 1 hour at room temperature and then incubated overnight at 4°C with the following primary antibodies: PI3 Kinase p85 (CST#4292), Phospho-PI3 Kinase p85 (CST#4228), AKT (abclonal#A18675), Phospho-AKT (abclonal#AP0637), MATN3 (abclonal#A7700), GAPDH (abclonal#AC002, loading control). After washing, membranes were incubated with HRP-conjugated secondary antibodies for 1 hour at room temperature. Protein bands were visualized using enhanced chemiluminescence reagents. RNA-sequencing α-Pinene was added to normally cultured HepG2 cells to a final concentration of 50 μM. After 24 hours of treatment, RNA was extracted from both the treated and control groups. The extracted RNA was then sent to Novogene ( https://cn.novogene.com/ Ethical statement No human or animal samples were involved in this study. Therefore, ethical approval was not required. Statistical analysis All experiments were performed in triplicate using independent replicates (n = 3). Data are presented as mean ± standard deviation (SD). Statistical analyses were conducted using GraphPad Prism. For comparisons between two groups, an unpaired Student’s t-test was applied. For more than two groups, the ANOVA test was applied. P-value less than 0.05 was considered statistically significant. Result α-Pinene Inhibits HCC Cell Growth and Reduces MATN3 Expression In our investigation into the anticancer effects of α-Pinene, we initially assessed its impact on the proliferation of hepatocellular carcinoma cell lines, HepG2 and Hep3B. Employing CCK8 cell viability assay, we established that α-Pinene significantly inhibited cell growth in a dose-dependent manner ( Fig 1A B 10.1371/journal.pone.0330653.g001 Fig 1 The impact of α-Pinene on hepatocellular carcinoma cell lines. (A-B) α-Pinene inhibit HepG2 and Hep3B cell proliferation. (C) (D) Subsequent RNA sequencing of α-Pinene-treated HepG2 and Hep3B cells revealed a notable downregulation of MATN3 ( Fig 1C D S1 File These results not only reinforce the potential of α-Pinene as an antiproliferative agent against HCC but also highlight its ability to modulate gene expression, specifically reducing levels of MATN3, which is implicated in tumor cell survival and immune escape. Aberrant Expression of MATN3 Across Various Cancers Building on the findings that α-Pinene effectively reduces MATN3 expression in HCC cell lines, we expanded our investigation to explore the expression patterns and potential roles of MATN3 across a broader spectrum of cancers. This transition was prompted by the need to understand whether the observed downregulation of MATN3 could be linked to general mechanisms of tumorigenesis and tumor progression in diverse cancer types. Utilizing publicly available cancer genomic databases, we conducted a comprehensive analysis of MATN3 expression across multiple cancer cohorts. In our pan-cancer analysis, utilizing extensive cancer genomic and transcriptomic datasets, we observed a notable dichotomy in MATN3 expression. Our analysis revealed that MATN3 is consistently overexpressed in several malignancies when compared to corresponding normal tissues ( Fig 2A S1 File 10.1371/journal.pone.0330653.g002 Fig 2 Differential Expression of MATN3 in Cancerous and Normal Tissues, and Across Cancer Cell Lines. (A) (B) The reduced expression of MATN3 in specific cancer types like KICH, KIRP, and LUSC raises intriguing questions about its biological function and its potential as a therapeutic target. It suggests that MATN3 may play divergent roles in different tissue environments, possibly related to distinct regulatory networks or the tumor microenvironment. This complexity underscores the necessity of a nuanced approach to targeting MATN3 in cancer therapy, considering the variable expression and potential contrasting effects across different cancer types. Our findings highlight the importance of context and cancer specificity in the development of targeted therapies and further validate the relevance of exploring the mechanisms underlying MATN3 expression modulation by agents like α-Pinene. To further elucidate the expression patterns of MATN3 in various cancers, we utilized the Cancer Cell Line Encyclopedia to analyze MATN3 expression across a wide array of cancer cell lines. As illustrated in Fig 2B Survival analysis based on MATN3 expression Continuing our comprehensive analysis of MATN3, we examined its association with patient survival outcomes across multiple cancer types. This step was crucial to understanding the clinical significance of MATN3 expression levels in cancer prognosis. We conducted Kaplan-Meier survival analyses to compare the prognosis between high and low MATN3 expression groups across various cancers. As presented in Fig 3A S1 File 10.1371/journal.pone.0330653.g003 Fig 3 Survival Analysis of High vs. Low MATN3 Expression Across Various Cancer Types. (A) To further validate the prognostic significance of MATN3, we employed Cox proportional hazards regression analysis, as depicted in Supplementary Figure 3A-B in S1 File MATN3 mutational landscape and tumor heterogeneity Our comprehensive examination of MATN3 has extended into the study of its mutational landscape across multiple cancer types, offering insights into its genetic alterations and the implications for tumor behavior and therapy response. The stacked bar chart ( Fig 4A Fig 4B Fig 4C 40 10.1371/journal.pone.0330653.g004 Fig 4 Pan-cancer analysis of Mutation and Copy Number Variation (CNV) Analysis of MATN3. (A) (B) (C) The comprehensive analysis of MATN3 mutations and their correlation with various indicators of tumor heterogeneity offers insights into the complex role this gene may play across different cancer types. In the study of tumor purity, MATN3 expression shows a varying relationship depending on the cancer type (Supplementary Fig 4A in S1 File S1 File S1 File S1 File MATN3 and the tumor microenvironment After establishing a connection between MATN3 mutations and tumor heterogeneity, further analysis was conducted to examine the relationship between MATN3 and tumor immune infiltration across different cancer types using algorithms such as EPIC, ESTIMATE, and TIMER. These tools assess the levels of various immune cells within the tumor microenvironment, providing a broader understanding of how MATN3 might influence or be influenced by immune dynamics. Previous results have established a correlation between MATN3 and tumor purity, which is influenced by immune cell infiltration and the tumor microenvironment. Therefore, we further analyzed the relationship between MATN3 and immune cells. As shown in Fig 5A Fig 5B Fig 5C 10.1371/journal.pone.0330653.g005 Fig 5 Correlation of MATN3 Expression with Immune Infiltration. Heatmap depicting the correlation between MATN3 expression and immune cell infiltration as analyzed by the (A) (B) (C) MATN3 and immune regulatory genes Following the elucidation of the relationship between MATN3 expression and immune cell infiltration across various cancer types, our research further explored the correlation between MATN3 and key immune regulatory genes. This investigation utilized extensive bioinformatics analyses to assess the expression levels of MATN3 alongside a panel of immune inhibitors, immunostimulators, checkpoint inhibitory molecules, checkpoint stimulatory molecules, and chemokines, thus providing a comprehensive insight into the immunological landscape modulated by MATN3. Our findings reveal a complex interaction pattern. Figs 6A 6B 10.1371/journal.pone.0330653.g006 Fig 6 Correlation of MATN3 Expression with Immune Modulatory Factors. Heatmap showing the correlation coefficients between MATN3 expression and a range of (A) immunoinhibitory, (B) immunostimulatory, (C) inhibitory immune checkpoints, (D) stimulatory immune checkpoints and (E) chemokine across multiple cancer types. Immune checkpoints are critical regulators of the immune system, designed to maintain self-tolerance and modulate the duration and amplitude of physiological immune responses. In the realm of oncology, these checkpoints often become pivotal players in cancer pathogenesis by enabling tumor cells to evade immune surveillance [ 41 43 Figs 6C 6D Fig 6C Fig 6D Chemokines regulate the recruitment and infiltration of various immune cells into the tumor stroma, thereby modulating the immune response to neoplastic cells [ 44 45 Fig 6E MATN3 enrichment analysis To further elucidate the potential roles of MATN3 in cancer, an enrichment analysis was conducted on the gene. Initially, MATN3 expression was subjected to differential analysis based on median expression grouping. Subsequently, enrichment analyses using both KEGG pathways and Gene Set Enrichment Analysis (GSEA) were performed on the upregulated differential genes. The KEGG analysis highlighted significant enrichment in the “Cytoskeleton in muscle cells” pathway across multiple cancer types. Additionally, there was substantial enrichment in pathways such as PI3K-Akt signaling, Focal adhesion, and ECM-receptor interaction, which are intimately associated with the processes of cancer metastasis and invasion ( Fig 7A Fig 7B 10.1371/journal.pone.0330653.g007 Fig 7 Enrichment Analysis of MATN3. (A) (B) In the final phase of our investigation into MATN3’s role in cancer, an interaction network was constructed using the STRING database, focusing on proteins related to MATN3 ( Fig 8A Fig 8B 10.1371/journal.pone.0330653.g008 Fig 8 Enrichment Analysis of MATN3 Protein Interactions and Associated Pathways Using STRING Database. (A) (B) (C) (D) Additionally, enrichment analyses were performed using both KEGG and REACTOME databases. These analyses reaffirmed the significant enrichment of pathways such as the PI3K-AKT signaling and ECM-related pathways. The recurrent identification of these pathways across different analytical platforms underscores their potential relevance in the context of MATN3 expression and activity in cancer, highlighting the integral role of these signaling cascades in modulating tumor behavior and interaction with the tumor microenvironment. As shown in Supplementary Figure 5A-B in S1 File Discussion Our investigation into the anticancer effects of α-Pinene on hepatocellular carcinoma cell line revealed its potent antiproliferative activity and ability to modulate gene expression. Interestingly, we observed a significant downregulation of MATN3, a gene previously associated with poor prognosis in various cancers. This finding prompted a comprehensive exploration of MATN3’s expression patterns, mutational landscape, and clinical implications across a spectrum of malignancies. Based on these results, and in line with emerging strategies in cancer therapy, it is worth considering the potential of combining natural compounds such as α-Pinene with drug repurposing approaches. For example, utilizing GLP-1 based therapies or proteasome-targeting agents alongside natural compounds with immunomodulatory effects may offer a promising prophylactic or therapeutic strategy, potentially enhance anticancer efficacy and improving patient outcomes [ 46 47 The pan-cancer analysis unveiled a striking dichotomy in MATN3 expression, with consistent overexpression in numerous cancer types, including ACC, BLCA, BRCA, COAD, ESCA, GBM, LGG, HNSC, LIHC, PAAD, READ, STAD, and TGCT. This ubiquitous upregulation suggests a potential oncogenic role for MATN3 in these malignancies. Conversely, cancers like KICH, KIRP, and LUSC exhibited lower MATN3 expression, hinting at context-dependent functions or distinct regulatory mechanisms. The reduced expression in specific cancer types raises intriguing questions about MATN3’s biological roles and highlights the importance of a nuanced, cancer-specific approach when considering therapeutic targeting. The clinical significance of MATN3 expression was further reinforced by our survival analyses, which revealed that higher levels of MATN3 were associated with shorter overall survival in patients with BLCA, CESC, HNSC, LGG, LIHC, MESO, OV, PCPG, and STAD. Additionally, Cox proportional hazards regression models confirmed MATN3’s prognostic value, identifying it as a predictor of worse disease-specific survival and progression-free intervals in several cancer types. These findings underscore the potential utility of MATN3 as a prognostic biomarker and highlight its pivotal role in cancer progression and metastasis. Delving into the genetic landscape of MATN3, our mutational analyses revealed diverse patterns of copy number variations, amplifications, and mutations across different cancer types. While the overall mutation rate remains relatively low, specific mutations within critical domains like the vWFA domains could potentially impact MATN3’s functional interactions and contribute to its dysregulation in cancer. Furthermore, the correlation between MATN3 expression and indicators of tumor heterogeneity, such as tumor purity, tumor mutational burden, microsatellite instability, and homologous recombination deficiency, suggested a complex interplay between MATN3 and the tumor microenvironment. Notably, our research has elucidated a significant positive correlation between MATN3 expression and cancer-associated fibroblasts, a pattern that is consistently observed across a majority of tumor types. CAFs are recognized as key components of the tumor microenvironment, playing a pivotal role in supporting tumor growth, invasion, and metastasis [ 48 49 Furthermore, the positive correlation between MATN3 and various immunosuppressive genes, checkpoint inhibitors, and chemokines in several cancer types implies a potential involvement in immune evasion and regulation of the anti-tumor immune response. MATN3 shows a strong positive correlation with immune genes in cancers including LIHC, PAAD, COADREAD, and PRAD. Its association with negative prognostic factors in these tumor types highlights its potential importance in immune regulation and disease outcome. Given its impact on prognosis, further detailed research on MATN3 in these cancers is crucial for understanding its biological roles and therapeutic potential. These findings imply that MATN3 may shape the tumor immune microenvironment and influence the response to immune checkpoint blockade therapies. Further research is needed to determine whether MATN3 expression could serve as a predictive biomarker for immunotherapy or as a potential therapeutic target to improve patient outcomes. The enrichment analyses shed light on the potential mechanisms underlying MATN3’s functions in cancer. Pathways such as cytoskeleton organization, PI3K-Akt signaling, focal adhesion, and ECM-receptor interaction were significantly enriched, suggesting that MATN3 may play a role in regulating cellular dynamics, migration, and invasion [ 50 51 52 54 A key limitation of our study is the exclusive use of HepG2 and Hep3B cell lines for in vitro experiments. While these cell lines are widely used and represent important models of HCC, they may not capture the genetic and phenotypic heterogeneity observed in primary HCC. Future studies should include a broader range of HCC cell lines, as well as patient-derived organoids or xenograft models, to validate the generalizability of our findings and better reflect the complexity of hepatocellular carcinoma biology. Our study combines in vitro experiments with comprehensive pan-cancer bioinformatics analysis, providing evidence for the role of MATN3 in cancer progression. The integration of molecular, cellular, and clinical data strengthens the translational relevance of our findings. The findings from this comprehensive analysis not only deepen our understanding of MATN3’s roles in tumorigenesis but also pave the way for future explorations into its potential as a prognostic biomarker, therapeutic target, and a window into the intricate interplay between cancer cells and their microenvironment. Unraveling the intricate mechanisms underlying MATN3’s functions could unveil novel therapeutic avenues and contribute to the development of personalized treatment strategies tailored to the unique molecular landscapes of different cancer types. Looking forward, the clinical translation of α-Pinene and MATN3-targeted therapies presents both opportunities and challenges. Further preclinical studies, including in vivo efficacy and toxicity assessments, are necessary to establish the safety and therapeutic potential of α-Pinene in HCC. Additionally, the development of specific MATN3 inhibitors or strategies to modulate MATN3 expression could provide novel options for targeted therapy. Integrating these approaches with existing treatment modalities, such as immune checkpoint inhibitors, may further enhance therapeutic outcomes. Ultimately, prospective clinical trials will be essential to evaluate the efficacy of these strategies in HCC patients. Supporting information S1 File S1 Fig. S2 Fig. S3 Fig. S4 Fig. S5_Fig. S1 Table. S2 Table. (ZIP) Abbreviation: ACC Adrenocortical Carcinoma AKT AKT Serine/Threonine Kinase 1 ATCC American Type Culture Collection BCA Bicinchoninic Acid BLCA Bladder Urothelial Carcinoma BRCA Breast Invasive Carcinoma CAFs Cancer-Associated Fibroblasts CCLE Cancer Cell Line Encyclopedia CCK8 Cell Counting Kit-8 cDNA Complementary DNA CNV Copy Number Variation COAD Colon Adenocarcinoma COADREAD Colon and Rectum Adenocarcinoma CST Cell Signaling Technology DMSO Dimethyl Sulfoxide DSS Disease-Specific Survival ECM Extracellular Matrix EMEM Eagle’s Minimum Essential Medium EPIC Estimating the Proportion of Immune and Cancer cells ESCA Esophageal Carcinoma ESTIMATE Estimation of STromal and Immune cells in MAlignant Tumor tissues using Expression data FBS Fetal Bovine Serum GBM Glioblastoma Multiforme GAPDH Glyceraldehyde-3-Phosphate Dehydrogenase GO Gene Ontology GTEx Genotype-Tissue Expression GSEA Gene Set Enrichment Analysis HCC Hepatocellular Carcinoma HNSC Head and Neck Squamous Cell Carcinoma HRD Homologous Recombination Deficiency KEGG Kyoto Encyclopedia of Genes and Genomes KICH Kidney Chromophobe KIRP Kidney Renal Papillary Cell Carcinoma LGG Lower Grade Glioma LIHC Liver Hepatocellular Carcinoma LUSC Lung Squamous Cell Carcinoma MATN3 Matrilin-3 MESO Mesothelioma MSI Microsatellite Instability mRNA Messenger RNA NK Natural Killer NSCLC Non-Small Cell Lung Cancer OV Ovarian Serous Cystadenocarcinoma PAAD Pancreatic Adenocarcinoma PCPG Pheochromocytoma and Paraganglioma PFI Progression-Free Interval PI3K Phosphoinositide 3-Kinase PPI Protein-Protein Interaction PRAD Prostate Adenocarcinoma PVDF Polyvinylidene Fluoride qPCR Quantitative Polymerase Chain Reaction RIN RNA Integrity Number RNA Ribonucleic Acid RT-qPCR Reverse Transcription Quantitative PCR SD Standard Deviation SDS-PAGE Sodium Dodecyl Sulfate Polyacrylamide Gel Electrophoresis STAD Stomach Adenocarcinoma STRING Search Tool for the Retrieval of Interacting Genes/Proteins TCGA The Cancer Genome Atlas TGCT Testicular Germ Cell Tumor THCA Thyroid Carcinoma THYM Thymoma TMB Tumor Mutational Burden TNFSF4 Tumor Necrosis Factor Ligand Superfamily Member 4 vWFA von Willebrand Factor A domain WGBS Whole Genome Bisulfite Sequencing XENA UCSC Xena Browser References 1 Anwar MM Albanese C Hamdy NM Sultan AS Rise of the natural red pigment “prodigiosin” as an immunomodulator in cancer Cancer Cell Int 2022 22 1 419 doi: 10.1186/s12935-022-02815-4 36577970 PMC9798661 2 Chiang Y-F Huang K-C Chen H-Y Hamdy NM Huang T-C Chang H-Y et al Hinokitiol Inhibits Breast Cancer Cells In Vitro Stemness-Progression and Self-Renewal with Apoptosis and Autophagy Modulation via the CD44/Nanog/SOX2/Oct4 Pathway Int J Mol Sci 2024 25 7 3904 doi: 10.3390/ijms25073904 38612715 PMC11011552 3 Karimkhani MM Nasrollahzadeh M Maham M Jamshidi A Kharazmi MS Dehnad D et al Extraction and purification of α-pinene; a comprehensive review Crit Rev Food Sci Nutr 2024 64 13 4286 311 doi: 10.1080/10408398.2022.2140331 36384372 4 Wróblewska-Łuczka P Cabaj J Bargieł J Łuszczki JJ Anticancer effect of terpenes: focus on malignant melanoma Pharmacol Rep 2023 75 5 1115 25 doi: 10.1007/s43440-023-00512-1 37515699 PMC10539410 5 Salminen A Lehtonen M Suuronen T Kaarniranta K Huuskonen J Terpenoids: natural inhibitors of NF-kappaB signaling with anti-inflammatory and anticancer potential Cell Mol Life Sci 2008 65 19 2979 99 doi: 10.1007/s00018-008-8103-5 18516495 PMC11131807 6 Matsuo AL Figueiredo CR Arruda DC Pereira FV Scutti JAB Massaoka MH α-Pinene isolated from Schinus terebintinfolius Raddi (Anacardiaceae) induces apoptosis and confers antimetastatic protection in a melanoma model Biochemical and Biophysical Research Communications 2011 411 2 449 54 21756878 10.1016/j.bbrc.2011.06.176 7 Qiu B Jiang W Qiu W Mu W Qin Y Zhu Y et al Pine needle oil induces G2/M arrest of HepG2 cells by activating the ATM pathway Exp Ther Med 2018 15 2 1975 81 doi: 10.3892/etm.2017.5648 29434792 PMC5776635 8 Jeong J-H Zhong S Li F Huang C Chen X Liu Q et al Tumor-derived OBP2A promotes prostate cancer castration resistance J Exp Med 2023 220 3 doi: 10.1084/jem.20211546 36547668 PMC9789742 9 Zhang Z Guo S Liu X Gao X Synergistic antitumor effect of α-pinene and β-pinene with paclitaxel against non-small-cell lung carcinoma (NSCLC) Drug Res (Stuttg) 2015 65 4 214 8 doi: 10.1055/s-0034-1377025 25188609 10 Han E-J Choi E-Y Jeon S-J Moon J-M Lee S-W Lee J-H et al Anticancer Effects of α-Pinene in AGS Gastric Cancer Cells J Med Food 2024 27 4 330 8 doi: 10.1089/jmf.2023.K.0267 38387002 11 Chen W Liu Y Li M Mao J Zhang L Huang R et al Anti-tumor effect of α-pinene on human hepatoma cell lines through inducing G2/M cell cycle arrest J Pharmacol Sci 2015 127 3 332 8 doi: 10.1016/j.jphs.2015.01.008 25837931 12 Xu Q Li M Yang M Yang J Xie J Lu X et al α-pinene regulates miR-221 and induces G(2)/M phase cell cycle arrest in human hepatocellular carcinoma cells Bioscience Reports 2018 38 6 10.1042/BSR20180980 PMC6294613 30473536 13 Abe M Asada N Kimura M Fukui C Yamada D Wang Z et al Antitumor activity of α-pinene in T-cell tumors Cancer Sci 2024 115 4 1317 32 doi: 10.1111/cas.16086 38279512 PMC11007008 14 Wang P Xiao W-S Li Y-H Wu X-P Zhu H-B Tan Y-R Identification of MATN3 as a Novel Prognostic Biomarker for Gastric Cancer through Comprehensive TCGA and GEO Data Mining Dis Markers 2021 2021 1769635 doi: 10.1155/2021/1769635 34900024 PMC8660198 15 Wu PL He YF Yao HH Hu B Martrilin-3 (MATN3) Overexpression in Gastric Adenocarcinoma and its Prognostic Significance Medical Science Monitor: International Medical Journal of Experimental and Clinical Research 2018 24 348 55 29343680 10.12659/MSM.908447 PMC5784332 16 Gadwal A Purohit P Khokhar M Vishnoi JR Pareek P Choudhary R et al In silico analysis of differentially expressed-aberrantly methylated genes in breast cancer for prognostic and therapeutic targets Clin Exp Med 2023 23 7 3847 66 doi: 10.1007/s10238-023-01060-x 37029310 17 Yiqi Z Ziyun L Qin F Xingli W Liyu Y Identification of 9-gene epithelial-mesenchymal transition related signature of osteosarcoma by integrating multi cohorts Technology in Cancer Research & Treatment 2020 19 1533033820980769 33308057 10.1177/1533033820980769 PMC7739092 18 Li D Xu J Dong X Chen W Pan L Jiang H et al Diagnostic and prognostic value of MATN3 expression in gastric carcinoma: TCGA database mining J Gastrointest Oncol 2021 12 4 1374 83 doi: 10.21037/jgo-21-267 34532095 PMC8421911 19 Vincourt J-B Vignaud J-M Lionneton F Sirveaux F Kawaki H Marchal S et al Increased expression of matrilin-3 not only in osteoarthritic articular cartilage but also in cartilage-forming tumors, and down-regulation of SOX9 via epidermal growth factor domain 1-dependent signaling Arthritis Rheum 2008 58 9 2798 808 doi: 10.1002/art.23761 18759284 20 Goldman MJ Craft B Hastie M Repečka K McDade F Kamath A et al Visualizing and interpreting cancer genomics data via the Xena platform Nat Biotechnol 2020 38 6 675 8 doi: 10.1038/s41587-020-0546-8 32444850 PMC7386072 21 Pharmacogenomic agreement between two cancer cell line data sets Nature 2015 528 7580 84 7 26570998 10.1038/nature15736 PMC6343827 22 Liu J Lichtenberg T Hoadley KA Poisson LM Lazar AJ Cherniack AD et al An Integrated TCGA Pan-Cancer Clinical Data Resource to Drive High-Quality Survival Outcome Analytics Cell 2018 173 2 doi: 10.1016/j.cell.2018.02.052 29625055 PMC6066282 23 Zhong Y Zheng C Zhang W Wu H Wang M Zhang Q et al Pan-Cancer analysis and experimental validation identify the oncogenic nature of ESPL1: Potential therapeutic target in colorectal cancer Front Immunol 2023 14 1138077 doi: 10.3389/fimmu.2023.1138077 37006282 PMC10060535 24 Thorsson V Gibbs DL Brown SD Wolf D Bortone DS Ou Yang TH The Immune Landscape of Cancer Immunity 2018 48 4 10.1016/j.immuni.2018.03.023 PMC5982584 29628290 25 Bonneville R Krook MA Kautto EA Miya J Wing MR Chen H-Z et al Landscape of Microsatellite Instability Across 39 Cancer Types JCO Precis Oncol 2017 2017 doi: 10.1200/PO.17.00073 29850653 PMC5972025 26 Beroukhim R Mermel CH Porter D Wei G Raychaudhuri S Donovan J et al The landscape of somatic copy-number alteration across human cancers Nature 2010 463 7283 899 905 doi: 10.1038/nature08822 20164920 PMC2826709 27 Yoshihara K Shahmoradgoli M Martínez E Vegesna R Kim H Torres-Garcia W et al Inferring tumour purity and stromal and immune cell admixture from expression data Nat Commun 2013 4 2612 doi: 10.1038/ncomms3612 24113773 PMC3826632 28 Li B Severson E Pignon JC Zhao H Li T Novak J Comprehensive analyses of tumor immunity: implications for cancer immunotherapy Genome biology 2016 17 1 174 27549193 10.1186/s13059-016-1028-7 PMC4993001 29 Li T Fu J Zeng Z Cohen D Li J Chen Q et al TIMER2.0 for analysis of tumor-infiltrating immune cells Nucleic Acids Research 2020 48 14 10.1093/nar/gkaa407 PMC7319575 32442275 30 Li T Fan J Wang B Traugh N Chen Q Liu JS et al TIMER: A Web Server for Comprehensive Analysis of Tumor-Infiltrating Immune Cells Cancer Res 2017 77 21 10 doi: 10.1158/0008-5472.CAN-17-0307 29092952 PMC6042652 31 Racle J de Jonge K Baumgaertner P Speiser DE Gfeller D Simultaneous enumeration of cancer and immune cell types from bulk tumor gene expression data Elife 2017 6 doi: 10.7554/eLife.26476 29130882 PMC5718706 32 Shen W Song Z Zhong X Huang M Shen D Gao P et al Sangerbox: A comprehensive, interaction-friendly clinical bioinformatics analysis platform Imeta 2022 1 3 doi: 10.1002/imt2.36 38868713 PMC10989974 33 Chen D Xu L Xing H Shen W Song Z Li H et al Sangerbox 2: Enhanced functionalities and update for a comprehensive clinical bioinformatics data analysis platform Imeta 2024 3 5 doi: 10.1002/imt2.238 39429873 PMC11487553 34 von Mering C Huynen M Jaeggi D Schmidt S Bork P Snel B STRING: a database of predicted functional associations between proteins Nucleic Acids Res 2003 31 1 258 61 doi: 10.1093/nar/gkg034 12519996 PMC165481 35 von Mering C Jensen LJ Snel B Hooper SD Krupp M Foglierini M et al STRING: known and predicted protein-protein associations, integrated and transferred across organisms Nucleic Acids Res 2005 33 doi: 10.1093/nar/gki005 15608232 PMC539959 36 Snel B Lehmann G Bork P Huynen MA STRING: a web-server to retrieve and display the repeatedly occurring neighbourhood of a gene Nucleic Acids Res 2000 28 18 3442 4 doi: 10.1093/nar/28.18.3442 10982861 PMC110752 37 Szklarczyk D Gable AL Nastou KC Lyon D Kirsch R Pyysalo S et al The STRING database in 2021: customizable protein-protein networks, and functional characterization of user-uploaded gene/measurement sets Nucleic Acids Research 2021 49 12 10.1093/nar/gkaa1074 PMC7779004 33237311 38 Yu G Wang L-G Han Y He Q-Y clusterProfiler: an R package for comparing biological themes among gene clusters OMICS 2012 16 5 284 7 doi: 10.1089/omi.2011.0118 22455463 PMC3339379 39 Ritchie ME Phipson B Wu D Hu Y Law CW Shi W et al limma powers differential expression analyses for RNA-sequencing and microarray studies Nucleic Acids Res 2015 43 7 doi: 10.1093/nar/gkv007 25605792 PMC4402510 40 Meyer D Girma JP von Willebrand factor: structure and function Thromb Haemost 1993 70 1 99 104 8236123 41 Guo Z Zhang R Yang A-G Zheng G Diversity of immune checkpoints in cancer immunotherapy Front Immunol 2023 14 1121285 doi: 10.3389/fimmu.2023.1121285 36960057 PMC10027905 42 Medema RH Macůrek L Checkpoint control and cancer Oncogene 2012 31 21 2601 13 doi: 10.1038/onc.2011.451 21963855 43 Ribas A Wolchok JD Cancer immunotherapy using checkpoint blockade Science 2018 359 6382 1350 5 29567705 10.1126/science.aar4060 PMC7391259 44 Chow MT Luster AD Chemokines in cancer Cancer immunology research 2014 2 12 1125 31 25480554 10.1158/2326-6066.CIR-14-0160 PMC4258879 45 Mempel TR Lill JK Altenburger LM How chemokines organize the tumour microenvironment Nat Rev Cancer 2024 24 1 28 50 doi: 10.1038/s41568-023-00635-w 38066335 PMC11480775 46 Mostafa AM Hamdy NM El-Mesallamy HO Abdel-Rahman SZ Glucagon-like peptide 1 (GLP-1)-based therapy upregulates LXR-ABCA1/ABCG1 cascade in adipocytes Biochem Biophys Res Commun 2015 468 4 900 5 doi: 10.1016/j.bbrc.2015.11.054 26603933 47 Atta H Alzahaby N Hamdy NM Emam SH Sonousi A Ziko L New trends in synthetic drugs and natural products targeting 20S proteasomes in cancers Bioorg Chem 2023 133 106427 doi: 10.1016/j.bioorg.2023.106427 36841046 48 Chen Y McAndrews KM Kalluri R Clinical and therapeutic relevance of cancer-associated fibroblasts Nat Rev Clin Oncol 2021 18 12 792 804 doi: 10.1038/s41571-021-00546-5 34489603 PMC8791784 49 Ping Q Yan R Cheng X Wang W Zhong Y Hou Z et al Cancer-associated fibroblasts: overview, progress, challenges, and directions Cancer Gene Ther 2021 28 9 984 99 doi: 10.1038/s41417-021-00318-4 33712707 50 Noorolyai S Shajari N Baghbani E Sadreddini S Baradaran B The relation between PI3K/AKT signalling pathway and cancer Gene 2019 698 120 8 doi: 10.1016/j.gene.2019.02.076 30849534 51 Zhao J Guan J-L Signal transduction by focal adhesion kinase in cancer Cancer Metastasis Rev 2009 28 35 49 doi: 10.1007/s10555-008-9165-4 19169797 52 Zhang YE Stuelten CH Alternative splicing in EMT and TGF-β signaling during cancer progression Seminars in Cancer Biology Elsevier 2024 10.1016/j.semcancer.2024.04.001 PMC11180579 38614376 53 Chen B Mu C Zhang Z He X Liu X The love-hate relationship between TGF-β signaling and the immune system during development and tumorigenesis Front Immunol 2022 13 891268 doi: 10.3389/fimmu.2022.891268 35720407 PMC9204485 54 Martin-Orozco E Sanchez-Fernandez A Ortiz-Parra I Ayala-San Nicolas M WNT signaling in tumors: the way to evade drugs and immunity Front Immunol 2019 10 2854 doi: 10.3389/fimmu.2019.02854 31921125 PMC6934036 ",
  "metadata": {
    "Title of this paper": "WNT signaling in tumors: the way to evade drugs and immunity",
    "Journal it was published in:": "PLOS One",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12468984/"
  }
}