{
  "title": "Paper_806",
  "abstract": "pmc Cureus Cureus 2757 cureus Cureus 2168-8184 Cureus Inc. PMC12476869 PMC12476869.1 12476869 12476869 41024924 10.7759/cureus.91232 1 Plastic Surgery Oncology Anesthesiology Comparing the Analgesic Efficacy of the Serratus-Intercostal Plane Block With Conventional Pharmacological Treatment in Patients Following Radical Mastectomy Muacevic Alexander Adler John R De León-Herrera Esther I 1 Castellanos-López Marco A 2 Chávez-Macías Verónica 3 Hernández-Sierra Juan F 4 Torres-Salazar Quitzia L 5 Rios Eloisa 6  1  2  3  4  5  6 Quitzia L. Torres-Salazar quitzia.torres@gmail.com 29 8 2025 8 2025 17 8 494304 e91232 29 8 2025 29 08 2025 29 09 2025 30 09 2025 Copyright © 2025, De León-Herrera et al. 2025 De León-Herrera et al. https://creativecommons.org/licenses/by/4.0/ This is an open access article distributed under the terms of the Creative Commons Attribution License CC-BY 4.0., which permits unrestricted use, distribution, and reproduction in any medium, provided the original author and source are credited. This article is available from https://cureus.com/articles/402510-comparing-the-analgesic-efficacy-of-the-serratus-intercostal-plane-block-with-conventional-pharmacological-treatment-in-patients-following-radical-mastectomy Introduction: Postoperative pain following radical mastectomy is common and can significantly impair recovery and quality of life. Regional anesthesia through the serratus-intercostal plane block (BRILMA) has been proposed as an effective strategy for pain control. Objective: This study aims to compare the analgesic efficacy of BRILMA versus conventional pharmacological treatment in patients undergoing radical mastectomy. Materials and methods: A prospective, observational cohort study with two comparative groups was conducted to evaluate the analgesic effectiveness of BRILMA versus conventional treatment following radical mastectomy. Women over 18 years scheduled for radical mastectomy were enrolled and assigned to groups based on the analgesic technique received during standard clinical care: the BRILMA group (ultrasound-guided block with 15 mL of 3% ropivacaine) and the control group (standard regimen with paracetamol, diclofenac, tramadol, dexamethasone, and ondansetron). The primary outcome was pain intensity, assessed using the Visual Analog Scale (VAS) at 4, 8, 12, and 24 hours postoperatively. Hemodynamic parameters were evaluated, and statistical analysis included Mann-Whitney U tests and chi-square tests. Results: A total of 13 patients were included (six in the BRILMA group, seven in the control group). VAS scores were significantly lower in the BRILMA group at 8, 12, and 24 hours postoperatively (p<0.05). Additionally, lower systolic blood pressure was observed at 12 hours in the BRILMA group. No complications related to the technique were reported. Conclusions: BRILMA is a safe and effective analgesic technique, demonstrating superiority over conventional treatment for controlling postoperative pain following radical mastectomy. mastectomy opioid-sparing analgesia postoperative pain regional anesthesia serratus-intercostal plane block pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement no pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes Introduction Breast cancer is the most common malignancy among women worldwide and constitutes a major public health concern in Mexico, where it ranks as the leading cause of cancer-related mortality in adult women [ 1 2 Despite the use of conventional analgesic strategies that combine opioids, nonsteroidal anti-inflammatory drugs (NSAIDs), and adjuvants, a considerable number of patients experience inadequate pain control [ 3 4 The serratus-intercostal plane block, known by the acronym BRILMA, stands for block of the lateral (cutaneous) branches of the intercostal nerves in the mid-axillary line, was first described by Diéguez García et al. in 2013 [ 5 6 Given the need for more effective strategies to manage postoperative pain in breast surgery, the aim of this prospective cohort study is to determine whether BRILMA provides superior analgesic efficacy compared to conventional treatment in women undergoing radical mastectomy. Materials and methods A prospective, analytical, longitudinal cohort study was conducted to evaluate the effectiveness of the BRILMA block compared to conventional pharmacological therapy for postoperative pain management in patients undergoing radical mastectomy. The study was carried out in a tertiary referral center specializing in oncologic breast surgery and regional anesthesia. The study protocol was approved by the Institutional Research Committee (approval number: 003/2024) and the Institutional Ethics Committee (approval number: 001/2024) of the Instituto de Seguridad y Servicios Sociales de los Trabajadores del Estado, Hospital General de San Luis Potosí. This report adheres to the STROBE (Strengthening the Reporting of Observational Studies in Epidemiology) guidelines for cohort studies [ 7 The study included women over 18 years of age, classified as American Society of Anesthesiologists (ASA) physical status I to III, who were scheduled for unilateral radical mastectomy for breast cancer and had provided written informed consent. Patients were excluded if they had known coagulopathies, allergies to local anesthetics, hemodynamic instability, active radiculopathies, or if they declined or withdrew consent at any stage of follow-up. Participants were grouped based on the postoperative analgesia technique administered, as determined by routine clinical practice and attending anesthesiologist preference. In the BRILMA group, the block was performed at the end of surgery and prior to tracheal extubation. Patients were placed in the supine position with the ipsilateral arm abducted at 90°. A high-frequency linear transducer (6-13 MHz) was positioned longitudinally at the mid-axillary line at the level of the fifth intercostal space, and a 22-G, 70-90 mm needle was inserted in-plane in a caudal-to-cranial direction until reaching the fascial plane between the serratus anterior and the external intercostal muscles. A total of 15 mL of 0.3% ropivacaine was injected, with ultrasound confirmation of its spread across the fourth and fifth intercostal spaces. This technique provides analgesia by blocking the lateral cutaneous branches of the intercostal nerves, typically covering dermatomes T2-T6, which correspond to the anterolateral thoracic wall and axillary region [ 8 The primary outcome was postoperative pain intensity, evaluated using the Visual Analog Scale (VAS) at 4, 8, 12, and 24 hours [ 9 Sample size was calculated using the formula for clinical trials comparing differences in means described by Velazco et al. [ 10 11 Data were analyzed using IBM SPSS Statistics for Windows, Version 26 (Released 2020; IBM Corp., Armonk, New York, United States). The Kolmogorov-Smirnov test was used to assess the normality of continuous variables. Between-group comparisons for medians were conducted using the Mann-Whitney U test, and categorical variables were analyzed using the chi-square test. Intragroup changes were evaluated with the Wilcoxon signed-rank test. Analyses were performed per protocol, including only participants who completed all follow-up assessments. Results A total of 16 patients were assessed between August and December 2024. Three were excluded: one due to hemodynamic instability detected during the preoperative assessment, which prevented surgery from being performed on the scheduled day, and two for receiving techniques not aligned with the study protocol. Thirteen patients were ultimately analyzed: six in the BRILMA group and seven in the control group. No statistically significant differences were observed between groups in age, weight, height, body mass index (BMI), or ASA classification (p > 0.05). Clinical characteristics are summarized in Table 1 Table 1 General characteristics of the study groups. Medians (q25-q75) are presented for continuous variables. The contrast between medians was performed with the Mann-Whitney U test. Variable BRILMA (n=6) Control group (n=7) p-value Age (years) 64 (51-66) 59 (58-62) 0.534 Weight (kg) 68 (59-72) 70 (60-76) 0.628 Height (cm) 160 (156-165) 163 (150-170) 0.836 BMI (kg/m 2 24.8 (23-27) 26.6 (22-29) 0.628 VAS scores were lower in the BRILMA group compared to the control group across all time points. At four hours, the BRILMA group showed a median of 2.5 (q25-q75: 1-3.2), while the control group had a median of 4 (q25-q75: 3-5), with no statistically significant difference (p=0.051). At eight hours, pain scores were significantly lower in the BRILMA group, with a median of 2.5 (q25-q75: 1.75-3) compared to 6 (q25-q75: 5-8) in the control group (p=0.001). At 12 hours, the BRILMA group reported a median of 2 (q25-q75: 1-3.2) versus 7 (q25-q75: 5-8) in the control group (p=0.002). At 24 hours, the BRILMA group maintained a median of 2.5 (q25-q75: 1.75-3), whereas the control group showed a median of 7 (q25-q75: 3-8) (p=0.022). These values are shown in Figures 1 2 Figure 1 Pain intensity comparison at four and eight hours post-analgesia between BRILMA and control groups. VAS scores at four hours were 2.5 (q25-q75: 1-3.2) in the BRILMA group versus 4 (q25-q75: 3-5) in the control group, with no statistically significant difference (p=0.051). At eight hours, BRILMA demonstrated significantly lower pain scores, with a median of 2.5 (q25-q75: 1.75-3) compared to 6 (q25-q75: 5-8) in the control group (p=0.001). VAS: Visual Analog Scale Figure 2 Pain intensity comparison at 12 and 24 hours post-analgesia between BRILMA and control groups. VAS scores at 12 hours were 2 (q25-q75: 1-3.2) in the BRILMA group versus 7 (q25-q75: 5-8) in the control group (p=0.002). At 24 hours, BRILMA patients reported a median of 2.5 (q25-q75: 1.75-3) compared to 7 (q25-q75: 3-8) in the control group (p=0.022), confirming a sustained analgesic effect. VAS: Visual Analog Scale No significant differences were observed between groups in heart rate or respiratory rate at any time point. However, systolic blood pressure was significantly lower in the BRILMA group at 12 hours (p=0.022), with no differences in diastolic pressure. These values are detailed in Table 2 Table 2 Hemodynamic and respiratory parameters identified in the study groups. Medians (q25-q75) are presented for continuous variables. The comparison between medians was performed using the Mann-Whitney U test. * Statistically significant difference (p<0.05). Variable BRILMA (n=6) Control group (n=7) p-value Systolic pressure (mmHg) - 4 hrs 110 (98-132) 124 (110-137) 0.534 Systolic pressure (mmHg) - 8 hrs 101 (97-126) 130 (125-140) 0.628 Systolic pressure (mmHg) - 12 hrs 108 (99-121) 128 (120-150) 0.022* Systolic pressure (mmHg) - 24 hrs 115 (107-126) 128 (115-130) 0.234 Diastolic pressure (mmHg) - 4 hrs 74 (60-90) 68 (68-78) 0.051 Diastolic pressure (mmHg) - 8 hrs 62 (58-85) 70 (65-80) 0.445 Diastolic pressure (mmHg) - 12 hrs 67 (63-77) 70 (68-73) 0.101 Diastolic pressure (mmHg) - 24 hrs 65 (60-78) 78 (70-82) 0.138 Heart rate (bpm) - 4 hrs 75 (64-89) 68 (62-77) 0.295 Heart rate (bpm) - 8 hrs 73 (63-88) 68 (65-75) 0.628 Heart rate (bpm) - 12 hrs 75 (64-88) 67 (62-75) 0.295 Heart rate (bpm) - 24 hrs 74 (65-83) 72 (65-82) 0.731 Respiratory rate (rpm) - 4 hrs 16 (15-16) 17 (16-18) 0.234 Respiratory rate (rpm) - 8 hrs 17 (14-18) 18 (18-20) 0.295 Respiratory rate (rpm) - 12 hrs 15 (14-18) 18 (16-20) 0.234 Respiratory rate (rpm) - 24 hrs 17 (14-18) 16 (16-19) 0.628 No major complications or adverse reactions related to the BRILMA technique were reported during the postoperative follow-up period. Discussion The results of this prospective cohort study demonstrate that BRILMA provides superior postoperative analgesia compared to conventional treatment in patients undergoing radical mastectomy. Participants in the BRILMA group exhibited significantly lower VAS scores at 8, 12, and 24 hours postoperatively, indicating a sustained analgesic effect. These findings are consistent with those of Kumar et al., who reported that ultrasound-guided regional techniques, such as pectoral nerve (PECS) blocks, significantly reduced both pain intensity and opioid consumption within the first 24 hours after mastectomy [ 11 A reduction in systolic blood pressure at 12 hours was also observed in the BRILMA group, potentially attributable to decreased sympathetic nervous system activation in response to nociceptive stimuli. This hemodynamic benefit aligns with the observations of Galán Gutiérrez et al., who noted that ultrasound-guided thoracic blocks not only improve analgesic comfort but also enhance cardiovascular stability in high-risk mastectomy patients [ 4 One of the major strengths of this study is that it reinforces the evidence that interfascial plane blocks provide meaningful clinical benefits beyond statistical significance. In our cohort, BRILMA was not only effective in reducing pain scores but also showed a favorable safety profile, with no complications related to the technique. These observations mirror those reported in previous studies, where regional techniques consistently demonstrate an opioid-sparing effect and contribute to more stable hemodynamic parameters in the perioperative period. By describing the use of ultrasound guidance, validated pain scales, and structured follow-up, we aimed to present a pragmatic protocol that can be readily reproduced in similar oncologic surgery settings. In contrast to the findings of Fernández Martín et al., who highlighted BRILMA’s effectiveness in reducing intraoperative fentanyl requirements during supraumbilical surgeries, our study did not assess intraoperative analgesia, limiting the feasibility of direct comparison. Nevertheless, the absence of complications in our cohort supports the safety profile of BRILMA, consistent with previous literature [ 6 12 The benefits observed in our population are clinically relevant. Adequate postoperative analgesia following mastectomy not only improves perioperative comfort but also reduces the risk of complications such as hypoventilation, secretion retention, or progression to chronic post-surgical pain. These results support the recommendations of major clinical guidelines, including those of the American Pain Society and the ASA, which advocate regional multimodal analgesia to optimize surgical outcomes [ 3 Our findings are further supported by Alshawadfy and Al-Touny, who compared ultrasound-guided serratus anterior plane (SAP) block with PECS II block in modified radical mastectomy. Their randomized clinical trial demonstrated that SAP block significantly prolonged the time to first rescue analgesia and reduced total opioid consumption compared to PECS II, while maintaining hemodynamic stability and a low incidence of postoperative nausea and vomiting. Although our study did not directly compare BRILMA with PECS II or SAP blocks, the analgesic profile observed parallels the advantages of interfascial plane techniques described in their work, reinforcing BRILMA as a safe and effective option for thoracic wall analgesia [ 13 Similarly, Sharma et al. conducted a randomized controlled trial comparing PECS block combined with general anesthesia versus general anesthesia alone in unilateral mastectomy. Their results demonstrated significantly lower intraoperative fentanyl use, delayed time to first rescue analgesia, and decreased postoperative opioid requirements in the PECS group. These findings parallel our observations regarding the opioid-sparing benefits of BRILMA, underscoring the role of ultrasound-guided regional techniques as a cornerstone of multimodal perioperative pain management in breast surgery [ 14 Despite these advantages, it is important to acknowledge that the lack of double blinding in our study may introduce performance or expectancy bias. However, detection bias was minimized by ensuring blinded data analysis. Additionally, the small sample size limits the generalizability of our findings, although internal consistency and clinically relevant effect sizes support their validity. Overall, BRILMA emerges as a safe and effective regional technique, well-suited for integration into multimodal analgesic protocols for radical mastectomy. Future randomized controlled trials with larger sample sizes and extended follow-up are warranted to further evaluate its role in preventing chronic postoperative pain and to assess its cost-effectiveness across diverse clinical settings. Conclusions The BRILMA proved to be a safe and effective analgesic technique for controlling postoperative pain in patients undergoing radical mastectomy. Patients treated with BRILMA experienced significantly lower pain scores at 8, 12, and 24 hours postoperatively compared to those receiving conventional opioid and NSAID-based therapy. In addition to superior pain control, the BRILMA group demonstrated a trend toward greater hemodynamic stability, with a significant reduction in systolic blood pressure at 12 hours, without adverse effects attributable to the technique. These findings support the incorporation of BRILMA into multimodal analgesic strategies in oncologic breast surgery, particularly in settings aiming to reduce opioid use and enhance perioperative care quality. However, given the limited sample size, the single-center setting, and the absence of double blinding, caution is warranted when extrapolating these findings to broader populations. Larger, multicenter trials with extended follow-up are required to validate these results and to further explore their implications for chronic pain prevention and long-term functional recovery. Disclosures Human subjects: Animal subjects: Conflicts of interest: Payment/services info: Financial relationships: Other relationships: Author Contributions Concept and design: Acquisition, analysis, or interpretation of data: Drafting of the manuscript: Critical review of the manuscript for important intellectual content: Supervision: References 1 Current state of breast cancer in Mexico: main types and risk factors Gac Mex Oncol Arceo-Martínez M López-Meza J Ochoa-Zarzosa A Palomera-Sánchez Z 101 110 20 2021 2 Quality of life in patients with breast cancer: radical versus conservative surgery in a highly specialized medical unit Cir Gen Medina-Valencia JJ Ángeles-Bueno WG Delgado-Vázquez JA Lomelí Muñoz JA Ojeda Babilonia JA Montes Velázquez L 15 24 37 2015 https://www.scielo.org.mx/pdf/cg/v37n1-2/1405-0099-cg-37-1-2-15.pdf 3 Management of postoperative pain: a clinical practice guideline from the American Pain Society, the American Society of Regional Anesthesia and Pain Medicine, and the American Society of Anesthesiologists’ Committee on Regional Anesthesia, Executive Committee, and Administrative Council J Pain Chou R Gordon DB de Leon-Casasola OA 131 157 17 2016 26827847 10.1016/j.jpain.2015.12.008 4 Combination of thoracic blocks as a main anesthetic tecnique in modified radical mastectomy for patients with severe respiratory disease Rev Esp Anestesiol Reanim (Engl Ed) Galán Gutiérrez JC Tobera Noval B Sáenz Abós FJ González Rodríguez M Fernández Meré LA Sopena Zubiria LA 157 162 66 2019 30503529 10.1016/j.redar.2018.10.003 5 Ultrasound-assisted approach to blocking the intercostal nerves in the mid-axillary line for non-reconstructive breast and axilla surgery [Article in Spanish] Rev Esp Anestesiol Reanim Diéguez García P Fajardo Pérez M López Álvarez S Alfaro de la Torre P Pensado Castiñeiras AP 365 370 60 2013 23742791 10.1016/j.redar.2013.04.002 6 Serratus-intercostal interfascial block as an opioid-saving strategy in supra-umbilical open surgery Rev Esp Anestesiol Reanim (Engl Ed) Fernández Martín MT López Álvarez S Pérez Herrero MA 456 460 65 2018 29789137 10.1016/j.redar.2018.03.007 7 Strengthening the reporting of observational studies in epidemiology using Mendelian randomization: the STROBE-MR statement JAMA Skrivankova VW Richmond RC Woolf BA 1614 1621 326 2021 34698778 10.1001/jama.2021.18236 8 BRILMA block for costal cartilage excision: case report Rev Esp Anestesiol Reanim (Engl Ed) Silva Pereira T Rodrigues Silva C Veiga NF Alfaro de la Torre P Kabiri-Sacramento M 271 274 67 2020 32143823 10.1016/j.redar.2020.01.009 9 Measurement properties of visual analogue scale, numeric rating scale, and pain severity subscale of the Brief Pain Inventory in patients with low back pain: a systematic review J Pain Chiarotto A Maxwell LJ Ostelo RW Boers M Tugwell P Terwee CB 245 263 20 2019 30099210 10.1016/j.jpain.2018.07.009 10 Sampling and Sample Size: A Practical Guide for Health Personnel Conducting Research [Book in Spanish] Una guía práctica para personal de salud que realiza investigación Tapia Tenorio AE 54 55 Buenos Aires e-libro 1 2018 https://www.academia.edu/36141136/MUESTREO_Y_TAMA%C3%91O_DE_MUESTRA_Una_gu%C3%ADa_pr%C3%A1ctica_para_personal_de_salud_que_realiza_investigaci%C3%B3n 11 A randomised controlled study of the post-operative analgesic efficacy of ultrasound-guided pectoral nerve block in the first 24 h after modified radical mastectomy Indian J Anaesth Kumar S Goel D Sharma SK Ahmad S Dwivedi P Deo N Rani R 436 442 62 2018 29962525 10.4103/ija.IJA_523_17 PMC6004763 12 Case report: serratus intercostal plane block/BRILMA and sedation for mastectomy in a high risk patient Rev Esp Anestesiol Reanim (Engl Ed) Sanllorente-Sebastián R de Vicente-Lorenzo JM Mediavilla-Herrera FJ Gutiérrez-García S Alario-Poza IS Bustinza-Beaskoetxea Z 46 48 66 2019 30115502 10.1016/j.redar.2018.06.009 13 Comparing the quality of analgesia with ultrasound-guided pectoral nerve block and serratus anterior plane block II in patients undergoing modified radical mastectomy: a randomised clinical trial Anaesthesiol Intensive Ther Alshawadfy A Al-Touny SA 52 59 55 2023 37306272 10.5114/ait.2023.126218 PMC10156570 14 Randomized controlled trial comparing the efficacy of pectoral nerve block with general anesthesia alone in patients undergoing unilateral mastectomy Indian J Surg Oncol Sharma S Tiwari S Sharma K Nair N 158 163 12 2021 33814847 10.1007/s13193-020-01269-2 PMC7960852 ",
  "metadata": {
    "Title of this paper": "Randomized controlled trial comparing the efficacy of pectoral nerve block with general anesthesia alone in patients undergoing unilateral mastectomy",
    "Journal it was published in:": "Cureus",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12476869/"
  }
}