{
  "title": "Paper_523",
  "abstract": "pmc J Med Chem J Med Chem 822 acssd jm Journal of Medicinal Chemistry 0022-2623 1520-4804 pubs.acs.org/jmc pmc-is-collection-domain yes pmc-collection-title ACS AuthorChoice PMC12481485 PMC12481485.1 12481485 12481485 40912684 10.1021/acs.jmedchem.5c01184 1 Article Development of\nOptimized Exatecan-Based Immunoconjugates\nwith Potent Antitumor Efficacy in HER2-Positive Breast Cancer 7633022 Auvert Etienne 7192348 Douez Emmanuel 7192352 Jolivet Louis 7633036 Witkowski Tiffany 7633040 Jallas Anne-Catherine 7192354 https://orcid.org/0000-0002-8610-1122 Boursin Fanny 7633046 Molnar Ioana 4771960 https://orcid.org/0000-0003-1651-6813 Colas Cyril 7633054 Wittmann Sandrine Valsesia 7633059 Auriol Manon 5967300 Chezal Jean-Michel 7192359 Aubrey Nicolas 2435730 https://orcid.org/0000-0002-6973-6812 Allard-Vannier Emilie 7633072 Maisonial-Besset Aurélie 3404940 https://orcid.org/0000-0002-7335-4921 Joubert Nicolas 5643625 https://orcid.org/0000-0002-9901-7608 Denevault-Sabourin Caroline  † UMR\n1100, Research Center for Respiratory Diseases (CEPR), Team Proteolytic\nenzymes and their pharmacological targeting in lung diseases University of Tours Inserm F-37032 Tours France  ‡ UPR\n4301, Center of molecular Biophysics (CBM), CNRS, NMNS department University of Tours F-37200 Tours France  § Pharmacy\nDepartment Tours University Hospital F-37200 Tours France  ∥ UMR\n1282 ISP, Team BioMAP University of Tours-INRAE F-37200 Tours France  ⊥ UMR\n1240, Imagerie Moléculaire et Stratégies Théranostiques\n(IMoST) 27006 Université Clermont Auvergne Inserm F-63000 Clermont-Ferrand France  # Inserm U1296\nRadiations: Défense, Santé, Environnement Centre Léon Bérard F-69008 Lyon France  ∇ Institute\nof Organic and Analytical Chemistry, ICOA UMR 7311 CNRS University of Orléans F-45100 Orléans France * caroline.denevault@univ-tours.fr * nicolas.joubert@univ-tours.fr 05 9 2025 25 9 2025 68 18 497980 19122 19142 29 4 2025 08 8 2025 08 8 2025 05 9 2025 30 09 2025 01 10 2025 01 10 2025 © 2025 The Authors. Published by American Chemical Society 2025 The Authors https://creativecommons.org/licenses/by-nc-nd/4.0/ This article is licensed under CC-BY-NC-ND 4.0 The prognosis of\nhuman epidermal growth factor receptor 2 (HER2)-positive\nbreast cancer has significantly improved with the advent of anti-HER2\ntherapies, especially antibody-drug conjugates (ADCs). In this field,\nADCs, like trastuzumab deruxtecan (T-DXd), using camptothecin analogs,\nrepresent a promising strategy. However, T-DXd can induce resistance\nand serious adverse effects, potentially driven by a non-specific\nFcγ receptor-mediated endocytosis. Here, we report the development\nof novel HER2-targeting conjugates, using the camptothecin derivative\nexatecan and a linker optimized to control hydrophobicity. Three formats\nwere evaluated: a high drug-to-antibody ratio (DAR) 8 IgG-based ADC\n(IgG(8)-EXA), and two DAR 4 Fc-free constructs (Mb(4)-EXA and Db(4)-EXA).\nThus, IgG(8)-EXA and Mb(4)-EXA displayed potent, specific cytotoxicity\nagainst HER2-positive breast cancer cells and strong antitumor activity\nin vivo . Agence Nationale de Recherches sur le Sida et les Hépatites Virales 10.13039/501100003323 ANR-10-LABX-53-01 Agence Nationale de Recherches sur le Sida et les Hépatites Virales 10.13039/501100003323 ANR-22-PEBI-0009 Ligue Contre le Cancer 10.13039/501100004099 NA Université de Tours 10.13039/501100007526 NA Conseil Régional du Centre-Val de Loire 10.13039/501100009469 NA pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement yes pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes document-id-old-9 jm5c01184 document-id-new-14 jm5c01184 production-flag-MathML-config-version 3 production-flag-journal-citation-display-style acs-titles production-flag-journal-date-display-style dates-used-rcd-rvd-acc production-flag-si-avail yes document-id-alt-64 467b3cacd7e0a6f940e17e071406612921a5b59adb29b5fb38f35dc2203d846d Introduction Breast cancer (BC) is the most common\ncancer worldwide. In 2022,\nalmost 2.31 million new cases and 666 000 deaths from this disease\nwere estimated globally by the International Agency for Research on\nCancer (IARC). HER2 HER2    ADCs are a combination of a potent small molecule\n(also called\na drug or payload) chemically attached via a linker onto a monoclonal\nantibody (mAb), used as a carrier, and allowing the selective delivery\nof the drug into the tumor. The Food and Drug Administration (FDA)\napproved two anti-HER2 ADCs, the trastuzumab emtansine (T-DM1) and,\nmore recently, the trastuzumab deruxtecan (T-DXd). T-DM1 consists\nof the linker emtansine (4- N    N p    However, T-DXd presents a toxicity profile close to\nthe one observed\nwith conventional chemotherapy, such as gastrointestinal and hematologic\nadverse effects or alopecia. Approved therapeutic ADCs are constructed using a mAb\nwith an immunoglobulin\nG (IgG) format. The IgG format possesses a fragment crystallizable\n(Fc) domain, which has advantages but also drawbacks. Indeed, it can\nbind to the neonatal Fc receptor (FcRn), increasing biological half-life\nbut also the exposure of healthy tissues. Moreover, this IgG1 isotype\ncan also engage FcγR via the Fc portion, which can be responsible\nfor secondary immune functions (antibody-dependent cell-mediated or\ncomplement-dependent cytotoxicities) that can contribute to the mechanism\nof action of the immunoconjugate. Nevertheless, as previously mentioned,\nFcγR-mediated uptake of immunoconjugate by normal tissues can\nalso trigger off-target toxicity like thrombocytopenia. Exatecan is a camptothecin topoisomerase I\ninhibitor closely related\nto DXd.  12   We reported herein the\ndesign, synthesis, characterization, and\nbiological evaluations of these new immunoconjugates. Results Design of Antibody\nFormats and Drug Linkers In this\nstudy, three immunoconjugates formed with different antibody formats,\ntargeting HER2, were compared to the marketed T-DXd and to a negative\ncontrol, a DAR 8 ADC, synthesized using a nonrelevant humanized IgG\n(IgG irr H L 3 H L H L L H L The enzyme-cleavable drug-linker includes the Ala-Ala-PABC sequence,\na cathepsin B-sensitive trigger, where the PABC plays the role of\na self-immolative spacer to free the potent unmodified cytotoxic agent\nexatecan. The l l  Figure 12 1 Bioconjugation\nprocess, exatecan drug-linker structure, and mechanism\nof exatecan release from the immunoconjugates developed in this study. Synthesis of Exatecan Drug-Linkers For the synthesis\nof exatecan drug-linker, a convergent and modular synthetic route\nwas developed, using Ala-Ala-PABC-exatecan TFA salt 6 12 9 Schemes 1 Synthetic\nRoute for Intermediate 6  a Reagents and conditions: (a)\nAla-O t p 2 Synthetic Route for Exatecan Drug-Linker\n12  a Reagents and conditions: (a)\n6-aminocaproic acid (0.95 equiv), HOBt (1.05 equiv), DIPEA (0.95 equiv),\nEDC.HCl (1.05 equiv), DMF, rt, overnight, quant.; (b) TFA, DCM, rt,\n3 h, quant.; (c) MeO-PEG 12 6 The preparation\nof intermediate 6 Scheme l l tert tert 2 para 4 4 5 6 Then,\na three-step synthetic pathway efficiently produced the Fmoc-Lys-(PEG 12 9 Scheme 8 12 9 Finally, the coupling reaction between intermediates 6 9 11 12 12 Site-Specific\nBioconjugation The bioconjugation of\ndrug-linker 12 irr Figure 12 13 16 Figure 13 16 14 15 13 16 Supporting Information Figures S1–S4 Supporting Information Figure S5 Table Supporting Information Figures S1 and S4 Table Supporting Information Figures S2 and S3). 2 Schematic\nrepresentations of immunoconjugates 13 16 1 Analysis of the Immunoconjugates conjugate mAb format name DAR %monomers 13 anti-HER2\nIgG IgG(8)-EXA 7.8 97.4 14 anti-HER2 minibody Mb(4)-EXA 3.6 100 15 anti-HER2 diabody Db(4)-EXA 4.0 100 16 irrelevant IgG IgG irr 7.7 98.1 trastuzumab deruxtecan anti-HER2 IgG T-DXd 7.7 90.3 a Average drug-to-antibody ratio (DAR)\ndetermined by MS and UV/vis spectroscopies. b Determined by SEC-HPLC analyses. Finally, analytical SEC-HPLC (size-exclusion\nchromatography-high\nperformance liquid chromatography) was used for immunoconjugate aggregation\nanalysis. These studies revealed that immunoconjugates 13 16 Supporting Information Figure S6 Table 12 12 Supporting Information Figure S6 Cathepsin B Enzymatic Cleavage The enzymatic cleavage\nafter exposure of whole immunoconjugate 14 Supporting Information Figure S7 10 Supporting Information Figure S8 In Vitro Binding Recognition Since\nthe affinity of\nan immunoconjugate is crucial for the selective targeting of tumor\ncell-surface antigens, we further investigated the HER2 binding properties\nof all immunoconjugates in comparison to their unconjugated native\nantibody format using indirect enzyme-linked immunosorbent assay (ELISA).\nNo significant change in HER2 binding recognition was observed when\nthe antibody formats were entirely reduced and conjugated to drug-linker 12 Figure 12 3 HER2 binding recognition measured by indirect ELISA of: ( A 13 B 14 C 15 HER2-Mediated Endocytosis of Immunoconjugates An efficient\nendocytosis within HER2-positive tumor cells is also an essential\nstep for the activity of such immunoconjugates, permitting the trafficking\ninto the lysosome, where the cathepsin B-catalyzed release of exatecan\ncan occur. The HER2-mediated internalization of all immunoconjugates\nwas therefore assessed by flow cytometry and fluorescence microscopy\nexperiments on a SK-BR-3 human breast cancer cell line, characterized\nby HER2 (Neu/ErbB-2) gene amplification, leading to HER2 overexpression\nat the cell membrane surface (HER2-positive). We first evaluated the\nendocytosis by a semiquantitative method using flow cytometry, after\nthe preincubation of immunoconjugates with an intracellular tracer,\nthe protein L coupled to phycoerythrin (ppL-PE) ( Supporting Information Figure S9 Figure 13 15 irr 16 13 15 13 14 Figure 13 15 13 15 irr 16 4 Internalization of immunoconjugates in SK-BR-3 (HER2-positive)\ncells. ( A irr 16 13 14 15 p p B irr In Vitro Cytotoxicity against\nBreast Cancer Cells In\nvitro cytotoxicity of immunoconjugates 13 16 Figure Table Figure 50 16 Table 50 13 15 13 15 50 50 13 50 14 15 50 50 13 50 13 15 5 In vitro cytotoxic activity of IgG irr 16 13 14 15 A B 2 In Vitro Cytotoxicity Data    IC 50 Cpd mAb format DAR SK-BR-3 (HER2-positive) MDA-MB-468 (HER2-negative) 13 anti-HER2 IgG 7.8 0.41 ± 0.05 >30 14 anti-HER2 minibody 3.6 9.36 ± 0.62 >30 15 anti-HER2\ndiabody 4.0 14.69\n± 6.57 >30 16 irrelevant IgG 7.7 >30 >30 T-DXd anti-HER2 IgG 7.7 0.04 ± 0.01 >30 exatecan -  0.18 ± 0.01 0.15 ± 0.09 a IC 50 b IgG­(8)-EXA. c Mb­(4)-EXA. d Db­(4)-EXA. e IgG irr f T-DXd. g Average drug-to-antibody\nratio (DAR). Ex Vivo Mouse\nand Human Serum Stability Prior to in\nvivo administration, an ex vivo serum stability study was performed\non the most active immunoconjugate 14 Figure Figure 14 14 6 Comparison\nof average DAR variation for IgG(8)-EXA (red) and T-DXd\n(green) upon incubation over 192 h in mouse (A) and human (B) serum,\nassessed by affinity capture and LC-MS analysis. Values are normalized\nagainst DAR measured at time 0. Radiolabeling of Immunoconjugates Because highly loaded\nimmunoconjugates can be associated with a poor PK profile, we decided\nto carry out further studies on binding capacity and in vivo biodistribution\non our most active ADC 13 13 125 125 125 13 Supporting Information Figure S10 Immunoreactive Fraction To ensure\nthat the bioconjugation\nof the exatecan drug-linker 12 125 125 13 125 125 125 125 Supporting Information Figure S11 12 7 Ex vivo tissue/organ biodistribution of [ 125 A B 125 [  125 I]­13 C D n A n 125 B C n 125 125 13 D Biodistribution, SPECT-CT Imaging, and Metabolism\nStudies The biodistribution of the radioimmunoconjugates\n[ 125 125 13 125 Figures Supporting Information Figures S12, S13, Tables S1, and S2 125 125 13 125 125 125 8 Ex vivo\ntumor biodistribution (%ID/g) of the two radioiodinated\nimmunoconjugates in female SCID CB17 mice bearing subcutaneous BT-474-SCID\ngrafts. All mice were injected (i.v.) with (i) 3.91 ± 0.57 or\n15.49 ± 0.01 MBq (5 d group, n 125 125 13 n 125 A B C In contrast, in all other organs (except for classical\nurinary\nand gastrointestinal elimination routes), the radioactivity uptake\nwas lower than ∼ 10% ID/g and continuously decreased over time.\nWhile the systemic clearance in blood and nontargeted organs fastly\noccurred from 48 h p.i., a slow wash-out of the radioactivity from\nthe tumor was observed, with %ID/g detected in the tumors still significant\nat day 5 p.i. (18.8 ± 1.1% ID/g for [ 125 125 13 125 125 125 13 125 125 125 13 125 Figures This radioactivity distribution pattern was consistent with a specific\nbinding to the tumor antigen, in accordance with the IRF values previously\nobserved. This promising biodistribution profile for [ 125 125 13 Figure 125 Supporting Information Figure S12 125 Supporting Information Figure S14 125 125 13 125 125 13 12 9 Representative SPECT-CT (coronal section) images of a mouse bearing\northotopic BT-474-SCID tumor injected (i.v.) with 15 MBq of [ 125 125 13 3 In Vivo Efficacy In vivo experiments were finally conducted\non the two most promising candidates of this study: the very potent\nhighly loaded ADC 13 14 The in vivo antitumoral activity of IgG(8)-EXA\n( 13 14 3 14 13 13 13  The body\nweight of the mice of each group was carefully controlled\nas a sign of toxicity and potential overdosing, but no significant\nchange in body weight was observed throughout the whole efficacy study,\nhighlighting that the treatments were all well tolerated ( Supporting Information Figure S13 The\ntumor growth ( Supporting Information Table S3 p p Supporting Information Table S4 Figure 10 Schematic representation\nof administration schedule ( A B The dose-dependent effect clearly\nobserved for the groups that\nreceived IgG(8)-EXA ( 13 p Overall, this preliminary efficacy\nstudy showed that IgG(8)-EXA\n( 13 14 Discussion and Conclusions In the field of ADCs development,\nthe design of third-generation\nimmunoconjugates bearing less cytotoxic payloads (like the two camptothecin\nanalogs DXd and SN-38) than those commonly used in first and second-generation\nADCs in clinic (i.e., microtubule inhibitors or DNA-damaging agents)\nseems to be an emerging and promising strategy. This is reflected\nby the approval in recent years of several ADCs containing camptothecin\nanalogs,  In addition, even if T-DXd represents a real breakthrough in the\ntreatment of HER2-positive solid tumors, it often induces severe side\neffects and patients finally experience progression of disease, due\nto acquired mechanisms of resistance.  12  Many studies\nhave shown that conjugation onto mAbs of nonoptimized\nhydrophobic drug-linkers with high DAR increases the overall hydrophobicity\nof the immunoconjugates produced, promoting aggregates, accelerated\nplasma clearance, immunogenicity, off-target toxicity, and reduced\nin vivo efficacy.     In this study, we developed a convergent and modular synthetic\nroute leading to the new exatecan-based drug-linker 12 9 The orthogonal lysine-(PEG) 12 12 12 Enzymatic studies after exposure\nof immunoconjugate 14 Moreover, conjugation\nof the drug-linker 12 12 In addition, for all anti-HER2\nconjugates of this study, efficient\nendocytosis within HER2-positive breast cancer cells was observed,\nwith a markedly improved internalization profile, in comparison to\nT-DXd, especially for IgG(8)-EXA ( 13 14 12 Finally, the performance of these exatecan-based immunoconjugates\nwas confirmed with a specific, low nanomolar to subnanomolar cytotoxicity\n(proportionally to the DAR) against HER2-positive cancer cells, for\nthe two most promising candidates, IgG(8)-EXA 13 14 13 l l Our previous studies related to immunoconjugates bearing\nan orthogonal\nlysine-(PEG) 12 C P C P 13 12 13 14 14  14 13 These promising results remain to be completed, particularly\nwith\nfurther in vivo innocuity studies to confirm the therapeutic potential\nof these two candidates. This drug-linker strategy could ultimately\nbe applied to different types of antibodies and antibody fragments\nfor applications in a large variety of tumors. Experimental\nSection Protein Expression, Purification, and Characterization For the synthesis of IgG(8)-EXA ( 13 14 15 irr 16 Loxosceles intermedia GeneArt synthesized\nthe sequences of all antibody format constructs in pcDNA3.4 plasmids\n(Thermo Fisher Scientific, Waltham, USA). We designed the nucleotide\nsequences with optimized codons from Cricetulus griseus 6 2 6 2 For the purification step, supernatants were deep-frozen, then\ncentrifuged at 10,000 g for 20 min, passed over a 220 nm filter, and\npurified by affinity chromatography with a kta purifier (Cytiva Europe\nGmbH, Velizy-Villacoublay, France, 17–5478–14). We purified\nthe various antibody formats using a HiScreen Capto L column (Cytiva\nEurope GmbH, Velizy-Villacoublay, France, 17–5478–14)\nin phosphate-buffered saline (PBS) (2.7 mM KCl, 0.10 M NaCl, 2 mM\nKH 2 4 2 4 http://web.expasy.org/protparam/ We assessed the integrity\nand size of all purified antibody formats\nby sodium dodecyl sulfate-polyacrylamide gel electrophoresis (SDS-PAGE),\non homogeneous 12% polyacrylamide gel, under reducing or nonreducing\nconditions. We loaded all purified antibody format samples at 1 μg\nfor Coomassie Blue staining (0.1% Coomassie Brilliant Blue R-250,\n10% glacial acetic acid, and 30% methanol). Then, we resolved\nthe purified antibody formats preparations by\nSEC-HPLC analysis, on a Superdex 200 10/300 GL column (molecular mass\nrange 10,000–200,000 Da) (GE Healthcare Life Sciences), with\nan Äkta purifier. We loaded the column with 0.02 mg of each\nantibody format. We eluted the proteins with PBS at a rate of 0.5\nmL/min, and we detected them at 280 nm with a UV detector. Then,\nwe performed differential scanning fluorimetry experiments\non a nanoDSF device (Prometheus NT.48, NanoTemper) to determine the\nthermal unfolding. We used all samples at a final concentration of\n0.01 nM and loaded them into high-sensitivity capillaries. We subjected\nthe protein unfolding process to a thermal ramp (20 to 95 °C,\n1 °C/min). We performed data analysis using the Prometheus PR\nThermControl software. We determined the thermal denaturation (Tm)\nvalue by fitting the tryptophan 350/330 nm fluorescence emission ratio\nusing a polynomial function, in which the maximum slope was indicated\nby the peak of its first derivative. Synthesis of Compounds We purchased all solvents as\nanhydrous reagents from commercial sources. We obtained all of the\nreagents and chemicals from commercial sources and used them without\npurification (unless otherwise noted). Exatecan mesylate was purchased\nfrom Advanced ChemBlocks Inc. (#10484). The 6-maleimidocaproic acid\nwas prepared according to literature procedures. We performed thin layer chromatography (TLC) using\ncommercial precoated aluminum sheets, silica gel (60 Å, F254;\nMerk). We revealed them under a 254 nm UV lamp. We carried out column\nchromatography on a Combi Flash RF 75 PSI, an ISCO purification unit,\nusing Redisep flash silica gel columns (60 Å, 230–400\nmesh, grade 9385). We determined the purity of the compounds by high-performance\nliquid chromatography (HPLC) or by ultra-performance liquid chromatography\n(UPLC). We carried out HPLC analyses with a LaChrom Elite system [Hitachi\nL-2130 (pump), L-2400 (UV-detector at 254 nm at 25 °C) and L-2200\n(autosampler)], using a XBridge C-18 column (250 mm × 10 mm,\n4 μm, 135 Å). We eluted with a flow rate of 1 mL/min, using\n0.1% trifluoroacetic acid (TFA) in water (solvent A), and 0.1% TFA\nin acetonitrile (MeCN) (solvent B), with a gradient over 35 min from\n20% of B to 100% of B. We injected 10 μL of each sample at 1\nmg/mL in DMSO. We carried out UPLC analyses using a Waters ACQUITY\nUPLC H-Class system (UV-detector at 254 nm at 25 °C) equipped\nwith a Waters XBridge BEH C-18 column (100 mm × 2.1 mm, 2.5 μm,\n130 Å). We eluted with a flow rate of 0.5 mL/min, using solvents\nA and B (predefined for HPLC analysis), with a gradient from 5 to\n100% B over 5 min. We injected 3 μL of each sample at 1 mg/mL\nin DMSO. We purified the compounds by semipreparative HPLC according\nto the following general method: we purified each crude product on\na Gilson PLC 2050 system [ARMEN V2 (pump), ECOM TOYDAD600 (UV-detector\nat 254 nm at 25 °C)] equipped with a Waters XBridge C-18 column\n(250 mm × 19 mm, 5 μm); we eluted with a flow rate of 17.1\nmL/min, using solvents A and B (predefined for HPLC analysis) with\na gradient from 20 to 100% of B over 32 min and then 100% of B for\n6 min. NMR spectra were recorded at 400 MHz ( 1 13 19 2 3  For small-molecule mass analysis,\nwe performed HRMS analysis with\nan Acquity UPLC H-Class system, hyphenated to a mass spectrometer,\na Vion IMS Q-Tof instrument (Waters). Before MS analysis, we injected\n1.0 ng of each sample onto a BEH C18 column (2.1 mm × 50 mm,\n1.7 μm), which was heated to 50 °C. We eluted each sample\nwith a flow rate of 0.5 mL/min, using solvents A (H 2 m z Fmoc-Ala-Ala-O t To a solution\nof Fmoc-Ala-OH (250.1 mg, 0.803 mmol) in dry DMF (4 mL), under an\nargon (Ar) atmosphere, were added the hydrochloride salt of l tert t H b 2 1 d  6 J J J J J Fmoc-Ala-Ala-OH (2) To a solution\nof compound 1 2 1 d  6 J J J J J J J Fmoc-Ala-Ala-PAB–OH (3) A mixture of compound 2 N p 3 1 d  6 J J J J J J J J J m z + 28 30 3 5 Fmoc-Ala-Ala–PABC-PNP\n(4) To a solution of compound 3 4 1 d  6 J J J J J m z + 35 33 4 9 Ala-Ala-PABC-exatecan TFA\nsalt (6) To a solution of\ncompound 4 N N 5 m z + 53 50 6 10 5 6 1 d  6 J J J J J 19 d  6 J m z + 38 40 6 8 Fmoc-Lys­(Boc)-Cap–OH\n(7) To a solution of Fmoc-Lys­(Boc)–OH\n(200.1 mg, 0.427 mmol), 6-aminocaproic acid (53.3 mg, 0.407 mmol),\nHOBt (60.6 mg, 0.448 mmol), and DIPEA (7.0 μL, 0.41 mmol) in\ndry DMF (2 mL), under an Ar atmosphere, was added N N 4 7 1 d  6 J J J J J m z + 32 44 3 7 Fmoc-Lys-Cap–OH\nTFA Salt (8) To a solution of\ncompound 7 8 1 d  6 J J J J 13 d  6 19 d  6 m z + 27 36 3 5 Fmoc-Lys­(PEG 12 To a solution\nof compound 8 12 9 1 d  6 J J J J m z + 53 86 3 18 Fmoc-Lys­(PEG 12 To a solution of\ncompound 9 6 10 1 d  6 J J J J J J 19 d  6 J m z + 91 123 9 25 Lys­(PEG 12 To a solution of compound 10 11 1 d  6 J J J J J J 19 d  6 J m z + 76 113 9 23 Mc-Lys­(PEG 12 To a solution of\ncompound 11 12 1 d  6 J J J J J 19 d  6 J m z + 86 124 10 26 Bioconjugation\nof Antibody Formats with the Exatecan Drug-Linker\n12 IgG­(8)-EXA (13) General method: into a vial were added\nthe anti-HER2 IgG (968.0 μg/mL, 500 μL, 6.7 μM in\nBBS buffer (pH 8)) and TCEP (53.24 μL, 16 equiv, 1 mM in BBS\nbuffer), and we incubated the reaction for 1.25 h at 37 °C under\nagitation (300 rpm). Then, we added drug-linker 12 13 2 12 13 Mb­(4)-EXA (14) We prepared the title\nimmunoconjugate\naccording to the general method, using the anti-HER2Mb (859.2 μg/mL,\n500 μL, 10.8 μM in BBS buffer), TCEP (32.46 μL,\n6 eq, 1 mM in BBS buffer), and drug-linker 12 12 14 Db­(4)-EXA (15) We prepared the title immunoconjugate\naccording to the general method, using the anti-HER2 Db (708.0 μg/mL,\n500 μL, 13.7 μM in BBS buffer), TCEP (27.34 μL,\n4 eq, 1 mM in BBS buffer), and drug-linker 12 12 16 IgG irr We prepared the title\nimmunoconjugate according to the general method, using an irrelevant\nIgG (IgG irr 12 irr 12 17 Characterization of Immunoconjugates We analyzed immunoconjugates\nby denaturing HRMS analysis on a Bruker maXis mass spectrometer coupled\nto a Dionex Ultimate 3000 RSLC system. Prior to MS analysis, we desalted\neach sample (ca. 5 μg) on a MassPREP desalting cartridge (2.1\n× 10 mm, Waters), which was heated at 80 °C, using 0.1%\nformic acid (solvent A) and 0.1% formic acid in MeCN (solvent B) at\na rate of 500 μL/min. After 1 min, we applied a linear gradient\nfrom 5 to 90% B in 1.5 min, for which the first 1.5 min were diverted\nto waste. We acquired HRMS data in positive mode with an ESI source,\nover the m z average L H For the minibody format, we recorded the\nresults for the fragments V H L 3 average VHVL–CH 3 For the diabody format, we recorded the results for\nfragments V H L average VHVL For SEC-HPLC analysis, we diluted each sample of\nthe immunoconjugate\nto 1.0 mg/mL with PBS (pH 7.4) and filtered it on a 220 nm PVDF membrane.\nWe injected a sample of 40 μg on an AdvanceBio SEC instrument\n(7.8 × 300 mm, 2.7 μm) from Agilent Technologies connected\nto a Waters Alliance (e2695) apparatus, equipped with a photodiode\narray detector (2998) set for detection at 280 nm. We eluted each\nsample with an isocratic gradient (1.0 mM potassium phosphate monobasic,\n3 mM sodium phosphate dibasic, 155 mM sodium chloride, and 3 mM sodium\nazide, pH 7.0) over 24 min at a flow rate of 1.0 mL/min. We maintained\nthe column oven temperature at 25 °C. Cathepsin B Enzymatic Cleavage First, we realized the\ncleavage of the Ala-Ala linker. The reactivity of the maleimide scaffold\nof linker 12 10 10 The cleavage of the whole immunoconjugate was realized on immunoconjugate 14 14 HER2-Binding ELISA Assay We coated HER2 recombinant\nprotein (Sino Biologicals, Beijing, P. R. China) in 96-well plates\nat 1.0 μg/mL in PBS and we incubated it overnight at 4 °C.\nThen we saturated the wells with 3.0% bovine serum albumin (BSA)-PBS\nat 37 °C for 1 h, and we washed with PBS, prior to incubation\nwith PBS (negative control), immunoconjugates, nonconjugated antibody\nformats, or trastuzumab deruxtecan (Enhertu, Daiichi Sankyo, Japan)\nfrom 0.001 to 1000 (or 100) nM at 37 °C during 1 h. Then, we\nwashed the wells with PBS-Tween 20 (0.05%) and incubated them with\n100 μL of protein-L-peroxydase (ThermoScientific) at 1.25 μg/mL\nat 37 °C for 1 h; then, we added 100 μL of 3,3′,5,5′-tetramethylbenzidine\n(TMB) substrate (Sigma) in each well. Finally, we stopped the enzymatic\nreaction with the addition of 50 μL of 1.0 M H 2 4 Cell Culture We obtained MDA-MB-468 human breast carcinoma\ncells from the American Type Culture Collection (LGC Promochem). The\ncells were cultured in Minimum Essential Medium (MEM) with GlutaMAX,\n10% fetal bovine serum (FBS, Gibco), sodium pyruvate (100 nM), AANE\n1X (100X), vitamins 1X (100X), 1% penicillin-streptomycin solution\n(10,000 U/mL, Gibco), and gentamycin (50 mg/mL, Gibco) at 37 °C\nwith 5% CO 2 2 2 Flow Cytometry Analysis\nfor Internalization We used\nprotein L coupled with phycoerythrin (ppL-PE, Sinobiological, Beijing,\nChina) as an intracellular tracer. Protein L was obtained from Peptostreptococcus magnus Fluorescence Microscopy\nfor Internalization We incubated\n150,000 SK-BR-3 or MDA-MB-468 cells for 24 h on poly- d In Vitro Cytotoxicity Cell viability was studied using\nthe CellTiter-Glo cell proliferation assay (Promega, Wisconsin, USA),\nby means of a luminescent test based on ATP quantification. Briefly,\nwe incubated 3000 MDA-MB-468 cells or 6,000 SK-BR-3 cells in 100 μL\nof medium in 96-well plates for 24 h. Then we treated them with concentrations\nranging from 0.001 to 1000 nM of the tested compounds. We incubated\ncells with 100 μL of each compound with 5% CO 2 2 2 50 n Serum Stability Analysis Immunoconjugate samples were\nprepared in IgG-depleted human serum or mouse serum at 50% serum content\nand a 0.5 mg/mL immunoconjugate concentration. Immunoconjugates were\nassessed for stability over a 192 h time course at 37 °C with\nsamples taken for analysis at 24, 48, 72, 96, and 192 h and frozen\nat −80 °C until analysis. Samples were assessed by affinity\ncapture and LC-MS analysis for the average DAR assessment. Affinity\ncapture of the serum stability samples was carried out using Cytiva\nprotein A magnetic beads (Cytiva Cat. 28944006) by incubating with\nserum samples for 1 h at rt with constant mixing. The beads were washed\nthoroughly with wash buffer before the elution of immunoconjugate\nsamples from the beads with 2 mM HCl. The acidic eluent was neutralized\nwith 100 mM TRIS buffer, pH 8.0. Eluents were reduced by adding 200\nmM final DTT and analyzed by LC-MS on a Waters H Class Acquity in\nline with a Waters RDa TOF (Waters Bioaccord). The chromatographic\nseparation was performed by denaturing SEC (dSEC) on a Waters Acquity\nUPLC Protein BEH SEC, 200 Å, 1.7 μm, 4.6 mm × 300\nmm column. The elution was performed under isocratic conditions at\n0.3 mL/min with 0.1% formic acid and 30% Acetonitrile in water as\nthe mobile phase. The MS analysis was performed in positive polarity\nunder continuous scanning at 400–7000 m z In Vivo Tumor Model All animal experiments were performed\nin accordance with the European directive 2010/63/EU following the\nprotocols evaluated and approved by the governmental committee APAFiS\n(Ethics Approval Number: #39465–2022111811066226 v5). Seven\n(biodistribution study) or six (therapeutic efficacy study) weeks\nold SCID CB17 female mice (Charles River Laboratories, Domaine des\nOncins, L’abresle, France) were housed in standard conditions\n(4 to 6 animals per cage, on ventilated racks, 60% humidity, temperature\n21–24 °C, 12/12 h light/dark cycle, with free access to\nstandard food and water). A total of 5 million BT-474-SCID cells were\ninjected subcutaneously (s.c.) in the flank after gaseous anesthesia\n(Isoflurane, Iso-Vet, 1.5%, 1 L/min, air/O 2  L * l 2 2 L l L Radiolabeling with Iodine-125 General We purchased [ 125 –5 –1 Radiolabeling with Iodine-125 We radiolabeled antibodies\nvia direct electrophilic radioiodination, on tyrosine residues, using\nPierce tubes precoated with iodogen (a mild-oxidative reagent) according\nto a well-established protocol. 125 [ 125 n [ 125 [  125 I]­13 n Immunoreactivity of Radiolabeled Entities to BT-474-SCID cells We performed all experiments with low retention tubes, pretreated\nwith BSA (10 mg/mL) at 4 °C for 24 h, before rinsing twice with\nPBS. We incubated BT-474-SCID cells (1 × 10 6 6 6 6 125 125 125 13 Biodistribution\nStudies Experiments were carried out\n(i) 32 d post tumor cell inoculation for the 6 h, 24 h, 48 h, 3 d,\n5 d p.i. time-point groups, and 57 d for the 11 d p.i. time-point\ngroup, corresponding to a mean tumor volume (TV) of 211 ± 70\nmm 3 125 ([  125 I]­13 3 125 n 125 125 13 n 125 n SPECT-CT Imaging Studies We performed all imaging experiments\nat the IVIA facility (Clermont-Ferrand, France; https://www.ibisa.net/plateformes/in-vivo-imaging-auvergne-ivia-495.html 2 n 125 125 13 125 Metabolism Studies Livers and tumors\n( n 125 125 13 125 125 125 Therapeutic\nEfficacy Study Efficacy studies were carried\nout 31 days after tumor graft, corresponding to a mean TV of 151 ±\n65.7 mm 3 via For the control\ngroup, 4 animals (TV = 179 ± 111 mm 3 3 3 14 13 3 3 3 During and after treatment protocols,\nwe observed and weighed mice\nto evaluate the general clinical state and detect end points. We calculated\nTV using the formula  L * l 2 2 L l Mice\nwere sacrificed 63 days after cell inoculation (corresponding\nto 32 days post treatment) by gaseous anesthesia, followed by cervical\ndislocation. Statistical Analysis Body weight\nevolution was analyzed\nby multiple comparisons with a two-way ANOVA test. TV evolution was\nanalyzed by a linear mixed model with mixed effects for treatment,\ntime, and interaction. Random effect was used to analyze and integrate\nindividual variations. Posthoc comparison (paired comparison) was\nused on the mixed model with a Benjamini-Hochberg multiple test correction\nin order to study the post-treatment period and adjust p Supplementary Material The authors\nwould like to thank the Hospital Pharmacy\nof the Tours Teaching Hospital and the Cancer Center Jean Perrin (Clermont-Ferrand,\nFrance) for providing us with leftover trastuzumab-deruxtecan (Enhertu®,\nDaiichi Sankyo, Japan), Dr. Warren Viricel, for kindly providing exatecan.\nThis work was supported by a French government grant managed by the\nNational Research Agency under the France 2030 program, with the reference\nANR-22-PEBI-0009. This work was also supported by the French National\nResearch Agency (ANR) under the program “Investissements d’avenir”\nGrant Agreement (ANR-10-LABX-53-01) LabEx MAbImprove, La Ligue contre\nle cancer (committees 18, 35, 36, 37, 41, 44, 53, 72, 79, 85), Tours\nUniversity, and the Centre-Val de Loire Region (projects ARD 2020\nBiomédicament: SELMAT, and project APR IR 2020). E. Auvert\nthanks the Centre-Val de Loire Region and LabEx MAbImprove for his\nPhD fellowship. We thank Cécile Croix from the team Proteolytic\nenzymes and their pharmacological targeting in lung diseases of CEPR\nfor NMR spectrometry and mass analysis, and Alix Cointet, for technical\nsupport, and Fabio Rossi and Mariarosaria Cerchia, from Abzena (Cambridge,\nUK), for serum stability analysis. The Supporting Information is\navailable free of charge at https://pubs.acs.org/doi/10.1021/acs.jmedchem.5c01184 HRMS analysis data of\nall immunoconjugates; UV/vis spectroscopy\nexperiments for drug-to-antibody ratio (DAR) determination of all\nimmunoconjugates; SEC-HPLC analysis data of all immunoconjugates;\ndeconvoluted mass spectra of immunoconjugate 14 10 1 1 4 6 12 13 8 19 6 8 10 12 PDF ○ C.D.-S.\nand N.J. contributed equally to this work. The authors\ndeclare no competing financial interest. Abbreviations ADC antibody-drug\nconjugate Ar argon Db diabody DCM dicholoromethane DIPEA  N N’ EDC.HCl  N N DMF  N N’ DAR drug-to-antibody ratio ELISA enzyme-linked immunosorbent assay EEDQ  N EXA exatecan Fc fragment crystallizable FcγR Fcγ\nreceptors FDA Food\nand Drug Administration HRMS high-resolution mass spectrometry HPLC high-performance liquid chromatography HER2 human epidermal\ngrowth factor receptor\n2 HOBt hydroxybenzotriazole IgG immunoglobulin\nG IRF immunoreactive\nfraction IC 50 50% inhibitory concentration ILD interstitial lung disease i.v. intravenous injection LC-MS liquid chromatography–mass\nspectrometry MFI mean fluorescence intensity MeOH methanol Mb minibody Am molar\nactivities mAbs monoclonal antibodies MMAE monomethyl auristatin E FcRn neonatal Fc receptor HATU  O N N N N PABC  p %ID/g percentage of\ninjected dose per\ngram PK pharmacokinetic PK–PD pharmacokinetic\nand pharmacodynamic PEG polyethylene glycol p.i. postinjection ppL-PE protein L coupled to phycoerythrin RCP radiochemical purity RCY radiochemical yield rt room temperature SEC size-exclusion\nchromatography SD standard deviation T-DXd trastuzumab deruxtecan T-DM1 trastuzumab emtansine TCEP tris­(2-carboxyethyl)­phosphine TKI tyrosine kinase\ninhibitor Bray F. Laversanne M. Sung H. Ferlay J. Siegel R. L. Soerjomataram I. Jemal A. Global Cancer Statistics 2022: GLOBOCAN\nEstimates of Incidence and Mortality Worldwide for 36 Cancers in 185\nCountries CA. Cancer J. Clin. 2024 74 3 229 263 10.3322/caac.21834 38572751 Pernas S. Barroso-Sousa R. Tolaney S. M. Optimal Treatment of Early Stage\nHER2-Positive Breast Cancer Cancer 2018 124 23 4455 4466 10.1002/cncr.31657 30291791 Burstein H. J. The Distinctive\nNature of HER2-Positive Breast Cancers N. Engl.\nJ. Med. 2005 353 16 1652 1654 10.1056/NEJMp058197 16236735 Moasser M. M. The Oncogene\nHER2; Its Signaling and Transforming Functions and Its Role in Human\nCancer Pathogenesis Oncogene 2007 26 45 6469 6487 10.1038/sj.onc.1210477 17471238 PMC3021475 Slamon D. J. Clark G. M. Wong S. G. Levin W. J. Ullrich A. Mcguire W. L. Correlation Amplification Science\n(80-.) 1987 235 4785 177 182 10.1126/science.3798106 3798106 Hurvitz S. A. Gelmon K. A. Tolaney S. M. Optimal Management of Early and Advanced\nHER2 Breast Cancer Am. Soc. Clin. Oncol. Educ.\nB 2017 37 76 92 10.14694/EDBK_175630 28561711 Ferrario C. Christofides A. Joy A. A. Laing K. Gelmon K. Brezden-Masley C. Novel Therapies\nfor the Treatment of HER2-Positive\nAdvanced Breast Cancer: A Canadian Perspective Curr. Oncol. 2022 29 4 2720 2734 10.3390/curroncol29040222 35448196 PMC9026432 Lebert J. Lilly E. J. Developments in the Management of\nMetastatic HER2-Positive\nBreast Cancer: A Review Curr. Oncol. 2022 29 4 2539 2549 10.3390/curroncol29040208 35448182 PMC9030458 Kovtun Y. V. Audette C. A. Ye Y. Xie H. Ruberti M. F. Phinney S. J. Leece B. A. Chittenden T. Blättler W. A. Goldmacher V. S. Antibody-Drug Conjugates Designed\nto Eradicate Tumors with Homogeneous and Heterogeneous Expression\nof the Target Antigen Cancer Res. 2006 66 6 3214 3221 10.1158/0008-5472.CAN-05-3973 16540673 Joubert N. Denevault-Sabourin C. Bryden F. Viaud-Massuard M. C. Towards\nAntibody-Drug Conjugates and Prodrug Strategies with Extracellular\nStimuli-Responsive Drug Delivery in the Tumor Microenvironment for\nCancer Therapy Eur. J. Med. Chem. 2017 142 393 415 10.1016/j.ejmech.2017.08.049 28911823 Mantaj J. Jackson P. J. M. Rahman K. M. Thurston D. E. From Anthramycin\nto Pyrrolobenzodiazepine (PBD)-Containing Antibody–Drug Conjugates\n(ADCs) Angew. Chemie - Int. Ed. 2017 56 2 462 488 10.1002/anie.201510610 PMC5215561 27862776 Banerji U. van Herpen C. M. L. Saura C. Thistlethwaite F. Lord S. Moreno V. Macpherson I. R. Boni V. Rolfo C. de Vries E. G. E. Rottey S. Geenen J. Eskens F. Gil-Martin M. Mommers E. C. Koper N. P. Aftimos P. Trastuzumab Duocarmazine\nin Locally Advanced and Metastatic Solid Tumours and HER2-Expressing\nBreast Cancer: A Phase 1 Dose-Escalation and Dose-Expansion Study Lancet Oncol. 2019 20 8 1124 1135 10.1016/S1470-2045(19)30328-6 31257177 Elgersma R. C. Coumans R. G. E. Huijbregts T. Menge W. M. P. B. Joosten J. A. F. Spijker H. J. De Groot F. M. H. Van\nDer Lee M. M. C. Ubink R. Van Den Dobbelsteen D. J. Egging D. F. Dokter W. H. A. Verheijden G. F. M. Lemmens J. M. Timmers C. M. Beusker P. H. Design, Synthesis,\nand Evaluation of Linker-Duocarmycin Payloads: Toward Selection of\nHER2-Targeting Antibody-Drug Conjugate SYD985 Mol. Pharmaceutics 2015 12 6 1813 1835 10.1021/mp500781a 25635711 Saber H. Simpson N. Ricks T. K. Leighton J. K. An FDA Oncology\nAnalysis of Toxicities Associated with PBD-Containing Antibody-Drug\nConjugates Regul. Toxicol. Pharmacol. 2019 107 104429 10.1016/j.yrtph.2019.104429 31325532 Hartley J. A. Antibody-Drug\nConjugates (ADCs) Delivering Pyrrolobenzodiazepine (PBD) Dimers for\nCancer Therapy Expert Opin. Biol. Ther. 2021 21 7 931 943 10.1080/14712598.2020.1776255 32543981 Nakada T. Sugihara K. Jikoh T. Abe Y. Agatsuma T. The Latest\nResearch and Development into the Antibody–Drug Conjugate,\n[Fam-] Trastuzumab Deruxtecan (DS-8201a), for HER2 Cancer Therapy Chem. Pharm. Bull. 2019 67 3 173 185 10.1248/cpb.c18-00744 30827997 Hamblett K. J. Senter P. D. Chace D. F. Sun M. M. C. Lenox J. Cerveny C. G. Kissler K. M. Bernhardt S. X. Kopcha A. K. Zabinski R. F. Meyer D. L. Francisco J. A. Effects\nof Drug Loading on the Antitumor Activity of a Monoclonal Antibody\nDrug Conjugate Clin. Cancer Res. 2004 10 20 7063 7070 10.1158/1078-0432.CCR-04-0789 15501986 Lyon R. P. Bovee T. D. Doronina S. O. Burke P. J. Hunter J. H. Neff-Laford H. D. Jonas M. Anderson M. E. Setter J. R. Senter P. D. Reducing Hydrophobicity of Homogeneous Antibody-Drug\nConjugates Improves Pharmacokinetics and Therapeutic Index Nat. Biotechnol. 2015 33 7 733 735 10.1038/nbt.3212 26076429 Ogitani Y. Aida T. Hagihara K. Yamaguchi J. Ishii C. Harada N. Soma M. Okamoto H. Oitate M. Arakawa S. Hirai T. Atsumi R. Nakada T. Hayakawa I. Abe Y. Agatsuma T. DS-8201a,\na Novel HER2-Targeting ADC with a Novel DNA Topoisomerase I Inhibitor,\nDemonstrates a Promising Antitumor Efficacy with Differentiation from\nT-DM1 Clin. Cancer Res. 2016 22 20 5097 5108 10.1158/1078-0432.CCR-15-2822 27026201 Shiose Y. Ochi Y. Kuga H. Yamashita F. Hashida M. Relationship between Drug Release\nof DE-310, Macromolecular\nProdrug of DX-8951f, and Cathepsins Activity in Several Tumors Biol. Pharm. Bull. 2007 30 12 2365 2370 10.1248/bpb.30.2365 18057727 Nakada T. Masuda T. Naito H. Yoshida M. Ashida S. Morita K. Miyazaki H. Kasuya Y. Ogitani Y. Yamaguchi J. Abe Y. Honda T. Novel Antibody Drug\nConjugates Containing Exatecan Derivative-Based Cytotoxic Payloads Bioorg. Med. Chem. Lett. 2016 26 6 1542 1545 10.1016/j.bmcl.2016.02.020 26898815 Andrikopoulou A. Zografos E. Liontos M. Koutsoukos K. Dimopoulos M. A. Zagouri F. Trastuzumab Deruxtecan\n(DS-8201a):\nThe Latest Research and Advances in Breast Cancer Clin. Breast Cancer 2021 21 3 e212 e219 10.1016/j.clbc.2020.08.006 32917537 D’Arienzo A. Verrazzo A. Pagliuca M. Napolitano F. Parola S. Viggiani M. Caputo R. Puglisi F. Giuliano M. Del Mastro L. Arpino G. De Laurentiis M. Montemurro F. Toxicity Profile\nof Antibody-Drug Conjugates in Breast\nCancer: Practical Considerations eClinicalMedicine 2023 62 102113 10.1016/j.eclinm.2023.102113 37554126 PMC10404866 Powell C. A. Modi S. Iwata H. Takahashi S. Smit E. F. Siena S. Chang D. Y. Macpherson E. Qin A. Singh J. Taitt C. Shire N. Camidge D. R. Pooled\nAnalysis of Drug-Related Interstitial Lung Disease and/or Pneumonitis\nin Nine Trastuzumab Deruxtecan Monotherapy Studies ESMO Open 2022 7 4 100554 10.1016/j.esmoop.2022.100554 35963179 PMC9434416 Kumagai K. Aida T. Tsuchiya Y. Kishino Y. Kai K. Mori K. Interstitial Pneumonitis Related to Trastuzumab Deruxtecan,\na Human\nEpidermal Growth Factor Receptor 2-Targeting Ab–Drug Conjugate,\nin Monkeys Cancer Sci. 2020 111 12 4636 4645 10.1111/cas.14686 33051938 PMC7734153 Mahalingaiah P. K. Ciurlionis R. Durbin K. R. Yeager R. L. Philip B. K. Bawa B. Mantena S. R. Enright B. P. Liguori M. J. Van Vleet T. R. Potential\nMechanisms of Target-Independent Uptake and\nToxicity of Antibody-Drug Conjugates Pharmacol.\nTher. 2019 200 110 125 10.1016/j.pharmthera.2019.04.008 31028836 Mosele F. Deluche E. Lusque A. Le Bescond L. Filleron T. Pradat Y. Ducoulombier A. Pistilli B. Bachelot T. Viret F. Levy C. Signolle N. Alfaro A. Tran D. T. N. Garberis I. J. Talbot H. Christodoulidis S. Vakalopoulou M. Droin N. Stourm A. Kobayashi M. Kakegawa T. Lacroix L. Saulnier P. Job B. Deloger M. Jimenez M. Mahier C. Baris V. Laplante P. Kannouche P. Marty V. Lacroix-Triki M. Diéras V. André F. Trastuzumab Deruxtecan in Metastatic\nBreast Cancer with Variable HER2 Expression: The Phase 2 DAISY Trial Nat. Med. 2023 29 8 2110 2120 10.1038/s41591-023-02478-2 37488289 PMC10427426 Uppal H. Doudement E. Mahapatra K. Darbonne W. C. Bumbaca D. Shen B. Q. Du X. Saad O. Bowles K. Olsen S. Phillips G. D. L. Hartley D. Sliwkowski M. X. Girish S. Dambach D. Ramakrishnan V. Potential\nMechanisms for Thrombocytopenia Development with Trastuzumab Emtansine\n(T-DM1) Clin. Cancer Res. 2015 21 1 123 133 10.1158/1078-0432.CCR-14-2093 25370470 Mitsui I. Kumazawa E. Hirota Y. Aonuma M. Sugimori M. Ohsuki S. Uoto K. Ejima A. Terasawa H. Sato K. A New Water-Soluble\nCamptothecin Derivative, DX-8951f, Exhibits Potent\nAntitumor Activity against Human Tumors in Vitro and in Vivo Jpn. J. Cancer Res. 1995 86 776 782 10.1111/j.1349-7006.1995.tb02468.x 7559102 PMC5920901 Conilh L. Fournet G. Fourmaux E. Murcia A. Matera E. L. Joseph B. Dumontet C. Viricel W. Exatecan Antibody Drug\nConjugates Based on a Hydrophilic Polysarcosine Drug-Linker Platform Pharmaceuticals 2021 14 3 247 10.3390/ph14030247 33803327 PMC8000490 Hunter F. W. Barker H. R. Lipert B. Rothé F. Gebhart G. Piccart-Gebhart M. J. Sotiriou C. Jamieson S. M. F. Mechanisms\nof Resistance to Trastuzumab Emtansine (T-DM1) in HER2-Positive Breast\nCancer Br. J. Cancer 2020 122 5 603 612 10.1038/s41416-019-0635-y 31839676 PMC7054312 Douez E. Allard-Vannier E. Amar I. A. M. Jolivet L. Boursin F. Maisonial-Besset A. Witkowski T. Chezal J. M. Colas C. Letast S. Auvert E. Denevault-Sabourin C. Aubrey N. Joubert N. Branched Pegylated\nLinker-Auristatin\nto Control Hydrophobicity for the Production of Homogeneous Minibody-Drug\nConjugate against HER2-Positive Breast Cancer J. Controlled Release 2024 366 567 584 10.1016/j.jconrel.2024.01.012 38215985 Burke P. J. Hamilton J. Z. Jeffrey S. C. Hunter J. H. Doronina S. O. Okeley N. M. Miyamoto J. B. Anderson M. E. Stone I. J. Ulrich M. L. Simmons J. K. McKinney E. E. Senter P. D. Lyon R. P. Optimization of a PEGylated Glucuronide-Monomethylauristatin\nE Linker for Antibody-Drug Conjugates Mol.\nCancer Ther. 2017 16 1 116 123 10.1158/1535-7163.MCT-16-0343 28062707 Simmons J. K. Burke P. J. Cochran J. H. Pittman P. G. Lyon R. P. Reducing\nthe Antigen-Independent Toxicity of Antibody-Drug Conjugates by Minimizing\nTheir Non-Specific Clearance through PEGylation Toxicol. Appl. Pharmacol. 2020 392 114932 10.1016/j.taap.2020.114932 32109510 Pepinsky R. B. Walus L. Shao Z. Ji B. Gu S. Sun Y. Wen D. Lee X. Wang Q. Garber E. Mi S. Production of a PEGylated Fab′\nof the Anti-LINGO-1 Li33 Antibody\nand Assessment of Its Biochemical and Functional Properties in Vitro\nand in a Rat Model of Remyelination Bioconjugate\nChem. 2011 22 2 200 210 10.1021/bc1002746 21254764 Jevševar S. Kusterle M. Kenig M. PEGylation of Antibody Fragments\nfor Half-Life Extension Methods Mol. Biol. 2012 901 233 246 10.1007/978-1-61779-931-0_15 22723105 Tedeschini T. Campara B. Grigoletto A. Bellini M. Salvalaio M. Matsuno Y. Suzuki A. Yoshioka H. Pasut G. Polyethylene\nGlycol-Based Linkers as Hydrophilicity Reservoir for Antibody-Drug\nConjugates J. Controlled Release 2021 337 July 431 447 10.1016/j.jconrel.2021.07.041 34329685 Mahmood I. Clinical Pharmacology\nof Antibody-Drug Conjugates Antibodies 2021 10 20 10.3390/antib10020020 34063812 PMC8161445 Carrasco-Triguero M. Dere R. C. Milojic-Blair M. Saad O. M. Nazzal D. Hong K. Kaur S. Immunogenicity\nof Antibody-Drug Conjugates:\nObservations across 8 Molecules in 11 Clinical Trials Bioanalysis 2019 11 17 1555 1568 10.4155/bio-2018-0259 31208199 Jolivet L. Ait Mohamed Amar I. Horiot C. Boursin F. Colas C. Letast S. Denevault-Sabourin C. Allard-Vannier E. Joubert N. Aubrey N. Intra-Domain\nCysteines (IDC), a New\nStrategy for the Development of Original Antibody Fragment–Drug\nConjugates (FDCs) Pharmaceutics 2022 14 8 1524 10.3390/pharmaceutics14081524 35893780 PMC9331466 Miller M. L. Shizuka M. Wilhelm A. Salomon P. Reid E. E. Lanieri L. Sikka S. Maloney E. K. Harvey L. Qiu Q. Archer K. E. Bai C. Vitharana D. Harris L. Singh R. Ponte J. F. Yoder N. C. Kovtun Y. Lai K. C. Ab O. Pinkas J. Keating T. A. Chari R. V. J. A DNA-Interacting\nPayload Designed\nto Eliminate Cross-Linking Improves the Therapeutic Index of Antibody–Drug\nConjugates (ADCs) Mol. Cancer Ther. 2018 17 3 650 660 10.1158/1535-7163.MCT-17-0940 29440292 Salomon P. L. Reid E. E. Archer K. E. Harris L. Maloney E. K. Wilhelm A. J. Miller M. L. Chari R. V. J. Keating T. A. Singh R. Optimizing Lysosomal Activation of Antibody-Drug Conjugates (ADCs)\nby Incorporation of Novel Cleavable Dipeptide Linkers Mol. Pharmaceutics 2019 16 4817 4825 10.1021/acs.molpharmaceut.9b00696 31609629 Mohamed\nAmar I. A. Huvelle S. Douez E. Letast S. Henrion S. Viaud-Massuard M. C. Aubrey N. Allard-Vannier E. Joubert N. Denevault-Sabourin C. Dual Intra- and Extracellular Release\nof Monomethyl Auristatin E from a Neutrophil Elastase-Sensitive Antibody-Drug\nConjugate Eur. J. Med. Chem. 2022 229 114063 10.1016/j.ejmech.2021.114063 34974337 Joubert N. Viaud-Massuard M.-C. Respaud R. WO2015004400A1 2015 Beck A. D’Atri V. Ehkirch A. Fekete S. Hernandez-Alba O. Gahoual R. Leize-Wagner E. François Y. Guillarme D. Cianférani S. Cutting-Edge Multi-Level Analytical\nand Structural Characterization of Antibody-Drug Conjugates: Present\nand Future Expert Rev. Proteomics 2019 16 4 337 362 10.1080/14789450.2019.1578215 30706723 Crouch S. P. M. Kozlowski R. Slater K. J. Fletcher J. The Use of ATP Bioluminescence\nas a Measure of Cell Proliferation and Cytotoxicity J. Immunol. Methods 1993 160 1 81 88 10.1016/0022-1759(93)90011-U 7680699 Szijj P. A. Bahou C. Chudasama V. Minireview:\nAddressing the Retro-Michael\nInstability of Maleimide Bioconjugates Drug\nDiscovery Today Technol. 2018 30 27 34 10.1016/j.ddtec.2018.07.002 30553517 Maisonial-Besset A. Witkowski T. Quintana M. Besse S. Gaumet V. Cordonnier A. Alliot C. Vidal A. Denevault-Sabourin C. Tarrit S. Levesque S. Miot-Noirault E. Chezal J. M. Synthesis and In Vitro Comparison of DOTA, NODAGA and\n15–5 Macrocycles as Chelators for the 64Cu-Labelling of Immunoconjugates Molecules 2023 28 1 75 10.3390/molecules28010075 PMC9822305 36615280 Kim K. M. McDonagh C. F. Westendorf L. Brown L. L. Sussman D. Feist T. Lyon R. Alley S. C. Okeley N. M. Zhang X. Thompson M. C. Stone I. Gerber H. P. Carter P. J. Anti-CD30 Diabody-Drug\nConjugates with Potent Antitumor\nActivity Mol. Cancer Ther. 2008 7 8 2486 2497 10.1158/1535-7163.MCT-08-0388 18723494 Okajima D. Yasuda S. Maejima T. Karibe T. Sakurai K. Aida T. Toki T. Yamaguchi J. Kitamura M. Kamei R. Fujitani T. Honda T. Shibutani T. Muramatsu S. Nakada T. Goto R. Takahashi S. Yamaguchi M. Hamada H. Noguchi Y. Murakami M. Abe Y. Agatsuma T. Datopotamab Deruxtecan,\na Novel TROP2-Directed Antibody-Drug Conjugate, Demonstrates Potent\nAntitumor Activity by Efficient Drug Delivery to Tumor Cells Mol. Cancer Ther. 2021 20 12 2329 2340 10.1158/1535-7163.MCT-21-0206 34413126 PMC9398094 Cardillo T. M. Govindan S. V. Sharkey R. M. Trisal P. Arrojo R. Liu D. Rossi E. A. Chang C. H. Goldenberg D. M. Sacituzumab\nGovitecan (IMMU-132), an Anti-Trop-2/SN-38 Antibody-Drug Conjugate:\nCharacterization and Efficacy in Pancreatic, Gastric, and Other Cancers Bioconjugate Chem. 2015 26 5 919 931 10.1021/acs.bioconjchem.5b00223 25915780 Guidi L. Pellizzari G. Tarantino P. Valenza C. Curigliano G. Resistance\nto Antibody-Drug Conjugates Targeting HER2 in Breast Cancer: Molecular\nLandscape and Future Challenges Cancers 2023 15 4 1130 10.3390/cancers15041130 36831473 PMC9954056 Joubert N. Denevault-Sabourin C. Letast S. Auvert E. WO2025003396A1 2025 Bryden F. Martin C. Letast S. Lles E. Viéitez-Villemin I. Rousseau A. Colas C. Brachet-Botineau M. Allard-Vannier E. Larbouret C. Viaud-Massuard M. C. Joubert N. Impact of Cathepsin\nB-Sensitive Triggers and Hydrophilic\nLinkers on: In Vitro Efficacy of Novel Site-Specific Antibody-Drug\nConjugates Org. Biomol. Chem. 2018 16 11 1882 1889 10.1039/C7OB02780J 29473076 Yurkovetskiy A. V. Yin M. Bodyak N. Stevenson C. A. Thomas J. D. Hammond C. E. Qin L. L. Zhu B. Gumerov D. R. Ter-Ovanesyan E. Uttard A. Lowinger T. B. A Polymer-Based Antibody-Vinca Drug\nConjugate Platform: Characterization and Preclinical Efficacy Cancer Res. 2015 75 16 3365 3372 10.1158/0008-5472.CAN-15-0129 26113086 Shao S. Tsai M. H. Lu J. Yu T. Jin J. Xiao D. Jiang H. Han M. Wang M. Wang J. Site-Specific and Hydrophilic ADCs\nthrough Disulfide-Bridged Linker\nand Branched PEG Bioorg. Med. Chem. Lett. 2018 28 8 1363 1370 10.1016/j.bmcl.2018.03.005 29559276 Hartimath S. V. El-Sayed A. Makhlouf A. Bernhard W. Gonzalez C. Hill W. Parada A. C. Barreto K. Geyer C. R. Fonge H. Therapeutic Potential of Nimotuzumab PEGylated-Maytansine Antibody\nDrug Conjugates against EGFR Positive Xenograft Oncotarget 2019 10 10 1031 1044 10.18632/oncotarget.26613 30800216 PMC6383682 Borsi L. Balza E. Bestagno M. Castellani P. Carnemolla B. Biro A. Leprini A. Sepulveda J. Burrone O. Neri D. Zardi L. Selective Targeting\nof Tumoral Vasculature: Comparison of Different Formats of an Antibody\n(L19) to the ED-B Domain of Fibronectin Int.\nJ. Cancer 2002 102 1 75 85 10.1002/ijc.10662 12353237 Alvarenga L. M. Martins M. S. Moura J. F. Kalapothakis E. Oliveira J. C. Mangili O. C. Granier C. Chávez-Olórtegui C. Production\nof Monoclonal Antibodies Capable of Neutralizing Dermonecrotic Activity\nof Loxosceles Intermedia Spider Venom and Their Use in a Specific\nImmunometric Assay Toxicon 2003 42 7 725 731 10.1016/j.toxicon.2003.09.006 14757202 Marty R. Nigon R. Leite D. Frauenrath H. Two-Fold Odd–Even\nEffect in Self-Assembled Nanowires from Oligopeptide-Polymer-Substituted\nPerylene Bisimides J. Am. Chem. Soc. 2014 136 10 3919 3927 10.1021/ja412384p 24524326 Widdison W.\nC. Ponte J. F. Coccia J. A. Lanieri L. Setiady Y. Dong L. Skaletskaya A. Hong E. E. Wu R. Qiu Q. Singh R. Salomon P. Fishkin N. Harris L. Maloney E. K. Kovtun Y. Veale K. Wilhelm S. D. Audette C. A. Costoplus J. A. Chari R. V. J. Development of\nAnilino-Maytansinoid ADCs That Efficiently Release Cytotoxic Metabolites\nin Cancer Cells and Induce High Levels of Bystander Killing Bioconjugate Chem. 2015 26 11 2261 2278 10.1021/acs.bioconjchem.5b00430 26355774 Konishi S. Hamacher K. Vallabhajosula S. Kothari P. Bastidas D. Bander N. Goldsmith S. Determination\nof Immunoreactive Fraction\nof Radiolabeled Monoclonal Antibodies: What Is an Appropriate Method? Cancer Biother. Radiopharm. 2004 19 6 706 715 10.1089/cbr.2004.19.706 15665617 ",
  "metadata": {
    "Title of this paper": "Determination\nof Immunoreactive Fraction\nof Radiolabeled Monoclonal Antibodies: What Is an Appropriate Method?",
    "Journal it was published in:": "Journal of Medicinal Chemistry",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12481485/"
  }
}