{
  "title": "Paper_81",
  "abstract": "pmc EMBO J EMBO J 78 emboj The EMBO Journal 0261-4189 1460-2075 Nature Publishing Group PMC12489074 PMC12489074.1 12489074 12489074 40859036 10.1038/s44318-025-00550-w 550 1 News & Views TIM-3 and γδ T cells: new players in breast cancer dissemination http://orcid.org/0000-0003-2257-8500 Galluzzi Lorenzo Lorenzo.Galluzzi@fccc.edu 1 Galassi Claudia 2 http://orcid.org/0000-0002-0792-3188 Wiest David L david.wiest@fccc.edu 3 1 https://ror.org/0567t7073 grid.249335.a 0000 0001 2218 7820 Cancer Signaling and Microenvironment Program, Fox Chase Cancer Center, 2 https://ror.org/05bnh6r87 grid.5386.8 000000041936877X Department of Pharmacology, Weill Cornell Medical College, Weill Cornell Medical College, 3 https://ror.org/0567t7073 grid.249335.a 0000 0001 2218 7820 Nuclear Dynamics and Cancer Program, Fox Chase Cancer Center, 26 8 2025 10 2025 44 19 498146 5236 5238 19 7 2025 31 7 2025 26 08 2025 03 10 2025 03 10 2025 © The Author(s) 2025 2025 https://creativecommons.org/licenses/by/4.0/ Open Access http://creativecommons.org/licenses/by/4.0/ http://creativecommons.org/publicdomain/zero/1.0/ γδ T cells, a heterogeneous lymphocyte subset operating at the interface between innate and adaptive immunity, mediate ambivalent and context-dependent effects in oncological settings. Recent work by Rozalén et al, ( 2025 + Recent data report a role for IL-17-secreting γδ T cells in facilitating the establishment of TIM-3 +  Subject terms Cancer Immunology pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement no pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes issue-copyright-statement © European Molecular Biology Organization 2025 γδ T cells are a population of CD3 + - - + - - + 2023 2021 2015 2023 2021 + + 2023 - + 2015 2025 - + 2024 2025 First, Rozalen et al ( 2025 Havcr2 Havcr2 2025 de facto 2025 To elucidate the molecular mechanisms underlying these observations, Rozalen et al ( 2025 2025 Havcr2 + + + 2015 + + 2025 Next, Rozalen et al (2025 + + + + 2025 2025 In summary, Rozalen et al ( 2025 + + 1 + + + 2020 2025 + + + 2024 Figure 1 TIM-3 + + Compared to their TIM-3 - + + + + de facto + EX See also: C Rozalén Disclosure and competing interests statement CG and DLW declare no competing interests. LG is/has been holding research contracts with Lytix Biopharma, Promontory and Onxeo, has received consulting/advisory honoraria from Boehringer Ingelheim, AstraZeneca, AbbVie, OmniSEQ, Onxeo, The Longevity Labs, Inzen, Imvax, Sotio, Promontory, Noxopharm, EduCom, and the Luke Heller TECPR2 Foundation, and holds Promontory stock options. References Buque A Bloy N Perez-Lanzon M Iribarren K Humeau J Pol JG Levesque S Mondragon L Yamazaki T Sato A Immunoprophylactic and immunotherapeutic control of hormone receptor-positive breast cancer Nat Commun 2020 11 3819 10.1038/s41467-020-17644-0 32732875 PMC7393498 Buque A, Bloy N, Perez-Lanzon M, Iribarren K, Humeau J, Pol JG, Levesque S, Mondragon L, Yamazaki T, Sato A et al (2020) Immunoprophylactic and immunotherapeutic control of hormone receptor-positive breast cancer. Nat Commun 11:3819 32732875 10.1038/s41467-020-17644-0 PMC7393498 Coffelt SB Kersten K Doornebal CW Weiden J Vrijland K Hau CS Verstegen NJM Ciampricotti M Hawinkels L Jonkers J IL-17-producing gammadelta T cells and neutrophils conspire to promote breast cancer metastasis Nature 2015 522 345 348 10.1038/nature14282 25822788 PMC4475637 Coffelt SB, Kersten K, Doornebal CW, Weiden J, Vrijland K, Hau CS, Verstegen NJM, Ciampricotti M, Hawinkels L, Jonkers J et al (2015) IL-17-producing gammadelta T cells and neutrophils conspire to promote breast cancer metastasis. Nature 522:345–348 25822788 10.1038/nature14282 PMC4475637 de Vries NL van de Haar J Veninga V Chalabi M Ijsselsteijn ME van der Ploeg M van den Bulk J Ruano D van den Berg JG Haanen JB Gammadelta T cells are effectors of immunotherapy in cancers with HLA class I defects Nature 2023 613 743 750 10.1038/s41586-022-05593-1 36631610 PMC9876799 de Vries NL, van de Haar J, Veninga V, Chalabi M, Ijsselsteijn ME, van der Ploeg M, van den Bulk J, Ruano D, van den Berg JG, Haanen JB et al (2023) Gammadelta T cells are effectors of immunotherapy in cancers with HLA class I defects. Nature 613:743–750 36631610 10.1038/s41586-022-05593-1 PMC9876799 Galassi C Chan TA Vitale I Galluzzi L The hallmarks of cancer immune evasion Cancer Cell 2024 42 1825 1863 10.1016/j.ccell.2024.09.010 39393356 Galassi C, Chan TA, Vitale I, Galluzzi L (2024) The hallmarks of cancer immune evasion. Cancer Cell 42:1825–1863 39393356 10.1016/j.ccell.2024.09.010 Gentles AJ Newman AM Liu CL Bratman SV Feng W Kim D Nair VS Xu Y Khuong A Hoang CD The prognostic landscape of genes and infiltrating immune cells across human cancers Nat Med 2015 21 938 945 10.1038/nm.3909 26193342 PMC4852857 Gentles AJ, Newman AM, Liu CL, Bratman SV, Feng W, Kim D, Nair VS, Xu Y, Khuong A, Hoang CD et al (2015) The prognostic landscape of genes and infiltrating immune cells across human cancers. Nat Med 21:938–945 26193342 10.1038/nm.3909 PMC4852857 Mensurado S Blanco-Dominguez R Silva-Santos B The emerging roles of gammadelta T cells in cancer immunotherapy Nat Rev Clin Oncol 2023 20 178 191 10.1038/s41571-022-00722-1 36624304 Mensurado S, Blanco-Dominguez R, Silva-Santos B (2023) The emerging roles of gammadelta T cells in cancer immunotherapy. Nat Rev Clin Oncol 20:178–191 36624304 10.1038/s41571-022-00722-1 Paul S Konig MF Pardoll DM Bettegowda C Papadopoulos N Wright KM Gabelli SB Ho M van Elsas A Zhou S Cancer therapy with antibodies Nat Rev Cancer 2024 24 399 426 10.1038/s41568-024-00690-x 38740967 PMC11180426 Paul S, Konig MF, Pardoll DM, Bettegowda C, Papadopoulos N, Wright KM, Gabelli SB, Ho M, van Elsas A, Zhou S (2024) Cancer therapy with antibodies. Nat Rev Cancer 24:399–426 38740967 10.1038/s41568-024-00690-x PMC11180426 Petroni G, Galassi C, Gouin KH 3rd, Chen HH, Buque A, Bloy N, Yamazaki T, Sato A, Beltran-Visiedo M, Campia G et al (2025) IL-17A-secreting gammadelta T cells promote resistance to CDK4/CDK6 inhibitors in HR(+)HER2(-) breast cancer via CX3CR1(+) macrophages. Nat Cancer. 10.1038/s43018-025-01007-z 10.1038/s43018-025-01007-z 40624238 Ribot JC Lopes N Silva-Santos B gammadelta T cells in tissue physiology and surveillance Nat Rev Immunol 2021 21 221 232 10.1038/s41577-020-00452-4 33057185 Ribot JC, Lopes N, Silva-Santos B (2021) gammadelta T cells in tissue physiology and surveillance. Nat Rev Immunol 21:221–232 33057185 10.1038/s41577-020-00452-4 Rozalen C, Sangrador I, Avalle S, Blasco-Benito S, Tzortzi P, Sanz-Flores M, Palomeque JA, Torren-Duran P, Dalmau M, Brunel H et al (2025) TIM3(+) breast cancer cells license immune evasion during micrometastasis outbreak. Cancer Cell. 10.1016/j.ccell.2025.06.015 10.1016/j.ccell.2025.06.015 PMC12416865 40645187 ",
  "metadata": {
    "Title of this paper": "gammadelta T cells in tissue physiology and surveillance",
    "Journal it was published in:": "The EMBO Journal",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12489074/"
  }
}