{
  "title": "Paper_1047",
  "abstract": "pmc Mar Drugs Mar Drugs 590 mardrugs marinedrugs Marine Drugs 1660-3397 Multidisciplinary Digital Publishing Institute  (MDPI) PMC12471755 PMC12471755.1 12471755 12471755 41003309 10.3390/md23090340 marinedrugs-23-00340 1 Article Total Syntheses of Marine Natural Products Lyngbyabellin O and Lyngbyabellin P Chen Jing 1 Li Shiyu 2 https://orcid.org/0000-0002-7555-5591 Xu Chao 1 * https://orcid.org/0000-0002-2780-9761 Ye Tao 1 * Ganesan A. Academic Editor Menna Marialuisa Academic Editor 1 chenjingchey@pku.edu.cn 2 13991563951@163.com * 17696108935@163.com yet@pkusz.edu.cn 26 8 2025 9 2025 23 9 497656 340 31 7 2025 21 8 2025 24 8 2025 26 08 2025 27 09 2025 27 09 2025 © 2025 by the authors. 2025 https://creativecommons.org/licenses/by/4.0/ Licensee MDPI, Basel, Switzerland. This article is an open access article distributed under the terms and conditions of the Creative Commons Attribution (CC BY) license ( https://creativecommons.org/licenses/by/4.0/ Lyngbyabellins O and P are complex natural products derived from non-ribosomal peptide synthetase/polyketide synthase (NRPS/PKS) biosynthetic pathways and have been isolated from marine cyanobacterial sources. Both metabolites are characterized by the presence of two thiazole rings and a distinctive dichlorinated β R S total synthesis marine natural products lyngbyabellin O lyngbyabellin P Technology & Innovation Bureau of Longgang District RCTDPT-2019-008 Department of Education of Guangdong Province 2021ZDJS097 Guangdong Basic and Applied Basic Research Foundation 2024A1515010958 Natural Science Foundation of Guangdong Province 2021A1515010344 National Natural Science Foundation of China 22171014 22371212 This research was funded by the Technology & Innovation Bureau of Longgang District (RCTDPT-2019-008), the Department of Education of Guangdong Province (2021ZDJS097), the Guangdong Basic and Applied Basic Research Foundation (2024A1515010958), the Natural Science Foundation of Guangdong Province (2021A1515010344), and the National Natural Science Foundation of China (22171014, 22371212). pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement yes pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes 1. Introduction Cyanobacteria, often implicated in harmful algal blooms, are prolific producers of structurally diverse secondary metabolites characterized by a broad spectrum of potent bioactivities. These include enzyme inhibitors, antifouling agents, and pharmacologically relevant compounds with demonstrated anticancer, antibiotic, and antiparasitic properties [ 1 2 3 4 5 6 In 2017, Petitbois et al. reported the isolation of four novel secondary metabolites—serinolamide C ( 1 2 3 4 5 6 Okeania Figure 1 7 3 4 3 5 3 4 Amphibalanus amphitrite 50 50 Lyngbyabellins O ( 3 4 4 R S 3 4 To the best of our knowledge, apart from the methods for the synthesis of lyngbyabellin O briefly disclosed in our patent application, [ 8 3 4 7 9 10 11 8 10 9 12 Figure 2 3 4 Scheme 1 4 3 R S 10 3 12 13 14 10 12 13 14 2. Results and Discussion Our synthetic campaign commenced with intermediate 12 Scheme 2 N S 15 2 3 16 16 17 18 4 19 13 19 3 20 14 20 β 12 ee 15 The chiral thiazole fragment 13 Scheme 3 S 21 R 22 23 16 13 The synthesis of dichlorinated hydroxyoctanoic acid 14 Scheme 4 24 25 17 25 26 27 syn 28 28 2 3 syn 29 18 29 p 3 30 19 20 14 The synthesis of fragment 10 32 Scheme 5 β 33 4 11 21 n 34 10 With all four key fragments in hand, we proceeded to construct the target structures of lyngbyabellin O ( 3 4 Scheme 6 13 14 35 3 4 12 36 3 3 10 4 A comparison of the NMR data for the synthetic samples with those reported in the original isolation study for lyngbyabellins O and P revealed an almost complete concordance, with the exception of the C-10 and C-13 resonances in lyngbyabellin O (see the Supporting Information 7 3. Materials and Methods 3.1. General All reactions were conducted in flame-dried or oven-dried glassware under an atmosphere of dry nitrogen or argon. Oxygen and/or moisture-sensitive solids and liquids were transferred appropriately. The concentration of solutions in vacuo was accomplished using a rotary evaporator fitted with a water aspirator. Residual solvents were removed under a high vacuum (0.1–0.2 mm Hg). All reaction solvents were purified before use. Tetrahydrofuran (THF) was distilled from Na/benzophenone. Toluene was distilled over molten sodium metal. Dichloromethane (DCM) and trimethylamine (Et 3 2 2 1 3 13 3 3.2. General Experimental Procedures 3.2.1. Methyl S 16 To a stirred solution of N S 15 2 3 ® The crude residue was dissolved in acetonitrile (100 mL, 0.085 M), and diethylamine (Et 2 f [ α ]   D  18.3 c 3 1 3 J J J 13 3 3.2.2. Methyl N S 18 To a solution of compound 16 17 N N 2 4 f [ α ]   D  17.3 c 3 1 3 J J J J J 13 3 28 29 3 + + 3.2.3. Methyl ( R 19 To a solution of compound 18 19 f [ α ]   D  21.6 c 3 1 3 J J J 13 3 9 13 2 + + 3.2.4. Methyl 2-(2-Methylprop-1-en-1-yl)thiazole-4-carboxylate ( 20 To a stirred solution of compound 19 3 2 4 f 1 3 J J 13 3 3.2.5. Methyl ( S 12 To a solution of compound 20 β ee f [ α ]   D  21 c 3 1 3 J J 13 3 9 13 4 + + 3.2.6. Ethyl ( R 23 To a stirred solution of L-cysteine ethyl ester hydrochloride ( 21 R 2 4 The crude intermediate was dissolved in acetonitrile (250 mL, 0.11 M) and treated with manganese dioxide (47 g, 540 mmol, 20 equiv.) at room temperature. The reaction mixture was heated to 60 °C and stirred for 48 h. Upon completion, the suspension was filtered through a pad of Celite, and the filtrate was concentrated. The crude residue was purified by flash column chromatography on silica gel (hexanes/EtOAc = 3:1) to afford compound 23 as an orange oil (3.2 g, 46% yield over two steps). TLC: R f [ α ]   D  31.2 c 3 1 3 J J J 13 3 11 15 4 + + 3.2.7. ( R 13 To a solution of compound 23 2 2 2 4 f [ α ]   D  30.2 c 3 1 3 J J J 13 3 9 11 4 + + 3.2.8. (4 S R S R 29 To a solution of oxazolidinone 28 3 27 29 dr f [ α ]   D  24 3 1 3 J J J J J J J J 13 3 19 25 2 4 + + 3.2.9. Allyl (2 S S 14 To a solution of compound 29 p 30 f To a solution of ester 30 2 2 4 To a solution of the crude product in DMF (5 mL, 0.14 M) at 0 °C were added KHCO 3 4 2 4 14 f [ α ]   D  31.2 c 3 1 3 J J J J J J J J 13 3 12 20 2 3 + + 3.2.10. Ethyl ( S tert 33 To a solution of tert 32 N,N′ Separately, a 2.2 M solution of isopropylmagnesium bromide in diethyl ether (18.2 mL, 40.0 mmol, 4.0 equiv.) was added dropwise to a solution of ethyl hydrogen malonate (2.4 mL, 20.0 mmol, 2.0 equiv.) maintained at −10 °C. The reaction mixture was subsequently allowed to warm to room temperature and stirred for 1.5 h to generate magnesium enolate. The resulting enolate solution was cooled in an ice bath, and the previously prepared imidazolide solution was added dropwise at −10 °C. The combined reaction mixture was stirred at −10 °C for 30 min and then at ambient temperature for 24 h. The reaction was quenched by the addition of 10% aqueous citric acid (10 mL), followed by further acidification to pH 3 using an additional portion of 10% aqueous citric acid (30 mL). The aqueous layer was extracted with ethyl acetate (3 × 100 mL), and the combined organic extracts were washed successively with water (50 mL) and brine (50 mL), dried over anhydrous sodium sulfate, filtered, and concentrated under reduced pressure. The crude product was purified by flash column chromatography on silica gel (hexanes/ethyl acetate = 3:1) to afford β 33 f [ α ]   D  31.2 c 1 3 J J J J 13 3 15 27 5 + + 3.2.11. Ethyl (3 R S tert 11 To a solution of β 33 11 dr f [ α ]   D  30.8 c 1 3 J J J J J J J 13 3 15 29 5 + + 3.2.12. Ethyl (3 R S 34 To a solution of compound 11 The resulting crude residue was dissolved in N,N N,N O N,N,N′,N′ The crude residue was dissolved in ethyl acetate (30 mL) and washed with 4% aqueous citric acid (5 mL). The aqueous phase was extracted with ethyl acetate (3 × 20 mL), and the combined organic layers were successively washed with saturated aqueous sodium bicarbonate (15 mL) and brine (15 mL), dried over anhydrous sodium sulfate, filtered, and concentrated under reduced pressure. The crude product was purified by flash column chromatography on silica gel (hexanes/EtOAc = 1:1) to afford compound 34 f [ α ]   D  30.4 c 1 3 J J J J J J J 13 3 14 27 4 + + 3.2.13. (3 R S 10 To a solution of compound 34 10 f [ α ]   D  30.4 c 1 3 J J J J J J J 13 3 12 23 4 + + 3.2.14. (2 S S R 35 A solution of acid 13 14 35 f [ α ]   D  21 c 3 1 3 J J J J J J J J J J 13 3 21 29 2 6 + + 3.2.15. (2 S S S R 36 A solution of compound 35 3 4 Subsequently, the crude acid thus obtained and alcohol 12 N,N v v 36 f [ α ]   D  24.8 c 3 1 3 J J J J J J J 13 3 27 36 2 2 9 2 + + 3.2.16. Lyngbyabellin O ( 3 A solution of compound 36 3 f [ α ]   D  23.5 c 1 3 J J J 13 3 24 32 2 2 9 2 + + 3.2.17. Lyngbyabellin P ( 4 To a stirred solution of lyngbyabellin O ( 3 10 N,N v v 4 f [ α ]   D  30.4 c 1 3 J J J J J J J J J J 13 3 36 53 2 3 12 2 + + 4. Conclusions In conclusion, we have achieved the inaugural total syntheses of lyngbyabellin O and lyngbyabellin P, compounds distinguished by their intricate structural features and notable biological activities. Our synthetic strategy encompassed the enantioselective preparation of dichlorohydroxyl carboxylic acid and statin moieties, the assembly of the thiazole heterocycle, and the implementation of efficient fragment coupling methodologies. These efforts collectively culminated in the successful construction of the targeted lyngbyabellin analogues. Acknowledgments We are grateful for the support from the Shenzhen Maohua Industrial Group. Disclaimer/Publisher’s Note: Supplementary Materials The following supporting information can be downloaded at https://www.mdpi.com/article/10.3390/md23090340/s1 1 13 1 5 9 10 12 16 18 26 Author Contributions C.X. and T.Y. conceived and designed this research; J.C. and S.L. prepared the compounds, collected their spectral data, and analyzed the experimental data; J.C. and T.Y. prepared the manuscript. All authors have read and agreed to the published version of the manuscript. Institutional Review Board Statement Not applicable. Data Availability Statement Copies of 1 13 Supporting Information Conflicts of Interest The authors declare no conflicts of interest. References 1. Tan L.T. Phyo M.Y. Marine Cyanobacteria: A Source of Lead Compounds and Their Clinically-Relevant Molecular Targets Molecules 2020 25 2197 10.3390/molecules25092197 32397127 PMC7249205 2. Al-Awadhi F.H. Luesch H. Targeting Eukaryotic Proteases for Natural Products-Based Drug Development Nat. Prod. Rep. 2020 37 827 860 10.1039/C9NP00060G 32519686 PMC7406119 3. Tse E.G. Korsik M. Todd M.H. The Past, Present and Future of Anti-Malarial Medicines Malar. J. 2019 18 93 10.1186/s12936-019-2724-z 30902052 PMC6431062 4. Qi S.-H. Ma X. Antifouling Compounds from Marine Invertebrates Mar. Drugs 2017 15 263 10.3390/md15090263 28846623 PMC5618402 5. Oguri Y. Watanabe M. Ishikawa T. Kamada T. Vairappan C.S. Matsuura H. Kaneko K. Ishii T. Suzuki M. Yoshimura E. New Marine Antifouling Compounds from the Red Alga Laurencia Mar. Drugs 2017 15 267 10.3390/md15090267 28846653 PMC5618406 6. Engene N. Paul V.J. Byrum T. Gerwick W.H. Thor A. Ellisman M.H. Five Chemically Rich Species of Tropical Marine Cyanobacteria of the Genus Keania Gen. Nov. (Oscillatoriales, Cyanoprokaryota) J. Phycol. 2013 49 1095 1106 10.1111/jpy.12115 27007630 7. Petitbois J.G. Casalme L.O. Lopez J.A.V. Alarif W.M. Abdel-Lateff A. Al-Lihaibi S.S. Yoshimura E. Nogata Y. Umezawa T. Matsuda F. Serinolamides and Lyngbyabellins from an Okeania J. Nat. Prod. 2017 80 2708 2715 10.1021/acs.jnatprod.7b00449 29019684 8. Chao X. Tao Y. Shiyu L. Preparation method of natural ester lyngbyabellin O CN118930496A 12 November 2024 Available online: https://worldwide.espacenet.com/patent/search/family/093362232/publication/CN118930496A?q=pn%3DCN118930496A (accessed on 10 July 2025) 9. Yokokawa F. Sameshima H. Shioiri T. Total Synthesis of Lyngbyabellin A, a Potent Cytotoxic Metabolite from the Marine Cyanobacterium Lyngbya Majuscula Tetrahedron Lett. 2001 42 4171 4174 10.1016/S0040-4039(01)00678-5 10. Yokokawa F. Sameshima H. Katagiri D. Aoyama T. Shioiri T. Total Syntheses of Lyngbyabellins A and B, Potent Cytotoxic Lipopeptides from the Marine Cyanobacterium Lyngbya Majuscula Tetrahedron 2002 58 9445 9458 10.1016/S0040-4020(02)01224-3 11. Heungwing P. Zhengshuang X. Zhiyong C. Tao Y. Total Synthesis of Lyngbyabellin A Lett. Org. Chem. 2005 2 699 702 10.2174/157017805774717544 12. Pirovani R.V. Brito G.A. Barcelos R.C. Pilli R.A. Enantioselective Total Synthesis of (+)-Lyngbyabellin M Mar. Drugs 2015 13 3309 3324 10.3390/md13063309 26023838 PMC4483630 13. Raman P. Razavi H. Kelly J.W. Titanium(Iv)-Mediated Tandem Deprotection−Cyclodehydration of Protected Cysteine N-Amides:  Biomimetic Syntheses of Thiazoline- and Thiazole-Containing Heterocycles Org. Lett. 2000 2 3289 3292 10.1021/ol000178q 11029192 14. Williams D.R. Lowder P.D. Gu Y.-G. Brooks D.A. Studies of Mild Dehydrogenations in Heterocyclic Systems Tetrahedron Lett. 1997 38 331 334 10.1016/S0040-4039(96)02344-1 15. Kolb H.C. VanNieuwenhze M.S. Sharpless K.B. Catalytic Asymmetric Dihydroxylation Chem. Rev. 1994 94 2483 2547 10.1021/cr00032a009 16. Iwakawa M. Kobayashi Y. Ikuta S.-i. Yoshimura J. A Facile Synthetic Approach to the Fragment D of Antibiotic Nosiheptide, 2-[1-Amino-3-Carboxy-3-Hydroxy-(1s,3s)-Propyl]-Thiazole-4-Carboxylic Acid. Chem. Lett. 1982 11 1975 1978 10.1246/cl.1982.1975 17. Takeda T. Sasaki R. Yamauchi S. Fujiwara T. Transformation of Ketones and Aldehydes to Gem-Dihalides Via Hydrazones Using Copper(Ii) Halides Tetrahedron 1997 53 557 566 10.1016/S0040-4020(96)00981-7 18. Evans D.A. Bartroli J. Shih T.L. Enantioselective Aldol Condensations. 2. Erythro-Selective Chiral Aldol Condensations Via Boron Enolates J. Am. Chem. Soc. 1981 103 2127 2129 10.1021/ja00398a058 19. Martin S.F. Dodge J.A. Efficacious Modification of the Mitsunobu Reaction for Inversions of Sterically Hindered Secondary Alcohols Tetrahedron Lett. 1991 32 3017 3020 10.1016/0040-4039(91)80675-V 20. Sone H. Kondo T. Kiryu M. Ishiwata H. Ojika M. Yamada K. Dolabellin, a Cytotoxic Bisthiazole Metabolite from the Sea Hare Dolabella Auricularia: Structural Determination and Synthesis J. Org. Chem. 1995 60 4774 4781 10.1021/jo00120a021 21. Shioiri T. Hayashi K. Hamada Y. Stereoselective Synthesis of Dolastatin 10 and Its Congeners Tetrahedron 1993 49 1913 1924 10.1016/S0040-4020(01)80547-0 Figures and Schemes Figure 1 Chemical structures of serinolamides C and D and lyngbyabellins O, P, F, and G. Figure 2 Chemical structures of lyngbyabellins A, B, and M. marinedrugs-23-00340-sch001_Scheme 1 Scheme 1 Retrosynthetic analysis of lyngbyabellins O ( 3 4 marinedrugs-23-00340-sch002_Scheme 2 Scheme 2 Synthesis of thiazole fragment 12 marinedrugs-23-00340-sch003_Scheme 3 Scheme 3 Synthesis of thiazole fragment 13 marinedrugs-23-00340-sch004_Scheme 4 Scheme 4 Synthesis of dichlorohydroxyl acid 14 marinedrugs-23-00340-sch005_Scheme 5 Scheme 5 Synthesis of compound 10 marinedrugs-23-00340-sch006_Scheme 6 Scheme 6 Total syntheses of lyngbyabellin O ( 3 4 ",
  "metadata": {
    "Title of this paper": "Stereoselective Synthesis of Dolastatin 10 and Its Congeners",
    "Journal it was published in:": "Marine Drugs",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12471755/"
  }
}