{
  "title": "Paper_394",
  "abstract": "pmc ANZ J Surg ANZ J Surg 379 blackwellopen ANS Anz Journal of Surgery 1445-1433 1445-2197 pmc-is-collection-domain yes pmc-collection-title Wiley Open Access Collection PMC12484407 PMC12484407.1 12484407 12484407 40698733 10.1111/ans.70259 ANS70259 2287191 1 Perspective Perspective Redefining the Impact of Cancer in Aotearoa New Zealand Thompson Nasya https://orcid.org/0000-0003-0037-9244  1 nasya.thompson@cdhb.health.nz Pearson John https://orcid.org/0000-0001-5607-4517  2 Frizelle Francis  1  3 Koea Jonathan https://orcid.org/0000-0001-8833-5603  4 Glyn Tamara  1  3   1 Department of Surgery University of Otago Christchurch Christchurch New Zealand   2 Department of Medicine University of Otago Christchurch Christchurch New Zealand   3 Department of Surgery Te Whatu Ora Health New Zealand Waitaha Canterbury Christchurch New Zealand   4 Department of Surgery Waitemata District Health Board Auckland New Zealand * Correspondence: nasya.thompson@cdhb.health.nz 23 7 2025 9 2025 95 9 498039 10.1111/ans.v95.9 1660 1662 30 6 2025 23 5 2025 08 7 2025 01 10 2025 02 10 2025 03 10 2025 © 2025 The Author(s). ANZ Journal of Surgery https://creativecommons.org/licenses/by-nc-nd/4.0/ This is an open access article under the terms of the http://creativecommons.org/licenses/by-nc-nd/4.0/ Health Research Council of New Zealand 10.13039/501100001505 25/641/A pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement no pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes source-schema-version-number 2.0 cover-date September 2025 details-of-publishers-convertor Converter:WILEY_ML3GV2_TO_JATSPMC version:6.6.4 mode:remove_FC converted:30.09.2025  N. Thompson J. Pearson F. Frizelle J. Koea T. Glyn Redefining the Impact of Cancer in Aotearoa New Zealand ANZ Journal of Surgery 95 9 2025 1660 1662 10.1111/ans.70259 PMC12484407 40698733  Funding: Globally, there are around 20 million new cancer diagnoses each year, with cancer accounting for approximately 15% of all deaths. In Aotearoa New Zealand (AoNZ), cancer diagnoses are projected to increase from 25 700 per year in 2015–2019 to 45 100 per year by 2040–2044, a 76% increase [ 1 Current tools for measuring the impact of cancer focus on assessing biomedical outcomes, such as survival rates and disease progression, or health‐related QoL for cost assessment analyses. These assessments range from generic QoL questionnaires—such as the SF 36, EuroQol‐5 dimensions instrument [ 2 3 4 5 6 7 While these instruments provide valuable insights, they fail to capture a more holistic impact of cancer on patients and their whānau (extended whānau and caregivers), particularly across diverse ethnic and social contexts. A broader understanding of impact that encompasses economic stability, social wellbeing, spiritual and cultural health (including whenua (land), language, customs), emotional resilience, cognitive functioning, interpersonal relationships and connectedness to the community is necessary. These dimensions are of particular importance within indigenous and multicultural communities in which the impact of cancer is more likely to extend beyond the individual to affect the whānau, due to the interconnected nature of social and support networks [ 8 9 10 In AoNZ, persistent inequalities in healthcare access, experience, and outcomes affect population groups historically underserved by the health system. These include Māori (the Indigenous peoples of AoNZ), Pacific peoples, people with disabilities, low socioeconomic communities, immigrant populations, and those living in rural areas [ 11 12 The Cancer Rehabilitation Evaluation System tool (CARES) is a broader wellbeing assessment tool that considers both QoL and needs, that was developed to understand the number, type, and severity of difficulties that an individual may experience following their cancer diagnosis [ 13 14 15 In an attempt to address the cultural limitations of these models and improve relevance and face validity, the Supportive Care Needs Assessment Tool for Indigenous People (SCNAT‐IP) was developed in 2012 for Indigenous‐specific cancer concerns within the Indigenous Australian community [ 16 16 17 By redefining how impact is measured, we can work towards a system that places the well‐being of patients and their whānau at the forefront of care. A better measurement system has the potential to ensure there is appropriate health funding allocation for underrepresented populations and allow the development of more personalised survivorship care and prioritise holistic well‐being that encompasses culturally safe cancer care models. It is paramount that the future of cancer care reflects the realities of those who are living with the disease. Acknowledgement Open access publishing facilitated by University of Otago, as part of the Wiley ‐ University of Otago agreement via the Council of Australian University Librarians. Data Availability Statement Data sharing not applicable to this article as no datasets were generated or analysed during the current study. References 1 A. Teng J. Stanley C. Jackson The Growing Cancer Burden: Age‐Period‐Cohort Projections in Aotearoa New Zealand 2020‐2044 Cancer Epidemiology 89 2024 102535 38280359 10.1016/j.canep.2024.102535 2 T. Sullivan P. Hansen F. Ombler S. Derrett N. Devlin A New Tool for Creating Personal and Social EQ‐5D‐5L Value Sets, Including Valuing ‘Dead’ Social Science and Medicine 246 2020 112707 31945596 10.1016/j.socscimed.2019.112707 3 I. Wiklund The Nottingham Health Profile—A Measure of Health‐Related Quality of Life Scandinavian Journal of Primary Health Care. Supplement 1 1990 15 18 2100359 4 N. K. Aaronson S. Ahmedzai B. Bergman The European Organization for Research and Treatment of Cancer QLQ‐C30: A Quality‐Of‐Life Instrument for Use in International Clinical Trials in Oncology JNCI Journal of the National Cancer Institute 85 5 1993 365 376 8433390 10.1093/jnci/85.5.365 5 N. E. Avis K. W. Smith S. McGraw R. G. Smith V. M. Petronis C. S. Carver Assessing Quality of Life in Adult Cancer Survivors (QLACS) Quality of Life Research 14 2005 1007 1023 16041897 10.1007/s11136-004-2147-2 6 M. A. Weitzner C. A. Meyers C. K. Gelke K. S. Byrne V. A. Levin D. F. Cella The Functional Assessment of Cancer Therapy (FACT) Scale. Development of a Brain Subscale and Revalidation of the General Version (FACT‐G) in Patients With Primary Brain Tumors Cancer 75 5 1995 1151 1161 7850714 10.1002/1097-0142(19950301)75:5<1151::aid-cncr2820750515>3.0.co;2-q 7 J. Elliott A. Fallows L. Staetsky The Health and Well‐Being of Cancer Survivors in the UK: Findings From a Population‐Based Survey British Journal of Cancer 105 1 2011 S11 S20 22048028 10.1038/bjc.2011.418 PMC3251954 8 M. H. Durie A Maori Perspective of Health Social Science and Medicine 20 5 1985 483 486 3992288 10.1016/0277-9536(85)90363-6 9 T. K. K. M. Durie “Hua Oranga: A Māori Measure of Mental Health Outcomes,” 1999 10 N. Scott M. Ruka A. R. Jones Cancer WHIRI Research: Improving the Early Cancer Pathway for Indigenous NZ Peoples Cancer Research 82 12_Supplement 2022 5278 11 J. Gurney J. Stanley D. Sarfati The Inequity of Morbidity: Disparities in the Prevalence of Morbidity Between Ethnic Groups in New Zealand Journal of Comorbidity 10 2020 2235042X20971168 10.1177/2235042X20971168 PMC7658519 33224894 12 N. F. Sheridan T. W. Kenealy M. J. Connolly Health Equity in the New Zealand Health Care System: A National Survey International Journal for Equity in Health 10 2011 1 14 22014211 10.1186/1475-9276-10-45 PMC3216847 13 C. Schag R. Heinrich Development of a Comprehensive Quality of Life Measurement Tool: CARES Oncology 4 5 1990 135 138 2143399 14 P. A. Ganz C. A. C. Schagi H.‐L. Cheng Assessing the Quality of Life—A Study in Newly‐Diagnosed Breast Cancer Patients Journal of Clinical Epidemiology 43 1 1990 75 86 2319284 10.1016/0895-4356(90)90059-x 15 R. A Understanding How Whānau‐Centred Initiatives Can Improve Māori Health in Aotearoa New Zealand Health Promotion International 38 4 2023 daad070 37493232 10.1093/heapro/daad070 PMC11305146 16 G. Garvey V. L. Beesley M. Janda The Development of a Supportive Care Needs Assessment Tool for Indigenous People With Cancer BMC Cancer 12 2012 1 10 22817614 10.1186/1471-2407-12-300 PMC3442991 17 B. Thewes E. Davis A. Girgis Routine Screening of Indigenous Cancer Patients' Unmet Support Needs: A Qualitative Study of Patient and Clinician Attitudes International Journal for Equity in Health 15 2016 1 12 27286811 10.1186/s12939-016-0380-2 PMC4902957 ",
  "metadata": {
    "Title of this paper": "Routine Screening of Indigenous Cancer Patients' Unmet Support Needs: A Qualitative Study of Patient and Clinician Attitudes",
    "Journal it was published in:": "Anz Journal of Surgery",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12484407/"
  }
}