{
  "title": "Paper_807",
  "abstract": "pmc J Appl Clin Med Phys J Appl Clin Med Phys 3200 jacmp ACM2 Journal of Applied Clinical Medical Physics 1526-9914 Wiley PMC12476867 PMC12476867.1 12476867 12476867 41016018 10.1002/acm2.70248 ACM270248 1 Research Article IMAGING PHYSICS Research Article Evaluation of image quality in mobile cone‐beam CT with dose modulation using automatic exposure control: A phantom study OKAZAKI et al. Okazaki Keita  1 Cao Wenchao  1 Taleei Reza  1 Mourtada Firas https://orcid.org/0000-0002-4388-5334  1 Li Jun  1 Mooney Karen  1 Anne Pramila Rani  1 Chen Yingxuan https://orcid.org/0000-0003-1617-9001  1 yingxuan.chen@jefferson.edu   1 Department of Radiation Oncology Thomas Jefferson University Philadelphia Pennsylvania USA * Correspondence yingxuan.chen@jefferson.edu 28 9 2025 10 2025 26 10 497070 10.1002/acm2.v26.10 e70248 01 8 2025 16 4 2025 11 8 2025 28 09 2025 29 09 2025 29 09 2025 © 2025 The Author(s). Journal of Applied Clinical Medical Physics https://creativecommons.org/licenses/by/4.0/ This is an open access article under the terms of the http://creativecommons.org/licenses/by/4.0/ Abstract Background The integration of mobile cone‐beam computed tomography (CBCT) into brachytherapy workflows offers clinical advantages such as immediate verification of applicator placement and adaptive treatment planning. These benefits require sufficient image quality to delineate applicators, target volumes, and organs at risk. A systematic evaluation of automatic exposure control (AEC) settings, radiation dose, and image quality is essential to ensure clinically acceptable imaging while minimizing patient exposure. Purpose This study evaluates the characteristics of AEC and its impact on image quality and radiation dose in a mobile CBCT system used for brachytherapy. Methods The Elekta ImagingRing CBCT system was used to scan a CatPhan phantom under two imaging protocols: Medium Dose Limit (MDL) and Ultra‐High Dose Limit (UHDL). This system employs a two‐layer mAs modulation process, consisting of preset mA values based on body mass index (BMI) and adjusted mA based on real‐time AEC. A bolus was used to simulate larger patient sizes. Real‐time x‐ray tube current at 10 degrees intervals was recorded. Image quality was evaluated using image noise, noise power spectrum (NPS), modulation transfer function (MTF), Hounsfield Unit (HU) linearity, uniformity index (UI), and contrast‐to‐noise ratio (CNR) across different protocols. Results AEC effectively modulated x‐ray tube current in the MDL protocol after x‐ray attenuation through the scanned phantom was measured. The UHDL protocol demonstrated greater noise reduction than the MDL. MTF values were comparable between protocols, indicating preserved spatial resolution in the MDL protocol. HU linearity was consistent across all protocols, with R 2 Conclusion AEC in mobile CBCT optimized radiation dose and image quality by adjusting tube current based on attenuation. The MDL protocol reduced radiation exposure while maintaining image quality, making it a viable option for verifying applicator placement and treatment planning in brachytherapy. The UHDL protocol achieved noise reduction with the maximum available tube current. automatic exposure control CBCT HDR brachytherapy image quality pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement no pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes source-schema-version-number 2.0 cover-date October 2025 details-of-publishers-convertor Converter:WILEY_ML3GV2_TO_JATSPMC version:6.6.4 mode:remove_FC converted:28.09.2025  Okazaki K Cao W Taleei R Evaluation of image quality in mobile cone‐beam CT with dose modulation using automatic exposure control: A phantom study J Appl Clin Med Phys 2025 26 e70248 10.1002/acm2.70248 1 INTRODUCTION Brachytherapy is a crucial treatment modality in modern radiation oncology, particularly for gynecologic, prostate, and breast cancer.  1  2  3  4  5  6 Cone‐beam computed tomography (CBCT) was initially developed for image guidance in external beam radiotherapy (EBRT) and has since been adapted for intraoperative 3D imaging in brachytherapy.  7  8 To optimize imaging quality and imaging dose in CBCT, automatic exposure control (AEC) has been incorporated into these systems. AEC dynamically adjusts the x‐ray tube current based on patient anatomy, a feature that has been a standard in diagnostic CT imaging, where its benefits in dose optimization are well documented.  9  10 The integration of mobile CBCT into brachytherapy workflows provides several clinical advantages. First, it enables immediate verification of applicator placement without requiring patient transfer to a conventional CT scanner, thereby reducing procedural time and improving workflow efficiency. Second, real‐time imaging facilitates adaptive treatment planning, allowing for corrections in applicator positioning or adjustments to account for anatomical changes before the radioactive source is loaded. This capability is particularly beneficial in high‐dose‐rate (HDR) brachytherapy, where precise dose conformity is critical.  11  12  13 Previous studies evaluated the image quality of this mobile CBCT system using different scan protocols which had different exposure time, voltage, and tube output. They obtained good image quality with a Catphan phantom using different protocols.  14 In this study, we aim to assess the performance of AEC in a mobile CBCT system by simulating various patient body mass index (BMI) conditions. Moreover, we comprehensively evaluate image quality using a phantom with and without a bolus across different BMI settings under two imaging protocols. 2 MATERIALS AND METHODS 2.1 Image acquisition and phantom The Elekta ImagingRing CBCT system (Elekta, Veenendaal, Netherlands) was installed at our institution for brachytherapy in 2022.  12 1 TABLE 1 Details about simulated patient data. Simulated patient name Height Weight BMI BMI 20 5'4\" 120 lbs 20 BMI 26 5'4\" 150 lbs 26 BMI 34 5'4\" 200 lbs 34 BMI 40 5'4\" 240 lbs >40 John Wiley & Sons, Ltd. As shown in Table 2 TABLE 2 Preset tube current based on BMI. Preset tube current (mA) BMI The MDL protocol The UHDL protocol 20 8.7 17.1 26 15.8 17.1 34 17.1 17.1 >40 17.1 17.1 John Wiley & Sons, Ltd. To evaluate image quality, a CatPhan 500 phantom (Phantom Laboratory, Salem, New York, USA) was used, as shown in Figure 1a  15 1b FIGURE 1 A CatPhan 500 phantom: (a) and (b) show the front and side view of the phantom without a bolus. (c) The front view with a bolus. 2.2 AEC characteristics The Elekta ImagingRing CBCT system can record real‐time tube current values at every 10‐degree projection angle throughout the scan. To evaluate the AEC response, real‐time mA values were acquired for each BMI preset under both protocols, both with and without a bolus wrapped around the phantom. When no bolus was applied, real‐time mA values were recorded for all BMI presets in both protocols. When a bolus was applied, real‐time mA values were obtained for each BMI preset in the MDL protocol, as well as for BMI 20 and BMI 40 in the UHDL protocol. The recorded Weighted Cone Beam Dose Index (CBDI w 2.3 Image quality To comprehensively evaluate image quality, we performed analysis for image noise, spatial resolution, HU linearity, uniformity index (UI), and contrast‐to‐noise ratio (CNR) in this study. 2.3.1 Image noise The CTP486 module was used to assess image noise and the noise power spectrum (NPS).  16  17 2 2 FIGURE 2 Forty‐four ROIs in the uniformity module. (WL/WW [‐40, 500]). To analyze the NPS, the average HU value in each ROI was calculated, and the difference between individual pixel HU values and the ROI mean HU value was determined. A two‐dimensional Fourier Transform was then applied to these differences, and the NPS was computed using the following equation: (1) N P S f x , f y = 1 N × D x D y V x V y ∑ i = 1 N F F T 2 D R O I i x , y − R O I i x , y ¯ 2 N D x D y V x V y 2.3.2 Spatial resolution To evaluate spatial resolution, the modulation transfer function (MTF) was analyzed using the CTP528 module with an edge‐spread function (ESF) analysis.  18  19 3 FIGURE 3 Analysis of MTF using the edge spread function. (WL/WW [40, 800]). The ESF was defined as the gray‐value transition within a range extending from eight pixels away from the first maximum intensity to the first maximum intensity. The line spread function (LSF) was then obtained by differentiating the ESF with respect to distance. Finally, a Fourier Transform was applied to the LSF to compute the MTF, providing a quantitative assessment of spatial resolution. 2.3.3 HU linearity The CTP401 module was used to assess Hounsfield Unit (HU) linearity. This module contains seven materials with different electron densities, including air, polymethylpentene (PMP), low‐density polyethylene (LDPE), polystyrene, acrylic, Delrin, and Teflon. To evaluate HU values, circular ROIs with an 8 mm diameter were placed in each material, as illustrated in Figure 4 FIGURE 4 The ROI in different materials: air (‐1000 HU), PMP (‐200 HU), LDPE (‐100 HU), polystyrene (‐35 HU), acrylic (120 HU), Delrin (340 HU), and Teflon (990 HU). (WL/WW [0, 600]). HU linearity was assessed by calculating the coefficient of determination ( R 2 R 2 (2) R 2 = 1 − ∑ i = 1 n y i − y i ^ 2 ∑ i = 1 n y i − y ^ 2 y i y i ^ y ^ 2.3.4 Uniformity Uniformity was assessed using the CTP486 module by placing five square ROIs of 20 × 20 pixels. One ROI was positioned at the center of the image, while the remaining four were placed 60 mm from the center in the superior, inferior, right, and left directions to represent the peripheral ROIs. The UI was calculated using the following equation: (3) U I = 100 H U ¯ P e r i p h e r y − H U ¯ C e n t e r H U ¯ C e n t e r + 1000 H U ¯ C e n t e r H U ¯ P e r i p h e r y H U ¯ P e r i p h e r y  20  21 2.3.5 Contrast‐to‐noise ratio To evaluate the CNR, three inserted materials—LDPE, polystyrene, and Delrin—in the CTP401 module were analyzed. The same ROIs defined in Section II.C.3 were used for these materials. Additional ROIs of identical size were placed in homogeneous background regions adjacent to the inserted materials. The CNR was calculated using the following equation: (4) C N R I n s e r t = H U ¯ I n s e r t − H U ¯ B a c k g r o u n d 1 2 · σ B a c k g r o u n d 2 + σ I n s e r t 2 H U ¯ σ  14  20 3 RESULTS To evaluate x‐ray tube current modulation during the image acquisition, real‐time x‐ray tube current at every 10‐degree projection angle were recorded and shown in Figure 5 5 FIGURE 5 The real‐time tube current: (a) in the MDL protocol without a bolus, (b) in the MDL protocol with a bolus, (c) in the UHDL protocol without a bolus, and (d) shows preset mAs and average current. Figure 5a 5a To simulate a larger patient, the phantom was wrapped with a bolus to increase x‐ray attenuation. Figure 5b In contrast, the UHDL protocol maintains a fixed mA preset of 17.1 mA for all BMI categories, and the real‐time current in this protocol is shown in Figure 5c 5c 5d Figure 5d The Weighted Cone Beam Dose Index (CBDI w 3 w w TABLE 3 The recorded CBDI w CBDI w BMI 20 BMI 40 MDL protocol 6.89 7.08 UHDL protocol 24.13 22.89 MDL protocol with bolus 15.79 15.34 UHDL protocol with bolus 22.69 22.66 John Wiley & Sons, Ltd. Image noise was quantified by calculating the mean SD from 44 square ROIs, positioned radially at a 60 mm distance from the phantom center. The images of the uniformity module for BMI 20 and 40 in each protocol with and without a bolus are shown in Figure 6 4 FIGURE 6 The images of the uniform module: (a) for BMI 20, and (b) for BMI40. (WL/WW [‐40, 500]). TABLE 4 Image noise analysis: The standard deviation with the average current. BMI 20 BMI 40 Average current (mA) Image noise Average current (mA) Image noise MDL protocol 5.0 7.446 5.0 7.190 UHDL protocol 18.0 7.090 17.0 7.192 MDL protocol with bolus 12.0 9.848 11.0 9.720 UHDL protocol with bolus 17.0 9.621 17.0 9.637 John Wiley & Sons, Ltd. The NPS was analyzed for BMI 20 and BMI 40, as shown in Figure 7a and b FIGURE 7 The noise power spectrum in two protocols showing the analyzed images of CTP486 module: (a) for BMI 20, and (b) for BMI40. The MTF was analyzed for BMI 20 and BMI 40, as shown in Figure 8a and b FIGURE 8 MTF curve with and without a bolus in two protocols: (a) for BMI20 and (b) for BMI 40. The assessment of image sensitometry was conducted using the CTP401 module as shown in Figure 9 R 2 10 5 R 2 R 2 FIGURE 9 The images of the sensitometry module: (a) for BMI 20, and (b) for BMI40. (WL/WW [0, 600]). FIGURE 10 HU linearity for BMI 20 with and without a bolus in two protocols. TABLE 5 The R 2 BMI 20 BMI 26 BMI34 BMI40 MDL protocol 0.998 0.996 0.999 0.998 UHDL protocol 0.998 0.997 0.996 0.998 MDL protocol with bolus 0.993 0.994 0.995 0.993 UHDL protocol with bolus 0.994 0.993 John Wiley & Sons, Ltd. Table 6  14 TABLE 6 The uniformity index (UI) and contrast‐to‐noise ratio (CNR) with BMI 20 and 40 in each protocol with and without bolus. CNR BMI‐Protocol UI(%) LDPE Polystyrene Delrin BMI20 ‐MDL 8.32 22.07 17.87 24.55 ‐UHDL 8.17 22.99 20.87 25.29 ‐MDL with bolus 9.06 11.34 9.87 9.89 ‐UHDL with bolus 8.85 13.78 10.48 10.57 BMI40 ‐MDL 7.19 20.88 18.15 23.42 ‐UHDL 8.49 21.49 19.05 24.07 ‐MDL with bolus 8.26 10.76 9.17 10.53 ‐UHDL with bolus 9.18 11.08 10.16 11.73 John Wiley & Sons, Ltd. 4 DISCUSSION The mobile CBCT system (ImagingRing, Elekta) has been developed to provide in‐room volumetric images. With the in‐room imaging guidance, the efficiency and accuracy of brachytherapy can be further improved. Several studies have already demonstrated the potential use of this mobile CBCT for brachytherapy applicator placement verification and treatment planning.  22  23 This study evaluated the system using manufacturer‐defined standard imaging protocols with AEC for HDR gynecologic brachytherapy patients, without manual adjustment of scan parameters. Specifically, we comprehensively evaluate the HDR gynecologic imaging protocols using the CatPhan phantom, while other site‐specific protocols were not included. Previous studies have suggested that protocol‐specific parameter adjustment may improve image uniformity and artifact suppression depending on the scan object.  14  24 This system incorporates AEC to dynamically adjust the x‐ray tube current based on the attenuation characteristics of the scanned object. The findings of this study demonstrated that AEC functioned effectively within the MDL protocol, modulating real‐time tube current according to phantom attenuation properties. Even when the initial mA preset was high, AEC dynamically adjusted the current to optimize imaging conditions. When the phantom was wrapped with a bolus to simulate increased tissue thickness, the real‐time current increased accordingly, highlighting the AEC system's ability to compensate for greater attenuation. The CBDI w The evaluation of NPS demonstrated that the UHDL protocol exhibited lower NPS values compared to the MDL protocol. This finding aligns with the image noise analysis, which showed that the UHDL protocol resulted in greater noise levels than the MDL protocol. The increased noise in the UHDL protocol contributed to its higher NPS values at low spatial frequencies. Analysis of the MTF revealed that all tested conditions exhibited reduced MTF values at high spatial frequencies, indicating limitations in edge sharpness and spatial resolution. Overall, the MTF curves in both protocols remined similar with or without a bolus. This is important clinically to obtain similar spatial resolution for different BMIs. The assessment of image sensitometry confirmed that HU linearity remained consistent across BMI categories in both the MDL and UHDL protocols. The R 2  25  26 However, the image quality is degraded when scanning large objects. As shown in Figure 9 11  14 FIGURE 11 The experiment setup and the CT images in the uniformity module in the MDL protocol: (a) is a full bolus, (b) is a half bolus. (WL/WW [‐40, 500]). Furthermore, this study demonstrated the performance of AEC using the Catphan phantom, which does not include any metallic material. In recent years, MR imaging has become widely adopted for HDR brachytherapy due to its superior soft tissue contrast, and many contemporary MR/CT compatible applicators are designed without metallic components. However, certain applicators, such as steel needles or shielded applicators, still contain metal elements. These materials may introduce beam hardening and streak artifacts, which would potentially affect the image quality and clinical use. Previous studies have highlighted these issues.  14 Overall, these results highlight the effectiveness of AEC in optimizing radiation dose and image quality in a recently introduced mobile CBCT system for brachytherapy. The MDL protocol successfully adjusted tube current, maintaining image quality while reducing radiation dose. This makes it particularly suitable for applicator placement verification. In contrast, the UHDL protocol achieved the highest image quality, making it the preferred choice for brachytherapy treatment planning. 5 CONCLUSION This study demonstrated that AEC effectively modulates tube current in real time, optimizing radiation dose and image quality based on x‐ray attenuation. The MDL protocol maintains image quality comparable to the UHDL protocol while reducing radiation exposure, particularly for thinner patients. However, image quality is slightly degraded when scanning large objects. The UHDL protocol delivers the highest image quality at the maximum available exposure of the machine, making it the recommended choice for brachytherapy treatment planning. These findings support the safe and effective use of mobile CBCT in brachytherapy, highlighting the advantages of AEC for imaging dose efficiency. AUTHOR CONTRIBUTIONS Keita Okazaki wrote the first draft of the manuscript and analyzed image quality using Python. Yingxuan Chen, Keita Okazaki and Wenchao Cao performed the experiment using a CatPhan phantom and ImagingRing CBCT system. Other authors contributed to the critical review and revision of the manuscript, providing valuable feedback. Yingxuan Chen provided overall guidance and leadership of the study through discussions with the other authors, reviewed the results, and reviewed the manuscript. CONFLICT OF INTEREST STATEMENT The authors declare no conflicts of interest ACKNOWLEDGMENTS This work was supported by a collaborative research agreement between Thomas Jefferson University and Elekta. REFERENCES 1 Lanciano RM Won M Coia LR Hanks GE Pretreatment and treatment factors associated with improved outcome in squamous cell carcinoma of the uterine cervix: a final report of the 1973 and 1978 patterns of care studies Int J Radiat Oncol Biol Phys 1991 20 4 667 676 10.1016/0360-3016(91)90007-Q 2004942 2 Galalae RM Kovács G Schultze J Long‐term outcome after elective irradiation of the pelvic lymphatics and local dose escalation using high‐dose‐rate brachytherapy for locally advanced prostate cancer Int J Radiat Oncol Biol Phys 2002 52 1 81 90 10.1016/S0360-3016(01)01758-8 11777625 3 Polgár C Fodor J Major T Sulyok Z Kásler M Breast‐conserving therapy with partial or whole breast irradiation: ten‐year results of the Budapest randomized trial Radiother Oncol 2013 108 2 197 202 10.1016/j.radonc.2013.05.008 23742961 4 Tanderup K Nesvacil N Pötter R Kirisits C Uncertainties in image guided adaptive cervix cancer brachytherapy: impact on planning and prescription Radiother Oncol 2013 107 1 1 5 10.1016/j.radonc.2013.02.014 23541642 5 Haie‐Meder C Pötter R Van Limbergen E Recommendations from Gynaecological (GYN) GEC‐ESTRO Working Group (I): concepts and terms in 3D image based 3D treatment planning in cervix cancer brachytherapy with emphasis on MRI assessment of GTV and CTV Radiother Oncol 2005 74 3 235 245 10.1016/j.radonc.2004.12.015 15763303 6 Pötter R Haie‐Meder C Van Limbergen E Recommendations from gynaecological (GYN) GEC ESTRO working group (II): concepts and terms in 3D image‐based treatment planning in cervix cancer brachytherapy ‐ 3D dose volume parameters and aspects of 3D image‐based anatomy, radiation physics, radiobiology Radiother Oncol 2006 78 1 67 77 10.1016/j.radonc.2005.11.014 16403584 7 Jaffray DA Image‐guided radiotherapy: from current concept to future perspectives Nat Rev Clin Oncol 2012 9 12 688 699 10.1038/nrclinonc.2012.194 23165124 8 Ding GX Alaei P Curran B Image guidance doses delivered during radiotherapy: quantification, management, and reduction: report of the AAPM Therapy Physics Committee Task Group 180 Med Phys 2018 45 5 e84 e99 10.1002/mp.12824 29468678 9 McCollough CH Bruesewitz MR Kofler JM CT dose reduction and dose management tools: overview of available options Radiographics 2006 26 2 503 512 10.1148/rg.262055138 16549613 10 Endo M Mori S Tsunoo T Miyazaki H Magnitude and effects of x‐ray scatter in a 256‐slice CT scanner Med Phys 2006 33 9 3359 3368 10.1118/1.2239366 17022232 11 Tanderup K Lindegaard JC Kirisits C Image guided adaptive brachytherapy in cervix cancer: a new paradigm changing clinical practice and outcome Radiother Oncol 2016 120 3 365 369 10.1016/j.radonc.2016.08.007 27555228 12 Boyle C Mourtada F Anne R Comprehensive commissioning of a cone beam CT imaging ring for treatment of HDR GYN patients Brachytherapy 2024 23 6 687 697 10.1016/j.brachy.2024.07.008 39266424 13 Jaffray DA Siewerdsen JH Cone‐beam computed tomography with a flat‐panel imager: initial performance characterization Med Phys 2000 27 6 1311 1323 10.1118/1.599009 10902561 14 Karius A Karolczak M Strnad V Bert C Technical evaluation of the cone‐beam computed tomography imaging performance of a novel, mobile, gantry‐based X‐ray system for brachytherapy J Appl Clin Med Phys 2022 23 2 e13501 10.1002/acm2.13501 34905285 PMC8833290 15 Goodenough DJ Catphan 500 and 600 Manual 2012 16 Li Y Jiang Y Liu H A phantom study comparing low‐dose CT physical image quality from five different CT scanners Quant Imaging Med Surg 2022 12 1 766 780 10.21037/qims-21-245 34993117 PMC8666789 17 Lassot‐Buys M Verstraet R Dabli D Moliner G Greffier J Task‐based image quality assessment comparing classical and iterative cone beam CT images on Halcyon® Diagnostics 2023 13 3 448 10.3390/diagnostics13030448 36766553 PMC9914039 18 Zhou Z Gao F Zhao H Improving the accuracy of MTF measurement at low frequencies based on oversampled edge spread function deconvolution J Xray Sci Technol 2015 23 4 517 529 10.3233/XST-150506 26410662 19 Boone JM Seibert JA An analytical edge spread function model for computer fitting and subsequent Calculation of the LSF and MTF Med Phys 1994 21 10 1541 1545 10.1118/1.597264 7869985 20 Tomic N Papaconstadopoulos P Aldelaijan S Rajala J Seuntjens J Devic S Image quality for radiotherapy CT simulators with different scanner bore size Phys Med 2018 45 65 71 10.1016/j.ejmp.2017.11.017 29472093 21 Specification and Acceptance Testing of Computed Tomography Scanners : The Report of Task Group 2, Diagnostic X‐Ray Imaging Committee Published for American Association of Physicists in Medicine by the American Institute of Physics 1993 22 Karius A Strnad V Lotter M Kreppner S Bert C First clinical experience with a novel, mobile cone‐beam CT system for treatment quality assurance in brachytherapy Strahlenther Onkol 2022 198 6 573 581 10.1007/s00066-022-01912-7 35278094 PMC9165284 23 Haldar N Taleei R Mourtada F PO0258: clinical validation of using an in‐room mobile CBCT scanner for cylinder based brachytherapy planning Brachytherapy 2024 23 6 S121 S122 10.1016/j.brachy.2024.08.188 24 Karius A Szkitsak J Boronikolas V Fietkau R Bert C Quality assurance and long‐term stability of a novel 3‐in‐1 X‐ray system for brachytherapy J Appl Clin Med Phys 2022 23 9 e13727 10.1002/acm2.13727 35848090 PMC9512339 25 Ma Y Lacroix F Lavallée MC Beaulieu L Validation of the Oncentra Brachy Advanced Collapsed cone engine for a commercial 192Ir source using heterogeneous geometries Brachytherapy 2015 14 6 939 952 10.1016/j.brachy.2015.08.003 26403533 26 Ballester F Carlsson Tedgren Å Granero D A generic high‐dose rate 192Ir brachytherapy source for evaluation of model‐based dose calculations beyond the TG‐43 formalism Med Phys 2015 42 6 3048 3062 10.1118/1.4921020 26127057 ",
  "metadata": {
    "Title of this paper": "A generic high‐dose rate 192Ir brachytherapy source for evaluation of model‐based dose calculations beyond the TG‐43 formalism",
    "Journal it was published in:": "Journal of Applied Clinical Medical Physics",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12476867/"
  }
}