{
  "title": "Paper_896",
  "abstract": "pmc Discov Oncol Discov Oncol 4139 discon Discover Oncology 2730-6011 Springer PMC12474806 PMC12474806.1 12474806 12474806 41003895 10.1007/s12672-025-03550-8 3550 1 Analysis Multi-omics analysis reveals the prognostic value and immunomodulatory role of CTSW in breast cancer Liu Xvliang 1 Yin Zeli 2 Xi Pengju 1 Wang Liming wangbcc259@163.com 1 2 3 Mao Jiakai 1 1 https://ror.org/012f2cn18 grid.452828.1 0000 0004 7649 7439 Department of General Surgery, Division of Hepatobiliary and Pancreatic Surgery, The Second Affiliated Hospital of Dalian Medical University, 2 https://ror.org/04c8eg608 grid.411971.b 0000 0000 9558 1426 Engineering Research Center for New Materials and Precision Treatment Technology of Malignant Tumors Therapy, The Second Affiliated Hospital, Dalian Medical University, 3 https://ror.org/04c8eg608 grid.411971.b 0000 0000 9558 1426 Engineering Technology Research Center for Translational Medicine, The Second Affiliated Hospital, Dalian Medical University, 26 9 2025 12 2025 16 478248 1739 5 6 2025 29 8 2025 26 09 2025 28 09 2025 28 09 2025 © The Author(s) 2025 2025 https://creativecommons.org/licenses/by-nc-nd/4.0/ Open Access http://creativecommons.org/licenses/by-nc-nd/4.0/ Background The inherent complexity and biological heterogeneity of breast cancer pose substantial challenges to the development of effective personalized therapies. The exploration of novel biomarkers, particularly those linked to the tumor immune microenvironment (TME), presents promising opportunities. This study employed a multi-omics framework to investigate the potential regulatory role of cysteine proteases in breast cancer, aiming to identify and characterize novel prognostic markers and strategic therapeutic targets. Methods We employed a comprehensive in silico analysis utilizing transcriptomic, methylomic, quantitative trait locus, and genome-wide association studies data. Differentially expressed genes (DEGs) were identified using established statistical tools. Their prognostic significance was assessed through Cox regression and Kaplan-Meier survival analyses. Mendelian randomization (MR) was used to infer potential causal relationships between gene expression and breast cancer risk. Functional enrichment analysis and immune infiltration assessment were performed to elucidate the biological context of DEGs. Single-cell RNA sequencing data provided high-resolution insights into the TME, and protein-protein interaction networks identified key biological pathways. Findings CTSW emerged as a gene of critical prognostic significance. High CTSW expression was strongly correlated with improved patient survival across breast cancer subtypes. Causal inference via MR provided strong genetic evidence supporting a protective role for CTSW against breast cancer risk. Functional enrichment analysis implicated CTSW in key immune-related pathways, including T-cell activation. Crucially, single-cell analysis revealed that CTSW expression was not only enriched in activated CD8 + T cells but its intrinsic per-cell expression was highest within the triple negative breast cancer (TNBC) subtype, suggesting CTSW reflects the functional quality, not merely the quantity, of T-cell infiltration. This heightened expression in activated CD8 + T cells was strongly associated with a better prognosis. Finally, DNA methylation analysis suggested that epigenetic silencing contributes to CTSW’s downregulation in breast cancer. Interpretations This study underscores the pivotal role of CTSW in breast cancer immunology, positioning it as a key indicator of a potent anti-tumor immune response within the TME. Collectively, our findings establish a robust, data-driven hypothesis that CTSW’s high expression, particularly in TNBC, reflects a favorable, functionally active immune state. This comprehensive in silico investigation substantiates CTSW’s potential as a prognostic biomarker and provides a strong rationale for its future experimental validation as a therapeutic target. Supplementary Information The online version contains supplementary material available at 10.1007/s12672-025-03550-8. Keywords Multi-omics Breast cancer Mendelian randomization CTSW https://doi.org/10.13039/501100001809 National Natural Science Foundation of China 81972749 Wang Liming the Science and Technology Project of Liaoning 2021JH2/10300020 Wang Liming Liaoning Province Talent Plan project YXMJ-JC-04 Wang Liming Innovative Teams Project in Key Areas of Dalian 2021RT01 Wang Liming United Foundation for Dalian Institute of Chemical Physics, Chinese Academy of Sciences and the Second Hospital of Dalian Medical University DMU-2&DICP UN202301 Wang Liming pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement yes pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes issue-copyright-statement © Springer Science+Business Media LLC, part of Springer Nature 2025 Background Breast cancer is the most commonly diagnosed cancer worldwide, with projections indicating that the incidence will surpass 3 million new cases annually by 2040 [ 1 2 3 4 Multi-omics integrates data from the genome, transcriptome, and methylome to reveal the complex interactions within an organism. In oncology, it helps to investigate tumorigenic mechanisms and identify potential biomarkers [ 5 6 7 8 Cysteine proteases, a subset of protein hydrolases that employ cysteine residues as active sites, are indispensable in regulating diverse biological processes, including cell death, inflammation, and cellular pyroptosis [ 9 10 11 12 13 14 15 16 17 19 20 21 22 23 24 25 27 28 29 30 32 Given this knowledge gap, the present study was designed to address this challenge through a comprehensive, in silico approach. We integrated transcriptome data, quantitative trait locus (QTL) data, genome-wide association study (GWAS) data, DNA methylation data, and single-cell RNA sequencing (scRNA-seq) data. Our primary objective was not to establish a definitive mechanism, but rather to systematically screen the cysteine protease family, identify high-confidence candidate genes associated with clinical outcomes and immune modulation, and construct a robust, data-driven hypothesis regarding their functions. Accordingly, we aim to provide a new theoretical foundation and a high-priority research direction for the future experimental design of precision treatments for breast cancer. Materials and methods Data sources Genes associated with cysteine proteases were retrieved from the GeneCards database (Version 5.23) using the search term “Cysteine protease”. Transcriptome data ( n n 33 n n n 34 35 n 36 37 GSE240112 GSE176078 GSE261774 38 S1 Differentially expressed genes (DEGs) analysis DEGs were determined with the aid of the R packages limma, DESeq2, and edgeR. Genes were selected based on the criteria |log2(FoldChange)| > (mean(abs(log2FoldChange)) + 2 × sd(abs(log2FoldChange))), and an adjusted P-value < 0.05. Prognostic assessment Univariate and multivariate Cox regression analyses were performed to assess the prognostic value of the identified genes. Kaplan-Meier survival analysis was conducted to compare the high to low expression groups, categorized based on median expression levels, with log-rank tests applied for statistical comparison. Validation of major prognostic genes was conducted using the “Breast Cancer Gene-Expression Miner v5.1” tool [ 39 Summary-data-based Mendelian randomization (SMR) and two-sample Mendelian randomization (TSMR)-based causal inference analysis This section was conducted in accordance with the STROBE reporting guidelines (see Supplementary STROBE-MR checklist table) [ 40 41 P 42 P 43 P 44 Functional enrichment analysis Gene Ontology (GO) and Kyoto Encyclopedia of Genes and Genomes (KEGG) pathway enrichment analyses were conducted on DEGs using the R packages clusterProfiler and org.Hs.eg.db [ 45 46 Immune cell infiltration analysis The proportions of 22 immune cell types in RNA-seq samples were estimated using the CIBERSORT algorithm [ 47 https://cibersortx.stanford.edu Analysis of immune checkpoints and drug sensitivity Expression levels of immune checkpoint molecules were analyzed across subtypes to assess the potential sensitivity of each subtype to immune checkpoint inhibitors (ICIs) [ 48 49 Immune correlation analysis The correlation between candidate genes and immune checkpoints was evaluated. Additionally, the R package ggcor was employed to evaluate correlations between gene expression levels and immune cell signatures. Protein-protein interaction (PPI) network construction To explore functional associations between DEGs, a PPI network was constructed by the STRING program ( https://string-db.org 50 Breast cancer subtype analysis The “Breast Cancer Gene-Expression Miner v5.1” tool was used to analyze RNA-seq and DNA microarray data, with breast cancer subtypes classified using the Subtype Classifier for Molecular Oncology Database 2 (SCMOD2). Subtype-specific expression and Kaplan-Meier survival analyses were conducted for the HR+, HER2+, and TNBC subtypes [ 39 ScRNA-seq analysis The scRNA-seq data were preprocessed using the Seurat R package. Low-quality cells were excluded based on the following criteria: fewer than 200 or more than 4000 detected genes per cell, or mitochondrial gene expression exceeding 10% [ 51 52 53 54 DNA methylation analysis of CTSW The relationship between CTSW expression and DNA methylation was assessed using Spearman correlation. Boxplots were used to visualize CTSW expression in cancer and normal tissues. The relationships between promoter and gene body methylation with CTSW transcription were also analyzed. Statistical analysis Data analysis was conducted using R software (v4.4.1). Correlation between variables was assessed using Pearson’s correlation coefficient for normally distributed data or Spearman’s rank correlation coefficient for non-normally distributed data. Two-tailed t-tests were used to compare two groups when the data were normally distributed. One-way analysis of variance (ANOVA) was used to compare more than two groups when the data were normally distributed; otherwise, the Kruskal-Wallis test was applied for non-normally distributed data. Categorical variables were analyzed using the chi-squared test. The criteria for statistical significance were defined as follows: * P P P P Results The overview of the study design In this study, cysteine-related genes were obtained from the GeneCards database and intersected with DEGs identified through differential expression analysis of the TCGA-BRCA dataset to generate candidate genes. These genes were then analyzed using both univariate and multivariate Cox regression to identify key genes. CTSW was found to be significantly associated with survival through single-gene survival analysis, which was further validated using RNA-seq and DNA microarray data from relevant platforms. We then performed SMR and TSMR analyses of CTSW using eQTL data from GTEx (blood and breast tissue), eQTLGen (blood), and breast cancer GWAS data to investigate its potential causal relationship with breast cancer. Subsequently, we categorized the TCGA-BRCA cancer samples based on high and low CTSW expression and conducted functional enrichment analyses, immune infiltration assessments, immune response evaluations, and drug sensitivity analyses. We also examined the correlations between CTSW and immune checkpoints as well as immune cells, and constructed a protein-protein interaction network for further functional enrichment analysis. Expression differences of CTSW between normal and cancerous tissues, as well as across various breast cancer subtypes, were analyzed using the TCGA-BRCA dataset. In single-cell analysis, we evaluated CTSW expression in normal and cancer groups as well as across different breast cancer subtypes, performing cell clustering, molecular marker identification, and quantification of annotated cell types. Deconvolution algorithms were applied to investigate survival and expression differences between high and low CTSW expression groups, and to assess their correlation with CTSW transcriptional levels. Furthermore, we explored the methylation status of CTSW through SMR and MR analyses of mQTL-GWAS data, examining the correlation between methylation and RNA expression, and comparing methylation levels between normal and cancer tissues. The overall study design is illustrated in Fig. 1  Fig. 1 Overview of the study design Screening of key cysteine protease-related genes related to breast cancer prognosis A total of 182 cysteine protease-related genes were retrieved from the GeneCards database (Supplementary Table S2 2 2 2 To assess the causal relationship between CTSW expression and breast cancer, SMR analysis was performed using eQTL data from three sources: two blood-derived datasets and normal breast tissue datasets. While CTSW HR values were consistently less than 1 across all datasets, HEIDI tests indicated the potential for pleiotropy (Fig. 2 S3 2 Colocalization analysis excluded linkage disequilibrium as a confounding factor, showing a high posterior probability (PP.H4 > 0.80) for shared causal variants between CTSW expression and breast cancer across all tissue sources. Collectively, these results provide strong evidence that reduced CTSW expression is associated with increased breast cancer risk and poorer prognosis. Further analysis of the single-cell dataset GSE240112  Fig. 2 Identification of key cysteine protease-related genes in breast cancer prognosis. (A) (B) (C-D) (E) (F) Further investigation of CTSW expression across the SCMOD2 molecular subtypes of breast cancer revealed a decreasing trend from Basal-like to HER2-E, Luminal A, and Luminal B subtypes in both RNA-seq and DNA microarray datasets (Fig. 3 3 GSE261774 3 3  Fig. 3 Expression and survival analysis of breast cancer subtypes. (A) (B) (C) (D-F) CTSW expression correlated with the immune microenvironment and drug therapy in breast cancer Functional enrichment analysis of DEGs between high- and low-CTSW expression groups revealed significant involvement in immune regulation and cell death pathways (Supplementary Fig. 6, Fig. 4 4 4 4 4 We investigated the correlation between CTSW and immune checkpoints, revealing that CTSW was statistically significant and positively correlated with the majority of immune checkpoints. Notably, over half of these correlations exceeded a coefficient of 0.5, with CD96 showing the most significant association and the highest correlation coefficient ( R 4 R 4 4  Fig. 4 CTSW expression influences immune landscape and therapeutic response in breast cancer. (A-B) (C) (D) (E) (F) (G) (H) (I) Revealing CTSW expression and immune cell patterns across breast cancer subtypes through single-cell analysis To further investigate cellular heterogeneity across the HR+, HER2+, and TNBC subtypes, we analyzed scRNA-seq data from the GSE261774 GSE176078 GSE261774 5 5 5 5 GSE176078 When visualizing the proportions of different breast cancer subtype cells, a similar pattern was observed in both datasets. In GSE261774 5 GSE176078 Deconvolution analysis combining scRNA-seq data from GSE261774 5 5 5 GSE176078 GSE261774  Fig. 5 Single Cell Analysis Reveals CTSW Expression Patterns and Immune Cell Pattern Analysis in Different Breast Cancer Subtypes. (A) (B) (C) (D) (E) GSE261774 (F) (G) (H) To gain a deeper understanding of the relationship between CTSW expression and CD8 + T cell subsets, we performed a more detailed subtyping of activated CD8 + T cells in the GSE261774 GSE176078 6 Through gene expression analysis of these three subtypes, we found that CTSW expression levels were significantly higher in memory effector CD8 + T cells compared to the other two subtypes (Fig. 6 6 To validate whether the elevated CTSW expression in TNBC is solely attributable to the increased abundance of effector memory CD8 + T cells, we specifically analyzed CTSW expression levels in effector memory CD8 + T cells across the three breast cancer subtypes. The results showed that even within the same effector memory CD8 + T cell subpopulation, CTSW expression in TNBC was significantly higher than in HER2 + and HR + subtypes (Fig. 6 By integrating scRNA-seq data from GSE261774 6 6 r 6 Notably, when we repeated the same analysis workflow in the GSE176078  Fig. 6 Analysis of CTSW expression characteristics in CD8 + T cell subtypes in the GSE261774 A) (B) (C) (D) (E) (F) (G) Investigating the impact of CTSW DNA methylation levels on breast cancer progression To investigate the relationship between CTSW DNA methylation and breast cancer, we performed SMR and TSMR analyses using mQTL and GWAS data. Both SMR and five TSMR models (including IVW, MR-Egger, etc.) consistently showed odds ratios significantly greater than 1, with 95% confidence intervals above 1, indicating a robust association between CTSW methylation and breast cancer (Fig. 7 7 7 R R 7  Fig. 7 Exploring the effect of DNA methylation levels in CTSW on breast cancer. (A) (B) (C) (D-E) Discussion This study systematically investigated the role of CTSW, a key cysteine protease-related gene, in breast cancer through a comprehensive multi-omics approach. Our findings establish CTSW as a critical regulator of breast cancer progression, with a nuanced expression pattern that profoundly influences the TME. We demonstrate that CTSW serves as a robust prognostic biomarker and holds potential as a therapeutic target, particularly in immunologically active breast cancer subtypes. Our analyses revealed a complex, two-tiered expression pattern for CTSW. At the tissue level, CTSW expression is significantly downregulated in breast cancer compared to adjacent normal tissues, as confirmed by both bulk and scRNA-seq data. This observation, consistent with reports of CTSW downregulation in other malignancies [ 55 57 This apparent contradiction is reconciled by considering the unique immunological landscape of TNBC. TNBC tumors, despite their aggressiveness, are recognized as the most immunogenic among breast cancer subtypes, often described as “immunologically hot” and characterized by high levels of TILs [ 58 59 60 61 62 63 64 To further elucidate the mechanism underlying CTSW’s prognostic value and to validate its specificity, we performed in-depth single-cell analyses. These analyses confirmed that CTSW is predominantly expressed in activated CD8 + T cells, with the proportion of these cells being highest in TNBC compared to HR + and HER2 + subtypes. Furthermore, our analysis revealed that the increased expression of CTSW in TNBC is not only attributed to the increased number of TILs but also specifically associated with elevated CTSW levels in CD8 + T cells within TNBC. Our deeper investigation into CD8 + T cell heterogeneity revealed that CTSW expression is particularly enriched in the effector memory CD8 + T cell subset compared to effector exhaustion and pre-emptive CD8 + T cell populations. This finding refines our understanding of CTSW’s cellular localization and suggests that effector memory CD8 + T cells, which are crucial for sustained anti-tumor immunity, may be the primary functional carriers of CTSW. Importantly, when examining the distribution of CD8 + T cell subsets across breast cancer subtypes, we observed that while effector memory CD8 + T cells dominate in all subtypes, their proportion is significantly elevated in TNBC. Even more revealing, when we specifically analyzed CTSW expression within the effector memory CD8 + T cell population, expression levels remained significantly higher in TNBC compared to HER2 + and HR + subtypes. This dual observation—higher proportion of effector memory CD8 + T cells and higher per-cell CTSW expression in these cells—demonstrates that CTSW is not merely a surrogate for TIL abundance, but rather a marker of the heightened functional state or superior activation of cytotoxic memory T cells within the TNBC microenvironment. The stronger correlation observed between CTSW expression and effector memory CD8 + T cells ( r r This is further supported by our functional enrichment analysis, which links CTSW to T cell activation pathways, thereby reinforcing the mechanistic connection between high CTSW expression, effective cytotoxic responses, and improved patient survival. Our deconvolution analyses consistently demonstrated that patients with higher levels of CTSW-enriched effector memory CD8 + T cells experienced better clinical outcomes, highlighting the potential clinical utility of CTSW not only as a prognostic marker but also as an indicator of functional anti-tumor immunity mediated specifically by memory T cell populations. A critical question arising from our findings is whether the observed association between CTSW expression and breast cancer progression is causal. To address this and mitigate potential confounding factors inherent in observational studies, we employed Mendelian randomization (MR). Our SMR and TSMR analyses provided genetic evidence supporting a protective causal relationship, suggesting that higher genetically predicted CTSW expression is associated with a reduced risk of breast cancer. This genetic inference strengthens the hypothesis that CTSW downregulation is not merely a consequence of tumor progression but may be an active contributor to it. However, we acknowledge that this statistical inference relies on key assumptions and cannot fully rule out complex biological scenarios, such as pleiotropy or reverse regulation mediated by the tumor environment itself. A notable observation was the positive correlation between CTSW expression and immune checkpoint molecules such as PD-1, CTLA-4, and particularly CD96. While this association could be interpreted as indicative of immune suppression, we propose that it reflects a “hot” but regulated immune environment. Sustained T cell activation in response to tumor antigens naturally induces the upregulation of checkpoint molecules as a negative feedback mechanism to prevent excessive immunopathology. Therefore, the co-expression of high CTSW and checkpoint markers likely identifies a tumor ecosystem that is primed for immunotherapy. Particularly, given our finding that CTSW is enriched in effector memory CD8 + T cells, which are known for their enhanced cytotoxic potential and persistence, the co-expression pattern may indicate a reservoir of experienced T cells that can be rapidly mobilized upon checkpoint inhibition. Patients with a high-CTSW/high-checkpoint profile possess a robust cytotoxic T cell compartment that is restrained by inhibitory signals. This poised state suggests that such patients may derive particular benefit from ICIs therapy, as blockade could unleash a pre-existing, potent anti-tumor response. The broader quest for reliable biomarkers in breast cancer, extending from diagnostic signatures to predictive markers for therapeutic response, underscores the significance of identifying molecules like CTSW that can stratify patients and guide treatment strategies [ 65 Finally, our DNA methylation analysis provides a potential explanation for the downregulation of CTSW in cancer cells. We observed a significant inverse correlation between CTSW promoter and gene body methylation and its mRNA expression, with higher methylation levels in cancer tissues. This suggests that epigenetic silencing via DNA methylation is a key mechanism repressing CTSW’s protective functions in breast cancer, highlighting a potential avenue for therapeutic intervention through epigenetic modulation. Understanding the epigenetic regulation of CTSW, particularly in the context of effector memory CD8 + T cell function in the TNBC microenvironment, may provide insights into novel therapeutic strategies aimed at enhancing anti-tumor immunity in breast cancer patients. Study limitations While this study provides a comprehensive, multi-omics view of CTSW’s role in breast cancer, we must acknowledge several important limitations. The foremost and most significant limitation is the absence of direct experimental validation for the proposed functions of CTSW in CD8 + T cells. Our research is, by design, an in silico study. While our comprehensive computational analyses—spanning transcriptomics, single-cell resolution, and Mendelian randomization—provide a strong, multi-faceted line of evidence, the definitive causal link between CTSW expression and the modulation of T-cell cytotoxicity, cytokine production, and activation status requires rigorous validation. Therefore, the mechanistic conclusions drawn from our findings should be interpreted as a well-substantiated but still hypothetical framework that urgently warrants confirmation through future in vitro and in vivo experiments, such as those involving genetic manipulation (e.g., CRISPR-Cas9 knockout or overexpression) in primary human T cells or appropriate animal models. Secondly, our study relies on publicly available, retrospective datasets. While this allows for powerful large-scale analysis, it carries inherent limitations, including potential heterogeneity in sample processing, incomplete clinical data, and the inability to control for all potential confounding variables. The associations observed, though statistically robust, should be prospectively validated in well-annotated, independent patient cohorts. Finally, regarding the fundamental question of causality—whether CTSW downregulation is a cause or a consequence of tumor progression—our study has specific limitations. While our Mendelian randomization analysis offers strong genetic support for a protective causal role of CTSW, this statistical method has inherent constraints. Crucially, while MR is designed to mitigate reverse causation, it cannot entirely exclude the possibility of complex biological feedback loops where the established tumor burden or its evolving microenvironment, in turn, influences CTSW expression through pathways not captured by the genetic instruments. Furthermore, the validity of MR hinges on key assumptions, particularly the absence of horizontal pleiotropy, which cannot be definitively proven with summary-level data. Therefore, the causal link suggested by our MR analysis, while compelling, must be considered preliminary and requires ultimate validation through direct functional experiments that can dissect these potential bidirectional relationships. Conclusions In conclusion, our multi-omics study elucidates the dual role of CTSW in breast cancer. CTSW functions as a powerful prognostic biomarker, with high expression—particularly in TNBC—signaling a favorable, immune-active TME and improved patient outcomes. Mechanistically, CTSW’s value extends beyond serving as a surrogate for TIL abundance; it is a specific indicator of the heightened functional state of activated CD8 + T cells. While its expression in cancer cells is epigenetically suppressed, its role in the TME positions CTSW as a promising biomarker for patient stratification and a potential target for novel immunotherapeutic strategies. Supplementary Information Below is the link to the electronic supplementary material.  Supplementary Material 1  Supplementary Material 2  Supplementary Material 3 Abbreviations ER Estrogen Receptor HER2 Human Epidermal Growth Factor Receptor 2 HR+ Hormone Receptor Positive TNBC Triple Negative Breast Cancer GSDMD Gasdermin D QTL Quantitative Trait Locus GWAS Genome-Wide Association Studies TCGA-BRCA The Cancer Genome Atlas Breast Invasive Carcinoma scRNA-seq Single-Cell RNA Sequencing DEGs Differentially Expressed Genes SMR Summary-Data-Based Mendelian Randomization TSMR Two-Sample Mendelian Randomization HEIDI Heterogeneity in Dependent Instruments IVW Inverse Variance Weighting GO Gene Ontology KEGG Kyoto Encyclopedia of Genes and Genomes TICs Tumor-Infiltrating Immune Cells ICIs Immune Checkpoint Inhibitors IC50 Half-Maximal Inhibitory Concentration PPI Protein-Protein Interaction SCMOD2 Subtype Classifier for Molecular Oncology Database 2 UMAP Uniform Manifold Approximation and Projection HR Hazard Ratio TME Tumor Microenvironment PD-1 Programmed Cell Death 1 CTLA-4 Cytotoxic T-Lymphocyte-Associated Protein 4 PCs Principal Components CTLs Cytotoxic T Lymphocytes Publisher’s note Springer Nature remains neutral with regard to jurisdictional claims in published maps and institutional affiliations. Xvliang Liu, Zeli Yin, Pengju Xi have contributed equally to this work. Acknowledgements Not applicable. Author contributions X-LL was the primary contributor to this manuscript，and in charge of methodology and visualization. Z-LY handled conceptualization, data management, and formal analysis. P-JX took care of the software aspect. L-MW and J-KM developed the review process and wrote and approved the final manuscript. All authors reviewed and approved the final version. Funding This work was supported by the National Natural Science Foundation of China [81972749]; the Science and Technology Project of Liaoning [2021JH2/10300020]; Liaoning Province Talent Plan project [YXMJ-JC-04]; Innovative Teams Project in Key Areas of Dalian [2021RT01]; United Foundation for Dalian Institute of Chemical Physics, Chinese Academy of Sciences and the Second Hospital of Dalian Medical University [DMU-2&DICP UN202301]. The funders had no role in the study design, data collection, analysis, interpretation, or the decision to submit the manuscript for publication. Data availability Breast cancer transcriptome and DNA methylation data are available from the repository from The Cancer Genome Atlas (TCGA, [https://www.cancer.gov/ccg/research/genome-sequencing/tcga/](https:/www.cancer.gov/ccg/research/genome-sequencing/tcga) ). EQTL data are available from the eQTLGen consortium ( [https://www.eqtlgen.org/](https:/www.eqtlgen.org) ) and GTEx consortium (Version 8, [https://gtexportal.org/](https:/gtexportal.org) ). MQTL are available online at “https://yanglab.westlake.edu.cn/software/smr/”. Breast cancer GWAS Statistical Abstracts are available from the IEU GWAS Database ( [https://gwas.mrcieu.ac.uk/](https:/gwas.mrcieu.ac.uk) ) repository (accession number: ieu-a-1126). ScRNA-seq data were obtained from the Gene Expression Omnibus database (GEO, [https://www.ncbi.nlm.nih.gov/geo/](https:/www.ncbi.nlm.nih.gov/geo) ) repository (accession numbers GSE240112 GSE176078 GSE261774 Declarations Ethics approval and consent to participate Not applicable. Consent for publication Not applicable. Competing interests The authors declare no competing interests. References 1. Coles CE Earl H Anderson BO Barrios CH Bienz M Bliss JM The lancet breast cancer commission Lancet 2024 403 1895 950 10.1016/S0140-6736(24)00747-5 38636533 Coles CE, Earl H, Anderson BO, Barrios CH, Bienz M, Bliss JM, et al. The lancet breast cancer commission. Lancet. 2024;403:1895–950. 10.1016/S0140-6736(24)00747-5. 38636533 10.1016/S0140-6736(24)00747-5 2. Hyman DM Taylor BS Baselga J Implementing Genome-Driven oncology Cell 2017 168 584 99 10.1016/j.cell.2016.12.015 28187282 PMC5463457 Hyman DM, Taylor BS, Baselga J. Implementing Genome-Driven oncology. Cell. 2017;168:584–99. 10.1016/j.cell.2016.12.015. 28187282 10.1016/j.cell.2016.12.015 PMC5463457 3. Perou CM Sørlie T Eisen MB van de Rijn M Jeffrey SS Rees CA Molecular portraits of human breast tumours Nature 2000 406 747 52 10.1038/35021093 10963602 Perou CM, Sørlie T, Eisen MB, van de Rijn M, Jeffrey SS, Rees CA, et al. Molecular portraits of human breast tumours. Nature. 2000;406:747–52. 10.1038/35021093. 10963602 10.1038/35021093 4. Denkert C Liedtke C Tutt A von Minckwitz G Molecular alterations in triple-negative breast cancer-the road to new treatment strategies Lancet 2017 389 2430 42 10.1016/S0140-6736(16)32454-0 27939063 Denkert C, Liedtke C, Tutt A, von Minckwitz G. Molecular alterations in triple-negative breast cancer-the road to new treatment strategies. Lancet. 2017;389:2430–42. 10.1016/S0140-6736(16)32454-0. 27939063 10.1016/S0140-6736(16)32454-0 5. Donisi C Pretta A Pusceddu V Ziranu P Lai E Puzzoni M Immunotherapy and cancer: the Multi-Omics perspective Int J Mol Sci 2024 25 3563 10.3390/ijms25063563 38542536 PMC10971308 Donisi C, Pretta A, Pusceddu V, Ziranu P, Lai E, Puzzoni M, et al. Immunotherapy and cancer: the Multi-Omics perspective. Int J Mol Sci. 2024;25:3563. 10.3390/ijms25063563. 38542536 10.3390/ijms25063563 PMC10971308 6. Liu Z Zhao Y Kong P Liu Y Huang J Xu E Integrated multi-omics profiling yields a clinically relevant molecular classification for esophageal squamous cell carcinoma Cancer Cell 2023 41 181 e1959 10.1016/j.ccell.2022.12.004 36584672 Liu Z, Zhao Y, Kong P, Liu Y, Huang J, Xu E, et al. Integrated multi-omics profiling yields a clinically relevant molecular classification for esophageal squamous cell carcinoma. Cancer Cell. 2023;41:181–e1959. 10.1016/j.ccell.2022.12.004. 36584672 10.1016/j.ccell.2022.12.004 7. Park YH Im S-A Park K Wen J Lee K-H Choi Y-L Longitudinal multi-omics study of Palbociclib resistance in HR-positive/HER2-negative metastatic breast cancer Genome Med 2023 15 55 10.1186/s13073-023-01201-7 37475004 PMC10360358 Park YH, Im S-A, Park K, Wen J, Lee K-H, Choi Y-L, et al. Longitudinal multi-omics study of Palbociclib resistance in HR-positive/HER2-negative metastatic breast cancer. Genome Med. 2023;15:55. 10.1186/s13073-023-01201-7. 37475004 10.1186/s13073-023-01201-7 PMC10360358 8. O’Leary B Finn RS Turner NC Treating cancer with selective CDK4/6 inhibitors Nat Rev Clin Oncol 2016 13 417 30 10.1038/nrclinonc.2016.26 27030077 O’Leary B, Finn RS, Turner NC. Treating cancer with selective CDK4/6 inhibitors. Nat Rev Clin Oncol. 2016;13:417–30. 10.1038/nrclinonc.2016.26. 27030077 10.1038/nrclinonc.2016.26 9. Kesavardhana S Malireddi RKS Kanneganti T-D Caspases in cell death, inflammation, and pyroptosis Annu Rev Immunol 2020 38 567 95 10.1146/annurev-immunol-073119-095439 32017655 PMC7190443 Kesavardhana S, Malireddi RKS, Kanneganti T-D. Caspases in cell death, inflammation, and pyroptosis. Annu Rev Immunol. 2020;38:567–95. 10.1146/annurev-immunol-073119-095439. 32017655 10.1146/annurev-immunol-073119-095439 PMC7190443 10. Yuan J Ofengeim D A guide to cell death pathways Nat Rev Mol Cell Biol 2024 25 379 95 10.1038/s41580-023-00689-6 38110635 Yuan J, Ofengeim D. A guide to cell death pathways. Nat Rev Mol Cell Biol. 2024;25:379–95. 10.1038/s41580-023-00689-6. 38110635 10.1038/s41580-023-00689-6 11. Galluzzi L Vitale I Aaronson SA Abrams JM Adam D Agostinis P Molecular mechanisms of cell death: recommendations of the nomenclature committee on cell death 2018 Cell Death Differ 2018 25 486 541 10.1038/s41418-017-0012-4 29362479 PMC5864239 Galluzzi L, Vitale I, Aaronson SA, Abrams JM, Adam D, Agostinis P, et al. Molecular mechanisms of cell death: recommendations of the nomenclature committee on cell death 2018. Cell Death Differ. 2018;25:486–541. 10.1038/s41418-017-0012-4. 29362479 10.1038/s41418-017-0012-4 PMC5864239 12. Newton K Wickliffe KE Dugger DL Maltzman A Roose-Girma M Dohse M Cleavage of RIPK1 by caspase-8 is crucial for limiting apoptosis and necroptosis Nature 2019 574 428 31 10.1038/s41586-019-1548-x 31511692 Newton K, Wickliffe KE, Dugger DL, Maltzman A, Roose-Girma M, Dohse M, et al. Cleavage of RIPK1 by caspase-8 is crucial for limiting apoptosis and necroptosis. Nature. 2019;574:428–31. 10.1038/s41586-019-1548-x. 31511692 10.1038/s41586-019-1548-x 13. Vanden Berghe T Linkermann A Jouan-Lanhouet S Walczak H Vandenabeele P Regulated necrosis: the expanding network of non-apoptotic cell death pathways Nat Rev Mol Cell Biol 2014 15 135 47 10.1038/nrm3737 24452471 Vanden Berghe T, Linkermann A, Jouan-Lanhouet S, Walczak H, Vandenabeele P. Regulated necrosis: the expanding network of non-apoptotic cell death pathways. Nat Rev Mol Cell Biol. 2014;15:135–47. 10.1038/nrm3737. 24452471 10.1038/nrm3737 14. Chu H Hou Y Yang D Wen L Shuai H Yoon C Coronaviruses exploit a host cysteine-aspartic protease for replication Nature 2022 609 785 92 10.1038/s41586-022-05148-4 35922005 Chu H, Hou Y, Yang D, Wen L, Shuai H, Yoon C, et al. Coronaviruses exploit a host cysteine-aspartic protease for replication. Nature. 2022;609:785–92. 10.1038/s41586-022-05148-4. 35922005 10.1038/s41586-022-05148-4 15. Samir P Kesavardhana S Patmore DM Gingras S Malireddi RKS Karki R DDX3X acts as a live-or-die checkpoint in stressed cells by regulating NLRP3 inflammasome Nature 2019 573 590 4 10.1038/s41586-019-1551-2 31511697 PMC6980284 Samir P, Kesavardhana S, Patmore DM, Gingras S, Malireddi RKS, Karki R, et al. DDX3X acts as a live-or-die checkpoint in stressed cells by regulating NLRP3 inflammasome. Nature. 2019;573:590–4. 10.1038/s41586-019-1551-2. 31511697 10.1038/s41586-019-1551-2 PMC6980284 16. Nagata S Apoptosis by death factor Cell 1997 88 355 65 10.1016/s0092-8674(00)81874-7 9039262 Nagata S. Apoptosis by death factor. Cell. 1997;88:355–65. 10.1016/s0092-8674(00)81874-7. 9039262 10.1016/s0092-8674(00)81874-7 17. McIlwain DR Berger T Mak TW Caspase functions in cell death and disease Cold Spring Harb Perspect Biol 2013 5 a008656 10.1101/cshperspect.a008656 23545416 PMC3683896 McIlwain DR, Berger T, Mak TW. Caspase functions in cell death and disease. Cold Spring Harb Perspect Biol. 2013;5:a008656. 10.1101/cshperspect.a008656. 23545416 10.1101/cshperspect.a008656 PMC3683896 18. Wei X Xie F Zhou X Wu Y Yan H Liu T Role of pyroptosis in inflammation and cancer Cell Mol Immunol 2022 19 971 92 10.1038/s41423-022-00905-x 35970871 PMC9376585 Wei X, Xie F, Zhou X, Wu Y, Yan H, Liu T, et al. Role of pyroptosis in inflammation and cancer. Cell Mol Immunol. 2022;19:971–92. 10.1038/s41423-022-00905-x. 35970871 10.1038/s41423-022-00905-x PMC9376585 19. Shen Y White E p53-dependent apoptosis pathways Adv Cancer Res 2001 82 55 84 10.1016/s0065-230x(01)82002-9 11447765 Shen Y, White E. p53-dependent apoptosis pathways. Adv Cancer Res. 2001;82:55–84. 10.1016/s0065-230x(01)82002-9. 11447765 10.1016/s0065-230x(01)82002-9 20. Eskandari E Eaves CJ Paradoxical roles of caspase-3 in regulating cell survival, proliferation, and tumorigenesis J Cell Biol 2022 221 e202201159 10.1083/jcb.202201159 35551578 PMC9106709 Eskandari E, Eaves CJ. Paradoxical roles of caspase-3 in regulating cell survival, proliferation, and tumorigenesis. J Cell Biol. 2022;221:e202201159. 10.1083/jcb.202201159. 35551578 10.1083/jcb.202201159 PMC9106709 21. Zhang Z Zhang H Li D Zhou X Qin Q Zhang Q Caspase-3-mediated GSDME induced pyroptosis in breast cancer cells through the ROS/JNK signalling pathway J Cell Mol Med 2021 25 8159 68 10.1111/jcmm.16574 34369076 PMC8419174 Zhang Z, Zhang H, Li D, Zhou X, Qin Q, Zhang Q. Caspase-3-mediated GSDME induced pyroptosis in breast cancer cells through the ROS/JNK signalling pathway. J Cell Mol Med. 2021;25:8159–68. 10.1111/jcmm.16574. 34369076 10.1111/jcmm.16574 PMC8419174 22. Moro N Mauch C Zigrino P Metalloproteinases in melanoma Eur J Cell Biol 2014 93 23 9 10.1016/j.ejcb.2014.01.002 24530009 Moro N, Mauch C, Zigrino P. Metalloproteinases in melanoma. Eur J Cell Biol. 2014;93:23–9. 10.1016/j.ejcb.2014.01.002. 24530009 10.1016/j.ejcb.2014.01.002 23. Nakamura Y Sato K Wakimoto N Kimura F Okuyama A Motoyoshi K A new matrix metalloproteinase inhibitor SI-27 induces apoptosis in several human myeloid leukemia cell lines and enhances sensitivity to TNF alpha-induced apoptosis Leukemia 2001 15 1217 24 10.1038/sj.leu.2402187 11480563 Nakamura Y, Sato K, Wakimoto N, Kimura F, Okuyama A, Motoyoshi K. A new matrix metalloproteinase inhibitor SI-27 induces apoptosis in several human myeloid leukemia cell lines and enhances sensitivity to TNF alpha-induced apoptosis. Leukemia. 2001;15:1217–24. 10.1038/sj.leu.2402187. 11480563 10.1038/sj.leu.2402187 24. Gurung P Anand PK Malireddi RKS Vande Walle L Van Opdenbosch N Dillon CP FADD and caspase-8 mediate priming and activation of the canonical and noncanonical Nlrp3 inflammasomes J Immunol 2014 192 1835 46 10.4049/jimmunol.1302839 24453255 PMC3933570 Gurung P, Anand PK, Malireddi RKS, Vande Walle L, Van Opdenbosch N, Dillon CP, et al. FADD and caspase-8 mediate priming and activation of the canonical and noncanonical Nlrp3 inflammasomes. J Immunol. 2014;192:1835–46. 10.4049/jimmunol.1302839. 24453255 10.4049/jimmunol.1302839 PMC3933570 25. Mascarenhas DPA Cerqueira DM Pereira MSF Castanheira FVS Fernandes TD Manin GZ Inhibition of caspase-1 or gasdermin-D enable caspase-8 activation in the Naip5/NLRC4/ASC inflammasome PLoS Pathog 2017 13 e1006502 10.1371/journal.ppat.1006502 28771586 PMC5542441 Mascarenhas DPA, Cerqueira DM, Pereira MSF, Castanheira FVS, Fernandes TD, Manin GZ, et al. Inhibition of caspase-1 or gasdermin-D enable caspase-8 activation in the Naip5/NLRC4/ASC inflammasome. PLoS Pathog. 2017;13:e1006502. 10.1371/journal.ppat.1006502. 28771586 10.1371/journal.ppat.1006502 PMC5542441 26. Pierini R Juruj C Perret M Jones CL Mangeot P Weiss DS AIM2/ASC triggers caspase-8-dependent apoptosis in Francisella-infected caspase-1-deficient macrophages Cell Death Differ 2012 19 1709 21 10.1038/cdd.2012.51 22555457 PMC3438500 Pierini R, Juruj C, Perret M, Jones CL, Mangeot P, Weiss DS, et al. AIM2/ASC triggers caspase-8-dependent apoptosis in Francisella-infected caspase-1-deficient macrophages. Cell Death Differ. 2012;19:1709–21. 10.1038/cdd.2012.51. 22555457 10.1038/cdd.2012.51 PMC3438500 27. Van Opdenbosch N Van Gorp H Verdonckt M Saavedra PHV de Vasconcelos NM Gonçalves A Caspase-1 engagement and TLR-Induced c-FLIP expression suppress ASC/Caspase-8-Dependent apoptosis by inflammasome sensors NLRP1b and NLRC4 Cell Rep 2017 21 3427 44 10.1016/j.celrep.2017.11.088 29262324 PMC5746600 Van Opdenbosch N, Van Gorp H, Verdonckt M, Saavedra PHV, de Vasconcelos NM, Gonçalves A, et al. Caspase-1 engagement and TLR-Induced c-FLIP expression suppress ASC/Caspase-8-Dependent apoptosis by inflammasome sensors NLRP1b and NLRC4. Cell Rep. 2017;21:3427–44. 10.1016/j.celrep.2017.11.088. 29262324 10.1016/j.celrep.2017.11.088 PMC5746600 28. Orning P Weng D Starheim K Ratner D Best Z Lee B Pathogen Blockade of TAK1 triggers caspase-8-dependent cleavage of gasdermin D and cell death Science 2018 362 1064 9 10.1126/science.aau2818 30361383 PMC6522129 Orning P, Weng D, Starheim K, Ratner D, Best Z, Lee B, et al. Pathogen Blockade of TAK1 triggers caspase-8-dependent cleavage of gasdermin D and cell death. Science. 2018;362:1064–9. 10.1126/science.aau2818. 30361383 10.1126/science.aau2818 PMC6522129 29. Sarhan J Liu BC Muendlein HI Li P Nilson R Tang AY Caspase-8 induces cleavage of gasdermin D to elicit pyroptosis during yersinia infection Proc Natl Acad Sci U S A 2018 115 E10888 97 10.1073/pnas.1809548115 30381458 PMC6243247 Sarhan J, Liu BC, Muendlein HI, Li P, Nilson R, Tang AY, et al. Caspase-8 induces cleavage of gasdermin D to elicit pyroptosis during yersinia infection. Proc Natl Acad Sci U S A. 2018;115:E10888–97. 10.1073/pnas.1809548115. 30381458 10.1073/pnas.1809548115 PMC6243247 30. Rogers C Fernandes-Alnemri T Mayes L Alnemri D Cingolani G Alnemri ES Cleavage of DFNA5 by caspase-3 during apoptosis mediates progression to secondary necrotic/pyroptotic cell death Nat Commun 2017 8 14128 10.1038/ncomms14128 28045099 PMC5216131 Rogers C, Fernandes-Alnemri T, Mayes L, Alnemri D, Cingolani G, Alnemri ES. Cleavage of DFNA5 by caspase-3 during apoptosis mediates progression to secondary necrotic/pyroptotic cell death. Nat Commun. 2017;8:14128. 10.1038/ncomms14128. 28045099 10.1038/ncomms14128 PMC5216131 31. Wang Y Gao W Shi X Ding J Liu W He H Chemotherapy drugs induce pyroptosis through caspase-3 cleavage of a gasdermin Nature 2017 547 99 103 10.1038/nature22393 28459430 Wang Y, Gao W, Shi X, Ding J, Liu W, He H, et al. Chemotherapy drugs induce pyroptosis through caspase-3 cleavage of a gasdermin. Nature. 2017;547:99–103. 10.1038/nature22393. 28459430 10.1038/nature22393 32. Taabazuing CY Okondo MC Bachovchin DA Pyroptosis and apoptosis pathways engage in bidirectional crosstalk in monocytes and macrophages Cell Chem Biol 2017 24 507 e5144 10.1016/j.chembiol.2017.03.009 28392147 PMC5467448 Taabazuing CY, Okondo MC, Bachovchin DA. Pyroptosis and apoptosis pathways engage in bidirectional crosstalk in monocytes and macrophages. Cell Chem Biol. 2017;24:507–e5144. 10.1016/j.chembiol.2017.03.009. 28392147 10.1016/j.chembiol.2017.03.009 PMC5467448 33. Hutter C Zenklusen JC The cancer genome atlas: creating lasting value beyond its data Cell 2018 173 283 5 10.1016/j.cell.2018.03.042 29625045 Hutter C, Zenklusen JC. The cancer genome atlas: creating lasting value beyond its data. Cell. 2018;173:283–5. 10.1016/j.cell.2018.03.042. 29625045 10.1016/j.cell.2018.03.042 34. Võsa U Claringbould A Westra H-J Bonder MJ Deelen P Zeng B Large-scale cis- and trans-eQTL analyses identify thousands of genetic loci and polygenic scores that regulate blood gene expression Nat Genet 2021 53 1300 10 10.1038/s41588-021-00913-z 34475573 PMC8432599 Võsa U, Claringbould A, Westra H-J, Bonder MJ, Deelen P, Zeng B, et al. Large-scale cis- and trans-eQTL analyses identify thousands of genetic loci and polygenic scores that regulate blood gene expression. Nat Genet. 2021;53:1300–10. 10.1038/s41588-021-00913-z. 34475573 10.1038/s41588-021-00913-z PMC8432599 35. GTEx Consortium The GTEx consortium atlas of genetic regulatory effects across human tissues Science 2020 369 1318 30 10.1126/science.aaz1776 32913098 PMC7737656 GTEx Consortium. The GTEx consortium atlas of genetic regulatory effects across human tissues. Science. 2020;369:1318–30. 10.1126/science.aaz1776. 32913098 10.1126/science.aaz1776 PMC7737656 36. McRae AF Marioni RE Shah S Yang J Powell JE Harris SE Identification of 55,000 replicated DNA methylation QTL Sci Rep 2018 8 17605 10.1038/s41598-018-35871-w 30514905 PMC6279736 McRae AF, Marioni RE, Shah S, Yang J, Powell JE, Harris SE, et al. Identification of 55,000 replicated DNA methylation QTL. Sci Rep. 2018;8:17605. 10.1038/s41598-018-35871-w. 30514905 10.1038/s41598-018-35871-w PMC6279736 37. Michailidou K Lindström S Dennis J Beesley J Hui S Kar S Association analysis identifies 65 new breast cancer risk loci Nature 2017 551 92 4 10.1038/nature24284 29059683 PMC5798588 Michailidou K, Lindström S, Dennis J, Beesley J, Hui S, Kar S, et al. Association analysis identifies 65 new breast cancer risk loci. Nature. 2017;551:92–4. 10.1038/nature24284. 29059683 10.1038/nature24284 PMC5798588 38. Barrett T Wilhite SE Ledoux P Evangelista C Kim IF Tomashevsky M NCBI GEO: archive for functional genomics data sets–update Nucleic Acids Res 2013 41 991 5 10.1093/nar/gks1193 PMC3531084 23193258 Barrett T, Wilhite SE, Ledoux P, Evangelista C, Kim IF, Tomashevsky M, et al. NCBI GEO: archive for functional genomics data sets–update. Nucleic Acids Res. 2013;41:991–5. 10.1093/nar/gks1193. Database issue:D. 10.1093/nar/gks1193 PMC3531084 23193258 39. Jézéquel P Campone M Gouraud W Guérin-Charbonnel C Leux C Ricolleau G bc-GenExMiner: an easy-to-use online platform for gene prognostic analyses in breast cancer Breast Cancer Res Treat 2012 131 765 75 10.1007/s10549-011-1457-7 21452023 Jézéquel P, Campone M, Gouraud W, Guérin-Charbonnel C, Leux C, Ricolleau G, et al. bc-GenExMiner: an easy-to-use online platform for gene prognostic analyses in breast cancer. Breast Cancer Res Treat. 2012;131:765–75. 10.1007/s10549-011-1457-7. 21452023 10.1007/s10549-011-1457-7 40. Cuschieri S The STROBE guidelines Saudi J Anaesth 2019 13 Suppl 1 S31 4 10.4103/sja.SJA_543_18 30930717 PMC6398292 Cuschieri S. The STROBE guidelines. Saudi J Anaesth. 2019;13(Suppl 1):S31–4. 10.4103/sja.SJA_543_18. 30930717 10.4103/sja.SJA_543_18 PMC6398292 41. Zhu Z Zhang F Hu H Bakshi A Robinson MR Powell JE Integration of summary data from GWAS and eQTL studies predicts complex trait gene targets Nat Genet 2016 48 481 7 10.1038/ng.3538 27019110 Zhu Z, Zhang F, Hu H, Bakshi A, Robinson MR, Powell JE, et al. Integration of summary data from GWAS and eQTL studies predicts complex trait gene targets. Nat Genet. 2016;48:481–7. 10.1038/ng.3538. 27019110 10.1038/ng.3538 42. Lin J Zhou J Xu Y Potential drug targets for multiple sclerosis identified through Mendelian randomization analysis Brain 2023 146 3364 72 10.1093/brain/awad070 36864689 PMC10393411 Lin J, Zhou J, Xu Y. Potential drug targets for multiple sclerosis identified through Mendelian randomization analysis. Brain. 2023;146:3364–72. 10.1093/brain/awad070. 36864689 10.1093/brain/awad070 PMC10393411 43. Bowden J Davey Smith G Burgess S Mendelian randomization with invalid instruments: effect Estimation and bias detection through Egger regression Int J Epidemiol 2015 44 512 25 10.1093/ije/dyv080 26050253 PMC4469799 Bowden J, Davey Smith G, Burgess S. Mendelian randomization with invalid instruments: effect Estimation and bias detection through Egger regression. Int J Epidemiol. 2015;44:512–25. 10.1093/ije/dyv080. 26050253 10.1093/ije/dyv080 PMC4469799 44. Arvanitis M Tayeb K Strober BJ Battle A Redefining tissue specificity of genetic regulation of gene expression in the presence of allelic heterogeneity Am J Hum Genet 2022 109 223 39 10.1016/j.ajhg.2022.01.002 35085493 PMC8874223 Arvanitis M, Tayeb K, Strober BJ, Battle A. Redefining tissue specificity of genetic regulation of gene expression in the presence of allelic heterogeneity. Am J Hum Genet. 2022;109:223–39. 10.1016/j.ajhg.2022.01.002. 35085493 10.1016/j.ajhg.2022.01.002 PMC8874223 45. Gene Ontology Consortium. Gene ontology consortium: going forward. Nucleic Acids Res. 2015;43. 10.1093/nar/gku1179. Database issue:D1049-1056. 10.1093/nar/gku1179 PMC4383973 25428369 46. Kanehisa M Sato Y Kawashima M Furumichi M Tanabe M KEGG as a reference resource for gene and protein annotation Nucleic Acids Res 2016 44 D457 462 10.1093/nar/gkv1070 26476454 PMC4702792 Kanehisa M, Sato Y, Kawashima M, Furumichi M, Tanabe M. KEGG as a reference resource for gene and protein annotation. Nucleic Acids Res. 2016;44:D457–462. 10.1093/nar/gkv1070. 26476454 10.1093/nar/gkv1070 PMC4702792 47. Newman AM Liu CL Green MR Gentles AJ Feng W Xu Y Robust enumeration of cell subsets from tissue expression profiles Nat Methods 2015 12 453 7 10.1038/nmeth.3337 25822800 PMC4739640 Newman AM, Liu CL, Green MR, Gentles AJ, Feng W, Xu Y, et al. Robust enumeration of cell subsets from tissue expression profiles. Nat Methods. 2015;12:453–7. 10.1038/nmeth.3337. 25822800 10.1038/nmeth.3337 PMC4739640 48. Kornepati AVR Vadlamudi RK Curiel TJ Programmed death ligand 1 signals in cancer cells Nat Rev Cancer 2022 22 174 89 10.1038/s41568-021-00431-4 35031777 PMC9989967 Kornepati AVR, Vadlamudi RK, Curiel TJ. Programmed death ligand 1 signals in cancer cells. Nat Rev Cancer. 2022;22:174–89. 10.1038/s41568-021-00431-4. 35031777 10.1038/s41568-021-00431-4 PMC9989967 49. Maeser D Gruener RF Huang RS OncoPredict: an R package for predicting in vivo or cancer patient drug response and biomarkers from cell line screening data Brief Bioinform 2021 22 bbab260 10.1093/bib/bbab260 34260682 PMC8574972 Maeser D, Gruener RF, Huang RS. OncoPredict: an R package for predicting in vivo or cancer patient drug response and biomarkers from cell line screening data. Brief Bioinform. 2021;22:bbab260. 10.1093/bib/bbab260. 34260682 10.1093/bib/bbab260 PMC8574972 50. Szklarczyk D Kirsch R Koutrouli M Nastou K Mehryary F Hachilif R The STRING database in 2023: protein-protein association networks and functional enrichment analyses for any sequenced genome of interest Nucleic Acids Res 2023 51 D638 46 10.1093/nar/gkac1000 36370105 PMC9825434 Szklarczyk D, Kirsch R, Koutrouli M, Nastou K, Mehryary F, Hachilif R, et al. The STRING database in 2023: protein-protein association networks and functional enrichment analyses for any sequenced genome of interest. Nucleic Acids Res. 2023;51:D638–46. 10.1093/nar/gkac1000. 36370105 10.1093/nar/gkac1000 PMC9825434 51. Macosko EZ Basu A Satija R Nemesh J Shekhar K Goldman M Highly parallel Genome-wide expression profiling of individual cells using nanoliter droplets Cell 2015 161 1202 14 10.1016/j.cell.2015.05.002 26000488 PMC4481139 Macosko EZ, Basu A, Satija R, Nemesh J, Shekhar K, Goldman M, et al. Highly parallel Genome-wide expression profiling of individual cells using nanoliter droplets. Cell. 2015;161:1202–14. 10.1016/j.cell.2015.05.002. 26000488 10.1016/j.cell.2015.05.002 PMC4481139 52. Korsunsky I Millard N Fan J Slowikowski K Zhang F Wei K Fast, sensitive and accurate integration of single-cell data with harmony Nat Methods 2019 16 1289 96 10.1038/s41592-019-0619-0 31740819 PMC6884693 Korsunsky I, Millard N, Fan J, Slowikowski K, Zhang F, Wei K, et al. Fast, sensitive and accurate integration of single-cell data with harmony. Nat Methods. 2019;16:1289–96. 10.1038/s41592-019-0619-0. 31740819 10.1038/s41592-019-0619-0 PMC6884693 53. Zhang X Lan Y Xu J Quan F Zhao E Deng C CellMarker: a manually curated resource of cell markers in human and mouse Nucleic Acids Res 2019 47 D721 8 10.1093/nar/gky900 30289549 PMC6323899 Zhang X, Lan Y, Xu J, Quan F, Zhao E, Deng C, et al. CellMarker: a manually curated resource of cell markers in human and mouse. Nucleic Acids Res. 2019;47:D721–8. 10.1093/nar/gky900. 30289549 10.1093/nar/gky900 PMC6323899 54. Charoentong P Finotello F Angelova M Mayer C Efremova M Rieder D Pan-cancer Immunogenomic analyses reveal Genotype-Immunophenotype relationships and predictors of response to checkpoint Blockade Cell Rep 2017 18 248 62 10.1016/j.celrep.2016.12.019 28052254 Charoentong P, Finotello F, Angelova M, Mayer C, Efremova M, Rieder D, et al. Pan-cancer Immunogenomic analyses reveal Genotype-Immunophenotype relationships and predictors of response to checkpoint Blockade. Cell Rep. 2017;18:248–62. 10.1016/j.celrep.2016.12.019. 28052254 10.1016/j.celrep.2016.12.019 55. Pan B Yue Y Ding W Sun L Xu M Wang S A novel prognostic signatures based on metastasis- and immune-related gene pairs for colorectal cancer Front Immunol 2023 14 1161382 10.3389/fimmu.2023.1161382 37180113 PMC10169605 Pan B, Yue Y, Ding W, Sun L, Xu M, Wang S. A novel prognostic signatures based on metastasis- and immune-related gene pairs for colorectal cancer. Front Immunol. 2023;14:1161382. 10.3389/fimmu.2023.1161382. 37180113 10.3389/fimmu.2023.1161382 PMC10169605 56. Lee KK Rishishwar L Ban D Nagar SD Mariño-Ramírez L McDonald JF Association of genetic ancestry and molecular signatures with cancer survival disparities: A Pan-Cancer analysis Cancer Res 2022 82 1222 33 10.1158/0008-5472.CAN-21-2105 35064017 PMC8983592 Lee KK, Rishishwar L, Ban D, Nagar SD, Mariño-Ramírez L, McDonald JF, et al. Association of genetic ancestry and molecular signatures with cancer survival disparities: A Pan-Cancer analysis. Cancer Res. 2022;82:1222–33. 10.1158/0008-5472.CAN-21-2105. 35064017 10.1158/0008-5472.CAN-21-2105 PMC8983592 57. Khojasteh-Leylakoohi F Mohit R Khalili-Tanha N Asadnia A Naderi H Pourali G Down regulation of cathepsin W is associated with poor prognosis in pancreatic cancer Sci Rep 2023 13 16678 10.1038/s41598-023-42928-y 37794108 PMC10551021 Khojasteh-Leylakoohi F, Mohit R, Khalili-Tanha N, Asadnia A, Naderi H, Pourali G, et al. Down regulation of cathepsin W is associated with poor prognosis in pancreatic cancer. Sci Rep. 2023;13:16678. 10.1038/s41598-023-42928-y. 37794108 10.1038/s41598-023-42928-y PMC10551021 58. Mittal D Lepletier A Madore J Aguilera AR Stannard K Blake SJ CD96 is an immune checkpoint that regulates CD8 + T-cell antitumor function Cancer Immunol Res 2019 7 559 71 10.1158/2326-6066.CIR-18-0637 30894377 PMC6445751 Mittal D, Lepletier A, Madore J, Aguilera AR, Stannard K, Blake SJ, et al. CD96 is an immune checkpoint that regulates CD8 + T-cell antitumor function. Cancer Immunol Res. 2019;7:559–71. 10.1158/2326-6066.CIR-18-0637. 30894377 10.1158/2326-6066.CIR-18-0637 PMC6445751 59. Wang Y Wang C Qiu J Qu X Peng J Lu C Targeting CD96 overcomes PD-1 Blockade resistance by enhancing CD8 + TIL function in cervical cancer J Immunother Cancer 2022 10 e003667 10.1136/jitc-2021-003667 35288463 PMC8921917 Wang Y, Wang C, Qiu J, Qu X, Peng J, Lu C, et al. Targeting CD96 overcomes PD-1 Blockade resistance by enhancing CD8 + TIL function in cervical cancer. J Immunother Cancer. 2022;10:e003667. 10.1136/jitc-2021-003667. 35288463 10.1136/jitc-2021-003667 PMC8921917 60. Verma K Croft W Pearce H Zuo J Stephens C Nunnick J Early expression of CD94 and loss of CD96 on CD8 + T cells after allogeneic stem cell tranplantation is predictive of subsequent relapse and survival Haematologica 2023 108 433 43 10.3324/haematol.2021.280497 35924575 PMC9890008 Verma K, Croft W, Pearce H, Zuo J, Stephens C, Nunnick J, et al. Early expression of CD94 and loss of CD96 on CD8 + T cells after allogeneic stem cell tranplantation is predictive of subsequent relapse and survival. Haematologica. 2023;108:433–43. 10.3324/haematol.2021.280497. 35924575 10.3324/haematol.2021.280497 PMC9890008 61. Reina-Campos M Scharping NE Goldrath AW CD8 + T cell metabolism in infection and cancer Nat Rev Immunol 2021 21 718 38 10.1038/s41577-021-00537-8 33981085 PMC8806153 Reina-Campos M, Scharping NE, Goldrath AW. CD8 + T cell metabolism in infection and cancer. Nat Rev Immunol. 2021;21:718–38. 10.1038/s41577-021-00537-8. 33981085 10.1038/s41577-021-00537-8 PMC8806153 62. Stoeckle C Gouttefangeas C Hammer M Weber E Melms A Tolosa E Cathepsin W expressed exclusively in CD8 + T cells and NK cells, is secreted during target cell killing but is not essential for cytotoxicity in human CTLs Exp Hematol 2009 37 266 75 10.1016/j.exphem.2008.10.011 19100676 Stoeckle C, Gouttefangeas C, Hammer M, Weber E, Melms A, Tolosa E. Cathepsin W expressed exclusively in CD8 + T cells and NK cells, is secreted during target cell killing but is not essential for cytotoxicity in human CTLs. Exp Hematol. 2009;37:266–75. 10.1016/j.exphem.2008.10.011. 19100676 10.1016/j.exphem.2008.10.011 63. Wu G Ding C Shi C-L Zhang X-C Lei G-R Wang S Circular RNA 14580 promotes papillary thyroid cancer progression by interacting with ctsw/fibrosis singling pathway Int J Biol Macromol 2024 286 138538 10.1016/j.ijbiomac.2024.138538 39653218 Wu G, Ding C, Shi C-L, Zhang X-C, Lei G-R, Wang S, et al. Circular RNA 14580 promotes papillary thyroid cancer progression by interacting with ctsw/fibrosis singling pathway. Int J Biol Macromol. 2024;286:138538. 10.1016/j.ijbiomac.2024.138538. 39653218 10.1016/j.ijbiomac.2024.138538 64. Li Y Wang Y Jing Y Zhu Y Huang X Wang J Visualization analysis of breast cancer-related ubiquitination modifications over the past two decades Discov Oncol 2025 16 431 10.1007/s12672-025-02032-1 40163091 PMC11958930 Li Y, Wang Y, Jing Y, Zhu Y, Huang X, Wang J, et al. Visualization analysis of breast cancer-related ubiquitination modifications over the past two decades. Discov Oncol. 2025;16:431. 10.1007/s12672-025-02032-1. 40163091 10.1007/s12672-025-02032-1 PMC11958930 65. Jing Y Huang X Wang Y Wang J Li Y Yelihamu D Diagnostic value of 5 MiRNAs combined detection for breast cancer Front Genet 2024 15 1482927 10.3389/fgene.2024.1482927 39655225 PMC11625769 Jing Y, Huang X, Wang Y, Wang J, Li Y, Yelihamu D, et al. Diagnostic value of 5 MiRNAs combined detection for breast cancer. Front Genet. 2024;15:1482927. 10.3389/fgene.2024.1482927. 39655225 10.3389/fgene.2024.1482927 PMC11625769 ",
  "metadata": {
    "Title of this paper": "Diagnostic value of 5 MiRNAs combined detection for breast cancer",
    "Journal it was published in:": "Discover Oncology",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12474806/"
  }
}