{
  "title": "Paper_1229",
  "abstract": "pmc Diagnostics (Basel) Diagnostics (Basel) 2841 diagno diagnostics Diagnostics 2075-4418 Multidisciplinary Digital Publishing Institute  (MDPI) PMC12468643 PMC12468643.1 12468643 12468643 41008664 10.3390/diagnostics15182292 diagnostics-15-02292 1 Article Evaluation of CK8/18 and CK19 Expression as Adjunct Immunohistochemical Markers in Non-Keratinizing Nasopharyngeal Carcinoma Omar Ummul Afila 1 Md Pauzi Suria Hayati Binti 1 Mohamad Yunus Mohd Razif Bin 2 https://orcid.org/0000-0001-9956-4727 Sutan Rosnah 3 https://orcid.org/0000-0001-5095-5428 Tizen Laim Nur Maya Sabrina binti 1 Mustangin Muaatamarulain bin 1 https://orcid.org/0000-0002-5980-165X Md Zin Reena Rahayu 4 * Capodiferro Saverio Academic Editor D’Amati Antonio Academic Editor 1 2 3 4 * reenarahayu@hctm.ukm.edu.my 10 9 2025 9 2025 15 18 497628 2292 28 7 2025 11 8 2025 16 8 2025 10 09 2025 27 09 2025 29 09 2025 © 2025 by the authors. 2025 https://creativecommons.org/licenses/by/4.0/ Licensee MDPI, Basel, Switzerland. This article is an open access article distributed under the terms and conditions of the Creative Commons Attribution (CC BY) license ( https://creativecommons.org/licenses/by/4.0/ Background: Objective: Methods: p p n Conclusions CK8/18 CK19 nasopharyngeal carcinoma Universiti Kebangsaan Malaysia (UKM) FF-2023-225 This research was funded by Universiti Kebangsaan Malaysia (UKM) through an internal fundamental grant, code number FF-2023-225. pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement no pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes 1. Introduction Nasopharyngeal carcinoma (NPC) is a malignant epithelial neoplasm of the nasopharynx that typically exhibits squamous differentiation. The most common site of origin is the lateral wall of the nasopharynx, particularly the Fossa of Rosenmüller, followed by the superior posterior wall. Globally, NPC is rare in most regions, with age-standardized incidence rates (ASR) of less than 1–2 per 100,000 as of 2020. However, its incidence is markedly higher in specific regions such as China and Southeast Asia [ 1 2 3 2 4 According to the latest World Health Organization (WHO) classification, NPC is categorized into three histological subtypes: non-keratinizing squamous cell carcinoma (NK-NPC), keratinizing squamous cell carcinoma (K-NPC), and basaloid squamous cell carcinoma [ 1 5 Cytokeratins (CKs), a family of intracytoplasmic intermediate filament proteins found in epithelial cells, have garnered interest in cancer diagnostics and prognostics. CKs are divided into two types based on molecular weight and isoelectric point: type I (acidic, low molecular weight, CK9–CK20), encoded on chromosome 17q; and type II (basic/neutral, high molecular weight, CK1–CK8), encoded on chromosome 12q [ 6 7 8 9 10 11 12 Similarly, CK19—a type I acidic keratin—is expressed in a variety of glandular epithelial tissues including the gastrointestinal tract, bile ducts, respiratory epithelium, and salivary glands [ 6 13 14 15 16 17 Epstein–Barr virus (EBV) plays a central etiological role in non-keratinizing nasopharyngeal carcinoma (NPC), particularly in endemic regions such as Southeast Asia. Consequently, EBV serological assays—especially IgA antibodies against viral capsid antigen (VCA) and early antigen (EA)—have been incorporated into population-based screening protocols. Elevated EBV serology is associated with increased NPC risk and has demonstrated utility in early detection programs [ 18 19 5 20 Cytokeratins (CKs), particularly CK8/18 and CK19, have demonstrated diagnostic value in various epithelial malignancies. While their expression in NPC has been explored via molecular techniques, there remains a paucity of immunohistochemical (IHC) data—especially within Malaysian populations, where the disease burden is significant. This diagnostic gap hinders the development of tissue-based screening adjuncts and may limit diagnostic precision in histologically ambiguous cases. Therefore, this study aims to evaluate the IHC expression patterns of CK8/18 and CK19 in NPC versus benign nasopharyngeal tissue to assess their potential as reliable markers for early diagnosis and screening in high-incidence regions. 2. Materials and Methods 2.1. Sample Size Calculation Sample size was determined using an online calculator for comparing two proportions (Select Statistical Consultants Ltd., Comparing Two Proportions—Sample Size Calculator https://select-statistics.co.uk/calculators/sample-size-calculator-two-proportions/ n 2 2 Separate calculations were performed for both biomarkers, with the larger sample size selected. For CK19, based on expected proportions of 65% in NPC [ 21 15 12 The study adopted the larger requirement of 16 cases per group. Accounting for a 10% rate of inadequate tissue for immunohistochemical staining, the final sample size was set at 20 cases each of NPC and benign nasal tissue. 2.2. Tissue Specimens A total of 62 cases labelled as nasal tissue or Fossa of Rosenmüller (FOR) were received by the Department of Pathology, Hospital Canselor Tuanku Muhriz, Kuala Lumpur between April 2021 and April 2024. Of these, 36 cases were diagnosed as malignant tumours based on WHO histopathological criteria, 23 were benign, and 3 had an indeterminate diagnosis. Eleven malignant cases were excluded due to diagnoses other than nasopharyngeal carcinoma, and one case was excluded due to exhaustion of diagnostic material. Among the benign group, one case was excluded due to extensive necrosis and the presence of fungal elements. The three indeterminate cases characterized by scant tissue with atypical cells were also excluded. The benign cases included in the study comprised diagnoses of non-specific benign nasal tissue (negative for malignancy, 11 cases), reactive lymphoid hyperplasia (8 cases), chronic inflammation (1 case), inflammatory polyp (1 case), and inverted papilloma (1 case). Histopathological slides of all cases were reviewed, with each tissue specimen considered as a single case. The corresponding formalin-fixed, paraffin-embedded (FFPE) tissue blocks were subsequently retrieved from the pathology archive for immunohistochemical analysis. This study was conducted in accordance with the Declaration of Helsinki and approved by the UKM Research Ethics Committee, under protocol number UKM PPI/111/8/JEP-2023-459 and date of approval 20 July 2023. The need for informed consent was waived due to the retrospective and anonymized nature of the study. 2.3. Immunohistochemical Staining Immunohistochemical staining was performed on tissue sections using the EnVision TM TM TM Two 4 µm-thick sections were prepared from the selected formalin-fixed, paraffin-embedded (FFPE) tissue blocks and mounted on FLEX IHC microscope slides (Product No. K8020-100, DAKO). The slides were subsequently deparaffinized and rehydrated through a series of graded alcohols. Heat-induced epitope retrieval (HIER) was performed by incubating the slides in pre-heated EnVision TM Heat-induced epitope retrieval was performed using EnVision TM 2.4. Immunohistochemical Evaluation All cases were independently reviewed by two pathologists to minimise observer bias. Immunoreactivity for CK8/18 and CK19 was interpreted semi-quantitatively using the categorical criteria adapted from Menz, Bauer, et al. [ 15 Table 1 p 2.5. Statistical Analysis Statistical analysis was performed using the Statistical Package for the Social Sciences SPSS p 3. Results 3.1. Demographics and Clinicopathological Data A total of 24 nasopharyngeal carcinoma (NPC) cases and 22 benign cases were evaluated for cytokeratin 8/18 (CK8/18) and cytokeratin 19 (CK19) immunohistochemical expression. The mean age at diagnosis was 51 years (range: 16–78 years) in the malignant group and 53 years (range: 23–74 years) in the benign group. Males predominated in the NPC group (66.6%), whereas the gender distribution was relatively equal in the benign group. Both groups demonstrated a similar ethnic distribution, with Malays comprising the majority (50% in each group), followed by Chinese, Indian, and other ethnicities ( Table 2 3.2. Comparison of Cytokeratin 8/18 and Cytokeratin 19 Expression in Nasopharyngeal Carcinoma and Benign Nasal Tissue Upon stratification of the benign control group, CK19 and CK8/18 expression were absent in all cases of non-neoplastic tissue including reactive lymphoid hyperplasia and inflammatory conditions. Focal weak positivity was observed only in the case of inverted papilloma, which is a benign neoplasm suggesting that CK expression in benign tissue is not uniform and may be lesion-dependent. This further underscores the importance of contextual histopathological interpretation. Cytokeratin 8/18 and Cytokeratin 19 demonstrated significantly higher positivity in nasopharyngeal carcinoma (NPC) cases compared to benign controls ( p Figure 1 Table 3 3.3. Cytokeratin 8/18 and Cytokeratin 19 Expression in Nasopharyngeal Cases with Positive EBV Status Epstein–Barr encoding region (EBER) in situ hybridization was performed on 15 of the 24 NPC cases, all of which were EBER-positive. Among these, CK19 expression was consistently present (100%), with strong staining observed in 12 cases (80%) and moderate staining in the remaining 3 cases (20%). CK8/18 expression was more variable: only 2 cases (13.3%) demonstrated strong positivity, 12 cases (80%) showed weak to moderate staining, and 1 case (6.7%) was negative ( Table 4 4. Discussion A total of 24 cases of nasopharyngeal carcinoma (NPC) were diagnosed at Hospital Canselor Tuanku Muhriz, Universiti Kebangsaan Malaysia, between April 2021 and April 2024. The patients’ ages ranged from 16 to 78 years, with a mean age of 51.0 ± 14.74 years, consistent with findings from local studies, such as that by Azmir et al. [ 22 Nasopharyngeal carcinoma (NPC) is a malignant epithelial tumour of the nasopharyngeal mucosa that typically exhibits squamous differentiation. The non-keratinizing subtype, which predominates in endemic regions, is characterized by poorly differentiated epithelial cells with minimal keratinization and a variably dense lymphoid stroma. In challenging biopsies, immunohistochemistry (IHC) for pan-cytokeratin and Epstein–Barr virus-encoded RNA (EBER) in situ hybridization (ISH) are recommended. In this study, 37.5% of NPC cases were diagnosed based on morphology alone, while the remaining 62.5% were confirmed using ancillary studies, including combinations of CKAE1/AE3 with EBER ISH (13%) and CK5/6 with EBER ISH (13%). Additional markers such as CD3, CD20, and LCA were used to exclude lymphoid malignancies and were negative. Our findings revealed significant immunopositivity for Cytokeratin 8/18 (CK8/18) and Cytokeratin 19 (CK19) in NK-NPC cases compared to benign controls ( p 15 23 24 15 Stratification of benign controls confirmed that CK8/18 and CK19 expression was limited to the inverted papilloma case, while all other benign lesions—including reactive hyperplasia and cysts—were negative. This finding highlights the specificity of these markers in distinguishing NPC from common non-neoplastic nasopharyngeal tissues, though occasional overlap with benign epithelial proliferations should be interpreted with caution. Given the well-recognized limitations of EBV serology, particularly its reduced specificity due to widespread latent infection, adjunct tissue-based markers remain important for diagnostic confirmation at the histopathological level. In our study, CK19 was consistently expressed in all EBER-positive NK-NPC cases, supporting its potential as a complementary marker in routine diagnostic workup. While EBV serology and EBER-ISH remain central to NPC diagnosis and surveillance, CK19 immunohistochemistry may provide additional value in morphologically ambiguous biopsies, particularly when used alongside pan-cytokeratin panels. Our EBER sub-analysis highlights the diagnostic potential of CK19 in EBV-associated NK-NPC. All EBER-positive cases ( n It is important to distinguish the dual relevance of the study by Menz et al. [ 15 The benign cohort in this study included cases diagnosed as negative for malignancy (11 cases), reactive lymphoid hyperplasia (8 cases), chronic inflammation (1 case), inflammatory polyp (1 case), and inverted papilloma (1 case). Histologically, the nasopharynx consists predominantly of lymphoid stroma lined by respiratory-type epithelium, especially at the fossa of Rosenmüller—an anatomic region frequently involved in NPC. In these tissues, cytokeratin stains are typically negative in lymphoid cells but positive in scattered seromucinous glands and the respiratory epithelium. In tissues from other parts of the nasal cavity, differences in epithelial lining influence cytokeratin staining. The stratified squamous epithelium (e.g., from the vestibular region) is typically negative for CK8/18 and CK19, while respiratory-type epithelia exhibit positive staining. These findings align with previous observations that normal squamous cells are negative for CK8/18 and CK19, whereas the glandular epithelium and malignant squamous cells show positivity. This highlights the importance of correlating immunostaining results with morphological features. To our knowledge, this is the first study to comprehensively evaluate the immunohistochemical expression of CK8/18 and CK19 in nasopharyngeal carcinoma using a semi-quantitative scoring system within a Malaysian cohort. Prior studies have explored the molecular profiles of cytokeratins in NPC, on the other hand our findings provide direct tissue-level evidence supporting their diagnostic relevance, particularly in distinguishing malignant from benign nasopharyngeal lesions. This work contributes novel regional data and reinforces the potential of CK19 as a high-sensitivity adjunct marker, thereby addressing a critical gap in the existing diagnostic landscape for NPC in endemic populations. The diagnosis of non-keratinizing nasopharyngeal carcinoma (NK-NPC) is primarily based on histological features and confirmation with EBER in situ hybridization. However, in limited biopsies, or those with intense inflammation, additional immunohistochemical (IHC) markers such as pan-cytokeratin (CKAE1/AE3), CK5/6, and LMP1 are often employed to aid in distinguishing NK-NPC from benign lymphoid proliferations, lymphomas, or poorly differentiated non-nasopharyngeal carcinomas. Although CK8/18 and CK19 are not routinely used in the diagnostic workup of NPC, their consistent expression in our cohort suggests potential complementary value in such diagnostically challenging scenarios. We acknowledge that our study did not specifically assess equivocal cases, and thus, further investigation is needed to determine the utility of CK8/18 and CK19 in these contexts. 5. Limitations and Future Directions This study has several limitations that should be acknowledged. Firstly, the sample size was relatively small and limited to a single tertiary referral centre, which may reduce the generalizability of the findings to broader populations. Additionally, only non-keratinizing nasopharyngeal carcinoma (NK-NPC) cases were included, and thus, the utility of CK8/18 and CK19 immunohistochemistry in other NPC subtypes, such as keratinizing and basaloid variants, remains unassessed. Another limitation is the lack of comparison with other benign epithelial neoplasms or non-NPC malignancies, which may present diagnostic challenges in real-world practice. Furthermore, EBER in situ hybridization, while used in some cases, was not uniformly applied across all NPC cases, limiting assessment of its correlation with cytokeratin expression. Another limitation of this study is the use of oesophageal squamous cell carcinoma data as a surrogate for NPC in the sample size estimation. Although histologically related, these tumours arise from distinct anatomical and molecular contexts, which may affect cytokeratin expression profiles. Future studies should aim to validate these findings in larger, multi-centre cohorts and include a wider spectrum of nasopharyngeal lesions. Additional exploration into the diagnostic performance of CK8/18 and CK19 in small, limited biopsies, as well as their potential prognostic or therapeutic implications in NPC, may further enhance their clinical utility. 6. Conclusions This study demonstrates that CK8/18 and CK19 are significantly overexpressed in non-keratinising nasopharyngeal carcinoma (NK-NPC) compared to benign nasopharyngeal tissues, supporting their utility as adjunct immunohistochemical markers in diagnostic evaluation. CK19 exhibited strong and consistent expression, yielding high sensitivity and specificity, making it a promising candidate for histopathological differentiation of NPC from benign lesions. CK8/18, while less robust in staining intensity, contributed additional diagnostic value when interpreted in conjunction with CK19. Both markers can also be expressed in benign glandular structures, and their strong and widespread positivity in malignant tissues supports their potential diagnostic relevance when interpreted in appropriate clinical and morphological contexts. While these results are encouraging, the findings are preliminary and should be interpreted cautiously. Further studies with larger, multi-centre cohorts are required to validate these markers’ diagnostic performance and to define their role within broader IHC panels for NPC diagnosis. It is important to note that these findings are specific to the non-keratinizing subtype and should not be generalized to other histological variants of NPC without further validation. While other studies have reported associations between cytokeratin expression and tumour aggressiveness, our findings are diagnostic in nature and do not address prognostic correlations. Further investigation in larger, outcome-linked cohorts would be required to explore prognostic implications. Further prospective studies are needed to assess whether CK19 and CK8/18, in combination with EBV-based assays, can enhance diagnostic accuracy in routine clinical workflows. Such investigations could also help clarify their utility in high-prevalence or resource-limited settings. Our findings provide an initial basis for considering these cytokeratins in diagnostic panels, but any integration into standardized diagnostic or screening protocols will require broader validation, including assessment of feasibility, reproducibility, and clinical impact. Disclaimer/Publisher’s Note: Author Contributions Conceptualization, U.A.O. and R.R.M.Z.; methodology, S.H.B.M.P. and M.R.B.M.Y.; validation, R.R.M.Z. and S.H.B.M.P.; formal analysis, U.A.O. and R.S.; investigation, U.A.O. and N.M.S.b.T.L.; resources, M.R.B.M.Y.; data curation, M.b.M.; writing original draft preparation, U.A.O.; writing—review and editing, R.R.M.Z. and S.H.B.M.P.; visualization, R.S.; supervision, R.R.M.Z.; project administration, R.R.M.Z. All authors have read and agreed to the published version of the manuscript. Institutional Review Board Statement This study was conducted in accordance with the Declaration of Helsinki and approved by the UKM Research Ethics Committee, under protocol number UKM PPI/111/8/JEP-2023-459 and date of approval 20 July 2023. Informed Consent Statement Informed consent was waived due to the retrospective design of the study. Data Availability Statement The data presented in this study is contained within the article material. Conflicts of Interest The authors declare no conflicts of interest. References 1. John K.C. Chan B.F.P. Anne F.B. Lee W.M. Pathmanathan R. Lo K.W. Classification of Head and Neck Tumours 5th ed. International Agency for Research on Cancer Lyon, France 2023 Available online: https://publications.iarc.who.int/629 (accessed on 30th April 2025) 2. Azizah A.M. Hashimah B. Nirmal K. Siti Zubaidah A.R. Puteri N.A. Nabihah A. Azlina A.A. Malaysia National Cancer Registry Report 2012–2016 National Cancer Institute, Ministry of Health Malaysia Putrajaya, Malaysia 2019 116p 3. Devi B.C. Pisani P. Tang T.S. Parkin D.M. High incidence of nasopharyngeal carcinoma in native people of Sarawak, Borneo Island Cancer Epidemiol. Biomark. Prev. 2004 13 482 486 10.1158/1055-9965.482.13.3 15006927 4. Xu B.M.R. Yuan S. Nasopharyngeal Carcinoma 2020 Available online: https://www.pathologyoutlines.com/topic/nasalnasopharyngealgeneral.html (accessed on 30th April 2025) 5. Petersson F. Nasopharyngeal carcinoma: A review Seminars in Diagnostic Pathology Elsevier Amsterdam, The Netherlands 2015 Volume 32 54 73 10.1053/j.semdp.2015.02.021 25769204 6. Mykhaliuk V.V. Havryliak V.V. Salyha Y.T. The Role of Cytokeratins in Ensuring the Basic Cellular Functions and in Dignosis of Disorders Cytol. Genet. 2022 56 530 540 10.3103/S0095452722060093 7. Menz A. Weitbrecht T. Gorbokon N. Büscheck F. Luebke A.M. Kluth M. Simon R. Diagnostic and prognostic impact of cytokeratin 18 expression in human tumors: A tissue microarray study on 11,952 tumors Mol. Med. 2021 27 16 10.1186/s10020-021-00274-7 33588765 PMC7885355 8. Weng Y.R. Cui Y. Fang J.Y. Biological functions of cytokeratin 18 in cancer Mol. Cancer Res. 2012 10 485 493 10.1158/1541-7786.MCR-11-0222 22452884 9. Knosel T. Emde V. Schluns K. Schlag P.M. Dietel M. Petersen I. Cytokeratin profiles identify diagnostic signatures in colorectal cancer using 3D-tissue microarrays Cancer Research AACR Philadelphia, PA, USA 2006 10.1155/2006/354295 PMC4615968 16988472 10. Woelfle U. Sauter G. Santjer S. Brakenhoff R. Pantel K. Down-Regulated Expression of Cytokeratin 18 Promotes Progression of Human Breast Cancer Clin. Cancer Res. 2004 10 2670 2674 10.1158/1078-0432.CCR-03-0114 15102669 11. Fillies T. Werkmeister R. Packeisen J. Brandt B. Morin P. Weingart D. Buerger H. Cytokeratin 8/18 expression indicates a poor prognosis in squamous cell carcinomas of the oral cavity BMC Cancer 2006 6 10 10.1186/1471-2407-6-10 16412231 PMC1379654 12. Makino T. Yamasaki M. Takeno A. Shirakawa M. Miyata H. Takiguchi S. Nakajima K. Fujiwara Y. Nishida T. Matsuura N. Cytokeratins 18 and 8 are poor prognostic markers in patients with squamous cell carcinoma of the oesophagus Br. J. Cancer 2009 101 1298 1306 10.1038/sj.bjc.6605313 19755983 PMC2768453 13. Arcolia V. Journe F. Renaud F. Leteurtre E. Gabius H.J. Remmelink M. Saussez S. Combination of galectin-3, CK19 and HBME-1 immunostaining improves the diagnosis of thyroid cancer Oncol. Lett. 2017 14 4183 4189 10.3892/ol.2017.6719 28943926 PMC5592881 14. Jain R. Fischer S. Serra S. Chetty R. The Use of Cytokeratin 19 (CK19) Immunohistochemistry in Lesions of the Pancreas, Gastrointestinal Tract, and Liver Appl. Immunohistochem. Mol. Morphol. 2010 18 9 15 10.1097/PAI.0b013e3181ad36ea 19956064 15. Menz A. Bauer R. Kluth M. von Bargen C.M. Gorbokon N. Viehweger F. Lennartz M. Völkl C. Fraune C. Uhlig R. Diagnostic and prognostic impact of cytokeratin 19 expression analysis in human tumors: A tissue microarray study of 13,172 tumors Hum. Pathol. 2021 115 19 36 10.1016/j.humpath.2021.05.012 34102222 16. Lee H. Lee H. Cho Y.K. Cytokeratin7 and cytokeratin19 expression in high grade cervical intraepithelial neoplasm and squamous cell carcinoma and their possible association in cervical carcinogenesis Diagn. Pathol. 2017 12 18 10.1186/s13000-017-0609-4 28212672 PMC5316189 17. Safadi R.A. AlRomaizan A. Alshagroud R.S. Divakar D.D. Alshieban S. Cytokeratin 19 Immunostain Reduces Variability in Grading Epithelial Dysplasia of the Non-Keratinized Upper Aerodigestive Tract Mucosa Head Neck Pathol. 2020 14 183 191 10.1007/s12105-019-01038-w 31089948 PMC7021870 18. Ji M. Huang Q. Yu X. Liu Z. Li X. Zhang L. Wang P. Xie S. Rao H. Fang F. Evaluation of plasma Epstein-Barr virus DNA load to distinguish nasopharyngeal carcinoma patients from healthy high-risk populations in Southern China Cancer 2014 120 1353 1360 10.1002/cncr.28564 24477877 19. Chan K.C.A. Woo J.K.S. King A. Zee B.C.Y. Lam W.K.J. Chan S.L. Chu S.W.I. Mak C. Tse I.O.L. Leung S.Y.M. Analysis of Plasma Epstein-Barr Virus DNA to Screen for Nasopharyngeal Cancer N. Engl. J. Med. 2017 377 513 522 10.1056/NEJMoa1701717 28792880 20. Tsao S.W. Tsang C.M. Lo K.W. Epstein-Barr virus infection and nasopharyngeal carcinoma Philos. Trans. R. Soc. Lond. B Biol. Sci. 2017 372 20160270 10.1098/rstb.2016.0270 28893937 PMC5597737 21. Lei D.S. Yu J. Tong X.L. Wang M.W. Wang K. Chen H. Diagnostic value of cytokeratin 19 fragment in nasopharyngeal carcinoma Zhonghua Bing Li Xue Za Zhi 2012 41 461 465 22932457 10.3760/cma.j.issn.0529-5807.2012.07.007 22. Ahmad A. Yassin W.M. Rahman N.A. Leman W.I. Rosla L. Paul M. Yussof S.N. Mohamed K. Abdullah K. Kaderi M.A. The incidence of nasopharyngeal carcinoma in Pahang state of Malaysia from 2012 to 2017 Malays. J. Med. Sci. 2021 28 66 74 10.21315/mjms2021.28.1.9 33679222 PMC7909345 23. Xu X.C. Lee J.S. Lippman S.M. Ro J.Y. Hong W.K. Lotan R. Increased Expression of Cytokeratins CK8 and CK19 Is Associated with Head and Neck Carcinogenesis Cancer Epidemiol. Biomark. Prev. 1995 4 871 876 8634660 24. Franchi A. Moroni M. Massi D. Paglierani M. Santucci M. Sinonasal Undifferentiated Carcinoma, Nasopharyngeal-Type Undifferentiated Carcinoma, and Keratinizing and Nonkeratinizing Squamous Cell Carcinoma Express Different Cytokeratin Patterns Am. J. Surg. Pathol. 2002 26 1597 1604 10.1097/00000478-200212000-00007 12459626 Figure 1 CK19 with strong ( A B C D E diagnostics-15-02292-t001_Table 1 Table 1 CK8/18 and CK19 immunohistochemistry scoring system [ 15 IHC Grading Description Negative No staining Weak 1 + staining intensity in ≤70% of cells or 2 + intensity in ≤30% of cells Moderate 1 + staining intensity in >70% of cells, 2 + intensity in 31 to 70% of cells, or 3 + intensity in ≤30% of cells Strong 2 + intensity in >70% or 3 + intensity in >30% of cells diagnostics-15-02292-t002_Table 2 Table 2 Demographic data along with CK8/18 and CK19 expression in NPC and benign cases. Variable Nasopharyngeal Carcinoma ( n Benign Cases ( n Total ( n Mean Age (years) 51 (SD 14.74) 53 (SD 15.32)  Gender    Female 8 (33.3%) 12 (54.5%) 20 (43.5%) Male 16 (66.6%) 10 (45.5%) 26 (56.5%) Ethnicity    Malay 12 (50.0%) 11 (50.0%) 23 (50.0%) Chinese 9 (37.5%) 9 (40.9%) 18 (39.1%) Indian 0 (0.0%) 1 (4.5%) 1 (2.2%) Foreigner 3 (12.5%) 1 (4.5%) 4 (8.7%) CK8/18 Expression    Negative 1 (4.2%) 21 (95.5%) 22 (47.8%) Weak 12 (50.0%) 1(4.5%) 22 (47.8%) Moderate 8 (33.3%) 0 (0%) 8 (17.4%) Strong 3 (12.5%) 0 (0%) 3 (6.5%) CK19 Expression    Negative 0 (0%) 21 (95.5%) 21 (45.7%) Weak 1 (4.2%) 0 (0%) 1 (2.2%) Moderate 4 (16.7%) 1 (4.5%) 5 (10.9%) Strong 19 (79.2%) 0 (0%) 19 (41.3%) diagnostics-15-02292-t003_Table 3 Table 3 Comparison of CK8/18 and CK19 expression in benign cases according to diagnosis. Diagnosis Total Case CK8/18 Positive CK19 Positive Negative for malignancy 11 0 (0%) 0 (0%) Reactive lymphoid hyperplasia 8 0 (0%) 0 (0%) Inflammatory conditions 3 0 (0%) 0 (0%) Inverted papilloma 1 1 (100%) 1 (100%) All Benign Cases 22 1 (4.5%) 1 (4.5%) diagnostics-15-02292-t004_Table 4 Table 4 C8/18 and CK19 expression in EBER-ISH positive cases. Staining Intensity CK8/18 ( n CK19 ( n Negative 1 (6.7%) 0 (0%) Weak 6 (40%) 1 (6.7%) Moderate 6 (40%) 2 (13.3%) Strong 2 (13.3%) 12 (80%) ",
  "metadata": {
    "Title of this paper": "Sinonasal Undifferentiated Carcinoma, Nasopharyngeal-Type Undifferentiated Carcinoma, and Keratinizing and Nonkeratinizing Squamous Cell Carcinoma Express Different Cytokeratin Patterns",
    "Journal it was published in:": "Diagnostics",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12468643/"
  }
}