{
  "title": "Paper_339",
  "abstract": "pmc Cancer Res Cancer Res 4147 aacrsd Cancer Research 0008-5472 1538-7445 pmc-is-collection-domain yes pmc-collection-title AACR Open Access PMC12485388 PMC12485388.1 12485388 12485388 40794711 10.1158/0008-5472.CAN-24-4323 CAN-24-4323 1 Version of Record Angiogenesis Angiogenic Factors and Receptors Immunotherapy Combination Immunotherapy Tumor Microenvironment Cytokines and the Microenvironment Cancer Biology Tumor-Derived CCL16 Normalizes Tumor Vasculature through Macrophage ICAM-1 Receptor and Enhances Immunotherapy Efficacy in Hepatocellular Carcinoma CCL16 Normalizes Tumor Vasculature in HCC https://orcid.org/0009-0009-6249-6543 Chen Kunling 1  # https://orcid.org/0009-0004-4315-3039 Feng Huolun 2  # https://orcid.org/0009-0002-0194-0419 Zhang Yujie 3  # https://orcid.org/0009-0009-4427-4680 Pei Jingyuan 1  # https://orcid.org/0009-0007-5356-3578 Xu Yuyan 1 https://orcid.org/0009-0008-0335-9613 Wei Xiangxu 1 https://orcid.org/0009-0001-7503-9124 Chen Zhuohao 1 https://orcid.org/0009-0001-5217-1835 Feng Zhoubin 1 https://orcid.org/0000-0003-1658-7996 Cai Lei 1 * https://orcid.org/0000-0003-1799-4841 Li Yong 2 * https://orcid.org/0000-0002-1429-0884 Zhao Liang 3 * https://orcid.org/0000-0002-9133-3323 Pan Mingxin 1 *  1  2  3 * Corresponding Authors: panmx@smu.edu.cn cail_427@smu.edu.cn zhaol828@smu.edu.cn liyong@gdph.org.cn Cancer Res 2025;85:3633–50 # K. Chen, H. Feng, Y. Zhang, and J. Pei contributed equally to this article. 01 10 2025 12 8 2025 85 19 498054 3633 3650 13 11 2024 31 3 2025 11 8 2025 01 10 2025 02 10 2025 03 10 2025 ©2025 The Authors; Published by the American Association for Cancer Research 2025 American Association for Cancer Research https://creativecommons.org/licenses/by-nc-nd/4.0/ This open access article is distributed under the Creative Commons Attribution-NonCommercial-NoDerivatives 4.0 International (CC BY-NC-ND 4.0) license.  CCL16 IL 24 Abstract Hepatocellular carcinoma (HCC) is characterized by aberrant tumor vasculature and an immunosuppressive tumor microenvironment (TME), both of which compromise immunotherapy efficacy while promoting circulating tumor cell (CTC) dissemination and immune escape. In this study, we aimed to identify potential therapeutic targets for remodeling aberrant tumor vasculature by analyzing CTCs from patients with early-stage HCC. HCC tissue samples derived from patients with elevated CTC counts demonstrated significant CCL16 CCL16 CCL16 CCL16 ICAM- 1 JAK2 STAT6 IL 24 CCL16 CCL16 CCL16 Significance:  CCL16 IL 24 National Natural Science Foundation of China (NSFC) http://dx.doi.org/10.13039/501100001809 82072627 82373159 Pan M. Special Project for Research and Development in Key areas of Guangdong Province (广东省科技计划重点领域研发项目) http://dx.doi.org/10.13039/501100015956 2023B1111020008 Pan M. pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement yes pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes Introduction Hepatocellular carcinoma (HCC) is a highly vascularized and immune-evasive solid tumor ( 1 2 3 4 5 6 7 8 9 10 11 Tumor vascular normalization (TVN) is a promising strategy for enhancing cancer therapy efficacy by improving drug delivery and modulating the TME ( 12 13 8 9 4 14 Accumulating evidence suggests that tumor vasculature is primarily regulated by tumor-associated macrophages (TAM; ref. 15 16 17 18 The efficacy of immunotherapy and antiangiogenic therapy in advanced HCC remains suboptimal, primarily because of irreversibly aberrant tumor vasculature and an immunosuppressive TME ( 19 20 21 22 23 In this study, we demonstrate that CCL16 can remodel abnormal tumor vasculature, enhancing immunotherapy efficacy and suppressing tumor progression. We further elucidate that CCL16-induced TVN is mediated by macrophages with the ICAM-1 receptor. Mechanistically, CCL16 interacts with ICAM-1 on TAMs, activating the JAK2–STAT6 pathway and promoting IL24 secretion, which in turn normalizes tumor vasculature. Additionally, based on the proteolytic activity of DPP4, we show that sitagliptin, a clinically used DPP4 inhibitor (DPP4i) for diabetes treatment, prevents CCL16 degradation, further enhancing TVN. Hence, we propose that CCL16 may serve as a valuable tool for TVN in the treatment of patients with HCC, particularly in the context of immunotherapies. Materials and Methods Patients and clinical specimens Tumor tissues from patients with HCC and paired paracancerous tissues were obtained from the Department of Hepatobiliary Surgery II, Zhujiang Hospital, Southern Medical University. Serum samples were obtained from healthy volunteers and patients with HCC. Written informed consent was obtained from all participants or their legal guardians prior to sample collection. The Zhujiang Hospital Ethics Committee of Southern Medical University approved this study (ethics code: 2023-KY-199-01), and all aspects of the study complied with the Declaration of Helsinki. Mice C57BL/6 mice (RRID: IMSR_JAX:000664) and nude mice were purchased from the Guangdong Medical Laboratory Animal Center and the Southern Medical University Experimental Animal Center. All studies were performed in male mice unless otherwise indicated. Mice were kept in a standard 12-hour light–dark cycle under the specific pathogen-free conditions and were allowed free access to water and food. All the mice we used were healthy and immune normal. Animal-related research protocols are consistent with the U.S. Public Health Service Policy on Use of Laboratory Animals and were approved by the Ethics Committee on Use and Care of Animals of Zhujiang Hospital, Southern Medical University (ethics code: LAEC-2023-141). Cell lines and cell culture All cells were incubated at 37°C in a humidified atmosphere containing 5% CO 2 in vitro Mycoplasma Detection and quantification of CTCs CTCs were detected using liquid biopsy technology. Peripheral blood samples (10 mL) were collected from patients in EDTA tubes. The samples were centrifuged at 1,500 g 24 RNA sequencing of HCC tissues Total RNA was extracted from four HCC tissues per group (CTC low and CTC high) using TRIzol reagent (30 mg tissue/sample). RNA integrity was verified via Agilent 2100 Bioanalyzer. Libraries were prepared from high-quality RNA and sequenced on an Illumina NovaSeq 6000 platform. Raw reads were quality controlled using FastQC, aligned to the human reference genome via HISAT2 (RRID: SCR_015530), and quantified using StringTie. Differential expression analysis was performed with DESeq (RRID: SCR_000154). Visualization of differentially expressed genes (DEG) included volcano plots and heatmaps. Functional enrichment analysis of DEGs was conducted using clusterProfiler (RRID: SCR_016884). Western blotting Whole-cell lysates were prepared using cell lysis buffer (Beyotime Biotechnology) and boiled in SDS sample loading buffer. For conditioned culture medium analysis, equal numbers of cells were seeded, and 4 mL of supernatant was collected and concentrated using ultrafiltration tubes centrifuged at 4,000 × g for 15 minutes. The concentrated protein was denatured, and equal volumes were loaded for analysis. Equal amounts of protein (30 μg per lane) were separated by 10% SDS-PAGE and transferred to polyvinylidene difluoride membranes (Millipore). The membranes were blocked with 5% non-fat milk in Tris-Buffered Saline with Tween 20 (TBST) for 1 hour at room temperature, followed by overnight incubation at 4°C with the following primary antibodies: anti–β-tubulin (TA-10, ZsBio), anti–β-actin (TA-09, ZsBio), anti-CCL16 (YN1319, Immunoway), anti–ICAM-1 (10831-1-AP, Proteintech), anti-JAK2 (ET1607-35, HUABIO), anti–pJAK2 (ET1607-34, HUABIO), anti-STAT6 (51073-1-AP, Proteintech), anti–pSTAT6 (ab188080, Abcam), anti-DPP4 (DF12387, Affinity), anti-IL24 (26772-1-AP, Proteintech), anti-F4/80 (28463-1-AP, Proteintech), anti-CCR1 (DF2710, Affinity), anti-CD31 (ab124432, Abcam), anti-SMA (ZM-0003, ZsBio), anti-GST (#2625, Cell Signaling Technology), and anti-FLAG (F1804, Sigma-Aldrich). After washing with TBST, the membranes were incubated with fluorescein-conjugated secondary antibodies for 1 hour at room temperature. The immunoblots were visualized using the ultrahigh-sensitivity chemiluminescence imaging system ChemiDoc XRS+ (Bio-Rad Laboratories) and relative protein levels were quantified using ImageJ software (NIH). A full list of antibodies and detailed information are provided in Supplementary Table S1. qRT-PCR Total RNA was isolated using TRIzol reagent (Takara) according to the manufacturer’s instructions. For each sample, 1 μg of purified RNA was reverse transcribed into cDNA using PrimeScript RT Master Mix (Takara). qRT-PCR was performed on a LightCycler 480 System (Roche) with SYBR Green PCR Master Mix (Takara). The cycling conditions were initial denaturation at 95°C for 30 seconds, followed by 40 cycles of 95°C for 5 seconds and 60°C for 30 seconds. Relative gene expression levels were calculated using the 2 −ΔΔCT Mass cytometry Tumor tissues were collected and digested with trypsin to prepare single-cell suspensions. Cells were isolated by Ficoll-Paque density gradient centrifugation and resuspended in RPMI-1640 medium supplemented with 10% FBS. A total of 1 × 10 6 t Flow cytometric analysis Tumor tissues were minced and digested with collagenase IV (40510ES76, Yeasen) and DNase I (1121MG010, Biofroxx) for 30 minutes at 37°C. Single-cell suspensions were filtered through a 70-μm strainer and incubated with Fc block. Cells were first stained with Zombie Red Fixable Viability Dye (423109, BioLegend) to exclude dead cells. For surface staining, the cells were incubated with the following fluorochrome-conjugated antibodies for 30 minutes at 4°C: human CD45-Alexa Fluor 647 (304018, BioLegend), human CD3-PerCP/Cy5.5 (317336, BioLegend), human CD8-APC (344721, BioLegend), Brilliant Violet 510 anti–mouse CD45 (103138, BioLegend), PE/Cy7 anti–mouse CD4 (100528, BioLegend), APC/Cy7 anti–mouse CD3ε (100330, BioLegend), Alexa Fluor 700 anti–mouse CD8a (100730, BioLegend), PerCP/Cy5.5 anti–mouse/human CD11b (101228, BioLegend), Brilliant Violet 785 anti–mouse F4/80 (123141, BioLegend), FITC anti–mouse NK-1.1 (108706, BioLegend), PE anti–mouse Ly-6G/Ly-6C (108407, BioLegend), FITC rat anti–mouse CD45 (553079, BD Pharmingen), and MS CD4 BV650 GK1.5 (563232, BD Pharmingen). For intracellular staining, the cells were fixed and permeabilized using a Cytofix/Cytoperm kit (BD Biosciences), followed by staining with Alexa Fluor 647 anti–mouse/rat/human FOXP3 (320014, BioLegend), Brilliant Violet 605 anti–mouse IFNγ (505840, BioLegend), Brilliant Violet 421 anti–mouse lFNγ (505829, BioLegend), anti–mouse granzyme B PE-Cy7 (25-8898-80, Thermo Fisher Scientific), and PE rat anti–mouse Foxp3 (R16-715; 563101, BD Pharmingen). Data acquisition was performed using a BD LSRFortessa flow cytometer and analyzed with FlowJo software (RRID: SCR_008520). A full list of antibodies and detailed information are provided in Supplementary Table S3. IHC staining IHC staining was performed on formalin-fixed, paraffin-embedded tissue sections from human HCC and mouse tumor xenografts. Tissue sections were deparaffinized, rehydrated, and subjected to antigen retrieval using citrate buffer (pH 6.0) at 95°C for 20 minutes. Endogenous peroxidase activity was blocked with 3% hydrogen peroxide for 10 minutes. Sections were incubated with primary antibodies targeting specific proteins, followed by secondary antibody incubation and visualization using 3,3-diaminobenzidine as the chromogen. Sections were counterstained with hematoxylin, dehydrated, and mounted for microscopic analysis. Multiplex IHC staining Multiplex immunohistochemistry was performed using sequential staining to evaluate coexpression of five markers (CD31, αSMA, CD8, CD86, and CD56) on formalin-fixed, paraffin-embedded tissue sections. Briefly, sections were deparaffinized, rehydrated, and subjected to antigen retrieval. After blocking endogenous peroxidase and nonspecific binding, slides were incubated with the primary antibody against CD31 (1:200), followed by a horseradish peroxidase (HRP)–conjugated secondary antibody. Color development was achieved using 3-amino-9-ethylcarbazole chromogen, followed by hematoxylin counterstaining, dehydration, and mounting. For subsequent markers (αSMA, CD56, CD8, and CD86), the staining protocol was repeated sequentially after stripping prior antibodies via ethanol-based elution. High-resolution whole-slide imaging was performed using a fluorescence microscope. Pericyte coverage was quantified by calculating the percentage of CD31 + + Tumor vascular perfusion assay Mice were injected intravenously with 40 mg/kg dextran or 10 mg/kg FITC-lectin (Sigma-Aldrich) dissolved in PBS (200 μL). After 10 minutes, mice were euthanized and perfused with 4% paraformaldehyde via the left ventricle after thoracotomy. Tumors were excised and fixed in sequential immersion in 20% and 30% PBS-buffered sucrose until they sank. Tumors were embedded in optimal cutting temperature and sectioned at 5 μm thickness. Sections were counterstained with DAPI and analyzed using confocal microscopy (FLUOVIEW FV3000, Olympus). Immunofluorescence Excised tumor tissues were embedded in paraffin or frozen in optimal cutting temperature. Endothelial cells were stained with anti-CD31 antibodies (ab124432, Abcam) and pericytes with anti–αSMA antibodies (ZM-0003, ZsBio). Hypoxia markers (pimonidazole), vascular leakage markers (dextran), and perfusion markers (lectin) were stained using fluorescently labeled secondary antibodies. Nuclei were counterstained with DAPI. Images were captured and analyzed with a confocal microscope (FLUOVIEW FV3000, Olympus). Vascular density and pericyte coverage were quantified in five random fields of view using ImageJ. Gel electrophoresis and mass spectrometry analysis THP-1 cells were differentiated into M0 macrophages by treatment with 100 nmol/L phorbol 12-myristate 13-acetate (PMA) for 24 hours, followed by resting in fresh medium for an additional 24 hours. The M0 macrophages were then cocultured with recombinant CCL16 (rCCL16; 200 ng/mL) for 48 hours. After coculture, the cells were lysed using RIPA buffer, and equal amounts of protein were subjected to SDS-PAGE for separation. Protein bands were visualized by rapid silver staining. Specific protein bands of interest were excised from the gel, digested with trypsin, and analyzed by mass spectrometry. The resulting peptide spectra were compared against membrane protein databases using Mascot software (RRID: SCR_014322) to identify membrane-associated proteins. Coimmunoprecipitation assay Coimmunoprecipitation was performed to examine the interaction between CCL16 and ICAM-1. M0 macrophages were stimulated with 200 ng/mL rCCL16 and cocultured for 48 hours. Briefly, cell lysates containing 500 μg of total protein were incubated with 2 μg of anti-CCL16 (YN1319, Immunoway) or anti–ICAM-1 (10831-1-AP, Proteintech) overnight at 4°C. The immune complexes were captured using Protein A/G agarose beads (Invitrogen) for 2 hours at 4°C. After incubation, the beads were washed three times with lysis buffer to remove nonspecifically bound proteins. The immunoprecipitates were eluted by boiling in SDS sample loading buffer for 5 minutes at 100°C. The samples were then subjected to SDS-PAGE and Western blot analysis to detect ICAM-1 in the CCL16 immunoprecipitate and CCL16 in the ICAM-1 immunoprecipitate. Detection was performed using corresponding primary antibodies, followed by HRP-conjugated secondary antibodies. ELISA ELISA kits for CCL16, VEGFA, and ANG2 were purchased from Cloud-Clone Corporation, whereas the IL24 ELISA kit was obtained from Guangzhou Tianyuan Biotechnology Corporation. All ELISA procedures were performed according to the manufacturer’s instructions. Briefly, standards and samples were added to a 96-well plate pre-coated with specific antibodies and incubated. After washing to remove unbound components, biotin-conjugated detection antibodies were added and incubated. Following another wash, HRP-conjugated streptavidin was added for signal development. The optical density was measured at 450 nm using a microplate reader. Sample concentrations were calculated by comparison with a standard curve, and data were analyzed using GraphPad Prism 9.0 software. Molecular docking The Protein Data Bank (PDB) structures of CCL16 and ICAM-1 were retrieved from the PDB. Protein–protein docking was performed using GRAMM-X ( http://gramm.compbio.ku.edu/ https://www.ebi.ac.uk/msd-srv/prot_int/ Migration assay Migration assays were performed using transwell chambers with 8-μm pore size inserts. THP-1 cells were differentiated into M0 macrophages by incubation with 100 nmol/L PMA for 24 hours, followed by a resting period of 24 hours. The M0 macrophages were seeded in the upper chamber, whereas rCCL16 (200 ng/mL) was added to the lower chamber. Different concentrations of ICAM-1 antibody were added to the upper chamber to antagonize the membrane receptors of THP-1 cells and observe the changes in macrophage migration. After 72 hours, the migrated macrophages in the lower chamber were fixed and stained. Data availability The RNA sequencing (RNA-seq) data from patients with HCC generated in this study are publicly available in the NCBI Sequence Read Archive database at BioProject PRJNA912860 ( https://www.ncbi.nlm.nih.gov/search/all/?term=PRJNA912860 https://www.ncbi.nlm.nih.gov/bioproject/PRJNA1199572 https://portal.gdc.cancer.gov/ https://cistrome.shinyapps.io/timer/ https://gtexportal.org Results Multiomics profiling identifies candidate hub molecules mediating vascular–immune cross-talk in HCC Recent studies have identified CTCs in the bloodstream as an early marker of HCC metastasis ( 21 25 2 20 + + + + 5 26 + + + + Fig. 1A B Figure 1. CCL16 emerges as a potential crucial regulatory molecule in the vascular and immune microenvironment of HCC. A B, A B + + + + n C, D, E F, E F G, n H, I, J K, J K + + n t B K F n E P P P To elucidate the underlying mechanisms, we performed high-throughput sequencing on four CTC-low and four CTC-high HCC samples and integrated the results with data from the TCGA-LIHC dataset. We identified 294 DEGs ( Fig. 1C Fig. 1D We generated CCL16-knockdown Hepa1-6 cell lines, with Hepa1-6-sh1 exhibiting the most significant knockdown efficiency ( Fig. 1E F In vivo Fig. 1G + Fig. 1H I + + Fig. 1J K CCL16 promotes vascular normalization and reverses immunosuppressive TME in HCC Our study further elucidated the role of CCL16 in HCC. We first determined CCL16 expression levels in various HCC cell lines and measured secreted CCL16 in their supernatants ( Fig. 2A Fig. 2B Figure 2. CCL16 promotes vascular normalization and reverses immunosuppressive TME in HCC. A, B, C D, C D n E F, E F + + n G H, G H n I J, I J + n K, n L, n M, n N O, N O n P, n Q, R, + + + + + + + + C N t D, E, G, I, K–M, O, P, R n A B P P P  In vivo Fig. 2C Fig. 2D + Fig. 2E F + + Fig. 2G H + Fig. 2I J Fig. 2K Fig. 2L Fig. 2M 12 Building on the vascular–immune cross-talk defects observed in CCL16-knockdown models, we further investigated the therapeutic potential of exogenous rCCL16 in modulating tumor vasculature and the TIME. Subcutaneous tumor models were established in immunocompetent C57BL/6 mice (Supplementary Fig. S3A). rCCL16 administration markedly suppressed HCC progression, as evidenced by significantly reduced tumor growth and tumor weights compared with controls ( Fig. 2N O Fig. 2P + Fig. 2Q + + + + + + + + + Fig. 2R CCL16 regulates macrophage-mediated TVN Macrophages play an important role in regulating tumor vascular, and our study supposes the role of macrophages in CCL16-regulated TVN ( Fig. 2I J 27 28 Fig. 3A–C Figure 3. CCL16 regulates macrophage-mediated TVN. A, B C, B C + + n D, E G E F G H I, H I + n J K, J K n L M, L M n N O, N O n A E B, F, L–N t K P P P TIMER immune infiltration analysis identified a robust correlation between CCL16 expression and macrophage infiltration ( Fig. 3D Fig. 3E F Fig. 3G 29 30 + Fig. 3H I Fig. 3J K Fig. 3L M Fig. 3N O These findings establish macrophages as indispensable mediators of CCL16-driven vascular normalization. The cytokine’s ability to enhance perfusion, stabilize vasculature, and alleviate hypoxia is macrophage dependent, as evidenced by functional reversal upon macrophage ablation. Our work unveils a macrophage-centric paradigm for CCL16-mediated vascular remodeling, offering novel therapeutic strategies to potentiate antitumor immunity in HCC through macrophage modulation. Exploring the specific interaction between CCL16 and ICAM-1 on macrophage membranes To delineate the mechanism of CCL16–receptor binding on macrophages, we performed systematic experiments. PMA-differentiated M0 macrophages derived from THP-1 monocytes were cocultured with rCCL16 for 48 hours. Immunoprecipitation (IP) followed by electrophoresis with rapid silver staining revealed a distinct 70 to 100 kDa band in IP group, which was absent in IgG controls ( Fig. 4A Fig. 4B Fig. 4C D Figure 4. Exploring the specific interaction between CCL16 and ICAM-1 on macrophage membranes. A, B, C D, E, F, G, H, I, J, H n F, G, J P P IHC and immunofluorescence (IF) analyses of tissues from patients with HCC revealed predominant ICAM-1 expression in stromal cells, with TAMs exhibiting significantly higher ICAM-1 levels compared with T cells (Supplementary Fig. S5B and S5C). Molecular docking predicted spatial CCL16–ICAM-1 interaction with a binding affinity of −5.7 kcal/mol ( Fig. 4E Fig. 4F Cellular IF demonstrated exogenous rCCL16 colocalization with ICAM-1 on THP-1–derived M0 macrophages, absent in untreated controls ( Fig. 4G In vitro Fig. 4H Fig. 4I Fig. 4J These findings suggest that the specific interaction between CCL16 and ICAM-1 on the macrophage membrane may play a crucial role in regulating macrophage activity, subsequently influencing TVN and the TIME. This understanding provides a potential new therapeutic target for modulating macrophages to regulate the TIME. CCL16 promotes macrophage activation and TVN via ICAM-1–mediated molecular mechanisms Our findings establish CCL16 as a critical regulator of immune activation and vascular normalization within the TME. Although ICAM-1 was identified as the key receptor in macrophage mediating these effects, its downstream signaling mechanisms remained undefined. To address this, we investigated how the CCL16–ICAM-1 interaction drives macrophage functional reprogramming. Comprehensive evaluation of canonical angiogenesis regulators (Tie2, VEGFA, and Ang2) in rCCL16-stimulated M0 macrophages showed no significant changes via qPCR (Supplementary Fig. S6A), Western blotting (Supplementary Fig. S6B), or ELISA (Supplementary Fig. S6C and S6D), excluding their involvement in CCL16-mediated vascular normalization. Extended screening of 15 additional vascular mediators, including PDGFB, PLGF, CSF1, MRC1, MMP9, HGF, IL6, IL8, BV8, CXCL9, DLL4, PIGF, HIF1α, and IL10, revealed minimal mRNA alterations, except for significant PIGF and HIF1α downregulation and mild IL10 upregulation (Supplementary Fig. S6E). These results highlight CCL16’s unique functionality, alleviating hypoxia while modestly amplifying immunosuppression via noncanonical pathways. RNA-seq of rCCL16-stimulated M0 macrophages ( Fig. 5A Fig. 5B C Fig. 5D 31 33 Fig. 5E 34 Fig. 5F G Fig. 5H Fig. 5I–K (Fig. 5L M Fig. 5N O Fig. 5P Q Fig. 5R–T Figure 5. CCL16–ICAM-1 interaction activates the JAK2/STAT6-IL24 axis in promoting vascular normalization. A, B, C, D, E, F, G, H K, H I J K L M, L M n N O, N O n P Q, P Q n R T, R S T C, F, T t J, M, O, Q K S n D, E, G P P P P These results delineate a CCL16–ICAM-1–JAK2/STAT6–IL24 axis as the mechanistic cornerstone of macrophage-driven TVN and tumor suppression. This pathway offers novel therapeutic targets for HCC immunotherapy by simultaneously modulating vascular integrity and immune activity within the TME. CCL16 degradation in the HCC microenvironment and therapeutic potential of DPP4i To investigate the mechanism of CCL16 downregulation in HCC, we explored whether oncogenic drivers promote CCL16 degradation. Based on prior evidence that administration of the DPP4i sitagliptin resulted in elevated concentrations of the chemokine CCL11 ( 35 36 Molecular docking predicted spatial interaction between DPP4 and CCL16 with a binding affinity of −18.3 kcal/mol ( Fig. 6A Fig. 6B C Fig. 6D In vitro Fig. 6E Fig. 6F Figure 6. CCL16 degradation in the HCC microenvironment and therapeutic potential of DPP4i. A, B C, B C overexpression D, overexpression E, F, G I, G H I J K, J K n L M, L M n N O, N O n t B C H I, K, M, O n D, E, F P P P  In vivo Fig. 6G Fig. 6H I Fig. 6J K Fig. 6L M Fig. 6N O These findings delineate DPP4-driven CCL16 degradation as a key immunosuppressive mechanism in HCC and position DPP4i as promising agents to amplify CCL16-mediated vascular–immune remodeling in the TME. Clinical significance of CCL16 in HCC and exploration of combined therapeutic strategies Although vascular normalization alone may be insufficient for optimal antitumor efficacy in advanced HCC, we evaluated its synergy with anti–PD-1 immunotherapy. Lentivirus-mediated CCL16-overexpressing cell lines (Supplementary Fig. S9A) were used in immunocompetent C57BL/6 mice under various treatment regimens ( Fig. 7A Fig. 7B–D Figure 7. Clinical significance of CCL16 in HCC and exploration of combined treatment strategies. A D, A B C D E H, + + E F–H n I, J, K, L, M, N, O P, O + + P Q, D C F–I t L M χ 2 J N Q P n K P P P P Flow cytometry ( Fig. 7E Fig. 7F + + Fig. 7G Fig. 7H + + Fig. 7I 37 39 To assess the clinical significance of CCL16 in HCC, we performed IHC staining on 48 paired normal liver and HCC tissues. The results demonstrated a marked reduction in CCL16 expression in tumor tissues compared with adjacent normal liver tissues ( Fig. 7J Fig. 7K Fig. 7L Fig. 7M Fig. 7N Fig. 7O P Fig. 7Q In conclusion, the synergistic combination of CCL16-driven TVN and PD-1 blockade represents a transformative strategy to enhance immunotherapy efficacy in HCC, addressing the clinical challenge of treatment resistance in advanced HCC. Discussion Multiple CC-family chemokines regulate immune cell recruitment with divergent pro/antitumor effects ( 40 41 42 43 CCL16 exhibits context-dependent functional complexity. Although in vitro 27 in vivo 4 5 8 44 45 46 47 48 50 51 42 52 The mechanistic model is illustrated in a schematic illustration ( Fig. 8 Figure 8. Schematic illustration of tumor-derived CCL16 normalizing tumor vasculature through macrophage ICAM-1 receptor and enhancing immunotherapy efficacy in HCC. Top, schematic of the interaction between HCC cells and TAMs illustrating that CCL16, increased by DPP4 inhibitors in the TME, acts on ICAM-1 receptors on TAMs, activating the JAK2–STAT6 pathway and promoting IL24 expression and secretion. Middle, a macroscopic illustration of HCC depicting tumor vascular remodeling toward normalization and alterations in the immune microenvironment. Bottom, the microscopic schematic of tumor vasculature illustrating how vascular normalization, enhanced by CCL16, improves the TIME and strengthens antitumor effects. DC, dendritic cell; MDSC, myeloid-derived suppressor cell; Treg, regulatory T cell. Created with Adobe Photoshop CC 2020 by KL. Chen. Although chemokine–receptor interactions typically govern intercellular communication, our study uncovers a CCR1-independent vascular mechanism of CCL16 in HCC. Despite CCL16's known binding to CCR1 in hepatic cells ( 27 53 50 54 Emerging evidence implicates DPP4, an oncogene overexpressed in solid tumors, as a key regulator of chemokine stability via its extracellular dipeptidyl peptidase activity ( 55 56 35 57 58 59 60 Supplementary Material Figure S1 Liver-specific secretion of CCL16 negatively regulates tumor vasculature. Table S1 Primary antibodies in Western blot / Immunofluorescence / Immunoprecipitation/ Immunohistochemical. Figure S2 CCL16 promotes vascular normalization in HCC. Table S2 Oligonucleotide information, related to STAR Methods. Figure S3 rCCL16 reverses immunosuppressive TME in HCC. Table S3 Fluorochrome-conjugated antibodies in flow cytometry Figure S4 Interaction between HCC-derived CCL16 and M0 macrophages. Figure S5 The role of macrophage membrane receptor ICAM-1. Figure S6 CCL16-mediated vascular normalization through non-canonical receptor signaling. Figure S7 CCL16-ICAM-1 interaction activates JAK2/STAT6-IL24 axis in promoting vascular normalization. Figure S8 CCL16 degradation in the HCC microenvironment and therapeutic potential of DPP4 inhibitors. Figure S9 The effect of CCL16 on the TIME and tumor vasculature in HCC. Acknowledgments M. Pan was supported by the National Natural Science Foundation of China (grant/award number 82072627 and 82373159) and the Key Area Research and Development Program of Guangdong Province (grant/award number 2023B1111020008). This work was also supported by Science and Technology Projects in Guangzhou of China (grant/award number 2023B03J1247) and Clinical high-tech project in Guangzhou region (grant/award number 2024P-GX20). We sincerely acknowledge the TCGA, GEO database, and GSEA owners for providing their platforms and the contributors for uploading meaningful datasets. We employed DeepSeek AI and ChatGPT to improve the quality of the writing for specific sections of the manuscript. The authors affirm full responsibility for all scientific content, data analysis, and conclusions presented in this work.  Note: http://cancerres.aacrjournals.org/ Authors’ Disclosures K. Chen reports grants from the National Natural Science Foundation of China and the Key Area Research and Development Program of Guangdong Province during the conduct of the study. J. Pei reports grants from the National Natural Science Foundation of China and the Key Area Research and Development Program of Guangdong Province during the conduct of the study. X. Wei reports grants from the National Natural Science Foundation of China and the Key Area Research and Development Program of Guangdong Province during the conduct of the study. M. Pan reports grants from the National Natural Science Foundation of China and the Key Area Research and Development Program of Guangdong Province during the conduct of the study. No disclosures were reported by the other authors. Authors’ Contributions  K. Chen: H. Feng: Y. Zhang: J. Pei: Y. Xu: X. Wei: Z. Chen: Z. Feng: L. Cai: Y. Li: L. Zhao: M. Pan: References 1. Fukumura D Kloepper J Amoozgar Z Duda DG Jain RK Enhancing cancer immunotherapy using antiangiogenics: opportunities and challenges Nat Rev Clin Oncol 2018 15 325 40 29508855 10.1038/nrclinonc.2018.29 PMC5921900 2. Hilmi M Neuzillet C Calderaro J Lafdil F Pawlotsky JM Rousseau B Angiogenesis and immune checkpoint inhibitors as therapies for hepatocellular carcinoma: current knowledge and future research directions J Immunother Cancer 2019 7 333 31783782 10.1186/s40425-019-0824-5 PMC6884868 3. Liu LP Ho RL Chen GG Lai PB Sorafenib inhibits hypoxia-inducible factor-1α synthesis: implications for antiangiogenic activity in hepatocellular carcinoma Clin Cancer Res 2012 18 5662 71 22929805 10.1158/1078-0432.CCR-12-0552 4. Jain RK Normalization of tumor vasculature: an emerging concept in antiangiogenic therapy Science 2005 307 58 62 15637262 10.1126/science.1104819 5. Goel S Duda DG Xu L Munn LL Boucher Y Fukumura D Normalization of the vasculature for treatment of cancer and other diseases Physiol Rev 2011 91 1071 121 21742796 10.1152/physrev.00038.2010 PMC3258432 6. Huynh H Lee LY Goh KY Ong R Hao HX Huang A Infigratinib mediates vascular normalization, impairs metastasis, and improves chemotherapy in hepatocellular carcinoma Hepatology 2019 69 943 58 30575985 10.1002/hep.30481 PMC6635738 7. Martin JD Seano G Jain RK Normalizing function of tumor vessels: progress, opportunities, and challenges Annu Rev Physiol 2019 81 505 34 30742782 10.1146/annurev-physiol-020518-114700 PMC6571025 8. Viallard C Larrivée B Tumor angiogenesis and vascular normalization: alternative therapeutic targets Angiogenesis 2017 20 409 26 28660302 10.1007/s10456-017-9562-9 9. Ebos JM Lee CR Kerbel RS Tumor and host-mediated pathways of resistance and disease progression in response to antiangiogenic therapy Clin Cancer Res 2009 15 5020 5 19671869 10.1158/1078-0432.CCR-09-0095 PMC2743513 10. Huang M Lin Y Wang C Deng L Chen M Assaraf YG New insights into antiangiogenic therapy resistance in cancer: mechanisms and therapeutic aspects Drug Resist Updat 2022 64 100849 35842983 10.1016/j.drup.2022.100849 11. Iwamoto H Abe M Yang Y Cui D Seki T Nakamura M Cancer lipid metabolism confers antiangiogenic drug resistance Cell Metab 2018 28 104 17.e5 29861385 10.1016/j.cmet.2018.05.005 12. Park JS Kim IK Han S Park I Kim C Bae J Normalization of tumor vessels by Tie2 activation and Ang2 inhibition enhances drug delivery and produces a favorable tumor microenvironment Cancer Cell 2016 30 953 67 27960088 10.1016/j.ccell.2016.10.018 13. Wang-Bishop L Kimmel BR Ngwa VM Madden MZ Baljon JJ Florian DC STING-Activating nanoparticles normalize the vascular-immune interface to potentiate cancer immunotherapy Sci Immunol 2023 8 eadd1153 37146128 10.1126/sciimmunol.add1153 PMC10226150 14. Huang Y Kim BYS Chan CK Hahn SM Weissman IL Jiang W Improving immune-vascular crosstalk for cancer immunotherapy Nat Rev Immunol 2018 18 195 203 29332937 10.1038/nri.2017.145 PMC5922422 15. Wenes M Shang M Di Matteo M Goveia J Martín-Pérez R Serneels J Macrophage metabolism controls tumor blood vessel morphogenesis and metastasis Cell Metab 2016 24 701 15 27773694 10.1016/j.cmet.2016.09.008 16. Wang W Li T Cheng Y Li F Qi S Mao M Identification of hypoxic macrophages in glioblastoma with therapeutic potential for vasculature normalization Cancer Cell 2024 42 815 32.e12 38640932 10.1016/j.ccell.2024.03.013 17. Rolny C Mazzone M Tugues S Laoui D Johansson I Coulon C HRG inhibits tumor growth and metastasis by inducing macrophage polarization and vessel normalization through downregulation of PlGF Cancer Cell 2011 19 31 44 21215706 10.1016/j.ccr.2010.11.009 18. Chen X Zhang L Zhang IY Liang J Wang H Ouyang M RAGE expression in tumor-associated macrophages promotes angiogenesis in glioma Cancer Res 2014 74 7285 97 25326491 10.1158/0008-5472.CAN-14-1240 PMC4268204 19. Bruix J da Fonseca LG Reig M Insights into the success and failure of systemic therapy for hepatocellular carcinoma Nat Rev Gastroenterol Hepatol 2019 16 617 30 31371809 10.1038/s41575-019-0179-x 20. Strilic B Offermanns S Intravascular survival and extravasation of tumor cells Cancer Cell 2017 32 282 93 28898694 10.1016/j.ccell.2017.07.001 21. Sun YF Wu L Liu SP Jiang MM Hu B Zhou KQ Dissecting spatial heterogeneity and the immune-evasion mechanism of CTCs by single-cell RNA-Seq in hepatocellular carcinoma Nat Commun 2021 12 4091 34215748 10.1038/s41467-021-24386-0 PMC8253833 22. Liu X Song J Zhang H Liu X Zuo F Zhao Y Immune checkpoint HLA-E:CD94-NKG2A mediates evasion of circulating tumor cells from NK cell surveillance Cancer Cell 2023 41 272 87.e9 36706761 10.1016/j.ccell.2023.01.001 23. Nikanjam M Kato S Kurzrock R Liquid biopsy: current technology and clinical applications J Hematol Oncol 2022 15 131 36096847 10.1186/s13045-022-01351-y PMC9465933 24. Ahn JC Teng PC Chen PJ Posadas E Tseng HR Lu SC Detection of circulating tumor cells and their implications as a biomarker for diagnosis, prognostication, and therapeutic monitoring in hepatocellular carcinoma Hepatology 2021 73 422 36 32017145 10.1002/hep.31165 PMC8183673 25. Luo Q Wang C Peng B Pu X Cai L Liao H Circulating tumor-cell-associated white blood cell clusters in peripheral blood indicate poor prognosis in patients with hepatocellular carcinoma Front Oncol 2020 10 1758 33224869 10.3389/fonc.2020.01758 PMC7667255 26. Xu Z Guo C Ye Q Shi Y Sun Y Zhang J Endothelial deletion of SHP2 suppresses tumor angiogenesis and promotes vascular normalization Nat Commun 2021 12 6310 34728626 10.1038/s41467-021-26697-8 PMC8564544 27. Strasly M Doronzo G Cappello P Valdembri D Arese M Mitola S CCL16 activates an angiogenic program in vascular endothelial cells Blood 2004 103 40 9 12958070 10.1182/blood-2003-05-1387 28. Elices MJ BX-471 berlex Curr Opin Investig Drugs 2002 3 865 9 12137405 29. Zeng X Liu G Peng W He J Cai C Xiong W Combined deficiency of SLAMF8 and SLAMF9 prevents endotoxin-induced liver inflammation by downregulating TLR4 expression on macrophages Cell Mol Immunol 2020 17 153 62 30552382 10.1038/s41423-018-0191-z PMC7000402 30. Griesmann H Drexel C Milosevic N Sipos B Rosendahl J Gress TM Pharmacological macrophage inhibition decreases metastasis formation in a genetic model of pancreatic cancer Gut 2017 66 1278 85 27013602 10.1136/gutjnl-2015-310049 31. Chu KH Chiang BL CD200R activation on naïve T cells by B cells induces suppressive activity of T cells via IL-24 Cell Mol Life Sci 2024 81 231 38780647 10.1007/s00018-024-05268-2 PMC11116298 32. Sahoo A Lee CG Jash A Son JS Kim G Kwon HK Stat6 and c-Jun mediate Th2 cell-specific IL-24 gene expression J Immunol 2011 186 4098 109 21357535 10.4049/jimmunol.1002620 33. Dabitao D Hedrich CM Wang F Vacharathit V Bream JH Cell-specific requirements for STAT proteins and type I IFN receptor signaling discretely regulate IL-24 and IL-10 expression in NK cells and macrophages J Immunol 2018 200 2154 64 29436412 10.4049/jimmunol.1701340 PMC5840025 34. Huang C Wang J Liu H Huang R Yan X Song M Ketone body β-hydroxybutyrate ameliorates colitis by promoting M2 macrophage polarization through the STAT6-dependent signaling pathway BMC Med 2022 20 148 35422042 10.1186/s12916-022-02352-x PMC9011974 35. Hollande C Boussier J Ziai J Nozawa T Bondet V Phung W Inhibition of the dipeptidyl peptidase DPP4 (CD26) reveals IL-33-dependent eosinophil-mediated control of tumor growth Nat Immunol 2019 20 257 64 30778250 10.1038/s41590-019-0321-5 36. Mulvihill EE Drucker DJ Pharmacology, physiology, and mechanisms of action of dipeptidyl peptidase-4 inhibitors Endocr Rev 2014 35 992 1019 25216328 10.1210/er.2014-1035 PMC7108477 37. Tokumasu M Nishida M Zhao W Chao R Imano N Yamashita N Metformin synergizes with PD-1 blockade to promote normalization of tumor vessels via CD8T cells and IFNγ Proc Natl Acad Sci U S A 2024 121 e2404778121 39018197 10.1073/pnas.2404778121 PMC11287262 38. Li Q Wang Y Jia W Deng H Li G Deng W Low-dose anti-angiogenic therapy sensitizes breast cancer to PD-1 blockade Clin Cancer Res 2020 26 1712 24 31848190 10.1158/1078-0432.CCR-19-2179 39. Ramjiawan RR Griffioen AW Duda DG Anti-angiogenesis for cancer revisited: is there a role for combinations with immunotherapy? Angiogenesis 2017 20 185 204 28361267 10.1007/s10456-017-9552-y PMC5439974 40. Korbecki J Kojder K Simińska D Bohatyrewicz R Gutowska I Chlubek D CC chemokines in a tumor: a review of pro-cancer and anti-cancer properties of the ligands of receptors CCR1, CCR2, CCR3, and CCR4 Int J Mol Sci 2020 21 8412 33182504 10.3390/ijms21218412 PMC7665155 41. Hao Q Vadgama JV Wang P CCL2/CCR2 signaling in cancer pathogenesis Cell Commun Signal 2020 18 82 32471499 10.1186/s12964-020-00589-8 PMC7257158 42. Guiducci C Vicari AP Sangaletti S Trinchieri G Colombo MP Redirecting in vivo elicited tumor infiltrating macrophages and dendritic cells towards tumor rejection Cancer Res 2005 65 3437 46 15833879 10.1158/0008-5472.CAN-04-4262 43. Li J Hu P Khawli LA Epstein AL LEC/chTNT-3 fusion protein for the immunotherapy of experimental solid tumors J Immunother 2003 26 320 31 12843794 10.1097/00002371-200307000-00004 44. Vemuri K de Alves Pereira B Fuenzalida P Subashi Y Barbera S van Hooren L CD93 maintains endothelial barrier function and limits metastatic dissemination JCI Insight 2024 9 e169830 38441970 10.1172/jci.insight.169830 PMC11128212 45. Zhang Q Wei T Jin W Yan L Shi L Zhu S Deficiency in SLC25A15, a hypoxia-responsive gene, promotes hepatocellular carcinoma by reprogramming glutamine metabolism J Hepatol 2024 80 293 308 38450598 10.1016/j.jhep.2023.10.024 46. Li Y Li B Xu Y Qian L Xu T Meng G GOT2 silencing promotes reprogramming of glutamine metabolism and sensitizes hepatocellular carcinoma to glutaminase inhibitors Cancer Res 2022 82 3223 35 35895805 10.1158/0008-5472.CAN-22-0042 47. Yang Z Yan C Ma J Peng P Ren X Cai S Lactylome analysis suggests lactylation-dependent mechanisms of metabolic adaptation in hepatocellular carcinoma Nat Metab 2023 5 61 79 36593272 10.1038/s42255-022-00710-w 48. Han D Ma Q Ballar P Zhang C Dai M Luo X Reprogramming tumor-associated macrophages and inhibiting tumor neovascularization by targeting MANF-HSF1-HSP70-1 pathway: an effective treatment for hepatocellular carcinoma Acta Pharm Sin B 2024 14 4396 412 39525584 10.1016/j.apsb.2024.05.001 PMC11544390 49. Wu Z Liu W Wang Z Zeng B Peng G Niu H Mesenchymal stem cells derived from iPSCs expressing interleukin-24 inhibit the growth of melanoma in the tumor-bearing mouse model Cancer Cell Int 2020 20 33 32015693 10.1186/s12935-020-1112-7 PMC6990536 50. Maes H Kuchnio A Peric A Moens S Nys K De Bock K Tumor vessel normalization by chloroquine independent of autophagy Cancer Cell 2014 26 190 206 25117709 10.1016/j.ccr.2014.06.025 51. Fukuda S Hanano Y Iio M Miura R Yoshie O Nomiyama H Genomic organization of the genes for human and mouse CC chemokine LEC DNA Cell Biol 1999 18 275 83 10235110 10.1089/104454999315330 52. Nakayama T Kato Y Hieshima K Nagakubo D Kunori Y Fujisawa T Liver-expressed chemokine/CC chemokine ligand 16 attracts eosinophils by interacting with histamine H4 receptor J Immunol 2004 173 2078 83 15265943 10.4049/jimmunol.173.3.2078 53. Whitaker EL Filippov VA Duerksen-Hughes PJ Interleukin 24: mechanisms and therapeutic potential of an anti-cancer gene Cytokine Growth Factor Rev 2012 23 323 31 22981288 10.1016/j.cytogfr.2012.08.004 54. Emdad L Bhoopathi P Talukdar S Pradhan AK Sarkar D Wang XY Recent insights into apoptosis and toxic autophagy: the roles of MDA-7/IL-24, a multidimensional anti-cancer therapeutic Semin Cancer Biol 2020 66 140 54 31356866 10.1016/j.semcancer.2019.07.013 PMC7009777 55. Enz N Vliegen G De Meester I Jungraithmayr W CD26/DPP4 - a potential biomarker and target for cancer therapy Pharmacol Ther 2019 198 135 59 30822465 10.1016/j.pharmthera.2019.02.015 56. Nishina S Yamauchi A Kawaguchi T Kaku K Goto M Sasaki K Dipeptidyl peptidase 4 inhibitors reduce hepatocellular carcinoma by activating lymphocyte chemotaxis in mice Cell Mol Gastroenterol Hepatol 2019 7 115 34 30510994 10.1016/j.jcmgh.2018.08.008 PMC6260362 57. Deacon CF Dipeptidyl peptidase 4 inhibitors in the treatment of type 2 diabetes mellitus Nat Rev Endocrinol 2020 16 642 53 32929230 10.1038/s41574-020-0399-8 58. Finn RS Ryoo B-Y Merle P Kudo M Bouattour M Lim HY Pembrolizumab as second-line therapy in patients with advanced hepatocellular carcinoma in KEYNOTE-240: a randomized, double-blind, phase III trial J Clin Oncol 2020 38 193 202 31790344 10.1200/JCO.19.01307 59. Vesely MD Zhang T Chen L Resistance mechanisms to anti-PD cancer immunotherapy Annu Rev Immunol 2022 40 45 74 35471840 10.1146/annurev-immunol-070621-030155 60. Bao X Shen N Lou Y Yu H Wang Y Liu L Enhanced anti-PD-1 therapy in hepatocellular carcinoma by tumor vascular disruption and normalization dependent on combretastatin A4 nanoparticles and DC101 Theranostics 2021 11 5955 69 33897892 10.7150/thno.58164 PMC8058708 ",
  "metadata": {
    "Title of this paper": "Enhanced anti-PD-1 therapy in hepatocellular carcinoma by tumor vascular disruption and normalization dependent on combretastatin A4 nanoparticles and DC101",
    "Journal it was published in:": "Cancer Research",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12485388/"
  }
}