{
  "title": "Paper_450",
  "abstract": "pmc Smart Mol Smart Mol 4751 smmol SMO2 Smart Molecules 2751-4587 2751-4595 Wiley PMC12483135 PMC12483135.1 12483135 12483135 41035517 10.1002/smo2.70014 SMO270014 1 Research Article Research Article A photoactivatable tumor‐targeting in situ nanovaccine for large‐volume tumor therapy Ding Junying  1 Zhao Xueze https://orcid.org/0000-0001-6585-2376  2 Long Saran  1 Sun Wen  1  3 Du Jianjun https://orcid.org/0000-0001-7777-079X  1  3 Fan Jiangli https://orcid.org/0000-0003-4962-5186  1  3 Peng Xiaojun https://orcid.org/0000-0002-8806-322X  1  4 pengxj@dlut.edu.cn   1 State Key Laboratory of Fine Chemicals Frontiers Science Center for Smart Materials Dalian University of Technology Dalian China   2 Department of Chemistry The University of Hong Kong Hong Kong China   3 Ningbo Institute of Dalian University of Technology Ningbo China   4 State Key Laboratory of Fine Chemicals College of Materials Science and Engineering Shenzhen University Shenzhen China * Correspondence pengxj@dlut.edu.cn 19 8 2025 9 2025 3 3 498016 10.1002/smo2.v3.3 e70014 02 7 2025 17 4 2025 10 7 2025 19 08 2025 01 10 2025 02 10 2025 © 2025 The Author(s). Smart Molecules https://creativecommons.org/licenses/by/4.0/ This is an open access article under the terms of the http://creativecommons.org/licenses/by/4.0/ Abstract The clinical application of tumor vaccines is hindered by challenges such as time‐consuming and costly production processes. In this context, in situ cancer vaccines represent a promising strategy by leveraging endogenous tumor antigens to elicit robust antitumor T cell responses. Herein, a photoactivatable tumor‐targeting in situ nanovaccine, Lipo‐D8‐6, was constructed using cRGD‐functionalized liposomes that co‐encapsulated the photosensitizer chlorin e6 and a cleavable immunoadjuvant conjugate D8, allowing light‐triggered synchronous activation of three therapeutic modules. Upon near‐infrared light irradiation, Lipo‐D8‐6 generates reactive oxygen species that exert direct cytotoxicity on tumor cells and induce immunogenic cell death, while concurrently cleaving the responsive linker within D8 to achieve the controlled release of R848. In vivo biodistribution analysis confirmed the superior intratumoral accumulation of Lipo‐D8‐6, facilitating precise treatment. In a large‐volume tumor model, the nanovaccine exhibited pronounced antitumor efficacy, accompanied by enhanced tumor infiltration of CD8 + This study presents a photoactivatable tumor‐targeting in situ nanovaccine Lipo‐D8‐6, which generates ROS to synchronously activate three therapeutic modules, including direct tumor killing effect, ICD induction, and the controlled release of immunoadjuvant, thereby promoting DC maturation. In vivo analysis demonstrates that Lipo‐D8‐6 exhibits high intratumoral accumulation and significantly inhibits large‐volume tumor growth with enhanced CD8 + in situ nanovaccine large‐volume tumor photoactivatable photodynamic immunotherapy tumor‐targeting pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement yes pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes source-schema-version-number 2.0 cover-date September 2025 details-of-publishers-convertor Converter:WILEY_ML3GV2_TO_JATSPMC version:6.6.4 mode:remove_FC converted:29.09.2025  J. Ding X. Zhao S. Long W. Sun J. Du J. Fan X. Peng Smart Mol 2025 3 e70014 10.1002/smo2.70014 1 INTRODUCTION Tumor vaccines, designed to enhance tumor‐specific T cell responses,  [1]  [2]  [3]  [4]  4  5  [6] Photodynamic therapy (PDT) has attracted considerable attention as an effective cancer treatment approach due to its high spatiotemporal precision and minimal invasiveness.  [7]  [8]  [9]  6  10  [11] Accumulating evidence suggests that the strategic incorporation of immunoadjuvants can amplify both the strength and speed of vaccine‐induced immunity.  [12] +  [13]  [14]  [15] To overcome these challenges, this study developed an in situ nanovaccine (Lipo‐D8‐6) based on cRGD‐functionalized liposomes co‐encapsulating the photosensitizer chlorin e6 (Ce6) and a cleavable immunoadjuvant conjugate D8, as illustrated in Figure 1 + FIGURE 1 Schematic illustration of the photoactivatable tumor‐targeting in situ nanovaccine Lipo‐D8‐6. 2 RESULTS AND DISCUSSION 2.1 Synthesis and characterization of lipo‐D8‐6 To construct the Lipo‐D8‐6 nanovaccine, the cleavable immunoadjuvant conjugate D8 was first synthesized and characterized using mass spectrometry (MS) and nuclear magnetic resonance (NMR) spectroscopy (Figures S1−S5  [16] 2a 2b 2c FIGURE 2 (a) The size distribution of Lipo‐D8‐6. (b) The representative transmission electron microscopy image of Lipo‐D8‐6. (c) Stability assay of Lipo‐D8‐6 after incubation with 10% (v/v) fetal bovine serum. (d) Schematic illustration of the responsive behavior of Lipo‐D8‐6. (e) HPLC chromatograms of Lipo‐D8‐6 without light irradiation. (f) The mass spectrometry corresponding to Figure 2e 2g Then, to investigate the photoactivatable drug‐release behavior of Lipo‐D8‐6 (Figure 2d 2 S6 m/z 2e,f + 2g + 2h m/z 2.2 Cell uptake and antitumor efficacy in vitro The cellular uptake of Lipo‐D8‐6 in 4T1 cells was evaluated using confocal laser scanning microscopy (CLSM). As illustrated in Figure 3a S7  [17] 3b FIGURE 3 (a) The cell uptake of Lipo‐D8‐6. (b) reactive oxygen species generation detection of Lipo‐D8‐6 in 4T1 cells with DCFH‐DA. (c) Cell viability of 4T1 cells treated with Lipo‐D8‐6 at different concentrations under dark and light irradiation. (d) Live/death cells imaging of Lipo‐D8‐6 with or without light irradiation. To further evaluate the antitumor efficacy, the cytotoxicity of Lipo‐D8‐6 was determined by MTT assay. As illustrated in Figure 3c 3d 2.3 ICD cascade induction and dendritic cells stimulation in vitro The process of ICD in tumor cells is characterized by the release of DAMPs, including calreticulin (CRT) exposure on the cell membrane, extracellular secretion of high mobility group box 1 (HMGB1) and adenosine triphosphate (ATP) efflux.[  11  18  [19] To evaluate the ICD‐inducing capacity of Lipo‐D8‐6 in tumor cells, immunofluorescence staining was used to assess the surface translocation of CRT and the nuclear release of HMGB1 following various treatment conditions. As shown in Figure 4a S8 4b,c S9 FIGURE 4 (a) CLSM images of calreticulin after different treatments. (b) CLSM images of high mobility group box 1 after different treatments. (c) Extracellular adenosine triphosphate levels after different treatments. (d) Schematic illustration of BMDCs stimulation with a transwell system. (e) Representative flow cytometry plots and (f) statistical analysis of BMDCs maturation after different treatments. BMDCs, bone marrow‐derived dendritic cells; CLSM, confocal laser scanning microscopy. As key antigen‐presenting cells, DCs play a crucial role in initiating antitumor immune responses. To further evaluate the effect of Lipo‐D8‐6–mediated photodynamic immunotherapy on DC maturation, bone marrow‐derived dendritic cells (BMDCs) were cocultured with 4T1 cells subjected to different treatments in a transwell system for 24 h (Figure 4d 4e,f + + 2.4 In vivo fluorescence imaging of lipo‐D8‐6 Given the promising therapeutic efficacy of Lipo‐D8‐6 observed in vitro, orthotopic 4T1 breast tumor‐bearing Balb/c mice were used to evaluate its antitumor performance in vivo. First, the biodistribution of Lipo‐D8‐6 was investigated by fluorescence imaging following intravenous injection. As illustrated in Figure 5a,b 5c 5d FIGURE 5 (a) In vivo fluorescence imaging of tumor‐bearing mice at a series of time points after intravenous injection of Lipo‐D8‐6. (b) Average radiance in tumor sites at different time points. (c) Ex vivo fluorescence imaging of main organs and tumor. (d) Average radiance in main organs and tumor. 2.5 In vivo antitumor efficacy of lipo‐D8‐6 Subsequently, the therapeutic efficacy of Lipo‐D8‐6 was evaluated in a large‐volume orthotopic breast tumor model (initial volume ≈ 300 mm 3 6a 6b,c S10 6e 6d S11 FIGURE 6 (a) Illustration of the treatment schedule for evaluating antitumor effects on the large‐volume tumor model. (b) Photographs of excised tumors in different treatment groups on day 14. (c) Tumor volume growth curves after different treatments. (d) Body weight of mice in different treatment groups. (e) H&E staining images of tumor sections after different treatments. (f) Immunofluorescence staining of calreticulin in tumor tissue sections from different treatment groups. (g) Immunofluorescence staining of CD8 + To elucidate the mechanism underlying the superior therapeutic efficacy, immunofluorescence staining was performed to evaluate CRT exposure and CD8 + 6f,g 3 CONCLUSION To construct an in situ vaccine with high tumor specificity, cRGD‐functionalized liposomes were employed to co‐deliver the photosensitizer Ce6 and the immunoadjuvant conjugate D8, forming the nanovaccine Lipo‐D8‐6 for synergistic therapy. Upon NIR light irradiation, Lipo‐D8‐6 generates ROS that directly kill tumor cells, induce ICD accompanied by the exposure of DAMPs, and trigger the cleavage of the responsive linker to enable the controlled release of R848, thereby promoting DCs maturation. In vivo fluorescence imaging demonstrated that, following intravenous injection, Lipo‐D8‐6 achieved the highest accumulation in tumor tissues compared to other major organs. In the large‐volume tumor model, this nanovaccine exhibited potent antitumor efficacy, as evidenced by marked tumor suppression and increased tumor infiltration of CD8 + CONFLICT OF INTEREST STATEMENT The authors declare no conflicts of interest. ETHICS STATEMENT All animal procedures were performed in accordance with the guidelines for Care and Use of Laboratory Animals of Dalian Medical University and approved by the Dalian University of Technology Animal Care and Use Committee. Supporting information Supporting Information S1 ACKNOWLEDGMENTS This work was financially supported by National Natural Science Foundation of China (22090011), Liaoning Binhai Laboratory (LBLB‐2023‐03), and Fundamental Research Funds for the Central Universities (DUT22LAB608). DATA AVAILABILITY STATEMENT The data that support the findings of this study are available from the corresponding author upon reasonable request. REFERENCES 1 Z. Hu P. A. Ott C. J. Wu Nat. Rev. Immunol. 2017 18 168 29226910 10.1038/nri.2017.131 PMC6508552 2 a) S. A. Rosenberg J. C. Yang N. P. Restifo Nat. Med. 2004 10 909 15340416 10.1038/nm1100 PMC1435696 b) U. Sahin Ö. Türeci Science 2018 359 1355 29567706 10.1126/science.aar7112 c) X. Liang G. Wu R. Chen X. Lin J. Xu W. Sun B. Zhou ACS Appl. Bio Mater. 2025 8 3473 10.1021/acsabm.5c00229 40183216 d) H. Jia J. Liu M. Shi M. Abbas R. Xing X. Yan Smart Mol. 2025 e20240067 3 L. Lybaert S. Lefever B. Fant E. Smits B. De Geest K. Breckpot L. Dirix S. A. Feldman W. van Criekinge K. Thielemans S. H. van der Burg P. A. Ott C. Bogaert Cancer Cell 2023 41 15 36368320 10.1016/j.ccell.2022.10.013 4 G. Yu X. He X. Li Y. Wu Biomed. Pharmacother. 2022 153 113464 36076493 10.1016/j.biopha.2022.113464 5 J. Meng Y. Lv W. Bao Z. Meng S. Wang Y. Wu S. Li Z. Jiao Z. Tian G. Ma W. Wei Nat. Commun. 2023 14 4505 37495590 10.1038/s41467-023-40207-y PMC10372023 6 G. Niu H. Wang Y. Zhai B. Zhou Y. Kang Z. Pei X. Ji Nano Today 2024 56 102286 7 a) T. C. Pham V.‐N. Nguyen Y. Choi S. Lee J. Yoon Chem. Rev. 2021 121 13454 34582186 10.1021/acs.chemrev.1c00381 b) X. Zhao J. Du W. Sun J. Fan X. Peng Acc. Chem. Res. 2024 57 2582 39152945 10.1021/acs.accounts.4c00399 c) D. Ma H. Bian M. Gu L. Wang X. Chen X. Peng Coordin. Chem. Rev. 2024 505 215677 d) H. Bian D. Ma F. Pan X. Zhang K. Xin X. Zhang Y. Yang X. Peng Y. Xiao J. Am. Chem. Soc. 2022 144 22562 36445324 10.1021/jacs.2c08602 8 a) X. Li S. Lee J. Yoon Chem. Soc. Rev. 2018 47 1174 29334090 10.1039/c7cs00594f b) S. Kwiatkowski B. Knap D. Przystupski J. Saczko E. Kedzierska K. Knap‐Czop J. Kotlinska O. Michel K. Kotowski J. Kulbacka Biomed. Pharmacother. 2018 106 1098 30119176 10.1016/j.biopha.2018.07.049 c) H. Kim Y. R. Lee H. Jeong J. Lee X. Wu H. Li J. Yoon Smart Mol. 2023 1 e20220010 40625653 10.1002/smo.20220010 PMC12118215 d) D. Ma H. Bian S. Long P. Zhou R. Tian Y. Wu H. Ge M. Li J. Du J. Fan Y. Zhang X. Peng Sci. China Chem. 2022 65 563 e) H. Bian D. Ma Y. Nan M. H. Kim S. Kim X. Chen X. Peng J. Yoon Coordin. Chem. Rev. 2025 534 216551 9 a) Y. Lu W. Sun J. Du J. Fan X. Peng JACS Au 2023 3 682 37006765 10.1021/jacsau.2c00591 PMC10052235 b) R. Alzeibak T. A. Mishchenko N. Y. Shilyagina I. V. Balalaeva M. V. Vedunova D. V. Krysko J. Immunother. Cancer 2021 9 e001926 33431631 10.1136/jitc-2020-001926 PMC7802670 10 a) L. Tian X. Li L. Guo L. Huang X. Wu W. Gao Coord. Chem. Rev. 2024 517 216027 b) J. Wang J. Ma F. Xie F. Miao L. Lv Y. Huang X. Zhang J. Yu Z. Tai Q. Zhu L. Bao Front. Immunol. 2024 15 1389173 38745666 10.3389/fimmu.2024.1389173 PMC11092378 11 a) Y. Guo R. Ma M. Zhang Y. Cao Z. Zhang W. Yang Vaccines 2023 11 1440 37766117 10.3390/vaccines11091440 PMC10534761 b) S. Zhang J. Wang Z. Kong X. Sun Z. He B. Sun C. Luo J. Sun Biomaterials 2022 282 121433 35202933 10.1016/j.biomaterials.2022.121433 12 a) B. Pulendran P. S. Arunachalam D. T. O'Hagan Nat. Rev. Drug Discov. 2021 20 454 33824489 10.1038/s41573-021-00163-y PMC8023785 b) J. A. Malik G. Kaur J. N. Agrewala Int. J. Biol. Macromol. 2023 253 127252 37802429 10.1016/j.ijbiomac.2023.127252 13 a) T. Zhao Y. Cai Y. Jiang X. He Y. Wei Y. Yu X. Tian Signal. Transduct Target. Ther. 2023 8 283 37468460 10.1038/s41392-023-01557-7 PMC10356842 b) S. Qi X. Zhang X. Yu L. Jin K. Yang Y. Wang Y. Feng J. Lei Z. Mao G. Yu Adv. Mater. 2024 36 e2311574 38433564 10.1002/adma.202311574 c) Z. Li Y. Wang F. Mo T. Wolter R. Hong A. Barrett N. Richmond F. Liu Y. Chen X. Yang L. Dempsey Q. Hu Nat. Nanotechnol. 2025 10.1038/s41565-025-01931-2 PMC12353967 40379868 14 a) X. Xia R. Wang Y. Hu H. Gu W. Sun J. Fan X. Peng Adv. Funct. Mater. 2025 2422823 b) V. N. Nguyen M. V. Nguyen H. Pham Thi A. T. Vu T. X. Nguyen Biomater. Sci. 2025 13 1179 39868556 10.1039/d4bm01457j c) R. Zhang D.‐K. Ji D. Yao Z. Xiao W. Tan CCS Chem. 2024 6 1240 15 S. Bhagchandani J. A. Johnson D. J. Irvine Adv. Drug Deliv. Rev. 2021 175 113803 34058283 10.1016/j.addr.2021.05.013 PMC9003539 16 a) L. Lu M. Yang D. Deng X. Shi J. F. Lovell H. Jin Coord. Chem. Rev. 2025 541 216806 b) S. Sunoqrot S. A. Abdel Gaber R. Abujaber M. Al‐Majawleh S. Talhouni ACS Appl. Bio Mater. 2024 7 4998 10.1021/acsabm.3c00843 38236081 c) X. Wang H. Li C. Chen Z. Liang Smart Mol. 2025 e20240017 17 R. Wang M. He Z. Zhang T. Qiu Y. Xi X. Zeng J. Fan W. Sun X. Peng Smart Mol. 2024 2 e20240010 40625911 10.1002/smo.20240010 PMC12118211 18 X. Wei M. Song G. Jiang M. Liang C. Chen Z. Yang L. Zou Theranostics 2022 12 5272 35910806 10.7150/thno.73566 PMC9330533 19 J. Hua P. Wu L. Gan Z. Zhang J. He L. Zhong Y. Zhao Y. Huang Front. Oncol. 2021 11 738323 34868932 10.3389/fonc.2021.738323 PMC8635494 ",
  "metadata": {
    "Title of this paper": "A photoactivatable tumor‐targeting in situ nanovaccine for large‐volume tumor therapy",
    "Journal it was published in:": "Smart Molecules",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12483135/"
  }
}