{
  "title": "Paper_1145",
  "abstract": "pmc Int J Mol Sci Int J Mol Sci 808 ijms ijms International Journal of Molecular Sciences 1422-0067 Multidisciplinary Digital Publishing Institute  (MDPI) PMC12469775 PMC12469775.1 12469775 12469775 41009407 10.3390/ijms26188838 ijms-26-08838 1 Article Molecular Consequences of CCN6 https://orcid.org/0000-0003-0796-5502 Guven Tasbicen Gulipek Conceptualization Methodology Formal analysis Investigation Data curation Writing – original draft Writing – review & editing Visualization Project administration Funding acquisition 1 2 https://orcid.org/0009-0005-3416-8586 Tufan Ali Formal analysis Investigation Data curation Visualization 2 Savsar Batuhan Investigation Data curation Visualization 2 https://orcid.org/0000-0001-5359-4357 Bulbul Alper Formal analysis Data curation Writing – original draft Visualization 3 https://orcid.org/0000-0002-3448-4395 Tonbul Zeynep Investigation 4 https://orcid.org/0009-0006-4864-7403 Guzel Elif Investigation 2 https://orcid.org/0000-0002-0497-3294 Ayhan Dilay Hazal Writing – review & editing Visualization 4 https://orcid.org/0000-0002-9483-3593 Timucin Ahmet Can Methodology 2 4 https://orcid.org/0000-0003-4360-9310 Onat Umut Inci Methodology Supervision 2 4 Bayram Akcapinar Gunseli Supervision 1 https://orcid.org/0000-0002-8310-4053 Akgun Dogan Ozlem Supervision 5 6 Alanay Yasemin Conceptualization Writing – review & editing Supervision Funding acquisition 5 6 7 * Tahir Turanli Eda Conceptualization Methodology Writing – review & editing Supervision Project administration Funding acquisition 2 4 * Sánchez-De-Diego Cristina Academic Editor 1 gulipek.guven@acibadem.edu.tr gunseli.akcapinar@acibadem.edu.tr 2 ali.tufan1@live.acibadem.edu.tr batuhansavsar.bs@gmail.com elif.guzel@live.acibadem.edu.tr ahmet.timucin@acibadem.edu.tr inci.onat@acibadem.edu.tr 3 abdullah.bulbul@live.acibadem.edu.tr 4 zeynep.tonbul@acibadem.edu.tr dilay.ayhan@acibadem.edu.tr 5 ozlem.dogan@acibadem.edu.tr 6 7 * yasemin.alanay@acibadem.edu.tr eda.turanli@acibadem.edu.tr 11 9 2025 9 2025 26 18 497349 8838 05 8 2025 28 8 2025 01 9 2025 11 09 2025 27 09 2025 29 09 2025 © 2025 by the authors. 2025 https://creativecommons.org/licenses/by/4.0/ Licensee MDPI, Basel, Switzerland. This article is an open access article distributed under the terms and conditions of the Creative Commons Attribution (CC BY) license ( https://creativecommons.org/licenses/by/4.0/ Progressive pseudorheumatoid dysplasia (PPD) is a rare autosomal recessive cartilage disorder caused by biallelic variants in CCN6 CCN6 CCN6 cellular communication network factor 6 ( CCN6 WNT1-inducible signaling pathway protein 3 progressive pseudorheumatoid dysplasia endoplasmic reticulum stress Scientific and Technological Research Council of Türkiye 222S011 Acibadem Mehmet Ali Aydinlar University ABAPKO THD-2024-2170 This work was supported by the Scientific and Technological Research Council of Türkiye (TÜBİTAK) under the 1002-A Short-Term R&D Funding Program (Project No. 222S011), and by the Acibadem Mehmet Ali Aydinlar University Scientific Research Projects Commission (Project No. ABAPKO THD-2024-2170). The APC was funded by Acibadem Mehmet Ali Aydinlar University. pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement yes pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes 1. Introduction Progressive pseudorheumatoid dysplasia (PPD, OMIM: 208230) is a rare autosomal recessive skeletal dysplasia that typically presents in early childhood with joint stiffness, pain, and progressive loss of mobility [ 1 2 3 4 CCN6 3 5 The CCN family consists of six secreted matricellular proteins (CCN1–6), each containing conserved structural domains: an insulin-like growth factor binding protein (IGFBP) motif, a thrombospondin type 1 repeat (TSP1), and a cysteine knot-containing (CTCK) domain. These proteins participate in diverse biological processes by modulating key signaling pathways, including Wnt, bone morphogenetic protein (BMP), transforming growth factor beta (TGF-β), and insulin-like growth factor (IGF) [ 6 7 8 CCN6 3 CCN6 9 10 11 12 13 14 CCN6 14 15 16 CCN6 CCN6 Due to overlapping symptoms, PPD is frequently misdiagnosed as juvenile idiopathic arthritis (JIA) or early-onset osteoarthritis. However, unlike JIA, PPD lacks systemic inflammation; clinical markers such as erythrocyte sedimentation rate (ESR) and C-reactive protein (CRP) typically remain within normal limits [ 17 18 1 2 2 19 CCN6 20 21 NM_198239.2 2 NM_198239.2 22 NM_198239.2 NM_198239.2 Although the variants examined in this study have been clinically reported, their functional consequences have not been systematically explored to date. However, how different CCN6 CCN6 3 9 Animal models have helped to explore CCN6 CCN6 The roles of WISP3 in tumor biology have become increasingly well defined, but its function in chondrocytes and contribution to the pathogenesis of PPD remain insufficiently understood. The present study specifically addresses this gap by investigating how disease-associated WISP3 variants alter chondrocyte function and cartilage homeostasis. We showed that nonsense and missense variants within the IGFBP domain of WISP3 exerted divergent effects on chondrocyte homeostasis, including distinct profiles of redox and ER stress responses, transcriptional remodeling, and protein–protein interactions. These findings prompted a comprehensive variant-level comparison across cellular, transcriptomic, and proteomic dimensions to elucidate potential mechanisms underlying PPD pathogenesis. 2. Results 2.1. Stability Analyses of IGFBP N-Terminal Domain Variants of WISP3: WISP3 only has a single AlphaFold predicted structure in the literature as presented in Figure 1 Figure 1 Table 1 23 Table 1 2.2. Verification of Plasmid Constructs The molecular consequences of PPD-associated CCN6 Figure 1 Figure S1 Expression of exogenous CCN6 Figure 2 CCN6 ACTB CCN6 Figure 2 WISP3 protein expression was further assessed by Western blotting using an anti-HA antibody targeting the N-terminal HA tag present in all constructs. A distinct band at approximately 41 kDa, corresponding to the full-length WISP3 protein, was observed in cells transfected with the wild-type, p.Gly83Glu, and p.Cys114Trp constructs ( Figure 2 Figure 1 2.3. Migration and Viability of Chondrocytes Following WISP3 Variant Expression WISP3 is known to inhibit migration and the p.Cys52* variant has been shown to reduce cell viability [ 24 Figure 3 CCN Cell viability was assessed at 48 h post-transfection using the MTT assay. Absorbance at 570 nm was measured for each replicate, and the experiments were repeated eight times; the median value per group was used to represent metabolic activity, minimizing the influence of biological variation and outliers. The overexpression group exhibited the lowest metabolic activity (median = 0.667), followed by p.Cys52* (0.674) and p.Cys114Trp (0.676). The p.Tyr109* and p.Gly83Glu variants showed relatively higher activity (0.702 and 0.726, respectively), while the control group displayed the highest viability (0.868) ( Figure 3 CCN6 Figure S2 CCN6 CCN6 2.4. Adhesion and Matrix Remodeling Properties of Chondrocytes Expressing WISP3 Variants WISP3’s main function in chondrocytes is thought to regulate ECM features [ 25 Figure 4 Matrix metalloproteinases (MMPs) are responsible for tissue remodeling and the degradation of the ECM, thereby playing a central role in maintaining ECM homeostasis [ 26 CCN6 Figure 4 CCN6 2.5. Mitochondrial Redox Imbalance, ER Stress Marker Expression, and Subcellular Localization of WISP3 Variants The loss of WISP3 function correlates with elevated levels of intracellular ROS and stress responses in human chondrocytes [ 9 CCN6 Figure 5 27 28 29 Figure 5 Figure 5 Supplementary Figure S3 Endoplasmic reticulum (ER) stress has been associated with chondrocyte dysfunction in the context of genetic skeletal disorders and ECM-related protein misfolding [ 30 31 CHOP XBP1 s/uXBP1 32 Compared to the control group (considered as 1.00 ± 0.10-fold), the p.Cys114Trp exhibits the highest increase in both CHOP s/uXBP1 CHOP s/uXBP1 CHOP s/uXBP1 s/uXBP1 CHOP CHOP s/uXBP1 Figure 5 CHOP s/uXBP1 The CHOP/sXBP1 sXBP1 CHOP 33 CHOP/sXBP1 Figure 5 The impact of disease-associated CCN6 Figure 6 34 Figure 6 2.6. Whole Transcriptome Profiling Reveals Variant-Specific Enrichment of ER Stress, Apoptosis, and Cytoskeletal Pathways To investigate how nonsense or missense variants influence transcriptomic responses, RNA-seq analysis was conducted using human chondrocytes transfected with overexpression vectors encoding WT (OE), p.Cys52*, or p.Cys114Trp. Total RNA was extracted from the transfected chondrocyte cells, and libraries of two biological replicates were sequenced using the Illumina NovaSeq 6000 platform. The reads that passed quality filtering were used for the downstream analyses. Sample correlations ( Figure S4A 2 Figure S4B Figure 7 Biological process gene ontology (GO) enrichment analysis of these differentially expressed genes (DEGs) revealed that both variants were associated with downregulation in cytoskeleton organization, as well as upregulation in response to stress and cellular response to stress terms. Moreover, p.Cys114Trp showed pathway enrichment ( p CCN6 Figure 7 35 Figure 7 Furthermore, genes such as HSPA5 HERPUD1 DDIT3 KLF4 PLCG2 2.7. Protein–Protein Interaction Profiling of Wild-Type and Disease-Associated WISP3 To understand the variant-dependent protein–protein interactions of WISP3, interactomes were analyzed by expressing HA-tagged wild-type, p.Tyr109*, and p.Cys114Trp constructs in chondrocyte cell lines. p.Cys114Trp variant was picked for easy comparison with RNA-seq analysis, while p.Tyr109* was picked because the other nonsense variant showed no protein expression ( Figure 2 Comparative proteomic analysis identified both shared and variant-specific interactors ( Figure 8 Protein–protein interaction network mapping ( Figure 8 Figure S5 Functional classification of interactors revealed associations with cytoskeletal organization, intracellular trafficking, endoplasmic reticulum (ER)-related processes, ribosomal activity, chromatin remodeling, mitochondrial function, stress responses, the unfolded protein response (UPR), apoptosis, and WNT signaling. Cytoskeletal proteins were consistently observed across all groups, indicating partial preservation of structural associations. ER and UPR-related proteins were more frequently detected in the variant groups, whereas their representation was limited in the wild-type condition. Ribosomal proteins were commonly identified in both wild-type and p.Cys114Trp groups, while histone-associated proteins were more prominent in the p.Tyr109* variant. Several interactors overlapped with differentially expressed transcripts from the RNA-seq dataset, including TUBB1A, TUBB2A, TUBB2B, POTEF, and POTEI. Additionally, multifunctional proteins such as CALM1–3, HSPB1, NACA, ACTB, MYH9, and CKAP4 were assigned to multiple functional categories, reflecting their involvement in both structural maintenance and stress adaptation. Collectively, these findings suggest that the p.Tyr109* variant is associated with a loss of interaction capacity, whereas the p.Cys114Trp variant promotes a broader and structurally reorganized interaction profile. 3. Discussion 3.1. Variant-Specific Destabilization of WISP3 in Chondrocytes via NMD or Structural Disruption In this study, we functionally assessed four CCN6 36 37 38 The substantial destabilization predicted for the p.Cys114Trp variant aligns with its impaired functional behavior observed experimentally, as well as with its classification as pathogenic in clinical databases. In contrast, the p.Gly83Glu variant was associated with only a mild destabilizing effect. Large ΔΔG values exceeding +40 kcal/mol—such as those predicted for p.Cys114Trp—are unusual but not unprecedented. For example, β amino acid enzyme variants G165M and E391K yielded theoretical ΔΔG values of approximately +54 and +43 kcal/mol, respectively, despite FoldX’s standard error margins being only around ±0.85–1.7 kcal/mol [ 39 40 41 42 43 23 3.2. Truncating and Missense Variants Within the IGFBP Domain of WISP3 Impair Chondrocyte Function via Domain Loss or Disruption Based on the viability results, elevated expression of CCN6 CCN6 44 45 CCN6 46 Then, we evaluated how WISP3 variants influence dynamic cellular processes such as migration and matrix remodeling. Given the limited regenerative capacity of cartilage tissue, effective cell migration and wound closure are critical for maintaining matrix homeostasis and joint function. Previous studies have shown that WISP3 suppresses Wnt/β-catenin signaling and that this pathway negatively regulates cell migration [ 24 47 Previous studies have also suggested that WISP3, upon secretion, may act as a ligand transmitting autocrine or paracrine signals, interacting with IGF-1 via its IGFBP domain and suppressing Wnt/β-catenin signaling [ 11 48 Under non-inflammatory conditions, MMP-13 transcription is primarily regulated by homeostatic signaling pathways such as Wnt/β-catenin and TGF-β/SMAD3 [ 17 18 47 49 50 51 52 53 54 55 56 57 WISP3 is also thought to influence cartilage homeostasis by regulating chondrocyte adhesion to ECM components. In adhesion assays, cells expressing full-length WISP3 adhered more strongly to collagen-coated surfaces compared to the control group. In contrast, cells expressing nonsense variants showed reduced adhesion, likely due to the absence of the TSP1 and CTCK domains, which mediate interactions with various ECM components such as collagens, fibronectin, laminin, and integrins [ 5 58 3.3. WISP3 Variants Differentially Disrupt ER Stress Responses and Mitochondrial Redox Homeostasis in Chondrocytes Reactive oxygen species (ROS) are key regulators of chondrocyte homeostasis, and their accumulation contributes to cartilage degeneration in various skeletal pathologies [ 59 9 10 60 61 Given the association between mitochondrial dysfunction and endoplasmic reticulum (ER) stress, we investigated whether CCN6 31 62 63 CHOP s/uXBP1 WISP3 variants modulated the direction and magnitude of the UPR in chondrocytes in a variant-specific manner. The missense variants p.Gly83Glu and p.Cys114Trp were associated with elevated s/uXBP1 CHOP CHOP CHOP/sXBP1 CHOP 62 CHOP Subsequently, we assessed the subcellular localization of WISP3 by performing co-localization analysis using TOM20 as a mitochondrial marker. Previous studies have reported mitochondrial localization of WISP3 in human chondrocytes, and our findings are consistent with these observations [ 9 The elevated mitochondrial superoxide levels observed in cells expressing p.Tyr109* and p.Cys114Trp suggest enhanced oxidative stress. In contrast to the wild-type variant, these variants showed increased mitochondrial localization, and such accumulation is predicted to impair mitochondrial proteostasis and interfere with the organelle’s protein-handling capacity. Mislocalized proteins within mitochondria are well established to promote ROS production, thereby reinforcing oxidative stress and activating the UPR [ 64 These findings demonstrate that WISP3 variants disrupt redox balance, ER stress response, and subcellular localization in a variant-specific manner. The p.Tyr109* and p.Cys114Trp variants appear to impair ER–mitochondrial communication and compromise chondrocyte homeostasis through increased mitochondrial superoxide, UPR activation, and abnormal mitochondrial accumulation. In contrast, the p.Cys52* variant exhibited limited effects, likely reflecting loss of function due to the absence of protein. This integrative analysis underscores the role of WISP3 in maintaining intracellular stress balance and its contribution to the pathogenesis of PPD. Transcriptional differences between wild-type or disease-associated WISP3 variants were evaluated through transcriptomic profiling. Compared with wild-type WISP3, cells expressing p.Cys52* or p.Cys114Trp displayed distinct gene expression changes. In both cases, the number of downregulated genes exceeded that of upregulated genes by 1.76- and 1.78-fold, respectively, indicating a general trend toward transcriptional suppression. Enrichment analysis revealed that these changes were largely variant-specific. While wild-type WISP3 expression promoted genes involved in cytoskeletal organization and ER-directed protein trafficking, these pathways were suppressed in cells expressing the variants. These findings suggest that the structural and trafficking functions of WISP3 are disrupted in a variant-dependent manner. According to the gene–pathway analysis ( Figure 7 The p.Cys114Trp variant induced widespread transcriptional activation of genes associated with ER stress, the UPR, and programmed cell death. Among the upregulated transcripts were key ER chaperones such as HSPA5 DNAJB9 HERPUD1 65 66 67 DDIT3 (CHOP) ATF3 68 69 PLCG2 KLF4 70 71 In contrast, p.Cys52* resulted in a weaker transcriptional response without clear activation of canonical stress pathways, likely due to the absence of functional protein. Among the upregulated genes, only CSNK1A1L ANP32CP NME2P1 CSNK1A1L ANP32CP NME2P1 72 73 74 3.4. Variant-Specific Disruption of WISP3 Interactome Reveals Divergent Stress Adaptation and Cytoskeletal Dysregulation Mechanisms in PPD We performed proteomic mapping to identify intracellular interaction partners of WISP3 and to assess how disease-associated variants alter this interaction landscape. The full-length wild-type WISP3 protein was compared with the structurally destabilized missense variant p.Cys114Trp and the truncated isoform p.Tyr109*, which, despite harboring a PTC, is translationally expressed. The analysis revealed markedly different effects of the two WISP3 variants on the protein’s interaction profile. The p.Tyr109* variant, which yields a truncated isoform, led to a substantial reduction in the number of WISP3-associated proteins. This finding highlights the critical role of the C-terminal domains in mediating protein–protein interactions and maintaining the integrity of the WISP3 interactome. In contrast, despite its structural instability, the p.Cys114Trp variant exhibited a broader range of interactions compared with the wild-type protein. This increase may reflect a compensatory mechanism, possibly arising from conformational alterations or intracellular dysfunction. Together, these findings suggest that structural disruption reshapes WISP3’s molecular interactions and may underlie variant-specific pathological mechanisms. In both transcriptomic and proteomic datasets, several cytoskeletal proteins—including ACTBM, TUBB1A, TUBB2A, TUBB2B, POTEF, and POTEI—were identified as interaction partners regardless of WISP3 variant. The beta-tubulin isoforms contribute to microtubule organization, while POTEF and POTEI are involved in ATP/protein/nucleotide binding and the regulation of cellular components [ 75 75 In contrast to these shared cytoskeletal interactions, LIMA1, which supports cell–cell adhesion and stabilizes the actin cytoskeleton through its interaction with adhesion complexes, was detected exclusively in the interactome of wild-type WISP3 [ 76 77 Calmodulin is a calcium-binding protein that plays critical roles in chondrogenesis and intracellular signaling [ 78 79 2+ 2+ 9 80 Among the proteins identified, CKAP4 stood out as a notable interactor of WISP3. Previous studies have shown that CKAP4 interacts with DKK1 to form the DKK1–CKAP4–LRP5/6 complex, which suppresses Wnt signaling while simultaneously activating the PI3K/AKT pathway [ 81 47 Beyond its role in intracellular signal transduction, CKAP4 is also involved in maintaining ER homeostasis [ 82 83 Detection of DDX5 and DDX17, specifically in association with the p.Cys114Trp variant, suggests that this WISP3 isoform may engage in novel and potentially pathogenic intracellular interactions. DDX5 expression has been associated with the regulation of ER stress and autophagy, while both DDX5 and DDX17 are known to modulate Wnt/β-catenin signaling pathways [ 84 85 Lastly, HSPB1 functions as an ATP-independent chaperone that binds misfolded proteins, preventing aggregation and proteotoxic stress [ 86 87 88 Our findings suggest that the absence of WISP3 or the presence of structurally unstable variants can disrupt chondrocyte function through distinct mechanisms, thereby contributing to the pathogenesis of PPD. While the type of disruption varies, complete loss of the protein versus production of misfolded or unstable forms triggering different cellular responses, these heterogeneous mechanisms appear to converge on shared downstream consequences. Rather than acting through a single signaling axis, WISP3 appears to function as a multifaceted regulator involved in maintaining intracellular homeostasis, skeletal organization, and cytoskeletal integrity. This is consistent with its extensive interactome network and its previously suggested role as a ligand transmitting autocrine or paracrine signals, which may provide a unifying explanation for how diverse molecular perturbations can give rise to overlapping clinical phenotypes. PPD is a rare disease that is often diagnosed late in childhood; therefore, variant-specific molecular differences may exist at earlier stages, but as the disease progresses, disruption of cartilage structure may become the dominant factor, potentially leading to overlapping clinical outcomes. The observed alterations point toward dysregulation of the Wnt/β-catenin pathway as a central contributor, and our results offer new insights into the complexity of this regulatory network. Therefore, understanding the effects of specific variants, as highlighted in our study, may help inform the development of alternative therapeutic strategies when the disease is diagnosed at earlier stages. This study has several limitations. The number of biological replicates in RNA-seq and LC-MS/MS analyses was limited due to budgetary constraints, reducing statistical power. In addition, reliance on an overexpression model may not fully reflect physiological regulation or variant-specific effects. Future studies with larger sample sizes and CRISPR/Cas9-edited cell lines, the development of organoid models, and in vivo validation will be essential to strengthen these findings and clarify the pathogenic consequences of WISP3 dysfunction. While patient-derived cells would provide valuable translational insight, obtaining primary chondrocytes is technically challenging and not a routine procedure, which limits their accessibility for research purposes. Nevertheless, the integration of structural predictions, functional assays, and omics profiling provides a broad and coherent experimental framework that captures distinct aspects of WISP3 dysfunction. The combination of these complementary approaches enables a more complete view of how different variants alter cellular stress responses, redox balance, and extracellular matrix regulation. In doing so, this work offers a depth of mechanistic understanding that is rarely achieved in rare skeletal disorders and establishes a foundation that can inform both future research and potential translational applications. Nevertheless, the integration of structural predictions, functional assays, and omics profiling provides a broad and coherent experimental framework that captures distinct aspects of WISP3 dysfunction. The combination of these complementary approaches enables a more complete view of how different variants alter cellular stress responses, redox balance, and extracellular matrix regulation. In doing so, this work offers a depth of understanding that is rarely achieved in rare skeletal disorders and establishes a foundation that can inform both future research and potential translational applications. Further studies are warranted to fully elucidate the molecular landscape shaped by WISP3 dysfunction in skeletal disease. 4. Materials and Methods 4.1. Cell Culture Experiments Human chondrocytes (Cat. No. 402-05A, Cell Applications, Inc., San Diego, CA, USA) were cultured in high-glucose Dulbecco’s Modified Eagle Medium (DMEM) (Cat. No. 11965092, Gibco, Waltham, MA, USA) supplemented with 10% fetal bovine serum (FBS) (Cat. No. 10270106, Gibco, Waltham, MA, USA) and 1% penicillin–streptomycin (Cat. No. 15140122, Gibco, Waltham, MA, USA) at 37 °C in a humidified incubator with 5% CO 2 5 44 4.2. Protein Structure and Prediction of Protein Stability Using the only AlphaFold predicted structure of WISP3 (AF- O95389 23 89 4.3. Variant Construct Generation Site-directed mutagenesis was employed to generate CCN6 WISP3 http://www.bioinformatics.org/primerx Table 2 Following amplification, polymerase chain reaction (PCR) products were incubated with DpnI E. coli 4.4. MTT Assay Human chondrocytes (5 × 10 4 4.5. Adhesion Assay 96-well plates were coated with 50 μg/mL human type I collagen (Cat. No. 07005, Stemcell Technologies, Vancouver, BC, Canada) for 1 h at room temperature. Wells were washed twice with phosphate-buffered saline (PBS) and blocked with 1% bovine serum albumin (BSA) (Cat. No. BSA-1S, Capricorn Scientific, Ebsdorfergrund, Germany) for 60 min at 37 °C. After a final PBS wash, 10 × 10 4 90 4.6. Migration and Wound Healing Assay 24 h after transfection, 1 × 10 5 4.7. RNA Isolation and Quantitative PCR Total RNA was obtained from cells using TRIzol Reagent (Cat. No. 15596026, Thermo Fisher Scientific, Waltham, MA, USA), following the manufacturer’s guidelines. For complementary DNA (cDNA) synthesis, 500 ng of total RNA was reverse-transcribed using the SensiFAST cDNA Synthesis Kit (Cat. No. BIO-65053, Cincinnati, OH, USA) according to the manufacturer’s instructions. qPCR was performed on a LightCycler 96 System (Roche, Mannheim, Germany) using the SensiFAST SYBR No-ROX Kit (Cat. No. BIO-98005, Meridian Bioscience, Cincinnati, OH, USA). The reaction was carried out in a 10 µL volume with 50 ng of cDNA and 0.4 µM of each primer. The amplification protocol included an initial denaturation at 95 °C for 120 s, followed by 40 cycles of 95 °C for 5 s, 60 °C for 10 s, and 72 °C for 15 s. At the end of the analysis, melting curve analysis was included to confirm the specificity of the amplifications. Relative gene expression levels were calculated using the 2 −ΔΔCt (ACTB) 91 Table 3 4.8. Gelatin Zymography Gelatinase assessment was performed using 12.5% SDS-PAGE gels containing 1 mg/mL gelatin (Cat. No. G2500, Sigma-Aldrich, Waltham, MA, USA). Post-transfection, 10 μg of serum-free supernatants were mixed with 5× non-reducing loading dye (0.01% bromophenol blue, 4% SDS, 125 mM Tris-HCl (pH 6.8), 20% glycerol) and electrophoresed at 4 °C until the dye front reached the bottom of the gel. Following electrophoresis, gels were washed in a solution of 2.5% Triton X-100 in 50 mM Tris–HCl (pH 7.5), 5 µM CaCl 2 2 2 2 92 4.9. Flow Cytometry Forty-eight hours from transfection, cells were co-stained with MitoTracker Green FM (Cat. No. 9074, Cell Signaling Technologies, Danvers, MA, USA) at a final concentration of 250 nM and MitoSOX Red mitochondrial superoxide indicator (Cat. No. C259, ABP Biosciences, Rockville, MD, USA) at 2.5 µM. Staining was performed in serum-free DMEM at 37 °C for 20 min in the dark. Then, cells were washed with PBS and collected using 0.25% trypsin-EDTA, neutralized with DPBS, and centrifuged at 300× g 4.10. Confocal Microscopy For immunofluorescence imaging, cells were seeded on 0.1% gelatin-coated coverslips one day after transfection and allowed to adhere overnight. The following day, cells were fixed in 4% paraformaldehyde (PFA) and permeabilized with 0.1% Triton X-100 in PBS. Blocking was performed using 5% normal goat serum (Cat. No. G-1B, Capricorn Scientific, Ebsdorfergrund, Germany). Cells were incubated overnight at 4 °C with 1:1200 anti-HA (Cat. No. 66006-2-Ig, Proteintech, Rosemont, IL, USA) and 1:400 anti-TOM20 (Cat. No. 11802-1-AP, Proteintech, Rosemont, IL, USA). After PBST washes, 1:1000 Alexa Fluor 488-conjugated (Cat. No. 4412, Cell Signaling Technology, Danvers, MA, USA) and 1:400 CoraLite 594-conjugated (Cat. No. SA00013-3, Proteintech, Rosemont, IL, USA) were used as secondary antibodies. Nuclei were counterstained with 300 nm DAPI (Cat. No. 14285, Cayman Chemical, Ann Arbor, MI, USA). Confocal images were acquired using a Zeiss LSM 700 microscope. Z-projected stacks (maximum intensity) were analyzed in ImageJ (version v1.54p, NIH, USA) using the BIOP JaCoP plugin (version v1.2.0) [ 93 4.11. Western Blot Total cellular proteins were isolated using radioimmunoprecipitation assay buffer (RIPA) (Cat. No. 89901, Thermo Fisher Scientific, Waltham, MA, USA) supplemented with protease inhibitors (Cat. No. AR1182, Boster Bio, Pleasanton, CA, USA) and protein concentration was quantified using the Pierce BCA Protein Assay Kit (Cat. No. 23227, Thermo Fisher Scientific, Waltham, MA, USA), according to the manufacturer’s instructions. 20 µg of protein samples were separated by 4–12–15% SDS-PAGE and transferred onto 0.22 µm polyvinylidene difluoride (PVDF) membranes (Cat. No. 88520, Thermo Fisher Scientific, Waltham, MA, USA). Membranes were blocked for 1 h at room temperature in 0.05% TBS-T containing 5% BSA (Cat. No. BSA-1S, Capricorn Scientific, Ebsdorfergrund, Germany). Primary antibody incubation was performed overnight at 4 °C using antibodies diluted in blocking buffer: 1:4000 anti-HA (Cat. No. 51064-2-AP, Proteintech, Rosemont, IL, USA) and 1:2000 β-Tubulin (Cat. No. A12289, Abclonal, Woburn, MA, USA). The next day, membranes were incubated for 1 h at room temperature with 1:5000 horseradish peroxidase (HRP)-conjugated anti-rabbit IgG(H+L) secondary antibody (Cat. No. AS014, Abclonal, Woburn, MA, USA). Membranes were visualized using a chemiluminescence (ECL) substrate kit (Cat. No. 1705060, Bio-Rad, Hercules, CA, USA) and imaged using the ChemiDoc Imaging System with Image Lab software (Bio-Rad, Hercules, CA, USA). The assay was performed using three biological replicates. 4.12. RNA-Seq Quantification, Differential Gene Expression, and Enrichment Analysis Total RNA was extracted from CCN6 (OE) CCN6 94 95 Genes were retained only when they reached ≥1 CPM (Counts per million) (≈10 raw reads) in at least the two samples comprising the smallest genotype group and were detectable at this threshold in ≥70% of samples within every group. After which gene-level counts were analyzed with edgeR’s quasi-likelihood pipeline (v4.0.16), tag-wise dispersions were estimated while accounting for biological replicate structure, differential expression was assessed by contrasting each variant genotype separately against the wild-type reference, and adjusted p 96 97 98 99 100 4.13. Co-Immunoprecipitation and LC–MS/MS Analysis Human chondrocytes were transfected with plasmids encoding HA-tagged wild-type WISP3 (OE), p.Tyr109, or p.Cys114Trp variants, each represented by two independent biological replicates. After transfection, co-immunoprecipitation was performed using the Pierce Direct Magnetic IP/Co-IP Kit (Cat. No. 88828, Thermo Fisher Scientific, Waltham, MA, USA), following the manufacturer’s instructions. For immunoprecipitation, 1 mg of total protein lysate was incubated with 5 μg of mouse monoclonal anti-HA antibody (Cat. No. 66006-2-Ig, Proteintech, Rosemont, IL, USA) covalently coupled to magnetic beads via NHS-activated chemistry. Binding was performed at room temperature under gentle rotation. After extensive washing to remove non-specific proteins, IP complexes were eluted using the provided elution buffer supplemented with 10% neutralization buffer. Protein extraction was performed using the UPX Protein Extraction Kit (Cat. No. ab270054, Abcam, Waltham, MA, USA). Samples were diluted and homogenized according to the manufacturer’s instructions. Denaturation was achieved by heating the samples at 95 °C for 5 min. The denatured samples were then transferred to 30 kDa molecular weight cut-off FASP columns (Cat. No. MRCFOR30, Merck, Darmstadt, Germany). Alkylation was performed by adding 400 mM iodoacetamide to the columns, followed by incubation in the dark at room temperature for 20 min. After alkylation, the columns were washed three times with 8 M urea and subsequently three times with 50 mM ammonium bicarbonate to remove any residual reagents and urea. Protein digestion was carried out by adding 1 µg of trypsin (Cat. No. 90057, Thermo Scientific, Waltham, MA, USA) to each sample, followed by overnight incubation at 37 °C. After digestion, peptides were recovered by sequential elution: two washes with 50 mM ammonium bicarbonate and one wash with 500 mM sodium chloride. The resulting peptide-containing eluates were collected, and peptide concentrations were quantified using the Pierce Quantitative Colorimetric Peptide Assay (Cat. No. 23275, Thermo Scientific, Waltham, MA, USA) following the manufacturer’s protocol. NanoLC–MS/MS analysis was conducted using an ACQUITY UPLC M-Class system coupled to a Xevo G2-XS Q-Tof mass spectrometer (Waters, Milford, MA, USA). Peptide mixtures were initially loaded onto a trap column (Symmetry C18, 5 µm, 180 µm i.d. × 20 mm) at a flow rate of 3 µL/min for 2 min using 5% mobile phase B (acetonitrile containing 0.1% formic acid). Mobile phase A consisted of water with 0.1% formic acid. The separation of peptides was then performed on a CSH C18 column (1.7 µm, 75 µm i.d. × 250 mm), maintained at 45 °C with a flow rate of 0.3 µL/min. Chromatographic separation was achieved with a 120 min run time, including a 90 min linear gradient from 5% to 45% acetonitrile. Eluted peptides were detected by UV absorbance at 214 nm prior to mass spectrometric analysis. The mass spectrometer was equipped with an electrospray ionization (ESI) source operating in positive ion mode, employing a data-independent acquisition (DIA) method in sensitivity mode. The scan range was m z m z Data were processed using Progenesis QI for Proteomics software (v4.1) with the reviewed UniProt database (release date: 18 June 2025, UniProtKB 2025_03). Peak intensity thresholds were set to 150 counts for low-energy and 50 counts for high-energy conditions. Search parameters required a minimum of 3 fragment ion matches per peptide, 7 fragment ion matches per protein, and at least 1 unique peptide per protein. The maximum number of allowed missed cleavages for tryptic digestion was 1. Carbamidomethylation of cysteine was specified as a fixed modification, while oxidation of methionine and deamidation of asparagine/glutamine were set as variable modifications. Label-free quantitative proteomics data from two biological replicates per condition (p.Tyr109* or p.Cys114Trp vs. WT) were analyzed using the DEP v1.28.0 package in R, which incorporates the limma framework for differential expression analysis. Protein intensity data were cleaned, log 2 2 101 Protein interaction networks for wild-type WISP3 (OE) and two variants (p.Tyr109* and p.Cys114Trp) were constructed using interactor lists derived from co-immunoprecipitation mass spectrometry. Interactors unique to each condition and shared across combinations were compiled. A graph-based network was built using tidygraph v1.3.1 and visualized with ggraph v2.2.1 in R [ 102 103 103 104 4.14. Statistical Analysis Statistical analyses were executed in Python 3.12 (NumPy 1.26, SciPy 1.13) [ 105 −ΔΔCt ACTB 91 106 p p p p p 5. Conclusions This study presents the first functional characterization of four CCN6 Acknowledgments The authors thank Tolga Sutlu (Acıbadem Mehmet Ali Aydinlar University, Istanbul, Türkiye) for his assistance with flow cytometry experiments. Disclaimer/Publisher’s Note: Supplementary Materials The following supporting information can be downloaded at https://www.mdpi.com/article/10.3390/ijms26188838/s1 Author Contributions Writing—original draft, G.G.T. and A.B.; visualization, G.G.T., A.T., B.S., A.B. and D.H.A.; supervision, U.I.O., E.T.T., Y.A., O.A.D. and G.B.A.; project administration, G.G.T. and E.T.T.; methodology, G.G.T., A.C.T., U.I.O. and E.T.T.; investigation, G.G.T., A.T., Z.T., E.G. and B.S.; data curation, G.G.T., A.T., B.S. and A.B.; formal analysis, A.B., A.T. and G.G.T.; funding acquisition, G.G.T., E.T.T. and Y.A.; conceptualization, G.G.T., E.T.T. and Y.A.; writing—review and editing, G.G.T., D.H.A., E.T.T. and Y.A. All authors have read and agreed to the published version of the manuscript. Institutional Review Board Statement Not applicable. Informed Consent Statement Not applicable. Data Availability Statement Raw and processed RNA sequencing data have been deposited in the NCBI Sequence Read Archive (SRA; BioProject: PRJNA1300445) and Gene Expression Omnibus (GEO; accession: GSE304437) databases. Conflicts of Interest The authors declare no conflicts of interest. Abbreviations The following abbreviations are used in this manuscript: PPD Progressive pseudorheumatoid dysplasia OMIM Online Mendelian Inheritance in Man CCN6 Cellular Communication Network Factor 6 WISP3 Wnt1-inducible-signaling pathway protein 3 JIA Juvenile idiopathic arthritis ESR Erythrocyte Sedimentation Rate CRP C-Reactive Protein ECM Extracellular Matrix IGFBP Insulin-like Growth Factor Binding Protein TSP1 Thrombospondin Type 1 Repeat CTCK Cysteine Knot-Containing Domain Wnt Wingless/Integrated TGF-β Transforming Growth Factor Beta CHOP C/EBP Homologous Protein sXBP1 Spliced X-box Binding Protein 1 uXBP1 Unspliced X-box Binding Protein 1 MMP Matrix Metalloproteinase References 1. Hurvitz J.R. Suwairi W.M. Van Hul W. El-Shanti H. Superti-Furga A. Roudier J. Holderbaum D. Pauli R.M. Herd J.K. Hul E.V. Mutations in the CCN Gene Family Member WISP3 Cause Progressive Pseudorheumatoid Dysplasia Nat. Genet. 1999 23 94 98 10.1038/12699 10471507 2. Garcia Segarra N. Mittaz L. Campos-Xavier A.B. Bartels C.F. Tuysuz B. Alanay Y. Cimaz R. Cormier-Daire V. Di Rocco M. Duba H. The Diagnostic Challenge of Progressive Pseudorheumatoid Dysplasia (PPRD): A Review of Clinical Features, Radiographic Features, and WISP3 Am. J. Med. Genet. C Semin. Med. Genet. 2012 160C 217 229 10.1002/ajmg.c.31333 22791401 3. Sen M. Cheng Y. Goldring M.B. Lotz M.K. Carson D.A. WISP3-dependent Regulation of Type II Collagen and Aggrecan Production in Chondrocytes Arthritis Rheum. 2004 50 488 497 10.1002/art.20005 14872491 4. Sophia Fox A.J. Bedi A. Rodeo S.A. The Basic Science of Articular Cartilage: Structure, Composition, and Function Sports Health Multidiscip. Approach 2009 1 461 468 10.1177/1941738109350438 PMC3445147 23015907 5. Yu Y. Hu M. Xing X. Li F. Song Y. Luo Y. Ma H. Identification of a Mutation in the WISP3 Gene in Three Unrelated Families with Progressive Pseudorheumatoid Dysplasia Mol. Med. Rep. 2015 12 419 425 10.3892/mmr.2015.3430 25738435 6. Perbal B. CCN Proteins: Multifunctional Signalling Regulators Lancet 2004 363 62 64 10.1016/S0140-6736(03)15172-0 14723997 7. Jun J.-I. Lau L.F. Taking Aim at the Extracellular Matrix: CCN Proteins as Emerging Therapeutic Targets Nat. Rev. Drug Discov. 2011 10 945 963 10.1038/nrd3599 22129992 PMC3663145 8. Holbourn K.P. Acharya K.R. Perbal B. The CCN Family of Proteins: Structure–Function Relationships Trends Biochem. Sci. 2008 33 461 473 10.1016/j.tibs.2008.07.006 18789696 PMC2683937 9. Patra M. Mahata S.K. Padhan D.K. Sen M. CCN6 J. Cell Sci. 2016 129 2841 2851 10.1242/jcs.186247 27252383 10. Miller D.S. Sen M. Potential Role of WISP3 ( CCN6 Biochem. Biophys. Res. Commun. 2007 355 156 161 10.1016/j.bbrc.2007.01.114 17286957 11. Davis L. Chen Y. Sen M. WISP-3 Functions as a Ligand and Promotes Superoxide Dismutase Activity Biochem. Biophys. Res. Commun. 2006 342 259 265 10.1016/j.bbrc.2006.01.132 16480948 12. Rao R.S. Patra M. Sen M. WISP3-IGF1 Interaction Regulates Chondrocyte Hypertrophy J. Cell Sci. 2013 126 1650 1658 10.1242/jcs.119859 23424195 13. Kleer C.G. Zhang Y. Pan Q. Van Golen K.L. Wu Z.-F. Livant D. Merajver S.D. WISP3 Is a Novel Tumor Suppressor Gene of Inflammatory Breast Cancer Oncogene 2002 21 3172 3180 10.1038/sj.onc.1205462 12082632 14. Huang W. Martin E.E. Burman B. Gonzalez M.E. Kleer C.G. The Matricellular Protein CCN6 (WISP3) Decreases Notch1 and Suppresses Breast Cancer Initiating Cells Oncotarget 2016 7 25180 25193 10.18632/oncotarget.7734 26933820 PMC5041896 15. Nam M.-W. Lee H.K. Kim C.-W. Choi Y. Ahn D. Go R.-E. Choi K.-C. Effects of CCN6 Biomed. Pharmacother. 2023 163 114780 10.1016/j.biopha.2023.114780 37105075 16. Tran M.N. Kleer C.G. Matricellular CCN6 (WISP3) Protein: A Tumor Suppressor for Mammary Metaplastic Carcinomas J. Cell Commun. Signal. 2018 12 13 19 10.1007/s12079-018-0451-9 29357008 PMC5842205 17. Ehl S. Uhl M. Berner R. Bonafé L. Superti-Furga A. Kirchhoff A. Clinical, Radiographic, and Genetic Diagnosis of Progressive Pseudorheumatoid Dysplasia in a Patient with Severe Polyarthropathy Rheumatol. Int. 2004 24 53 56 10.1007/s00296-003-0341-0 12819927 18. Karalexi M.A. Papadopoulou A. Papakonstantinou O. Mitrogiorgou M. Skarantavos G. Papaevangelou V. Atsali E. Late Diagnosis of Progressive Pseudorheumatoid Dysplasia in an Adolescent Patient: A Case Report and Review of the Literature J. Pediatr. Res. 2021 8 209 213 10.4274/jpr.galenos.2020.42103 19. Uludağ Alkaya D. Kasapçopur Ö. Bursalı A. Adrovic A. Demir B. Aykut A. Tüysüz B. Specific Early Signs and Long-Term Follow-up Findings of Progressive Pseudorheumatoid Dysplasia (PPRD) in the Turkish Cohort Rheumatology 2022 61 3693 3703 10.1093/rheumatology/keab926 34919662 20. Pode-Shakked B. Vivante A. Barel O. Padeh S. Marek-Yagel D. Veber A. Abudi S. Eliyahu A. Tirosh I. Shpilman S. Progressive Pseudorheumatoid Dysplasia Resolved by Whole Exome Sequencing: A Novel Mutation in WISP3 and Review of the Literature BMC Med. Genet. 2019 20 53 10.1186/s12881-019-0787-x 30922245 PMC6439983 21. Wang Y. Xiao K. Yang Y. Wu Z. Jin J. Qiu G. Weng X. Zhao X. CCN6 Mol. Genet. Genom. Med. 2020 8 e1261 10.1002/mgg3.1261 PMC7336755 32351055 22. Delague V. Chouery E. Corbani S. Ghanem I. Aamar S. Fischer J. Levy-Lahad E. Urtizberea J.A. Mégarbané A. Molecular Study of WISP3 Am. J. Med. Genet. A 2005 138A 118 126 10.1002/ajmg.a.30906 16152649 23. Delgado J. Radusky L.G. Cianferoni D. Serrano L. FoldX 5.0: Working with RNA, Small Molecules and a New Graphical Interface Bioinformatics 2019 35 4168 4169 10.1093/bioinformatics/btz184 30874800 PMC6792092 24. Gao H. Yin F. Guan D. Feng Y. Zheng Q. Wang X. Zhu M. Zhang X. Cheng S. Chen T. Liver Cancer: WISP3 Suppresses Hepatocellular Carcinoma Progression by Negative Regulation of Β-catenin/TCF/LEF Signalling Cell Prolif. 2019 52 e12583 10.1111/cpr.12583 30793395 PMC6536422 25. Zhou F. Sun J. Ye L. Jiang T. Li W. Su C. Ren S. Wu F. Zhou C. Gao G. Fibronectin Promotes Tumor Angiogenesis and Progression of Non-Small-Cell Lung Cancer by Elevating WISP3 Expression via FAK/MAPK/ HIF-1α Axis and Activating Wnt Signaling Pathway Exp. Hematol. Oncol. 2023 12 61 10.1186/s40164-023-00419-w 37468964 PMC10355078 26. Verma R.P. Hansch C. Matrix Metalloproteinases (MMPs): Chemical–Biological Functions and (Q)SARs Bioorg. Med. Chem. 2007 15 2223 2268 10.1016/j.bmc.2007.01.011 17275314 27. Li X. Fang P. Mai J. Choi E.T. Wang H. Yang X. Targeting Mitochondrial Reactive Oxygen Species as Novel Therapy for Inflammatory Diseases and Cancers J. Hematol. Oncol. 2013 6 19 10.1186/1756-8722-6-19 23442817 PMC3599349 28. Trachootham D. Lu W. Ogasawara M.A. Valle N.R.-D. Huang P. Redox Regulation of Cell Survival Antioxid. Redox Signal. 2008 10 1343 1374 10.1089/ars.2007.1957 18522489 PMC2932530 29. Helguera P. Seiglie J. Rodriguez J. Hanna M. Helguera G. Busciglio J. Adaptive Downregulation of Mitochondrial Function in Down Syndrome Cell Metab. 2013 17 132 140 10.1016/j.cmet.2012.12.005 23312288 PMC3580189 30. Marzin P. Cormier-Daire V. New Perspectives on the Treatment of Skeletal Dysplasia Ther. Adv. Endocrinol. Metab. 2020 11 2042018820904016 10.1177/2042018820904016 32166011 PMC7054735 31. Kimura M. Ichimura S. Sasaki K. Masuya H. Suzuki T. Wakana S. Ikegawa S. Furuichi T. Endoplasmic Reticulum Stress-Mediated Apoptosis Contributes to a Skeletal Dysplasia Resembling Platyspondylic Lethal Skeletal Dysplasia, Torrance Type, in a Novel Col2a1 Mutant Mouse Line Biochem. Biophys. Res. Commun. 2015 468 86 91 10.1016/j.bbrc.2015.10.160 26545783 32. Ritz C. Spiess A.-N. qpcR Bioinformatics 2008 24 1549 1551 10.1093/bioinformatics/btn227 18482995 33. Li J. Rouse S.L. Matthews I.R. Park Y. Eltawil Y. Sherr E.H. Chan D.K. Modulating the Unfolded Protein Response with ISRIB Mitigates Cisplatin Ototoxicity Sci. Rep. 2024 14 22382 10.1038/s41598-024-70561-w 39333235 PMC11437005 34. Mcdonald J.H. Dunn K.W. Statistical Tests for Measures of Colocalization in Biological Microscopy J. Microsc. 2013 252 295 302 10.1111/jmi.12093 24117417 PMC4428547 35. Baker N. Sharpe P. Culley K. Otero M. Bevan D. Newham P. Barker W. Clements K.M. Langham C.J. Goldring M.B. Dual Regulation of Metalloproteinase Expression in Chondrocytes by Wnt-1–Inducible Signaling Pathway Protein 3/CCN6 Arthritis Rheum. 2012 64 2289 2299 10.1002/art.34411 22294415 PMC3366172 36. Schweingruber C. Rufener S.C. Zünd D. Yamashita A. Mühlemann O. Nonsense-Mediated mRNA Decay—Mechanisms of Substrate mRNA Recognition and Degradation in Mammalian Cells Biochim. Biophys. Acta BBA—Gene Regul. Mech. 2013 1829 612 623 10.1016/j.bbagrm.2013.02.005 23435113 37. Popp M.W.-L. Maquat L.E. Organizing Principles of Mammalian Nonsense-Mediated mRNA Decay Annu. Rev. Genet. 2013 47 139 165 10.1146/annurev-genet-111212-133424 24274751 PMC4148824 38. Carter M.S. Li S. Wilkinson M.F. A Splicing-Dependent Regulatory Mechanism That Detects Translation Signals EMBO J. 1996 15 5965 5975 10.1002/j.1460-2075.1996.tb00983.x 8918474 PMC452383 39. Buß O. Muller D. Jager S. Rudat J. Rabe K.S. Improvement in the Thermostability of a β-Amino Acid Converting ω-Transaminase by Using FoldX ChemBioChem 2018 19 379 387 10.1002/cbic.201700467 29120530 40. Buß O. Rudat J. Ochsenreither K. FoldX as Protein Engineering Tool: Better Than Random Based Approaches? Comput. Struct. Biotechnol. J. 2018 16 25 33 10.1016/j.csbj.2018.01.002 30275935 PMC6158775 41. Petrosino M. Novak L. Pasquo A. Chiaraluce R. Turina P. Capriotti E. Consalvi V. Analysis and Interpretation of the Impact of Missense Variants in Cancer Int. J. Mol. Sci. 2021 22 5416 10.3390/ijms22115416 34063805 PMC8196604 42. Tokuriki N. Stricher F. Serrano L. Tawfik D.S. How Protein Stability and New Functions Trade Off PLoS Comput. Biol. 2008 4 e1000002 10.1371/journal.pcbi.1000002 18463696 PMC2265470 43. Hernández I.M. Dehouck Y. Bastolla U. López-Blanco J.R. Chacón P. Predicting Protein Stability Changes upon Mutation Using a Simple Orientational Potential Bioinformatics 2023 39 btad011 10.1093/bioinformatics/btad011 36629451 PMC9850275 44. Wang M. Man X.-F. Liu Y.-Q. Liao E.-Y. Shen Z.-F. Luo X.-H. Guo L.-J. Wu X.-P. Zhou H.-D. Dysfunction of Collagen Synthesis and Secretion in Chondrocytes Induced by Wisp3 Int. J. Endocrinol. 2013 2013 679763 10.1155/2013/679763 23573089 PMC3614060 45. Padhan D.K. Sengupta A. Patra M. Ganguly A. Mahata S.K. Sen M. CCN6 FASEB J. 2020 34 12163 12176 10.1096/fj.202000405RR 32686858 46. Rehm H.L. Berg J.S. Brooks L.D. Bustamante C.D. Evans J.P. Landrum M.J. Ledbetter D.H. Maglott D.R. Martin C.L. Nussbaum R.L. ClinGen—The Clinical Genome Resource N. Engl. J. Med. 2015 372 2235 2242 10.1056/NEJMsr1406261 26014595 PMC4474187 47. Nakamura Y. Weidinger G. Liang J.O. Aquilina-Beck A. Tamai K. Moon R.T. Warman M.L. The CCN Family Member Wisp3, Mutant in Progressive Pseudorheumatoid Dysplasia, Modulates BMP and Wnt Signaling J. Clin. Investig. 2007 117 3075 3086 10.1172/JCI32001 17823661 PMC1964511 48. Zhou H.-D. Bu Y.-H. Peng Y.-Q. Xie H. Wang M. Yuan L.-Q. Jiang Y. Li D. Wei Q.-Y. He Y.-L. Cellular and Molecular Responses in Progressive Pseudorheumatoid Dysplasia Articular Cartilage Associated with Compound Heterozygous WISP3 Gene Mutation J. Mol. Med. 2007 85 985 996 10.1007/s00109-007-0193-2 17483925 49. Li C. Alemany-Ribes M. Raftery R.M. Nwoko U. Warman M.L. Craft A.M. Directed Differentiation of Human Pluripotent Stem Cells into Articular Cartilage Reveals Effects Caused by Absence of WISP3 Ann. Rheum. Dis. 2023 82 1547 1557 10.1136/ard-2023-224304 37679035 50. Zhang H.-X. Sun C. Yu H.-C. Song B. Pan Z.-X. Targeted Inhibition of β-Catenin by miR-320 and Decreased MMP-13 Expression in Suppressing Chondrocyte Collagen Degradation Eur. Rev. Med. Pharmacol. Sci. 2018 22 5828 5835 10.26355/eurrev_201809_15909 30280762 51. Lechuga C.G. Hernández-Nazara Z.H. Rosales J.-A.D. Morris E.R. Rincón A.R. Rivas-Estilla A.M. Esteban-Gamboa A. Rojkind M. TGF-Β1 Modulates Matrix Metalloproteinase-13 Expression in Hepatic Stellate Cells by Complex Mechanisms Involving p38MAPK, PI3-Kinase, AKT, and P70 S6k Am. J. Physiol.-Gastrointest. Liver Physiol. 2004 287 G974 G987 10.1152/ajpgi.00264.2003 15246963 52. Yang X. Chen L. Xu X. Li C. Huang C. Deng C.-X. TGF-β/Smad3 Signals Repress Chondrocyte Hypertrophic Differentiation and Are Required for Maintaining Articular Cartilage J. Cell Biol. 2001 153 35 46 10.1083/jcb.153.1.35 11285272 PMC2185521 53. Leivonen S.-K. Chantry A. Häkkinen L. Han J. Kähäri V.-M. Smad3 Mediates Transforming Growth Factor-β-Induced Collagenase-3 (Matrix Metalloproteinase-13) Expression in Human Gingival Fibroblasts J. Biol. Chem. 2002 277 46338 46346 10.1074/jbc.M206535200 12270924 54. Chen S. He T. Zhong Y. Chen M. Yao Q. Chen D. Shao Z. Xiao G. Roles of Focal Adhesion Proteins in Skeleton and Diseases Acta Pharm. Sin. B 2023 13 998 1013 10.1016/j.apsb.2022.09.020 36970189 PMC10031257 55. Lu Y. Xu Y. Yin Z. Yang X. Jiang Y. Gui J. Chondrocyte Migration Affects Tissue-Engineered Cartilage Integration by Activating the Signal Transduction Pathways Involving Src, PLCγ1, and ERK1/2 Tissue Eng. Part A 2013 19 2506 2516 10.1089/ten.tea.2012.0614 23799275 56. Gortazar A.R. Martin-Millan M. Bravo B. Plotkin L.I. Bellido T. Crosstalk between Caveolin-1/Extracellular Signal-Regulated Kinase (ERK) and β-Catenin Survival Pathways in Osteocyte Mechanotransduction J. Biol. Chem. 2013 288 8168 8175 10.1074/jbc.M112.437921 23362257 PMC3605635 57. Wörthmüller J. Rüegg C. The Crosstalk between FAK and Wnt Signaling Pathways in Cancer and Its Therapeutic Implication Int. J. Mol. Sci. 2020 21 9107 10.3390/ijms21239107 33266025 PMC7730291 58. Cockburn C.G. Barnes M.J. Characterization of Thrombospondin Binding to Collagen (Type I) Fibres: Role of Collagen Telopeptides Matrix 1991 11 168 176 10.1016/S0934-8832(11)80155-1 1870447 59. Jiang Z. Wang H. Zhang Z. Pan J. Yuan H. Cartilage Targeting Therapy with Reactive Oxygen Species-Responsive Nanocarrier for Osteoarthritis J. Nanobiotechnol. 2022 20 419 10.1186/s12951-022-01629-w PMC9484188 36123746 60. Kan S. Duan M. Liu Y. Wang C. Xie J. Role of Mitochondria in Physiology of Chondrocytes and Diseases of Osteoarthritis and Rheumatoid Arthritis Cartilage 2021 13 1102S 1121S 10.1177/19476035211063858 34894777 PMC8804744 61. Pendergrass W. Wolf N. Poot M. Efficacy of MitoTracker Green TM Cytometry A 2004 61A 162 169 10.1002/cyto.a.20033 15382028 62. Chen X. Shi C. He M. Xiong S. Xia X. Endoplasmic Reticulum Stress: Molecular Mechanism and Therapeutic Targets Signal Transduct. Target. Ther. 2023 8 352 10.1038/s41392-023-01570-w 37709773 PMC10502142 63. Lamandé S.R. Bateman J.F. Genetic Disorders of the Extracellular Matrix Anat. Rec. 2020 303 1527 1542 10.1002/ar.24086 PMC7318566 30768852 64. Tran H.C. Van Aken O. Mitochondrial Unfolded Protein-Related Responses across Kingdoms: Similar Problems, Different Regulators Mitochondrion 2020 53 166 177 10.1016/j.mito.2020.05.009 32502630 65. Falahatpisheh H. Nanez A. Montoya-Durango D. Qian Y. Tiffany-Castiglioni E. Ramos K.S. Activation Profiles of HSPA5 during the Glomerular Mesangial Cell Stress Response to Chemical Injury Cell Stress Chaperones 2007 12 209 10.1379/CSC-259.1 17915553 PMC1971237 66. Huang Y. Arora K. Mun K.S. Yang F. Moon C. Yarlagadda S. Jegga A. Weaver T. Naren A.P. Targeting DNAJB9, a Novel ER Luminal Co-Chaperone, to Rescue ΔF508-CFTR Sci. Rep. 2019 9 9808 10.1038/s41598-019-46161-4 31285458 PMC6614449 67. Paredes F. Parra V. Torrealba N. Navarro-Marquez M. Gatica D. Bravo-Sagua R. Troncoso R. Pennanen C. Quiroga C. Chiong M. HERPUD1 Protects against Oxidative Stress-Induced Apoptosis through Downregulation of the Inositol 1,4,5-Trisphosphate Receptor Free Radic. Biol. Med. 2016 90 206 218 10.1016/j.freeradbiomed.2015.11.024 26616647 PMC4710961 68. Liu S. Li Z. Lan S. Hao H. Baz A.A. Yan X. Gao P. Chen S. Chu Y. The Dual Roles of Activating Transcription Factor 3 (ATF3) in Inflammation, Apoptosis, Ferroptosis, and Pathogen Infection Responses Int. J. Mol. Sci. 2024 25 824 10.3390/ijms25020824 38255898 PMC10815024 69. Turpin J. El-Safadi D. Lebeau G. Frumence E. Desprès P. Viranaïcken W. Krejbich-Trotot P. CHOP Pro-Apoptotic Transcriptional Program in Response to ER Stress Is Hacked by Zika Virus Int. J. Mol. Sci. 2021 22 3750 10.3390/ijms22073750 33916874 PMC8038490 70. Jackson J.T. Mulazzani E. Nutt S.L. Masters S.L. The Role of PLCγ2 in Immunological Disorders, Cancer, and Neurodegeneration J. Biol. Chem. 2021 297 100905 10.1016/j.jbc.2021.100905 34157287 PMC8318911 71. Sojoudi K. Azizi H. Skutella T. A Study of Dual Function and Expression Pattern of Klf4 Andrologia 2024 2024 8061627 10.1155/2024/8061627 72. Gene: CSNK1A1L Casein Kinase 1 Alpha 1 like [Homo sapiens] Available online: https://www.ncbi.nlm.nih.gov/gene?Db=gene&Cmd=DetailsSearch&Term=122011 (accessed on 13 July 2025) 73. ANP32CP Acidic Nuclear Phosphoprotein 32 Family Member C, Pseudogene [Homo sapiens (Human)] Available online: https://www.ncbi.nlm.nih.gov/gene?Db=gene&Cmd=DetailsSearch&Term=23520 (accessed on 13 July 2025) 74. NME2P1 NME2 Pseudogene 1 [Homo sapiens (Human)] Available online: https://www.genecards.org/cgi-bin/carddisp.pl?gene=NME2P1 (accessed on 13 July 2025) 75. Qazi S. Jit B.P. Das A. Karthikeyan M. Saxena A. Ray M.D. Singh A.R. Raza K. Jayaram B. Sharma A. BESFA: Bioinformatics Based Evolutionary, Structural & Functional Analysis of Prostate, Placenta, Ovary, Testis, and Embryo (POTE) Paralogs Heliyon 2022 8 e10476 10.1016/j.heliyon.2022.e10476 36132183 PMC9483601 76. Huang H. Du Y. Zhao D. Chen K. The Relationship between the Prognostic Marker LIMA1 in Head and Neck Squamous Cell Carcinoma and Immune Infiltration J. Oncol. 2022 2022 1040116 10.1155/2022/1040116 37181789 PMC10175016 77. Wang X. Zhang C. Song H. Yuan J. Zhang X. Yuan Y. Zhang L. He J. Characterization of LIMA1 and Its Emerging Roles and Potential Therapeutic Prospects in Cancers Front. Oncol. 2023 13 1115943 10.3389/fonc.2023.1115943 37274282 PMC10235525 78. Loughlin J. Sinsheimer J.S. Carr A. Chapman K. The CALM1 Core Promoter Polymorphism Is Not Associated with Hip Osteoarthritis in a United Kingdom Caucasian Population Osteoarthr. Cartil. 2006 14 295 298 10.1016/j.joca.2005.11.001 16359877 79. Mototani H. Mabuchi A. Saito S. Fujioka M. Iida A. Takatori Y. Kotani A. Kubo T. Nakamura K. Sekine A. A Functional Single Nucleotide Polymorphism in the Core Promoter Region of CALM1 Is Associated with Hip Osteoarthritis in Japanese Hum. Mol. Genet. 2005 14 1009 1017 10.1093/hmg/ddi093 15746150 80. Koren T.D.T. Shrivastava R. Siddiqui S.I. Ghosh S. Calmodulin Modulates the Gating Properties of Voltage-Dependent Anion Channel from Rat Brain Mitochondria J. Phys. Chem. B 2022 126 4857 4871 10.1021/acs.jpcb.1c10322 35758767 81. Despotidis M. Lyros O. Driva T.S. Sarantis P. Kapetanakis E.I. Mylonakis A. Mamilos A. Sakellariou S. Schizas D. DKK1 and Its Receptors in Esophageal Adenocarcinoma: A Promising Molecular Target Diagnostics 2025 15 85 10.3390/diagnostics15010085 39795613 PMC11720708 82. Li C.M. Kang J. Baek J. Kim Y. Park H. Jung Y.-K. Cytosolic FKBPL and ER-Resident CKAP4 Co-Regulates ER-Phagy and Protein Secretion Nat. Commun. 2024 15 7886 10.1038/s41467-024-52188-7 39251576 PMC11383940 83. Harada T. Sada R. Osugi Y. Matsumoto S. Matsuda T. Hayashi-Nishino M. Nagai T. Harada A. Kikuchi A. Palmitoylated CKAP4 Regulates Mitochondrial Functions through an Interaction with VDAC2 at ER–Mitochondria Contact Sites J. Cell Sci. 2020 133 jcs249045 10.1242/jcs.249045 33067255 84. Ma L. Zhao X. Wang S. Zheng Y. Yang S. Hou Y. Zou B. Dong L. Decreased Expression of DEAD-Box Helicase 5 Inhibits Esophageal Squamous Cell Carcinomas by Regulating Endoplasmic Reticulum Stress and Autophagy Biochem. Biophys. Res. Commun. 2020 533 1449 1456 10.1016/j.bbrc.2020.10.026 33169694 85. Xu K. Sun S. Yan M. Cui J. Yang Y. Li W. Huang X. Dou L. Chen B. Tang W. DDX5 and DDX17—Multifaceted Proteins in the Regulation of Tumorigenesis and Tumor Progression Front. Oncol. 2022 12 943032 10.3389/fonc.2022.943032 35992805 PMC9382309 86. Lambrecht S. Dhaenens M. Almqvist F. Verdonk P. Verbruggen G. Deforce D. Elewaut D. Proteome Characterization of Human Articular Chondrocytes Leads to Novel Insights in the Function of Small Heat-Shock Proteins in Chondrocyte Homeostasis Osteoarthr. Cartil. 2010 18 440 446 10.1016/j.joca.2009.10.008 19879248 87. Bruey J.-M. Ducasse C. Bonniaud P. Ravagnan L. Susin S.A. Diaz-Latoud C. Gurbuxani S. Arrigo A.-P. Kroemer G. Solary E. Hsp27 Negatively Regulates Cell Death by Interacting with Cytochrome c Nat. Cell Biol. 2000 2 645 652 10.1038/35023595 10980706 88. Fu Q. Li Y. Shi C. HSPB1 as an RNA-Binding Protein Mediates the Pathological Process of Osteoarthritis J. Orthop. Surg. 2024 19 156 10.1186/s13018-024-04580-8 PMC10908047 38429742 89. Humphrey W. Dalke A. Schulten K. VMD: Visual Molecular Dynamics J. Mol. Graph. 1996 14 33 38 10.1016/0263-7855(96)00018-5 8744570 90. Lazarovici P. Marcinkiewicz C. Lelkes P.I. Cell-Based Adhesion Assays for Isolation of Snake Venom’s Integrin Antagonists Methods in Molecular Biology Springer US New York, NY, USA 2020 205 223 978-1-4939-9844-9 10.1007/978-1-4939-9845-6_11 31576530 91. Livak K.J. Schmittgen T.D. Analysis of Relative Gene Expression Data Using Real-Time Quantitative PCR and the 2−ΔΔCT Method Methods 2001 25 402 408 10.1006/meth.2001.1262 11846609 92. Bormann T. Maus R. Stolper J. Tort Tarrés M. Brandenberger C. Wedekind D. Jonigk D. Welte T. Gauldie J. Kolb M. Role of Matrix Metalloprotease-2 and MMP-9 in Experimental Lung Fibrosis in Mice Respir. Res. 2022 23 180 10.1186/s12931-022-02105-7 35804363 PMC9270768 93. Bolte S. Cordelières F.P. A Guided Tour into Subcellular Colocalization Analysis in Light Microscopy J. Microsc. 2006 224 213 232 10.1111/j.1365-2818.2006.01706.x 17210054 94. Kim D. Paggi J.M. Park C. Bennett C. Salzberg S.L. Graph-Based Genome Alignment and Genotyping with HISAT2 and HISAT-Genotype Nat. Biotechnol. 2019 37 907 915 10.1038/s41587-019-0201-4 31375807 PMC7605509 95. Mudge J.M. Carbonell-Sala S. Diekhans M. Martinez J.G. Hunt T. Jungreis I. Loveland J.E. Arnan C. Barnes I. Bennett R. GENCODE 2025: Reference Gene Annotation for Human and Mouse Nucleic Acids Res. 2025 53 D966 D975 10.1093/nar/gkae1078 39565199 PMC11701607 96. Chen Y. Chen L. Lun A.T.L. Baldoni P.L. Smyth G.K. edgeR v4: Powerful Differential Analysis of Sequencing Data with Expanded Functionality and Improved Support for Small Counts and Larger Datasets Nucleic Acids Res. 2025 53 gkaf018 10.1093/nar/gkaf018 39844453 PMC11754124 97. Wu T. Hu E. Xu S. Chen M. Guo P. Dai Z. Feng T. Zhou L. Tang W. Zhan L. clusterProfiler 4.0: A Universal Enrichment Tool for Interpreting Omics Data Innovation 2021 2 100141 10.1016/j.xinn.2021.100141 34557778 PMC8454663 98. Liberzon A. Subramanian A. Pinchback R. Thorvaldsdóttir H. Tamayo P. Mesirov J.P. Molecular Signatures Database (MSigDB) 3.0 Bioinformatics 2011 27 1739 1740 10.1093/bioinformatics/btr260 21546393 PMC3106198 99. Kolde R. Package ‘Pheatmap’ Available online: https://cran.r-project.org/web/packages/pheatmap/index.html (accessed on 13 July 2025) 100. Wickham H. Ggplot2 WIREs Comput. Stat. 2011 3 180 185 10.1002/wics.147 101. Zhang X. Smits A.H. Van Tilburg G.B. Ovaa H. Huber W. Vermeulen M. Proteome-Wide Identification of Ubiquitin Interactions Using UbIA-MS Nat. Protoc. 2018 13 530 550 10.1038/nprot.2017.147 29446774 102. Pedersen T.L. Tidygraph: A Tidy API for Graph Manipulation, R package version 1.3.1.9000; 2020 Available online: https://cran.r-project.org/web/packages/tidygraph/index.html (accessed on 19 July 2025) 103. Pedersen T.L. Ggforce: Accelerating ‘Ggplot2’, R package version 0.5.0.9000; 2019 Available online: https://cran.r-project.org/web/packages/ggforce/index.html (accessed on 19 July 2025) 104. Fruchterman T.M.J. Reingold E.M. Graph Drawing by Force-directed Placement Softw. Pract. Exp. 1991 21 1129 1164 10.1002/spe.4380211102 105. Bressert E. SciPy and NumPy: Examples to Jumpstart Your Scientific Python Programming 1st ed., 3. release. O’Reilly Beijing, China Köln, Germany 2013 978-1-4493-0546-8 106. Bisong E. Building Machine Learning and Deep Learning Models on Google Cloud Platform: A Comprehensive Guide for Beginners Apress Berkeley, CA, USA 2019 978-1-4842-4469-2 Figure 1 Variant positioning within the structural domains suggests differential impacts on WISP3 activity. ( A O95389 O95389 B Figure 2 Verification of WISP3 variant expression in human chondrocytes. Human chondrocytes were transfected with plasmids encoding either wild-type WISP3 (Overexpression) or CCN6 A CCN6 ACTB n B p p Figure 3 WISP3 variant expression alters wound healing capacity and cell viability in human chondrocytes. ( A n B C n p p p Figure 4 Evaluation of chondrocyte adhesion and extracellular matrix (ECM) remodeling in response to WISP3 variants. Human chondrocytes were transfected with pcDNA3.1, wild-type, p.Cys52*, p.Tyr109*, p.Gly83Glu, p.Cys114Trp. ( A B n C n D p p p p Figure 5 Mitochondrial ROS and ER stress marker expression upon CCN6 CCN6 A B n C D CHOP s/uXBP1 n E CHOP/sXBP1 n p p p p Figure 6 WISP3 localization and co-localization with mitochondria are differentially affected by disease-associated variants. ( A CCN6 B 2 C p p p Figure 7 To examine the transcriptomic impact of disease-associated CCN6 CCN6 n A B A B p 2 C D C D p E Figure 8 Proteomic comparison of wild-type WISP3 and variants reveals distinct interaction landscapes. ( A B A B C D ijms-26-08838-t001_Table 1 Table 1 FoldX-based ΔΔG estimation (protein stability) of WISP3 IGFBP N-terminal domain variants. Positive values indicate decreased protein stability. Variant ΔΔG Prediction for Protein Stability (kcal/mol) p.Gly83Glu +2.73 p.Cys114Trp +43.33 ijms-26-08838-t002_Table 2 Table 2 Primer Sequences and GC Content Used for Site-Directed Mutagenesis. Nucleotide Change Protein Change Forward and Reverse Primer (5′ → 3′) GC Content (%) c.156C>A p.Cys52* Fw: GTTTTGTCACTGGCCCTGAAAATGCCCTCAGCAGAAG 51 Rv: CTTCTGCTGAGGGCATTTTCAGGGCCAGTGACAAAAC c.248G>A p.Glu83Glu Fw: CTGTGCCAAGCAACCAGAGGAAATCTGCAATGAAG 49 Rv: CTTCATTGCAGATTTCCTCTGGTTGCTTGGCACAG c.327C>A p.Tyr109* Fw: GACAGGCCTAGGTAAGAGACTGGAGTGTG 55 Rv: CACACTCCAGTCTCTTACCTAGGCCTGTC c.342T>G p.Cys114Trp Fw: GAGACTGGAGTGTGGGCATACCTTGTAGC 55 Rv: GCTACAAGGTATGCCCACACTCCAGTCTC ijms-26-08838-t003_Table 3 Table 3 Genes and primer sequences used for RT-PCR analysis. Gene Forward and Reverse Primer (5′ → 3′)  CCN6 Fw: ACTGTAGCCTGGAACCATTACT  CHOP Fw: GGAAACAGAGTGGTCATTCCC  sXBP1 Fw: GCTGAGTCCGCAGCAGGT  uXBP1 Fw: CAGACTACGTGCACCTCTGC  ACTB Fw: CACCATTGGCAATGAGCGGTTC ",
  "metadata": {
    "Title of this paper": "Graph Drawing by Force-directed Placement",
    "Journal it was published in:": "International Journal of Molecular Sciences",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12469775/"
  }
}