{
  "title": "Paper_1150",
  "abstract": "pmc Healthcare (Basel) Healthcare (Basel) 2994 healthcare healthcare Healthcare 2227-9032 Multidisciplinary Digital Publishing Institute  (MDPI) PMC12469704 PMC12469704.1 12469704 12469704 41008467 10.3390/healthcare13182337 healthcare-13-02337 1 Article Implementing a Mixed Health Service Model as an Informed Modality to Enhance Prevention and Promote Workplace Health in the Greek Regional Public Sector: A Pilot Study in Crete Frantzeskakis Nikos Methodology Formal analysis Investigation 1 Tziraki Maria Methodology Investigation Resources 1 https://orcid.org/0000-0003-2163-0653 Spanakis Marios Formal analysis Writing – original draft Writing – review & editing 2 * Katsarou Spyridoula D. Methodology Investigation Resources 1 https://orcid.org/0000-0001-9359-639X Papadopoulos Nikolaos Methodology Investigation 3 Linardakis Manolis Formal analysis Data curation 2 Vova-Chatzi Charikleia Methodology Writing – original draft 3 Kamekis Apostolos Methodology Resources 1 4 Pitsoulis George Conceptualization Resources 1 4 5 https://orcid.org/0000-0002-8891-2084 Papadakis Antonios Conceptualization Resources 1 4 Symvoulakis Emmanouil K. Conceptualization Methodology Writing – review & editing Supervision 2 3 * Leal-Costa César Academic Editor 1 med4p1030424@med.uoc.gr marisatziraki@gmail.com spyridoulakats.30@gmail.com apostoloskamekis@gmail.com gpitsoulis@crete.gov.gr apapadakis@crete.gov.gr 2 linman@uoc.gr 3 medp2012014@med.uoc.gr xaravova@gmail.com 4 5 * mspanakis@uoc.gr esymvoulakis@uoc.gr 17 9 2025 9 2025 13 18 497454 2337 04 8 2025 05 9 2025 15 9 2025 17 09 2025 27 09 2025 29 09 2025 © 2025 by the authors. 2025 https://creativecommons.org/licenses/by/4.0/ Licensee MDPI, Basel, Switzerland. This article is an open access article distributed under the terms and conditions of the Creative Commons Attribution (CC BY) license ( https://creativecommons.org/licenses/by/4.0/ Background/Objectives Methods Results p p p Conclusions preventive healthcare proactive health workplace health occupational health integrated care primary care vaccination coverage metabolic risk factors stress assessment public health intervention social medicine Special Research Account of the University of Crete KA 11993 This research was supported by the Special Research Account of the University of Crete (Project Code KA 11993). pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement yes pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes 1. Introduction In recent decades, the health of working-age populations has become a growing priority in public health agendas worldwide, driven by the increasing burden of chronic diseases, mental health conditions, and modifiable risk behaviors [ 1 2 3 4 Despite this growing body of evidence, many countries still lack integrated and systematic approaches to workplace health—especially within the public sector. Occupational health services often remain limited to regulatory compliance and administrative procedures, neglecting the broader spectrum of preventive care and employee well-being [ 5 6 In the Greek public sector, occupational health is typically reactive rather than preventive or proactive. Services are fragmented, and the division between primary care and occupational medicine results in missed opportunities for timely interventions such as vaccinations, routine screenings, and behavioral counseling [ 7 8 9 The COVID-19 pandemic further underscored these vulnerabilities. It highlighted the urgent need for more accessible workplace-based services, especially those related to adult immunization, psychosocial support, and chronic disease prevention [ 10 11 12 13 14 15 16 Globally, integrated care models that combine occupational health with primary and public health strategies are gaining attention. These models offer streamlined risk assessments, evidence-based screenings, lifestyle interventions, and follow-up mechanisms, and have been shown to improve key indicators such as smoking cessation, physical activity, and chronic disease control [ 17 18 19 20 21 22 23 24 25 26 27 28 29 30 31 32 33 This pilot study introduces and evaluates an integrated “mixed service” model in the Region of Crete. The model combines elements of occupational health and primary care into a unified, workplace-based intervention for public employees. Τhe initiative includes short clinical consultations (~30 min), lifestyle risk assessments, immunization reviews, mental health screening, and tailored follow-up recommendations. By leveraging the administrative structure and access mechanisms of the Region, the model seeks to deliver preventive services in a convenient and responsive format. This prospective observational cohort study aimed to identify individual gaps in preventive healthcare among public sector employees and implement tailored interventions in response. The objectives of this study are to describe the design and operational characteristics of the pilot model, to present findings regarding the health status, risk factors, and unmet needs of public employees; and to assess the feasibility and relevance of such a model for wider adoption in the Greek health system. By integrating biomedical, and psychosocial information in a real-world workplace context, this intervention aims to contribute new evidence toward the development of effective, sustainable workplace health strategies in Greece and other resource-constrained health services. 2. Materials and Methods 2.1. Study Design The study was conducted by a multidisciplinary team affiliated with the Department of Social Medicine, School of Medicine, University of Crete. Participants were followed through a structured protocol involving questionnaire-based assessment, biometric and clinical data collection, and follow-up sessions where applicable. 2.2. Ethical Approval and Informed Consent The study protocol was reviewed and approved by the Ethics Committee of UoC (Approval Number: 131; Date: 4 November 2024). All participants were informed of the study’s objectives, procedures, and voluntary nature and provided written informed consent prior to participation. The study complies with the Declaration of Helsinki and relevant national and institutional research ethics guidelines. 2.3. Setting and Participants Participants were appointed civil servants employed by the Regional Unit of Heraklion, Region of Crete, Greece. Participants eligible for the study were adults aged 18 years or older, employed on a permanent basis by the Regional Unit of Heraklion included in the current phase. Individuals who declined participation or could not be reached after multiple contact attempts were not included in the study sample. A total of 366 potential participants were actively appointed to be enrolled in the study between January and July 2025. Recruitment was initiated through an informational email circulated by the Employee Association of the Regional Unit of Heraklion. Subsequently, participants were contacted individually via their workplace telephone numbers, provided by the same administrative body. During these calls, the study’s aims and procedures were explained, and appointments were scheduled. Participants were asked to bring results from any clinical tests conducted within the past year to facilitate the development of a comprehensive baseline health profile. 2.4. Data Collection Procedures Data collection was conducted prospectively between January and July 2025 through scheduled 30 min appointments using the described standardized procedures to ensure consistency. All interviews were conducted in a designated space provided and equipped by the Region of Crete. Upon arrival, participants’ identities were confirmed, and healthcare professionals introduced themselves and described their roles in the study. At the outset, participants were asked to complete a brief four-domain service evaluation form. The first two items assessed expectations and were completed before the consultation, while the remaining two items, focusing on the experience, were completed afterward. A member of the healthcare team initiated the consultation and began completing the sections of the questionnaire through a structured dialogue with the participant. Biometric data, including blood pressure (BP), heartbeats per minute (HPM), oxygen saturation, height, weight, and body mass index (BMI), were measured on-site using standardized equipment. If participants presented recent laboratory test results regarding complete blood count (CBC) and comprehensive metabolic panel (CMP), these were recorded. In cases where test results were outdated or incomplete for constructing a comprehensive health profile, the participant was advised to undergo additional testing and was issued the necessary referrals. Laboratory test results older than 4 months at the time of the initial interview were deemed outdated, and new or supplementary tests were prescribed accordingly. Dyslipidemia was defined according to the NCEP ATP III criteria: total cholesterol ≥ 200 mg/dL, LDL-C ≥ 130 mg/dL, HDL-C < 40 mg/dL in men or <50 mg/dL in women, or triglycerides ≥ 150 mg/dL, or current use of lipid-lowering medication [ 34 Immunization status was initially self-reported by participants in response to structured questions and then cross-verified through their health records according to the national adult immunization program [ 35 19 36 37 38 The consultation concluded with the formulation of a personalized action plan. Any intervention such as screenings, referrals, prescriptions, or counseling—were documented in the attendee’s record. A signed record of agreed-upon actions was obtained from both the participant and the attending health professional. Follow-up visits were scheduled as needed based on nature and the number of interventions. 2.5. Intervention and Follow-Up Procedures The interventions implemented in this pilot were personalized and based on the specific needs identified during the initial health assessment. These included the prescription of diagnostic examinations such as mammography, low-dose chest CT, or comprehensive blood panels. When gaps in vaccination coverage were identified, appointments were arranged to facilitate immunization in accordance with national adult vaccine recommendations. Participants also received tailored counseling on key health behaviors, including dietary modification, physical activity enhancement, and smoking cessation. When clinical indicators suggested the need for further evaluation, participants were referred to appropriate specialists such as cardiologists, endocrinologists, or mental health providers. Additionally, educational materials and individualized behavior change plans were provided to support long-term health improvement. Follow-up sessions were arranged according to the type and number of interventions planned for each participant. These sessions typically lasted 15 to 30 min and served multiple purposes, including reviewing diagnostic results, verifying completed vaccinations, reassessing behavioral changes, and modifying or extending care plans when necessary. Once all identified preventive care gaps had been adequately addressed and the planned interventions were completed, the participant’s file was marked as complete, and no further visits were scheduled unless novel issues arose. 2.6. Service Satisfaction Assessment Perceived service satisfaction was evaluated using a brief, structured tool consisting of two 10-point Likert-scale items. The first item, administered before the consultation, assessed participants’ expectations regarding the quality and usefulness of the health service. The second item, administered immediately after the consultation, captured participants perceived level of satisfaction with the care received. Both items used a scale from 1 (very low) to 10 (very high). This pre–post format allowed for a basic comparison between initial expectations and actual experience, providing insight into the acceptability and perceived value of the intervention model from the user’s perspective. 2.7. Statistical Analysis Data analysis was conducted using the SPSS program (IBM Corp. Released 2019, IBM SPSS Statistics for Windows, v.25.0, Armonk, NY, USA: IBM Corp.). Frequency distributions and measures of location and dispersion of the characteristics of the 154 participants were calculated. The prevalence of chronic conditions, vaccination status and proactive action/recommendation/prescription was also estimated as well as the levels and frequencies of the five MetSyn risk factors. Gender differences were detected based on Student t 2 3. Results 3.1. Participation and Demographics Of the 366 employees eligible for participation, 74 were not reached despite multiple contact attempts thus leaving 292 eligible participants. Of them, till 10 July, 180 (67.7%) agreed to schedule an evaluation appointment, and 154 ultimately attended, yielding a response rate of 85.6%. Among those who did not participate, 58 individuals declined the invitation and 54 expressed willingness to arrange a later appointment. Table 1 3.2. Prevalence of Chronic Conditions and Metabolic Syndrome Among the 154 participants assessed, chronic conditions were common in 134 of them. Figure 1 A focused subgroup analysis was conducted on 130 participants with complete laboratory and biometric data to evaluate MetS risk factors based on the NCEP ATP III criteria ( Table 2 p p 3.3. Vaccination Status Vaccination coverage was suboptimal across key adult immunizations ( Table 3 3.4. Mental Health and Perceived Stress Data from 154 participants were analyzed using the PSS-14 and PHQ-9 tools ( Table 4 3.5. Diagnostic and Preventive Action Patterns Figure 2 Uptake varied across interventions. Mammography and Pap smears demonstrated the highest completion rates (79.2% and 62.3%, respectively), while 22.6% and 11.3% of women, respectively, still required updated screening. PSA testing among men aged ≥50 years showed a completion rate of 65.8%, with 26.3% receiving a recommendation. Colonoscopy among eligible participants (≥50 years) had lower uptake, with only 40.2% having undergone the procedure and 43.8% newly advised to do so. For metabolic assessments, cholesterol measurement had been performed in 72.1% of participants, with 37.7% receiving new prescriptions, reflecting increased monitoring and need for recheck for some people. In terms of immunizations, coverage was notably low. Only 11.0% of participants had received a Tdap booster in the last 10 years, with 87.7% newly recommended. Similarly, 17.2% had received pneumococcal vaccination (PCV20 or earlier), with 60.9% newly recommended. Among those eligible for recombinant zoster vaccination (RZV; ≥60 years or immunocompromised), just 23.1% had received it, and 69.2% were advised to do so. Overall, the workplace consultation prompted a substantial number of preventive health actions, as provided in Table 5 Supplementary Table S2 3.6. Service Satisfaction Healthcare service satisfaction was evaluated using two 10-point Likert-scale questions administered before and after the clinical consultation ( Figure 3 p p 4. Discussion 4.1. Main Findings in the Context of Existing Literature This study evaluated the feasibility and preliminary outcomes of a novel mixed health service model that integrates occupational health with primary preventive care among public sector employees in Crete, Greece. To the best of our knowledge, this is one of the first initiatives in Greece to combine occupational health data with primary preventive care actions. The study highlights critical gaps in preventive health behaviors, cardiometabolic risk, adult immunization and in lesser extent in mental well-being. Furthermore, the study reveals a strong degree of acceptability, engagement, and satisfaction with the intervention—both immediately and quantitatively—suggesting the model’s viability in workplace settings. The distribution of preventive actions revealed clear differences in perceived importance and acceptance among employees of proactive health actions ( Figure 2 39 40 41 42 43 22 Vaccination coverage was also suboptimal. TdaP coverage was insufficient to meet recommended levels. Pneumococcal and herpes zoster vaccination rates were particularly low, reflecting national patterns of underutilization of adult immunization services in Greece [ 16 22 44 45 46 47 48 49 Mental health emerged also as a major concern in the current analysis. Based on PSS-14 results, one-third of participants reported high levels of perceived stress, while PHQ-9 scores revealed mild to moderate depressive symptoms in a notable subset of the population. These rates are comparable to those reported in European public workforce studies, where job-related stress and burnout remain prevalent, especially in civil service sectors [ 50 51 52 52 In terms of intervention delivery, the mixed health service model proved both feasible and efficient. On average, 7 interventions were delivered per attendee, spanning 46 distinct types of interventions such as immunizations, lifestyle counseling, and chronic disease risk screening. This volume of interventions indicates a substantial latent demand for preventive services among public employees and reinforces the argument that workplace-based screening can function as a gateway to the broader health system. The comprehensiveness of care offered aligns well with best practices worldwide, which advocate for multicomponent, individualized workplace health promotion programs [ 53 p 54 55 56 57 58 Overall, this model addresses notable gaps in Greece’s occupational health system, offering a pragmatic strategy for integrating primary prevention into routine workplace health services. It supports WHO recommendations for embedding preventive care in occupational settings and could serve as a scalable framework for similar public sector contexts, both nationally and internationally [ 59 60 61 4.2. Strengths, Limitations, and Directions for Future Research This study introduces an innovative approach to preventive health by embedding primary care competencies into the occupational health framework [ 62 63 64 65 66 67 However, some limitations must be acknowledged. As a single-site pilot study, the preliminary and localized nature of this analysis limits generalizability. The absence of a control group restricts causal inference, while the cross-sectional design precludes conclusions about long-term effectiveness. Additionally, variables, such as smoking status, relied on self-report and are subject to recall bias. Objective clinical outcomes beyond BMI and metabolic markers were not captured, representing another limitation. Operational challenges, including scheduling constraints and limited follow-up capacity, may also affect participation rates and sustainability, particularly in resource-limited public sector environments. Future research should focus on longitudinal follow-up to assess the sustained impact of the mixed health service model on employee health outcomes, healthcare utilization, and economic indicators such as absenteeism and productivity. While this pilot study offers encouraging initial results, it remains essential to determine whether these improvements are maintained over time and whether they translate into reduced long-term healthcare costs. Evaluating the model’s scalability and cost-effectiveness in diverse public sector settings across Greece would provide critical insights for broader implementation and inform national policy development. Upcoming studies should involve larger, more diverse groups across multiple regions to better capture variations in health behaviors and service needs. Longitudinal designs that track clinical and laboratory parameters such as blood pressure, lipid levels, HbA1c, and inflammatory markers would offer objective evidence of physiological benefits and improve risk stratification. Additionally, economic evaluations assessing cost-effectiveness and return on investment will be key to supporting long-term funding and policy integration of workplace health programs. A clear understanding of financial outcomes will help secure sustained support from public and private sector stakeholders [ 68 The integration of digital health tools should also be explored. Till today there are examples of digital tools that can promote healthy lifestyle behaviors within communities [ 69 70 71 72 73 74 75 76 77 Finally, policy implementation research should be conducted to investigate how workplace health programs can be effectively embedded within national and organizational health policy frameworks [ 78 4.3. Implications for Practice and Policy This study highlights the value of integrating preventive care into occupational health frameworks, particularly in public sector settings and the successful implementation of the mixed health service model carries important implications for both clinical practice and public health policy. The model proved both feasible and acceptable to employees, demonstrating its potential as a scalable solution for managing health risks and enhancing well-being. Embedding services such as health screenings, immunizations, and mental health evaluations within the workplace offers a more accessible and less stigmatizing approach to preventive care. This can lead to more comprehensive care, improved health outcomes, and reduced long-term healthcare costs. Occupational health services should extend beyond regulatory compliance and include routine screening, vaccination, and psychosocial support. The high satisfaction reported in this study suggests employees value personalized, accessible care. Tools such as the PSS-14 and PHQ-9 facilitate early identification of risk and enable tailored interventions for vulnerable individuals [ 79 80 81 82 83 84 85 At the policy level, the findings underscore the need for legislative and organizational reforms that integrate workplace health services into the public sector while addressing barriers and implementation challenges [ 86 87 88 89 90 91 92 93 94 95 96 97 98 99 100 101 Sustained public investment in workplace health programs is essential. Dedicated funding should support both implementation and training for occupational health professionals, ensuring delivery of comprehensive, high-quality care [ 102 103 104 105 106 75 107 108 109 110 111 112 In conclusion, this study reinforces the potential of integrated, workplace-based preventive health models to improve employee well-being and reduce healthcare costs. Embedding such approaches into national strategies can strengthen workforce health, advance population health goals, and ensure sustainable improvements in public sector health outcomes. 5. Conclusions The present study illustrates the feasibility, acceptability, and potential utility of a mixed health service model that bridges primary preventive care and occupational health within the public sector workforce. The integration of these services enabled early identification of unmet health needs—particularly those related to lifestyle risk factors, metabolic syndrome, inadequate immunization coverage, and high psychosocial stress—reflecting broader systemic gaps in adult preventive healthcare for Greece. By delivering targeted, individualized interventions during structured consultations, the model achieved a high intervention-to-participant ratio and elicited positive user feedback. These findings suggest that embedding preventive strategies into occupational settings is both a practical and impactful approach to improving employee health outcomes, particularly in systems where access to routine preventive care remains fragmented or underutilized. Nevertheless, the study is exploratory in nature, with limitations including a relatively small and localized sample and lack of a control group.”. Future research should focus on scaling this approach across broader geographic and institutional settings, incorporating longitudinal impact assessments, cost-effectiveness evaluations, and exploring digital health tools to enhance service continuity and integration. Acknowledgments The authors acknowledge the public servants of the Regional Unit of Crete for their willingness to participate in this study. Disclaimer/Publisher’s Note: Supplementary Materials The following supporting information can be downloaded at: https://www.mdpi.com/article/10.3390/healthcare13182337/s1 Author Contributions Conceptualization, E.K.S., G.P. and A.P.; methodology, N.F., M.T., S.D.K., N.P., C.V.-C., A.K. and E.K.S.; formal analysis, N.F. and M.L.; investigation, N.F., M.T. and S.D.K.; resources, M.T., S.D.K., N.P., A.K., G.P. and A.P.; data curation, M.S. and M.L.; writing—original draft preparation, C.V.-C., N.F., M.S. and M.L.; writing—review and editing, M.S. and E.K.S.; Supervision E.K.S. All authors have read and agreed to the published version of the manuscript. Institutional Review Board Statement The study was conducted in accordance with the Declaration of Helsinki and approved on 4 November 2024 by the Ethics Committee of University of Crete (protocol code: 131). Informed Consent Statement Informed consent was obtained from all subjects involved in the study. Data Availability Statement The original contributions presented in this study are included in the article/ Supplementary Material Conflicts of Interest The authors declare no conflicts of interest. References 1. Global Status Report on Noncommunicable Diseases 2014 Available online: https://www.who.int/publications/i/item/9789241564854 (accessed on 21 July 2025) 2. Healthy Workplaces: A Model for Action Available online: https://www.who.int/publications/i/item/9789241599313 (accessed on 21 July 2025) 3. Cancelliere C. Cassidy J.D. Ammendolia C. Côté P. Are Workplace Health Promotion Programs Effective at Improving Presenteeism in Workers? A Systematic Review and Best Evidence Synthesis of the Literature BMC Public Health 2011 11 395 10.1186/1471-2458-11-395 21615940 PMC3123596 4. Economou C. Kaitelidou D. Kentikelenis A. Maresso A. Sissouras A. The Impact of the Crisis on the Health System and Health in Greece Economic Crisis, Health Systems and Health in Europe: Country Experience [Internet] European Observatory on Health Systems and Policies Copenhagen, Denmark 2015 28837306 5. Zavras D. Tsiantou V. Pavi E. Mylona K. Kyriopoulos J. Impact of Economic Crisis and Other Demographic and Socio-Economic Factors on Self-Rated Health in Greece Eur. J. Public Health 2013 23 206 210 10.1093/eurpub/cks143 23093716 6. Myloneros T. Sakellariou D. The Effectiveness of Primary Health Care Reforms in Greece towards Achieving Universal Health Coverage: A Scoping Review BMC Health Serv. Res. 2021 21 628 10.1186/s12913-021-06678-9 34193124 PMC8247133 7. Economou C. Barriers and Facilitating Factors in Access to Health Services in Greece World Health Organization Regional Office for Europe Copenhagen, Denmark 2015 8. LaMontagne A.D. Keegel T. Louie A.M. Ostry A. Landsbergis P.A. A Systematic Review of the Job-Stress Intervention Evaluation Literature, 1990-2005 Int. J. Occup. Environ. Health 2007 13 268 280 10.1179/OEH.2007.13.3.268 17915541 9. Eiden A.L. Barratt J. Nyaku M.K. Drivers of and Barriers to Routine Adult Vaccination: A Systematic Literature Review Hum. Vaccin. Immunother. 2022 18 2127290 10.1080/21645515.2022.2127290 36197070 PMC9746483 10. Guglielmi V. Colangeli L. Parrotta M.E. Ciammariconi A. Milani I. D’Adamo M. Sbraccia P. Capoccia D. Social Isolation and Loneliness in Non-Communicable Chronic Diseases: Impact of COVID-19 Pandemic, Population Aging and Technological Progress Nutr. Metab. Cardiovasc. Dis. 2025 35 104015 10.1016/j.numecd.2025.104015 40189996 11. Filip R. Gheorghita Puscaselu R. Anchidin-Norocel L. Dimian M. Savage W.K. Global Challenges to Public Health Care Systems during the COVID-19 Pandemic: A Review of Pandemic Measures and Problems J. Pers. Med. 2022 12 1295 10.3390/jpm12081295 36013244 PMC9409667 12. Overview of the Implementation of COVID-19 Vaccination Strategies and Deployment Plans in the EU/EEA Available online: https://www.ecdc.europa.eu/en/publications-data/overview-implementation-covid-19-vaccination-strategies-and-deployment-plans (accessed on 21 July 2025) 13. Vardavas C. Nikitara K. Aslanoglou K. Lagou I. Marou V. Phalkey R. Leonardi-Bee J. Fernandez E. Vivilaki V. Kamekis A. Social Determinants of Health and Vaccine Uptake During the First Wave of the COVID-19 Pandemic: A Systematic Review Prev. Med. Rep. 2023 35 102319 10.1016/j.pmedr.2023.102319 37564118 PMC10410576 14. Dermitzakis I. Evangelidis N. Evangelidis P. Anestis A. Knowledge, Attitudes, and Perceptions Regarding COVID-19 Outbreak in Greece in September 2020: A Cross-Sectional Web-Based Survey Hippokratia 2021 25 15 21 35221651 PMC8877924 15. Galanis P. Moisoglou I. Vraka I. Siskou O. Konstantakopoulou O. Katsiroumpa A. Kaitelidou D. Predictors of COVID-19 Vaccine Uptake in Healthcare Workers: A Cross-Sectional Study in Greece J. Occup. Environ. Med. 2021 64 e191 10.1097/JOM.0000000000002463 35467601 PMC9083308 16. Bouloukaki I. Christoforaki A. Christodoulakis A. Krasanakis T. Lambraki E. Pateli R. Markakis M. Tsiligianni I. Vaccination Coverage and Associated Factors of COVID-19 Uptake in Adult Primary Health Care Users in Greece Healthcare 2023 11 341 10.3390/healthcare11030341 36766916 PMC9914444 17. Tan L. Wang M.J. Modini M. Joyce S. Mykletun A. Christensen H. Harvey S.B. Preventing the Development of Depression at Work: A Systematic Review and Meta-Analysis of Universal Interventions in the Workplace BMC Med. 2014 12 74 10.1186/1741-7015-12-74 24886246 PMC4014627 18. Lassen A.D. Fagt S. Lennernäs M. Nyberg M. Haapalar I. Thorsen A.V. Møbjerg A.C.M. Beck A.M. The Impact of Worksite Interventions Promoting Healthier Food and/or Physical Activity Habits among Employees Working ‘around the Clock’ Hours: A Systematic Review Food Nutr. Res. 2018 2 62 10.29219/fnr.v62.1115 PMC6073101 30083088 19. Cohen S. Kamarck T. Mermelstein R. A Global Measure of Perceived Stress J. Health Soc. Behav. 1983 24 385 396 10.2307/2136404 6668417 20. Antoniou M. Fradelos E.C. Roumeliotaki T. Malli F. Emmanouil K.S. Papagiannis D. Assessing Mental Resilience with Individual and Lifestyle Determinants among Nursing Students: An Observational Study from Greece AIMS Public Health 2024 11 946 961 10.3934/publichealth.2024049 PMC11474322 39416894 21. Lionis C. Symvoulakis E.K. Markaki A. Petelos E. Papadakis S. Sifaki-Pistolla D. Papadakakis M. Souliotis K. Tziraki C. Integrated People-Centred Primary Health Care in Greece: Unravelling Ariadne’s Thread Prim. Health Care Res. Dev. 2019 20 e113 10.1017/S1463423619000446 31668150 PMC6683235 22. Tsiligianni I. Bouloukaki I. Papazisis G. Paganas A. Chatzimanolis E. Kalatharas M. Platakis I. Tirodimos I. Dardavesis T. Tsimtsiou Z. Vaccination Coverage and Predictors of Influenza, Pneumococcal, Herpes Zoster, Tetanus, Measles, and Hepatitis B Vaccine Uptake among Adults in Greece Public Health 2023 224 195 202 10.1016/j.puhe.2023.09.002 37820537 23. Tsachouridou O. Georgiou A. Naoum S. Vasdeki D. Papagianni M. Kotoreni G. Forozidou E. Tsoukra P. Gogou C. Chatzidimitriou D. Factors Associated with Poor Adherence to Vaccination against Hepatitis Viruses, Streptococcus Pneumoniae and Seasonal Influenza in HIV-Infected Adults Hum. Vaccin Immunother. 2019 15 295 304 10.1080/21645515.2018.1509644 30111224 PMC6422462 24. Papagiannis D. Rachiotis G. Mariolis A. Zafiriou E. Gourgoulianis K.I. Vaccination Coverage of the Elderly in Greece: A Cross-Sectional Nationwide Study Can. J. Infect. Dis. Med. Microbiol. 2020 2020 5459793 10.1155/2020/5459793 32670440 PMC7338982 25. Koloverou E. Panagiotakos D.B. Pitsavos C. Chrysohoou C. Georgousopoulou E.N. Pitaraki E. Metaxa V. Stefanadis C. 10-Year Incidence of Diabetes and Associated Risk Factors in Greece: The ATTICA Study (2002–2012) Rev. Diabet. Stud. 2014 11 181 189 10.1900/RDS.2014.11.181 25396406 PMC4310068 26. Kollia N. Panagiotakos D.B. Chrysohoou C. Georgousopoulou E. Tousoulis D. Stefanadis C. Papageorgiou C. Pitsavos C. Determinants of Healthy Ageing and Its Relation to 10-Year Cardiovascular Disease Incidence: The Attica Study Cent. Eur. J. Public Health 2018 26 3 9 10.21101/cejph.a5165 29684290 27. Petridou E. Syrigou E. Toupadaki N. Zavitsanos X. Willett W. Trichopoulos D. Determinants of Age at Menarche as Early Life Predictors of Breast Cancer Risk Int. J. Cancer 1996 68 193 198 10.1002/(SICI)1097-0215(19961009)68:2&#x0003c;193::AID-IJC9&#x0003e;3.0.CO;2-T 8900427 28. Faka A. Damigou E. Chrysohoou C. Barkas F. Vlachopoulou E. Dalmyras D. Vafia C. Michelis E. Loukina A. Mentzantonakis G. Twenty-Year Incidence Rates of Cardiovascular Disease in Greece: A Geospatial Analysis in the Attica Study Context, 2002–2022 J. Atheroscler. Prev. Treat. 2023 14 97 102 10.53590/japt.02.1050 29. Kapantais E. Tzotzas T. Ioannidis I. Mortoglou A. Bakatselos S. Kaklamanou M. Lanaras L. Kaklamanos I. First National Epidemiological Survey on the Prevalence of Obesity and Abdominal Fat Distribution in Greek Adults Ann. Nutr. Metab. 2006 50 330 338 10.1159/000094296 16825761 30. Tzanakis N. Koulouris N. Dimakou K. Gourgoulianis K. Kosmas E. Chasapidou G. Konstantinidis A. Kyriakopoulos C. Kontakiotis T. Rapti A. Classification of COPD Patients and Compliance to Recommended Treatment in Greece According to GOLD 2017 Report: The RELICO Study BMC Pulm. Med. 2021 21 216 10.1186/s12890-021-01576-6 34243744 PMC8268415 31. Zagkas D.G. Chrousos G.P. Bacopoulou F. Kanaka-Gantenbein C. Vlachakis D. Tzelepi I. Darviri C. Stress and Well-Being of Greek Primary School Educators: A Cross-Sectional Study Int. J. Environ. Res. Public Health 2023 20 5390 10.3390/ijerph20075390 37048004 PMC10093913 32. Baez A.S. Ortiz-Whittingham L.R. Tarfa H. Osei Baah F. Thompson K. Baumer Y. Powell-Wiley T.M. Social Determinants of Health, Health Disparities, and Adiposity Prog. Cardiovasc. Dis. 2023 78 17 26 10.1016/j.pcad.2023.04.011 37178992 PMC10330861 33. Kivimäki M. Nyberg S.T. Batty G.D. Fransson E.I. Heikkilä K. Alfredsson L. Bjorner J.B. Borritz M. Burr H. Casini A. Job Strain as a Risk Factor for Coronary Heart Disease: A Collaborative Meta-Analysis of Individual Participant Data Lancet 2012 380 1491 1497 10.1016/S0140-6736(12)60994-5 22981903 PMC3486012 34. National Cholesterol Education Program Expert Panel on Detection Evaluation and Treatment of High Blood Cholesterol in Adults Third Report of the National Cholesterol Education Program (NCEP) Expert Panel on Detection, Evaluation, and Treatment of High Blood Cholesterol in Adults (Adult Treatment Panel III) Final Report Circulation 2002 106 3143 3564 10.1161/circ.106.25.3143 12485966 35. National Adult Vaccination Program 2025. Timetable and Recommendations Available online: https://www.moh.gov.gr/articles/health/dieythynsh-dhmosias-ygieinhs/emboliasmoi/ethniko-programma-emboliasmwn-epe-enhlikwn/13219-ethniko-programma-emboliasmwn-enhlikwn-2025-xronodiagramma-kai-systaseis (accessed on 4 August 2025) 36. Karekla M. Pilipenko N. Feldman J. Patient Health Questionnaire: Greek Language Validation and Subscale Factor Structure Compr. Psychiatry 2012 53 1217 1226 10.1016/j.comppsych.2012.05.008 22901833 37. Katsarou A. Panagiotakos D. Zafeiropoulou A. Vryonis M. Ioannis Skoularigis Filippos Tryposkiadis Papageorgiou C. Validation of a Greek Version of PSS-14; A Global Measure of Perceived Stress Cent. Eur. J. Public Health 2012 20 104 109 10.21101/cejph.a3698 22966732 38. Kroenke K. Spitzer R.L. Williams J.B.W. The PHQ-9: Validity of a Brief Depression Severity Measure J. Gen. Intern. Med. 2001 16 606 613 10.1046/j.1525-1497.2001.016009606.x 11556941 PMC1495268 39. Iriti M. Varoni E.M. Vitalini S. Healthy Diets and Modifiable Risk Factors for Non-Communicable Diseases-The European Perspective Foods 2020 9 940 10.3390/foods9070940 32708711 PMC7404401 40. Valenzuela P.L. Santos-Lozano A. Saco-Ledo G. Castillo-García A. Lucia A. Obesity, Cardiovascular Risk, and Lifestyle: Cross-Sectional and Prospective Analyses in a Nationwide Spanish Cohort Eur. J. Prev. Cardiol. 2023 30 1493 1501 10.1093/eurjpc/zwad204 37317985 41. Castillo-García A. Valenzuela P.L. Saco-Ledo G. Carrera-Bastos P. Ruilope L.M. Santos-Lozano A. Lucia A. Lifestyle and Cardiovascular Risk in Working Young Adults: Insights from a Nationwide Spanish Cohort Rev. Española De Cardiol. íA (Engl. Ed.) 2024 77 821 831 10.1016/j.recesp.2024.02.006 38423178 42. Yusuf P.S. Hawken S. Ôunpuu S. Dans T. Avezum A. Lanas F. McQueen M. Budaj A. Pais P. Varigos J. Effect of Potentially Modifiable Risk Factors Associated with Myocardial Infarction in 52 Countries (the INTERHEART Study): Case-Control Study Lancet 2004 364 937 952 10.1016/S0140-6736(04)17018-9 15364185 43. Gallucci G. Tartarone A. Lerose R. Lalinga A.V. Capobianco A.M. Cardiovascular Risk of Smoking and Benefits of Smoking Cessation J. Thorac. Dis. 2020 12 3866 3876 10.21037/jtd.2020.02.47 32802468 PMC7399440 44. Milionis C. Ilias I. Tselebis A. Pachi A. Psychological and Social Aspects of Vaccination Hesitancy—Implications for Travel Medicine in the Aftermath of the COVID-19 Crisis: A Narrative Review Medicina 2023 59 1744 10.3390/medicina59101744 37893462 PMC10608755 45. Goje O. Kapoor A. Meeting the Challenge of Vaccine Hesitancy Cleve Clin. J. Med. 2024 91 S50 S56 10.3949/ccjm.91.s1.08 39231603 46. Singh P. Dhalaria P. Kashyap S. Soni G.K. Nandi P. Ghosh S. Mohapatra M.K. Rastogi A. Prakash D. Strategies to Overcome Vaccine Hesitancy: A Systematic Review Syst. Rev. 2022 11 78 10.1186/s13643-022-01941-4 35473819 PMC9044888 47. Fotiadis K. Dadouli K. Avakian I. Bogogiannidou Z. Mouchtouri V.A. Gogosis K. Speletas M. Koureas M. Lagoudaki E. Kokkini S. Factors Associated with Healthcare Workers’ (HCWs) Acceptance of COVID-19 Vaccinations and Indications of a Role Model towards Population Vaccinations from a Cross-Sectional Survey in Greece, May 2021 Int. J. Environ. Res. Public Health 2021 18 10558 10.3390/ijerph181910558 34639858 PMC8508507 48. Papagiannis D. Rachiotis G. Malli F. Papathanasiou I.V. Kotsiou O. Fradelos E.C. Giannakopoulos K. Gourgoulianis K.I. Acceptability of Covid-19 Vaccination among Greek Health Professionals Vaccines 2021 9 200 10.3390/vaccines9030200 33670913 PMC7997202 49. Pennisi F. Genovese C. Gianfredi V. Lessons from the COVID-19 Pandemic: Promoting Vaccination and Public Health Resilience, a Narrative Review Vaccines 2024 12 891 10.3390/vaccines12080891 39204017 PMC11359644 50. Rongen A. Robroek S.J.W. Van Lenthe F.J. Burdorf A. Workplace Health Promotion: A Meta-Analysis of Effectiveness Am. J. Prev. Med. 2013 44 406 415 10.1016/j.amepre.2012.12.007 23498108 51. Proper K.I. Van Oostrom S.H. The Effectiveness of Workplace Health Promotion Interventions on Physical and Mental Health Outcomes—A Systematic Review of Reviews Scand. J. Work Environ. Health 2019 45 546 559 10.5271/sjweh.3833 31134284 52. Joyce S. Modini M. Christensen H. Mykletun A. Bryant R. Mitchell P.B. Harvey S.B. Workplace Interventions for Common Mental Disorders: A Systematic Meta-Review Psychol. Med. 2016 46 683 697 10.1017/S0033291715002408 26620157 53. Sorensen G. Landsbergis P. Hammer L. Amick B.C. Linnan L. Yancey A. Welch L.S. Goetzel R.Z. Flannery K.M. Pratt C. Preventing Chronic Disease in the Workplace: A Workshop Report and Recommendations Am. J. Public Health 2011 101 S196 S207 10.2105/AJPH.2010.300075 21778485 PMC3222510 54. The New European Framework for Action on Integrated Health Services Delivery Available online: https://www.who.int/europe/multi-media/item/the-new-european-framework-for-action-on-integrated-health-services-delivery (accessed on 21 July 2025) 55. Ammendolia C. Côté P. Cancelliere C. Cassidy J.D. Hartvigsen J. Boyle E. Soklaridis S. Stern P. Amick B. Healthy and Productive Workers: Using Intervention Mapping to Design a Workplace Health Promotion and Wellness Program to Improve Presenteeism BMC Public Health 2016 16 1190 10.1186/s12889-016-3843-x 27884132 PMC5123329 56. Poscia A. Moscato U. La Milia D.I. Milovanovic S. Stojanovic J. Borghini A. Collamati A. Ricciardi W. Magnavita N. Workplace Health Promotion for Older Workers: A Systematic Literature Review BMC Health Serv. Res. 2016 16 415 428 10.1186/s12913-016-1518-z 27609070 PMC5016729 57. Bergerman L. Corabian P. Harstall C. Effectiveness of Organizational Interventions for the Prevention of Workplace Stress IHE Rep. 2009 58. Proper K. Van Mechelen W. Effectiveness and Economic Impact of Worksite Interventions to Promote Physical Activity and Healthy Diet World Health Organization Geneva, Switzerland 2007 59. Caring for Those Who Care: Guide for the Development and Implementation of Occupational Health and Safety Programmes for Health Workers Available online: https://www.who.int/publications/i/item/9789240040779 (accessed on 21 July 2025) 60. Good Practice in Occupational Health Services: A Contribution to Workplace Health Available online: https://iris.who.int/handle/10665/107448 (accessed on 21 July 2025) 61. Global Strategy on Occupational Health for All: The Way to Health at Work Available online: https://wkc.who.int/resources/publications/i/item/global-strategy-on-occupational-health-for-all-the-way-to-health-at-work (accessed on 21 July 2025) 62. Buijs P. Gunnyeon B. Van Weel C. Primary Health Care: What Role for Occupational Health? Br. J. Gen. Pract. 2012 62 623 624 10.3399/bjgp12X659141 23211235 PMC3505386 63. Safe and Healthy Workplaces in Europe: Where Do We Stand in 2023?|Safety and Health at Work EU-OSHA Available online: https://osha.europa.eu/en/publications/safe-and-healthy-workplaces-europe-where-do-we-stand-2023 (accessed on 21 July 2025) 64. European Agency for Safety & Health at Work—Information, Statistics, Legislation and Risk Assessment Tools Available online: https://osha.europa.eu/en (accessed on 21 July 2025) 65. Health Services Delivery Programme, Division of Health Systems and Public Health The European Framework for Action on Integrated Health Services Delivery: An Overview WHO Copenhagen Ø, Denmark 2016 66. Mental Health and Work: Impact, Issues and Good Practices Available online: https://iris.who.int/handle/10665/42346 (accessed on 21 July 2025) 67. Psychosocial Risks in Europe: Prevalence and Strategies for Prevention | European Foundation for the Improvement of Living and Working Conditions Available online: https://www.eurofound.europa.eu/en/publications/2014/psychosocial-risks-europe-prevalence-and-strategies-prevention (accessed on 21 July 2025) 68. Sun L. Booth A. Sworn K. Adaptability, Scalability and Sustainability (ASaS) of Complex Health Interventions: A Systematic Review of Theories, Models and Frameworks Implement Sci. 2024 19 52 10.1186/s13012-024-01375-7 39020399 PMC11253497 69. Anders C. Moorthy P. Svensson L. Müller J. Heinze O. Knaup P. Wallwiener M. Deutsch T.M. Le T.-V. Weinert L. Usability and User Experience of an MHealth App for Therapy Support of Patients with Breast Cancer: Mixed Methods Study Using Eye Tracking JMIR Hum. Factors 2024 11 e50926 10.2196/50926 38441959 PMC10951836 70. Overdijkink S.B. Velu A.V. Rosman A.N. van Beukering M.D.M. Kok M. Steegers-Theunissen R.P.M. The Usability and Effectiveness of Mobile Health Technology–Based Lifestyle and Medical Intervention Apps Supporting Health Care during Pregnancy: Systematic Review JMIR Mhealth Uhealth 2018 6 e109 10.2196/mhealth.8834 29691216 PMC5941088 71. Regan C. Von Rosen P. Andermo S. Hagströmer M. Johansson U.B. Rossen J. The Acceptability, Usability, Engagement and Optimisation of a MHealth Service Promoting Healthy Lifestyle Behaviours: A Mixed Method Feasibility Study Digit Health 2024 10 20552076241247935 10.1177/20552076241247935 38638403 PMC11025415 72. Rowland S. Ramos A.K. Trinidad N. Quintero S. Johnson Beller R. Struwe L. Pozehl B. Feasibility, Usability and Acceptability of a MHealth Intervention to Reduce Cardiovascular Risk in Rural Hispanic Adults: Descriptive Study JMIR Form. Res. 2022 6 e40379 10.2196/40379 36563025 PMC9823566 73. Bergevi J. Andermo S. Woldamanuel Y. Johansson U.B. Hagströmer M. Rossen J. User Perceptions of EHealth and MHealth Services Promoting Physical Activity and Healthy Diets: Systematic Review JMIR Hum. Factors 2022 9 e34278 10.2196/34278 35763339 PMC9277535 74. Spanakis M. Sfakianakis S. Kallergis G. Spanakis E.G. Sakkalis V. PharmActa: Personalized Pharmaceutical Care EHealth Platform for Patients and Pharmacists J. Biomed. Inf. 2019 100 103336 10.1016/j.jbi.2019.103336 31689550 75. Olawade D.B. Wada O.J. David-Olawade A.C. Kunonga E. Abaire O. Ling J. Using Artificial Intelligence to Improve Public Health: A Narrative Review Front. Public Health 2023 11 1196397 10.3389/fpubh.2023.1196397 37954052 PMC10637620 76. Iribarren S.J. Akande T.O. Kamp K.J. Barry D. Kader Y.G. Suelzer E. Effectiveness of Mobile Apps to Promote Health and Manage Disease: Systematic Review and Meta-Analysis of Randomized Controlled Trials JMIR Mhealth Uhealth 2021 9 e21563 10.2196/21563 33427672 PMC7834932 77. Mezzalira E. Canzan F. Marini G. Longhini J. Leardini C. Saiani L. Ambrosi E. Introduction of Novel Complex Integrated Care Models Supported by Digital Health Interventions in European Primary Settings: A Scoping Review Health Policy Technol. 2024 13 100896 10.1016/j.hlpt.2024.100896 78. Oh A. Abazeed A. Chambers D.A. Policy Implementation Science to Advance Population Health: The Potential for Learning Health Policy Systems Front. Public Health 2021 9 681602 10.3389/fpubh.2021.681602 34222180 PMC8247928 79. Newman M.W. Value Added? A Pragmatic Analysis of the Routine Use of PHQ-9 and GAD-7 Scales in Primary Care Gen. Hosp. Psychiatry 2022 79 15 18 10.1016/j.genhosppsych.2022.09.005 36209615 80. Carroll H.A. Hook K. Perez O.F.R. Denckla C. Vince C.C. Ghebrehiwet S. Ando K. Touma M. Borba C.P.C. Fricchione G.L. Establishing Reliability and Validity for Mental Health Screening Instruments in Resource-Constrained Settings: Systematic Review of the PHQ-9 and Key Recommendations Psychiatry Res. 2020 291 113236 10.1016/j.psychres.2020.113236 32593853 PMC7484202 81. Ford J. Thomas F. Byng R. McCabe R. Use of the Patient Health Questionnaire (PHQ-9) in Practice: Interactions between Patients and Physicians Qual. Health Res. 2020 30 2146 2159 10.1177/1049732320924625 32564676 PMC7549295 82. Iles R. Sheppard D.M. Establishing Key Domains for Measuring Workplace Mental Health: The Indicators of A Thriving Workplace Survey J. Occup. Rehabil. 2025 10.1007/S10926-025-10302-6 40411687 83. Wagner S.L. Koehn C. White M.I. Harder H.G. Schultz I.Z. Williams-Whitt K. Wärje O. Dionne C.E. Koehoorn M. Pasca R. Mental Health Interventions in the Workplace and Work Outcomes: A Best-Evidence Synthesis of Systematic Reviews Int. J. Occup. Environ. Med. 2016 7 1 14 10.15171/ijoem.2016.607 26772593 PMC6816521 84. Pearl R.L. Weight Bias and Stigma: Public Health Implications and Structural Solutions Soc. Issues Policy Rev. 2018 12 146 182 10.1111/sipr.12043 85. Gray N.S. Davies H. Snowden R.J. Reducing Stigma and Increasing Workplace Productivity Due to Mental Health Difficulties in a Large Government Organization in the UK: A Protocol for a Randomised Control Treatment Trial (RCT) of a Low Intensity Psychological Intervention and Stigma Reduction Programme for Common Mental Disorder (Prevail) BMC Public Health 2020 20 896 10.1186/s12889-020-09054-0 32517674 PMC7285777 86. Biswas A. Begum M. Van Eerd D. Johnston H. Smith P.M. Gignac M.A.M. Integrating Safety and Health Promotion in Workplaces: A Scoping Review of Facilitators, Barriers, and Recommendations Health Promot. Pr. 2022 23 984 998 10.1177/15248399211028154 34596446 87. Wilcox A. Koontz A. Workplace Well-Being: Shifting from an Individual to an Organizational Framework Sociol. Compass 2022 16 e13035 10.1111/soc4.13035 88. Guest D.E. Human Resource Management and Employee Well-Being: Towards a New Analytic Framework Hum. Resour. Manag. J. 2017 27 22 38 10.1111/1748-8583.12139 89. Motalebi G. M. Keshavarz Mohammadi N. Kuhn K. Ramezankhani A. Azari M.R. How Far Are We from Full Implementation of Health Promoting Workplace Concepts? A Review of Implementation Tools and Frameworks in Workplace Interventions Health Promot. Int. 2018 33 488 504 10.1093/heapro/daw098 28065884 90. Review of Social Determinants and the Health Divide in the WHO European Region Available online: https://www.who.int/publications/i/item/9789289000307 (accessed on 5 September 2025) 91. Andersen J.H. Malmros P. Ebbehoej N.E. Flachs E.M. Bengtsen E. Bonde J.P. Systematic Literature Review on the Effects of Occupational Safety and Health (OSH) Interventions at the Workplace Scand. J. Work Environ. Health 2019 45 103 113 10.5271/sjweh.3775 30370910 92. Bondebjerg A. Filges T. Pejtersen J.H. Kildemoes M.W. Burr H. Hasle P. Tompa E. Bengtsen E. Occupational Health and Safety Regulatory Interventions to Improve the Work Environment: An Evidence and Gap Map of Effectiveness Studies Campbell Syst. Rev. 2023 19 e1371 10.1002/cl2.1371 38089568 PMC10712440 93. Walters D. Johnstone R. Improving Compliance with Occupational Safety and Health Regulations: An Overarching Review European Risk Observatory Literature Review European Agency for Safety and Health at Work Bilbao, Spain 2021 94. Brenner H. Heisser T. Cardoso R. Hoffmeister M. Reduction in Colorectal Cancer Incidence by Screening Endoscopy Nat. Rev. Gastroenterol. Hepatol. 2024 21 125 133 10.1038/s41575-023-00847-3 37794234 95. Heisser T. Sergeev D. Hoffmeister M. Brenner H. Contributions of Early Detection and Cancer Prevention to Colorectal Cancer Mortality Reduction by Screening Colonoscopy: A Validated Modeling Study Gastrointest. Endosc. 2024 100 710 717.e9 10.1016/j.gie.2024.03.010 38462054 96. Shattock A.J. Johnson H.C. Sim S.Y. Carter A. Lambach P. Hutubessy R.C.W. Thompson K.M. Badizadegan K. Lambert B. Ferrari M.J. Contribution of Vaccination to Improved Survival and Health: Modelling 50 Years of the Expanded Programme on Immunization Lancet 2024 403 2307 2316 10.1016/S0140-6736(24)00850-X 38705159 PMC11140691 97. Braveman P. Gottlieb L. The Social Determinants of Health: It’s Time to Consider the Causes of the Causes Public Health Rep. 2014 129 19 31 10.1177/00333549141291S206 24385661 PMC3863696 98. Verra S.E. Benzerga A. Jiao B. Ruggeri K. Health Promotion at Work: A Comparison of Policy and Practice Across Europe Saf. Health Work 2018 10 21 10.1016/j.shaw.2018.07.003 30949377 PMC6428991 99. Gagliardi D. Marinaccio A. Valenti A. Iavicoli S. Occupational Safety and Health in Europe: Lessons from the Past, Challenges and Opportunities for the Future Ind. Health 2012 50 7 11 10.2486/indhealth.MS1342 22327067 100. Baicker K. Cutler D. Song Z. Workplace Wellness Programs Can Generate Savings Health Aff. 2010 29 304 311 10.1377/hlthaff.2009.0626 20075081 101. Tsiligianni I. Anastasiou F. Antonopoulou M. Chliveros K. Dimitrakopoulos S. Duijker G. Kounalakis D. Makri K. Petraki C. Prokopiadou D. Greek Rural Gps’ Opinions on How Financial Crisis Influences Health, Quality of Care and Health Equity Rural Remote Health 2013 13 309 312 23527486 102. Carter M.W. Simone P.M. Houry D.E. Reynolds S.L. Patterson S.S. Carlson J.E. Dauphin L.A. Centers for Disease Control and Prevention’s Public Health Infrastructure Grant: A Better Approach to Empowering More State and Local Decision Making and Strengthening the Public Health Workforce and Infrastructure J. Public Health Manag. Pr. 2024 31 E88 10.1097/PHH.0000000000002055 PMC11757086 39236321 103. Committee on Public Health Strategies to Improve Health Funding Sources and Structures to Build Public Health National Academies Press Washington, DC, USA 2012 104. Spanakis M. Stamou M. Boultadaki S. Liantis E. Lionis C. Marinos G. Mariolis A. Matthaiou A.M. Mihas C. Mouchtouri V. Enhancing Competencies and Professional Upskilling of Mobile Healthcare Unit Personnel at the Hellenic National Public Health Organization Healthcare 2025 13 1706 10.3390/healthcare13141706 40724731 PMC12296029 105. Empowerment Through Digital Health Available online: https://www.who.int/europe/initiatives/empowerment-through-digital-health (accessed on 21 July 2025) 106. Odone A. Buttigieg S. Ricciardi W. Azzopardi-Muscat N. Staines A. Public Health Digitalization in Europe Eur. J. Public Health 2019 29 28 35 10.1093/eurpub/ckz161 31738441 PMC6859512 107. Alderwick H. Hutchings A. Briggs A. Mays N. The Impacts of Collaboration between Local Health Care and Non-Health Care Organizations and Factors Shaping How They Work: A Systematic Review of Reviews BMC Public Health 2021 21 753 10.1186/s12889-021-10630-1 33874927 PMC8054696 108. Higgins O. Short B.L. Chalup S.K. Wilson R.L. Artificial Intelligence (AI) and Machine Learning (ML) Based Decision Support Systems in Mental Health: An Integrative Review Int. J. Ment. Health Nurs. 2023 32 966 978 10.1111/inm.13114 36744684 109. Tabrizi J.S. Azami-aghdash S. Gharaee H. Public-Private Partnership Policy in Primary Health Care: A Scoping Review J. Prim. Care Community Health 2020 11 2150132720943769 10.1177/2150132720943769 32842863 PMC7453464 110. Awad A. Trenfield S.J. Pollard T.D. Ong J.J. Elbadawi M. McCoubrey L.E. Goyanes A. Gaisford S. Basit A.W. Connected Healthcare: Improving Patient Care Using Digital Health Technologies Adv. Drug Deliv. Rev. 2021 178 113958 10.1016/j.addr.2021.113958 34478781 111. Plans-Rubió P. Strategies to Increase the Percentages of Vaccination Coverage Vaccines 2022 10 2103 10.3390/vaccines10122103 36560513 PMC9785452 112. WHO Mental Health at Work Available online: https://www.who.int/news-room/fact-sheets/detail/mental-health-at-work (accessed on 21 July 2025) Figure 1 Prevalence of chronic conditions among the study’s participants. (Abbreviations: DM: Diabetes Melitus; CHD: Coronary Heart Disease; GE: gastroenterological disease; COPD: Chronic Obstructive Pulmonary Disease; SLE: Systemic Lupus Erythematosus; CKD: Chronic Kidney Disease). Figure 2 Frequency and trends of diagnostic tests or check-ups in the last 12 months (green) over recommendations/prescriptions for proactive action during interview (light green) among study’s participants. Sufficient trends exist between certain proactive actions. Percentages are calculated according to the number of individuals in each subgroup. Deviations from 100% are due to either pending appointments with their own doctor, testing on individual demand, or denial to adopt specific advice. (Tdap: Tetanus, Diphtheria, and Acellular Pertussis vaccine; PCV: Pneumococcal Conjugate Vaccine; RZV: Recombinant Zoster Vaccine; Pap test: Papanicolaou test (commonly called Pap smear); PSA test: Prostate-Specific Antigen test). Figure 3 Mean levels of satisfaction scale regarding the Provision and Reception of Services from the Current Health Assessment of study participants. healthcare-13-02337-t001_Table 1 Table 1 Demographic characteristics of 154 participants in the current study.   n % Gender males/females 48/106 31.2/68.8 Age, years mean ± stand. dev. 54.0 ± 6.1  50+ years 112 72.7  60+ years 26 16.2 Education level High school 25 16.2  University/Technical School 66 42.9  MSc 53 34.4  PhD 10 6.5 Smoking nonsmokers 80 51.9  ex 36 23.4  current 38 24.7 Cigarettes/day median (IQR) 15 (10, 20) Years of smoking median (IQR) 29 (20.0, 35.0) Alcohol consumption (at least half of drink per day) yes 15 9.8 Sleep hours at night mean ± stand. dev. 6.5 ± 1.2 Body Mass Index, kg/m 2 mean ± stand. dev. 28.3 ± 5.8  Overweight/obese 62/45 40.3/29.2 MSc: A Master of Science; PhD: Doctor of Philosophy; IQR: Interquartile Range; stand. dev.: Standard deviation. healthcare-13-02337-t002_Table 2 Table 2 Levels and frequencies of five MetS risk factors among 154 participants.  Total (n = 130) Males (n = 32) Females (n = 88)  Risk Factors & MetS Criteria a Mean ± Stand. dev. p b SBP (mmHg) 134.4 ± 17.4 143.0 ± 19.0 130.2 ± 15.0 <0.001 DBP (mmHg) 86.7 ± 11.6 89.8 ± 11.7 85.2 ± 11.4 0.037 >130/85 72.3% 83.3% 67.0% 0.052 Fasting glucose (mg/dL) 99.3 ± 15.3 102.4 ± 17.5 97.8 ± 14.0 0.103 ≥100 35.4% 45.2% 30.7% 0.105 Triglycerides (mg/dL) 98.5 ± 47.3 108.2 ± 55.9 93.9 ± 42.2 0.106 ≥150 13.1% 16.7% 11.4% 0.402 HDL cholesterol (mg/dL) 59.1 ± 12.8 52.5 ± 12.6 62.3 ± 11.6 <0.001 <40 (M), <50 (F) 16.9% 19.0% 15.9% 0.655 Waist circumference (cm) 98.3 ± 18.6 110.6 ± 17.9 92.4 ± 16.0 <0.001 >102 (M), >88 (F) 59.2% 73.8% 52.3% 0.019 MetS risk factors none 15.4% 7.2% 19.3% 0.029 1 22.3% 19.0% 23.9% 2 29.2% 23.8% 31.8% 3+ or MetS 33.1% 50.0% 25.0% a b t 2 healthcare-13-02337-t003_Table 3 Table 3 Vaccination status of study’s participants. Vaccine Type Vaccination Status n % TD or Tdap or Tdap-IPV Initial Vaccination 94 61.0  Booster dose at age 18–25 with Tdap or Tdap-IPV 43 27.9  Booster dose in the last decade with TD or Tdap 17 11.0 RZV (>60 years & immunocompromised) no 20 76.9  yes 6 23.1 PCV20 or prior (PCV13, PPSV23) * no 53 82.8  yes 11 17.2 * adults ≥ 65 years or 18–64 years with chronic conditions or immunocompromising states, as defined by the Greek National Vaccination Program. Abbreviations: Td/Tdap/Tdap-IPV: tetanus–diphtheria–pertussis vaccine; PCV20: 20-valent pneumococcal conjugate vaccine; RZV: recombinant zoster (shingles) vaccine. healthcare-13-02337-t004_Table 4 Table 4 Score levels of PSS-14 and PHQ-9 scales of study’s participants. Scales Mean Stand. Dev. Median PSS Score a 23.7 7.4 24.0 low (0–13) n = 10 or 6.6% moderate (14–26) n = 88 or 58.3% high (27–42) n = 53 or 35.1% PHQ-9 Score b 4.3 4.3 3.0 none-minimal (0–4) n = 92 or 60.9% mild (5–9) n = 43 or 28.5% moderate to severe (10–27) n = 16 or 10.6% a b 38 healthcare-13-02337-t005_Table 5 Table 5 Preventive health actions as they suggested to study participants. Proactive Action/Recommendation/Prescription n % Vaccination 141 91.6 Biochemical blood test 106 68.8 Lifestyle Counseling 97 63.0 Socio-demographic screenings & preventive tests 69 44.8 Pharmacological intervention/prescription 49 31.8 Other actions 14 9.1 ",
  "metadata": {
    "Title of this paper": "Mental Health at Work",
    "Journal it was published in:": "Healthcare",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12469704/"
  }
}