{
  "title": "Paper_119",
  "abstract": "pmc Asian J Urol Asian J Urol 3358 ajur Asian Journal of Urology 2214-3882 2214-3890 Second Military Medical University PMC12490686 PMC12490686.1 12490686 12490686 10.1016/j.ajur.2024.09.007 S2214-3882(24)00136-X 1 Original Article Investigation of the clinical significance of the expression of immunohistochemical biomarkers Enhancer of zeste homolog 2 and Forkhead box M1 in localized prostate cancer tissue: A Greek retrospective study Koubardas Sotirios koubardas@gmail.com a ⁎ 1 Goutas Dimitrios a Mani Iliana b Krikou Evangelia a Mpatsi Ourania c Gakiopoulou Harikleia a Alamanis Christos d Lazaris Andreas C. a 1 a b c d ⁎ koubardas@gmail.com 1 The authors contributed equally to this work. 7 2025 19 12 2024 12 3 498204 357 365 3 9 2023 2 9 2024 19 12 2024 03 10 2025 03 10 2025 © 2025 Editorial Office of Asian Journal of Urology. Publishing services by Elsevier B.Vé. 2025 Editorial Office of Asian Journal of Urology https://creativecommons.org/licenses/by-nc-nd/4.0/ This is an open access article under the CC BY-NC-ND license (http://creativecommons.org/licenses/by-nc-nd/4.0/). Objective In recent decades, studies have underscored nuclear proteins and signaling pathways in prostate cancer (PCa) development. Key biomarkers like Enhancer of zeste homolog 2 (EZH2) and Forkhead box M1 (FOXM1) are expressed in both healthy and malignant prostate cells. This study aimed to demonstrate the relationship between pathological characteristics, survival, recurrence, and tissue expression of EZH2 and FOXM1 in high-risk PCa patients. Methods PCa tissues were used in a retrospective analysis that spanned from September 2009 to August 2019. Inclusion criteria comprised pathological tumor stage (pT) 3 patients with positive surgical margins or tumor proximity to inked margins within 5 mm. After case selection, tissue slides were stained for EZH2 and FOXM1 antibodies, and Allred scores were calculated. Patients or relatives of deceased patients were contacted for signed agreements and disease follow-ups. Results The pT3b, ductal carcinoma component, and moderate EZH2 expression were associated with relapse (odds ratio [OR] 6.21, 95% confidence interval [CI] 1.41–27.27, p p p p p vs. p Conclusion Sufficient immunoexpression of EZH2, ductal carcinoma component, and neoplastic proliferation in the seminal vesicles, apex and neck of the prostate gland correlates with elevated risks of recurrence and mortality. Clinicians should use these criteria for appropriate patient referrals, and a multicenter trial could provide accurate classifications. Keywords Death Enhancer of zeste homolog 2 Forkhead box M1 Prostate cancer Relapse pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement yes pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes 1 Introduction In 2023, prostate cancer (PCa) is predicted to cause 34 700 fatalities and 288 300 new cases in the United States [ 1 2 3 4 5 4 5 6 7 8 EZH2, the catalytic subunit of Polycomb repressive complex 2 (PRC2), is overexpressed in human solid tumors including PCa, and its expression and activity are associated with disease progression [ 9 10 11 12 13 14 15 FOXM1 16 17 7 18 This study optimized immunostaining for pathology and EZH2/FOXM1 expression in high-risk PCa patients with PSM and pT3. The aim was to explore the relevance of biomarkers to relapse and death in the Greek population. Primary findings suggested an EZH2-PCa relapse link, but not for overall survival. Relapse was defined as either distant or local metastases and/or BR. The pT3b, ductal carcinoma component, and moderate EZH2 expression were associated with relapse. Secondary findings showed a risk increase for pT3b versus pT3a in relapse or death. Ductal characteristics and apex and neck invasion can also raise the risk. Radiotherapy and biomarkers' role in relapse or death were assessed and will be detailed separately. Findings on these aspects will be presented separately due to the abundance of information and various interests. The study underscored EZH2 and FOXM1 as therapeutically relevant biomarkers for tailored therapy guidance. 2 Materials and methods 2.1 Patients After obtaining the ethical approval (Ref. No 12626/30-08-09-19) from the Laiko Hospital of Athens, we conducted a retrospective cohort study on localized PCa patients diagnosed between September 2009 and August 2019 at the same hospital. Inclusion criteria encompassed localized PCa patients without metastasis and no prior cancer history. Specifically, PCa patients with pT3, pathological regional lymph node stage (pN) x/0/1, and PSM (recorded on medical reports as R + + 2.2 Immunohistochemical staining Representative paraffin-embedded tissue blocks were selected for immunohistochemistry using commercially available antibodies for EZH2 and FOXM1 (anti-KMT6/EZH2 antibody [11/EZH2] and anti-FOXM1 antibody [ EPR17379 2 2 2.3 Microscopic evaluation Together with the other two independent pathologists, a third pathologist utilized the Allred score to visually assess the slides at magnifications ranging from 40× to 200×. This scoring system evaluated EZH2 and FOXM1 expression in carcinomas, considering the positive cell percentage and reaction product intensity. Malignancy is assigned an intensity score (0–3) denoting negative, mild, moderate, and strong staining. Tumors receive proportion ratings (0–5: no cells, ≤1%, 2%–10%, 11%–33%, 34%–66%, and 67%–100% of cells, respectively) based on the positive cell percentage. The Allred score, ranging 0–8, results from intensity and proportion factors. Scores categorize stained cells into negative (0–1), weak (2–3), moderate (4–6), and strong (7–8). 2.4 Statistical analysis Quantitative variables were expressed as means with standard deviations, and medians and interquartile ranges, while categorical variables were shown as frequencies and percentages. The univariate analysis investigated the relationship between outcome variables (relapse: no vs vs t p 3 Results Among our 100 patients, the median age was 66.0 (range 47.0–77.0) years, with a median follow-up of 7.62 years. Ten percent died, and 26% needed therapy for recurrence. The median survival time and recurrence time were 5.4 years and 2.6 years, respectively. Clinical and pathological data of the whole cohort are summarized in Table 1 Figs. 1 2 Table 1 Clinical and pathological variables of patients ( n Table 1 Variable Value Age, mean±SD (range), year 66.0±6.6 (47.0–77.0) Gleason score, mean±SD (range) 8±1 (6–9) Death, no/yes 90 (90)/10 (10) Relapse, no/yes 74(74)/26 (26) Radiotherapy, no/yes 50(50)/50 (50) Hormonotherapy, no/yes 62 (62)/38 (38) Secondary independent cancer, no/yes 90 (90)/10 (10) Heart disease, no/yes 87 (87)/13 (13) Diabetes mellitus, no/yes 93 (93)/7 (7.0) Family history, no/yes 80 (80)/20 (20) Grade Group (low/intermediate/high) 6 (6.0)/60 (60)/34 (34) High-grade prostatic intraepithelial neoplasia, no/yes 37 (37)/63 (63) Perineural invasion, no/yes 23 (23)/77 (77) Neoplastic vascular embolus, no/yes 83 (83)/17 (17) Neoplastic lymphatic embolus, no/yes 89 (89)/11 (11) Surgical margin, positive/negative 87 (87)/13 (13) pΤ3, a/b 58 (58)/42 (42) pΝ, unknown/negative/positive 51 (51)/38 (38)/11 (11) Extraprostatic extension, no/yes Bilateral 46 (46)/54 (54) Unilateral 65 (65)/35 (35) Seminal vesicle invasion, no/yes Bilateral 77 (77)/23 (23) Unilateral 81 (81)/19 (19) Apex or neck of the prostate gland, no/yes 38 (38)/62 (62) EZH2, negative/weak/moderate 74 (74)/14 (14)/12 (12) FOXM1, negative/weak/moderate 62 (62)/8 (8)/30 (30) Cancer type, acinar adenocarcinoma/ductal component 91 (91)/9 (9.0) EZH2, Enhancer of zeste homolog 2; FOXM1, Forkhead box M1; SD, standard deviation; pΤ, pathological tumor stage; pN, pathological regional lymph node stage. Note: all qualitative variables are presented as frequencies (percentages) except for ones specifically stated. Figure 1 The staining results performed on the same slide show a moderate Allred score of EZH2 staining. (A) Hematoxylin and eosin staining (40×); (B) Immunohistochemical staining of EZH2 showing moderately stained cells (200×, intensity of 2+ and 10% positivity, moderate Allred score); (C) Immunohistochemical staining of Forkhead box M1 showing weakly stained cells (40×, intensity of 1+ and 1% positivity, weak Allred score). EZH2, Enhancer of zeste homolog 2. Figure 1 Figure 2 The staining results performed on the same slide show a moderate Allred score of enhancer of FOXM1 staining. (A) Hematoxylin and eosin staining (40×); (B) Immunohistochemical staining for FOXM1 showing moderate positivity (100×, intensity 3+, 10% positivity, moderate Allred score); (C) Immunohistochemical staining for Enhancer of zeste homolog 2 showing weak positivity (40×, intensity 1+, 1% positivity, weak Allred score). FOXM1, Forkhead box M1. Figure 2 The univariate analysis regarding relapse is summarized in Table 2 vs. p vs p Supplementary Table 1 Table 2 Comparisons of patient and tumor characteristics between relapsed and non-relapsed patients. Table 2 Variable Relapse p- No ( n Yes ( n Age, mean±SD, year 65.5±7.0 67.4±5.5 0.2 a Radiotherapy 0.011 No 43 (86) 7 (14) Yes 31 (62) 19 (38) Hormonotherapy <0.001 No 59 (95) 3 (4.8) Yes 15 (39) 23 (61) Secondary independent cancer 0.7 No 67 (74) 23 (26) Yes 7 (70) 3 (30) Heart disease 1 No 64 (74) 23 (26) Yes 10 (77) 3 (23) Diabetes mellitus 0.4 No 70 (75) 23 (25) Yes 4 (57) 3 (43) Family history associated with PCa 1 No 59 (74) 21 (26) Yes 15 (75) 5 (25) Grade Group 0.017 Low/intermediate 54 (82) 12 (18) High 20 (59) 14 (41) High-grade prostatic intraepithelial neoplasia 0.2 No 30 (81) 7 (19) Yes 44 (70) 19 (30) Perineural invasion 0.17 No 20 (87) 3 (13) Yes 54 (70) 23 (30) Neoplastic vascular embolus 0.4 No 63 (76) 20 (24) Yes 11 (65) 6 (35) Neoplastic lymphatic embolus 0.032 No 69 (78) 20 (22) Yes 5 (45) 6 (55) Surgical margin 0.094 Positive 67 (77) 20 (23) Negative 7 (54) 6 (46) Gleason score, mean±SD 7.4±0.8 7.8±0.9 0.024 pΤ3 <0.001 a 52 (90) 6 (10) b 22 (52) 20 (48) pΝ 0.001 Unknown 46 (90) 5 (9.8) 0 23 (61) 15 (39) 1 5 (45) 6 (55) Bilateral extraprostatic extension 0.11 No 38 (83) 8 (17) Yes 36 (67) 18 (33) Unilateral extraprostatic extension 0.16 No 45 (69) 20 (31) Yes 29 (83) 6 (17) Bilateral seminal vesicle invasion 0.055 No 61 (79) 16 (21) Yes 13 (57) 10 (44) Unilateral seminal vesicle invasion 0.007 No 65 (80) 16 (20) Yes 9 (47) 10 (53) Apex or neck of the prostate gland 0.10 No 32 (84) 6 (16) Yes 42 (68) 20 (32) EZH2 0.13 Negative 57 (77) 17 (23) Weak 11 (79) 3 (21) Moderate 6 (50) 6 (50) FOXM1 0.8 Negative 47 (76) 15 (24) Weak 6 (75) 2 (25) Moderate 21 (70) 9 (30) Cancer type 0.2 Acinar 69 (76) 22 (24) Ductal component 5 (56) 4 (44) pT, pathological tumor stage; pN, pathological regional lymph node stage; PCa, prostate cancer; EZH2, Enhancer of zeste homolog 2; FOXM1, Forkhead box M1; SD, standard deviation. Note: all qualitative variables are presented as frequencies (percentages) except for ones specifically stated. a The Student’s t We found that the only significant variable associated with relapse and death, in the multivariate analysis of significant pathological and clinical characteristics, was hormonotherapy. We were able to observe the following effects of the other variables in our analysis by excluding hormonotherapy due to medical and scientific reasons. For analyzing the remaining most impactful clinical and pathological variables associated with death, a multiple logistic regression model with the Forward logistic regression method was used, including variables with p p p Supplementary Table 2 Table 3 Table 3 The multivariate analysis with the Forward logistic regression method of significant pathological and clinical characteristics in relation to relapse. Table 3 Variable Reference category OR 95% CI p Radiotherapy (yes) No 1.75 0.49–6.21 0.4 Grade Group (high) Moderate 0.63 0.15–2.71 0.5 Surgical margin (positive) Negative 0.87 0.14–5.31 0.9 pΤ3 (b) a 6.21 1.41–27.27 0.016 pΝ 0.2 0 Unknown (x) 2.95 0.70–12.33 0.14 1 5.04 0.66–38.54 0.12 EZH2 (moderate) Negative and weak 5.96 1.09–32.48 0.039 FOXM1 (moderate) Negative and weak 0.79 0.22–2.83 0.7 Cancer type (ductal component) Acinar 7.29 1.03–51.43 0.046 pT, pathological primary tumor stage; pN, pathological regional lymph node stage; EZH2, Enhancer of zeste homolog 2; FOXM1, Forkhead box M1; OR, odds ratio; CI, confidence interval. Using the enter method, a multiple logistic regression model was employed to assess the influence of pT3 variables on death and relapse. According to Table 4 p p p p p Table 4 Pathology variables defining the pT3 and associated with relapse and death. Table 4 Variable Reference category Relapse Death OR 95% CI p OR 95% CI p BEE No 1.81 0.31–10.55 0.5 0.56 0.05–6.64 0.6 UEE No 1.09 0.15–7.87 0.9 2.51 0.19–32.71 0.5 BSVI No 5.36 1.52–18.92 0.001 10.79 1.28–90.62 0.028 USVI No 9.98 2.76–36.08 <0.001 9.78 1.40–68.25 0.021 Apex or neck of the prostate gland No 2.33 0.74–7.35 0.15 9.87 0.99–98.7 0.051 BEE, bilateral extraprostatic extension; UEE, unilateral extraprostatic extension; BSVI, bilateral seminal vesicle invasion; USVI, unilateral seminal vesicle invasion; OR, odds ratio; CI, confidence interval. 4 Discussion This study aimed to explore the link between relapse and death in high-risk PCa patients following RP, specifically focusing on EZH2 and FOXM1 protein expression. Previous studies show their correlation, motivating us to assess them independently and together. With accessible protein antibodies, we could detect these markers affordably, pinpointing patients needing closer monitoring and personalized care. Emerging molecularly targeted therapies can benefit those who might benefit from innovative treatments. EZH2 overexpression suggests potential for EZH2 inhibitor therapy in relapse or mortality cases. Conversely, reduced EZH2 expression may favor immunotherapy initiation, according to Du et al.’s [ 19 Both increased rates of relapse and mortality were associated with sufficient immunoexpression of EZH2, although the latter finding had only marginal statistical significance. In our analysis, 12% of patients exhibited moderate immunoexpression of EZH2, which was associated with a 5.96-fold higher risk of disease relapse and a 4.54-fold higher risk of mortality. The expression of EZH2 is associated with the methylation of DNA histones, which facilitates replication. Adequate expression of EZH2 is believed to promote the survival of cancer cells and accelerate the proliferation of cells in cancer clones. Studies have consistently demonstrated an association between EZH2 protein expression, including gene activation, and increased rates of relapse and mortality [ 12 [20] [21] [22] 23 According to the findings of our study, patients with acinar adenocarcinoma who also exhibited a prostate ductal carcinoma component in their pathological examination had a higher likelihood of relapse. These patients, who comprised 9% of our research sample and all had sporadic detection of ductal carcinoma component, have a relapse risk that is 7.29 times higher than that of patients whose microscopic investigations revealed acinar adenocarcinoma without evidence of a ductal component. Pure or component ductal carcinoma in PCa has been associated with a worse prognosis and a lower survival rate [ [24] [25] [26] It is well-established that patients classified as pT3b have a poorer prognosis compared to those classified as pT3a [ 27 28 29 30 31 32 33 Given the known impact of higher Gleason score and/or Grade Group on disease prognosis [ 34 35 36 34 37 In our study, we did not find any association between FOXM1 expression and recurrence or death in patients diagnosed with pT3. Furthermore, none of the associations between FOXM1 and the other variables we evaluated yielded significant results. According to the study by Kim et al. [ 38 [15] [16] [17] 39 40 Limitations of our retrospective study include potential bias due to confounding variables, which was partially mitigated by a multiple variable analysis. A larger sample size would enhance reliability, but broader participation was restricted. Nevertheless, our study offers valuable insights despite these limitations. Utilizing archives can pose challenges to the accuracy of protein expression detection. Additionally, as only one ethnic group was studied nationally, generalizing findings to other ethnicities might be complex. Further research is necessary for validation. 5 Conclusion Our study identified high-risk features in localized PCa patients linked to increased relapse and mortality risk. Physicians should consider factors like EZH2 expression, prostate component ductal carcinoma, and cancer spread to specific structures, alongside established criteria. A multicenter prospective study involving PCa patients might yield more accurate risk classifications and aid in personalized treatment decisions. Author contributions Study concept and design Data analysis Drafting of manuscript Critical revision of the manuscript Conflicts of interest The authors declare no conflict of interest. References 1 Siegel R.L. Miller K.D. Wagle N.S. Jemal A. Cancer statistics, 2023 CA Cancer J Clin 73 2023 17 48 36633525 10.3322/caac.21763 2 Hamdy F.C. Donovan J.L. Lane J.A. Mason M. Metcalfe C. Holding P. 10-year outcomes after monitoring, surgery, or radiotherapy for localized prostate cancer N Engl J Med 375 2016 1415 1424 27626136 10.1056/NEJMoa1606220 3 Wiegel T. Bartkowiak D. Bottke D. Bronner C. Steiner U. Siegmann A. Adjuvant radiotherapy versus wait-and-see after radical prostatectomy: 10-year follow-up of the ARO 96–02/AUO AP 09/95 trial Eur Urol 66 2014 243 250 24680359 10.1016/j.eururo.2014.03.011 4 Thompson I.M. Tangen C.M. Paradelo J. Lucia M.S. Miller G. Troyer D. Adjuvant radiotherapy for pathological T3N0M0 prostate cancer significantly reduces risk of metastases and improves survival: long-term followup of a randomized clinical trial J Urol 181 2009 956 962 19167731 10.1016/j.juro.2008.11.032 PMC3510761 5 Bolla M. van Poppel H. Tombal B. Vekemans K. Da Pozzo L. De Reijke T.M. Postoperative radiotherapy after radical prostatectomy for high-risk prostate cancer: long-term results of a randomised controlled trial (EORTC trial 22911) Lancet 380 2012 2018 2027 23084481 10.1016/S0140-6736(12)61253-7 6 Roach I.I.I.M. Waldman F. Pollack A. Predictive models in external beam radiotherapy for clinically localized prostate cancer Cancer 115 2009 3112 3120 19544539 10.1002/cncr.24348 PMC2760302 7 Tian J.H. Mu L.J. Wang M.Y. Zeng J. Long Q.Z. Wang W. FOXM1-dependent transcriptional regulation of EZH2 induces proliferation and progression in prostate cancer Anti Cancer Agents Med Chem 21 2021 1835 1841 10.2174/1871520620666200731161810 32735528 8 Kim K.H. Roberts C.W. Targeting EZH2 in cancer Nat Med 22 2016 128 134 26845405 10.1038/nm.4036 PMC4918227 9 Kim S.H. Joshi K. Ezhilarasan R. Myers T.R. Siu J. Gu C. EZH2 protects glioma stem cells from radiation-induced cell death in a MELK/FOXM1-dependent manner Stem Cell Rep 4 2015 226 238 10.1016/j.stemcr.2014.12.006 PMC4325196 25601206 10 Xu K. Wu Z.J. Groner A.C. He H.H. Cai C. Lis R.T. EZH2 oncogenic activity in castration-resistant prostate cancer cells is Polycomb-independent Science 338 2012 1465 1469 23239736 10.1126/science.1227604 PMC3625962 11 Kim E. Kim M. Woo D.H. Shin Y. Shin J. Chang N. Phosphorylation of EZH2 activates STAT3 signaling via STAT3 methylation and promotes tumorigenicity of glioblastoma stem-like cells Cancer Cell 23 2013 839 852 23684459 10.1016/j.ccr.2013.04.008 PMC4109796 12 Varambally S. Dhanasekaran S.M. Zhou M. Barrette T.R. Kumar-Sinha C. Sanda M.G. The polycomb group protein EZH2 is involved in progression of prostate cancer Nature 419 2002 624 629 12374981 10.1038/nature01075 13 Ku S.Y. Rosario S. Wang Y. Mu P. Seshadri M. Goodrich Z.W. Rb1 Trp 53 Science 355 2017 78 83 28059767 10.1126/science.aah4199 PMC5367887 14 Myatt S.S. Lam E.W.F. The emerging roles of Forkhead box (Fox) proteins in cancer Nat Rev Cancer 7 2007 847 859 17943136 10.1038/nrc2223 15 Khan M.A. Khan P. Ahmad A. Fatima M. Nasser M.W. FOXM1: a small fox that makes more tracks for cancer progression and metastasis Semin Cancer Biol 92 2023 1 15 36958703 10.1016/j.semcancer.2023.03.007 PMC10199453 16 Katoh M. Igarashi M. Fukuda H. Nakagama H. Katoh M. Cancer genetics and genomics of human FOX family genes Cancer Lett 328 2013 198 206 23022474 10.1016/j.canlet.2012.09.017 17 Wang Z. Banerjee S. Kong D. Li Y. Sarkar F.H. Down-regulation of Forkhead Box M1 transcription factor leads to the inhibition of invasion and angiogenesis of pancreatic cancer cells Cancer Res 67 2007 8293 8300 17804744 10.1158/0008-5472.CAN-07-1265 18 Mahara S. Lee P.L. Feng M. Tergaonkar V. Chng W.J. Yu Q. HIFI-α activation underlies a functional switch in the paradoxical role of Ezh2/PRC2 in breast cancer Proc Natl Acad Sci U S A 113 2016 E3735 E3744 10.1073/pnas.1602079113 27303043 PMC4932959 19 Du T.Q. Liu R. Zhang Q. Luo H. Liu Z. Sun S. EZH2 as a prognostic factor and its immune implication with molecular characterization in prostate cancer: an integrated multi-omics in silico analysis Biomolecules 12 2022 1617 10.3390/biom12111617 36358967 PMC9687944 20 Li K. Chen M.K. Situ J. Huang W.T. Su Z.L. He D. Role of co-expression of c-Myc, EZH2 and p27 in prognosis of prostate cancer patients after surgery Chin Med J 126 2013 82 87 23286483 21 Fu Z. Kitagawa Y. Shen R. Shah R. Mehra R. Rhodes D. Metastasis suppressor gene Raf kinase inhibitor protein (RKIP) is a novel prognostic marker in prostate cancer Prostate 66 2006 248 256 16175585 10.1002/pros.20319 22 Ren G. Baritaki S. Marathe H. Feng J. Park S. Beach S. Polycomb protein EZH2 regulates tumor invasion via the transcriptional repression of the metastasis suppressor RKIP in breast and prostate cancer Cancer Res 72 2012 3091 3104 22505648 10.1158/0008-5472.CAN-11-3546 23 Huber F. Montani M. Sulser T. Jaggi R. Wild P. Moch H. Comprehensive validation of published immunohistochemical prognostic biomarkers of prostate cancer—what has gone wrong? A blueprint for the way forward in biomarker studies Br J Cancer 112 2015 140 148 25422912 10.1038/bjc.2014.588 PMC4453620 24 Brinker D.A. Potter S.R. Epstein J.I. Ductal adenocarcinoma of the prostate diagnosed on needle biopsy: correlation with clinical and radical prostatectomy findings and progression Am J Surg Pathol 23 1999 1471 1479 10584700 10.1097/00000478-199912000-00004 25 Wilcox G. Soh S. Chakraborty S. Scardino P.T. Wheeler T.M. Patterns of high-grade prostatic intraepithelial neoplasia associated with clinically aggressive prostate cancer Hum Pathol 29 1998 1119 1123 9781651 10.1016/s0046-8177(98)90423-3 26 Colpaert C. Gentens P. Van Marck E. Ductal (“endometrioid”) adenocarcinoma of the prostate Acta Urol Belg 66 1998 29 32 10083631 27 Zelefsky M.J. Yamada Y. Kollmeier M.A. Shippy A.M. Nedelka M.A. Long-term outcome following three-dimensional conformal/intensity-modulated external-beam radiotherapy for clinical stage T3 prostate cancer Eur Urol 53 2008 1172 1179 18222596 10.1016/j.eururo.2007.12.030 28 Van Poppel H. Goethuys H. Callewaert P. Vanuytsel L. Van de Voorde W. Baert L. Radical prostatectomy can provide a cure for well-selected clinical stage T3 prostate cancer Eur Urol 38 2000 372 379 11025373 10.1159/000020311 29 Torres C.M. Biran A. Burney M.J. Patel H. Henser-Brownhill T. Cohen A.H.S. The linker histone H1.0 generates epigenetic and functional intratumor heterogeneity Science 353 2016 aaf1644 10.1126/science.aaf1644 PMC5131846 27708074 30 Navin N. Kendall J. Troge J. Andrews P. Rodgers L. McIndoo J. Tumour evolution inferred by single-cell sequencing Nature 472 2011 90 94 21399628 10.1038/nature09807 PMC4504184 31 Shih P.C. Mei K.C. Role of STAT3 signaling transduction pathways in cancer stem cell-associated chemoresistance Drug Discov Today 26 2020 1450 1458 33307211 10.1016/j.drudis.2020.11.032 32 Meacham C.E. Morrison S.J. Tumour heterogeneity and cancer cell plasticity Nature 501 2013 328 337 24048065 10.1038/nature12624 PMC4521623 33 Lytle N.K. Barber A.G. Reya T. Stem cell fate in cancer growth, progression and therapy resistance Nat Rev Cancer 18 2018 669 680 30228301 10.1038/s41568-018-0056-x PMC8388042 34 Shiota M. Terada N. Saito T. Yokomizo A. Kohei N. Goto T. Differential prognostic factors in low- and high-burden de novo Cancer Sci 112 2021 1524 1533 33159829 10.1111/cas.14722 PMC8019198 35 Miszczyk M. Majewski W. Stawiski K. Rasławski K. Rajwa P. Jabłońska I. Prognostic factors in postoperative radiotherapy for prostate cancer—tertiary center experience Radiol Oncol 55 2021 203 211 33768769 10.2478/raon-2021-0017 PMC8042817 36 Crook J. Ots A.F. Prognostic factors for newly diagnosed prostate cancer and their role in treatment selection Semin Radiat Oncol 23 2013 165 172 23763882 10.1016/j.semradonc.2013.01.002 37 Pugliese D. Palermo G. Totaro A. Bassi P.F. Pinto F. Clinical, pathological and molecular prognostic factors in prostate cancer decision-making process Urologia 83 2016 14 20 26917215 10.5301/uro.5000166 38 Kim M.Y. Jung A.R. Kim G.E. Yang J. Ha U.S. Hong S.H. High FOXM1 expression is a prognostic marker for poor clinical outcomes in prostate cancer J Cancer 10 2019 749 756 30719174 10.7150/jca.28099 PMC6360432 39 Yu Z. Zhan C. Du H. Zhang L. Liang C. Zhang L. Baicalin suppresses the cell cycle progression and proliferation of prostate cancer cells through the CDK6/FOXM1 axis Mol Cell Biochem 469 2020 169 178 32385718 10.1007/s11010-020-03739-1 40 Cacciatore S. Zadra G. Bango C. Penney K.L. Tyekucheva S. Yanes O. Metabolic profiling in formalin-fixed and paraffin-embedded prostate cancer tissues Mol Cancer Res 15 2017 439 447 28074002 10.1158/1541-7786.MCR-16-0262 PMC5552883 Appendix A Supplementary data The following is the Supplementary data to this article: Multimedia component 1 Multimedia component 1 Acknowledgements We would like to express our gratitude to all our colleagues at the First Department of Pathology and First Urology Clinic at National and Kapodistrian University of Athens, whose contributions were instrumental in completing this project. We also acknowledge the support provided by the National and Kapodistrian University of Athens. Peer review under responsibility of Tongji University. Appendix A Supplementary data to this article can be found online at https://doi.org/10.1016/j.ajur.2024.09.007 ",
  "metadata": {
    "Title of this paper": "Metabolic profiling in formalin-fixed and paraffin-embedded prostate cancer tissues",
    "Journal it was published in:": "Asian Journal of Urology",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12490686/"
  }
}