{
  "title": "Paper_1007",
  "abstract": "pmc Pathogens Pathogens 2622 pathogens pathogens Pathogens 2076-0817 Multidisciplinary Digital Publishing Institute  (MDPI) PMC12472499 PMC12472499.1 12472499 12472499 41011774 10.3390/pathogens14090874 pathogens-14-00874 1 Review Bacteria-Based Roles in Solid Tumors: Potential for Prevention and Treatment Huang Jianchang 1 2 Zhang Ailin 1 2 https://orcid.org/0000-0002-3642-8055 Sun Jialin 3 Fu Yuhan 1 2 Li Weinan 1 2 * Wang Yanhong 1 2 * Breitschwerdt Edward B. Academic Editor 1 18845750231@163.com 15504613250@163.com amelia279@163.com 2 3 klp15sjl@nefu.edu.cn * lwnhljucm@163.com wang.yanhong@163.com 02 9 2025 9 2025 14 9 497659 874 17 6 2025 22 8 2025 29 8 2025 02 09 2025 27 09 2025 29 09 2025 © 2025 by the authors. 2025 https://creativecommons.org/licenses/by/4.0/ Licensee MDPI, Basel, Switzerland. This article is an open access article distributed under the terms and conditions of the Creative Commons Attribution (CC BY) license ( https://creativecommons.org/licenses/by/4.0/ Malignant tumors have become one of the most important diseases threatening human life and health, and the prevention and treatment of cancer have always been the direction of modern medicine’s continuous exploration. According to modern medical research, a tumor microbial ecosystem exists in all human cancers. With the continuous deepening of research on the tumor microenvironment (TME), it has been discovered that some specific bacteria cause tumor production and development by damaging DNA, activating oncogenic signaling pathways, suppressing anti-tumor immunity, and producing pro-tumor metabolites. Certain bacteria associated with tumors can also serve as breakthroughs in the prevention and treatment of tumors. In this review, we present and summarize evidence from a large number of studies on the effects of oncobacteria on tumor prevention and treatment, and we further discuss the direction in which oncobacteria can be positively and effectively used in tumor therapy. bacteria tumors prevention treatment National Natural Science Foundation of China No. 82074025 Science Foundation Project of the Heilongjiang Province of China No. LH2021H098 Genertec Medical Scientific Research Fund TYYLKYJJ- 2024-040 Heilongjiang University of Chinese Medicine graduate innovative research project No. 2023yjscx011 Heilongjiang Touyan Innovation Team Program This work was supported by the Heilongjiang University of Chinese Medicine graduate innovative research project [No. 2023yjscx011], the Science Foundation Project of the Heilongjiang Province of China [No. LH2021H098], the Genertec Medical Scientific Research Fund [TYYLKYJJ- 2024-040], the National Natural Science Foundation of China [No. 82074025], and the Heilongjiang Touyan Innovation Team Program. pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement no pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes 1. Introduction With the continuous progress of modern medicine, more and more diseases have developed mature treatment protocols, and human health has been improved as never before. However, along with the rapid social and economic development of the world, the aging of the population has become increasingly serious, and the global cancer incidence and mortality rates have been climbing. Some studies have shown that it is expected that by 2050, there will be 35 million cases of cancer globally, a 77% increase from 20 million cases in 2022 [ 1 2 3 4 2. Tumor Microenvironment The TME denotes the biological milieu encompassing malignant cells, comprising two fundamental constituents: noncellular structural components (extracellular matrix) and intratumoral microbial populations (as shown in Figure 1 5 6 7 8 There is a special interdependent and symbiotic relationship between tumor bacteria and tumor cells in the TME. Bacteria are capable of entering the cytoplasm of eukaryotic cells, initiating cellular immunity and other cellular responses [ 9 10 Fusobacterium nucleatum Fn 11 11 12 10 13 14 Salmonella Escherichia coli 15 3. Relationship Between Bacteria and Tumors Studies targeting genomic aberrations and dysregulated signaling pathways have long been viewed as key to tumor research [ 16 Helicobacter pylori 17 18 3 11 19 Fn 20 21 Helicobacter pylori 22 23 24 25 26 27 28 From the perspective of inducing chronic infection, bacteria usually interfere with the normal course of the cell cycle through prolonged infections. This interference may lead to changes in cell growth patterns, which, in turn, can trigger DNA damage that is similar to the effects caused by oncogenes [ 29 30 31 32 From the perspective of bacterial toxins and metabolites, some intestinal bacteria are capable of producing β 33 34 35 36 The immunomodulatory and immune-evasion effects of bacteria on tumors often arise from chronic inflammatory environments induced by bacteria, as well as bacterial toxins and their metabolites. For example, enterotoxigenic Bacteroides fragilis Bacteroides fragilis 37 38 39 40 + − − + 41 42 43 Figure 2 Studies have shown that each human cell carries at least 10 bacteria, and this large number of bacteria has different roles in the production and growth of various tumors [ 44 45 3.1. Colorectal Cancer and Bacteria CRC ranks among the most prevalent cancers globally, accounting for substantial mortality in both developed and developing nations [ 46 47 Fn Fn Fn 48 49 Escherichia coli E. coli 50 Bacteroides fragilis E. coli 51 Bacteria not only play roles in the initiation and progression of CRC but also influence tumor therapy. Studies have demonstrated that Fn microRNA 52 53 Akkermansia muciniphila 54 3.2. Breast Cancer and Bacteria Current epidemiological data indicate that breast cancer has emerged as the most prevalent cancer in female populations, superseding lung cancer in global incidence rates and representing a significant women’s health challenge. The mammary gland has long been considered a sterile organ. However, breast milk samples from lactating women have been found to harbor diverse bacterial communities, and breast tissue itself contains a significant number of distinct bacterial species [ 55 Bacillus Staphylococcus Fn 56 Breast cancer metastasis is a leading cause of patient mortality. It has been found that microbial biomass within breast tumors is low, and its survival benefit to tumor cells is mainly observed during metastasis. Mechanistic studies have shown that during tumor metastasis, circulating tumor cells harboring bacteria enhance their resistance to fluid shear stress through actin cytoskeleton remodeling, thereby facilitating cancer cell metastasis [ 10 10 57 58 In a practical study, it was found that in a mouse breast cancer model, Fap-2, the membrane protein of Fn Fn Fn 58 Fn 59 3.3. Pancreatic Cancer and Bacteria Pancreatic cancer poses a significant threat to human health due to its extremely high mortality rate. More bacteria are present in the pancreas of pancreatic cancer patients compared to the normal pancreas, and they are abundant. In an experimental study, after testing 113 pancreatic samples with pancreatic ductal adenocarcinoma and 20 healthy pancreatic samples, it was found that the bacterial detection rate of the pancreatic ductal adenocarcinoma samples was much higher than that of the healthy pancreatic samples [ 60 Saccharopolyspora 4 61 Table 1 4. Bacteria for Tumor Prevention and Treatment As documented in the 19th century, tumor regression occurred in cancer patients receiving Streptococcus pyogenes Serratia marcescens 79 Clostridium difficile Bifidobacterium Salmonella Proteus Lactobacillus Escherichia 80 81 82 83 Figure 3 4.1. Antitumor Effects of Bacterial Components or Products As early as the 19th century, it was found that tumor regression was successfully observed in patients by injecting Streptococcus pyogenes Serratia marcescens 84 85 86 87 88 Salmonella 89 90 91 92 93 Salmonella 94 95 Salmonella typhimurium 96 Listeria monocytogenes LM LM 2+ 97 4 Not only is there an anti-tumor effect in the tumor bacteria themselves, but some of the components in the tumor bacteria also act as anti-tumor agents. For example, Lipopolysaccharides (LPSs) and flagellin are present in Salmonella 98 99 100 101 102 The secretion products of tumor bacteria also play a non-negligible role in anti-tumor activity. For example, Clostridium 103 104 Faecalibacterium prausnitzii Faecalibacterium prausnitzii 105 In addition to this, the use of bacterial engineering can also provide a good anti-tumor effect. Expression of L-asparaginase with Salmonella typhimurium 106 107 Salmonella typhimurium Vibrio 108 CD326 Akkermansia muciniphila Escherichia coli 109 The traditional chemotherapy cancer treatment program has the defects of drug resistance and non-specific toxicity to normal body cells. In contrast, bacteria-based anti-tumor therapy demonstrates more anti-tumor pathways and shows greater developmental potential. However, relying on bacterial components or products as anti-cancer drugs also has its own limitations. To achieve a certain therapeutic effect, high doses of bacteria are often required, and the resulting innate toxicity and pathogenicity are unavoidable challenges. If the dosage is reduced, it may lead to decreased efficacy, while maintaining a high dosage may result in infection or even death. Therefore, a number of researchers have attempted to overcome this shortcoming by starting with virulence-reducing and genetically modified strains. 4.2. Natural Targeting of Bacteria to Tumors Tumor generation and growth often cause unique pathological changes at the tissue level, and the vascular system surrounding the tumor usually develops irregularly and chaotically, resulting in a hypoxic, acidic environment for most solid tumors [ 110 111 112 113 114 115 116 117 It has been found that the number of bacteria that reach a target tumor tends to be roughly the same as the number of bacteria that reach other normal tissues [ 118 119 120 121 122 Salmonella 123 Salmonella choleraesuis 124 125 126 Furthermore, in studies of obligate anaerobes and facultative anaerobes, it was found that anaerobes do not colonize hypoxic environments unrelated to tumors [ 87 122 127 Listeria Salmonella E coli Fn 116 128 129 Figure 4 A research team combined the p53 protein, which can directly induce apoptosis in tumor cells, with the Tum5 protein, which has anti-angiogenic function, and constructed a Tum5-p53 bifunctional fusion protein. They then used E. coli E. coli 130 Salmonella typhimurium 131 In recent years, molecular targeted therapies have shown remarkable therapeutic efficacy, but they also have their own limitations. These targeted therapies are often effective only for tumors with specific gene mutations and have certain off-target effects. In contrast, tumor-targeted therapies based on tumor bacteria have demonstrated greater adaptability and targeting ability. In addition, oncobacteria can be chemically or genetically modified to synthesize anti-tumor drugs and localize them within tumor tissues, which is a safer and more effective process that reduces cytotoxicity to normal cells. With ongoing exploration of bacterial tumor-targeting capabilities, the precision and efficacy of bacterial targeting have been consistently validated, demonstrating remarkable performance that expands therapeutic options for tumor-targeted interventions. 4.3. Treatment of Tumors by Destroying Bacteria Current medical research on tumors has moved beyond the view that tumors are triggered only by genetic or epigenetic changes in cells to the recognition that tumor development is a complex physiological process influenced by a variety of factors, among which bacteria are undoubtedly some of the key contributors. Bacteria can promote the occurrence and development of tumors, so treating bacteria inside tumors has undoubtedly become a potential therapeutic target for oncology treatment. For example, treatment of mice carrying Fn Fn 64 However, targeting intratumoral bacteria and eradicating them remains challenging, especially in ensuring that antibiotics reach effective concentrations in the TME while avoiding their adverse effects on the host. Achieving minimum inhibitory concentrations of antibiotics in the TME is often difficult due to factors such as physical barriers in tumor tissue, inadequate blood supply, and reduced chemical stability of antibiotics in the TME [ 132 Salmonella typhimurium 133 81 The elimination of tumor bacteria can be achieved not only by antibiotics but also by using phages to eliminate tumor-associated bacteria. For example, Fn Fn 134 E. coli 135 Compared to common anticancer drugs, antibiotic drugs are more readily available and can effectively reduce treatment costs. However, the strategy of using antibiotics to eliminate bacteria in a tumor to achieve anti-tumor purposes also has limitations. For example, there are limitations such as bacterial resistance and difficulty in controlling antimicrobial concentration within tumors. To address these limitations, a combination of tumor-targeted delivery is required. From the three different programs, it is evident that treating tumors by relying solely on a single approach is often insufficient to achieve a complete cure. If we rely only on bacterial treatment of tumors, there will often be a situation where the tumor is not completely eliminated. Therefore, combining bacterial therapy with traditional therapy may be a better choice. 5. Bacteria as Tumor Markers Tumor markers are a class of substances that can reflect the existence and changes in tumors during the occurrence, development, and treatment of malignant tumors. They are often associated with tumor cells and their metabolites. Existing tumor markers include, for example, carcinoembryonic antigen (CEA), carbohydrate antigen 125 (CA125), carbohydrate antigen 19-9 (CA19-9), and so on [ 136 137 Akkermansia muciniphila AKK 138 Fn Faecalibacterium prausnitzii Fp Fn Fp Fn Bifidobacterium Bb Fn Bb 139 In addition to conventional bacteria serving as tumor markers, genetically engineered bacteria can also be utilized for the precise detection of various malignant tumor types. Peter et al. found that based on the expression of endogenous E. coli E. coli 140 41 14 Because of the heterogeneity in the tumor microbiota and the difficulty in establishing uniform standards, the research direction of future bacterial markers may focus more on the development of personalized treatment strategies. The bacterial therapy mentioned earlier utilizes tumor bacteria to achieve therapeutic effects. It is also possible to study corresponding bacterial markers to monitor changes in the number of bacteria at different stages of treatment, thereby providing a basis for bacterial therapy. 6. Bacterial Therapy-Related Clinical Trials Bacterial-based therapy has demonstrated a certain level of feasibility in clinical trials. Bacillus Calmette-Guérin (BCG) is one of the earliest bacteria applied in cancer treatment. In a recent clinical trial ( NCT04165317 141 NCT04167137 Escherichia coli 142 Clostridium novyi NCT01924689 143 Salmonella VNP20009 NCT00004988 7. Limitations of Bacterial Therapy Despite its advancing maturity, bacterial therapy still exhibits inherent limitations. The first and foremost among these is the intricate complexity of the bacterium–tumor relationship. In recent years, considerable clinical and experimental data have demonstrated the inextricable links between tumor bacteria and tumors, but these links are complicated by the fact that the development of a single cancer is often associated with a variety of tumor bacteria, and a single tumor bacterium can play multiple roles in a certain cancer type. It is this complex association between bacteria and tumors that makes it difficult to identify the specific bacteria that cause a particular tumor. Moreover, the molecular mechanisms by which bacteria (especially specific subgroups) affect tumor signaling pathways, anti-tumor immunity, and therapeutic efficacy remain unclear. Technological bottlenecks also limit progress, as there is a lack of high-resolution tools (such as single-cell and spatial omics techniques) to accurately analyze the complex microbial composition and spatial distribution in the TME. Significant tumor heterogeneity leads to huge differences in the composition, abundance, and function of microorganisms in different types of cancer (such as CRC, lung cancer, and breast cancer) and even in the same tumor, making it extremely difficult to develop general strategies. In addition, the impact of intratumoral bacteria on tumors is bidirectional—some bacteria (such as Fn Lactobacilli 8. Conclusions and Future Prospects of Bacterial Therapy A growing body of research suggests that bacteria have an irreplaceable role in human health and play multiple roles in human health. In the ongoing research on bacteria, it has been found that bacteria can alter the normal physiology of host cells by promoting inflammation, altering cell signaling pathways, enhancing immune evasion, and inducing DNA damage. As an emerging therapeutic strategy, bacterial therapy offers unique advantages, and researchers have achieved a series of notable accomplishments in the field of cancer treatment. The current research outcomes in bacterial-based cancer therapy are primarily reflected in bacterial tumor targeting, bacterium-mediated drug delivery, and bacteria-induced immune responses. With deeper insights into tumor biology and immunology, the potential of bacterial therapy holds even broader promise. The key to future breakthroughs lies in deepening basic research by utilizing animal models and advanced technologies, such as gene editing and multi-omics integration, to elucidate the mechanisms of bacterial tumor immune interactions; developing high-resolution tools to overcome technical bottlenecks; designing safer targeted drugs or engineered strains based on the optimization strategy of bacterial biological characteristics; and exploring effective synergistic combination therapies. In short, if the existing obstacles can be overcome, bacterial therapy is expected to fully unleash its enormous potential for precision cancer treatment, diagnosis, prevention of recurrence, and deep innovation in tumor treatment. Disclaimer/Publisher’s Note: Author Contributions J.H.: Writing—original draft. A.Z.: Writing—original draft. J.S.: Visualization. Y.F.: Methodology and conceptualization. W.L.: Writing—review and editing. Y.W.: Writing—review and editing. All authors have read and agreed to the published version of the manuscript. Conflicts of Interest The authors declare no conflicts of interest. References 1. Bray F. Laversanne M. Sung H. Me J.F. Siegel R.L. Soerjomataram I. Dvm A.J. Global cancer statistics 2022: GLOBOCAN estimates of incidence and mortality worldwide for 36 cancers in 185 countries CA Cancer J. Clin. 2024 74 229 263 10.3322/caac.21834 38572751 2. Waldman A.D. Fritz J.M. Lenardo M.J. A guide to cancer immunotherapy: From T cell basic science to clinical practice Nat. Rev. Immunol. 2020 20 651 668 10.1038/s41577-020-0306-5 32433532 PMC7238960 3. Nejman D. Livyatan I. Fuks G. Gavert N. Zwang Y. Geller L.T. Rotter-Maskowitz A. Weiser R. Mallel G. Gigi E. The human tumor microbiome is composed of tumor type–specific intracellular bacteria Science 2020 368 973 980 10.1126/science.aay9189 32467386 PMC7757858 4. Pushalkar S. Hundeyin M. Daley D. Zambirinis C.P. Kurz E. Mishra A. Mohan N. Aykut B. Usyk M. Torres L.E. The pancreatic cancer microbiome promotes oncogenesis by induction of innate and adaptive immune suppression Cancer Discov. 2018 8 403 416 10.1158/2159-8290.CD-17-1134 29567829 PMC6225783 5. Winkler J. Abisoye-Ogunniyan A. Metcalf K.J. Werb Z. Concepts of extracellular matrix remodelling in tumour progression and metastasis Nat. Commun. 2020 11 5120 10.1038/s41467-020-18794-x 33037194 PMC7547708 6. Bahuguna A. Dubey S.K. Relevance of tumor microbiome in cancer incidence, prognosis, and its clinical implications in therapeutics Biochim. Biophys. Acta BBA-Rev. Cancer 2023 1878 188956 10.1016/j.bbcan.2023.188956 37473857 7. Gruenbacher G. Thurnher M. Mevalonate metabolism in cancer Cancer Lett. 2015 356 192 196 10.1016/j.canlet.2014.01.013 24467965 8. Ye Z. Cheng P. Huang Q. Hu J. Huang L. Hu G. Immunocytes interact directly with cancer cells in the tumor microenvironment: One coin with two sides and future perspectives Front. Immunol. 2024 15 1388176 10.3389/fimmu.2024.1388176 38840908 PMC11150710 9. Wein T. Sorek R. Bacterial origins of human cell-autonomous innate immune mechanisms Nat. Rev. Immunol. 2022 22 629 638 10.1038/s41577-022-00705-4 35396464 10. Fu A. Yao B. Dong T. Chen Y. Yao J. Liu Y. Li H. Bai H. Liu X. Zhang Y. Tumor-resident intracellular microbiota promotes metastatic colonization in breast cancer Cell 2022 185 1356 1372.e26 10.1016/j.cell.2022.02.027 35395179 11. Galeano Niño J.L. Wu H. LaCourse K.D. Kempchinsky A.G. Baryiames A. Barber B. Futran N. Houlton J. Sather C. Sicinska E. Effect of the intratumoral microbiota on spatial and cellular heterogeneity in cancer Nature 2022 611 810 817 10.1038/s41586-022-05435-0 36385528 PMC9684076 12. Jiang H. Li L. Bao Y. Cao X. Ma L. Microbiota in tumors: New factor influencing cancer development Cancer Gene Ther. 2024 31 1773 1785 10.1038/s41417-024-00833-0 39342031 13. Kalaora S. Nagler A. Nejman D. Alon M. Barbolin C. Barnea E. Ketelaars S.L.C. Cheng K. Vervier K. Shental N. Identification of bacteria-derived HLA-bound peptides in melanoma Nature 2021 592 138 143 10.1038/s41586-021-03368-8 33731925 PMC9717498 14. Fu A. Yao B. Dong T. Cai S. Emerging roles of intratumor microbiota in cancer metastasis Trends Cell Biol. 2023 33 583 593 10.1016/j.tcb.2022.11.007 36522234 15. Kim J. Lee H.K. Potential Role of the Gut Microbiome in Colorectal Cancer Progression Front. Immunol. 2022 12 807648 10.3389/fimmu.2021.807648 35069592 PMC8777015 16. Polk D.B. Peek R.M. Jr. Helicobacter pylori Nat. Rev. Cancer 2010 10 403 414 10.1038/nrc2857 20495574 PMC2957472 17. Cullin N. Antunes C.A. Straussman R. Stein-Thoeringer C.K. Elinav E. Microbiome and cancer Cancer Cell 2021 39 1317 1341 10.1016/j.ccell.2021.08.006 34506740 18. Kostic A.D. Gevers D. Pedamallu C.S. Michaud M. Duke F. Earl A.M. Ojesina A.I. Jung J. Bass A.J. Tabernero J. Genomic analysis identifies association of Fusobacterium with colorectal carcinoma Genome Res. 2012 22 292 298 10.1101/gr.126573.111 22009990 PMC3266036 19. Zhang Y.-K. A Comparison Study of Age and Colorectal Cancer-Related Gut Bacteria Front. Cell. Infect. Microbiol. 2021 11 606490 10.3389/fcimb.2021.606490 33996615 PMC8121496 20. Wang X. Zhang Q. Xu R. Li X. Hong Z. Research progress on the correlation between intestinal flora and colorectal cancer Front. Oncol. 2024 14 1416806 10.3389/fonc.2024.1416806 39087025 PMC11288818 21. Bartchewsky W. Jr. Martini M.R. Masiero M. Squassoni A.C. Alvarez M.C. Ladeira M.S. Salvatore D. Trevisan M. Pedrazzoli J. Jr. Ribeiro M.L. Effect of Helicobacter pylori Scand. J. Gastroenterol. 2009 44 153 161 10.1080/00365520802530853 18985541 22. Rokkas T. Rokka A. Portincasa P. A systematic review and meta-analysis of the role of Helicobacter pylori Ann. Gastroenterol. 2017 30 414 10.20524/aog.2017.0144 28655977 PMC5479993 23. Kuo S.-H. Yeh K.-H. Wu M.-S. Lin C.-W. Hsu P.-N. Wang H.-P. Chen L.-T. Cheng A.-L. Helicobacter pylori H pylori Blood J. Am. Soc. Hematol. 2012 119 4838 4844 10.1182/blood-2012-01-404194 22403257 24. Kuo S.-H. Chen L.-T. Lin C.-W. Yeh K.-H. Shun C.-T. Tzeng Y.-S. Liou J.-M. Wu M.-S. Hsu P.-N. Cheng A.-L. Expressions of the CagA protein and CagA-signaling molecules predict Helicobacter pylori Blood J. Am. Soc. Hematol. 2017 129 188 198 10.1182/blood-2016-04-713719 27864293 25. Bhavsar A.P. Guttman J.A. Finlay B.B. Manipulation of host-cell pathways by bacterial pathogens Nature 2007 449 827 834 10.1038/nature06247 17943119 26. Tekle G.E. Garrett W.S. Bacteria in cancer initiation, promotion and progression Nat. Rev. Cancer 2023 23 600 618 10.1038/s41568-023-00594-2 37400581 27. Cao Y. Xia H. Tan X. Shi C. Ma Y. Meng D. Zhou M. Lv Z. Wang S. Jin Y. Intratumoural microbiota: A new frontier in cancer development and therapy Signal Transduct. Target. Ther. 2024 9 15 10.1038/s41392-023-01693-0 38195689 PMC10776793 28. Cuevas-Ramos G. Petit C.R. Marcq I. Boury M. Oswald E. Nougayrède J.-P. Escherichia coli induces DNA damage in vivo and triggers genomic instability in mammalian cells Proc. Natl. Acad. Sci. USA 2010 107 11537 11542 10.1073/pnas.1001261107 20534522 PMC2895108 29. Hong Y. Boiti A. Vallone D. Foulkes N.S. Reactive Oxygen Species Signaling and Oxidative Stress: Transcriptional Regulation and Evolution Antioxidants 2024 13 312 10.3390/antiox13030312 38539845 PMC10967436 30. An X. Yu W. Liu J. Tang D. Yang L. Chen X. Oxidative cell death in cancer: Mechanisms and therapeutic opportunities Cell Death Dis. 2024 15 556 10.1038/s41419-024-06939-5 39090114 PMC11294602 31. Herrera L.A. Benítez-Bribiesca L. Mohar A. Ostrosky-Wegman P. Role of infectious diseases in human carcinogenesis Environ. Mol. Mutagen. 2005 45 284 303 10.1002/em.20122 15744742 32. Yang Y. Li L. Xu C. Wang Y. Wang Z. Chen M. Jiang Z. Pan J. Yang C. Li X. Cross-talk between the gut microbiota and monocyte-like macrophages mediates an inflammatory response to promote colitis-associated tumourigenesis Gut 2020 70 1495 1506 10.1136/gutjnl-2020-320777 33122176 PMC8292576 33. Hill M.J. Chronic bacterial infection and subsequent human carcinogenesis Eur. J. Cancer Prev. 1995 4 127 128 7767238 10.1097/00008469-199504000-00001 34. Little M.S. Pellock S.J. Walton W.G. Tripathy A. Redinbo M.R. Structural basis for the regulation of β-glucuronidase expression by human gut Enterobacteriaceae Proc. Natl. Acad. Sci. USA 2018 115 E152 E161 10.1073/pnas.1716241115 29269393 PMC5777068 35. Chang A.H. Parsonnet J. Role of bacteria in oncogenesis Clin. Microbiol. Rev. 2010 23 837 857 10.1128/CMR.00012-10 20930075 PMC2952975 36. Peterson J. Garges S. Giovanni M. McInnes P. Wang L. Schloss J.A. Bonazzi V. McEwen J.E. Wetterstrand K.A. Deal C. The NIH human microbiome project Genome Res. 2009 19 2317 2323 10.1101/gr.096651.109 19819907 PMC2792171 37. Round J.L. Mazmanian S.K. Inducible Foxp3+ regulatory T-cell development by a commensal bacterium of the intestinal microbiota Proc. Natl Acad. Sci. USA 2010 107 12204 12209 10.1073/pnas.0909122107 20566854 PMC2901479 38. Wu S. Morin P.J. Maouyo D. Sears C.L. Bacteroides fragilis enterotoxin induces c-Myc expression and cellular proliferation Gastroenterology 2003 124 392 400 10.1053/gast.2003.50047 12557145 39. Wu S. Rhee K.-J. Zhang M. Franco A. Sears C.L. Bacteroides fragilis toxin stimulates intestinal epithelial cell shedding and γ-secretase-dependent E-cadherin cleavage J. Cell Sci. 2007 120 1944 1952 10.1242/jcs.03455 17504810 PMC3056613 40. Wu S. Powell J. Mathioudakis N. Kane S. Fernandez E. Sears C.L. Bacteroides fragilis enterotoxin induces intestinal epithelial cell secretion of interleukin-8 through mitogen-activated protein kinases and a tyrosine kinase-regulated nuclear factor-κB pathway Infect. Immun. 2004 72 5832 5839 10.1128/IAI.72.10.5832-5839.2004 15385484 PMC517603 41. Wu S. Rhee K.-J. Albesiano E. Rabizadeh S. Wu X. Yen H.-R. Huso D.L. Brancati F.L. Wick E. McAllister F. A human colonic commensal promotes colon tumorigenesis via activation of T helper type 17 T cell responses Nat. Med. 2009 15 1016 1022 10.1038/nm.2015 19701202 PMC3034219 42. Chiu D.K.-C. Tse A.P.-W. Xu I.M.-J. Di Cui J. Lai R.K.-H. Li L.L. Koh H.-Y. Tsang F.H.-C. Wei L.L. Wong C.-M. Hypoxia inducible factor HIF-1 promotes myeloid-derived suppressor cells accumulation through ENTPD2/CD39L1 in hepatocellular carcinoma Nat. Commun. 2017 8 517 10.1038/s41467-017-00530-7 28894087 PMC5593860 43. Kostic A.D. Chun E. Robertson L. Glickman J.N. Gallini C.A. Michaud M. Clancy T.E. Chung D.C. Lochhead P. Hold G.L. Fusobacterium nucleatum potentiates intestinal tumorigenesis and modulates the tumor-immune microenvironment Cell Host Microbe 2013 14 207 215 10.1016/j.chom.2013.07.007 23954159 PMC3772512 44. Canny G.O. McCormick B.A. Bacteria in the intestine, helpful residents or enemies from within? Infect. Immun. 2008 76 3360 3373 10.1128/IAI.00187-08 18474643 PMC2493210 45. Bray F. Ferlay J. Soerjomataram I. Siegel R.L. Torre L.A. Jemal A. Global cancer statistics 2018: GLOBOCAN estimates of incidence and mortality worldwide for 36 cancers in 185 countries CA Cancer J. Clin. 2018 68 394 424 10.3322/caac.21492 30207593 46. Kang M. Martin A. Microbiome and colorectal cancer: Unraveling host-microbiota interactions in colitis-associated colorectal cancer development Semin. Immunol. 2017 32 3 13 10.1016/j.smim.2017.04.003 28465070 47. Genua F. Raghunathan V. Jenab M. Gallagher W.M. Hughes D.J. The role of gut barrier dysfunction and microbiome dysbiosis in colorectal cancer development Front. Oncol. 2021 11 626349 10.3389/fonc.2021.626349 33937029 PMC8082020 48. Ye P. Xi Y. Huang Z. Xu P. Linking obesity with colorectal cancer: Epidemiology and mechanistic insights Cancers 2020 12 1408 10.3390/cancers12061408 32486076 PMC7352519 49. Wilson M.R. Jiang Y. Villalta P.W. Stornetta A. Boudreau P.D. Carrá A. Brennan C.A. Chun E. Ngo L. Samson L.D. The human gut bacterial genotoxin colibactin alkylates DNA Science 2019 363 eaar7785 10.1126/science.aar7785 30765538 PMC6407708 50. Dejea C.M. Fathi P. Craig J.M. Boleij A. Taddese R. Geis A.L. Wu X. DeStefano Shields C.E. Hechenbleikner E.M. Huso D.L. Patients with familial adenomatous polyposis harbor colonic biofilms containing tumorigenic bacteria Science 2018 359 592 597 10.1126/science.aah3648 29420293 PMC5881113 51. Chen T. Li Q. Wu J. Wu Y. Peng W. Li H. Wang J. Tang X. Peng Y. Fu X. Fusobacterium nucleatum promotes M2 polarization of macrophages in the microenvironment of colorectal tumours via a TLR4-dependent mechanism Cancer Immunol. Immunother. 2018 67 1635 1646 10.1007/s00262-018-2233-x 30121899 PMC11028377 52. Yu T. Guo F. Yu Y. Sun T. Ma D. Han J. Qian Y. Kryczek I. Sun D. Nagarsheth N. Fusobacterium nucleatum promotes chemoresistance to colorectal cancer by modulating autophagy Cell 2017 170 548 563.e16 10.1016/j.cell.2017.07.008 28753429 PMC5767127 53. Wang L. Tang L. Feng Y. Zhao S. Han M. Zhang C. Yuan G. Zhu J. Cao S. Wu Q. A purified membrane protein from Akkermansia muciniphila or the pasteurised bacterium blunts colitis associated tumourigenesis by modulation of CD8+ T cells in mice Gut 2020 69 1988 1997 10.1136/gutjnl-2019-320105 32169907 PMC7569398 54. Álvarez-Mercado A.I. del Valle Cano A. Fernández M.F. Fontana L. Gut microbiota and breast cancer: The dual role of microbes Cancers 2023 15 443 10.3390/cancers15020443 36672391 PMC9856390 55. Banerjee S. Wei Z. Tian T. Bose D. Shih N.N. Feldman M.D. Khoury T. De Michele A. Robertson E.S. Prognostic correlations with the microbiome of breast cancer subtypes Cell Death Dis. 2021 12 831 10.1038/s41419-021-04092-x 34482363 PMC8418604 56. Zhu J. Liao M. Yao Z. Liang W. Li Q. Liu J. Yang H. Ji Y. Wei W. Tan A. Breast cancer in postmenopausal women is associated with an altered gut metagenome Microbiome 2018 6 136 10.1186/s40168-018-0515-3 30081953 PMC6080540 57. Kovács P. Csonka T. Kovács T. Sári Z. Ujlaki G. Sipos A. Karányi Z. Szeőcs D. Hegedűs C. Uray K. Lithocholic acid, a metabolite of the microbiome, increases oxidative stress in breast cancer Cancers 2019 11 1255 10.3390/cancers11091255 31461945 PMC6769524 58. Parhi L. Alon-Maimon T. Sol A. Nejman D. Shhadeh A. Fainsod-Levi T. Yajuk O. Isaacson B. Abed J. Maalouf N. Breast cancer colonization by Fusobacterium nucleatum accelerates tumor growth and metastatic progression Nat. Commun. 2020 11 3259 10.1038/s41467-020-16967-2 32591509 PMC7320135 59. Geller L.T. Barzily-Rokni M. Danino T. Jonas O.H. Shental N. Nejman D. Gavert N. Zwang Y. Cooper Z.A. Shee K. Potential role of intratumor bacteria in mediating tumor resistance to the chemotherapeutic drug gemcitabine Science 2017 357 1156 1160 10.1126/science.aah5043 28912244 PMC5727343 60. Riquelme E. Zhang Y. Zhang L. Montiel M. Zoltan M. Dong W. Quesada P. Sahin I. Chandra V. San Lucas A. Tumor microbiome diversity and composition influence pancreatic cancer outcomes Cell 2019 178 795 806.e12 10.1016/j.cell.2019.07.008 31398337 PMC7288240 61. Brennan C.A. Garrett W.S. Fusobacterium nucleatum–symbiont, opportunist and oncobacterium Nat. Rev. Microbiol. 2019 17 156 166 10.1038/s41579-018-0129-6 30546113 PMC6589823 62. Castellarin M. Warren R.L. Freeman J.D. Dreolini L. Krzywinski M. Strauss J. Barnes R. Watson P. Allen-Vercoe E. Moore R.A. Fusobacterium nucleatum infection is prevalent in human colorectal carcinoma Genome Res. 2012 22 299 306 10.1101/gr.126516.111 22009989 PMC3266037 63. Bullman S. Pedamallu C.S. Sicinska E. Clancy T.E. Zhang X. Cai D. Neuberg D. Huang K. Guevara F. Nelson T. Analysis of Fusobacterium persistence and antibiotic response in colorectal cancer Science 2017 358 1443 1448 10.1126/science.aal5240 29170280 PMC5823247 64. Lopès A. Billard E. Casse A.H. Villéger R. Veziant J. Roche G. Carrier G. Sauvanet P. Briat A. Pagès F. Colibactin-positive E.coli induce a procarcinogenic immune environment leading to immunotherapy resistance in colorectal cancer Int. J. Cancer 2020 146 3147 3159 10.1002/ijc.32920 32037530 65. Arthur J.C. Perez-Chanona E. Mühlbauer M. Tomkovich S. Uronis J.M. Fan T.-J. Campbell B.J. Abujamel T. Dogan B. Rogers A.B. Intestinal inflammation targets cancer-inducing activity of the microbiota Science 2012 338 120 123 10.1126/science.1224820 22903521 PMC3645302 66. Raisch J. Rolhion N. Dubois A. Darfeuille-Michaud A. Bringer M.-A. Intracellular colon cancer-associated Escherichia coli promote protumoral activities of human macrophages by inducing sustained COX-2 expression Lab. Investig. 2015 95 296 307 10.1038/labinvest.2014.161 25545478 67. Gao Z. Guo B. Gao R. Zhu Q. Qin H. Microbiota disbiosis is associated with colorectal cancer Front. Microbiol. 2015 6 20 10.3389/fmicb.2015.00020 25699023 PMC4313696 68. Richard M.L. Liguori G. Lamas B. Brandi G. da Costa G. Hoffmann T.W. Di Simone M.P. Calabrese C. Poggioli G. Langella P. Mucosa-associated microbiota dysbiosis in colitis associated cancer Gut Microbes 2017 9 131 142 10.1080/19490976.2017.1379637 28914591 PMC5989788 69. Wang X. Jia Y. Wen L. Mu W. Wu X. Liu T. Liu X. Fang J. Luan Y. Chen P. Porphyromonas gingivalis Promotes Colorectal Carcinoma by Activating the Hematopoietic NLRP3 Inflammasome Cancer Res. 2021 81 2745 2759 10.1158/0008-5472.CAN-20-3827 34003774 70. Lo C. Wu D. Jao S. Wu C. Lin C. Chuang C. Lin Y. Chen C. Chen Y. Chen J. Enrichment of Prevotella intermedia in human colorectal cancer and its additive effects with Fusobacterium nucleatum on the malignant transformation of colorectal adenomas J. Biomed. Sci. 2022 29 88 10.1186/s12929-022-00869-0 36303164 PMC9615364 71. Xuan C. Shamonki J.M. Chung A. DiNome M.L. Chung M. Sieling P.A. Lee D.J. Microbial Dysbiosis Is Associated with Human Breast Cancer PLoS ONE 2014 9 e83744 10.1371/journal.pone.0083744 24421902 PMC3885448 72. Parida S. Wu S. Siddharth S. Wang G. Muniraj N. Nagalingam A. Hum C. Mistriotis P. Hao H. Talbot C.C. Jr. A procarcinogenic colon microbe promotes breast tumorigenesis and metastatic progression and concomitantly activates notch and β-catenin axes Cancer Discov. 2021 11 1138 1157 10.1158/2159-8290.CD-20-0537 33408241 73. Knippel R.J. Drewes J.L. Sears C.L. The cancer microbiome: Recent highlights and knowledge gaps Cancer Discov. 2021 11 2378 2395 10.1158/2159-8290.CD-21-0324 34400408 PMC8487941 74. Ghaddar B. Biswas A. Harris C. Omary M.B. Carpizo D.R. Blaser M.J. De S. Tumor microbiome links cellular programs and immunity in pancreatic cancer Cancer Cell 2022 40 1240 1253 10.1016/j.ccell.2022.09.009 36220074 PMC9556978 75. Fan X. Alekseyenko A.V. Wu J. Peters B.A. Jacobs E.J. Gapstur S.M. Purdue M.P. Abnet C.C. Stolzenberg-Solomon R. Miller G. Human oral microbiome and prospective risk for pancreatic cancer: A population-based nested case-control study Gut 2018 67 120 127 10.1136/gutjnl-2016-312580 27742762 PMC5607064 76. Aykut B. Pushalkar S. Chen R. Li Q. Abengozar R. Kim J.I. Shadaloey S.A. Wu D. Preiss P. Verma N. The fungal mycobiome promotes pancreatic oncogenesis via activation of MBL Nature 2019 574 264 267 10.1038/s41586-019-1608-2 31578522 PMC6858566 77. Badger J.L. Stins M.F. Kim K.S. Citrobacter freundii Invades and Replicates in Human Brain Microvascular Endothelial Cells Infect Immun. 1999 67 4208 4215 10.1128/IAI.67.8.4208-4215.1999 10417193 PMC96726 78. Felgner S. Kocijancic D. Frahm M. Weiss S. Bacteria in Cancer Therapy: Renaissance of an Old Concept Int. J. Microbiol. 2016 2016 8451728 10.1155/2016/8451728 27051423 PMC4802035 79. Gurbatri C.R. Arpaia N. Danino T. Engineering bacteria as interactive cancer therapies Science 2022 378 858 864 10.1126/science.add9667 36423303 PMC10584033 80. Wang M. Rousseau B. Qiu K. Huang G. Zhang Y. Su H. Le Bihan-Benjamin C. Khati I. Artz O. Foote M.B. Killing tumor-associated bacteria with a liposomal antibiotic generates neoantigens that induce anti-tumor immune responses Nat. Biotechnol. 2023 42 1263 1274 10.1038/s41587-023-01957-8 37749267 81. Kwon S.-Y. Thi-Thu Ngo H. Son J. Hong Y. Min J.-J. Exploiting bacteria for cancer immunotherapy Nat. Rev. Clin. Oncol. 2024 21 569 589 10.1038/s41571-024-00908-9 38840029 82. Zhu C. Liu C. Wu Q. Sheng T. Zhou R. Ren E. Zhang R. Zhao Z. Shi J. Shen X. Remolding the tumor microenvironment by bacteria augments adoptive T cell therapy in advanced-stage solid tumors Signal Transduct. Target. Ther. 2024 9 307 10.1038/s41392-024-02028-3 39572541 PMC11582571 83. Leschner S. Westphal K. Dietrich N. Viegas N. Jablonska J. Lyszkiewicz M. Lienenklaus S. Falk W. Gekara N. Loessner H. Tumor invasion of Salmonella enterica serovar Typhimurium is accompanied by strong hemorrhage promoted by TNF-α PLoS ONE 2009 4 e6692 10.1371/journal.pone.0006692 19693266 PMC2724709 84. Forbes N.S. Engineering the perfect (bacterial) cancer therapy Nat. Rev. Cancer 2010 10 785 794 10.1038/nrc2934 20944664 PMC3756932 85. Middlebrook J.L. Dorland R.B. Bacterial toxins: Cellular mechanisms of action Microbiol. Rev. 1984 48 199 221 10.1128/mr.48.3.199-221.1984 6436655 PMC373009 86. Staedtke V. Roberts N.J. Bai R.-Y. Zhou S. Clostridium novyi-NT in cancer therapy Genes Dis. 2016 3 144 152 10.1016/j.gendis.2016.01.003 30258882 PMC6150096 87. Flickinger J.C. Jr. Rodeck U. Snook A.E. Listeria monocytogenes as a vector for cancer immunotherapy: Current understanding and progress Vaccines 2018 6 48 10.3390/vaccines6030048 30044426 PMC6160973 88. Ganai S. Arenas R.B. Sauer J.P. Bentley B. Forbes N.S. In tumors Salmonella migrate away from vasculature toward the transition zone and induce apoptosis Cancer Gene Ther. 2011 18 457 466 10.1038/cgt.2011.10 21436868 PMC3117926 89. Uchugonova A. Zhang Y. Salz R. Liu F. Suetsugu A. Zhang L. Koenig K. Hoffman R.M. Zhao M. Imaging the different mechanisms of prostate cancer cell-killing by tumor-targeting Salmonella typhimurium A1-R Anticancer Res. 2015 35 5225 5229 26408681 90. Lee C.H. Lin S.T. Liu J.J. Chang W.W. Hsieh J.L. Wang W.K. Salmonella induce autophagy in melanoma by the downregulation of AKT/mTOR pathway Gene Ther. 2014 21 309 316 10.1038/gt.2013.86 24451116 91. Uchugonova A. Zhao M. Zhang Y. Weinigel M. Koenig K. Hoffman R.M. Cancer-cell killing by engineered Salmonella imaged by multiphoton tomography in live mice Anticancer Res. 2012 32 4331 4337 23060555 92. Liu B. Jiang Y. Dong T. Zhao M. Wu J. Li L. Chu Y. She S. Zhao H. Hoffman R.M. Blockage of autophagy pathway enhances Salmonella tumor-targeting Oncotarget 2016 7 22873 10.18632/oncotarget.8251 27013582 PMC5008408 93. Saccheri F. Pozzi C. Avogadri F. Barozzi S. Faretta M. Fusi P. Rescigno M. Bacteria-induced gap junctions in tumors favor antigen cross-presentation and antitumor immunity Sci. Transl. Med. 2010 2 44ra57 10.1126/scitranslmed.3000739 20702856 94. Chang W.-W. Lai C.-H. Chen M.-C. Liu C.-F. Kuan Y.-D. Lin S.-T. Lee C.-H. Salmonella enhance chemosensitivity in tumor through connexin 43 upregulation Int. J. Cancer 2013 133 1926 1935 10.1002/ijc.28155 23558669 95. Avogadri F. Martinoli C. Petrovska L. Chiodoni C. Transidico P. Bronte V. Longhi R. Colombo M.P. Dougan G. Rescigno M. Cancer immunotherapy based on killing of Salmonella-infected tumor cells Cancer Res. 2005 65 3920 3927 10.1158/0008-5472.CAN-04-3002 15867392 96. Kim S.H. Castro F. Paterson Y. Gravekamp C. High efficacy of a Listeria-based vaccine against metastatic breast cancer reveals a dual mode of action Cancer Res. 2009 69 5860 5866 10.1158/0008-5472.CAN-08-4855 19584282 PMC3127451 97. Phan T.X. Nguyen V.H. Duong M.T.-Q. Hong Y. Choy H.E. Min J.-J. Activation of inflammasome by attenuated Salmonella typhimurium in bacteria-mediated cancer therapy Microbiol. Immunol. 2015 59 664 675 10.1111/1348-0421.12333 26500022 98. Beutler B. Cerami A. The biology of cachectin/TNF--a primary mediator of the host response Annu. Rev. Immunol. 1989 7 625 655 10.1146/annurev.iy.07.040189.003205 2540776 99. Kocijancic D. Leschner S. Felgner S. Komoll R.-M. Frahm M. Pawar V. Weiss S. Therapeutic benefit of Salmonella attributed to LPS and TNF-α is exhaustible and dictated by tumor susceptibility Oncotarget 2017 8 36492 10.18632/oncotarget.16906 28445131 PMC5482671 100. Dobrovolskaia M.A. Vogel S.N. Toll receptors, CD14, and macrophage activation and deactivation by LPS Microbes Infect. 2002 4 903 914 10.1016/S1286-4579(02)01613-1 12106783 101. Sfondrini L. Rossini A. Besusso D. Merlo A. Tagliabue E. Mènard S. Balsari A. Antitumor activity of the TLR-5 ligand flagellin in mouse models of cancer J. Immunol. 2006 176 6624 6630 10.4049/jimmunol.176.11.6624 16709820 102. Agrawal N. Bettegowda C. Cheong I. Geschwind J.-F. Drake C.G. Hipkiss E.L. Tatsumi M. Dang L.H. Diaz L.A. Jr. Pomper M. Bacteriolytic therapy can generate a potent immune response against experimental tumors Proc. Natl. Acad. Sci. USA 2004 101 15172 15177 10.1073/pnas.0406242101 15471990 PMC523456 103. Shinnoh M. Horinaka M. Yasuda T. Yoshikawa S. Morita M. Yamada T. Miki T. Sakai T. Clostridium butyricum MIYAIRI 588 shows antitumor effects by enhancing the release of TRAIL from neutrophils through MMP-8 Int. J. Oncol. 2013 42 903 911 10.3892/ijo.2013.1790 23354042 104. Kim K. Jeong J.H. Lim D. Hong Y. Lim H.-J. Kim G.-J. Shin S. Lee J.-J. Yun M. Harris R.A. L-Asparaginase delivered by Salmonella typhimurium suppresses solid tumors Mol. Ther.-Oncolytics 2015 2 15007 10.1038/mto.2015.7 27119104 PMC4845971 105. Bredon M. le Malicot K. Louvet C. Evesque L. Gonzalez D. Tougeron D. Sokol H. Faecalibacteriumprausnitzii Is Associated With Clinical Response to Immune Checkpoint Inhibitors in Patients with Advanced Gastric Adenocarcinoma: Results of Microbiota Analysis of PRODIGE 59-FFCD 1707-DURIGAST Trial Gastroenterology 2025 168 601 603 10.1053/j.gastro.2024.10.020 39454892 106. Ganai S. Arenas R.B. Forbes N.S. Tumour-targeted delivery of TRAIL using Salmonella typhimurium enhances breast cancer survival in mice Br. J. Cancer 2009 101 1683 1691 10.1038/sj.bjc.6605403 19861961 PMC2778534 107. Zheng J.H. Nguyen V.H. Jiang S.-N. Park S.-H. Tan W. Hong S.H. Shin M.G. Chung I.-J. Hong Y. Bom H.-S. Two-step enhanced cancer immunotherapy with engineered Salmonella typhimurium Sci. Transl. Med. 2017 9 eaak9537 10.1126/scitranslmed.aak9537 28179508 108. Wilson W.R. Hay M.P. Targeting hypoxia in cancer therapy Nat. Rev. Cancer 2011 11 393 410 10.1038/nrc3064 21606941 109. Chen L. Ma S. Wu H. Zheng L. Yi Y. Liu G. Li B. Sun J. Du Y. Wang B. Zonated Copper-Driven Breast Cancer Progression Countered by a Copper-Depleting Nanoagent for Immune and Metabolic Reprogramming Adv. Sci. 2025 12 2412434 10.1002/advs.202412434 40270472 PMC12120698 110. Manoochehri Khoshinani H. Afshar S. Najafi R. Hypoxia: A double-edged sword in cancer therapy Cancer Investig. 2016 34 536 545 10.1080/07357907.2016.1245317 27824512 111. Fu J. Wu Q. Dang Y. Lei X. Feng G. Chen M. Yu X.-Y. Synergistic therapy using doxorubicin-loading and nitric oxide-generating hollow Prussian blue nanoparticles with photoacoustic imaging potential against breast cancer Int. J. Nanomed. 2021 16 6003 6016 10.2147/IJN.S327598 34511902 PMC8418369 112. Muhamad N. Plengsuriyakarn T. Na-Bangchang K. Application of active targeting nanoparticle delivery system for chemotherapeutic drugs and traditional/herbal medicines in cancer therapy: A systematic review Int. J. Nanomed. 2018 13 3921 3935 10.2147/IJN.S165210 30013345 PMC6038858 113. Zheng P. Fan M. Liu H. Zhang Y. Dai X. Li H. Zhou X. Hu S. Yang X. Jin Y. Self-propelled and near-infrared-phototaxic photosynthetic bacteria as photothermal agents for hypoxia-targeted cancer therapy ACS Nano 2020 15 1100 1110 10.1021/acsnano.0c08068 33236885 114. Chen F. Zang Z. Chen Z. Cui L. Chang Z. Ma A. Yin T. Liang R. Han Y. Wu Z. Nanophotosensitizer-engineered Salmonella bacteria with hypoxia targeting and photothermal-assisted mutual bioaccumulation for solid tumor therapy Biomaterials 2019 214 119226 10.1016/j.biomaterials.2019.119226 31174068 115. Duong M.T.-Q. Qin Y. You S.-H. Min J.-J. Bacteria-cancer interactions: Bacteria-based cancer therapy Exp. Mol. Med. 2019 51 1 15 10.1038/s12276-019-0297-0 PMC6906302 31827064 116. Ijaz M. Hasan I. Chaudhry T.H. Huang R. Zhang L. Hu Z. Tan Q. Guo B. Bacterial derivatives mediated drug delivery in cancer therapy: A new generation strategy J. Nanobiotechnol. 2024 22 510 10.1186/s12951-024-02786-w PMC11344338 39182109 117. Dadgar-Zankbar L. Elahi Z. Shariati A. Khaledi A. Razavi S. Khoshbayan A. Exploring the role of Fusobacterium nucleatum in colorectal cancer: Implications for tumor proliferation and chemoresistance Cell Commun. Signal. 2024 22 547 10.1186/s12964-024-01909-y 39548531 PMC11566256 118. Lee J.B. Kim K.-A. Cho H.Y. Kim D. Kim W.K. Yong D. Lee H. Yoon S.S. Han D.H. Han Y.D. Association between Fusobacterium nucleatum and patient prognosis in metastatic colon cancer Sci. Rep. 2021 11 20263 10.1038/s41598-021-98941-6 34642332 PMC8511250 119. Alon-Maimon T. Mandelboim O. Bachrach G. Fusobacterium nucleatum and cancer Periodontology 2000 2022 89 166 180 10.1111/prd.12426 35244982 PMC9315032 120. Pawelek J.M. Low K.B. Bermudes D. Tumor-targeted Salmonella as a novel anticancer vector Cancer Res. 1997 57 4537 4544 9377566 121. Diaz L.A. Jr. Cheong I. Foss C.A. Zhang X. Peters B.A. Agrawal N. Bettegowda C. Karim B. Liu G. Khan K. Pharmacologic and toxicologic evaluation of C. novyi-NT spores Toxicol. Sci. 2005 88 562 575 10.1093/toxsci/kfi316 16162850 122. Kasinskas R.W. Forbes N.S. Salmonella typhimurium lacking ribose chemoreceptors localize in tumor quiescence and induce apoptosis Cancer Res. 2007 67 3201 3209 10.1158/0008-5472.CAN-06-2618 17409428 123. Lee C.-H. Wu C.-L. Shiau A.-L. Systemic administration of attenuated Salmonella choleraesuis carrying thrombospondin-1 gene leads to tumor-specific transgene expression, delayed tumor growth and prolonged survival in the murine melanoma model Cancer Gene Ther. 2005 12 175 184 10.1038/sj.cgt.7700777 15375381 124. Westphal K. Leschner S. Jablonska J. Loessner H. Weiss S. Containment of Tumor-Colonizing Bacteria by Host Neutrophils Cancer Res. 2008 68 2952 2960 10.1158/0008-5472.CAN-07-2984 18413765 125. Branzk N. Lubojemska A. Hardison S.E. Wang Q. Gutierrez M.G. Brown G.D. Papayannopoulos V. Neutrophils sense microbe size and selectively release neutrophil extracellular traps in response to large pathogens Nat. Immunol. 2014 15 1017 1025 10.1038/ni.2987 25217981 PMC4236687 126. Yu Y.A. Zhang Q. Szalay A.A. Establishment and characterization of conditions required for tumor colonization by intravenously delivered bacteria Biotechnol. Bioeng. 2008 100 567 578 10.1002/bit.21785 18183632 127. Zhou S. Gravekamp C. Bermudes D. Liu K. Tumour-targeting bacteria engineered to fight cancer Nat. Rev. Cancer 2018 18 727 743 10.1038/s41568-018-0070-z 30405213 PMC6902869 128. Ding Y.-D. Shu L.-Z. He R.-S. Chen K.-Y. Deng Y.-J. Zhou Z.-B. Xiong Y. Deng H. Listeria monocytogenes: A promising vector for tumor immunotherapy Front. Immunol. 2023 14 1278011 10.3389/fimmu.2023.1278011 37868979 PMC10587691 129. He L. Yang H. Tang J. Liu Z. Chen Y. Lu B. He H. Tang S. Sun Y. Liu F. Intestinal probiotics E. coli Nissle 1917 as a targeted vehicle for delivery of p53 and Tum-5 to solid tumors for cancer therapy J. Biol. Eng. 2019 13 58 10.1186/s13036-019-0189-9 31297149 PMC6599283 130. Tan W. Duong M.T.-Q. Zuo C. Qin Y. Zhang Y. Guo Y. Hong Y. Zheng J.H. Min J.-J. Targeting of pancreatic cancer cells and stromal cells using engineered oncolytic Salmonella typhimurium Mol. Ther. 2022 30 662 671 10.1016/j.ymthe.2021.08.023 34400328 PMC8821930 131. Bottery M.J. Pitchford J.W. Friman V.-P. Ecology and evolution of antimicrobial resistance in bacterial communities ISME J. 2021 15 939 948 10.1038/s41396-020-00832-7 33219299 PMC8115348 132. Singh R. Patil S. Singh N. Gupta S. Dual functionality nanobioconjugates targeting intracellular bacteria in cancer cells with enhanced antimicrobial activity Sci. Rep. 2017 7 5792 10.1038/s41598-017-06014-4 28724927 PMC5517437 133. Zheng D.-W. Dong X. Pan P. Chen K.-W. Fan J.-X. Cheng S.-X. Zhang X.-Z. Phage-guided modulation of the gut microbiota of mouse models of colorectal cancer augments their responses to chemotherapy Nat. Biomed. Eng. 2019 3 717 728 10.1038/s41551-019-0423-2 31332342 134. Gogokhia L. Buhrke K. Bell R. Hoffman B. Brown D.G. Hanke-Gogokhia C. Ajami N.J. Wong M.C. Ghazaryan A. Valentine J.F. Expansion of bacteriophages is linked to aggravated intestinal inflammation and colitis Cell Host Microbe 2019 25 285 299.e8 10.1016/j.chom.2019.01.008 30763538 PMC6885004 135. Feng F. Tian Y. Xu G. Liu Z. Liu S. Zheng G. Guo M. Lian X. Fan D. Zhang H. Diagnostic and prognostic value of CEA, CA19–9, AFP and CA125 for early gastric cancer BMC Cancer 2017 17 737 10.1186/s12885-017-3738-y 29121872 PMC5679342 136. Gao Y. Wang J. Zhou Y. Sheng S. Qian S.Y. Huo X. Evaluation of Serum CEA, CA19-9, CA72-4, CA125 and Ferritin as Diagnostic Markers and Factors of Clinical Parameters for Colorectal Cancer Sci. Rep. 2018 8 2732 10.1038/s41598-018-21048-y 29426902 PMC5807317 137. Derosa L. Routy B. Thomas A.M. Iebba V. Zalcman G. Friard S. Mazieres J. Audigier-Valette C. Moro-Sibilot D. Goldwasser F. Intestinal Akkermansia muciniphila predicts clinical response to PD-1 blockade in patients with advanced non-small-cell lung cancer Nat. Med. 2022 28 315 324 10.1038/s41591-021-01655-5 35115705 PMC9330544 138. Guo S. Li L. Xu B. Li M. Zeng Q. Xiao H. Xue Y. Wu Y. Wang Y. Liu W. A Simple and Novel Fecal Biomarker for Colorectal Cancer: Ratio of Fusobacterium Nucleatum to Probiotics Populations, Based on Their Antagonistic Effect Clin. Chem. 2018 64 1327 1337 10.1373/clinchem.2018.289728 29914865 139. Brader P. Stritzker J. Riedl C.C. Zanzonico P. Cai S. Burnazi E.M. Ghani E.R. Hricak H. Szalay A.A. Fong Y. Escherichia coli Clin. Cancer Res. 2008 14 2295 2302 10.1158/1078-0432.CCR-07-4254 18369089 140. Dai J.-H. Tan X.-R. Qiao H. Liu N. Emerging clinical relevance of microbiome in cancer: Promising biomarkers and therapeutic targets Protein Cell 2024 15 239 260 10.1093/procel/pwad052 37946397 PMC10984626 141. Steinberg G.D. Shore N.D. Redorta J.P. Galsky M.D. Bedke J. Ku J.H. Kretkowski M. Hu H. Penkov K. Vermette J.J. CREST: Phase III study of sasanlimab and Bacillus Calmette-Guérin for patients with Bacillus Calmette-Guérin-naïve high-risk non-muscle-invasive bladder cancer Future Oncol. 2024 20 891 901 10.2217/fon-2023-0271 38189180 142. Luke J.J. Piha-Paul S.A. Medina T. Verschraegen C.F. Varterasian M. Brennan A.M. Riese R.J. Sokolovska A. Strauss J. Hava D.L. Phase I Study of SYNB1891, an Engineered E. coli Clin. Cancer Res. 2023 29 2435 2444 10.1158/1078-0432.CCR-23-0118 37227176 PMC11225568 143. Janku F. Zhang H.H. Pezeshki A. Goel S. Murthy R. Wang-Gillam A. Shepard D.R. Helgason T. Masters T. Hong D.S. Intratumoral Injection of Clostridium novyi-NT Spores in Patients with Treatment-refractory Advanced Solid Tumors Clin. Cancer Res. 2021 27 96 106 10.1158/1078-0432.CCR-20-2065 33046513 Figure 1 Schematic diagram of the TME. Figure 2 Schematic diagram of the bacteria–TME interaction. Figure 3 Introductory diagram showing three modes of action of tumor bacteria in tumor control (mode 1 is the anti-tumor effect achieved by relying on the bacteria’s own components or products; mode 2 is the tumor-targeting effect of some specific bacteria; and mode 3 is the anti-tumor effect achieved by relying on the activation of autoimmunity after the destruction of the tumor bacteria by antibiotics). Figure 4 A diagram of the anti-tumor nanomedicine targeting delivery mechanisms that rely on bacterial targeting. (Tumor-targeted delivery of drugs is achieved by isolating Fn Fn Fn pathogens-14-00874-t001_Table 1 Table 1 Common intratumoral bacteria in colorectal, breast, and pancreatic cancers. Tumor Types Intratumoral Bacteria Mechanism of Tumor Occurrence References Colorectal cancer  Fusobacterium nucleatum Dysregulation of signaling pathways; [ 43 61 62 63 64   Escherichia coli Dysregulation of signaling pathways; [ 51 65 66 67   Phylum Proteobacteria Dysregulation of signaling pathways; [ 68 69   Porphyromonas gingivalis Dysregulation of signaling pathways; [ 70   Prevotella Dysregulation of signaling pathways; [ 68   Peptostreptococcus Dysregulation of signaling pathways; [ 68   Prevotella intermedia Dysregulation of signaling pathways; [ 64 71   Fusobacterium necrophorum Dysregulation of signaling pathways; [ 64 Breast cancer  Methylobacterium radiotolerans Dysregulation of signaling pathways; [ 72   Fusobacterium nucleatum Dysregulation of signaling pathways; [ 73   Bacteroides fragilis Dysregulation of signaling pathways; [ 74   Escherichia coli Dysregulation of signaling pathways; [ 10   Staphylococcus epidermidis Dysregulation of signaling pathways; [ 10 Pancreatic cancer  Fusobacterium nucleatum Dysregulation of signaling pathways; [ 75   Porphyromonas gingivalis Dysregulation of signaling pathways; [ 76   Pseudomonadaceae Direct DNA damage; [ 60   Enterobacteriaceae Immunosuppressive cell infiltration; [ 60   Proteobacteria Immunosuppression; [ 60   Helicobacter pylori Dysregulation of signaling pathways; [ 77   Citrobacter freundii Dysregulation of signaling pathways; [ 78 ",
  "metadata": {
    "Title of this paper": "Intratumoral Injection of Clostridium novyi-NT Spores in Patients with Treatment-refractory Advanced Solid Tumors",
    "Journal it was published in:": "Pathogens",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12472499/"
  }
}