{
  "title": "Paper_662",
  "abstract": "Hosp Pharm Hosp Pharm 2261 hosppharm HPX Hospital Pharmacy 0018-5787 1945-1253 SAGE Publications PMC11418740 PMC11418740.1 11418740 11418740 39318740 10.1177/00185787241242759 10.1177_00185787241242759 1 Case Reports The Incidence of Thrombotic Events After the Concomitant Use of Andexanet alfa and 4-Factor Prothrombin Complex Concentrate https://orcid.org/0000-0003-3137-7049 Mohamed Adham 1 Shewmaker Justin 1 Berry Timothy 1 Blunck Joseph 1 1 Adham Mohamed, Department of Pharmacy, Saint Luke’s Hospital of Kansas City, 4401 Wornall Road, Kansas City, MO 64111, USA. Email: amohamed@saint-lukes.org The author(s) declared no potential conflicts of interest with respect to the research, authorship, and/or publication of this article. 29 3 2024 10 2024 59 5 471294 536 543 01 10 2025 01 10 2025 24 09 2024 01 10 2025 © The Author(s) 2024 2024 SAGE Publications Limited data exists on the safety and efficacy with the concomitant use of 4 factor prothrombic complex concentrate (4F-PCC) and andexanet alfa (AA). This case series describes 7 patients at our institution who received both 4F-PCC and AA for the management of life-threatening bleeding associated with apixaban or rivaroxaban. Four patients received AA due to worsening bleeding after 4F-PCC. Of the 7 patients in this case series, 1 had a documented thrombotic event which was an acute ischemic stroke. The thrombotic event rate in our case series was similar to the incidence of thrombotic events reported with the use of AA alone. In-hospital mortality occurred in 2 of 7 patients with 1 additional patient discharged to hospice care. andexanet alfa 4 factor prothrombin complex concentrate 4F-PCC thrombosis bleeding DOAC pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access no pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement no pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes typesetter ts1 ",
  "metadata": {
    "Title of this paper": "The Incidence of Thrombotic Events After the Concomitant Use of Andexanet alfa and 4-Factor Prothrombin Complex Concentrate",
    "Journal it was published in:": "Hospital Pharmacy",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC11418740/"
  }
}