{
  "title": "Paper_712",
  "abstract": "pmc Cell Stress Chaperones Cell Stress Chaperones 127 celstres Cell Stress & Chaperones 1355-8145 1466-1268 Elsevier PMC12478251 PMC12478251.1 12478251 12478251 40935014 10.1016/j.cstres.2025.100113 S1355-8145(25)00058-6 100113 1 Research Article TBX5-AS1 induces ER stress and suppresses lung cancer growth and tumor stemness via the miR-494-3p/ATF6 axis Wang Guoqin 1 # Fu Chaojiang 2 # Tu Changling 3 Yang Zhuangqing 4 Shi Wei 5 Zhang Lijuan 6 Tan Shufen shufen591@hotmail.com 7 ⁎ Huang Youguang huangyouguang2008@126.com 8 ⁎ 1 2 3 4 5 6 7 8 ⁎ shufen591@hotmail.com huangyouguang2008@126.com # Guoqin Wang and Chaojiang Fu contributed equally to this work. 12 2025 09 9 2025 30 6 497782 100113 19 5 2025 3 9 2025 4 9 2025 09 09 2025 30 09 2025 30 09 2025 © 2025 The Authors. Published by Elsevier Inc. on behalf of Cell Stress Society International. 2025 https://creativecommons.org/licenses/by-nc-nd/4.0/ This is an open access article under the CC BY-NC-ND license (http://creativecommons.org/licenses/by-nc-nd/4.0/). Tumor stemness maintenance and endoplasmic reticulum (ER) stress response have been strongly correlated with the progression of lung cancer (LC). Nevertheless, the role of long non-coding RNAs (lncRNAs) in these processes remains incompletely understood. We screened LC-associated lncRNAs from the GEO database and validated the expression of TBX5-AS1 in clinical samples. Functional experiments were conducted to assess the biological effects of TBX5-AS1, and western blot was used to detect ER stress marker proteins. The interaction mechanism of the TBX5-AS1/miR-494–3p/ATF6 axis was elucidated through dual-luciferase reporter assays, RNA immunoprecipitation (RIP), and pull-down experiments. Rescue experiments and a nude mouse xenograft model were employed to validate the functional outcomes. TBX5-AS1 was significantly downregulated in LC tissues and cell lines, and its low expression was associated with advanced tumor stages and poor patient prognosis. Overexpression of TBX5-AS1 markedly suppressed LC cell proliferation, migration, invasion, and self-renewal while promoting the activation of the ER stress pathway. Mechanistically, TBX5-AS1 competitively binds to miR-494–3p, thereby relieving its transcriptional repression of Activating transcription factor 6 (ATF6). Rescue experiments demonstrated that miR-494–3p overexpression reversed the regulatory effects of TBX5-AS1 on tumor malignant phenotype and ER stress. In vivo experiments further confirmed that TBX5-AS1 overexpression significantly inhibited tumor growth, accompanied by upregulation of ATF6 and ER stress-related proteins. TBX5-AS1 functioned as a tumor-suppressive lncRNA by activating ER stress signaling through the miR-494–3p/ATF6 axis, thereby inhibiting LC growth and tumor stemness. Highlights • TBX5-AS1 was obviously downregulated in LC. • TBX5-AS1 inhibited LC progression by miR-494-3p/ATF6. • TBX5-AS1 activated ER stress signaling and inhibited tumor stemness. Keywords TBX5-AS1 ER stress Tumor stemness MiR-494–3p ATF6 pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement yes pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes Introduction Globally, lung cancer (LC) persists as the predominant etiology of malignancy-associated mortality, demonstrating a 5-year overall survival (OS) rate below 20%. Its high invasiveness and drug resistance are closely linked to cancer stemness. 1 2 3 4 Long non-coding RNAs (lncRNAs) serve as pivotal regulators of gene expression, modulating diverse biological pathways. The competing endogenous RNA (ceRNA) theory posits that lncRNAs can sequester miRNAs to indirectly regulate mRNA targets, a mechanism extensively documented in oncogenesis. 5 6 7 8 9 10 11 12 13 Activating transcription factor 6 (ATF6) is a transmembrane glycoprotein and transcription activator that plays a role in initiating the UPR signaling pathway during ER stress. 14 15 16 3 In this study, we identified TBX5-AS1 as significantly downregulated in LC tissues. Further experiments revealed that TBX5-AS1 overexpression competitively bound to miR-494–3p, relieving its repression of ATF6 and activating ER stress pathways, thereby significantly impairing tumor cell self-renewal. Our findings highlighted the biological role of TBX5-AS1 in LC and its molecular mechanism of regulating ER stress and tumor stemness through the miR-494–3p/ATF6 axis. Results TBX5-AS1 was downregulated in LC and correlated with tumor progression and poor prognosis Through bioinformatics analysis of the GSE31210 12 Figure 1 Figure 1 Figure 1 Figure 1 Figure 1 Figure 1 Fig. 1 TBX5-AS1 expression was downregulated in LC. GSE31210 n Fig. 1 Overexpression of TBX5-AS1 inhibited LC cell proliferation, migration, invasion, and tumor stemness To investigate the functional consequences of TBX5-AS1 dysregulation, we established TBX5-AS1 overexpression cell lines, with transfection efficiency confirmed by RT-qPCR ( Figure 2 Figure 2 Figure 2 Figure 2 Figure 2 Figure 2 Figure 2 Figure 2 Fig. 2 Overexpression of TBX5-AS1 inhibited the proliferation, migration, invasion, and stemness of LC cells. Fig. 2 Overexpression of TBX5-AS1 enhanced ER stress to inhibit tumor progression Given the potential link between TBX5-AS1 and ER stress suggested by our above findings, we further investigated the expression of key ER stress-related proteins in TBX5-AS1-overexpressing LC cells to validate this functional association. To induce endoplasmic ER stress in LC cells, we treated them with thapsigargin, a well-established pharmacological inducer of ER stress. Western blot analysis showed that thapsigargin significantly upregulated the expression of ER stress-related proteins (ATF4, CHOP, and GRP78), confirming its potent ER stress-inducing activity. Notably, overexpression of TBX5-AS1 similarly led to a marked increase in the levels of these stress markers, with an effect comparable to that of thapsigargin treatment. This indicates that TBX5-AS1 effectively activates the ER stress pathway in LC cells. Moreover, the upregulation of these proteins could be synergistically enhanced by Thapsigargin and TBX5-AS1 ( Figure 3 Figure 3 Fig. 3 Overexpression of TBX5-AS1 suppressed the proliferation, metastasis, and stemness of LC cells by enhancing ER stress. Fig. 3 TBX5-AS1 regulated ATF6 expression by competitively binding to miR-494-3p Subcellular localization analysis revealed that TBX5-AS1 is predominantly distributed in the cytoplasm ( Figure 4 17 Figure 4 Fig. 4 TBX5-AS1 mediated ATF6 expression through interacting with miR-494–3p. Fig. 4 To validate this regulatory axis, wild-type (wt) and mutant (mut) dual-luciferase reporter plasmids for TBX5-AS1 and ATF6 were constructed ( Figure 4 Figure 4 Figure 4 Supplementary Figure S1 Supplementary Figure S1 Figure 4 Figure 4 Figure 4 Figure 4 TBX5-AS1 upregulation promoted ATF6 expression by sponging miR-494-3p, then affected the growth, metastasis, stemness, and ER stress in LC cells To elucidate the functional role of the TBX5-AS1/miR-494–3p/ATF6 axis in the progression of LC, we conducted co-transfection of miR-494–3p mimics in TBX5-AS1-overexpressing LC cells. Western blot analysis revealed that TBX5-AS1 overexpression significantly upregulated ATF6 protein expression, which was substantially attenuated by miR-494–3p mimic supplementation ( Figure 5 Figure 5 Figure 5 Figure 5 Figure 5 Figure 5 Figure 5 Fig. 5 TBX5-AS1 upregulation promoted ATF6 expression by sponging miR-494–3p, then affected the growth, metastasis, stemness, and ER stress in LC cells. Fig. 5 Overexpressing TBX5-AS1 hindered tumor growth and induced ER stress in LC cells in vivo To validate the in vivo function of TBX5-AS1, a subcutaneous xenograft tumor model in nude mice was established. The results showed that both tumor volume and weight were measurably reduced in the LV-oe-TBX5-AS1 group compared to controls ( Figure 6 Figure 6 Figure 6 Fig. 6 Investigating the role of TBX5-AS1 in cell growth and ER stress of LC cells in vivo. Fig. 6 Discussion LncRNAs play critical regulatory roles in tumorigenesis and can function as either oncogenes or tumor suppressors in various cancers, including LC. 18 19 13 11 Functional investigations revealed that overexpression of TBX5-AS1 noticeably attenuated malignant phenotypes, including cellular proliferation and migratory capacity in LC, aligning with existing reports documenting its oncosuppressive properties in non-small cell lung cancer. 11 20 The ceRNA mechanism has been widely validated as an important way for lncRNAs to regulate tumor progression. For example, lncRNA-PNUTS modulates migratory and invasive capacities in A549 and NMuMG cell lines via specific miR-205 binding domain interactions. 21 22 23 24 25 25 26 Notably, among the potential downstream targets of miR-494–3p, ATF6 was predicted by bioinformatics and experimentally validated as a direct target gene. ATF6 is a key sensor of the unfolded protein response pathway and functions as a transcription factor during ER stress, regulating a series of genes involved in maintaining protein homeostasis. In recent years, accumulating evidence has demonstrated that ATF6 not only participates in tumor growth and invasion but also plays a critical role in modulating tumor cell subpopulations with stem-like properties and in reshaping the tumor microenvironment. 3 27 28 29 In summary, this study not only further validates the tumor-suppressive role of TBX5-AS1 in LC but also elucidates a previously uncharacterized molecular mechanism by which TBX5-AS1 regulates ER stress and tumor stemness via the TBX5-AS1/miR-494–3p/ATF6 axis. This discovery functionally links the lncRNA-ceRNA regulatory network with the unfolded protein response signaling pathway, expanding the regulatory scope of non-coding RNAs in tumor stress responses, and provides potential new therapeutic targets and theoretical foundations for the precision treatment of LC. Conclusion In conclusion, this study revealed a novel mechanism by which TBX5-AS1 enhanced the ER stress through the ceRNA-mediated miR-494–3p/ATF6 axis, thereby inhibiting LC growth and stemness. This discovery not only enriches the theoretical framework of non-coding RNA regulation in tumor stemness but also provides a theoretical basis for developing new therapeutic strategies targeting the ER stress pathway. Materials and methods Clinical specimens This study was approved by the ethics committee of The Third Affiliated Hospital of Kunming Medical University (Yunnan Cancer Hospital). LC patients who did not receive chemotherapy or radiotherapy were selected to be included in the scope of the trial. Adjacent non-tumor tissues and tumor tissues were collected from patients at the same time. All patients or their guardians signed informed consent. Experiments involving human tissue specimens complied with the declaration of Helsinki. Cell culture and transfection HBE cells and four pulmonary carcinoma cell lines (A549, PC9, H23, and H1299) were procured from ATCC (USA). Cell cultures were maintained in RPMI-1640 medium (Gibco, USA) containing 10% FBS (Gibco) and 1% penicillin/streptomycin (Sigma-Aldrich, USA) under standard culture conditions (5% CO 2 TBX5-AS1 was overexpressed using two complementary systems. For transient overexpression in vitro, a pcDNA3.1-based plasmid containing a 3655 bp insert corresponding to the reference transcript of TBX5-AS1 (RefSeq: NR_038440.1 OV288968 HL288968 For transient transfection experiments, 2×10 5 Western blot analysis Protein lysates were prepared with RIPA buffer (Beyotime, China) and electrophoresed on 10% SDS-PAGE gels prior to electrotransfer onto PVDF membranes (Millipore, USA). Following blocking with 5% non-fat milk, immunoblotting was performed with specific primary antibodies: ATF6 (ab203119, 1:500), CHOP (ab11419, 1:1000), GRP78 (ab230508, 1:100), ATF4 (ab31390, 1:1000), and GAPDH (ab9485, 1:2000; all from Abcam, UK). HRP-conjugated secondary antibodies (1:5000, Proteintech, China) were employed for chemiluminescent detection using ECL substrate (Millipore), with imaging conducted on a ChemiDoc MP system (Bio-Rad, USA). RT-qPCR analysis Total RNA was isolated from pulmonary tissues and cell lines using TRIzol reagent (Invitrogen), followed by DNase I digestion (Takara, Japan) to eliminate genomic DNA contamination. cDNA synthesis was performed with PrimeScript RT Master Mix (Takara), and quantitative PCR was carried out using SYBR Premix Ex Taq II (Takara). Gene expression quantification utilized the comparative Ct (2-ΔΔCt) method with primer sequences detailed in Supplementary Table S1 Subcellular localization assessment Subcellular localization was determined using the PARISTM Kit (Thermo Fisher, USA) for nuclear/cytoplasmic fractionation. RNA from each fraction was purified with TRIzol (Invitrogen) and analyzed via RT-qPCR quantification. CCK-8 assay 3×10 3 Colony formation assay To evaluate the proliferative potential of LC cells following genetic modulation, a clonogenic survival assay was performed. Briefly, cells were seeded into 6-well tissue culture plates at a density of 1000 cells per well 24 h after transfection and allowed to attach overnight under standard culture conditions. After 24 h, the culture medium was replaced with fresh growth medium, and cells were maintained for an additional 14 days with periodic medium replenishment every 3-4 days to ensure nutrient availability. Upon completion of the incubation period, colonies were gently washed with PBS, fixed with 4% paraformaldehyde for 15 min at room temperature, and stained with 0.5% crystal violet solution for 20 min. Excess dye was removed by thorough washing with distilled water. Colonies containing more than 50 cells were photographed using a phase-contrast microscope (Olympus IX73) and manually counted. Wound healing assay Cells were seeded in 6-well plates (5×10 5 Transwell invasion analysis Matrigel-precoated Transwell chambers (Corning) were hydrated with 50 μL basal matrix for 1 h prior to use. Cellular suspensions (5×10 5 Tumorsphere formation assay Dissociated single cells (1×10 3 Dual-luciferase reporter assay The 3' untranslated region sequences of TBX5-AS1/ATF6 (wt and mut variants) were cloned into pmirGLO dual-reporter vectors (Promega, USA). Transient co-transfection was performed in pulmonary carcinoma cells using 100 ng reporter plasmids combined with 50 nM miR-494–3p mimics (RiboBio) or control oligonucleotides. Relative luciferase activity was quantified 48 h post-transfection using a dual-detection kit (Beyotime), with Renilla luciferase serving as the internal normalization control. RIP RIP experiments were conducted using magnetic bead-conjugated anti-Ago2 (ab186733, Abcam) or isotype-matched IgG (ab172730, Abcam). Cellular lysates were subjected to immunoprecipitation with antibody-coated beads (Thermo Fisher), followed by RNA isolation and subsequent quantification via RT-qPCR. In vivo experiment Female BALB/c nude mice (6-week-old, Vital River, China) were housed under specific pathogen-free conditions and randomized into experimental cohorts ( n 6 Statistical analysis Quantitative data are expressed as mean ± standard deviation. Intergroup differences were analyzed by unpaired Student's t http://ualcan.path.uab.edu t P Ethics statement This study was approved by the Ethics Committee of The Third Affiliated Hospital of Kunming Medical University (Yunnan Cancer Hospital). All participants were provided with written informed consent at the time of recruitment, and all experiments involving human tissue specimens comply with the Declaration of Helsinki Funding and support This study was supported by Yunnan Fundamental Research Projects (grant No. 202401AY070001–329). CRediT authorship contribution statement Guoqin Wang: Chaojiang Fu: Changling Tu: Zhuangqing Yang: Wei Shi: Lijuan Zhang: Shufen Tan: Youguang Huang: Declaration of interest The authors declare that they have no known competing financial interests or personal relationships that could have appeared to influence the work reported in this paper. References 1 Li Y. Yan B. He S. Advances and challenges in the treatment of lung cancer Biomed Pharmacother 169 2023 115891 10.1016/j.biopha.2023.115891 37979378 2 Brabletz S. Schuhwerk H. Brabletz T. Stemmler M.P. Dynamic EMT: a multi-tool for tumor progression EMBO J 40 2021 e108647 10.15252/embj.2021108647 PMC8441439 34459003 3 Liang D. Khoonkari M. Avril T. Chevet E. Kruyt F.A.E. The unfolded protein response as regulator of cancer stemness and differentiation: mechanisms and implications for cancer therapy Biochem Pharmacol 192 2021 114737 10.1016/j.bcp.2021.114737 34411568 4 Chen X. Cubillos-Ruiz J.R. Endoplasmic reticulum stress signals in the tumour and its microenvironment Nat Rev Cancer 21 2021 71 88 10.1038/s41568-020-00312-2 33214692 PMC7927882 5 Guo Q. Liu Q. He D. LnCeCell 2.0: an updated resource for lncRNA-associated ceRNA networks and web tools based on single-cell and spatial transcriptomics sequencing data Nucleic Acids Res 53 2025 D107 D115 10.1093/nar/gkae947 39470723 PMC11701739 6 Xue S.T. Zheng B. Cao S.Q. Long non-coding RNA LINC00680 functions as a ceRNA to promote esophageal squamous cell carcinoma progression through the miR-423-5p/PAK6 axis Mol Cancer 21 2022 69 10.1186/s12943-022-01539-3 35255921 PMC8900330 7 Xiong J. Lai Y. Cheng N. Lnc-PLA2G4A-4 facilitates the progression of hepatocellular carcinoma by inducing versican expression via sponging miR-23b-3p Heliyon 9 2023 e18698 10.1016/j.heliyon.2023.e18698 PMC10405012 37554815 8 Zhang W.Y. Zhan H.L. Li M.K. Wu G.D. Liu Z. Wu L.F. Long noncoding RNA Gas5 induces cell apoptosis and inhibits tumor growth via activating the CHOP-dependent endoplasmic reticulum stress pathway in human hepatoblastoma HepG2 cells J Cell Biochem 123 2022 231 247 10.1002/jcb.30159 34636091 9 Zhang H. Ma B. Li N. SNHG1, a KLF4-upregulated gene, promotes glioma cell survival and tumorigenesis under endoplasmic reticulum stress by upregulating BIRC3 expression J Cell Mol Med 27 2023 1806 1819 10.1111/jcmm.17779 37243389 PMC10315853 10 Ichihara M. Takahashi H. Nishida N. Long noncoding RNA 01534 maintains cancer stemness by downregulating endoplasmic reticulum stress response in colorectal cancer Ann Gastroenterol Surg 7 2023 458 470 10.1002/ags3.12649 37152770 PMC10154865 11 Qu Q.H. Jiang S.Z. Li X.Y. LncRNA TBX5-AS1 regulates the tumor progression through the PI3K/AKT pathway in non-small cell lung cancer Onco Targets Ther 13 2020 7949 7961 10.2147/ott.S255195 32884287 PMC7431607 12 Yu L. Zhou S. Hong W. Lin N. Wang Q. Liang P. Characterization of an endoplasmic reticulum stress-associated lncRNA prognostic signature and the tumor-suppressive role of RP11-295G20.2 knockdown in lung adenocarcinoma Sci Rep 14 2024 12283 10.1038/s41598-024-62836-z PMC11137026 38811828 13 Cheng L. Han T. Chen B. Nie K. Peng W. TBX5-AS1, an enhancer RNA, is a potential novel prognostic biomarker for lung adenocarcinoma BMC Cancer 21 2021 794 10.1186/s12885-021-08517-w 34238250 PMC8268367 14 Stengel S.T. Fazio A. Lipinski S. Activating transcription factor 6 mediates inflammatory signals in intestinal epithelial cells upon endoplasmic reticulum stress Gastroenterology 159 2020 1357 1374.e1310 10.1053/j.gastro.2020.06.088 32673694 PMC7923714 15 Toro R. Pérez-Serra A. Mangas A. miR-16-5p suppression protects human cardiomyocytes against endoplasmic reticulum and oxidative stress-induced injury Int J Mol Sci 23 2022 1036 10.3390/ijms23031036 35162959 PMC8834785 16 Ou D. Wu Y. Zhang J. miR-340-5p affects oral squamous cell carcinoma (OSCC) cells proliferation and invasion by targeting endoplasmic reticulum stress proteins Eur J Pharmacol 920 2022 174820 10.1016/j.ejphar.2022.174820 35227681 17 Li J. Gu X. Gao C. Zhang J. Six MicroRNA prognostic models for overall survival of lung adenocarcinoma Genet Res (Camb) 2022 2022 5955052 10.1155/2022/5955052 PMC9440840 36101742 18 Bhan A. Soleimani M. Mandal S.S. Long noncoding RNA and cancer: a new paradigm Cancer Res 77 2017 3965 3981 10.1158/0008-5472.Can-16-2634 28701486 PMC8330958 19 Xiong Y. Zhang X. Lin Z. SFTA1P, LINC00968, GATA6-AS1, TBX5-AS1, and FEZF1-AS1 are crucial long non-coding RNAs associated with the prognosis of lung squamous cell carcinoma Oncol Lett 18 2019 3985 3993 10.3892/ol.2019.10744 31579094 PMC6757264 20 Najafi M. Farhood B. Mortezaee K. Cancer stem cells (CSCs) in cancer progression and therapy J Cell Physiol 234 2019 8381 8395 10.1002/jcp.27740 30417375 21 Grelet S. Link L.A. Howley B. A regulated PNUTS mRNA to lncRNA splice switch mediates EMT and tumour progression Nat Cell Biol 19 2017 1105 1115 10.1038/ncb3595 28825698 PMC5578890 22 Qu L. Ding J. Chen C. Exosome-transmitted lncARSR promotes sunitinib resistance in renal cancer by acting as a competing endogenous RNA Cancer Cell 29 2016 653 668 10.1016/j.ccell.2016.03.004 27117758 23 Li X.T. Wang H.Z. Wu Z.W. miR-494-3p regulates cellular proliferation, invasion, migration, and apoptosis by PTEN/AKT signaling in human glioblastoma cells Cell Mol Neurobiol 35 2015 679 687 10.1007/s10571-015-0163-0 25662849 PMC4477718 24 Yang Y. Yang T. Zhao Z. Down-regulation of BMAL1 by MiR-494-3p promotes hepatocellular carcinoma growth and metastasis by increasing GPAM-mediated lipid biosynthesis Int J Biol Sci 18 2022 6129 6144 10.7150/ijbs.74951 36439870 PMC9682529 25 Du Y. Kajino T. Shimada Y. Takahashi T. Taguchi A. Mir-494-3p enhances aggressive phenotype of non-small cell lung cancer cells by regulating SET/I2PP2A Sci Rep 15 2025 15441 10.1038/s41598-025-99558-9 PMC12048640 40316770 26 Faversani A. Amatori S. Augello C. miR-494-3p is a novel tumor driver of lung carcinogenesis Oncotarget 8 2017 7231 7247 10.18632/oncotarget.13933 27980227 PMC5352317 27 Urra H. Dufey E. Avril T. Chevet E. Hetz C. Endoplasmic reticulum stress and the hallmarks of cancer Trends Cancer 2 2016 252 262 10.1016/j.trecan.2016.03.007 28741511 28 Spaan C.N. Smit W.L. van Lidth de Jeude J.F. Expression of UPR effector proteins ATF6 and XBP1 reduce colorectal cancer cell proliferation and stemness by activating PERK signaling Cell Death Dis 10 2019 490 10.1038/s41419-019-1729-4 31227689 PMC6588629 29 Macke A.J. Pachikov A.N. Divita T.E. Targeting the ATF6-mediated ER stress response and autophagy blocks integrin-driven prostate cancer progression Mol Cancer Res 21 2023 958 974 10.1158/1541-7786.Mcr-23-0108 37314749 PMC10527559 Appendix A Supplementary material Supplementary material Supplementary material Supplementary material Supplementary material Data availability Data will be made available on request. Appendix A Supplementary data associated with this article can be found in the online version at doi:10.1016/j.cstres.2025.100113 ",
  "metadata": {
    "Title of this paper": "Targeting the ATF6-mediated ER stress response and autophagy blocks integrin-driven prostate cancer progression",
    "Journal it was published in:": "Cell Stress & Chaperones",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12478251/"
  }
}