{
  "title": "Paper_980",
  "abstract": "pmc Molecules Molecules 3416 molecules molecules Molecules 1420-3049 Multidisciplinary Digital Publishing Institute  (MDPI) PMC12472977 PMC12472977.1 12472977 12472977 41011574 10.3390/molecules30183677 molecules-30-03677 1 Article Implementation of a Novel Nanobody Panel for the Efficient Capture of Extracellular Vesicles from Human Plasma https://orcid.org/0009-0007-7378-866X Tursunović Marija 1 Filipović Lidija Methodology Writing – review & editing 1 https://orcid.org/0000-0003-2756-6517 Mitić Ninoslav Methodology Writing – review & editing 2 https://orcid.org/0000-0003-2157-5754 Stevanović Sanja Methodology Writing – review & editing 3 https://orcid.org/0000-0001-9134-6637 Spasojević Savković Milica Methodology Writing – review & editing 1 https://orcid.org/0000-0001-7729-819X de Marco Ario Data curation Writing – review & editing 4 https://orcid.org/0000-0002-3681-2153 Popović Milica Conceptualization Writing – review & editing Funding acquisition 5 * Uversky Vladimir N. Academic Editor 1 mtursunovic@chem.bg.ac.rs lfilipovic@chem.bg.ac.rs smilica84@gmail.com 2 ninoslavm@inep.co.rs 3 sanjas@ihtm.bg.ac.rs 4 ario.demarco@ung.si 5 * la_bioquimica@chem.bg.ac.rs 10 9 2025 9 2025 30 18 496804 3677 29 7 2025 26 8 2025 09 9 2025 10 09 2025 27 09 2025 29 09 2025 © 2025 by the authors. 2025 https://creativecommons.org/licenses/by/4.0/ Licensee MDPI, Basel, Switzerland. This article is an open access article distributed under the terms and conditions of the Creative Commons Attribution (CC BY) license ( https://creativecommons.org/licenses/by/4.0/ Extracellular vesicles (EVs) are nanoscale particles released by cells and are significant components in intercellular communication. Their ability to reflect the molecular state of parental cells and their presence in body fluids make them increasingly recognized as promising non-invasive biomarkers for different pathological conditions. However, the existence of different EV populations and frequent co-isolation of contaminants present challenges for EV purification and downstream analyses. In this study, we used three novel nanobodies (VHH) for selective isolation of EVs from human plasma. Nanobodies were obtained by direct panning on EVs. All examined nanobodies have excellent physicochemical properties resulting in excellent expression and solubility. The three nanobodies being studied—NA8, ND10 1 2 E. coli extracellular vesicles nanobodies bioinformatics immunoaffinity chromatography Science Fund of the Republic of Serbia 4747 European Union 101182851 This research was supported by the Science Fund of the Republic of Serbia, Grant PRISMA No. 4747, Project title: Advancing REversible immunocapture toward SCALablE EV purification—RESCALE-EV and the European Union under Grant Agreement No. 101182851. pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement yes pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes 1. Introduction All cells release EVs, nanoscale particles surrounded by a lipid membrane, into the extracellular environment. EVs transport a variety of bioactive molecules to local and distant cells, thereby altering their function [ 1 2 3 4 5 6 7 8 9 10 11 12 13 14 15 16 Given the important roles of EVs in diagnostics and therapy, it is crucial to establish efficient and reproducible isolation methods that would preserve their integrity and result in high yield and purity. Common methods used for EVs isolation, such as differential ultracentrifugation, size-exclusion chromatography (SEC), and precipitation-based techniques, separate EVs from biological fluids based on their size or density. However, these techniques are time-consuming and often result in EVs that are co-isolated with other particles of similar physicochemical properties [ 17 18 19 20 21 To overcome such a bottleneck, single-domain antibodies (nanobodies or VHH) are emerging as a promising alternative. VHHs are single-domain antibody fragments derived from Camelidae 22 23 24 25 26 26 27 28 29 30 In our previous studies, we successfully implemented a method for EVs isolation from various sources based on a set of five different nanobodies [ 31 32 2. Results 2.1. Selection of Anti-EVs VHH An in vitro selection strategy was adapted for isolating nanobody binders against EVs. The workflow involved a differential panning procedure, where EV-enriched fractions from HEK293 cells were used in the depletion step, and SKBR3-derived EVs were used in the enrichment step. EVs were stabilized by binding them to magnetic beads decorated with anti-EVs-VHHs. The use of such reagents facilitated the efficient washing and recovery of bound phages. After two rounds of selection, the recovered clones were screened by phage ELISA against EVs from both cell types. A subset of EV-reactive clones was selected for sequencing, revealing several unique nanobody sequences. Despite the depletion step used to remove binders recognizing common epitopes, the selected binders did not show sufficient discriminatory properties and rather recognized conserved EV epitopes ( Figure 1 30 2.2. Physicochemical Analysis of VHH Nanobodies and Sequence Comparison The three nanobodies had molecular weights ranging from 13.5 to 14.0 kDa and isoelectric points in basic pH (pI value: 8.59–9.30), suitable for optimal solubility at the physiological pH. The highest molecular weight was found for NA8, due to its longer CDR1. An instability index below 40 predicted in vitro stability of ND10 2 Supplementary Table S1 2 1 Supplementary Table S1 Figure 2 VHH sequences display canonical framework (FR1, FR2, FR3, and FR4) and CRD loop (CDR1, CDR2 and CDR3) sequence regions. The framework regions (FR1, FR2, FR3, and FR4) exhibit a high degree of conservation across all three variants. In contrast, the CDRs, particularly CDR3 (residues 104–116), shows higher degree of variability, which potentially reflects their critical function in antigen recognition and specificity. The amino acid sequences of the VHH three complementarity-determining regions (CDRs) are given in Table 1 To analyze structural diversity and conservation of nanobody sequences, lengths of CDR1–3 were compared ( Table 1 1 2 27 2.3. Structural Interpretation of NA8, ND10 1 2 In silico predictions of nanobodies was performed using AlphaFold Server [ 33 Figure 3 2 1 34 1 2, 2.4. Purification of Nanobodies Small-scale expression conditions were assessed prior to VHH purification to produce them in soluble form. VHH-eGFP constructs were expressed in E. coli Figure 4 2.5. Size Distribution of EVs Isolated Using Nanobody-Based Approach Produced VHH constructs were immobilized upon purification onto a solid methacrylate-based carrier and used for EVs purification. Nanoparticle tracking analysis (NTA) was used to determine the concentration and size of EVs isolated from human plasma. Quantitative data ( Table 2 9 2 9 1 9 Figure 5 2.6. Protein Profile of Isolated EVs and Detection of Surface Markers 2.6.1. SDS-PAGE Analysis To evaluate the protein pattern of EV isolated by our immobilized nanobodies, SDS-PAGE was performed. Upon elution, an equal volume of each EV sample was loaded and separated on a 12% gel in reducing conditions. ( Figure 6 Supplementary Figure S1 The vesicles display similar protein bands, with the most prominent ones at ~25 kDa, as well as between ~45 and ~66 kDa, indicating that similar EV subpopulations were captured. 2.6.2. Detection of Surface Markers with Flow Cytometry Flow cytometry analysis was performed by immobilizing EVs onto latex beads and using three different fluorescently labeled monoclonal antibodies against the standard EV biomarkers CD9, CD63, and CD81. All isolates displayed a positive shift in the fluorescence intensity in comparison to autofluorescence of the beads themselves ( Figure 7 1 2 2.7. Evaluation of Protein and Lipid Content in EVs Isolates 2.7.1. Quantification of Proteins and Lipids with Colorimetric Assays The Bradford assay and sulfo-phospho-vanillin (SPV) assay were used for quantification of proteins and lipids in isolates, respectively. The ND10 1 2 2 Table 3 1 2 35 2.7.2. Attenuated Total Reflectance Fourier-Transform Infrared Spectroscopy (ATR-FTIR) To evaluate the biochemical composition of the isolated extracellular vesicles, ATR-FTIR spectroscopy of all EV isolates was performed. The spectra display consistent profiles across all samples with prominent bands corresponding to amide I (~1640 cm −1 −1 36 −1 36 −1 2 37 −1 −1 Figure 8 1 2 2.8. Morphology Evaluation Scanning electron microscopy (SEM) and atomic force microscopy (AFM) were used for determination of morphology and structural integrity of EVs isolated with the nanobody-affinity approach. Obtained pictures from both SEM ( Figure 9 Figure 10 The SEM ( Figure 9 Atomic force microscopy (AFM) was employed to image the surface morphology and topography of isolated ND10 1 Figure 10 3. Discussion Liquid biopsy procedures based on readily available biomarkers play an important role in early diagnosis of various pathological conditions. EVs are at the forefront as a potential source of the next readily available and affordable biomarker, especially in oncology [ 38 39 40 41 20 42 43 44 Nanobodies can have very diverse paratope structures, which can recognize a large number of epitopes, especially hidden or recessed epitopes [ 45 46 47 48 49 50 51 52 30 53 54 In this work we have characterized three distinct nanobody clones, each selected by panning a naïve VHH library directly on EV derived from the cell culture supernatant. All examined nanobodies have excellent physicochemical properties resulting in outstanding expression and solubility. Positive isoelectric points at alkaline pH and negative GRAVY scores indicate hydrophilic structures. Aliphatic indices, especially high ones in NA8, point towards robust thermal stability and a structurally stable back-bone. The AlphaFold-predicted models of the three VHH domains ( Figure 3 27 33 55 33 56 56 Each clone could successfully capture EVs from human plasma upon immobilization onto a solid carrier. In comparison to ultracentrifugation, similar number of vesicles with less proteins were secluded [ 57 58 10 59 60 59 61 62 31 9 2 1 2 1 9 10 2 1 9 9 9 9 31 1 2 In our study, the isolated vesicles were also characterized by ATR-FTIR. Due to its simplicity, and minimal sample requirements, ATR-FTIR spectroscopy is recognized as a powerful tool for analyses of biological samples. ATR-FTIR is a non-destructive, stable technique for EV characterization. Moreover, this technique has previously been used for characterization of EVs, including comparison of isolation performances [ 63 64 65 66 67 2 3 63 65 65 68 68 −1 64 Although this work demonstrates the successful use of three different nanobodies for the isolation of EVs, an important question still remains open regarding the precise identity and EV subpopulations captured by each nanobody. Even though the recovered vesicles exhibited similar physicochemical and biochemical properties, it is still unclear whether these nanobodies bind the same or distinct EV subpopulations. If the nanobodies indeed target different antigens, this may imply that they capture specific EV subpopulation, each potentially having unique functional role. Given the fact that isolated vesicles were confirmed to express canonical tetraspanin markers (CD9, CD63, CD81), but not at uniformly high levels across all isolates, it is plausible that the nanobodies bind epitopes distinct from commonly targeted tetraspanins. Such divergence in antigen recognition would suggest that selected nanobodies could recognize some less-characterized EVs surface molecules, opening possibilities for the capture of new EV populations. However, the identification of nanobody targets remains unresolved and requires further investigation, such as epitope mapping. Therefore, future work should aim to evaluate the binding specificities of each nanobody and characterize the potential functional and molecular differences among the captured EV subtypes. Furthermore, thorough characterization on EVs populations targeted by these VHHs should be investigated by single vesicle analysis and omics methodologies. Addressing these questions would be important for advancing nanobody-based EV isolation to a precisely targeted and EV subpopulation specific isolation platform. 4. Materials and Methods 4.1. Chemicals Molecular weight markers for SDS-PAGE were Pierce TM ® w v 4.2. Panning on Isolated EVs Panning was carried out using a modified approach based on previously established methods with some modifications [ 30 31 11 50 4.3. Selection of Enriched Phage Libraries The colonies that were obtained after the second panning cycle generated phages, which were then evaluated by ELISA for their ability to bind to EVs. A non-related clone served as a negative control. Microtiter plates (96-well, MaxiSorp, Nunc™, Roskilde, Denmark) were coated by incubating at 4 °C overnight with 10 μg/well in PBS of anti-EVs-VHH. Plates were sealed (1 h at 37 °C in PBS buffer with 5% ( w v w v 4 4.4. Physicochemical Analysis of VHH Nanobodies Physicochemical properties were calculated using the Biopython ProtParam module. Molecular weight, isoelectric point (pI), instability index, aromaticity, hydrophobicity (GRAVY), and aliphatic index of each nanobody sequence were determined. GRAVY was measured as average hydropathy values, while aliphatic index was calculated manually from relative volume of aliphatic side chains (Ala, Val, Ile, Leu). 4.5. Comparison of Nanobody Sequences and Structures to Canonical VHH Framework Protein sequences of NA8, ND10 1 2 1 2 To determine the degree of conservation and variability in VHHs, three nanobodies—NA8, ND10 1 2 VHH structures were predicted using AlphaFold2 (v) via the open-source implementation provided by DeepMind: https://github.com/deepmind/alphafold 34 69 https://www.imgt.org/3Dstructure-DB/cgi/DomainGapAlign.cgi 70 71 4.6. Expression and Purification of VHH-eGFP Constructs In this work three different VHH, labeled as NA8, ND10 1 2 E. coli 600 w v 2 g 4.7. Coupling of Nanobodies to a Solid Carrier Methacrylate-based copolymer was used for immobilization of nanobodies. Activation and immobilization of the polymer were performed as previously described with some minor modifications [ 31 w v 4.8. Purification of EVs from Human Plasma Using Immunoaffinity Approach Human blood was collected from one healthy donor using a citrate tube. The study was approved by the Ethics Committee of University of Belgrade, Faculty of Chemistry (2-6/24, 16 July 2024). The collection was performed in accordance with the Declaration of Helsinki. Blood was processed 20 min after collecting, and plasma was isolated by previously established protocol [ 31 4.9. SDS PAGE Analysis of Purified Nanobodies and EVs Isolates The purity of the purified recombinant nanobodies and the protein profile of the isolated EVs were analyzed by Sodium Dodecyl Sulfate-Poly Acrylamide Gel Electrophoresis (SDS-PAGE) according to Laemmli [ 72 www.gelanalyzer.com 4.10. Determination of Protein and Lipid Content in EVs Isolates Protein concentration in EV isolates was determined with the Bradford assay [ 73 74 4.11. Quantification and Size Distribution of EVs by NTA The size distribution and median size of the EV isolates were assessed using the ZetaView Quatt PMX-430 (Particle Metrix, Inning am Ammersee, Germany) nanoparticle tracking analyzer and ZetaView software version 8.05.16. Prior to analysis, the camera and laser underwent an automatic cell check, with focus confirmed using 100 nm polystyrene beads as described in the manufacturer’s guidelines. EV samples were diluted in particle-depleted 0.05 M PBS, pH 7.2 (dPBS) to achieve an optimal particle count per frame. Measurements were conducted using a blue laser (488 nm) in light scatter mode (LSM), with dPBS used for washing between each measurement. Video acquisition settings included a shutter speed of 100 and a frame rate of 30 per cycle, with sensitivity set at 78. Post video-capturing parameters included a minimum area of 10, a maximum area of 1000, and a minimum brightness of 30. Each EVs isolate was measured three times at up to 11 positions. 4.12. Attenuated Total Reflection Fourier-Transform Infrared Spectroscopy (ATR-FTIR) ATR-FTIR spectra were collected using Nicolet Summit FTIR Spectrometer (Thermo Fisher Scientific, Waltham, MA, USA) in ATR mode equipped with DTGS KBr detector (Thermo Scientific, Waltham, MA, USA). Aliquots of 1.5 μL of EVs isolates were applied onto a diamond crystal and a thin dry film was obtained by evaporating the buffer in the stream of nitrogen. Spectra (400–4000 cm −1 −1 4.13. Analysis of Surface EVs Markers Latex beads were diluted 10 times in PBS. A total weight of 20 μg of EVs (based on protein concentration) was immobilized onto 40 μL of diluted beads overnight at 4 °C with light shaking. The following day the beads were washed three times with PBS (the beads were vortexed, then pelleted at 13,000× g w v v v 4.14. Evaluation of EVs Morphology 4.14.1. Scanning Electron Microscopy (SEM) The morphology of isolated EVs was analyzed by scanning electron microscopy (SEM). Isolates were fixed with 2.5% glutaraldehyde in PBS for 10 min at RT, further loaded on metal stubs, and left to dry. All samples were coated with a thin-gold layer using a sputter coater (Polaron SC503, Fisons Instruments, Ipswich, UK) prior to characterization of the EV morphology with Tescan FE-SEM Mira 3 XMU (Tescan, Brno, Czech Republic) 4.14.2. Atomic Force Microscopy The surface morphology of isolated EVs was examined with atomic force microscopy (AFM) using a NanoScope 3D (Veeco, NY, USA) microscope in tapping mode under ambient conditions. Image analysis was conducted utilizing Nanoscope image processing software (v1.40r1). Prior to imaging, the mica substrate was mechanically polished using adhesive tape. Ten μL of EV isolates were applied to prepared mica substrate and allowed to air-dry for 7 days. 4.15. Statistical Analysis Statistical analysis was performed using GraphPad Prism 10.4.2. for Windows (San Diego, CA, USA). A significance level of p p p 5. Conclusions In this study, successful isolation and characterization of plasma-derived EVs using three different nanobodies selected by direct panning on EVs have been demonstrated. This nanobody-based immunoaffinity approach is fast, easy-to-operate, and ensures high recovery of intact EVs from human plasma. Importantly, nanobodies offer many advantages over conventional antibodies, which makes them powerful tool for development of selective, reproducible and scalable EVs isolation strategies. Our findings support the application of nanobodies for immunoaffinity-based methods as an effective alternative to conventional antibody-based approaches, with strong potential for diagnostics and research applications. Disclaimer/Publisher’s Note: Supplementary Materials The following supporting information can be downloaded at: https://www.mdpi.com/article/10.3390/molecules30183677/s1 1 2 Author Contributions Conceptualization, M.P.; Data curation, A.d.M.; Formal analysis, M.T.; Funding acquisition, M.P.; Methodology, M.T., L.F., N.M., S.S. and M.S.S.; Writing—original draft, M.T.; Writing—review and editing, M.T., L.F., N.M., S.S., M.S.S., A.d.M. and M.P. All authors have read and agreed to the published version of the manuscript. Institutional Review Board Statement The study was conducted in accordance with the Declaration of Helsinki, and approved by the Ethics Committee of University of Belgrade, Faculty of Chemistry (2-6/24, 16 July 2024). Informed Consent Statement Informed consent was obtained from all subjects involved in the study. Written informed consent has been obtained from the patient(s) to publish this paper. Data Availability Statement Data can be found within the article and Supplementary Materials Conflicts of Interest The authors declare no conflicts of interest. Abbreviations The following abbreviations are used in this manuscript: AFM—Atomic Force Microscopy; ATR-FTIR—Attenuated Total Reflectance-Fourier Transform Infrared Spectroscopy; CDR—Complementarity-Determining Regions; EVs—Extracellular Vesicles; EXO—Exosomes; FR—Framework Region; IMAC—Immobilized Metal Affinity Chromatography; MVB—Multivesicular Bodies; NTA—Nanoparticle Tracking Analysis; SEC—Size-Exclusion Chromatography; SEM—Scanning Electron Microscopy; VHH—Single-Domain Antibodies/Nanobodies References 1. Sheta M. Taha E.A. Lu Y. Eguchi T. Extracellular Vesicles: New Classification and Tumor Immunosuppression Biology 2023 12 110 10.3390/biology12010110 36671802 PMC9856004 2. Tschuschke M. Kocherova I. Bryja A. Mozdziak P. Angelova Volponi A. Janowicz K. Sibiak R. Piotrowska-Kempisty H. Iżycki D. Bukowska D. Inclusion Biogenesis, Methods of Isolation and Clinical Application of Human Cellular Exosomes J. Clin. Med. 2020 9 436 10.3390/jcm9020436 32041096 PMC7074492 3. Akers J.C. Gonda D. Kim R. Carter B.S. Chen C.C. Biogenesis of extracellular vesicles (EV): Exosomes, microvesicles, retrovirus-like vesicles, and apoptotic bodies J. Neurooncol. 2013 113 1 11 10.1007/s11060-013-1084-8 23456661 PMC5533094 4. Abels E.R. Breakefield X.O. Introduction to Extracellular Vesicles: Biogenesis, RNA Cargo Selection, Content, Release, and Uptake Cell Mol. Neurobiol. 2016 36 301 312 10.1007/s10571-016-0366-z 27053351 PMC5546313 5. Yáñez-Mó M. Siljander P.R. Andreu Z. Zavec A.B. Borràs F.E. Buzas E.I. Buzas K. Casal E. Cappello F. Carvalho J. Biological properties of extracellular vesicles and their physiological functions J. Extracell. Vesicles 2015 4 27066 10.3402/jev.v4.27066 25979354 PMC4433489 6. Pegtel D.M. Gould S.J. Exosomes Annu. Rev. Biochem. 2019 88 487 514 10.1146/annurev-biochem-013118-111902 31220978 7. Mir B. Goettsch C. Extracellular Vesicles as Delivery Vehicles of Specific Cellular Cargo Cells 2020 9 1601 10.3390/cells9071601 32630649 PMC7407641 8. Bobrie A. Colombo M. Raposo G. Théry C. Exosome secretion: Molecular mechanisms and roles in immune responses Traffic 2011 12 1659 1668 10.1111/j.1600-0854.2011.01225.x 21645191 9. Huang D. Shen H. Xie F. Hu D. Jin Q. Hu Y. Zhong T. Role of mesenchymal stem cell-derived exosomes in the regeneration of different tissues J. Biol. Eng. 2024 18 36 10.1186/s13036-024-00431-6 38845032 PMC11155050 10. Paskeh M.D.A. Entezari M. Mirzaei S. Zabolian A. Saleki H. Naghdi M.J. Sabet S. Khoshbakht M.A. Hashemi M. Hushmandi K. Emerging role of exosomes in cancer progression and tumor microenvironment remodeling J. Hematol. Oncol. 2022 15 83 10.1186/s13045-022-01305-4 35765040 PMC9238168 11. Pisitkun T. Shen R.F. Knepper M.A. Identification and proteomic profiling of exosomes in human urine Proc. Natl. Acad. Sci. USA 2004 101 13368 13373 10.1073/pnas.0403453101 15326289 PMC516573 12. Keller S. Ridinger J. Rupp A.-K. Janssen J.W.G. Altevogt P. Body fluid derived exosomes as a novel template for clinical diagnostics J. Transl. Med. 2011 9 86 10.1186/1479-5876-9-86 21651777 PMC3118335 13. Caby M.P. Lankar D. Vincendeau-Scherrer C. Raposo G. Bonnerot C. Exosomal-like vesicles are present in human blood plasma Int. Immunol. 2005 17 879 887 10.1093/intimm/dxh267 15908444 14. Li J. Wang A. Guo H. Zheng W. Chen R. Miao C. Zheng D. Peng J. Wang J. Chen Z. Exosomes: Innovative biomarkers leading the charge in non-invasive cancer diagnostics Theranostics 2025 15 5277 5311 10.7150/thno.113650 40303340 PMC12036879 15. Elliott R.O. He M. Unlocking the Power of Exosomes for Crossing Biological Barriers in Drug Delivery Pharmaceutics 2021 13 122 10.3390/pharmaceutics13010122 33477972 PMC7835896 16. Zhang H. Wang S. Sun M. Cui Y. Xing J. Teng L. Xi Z. Yang Z. Exosomes as smart drug delivery vehicles for cancer immunotherapy Front. Immunol. 2022 13 1093607 10.3389/fimmu.2022.1093607 36733388 PMC9888251 17. Konoshenko M.Y. Lekchnov E.A. Vlassov A.V. Laktionov P.P. Isolation of Extracellular Vesicles: General Methodologies and Latest Trends Biomed. Res. Int. 2018 2018 8545347 10.1155/2018/8545347 29662902 PMC5831698 18. Koliha N. Wiencek Y. Heider U. Jüngst C. Kladt N. Krauthäuser S. Johnston I.C. Bosio A. Schauss A. Wild S. A novel multiplex bead-based platform highlights the diversity of extracellular vesicles J. Extracell. Vesicles 2016 5 29975 10.3402/jev.v5.29975 26901056 PMC4762227 19. Boriachek K. Masud M.K. Palma C. Phan H.P. Yamauchi Y. Hossain M.S.A. Nguyen N.T. Salomon C. Shiddiky M.J.A. Avoiding Pre-Isolation Step in Exosome Analysis: Direct Isolation and Sensitive Detection of Exosomes Using Gold-Loaded Nanoporous Ferric Oxide Nanozymes Anal. Chem. 2019 91 3827 3834 10.1021/acs.analchem.8b03619 30735354 20. Fortunato D. Giannoukakos S. Giménez-Capitán A. Hackenberg M. Molina-Vila M.A. Zarovni N. Selective isolation of extracellular vesicles from minimally processed human plasma as a translational strategy for liquid biopsies Biomark. Res. 2022 10 57 10.1186/s40364-022-00404-1 35933395 PMC9357340 21. Sidhom K. Obi P.O. Saleem A. A Review of Exosomal Isolation Methods: Is Size Exclusion Chromatography the Best Option? Int. J. Mol. Sci. 2020 21 6466 10.3390/ijms21186466 32899828 PMC7556044 22. Arbabi Ghahroudi M. Desmyter A. Wyns L. Hamers R. Muyldermans S. Selection and identification of single domain antibody fragments from camel heavy-chain antibodies FEBS Lett. 1997 414 521 526 10.1016/S0014-5793(97)01062-4 9323027 23. Davies J. Riechmann L. Single antibody domains as small recognition units: Design and in vitro antigen selection of camelized, human VH domains with improved protein stability Protein Eng. 1996 9 531 537 10.1093/protein/9.6.531 8862554 24. Pérez J.M.J. Renisio J.G. Prompers J.J. van Platerink C.J. Cambillau C. Darbon H. Frenken L.G.J. Thermal Unfolding of a Llama Antibody Fragment: A Two-State Reversible Process Biochemistry 2001 40 74 83 10.1021/bi0009082 11141058 25. Jovčevska I. Muyldermans S. The Therapeutic Potential of Nanobodies BioDrugs 2020 34 11 26 10.1007/s40259-019-00392-z 31686399 PMC6985073 26. Jin B.K. Odongo S. Radwanska M. Magez S. NANOBODIES ® Int. J. Mol. Sci. 2023 24 5994 10.3390/ijms24065994 36983063 PMC10057852 27. Muyldermans S. Nanobodies: Natural single-domain antibodies Annu. Rev. Biochem. 2013 82 775 797 10.1146/annurev-biochem-063011-092449 23495938 28. Lizama-Muñoz A. Plaza-Diaz J. Bispecific Antibodies, Nanobodies and Extracellular Vesicles: Present and Future to Cancer Target Therapy Biomolecules 2025 15 639 10.3390/biom15050639 40427532 PMC12109199 29. Yan J. Wang P. Zhu M. Li G. Romão E. Xiong S. Wan Y. Characterization and applications of Nanobodies against human procalcitonin selected from a novel naïve Nanobody phage display library J. Nanobiotechnol. 2015 13 33 10.1186/s12951-015-0091-7 PMC4475299 25944262 30. Popovic M. Mazzega E. Toffoletto B. de Marco A. Isolation of anti-extra-cellular vesicle single-domain antibodies by direct panning on vesicle-enriched fractions Microb. Cell Factories 2018 17 6 10.1186/s12934-017-0856-9 PMC5766977 29331148 31. Filipović L. Spasojević M. Prodanović R. Korać A. Matijaševic S. Brajušković G. de Marco A. Popović M. Affinity-based isolation of extracellular vesicles by means of single-domain antibodies bound to macroporous methacrylate-based copolymer N. Biotechnol. 2022 69 36 48 10.1016/j.nbt.2022.03.001 35301156 32. Filipović L. Spasojević Savković M. Prodanović R. Matijašević Joković S. Stevanović S. Marco A.d. Kosanović M. Brajušković G. Popović M. Urinary Extracellular Vesicles as a Readily Available Biomarker Source: A Simplified Stratification Method Int. J. Mol. Sci. 2024 25 8004 10.3390/ijms25158004 39125575 PMC11311997 33. Jumper J. Evans R. Pritzel A. Green T. Figurnov M. Ronneberger O. Tunyasuvunakool K. Bates R. Žídek A. Potapenko A. Highly accurate protein structure prediction with AlphaFold Nature 2021 596 583 589 10.1038/s41586-021-03819-2 34265844 PMC8371605 34. Williams C.J. Headd J.J. Moriarty N.W. Prisant M.G. Videau L.L. Deis L.N. Verma V. Keedy D.A. Hintze B.J. Chen V.B. MolProbity: More and better reference data for improved all-atom structure validation Protein Sci. 2018 27 293 315 10.1002/pro.3330 29067766 PMC5734394 35. Baranyai T. Herczeg K. Onódi Z. Voszka I. Módos K. Marton N. Nagy G. Mäger I. Wood M. Andaloussi S. Isolation of Exosomes from Blood Plasma: Qualitative and Quantitative Comparison of Ultracentrifugation and Size Exclusion Chromatography Methods PLoS ONE 2015 10 e0145686 10.1371/journal.pone.0145686 26690353 PMC4686892 36. Barth A. Infrared spectroscopy of proteins Biochim. Biophys. Acta (BBA)-Bioenerg. 2007 1767 1073 1101 10.1016/j.bbabio.2007.06.004 17692815 37. Abdelrazzak A.B. Hezma A.M. El-Bahy G.S. ATR-FTIR spectroscopy probing of structural alterations in the cellular membrane of abscopal liver cells Biochim. Biophys. Acta Biomembr. 2021 1863 183726 10.1016/j.bbamem.2021.183726 34375629 38. Irmer B. Chandrabalan S. Maas L. Bleckmann A. Menck K. Extracellular Vesicles in Liquid Biopsies as Biomarkers for Solid Tumors Cancers 2023 15 1307 10.3390/cancers15041307 36831648 PMC9953862 39. He D. Cui B. Lv H. Lu S. Zhu Y. Cheng Y. Dang L. Zhang H. Blood-Derived Extracellular Vesicles as a Promising Liquid Biopsy Diagnostic Tool for Early Cancer Detection Biomolecules 2024 14 847 10.3390/biom14070847 39062561 PMC11275243 40. Johnsen K.B. Gudbergsson J.M. Andresen T.L. Simonsen J.B. What is the blood concentration of extracellular vesicles? Implications for the use of extracellular vesicles as blood-borne biomarkers of cancer Biochim. Biophys. Acta (BBA)-Rev. Cancer 2019 1871 109 116 10.1016/j.bbcan.2018.11.006 30528756 41. Sódar B.W. Kittel Á. Pálóczi K. Vukman K.V. Osteikoetxea X. Szabó-Taylor K. Németh A. Sperlágh B. Baranyai T. Giricz Z. Low-density lipoprotein mimics blood plasma-derived exosomes and microvesicles during isolation and detection Sci. Rep. 2016 6 24316 10.1038/srep24316 27087061 PMC4834552 42. Tauro B.J. Greening D.W. Mathias R.A. Mathivanan S. Ji H. Simpson R.J. Two distinct populations of exosomes are released from LIM1863 colon carcinoma cell-derived organoids Mol. Cell Proteom. 2013 12 587 598 10.1074/mcp.M112.021303 23230278 PMC3591653 43. Wubbolts R. Leckie R.S. Veenhuizen P.T. Schwarzmann G. Möbius W. Hoernschemeyer J. Slot J.W. Geuze H.J. Stoorvogel W. Proteomic and biochemical analyses of human B cell-derived exosomes. Potential implications for their function and multivesicular body formation J. Biol. Chem. 2003 278 10963 10972 10.1074/jbc.M207550200 12519789 44. Clayton A. Court J. Navabi H. Adams M. Mason M.D. Hobot J.A. Newman G.R. Jasani B. Analysis of antigen presenting cell derived exosomes, based on immuno-magnetic isolation and flow cytometry J. Immunol. Methods 2001 247 163 174 10.1016/S0022-1759(00)00321-5 11150547 45. Alexander E. Leong K.W. Discovery of nanobodies: A comprehensive review of their applications and potential over the past five years J. Nanobiotechnol. 2024 22 661 10.1186/s12951-024-02900-y PMC11515141 39455963 46. Mei Y. Chen Y. Sivaccumar J.P. An Z. Xia N. Luo W. Research progress and applications of nanobody in human infectious diseases Front. Pharmacol. 2022 13 963978 10.3389/fphar.2022.963978 36034845 PMC9411660 47. Cheng X. Wang J. Kang G. Hu M. Yuan B. Zhang Y. Huang H. Homology Modeling-Based in Silico Affinity Maturation Improves the Affinity of a Nanobody Int. J. Mol. Sci. 2019 20 4187 10.3390/ijms20174187 31461846 PMC6747709 48. Wang X. Chen Q. Sun Z. Wang Y. Su B. Zhang C. Cao H. Liu X. Nanobody affinity improvement: Directed evolution of the anti-ochratoxin A single domain antibody Int. J. Biol. Macromol. 2020 151 312 321 10.1016/j.ijbiomac.2020.02.180 32084462 49. Poustforoosh A. Faramarz S. Negahdaripour M. Hashemipour H. Modeling and affinity maturation of an anti-CD20 nanobody: A comprehensive in-silico investigation Sci. Rep. 2023 13 582 10.1038/s41598-023-27926-4 36631511 PMC9834265 50. Monegal A. Ami D. Martinelli C. Huang H. Aliprandi M. Capasso P. Francavilla C. Ossolengo G. de Marco A. Immunological applications of single-domain llama recombinant antibodies isolated from a naïve library Protein Eng. Des. Sel. 2009 22 273 280 10.1093/protein/gzp002 19196718 51. Moreno E. Valdés-Tresanco M.S. Molina-Zapata A. Sánchez-Ramos O. Structure-based design and construction of a synthetic phage display nanobody library BMC Res. Notes 2022 15 124 10.1186/s13104-022-06001-7 35351202 PMC8966178 52. Goldman E.R. Anderson G.P. Liu J.L. Delehanty J.B. Sherwood L.J. Osborn L.E. Cummins L.B. Hayhurst A. Facile Generation of Heat-Stable Antiviral and Antitoxin Single Domain Antibodies from a Semisynthetic Llama Library Anal. Chem. 2006 78 8245 8255 10.1021/ac0610053 17165813 PMC2528076 53. Jankovičová J. Sečová P. Michalková K. Tetraspanins J.A. More than Markers of Extracellular Vesicles in Reproduction Int. J. Mol. Sci. 2020 21 7568 10.3390/ijms21207568 33066349 PMC7589920 54. Ma Y. Zhang X. Liu C. Zhao Y. Extracellular vesicles in cancers: Mechanisms, biomarkers, and therapeutic strategies MedComm (2020) 2024 5 e70009 10.1002/mco2.70009 39611045 PMC11604295 55. Vincke C. Muyldermans S. Introduction to heavy chain antibodies and derived Nanobodies Methods Mol. Biol. 2012 911 15 26 10.1007/978-1-61779-968-6_2 22886243 56. Ruffolo J.A. Sulam J. Gray J.J. Antibody structure prediction using interpretable deep learning Patterns 2022 3 100406 10.1016/j.patter.2021.100406 35199061 PMC8848015 57. Brennan K. Martin K. FitzGerald S.P. O’Sullivan J. Wu Y. Blanco A. Richardson C. Mc Gee M.M. A comparison of methods for the isolation and separation of extracellular vesicles from protein and lipid particles in human serum Sci. Rep. 2020 10 1039 10.1038/s41598-020-57497-7 31974468 PMC6978318 58. Robinson S.D. Samuels M. Jones W. Stewart N. Eravci M. Mazarakis N.K. Gilbert D. Critchley G. Giamas G. Confirming size-exclusion chromatography as a clinically relevant extracellular vesicles separation method from 1mL plasma through a comprehensive comparison of methods BMC Methods 2024 1 7 10.1186/s44330-024-00007-2 59. Gámez-Valero A. Monguió-Tortajada M. Carreras-Planella L. Franquesa M.l. Beyer K. Borràs F.E. Size-Exclusion Chromatography-based isolation minimally alters Extracellular Vesicles’ characteristics compared to precipitating agents Sci. Rep. 2016 6 33641 10.1038/srep33641 27640641 PMC5027519 60. Benedikter B.J. Bouwman F.G. Vajen T. Heinzmann A.C.A. Grauls G. Mariman E.C. Wouters E.F.M. Savelkoul P.H. Lopez-Iglesias C. Koenen R.R. Ultrafiltration combined with size exclusion chromatography efficiently isolates extracellular vesicles from cell culture media for compositional and functional studies Sci. Rep. 2017 7 15297 10.1038/s41598-017-15717-7 29127410 PMC5681555 61. Clos-Sansalvador M. Monguió-Tortajada M. Roura S. Franquesa M. Borràs F.E. Commonly used methods for extracellular vesicles’ enrichment: Implications in downstream analyses and use Eur. J. Cell Biol. 2022 101 151227 10.1016/j.ejcb.2022.151227 35460958 62. Aliprandi M. Sparacio E. Pivetta F. Ossolengo G. Maestro R. de Marco A. The availability of a recombinant anti-SNAP antibody in VHH format amplifies the application flexibility of SNAP-tagged proteins J. Biomed. Biotechnol. 2010 2010 658954 10.1155/2010/658954 20981296 PMC2963136 63. Drożdż A. Kamińska A. Surman M. Gonet-Surówka A. Jach R. Huras H. Przybyło M. Stępień E.Ł. Low-Vacuum Filtration as an Alternative Extracellular Vesicle Concentration Method: A Comparison with Ultracentrifugation and Differential Centrifugation Pharmaceutics 2020 12 872 10.3390/pharmaceutics12090872 32933147 PMC7558926 64. Szentirmai V. Wacha A. Németh C. Kitka D. Rácz A. Héberger K. Mihály J. Varga Z. Reagent-free total protein quantification of intact extracellular vesicles by attenuated total reflection Fourier transform infrared (ATR-FTIR) spectroscopy Anal. Bioanal. Chem. 2020 412 4619 4628 10.1007/s00216-020-02711-8 32472144 PMC7329771 65. Mihály J. Deák R. Szigyártó I.C. Bóta A. Beke-Somfai T. Varga Z. Characterization of extracellular vesicles by IR spectroscopy: Fast and simple classification based on amide and CH stretching vibrations Biochim. Biophys. Acta (BBA)-Biomembr. 2017 1859 459 466 10.1016/j.bbamem.2016.12.005 27989744 66. Mishra A. Zehra S. Bharti P.K. Mathur S.R. Ranjan P. Batra A. Inampudi K.K. Modi G.P. Nikolajeff F. Kumar S. Spectroscopic insight into breast cancer: Profiling small extracellular vesicles lipids via infrared spectroscopy for diagnostic precision Sci. Rep. 2024 14 9347 10.1038/s41598-024-59863-1 38654096 PMC11039614 67. Zlotogorski-Hurvitz A. Dekel B.Z. Malonek D. Yahalom R. Vered M. FTIR-based spectrum of salivary exosomes coupled with computational-aided discriminating analysis in the diagnosis of oral cancer J. Cancer Res. Clin. Oncol. 2019 145 685 694 10.1007/s00432-018-02827-6 30603907 PMC11810221 68. Zini J. Saari H. Ciana P. Viitala T. Lõhmus A. Saarinen J. Yliperttula M. Infrared and Raman spectroscopy for purity assessment of extracellular vesicles Eur. J. Pharm. Sci. 2022 172 106135 10.1016/j.ejps.2022.106135 35121019 69. Lefranc M.-P. Pommié C. Ruiz M. Giudicelli V. Foulquier E. Truong L. Thouvenin-Contet V. Lefranc G. IMGT unique numbering for immunoglobulin and T cell receptor variable domains and Ig superfamily V-like domains Dev. Comp. Immunol. 2003 27 55 77 10.1016/S0145-305X(02)00039-3 12477501 70. Ehrenmann F. Kaas Q. Lefranc M.-P. IMGT/3Dstructure-DB and IMGT/DomainGapAlign: A database and a tool for immunoglobulins or antibodies, T cell receptors, MHC, IgSF and MhcSF Nucleic Acids Res. 2009 38 D301 D307 10.1093/nar/gkp946 19900967 PMC2808948 71. Ehrenmann F. Lefranc M.P. IMGT/DomainGapAlign: IMGT standardized analysis of amino acid sequences of variable, constant, and groove domains (IG, TR, MH, IgSF, MhSF) Cold Spring Harb. Protoc. 2011 2011 737 749 10.1101/pdb.prot5636 21632775 72. Laemmli U.K. Cleavage of structural proteins during the assembly of the head of bacteriophage T4 Nature 1970 227 680 685 10.1038/227680a0 5432063 73. Bradford M.M. A rapid and sensitive method for the quantitation of microgram quantities of protein utilizing the principle of protein-dye binding Anal. Biochem. 1976 72 248 254 10.1016/0003-2697(76)90527-3 942051 74. Osteikoetxea X. Balogh A. Szabó-Taylor K. Németh A. Szabó T.G. Pálóczi K. Sódar B. Kittel Á. György B. Pállinger É. Improved characterization of EV preparations based on protein to lipid ratio and lipid properties PLoS ONE 2015 10 e0121184 10.1371/journal.pone.0121184 25798862 PMC4370721 Figure 1 Phage-ELISA of clones selected by panning was performed to confirm their specific binding to EV-enriched fractions recovered from SKBR3 and HEK293 cells. Assay microplates were coated with EV-enriched samples (0.1 μg/well of protein) and bound phages were detected with HRP-labeled anti-M13 antibodies. An irrelevant phage-displayed nanobody was used as a negative control. ( A B p Figure 2 Multiple sequence alignment for protein variants NA8 , 1 2 Figure 3 Predicted structures of nanobodies NA8 ( A 1 B 2 C Figure 4 SDS-PAGE analysis of purified VHH-eGFP constructs. Three different constructs (NA8-eGFP, ND10 1 2 E. coli Figure 5 Size distribution of EVs isolates. Dual y axis representation indicates that all EV isolates exhibit similar size distributions with the expected range of EVs. ND10 1 Figure 6 SDS-PAGE protein profiles of isolated EV. Equal volumes (25 uL) of each EV isolate were loaded into the wells. Figure 7 Detection of surface markers in EVs isolated with NA8 ( A 1 B 2 C p p p p p Figure 8 ATR-FTIR spectra of EVs isolated with NA8, ND10 1 2 A B Figure 9 SEM analysis of EVs isolated with affinity-approach based on NA8 ( A 1 B 2 C Figure 10 AFM analysis of EVs isolated with ND10 1 A B C D molecules-30-03677-t001_Table 1 Table 1 Sequences of CDR Loops of NA8, ND10 1 2 Nanobody CDR1 CDR2 CDR3  NA8 GVTLGNYV YRRSHGNK ALTMSRPILSSLPDRSIYDY  ND10 1 GRTFSV ISRTLGRT AVRSSGFYGQVPRVGESYDY  ND10 2 GRTSDIYR ITSGGST AADRHYSTNYYSERVYDY molecules-30-03677-t002_Table 2 Table 2 NTA of EV isolated with three different nanobodies.  Median Diameter (nm) Total Yield (Particles)  NA8-EVs 138.1 ± 2 4.57 × 10 9  ND10 1 137.3 ± 3 1.27 × 10 9  ND10 2 134.6 ± 1 2.37 × 10 9 molecules-30-03677-t003_Table 3 Table 3 Quantification of total proteins and lipids in EVs isolates. Values with different letters are significantly different.  Protein Yield (mg) Lipid Yield (mg) P/L Ratio  NA8-EVs 0.357 ± 0.010 a 0.132 ± 0.006 d 2.740 ± 0.074 f  ND10 1 0.429 ± 0.007 b 0.101 ± 0.031 d 4.248 ± 0.323 g  ND10 2 0.388 ± 0.011 c 0.153 ± 0.019 d 2.536 ± 0.153 f ",
  "metadata": {
    "Title of this paper": "Improved characterization of EV preparations based on protein to lipid ratio and lipid properties",
    "Journal it was published in:": "Molecules",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12472977/"
  }
}