{
  "title": "Paper_867",
  "abstract": "pmc Sci Rep Sci Rep 1579 scirep Scientific Reports 2045-2322 Nature Publishing Group PMC12475396 PMC12475396.1 12475396 12475396 41006713 10.1038/s41598-025-18430-y 18430 1 Article Exploring PKMYT1 as a potential marker for colorectal cancer progression through bioinformatics analyses and experimental validation Zhang Yuqiang 1 2 Chang Yingwei 3 Hu Yaorui 4 Ding Zhichao 5 Zhang Zhihui 2 Wei Yanbei 4 Liu Ben 2 Yang Minghao 6 Chen Wei chenweixjtu2014@126.com 1 1 https://ror.org/02tbvhh96 grid.452438.c 0000 0004 1760 8119 Department of Laboratory Medicine, The First Affiliated Hospital of Xi’an Jiaotong University, 2 https://ror.org/00gn3nj37 grid.452240.5 0000 0004 8342 6962 Department of Clinical Laboratory, Yantai Affiliated Hospital of Binzhou Medical University, 3 4 https://ror.org/008w1vb37 grid.440653.0 0000 0000 9588 091X Institute of Neurobiology, Binzhou Medical University, 5 https://ror.org/008w1vb37 grid.440653.0 0000 0000 9588 091X The Second Medical College of Binzhou Medical University, Binzhou Medical University, 6 https://ror.org/00gn3nj37 grid.452240.5 0000 0004 8342 6962 Department of Radiology, Yantai Affiliated Hospital of Binzhou Medical Universtiy, 26 9 2025 2025 15 478255 33016 15 2 2025 1 9 2025 26 09 2025 28 09 2025 29 09 2025 © The Author(s) 2025 2025 https://creativecommons.org/licenses/by-nc-nd/4.0/ Open Access http://creativecommons.org/licenses/by-nc-nd/4.0/ Colorectal cancer (CRC) is a malignant tumor with high morbidity and mortality rates worldwide and only presents symptoms in later stage; no ideal biomarker is available for the early diagnosis of CRC. Therefore, it is important to explore novel molecules that significantly contribute to CRC progression. The cohort contains different stages of CRC were downloaded and comprehensive bioinformatics analyses were performed by Mfuzz, Protein–Protein Interaction (PPI), MCODE, ESTIMATE, and ssGSEA.The results revealed that Protein Kinase, Membrane Associated Tyrosine/Threonine 1 (PKMYT1) served as a functional hub gene and its high expression might be associated with an immunosuppressive microenvironment, therapeutic sensitivity and tumor progression. PKMYT1-related genes are linked to DNA replication, the cell cycle, and mismatch repair, indicating PKMYT1 functions as an oncogene and potential biomarker in CRC development. Moreover, in vitro experimental investigation was conducted and the data found that CRC tumor tissues and cells have elevated PKMYT1 expression. Knockdown of PKMYT1 by siRNAs significantly impaired the proliferation, cell cycling, migration, and invasion of CRC cells. In summary, this study demonstrated that PKMYT1 may be a promising target for therapeutic intervention and play a significant role in the development of CRC. Supplementary Information The online version contains supplementary material available at 10.1038/s41598-025-18430-y. Keywords CRC PKMYT1 Bioinformatics analysis Proliferation Subject terms Cancer Cell biology Biomarkers Oncology Medical and Health Science and Technology Development Project of Shandong Provincial 2019WS341 Zhang Yuqiang Shandong Province Traditional Chinese Medicine Science and Technology Project M20244202 Zhang Yuqiang pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement yes pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes issue-copyright-statement © Springer Nature Limited 2025 Introduction Since 2020, Colorectal cancer (CRC) is the second most common cause of cancer and the fourth cause of cancer death in China 1 2 3 4 A polyp is frequently the initial cause of colorectal cancer. Over the course of an estimated 10–15 years, this process begins with an aberrant crypt, then progresses to a neoplastic precursor lesion (a polyp), and finally leads to CRC. Therefore, identifying the potential biomarkers and regulators that contribute to the transition from polyp to CRC is significant for finding possible therapeutic drugs and preventative treatments of CRC 5 Myt1 is an evolutionarily conserved protein kinase that is encoded by PKMYT1 6 7 8 9 10 12 13 14 15 6 9 Methods Data collection and processing The Cancer Genome Atlas (TCGA) provided the colorectal adenocarcinoma (COAD) stage and RNA sequencing data. Colon sample RNA sequencing and stage data representing various stages of colorectal cancer progression were obtained from GSE207949 The STRING database analysis STRING is a popular online database for constructing protein–protein interaction (PPI) networks and assigning scores to interactions between target proteins 16 Assessment of infiltration within the tumor microenvironment The relative abundances of 24 immune cell types were assessed using single-sample gene set enrichment analysis (ssGSEA) using the GSVA R package 17 18 19 Forecasting the response to immunotherapy The response of immunotherapy was assessed using the Tumor Immune Dysfunction and Exclusion (TIDE) method 20 21 Chemotherapeutic sensitivity To assess chemosensitivity in relation to high and low levels of PKMYT1, we utilized the pRRophetic, which could calculate the half-maximal inhibitory concentration (IC 50 22 Enrichment analysis GSE39582 https://www.linkedomics.org/login.php 23 https://www.bioinformatics.com.cn/ 24 25 Clinical specimen collection Three human CRC samples were taken from the Yantai Affiliated Hospital of Binzhou Medical University in China, together with the epithelial tissues that surround them. The pathological diagnosis of CRC was confirmed by a minimum of two expert pathologists. All individuals who donated tissues for this study provided written informed consent. This experiment was conducted in accordance with guidelines established by the Ethics Committee of Binzhou Medical University’s for Biology and Medical Science and the ethics approval number is #20240120045. Immunohistochemical staining assay 5 µm thick sections were prepared from surgical specimens of CRC patients. To recover epitopes, the sections were autoclaved at 100 °C for 10 min after being deparaffinized and dehydrated. After that, a 10 mM sodium citrate buffer (pH 6.0) was applied to them. They were then exposed to 3% hydrogen peroxide for ten minutes in order to inhibit endogenous peroxidase activity (ZSGB-BIO, Cat.PV-9001). After being blocked with appropriate solutions, the sections were exposed to an anti-PKMYT1 antibody diluted to 1:200 (ELK Biotechnology, Cat.ES2884) at 4 °C overnight. Antibody binding was visualized using DAB (ZSGB-BIO, Cat.ZLI-9018). Finally, sections were counterstained with hematoxylin prior to dehydration and mounting. The slides were photographed by the biological microscope (Olympus, Japan). Cell culture and transfection NCM460 (Cat.T9186), HCT116 (Cat.T1027), and RKO (Cat.T9930) cells were purchased from the Applied Biological Materials Incorporated (ABM Inc., jiangsu, China). RKO cells were cultured in MEM (Procell, Cat. PM150414) with 1% penicillin–streptomycin (MeilunBio, Cat. MA0110) and 10% fetal bovine serum (FBS, Procell, Cat.164210-50) added as supplements. The remaining cells were kept in DMEM (Procell, Cat.PM150210) supplemented with 1% penicillin–streptomycin and 10% FBS. The negative control siRNA and PKMYT1 siRNA were sourced from OBiO Technology (Obio Technology, Shanghai, China). The sequences of siRNAs were: siPKMYT1-1 (sense: GGUAAAGCGUUCCAUGUCATT; anti-sense: UGACAUGGAACGCUUUACCTT), siPKMYT1-2 (sense: CCUACGGAGAGGUCUUCAATT, anti-sense: UUGAAGACCUCUCCGUAGGTT), siPKMYT1-3 (sense: CGAGCUGCGUUCUGUCCUUTT, anti-sense: AAGGACAGAACGCAGCUCGTT). Using Lipofectamine 2000 (ThermoFisher Scientific, Cat.11668019), 5 nmol of NC and siRNA were added to HCT116 and RKO cells for a duration of 6 h. The effectiveness of the silencing was verified by Western blot analysis and qPCR 48 h after transfection. RNA isolation and quantitative PCR (qPCR) To determine the mRNA expression levels of PKMYT1, total RNA was extracted from HCT116 and RKO cells 48 h after transfection using FreeZol Reagent (Vazyme, Cat. R711), as directed by the manufacturer. ThermoFisher Scientific’s NanoDropTM 2000 spectrophotometer was used to measure the amount of RNA present. Following the manufacturer’s instructions, HiScript II Reverse Transcriptase (Vazyme, Cat. R223) was used to create cDNA from total RNA. The QuantStudio™ 3 system (ThermoFisher Scientific) and ChamQ SYBR qPCR Master Mix (Vazyme, Cat.Q311) were used for qPCR. Actin was utilized as the reference gene for normalization. The relative expression levels of the gene were determined via qPCR and analyzed using the 2 −ΔΔCT Western blot Proteins from CRC cells were isolated from the cell lysate with RIPA buffer (MeilunBio, Cat.MA0151). An equivalent amount of protein was put onto a 10% SDS-PAGE gel, and it was subsequently transferred to PVDF membranes (Millipore, Cat.IPVH0010). After that, primary antibodies against PKMYT1 (1:500) and GAPDH (1:1000) were incubated with the membranes at 4 °C for overnight. Following that, they were underwent thrice wash with TBST buffer for 10 min each time. The membranes were then incubated with secondary antibodies for an hour at room temperature. The bands were visualized using chemiluminescence. The relative protein levels in different groups were quantified by gray intensity of indicated bands with image J, the control group of two cells were normalized to 1. Cell viability assay The Cell Counting Kit-8 (KeyGen Biotech, Cat.KGA9310-500) was used to measure cell viability. Following transfection, 96-well plates were seeded with 2000 cells of the RKO and HCT116 cell lines, respectively. 10µL of the CCK-8 solution was added to each well at 0, 12, 24, 48, and 72 h in accordance with the manufacturer’s instructions, and the wells were subsequently incubated for 30 min. Absorbance at a wavelength of 450 nm (nm) were measured after incubation using a microplate reader (BioTek, America). Colony formation assay Cells in the logarithmic growth phase were pre-transfected with siPKMYT1 #1 or negative control (NC), and they were then plated on 6-well plates at the density of 600 cells/well. After 14 days of incubation, the cells were fixed with 75% ethanol for 30 min, then stained with 0.2% crystal violet. After sufficiently washing, each well’s colonies were captured, and counted by Image J software. Flow cytometry assay Cell cycle monitoring was conducted using Cell cycle staining buffer (Muti Science, Cat. CCS01) according to the manufacturers’ instruction. The data were analyzed with ModFit LT 5 software. Wound healing assay After plating HCT116 and RKO cells (1 × 10^4) in 6-well plates and transfecting them for 48 h, they were cultured in serum-free media until they achieved 85–90% confluence. To create wound gaps, the cell layers were scratched with a 100 µL RNase-free pipette tip. Images of the wound gaps were captured at three times (0 h, 24 h, and 48 h) using a light microscope at × 10 magnification. Transwell assay Transwell chamber (Corning, Cat.3422) with 24 wells was utilized to examine cell migration and invasion. 5 × 10^4 cells suspended in total 200 μL serum-free medium was seeded in apical chambers pre-packaged with or without Matrigel Matrix (Corning, Cat.356230) for migration or invasion monitoring, respectively, while the lower compartment was filled with 800 μL complete culture medium that had been supplemented with 10% FBS. After incubating for 48 h, any remaining cells in the upper chamber that had not migrated were removed, cells that migrated through the pores were fixed with methanol for 10 min and stained with 0.1% crystal violet. The images were captured and the number of cells were quantified using an inverted microscope (Olympus, Japan) at a × 20 magnifying lens. Statistical analysis For datasets with a normal distribution, the mean ± SD is used to convey quantitative data; for datasets with skews, the median with interquartile range is used. The t-test was used for regularly distributed data in order to compare quantitative data in two groups. All data analyses were conducted using SPSS and RStudio. Results PKMYT1 is a hub gene of CRC progression To search for the hub gene involved in CRC progression, we downloaded the transcriptome profiling data containing of 41 normal and 458 COAD tumor samples from the TCGA database. Furthermore, 24 colon samples, which include 5 Mucosae, 13 polyps, and 6 adenocarcinomas, representing different stages of CRC, were downloaded from GSE207949 1 GSE207949 1 1 26 27 28 29 30 Fig. 1 PKMYT1 is a hub gene of CRC progression. Mfuzz analysis based on the transcriptome data from CRC samples in TCGA ( A GSE207949 B C GSE207949 D The expression level of PKMYT1 was linked to the tumor microenvironment of CRC As immunotherapy has been applied in CRC treatment, we then performed the ESTIMATE and ssGSEA algorithms to examine the connection between PKMYT1 expression and the tumor microenvironment in CRC. Our results showed that the group with higher expression of PKMYT1 had a higher tumor purity rate than the group with lower PKMYT1. The tumor with higher expression of PKMYT1 get lower scores on immune, stromal, and ESTIMATE evaluation, and there was statistically significance between the two groups (Fig. 2 2 1 Fig. 2 Bioinformatics analyses revealed that PKMYT1 expression might be associated with immunotherapic, chemotherapeutic efficiency of patients with CRC, and PKMYT1 might participant with signaling pathways in CRC. ( A B C D E F P P P Table1 The list of immune cells was associated with PKMYT1 expression in CRC. Cell type Immune cells P Adaptive immune cells regulatory T cells P immature B cells P T follicular helper cells P type 1 T helper cells P type 2 T helper cells P γδT cells P effector memory CD4 T cells P central memory CD8 T cells P activated B cells P T follicular helper cells P Innate immune cells Eosinophils P macrophages P myeloid-derived suppressor cells (MDSC) P immature dendritic cells P natural killer cells P mast cells P plasmacytoid dendritic cells P Relationship between PKMYT1 expression and responses to immunotherapy/chemotherapy sensitivity To evaluate the expression levels of PKMYT1 in predicting the immunotherapy response in patients with CRC, we computed the TIDE score using the TIDE software based on data from the GSE39582 2 50 2 Enrichment analysis of PKMYT1 in CRC Our aforementioned results indicated that PKMYT1 might be potential effector for therapeutic sensitivity and progression of CRC, we next used ssGSEA based on profile of GSE39582 2 2 https://www.linkedomics.org/login.php 23 31 38 PKMYT1 expression was much higher in CRC tissues and cells According to the data of bioinformatics analysis, the expression of PKMYT1 was upregulated in the progression of CRC (Fig. 1 3 3 Fig. 3 PKMYT1 maintained the cell proliferation of CRC in vitro. ( A B C D E F G P P P H PKMYT1 knockdown inhibited the proliferation of CRC cells To investigate the biological roles of PKMYT1 in the CRC, HCT116 and RKO cells were chosen to perform PKMYT1 knockdown by transfection of three specific siRNAs (siPKMYT1-1, siPKMYT1-2, and siPKMYT1-3). qPCR and western blot confirmed that PKMYT1 was knocked down in transfected RKO and HCT116 cells (Fig. 3 3 3 G 3 PKMYT1 maintained the migration and invasion of CRC cells Transwell and wound healing tests were conducted to assess the impact of PKMYT1 on the invasion and migration of CRC cells. The results of the wound healing assay showed that PKMYT1 knockdown significantly postponed wound closure (Fig. 4 4 Fig. 4 PKMYT1 promotes the migration and invasion of CRC cells in vitro. ( A B C P Discussion CRC is the second prevalent cancer in women and the third common carcinoma in males. Compared to men, women have almost 25% lower incidence and mortality rates. CRC usually goes through the process of \"normal mucosa-mucosal epithelial hyperplasia-adenomatous polyps-colorectal cancer,\" which generally lasts for 5–10 years 39 40 41 In the research, we identified PKMYT1, a WEE kinase family member, has emerged as a viable therapeutic option with significance in a variety of tumor types 42 43 GSE207949 3 44 45 46 47 50 To reveal the mechanism regulated by PKMYT1, we carried out an enrichment analysis of the genes linked to PKMYT1, results discovered that PKMYT1 might affect the cell cycle, DNA replication, and other cellular processes connected to tumor growth. And the cell cycle monitoring showed that PKMYT1 knockdown reduced the subpopulation of S and G2/M stages of cells, indicating siPKMYT1 induced cell cycle arrest and a decreased DNA replication. This implies that PKMYT1 contributes to tumor cell proliferation 48 49 31 35 36 38 Next, we validated the role of PKMYT1 on migrative and invasive activity of CRC cells using transwell and wound healing assays. The silencing of PKMYT1 expression significantly repressed the invasion and migration of tumor cells, the potential mechanism might be that PKMYT1 could participate in TGF-β and focal adhesion signaling pathways based on our KEGG enrichment analysis, TGF-β signaling is closely associated with epithelial-mesenchymal transition, metastasis and drug-resistence of cancer cells 50 51 26 43 52 Conclusion In conclusion, we discovered PKMYT1 to be a crucial gene implicated in the development and spread of colorectal cancer through comprehensive bioinformatics analysis, and we also validated its role in proliferation and invasion of CRC through experimental methods. As the selective inhibitors of PKMYT1 have been approved for clinical trials, PKMYT1 might be a novel target and basis for the early diagnosis and therapy of CRC. Supplementary Information Below is the link to the electronic supplementary material.  Supplementary Material 1  Supplementary Material 2  Supplementary Material 3 Publisher’s note Springer Nature remains neutral with regard to jurisdictional claims in published maps and institutional affiliations. Author contributions YQZ and WC: Conception and design. YQZ, YWC, YRH, ZCD and YBW: Experimentation and data analysis and interpretation. ZHZ, YQZ, BL and MHY: Drafting the paper, WC: Experiment supervision. All authors contributed to the article. Funding Medical and Health Science and Technology Development Project of Shandong Provincial (2019WS341), Shandong Province Traditional Chinese Medicine Science and Technology Project (M20244202). Data availability The datasets generated and/or analysed during the current study are available in the Figshare ( https://figshare.com/ Declarations Ethics approval and consent to participate Following the Declaration of Helsinki’s criteria, all clinical samples were collected from Binzhou Medical University’s Yantai Affiliated Hospital and acquired with the patients’ informed consent. The research ethics committee of Binzhou Medical University’s Yantai Affiliated Hospital examined and approved the study, and the ethics approval number was #20240120045. Competing interests The authors declare no competing interests. References 1. Wang W Mortality and years of life lost of colorectal cancer in China, 2005–2020: findings from the national mortality surveillance system Chin. Med. J. (Engl.) 2021 134 1933 1940 10.1097/cm9.0000000000001625 34267069 PMC8382386 W Wang 2021 Mortality and years of life lost of colorectal cancer in China, 2005–2020: findings from the national mortality surveillance system Chin. Med. J. (Engl.) 134 1933 1940 10.1097/cm9.0000000000001625 34267069 10.1097/CM9.0000000000001625 PMC8382386 2. Chen K The epigenetic downregulation of LncGHRLOS mediated by RNA m6A methylase ZCCHC4 promotes colorectal cancer tumorigenesis J. Exp. Clin. Cancer Res. 2024 43 44 10.1186/s13046-024-02965-5 38326863 PMC10848513 K Chen 2024 The epigenetic downregulation of LncGHRLOS mediated by RNA m6A methylase ZCCHC4 promotes colorectal cancer tumorigenesis J. Exp. Clin. Cancer Res. 43 44 10.1186/s13046-024-02965-5 38326863 10.1186/s13046-024-02965-5 PMC10848513 3. Biller LH Schrag D Diagnosis and treatment of metastatic colorectal cancer: A review JAMA 2021 325 669 685 10.1001/jama.2021.0106 33591350 LH Biller D Schrag 2021 Diagnosis and treatment of metastatic colorectal cancer: A review JAMA 325 669 685 10.1001/jama.2021.0106 33591350 10.1001/jama.2021.0106 4. Yang L Yang J Kleppe A Danielsen HE Kerr DJ Personalizing adjuvant therapy for patients with colorectal cancer Nat. Rev. Clin. Oncol. 2024 21 67 79 10.1038/s41571-023-00834-2 38001356 L Yang J Yang A Kleppe HE Danielsen DJ Kerr 2024 Personalizing adjuvant therapy for patients with colorectal cancer Nat. Rev. Clin. Oncol. 21 67 79 10.1038/s41571-023-00834-2 38001356 10.1038/s41571-023-00834-2 5. Dekker E Tanis PJ Vleugels JLA Kasi PM Wallace MB Colorectal cancer Lancet 2019 394 1467 1480 10.1016/S0140-6736(19)32319-0 31631858 E Dekker PJ Tanis JLA Vleugels PM Kasi MB Wallace 2019 Colorectal cancer Lancet 394 1467 1480 10.1016/S0140-6736(19)32319-0 31631858 10.1016/S0140-6736(19)32319-0 6. Lewis CW Upregulation of Myt1 promotes acquired resistance of cancer cells to Wee1 inhibition Cancer Res. 2019 79 5971 5985 10.1158/0008-5472.Can-19-1961 31594837 CW Lewis 2019 Upregulation of Myt1 promotes acquired resistance of cancer cells to Wee1 inhibition Cancer Res. 79 5971 5985 10.1158/0008-5472.Can-19-1961 31594837 10.1158/0008-5472.CAN-19-1961 7. Najjar A Computer-aided design, synthesis and biological characterization of novel inhibitors for PKMYT1 Eur. J. Med. Chem. 2019 161 479 492 10.1016/j.ejmech.2018.10.050 30388464 A Najjar 2019 Computer-aided design, synthesis and biological characterization of novel inhibitors for PKMYT1 Eur. J. Med. Chem. 161 479 492 10.1016/j.ejmech.2018.10.050 30388464 10.1016/j.ejmech.2018.10.050 8. Davis AJ TAp63-regulated miRNAs suppress cutaneous squamous cell carcinoma through inhibition of a network of cell-cycle genes Cancer Res. 2020 80 2484 2497 10.1158/0008-5472.Can-19-1892 32156775 PMC7299759 AJ Davis 2020 TAp63-regulated miRNAs suppress cutaneous squamous cell carcinoma through inhibition of a network of cell-cycle genes Cancer Res. 80 2484 2497 10.1158/0008-5472.Can-19-1892 32156775 10.1158/0008-5472.CAN-19-1892 PMC7299759 9. Toledo CM Genome-wide CRISPR-Cas9 screens reveal loss of redundancy between PKMYT1 and WEE1 in glioblastoma stem-like cells Cell Rep. 2015 13 2425 2439 10.1016/j.celrep.2015.11.021 26673326 PMC4691575 CM Toledo 2015 Genome-wide CRISPR-Cas9 screens reveal loss of redundancy between PKMYT1 and WEE1 in glioblastoma stem-like cells Cell Rep. 13 2425 2439 10.1016/j.celrep.2015.11.021 26673326 10.1016/j.celrep.2015.11.021 PMC4691575 10. Asquith CRM Laitinen T East MP PKMYT1: A forgotten member of the WEE1 family Nat. Rev. Drug Discov. 2020 19 157 10.1038/d41573-019-00202-9 32127662 CRM Asquith T Laitinen MP East 2020 PKMYT1: A forgotten member of the WEE1 family Nat. Rev. Drug Discov. 19 157 10.1038/d41573-019-00202-9 32127662 10.1038/d41573-019-00202-9 11. Gallo D CCNE1 amplification is synthetic lethal with PKMYT1 kinase inhibition Nature 2022 604 749 756 10.1038/s41586-022-04638-9 35444283 PMC9046089 D Gallo 2022 CCNE1 amplification is synthetic lethal with PKMYT1 kinase inhibition Nature 604 749 756 10.1038/s41586-022-04638-9 35444283 10.1038/s41586-022-04638-9 PMC9046089 12. Li M Low-molecular weight cyclin E confers a vulnerability to PKMYT1 inhibition in triple-negative breast cancer Cancer Res. 2024 84 3864 3880 10.1158/0008-5472.Can-23-4130 39186665 PMC11567801 M Li 2024 Low-molecular weight cyclin E confers a vulnerability to PKMYT1 inhibition in triple-negative breast cancer Cancer Res. 84 3864 3880 10.1158/0008-5472.Can-23-4130 39186665 10.1158/0008-5472.CAN-23-4130 PMC11567801 13. Hu Y Demethylase ALKBH5 suppresses invasion of gastric cancer via PKMYT1 m6A modification Mol. Cancer 2022 21 34 10.1186/s12943-022-01522-y 35114989 PMC8812266 Y Hu 2022 Demethylase ALKBH5 suppresses invasion of gastric cancer via PKMYT1 m6A modification Mol. Cancer 21 34 10.1186/s12943-022-01522-y 35114989 10.1186/s12943-022-01522-y PMC8812266 14. Szychowski J Discovery of an orally bioavailable and selective PKMYT1 inhibitor, RP-6306 J. Med. Chem. 2022 65 10251 10284 10.1021/acs.jmedchem.2c00552 35880755 PMC9837800 J Szychowski 2022 Discovery of an orally bioavailable and selective PKMYT1 inhibitor, RP-6306 J. Med. Chem. 65 10251 10284 10.1021/acs.jmedchem.2c00552 35880755 10.1021/acs.jmedchem.2c00552 PMC9837800 15. Platzer C Identification of PKMYT1 inhibitors by screening the GSK published protein kinase inhibitor set I and II Bioorg. Med. Chem. 2018 26 4014 4024 10.1016/j.bmc.2018.06.027 29941193 C Platzer 2018 Identification of PKMYT1 inhibitors by screening the GSK published protein kinase inhibitor set I and II Bioorg. Med. Chem. 26 4014 4024 10.1016/j.bmc.2018.06.027 29941193 10.1016/j.bmc.2018.06.027 16. Bai R Investigation of GPR143 as a promising novel marker for the progression of skin cutaneous melanoma through bioinformatic analyses and cell experiments Apoptosis 2023 10.1007/s10495-023-01913-6 37945816 R Bai 2023 Investigation of GPR143 as a promising novel marker for the progression of skin cutaneous melanoma through bioinformatic analyses and cell experiments Apoptosis 10.1007/s10495-023-01913-6 37945816 10.1007/s10495-023-01913-6 17. Zheng H Liu H Ge Y Wang X Integrated single-cell and bulk RNA sequencing analysis identifies a cancer associated fibroblast-related signature for predicting prognosis and therapeutic responses in colorectal cancer Cancer Cell Int. 2021 21 552 10.1186/s12935-021-02252-9 34670584 PMC8529760 H Zheng H Liu Y Ge X Wang 2021 Integrated single-cell and bulk RNA sequencing analysis identifies a cancer associated fibroblast-related signature for predicting prognosis and therapeutic responses in colorectal cancer Cancer Cell Int. 21 552 10.1186/s12935-021-02252-9 34670584 10.1186/s12935-021-02252-9 PMC8529760 18. Charoentong P Pan-cancer immunogenomic analyses reveal genotype-immunophenotype relationships and predictors of response to checkpoint blockade Cell Rep. 2017 18 248 262 10.1016/j.celrep.2016.12.019 28052254 P Charoentong 2017 Pan-cancer immunogenomic analyses reveal genotype-immunophenotype relationships and predictors of response to checkpoint blockade Cell Rep. 18 248 262 10.1016/j.celrep.2016.12.019 28052254 10.1016/j.celrep.2016.12.019 19. Yoshihara K Inferring tumour purity and stromal and immune cell admixture from expression data Nat. Commun. 2013 4 2612 10.1038/ncomms3612 24113773 PMC3826632 K Yoshihara 2013 Inferring tumour purity and stromal and immune cell admixture from expression data Nat. Commun. 4 2612 10.1038/ncomms3612 24113773 10.1038/ncomms3612 PMC3826632 20. Fu J Large-scale public data reuse to model immunotherapy response and resistance Genome Med. 2020 12 21 10.1186/s13073-020-0721-z 32102694 PMC7045518 J Fu 2020 Large-scale public data reuse to model immunotherapy response and resistance Genome Med. 12 21 10.1186/s13073-020-0721-z 32102694 10.1186/s13073-020-0721-z PMC7045518 21. Feng C A neutrophil extracellular traps-related classification predicts prognosis and response to immunotherapy in colon cancer Sci. Rep. 2023 13 19297 10.1038/s41598-023-45558-6 37935721 PMC10630512 C Feng 2023 A neutrophil extracellular traps-related classification predicts prognosis and response to immunotherapy in colon cancer Sci. Rep. 13 19297 10.1038/s41598-023-45558-6 37935721 10.1038/s41598-023-45558-6 PMC10630512 22. Yang W Genomics of drug sensitivity in cancer (GDSC): A resource for therapeutic biomarker discovery in cancer cells Nucleic Acids Res. 2013 41 D955 961 10.1093/nar/gks1111 23180760 PMC3531057 W Yang 2013 Genomics of drug sensitivity in cancer (GDSC): A resource for therapeutic biomarker discovery in cancer cells Nucleic Acids Res. 41 D955 961 10.1093/nar/gks1111 23180760 10.1093/nar/gks1111 PMC3531057 23. Vasaikar SV Straub P Wang J Zhang B LinkedOmics: Analyzing multi-omics data within and across 32 cancer types Nucleic Acids Res. 2018 46 D956 d963 10.1093/nar/gkx1090 29136207 PMC5753188 SV Vasaikar P Straub J Wang B Zhang 2018 LinkedOmics: Analyzing multi-omics data within and across 32 cancer types Nucleic Acids Res. 46 D956 d963 10.1093/nar/gkx1090 29136207 10.1093/nar/gkx1090 PMC5753188 24. Kanehisa M Sato Y Kawashima M Furumichi M Tanabe M KEGG as a reference resource for gene and protein annotation Nucleic Acids Res. 2016 44 D457 462 10.1093/nar/gkv1070 26476454 PMC4702792 M Kanehisa Y Sato M Kawashima M Furumichi M Tanabe 2016 KEGG as a reference resource for gene and protein annotation Nucleic Acids Res. 44 D457 462 10.1093/nar/gkv1070 26476454 10.1093/nar/gkv1070 PMC4702792 25. Kanehisa M Goto S KEGG: Kyoto encyclopedia of genes and genomes Nucleic Acids Res. 2000 28 27 30 10.1093/nar/28.1.27 10592173 PMC102409 M Kanehisa S Goto 2000 KEGG: Kyoto encyclopedia of genes and genomes Nucleic Acids Res. 28 27 30 10.1093/nar/28.1.27 10592173 10.1093/nar/28.1.27 PMC102409 26. Paluch EK Aspalter IM Sixt M Focal adhesion-independent cell migration Annu. Rev. Cell Dev. Biol. 2016 32 469 490 10.1146/annurev-cellbio-111315-125341 27501447 EK Paluch IM Aspalter M Sixt 2016 Focal adhesion-independent cell migration Annu. Rev. Cell Dev. Biol. 32 469 490 10.1146/annurev-cellbio-111315-125341 27501447 10.1146/annurev-cellbio-111315-125341 27. Akabane S KIFC1 regulates ZWINT to promote tumor progression and spheroid formation in colorectal cancer Pathol. Int. 2021 71 441 452 10.1111/pin.13098 33819373 S Akabane 2021 KIFC1 regulates ZWINT to promote tumor progression and spheroid formation in colorectal cancer Pathol. Int. 71 441 452 10.1111/pin.13098 33819373 10.1111/pin.13098 28. Kuai XY Lei ZY Liu XS Shao XY The interaction of GLUT1 and FOXM1 leads to a poor prognosis in colorectal cancer Anticancer Agents Med. Chem. 2020 20 941 950 10.2174/1871520620666200318094618 32188390 XY Kuai ZY Lei XS Liu XY Shao 2020 The interaction of GLUT1 and FOXM1 leads to a poor prognosis in colorectal cancer Anticancer Agents Med. Chem. 20 941 950 10.2174/1871520620666200318094618 32188390 10.2174/1871520620666200318094618 29. Ye X Lv H MicroRNA-519d-3p inhibits cell proliferation and migration by targeting TROAP in colorectal cancer Biomed. Pharmacother 2018 105 879 886 10.1016/j.biopha.2018.04.114 30021381 X Ye H Lv 2018 MicroRNA-519d-3p inhibits cell proliferation and migration by targeting TROAP in colorectal cancer Biomed. Pharmacother 105 879 886 10.1016/j.biopha.2018.04.114 30021381 10.1016/j.biopha.2018.04.114 30. Cao H Clinical value of detecting IQGAP3, B7–H4 and cyclooxygenase-2 in the diagnosis and prognostic evaluation of colorectal cancer Cancer Cell Int. 2019 19 163 10.1186/s12935-019-0881-3 31223291 PMC6570966 H Cao 2019 Clinical value of detecting IQGAP3, B7–H4 and cyclooxygenase-2 in the diagnosis and prognostic evaluation of colorectal cancer Cancer Cell Int. 19 163 10.1186/s12935-019-0881-3 31223291 10.1186/s12935-019-0881-3 PMC6570966 31. Zhang Y 2021 Identification of hub genes in colorectal cancer based on weighted gene co-expression network analysis and clinical data from The Cancer Genome Atlas Biosci. Rep. 10.1042/bsr20211280 PMC8314434 34308980 Y Zhang 2021 Identification of hub genes in colorectal cancer based on weighted gene co-expression network analysis and clinical data from The Cancer Genome Atlas Biosci. Rep. 10.1042/bsr20211280 10.1042/BSR20211280 PMC8314434 34308980 32. Xiong Y CDCA5 accelerates progression of breast cancer by promoting the binding of E2F1 and FOXM1 J. Transl. Med. 2024 22 639 10.1186/s12967-024-05443-w 38978058 PMC11232132 Y Xiong 2024 CDCA5 accelerates progression of breast cancer by promoting the binding of E2F1 and FOXM1 J. Transl. Med. 22 639 10.1186/s12967-024-05443-w 38978058 10.1186/s12967-024-05443-w PMC11232132 33. Liu W MYBL2 promotes proliferation and metastasis of bladder cancer through transactivation of CDCA3 Oncogene 2022 41 4606 4617 10.1038/s41388-022-02456-x 36071275 W Liu 2022 MYBL2 promotes proliferation and metastasis of bladder cancer through transactivation of CDCA3 Oncogene 41 4606 4617 10.1038/s41388-022-02456-x 36071275 10.1038/s41388-022-02456-x 34. Lu Y Systematic pan-cancer analysis identifies CDC45 as having an oncogenic role in human cancers Oncol. Rep. 2022 10.3892/or.2022.8400 36082823 PMC9478988 Y Lu 2022 Systematic pan-cancer analysis identifies CDC45 as having an oncogenic role in human cancers Oncol. Rep. 10.3892/or.2022.8400 36082823 10.3892/or.2022.8400 PMC9478988 35. Jeong SM Bui QT Kwak M Lee JY Lee PC Targeting Cdc20 for cancer therapy Biochim. Biophys. Acta Rev. Cancer 2022 1877 188824 10.1016/j.bbcan.2022.188824 36243246 SM Jeong QT Bui M Kwak JY Lee PC Lee 2022 Targeting Cdc20 for cancer therapy Biochim. Biophys. Acta Rev. Cancer 1877 18882410.1016/j.bbcan.2022.188824 36243246 10.1016/j.bbcan.2022.188824 36. Zhang Y Hu X miR-148a promotes cell sensitivity through downregulating SOS2 in radiation-resistant non-small cell lung cancer cells Oncol. Lett. 2022 23 135 10.3892/ol.2022.13255 35251354 PMC8895464 Y Zhang X Hu 2022 miR-148a promotes cell sensitivity through downregulating SOS2 in radiation-resistant non-small cell lung cancer cells Oncol. Lett. 23 135 10.3892/ol.2022.13255 35251354 10.3892/ol.2022.13255 PMC8895464 37. Kong D CHES1 modulated tumorigenesis and senescence of pancreas cancer cells through repressing AKR1B10 Biochim. Biophys. Acta Mol. Basis Dis. 2024 1870 167214 10.1016/j.bbadis.2024.167214 38718846 D Kong 2024 CHES1 modulated tumorigenesis and senescence of pancreas cancer cells through repressing AKR1B10 Biochim. Biophys. Acta Mol. Basis Dis. 1870 16721410.1016/j.bbadis.2024.167214 38718846 10.1016/j.bbadis.2024.167214 38. Zhou Y Targeting of HBP1/TIMP3 axis as a novel strategy against breast cancer Pharmacol. Res. 2023 194 106846 10.1016/j.phrs.2023.106846 37414199 Y Zhou 2023 Targeting of HBP1/TIMP3 axis as a novel strategy against breast cancer Pharmacol. Res. 194 10684610.1016/j.phrs.2023.106846 37414199 10.1016/j.phrs.2023.106846 39. Bray F Global cancer statistics 2022: GLOBOCAN estimates of incidence and mortality worldwide for 36 cancers in 185 countries CA Cancer J. Clin. 2024 74 229 263 10.3322/caac.21834 38572751 F Bray 2024 Global cancer statistics 2022: GLOBOCAN estimates of incidence and mortality worldwide for 36 cancers in 185 countries CA Cancer J. Clin. 74 229 263 10.3322/caac.21834 38572751 10.3322/caac.21834 40. Arnold M Global patterns and trends in colorectal cancer incidence and mortality Gut 2017 66 683 691 10.1136/gutjnl-2015-310912 26818619 M Arnold 2017 Global patterns and trends in colorectal cancer incidence and mortality Gut 66 683 691 10.1136/gutjnl-2015-310912 26818619 10.1136/gutjnl-2015-310912 41. Song M Garrett WS Chan AT Nutrients, foods, and colorectal cancer prevention Gastroenterology 2015 148 1244 1260 10.1053/j.gastro.2014.12.035 25575572 PMC4409470 M Song WS Garrett AT Chan 2015 Nutrients, foods, and colorectal cancer prevention Gastroenterology 148 1244 1260 10.1053/j.gastro.2014.12.035 25575572 10.1053/j.gastro.2014.12.035 PMC4409470 42. Wang M PKMYT1 induced by YAP/TEAD1 gives rise to the progression and worse prognosis of bladder cancer Mol. Carcinog 2024 63 160 172 10.1002/mc.23643 37787394 M Wang 2024 PKMYT1 induced by YAP/TEAD1 gives rise to the progression and worse prognosis of bladder cancer Mol. Carcinog 63 160 172 10.1002/mc.23643 37787394 10.1002/mc.23643 43. Wang S Genome-wide CRISPR screens identify PKMYT1 as a therapeutic target in pancreatic ductal adenocarcinoma EMBO Mol. Med. 2024 16 1115 1142 10.1038/s44321-024-00060-y 38570712 PMC11099189 S Wang 2024 Genome-wide CRISPR screens identify PKMYT1 as a therapeutic target in pancreatic ductal adenocarcinoma EMBO Mol. Med. 16 1115 1142 10.1038/s44321-024-00060-y 38570712 10.1038/s44321-024-00060-y PMC11099189 44. Sun Y Single-cell landscape of the ecosystem in early-relapse hepatocellular carcinoma Cell 2021 184 404 421 10.1016/j.cell.2020.11.041 33357445 Y Sun 2021 Single-cell landscape of the ecosystem in early-relapse hepatocellular carcinoma Cell 184 404 421 10.1016/j.cell.2020.11.041 33357445 10.1016/j.cell.2020.11.041 45. Yi M Biomarkers for predicting efficacy of PD-1/PD-L1 inhibitors Mol. Cancer 2018 17 129 10.1186/s12943-018-0864-3 30139382 PMC6107958 M Yi 2018 Biomarkers for predicting efficacy of PD-1/PD-L1 inhibitors Mol. Cancer 17 129 10.1186/s12943-018-0864-3 30139382 10.1186/s12943-018-0864-3 PMC6107958 46. Galon J Bruni D Approaches to treat immune hot, altered and cold tumours with combination immunotherapies Nat. Rev. Drug Discov. 2019 18 197 218 10.1038/s41573-018-0007-y 30610226 J Galon D Bruni 2019 Approaches to treat immune hot, altered and cold tumours with combination immunotherapies Nat. Rev. Drug Discov. 18 197 218 10.1038/s41573-018-0007-y 30610226 10.1038/s41573-018-0007-y 47. Zhang J Huang D Saw PE Song E Turning cold tumors hot: From molecular mechanisms to clinical applications Trends Immunol. 2022 43 523 545 10.1016/j.it.2022.04.010 35624021 J Zhang D Huang PE Saw E Song 2022 Turning cold tumors hot: From molecular mechanisms to clinical applications Trends Immunol. 43 523 545 10.1016/j.it.2022.04.010 35624021 10.1016/j.it.2022.04.010 48. Macheret M Halazonetis TD DNA replication stress as a hallmark of cancer Annu. Rev. Pathol. 2015 10 425 448 10.1146/annurev-pathol-012414-040424 25621662 M Macheret TD Halazonetis 2015 DNA replication stress as a hallmark of cancer Annu. Rev. Pathol. 10 425 448 10.1146/annurev-pathol-012414-040424 25621662 10.1146/annurev-pathol-012414-040424 49. Phan TG Croucher PI The dormant cancer cell life cycle Nat. Rev. Cancer 2020 20 398 411 10.1038/s41568-020-0263-0 32488200 TG Phan PI Croucher 2020 The dormant cancer cell life cycle Nat. Rev. Cancer 20 398 411 10.1038/s41568-020-0263-0 32488200 10.1038/s41568-020-0263-0 50. Xu J Lamouille S Derynck R TGF-beta-induced epithelial to mesenchymal transition Cell Res. 2009 19 156 172 10.1038/cr.2009.5 19153598 PMC4720263 J Xu S Lamouille R Derynck 2009 TGF-beta-induced epithelial to mesenchymal transition Cell Res. 19 156 172 10.1038/cr.2009.5 19153598 10.1038/cr.2009.5 PMC4720263 51. Wang X Eichhorn PJA Thiery JP TGF-β, EMT, and resistance to anti-cancer treatment Semin. Cancer Biol. 2023 97 1 11 10.1016/j.semcancer.2023.10.004 37944215 X Wang PJA Eichhorn JP Thiery 2023 TGF-β, EMT, and resistance to anti-cancer treatment Semin. Cancer Biol. 97 1 11 10.1016/j.semcancer.2023.10.004 37944215 10.1016/j.semcancer.2023.10.004 52. Zhang Q Overexpressed PKMYT1 promotes tumor progression and associates with poor survival in esophageal squamous cell carcinoma Cancer Manag. Res. 2019 11 7813 7824 10.2147/cmar.S214243 31695486 PMC6707438 Q Zhang 2019 Overexpressed PKMYT1 promotes tumor progression and associates with poor survival in esophageal squamous cell carcinoma Cancer Manag. Res. 11 7813 7824 10.2147/cmar.S214243 31695486 10.2147/CMAR.S214243 PMC6707438 ",
  "metadata": {
    "Title of this paper": "Overexpressed PKMYT1 promotes tumor progression and associates with poor survival in esophageal squamous cell carcinoma",
    "Journal it was published in:": "Scientific Reports",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12475396/"
  }
}