{
  "title": "Paper_262",
  "abstract": "pmc BMC Res Notes BMC Res Notes 634 bmcresnotes BMC Research Notes 1756-0500 BMC PMC12487526 PMC12487526.1 12487526 12487526 41035064 10.1186/s13104-025-07465-z 7465 1 Research Note Improving the accuracy and precision of disease identification when utilizing EHR data for research: the case for hepatocellular carcinoma http://orcid.org/0000-0002-2052-3701 Wong Carrie R. crwong@mednet.ucla.edu 1 2 Flores Yvonne N. 2 3 4 Avila Analissa 2 5 Tieu Lina 2 Crespi Catherine M. 2 5 May Folasade P. 1 2 Bell Douglas S. 6 Glenn Beth 2 3 Bastani Roshan 2 3 1 https://ror.org/046rm7j60 grid.19006.3e 0000 0000 9632 6718 Vatche and Tamar Manoukian Division of Digestive Diseases, Department of Medicine, University of California, 2 https://ror.org/0599cs764 0000 0004 0422 4423 UCLA Center for Cancer Prevention and Control and UCLA-Kaiser Permanente Center for Health Equity, Fielding School of Public Health and Jonsson Comprehensive Cancer Center, 3 https://ror.org/046rm7j60 grid.19006.3e 0000 0000 9632 6718 Department of Health Policy and Management, Fielding School of Public Health, University of California, 4 https://ror.org/03xddgg98 grid.419157.f 0000 0001 1091 9430 Unidad de Investigación Epidemiológica y en Servicios de Salud, Morelos, Instituto Mexicano del Seguro Social, 5 https://ror.org/046rm7j60 grid.19006.3e 0000 0000 9632 6718 Department of Biostatistics, Fielding School of Public Health, University of California, 6 https://ror.org/046rm7j60 grid.19006.3e 0000 0000 9632 6718 Division of General Internal Medicine, Department of Medicine, University of California, 1 10 2025 2025 18 478157 410 28 8 2024 2 9 2025 01 10 2025 02 10 2025 03 10 2025 © The Author(s) 2025 2025 https://creativecommons.org/licenses/by/4.0/ Open Access http://creativecommons.org/licenses/by/4.0/ Objective We assessed the performance of International Classification of Diseases (ICD) codes to identify patients with hepatocellular carcinoma (HCC) in a large academic health system and determined whether employing an algorithm using a combination of ICD codes could deliver higher accuracy and precision than single ICD codes in identifying HCC cases using electronic health record (EHR) data. Results The use of a single ICD code entry for HCC (ICD-9-CM 155.0 or ICD-10-CM C22.0) in our cohort of 1,007 established ambulatory care patients with potential HCC yielded 58% false positives (not true HCC cases) based on chart reviews. We developed an ICD code-based algorithm that prioritized positive predictive value (PPV), F-score, and accuracy to minimize false positives and negatives. Using manual chart reviews as the gold standard, the highest performing algorithm required at least 10 ICD code entries for HCC and the sum of ICD code entries for HCC to exceed the sum of ICD code entries for non-HCC malignancies. The algorithm demonstrated high performance (PPV 97.4%, F-score 0.92, accuracy 94%), which was internally validated (PPV 92.3%, F-score 0.90, accuracy 91%) using a separate sample of 285 cancer registry cases. Our findings support the need to assess the accuracy and precision of ICD codes before using EHR data to study HCC more broadly. Supplementary Information The online version contains supplementary material available at 10.1186/s13104-025-07465-z. Keywords Electronic health record Electronic medical record International Classification of Diseases ICD code Hepatocellular carcinoma Liver cancer Chronic liver disease Accuracy Precision Algorithm National Center for Advancing Translational Science of the National Institutes of Health - Jonsson Comprehensive Cancer Center, David Geffen School of Medicine, and Clinical Translational Science Institute at the University of California, Los Angeles UL1TR001881 pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement yes pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes issue-copyright-statement © BioMed Central Ltd., part of Springer Nature 2025 Introduction Hepatocellular carcinoma (HCC) is the most common type of liver cancer among adults and the sixth leading cause of cancer deaths in the United States [ 1 2 3 4 5 Large data from health systems that provide longitudinal care for patients with HCC are needed to obtain more precise estimates of HCC epidemiology and treatment outcomes. A study based in an academic health system examined the accuracy of ICD, Ninth Revision, Clinical Modification (ICD-9-CM) codes from an administrative database to identify patients with HCC and found that a combination of two occurrences of ICD-9-CM codes for HCC and two ICD-9-CM codes for chronic liver disease and/or cirrhosis were needed to achieve an 87% PPV in capturing true HCC cases [ 6 We sought to assess the performance of ICD-9-CM and ICD-10-CM diagnostic codes to identify patients with HCC with established ambulatory care at a large academic health system and determine whether employing an ICD code-based algorithm could deliver higher accuracy and precision in identifying HCC cases. Methods We used ICD-9-CM and ICD-10-CM codes (Table 1 in Supplement) to assemble a study cohort of adult patients with chronic liver disease between 2006 and 2022 using electronic health record (EHR) data at an academic health system (UCLA Health), which included two hospitals and over 200 medical clinics across Southern California (Fig. 1 n n Performance measurements, including sensitivity, specificity, PPV (precision), negative predictive value (NPV), F-score (harmonic mean of PPV and sensitivity), and accuracy (percentage of patients who were correctly classified) accompanied each algorithm iteration (Table 1 1 Results The cohort of 26,439 established patients with ICD codes indicative of chronic liver disease included 1,007 patients with potential HCC based on a single ICD-9-CM or ICD-10-CM code entry. Chart reviews of the random sample of 300 potential HCC cases revealed that 58% of the potential cases of HCC were false positives (not true HCC cases). Of the 174 false HCC cases, 64 patients (36.8%) were found to have non-HCC malignancies, including 20 with cholangiocarcinoma, 16 with metastatic colorectal cancer, 9 with metastatic neuroendocrine tumors, 4 with metastatic pancreatic adenocarcinoma, and 15 with other metastatic malignancies. The second largest group of false positives (32.1%) included patients undergoing surveillance for HCC in the setting of chronic liver disease ( n n n n In the development sample ( n p p p Following prior work [ 6 1 2 The best performing algorithm was an iteration of Algorithm 4 which had a of PPV of 97.4%, F-score of 0.92, and accuracy of 94% using the development sample. When we tested the algorithm using the cancer registry as the gold standard, the algorithm had similar performance metrics (PPV 94.3%, F-score 0.93, accuracy 94.4%). Our internal validation results revealed a consistently high performance with a PPV of 92.3%, F-score of 0.90, and accuracy of 91%. Discussion This study assessed the performance of multiple ICD-9-CM and ICD-10-CM for HCC to precisely and accurately identify patients with HCC and longitudinal ambulatory care in a large academic health system. In contrast to findings from the VA Corporate Data Warehouse [ 3 The discrepancy between the performance metrics of a single ICD code entry in our health system compared to the VA may be related to different coding practices and different patient populations including a higher prevalence of patients undergoing specialized cancer treatments in our health system. Compared to the VA, our health system includes patients with more female-specific malignancies, such as breast cancer, which require monitoring for liver metastasis. Specialized cancer treatments offered in our health system also require frequent surveillance imaging. As a referral center for specialty care, including transplant hepatology and hepatobiliary surgery, our health system likely encounters more consultations for evaluation of suspicious liver lesions, which may be miscoded using ICD-9-CM and ICD-10-CM codes for HCC. The PPV of the algorithm increased with an increasing number of ICD code entries for HCC as similarly reported in a previous study conducted in an academic health system [ 6 Limitations and strengths Several limitations should be considered when interpreting our findings. First, UCLA Health includes a tertiary care center, which receives referrals for specialized care in oncology, hepatobiliary surgery, and liver transplantation. Therefore, the prevalence of HCC is expectedly high in the study’s population, which could have inflated the PPV of our algorithm. Nonetheless, a higher prevalence of non-HCC malignancies would also be expected, which was countered by including the sum of ICD code entries for HCC to exceed the sum of ICD code entries for non-HCC malignancies in the algorithm. We also included additional performance metrics, such as the specificity and F-score, which are not as affected by disease prevalence. Second, while chart reviews were considered the gold standard to develop the best performing algorithm, human error during manual abstractions of EHR data could bias results. Duplicate chart reviews were not performed for all 300 potential HCC cases in the development sample, which could limit the reliability of the reference standard. Third, the study cohort was defined using ICD codes for chronic liver diseases, which were similarly subject to misclassification and could have led to downstream effects on the development and performance of our algorithm. In recognition of these limitations, we tested the performance of the algorithm using cancer registry data, which identified HCC cases independently from our study team using separate criteria, as a sensitivity test which showed similar results. Fourth, our algorithm was developed and validated exclusively within a single academic health system which limits its generalizability. Future directions include external validation of this algorithm in other academic and non-academic settings. Conclusion In conclusion, this study demonstrated that a combination of ICD-9-CM and ICD-10-CM codes for HCC can be used via an algorithm with over 90% accuracy and precision, whereas the use of a single ICD code entry to identify HCC cases requires caution in similar large health systems. With emerging new treatments for HCC [ 7 8  Fig. 1 Flowchart of Study Population  Table 1 Performance measurements of ICD code-based algorithm iterations PPV; positive predictive value, NPV; negative predictive value; HCC, hepatocellular carcinoma  Fig. 2 PPV, F-score, and accuracy for Algorithm 1 and 4. PPV; positive predictive value. Performance measurements of each algorithm were obtained using the Development Sample, which was a random pool of 300 potential HCC patients with at least 1 ICD code entry for HCC. Algorithm 1 included an increasing number of ICD code entries for HCC using ICD codes 155.0 and C22.0. Algorithm 4 included iterations from Algorithm 1, which included an increasing number of ICD code entries for HCC and required the sum of ICD code entries for HCC to exceed the sum of ICD code entries for non-HCC malignancies (secondary malignancy, cholangiocarcinoma, pancreatic cancer, colorectal cancer, neuroendocrine tumor) Supplementary Information Below is the link to the electronic supplementary material.  Supplementary Material 1. Publisher’s Note Springer Nature remains neutral with regard to jurisdictional claims in published maps and institutional affiliations. Acknowledgements We would like to acknowledge Drs. Saroja Bangaru, Aileen Bui, and Sarah J. Stettner and the Cancer Registry Department of Performance Strategy and Analytics at the University of California, Los Angeles for their contributions. Author contributions C.R.W., Y.N.F., A.A., L.T., F.P.M., D.B., B.G., and R.B. contributed to the study conception and design. Y.N.F., C.M.C., F.P.M., D.B., B.G., and R.B. acquired the data. A.A. provided primary statistical support. All authors contributed to the methods and statistical analyses. C.R.W. wrote the main manuscript text. All authors reviewed and edited the manuscript. Funding Jonsson Comprehensive Cancer Center, David Geffen School of Medicine, and Clinical Translational Science Institute at the University of California, Los Angeles (UL1TR001881). National Center for Advancing Translational Science of the National Institutes of Health. Data availability Study data cannot be openly shared to protect the private health information of patients at UCLA Health. Declarations Ethics approval and consent to participate The current study was approved by the Institutional Review Board at the University of California, Los Angeles. Written informed consent was not required for the use of de-identified electronic health data. Competing interests The authors declare no competing interests. Abbreviations HCC Hepatocellular carcinoma SEER Surveillance Epidemiology and End Results VA Veterans Affair ICD International Classification of Diseases PPV Positive predictive value ICD-9-CM ICD, Ninth Revision, Clinical Modification ICD-10-CM ICD, Tenth Revision, Clinical Modification NPV Negative predictive value HER Electronic health records References 1. Liver Cancer Causes, Risk Factors, and Prevention - NCI. 2022. https://www.cancer.gov/types/liver/what-is-liver-cancer/causes-risk-factors 2. SEER. Cancer of the liver and intrahepatic bile duct - cancer stat facts. https://seer.cancer.gov/statfacts/html/livibd.html 3. Ju MR Karalis JD Chansard M Augustine MM Mortensen E Wang SC Variation of hepatocellular carcinoma treatment patterns and survival across geographic regions in a veteran population Ann Surg Oncol 2022 29 13 8413 20 10.1245/s10434-022-12390-7 36018517 Ju MR, Karalis JD, Chansard M, Augustine MM, Mortensen E, Wang SC, et al. Variation of hepatocellular carcinoma treatment patterns and survival across geographic regions in a veteran population. Ann Surg Oncol. 2022;29(13):8413–20. 10.1245/s10434-022-12390-7. 36018517 10.1245/s10434-022-12390-7 4. Noone AM Lund JL Mariotto A Cronin K McNeel T Deapen D Comparison of SEER treatment data with medicare claims Med Care 2016 54 9 e55 64 10.1097/MLR.0000000000000073 24638121 PMC4981219 Noone AM, Lund JL, Mariotto A, Cronin K, McNeel T, Deapen D, et al. Comparison of SEER treatment data with medicare claims. Med Care. 2016;54(9):e55–64. 10.1097/MLR.0000000000000073. 24638121 10.1097/MLR.0000000000000073 PMC4981219 5. Overview of VHA Patient Veteran, and, Non-veteran Populations, and Characteristics. In: National Healthcare Quality and Disparities Report: Chartbook on Healthcare for Veterans. Agency for Healthcare Research and Quality (US); 2020. https://www.ncbi.nlm.nih.gov/books/NBK578553/ 6. Goldberg DS Lewis JD Halpern SD Weiner MG Lo Re V Validation of a coding algorithm to identify patients with hepatocellular carcinoma in an administrative database Pharmacoepidemiol Drug Saf 2013 22 1 103 7 10.1002/pds.3367 23124932 PMC3540172 Goldberg DS, Lewis JD, Halpern SD, Weiner MG, Lo Re V. Validation of a coding algorithm to identify patients with hepatocellular carcinoma in an administrative database. Pharmacoepidemiol Drug Saf. 2013;22(1):103–7. 10.1002/pds.3367. 23124932 10.1002/pds.3367 PMC3540172 7. Llovet JM Kelley RK Villanueva A Singal AG Pikarsky E Roayaie S Hepatocellular carcinoma Nat Rev Dis Primers 2021 7 1 1 28 10.1038/s41572-020-00240-3 33479224 Llovet JM, Kelley RK, Villanueva A, Singal AG, Pikarsky E, Roayaie S, et al. Hepatocellular carcinoma. Nat Rev Dis Primers. 2021;7(1):1–28. 10.1038/s41572-020-00240-3. 33479224 10.1038/s41572-020-00240-3 8. Ge J Li M Delk MB Lai JC 2024 A Comparison of a Large Language Model vs Manual Chart Review for the Extraction of Data Elements From the Electronic Health Record 10.1053/j.gastro.2023.12.019 PMC11792087 38151192 Ge J, Li M, Delk MB, Lai JC. A comparison of a large language model vs manual chart review for the extraction of data elements from the electronic health record. Gastroenterology. 2024;166(4):707–e7093. 10.1053/j.gastro.2023.12.019. 10.1053/j.gastro.2023.12.019 PMC11792087 38151192 ",
  "metadata": {
    "Title of this paper": "Hepatocellular carcinoma",
    "Journal it was published in:": "BMC Research Notes",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12487526/"
  }
}