{
  "title": "Paper_1112",
  "abstract": "pmc Int J Mol Sci Int J Mol Sci 808 ijms ijms International Journal of Molecular Sciences 1422-0067 Multidisciplinary Digital Publishing Institute  (MDPI) PMC12470219 PMC12470219.1 12470219 12470219 41009698 10.3390/ijms26189135 ijms-26-09135 1 Article Mutational Disruption of TP53: A Structural Approach to Understanding Chemoresistance https://orcid.org/0000-0002-6696-7770 Alsulami Ali F. Caratozzolo Mariano Francesco Academic Editor Department of Biochemistry, Faculty of Science, King Abdulaziz University, Jeddah 21589, Saudi Arabia; afmalsulami1@kau.edu.sa 18 9 2025 9 2025 26 18 497349 9135 17 8 2025 05 9 2025 16 9 2025 18 09 2025 27 09 2025 29 09 2025 © 2025 by the author. 2025 https://creativecommons.org/licenses/by/4.0/ Licensee MDPI, Basel, Switzerland. This article is an open access article distributed under the terms and conditions of the Creative Commons Attribution (CC BY) license ( https://creativecommons.org/licenses/by/4.0/ The tumour suppressor protein p53 plays a central role in safeguarding genomic integrity through the regulation of DNA repair, cell cycle arrest, and apoptosis. Mutations in TP53 TP53 3D structure mapping TP53 mutation effect prediction COSMIC mutation analysis the Deanship of Scientific Research (DSR) at King Abdulaziz University, Jeddah, Saudi Arabia GPIP-263-130-2025 This project was funded by the Deanship of Scientific Research (DSR) at King Abdulaziz University, Jeddah, Saudi Arabia, under grant no. (GPIP-263-130-2025). The authors, therefore, acknowledge DSR for technical and financial support. pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement yes pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes 1. Introduction The TP53 p53 1 2 p53 3 p53 TP53 4 5 In normal cells, p53 MDM2 p53 6 7 8 9 10 11 12 13 14 Given its vital role in cellular defence mechanisms, studying TP53 15 p53 16 17 18 TP53 19 20 21 TP53 p53 TP53 22 23 TP53 24 The p53 Figure 1 MDM2 FOXO4 25 26 Figure 1 27 p53’s 28 Common TP53 29 30 31 32 While previous studies have extensively characterised TP53 33 34 35 36 37 p53 TP53 2. Results A comprehensive set of 277 experimentally determined 3D structures of TP53 38 39 40 Figure 1 TP53 41 A total of 1472 unique TP53 Supplementary S1 Analysis of the AlphaFold-predicted monomeric structure of TP53 Figure 1 Supplementary Figure S1 The structural and functional impact of TP53 42 2+ Figure 2 Figure 3 An alternative structural form of this domain is represented by the Hetero 6-mer PDB structure PDB ID 8R1G [ 43 Figure 2 Figure 3 Furthermore, analysis of the Homo 4-mer DNA-bound TP53 44 Figure 2 Figure 3 Comparing experimentally solved wild-type and mutant TP53 structures for the most frequently altered residues ( Table 1 p53 Figure 2 Figure 2 Figure 2 Most TP53 Figure 1 TP53 Very high-frequency mutations (>500 occurrences): A total of nine mutations are in this category, all located within the DNA-binding domain. Among them, four occur at the protein–DNA interface, one is near the ligand- and zinc-binding sites, and two are in non-interface regions ( Table 1 High-frequency mutations (100–500 occurrences): This group includes 66 mutations, with 65 located in the DNA-binding domain and one mutant (P72R) located in the proline-rich region. Moderately high-frequency mutations (50–100 occurrences): Comprising 62 mutations, all are located within the DNA-binding domain. Lower high-frequency mutations (20–50 occurrences): There are 170 mutations in this range. Most are within the DNA-binding domain, except for (P72A) in the proline-rich region, (V31I) in the transactivation domain, and G334V in the Tetramerisation domain. Mutation effects were predicted using structure-based approaches, mCSM [ 45 46 47 48 Table 1 Across the three TP53 structural contexts analysed—monomeric (PDB 8DC8, 988 mutations), DNA-bound tetramer (PDB 7EEU, 1045 mutations), and heterohexameric assembly (PDB 8R1G, 1060 mutations)—complete agreement among the three structure-based prediction methods was observed for a subset of mutations. Specifically, agreement occurred for 326 mutations (33%) in 8DC8, 356 mutations (34%) in 7EEU, and 331 mutations (31%) in 8R1G. Within these consensus sets, the majority of mutations were classified as moderately destabilising, a smaller portion as highly destabilising, and only a minority as moderately stabilising. For the remaining mutations, predictions varied among the tools, indicating inconsistent assessments of their structural impact. On the other hand, analysis using the sequence-based method for 1467 unique mutations predicted 111 mutations (7.6%) as ambiguous, 572 mutations (39%) as likely benign, and 784 mutations (53.4%) as likely pathogenic ( Supplementary Figure S2 In the DNA-binding domain (PDB ID: 7EEU), there was 100% agreement between the sequence-based method and all three structure-based tools for the 82 mutations classified as highly destabilising. In the heterohexameric assemblies (PDB IDs: 8R1G and 8DC8), 97.8% of the mutations classified as highly destabilising by the structure-based tools were assigned the same classification by the sequence-based method ( Figure 4 Among the 82 mutations predicted to be highly destabilising in PDB ID: 7EEU, the vast majority (78 mutations) are located within the protein core. C238S is situated at the zinc-binding site, R267G occurs at the dimer interface, and only three mutations (V274A/D/G) are found at the protein–DNA interface. In PDB ID: 8DC8, six mutations (I195K, Y234R, L145Q, L257P, L257Q) occur near the ligand-binding site, three (C238S, C238R, C238G) are around the zinc ions, seven are in non-interface residues, and 66 mutations lie within the core region ( Supplementary S2 For the high-order assembly (PDB ID: 8R1G), two mutations (C238S/G) are at the zinc-binding site, eight are located at dimer interfaces (Y126H/D/N/S, R282G, L130H, F113S, W146G), 77 mutations occur in the core, and six occur in non-interface residues ( Supplementary S2 Across all three structures, three unfrquent mutations (V157E, Y234R, I195K) consistently appear in the core region and are predicted as highly destabilising by all methods, suggesting a substantial impact on TP53 stability and binding. 3. Discussion The comprehensive structural mapping of TP53 49 Hotspot mutations such as R248Q and R273C, which reside at the protein–DNA interface, primarily reduce p53’s DNA-binding affinity without substantially altering global stability. As a result, mutant p53 fails to activate transcription of pro-apoptotic genes like BAX PUMA p53 Mutations affecting metal coordination and ligand-binding sites, including R175H, C238S/G/R, G245S, and Y220C, demonstrate how subtle perturbations can lead to chemoresistance through multiple mechanisms. Disruption of zinc coordination impairs proper folding of the DBD and reduces transcriptional activity, while the Y220C substitution generates a solvent-accessible cavity, destabilising the domain but simultaneously creating a druggable pocket. This feature has already been exploited by small-molecule stabilisers that restore wild-type-like function, illustrating the therapeutic potential of structure-guided drug design. Furthermore, the analysis highlights the functional importance of p53 p53 Interestingly, mutations located within intrinsically disordered regions (IDRs) exhibit a different pattern, as these segments demonstrate higher tolerance to substitutions due to their structural flexibility. However, mutations within IDRs may still perturb regulatory interactions with partners such as MDM2 The use of AlphaFold’s artificial intelligence-based structure prediction played a critical role in enabling full structural coverage of TP53 TP53 Comparative assessment of predictive tools (mCSM, FoldX (V.5), Maestro (1.1), and AlphaMissense (V.0.0.1)) revealed strong concordance for core and ligand-binding mutations, supporting their robust destabilising effects. Discrepancies observed for DNA-contacting residues and disordered regions highlight the limitations of individual methods and underscore the need for integrating multiple predictive strategies with high-resolution structural mapping. Overall, structural analysis of TP53 These findings provide a structural framework for precision oncology by linking mutation hotspots to potential therapeutic strategies. Future research should focus on: Structure-based drug discovery targeting druggable cavities like Y220C and other destabilised cores. Computational–experimental pipelines to screen and validate small molecules that restore TP53 folding and DNA-binding capacity. As this is a purely computational study, the findings presented here are based on structural predictions and require experimental validation. While the computational analyses provide valuable insights into the potential impact of TP53 mutations, future studies integrating biochemical assays, structural characterisation, and drug-sensitivity experiments will be essential to confirm these predictions. Combining computational and experimental approaches will strengthen the conclusions and enhance the translational relevance of our findings. 4. Materials and Methods UniProt IDs [ 50 P04637 51 Mutation data were obtained from the COSMIC database (v102). The dataset was cleaned and curated to remove duplicates and erroneous entries. Mutation frequencies were calculated to assess prevalence. Each mutation was then mapped to its corresponding position in either the experimental PDB structures or AlphaFold models to enable 3D contextualization. Solvent Accessibility and Residue Classification Solvent accessibility was determined using the FreeSASA (2.1.2) tool [ 52 Core residues: SASA < 25 Non-interface residues: 25 ≤ SASA ≤ 80 Interface residues: SASA > 80 This classification offered insight into the spatial environment of each mutated residue. To evaluate proximity to key functional regions, mutations were mapped using multiple distance thresholds [ 53 6 Å for ligand-binding sites 5 Å for protein-DNA interfaces, zinc ion coordination sites, and homo-/hetero-dimer interfaces This ensured precise mapping of mutations within relevant structural and functional contexts. To assess the impact of mutations, both structure- and sequence-based tools were utilised. mCSM, FoldX, and Maestro were employed to estimate variations in protein stability and interaction energy (ΔΔG kcal/mol) derived from the 3D structure. Additionally, AlphaMissense, a deep learning-driven predictor, was used to evaluate the pathogenicity of variants based on sequence data. It is important to note that the sign conventions differ between methods. For mCSM and Maestro, negative ΔΔG values indicate destabilising mutations, whereas positive values suggest stabilisation. In contrast, FoldX uses the opposite convention: positive ΔΔG values represent destabilising mutations, and negative values indicate stabilisation. To harmonise the interpretation, we focused on the qualitative classification (“stabilising” vs. “destabilising”) rather than absolute values. Additionally, pathogenicity scores were derived from AlphaMissense, where scores ≥ 0.56 are classified as likely pathogenic and scores < 0.56 as likely benign, based on the recommended threshold from the AlphaMissense model. This integrated analysis facilitated a comprehensive functional interpretation of TP53 mutations. 5. Conclusions In this study, a comprehensive structural characterisation of all TP53 TP53 TP53 TP53 Acknowledgments This work was supported by computational resources provided by the Aziz Supercomputer at King Abdulaziz University (KAU). Disclaimer/Publisher’s Note: Supplementary Materials The supporting information can be downloaded at: https://www.mdpi.com/article/10.3390/ijms26189135/s1 Institutional Review Board Statement Not applicable. Informed Consent Statement Not applicable. Data Availability Statement The original contributions presented in this study are included in the article/ Supplementary Materials Conflicts of Interest The author has declared that no conflicts of interest exist. References 1. Lane D.P. P53, Guardian of the Genome Nature 1992 358 15 16 10.1038/358015a0 1614522 2. The ICGC/TCGA Pan-Cancer Analysis of Whole Genomes Consortium Pan-Cancer Analysis of Whole Genomes Nature 2020 578 82 93 10.1038/s41586-020-1969-6 32025007 PMC7025898 3. Zhao M. Wang T. Gleber-Netto F.O. Chen Z. McGrail D.J. Gomez J.A. Ju W. Gadhikar M.A. Ma W. Shen L. Mutant P53 Gains Oncogenic Functions through a Chromosomal Instability-Induced Cytosolic DNA Response Nat. Commun. 2024 15 180 10.1038/s41467-023-44239-2 38167338 PMC10761733 4. Hanahan D. Weinberg R.A. Hallmarks of Cancer: The Next Generation Cell 2011 144 646 674 10.1016/j.cell.2011.02.013 21376230 5. Abuetabh Y. Wu H.H. Chai C. Al Yousef H. Persad S. Sergi C.M. Leng R. DNA Damage Response Revisited: The P53 Family and Its Regulators Provide Endless Cancer Therapy Opportunities Exp. Mol. Med. 2022 54 1658 1669 10.1038/s12276-022-00863-4 36207426 PMC9636249 6. Wu H. Leng R.P. MDM2 Mediates P73 Ubiquitination: A New Molecular Mechanism for Suppression of P73 Function Oncotarget 2015 6 21479 21492 10.18632/oncotarget.4086 26025930 PMC4673280 7. Lin J. Chen J. Elenbaas B. Levine A.J. Several Hydrophobic Amino Acids in the P53 Amino-Terminal Domain Are Required for Transcriptional Activation, Binding to Mdm-2 and the Adenovirus 5 E1B 55-kD Protein Genes Dev. 1994 8 1235 1246 10.1101/gad.8.10.1235 7926727 8. Shieh S.-Y. Ikeda M. Taya Y. Prives C. DNA Damage-Induced Phosphorylation of P53 Alleviates Inhibition by MDM2 Cell 1997 91 325 334 10.1016/S0092-8674(00)80416-X 9363941 9. Cabezas M. García-Quevedo L. Alonso C. Manubens M. Álvarez Y. Barquinero J.F. Ramón Y. Cajal S. Ortega M. Blanco A. Polymorphisms in MDM2 and TP53 Genes and Risk of Developing Therapy-Related Myeloid Neoplasms Sci. Rep. 2019 9 150 10.1038/s41598-018-36931-x 30655613 PMC6336808 10. Kastenhuber E.R. Lowe S.W. Putting P53 in Context Cell 2017 170 1062 1078 10.1016/j.cell.2017.08.028 28886379 PMC5743327 11. Chen X. Zhang T. Su W. Dou Z. Zhao D. Jin X. Lei H. Wang J. Xie X. Cheng B. Mutant P53 in Cancer: From Molecular Mechanism to Therapeutic Modulation Cell Death Dis. 2022 13 974 10.1038/s41419-022-05408-1 36400749 PMC9674619 12. Levine A.J. P53: 800 Million Years of Evolution and 40 Years of Discovery Nat. Rev. Cancer 2020 20 471 480 10.1038/s41568-020-0262-1 32404993 13. Baugh E.H. Ke H. Levine A.J. Bonneau R.A. Chan C.S. Why Are There Hotspot Mutations in the TP53 Gene in Human Cancers? Cell Death Differ. 2018 25 154 160 10.1038/cdd.2017.180 29099487 PMC5729536 14. Giacomelli A.O. Yang X. Lintner R.E. McFarland J.M. Duby M. Kim J. Howard T.P. Takeda D.Y. Ly S.H. Kim E. Mutational Processes Shape the Landscape of TP53 Mutations in Human Cancer Nat. Genet. 2018 50 1381 1387 10.1038/s41588-018-0204-y 30224644 PMC6168352 15. Wang H. Guo M. Wei H. Chen Y. Targeting P53 Pathways: Mechanisms, Structures and Advances in Therapy Signal Transduct. Target. Ther. 2023 8 92 10.1038/s41392-023-01347-1 36859359 PMC9977964 16. Loh S.N. Arsenic and an Old Place: Rescuing P53 Mutants in Cancer Cancer Cell 2021 39 140 142 10.1016/j.ccell.2021.01.012 33561393 17. Kitayner M. Rozenberg H. Kessler N. Rabinovich D. Shaulov L. Haran T.E. Shakked Z. Structural Basis of DNA Recognition by P53 Tetramers Mol. Cell 2006 22 741 753 10.1016/j.molcel.2006.05.015 16793544 18. Joerger A.C. Fersht A.R. Structural Biology of the Tumor Suppressor P53 and Cancer-Associated Mutants Advances in Cancer Research Elsevier Amsterdam, The Netherlands 2007 Volume 97 1 23 978-0-12-006697-1 10.1016/S0065-230X(06)97001-8 17419939 19. Tong X. Xu D. Mishra R.K. Jones R.D. Sun L. Schiltz G.E. Liao J. Yang G.-Y. Identification of a Druggable Protein–Protein Interaction Site between Mutant P53 and Its Stabilizing Chaperone DNAJA1 J. Biol. Chem. 2021 296 100098 10.1074/jbc.RA120.014749 33208462 PMC7948449 20. Eldar A. Rozenberg H. Diskin-Posner Y. Rohs R. Shakked Z. Structural Studies of P53 Inactivation by DNA-Contact Mutations and Its Rescue by Suppressor Mutations via Alternative Protein-DNA Interactions Nucleic Acids Res. 2013 41 8748 8759 10.1093/nar/gkt630 23863845 PMC3794590 21. Alsulami A.F. Comprehensive Annotation of Mutations in Hallmark Genes Insights into Structural and Functional Implications Comput. Biol. Med. 2025 185 109588 10.1016/j.compbiomed.2024.109588 39700856 22. Friedler A. DeDecker B.S. Freund S.M.V. Blair C. Rüdiger S. Fersht A.R. Structural Distortion of P53 by the Mutation R249S and Its Rescue by a Designed Peptide: Implications for “Mutant Conformation” J. Mol. Biol. 2004 336 187 196 10.1016/j.jmb.2003.12.005 14741214 23. Walerych D. Napoli M. Collavin L. Del Sal G. The Rebel Angel: Mutant P53 as the Driving Oncogene in Breast Cancer Carcinogenesis 2012 33 2007 2017 10.1093/carcin/bgs232 22822097 PMC3483014 24. Nishikawa S. Iwakuma T. Drugs Targeting P53 Mutations with FDA Approval and in Clinical Trials Cancers 2023 15 429 10.3390/cancers15020429 36672377 PMC9856662 25. Bourgeois B. Spreitzer E. Platero-Rochart D. Paar M. Zhou Q. Usluer S. De Keizer P.L.J. Burgering B.M.T. Sánchez-Murcia P.A. Madl T. The Disordered P53 Transactivation Domain Is the Target of FOXO4 and the Senolytic Compound FOXO4-DRI Nat. Commun. 2025 16 5672 10.1038/s41467-025-60844-9 40593617 PMC12216184 26. Venot C. Maratrat M. Dureuil C. Conseiller E. Bracco L. Debussche L. The Requirement for the P53 Proline-Rich Functional Domain for Mediation of Apoptosis Is Correlated with Specific PIG3 Gene Transactivation and with Transcriptional Repression EMBO J. 1998 17 4668 4679 10.1093/emboj/17.16.4668 9707426 PMC1170796 27. Clore G.M. Omichinski J.G. Sakaguchi K. Zambrano N. Sakamoto H. Appella E. Gronenborn A.M. High-Resolution Structure of the Oligomerization Domain of P53 by Multidimensional NMR Science 1994 265 386 391 Erratum in Science 1995 267 10.1126/science.8023159 8023159 28. Sullivan K.D. Galbraith M.D. Andrysik Z. Espinosa J.M. Mechanisms of Transcriptional Regulation by P53 Cell Death Differ. 2018 25 133 143 10.1038/cdd.2017.174 29125602 PMC5729533 29. Guo Y. Wu H. Wiesmüller L. Chen M. Canonical and Non-Canonical Functions of P53 Isoforms: Potentiating the Complexity of Tumor Development and Therapy Resistance Cell Death Dis. 2024 15 412 10.1038/s41419-024-06783-7 38866752 PMC11169513 30. Hassin O. Nataraj N.B. Shreberk-Shaked M. Aylon Y. Yaeger R. Fontemaggi G. Mukherjee S. Maddalena M. Avioz A. Iancu O. Different Hotspot P53 Mutants Exert Distinct Phenotypes and Predict Outcome of Colorectal Cancer Patients Nat. Commun. 2022 13 2800 10.1038/s41467-022-30481-7 35589715 PMC9120190 31. Tseng Y.-H. Tran T.T.M. Tsai Chang J. Huang Y.-T. Nguyen A.T. Chang I.Y. Chen Y.-T. Hsieh H.-W. Juang Y.-L. Chang P.M.-H. Utilizing TP53 Hotspot Mutations as Effective Predictors of Gemcitabine Treatment Outcome in Non-Small-Cell Lung Cancer Cell Death Discov. 2025 11 26 Correction in Cell Death Discov 2025 11 10.1038/s41420-025-02300-7 39870629 PMC11772833 32. Tornesello M. TP53 Mutations in Cancer: Molecular Features and Therapeutic Opportunities (Review) Int. J. Mol. Med. 2024 55 7 10.3892/ijmm.2024.5448 39450536 PMC11554381 33. Su Y. Zhao J. Fu H. Liu Z. Du P. Zheng J. Wu J. Zhang J. TP53R175H Mutation Promotes Breast Cancer Cell Proliferation through CORO1A–P38 MAPK Pathway Regulation Biochem. Pharmacol. 2024 221 116047 10.1016/j.bcp.2024.116047 38331350 34. Allende-Vega N. Villalba M. Metabolic Stress Controls Mutant P53 R248Q Stability in Acute Myeloid Leukemia Cells Sci. Rep. 2019 9 5637 10.1038/s41598-019-42220-y 30948782 PMC6449403 35. Tan B.S. Tiong K.H. Choo H.L. Fei-Lei Chung F. Hii L.-W. Tan S.H. Yap I.K. Pani S. Khor N.T. Wong S.F. Mutant P53-R273H Mediates Cancer Cell Survival and Anoikis Resistance through AKT-Dependent Suppression of BCL2-Modifying Factor (BMF) Cell Death Dis. 2015 6 e1826 10.1038/cddis.2015.191 26181206 PMC4650736 36. Li J. Yang L. Gaur S. Zhang K. Wu X. Yuan Y.-C. Li H. Hu S. Weng Y. Yen Y. Mutants TP53 p.R273H and p.R273C but Not p.R273G Enhance Cancer Cell Malignancy Hum. Mutat. 2014 35 575 584 10.1002/humu.22528 24677579 37. Zhang Y. Coillie S.V. Fang J.-Y. Xu J. Gain of Function of Mutant P53: R282W on the Peak? Oncogenesis 2016 5 e196 10.1038/oncsis.2016.8 26878390 PMC5154345 38. Burley S.K. Bhikadiya C. Bi C. Bittrich S. Chao H. Chen L. Craig P.A. Crichlow G.V. Dalenberg K. Duarte J.M. RCSB Protein Data Bank (RCSB.Org): Delivery of Experimentally-Determined PDB Structures alongside One Million Computed Structure Models of Proteins from Artificial Intelligence/Machine Learning Nucleic Acids Res. 2023 51 D488 D508 10.1093/nar/gkac1077 36420884 PMC9825554 39. Tate J.G. Bamford S. Jubb H.C. Sondka Z. Beare D.M. Bindal N. Boutselakis H. Cole C.G. Creatore C. Dawson E. COSMIC: The Catalogue Of Somatic Mutations In Cancer Nucleic Acids Res. 2019 47 D941 D947 10.1093/nar/gky1015 30371878 PMC6323903 40. Jones D.T. Cozzetto D. DISOPRED3: Precise Disordered Region Predictions with Annotated Protein-Binding Activity Bioinformatics 2015 31 857 863 10.1093/bioinformatics/btu744 25391399 PMC4380029 41. Jumper J. Evans R. Pritzel A. Green T. Figurnov M. Ronneberger O. Tunyasuvunakool K. Bates R. Žídek A. Potapenko A. Highly Accurate Protein Structure Prediction with AlphaFold Nature 2021 596 583 589 10.1038/s41586-021-03819-2 34265844 PMC8371605 42. Guiley K.Z. Shokat K.M. A Small Molecule Reacts with the P53 Somatic Mutant Y220C to Rescue Wild-Type Thermal Stability Cancer Discov. 2023 13 56 69 10.1158/2159-8290.CD-22-0381 36197521 PMC9827106 43. Sandate C.R. Chakraborty D. Kater L. Kempf G. Thomä N.H. Structural Insights into Viral Hijacking of P53 by E6 and E6AP bioRxiv 2023 10.1101/2023.11.01.565136 44. Xing Y.F. Lu M. Human P53 Core Domain with Hot Spot Mutation R282W in Complex with the Natural CDKN1A(P21) P53-Response Element and Arsenic: 7eeu 2022 Available online: https://www.rcsb.org/structure/7EEU (accessed on 16 August 2025) 45. Pires D.E.V. Ascher D.B. Blundell T.L. MCSM: Predicting the Effects of Mutations in Proteins Using Graph-Based Signatures Bioinformatics 2014 30 335 342 10.1093/bioinformatics/btt691 24281696 PMC3904523 46. Laimer J. Hofer H. Fritz M. Wegenkittl S. Lackner P. MAESTRO-Multi Agent Stability Prediction upon Point Mutations BMC Bioinform. 2015 16 116 10.1186/s12859-015-0548-6 PMC4403899 25885774 47. Schymkowitz J. Borg J. Stricher F. Nys R. Rousseau F. Serrano L. The FoldX Web Server: An Online Force Field Nucleic Acids Res. 2005 33 W382 W388 10.1093/nar/gki387 15980494 PMC1160148 48. Cheng J. Novati G. Pan J. Bycroft C. Žemgulyte A. Applebaum T. Pritzel A. Wong L.H. Zielinski M. Sargeant T. Accurate Proteome-Wide Missense Variant Effect Prediction with AlphaMissense Science 2023 381 eadg7492 10.1126/science.adg7492 37733863 49. Guo S.-B. Meng Y. Lin L. Zhou Z.-Z. Li H.-L. Tian X.-P. Huang W.-J. Artificial Intelligence Alphafold Model for Molecular Biology and Drug Discovery: A Machine-Learning-Driven Informatics Investigation Mol. Cancer 2024 23 223 10.1186/s12943-024-02140-6 39369244 PMC11452995 50. The UniProt Consortium UniProt: The Universal Protein Knowledgebase Nucleic Acids Res. 2017 45 D158 D169 10.1093/nar/gkw1099 27899622 PMC5210571 51. Faezov B. Dunbrack R.L. PDBrenum: A Webserver and Program Providing Protein Data Bank Files Renumbered According to Their UniProt Sequences PLoS ONE 2021 16 e0253411 10.1371/journal.pone.0253411 34228733 PMC8259974 52. Mitternacht S. FreeSASA: An Open Source C Library for Solvent Accessible Surface Area Calculations F1000Research 2016 5 189 10.12688/f1000research.7931.1 26973785 PMC4776673 53. Alsulami A.F. Mut-Map: Comprehensive Computational Pipeline for Structural Mapping and Analysis of Cancer-Associated Mutations Brief. Bioinform. 2024 25 bbae514 10.1093/bib/bbae514 39413799 PMC11483132 Figure 1 Domain architecture of the TP53 A TP53 B C Figure 2 ( A TP53 B TP53 C Figure 3 Annotation and classification of mutations mapped onto the protein structure for the selected PDB entry. Figure 4 Agreement between structural-based and sequence-based prediction tools for mutations mapped on selected PDB structures. For experimental structures, moderately stabilising mutations showed the highest agreement, whereas moderately destabilising mutations showed the lowest agreement. ijms-26-09135-t001_Table 1 Table 1 High-Frequency TP53 Mutations Frequency PDB Locations mCSM Maestro FoldX AlphaMissense R175H 2513 8R1G around ZN metal −1.07 0.3237 11.13 0.98 R248Q 1692 7EEU protein DNA interface −0.85 −0.24 −0.98 0.99 R273H 1521 7EEU protein DNA interface −1.96 0.44 1.22 0.98 R273C 1492 7EEU protein DNA interface −2.02 −0.11 1.32 0.99 R248W 1308 7EEU protein DNA interface −1.277 −0.11 0.01 0.99 R282W 1165 8R1G between dimers interface −1.41 1.02 9.07 0.94 G245S 809 8R1G around ZN metal −1.536 0.69 4.03 0.97 Y220C 761 2ATA ligand binding site −3.524 3.27 5.11 0.97 R249S 646 8R1G non-interface −1.859 1.85 2.72 0.99 ",
  "metadata": {
    "Title of this paper": "Mut-Map: Comprehensive Computational Pipeline for Structural Mapping and Analysis of Cancer-Associated Mutations",
    "Journal it was published in:": "International Journal of Molecular Sciences",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12470219/"
  }
}