{
  "title": "Paper_1044",
  "abstract": "pmc Metabolites Metabolites 2273 metabolites metabolites Metabolites 2218-1989 Multidisciplinary Digital Publishing Institute  (MDPI) PMC12471846 PMC12471846.1 12471846 12471846 41002970 10.3390/metabo15090585 metabolites-15-00585 1 Article Ecballium elaterium https://orcid.org/0000-0001-7395-7768 Stefi Aikaterina L. Methodology Software Formal analysis Investigation Writing – original draft Writing – review & editing 1 https://orcid.org/0009-0002-7199-8907 Chalkiadaki Maria Methodology Software Formal analysis Investigation Writing – original draft Writing – review & editing 2 https://orcid.org/0009-0005-0525-1735 Bashari Emily Methodology Formal analysis Investigation Writing – original draft 1 Mitsigiorgi Konstantina Methodology Formal analysis Investigation Writing – original draft 1 https://orcid.org/0000-0001-9817-5631 Szczeblewski Paweł Methodology Formal analysis Investigation Writing – original draft 3 Papageorgiou Danae Formal analysis Investigation Writing – original draft 1 Gkikas Dimitrios Software Formal analysis Investigation Writing – original draft 1 Vassilacopoulou Dido Conceptualization Validation Resources Data curation Writing – review & editing Project administration Funding acquisition 4 https://orcid.org/0000-0001-9292-876X Christodoulakis Nikolaos S. Conceptualization Validation Resources Data curation Writing – review & editing Visualization Supervision Project administration Funding acquisition 1 https://orcid.org/0000-0001-5620-0165 Halabalaki Maria Conceptualization Validation Resources Data curation Writing – review & editing Visualization Supervision Project administration Funding acquisition 2 * Eisenreich Wolfgang Academic Editor 1 kstefi@biol.uoa.gr milibashari@gmail.com mitsig@biol.uoa.gr danaepapageorgiou@gmail.com dimgkikas@biol.uoa.gr nchristo@biol.uoa.gr 2 mariachalk@pharm.uoa.gr 3 pawel.szczeblewski@pg.edu.pl 4 didovass@biol.uoa.gr * mariahal@pharm.uoa.gr 31 8 2025 9 2025 15 9 497655 585 18 7 2025 21 8 2025 25 8 2025 31 08 2025 27 09 2025 27 09 2025 © 2025 by the authors. 2025 https://creativecommons.org/licenses/by/4.0/ Licensee MDPI, Basel, Switzerland. This article is an open access article distributed under the terms and conditions of the Creative Commons Attribution (CC BY) license ( https://creativecommons.org/licenses/by/4.0/ Background/Objectives: Ecballium elaterium E. elaterium 2 2 in vitro E. elaterium Ecballium elaterium heat stress LC-HRMS/MS cytotoxic SH-SY5Y cells MCF-7 cells DU-145 Gdańsk University of Technology 5/1/2024/IDUB/II.1b/Am Financial support of part of these studies from Gdańsk University of Technology by the 5/1/2024/IDUB/II.1b/Am grant under the AMERICIUM—‘Excellence Initiative—Research University’ program is gratefully acknowledged. pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement yes pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes 1. Introduction Ecballium elaterium 1 2 3 4 5 6 7 8 9 10 11 12 13 14 The most peculiar and unusual characteristic of the squirting cucumber is its autochory seed dispersal, which also shapes its Latin binomial, Ecballium elaterium Ecballium ἐκβάλλω 1 10 In the era of Ancient Greece, the plant was referred to as “elaterium”, a source of important medical products, by Dioscorides [ 15 16 17 2 18 2 19 20 21 5 The Mediterranean basin is recognized as one of the most climate-change-vulnerable regions globally, experiencing rising temperatures, prolonged heatwaves, and increased frequency of extreme weather events [ 22 23 Ecballium elaterium This study builds upon our previous work, which established the baseline morphological traits of Ecballium elaterium 10 E. elaterium 2. Materials and Methods 2.1. Plant Material and Experimental Setup Seeds of E. elaterium Figure 1 Figure 1 w w w w 2 3 −2 −1 In December 2023, two months after initial planting, the young plants were divided into two groups, each comprising 9 pots, and transferred to trays placed in a temperature-controlled culture chamber to begin the thermal experiment ( Figure 1 Supplementary Figures Figure 1 2 2 The thermal experiment was conducted a second time to verify the accuracy of the initial findings. The experimental setup remained the same, with incubation duration of roughly eight weeks—from February to April 2024—preceding the application of thermal stress. On the first day that stress was introduced, all leaves selected from both treatments were tagged. These leaves began as young leaflets and had matured into fully developed foliage by the time they were collected. 2.2. Microscopy At the end of the experiment, small square parts (1 × 1 mm) of the leaf tissue, excluding the central nerve, were removed at random from the middle of the upper pair of leaves (of each of the 9 plants; aged more than 10 days), and samples from primary roots (from 9 plants; 1 cm above the root tip) were cut. The leaf and root tissues were fixed in phosphate-buffered 3% glutaraldehyde (Merck KGaA, Darmstadt, Germany—pH 6.8) at 0 °C for 2 h and post-fixed in phosphate-buffered 1% osmium tetroxide (Merck KGaA, Darmstadt, Germany). They were then dehydrated in graded ethanol series. The prepared tissues were subjected to one of the following treatments: (a) Transferred in 100% acetone, critical point dried (Autosamdri ® 24 25 2.3. Histochemistry Histochemical analysis was conducted on leaf and root sections using plastic-embedded tissue samples, with the objective of identifying specific secondary metabolites of interest. The following reagents were applied to semithin sections of the embedded material: (a) A saturated solution of Sudan Black B in 70% ethanol, used to visualize lipid deposits [ 26 (b) A saturated solution of Alcian Blue in 3% acetic acid, employed to detect stored polysaccharides [ 27 (c) A 1% solution of Aniline Blue Black in 70% acetic acid, used for the histochemical identification of accumulated proteins [ 28 All prepared slides were examined under an OLYMPUS CX41 light microscope. 2.4. Pigments Protocol The total content of chlorophyll a (Chl-a), chlorophyll b (Chl-b), and carotenoids were determined using spectrophotometric analysis. Approximately 50 mg of fresh leaf tissue from each of 10 samples per treatment were extracted in 1 mL of 80% ( v v 25 663.6 646.6 663.6 646.6 29 30 31 N n Section 2.14 2.5. Protocol for MDA (Malondialdehyde) and H 2 2 Reactive oxygen species (ROS) levels were indirectly assessed by measuring lipid peroxidation through the malondialdehyde (MDA) assay. For this purpose, 50 mg of plant material—previously frozen and ground in liquid nitrogen—was extracted with 1 mL of 0.25% thiobarbituric acid (TBA; Sigma-Aldrich™, St. Louis, MO 63103, USA) prepared in 10% trichloroacetic acid (TCA; Sigma-Aldrich™, St. Louis, MO 63103, USA). The extract was collected in a 1.5-mL eppendorf tube, and the mixture was heated at 85 °C for 30 min, and then quickly chilled on ice. The same procedure was followed for the blank sample but without plant material. The mixture was centrifuged at maximum speed (14,000 rpm—Eppendorf 5453 Minispin Plus Centrifuge, Eppendorf SE, 22339 Hamburg, Germany) for 10 min to pellet the particles. The supernatant was then transferred to a 1-mL plastic cuvette for spectrophotometric measurement. The absorbance was determined primarily at 532 nm (the peak of the MDA–TBA complex) and then at 600 nm (nonspecific absorption). A sample of 1 mL 0.25% TBA in 10% TCA was used as blank. A (532–600) 32 532 −1 −1 Furthermore, oxidative stress was also measured by the H 2 2 33 34 w v g 2 2 N n Section 2.14 2.6. Determination of Total Phenolic Content Total phenolic content (TPC) in leaf extracts was quantified using the Folin–Ciocalteu colorimetric assay [ 35 36 v v ® v v 2 v v 2 3 w v 37 N n Section 2.14 2.7. Determination of Total Soluble Sugar Soluble sugars were extracted from dry, finely powdered samples leaves and roots that were placed in 10 mL 80% ( v v ® 2 4 38 39 −1 N n Section 2.14 2.8. Determination of Proline Free proline content was determined colorimetrically using 4 mL samples of dried plant material [ 40 41 42 v v ® −1 N n Section 2.14 2.9. Extraction of Plant Material Aerial parts of E. elaterium 2 2.10. Ultra-High-Performance Liquid Chromatography-High-Resolution Mass Spectrometry (UPLC-HRMS) Analysis For the ultra-high-performance liquid chromatography-high-resolution mass spectrometry (UHPLC-HRMS) and high-resolution tandem mass spectrometry (HRMS/MS) experiments, a Vanquish UHPLC coupled to an Orbitrap Exploris 120 mass spectrometer (both Thermo Fisher Scientific, Waltham, MA, USA) was utilized. Separation was achieved using a Supelco Ascentis Express (Sigma-Aldrich, St. Louis, MO 63103, USA) C18 column (150 mm × 2.1 mm, 2.0 µm) maintained at a stable temperature of 40 °C. The mobile phase consisted of (A) water (H 2 2 v v Mass spectra were acquired in both negative and positive ionization modes using a heated electrospray (HESI) source. The HESI conditions for both modes were as follows: vaporizer temperature was maintained at 350 °C, while the ion transfer tube temperature was set at 325 °C; the source voltage was adjusted to 3.4 kV for negative ion mode and 3.8 kV for positive ion mode. Sheath gas and auxiliary gas were adjusted at 45 and 20 arbitrary units, respectively. Sweep gas was kept at 0 arbitrary units. The HRMS data were acquired in full scan mode over a mass range of 113–1000 m z m z m z Compound annotation was conducted by examining the base peak (BP) chromatograms of the samples. Peaks were selected using a peak-to-peak analysis and the extracted ion chromatogram (EIC) method, yielding the corresponding full scan spectra. The Freestyle software calculator tool was employed for the proposed elemental composition of each m z 2.11. Cell Lines Bioassays The SH-SY5Y human neuroblastoma cell line, DU-145 human prostate carcinoma cells, and the MCF-7 (HTB-22™) human breast adenocarcinoma cell line were acquired from ATCC ® in vitro 43 44 45 v v v v 2 2 2.12. ROS Measurements on Cell Cultures ROS levels were measured using 10 mM of the oxidant sensitive fluorescent acetyl ester CM-H 2 2 2 2 46 2.13. Cell Death Measurements Cell death was assessed using the Trypan blue exclusion assay following a 48 h incubation period using the extracts [ 46 47 2.14. Data Preprocessing and Statistical Analysis For the PCA analysis of biochemical parameters Principal Component Analysis (PCA) was performed using Python v. 3.10.5 (Python Software Foundation, Beaverton, OR 97008-7105, USA) and the scikit-learn library [ 48 3. Results 3.1. Morphology, Anatomy, and Histochemistry At the end of each of the two 10-day thermal stress experiments, both the plants cultivated at 22 °C (P22) and those cultivated at 35 °C (P35) were dried and weighed to determine their dry mass. As indicated in Table 1 Figure 2 The cells of the palisade parenchyma are accommodated in a single, distinct layer occupying less than 50% of the width of the mesophyll. A not-always-discernible subjacent second inner layer of the short, palisade-like cells can usually be observed ( Figure 2 Uncommonly for a xerophyte, none of the epidermal cells seem to accumulate secondary metabolites, since no traits of enclosed osmiophilic materials were observed in the epidermal cells of both leaf types ( Figure 2 Figure 2 The structure of the primary roots does not seem to present any differences ( Figure 2 Figure 2 The histochemical reagents, applied for testing metabolite accumulation in the plastic-embedded leaf tissue, did not give any positive reaction for either of the leaf types in either experiment ( Figure 3 A histochemical investigation was also executed for testing metabolite accumulation in the sections of plastic-embedded root tissue. No proteins ( Figure 4 Figure 4 Figure 4 Interesting micrographs were obtained after observing the leaf tissues in a scanning electron microscope. The adaxial (upper) surfaces of the two leaf types appear rather similar. They do not possess trichomes ( Figure 5 2 2 Table 2 10 49 Figure 5 The abaxial (lower) surface is loaded with two types of trichomes: elongated, multicellular, uniseriate acute trichomes; shorter, pilate, glandular trichomes ( Figure 5 Figure 5 As demonstrated in Table 2 Table 2 Figure 5 3.2. Physiology Figure 6 Exposure to elevated temperature (35 °C) resulted in significant physiological alterations in plants compared to those grown at 22 °C. Notably, there was a marked reduction in photosynthetic pigments, with chlorophyll-a, chlorophyll-b, and carotenoids in leaves decreasing by 33.0%, 32.0%, and 23.9%, respectively, indicating impaired photosynthetic efficiency. Oxidative stress responses seem to be organ-specific; malondialdehyde (MDA) and hydrogen peroxide (H 2 2 To reduce dimensionality and visualize multi-variation, PCA was conducted separately on biochemical parameters measured in leaves and roots. For each dataset, variables were centered and scaled prior to PCA. The first two principal components (PC1 and PC2) were retained and, together, they explain a substantial proportion of the total variance (see axis labels for exact percentages). In the leaf PCA biplot ( Figure 7 2 2 2 2 2 2 The root PCA biplot ( Figure 8 2 2 2 2 2 2 2 2 Vector directions represent the influence of each variable on the principal components, while vector lengths approximate the variance explained by each. These biplots thus highlight how stress biomarkers and metabolites vary and co-vary differently in leaves and roots, suggesting organ-specific biochemical responses. 3.3. Cytotoxicity Assays Figure 9 50 50 50 50 50 50 50 Figure 9 Figure 9 Overall, in MCF-7 cells, both extracts demonstrated a concentration-dependent cytotoxic effect, with P22 generally showing higher potency at mid-to-high concentrations, while P35 induced greater ROS production, particularly at intermediate doses. This suggests that heat stress may enhance oxidative-stress-related pathways without necessarily increasing the overall cytotoxic potency in this cell line. Examining the data on the cytotoxic effect of methanolic extracts in DU-145 (human prostate cancer cell line), Figure 10 50 50 In the ROS analysis ( Figure 10 Generally, in DU-145 cells, P35 extract exhibited strong cytotoxicity and ROS induction at very low concentrations, but its effect declined sharply at higher doses, possibly due to compound degradation or cellular adaptation. In contrast, P22 maintained consistently cytotoxic with ROS activity across a wider concentration range, indicating a more stable bioactive profile in this cell type. In Figure 11 50 50 50 E. elaterium In our study, ROS levels were evaluated in cell lines following treatment with methanolic extracts derived from P22 and P35, across a range of concentrations. The extracts were dissolved in DMSO; as such, a DMSO-only treatment group was included as the vehicle control. We would like to highlight that DMSO is not always biologically inert. In fact, reports in the literature suggest that DMSO may itself induce oxidative stress or enhance ROS levels in certain cell types, including SH-SY5Y cells [ 50 3.4. Extraction and LC-HRMS/MS Analyses of Methanol Extracts The dried material, following pulverization, was sequentially extracted using ultrasound-assisted extraction (UAE) with dichloromethane (DCM), methanol (MeOH), and a mixture of MeOH and H 2 v v w w w w The methanol extracts of the P35 and P22 samples, which exhibited cytotoxic activity against MCF-7, SH-SY5Y, and DU-145 cancer cell lines, were subjected to UHPLC-HRMS/MS analysis, aiming to identify the metabolites that are potentially responsible for the observed bioactivity. Chromatographic and spectrometric data for all tentatively identified metabolites are summarized in Table 3 The majority of the compounds were annotated based on high-resolution tandem mass spectrometry (HRMS/MS) data acquired in negative ionization mode, as this ionization mode yielded a more informative and richer profile. Positive ion mode data were selectively used for compounds that were poorly ionized in negative ion mode, thereby ensuring comprehensive chemical characterization. LC-HRMS and HRMS/MS analyses revealed that both extracts (P22 and P35) exhibited qualitatively similar profiles, comprising a diverse array of secondary metabolites, including triterpenoids and their glycosylated derivatives, flavonoid glycosides, and various lipid classes such as sphingolipids, glycerolipids, glycerophospholipids, and glycolipids ( Table 3 A total of 49 secondary metabolites were detected, of which 38 were tentatively annotated. Among them, as shown in the base peak (BP) chromatogram acquired in negative ion mode ( Figure 12 − m z − m z − m z − m z − m z − m z − m z − m z − m z − m z In the positive ion mode, the predominant compounds in both extracts were sphingolipids, which produced intense signals that, in some cases, suppressed the ionization of other analytes. For this reason, the BPC from negative ion mode was selected for visualization ( Figure 12 HRMS/MS fragmentation analysis confirmed the structural characteristics of multiple Cucurbitacin-type triterpenoids and their corresponding glycosides beyond the major compounds reported above. Several Cucurbitacins were detected, including Cucurbitacins E ([M+FA-H] − m z − m z + m z + m z − m z − m z − m z − m z − m z − m z − m z Quantitative assessments based on peak area comparisons between P22 and P35 extracts revealed a general trend of reduced metabolite abundance in the P35 sample. However, several notable exceptions were observed. Specifically, Cucurbitacins B ([M+FA-H] − m z − m z + m z − m z − m z − m z − m z − m z − m z − m z + m z + m z These findings suggest that specific metabolite classes, particularly Cucurbitacins and glycerolipids, may be upregulated in response to stress and potentially linked to the observed cytotoxic effects. 4. Discussion 4.1. Morphology Most of the morphological and anatomical observations indicate that there are no major differences between the two plant types, although the dry mass of P35 (1.7 ± 0.3 g) is significantly lower compared to that of P22 (2.8 ± 0.4 g). This difference can be attributed to the higher temperature the plants in the P35 group were exposed to. This probably indicates a suppression of the metabolism of these plants, common to most plants under heat stress; since dry mass accumulation reflects the integrated photosynthesis rate and because the combination of drought and heat stress adversely affects photosynthesis, overall plant dry mass is consequently reduced [ 58 2 2 59 60 61 Another interesting feature and a major difference between the two leaf types has to do with the stomata and the hair cover. Both leaf types are amphistomatic. This is common in most xerophytes. Having stomata on both sides facilitates the rapid gas circulation within the leaf and the exchange during the short periods of moderate environmental conditions that favor photosynthesis [ 62 63 64 2 2 65 66 2 67 It is also very strange that the number of glandular capitate trichomes, present only on the abaxial surfaces of the leaves [ 68 Table 2 69 70 71 72 72 Rhododendron hybridum 72 73 Following another investigation [ 74 Brassica campestris The primary root structure appeared to be consistent between P22 and P35, with equally developed conductive tissues and similarly sized parenchyma cells in the cortex. No qualitative anatomical differences were noted, suggesting that root structure is relatively stable and less sensitive to variation in growth temperature. This stability may reflect the roots’ critical role in water and nutrient uptake, where maintaining structural integrity is essential regardless of the environmental temperature conditions experienced during growth; temperature fluctuations in the soil are far less pronounced than those above ground. Concerning differences of leaf and root structure, when compared between the two plant types, it seems negligible. The leaves and the roots are similarly developed, while secondary metabolites common in water or temperature stressed plants are practically absent. Furthermore, the absence of storage compounds ( Figure 3 Figure 4 Concluding our approach to heat stress, we may say that—although heat stress was reported to increase leaf thickness, close some of the stomata, and decrease leaf area index, vein area, and stomatal density (the reactions needed to overcome water loss through transpiration)—the plant responses are genotype-specific. Wild plants, like Ecballium elaterium Anatomical observations suggest that plants grown at higher temperatures (P35) adjust their epidermal traits toward water conservation, as indicated by reduced stomatal density, but at the potential cost of diminished chemical and trichome-based protective capacity. In contrast, plants in the P22 group maintain higher stomatal densities and abundant glandular trichomes, which may support higher photosynthetic rates and stronger defense capabilities under more moderate growth conditions. Overall, growth temperature appears to influence external protective and regulatory features far more than internal leaf or root anatomy. It should be noted that under, balanced conditions of water availability, temperature, and light, leaf anatomy itself—particularly the thickness and differentiation between palisade and spongy parenchyma—is a key determinant of photosynthetic performance. In contrast, under field conditions, plants often experience combined stressors (e.g., heat, drought, and high irradiance), where the interaction between anatomical traits and environmental limitations (such as stomatal closure) further shapes photosynthetic efficiency. This distinction is important for interpreting our results in both controlled and natural contexts. 4.2. On the Plant Function The PCA analyses of P22 and P35 Ecballium elaterium Figure 7 2 2 Figure 7 2 2 Indeed, L-proline functions as an osmolyte, keeping the redox equilibrium, via its role as a ROS scavenger [ 75 76 77 2 2 78 Figure 6 2 2 2 2 75 76 77 79 Medicago sativa 80 81 82 83 84 2 2 85 86 87 80 88 88 89 90 91 92 93 94 In contrast to the multifaceted response observed in leaves, the root tissue exhibited a more integrated and tightly coordinated biochemical response to heat stress. The root PCA revealed a more integrated response. MDA and H 2 2 Figure 8 2 2 2 2 Figure 6 The implementation of our findings supports the notion that leaves and roots employ organ-specific strategies to manage heat stress, shaped by their distinct physiological roles and environmental exposures. Leaves seem to suffer more stress than roots, showing more pronounced and compartmentalized biochemical disruption, likely due to the direct impact of stress on the photosynthetic machinery and energy metabolism. In leaves, MDA showed a distinct vector orientation and dominated PC1, suggesting a strong and unique oxidative stress response. Furthermore, the low collinearity between MDA and H 2 2 2 2 4.3. Bioassays and LC-HRMS Analysis The aim of our bioassays was to assess whether the secondary metabolites in the plant’s leaves, produced during thermal stress, may exert cytotoxic effects on cell lines in vitro E. elaterium 94 95 96 97 in vitro E. elaterium 18 98 In our study, the cytotoxic responses to methanolic extracts from Ecballium elaterium Figure 10 Figure 9 Figure 11 99 100 101 102 103 104 These findings suggest that thermal stress alters the phytochemical composition of E. elaterium LC-HRMS/MS analysis revealed that the predominant constituents in both methanolic extracts (P22 and P35) were Cucurbitacins and their glycosides, comprising 22 of the 38 tentatively annotated compounds. Cucurbitacins are highly oxygenated tetracyclic triterpenoids, widely distributed in plants of the Cucurbitaceae family, including Ecballium elaterium 21 21 98 99 105 70 70 n E. elaterium 18 106 107 E. elaterium In P22, the most abundant Cucurbitacins were Cucurbitacin I and its 2-O-glucopyranoside. In contrast, P35 was enriched in Cucurbitacin I 2-O-glucopyranoside, Elaterinide (Cucurbitacin E 2-O-glucopyranoside), and Arvenin I (Cucurbitacin B 2-O-glucopyranoside) ( Figure 13 Cucurbitacin I has been shown to exert antiproliferative and cytotoxic activity against a range of cancer types, including breast (MCF-7) cells [ 18 21 108 109 Cucurbitacin B, found at significantly higher levels in P35, is among the most studied Cucurbitacins for its anticancer potential. It has been demonstrated to reduce viability in various breast cancer cell lines (MDA-MB-231, SKBR3, MCF-7, 4T1) in a dose- and time-dependent manner (IC 50 110 2 111 112 113 107 114 115 Cucurbitacin E, also more abundant in P35, has exhibited strong cytotoxicity against prostate cancer cells (IC 50 115 116 Although most studies focus on Cucurbitacin aglycones, emerging evidence supports the biological activity of their glycosides. However, existing evidence supports their bioactivity. Arvenin I showed moderate cytotoxicity against MCF-7 cells [ 117 57 118 119 For future studies, targeted isolation of the metabolites that are found to be upregulated under stress conditions should be prioritized. Isolation of these compounds will enable more confident structural elucidation, including validation with authentic standards when available, and direct evaluation of their cytotoxic activity against cancer cell lines, providing clearer insights into their individual bioactivities. Additionally, testing isolated compounds both individually and in combination will enable the assessment of potential synergistic or antagonistic interactions, which is essential for understanding the overall therapeutic potential of Ecballium In summary, the higher cytotoxic activity of the P35 extract against DU-145 prostate cancer cells can be attributed to its elevated levels of Cucurbitacin B, Cucurbitacin E, and their glycosylated forms, including Arvenin I, Arvenin II, and Elaterinide. Additionally, the presence of Cucurbitacin S, although not yet characterized in these models, may further enhance this activity. The overall high relative abundance of Cucurbitacins, compounds with well-established cytotoxic properties, in both extracts likely explains why both P22 and P35 are active against all three cancer cell lines. These findings reinforce the therapeutic promise of Cucurbitacins as pharmacological agents in cancer prevention and treatment. 5. Conclusions The combined morphological, physiological, and biochemical analyses of P35 Ecballium elaterium 2 2 2 2 From a pharmacological standpoint, heat stress significantly influenced the phytochemical profile of E. elaterium 50 Analyses via LC-HRMS profiling confirmed Cucurbitacins and their glycosides as the principal bioactive constituents, with distinct compositions between P22 and P35. This remarkable biochemical plasticity underscores how environmental stress not only shapes plant morphology and physiology but also alters secondary metabolite profiles in ways that significantly impact bioactivity. Consequently, plants’ stress conditions may offer a novel approach both to plant stress biology and to optimizing the therapeutic potential of medicinal plants based on targeted cytotoxic applications. Acknowledgments The authors would like to thank the European Union and specifically the GreenCosmIn project “Green chemistry and biotechnology approaches for the development of nature-based cosmetics” (HORIZON-MSCA-2022-SE-01, proposal number 101131346) for the support. The authors also deeply thank Maria Triantaphyllou and Elisavet Skampa (National and Kapodistrian University of Athens, Department of Geology and Geoenvironment, Laboratory of Historical Geology and BioGeosciences) for providing the JEOL JSM 6360 Scanning Electron Microscope facilities,and Athanassios D. Velentzas for technical assistance. Disclaimer/Publisher’s Note: Supplementary Materials The following supporting information can be downloaded at: https://www.mdpi.com/article/10.3390/metabo15090585/s1 Author Contributions Conceptualization, M.H., N.S.C. and D.V.; methodology, A.L.S., M.C., E.B., K.M. and P.S.; software, D.G., M.C. and A.L.S.; validation, M.H., N.S.C. and D.V.; formal analysis, A.L.S., M.C., E.B., K.M., D.P., P.S. and D.G.; investigation, A.L.S., M.C., E.B., K.M., D.P., P.S. and D.G.; resources, M.H., N.S.C. and D.V.; data curation, M.H., N.S.C. and D.V.; writing—original draft preparation, A.L.S., M.C., E.B., K.M., D.P., D.G. and P.S.; writing—review and editing, M.H., N.S.C., D.V., A.L.S. and M.C.; visualization, M.H., N.S.C. and D.V.; supervision, M.H., N.S.C. and D.V.; project administration, M.H., N.S.C. and D.V.; funding acquisition, M.H., N.S.C. and D.V. All authors have read and agreed to the published version of the manuscript. Institutional Review Board Statement Not applicable. Informed Consent Statement Not applicable. Data Availability Statement The original contributions presented in this study are included in the article/ Supplementary Materials Conflicts of Interest The authors declare no conflicts of interest. Views and opinions expressed are, however, those of the authors only and do not necessarily reflect those of the European Union and the European Research Executive Agency (REA). Neither the European Union nor the granting authority can be held responsible for them. References 1. Dafni A. Benítez G.C. Blanché C. Laca L.R. Petanidou T. Aytaç B. Horvat M. Lucchese F. Geva Kleinberger A. The etymological, ecological, historical and ethnobotanical roots of the vernacular names of Ecballium elaterium J. Ethnobiol. Tradit. Med. 2013 119 515 537 2. Muftah S.A. Almajberi S.A. Mohamed O.S. Altayar M.A. Nasib M.A. Attitalla I.H. Al Hejazi I.O.A. Elmhdwi M.F. Anti-bacterial screening and antioxidant and free radical scavenging activity of Ecballium elaterium Afr. J. Basic Appl. Sci. 2013 5 276 283 3. Costich D.E. Gender specialization across a climatic gradient: Experimental comparison of monoecious and dioecious Ecballium Ecology 1995 76 1036 1050 10.2307/1940914 4. Fahn A. Shimony C. Nectary structure and ultrastructure of unisexual flowers of Ecballium elaterium Ann. Bot. 2001 87 27 33 10.1006/anbo.2000.1287 5. Ielciu I.I. Frédérich M. Tits M. Angenot L. Păltinean R. Cieckiewicz E. Crișan G. Vlase L. Bryonia alba Ecballium elaterium Farmacia 2016 64 323 332 6. Mitrakos K. A theory for Mediterranean plant life Acta Oecol. Oecol. Plant. 1980 1 245 252 7. Christodoulakis N.S. Mitrakos K. Structural analysis of sclerophylly in eleven evergreen phanerophytes in Greece Plant Response to Stress: Functional Analysis in Mediterranean Ecosystems Tenhunen J.D. Catavino F.M. Lange O.L. Oechel W.C. Springer Berlin/Heidelberg, Germany 1987 547 551 8. Christodoulakis N.S. Fasseas C. Air pollution effects on the leaf structure of Laurus nobilis Bull. Environ. Contam. Toxicol. 1990 44 276 281 10.1007/BF01700147 2322669 9. Christodoulakis N.S. Kogia D. Mavroeidi D. Fasseas C. Anatomical and cytochemical investigation on the leaf of Teucrium polium J. Biol. Res. 2010 14 199 209 10. Christodoulakis N.S. Kollia K. Fasseas C. Leaf structure and histochemistry of Ecballium elaterium Flora 2011 206 191 197 10.1016/j.flora.2010.03.004 11. Mamoucha S. Fokialakis N. Christodoulakis N.S. Leaf structure and histochemistry of Ficus carica Flora 2015 218 24 34 10.1016/j.flora.2015.11.003 12. Stefi A.L. Mitsigiorgi K. Vassilacopoulou D. Christodoulakis N.S. Response of young Nerium oleander Planta 2020 251 110 10.1007/s00425-020-03405-2 32462472 13. Stefi A.L. Christodoulakis N.S. Approaching the “secrets” of the resin ducts in the mastic tree ( Pistacia lentiscus Flora 2021 285 151940 10.1016/j.flora.2021.151940 14. Stefi A.L. Kalouda G. Skouroliakou A.S. Vassilacopoulou D. Christodoulakis N.S. The counteraction of cultivated Cistus creticus Biophysica 2022 2 248 265 10.3390/biophysica2030024 15. Dioscorides The Greek Herbal of Dioscorides 1st ed. Gunther R.T. Hafner Publishing Company New York, NY, USA 1959 16. Theophrastus Enquiry into Plants Hort A.F. Harvard University Press Cambridge, MA, USA 1916 Volume I 17. Pliny the Elder Natural History Book XX, Chapter 3, Section 85 Rackham H. Harvard University Press Cambridge, MA, USA 1938 18. Yılmaz K. Karakuş F. Eyol E. Tosun E. Yılmaz İ. Ünüvar S. Cytotoxic effects of cucurbitacin I and Ecballium elaterium Nat. Prod. Commun. 2018 13 1445 1448 10.1177/1934578X1801301108 19. Oskoui M.T. Cycloeucalenol from the leaves of Ecballium elaterium Planta Med. 1986 52 159 10.1055/s-2007-969107 20. Jafargholizadeh N. Zargar S.J. Yassa N. Tavakoli S. Purification of cucurbitacins D, E, and I from Ecballium elaterium Asian Pac. J. Cancer Prev. 2016 17 4631 4635 10.22034/apjcp.2016.17.10.4631 27892675 PMC5454608 21. Anzano A. de Falco B. Grauso L. Lanzotti V. Squirting cucumber, Ecballium elaterium Molecules 2024 29 4377 10.3390/molecules29184377 39339372 PMC11434464 22. Lefebvre G. Redmond L. Germain C. Palazzi E. Terzago S. Willm L. Poulin B. Predicting the vulnerability of seasonally-flooded wetlands to climate change across the Mediterranean Basin Sci. Total Environ. 2019 692 546 555 10.1016/j.scitotenv.2019.07.263 31351296 23. Noto L.V. Cipolla G. Pumo D. Francipane A. Climate change in the Mediterranean Basin (Part II): A review of challenges and uncertainties in climate change modeling and impact analyses Water Resour. Manag. 2023 37 2307 2323 10.1007/s11269-023-03444-w PMC9891896 40478137 24. OBrien T.P. McCully M.E. The Study of Plant Structure Principles and Selected Methods Termarcarphi Pty. Ltd. Melbourne, Australia Scientific Research Publishing Irvine, CA, USA 1981 Available online: https://www.scirp.org/reference/referencespapers?referenceid=1453666 (accessed on 22 May 2025) 25. Christodoulakis N.S. Kotsironi K. Tsafantakis N. Stefi A.L. Fokialakis N. Leaf structure and phytochemical analysis of Aristolochia baetica J. Herbs Spices Med. Plants 2019 25 88 103 10.1080/10496475.2019.1572685 26. Bronner R. Simultaneous demonstration of lipids and starch in plant tissues Stain Technol. 1975 50 1 4 10.3109/10520297509117023 46630 27. Mowry R.W. Alcian blue techniques for the histochemical study of acidic carbohydrates J. Histochem. Cytochem. 1956 4 407 411 28. Fisher D.B. Protein staining of ribboned Epon sections for light microscopy Histochemie 1968 16 92 96 10.1007/BF00306214 4180491 29. Gechev T. Mehterov N. Denev I. Hille J. A simple and powerful approach for isolation of Arabidopsis 2 2 Methods in Enzymology Walker J.M. Academic Press San Diego, CA, USA 2013 Volume 527 203 220 10.1016/B978-0-12-405882-8.00011-8 23830633 30. Lichtenthaler H.K. Buschmann C. Determinations of total carotenoids and chlorophylls a and b of leaf extracts in different solvents Biochem. Soc. Trans. 1983 11 591 592 Available online: https://www.researchgate.net/publication/313724134 (accessed on 25 May 2025) 10.1042/bst0110591 31. Sarropoulou V. Sarrou E. Angeli A. Martens S. Maloupa E. Grigoriadou K. Developing an in vitro Primula veris veris. Ind. Crops Prod. 2023 197 116618 10.1016/j.indcrop.2023.116618 32. Taulavuori E. Hellström E.K. Taulavuori K. Laine K. Comparison of two methods used to analyse lipid peroxidation from Vaccinium myrtillus J. Exp. Bot. 2001 52 2375 2380 10.1093/jexbot/52.365.2375 11709587 33. Velikova V. Yordanov I. Edreva A. Oxidative stress and some antioxidant systems in acid rain-treated bean plants: Protective role of exogenous polyamines Plant Sci. 2000 151 59 66 10.1016/S0168-9452(99)00197-1 34. Xu J. Duan X. Yang J. Beeching J.R. Zhang P. Enhanced reactive oxygen species scavenging by overproduction of superoxide dismutase and catalase delays postharvest physiological deterioration of cassava storage roots Plant Physiol. 2013 161 1517 1528 10.1104/pp.112.212803 23344905 PMC3585613 35. Singleton V.L. Rossi J.A. Colorimetry of total phenolics with phosphomolybdic-phosphotungstic acid reagents Am. J. Enol. Vitic. 1965 16 144 158 10.5344/ajev.1965.16.3.144 36. Waterman P.G. Mole S. Analysis of Phenolic Plant Metabolites Blackwell Scientific Publications Oxford, UK 1994 73 99 Available online: https://www.scirp.org/reference/referencespapers?referenceid=2597356 (accessed on 29 May 2025) 37. Stefi A.L. Chalkiadaki M. Dimitriou K. Mitsigiorgi K. Gkikas D. Papageorgiou D. Ntroumpogianni G.C. Vassilacopoulou D. Halabalaki M. Christodoulakis N.S. Oregano young plants cultured at low temperature reveal an enhanced healing effect of their extracts: Anatomical, physiological and cytotoxicity approach Metabolites 2025 15 103 10.3390/metabo15020103 39997728 PMC11857167 38. Dubois M. Gilles K.A. Hamilton J.K. Rebers P.A. Smith F. Colorimetric method for determination of sugars and related substances Anal. Chem. 1956 28 350 356 10.1021/ac60111a017 39. Buysse J. Merckx R. An improved colorimetric method to quantify sugar content of plant tissue J. Exp. Bot. 1993 4 1627 1629 10.1093/jxb/44.10.1627 40. Bates L.S. Waldren R.P. Teare I.D. Rapid determination of free proline for water studies Plant Soil 1973 39 205 207 10.1007/BF00018060 41. Ain-Lhout F. Zunzunegui M. Barradas M.D. Tirado R. Clavijo A. Novo F.G. Comparison of proline accumulation in two Mediterranean shrubs subjected to natural and experimental water deficit Plant Soil 2001 230 175 183 10.1023/A:1010387610098 42. Pouris J. Meletiou-Christou M.S. Chimona C. Rhizopoulou S. Seasonal functional partitioning of carbohydrates and proline among plant parts of the sand daffodil Agronomy 2020 10 539 10.3390/agronomy10040539 43. Kovalevich J. Langford D. Considerations for the use of SH-SY5Y neuroblastoma cells in neurobiology Methods in Molecular Biology Humana Press Totowa, NJ, USA 2013 Volume 1078 9 21 10.1007/978-1-62703-640-5_2 PMC5127451 23975817 44. Comşa Ş. Cimpean A.M. Raica M. The story of MCF-7 breast cancer cell line: 40 years of experience in research Anticancer Res. 2015 35 3147 3154 26026074 45. Dini L. Apoptosis induction in DU-145 human prostate carcinoma cells Tissue Cell 2005 37 379 384 10.1016/j.tice.2005.06.006 16137730 46. Stefi A.L. Margaritis L.H. Skouroliakou A.S. Vassilacopoulou D. Mobile phone electromagnetic radiation affects amyloid precursor protein and α-synuclein metabolism in SH-SY5Y cells Pathophysiology 2019 26 203 212 10.1016/j.pathophys.2019.02.004 30850244 47. Crowley L.C. Marfell B.J. Christensen M.E. Waterhouse N.J. Measuring cell death by trypan blue uptake and light microscopy Cold Spring Harb. Protoc. 2016 2016 643 646 10.1101/pdb.prot087155 27371594 48. Pedregosa F. Varoquaux G. Gramfort A. Michel V. Thirion B. Grisel O. Blondel M. Prettenhofer P. Weiss R. Dubourg V. Scikit-learn: Machine learning in Python arXiv 2012 1201.0490 49. Metcalfe C.R. Chalk L. Anatomy of Dicotyledons 2nd ed. Clarendon Press Oxford, UK 1979 456 473 50. Bansal S. Wang B. A critical factor in reactive oxygen species (ROS) studies: The need to understand the chemistry of the solvent used: The case of DMSO Chem. Sci. 2024 15 17843 17851 10.1039/D4SC05038J 39397818 PMC11469295 51. Ren K. Kong W. Tang T. Cheng H. Identification of CmACL Front. Plant Sci. 2023 14 1239482 10.3389/fpls.2023.1239482 37655221 PMC10465347 52. Ul Haq F. Ali A. Khan M.N. Shah S.M.Z. Kandel R.C. Aziz N. Adhikari A. Choudhary M.I. ur-Rahman A. El-Seedi H.R. Metabolite profiling and quantitation of cucurbitacins in Cucurbitaceae plants by liquid chromatography coupled to tandem mass spectrometry Sci. Rep. 2019 9 15992 10.1038/s41598-019-52404-1 31690753 PMC6831693 53. Bourebaba L. Gilbert-Lopez B. Oukil N. Bedjou F. Phytochemical composition of Ecballium elaterium Arab. J. Chem. 2018 13 3286 3300 10.1016/j.arabjc.2018.11.004 54. Chen J.C. Chiu M.H. Nie R.L. Cordell G.A. Qiu S.X. Cucurbitacins and cucurbitane glycosides: Structures and biological activities Nat. Prod. Rep. 2005 22 386 399 10.1039/b418841c 16010347 55. Sayed Z. Badr W. Cucurbitacin glucosides and biological activities of the ethyl acetate fraction from ethanolic extract of Egyptian Ecballium elaterium J. Appl. Sci. Res. 2012 8 1252 1258 56. Chen C. Qiang S. Lou L. Zhao W. Cucurbitane-type triterpenoids from the stems of Cucumis melo J. Nat. Prod. 2009 72 824 829 10.1021/np800692t 19348465 57. Takemoto M. Delghandi S. Abo M. Yurimoto K. Odagi M. Singh V.P. Wang J. Nakagawa R. Sato S. Takemoto Y. Covalent plant natural product that potentiates antitumor immunity J. Am. Chem. Soc. 2025 147 2902 2912 10.1021/jacs.4c17837 39794153 58. Cohen I. Zandalinas S.I. Huck C. Fritschi F.B. Mittler R. Meta-analysis of drought and heat stress combination impact on crop yield and yield components Physiol. Plant. 2020 171 66 76 10.1111/ppl.13203 32880977 59. Kong X. Liu G. Liu J. Ding Z. The root transition zone: A hot spot for signal crosstalk Trends Plant Sci. 2018 23 403 409 10.1016/j.tplants.2018.02.004 29500073 60. Saab I.M. Sharp R.E. Pritchard J. Voetberg G.S. Increased endogenous abscisic acid maintains primary root growth and inhibits shoot growth of maize seedlings at low water potentials Plant Physiol. 1990 93 1329 1336 10.1104/pp.93.4.1329 16667621 PMC1062676 61. Ober E.S. Sharp R.E. Electrophysiological responses of maize roots to low water potentials: Relationship to growth and ABA accumulation J. Exp. Bot. 2003 54 813 824 10.1093/jxb/erg060 12554724 62. Parkhurst D.F. The adaptive significance of stomatal occurrence on one or both surfaces of leaves J. Ecol. 1978 66 367 383 10.2307/2259142 63. Parkhurst D.F. Mott K.A. Intercellular diffusion limits to CO 2 Plant Physiol. 1990 94 1024 1032 10.1104/pp.94.3.1024 16667792 PMC1077337 64. Drake P.L. de Boer H.J. Schymanski S.J. Veneklaas E.J. Two sides to every leaf: Water and CO 2 New Phytol. 2019 222 1179 1187 10.1111/nph.15652 30570766 65. Asargew M.F. Masutomi Y. Kobayashi K. Aono M. Water stress changes the relationship between photosynthesis and stomatal conductance Sci. Total Environ. 2023 907 167886 10.1016/j.scitotenv.2023.167886 37858817 66. Pirasteh-Anosheh H. Saed-Moucheshi A. Pakniyat H. Pessarakli M. Stomatal responses to drought stress Water Stress and Crop Plants Wiley-Blackwell Hoboken, NJ, USA 2016 24 40 67. Flexas J. Ribas-Carbó M. Bota J. Galmés J. Henkle M. Martínez-Cañellas S. Medrano H. Decreased Rubisco activity during water stress is not induced by decreased relative water content but related to conditions of low stomatal conductance and chloroplast CO 2 New Phytol. 2006 172 73 82 10.1111/j.1469-8137.2006.01794.x 16945090 68. Siebert D.J. Localization of salvinorin A and related compounds in glandular trichomes of the psychoactive sage, Salvia divinorum Ann. Bot. 2004 93 763 771 10.1093/aob/mch089 15087301 PMC4242294 69. Demir M. Taylan M. Kaya H. Ekinci A. Arslan D. Aslan E. Keles A. Yılmaz S. Sezgi C. Histopathological and biochemical effects of Ecballium elaterium J. Investig. Surg. 2016 29 302 308 10.3109/08941939.2015.1111474 26822342 70. Hussain H. Green I.R. Saleem M. Khattak K.F. Irshad M. Ali M. Cucurbitacins as Anticancer Agents: A Patent Review Recent Pat. Anti-Cancer Drug Discov. 2019 14 133 143 10.2174/1574892813666181119123035 30451116 71. Mukhtar T. Rehman S.U. Smith D. Sultan T. Seleiman M.F. Alsadon A.A. Amna Ali S. Chaudhary H.J. Solieman T.H.I. Mitigation of heat stress in Solanum lycopersicum Bacillus cereus Sustainability 2020 12 2159 10.3390/su12062159 72. Shen H. Zhao B. Xu J. Liang W. Huang W. Li H. Effects of heat stress on changes in physiology and anatomy in two cultivars of Rhododendron S. Afr. J. Bot. 2017 112 338 345 10.1016/j.sajb.2017.06.018 73. Yang D. Qiu H. Pei Y. Hu S. Ma S. Liu Z. Zhang Y. Cao M. Spatial and temporal evolution of the infiltration characteristics of a loess landslide ISPRS Int. J. Geo-Inf. 2020 9 26 10.3390/ijgi9010026 74. Yuan L. Tang L. Zhu S. Hou J. Chen G. Liu F. Liu S. Wang C. Influence of heat stress on leaf morphology and nitrogen–carbohydrate metabolisms in two wucai ( Brassica campestris Acta Soc. Bot. Pol. 2017 86 3587 10.5586/asbp.3554 75. Matysik J. Alia Bhalu B. Mohanty P. Molecular mechanisms of quenching of reactive oxygen species by proline under stress in plants Curr. Sci. 2002 82 525 532 76. Meena M. Divyanshu K. Kumar S. Swapnil P. Zehra A. Shukla V. Yadav M. Upadhyay R.S. Regulation of L-proline biosynthesis, signal transduction, transport, accumulation and its vital role in plants during variable environmental conditions Heliyon 2019 5 e02952 10.1016/j.heliyon.2019.e02952 31872123 PMC6909094 77. Zulfiqar F. Ashraf M. Proline alleviates abiotic stress-induced oxidative stress in plants J. Plant Growth Regul. 2023 42 4629 4651 10.1007/s00344-022-10839-3 78. Khan P. Abdelbacki A.M.M. Albaqami M. Jan R. Kim K.-M. Proline promotes drought tolerance in maize Biology 2025 14 41 10.3390/biology14010041 39857272 PMC11762158 79. Singh P.K. Tewari R.K. Cadmium toxicity induced changes in plant water relations and oxidative metabolism of Brassica juncea J. Environ. Biol. 2003 24 107 112 12974420 80. Afzal S. Chaudhary N. Singh N.K. Role of soluble sugars in metabolism and sensing under abiotic stress Plant Growth Regulators Aftab T. Hakeem K.R. Springer Cham, Switzerland 2021 81. Farooq M. Hussain M. Ul-Allah S. Siddique K.H. Physiological and agronomic approaches for improving water-use efficiency in crop plants Agric. Water Manag. 2019 219 95 108 10.1016/j.agwat.2019.04.010 82. Kaushal N. Gupta K. Bhandhari K. Kumar S. Thakur P. Nayyar H. Proline induces heat tolerance in chickpea ( Cicer arietinum Physiol. Mol. Biol. Plants 2011 17 203 213 10.1007/s12298-011-0078-2 23573011 PMC3550571 83. Jahan M.S. Wang Y. Shu S. Zhong M. Chen Z. Wu J. Sun J. Guo S. Exogenous salicylic acid increases the heat tolerance in tomato ( Solanum lycopersicum Sci. Hortic. 2019 247 421 429 10.1016/j.scienta.2018.12.047 84. Wassie M. Zhang W. Zhang Q. Ji K. Cao L. Chen L. Exogenous salicylic acid ameliorates heat stress-induced damages and improves growth and photosynthetic efficiency in alfalfa ( Medicago sativa Ecotoxicol. Environ. Saf. 2020 191 110206 10.1016/j.ecoenv.2020.110206 31954923 85. Zahra N. Hafeez M.B. Ghaffar A. Kausar A. Zeidi M.A. Siddique K.H. Farooq M. Plant photosynthesis under heat stress: Effects and management Environ. Exp. Bot. 2022 206 105178 10.1016/j.envexpbot.2022.105178 86. Sun T. Rao S. Zhou X. Li L. Plant carotenoids: Recent advances and future perspectives Mol. Hortic. 2022 2 3 10.1186/s43897-022-00023-2 37789426 PMC10515021 87. Hu S. Ding Y. Zhu C. Sensitivity and responses of chloroplasts to heat stress in plants Front. Plant Sci. 2020 11 375 10.3389/fpls.2020.00375 32300353 PMC7142257 88. Bolouri-Moghaddam M.R. Le Roy K. Xiang L. Rolland F. Van den Ende W. Sugar signalling and antioxidant network connections in plant cells FEBS J. 2010 277 2022 2037 10.1111/j.1742-4658.2010.07633.x 20412056 89. Hussin S. Geissler N. Koyro H.W. Effect of NaCl salinity on Atriplex nummularia Acta Physiol. Plant. 2013 35 1025 1038 10.1007/s11738-012-1141-5 90. Tejera N.A. Soussi M. Lluch C. Physiological and nutritional indicators of tolerance to salinity in chickpea plants growing under symbiotic conditions Environ. Exp. Bot. 2006 58 17 24 10.1016/j.envexpbot.2005.06.007 91. Negro C. Tommasi L. Miceli A. Phenolic compounds and antioxidant activity from red grape marc extracts Bioresour. Technol. 2003 87 41 44 10.1016/S0960-8524(02)00202-X 12733573 92. Elavarthi S. Martin B. Spectrophotometric assays for antioxidant enzymes in plants Plant Stress Tolerance, Methods in Molecular Biology Sunkar R. Humana Press Totowa, NJ, USA 2010 Volume 639 273 281 10.1007/978-1-60761-702-0_16 20387052 93. Kumar K. Debnath P. Singh S. Kumar N. An overview of plant phenolics and their involvement in abiotic stress tolerance Stresses 2023 3 570 585 10.3390/stresses3030040 94. Raychaudhuri R. Lin D.W. Montgomery R.B. Prostate cancer: A review JAMA 2025 333 1433 1446 10.1001/jama.2025.0228 40063046 95. Hu Y. Tang J. Liu X. Sun Y. Gong B. Gao Q. Identification of the optimal candidates to benefit from surgery and chemotherapy among elderly female breast cancer patients with bone metastases Sci. Rep. 2025 15 4678 10.1038/s41598-025-89222-7 39920239 PMC11806091 96. Yu W. Biyik-Sit R. Uzun Y. Chen C.H. Thadi A. Sussman J.H. Pang M. Wu C.Y. Grossmann L.D. Gao P. Longitudinal single-cell multiomic atlas of high-risk neuroblastoma reveals chemotherapy-induced tumor microenvironment rewiring Nat. Genet. 2025 57 1142 1154 10.1038/s41588-025-02158-6 40229600 PMC12081299 97. Johnsen J.I. Dyberg C. Wickström M. Neuroblastoma—A neural crest derived embryonal malignancy Front. Mol. Neurosci. 2019 12 9 10.3389/fnmol.2019.00009 30760980 PMC6361784 98. Attard E. Use of extracts from squirting cucumber ( Ecballium elaterium Nuts and Seeds in Health and Disease Prevention Preedy V.R. Watson R.R. Patel V.B. Academic Press London, UK 2011 1079 1086 99. Verheijen M. Lienhard M. Schrooders Y. Clayton O. Nudischer R. Boerno S. Timmermann B. Selevsek N. Schlapbach R. Gmuender H. DMSO induces drastic changes in human cellular processes and epigenetic landscape in vitro Sci. Rep. 2019 9 4641 10.1038/s41598-019-40660-0 30874586 PMC6420634 100. Kaczor-Kamińska M. Kaszuba K. Bilska-Wilkosz A. Iciek M. Wróbel M. Kamiński K. Dimethyl Sulfoxide (DMSO) as a potential source of interference in research related to Sulfur Metabolism—A preliminary study Antioxidants 2024 13 582 10.3390/antiox13050582 38790687 PMC11117631 101. Dai J. Mumper R.J. Plant phenolics: Extraction, analysis and their antioxidant and anticancer properties Molecules 2010 15 7313 7352 10.3390/molecules15107313 20966876 PMC6259146 102. Maliar T. Maliarová M. Blažková M. Kunštek M. Uváčková Ľ. Viskupičová J. Purdešová A. Beňovič P. Simultaneously determined antioxidant and Pro-Oxidant activity of randomly selected plant secondary metabolites and plant extracts Molecules 2023 28 6890 10.3390/molecules28196890 37836733 PMC10574746 103. Amrati F.E.-Z. Chebaibi M. Galvão de Azevedo R. Conte R. Slighoua M. Mssillou I. Kiokias S. de Freitas Gomes A. Soares Pontes G. Bousta D. Phenolic Composition, Wound Healing, Antinociceptive, and Anticancer Effects of Caralluma europaea Molecules 2023 28 1780 10.3390/molecules28041780 36838767 PMC9961855 104. Spissu Y. Gil K.A. Dore A. Sanna G. Palmieri G. Sanna A. Cossu M. Belhadj F. Gharbi B. Pinna M.B. Anti- and Pro-Oxidant activity of polyphenols extracts of syrah and chardonnay grapevine pomaces on melanoma cancer cells Antioxidants 2022 12 80 10.3390/antiox12010080 36670942 PMC9855015 105. Kumar A. Sharma B. Sharma U. Parashar G. Parashar N.C. Rani I. Ramniwas S. Kaur S. Haque S. Tuli H.S. Apoptotic and antimetastatic effect of cucurbitacins in cancer: Recent trends and advancement Naunyn-Schmiedeberg’s Arch. Pharmacol. 2023 396 1867 1878 10.1007/s00210-023-02471-z 37010571 106. Molavi O. Torkzaban F. Jafari S. Asnaashari S. Asgharian P. Chemical compositions and anti-proliferative activity of the aerial parts and rhizomes of squirting cucumber, Cucurbitaceae Jundishapur J. Nat. Pharm. Prod. 2019 15 e82990 10.5812/jjnpp.82990 107. Zheng Q. Liu Y. Liu W. Ma F. Zhou Y. Chen M. Chang J. Wang Y. Yang G. He G. Cucurbitacin B inhibits growth and induces apoptosis through the JAK2/STAT3 and MAPK pathways in SH-SY5Y human neuroblastoma cells Mol. Med. Rep. 2014 10 89 94 10.3892/mmr.2014.2175 24789581 108. Patel A. Rasheed A. Reilly I. Pareek Z. Hansen M. Haque Z. Simon-Fajardo D. Davies C. Tummala A. Reinhardt K. Modulation of cytoskeleton, protein trafficking, and signaling pathways by metabolites from Cucurbitaceae Ericaceae Rosaceae Pharmaceuticals 2022 15 1380 10.3390/ph15111380 36355554 PMC9698530 109. Chau M.N. Banerjee P.P. Development of a STAT3 reporter prostate cancer cell line for high throughput screening of STAT3 activators and inhibitors Biochem. Biophys. Res. Commun. 2008 377 627 631 10.1016/j.bbrc.2008.10.025 18930029 PMC2617746 110. Gupta P. Srivastava S.K. Inhibition of HER2-integrin signaling by cucurbitacin B leads to in vitro Oncotarget 2014 5 1812 1828 10.18632/oncotarget.1743 24729020 PMC4039119 111. Duangmano S. Sae-Lim P. Suksamrarn A. Patmasiriwat P. Domann F.E. Cucurbitacin B causes increased radiation sensitivity of human breast cancer cells via G2/M cell cycle arrest J. Oncol. 2012 2012 601682 Erratum in J. Oncol. 2015 2015 10.1155/2015/486850 22690217 PMC3368438 112. Guo J. Wu G. Bao J. Hao W. Lu J. Chen X. Cucurbitacin B induced ATM-mediated DNA damage causes G2/M cell cycle arrest in a ROS-dependent manner PLoS ONE 2014 9 e88140 10.1371/journal.pone.0088140 24505404 PMC3913755 113. Ren G. Sha T. Guo J. Li W. Lu J. Chen X. Cucurbitacin B induces DNA damage and autophagy mediated by reactive oxygen species (ROS) in MCF-7 breast cancer cells J. Nat. Med. 2015 69 522 530 10.1007/s11418-015-0918-4 26018422 114. Zhang T. Chen X. Qu Y. Ding Y. Curcumin alleviates oxygen-glucose-deprivation/reperfusion-induced oxidative damage by regulating miR-1287-5p/LONP2 axis in SH-SY5Y cells Anal. Cell. Pathol. 2021 2021 5548706 10.1155/2021/5548706 PMC8476263 34589382 115. Duncan K.L.K. Duncan M.D. Alley M.C. Sausville E.A. Cucurbitacin E-induced disruption of the actin and vimentin cytoskeleton in prostate carcinoma cells Biochem. Pharmacol. 1996 52 1553 1560 10.1016/S0006-2952(96)00557-6 8937470 116. Huang C.-C. Balding K.K. Zimmerman S.J. Chang C.-Y. Lu S.-M. Huang H.-C. Reduction of cancer stem cells and invasiveness of human melanoma and breast cancer by cucurbitacin B from Lagenaria siceraria Drugs Drug Candidates 2023 2 19 10.3390/ddc2020019 117. Delgado-Tiburcio E.E. Cadena-Iñiguez J. Santiago-Osorio E. Ruiz-Posadas L.M. Castillo-Juárez I. Aguiñiga-Sánchez I. Soto-Hernández M. Pharmacokinetics and biological activity of cucurbitacins Pharmaceuticals 2022 15 1325 10.3390/ph15111325 36355498 PMC9696414 118. Minh C.V. Nhiem N.X. Yen H.T. Kiem P.V. Tai B.H. Le Tuan Anh H. Hien T.T.T. Park S. Kim N. Kim S.H. Chemical constituents of Trichosanthes kirilowii Arch. Pharm. Res. 2015 38 1443 1448 10.1007/s12272-014-0490-6 25630793 119. Tannin-Spitz T. Grossman S. Dovrat S. Gottlieb H.E. Bergman M. Growth inhibitory activity of cucurbitacin glucosides isolated from Citrullus colocynthis Biochem. Pharmacol. 2007 73 56 67 10.1016/j.bcp.2006.09.012 17049494 Figure 1 The experimental setup. ( a b c d Figure 2 Micrographs of cross-sections from epoxy-embedded leaves and roots stained with toluidine blue “O”. ( a b c d c d Figure 3 Micrographs of cross-sections from epoxy-embedded leaves after histochemical investigation. Upper row shows leaves from P22: ( a b c d e f Figure 4 Micrographs of cross-sections from epoxy-embedded primary roots after histochemical investigation. Upper row shows roots from P22: ( a b c d e f Figure 5 Scanning electron micrographs of the epidermal tissue. ( a b c d e f Figure 6 The bar chart titled illustrates the percentage change (positive—green bars; negative—red bars) in various physiological parameters of plants grown at 22 °C (P22) compared to those grown at 35 °C (P35). Figure 7 Principal Component Analysis (PCA) biplot of leaves. Biplot displays the first two principal components (PC1 and PC2) in leaves; PC1 primarily reflects variation in MDA and H 2 2 Figure 8 Principal Component Analysis (PCA) biplot of roots. The biplot illustrates the first two principal components in roots. MDA, TPC, and H 2 2 Figure 9 Effects of E. elaterium a 50 b n = p Figure 10 Effects of E. elaterium a 50 b n p Figure 11 Effects of E. elaterium a 50 b n p Figure 12 Overlaid base peak (BP) chromatograms from LC–HRMS analysis of the P22 (black) and P35 (blue) methanolic extracts of Ecballium elaterium Figure 13 Representative chemical structures of the predominant Cucurbitacins annotated via LC–HRMS/MS in the P22 and P35 extracts. metabolites-15-00585-t001_Table 1 Table 1 The values for total dry mass as well as the thickness of the transition zone are presented. The measured values refer to the average from both experiments. (Asterisks indicate the statistical differences between treatments; p Treatment (Both Experiments) Total Dry Mass (g) Transition Zone Diameter (mm) Ecballium elaterium 2.8 ± 0.4 * 6.96 ± 0.22 ** Ecballium elaterium 1.7 ± 0.3 * 8.26 ± 0.56 ** metabolites-15-00585-t002_Table 2 Table 2 The number of stomata and glandular trichomes on adaxial and abaxial epidermis are displayed. The measured values refer to the average from both experiments. (Asterisks indicate the statistical difference between treatments; p Treatment (Both Experiments) Number of Stomata/mm 2 Number of Stomata/mm 2 Number of Glandular Trichomes/mm 2 Ecballium elaterium 221 ± 28 * N/A 29 ± 10 ** Ecballium elaterium 119 ± 9 * 61 ± 19 2 ± 1.2 ** metabolites-15-00585-t003_Table 3 Table 3 UHPLC-HRMS/MS data of the Ecballium elaterium ID Annotated Compound Rt (min) Experimental m z − Experimental m z + Elemental Composition (EC) RDB eq. Δm (ppm) HRMS/MS Fragments References 1 Trehalose 0.92 377.0850 −  C 12 22 11 1.50 −1.73 341.1086 (100), 89.0243 (72), 179.0563 (72) 119.0352 (42), 161.0455 (33), 59.0140 (24), 101.0246 (24) 71.0139 (22), 113.0247 (20), 221.0670 (11) - 2 Unknown 0.95  323.1447 C 12 22 2 8 2.50 −0.64 239.1026 (100), 195.1127 (55), 287.1238 (47), 108.0443 (41), 150.0549 (40), 81.0335 (39), 115.0865 (37), 100.0756 (29), 225.1235 (24), 161.0920 (19), 173.0920 (15) - 3 Unknown 1.23  323.1446 C 12 22 2 8 2.50 −0.93 239.1026 (100), 195.1128 (55), 81.0334 (43), 287.1239 (40), 108.0443 (39), 150.0549 (36), 115.0865 (31), 100.0756 (30), 225.1233 (23), 161.0920 (16), 173.0921 (16), 122.0600 (15) - 4 Citric acid 1.24 191.0195  C 6 8 7 3.50 −0.94 111.0087 (100), 87.0088 (42), 85.0295 (28), 191.0198 (11) [ 51 5 Gentisic acid O-glycoside 1.91 315.0721  C 13 16 9 6.50 −0.04 152.0115 (100), 315.0721 (74), 153.0194 (50), 108.0217, (31), 109.0295 (26) - 6 Unknown 4.19 367.1605  C 15 28 10 2.50 −1.22 235.1186 (100), 101.0244 (80), 59.0138 (46), 71.0138 (44), 89.0244 (42), 161.0455 (34),131.0350 (31), 113.0244 (26), 73.0295 (18), 85.0295 (16) - 7 Megastigmane 9-O glucopyranoside 4.39 451.2180 −  C 19 34 9 3.50 −1.17 167.1078 (100), 89.0246 (77), 71.0139 (41), 101.0245 (39), 59.0139 (36), 113.0247 (31), 149.0970 (25) [ 52 8 Kaempferol 3-O diglycoside 4.56 593.1515  C 27 30 15 13.50 0.09 473.1093 (100), 503.1187 (36), 593.1496 (20) [ 52 9 Quercetin 3-O diglycoside 5.19 741.1876  C 32 38 20 14.50 −1.09 300.0273 (100), 741.1880 (41), 301.0352 (13) [ 52 10 Luteolin 8-C glycoside 5.27 447.0933  C 21 20 11 12.50 −0.53 327.0512 (100), 357.0611 (69), 285.0407 (10) [ 53 11 Rutin 5.64 609.1456  C 27 30 16 13.50 −0.99 300.0273 (100), 609.1457 (63), 301.0352 (57) [ 53 12 Kaempferol 3-O diglycoside 5.99 593.1513  C 27 30 15 13.50 0.19 285.0403 (100), 284.0327 (61), 593.1509 (45) [ 53 13 Narcissin 6.08 623.1616  C 28 32 16 13.50 −0.12 315.0509 (100), 314.0431 (41), 623.1614 (20) - 14 Khekadaengoside K 6.68 561.2701  C 30 42 10 10.50 −0.68 561.2705 (100), 398.2093 (40), 399.2171 (35), 543.2598 (30) [ 52 15 Cucurbitacin J 2-O glucopyranoside 6.70 693.3488  C 36 54 13 10.50 −0.59 605.2968 (100), 425.2329 (63), 675.3386 (28), 443.2439 (16), 101.0608 (14), 341.1765 (13), 383.2227 (13), 587.2856 (12), 513.2847 (12), 495.2741 (12), 657.3276 (11) [ 54 16 Cucurbitacin I 6.70  515.3000 C 30 42 7 9.50 −0.66 515.2998 (100), 91.0540 (18), 205.1222 (17), 111.0804 (16), 123.0802 (14), 95.0491 (14), 128.0618 (12), 115.0542 (12), 215.1428 (10), 139.0753 (10), 187.1117 (10) [ 55 17 Khekadaengoside D 7.15 721.3434 −  C 36 52 12 11.50 −1.47 675.3384 (100), 657.3282 (26) 495.2751 (22), 513.2860 (14) 341.1757 (12) 477.2645 (12) 411.2178 (11) [ 54 18 Cucurbitacin S 7.17  499.3045 C 30 42 6 9.50 −0.60 499.3045 (100), 113.0960 (62), 91.0541 (55), 123.0804 (44), 149.0960 (41), 95.0491 (40), 95.0854 (40), 128.0622 (31), 115.0542 (40), 67.0542 (27), 79.0542 (23), 111.0804 (22) [ 56 19 Arvenin III 7.41 723.3588 −  C 36 54 12 10.50 −1.08 659.3441 (100), 575.2862 (99), 413.2334 (88) 87.0087 (87), 101.0244 (71), 89.0243 (64), 505.2449 (58), 113.0244 (55), 119.0350 (51), 497.2910 (51), 343.1914 (46), 641.3337 (45), 191.1081 (37), 677.3530 (35), 161.0453 (34), 165.0921 (31), 437.2694 (30), 455.2806 (29), 479.2805 (27), 485.2531 (25), 599.3241 (23), 617.3338 (22), 325.1815 (21), 547.2554 (20) [ 57 20 Unknown Ursane-type triterpenoid glycoside 7.60 707.3646 −  C 36 54 11 10.50 −0.36 87.0089 (100), 101.0247 (95), 499.3076 (84), 661.3618 (77), 571.3281 (77), 191.1081 (71), 161.0458 (68), 113.0247 (47), 309.2073 (33), 89.0244 (33), 448.8047 (30), 119.0352 (29), 135.6041 (27) - 21 Unknown Lanostane-type triterpenoid 7.81 547.2910  C 30 44 9 9.50 −0.55 135.0815 (100), 331.1915 (18), 153.0921 (9), 485.2908 (9) - 22 Arvenin I 7.97 765.3698 −  C 38 56 13 11.50 −0.63 701.3542 (100), 497.2903 (31), 719.3652 (30), 101.0244 (27), 659.3442 (24), 87.0087 (22), 573.2700 (21), 161.0455 (16), 113.0244 (16), 89.0244 (15) [ 54 23 Elaterinide 8.31 763.3542 −  C 38 54 13 -1.59 12.50 657.3273 (100), 495.2751 (43), 717.3499 (34), 615.3170 (23), 561.2706 (17), 675.3434 (14), 477.2666 (11), 699.3367 (11) [ 52 24 Arvenin I 8.45 765.3696 −  C 39 58 15 11.50 −0.87 701.3543 (100), 497.2909 (32), 719.3641 (27), 659.3430 (26), 101.0244 (24), 87.0088 (22), 113.0245 (17)  25 Arvenin II 8.58 767.3851 −  C 38 58 13 10.50 −1.06 643.3481 (100), 481.2959 (85), 609.2919 (82), 661.3586 (80), 703.3665 (67), 101.0244 (48), 87.0087 (39), 161.0455 (37), 553.3176 (33), 113.0243 (29), 89.0246 (22), 541.3177 (20), [ 55 26 Cucurbitacin R 8.64 561.3063 −  C 30 46 7 8.50 −0.59 165.0921 (100), 385.2382 (93), 369.2068 (77), 59.0138 (66), 179.1078 (48), 499.3072 (44), 137.0973 (42), 457.2961 (42), 367.2273 (41), 325.1810 (41), 341.2112 (29), 173.1184 (16), 439.2820 (16) [ 54 27 Deoxocucurbitoside B 8.75 835.4116 −  C 42 62 14 12.50 −0.72 789.4066 (100), 481.2956 (32), 505.2957 (22), 480.2877 (19), 101.0242 (12) [ 52 28 Dihydro-Cucurbitacin D isomer 1 8.78 561.3063 −  C 30 44 7 9.50 0.88 165.0921 (100), 497.2917 (44), 439.2494 (40), 479.2809 (36), 437.2708 (31), 515.3033 (30), 385.2021 (25), 455.2806 (24), 385.2386 (22), 369.2079 (20), 497.2515 (18), 343.1927 (17), 87.0454 (10) [ 54 29 Dihydro-Cucurbitacin D isomer 2 8.94 561.3063 −  C 30 44 7 9.50 −0.54 165.0920 (100), 479.28109 (36), 437.2702 (32), 497.2921 (29), 455.2823 (28), 439.2477 (22), 385.2008 (18) [ 56 30 Seco-Cucurbitacin B derivative 9.05 589.3016  C 32 46 10 10.50 −0.42 135.0815 (100), 331.1913 (17), 485.2906 (8), 467.2805 (6) [ 54 31 Cucurbitacin I 9.16 559.2906 −  C 30 44 7 9.50 −0.66 163.0766 (100), 497.2905 (71), 383.2230 (62), 59.0138 (42), 203.1081 (33), 367.1915 (32), 179.1081 (30), 455.2811 (27), 437.2665 (22), 339.1970 (21), 173.1189 (21) - 32 Unknown 9.38  288.2896 C 17 37 2 −0.50 −0.96 288.2898 (100), 106.0862 (40), 88.0757 (21), 57.0699 (14) - 33 Unknown 9.58  288.2891 C 17 37 2 −0.50 −2.13 288.2893 (100), 88.0756 (12), 106.0861 (9) - 34 Unknown (Sphingolipid) 9.71  304.2844 C 17 37 3 −0.50 −0.85 304.2843 (100), 256.2633 (57), 88.0756 (21) 56.0494 (14), 74.0600 (12), 122.0810 (10) - 35 Cucurbitacin B 10.18 603.3168 −  C 32 46 8 10.50 −1.06 497.2909 (100), 411.2176 (90), 301.1445 (34), 273.1486 (19) [ 52 36 Unknown 10.42  316.3206 C 19 41 2 −0.50 −1.23 316.3206 (100), 106.0861 (31), 88.0756 (19), 57.0699 (12) - 37 Cucurbitacin E 10.76 601.3015 −  C 32 44 8 11.50 −0.41 409.2027 (100), 495.2733 (96), 163.0764 (93), 299.1280 (53), 463.7701 (51), 426.2051 (47), 299.0011 (41), 165.9267 (41), 175.3833 (40), 195.3096 (39), 87.3690 (39), 322.1431 (39) [ 52 38 Gingerglycolipid A-Glycerolipid 11.07 721.3643 −  C 33 56 14 6.50 −1.52 277.2171 (100), 397.1364 (37), 101.0247 (24), 415.1458 (19), 89.0245 (18) - 39 LysoPC (18:3)-Glycerophospholipid 11.24 562.3146 −  C 26 48 7 4.50 −0.83 277.2173 (100), 502.2940 (12), 224.0692 (11) - 40 MGMG (18:3)-Glycolipid 12.15 559.3120 −  C 27 46 9 5.50 −0.64 277.2172 (100), 253.0928 (11), 101.0245 (3), 278.2206 (3) - 41 DGMG(16:0)-Glycolipid 12.30 653.3747 −  C 31 58 14 3.50 −1.05 255.2328 (100), 89.0244 (31), 101.0244 (30), 397.1349 (23), 71.0138 (16), 415.1457 (15) - 42 LysoPC (16:0)-Glycerophospholipid 12.51 540.3303  C 25 52 9 1.50 0.80 255.2328 (100), 480.4096 (17), 224.0693 (10) - 43 PC(16:0/9:0(COOH))-Glycerophospholipid 13.80  666.4337 C 33 64 10 2.50 −0.52 184.0734 (100), 86.0964 (21), 98.9842 (16), 124.9998 (10), 71.0730 (5) - 44 SQMG(18:3)-Glycerolipid 14.60 577.2684  C 27 46 11 5.50 −0.75 577.2684 (100), 225.0074 (13), 64.1417 (5) - 45 Unknown (Triterpenoid) 14.73  485.2894 C 29 40 6 9.50 −0.82 133.1012 (100), 91.0542 (36) - 46 Unknown (Sphingolipid) 15.31  526.5188 C 33 67 3 0.50 −0.62 270.2790 (100), 283.2630 (97), 526.5189 (94), 88.0756 (18), 102.0913 (12) - 47 Monopalmitin 15.87  331.2841 C 19 38 4 0.50 −0.51 57.0699 (100), 71.0855 (70), 95.0855 (54), 85.1012 (40), 109.1012 (26), 81.0698 (26), 313.2741 (22), 83.0855 (20), 67.0542 (18), 69.0699 (16), 55.0542 (12), 97.1011 (11) - 48 Pheophorbide a 16.07  593.2751 C 35 36 4 5 19.50 −1.18 593.2753 (100), 533.2546 (23), 460.2255 (9), 461.2329 (6), 505.2217 (6) - 49 Monostearin 17.19  359.3155 C 21 42 4 0.50 −0.18 57.0698 (100), 116.0527 (81), 71.0854 (70), 59.9902 (69), 95.0855 (52), 85.1012 (38), 88.0215 (37), 67.0543 (29), 81.0698 (28), 341.3047 (25), 109.1014 (25), 55.0541 (24), 69.0699 (23), 83.0855 (22), 57.0335 (13), 97.1009 (12), 158.1506 (11), 229.3898 (11), 111.1167 (10) - Rt: retention time expressed in minutes; RDB eq ",
  "metadata": {
    "Title of this paper": "Growth inhibitory activity of cucurbitacin glucosides isolated from ",
    "Journal it was published in:": "Metabolites",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12471846/"
  }
}