{
  "title": "Paper_298",
  "abstract": "pmc J Enzyme Inhib Med Chem J Enzyme Inhib Med Chem 3428 jenzimc Journal of Enzyme Inhibition and Medicinal Chemistry 1475-6366 1475-6374 Taylor & Francis PMC12486455 PMC12486455.1 12486455 12486455 41026084 10.1080/14756366.2025.2565463 2565463 1 Version of Record Research Article Research Article Farnesiferol C enhances the effects of chemotherapy and ionising radiation in human melanoma cells via targeting topoisomerase II alpha N. Moosavinejad et al. Moosavinejad Negin Formal analysis Investigation Writing – original draft  a  b Nasiri Sarvi Zahra Formal analysis  a  b Gholamhosseinian Hamid Methodology Resources  c Iranshahi Mehrdad Methodology Resources  d Rassouli Fatemeh B. Conceptualization Supervision Writing – review & editing  a  b a Novel Diagnostics and Therapeutics Research Group, Institute of Biotechnology, Ferdowsi University of Mashhad Mashhad Iran b Department of Biology, Faculty of Science, Ferdowsi University of Mashhad Mashhad Iran c Department of Medical Physics, Faculty of Medicine, Mashhad University of Medical Sciences Mashhad Iran d Biotechnology Research Center, Pharmaceutical Technology Institute, Mashhad University of Medical Sciences Mashhad Iran Supplemental data for this article can be accessed online at https://doi.org/10.1080/14756366.2025.2565463 CONTACT behnam3260@um.ac.ir Novel Diagnostics and Therapeutics Research Group, Institute of Biotechnology, Ferdowsi University of Mashhad Mashhad Iran 30 9 2025 2025 40 1 478722 2565463 30 09 2025 02 10 2025 02 10 2025 14 7 2025 30 8 2025 18 9 2025 KnowledgeWorks Global Ltd. 26 9 2025 published online in a building issue 26 9 2025 © 2025 The Author(s). Published by Informa UK Limited, trading as Taylor & Francis Group. 2025 The Author(s) https://creativecommons.org/licenses/by-nc/4.0/ This is an Open Access article distributed under the terms of the Creative Commons Attribution-NonCommercial License ( http://creativecommons.org/licenses/by-nc/4.0/ Abstract This study evaluated Farnesiferol C (FC), a natural coumarin, as a potential topoisomerase IIα (TOP2A) inhibitor to enhance chemotherapy and ionising radiation (IR) efficacy in melanoma cells. Key targets were identified, followed by enrichment and gene expression analyses, and molecular docking and dynamics simulations. Upon extraction of FC from Ferula szowitsiana 50 Keywords Melanoma farnesiferol C topoisomerase II alpha chemotherapy ionising radiation The author(s) reported there is no funding associated with the work featured in this article. pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement yes pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes 1. Introduction Melanoma represents the most aggressive and lethal subtype of skin cancer 1 2 3–6 7–9 10–13 DNA topoisomerases orchestrate the modulation of DNA topology by inducing transient single- or double-stranded breaks, thereby relieving torsional stress during replication and transcription processes 14 15 , 16 2+ 17 , 18 19 20 Farnesiferol C (FC), a sesquiterpene coumarin predominantly isolated from the roots of Ferula species, is a polycyclic aromatic compound characterised by a 1-benzopyran core and a ketone functional group at the C2 position 21 , 22 23–27 28 1 26 1 29 30 To address this critical knowledge gap, the present study constitutes a novel investigation into the potential of FC as a TOP2A inhibitor capable of augmenting the DNA-damaging efficacy of radiotherapy and an alkylating agent in human melanoma cells. Initially, key molecular targets were identified, and enrichment and gene expression analyses were performed. Subsequently, molecular docking and dynamic simulations were employed to characterise the binding interactions of FC within the ATP-binding site of TOP2A. Experimentally, FC was isolated from Ferula szowitsiana 2. Methods 2.1. Computational analyses 2.1.1. Target prediction, interaction and enrichment analyses To identify genes associated with skin cutaneous melanoma (SKCM), the Open Targets platform ( https://platform.opentargets.org/ 31 http://gepia2.cancer-pku.cn/#index Simultaneously, potential molecular targets corresponding to FC were predicted via the SwissTargetPrediction tool ( http://swisstargetprediction.ch/ 32 https://pubchem.ncbi.nlm.nih.gov/ For elucidation of the protein-protein interaction (PPI) network among common genes, the STRING database ( https://string-db.org/ 33 Finally, functional enrichment and characterisation of the prioritised gene set were performed using Gene Ontology (GO) analysis via the TNMplot platform, incorporating adjusted p 34 2.1.2. Validating the expression of TOP2A and its clinical significance in melanoma The expression validation of TOP2A TOP2A n n 35 TOP2A n n To elucidate the prognostic impact of TOP2A To complement these findings at the cellular level, microarray data from the Gene Expression Omnibus (GEO) were analysed. Dataset GSE86373 TOP2A p p 2.1.3. Molecular docking Molecular docking was performed to elucidate the interaction between FC and TOP2A. The high-resolution crystal structure of human TOP2A (PDB ID: 1ZXM, 1.87 Å) was retrieved from the RCSB Protein Data Bank ( https://www.rcsb.org/ https://pubchem.ncbi.nlm.nih.gov/ Protein preparation was executed using the Protoss tool to optimise protonation states and refine the hydrogen bond network, ensuring an accurate molecular environment for docking. Docking was conducted on the Proteins Plus platform ( https://proteins.pl 36 36–38 2.1.4. Molecular dynamics simulations To assess the conformational flexibility and binding stability of the FC–TOP2A complex, molecular dynamics simulations were performed. These simulations utilised GROMACS version 2023 equipped with the CHARMM36 all-atom force field. To facilitate the preparation process—which included merging topologies, solvation, energy minimisation, and equilibration steps—a custom Bash script was employed. The system was solvated using the CHARMM-adapted TIP3P water model and neutralised by adding Na + - 2.2. In vitro studies 2.2.1. Extraction of FC For extraction of FC, Ferula szowitsiana 39 Ferula szowitsiana 1 13 Figure 1 Figure 1. Chemical structure of FC (A) and its corresponding proton ( 1 13 2.2.2. Single and combinatorial treatments of cells Human melanoma cells (A375 cell line) and human normal fibroblasts (HFF-3 cell line), procured from the Pasteur Institute (Tehran, Iran), were cultured in Dulbecco’s Modified Eagle’s Medium—high glucose (Capricorn) supplemented with 10% foetal bovine serum (Neofroxx). Cells were maintained under standard conditions at 37 °C in a humidified atmosphere with 5% CO 2 Stock solutions of FC (MW: 382.5 g/mol) were prepared in dimethyl sulfoxide (DMSO). Final concentrations of 25, 50, and 100 μM were freshly prepared in complete medium prior to use, and a solvent control containing 0.3% DMSO was included. Cells were seeded in 96-well plates (4,000 cells/well) and treated with FC for 72 and 120 h, after which cell viability was assessed and IC 50 For combined treatment with IR, cells were pre-treated with 25 and 50 μM FC for 48 h, then exposed to IR doses of 4, 6, and 8 Gy using the Elekta Compact ™ For combinatorial treatment with TMZ, the viability of cells was first determined by treating cells with 100, 200, 400, and 600 μM TMZ (Merck). Subsequently, A375 cells were treated with combinations of 25 and 50 μM FC plus 200 and 400 μM TMZ for 72 h, followed by viability assessment. Controls included untreated cells and cells treated with 0.3% DMSO combined with corresponding TMZ concentrations. 2.2.3. Cell viability assay Cell viability after single and combination treatments was evaluated using the resazurin assay. Briefly, resazurin solution (0.1 mg/ml, Sigma) was added to the cells at the end of each time point, followed by 3 h incubation at 37 °C. Absorbance was then measured at 600 nm using a microplate reader (Epoch). Cell viability (%) was calculated as (100 − (AT − AU)/(AB − AU)) × 100, where AT, AU, and AB represent the absorbance values of treated cells, untreated cells, and blank control, respectively. 2.2.4. Apoptosis assay To assess apoptosis, A375 cells treated with 50 μM FC, 400 μM TMZ, their combination, and DMSO control were harvested after 72 h, washed with PBS, and resuspended in binding buffer containing annexin V-FITC and propidium iodide (PI, Sigma). Flow cytometric data were collected using FL1-H and FL2-H channels (BD FACSCalibur), enabling discrimination of viable cells (negative for both annexin V and PI), necrotic cells (PI-positive only), and early and late apoptotic cells (annexin V-positive). 2.2.5. Statistical analyses Data were analysed statistically using one-way ANOVA for multiple comparisons with GraphPad Prism software (v 10.4.1). The results are presented as mean ± standard deviation (SD), and statistical significance was determined for p 3. Results Target screening identified 3,789 genes associated with SKCM, 2,541 genes overexpressed in SKCM, and 205 predicted targets of FC. Venn analysis revealed 24 overlapping protein-coding genes ( Figure 2A MET, CDK1, MMP1, CCNB2, CDK2, KIF11, SOAT1, TOP2A, ACSL3, AURKA, AURKB, CTSB, ITGB1, FCGR3A, CDK4, PIK3CD, STAT1, ADORA3, TGM2, CTSS, ADAM10, CTSD, CTSL CDK5 Figure 2B AURKB, TOP2A, KIF11, CCNB2, AURKA Figure 2C Figure 2. Identification of shared targets and PPI network for hub genes. Venn diagram showing the overlap among overexpressed genes in SKCM, SKCM-associated genes, and protein targets of FC (A). STRING-based interactome mapping of the shared targets, illustrating their functional associations (B). Cytoscape visualisation of the PPI network comprising 22 nodes and 61 edges, highlighting five top hub genes (C). Node colours represent expression levels, ranging from significantly high (red) to low (yellow). Enrichment analysis of the identified hub targets revealed significant biological process terms, including modification, phosphorylation, apoptosis, and mitotic cell cycle phase transition, all with adjusted p Figure 3A p Figure 3B Figure 3. Gene set enrichment analyses. Gene ontology enrichment analyses identified significant terms in biological process (A) and molecular function (B). To evaluate the clinical significance of TOP2A in SKCM, multi-database analyses of tissue samples were conducted. Expression analysis via GEPIA2 demonstrated a significant ( p TOP2A Figure 4A p TOP2A Figure 4B n n TOP2A Figure 4C TOP2A p TOP2A GSE86373 TOP2A Figure 4D TOP2A p Figure 4. Validating the expression of TOP2A TOP2A n n TOP2A n n TOP2A n n GSE86373 TOP2A Given the pivotal role of TOP2A within the PPI network and its critical functional relevance, molecular docking was performed to evaluate and compare the binding affinity of FC with that of the established TOP2A inhibitor, Etoposide. As illustrated in Figure 5 Figure S1 Figure 5. Molecular docking diagrams of ligands binding to TOP2A. The 3D and 2D interaction illustrations of FC (A) and Etoposide (B) with the ATP-binding site of TOP2A. Images were generated using PoseEdit on the ProteinsPlus web server. The interaction dynamics between FC and TOP2A were also examined to assess the stability and structural integrity. The mean RMSD values for the FC-TOP2A complex were 3.945 Å, indicating stable binding accompanied by some rotational movement within the TOP2A catalytic domain ( Figure 6A Figure 6B Figure 6C 2 Figure 6D Figures 6E-F Figure 6. Stable interaction of FC with the ATP-binding site of TOP2A. Plots generated from 100 ns molecular dynamics simulations, demonstrating structural and energetic properties of the FC-TOP2A complex: RMSD (A), RMSF (B), Rg (C), and SASA (D), short-range Coulombic potential (E) and short-range Lennard-Jones potential (F). Building on computational analyses indicating FC targets TOP2A, we evaluated its effects on the toxicity of IR and chemotherapy. Initially, FC was extracted, and its half-maximal inhibitory concentration (IC 50 50 50 To evaluate the combined effects of FC and IR, A375 and HFF-3 cells were pre-treated with 25 and 50 μM FC for 48 h, followed by IR exposure and 72 h recovery. As shown in Figure 7(A) p p p p p p Figure 7B Figure 7. Viability of cells treated with FC alone and combined with IR or TMZ. After 48 h pre-treatment with 25 and 50 µM FC, A375 cells were exposed to 4, 6, and 8 Gy IR, followed by 72 h recovery before viability measurement (A). HFF-3 cells were treated with 25 and 50 µM FC, then exposed to 6 Gy IR and allowed 72 h recovery before viability assessment (B). A375 cells were treated with 25 and 50 µM FC alone or combined with 200 and 400 µM TMZ for 72 h (C). Results are presented as mean ± SD, with statistical significance compared to corresponding DMSO controls indicated as * p p p p The viability of A375 cells was also assessed after treatment with 25 and 50 μM FC combined with 200 and 400 μM TMZ for 72 h. As shown in Figure 7(C) p To identify the type of cell death observed in resazurin assay, annexin V-PI staining was performed. As shown in Figure 8(A) Figure 8B Figure 8. Flow cytometry analyis and morphological alterations of A375 cells. After 72 h treatment of cells with 50 µM FC, TMZ 400 µM and their combination, apoptosis was detected using annexin V-FITC and PI staining followed by flow cytometry (A). Cells were classified as viable (negative for both annexin V-FITC and PI), necrotic (PI-positive only), or apoptotic—early or late (annexin V-FITC positive). Phase-contrast images illustrate changes in cell density and morphology in A375 cells after 72 h combined treatment with 50 µM FC and 400 µM TMZ (B). 4. Discussion Melanoma continues to surge globally, with developed nations witnessing a particularly alarming rise in cases 40 7 TOP2 is a vital enzyme responsible for maintaining genomic integrity by managing the compact folding of large DNA molecules within the nucleus during transcription and replication 41 , 42 2 43 , 44 45 TOP2A TOP2A 14 , 15 , 20 To investigate whether FC has the potential to inhibit TOP2A enzymatic activity, molecular docking and dynamics simulations were conducted, providing a comprehensive characterisation of FC binding interactions. These analyses demonstrated stable, high-affinity engagement with TOP2A, involving critical ATP-binding site residues Ser148, Ser149, and Lys168, which are essential for enzymatic function 16 , 46 These results are consistent with previous studies reporting that FC induced apoptosis and G 1 25 , 26 , 29 , 47 30 , 48 26 24 , 27 , 30 , 48 The present study focused on evaluating the effects of FC in combination therapy on human melanoma cell viability and apoptosis, alongside analyses of the interaction between FC and TOP2A. While these findings are promising, further investigation at the protein level, including assessment of apoptosis-related factors such as caspases, Bax, and Bcl-2, is recommended. Future research should also validate the effects of FC across a wider range of melanoma cell lines and explore its potential synergy with other chemotherapeutic agents. Addressing these aspects will provide a more comprehensive understanding of the apoptotic mechanisms involved and better define the therapeutic potential of FC in combination treatments. 5. Conclusion The present study reports for the first time the effects of FC in combination with radiation and chemotherapy on melanoma cells through interaction with TOP2A, which exhibits elevated expression in melanoma. These findings open new avenues for therapeutic strategy development and provide a strong rationale for further preclinical and clinical evaluation of FC, as well as other natural sesquiterpene coumarins. Supplementary Material Supplementary Figure S1.png Acknowledgement The authors gratefully acknowledge Ferdowsi University of Mashhad for providing access to laboratory facilities and instrumentation that supported the completion of this project. Disclosure statement No potential conflict of interest was reported by the author(s). Availability of data and materials The data that support the findings of this study are available from the corresponding author upon reasonable request. References 1 Lopes J Rodrigues CM Gaspar MM Reis CP. Melanoma management: from epidemiology to treatment and latest advances Cancers (Basel) 2022 14 19 4652 36230575 10.3390/cancers14194652 PMC9562203 2 Garbe C Amaral T Peris K Hauschild A Arenberger P Basset-Seguin N Bastholt L Bataille V Del Marmol V Dréno B European Association of Dermato-Oncology (EADO et al. European consensus-based interdisciplinary guideline for melanoma. Part 2: treatment-update 2022 Eur J Cancer 2022 170 256 284 35623961 10.1016/j.ejca.2022.04.018 3 Goldinger SM Buder-Bakhaya K Lo SN Forschner A McKean M Zimmer L Khoo C Dummer R Eroglu Z Buchbinder EI et al. Chemotherapy after immune checkpoint inhibitor failure in metastatic melanoma: a retrospective multicentre analysis Eur J Cancer 2022 162 22 33 34952480 10.1016/j.ejca.2021.11.022 4 Dabestani PJ Dawson AJ Neumeister MW Bradbury CM. Radiation therapy for local cutaneous melanoma Clin Plast Surg 2021 48 4 643 649 34503724 10.1016/j.cps.2021.05.008 5 Davis LE Shalin SC Tackett AJ. Current state of melanoma diagnosis and treatment Cancer Biol Ther 2019 20 11 1366 1379 31366280 10.1080/15384047.2019.1640032 PMC6804807 6 Atkins MB Lee SJ Chmielowski B Tarhini AA Cohen GI Truong T-G Moon HH Davar D O’Rourke M Stephenson JJ et al. Combination dabrafenib and trametinib versus combination nivolumab and ipilimumab for patients with advanced BRAF-mutant melanoma: the DREAMseq trial—ECOG-ACRIN EA6134 J Clin Oncol 2023 41 2 186 197 36166727 10.1200/JCO.22.01763 PMC9839305 7 Trinh VA Patel SP Hwu WJ. The safety of temozolomide in the treatment of malignancies Expert Opin Drug Saf 2009 8 4 493 499 19435405 10.1517/14740330902918281 8 Zhao S Sun W Sun J Peng L Wang C. Clinical features, treatment, and outcomes of nivolumab induced psoriasis Invest New Drugs 2025 43 1 42 49 39724319 10.1007/s10637-024-01494-4 9 Wu Z Li X Huang R He B Wang C. Clinical features, treatment, and prognosis of pembrolizumab-induced Stevens-Johnson syndrome/toxic epidermal necrolysis Invest New Drugs 2025 43 1 74 80 39752075 10.1007/s10637-024-01499-z 10 Gelsleichter NE de Souza PO Teixeira FC Debom GN Lenz GS Roliano GG de Cássia Sant’ana R Visioli F Fachel FNS Michels LR et al. Metastatic melanoma: a preclinical model standardization and development of a chitosan-coated nanoemulsion containing temozolomide to treat brain metastasis Cell Mol Neurobiol 2023 43 6 2939 2951 37055607 10.1007/s10571-023-01338-4 PMC11410114 11 Sun W Jang M-S Zhan S Liu C Sheng L Lee JH Fu Y Yang HY. Tumor-targeting and redox-responsive photo-cross-linked nanogel derived from multifunctional hyaluronic acid-lipoic acid conjugates for enhanced in vivo protein delivery Int J Biol Macromol 2025 314 144444 40403518 10.1016/j.ijbiomac.2025.144444 12 Jiang Z Chen Z Xu Y Li H Li Y Peng L Shan H Liu X Wu H Wu L et al. Low-frequency ultrasound sensitive Piezo1 channels regulate keloid-related characteristics of fibroblasts Adv Sci 2024 11 14 2305489 10.1002/advs.202305489 PMC11005750 38311578 13 Chen Y Deng Y Li Y Qin Y Zhou Z Yang H Sun Y. Oxygen-independent radiodynamic therapy: radiation-boosted chemodynamics for reprogramming the tumor immune environment and enhancing antitumor immune response ACS Appl Mater Interfaces 2024 16 17 21546 21556 38626342 10.1021/acsami.4c00793 14 Skok Ž Durcik M Zajec Ž Gramec Skledar D Bozovičar K Pišlar A Tomašič T Zega A Peterlin Mašič L Kikelj D et al. ATP-competitive inhibitors of human DNA topoisomerase IIα with improved antiproliferative activity based on N-phenylpyrrolamide scaffold Eur J Med Chem 2023 249 115116 36689894 10.1016/j.ejmech.2023.115116 15 McKie SJ Neuman KC Maxwell A. DNA topoisomerases: Advances in understanding of cellular roles and multi-protein complexes via structure-function analysis Bioessays 2021 43 4 e2000286 33480441 10.1002/bies.202000286 PMC7614492 16 Bergant Loboda K Janežič M Štampar M Žegura B Filipič M Perdih A. Substituted 4, 5′-bithiazoles as catalytic inhibitors of human DNA topoisomerase IIα J Chem Inf Model 2020 60 7 3662 3678 32484690 10.1021/acs.jcim.0c00202 PMC7469689 17 Wendorff TJ Schmidt BH Heslop P Austin CA Berger JM. The structure of DNA-bound human topoisomerase II alpha: conformational mechanisms for coordinating inter-subunit interactions with DNA cleavage J Mol Biol 2012 424 3-4 109 124 22841979 10.1016/j.jmb.2012.07.014 PMC3584591 18 Lindsey RH Jr Pendleton M Ashley RE Mercer SL Deweese JE Osheroff N. Catalytic core of human topoisomerase IIα: insights into enzyme–DNA interactions and drug mechanism Biochemistry 2014 53 41 6595 6602 25280269 10.1021/bi5010816 PMC4204876 19 Pogorelčnik B Perdih A Solmajer T. Recent developments of DNA poisons-human DNA topoisomerase IIα inhibitors-as anticancer agents Curr Pharm Des 2013 19 13 2474 2488 23363399 10.2174/1381612811319130016 20 Okoro CO Fatoki TH. A mini review of novel topoisomerase ii inhibitors as future anticancer agents Int J Mol Sci 2023 24 3 2532 36768852 10.3390/ijms24032532 PMC9916523 21 Valiahdi SM Iranshahi M Sahebkar A. Cytotoxic activities of phytochemicals from Ferula species Daru 2013 21 1 39 23701832 10.1186/2008-2231-21-39 PMC3671137 22 Zhou Y Xin F Zhang G Qu H Yang D Han X. Recent advances on bioactive constituents in Ferula Drug Dev Res 2017 78 7 321 331 28786182 10.1002/ddr.21402 23 Sistani P Dehghan G Sadeghi L. Structural and kinetic insights into HIV-1 reverse transcriptase inhibition by farnesiferol C Int J Biol Macromol 2021 174 309 318 33524481 10.1016/j.ijbiomac.2021.01.173 24 Chang HJ Kim YS Ryu SY Chun HS. Screening of various sources of phytochemicals for neuroprotective activity against oxygen-glucose deprivation in vitro J Korean Soc Appl Biol Chem 2013 56 4 451 455 25 Alafnan A Alamri A Alanazi J Hussain T. Farnesiferol C exerts Antiproliferative effects on hepatocellular carcinoma HepG2 cells by instigating ROS-dependent apoptotic pathway Pharmaceuticals 2022 15 9 1070 36145291 10.3390/ph15091070 PMC9501262 26 Jung JH Park JE Sim DY Im E Park WY Lee D Shim B-S Kim S-H. Farnesiferol C induces apoptosis in chronic myelogenous leukemia cells as an imatinib sensitizer via caspase activation and HDAC (histone deacetylase) inactivation Int J Mol Sci 2019 20 22 5535 31698777 10.3390/ijms20225535 PMC6888363 27 Tanzadehpanah H Mahaki H Samadi P Karimi J Moghadam NH Salehzadeh S Dastan D Saidijam M. Anticancer activity, calf thymus DNA and human serum albumin binding properties of Farnesiferol C from Ferula pseudalliacea J Biomol Struct Dyn 2019 37 11 2789 2800 30052136 10.1080/07391102.2018.1497543 28 Aldaghi L Rad A Arab A Kasaian J Iranshahi M Sadr AS Soltani F. In silico and in vitro evaluation of cytotoxic activities of farnesiferol c and microlobin on MCF-7, HeLa and KYSE cell lines Drug Res (Stuttg) 2016 66 10 532 538 27463028 10.1055/s-0042-111200 29 Jung JH Kim MJ Lee H Lee J Kim J Lee HJ Shin EA Kim YH Kim B Shim BS et al. Farnesiferol c induces apoptosis via regulation of L11 and c-Myc with combinational potential with anticancer drugs in non-small-cell lung cancers Sci Rep 2016 6 1 26844 27231235 10.1038/srep26844 PMC4882547 30 Kasaian J Mosaffa F Behravan J Masullo M Piacente S Ghandadi M Iranshahi M. Reversal of P-glycoprotein-mediated multidrug resistance in MCF-7/Adr cancer cells by sesquiterpene coumarins Fitoterapia 2015 103 149 154 25843566 10.1016/j.fitote.2015.03.025 31 Buniello A Suveges D Cruz-Castillo C Llinares MB Cornu H Lopez I Tsukanov K Roldán-Romero JM Mehta C Fumis L et al. Open Targets Platform: facilitating therapeutic hypotheses building in drug discovery Nucleic Acids Res 2025 53 D1 D1467 D1475 39657122 10.1093/nar/gkae1128 PMC11701534 32 Daina A Michielin O Zoete V. SwissTargetPrediction: updated data and new features for efficient prediction of protein targets of small molecules Nucleic Acids Res 2019 47 W1 W357 W364 31106366 10.1093/nar/gkz382 PMC6602486 33 Szklarczyk D Kirsch R Koutrouli M Nastou K Mehryary F Hachilif R Gable AL Fang T Doncheva NT Pyysalo S et al. The STRING database in 2023: protein–protein association networks and functional enrichment analyses for any sequenced genome of interest Nucleic Acids Res 2023 51 D1 D638 D646 36370105 10.1093/nar/gkac1000 PMC9825434 34 Bartha Á Győrffy B. TNMplot. com: a web tool for the comparison of gene expression in normal, tumor and metastatic tissues Int J Mol Sci 2021 22 5 2622 33807717 10.3390/ijms22052622 PMC7961455 35 Tang Z Kang B Li C Chen T Zhang Z. GEPIA2: an enhanced web server for large-scale expression profiling and interactive analysis Nucleic Acids Res 2019 47 W1 W556 W560 31114875 10.1093/nar/gkz430 PMC6602440 36 Schöning-Stierand K Diedrich K Ehrt C Flachsenberg F Graef J Sieg J Penner P Poppinga M Ungethüm A Rarey M. ProteinsPlus: a comprehensive collection of web-based molecular modeling tools Nucleic Acids Res 2022 50 W1 W611 w615 35489057 10.1093/nar/gkac305 PMC9252762 37 Diedrich K Krause B Berg O Rarey M. PoseEdit: enhanced ligand binding mode communication by interactive 2D diagrams J Comput Aided Mol Des 2023 37 10 491 503 37515714 10.1007/s10822-023-00522-4 PMC10440272 38 Flachsenberg F Meyder A Sommer K Penner P Rarey M. A Consistent Scheme for Gradient-Based Optimization of Protein–Ligand Poses J Chem Inf Model 2020 60 12 6502 6522 33258376 10.1021/acs.jcim.0c01095 39 Iranshahi M Arfa P Ramezani M Jaafari MR Sadeghian H Bassarello C Piacente S Pizza C. Sesquiterpene coumarins from Ferula szowitsiana and in vitro antileishmanial activity of 7-prenyloxycoumarins against promastigotes Phytochemistry 2007 68 4 554 561 17196626 10.1016/j.phytochem.2006.11.002 40 Arnold M Singh D Laversanne M Vignat J Vaccarella S Meheus F Cust AE de Vries E Whiteman DC Bray F. Global burden of cutaneous melanoma in 2020 and projections to 2040 JAMA Dermatol 2022 158 5 495 503 35353115 10.1001/jamadermatol.2022.0160 PMC8968696 41 Noy A Sutthibutpong T SA Harris Protein/DNA interactions in complex DNA topologies: expect the unexpected Biophys Rev 2016 8 Suppl 1 145 155 28035245 10.1007/s12551-016-0241-7 PMC5153831 42 Pommier Y Sun Y Huang SYN Nitiss JL. Roles of eukaryotic topoisomerases in transcription, replication and genomic stability Nat Rev Mol Cell Biol 2016 17 11 703 721 27649880 10.1038/nrm.2016.111 PMC9248348 43 McClendon AK Osheroff N. DNA topoisomerase II, genotoxicity, and cancer Mutat Res 2007 623 1-2 83 97 17681352 10.1016/j.mrfmmm.2007.06.009 PMC2679583 44 Baviskar AT Madaan C Preet R Mohapatra P Jain V Agarwal A Guchhait SK Kundu CN Banerjee UC Bharatam PV. N-fused imidazoles as novel anticancer agents that inhibit catalytic activity of topoisomerase IIα and induce apoptosis in G1/S phase J Med Chem 2011 54 14 5013 5030 21644529 10.1021/jm200235u 45 Nitiss JL. DNA topoisomerase II and its growing repertoire of biological functions Nat Rev Cancer 2009 9 5 327 337 19377505 10.1038/nrc2608 PMC2730144 46 Wei H Ruthenburg AJ Bechis SK Verdine GL. Nucleotide-dependent domain movement in the ATPase domain of a human type IIA DNA topoisomerase J Biol Chem 2005 280 44 37041 37047 16100112 10.1074/jbc.M506520200 47 Hasanzadeh D Mahdavi M Dehghan G Charoudeh HN. Farnesiferol C induces cell cycle arrest and apoptosis mediated by oxidative stress in MCF-7 cell line Toxicol Rep 2017 4 420 426 28959668 10.1016/j.toxrep.2017.07.010 PMC5615162 48 Kasaian J Mosaffa F Behravan J Masullo M Piacente S Iranshahi M. Modulation of multidrug resistance protein 2 efflux in the cisplatin resistance human ovarian carcinoma cells A2780/RCIS by sesquiterpene coumarins Phytother Res 2016 30 1 84 89 26503061 10.1002/ptr.5504 ",
  "metadata": {
    "Title of this paper": "Modulation of multidrug resistance protein 2 efflux in the cisplatin resistance human ovarian carcinoma cells A2780/RCIS by sesquiterpene coumarins",
    "Journal it was published in:": "Journal of Enzyme Inhibition and Medicinal Chemistry",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12486455/"
  }
}