{
  "title": "Paper_313",
  "abstract": "J Am Chem Soc J Am Chem Soc 319 nihpa Journal of the American Chemical Society 0002-7863 1520-5126 pmc-is-collection-domain yes pmc-collection-title NIHPA Author Manuscripts PMC12486140 PMC12486140.1 12486140 12486140 NIHMS2088495 33988982 10.1021/jacs.9b10460 NIHMS2088495 NIHPA2088495 1 Article Conversion of RNA aptamer into modified DNA aptamers provides for prolonged stability and enhanced antitumor activity Amero Paola 1 Lokesh Ganesh L. R. 3 Chaudhari Rajan R. 1 Cardenas-Zuniga Roberto 1 Schubert Thomas 10 Attia Yasmin M. 1 9 Montalvo-Gonzalez Efigenia 1 7 Elsayed Abdelrahman M. 1 11 Ivan Cristina 1 Wang Zhihui 8 Cristini Vittorio 8 de Franciscis Vittorio 6 12 Zhang Shuxing 1 Volk David E. 3 Mitra Rahul 5 Rodriguez-Aguayo Cristian 1 2 Sood Anil K. 2 4 5 Lopez-Berestein Gabriel * 1 2 4 1 2 3 4 5 6 7 8 9 10 11 12 * Corresponding Author: glopez@mdanderson.org Disclosure of Potential Conflicts of Interest: 26 5 2021 14 5 2021 143 20 498036 7655 7670 24 09 2025 01 10 2025 02 10 2025 02 10 2025 Aptamers, synthetic single-strand oligonucleotides with a similar function to antibodies, are promising as therapeutics because of their minimal side effects. However, the stability and bioavailability of the aptamers pose a challenge. We developed aptamers converted from RNA aptamer to modified DNA aptamers targeting phospho-AXL with improved stability and bioavailability. Based on the comparative analysis of a library of 17 converted modified DNA aptamers, we selected aptamer candidates, GLB-G25 and GLB-A04 that exhibited highest bioavailability, stability and robust anti-tumor effect in vitro Backbone modifications such as thiophosphate or dithiophosphate and a covalent modification of the 5’-end of the aptamer with polyethylene glycol optimized the pharmacokinetic properties, improved the stability of the aptamers in vivo Treatment with these modified aptamers in ovarian cancer orthotopic mouse models significantly reduced tumor growth and the number of metastases. This effective silencing of the phospho-AXL target thus demonstrated that aptamer specificity and bioavailability can be improved by chemical modification of existing aptamers for phospho-AXL. These results lay the foundation for translation of these aptamer candidates and companion biomarkers to the clinic. Conversion PEGylate two thiophosphate modified DNA aptamers chemical modifications Gas6/AXL axis therapeutic ovarian cancer pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access no pmc-prop-olf no pmc-prop-manuscript yes pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement yes pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes ",
  "metadata": {
    "Title of this paper": "Conversion of RNA aptamer into modified DNA aptamers provides for prolonged stability and enhanced antitumor activity",
    "Journal it was published in:": "Journal of the American Chemical Society",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12486140/"
  }
}