{
  "title": "Paper_555",
  "abstract": "pmc Int J Immunopathol Pharmacol Int J Immunopathol Pharmacol 3390 ijip IJI International Journal of Immunopathology and Pharmacology 0394-6320 2058-7384 SAGE Publications PMC12480818 PMC12480818.1 12480818 12480818 41017528 10.1177/03946320251375162 10.1177_03946320251375162 1 Original Research Article Flow cytometry-based evaluation of CD4/CD25 and IL-17 expression in sepsis of cancer surgical patients https://orcid.org/0000-0003-4564-8073 Abdelhafiz Ahmed Samir 1 Ali Asmaa 2 Elsabeeny Walaa Y 3 Fahmy Ahmed 3 Fouda Merhan A 1 Ayoub Mahmoud Ali 1 Hanafi Marwa 1 1 2 3 Ahmed Samir Abdelhafiz, Department of Clinical Pathology, National Cancer Institute, Cairo University, Kasr Al-Aini Street, From El-Khalig Square, Cairo 11796, Egypt. Email: ahmed.samir@nci.cu.edu.eg 29 9 2025 Jan-Dec 2025 39 478623 03946320251375162 17 3 2025 18 8 2025 29 09 2025 01 10 2025 01 10 2025 © The Author(s) 2025 2025 SAGE Publications Ltd unless otherwise noted. Manuscript content on this site is licensed under Creative Commons Licenses https://creativecommons.org/licenses/by-nc/4.0/ This article is distributed under the terms of the Creative Commons Attribution-NonCommercial 4.0 License ( https://creativecommons.org/licenses/by-nc/4.0/ https://us.sagepub.com/en-us/nam/open-access-at-sage Introduction and objectives: Sepsis is a critical, life-threatening condition marked by organ dysfunction. Patients undergoing surgery for cancer are especially susceptible, facing a significantly increased risk compared to the general population. Prompt diagnosis is essential for optimal treatment outcomes. This study investigates the expression levels of IL-17 and CD4/CD25 in postoperative surgical oncology patients diagnosed with sepsis and examines their association with various clinicopathological parameters, including mortality. Methods: Peripheral blood samples were collected 48 h following admission to the surgical ICU. Flow cytometry was employed to measure the expression of IL-17 and CD4/CD25 in both septic patients and non-septic controls. Results: The study included 30 septic patients and an equal number of controls. The expression of IL-17 and CD4/CD25 was significantly higher in septic patients compared to non-septic patients, demonstrating high diagnostic performance. Additionally, elevated IL-17 expression was strongly associated with an increased risk of mortality. Conclusion: Our study provides insight into immune dysregulation in postoperative cancer patients with sepsis, highlighting the dual arms of active inflammation and immunoparalysis. Elevated IL-17 levels, coupled with Treg activation, were linked to poorer outcomes. Therapeutic strategies that target IL-17 signaling and modulate Treg activity may help restore immune balance and improve prognosis in immunocompromised individuals. Furthermore, developing predictive models using machine learning to classify sepsis severity based on immune markers could enhance diagnosis and prognosis. sepsis post-operative IL-17 Tregs CD4/CD25 pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement yes pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes cover-date January-December 2025 typesetter ts1 Introduction Sepsis is a life-threatening condition characterized by organ dysfunction resulting from a dysregulated host response to infection, with significant morbidity and mortality rates.  1 2 3 Cancer patients face a significantly higher risk of sepsis, up to tenfold greater than the general population, with incidence varying by cancer type.  4 5 8 Although mortality rates among this population have decreased over time due to improvements in sepsis management, cancer therapies, and ICU protocols, the growing threat of antimicrobial resistance remains a major challenge, negatively affecting patient outcomes.  8  3 Surgical cancer patients are at elevated risk of postoperative sepsis due to immune suppression triggered by surgery, compounded by factors such as physiological stress, transfusions, anesthetic agents, and the complexity of oncologic procedures.  9  9 Current biomarkers such as procalcitonin, lactate, and CRP do not consistently distinguish sepsis from noninfectious systemic inflammatory response syndrome (SIRS), highlighting the urgent need for effective screening tools and reliable biomarkers.  10 11 12 IL-17 plays a central role in infectious, inflammatory, autoimmune diseases, and cancer, offering valuable insight into immune dysregulation. Emerging evidence highlights its dual role as a biomarker for early detection and a potential therapeutic target for modulating immune responses in sepsis.  13  14 In the context of immune dysregulation, CD4+CD25+Foxp3+ regulatory T cells (Tregs) serve as critical indicators of immunoparalysis. These cells play a vital role in modulating immune responses by exerting strong anti-inflammatory effects through contact-mediated inhibition of other immune cells and by producing high levels of soluble CD25, IL-4, and IL-10. Tregs contribute to an imbalance in the Th1/Th2 immune response (interferon-γ/IL-4) and induce the differentiation of CD4+ T cells into Th2 cells. Under septic conditions, the presence of CD4+CD25+Foxp3+ Tregs, considered natural Tregs, is indicative of immunoparalysis.  15 The dynamic interplay between IL-17A and Tregs underscores the complex immune landscape in sepsis and highlights potential avenues for therapeutic intervention. This study aims to assess the expression of IL-17 and CD4/CD25 in the peripheral blood of postoperative surgical oncology patients with sepsis using flow cytometry, and to investigate the correlation of these markers with various clinicopathological parameters, including mortality. Methods Sample size calculation The sample size was calculated using Minitab 17.1.0.0 for Windows (Minitab Inc., 2013, Pennsylvania, USA). Assuming a Type I error (α) of 0.05 and a Type II error (β) of 0.15 (corresponding to 85% power), the calculation was based on a meta-analysis evaluating the role of IL-17 in predicting mortality in septic patients, which reported a 5.96-fold increase in IL-17 levels among non-survivors compared to survivors.  16  17 Based on these parameters, the minimum required sample size to achieve 85% power was 56 participants (28 septic patients and 28 controls). Study design A cross-sectional study was conducted at the National Cancer Institute (NCI), Cairo University. The study received approval from the Ethics Committee of the National Cancer Institute, Cairo University (approval no IRB000004025). Written informed consent was obtained from all recruited patients’ guardians. Patient recruitment Sixty cancer patients admitted to the surgical ICU after cancer-related operations were recruited for the study from November 2023 to January 2025. Half of the participants were diagnosed with sepsis, while the remaining matched individuals served as non-septic controls. Patients aged 18–65 years, of either sex, classified as American Society of Anesthesiologists (ASA) physical status II or III, with no preoperative signs or symptoms of infection and normal results for complete blood count, renal and hepatic function tests, and coagulation profiles were included in the study. Exclusion criteria were: refusal to participate by the patient’s guardian, abnormal preoperative kidney or liver function, or significant intraoperative blood loss requiring massive transfusion. The primary outcome was the evaluation of IL-17A and CD4⁺CD25⁺ in patients with sepsis to assess their potential as early markers for sepsis. The secondary outcomes included correlating these markers with patient prognosis and other clinical and laboratory data. Samples were collected 48 h following admission to the surgical ICU. Sepsis diagnosis was confirmed based on the International Guidelines for Management of Sepsis and Septic Shock 2021.  18 Clinical evaluation All recruited patients underwent a comprehensive clinical assessment, including age, sex, smoking status, and the presence of comorbidities. Sepsis was evaluated using the Quick Sequential Organ Failure Assessment (qSOFA) score, which consists of three criteria: respiratory rate ⩾22/min, altered mental status, and systolic blood pressure ⩽100 mmHg. Each criterion is scored on a binary scale (0 for absence, 1 for presence), with a total score of ⩾2 indicating a high risk of organ dysfunction.  19 Additionally, data on the use of steroids, vasopressors, insulin, and respiratory support (oxygen face mask, nasal oxygen, Continuous Positive Airway Pressure (CPAP), or invasive mechanical ventilation, were collected. The length of hospital stays, and mortality rate were also recorded. Flow cytometry Data collection and measurement Monoclonal antibodies with different specificities, along with their respective isotype controls, were utilized as outlined in Supplemental Table 1 Peripheral blood mononuclear cell (PBMC) isolation Peripheral blood samples were obtained from patients and processed within 2 h of collection. Samples were allowed to equilibrate to room temperature (~30 min) prior to processing. The whole blood was diluted 1:1 with sterile phosphate-buffered saline (PBS). One milliliter of room temperature Polymorph density gradient medium (Ficoll) was gently layered into an 8 mL round-bottom polystyrene tube, followed by the careful addition of 3 mL of the diluted blood on top, avoiding mixing of the layers. Samples were centrifuged at 400–500 × g PBMCs were washed twice with PBS, centrifuging at 500 × g Surface and intracellular staining For surface staining, 10 µL of fluorochrome-conjugated MoAb was added to 100 µL of the diluted lymphocyte suspension, incubated in the dark for 20 min, followed by a PBS wash. The cells were then resuspended in 500 µL of PBS and analyzed by flow cytometry. For intracellular staining, 100 µL of diluted lymphocytes were resuspended in 1 mL of PBS, then fixed with a mixture containing 500 µL of 4% paraformaldehyde, 500 µL of PBS, and 5 µL of Tween 20. The suspension was incubated for 10 min at room temperature. After washing, 10 µL of the relevant MoAb was added, and the cells were incubated for 30 min at 4°C in the dark. Following a final wash, cells were resuspended in 500 µL of PBS and analyzed. The protocol was adapted from Menon et al.  20 Analysis strategy A three-antibody panel was utilized to evaluate immune markers in cancer surgical patients with sepsis: surface CD4-FITC, intracellular IL-17-PE, and surface CD25-PE-Cy5.5. Initially, doublets were excluded based on forward scatter (FSC) and side scatter (SSC) characteristics by gating on singlet events. Lymphocytes were subsequently identified and gated using an FSC versus SSC plot. After acquiring 10,000 events per sample, lymphocytes were selected for further analysis. CD4 expression was plotted against CD25 to quantify the percentage of CD4⁺ T-helper cells, CD25⁺ cells, and the co-expression of CD4⁺CD25⁺ regulatory T cells within the gated lymphocyte population ( Supplemental Figure 1 For the analysis of interleukin-17a, CD IL-17a expression was plotted against cell count and quantified as mean fluorescence intensity using the mean channel fluorescence in the FL2 channel. Isotype controls were used to account for autofluorescence and nonspecific binding. Fluorescence intensity was presented as a histogram plotted against cell counts and recorded for further analysis. The mean fluorescence intensity of CD IL-17a in patient samples was then superimposed on that of the isotype control ( Supplemental Figure 2 Statistical analysis Data were entered into a Microsoft Excel spreadsheet and analyzed using SigmaPlot for Windows (version 12.5.0.38) and Minitab for Windows (version 17.1.0.0, Minitab Inc., 2013, Pennsylvania, USA). The Shapiro-Wilk test was applied to evaluate the normality of data distribution. For numerical variables, results were expressed as mean ± standard deviation for normally distributed data and as median with interquartile range for data not following a normal distribution. Categorical variables were summarized as frequencies and percentages. Comparisons between two numerical groups were made using the independent t U To evaluate the diagnostic performance of the markers, a receiver operating characteristic (ROC) curve was generated, with an area under the curve (AUC) >0.6 considered acceptable. To assess the robustness of the diagnostic performance and address potential overfitting, internal validation was performed using both bootstrapping and leave-one-out cross-validation (LOOCV). For bootstrapping, 1000 resamples with replacement were used to estimate the confidence interval of the AUC for each marker. LOOCV was also conducted, where each patient was left out once as a test case while the model was trained on the remaining 59 patients, and the AUC values were averaged across all iterations. To address the potential influence of confounding factors, survival analysis was performed using Kaplan-Meier survival curves, cumulative hazard analysis, and Cox regression modeling (proportional hazards model) to identify factors influencing survival probability in septic patients. Variables with p This manuscript was prepared in accordance with the Strengthening the Reporting of Observational Studies in Epidemiology (STROBE) guidelines for observational studies. Results The study included 30 patients with sepsis and an equal number of non-sepsis patients. Supplemental Table 2 p p p p p p Figure 1 p p p p Figure 1. Expression of inflammatory markers in septic and non-septic groups. Data is shown as mean fluorescence intensity (MFI) for each marker. IL: Interleukin; ISO: isotype control. Comparisons performed using the Mann–Whitney U p Graph illustrating the comparison of cytokine production between healthy and infected subjects Additionally, Figure 2 Supplemental Table 3 Figure 2. Receiver Operating Characteristic (ROC) curve illustrating the diagnostic performance of immune markers in distinguishing septic from non-septic cancer surgical patients. The ROC analysis demonstrates the sensitivity and specificity of individual markers: CD4%: AUC = 0.74, p p p p p MFI: mean fluorescence intensity; IL: Interleukin; ISO: isotype control; AUC: area under the curve, p Illustrative ROC curve mapping the diagnostic precision of specific immune markers to differentiate septic from non-septic cancer surgery cases. ROC demonstrates sensitivity, specificity of markers like CD4% (AUC=0.74; p=0.02), CD25% (AUC=0.99; p<0.001), CD4+/CD25+ T cells (AUC=0.99; p<0.001), IL-17 MFI/ISO (AUC=1.00; p<0.001), and IL-17% (AUC=1.00; p<0.001). These measures assess immune response. Moreover, Table 1 Table 1. Diagnostic performance of immune markers for identifying sepsis in postoperative surgical oncology patients. Target marker Cutoff > Sensitivity (%) 95% CI Specificity (%) 95% CI PPV (%) NPP (%) CD4% 32.7 71 0.5133–0.8678 70 0.3475–0.9333 70 71 CD25% 3.645 100 0.8766–1.000 90 0.5550–0.9975 91 100 CD4+CD25+ 1.835 96 0.8165–0.9991 100 0.6915–1.000 100 97 IL17% 1.125 100 0.8766–1.000 100 0.6915–1.000 100 100 MFI: mean fluorescence intensity; IL: Interleukin; ISO: isotype control; CI: Confidence interval; PPV: positive predictive value; NPP: negative predictive value. Septic patients had a median qSOFA score of 2 (IQR: 2–3). All patients had positive blood cultures; 90% of isolates were multidrug-resistant (MDR), and 10% were pan-drug-resistant (PDR). The most frequently isolated organisms were Klebsiella (50%), Acinetobacter (40%), and Pseudomonas (30%; Supplemental Table 4 Septic patients had a significantly longer median hospital length of stay (33 days (IQR: 11–72) vs 4 days (IQR: 2–17), p p Supplemental Table 5 Table 2 p Table 2. Univariate analysis of prognostic markers in relation to mortality among septic surgical oncology patients. Target marker Survival ( n Death ( n  p Median IQR Median IQR CD4% 42.8 43–56 43.84 28–55 0.91 CD25% 6.64 6–9 4.95 5–9 0.07 CD4+CD25+ 5.91 3–8 4.18 4–6 0.29 MFI IL17/ISO 4.46 4–5 3.62 3–5 0.23 IL17% 3.63 3–10 4.21 3–6 0.94 qSOFA 2 2–3 3 2–3  0.03  †† The numerical data presented as median and inter quartile range. n: number; IQR: inter quartile range; MFI: mean fluorescence intensity; IL: Interleukin; ISO: isotype control; qSOFA: quick Sequential Organ Failure Assessment †† Mann Whitney test, p Multivariate Cox regression ( Table 3 p p p p p p Table 3. Determinants of survival outcomes in patients with sepsis. Covariate CE HR 95% CI p CD4% −0.13 0.88 0.78 0.98 0.02 CD25% 0.13 1.14 0.93 1.41 0.22 CD4+CD25+ −0.02 0.98 0.69 1.40 0.92 MFI IL17/ISO −0.83 0.44 0.21 0.91 0.03 IL17% 0.08 1.09 0.92 1.29 0.33 qSOFA 0.64 1.90 0.45 7.93 0.38 Age 0.00 1.00 0.91 1.10 0.96 Sex (Male) −0.94 0.39 0.05 2.83 0.35 DM (Yes) −4.44 0.01 0.00 0.62 0.03 HTN (Yes) −1.57 0.21 0.02 2.34 0.20 IHD (Yes) 2.16 8.67 1.08 69.66 0.04 Acinetobacter (Yes) −1.60 0.20 0.00 8.37 0.40 Klebsiella (No) 6.14 463.83 7.32 29,390.52 0.001 Pseudomonas (Yes) −5.27 0.01 0.00 0.47 0.02 The test of significant: Cox regression analysis with proportional hazard model, p MFI: mean fluorescence intensity; IL: Interleukin; ISO: isotype control; qSOFA: quick Sequential Organ Failure Assessment; DM: Diabetes Mellitus; HTN: Hypertension; IHD: Ischemic Heart Disease; CE: Coefficient; HR: hazard ratio; CI: confidence interval. Furthermore, Supplemental Figure 3 Discussion The pathogenesis of sepsis involves a dysregulated host response to infection, marked by an imbalance between pro- and anti-inflammatory pathways. This immune dysfunction can result in both excessive inflammation and immunosuppression, leading to tissue damage and varied clinical outcomes.  21 IL-17 is derived from T cells and produced by various immune cells, including macrophages, dendritic cells, mast cells, and natural killer cells.  22 23 24 Interestingly, interleukin-17 (IL-17) plays a dual role in host defense against infections and the development of inflammatory disorders.  25  26 Our study demonstrates that IL17 expression was significantly associated with the development of sepsis. Furthermore, its expression exhibited perfect predictive accuracy for the condition. A previous study also showed that serum IL-17 levels have been shown to predict sepsis development and mortality in polytrauma patients.  27  25  16 Beyond its diagnostic and prognostic significance, IL-17 can also be a therapeutic target for neonatal sepsis. A study by Wynn et al. demonstrated that elevated IL-17A levels were associated with the detrimental effects of IL-18. The findings suggested that blocking IL-18, IL-1 receptor 1 (IL-1R1), or IL-17 signaling could serve as innovative therapeutic strategies to enhance outcomes for neonates with sepsis.  28 In our cohort, CD4+/CD25+ cells, alongside IL-17, demonstrated strong diagnostic value for sepsis, although they did not show a significant association with patient prognosis. Consistent with our findings, a study by Leng et al.  15  29 Sepsis-induced apoptosis contributes to lymphopenia in patients with septic shock, affecting various T cell subsets, including CD4⁺, CD8⁺, and natural killer (NK) cells, while sparing regulatory T cells (Tregs).  30  31  32 The persistent elevation of CD4⁺CD25⁺ regulatory T cells contributes to profound immunoparalysis and is linked to unfavorable outcomes. Consequently, sequential monitoring of these cells in the peripheral blood of septic patients may offer valuable insight into disease progression and assist in assessing prognosis.  33 Conclusions Our study provides a snapshot of immune alterations in patients with sepsis following cancer surgery, emphasizing the coexistence of active inflammation and immunoparalysis. These opposing immune responses reflect dysregulated immune cell function, resulting in failure to restore homeostasis. The observed increase in pro-inflammatory markers, particularly IL-17 expression, alongside elevated Treg marker expression, sheds light on the early immunological events and consequences of sepsis. Notably, this heightened pro-inflammatory response is associated with poorer prognosis. Combined strategies targeting both IL-17 signaling and Treg modulation could help balance inflammation and immune regulation, potentially improving outcomes in immunocompromised patients. Additionally, multiple sampling to monitor changes in these markers throughout the course of sepsis may provide valuable insights into the dynamic shifts in immune status. Flow cytometry offers a rapid and effective method for analyzing immune cell populations and their functional states. This approach enhances the understanding of immune dysfunction in sepsis and supports the identification of potential novel biomarkers. Developing predictive models that integrate large panels of flow cytometry data with genomic profiling can improve patient stratification and classification into distinct subgroups. Additionally, incorporating machine learning techniques with various clinical and laboratory parameters could significantly improve the accuracy of diagnosing sepsis severity and predicting patient outcomes. Strengths and limitations We consider flow cytometry to be superior to serum measurement of IL-17, as it enables the evaluation of IL-17 expression in conjunction with CD4 and CD25 markers. This approach provides important insights into the balance between pro-inflammatory and regulatory immune responses, which is particularly critical in sepsis and cancer patients. Unlike serum IL-17 levels, which may be elevated for various reasons, flow cytometry offers cell-specific functional data that allow for a more precise assessment of immune dysregulation. Our study has some limitations that should be acknowledged. First, we collected only a single sample from each patient, limiting our ability to capture dynamic changes in immune markers during the progression of sepsis. Another limitation is the relatively small sample size, which, although sufficient to meet power requirements, may limit the generalizability of our findings and introduces the potential for overfitting. While internal validation techniques such as bootstrapping and leave-one-out cross-validation were employed to mitigate this risk, the absence of an independent external validation cohort remains a limitation. To confirm and extend these results to broader ICU populations, larger, multicenter studies are warranted. A limitation of the data analysis step was the absence of formal correction for multiple comparisons (e.g. Bonferroni adjustment), which was not applied due to the limited number of predictors and the exploratory nature of the analysis. Additionally, we did not assess the functional activities of IL-17-producing cells or Tregs or conduct genetic or molecular analyses to better understand the underlying mechanisms of immune dysregulation. The absence of a broader marker panel, such as TNF-α or PD-1, may have restricted our insights. Confounding factors, including variability in cancer types, treatments, and patient health status, could also influence the results. Supplemental Material sj-docx-1-iji-10.1177_03946320251375162 – Supplemental material for Flow cytometry-based evaluation of CD4/CD25 and IL-17 expression in sepsis of cancer surgical patients Supplemental material, sj-docx-1-iji-10.1177_03946320251375162 for Flow cytometry-based evaluation of CD4/CD25 and IL-17 expression in sepsis of cancer surgical patients by Ahmed Samir Abdelhafiz, Asmaa Ali, Walaa Y Elsabeeny, Ahmed Fahmy, Merhan A Fouda, Mahmoud Ali Ayoub and Marwa Hanafi in International Journal of Immunopathology and Pharmacology Author contributions: Data availability: The authors declared no potential conflicts of interest with respect to the research, authorship, and/or publication of this article. Funding: Human ethics and consent to participate: Written informed consent was obtained from all guardians prior to study. Ethical approval for this study was obtained from the National Cancer Institute, Cairo University ethics committee (approval no IRB000004025) ORCID iD: https://orcid.org/0000-0003-4564-8073 Supplemental material: References 1. Singer M Deutschman CS Seymour CW et al 2016 The third international consensus definitions for sepsis and septic shock (Sepsis-3) JAMA 315 8 801 810 26903338 10.1001/jama.2016.0287 PMC4968574 2. Kahn JM Le T Angus DC et al 2015 The epidemiology of chronic critical illness in the United States Critical Care Medicine 43 2 282 287 25377018 10.1097/CCM.0000000000000710 PMC7901538 3. Gudiol C Albasanz-Puig A Cuervo G et al 2021 Understanding and managing sepsis in patients with cancer in the era of antimicrobial resistance Frontiers in Medicine 8 636547 33869250 10.3389/fmed.2021.636547 PMC8044357 4. Danai PA Moss M Mannino DM et al 2006 The epidemiology of sepsis in patients with malignancy Chest 129 6 1432 1440 16778259 10.1378/chest.129.6.1432 5. Lyons PG McEvoy CA Hayes-Lattin B 2023 Sepsis and acute respiratory failure in patients with cancer: How can we improve care and outcomes even further? Current Opinion in Critical Care 29 5 472 483 37641516 10.1097/MCC.0000000000001078 PMC11142388 6. Nelmes E Edwards L Jhanji S et al 2023 Patients with cancer and sepsis trials: An unfair representation? Clinical Medicine 23 6 635 636 38052465 10.7861/clinmed.2023-0408 PMC11046631 7. Windsor C Joseph A Pons S et al 2024 Previous treatment with anthracycline does not affect the course of sepsis in cancer patients: Retrospective cohort study Journal of Intensive Medicine 5 1 64 69 39872834 10.1016/j.jointm.2024.07.005 PMC11763860 8. Gudiol C Carratalà J 2014 Antibiotic resistance in cancer patients Expert Review of Anti-infective Therapy 12 8 1003 1016 24834465 10.1586/14787210.2014.920253 9. Mokart D Leone M Sannini A et al 2005 Predictive perioperative factors for developing severe sepsis after major surgery British Journal of Anaesthesia 95 6 776 781 16227337 10.1093/bja/aei257 10. Hiong A Thursky KA Teh BW et al 2016 Sepsis following cancer surgery: The need for early recognition and standardised clinical care Expert Review of Anti-infective Therapy 14 4 425 433 26882129 10.1586/14787210.2016.1154787 11. Castelli GP Pognani C Meisner M et al 2004 Procalcitonin and C-reactive protein during systemic inflammatory response syndrome, sepsis and organ dysfunction Critical Care 8 4 10.1186/cc2877 PMC522844 15312223 12. He RR Yue GL Dong ML et al 2024 Sepsis biomarkers: Advancements and clinical applications—A narrative review International Journal of Molecular Sciences 25 16 9010 39201697 10.3390/ijms25169010 PMC11354379 13. Ge Y Huang M Yao YM 2020 Biology of interleukin-17 and its pathophysiological significance in sepsis Frontiers in Immunology 11 1558 32849528 10.3389/fimmu.2020.01558 PMC7399097 14. Dominguez-Villar M Hafler DA 2011 Immunology. An innate role for IL-17 Science 332 6025 47 48 21454778 10.1126/science.1205311 15. Leng FY Liu JL Liu ZJ et al 2013 Increased proportion of CD4 + + + Journal of Microbiology, Immunology and Infection 46 5 338 344 10.1016/j.jmii.2012.06.012 22921804 16. Retnoningrum D Mulyono B Intansari US et al 2024 Interleukin-17 as predictor mortality of septic patients: A systematic review and meta-analysis Wiadomosci lekarskie 77 6 1134 1140 39106371 10.36740/WLek202406104 17. Sakr Y Jaschinski U Wittebole X et al 2018 Sepsis in intensive care unit patients: Worldwide data from the intensive care over nations audit Open Forum Infectious Diseases 5 12 10.1093/ofid/ofy313 PMC6289022 30555852 18. Evans L Rhodes A Alhazzani W et al 2021 Surviving sepsis campaign: International guidelines for management of sepsis and septic shock 2021 Critical Care Medicine 49 11 10.1097/CCM.0000000000005337 34605781 19. Marik PE Taeb AM 2017 SIRS, qSOFA and new sepsis definition Journal of Thoracic Disease 9 4 943 945 28523143 10.21037/jtd.2017.03.125 PMC5418298 20. Menon V Thomas R Ghale AR et al 2014 Flow cytometry protocols for surface and intracellular antigen analyses of neural cell types Journal of Visualized Experiments 94 52241 10.3791/52241 PMC4396953 25549236 21. Santacroce E D’Angerio M Ciobanu AL et al 2024 Advances and challenges in sepsis management: Modern tools and future directions Cells 13 5 439 38474403 10.3390/cells13050439 PMC10931424 22. Vahabi S Yadegari Z Pournaghi S 2020 The comparison of the salivary concentration of interleukin-17 and interleukin-18 in patients with chronic periodontitis and healthy individuals Dental Research Journal 17 4 280 286 33282154 PMC7688042 23. Cheng Y Yang X Zhang X et al 2019 Analysis of expression levels of IL-17 and IL-34 and influencing factors for prognosis in patients with lupus nephritis Experimental and Therapeutic Medicine 17 3 2279 2283 30783486 10.3892/etm.2019.7168 PMC6364195 24. Ali ET Masri MAM Siddig EE et al 2020 Immunohistochemical expression of interleukin-17 and hormonal receptors in benign and malignant breast lesions BMC Research Notes 13 1 300 32576277 10.1186/s13104-020-05146-7 PMC7310502 25. Zhang W Wang W Hou W et al 2022 The diagnostic utility of IL-10, IL-17, and PCT in patients with sepsis infection Frontiers in Public Health 10 923457 35937269 10.3389/fpubh.2022.923457 PMC9355284 26. Farhad SZ Rezazadeh F Mohammadi M 2019 Interleukin-17 and Interleukin-10 as inflammatory and prevention biomarkers in periimplant diseases International Journal of Preventive Medicine 10 137 31516678 10.4103/ijpvm.IJPVM_27_19 PMC6710915 27. Ahmed Ali M Mikhael ES Abdelkader A et al 2018 Interleukin-17 as a predictor of sepsis in polytrauma patients: A prospective cohort study European Journal of Trauma and Emergency Surgery 44 4 621 626 28916848 10.1007/s00068-017-0841-3 28. Wynn JL Wilson CS Hawiger J et al 2016 Targeting IL-17A attenuates neonatal sepsis mortality induced by IL-18 Proceedings of the National Academy of Sciences of the United States of America 113 19 10.1073/pnas.1515793113 PMC4868456 27114524 29. Saito K Wagatsuma T Toyama H et al 2008 Sepsis is characterized by the increases in percentages of circulating CD4+CD25+ regulatory T cells and plasma levels of soluble CD25 Tohoku Journal of Experimental Medicine 216 1 61 68 18719339 10.1620/tjem.216.61 30. Rimmelé T Payen D Cantaluppi V et al 2016 Immune cell phenotype and function in sepsis Shock 45 3 282 291 26529661 10.1097/SHK.0000000000000495 PMC4752878 31. Gao YL Yao Y Zhang X et al 2022 Regulatory T cells: Angels or demons in the pathophysiology of sepsis? Frontiers in Immunology 13 829210 35281010 10.3389/fimmu.2022.829210 PMC8914284 32. Venet F Pachot A Debard AL et al 2004 Increased percentage of CD4+CD25+ regulatory T cells during septic shock is due to the decrease of CD4+CD25- lymphocytes Critical Care Medicine 32 11 2329 2331 15640650 10.1097/01.ccm.0000145999.42971.4b 33. Cao C Ma T Chai YF et al 2015 The role of regulatory T cells in immune dysfunction during sepsis World Journal of Emergency Medicine 6 1 5 9 25802559 10.5847/wjem.j.1920-8642.2015.01.001 PMC4369532 ",
  "metadata": {
    "Title of this paper": "The role of regulatory T cells in immune dysfunction during sepsis",
    "Journal it was published in:": "International Journal of Immunopathology and Pharmacology",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12480818/"
  }
}