{
  "title": "Paper_1037",
  "abstract": "pmc Medicina (Kaunas) Medicina (Kaunas) 3494 medicina medicina Medicina 1010-660X 1648-9144 Multidisciplinary Digital Publishing Institute  (MDPI) PMC12471969 PMC12471969.1 12471969 12471969 41010998 10.3390/medicina61091609 medicina-61-01609 1 Article Outcome of Matrix Rotation Versus Single Incision Lateral Sulcus Mammoplasty in Upper Quadrant Breast Carcinomas https://orcid.org/0000-0001-6066-2215 Abdelrahman Emad M. 1 * † Mohsen Sherif M. 2 † Mohamed Amr G. 1 † Abdeen Mostafa S. 3 Elsayed Mohamed A. 3 https://orcid.org/0000-0001-6309-3484 Ibrahim Zizi M. 4 https://orcid.org/0000-0001-6888-5480 Abdelraouf Osama R. 5 Hegazy Hassan 6 https://orcid.org/0000-0002-9787-661X Abdelhalim Mahmoud G. 1 Dambrauskas Ẑilvinas Academic Editor 1 amr.g.m.2010@gmail.com mahmoud.gouda@fmed.bu.edu.eg 2 dr.sheriefmohsen@outlook.com 3 mustafa.abdeen@fmed.bu.edu.eg mohamed.elsayed@fmed.bu.edu.eg 4 zmibrahim@pnu.edu.sa 5 pt4.jed@bmc.edu.sa 6 hassan.hegazy@ksiu.edu.eg * emad.sarhan@fmed.bu.edu.eg † These authors contributed equally to this work. 05 9 2025 9 2025 61 9 497654 1609 06 7 2025 21 8 2025 03 9 2025 05 09 2025 27 09 2025 29 09 2025 © 2025 by the authors. 2025 https://creativecommons.org/licenses/by/4.0/ Published by MDPI on behalf of the Lithuanian University of Health Sciences. Licensee MDPI, Basel, Switzerland. This article is an open access article distributed under the terms and conditions of the Creative Commons Attribution (CC BY) license ( https://creativecommons.org/licenses/by/4.0/ Background and Objectives: Materials and Methods Results Conclusions MRF SLIM oncoplasty breast cancer Princess Nourah bint Abdulrahman University Researchers PNURSP2025R168 This research was funded by Princess Nourah bint Abdulrahman University Researchers Supporting Project number (PNURSP2025R168), Princess Nourah bint Abdulrahman University, Riyadh, Saudi Arabia. pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement no pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes 1. Introduction With a cure rate of over 95% in the early stages of breast cancer, multidisciplinary team therapy (MDT) significantly improves outcomes and prognoses [ 1 Breast-conserving surgery (BCS), consisting of wide local tumor excision followed by adjuvant radiotherapy, offers comparable survival outcomes to mastectomies and is considered a safe and effective alternative [ 2 3 Neoadjuvant chemotherapy (NACT) facilitates tumor downstaging in cases where the tumor-to-breast ratio initially precludes breast-conserving surgery (BCS). In addition, NACT may reduce the extent of the axillary surgery required in patients with node-positive disease [ 4 5 Approximately 30–40% of patients undergoing breast-conserving surgery (BCS) followed by adjuvant radiotherapy experience breast deformity and suboptimal cosmetic results due to the surgical cavity and radiation effects [ 6 Oncoplastic breast surgery, developed in 1996, combines principles of plastic surgery with breast-conserving surgery (BCS), thereby facilitating more extensive resections without compromising esthetic or oncological results [ 7 8 9 Sixty percent of breast cancers occur in the lateral breast quadrants, and many oncoplastic techniques have been developed for these cancers. Numerous methods have already been proven to combine oncological safety with acceptable esthetic outcomes, such as round block, inferior pedicle reduction, Matrix rotation, racquet mammoplasty, and single incision lateral sulcus mammoplasty. The selection of the surgical technique is influenced by multiple factors, including the tumor size, the breast volume, the anticipated cosmetic outcome, and the surgeon’s level of expertise. Most of these techniques cause scarring near the nipple–areola complex (NAC), leading to its deviation, which can significantly diminish esthetic results and complicate the management of upper outer quadrant breast masses [ 10 11 12 When larger tumors are removed, the nipple–areolar complex (NAC) often deforms and shifts laterally and upward. This deformity is associated with increased patient dissatisfaction and can sometimes be worsened by postoperative radiation therapy [ 13 14 This study aims to evaluate and compare the single incision lateral mammoplasty (SILM) technique as an oncoplastic procedure for managing breast carcinoma in the lateral breast quadrant with the matrix rotation flap (MRF) technique. The comparison focuses on cosmetic and oncologic outcomes and patient satisfaction. 2. Materials and Methods 2.1. Study Design This study was carried out between April 2021 and June 2024 in accordance with the ethical standards outlined in the Declaration of Helsinki. Sixty-eight female patients with breast cancer in the outer quadrants of the breast who were eligible for wide local excision and reconstruction using either MRF or SLIM were included. Exclusion criteria included individuals with advanced or metastatic breast cancer. Patients with a history of prior irradiation or contraindications to radiotherapy, as well as those with scleroderma or collagen diseases, were excluded. Additionally, patients who declined to participate in the study were also excluded. Randomization was conducted with Random Allocation Software (version 1.0, 2011), assigning patients equally to the two study groups. The software generated an unpredictable random sequence and implemented it in a way that conceals the treatments until patients are officially assigned to their respective groups. An independent investigator performed the randomization. Patients, surgeons, outcome assessors, and data analysts were blinded to group allocation. This single-blind randomized controlled trial was performed after participants received detailed information on both surgical techniques and their anticipated outcomes. Clinical trial registry at https://clinicaltrials.gov/study/NCT07022509 Group A ( n n Figure 1 This multicenter study was carried out at the Departments of General Surgery at Benha University and Ain Shams University. The study design was reviewed and approved by the institutional ethics committee, and written informed consent was obtained from all participants. Preoperative assessment included detailed history taking, comprehensive breast and axillary examination, and bilateral sonomammography for all patients. The malignant nature of the lesion was verified by a true-cut needle or excisional biopsy. Patients with locally advanced T4 tumors, inflammatory carcinoma, or distant metastases were not eligible for inclusion. Individuals with multicentric breast cancer in more than one quadrant and diffuse microcalcifications were also excluded. 2.2. Surgical Procedure 2.2.1. Preoperative Considerations and Flap Design To ensure an accurate assessment of the anatomical landmarks, the markings were made while the patient was upright, either sitting or standing. Breast defect volume was assessed by marking the lateral breast border and resection margins. The flap was then outlined for transposition, with a length of 8–11 cm measured from the deformity edge to the posterior axillary line. The flap width, typically ranging from 3 to 6 cm, was determined to ensure tension-free donor site closure. Flap thickness—generally ranging from 2 to 5 cm, depending on the amount of available skin and subcutaneous tissue—was estimated using the pinching test. The base of the flap, located at the anterior axillary fold, is usually smaller than its sides, which are more convex to maximize tissue harvest. Perforators cannot be detected with handheld Doppler ultrasonography. The patient was positioned supine, with the ipsilateral arm abducted at 90° to facilitate lymph node surgery (dissection and/or sentinel lymph node biopsy). Preoperative planning included assessment of breast size, tumor size, tumor location, and estimated defect volume, followed by repeated confirmation of surgical markings. Group A: MRF Group ( Figure 2 Figure 3    Operative technique ( Figure 3 Following the induction of muscle relaxation and general endotracheal anesthesia. The operation was performed in three stages as follows: The first stage is tumor resection: The second stage involves axillary surgery: The third stage involves flap harvesting and reconstruction: Flap harvesting was performed by incising the skin and subcutaneous tissue and beveling the surrounding fat to maximize tissue volume. The fascia overlying the latissimus dorsi and serratus anterior muscles was elevated together with the flap. To achieve sufficient flap mobilization into the defect, selected lateral intercostal perforators were ligated and divided. The skin covering the excised flap is de-epithelialized to ensure its vascularity. In cases where the overlying skin was excised with the tumor, the remaining flap was de-epithelialized. The tissue bridge between the donor site and the defect was divided, and a skin paddle was designed and tailored to conform to the dimensions of the defect. Following rotation and insertion of the flap into the breast defect, the flap margins were secured to the pectoral fascia using 2/0 Vicryl sutures. Usually, only one surgical drain is left in the breast area, not at the flap donor site. The incision made at the donor location is closed in layers. Group B: Lateral Mammoplasty Group ( Figure 4 Figure 5    Preoperative planning and marking A safety margin of 1 cm was used to localize the tumor. An imaginary line was then drawn from the inframammary fold upward toward the outer border of the pectoralis major muscle, delineating the lateral boundary of the breast. On this line, a 7–10 cm incision was deeply marked facing the tumor’s location. The procedure was performed in three phases. The first stage was tumor excision. The second stage was axillary surgery. Figure 4 Closure is the third stage. 2.3. Follow-Up and Outcomes All patients were discharged on the first postoperative day with drains in situ. Drains were removed once the output decreased to less than 50 cc over 24 h. To plan adjuvant treatment and assess surgical complications, patients were evaluated in the outpatient clinic at one and two weeks. All patients were scheduled for review by our interdisciplinary team every four months during the first two years. Each year, a bilateral sonomammography was performed. All patients were followed for at least 14 months and up to 36 months for the first included cases. Both postoperative complications and esthetic outcomes were reported. The primary outcome The secondary outcome For each patient, operative time, resection margin status, and postoperative complications, including wound infection, wound dehiscence, hematoma, seroma, nipple–areola complex (NAC) changes, skin slough or necrosis, and alterations in NAC sensation were evaluated. Cosmetic outcomes were assessed based on breast symmetry, scarring, and patient satisfaction and graded using a five-point Likert scale, with scores defined as follows: 1 = excellent, 2 = good, 3 = fair, 4 = poor, and 5 = bad [ 16 17 2.4. Statistical Analysis Sample size was calculated using GPower 3.1 software (Düsseldorf, Germany). Each group initially included 34 patients, accounting for a 20% anticipated dropout rate during the follow-up period. Calculations were based on an effect size of 0.9, a statistical power of 95%, and a type I error rate of 0.05. Data was analyzed using IBM SPSS software version 21.0 (IBM Corp., Chicago, IL, USA). Statistical significance was set at p t p 3. Results This study enrolled a total of 68 patients. The mean age was 51.4 ± 9.4 years in Group A and 52.6 ± 8.1 years in Group B. There were no significant differences between the groups regarding sociodemographic factors or preoperative tumor characteristics ( Table 1 The operative time was significantly shorter in patients who underwent the SLIM compared to those who underwent the MRF procedure ( p Table 2 The safety margin of the excised tissue was negative in all included patients, Table 2 Regarding the assessment of postoperative outcomes, 14.7% and 11.8% of patients in Group A reported a hematoma or seroma, respectively, which were higher rates than those in Group B, where a hematoma and seroma were reported in 5.9% of patients. Wound infection and fat necrosis were also more common in Group A compared to Group B. An areola deviation was observed in patients who underwent the MRF procedure. Breast asymmetry was objectively assessed by comparing the breast size and the position of the nipple–areola complex (NAC) relative to the contralateral breast. Asymmetry occurred in 20.6% of patients in Group A and in 23.5% of patients in Group B. One case in each group experienced local recurrence during follow-up, presenting as a small mass despite negative pathological margins, and received the protocol of adjuvant and neoadjuvant chemotherapy Table 3 Table 4 Figure 6 4. Discussion Breast conservation therapy (BCT), comprising a wide local excision followed by postoperative radiotherapy, offers an effective approach to mitigate the psychological and physical drawbacks associated with mastectomies in breast cancer patients. Additionally, restoring the shape and contour while maintaining oncologic safety is facilitated by integrating plastic surgical techniques into breast cancer surgery [ 18 In the present study, 64 female patients were included, with a mean age of 51.4 ± 9.4 years in Group A and 52.6 ± 8.1 years in Group B. The main T stage of the patients was T2, consistent with the results of Lin et al. [ 19 20 21 Optimizing healing, functional outcomes, and the overall quality of life in breast cancer patients necessitates a comprehensive, multidisciplinary approach to postoperative care. An adequate recovery depends on the coordinated efforts of a team that includes oncologic surgeons, plastic surgeons, radiation oncologists, physiotherapists, psychiatrists, dietitians, and specialized nursing staff [ 22 23 24 25 26 An additional popular technique among breast surgeons is the matrix rotation approach. This method is straightforward, provides enough glandular tissue for breast repair and reconstruction, and is most effective for UIQ cancers located away from the NAC. The main drawback of this approach is that the skin in front of the tumor must be removed, even if it is oncologically clear. As a result, the visible breast line crossing the UIQ becomes an unsightly scar [ 15 19 27 When it comes to scar concealment, the lateral sulcus incision is among the best options. For laterally positioned early breast cancer, the lateral mammary sulcus approach is a level 1 OPBS in which the lump is removed in two planes, if necessary, after an adipofascial flap or glandular rotational flap is created to seal the defect properly. In a concealed site that is not visible when the patient is seated, the lateral method allows for the tumor removal with an adequate margin of safety. It enables an axillary operation using a single incision [ 28 29 In the series by Van Paridon et al. [ 30 According to Al Kelany et al. [ 28 31 Additionally, Fayed et al. [ 29 According to Fayed et al. [ 29 Patients in the MRF group (A) experienced hematomas in 14.7% of cases, compared to 5.9% in Group B. This difference was statistically significant ( p 19 Based on the findings of this study, Kaviani et al. [ 32 Furthermore, as suggested by Massy et al. [ 33 In a total of 21.44% of patients who underwent matrix rotation, results were favorable: 50% experienced good results, 21.44% had fair outcomes, and 7.14% encountered negative results, according to Sakr et al. [ 34 34 The second problem is that the matrix rotation technique produces less-than-ideal cosmetic results for large ptotic breasts. Therefore, it is considered suitable for mild to moderate ptosis cases [ 35 Letzkus et al. [ 27 The correlation between the observer’s evaluation and the patient’s satisfaction and assessment is essential for assessing the esthetic outcome as well as the validity and reliability of any evaluation scores. The VSS is one of the most reliable and widely used assessment tools for postoperative outcomes. In this study, a strong correlation was observed between the VSS and patient satisfaction, indicating the reliability of the results [ 36 A systematic review was conducted of 25 papers reporting cosmetic outcomes in 1962 patients who underwent oncoplastic breast-conserving surgery. Excellent, good, fair, and poor results were observed in 55.3%, 32.0%, 9.5%, and 5.4% of patients, respectively. Most research indicates that over 90% of patients who had OBCS experienced satisfactory cosmetic outcomes [ 32 37 38 Abdelrahman et al. [ 39 In their study in 2021, Cantürk et al. [ 12 No patients in either group in the current study reported needing to reposition or synchronize the NAC, which aligns with the findings of Hamed et al. [ 40 5. Limitations The primary limitation of this study was the relatively small number of well-designed prior studies available for direct comparison. Other limitations included subjectively assessed outcomes and the limited follow-up for oncologic endpoints, as some cases were followed for only 14 months. This short follow-up period was a weakness of this study, since oncological safety requires an evaluation over a longer duration. The study population’s characteristics that might impact generalizability (e.g., BMI range) and the inherent variability in a multicenter study also pose limitations. Additionally, differences among centers and surgeons introduce potential variability, and the involvement of multiple centers increases the likelihood of external variability and operator-related bias. 6. Conclusions Compared to matrix rotation, single incision lateral mammoplasty results in a significantly lower rate of postoperative hematoma, minor seroma, minimal blood loss, reduced areolar deviation, and improved breast symmetry. Both MRF and SLIM techniques produce acceptable cosmetic outcomes. However, longer-term follow-up is needed to determine the definitive oncological equivalence between the techniques. Acknowledgments The authors express their sincere appreciation to Princess Nourah bint Abdulrahman University Researchers Supporting Project number (PNURSP2025R168), Princess Nourah bint Abdulrahman University, Riyadh, Saudi Arabia. Disclaimer/Publisher’s Note: Author Contributions Conceptualization, A.G.M., E.M.A. and S.M.M. Methodology, A.G.M., E.M.A., S.M.M., M.S.A., M.A.E. and M.G.A. Software: O.R.A. Formal analysis: M.A.E. and H.H. Resources: Z.M.I. Data curation, M.S.A. writing—original draft preparation: A.G.M., E.M.A., S.M.M., M.G.A., Z.M.I. and H.H. Visualization: A.G.M., E.M.A. and S.M.M. Writing, review and editing: Z.M.I. and O.R.A. Supervision: O.R.A. Project administration: Z.M.I. Funding acquisition, Z.M.I. All authors have read and agreed to the published version of the manuscript. Institutional Review Board Statement This study was conducted following the Declaration of Helsinki and was approved by the Institutional Review Board, Benha University. The IRB code: RC 9-4-2022. The final approval for publication date: 2 June 2024. Informed Consent Statement Informed consent was obtained from all subjects involved in this study. Written informed consent has been obtained from the patients to publish this paper. Data Availability Statement Data from this work are available from the authors and have not been published elsewhere. Conflicts of Interest The authors declare that they have no conflicts of interest. References 1. Siegel R.L. Miller K.D. Jemal A. Cancer statistics, 2019 CA Cancer J. Clin. 2019 69 7 34 10.3322/caac.21551 30620402 2. Fisher B. Anderson S. Conservative surgery for the management of invasive and noninvasive carcinoma of the breast: NSABP trials. National Surgical Adjuvant Breast and Bowel Project World J. Surg. 1994 18 63 69 10.1007/BF00348193 8197778 3. Veronesi U. Zucali R. Luini A. Local control and survival in early breast cancer: The Milan trial Int. J. Radiat. Oncol. Biol. Phys. 1986 12 717 720 10.1016/0360-3016(86)90027-1 3519549 4. Fisher B. Brown A. Mamounas E. Wieand S. Robidoux A. Margolese R.G. Cruz A.B. Fisher E.R. Wickerham D.L. Wolmark N. Effect of preoperative chemotherapy on local-regional disease in women with operable breast cancer: Findings from National Surgical Adjuvant Breast and Bowel Project B-18 J. Clin. Oncol. 1997 15 2483 2493 10.1200/JCO.1997.15.7.2483 9215816 5. Rouzier R. Extra J.-M. Carton M. Falcou M.-C. Vincent-Salomon A. Fourquet A. Pouillart P. Bourstyn E. Primary chemotherapy for operable breast cancer: Incidence and prognostic significance of ipsilateral breast tumor recurrence after breast-conserving surgery J. Clin. Oncol. 2001 19 3828 3835 10.1200/JCO.2001.19.18.3828 11559720 6. Clough K.B. Cuminet J. Fitoussi A. Nos C. Mosseri V. Cosmetic sequelae after conservative treatment for breast cancer: Classification and results of surgical correction Ann. Plast. Surg. 1998 41 471 481 10.1097/00000637-199811000-00004 9827948 7. Gabka C.J. Bohmert H. Future prospects for reconstructive surgery in breast cancer Semin. Surg. Oncol. 1996 12 67 75 10.1002/(sici)1098-2388(199601/02)12:1&#x0003c;67::aid-ssu10&#x0003e;3.3.co;2-2 8821412 8. Munhoz A.M. Montag E. Gemperli R. Oncoplastic breast surgery: Indications, techniques and perspectives Gland Surg. 2013 2 143 157 10.3978/j.issn.2227-684X.2013.08.02 25083476 PMC4115743 9. Clough K.B. Lewis J.S. Couturaud B. Fitoussi A. Nos C. Falcou M.C. Oncoplastic techniques allow extensive resections for breast-conserving therapy of breast carcinomas Ann. Surg. 2003 237 26 34 10.1097/00000658-200301000-00005 12496527 PMC1513973 10. McCulley S.J. Durani P. Macmillan R.D. Therapeutic mammaplasty for centrally located breast tumors Plast. Reconstr. Surg. 2006 117 366 373 10.1097/01.prs.0000200874.31320.c2 16462314 11. Huemer G.M. Schrenk P. Moser F. Wagner E. Wayand W. Oncoplastic techniques allow breast-conserving treatment in centrally located breast cancers Plast. Reconstr. Surg. 2007 120 390 398 10.1097/01.prs.0000267328.09246.02 17632339 12. Cantürk N.Z. Şimşek T. Gürdal S.Ö. Oncoplastic Breast-Conserving Surgery According to Tumor Location Eur. J. Breast Health 2021 17 220 233 10.4274/ejbh.galenos.2021.2021-1-2 34263149 PMC8246052 13. Staub G. Fitoussi A. Falcou M.C. Salmon R.J. Résultats carcinologiques et esthétiques du traitement du cancer du sein par plastie mammaire. 298 cas [Breast cancer surgery: Use of mammaplasty. Results. Series of 298 cases] Ann. Chir. Plast. Esthet. 2008 53 124 134 (In French) 10.1016/j.anplas.2007.05.012 17949880 14. Berrino P. Campora E. Santi P. Postquadrantectomy breast deformities: Classification and techniques of surgical correction Plast. Reconstr. Surg. 1987 79 567 572 10.1097/00006534-198704000-00010 3823249 15. Wijesinghe K. Jayarajah U. De Silva A. Aesthetic and surgical outcomes of the modified matrix rotation technique for upper inner quadrant breast tumors: A case series J. Int. Med. Res. 2024 52 3000605241239852 10.1177/03000605241239852 38548471 PMC10981239 16. Abdelrahman E.M. Shoulah A.A. Ghazal S.O. Nchoukat M.K. Balbaa M.A. Cheek advancement flap for nasal reconstruction following surgical excision of basal cell carcinoma: Early outcome and patient satisfaction Egypt. J. Surg. 2021 40 322 329 17. Chae J.K. Kim J.H. Kim E.J. Park K. Values of a patient and observer scar assessment scale to evaluate the facial skin graft scar Ann. Dermatol. 2016 28 615 623 10.5021/ad.2016.28.5.615 27746642 PMC5064192 18. Parmar V. Hawaldar R. Badwe R.A. Safety of partial breast reconstruction in extended indications for conservative surgery in breast cancer Indian J. Surg. Oncol. 2010 1 256 262 10.1007/s13193-011-0052-z 22693374 PMC3244242 19. Lin J. Chen D.R. Wang Y.F. Lai H.W. Oncoplastic Surgery for Upper/Upper Inner Quadrant Breast Cancer PLoS ONE 2016 11 e0168434 10.1371/journal.pone.0168434 28030581 PMC5193402 20. Wong J.S. Chen Y.-H. Gadd M.A. Gelman R. Lester S.C. Schnitt S.J. Sgroi D.C. Silver B.J. Smith B.L. Troyan S.L. Eight-year update of a prospective study of wide excision alone for small low- or intermediate-grade ductal carcinoma in situ (DCIS) Breast Cancer Res. Treat. 2014 143 343 350 10.1007/s10549-013-2813-6 24346130 21. Szynglarewicz B. Maciejczyk A. Forgacz J. Matkowski R. Breast segmentectomy with rotation mammoplasty as an oncoplastic approach to extensive ductal carcinoma in situ World J. Surg. Oncol. 2016 14 72 10.1186/s12957-016-0825-5 26956623 PMC4784271 22. Leclerc A.F. Jerusalem G. Devos M. Crielaard J.M. Maquet D. Multidisciplinary management of breast cancer Arch. Public Health 2016 74 50 10.1186/s13690-016-0163-7 27980734 PMC5137213 23. Filip A.C. Marcu O.A. Pop M.S. Debucean D. The multidisciplinary approach to breast cancer—The role of support specialties before and after mastectomy Arch. Balk. Med. Union 2020 55 437 445 10.31688/ABMU.2020.55.3.09 24. Fabi A. Rossi A. Mocini E. Cardinali L. Bonavolontà V. Cenci C. Magno S. Barberi V. Moretti A. Besharat Z.M. An Integrated Care Approach to Improve Wellbeing in Breast Cancer Patients Curr. Oncol. Rep. 2024 26 346 358 10.1007/s11912-024-01500-1 38400984 PMC11021235 25. de la Torre-Montero J.C. Casla-Barrio S. Herrero-López B. García-Saénz J.Á. Editorial: Exercise, physical therapy, and wellbeing in breast cancer patients Front. Oncol. 2023 13 1118718 10.3389/fonc.2023.1118718 36865789 PMC9972489 26. Juvet L. Thune I. Elvsaas I.K.Ø. Fors E. Lundgren S. Bertheussen G. Leivseth G. Oldervoll L. The effect of exercise on fatigue and physical functioning in breast cancer patients during and after treatment and at 6 months follow-up: A meta-analysis Breast 2017 33 166 177 10.1016/j.breast.2017.04.003 28415013 27. Letzkus J. Río M.J. del Rencoret C. Belmar A. Ivanova G. Hidalgo D. Gamboa J. Burow’s triangle advancementflap: A reliabletool on oncoplastic breast-conserving surgery Mastology 2021 31 e20200087 28. Alkelany A. Hagag M. Bakr F. Abdella A. Eldesouky M. Lateral Sulcus Mammoplasty as an Oncoplastic Technique in the Management of Laterally Located Breast Cancer Menoufia Med. J. 2024 37 154 159 29. Fayed M. Sharaan M. Gebaly A. Asal F. Oncoplastic surgery for laterally located breast cancer: A new approach Clin. Surg. 2020 5 2790 30. van Paridon M.W. Kamali P. Paul M.A. Wu W. Ibrahim A.M. Kansal K.J. Houlihan M.J. Morris D.J. Lee B.T. Lin S.J. Oncoplastic breast surgery: Achieving oncological and aesthetic outcomes J. Surg. Oncol. 2017 116 195 202 10.1002/jso.24634 28464217 31. Singh G. Kohli P.S. Bagaria D. Lateral oncoplastic breast surgery (LOBS) e a new surgical technique and short term results Am. J. Surg. 2018 216 1166 1170 10.1016/j.amjsurg.2017.09.016 28954713 32. Kaviani A. Sodagari N. Sheikhbahaei S. Eslami V. Hafezi-Nejad N. Safavi A. Noparast M. Fitoussi A. From radical mastectomy to breast-conserving therapy and oncoplastic breast surgery: A narrative review comparing oncological result, cosmetic outcome, quality of life, and health economy ISRN Oncol. 2013 2013 742462 10.1155/2013/742462 24167743 PMC3791839 33. Massey E.J.D. Gouveia P.F. Nos C. Poulet B. Sarfati I. Clough K.B. A new level 1 oncoplastic technique for breast conserving surgery: Rotation glandular flap Breast 2013 22 186 189 10.1016/j.breast.2013.01.012 23465715 34. Sakr A. Elsisi A. Rageh T. Shahin M. Modified Inferior Based Reduction Mammoplasty Versus Matrix Rotational Flap in Upper Inner Quadrant Breast Cancer Menoufia Med. J. 2023 36 10 10.59204/2314-6788.1052 35. Shehata M. Rizk M. Fouad H. Mostafa T.Y. Therapeutic mammoplasty: Is it a solution for treatment of early breast cancer? Egypt. J. Plast. Reconstr. Surg. 2021 45 201 210 10.21608/ejprs.2021.201628 36. Draaijers L.J. Tempelman F.R. Botman Y.A. Tuinebreijer W.E. Middelkoop E. Kreis R.W. van Zuijlen P. The Patient and Observer Scar Assessment Scale: A Reliable and Feasible Tool for Scar Evaluation Plast. Reconstr. Surg. 2004 113 1960 1965 10.1097/01.PRS.0000122207.28773.56 15253184 37. Fitoussi A.D. Berry M.G. Famà F. Falcou M.C. Curnier A. Couturaud B. Reyal F. Salmon R.J. Oncoplastic breast surgery for cancer: Analysis of 540 consecutive cases Plast. Reconstr. Surg. 2010 125 454 462 10.1097/PRS.0b013e3181c82d3e 20124831 38. Haloua M.H. Krekel N.M. Winters H.A. Rietveld D.H. Meijer S. Bloemers F.W. Tol M.P.v.D. A systematic review of oncoplastic breast-conserving surgery: Current weaknesses and future prospects Ann. Surg. 2013 257 609 620 10.1097/SLA.0b013e3182888782 23470508 39. Abdelrahman E.M. Nawar A.M. Balbaa M.A. Shoulah A.A. Shora A.A. Kharoub M.S. Oncoplastic Volume Replacement for Breast Cancer: Latissimus Dorsi Flap versus Thoracodorsal Artery Perforator Flap Plast. Reconstr. Surg. Glob. Open 2019 7 e2476 10.1097/GOX.0000000000002476 31772899 PMC6846317 40. Hamed E. Khater A. Atef A. Hosam A. Oncologic and Aesthetic Outcomes of Matrix Rotation Mammoplasty in Management of Upper Inner Quadrant Breast Cancer: A Single Centre Experience Indian J. Surg. Oncol. 2024 16 228 233 10.1007/s13193-024-02058-x 40114894 PMC11920548 Figure 1 Consort flow chart. Figure 2 Schematic diagram for MRF [modified from Wijesinghe K et al. [ 15 Figure 3 MRF ( A B C D E F Figure 4 SLIM Technique: ( A B C Figure 5 Esthetic outcome following SLIM Technique. Figure 6 Correlation between VSS and patient satisfaction. medicina-61-01609-t001_Table 1 Table 1 Patients’ demographic data and tumor characteristics. Variable  Group A n Group B n p  Age Mean ± SD 51.4 ± 9.4 52.6 ± 8.1 0.575  BMI Mean ± SD 29.8 ± 3.11 28.3 ± 4.2 0.99  Comorbidities  Smoking n 6 (17.7%) 7 (20.6%) 0.9  Diabetes mellitus n 4 (11.8%) 3 (8.8%) 0.82  Hypertension n 4 (11.8%) 5 (14.7%) 0.85  Ischemic heart disease n 2 (5.9%) 2 (5.9%) 1.00  Tumor Characteristics  Tumor Size  T1 n 7 (20.6%) 5 (14.7%) 0.752  T2 n 21 (61.7%) 23(67.6%) 0.8  T3 n 6 (17.7%) 6 (17.7%) 1.00 medicina-61-01609-t002_Table 2 Table 2 Operative findings. Variable  Group A n Group B n p Mean Difference (95% CI)  Operative time (Min) Mean ± SD 124.6 ± 23.2 106.3 ± 17.3 <0.001 * 18.3 (8.39–28.21)  Hospital stay (Days) Mean ± SD 2.7 ± 0.89 2.3 ± 0.76 0.051 0.4 (0.0007–0.8)  Mean postoperative follow-up (Months) Mean ± SD 13.2 ± 2.4 13.6 ± 3.1 0.554 0.4 (−1.47–0.94)  Safety margin n   1.00 ----  Positive 0 (0%) 0 (0%)  Negative 34 (100%) 34 (100%) * means statistically significant. medicina-61-01609-t003_Table 3 Table 3 Postoperative sequelae. Postoperative Complications  Group A n Group B n p Odds Ratio (95% CI)  Hematoma n 5 (14.7%) 2 (5.9%) <0.001 * 2.759 (0.51–14.5)  Seroma n 4 (11.8%) 2 (5.9%) 0.014 * 2.133 (0.46–11.73)  Wound infection n 4 (11.8%) 1 (2.95%) <0.001 * 4.4 (0.65–55.23)  Marginal skin necrosis n 1 (2.95%) 1 (2.95%) 1.00 1.0 (0.05–19.52)  NAC necrosis n 0 (0%) 0 (0%) 1.00 ----  Impaired NAC sensation n 0 (0%) 0 (0%) 1.00 ----  Fat necrosis n 4 (11.8%) 2 (5.9%) 0.014 * 2.133 (0.46–11.73)  Areola deviation n 5 (14.7%) 1 (2.95%) <0.001 * 5.69 (0.68–68.76)  Asymmetry n 7 (20.6%) 8 (23.5%) 0.072 0.843 (0.28–2.45)  Local recurrence n 1 (2.95%) 1 (2.95%) 1.00 1.0 (0.05–19.52)  Time of recurrence (months) Mean 11 13.  0.083  Distant metastasis n 0 (0%) 0 (0%)  ---- * means statistically significant. medicina-61-01609-t004_Table 4 Table 4 Assessment of cosmetic outcomes. Variable  Group A n Group B n p  Likert Scale Excellent n 11 (32.4%) 17 (50%) <0.001 * Good n 13 (38.2%) 14 (41.2%) 0.9 Fair n 9 (26.5%) 3 (8.8%) <0.001 * Poor n 1 (2.95%) 0 (0%) 0.92 Bad n 0 (0%) 0 (0%) 1.00  Vancouver Scar Scale Median (IQR) 3.5 (4) 2.5 (2) <0.001 *  Vancouver Scar Components’ Score  Vascularity Mean ± SD 1.2 ± 0.34 0.55 ± 0.13 0.01 *  Pigmentation Mean ± SD 1.3 ± 0.26 1.1 ± 0.18 0.86  Pliability Mean ± SD 2.1 ± 0.32 0.7 ± 0.12 0.001 *  Height (mm) Mean ± SD 1.4 ± 0.22 1.1 ± 0.2 0.63 * means statistically significant. ",
  "metadata": {
    "Title of this paper": "Oncologic and Aesthetic Outcomes of Matrix Rotation Mammoplasty in Management of Upper Inner Quadrant Breast Cancer: A Single Centre Experience",
    "Journal it was published in:": "Medicina",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12471969/"
  }
}