{
  "title": "Paper_1087",
  "abstract": "pmc J Pers Med J Pers Med 2605 jpersmed jpm Journal of Personalized Medicine 2075-4426 Multidisciplinary Digital Publishing Institute  (MDPI) PMC12470870 PMC12470870.1 12470870 12470870 41003134 10.3390/jpm15090431 jpm-15-00431 1 Review Metabolic Signature of FLT3 Banella Cristina 1 Catalano Gianfranco 2 3 https://orcid.org/0000-0003-0750-4706 Calvani Maura 1 Candi Eleonora 4 https://orcid.org/0000-0001-7682-862X Noguera Nelida Ines 2 3 * https://orcid.org/0000-0002-5411-1502 Travaglini Serena 4 * Puthanveetil Prasanth Academic Editor 1 cristina.banella@meyer.it maura.calvani@meyer.it 2 gfcatal@uniroma2.it 3 4 candi@uniroma2.it * nelida.ines.noguera@uniroma2.it serena.travaglini@uniroma2.it 08 9 2025 9 2025 15 9 497650 431 26 6 2025 09 8 2025 29 8 2025 08 09 2025 27 09 2025 27 09 2025 © 2025 by the authors. 2025 https://creativecommons.org/licenses/by/4.0/ Licensee MDPI, Basel, Switzerland. This article is an open access article distributed under the terms and conditions of the Creative Commons Attribution (CC BY) license ( https://creativecommons.org/licenses/by/4.0/ Acute Myeloid Leukemia (AML) is a genetically and clinically heterogeneous malignancy marked by poor prognosis and limited therapeutic options, especially in older patients. While conventional treatments such as the “7 + 3” chemotherapy regimen and allogeneic stem cell transplantation remain standard care options, the advent of next-generation sequencing (NGS) has transformed our understanding of AML’s molecular complexity. Among the emerging hallmarks of AML, metabolic reprogramming has gained increasing attention for its role in supporting leukemic cell proliferation, survival, and therapy resistance. Distinct AML subtypes—shaped by specific genetic alterations, including FLT3 NPM1 IDH FLT3 FLT3 Acute Myeloid Leukemia FLT3 metabolic plasticity metabolic targeting AIRC 30924 MUR-PNRR M4C2I1.3 University Scientific Research Call RSA 2024, UTV DR 3392 AIRC (AIRC Foundation for Cancer Research, Italy), ID. 30924; The research leading to these results received funding from AIRC under IG 2024—ID. 30924 project—P.I. (N.I.N). Financial support was also provided to N.I.N. via a project funded under the University Scientific Research Call RSA 2024, UTV (DR 3392, dated 23 October 2024), and further support was provided by the MUR-PNRR M4C2I1.3 PE6 project PE00000019 Heal Italia. pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement no pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes 1. Introduction Acute Myeloid Leukemia (AML) is a highly heterogeneous and aggressive hematologic malignancy that primarily affects older adults [ 1 2 3 4 5 6 Among emerging biomarkers, metabolic reprogramming represents one of the major hallmarks of cancer, playing a crucial role in cancer cell growth, migration, and metastatic progression [ 7 8 9 10 11 12 13 Metabolic plasticity also plays a pivotal role in leukemia initiation and progression [ 14 FLT3 15 FLT3 NPM1 IDH1 IDH2 16 17 18 19 20 21 22 23 IDH 18 24 Herein, we provide an in-depth exploration of the role of cellular metabolism in AML, with a particular focus on recent discoveries regarding metabolic alterations associated with FLT3 FLT3 FLT3 25 26 27 28 29 30 2. Clinical and Molecular Features of FLT3 AML is a complex and rapidly progressing malignancy, where the prognosis and treatment outcome are significantly influenced by the underlying genetic and molecular features. Recent advances in molecular biology, with the widespread use of NGS technologies, have uncovered crucial genetic alterations, allowing for an integrated approach that takes into account clinical and laboratory characteristics. This integrated approach has led to improved prognostic stratification and treatment personalization. Among the most frequently mutated genes in AML, somatic alterations of the FLT3 FLT3 FLT3 31 32 33 34 FLT3 35 36 37 Amidst the ongoing advances in the molecular characterization and prognostic stratification of AML patients, the metabolic profile of leukemic cells remains largely overlooked. While the emerging role of metabolism in tumor initiation, progression, and response to therapy has been increasingly recognized, the precise contribution of these cellular metabolic networks to key cancer cell functions is far from being fully understood. 3. Metabolic Dependencies in FLT3 Hematopoietic stem cells (HSCs), referred to as ‘dormant’ (dHSCs), exhibit low metabolic demands within the bone marrow niche. In their dormant state, HSCs primarily rely on aerobic glycolysis (AG) to maintain low levels of ROS and energy production. However, upon activation, they shift toward oxidative phosphorylation (OXPHOS) and fatty acid oxidation (FAO) to meet increased energy demands [ 38 39 40 FLT3 Figure 1 41 42 43 44 45 46 47 48 3.1. Oxidative Phosphorylation (OXPHOS) Mitochondria serve as cellular metabolic hubs within leukemic cells, where carbohydrate, amino acid, and fatty acid pathways converge in the tricarboxylic acid (TCA) cycle. ( Figure 2 49 50 Normal hematopoietic stem cells (HSCs) primarily rely on glycolysis for energy production, whereas leukemia stem cells (LSCs) depend heavily on oxidative phosphorylation (OXPHOS) for their biosynthetic processes and survival [ 51 52 FLT3 53 54 55 56 13 14 57 58 FLT3 59 60 60 61 62 Exploiting this metabolic vulnerability through synthetic lethal strategies, combining FLT3 tyrosine kinase inhibitors with glycolytic blockade, has been shown to resensitize resistant leukemic cells to TKI treatment, overcoming resistance mechanisms and promoting apoptotic cell death more effectively. [ 61 63 64 59 FLT3 3.2. Aerobic Glycolysis Beyond bioenergetics, glucose metabolism encompasses multiple pathways, including the pentose phosphate pathway, serine biosynthesis, and one-carbon metabolism, collectively generating essential molecular precursors [ 65 66 67 FLT3 68 69 70 FLT3 FLT3 71 The increased glycolysis is regulated by key enzymes such as hexokinase 2 (HK2), which is involved in glucose phosphorylation and glycolytic pathway activation. FLT3 68 72 Emerging research has uncovered distinctive metabolic characteristics in FLT3 73 FLT3 74 3.3. Glutaminolysis Standard amino acids support a wide range of cellular functions critical for neoplastic proliferation, including protein synthesis, nucleotide production, lipid biosynthesis, and glutathione generation. They also play key roles in the regulation of epigenetic mechanisms and post-translational modifications [ 75 FLT3 76 77 Notably, glutamine metabolism emerges as another critical metabolic process in FLT3 78 Mitochondrial glutamine catabolism represents a fundamental metabolic vulnerability in FLT3 79 79 PDP1 FLT3 80 FLT3 81 82 83 82 NCT02071927 3.4. Fatty Acid Oxidation (FAO) Lipids constitute an energetic substrate for neoplastic cells, not merely serving as energy reservoirs but providing essential components for membrane biogenesis and signaling pathway regulation [ 84 85 86 87 88 89 90 91 90 91 It has been demonstrated that FLT3 92 FLT3 FLT3 93 94 3.5. Sphingolipid Metabolism and Ceramide Sphingolipids, including sphingomyelin (SM), ceramide (Cer), and glycosphingolipids, introduce another layer of metabolic complexity [ 95 96 97 98 99 100 101 102 Additionally, these lipid molecules not only just serve as structural components in cell membranes but also as potential regulators of cellular stress responses. Notably, Cer shows tumor-suppressing properties in many cancer types, and defects in Cer generation and clearance can lead to cancer cell survival and chemotherapy resistance [ 103 104 105 106 FLT3 FLT3 107 FLT3 108 109 FLT3 FLT3 110 111 112 110 FLT3 FLT3 113 3.6. Anabolic Reprogramming in FLT3-ITD AML Beyond conventional catabolic dependencies, FLT3 FLT3 114 115 116 The proliferative demands of AML cells necessitate sustained nucleotide and lipid production to fuel uncontrolled cellular division. These cells engage pentose phosphate pathway activation to produce ribose-5-phosphate precursors and generate NADPH, thereby enabling both de novo purine/pyrimidine synthesis and fatty acid production essential for membrane biogenesis. Recent evidence positions transketolase (TKT) as a central orchestrator of this metabolic rewiring: clinical specimens and established AML cell models exhibit substantially upregulated TKT levels, which facilitate cellular expansion, invasive capacity, and metabolic adaptation through transcriptional control of ribokinase (RBKS), creating a positive regulatory loop that amplifies non-oxidative pentose phosphate flux and promotes epithelial–mesenchymal transition phenotypes. In parallel, perturbation of guanine nucleotide biosynthesis, either through suppression of guanosine or pharmacological inhibition of Inosine Monophosphate Dehydrogenase 2 (IMPDH2), has been shown to induce myeloid differentiation and impair the oncogenic Lens Epithelium Derived Growth Factor (LEDGF)/menin/MLL-fusion complex in AML and MLL-rearranged leukemias. Notably, clinical translation of these insights includes the RNA polymerase I inhibitor CX-5461, which selectively downregulates menin and LEDGF, induces AML cell differentiation, and, critically, has demonstrated acceptable tolerability without neutropenia in early-phase hematologic trials [ 117 Additionally, TKTL1, a transketolase paralog, mediates hypoxic adaptation in THP-1 leukemic cells through modulation of Glucose-6-Phosphate Dehydrogenase (G6PD) and Glyceraldehyde-3-Phosphate Dehydrogenase (GAPDH) enzymatic activity, maintaining both NADPH availability and glycolytic flux during environmental stress conditions [ 118 Moreover, FLT3 119 Collectively, therapeutic metabolic intervention in FLT3 3.7. ROS Dynamics in FLT3-Mutated AML As discussed above, mitochondrial dependency recently emerged as a pivotal driver of energy in AML pathogenesis and progression. Notably, LSCs showed an increased mitochondrial mass and O 2 120 FLT3 FLT3 121 FLT3 FLT3 122 123 2 124 125 126 1 2 − 127 2 2 128 2 2 Previous investigations have established that FLT3 FLT3 FLT3 129 130 FLT3 131 132 15 Notably, FLT3 FLT3 FLT3 133 Recent research by Wu and colleagues demonstrated that in FLT3 134 FLT3 FLT3 135 FLT3 136 137 Recent comprehensive multi-omics analyses by Erdem et al. have stratified AML based on pyruvate dehydrogenase kinase 1 (PDK1) expression levels [ 71 FLT3 NPM1 FLT3 Kannan et al. proposed targeting the NRF2/HO-1 antioxidant pathway in FLT3 138 FLT3 139 140 FLT3 141 142 143 144 FLT3 3.8. Metabolic Targeting: Balancing Antileukemic Efficacy and Normal Cell Function A critical challenge in metabolic targeting is posed by cancer stem cells (CSCs), a rare and intrinsically resistant subpopulation first identified in AML and later in various malignancies that sustains long-term tumor propagation through self-renewal and multilineage differentiation. While driving both drug resistance and therapy tolerance. These dual properties are driven by mechanisms such as quiescence-associated drug insensitivity, activation of survival pathways, and evasion of apoptosis [ 61 63 64 145 146 This challenge is further deepened by the fact that canonical metabolic reprogramming events including enhanced glycolytic flux, augmented oxidative phosphorylation capacity, and glutamine catabolism are not restricted to malignant cells but represent conserved features of non-malignant proliferative cellular states, including activated T lymphocytes, tissue-resident macrophages, and other immune effector populations. Upon antigenic stimulation, T cells rapidly upregulate GLUT1-mediated glucose transport and ASCT2-dependent glutamine uptake, engage aerobic glycolysis concurrent with mitochondrial respiration, and activate mTORC1 signaling to satisfy biosynthetic and bioenergetic requirements—metabolic signatures that mirror those observed in transformed cells (including Warburg-type glycolysis and glutamine-fueled anaplerosis). Consequently, pharmacological disruption of glutamine metabolism or glycolytic pathways may compromise the activation kinetics, proliferative capacity, or effector functions of essential immune cell subsets, including CD8+ T cells, NK cells, B lymphocytes, and M1 macrophages, which exhibit obligate glutamine dependence for cytokine biosynthesis and antimicrobial responses [ 147 148 149 From a translational perspective, broad-spectrum glutamine analogs such as 6-diazo-5-oxo-L-norleucine (DON) or L-(αS,5S)-α-amino-3-chloro-4,5-dihydro-5-isoxazoleacetic acid (acivicin)—which inhibit multiple glutamine-utilizing enzymes—have demonstrated dose-limiting toxicities including severe enterocolitis, peripheral neuropathy, and myelosuppression, reflecting their indiscriminate targeting of glutamine-dependent processes in rapidly dividing normal tissues [ 150 151 152 153 154 In summary, effective metabolic intervention in FLT3 Despite the challenges of balancing antileukemic efficacy with preservation of normal cellular metabolism, the identification of specific metabolic vulnerabilities of FLT3 4. Metabolic Vulnerabilities of FLT3 With growing evidence on the dynamic nature of leukemic cell metabolism, the identification of specific metabolic dependencies paved the way for the design of metabolic-oriented treatments able of disarming leukemic cells and potentially overcoming challenges associated with drug resistance. For many years, intensive induction chemotherapy has represented the standard of care for de novo AML, despite carrying high rates of early post-induction deaths and limited therapeutic benefit for elderly patients [ 155 156 36 35 157 158 159 160 FLT3 35 In the last decade, increasing knowledge about the contribution of metabolic rewiring in AML pathogenesis and progression has led to the investigation of various metabolic interventions, with the aim to further improve treatment outcomes and address resistance mechanisms. Importantly, metabolic rewiring has been extensively observed across various AML subtypes, independent of the presence of FLT3 161 NPM1 FLT3 162 163 164 165 166 These shared and subtype-specific metabolic vulnerabilities suggest that many metabolic-targeted therapies hold potential beyond FLT3 A number of metabolic-oriented drugs have been developed and tested in AML, either pre-clinically or in early-phase trials. These agents target key metabolic processes, offering potential to overcome treatment resistance and selectively eradicate LSCs ( Table 1 FLT3 FLT3 167 168 169 A recent study by van Gils et al. categorizes metabolic dysregulation as one of six key mechanisms involved in therapy resistance in LSCs [ 180 181 FLT3 Interestingly, bone marrow stromal cells showed the ability to transfer functional mitochondrial to AML cells through contact-dependent endocytic pathways, enhancing mitochondrial ATP production and survival under chemotherapy stress. This mitochondria-mediated metabolic support is particularly relevant for leukemia-initiating cells, contributing to treatment resistance and disease relapse [ 182 Recent studies have clearly demonstrated that FLT3 183 58 Several studies have highlighted the potential of combination treatments that target and disrupt metabolic pathways in AML treatment, as summarized in Table 2 184 185 FLT3 FLT3 80 186 NCT05546580 NCT03625505 NCT04140487 Among metabolic-oriented drugs, Venetoclax in combination with azacitidine represents the standard of care for patients with newly diagnosed AML who are unfit for intensive chemotherapy. Several studies have widely investigated the strong metabolic reprogramming induced by Venetoclax, through the inhibition of mitochondrial metabolism with an effect independent of Bcl-2 inhibition. Furthermore, combination with azacitidine disrupts energy metabolism by reducing glutathione levels, impairing OXPHOS and ultimately targeting leukemia stem cells (LSCs) [ 187 195 196 In light of the results obtained from targeting mitochondrial metabolism, further investigations have been conducted to test the in vitro and in vivo effects of mitochondrial ETC inhibitors, which have been revealed to be effective at reducing leukemia cell viability. Indeed, the high activity of Complex II led to the testing of the effect of genetic knockdown of the chaperone SDHAF1, which was able to delay the growth of AML cells. Consistent with this, pharmacological inhibition of Complex III using antimycin A resulted in a marked decrease in cell proliferation and triggered differentiation processes [ 188 FLT3 189 A widely used drug with pleiotropic effects on metabolism is metformin, which has also been tested as an adjuvant treatment for leukemia. Metformin is able to inhibit OXPHOS in AML cells, also impairing glycolysis, and it induces apoptosis in AML cells without affecting normal hematopoietic stem cells [ 190 191 197 FLT3 79 Additionally, Sphingolipids, including sphingomyelin (SM), ceramide (Cer), and glycosphingolipids, introduce another of metabolic target. In FLT3 FLT3 FLT3 Indeed, lipid accumulation within treated AML cells in different subcellular compartments suggests that lipids might induce other pro-cell death cascades, such as mitophagy. Mitophagy has been reported to be involved in the inhibitory effect of Crenolanib, an FLT3 inhibitor, inducing Cer accumulation and subsequently promoting cell death in FLT3 198 199 The high dependency of FLT3 192 193 FLT3 194 FLT3 FLT3 FLT3 Overall, the growing understanding of metabolic rewiring and the identification of distinct metabolic vulnerabilities in FLT3 5. Conclusions The advances in understanding FLT3 FLT3 FLT3 Disclaimer/Publisher’s Note: Author Contributions C.B., N.I.N. and S.T. composed, edited, and finalized the review. C.B., M.C. and E.C. designed the figures and reviewed the text. G.C. edited the clinical section and contributed to the overall revision of the manuscript. All authors have read and agreed to the published version of the manuscript. Institutional Review Board Statement Not applicable. Informed Consent Statement Not applicable. Data Availability Statement No new data were created or analyzed in this study. Data sharing is not applicable to this article. Conflicts of Interest The authors declare no conflicts of interest. References 1. Döhner H. Weisdorf D.J. Bloomfield C.D. Acute Myeloid Leukemia N. Engl. J. Med. 2015 373 1136 1152 10.1056/NEJMra1406184 26376137 2. Löwenberg B. Ossenkoppele G.J. Putten W.V. Schouten H.C. Graux C. Ferrant A. Sonneveld P. Maertens J. Jongen-Lavrencic M. von Lilienfeld-Toal M. High-Dose Daunorubicin in Older Patients with Acute Myeloid Leukemia N. Engl. J. Med. 2009 361 1235 1248 10.1056/NEJMoa0901409 19776405 3. Park H.J. Gregory M.A. Acute Myeloid Leukemia in Elderly Patients: New Targets, New Therapies Aging Cancer 2023 4 51 73 10.1002/aac2.12065 4. Dombret H. Gardin C. An Update of Current Treatments for Adult Acute Myeloid Leukemia Blood 2016 127 53 61 10.1182/blood-2015-08-604520 26660429 PMC4705610 5. Papaemmanuil E. Gerstung M. Bullinger L. Gaidzik V.I. Paschka P. Roberts N.D. Potter N.E. Heuser M. Thol F. Bolli N. Genomic Classification and Prognosis in Acute Myeloid Leukemia N. Engl. J. Med. 2016 374 2209 2221 10.1056/NEJMoa1516192 27276561 PMC4979995 6. Shimony S. Stahl M. Stone R.M. Acute Myeloid Leukemia: 2025 Update on Diagnosis, Risk-Stratification, and Management Am. J. Hematol. 2025 100 860 891 10.1002/ajh.27625 39936576 PMC11966364 7. Jia D. Lu M. Jung K.H. Park J.H. Yu L. Onuchic J.N. Kaipparettu B.A. Levine H. Elucidating Cancer Metabolic Plasticity by Coupling Gene Regulation with Metabolic Pathways Proc. Natl. Acad. Sci. USA 2019 116 3909 3918 10.1073/pnas.1816391116 30733294 PMC6397570 8. Warburg O. On the Origin of Cancer Cells Science 1956 123 309 314 10.1126/science.123.3191.309 13298683 9. Warburg O. Wind F. Negelein E. The Metabolism of Tumors in the Body J. Gen. Physiol. 1927 8 519 530 10.1085/jgp.8.6.519 19872213 PMC2140820 10. Liu H. Wang S. Wang J. Guo X. Song Y. Fu K. Gao Z. Liu D. He W. Yang L.-L. Energy Metabolism in Health and Diseases Signal Transduct. Target. Ther. 2025 10 69 10.1038/s41392-025-02141-x 39966374 PMC11836267 11. Yoshida G.J. Metabolic Reprogramming: The Emerging Concept and Associated Therapeutic Strategies J. Exp. Clin. Cancer Res. 2015 34 111 10.1186/s13046-015-0221-y 26445347 PMC4595070 12. Takacova M. Kajanova I. Kolarcikova M. Lapinova J. Zatovicova M. Pastorekova S. Understanding Metabolic Alterations and Heterogeneity in Cancer Progression through Validated Immunodetection of Key Molecular Com-ponents: A Case of Carbonic Anhydrase IX Cancer Metastasis Rev. 2021 40 1035 1053 10.1007/s10555-021-10011-5 35080763 PMC8825433 13. Banella C. Catalano G. Travaglini S. Pelosi E. Ottone T. Zaza A. Guerrera G. Angelini D.F. Niscola P. Divona M. Ascorbate Plus Buformin in AML: A Metabolic Targeted Treatment Cancers 2022 14 2565 10.3390/cancers14102565 35626170 PMC9139619 14. Catalano G. Zaza A. Banella C. Pelosi E. Castelli G. Marinis E.D. Smigliani A. Travaglini S. Ottone T. Divona M. MCL1 Regulates AML Cells Metabolism via Direct Interaction with HK2. Metabolic Signature at Onset Predicts Overall Survival in AMLs’ Patients Leukemia 2023 37 1600 1610 10.1038/s41375-023-01946-5 37349598 15. Moloney J.N. Stanicka J. Cotter T.G. Subcellular Localization of the FLT3-ITD Oncogene Plays a Significant Role in the Production of NOX- and P22phox-Derived Reactive Oxygen Species in Acute Myeloid Leukemia Leuk. Res. 2017 52 34 42 10.1016/j.leukres.2016.11.006 27870947 16. Simonetti G. Mengucci C. Padella A. Fonzi E. Picone G. Delpino C. Nanni J. Tommaso R.D. Franchini E. Papayannidis C. Integrated Genomic-Metabolic Classification of Acute Myeloid Leukemia Defines a Sub-group with NPM1 and Cohesin/DNA Damage Mutations Leukemia 2021 35 2813 2826 10.1038/s41375-021-01318-x 34193978 PMC8478658 17. Parker S.J. Metallo C.M. Metabolic Consequences of Oncogenic IDH Mutations Pharmacol. Ther. 2015 152 54 62 10.1016/j.pharmthera.2015.05.003 25956465 PMC4489982 18. Nardozza A.M. Guarnera L. Travaglini S. Ottone T. Divona M. Bellis E.D. Savi A. Banella C. Noguera N.I. Di Fusco D. Characterization of a Novel IDH2-R159H Mutation in Acute Myeloid Leukaemia: Effects on Cell Metabolism and Differentiation Br. J. Haematol. 2024 204 719 723 10.1111/bjh.19216 38009542 19. Banella C. Catalano G. Travaglini S. Divona M. Masciarelli S. Guerrera G. Fazi F. Coco F.L. Voso M.T. Noguera N. PML/RARa Interferes with NRF2 Transcriptional Activity Increasing the Sensitivity to Ascorbate of Acute Promyelocytic Leukemia Cells Cancers 2019 12 95 10.3390/cancers12010095 31905996 PMC7016898 20. Travaglini S. Silvestrini G. Attardi E. Fanciulli M. Scalera S. Antonelli S. Maurillo L. Palmieri R. Divona M. Ciuffreda L. Evolution of Transcriptomic Profiles in Relapsed Inv(16) Acute Myeloid Leukemia Leuk. Res. 2024 145 107568 10.1016/j.leukres.2024.107568 39180902 21. Bolkun L. Pienkowski T. Sieminska J. Godzien J. Pietrowska K. Kłoczko J. Wierzbowska A. Moniuszko M. Ratajczak M. Kretowski A. Metabolomic Profile of Acute Myeloid Leukaemia Parallels of Prognosis and Response to Therapy Sci. Rep. 2023 23 21809 10.1038/s41598-023-48970-0 PMC10710498 38071228 22. Sung J.-Y. Yun W. Kim H.-Y. Kim H.-J. Choi J.R. Kim S.-H. Jung C.W. Lee S.-T. Metabolic Subtype Reveals Potential Therapeutic Vulnerability in Acute Promyelocytic Leukaemia Clin. Transl. Med. 2022 12 e964 10.1002/ctm2.964 35808815 PMC9270575 23. Balasundaram N. Ganesan S. Chendamarai E. Palani H.K. Venkatraman A. Alex A.A. David S. Kumar S.P. Radhakrishnan N.R. Yasar M. Metabolic Adaptation Drives Arsenic Trioxide Resistance in Acute Promyelocytic Leukemia Blood Adv. 2022 6 652 663 10.1182/bloodadvances.2021005300 34625794 PMC8791572 24. Ferret Y. Boissel N. Helevaut N. Madic J. Nibourel O. Marceau-Renaut A. Bucci M. Geffroy S. Celli-Lebras K. Castaigne S. Clinical Relevance of IDH1/2 Mutant Allele Burden during Follow-up in Acute Myeloid Leukemia. A Study by the French ALFA Group Haematologica 2018 103 822 829 10.3324/haematol.2017.183525 29472349 PMC5927984 25. Chen W.-L. Wang J.-H. Zhao A.-H. Xu X. Wang Y.-H. Chen T.-L. Li J.-M. Mi J.-Q. Zhu Y.-M. Liu Y.-F. A Distinct Glucose Metabolism Signature of Acute Myeloid Leukemia with Prognostic Value Blood 2014 124 1645 1654 10.1182/blood-2014-02-554204 25006128 PMC5726328 26. Larrue C. Saland E. Vergez F. Serhan N. Delabesse E. Mas V.M.-D. Hospital M.-A. Tamburini J. Manenti S. Sarry J.E. Antileukemic Activity of 2-Deoxy-d-Glucose through Inhibition of N-Linked Glycosylation in Acute Myeloid Leukemia with FLT3-ITD or c-KIT Mutations Mol. Cancer Ther. 2015 14 2364 2373 10.1158/1535-7163.MCT-15-0163 26206337 27. Jacque N. Ronchetti A.M. Larrue C. Meunier G. Birsen R. Willems L. Saland E. Decroocq J. Maciel T.T. Lambert M. Targeting Glutaminolysis Has Antileukemic Activity in Acute Myeloid Leukemia and Synergizes with BCL-2 Inhibition Blood 2015 126 1346 1356 10.1182/blood-2015-01-621870 26186940 PMC4608389 28. Liyanage S.U. Hurren R. Voisin V. Bridon G. Wang X. Xu C. MacLean N. Siriwardena T.P. Gronda M. Yehudai D. Leveraging Increased Cytoplasmic Nucleoside Kinase Activity to Target MtDNA and Oxidative Phosphorylation in AML Blood 2017 129 2657 2666 10.1182/blood-2016-10-741207 28283480 PMC5766841 29. Ricciardi M.R. Mirabilii S. Allegretti M. Licchetta R. Calarco A. Torrisi M.R. Foà R. Nicolai R. Peluso G. Tafuri A. Targeting the Leukemia Cell Metabolism by the CPT1a Inhibition: Functional Preclinical Effects in Leukemias Blood 2015 126 1925 1929 10.1182/blood-2014-12-617498 26276667 30. Cai T. Lorenzi P.L. Rakheja D. Pontikos M.A. Lodi A. Han L. Zhang Q. Ma H. Rahmani M. Bhagat T.D. Gls Inhibitor CB-839 Modulates Cellular Metabolism in AML and Potently Suppresses AML Cell Growth When Combined with 5-Azacitidine Blood 2016 128 4064 10.1182/blood.V128.22.4064.4064 31. Kiyoi H. Naoe T. Biology, Clinical Relevance, and Molecularly Targeted Therapy in Acute Leukemia with FLT3 Mutation Int. J. Hematol. 2006 83 301 308 10.1532/IJH97.06071 16757428 32. Döhner H. Wei A.H. Appelbaum F.R. Craddock C. DiNardo C.D. Dombret H. Ebert B.L. Fenaux P. Godley L.A. Hasserjian R.P. Diagnosis and Management of AML in Adults: 2022 Recommendations from an International Expert Panel on Behalf of the ELN Blood 2022 140 1345 1377 10.1182/blood.2022016867 35797463 33. Bruno S. Bandini L. Patuelli A. Robustelli V. Venturi C. Mancini M. Forte D. Santis S.D. Monaldi C. Grassi A. Case Report: A Novel Activating FLT3 Mutation in Acute Myeloid Leukemia Front. Oncol. 2021 11 728613 10.3389/fonc.2021.728613 34660293 PMC8514815 34. Travaglini S. Gurnari C. Antonelli S. Marchesi F. Angelis G.D. Ottone T. Divona M. Cristiano A. Hajrullaj H. Mengarelli A. Functional Characterization and Response to FLT3 Inhibitors in Acute Myeloid Leukaemia with a Non-Canonical FLT3 Mutation: A Proof of Concept Br. J. Haematol. 2023 203 327 330 10.1111/bjh.18991 37485586 35. Kennedy V.E. Smith C.C. FLT3 Targeting in the Modern Era: From Clonal Selection to Combination Therapies Int. J. Hematol. 2023 120 528 540 10.1007/s12185-023-03681-0 38112995 PMC11513752 36. Ruglioni M. Crucitta S. Luculli G.I. Tancredi G. Del Giudice M.L. Mechelli S. Galimberti S. Danesi R. Del Re M. Understanding Mechanisms of Resistance to FLT3 Inhibitors in Adult FLT3-Mutated Acute Myeloid Leukemia to Guide Treatment Strategy Crit. Rev. Oncol. Hematol. 2024 201 104424 10.1016/j.critrevonc.2024.104424 38917943 37. Travaglini S. Gurnari C. Ottone T. Voso M.T. Advances in the Pathogenesis of FLT3 -Mutated Acute Myeloid Leukemia and Targeted Treatments Curr. Opin. Oncol. 2024 36 569 576 10.1097/CCO.0000000000001094 39246183 PMC11460763 38. Maryanovich M. Zaltsman Y. Ruggiero A. Goldman A. Shachnai L. Zaidman S.L. Porat Z. Golan K. Lapidot T. Gross A. An MTCH2 Pathway Repressing Mitochondria Metabolism Regulates Haematopoietic Stem Cell Fate Nat. Commun. 2015 6 7901 10.1038/ncomms8901 26219591 39. Folmes C.D.L. Dzeja P.P. Nelson T.J. Terzic A. Metabolic Plasticity in Stem Cell Homeostasis and Differentiation Cell Stem Cell 2012 11 596 606 10.1016/j.stem.2012.10.002 23122287 PMC3593051 40. Ito K. Suda T. Metabolic Requirements for the Maintenance of Self-Renewing Stem Cells Nat. Rev. Mol. Cell Biol. 2014 15 243 256 10.1038/nrm3772 24651542 PMC4095859 41. Du W. Amarachintha S. Wilson A.F. Pang Q. SCO2 Mediates Oxidative Stress-Induced Glycolysis to Oxidative Phosphorylation Switch in Hematopoietic Stem Cells Stem Cells 2016 34 960 971 10.1002/stem.2260 26676373 PMC4838537 42. Ito K. Bonora M. Ito K. Metabolism as Master of Hematopoietic Stem Cell Fate Int. J. Hematol. 2019 109 18 27 10.1007/s12185-018-2534-z 30219988 PMC6318064 43. Maiso P. Huynh D. Moschetta M. Sacco A. Aljawai Y. Mishima Y. Asara J.M. Roccaro A.M. Kimmelman A.C. Ghobrial I.M. Metabolic Signature Identifies Novel Targets for Drug Resistance in Multiple Myeloma Cancer Res. 2015 75 2071 2082 10.1158/0008-5472.CAN-14-3400 25769724 PMC4433568 44. Herst P.M. Howman R.A. Neeson P.J. Berridge M.V. Ritchie D.S. The Level of Glycolytic Metabolism in Acute Myeloid Leukemia Blasts at Diagnosis Is Prognostic for Clinical Outcome J. Leukoc. Biol. 2010 89 51 55 10.1189/jlb.0710417 20959411 45. Kominsky D.J. Klawitter J. Brown J.L. Boros L.G. Melo J.V. Eckhardt S.G. Serkova N.J. Abnormalities in Glucose Uptake and Metabolism in Imatinib-Resistant Human BCR-ABL–Positive Cells Clin. Cancer Res. 2009 15 3442 3450 10.1158/1078-0432.CCR-08-3291 19401345 46. Lagadinou E.D. Sach A. Callahan K. Rossi R.M. Neering S.J. Minhajuddin M. Ashton J.M. Pei S. Grose V. O’Dwyer K.M. BCL-2 Inhibition Targets Oxidative Phosphorylation and Selectively Eradicates Quiescent Human Leukemia Stem Cells Cell Stem Cell 2013 12 329 341 10.1016/j.stem.2012.12.013 23333149 PMC3595363 47. Zhong W. Yi Q. Xu B. Li S. Wang T. Liu F. Zhu B. Hoffmann P.R. Ji G. Lei P. ORP4L Is Essential for T-Cell Acute Lymphoblastic Leukemia Cell Survival Nat. Commun. 2016 7 12702 10.1038/ncomms12702 27581363 PMC5025801 48. Boag J.M. Beesley A.H. Firth M.J. Freitas J.R. Ford J. Hoffmann K. Cummings A.J. Klerk N.H.D. Kees U.R. Altered Glucose Metabolism in Childhood Pre-B Acute Lymphoblastic Leukaemia Leukemia 2006 20 1731 1737 10.1038/sj.leu.2404365 17041637 49. Spinelli J.B. Haigis M.C. The Multifaceted Contributions of Mitochondria to Cellular Metabolism Nat. Cell Biol. 2018 20 745 754 10.1038/s41556-018-0124-1 29950572 PMC6541229 50. Tjahjono E. Daneman M.R. Meika B. Revtovich A.V. Kirienko N.V. Mitochondrial Abnormalities as a Target of Intervention in Acute Myeloid Leukemia Front. Oncol. 2024 14 1532857 10.3389/fonc.2024.1532857 39902131 PMC11788353 51. Morganti C. Bonora M. Ito K. Metabolism and HSC Fate: What NADPH Is Made For Trends Cell Biol. 2024 10.1016/j.tcb.2024.07.003 39054107 PMC11757803 52. Zhang Y.W. Schönberger K. Cabezas-Wallscheid N. Bidirectional Interplay between Metabolism and Epigenetics in Hematopoietic Stem Cells and Leukemia EMBO J. 2023 42 e112348 10.15252/embj.2022112348 38010205 PMC10711668 53. Tavor S. Petit I. Porozov S. Avigdor A. Dar A. Leider-Trejo L. Shemtov N. Deutsch V. Naparstek E. Nagler A. CXCR4 Regulates Migration and Development of Human Acute Myelogenous Leukemia Stem Cells in Transplanted NOD/SCID Mice Cancer Res. 2004 64 2817 2824 10.1158/0008-5472.CAN-03-3693 15087398 54. Möhle R. Bautz F. Rafii S. Moore M.A. Brugger W. Kanz L. The Chemokine Receptor CXCR-4 Is Expressed on CD34+ Hematopoietic Progenitors and Leukemic Cells and Mediates Transendothelial Migration Induced by Stromal Cell-Derived Factor-1 Blood 1998 91 4523 4530 10.1182/blood.V91.12.4523 9616148 55. Jin L. Hope K.J. Zhai Q. Smadja-Joffe F. Dick J.E. Targeting of CD44 Eradicates Human Acute Myeloid Leukemic Stem Cells Nat. Med. 2006 12 1167 1174 10.1038/nm1483 16998484 56. Chipuk J.E. Bouchier-Hayes L. Green D.R. Mitochondrial Outer Membrane Permeabilization during Apoptosis: The Innocent Bystander Scenario Cell Death Differ. 2006 13 1396 1402 10.1038/sj.cdd.4401963 16710362 57. Sriskanthadevan S. Jeyaraju D.V. Chung T.E. Prabha S. Xu W. Skrtic M. Jhas B. Hurren R. Gronda M. Wang X. AML Cells Have Low Spare Reserve Capacity in Their Respiratory Chain That Renders Them Susceptible to Oxidative Metabolic Stress Blood 2015 125 2120 2130 10.1182/blood-2014-08-594408 25631767 PMC4375109 58. Zhang P. Brinton L.T. Gharghabi M. Sher S. Williams K. Cannon M. Walker J.S. Canfield D. Beaver L. Cempre C.B. Targeting OXPHOS de Novo Purine Synthesis as the Nexus of FLT3 Inhibitor-Mediated Synergistic Antileukemic Actions Sci. Adv. 2022 8 eabp9005 10.1126/sciadv.abp9005 36112677 PMC9481139 59. Hanahan D. Weinberg R.A. Hallmarks of Cancer: The Next Generation Cell 2011 144 646 674 10.1016/j.cell.2011.02.013 21376230 60. Ganapathy-Kanniappan S. Kunjithapatham R. Geschwind J.-F.H. Statins Impair Glucose Uptake in Tumor Cells Cancer Biol. Ther. 2013 14 92 94 10.4161/cbt.23290 23254955 PMC3572005 61. Huang I.N. Melvin J.N. Effects of Ratio Reinforcement Schedules on Choice Behavior J. Gen. Psychol. 1990 117 99 106 10.1080/00221309.1990.9917777 2313283 62. Tang Z. Yuan S. Hu Y. Zhang H. Wu W. Zeng Z. Yang J. Yun J. Xu R. Huang P. Over-Expression of GAPDH in Human Colorectal Carcinoma as a Preferred Target of 3-Bromopyruvate Propyl Ester J. Bioenerg. Biomembr. 2012 44 117 125 10.1007/s10863-012-9420-9 22350014 PMC3332040 63. Zhou Y. Zhou Y. Shingu T. Feng L. Chen Z. Ogasawara M. Keating M.J. Kondo S. Huang P. Metabolic Alterations in Highly Tumorigenic Glioblastoma Cells: Preference for Hypoxia and High Dependency on Glycolysis J. Biol. Chem. 2011 286 32843 32853 10.1074/jbc.M111.260935 21795717 PMC3173179 64. Geschwind J.-F. Georgiades C.S. Ko Y.H. Pedersen P.L. Recently Elucidated Energy Catabolism Pathways Provide Opportunities for Novel Treatments in Hepatocellular Carcinoma Expert. Rev. Anticancer. Ther. 2004 4 449 457 10.1586/14737140.4.3.449 15161443 65. Liberti M.V. Locasale J.W. The Warburg Effect: How Does It Benefit Cancer Cells? Trends Biochem. Sci. 2016 41 211 218 10.1016/j.tibs.2015.12.001 26778478 PMC4783224 66. Song K. Li M. Xu X. Xuan L. Huang G. Liu Q. Resistance to Chemotherapy Is Associated with Altered Glucose Metabolism in Acute Myeloid Leukemia Oncol. Lett. 2016 12 334 342 10.3892/ol.2016.4600 27347147 PMC4906727 67. Wang Y.-H. Israelsen W.J. Lee D. Yu V.W.C. Jeanson N.T. Clish C.B. Cantley L.C. Vander Heiden M.G. Scadden D.T. Cell-State-Specific Metabolic Dependency in Hematopoiesis and Leukemogenesis Cell 2014 158 1309 1323 10.1016/j.cell.2014.07.048 25215489 PMC4197056 68. Ju H.-Q. Zhan G. Huang A. Sun Y. Wen S. Yang J. Lu W. Xu R. Li J. Li Y. ITD Mutation in FLT3 Tyrosine Kinase Promotes Warburg Effect and Renders Therapeutic Sensitivity to Glycolytic Inhibition Leukemia 2017 31 2143 2150 10.1038/leu.2017.45 28194038 PMC5629368 69. Koppenol W.H. Bounds P.L. Dang C. V Otto Warburg’s Contributions to Current Concepts of Cancer Metabolism Nat. Rev. Cancer 2011 11 325 337 10.1038/nrc3038 21508971 70. DeBerardinis R.J. Chandel N.S. We Need to Talk about the Warburg Effect Nat. Metab. 2020 2 127 129 10.1038/s42255-020-0172-2 32694689 71. Erdem A. Marin S. Pereira-Martins D.A. Cortés R. Cunningham A. Pruis M.G. Boer B.D. Heuvel F.A.J.V.D. Geugien M. Wierenga A.T.J. The Glycolytic Gatekeeper PDK1 Defines Different Metabolic States between Genetically Distinct Subtypes of Human Acute Myeloid Leukemia Nat. Commun. 2022 13 1105 10.1038/s41467-022-28737-3 35232995 PMC8888573 72. Peng C.-J. Fan Z. Luo J.-S. Wang L.-N. Li Y. Liang C. Zhang X.-L. Luo X.-Q. Huang L.-B. Tang Y.-L. The Potential Transcriptomic and Metabolomic Mechanisms of ATO and ATRA in Treatment of FLT3-ITD Acute Myeloid Leukemia Technol. Cancer Res. Treat. 2024 23 15330338231223080 10.1177/15330338231223080 38179723 PMC10771057 73. Huang A. Ju H.-Q. Liu K. Zhan G. Liu D. Wen S. Garcia-Manero G. Huang P. Hu Y. Metabolic Alterations and Drug Sensitivity of Tyrosine Kinase Inhibitor Resistant Leukemia Cells with a FLT3/ITD Mutation Cancer Lett. 2016 377 149 157 10.1016/j.canlet.2016.04.040 27132990 74. Soltani M. Zhao Y. Xia Z. Ganjalikhani Hakemi M. Bazhin A.V. The Importance of Cellular Metabolic Pathways in Pathogenesis and Selective Treatments of Hematological Malignancies Front. Oncol. 2021 11 767026 10.3389/fonc.2021.767026 34868994 PMC8636012 75. Vettore L. Westbrook R.L. Tennant D.A. New Aspects of Amino Acid Metabolism in Cancer Br. J. Cancer 2020 122 150 156 10.1038/s41416-019-0620-5 31819187 PMC7052246 76. Cormerais Y. Massard P.A. Vucetic M. Giuliano S. Tambutté E. Durivault J. Vial V. Endou H. Wempe M.F. Parks S.K. The Glutamine Transporter ASCT2 (SLC1A5) Promotes Tumor Growth Independently of the Amino Acid Transporter LAT1 (SLC7A5) J. Biol. Chem. 2018 293 2877 2887 10.1074/jbc.RA117.001342 29326164 PMC5827425 77. Willems L. Jacque N. Jacquel A. Neveux N. Trovati Maciel T. Lambert M. Schmitt A. Poulain L. Green A.S. Uzunov M. Inhibiting Glutamine Uptake Represents an Attractive New Strategy for Treating Acute Myeloid Leukemia Blood 2013 122 3521 3532 10.1182/blood-2013-03-493163 24014241 PMC3829119 78. Nicklin P. Bergman P. Zhang B. Triantafellow E. Wang H. Nyfeler B. Yang H. Hild M. Kung C. Wilson C. Bidirectional Transport of Amino Acids Regulates MTOR and Autophagy Cell 2009 136 521 534 10.1016/j.cell.2008.11.044 19203585 PMC3733119 79. Khamari R. Degand C. Fovez Q. Trinh A. Chomy A. Laine W. Dekiouk S. Ghesquiere B. Quesnel B. Marchetti P. Key Role of Glutamine Metabolism in Persistence of Leukemic Cells upon Exposition to FLT3 Tyrosine Kinase Inhibitors Exp. Hematol. 2024 137 104253 10.1016/j.exphem.2024.104253 38879112 80. Alshamleh I. Kurrle N. Makowka P. Bhayadia R. Kumar R. Süsser S. Seibert M. Ludig D. Wolf S. Koschade S.E. PDP1 Is a Key Metabolic Gatekeeper and Modulator of Drug Resistance in FLT3-ITD-Positive Acute Myeloid Leukemia Leukemia 2023 37 2367 2382 10.1038/s41375-023-02041-5 37935978 PMC10681906 81. Wang E.S. Frankfurt O. Orford K.W. Bennett M. Flinn I.W. Maris M. Konopleva M. Phase 1 Study of CB-839, a First-in-Class, Orally Administered Small Molecule Inhibitor of Glutaminase in Patients with Relapsed/Refractory Leukemia Blood 2015 126 2566 10.1182/blood.V126.23.2566.2566 82. Firmanty P. Chomczyk M. Dash S. Konopleva M. Baran N. Feasibility and Safety of Targeting Mitochondria Function and Metabolism in Acute Myeloid Leukemia Curr. Pharmacol. Rep. 2024 10 388 404 10.1007/s40495-024-00378-8 40756330 PMC12314886 83. Harding J.J. Telli M.L. Munster P.N. Le M.H. Molineaux C. Bennett M.K. Mittra E. Burris H.A. Clark A.S. Dunphy M. Safety and Tolerability of Increasing Doses of CB-839, a First-in-Class, Orally Administered Small Molecule Inhibitor of Glutaminase, in Solid Tumors J. Clin. Oncol. 2015 33 2512 10.1200/jco.2015.33.15_suppl.2512 84. Maher M. Diesch J. Casquero R. Buschbeck M. Epigenetic-Transcriptional Regulation of Fatty Acid Metabolism and Its Alterations in Leukaemia Front. Genet. 2018 9 405 10.3389/fgene.2018.00405 30319689 PMC6165860 85. Snaebjornsson M.T. Janaki-Raman S. Schulze A. Greasing the Wheels of the Cancer Machine: The Role of Lipid Metabolism in Cancer Cell Metab. 2020 31 62 76 10.1016/j.cmet.2019.11.010 31813823 86. Balko J.M. Schwarz L.J. Luo N. Estrada M.V. Giltnane J.M. Dávila-González D. Wang K. Sánchez V. Dean P.T. Combs S.E. Triple-Negative Breast Cancers with Amplification of JAK2 at the 9p24 Locus Demonstrate JAK2-Specific Dependence Sci. Transl. Med. 2016 8 334ra53 10.1126/scitranslmed.aad3001 PMC5256931 27075627 87. Samudio I. Konopleva M. Targeting Leukemia’s “Fatty Tooth” Blood 2015 126 1874 1875 10.1182/blood-2015-08-665125 26472736 88. Pabst T. Kortz L. Fiedler G.M. Ceglarek U. Idle J.R. Beyoğlu D. The Plasma Lipidome in Acute Myeloid Leukemia at Diagnosis in Relation to Clinical Disease Features BBA Clin. 2017 7 105 114 10.1016/j.bbacli.2017.03.002 28331812 PMC5357680 89. Mesbahi Y. Trahair T.N. Lock R.B. Connerty P. Exploring the Metabolic Landscape of AML: From Haematopoietic Stem Cells to Myeloblasts and Leukaemic Stem Cells Front. Oncol. 2022 12 807266 10.3389/fonc.2022.807266 35223487 PMC8867093 90. Loeffler D. Schroeder T. Symmetric and Asymmetric Activation of Hematopoietic Stem Cells Curr. Opin. Hematol. 2021 28 262 268 10.1097/MOH.0000000000000644 34059600 91. Ito K. Carracedo A. Weiss D. Arai F. Ala U. Avigan D.E. Schafer Z.T. Evans R.M. Suda T. Lee C.-H. A PML–PPAR-δ Pathway for Fatty Acid Oxidation Regulates Hematopoietic Stem Cell Maintenance Nat. Med. 2012 18 1350 1358 10.1038/nm.2882 22902876 PMC3566224 92. Samudio I. Harmancey R. Fiegl M. Kantarjian H. Konopleva M. Korchin B. Kaluarachchi K. Bornmann W. Duvvuri S. Taegtmeyer H. Pharmacologic Inhibition of Fatty Acid Oxidation Sensitizes Human Leukemia Cells to Apoptosis Induction J. Clin. Investig. 2010 120 142 156 10.1172/JCI38942 20038799 PMC2799198 93. Bonnefont J.-P. Bastin J. Behin A. Djouadi F. Bezafibrate for an Inborn Mitochondrial Beta-Oxidation Defect N. Engl. J. Med. 2009 360 838 840 10.1056/NEJMc0806334 19228633 94. Yamaguchi S. Li H. Purevsuren J. Yamada K. Furui M. Takahashi T. Mushimoto Y. Kobayashi H. Hasegawa Y. Taketani T. Bezafibrate Can Be a New Treatment Option for Mitochondrial Fatty Acid Oxidation Disorders: Evaluation by in Vitro Probe Acylcarnitine Assay Mol. Genet. Metab. 2012 107 87 91 10.1016/j.ymgme.2012.07.004 22841441 95. Ogretmen B. Sphingolipid Metabolism in Cancer Signalling and Therapy Nat. Rev. Cancer 2018 18 33 50 10.1038/nrc.2017.96 29147025 PMC5818153 96. Schömel N. Geisslinger G. Wegner M.-S. Influence of Glycosphingolipids on Cancer Cell Energy Metabolism Prog. Lipid Res. 2020 79 101050 10.1016/j.plipres.2020.101050 32592726 97. Canals D. Clarke C.J. Compartmentalization of Sphingolipid Metabolism: Implications for Signaling and Therapy Pharmacol. Ther. 2022 232 108005 10.1016/j.pharmthera.2021.108005 34582834 PMC9619385 98. Powell J.A. Lewis A.C. Zhu W. Toubia J. Pitman M.R. Wallington-Beddoe C.T. Moretti P.A.B. Iarossi D. Samaraweera S.E. Cummings N. Targeting Sphingosine Kinase 1 Induces MCL1-Dependent Cell Death in Acute Myeloid Leukemia Blood 2017 129 771 782 10.1182/blood-2016-06-720433 27956387 PMC7484978 99. Xie S.Z. Kaufmann K.B. Wang W. Chan-Seng-Yue M. Gan O.I. Laurenti E. Garcia-Prat L. Takayanagi S. Ng S.W.K. Xu C. Sphingosine-1-Phosphate Receptor 3 Potentiates Inflammatory Programs in Normal and Leukemia Stem Cells to Promote Differentiation Blood Cancer Discov. 2021 2 32 53 10.1158/2643-3230.BCD-20-0155 33458693 PMC7116590 100. Mendoza A.E.-H.D. Castello-Cros R. Imbuluzqueta E. Cirauqui C. Pippa R. Odero M.D. Blanco-Prieto M.J. Lipid Nanosystems Enhance the Bioavailability and the Therapeutic Efficacy of FTY720 in Acute Myeloid Leukemia J. Biomed. Nanotechnol. 2015 11 691 701 10.1166/jbn.2015.1944 26310075 101. Cristóbal I. Garcia-Orti L. Cirauqui C. Alonso M.M. Calasanz M.J. Odero M.D. PP2A Impaired Activity Is a Common Event in Acute Myeloid Leukemia and Its Activation by Forskolin Has a Potent Anti-Leukemic Effect Leukemia 2011 25 606 614 10.1038/leu.2010.294 21233840 102. Arriazu E. Vicente C. Pippa R. Peris I. Martínez-Balsalobre E. García-Ramírez P. Marcotegui N. Igea A. Alignani D. Rifón J. A New Regulatory Mechanism of Protein Phosphatase 2A Activity via SET in Acute Myeloid Leukemia Blood Cancer J. 2020 10 3 10.1038/s41408-019-0270-0 31913266 PMC6949222 103. Bai A.-P. Guo Y. Ceramide Is a Potential Activator of Immune Responses Against Tumors Gastroenterology 2018 155 579 580 10.1053/j.gastro.2018.04.037 30064723 104. Morad S.A.F. Cabot M.C. Ceramide-Orchestrated Signalling in Cancer Cells Nat. Rev. Cancer 2013 13 51 65 10.1038/nrc3398 23235911 105. Maceyka M. Harikumar K.B. Milstien S. Spiegel S. Sphingosine-1-Phosphate Signaling and Its Role in Disease Trends Cell Biol. 2012 22 50 60 10.1016/j.tcb.2011.09.003 22001186 PMC3253987 106. Kumagai K. Hanada K. Structure, Functions and Regulation of CERT, a Lipid-transfer Protein for the Delivery of Ceramide at the ER—Golgi Membrane Contact Sites FEBS Lett. 2019 593 2366 2377 10.1002/1873-3468.13511 31254361 107. Dany M. Gencer S. Nganga R. Thomas R.J. Oleinik N. Baron K.D. Szulc Z.M. Ruvolo P. Kornblau S. Andreeff M. Targeting FLT3-ITD Signaling Mediates Ceramide-Dependent Mitophagy and Attenuates Drug Resistance in AML Blood 2016 128 1944 1958 10.1182/blood-2016-04-708750 27540013 PMC5064718 108. Lewis A.C. Pope V.S. Tea M.N. Li M. Nwosu G.O. Nguyen T.M. Wallington-Beddoe C.T. Moretti P.A.B. Anderson D. Creek D.J. Ceramide-Induced Integrated Stress Response Overcomes Bcl-2 Inhibitor Resistance in Acute Myeloid Leukemia Blood 2022 139 3737 3751 10.1182/blood.2021013277 35443029 PMC9642852 109. Nguyen T.M. Joyce P. Ross D.M. Bremmell K. Jambhrunkar M. Wong S.S. Prestidge C.A. Combating Acute Myeloid Leukemia via Sphingosine Kinase 1 Inhibitor-Nanomedicine Combination Therapy with Cytarabine or Venetoclax Pharmaceutics 2024 16 209 10.3390/pharmaceutics16020209 38399263 PMC10893145 110. Sun X. Li Y. Du J. Liu F. Wu C. Xiao W. Yu G. Chen X. Gale R.P. Zeng H. Targeting Ceramide Transfer Protein Sensitizes AML to FLT3 Inhibitors via a GRP78-ATF6-CHOP Axis Nat. Commun. 2025 16 1358 10.1038/s41467-025-56520-7 39905002 PMC11794619 111. Swanton C. Marani M. Pardo O. Warne P.H. Kelly G. Sahai E. Elustondo F. Chang J. Temple J. Ahmed A.A. Regulators of Mitotic Arrest and Ceramide Metabolism Are Determinants of Sensitivity to Paclitaxel and Other Chemotherapeutic Drugs Cancer Cell 2007 11 498 512 10.1016/j.ccr.2007.04.011 17560332 112. Chung L.H. Liu D. Liu X.T. Qi Y. Ceramide Transfer Protein (CERT): An Overlooked Molecular Player in Cancer Int. J. Mol. Sci. 2021 22 13184 10.3390/ijms222413184 34947980 PMC8705978 113. Sabatier M. Birsen R. Lauture L. Mouche S. Angelino P. Dehairs J. Goupille L. Boussaid I. Heiblig M. Boet E. C/EBPα Confers Dependence to Fatty Acid Anabolic Pathways and Vulnerability to Lipid Oxidative Stress–Induced Ferroptosis in FLT3 -Mutant Leukemia Cancer Discov. 2023 13 1720 1747 10.1158/2159-8290.CD-22-0411 37012202 114. Chang H.-H. Lee L.-C. Hsu T. Peng Y.-H. Huang C.-H. Yeh T.-K. Lu C.-T. Huang Z.-T. Hsueh C.-C. Kung F.-C. Development of Potent and Selective Inhibitors of Methylenetetrahydrofolate Dehydrogenase 2 for Targeting Acute Myeloid Leukemia: SAR, Structural Insights, and Biological Characterization J. Med. Chem. 2024 67 21106 21125 10.1021/acs.jmedchem.4c01775 39591507 PMC11647893 115. Pikman Y. Puissant A. Alexe G. Furman A. Chen L.M. Frumm S.M. Ross L. Fenouille N. Bassil C.F. Lewis C.A. Targeting MTHFD2 in Acute Myeloid Leukemia J. Exp. Med. 2016 213 1285 1306 10.1084/jem.20151574 27325891 PMC4925018 116. Stavrou V. Fultang L. Booth S. Simone D.D. Bartnik A. Scarpa U. Gneo L. Panetti S. Potluri S. Almowaled M. Invariant NKT Cells Metabolically Adapt to the Acute Myeloid Leukaemia Environment Cancer Immunol. Immunother. 2023 72 543 560 10.1007/s00262-022-03268-4 35962843 PMC9947083 117. Shi X. Li M. Liu Z. Tiessen J. Li Y. Zhou J. Zhu Y. Mahesula S. Ding Q. Tan L. Guanine Nucleotide Biosynthesis Blockade Impairs MLL Complex Formation and Sensitizes Leukemias to Menin Inhibition Nat. Commun. 2025 16 2641 10.1038/s41467-025-57544-9 40102405 PMC11920272 118. Zhang Y.W. Velasco-Hernandez T. Mess J. Lalioti M.-E. Romero-Mulero M.C. Obier N. Karantzelis N. Rettkowski J. Schönberger K. Karabacz N. GPRC5C Drives Branched-Chain Amino Acid Metabolism in Leukemogenesis Blood Adv. 2023 7 7525 7538 10.1182/bloodadvances.2023010460 37639313 PMC10761356 119. Baranello M.P. Bauer L. Jordan C.T. Benoit D.S.W. Micelle Delivery of Parthenolide to Acute Myeloid Leukemia Cells Cell Mol. Bioeng. 2015 8 455 470 10.1007/s12195-015-0391-x 29552235 PMC5854181 120. Jones C.L. Inguva A. Jordan C.T. Targeting Energy Metabolism in Cancer Stem Cells: Progress and Challenges in Leukemia and Solid Tumors Cell Stem Cell 2021 28 378 393 10.1016/j.stem.2021.02.013 33667359 PMC7951949 121. Latini S. Venafra V. Massacci G. Bica V. Graziosi S. Pugliese G.M. Iannuccelli M. Frioni F. Minnella G. Marra J.D. Unveiling the Signaling Network of FLT3-ITD AML Improves Drug Sensitivity Prediction Elife 2024 12 RP90532 10.7554/eLife.90532 38564252 PMC10987088 122. Chen Y. Zou Z. Găman M.-A. Xu L. Li J. NADPH Oxidase Mediated Oxidative Stress Signaling in FLT3-ITD Acute Myeloid Leukemia Cell Death Discov. 2023 9 208 10.1038/s41420-023-01528-5 37391442 PMC10313758 123. Sillar J.R. Germon Z.P. DeIuliis G.N. Dun M.D. The Role of Reactive Oxygen Species in Acute Myeloid Leukaemia Int. J. Mol. Sci. 2019 20 6003 10.3390/ijms20236003 31795243 PMC6929020 124. Starkov A.A. The Role of Mitochondria in Reactive Oxygen Species Metabolism and Signaling Ann. N. Y. Acad. Sci. 2008 1147 37 52 10.1196/annals.1427.015 19076429 PMC2869479 125. Wise D.R. DeBerardinis R.J. Mancuso A. Sayed N. Zhang X.-Y. Pfeiffer H.K. Nissim I. Daikhin E. Yudkoff M. McMahon S.B. Myc Regulates a Transcriptional Program That Stimulates Mitochondrial Glutaminolysis and Leads to Glutamine Addiction Proc. Natl. Acad. Sci. USA 2008 105 18782 18787 10.1073/pnas.0810199105 19033189 PMC2596212 126. Pryde K.R. Hirst J. Superoxide Is Produced by the Reduced Flavin in Mitochondrial Complex I J. Biol. Chem. 2011 286 18056 18065 10.1074/jbc.M110.186841 21393237 PMC3093879 127. Zhou F. Yin Y. Su T. Yu L. Yu C.-A. Oxygen Dependent Electron Transfer in the Cytochrome Bc1 Complex Biochim. Biophys. Acta (BBA) Bioenerg. 2012 1817 2103 2109 10.1016/j.bbabio.2012.08.004 22922016 128. Wang Y. Branicky R. Noë A. Hekimi S. Superoxide Dismutases: Dual Roles in Controlling ROS Damage and Regulating ROS Signaling J. Cell Biol. 2018 217 1915 1928 10.1083/jcb.201708007 29669742 PMC5987716 129. Woolley J.F. Naughton R. Stanicka J. Gough D.R. Bhatt L. Dickinson B.C. Chang C.J. Cotter T.G. H2O2 Production Downstream of FLT3 Is Mediated by P22phox in the Endoplasmic Reticulum and Is Required for STAT5 Signalling PLoS ONE 2012 7 e34050 10.1371/journal.pone.0034050 22807997 PMC3396659 130. Lagunas-Rangel F.A. Linnea-Niemi J.V. Kudłak B. Williams M.J. Jönsson J. Schiöth H.B. Role of the Synergistic Interactions of Environmental Pollutants in the Development of Cancer Geohealth 2022 6 e2021GH000552 10.1029/2021GH000552 35493962 PMC9036628 131. Stanicka J. Russell E.G. Woolley J.F. Cotter T.G. NADPH Oxidase-Generated Hydrogen Peroxide Induces DNA Damage in Mutant FLT3-Expressing Leukemia Cells J. Biol. Chem. 2015 290 9348 9361 10.1074/jbc.M113.510495 25697362 PMC4392242 132. Wang X.-X. Wei J.-Z. Jiao J. Jiang S.-Y. Yu D.-H. Li D. Genome-Wide DNA Methylation and Gene Expression Patterns Provide Insight into Polycystic Ovary Syndrome Development Oncotarget 2014 5 6603 6610 10.18632/oncotarget.2224 25051372 PMC4196149 133. Böhmer A. Barz S. Schwab K. Kolbe U. Gabel A. Kirkpatrick J. Ohlenschläger O. Görlach M. Böhmer F.-D. Modulation of FLT3 Signal Transduction through Cytoplasmic Cysteine Residues Indicates the Potential for Redox Regulation Redox Biol. 2020 28 101325 10.1016/j.redox.2019.101325 31606550 PMC6812047 134. Wu M. Li L. Hamaker M. Small D. Duffield A.S. FLT3-ITD Cooperates with Rac1 to Modulate the Sensitivity of Leukemic Cells to Chemotherapeutic Agents via Regulation of DNA Repair Pathways Haematologica 2019 104 2418 2428 10.3324/haematol.2018.208843 30975911 PMC6959181 135. Cauchy P. James S.R. Zacarias-Cabeza J. Ptasinska A. Imperato M.R. Assi S.A. Piper J. Canestraro M. Hoogenkamp M. Raghavan M. Chronic FLT3-ITD Signaling in Acute Myeloid Leukemia Is Connected to a Specific Chromatin Signature Cell Rep. 2015 12 821 836 10.1016/j.celrep.2015.06.069 26212328 PMC4726916 136. Sallmyr A. Fan J. Datta K. Kim K.-T. Grosu D. Shapiro P. Small D. Rassool F. Internal Tandem Duplication of FLT3 (FLT3/ITD) Induces Increased ROS Production, DNA Damage, and Misrepair: Implications for Poor Prognosis in AML Blood 2008 111 3173 3182 10.1182/blood-2007-05-092510 18192505 137. Gallipoli P. Giotopoulos G. Tzelepis K. Costa A.S.H. Vohra S. Medina-Perez P. Basheer F. Marando L. Di Lisio L. Dias J.M.L. Glutaminolysis Is a Metabolic Dependency in FLT3ITD Acute Myeloid Leukemia Unmasked by FLT3 Tyrosine Kinase Inhibition Blood 2018 131 1639 1653 10.1182/blood-2017-12-820035 29463564 PMC6061932 138. Kannan S. Irwin M.E. Herbrich S.M. Cheng T. Patterson L.L. Aitken M.J.L. Bhalla K. You M.J. Konopleva M. Zweidler-McKay P.A. Targeting the NRF2/HO-1 Antioxidant Pathway in FLT3-ITD-Positive AML Enhances Therapy Efficacy Antioxidants 2022 11 717 10.3390/antiox11040717 35453402 PMC9027903 139. Rushworth S.A. Zaitseva L. Langa S. Bowles K.M. MacEwan D.J. FLIP Regulation of HO-1 and TNF Signalling in Human Acute Myeloid Leukemia Provides a Unique Secondary Anti-Apoptotic Mechanism Oncotarget 2010 1 359 366 10.18632/oncotarget.168 21307400 PMC3157730 140. Hasan S.K. Jayakumar S. Espina Barroso E. Jha A. Catalano G. Sandur S.K. Noguera N.I. Molecular Targets of Oxidative Stress: Focus on Nuclear Factor Erythroid 2–Related Factor 2 Function in Leukemia and Other Cancers Cells 2025 14 713 10.3390/cells14100713 40422216 PMC12110329 141. Yagishita Y. Gatbonton-Schwager T.N. McCallum M.L. Kensler T.W. Current Landscape of NRF2 Biomarkers in Clinical Trials Antioxidants 2020 9 716 10.3390/antiox9080716 32784785 PMC7464243 142. Zhang D. Hou Z. Aldrich K.E. Lockwood L. Odom A.L. Liby K.T. A Novel Nrf2 Pathway Inhibitor Sensitizes Keap1-Mutant Lung Cancer Cells to Chemotherapy Mol. Cancer Ther. 2021 20 1692 1701 10.1158/1535-7163.MCT-21-0210 34158350 PMC9936621 143. Pearson K.J. Lewis K.N. Price N.L. Chang J.W. Perez E. Cascajo M.V. Tamashiro K.L. Poosala S. Csiszar A. Ungvari Z. Nrf2 Mediates Cancer Protection but Not Prolongevity Induced by Caloric Restriction Proc. Natl. Acad. Sci. USA 2008 105 2325 2330 10.1073/pnas.0712162105 18287083 PMC2268135 144. Jones C.L. Stevens B.M. D’Alessandro A. Culp-Hill R. Reisz J.A. Pei S. Gustafson A. Khan N. DeGregori J. Pollyea D.A. Cysteine Depletion Targets Leukemia Stem Cells through Inhibition of Electron Transport Complex II Blood 2019 134 389 394 10.1182/blood.2019898114 31101624 PMC6659257 145. Ryl T. Kuchen E.E. Bell E. Shao C. Flórez A.F. Mönke G. Gogolin S. Friedrich M. Lamprecht F. Westermann F. Cell-Cycle Position of Single MYC-Driven Cancer Cells Dictates Their Susceptibility to a Chemotherapeutic Drug Cell Syst. 2017 5 237 250.e8 10.1016/j.cels.2017.07.005 28843484 146. Blagosklonny M. V Target for Cancer Therapy: Proliferating Cells or Stem Cells Leukemia 2006 20 385 391 10.1038/sj.leu.2404075 16357832 147. Wang B. Pei J. Xu S. Liu J. Yu J. A Glutamine Tug-of-War between Cancer and Immune Cells: Recent Advances in Unraveling the Ongoing Battle J. Exp. Clin. Cancer Res. 2024 43 74 10.1186/s13046-024-02994-0 38459595 PMC10921613 148. Matés J.M. Di Paola F.J. Campos-Sandoval J.A. Mazurek S. Márquez J. Therapeutic Targeting of Glutaminolysis as an Essential Strategy to Combat Cancer Semin. Cell Dev. Biol. 2020 98 34 43 10.1016/j.semcdb.2019.05.012 31100352 149. Shen Y.-A. Chen C.-L. Huang Y.-H. Evans E.E. Cheng C.-C. Chuang Y.-J. Zhang C. Le A. Inhibition of Glutaminolysis in Combination with Other Therapies to Improve Cancer Treatment Curr. Opin. Chem. Biol. 2021 62 64 81 10.1016/j.cbpa.2021.01.006 33721588 PMC8570367 150. Akins N.S. Nielson T.C. Le H.V. Inhibition of Glycolysis and Glutaminolysis: An Emerging Drug Discovery Approach to Combat Cancer Curr. Top. Med. Chem. 2018 18 494 504 10.2174/1568026618666180523111351 29788892 PMC6110043 151. Fan Y. Xue H. Li Z. Huo M. Gao H. Guan X. Exploiting the Achilles’ Heel of Cancer: Disrupting Glutamine Metabolism for Effective Cancer Treatment Front. Pharmacol. 2024 15 1345522 10.3389/fphar.2024.1345522 38510646 PMC10952006 152. Stine Z.E. Schug Z.T. Salvino J.M. Dang C.V. Targeting Cancer Metabolism in the Era of Precision Oncology Nat. Rev. Drug Discov. 2022 21 141 162 10.1038/s41573-021-00339-6 34862480 PMC8641543 153. Koch K. Hartmann R. Tsiampali J. Uhlmann C. Nickel A.-C. He X. Kamp M.A. Sabel M. Barker R.A. Steiger H.-J. A Comparative Pharmaco-Metabolomic Study of Glutaminase Inhibitors in Glioma Stem-like Cells Confirms Biological Effectiveness but Reveals Differences in Target-Specificity Cell Death Discov. 2020 6 20 10.1038/s41420-020-0258-3 32337072 PMC7162917 154. Rattigan K.M. Zarou M.M. Helgason V. Metabolism in Stem Cell Driven Leukaemia: Parallels between Haematopoiesis and Immunity Blood 2023 141 2553 2565 10.1182/blood.2022018258 36634302 PMC10646800 155. Appelbaum F.R. Gundacker H. Head D.R. Slovak M.L. Willman C.L. Godwin J.E. Anderson J.E. Petersdorf S.H. Age and Acute Myeloid Leukemia Blood 2006 107 3481 3485 10.1182/blood-2005-09-3724 16455952 PMC1895766 156. Juliusson G. Antunovic P. Derolf A. Lehmann S. Möllgård L. Stockelberg D. Tidefelt U. Wahlin A. Höglund M. Age and Acute Myeloid Leukemia: Real World Data on Decision to Treat and Outcomes from the Swedish Acute Leukemia Registry Blood 2009 113 4179 4187 10.1182/blood-2008-07-172007 19008455 157. Norsworthy K.J. Luo L. Hsu V. Gudi R. Dorff S.E. Przepiorka D. Deisseroth A. Shen Y.-L. Sheth C.M. Charlab R. FDA Approval Summary: Ivosidenib for Relapsed or Refractory Acute Myeloid Leukemia with an Isocitrate Dehydrogenase-1 Mutation Clin. Cancer Res. 2019 25 3205 3209 10.1158/1078-0432.CCR-18-3749 30692099 158. Kim E.S. Enasidenib: First Global Approval Drugs 2017 77 1705 1711 10.1007/s40265-017-0813-2 28879540 159. Bross P.F. Beitz J. Chen G. Chen X.H. Duffy E. Kieffer L. Roy S. Sridhara R. Rahman A. Williams G. Approval Summary: Gemtuzumab Ozogamicin in Relapsed Acute Myeloid Leukemia Clin. Cancer Res. 2001 7 1490 1496 11410481 160. Krauss A.C. Gao X. Li L. Manning M.L. Patel P. Fu W. Janoria K.G. Gieser G. Bateman D.A. Przepiorka D. FDA Approval Summary: (Daunorubicin and Cytarabine) Liposome for Injection for the Treatment of Adults with High-Risk Acute Myeloid Leukemia Clin. Cancer Res. 2019 25 2685 2690 10.1158/1078-0432.CCR-18-2990 30541745 161. Addanki S. Kim L. Stevens A. Understanding and Targeting Metabolic Vulnerabilities in Acute Myeloid Leukemia: An Updated Comprehensive Review Cancers 2025 17 1355 10.3390/cancers17081355 40282531 PMC12025543 162. Yeşlyurt S.G. Koyun D. Toprak S.K. Özcan M. Özen C. A Predictive Metabolomic Model for FLT3 and NPM1 Mutations in Acute Myeloid Leukemia Patients J. Pharm. Biomed. Anal. 2025 260 116789 10.1016/j.jpba.2025.116789 40081307 163. Hvinden I.C. Cadoux-Hudson T. Schofield C.J. McCullagh J.S.O. Metabolic Adaptations in Cancers Expressing Isocitrate Dehydrogenase Mutations Cell Rep. Med. 2021 2 100469 10.1016/j.xcrm.2021.100469 35028610 PMC8714851 164. Liu J. Zhang C. Hu W. Feng Z. Tumor Suppressor P53 and Metabolism J. Mol. Cell Biol. 2019 11 284 292 10.1093/jmcb/mjy070 30500901 PMC6487777 165. Dai Y.-J. Hu F. He S.-Y. Tian X.-P. Li H.-H. Qin Z.-Y. Chen S. Liang Y. A Distinct Metabolic Signature in DNMT3A-Mutated Leukemia Blood 2019 134 1426 10.1182/blood-2019-121657 166. Fujino T. Goyama S. Sugiura Y. Inoue D. Yamasaki S. Matsumoto A. Sato N. Morinaga H. Shikata S. Fukuyama T. Mutant ASXL1 Promotes Expansion of the Phenotypic Hematopoietic Stem Cell Compartment Blood 2019 134 821 10.1182/blood-2019-127904 167. Hope K.J. Jin L. Dick J.E. Acute Myeloid Leukemia Originates from a Hierarchy of Leukemic Stem Cell Classes That Differ in Self-Renewal Capacity Nat. Immunol. 2004 5 738 743 10.1038/ni1080 15170211 168. Wang A. Zhong H. Roles of the Bone Marrow Niche in Hematopoiesis, Leukemogenesis, and Chemotherapy Resistance in Acute Myeloid Leukemia Hematology 2018 23 729 739 10.1080/10245332.2018.1486064 29902132 169. Salvia A.M. Cuviello F. Coluzzi S. Nuccorini R. Attolico I. Pascale S.P. Bisaccia F. Pizzuti M. Ostuni A. Expression of Some ATP-Binding Cassette Transporters in Acute Myeloid Leukemia Hematol. Rep. 2017 9 7406 10.4081/hr.2017.7406 29333226 PMC5757415 170. Stevens A.M. Schafer E.S. Li M. Terrell M. Rashid R. Paek H. Bernhardt M.B. Weisnicht A. Smith W.T. Keogh N.J. Repurposing Atovaquone as a Therapeutic against Acute Myeloid Leukemia (AML): Combination with Conventional Chemotherapy Is Feasible and Well Tolerated Cancers 2023 15 1344 10.3390/cancers15041344 36831684 PMC9954468 171. Lee E.A. Angka L. Rota S.-G. Hanlon T. Mitchell A. Hurren R. Wang X.M. Gronda M. Boyaci E. Bojko B. Targeting Mitochondria with Avocatin B Induces Selective Leukemia Cell Death Cancer Res. 2015 75 2478 2488 10.1158/0008-5472.CAN-14-2676 26077472 172. Tan S.-F. Liu X. Fox T.E. Barth B.M. Sharma A. Turner S.D. Awwad A. Dewey A. Doi K. Spitzer B. Acid Ceramidase Is Upregulated in AML and Represents a Novel Therapeutic Target Oncotarget 2016 7 83208 83222 10.18632/oncotarget.13079 27825124 PMC5347763 173. Yap T.A. Daver N. Mahendra M. Zhang J. Kamiya-Matsuoka C. Meric-Bernstam F. Kantarjian H.M. Ravandi F. Collins M.E. Francesco M.E.D. Complex I Inhibitor of Oxidative Phosphorylation in Advanced Solid Tumors and Acute Myeloid Leukemia: Phase I Trials Nat. Med. 2023 29 115 126 10.1038/s41591-022-02103-8 36658425 PMC11975418 174. Reed G.A. Schiller G.J. Kambhampati S. Tallman M.S. Douer D. Minden M.D. Yee K.W. Gupta V. Brandwein J. Jitkova Y. A Phase 1 Study of Intravenous Infusions of Tigecycline in Patients with Acute Myeloid Leukemia Cancer Med. 2016 5 3031 3040 10.1002/cam4.845 27734609 PMC5119957 175. Mussai F. Egan S. Higginbotham-Jones J. Perry T. Beggs A. Odintsova E. Loke J. Pratt G. U K.P. Lo A. Arginine Dependence of Acute Myeloid Leukemia Blast Proliferation: A Novel Therapeutic Target Blood 2015 125 2386 2396 10.1182/blood-2014-09-600643 25710880 PMC4416943 176. Tsai H.-J. Jiang S.S. Hung W.-C. Borthakur G. Lin S.-F. Pemmaraju N. Jabbour E. Bomalaski J.S. Chen Y.-P. Hsiao H.-H. A Phase II Study of Arginine Deiminase (ADI-PEG20) in Relapsed/Refractory or Poor-Risk Acute Myeloid Leukemia Patients Sci. Rep. 2017 7 11253 10.1038/s41598-017-10542-4 28900115 PMC5595917 177. Senapati J. Kantarjian H.M. Bazinet A. Reville P. Short N.J. Daver N. Borthakur G. Bataller A. Jabbour E. DiNardo C. Lower Intensity Therapy with Cladribine/Low Dose Cytarabine/Venetoclax in Older Patients with Acute Myeloid Leukemia Compares Favorably with Intensive Chemotherapy among Patients Undergoing Allogeneic Stem Cell Transplantation Cancer 2024 130 3333 3343 10.1002/cncr.35388 38809547 PMC12132108 178. DiNardo C.D. Jonas B.A. Pullarkat V. Thirman M.J. Garcia J.S. Wei A.H. Konopleva M. Döhner H. Letai A. Fenaux P. Azacitidine and Venetoclax in Previously Untreated Acute Myeloid Leukemia N. Engl. J. Med. 2020 383 617 629 10.1056/NEJMoa2012971 32786187 179. Fathi A.T. Braun T.P. Ambinder A.J. Borthakur G. Redner R.L. Arevalo M. Gutierrez S. Limon A. Faller D.V. Iadademstat and Gilteritinib for the Treatment of FLT3-Mutated Relapsed/Refractory Acute Myeloid Leukemia: The Frida Study Blood 2023 142 5974 10.1182/blood-2023-189291 180. Vidal R.S. Quarti J. Rumjanek F.D. Rumjanek V.M. Metabolic Reprogramming During Multidrug Resistance in Leukemias Front. Oncol. 2018 8 90 10.3389/fonc.2018.00090 29675398 PMC5895924 181. Farge T. Saland E. Toni F.D. Aroua N. Hosseini M. Perry R. Bosc C. Sugita M. Stuani L. Fraisse M. Chemotherapy-Resistant Human Acute Myeloid Leukemia Cells Are Not Enriched for Leukemic Stem Cells but Require Oxidative Metabolism Cancer Discov. 2017 7 716 735 10.1158/2159-8290.CD-16-0441 28416471 PMC5501738 182. Moschoi R. Imbert V. Nebout M. Chiche J. Mary D. Prebet T. Saland E. Castellano R. Pouyet L. Collette Y. Protective Mitochondrial Transfer from Bone Marrow Stromal Cells to Acute Myeloid Leukemic Cells during Chemotherapy Blood 2016 128 253 264 10.1182/blood-2015-07-655860 27257182 183. Gregory M.A. D’Alessandro A. Alvarez-Calderon F. Kim J. Nemkov T. Adane B. Rozhok A.I. Kumar A. Kumar V. Pollyea D.A. ATM/G6PD-Driven Redox Metabolism Promotes FLT3 Inhibitor Resistance in Acute Myeloid Leukemia Proc. Natl. Acad. Sci. USA 2016 113 E6669 E6678 10.1073/pnas.1603876113 27791036 PMC5086999 184. Lu X. Han L. Busquets J. Collins M. Lodi A. Marszalek J.R. Konopleva M. Tiziani S. The Combined Treatment with the FLT3-Inhibitor AC220 and the Complex I Inhibitor IACS-010759 Synergistically Depletes Wt- and FLT3-Mutated Acute Myeloid Leukemia Cells Front. Oncol. 2021 11 686765 10.3389/fonc.2021.686765 34490088 PMC8417744 185. Taylor S.J. Steidl U. Metabolic StrugGLS after FLT3 Inhibition in AML Blood 2018 131 1631 1632 10.1182/blood-2018-03-836338 29650728 186. Sharma P. Borthakur G. Targeting Metabolic Vulnerabilities to Overcome Resistance to Therapy in Acute Myeloid Leukemia Cancer Drug Resist. 2023 6 567 589 10.20517/cdr.2023.12 37842232 PMC10571063 187. Pollyea D.A. Stevens B.M. Jones C.L. Winters A. Pei S. Minhajuddin M. D’Alessandro A. Culp-Hill R. Riemondy K.A. Gillen A.E. Venetoclax with Azacitidine Disrupts Energy Metabolism and Targets Leukemia Stem Cells in Patients with Acute Myeloid Leukemia Nat. Med. 2018 24 1859 1866 10.1038/s41591-018-0233-1 30420752 PMC7001730 188. Zhang Y. Luo T. Ding X. Chang Y. Liu C. Zhang Y. Hao S. Yin Q. Jiang B. Inhibition of Mitochondrial Complex III Induces Differentiation in Acute Myeloid Leukemia Biochem. Biophys. Res. Commun. 2021 547 162 168 10.1016/j.bbrc.2021.02.027 33610916 189. Alvarez-Calderon F. Gregory M.A. Pham-Danis C. DeRyckere D. Stevens B.M. Zaberezhnyy V. Hill A.A. Gemta L. Kumar A. Kumar V. Tyrosine Kinase Inhibition in Leukemia Induces an Altered Metabolic State Sensitive to Mitochondrial Perturbations Clin. Cancer Res. 2015 21 1360 1372 10.1158/1078-0432.CCR-14-2146 25547679 PMC4359967 190. Zhang Y. Zhou F. Guan J. Zhou L. Chen B. Action Mechanism of Metformin and Its Application in Hematological Malignancy Treatments: A Review Biomolecules 2023 13 250 10.3390/biom13020250 36830619 PMC9953052 191. Wang F. Liu Z. Zeng J. Zhu H. Li J. Cheng X. Jiang T. Zhang L. Zhang C. Chen T. Metformin Synergistically Sensitizes FLT3-ITD-Positive Acute Myeloid Leukemia to Sorafenib by Promoting MTOR-Mediated Apoptosis and Autophagy Leuk. Res. 2015 39 1421 1427 10.1016/j.leukres.2015.09.016 26505133 192. Li Y. Zeng P. Xiao J. Huang P. Liu P. Modulation of Energy Metabolism to Overcome Drug Resistance in Chronic Myeloid Leukemia Cells through Induction of Autophagy Cell Death Discov. 2022 8 212 10.1038/s41420-022-00991-w 35443725 PMC9021256 193. Sobhakumari A. Orcutt K.P. Love-Homan L. Kowalski C.E. Parsons A.D. Knudson C.M. Simons A.L. 2-Deoxy-d-Glucose Suppresses the In Vivo Antitumor Efficacy of Erlotinib in Head and Neck Squamous Cell Carcinoma Cells Oncol. Res. 2016 24 55 64 10.3727/096504016X14586627440192 27178822 PMC5282972 194. Bjelosevic S. Gruber E. Newbold A. Shembrey C. Devlin J.R. Hogg S.J. Kats L. Todorovski I. Fan Z. Abrehart T.C. Serine Biosynthesis Is a Metabolic Vulnerability in FLT3-ITD-Driven Acute Myeloid Leukemia Cancer Discov. 2021 11 1582 1599 10.1158/2159-8290.CD-20-0738 33436370 195. Janssen M. Schmidt C. Bruch P.-M. Blank M.F. Rohde C. Waclawiczek A. Heid D. Renders S. Göllner S. Vierbaum L. Venetoclax Synergizes with Gilteritinib in FLT3 Wild-Type High-Risk Acute Myeloid Leukemia by Suppressing MCL-1 Blood 2022 140 2594 2610 10.1182/blood.2021014241 35857899 196. Milnerowicz S. Maszewska J. Skowera P. Stelmach M. Lejman M. AML under the Scope: Current Strategies and Treatment Involving FLT3 Inhibitors and Venetoclax-Based Regimens Int. J. Mol. Sci. 2023 24 15849 10.3390/ijms242115849 37958832 PMC10647248 197. Zhou F.-J. Zeng C.-X. Kuang W. Cheng C. Liu H.-C. Yan X.-Y. Chen X.-P. Zhou G. Cao S. Metformin Exerts a Synergistic Effect with Venetoclax by Downregulating Mcl-1 Protein in Acute Myeloid Leukemia J. Cancer 2021 12 6727 6739 10.7150/jca.60208 34659562 PMC8518002 198. Zhao Y. Zhang X. Ding X. Wang Y. Li Z. Zhao R. Cheng H.-E. Sun Y. Efficacy and Safety of FLT3 Inhibitors in Monotherapy of Hematological and Solid Malignancies: A Systemic Analysis of Clinical Trials Front. Pharmacol. 2024 15 1294668 10.3389/fphar.2024.1294668 38828446 PMC11140126 199. Perrone S. Ottone T. Zhdanovskaya N. Molica M. How Acute Myeloid Leukemia (AML) Escapes from FMS-Related Tyrosine Kinase 3 (FLT3) Inhibitors? Still an Overrated Complication? Cancer Drug Resist. 2023 6 223 238 10.20517/cdr.2022.130 37457126 PMC10344728 Figure 1 Metabolic dependencies in FLT3 Figure 2 Mitochondrial bioenergetics in FLT3 FLT3 jpm-15-00431-t001_Table 1 Table 1 Emerging therapeutic approaches targeting metabolism in AML. Drug Metabolic Target Trial References 2-Deoxy-D-glucose (2-DG) Glycolysis Pre-clinical (in vitro and in vivo) [ 68 Atovaquone OXPHOS Pre-clinical (in vitro and in vivo) Feasibility Trial ( NCT03568994 [ 170 Avocatin B, Etomoxir and ST-1326 Fatty acid oxidation Pre-clinical (in vitro and in vivo) [ 57 92 171 3-bromopyruvate (3BrPA) Glycolysis Pre-clinical (in vitro and in vivo) [ 66 LCL204 Sphingolipids Pre-clinical (in vivo) [ 172 IACS-010759 OXPHOS Phase I ( NCT02882321 [ 173 Telaglenastat (CB-839) Glutaminolysis Phase I ( NCT02071927 [ 174 Tigecycline OXPHOS Phase I ( NCT01332786 [ 175 BCT-100 Arginine metabolism Phase I/II ( NCT03455140 [ 175 ADI-PEG 20 Arginine metabolism Phase II trial ( NCT01910012 [ 176 Venetoclax OXPHOS Phase I/II/III ( NCT01994837 NCT02203773 NCT02993523 NCT05177731 NCT05048615 NCT03586609 NCT03625505 NCT04140487 NCT03455504 [ 177 178 Iadademstat OXPHOS NCT05546580 [ 179 jpm-15-00431-t002_Table 2 Table 2 Metabolic-oriented therapeutic strategies in FLT3 Drug/Combination Targeted Metabolic Pathway Mechanism of Action Effect References Quizartinib (1–5 nM) + Glutaminolysis Inhibits glutamine metabolism; increased Synergistic lethality; [ 79 Quizartinib (100 nM) + OXPHOS Inhibits mitochondrial electron transport chain Complex I Enhances sensitivity to FLT3i; [ 184 Venetoclax (100 nM in vitro/100 mg/kg in vivo/400 mg/die in clinical trial) + Mitochondrial metabolism, Impairs OXPHOS, Targets LSCs; induces apoptosis; synergizes with FLT3i via MCL-1 suppression [ 187 Antimycin A OXPHOS (Complex III inhibition) Blocks electron flow in ETC Complex III Reduces cell viability; promotes differentiation [ 188 Oligomycin A OXPHOS (Complex V/ATP synthase inhibition) Inhibits ATP production Enhances sensitivity to FLT3 inhibitors [ 189 Metformin Mitochondrial metabolism/mTOR pathway Inhibits OXPHOS and glycolysis; activates AMPK Promotes apoptosis; synergizes with FLT3i and venetoclax [ 190 191 Quizartinib + L-Asparaginase Amino acid metabolism (glutamine/asparagine depletion) Depletes glutamine/asparagine; metabolic stress Effective in quizartinib-resistant FLT3 [ 79 Crenolanib (6 µM in vitro/15 mg/Kg/die in vivo) + MP-A08 (SPHK1 inhibitor, 6–20 µM/100 mg/kg) Sphingolipid metabolism (ceramide pathway) Induces ceramide accumulation; activates stress/apoptotic signaling Promotes mitophagy and apoptosis; sensitizes to venetoclax [ 110 2-Deoxy-D-glucose (2-DG, 20 mM) Glycolysis Inhibits hexokinase; blocks glucose utilization Enhances cytotoxic effects of TKIs [ 192 193 WQ-2101 Serine synthesis Inhibits de novo serine synthesis pathway Enhances chemotherapy response in FLT3 [ 194 ",
  "metadata": {
    "Title of this paper": "How Acute Myeloid Leukemia (AML) Escapes from FMS-Related Tyrosine Kinase 3 (FLT3) Inhibitors? Still an Overrated Complication?",
    "Journal it was published in:": "Journal of Personalized Medicine",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12470870/"
  }
}