{
  "title": "Paper_236",
  "abstract": "pmc J Family Med Prim Care J Family Med Prim Care 2192 jfammpc JFMPC J Family Med Prim Care Journal of Family Medicine and Primary Care 2249-4863 2278-7135 Wolters Kluwer -- Medknow Publications PMC12488171 PMC12488171.1 12488171 12488171 41041224 10.4103/jfmpc.jfmpc_1287_24 JFMPC-14-3104 1 Review Article The role of epigenetics in cancer: From pathways to the clinic Almalki Abdulraheem A.  Department of Clinical Laboratory Sciences, College of Applied Medical Sciences, Taif University, Taif, Saudi Arabia Address for correspondence: almalki@tu.edu.sa 8 2025 24 9 2025 14 8 498122 3104 3114 28 7 2024 21 10 2024 23 10 2024 01 08 2025 02 10 2025 03 10 2025 Copyright: © 2025 Journal of Family Medicine and Primary Care 2025 https://creativecommons.org/licenses/by-nc-sa/4.0/ This is an open access journal, and articles are distributed under the terms of the Creative Commons Attribution-NonCommercial-ShareAlike 4.0 License, which allows others to remix, tweak, and build upon the work non-commercially, as long as appropriate credit is given and the new creations are licensed under the identical terms. A BSTRACT Epigenetic changes are inherited but repairable genetic DNA modifications that affect gene expression regardless of the underlying sequence. Epigenetic abnormalities have been associated with a wide range of human diseases, including cancer. Malignancy can be caused by abnormal epigenetic changes that incorrectly activate oncogenes. Epigenetic marks are appealing therapeutic targets because they are reversible and susceptible to exogenous changes. Significant progress has been made in developing treatments that target epigenetic regulation in the past few years, with several pharmaceuticals being evaluated. this review describes the epigenetic drugs currently undergoing clinical trials. It also discusses the pros and cons of using them to treat cancer and the role of epigenetics in cancer diagnosis. Biomarkers DNA methylation epigenetic gene expression histone modifications therapeutic implications Nil. pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement no pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes Introduction Chromatin is a DNA-protein complex found in eukaryotic cells, in which long DNA strands are compressed into more compact forms.[ 1 2 H2A, H2B, H3 H4 3 Epigenetics is the study of hereditary alterations to genetic function that are not related to modifications of the DNA sequence.[ 4 5 6 7 8 The pathogenesis of cancer is a complicated process influenced by multiple factors. According to research, human cancer cells have a wide range of genomic mutations and significant epigenetic defects.[ 9 Recent technological advances have aided the understanding of the epigenetic changes that lead to cancer. These technologies have also facilitated the identification of potential epigenetic biomarkers for cancer diagnosis, prognosis, risk assessment, and follow-up. This review, will highlight several epigenetic mechanisms and describe how they function in tumorigenesis, focusing on DNA methylation and histone alterations. Moreover, It will indicate how epigenetics causes gene mutations and discuss the future therapeutic implications of epigenetic research in cancer diagnosis and treatment.  1. Epigenetic regulation in cancer  Methylation of DNA in cancer DNA methylation abnormalities that disrupt typical gene activity were the first epigenetic biomarkers linked to cancer to be discovered. Soon after, it was discovered that the cytosine base in DNA could be methylated to form 5-methylcytosine (5mC), known as the fifth base, and the hypothesis that changes in DNA methylation could contribute to oncogenesis emerged.[ 10 Another possibility is that tumor suppressor gene ( TSG 11 12 CpG CpGs CpG 13 However, it is still unclear how DNA methylation changes occur in a cancerous epigenome and what biological effects may result from reduced methylation [ Figure 1 Figure 1 Epigenetic DNA methylation in malignancy[ 14 DNA hypermethylation, also referred to as the acquisition of methylation in specific regions, frequently occurs in promoter CpG CpG 15 DNMT1, DNMT3a DNMT3b DNMT DNMT1 DNMT3a DNMT3b CpGs DNMT 3L DNMT3a DNMT3b 16 DNA hypomethylation—the absence of DNA methylation across large portions of the genome—is also connected to genomic disruption and the emergence of cancer.[ 17 18 19 DNA methylation can also stop certain transcription factors (TF) from binding and can interact with methyl- CpG 20 A list of the genes undergoing DNA methylation in various human malignancies is shown in Table 1 21 Table 1 DNA methylation of genes involved in human malignancy Modifications Tumor Function DNA methyltransferases  DNMT 1 Upregulated, mutated Colon, rectum, ovarian carcinomas Maintain methylation, inhibition of transcription  DNMT3a Upregulated Colon, rectal, mammary, ovary, esophagus malignancies De novo methylation during development, imprint formation, inhibition  DNMT3b Upregulated Mammary, hepatic, colonic, rectal adenocarcinoma, De novo methylation during development, repeated methylation inhibition  DNMT3L Upregulated, mutated Mammary, stomach, cervix malignancies Interaction with DNMT3a & b and enhance methylation Methyl-CpG-binding proteins  MeCP2 Upregulated, mutated Prostatic adenocarcinoma Transcription inhibition  MBD1 Upregulated, mutated Prostatic, colonic adenocarcinoma, lung malignancies Transcription inhibition  MBD2 Upregulated, mutated Prostatic, colonic adenocarcinoma, lung malignancies Transcription inhibition  MBD3 Upregulated, mutated Colonic, pulmonary malignancies Transcription inhibition  MBD4 Upregulated, mutated Colonic, stomach, uterine malignancy Repair of DNA, glycosylation domain, deaminated 5mC repair  Kaiso Upregulated Colonic, GIT, pulmonary malignancies Transcription inhibition DNA demethylases  TET Downregulated Prostatic, mammary, pulmonary, and pancreas malignancy Conversion of 5mC to 5hmC (5 hydroxymethyl-cytosine)  TET1, TET2, TET3 Mutation inactivated Myeloid leukemia, brain gliomas, chondromas, thyroid carcinomas Studies of hypomethylation have shown that the loss of DNA cytosine methylation can result in genomic instability. Regional hypermethylation at promoter regions results in inherited silence and subsequently silences genes, including tumor suppressors. Methylation of CpG  Histone modifications in cancer Another epigenetic regulation mechanism is histone modification, which alters the structure of chromatin and is essential for gene regulation and tumor development. The modifications are covalent changes that occur within the tail regions of histones H2B H3 H4 H3K4me3 H3K36me3 H3K27me3 H3K9me2/ H4K20me3 22 A complex network of histone modifiers and chromatin-bound proteins regulates transcriptional activation and repression. To preserve chromatin structure, operate the appropriate gene expression program, and allow biological control, the cell maintains a balance between certain modifications and modifiers.[ 23 24 Methylation, acetylation, and phosphorylation are the three modifications that most frequently occur in the tail regions of histones. However, other modifications such as formylation, lactylation, propionylation, ubiquitination, and crotonylation have also been observed. The altered amino acid sequences of the histone tails are demonstrated in Figure 2 25 Figure 2 Modifications to histones. Four important histones, H2A, H2B, H3, and H4, can all undergo different modifications within their tail regions. Moreover, H2A and H3 variants can be changed in various ways, including acetylation or phosphorylation on H2AX CENP-A H3.3 25  1.2.1 Histone methylation Histone methylation is the process by which lysine methyltransferases (KMTs) or arginine methyltransferases (PRMTs) transfer methyl groups from S-adenosyl methionine (SAM) to lysine (K) and arginine (R) residues within the H3 or H4 tails. Lysine demethylases (KDMs) are responsible for demethylating histone lysine groups.[ 26 27 In cancer cells, histone-modifying enzymes and histone proteins are frequently altered. These alterations result in modifications to chromatin methylation sequences, which can promote tumor growth and dissemination. According to the Cancer Genome Atlas (TCGA) database, cancer outcomes are associated with genetic defects in enzymes that methylate histones.[ 28 H3K27me3 EZH2 29  1.2.2 Histone acetylation Histone acetylation and deacetylation processes can also occur on lysine amino acids in histone tails that extend from the nucleosome. They are involved in several essential physiological processes, including DNA synthesis, DNA break repair, and RNA synthesis.[ 30 HAT HDAC 31 Many studies have found evidence that histone acetylation abnormalities contribute to malignant transformation and spread. Due to their capacity to modulate the expression of oncogenes like p300 CBP HDACs 32 p300 CBP HATs 33 p300 CBP  1.2.3 Histone phosphorylation Phosphorylation occurs when negative ions are added to serine (S), threonine (T), and tyrosine (Y) residues at the ends of histones. Phosphorylation changes the structure of chromatin in such a way that allows TFs to control gene expression related to the cell cycle and proliferation.[ 34 H3S10P 35 Loss of N-acetyltransferase D ( NatD H4S1 36 37  1.2.4 Other histone modifications Ubiquitination of histones, mainly H2A H2B 38 H2AK119 H3K27me3 PRC2 39 H2AK119ub H3K27me3 40 It has been found that the cullin4B-ring E3 ligase complex ( CRL4B 41 RNF20/40 H2BK120 42 UBR7 31 22 30  1.3 Noncoding RNAs More than 70% of the genome comprises non-coding RNAs (ncRNAs), influencing chromatin control and genomic activity. An ncRNA is classified as either short (less than 200 nucleotides) or long (more than 200 nucleotides).[ 43 44 45 46 47 Many studies have shown that more than half of miRNA genes are found in regions on the chromosome linked to cancer or other disorders. Scenario prediction using bioinformatics tools has shown that the sequences of miRNAs and their changes over time determine how they interact with their targets (candidate mRNAs).[ 48 49  1.4 Nucleosome rearrangement Studies have found that changes in the arrangement of nucleosomes are related to gene transcription and malignancy.[ 50 51 As an example, normal cells lack nucleosomes in the promoter regions of the hypomethylated tumor suppressor MLH1 52 MLH1 52 53  1.5 Looping of chromosomes When two cis-configured genetic regions on the same chromosome are in closer proximity to one another than to the nucleotides that separate them, they are said to form a “chromosome loop”.[ 54 PSA, TMPRSS2 UBE2C 55 TMPRSS2-ETS 56 57  2. Moving to the clinic: clinical implications  Biomarkers of epigenetic change in malignancy In recent years, epigenetic markers have shown promise in human cancer diagnosis and prediction of prognosis.[ 58 59 CDH13, MYOD1, MGMT, p16 INK4b RASSF1A 60 GSTP1 RASSF1A, RARB2, APC GSTP1 61 DNA methylation-based prognostic and diagnostic biomarkers are in their infancy, and their effectiveness in various clinical settings remains to be confirmed. In human cancers, SINEs LINEs 62 Altered histone structures can also be used to predict and diagnose malignancy. DNA methylation may be caused by repressed nucleosome complexes linked to specific histone changes, such as the methylation of H3K9, H3K27 H4K20 26 H3K4 H3K18 63  Prostate cancer The levels of PCA3 and ncRNA were high in the blood of 95% of men with prostatic adenocarcinoma. As a control input for prostate-specific antigen (PSA) mRNA, the commercially available prostatic cancer biomarker PROGENSATM measures PCA3 activity. PCA3 testing might be helpful for early diagnosis of prostatic adenocarcinoma using a “mid-invasive” method, which would prevent an unnecessary prostatic biopsy.[ 64 GSTP1 65  Glioblastoma of the brain In glioblastoma patients receiving temozolomide therapy, methylation of the MGMT gene promoter has been associated with better outcomes, suggesting that it could be used as an epigenetic marker.[ 66  Colonic carcinoma Hypermethylated DNA is linked to genomic instability, and research confirms that it is a feature of colonic malignancy. CpG island methylator phenotype (CIMP) positive colon cancers are characterized by higher frequencies of p16 and THBS1 methylation as well as prevalent KRAS and BRAF mutations; the methylation state of five genotypes ( CACNA1G, IGF2, NEUROG1, RUNX3, and SOCS126) 67 RASSF1A, FHIT, and MGMT 68  Carcinoma of the esophagus One study found that multiple genes with different levels of methylation may be involved in the development of esophageal adenocarcinoma and could, therefore, be used to diagnose the disease.[ 69  Bladder cancer Currently, no reliable diagnostic or prognostic biomarkers for bladder cancer are available on the market. There have been descriptions of methylation-based markers that are more sensitive than cytology. When used to analyze the genomic sequence of malignant bladder cells, VIM, GDF15 TMEFF2 70  Breast cancer Several studies have shown that histone-modifying enzymes, such as EZH2, can be altered; the EZH2 71 72 73 74 SETD7 75 TNBCs were classified as high, intermediate, or low risk by Stirazaker et al 76  Carcinoma of the ovary There is evidence that acetylation of histones, downregulation of PACE3 BIRC5 pRb Furthermore, it has been shown that loss of H3K27me3 77 H3K4me3 H3K27me3 78 79 et al 80 H3K27me3 H3K27me3 81  Epigenetics as biomarkers for developing drug resistance Epigenetics has been identified as a factor in the development of drug resistance, which has implications for cancer treatment. Histone deacetylase 1 (HDAC1) is downregulated in ovarian tumor cells with acquired resistance to chemotherapy due to a lack of apoptotic antigen 1 expression.[ 82 H3K27me3 H3K4me3 83 The developmental genes MSX1, DAXX TMEM88 84 DNA methylation by lncRNA (HOTAIR) controls EMT and is a marker of carboplatin resistance.[ 85 86 87 Combination therapies with epigenetic inhibitors may be the best way to mitigate drug resistance because this approach induces sensitivity in tumors that were previously non-responsive to chemotherapy. Ultimately, this could lead to more effective, individualized care for cancer patients and higher survival rates.  Drugs that target epigenetic changes in cancer patients Compared to healthy cells, the epigenome of a cancer cell has alterations in its histones, miRNA profile, and DNA methylation.[ 4 Although the FDA has only approved two types of epigenetic medications so far—DNA methylation inhibitors (iDNMTs) and histone deacetylase inhibitors (iHDACs)—several novel targets are nearing the end of human trials and have the potential to be used in future therapeutics[ 88 89 Figure 3 Figure 3 Epigenetic drugs and their primary modes of function. Some of these pharmaceuticals have been licensed by the FDA, while others are still being studied[ 89 The first epigenetic drug approved by the US Food and Drug Administration was 5-azacitidine (Azacitidine), a DNMTi used to treat myelodysplastic syndromes (MDS) and acute myeloid leukemia (AML).[ 90 91 92 93 GSK2879552 is an epigenetic medication that treats acute myeloid leukemia by inducing specific DNA hypomethylation. It prevents the activity of the lysine-specific histone demethylase 1A (LSD1).[ 94 95  The role of epigenetics in precision medicine Cancer is a complex disease to treat because of its heterogeneity. Even within a malignant tumor, there is genomic diversity at the molecular level. Cancer heterogeneity may influence how effectively patients respond to treatments and explain why some fail. Failure occurs because several current cancer treatments are designed to treat all patients in the same way, regardless of the unique variations between individuals. Current cancer therapeutic approaches, particularly surgical intervention, systemic treatment, and radiation, are not selective and can have a wide range of adverse effects. Although it is often necessary, surgery rarely results in a complete cure for malignancy. Both chemotherapy and radiation therapy have the same goal: to destroy malignant cells. However, they also endanger normal cells, have unintended side effects on surrounding healthy tissue, and, in the case of chemotherapy, frequently result in the emergence of drug resistance.[ 96 97 Many tyrosine kinase inhibitors, including imatinib, gefitinib, cetuximab, and trastuzumab, have shown promising results in precision medicine.[ 98 Drugs designed to inhibit the activation of mutations in IHD and EZH2 have been tested in clinical trials to treat a variety of hematological malignancies and genetically determined solid tumors. Tranylcypromine (TCP) is a common antidepressant that blocks the enzyme monoamine oxidase (MAO). TCP can make non-acute promyelocytic leukemia (AML) cells more sensitive to treatment with all-trans retinoic acid (ATARA) by turning on H3K4me2 and activating genes involved in myeloid differentiation. Treatment with TCP promotes cellular differentiation and apoptosis in MLL-AF9 leukemia.[ 99 100 101 102 103 104 Conclusion The relationship between cancer and epigenetics is well-established. Epigenetics plays an essential role in the initiation and progression of cancer by controlling tumor suppressor gene on-and-off states and tumor environment remodeling. Malignancies are not solely the result of mutation; epigenetic mechanisms also play a role. Interestingly, epigenetic modifications include genetically inherited and reversible mechanisms, making them a potential focus for cancer treatment. Abnormal mechanisms of DNA methylation or epimutations have been associated with various malignancies and can be employed as diagnostic markers for some of these malignancies. Different types of cancer are now being treated with epigenetic drugs, either as monotherapies or in combination with traditional chemotherapies. So far, the clinical responses to epigenetic treatments for hematologic malignancies have been impressive. However, their performance as single therapies has been less encouraging in other solid tumors due to poor effectiveness and/or unwanted side effects. This could be because these solid tumors originate from cells that have achieved more terminal differentiation and are less susceptible to epigenetic disturbance, suggesting that prolonged suppression of the epigenetic targets and tailoring dose schedules may increase efficacy. Furthermore, epigenetic medications combined with other therapies, such as targeted or immune-based therapy, may offer the best chance of improving clinical outcomes in solid tumors. On the whole, epigenetic drug discovery has progressed significantly in recent years and the ongoing efforts in this field are likely to continue to improve cancer diagnostics and treatments. Conflicts of interest There are no conflicts of interest. 1 Buenrostro JD Wu B Litzenburger UM Ruff D Gonzales ML Snyder MP Chang HY Single-cell chromatin accessibility reveals principles of regulatory variation Nature 2015 523 486 90 26083756 10.1038/nature14590 PMC4685948 2 Giles KA Taberlay PC The role of nucleosomes in epigenetic gene regulation Clinical Epigenetics Singapore Springer 2019 87 117 3 D’Oto A Tian QW Davidoff AM Yang J Histone demethylases and their roles in cancer epigenetics J Med Oncol Ther 2016 1 34 40 28149961 PMC5279889 4 Zhang L Lu Q Chang C Epigenetics in health and disease Epigenetics in Allergy and Autoimmunity Singapore Springer 2020 3 55 10.1007/978-981-15-3449-2_1 32445090 5 Cheng Y He C Wang M Ma X Mo F Yang S Targeting epigenetic regulators for cancer therapy: Mechanisms and advances in clinical trials Signal Transduct Target Ther 2019 4 62 31871779 10.1038/s41392-019-0095-0 PMC6915746 6 Skourti E Dhillon P Cancer epigenetics: Promises and pitfalls for cancer therapy FEBS J 2022 289 1156 9 35233949 10.1111/febs.16395 7 Bennett RL Licht JD Targeting epigenetics in cancer Ann Rev Pharmacol Toxicol 2018 58 187 207 28992434 10.1146/annurev-pharmtox-010716-105106 PMC5800772 8 Lee JE Kim MY Cancer epigenetics: Past, present and future Semin Cancer Biol 2022 83 4 14 33798724 10.1016/j.semcancer.2021.03.025 9 Sharma S Kelly TK Jones PA Epigenetics in cancer Carcinogenesis 2010 31 27 36 19752007 10.1093/carcin/bgp220 PMC2802667 10 Walsh CP Xu GL Cytosine methylation and DNA repair DNA Methylation: Basic Mechanisms. Current Topics in Microbiology and Immunology Berlin, Heidelberg Springer 2006 283 315 10.1007/3-540-31390-7_11 16570853 11 Baylin SB Jones PA A decade of exploring the cancer epigenome—biological and translational implications Nat Rev Cancer 2011 11 726 34 21941284 10.1038/nrc3130 PMC3307543 12 Dabrowski MJ Wojtas B Global DNA methylation patterns in human gliomas and their interplay with other epigenetic modifications Int J Mol Sci 2019 20 3478 doi:10.3390/ijms20143478 31311166 10.3390/ijms20143478 PMC6678179 13 Angeloni A Bogdanovic O Sequence determinants, function, and evolution of CpG islands Biochem Soc Trans 2021 49 1109 19 34156435 10.1042/BST20200695 PMC8286816 14 Baylin SB Jones PA Epigenetic determinants of cancer Cold Spring Harb Perspect Biol 2016 8 a019505 27194046 10.1101/cshperspect.a019505 PMC5008069 15 Gujar H Weisenberger DJ Liang G The roles of human DNA methyltransferases and their isoforms in shaping the epigenome Genes 2019 10 172 doi:10.3390/ijms20143478 30813436 10.3390/genes10020172 PMC6409524 16 Vlachogiannis G Niederhuth CE Tuna S Stathopoulou A Viiri K de Rooij DG The Dnmt3L ADD domain controls cytosine methylation establishment during spermatogenesis Cell Rep 2015 10 944 56 25683717 10.1016/j.celrep.2015.01.021 PMC4534369 17 Van Tongelen A Loriot A De Smet C Oncogenic roles of DNA hypomethylation through the activation of cancer-germline genes Cancer Lett 2017 396 130 7 28342986 10.1016/j.canlet.2017.03.029 18 Zhang W Klinkebiel D Barger CJ Pandey S Guda C Miller A Global DNA hypomethylation in epithelial ovarian cancer: Passive demethylation and association with genomic instability Cancers 2020 12 764 doi:10.3390/cancers12030764 32213861 10.3390/cancers12030764 PMC7140107 19 Usui G Matsusaka K Mano Y Urabe M Funata S Fukayama M DNA methylation and genetic aberrations in gastric cancer Digestion 2021 102 25 32 33070127 10.1159/000511243 20 Zhang J Yang C Wu C Cui W Wang L DNA methyltransferases in cancer: Biology, paradox, aberrations, and targeted therapy Cancers 2020 12 2123 doi:10.3390/cancers12082123 32751889 10.3390/cancers12082123 PMC7465608 21 Kanwal R Gupta K Gupta S Cancer epigenetics: An introduction Methods Mol Biol 2015 1238 3 25 25421652 10.1007/978-1-4939-1804-1_1 22 Zhao Z Shilatifard A Epigenetic modifications of histones in cancer Genome Biol 2019 20 1 6 doi:10.1186/s13059-019-1870-5 31747960 10.1186/s13059-019-1870-5 PMC6868810 23 Wang L Zhao Z Ozark PA Fantini D Marshall SA Rendleman EJ Resetting the epigenetic balance of Polycomb and COMPASS function at enhancers for cancer therapy Nat Med 2018 24 758 69 29785026 10.1038/s41591-018-0034-6 PMC6055231 24 Rickels R Hu D Collings CK Woodfin AR Piunti A Mohan M An evolutionary conserved epigenetic mark of polycomb response elements implemented by Trx/MLL/COMPASS Mol Cell 2016 63 318 28 27447986 10.1016/j.molcel.2016.06.018 PMC4996622 25 Yang Y Zhang M Wang Y The roles of histone modifications in tumorigenesis and associated inhibitors in cancer therapy J Natl Cancer Center 2022 2 277 90 39036551 10.1016/j.jncc.2022.09.002 PMC11256729 26 Saleh R Toor SM Sasidharan Nair V Elkord E Role of epigenetic modifications in inhibitory immune checkpoints in cancer development and progression Front Immunol 2020 11 1469 doi:10.3389/fimmu.2020.01469 32760400 10.3389/fimmu.2020.01469 PMC7371937 27 Bannister AJ Kouzarides T Regulation of chromatin by histone modifications Cell Res 2011 21 381 95 21321607 10.1038/cr.2011.22 PMC3193420 28 Sharma A Liu H Herwig-Carl MC Chand Dakal T Schmidt-Wolf IG Epigenetic regulatory enzymes: Mutation prevalence and coexistence in cancers Cancer Investig 2021 39 257 73 33411587 10.1080/07357907.2021.1872593 29 Reiter JG Baretti M Gerold JM Makohon-Moore AP Daud A Iacobuzio-Donahue CA An analysis of genetic heterogeneity in untreated cancers Nature Reviews Cancer 2019 19 639 50 31455892 10.1038/s41568-019-0185-x PMC6816333 30 Chan JC Maze I Nothing is yet set in (hi) stone: Novel post-translational modifications regulating chromatin function Trends Biochem Sci 2020 45 829 44 32498971 10.1016/j.tibs.2020.05.009 PMC7502514 31 Kiat Y Vortman Y Sapir N Feather moult and bird appearance are correlated with global warming over the last 200 years Nat Commun 2019 10 2540 31182713 10.1038/s41467-019-10452-1 PMC6557852 32 Sugiura M Sato H Kanesaka M Imamura Y Sakamoto S Ichikawa T Epigenetic modifications in prostate cancer Int J Urol 2021 28 140 9 33111429 10.1111/iju.14406 33 Cohen I Poręba E Kamieniarz K Schneider R Histone modifiers in cancer: Friends or foes? Genes Cancer 2011 2 631 47 21941619 10.1177/1947601911417176 PMC3174261 34 Villanueva L Álvarez-Errico D Esteller M The contribution of epigenetics to cancer immunotherapy Trends Immunol 2020 41 676 91 32622854 10.1016/j.it.2020.06.002 35 Komar D Juszczynski P Rebelled epigenome: Histone H3S10 phosphorylation and H3S10 kinases in cancer biology and therapy Clin Epigenetics 2020 12 1 4 doi:10.1186/s13148-020-00941-2 10.1186/s13148-020-00941-2 PMC7556946 33054831 36 Ju J Chen A Deng Y Liu M Wang Y Wang Y NatD promotes lung cancer progression by preventing histone H4 serine phosphorylation to activate slug expression Nat Commun 2017 8 928 29030587 10.1038/s41467-017-00988-5 PMC5640650 37 Martire S Gogate AA Whitmill A Tafessu A Nguyen J Teng YC Phosphorylation of histone H3. 3 at serine 31 promotes p300 activity and enhancer acetylation Nat Genet 2019 51 941 6 31152160 10.1038/s41588-019-0428-5 PMC6598431 38 Mattiroli F Penengo L Histone ubiquitination: An integrative signaling platform in genome stability Trends Genet 2021 37 566 81 33485674 10.1016/j.tig.2020.12.005 39 van Mierlo G Veenstra GJ Vermeulen M Marks H The complexity of PRC2 subcomplexes Trends Cell Biol 2019 29 660 71 31178244 10.1016/j.tcb.2019.05.004 40 Żylicz JJ Bousard A Žumer K Dossin F Mohammad E da Rocha ST The implication of early chromatin changes in X chromosome inactivation Cell 2019 176 182 97 30595450 10.1016/j.cell.2018.11.041 PMC6333919 41 Hu H Yang Y Ji Q Zhao W Jiang B Liu R CRL4B catalyzes H2AK119 monoubiquitination and coordinates with PRC2 to promote tumorigenesis Cancer Cell 2012 22 781 95 23238014 10.1016/j.ccr.2012.10.024 42 Kim J Guermah M McGinty RK Lee JS Tang Z Milne TA RAD6-Mediated transcription-coupled H2B ubiquitylation directly stimulates H3K4 methylation in human cells Cell 2009 137 459 71 19410543 10.1016/j.cell.2009.02.027 PMC2678028 43 Sana J Faltejskova P Svoboda M Slaby O Novel classes of non-coding RNAs and cancer J Transl Med 2012 10 1 21 doi:10.1186/1479-5876-10-103 22613733 10.1186/1479-5876-10-103 PMC3434024 44 Lee Y Kim M Han J Yeom KH Lee S Baek SH MicroRNA genes are transcribed by RNA polymerase II EMBO J 2004 234051 60 10.1038/sj.emboj.7600385 PMC524334 15372072 45 Friedman RC Farh KK Burge CB Bartel DP Most mammalian mRNAs are conserved targets of microRNAs Genome Res 2009 19 92 105 18955434 10.1101/gr.082701.108 PMC2612969 46 Hauptman N Glavač D Long non-coding RNA in cancer Int J Mol Sci 2013 14 4655 69 23443164 10.3390/ijms14034655 PMC3634483 47 Mitra SA Mitra AP Triche TJ A central role for long non-coding RNA in cancer Front Genet 2012 3 17 22363342 10.3389/fgene.2012.00017 PMC3279698 48 Fabian MR Sonenberg N Filipowicz W Regulation of mRNA translation and stability by microRNAs Annu Rev Biochem 2010 79 351 79 20533884 10.1146/annurev-biochem-060308-103103 49 MacFarlane LA R Murphy P MicroRNA: Biogenesis, function and role in cancer Curr Genomics 2010 11 537 61 21532838 10.2174/138920210793175895 PMC3048316 50 Henikoff S Nucleosome destabilization in the epigenetic regulation of gene expression Nat Rev Gen 2008 9 15 26 10.1038/nrg2206 18059368 51 van Schaik T Manzo SG Vouzas AE Liu NQ Teunissen H de Wit E Dynamic chromosomal interactions and control of heterochromatin positioning by Ki-67 EMBO Rep 2022 23 e55782 doi:10.15252/embr. 202255782 36245428 10.15252/embr.202255782 PMC9724667 52 Hesson LB Patil V Sloane MA Nunez AC Liu J Pimanda JE Reassembly of nucleosomes at the MLH1 promoter initiates resilencing following decitabine exposure PLoS Genet 2013 9 e1003636 doi:10.1371/journal.pgen. 1003636 23935509 10.1371/journal.pgen.1003636 PMC3723495 53 Ibrahim DM Mundlos S The role of 3D chromatin domains in gene regulation: A multi-facetted view on genome organization Curr Opin Genet Dev 2020 61 1 8 doi:10.1016/j.gde. 2020.02.015 32199341 10.1016/j.gde.2020.02.015 54 Kadauke S Blobel GA Chromatin loops in gene regulation Biochim Biophys Acta 2009 1789 17 25 18675948 10.1016/j.bbagrm.2008.07.002 PMC2638769 55 Lonergan PE Tindall DJ Androgen receptor signaling in prostate cancer development and progression J Carcinogenesis 2011 10 20 10.4103/1477-3163.83937 PMC3162670 21886458 56 Gupta GP Massagué J Cancer metastasis: Building a framework Cell 2006 127 679 95 17110329 10.1016/j.cell.2006.11.001 57 Ribarska T Bastian KM Koch A Schulz WA Specific changes in the expression of imprinted genes in prostate cancer—implications for cancer progression and epigenetic regulation Asian J Androl 2012 14 436 50 22367183 10.1038/aja.2011.160 PMC3720155 58 Kamińska K Nalejska E Kubiak M Wojtysiak J Żołna Ł Kowalewski J Prognostic and predictive epigenetic biomarkers in oncology Mol Diagn Ther 2019 23 83 95 30523565 10.1007/s40291-018-0371-7 PMC6394434 59 Roy D Tiirikainen M Diagnostic power of DNA methylation classifiers for early detection of cancer Trends Cancer 2020 6 78 81 32061307 10.1016/j.trecan.2019.12.006 PMC7188195 60 Zheng K Liu H Zhu S Li H Chen X DNA methylation analysis methods for cancer research 5 th Atlantis Press 2015 1042 7 61 Madu CO Lu Y Novel diagnostic biomarkers for prostate cancer J Cancer 2010 1 150 20975847 10.7150/jca.1.150 PMC2962426 62 Beltrán-García J Osca-Verdegal R Mena-Mollá S García-Giménez JL Epigenetic IVD tests for personalized precision medicine in cancer Front Genet 2019 10 621 doi:10.3389/fgene.2019.00621 31316555 10.3389/fgene.2019.00621 PMC6611494 63 Patra SK Deb M Patra A Molecular marks for epigenetic identification of developmental and cancer stem cells Clin Epigenetics 2011 2 27 53 22704268 10.1007/s13148-010-0016-0 PMC3365374 64 Durand X Moutereau S Xylinas E De La Taille A Progensa™PCA3 test for prostate cancer Expert Rev Mol Diagn 2011 11 137 44 21405964 10.1586/erm.10.122 65 Witt JH Friedrich M Jandrig B Porsch M Baumunk D Liehr UB Molecular margin status after radical prostatectomy using glutathione S-transferase P1 (GSTP1) promoter hypermethylation BJU Int 2022 130 454 62 34657365 10.1111/bju.15618 66 Kim M Yoo J Chang JH Kim SH Association of MGMT gene promoter methylation with clinicopathological parameters in patients with wild-type IDH glioblastoma Anticancer Res 2022 42 335 41 34969742 10.21873/anticanres.15490 67 Zhang H Zhang RH Liao XM Yang D Wang YC Zhao YL Discovery of β-carboline derivatives as a highly potent cardioprotectant against myocardial ischemia-reperfusion injury J Med Chem 2021 64 9166 81 34132541 10.1021/acs.jmedchem.1c00384 68 Sinha R Hussain S Mehrotra R Kumar RS Kumar K Pande P Kras gene mutation and RASSF1A, FHIT and MGMT gene promoter hypermethylation: Indicators of tumor staging and metastasis in adenocarcinomatous sporadic colorectal cancer in Indian population PLoS One 2013 8 e60142 doi:10.1371/journal.pone.0060142 23573237 10.1371/journal.pone.0060142 PMC3616004 69 Lin DC Wang MR Koeffler HP Genomic and epigenomic aberrations in esophageal squamous cell carcinoma and implications for patients Gastroenterology 2018 154 374 89 28757263 10.1053/j.gastro.2017.06.066 PMC5951382 70 Costa VL Henrique R Danielsen SA Duarte-Pereira S Eknaes M Skotheim RI Three epigenetic biomarkers, GDF15, TMEFF2, and VIM, accurately predict bladder cancer from DNA-based analyses of urine samples Clin Cancer Res 2010 16 5842 51 20975101 10.1158/1078-0432.CCR-10-1312 71 Kemp K Griffiths J Campbell S Lovell K An exploration of the follow-up up needs of patients with inflammatory bowel disease J Crohns Colitis 2013 7 e386 95 23541150 10.1016/j.crohns.2013.03.001 72 Mathioudaki K Scorilas A Ardavanis A Lymberi P Tsiambas E Devetzi M Clinical evaluation of PRMT1 gene expression in breast cancer Tumor Biol 2011 32 575 82 10.1007/s13277-010-0153-2 21229402 73 Gurdal H Tuglu MM Bostanabad SY Dalkiliç B Partial agonistic effect of cetuximab on epidermal growth factor receptor and Src kinase activation in triplenegative breast cancer cell lines Int J Oncol 2019 54 1345 56 30720056 10.3892/ijo.2019.4697 74 Bianchini G Balko JM Mayer IA Sanders ME Gianni L Triple-negative breast cancer: Challenges and opportunities of a heterogeneous disease Nat Rev Clin Oncol 2016 13 674 90 27184417 10.1038/nrclinonc.2016.66 PMC5461122 75 Huang R Li X Yu Y Ma L Liu S Zong X SETD7 is a prognosis predicting factor of breast cancer and regulates redox homeostasis Oncotarget 2017 8 94080 90 29212211 10.18632/oncotarget.21583 PMC5706857 76 Stirzaker C Zotenko E Song JZ Qu W Nair SS Locke WJ Methylome sequencing in triple-negative breast cancer reveals distinct methylation clusters with prognostic value Nat Commun 2015 6 5899 doi:10.1038/ncomms6899 25641231 10.1038/ncomms6899 77 Li M Shi M Xu Y Qiu J Lv Q Histone methyltransferase KMT2D regulates H3K4 methylation and is involved in the pathogenesis of ovarian cancer Cell Transplant 2021 30 09636897211027521 doi:10.1177/09636897211027521 34705580 10.1177/09636897211027521 PMC8554562 78 Chapman-Rothe N Curry E Zeller C Liber D Stronach E Gabra H Chromatin H3K27me3/H3K4me3 histone marks define gene sets in high-grade serous ovarian cancer that distinguish malignant, tumour-sustaining and chemo-resistant ovarian tumour cells Oncogene 2013 32 4586 92 23128397 10.1038/onc.2012.477 79 Hooda J Novak M Salomon MP Matsuba C Ramos RI MacDuffie E Early loss of histone H2B monoubiquitylation alters chromatin accessibility and activates key immune pathways that facilitate progression of ovarian cancer Cancer Res 2019 79 760 72 30563893 10.1158/0008-5472.CAN-18-2297 PMC6377833 80 Tang G Guo J Zhu Y Huang Z Liu T Cai J Metformin inhibits ovarian cancer via decreasing H3K27 trimethylation Int J Oncol 2018 52 1899 911 29620187 10.3892/ijo.2018.4343 PMC5919713 81 Jones BA Varambally S Arend RC Histone methyltransferase EZH2: A therapeutic target for ovarian cancer Mol Cancer Ther 2018 17 591 602 29726819 10.1158/1535-7163.MCT-17-0437 PMC5939583 82 Cacan E Histone deacetylase-1-mediated suppression of FAS in chemoresistant ovarian cancer cells Anticancer Res 2016 36 2819 26 27272793 83 Curry E Zeller C Masrour N Patten DK Gallon J Wilhelm-Benartzi CS Genes predisposed to DNA hypermethylation during acquired resistance to chemotherapy are identified in ovarian tumors by bivalent chromatin domains at initial diagnosis bivalent chromatin and acquired HGSOC CpG methylation Cancer Res 2018 78 1383 91 29339543 10.1158/0008-5472.CAN-17-1650 84 Bonito NA Borley J Wilhelm-Benartzi CS Ghaem-Maghami S Brown R Epigenetic regulation of the homeobox gene MSX1 associates with platinum-resistant disease in high-grade serous epithelial ovarian cancer Clin Cancer Res 2016 22 3097 104 26763252 10.1158/1078-0432.CCR-15-1669 PMC4849558 85 Singh A Gupta S Sachan M Epigenetic biomarkers in the management of ovarian cancer: Current prospectives Front Cell Dev Biol 2019 7 182 31608277 10.3389/fcell.2019.00182 PMC6761254 86 Fang F Cardenas H Huang H Jiang G Perkins SM Zhang C Genomic and epigenomic signatures in ovarian cancer associated with resensitization to platinum drugs Cancer Res 2018 78 631 44 29229600 10.1158/0008-5472.CAN-17-1492 PMC5811373 87 Zhang J Luo J Jiang H Xie T Zheng J Tian Y Corrigendum: The tumor suppressor role of zinc finger protein 671 (ZNF671) in multiple tumors based on cancer single-cell sequencing Front Oncol 2020 10 339 doi:10.3389/fonc.2020.00339 32211338 10.3389/fonc.2020.00339 PMC7076908 88 Berdasco M Esteller M Clinical epigenetics: Seizing opportunities for translation Nat Rev Gen 2019 20 109 27 10.1038/s41576-018-0074-2 30479381 89 Roberti A Valdes AF Torrecillas R Fraga MF Fernandez AF Epigenetics in cancer therapy and nanomedicine Clin Epigenetics 2019 11 1 8 doi:10.1186/s13148-019-0675-4 31097014 10.1186/s13148-019-0675-4 PMC6524244 90 Itzykson R Thépot S Berthon C Delaunay J Bouscary D Cluzeau T Azacitidine for the treatment of relapsed and refractory AML in older patients Leukemia Res 2015 39 124 30 25524177 10.1016/j.leukres.2014.11.009 91 Julia E Salles G EZH2 inhibition by tazemetostat: Mechanisms of action, safety and efficacy in relapsed/refractory follicular lymphoma Future Oncol 2021 17 2127 40 33709777 10.2217/fon-2020-1244 PMC9892962 92 Barghout SH Mann MK Aman A Yu Y Alteen MG Schimmer AD Combinatorial anticancer drug screen identifies off-target effects of epigenetic chemical probes ACS Chem Biol 2022 17 2801 16 36084291 10.1021/acschembio.2c00451 93 Marcos-Villar L Nieto A The DOT1L inhibitor Pinometostat decreases the host-response against infections: Considerations about its use in human therapy Sci Rep 2019 9 16862 31727944 10.1038/s41598-019-53239-6 PMC6856118 94 Smitheman KN Severson TM Rajapurkar SR McCabe MT Karpinich N Foley J Lysine specific demethylase 1 inactivation enhances differentiation and promotes cytotoxic response when combined with all-trans retinoic acid in acute myeloid leukemia across subtypes Haematologica 2019 104 1156 67 30514804 10.3324/haematol.2018.199190 PMC6545850 95 Fang Y Liao G Yu B LSD1/KDM1A inhibitors in clinical trials: Advances and prospects J Hematol Oncol 2019 12 1 4 31801559 10.1186/s13045-019-0811-9 PMC6894138 96 Xie J Yong Y Dong X Du J Guo Z Gong L Therapeutic nanoparticles based on curcumin and bamboo charcoal nanoparticles for chemo-photothermal synergistic treatment of cancer and radioprotection of normal cells ACS Appl Mater Interfaces 2017 9 14281 91 28381089 10.1021/acsami.7b02622 97 Sheen Y Cho I Choi J Park J Co-treatment with vactosertib, a novel, orally bioavailable activin receptor-like kinase 5 inhibitor, suppresses radiotherapy-induced epithelial-to-mesenchymal transition, cancer cell stemness, and lung metastasis of breast cancer: ALK5 inhibitor suppressed radiation induced metastasis Radiol Oncol 2022 56 185 97 35390248 10.2478/raon-2022-0012 PMC9122287 98 Kudo K Ohashi K Makimoto G Higo H Kato Y Kayatani H Triplet therapy with afatinib, cetuximab, and bevacizumab induces deep remission in lung cancer cells harboring EGFR T790M in vivo Mol Oncol 2017 11 670 81 28388009 10.1002/1878-0261.12063 PMC5467494 99 Harris WJ The histone demethylase KDM1A sustains the oncogenic potential of MLL-AF9 leukaemia stem cells Cancer Cell 2012 21 473 87 22464800 10.1016/j.ccr.2012.03.014 100 Maes T Carceller E Salas J Ortega A Buesa C Advances in the development of histone lysine demethylase inhibitors Curr Opin Pharmacol 2015 23 52 60 26057211 10.1016/j.coph.2015.05.009 101 Schenk T Chen WC Göllner S Howell L Jin L Hebestreit K Inhibition of the LSD1 (KDM1A) demethylase reactivates the all-trans-retinoic acid differentiation pathway in acute myeloid leukemia Nat Med 2012 18 605 11 22406747 10.1038/nm.2661 PMC3539284 102 Fiskus W Sharma S Shah B Portier BP Devaraj SG Liu K Highly effective combination of LSD1 (KDM1A) antagonist and pan-histone deacetylase inhibitor against human AML cells Leukemia 2014 28 2155 64 24699304 10.1038/leu.2014.119 PMC4739780 103 Rose NR Woon EC Tumber A Walport LJ Chowdhury R Li XS Plant growth regulator daminozide is a selective inhibitor of human KDM2/7 histone demethylases J Med Chem 2012 55 6639 43 22724510 10.1021/jm300677j PMC4673902 104 Tan Y Tajik A Chen J Jia Q Chowdhury F Wang L Matrix softness regulates plasticity of tumour-repopulating cells via H3K9 demethylation and Sox2 expression Nat Commun 2014 5 4619 25099074 10.1038/ncomms5619 PMC4133791 ",
  "metadata": {
    "Title of this paper": "Matrix softness regulates plasticity of tumour-repopulating cells via H3K9 demethylation and Sox2 expression",
    "Journal it was published in:": "Journal of Family Medicine and Primary Care",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12488171/"
  }
}