{
  "title": "Paper_1035",
  "abstract": "pmc Microorganisms Microorganisms 3054 microorg microorganisms Microorganisms 2076-2607 Multidisciplinary Digital Publishing Institute  (MDPI) PMC12472043 PMC12472043.1 12472043 12472043 41011367 10.3390/microorganisms13092036 microorganisms-13-02036 1 Review Natural Control of Food-Borne Pathogens Using Chitosan https://orcid.org/0000-0003-3344-5308 Kiskó Gabriella Vitiello Mariateresa Academic Editor Bevilacqua Antonio Academic Editor Department of Food Microbiology, Hygiene and Safety, Institute of Food Science and Technology, Hungarian University of Agriculture and Life Sciences, Somlói ut 14-16, H-1118 Budapest, Hungary; kisko.gabriella@uni-mate.hu 31 8 2025 9 2025 13 9 496716 2036 16 7 2025 20 8 2025 28 8 2025 31 08 2025 27 09 2025 29 09 2025 © 2025 by the author. 2025 https://creativecommons.org/licenses/by/4.0/ Licensee MDPI, Basel, Switzerland. This article is an open access article distributed under the terms and conditions of the Creative Commons Attribution (CC BY) license ( https://creativecommons.org/licenses/by/4.0/ The control of micro-organisms in food has a long history. They can be controlled by many different safe methods, including the use of conventional preservatives. In addition, consumers are increasingly distrustful of food processing techniques and the use of preservatives. Therefore, there is a renewed interest and increasing consumer demand for more natural, non-synthesised antimicrobials as potential alternatives to conventional preservatives to control foodborne pathogens and extend the shelf life of foods. Therefore, this review focuses on the application of chitosan as an antimicrobial of animal origin to control major foodborne pathogenic organisms, such as E. coli Listeria monocytogenes Salmonella Staphylococcus aureus chitosan Listeria monocytogenes Salmonella Staphylococcus aureus E. coli This research received no external funding. pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement no pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes 1. Introduction The issue of foodborne illnesses represents a significant concern for consumers, the food industry, and food safety authorities as well. It has been reported that the majority of foodborne illness outbreaks are caused by known pathogens, including but not limited to Norovirus, Campylobacter Salmonella Listeria monocytogenes Escherichia coli Staphylococcus aureus Clostridium Bacillus cereus 1 The EU One Health zoonoses report [ 2 Salmonella Escherichia coli E. coli Listeria monocytogenes Salmonella L. monocytogenes Clostridium botulinum Staphylococcus aureus Non-typhoidal Salmonella 3 4 5 Listeria monocytogenes Salmonella Staphylococcus aureus 3 In both the European Union and the U.S., Salmonella Escherichia coli Listeria monocytogenes 4 The recent focus on discovering natural antimicrobial agents that can prevent the growth of microorganisms has gained considerable interest. The aim of this inquiry is to explore the potential of such agents to enhance food safety and to increase the quality of food products and extend their shelf life. The use of natural antimicrobials as a safer and more sustainable alternative to synthetic ones is being explored [ 6 7 Natural antimicrobials can be found in plants (e.g., essential oils, extracts), animals (e.g., enzymes, peptides), and microorganisms (e.g., bacteriocins). These antimicrobials can inhibit or kill microorganisms such as bacteria, fungi, and viruses, including food-borne pathogenic bacteria [ 8 9 10 11 12 13 Chitosan is a natural, biodegradable, cationic polysaccharide obtained by the partial deacetylation of chitin, which is primarily sourced from shellfish exoskeletons and, more recently, insects [ 14 15 Staphylococcus aureus Listeria monocytogenes Escherichia coli Salmonella Pseudomonas aeruginosa Proteus mirabilis Sarcina Enterococcus faecalis Vibrio cholerae Shigella dysenteriae 16 17 18 19 20 21 22 23 24 Listeria monocytogenes Bacillus megaterium Bacillus cereus Staphylococcus aureus Lactiplantibacillus plantarum Levilactobacillus brevis Escherichia coli Pseudomonas fluorescens Salmonella Vibrio parahaemolyticus 25 26 27 28 29 30 31 32 33 Besides antimicrobial action, chitosan exhibits several biological activities including anti-inflammatory, immune-modulating, anti-allergic, anti-hypertensive, antidiabetic, hypolipidemic and hypocholesterolemic, as well as anticoagulant, antioxidative, neuroprotective and wound-healing effects [ 34 35 36 37 38 Chitosan is widely used due to its biocompatibility, abundance, and non-toxic nature. It is frequently used in food industry, for example, as an edible antimicrobial coating, to extend shelf life of various foods such as fish, meat, and cheese [ 39 40 41 42 43 44 45 46 47 48 49 50 This article aimed to review the potential food applications of chitosan, an antimicrobial agent of animal origin, in enhancing the shelf life and safety of food. The focus was on the control of four major foodborne pathogenic bacteria, namely Listeria monocytogenes Staphylococcus aureus E. coli Salmonella 2. General Properties of Chitosan The term “chitosan” refers to a diverse group of structurally different chemical entities [ 51 52 53 54 55 56 57 58 58 59 60 61 Chitosan is positively charged in acidic environments, which enhances its solubility and antimicrobial activity [ 58 62 63 It is applied in many fields including agriculture [ 64 65 66 67 68 69 70 71 26 72 73 74 72 75 76 62 77 78 79 80 81 82 43 83 84 74 85 86 87 88 89 90 91 92 93 94 95 96 97 98 99 The functionality of chitosan can be further enhanced through a range of chemical modifications (e.g., quaternization, carboxymethylation, alkylation, copolymerization, cross-linking, and hydrolysis) and nanotechnology as well as through combinations with various natural additives, such as essential oils and plant extracts, as reviewed by Yu et al. [ 100 73 73 100 101 102 The utilisation of chitosan in various fields also offers environmental and safety benefits. As a natural product delivered from crustacean waste, fungi, and insects, chitosan has been shown to support resource recycling and sustainability [ 103 104 105 106 3. Antimicrobial Mechanism of Chitosan The most widely accepted theory of the primary antimicrobial mechanism of chitosan, is that its positively charged amino groups of chitosan bind to negatively charged bacterial membrane, disrupting membrane integrity, forming pores, and causing cell leakage and death [ 107 108 109 110 111 112 Further antimicrobial actions of chitosan on bacterial cells include disruption of membranes, inhibition of nutrient transport, chelation of metal ions, and reduction in aerobic bacteria via an oxygen barrier [ 46 112 113 114 105 27 108 108 Interaction sites between chitosan and Gram-negative bacteria are associated with electrostatic interactions involving the negative charges of lipopolysaccharide LPS [ 108 108 Salmonella S. 10 108 115 108 The antibacterial efficacy of chitosan is influenced by its origin and its physicochemical properties, as Nasaj et al. [ 116 58 61 83 117 116 111 112 3.1. Antimicrobial Activity of Chitosan Against Listeria monocytogenes in Foods Chitosan exhibits multiple mechanisms of action against Listeria monocytogenes 3.1.1. Mechanisms of Antimicrobial Activity of Chitosan Against Listeria monocytogenes The identified key mechanisms of the antimicrobial action of chitosan against Listeria monocytogenes Figure 1 Cell membrane disruption: Chitosan has been demonstrated to disrupt the cell membrane of L. monocytogenes 118 119 120 Inhibition of metabolic pathways: It has been observed that combining chitosan with chrysanthemum essential oil, can inhibit key metabolic pathways, such as the Embden–Meyerhof–Parnas (EMP) pathway in L. monocytogenes 121 3.1.2. Factors Affecting the Antimicrobial Activity of Chitosan Against Listeria monocytogenes Several factors affecting the antimicrobial effect of chitosan against Listeria monocytogenes Molecular weight (MW): As demonstrated by Benabbou et al. [ 118 L. monocytogenes 122 L. monocytogenes 118 Temperature [ 123 L. monocytogenes 124 Concentration: Higher concentrations of chitosan generally result in increased antimicrobial effectiveness [ 124 122 pH levels: The antimicrobial activity of chitosan is pH-dependent, showing higher effectiveness at lower pH levels (e.g., pH 4.5) [ 118 125 L. monocytogenes 117 124 126 Formulation and application: Chitosan films and coatings have been used to inhibit L. monocytogenes 26 127 128 129 130 131 132 133 134 Combination with other antimicrobials: Combining chitosan with other antimicrobial agents, such as organic acids, has been proven to enhance its effectiveness. For instance, the combination of chitosan and acetic acid significantly reduced the level of L. monocytogenes 135 118 L. monocytogenes L. monocytogenes 118 121 136 Biofilm inhibition: The study of Orgaz et al. [ 137 L. monocytogenes 120 Controlled release of antibacterials: The application of chitosan coatings and films has been found to facilitate the controlled release of antimicrobial agents, thereby ensuring their stability and prolonging their antibacterial activity over time. This is a particularly useful application in the field of food packaging, with the purpose of extending shelf life and ensuring food safety [ 119 121 138 L. monocytogenes 138 L. monocytogenes 139 3.1.3. Antimicrobial Activity of Chitosan Against Listeria monocytogenes Chitosan has demonstrated significant antimicrobial properties against Listeria monocytogenes 124 129 130 140 141 142 143 144 L. monocytogenes 145 L. monocytogenes 10 129 L. monocytogenes 146 L. monocytogenes 130 Chitosan can also be used effectively in dairy products. Chitosan-coated nisin-silica liposomes have demonstrated sustained antibacterial activity against L. monocytogenes 136 147 L. monocytogenes Table 1 In summary, it can be concluded that chitosan exhibits remarkable antimicrobial properties against L. monocytogenes 160 L. monocytogenes L. monocytogenes L. monocytogenes Listeria monocytogenes L. monocytogenes 154 L. monocytogenes 156 3.2. Antimicrobial Activity of Chitosan Against Staphylococcus aureus in Foods Chitosan exhibits significant antimicrobial activity against Staphylococcus aureus 3.2.1. Mechanisms of Antimicrobial Activity of Chitosan Against Staphylococcus aureus The mechanisms by which chitosan inhibits the growth of S. aureus Figure 2 Cell wall and membrane disruption: Chitosan interacts with and disrupts the bacterial cell wall and cytoplasmic membrane of S. aureus 161 162 Stimulation of autolysins: Chitosan can stimulate the degradation of bacterial cell walls by promoting the activity of bacterial autolysins in S. aureus 163 Change in metabolism: Chitosan can disrupt the normal metabolism of S. aureus 164 Enzyme activity disruption: Chitosan-grafted derivatives can disrupt the normal metabolism of S. aureus 164 Reduction in surface charge: Chitosan interacts with the anionic cell wall of S. aureus S. aureus 165 Inhibition of DNA synthesis: Chitosan derivatives can penetrate bacterial cells through damaged membranes and inhibit DNA synthesis in S. aureus 166 Protonation of amino groups: The antibacterial action of chitosan-based nanofibers (CNFs) is attributed to the protonation of their amino groups. This protonation enhances the bactericidal activity of chitosan, making it effective against various strains, including S. aureus 167 3.2.2. Factors Affecting the Antimicrobial Activity of Chitosan Against Staphylococcus aureus The following factors have been demonstrated to influence the antimicrobial effect of chitosan against S. aureus Biofilm inhibition: Chitosan also interferes with biofilm formation, making it effective against S. aureus 164 168 S. aureus 137 164 168 Molecular weight: The antibacterial effect of chitosan on S. aureus S. aureus 169 S. aureus 122 S. aureus 170 Concentration: Zheng and Zhu [ 170 S. aureus S. aureus S. aureus 171 126 S. aureus Presence of food components: The presence of certain food components can affect the antibacterial activity of chitosan on S. aureus 172 Temperature and ionic strength: Higher temperatures and an appropriate ionic strength promote the antibacterial activity of chitosan against S. aureus 126 173 Combination with other antimicrobials: Chitosan films, especially when combined with other bioactive compounds like nisin or garlic oil, show enhanced activity against S. aureus 174 175 S. aureus 176 177 178 3.2.3. Antimicrobial Activity of Chitosan Against Staphylococcus aureus Chitosan can be used as a natural food preservative in various forms, including solutions, films, and coatings, to extend the shelf life of food products by inhibiting the growth of S. aureus 33 171 175 178 S. aureus 175 S. aureus S. aureus 173 S. aureus 179 S. aureus S. aureus 180 S. aureus 181 Table 2 In summary, chitosan demonstrates significant antimicrobial activity against S. aureus S. aureus 3.3. Antimicrobial Activity of Chitosan Against Escherichia coli O157:H7 in Foods Chitosan exhibited significant antimicrobial activity against E. coli 3.3.1. Mechanisms of Antimicrobial Activity of Chitosan Against E. coli The key mechanisms of the antimicrobial action of chitosan against E. coli Figure 3 Cell membrane disruption: Chitosan disrupts the integrity of the bacterial cell membrane of E. coli 186 187 186 E. coli 187 E. coli Modification of chitosan changes in metabolic activity: A novel water-soluble chitosan derivative, arginine-functionalized chitosan, showed dose-dependent inhibition of E. coli 188 E. coli 189 3.3.2. Factors Affecting the Antimicrobial Activity of Chitosan Against E. coli The factors affecting the antimicrobial effect of chitosan against E. coli pH level: The effectiveness of chitosan against E. coli 117 Temperature: The antimicrobial activity of chitosan is influenced by the temperature, with higher activity observed at refrigeration temperatures [ 117 Concentration: The antibacterial activity of chitosan is dose-dependent and increases with its concentration. For instance, chitosan concentrations of 0.1% and 0.7% of chitosan were effective against E. coli 74 190 Molecular weight: The molecular weight of chitosan plays an important role in its antimicrobial activity. Seo et al. [ 122 E. coli Combination with other antimicrobials: Combining chitosan with other antimicrobial agents, such as the extracellular metabolites of Pediococcus pentosaceus E. coli 190 191 E. coli 192 193 194 192 E. coli 193 E. coli 194 3.3.3. Antimicrobial Activity of Chitosan Against E. coli Chitosan has demonstrated antimicrobial activity against E. coli 188 190 195 E. coli E. coli 195 Pediococcus pentosaceus E. coli 190 E. coli 189 w v E. coli 191 Chitosan-based films and edible coatings can be used in food packaging to maintain product shelf life and freshness, enhance the microbial foods safety by minimising the risk of E. coli 188 E. coli 196 193 E. coli 197 Table 3 E. coli 189 190 192 74 E. coli E. coli In summary, chitosan exhibits good antimicrobial properties against E. coli 3.4. Antimicrobial Activity of Chitosan Against Salmonella in Foods A mechanism of the antimicrobial effect of chitosan against Salmonella 3.4.1. Mechanism of Antimicrobial Activity of Chitosan Against Salmonella The identified mechanism of the antimicrobial activity of chitosan against Salmonella Figure 4 Salmonella 167 3.4.2. Factors Affecting the Antimicrobial Activity of Chitosan Against Salmonella Numerous factors can influence the effectiveness of the activity of chitosan against Salmonella Deacetylation degree and molecular weight: The degree of deacetylation of chitosan influences its effectiveness, with lower acetylation and higher molecular weight chitosan showing better antibacterial activity [ 203 Form of chitosan: The antibacterial activity of chitosan is also enhanced when it is in the form of nanofibers or nanoparticles, which show high efficacy compared to other physical forms. This is likely due to the increased surface area and better interaction with bacterial cells [ 126 204 Source of chitosan: The findings of Ibañez-Peinado et al. [ 117 Salmonella Effect of food components: The presence of certain food components can affect the antimicrobial activity of chitosan. While NaCl and sucrose can slightly decrease its inhibitory activity, the addition of acids such as acetic, lactic, and citric acid can enhance the effectiveness of chitosan against bacterial growth, including Salmonella 172 Temperature: The antimicrobial activity of chitosan decreased at higher storage temperatures. It reduced the growth of Salmonella 205 Antibiofilm activity: Chitosan can inhibit biofilm formation, which is crucial for preventing bacterial colonisation and persistence in food products. Studies have shown that chitosan combined with medicinal leaf extracts of Mentha piperita Plectranthus amboinicus Salmonella 206 Salmonella Combination with other antimicrobials: Combining chitosan with other antimicrobial agents such as nisin, allylisothiocyanate, and essential oils can enhance its effectiveness against Salmonella 175 207 208 Salmonella 209 Carnobacterium maltaromaticum Salmonella 207 3.4.3. Antimicrobial Activity of Chitosan Against Salmonella Many applications of chitosan in food packaging proved to be effective against Salmonella Salmonella 210 Carnobacterium 10 2 S. enterica 207 S. enterica 10 192 S. enteritidis 10 211 10 212 S. S 10 10 158 Salmonella Salmonella 208 213 10 74 S. 214 w w Salmonella 10 10 10 Salmonella 215 10 Salmonella 216 Table 4 In conclusion, chitosan demonstrates promising antimicrobial effects against Salmonella Salmonella 4. Benefits Associated with the Application of Chitosan The use of chitosan in food products presents numerous benefits, making it a valuable tool in food preservation and safety. It has been shown to have a broad antimicrobial spectrum, being highly susceptible to a wide variety of pathogenic and spoilage microorganisms, including fungi, Gram-positive and Gram-negative bacteria, making it a versatile antimicrobial agent [ 217 The versatile applicability of chitosan (which can be used in a variety of structures, including films, coatings and nanoparticles) enables its flexible application in preservation of foodstuffs [ 26 218 Chitosan can enhance the effectiveness of other preservatives when used in combination. Its antimicrobial activity can be synergistically increased when combined with a variety of other substances, including but not limited to, organic acids, essential oils, bacteriocins, plant extracts, graphene, titanium dioxide, and zinc oxide. This provides a more robust preservation strategy which is effective not only against Listeria monocytogenes Staphylococcus aureus E. coli Salmonella 219 220 221 222 223 The non-toxic and biodegradable nature of chitosan renders it an environmentally friendly alternative to synthetic preservatives, thus appealing to consumers seeking clean-label products. Chitosan has been extensively investigated for its potential use in the production of new edible films and multifunctional formulations for various food applications, making it a promising substitute for synthetic plastic polymers [ 224 26 143 218 When utilising chitosan as a coating, it is necessary to consider its impact on the sensory characteristics of food products. Some research showed that the application of chitosan-coated nisin–silica liposomes did not result in any alteration of the sensory properties of cheese, indicating potential for use in food preservation without compromising quality [ 136 225 226 Chitosan has been demonstrated to have a number of health benefits, including the capacity to reduce cholesterol levels and the potential to exhibit anti-inflammatory properties. The incorporation of chitosan into food products has the potential to enhance not only safety but also the overall health benefits of the food [ 38 227 Whilst it is essential to consider the primary production costs associated with the production of chitosan, its ability to extend shelf life and reduce spoilage can lead to overall cost savings in food production and distribution. 5. Challenges Associated with the Application of Chitosan Despite the numerous advantages attributed to chitosan, weaknesses have also been identified. There are still challenges and research gaps regarding the antimicrobial action of chitosan. The exact mechanism remains only partially understood. More targeted research is needed to optimise the performance of chitosan and to understand its full antimicrobial spectrum. In food preservation, chitosan may negatively affect taste and texture when used in higher concentrations [ 146 149 228 229 111 112 Although chitosan is widely considered to have low potential to induce resistance, prolonged use could still lead to the development of resistant strains of pathogenic, spoilage, or even useful bacteria, such as starter cultures. These non-pathogenic bacteria then have the potential to transfer the resistance genes to pathogenic bacteria via horizontal gene transfer. Research reports have demonstrated the presence of chitosan-resistant Staphylococcus aureus 46 230 The antimicrobial activity of chitosan is influenced by a variety of factors including its molecular weight and degree of deacetylation [ 123 58 231 100 232 233 234 235 Furthermore, the combination of chitosan with other materials, such as gelatine, has been demonstrated to enhance its performance; however, these composites frequently still lack the water resistance and mechanical strength found in synthetic plastics [ 236 237 238 239 240 241 Compliance with labelling regulations for food packaging materials that contain antimicrobial agents is necessary. It is imperative that products are clearly and accurately labelled to inform consumers of the presence of chitosan and its intended benefits. Chitosan films containing specific antimicrobial compositions achieved significant reductions in pathogenic bacteria including Listeria monocytogenes Staphylococcus aureus E. coli Salmonella Chitosan is composed of a variety of structurally diverse chemical entities, each of which may have distinct biodistribution, biodegradation, and toxicological profiles [ 51 138 242 243 It is also essential to define the optimal concentration and release rate of chitosan in packaging materials to ensure the effective preservation of its antimicrobial properties against foodborne pathogens throughout the shelf life of the product. Furthermore, the stability of chitosan in food products must be considered, as it may degrade over time or lose its antimicrobial properties due to environmental factors such as temperature and moisture [ 244 245 246 247 Consumer acceptance can also affect the applicability of chitosan packaging. It is noteworthy that while chitosan is a natural biopolymer, consumer acceptance of chitosan-based packaging may vary. The appearance and texture of chitosan-based packaging may differ from traditional packaging materials, which may have a negative effect on consumer preferences. It is important to ensure that the packaging is visually attractive and does not affect the sensory qualities of the food. Therefore, it is essential to educate consumers about the benefits and safety of chitosan as an antimicrobial agent to encourage its widespread adoption. In addition to the aforementioned challenges, it has been demonstrated that the production of chitosan-based packaging materials may be more expensive than conventional packaging options. Balancing the cost of production with the benefits of enhanced food safety is a challenge for manufacturers. 6. Research Directions Recent research trends have placed significant emphasis on the in vivo antimicrobial activity of chitosan and its derivatives, such as carboxymethyl chitosan and N,N,N-trimethyl chitosan, as well as on the antimicrobial activity of their micro- and nanoparticle forms. In addition to increasing food safety, they enhance plant protection, the effectiveness of animal diseases treatments and wound healing applications [ 114 248 249 141 250 251 252 249 Future research directions for the utilisation of chitosan as a natural antimicrobial agent within the food industry could concentrate on the further development of chitosan-based nanosystems and their applications to enhance antimicrobial potential. Molecularly engineered nanomaterials, such as acid-transforming chitosan and chitosan with fragment DNA polyplexes, have demonstrated their potential as effective and safe antimicrobial agents against Salmonella 253 Other areas for research could include the development of chitosan derivatives and conjugates with novel polymers and nanoparticles, which exhibit superior antimicrobial properties. Another research direction could involve the development of new types of films, such as chitosan–gelatine-based films with a mixture of chitosan and gelatine, or further biodegradable chitosan–starch films. The combination of these films with varying concentrations of natural antimicrobials holds promise for their utilisation as temperature-sensitive active packaging films [ 220 254 255 243 256 257 258 7. Conclusions Chitosan is a natural, non-toxic, biodegradable, commercially available biopolymer with notable bioactivity, including antimicrobial and antioxidant properties, and biodegradability. It, therefore, has considerable potential in enhancing the quality and safety of food products. Research has shown that the natural origin of this “green” biopolymer aligns well with current trends towards healthier and more sustainable food options. The versatility of chitosan comes from its modifiability, which has attracted attention in the food industry. It can be used as a natural preservative or as edible packaging with antimicrobial properties. As a future alternative to non-biodegradable plastics, it improves food quality and safety. This review article discusses and summarises the current state of research on the application of chitosan in food preservation, with a particular focus on its use against four major food pathogens— Listeria monocytogenes Staphylococcus aureus Salmonella Escherichia coli The mechanism of antibacterial action of chitosan involves membrane integrity loss, enzyme inhibition, and several other mechanisms. Together, these ensure the effectiveness of chitosan as a biopreservative agent against pathogenic bacteria in food. Understanding the effects of these factors is essential for optimising chitosan use in food preservation. As demonstrated in this review article, chitosan and its derivatives show bactericidal activity against Listeria monocytogenes Staphylococcus aureus Salmonella Escherichia coli Significant advances have clarified the benefits of chitosan for food safety and preservation, but there are still practical challenges and research gaps. Further studies are essential to achieve a comprehensive understanding of food preservation by chitosan. In the future, it is necessary to investigate and fully understand the processes behind its antibacterial activity, and methods to maximise its antimicrobial efficacy. It is important to note that food components significantly influence the antimicrobial activity of chitosan. Therefore, it is essential to examine product matrix effects, suitable concentrations/combinations for food use and investigate the optimal conditions for maximal antimicrobial activity. Furthermore, emphasis should be placed on monitoring and preventing the possible development of resistance to chitosan during its widespread use as an antimicrobial agent, because bacteria may gradually adapt to its antimicrobial mechanism. Disclaimer/Publisher’s Note: Institutional Review Board Statement Not applicable. Informed Consent Statement Not applicable. Data Availability Statement No new data were created or analysed in this study. Conflicts of Interest The author declares no conflicts of interest. References 1. Gourama H. Foodborne Pathogens Food Safety Engineering 1st ed. Demirci A. Feng H. Krishnamurthy K. Food Engineering Series Springer Cham, Switzerland 2020 25 49 10.1007/978-3-030-42660-6_2 2. European Food Safety Authority (EFSA) European Centre for Disease Prevention and Control (ECDC) The European Union One Health 2023 Zoonoses report EFSA J. 2024 22 e9106 10.2903/j.efsa.2024.9106 39659847 PMC11629028 3. Scallan E. Hoekstra R.M. Angulo F.J. Scallan E. Hoekstra R.M. Angulo F.J. Tauxe R.V. Widdowson M.A. Roy S.L. Jones J.L. Foodborne Illness Acquired in the United States—Major Pathogens Emerg. Infect. Dis. 2011 17 7 15 10.3201/eid1701.P11101 21192848 PMC3375761 4. Adley C.C. Ryan M.P. The Nature and Extent of Foodborne Disease Antimicrobial Food Packaging Barros-Velázquez J. Academic Press Cambridge, MA, USA 2016 1 10 10.1016/B978-0-12-800723-5.00001-2 5. World Health Organization WHO Bacterial Priority Pathogens List 2024: Bacterial Pathogens of Public Health Importance, to Guide Research, Development, and Strategies to Prevent and Control Antimicrobial Resistance World Health Organization Geneva, Switzerland 2024 6. Pisoschi A.M. Pop A. Georgescu C. Turcuş V. Olah N.K. Mathe E. An overview of natural antimicrobials role in food Eur. J. Med. Chem. 2018 143 922 935 10.1016/j.ejmech.2017.11.095 29227932 7. Gyawali R. Ibrahim S.A. Natural products as antimicrobial agents Food Control 2014 46 412 429 10.1016/j.foodcont.2014.05.047 8. Barbosa L.N. Rall V.L.M. Fernandes A.A.H. Ushimaru P.I. da Silva Probst I. Fernandes A. Jr. Essential oils against foodborne pathogens and spoilage bacteria in minced meat Foodborne Pathog. Dis. 2009 6 725 728 10.1089/fpd.2009.0282 19580445 PMC3145167 9. Andrade B.F.M.T. Barbosa L.N. da Silva Probst I. Fernandes A.J. Antimicrobial activity of essential oils J. Essent. Oil Res. 2014 26 34 40 10.1080/10412905.2013.860409 10. Anacarso I. Messi P. Condò C. Iseppi R. Bondi M. Sabia C. de Niederhäusern S. A bacteriocin-like substance produced from Lactobacillus pentosus 39 is a natural antagonist for the control of Aeromonas hydrophila and Listeria monocytogenes in fresh salmon fillets LWT Food Sci. Technol. 2014 55 604 611 10.1016/j.lwt.2013.10.012 11. Engelhardt T. Albano H. Kiskó G. Mohácsi-Farkas C. Teixeira P. Antilisterial activity of bacteriocinogenic Pediococcus acidilactici HA6111-2 and Lactobacillus plantarum ESB 202 grown under pH and osmotic stress conditions Food Microbiol. 2015 48 109 115 10.1016/j.fm.2014.11.015 25790998 12. Iseppi R. Sabia C. de Niederhäusern S. Pellati F. Benvenuti S. Tardugno R. Bondi M. Messi P. Antibacterial activity of Rosmarinus officinalis L. and Thymus vulgaris L. essential oils and their combination against food-borne pathogens and spoilage bacteria in ready-to-eat vegetables Nat. Prod. Res. 2019 33 3568 3572 10.1080/14786419.2018.1482894 29874951 13. Gokoglu N. Novel natural food preservatives and applications in seafood preservation: A review J. Sci. Food Agric. 2019 99 2068 2077 10.1002/jsfa.9416 30318589 14. Kumar S. Mukherjee A. Dutta J. Chitosan based nanocomposite films and coatings: Emerging antimicrobial food packaging alternatives Trends Food Sci. Technol. 2020 97 196 209 10.1016/j.tifs.2020.01.002 15. Iber B.T. Kasan N.A. Torsabo D. Omuwa J.W. A review of various sources of chitin and chitosan in nature J. Renew. Mater. 2022 10 1097 10.32604/jrm.2022.018142 16. Boudouaia N. Benine M.L. Fettal N. Abbouni B. Bengharez Z. Antibacterial Action of Chitosan Produced from Shrimp Waste Against the Growth of Escherichia coli, Staphylococcus epidermidis, Proteus mirabilis and Pseudomonas aeruginosa Waste Biomass Valorization 2024 15 1267 1279 10.1007/s12649-023-02220-6 17. Roller S. Covill N. The antifungal properties of chitosan in laboratory media and apple juice Int. J. Food Microbiol. 1999 47 67 77 10.1016/S0168-1605(99)00006-9 10357275 18. Zhong Z. Xing R. Liu S. Wang L. Cai S. Li P. Synthesis of acyl thiourea derivatives of chitosan and their antimicrobial activities in vitro Carbohydr. Res. 2008 343 566 570 10.1016/j.carres.2007.11.024 18083151 19. Cakici F. Cakici E.B. Antimicrobial efficacy of chitosan versus sodium hypochlorite: A systematic review and meta-analysis Oral Dis. 2024 30 5445 5460 10.1111/odi.15099 39119693 PMC11610686 20. Benhabiles M.S. Salah R. Lounici H. Drouiche N. Goosen M.F.A. Mameri N. Antibacterial Activity of Chitin, Chitosan and Its Oligomers Prepared from Shrimp Shell Waste Food Hydrocoll. 2012 29 48 56 10.1016/j.foodhyd.2012.02.013 21. Verlee A. Mincke S. Stevens C.V. Recent Developments in Antibacterial and Antifungal Chitosan and Its Derivatives Carbohydr. Polym. 2017 164 268 283 10.1016/j.carbpol.2017.02.001 28325326 22. de Azevedo M.I.G. Souza P.F.N. Monteiro Júnior J.E. Grangeiro T.B. Chitosan and Chitooligosaccharides: Antifungal Potential and Structural Insights Chem. Biodiver. 2024 21 e202400044 10.1002/cbdv.202400044 38591818 23. Poznanski P. Hameed A. Orczyk W. Chitosan and Chitosan Nanoparticles: Parameters Enhancing Antifungal Activity Molecules 2023 28 2996 10.3390/molecules28072996 37049759 PMC10095919 24. Rhoades J. Roller S. Antimicrobial actions of degraded and native chitosan against spoilage organisms in laboratory media and foods Appl. Environ. Microbiol. 2000 66 80 86 10.1128/AEM.66.1.80-86.2000 10618206 PMC91788 25. Coma V. Deschamps A. Martial-Gros A. Bioactive Packaging Materials from Edible Chitosan Polymer—Antimicrobial Activity Assessment on Dairy-Related Contaminants Bioactive packaging materials from edible chitosan polymer—Antimicrobial activity assessment on dairy-related contaminants J. Food Sci. 2003 68 2788 2792 10.1111/j.1365-2621.2003.tb05806.x 26. Dutta P.K. Tripathi S. Mehrotra G.K. Dutta J. Perspectives for chitosan based antimicrobial films in food applications Food Chem. 2009 114 1173 1182 10.1016/j.foodchem.2008.11.047 27. Jeon Y.-J. Park P.-J. Kim S.-K. Antimicrobial effect of chitooligosaccharides produced by bioreactor Carbohyd. Polym. 2001 44 71 76 10.1016/S0144-8617(00)00200-9 28. No H.K. Park N.Y. Lee S.H. Meyers S.P. Antibacterial activity of chitosans and chitosan oligomers with different molecular weights Int. J. Food Microbiol. 2002 74 65 72 10.1016/S0168-1605(01)00717-6 11929171 29. Chung Y.C. Su Y.P. Chen C.C. Jia G. Wang H.L. Wu J.G. Lin J.G. Relationship between antibacterial activity of chitosan and surface characteristics of cell wall Acta Pharmacol. Sin. 2004 25 932 936 15210068 30. Chen Y.M. Chung Y.C. Woan Wang L. Chen K.T. Li S.Y. Antibacterial properties of chitosan in waterborne pathogen J. Environ. Sci. Health Part A 2002 37 1379 1390 10.1081/ESE-120005993 15328699 31. Eldin M.S.M. Soliman E.A. Hashem A.I. Tamer T.M. Antibacterial activity of chitosan chemically modified with new technique Trends Biomater. Artif. Organs. 2008 22 121 133 32. Simunek J. Tishchenko G. Hodrová B. Bartonová H. Effect of chitosan on the growth of human colonic bacteria Folia Mocrobiol. 2006 51 306 308 10.1007/BF02931820 17007432 33. Fernandez-Saiz P. Soler C. Lagaron J.M. Ocio M.J. Effects of chitosan films on the growth of Listeria monocytogenes, Staphylococcus aureus and Salmonella Int. J. Food Microbiol. 2010 137 287 294 10.1016/j.ijfoodmicro.2009.11.016 20022649 34. Ngo D.-H. Vo T.-S. Ngo D.-N. Kang K.-H. Je J.-Y. Pham H.N.-D. Byun H.-G. Kim S.-K. Biological effects of chitosan and its derivatives Food Hydrocoll. 2015 51 200 216 10.1016/j.foodhyd.2015.05.023 35. Riaz Rajoka M.S. Zhao L. Mehwish H.M. Wu Y. Mahmood S. Chitosan and its derivatives: Synthesis, biotechnological applications, and future challenges Appl. Microbiol. Biotechnol. 2019 103 1557 1571 10.1007/s00253-018-9550-z 30607489 36. Morin-Crini N. Lichtfouse E. Torri G. Crini G. Applications of chitosan in food, pharmaceuticals, medicine, cosmetics, agriculture, textiles, pulp and paper, biotechnology, and environmental chemistry Environ. Chem. Lett. 2019 17 1667 1692 10.1007/s10311-019-00904-x 37. Tzeng H.P. Liu S.H. Chiang M.T. Antidiabetic properties of chitosan and its derivatives Mar. Drugs 2022 20 784 10.3390/md20120784 36547931 PMC9782916 38. Wijesekara T. Xu B. New Insights into Sources, Bioavailability, Health-Promoting Effects, and Applications of Chitin and Chitosan J. Agric. Food Chem. 2024 72 17138 17152 10.1021/acs.jafc.4c02162 39042786 39. Darmadji P. Izumimoto M. Effect of chitosan in meat preservation Meat Sci. 1994 38 243 254 10.1016/0309-1740(94)90114-7 22059662 40. Tsai G.U.O. Su W.H. Chen H.C. Pan C.L. Antimicrobial activity of shrimp chitin and chitosan from different treatments Fish. Sci. 2002 68 170 177 10.1046/j.1444-2906.2002.00404.x 41. Altieri C. Scrocco C. Sinigaglia M. Del Nobile M.A. Use of chitosan to prolong mozzarella cheese shelf life J. Dairy Sci. 2005 88 2683 2688 10.3168/jds.S0022-0302(05)72946-5 16027180 42. Kanatt S.R. Chander R. Sharma A. Chitosan and mint mixture: A new preservative for meat and meat products Food Chem. 2008 107 845 852 10.1016/j.foodchem.2007.08.088 43. Tayel A.A. Microbial chitosan as a biopreservative for fish sausages Int. J. Biol. Macromol. 2016 93 41 46 10.1016/j.ijbiomac.2016.08.061 27565293 44. El-Dahma M. Khattab A. Gouda E. El-Saadany K. Ragab W. The antimicrobial activity of chitosan and its application on Kariesh cheese shelf life Alexandria Sci. Exch. J. 2017 38 733 745 10.21608/asejaiqjsae.2017.4183 45. Kramchote S. Suwor P. Preharvest chitosan effects on growth, yield and quality of ‘Super Hot’and ‘Num Khao’ chili pepper ( Capsicum annuum Hortic. J. 2022 91 522 530 10.2503/hortj.UTD-360 46. Matica M.A. Aachmann F.L. Tøndervik A. Sletta H. Ostafe V. Chitosan as a wound dressing starting material: Antimicrobial properties and mode of action Int. J. Mol. Sci. 2019 20 5889 10.3390/ijms20235889 31771245 PMC6928789 47. Bernkop-Schnürch A. Dünnhaupt S. Chitosan-based drug delivery systems Eur. J. Pharm. Biopharm. 2012 81 463 469 10.1016/j.ejpb.2012.04.007 22561955 48. Li X. Xing R. Xu C. Liu S. Qin Y. Li K. Yu H. Li P. Immunostimulatory effect of chitosan and quaternary chitosan: A review of potential vaccine adjuvants Carbohydr. Polym. 2021 264 118050 10.1016/j.carbpol.2021.118050 33910752 49. Chan K. Morikawa K. Shibata N. Zinchenko A. Adsorptive removal of heavy metal ions, organic dyes, and pharmaceuticals by DNA–chitosan hydrogels Gels 2021 7 112 10.3390/gels7030112 34449623 PMC8395854 50. Bhatt P. Joshi S. Bayram G.M.U. Khati P. Simsek H. Developments and application of chitosan-based adsorbents for wastewater treatments Environ. Res. 2023 226 115530 10.1016/j.envres.2023.115530 36863653 51. Kean T. Thanou M. Biodegradation, biodistribution and toxicity of chitosan Adv. Drug Deliv. Rev. 2010 62 3 11 10.1016/j.addr.2009.09.004 19800377 52. Liu M. Zhou Y. Zhang Y. Yu C. Cao S. Physicochemical, mechanical and thermal properties of chitosan films with and without sorbitol Int. J. Biol. Macromol. 2014 70 340 346 10.1016/j.ijbiomac.2014.06.039 24984024 53. Hosseinnejad M. Jafari S.M. Evaluation of different factors affecting antimicrobial properties of chitosan Int. J. Biol. Macromol. 2016 85 467 475 10.1016/j.ijbiomac.2016.01.022 26780706 54. Hamed I. Özogul F. Regenstein J.M. Industrial applications of crustacean by-products (chitin, chitosan, and chitooligosaccharides): A review Trends Food Sci. Technol. 2016 48 40 50 10.1016/j.tifs.2015.11.007 55. Ul-Islam M. Alabbosh K.F. Manan S. Khan S. Ahmad F. Ullah M.W. Chitosan-based nanostructured biomaterials: Synthesis, properties, and biomedical applications Adv. Indus. Eng. Polym. Res. 2023 7 79 99 10.1016/j.aiepr.2023.07.002 56. Kou S.G. Peters L.M. Mucalo M.R. Chitosan: A review of sources and preparation methods Int. J. Biol. Macromol. 2021 169 85 94 10.1016/j.ijbiomac.2020.12.005 33279563 57. Mir M. Wilson L.D. Flax fiber-chitosan biocomposites with tailored structure and switchable physicochemical properties Carbohydr. Polym. Technol. Appl. 2023 6 100397 10.1016/j.carpta.2023.100397 58. Wu K. Yan Z. Wu Z. Li J. Zhong W. Ding L. Zhong T. Jiang T. Recent advances in the preparation, antibacterial mechanisms, and applications of chitosan J. Funct. Biomater. 2024 15 318 10.3390/jfb15110318 39590522 PMC11595984 59. Aider M. Chitosan application for active bio-based films production and potential in the food industry: Review LWT Food Sci. Technol. 2010 43 837 842 10.1016/j.lwt.2010.01.021 60. Zhang Y. Zhang X. Ding R. Zhang J. Liu J. Determination of the degree of deacetylation of chitosan by potentiometric titration preceded by enzymatic pretreatment Carbohydr. Polym. 2011 83 813 817 10.1016/j.carbpol.2010.08.058 61. Xia W. Liu P. Zhang J. Chen J. Biological activities of chitosan and chitooligosaccharides Food Hydrocoll. 2011 25 170 179 10.1016/j.foodhyd.2010.03.003 62. Cosme F. Vilela A. Chitin and chitosan in the alcoholic and non-alcoholic beverage industry: An overview Appl. Sci. 2021 11 11427 10.3390/app112311427 63. Jastaniah S.D. Using nisin-chitosan films enriched with rosemary extract on Listeria innocua, Escherichia coli O157:H7 and Pseudomonas aeruginosa in cold-smoked salmon during cold storage Appl. Food Res. 2025 5 100693 10.1016/j.afres.2025.100693 64. Faqir Y. Ma J. Chai Y. Chitosan in modern agriculture production Plant Soil Environ. 2021 67 679 699 10.17221/332/2021-PSE 65. Xing K. Zhu X. Peng X. Qin S. Chitosan antimicrobial and eliciting properties for pest control in agriculture: A review Agron. Sustain. Dev. 2015 35 569 588 10.1007/s13593-014-0252-3 66. Orzali L. Corsi B. Forni C. Riccioni L. Chitosan in agriculture: A new challenge for managing plant disease Biol. Act. Appl. Mar. Polysacch. 2017 10 17 36 10.5772/66840 67. Hassan O. Chang T. Chitosan for eco-friendly control of plant disease Asian J. Plant Pathol. 2017 11 53 70 10.3923/ajppaj.2017.53.70 68. Deng P. Yao L. Chen J. Tang Z. Zhou J. Chitosan-based hydrogels with injectable, self-healing and antibacterial properties for wound healing Carbohydr. Polym. 2022 276 118718 10.1016/j.carbpol.2021.118718 34823762 69. Shrestha R. Thenissery A. Khupse R. Rajashekara G. Strategies for the preparation of chitosan derivatives for antimicrobial, drug delivery, and agricultural applications: A review Molecules 2023 28 7659 10.3390/molecules28227659 38005381 PMC10674490 70. Guzmán E. Ortega F. Rubio R.G. Chitosan: A promising multifunctional cosmetic ingredient for skin and hair care Cosmetics 2022 9 99 10.3390/cosmetics9050099 71. Rajkumar D.S.R. Keerthika K. Vijayaragavan V. Chitosan-based biomaterial in wound healing: A review Cureus 2024 16 e55193 10.7759/cureus.55193 38562272 PMC10983058 72. Agulló E. Rodríguez M.S. Ramos V. Albertengo L. Present and future role of chitin and chitosan in food Macromol. Biosci. 2003 3 521 530 10.1002/mabi.200300010 73. Fatima M. Mir S. Ali M. Hassan S. Khan Z.U.H. Waqar K. Synthesis and applications of chitosan derivatives in food preservation-A review Eur. Polym. J. 2024 216 113242 10.1016/j.eurpolymj.2024.113242 74. Kiskó G. Sharp R. Roller S. Chitosan inactivates spoilage yeasts but enhances survival of Escherichia coli O157:H7 in apple juice J. Appl. Microbiol. 2005 98 872 880 10.1111/j.1365-2672.2004.02527.x 15752333 75. Klinkesorn U. The role of chitosan in emulsion formation and stabilization Food Rev. Int. 2013 29 371 393 10.1080/87559129.2013.818013 76. Himashree P. Sengar A.S. Sunil C.K. Food thickening agents: Sources, chemistry, properties and applications-A review Int. J. Gastron. Food Sci. 2022 27 100468 10.1016/j.ijgfs.2022.100468 77. Domingues R.C.C. Junior S.B.F. Silva R.B. Cardoso V.L. Reis M.H.M. Clarification of passion fruit juice with chitosan: Effects of coagulation process variables and comparison with centrifugation and enzymatic treatments Process Biochem. 2012 47 467 471 10.1016/j.procbio.2011.12.002 78. Yıldız A.B. Tokatlı K. Evaluation of chitosan as clarification aid in production of sour cherry juice and its effect on quality during storage J. Food Sci. Technol. 2024 61 2235 2242 10.1007/s13197-024-06055-4 39431193 PMC11486871 79. Chatterjee S. Chatterjee S. Chatterjee B.P. Guha A.K. Clarification of fruit juice with chitosan Process Biochem. 2004 39 2229 2232 10.1016/j.procbio.2003.11.024 80. Gassara F. Antzak C. Ajila C.M. Sarma S.J. Brar S.K. Verma M. Chitin and chitosan as natural flocculants for beer clarification J. Food Eng. 2015 166 80 85 10.1016/j.jfoodeng.2015.05.028 81. Venkatachalapathy R. Packirisamy A.S.B. Ramachandran A.C.I. Udhyasooriyan L.P. Peter M.J. Senthilnathan K. Basheer V.A. Muthusamy S. Assessing the effect of chitosan on pesticide removal in grape juice during clarification by gas chromatography with tandem mass spectrometry Process Biochem. 2020 94 305 312 10.1016/j.procbio.2020.04.035 82. Shao Z. Jiang X. Lin Q. Wu S. Zhao S. Sun X. Cheng Y. Fang Y. Li P. Nano-selenium functionalized chitosan gel beads for Hg (II) removal from apple juice Int. J. Biol. Macromol. 2024 261 129900 10.1016/j.ijbiomac.2024.129900 38316329 83. Devlieghere F. Vermeulen A. Debevere J. Chitosan: Antimicrobial activity, interactions with food components and applicability as a coating on fruit and vegetables Food Microbiol. 2004 21 703 714 10.1016/j.fm.2004.02.008 84. Miot-Sertier C. Paulin M. Dutilh L. Ballestra P. Albertin W. Masneuf-Pomarède I. Coulon J. Moine V. Vallet-Courbin A. Maupeu J. Assessment of chitosan antimicrobial effect on wine microbes Int. J. Food Microbiol. 2022 381 109907 10.1016/j.ijfoodmicro.2022.109907 36063684 85. Sagoo S. Board R. Roller S. Chitosan inhibits growth of spoilage micro-organisms in chilled pork products Food Microbiol. 2002 19 175 182 10.1006/fmic.2001.0474 86. Tayel A.A. Moussa S. Opwis K. Knittel D. Schollmeyer E. Nickisch-Hartfiel A. Inhibition of microbial pathogens by fungal chitosan Int. J. Biol. Macromol. 2010 47 10 14 10.1016/j.ijbiomac.2010.04.005 20416334 87. Campaniello D. Bevilacqua A. Sinigaglia M. Corbo M.R. Chitosan: Antimicrobial activity and potential applications for preserving minimally processed strawberries Food Microbiol. 2008 25 992 1000 10.1016/j.fm.2008.06.009 18954735 88. Picariello L. Rinaldi A. Blaiotta G. Moio L. Pirozzi P. Gambuti A. Effectiveness of chitosan as an alternative to sulfites in red wine production Eur. Food Res. Technol. 2020 246 1795 1804 10.1007/s00217-020-03533-9 89. Nunes C. Maricato É. Cunha Â. Rocha M. Santos S. Ferreira P. Silva M.A. Rodrigues A. Amado O. Coimbra J. Chitosan–genipin film, a sustainable methodology for wine preservation Green Chem. 2016 18 5331 5341 10.1039/C6GC01621A 90. Muñoz-Tebar N. Pérez-Álvarez J.A. Fernández-López J. Viuda-Martos M. Chitosan edible films and coatings with added bioactive compounds: Antibacterial and antioxidant properties and their application to food products: A review Polymers 2023 15 396 10.3390/polym15020396 36679276 PMC9864592 91. Kong P. Rosnan S.M. Enomae T. Carboxymethyl cellulose–chitosan edible films for food packaging: A review of recent advances Carbohydr. Polym. 2024 346 122612 10.1016/j.carbpol.2024.122612 39245494 92. Ponce A.G. Moreira M.R. Casein and chitosan polymers: Use in antimicrobial packaging Antimicrobial Food Packaging 2nd ed. Barros-Velázquez J. Academic Press London, UK 2025 635 652 10.1016/B978-0-323-90747-7.00041-7 93. Delima M.P. Widjanarko S.B. Mahatmanto T. Optimization Methods and Food Safety Consideration of Edible Film: A Mini Review J. Exp. Life Sci. 2025 15 1 10 10.21776/ub.jels.2025.015.01.01 94. Oliveira I. Pinto T. Afonso S. Karaś M. Szymanowska U. Gonçalves B. Vilela A. Sustainability in Bio-Based Edible Films, Coatings, and Packaging for Small Fruits Appl. Sci. 2025 15 1462 10.3390/app15031462 95. Alam M.W. Saravanan P. Al-Sowayan N.S. Almutairi H.H. Rosaiah P. Prakash N.G. Ko T.J. Polysaccharides and proteins based edible coatings for food protection: Classification, properties, & public demands (2020–2024) J. Food Meas. Charact. 2025 19 1533 1556 10.1007/s11694-024-03090-9 96. Sapna Sharma C. Pathak P. Gautam S. Chitosan Edible Coatings Loaded with Bioactive Components for Fruits and Vegetables: A Step Toward Sustainable Development Goals Food Bioprocess Technol. 2025 18 4975 5009 10.1007/s11947-025-03770-4 97. Ghaderi-Ghahfarokhi M. Barzegar M. Sahari M.A. Gavlighi H.A. Gardini F. Chitosan-cinnamon essential oil nano-formulation: Application as a novel additive for controlled release and shelf life extension of beef patties Int. J. Biol. Macromol. 2017 102 19 28 10.1016/j.ijbiomac.2017.04.002 28380334 98. Helal M. Sami R. Algarni E. Alshehry G. Aljumayi H. Al-Mushhin A.A. Benajiba N. Chavali M. Kumar N. Iqbal A. Active bionanocomposite coating quality assessments of some cucumber properties with some diverse applications during storage condition by chitosan, nano titanium oxide crystals, and sodium tripolyphosphate Crystals 2022 12 131 10.3390/cryst12020131 99. Zamani F. Khoshkhoo Z. Hosseini S.E. Basti A.A.Z. Azizi M.H. Chitosan nano-coating incorporated with green cumin ( Cuminum cyminum Oncorhynchus mykiss J. Food Meas. Charact. 2022 16 1228 1240 10.1007/s11694-021-01278-x 100. Yu D. Yu Z. Zhao W. Regenstein J.M. Xia W. Advances in the application of chitosan as a sustainable bioactive material in food preservation Crit. Rev. Food Sci. Nutr. 2022 62 3782 3797 10.1080/10408398.2020.1869920 33401936 101. Raza Z.A. Khalil S. Ayub A. Banat I.M. Recent developments in chitosan encapsulation of various active ingredients for multifunctional applications Carbohydr. Res. 2020 492 108004 10.1016/j.carres.2020.108004 32387806 102. Maleki G. Woltering E.J. Mozafari M.R. Applications of chitosan-based carrier as an encapsulating agent in food industry Trends Food Sci. Technol. 2022 120 88 99 10.1016/j.tifs.2022.01.001 103. Oberlintner A. Bajić M. Kalčíková G. Likozar B. Novak U. Biodegradability study of active chitosan biopolymer films enriched with Quercus polyphenol extract in different soil types Environ. Technol. Innov. 2021 21 101318 10.1016/j.eti.2020.101318 104. Yuvaraj D. Iyyappan J. Gnanasekaran R. Ishwarya G. Harshini R.P. Dhithya V. Gomathi K. Advances in bio food packaging—An overview Heliyon 2021 7 e07998 10.1016/j.heliyon.2021.e07998 34589626 PMC8461358 105. Oyekunle D.T. Nia M.H. Wilson L.D. Recent Progress on the Application of Chitosan, Starch and Chitosan–Starch Composites for Meat Preservation—A Mini Review J. Compos. Sci. 2024 8 302 10.3390/jcs8080302 106. Rathod N.B. Bangar S.P. Šimat V. Ozogul F. Chitosan and gelatine biopolymer-based active/biodegradable packaging for the preservation of fish and fishery products Int. J. Food Sci. Technol. 2023 58 854 861 10.1111/ijfs.16038 107. Sudarshan N.R. Hoover D.G. Knorr D. Antibacterial action of chitosan Food Biotechnol. 1992 6 257 272 10.1080/08905439209549838 108. Helander I.M. Nurmiaho-Lassila E.L. Ahvenainen R. Rhoades J. Roller S. Chitosan disrupts the barrier properties of the outer membrane of Gram-negative bacteria Int. J. Food Microbiol. 2001 71 235 244 10.1016/S0168-1605(01)00609-2 11789941 109. Liu H. Du Y. Wang X. Sun L. Chitosan kills bacteria through cell membrane damage Int. J. Food Microbiol. 2004 95 147 155 10.1016/j.ijfoodmicro.2004.01.022 15282127 110. Ganan M. Carrascosa Martinez-Rodriguez A.J. Antimicrobial activity of chitosan against Campylobacter J. Food Prot. 2009 72 1735 1738 10.4315/0362-028X-72.8.1735 19722411 111. Park S.-C. Nah J.-W. Park Y. pH-dependent mode of antibacterial actions of low molecular weight water-soluble chitosan (LMWSC) against various pathogens Macromol. Res. 2011 19 853 860 10.1007/s13233-011-0812-1 112. Kong M. Chen X.G. Xing K. Park H.J. Antimicrobial properties of chitosan and mode of action: A state of the art review Int. J. Food Microbiol. 2010 144 51 63 10.1016/j.ijfoodmicro.2010.09.012 20951455 113. Arshad M.S. Batool S.A. Natural antimicrobials, their sources and food safety Food Additives Karunaratne D.N. Pamunuwa G. InTech London, UK 2017 87 102 10.5772/intechopen.70197 114. Másson M. Antimicrobial Properties of Chitosan and Its Derivatives Chitosan for Biomaterials III Jayakumar R. Prabaharan M. Springer Cham, Switzerland 2021 Volume 287 131 168 10.1007/12_2021_104 115. Nikaido H. Outer membrane In Escherichia coli Cellular and Molecular Biology Neidhardt F.C. ASM Press Washington, DC, USA 1996 29 47 116. Nasaj M. Chehelgerdi M. Asghari B. Ahmadieh-Yazdi A. Asgari M. Kabiri-Samani S. Sharifi E. Arabestani M. Factors influencing the antimicrobial mechanism of chitosan action and its derivatives: A review Int. J. Biol. Macromol. 2024 277 134321 10.1016/j.ijbiomac.2024.134321 39084423 117. Ibañez-Peinado D. Ubeda-Manzanaro M. Martínez A. Rodrigo D. Antimicrobial effect of insect chitosan on Salmonella Typhimurium, Escherichia coli O157:H7 and Listeria monocytogenes survival PLoS ONE 2020 15 e0244153 10.1371/journal.pone.0244153 33351851 PMC7755191 118. Benabbou R. Zihler A. Desbiens M. Kheadr E. Subirade M. Fliss I. Inhibition of Listeria monocytogenes by a combination of chitosan and divergicin M35 Can. J. Microbiol. 2009 55 347 355 10.1139/W08-154 19396234 119. Tang D. Wen H. Xu Z. Zou J. Liu X. Zhang D. Wang X. Preservation mechanism of chitosan/gelatin films modified by deep eutectic solvent on chilled chicken breast at 4 °C storage Food Control 2025 174 111237 10.1016/j.foodcont.2025.111237 120. Pang X. Du X. Hu X. Feng Z. Sun J. Li X. Lu Y. Inhibitory effect of DNase–Chitosan–nisin nanoparticles on cell viability, motility, and spatial structures of Listeria monocytogenes Biofilms Foods 2024 13 3544 10.3390/foods13223544 39593960 PMC11592910 121. Lin L. Mao X. Sun Y. Rajivgandhi G. Cui H. Antibacterial properties of nanofibers containing chrysanthemum essential oil and their application as beef packaging Int. J. Food Microbiol. 2019 292 21 30 10.1016/j.ijfoodmicro.2018.12.007 30553179 122. Seo S. King J.M. Prinyawiwatkul W. Janes M. Antibacterial activity of ozone-depolymerized crawfish chitosan J. Food. Sci. 2008 73 M400 M404 10.1111/j.1750-3841.2008.00922.x 19019121 123. Hafdani F.N. Sadeghinia N. A review on application of chitosan as a natural antimicrobial World Acad. Sci. Eng. Technol. 2011 5 46 50 10.1186/2194-0517-2-8 124. Cruz Z. Lauzon H. Arboleya J.C. Nuin M. de Marañón I.M. Amarita F. Antimicrobial effect of chitosan on micro-organisms isolated from fishery products Seafood Research from Fish to Dish Luten J.B. Jacobsen C. Bekaert K. Saebø A. Oehlenschläger J. Wageningen Academic Wageningen, The Netherlands 2006 387 393 10.3920/9789086865819_040 125. Riaz Rajoka M.S. Mehwish H.M. Wu Y. Zhao L. Arfat Y. Majeed K. Anwaar S. Chitin/chitosan derivatives and their interactions with microorganisms: A comprehensive review and future perspectives Crit. Rev. Biotechnol. 2020 40 365 379 10.1080/07388551.2020.1713719 31948287 126. Ardila N. Daigle F. Heuzey M.C. Ajji A. Antibacterial activity of neat chitosan powder and flakes Molecules 2017 22 100 10.3390/molecules22010100 28067839 PMC6155679 127. Ye M. Neetoo H. Chen H. Effectiveness of chitosan-coated plastic films incorporating antimicrobials in inhibition of Listeria monocytogenes on cold-smoked salmon Int. J. Food Microbiol. 2008 127 235 240 10.1016/j.ijfoodmicro.2008.07.012 18707789 128. Ye M. Neetoo H. Chen H. Control of Listeria monocytogenes on ham steaks by antimicrobials incorporated into chitosan-coated plastic films Food Microbiol. 2008 25 260 268 10.1016/j.fm.2007.10.014 18206768 129. Beverlya R.L. Janes M.E. Prinyawiwatkula W. No H.K. Edible chitosan films on ready-to-eat roast beef for the control of Listeria monocytogenes Food Microbiol. 2008 25 534 537 10.1016/j.fm.2007.11.002 18355679 130. Jiang Z. Neetoo H. Chen H. Control of Listeria monocytogenes on cold-smoked salmon using chitosan-based antimicrobial coatings and films J. Food. Sci. 2011 76 M22 M26 10.1111/j.1750-3841.2010.01925.x 21535689 131. Kakaei S. Shahbazi Y. Effect of chitosan-gelatin film incorporated with ethanolic red grape seed extract and Ziziphora clinopodioides essential oil on survival of Listeria monocytogenes and chemical, microbial and sensory properties of minced trout fillet LWT Food Sci. Technol. 2016 72 432 438 10.1016/j.lwt.2016.05.021 132. Kim K.W. Min B.J. Kim Y.T. Kimmel R.M. Cooksey K. Park S.I. Antimicrobial activity against foodborne pathogens of chitosan biopolymer films of different molecular weights LWT Food Sci. Technol. 2011 44 565 569 10.1016/j.lwt.2010.08.001 133. Vieira B.B. de Carvalho E.A. da Rocha Bispo A.S. Ferreira M.A. Evangelista-Barreto N.S. Efficiency of chitosan synergism with clove essential oil in the coating of intentionally contaminated Tambaqui fillets Semin. Ciênc. Agrár. 2020 41 2793 2802 10.5433/1679-0359.2020v41n6p2793 134. Li B. Kennedy J.F. Peng J.L. Yie X. Xie B.J. Preparation and performance evaluation of glucomannan–chitosan–nisin ternary antimicrobial blend film Carbohydr. Polym. 2006 65 488 494 10.1016/j.carbpol.2006.02.006 135. Li M. Wang W. Fang W. Li Y. Inhibitory effects of chitosan coating combined with organic acids on Listeria monocytogenes in refrigerated ready-to-eat shrimps J. Food Prot. 2013 76 1377 1383 10.4315/0362-028X.JFP-12-516 23905793 136. Cui H.Y. Wu J. Li C.Z. Lin L. Anti-listeria effects of chitosan-coated nisin-silica liposome on Cheddar cheese J. Dairy Sci. 2016 99 8598 8606 10.3168/jds.2016-11658 27568051 137. Orgaz B. Lobete M.M. Puga C.H. Jose C.S. Effectiveness of chitosan against mature biofilms formed by food related bacteria Int. J. Mol. Sci. 2011 12 817 828 10.3390/ijms12010817 21340015 PMC3039981 138. Pu C. Tang W. A chitosan-coated liposome encapsulating antibacterial peptide, Apep10: Characterisation, triggered-release effects and antilisterial activity in thaw water of frozen chicken Food Funct. 2016 7 4310 4322 10.1039/C6FO00858E 27713959 139. Namasivayam S.K.R. Samrat K. Srimanti Debnath S.D. Jayaprakash C. Biocompatible chitosan nanoparticles incorporated bacteriocin (CSNps-B) preparation for the controlled release and improved anti-bacterial activity against food borne pathogenic bacteria Listeria monocytogenes Res. J. Pharm. Biol. Chem. Sci. 2015 6 625 631 140. Alsaggaf M.S. Moussa S.H. Elguindy N.M. Tayel A.A. Fungal chitosan and Lycium barbarum extract as anti-Listeria and quality preservatives in minced catfish Int. J. Biol. Macromol. 2017 104 854 861 10.1016/j.ijbiomac.2017.06.097 28655659 141. Papadochristopoulos A. Kerry J.P. Fegan N. Burgess C.M. Duffy G. Potential Use of Selected Natural Anti-Microbials to Control Listeria monocytogenes in Vacuum Packed Beef Burgers and Their Impact on Quality Attributes Microorganisms 2025 13 910 10.3390/microorganisms13040910 40284746 PMC12029336 142. van den Broek L.A. Knoop R.J. Kappen F.H. Boeriu C.G. Chitosan films and blends for packaging material Carbohydr. Polym. 2015 116 237 242 10.1016/j.carbpol.2014.07.039 25458295 143. Chandarana C. Bonde S. Sonwane S. Prajapati B. Chitosan-based packaging: Leading sustainable advancements in the food industry Polym. Bull. 2025 82 5431 5462 10.1007/s00289-025-05775-7 144. Park S.I. Marsh K.S. Dawson P. Application of chitosan-incorporated LDPE film to sliced fresh red meats for shelf life extension Meat Sci. 2010 85 493 499 10.1016/j.meatsci.2010.02.022 20416821 145. Serio A. Chaves-López C. Sacchetti G. Rossi C. Paparella A. Chitosan coating inhibits the growth of Listeria monocytogenes and extends the shelf life of vacuum-packed pork loins at 4 °C Foods 2018 7 155 10.3390/foods7100155 30257415 PMC6210955 146. Zivanovic S. Chi S. Draughon A.F. Antimicrobial activity of chitosan films enriched with essential oils J. Food. Sci. 2005 70 M45 M51 10.1111/j.1365-2621.2005.tb09045.x 147. Sandoval L.N. López M. Montes-Díaz E. Espadín A. Tecante A. Gimeno M. Shirai K. Inhibition of Listeria monocytogenes in fresh cheese using chitosan-grafted lactic acid packaging Molecules 2016 21 469 10.3390/molecules21040469 27070568 PMC6273688 148. Bento R.A. Stamford T.L. Campos-Takaki G.M.D. Stamford T. Souza E.L.D. Potential of chitosan from Mucor rouxxi UCP064 as alternative natural compound to inhibit Listeria monocytogenes Braz. J. Microbiol. 2009 40 583 589 10.1590/S1517-83822009000300022 24031403 PMC3768536 149. Bento R.A. Stamford T.L.M. Stamford T.C.M. De Andrade S.A.C. De Souza E.L. Sensory evaluation and inhibition of Listeria monocytogenes in bovine pâté added of chitosan from Mucor rouxii LWT Food Sci. Technol. 2011 44 588 591 10.1016/j.lwt.2010.08.016 150. Pereira S. Costa-Ribeiro A. Teixeira P. Rodríguez-Lorenzo L. Prado M. Cerqueira M.A. Garrido-Maestu A. Evaluation of the antimicrobial activity of chitosan nanoparticles against Listeria monocytogenes Polymers 2023 15 3759 10.3390/polym15183759 37765613 PMC10538158 151. Tantala J. Kaokham P. Boonsupthip W. Thumanu K. Rachtanapun P. Naksang P. Rachtanapun C. Cellulose casing impregnated with chitosan: Its antimicrobial activity and application in ready-to-eat sausage Food Res. Int. 2025 208 116108 10.1016/j.foodres.2025.116108 40263777 152. Giannoulis N. Karatzas K.A.G. The combined effect of chitosan and high hydrostatic pressure on Listeria monocytogenes and Escherichia coli Innov. Food Sci. Emerg. Technol. 2024 94 103693 10.1016/j.ifset.2024.103693 153. Lee S.G. Kim S.J. Bang W.S. Yuk H.G. Chitosan enhances antibacterial efficacy of 405 nm light-emitting diode illumination against Escherichia coli O157:H7, Listeria monocytogenes, and Salmonella Food Res. Int. 2023 164 112372 10.1016/j.foodres.2022.112372 36737959 154. Lee S.G. Kim S.J. Bang W.S. Yuk H.G. Combined antibacterial effect of 460 nm light-emitting diode illumination and chitosan against Escherichia coli Salmonella Food Sci. Biotechnol. 2024 33 191 202 10.1007/s10068-023-01324-y 38186619 PMC10766941 155. Olaimat A.N. Sawalha A.G.A. Al-Nabulsi A.A. Osaili T. Al-Biss B.A. Ayyash M. Holley R.A. Chitosan–ZnO nanocomposite coating for inhibition of Listeria monocytogenes on the surface and within white brined cheese J. Food. Sci. 2022 87 3151 3162 10.1111/1750-3841.16208 35673883 156. Jovanovic G.D. Klaus A.S. Niksic M.P. Antimicrobial activity of chitosan films with essential oils against Listeria monocytogenes on cabbage Jundishapur J. Microbiol. 2016 9 e34804 10.5812/jjm.34804 27800143 PMC5086079 157. Jovanović G.D. Klaus A.S. Niksić M.P. Antimicrobial activity of chitosan coatings and films against Listeria monocytogenes on black radish Rev. Argent. Microbiol. 2016 48 128 136 10.1016/j.ram.2016.02.003 27237426 158. Elsherif W.M. Zayed G.M. Tolba A.O. Antimicrobial activity of chitosan-edible films containing a combination of carvacrol and rosemary nano-emulsion against Salmonella enterica serovar Typhimurium and Listeria monocytogenes for ground meat Int. J. Food Microbiol. 2024 418 110713 10.1016/j.ijfoodmicro.2024.110713 38718617 159. Osaili T.M. Al-Nabulsi A.A. Hasan F. Olaimat A.N. Taha S. Ayyash M. Nazzal D.S. Savvaidis I.N. Obaid R.S. Holley R. Antimicrobial effects of chitosan and garlic against Salmonella J. Food. Sci. 2022 87 833 844 10.1111/1750-3841.16025 35028936 160. No 2073/2005 Commission Regulation (EC) No 2073/2005 of 15 November 2005 on microbiological criteria for foodstuffs European Union Brussels, Belgium 2005 Available online: https://eur-lex.europa.eu/eli/reg/2005/2073/oj/eng (accessed on 2 July 2025) 161. Didenko L.V. Gerasimenko D.V. Konstantinova N.D. Silkina T.A. Avdienko I.D. Bannikova G.E. Varlamov V.P. Ultrastructural study of chitosan effects on Klebsiella and Staphylococci Bull. Exp. Biol. Med. 2005 140 356 360 10.1007/s10517-005-0489-6 16307058 162. Chung Y.C. Chen C.Y. Antibacterial characteristics and activity of acid-soluble chitosan Bioresour. Technol. 2008 99 2806 2814 10.1016/j.biortech.2007.06.044 17697776 163. Kulikov S. Shumkova Y. Effect of Chitosan on Lysostaphin Lysis of Staphylococcal Cells Bull. Exp. Biol. Med. 2014 157 243 245 10.1007/s10517-014-2535-8 24958375 164. Yang X. Lan W. Xie J. Antimicrobial and anti-biofilm activities of chlorogenic acid grafted chitosan against Staphylococcus aureus Microb. Pathogen. 2022 173 105748 10.1016/j.micpath.2022.105748 36064104 165. Chen L.C. Chiang W.D. Chen W.C. Chen H.H. Huang Y.W. Chen W.J. Lin S.B. Influence of alanine uptake on Staphylococcus aureus surface charge and its susceptibility to two cationic antibacterial agents, nisin and low molecular weight chitosan Food Chem. 2012 135 2397 2403 10.1016/j.foodchem.2012.06.122 22980819 166. Li K. Guan G. Zhu J. Wu H. Sun Q. Antibacterial activity and mechanism of a laccase-catalyzed chitosan–gallic acid derivative against Escherichia coli and Staphylococcus aureus Food Control 2019 96 234 243 10.1016/j.foodcont.2018.09.021 167. Arkoun M. Daigle F. Heuzey M.C. Ajji A. Mechanism of action of electrospun chitosan-based nanofibers against meat spoilage and pathogenic bacteria Molecules 2017 22 585 10.3390/molecules22040585 28383516 PMC6154008 168. Costa E.M. Silva S. Tavaria F.K. Pintado M.M. Insights into chitosan antibiofilm activity against methicillin-resistant Staphylococcus aureus J. Appl. Microbiol. 2017 122 1547 1557 10.1111/jam.13457 28370752 169. Chen W. Wu Q. Zhang J. Wu H. Antibacterial mechanism of chitosan Acta Microbiol. Sin. 2008 48 164 168 18437996 170. Zheng L.Y. Zhu J.F. Study on antimicrobial activity of chitosan with different molecular weights Carbohydr. Polym. 2003 54 527 530 10.1016/j.carbpol.2003.07.009 171. Al-Isawi A.J.O. Rahma M.I. Salman S.A.K. Al-Gazally M.E. Effect antimicrobial activity of chitosan against S. aureus in locally bovine soft cheese in babylon prevalence REDVET-Rev. Electrónica Vet. 2022 23 514 519 Available online: https://www.veterinaria.org/index.php/REDVET/article/view/259 (accessed on 4 July 2025) 172. Hong Y.F. Kim H. Bang M.H. Kim H.S. Kim T.R. Park Y.H. Chung D.K. Effects of NaCL and organic acids on the antimicrobial activity of chitosan Microbiol. Biotechnol. Lett. 2014 42 413 416 10.4014/kjmb.1408.08001 173. Al-Jaghifi Q.A.M. Khudhir Z.S. The antibacterial effect of chitosan against methicillin-resistant Staphylococcus aureus J. Anim. Health Prod. 2024 12 387 394 10.17582/journal.jahp/2024/12.3.387.394 174. Pranoto Y. Rakshit S.K. Salokhe V.M. Enhancing antimicrobial activity of chitosan films by incorporating garlic oil, potassium sorbate and nisin LWT Food Sci. Technol. 2005 38 859 865 10.1016/j.lwt.2004.09.014 175. Cé N. Noreña C.P. Brandelli A. Antimicrobial activity of chitosan films containing nisin, peptide P34, and natamycin CyTA J. Food 2012 10 21 26 10.1080/19476337.2010.537371 176. Abd-Alhadi R. Abou-Ghorrah S. Al Oklah B. Physical Properties, Antioxidant and Antimicrobial Activity of Chitosan Edible Films Containing Essential oils J. Nutr. Food Secur. 2023 8 212 220 10.18502/jnfs.v8i2.12595 177. Xu J. Lin Q. Sheng M. Ding T. Li B. Gao Y. Tan Y. Antibiofilm effect of cinnamaldehyde-chitosan nanoparticles against the biofilm of Staphylococcus aureus Antibiotics 2022 11 1403 10.3390/antibiotics11101403 36290061 PMC9598764 178. Deb P. Sahoo D. Hasan M.I. Basu T. Bardhan S. Ghosh A. Sukul P.K. Enhanced Antimicrobial and Degradable Properties of Silver Nanoparticles-Reinforced Chitosan-Indian Gooseberry Films for Sustainable Food Packaging Macromol. Chem. Phys. 2024 226 2400298 10.1002/macp.202400298 179. Firdaus F.E. Saputra A. Wardana A.N. The efficacy of ginger essential oil with chitosan to viability of Staphylococcus aureus Rasayan J. Chem. 2022 15 48 56 10.31788/RJC.2022.1516453 180. Reyes Méndez L.M. Méndez Morales P.A. López-Córdoba A. Ortega-Toro R. Gutiérrez T.J. Active chitosan/gelatin-based films and coatings containing eugenol and oregano essential oil for fresh cheese preservation J. Food Process Eng. 2023 46 e14396 10.1111/jfpe.14396 181. Rachtanapun C. Aroonsakul K. Rattanamanee N. Augkarawat C. Ratanasumawong S. Effect of chitosan on physical properties, texture and shelf life of sushi rice Ital. J. Food. Sci. 2018 30 82 89 182. Torlak E. Sert D. Antibacterial effectiveness of chitosan–propolis coated polypropylene films against foodborne pathogens Int. J. Biol. Macromol. 2013 60 52 55 10.1016/j.ijbiomac.2013.05.013 23707735 183. Eaton P. Fernandes J.C. Pereira E. Pintado M.E. Xavier Malcata F. Atomic force microscopy study of the antibacterial effects of chitosans on Escherichia coli and Staphylococcus aureus Ultramicroscopy 2008 108 1128 1134 10.1016/j.ultramic.2008.04.015 18556125 184. Chhabra P. Huang Y.W. Frank J.F. Chmielewski R. Gates K. Fate of Staphylococcus aureus, Salmonella enterica serovar Typhimurium, and Vibiro vulnificus in raw oysters treated with chitosan J. Food Prot. 2006 69 952 959 10.4315/0362-028X-69.7.1600 16865892 185. Kanatt S.R. Rao M.S. Chawla S.P. Sharma A. Effects of chitosan coating on shelf-life of ready-to-cook meat products during chilled storage LWT Food Sci. Technol. 2013 53 321 326 10.1016/j.lwt.2013.01.019 186. Gu H.M. Ma X.M. Zhao Y. Yang W.X. Meng F. Kang Y.P. Chen P. Antibacterial effect and mechanism of mixture of culture supernatant of Lactobacillus paracei z17 with chitosan against Escherichia coli O157:H7 Food Sci. 2022 43 57 62 10.7506/spkx1002-6630-20211205-055 187. Jeon S.J. Oh M. Yeo W.S. Galvao K.N. Jeong K.C. Underlying mechanism of antimicrobial activity of chitosan microparticles and implications for the treatment of infectious diseases PLoS ONE 2014 9 e92723 10.1371/journal.pone.0092723 24658463 PMC3962451 188. Lahmer R.A. Williams A.P. Townsend S. Baker S. Jones D.L. Antibacterial action of chitosan-arginine against Escherichia coli O157 in chicken juice Food Control 2012 26 206 211 10.1016/j.foodcont.2012.01.039 189. Lahmer R.A. Jones D.L. Townsend S. Baker S. Williams A.P. Susceptibility of Escherichia coli O157 to chitosan-arginine in beef liquid purge is affected by bacterial cell growth phase Int. J. Food. Sci. Technol. 2014 49 515 520 10.1111/ijfs.12331 190. Enciso-Martínez Y. González-Pérez C.J. Aispuro-Hernández E. Vargas-Arispuro I.C. Ayala-Zavala J.F. Martínez-Téllez M.A. Antimicrobial effect of chitosan and extracellular metabolites of Pediococcus pentosaceus CM175 against Salmonella Typhimurium and Escherichia coli O157:H7 J. Food Saf. 2022 42 e12968 10.1111/jfs.12968 191. Khudhir Z.S. Antimicrobial activity of chitosan and/or Gum Arabic in the local produce soft and hard cheese in Baghdad city Biochem. Cell. Arch. 2021 21 2727 2733 Available online: https://connectjournals.com/03896.2021.21.2727 (accessed on 2 July 2025) 192. Vardaka V.D. Yehia H.M. Savvaidis I.N. Effects of Citrox and chitosan on the survival of Escherichia coli O157:H7 and Salmonella enterica in vacuum-packaged turkey meat Food Microbiol. 2016 58 128 134 10.1016/j.fm.2016.04.003 27217368 193. El-Zehery H.R. Zaghloul R.A. Abdel-Rahman H.M. Salem A.A. El-Dougdoug K.A. Novel strategies of essential oils, chitosan, and nano-chitosan for inhibition of multi-drug resistant: E. coli Saudi J. Biol. Sci. 2022 29 2582 2590 10.1016/j.sjbs.2021.12.036 35531141 PMC9073063 194. Severino R. Ferrari G. Vu K.D. Donsì F. Salmieri S. Lacroix M. Antimicrobial effects of modified chitosan based coating containing nanoemulsion of essential oils, modified atmosphere packaging and gamma irradiation against Escherichia coli O157:H7 and Salmonella Typhimurium on green beans Food Control 2015 50 215 222 10.1016/j.foodcont.2014.08.029 195. Moreira M.D.R. Roura S.I. Ponce A. Effectiveness of chitosan edible coatings to improve microbiological and sensory quality of fresh cut broccoli LWT Food Sci. Technol. 2011 44 2335 2341 10.1016/j.lwt.2011.04.009 21623785 196. Amarillas L. Lightbourn-Rojas L. Angulo-Gaxiola A.K. Basilio Heredia J. González-Robles A. León-Félix J. The antibacterial effect of chitosan-based edible coating incorporated with a lytic bacteriophage against Escherichia coli O157:H7 on the surface of tomatoes J. Food Saf. 2018 38 e12571 10.1111/jfs.12571 197. Brown C.A. Wang B. Oh J.H. Antimicrobial activity of lactoferrin against foodborne pathogenic bacteria incorporated into edible chitosan film J. Food Prot. 2008 71 319 324 10.4315/0362-028X-71.2.319 18326181 198. Al-Nabulsi A. Osaili T. Sawalha A. Olaimat A.N. Albiss B.A. Mehyar G. Ayyash M. Holley R. Antimicrobial activity of chitosan coating containing ZnO nanoparticles against E. coli O157:H7 on the surface of white brined cheese Int. J. Food Microbiol. 2020 334 108838 10.1016/j.ijfoodmicro.2020.108838 32896745 199. Shekarforoush S.S. Basiri S. Ebrahimnejad H. Hosseinzadeh S. Effect of chitosan on spoilage bacteria, Escherichia coli and Listeria monocytogenes in cured chicken meat Int. J. Biol. Macromol. 2015 76 303 309 10.1016/j.ijbiomac.2015.02.033 25735728 200. Fisher K.D. Bratcher C.L. Jin T.Z. Bilgili S.F. Owsley W.F. Wang L. Evaluation of a novel antimicrobial solution and its potential for control Escherichia coli O157:H7, non-O157:H7 shiga toxin-producing E. coli Salmonella Listeria monocytogenes Food Control 2016 64 196 201 10.1016/j.foodcont.2015.12.007 201. İncili G.K. Karatepe P. İlhak O.İ. Effect of chitosan and Pediococcus acidilactici E. coli Salmonella Typhimurium Listeria monocytogenes LWT Food Sci. Technol. 2020 117 108706 10.1016/j.lwt.2019.108706 202. İncili G.K. Karatepe P. Akgöl M. Tekin A. Kanmaz H. Kaya B. Çalıcıoğlu M. Hayaloğlu A.A. Impact of chitosan embedded with postbiotics from Pediococcus acidilactici Meat Sci. 2022 188 108786 10.1016/j.meatsci.2022.108786 35278973 203. Mellegård H. Strand S.P. Christensen B.E. Granum P.E. Hardy S.P. Antibacterial activity of chemically defined chitosans: Influence of molecular weight, degree of acetylation and test organism Int. J. Food Microbiol. 2011 148 48 54 10.1016/j.ijfoodmicro.2011.04.023 21605923 204. Lin L. Xue L. Duraiarasan S. Haiying C. Preparation of ε-polylysine/chitosan nanofibers for food packaging against Salmonella on chicken Food Packag. Shelf Life 2018 17 134 141 10.1016/j.fpsl.2018.06.013 205. Al Daour R. Osaili T.M. Semerjian L. Dhanasekaran D.K. Ismail L.C. Savvaidis I.N. Survival of Salmonella Escherichia coli Foods 2024 13 2246 10.3390/foods13142246 39063330 PMC11275961 206. Johnson A.M. Thamburaj S. Etikala A. Sarma C. Mummaleti G. Kalakandan S.K. Evaluation of antimicrobial and antibiofilm properties of chitosan edible coating with plant extracts against Salmonella E. coli J. Food Process. Preserv. 2022 46 e16653 10.1111/jfpp.16653 207. Hu Z.Y. Balay D. Hu Y. McMullen L.M. Gänzle M.G. Effect of chitosan, and bacteriocin–producing Carnobacterium maltaromaticum Escherichia coli Salmonella Typhimurium Int. J. Food Microbiol. 2019 290 68 75 10.1016/j.ijfoodmicro.2018.10.003 30300792 208. Chen W. Jin T.Z. Gurtler J.B. Geveke D.J. Fan X. Inactivation of Salmonella on whole cantaloupe by application of an antimicrobial coating containing chitosan and allyl isothiocyanate Int. J. Food Microbiol. 2012 155 165 170 10.1016/j.ijfoodmicro.2012.02.001 22361025 209. Thangvaravut H. Chiewchan N. Devahastin S. Inhibitory effect of chitosan films incorporated with 1, 8-cineole on Salmonella Adv. Mater. Res. 2012 506 599 602 10.4028/www.scientific.net/AMR.506.599 210. Leleu S. Herman L. Heyndrickx M. De Reu K. Michiels C.W. De Baerdemaeker J. Messens W. Effects on Salmonella shell contamination and trans-shell penetration of coating hens’ eggs with chitosan Int. J. Food Microbiol. 2011 145 43 48 10.1016/j.ijfoodmicro.2010.11.023 21146239 211. da Silva B.D. Lelis C.A. do Rosário D.K.A. da Silva Mutz Y. da Silva C.R. Conte-Junior C.A. A Novel Strategy for Reducing Salmonella Enteritidis Cross-Contamination in Ground Chicken Meat Using Thymol Nanoemulsion Incorporated in Chitosan Coatings Food Bioprocess. Technol. 2024 17 2706 2717 10.1007/s11947-023-03283-y 212. Cui H. Bai M. Li C. Liu R. Lin L. Fabrication of chitosan nanofibers containing tea tree oil liposomes against Salmonella LWT Food Sci. Technol. 2018 96 671 678 10.1016/j.lwt.2018.06.026 213. Lee E.H. Khan I. Oh D.H. Evaluation of the efficacy of nisin-loaded chitosan nanoparticles against foodborne pathogens in orange juice J. Food. Sci. Technol. 2018 55 1127 1133 10.1007/s13197-017-3028-3 29487455 PMC5821672 214. Won J.S. Lee S.J. Park H.H. Song K.B. Min S.C. Edible coating using a chitosan-based colloid incorporating grapefruit seed extract for cherry tomato safety and preservation J. Food. Sci. 2018 83 138 146 10.1111/1750-3841.14002 29227543 215. Paomephan P. Assavanig A. Chaturongakul S. Cady N.C. Bergkvist M. Niamsiri N. Insight into the antibacterial property of chitosan nanoparticles against Escherichia coli Salmonella Typhimurium Food Control 2018 86 294 301 10.1016/j.foodcont.2017.09.021 216. Poubol J. Phiriyangkul P. Boonyaritthongchai P. Antimicrobial activity of chitosan coating on asparagus spears against Escherichia coli Salmonella Acta Hortic. 2018 1213 511 516 10.17660/ActaHortic.2018.1213.76 217. Goy R.C. Britto D.D. Assis O.B. A review of the antimicrobial activity of chitosan Polímeros 2009 19 241 247 10.1590/S0104-14282009000300013 218. Dutta J. Tripathi S. Dutta P.K. Progress in antimicrobial activities of chitin, chitosan and its oligosaccharides: A systematic study needs for food applications Food Sci. Technol. Int. 2012 18 3 34 10.1177/1082013211399195 21954316 219. Wrońska N. Katir N. Miłowska K. Hammi N. Nowak M. Kędzierska M. Anouar A. Zawadzka K. Bryszewska M. El Kadib A. Antimicrobial effect of chitosan films on food spoilage bacteria Int. J. Mol. Sci. 2021 22 5839 10.3390/ijms22115839 34072512 PMC8198402 220. Perdana M.I. Panphon S. Ruamcharoen J. Leelakriangsak M. Antimicrobial property of cassava starch/chitosan film incorporated with lemongrass essential oil and its shelf life J. Pure Appl. Microbiol. 2022 16 2891 2900 10.22207/JPAM.16.4.64 221. Azam M. Srivastava R. Ahmed T. Enhanced Antibacterial Efficacy of Levilactobacillus brevis Bacteriocin with Chitosan Nanoparticle Delivery J. Pure Appl. Microbiol. 2024 18 2748 2757 10.22207/JPAM.18.4.47 222. Al Towaijri S.A. Mohamed S.H. Abdallah E.M. Aladhadh M. Alayouni R.R. Al-Hassan A.A. Exploring the Antimicrobial Potential of Chitosan, Whey Protein, and Mint Essential Oil Biopolymers J. Pure Appl. Microbiol. 2025 19 633 646 10.22207/JPAM.19.1.53 223. Ali M.S. Chun B.S. Characterization of chitosan-based packaging film incorporating betel leaves phenolic compounds recovered via subcritical water extraction Food Biosci. 2025 65 106125 10.1016/j.fbio.2025.106125 224. Fortunati E. Multifunctional films, blends, and nanocomposites based on chitosan: Use in antimicrobial packaging Antimicrobial Food Packaging 2nd ed. Barros-Velázquez J. Academic Press Cambridge, MA, USA 2025 653 665 10.1016/B978-0-323-90747-7.00042-9 225. Kim M. Son I.S. Han J.S. Evaluation of microbiological, physicochemical and sensory qualities of chitosan tofu during storage J. Food Qual. 2004 27 27 40 10.1111/j.1745-4557.2004.tb00635.x 226. Han C. Lederer C. McDaniel M. Zhao Y. Sensory evaluation of fresh strawberries ( Fragaria ananassa J. Food. Sci. 2005 70 S172 S178 10.1111/j.1365-2621.2005.tb07153.x 227. Singh A. Mittal A. Benjakul S. Chitosan nanoparticles: Preparation, food applications and health benefits Sci. Asia 2021 47 1 10 10.2306/scienceasia1513-1874.2021.020 228. Kumar R. Xavier K.M. Lekshmi M. Balange A. Gudipati V. Fortification of extruded snacks with chitosan: Effects on techno functional and sensory quality Carbohydr. Polym. 2018 194 267 273 10.1016/j.carbpol.2018.04.050 29801839 229. Rassoul S.E.A. Farahat M.F. Salem E.G. Gohar Y.M. Sheta M.I. Effect of Chitosan and/or Nigella Sativa Oil on the Organoleptic Properties of Kareish Cheese Sch. J. Food Nutr. 2020 2 242 246 10.32474/sjfn.2020.02.000141 230. Raafat D. Leib N. Wilmes M. François P. Schrenzel J. Sahl H.G. Development of in vitro resistance to chitosan is related to changes in cell envelope structure of Staphylococcus aureus Carbohydr. Polym. 2017 157 146 155 10.1016/j.carbpol.2016.09.075 27987856 231. Tan Y. Li R. Liu C. Mundo J.M. Zhou H. Liu J. McClements D.J. Chitosan reduces vitamin D bioaccessibility in food emulsions by binding to mixed micelles Food Funct. 2020 11 187 199 10.1039/C9FO02164G 31833516 232. Diab M.A. El-Sonbati A.Z. Bader D.M.D. Zoromba M.S. Thermal stability and degradation of chitosan modified by acetophenone J. Polym. Environ. 2012 20 29 36 10.1007/s10924-011-0330-4 233. Moalla S. Ammar I. Fauconnier M.-L. Danthine S. Blecker C. Besbes S. Attia H. Development and characterization of chitosan films carrying Artemisia campestris antioxidants for potential use as active food packaging materials Int. J. Biol. Macromol. 2021 183 254 266 10.1016/j.ijbiomac.2021.04.113 33892038 234. Wang Y. Wang Z. Lu W. Hu Y. Review on chitosan-based antibacterial hydrogels: Preparation, mechanisms, and applications Int. J. Biol. Macromol. 2024 255 128080 10.1016/j.ijbiomac.2023.128080 37977472 235. Jiang G. He K. Chen M. Yang L. Yang Y. Tang T. Tian Y. Improvement of mechanical and bioactive properties of chitosan films plasticized with novel thymol-based deep eutectic solvents Food Hydrocoll. 2025 158 110480 10.1016/j.foodhyd.2024.110480 236. Wen H. Tang D. Lin Y. Zou J. Liu Z. Zhou P. Wang X. Enhancement of water barrier and antimicrobial properties of chitosan/gelatin films by hydrophobic deep eutectic solvent Carbohydr. Polym. 2023 303 120435 10.1016/j.carbpol.2022.120435 36657831 237. No H.K. Kim S.H. Lee S.H. Park N.Y. Prinyawiwatkul W. Stability and antibacterial activity of chitosan solutions affected by storage temperature and time Carbohydr. Polym. 2006 65 174 178 10.1016/j.carbpol.2005.12.036 238. Chang S.H. Wu C.H. Tsai G.J. Effects of chitosan molecular weight on its antioxidant and antimutagenic properties Carbohydr. Polym. 2018 181 1026 1032 10.1016/j.carbpol.2017.11.047 29253927 239. Ivanova D.G. Yaneva Z. Antioxidant properties and redox-modulating activity of chitosan and its derivatives: Biomaterials with application L in cancer therapy BioResearch Open Access 2020 9 64 72 10.1089/biores.2019.0028 32219012 PMC7097683 240. Jøraholmen M.W. Bhargava A. Julin K. Johannessen M. Škalko-Basnet N. The antimicrobial properties of chitosan can be tailored by formulation Mar. Drugs 2020 18 96 10.3390/md18020096 32023890 PMC7074233 241. Büyükyörük S. Chitosan for Using Food Protection Chitin and Chitosan—Physicochemical Properties and Industrial Applications 1st ed. Berrada M. IntechOpen London, UK 2021 139 238 Available online: https://www.intechopen.com/chapters/78259 (accessed on 3 July 2025) 242. Wael K. Abdelgawad A.M. Elsherbiny D.A. El-Naggar M.E. Chitosan nanoparticles for antimicrobial applications Fundamentals and Biomedical Applications of Chitosan Nanoparticles Deshmukh K. Dodda J.M. El-Sherbiny I.M. Sadiku E.R. Woodhead Publishing Cambridge, UK 2025 363 404 10.1016/B978-0-443-14088-4.00001-0 243. Jogaiah S. Mujtaba A.G. Mujtaba M. De Britto S. Geetha N. Belorkar S.A. Shetty H.S. Chitosan-metal and metal oxide nanocomposites for active and intelligent food packaging; a comprehensive review of emerging trends and associated challenges Carbohydr. Polym. 2025 357 123459 10.1016/j.carbpol.2025.123459 40158990 244. Wanjun T. Cunxin W. Donghua C. Kinetic studies on the pyrolysis of chitin and chitosan Polym. Degrad. Stab. 2005 87 389 394 10.1016/j.polymdegradstab.2004.08.006 245. de Britto D. Campana-Filho S.P. Kinetics of the thermal degradation of chitosan Thermochim. Acta 2007 465 73 82 10.1016/j.tca.2007.09.008 246. Viljoen J.M. Steenekamp J.H. Marais A.F. Kotzé A.F. Effect of moisture content, temperature and exposure time on the physical stability of chitosan powder and tablets Drug Dev. Ind. Pharm. 2014 40 730 742 10.3109/03639045.2013.782501 23596972 247. Jennings J.A. Controlling chitosan degradation properties in vitro and in vivo Chitosan Based Biomaterials Jennings J.A. Bumgardner J.D. Woodhead Publishing Cambridge, UK 2017 Volume 1 159 182 10.1016/B978-0-08-100230-8.00007-8 248. Patrulea V. Ostafe V. Borchard G. Jordan O. Chitosan as a starting material for wound healing applications Eur. J. Pharm. Biopharm. 2015 97 417 426 10.1016/j.ejpb.2015.08.004 26614560 249. Ma Z. Garrido-Maestu A. Jeong K.C. Application, mode of action, and in vivo activity of chitosan and its micro-and nanoparticles as antimicrobial agents: A review Carbohydr. Polym. 2017 176 257 265 10.1016/j.carbpol.2017.08.082 28927606 250. Castillejo A. Martínez G. Delgado-Pujol E.J. Villalobo E. Carrillo F. Casado-Jurado D. Pérez-Bernal J.L. Begines B. Torres Y. Alcudia A. Enhanced porous titanium biofunctionalization based on novel silver nanoparticles and nanohydroxyapatite chitosan coatings Int. J. Biol. Macromol. 2025 299 139846 10.1016/j.ijbiomac.2025.139846 39826717 251. Sivasuriyan K.S. Namasivayam S.K.R. Varshan G.A. Synergistic effects of chitosan and okra mucilage in nZVI-based nanocomposite (CS-OM-nZVI) for pathogen control in water systems J. Water Process Eng. 2025 69 106804 10.1016/j.jwpe.2024.106804 252. Xie F. Qin Z. Luo Y. He Z. Chen Q. Cai J. Synergistically engineered starch-based composite films: Multifunctional platforms integrating quaternary ammonium chitosan and anthocyanins for intelligent food monitoring and sustainable packaging Food Chem. 2025 478 143560 10.1016/j.foodchem.2025.143560 40049123 253. Edson J.A. Chu W. Porwollik S. Tran K. Iribe N. McClelland M. Kwon Y.J. Eradication of Intracellular Salmonella Typhimurium by Polyplexes of Acid-Transforming Chitosan and Fragment DNA Macromol. Biosci. 2021 21 2000408 10.1002/mabi.202170017 PMC8295212 33870627 254. Sarier N. Eloglu A. Onder E. The Development of Thermoresponsive Multifunctional Chitosan Films Suitable for Food Packaging Polysaccharides 2025 6 17 10.3390/polysaccharides6010017 255. Yang W. Tu A. Ma Y. Li Z. Xu J. Lin M. Zhang K. Jing L. Fu C. Jiao Y. Chitosan and whey protein bio-inks for 3D and 4D printing applications with particular focus on food industry Molecules 2021 27 173 10.3390/molecules27010173 35011406 PMC8746959 256. Liu X. Xu F. Yong H. Chen D. Tang C. Kan J. Liu J. Recent advances in chitosan-based active and intelligent packaging films incorporated with flavonoids Food Chem. 2025 25 102200 10.1016/j.fochx.2025.102200 39974528 PMC11838128 257. Li B. Chen H. Ma Q. Tang T. Bai Y. A Novel Polyvinyl Alcohol/Chitosan-Based Anthocyanin Electrospun Colorimetric Film for Monitoring Chicken Breast Freshness Food Anal. Methods 2025 18 841 855 10.1007/s12161-025-02757-3 258. Charles A.P.R. Rajasekaran B. Awasti N. Choudhary P. Khanashyam A.C. Majumder K. Wu Y. Pandiselvam R. Jin T.Z. Emerging chitosan systems incorporated with polyphenols: Their applications in intelligent packaging, active packaging, and nutraceutical systems–A comprehensive review Int. J. Biol. Macromol. 2025 308 142714 10.1016/j.ijbiomac.2025.142714 40174836 Figure 1 The antimicrobial mechanism of action of chitosan against Listeria monocytogenes Figure 2 The antimicrobial mechanism of action of chitosan against Staphylococcus aureus Figure 3 The antimicrobial mechanism of action of chitosan against E. coli Figure 4 The antimicrobial mechanism of action of chitosan against Salmonella microorganisms-13-02036-t001_Table 1 Table 1 Antimicrobial effect of different chitosan applications against Listeria monocytogenes Chitosan Form Antimicrobial Concentration Medium/Food Matrix Observed Antimicrobial Effect Reference Chitosan form Mucor rouxxi 5.0 and 2.5 mg/mL Yam bean medium Bactericidal effect on L. monocytogenes [ 148 Chitosan form Mucor rouxxi 5 mg/g Bovine meat pâté at 4 °C reduction in L. monocytogenes 10 [ 149 Low-molecular-weight chitosan from shrimp shells, (≥75% deacetylated) 0.02 to 2.0 mg/mL Luria–Bertani broth Smallest particles (263 nm) resulted in lower minimum inhibitory concentration of 0.04 mg/mL of L. monocytogenes L. monocytogenes [ 150 Low-molecular-weight chitosan 0.1% Muller–Hinton agar Suppression of growth of L. monocytogenes [ 28 Cellulose casing impregnated with chitosan 2% Ready-to-eat (RTE) Vienna sausage Growth of L. monocytogenes [ 151 Chitosan film with sodium lactate 2% Ham steaks at 4 °C Reduction in L. monocytogenes 10 2 [ 128 Chitosan with high hydrostatic pressures 0.1% chitosan + 250 MPa Lab medium Synergistic inhibition of L. monocytogenes [ 152 Chitosan with 460 nm LED illumination 1.0% chitosan + 460 nm LED 1.3 kJ/cm 2 Fresh-cut melon 1.5–3.5 log 10 2 L. monocytogenes [ 153 Chitosan with 460 nm LED illumination 1.0% chitosan + 460 nm LED illumination at 0.6–0.8 kJ/cm 2 Fresh-cut melon Inoculation level of 10 4–5 2 L. monocytogenes [ 154 Chitosan coating 1% and 2% Vacuum-packed pork loins at 4 °C reduction in L. monocytogenes 10 [ 145 Chitosan-ZnO nanocomposite 1% ZnO White brined cheese at 4 °C and 10 °C reduction in L. monocytogenes 10 10 10 [ 155 Chitosan film 0.5% and 1% Shredded cabbage at 4 °C Complete reduction in L. monocytogenes [ 156 Chitosan film with essential oils 1% (with 0.2% essential oils) Shredded cabbage at 4 °C Enhanced antimicrobial activity against L. monocytogenes Chitosan film 1% Shredded black radish at 4 °C Immediate reduction of 2.6–3.1 log 10 L. monocytogenes [ 157 Chitosan film with thyme oil 1% with 0.2% thyme oil Shredded black radish at 4 °C Reduction in L. monocytogenes 10 Chitosan with 460 nm LED illumination 1.0% chitosan + 460 nm LED illumination at 2.4 kJ/cm 2 Fresh-cut melon4 °C and 10 °C Reduction in L. monocytogenes 10 2 [ 154 Chitosan film 1% Extra thick bologna slices at 10 °C Reduction in L. monocytogenes 10 [ 146 Chitosan film with oregano 1% (with 1% and 2% oregano) Extra thick bologna slices at 10 °C Reduction in L. monocytogenes 10 Chitosan film 1% Ground meat at 4 °C 3 log 10 L. monocytogenes [ 158 Chitosan film Nano-emulsions with rosemary 1% (with 1.56% rosemary nano-emulsions) Ground meat at 4 °C 1 log 10 L. monocytogenes Chitosan in hummus 0.5% Hummus at 4, 10, and 25 °C Reduction in L. monocytogenes 10 10 10 [ 159 Chitosan in hummus 1% Hummus at 4, 10, and 25 °C Reduction in L. monocytogenes 10 10 10 Chitosan in hummus with garlic 0.5% (with 1% garlic) Hummus at 4, 10, and 25 °C Reduction in L. monocytogenes 10 10 10 Chitosan in hummus with garlic 1% (with 1% garlic) hummus at 4, 10, and 25 °C Reduction in L. monocytogenes 10 10 10 microorganisms-13-02036-t002_Table 2 Table 2 Antimicrobial effect of different chitosan applications against Staphylococcus aureus Chitosan Form Antimicrobial Concentration Medium/Food Matrix Observed Antimicrobial Effect Reference Chitosan coated corona-treated polypropylene film 2% Test strain inoculated nutrient broth on the surface of film Reduction in S. aureus [ 182 Chitosan-propolis coated corona-treated polypropylene film 2% (with 200 mg/mL ethanolic extract of propolis) Test strain inoculated nutrient broth on the surface of film Reduction in S. aureus Different molecular weight (MW) chitosan 1% BHI medium Low-MW chitosan was more effective with greater inhibition zones against S. aureus [ 122 Different molecular weight chitosan 0.1% Muller–Hinton broth Reduction in S. aureus 10 10 [ 28 Chitosan 0.5% Muller–Hinton broth Reduction in S. aureus 10 [ 183 Chitosan films with nisin 1% (with nisin at 51,000 IU/g) Mueller–Hinton agar Markedly high antimicrobial activity (inhibition zones) against S. aureus [ 174 Chitosan films with garlic oil 1% (with oil at 100 µL/g) Mueller–Hinton agar Even higher antimicrobial activity against S. aureus Chitosan 0.5% and 1% White cheese solution at 4 °C Reduction in S. aureus 10 S. aureus 10 [ 171 Chitosan 0.5, 1.0, and 2.0% oyster Reduction in S. aureus 10 [ 184 Chitosan 2% Chicken balls at 3 °C Reduction in S. aureus 10 [ 185 Chitosan 2% Fresh beef meat at ambient temperature Reduction in S. aureus 10 [ 173 Chitosan 2% Frozen beef meat at ambient temperature and 4 °C Reduction in S. aureus 10 10 microorganisms-13-02036-t003_Table 3 Table 3 Antimicrobial effect of different chitosan applications against E. coli Chitosan Form Antimicrobial Concentration Medium/Food Matrix Observed Antimicrobial Effect Reference Chitosan 0.05–0.1% Apple juice Survival of E. coli [ 74 Chitosan with 460 nm LED illumination 1.0% chitosan + 460 nm LED 1.3 kJ/cm 2 Fresh-cut melon at 4 °C and 10 °C Reduction in E. coli 10 2 10 2 [ 153 Chitosan with or without ZnO nanoparticles 2.5% (ZnO nanoparticles ≥ 0.0125%) White brined cheese Reduction in E. coli 10 10 [ 198 Chitosan film with oregano 1% (with 1% and 2% oregano) Extra thick bologna slices at 10 °C Reduction in E. coli 10 [ 146 Chitosan 2% Iranian traditional ready-to-barbecue chicken meat cubes at 3 °C Reduction in E. coli 10 [ 199 Chitosan with oregano 2% (with 15% oregano oil) Iranian traditional ready-to-barbecue chicken meat cubes at 3 °C Reduction in E. coli 10 Chitosan in hummus 0.5% Hummus at 4, 10, and 25 °C Reduction in E. coli 10 10 10 [ 159 Chitosan in hummus 1% Hummus at 4, 10, and 25 °C Reduction in E. coli 10 10 10 Chitosan in hummus with garlic 0.5% (with 1% garlic) Hummus at 4, 10, and 25 °C Reduction in E. coli 10 10 10 Chitosan in hummus with garlic 1% (with 1% garlic) Hummus at 4, 10, and 25 °C Reduction in E. coli 10 10 10 Commercial edible chitosan coating 2.5% Mini-Roma cultivar tomatoes Reduction in E. coli 10 [ 196 Commercial edible chitosan coating with a lytic bacteriophage 2.5% Mini-Roma cultivar tomatoes Reduction in E. coli 10 Chitosan-based antimicrobial solutions 5% (with 2% each of acetic, lactic and levulinic acids and 4% lauric arginate acid) Marinades on beef top round steaks at 4 °C Reduction in E. coli 10 2 [ 200 Chitosan 0.4% (with 6.73 log 10 P. acidilactici Meatballs Reduction in E. coli 10 [ 201 Chitosan with Pediococcus acidilactici 0.4% (with 6.73 log 10 P. acidilactici Meatballs at 4 °C Reduction in E. coli 10 Chitosan (CH) with postbiotics (P) of Pediococcus acidilactici 0.5 and 1% (with 50–100% postbiotics) Vacuum-packaged frankfurters at 4 °C Reduction in E. coli 10 [ 202 microorganisms-13-02036-t004_Table 4 Table 4 Antimicrobial effect of different chitosan applications against Salmonella Chitosan Form Antimicrobial Concentration Medium/Food Matrix Observed Antimicrobial Effect Reference Chitosan 1% Guacamole Reduction in Salmonella by 0.5 log 10 [ 205 Chitosan 1% Fresh lean beef at 4 °C Reduction in Salmonella by 1 log 10 2 [ 207 Chitosan with bacteriocin produced by Carnobacterium maltaromaticum 1% (with 1280 AU/mL purified bacteriocin) Fresh lean beef at 4 °C Reduction in Salmonella by 2 log 10 2 Chitosan coating with allyl isothiocyanate (AIT) 2% (with AIT at 60 μL/mL) Fresh cantaloupes Reduction in Salmonella by >5 log 10 2 [ 208 Chitosan film with 1,8-cineole (CIN) 1.5% (with 2, 3, 4% 1,8-cineole) Model food surface (agar gel) Reduction in Salmonella by 3 log 10 2 Salmonella [ 209 Chitosan with 460 nm LED illumination 1.0% chitosan + 460 nm LED 1.3 kJ/cm 2 Fresh-cut melon Reduction in Salmonella by 0.9–1.1 log 10 2 [ 153 Chitosan with 460 nm LED illumination 1.0% chitosan + 460 nm LED illumination at 0.6–0.8 kJ/cm 2 Fresh-cut melon Reduction in Salmonella by 2.5 log 10 2 [ 154 Chitosan in hummus 0.5% Hummus at 4, 10, and 25 °C Reduction in Salmonella by 2.6 log 10 10 10 [ 159 Chitosan in hummus 1% Hummus at 4, 10, and 25 °C Reduction in Salmonella by 2.9 log 10 10 10 Chitosan in hummus with garlic 0.5% (with 1% garlic) Hummus at 4, 10, and 25°C Reduction in Salmonella by 2.7 log 10 10 10 Chitosan in hummus with garlic 1% (with 1% garlic) Hummus at 4, 10, and 25°C Reduction in Salmonella by 2.8 log 10 10 10 ",
  "metadata": {
    "Title of this paper": "Emerging chitosan systems incorporated with polyphenols: Their applications in intelligent packaging, active packaging, and nutraceutical systems–A comprehensive review",
    "Journal it was published in:": "Microorganisms",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12472043/"
  }
}