{
  "title": "Paper_117",
  "abstract": "pmc Age Ageing Age Ageing 709 ageing ageing Age and Ageing 0002-0729 1468-2834 Oxford University Press PMC12490715 PMC12490715.1 12490715 12490715 41037675 10.1093/ageing/afaf279 afaf279 1 Research Paper AcademicSubjects/MED00280 ageing/5 ageing/15 Social inequalities in the use of formal and informal home care in older women: evidence from a large UK cohort study https://orcid.org/0000-0003-1655-991X Quinn Matthew  Nuffield Department of Population Health, University of Oxford Oxford UK https://orcid.org/0000-0001-6384-8322 Shepperd Sasha  Applied Health Research Unit, Nuffield Department of Population Health, University of Oxford Oxford UK https://orcid.org/0000-0002-6078-9117 Floud Sarah  Cancer Epidemiology Unit, Nuffield Department of Population Health, University of Oxford Oxford UK Address correspondence to: Matthew Quinn, Nuffield Department of Population Health, University of Oxford, Richard Doll Building, Old Road Campus, Oxford, OX3 7DQ, UK. Email: matthew.quinn4@nhs.net 10 2025 02 10 2025 54 10 498207 afaf279 25 6 2024 10 7 2025 20 8 2025 02 10 2025 03 10 2025 03 10 2025 © The Author(s) 2025. Published by Oxford University Press on behalf of the British Geriatrics Society. 2025 https://creativecommons.org/licenses/by/4.0/ This is an Open Access article distributed under the terms of the Creative Commons Attribution License ( https://creativecommons.org/licenses/by/4.0/ Abstract Background At a time when access to publicly funded social care is constrained relative to need, older people with care needs with the least resources may disproportionately rely on informal care. Methods In 2020–21, 66,604 participants from the UK Million Women Study were invited to complete an online survey, which included questions on pre-pandemic receipt of home care. Responses were combined with data collected at recruitment in 1998, a 2010 re-survey, and hospital admissions in 2017–19. We used multivariable logistic regression to assess the association between education level and area deprivation quintile with formal or informal care use, with adjustment for pre-disposing characteristics (age), enabling resources (household composition and size) and care need (including self-rated health and co-morbidities). Results A total of 44,523 women completed the survey; 43,756 were eligible for analysis (mean age 75.6). A total of 1407 (3.2%) received informal care, 544 received formal care (1.2%) and 255 (0.6%) received both. Compared to those with university degrees, those with no qualifications were more likely to receive informal care (OR: 1.50, 95% CI: 1.23–1.84) and less likely to receive formal care (OR: 0.39, 95% CI: 0.25–0.60). The most deprived were more likely to receive informal care (OR: 1.34, 95% CI: 1.09–1.65) compared to the least deprived, and there was a trend across quintiles ( P trend Conclusion This is the largest UK study to assess variation in social care use by education and deprivation. We found inequities in care that may disadvantage older women in deprived areas and with lower levels of education, and their informal carers. socio-economic inequalities older people unpaid carers social care–home care formal care The Health Foundation 10.13039/501100000724 Cancer Research UK 10.13039/501100000289 A29186 pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement yes pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes Key points Few studies have explored the relationship between socio-economic status and social care in the home in the UK and elsewhere. We identified inequalities in home care use in the UK after adjusting for the major determinants of care use, such as care need. Older women with no qualifications were more likely to use informal care than women with university degrees. Conversely, older women with no qualifications were less likely to use formal home care than women with university degrees. Reforms to social care are needed to equitably meet the care needs of older people and plan for a growing ageing population. Introduction Social care supports independence in old age by providing assistance with daily activities for those with care needs, and is part of the continuum for achieving universal health coverage [ 1 2 3 4 5 6 7 Dual pressures of increasing demand and constrained supply mean that more care is provided by unpaid informal carers, with an estimated 2.1 million older people receiving informal care provided by 5.5 million informal carers in 2021 [ 8 9 10 9 11–14 Assessing the use of home care across the UK is complicated by the different policies on eligibility for public funded care across its constituent nations, and a lack of data due to the mix of public and private care providers. In England and Wales individuals with savings above a certain threshold (£23 250 in England, £50 000 in Wales) have to self-fund their home or residential care [ 15 15 16 17 In England, ‘fairness and accessibility’ are key aspects of the government’s vision for social care, but there is limited data to test how well this holds [ 1 18 19 18 19 20–23 24 25 Methods Study design The Million Women Study (MWS) is a population-based UK cohort study that recruited 1.3 million participants between 1996 and 2001 from 66 NHS breast screening centres across England and Scotland [ 26 N 27 28 29 Informal or formal care receipt was determined based on responses to the question ‘During 2020, did someone regularly provide help with some of your personal daily activities and domestic tasks (e.g. washing, dressing, cooking) that you could not manage alone’. Respondents then specified the type and timing of care. Those reporting care from a husband/partner, family, friend or neighbour were classified as informal care receivers. Those who received care from a paid professional were classified as receiving formal care. Only individuals receiving care before, or before and during, the COVID-19 outbreak were classified as receiving care in the main analyses ( Supplementary Appendix Tables S1 S3 Education was a three-level categorical variable based on the highest qualification at recruitment: degree-level qualifications (college or university), completion of secondary (A-levels or O-levels) or technical (nursing, teaching, clerical or commercial) qualifications, or no qualifications. At recruitment, participants were assigned a Townsend score from the 1991 census based on the location of their postcode within small areas (census enumeration district in England, census output area in Scotland) [ 30 30 Potential confounders associated with the use of formal or informal care were grouped according to Andersen’s behavioural model of health services use [ 31 32 33 29 Supplementary Appendix Table S4 34 Statistical analysis Analysis was conducted using Stata 17 [ 35 Likelihood-ratio tests were used to assess trend across deprivation quintiles, heterogeneity across education level and interaction between final models and geographical region, given the different social care policies in England and the devolved nations. The impact of missing values was assessed by imputing missing SES variables under the assumption they belonged to the lowest and highest education levels and the least and most deprived quintiles of deprivation, and examining the effect on the final models. A further sensitivity analysis was performed with formal or informal care removed from the models where they were included as covariates. Results A total of 44 523 participants responded to the COVID-19 questionnaire (67% of those invited). We excluded 24 individuals (0.05%) in care or nursing homes, 336 (0.75%) with missing education and 394 (0.88%) with missing deprivation. A total of 13 participants missing formal ( n n Supplementary Appendix Tables S5 S6 Participants had a mean age of 75.6 years (SD 3.7). A total of 1707/43 756 (3.9%) received home care; 1407/43 756 (3.2%) received informal care and 544/43 756 formal care (1.2%), of which 255/43 756 (0.6%) received both care types. Informal care was mostly received from unpaid sources inside the home ( n n Supplementary Appendix Table S3 Supplementary Appendix Table S3 r r = Women with no qualifications received more informal care (4.9%) and less formal care (0.9%) than women with degree-level qualifications (2.9% and 1.5% respectively) ( Table 1 Table 2 Tables 1 2 Table 1 Characteristics of participants by education level. A total of 255 participants received both formal and informal care. Values not included where the number of participants <10. Education Characteristics No qualifications ( n Secondary or technical qualifications ( n Tertiary qualifications ( n  Age Mean (SD) 75.7 (3.7) 75.6 (3.7) 75.5 (3.7)  Area n Southern England 1619 (53.5%) 11 855 (54.8%) 9785 (51.2%) Midlands 557 (18.4%) 3350 (15.5%) 3098 (16.2%) Northern England 722 (23.9%) 5316 (24.6%) 4724 (24.7%) Scotland 126 (4.2%) 1110 (5.1%) 1494 (7.8%)  Care status n No care 2861 (94.6%) 20 813 (96.2%) 18 386 (96.3%) Informal care 148 (4.9%) 702 (3.2%) 557 (2.9%) Formal care 26 (0.9%) 232 (1.1%) 286 (1.5%)  Deprivation quintile n Q1 (least deprived) 634 (21.0%) 6220 (28.8%) 5526 (28.9%) Q2 655 (21.7%) 5361 (24.8%) 4573 (23.9%) Q3 670 (22.2%) 4598 (21.3%) 4085 (21.4%) Q4 579 (19.1%) 3609 (16.7%) 3306 (17.3%) Q5 (most deprived) 486 (16.1%) 1843 (8.5%) 1611 (8.4%)  Co-habitants n None 1001 (33.2%) 6925 (32.1%) 6021 (31.6%) One 1829 (60.7%) 13 530 (62.7%) 12 103 (63.5%) Two or more 184 (6.1%) 1130 (5.2%) 949 (5.0%) Missing 10 (0.3%) 46 (0.2%) 28 (0.1%)  Partner n Lives with partner 1879 (62.1%) 13 769 (63.7%) 12 294 (64.4%)  Child n Lives with child 204 (6.7%) 1331 (6.2%) 1071 (5.6%)  Grandchild n Lives with grandchild 73 (2.4%) 369 (1.7%) 300 (1.6%)  Health status n Fair/Poor 787 (26.0%) 4028 (18.6%) 3243 (17.0%)  Shielding n Yes 392 (13.0%) 2137 (9.9%) 1657 (8.7%)  History of cancer n Yes 502 (16.6%) 3553 (16.4%) 3114 (16.3%)  History of dementia n Yes <10 34 (0.2%) 27 (0.1%)  History of cardiovascular disease n Yes 294 (9.7%) 1676 (7.7%) 1218 (6.4%) Table 2 Characteristics of participants by deprivation quintile. A total of 255 participants received both formal and informal care. Values not included where the number of participants <10. Deprivation quintile (DQ) Characteristics DQ 5 (most deprived) ( n DQ 4 ( n DQ 3 ( n DQ 2 ( n DQ 1 (least deprived) ( n  Age Mean (SD) 75.3 (3.7) 75.6 (3.7) 75.6 (3.7) 75.7 (3.8) 75.5 (3.7)  Area n Southern England 2033 (51.6%) 4383 (58.5%) 5433 (58.1%) 5846 (55.2%) 5564 (44.9%) Midlands 567 (14.4%) 1146 (15.3%) 1498 (16.0%) 1662 (15.7%) 2132 (17.2%) Northern England 1212 (30.8%) 1580 (21.1%) 1917 (20.5%) 2494 (23.6%) 3559 (28.7%) Scotland 128 (3.2%) 385 (5.1%) 505 (5.4%) 587 (5.5%) 1125 (9.1%)  Care status n No care 3737 (94.8%) 7205 (96.1%) 8993 (96.2%) 10 201 (96.3%) 11 924 (96.3%) Informal care 169 (4.3%) 237 (3.2%) 301 (3.2%) 327 (3.1%) 373 (3.0%) Formal care 56 (1.4%) 93 (1.2%) 123 (1.3%) 116 (1.1%) 156 (1.3%)  Education level n No qualifications 1611 (40.9%) 3306 (44.1%) 4085 (43.7%) 4573 (43.2%) 5526 (44.6%) Secondary/technical 1843 (46.8%) 3609 (48.2%) 4598 (49.2%) 5361 (50.6%) 6220 (50.2%) Tertiary 486 (12.3%) 579 (7.7%) 670 (7.2%) 655 (6.2%) 634 (5.1%)  Co-habitants n None 1625 (41.3%) 2607 (34.9%) 3017 (32.3%) 3226 (30.5%) 3472 (28.1%) One 2059 (52.4%) 4454 (59.6%) 5820 (62.4%) 6824 (64.5%) 8305 (67.2%) Two or more 247 (6.3%) 413 (5.5%) 492 (5.3%) 527 (5.0%) 584 (4.7%) Missing <10 20 (0.3%) 24 (0.3%) 12 (0.1%) 19 (0.2%)  Partner n Lives with partner 2056 (52.2%) 4497 (60.0%) 5926 (63.4%) 6959 (65.7%) 8504 (68.7%)  Child n Lives with child 290 (7.4%) 479 (6.4%) 555 (5.9%) 637 (6.0%) 645 (5.2%)  Grandchild n Lives with grandchild 90 (2.3%) 146 (1.9%) 162 (1.7%) 160 (1.5%) 184 (1.5%)  Health status n Fair/Poor 883 (22.4%) 1443 (19.3%) 1708 (18.3%) 1885 (17.8%) 2139 (17.3%)  Shielding n Yes 507 (12.9%) 743 (9.9%) 890 (9.5%) 966 (9.1%) 1080 (8.7%)  History of cancer n Yes 659 (16.7%) 1238 (16.5%) 1543 (16.5%) 1731 (16.3%) 1998 (16.1%)  History of dementia n Yes <10 11 (0.1%) 22 (0.2%) <10 21 (0.2%)  History of cardiovascular disease n Yes 342 (8.7%) 573 (7.6%) 671 (7.2%) 730 (6.9%) 872 (7.0%) Compared to the main MWS study cohort, 6.9% of participants reported having no qualifications vs 43.8% of the MWS cohort at recruitment; 9.0% were in the most deprived quintile and 28.3% in the least deprived quintile (compared to 19.9% and 20.1% of the original MWS cohort, respectively).  Figure 1 P het P het P trend P trend Figure 1 Odds ratios of care use by markers of socioeconomic status. All models were adjusted for pre-disposing characteristics (age), enabling resources (living with partner/child/grandchild, household size) and care need (self-rated health, shielding status, other care [informal or formal] received, history of cancer/dementia/cardiovascular disease).  Figure 2 Figure 2 Odds ratios of care use by SES, with sequential adjustment for covariates. Adjustment variables were grouped into pre-disposing characteristics (age), enabling resources (living with partner/child/grandchild, household size) and care need (self-rated health, shielding status, other care [informal or formal] received, history of cancer/dementia/cardiovascular disease). No significant interaction was found between education or deprivation and geographic region ( Supplementary Appendix Table S7 Supplementary Appendix Tables S8 S11 Supplementary Appendix Table S13 Discussion In a large sample of older women in the UK, we found that, despite reporting worse health, older people with no educational qualifications and from the most deprived areas disproportionately relied on informal care. Those with no qualifications were less likely to receive formal care than those with higher levels of education. Similar results were reported by the cross-sectional Survey of Health, Ageing and Retirement in Europe (data collected 2004, 2007 and 2017), and analyses of ELSA data [ 18–21 36–38 39–43 20 21 Our findings contribute to the evidence on inequalities in the receipt of care in the home by older adults in the UK, with two important implications. First is that the current system of means testing and assessment for eligibility for care is failing to provide equitable access to formal home care for older adults [ 44 1 1 45–47 12–14 48 The UK saw a rapid rise in informal care provision over the COVID-19 pandemic, when an additional 4.5 million people became carers [ 49 50 51 52 53 54 55 A strength of our analysis is the size of the study population and the inclusion of self-reported receipt of publicly and privately funded home care. This is important given the relative lack of accurate data on unpaid care (particularly given under-reporting of informal caring responsibilities among census respondents), and the very limited publicly available data on receipt of privately funded home care and other types of social care [ 56–59 n n n 60 15 To avoid results that reflected a change in care arrangements due to the COVID-19 pandemic, our analysis was limited to care received prior to, or prior to and during, the pandemic, and we excluded those whose care was limited to the period of the pandemic. While we adjusted for a wide range of variables measuring care need, for example, shielding status during COVID-19 and self-reported health, we were not able to include more direct measures of functional ability (e.g. measures of performance of activities of daily living) that might have improved the measurement of need for care. This paper builds on previous UK evidence, mainly from ELSA, on inequalities in social care access. Surveying women who participated in the MWS was minimally burdensome for the women involved, and utilised pre-existing socioeconomic and healthcare data to answer questions related to social care. Given the significant gaps in social care research, the use of large population-based health cohorts combined with routinely collected data provides an opportunity for social care research, particularly in the context of caring as an important determinant of health [ 61 Conclusion This is the largest UK study to assess variation in social care use by education and deprivation. Our findings emphasise the importance of policy that avoids a disproportionate care burden on those with fewer resources to ensure equitable access and use of social care. Supplementary Material Supplementary_materials_afaf279 Acknowledgements: We would like to thank the Million Women Study participants for making this research possible. The Million Women Study uses data provided by patients and collected by the NHS as part of their care and support. We thank NHS England and Public Health Scotland for the health outcomes data. Thanks to Sau Wan Kan and Adrian Goodill for their support for this research. We wish to acknowledge Sasha Shepperd and Sarah Floud as joint last authors on the paper, and that they contributed equally. For the purpose of open access, the authors have applied a Creative Commons Attribution (CC BY) licence to any Author Accepted Manuscript version arising. Declaration of Conflicts of Interest: None declared. Declaration of Sources of Funding: S.F. receives funding from Cancer Research UK (A29186). S.S. received funding from the Health Foundation during the completion of this research. The funders had no role in the research. Data Availability: Access to the MWS data is through an open-access data application. Full details of the Million Women Study data access policy and application process can be viewed online ( https://www.ceu.ox.ac.uk/research/the-million-women-study/data-access-and-sharing References 1. People at the Heart of Care: Adult Social Care Reform White Paper United Kingdom Department of Health and Social Care 2021 2. Long-Term Care for Older People: Package for Universal Health Coverage Geneva World Health Organization 2024 3. The Decline of Publicly Funded Social Care for Older Adults Nuffield Trust https://www.nuffieldtrust.org.uk/resource/the-decline-of-publicly-funded-social-care-for-older-adults 4. The Proportion of People Age 85 and Older with a Social Care Need 2021 5. Hu B Hancock R Wittenberg R Projections of Adult Social Care Demand and Expenditure 2018 to 2038 The London School of Economics 2020 6. van Hout HP van Lier L Draisma S et al. Signs of inequality? Variations in providing home health care across care organizations and across European countries in the IBenC study Health Serv Insights 2019 12 1178632919837632 31037031 10.1177/1178632919837632 PMC6475854 7. Social Care 360: Access The King’s Fund 2024 https://www.kingsfund.org.uk/insight-and-analysis/long-reads/social-care-360-access 8. Lyu JY Hu B Wittenberg R et al. The relationships between informal and formal social care for older people in England: a comparison before and after the care act J Aging Soc Policy 2014 2023 1 18 10.1080/08959420.2023.2226308 37353920 9. Eley S John S Unpaid Care by Age, Sex and Deprivation, England and Wales - Office for National Statistics Office for National Statistics 2023 https://www.ons.gov.uk/peoplepopulationandcommunity/healthandsocialcare/socialcare/articles/unpaidcarebyagesexanddeprivationenglandandwales/census2021#unpaid-care-by-age-sex-and-deprivation-england-and-wales-data 10. Wilson R Winter J Adult Social Care Activity and Finance: England 2022–23 NHS England 2024 11. Josten EJC Verbakel E de Boer AH A longitudinal study on the consequences of the take-up of informal care on work hours, labour market exit and workplace absenteeism due to illness Ageing Soc 2024 44 495 518 12. CQC Publishes Fourth State of Care report – Care Quality Commission Care Quality Commission 2013 https://www.cqc.org.uk/news/releases/cqc-publishes-fourth-state-care-report 13. Stöckel J Bom J Revisiting longer-term health effects of informal caregiving: evidence from the UK J Econ Ageing 2022 21 100343 14. Bom J Bakx P Schut F et al. The impact of informal caregiving for older adults on the health of various types of caregivers: a systematic review Gerontologist 2019 59 e629 42 10.1093/geront/gny137 30395200 PMC6850889 15. Dodsworth E Oung C Offer and Eligibility: Who Can Access State-Funded Adult Care and What Are People Entitled to? Nuffield Trust 2023 16. The Care Needs Assessment Explained Age UK 2024 https://www.ageuk.org.uk/information-advice/care/arranging-care/care-needs-assessment/ 17. Thompson I ADASS Spring Survey 2023: Care Waiting Lists Down but Needs Increasing ADASS 2024 https://www.adass.org.uk/adass-spring-survey-2023-care-waiting-lists-down-but-needs-increasing/ 18. Hu B Read S Wittenberg R et al. Socioeconomic inequality of long-term care for older people with and without dementia in England Ageing Soc 44 10.1017/S0144686X22000885 19. Teggi D Care homes as hospices for the prevalent form of dying: an analysis of long-term care provision towards the end of life in England Soc Sci Med 2020 260 113150 32659513 10.1016/j.socscimed.2020.113150 20. Albertini M Pavolini E Unequal inequalities: the stratification of the use of formal care among older Europeans J Gerontol B Psychol Sci Soc Sci 2017 72 510 21 10.1093/geronb/gbv038 26224754 PMC5927152 21. Lera J Pascual-Sáez M Cantarero-Prieto D Socioeconomic inequality in the use of long-term care among European older adults: an empirical approach using the SHARE survey Int J Environ Res Public Health 2021 18 20 10.3390/ijerph18010020 PMC7792951 33375147 22. García-Gómez P Hernández-Quevedo C Jiménez-Rubio D et al. Inequity in long-term care use and unmet need: two sides of the same coin J Health Econ 2015 39 147 58 10.1016/j.jhealeco.2014.11.004 25544399 23. Wilkins K Park E Home care in Canada Health Rep 1998 10 29 37 (ENG); 31–40 (FRE) 9836884 24. Plaisier I Verbeek-Oudijk D de Klerk M Developments in home-care use. Policy and changing community-based care use by independent community-dwelling adults in the Netherlands Health Policy 2017 121 82 9 10.1016/j.healthpol.2016.11.006 27890392 25. Carrieri V Di Novi C Orso CE Home sweet home? Public financing and inequalities in the use of home care services in Europe Fisc Stud 2017 38 445 68 26. Green J Reeves GK Floud S et al. Cohort profile: the million women study Int J Epidemiol 2019 48 28 29e 10.1093/ije/dyy065 29873753 PMC6380310 27. Online Questionnaires THE MILLION WOMEN STUDY 2022 http://www.millionwomenstudy.org/online_questionnaire/ 28. Postal Questionnaires THE MILLION WOMEN STUDY 2022 http://www.millionwomenstudy.org/questionnaires/ 29. Hospital Episode Statistics Data Dictionary NHS Digital 2022 https://digital.nhs.uk/data-and-information/data-tools-and-services/data-services/hospital-episode-statistics/hospital-episode-statistics-data-dictionary 30. Townsend P Philimore P Beattie A Health and deprivation Nurs Stand 1988 2 34 10.7748/ns.2.17.34.s66 27415096 31. Andersen RM Revisiting the behavioral model and access to medical care: does it matter? J Health Soc Behav 1995 36 1 10 7738325 32. Understanding the Needs of Those Most Clinically Vulnerable to COVID-19 2020 https://www.health.org.uk/news-and-comment/charts-and-infographics/understanding-the-needs-and-experiences-of-those-most-clinic 33. Shielded Patient List NHS England Digital https://digital.nhs.uk/services/high-risk-shielded-patients 34. Chappell N Blandford A Informal and formal care: exploring the complementarity Ageing Soc 1991 11 299 317 35. Stata Statistical Software: Release 17 2021 36. Walker PI The Impact of University Degrees on the Lifecycle of Earnings: Some Further Analysis Department of Business Innovation & Skills 2013 37. Galobardes B Lynch J Smith GD Measuring socioeconomic position in health research Br Med Bull 2007 81-82 21 37 17284541 10.1093/bmb/ldm001 38. One in Ten UK Older People Are Reducing or Stopping Their Social Care or Expect to Do so in the Coming Months as They Struggle with the Cost of Living Media. Age UK 2022 https://www.ageuk.org.uk/latest-press/articles/2022/one-in-ten-uk-older-people-are-reducing-or-stopping-their-social-care-or-expect-to-do-so-in-the-coming-months-as-they-struggle-with-the-cost-of-living/ 39. Walbaum M Knapp M Wittenberg R et al. Preferences of people 50 years and older when thinking of their future care needs 2024 42 53 40. Roberto KA Allen KR Blieszner R Older adults’ preferences for future care: formal plans and familial support Appl Dev Sci 2001 5 112 20 41. Wielink G Huijsman R McDonnell J Preferences for care: a study of the elders living independently in the Netherlands Res Aging 1997 19 174 98 42. Pinquart M Sörensen S Older adults’ preferences for informal, formal, and mixed support for future care needs: a comparison of Germany and the United States Int J Aging Hum Dev 2002 54 291 314 12243448 10.2190/1FVT-24T3-Y1V3-57A5 43. Lee K Revelli M Dickson D et al. Who cares? Preferences for formal and informal care among older adults in Québec J Appl Gerontol 2022 41 227 34 10.1177/0733464820976436 34886702 44. Szenkurök V Weber D Bilger M Informal and formal long-term care utilization and unmet needs in Europe: examining socioeconomic disparities and the role of social policies for older adults Int J Health Econ Manag 2025 25 10.1007/s10754-024-09378-z PMC12003520 38772952 45. Idriss O Tallack C Shembavnekar N et al. Social Care Funding Gap – The Health Foundation Health Foundation 2021 https://www.health.org.uk/news-and-comment/charts-and-infographics/REAL-social-care-funding-gap 46. Debate on the future of adult social care, House of Lords, 30 March 2023 Local Government Association 2023 https://www.local.gov.uk/parliament/briefings-and-responses/debate-future-adult-social-care-house-lords-30-march-2023 47. Boccarini G Stevenson G Sameen H et al. Adult Social Care Funding Pressures The Health Foundation 2023 https://www.health.org.uk/publications/long-reads/adult-social-care-funding-pressures 48. Fuller JB Healthy Outcomes – How Employers’ Support for Employees with Caregiving Responsibilities Can Benefit the Organization Harvard Business School 2024 https://www.hbs.edu/managing-the-future-of-work/research/Pages/healthy-outcomes.aspx 49. Carers Week 2020 Research Report: THE rise in the Number of Unpaid Carers during the Coronavirus (COVID-19) Outbreak Carers Week 2020 50. Madia JE Moscone F Nicodemo C Studying informal care during the pandemic: mental health, gender and job status Econ Hum Biol 2023 50 101245 37301174 10.1016/j.ehb.2023.101245 PMC10193826 51. Piaget K The Future of the Care Economy World Economic Forum 2024 52. Iacobucci G NHS long term plan: care to be shifted away from hospitals in ‘21st century’ service model BMJ 2019 364 l85 30617145 10.1136/bmj.l85 53. Steadman HCC Who Cares? The Implications of Informal Care and Work for Policymakers and Employers The Work Foundation 2018 54. Berrington A Childlessness in the UK Kreyenfeld M Konietzka D Childlessness in Europe: Contexts, Causes, and Consequences 2017 Cham Springer International Publishing 57 76 55. Economic Labour Market Status of Individuals Aged 50 and Over, Trends over Time: September 2023 GOV.UK https://www.gov.uk/government/statistics/economic-labour-market-status-of-individuals-aged-50-and-over-trends-over-time-september-2023/economic-labour-market-status-of-individuals-aged-50-and-over-trends-over-time-september-2023 56. Urwin S Lau Y-S Grande G et al. The challenges of measuring informal care time: a review of the literature PharmacoEconomics 2021 39 1209 23 10.1007/s40273-021-01053-2 34324174 PMC8516777 57. Gaps in Data and Insight NHS England Digital 2024 https://digital.nhs.uk/data-and-information/publications/statistical/adult-social-care-statistics-in-england/an-overview/gaps-in-data-and-insight 58. How Many People Fund Their Own Care? National Statistical 2021 https://blog.ons.gov.uk/2021/10/15/how-many-people-fund-their-own-care/ 59. Burton JK Goodman C Guthrie B et al. Closing the UK care home data gap – methodological challenges and solutions: closing the UK care home data gap. International journal of population data Science 2020 5 10.23889/ijpds.v5i4.1391 PMC8138869 34046529 60. Bridging the Gap: Tackling Inequalities in England’s Social Care Sector and Beyond Care England 2023 https://www.careengland.org.uk/bridging-the-gap-tackling-inequalities-in-englands-social-care-sector-and-beyond/ 61. Caring as a Social Determinant of Health United Kingdom Public Health England 2021 ",
  "metadata": {
    "Title of this paper": "Closing the UK care home data gap – methodological challenges and solutions: closing the UK care home data gap. International journal of population data",
    "Journal it was published in:": "Age and Ageing",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12490715/"
  }
}