{
  "title": "Paper_42",
  "abstract": "pmc Environ Sci Technol Environ Sci Technol 822 acssd es Environmental Science & Technology 0013-936X 1520-5851 pubs.acs.org/est pmc-is-collection-domain yes pmc-collection-title ACS AuthorChoice PMC12490018 PMC12490018.1 12490018 12490018 40965199 10.1021/acs.est.5c03851 1 Article Occurrence, Fate, and Transport of Aquatic and Terrestrial Contaminants Geospatial\nand Temporal\nInventory for Industrial DDT\nWaste Disposal to a Deep Coastal Ocean Environment 6825554 https://orcid.org/0009-0004-9566-4383 Wu Mong Sin Christine 6609676 https://orcid.org/0009-0004-0479-7368 Schmidt Jacob T. 6825550 Kittner Hailie E. Earth 182B Group 855885 https://orcid.org/0000-0001-5914-9107 Valentine David L.  † Department\nof Earth Science University of California Santa Barbara California 93106 United States  ‡ Interdepartmental\nGraduate Program in Marine Science University\nof California Santa Barbara California 93106 United States  § Marine\nScience Institute University of California Santa Barbara California 93106 United States * valentine@ucsb.edu 18 9 2025 30 9 2025 59 38 498181 20578 20587 28 3 2025 21 8 2025 19 8 2025 18 9 2025 02 10 2025 03 10 2025 03 10 2025 © 2025 The Authors. Published by American Chemical Society 2025 The Authors https://creativecommons.org/licenses/by/4.0/ This article is licensed under CC-BY 4.0 Historical ocean\ndisposal of industrial DDT (dichloro-diphenyl-trichloroethane)\nwaste off Southern California is implicated in extensive ecological\nimpacts extending well beyond this region, but details around disposal,\ntransport, and fate are poorly characterized for deep ocean settings\nsuch as this. Here, we present results from an 814 km 2 Chlorinated petrochemicals deep ocean dumping legacy pollution pesticide use San Pedro\nBasin contaminant fate and transport temporal\ndeposition Division of Materials Research 10.13039/100000078 DMR 2308708 National Oceanic and Atmospheric Administration 10.13039/100000192 NA22OAR4690679 - 313023-00001 National Oceanic and Atmospheric Administration 10.13039/100000192 NOAA-NMFS-SW-2023-2007989 - 309759-00001 California State Water Resources Control Board 10.13039/100004814 SCON-00005396 Anonymous donor NA NA Bentson Foundation NA NA Webster Foundation NA NA pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement yes pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes document-id-old-9 es5c03851 document-id-new-14 es5c03851 production-flag-MathML-config-version 3 production-flag-journal-citation-display-style acs-titles production-flag-journal-date-display-style dates-used-rcd-rvd-acc production-flag-si-avail yes document-id-alt-64 45edbf73014dfdbe3d6afe8222a37240f437924893b0bae179f1a9f01e94ed2d Published\nas part of Environmental Science & Technology special issue 1 Introduction Considered a wonder pesticide\nin the 1940s and 1950s, technical\nDDT (comprised mainly of 4,4′-dichlorodiphenyltrichloroethane)\nfell out of favor following the publication of Rachel Carson’s\nSilent Spring,   Table S1  During the period of active production in the US, the nation’s\nlargest DDT manufacturing facility – operated by Montrose Chemical\nCorporation of California (Montrose) – was located in Torrance,\nCalifornia. Montrose synthesized technical DDT at their facility in\nTorrance beginning in 1947, producing an estimated 1–8 million\npounds per month prior to the shuttering of the facility in 1982. Starting in 1947 Montrose disposed of their reactor waste –\nincluding residual reactants, unrecovered products and byproducts\nin strong sulfuric acid – through bulk offshore disposal.  Figure 1 Bathymetry map showing the 54 sediment core sampling locations\nacross San Pedro Basin. Color and contours indicate water depth. Inset\nshows the location of the study area (black box) along the Southern\nCalifornia coastline. Dashed circles indicate the locations of ocean\ndisposal sites referred to as “dumpsite 1” (DS1) Montrose also disposed\nof neutralized acidic and\ncaustic rinsate\ninto the sanitary sewer that was ultimately discharged to the shallow\ncoastal waters of Palos Verdes Shelf (PVS). Prior to 1953, Montrose\nwashed technical-grade DDT product twice to remove residual sulfuric\nacid and chlorobenzene; after both washes, dilute sulfuric acid wastes\nwere neutralized with sugar lime and drained to an on-site wastewater\npond and then to the sewer.  Substantial efforts associated with litigation have characterized\nthe discharge of DDT waste to the shallow waters of PVS,     In this work we describe the results of a sampling campaign focused\non quantification of DDX in sediment from an 814 km 2 2 Materials and Methods 2.1 Sediment\nSampling, Treatment, and Instrumental\nAnalysis Sediment from SPB, California, was collected through\nsediment coring during multiple expeditions as follows: R/V Yellowfin Atlantis Yellowfin Figure Sediment core samples were processed using two distinct methods:\nas 1 or 2 cm horizontal slices, and as 12 cm vertically integrated\nsubcores. Horizontally sliced cores were collected at every station\nand processed shipboard as described previously, with processing equipment\nrinsed between samples with isopropyl alcohol (70% v/v). For each relevant station, both horizontally sliced\nand vertically\nintegrated subcore samples were extracted and cleaned following EPA\nmethods 3570, 3630, and 3660 then analyzed for pesticides content\nby GC-ECD following EPA method 8081B at Pace Analytical (previously\nAlpha Analytical), Mansfield, Massachusetts as described previously. Figure S1 2.2 Data\nAnalysis 2.2.1 Sediment Age Model In order to\nexplore how the spatial patterns of sediment DDX deposition have varied\nin time, we synchronized the chronology for all SPB sediment cores\nbased on the depth of the peak DDT layer. This approach is based on\nthe assumption that the peak deposition of industrial DDT into SPB\nwas contemporaneously preserved in sediments throughout the deep basin\nfloor. This assumption is strongly supported by our prior findings 210 137 Figure S2 2.2.2 Spatial\nInterpolation To visualize\nthe spatial patterns of DDX across SPB, we created maps using a natural\nneighbor spatial interpolation method to estimate the values in between\nmeasured points. The natural neighbor interpolation method interpolates\nvalues at query points based on measured values at the closest subset\nof input sample points that are weighted on proportionate areas of\nVoronoi cells. 2.2.3 Estimation of Total DDX Burden The total burden of\nDDX was estimated for the 814 km 2 3 Supporting Information S1 2.2.4 Monte Carlo Iterations\nof DDX Burden Estimation To evaluate our confidence in the\nestimation of the overall DDX\nburden, we employed two distinct Monte Carlo-based approaches. Our\nfirst approach aims at assessing the uncertainty of the overall DDX\nburden estimate based on the depth-resolved sediment slice samples\nas described in the previous section, whereas our second approach\nevaluates how small-scale variability in DDX concentrations may influence\nthe overall burden estimation. In the first approach, we employed\na combination of jackknife and bootstrap methods to our spatial data.\nFirst, we applied a jackknife method to randomly assign our sample\nstations into N distinct, nonoverlapping subsets. Each subset yields\na DDX burden estimation (using natural neighbor interpolation), from\nwhich we calculated the average and standard deviation among these\nN burden estimates. Second, we applied bootstrap to the previous step\nby repeating the step 1000 times. This results in 1000 iterations\nof average burden and uncertainty estimates for that particular value\nof N. Third, we systematically performed the previous steps for N\nequals 2 to 9, that is, we jackknifed our sample stations into 2,\n3, 4, ...., and 9 subgroups. Last, since estimates from each N represent\nthe statistical power of 1/N of the sample stations, we could evaluate\nthe trend of how uncertainty changes with respect to N, and extrapolate\nthis trend to estimate the uncertainty for N = 1, which represents\nthe uncertainty in burden estimate from all of the sample stations. In the second approach, we incorporated data from the mini-piston\ncore triplicates to compute an uncertainty distribution of the top\n30 cm DDX inventory estimated at each station. For the A-series stations\nwhere mini-piston core samples were collected, we treated the vertically\nintegrated depth-resolved core, and the mini-piston core triplicates,\nas four separate measurements at each site. A weighted mean and weighted\nstandard deviation of inventory estimation was then calculated using\ntheir cross-section areas as weights. Since mini-piston core samples\nwere collected only for 0–12 cm at most sites and also 12–24\ncm at a few sites, we assumed a consistent proportion of DDX among\n0–12 cm, 12–24 cm, and 24–30 cm depth intervals,\nusing the depth-resolved concentration profile as a reference. Using\nthis proportionality we scaled the DDX for each mini-piston core to\naccount for DDX residing beneath the reach of the sampling approach\nwhen we computed the mini-piston-core-based DDX inventory estimations.\nFor the other stations where mini-piston cores were not collected,\nwe assigned an uncertainty standard deviation to each station based\non the average 56.5% standard deviation calculated from all A-series\nstations. We then performed 1000 Monte Carlo iterations, with each\niteration randomly sampling a site-specific inventory estimation from\nthe normal distribution (mean and standard deviation) at each of the\n54 sites. 1000 natural neighbor spatial interpolations of DDX inventory\nestimations were then generated, which allowed us to evaluate the\nmean and uncertainty of our basin-scale DDX burden estimation. 3 Results and Discussion 3.1 Spatial\nand Temporal Patterns of DDX Deposition The patterns of preservation\nfor DDT, DDD and DDE in the deep SPB\neach exhibit remarkable coherence with respect to location within\nthe basin ( Figure Figure  2 Spatial distribution\nof (a) peak DDT, (b) peak DDD, and (c) peak\nDDE concentrations buried in sediments across San Pedro Basin. Contours\nshow concentration in μg/kg dry weight of sediment. Note that\nthe color scale is nonlinear and skewed toward the lower end. Dashed\ncircles indicate the locations of dumpsite 1 (DS1) and dumpsite 2\n(DS2). 3 Decadal time-series of spatial distributions\nof DDT (left),\nDDD\n(middle), and DDE (right) concentrations. Peak DDT concentrations within all vertically resolved\nsediment\ncore profiles range from 4–53,600 μg/kg at our sites\nwith a maximum at 6–8 cm for most cores located distal to the\nmainland ( Figure Figure S2 Figure Figure Synchronized age models of all sediment cores using the\npeak DDT\nhorizon as an age marker (see Section Figure Supplemental Video in situ  Several key issues emerge from the observed spatiotemporal patterns\nof DDT, DDD and DDE that warrant mention. First, DDT, DDD and DDE\nare observed in strata assigned to the 1940′s, prior to industrial\nDDT manufacturing. We attribute this to minor amounts of bioturbation\nin the sediments, minor relief in the surface texture of sediment\nthat can blend adjacent strata at subcentimeter scale, and/or diffusive\nflux. Second, it remains unclear why DDT was so effectively preserved\nfrom offshore disposal, whereas subsequent deposition was primarily\nin the form of daughter product DDE. We suspect this relates to the\nlow oxygen concentration in and settling process to the deep SPB,\ncontrasting with biogeochemical activity associated with resuspension\nand or protracted transport from the more oxygenated PVS. Third, observed\ndistributions for DDT, DDD and DDE inform physical transport mechanisms\nwithin the water column. Specifically, the basin-wide distribution\nof DDT and DDD suggests dispersion in the water column occurred coincident\nwith settling for bulk offshore disposal. In contrast, the cross basin\ngradient for DDE points to PVS as a likely source and emplacement\nthrough cycle(s) of resuspension, advection and resettling. The extent\nand mechanisms of physical transport for DDT, DDD and DDE within SPB\nremain uncertain, but likely include adhesion to particulate matter\nand advection through mechanisms as modeled previously. 3.2 Environmental Variability In addition\nto assessing the basin-scale distribution of DDT, DDD and DDE, we\nalso conducted sampling targeted at the spatial variability of these\ncompounds. In a comparison of two vertically resolved samples collected\nfrom the same nominal location (T1-a and A08, ∼260 m apart),\nnotable differences are apparent in the maximum concentrations of\nDDT, DDD and DDE, although the stratigraphic patterns are similar\n( Figure S1 Figure Figure Figure  4 Variability\nof DDT, DDD, DDE, and DDX concentrations among mini\npiston core triplicates. Top row (a–d) shows percent deviation\nof individual concentrations of mini piston cores from triplicate\nmean concentrations (three dots connected by vertical bars), plotted\nagainst the triplicate mean concentration. Bottom row (e–h)\nshows concentrations of mini piston cores (dot: triplicate mean; vertical\nbar: range of concentrations) plotted against composite concentration\nreconstructed from sliced samples of corresponding depths. Note that x y For each set of triplicate vertical mini piston\ncores collected,\na parallel core was also analyzed through in-silico compositing of\nhorizontal slices (sliced samples in Figure Figure Figure 3.3 Sediment\nInventories for DDT, DDD, and DDE Local areal inventories\n(in mg m –2 Figure Figure S3 Figure Figure –2 –2 –2 –2 –2 Figure 5 Spatial distribution of (a) DDT, (b) DDD, (c) DDE, and\n(d) DDX\ninventory integrated for the top 30 cm of sediments on a per square\nmeter basis. Note that the color bar is on a nonlinear scale. Dashed\ncircles indicate the locations of dumpsite 1 (DS1) and dumpsite 2\n(DS2). While the spatial distribution\nof DDX inventory\nenables a calculation\nof basin-scale burden, the observed environmental variability in concentration\ndata at a range of spatial scales necessitates development of a statistical\napproach to estimate the associated uncertainty. Figure Section –2 2 6 Evaluation of uncertainty\nand DDX inventory estimation. (a) Results\nfrom the jackknife-bootstrap approach illustrate the decline in uncertainty\n(standard deviation σ) of inventory estimates as the number\nof subgroups decreases. Violin plots show the distribution of σ\nfrom 1000 iterations with black dots showing the mean. The trend is\nfitted by a second order polynomial curve, which yields a mean uncertainty\nof 4.4 mg m –2 N We further evaluated the uncertainty\nof our burden\nestimation by\nincorporating data from mini-piston core triplicates, which exhibit\nconsiderable centimeter-scale variability, in the areal inventory\ncalculated for each site. Figure –2 2 Figure The burden of buried DDX in SPB provides a useful lower limit for\nthe discharge from offshore disposal, though actual disposal was likely\nmuch greater as our approach ignores deposition outside SPB, dechlorination\nbeyond DDD or DDE, and e.g., mass loss associated with transformation\nof DDT to DDD and DDE. Prior estimates of offshore disposal are scant\nand rely heavily on the records of disposal volumes reported by Chartrand. 3.4 Implications for DDT Waste\nDisposal Practices\nand Environmental Contamination The extant spatial pattern\nof DDT in SPB provides useful insight as to the offshore disposal\nprocess as conducted by Cal Salvage starting in 1947 and allegedly\nterminating ca. 1961. Cal Salvage was alleged to have disposed of\nMontrose’s strong acid waste along with other wastes, e.g.,\nfrom oil refineries, by pumping the waste directly from a barge into\nthe surface water of the San Pedro Channel.  The spatial distributions of DDT and DDE in SPB\ncarry three important implications. First, the modern concept of a\nDDT disposal site is flawed. To our knowledge there were no permits\nor designated sites when Cal Salvage began disposing of Montrose’s\nwaste ca. 1947. Any dumpsite location was likely notional, operationally\ndefined and decoupled with the reality of bulk waste disposal from\na mobile platform or its subsequent environmental transport. Second,\ninferred transport of disposed DDT waste in the water column points\nto the likely possibility of transport outside of SPB and deposition\nto other settings. The extent to which such transport occurred is\nnot presently known, in part because prior regional sampling efforts\nhave focused on only surficial sediments shallower than 2 cm which\nare likely to miss the DDT-rich stratum associated with offshore disposal\nfrom the 1950′s.  Supplementary Material We would like to thank Senators Alex Padilla\nand the late\nDiane Feinstein for their support for this research including facilitating\nfederal financial support; Frank Kinnaman for logistical support;\nTina Treude for use of her coring system; the captain and crew of\nthe R/V Yellowfin Atlantis The Supporting Information\nis available free of charge at https://pubs.acs.org/doi/10.1021/acs.est.5c03851 Details on sediment density\nmeasurements; table of DDT\nfamily compounds quantified in this study; depth profiles of DDT,\nDDD, DDE, and DDX concentrations in each sediment core; contour maps\nof sediment accumulation thickness; spatial interpolation maps of\nDDT, DDD, DDE, and DDX isomer inventories; spatial autocorrelation\nof DDT, DDD, DDE, and DDX inventories ( PDF Individual sample and inventory data\n( XLSX Heatmaps\nof decadal time steps ( AVI This research\nwas supported by the National Oceanic and Atmospheric Administration\naward NOAA-NMFS-SW-2023-2007989 through subaward 309759-00001 from\nUC San Diego, National Oceanic and Atmospheric Administration award\nNA22OAR4690679 through subaward 313023-00001 from UC San Diego, State\nWater Resources Control Board award SCON-00005396 through the University\nof Southern California Sea Grant, and philanthropic support from the\nWebster Foundation and from an anonymous donor. Sediment dry density\nmeasurements were analyzed at the University of California, Santa\nBarbara, Materials Research Laboratory Shared Experimental Facilities,\nwhich are supported by the MRSEC Program of the NSF under award DMR\n2308708; a member of the NSF-funded Materials Research Facilities\nNetwork. J.T.S. received fellowship support from the Bentson Foundation. The authors declare\nno\ncompeting financial interest. Carson R. Silent Spring Houghton Milton Company Boston MA 1962 1 400 Fry D. M. Reproductive\nEffects in Birds Exposed to Pesticides and Industrial Chemicals Environ. Health Perspect. 1995 103 7 165 171 10.1289/ehp.95103s7165 PMC1518881 8593865 Ratcliffe D. A. Decrease\nin Eggshell Weight in Certain Birds of Prey Nature 1967 215 5097 208 210 10.1038/215208a0 6049131 Beard J. DDT and Human\nHealth Sci. Total Environ. 2006 355 1–3 78 89 10.1016/j.scitotenv.2005.02.022 15894351 Gulland F. M. D. Hall A. J. Ylitalo G. M. Colegrove K. M. Norris T. Duignan P. J. Halaska B. Acevedo\nWhitehouse K. Lowenstine L. J. Deming A. C. Rowles T. K. Persistent\nContaminants and Herpesvirus OtHV1 Are Positively Associated With\nCancer in Wild California Sea Lions (Zalophus Californianus) Front. Mar. Sci. 2020 7 602565 10.3389/fmars.2020.602565 Trego M. L. Hoh E. Whitehead A. Kellar N. M. Lauf M. Datuin D. O. Lewison R. L. Contaminant\nExposure Linked to Cellular and Endocrine\nBiomarkers in Southern California Bottlenose Dolphins Environ. Sci. Technol. 2019 53 7 3811 3822 10.1021/acs.est.8b06487 30852886 Cirillo P. M. La Merrill M. A. Krigbaum N. Y. Cohn B. A. Grandmaternal Perinatal\nSerum DDT in Relation to Granddaughter Early Menarche and Adult Obesity:\nThree Generations in the Child Health and Development Studies Cohort Cancer Epidemiol. Biomarkers Prev. 2021 30 8 1480 1488 10.1158/1055-9965.EPI-20-1456 33853850 PMC8338759 Cohn B. A. La Merrill M. Krigbaum N. Y. Yeh G. Park J.-S. Zimmermann L. Cirillo P. M. DDT Exposure in Utero and Breast\nCancer J. Clin. Endocrinol. Metab. 2015 100 8 2865 2872 10.1210/jc.2015-1841 26079774 PMC4524999 Schmidt J. T. Wu M. S. C. Kittner H. E. Arey J. S. Hammond D. E. Earth 182A Group Valentine D. L. Disentangling the History of Deep Ocean Disposal for\nDDT and Other Industrial Waste Off Southern California Environ. Sci. Technol. 2024 58 9 4346 4356 10.1021/acs.est.3c08575 38380834 PMC10919092 Kurek J. MacKeigan P. W. Veinot S. Mercer A. Kidd K. A. Ecological\nLegacy of DDT Archived in Lake Sediments from Eastern Canada Environ. Sci. Technol. 2019 53 13 7316 7325 10.1021/acs.est.9b01396 31187621 Dimond J. B. Owen R. B. Long-Term Residue\nof DDT Compounds in Forest Soils\nin Maine Environ. Pollut. 1996 92 2 227 230 10.1016/0269-7491(95)00059-3 15091403 U.S. EPA Region IX Final\nRemedial Investigation Report for the Montrose Superfund Site: Los\nAngeles, California 1998 I Chartrand A. B. Moy S. Safford A. N. Yoshimura T. Schinazi L. A. Ocean\nDumping Under\nLos Angeles Regional Water Quality Control Board Permit: A Review\nof Past Practices, Potential Adverse Impacts, and Recommendations\nfor Future Action California Regional Water\nQuality Control Board 1985 Southern California Ocean Disposal Site #2 Investigation U.S. Environmental Protection Agency https://www.epa.gov/ocean-dumping/southern-california-ocean-disposal-site-2-investigation Amendola G. A. Estimated Releases\nof DDT to Los Angeles County Sanitation District Sewerage System from\nMontrose Chemical Corporation of California 2000 77 No. CV 90-3122-R: Partial Consent Decree with Montrose Chemical Corporation\nof California, Aventis Cropscience USA, Inc., Chris-Craft Industries,\nInc., and Atkemix Thirty Seven, Inc. (Relating to Offshore Matters\nand Department of Justice Costs) 2001 1 52 Eganhouse R. P. DiFilippo E. Pontolillo J. Orem W. Hackley P. Edwards B. D. DDT and Related Compounds in Pore Water of Shallow\nSediments on the Palos Verdes Shelf, California, USA Mar. Chem. 2018 203 78 90 10.1016/j.marchem.2018.05.003 Liao C. Taylor A. R. Kenney W. F. Schlenk D. Gan J. Historical\nRecord and Fluxes of DDTs at Palos Verdes Shelf Superfund Site, California Sci. Total Environ. 2017 581–582 697 704 10.1016/j.scitotenv.2016.12.182 28082055 Zeng E. Y. Venkatesan M. I. Dispersion\nof Sediment DDTs in the Coastal Ocean off\nSouthern California Sci. Total Environ. 1999 229 195 208 10.1016/S0048-9697(99)00064-9 Eganhouse R. P. Pontolillo J. DDE in Sediments\nof the Palos Verdes Shelf, California:\nIn Situ Transformation Rates and Geochemical Fate Environ. Sci. Technol. 2008 42 17 6392 6398 10.1021/es7029619 18800506 Palos Verdes Shelf Superfund Site Remedial Investigation\nReport Completed;\nFeasibility Study Underway U.S. Environmental\nProtection Agency, Region 9 2008 https://nepis.epa.gov/Exe/ZyPURL.cgi?Dockey=P100ZU6R.txt Kivenson V. Lemkau K. L. Pizarro O. Yoerger D. R. Kaiser C. Nelson R. K. Carmichael C. Paul B. G. Reddy C. M. Valentine D. L. Ocean Dumping\nof Containerized DDT Waste Was a Sloppy\nProcess Environ. Sci. Technol. 2019 53 6 2971 2980 10.1021/acs.est.8b05859 30829032 Venkatesan M. I. Historical\nContamination in the Southern California Bight, Part II Organic Compounds National Oceanic\nand Atmospheric Administration 1998 Venkatesan M. I. Greene G. E. Ruth E. Chartrand A. B. DDTs and\nDumpsite in the Santa Monica Basin, California Sci. Total Environ. 1996 179 61 71 10.1016/0048-9697(96)90049-2 Stack M. E. Richardot W. H. Garcia R. Nguyen T. Choy C. A. Jensen P. R. Gutleben J. Dodder N. G. Aluwihare L. I. Hoh E. Identification of DDT+ in Deep Ocean\nSediment and Biota in the Southern\nCalifornia Bight Environ. Sci. Technol. Lett. 2024 11 479 484 10.1021/acs.estlett.4c00115 McGill L. Sleugh T. Petrik C. Schiff K. McLaughlin K. Aluwihare L. Semmens B. The Persistent DDT Footprint of Ocean\nDisposal, and Ecological Controls on Bioaccumulation in Fishes Proc. Natl. Acad. Sci. U. S. A. 2024 121 45 e2401500121 10.1073/pnas.2401500121 39467121 PMC11551384 Los Angeles Regional Water Pollution\nControl Board Resolution No. 61-43:\nPrescribing Requirements\nfor the Disposal of Industrial Waste: California Salvage Company,\nFile 60-28 1961 Office for Coastal Management Ocean\nDisposal Sites https://www.fisheries.noaa.gov/inport/item/54193/citation Sibson R. Chapter 2: A Brief\nDescription of Natural Neighbor Interpolation Interpolating Multivariate Data John Wiley\n& Sons, Inc. New York 1981 Zoro J. A. Hunter J. M. Eglinton G. Ware G. C. Degradation of p,p′-DDT\nin Reducing Environments Nature 1974 247 5438 235 237 10.1038/247235a0 4589577 Yu H.-Y. Bao L.-J. Liang Y. Zeng E. Y. Field Validation\nof Anaerobic Degradation Pathways for Dichlorodiphenyltrichloroethane\n(DDT) and 13 Metabolites in Marine Sediment Cores from China Environ. Sci. Technol. 2011 45 12 5245 5252 10.1021/es2006397 21595473 Fialips C. I. Cooper N. G. A. Jones D. M. White M. L. Gray N. D. Reductive\nDegradation of p,p′-DDT cy Fe­(II) in Nontronite NAu-2 Clays and Clay Minerals. 2010 58 6 821 836 10.1346/CCMN.2010.0580610 Eganhouse R. P. Sherwood C. R. Pontolillo J. Edwards B. D. Dickhudt P. J. Reductive\nDechlorination Rates of 4,4′-DDE (1-Chloro-4-[2,2-Dichloro-1-(4-Chlorophenyl)­Ethenyl]­Benzene)\nin Sediments of the Palos Verdes Shelf, CA Mar. Chem. 2018 203 10 21 10.1016/j.marchem.2017.12.005 McWilliams J. C. Damien P. Kessouri F. Circulation and Dispersal in California’s\nBorderland Basins Progress in Oceanography 2024 229 103349 10.1016/j.pocean.2024.103349 Valentine D. L. Fisher G. B. Bagby S. C. Nelson R. K. Reddy C. M. Sylva S. P. Woo M. A. Fallout\nPlume of Submerged Oil from\nDeepwater Horizon Proc. Natl. Acad. Sci. U.\nS. A. 2014 111 45 15906 15911 10.1073/pnas.1414873111 25349409 PMC4234598 Bagby S. C. Reddy C. M. Aeppli C. Fisher G. B. Valentine D. L. Persistence\nand Biodegradation of Oil at the Ocean Floor Following Deepwater Horizon Proc. Natl. Acad. Sci. U. S. A. 2017 114 1 E9 E18 10.1073/pnas.1610110114 27994146 PMC5224388 Schiff K. Greenstein D. Dodder N. Gillett D. J. Southern California\nBight Regional Monitoring Reg. Stud. Mar. Sci. 2016 4 34 46 10.1016/j.rsma.2015.09.003 Maruya K. A. Schiff K. The Extent and\nMagnitude of Sediment Contamination in the Southern California Bight Earth Science in the Urban Ocean: The Southern California\nContinental Borderland Geological Society\nof America 2009 10.1130/2009.2454(6.2) ",
  "metadata": {
    "Title of this paper": "The Extent and\nMagnitude of Sediment Contamination in the Southern California Bight",
    "Journal it was published in:": "Environmental Science & Technology",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12490018/"
  }
}