{
  "title": "Paper_642",
  "abstract": "Clin J Am Soc Nephrol Clin J Am Soc Nephrol 613 clinjasn CJASN Clinical Journal of the American Society of Nephrology : CJASN 1555-9041 1555-905X American Society of Nephrology PMC11469786 PMC11469786.1 11469786 11469786 39146034 10.2215/CJN.0000000000000523 CJASN-2024-000347 1 3 Clinical Research Chronic Kidney Disease Large Discordance between Creatinine-Based and Cystatin C–Based eGFRs is Associated with Falls, Hospitalizations, and Death in Older Adults https://orcid.org/0000-0001-6573-5401 Katz-Agranov Nurit  1 Rieu-Werden Meghan L.  2 https://orcid.org/0009-0000-8918-2418 Thacker Ayush  3 https://orcid.org/0000-0003-0872-0873 Lykken Jacquelyn M.  2 https://orcid.org/0000-0002-4327-9713 Sise Meghan E.  4 https://orcid.org/0000-0001-8400-6888 Shah Sachin J.  2  3 1 2 3 4 Correspondence: msise@mgb.org sshah@mgh.harvard.edu 10 2024 15 8 2024 19 10 472642 1275 1283 7 3 2024 12 8 2024 01 10 2025 01 10 2025 12 10 2024 01 10 2025 Copyright © 2024 by the American Society of Nephrology 2024 Visual Abstract Key Points  A large eGFR discordance ( i.e A large eGFR discordance was associated with increased risk of falls, hospitalization, and death, independent of kidney function. There are multiple ways to measure differences in creatinine and cystatin C; all produce similar associations with aging-related adverse outcomes. Background eGFR calculated using creatinine and cystatin C often differ in older adults. We hypothesized that older adults with cystatin C–based eGFR (eGFRcys) values significantly lower than creatinine-based eGFR (eGFRcr) values may have higher risk of aging-related adverse outcomes, independent of kidney function. Methods We conducted a longitudinal cohort study of adults 65 years and older from the Health and Retirement Study, a cohort of older American adults, to determine the relationship between eGFR discordance and aging-related adverse outcomes. We calculated eGFRcr and eGFRcys using baseline creatinine and cystatin C measurements. A large eGFR discordance was defined as eGFRcys >30% lower than eGFRcr. We assessed four aging-related adverse outcomes over a 2-year follow-up: falls, hip fractures, hospitalizations, and death. We fit separate multivariable regression models to determine the association between having a large eGFR discordance and each outcome adjusting for confounders, including kidney function. Results Of 5574 older adults, 1683 (30%) had a large eGFR discordance. Those with a large eGFR discordance were more likely to be older, female, and White. The prevalence of a large eGFR discordance increased with age, from 20% among those 65–69 years to 44% among those 80 years and older. Over a 2-year follow-up, there were 305 deaths (5.5%), 2013 falls (39.2%), 69 hip fractures (1.3%), and 1649 hospitalizations (32.2%). In adjusted analyses, large eGFR discordance was associated with a higher hazard ratio for death (hazard ratio, 1.43; 95% confidence interval [CI], 1.12 to 1.82) and significantly higher odds of falls (odds ratio, 1.32; 95% CI, 1.16 to 1.51) and hospitalizations (odds ratio, 1.32; 95% CI, 1.15 to 1.51). A large eGFR discordance was not associated with hip fractures. Conclusions In a large, nationally representative cohort of older adults, prevalence of eGFR discordance increased with age and was associated with higher risk of falls, hospitalization, and death, independent of kidney function. CKD creatinine GFR National Institute on Aging K76AG074919 Sachin J. Shah pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access no pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf no pmc-prop-has-supplement no pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes SDC T Read-along YES ",
  "metadata": {
    "Title of this paper": "Large Discordance between Creatinine-Based and Cystatin C–Based eGFRs is Associated with Falls, Hospitalizations, and Death in Older Adults",
    "Journal it was published in:": "Clinical Journal of the American Society of Nephrology : CJASN",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC11469786/"
  }
}