{
  "title": "Paper_337",
  "abstract": "pmc J Dent Sci J Dent Sci 3597 jds Journal of Dental Sciences 1991-7902 2213-8862 Association for Dental Sciences of the Republic of China PMC12485406 PMC12485406.1 12485406 12485406 41040554 10.1016/j.jds.2025.04.006 S1991-7902(25)00119-9 1 Original Article Beyond dental radiographs, a radiomics-based study for the classification of caries extension and depth Armogida Niccolò Giuseppe a † Angelone Francesca francesca.angelone@unina.it b ⁎ † Soltani Parisa a Esposito Luigi a Sansone Mario b Rengo Sandro a Amato Francesco b Rengo Carlo a Spagnuolo Gianrico gspagnuo@unina.it a c ⁎⁎ Ponsiglione Alfonso Maria b a b c ⁎ francesca.angelone@unina.it ⁎⁎ gspagnuo@unina.it † These authors contributed equally to this work. 10 2025 16 4 2025 20 4 498055 2353 2362 30 3 2025 6 4 2025 16 04 2025 02 10 2025 03 10 2025 © 2025 Association for Dental Sciences of the Republic of China. Publishing services by Elsevier B.Vé. 2025 Association for Dental Sciences of the Republic of China https://creativecommons.org/licenses/by-nc-nd/4.0/ This is an open access article under the CC BY-NC-ND license (http://creativecommons.org/licenses/by-nc-nd/4.0/). Background/purpose Traditional caries detection relies on visual and radiographic analysis. While deep learning has been applied to classify caries extent, no studies classify caries depth using radiomic features in intraoral photographic images. This study evaluated a radiomics-based approach with machine learning (ML) to classify caries extent and depth, traditionally assessed via radiographs, using intraoral photographs. Materials and methods Standardized intraoral photographs were taken with a Nikon D7500 and Macro Flash MF-R76. Only images of healthy teeth or carious lesions were included. Images were resized, segmented with Labelme, and classified using ICDAS and E-D scales. Data augmentation increased sample size. Radiomic features were extracted for each color channel using Pyradiomics. Feature selection methods (AUC-ROC, ReliefF, LASSO, backward selection) were applied within 5-fold cross-validation to prevent bias. ML classifiers (LDA, k-NN, SVM, NNET) evaluated accuracy, sensitivity, and specificity. Model explainability assessed feature influence via partial dependence plots, residual analysis, and break–down profile. Results NNET with backward selection achieved high accuracy (87.6%–95.4%). Sensitivity and specificity ranged from 61.5% to 93% and 73%–90%, respectively. Green and red channels significantly impacted predictions, with texture features being critical. The red channel's greater impact reflects its ability to mimic near-infrared light transillumination, enhancing contrast between healthy and decayed tissue. The blue channel had lesser influence, but combined RGB channels yielded the best accuracy. Conclusion Radiomics enables caries depth classification from intraoral photographs, offering a non-invasive, cost-effective alternative to radiographs. This approach could revolutionize diagnostics by reducing reliance on invasive radiological techniques, using accessible and affordable equipment. Keywords Machine learning Radiomics Dental caries Dental photography pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement yes pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes Introduction Machine learning (ML) is increasingly applied in dentistry, particularly in orthodontic analysis, 1 2 3 4 5 Traditional caries detection relies on visual examination and radiographic analysis. 6 , 7 8 Radiomics, widely used in medical imaging, extracts quantitative features related to texture, shape, and intensity, offering insights beyond human perception. 9 10 11 12 13 14 15 16 17 18 19 A breakthrough in dental healthcare could arise from leveraging AI to extract diagnostic information from digital photographs. This approach may enhance diagnostic efficiency, improve patient outcomes, and reduce reliance on radiological methods. Additionally, it could ensure the use of simple, affordable and technologically less complex devices, 20 This study highlighted AI's role in advancing non-invasive, high-precision dental diagnostics by demonstrating how radiomics and ML could extract diagnostic insights from intraoral photographs. Therefore, the aim of the study was multiple: (i) to evaluate the potential of radiomics and machine learning in dental diagnostics, with particular reference to caries classification; (ii) to demonstrate the feasibility of predicting caries depth directly from RGB images, without having to resort to X-ray images; (iii) to explain the clinical - physiological significance of the most predictive radiomic characteristics. Materials and methods The methodological workflow followed in this study is represented in Fig. 1 Figure 1 Methodological workflow. Figure 1 Imaging data This is a retrospective study. Images were acquired using a Nikon D7500 SLR camera with a Nikon Micro 105 mm lens (Nikon Corporation, Tokyo, Japan) and Macro Flash MF-R76 illumination (Neewer, Shenzhen, China). Before imaging, teeth were thoroughly cleaned and dried to ensure optimal visibility of caries lesions. Posterior teeth were imaged indirectly using intraoral mirrors (Reflect-Rhod; Hager & Werken, Duisburg, Germany), which were preheated to prevent condensation on the mirror surface during photography. Each image was captured at a resolution of 150 dpi with a color depth of 24 bits. Images were recorded in the sRGB color space, ensuring consistent color representation and facilitating accurate analysis of caries lesions. Bitewing radiographs were collected for each image in the dataset to assess and classify caries depth. Data pre-processing and segmentation Images were cropped, resized to 512 × 512 pixels, and carious lesions were manually segmented using Labelme tool (MIT Computer Science and Artificial Intelligence Laboratory, Cambridge, MA, USA), 21 active members 22 Fig. 2 Figure 2 Example of segmented images using Labelme tool. (A) Original cropped and resized image. (B) JPEG class label visualization. (C) Label PNG file (mask). Figure 2 Data augmentation Data augmentation was used to increase the sample size and balance the classes. Specifically, each image was rotated 90, 180, and 270° and flipped vertically and horizontally. It was then rotated and flipped simultaneously. Therefore, the dataset was increased by randomly selecting a balanced number of images in the augmented dataset belonging to each class that could balance the number of original images for each class. A total of 286 occlusal pictures of caries are obtained after data augmentation. Detailed information on the sample size are reported in Figures S1–S4 Radiomic features Per each image, 102 radiomic features were extracted for each of the three color channels (red (R), green (G), and blue (B)) using Pyradiomics, 23 24 Features selection To ensure that the resulting classification model is unbiased and generalizable to new data, the process of feature selection was included in the cross-validation. 25 , 26 27 , 28 27 , 29 27 , 30 27 As mentioned, to avoid bias in feature selection, the training set was divided into k = 5 folds of approximately equal size; the selection of the features and the subsequent classification took place on 4 folds while the performance evaluation was carried out on the held-out fold. A total of 25 features were used for training. Classification and performance evaluation An automatic classification between non-severe and severe carious lesions (ICDAS 3,4 VS ICDAS 5,6) and between deep and non-deep lesions (E1, E2, D1 VS D2, D3), whose distribution is reported in Fig. 2 To evaluate the performance, a 5-fold cross-validation with 100 repetitions was used, training and testing the data on the same sets of randomly chosen preliminary folds taking into account the data leakage due to data augmentation, to make appropriate comparisons. The metrics used to evaluate the classification performance were accuracy, sensitivity, and specificity. All analyses were performed in R, using the CARET package. 31 Explainable AI Explainability in ML is becoming increasingly important to help extract insights into how these algorithms behave and why one prediction is being made. 32 33 34 35 Results Table 1 Table 2 Table 1 Accuracy, sensitivity and specificity of classification on ICDAS classes. Table 1 NNET SVM KNN LDA Acc Sens Spec Acc Sens Spec Acc Sens Spec Acc Sens Spec Red Backward 0.92 0.92 0.92 0.92 0.91 0.91 0.91 0.91 0.91 0.91 0.91 0.91 Relief 0.92 0.92 0.92 0.91 0.90 0.90 0.92 0.92 0.92 0.91 0.90 0.90 LASSO 0.93 0.93 0.93 0.94 0.93 0.93 0.92 0.91 0.91 0.93 0.93 0.93 AUC 0.92 0.93 0.93 0.92 0.92 0.92 0.92 0.92 0.92 0.91 0.92 0.92 Green Backward 0.93 0.92 0.92 0.92 0.91 0.91 0.91 0.91 0.91 0.91 0.89 0.89 Relief 0.92 0.92 0.92 0.92 0.91 0.91 0.91 0.90 0.90 0.93 0.89 0.89 LASSO 0.94 0.92 0.92 0.93 0.92 0.92 0.93 0.91 0.91 0.91 0.92 0.92 AUC 0.93 0.93 0.93 0.92 0.91 0.91 0.92 0.90 0.91 0.90 0.90 0.90 Blue Backward 0.93 0.91 0.91 0.92 0.91 0.91 0.92 0.90 0.90 0.90 0.89 0.89 Relief 0.93 0.91 0.91 0.92 0.91 0.91 0.92 0.89 0.89 0.94 0.89 0.89 LASSO 0.94 0.92 0.92 0.93 0.92 0.92 0.93 0.91 0.91 0.91 0.92 0.92 AUC 0.92 0.91 0.91 0.92 0.91 0.91 0.92 0.90 0.90 0.92 0.89 0.89 RGB Backward 0.92 0.92 0.92 0.92 0.91 0.94 0.92 0.91 0.93 0.92 0.90 0.93 Relief 0.92 0.91 0.93 0.92 0.91 0.93 0.91 0.91 0.92 0.92 0.91 0.93 LASSO 0.93 0.92 0.93 0.93 0.93 0.94 0.93 0.92 0.94 0.93 0.93 0.93 AUC 0.92 0.93 0.92 0.92 0.92 0.93 0.91 0.91 0.92 0.91 0.90 0.91 Abbreviations: Acc, accuracy; Sens, sensitivity; Spec, specificity; ICDAS, International Caries Detection and Assessment System; NNET, neural network; SVM, support vector machine; KNN, k-nearest neighbor; LDA, linear discriminant analysis; AUC, area under the curve; LASSO, least absolute shrinkage and selection operator; Backward, backward feature elimination; Relief, relevance evaluation using ReliefF algorithm. Table 2 Accuracy, sensitivity and specificity of classification on E-D classes. Table 2 NNET SVM KNN LDA Acc Sens Spec Acc Sens Spec Acc Sens Spec Acc Sens Spec Red Backward 0.93 0.92 0.92 0.91 0.89 0.89 0.91 0.91 0.91 0.91 0.89 0.89 Relief 0.92 0.92 0.92 0.92 0.89 0.89 0.92 0.91 0.91 0.90 0.89 0.89 LASSO 0.93 0.92 0.92 0.93 0.92 0.92 0.92 0.90 0.90 0.94 0.92 0.92 AUC 0.93 0.92 0.92 0.93 0.91 0.91 0.92 0.92 0.92 0.92 0.91 0.91 Green Backward 0.92 0.90 0.90 0.91 0.88 0.88 0.91 0.89 0.89 0.89 0.87 0.87 Relief 0.92 0.90 0.90 0.91 0.89 0.89 0.91 0.88 0.88 0.89 0.86 0.86 LASSO 0.91 0.89 0.89 0.88 0.86 0.86 0.92 0.88 0.88 0.89 0.89 0.89 AUC 0.92 0.91 0.91 0.92 0.90 0.90 0.90 0.87 0.87 0.88 0.87 0.87 Blue Backward 0.92 0.89 0.89 0.92 0.88 0.88 0.91 0.86 0.86 0.91 0.88 0.88 Relief 0.92 0.89 0.89 0.92 0.88 0.88 0.91 0.86 0.86 0.91 0.87 0.87 LASSO 0.92 0.88 0.88 0.91 0.87 0.87 0.92 0.89 0.89 0.88 0.88 0.88 AUC 0.92 0.88 0.88 0.91 0.87 0.87 0.90 0.87 0.87 0.90 0.87 0.87 RGB Backward 0.93 0.92 0.94 0.92 0.90 0.94 0.92 0.90 0.94 0.90 0.88 0.93 Relief 0.93 0.92 0.94 0.92 0.90 0.94 0.92 0.90 0.93 0.90 0.87 0.93 LASSO 0.93 0.91 0.94 0.93 0.91 0.95 0.91 0.89 0.94 0.93 0.92 0.94 AUC 0.93 0.92 0.94 0.93 0.91 0.95 0.92 0.91 0.93 0.91 0.89 0.94 Abbreviations: Acc, accuracy; Sens, sensitivity; Spec, specificity; E-D, Enamel-Dentine scale; NNET, neural network; SVM, support vector machine; KNN, k-nearest neighbor; LDA, linear discriminant analysis; AUC, area under the curve; LASSO, least absolute shrinkage and selection operator; Backward, backward feature elimination; Relief, relevance evaluation using ReliefF algorithm. Based on the results obtained from testing the ML models with the different feature selection methods, a non-significant difference can be seen between the different color channels and the different models and feature selection methods. However, the NNET model with the Backward selection method offers comparable results in assessing the depth and extent of caries, therefore it was selected for further investigation into the explainability of this model. First, the impact of the color channels on the model's prediction was evaluated by defining the most important features of the model, shown in Fig. 3 Figure 3 Feature importance analysis for each color channel for ICDAS and E-D classes. For RGB color channels, the features are followed by x when they refer to the red channel and y when they refer to the green channel. Abbreviations: ICDAS, International Caries Detection and Assessment System; E-D, Enamel-Dentine scale; RGB, red green blue; GLCM, gray level co-occurrence matrix; GLSZM, gray level size zone matrix; NGTDM, neighbouring gray tone difference matrix; GLDM, gray level dependence matrix; GLRLM, gray level run length matrix. Figure 3 Once the most important features for each channel were taken, the PDPs could be visualized to show how these features influence the model's prediction. Fig. 4 Figure 4 Partial dependence plots for the most important feature for each color channel and the ICDAS and E-D classes. For RGB color channels the features are followed by x when they refer to the red channel and y when they refer to the green channel. Abbreviations: ICDAS, International Caries Detection and Assessment System; E-D, Enamel-Dentine scale; RGB, red green blue; GLCM, Gray level co-occurrence matrix; GLSZM, Gray level size zone matrix. Figure 4 A residual analysis was then carried out. Fig. 5 Fig. S5 Figure 5 Reverse cumulative distribution curves of absolute residuals (A) for E-D classes and (B) for ICDAS classes. Abbreviations: ICDAS, International Caries Detection and Assessment System; E-D, Enamel-Dentine scale; RGB, red green blue. Figure 5 As shown in Fig. 5 Fig. 6 Figure 6 Local explanations for a single observation of class 0 (less extensive or less deep) and 1 (more extensive or deeper) using Break Down profiles. For RGB color channels the features are followed by x, when they refer to the red channel, and y when they refer to the green channel. Abbreviations: RGB, red green blue; ICDAS, International Caries Detection and Assessment System; E-D, Enamel-Dentine scale. GLCM, gray level co-occurrence matrix; NGTDM, neighbouring gray tone difference matrix; GLDM, gray level dependence matrix. Figure 6 Discussion This study aims to classify dental caries' depth and extension on a set of intraoral photographic images, grouped by ICDAS and E-D classifications. Results show high model performance, with accuracy ranging from 88% to 94% and sensitivity and specificity reaching up to 95% (as from Table 1 Table 2 This is a particularly interesting result, especially for depth classification on the E-D scale that can be observed in clinical practice only from radiographs. Based on our knowledge, these findings represent a relevant step in moving towards RX-free based caries classification. Indeed, they confirm the promising role of radiomics in classifying caries depth starting from intraoral photographic images, thus paving the way to a new paradigm in intraoral diagnostics, which could be mostly based on photographic images without resorting to more invasive radiological methods. In this field, literature reports accuracy scores for caries extension ranging from 71% to 96% for intraoral photographs, 82%–99.2% for periapical radiographs, and 87.6%–95.4% for bitewing radiographs. Sensitivity and specificity for intraoral pictures range from 73% to 90% and 61.5%–93%, respectively. 6 , 8 To make the proposed application more trustworthy and clinically significant, this work also explores the potential of explainable AI algorithms to achieve more interpretable and informed decisions. Having chosen the NNET model with backward feature selection as optimal classification approach (accuracy ranging from 92% to 93%), the most important radiomics features have been listed (as from Fig. 3 The red channel's contrast (GLCM texture feature class), which measures local intensity variation (higher values indicating greater differences in neighboring pixel intensities), plays a key role in the ICDAS classification as an increase in contrast shifts the prediction towards class 0 (i.e., less severe caries: ICDAS 2–3). This can be due to the fact that moving towards higher wavelength, as it occurs in near-infrared transillumination, can improve the capability to distinguish carious from healthy tissues thanks to contrast enhancement. 36 Significant contributions are found also in the green channel features, with particular regard to the GLCM Difference Entropy (a measure of the variability in neighborhood intensity differences), which is among the most important predictors in both ICDAS and E-D classification. The higher the Entropy the higher the probability of belonging to class 0 (i.e., non-depth and less extensive caries). The same applies also to blue channel features, where Difference Entropy inversely correlates with ICDAS classification. Furthermore, in the blue channel, Maximum Probability also positively correlates with caries depth, determining E-D classification. Therefore, the more pairs of adjacent intensity values there are in the carious region, the greater the depth of the caries will be, as the prediction goes toward class 1. Clinically, blue lights are used to induce fluorescence to identify demineralized areas associated with carious lesions, relying on the different fluorescent properties of healthy and carious dental tissues when exposed to blue light, typically around 415 nm. Therefore, there is also clinical support for these findings. The RGB channels' analysis highlights first-order statistical features where the green channel's median intensity predicts less severe caries (ICDAS class 0), and the red channel's maximum intensity suggests deeper caries (E-D), aligning with clinical observations using near-infrared transillumination, in which decayed transilluminated teeth appear darker than healthy tissue. 37 Fig. 5 Then, considering the RGB case, a case-wise analysis was done to evaluate the local explanations of the individual observations. Observations of case 0 and case 1 were considered for ICDAS and E-D, and the Break Down profiles were evaluated as shown in Fig. 6 Looking at the local explanations for ICDAS classification, for the class 0 observation what has already been seen with the PDPs is confirmed, i.e. the negative prediction is more influenced by the median of the intensity values of the green channel and by the skewness of the intensity values on the red channel. For class 1 observation, however, the texture features on the red channel are more impactful, the Cluster Prominence which is a measure of the skewness and asymmetry of the GLCM, and the contrast in the NGTDM class, which is a measure of spatial intensity change, also dependent on the overall intensity level dynamic range. Looking at the local explanations for E-D classification, for class 0 the negative prediction is more influenced by the median of the intensity values of the green channel, as for the ICDAS classification. For class 1 observation what has already been seen with the PDPs is confirmed, i.e. the positive prediction is more influenced by the maximum of the intensity values of the red channel. Although this study provides new insights by using a radiomics approach for detecting caries in intraoral photographs, it does have some constraints. The quality and consistency of intraoral photographs can vary significantly, which might affect the model's accuracy. Standardizing imaging protocols could enhance reliability. In this study, we aimed to evaluate the performance of 150 dpi resolution images. Future research may explore the impact of higher-resolution images, carefully assessing their performance relative to increased data volume and computational demands. In addition, integrating radiomic approach into routine clinical practice requires not only technological adaptation but also training on larger and multicenter datasets. A validation on an external dataset is also necessary, but no available dataset, to our knowledge, presents a segmentation and labeling of lesions according to E-D scale. This study validates a radiomics approach using intraoral images to classify dental caries depth and extent, achieving up to 94% accuracy. Texture features, especially from the green and red channels, strongly influence predictions, while the blue channel has less impact. Key features affecting ICDAS values include contrast in the red channel and difference entropy in the green and blue channels, reflecting non-homogeneous lesions with dark shadows. For E-D classification, high gray level emphasis in the red channel and entropy-related features in green and blue channels correlate with lesion severity. Integrating RGB channels reduces residual errors, improving diagnostic accuracy. This innovative method allows the use of relatively inexpensive and less invasive equipment, making it highly suitable for wide application. Declaration of competing interest The authors declare that they have no conflict of interests. References 1 Patcas R. Bernini D.A.J. Volokitin A. Agustsson E. Rothe R. Timofte R. Applying artificial intelligence to assess the impact of orthognathic treatment on facial attractiveness and estimated age Int J Oral Maxillofac Surg 48 2019 77 83 30087062 10.1016/j.ijom.2018.07.010 2 Revilla-León M. Gómez-Polo M. Barmak A.B. Artificial intelligence models for diagnosing gingivitis and periodontal disease: a systematic review J Prosthet Dent 130 2023 816 824 35300850 10.1016/j.prosdent.2022.01.026 3 Bassani S. Santonicco N. Eccher A. Artificial intelligence in head and neck cancer diagnosis J Pathol Inf 13 2022 100153 10.1016/j.jpi.2022.100153 PMC9808017 36605112 4 Soltani P. Devlin H. Etemadi Sh M. Rengo C. Spagnuolo G. Baghaei K. Do metal artifact reduction algorithms influence the detection of implant-related injuries to the inferior alveolar canal in CBCT images? BMC Oral Health 24 2024 268 38395919 10.1186/s12903-024-04043-w PMC10885517 5 Mohammad-Rahimi H. Motamedian S.R. Rohban M.H. Deep learning for caries detection: a systematic review J Dent 122 2022 104115 10.1016/j.jdent.2022.104115 35367318 6 Ammar N. Kühnisch J. Diagnostic performance of artificial intelligence-aided caries detection on bitewing radiographs: a systematic review and meta-analysis Jpn Dent Sci Rev 60 2024 128 136 38450159 10.1016/j.jdsr.2024.02.001 PMC10917640 7 Kühnisch J. Meyer O. Hesenius M. Hickel R. Gruhn V. Caries detection on intraoral images using artificial intelligence J Dent Res 101 2022 158 165 34416824 10.1177/00220345211032524 PMC8808002 8 Moharrami M. Farmer J. Singhal S. Detecting dental caries on oral photographs using artificial intelligence: a systematic review Oral Dis 30 2024 1765 1783 37392423 10.1111/odi.14659 9 Ponsiglione A.M. Angelone F. Amato F. Sansone M. A statistical approach to assess the Robustness of radiomics features in the discrimination of mammographic lesions J Personalized Med 13 2023 1104 10.3390/jpm13071104 PMC10381882 37511717 10 Angelone F. Ciliberti F.K. Tobia G.P. Knee cartilage degradation in the medial and lateral anatomical compartments: a radiomics study 2024 IEEE international conference on metrology for eXtended reality, artificial intelligence and neural engineering (MetroXRAINE) 2024 183 188 11 Angelone F. Ponsiglione A.M. Ricciardi C. A machine learning approach for breast cancer risk prediction in digital mammography Appl Sci 14 2024 10315 12 Orlhac F. Nioche C. Klyuzhin I. Rahmim A. Buvat I. Radiomics in PET imaging: a practical guide for newcomers Pet Clin 16 2021 597 612 34537132 10.1016/j.cpet.2021.06.007 13 Schick U. Lucia F. Dissaux G. MRI-derived radiomics: methodology and clinical applications in the field of pelvic oncology Br J Radiol 92 2019 20190105 10.1259/bjr.20190105 PMC6913356 31538516 14 Aerts H.J. Velazquez E.R. Leijenaar R.T. Decoding tumour phenotype by noninvasive imaging using a quantitative radiomics approach Nat Commun 5 2024 4006 10.1038/ncomms5006 PMC4059926 24892406 15 Angelone F. Ponsiglione A.M. Belfiore M.P. Evaluation of breast density variability between right and left breasts Atti del Convegno Nazionale di Bioingegneria 2023 Patron Editore Srl 16 Gillies R.J. Kinahan P.E. Hricak H. Radiomics: images are more than pictures, they are data Radiology 278 2016 563 577 26579733 10.1148/radiol.2015151169 PMC4734157 17 Cantu A.G. Carrillo-Perez F. Morales J.O. Vargas L. AI-powered caries detection: analysis of oral photographs for early diagnosis J Dent Res 99 2020 123 130 18 Khan H. Rehman A. Ali S. Deep learning approaches for caries detection using oral images: a review Front Dent AI 2 2021 95 103 19 Lee J.H. Kim D.H. Jeong S.N. Choi S.H. Diagnosis and prediction of periodontally compromised teeth using a deep learning-based convolutional neural network algorithm J Periodontal Implant Sci 48 2018 114 123 29770240 10.5051/jpis.2018.48.2.114 PMC5944222 20 Angelone F. Ponsiglione A.M. Ricciardi C. Cesarelli G. Sansone M. Amato F. Diagnostic applications of intraoral scanners: a systematic review J Imaging 9 2023 134 37504811 10.3390/jimaging9070134 PMC10381333 21 Russell B.C. Torralba A. Murphy K.P. Freeman W.T. LabelMe: a database and web-based tool for image annotation Int J Comput Vis 77 2008 157 173 22 Gugnani N. Pandit I. Srivastava N. Gupta M. Sharma M. International Caries Detection and Assessment System (ICDAS): a new concept Int J Clin Pediatr Dent 4 2011 93 100 27672245 10.5005/jp-journals-10005-1089 PMC5030492 23 Van Griethuysen J.J. Fedorov A. Parmar C. Computational radiomics system to decode the radiographic phenotype Cancer Res 77 2017 e104 e107 29092951 10.1158/0008-5472.CAN-17-0339 PMC5672828 24 Zwanenburg A. Vallières M. Abdalah M.A. The image biomarker standardization initiative: standardized quantitative radiomics for high-throughput image-based phenotyping Radiology 295 2020 328 338 32154773 10.1148/radiol.2020191145 PMC7193906 25 Demircioğlu A. Measuring the bias of incorrect application of feature selection when using cross-validation in radiomics Insights Imaging 12 2021 172 34817740 10.1186/s13244-021-01115-1 PMC8613324 26 Heckman J.J. Sample selection bias as a specification error Econometrica 47 1979 153 161 27 Kuhn M. Johnson K. Applied predictive modeling 2013 Springer New York, NY 28 Wang R. Tang K. Feature selection for maximizing the area under the ROC curve 2009 IEEE international conference on data mining workshops 2009 400 405 29 Urbanowicz R.J. Meeker M. La Cava W. Olson R.S. Moore J.H. Relief-based feature selection: introduction and review J Biomed Informatics 85 2018 189 203 10.1016/j.jbi.2018.07.014 PMC6299836 30031057 30 Muthukrishnan R. Rohini R. LASSO: a feature selection technique in predictive modeling for machine learning 2016 IEEE international conference on advances in computer applications (ICACA) 2016 18 20 31 Kuhn M. Building predictive models in R using the caret package J Stat Software 28 2008 1 26 32 Saranya A. Subhashini R. A systematic review of explainable artificial intelligence models and applications: recent developments and future trends Decis Anal J 7 2023 100230 33 Friedman J.H. Greedy function approximation: a gradient boosting machine Ann Stat 29 2001 1189 1232 34 Biecek P. Burzykowski T. Explanatory model analysis: explore, explain, and examine predictive models 2021 Chapman and Hall/CRC New York 35 Biecek P. DALEX: explainers for complex predictive models in R J Mach Learn Res 19 2018 1 5 36 Ortiz M.I.G. de Melo Alencar C. De Paula B.L.F. Magno M.B. Maia L.C. Silva C.M. Accuracy of near-infrared light transillumination (NILT) compared to bitewing radiograph for detection of interproximal caries in the permanent dentition: a systematic review and meta-analysis J Dent 98 2020 103351 10.1016/j.jdent.2020.103351 32380136 37 Michou S. Lambach M.S. Ntovas P. Automated caries detection in vivo using a 3D intraoral scanner Sci Rep 11 2021 21276 10.1038/s41598-021-00259-w PMC8553860 34711853 Appendix A Supplementary data The following is the Supplementary data to this article: Multimedia component 1 Multimedia component 1 Acknowledgments This research work has been conducted in collaboration with Maipek s.r.l. (Naples, Italy). Special thanks to Raffaele Pelliccio at Maipek for supporting the study. Appendix A Supplementary data to this article can be found online at https://doi.org/10.1016/j.jds.2025.04.006 ",
  "metadata": {
    "Title of this paper": "Automated caries detection in vivo using a 3D intraoral scanner",
    "Journal it was published in:": "Journal of Dental Sciences",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12485406/"
  }
}