{
  "title": "Paper_80",
  "abstract": "pmc Sci Rep Sci Rep 1579 scirep Scientific Reports 2045-2322 Nature Publishing Group PMC12489082 PMC12489082.1 12489082 12489082 41034359 10.1038/s41598-025-20566-w 20566 1 Article Design of AI-driven microwave imaging for lung tumor monitoring Singh Adarsh 1 Paul Sandip 3 Gayen Sreetama 1 Mandal Bappaditya 2 Mitra Debasis 1 Augustine Robin robin.augustine@angstrom.uu.se 2 1 https://ror.org/02ytfzr55 grid.440667.7 0000 0001 2189 8604 Department of Electronics & Telecommunication Engineering, Indian Institute of Engineering Science and Technology, 2 https://ror.org/048a87296 grid.8993.b 0000 0004 1936 9457 Division of Solid State Electronics, Department of Electrical Engineering, Ångström Laboratory, Uppsala University, 3 grid.523930.e 0000 0004 9342 5613 Department of Electronics and Telecommunication Engineering, Kolaghat Government Polytechnic, 1 10 2025 2025 15 478255 34287 16 9 2024 15 9 2025 01 10 2025 03 10 2025 03 10 2025 © The Author(s) 2025 2025 https://creativecommons.org/licenses/by/4.0/ Open Access http://creativecommons.org/licenses/by/4.0/ The global incidence of lung diseases, particularly lung cancer, is increasing at an alarming rate, underscoring the urgent need for early detection, robust monitoring, and timely intervention. This study presents design aspects of an artificial intelligence (AI)-integrated microwave-based diagnostic tool for the early detection of lung tumors. The proposed method assimilates the prowess of machine learning (ML) tools with microwave imaging (MWI). A microwave unit containing eight antennas in the form of a wearable belt is employed for data collection from the CST body models. The data, collected in the form of scattering parameters, are reconstructed as 2D images. Two different ML approaches have been investigated for tumor detection and prediction of the size of the detected tumor. The first approach employs XGBoost models on raw S-parameters and the second approach uses convolutional neural networks (CNN) on the reconstructed 2-D microwave images. It is found that the XGBoost-based classifier with S-parameters outperforms the CNN-based classifier on reconstructed microwave images for tumor detection. Whereas a CNN-based model on reconstructed microwave images performs much better than an XGBoost-based regression model designed on the raw S-parameters for tumor size prediction. The performances of both of these models are evaluated on other body models to examine their generalization capacity over unknown data. This work explores the feasibility of a low-cost portable AI-integrated microwave diagnostic device for lung tumor detection, which eliminates the risk of exposure to harmful ionizing radiations of X-ray and CT scans. Keywords Microwave Imaging Lung Tumor AI XGBoost CNN Subject terms Health care Engineering Uppsala University Open access funding provided by Uppsala University. pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement no pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes issue-copyright-statement © Springer Nature Limited 2025 Introduction In recent times, advancements in biomedical research continue to shed light on complex health conditions that demand urgent attention. Respiratory disorders or lung diseases, in particular, have increased globally, highlighting the need for improved diagnostic and treatment strategies. The lung diseases include a variety of conditions that affect how the lungs work. These diseases can appear in different ways, making it harder for people to breathe and impacting their overall health. While the symptoms may seem similar to the flu, lung diseases are often much more serious and can lead to dangerous outcomes if not treated quickly. This makes early diagnosis very important to prevent serious complications 1 According to WHO 2 According to the mortality data provided by IARC 3 2 4 5 The current screening methods employed in medical practice, namely X-rays and CT scans, which are extensively utilized for the purpose of identifying lung tumors and other lung disorders, are associated with a number of drawbacks and limitations 6 Consequently, this renders the equipments unsuitable for continuous monitoring purposes. In the realm of disease detection, the utilization of microwave imaging techniques has emerged as a promising avenue for overcoming the limitations associated with conventional methods 7 8 9 A key focus of research in microwave imaging is its potential for tumor detection, particularly in the brain, breast, and lungs. While effective, traditional imaging techniques like mammography or MRI have limitations such as exposure to ionizing radiation, high costs, and limited accessibility in resource-constrained settings. Microwave imaging offers a promising alternative by being non-ionizing and less expensive while also providing high sensitivity to differences in tissue composition. This is particularly important for early-stage tumor detection, where minor changes in tissue properties may be difficult to detect with conventional methods. Despite these advantages, microwave imaging still faces several challenges, such as the relatively low resolution compared to conventional imaging techniques. Also, microwave wavelengths are larger than the fine anatomical structures being imaged, which can result in lower spatial resolution. Further, to address this issue, advanced signal processing algorithms and image reconstruction techniques are being developed to enhance the clarity and accuracy of MI results. Furthermore, different techniques like time-domain, frequency-domain, and machine learning-based algorithms have been introduced to improve image quality and diagnostic accuracy, particularly in distinguishing healthy tissue from tumors 10 Another limitation of MI is its sensitivity to noise and artifacts caused by factors like body movement or interference from surrounding tissues. Since microwave signals can be scattered or absorbed by different types of tissues, it becomes challenging to isolate the specific region of interest, such as a tumor or abnormal growth. Researchers are developing robust algorithms and sensor arrays to better handle these artifacts and improve the signal-to-noise ratio, making the technology more reliable for real-time diagnostics 11 12 Previously reported microwave imaging systems for lung disease detection have primarily been externally mounted and immobile, requiring patients to visit the hospital for examination, which can be inconvenient and less preferable. One such system, designed for non-invasive detection and monitoring of pulmonary edema, consists of two linear arrays, each with eight antennas embedded inside a hospital bed where the patient must lie down 13 14 The integration of microwave techniques and AI greatly improves disease detection by merging non-invasive imaging with advanced data analysis. Microwaves offer comprehensive tissue information, while AI algorithms enhance the identification of subtle irregularities, resulting in expedited and more precise diagnoses. This synergy accelerates decision-making based on AI-analyzed patterns from microwave data 15 16 17 This study explores the feasibility and design aspects of an AI-based microwave diagnostic system in the form of a wearable belt that can highlight lung tumors and categorize them into NSCLC stages. The proposed approach focuses on a wearable belt having eight antennas that will generate a 2D microwave image of the torso region. Recently, with the advancement of AI, numerous architectures have been developed. However, based on the nature of the data and the size of the dataset, two different ML approaches have been chosen to investigate their performance for tumor detection and estimating its size. One of them is an XGBoost-based model that works with the S-parameter data, and the second one uses convolutional neural networks (CNN) on the 2D reconstructed microwave images. Both of these models are optimized and tested for both of the tasks, tumor prediction, and tumor size estimation. It is found that an XGBoost-based classifier with S parameters outperforms a CNN-based classifier on reconstructed images for tumor detection. Whereas, a CNN-based model performs much better than an XGBoost-based regression model for tumor size prediction. The following section details lung cancer and its development, while the subsequent part outlines the proposed diagnostic system configuration, encompassing antenna placement, scattering parameter acquisition, and image reconstruction. Additionally, section 3 delves into the design and comparative study of machine-learning models used for tumor prediction. The major contribution of this work contains: Design of a wearable antenna configuration in the form of a wearable belt over a body model available in the simulation environment for microwave imaging and sensing for lung tumor detection. Design of an XGBoost-based classifier for the prediction of lung tumors from raw scattering parameters obtained from antenna configuration. Development of a CNN-based regression model to predict tumor size. Performance examination of both techniques on another body model available in the simulation environment for the generalization capacity of the models over unknown data. Fine-tuning of naive ML models for noisy data and their performance evaluation for real-world scenarios. Disease and its progression A lung tumor is an atypical proliferation of cellular matter, occurring within the pulmonary system. There are two types of tumors: benign, which are non-cancerous, and malignant, which are cancerous. There are two main types of malignant tumors: non-small cell lung cancer (NSCLC) and small cell lung cancer (SCLC). The NSCLC is the most prevalent form, shown in Fig. 1 18 Fig. 1 Non-small cell lung cancer (NSCLC): ( a b https://BioRender.com/kvwc9wn The progression of NSCLC can differ based on various factors, including the type of NSCLC, the stage at diagnosis, the treatment administered, and the unique characteristics of each patient. Here’s a brief overview of the progression of NSCLC: Stage 0 Early Stage (Stage I and II): 1 Locally Advanced Stage (Stage III): Metastatic Stage (Stage IV): Table 1 The stages and corresponding sizes of early-stage tumors. Stage IA IB IIA IIB Size (mm) \\documentclass[12pt]{minimal}\n\t\t\t\t\\usepackage{amsmath}\n\t\t\t\t\\usepackage{wasysym} \n\t\t\t\t\\usepackage{amsfonts} \n\t\t\t\t\\usepackage{amssymb} \n\t\t\t\t\\usepackage{amsbsy}\n\t\t\t\t\\usepackage{mathrsfs}\n\t\t\t\t\\usepackage{upgreek}\n\t\t\t\t\\setlength{\\oddsidemargin}{-69pt}\n\t\t\t\t\\begin{document}$$\\le 30$$\\end{document} >30 & <40 >40 & <50 \\documentclass[12pt]{minimal}\n\t\t\t\t\\usepackage{amsmath}\n\t\t\t\t\\usepackage{wasysym} \n\t\t\t\t\\usepackage{amsfonts} \n\t\t\t\t\\usepackage{amssymb} \n\t\t\t\t\\usepackage{amsbsy}\n\t\t\t\t\\usepackage{mathrsfs}\n\t\t\t\t\\usepackage{upgreek}\n\t\t\t\t\\setlength{\\oddsidemargin}{-69pt}\n\t\t\t\t\\begin{document}$$>50$$\\end{document} Equivalent Radius (mm) \\documentclass[12pt]{minimal}\n\t\t\t\t\\usepackage{amsmath}\n\t\t\t\t\\usepackage{wasysym} \n\t\t\t\t\\usepackage{amsfonts} \n\t\t\t\t\\usepackage{amssymb} \n\t\t\t\t\\usepackage{amsbsy}\n\t\t\t\t\\usepackage{mathrsfs}\n\t\t\t\t\\usepackage{upgreek}\n\t\t\t\t\\setlength{\\oddsidemargin}{-69pt}\n\t\t\t\t\\begin{document}$$\\le 15$$\\end{document} >15& <20 >20 &<25 \\documentclass[12pt]{minimal}\n\t\t\t\t\\usepackage{amsmath}\n\t\t\t\t\\usepackage{wasysym} \n\t\t\t\t\\usepackage{amsfonts} \n\t\t\t\t\\usepackage{amssymb} \n\t\t\t\t\\usepackage{amsbsy}\n\t\t\t\t\\usepackage{mathrsfs}\n\t\t\t\t\\usepackage{upgreek}\n\t\t\t\t\\setlength{\\oddsidemargin}{-69pt}\n\t\t\t\t\\begin{document}$$>25$$\\end{document} Generally, surgery is not a possibility for advanced stages such as III or IV lung cancers. Therefore, early detection becomes the most appropriate course of action for preventing lung cancer from going into higher stages. Even with treatment, there are instances where NSCLC may reoccur following an initial response or period of remission. Recurrence can manifest either in the lungs or in other parts of the body. Therefore, it is crucial to maintain continuous or regular assessment following treatment. Overall, the development of NSCLC can be intricate, and the strategies for treatment may differ depending on personal circumstances. Ensuring early diagnosis, accurate staging, tailored therapeutic strategies, and consistent post-treatment monitoring are crucial in enhancing the results and the well-being of individuals with NSCLC. Due to high water content, the dielectric properties, specifically the relative permittivity and conductivity, of tumors are much higher compared to the surrounding tissues, as demonstrated in Fig. 2 Fig. 2 Cross-sectional views of available body model in CST Studio Suite 19 a b 20 21 Methodology The proposed system for detection of lung tumors and predicting their severity stages (as shown in Fig. 3 Fig. 3 Proposed methodology for detection of lung tumors and predicting their severity stages. Fig. 4 Flowchart for ( a b Microwave sensing and imaging subsystem The proposed microwave imaging system for lung tumor detection employs a sensor unit (eight antennas in the form of a wearable belt), a data collection unit (Vector network analyzer, and RF switching matrix), and a frequency-based imaging algorithm 14 22 23 4 Fig. 5 Proposed imaging subsystem: placement of antennas in the simulation environment (CST Studio Suite 19 a b c The microwave image resolution is intricately dependent on several factors, such as the number of antennas utilized, the range of broadband frequencies covered, and the density of sampled frequency points. Each of these components has a vital function in determining the accuracy and sharpness of the resulting image. When evaluating the number of antennas, it is crucial to recognize the delicate equilibrium between improving resolution and handling system complexity. In this context, for cost-effective or portable solutions, fewer antennas with machine learning-based processing can be a more accurate and practical alternative. In the proposed work, a strategic decision has been made to employ a configuration featuring eight antennas. With this, the system strikes a balance, enabling it to capture sufficient spatial information while remaining practical in terms of limited mutual coupling between antennas, hardware integration in the form of the belt, and computational requirements. Furthermore, the choice of employing broadband operating frequency (1.5 to 3 GHz) is instrumental in ensuring versatility and adaptability in image capture. By operating across a broad frequency spectrum, the system can gather a diverse range of information, enriching the final image with comprehensive insights and details. This particular frequency range (1.5 to 3 GHz) offers an optimal balance between penetration depth and resolution 24 25 26 5 Field distributions shown in Fig. 6 6 Fig. 6 Field distributions of antenna element placed on the front side of chest: ( a b c 19 There are two major concerns for the detection and size prediction; firstly, dealing with the error due to measurement and ambient noise; secondly, the error incurred by placement of the antenna belt far from the actual tumor location, which is generally unknown. To mitigate these issues, multiple measurements should be taken from different antenna positions. In Fig. 7 7 One significant step in the proposed methodology is the pre-processing of the collected data from microwave sensors (antenna system) and reconstruction of a microwave image by a frequency-based imaging algorithm (as shown in Fig. 4 27 14 \\documentclass[12pt]{minimal}\n\t\t\t\t\\usepackage{amsmath}\n\t\t\t\t\\usepackage{wasysym} \n\t\t\t\t\\usepackage{amsfonts} \n\t\t\t\t\\usepackage{amssymb} \n\t\t\t\t\\usepackage{amsbsy}\n\t\t\t\t\\usepackage{mathrsfs}\n\t\t\t\t\\usepackage{upgreek}\n\t\t\t\t\\setlength{\\oddsidemargin}{-69pt}\n\t\t\t\t\\begin{document}$$N_a$$\\end{document} \\documentclass[12pt]{minimal}\n\t\t\t\t\\usepackage{amsmath}\n\t\t\t\t\\usepackage{wasysym} \n\t\t\t\t\\usepackage{amsfonts} \n\t\t\t\t\\usepackage{amssymb} \n\t\t\t\t\\usepackage{amsbsy}\n\t\t\t\t\\usepackage{mathrsfs}\n\t\t\t\t\\usepackage{upgreek}\n\t\t\t\t\\setlength{\\oddsidemargin}{-69pt}\n\t\t\t\t\\begin{document}$$N_f$$\\end{document} 8 7 8 19 28 Fig. 7 ( a 19 b c Machine learning subsystem for tumor prediction The aim of the designed ML subsystem is twofold: first, to detect whether a tumor is present or not (framed as a classification problem), and second, to predict the size of the tumor. These two tasks are considered separately because the tumor size can be estimated accurately if the tumor lies close to the plane of the antenna belt. If the belt is placed at a location much higher or lower than the position of the tumor, the S parameters are diminished in amplitude, which hinders the accurate prediction of tumor size, but still can infer the presence or absence of a tumor. Two approaches have been investigated for this purpose: one is based on the raw S-parameters obtained from the antenna system, and the second one takes into account the reconstructed microwave images. The designed models are trained and tested on simulation dataset. Their generalization capacity is tested on a separate dataset that contains previously unseen data obtained from a different body model. In the next section, the performance of the two types of ML models is discussed in detail. Investigation and design of appropriate ML models Three sets of simulations were performed for experimentation. The first set contains a total of 140 readings (70 for each lung, i.e., 70 simulations for tumors of different sizes in each lung) obtained from Gustav’s (male) body model, corresponding to various tumor sizes varying from 2 mm to 60 mm; such that the tumor is placed at the axis of the antenna belt. The set of simulations will be referred to as Simulation-A in future references. In the second set, 20 simulations are conducted on Gustav for various tumor sizes (10 for each lung), where the position of the tumor is higher or lower than the antenna belt. This simulation will be called as Simulation-B. Simulation B is required to examine the change of S parameters of the tumor located away from the plane of the antenna belt. The final set of simulations, referred to as Simulation C, contains 10 readings from the Donna (female) body model that are used to measure the generalization capacity of the trained ML models on the unseen data. Fig. 8 Reconstructed images from MWI for varying tumor sizes in increasing order: ( a e f j XGBoost model over the raw scattering parameters All the S parameters (amplitude and phase) of the 8-antenna system are recorded for 500 frequency points over a range of 0.5 GHz to 3.5 GHz. Thus, for a particular tumor size, the raw S-parameter data dimension is 500 \\documentclass[12pt]{minimal}\n\t\t\t\t\\usepackage{amsmath}\n\t\t\t\t\\usepackage{wasysym} \n\t\t\t\t\\usepackage{amsfonts} \n\t\t\t\t\\usepackage{amssymb} \n\t\t\t\t\\usepackage{amsbsy}\n\t\t\t\t\\usepackage{mathrsfs}\n\t\t\t\t\\usepackage{upgreek}\n\t\t\t\t\\setlength{\\oddsidemargin}{-69pt}\n\t\t\t\t\\begin{document}$$\\times$$\\end{document} \\documentclass[12pt]{minimal}\n\t\t\t\t\\usepackage{amsmath}\n\t\t\t\t\\usepackage{wasysym} \n\t\t\t\t\\usepackage{amsfonts} \n\t\t\t\t\\usepackage{amssymb} \n\t\t\t\t\\usepackage{amsbsy}\n\t\t\t\t\\usepackage{mathrsfs}\n\t\t\t\t\\usepackage{upgreek}\n\t\t\t\t\\setlength{\\oddsidemargin}{-69pt}\n\t\t\t\t\\begin{document}$$S_{11}$$\\end{document} \\documentclass[12pt]{minimal}\n\t\t\t\t\\usepackage{amsmath}\n\t\t\t\t\\usepackage{wasysym} \n\t\t\t\t\\usepackage{amsfonts} \n\t\t\t\t\\usepackage{amssymb} \n\t\t\t\t\\usepackage{amsbsy}\n\t\t\t\t\\usepackage{mathrsfs}\n\t\t\t\t\\usepackage{upgreek}\n\t\t\t\t\\setlength{\\oddsidemargin}{-69pt}\n\t\t\t\t\\begin{document}$$S_{11}$$\\end{document} \\documentclass[12pt]{minimal}\n\t\t\t\t\\usepackage{amsmath}\n\t\t\t\t\\usepackage{wasysym} \n\t\t\t\t\\usepackage{amsfonts} \n\t\t\t\t\\usepackage{amssymb} \n\t\t\t\t\\usepackage{amsbsy}\n\t\t\t\t\\usepackage{mathrsfs}\n\t\t\t\t\\usepackage{upgreek}\n\t\t\t\t\\setlength{\\oddsidemargin}{-69pt}\n\t\t\t\t\\begin{document}$$S_{12}$$\\end{document} \\documentclass[12pt]{minimal}\n\t\t\t\t\\usepackage{amsmath}\n\t\t\t\t\\usepackage{wasysym} \n\t\t\t\t\\usepackage{amsfonts} \n\t\t\t\t\\usepackage{amssymb} \n\t\t\t\t\\usepackage{amsbsy}\n\t\t\t\t\\usepackage{mathrsfs}\n\t\t\t\t\\usepackage{upgreek}\n\t\t\t\t\\setlength{\\oddsidemargin}{-69pt}\n\t\t\t\t\\begin{document}$$S_{12}$$\\end{document} A very effective algorithm, named XGBoost, has been employed to process the S-parameter data and make predictions about the presence of the tumor or about its size. XGBoost (Extreme Gradient Boosting) 29 30 32 XGBoost for tumor detection An XGBoost classifier is designed to predict the presence of a tumor. This is a binary classifier that differentiates the absence of a tumor or very small tumor of size \\documentclass[12pt]{minimal}\n\t\t\t\t\\usepackage{amsmath}\n\t\t\t\t\\usepackage{wasysym} \n\t\t\t\t\\usepackage{amsfonts} \n\t\t\t\t\\usepackage{amssymb} \n\t\t\t\t\\usepackage{amsbsy}\n\t\t\t\t\\usepackage{mathrsfs}\n\t\t\t\t\\usepackage{upgreek}\n\t\t\t\t\\setlength{\\oddsidemargin}{-69pt}\n\t\t\t\t\\begin{document}$$<=8mm$$\\end{document} \\documentclass[12pt]{minimal}\n\t\t\t\t\\usepackage{amsmath}\n\t\t\t\t\\usepackage{wasysym} \n\t\t\t\t\\usepackage{amsfonts} \n\t\t\t\t\\usepackage{amssymb} \n\t\t\t\t\\usepackage{amsbsy}\n\t\t\t\t\\usepackage{mathrsfs}\n\t\t\t\t\\usepackage{upgreek}\n\t\t\t\t\\setlength{\\oddsidemargin}{-69pt}\n\t\t\t\t\\begin{document}$$>8mm$$\\end{document} Dataset construction: class imbalance 33 undersampling oversampling 34 Construction and training of classifiers: \\documentclass[12pt]{minimal}\n\t\t\t\t\\usepackage{amsmath}\n\t\t\t\t\\usepackage{wasysym} \n\t\t\t\t\\usepackage{amsfonts} \n\t\t\t\t\\usepackage{amssymb} \n\t\t\t\t\\usepackage{amsbsy}\n\t\t\t\t\\usepackage{mathrsfs}\n\t\t\t\t\\usepackage{upgreek}\n\t\t\t\t\\setlength{\\oddsidemargin}{-69pt}\n\t\t\t\t\\begin{document}$$2 \\hspace{0.1 cm}\\text {(amplitude and phase)} \\times 64 \\hspace{0.1 cm} \\text {(S-parameters)} \\times 500 \\hspace{0.1 cm}\\text {(frequency points)}$$\\end{document} During training, 80% of the dataset is used as a training set and 20% is used as a test set. The classifier is designed using Python’s XGBoost package 35 grid search \\documentclass[12pt]{minimal}\n\t\t\t\t\\usepackage{amsmath}\n\t\t\t\t\\usepackage{wasysym} \n\t\t\t\t\\usepackage{amsfonts} \n\t\t\t\t\\usepackage{amssymb} \n\t\t\t\t\\usepackage{amsbsy}\n\t\t\t\t\\usepackage{mathrsfs}\n\t\t\t\t\\usepackage{upgreek}\n\t\t\t\t\\setlength{\\oddsidemargin}{-69pt}\n\t\t\t\t\\begin{document}$$n\\_estimators$$\\end{document} \\documentclass[12pt]{minimal}\n\t\t\t\t\\usepackage{amsmath}\n\t\t\t\t\\usepackage{wasysym} \n\t\t\t\t\\usepackage{amsfonts} \n\t\t\t\t\\usepackage{amssymb} \n\t\t\t\t\\usepackage{amsbsy}\n\t\t\t\t\\usepackage{mathrsfs}\n\t\t\t\t\\usepackage{upgreek}\n\t\t\t\t\\setlength{\\oddsidemargin}{-69pt}\n\t\t\t\t\\begin{document}$$max\\_depth$$\\end{document} eta = 0.3, which is the learning rate. subsample = 0.5, which specifies the proportion of training data considered for constructing the tree. Table 2 Predicted tumor sizes by the XGBoost Regression model, CNN over intensity MW image. Actual Tumor Radius (mm) XGBoost CNN on MSI 17.2 17.7 17.0 13.2 12.8 12.6 4.8 6.20 5.6 13.6 13.34 12.7 11.6 13.10 12.1 8.8 9.72 10.1 20.8 18.23 19.7 12.4 12.3 11.8 21.6 23.0 21.2 6.0 5.78 5.6 XGBoost for tumor size prediction The raw S-parameters obtained from Simulation A (i.e., 140 simulations on Gustav’s body model with the tumor residing on the plane of the antenna belt) are used to predict the size of the tumor. Each data point consists of 128 S-parameter readings (amplitude and phase) taken for 500 frequency points over the range of 0.5 GHz to 3.5 GHz. Before feeding the data to the XGBoost regression model, each S-parameter (amplitude and frequency) is averaged over the operating frequency range of 1.5 - 3 GHz, where the distinction is more prominent. Thus, corresponding to each tumor size, a vector of 128 S-parameter values (amplitude and phase) is obtained. Unlike the XGBoost classifier, in the case of designing the regression model, there is no requirement for dataset balancing since the input data is almost evenly distributed. Construction and training of regression model: \\documentclass[12pt]{minimal}\n\t\t\t\t\\usepackage{amsmath}\n\t\t\t\t\\usepackage{wasysym} \n\t\t\t\t\\usepackage{amsfonts} \n\t\t\t\t\\usepackage{amssymb} \n\t\t\t\t\\usepackage{amsbsy}\n\t\t\t\t\\usepackage{mathrsfs}\n\t\t\t\t\\usepackage{upgreek}\n\t\t\t\t\\setlength{\\oddsidemargin}{-69pt}\n\t\t\t\t\\begin{document}$$80\\%$$\\end{document} \\documentclass[12pt]{minimal}\n\t\t\t\t\\usepackage{amsmath}\n\t\t\t\t\\usepackage{wasysym} \n\t\t\t\t\\usepackage{amsfonts} \n\t\t\t\t\\usepackage{amssymb} \n\t\t\t\t\\usepackage{amsbsy}\n\t\t\t\t\\usepackage{mathrsfs}\n\t\t\t\t\\usepackage{upgreek}\n\t\t\t\t\\setlength{\\oddsidemargin}{-69pt}\n\t\t\t\t\\begin{document}$$20\\%$$\\end{document} \\documentclass[12pt]{minimal}\n\t\t\t\t\\usepackage{amsmath}\n\t\t\t\t\\usepackage{wasysym} \n\t\t\t\t\\usepackage{amsfonts} \n\t\t\t\t\\usepackage{amssymb} \n\t\t\t\t\\usepackage{amsbsy}\n\t\t\t\t\\usepackage{mathrsfs}\n\t\t\t\t\\usepackage{upgreek}\n\t\t\t\t\\setlength{\\oddsidemargin}{-69pt}\n\t\t\t\t\\begin{document}$$n\\_estimators$$\\end{document} \\documentclass[12pt]{minimal}\n\t\t\t\t\\usepackage{amsmath}\n\t\t\t\t\\usepackage{wasysym} \n\t\t\t\t\\usepackage{amsfonts} \n\t\t\t\t\\usepackage{amssymb} \n\t\t\t\t\\usepackage{amsbsy}\n\t\t\t\t\\usepackage{mathrsfs}\n\t\t\t\t\\usepackage{upgreek}\n\t\t\t\t\\setlength{\\oddsidemargin}{-69pt}\n\t\t\t\t\\begin{document}$$max\\_depth$$\\end{document} eta = 0.3, subsample = 0.5, Performance on the Test Set: test set 2 p CNN-based model over microwave images reconstructed from S parameters Convolutional Neural Networks (CNN) are widely used in image-based tasks in deep learning 36 38 \\documentclass[12pt]{minimal}\n\t\t\t\t\\usepackage{amsmath}\n\t\t\t\t\\usepackage{wasysym} \n\t\t\t\t\\usepackage{amsfonts} \n\t\t\t\t\\usepackage{amssymb} \n\t\t\t\t\\usepackage{amsbsy}\n\t\t\t\t\\usepackage{mathrsfs}\n\t\t\t\t\\usepackage{upgreek}\n\t\t\t\t\\setlength{\\oddsidemargin}{-69pt}\n\t\t\t\t\\begin{document}$$634 \\times 496$$\\end{document} CNN model for tumor detection The CNN-based classifier is designed using the datasets from Simulation A and Simulation B. As described in section 4.1 Fig. 9 ( a b Network design and Training: \\documentclass[12pt]{minimal}\n\t\t\t\t\\usepackage{amsmath}\n\t\t\t\t\\usepackage{wasysym} \n\t\t\t\t\\usepackage{amsfonts} \n\t\t\t\t\\usepackage{amssymb} \n\t\t\t\t\\usepackage{amsbsy}\n\t\t\t\t\\usepackage{mathrsfs}\n\t\t\t\t\\usepackage{upgreek}\n\t\t\t\t\\setlength{\\oddsidemargin}{-69pt}\n\t\t\t\t\\begin{document}$$80\\%$$\\end{document} \\documentclass[12pt]{minimal}\n\t\t\t\t\\usepackage{amsmath}\n\t\t\t\t\\usepackage{wasysym} \n\t\t\t\t\\usepackage{amsfonts} \n\t\t\t\t\\usepackage{amssymb} \n\t\t\t\t\\usepackage{amsbsy}\n\t\t\t\t\\usepackage{mathrsfs}\n\t\t\t\t\\usepackage{upgreek}\n\t\t\t\t\\setlength{\\oddsidemargin}{-69pt}\n\t\t\t\t\\begin{document}$$400 \\times 400$$\\end{document} 9 9 CNN model for tumor size prediction The aim of this model is to utilize the reconstructed S-parameter images to predict the size of lung tumors. However, more accurate size prediction is expected if the tumor is situated very closely to the plane of the antenna belt. Data augmentation: 10 Fig. 10 Different augmentation schemes on dataset: ( a b c d \\documentclass[12pt]{minimal}\n\t\t\t\t\\usepackage{amsmath}\n\t\t\t\t\\usepackage{wasysym} \n\t\t\t\t\\usepackage{amsfonts} \n\t\t\t\t\\usepackage{amssymb} \n\t\t\t\t\\usepackage{amsbsy}\n\t\t\t\t\\usepackage{mathrsfs}\n\t\t\t\t\\usepackage{upgreek}\n\t\t\t\t\\setlength{\\oddsidemargin}{-69pt}\n\t\t\t\t\\begin{document}$$180^{\\circ }$$\\end{document} Model and training: 11 11 Performance on the test set: 2 t-test Fig. 11 CNN model: ( a b Comparative discussion and ultimate model selection  Over the Gustav body-model simulation data, i.e., Simulation-A, the XGBoost classifier on the S-parameter data gives better accuracy than the CNN-based classifier on reconstructed MW images for tumor detection. Whereas, for the size-prediction task, the CNN-based regression model performs better than the XGBoost regressor (as can be seen in Fig. 12 The CNN-based regression model works on the reconstructed microwave images. Image data offers many methods for data augmentation, like rotation, flip, etc, which can not be applied over the raw S-parameters. Hence, the effective size of the training dataset can be increased by augmentation in the case of image data. This dataset augmentation is not applicable to the case of collected raw S-parameters. Thus, the CNN-based regression model is trained over a larger dataset as compared to the XGBoost model for the same collected dataset. For this reason, CNNs offer better generalization than the XGBoost model in the regression task for tumor size prediction. Hence, in the actual workflow, as shown in Fig. 4 Fine-tuning the designed ML models for robustness against Noise The aforementioned XGBoost classifier and CNN-based regression models have been trained on a simulated dataset, which is noiseless. However, in the actual scenario, noise is unavoidable. The added noise alters the actual data and may affect the performance of the ML models. One way to eliminate the problem is to make them robust against noise by fine-tuning them with an additional noisy version of the simulation dataset. During the fine-tuning, the previously trained (on noiseless simulation data) models are taken, and they are passed through additional training iterations with the newly constructed noise-infused dataset. This will alter the parameters of the trained model and make it adept to the noisy data. For constructing the training set during fine-tuning, \\documentclass[12pt]{minimal}\n\t\t\t\t\\usepackage{amsmath}\n\t\t\t\t\\usepackage{wasysym} \n\t\t\t\t\\usepackage{amsfonts} \n\t\t\t\t\\usepackage{amssymb} \n\t\t\t\t\\usepackage{amsbsy}\n\t\t\t\t\\usepackage{mathrsfs}\n\t\t\t\t\\usepackage{upgreek}\n\t\t\t\t\\setlength{\\oddsidemargin}{-69pt}\n\t\t\t\t\\begin{document}$$50\\%$$\\end{document} \\documentclass[12pt]{minimal}\n\t\t\t\t\\usepackage{amsmath}\n\t\t\t\t\\usepackage{wasysym} \n\t\t\t\t\\usepackage{amsfonts} \n\t\t\t\t\\usepackage{amssymb} \n\t\t\t\t\\usepackage{amsbsy}\n\t\t\t\t\\usepackage{mathrsfs}\n\t\t\t\t\\usepackage{upgreek}\n\t\t\t\t\\setlength{\\oddsidemargin}{-69pt}\n\t\t\t\t\\begin{document}$$1\\%$$\\end{document} \\documentclass[12pt]{minimal}\n\t\t\t\t\\usepackage{amsmath}\n\t\t\t\t\\usepackage{wasysym} \n\t\t\t\t\\usepackage{amsfonts} \n\t\t\t\t\\usepackage{amssymb} \n\t\t\t\t\\usepackage{amsbsy}\n\t\t\t\t\\usepackage{mathrsfs}\n\t\t\t\t\\usepackage{upgreek}\n\t\t\t\t\\setlength{\\oddsidemargin}{-69pt}\n\t\t\t\t\\begin{document}$$5\\%$$\\end{document} \\documentclass[12pt]{minimal}\n\t\t\t\t\\usepackage{amsmath}\n\t\t\t\t\\usepackage{wasysym} \n\t\t\t\t\\usepackage{amsfonts} \n\t\t\t\t\\usepackage{amssymb} \n\t\t\t\t\\usepackage{amsbsy}\n\t\t\t\t\\usepackage{mathrsfs}\n\t\t\t\t\\usepackage{upgreek}\n\t\t\t\t\\setlength{\\oddsidemargin}{-69pt}\n\t\t\t\t\\begin{document}$$10\\%$$\\end{document} incremental learning 39 40 For estimation of the performance of the fine-tuned models in comparison to the naive models, an additional test set is generated by taking 20 datapoints from the subset of simulation A, which was not used for fine-tuning, and then each datapoint is altered by \\documentclass[12pt]{minimal}\n\t\t\t\t\\usepackage{amsmath}\n\t\t\t\t\\usepackage{wasysym} \n\t\t\t\t\\usepackage{amsfonts} \n\t\t\t\t\\usepackage{amssymb} \n\t\t\t\t\\usepackage{amsbsy}\n\t\t\t\t\\usepackage{mathrsfs}\n\t\t\t\t\\usepackage{upgreek}\n\t\t\t\t\\setlength{\\oddsidemargin}{-69pt}\n\t\t\t\t\\begin{document}$$10\\%$$\\end{document} \\documentclass[12pt]{minimal}\n\t\t\t\t\\usepackage{amsmath}\n\t\t\t\t\\usepackage{wasysym} \n\t\t\t\t\\usepackage{amsfonts} \n\t\t\t\t\\usepackage{amssymb} \n\t\t\t\t\\usepackage{amsbsy}\n\t\t\t\t\\usepackage{mathrsfs}\n\t\t\t\t\\usepackage{upgreek}\n\t\t\t\t\\setlength{\\oddsidemargin}{-69pt}\n\t\t\t\t\\begin{document}$$90\\%$$\\end{document} \\documentclass[12pt]{minimal}\n\t\t\t\t\\usepackage{amsmath}\n\t\t\t\t\\usepackage{wasysym} \n\t\t\t\t\\usepackage{amsfonts} \n\t\t\t\t\\usepackage{amssymb} \n\t\t\t\t\\usepackage{amsbsy}\n\t\t\t\t\\usepackage{mathrsfs}\n\t\t\t\t\\usepackage{upgreek}\n\t\t\t\t\\setlength{\\oddsidemargin}{-69pt}\n\t\t\t\t\\begin{document}$$65\\%$$\\end{document} Hence, it is seen that when tested with a noisy test dataset, the fine-tuned models perform significantly better than the naive model trained with the simulated dataset. Thus, this fine-tuning gives some safeguard against the measurement noise that is present in the actual scenario. Results and discussion The methodology and its performance are demonstrated on a simulation set up with a particular body model (Gustav). To validate the applicability of the proposed method and designed ML models on previously unseen data coming from some other body model, the procedure is tested on the female body model (Donna) available in CST Suite. Several simulations were conducted on this particular body model, and as mentioned before, this set is referred to as Simulation-C. The XGBoost classifier correctly predicts the presence of a tumor in all simulations (i.e., accuracy \\documentclass[12pt]{minimal}\n\t\t\t\t\\usepackage{amsmath}\n\t\t\t\t\\usepackage{wasysym} \n\t\t\t\t\\usepackage{amsfonts} \n\t\t\t\t\\usepackage{amssymb} \n\t\t\t\t\\usepackage{amsbsy}\n\t\t\t\t\\usepackage{mathrsfs}\n\t\t\t\t\\usepackage{upgreek}\n\t\t\t\t\\setlength{\\oddsidemargin}{-69pt}\n\t\t\t\t\\begin{document}$$100\\%$$\\end{document} \\documentclass[12pt]{minimal}\n\t\t\t\t\\usepackage{amsmath}\n\t\t\t\t\\usepackage{wasysym} \n\t\t\t\t\\usepackage{amsfonts} \n\t\t\t\t\\usepackage{amssymb} \n\t\t\t\t\\usepackage{amsbsy}\n\t\t\t\t\\usepackage{mathrsfs}\n\t\t\t\t\\usepackage{upgreek}\n\t\t\t\t\\setlength{\\oddsidemargin}{-69pt}\n\t\t\t\t\\begin{document}$$80\\%$$\\end{document} 3 Table 3 Predicted tumor sizes of Donna body model by the XGBoost Regression model, CNN over intensity MW image. Actual Tumor Radius (mm) XGBoost CNN on MWI 5.0 (Left) 11.87 6.45 5.0 (Right) 10.85 5.79 10.0 (Left) 13.01 9.53 10.0 (Right) 13.26 10.7 15.0 (Left) 13.04 11.0 15.0 (Right) 17.53 10.8 20.0 (Left) 18.63 11.8 20.0 (Right) 12.7 22.8 The performance can be improved by training the model with different types of unseen data.As already demonstrated in the previous section, that the models can be made robust against noise by fine-tuning with noisy dataset. Similarly, this fine-tuning can also be performed when real-life data is available, during the trial process. The full measurement and diagnosis procedure, which includes equipment setup, antenna calibration, data acquisition, and image processing, may typically require about 30–40 minutes. Specifically, setting up the VNA and switching matrix takes around 5–10 minutes, antenna calibration takes about 10 minutes, data collection varies between 30 seconds and 10 minutes depending on the equipment configuration and multiple readings, and data processing takes an additional 3–5 minutes. However, if the antennas are already calibrated and the VNA is pre-warmed, the measurement time in a clinical setting can be reduced to about 15 to 20 minutes. This makes it a safe and competitive option compared to a chest X-ray (which takes about 10–15 minutes) or a CT scan (about 15–30 minutes). In the future, automation and integrated systems can further minimize setup and calibration time, making the process faster and more suitable for routine clinical use, especially in the case of recurrent tumors. Fig. 12 Performance comparison between different ML models for ( a b Conclusion In this study, the challenge of early and recurring lung tumor detection has been addressed by employing a combination of microwave imaging and machine learning techniques. The proposed approach involves the design of an eight-antenna system integrated into a wearable belt, which is used to collect microwave scattering parameters and reconstruct microwave images. A suitable wideband, high-gain antenna is employed for this application. The system employs two machine learning models: an XGBoost classifier to predict tumor presence and a Convolutional Neural Network (CNN) to estimate tumor size, aiding in cancer staging. Initial testing was performed with simulation data from a CST body model of a 38-year-old male (‘Gustav’) and further validated with an independent dataset from a CST model of a 40-year-old female (‘Donna’), demonstrating the system’s robustness and adaptability. To ensure practical use, both models were fine-tuned to handle realistic noisy data, resulting in significantly improved performance compared to models trained only on clean simulation data. This fine-tuning provides resilience against measurement noise commonly encountered in clinical environments. The key innovation of this work is the integration of a wearable microwave imaging system with machine learning to enable reliable and frequent monitoring of lung tumors. This approach shows strong potential for improving early detection and follow-up of recurrent lung cancer, which remains a critical health concern worldwide. Future research will focus on clinical trials with human subjects, further refinement to handle individual differences, and technical advancements to reduce overall measurement time, making the system more practical for real-world clinical workflows. Publisher’s note Springer Nature remains neutral with regard to jurisdictional claims in published maps and institutional affiliations. These authors contributed equally to this work: Adarsh Singh and Sandip Paul. Acknowledgements This research work acknowledges ”AI-based Detection of Acute Respiratory Distress Syndrome (AI-DARDS),” a joint Indo-Swedish collaborative project by DBT-Vinnova under grants BT/PR41025/Swdn/135/9/2020 (for DBT) and 2020-03612 (for Vinnova). Author contributions Conceptualization, A.S., S.P., B.M., and D.M.; methodology, A.S., S.P., D.M, and B.M.; Simulations, A.S., and S.G.; Data processing and analysis, S.P. and A.S.; formal analysis, S.P and A.S.; investigation, A.S., S.P, and B.M.; resources, D.M. and R.A.; writing–original draft preparation, A.S., S.P., and B.M.; writing–review and editing, A.S., S.P., S.G, B.M., D.M., and R.A.; supervision, D.M. and R.A.; funding acquisition, D.M, and R.A. All authors reviewed the manuscript. Funding Open access funding provided by Uppsala University. Data availability The data sets generated and analyzed during the current study are available from the corresponding author on a reasonable request. Declarations Competing interests The authors declare no competing interests. References 1. Celli B Barnes P Exacerbations of chronic obstructive pulmonary disease Eur. Respir. J. 2007 29 1224 1238 10.1183/09031936.00109906 17540785 Celli, B. & Barnes, P. Exacerbations of chronic obstructive pulmonary disease. Eur. Respir. J. 29 17540785 10.1183/09031936.00109906 2. World health organization,“lung cancer” [online] available:. https://www.who.int/news-room/fact-sheets/detail/lung-cancer 3. International agency for research on cancer, world health organization, [online] available:. https://gco.iarc.who.int/today/en/dataviz 4. Basumallik, N. & Agarwal, M. Small cell lung cancer https://www.ncbi.nlm.nih.gov/books/NBK482458/ 29494065 5. Mahvi DA Liu R Grinstaff MW Colson YL Raut CP Local cancer recurrence: the realities, challenges, and opportunities for new therapies CA: a cancer journal for clinicians 2018 68 488 505 30328620 10.3322/caac.21498 PMC6239861 Mahvi, D. A., Liu, R., Grinstaff, M. W., Colson, Y. L. & Raut, C. P. Local cancer recurrence: the realities, challenges, and opportunities for new therapies. CA: a cancer journal for clinicians 68 30328620 10.3322/caac.21498 PMC6239861 6. Chandra R Zhou H Balasingham I Narayanan RM On the opportunities and challenges in microwave medical sensing and imaging IEEE transactions on biomedical engineering 2015 62 1667 1682 10.1109/TBME.2015.2432137 25993698 Chandra, R., Zhou, H., Balasingham, I. & Narayanan, R. M. On the opportunities and challenges in microwave medical sensing and imaging. IEEE transactions on biomedical engineering 62 25993698 10.1109/TBME.2015.2432137 7. Mehrotra P Chatterjee B Sen S Em-wave biosensors: A review of rf, microwave, mm-wave and optical sensing Sensors 2019 19 1013 10.3390/s19051013 30818865 PMC6427747 Mehrotra, P., Chatterjee, B. & Sen, S. Em-wave biosensors: A review of rf, microwave, mm-wave and optical sensing. Sensors 19 30818865 10.3390/s19051013 PMC6427747 8. Singh, A., Mitra, D., Mandal, B., Basuchowdhuri, P. & Augustine, R. A review of electromagnetic sensing for healthcare applications. AEU-International J. Electron. Commun. 9. Semenov S Microwave tomography: review of the progress towards clinical applications Philos. Transactions Royal Soc. A: Math. Phys. Eng. Sci. 2009 367 3021 3042 10.1098/rsta.2009.0092 PMC2696111 19581253 Semenov, S. Microwave tomography: review of the progress towards clinical applications. Philos. Transactions Royal Soc. A: Math. Phys. Eng. Sci. 367 10.1098/rsta.2009.0092 PMC2696111 19581253 10. Lee CH Breast cancer screening with imaging: recommendations from the society of breast imaging and the acr on the use of mammography, breast mri, breast ultrasound, and other technologies for the detection of clinically occult breast cancer J. Am. college radiology 2010 7 18 27 10.1016/j.jacr.2009.09.022 20129267 Lee, C. H. et al. Breast cancer screening with imaging: recommendations from the society of breast imaging and the acr on the use of mammography, breast mri, breast ultrasound, and other technologies for the detection of clinically occult breast cancer. J. Am. college radiology 7 10.1016/j.jacr.2009.09.022 20129267 11. Fear EC Li X Hagness SC Stuchly MA Confocal microwave imaging for breast cancer detection: Localization of tumors in three dimensions IEEE Transactions on biomedical engineering 2002 49 812 822 10.1109/TBME.2002.800759 12148820 Fear, E. C., Li, X., Hagness, S. C. & Stuchly, M. A. Confocal microwave imaging for breast cancer detection: Localization of tumors in three dimensions. IEEE Transactions on biomedical engineering 49 12148820 10.1109/TBME.2002.800759 12. Alam, N., Ahmed, A., Oni, M. A. I., Meem, T. A. & Rahman, M. A. Uwb microwave imaging for non-invasive anomaly detection in human lung and possible application in covid-19 diagnosis: A review. In 2021 2nd International Conference on Robotics, Electrical and Signal Processing Techniques (ICREST) 13. Rezaeieh SA Zamani A Bialkowski K Mahmoud A Abbosh A Feasibility of using wideband microwave system for non-invasive detection and monitoring of pulmonary oedema Sci. Reports 2015 5 14047 10.1038/srep14047 PMC4568468 26365299 Rezaeieh, S. A., Zamani, A., Bialkowski, K., Mahmoud, A. & Abbosh, A. Feasibility of using wideband microwave system for non-invasive detection and monitoring of pulmonary oedema. Sci. Reports 5 10.1038/srep14047 PMC4568468 26365299 14. Ahdi Rezaeieh S Zamani A Bialkowski K Abbosh A Novel microwave torso scanner for thoracic fluid accumulation diagnosis and monitoring Sci. Reports 2017 7 1 10 10.1038/s41598-017-00436-w PMC5428468 28331176 Ahdi Rezaeieh, S., Zamani, A., Bialkowski, K. & Abbosh, A. Novel microwave torso scanner for thoracic fluid accumulation diagnosis and monitoring. Sci. Reports 7 10.1038/s41598-017-00436-w PMC5428468 28331176 15. Gopalakrishnan K Applications of microwaves in medicine leveraging artificial intelligence: Future perspectives Electronics 2023 12 1101 10.3390/electronics12051101 Gopalakrishnan, K. et al. Applications of microwaves in medicine leveraging artificial intelligence: Future perspectives. Electronics 12 16. Siddiqui HUR Respiration-based copd detection using uwb radar incorporation with machine learning Electronics 2022 11 2875 10.3390/electronics11182875 Siddiqui, H. U. R. et al. Respiration-based copd detection using uwb radar incorporation with machine learning. Electronics 11 17. Kim S-H Geem ZW Han G-T A novel human respiration pattern recognition using signals of ultra-wideband radar sensor Sensors 2019 19 3340 10.3390/s19153340 31366102 PMC6696104 Kim, S.-H., Geem, Z. W. & Han, G.-T. A novel human respiration pattern recognition using signals of ultra-wideband radar sensor. Sensors 19 31366102 10.3390/s19153340 PMC6696104 18. Kramer T Annema JT Advanced bronchoscopic techniques for the diagnosis and treatment of peripheral lung cancer Lung cancer 2021 161 152 162 10.1016/j.lungcan.2021.09.015 34600406 Kramer, T. & Annema, J. T. Advanced bronchoscopic techniques for the diagnosis and treatment of peripheral lung cancer. Lung cancer 161 34600406 10.1016/j.lungcan.2021.09.015 19. Cst studio suite. available:. https://www.3ds.com/products/simulia/cst-studio-suite 20. D.Andreuccetti, R.Fossi & C.Petrucci. “an internet resource for the calculation of the dielectric properties of body tissues in the frequency range 10 hz - 100 ghz.”ifac-cnr, florence (italy), 1997. based on data published by c.gabriel et al. in 1996. [online]. available:. [Accessed: 2025-03-13]. 21. Alamro W Seet B-C Wang L Parthiban P Early-stage lung tumor detection based on super-wideband microwave reflectometry Electronics 2022 12 36 10.3390/electronics12010036 Alamro, W., Seet, B.-C., Wang, L. & Parthiban, P. Early-stage lung tumor detection based on super-wideband microwave reflectometry. Electronics 12 22. Singh, A. et al. A wearable microwave technique for early detection of acute respiratory distress syndrome (ards). In Sensing Technology: Proceedings of ICST’15 23. Zaatar O Zakaria A Qaddoumi N A novel switch for microwave imaging systems IEEE Access 2024 12 26978 26990 10.1109/ACCESS.2024.3367355 Zaatar, O., Zakaria, A. & Qaddoumi, N. A novel switch for microwave imaging systems. IEEE Access 12 24. Lin JC Frequency optimization for microwave imaging of biological tissues Proc. IEEE 2005 73 374 375 10.1109/PROC.1985.13151 Lin, J. C. Frequency optimization for microwave imaging of biological tissues. Proc. IEEE 73 25. Mason PA Effects of frequency, permittivity, and voxel size on predicted specific absorption rate values in biological tissue during electromagnetic-field exposure IEEE Transactions on Microw. Theory Tech. 2000 48 2050 2058 10.1109/22.884194 Mason, P. A. et al. Effects of frequency, permittivity, and voxel size on predicted specific absorption rate values in biological tissue during electromagnetic-field exposure. IEEE Transactions on Microw. Theory Tech. 48 26. Fields RE Evaluating compliance with fcc guidelines for human exposure to radiofrequency electromagnetic fields Oet Bull 1997 65 1 57 Fields, R. E. Evaluating compliance with fcc guidelines for human exposure to radiofrequency electromagnetic fields. Oet Bull 65 27. Ahdi Rezaeieh S Zamani A Bialkowski KS Macdonald GA Abbosh A M. Three-dimensional electromagnetic torso scanner Sensors 2019 19 1015 10.3390/s19051015 30818868 PMC6427315 Ahdi Rezaeieh, S., Zamani, A., Bialkowski, K. S., Macdonald, G. A. & Abbosh, A. M. Three-dimensional electromagnetic torso scanner. Sensors 19 30818868 10.3390/s19051015 PMC6427315 28. Inc., T. M. Matlab version: (r2024a) (2024). 29. Chen, T. & Guestrin, C. Xgboost: A scalable tree boosting system. In Proceedings of the 22nd acm sigkdd international conference on knowledge discovery and data mining 30. Dimitrakopoulos, G. N., Vrahatis, A. G., Plagianakos, V. & Sgarbas, K. Pathway analysis using xgboost classification in biomedical data. In Proceedings of the 10th Hellenic conference on artificial intelligence 31. Panagiotopoulos K Meva-x: a hybrid multiobjective evolutionary tool using an xgboost classifier for biomarkers discovery on biomedical datasets Bioinformatics 2023 39 btad384 10.1093/bioinformatics/btad384 37326976 PMC10354005 Panagiotopoulos, K. et al. Meva-x: a hybrid multiobjective evolutionary tool using an xgboost classifier for biomarkers discovery on biomedical datasets. Bioinformatics 39 37326976 10.1093/bioinformatics/btad384 PMC10354005 32. Zhang S Yuan Y Yao Z Wang X Lei Z Improvement of the performance of models for predicting coronary artery disease based on xgboost algorithm and feature processing technology Electronics 2022 11 315 10.3390/electronics11030315 Zhang, S., Yuan, Y., Yao, Z., Wang, X. & Lei, Z. Improvement of the performance of models for predicting coronary artery disease based on xgboost algorithm and feature processing technology. Electronics 11 33. Guo, X., Yin, Y., Dong, C., Yang, G. & Zhou, G. On the class imbalance problem. In 2008 Fourth international conference on natural computation 34. He, H., Bai, Y., Garcia, E. A. & Li, S. Adasyn: Adaptive synthetic sampling approach for imbalanced learning. In 2008 IEEE international joint conference on neural networks (IEEE world congress on computational intelligence) 35. xgboost 2.0.3 [online]. available:. https://pypi.org/project/xgboost/ 36. Wu, J. Introduction to convolutional neural networks. Natl. Key Lab for Nov. Softw. Technol. Nanjing Univ. China 5 37. Li Z Liu F Yang W Peng S Zhou J A survey of convolutional neural networks: analysis, applications, and prospects IEEE transactions on neural networks and learning systems 2021 33 6999 7019 10.1109/TNNLS.2021.3084827 34111009 Li, Z., Liu, F., Yang, W., Peng, S. & Zhou, J. A survey of convolutional neural networks: analysis, applications, and prospects. IEEE transactions on neural networks and learning systems 33 10.1109/TNNLS.2021.3084827 34111009 38. Pang S Du A Orgun MA Yu Z A novel fused convolutional neural network for biomedical image classification Medical & biological engineering & computing 2019 57 107 121 10.1007/s11517-018-1819-y 30003400 Pang, S., Du, A., Orgun, M. A. & Yu, Z. A novel fused convolutional neural network for biomedical image classification. Medical & biological engineering & computing 57 30003400 10.1007/s11517-018-1819-y 39. Montiel, J. et al. Adaptive xgboost for evolving data streams. In 2020 International Joint Conference on Neural Networks (IJCNN) 40. Kingma, D. P. & Ba, J. Adam: A method for stochastic optimization. arXiv preprint arXiv:1412.6980 ",
  "metadata": {
    "Title of this paper": "A novel fused convolutional neural network for biomedical image classification",
    "Journal it was published in:": "Scientific Reports",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12489082/"
  }
}