{
  "title": "Paper_621",
  "abstract": "pmc Korean J Radiol Korean J Radiol 659 kjr KJR Korean Journal of Radiology 1229-6929 2005-8330 Korean Society of Radiology PMC12479225 PMC12479225.1 12479225 12479225 41015860 10.3348/kjr.2025.0416 1 Oncologic Imaging Review Article State-of-the-Art Imaging in Antibody-Drug Conjugate Treatment for Advanced Bladder Cancer https://orcid.org/0000-0001-8244-2213 Eid Sarah 1 * https://orcid.org/0009-0000-2996-0513 Al-Yousef Abdullah S. 1 * https://orcid.org/0000-0002-1532-5970 Kim Kyung Won 1 2 https://orcid.org/0000-0001-7544-0404 Yoon Shinkyo 3 https://orcid.org/0000-0001-5428-5660 Nawfal Rashad 4 https://orcid.org/0000-0003-2328-3421 Bellmunt Joaquim 4 https://orcid.org/0000-0002-9201-3217 Choueiri Toni K. 4 https://orcid.org/0000-0002-9286-0416 Krajewski Katherine M. 1 1 USA 2 Republic of Korea 3 Republic of Korea 4 USA Corresponding author: Kyung Won Kim, MD, PhD, Department of Radiology, Asan Medical Center, Asan Image Metrics, University of Ulsan College of Medicine, 88 Olympic-ro 43-gil, Songpa-gu, Seoul 05505, Republic of Korea. kyungwon.kim@aim-aicro.com * 10 2025 20 8 2025 26 10 497823 959 972 08 4 2025 06 6 2025 27 6 2025 01 10 2025 01 10 2025 01 10 2025 Copyright © 2025 The Korean Society of Radiology 2025 The Korean Society of Radiology https://creativecommons.org/licenses/by-nc/4.0/ This is an Open Access article distributed under the terms of the Creative Commons Attribution Non-Commercial License ( https://creativecommons.org/licenses/by-nc/4.0 Antibody-drug conjugates (ADCs) have revolutionized the treatment landscape for advanced bladder cancer, particularly enfortumab vedotin and trastuzumab deruxtecan, which target Nectin-4 and human epidermal growth factor receptor 2 (HER 2), respectively. These ADCs have shown substantial efficacy, improving survival in patients who have progressed after chemotherapy and immunotherapy. Imaging plays a pivotal role in ADC-based therapy, extending beyond diagnosis and staging to assessing treatment response, detecting recurrence, and evaluating toxicity. Computed tomography (CT), multiparametric magnetic resonance imaging (MRI), and fluorodeoxyglucose positron emission tomography (FDG-PET) are widely used for these purposes. Despite the efficacy of ADCs, resistance mechanisms such as antigen loss and payload resistance continue to pose challenges, necessitating the development of next-generation ADCs. Response assessment largely relies on Response Evaluation Criteria in Solid Tumors (RECIST) 1.1, with growing interest in multiparametric MRI for evaluating complete response in bladder lesions. Additionally, imaging helps identify ADC-related toxicities, including pneumonitis and gastrointestinal complications. Radiologists must be aware of these evolving therapeutic and imaging paradigms to optimize patient management. The integration of imaging with ADC-based treatment requires a multidisciplinary approach to improve outcomes. This review highlights the critical role of imaging in ADC therapy and underscores the need for radiologists to adapt to these advancements in bladder cancer treatment. Bladder cancer Antibody-drug conjugates Enfortumab vedotin Sacituzumab govitecan Imaging Institute of Information & Communications Technology Planning & Evaluation RS-2025-02219599 Korea Health Industry Development Institute https://doi.org/10.13039/501100003710 HR18C0016 pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement yes pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes INTRODUCTION The rising incidence of bladder cancer globally has imposed significant burdens on patients and healthcare systems [ 1 2 ADC-based treatments, with or without immune checkpoint inhibitors (ICIs), represent a pivotal advancement in the therapeutic landscape of advanced bladder cancer, particularly for patients who have progressed after platinum-based chemotherapy and immunotherapy [ 3 4 5 6 State-of-the-art technologies, such as computed tomography (CT) urography, multiparametric MRI (mpMRI), and fluorodeoxyglucose (FDG) positron emission tomography (PET), have long been essential in managing bladder cancer [ 7 8 9 ADC for Bladder Cancer Mechanism of Action ADCs represent an innovative and promising class of targeted cancer therapies [ 6 Fig. 1 Enfortumab vedotin (Padcev ® 5 6 Sacituzumab govitecan (Trodelvy ® 6 Trastuzumab deruxtecan (Enhertu ® 5 ADC in the Standard of Care Following FDA approval, enfortumab vedotin and sacituzumab govitecan have been rapidly integrated into clinical practice guidelines, including those from the National Comprehensive Cancer Network ® ® 10 11 Enfortumab vedotin received FDA approval in 2019 for the treatment of locally advanced or metastatic urothelial carcinoma in adults previously treated with platinum-containing chemotherapy and a PD-1 or PD-L1 inhibitor [ 12 13 14 5 The principles of systemic therapy for locally advanced or metastatic bladder cancer in the NCCN Clinical Practice Guidelines in Oncology (NCCN Guidelines ® Table 1 10 15 Current Challenges and Ongoing Development of ADC-Based Therapy Bladder cancer resistance and recurrence after ADC-based treatment remain significant challenges, similar to those encountered with other cancer therapies ( Fig. 2 16 Concurrently, new ADCs are under development to overcome these resistance and recurrence mechanisms by refining target selection and optimizing payloads [ 17 18 19 In addition, clinical trials are exploring the use of ADCs in the neoadjuvant setting. For instance, disitamab vedotin in combination with tislelizumab, a PD-1 inhibitor, is being investigated as a novel neoadjuvant regimen for patients with HER2-positive locally advanced muscle-invasive bladder cancer (MIBC), demonstrating encouraging preliminary results in terms of clinical complete response (CR) and bladder-sparing potential [ 20 21 Role of Imaging for ADC-Based Therapy Imaging Modalities for Bladder Cancer Imaging provides crucial insights into diagnosis, staging, assessment of treatment response, and surveillance of bladder cancer. Among these uses, the number of CT or MRI scans performed for treatment response assessment and surveillance significantly exceeds those conducted for diagnosis and staging. Approximately 5%–10% of patients present with metastatic disease at diagnosis, and recurrence after radical cystectomy occurs locally in 30%, with distant metastases developing in up to 50% of patients [ 10 17 CT is the most accessible and commonly used imaging modality for multisystem assessment in bladder cancer. In patients with non MIBC (NMIBC), routine CT surveillance is generally not required and is recommended only when symptoms or risk factors are present. For MIBC, CT surveillance after treatment is standard practice [ 11 22 23 24 MRI, with its superior soft-tissue resolution, is more reliable than CT for the detailed evaluation of primary bladder cancer, particularly in assessing muscle invasion during staging and evaluating treatment response during systemic therapy [ 25 3 26 FDG-PET/CT is a sensitive imaging modality for detecting FDG-avid malignant disease. However, its use in bladder cancer remains debated due to the high urinary excretion of FDG, which limits the evaluation of the bladder wall and ureters [ 27 10 Imaging Strategy in the Standard of Care The NCCN guidelines for advanced or metastatic bladder cancer recommend various imaging strategies based on the clinical scenario ( Table 2 10 In routine clinical practice, imaging assessments generally follow institutional protocols and typically use structured report templates. However, the interpretation of treatment response, whether progression, stability, or response, is primarily dependent on the radiologist’s judgment, often based on comparison with the most recent prior imaging rather than a formal baseline comparison. Recently, the neoadjuvant chemotherapy VI-RADS (nacVI-RADS), a five-point scoring system initially proposed for chemotherapy, has now been applied to evaluate radiologic response to neoadjuvant immunotherapy using mpMRI in patients with MIBC. In this system, scores of 1–2 indicate complete radiologic response ( Supplementary Fig. 1 28 Imaging Strategy in Clinical Trials In cancer clinical trials, imaging strategies are rigorously standardized according to U.S. FDA clinical trial imaging endpoint standards [ 29 30 Response assessment is typically based on formal criteria such as RECIST 1.1 or Irecist, and image comparisons are consistently performed against the defined baseline scan. Additionally, image evaluations are often conducted by blinded independent central review panels to ensure objectivity and consistency, which contrast with the more subjective, real-time assessments in standard clinical workflows. Imaging for Treatment Response Assessment Currently, most evidence supporting the efficacy of ADC-based therapies originates from clinical trials, as real-world data remain limited due to the short period since their approval [ 31 Supplementary Fig. 2 In the EV-201 trial, enfortumab vedotin monotherapy showed a confirmed ORR of 51.7% (46 of 89), with 20.2% (18 of 89) CRs and 31.5% (28 of 89) PRs in cisplatin-ineligible patients previously treated with programmed cell death protein 1 (PD-1) or programmed cell death ligand 1 (PD-L1) inhibitors [ 32 33 34 Although sacituzumab govitecan monotherapy showed an ORR of 27.7%, with 5.4% CRs and 22.3% PRs in the TROPHY-U-01 trial [ 35 14 Trastuzumab deruxtecan achieved an ORR of 39.0% in bladder cancer across all HER2 expression levels. Patients with high HER2 expression (IHC 3+) demonstrated a significantly higher ORR of 56.3%, suggesting that HER2 expression levels may influence treatment efficacy, as shown in the phase II DESTINY-PanTumor02 trial [ 5 There are several issues worth discussing regarding treatment response assessment on imaging. The first is the response criteria for ADC-based therapy. All these clinical trials used RECIST 1.1 for response assessment [ 32 33 34 35 8 36 The second issue is assessing CR in primary bladder cancer on imaging. The urinary bladder is a dynamic organ with varying degrees of distension depending on urine volume, which can complicate the detection and measurement of primary bladder cancer. Post-treatment scar tissue from a primary bladder tumor may present as mild bladder wall thickening on CT or MRI, potentially leading radiologists to incorrectly assess a PR instead of a CR, even when cystoscopy or pathology confirms a CR. Indeed, a study exploring organ-specific response in bladder cancer patients treated with enfortumab vedotin reported a CR rate of 0% for primary bladder cancer. In contrast, CR rates were 5.5%, 29.4%, and 18.2% for lymph node metastases, lung metastases, and liver metastases, respectively, where tumor measurement is easier and more reliable [ 31 37 Fig. 3 The third Issue is assessing bone metastases response. Bone metastases frequently occur in the pelvic bones and spine [ 38 39 Fig. 4 10 Imaging for Toxicity Evaluation ADCs are targeted therapies designed to selectively deliver potent cytotoxic agents to cancer cells while minimizing damage to healthy tissues. Despite their targeted mechanism, ADCs can still cause significant toxicities arising from both the antibody component (immune-related effects) and the cytotoxic payload (chemical-related toxicities) [ 6 9 Toxicities typically arise from two primary mechanisms: off-target toxicity and on-target, off-site toxicity. Off-target toxicity refers to adverse effects caused by the unintended release of the cytotoxic payload in areas of the body outside target cancer cells. Early premature release of the payload into the bloodstream can cause damage to hematologic cells, leading to neutropenia, anemia, and thrombocytopenia; lung alveolar and endothelial cells, causing pneumonitis; liver cells, resulting in hepatotoxicity; and neurons, leading to peripheral neuropathy [ 40 On-target, off-site toxicity occurs when an ADC binds to normal cells that express the target antigen, leading to toxicity in normal tissue such as the skin, eye, and gastrointestinal mucosa [ 40 13 Different toxicity profiles are observed across ADCs, related to the antibodies and payloads used ( Table 3 40 41 In a meta-analysis, trastuzumab deruxtecan was associated with interstitial lung disease/pneumonitis in 12.5% of patients, with grade 3 to 5 severity in 2.2%, requiring close monitoring and corticosteroid treatment if detected. Hematologic toxicities included neutropenia (36.4%), anemia (36.8%), and thrombocytopenia (26.8%), which may necessitate dose adjustments or supportive care. Gastrointestinal adverse effects such as nausea (70.7%), vomiting (37.2%), and diarrhea (29.1%) are common but manageable with antiemetics and hydration, while fatigue is another frequent adverse effect (41.0%) [ 42 Of these toxicities, imaging is often used to diagnose pneumonitis and gastrointestinal toxicity. Pneumonitis patterns on CT can be classified according to the American Thoracic Society/European Respiratory Society classification [ 43 41 Fig. 5 41 In patients with gastrointestinal toxicity, the commonly observed CT findings include fluid-filled and dilated bowel loops with mild bowel wall thickening ( Fig. 6 44 45 Role of Radiologists Radiologists should be part of multidisciplinary teams alongside medical oncologists, surgeons, and radiation oncologists to optimize care for patients with advanced bladder cancer. They should have a clear understanding of the clinical questions at hand and the role of imaging at each stage ( Table 4 46 47 48 Conclusion The diagnosis and management of patients with locally advanced and metastatic bladder cancer have evolved and will continue to change. Currently, ADC-based therapy, with or without ICIs, has dramatically improved overall survival in patients with advanced bladder cancer. These improvements in care compel radiologists to remain knowledgeable about the mechanisms of ADCs, the utility of imaging modalities for advanced bladder cancer, treatment response patterns, and imaging-based toxicity findings related to ADC-based therapy. Conflicts of Interest: Author Contributions: Conceptualization: Resources: Supervision: Writing—original draft: Writing—review & editing: Funding Statement: 1 van Hoogstraten LMC Vrieling A van der Heijden AG Kogevinas M Richters A Kiemeney LA Global trends in the epidemiology of bladder cancer: challenges for public health and clinical practice Nat Rev Clin Oncol 2023 20 287 304 36914746 10.1038/s41571-023-00744-3 2 Shastry M Gupta A Chandarlapaty S Young M Powles T Hamilton E Rise of antibody-drug conjugates: the present and future Am Soc Clin Oncol Educ Book 2023 43 e390094 37229614 10.1200/EDBK_390094 3 Larroquette M Lefort F Domblides C Héraudet L Robert G Ravaud A How immunotherapy has redefined the treatment paradigm of metastatic or locally advanced muscle-invasive urothelial bladder carcinoma Cancers (Basel) 2024 16 1780 38730732 10.3390/cancers16091780 PMC11083785 4 Hoimes CJ Flaig TW Milowsky MI Friedlander TW Bilen MA Gupta S Enfortumab vedotin plus pembrolizumab in previously untreated advanced urothelial cancer J Clin Oncol 2023 41 22 31 36041086 10.1200/JCO.22.01643 PMC10476837 5 Meric-Bernstam F Makker V Oaknin A Oh DY Banerjee S González-Martín A Efficacy and safety of trastuzumab deruxtecan in patients with HER2-expressing solid tumors: primary results from the DESTINY-PanTumor02 phase II trial J Clin Oncol 2024 42 47 58 37870536 10.1200/JCO.23.02005 PMC10730032 6 Thomas J Sun M Getz T Ho B Nauseef JT Tagawa ST Antibody-drug conjugates for urothelial carcinoma Urol Oncol 2023 41 420 428 37419845 10.1016/j.urolonc.2023.06.006 7 Abouelkheir RT Abdelhamid A Abou El-Ghar M El-Diasty T Imaging of bladder cancer: standard applications and future trends Medicina (Kaunas) 2021 57 220 33804350 10.3390/medicina57030220 PMC8000909 8 Kim N Lee ES Won SE Yang M Lee AJ Shin Y Evolution of radiological treatment response assessments for cancer immunotherapy: from iRECIST to radiomics and artificial intelligence Korean J Radiol 2022 23 1089 1101 36098343 10.3348/kjr.2022.0225 PMC9614294 9 Jang JS Park HJ Suh CH Won SE Lee ES Kim N Imaging findings of complications of new anticancer drugs Korean J Radiol 2025 26 156 168 39898396 10.3348/kjr.2024.0195 PMC11794286 10 National Comprehensive Cancer Network NCCN guidelines: bladder cancer (version 1.2025) accessed on June 1, 2025 Available at: https://www.nccn.org/guidelines/guidelines-detail?category=1&id=1417 11 Powles T Bellmunt J Comperat E De Santis M Huddart R Loriot Y ESMO clinical practice guideline interim update on first-line therapy in advanced urothelial carcinoma Ann Oncol 2024 35 485 490 38490358 10.1016/j.annonc.2024.03.001 12 Chang E Weinstock C Zhang L Charlab R Dorff SE Gong Y FDA approval summary: enfortumab vedotin for locally advanced or metastatic urothelial carcinoma Clin Cancer Res 2021 27 922 927 32962979 10.1158/1078-0432.CCR-20-2275 13 Liu W Du Q Guo Z Ye X Liu J Post-marketing safety surveillance of sacituzumab govitecan: an observational, pharmacovigilance study leveraging FAERS database Front Pharmacol 2023 14 1283247 38027003 10.3389/fphar.2023.1283247 PMC10667432 14 Powles T Tagawa S Vulsteke C Gross-Goupil M Park SH Necchi A Sacituzumab govitecan in advanced urothelial carcinoma: TROPiCS-04, a phase III randomized trial Ann Oncol 2025 36 561 571 39934055 10.1016/j.annonc.2025.01.011 15 Uemura K Ito H Jikuya R Kondo T Tatenuma T Kawahara T Enfortumab vedotin prolongs overall survival in metastatic urothelial carcinoma following pembrolizumab therapy in real-world data Int J Urol 2024 31 678 684 38402449 10.1111/iju.15437 16 Grant MJ Stockhammer P Austin MR Nemeth Z Petrylak DP Efficacy of antibody drug conjugates alone and in combination with other agents in metastatic urothelial carcinoma: a scoping review Bladder Cancer 2024 10 9 23 38993528 10.3233/BLC-230070 PMC11181835 17 Iacovelli R Cicala CM Ciccarese C Sacco E Racioppi M Bassi PF Management of metastatic urothelial carcinoma: current approach, emerging agents, and future perspectives Urologia 2023 90 3 10 36537831 10.1177/03915603221139907 18 de Bono JS Concin N Hong DS Thistlethwaite FC Machiels JP Arkenau HT Tisotumab vedotin in patients with advanced or metastatic solid tumours (InnovaTV 201): a first-in-human, multicentre, phase 1-2 trial Lancet Oncol 2019 20 383 393 30745090 10.1016/S1470-2045(18)30859-3 19 Sheng X Wang L He Z Shi Y Luo H Han W Efficacy and safety of disitamab vedotin in patients with human epidermal growth factor receptor 2-positive locally advanced or metastatic urothelial carcinoma: a combined analysis of two phase II clinical trials J Clin Oncol 2024 42 1391 1402 37988648 10.1200/JCO.22.02912 PMC11095880 20 Wen F Tan P Lin T Zhang P Shen Y Preliminary results from a multi-center phase Ib/II study of RC48-ADC combined with tislelizumab as neoadjuvant treatment in patients with HER2 positive locally advanced muscle-invasive urothelial bladder cancer (Hope-03) J Clin Oncol 2024 42 16_suppl e16595 10.3389/fonc.2023.1233196 PMC10806139 38269021 21 Wen F Lin T Tan P Deng J Ren M Zhang M A multi-center phase Ib/II study of RC48-ADC combined with tislelizumab as neoadjuvant treatment in patients with HER2 positive locally advanced muscle-invasive urothelial bladder cancer (Hope-03) J Clin Oncol 2025 43 5_suppl 795 10.3389/fonc.2023.1233196 PMC10806139 38269021 22 Flaig TW Spiess PE Abern M Agarwal N Bangs R Buyyounouski MK Bladder cancer, version 3.2024 featured updates to the NCCN guidelines J Natl Compr Canc Netw 2024 22 216 225 38754471 10.6004/jnccn.2024.0024 23 Galgano SJ Porter KK Burgan C Rais-Bahrami S The role of imaging in bladder cancer diagnosis and staging Diagnostics (Basel) 2020 10 703 32948089 10.3390/diagnostics10090703 PMC7555625 24 Hadjiiski L Weizer AZ Alva A Caoili EM Cohan RH Cha K Treatment response assessment for bladder cancer on CT based on computerized volume analysis, world health organization criteria, and RECIST AJR Am J Roentgenol 2015 205 348 352 26204286 10.2214/AJR.14.13732 PMC4791536 25 Ahn H Current status of magnetic resonance imaging use in bladder cancer Invest Radiol 2025 60 72 83 39110851 10.1097/RLI.0000000000001099 26 Panebianco V Narumi Y Altun E Bochner BH Efstathiou JA Hafeez S Multiparametric magnetic resonance imaging for bladder cancer: development of VI-RADS (vesical imaging-reporting and data system) Eur Urol 2018 74 294 306 29755006 10.1016/j.eururo.2018.04.029 PMC6690492 27 Bacchiani M Salamone V Massaro E Sandulli A Mariottini R Cadenar A Assessing the performance of 18F-FDG PET/CT in bladder cancer: a narrative review of current evidence Cancers (Basel) 2023 15 2951 37296913 10.3390/cancers15112951 PMC10252107 28 Brembilla G Basile G Cosenza M Giganti F Del Prete A Russo T Neoadjuvant chemotherapy VI-RADS scores for assessing muscle-invasive bladder cancer response to neoadjuvant immunotherapy with multiparametric MRI Radiology 2024 313 e233020 39718497 10.1148/radiol.233020 29 U.S. Food and Drug Administration Clinical trial imaging endpoint process standards guidance for industry accessed on June 6, 2025 Available at: https://www.fda.gov/regulatory-information/search-fda-guidance-documents/clinical-trial-imaging-endpoint-process-standards-guidance-industry 30 Rosenberg J Sridhar SS Zhang J Smith D Ruether D Flaig TW EV-101: a phase I study of single-agent enfortumab vedotin in patients with Nectin-4-positive solid tumors, including metastatic urothelial carcinoma J Clin Oncol 2020 38 1041 1049 32031899 10.1200/JCO.19.02044 PMC7106979 31 Minato A Furubayashi N Tomoda T Masaoka H Song Y Hori Y Organ-specific tumor response to enfortumab vedotin for metastatic urothelial carcinoma: a multicenter retrospective study Clin Genitourin Cancer 2024 22 102148 39033710 10.1016/j.clgc.2024.102148 32 Yu EY Petrylak DP O’Donnell PH Lee JL van der Heijden MS Loriot Y Enfortumab vedotin after PD-1 or PD-L1 inhibitors in cisplatin-ineligible patients with advanced urothelial carcinoma (EV-201): a multicentre, single-arm, phase 2 trial Lancet Oncol 2021 22 872 882 33991512 10.1016/S1470-2045(21)00094-2 33 Powles T Rosenberg JE Sonpavde GP Loriot Y Durán I Lee JL Enfortumab vedotin in previously treated advanced urothelial carcinoma N Engl J Med 2021 384 1125 1135 33577729 10.1056/NEJMoa2035807 PMC8450892 34 Powles T Valderrama BP Gupta S Bedke J Kikuchi E Hoffman-Censits J Enfortumab vedotin and pembrolizumab in untreated advanced urothelial cancer N Engl J Med 2024 390 875 888 38446675 10.1056/NEJMoa2312117 35 Tagawa ST Balar AV Petrylak DP Kalebasty AR Loriot Y Fléchon A TROPHY-U-01: a phase II open-label study of sacituzumab govitecan in patients with metastatic urothelial carcinoma progressing after platinum-based chemotherapy and checkpoint inhibitors J Clin Oncol 2021 39 2474 2485 33929895 10.1200/JCO.20.03489 PMC8315301 36 Soria F Beleni AI D’Andrea D Resch I Gust KM Gontero P Pseudoprogression and hyperprogression during immune checkpoint inhibitor therapy for urothelial and kidney cancer World J Urol 2018 36 1703 1709 29549485 10.1007/s00345-018-2264-0 PMC6208670 37 Necchi A Bandini M Calareso G Raggi D Pederzoli F Farè E Multiparametric magnetic resonance imaging as a noninvasive assessment of tumor response to neoadjuvant pembrolizumab in muscle-invasive bladder cancer: preliminary findings from the PURE-01 study Eur Urol 2020 77 636 643 31882281 10.1016/j.eururo.2019.12.016 38 Tsuda Y Nakagawa T Shinoda Y Kanatani A Kawai T Taguchi S Skeletal-related events and prognosis in urothelial cancer patients with bone metastasis Int J Clin Oncol 2017 22 548 553 28044212 10.1007/s10147-016-1075-9 39 Ogasawara T Tanaka T Shindo T Hashimoto K Fukuta F Kobayashi K Two cases of osteoblastic bone metastasis from muscle-invasive bladder cancer with discrepancy in response to chemotherapy: problems and limitations of bone biopsy Int Cancer Conf J 2020 9 235 239 32904051 10.1007/s13691-020-00435-1 PMC7450022 40 Reike MJ Bahlburg H Brehmer M Berg S Noldus J Roghmann F Side effects of drug-antibody conjugates enfortumab-vedotin and sacituzumab-govitecan in targeted therapy in cancer Cancer Epidemiol 2024 90 102574 38657392 10.1016/j.canep.2024.102574 41 Yoon S Shin SJ Kim HC Kim YS Lee HJ Keam B Enfortumab vedotin-related pneumonitis is more common than expected and could lead to acute respiratory failure Eur J Cancer 2022 174 81 89 35985251 10.1016/j.ejca.2022.07.014 42 Li R Hua M Li J Chen W Xu L Meng H The safety of trastuzumab deruxtecan (DS-8201) with a focus on interstitial lung disease and/or pneumonitis: a systematic review and single-arm meta-analysis Cancer 2024 130 2968 2977 38703012 10.1002/cncr.35349 43 Nishino M Hatabu H Hodi FS Ramaiya NH Drug-related pneumonitis in the era of precision cancer therapy JCO Precis Oncol 2017 1 1 12 10.1200/PO.17.00026 PMC7446404 32913972 44 Torrisi JM Schwartz LH Gollub MJ Ginsberg MS Bosl GJ Hricak H CT findings of chemotherapy-induced toxicity: what radiologists need to know about the clinical and radiologic manifestations of chemotherapy toxicity Radiology 2011 258 41 56 21183492 10.1148/radiol.10092129 45 Prescott AE Ravindra A Javed A Neutropenic enterocolitis: a rare complication of sacituzumab govitecan Case Rep Oncol 2022 15 687 693 36157703 10.1159/000525351 PMC9386408 46 Park HJ Kim KW Won SE Yoon S Chae YK Tirumani SH Definition, incidence, and challenges for assessment of hyperprogressive disease during cancer treatment with immune checkpoint inhibitors: a systematic review and meta-analysis JAMA Netw Open 2021 4 e211136 33760090 10.1001/jamanetworkopen.2021.1136 PMC7991969 47 Park HJ Kim KW Pyo J Suh CH Yoon S Hatabu H Incidence of pseudoprogression during immune checkpoint inhibitor therapy for solid tumors: a systematic review and meta-analysis Radiology 2020 297 87 96 32749204 10.1148/radiol.2020200443 PMC7526949 48 Won SE Park HJ Byun S Pyo J Kim JH Choi CM Impact of pseudoprogression and treatment beyond progression on outcome in patients with non-small cell lung cancer treated with immune checkpoint inhibitors Oncoimmunology 2020 9 1776058 32923136 10.1080/2162402X.2020.1776058 PMC7458612 Supplement The Supplement is available with this article at https://doi.org/10.3348/kjr.2025.0416 Fig. 1 Structure and mechanism of action of ADCs. An ADC is composed of three main components: a mAb, a chemical linker, and a cytotoxic payload. Upon binding to its target antigen on the tumor cell surface, such as Nectin-4 or Trop-2, the ADC-antigen complex is internalized via receptor-mediated endocytosis. Once internalized, the ADC is trafficked to the lysosome, where the linker is cleaved during lysosomal degradation. This cleavage releases the cytotoxic payload, which then induces DNA damage or disrupts microtubules, ultimately leading to target cell death. The cytotoxic payload may also diffuse from the lysed cell to affect neighboring antigen-negative cells, contributing to additional tumor cell death. ADC = antibody-drug conjugate, mAb = monoclonal antibody Fig. 2 Mechanisms of resistance to ADCs. There are two primary categories of resistance mechanisms to ADC therapy: antigen loss and payload resistance. Antigen loss mechanisms include down-regulation of the target antigen on tumor cells, reducing ADC binding, and mutations in the antigen-binding site that prevent effective recognition by the monoclonal antibody. Payload resistance mechanisms include clearance of ADCs before payload release, efflux of the payload from the cell via drug efflux pumps, and alterations in the payload's intracellular target that inhibit its ability to induce cell death. ADC = antibody-drug conjugate Fig. 3 A 57-year-old man with locally advanced bladder cancer treated with enfortumab vedotin. A: B: Fig. 4 A 60-year-old man with metastatic bladder cancer treated with enfortumab vedotin. A: B: Fig. 5 Drug-induced pneumonitis in patients treated with enfortumab vedotin. A-C: (A) (B) (C) Fig. 6 A 61-year-old man with bladder cancer treated with enfortumab vedotin. Axial contrast-enhanced CT scan at 2 months starting treatment, CT shows fluid-filled and dilated colon (arrows) and mild colon wall thickening (arrowhead). CT = computed tomography Table 1 Principles of systemic therapy for locally advanced or metastatic bladder cancer Cisplatin eligible Cisplatin ineligible First-line systemic therapy Preferred regimens - Pembrolizumab and EV (category 1) - Pembrolizumab and EV (category 1) Other recommended regimens - Gemcitabine and cisplatin (category 1) followed by avelumab maintenance (category 1) - Gemcitabine and carboplatin followed by avelumab maintenance (category 1) Useful under certain circumstances - DDMVAC with growth factor support (category 1) followed by avelumab maintenance (category 1) - Gemcitabine Post-platinum or other chemotherapy Post-checkpoint inhibitor Second-line systemic therapy Preferred regimen - Pembrolizumab (category 1 post-platinum) For cisplatin ineligible, chemo-naïve Other recommended regimens - Paclitaxel or docetaxel - Paclitaxel or docetaxel Useful under certain circumstances - Ifosfamide, doxorubicin, and gemcitabine - Ifosfamide, doxorubicin, and gemcitabine Subsequent-line systemic therapy Preferred regimen - EV (category 1) Other recommended regimens - Sacituzumab govitecan Useful under certain circumstances - Trastuzumab deruxtecan (HER2-positive, IHC 3+) EV = enfortumab vedotin, DDMVAC = dose dense methotrexate, vinblastine, doxorubicin, cisplatin, FGFR3 = fibroblast growth factor receptor 3, HER2 = human epidermal growth factor receptor 2, IHC = immunohistochemistry Table 2 Principles of imaging for advanced or metastatic bladder cancer Purpose Imaging strategy Staging for MIBC • Chest imaging - CT of the chest with or without contrast (preferred) - PA and lateral chest X-ray • Abdomen/pelvis imaging - CTU (CT of the abdomen and pelvis without and with contrast with excretory imaging) - MRU for patients with poor renal function or contrast allergy (but with GFR >30 and no acute failure) - Renal ultrasonography and CT without contrast for those who cannot receive any contrast agents - MRI of the pelvis may be performed in addition to CTU • FDG-PET/CT (category 2B) - in selected patients with ≥cT2 disease Follow-up with or without cystectomy for MIBC • Chest imaging - Chest CT (preferred) or chest X-ray every 3–6 months for 2 years, then annually for up to 5 years • Abdomen/pelvis imaging - CTU or MRU every 3–6 months for 2 years, then abdomen/pelvis CT or MRI annually for up to 5 years • FDG-PET/CT (category 2B) - In patients with high-risk MIBC if metastasis is suspected Follow-up for metastatic disease • Chest and abdomen imaging - CT chest/abdomen/pelvis Chest CT every 3–6 months with any clinical change or new symptoms, which can be modified according to systemic therapy or surveillance plan - CTU or MRU every 3–6 months as abdomen/pelvis imaging if clinically indicated and with any clinical change or new symptoms • FDG-PET/CT (category 2B) - If metastasis is suspected Evaluation for suspected bone metastasis • Patients at high risk or with symptoms or laboratory indicators of bone metastasis may be imaged with MRI, FDG-PET/CT (category 2B), or bone scan. FDG-PET/CT (category 2B) may also be considered for cases of suspected extraosseous metastases Neurologic/brain imaging • Brain MRI without and with contrast for symptomatic or high-risk (e.g., small cell histology) patients. CT with contrast is considered only when MRI is contraindicated (e.g., non-MRI-compatible devices or foreign body) MIBC = muscle invasive bladder cancer, CT = computed tomography, PA = posteroanterior, CTU = CT urography, MRU = MR urography, GFR = glomerular filtration rate, MRI = magnetic resonance imaging, FDG = fluorodeoxyglucose, PET = positron emission tomography Table 3 Toxicities of EV and SG Toxicity EV SG Notes Peripheral neuropathy Common, frequently severe (grade 3 or higher) Less common Off-target toxicity of EV due to MMAE Dermatologic toxicity Very common: rash, pruritus, severe reactions like SJS/TEN Rare On-target, off-site toxicity of EV due to Nectin-4 expression in skin for EV Hematologic toxicity Less common: neutropenia, anemia Very common: neutropenia, anemia, thrombocytopenia Off-target toxicity of SG due to SN-38 (active metabolite of irinotecan) Gastrointestinal toxicity Less common: diarrhea, nausea Common: diarrhea, nausea, vomiting Off-target toxicity of SG due to SN-38 (active metabolite of irinotecan) Ocular toxicity Common: dry eyes, blurred vision Rare On-target, off-site toxicity of EV due to Nectin-4 expression in ocular tissues Hepatotoxicity Common: mild elevations in liver enzymes Less common: mild elevations in liver enzymes Off-target toxicity of EV and SG Pneumonitis Less common Less common Off-target toxicity of EV and SG EV = enfortumab vedotin, SG = sacituzumab govitecan, MMAE = monomethyl auristatin E, SJS/TEN = Stevens-Johnson syndrome/toxic epidermal necrolysis Table 4 Radiology related issues for ADC-based treatment in patients with locally unresectable or metastatic bladder cancer Clinical questions What radiologists need to know Which imaging modalities should be primarily ordered for screening or baseline imaging before ADC-based treatment? - In the NCCN guidelines, both CT and MRI are recommended for evaluating primary bladder cancer and metastatic disease - Chest/abdomen/pelvis CT remains a key modality, and if a more detailed evaluation of bladder cancer is needed, either CT abdomen/pelvis using a CT urography protocol can be utilized - FDG-PET/CT is also recommended (category 2B) Which imaging modalities should be performed for patients with suspected bone or brain metastasis? The NCCN guidelines recommend FDG-PET/CT or bone scan for bone metastasis, and brain MRI without/with contrast for brain metastasis in both screening and follow-up (category 2B) Which response criteria should be used for clinical trial? RECIST 1.1 is enough, as pseudoprogression has been reported very rarely in urothelial carcinoma How to differentiate CR and PR on imaging? CR rate is a critical endpoint in some clinical trial. When primary bladder cancer is resolved, remaining scar tissue may hamper to determine CR. Multiparametric MRI might be helpful. For example, dense T2 hypointensity without diffusion restriction of the bladder lesion may represent CR How can we diagnose pneumonitis on CT? Pneumonitis can be detected and classified on CT according to ATS/ERS classification. The most common pattern of EV or SG-related pneumonitis is organizing pneumonia. Frequently, clinical correlation is required to differentiate drug-related pneumonitis and infectious pneumonia How can we use CT for gastrointestinal toxicity? When patients show severe diarrhea along with abdominal pain and laboratory abnormalities, abdominal CT can be used to evaluate any superimposed enterocolitis ADC = antibody-drug conjugate, NCCN = National Comprehensive Cancer Network, CT = computed tomography, MRI = magnetic resonance imaging, FDG = fluorodeoxyglucose, PET = positron emission tomography, RECIST = Response Evaluation Criteria in Solid Tumors, CR = complete response, PR = partial response, ATS/ERS = American Thoracic Society/European Respiratory Society, EV = enfortumab vedotin, SG = sacituzumab govitecan ",
  "metadata": {
    "Title of this paper": "Impact of pseudoprogression and treatment beyond progression on outcome in patients with non-small cell lung cancer treated with immune checkpoint inhibitors",
    "Journal it was published in:": "Korean Journal of Radiology",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12479225/"
  }
}