{
  "title": "Paper_1237",
  "abstract": "pmc Cancers (Basel) Cancers (Basel) 2105 cancers cancers Cancers 2072-6694 Multidisciplinary Digital Publishing Institute  (MDPI) PMC12468572 PMC12468572.1 12468572 12468572 41008844 10.3390/cancers17183001 cancers-17-03001 1 Systematic Review Cognitive Stimulation Interventions for Chemotherapy-Related Cognitive Impairment in Breast Cancer Patients: A Systematic Review and Meta-Analysis https://orcid.org/0000-0002-0942-6345 Cáceres Macarena C. 1 2 3 https://orcid.org/0000-0002-7363-0631 Martín-Parrilla Miguel Ángel 2 3 4 * https://orcid.org/0000-0003-4494-3142 Montanero-Fernández Jesús 5 Santos-Fernández Aitana 6 López-Jurado Casimiro Fermín 1 2 3 https://orcid.org/0000-0003-1001-7538 Durán-Gómez Noelia 1 2 3 Richmond Ann Academic Editor 1 mcaceres@unex.es casimirolj@unex.es nduran@unex.es 2 3 4 5 jmf@unex.es 6 * miguelangelmp@unex.es 14 9 2025 9 2025 17 18 497140 3001 28 7 2025 03 9 2025 12 9 2025 14 09 2025 27 09 2025 29 09 2025 © 2025 by the authors. 2025 https://creativecommons.org/licenses/by/4.0/ Licensee MDPI, Basel, Switzerland. This article is an open access article distributed under the terms and conditions of the Creative Commons Attribution (CC BY) license ( https://creativecommons.org/licenses/by/4.0/ Simple Summary Cognitive difficulties are a common and often persistent side effect experienced by many breast cancer patients following chemotherapy, negatively affecting daily functioning and overall quality of life. These cognitive impairments, frequently referred to as “chemo brain”, may include problems with memory, attention, and processing speed. This study systematically reviewed and analysed recent clinical trials to evaluate the effectiveness of cognitive stimulation interventions in managing these symptoms. The review aimed to identify not only the efficacy of such interventions but also key characteristics such as optimal timing, techniques, and duration. Although the findings suggest a moderate beneficial effect on cognitive functioning, methodological variability among studies limits the strength of the conclusions. These results emphasize the need for further research to develop standardized, evidence-based approaches for early cognitive support in breast cancer care. Abstract Background Objectives Methodology Results p 2 Conclusions breast neoplasm chemotherapy-related cognitive impairment cognitive training systematic review meta-analysis oncology nursing European Union (European Regional Development Fund) Regional Government of Extremadura GR24011 This project has been co-financed at 85% by the European Union (European Regional Development Fund) and the Regional Government of Extremadura. Managing Authority: Ministry of Finance. Reference number: GR24011. pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement no pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes 1. Introduction Although breast cancer (BC) is one of the most prevalent cancers among women worldwide, early detection and current treatment strategies have significantly improved survival rates [ 1 It has been previously demonstrated that BC patients often experience a psychoneurological symptom cluster, which includes sleep disturbances, fatigue, anxiety, depressive symptoms, and cognitive impairment [ 2 3 4 5 One of the primary symptoms negatively affecting the QoL in BC patients is chemotherapy-related cognitive impairment (CRCI). CRCI is characterized by cognitive deficits in areas such as memory, attention, and executive function, which can interfere with daily functioning and reduce occupational performance [ 6 7 8 9 A substantial proportion of BC patients experience CRCI even after the completion of treatment, with prevalence rates remaining elevated for more than one year, and in some cases persisting five years or more post-chemotherapy [ 10 11 12 Several meta-analyses have evaluated the effectiveness of non-pharmacological interventions in improving cognitive function in BC survivors, suggesting that such approaches should be promoted as viable strategies for preventing and treating CRCI [ 13 14 15 Cognitive stimulation serves as an overarching concept that includes both cognitive training and cognitive rehabilitation, each with distinct approaches. According to Woods et al. (2012), cognitive stimulation involves group-based activities aimed at enhancing general cognitive and social functioning [ 16 Although some authors have conducted systematic reviews on cognitive stimulation to address CRCI [ 17 18 19 2. Materials and Methods A systematic review was conducted in accordance with the Preferred Reporting Items for Systematic Reviews and Meta-Analyses (PRISMA) statement [ 20 2.1. Inclusion Criteria Studies involving women aged 18 years or older, diagnosed with stage 0 to IV BC, at any point in the treatment continuum. Studies investigating cognitive stimulation interventions (cognitive rehabilitation or cognitive stimulation), either as stand-alone approaches or in combination with other interventions. Comparators were not restricted; studies comparing the intervention to usual care, waitlist control, or other non-pharmacological interventions were eligible. Outcomes included at least one measure of cognitive function assessed both at baseline and at follow-up using any validated neuropsychological test, whether reported as a primary or secondary outcome. Among study designs, only randomized controlled trials were included. Pilot studies and studies published in English between 2020 and 2025 were considered. 2.2. Exclusion Criteria Studies involving patients with cancers other than BC. Studies that did not assess and/or report cognitive functioning as a dependent variable. Non-interventional studies. Review articles. 2.3. Search Strategy A comprehensive literature search was performed on 12 January 2025, across three electronic databases: PubMed/MEDLINE, Web of Science, and Scopus. Medical Subject Headings (MeSH) and keywords included terms related to: Breast cancer (e.g., “breast neoplasm” OR “breast cancer”), Cognitive impairment (e.g., “cognitive impairment” OR “chemotherapy-related cognitive impairment” OR “chemo brain”), Cognitive interventions (e.g., “cognitive stimulation” OR “cognitive rehabilitation” OR “cognitive training”). These terms were combined using the Boolean operator AND. Relevant systematic reviews and meta-analyses were also screened, and reference lists from these reviews were examined iteratively until no further eligible studies were found. 2.4. Study Selection Process All references retrieved from the electronic databases were imported into Zotero (version 7.0), a reference management software, and duplicates were removed. Following de-duplication, two independent reviewers (L.R.-S. and C.F.-M.) screened the titles and abstracts of the remaining studies for relevance. Full-text reviews were conducted for studies that met the initial inclusion criteria. Any disagreements between reviewers during the selection process were resolved through discussion and consensus, guided by the predefined eligibility criteria. Additionally, reference lists of identified systematic reviews were manually screened to identify any further relevant studies. A PRISMA flow diagram was used to illustrate the study selection process ( Figure 1 2.5. Data Extraction Process Following the initial review of studies, a second researcher independently coded and entered information from each included study into standardized data extraction forms. Zotero software was used to manage the studies and support the data extraction process. The extracted data included: study characteristics (first author, year of publication, regions of origin), sample size, intervention characteristics (type of intervention, intervention duration, total hours, number of sessions, setting [individual vs. group]), outcome measures used to evaluate cognitive function. Outcome data included the cognitive domains assessed and the total scores from self-reported cognitive measures, whose reliability and validity had been previously established. Additionally, data regarding the eligibility criteria, the time of CRCI measurement, and the characteristics of the control group were also extracted. 2.6. Risk of Bias Assessment Two reviewers independently assessed the risk of bias for each study using the Cochrane Risk of Bias Tool version 2.0 [ 21 The assessment focused on five domains: Bias arising from the randomization process, Bias due to deviations from intended interventions, Bias due to missing outcome data, Bias in the measurement of outcomes, and Bias in the selection of the reported results. 2.7. Meta-Analysis Data analysis was performed using IBM SPSS Statistics (version 29). A random-effects meta-analysis model for continuous outcomes was conducted. In each study, a single intervention group was compared to a control group, with cognitive outcomes assessed after the intervention. The analysis was based on standardized mean differences (Cohen’s d) rather than raw scores, due to the heterogeneity of cognitive measures across studies. Heterogeneity was assessed using τ 2 2 2 22 Forest plots and funnel plots were used to assess heterogeneity and publication bias. When cognitive function was assessed multiple times after the intervention, only the immediate post-intervention result was included. In studies with multiple intervention groups, these were combined into a single group using pooled means and variances. Baseline cognitive scores were not used as the primary comparison metric due to the randomized design of all studies. Although pre-post differences would have been more informative, this approach was not feasible in all cases, as some studies did not report sufficient data to calculate the variance of the change. In two studies where baseline differences between experimental and control groups were statistically significant, post-intervention means were adjusted accordingly. When cognitive assessment tools used inverse scoring (i.e., higher scores indicated worse performance), the direction of Cohen’s d was reversed to ensure consistency across studies. 3. Results 3.1. Intervention Characteristics The general characteristics of the 12 studies included in this systematic review are summarized in Table 1 A detailed description of the included studies is provided in Table 2 23 24 25 26 27 28 29 30 31 32 33 34 Of the interventions, 58.3% (n = 7) were delivered in group settings [ 23 24 25 26 28 29 33 27 30 31 32 34 A high degree of variability was observed in the number of sessions and overall therapy duration. Intervention lengths ranged from 2 to 24 weeks. Most studies (58.3%) were conducted over a period of 6 to 12 weeks [ 24 25 26 28 29 32 33 30 34 27 31 The average total duration of sessions was 15.57 h (±21.90). In eight studies (67%), the total duration was 10 h or less [ 23 24 25 27 29 30 33 34 28 26 31 32 3.2. Cognitive Assessment Methods Different eligibility criteria and cognitive assessment methods were used across studies. Some relied solely on self-reported cognitive complaints (41.7%) [ 26 28 30 31 32 23 24 25 27 29 33 34 The FACT-Cog was the most commonly used tool to assess CRCI, appearing in 75% of the studies [ 23 24 25 26 28 29 30 33 34 Other instruments used included: Cognitive Failures Questionnaire (CFQ) [ 31 32 27 23 24 3.3. Timing of the Intervention and Follow-Up A subset of the selected studies (n = 5) implemented cognitive interventions during active chemotherapy treatment (defined as ≥2 chemotherapy cycles) [ 23 24 25 27 33 26 28 29 30 32 31 34 Regarding the assessment timeline, five studies conducted evaluations of CRCI both at baseline and immediately after the intervention [ 23 24 27 32 34 25 26 28 29 30 31 33 All included studies employed a comparative design to evaluate the efficacy of cognitive stimulation interventions. These were contrasted against control groups that received various types of alternative or minimal interventions. Importantly, five of the studies (41.6%) utilized waitlist control groups [ 23 24 25 26 29 Beyond the primary outcome of CRCI, several studies examined additional psychological and functional variables known to influence cognitive outcomes. These included anxiety and depression [ 25 28 30 31 25 29 23 24 30 32 33 34 3.4. Risk of Bias in Studies A detailed risk of bias assessment is presented in Figure 2 The randomization process showed the greatest variability, with approximately 70% of studies rated as having low risk of bias, while the remainder were assessed as having either some concerns or a high risk of bias. The domain of deviations from intended interventions was predominantly rated as low risk, although around 30% of studies raised some concerns. In contrast, the domains related to missing outcome data and measurement of the outcome were associated with a high proportion, approximately 90%, of low-risk ratings. The first domain concerning the selection of the reported result revealed some concerns in 20% of studies and a high risk of bias in 10%. Regarding the overall risk of bias, fewer than 20% of studies were judged to be at low risk. The majority were classified as raising some concerns, and approximately 25% were considered to be at high risk of bias. These findings indicate potential methodological limitations that may compromise the internal validity of the included studies. 3.5. Meta-Analysis Two studies [ 24 34 3.5.1. Overall Effect of Cognitive Training Interventions The outcomes of the cognitive assessment studies are summarised in Figure 3 Figure 4 p 3.5.2. Heterogeneity Analysis The lack of statistical significance may be attributed to substantial heterogeneity, indicated by τ 2 p 2 Figure 3 Ding et al. (2020) [ 23 p Shari et al. (2021) [ 25 p Li et al. (2022) [ 27 p Garland et al. (2024) [ 29 p Conversely, weaker and non-significant positive effects were observed in: Bellens et al. (2020) [ 31 p Myers et al. (2020) [ 26 p Moreover, several studies showed non-significant effects favouring the control group: Von Ah et al. (2022) [ 32 p Vardy et al. (2023) [ 28 p Chandran et al. (2024) [ 33 p Interestingly, the study by Chapman et al. (2023) showed a moderate and significant effect in favour of the control group immediately post-intervention (d = −0.74, p 30 Figure 3 27 23 32 30 31 28 25 26 33 29 30 3.5.3. Publication Bias The funnel plot presented in Figure 4 4. Discussion 4.1. Study Characteristics This study investigated the effects of cognitive stimulation for managing CRCI in BC patients through a systematic review and meta-analysis. Out of the 165 studies initially identified, a total of 12 met the inclusion and exclusion criteria and were selected for systematic review. Nearly 80% of the included studies were conducted in North America or Asia, with minimal representation from Europe. Cognitive stimulation therapies have long been used to support patients with dementia at various stages and are now being explored as targeted interventions for CRCI across different types of cancer. Fernandes et al. (2019) reviewed 19 studies—mostly randomized clinical trials—implementing cognitive rehabilitation programs, including structured cognitive training and compensatory strategies, in patients with non-central nervous system (non-CNS) cancers [ 18 19 17 In addition to reviews specifically focused on cognitive stimulation, others have addressed a wider range of non-pharmacological interventions for CRCI, including cognitive stimulation, rehabilitation, and training. These reviews differ in population focus, intervention types, and the cognitive domains assessed. Four notable reviews [ 14 15 35 36 35 14 36 12 37 Our review observed substantial diversity in cognitive stimulation and training interventions, with durations ranging from less than 6 to more than 12 weeks, total hours from fewer than 3 to over 75, and implementation at various points in the treatment timeline (during chemotherapy or 3 months to 1 year post-treatment). The timing of intervention is a particularly important factor. The literature remains divided on the optimal period for addressing CRCI. Some authors advocate intervening during chemotherapy to mitigate its impact on QoL and support emotional and occupational recovery. However, most studies are conducted at least 6 months after chemotherapy, largely due to recruitment challenges during active treatment, when patients experience significant physical and emotional side effects and may be less willing to participate. Additionally, maladaptive coping strategies often develop during this phase, potentially compromising study outcomes [ 9 When interpreting these findings, it is also important to consider patient-related factors. Root et al. (2023) have shown that advanced age, particularly in patients over 75 years, may contribute to cognitive decline through both cancer treatment and age-related processes [ 38 39 40 The quality assessment of the selected studies revealed considerable methodological variability. Fewer than 20% of the studies were judged to be at low risk of bias, while the majority raised some concerns, and approximately 25% were categorized as having a high risk of bias. Overall, the evidence base of this review presents a moderate risk of bias, with notable weaknesses particularly in the domains of randomization and selective reporting. These limitations may affect the internal validity of the findings and should be taken into account when interpreting the results of the systematic review and meta-analysis. 4.2. Intervention Effects The results of the meta-analysis examining the effects of cognitive stimulation interventions indicate a moderate overall effect size (Cohen’s d p The heterogeneity analysis revealed substantial inconsistency across studies (τ 2 p 2 Figure 3 23 25 27 29 28 30 30 Despite the substantial heterogeneity, the direction of the effect generally favoured cognitive stimulation interventions. Moreover, the symmetrical distribution of studies in the funnel plot ( Figure 4 4.3. Limitations This review provides a meaningful contribution to the current understanding of cognitive stimulation interventions for CRCI in BC patients; however, several limitations should be acknowledged. First, the relatively small number of included studies, combined with the restriction of the inclusion period to 2020–2025, may reduce the representativeness and generalizability of the findings. This temporal restriction was intentional, as our aim was to synthesize the most methodologically up-to-date evidence. Second, there was substantial inconsistency in how cognitive stimulation was defined and implemented, reflecting both heterogeneity in the literature and the evolving nature of these interventions. Outcome measures also varied, with some studies employing the FACT-Cog scale and others using alternative instruments, thereby complicating cross-study comparisons. Nonetheless, this variation reflects a growing methodological interest in the field. Additionally, two studies were excluded from the meta-analysis due to insufficient statistical reporting, which may have influenced the overall pooled estimate. Despite these limitations, the review offers a timely synthesis of recent evidence and identifies key directions for future research and clinical practice. 5. Conclusions Cognitive stimulation and training interventions have the potential to improve cognitive functioning in BC patients who have undergone chemotherapy. However, substantial heterogeneity exists across studies in terms of both intervention characteristics and the assessment criteria used for CRCI. Consequently, further research is needed to comprehensively investigate the pathophysiology of CRCI, as well as effective methods for its prevention and treatment. Such efforts would support the development of unified strategies or early, personalised intervention protocols tailored to the specific needs of each patient. Disclaimer/Publisher’s Note: Author Contributions Conceptualization, M.C.C., M.Á.M.-P., J.M.-F., A.S.-F., C.F.L.-J. and N.D.-G.; Data curation, J.M.-F.; Formal analysis, M.Á.M.-P. and J.M.-F.; Funding acquisition, N.D.-G.; Investigation, M.C.C., M.Á.M.-P. and A.S.-F.; Methodology, M.C.C., M.Á.M.-P., J.M.-F. and N.D.-G.; Project administration, N.D.-G.; Resources, M.C.C. and M.Á.M.-P.; Supervision, N.D.-G.; Validation, M.C.C., M.Á.M.-P. and N.D.-G.; Visualization, M.C.C., M.Á.M.-P., J.M.-F. and C.F.L.-J.; Writing—original draft, M.C.C., M.Á.M.-P., J.M.-F. and A.S.-F.; Writing—review & editing, M.C.C., M.Á.M.-P. and N.D.-G. All authors have read and agreed to the published version of the manuscript. Institutional Review Board Statement Not applicable. Informed Consent Statement Not applicable. Data Availability Statement No new data were created or analysed in this study. Data sharing is not applicable to this article. Conflicts of Interest The authors declare no conflicts of interest. Abbreviations The following abbreviations are used in this manuscript: ACT Acceptance and Commitment Therapy ADLs Activities of Daily Living APT Attention Process Training BC Breast Cancer BDNF Brain-Derived Neurotrophic Factor BADS Behavioural Assessment of the Dysexecutive Syndrome CACT Computer-Assisted Cognitive Training CALM Cancer and Living Meaningfully CBT-I Cognitive Behavioral Therapy for Insomnia CDT Cognitive Dysfunction Test CFQ Cognitive Failures Questionnaire CRCI Chemotherapy-Related Cognitive Impairment CST Compensatory Strategy Training EEG Electroencephalogram FACT-B Functional Assessment of Cancer Therapy-Breast FACT-Cog Functional Assessment of Cancer Therapy-Cognitive Function IIV Intra-individual Variability ISI Insomnia Severity Index MMSE Mini-Mental State Examination MoCA Montreal Cognitive Assessment MDR Multidimensional Rehabilitation Program PRISMA Preferred Reporting Items for Systematic Reviews and Meta-Analyses PROMIS Patient-Reported Outcomes Measurement Information System QoL Quality of Life RBMT-II Rivermead Behavioural Memory Test-Second Edition RRS Ruminative Response Scale WAI Working Alliance Inventory References 1. Pimentel-Parra G.A. García-Vivar C. Escalada-Hernández P. San Martín-Rodríguez L. Soto-Ruiz N. Systematic Review of Clinical Practice Guidelines for Long-Term Breast Cancer Survivorship: Assessment of Quality and Evidence-Based Recommendations Br. J. Cancer 2025 2025 178 193 10.1038/s41416-025-03059-5 PMC12304102 40382523 2. Cáceres M.C. Nadal-Delgado M. López-Jurado C. Pérez-Civantos D. Guerrero-Martín J. Durán-Gómez N. Factors Related to Anxiety, Depressive Symptoms and Quality of Life in Breast Cancer Int. J. Environ. Res. Public Health 2022 19 3547 10.3390/ijerph19063547 35329232 PMC8955820 3. Cáceres M.C. Pérez-Civantos D. Guerrero-Martín J. Delgado M.N. Jurado C.L. Durán-Gómez N. Depressive Symptoms and Quality of Life Associated with the Use of Monoclonal Antibodies in Breast Cancer Treatment Oncol. Nurs. Forum 2021 48 535 545 10.1188/21.ONF.535-545 34411080 4. Durán-Gómez N. Martín-Parrilla M.Á. López-Jurado C.F. Montanero-Fernández J. Nadal-Delgado M. Cáceres M.C. The Need for Comprehensive Sleep Disturbances Assessment and Management in Breast Cancer Care Sci. Rep. 2025 15 21235 10.1038/s41598-025-05315-3 40596253 PMC12219742 5. Qi Y. Li H. Guo Y. Cao Y. Wong C.L. Symptom Clusters in Breast Cancer Patients Receiving Adjuvant Chemotherapy: A Systematic Review J. Clin. Nurs. 2024 33 4554 4567 10.1111/jocn.17479 39394646 6. Yang Y. Von Ah D. Cancer-Related Cognitive Impairment: Updates to Treatment, the Need for More Evidence, and Impact on Quality of Life—A Narrative Review Ann. Palliat. Med. 2024 13 1261280 1265280 10.21037/apm-24-70 39260437 7. Kohler C. Chang M. Allemann-Su Y.-Y. Vetter M. Jung M. Jung M. Conley Y. Paul S. Kober K.M. Cooper B.A. Changes in Attentional Function in Patients from before through 12 Months after Breast Cancer Surgery J. Pain. Symptom Manag. 2020 59 1172 1185 10.1016/j.jpainsymman.2020.01.001 31953207 PMC7239765 8. Oberste M. Schaffrath N. Schmidt K. Bloch W. Jäger E. Steindorf K. Hartig P. Joisten N. Zimmer P. Protocol for the “Chemobrain in Motion--Study”(CIM--Study): A Randomized Placebo-Controlled Trial of the Impact of a High-Intensity Interval Endurance Training on Cancer Related Cognitive Impairments in Women with Breast Cancer Receiving First-Line Chemot BMC Cancer 2018 18 1071 10.1186/s12885-018-4992-3 30400840 PMC6220507 9. Durán-Gómez N. López-Jurado C.F. Nadal-Delgado M. Pérez-Civantos D. Guerrero-Martín J. Cáceres M.C. Chemotherapy-Related Cognitive Impairment in Patients with Breast Cancer Based on Functional Assessment and NIRS Analysis J. Clin. Med. 2022 11 2363 10.3390/jcm11092363 35566489 PMC9100963 10. Whittaker A.L. George R.P. O’Malley L. Prevalence of Cognitive Impairment Following Chemotherapy Treatment for Breast Cancer: A Systematic Review and Meta-Analysis Sci. Rep. 2022 12 2135 10.1038/s41598-022-05682-1 35136066 PMC8826852 11. Vrancken Peeters N.J.M.C. Koppert L.B. Jager A. Hendriks M.P. Siesling S. van den Hurk C.J.G. Symptom Monitoring and Health-Related Quality of Life in Non-Metastatic Breast Cancer Patients: A Systematic Review Curr. Breast Cancer Rep. 2024 16 417 428 10.1007/s12609-024-00562-1 12. Mackenzie L. Marshall K. Effective Non-Pharmacological Interventions for Cancer Related Cognitive Impairment in Adults (Excluding Central Nervous System or Head and Neck Cancer): Systematic Review and Meta-Analysis Eur. J. Phys. Rehabil. Med. 2021 58 258 270 10.23736/S1973-9087.21.06898-2 34498828 PMC9980504 13. Park J.-H. Jung Y.S. Kim K.S. Bae S.H. Effects of Compensatory Cognitive Training Intervention for Breast Cancer Patients Undergoing Chemotherapy: A Pilot Study Support. Care Cancer 2017 25 1887 1896 10.1007/s00520-017-3589-8 28132089 14. Liu Y. Liu J.-E. Chen S. Zhao F. Chen L. Li R. Effectiveness of Nonpharmacologic Interventions for Chemotherapy-Related Cognitive Impairment in Breast Cancer Patients: A Systematic Review and Network Meta-Analysis Cancer Nurs. 2023 46 E305 E319 10.1097/NCC.0000000000001152 37607381 15. Yang P. Hu Q. Zhang L. Shen A. Zhang Z. Wang Q. Lu Q. Effects of Non-Pharmacological Interventions on Cancer-Related Cognitive Impairment in Patients with Breast Cancer: A Systematic Review and Network Meta-Analysis Eur. J. Oncol. Nurs. 2025 75 102804 10.1016/j.ejon.2025.102804 39919600 16. Woods B. Aguirre E. Spector A.E. Orrell M. Cognitive stimulation to improve cognitive functioning in people with dementia Cochrane Database Syst Rev. 2012 CD005562 10.1002/14651858.CD005562.pub2 22336813 17. Di Iulio F. Cravello L. Shofany J. Paolucci S. Caltagirone C. Morone G. Neuropsychological Disorders in Non-Central Nervous System Cancer: A Review of Objective Cognitive Impairment, Depression, and Related Rehabilitation Options Neurol. Sci. 2019 40 1759 1774 10.1007/s10072-019-03898-0 31049790 18. Fernandes H.A. Richard N.M. Edelstein K. Cognitive Rehabilitation for Cancer-Related Cognitive Dysfunction: A Systematic Review Support. Care Cancer 2019 27 3253 3279 10.1007/s00520-019-04866-2 31147780 19. Binarelli G. Joly F. Tron L. Lefevre Arbogast S. Lange M. Management of Cancer-Related Cognitive Impairment: A Systematic Review of Computerized Cognitive Stimulation and Computerized Physical Activity Cancers 2021 13 5161 10.3390/cancers13205161 34680310 PMC8534081 20. Page M.J. McKenzie J.E. Bossuyt P.M. Boutron I. Hoffmann T.C. Mulrow C.D. Shamseer L. Tetzlaff J.M. Akl E.A. Brennan S.E. The PRISMA 2020 Statement: An Updated Guideline for Reporting Systematic Reviews BMJ 2021 372 n71 10.1136/bmj.n71 33782057 PMC8005924 21. Sterne J.A.C. Savović J. Page M.J. Elbers R.G. Blencowe N.S. Boutron I. Cates C.J. Cheng H.Y. Corbett M.S. Eldridge S.M. RoB 2: A Revised Tool for Assessing Risk of Bias in Randomised Trials BMJ 2019 366 l4898 10.1136/bmj.l4898 31462531 22. Ioannidis J.P.A. Patsopoulos N.A. Evangelou E. Uncertainty in Heterogeneity Estimates in Meta-Analyses BMJ 2007 335 914 916 10.1136/bmj.39343.408449.80 17974687 PMC2048840 23. Ding K. Zhang X. Zhao J. Zuo H. Bi Z. Cheng H. Managing Cancer and Living Meaningfully (CALM) Intervention on Chemotherapy-Related Cognitive Impairment in Breast Cancer Survivors Integr. Cancer Ther. 2020 19 1534735420938450 10.1177/1534735420938450 32683997 PMC7370330 24. Yao S. Ding K. Liu S. Zhang Q. Li W. Tang L. Yu S. Pang L. Yin X. Cheng H. The Managing Cancer and Living Meaningfully (CALM) Intervention Alleviates Chemotherapy-Related Cognitive Impairment in Patients with Breast Cancer by Modulating Pan-Immune-Inflammation Values Integr. Cancer Ther. 2022 21 15347354221140498 10.1177/15347354221140498 36419389 PMC9703526 25. Shari N.I. Zainal N.Z. Ng C.G. Effects of Brief Acceptance and Commitment Therapy (ACT) on Subjective Cognitive Impairment in Breast Cancer Patients Undergoing Chemotherapy J. Psychosoc. Oncol. 2021 39 695 714 10.1080/07347332.2020.1856283 33287685 26. Myers J.S. Cook-Wiens G. Baynes R. Jo M.Y. Bailey C. Krigel S. Klemp J. Asher A. Emerging From the Haze: A Multicenter, Controlled Pilot Study of a Multidimensional, Psychoeducation-Based Cognitive Rehabilitation Intervention for Breast Cancer Survivors Delivered With Telehealth Conferencing Arch. Phys. Med. Rehabil. 2020 101 948 959 10.1016/j.apmr.2020.01.021 32179067 27. Li Z. Hao X. Lei P. Zhou L. Chen C. Tan T. Yue L. Patients With Breast Cancer Receiving Chemotherapy: Effects of Multisensory Stimulation Training on Cognitive Impairment Clin. J. Oncol. Nurs. 2022 26 71 77 10.1188/22.cjon.71-77 35073301 28. Vardy J.L. Pond G.R. Bell M.L. Renton C. Dixon A. Dhillon H.M. A Randomised Controlled Trial Evaluating Two Cognitive Rehabilitation Approaches for Cancer Survivors with Perceived Cognitive Impairment J. Cancer Surviv. 2023 17 1583 1595 10.1007/s11764-022-01261-5 36241767 PMC9568997 29. Garland S.N. Tulk J. Savard J. Rash J.A. Browne S. Urquhart R. Seal M. Thoms J. Laing K. Randomized Controlled Trial of Virtually Delivered Cognitive Behavioral Therapy for Insomnia to Address Perceived Cancer-Related Cognitive Impairment in Cancer Survivors J. Clin. Oncol. 2024 42 2094 2104 10.1200/JCO.23.02330 38552188 30. Chapman B. Louis C.C. Moser J. Grunfeld E.A. Derakshan N. Benefits of Adaptive Cognitive Training on Cognitive Abilities in Women Treated for Primary Breast Cancer: Findings from a 1-Year Randomised Control Trial Intervention Psychooncology 2023 32 1848 1857 10.1002/pon.6232 37882108 PMC10946857 31. Bellens A. Roelant E. Sabbe B. Peeters M. van Dam P.A. A Video-Game Based Cognitive Training for Breast Cancer Survivors with Cognitive Impairment: A Prospective Randomized Pilot Trial Breast 2020 53 23 32 10.1016/j.breast.2020.06.003 32554133 PMC7375646 32. Von Ah D. McDonald B.C. Crouch A.D. Ofner S. Perkins S. Storey S. Considine R. Unverzagt F. Randomized Double-Masked Controlled Trial of Cognitive Training in Breast Cancer Survivors: A Preliminary Study Support. Care Cancer 2022 30 7457 7467 10.1007/s00520-022-07182-4 35648204 PMC9156616 33. Chandran G. Tang N. Ngo E.L.P. Huang S. Tong S.I. Ong J.X. Chew E. Comparing the Efficacy of a Multi-Dimensional Breast Cancer Rehabilitation Programme versus a Home-Based Exercise Programme during Adjuvant Cancer Treatment BMC Cancer 2024 24 361 10.1186/s12885-024-12080-5 38509471 PMC10956284 34. Smith T.M. Wang W. Comparison of a Standard Computer-Assisted Cognitive Training Program to a Music Enhanced Program: A Mixed Methods Study Cancer Rep. 2021 4 e1325 10.1002/cnr2.1325 PMC8451368 33301652 35. Floyd R. Dyer A.H. Kennelly S.P. Non-Pharmacological Interventions for Cognitive Impairment in Women with Breast Cancer Post-Chemotherapy: A Systematic Review J. Geriatr. Oncol. 2021 12 173 181 10.1016/j.jgo.2020.05.012 32536427 36. Park J.H. Jung S.J. Lee L.J. Rhu J. Bae S.H. Impact of Nonpharmacological Interventions on Cognitive Impairment in Women with Breast Cancer: A Systematic Review and Meta-Analysis Asia Pac. J. Oncol. Nurs. 2023 10 100212 10.1016/j.apjon.2023.100212 37095894 PMC10121786 37. Zeng Y. Dong J. Huang M. Zhang J. Zhang X. Xie M. Wefel J.S. Nonpharmacological Interventions for Cancer-Related Cognitive Impairment in Adult Cancer Patients: A Network Meta-Analysis Int. J. Nurs. Stud. 2020 104 103514 10.1016/j.ijnurstu.2019.103514 32004776 38. Root J.C. Li Y. Schofield E. Orlow I. Ryan E. Traina T. Patel S.K. Ahles T.A. Cognitive Aging in Older Breast Cancer Survivors Cancers 2023 15 3208 10.3390/cancers15123208 37370818 PMC10296698 39. Hsu Y.H. Chen H.J. Wu S.I. Tzang B.S. Hsieh C.C. Weng Y.P. Hsu Y.T. Hsiao H.P. Chen V.C.H. Cognitive Function and Breast Cancer Molecular Subtype before and after Chemotherapy Appl. Neuropsychol. Adult 2025 32 442 449 10.1080/23279095.2023.2176233 36773021 40. Vance D.E. Collette C. Frank J.S. Billings B. Deaver J. del Bene V.A. Fazeli P.L. Bail J.R. Li W. Triebel K.L. Cognitive Intra-Individual Variability in Breast Cancer Survivors: A Systematic Review Appl. Neuropsychol. Adult 2025 32 1346 1360 10.1080/23279095.2023.2270097 37878814 PMC11043212 Figure 1 PRISMA Flow Diagram of the Study Selection Process. Figure 2 Summary of risk of bias for studies included in ( a 24 34 b 23 25 26 27 28 29 30 31 32 33 Figure 3 Forest plot illustrating effect sizes and confidence intervals for each individual study [ 23 25 26 27 28 29 30 31 32 33 Figure 4 Funnel plot of standard errors and effect sizes [ 23 25 26 27 28 29 30 31 32 33 cancers-17-03001-t001_Table 1 Table 1 General Characteristics of the 12 Studies Included in the Systematic Review. Characteristic Categories N (%) Region * North America 6 (42.9)  Europe 2 (14.3)  Asia 5 (35.7)  Australia 1 (7.1) Sample Size <50 3 (25.0)  50–100 8 (66.7)  >100 1 (8.3) Intervention Setting Individual 5 (41.6)  Group 7 (58.3) Intervention Duration (weeks) <6 2 (16.7)  6–12 7 (58.3)  >12 3 (25.0) Total Hours Mean = 15.57 (21.90)  Number of Sessions Mean = 28.92 (29.58)  * The total number of regions exceeds 12 because two studies were conducted across two of them. cancers-17-03001-t002_Table 2 Table 2 Detailed description of the studies included in the systematic review. First Author and Year Intervention Sessions Eligibility Method CRCI Measurement Control Group Time of Intervention Time of CRCI Measurement Other Variables Conclusions Bellens 2020 [ 31 Cognitive stimulation based on video games 60 min, three times per week, over 6 months Self-reported cognitive complaint CFQ, battery of questions Standard supportive care Not specified Before the intervention, and at 3 and 6 months post-intervention Anxiety and depression Cognitive functioning improved over time Ding 2020 [ 23 CALM 3 to 6 sessions, each 30 min, over a period of 3 to 6 months MMSE < 27 Karnofsky ≥ 80 FACT-Cog, MMSE, Fact-B Waitlist control 6 or more chemotherapy cycles Before and after the intervention Psychologica distress, QoL Positive effects on CRCI, QoL, and psychological distress Myers 26 Psychoeducation-based cognitive stimulation 6 sessions, 2.5 h each, over 6 weeks Self-reported cognitive complaint and presence of perceived cognitive fatigue (PCF) FACT-Cog Waitlist control Between 2 months and several years after chemotherapy After the intervention, and at 1 month, 3 months, and 12 months follow-up Loneliness Preliminary evidence of efficacy as a treatment for CRCI Shari 25 ACT 4 one-hour sessions over 9 to 12 weeks FACT-Cog FACT-Cog Waitlist control During active treatment Before, after the intervention, and at 3 months follow-up Depression, anxiety, fatigue, psychological inflexibility Effective intervention for improving subjective CRCI, anxiety, depression, and psychological inflexibility Smith 2021 [ 34 CACT 5 sessions per week for 1 month, 30 min each Self-reported cognitive complaint FACT-Cog CACT with music When patients report CRCI Before and after the intervention QoL, working memory Enhanced cognitive performance Li 2022 [ 27 Multisensorial Four 26-day cycles (5 days in hospital, 21 at home), 20 min daily Score < 26 on the MoCA. RBMT-II, BADS Audiovisual stimulation More than 2 chemotherapy cycles Before and after the intervention  CRCI and chemotherapy-induced cognitive dysfunction were reduced Vardy 28 APT and CST 2 h per week for 6 weeks “Do you feel your brain is functioning the same as before your cancer diagnosis?” FACT-Cog Current standard care 3 months after chemotherapy Before, after the intervention, and at 12 months follow-up Anxiety and depression Improved CRCI Von Ah 2022 [ 32 BrainHQ 40 h over 10 weeks Self-reported cognitive complaint PROMIS Cognitive Abilities and Cognitive Concerns Online computer-based activities 6 months after chemotherapy Before and after the intervention Plasma BDNF levels, QoL, and WAI Intervention was acceptable and satisfactory for managing CRCI Yao 2022 [ 24 CALM 6 sessions, 30 min each, over 12 weeks MMSE < 25 FACT-Cog, MMSE, Fact-B Waitlist control 6 or more chemotherapy cycles Before and after the intervention QoL, systemic inflammatory markers CRCI alleviated by reducing systemic inflammation levels Chapman 2023 [ 30 Dual n-back 12 sessions, 30 min each, over 2 weeks Self-reported cognitive complaint FACT-Cog and RRS Dual 1-back training Between 6 and 60 months after chemotherapy Before the intervention, and at 2 weeks, 6 months, and 1 year post-intervention CDT, anxiety, depression, QoL, EEG Improved cognitive efficiency, working memory, inhibitory control, and cortical potentials (PCA) Chandran 33 MDR 2.5 h total, over 12 weeks Undergoing active treatment FACT-Cog Unsupervised physical rehabilitation (home-based exercises) During active treatment Before, after the intervention, and at 6 months follow-up QoL and ADLs Effective intervention for patients experiencing CRCI Garland 29 CBT-I 7 sessions, 50 min each, over 7 weeks FACT-Cog FACT-Cog and ISI Waitlist control 6 months after chemotherapy Before and after the intervention, and at 3 and 6 months follow-up Insomnia Insomnia treatment contributed to improvements in CRCI Note: All abbreviations are listed in the Abbreviations section. ",
  "metadata": {
    "Title of this paper": "Cognitive Intra-Individual Variability in Breast Cancer Survivors: A Systematic Review",
    "Journal it was published in:": "Cancers",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12468572/"
  }
}