{
  "title": "Paper_713",
  "abstract": "pmc Res Pract Thromb Haemost Res Pract Thromb Haemost 3430 rpth Research and Practice in Thrombosis and Haemostasis 2475-0379 Elsevier PMC12478244 PMC12478244.1 12478244 12478244 41031136 10.1016/j.rpth.2025.103018 S2475-0379(25)00342-5 103018 1 Original Article Quantitative targeted proteomics for occult cancer screening in patients with unprovoked venous thromboembolism: results from the prospective PLATO-VTE study Guman Noori A.M. 1 2 3 ∗ Kraaijpoel Noémie 1 2 Mulder Frits I. 1 2 3 Carrier Marc 4 Jara-Palomares Luis 5 6 Di Nisio Marcello 7 Ageno Walter 8 Beyer-Westendorf Jan 9 Klok Frederikus A. 10 Vanassche Thomas 11 Otten Johannes M.M.B. 12 Cosmi Benilde 13 Peters Mike J.L. 14 ten Wolde Marije 15 Delluc Aurélien 4 Kamphuisen Pieter W. 1 2 3 Sánchez-López Verónica 6 16 17 Porreca Ettore 18 Ramaker Jip 19 Bossuyt Patrick M.M. 20 Büller Harry R. 1 2 Versteeg Henri H. 21 van Vlijmen Bart J.M. 21 van Es Nick 1 2 Mohammed Yassene y.mohammed@lumc.nl 22 23 24 ∗∗ 1 2 3 4 5 6 7 8 9 10 11 12 13 14 15 16 17 18 19 20 21 22 23 24 ∗ Correspondence ∗∗ y.mohammed@lumc.nl 8 2025 19 8 2025 9 6 495860 103018 22 5 2025 10 7 2025 12 8 2025 19 08 2025 30 09 2025 01 10 2025 © 2025 The Author(s) 2025 https://creativecommons.org/licenses/by/4.0/ This is an open access article under the CC BY license (http://creativecommons.org/licenses/by/4.0/). Background About 5% of patients with unprovoked venous thromboembolism (VTE) have occult cancer. Despite standard cancer screening, 50% of cancers remain undetected. Objectives We used quantitative targeted proteomics to identify novel cancer biomarkers among patients with unprovoked VTE. Methods Patients aged ≥40 years with a first unprovoked VTE and without a malignancy in the preceding 5 years were invited to an international prospective cohort study. Plasma samples were collected within 10 days after VTE. The primary outcome was an adjudicated cancer diagnosis during 12-month follow-up. Concentrations of 269 plasma proteins covering coagulation, complement, and cancer-associated pathways were measured using quantitative mass spectrometry-based targeted proteomics. In a nested case-control study, protein profiles of patients with cancer were compared with those of randomly sampled unique control patients (ratio 3:1). Proteins with an unadjusted P Results Of the 476 included participants, 28 (5.9%) were newly diagnosed with cancer. Plasma samples were available for 24 cases, which were compared with those of 75 control patients. Concentrations of P-selectin, β-2 microglobulin, complement component 7, intracellular adhesion molecule 1, and lumican were higher in cases than in controls, whereas coagulation factor (F)VII, FX, and FXII, β-Ala-His dipeptidase, and kalistatin were lower. The optimism-adjusted c-statistic of the multivariable logistic regression model including these proteins was 0.78 (95% CI, 0.70-0.87). Conclusion Ten differentially abundant proteins were identified in patients with occult cancer, suggesting potential of plasma proteomic tests as novel biomarker for occult cancer in patients with unprovoked VTE. Essentials • Previous data suggest that proteomics can detect plasma proteins associated with cancer. • In PLATO-VTE, we applied targeted proteomics to plasma from patients with unprovoked VTE. • Ten protein concentrations differed between patients with and without cancer at 1 year. • Targeted proteomics may potentially improve screening for occult cancer after unprovoked VTE. Keywords early detection of cancer liquid biopsy neoplasms proteomics venous thromboembolism pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement yes pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes 1 Background Unprovoked venous thromboembolism (VTE) can be the first manifestation of occult cancer. The cumulative incidence of a cancer diagnosis is about 5% within 12 months after VTE diagnosis [ 1 1 [1] [2] [3] Emerging data have shown the potential of plasma cancer biomarkers, also known as liquid biopsies, which could provide a noninvasive and highly sensitive occult cancer screening tool for patients with unprovoked VTE [ 4 5 6 Novel mass spectrometry (MS)-based technologies allow for absolute quantitation of hundreds of proteins using as little as 5 to 10 μL of plasma [ [7] [8] [9] [10] 11 2 Methods 2.1 Study design and patients PLATO-VTE was a multinational prospective cohort study evaluating novel biomarkers for occult cancer in patients with unprovoked VTE. A detailed description of the study protocol [ 11 12 Blood was collected in EDTA tubes within 10 days after VTE diagnosis, centrifuged at room temperature in 2 steps of 20 minutes (120 × g g 12 2.2 MS-based targeted proteomics We used multiple reaction monitoring (MRM) assays, which were developed and validated at the University of Victoria Proteomics Centre, Victoria, British Columbia, Canada, and included internal standard peptides for 269 proteins [ 7 9 10 13 14 15 7 9 10 16 Supplementary Table 1 13 14 [17] [18] [19] Supplementary Methods 2.3 Statistical analysis Absolute protein concentrations were used for unsupervised cluster analysis and heatmap visualization after centering and scaling. Only proteins with plasma concentrations 50% above the lower limit of quantification in 90% of all samples measured were included. Differences between groups were tested using the unpaired Student’s t P 2 20 21 22 P 23 3 Results A total of 476 patients were included between June 2016 and October 2020. At the 12-month follow-up, 28 (5.9%) were diagnosed with cancer. The type of cancer was a solid tumor in 22 (92%) patients. The most frequent cancer types were pancreatic ( n n Plasma samples were available for 24 cancer patients; 75 patients not diagnosed with cancer were randomly selected as controls ( Table 1 12 P P P Table 1 Patient characteristics at unprovoked venous thromboembolism diagnosis. Patient characteristics Patients with cancer during 12-month follow-up n Randomly selected controls without cancer n P Age in (y), median (IQR) 68 (63-76) 66 (57-73) .14 Female, n 14 (58.3) 32 (41.0) .21 Body mass index, median (IQR) 26.8 (25.8-29.8) 27.4 (24.8-32.4) .86 Smoking, n .89 Current or former smoker 10 (41.7) 37 (47.5) − Never smoked 12 (50.0) 36 (46.2) − Unknown 2 (8.3) 5 (6.4) − Previous provoked VTE, n a 4 (16.7) 3 (3.8) .09 Index event, n .32 Deep vein thrombosis only 12 (50.0) 41 (52.6) − Pulmonary embolism only 6 (25.0) 27 (34.6) − Pulmonary embolism and deep vein thrombosis 6 (25.0) 10 (12.8) − Previous malignancy >5 y prior to enrolment, n 5 (20.8) 2 (2.6) .01 Limited cancer screening results raising cancer suspicion, n 18 (75.0) 7 (9.0) <.001 Time (d) between VTE diagnosis and blood withdrawal, median (IQR) 4.5 (1.0-7.2) 4.0 (1.0-7.0) .52 Days from VTE to cancer diagnosis, median (IQR) 86 (40-157) − − Solid cancer, n 22 (91.7) − − Locoregional disease 14 (63.6) − − Distant metastases 8 (36.4) − − Hematological cancer, n 2 (8.3) − − Cancer type, n − − Pancreatic 4 (16.0) − − Lung (NSCLC) 3 (12.0) − − Melanoma 2 (8.0) − − Ovarian 2 (8.0) − − Prostate 2 (8.0) − − Renal 2 (8.0) − − Breast 1 (4.0) − − Colon 1 (4.0) − − Esophageal 1 (4.0) − − Leiomyosarcoma (pelvis) 1 (4.0) − − Lung (carcinoid) 1 (4.0) − − Dermatofibrosarcoma protuberans 1 (4.0) − − Vaginal 1 (4.0) − − Chronic lymphocytic leukemia 1 (4.0) − − Follicular lymphoma 1 (4.0) − − NSCLC, non small cell lung carcinoma; VTE, venous thromboembolism. a Only 1 patient had a history of both cancer and VTE. 3.1 Discriminating proteins Of the 269 proteins measured with internal standards, 211 (77%) passed all quantifiability criteria and were considered for further comparison and analysis ( Supplementary Table 1 Supplementary Figure 1 2 P Figures 1 2 Figure 3 Figure 4 Supplementary Table 2 Supplementary Figure 2 Supplementary Table 2 Figure 1 Proteins significantly differentiated between patients with unprovoked venous thromboembolism diagnosed with cancer during 12 months and selected controls without cancer. (A) Volcano plot. Each dot represents a measured protein with a log 2 10 P t P Figure 2 Heatmap of the 10 differentially abundant proteins. AMC, Academic Medical Center, Amsterdam, the Netherlands; CHI, Università degli Studi “Gabriele d'Annunzio”, Chieti, Italy; DVT, deep vein thrombosis; DRE, Universitätsklinikum Dresden, Dresden, Germany; INS, University of Insubria, Varese, Italy; KUL, Katholieke Universiteit Leuven, Leuven, Belgium; LUM, LUMC, Leiden, the Netherlands; LWMH, low-molecular-weight heparin; PE, pulmonary embolism; SEV, Hospital Universitario Virgen del Rocío: Sevilla, Andalucía, ES; SLZ, Slotervaartziekenhuis, Amsterdam, the Netherlands; TER, Tergooi hospital, Hilversum, the Netherlands; TOH, The Ottaway Hospital, Ottawa, Canada; VUM, VU medical center, Amsterdam, the Netherlands. Figure 3 STRING interaction network of the 10 discriminating proteins. Two clusters arise: one is associated with blood coagulation and fibrin clot formation (in green), and the other has no known associations (in red). The type of relationship between the proteins is indicated in the legend. STRING, search tool for the retrieval of interacting genes/proteins. Figure 4 Receiver operating characteristic (ROC) curve of the multivariable regression analysis. AUC, area under the curve. 4 Discussion Liquid biopsies can be used to detect circulating tumor-derived material with the advantages of being minimally invasive, affordable, and suitable for widespread use. In this exploratory analysis of the prospective PLATO-VTE cohort study, plasma concentrations of 211 quantifiable proteins were measured, focusing on those involved in coagulation, complement, and cancer-associated pathways. Ten proteins were considered differentially abundant in patients who were diagnosed with cancer during 12-month follow-up compared with those without a cancer diagnosis. Nine of 10 proteins are secreted proteins, while ICAM-1 is involved in cell adhesion and is usually found on the cell membrane. A multivariable logistic regression model incorporating these 10 proteins demonstrated good discrimination, with a c-statistic of 0.78 (95% CI, 0.76-0.81). These results suggest the potential utility of precise plasma protein concentrations as markers for screening occult cancer in patients with unprovoked VTE. Further research should focus on identifying predictive plasma proteins and validating these findings in larger cohorts. The functions of the 10 differentially abundant proteins in physiological conditions are summarized in Table 2 [24] [25] [26] [27] [28] [29] [30] [31] [32] [33] [34] [35] [36] [37] [24] [25] [26] [27] [28] [29] [33] [34] [35] [36] 38 [24] [25] [26] [27] [28] [29] [33] [34] [35] [36] 38 30 37 39 40 P Table 2 Top discriminating proteins between patients with cancer and control patients. Protein name Log 2 Unadjusted P Function Previous association with cancer P-selectin 0.436 .04 A proteoglycan, which mediates rapid rolling of leukocytes over vascular surfaces during the initial steps in inflammation. Elevated levels have been described in cancer patients and have been associated with cancer progression and thromboembolic complications [ [24] [25] [26] β-2 microglobulin 0.377 .04 Component of the class I MHC. Involved in the presentation of peptide antigens to the immune system. Elevated levels in patients with various types of cancer, and potentially associated with cancer prognosis [ [27] [28] [29] C7 0.323 .01 Constituent of the membrane attack complex that plays a role in the innate and adaptive immune response. C7 gene polymorphisms are associated with HCC recurrence after liver transplantation [ 30 ICAM-1 0.225 .04 ICAM proteins are ligands for the leukocyte adhesion protein LFA-1. Association with cancer varies depending on the type of cancer. In gastric and nasopharyngeal cancer, higher ICAM-1 expression was associated with more advanced stages and worse prognosis [ 31 32 33 Lumican 0.215 .04 An extracellular matrix protein. Association with cancer varies depending on the type of cancer. In advanced-stage colorectal cancer, lumican expression was found to be associated with worse prognosis [ 34 35 36 Coagulation FVII −1.762 .01 Initiates the extrinsic pathway of blood coagulation. Not described before. Coagulation FX −0.274 .02 Vitamin K-dependent glycoprotein that converts prothrombin to thrombin. Not described before. Coagulation FXII −0.230 .049 Participates in the initiation of blood coagulation, fibrinolysis, and the generation of bradykinin and angiotensin. Not described before. β-Ala-His dipeptidase −0.229 .04 Catalyzes hydrolysis of carnosine. Not described before. Kallistatin −0.208 .03 Inhibits human amidolytic and kininogenase activities of tissue kallikrein. Lower in hepatocellular carcinoma patients than in healthy controls. A decrease in serum kallistatin levels appeared to reflect the extent of cirrhosis, with the lowest levels associated with higher grades of cirrhosis [ 37 C7, complement component 7; FC, fold change; FVII/FX/FXII, factor VII/X/XII; HCC, hepatocellular carcinoma; ICAM, intracellular adhesion molecule; MHC major histocompability complex. In the first analysis of the PLATO-VTE study [ 12 11 12 7 Strengths of this current work include a predefined analysis plan in the original protocol of the PLATO-VTE study, a multicenter and international approach, uniform sample collection procedures across the different participating centers, blinding of laboratory personnel, and use of validated multiplexed assays to quantify proteins that largely cover the coagulation and complement cascade, as well as a few cancer-associated proteins. The main limitation is the limited number of cancer cases ( n n Proteomics-based technologies in cancer research have enabled the identification of cancer biomarkers and protein expression patterns that can be used to assess prognosis [ 41 42 43 [44] [45] [46] While the proteomic panel used in our study may not immediately indicate the site or type of malignancy, the presence of a cancer-related protein signature could serve as an early warning sign. This may prompt more intensive follow-up or targeted diagnostic evaluation to facilitate earlier cancer detection. Recent studies have demonstrated the capability of proteomic profiling to distinguish between tumor types and tissue origins [ 47 48 References 1 van Es N. Le Gal G. Otten H.M. Robin P. Piccioli A. Lecumberri R. Screening for occult cancer in patients with unprovoked venous thromboembolism Ann Intern Med 167 2017 410 417 28828492 10.7326/M17-0868 2 Carrier M. Lazo-Langner A. Shivakumar S. Tagalakis V. Zarychanski R. Solymoss S. Screening for occult cancer in unprovoked venous thromboembolism N Engl J Med 373 2015 697 704 26095467 10.1056/NEJMoa1506623 3 Delluc A. Antic D. Lecumberri R. Ay C. Meyer G. Carrier M. Occult cancer screening in patients with venous thromboembolism: guidance from the SSC of the ISTH J Thromb Haemost 15 2017 2076 2079 28851126 10.1111/jth.13791 4 Tanos R. Thierry A.R. Clinical relevance of liquid biopsy for cancer screening Transl Cancer Res 7 2018 S105 S129 5 Belczacka I. Latosinska A. Metzger J. Marx D. Vlahou A. Mischak H. Proteomics biomarkers for solid tumors: current status and future prospects Mass Spectrom Rev 38 2019 49 78 29889308 10.1002/mas.21572 6 Kulasingam V. Prassas I. Diamandis E.P. Towards personalized tumor markers NPJ Precis Oncol 1 2017 17 29872704 10.1038/s41698-017-0021-2 PMC5871887 7 Mohammed Y. Goodlett D. Borchers C.H. Absolute quantitative targeted proteomics assays for plasma proteins Methods Mol Biol 2628 2023 439 473 36781801 10.1007/978-1-0716-2978-9_27 8 Mohammed Y. van Vlijmen B.J. Yang J. Percy A.J. Palmblad M. Borchers C.H. Multiplexed targeted proteomic assay to assess coagulation factor concentrations and thrombosis-associated cancer Blood Adv 1 2017 1080 1087 29296750 10.1182/bloodadvances.2017007955 PMC5728326 9 Gaither C. Popp R. Mohammed Y. Borchers C.H. Determination of the concentration range for 267 proteins from 21 lots of commercial human plasma using highly multiplexed multiple reaction monitoring mass spectrometry Analyst 145 2020 3634 3644 32255452 10.1039/c9an01893j 10 Mohammed Y. Touw C.E. Nemeth B. van Adrichem R.A. Borchers C.H. Rosendaal F.R. Targeted proteomics for evaluating risk of venous thrombosis following traumatic lower-leg injury or knee arthroscopy J Thromb Haemost 20 2022 684 699 34919779 10.1111/jth.15623 PMC9303526 11 Kraaijpoel N. Mulder F.I. Carrier M. van Lieshout A. Würdinger T. Best M.G. Novel biomarkers to detect occult cancer in patients with unprovoked venous thromboembolism: rationale and design of the PLATO-VTE study Thromb Update 2 2021 100030 10.1016/j.tru.2020.100030 12 Mulder F.I. Kraaijpoel N. Carrier M. Guman N.A. Jara-Palomares L. Di Nisio M. Platelet RNA sequencing for cancer screening in patients with unprovoked venous thromboembolism: a prospective cohort study J Thromb Haemost 21 2023 905 916 36841648 10.1016/j.jtha.2023.01.003 13 Percy A.J. Mohammed Y. Yang J. Borchers C.H. A standardized kit for automated quantitative assessment of candidate protein biomarkers in human plasma Bioanalysis 7 2015 2991 3004 26626236 10.4155/bio.15.222 14 Mohammed Y. Pan J. Zhang S. Han J. Borchers C.H. ExSTA: external standard addition method for accurate high-throughput quantitation in targeted proteomics experiments Proteomics Clin Appl 12 2018 1600180 10.1002/prca.201600180 PMC6084352 28895300 15 Carr S.A. Abbatiello S.E. Ackermann B.L. Borchers C. Domon B. Deutsch E.W. Targeted peptide measurements in biology and medicine: best practices for mass spectrometry-based assay development using a fit-for-purpose approach Mol Cell Proteomics 13 2014 907 917 24443746 10.1074/mcp.M113.036095 PMC3945918 16 Mohammed Y. Goodlett D.R. Cheng M.P. Vinh D.C. Lee T.C. Mcgeer A. Longitudinal plasma proteomics analysis reveals novel candidate biomarkers in acute COVID-19 J Proteome Res 21 2022 975 992 35143212 10.1021/acs.jproteome.1c00863 17 Kuzyk M.A. Parker C.E. Domanski D. Borchers C.H. Development of MRM-based assays for the absolute quantitation of plasma proteins Methods Mol Biol 1023 2013 53 82 23765619 10.1007/978-1-4614-7209-4_4 18 Percy A.J. Yang J. Chambers A.G. Mohammed Y. Miliotis T. Borchers C.H. Mirzaei H. Carrasco M. Protocol for standardizing high-to-moderate abundance protein biomarker assessments through an MRM-with-standard-peptides quantitative approach BT - modern proteomics—sample preparation, analysis and practical applications 2016 Springer International Publishing Cham 515 530 10.1007/978-3-319-41448-5_24 27975233 19 Percy A.J. Yang J. Chambers A.G. Borchers C.H. Increased depth and breadth of plasma protein quantitation via two-dimensional liquid chromatography/multiple reaction monitoring-mass spectrometry with labeled peptide standards Methods Mol Biol 1410 2016 1 21 26867735 10.1007/978-1-4939-3524-6_1 20 Mohammed Y. Tran K. Carlsten C. Ryerson C. Wong A. Lee T. Proteomic evolution from acute to post-COVID-19 conditions J Proteome Res 23 2024 52 70 38048423 10.1021/acs.jproteome.3c00324 PMC10775146 21 Shannon P. Markiel A. Ozier O. Baliga N.S. Wang J.T. Ramage D. Cytoscape: a software environment for integrated models of biomolecular interaction networks Genome Res 13 2003 2498 2504 14597658 10.1101/gr.1239303 PMC403769 22 Warde-Farley D. Donaldson S.L. Comes O. Zuberi K. Badrawi R. Chao P. The GeneMANIA prediction server: biological network integration for gene prioritization and predicting gene function Nucleic Acids Res 38 2010 W214 W220 20576703 10.1093/nar/gkq537 PMC2896186 23 Moons K.G. Altman D.G. Reitsma J.B. Ioannidis J.P. Macaskill P. Steyerberg E.W. Transparent Reporting of a multivariable prediction model for Individual Prognosis Or Diagnosis (TRIPOD): explanation and elaboration Ann Intern Med 162 2015 W1 W73 25560730 10.7326/M14-0698 24 Ferroni P. Roselli M. Martini F. D'Alessandro R. Mariotti S. Basili S. Prognostic value of soluble P-selectin levels in colorectal cancer Int J Cancer 111 2004 404 408 15221968 10.1002/ijc.20189 25 Ay C. Simanek R. Vormittag R. Dunkler D. Alguel G. Koder S. High plasma levels of soluble P-selectin are predictive of venous thromboembolism in cancer patients: results from the Vienna Cancer and Thrombosis Study (CATS) Blood 112 2008 2703 2708 18539899 10.1182/blood-2008-02-142422 26 Roselli M. Mineo T.C. Martini F. Mariotti S. Ambrogi V. Spila A. Soluble selectin levels in patients with lung cancer Int J Biol Markers 17 2002 56 62 11936588 10.5301/jbm.2008.911 27 Anand R. Mathur M.D. Acharya N.R. Serum beta-2 microglobulin levels in bronchogenic carcinoma Indian J Thorac Cardiovasc Surg 9 1993 96 99 28 Avilés A. Díaz-Maqueo J.C. Rodriguez L. García E.L. Guzmán R. Talavera A. Prognostic value of serum beta 2 microglobulin in primary gastric lymphoma Hematol Oncol 9 1991 115 121 1869242 10.1002/hon.2900090207 29 Bataille R. Magub M. Grenier J. Donnadio D. Sany J. Serum beta-2-microglobulin in multiple myeloma: relation to presenting features and clinical status Eur J Cancer Clin Oncol 18 1982 59 66 6177535 10.1016/0277-5379(82)90025-6 30 Jiang Z. Jiang Q. Fang X. Wang P. Que W. Li H. Recipient C7 rs9292795 genotype and the risk of hepatocellular carcinoma recurrence after orthotopic liver transplantation in a Han Chinese population BMC Cancer 21 2021 521 33964921 10.1186/s12885-021-08269-7 PMC8106183 31 Maruo Y. Gochi A. Kaihara A. Shimamura H. Yamada T. Tanaka N. ICAM-1 expression and the soluble ICAM-1 level for evaluating the metastatic potential of gastric cancer Int J Cancer 100 2002 486 490 12115535 10.1002/ijc.10514 32 Yu Y. Dong W. Zhou X. Li S. The significance of serum soluble intercellular adhesion molecule 1 and transforming growth factor α in patients with nasopharyngeal carcinoma Arch Otolaryngol Head Neck Surg 130 2004 1205 1208 15492170 10.1001/archotol.130.10.1205 33 Ogawa Y. Hirakawa K. Nakata B. Fujihara T. Sawada T. Kato Y. Expression of intercellular adhesion molecule-1 in invasive breast cancer reflects low growth potential, negative lymph node involvement, and good prognosis Clin Cancer Res 4 1998 31 36 9516949 34 Seya T. Tanaka N. Shinji S. Yokoi K. Koizumi M. Teranishi N. Lumican expression in advanced colorectal cancer with nodal metastasis correlates with poor prognosis Oncol Rep 16 2006 1225 1230 17089042 35 Li X. Truty M.A. Kang Y. Chopin-Laly X. Zhang R. Roife D. Extracellular lumican inhibits pancreatic cancer cell growth and is associated with prolonged survival after surgery Clin Cancer Res 20 2014 6529 6540 25336691 10.1158/1078-0432.CCR-14-0970 PMC4268437 36 de Wit M. Belt E.J. Delis-van Diemen P.M. Carvalho B. Coupé V.M. Stockmann H.B. Lumican and versican are associated with good outcome in stage II and III colon cancer Ann Surg Oncol 20 2013 S348 S359 22711178 10.1245/s10434-012-2441-0 PMC3857876 37 Cheng Z. Lv Y. Pang S. Bai R. Wang M. Lin S. Kallistatin, a new and reliable biomarker for the diagnosis of liver cirrhosis Acta Pharm Sin B 5 2015 194 200 26579446 10.1016/j.apsb.2015.02.003 PMC4629233 38 Erturk K. Tastekin D. Bilgin E. Serilmez M. Bozbey H.U. Sakar B. Serum activated leukocyte cell adhesion molecule and intercellular adhesion molecule-1 in patients with gastric cancer: can they be used as biomarkers? Biomed Pharmacother 77 2016 86 91 26796270 10.1016/j.biopha.2015.12.006 39 Grover S.P. Mackman N. Intrinsic pathway of coagulation and thrombosis Arterioscler Thromb Vasc Biol 39 2019 331 338 30700128 10.1161/ATVBAHA.118.312130 40 Campello E. Henderson M.W. Noubouossie D.F. Simioni P. Key N.S. Contact system activation and cancer: new insights in the pathophysiology of cancer-associated thrombosis Thromb Haemost 118 2018 251 265 29378353 10.1160/TH17-08-0596 41 Kwon Y.W. Jo H.S. Bae S. Seo Y. Song P. Song M. Application of proteomics in cancer: recent trends and approaches for biomarkers discovery Front Med (Lausanne) 8 2021 747333 10.3389/fmed.2021.747333 PMC8492935 34631760 42 Wenk D. Zuo C. Kislinger T. Sepiashvili L. Recent developments in mass-spectrometry-based targeted proteomics of clinical cancer biomarkers Clin Proteomics 21 2024 6 38287260 10.1186/s12014-024-09452-1 PMC10826105 43 Mohammed Y. Richard V.R. Reyes Madlangsakay M.I. Lao Y. Spicer V. Popp R. SysQuan: repurposing SILAC mice for the cost-effective absolute quantitation of the human proteome Mol Cell Proteomics 24 2025 100974 10.1016/j.mcpro.2025.100974 PMC12143667 40254065 44 Netzel B.C. Grant R.P. Hoofnagle A.N. Rockwood A.L. Shuford C.M. Grebe S.K. First steps toward harmonization of LC-MS/MS thyroglobulin assays Clin Chem 62 2016 297 299 26430076 10.1373/clinchem.2015.245266 PMC4794333 45 Cobbaert C.M. Althaus H. Begcevic Brkovic I. Ceglarek U. Coassin S. Delatour V. Towards an SI-traceable reference measurement system for seven serum apolipoproteins using bottom-up quantitative proteomics: conceptual approach enabled by cross-disciplinary/cross-sector collaboration Clin Chem 67 2021 478 489 33331636 10.1093/clinchem/hvaa239 46 Han C.L. Lai C.T. Reyes A.J. Yang H.C. Lu J.Y. Shih S.R. Lessons learned: establishing a CLIA-equivalent laboratory for targeted mass spectrometry assays—navigating the transition from research to clinical practice Clin Proteomics 21 2024 12 38389054 10.1186/s12014-024-09455-y PMC10882921 47 Song Q. Yang Y. Jiang D. Qin Z. Xu C. Wang H. Proteomic analysis reveals key differences between squamous cell carcinomas and adenocarcinomas across multiple tissues Nat Commun 13 2022 4167 35851595 10.1038/s41467-022-31719-0 PMC9293992 48 Zhou Y. Lih T.M. Pan J. Höti N. Dong M. Cao L. Proteomic signatures of 16 major types of human cancer reveal universal and cancer-type-specific proteins for the identification of potential therapeutic targets J Hematol Oncol 13 2020 170 33287876 10.1186/s13045-020-01013-x PMC7720039 Supplementary material  Supplementary Material Acknowledgments We thank all participating patients and research staff who made this study possible. We are grateful to Professor Dr van Laarhoven and Dr Wilmink for taking part in the adjudication committee. Funding Research grants were from the 10.13039/501100012028 Dutch Thrombosis Foundation 10.13039/100008762 Genome Canada 10.13039/501100000233 Genome British Columbia Author contributions N.v.E., N.K., P.M.M.B., H.R.B., and H.H.V. were responsible for conception and design of the study. Y.M. performed proteomics analysis. N.A.M.G. and Y.M. performed statistical analyses. N.A.M.G., N.v.E., N.K., and Y.M. drafted the first version of the manuscript. All authors revised the manuscript for intellectual content, approved the final version of the manuscript, take full responsibility for the content, and agreed to its submission. Relationship disclosure N.A.M.G., N.K., F.I.M., M.J.L.P., M.t.W., J.M.M.B.O., E.P., J.R., V.S.-L., P.M.M.B., P.W.K., H.R.B., H.H.V., and B.J.M.v.V. report no conflicts of interest. M.C. has received research funding from BMS, Pfizer, and LEO Pharma. He has also received honoraria from Bayer, BMS, Pfizer, Servier, and LEO Pharma. A.D. has received research funding from BMS-Pfizer and honoraria from Bayer, BMS-Pfizer, Servier, and LEO Pharma. L.J.-P. has received grants from LEO Pharma, Daiichi Sankyo, and MSD, and personal fees from Rovi, LEO Pharma, GlaxoSmithKline, Techdow, and Actellion outside the submitted work. M.D.N. has received honoraria from Daiichi Sankyo, Janssen, BMS-Pfizer, LEO Pharma, and Werfen. W.A. has participated in advisory boards for AstraZeneca, Bayer, BMS-Pfizer, Norgine, Sanofi, and Viatris. J.B.-W. has received research funding from Bayer, Daiichi Sankyo, Pfizer, and Portola/Alexion. He has also received honoraria from Bayer, Daiichi Sankyo, Pfizer, and Portola/Alexion. T.V. has served as a speaker and/or advisor for Boehringer Ingelheim, Daiichi Sankyo, BMS/Pfizer, Bayer, Sanofi, and LEO Pharma. F.A.K. has received research funding from Bayer, BMS, BSCI, AstraZeneca, MSD, LEO Pharma, Actelion, Farm-X, the Netherlands Organization for Health Research and Development, the Dutch Heart Foundation, and the Horizon Europe Program, all outside this work and paid to his institution. B.O. reports speakers’ fees from Daiichi Sankyo and Sanofi. N.v.E. is the national lead investigator for studies evaluating abelacimab. N.v.E. has received advisory board honoraria and speaker fees from LEO Pharma, Bristol Myers Squibb, Amgen, and Daiichi Sankyo, which were transferred to his institute. Y.M. is the Chief Bioinformatics Officer of MRM Proteomics, Inc. Handling Editor: The online version contains supplementary material available at https://doi.org/10.1016/j.rpth.2025.103018 ",
  "metadata": {
    "Title of this paper": "Proteomic signatures of 16 major types of human cancer reveal universal and cancer-type-specific proteins for the identification of potential therapeutic targets",
    "Journal it was published in:": "Research and Practice in Thrombosis and Haemostasis",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12478244/"
  }
}