{
  "title": "Paper_1088",
  "abstract": "pmc Int J Mol Sci Int J Mol Sci 808 ijms ijms International Journal of Molecular Sciences 1422-0067 Multidisciplinary Digital Publishing Institute  (MDPI) PMC12470844 PMC12470844.1 12470844 12470844 41009728 10.3390/ijms26189167 ijms-26-09167 1 Article Immunohistochemical Evaluation of NOTCH1 Signaling Pathway in Oral Squamous Cell Carcinoma: Clinical and Prognostic Significance https://orcid.org/0000-0002-0991-9465 de Vicente Juan Carlos Conceptualization 1 2 3 * Lequerica-Fernández Paloma Formal analysis Investigation 2 4 https://orcid.org/0000-0003-0154-5240 Rivas Héctor Torres Formal analysis Investigation 5 Blanco-Lorenzo Verónica Formal analysis Investigation 5 López-Fernández Ana Methodology Investigation 2 https://orcid.org/0000-0001-8408-0447 Escalante-Narváez Samuel Andrés Investigation 1 Herrera i Nogués Sergi Investigation 1 https://orcid.org/0000-0003-3063-0890 Rodrigo Juan P. Formal analysis Data curation Funding acquisition 2 3 6 7 https://orcid.org/0000-0002-6845-2789 Álvarez-Teijeiro Saúl Formal analysis Data curation Writing – review & editing Visualization 2 7 † García-Pedrero Juana M. Conceptualization Formal analysis Resources Data curation Writing – original draft Supervision Funding acquisition 2 6 7 * † Yang Shun-Fa Academic Editor Monteiro Luís Academic Editor Delgado Maria Leonor Academic Editor 1 samescalantemd@gmail.com 2 palomalequerica@gmail.com ana_lopez23@hotmail.com jprodrigo@uniovi.es saul.teijeiro@gmail.com 3 4 5 ress_444@yahoo.com veronica.blanco@sespa.es 6 7 * jvicente@uniovi.es juanagp@ispasturias.es † These authors contributed equally to this work as senior authors. 19 9 2025 9 2025 26 18 497349 9167 25 7 2025 12 9 2025 16 9 2025 19 09 2025 27 09 2025 29 09 2025 © 2025 by the authors. 2025 https://creativecommons.org/licenses/by/4.0/ Licensee MDPI, Basel, Switzerland. This article is an open access article distributed under the terms and conditions of the Creative Commons Attribution (CC BY) license ( https://creativecommons.org/licenses/by/4.0/ The aim of this study was to investigate the clinical and prognostic significance of the NOTCH1 pathway in oral squamous cell carcinoma (OSCC). To this end, the expression of NOTCH1 and two downstream targets, HES1 and p21, was evaluated by immunohistochemistry in 165 OSCC patient specimens. Clinicopathological associations and impact on survival were assessed. Possible mechanistic crosstalk with epithelial–mesenchymal transition (EMT) induction through combined E-cadherin and Vimentin markers, or mTORC1 activation by means of phospho-S6 expression were also investigated. NOTCH1 staining was detected in 56 (35%) tumors, nuclear HES1 in 131 (81%) and nuclear p21 in 116 (70%) tumors. p21 was strongly correlated with mTORC1 activation and HES1 expression was inversely associated with EMT status. NOTCH1 expression was positively associated with an advanced T stage, neck lymph node metastasis, advanced TNM stage, second primary cancer, and was significantly associated with shorter disease-specific survival (DSS). By contrast, HES1 and p21 expression showed significant associations with early clinical stages, and combined p21 and pS6 expression (p21+/p-S6+) distinguished good-prognosis patients. Multivariate Cox analysis further revealed NOTCH1 expression as a significant independent predictor of poor DSS. Mechanistically, we found a strong link between p21 and pS6 proteins, which could potentially serve as a good-prognosis classifier for OSCC patients. NOTCH1 HES1 p21 oral squamous cell carcinoma prognosis epithelial–mesenchymal transition Instituto de Salud Carlos III (ISCIII, Spain) European Union Instituto de Investigación Sanitaria del Principado de Asturias (ISPA) PI19/01255 PI22/00167 PI24/00398 PI24/01530 CIBERONC CB16/12/00390 Government of Principado de Asturias Agency for Science, Business Competitiveness and Innovation of the Principado de Asturias European Union IDE/2024/000778 ISCIII European Union CP23/00101 This study was supported by grants from the Instituto de Salud Carlos III (ISCIII, Spain) through the projects PI19/01255, PI22/00167, PI24/00398, PI24/01530, CIBERONC CB16/12/00390, and co-funded by the European Union, and also the Instituto de Investigación Sanitaria del Principado de Asturias (ISPA), Fundación Bancaria Caja de Ahorros de Asturias-IUOPA, Universidad de Oviedo, and the FEDER Funding Program from the European Union. Additional funding was provided by the Government of Principado de Asturias through the Agency for Science, Business Competitiveness and Innovation of the Principado de Asturias and cofinanced by the European Union, through the Grants “Subvenciones para Grupos de Investigación de Organismos del Principado de Asturias para el Ejercicio 2024” (IDE/2024/000778). S.A.-T. is a recipient of a Miguel Servet research contract from ISCIII and co-funded by the European Union (CP23/00101). pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement no pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes 1. Introduction Oral squamous cell carcinoma (OSCC), the most frequent head and neck cancer, shows a five-year mortality rate close to 50% [ 1 2 The NOTCH pathway is a ubiquitous conserved signaling system that plays important roles in cell-fate determination from embryonic life to throughout adulthood [ 3 4 5 6 7 3 The most prominent NOTCH target genes are the hairy and enhancer of split (HES) and the hairy and enhancer of split related to YRPW motif (HEY) families, but also p21 (WAF1/Cip1/CDKN1A) [ 8 9 10 6 11 12 13 14 15 16 17 18 11 13 14 15 12 TP53 11 14 15 According to these data, the role of NOTCH in cancer remains controversial, and there is growing evidence for the dual function of NOTCH1 as both a tumor suppressor or an oncogene depending on the cellular and tissue context [ 13 19 20 21 21 22 EMT is a process in which epithelial tumor cells lose their adhesive phenotype and concomitantly acquire mesenchymal features, including high cell motility and invasive capacity that are critical to enable cancer metastasis [ 23 24 25 Despite the pathobiological role of NOTCH1, it has been extensively studied in different malignancies, but its clinical significance has been scarcely investigated and it remains controversial in OSCC [ 21 2. Results 2.1. Patient Characteristics The main clinicopathological data are summarized in Table 1 The mean and median follow-up times were 62.58 and 59 months, respectively. At the end of the follow-up, 67 (40.6%) patients died of the OSCC. Tumor recurrence occurred in 82 (49.7%) cases. The mean and median follow-up times were 86.12 and 81 months, respectively, for patients without tumor recurrence, while these figures were, respectively, 37.6 and 13 months for recurrent patients. The five-year DSS and overall survival (OS) rates were 61% and 52%, respectively. 2.2. Immunohistochemical Evaluation of NOTCH1 Expression and Downstream Targets in OSCC Specimens NOTCH1 expression was successfully evaluated in 155 out of 165 OSCC samples. A total of 96 tumors (62%) showed negative expression, while the remaining 59 cases (38%) displayed cytoplasmic NOTCH1 expression ( Figure 1 Figure 1 Figure 1 Figure 1 There was no significant correlation between the expression of nuclear NOTCH1 and the two downstream targets nuclear HES1 and p21. It is, however, noteworthy that all seven tumors harboring nuclear NOTCH1 staining exhibited nuclear HES1 staining. Analogously, no associations were observed between the expression of cytoplasmic NOTCH1, HES1, and p21. Since we previously demonstrated an alternative mechanism of p21 expression regulation by the mTORC1/4E-BP1 pathway [ 26 p 2.3. Associations of NOTCH1 Expression and Downstream Targets with Clinicopathological Variables The expression of cytoplasmic NOTCH1 was positively and significantly associated with an advanced T stage ( p p p p p Table 2 p p p p p Table 2 2.4. Impact of NOTCH1, HES1, and p21 on Patient Survival Kaplan–Meier analysis revealed that patients harboring cytoplasmic NOTCH1-expressing tumors showed a shorter DSS than those with negative expression (Log-rank test, p Figure 2 p Figure 2 No significant associations were observed between the expression of HES1 and p21 and DSS ( p p Figure 2 p Figure 2 p p p Figure 2 Finally, multivariate Cox analysis was performed including pT classification, neck lymph node metastasis, cytoplasmic and nuclear NOTCH1 expression, further revealing that the parameters independently associated with a poor DSS were T3–T4 classification (HR = 2.36, 95% CI 1.34 to 4.16, p p p p 2.5. Relationship Between the Expression of NOTCH1, HES1, and p21 and the EMT Status The EMT status was evaluated by the immunohistochemical assessment of E-cadherin and Vimentin expression in our selected cohort of 165 OSCC patients. Cytoplasmic and nuclear NOTCH1 and nuclear p21 were not significantly associated with the expression of E-cadherin ( p p p p p p p p According to these findings, neither cytoplasmic/nuclear NOTCH1 nor p21 were significantly associated with the EMT status ( p p p p Table 3 Even though NOTCH1 expression was not significantly correlated with EMT ( Table 3 Table 4 p p p p Regarding nuclear NOTCH1 expression, only one case (0.6%) exhibited complete EMT, and two cases showed partial EMT. Therefore, the limited sample size precludes the possibility of conducting a reliable survival analysis. 3. Discussion Dysregulation of NOTCH and/or downstream target genes have been widely detected in the development and progression of different human cancers. In this study, we specifically examined NOTCH1 protein expression in OSCC patient specimens and observed a frequency of 35%, which is similar to that reported by Cierpikowski et al. [ 27 17 28 27 29 5 16 Regarding its prognostic significance, some authors described a relationship between increased NOTCH1 expression and worse survival, whereas others found an association between high NOTCH1 expression and a better prognosis, and even a lack of prognostic significance of NOTCH1 [ 27 30 31 32 33 34 In order to explain the disparate results of NOTCH1 as prognostic factor we have to consider the biological role of this signaling pathway. Several studies have shown upregulation of NOTCH1 in OSCC [ 28 35 14 33 20 36 37 38 13 19 39 11 13 14 15 12 14 15 13 27 33 13 40 Our study also provides relevant mechanistic insights of NOTCH1 pathway activation status in OSCC patients. Thus, NOTCH1 expression was detected in 35% of OSCC tissue specimens, the expression of the downstream target genes HES1 and p21 was found in 81% and 70% of tumors, respectively. In addition, all cases with nuclear NOTCH1 expression concomitantly showed HES1 positivity; however, there was no correlation between NOTCH1 and p21 expression. According to these findings, other mechanisms beyond NOTCH signaling should be responsible for the overwhelming frequent expression of HES1 and p21 proteins in our OSCC cohort. In this regard, we found a significant correlation between p21 and the mTORC1 activation marker phospho-S6, with 85% double-positive cases, which is in good accordance to our previous work unprecedentedly uncovering an alternative mechanism of p21 expression regulation by the mTORC1/4E-BP1 pathway that was operative in over 70% of HNSCC [ 26 30 26 41 42 43 44 44 45 We also assessed whether NOTCH1 and HES1 could play a role in tumor progression and metastasis through EMT induction. It has been reported that the HES1 is a key gene in metastasis and drug resistance [ 46 47 48 49 All these observations support the notion that NOTCH1 signaling pathway has dissimilar roles in oral carcinogenesis, and there could be a possible relevant crosstalk with other signaling pathways that may influence or alter the expression/activity, ultimately leading to varying clinical and biological significance of this pathway depending on the cell and tissue context. Our study has some limitations that should be acknowledged. First, the use of tissue microarrays (TMAs) may not fully capture intratumoral heterogeneity, although this technique enables standardized, high-throughput evaluation across large patient cohorts. Second, the retrospective nature of the study may introduce inherent biases; thus, prospective validation in independent cohorts will be important to strengthen our findings. Third, while we observed significant associations between NOTCH1 expression, its subcellular localization, and the expression of downstream effectors such as p21 and HES1, further validation in larger and independent datasets will be required to confirm the robustness and generalizability of these observations. Finally, we highlight that our results should be interpreted within the context of an IHC-based expression analysis. While IHC offers critical insights into both protein levels and spatial distribution, future studies integrating multi-omics and functional approaches will be valuable to further elucidate the underlying regulatory mechanisms. 4. Materials and Methods 4.1. Patients and Tissue Specimens A total of 165 patients with histologically confirmed OSCC were surgically treated at the Hospital Universitario Central de Asturias between 1996 and 2007. This retrospective study was conducted following the ethical criteria of Declaration of Helsinki and approved by the Institutional Ethics Committee of the Hospital Universitario Central de Asturias and by the Regional CEIC from Principado de Asturias (date of approval 14th of May 2019; approval number: 136/19 for the project PI19/01255) for the use of histopathological and clinical material for research purposes. We retrieved clinical and histopathological information from the patients’ files; and pathology reports; which are summarized in Table 1 50 51 4.2. Immunohistochemistry (IHC) Tissue microarrays (TMAs) were constructed by collecting single-tissue cores (1 mm in diameter) from the most morphologically representative areas of formalin-fixed, paraffin-embedded (FFPE) tissue blocks provided by the Principado de Asturias BioBank (PT20/00161). Three cores were taken per patient tumor block. The TMAs were cut into 3-μm thick sections and dried on Flex IHC microscope slides (DakoCytomation, Glostrup, Denmark). Antigen retrieval was carried out using Envision Flex Target Retrieval solution, high pH (Dako, Glostrup, Denmark). Staining was performed at room temperature on an automatic staining workstation (Dako Autostainer Plus, Dako, Glostrup, Denmark) with the following primary monoclonal antibodies: anti-NOTCH1 (clone D1E11; Cell Signaling, Danvers, MA, USA) at 1:400 dilution, anti-HES1 (clone D6P2U; Cell Signaling, Danvers, MA, USA) at 1:200 dilution, anti-p21 (clone 4D10; Leica Biosystems NCL-L-WAF-1, Newcastle Upon Tyne, UK) at 1:10 dilution, anti-phospho-S6 Ribosomal Protein (Ser235/236; Cell Signaling #2211, Danvers, MA, USA) at 1:200 dilution, anti E-cadherin (clone 36/E-cadherin; BD Biosciences, San Jose, CA, USA) at 1:4000 dilution, and anti-Vimentin (clone RV202; Abcam, Cambridge, UK) at 1:200 dilution. The antibody–antigen complex was visualized with the Dako EnVision Flex + Visualization System (Dako) and diaminobenzidine chromogen as substrate. The IHC results were independently evaluated by three observers (VBL, HTR and JPR), blinded to clinical information. The immunopositivity and the subcellular localization of the staining were both considered. Scoring was based on staining intensity and the percentage of stained tumor cells, as previously reported [ 26 34 41 52 26 41 4.3. Statistical Analysis Statistical analyses were carried out using SPSS software version 27 (IBM Co., Armonk, NY, USA). Chi-squared and Fisher’s exact tests were used to evaluate the relationship between categorical variables. Survival analyses were performed using the Kaplan–Meier method, and survival rates compared using the log-rank test. Univariate and multivariate Cox regression model was applied to calculate the hazard ratio (HR) and 95% confidence interval (95% CI), as well as to determine independent prognostic factors in the presence of other relevant covariates. All p p 5. Conclusions NOTCH1 protein expression was detected in 35% of OSCC patient specimens, which was significantly associated with advanced disease stages, neck lymph node metastasis, poor tumor differentiation, and a second primary tumor. More importantly, NOTCH1 expression was found an independent predictor of poor DSS, thereby supporting an oncogenic role in OSCC. In marked contrast, the expression of HES1 and p21 proteins was associated with early clinical stages, and overwhelmingly detected in over 70% of tumors, indicative of NOTCH-independent regulatory mechanisms. Furthermore, our study unraveled relevant mechanistic insights demonstrating a strong link between p21 protein expression and mTORC1 activation (by means of phospho-S6 staining), and also a significant inverse correlation between HES1 and EMT induction. Moreover, combined p21/pS6 staining showed potential as a good-prognosis classifier for OSCC patients. Acknowledgments We want to particularly acknowledge for its collaboration the Principado de Asturias BioBank (PT20/00161 and PT23/00077), part of the Spanish National Biobanks Network, financed jointly by Servicio de Salud del Principado de Asturias, Instituto de Salud Carlos III and Fundación Bancaria Cajastur. Disclaimer/Publisher’s Note: Author Contributions J.C.d.V., Conceptualization, Data curation, Formal analysis, Funding acquisition, Resources, Visualization, Writing—original draft. P.L.-F., H.T.R. and V.B.-L., Formal analysis, Investigation. A.L.-F. Investigation, Methodology. S.A.E.-N., Investigation. S.H.iN., Investigation. J.P.R., Data curation, Formal analysis, Funding acquisition. S.Á.-T., Data curation, Formal analysis, Visualization, Writing—review and editing. J.M.G.-P., Conceptualization, Data curation, Formal analysis, Funding acquisition, Resources, Supervision, Writing—original draft. All authors have read and agreed to the published version of the manuscript. Institutional Review Board Statement This study was conducted with the approval of the Institutional Ethics Committee of the Hospital Universitario Central de Asturias and by the Regional CEIC from Principado de Asturias (date of approval 14th of May 2019; approval number: 136/19 for the project PI19/01255). Informed Consent Statement Patient informed consent was obtained for the human tissue samples used in this study. Data Availability Statement The data that support the findings of this study are available on request from the corresponding authors. Conflicts of Interest The authors declare no conflicts of interest. Abbreviations OSCC—Oralsquamous cell carcinoma; DSS—Disease-specific survival; EMT—Epithelial-mesenchymal transition; FFPE—Formalin-fixed, paraffin-embedded; TMAs—Tissue microarrays; IHC—Immunohistochemistry; NICD—Notch intracellular domain; CSL/CBF1/RBPjk—DNA-binding protein involved in NOTCH signaling; MAML—Mastermind-like proteins; HEY—Hairy/enhancer-of-split related with YRPW motif; CDKN1A—Cyclin-dependent kinase inhibitor 1A (p21); HNSCC—Head and neck squamous cell carcinoma; p-S6—Phosphorylated S6 ribosomal protein; mTORC1—Mechanistic target of rapamycin complex 1; 4E-BP1—Eukaryotic translation initiation factor 4E-binding protein 1; HR—Hazard ratio; CI—Confidence interval; AJCC—American Joint Committee on Cancer. References 1. Sung H. Ferlay J. Siegel R.L. Laversanne M. Soerjomataram I. Jemal A. Bray F. Global Cancer Statistics 2020: GLOBOCAN estimates of incidence and mortality worldwide for 36 cancers in 185 countries CA A Cancer J. Clin. 2021 71 209 249 10.3322/caac.21660 33538338 2. Hsu P.J. Yan K. Shi H. Izumchenko E. Agrawal N. Molecular biology of oral cavity squamous cell carcinoma Oral Oncol. 2020 102 104552 10.1016/j.oraloncology.2019.104552 31918173 PMC7659372 3. Pozzo F. Bittolo T. Tissino E. Zucchetto A. Bomben R. Polcik L. Dannewitz Prosseda S. Hartmann T.N. Gattei V. Multiple mechanisms of NOTCH1 activation in chronic lymphocytic leukemia: NOTCH1 mutations and beyond Cancers 2022 14 2997 10.3390/cancers14122997 35740661 PMC9221163 4. Patni A.P. Harishankar M.K. Joseph J.P. Sreeshma B. Jayaraj R. Devi A. Comprehending the crosstalk between Notch, Wnt and Hedgehog signaling pathways in oral squamous cell carcinoma-clinical implications Cell. Oncol. 2021 44 473 494 10.1007/s13402-021-00591-3 33704672 5. Shah P.A. Huang C. Li Q. Kazi S.A. Byers L.A. Wang J. Johnson F.M. Frederick M.J. NOTCH1 signaling in head and neck squamous cell carcinoma Cells 2020 9 2677 10.3390/cells9122677 33322834 PMC7764697 6. Brou C. Logeat F. Gupta N. Bessia C. LeBail O. Doedens J.R. Cumano A. Roux P. Black R.A. Israël A. A novel proteolytic cleavage involved in Notch signaling: The role of the disintegrin-metalloprotease TACE Mol. Cell. 2000 5 207 216 10.1016/S1097-2765(00)80417-7 10882063 7. De Strooper B. Vassar R. Golde T. The secretases: Enzymes with therapeutic potential in Alzheimer disease Nat. Rev. Neurol. 2010 6 99 107 10.1038/nrneurol.2009.218 20139999 PMC2879045 8. Devgan V. Mammucari C. Millar S.E. Brisken C. Dotto G.P. p21WAF1/Cip1 is a negative transcriptional regulator of Wnt4 expression downstream of Notch1 activation Genes Dev. 2005 19 1485 1495 10.1101/gad.341405 15964998 PMC1151665 9. Shao S. Zhao X. Zhang X. Luo M. Zuo X. Huang S. Wang Y. Gu S. Zhao X. Notch1 signaling regulates the epithelial-mesenchymal transition and invasion of breast cancer in a Slug-dependent manner Mol. Cancer 2015 14 28 10.1186/s12943-015-0295-3 25645291 PMC4322803 10. Pickering C.R. Zhang J. Yoo S.Y. Bengtsson L. Moorthy S. Neskey D.M. Zhao M. Ortega Alves M.V. Chang K. Drummond J. Integrative genomic characterization of oral squamous cell carcinoma identifies frequent somatic drivers Cancer Discov. 2013 3 770 781 10.1158/2159-8290.CD-12-0537 23619168 PMC3858325 11. Izumchenko E. Sun K. Jones S. Brait M. Agrawal N. Koch W. McCord C.L. Riley D.R. Angiuoli S.V. Velculescu V.E. Notch1 mutations are drivers of oral tumorigenesis Cancer Prev. Res. 2015 8 277 286 10.1158/1940-6207.CAPR-14-0257 25406187 PMC4383685 12. Song X. Xia R. Li J. Long Z. Ren H. Chen W. Mao L. Common and complex Notch1 mutations in Chinese oral squamous cell carcinoma Clin. Cancer Res. 2014 20 701 710 10.1158/1078-0432.CCR-13-1050 24277457 PMC3946562 13. Sun W. Gaykalova D.A. Ochs M.F. Mambo E. Arnaoutakis D. Liu Y. Loyo M. Agrawal N. Howard J. Li R. Activation of the NOTCH pathway in head and neck cancer Cancer Res. 2014 74 1091 1104 10.1158/0008-5472.CAN-13-1259 24351288 PMC3944644 14. Agrawal N. Frederick M.J. Pickering C.R. Bettegowda C. Chang K. Li R.J. Fakhry C. Xie T.X. Zhang J. Wang J. Exome sequencing of head and neck squamous cell carcinoma reveals inactivating mutations in NOTCH1 Science 2011 333 1154 1157 10.1126/science.1206923 21798897 PMC3162986 15. Stransky N. Egloff A.M. Tward A.D. Kostic A.D. Cibulskis K. Sivachenko A. Kryukov G.V. Lawrence M.S. Sougnez C. McKenna A. The mutational landscape of head and neck squamous cell carcinoma Science 2011 333 1157 1160 10.1126/science.1208130 21798893 PMC3415217 16. Zhang T.H. Liu H.C. Zhu L.J. Chu M. Liang Y.J. Liang L.Z. Liao G.Q. Activation of Notch signaling in human tongue carcinoma J. Oral Pathol. Med. 2011 40 37 45 10.1111/j.1600-0714.2010.00931.x 20819128 17. Osathanon T. Nowwarote N. Pavasant P. Expression and influence of Notch signaling in oral squamous cell carcinoma J. Oral Sci. 2016 58 283 294 10.2334/josnusd.15-0535 27349552 18. Hijioka H. Setoguchi T. Miyawaki A. Gao H. Ishida T. Komiya S. Nakamura N. Upregulation of Notch pathway molecules in oral squamous cell carcinoma Int. J. Oncol. 2010 36 817 822 10.3892/ijo_00000558 20198324 19. Rettig E.M. Chung C.H. Bishop J.A. Howard J.D. Sharma R. Li R.J. Douville C. Karchin R. Izumchenko E. Sidransky D. Cleaved NOTCH1 expression pattern in head and neck squamous cell carcinoma is associated with NOTCH1 mutation, HPV status, and high-risk features Cancer Prev. Res. 2015 8 287 295 10.1158/1940-6207.CAPR-14-0366 PMC4383699 25633867 20. Kujan O. Huang G. Ravindran A. Vijayan M. Farah C.S. CDK4, CDK6, cyclin D1 and Notch1 immunocytochemical expression of oral brush liquid-based cytology for the diagnosis of oral leukoplakia and oral cancer J. Oral Pathol. Med. 2019 48 566 573 10.1111/jop.12902 31172614 21. Porcheri C. Meisel C.T. Mitsiadis T. Multifactorial contribution of Notch signaling in head and neck squamous cell carcinoma Int. J. Mol. Sci. 2019 20 1520 10.3390/ijms20061520 30917608 PMC6471940 22. Zhao Y.Y. Yu G.T. Xiao T. Hu J. The Notch signaling pathway in head and neck squamous cell carcinoma: A meta-analysis Adv. Clin. Exp. Med. 2017 26 881 887 10.17219/acem/64000 29068587 23. Li L. Li W. Epithelial-mesenchymal transition in human cancer: Comprehensive reprogramming of metabolism, epigenetics, and differentiation Pharmacol. Ther. 2015 150 33 46 10.1016/j.pharmthera.2015.01.004 25595324 24. Nijkamp M.M. Span P.N. Hoogsteen I.J. van der Kogel A.J. Kaanders J.H. Bussink J. Expression of E-cadherin and vimentin correlates with metastasis formation in head and neck squamous cell carcinoma patients Radiother. Oncol. 2011 99 344 348 10.1016/j.radonc.2011.05.066 21684617 25. Wangmo C. Charoen N. Jantharapattana K. Dechaphunkul A. Thongsuksai P. Epithelial-mesenchymal transition predicts survival in oral squamous cell carcinoma Pathol. Oncol. Res. 2020 26 1511 1518 10.1007/s12253-019-00731-z 31471883 26. Llanos S. García-Pedrero J. Morgado-Palacin L. Rodrigo J.P. Serrano M. Stabilization of p21 by mTORC1/4E-BP1 predicts clinical outcome of head and neck cancers Nat. Commun. 2016 7 10438 10.1038/ncomms10438 26832959 PMC4740818 27. Cierpikowski P. Lis-Nawara A. Bar J. Prognostic value of WNT1, NOTCH1, PDGFRβ, and CXCR4 in oral squamous cell carcinoma Anticancer Res. 2023 43 591 602 10.21873/anticanres.16195 36697060 28. Yoshida R. Nagata M. Nakayama H. Niimori-Kita K. Hassan W. Tanaka T. Shinohara M. Ito T. The pathological significance of Notch1 in oral squamous cell carcinoma Lab. Investig. 2013 93 1068 1081 10.1038/labinvest.2013.95 23938602 29. Wu-Chou Y.H. Hsieh C.H. Liao C.T. Lin Y.T. Fan W.L. Yang C.H. NOTCH1 mutations as prognostic marker in oral squamous cell carcinoma Pathol. Res. Pract. 2021 223 153474 10.1016/j.prp.2021.153474 33993060 30. Kaka A.S. Nowacki N.B. Kumar B. Zhao S. Old M.O. Agrawal A. Ozer E. Carrau R.L. Schuller D.E. Kumar P. Notch1 overexpression correlates to improved survival in cancer of the oropharynx Otolaryngol. Head Neck Surg. 2017 156 652 659 10.1177/0194599816688178 28195818 31. Lin J.T. Chen M.K. Yeh K.T. Chang C.S. Chang T.H. Lin C.Y. Wu Y.C. Su B.W. Lee K.D. Chang P.J. Association of high levels of Jagged-1 and Notch-1 expression with poor prognosis in head and neck cancer Ann. Surg. Oncol. 2010 17 2976 2983 10.1245/s10434-010-1118-9 20517681 32. Li D. Dong P. Wu C. Cao P. Zhou L. Notch1 overexpression associates with poor prognosis in human laryngeal squamous cell carcinoma Ann. Otol. Rhinol. Laryngol. 2014 123 705 710 10.1177/0003489414532784 24789803 33. Ding X. Zheng Y. Wang Z. Zhang W. Dong Y. Chen W. Li J. Chu W. Zhang W. Zhong Y. Expression and oncogenic properties of membranous Notch1 in oral leukoplakia and oral squamous cell carcinoma Oncol. Rep. 2018 39 2584 2594 10.3892/or.2018.6335 29620248 PMC5983926 34. Grilli G. Hermida-Prado F. Álvarez-Fernández M. Allonca E. .Álvarez-González M. Astudillo A. Moreno-Bueno G. Cano A. García-Pedrero J.M. Rodrigo J.P. Impact of notch signaling on the prognosis of patients with head and neck squamous cell carcinoma Oral Oncol. 2020 110 105003 10.1016/j.oraloncology.2020.105003 32932170 35. Snijders A.M. Schmidt B.L. Fridlyand J. Dekker N. Pinkel D. Jordan R.C. Albertson D.G. Rare amplicons implicate frequent deregulation of cell fate specification pathways in oral squamous cell carcinoma Oncogene 2005 24 4232 4242 10.1038/sj.onc.1208601 15824737 36. Duan L. Yao J. Wu X. Fan M. Growth suppression induced by Notch1 activation involves Wnt-beta-catenin down-regulation in human tongue carcinoma cells Biol. Cell. 2006 98 479 490 10.1042/BC20060020 16608439 37. Sakamoto K. Fujii T. Kawachi H. Miki Y. Omura K. Morita K. Kayamori K. Katsube K. Yamaguchi A. Reduction of NOTCH1 expression pertains to maturation abnormalities of keratinocytes in squamous neoplasms Lab. Investig. 2012 92 688 702 10.1038/labinvest.2012.9 22330335 38. Egloff A.M. Grandis J.R. Molecular pathways: Context-dependent approaches to Notch targeting as cancer therapy Clin. Cancer Res. 2012 18 5188 5195 10.1158/1078-0432.CCR-11-2258 22773520 PMC3463728 39. Talora C. Sgroi D.C. Crum C.P. Dotto G.P. Specific down-modulation of Notch1 signaling in cervical cancer cells is required for sustained HPV-E6/E7 expression and late steps of malignant transformation Genes Dev. 2002 16 2252 2263 10.1101/gad.988902 12208848 PMC186663 40. Nyman P.E. Buehler D. Lambert P.F. Loss of function of canonical Notch signaling drives head and neck carcinogenesis Clin. Cancer Res. 2018 24 6308 6318 10.1158/1078-0432.CCR-17-3535 30087145 PMC6295262 41. de Vicente J.C. Peña I. Rodrigo J.P. Rodríguez-Santamarta T. Lequerica-Fernández P. Suárez-Fernández L. Allonca E. García-Pedrero J.M. Phosphorylated ribosomal protein S6 correlation with p21 expression and inverse association with tumor size in oral squamous cell carcinoma Head Neck 2017 39 1876 1887 10.1002/hed.24854 28675642 42. Bennani-Baiti I.M. Aryee D.N. Ban J. Machado I. Kauer M. Mühlbacher K. Amann G. Llombart-Bosch A. Kovar H. Notch signalling is off and is uncoupled from HES1 expression in Ewing's sarcoma J. Pathol. 2011 225 353 363 10.1002/path.2966 21984123 43. Riya P.A. Basu B. Surya S. Parvathy S. Lalitha S. Jyothi N.P. Meera V. Jaikumar V.S. Sunitha P. Shahina A. HES1 promoter activation dynamics reveal the plasticity, stemness and heterogeneity in neuroblastoma cancer stem cells J. Cell Sci. 2022 135 jcs260157 10.1242/jcs.260157 36321463 44. Curry C.L. Reed L.L. Nickoloff B.J. Miele L. Foreman K.E. Notch-independent regulation of Hes-1 expression by c-Jun N-terminal kinase signaling in human endothelial cells Lab. Investig. 2006 86 842 852 10.1038/labinvest.3700442 16732296 45. Zheng X. Narayanan S. Zheng X. Luecke-Johansson S. Gradin K. Catrina S.B. Poellinger L. Pereira T.S. A Notch-independent mechanism contributes to the induction of Hes1 gene expression in response to hypoxia in P19 cells Exp. Cell Res. 2017 358 129 139 10.1016/j.yexcr.2017.06.006 28602625 46. Liu Z.H. Dai X.M. Du B. Hes1: A key role in stemness, metastasis and multidrug resistance Cancer Biol. Ther. 2015 16 353 359 10.1080/15384047.2015.1016662 25781910 PMC4622741 47. Leong K.G. Niessen K. Kulic I. Raouf A. Eaves C. Pollet I. Karsan A. Jagged1-mediated Notch activation induces epithelial-to-mesenchymal transition through Slug-induced repression of E-cadherin J. Exp. Med. 2007 204 2935 2948 10.1084/jem.20071082 17984306 PMC2118507 48. Wang S.C. Lin X.L. Wang H.Y. Qin Y.J. Chen L. Li J. Jia J.S. Shen H.F. Yang S. Xie R.Y. Hes1 triggers epithelial-mesenchymal transition (EMT)-like cellular marker alterations and promotes invasion and metastasis of nasopharyngeal carcinoma by activating the PTEN/AKT pathway Oncotarget 2015 6 36713 36730 10.18632/oncotarget.5457 26452025 PMC4742206 49. Wang L. Gu W. Kalady M. Xin W. Zhou L. Loss of HES1 expression is associated with extracellular matrix remodeling and tumor immune suppression in KRAS mutant colon adenocarcinomas Sci. Rep. 2023 13 15999 10.1038/s41598-023-42234-7 37749297 PMC10519992 50. Müller S. Update from the 4th edition of the World Health Organization of Head and Neck Tumours: Tumours of the oral cavity and mobile tongue Head Neck Pathol. 2017 11 33 40 10.1007/s12105-017-0792-3 28247230 PMC5340733 51. Amin M.B. AJCC Cancer Staging Manual 8th ed. Springer Chicago, IL, USA 2017 79 94 52. García-Pedrero J.M. García-Cabo P. Ángeles-Villaronga M. Hermida-Prado F. Granda-Díaz R. Allonca E. Rodrigo J.P. Prognostic significance of E-cadherin and β-catenin expression in HPV-negative oropharyngeal squamous cell carcinomas Head Neck 2017 39 2293 2300 10.1002/hed.24897 28815780 Figure 1 Immunohistochemical analysis of NOTCH1, HES1 and p21 in OSCC tissue specimens. Representative images of tumors showing ( A B C D E F G Figure 2 Kaplan–Meier disease-specific survival curves in the cohort of 165 OSCC patients categorized by ( A B C D E F p ijms-26-09167-t001_Table 1 Table 1 Clinical and pathological characteristics of the cohort of 165 OSCC patients selected for study. Variable Number (%) Age (year) (mean ± SD; median; range) 63.8 ± 12.65; 64; 30–92 Gender  Men 113 (68.5) Women 52 (31.5) Tobacco use  Smoker 107 (65) Non-smoker 58 (35) Alcohol use  Drinker 89 (54) Non-drinker 76 (46) Location of oral squamous cell carcinoma  Tongue 75 (45) Floor of the mouth 34 (21) Other sites within the oral cavity 56 (34) Tumor status  pT1 39 (25) pT2 70 (44) pT3 22 (14) pT4 19 (12) Unknown 8 (5) Nodal status  pN0 95 (57.6) pN1-3 63 (38.2) No neck dissection 7 (4.2) Clinical stage  Stage I 37 (22.4) Stage II 51 (30.9) Stage III 30 (18.2) Stage IV 47 (28.5) G status  G1 105 (63.6) G2 51 (30.9) G3 9 (5.5) Clinical status at the end of the follow-up  Alive and without recurrence 77 (46.7) Dead of index cancer 67 (40.6) Lost or died of other causes (censored) 18 (10.9) Second primary carcinoma 3 (1.8) ijms-26-09167-t002_Table 2 Table 2 Associations between the expression of NOTCH1, HES1 and p21 and the clinicopathological variables in a cohort of 165 OSCC patients. Variable Cytoplasmic NOTCH1 (%)  p Nuclear NOTCH1 (%)  p Nuclear HES1 (%)  p Nuclear p21 (%)  p  Negative Positive  Negative Positive  Negative Positive  Negative Positive  Gender  0.29  0.67  0.20  0.76 Men 64 (59) 44 (41) 102 (95) 6 (5) 19 (17) 93 (83) 21 (20) 84 (80) Women 32 (68) 15 (32) 46 (98) 1 (2) 13 (26) 38 (74) 9 (18) 41 (82) Tobacco use  0.88    0.016  0.62 Smoker 64 (62) 40 (38) 97 (93) 7 (7) 0.06 15 (14) 91 (86) 18 (18) 81 (82) Non-smoker 32 (63) 19 (37) 51 (100) 0 (0)  17 (30) 40 (70) 12 (21) 44 (79) Alcohol use  0.61  0.69  0.07  0.85 Drinker 53 (60) 35 (40) 83 (94) 5 (6) 13 (15) 76 (85) 16 (19) 69 (81) Non-drinker 43 (64) 24 (36) 65 (97) 2 (3) 19 (26) 55 (74) 14 (20) 56 (80) pT  0.004    <0.001  0.05 pT1 + T2 73 (68) 34 (32) 104 (97) 3 (3) 0.34 13 (12) 99 (88) 16 (15) 90 (85) pT3 + T4 17 (43) 23 (57) 37 (93) 3 (7)  15 (35) 28 (65) 12 (29) 29 (71) pN  0.013      0.64 pN0 61 (69) 27 (31) 84 (96) 4 (4) 1.0 13 (14) 80 (86) 0.11 15 (17) 73 (83) pN1-3 30 (49) 31 (51) 58 (95) 3 (5)  15 (24) 48 (76)  12 (20) 48 (80) Clinical stage  0.003    <0.001  0.04 I + II 59 (73) 22 (27) 78 (96) 3 (4) 0.71 7 (8) 79 (92) 11 (14) 70 (86) III + IV 37 (50) 37 (50) 70 (95) 4 (5)  25 (32) 52 (68) 19 (26) 55 (74) G status  0.001    0.62  0.89 Well 70 (73) 26 (27) 91 (95) 5 (5) 1.0 18 (18) 85 (82) 19 (19) 79 (81) Moderate 22 (44) 28 (56) 48 (96) 2 (4)  12 (24) 39 (76) 10 (21) 38 (79) Poor 4 (44) 5 (56) 9 (100) 0 (0)  2 (22) 7 (78) 1 (11) 8 (89) Perineural invasion  0.15  1.0  0.69  0.68 No 89 (60) 58 (40) 140 (95) 7 (5) 30 (20) 124 (80) 28 (19) 118 (81) Yes 7 (88) 1 (12) 8 (100) 0 (0) 2 (22) 7 (78) 2 (22) 7 (78) Vascular invasion  0.67  0.24  0.34  0.62 No 93 (62) 56 (38) 143 (96) 6 (4) 32 (21) 124 (79) 28 (19) 120 (81) Yes 3 (50) 3 (50) 5 (83) 1 (17) 0 (0) 7 (100) 2 (29) 5 (71) Clinical status at the end of the follow-up         Alive without recurrence 52 (73) 19 (27) 0.002 71 (100) 0 (0) 0.03 12 (16) 63 (84) 0.57 12 (17) 58 (83) 0.81 Dead of index cancer 31 (48) 34 (52) 59 (91) 6 (9) 16 (24) 51 (76) 15 (23) 51 (77) Censored 13 (77) 4 (23) 16 (94) 1 (6) 4 (22) 14 (78) 3 (18) 14 (82) Second primary cancer 0 (0) 2 (100) 2 (100) 0 (0) 0 (0) 3 (100) 0 (0) 2 (100) ijms-26-09167-t003_Table 3 Table 3 Associations between the expression of NOTCH1, HES1 and p21 with the epithelial–mesenchymal transition (EMT) status. EMT Status Cytoplasmic NOTCH1  p Nuclear NOTCH1  p Nuclear HES1  p Nuclear p21  p Negative Positive Negative Positive Negative Positive Negative Positive No EMT * 41 (67%) 20 (33%) 0.49 57 (93%) 4 (7%) 0.69 5 (8%) 57 (92%) 0.001 16 (27%) 43 (73%) 0.15 * E-cadherin +/Vimentin −; ** E-cadherin +/Vimentin + or E-cadherin −/Vimentin −; *** E-cadherin −/Vimentin +. ijms-26-09167-t004_Table 4 Table 4 Univariate Cox analysis of disease-specific and overall survival in the cohort of 154 OSCC patients according to cytoplasmic NOTCH1 expression and the epithelial–mesenchymal transition (EMT) status. Survival Variable Number of Cases Survival Number (%) Survival Time (Months) HR (95% CI)  p DSS NOTCH1 negative 95 64 (67.4) 144.27 (124.87–163.67) 1 (reference) 0.01 OS NOTCH1 negative 95 52 (54.7) 118.66 (98.51–138.82) 1 (reference) 0.03 Abbreviations: DSS. disease-specific survival; OS, overall survival: HR, Hazard Ratio; CI, Confidence Interval. Eleven cases were not valuable for NOTCH1 and EMT status simultaneously. ",
  "metadata": {
    "Title of this paper": "Prognostic significance of E-cadherin and β-catenin expression in HPV-negative oropharyngeal squamous cell carcinomas",
    "Journal it was published in:": "International Journal of Molecular Sciences",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12470844/"
  }
}