{
  "title": "Paper_956",
  "abstract": "pmc Polymers (Basel) Polymers (Basel) 3589 polymers polymers Polymers 2073-4360 Multidisciplinary Digital Publishing Institute  (MDPI) PMC12473381 PMC12473381.1 12473381 12473381 41012238 10.3390/polym17182472 polymers-17-02472 1 Review The State of the Art and Innovations in Active and Edible Coatings and Films for Functional Food Applications https://orcid.org/0000-0001-7462-8181 Mariño-Cortegoso Sandra 1 2 * https://orcid.org/0000-0002-7697-5846 Lestido-Cardama Antía 1 2 https://orcid.org/0000-0003-0623-4409 Sendón Raquel 1 2 https://orcid.org/0000-0002-7551-2727 Rodríguez Bernaldo de Quirós Ana 1 2 https://orcid.org/0000-0002-7158-6980 Barbosa-Pereira Letricia 1 2 * Martău Gheorghe Academic Editor Tosa Monica Ioana Academic Editor Vodnar Dan Cristian Academic Editor 1 antialestido@gmail.com raquel.sendon@usc.es ana.rodriguez.bernaldo@usc.es 2 * sandra.marino.cortegoso@usc.es letricia.barbosa.pereira@usc.es 12 9 2025 9 2025 17 18 497668 2472 09 8 2025 05 9 2025 10 9 2025 12 09 2025 27 09 2025 29 09 2025 © 2025 by the authors. 2025 https://creativecommons.org/licenses/by/4.0/ Licensee MDPI, Basel, Switzerland. This article is an open access article distributed under the terms and conditions of the Creative Commons Attribution (CC BY) license ( https://creativecommons.org/licenses/by/4.0/ Edible coatings and films are gaining the attention of researchers, consumers, and the food industry as a sustainable alternative to conventional plastic packaging. This review provides an overview of recent advances in their development, with a particular focus on new natural sources of biomaterials (e.g., proteins and polysaccharides) and natural additives (antioxidants and antimicrobials). Special attention is given to high-technology preparation methods, including electrohydrodynamic atomization (EHDA), as well as controlled release systems for bioactive compounds designed to preserve foodstuffs and extended their shelf life. The application of edible coatings as carriers of nutrients (vitamins) and bioactives (probiotics and polyphenols) to improve the nutritional value and support the development of functional foods is also discussed. In addition, this review addresses safety considerations and regulatory aspects that are crucial for commercialization and consumer acceptance. Finally, key challenges are highlighted, including the improvement of mechanical and barrier properties, scalability of innovative technologies, consumer education, regulatory support, and the integration of circular economy principles, to encourage the adoption of these sustainable solutions. edible coatings biobased materials coating technology control release natural extracts functional foods safety and regulation ValICET 2020, Agri-Food Value Chain Spanish Ministry of Science and Innovation and the State Research Agency PCI2021-121965 European Union This research was funded by ValICET pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement no pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes 1. Introduction Biobased systems are emerging as effective alternatives to conventional plastic packaging [ 1 2 3 4 5 6 Despite the benefits of using edible coatings and films to improve the quality, shelf life and safety, the commercial applications of many of these coatings are still rather limited [ 3 7 This review addresses these gaps by providing an update perspective on recent materials and technologies, with special attention to controlled release strategies and their implications for food functionality. Furthermore, safety considerations, regulatory challenges, and their social and environmental impact are critically discussed to offer a comprehensive outlook on the opportunities and limitations of edible coatings and films. 2. Biopolymers for Edible Films and Coatings Development The research development of active and edible coatings and films is currently focused on searching for suitable materials, such as polysaccharides and proteins, increasingly used as biopolymers [ 1 Table 1 2 Table 2 2.1. Proteins A wide range of proteins from animal and plant sources can be employed as biopolymers. Gelatin is a denatured protein obtained from acid, alkali, or enzymatic collagen hydrolysis that shapes transparent, odourless, and tasteless films that demonstrated good gas barrier properties and high mechanical resistance and elasticity; although its high-water permeability limits its use in food packaging [ 8 9 10 Whey protein, constituted principally of β-lactoglobulins, α 11 12 13 Table 2 However, it is important to use protein from plant-based resources for vegetarian diets and, if possible, agro-industrial by-products, aiming to reduce the environmental impacts that petroleum-based packaging and animal use lead to [ 14 15 16 17 18 19 20 Zein protein, the main storage protein and a residue in corn starch production, has been investigated over the last few years. Zein is an amphiphilic protein, composed by more than 50% of hydrophobic amino acids, which depending on their structural setup, can be exploited to formulate a hydrophobic surface for food packaging applications. It is considered that the rate of solvent evaporation is a key step to control surface hydrophobicity. As such, electrohydrodynamic processing can lead to the formation of superhydrophobic surfaces due to high-speed solvent evaporation, while samples prepared by solvent casting induced self-assembly with resulting hydrophilicity behaviour due to conformational transitions from α-helix to β-sheet [ 21 22 23 24 Silk fibroin has gained significant attention in recent years as a promising material for edible coatings and films. It is the main structural protein of silk, typically accounting for 65–85% of its composition [ 25 26 27 ® Table 1 2.2. Lipids 2.2.1. Resins Shellac is a resin produced by the Kerria lacca 28 29 30 31 32 33 34 35 2.2.2. Waxes Waxes are among the most historically used materials in edible coating applications [ 15 36 37 38 39 40 41 42 w v 2.3. Polysaccharides On the other hand, polysaccharides attract attention in food packaging for their gelling properties. Chitosan results from the deacetylation of chitin, a biopolymer found in crustaceous exoskeletons. It has a relevant impact in the development of non-plastic alternatives in food packaging due to its biodegradability, non-toxicity, biocompatibility, antimicrobial properties, and film-forming ability, in addition to its demonstrated elasticity [ 43 44 45 46 47 Nevertheless, as has occurred with protein biopolymers, research recently has been conducted on plant-based alternatives. In this sense, starch and cellulose from different sources have been widely employed for decades [ 48 49 50 51 52 Cellulose and its derivatives, such as carboxymethyl cellulose (CMC), hydroxypropyl methylcellulose (HPMC), or nanocellulose, have been extensively investigated and used in blends and laminates. Cellulose is formed by the polymerization of D-glucose through a β-1,4 glycosidic bond. Both starch and cellulose blends are mostly employed in industrial applications. However, cellulose’s water insolubility and crystallinity make cellulose-based alternatives more suitable for packaging development [ 53 2 54 3 2 3 55 56 57 58 59 60 61 62 60 63 64 65 66 67 Arabinoxylans are a type of hemicellulose found in the cell walls of various cereal grains, such as rice, wheat, or corn. They are composed of xylose units forming the backbone, with arabinose side chains. Due to their excellent film-forming ability, arabinoxylans can produce transparent and flexible films suitable for food packaging applications. Moreover, arabinoxylans exhibit natural antioxidant properties, attributed to phenolic compounds, such as ferulic acid, that remain bound to their structure during their extraction. Their biopolymer functional performance can be enhanced by incorporating bioactive compounds, nanocomposites, or blending with other polymers [ 68 69 70 Gums are diverse group of polysaccharides. Depending on their origin, they include marine gums (e.g., alginate, carrageenan, and agar), plant gums (e.g., gum arabic and gum Tragacanth), seed gums or galactomannans (e.g., guar gum), mucilages (e.g., psyllium gum), and microbial gums (e.g., pullulan, kefiran, xanthan gum, and levan) [ 71 72 Algae are a rich source of polysaccharides commonly used in food packaging development. Alginate, composed of guluronic acid and mannuronic acid units, is a water-soluble biopolymer that has displayed moderate oxygen and low water barrier properties. Its film fragility and mechanical properties can be improved with plasticizers. It has gained importance in the field of food packaging owing to its ability to prepare hydrogels and to retain water, thus controlling the moisture levels in the packaged food, and the encapsulation and controlled-release capacities of its bioactive compounds [ 73 74 75 Citrus sinensis 76 77 78 79 Some bacterial polysaccharides, such as xanthan gum, have been widely used in the food industry for decades. In contrast, others like kefiran and levan have more recently gained attention due to their bioactive properties and film-forming abilities, making them promising candidates for edible and active food packaging. Kefiran is an exopolysaccharide composed of glucose and galactose units, predominantly by Lactobacillus kefiranofaciens 80 81 82 83 Zhumeria majdae 83 Levan, another bacterial exopolysaccharide, is produced by species such as Bacillus subtilis Zymomonas mobilis 84 85 85 86 On the other hand, fungal exopolysaccharides are also gaining interest as biopolymers. Among them, pullulan is the one that is most employed for food packaging applications. It is composed of maltotriose units bound through α-1,6 glycosidic bonds. It is a water-soluble biopolymer with poor water barrier properties but is an excellent barrier against oxygen. It displays moderate mechanical properties and thermal stability. The incorporation of bioactive compounds can improve the physical–chemical properties of pullulan-based coatings [ 87 88 89 Auricularia auricular Scleroglucan, schizophyllan, and lentinan are other examples of fungus-derived exopolysaccharides. Sclerogucan is produced by Sclerotium rolfsii Schizophyllum commune Lentinula edodes 90 91 92 These polysaccharides typically adopt a triple-helical conformation in aqueous environments, which contributes to their functional stability. Scleroglucan is valued for its excellent rheological properties, exhibiting shear-thinning behaviour, thermal resistance, and pH tolerance (maintaining viscosity up to pH 13 before decreasing) [ 93 94 95 96 96 All three polysaccharides are currently utilized in cosmetics and biomedical formulations, but scientific research on their application in edible coatings or films remains scarce. In food systems, scleroglucan and schizophyllan are mainly used as stabilizers, thickeners, and gelling agents, particularly in Japan [ 97 92 98 99 100 Litsea cubeba 100 Other known gums, such as xanthan gum, mucilage, gellan gum, dextran, or locust bean gum, are also currently being studied and their ability as biopolymers to incorporate bioactive compounds to extend food shelf life is being proven. Thus, Aayush et al. (2024) [ 101 Tamarind polysaccharide is an underexploited biopolymer for food packaging applications that has recently emerged as a biopolymer, considering tamarind seeds form a large proportion of the fruit and are already being exploited by the pharmaceutical industry for drug delivery purposes. It is mainly composed of xyloglucan, based on units of xylose, galactose, and glucose. Contrary to most of the previously described biopolymers, tamarind polysaccharide possesses good mechanical and moderate barrier properties [ 101 102 103 104 Finally, among polysaccharides, pectin is being considered as a biopolymer due to being easily recuperated from industrial fruit by-products, mainly apples and citrus peels. Depending on its purification process, it can possess antioxidant capacity due to the covalently bound phenolic compounds, but can also be included to functionalize pectin-based films [ 105 106 107 The abridgments that all biomaterials have shown regarding mechanical and barrier properties can be improved by modifying the polymeric structure using plasticizers (e.g., glycerol, sorbitol, or polyethylene glycol) [ 108 2 109 110 111 112 113 114 115 116 117 3. Technologies for Edible Coatings and Film Development and Applications in Food The development of active packaging to extend food shelf life has driven significant advances in techniques for producing and applying films or coatings on food products. These technologies enable the incorporation of bioactive compounds, particularly natural extracts rich in phenolic compounds or isolated phenolics, which provide antioxidant and antimicrobial properties. Recent years have seen a growing trend in optimizing these methods to enhance both the functional performance of the coatings and the preservation of food quality. Figure 1 Table 2 3.1. Films Fabrication Methods Melt extrusion is a thermomechanical processing technique that involves melting a biopolymer/blend, which is subsequently passed through a die to form continuous films. The resulting films are then solidified by cooling down. It is a technique widely employed in industry for petroleum-based or biobased material processing due to its high production, versatility, and low-cost. Currently, it is also investigated for its application in edible biopolymers. As such, Cheng et al. (2022) employed blown extrusion to produce ε-polylysine hydrochloride-loaded starch/gelatin edible antimicrobial films [ 118 119 Injection moulding is a manufacturing process broadly used in conventional plastics production. This method is emerging for employment in the production of edible and active films for food packaging applications. It involves a mould to obtain the desired shape of a directly injected molten material, which is then solidified. Recently, Plasencia et al. (2025) [ 120 Casting is a low-cost technique widely employed to develop active films, especially at a lab-scale level. It consists of solubilizing the materials for further solvent evaporation, incorporating directly the bioactive compounds and other additives into the polymeric matrix [ 121 122 123 2 124 125 126 In recent years, research into encapsulation technologies has significantly increased, focusing on protecting bioactive compounds from environmental degradation caused by factors such as humidity, UV light, and heat, while also enhancing their controlled release. The use of nanoemulsions to ameliorate the solubility of bioactive compounds and entrap them into the biopolymers to provide a controlled release has increased in the last 10 years [ 127 128 129 130 131 Finally, electrohydrodynamic atomization (EHDA) has arisen as an encouraging technique in active packaging development due to its capacity to transform biopolymer solutions into nanostructures, generating films or coatings. This technique employs an electric field to produce electrospun nanofibers or electrosprayed nanoparticles, ranging in size from the micrometric to the nanometric. Both structures’ properties can be modulated by modifying parameters, such as the material concentration, needle opening, and distance-to-collector or voltage [ 132 133 134 135 136 Multilayer formulations have been shown to improve the physicochemical properties of films and coatings. Among the various techniques for producing multilayer films, the electrohydrodynamic atomization (EHDA) of multilayer films has proved to enhance the performance characteristics of the films, boosting mechanical strength and flexibility, while also improving their functionalization with bioactive compounds [ 137 138 3.2. Coating Application Methods Coating formulations unloaded or loaded with bioactive compounds can be applied as coatings using various methods, with dipping being the most common and cost-effective technique. In this process, the food product is immersed in the solution, followed by the evaporation of solvents, leaving a protective coating on the surface [ 139 140 141 142 Spraying, another widely used coating technique, offers the advantage of precise control over key factors in the coating process, including system conditions, operational parameters, and the structural characteristics of the polymer. This method produces uniform layers with well-controlled thicknesses, ensuring the consistency and quality of the final coating [ 52 143 144 Spreading or brushing techniques consist of the direct application of the coating with a brush. They are commonly used for small fruits and vegetables. However, the drawbacks of these techniques are related to the non-controlled coating thickness and the limitations in terms of large-scale applications [ 145 146 147 147 Vacuum impregnation is a useful technique for applying coatings to porous fruits and vegetables, but is not suitable for delicate fruits. It is a non-thermal technique which removes the air and moisture from the food matrix, followed by coating infusion. It allows a thicker deposition, higher concentration, and controlled deposition compared to the dipping technique [ 148 149 150 151 152 The panning method is well-established in the food industry and, in particular, the pharmaceutical industry, due to its efficiency in processing large food quantities. It involves placing food products in a large rotating pan while the coating solution is evenly sprayed onto their surfaces as the pan continuously spins. Thus, it is especially useful for spherical foodstuffs, such as nuts. It ensures a homogeneous distribution of coating whose thickness can be controlled by the pan’s rotation speed. After coating application, food is commonly subjected to a drying process [ 153 154 155 The enrobing method is another methodology commonly employed in the food industry for applying coatings, particularly for confectionery products. This process involves dipping or passing food through a curtain or bed of coating material or formulation, such as molten chocolate, to achieve a uniform and continuous coating. As such, enrobing is commonly employed for products like chocolate-covered nuts [ 144 156 147 Heracleum persicum Fluidized-bed processing method consists of solid particles suspension in a stream of air or gas, enabling thin and uniform coating layer application on small and dry food products. It is followed by a drying process [ 157 158 159 160 Cold plasma treatment is an innovative technique used in food packaging applications to enhance the properties of edible coatings. It involves generating plasma by applying an electric field to a neutral gas under atmospheric pressure, exposing materials to low-temperature plasma. Various approaches, including laser treatment, ozonation, UV radiation, or gamma rays can be employed to induce physicochemical changes on biopolymers. Plasma-based methods are utilized to improve the functional characteristics of biopolymers for the intended applications, such as adhesion or barrier properties [ 161 162 163 Ultrasonic spray coating is a next-generation spraying technique that enables multilayer coating through layer-by-layer deposition, promoting bond interactions between layers and addressing issues such as cross-contamination and time-consuming processes. Ultrasonic spray coating produces uniform droplets with a consistent size and distribution, ensuring a high-quality coating. The technique allows for the incorporation of various additives and materials, facilitating the encapsulation of bioactive compounds and the creation of multifunctional coatings [ 164 165 166 167 168 All the described techniques have shown encouraging potential in the production of edible and active coatings or films. However, more studies should be performed to overcome the drawbacks regarding scalability and cost-effectiveness for large-scale packaging applications. polymers-17-02472-t002_Table 2 Table 2 Biopolymer-based systems incorporating bioactive compounds, production technologies, food applications, and their effects on material properties and food preservation. Biopolymers Bioactive/Functional Compounds Technology Application Effect Ref.  Proteins Gelatin Grape seed extract Coating dispersion Tilapia fillets Protective effects against metabolic changes. ↓ changes contents the main metabolites. Inhibited the formation of harmful substances or undesirable compounds with off-odours. ↓ pH changes, ↓ TVB-N, and ↓ K-value variations [ 169 Gelatin Peppermint and chamomile EOs Electrospinning NA ↑ WCA, ↑ antioxidant properties (>chamomile EO), ↑ antibacterial activity (>peppermint EO), and not cytotoxic [ 134 Zein–gelatin Tea polyphenol Casting Kiwifruit, avocado and banana Fruits [ 170 Irradiated starch–gelatin Lime juice Casting Chicken Films Chicken [ 171 Gelatin Propolis extract Casting Raspberries Films Raspberries [ 10 Gelatin Tomato by-product hydrolysate Casting Pork loin Pork [ 172 Gelatin Cinnamaldehyde Casting Grass carp fillets Films Carp fillets [ 173 Gelatin–chitosan Curcumin and cinnamon oil Casting Pork meat Film Pork meat [ 174 Gelatin–pectin Lemongrass EO Casting Chicken breast Films Chicken [ 175 Whey Natamycin or/and α-tocopherol nanoemulsion (o/w) Casting NA Films [ 176 Sweet whey–starch Chlorogenic acid Casting Bananas Films Bananas [ 177 WPI A511 bacteriophage Casting Cheese Films Cheese [ 178 Tomato seed mucilage–whey Shallot EO Casting Fish fillet Fish fillet [ 179 Nanochitosan–WPI Summer savoury EO Casting Rainbow trout fillets Films and fish [ 180 Pectin–WPC  Lactobacillus helveticus Casting Acid-Curd Cheese Cheese [ 181 WPI Transglutaminase Casting Fresh-cut apple Films Apple 2 2 [ 182 WPC Green tea extract Casting Fresh Cheese ↑ antioxidant activity Cheese [ 183 WP NA Coating dispersion Peanuts ↓ lipid oxidation and ↑ SL (3 months) [ 155 WP NA Coating dispersion Chocolates WPI–sucrose provided chocolates with the most gloss (even after 5 months). Sucrose crystallization contributed to coating gloss [ 154 WPI Bergamot oil Casting NA ↑ mechanical properties, ↓ WVP, ↓ L*, ↑ opacity, ↑ homogeneous structure, and ↑ antioxidant activity [ 184 WPC Oregano EO Casting Grapes Films Grapes [ 13 Zein Methyl ferulate Coaxial electrospinning Sea Bass Films Sea bass [ 185 Zein–PVA–chitosan Anthocyanin extract Layer-by-layer casting Shrimp Films Shrimp [ 186 Zein Garlic EO Casting Vannamei prawn Prawn 2 [ 187 Zein-chitosan Thymol; thyme, cinnamon and oregano EOs Casting Strawberries Micelles Strawberries [ 188 Zein Heracleum persicum Coating dispersion Cheese Cheese [ 147 Zein–beeswax Nisin Coating dispersion Nectarines and apples Nectarines and apples [ 189 Zein 2-hydroxypropyl-ß-cyclodextrin Casting Strawberries Films Strawberries [ 139 Zein Dill leaf extract and dill leaf EO Casting Carp fillets Films Fillets [ 190 Starch–zein Sorghum bran extract Casting NA ↑ TS, ↑ EB, ↓ moisture, ↓ WS, ↑ opacity, ↑ antioxidant activity, ↓ microorganism growth, and ↑WVTR [ 191 Zein-chitosan NA Electrospinning (zein) Apple slices Films Apples [ 192 Zein Thyme EO Electrospinning Strawberries Nanofibers Strawberries [ 193 Zein–CNC Curcumin Core–shell microparticles Solvent evaporation (curcumin loaded zein microparticles) Antisolvent precipitation NA ↓ particle size and ↑ stability with ↑ curcumin, ↓ particle size at ↑ pH, ↓ bioaccessibility with ↑ CNCs, ↑ degradation under UV light, and CNCs ↑ thermal stability [ 194 Zein TiO 2 Casting NA ↑ mechanical strength, ≃ flexibility and ↑ water resistance (compared to zein), and ↑ antimicrobial activity [ 195 Zein–chitosan Eugenol or/and curcumin Casting Blueberries Films 2 Blueberries [ 196 Zein–chitosan–dialdehyde CMC Cinnamaldehyde Casting Strawberries Films Strawberries [ 197 Zein NA Injection moulding NA ↑ thermal stability, ↓ water uptake along weeks, ↑ EB, ↓ elongation (↑ urea), and ↓ toughness (↑ urea). Clearer colour and ↑ hydrophilic properties (↑ urea). Plasticizers ↓ glass transition temperature. 80% degradation after 6 weeks [ 120 Sodium caseinate NA Blown extrusion NA ↓ Young’s modulus (↑ glycerol % and ↓ relative humidity), ↑ EB (glycerol ≥ 25% and ↑ RH), and ↑ WVP (↑ glycerol) [ 198 Pea protein isolate NA Injection moulding NA ↓ film transparency. ↑ TS, ↑ Young’s modulus, and ↓ EB (70% pea protein). ↑ water uptake. 30–40% glycerol needed for ↑ processability [ 199  Polysaccharides Chitosan NA Coating dispersion (substitution of wheat flour by chitosan solution in frying batter) Fish sticks ↑ L*, ↓ whiteness, ↓ Hue angle, ↓ fat uptake, ↓ TVB-N, ↓ PO value, ↓ lipid oxidation, ↓ hardness, ↓ crispness, ↓ gumminess, ↓ Warner–Bratzler shear force, and ↓ toughness [ 200 Chitosan Kojic acid and clove EO Coating dispersion White shrimp ↓ microorganism growth, ↓ TVB-N, ↓ pH, ↓ ΔE, ↑ sensory scores, and ↓ WL [ 201 Chitosan–gelatin–catechol-modified chitosan AgNP Casting NA ↓ WS, ↑ surface roughness, ↑ TS, ↓ EB, ↓ WVP, and ↑ antibacterial properties [ 202 Chitosan Gallic acid Casting NA ↑ TS, ↑ EB, ↓ WVP, ↓ oxygen permeability, ↓ swelling, ↓ WS, ↑ UV-barrier properties, ↑ antibacterial properties, and ↑ antioxidant properties [ 203 Salvia macrosiphon NA Casting Cherries and apples Films Fruits [ 45 Chitosan–hydrolysed orange peel (pectin-rich) NA Casting NA ® ↑ elastic modulus, ≃ TS, ↓ EB, ↑ oxygen barrier properties, ↓ WVP, ↑ thermal properties, ↓ moisture content, ↑ UV-barrier properties, ↑ WS, ↑ transparency, ↑ antioxidant capacity, ↑ antibacterial properties, and fast biodegradability (62.9% WL after 26 days) [ 204 Collagen–chitosan Gallic acid and ε-polylysine Casting Pork Films Pork [ 47 Chitosan–guar gum Watermelon rind extract Casting Fresh-cut bananas Films Bananas [ 205 Chitosan–chitin Eggplant anthocyanins Casting Pork Nanofibers Films [ 206 Chitosan Luteolin Casting NA Nanoemulsion Films [ 207 Carboxymethyl chitosan Pomegranate peel extract Coating dispersion Grass carp fillets ↓ drip loss, ↓ texture softening, ↑ sensory scores, ↓ lipid oxidation, ↓ TVB-N, ↓ K-value, ↓ bioamine accumulation, ↓ microorganism growth, and ↑ SL (3 days) [ 46 Chitosan NA Coating dispersion Pumpkin Vacuum impregnation [ 208 Chitosan NA Coating dispersion Pistachio preserved hardness and colour indices, ↓ PO, ↓ microorganisms growth, ↓ aflatoxins, and ↑ overall acceptance [ 163 Chitosan Pomegranate extract Hydrogel pad NA ↑ swelling ratio over time and ↑ pH, porous hydrogel (cross-linking), ↑ TPC, ↑ antioxidant capacity, ↑ antibacterial properties, and water absorption [ 209 Cassava starch–pea protein NA Blown extrusion Soybean and olive oil Pea protein: stabilized films during blown-extrusion, ↓ flexibility, ↓ non-homogeneity AS-PI blend matrices. ↑ TS, ↓ WS, ↓ light-transmission, ↑ crystallinity, ↑ WCA, ↓ WVP, ↓ OP, ↓ humidity-induced shrinkage, and ↑ thermal stability [ 119 Cassava starch–chitosan–gelatin NA Coating dispersion Guavas ↓ WL, ↓ titratable acidity, ↓ vitamin C, ↑ soluble solids, ↓ ripening index, ↓ microorganism growth, and ↑ SL (9 days) [ 210 Starch–gelatin ε-polylysine Blown extrusion Bread Films Bread [ 118 Potato starch Carvacrol Casting Paipa cheese Films Cheese [ 146 Sweet potato starch Cumin EO Coating gel Pears ↓ rot lesion on infected pear caused by Alternaria alternata [ 140 Jackfruit starch Pomegranate peel extract Casting Grapes Film Grapes [ 211 Starch NA Coating dispersion Strawberries ↓ ripening, ↓ firmness reduction, ↓ WL, ↓ total soluble solid reduction, ↓ ascorbic acid loss, ↓ microbial load, and ↓ redness reduction [ 142 Mango kernel, corn, and litchi seed starch Clove EO Casting Khasi Formulations Films Mandarin [ 52 Buckwheat starch–xanthan gum Lemongrass EO Casting Plum Films: ↓ moisture content, ↓ WS, ↑ L*, ↑ thermal properties (compared to commercial starch), ↑ TS, ↓ EB, ↓WVP, ↑ WCA, ↑ antioxidant capacity, and ↑ antimicrobial activity Plum [ 212 Potato starch Sodium benzoate Coating emulsion “Fino” lemons ↓ WL, ↓ gas exchange, ≃ firmness, ≃ pH, ≃ Hue angle variation, ≃ titratable acidity, and ↓ disease severity and incidence (lemons were inoculated with Penicillum digitatum [ 141 Corn starch Fumaric acid Coating dispersion Silver pomfret fish steaks Bacteriostatic effect (↑ antibacterial activity), ↓ H 2 [ 213 Starch–CNF Citric acid (crosslinking agent) Casting Tomatoes Films Tomatoes [ 60 CNF Carbon dots Casting Tangerine, strawberry 2 Films Fruits [ 214 Alginate–CNC Thyme and/or clove EO Casting Guava Films Guavas [ 61 HPMC Rutin Casting NA ↓ YI, ↑ ΔE, ↓ moisture, ↓ TS, ↑ EB, and ≃ WVP [ 215 HPMC–beeswax Thyme, cinnamon and peppermint oil NA Sweet cherries ↓ total suspended solids, ↓ titratable acidity, ≃ colour, ↓ WL, ↓ respiration rate, ≃ firmness, ↓ TPC reduction, ↑ sensory quality, and ↑ antimicrobial activity [ 57 HPMC NA Coating dispersion “Golden Reinders” and “Granny Smith” apples ↓ firmness reduction, ≃ colour, ↓ superficial scald, ↓ antifungal growth, ↓ ACS activity, ↓ ethylene production, ≃ starch index, ≃ soluble solids content, ≃ total titratable acidity, ↓ VOCs (↓ terpenoids, ↓ esters, ↓ aldehydes) ↓ consumer acceptance, ↓ α-farnesene levels and its oxidation products, and ↑ ethanol accumulation [ 216 HPMC–chitosan–alginate Nisin Casting Chestnut Films Chestnut [ 217 CMC Polysaccharide and phenolic compounds from spent coffee grounds Coating dispersion Goldenberries ↓ WL, ↓ gas permeability (O 2 2 2 4 [ 143 CMC–bacterial cellulose Olive and ginger oil Casting Oranges and tomatoes Film Fruits [ 218 Ethyl cellulose Medium chain triglyceride oleogel Hot extrusion 3D food printer NA ↑ oil binding capacity (↑ ethyl cellulose). [ 219 Xanthan gum–CMC ZnO-NPs Casting Tomatoes Films Tomatoes [ 220 Chia seed mucilage–bacterial CNF NA Coating dispersion Strawberries ↑ TPC, ↑ TFC, ≃ TAC, ↑ Vit C, ↑ antioxidant activity, ↓ PO activity, and ↓ peroxidase enzymes activity [ 221 Alginate Hydroxyapatite–quercetin NA Chicken fillets ↓ release rate (compared to free quercetin), ↑ L* preservation, ≃ ΔE, ↓ WHC, ↑ antibacterial activity, ↓ harness increase, ↓ springiness reduction, ↓ gumminess and chewiness decrease, ↓ TVB-N, and ↑ overall acceptability throughout storage time [ 222 Alginate, chitosan, and soy protein isolate NA Coating dispersion Mozzarella cheese ↓ WL (> chitosan > alginate >soy protein), ≃ hardness, ↓ WL (dipping > enrobing > spray > electrospray), ↓ thickness (spray and electrostatic spray), ↑ homogeneity (dipping and enrobing), and ↑ spreadability (alginate) [ 144 Alginate NA Coating dispersion Melon ↑ firmness (vacuum impregnation), ↑ weight gain (vacuum impregnation), and ↑ ΔE (vacuum impregnation) [ 152 Alginate Aloe vera Casting Green capsicums Films Green capsicums [ 223 Alginate Brassica juncea Raphanus sativus Casting Tomatoes Films Tomatoes [ 224 Alginate Myrtle, rosemary extract, irradiation Coating dispersion Beef cattle meat ↓ lipid oxidation, ↑ antioxidant properties, ↓ L*, ↑ redness, ↓ firmness, ≃ pH, ↓ microorganism growth, and ↑ SL (6 days) [ 225 Alginate Citrus sinensis Nanoemulsion Tomatoes ↑ whiteness index, ↑ antibacterial activity, ↑ firmness, ↓ WL, ↓ pH increase, and ↑ overall acceptability [ 75 Alginate–chitosan Fucoidan Coating dispersion Rainbow trout fillets ↑ fish quality, ↓ lipid oxidation, ↓ TVB-N, ↑ antibacterial activity, ↑ overall acceptability along storage time, and ↑ SL (10 days) [ 226 Glucomannan– κ Salmonella enteritidis Casting Chicken meat Film Chicken meat [ 227 ι and κ-carrageenan—high and low methoxyl pectin Tomato paste Casting NA red colour films, ↑ WVP, ↓ moisture ↑ weight, ↑ opacity, ↑ strength, ↑ flexibility, ↑ stiffness, and ↑ antioxidant properties [ 228 κ-carrageenan Dill EO–oxygen absorber Coating dispersion Chilled rainbow trout fillets ↓ pH increase, ↓ TVB-N, ↓ conjugated dienes, ↓ lipid oxidation, ↓ protein carbonyls, ↓ electric conductivity, ↓ organoleptic deterioration, ↑ antioxidant properties, ↑ antibacterial properties, and ↑ SL (16 days) [ 229 Konjac glucomannan–carrageenan Camellia oil Coating dispersion Chicken meat ↓ WL, ↓ pH increase, ↓ lipid oxidation, ↓ TVB-N, ↑ antibacterial properties, ↑ overall acceptability along storage time, and ↑ SL (10 days) [ 230 Tragacanth gum–carrageenan Clove EO Casting NA ↓ TS, ↓ YM, ↑ EB, ↓ moisture content, ↑ WS, ↓ WVP, ↑ ΔE, ↑ antibacterial properties, and ↑ antioxidant capacity [ 231 κ-carrageenan Spent coffee grounds oil Casting NA ↓ TS, ↑ EB, ↑ WS, and ↑ antioxidant capacity [ 232 Pullulan Auricularia auricular Casting Potato fresh cut Films Potato [ 89 Pullulan–gelatin Clove EO Casting NA ↑ antibacterial properties, ↓ density (NE) and ↑ with emulsion, ↓ moisture content, ↓ WVP, ↓ TS, ↓ EB (NE) and ≃ with emulsion, ↓ ΔE (NE) and ↑ with emulsion, ↑ antioxidant properties, emulsion and ↓ release rate after 72 h [ 233 Pullulan–chitosan Galangal EO Casting Mango Films Mangoes [ 234 Agar–agar Bacteriocin of Lactobacillus sakei Casting Curd cheese Films Cheese [ 235 Agar–gelatin Aloe vera Casting Kashar cheese Films Cheese [ 236 Levan–pullulan–chitosan ε-polylysine Casting Strawberries Films Strawberries [ 86 Pectin–pullulan Grape seed extract Casting Peanuts Films Peanuts [ 237 Xanthan gum Betel leaf extract Coating nanoemulsion Tomatoes NE Tomatoes [ 101 Persian gum–gelatin Thyme EO Casting Barred mackerel fillet Films Mackerel [ 238 Guar gum Butea menosperma Casting Tomatoes Films Tomatoes [ 239 Alginate–algaroba seed galactomannans/cashew gum–gelatin NA Coating dispersion Grapes ‘Italia’ ↓ WL, ↓ firmness reduction, ↓ TSS, ≃ L*, ≃ pH, ↑ TPC, and ↑ antioxidant properties [ 240 Kefiran–gelatin Zhumeria majdae Casting Sponge cakes Films [ 83 Chia seed mucilage–bacterial CNF NA Coating dispersion Strawberries ≃ TAC, ↑ vit C, ↑ TPC preservation, ↑ antioxidant properties, ↓ PO, ↓ PA, ↓ SOD, and ↓ ALP [ 221 Plantago major Citrus limon Coating dispersion Buffalo meat ↓ PO (↓ lipid oxidation), ↓ microbial growth, ≃ pH, ↓ moisture reduction, ↓ hardness reduction, ↓ ΔE, and ↑ overall acceptance [ 241 Fenugreek seed mucilage–CMC Rosemary EO Casting Apples Films Apples [ 242 MHEC–brewer’s spent grain arabinoxylans NA Casting NA ↓ TS, ↑ thermal stability, ↑ hydrophobicity (↑ WCA), ↓ moisture content, ↓ WS, ↑ WVTR, and ↑ antioxidant properties [ 243 Brewer spent grain arabinoxylans–CNF Ferulic acid or feruloylated arabinoxylo-oligosaccharides Casting NA ↑ UV-blocking properties, ↓ YM, ↓ TS, ≃ EB, ↑ thermal stability, ↑ antioxidant properties, and ↑ antimicrobial activity [ 244 Arabinoxylan Tea polyphenol Casting Grapes Films Grapes [ 245 Water extractable arabinoxylans NA Casting Cherry and strawberry Films Fruits [ 246 Carboxymethylated tamarind seed polysaccharide ε-Polylysine Casting Green Bell Pepper Films Pepper [ 247 Tamarind xyloglucan/protein–chitosan NA Casting NA ↑ thermal stability, ↓ TS, ↑ EB, ↑ MC, ↓ WS, and ↓ swelling degree [ 248 Glutenin–tamarind gum Melatonin-pummelo EO Casting White mushroom Films Mushroom [ 249 Tamarind xyloglucan–starch Lignin nanoparticles Casting Banana Films Banana [ 250 Shellac Tannic acid Coating dispersion Mangoes ↓ WL, ↓ firmness reduction, ↓ respiration rate, ↓ browning index, ↓ lipid oxidation, ↓ TSS, ↑ TPC, ↑ antioxidant properties, ↓ membrane permeability, ↓ enzymatic activity, ↓ vit C loss ↑ volatiles preservation, ↑ antifungal activity, ↑ overall quality, and ↑ SL (10 days) [ 251 Shellac–soy protein-starch Juglone from walnut green husk extract Coating dispersion Wichita pecans ↓ pure kernel loss, ↓ acid value increase, ↓ fat loss, ↑ PO, ↑ overall taste, ↑ interior brown colour, and ↑ antibacterial activity [ 252 Zein–shellac Curcumin Casting NA ↓ WVP, ≃ WS, ↓ EB, ↑ TS (1, 3% curcumin), ↓ TS (5, 7% curcumin), ↑ WCA, ↓ L*, ↑ ΔE, ↑ YI, ↑ opacity, ↓ thermal stability. Controlled release, pH responsiveness, ↑ antioxidant properties, and ↑ antibacterial properties [ 253 Shellac NA Electrospinning (coating on paper to package tomatoes) Coating Tomatoes [ 254 Pectin Ilex paraguariensis Casting NA ≃ WVP, ↓ L*, ↑ ΔE, ↑ TPC, ↑ antioxidant properties, ↑ thermal resistance, and ↑ UV blocking properties [ 255 Pectin–beeswax Satureja montana Cinnamomum zeylanicum Commiphora myrrha Coating dispersion “Valencia” oranges ↓ fungal growth, ↓ WL ( Commiphora myrrha Satureja montana Cinnamomum zeylanicum Commiphora myrrha [ 256 Low-methoxyl pectin Epigallocatechin gallate Lyophilization Grapes Coatings Grapes [ 257 Pectin Carvacrol/2-hydroxypropyl-β-cyclodextrin inclusion complex Casting NA cyclodextrin ↑ carvacrol solubility and stability, ↓ viscosity, ↑ WCA, ↑ thermal stability, and ↑ antifungal activity [ 258  Others  NA Jaggery NA Apple snacks ↓ L*, ↑ ΔE ↑ antioxidant capacity, and ≃ TPC Freeze-drying: preserves the antioxidants [ 151 NA Enzymes Coating dispersion Pumpkin ↓ stiffness values, no fracture point, homogeneous texture profile, ↑ antioxidant capacity, and ↓ total and [ 150 NA Turmeric extract NA Jasmine white rice kernels Recycling of 80% exhaust air ↓ fissured kernels (<11.8% moisture content) and saved the energy consumption (41.7–46.5%). Coating efficiency 75–86%. Head-wrapped yield 94–95% [ 259 NA Rosemary extract Encapsulation with maltodextrin-gum arabic-WPC Microcrystalline cellulose cores Coating efficiency: 64.3–79.2. Agglomerates 0.2–47.7. Layering > agglomeration as the main growth mechanism of MCC cores. Retention efficiencies ≃ 70% (except for caffeic acid, ≃ 60%) [ 159 a NA NA PBS ↑ moisture resistance, ↑ mechanical and scratch resistance, ↓ OP, ↓ CO 2 [ 260 Defatted soybean meal NA Casting 2 2 Smoked salmon Ar-treatment Salmon [ 261 a 4. Controlled Release in Active Edible Coatings and Films Recently, active packaging has attracted great attention as a carrier for controlling the release of bioactive species, such as antimicrobial or antioxidant agents [ 262 263 264 264 265 266 6 One of the principal factors in the development of controlled-release active packaging is determining the release mechanism [ 267 Figure 2 Diffusion-induced release: volatile bioactive compounds diffuse from the packaging into the food through air or non-direct contact spaces. This mechanism is common in petroleum-based and water-resistant polymers. Swelling-induced release: bioactive compounds are released when moisture-sensitive packaging material, such as polypeptides or polysaccharide-based films, swells, allowing the bioactive compounds to be released by direct contact. Disintegration-induced release: applicable to biodegradable or reactive non-biodegradable polymers where the packaging material partially breaks down releasing the active compounds [ 263 264 267 Figure 2 Controlled-release mechanisms of bioactive compounds from edible coatings: ( A B C The diffusion process is the main phenomenon in the release of bioactive compounds from active packaging, generally described by Fick’s second law [ 267 263 264 265 267 Mathematical modelling based on Fick’s law, together with the diffusion coefficient (D) and the partition coefficient (K), provides a useful framework to predict and optimize controlled release. These parameters describe how molecules migrate through the packaging material and how they distribute between the polymer matrix and the food or simulant [ 231 268 269 However, mathematical models present limitations in real food applications since the release of active compounds is affected by certain conditions, including internal factors (bioactive agents, polymer matrix, and active layer) and external factors (storage and product characteristics) [ 262 264 267 270 271 89 103 264 272 Table 3 273 274 275 polymers-17-02472-t003_Table 3 Table 3 Application of bioactive compounds in controlled release systems using edible polymer matrices, with encapsulation methods, food product or food simulant applications, and observed food effects or controlled-release behaviour. Bioactive Coating Encapsulation/ Food Product/Food Simulant Observed Effect/Benefit Reference Thymol Zein Mono and multilayer films Distilled water Thymol release can be controlled by varying the thickness of the layers and the amount of biodegradable fibre [ 274 Aroma compounds (methyl-ketones, ethyl-esters, alcohols) ι-carrageenan Emulsified film with lipid globules Not applicable Improved retention of polar aroma compounds and gradual release over time [ 276 Methylene blue Κ-carrageenan and chitosan on polyethylene terephthalate Multilayer nanocoating via layer-by-layer deposition PBS of a certain pH (2.0 or 7.0) and temperature (4 or 37 °C) Controlled and modulable release behaviour, adjustable according to pH, temperature, and incorporation layer [ 273 Riboflavin and α-tocopherol Whey protein with gum arabic, low-methoxyl pectin or κ-carrageenan Water-in-oil-in-water (W/O/W) microcapsules HCl solution (pH 1.2); simulated gastric condition (pH 1.2) with 0.1% pepsin; phosphate-buffered saline (pH 7.4); and simulated intestinal condition (pH 7.4) with 1.0% pancreatin Gum arabic showed better control of the liposoluble vitamin (α-tocopherol), while κ-carrageenan showed better control of the water-soluble vitamin (riboflavin). [ 277 Lysozyme, catechin, and gallic acid Zein–wax composite Aggregated hydrophobic wax particles Fresh Kashar cheese All lysozyme-containing films inhibited L. monocytogenes [ 278 Lysozyme and (+)-catechin Zein blended with oleic, linoleic, or lauric acids (with lecithin) Microsphere encapsulation Water The use of fatty acids with varying chain lengths affected the release rates of both compounds, whereas changes in the number of double bonds influenced only the release of catechin [ 275 Rosemary oil Mucilage Liposomes Fresh-cut banana The liposomal oil combined with mucilage inhibited polyphenoloxidase, lipoxygenase activities, fruit softening and weight-loss, and retained higher firmness and soluble solids content [ 279 β-carotene Xanthan gum Nanocapsules and nanospheres; Korsmeyer–Peppas and Higuchi matrix-type models Fresh-cut melon ( Cucumis melo Improved β-carotene retention was achieved with minimal changes in whiteness and firmness helping to extend shelf life to 21 days at 4 °C [ 280 Folic acid Alginate/chitosan Nanolaminated films by the layer-by-layer technique and post-diffusion Phosphate-citrate buffer solutions at pH 3 or 7 The release profiles were affected by pH conditions, showing a greater release in small intestine pH conditions where it is supposed to be adsorbed [ 281 Curcumin Carboxymethylated filter paper Nano metal–organic frameworks Pitayas On day 6, the rotten areas of the cut treated were below 5%, exhibiting a superlong-acting performance [ 282 Spent black tea (SBT) extract Pectin–sodium caseinate in a cassava starch matrix Microencapsulation Water and 95% ethanol Microencapsulation of SBT protected its antioxidants during film processing and significantly enhanced their migration into both simulants [ 283 Curcumin Chitosan Hydrogen bonding interactions Litchis, strawberries, mangos, and plums This coating enabled long-term release (up to 38 days) of natural preservatives on the surface of the fruit, maintaining freshness and appearance at least 9 days longer than uncoated samples [ 284 Angelica archangelica Chitosan Nanoemulsion Grapes ( Vitis vinifera Inhibited the contamination of Botrytis cinerea [ 285 Cinnamon essential oil (CEO) Chitosan/gelatin Pickering emulsion 50% ethanol and 95% ethanol Improved antimicrobial activity, enhanced thermal and mechanical stability, and exhibited better barrier properties and controlled release of CEO [ 286 Thyme essential oil Whey protein Co-precipitation in β-cyclodextrin Water and ethanol 95% Encapsulation improved volatile retention in the film and enabled gradual release, with slower rates in water compared to 95% ethanol [ 287 Thyme essential oil Chitosan Pickering emulsion Strawberries The emulsion effectively prevented weight loss, reduced firmness decline, inhibited pH increase, decreased titratable acidity, and restricted microbial growth [ 288 Vanillin Chitosan 2-hydroxypropyl-β-cyclodextrin; pH-dependent controlled release Chicken It extended shelf life and maintained sensory quality by delaying pH increases, preventing the proliferation of microorganisms, and inhibiting lipid oxidation [ 289 Thyme essential oil Chitosan and carboxymethyl cellulose Water-in-oil nanoemulsions Strawberries Potent antimicrobial effect, effectively controlling the growth of Botrytis cinerea [ 290 Whey isolate protein fibre and glycyrrhizic acid (3:1) Sodium alginate Temperature-responsive emulsion system Grapes Maintained pH, soluble solids, and vitamin C; reduced weight loss by 44.5% at 45 °C after 6 days [ 291 Thymol Alginate Nanoemulsion and nanostructured lipid carriers Carrot Higher peroxidase activity, total phenolic content, flavonoid content, DPPH radical scavenging activity, pH, and lower respiration rate, total soluble solids, weight loss, and decay, particularly with nanostructured lipid carriers [ 292 When conducting experimental tests, it is very important to design them correctly and to consider that the release depends entirely on the compatibility of the bioactive compound and the selected food product or food simulant. However, it was found that most studies focus on the development and physicochemical characterization of active edible coatings and films by scanning electron microscopy, Fourier transform infrared spectroscopy analysis, zeta potential, particle size, etc., but only a few of them evaluate the release of the active compounds through testing with food simulants or in the foods themselves. For example, Rajapaksha and Shimizu (2021) showed a significantly higher release of antioxidant compounds from spent black tea microcapsule films in water than in 95% ethanol [ 283 286 286 287 281 277 Table 3 246 280 In some cases, edible coatings are intended to impart flavour by encapsulating and gradually releasing aromatic compounds, particularly the more polar volatiles that are typically evaluated by gas chromatography–mass spectrometry (GC-MS) [ 277 276 Studies on the release of bioactive compounds from active and edible coatings are still scarce, so it is important to continue researching how the film matrix, the carrier particle, and the type of bioactivity affect this release, as well as to investigate the mechanisms involved and develop mathematical models that enable the description and prediction of the release profile [ 264 5. Functional Food Applications Edible coatings and films are a sustainable and effective method of preserving food and increasing its shelf life by acting as passive barriers that alleviate the need for chemicals, protecting products from moisture, oxidation, mechanical stress, and microbial infestation [ 293 Table 4 6 294 294 Table 4 295 296 295 294 297 Bifidobacterium lactis Lactobacillus acidophilus Lactobacillus casei 298 Limosilactobacillus fermentum Lactobacillus brevis However, sometimes, after intestinal simulation, the probiotic load decreases sharply due to the change in pH and the presence of different enzymes that can affect the integrity of the coating [ 294 299 294 Lactobacillus plantarum Lactobacillus rhamnosus Bifidobacterium animalis subsp. lactis 300 In addition, it is essential to conduct studies that confirm the ability of active compounds to diffuse through coatings and reach the food matrix, as demonstrated by Tampucci et al. (2021) [ 301 301 Edible coatings are also used in combination with osmotic dehydration to develop healthy and sustainable fruit and vegetable snacks with improved properties, as they allow the removal of water without significant nutrient losses, optimizing the texture and physicochemical properties [ 302 Although studies on functional food applications are limited, there is considerable interest in the potential of nanocomposite systems as carriers of bioactive compounds to improve edible coatings, enhance the controlled release and dispersibility of bioactives within the food matrix, and increase the overall functionality of food systems [ 296 303 303 polymers-17-02472-t004_Table 4 Table 4 Recent advances in the use of functional compounds for the development of edible coatings and films materials with food applications, functional properties, and health benefits. Functional Compound Coating/Film Material Functional Property Food Product Health Benefit Reference Probiotic ( Lactobacillus plantarum Methylcellulose Symbiotic delivery increases the viability of probiotics after both 90 days of storage and contact with a simulated gastrointestinal environment, and maintain sensory properties Apple snacks Regulation of the gastrointestinal tract and prevention of cardiovascular disease and different forms of cancer, among other effects [ 304 Lactobacillus casei Inulin, gelatin and whey protein Probiotic delivery, stability in low-moisture matrices, and increase in shelf life Cracker cookies Preventing various health problems [ 305 Iron and ascorbic acid k-Carrageenan or tapioca starch Improves product stability by enhancing ascorbic acid retention and iron bioaccessibility under intestinal conditions Refrigerated ready-to-eat pumpkin ( Cucurbita moschata Carrying micronutrients [ 306 Lytic bacteriophage Chitosan Antimicrobial delivery Tomatoes Enhanced microbial safety against Escherichia coli [ 307 Garlic essential oil Chitosan Increases antioxidant properties (synergistic effect), especially as a radical scavenger Beef meatball Antioxidant (anti-diabetic, anti-cancer, and anti-atherosclerotic activities) [ 308 Probiotic ( Lactobacillus rhamnosus Alginate Synbiotic delivery, improved probiotic viability, antimicrobial activity, antilisterial effect Blueberries Probiotic carrier with antagonistic activity against fruit-borne pathogens and improvements regarding male fertility [ 309 Probiotic ( Bifidobacterium animalis Whey protein isolate and alginate Synbiotic delivery and improved probiotic strain viability throughout storage and throughout in vitro gastrointestinal digestion Cereal bars Antioxidant properties and supports gut health [ 310 Probiotic ( Lactobacillus plantarum Sodium alginate Synbiotic delivery and improved probiotic strain viability after the simulated digestion Cottage cheese Improved health and/or reduces the risk of certain diseases [ 257 Prebiotics (oligofructose and inulin) and probiotic cultures ( Lactobacillus rhamnosus Bifidobacterium animalis lactis Alginate Synbiotic delivery; increases the viability of probiotics; antimicrobial activity Fresh-cut apple Antioxidant activity; complementary strategy in the management of obesity [ 300 Probiotic strains ( Bifidobacterium lactis Lactobacillus acidophilus Lactobacillus casei Chitosan, sodium alginate and carboxymethyl cellulose Antimicrobial preservation to extend shelf life and ensure stability UF soft cheese Digestive regulation, stimulating the immune system, lowering cholesterol levels, lactose intolerance, cancer prevention, and cardiovascular diseases [ 297 Tyrosol Chitosan Extends the shelf life and preserves the quality of fresh food Tomatoes Antioxidant, cardioprotective, antitumoral, anti-inflammatory, and neuroprotective properties [ 263 Probiotic bacteria ( Limosilactobacillus fermentum Lactobacillus brevis Sodium caseinate and chia mucilage Probiotic delivery, improving their viability and stability on bakery products Wheat buns Gut health support and disease risk reduction [ 261 Probiotic strain Enterococcus faecium Mucilage of cactus ( Opuntia ficus-indica Probiotic delivery, improving the preservation and shelf life of the product Fresh-cut apple slices Antioxidant activity, potential gut health benefit from probiotic delivery [ 311 Probiotic ( L. acidophilus Sodium alginate Synbiotic delivery, increases the viability of probiotics, improves thermal resistance and increases shelf life Corn-based snack (churritos) almasalud Reduction in the duration of diarrhea and reduction in body mass index in obese individuals [ 312 Seaweed ( Pelvetia canaliculate Alginate and carrageenan Reduces oil absorption, minimizes water loss, preserving fish succulence, and prevents fat oxidation during cooking Mackerel ( Scomber scombrus Reduction in the intake of saturated and trans fatty acids, preventing cardiovascular diseases [ 313 Encapsulated raspberry pomace powder Aloe ferox Increasing shelf life while minimizing weight loss and retaining firmness Ready-to-eat pomegranate arils High antioxidant, anti-mutagenic, and antihypertensive properties [ 314 In addition to the challenges of ensuring functionality under gastrointestinal conditions, consumer acceptance remains a critical factor. In this context, evaluating sensory attributes such as colour and appearance, odour, and taste is essential to determining the feasibility of incorporating functional ingredients into new food products. For instance, Alvarez et al. (2021) [ 300 L. rhamnosus 304 309 6. Overview on Social and Environmental Impact and Scalability According to the United Nations’ 17 Sustainable Development Goals (SDGs) outlined in the 2030 Agenda, edible packaging can contribute to achieving some of them. In particular, Goal 2 (Zero Hunger) and Goal 3 (Good Health and Well-being) may be supported through the use of active edible materials [ 315 Nonetheless, edible films and coatings must face a scalability challenge, since they are usually developed at lab scales and their acquisition is limited, leading to high production costs. Additionally, these biopolymers exhibit wide variability in molecular weight, chain branching, and purity in each batch, depending on their origin and extraction protocol [ 316 Casting is the methodology most employed in coating/film formulation, and it is not compatible, as are other lab-scale methods, with industrial processes [ 317 317 318 Furthermore, the use of biopolymers is eco-friendly, since their production exhibits lower non-renewable energy use, CO 2 319 120 204 320 321 322 320 323 2 2 319 324 319 Consequently, bioplastics also lead to environmental impacts, including eutrophication due to biomass cultivation, acidification, or land use change. Therefore, the scalability of the production of active and biodegradable polymers should be assessed in a way that aims to incorporate investigations into their real-world use. Although the production of bioplastics leads to lower energy costs and greenhouse gas emissions, more research and a better understanding of the LCA and end of life of bioplastics must be achieved in order to reduce their environmental impact by achieving a circular economy. 7. Safety and Regulation of Active and Edible Coatings Edible coatings are subject to regulations that apply to food as they are part of the edible portion of the food product. Thus, the substances used in the preparation of edible coatings must be of food grade. In Europe the components used in the manufacture of edible coatings are mainly constituted by additives which are regulated under the Regulation (EC) No 1333/2008 of the European Parliament and of the Council on food additives [ 325 326 327 In the United States the substances used in edible coatings must be classified as Generally Recognized As Safe (GRAS). The Food and Drug Administration (FDA) provides an inventory of substances allowed in edible coatings, which fall into the categories “Food additives permitted for direct addition to food for human consumption” and “Secondary direct food additives permitted in food for human consumption”. In addition, other substances including copolymers (e.g., vinyl chloride–vinylidene chloride copolymer), dispersing adjuvants (e.g., polyethylene glycol), film formers (e.g., sodium lauryl sulphate), and adjuvants (e.g., polyvinylpyrrolidone) are also allowed [ 7 328 329 330 Other important aspect that should be considered include the presence of ingredients that are potentially allergenic, which also should be declared in the label [ 7 328 Active coatings which are not part of food and are not intended to be consumed together with the food are regulated by Commission Regulation (EC) No 450/2009 on active and intelligent materials and articles intended to come into contact with food. However, it is worth mentioning that active substances that are intentionally added with the purpose of being released into the food and are intended to have a technical effect on the food must meet the requirements of food additive legislation [ 331 Regarding bioactive substances, currently plant extracts are being investigated to be incorporated into active coatings, due to, on the one hand, the better acceptance of natural compounds by the consumer and, on the other, the use of natural resources. However, a very limited number of plant extracts (e.g., extracts of rosemary) have been authorized as additives in the EU, which hinders the commercialization of these active systems. Therefore, the regulatory requirements remain a critical issue for their commercialization. 8. Conclusions and Future Perspectives Studies on edible films and coatings are a trending topic in sustainable packaging that enhances food functionality and extends shelf life. Biobased materials from food by-products have emerged as a sustainable alternative, reducing environmental impact while contributing to circular economy strategies. Despite their potential, several challenges remain before these materials can achieve large-scale commercialisation. Their mechanical and barrier properties are still inferior to those of conventional plastics, and thus the incorporation of additives and the use of advanced techniques, such as EHDA or spraying for nano- or micro-structured multilayered coatings, should be further explored. Additionally, the incorporation of bioactive compounds and natural extracts not only improves food safety and quality but also enables the development of nutrient-enriched and functionalized foods. However, regarding the controlled release of pre- and probiotics, nutrients, and bioactives, key parameters such as compatibility, stability during processing and storage, bioactivity, and functionality require deeper investigation. Edible coatings and films are recognized as a safe, renewable, low-cost, and sustainable. However, barriers remain, including consumer acceptance, scalability, and the high costs associated with industrial production (e.g., controlled release nanosystems). Bio-based materials and encapsulation technologies need to become cost-competitive with conventional alternatives. For regulatory approval, compliance with food safety standards, and allergenicity assessment, digestibility and toxicity testing remain critical requirements. Therefore, future efforts should not only focus on technical progress but also address consumer education, regulatory support, the integration of circular economy principles, and cost competitiveness to facilitate broader adoption. Importantly, this review goes beyond summarizing the general fundamentals of edible coatings and films by focusing on underexplored aspects that can drive future innovation in the field. Particular emphasis is placed on the integration of new biopolymer sources and nanostructured materials to enhance mechanical and barrier properties, the development of controlled release systems for bioactive compounds as an emerging but often overlooked functionality, and the application of edible coatings as carriers of nutrients and bioactives to support the design of functional foods. By consolidating recent advances in these areas and highlighting the existing knowledge gaps, this review provides a roadmap for researchers, industry, and regulators to accelerate the transition of edible coatings and films from experimental development to commercial reality, ultimately contributing to more sustainable and health-oriented food systems. Acknowledgments A.L.-C. is grateful for her Margarita Salas contract funded by the Program for Requalification, International Mobility, and Talent attraction in the Spanish University System (Ministry of Universities of Spain, grant UP2021-042). Disclaimer/Publisher’s Note: Author Contributions Conceptualization, S.M.-C. and L.B.-P.; methodology, S.M.-C., L.B.-P. and A.L.-C.; validation, R.S., A.R.B.d.Q. and L.B.-P.; formal analysis, S.M.-C., A.L.-C., A.R.B.d.Q. and L.B.-P.; investigation, S.M.-C., A.L.-C., A.R.B.d.Q. and L.B.-P.; resources, L.B.-P.; data curation, S.M.-C., A.L.-C., A.R.B.d.Q. and L.B.-P.; writing—original draft preparation, S.M.-C., A.L.-C., A.R.B.d.Q. and L.B.-P.; writing—review and editing, S.M.-C., A.L.-C., R.S., A.R.B.d.Q. and L.B.-P.; supervision, R.S. and L.B.-P.; project administration, R.S. and L.B.-P.; funding acquisition, R.S. and L.B.-P. All authors have read and agreed to the published version of the manuscript. Data Availability Statement No new data were created or analyzed in this study. Conflicts of Interest The authors declare no conflicts of interest. References 1. Dirpan A. Fadiah Ainani A. Djalal M. A Review on Biopolymer-Based Biodegradable Film for Food Packaging: Trends over the Last Decade and Future Research Polymers 2023 15 2781 10.3390/polym15132781 37447428 PMC10346960 2. Galus S. Arik Kibar E.A. Gniewosz M. Kraśniewska K. Novel materials in the preparation of edible films and coatings—A review Coatings 2020 10 674 10.3390/coatings10070674 3. Hamed I. Jakobsen A.N. Lerfall J. Sustainable edible packaging systems based on active compounds from food processing byproducts: A review Compr. Rev. Food Sci. Food Saf. 2022 21 198 226 10.1111/1541-4337.12870 34907649 4. Díaz-Montes E. Castro-Muñoz R. Edible films and coatings as food-quality preservers: An overview Foods 2021 10 249 10.3390/foods10020249 33530469 PMC7912451 5. Jurić M. Bandić L.M. Carullo D. Jurić S. Technological advancements in edible coatings: Emerging trends and applications in sustainable food preservation Food Biosci. 2024 58 103835 10.1016/j.fbio.2024.103835 6. Khin M.N. Ahammed S. Kamal M.M. Saqib M.N. Liu F. Zhong F. Investigating next-generation edible packaging: Protein-based films and coatings for delivering active compounds Food Hydrocoll. Health 2024 6 100182 10.1016/j.fhfh.2024.100182 7. Cloete L. Picot-Allain C. Ramasawmy B. Neetoo H. Ramful-Baboolall D. Emmambux M.N. Drivers and barriers for commercial uptake of edible coatings for fresh fruits and vegetables industry-A review Food Rev. Int. 2023 39 3481 3514 10.1080/87559129.2021.2012795 8. Ahmad T. Ismail A. Ahmad S.A. Khalil K.A. Kumar Y. Adeyemi K.D. Sazili A.Q. Recent advances on the role of process variables affecting gelatin yield and characteristics with special reference to enzymatic extraction: A review Food Hydrocoll. 2017 63 85 96 10.1016/j.foodhyd.2016.08.007 9. Luo Q. Hossen M.A. Zeng Y. Dai J. Li S. Qin W. Liu Y. Gelatin-based composite films and their application in food packaging: A review J. Food Eng. 2022 313 110762 10.1016/j.jfoodeng.2021.110762 10. Moreno M.A. Vallejo A.M. Ballester A.R. Zampini C. Isla M.I. López-Rubio A. Fabra M.J. Antifungal edible coatings containing Argentinian propolis extract and their application in raspberries Food Hydrocoll. 2020 107 105973 10.1016/j.foodhyd.2020.105973 11. Kandasamy S. Yoo J. Yun J. Kang H.-B. Seol K.-H. Kim H.-W. Ham J.-S. Application of Whey Protein-Based Edible Films and Coatings in Food Industries: An Updated Overview Coatings 2021 11 1056 10.3390/coatings11091056 12. Ramos Ó.L. Reinas I. Silva S.I. Fernandes J.C. Cerqueira M.A. Pereira R.N. Vicente A.A. Poças M.F. Pintado M.E. Malcata F.X. Effect of whey protein purity and glycerol content upon physical properties of edible films manufactured therefrom Food Hydrocoll. 2013 30 110 122 10.1016/j.foodhyd.2012.05.001 13. Sajimon A. Edakkadan A.S. Subhash A.J. Ramya M. Incorporating oregano ( Origanum vulgare J. Food Sci. Technol. 2023 60 2408 2422 10.1007/s13197-023-05763-7 37424588 PMC10326189 14. Maraveas C. Production of Sustainable and Biodegradable Polymers from Agricultural Waste Polymers 2020 12 1127 10.3390/polym12051127 32423073 PMC7285292 15. Dhall R.K. Advances in edible coatings for fresh fruits and vegetables: A review Crit. Rev. Food Sci. Nutr. 2013 53 435 450 10.1080/10408398.2010.541568 23391012 16. Lacroix M. Vu K.D. Edible coating and film materials: Proteins Innovations in Food Packaging Academic Press New York, NY, USA 2014 277 304 10.1016/B978-0-12-394601-0.00011-4 17. Chen L. Ramezan Y. Pourramezan H. Najafi A. Kamkari A. Goksen G. Huang A. Zhang W. Soy Protein Isolate (SPI)—Based Films/Coatings for Food Packaging: Research Progress on Properties and Applications Compr. Rev. Food Sci. Food Saf. 2025 24 e70181 10.1111/1541-4337.70181 40285443 18. Guo H. Li A. Huang G. Jin X. Xiao Y. Gan R.Y. Gao H. Development of apple pectin/soy protein isolate-based edible films containing punicalagin for strawberry preservation Int. J. Biol. Macromol. 2024 273 133111 10.1016/j.ijbiomac.2024.133111 38876238 19. Mostafa H. Airouyuwaa J.O. Hamed F. Wang Y. Maqsood S. Structural, mechanical, antioxidant and antibacterial properties of soy protein isolate (SPI)-based edible food packaging films as influenced by nanocellulose (NC) and green extracted phenolic compounds from date palm leaves Food Packag. Shelf Life 2023 38 101124 10.1016/j.fpsl.2023.101124 20. Yousuf B. Srivastava A.K. Ahmad S. Application of natural fruit extract and hydrocolloid-based coating to retain quality of fresh-cut melon J. Food Sci. Technol. 2020 57 3647 3658 10.1007/s13197-020-04397-3 32903859 PMC7447745 21. Dong F. Zhang M. Tang W.W. Wang Y. Formation and mechanism of superhydrophobic/hydrophobic surfaces made from amphiphiles through droplet-mediated evaporation-induced self-assembly J. Phys. Chem. B 2015 119 5321 5327 10.1021/acs.jpcb.5b00011 25835644 22. Calva-Estrada S.J. Jiménez-Fernández M. Lugo-Cervantes E. Protein-Based Films: Advances in the Development of Biomaterials Applicable to Food Packaging Food Eng. Rev. 2019 11 78 92 10.1007/s12393-019-09189-w 23. Yang J. Xie J. Paximada E. Electrosprayed zein and quercetin particles: Formation and properties Food Bioprocess Technol. 2025 18 2840 2853 10.1007/s11947-024-03633-4 24. Xia L. Li L. Xiao Y. Xiao F. Ji W. Pang M. Wang H. Hydrophobic electrospun membrane of peppermint oil loaded zein with coating of methyltriethoxysilane for active packaging Food Hydrocoll. 2023 144 109031 10.1016/j.foodhyd.2023.109031 25. Yang C. Yao L. Zhang L. Silk sericin-based biomaterials shine in food and pharmaceutical industries Smart Mater. Med. 2023 4 447 459 10.1016/j.smaim.2023.01.003 26. Marelli B. Brenckle M. Kaplan D. Omenetto F.G. Silk Fibroin as Edible Coating for Perishable Food Preservation Sci. Rep. 2016 6 25263 10.1038/srep25263 27151492 PMC4858704 27. Jaramillo-Quiceno N. Restrepo-Osorio A. Water—Annealing treatment for edible silk fibroin coatings from fibrous waste J. Appl. Polym. Sci. 2020 137 48505 10.1002/app.48505 28. Sharma S. Samrat Goyal P. Dhingra K. Singh A. Sarkar A. Poddar D. Shellac: Bridging the gap between chemistry and sustainability—A comprehensive review of its multifunctional coating applications for food, drug, and paper packaging J. Macromol. Sci. Part A 2024 61 691 723 10.1080/10601325.2024.2400510 29. Wang J. Wang X. Liu B. Xiao J. Fang Z. Shellac-based films/coatings: Progress, applications and future trends in the field of food packaging Food Chem. 2025 467 142326 10.1016/j.foodchem.2024.142326 39644663 30. Poddar D. Srivastava R.K. Pattanayek S.K. Goel G. Structure-property relationships in shellac-coated paper: Impact of coating parameters on high-barrier bio-based packaging applications Int. J. Biol. Macromol. 2025 310 143172 10.1016/j.ijbiomac.2025.143172 40250643 31. Schniewind A.P. Consolidation of dry archaeological wood by impregnation with thermoplastic resins Archaeological Wood: Properties, Chemistry and Preservation Advances in Chemistry Series No., 225 Rowell R.M. Barbour R.J. American Chemical Society Washington, DC, USA 1960 362 371 32. Precision FDA Available online: https://precision.fda.gov/ginas/app/ui/substances/46N107B71O (accessed on 8 August 2025) 33. Food and Feed Information Portal Database European Commission Available online: https://ec.europa.eu/food/food-feed-portal/screen/food-additives/search/details/POL-FAD-IMPORT-3276 (accessed on 8 August 2025) 34. Yao X. Zhu Y. Chen H. Xiao H. Wang Y. Zhen H. Tan C. Shellac-based delivery systems for food bioactive compounds Int. J. Biol. Macromol. 2024 271 132623 10.1016/j.ijbiomac.2024.132623 38845255 35. Yuan Y. He N. Xue Q. Guo Q. Dong L. Haruna M.H. Zhang X. Li B. Li L. Shellac: A promising natural polymer in the food industry Trends Food Sci. Technol. 2021 109 139 153 10.1016/j.tifs.2021.01.031 36. Álvarez-Barreto J.F. Cevallos-Ureña A. Zurita J. Pérez J. León M. Ramírez-Cárdenas L. Edible coatings of aloe vera gel and carnauba wax microparticles to increase strawberry ( Fragaria ananassa Int. J. Fruit Sci. 2023 23 181 199 10.1080/15538362.2023.2180129 37. Chalapud M.C. Baümler E.R. Carelli A.A. Edible films based on aqueous emulsions of low—Methoxyl pectin with recovered and purified sunflower waxes J. Sci. Food Agric. 2020 100 2675 2687 10.1002/jsfa.10298 31997346 38. Cha D.S. Chinnan M.S. Biopolymer-based antimicrobial packaging: A review Crit. Rev. Food Sci. Nutr. 2004 44 223 237 10.1080/10408690490464276 15462127 39. Hosseini S.F. Mousavi Z. McClements D.J. Beeswax: A review on the recent progress in the development of superhydrophobic films/coatings and their applications in fruits preservation Food Chem. 2023 424 136404 10.1016/j.foodchem.2023.136404 37257280 40. de Oliveira Filho J.G. Albiero B.R. Calisto Í.H. Bertolo M.R.V. Oldoni F.C.A. Egea M.B. Junior S.B. Azeredo H.M.C. Ferreira M.D. Bio-nanocomposite edible coatings based on arrowroot starch/cellulose nanocrystals/carnauba wax nanoemulsion containing essential oils to preserve quality and improve shelf life of strawberry Int. J. Biol. Macromol. 2022 219 812 823 10.1016/j.ijbiomac.2022.08.049 35963346 41. Ruiz-Martínez J. Aguirre-Joya J.A. Rojas R. Vicente A. Aguilar-González M.A. Rodríguez-Herrera R. Alvarez-Perez O.B. Torres-León C. Aguilar C.N. Candelilla Wax Edible Coating with Flourensia cernua Foods 2020 9 1303 10.3390/foods9091303 32947785 PMC7554823 42. Abhirami P. Modupalli N. Natarajan V. Novel postharvest intervention using rice bran wax edible coating for shelf—Life enhancement of Solanum lycopersicum fruit J. Food Process. Preserv. 2020 44 e14989 10.1111/jfpp.14989 43. Kou S.G. Peters L.M. Mucalo M.R. Chitosan: A review of sources and preparation methods Int. J. Biol. Macromol. 2021 169 85 94 10.1016/j.ijbiomac.2020.12.005 33279563 44. Melro E. Antunes F.E. da Silva G.J. Cruz I. Ramos P.E. Carvalho F. Alves L. Chitosan Films in Food Applications. Tuning Film Properties by Changing Acidic Dissolution Conditions Polymers 2021 13 1 10.3390/polym13010001 PMC7792621 33374920 45. Davoodi S. Davachi S.M. Ghorbani Golkhajeh A. Shekarabi A.S. Abbaspourrad A. Development and characterization of Salvia macrosiphon/Chitosan edible films ACS Sustain. Chem. Eng. 2020 8 1487 1496 10.1021/acssuschemeng.9b05894 46. Yu D. Zhao W. Dong J. Zang J. Regenstein J.M. Jiang Q. Xia W. Multifunctional bioactive coatings based on water-soluble chitosan with pomegranate peel extract for fish flesh preservation Food Chem. 2022 374 131619 10.1016/j.foodchem.2021.131619 34810018 47. Zheng T. Tang P. Yang C. Ran R. Li G. Development of active packaging films based on collagen/gallic acid-grafted chitosan incorporating with ε-polylysine for pork preservation Food Hydrocoll. 2023 140 108590 10.1016/j.foodhyd.2023.108590 48. Othman S.H. Wane B.M. Nordin N. Noor Hasnan N.Z. Talib R.A. Karyadi J.N.W. Physical, Mechanical, and Water Vapor Barrier Properties of Starch/Cellulose Nanofiber/Thymol Bionanocomposite Films Polymer 2021 13 4060 10.3390/polym13234060 34883563 PMC8659141 49. Abral H. Pratama A.B. Handayani D. Mahardika M. Aminah I. Sandrawati N. Sugiarti E. Muslimin A.N. Sapuan S.M. Ilyas R.A. Antimicrobial Edible Film Prepared from Bacterial Cellulose Nanofibers/Starch/Chitosan for a Food Packaging Alternative Int. J. Polym. Sci. 2021 2021 6641284 10.1155/2021/6641284 50. Schirmer M. Höchstötter A. Jekle M. Arendt E. Becker T. Physicochemical and morphological characterization of different starches with variable amylose/amylopectin ratio Food Hydrocoll. 2013 32 52 63 10.1016/j.foodhyd.2012.11.032 51. Cano A. Jiménez A. Cháfer M. Gónzalez C. Chiralt A. Effect of amylose: Amylopectin ratio and rice bran addition on starch films properties Carbohydr. Polym. 2014 111 543 555 10.1016/j.carbpol.2014.04.075 25037386 52. Kumar N. Khan A.A. Pyngrope D. Alanazi A.M. Upadhyay A. Shukla S. Development and characterization of novel starch (mango kernel and litchi seed) based active edible coatings and films using ultrasonication: Effects on postharvest shelf life of Khasi mandarins Sustain. Chem. Pharm. 2024 39 101610 10.1016/j.scp.2024.101610 53. Heinze T. Cellulose: Structure and properties Cellulose Chemistry and Properties: Fibers, Nanocelluloses and Advanced Materials Springer International Publishing Cham, Switzerland 2015 1 52 54. Yildirim-yalcin M. Tornuk F. Toker O.S. Recent advances in the improvement of carboxymethyl cellulose-based edible films Trends Food Sci. Technol. 2022 129 179 193 10.1016/j.tifs.2022.09.022 55. Ghadermazi R. Hamdipour S. Sadeghi K. Ghadermazi R. Khosrowshahi Asl A. Effect of various additives on the properties of the films and coatings derived from hydroxypropyl methylcellulose—A review Food Sci. Nutr. 2019 7 3363 3377 10.1002/fsn3.1206 31762990 PMC6848826 56. Silva P.M. Prieto C. Lagarón J.M. Pastrana L.M. Coimbra M.A. Vicente A.A. Cerqueira M.A. Food-grade hydroxypropyl methylcellulose-based formulations for electrohydrodynamic processing: Part I—Role of solution parameters on fibre and particle production Food Hydrocoll. 2021 118 106761 10.1016/j.foodhyd.2021.106761 57. Iqbal S.Z. Hussain M. Ali H. Haider A. Ali S. Hussain A. Javed M.A. Jawaid M. Preparation and application of hydroxypropyl methylcellulose blended with beeswax and essential oil edible coating to enhance the shelf life of sweet cherries Int. J. Biol. Macromol. 2024 272 132532 10.1016/j.ijbiomac.2024.132532 38806082 58. Mazhari Mousavi S.M. Afra E. Tajvidi M. Bousfield D.W. Dehghani-Firouzabadi M. Cellulose nanofiber/carboxymethyl cellulose blends as an efficient coating to improve the structure and barrier properties of paperboard Cellulose 2017 24 3001 3014 10.1007/s10570-017-1299-5 59. He Y. Li H. Fei X. Peng L. Carboxymethyl cellulose/cellulose nanocrystals immobilized silver nanoparticles as an effective coating to improve barrier and antibacterial properties of paper for food packaging applications Carbohydr. Polym. 2021 252 117156 10.1016/j.carbpol.2020.117156 33183607 60. Wardak M.H. Nkede F.N. Van T.T. Meng F. Tanaka F. Tanaka F. Development of edible films and partial coating, a novel coating technique for tomato fruits, using citric acid-crosslinked starch and cellulose nanofiber Prog. Org. Coat. 2024 187 108127 10.1016/j.porgcoat.2023.108127 61. Mahapatra A. Dhakane-Lad J. Patil S. D’Souza C. Kumar M. Bharimalla A.K. Saxena S. Amelioration of sodium alginate-CNC edible coating with thyme and/or clove essential oil for post-harvest quality of guava J. Food Meas. Charact. 2024 18 5281 5296 10.1007/s11694-024-02565-z 62. Singkhonrat J. Ovatlarnporn C. Khan K.U.R. Basit A. Suksuwan A. Nalinbenjapun S. Sripetthong S. Korma S.A. Cacciotti I. Fabrication of different nanocrystal (CNC)-based coatings for the enhancement of shelf life and quality of minimally processed fruits Cellulose 2023 30 11521 11536 10.1007/s10570-023-05583-0 63. Bigi F. Maurizzi E. Haghighi H. Siesler H.W. Licciardello F. Pulvirenti A. Waste Orange Peels as a Source of Cellulose Nanocrystals and Their Use for the Development of Nanocomposite Films Foods 2023 12 960 10.3390/foods12050960 36900477 PMC10001245 64. Vazquez A. Foresti M.L. Moran J.I. Cyras V.P. Extraction and production of cellulose nanofibers Handbook of Polymer Nanocomposites Processing, Performance and Application: Volume C: Polymer Nanocomposites of Cellulose Nanoparticles Springer Berlin/Heidelberg, Germany 2014 81 118 10.1007/978-3-642-45232-1_57 65. Lupașcu R.E. Ghica M.V. Dinu-Pîrvu C.-E. Popa L. Velescu B.Ș. Arsene A.L. An Overview Regarding Microbial Aspects of Production and Applications of Bacterial Cellulose Materials 2022 15 676 10.3390/ma15020676 35057394 PMC8779708 66. Choi S.M. Rao K.M. Zo S.M. Shin E.J. Han S.S. Bacterial Cellulose and Its Applications Polymers 2022 14 1080 10.3390/polym14061080 35335411 PMC8949969 67. Li N. Zhang R. Yang X. Lin D. Bacterial cellulose nanofibers used as nanofillers improved the fresh—Keeping performance of gelatin—Based edible coating for fresh—Cut apples J. Food Sci. 2023 88 4131 4145 10.1111/1750-3841.16696 37642500 68. Izydorczyk M.S. Biliaderis C.G. Cereal arabinoxylans: Advances in structure and physicochemical properties Carbohydr. Polym. 1995 28 33 48 10.1016/0144-8617(95)00077-1 69. He H.J. Qiao J. Liu Y. Guo Q. Ou X. Wang X. Isolation, structural, functional, and bioactive properties of cereal arabinoxylan—A critical review J. Agric. Food Chem. 2021 69 15437 15457 10.1021/acs.jafc.1c04506 34842436 70. Zannini E. Bravo Núñez Á. Sahin A.W. Arendt E.K. Arabinoxylans as Functional Food Ingredients: A Review Foods 2022 11 1026 10.3390/foods11071026 35407113 PMC8997659 71. Gao X. Pourramezan H. Ramezan Y. Roy S. Zhang W. Assadpour E. Zou J. Jafari S.M. Application of gums as techno-functional hydrocolloids in meat processing and preservation: A review Int. J. Biol. Macromol. 2024 268 131614 10.1016/j.ijbiomac.2024.131614 38631567 72. Eghbaljoo H. Sani I.K. Sani M.A. Rahati S. Mansouri E. Molaee-Aghaee E. Fatourehchi N. Kadi A. Arab A. Sarabandi K. Advances in plant gum polysaccharides; Sources, techno-functional properties, and applications in the food industry-A review Int. J. Biol. Macromol. 2022 222 2327 2340 10.1016/j.ijbiomac.2022.10.020 36209906 73. Pawar S.N. Edgar K.J. Alginate derivatization: A review of chemistry, properties and applications Biomaterials 2012 33 3279 3305 10.1016/j.biomaterials.2012.01.007 22281421 74. Marasinghe W.N. Jayathunge K.G.L.R. Dassanayake R.S. Liyanage R. Bandara P.C. Rajapaksha S.M. Gunathilake C. Structure, Properties, and Recent Developments in Polysaccharide- and Aliphatic Polyester-Based Packaging—A Review J. Compos. Sci. 2024 8 114 10.3390/jcs8030114 75. Das S. Vishakha K. Banerjee S. Mondal S. Ganguli A. Sodium alginate-based edible coating containing nanoemulsion of Citrus sinensis essential oil eradicates planktonic and sessile cells of food-borne pathogens and increased quality attributes of tomatoes Int. J. Biol. Macromol. 2020 162 1770 1779 10.1016/j.ijbiomac.2020.08.086 32810536 76. Tavassoli-Kafrani E. Shekarchizadeh H. Masoudpour-Behabadi M. Development of edible films and coatings from alginates and carrageenans Carbohydr. Polym. 2016 137 360 374 10.1016/j.carbpol.2015.10.074 26686140 77. Li L. Ni R. Shao Y. Mao S. Carrageenan and its applications in drug delivery Carbohydr. Polym. 2014 103 1 11 10.1016/j.carbpol.2013.12.008 24528694 78. Roy S. Chawla R. Santhosh R. Thakur R. Sarkar P. Zhang W. Agar-based edible films and food packaging application: A comprehensive review Trends Food Sci. Technol. 2023 141 104198 10.1016/j.tifs.2023.104198 79. Zhao J. Liu T. Xia K. Liu X. Zhang X. Preparation and application of edible agar-based composite films modified by cellulose nanocrystals Food Packag. Shelf Life 2022 34 100936 10.1016/j.fpsl.2022.100936 80. Moradi Z. Kalanpour N. Kefiran, a branched polysaccharide: Preparation, properties and applications: A review Carbohydr. Polym. 2019 223 115100 10.1016/j.carbpol.2019.115100 31426955 81. Ghasemlou M. Khodaiyan F. Oromiehie A. Physical, mechanical, barrier, and thermal properties of polyol-plasticized biodegradable edible film made from kefiran Carbohydr. Polym. 2011 84 477 483 10.1016/j.carbpol.2010.12.010 82. Motedayen A.A. Khodaiyan F. Salehi E.A. Development and characterisation of composite films made of kefiran and starch Food Chem. 2013 136 1231 1238 10.1016/j.foodchem.2012.08.073 23194518 83. Hasheminya S.M. Dehghannya J. Development and characterization of kefiran-gelatin bio-nanocomposites containing Zhumeria majdae essential oil nanoemulsion to use as active food packaging in sponge cakes Int. J. Biol. Macromol. 2024 279 135120 10.1016/j.ijbiomac.2024.135120 39208884 84. Öner E.T. Hernández L. Combie J. Review of Levan polysaccharide: From a century of past experiences to future prospects Biotechnol. Adv. 2016 34 827 844 10.1016/j.biotechadv.2016.05.002 27178733 85. Wang Y. Zhou Z. Han Y. Levan-chitosan blend films: Preparation, structural, physical properties and application in pork packaging Int. J. Biol. Macromol. 2022 217 624 632 10.1016/j.ijbiomac.2022.07.049 35835307 86. Gan L. Jiang G. Yang Y. Zheng B. Zhang S. Li X. Tian Y. Peng B. Development and characterization of levan/pullulan/chitosan edible films enriched with ε-polylysine for active food packaging Food Chem. 2022 388 132989 10.1016/j.foodchem.2022.132989 35447595 87. Ghosh T. Priyadarshi R. de Souza C.K. Angioletti B.L. Rhim J.W. Advances in pullulan utilization for sustainable applications in food packaging and preservation: A mini-review Trends Food Sci. Technol. 2022 125 43 53 10.1016/j.tifs.2022.05.001 88. Dewan M.F. Islam M.N. Pullulan—Based Films: Unveiling Its Multifaceted Versatility for Sustainability Adv. Polym. Technol. 2024 2024 2633384 10.1155/2024/2633384 89. An Z. Yuan M. Xu X. Huang Z. Zhu L. Cai Z. Shen Y. Active pullulan-based coatings incorporated with Auricularia auricular extracts for preserving potato fresh-cuts Food Sci. Biotechnol. 2024 33 1147 1161 10.1007/s10068-023-01420-z 38440674 PMC10908726 90. Vaishnav A. Choudhary D.K. Microbial Polymers: Applications and Ecological Perspectives 1st ed. Springer Nature Berlin/Heidelberg, Germany 2021 10.1007/978-981-16-0045-6 91. Debnath A. Das B. Devi M.S. Ram R.M. Fungal exopolysaccharides: Types, production and application Microbial Polymers: Applications and Ecological Perspectives Springer Singapore 2021 45 68 10.1007/978-981-16-0045-6_2 92. Morales D. Rutckeviski R. Villalva M. Abreu H. Soler-Rivas C. Santoyo S. Iacomini M. Smiderle F.R. Isolation and comparison of α-and β-D-glucans from shiitake mushrooms ( Lentinula edodes Carbohydr. Polym. 2020 229 115521 10.1016/j.carbpol.2019.115521 31826486 93. Pu W. Shen C. Wei B. Yang Y. Li Y. A comprehensive review of polysaccharide biopolymers for enhanced oil recovery (EOR) from flask to field J. Ind. Eng. Chem. 2018 61 1 11 10.1016/j.jiec.2017.12.034 94. Fariña J.I. Sineriz F. Molina O.E. Perotti N.I. Isolation and physicochemical characterization of soluble scleroglucan from Sclerotium rolfsii. Rheological properties, molecular weight and conformational characteristics Carbohydr. Polym. 2001 44 41 50 10.1016/S0144-8617(00)00189-2 95. Deng Y. Huang Q. Hu L. Liu T. Zheng B. Lu D. Zhou L. Enhanced exopolysaccharide yield and antioxidant activities of Schizophyllum commune fermented products by the addition of Radix Puerariae RSC Adv. 2021 11 38219 38234 10.1039/D1RA06314F 35498081 PMC9044015 96. Hamedi S. Shojaosadati S.A. Preparation of antibacterial ZnO NP-containing schizophyllan/bacterial cellulose nanocomposite for wound dressing Cellulose 2021 28 9269 9282 10.1007/s10570-021-04119-8 97. Rahman H.U.U. Asghar W. Khalid N. Scleroglucan and Schizophyllan Polysaccharides of Microbial Origin Oliveira J.M. Radhouani H. Reis R.L. Springer Cham, Switzerland 2022 10.1007/978-3-030-42215-8_16 98. Mirończuk-Chodakowska I. Kujawowicz K. Witkowska A.M. Beta-Glucans from Fungi: Biological and Health-Promoting Potential in the COVID-19 Pandemic Era Nutrients 2021 13 3960 10.3390/nu13113960 34836215 PMC8623785 99. Lu X. Wang C. Li Y. Liu P. Improved production and antioxidant activity of exopolysaccharides by submerged culture of Lentinula edodes by the addition of lignocellulose J. Biosci. Bioeng. 2022 134 162 166 10.1016/j.jbiosc.2022.05.003 35649960 100. Cui H. Xu R. Hu W. Li C. Abdel-Samie M.A. Lin L. Effect of soy protein isolate nanoparticles loaded with litsea cubeba essential oil on performance of lentinan edible films Int. J. Biol. Macromol. 2023 242 124686 10.1016/j.ijbiomac.2023.124686 37146850 101. Aayush K. Sharma K. Singh G.P. Chiu I. Chavan P. Shandilya M. Roy S. Ye H. Sharma S. Yang T. Development and characterization of edible and active coating based on xanthan gum nanoemulsion incorporating betel leaf extract for fresh produce preservation Int. J. Biol. Macromol. 2024 270 132220 10.1016/j.ijbiomac.2024.132220 38754654 102. Nagar C.K. Dash S.K. Rayaguru K. Tamarind seed: Composition, applications, and value addition: A comprehensive review J. Food Process. Preserv. 2022 46 e16872 10.1111/jfpp.16872 103. Kochumalayil J. Sehaqui H. Zhou Q. Berglund L.A. Tamarind seed xyloglucan–a thermostable high-performance biopolymer from non-food feedstock J. Mater. Chem. 2010 20 4321 4327 10.1039/c0jm00367k 104. Raj V. Lee S. State-of-the-art progress on tamarind seed polysaccharide ( Tamarindus indica Carbohydr. Polym. 2024 331 121847 10.1016/j.carbpol.2024.121847 38388032 105. Wang C. Cai W.D. Yao H. Wu L.X. Li L. Zhun J. Yan J.K. Conjugation of ferulic acid onto pectin affected the physicochemical, functional and antioxidant properties J. Sci. Food Agric. 2020 100 5352 5362 10.1002/jsfa.10583 32542712 106. Ramachandra Rao Sonale S. Pothuvan Kunnummal S. Sori N. Reddy J.P. Khan M. Low methoxy feruloylated pectin from beetroot: Antioxidant and prebiotic properties J. Food Process. Preserv. 2022 46 e17240 10.1111/jfpp.17240 107. Nastasi J.R. Kontogiorgos V. Daygon V.D. Fitzgerald M.A. Pectin-based films and coatings with plant extracts as natural preservatives: A systematic review Trends Food Sci. Technol. 2022 120 193 211 10.1016/j.tifs.2022.01.014 108. Jaderi Z. Tabatabaee Yazdi F. Mortazavi S.A. Koocheki A. Effects of glycerol and sorbitol on a novel biodegradable edible film based on Malva sylvestris Food Sci. Nutr. 2023 11 991 1000 10.1002/fsn3.3134 36789080 PMC9922115 109. Vieira T.M. Moldão-Martins M. Alves V.D. Design of Chitosan and Alginate Emulsion-Based Formulations for the Production of Monolayer Crosslinked Edible Films and Coatings Foods 2021 10 1654 10.3390/foods10071654 34359524 PMC8307622 110. Zhou H. Yang N. Hou J. Yu C. Jin Z. Zeng P. Yang L. Fu Y. Shen Y. Guo S. Effects of CaCl 2 Food Packag. Shelf Life 2022 34 100935 10.1016/j.fpsl.2022.100935 111. Xu J. Xia R. Zheng L. Yuan T. Sun R. Plasticized hemicelluloses/chitosan-based edible films reinforced by cellulose nanofiber with enhanced mechanical properties Carbohydr. Polym. 2019 224 115164 10.1016/j.carbpol.2019.115164 31472866 112. Zhang M. Huang C. Xie J. Shao Z. Li X. Bian X. Xue B. Gan J. Sun T. Physical, Mechanical and Biological Properties of Phenolic Acid-Grafted Soluble Soybean Polysaccharide Films Foods 2022 11 3747 10.3390/foods11223747 36429339 PMC9689774 113. Zhang Y. Song W. Mao S. Qian Y. Gui Q. Du J. An Antibacterial and Antioxidant Food Packaging Film Based on Amphiphilic Polypeptides-Resveratrol-Chitosan Small 2024 21 e2408767 10.1002/smll.202408767 39670689 114. Khalil R.K.S. Sharaby M.R. Abdelrahim D.S. Novel active edible food packaging films based entirely on citrus peel wastes Food Hydrocoll. 2023 134 107961 10.1016/j.foodhyd.2022.107961 115. Naqash F. Masoodi F.A. Ayob O. Parvez S. Effect of active pectin edible coatings on the safety and quality of fresh-cut apple Int. J. Food Sci. Technol. 2022 57 57 66 10.1111/ijfs.15059 116. Prakash A. Baskaran R. Vadivel V. Citral nanoemulsion incorporated edible coating to extend the shelf life of fresh cut pineapples LWT 2020 118 108851 10.1016/j.lwt.2019.108851 117. Oliveira C.D.M. Gomes B.D.O. Batista A.F.P. Mikcha J.M.G. Yamashita F. Scapim M.R.S. Bergamasco R.C. Development of sorbic acid microcapsules and application in starch-poly (butylene adipate co-terephthalate) films Food Process. Preserv. 2021 45 e15459 10.1111/jfpp.15459 118. Cheng Y. Gao S. Wang W. Hou H. Lim L.T. Low temperature extrusion blown ε-polylysine hydrochloride-loaded starch/gelatin edible antimicrobial films Carbohydr. Polym. 2022 278 118990 10.1016/j.carbpol.2021.118990 34973793 119. Huntrakul K. Yoksan R. Sane A. Harnkarnsujarit N. Effects of pea protein on properties of cassava starch edible films produced by blown-film extrusion for oil packaging Food Packag. Shelf Life 2020 24 100480 10.1016/j.fpsl.2020.100480 120. Plasencia L. Arrieta M.P. Lazaro-Hdez C. Gomez-Caturla J. Quiles-Carrillo L. Innovative development and characterization of thermoplastic zein-based biopolymers for food packaging via injection molding Food Hydrocoll. 2025 163 111134 10.1016/j.foodhyd.2025.111134 121. Fang H. Zhou Q. Yang Q. Zhou X. Cheng S. Wei B. Li J. Ji S. Influence of Combined Edible Coating with Chitosan and Tea Polyphenol on the Quality Deterioration and Health-promoting Compounds in Harvested Broccoli Food Bioprocess Technol. 2022 15 407 420 10.1007/s11947-021-02751-7 122. Yang C. Lee F.W. Cheng Y.J. Chu Y.Y. Chen C.N. Kuan Y.C. Chitosan coating formulated with citric acid and pomelo extract retards pericarp browning and fungal decay to extend shelf life of cold-stored lychee Sci. Hortic. 2023 310 111735 10.1016/j.scienta.2022.111735 123. Kumar N. Neeraj Pratibha Trajkovska Petkoska A. Improved Shelf Life and Quality of Tomato ( Solanum lycopersicum ACS Food Sci. Technol. 2021 1 500 510 10.1021/acsfoodscitech.0c00076 124. Whitehead F.A. Paramita V.D. Teimouri S. Young S. Kasapis S. Controlled release of ascorbic acid from genipin-crosslinked gelatin matrices under moving boundary conditions Food Hydrocoll. 2019 89 171 179 10.1016/j.foodhyd.2018.10.026 125. Oliveira M.A. Gonzaga M.L. Bastos M.S. Magalhães H.C. Benevides S.D. Furtado R.F. Zambelli R.A. Garruti D.S. Packaging with cashew gum/gelatin/essential oil for bread: Release potential of the citral Food Packag. Shelf Life 2020 23 100431 10.1016/j.fpsl.2019.100431 126. Chen N. Gao H.X. He Q. Yu Z.L. Zeng W.C. Influence of structure complexity of phenolic compounds on their binding with maize starch Food Struct. 2022 33 100286 10.1016/j.foostr.2022.100286 127. Hasan S.M.K. Ferrentino G. Scampicchio M. Nanoemulsion as advanced edible coatings to preserve the quality of fresh-cut fruits and vegetables: A review Int. J. Food Sci. Technol. 2020 55 1 10 10.1111/ijfs.14273 128. Palla C.A. Aguilera-Garrido A. Carrín M.E. Galisteo-González F. Gálvez-Ruiz M.J. Preparation of highly stable oleogel-based nanoemulsions for encapsulation and controlled release of curcumin Food Chem. 2022 378 132132 10.1016/j.foodchem.2022.132132 35045370 129. Xiong Y. Li S. Warner R.D. Fang Z. Effect of oregano essential oil and resveratrol nanoemulsion loaded pectin edible coating on the preservation of pork loin in modified atmosphere packaging Food Control 2020 114 107226 10.1016/j.foodcont.2020.107226 130. Sneha K. Kumar A. Nanoemulsions: Techniques for the preparation and the recent advances in their food applications Innov. Food Sci. Emerg. Technol. 2022 76 102914 10.1016/j.ifset.2021.102914 131. Espitia P.J.P. Fuenmayor C.A. Otoni C.G. Nanoemulsions: Synthesis, Characterization, and Application in Bio-Based Active Food Packaging Compr. Rev. Food Sci. Food Saf. 2019 18 264 285 10.1111/1541-4337.12405 33337016 132. Silva P.M. Prieto C. Andrade C.C.P. Lagarón J.M. Pastrana L.M. Coimbra M.A. Vicente A.A. Cerqueira M.A. Hydroxypropyl methylcellulose-based micro- and nanostructures for encapsulation of melanoidins: Effect of electrohydrodynamic processing variables on morphological and physicochemical properties Int. J. Biol. Macromol. 2022 203 453 467 10.1016/j.ijbiomac.2022.01.019 35031317 133. Silva P.M. Torres-Giner S. Vicente A.A. Cerqueira M.A. Electrohydrodynamic processing for the production of zein-based microstructures and nanostructures Curr. Opin. Colloid Interface Sci. 2021 56 101504 10.1016/j.cocis.2021.101504 134. Tang Y. Zhou Y. Lan X. Huang D. Luo T. Ji J. Mafang Z. Miao X. Wang H. Wang W. Electrospun Gelatin Nanofibers Encapsulated with Peppermint and Chamomile Essential Oils as Potential Edible Packaging J. Agric. Food Chem. 2019 67 2227 2234 10.1021/acs.jafc.8b06226 30715872 135. Moreno M.A. Orqueda M.E. Gómez-Mascaraque L.G. Isla M.I. López-Rubio A. Crosslinked electrospun zein-based food packaging coatings containing bioactive chilto fruit extracts Food Hydrocoll. 2019 95 496 505 10.1016/j.foodhyd.2019.05.001 136. Rathore P. Schiffman J.D. Beyond the Single-Nozzle: Coaxial Electrospinning Enables Innovative Nanofiber Chemistries, Geometries, and Applications ACS Appl. Mater. Interfaces 2020 13 48 66 10.1021/acsami.0c17706 33356093 137. Rossi-Márquez G. Dávalos-Saucedo C.A. Mayek-Pérez N. Di Pierro P. Multilayered Edible Coatings to Enhance Some Quality Attributes of Ready-to-Eat Cherimoya ( Annona cherimola Coatings 2023 13 41 10.3390/coatings13010041 138. Figueroa-Lopez K.J. Torres-Giner S. Angulo I. Pardo-Figuerez M. Escuin J.M. Bourbon A.I. Cabedo L. Nevo Y. Cerqueira M.A. Lagaron J.M. Development of Active Barrier Multilayer Films Based on Electrospun Antimicrobial Hot-Tack Food Waste Derived Poly(3-hydroxybutyrate-co-3-hydroxyvalerate) and Cellulose Nanocrystal Interlayers Nanomaterials 2020 10 2356 10.3390/nano10122356 33260904 PMC7761208 139. Vitiello A. Catanzano O. Guida M. Scognamiglio A. Gallo A. Costabile G. Ungaro F. Miro A. Quaglia F. Harnessing HP-β-CD in zein edible coatings for enhanced sensitive fruits preservation Carbohydr. Polym. 2025 367 123969 10.1016/j.carbpol.2025.123969 40817479 140. Oyom W. Xu H. Liu Z. Long H. Li Y. Zhang Z. Bi Y. Tahergorabi R. Prusky D. Effects of modified sweet potato starch edible coating incorporated with cumin essential oil on storage quality of ‘early crisp’ LWT 2022 53 112475 10.1016/j.lwt.2021.112475 141. Soto-Muñoz L. Martínez-Blay V. Pérez-Gago M.B. Fernández-Catalán A. Argente-Sanchis M. Palou L. Starch—Based antifungal edible coatings to control sour rot caused by Geotrichum citri—Aurantii and maintain postharvest quality of ‘Fino’ lemon J. Sci. Food Agric. 2022 102 794 800 10.1002/jsfa.11414 34223648 142. Gupta V. Thakur R. Barik M. Das A.B. Effect of high amylose starch-natural deep eutectic solvent based edible coating on quality parameters of strawberry during storage J. Agric. Food Res. 2023 11 100487 10.1016/j.jafr.2022.100487 143. Ballesteros L.F. Teixeira J.A. Cerqueira M.A. Active Carboxymethyl Cellulose-Based Edible Coatings for the Extension of Fresh Goldenberries Shelf-Life Horticulturae 2022 8 936 10.3390/horticulturae8100936 144. Zhong Y. Cavender G. Zhao Y. Investigation of different coating application methods on the performance of edible coatings on Mozzarella cheese LWT-Food Sci. Technol. 2014 56 1 8 10.1016/j.lwt.2013.11.006 145. Shiekh K.A. Ngiwngam K. Tongdeesoontorn W. Polysaccharide-Based Active Coatings Incorporated with Bioactive Compounds for Reducing Postharvest Losses of Fresh Fruits Coatings 2022 12 8 10.3390/coatings12010008 146. López-Córdoba A. Feasibility of Using Carvacrol/Starch Edible Coatings to Improve the Quality of Paipa Cheese Polymers 2021 13 2516 10.3390/polym13152516 34372119 PMC8347108 147. Rajaei Lak H. Bazargani-Gilani B. Karami M. Different coating application methods: Zein—Based edible coating containing Heracleum persicum essential oil for Shelf—Life enhancement of Whey—Less cheese Food Sci. Nutr. 2024 12 5990 6010 10.1002/fsn3.4269 39139960 PMC11317755 148. Saleena P. Jayashree E. Anees K. A comprehensive review on vacuum impregnation: Mechanism, applications and prospects Food Bioprocess Technol. 2024 17 1434 1447 10.1007/s11947-023-03185-z 149. Panayampadan A.S. Alam M.S. Aslam R. Kaur J. Vacuum impregnation process and its potential in modifying sensory, physicochemical and nutritive characteristics of food products Food Eng. Rev. 2022 14 229 256 10.1007/s12393-022-09312-4 150. Hernández S. Gallego M. Verdú S. Barat J.M. Talens P. Grau R. Physicochemical characterization of texture-modified pumpkin by vacuum enzyme impregnation: Textural, chemical, and image analysis Food Bioprocess Technol. 2023 16 122 134 10.1007/s11947-022-02925-x 151. Barrera C. Betoret N. Seguí L. Potential of vacuum impregnation and osmotic dehydration techniques in producing jaggery-fortified apple snacks Sustain. Food Technol. 2024 2 1041 1051 10.1039/D3FB00255A 152. Senturk Parreidt T. Schmid M. Müller K. Effect of dipping and vacuum impregnation coating techniques with alginate based coating on physical quality parameters of cantaloupe melon J. Food Sci. 2018 83 929 936 10.1111/1750-3841.14091 29524227 153. Aebi M. Chocolate panning Industrial Chocolate Manufacture and Use Wiley Online Library Hoboken, NJ, USA 2009 285 301 10.1002/9781118923597.ch16 154. Lee S.Y. Dangaran K.L. Krochta J.M. Gloss stability of Whey—Protein/plasticizer coating formulations on chocolate surface J. Food Sci. 2002 67 1121 1125 10.1111/j.1365-2621.2002.tb09463.x 155. Lee S.Y. Trezza T.A. Guinard J.X. Krochta J.M. Whey—Protein—Coated peanuts assessed by sensory evaluation and static headspace gas chromatography J. Food Sci. 2002 67 1212 1218 10.1111/j.1365-2621.2002.tb09479.x 156. Ertural G.I. Gunes R. Toker O.S. Palabiyik I. Konar N. Sagdic O. Importance of rheological properties in enrobing efficiency of dark chocolate: Application in wafer products Int. J. Food Sci. Technol. 2023 58 5938 5946 10.1111/ijfs.16698 157. Lipin A.A. Lipin A.G. Prediction of coating uniformity in batch fluidized-bed coating process Particuology 2022 61 41 46 10.1016/j.partic.2021.03.010 158. Lin S.Y. Krochta J.M. Fluidized—Bed system for whey protein film coating of peanuts J. Food Process Eng. 2006 29 532 546 10.1111/j.1745-4530.2006.00081.x 159. Benelli L. Oliveira W.P. Fluidized bed coating of inert cores with a lipid-based system loaded with a polyphenol-rich Rosmarinus officinalis extract Food Bioprod. Process. 2019 114 216 226 10.1016/j.fbp.2019.01.004 160. Coronel-Aguilera C.P. San Martín-González M.F. Encapsulation of spray dried β-carotene emulsion by fluidized bed coating technology LWT-Food Sci. Technol. 2015 62 187 193 10.1016/j.lwt.2014.12.036 161. Pankaj S.K. Bueno-Ferrer C. Misra N.N. Milosavljević V. O’donnell C.P. Bourke P. Keener K.M. Cullen P.J. Applications of cold plasma technology in food packaging Trends Food Sci. Technol. 2014 35 5 17 10.1016/j.tifs.2013.10.009 162. Sani I.K. Aminoleslami L. Mirtalebi S.S. Sani M.A. Mansouri E. Eghbaljoo H. Jalil A.T. Thanoon R.D. Khodei S.M. Mohammadi F. Cold plasma technology: Applications in improving edible films and food packaging Food Packag. Shelf Life 2023 37 101087 10.1016/j.fpsl.2023.101087 163. Akhavan-Mahdavi S. Mirzazadeh M. Alam Z. Solaimanimehr S. The effect of chitosan coating combined with cold plasma on the quality and safety of pistachio during storage Food Sci. Nutr. 2023 11 4296 4307 10.1002/fsn3.3355 37457141 PMC10345737 164. Tatar Turan F. Kahyaoglu T. The effect of an ultrasonic spray nozzle on carbohydrate and protein-based coating materials for blueberry extract microencapsulation J. Sci. Food Agric. 2021 101 120 130 10.1002/jsfa.10622 32613628 165. Abbas M. Buntinx M. Deferme W. Reddy N. Peeters R. Oxygen Gas and UV Barrier Properties of Nano-ZnO-Coated PET and PHBHHx Materials Fabricated by Ultrasonic Spray-Coating Technique Nanomaterials 2021 11 449 10.3390/nano11020449 33578826 PMC7916571 166. Kustron P. Korzeniowski M. Sajbura A. Piwowarczyk T. Kaczynski P. Sokolowski P. Development of High-Power Ultrasonic System Dedicated to Metal Powder Atomization Appl. Sci. 2023 13 8984 10.3390/app13158984 167. Bose S. Keller S.S. Alstrøm T.S. Boisen A. Almdal K. Process optimization of ultrasonic spray coating of polymer films Langmuir 2013 29 6911 6919 10.1021/la4010246 23631433 168. Khaire R.A. Gogate P.R. Novel approaches based on ultrasound for spray drying of food and bioactive compounds Dry. Technol. 2021 39 1832 1853 10.1080/07373937.2020.1804926 169. Zhao X. Wu J. Chen L. Yang H. Effect of vacuum impregnated fish gelatin and grape seed extract on metabolite profiles of tilapia ( Oreochromis niloticus Food Chem. 2019 293 418 428 10.1016/j.foodchem.2019.05.001 31151630 170. Xia C. Wang W. Wang L. Liu H. Xiao J. Multilayer zein/gelatin films with tunable water barrier property and prolonged antioxidant activity Food Packag. Shelf Life 2019 19 76 85 10.1016/j.fpsl.2018.12.004 171. Kanatt S.R. Irradiation as a tool for modifying tapioca starch and development of an active food packaging film with irradiated starch Radiat. Phys. Chem. 2020 173 108873 10.1016/j.radphyschem.2020.108873 172. Gallego M. Arnal M. Talens P. Toldrá F. Mora L. Effect of Gelatin Coating Enriched with Antioxidant Tomato By-Products on the Quality of Pork Meat Polymers 2020 12 1032 10.3390/polym12051032 32370120 PMC7284921 173. Wu J. Song G. Huang R. Yan Y. Li Q. Guo X. Shi X. Tian Y. Wang J. Wang S. Fish gelatin films incorporated with cinnamaldehyde and its sulfobutyl ether-β-cyclodextrin inclusion complex and their application in fish preservation Food Chem. 2023 418 135871 10.1016/j.foodchem.2023.135871 36958184 174. Liu J. Li K. Chen Y. Ding H. Wu H. Gao Y. Huang S. Wu H. Kong D. Yang Z. Active and smart biomass film containing cinnamon oil and curcumin for meat preservation and freshness indicator Food Hydrocoll. 2022 133 107979 10.1016/j.foodhyd.2022.107979 175. Azizah F. Nursakti H. Ningrum A. Supriyadi Development of Edible Composite Film from Fish Gelatin–Pectin Incorporated with Lemongrass Essential Oil and Its Application in Chicken Meat Polymers 2023 15 2075 10.3390/polym15092075 37177220 PMC10180965 176. Agudelo-Cuartas C. Granda-Restrepo D. Sobral P.J. Hernandez H. Castro W. Characterization of whey protein-based films incorporated with natamycin and nanoemulsion of α-tocopherol Heliyon 2020 6 e03809 10.1016/j.heliyon.2020.e03809 32382679 PMC7199006 177. Dai X. Dong F. Dong Z. Bai Z. Mao L. Enhanced antibacterial and antioxidant activities of chlorogenic acid loaded sweet whey/starch active films for edible food packaging LWT 2024 199 116118 10.1016/j.lwt.2024.116118 178. García-Anaya M.C. Sepulveda D.R. Rios-Velasco C. Acosta-Muñiz C.H. Incorporation of A511 bacteriophage in a whey protein isolate-based edible coating for the control of Listeria monocytogenes in Cheese Food Packag. Shelf Life 2023 37 101095 10.1016/j.fpsl.2023.101095 179. Izadi H. Zandi M. Rafeiee G. Bimakr M. Tomato seed mucilage-whey protein isolate coating enriched with shallot essential oil: Effect on quality changes of the trout fish fillet during cold storage Biocatal. Agric. Biotechnol. 2024 58 103149 10.1016/j.bcab.2024.103149 180. Elahi R. Jamshidi A. Fallah A.A. Effect of active composite coating based on nanochitosan-whey protein isolate on the microbial safety of chilled rainbow trout fillets packed with oxygen absorber Int. J. Biol. Macromol. 2024 277 133756 10.1016/j.ijbiomac.2024.133756 38986977 181. Vasiliauskaite A. Mileriene J. Songisepp E. Rud I. Muizniece-Brasava S. Ciprovica I. Axelsson L. Lutter L. Aleksandrovas E. Tammsaar E. Application of Edible Coating Based on Liquid Acid Whey Protein Concentrate with Indigenous Lactobacillus helveticus for Acid-Curd Cheese Quality Improvement Foods 2022 11 3353 10.3390/foods11213353 36359966 PMC9659032 182. Xin Y. Yang C. Zhang J. Xiong L. Application of Whey Protein-Based Emulsion Coating Treatment in Fresh-Cut Apple Preservation Foods 2023 12 1140 10.3390/foods12061140 36981067 PMC10048030 183. Robalo J. Lopes M. Cardoso O. Sanches Silva A. Ramos F. Efficacy of Whey Protein Film Incorporated with Portuguese Green Tea ( Camellia sinensis Foods 2022 11 1158 10.3390/foods11081158 35454745 PMC9032714 184. Sogut E. Active whey protein isolate films including bergamot oil emulsion stabilized by nanocellulose Food Packag. Shelf Life 2020 23 100430 10.1016/j.fpsl.2019.100430 185. Li T. Shen Y. Chen H. Xu Y. Wang D. Cui F. Han Y. Li J. Antibacterial Properties of Coaxial Spinning Membrane of Methyl ferulate/zein and Its Preservation Effect on Sea Bass Foods 2021 10 2385 10.3390/foods10102385 34681434 PMC8535954 186. Sun R. Li L. Zhou J. Zhang Y. Sun H. Zhang D. Wu Q. Development of Zein–PEG400/PVA–Chitosan Bilayer Films for Intelligent Packaging Polymers 2025 17 387 10.3390/polym17030387 39940589 PMC11820536 187. Rahnama M. Anvar S.A. Ahari H. Kazempoor R. Antibacterial effects of extracted corn zein with garlic Extract—Based nanoemulsion on the shelf life of Vannamei prawn ( Litopenaeus vannamei J. Food Sci. 2021 86 4969 4990 10.1111/1750-3841.15923 34622450 188. Pavlátková L. Sedlaříková J. Pleva P. Peer P. Uysal-Unalan I. Janalíková M. Bioactive zein/chitosan systems loaded with essential oils for Food—Packaging applications J. Sci. Food Agric. 2023 103 1097 1104 10.1002/jsfa.11978 35522046 189. Mendes-Oliveira G. Gu G. Luo Y. Zografos A. Minas I. Nou X. Edible and water-soluble corn zein coating impregnated with nisin for Listeria monocytogenes reduction on nectarines and apples Postharvest Biol. Technol. 2022 185 111811 10.1016/j.postharvbio.2021.111811 190. Zolfaghari A. Bazargani-Gilani B. Aghajani N. Edible film based on corn zein containing dill extract and essential oil/β—Cyclodextrin inclusion complex: Shelf life enhancement of common carp fillet Food Sci. Nutr. 2023 11 4275 4288 10.1002/fsn3.3353 37457154 PMC10345680 191. Tyagi V. Wang Y. Bhattacharya B. Development of ionic liquid plasticized High—Tensile Starch—Protein—Sorghum bran composite films with antimicrobial activity J. Appl. Polym. Sci. 2022 139 e52442 10.1002/app.52442 192. Bharathi S.K.V. Leena M.M. Moses J.A. Anandharamakrishnan C. Nanofibre-based bilayer biopolymer films: Enhancement of antioxidant activity and potential for food packaging application Int. J. Food Sci. Technol. 2020 55 1477 1484 10.1111/ijfs.14492 193. Ansarifar E. Moradinezhad F. Preservation of strawberry fruit quality via the use of active packaging with encapsulated thyme essential oil in zein nanofiber film Int. J. Food Sci. Technol. 2021 56 4239 4247 10.1111/ijfs.15130 194. Wei Y. Guo A. Liu Z. Mao L. Yuan F. Gao Y. Mackie A. Structural design of zein-cellulose nanocrystals core–shell microparticles for delivery of curcumin Food Chem. 2021 357 129849 10.1016/j.foodchem.2021.129849 33915467 195. Cheng K. Du J. Xu F. Wang Z. Zhang L. Bai M. Wang X. Liu J. Preparation and characterization of zein-based active packaging films integrated with TiO 2 Food Packag. Shelf Life 2024 45 101348 10.1016/j.fpsl.2024.101348 196. Ren M. Cai Z. Chen L. Wahia H. Zhang L. Wang Y. Yu X. Zhou C. Preparation of zein/chitosan/eugenol/curcumin active films for blueberry preservation Int. J. Biol. Macromol. 2022 223 1054 1066 10.1016/j.ijbiomac.2022.11.090 36395925 197. Wang K. Li W. Wu L. Li Y. Li H. Preparation and characterization of chitosan/dialdehyde carboxymethyl cellulose composite film loaded with cinnamaldehyde@ zein nanoparticles for active food packaging Int. J. Biol. Macromol. 2024 261 129586 10.1016/j.ijbiomac.2024.129586 38266856 198. Belyamani I. Prochazka F. Assezat G. Production and characterization of sodium caseinate edible films made by blown-film extrusion J. Food Eng. 2014 121 39 47 10.1016/j.jfoodeng.2013.08.019 199. Perez V. Felix M. Romero A. Guerrero A. Characterization of pea protein-based bioplastics processed by injection moulding Food Bioprod. Process. 2016 97 100 108 10.1016/j.fbp.2015.12.004 200. Xavier K.M. Kannuchamy N. Balange A.K. Chouksey M.K. Gudipati V. Functionality of chitosan in batter formulations for coating of fish sticks: Effect on physicochemical quality Carbohydr. Polym. 2017 169 433 440 10.1016/j.carbpol.2017.04.041 28504166 201. Liu X. Zhang C. Liu S. Gao J. Cui S.W. Xia W. Coating white shrimp ( Litopenaeus vannamei Int. J. Biol. Macromol. 2020 162 1276 1282 10.1016/j.ijbiomac.2020.06.248 32610051 202. Cao W. Yan J. Liu C. Zhang J. Wang H. Gao X. Yan H. Niu B. Li W. Preparation and characterization of catechol-grafted chitosan/gelatin/modified chitosan-AgNP blend films Carbohydr. Polym. 2020 247 116643 10.1016/j.carbpol.2020.116643 32829790 203. Yadav S. Mehrotra G.K. Dutta P.K. Chitosan based ZnO nanoparticles loaded gallic-acid films for active food packaging Food Chem. 2021 334 127605 10.1016/j.foodchem.2020.127605 32738726 204. Merino D. Bellassi P. Paul U.C. Morelli L. Athanassiou A. Assessment of chitosan/pectin-rich vegetable waste composites for the active packaging of dry foods Food Hydrocoll. 2023 139 108580 10.1016/j.foodhyd.2023.108580 205. Wang F. Xie C. Ye R. Tang H. Jiang L. Liu Y. Development of active packaging with chitosan, guar gum and watermelon rind extract: Characterization, application and performance improvement mechanism Int. J. Biol. Macromol. 2023 227 711 725 10.1016/j.ijbiomac.2022.12.210 36565825 206. Wang F. Xie C. Tang H. Hao W. Wu J. Sun Y. Sun J. Liu Y. Jiang L. Development, characterization and application of intelligent/active packaging of chitosan/chitin nanofibers films containing eggplant anthocyanins Food Hydrocoll. 2023 139 108496 10.1016/j.foodhyd.2023.108496 207. Bi F. Qin Y. Chen D. Kan J. Liu J. Development of active packaging films based on chitosan and nano-encapsulated luteolin Int. J. Biol. Macromol. 2021 182 545 553 10.1016/j.ijbiomac.2021.04.063 33857507 208. Soares A.D.S. Ramos A.M. Vieira É.N.R. Vanzela E.S.L. de Oliveira P.M. Paula D.D.A. Vacuum impregnation of chitosan-based edible coating in minimally processed pumpkin Int. J. Food Sci. Technol. 2018 53 2229 2238 10.1111/ijfs.13811 209. Farasati Far B. Jahanbakhshi M. Jameie L. Zolfigol F. Taromi P. Ertas Y.N. Chitosan-graft-pomegranate extract hydrogel: A dual-functional pad for antibacterial and antioxidant enhancement for shelf life extension in food packaging ACS Appl. Polym. Mater. 2024 6 9545 9558 10.1021/acsapm.4c01240 210. Silva O.A. Pellá M.C.G. Friedrich J.C. Pellá M.G. Beneton A.G. Faria M.G. Colauto G.A.L. Caetano J. Simões M.R. Dragunski D.C. Effects of a native cassava starch, chitosan, and gelatin-based edible coating over guavas ( Psidium guajava ACS Food Sci. Technol. 2021 1 1247 1253 10.1021/acsfoodscitech.1c00131 211. Bodana V. Swer T.L. Kumar N. Singh A. Samtiya M. Sari T.P. Babar O.A. Development and characterization of pomegranate peel extract-functionalized jackfruit seed starch-based edible films and coatings for prolonging the shelf life of white grapes Int. J. Biol. Macromol. 2024 254 127234 10.1016/j.ijbiomac.2023.127234 37797851 212. Bansal H. Singh H.P. Singh S. Sharma A. Singh J. Kaur K. Mehta S.K. Preserving plum perfection: Buckwheat starch edible coating with xanthan gum and lemongrass essential oil Int. J. Biol. Macromol. 2024 274 133239 10.1016/j.ijbiomac.2024.133239 38897516 213. Remya S. Sivaraman G.K. Joseph T.C. Parmar E. Sreelakshmi K.R. Mohan C.O. Ravishankar C.N. Influence of corn starch based bio-active edible coating containing fumaric acid on the lipid quality and microbial shelf life of silver pomfret fish steaks stored at 4 °C J. Food Sci. Technol. 2022 59 3387 3398 10.1007/s13197-021-05322-y 35875210 PMC9304496 214. Ezati P. Rhim J.W. Molaei R. Priyadarshi R. Han S. Cellulose nanofiber-based coating film integrated with nitrogen-functionalized carbon dots for active packaging applications of fresh fruit Postharvest Biol. Technol. 2022 186 111845 10.1016/j.postharvbio.2022.111845 215. Lopez-Polo J. Soto A. Zamorano M. Silva-Weiss A. Oyarzun-Ampuero F.A. Brossard N. Fuentes J. Osorio F.A. Effect of the incorporation of liposomes loaded with rutin on the transport properties of edible film produced with hydroxypropyl methylcellulose: An in vitro release study LWT 2024 191 115583 10.1016/j.lwt.2023.115583 216. Fernández-Cancelo P. Giné-Bordonaba J. Pérez-Gago M.B. Palou L. Torres R. Echeverria G. Teixidó N. A hydroxypropyl methylcellulose (HPMC)-based coating inhibits ethylene-dependent quality changes and reduces superficial scald incidence and blue mould severity during postharvest handling of two apple varieties Postharvest Biol. Technol. 2024 207 112610 10.1016/j.postharvbio.2023.112610 217. Liu M. Zhang P. Wu Y. Ouyang J. Chitosan-hydroxypropyl methylcellulose and sodium alginate bilayer edible films for chestnut preservation Food Chem. 2025 466 142254 10.1016/j.foodchem.2024.142254 39615361 218. Atta O.M. Manan S. Ul-Islam M. Ahmed A.A.Q. Ullah M.W. Yang G. Development and characterization of plant oil-incorporated carboxymethyl cellulose/bacterial cellulose/glycerol-based antimicrobial edible films for food packaging applications Adv. Compos. Hybrid Mater. 2022 5 973 990 10.1007/s42114-021-00408-9 219. Kavimughil M. Leena M.M. Moses J.A. Anandharamakrishnan C. Effect of material composition and 3D printing temperature on hot-melt extrusion of ethyl cellulose based medium chain triglyceride oleogel J. Food Eng. 2022 329 111055 10.1016/j.jfoodeng.2022.111055 220. Salama H.E. Khattab M.A. Sabaa M.W. Aziz M.S.A. Xanthan/carboxymethyl cellulose-based edible coatings enriched with greenly synthesized ZnO-NPs for active packaging applications Cellulose 2024 31 8189 8202 10.1007/s10570-024-06077-3 221. Mousavi S.R. Rahmati-Joneidabad M. Noshad M. Effect of chia seed mucilage/bacterial cellulose edible coating on bioactive compounds and antioxidant activity of strawberries during cold storage Int. J. Biol. Macromol. 2021 190 618 623 10.1016/j.ijbiomac.2021.08.213 34509518 222. Malvano F. Montone A.M.I. Capuano F. Colletti C. Roveri N. Albanese D. Capparelli R. Effects of active alginate edible coating enriched with hydroxyapatite-quercetin complexes during the cold storage of fresh chicken fillets Food Packag. Shelf Life 2022 32 100847 10.1016/j.fpsl.2022.100847 223. Salama H.E. Aziz M.S.A. Development of active edible coating of alginate and aloe vera enriched with frankincense oil for retarding the senescence of green capsicums LWT 2021 145 111341 10.1016/j.lwt.2021.111341 224. Moeini A. Salazar S.A. Gargiulo L. Kentsop R.A.D. Mattana M. Genga A. Jose C. Pedram P. Cabrera-Barjas G. Guerra S. Development of alginate-based active edible coating with Brassica juncea and Raphanus sativus sprout extracts to extend tomato shelf-life Food Hydrocoll. 2026 170 111693 10.1016/j.foodhyd.2025.111693 225. Smeti S. Tibaoui S. Koubaier H.B.H. Lakoud A. Atti N. Combined effects of alginate based active edible coatings and irradiation treatment on the quality characteristics of Beef Meat at 2 °C Appl. Food Res. 2025 5 100743 10.1016/j.afres.2025.100743 226. Khorami F. Babaei S. Valizadeh S. Naseri M. Golmakani M.T. Bilayer coatings for extension of the shelf life of fish fillets: Incorporating seaweed sulfated polysaccharides in Chitosan—Alginate LbL structures Food Sci. Nutr. 2024 12 2511 2522 10.1002/fsn3.3934 38628222 PMC11016443 227. Kim S. Kim B.S. Bai J. Chang Y. Antibacterial κ-carrageenan/konjac glucomannan-based edible hydrogel film containing Salmonella phage PBSE191 and its application in chicken meat LWT 2023 180 114707 10.1016/j.lwt.2023.114707 228. Zioga M. Tsianaka K. Pappas C. Evageliou V. Pection or/and carrageenan edible films in the presence of tomato paste Food Hydrocoll. 2025 169 111623 10.1016/j.foodhyd.2025.111623 229. Karimzadeh Z. Fallah A.A. Dehkordi S.H. Shafiei S. Ghasemi M. The active kappa-carrageenan coating and oxygen absorber packaging for the preservation of chilled rainbow trout fillets Int. J. Biol. Macromol. 2024 283 137572 10.1016/j.ijbiomac.2024.137572 39542323 230. Zhou X. Zong X. Zhang M. Ge Q. Qi J. Liang J. Xu X. Xiong G. Effect of konjac glucomannan/carrageenan-based edible emulsion coatings with camellia oil on quality and shelf-life of chicken meat Int. J. Biol. Macromol. 2021 183 331 339 10.1016/j.ijbiomac.2021.04.165 33930444 231. Tabassum Babu A. Ahmed H.S. Naik T. Bhumika K.P. Jeevan P.R. Prabhakar P.R. Babu C.S.V. Varaprasad K. Keshava Murthy P.S. Development of antibacterial edible films for food packaging using tragacanth gum, carrageenan, and clove essential oil J. Appl. Polym. Sci. 2024 141 e55495 10.1002/app.55495 232. Dordevic D. Gablo N. Zelenkova L. Dordevic S. Tremlova B. Utilization of Spent Coffee Grounds as a Food By-Product to Produce Edible Films Based on κ-Carrageenan with Biodegradable and Active Properties Foods 2024 13 1833 10.3390/foods13121833 38928775 PMC11202819 233. Shen Y. Ni Z.J. Thakur K. Zhang J.G. Hu F. Wei Z.J. Preparation and characterization of clove essential oil loaded nanoemulsion and pickering emulsion activated pullulan-gelatin based edible film Int. J. Biol. Macromol. 2021 181 528 539 10.1016/j.ijbiomac.2021.03.133 33794240 234. Zhou W. He Y. Liu F. Liao L. Huang X. Li R. Zou Y. Zhou L. Zou L. Liu Y. Carboxymethyl chitosan-pullulan edible films enriched with galangal essential oil: Characterization and application in mango preservation Carbohydr. Polym. 2021 256 117579 10.1016/j.carbpol.2020.117579 33483073 235. Contessa C.R. de Souza N.B. Gonçalo G.B. de Moura C.M. da Rosa G.S. Moraes C.C. Development of Active Packaging Based on Agar-Agar Incorporated with Bacteriocin of Lactobacillus sakei Biomolecules 2021 11 1869 10.3390/biom11121869 34944513 PMC8699788 236. Isık I. Yenipazar H. Saygun A. Sahin Yesilcubuk N. Ozkan Zayim E. Catalgil Giz H. Aloe vera oil-added agar gelatin edible films for Kashar cheese packaging ACS Omega 2023 8 18516 18522 10.1021/acsomega.3c00147 37273584 PMC10233849 237. Priyadarshi R. Riahi Z. Rhim J.W. Antioxidant pectin/pullulan edible coating incorporated with Vitis vinifera grape seed extract for extending the shelf life of peanuts Postharvest Biol. Technol. 2022 183 111740 10.1016/j.postharvbio.2021.111740 238. Sayadi M. Abedi E. Oliyaei N. Effect of Persian gum-gelatin based-pickering emulsion film loaded with Thyme essential oil on the storage quality of Barred mackerel ( Scomberomorus commerrson LWT 2025 215 117241 10.1016/j.lwt.2024.117241 239. Rashid M.S. Deshmukh R.K. Kumar P. Tripathi S. Esatbeyoglu T. Gaikwad K.K. Development and characterization of edible films and coatings from Butea monosperma and guar gum for prolonging tomato freshness Int. J. Biol. Macromol. 2025 311 143958 10.1016/j.ijbiomac.2025.143958 40334878 240. de Souza W.F.C. de Lucena F.A. da Silva K.G. Martins L.P. de Castro R.J.S. Sato H.H. Influence of edible coatings composed of alginate, galactomannans, cashew gum, and gelatin on the shelf-life of grape cultivar ‘Italia’: Physicochemical and bioactive properties LWT 2021 152 112315 10.1016/j.lwt.2021.112315 241. Noshad M. Alizadeh Behbahani B. Jooyandeh H. Rahmati-Joneidabad M. Hemmati Kaykha M.E. Ghodsi Sheikhjan M. Utilization of Plantago major seed mucilage containing Citrus limon essential oil as an edible coating to improve Shelf—Life of buffalo meat under refrigeration conditions Food Sci. Nutr. 2021 9 1625 1639 10.1002/fsn3.2137 33747474 PMC7958549 242. Lindi A.M. Gorgani L. Mohammadi M. Hamedi S. Darzi G.N. Cerruti P. Fattahi E. Moeini A. Fenugreek seed mucilage-based active edible films for extending fresh fruit shelf life: Antimicrobial and physicochemical properties Int. J. Biol. Macromol. 2024 269 132186 10.1016/j.ijbiomac.2024.132186 38723815 243. Rojas-Lema S. Mellinas C. Jiménez A. Garrigós M.D.C. Garcia-Garcia D. Balart R. Enhanced properties of methyl hydroxyethyl cellulose films with arabinoxylans-rich extract from brewer’s spent grain Carbohydr. Polym. Technol. Appl. 2024 8 100624 10.1016/j.carpta.2024.100624 244. Moreirinha C. Vilela C. Silva N.H. Pinto R.J. Almeida A. Rocha M.A.M. Coelho E. Coimbra M.A. Silvestre A.J.D. Freire C.S. Antioxidant and antimicrobial films based on brewers spent grain arabinoxylans, nanocellulose and feruloylated compounds for active packaging Food Hydrocoll. 2020 108 105836 10.1016/j.foodhyd.2020.105836 245. Luo R. Peng Z. Wu N. Zhang L. Peng B. Shao R. Xu W. Yang L. Development of antioxidant arabinoxylan-tea polyphenol composite films for enhanced preservation of fresh grapes Int. J. Biol. Macromol. 2024 281 135867 10.1016/j.ijbiomac.2024.135867 39443169 246. Bai Z. Lan H. Li J. Geng M. Luo D. Feng J. Li X. Zhang Y. Recycling of wheat gluten wastewater: Recovery of arabinoxylan and application of its film in cherry and strawberry preservation Food Chem. X 2024 22 101415 10.1016/j.fochx.2024.101415 38721387 PMC11076656 247. Qiao J. Wang Q. Liu K. Chang Y. Wang L. Zhang S. Yu Y. Characterization and antioxidant and antibacterial activities of carboxymethylated tamarind seed polysaccharide composite films incorporated with ε-polylysine and their application in fresh-cut green bell pepper preservation J. Agric. Food Chem. 2024 72 8805 8816 10.1021/acs.jafc.4c00092 38566515 248. Ning R. Cheng X. Lei F. Duan J. Wang K. Jiang J. Antimicrobial multi-crosslinking tamarind xyloglucan/protein-chitosan coating packaging films with self-recovery and biocompatible properties Int. J. Biol. Macromol. 2024 279 134949 10.1016/j.ijbiomac.2024.134949 39179071 249. Feng L. Jiang X. Han J. Li L. Kitazawa H. Wang X. Guo Y. Dong X. Liu H. Properties of an active film based on glutenin/tamarind gum and loaded with binary microemulsion of melatonin/pummelo essential oil and its preservation for Agaricus bisporus Food Chem. 2023 429 136901 10.1016/j.foodchem.2023.136901 37487395 250. Santhosh R. Thakur R. Sarkar P. Janaswamy S. Active bio-nanocomposites from litchi seed starch, tamarind kernel xyloglucan, and lignin nanoparticles to improve the shelf-life of banana ( Musa acuminata Food Chem. 2025 463 141327 10.1016/j.foodchem.2024.141327 39305647 251. Ma J. Zhou Z. Li K. Li K. Liu L. Zhang W. Xu H. Tu X. Du L. Zhang H. Novel edible coating based on shellac and tannic acid for prolonging postharvest shelf life and improving overall quality of mango Food Chem. 2021 354 129510 10.1016/j.foodchem.2021.129510 33752113 252. Li W. Wang C. Ye J. Decolorizing shellac incorporated with natural antibacterial juglone from walnut green husk extract for preserving the postharvest quality of Wichita pecans ( Carya illinoinensis Sci. Hortic. 2022 304 111313 10.1016/j.scienta.2022.111313 253. Han T. Chen W. Zhong Q. Chen W. Xu Y. Wu J. Chen H. Development and Characterization of an Edible Zein/Shellac Composite Film Loaded with Curcumin Foods 2023 12 1577 10.3390/foods12081577 37107372 PMC10137614 254. Poddar D. Pandey K. Yoo H.M. Streamlining electrospun shellac coatings on paper for high moisture strength and barrier food packaging film: Tailoring the processing parameters for accelerated coating Int. J. Biol. Macromol. 2025 297 139855 10.1016/j.ijbiomac.2025.139855 39826740 255. Amadeu C.A.A. Silva F.B. Souza C.J.F. Koschevic M.T. Schoeninger V. Falcão E.A. Garcia V.A.D.S. Cardoso C.A.L. Martelli S.M. Pectin Edible Films Filled with Ilex paraguariensis Concentrate Extract and Its Characterization Polymers 2024 16 3158 10.3390/polym16223158 39599249 PMC11598653 256. Alvarez M.V. Palou L. Taberner V. Fernández-Catalán A. Argente-Sanchis M. Pitta E. Pérez-Gago M.B. Natural Pectin-Based Edible Composite Coatings with Antifungal Properties to Control Green Mold and Reduce Losses of ‘Valencia’ Oranges Foods 2022 11 1083 10.3390/foods11081083 35454670 PMC9033115 257. Huang X. Hong M. Wang L. Meng Q. Ke Q. Kou X. Bioadhesive and antibacterial edible coating of EGCG-grafted pectin for improving the quality of grapes during storage Food Hydrocoll. 2023 136 108255 10.1016/j.foodhyd.2022.108255 258. Sun C. Cao J. Wang Y. Huang L. Chen J. Wu J. Zhang H. Chen Y. Sun C. Preparation and characterization of pectin-based edible coating agent encapsulating carvacrol/HPβCD inclusion complex for inhibiting fungi Food Hydrocoll. 2022 125 107374 10.1016/j.foodhyd.2021.107374 259. Palamanit A. Prachayawarakorn S. Tungtrakul P. Soponronnarit S. Performance evaluation of top-spray fluidized bed coating for healthy coated rice production Food Bioprocess Technol. 2016 9 1317 1326 10.1007/s11947-016-1720-3 260. Cabrini A. Esfahani A.G. Petraconi A. Lavorgna M. De Nardo L. Buonocore G.G. Andrade R.J.E. Cerruti P. Ultrasonic spray deposition of PEGDE-crosslinked chitosan/graphene oxide coatings for enhancing gas barrier properties of polybutylene succinate films Prog. Org. Coat. 2023 183 107760 10.1016/j.porgcoat.2023.107760 261. Oh Y.A. Roh S.H. Min S.C. Cold plasma treatments for improvement of the applicability of defatted soybean meal-based edible film in food packaging Food Hydrocoll. 2016 58 150 159 10.1016/j.foodhyd.2016.02.022 262. Jafarzadeh S. Salehabadi A. Nafchi A.M. Oladzadabbasabadi N. Jafari S.M. Cheese packaging by edible coatings and biodegradable nanocomposites; improvement in shelf life, physicochemical and sensory properties Trends Food Sci. Technol. 2021 116 218 231 10.1016/j.tifs.2021.07.021 263. Almasi H. Oskouie M.J. Saleh A. A review on techniques utilized for design of controlled release food active packaging Crit. Rev. Food Sci. Nutr. 2021 61 2601 2621 10.1080/10408398.2020.1783199 32588646 264. Xie Q. Liu G. Zhang Y. Edible films/coatings containing bioactive ingredients with micro/nano encapsulation: A comprehensive review of their fabrications, formulas, multifunctionality and applications in food packaging Crit. Rev. Food Sci. Nutr. 2024 64 5341 5378 10.1080/10408398.2022.2153794 36503369 265. Bahrami A. Delshadi R. Assadpour E. Jafari S.M. Williams L. Antimicrobial-loaded nanocarriers for food packaging applications Adv. Colloid Interface Sci. 2020 278 102140 10.1016/j.cis.2020.102140 32171115 266. Zhang W. Jiang H. Rhim J.W. Cao J. Jiang W. Effective strategies of sustained release and retention enhancement of essential oils in active food packaging films/coatings Food Chem. 2022 367 130671 10.1016/j.foodchem.2021.130671 34343816 267. Malekjani N. Karimi R. Assadpour E. Jafari S.M. Control of release in active packaging/coating for food products; approaches, mechanisms, profiles, and modeling Crit. Rev. Food Sci. Nutr. 2024 64 10789 10811 10.1080/10408398.2023.2228413 37401796 268. Commission Regulation (EU) No. 10/2011 of 14 January 2011 on plastic materials and articles intended to come into contact with food Off. J. Eur. Communities 2011 12 1 132 269. Chen X. Ma W. Hu W. Liu Z. Wang H. Chen Y. Li L. Progress in Release—Activated food packaging films Packag. Technol. Sci. 2023 36 889 902 10.1002/pts.2765 270. Zhang L. Yu D. Regenstein J.M. Xia W. Dong J. A comprehensive review on natural bioactive films with controlled release characteristics and their applications in foods and pharmaceuticals Trends Food Sci. Technol. 2021 112 690 707 10.1016/j.tifs.2021.03.053 271. Wibowo C. Salsabila S. Muna A. Rusliman D. Wasisto H.S. Advanced Biopolymer—Based edible coating technologies for food preservation and packaging Compr. Rev. Food Sci. Food Saf. 2024 23 e13275 10.1111/1541-4337.13275 38284604 272. Peltzer M.A. Salvay A.G. Delgado J.F. Wagner J.R. Use of edible films and coatings for functional foods developments: A review Functional Foods Sources, Health Effects and Future Perspectives Nova Science Publishers Inc. New York, NY, USA 2017 1 26 978-1-53610-477-6 273. Pinheiro A.C. Bourbon A.I. Quintas M.A. Coimbra M.A. Vicente A.A. Κ-carrageenan/chitosan nanolayered coating for controlled release of a model bioactive compound Innov. Food Sci. Emerg. Technol. 2012 16 227 232 10.1016/j.ifset.2012.06.004 274. Mastromatteo M. Barbuzzi G. Conte A. Del Nobile M.A. Controlled release of thymol from zein based film Innov. Food Sci. Emerg. Technol. 2009 10 222 227 10.1016/j.ifset.2008.11.010 275. Arcan I. Yemenicioglu A. Controlled release properties of zein–fatty acid blend films for multiple bioactive compounds J. Agric. Food Chem. 2014 62 8238 8246 10.1021/jf500666w 25025594 276. Marcuzzo E. Sensidoni A. Debeaufort F. Voilley A. Encapsulation of aroma compounds in biopolymeric emulsion based edible films to control flavour release Carbohydr. Polym. 2010 80 984 988 10.1016/j.carbpol.2010.01.016 277. Liu F. Jiang Y. Du B. Chai Z. Jiao T. Zhang C. Ren F. Leng X. Design and characterization of controlled-release edible packaging films prepared with synergistic whey-protein polysaccharide complexes J. Agric. Food Chem. 2013 61 5824 5833 10.1021/jf4009923 23718814 278. Ünalan İ.U. Arcan I. Korel F. Yemenicioğlu A. Application of active zein-based films with controlled release properties to control Listeria monocytogenes growth and lipid oxidation in fresh Kashar cheese Innov. Food Sci. Emerg. Technol. 2013 20 208 214 10.1016/j.ifset.2013.08.004 279. Alikhani-Koupaei M. Liposomal and edible coating as control release delivery systems for essential oils: Comparison of application on storage life of fresh-cut banana Qual. Assur. Saf. Crops Foods 2015 7 175 185 10.3920/QAS2013.0297 280. Zambrano-Zaragoza M.L. Quintanar-Guerrero D. Del Real A. Piñon-Segundo E. Zambrano-Zaragoza J.F. The release kinetics of β-carotene nanocapsules/xanthan gum coating and quality changes in fresh-cut melon (cantaloupe) Carbohydr. Polym. 2017 157 1874 1882 10.1016/j.carbpol.2016.11.075 27987907 281. Acevedo-Fani A. Soliva-Fortuny R. Martín-Belloso O. Photo-protection and controlled release of folic acid using edible alginate/chitosan nanolaminates J. Food Eng. 2018 229 72 82 10.1016/j.jfoodeng.2017.03.024 282. Huang G. Yan Y. Xu D. Wu J. Xu C. Fu L. Lin B. Curcumin-loaded nanoMOFs@ CMFP: A biological preserving paste with antibacterial properties and long-acting, controllable release Food Chem. 2021 337 127987 10.1016/j.foodchem.2020.127987 32927225 283. Rajapaksha S.W. Shimizu N. Development and characterization of functional starch-based films incorporating free or microencapsulated spent black tea extract Molecules 2021 26 3898 10.3390/molecules26133898 34202382 PMC8271635 284. Huang G. Huang L. Geng C. Lan T. Huang X. Xu S. Shen Y. Bian H. Green and multifunctional chitosan-based conformal coating as a controlled release platform for fruit preservation Int. J. Biol. Macromol. 2022 219 767 778 10.1016/j.ijbiomac.2022.08.038 35961553 285. Das S. Chaudhari A.K. Singh V.K. Dwivedy A.K. Dubey N.K. Angelica archangelica essential oil loaded chitosan nanoemulsion as edible coating for preservation of table grape fruit against Botrytis cinerea contamination and storage quality deterioration Postharvest Biol. Technol. 2023 205 112482 10.1016/j.postharvbio.2023.112482 286. Fan S. Wang D. Wen X. Li X. Fang F. Richel A. Xiao N. Fauconnier M.L. Zhou C. Zhang D. Incorporation of cinnamon essential oil-loaded Pickering emulsion for improving antimicrobial properties and control release of chitosan/gelatin films Food Hydrocoll. 2023 138 108438 10.1016/j.foodhyd.2022.108438 287. Lanciu Dorofte A. Dima C. Ceoromila A. Botezatu A. Dinica R. Bleoanca I. Borda D. Controlled release of β-CD-encapsulated thyme essential oil from whey protein edible packaging Coatings 2023 13 508 10.3390/coatings13030508 288. Li H. Liu M. Han S. Hua S. Zhang H. Wang J. Xia N. Liu Y. Meng D. Edible chitosan-based Pickering emulsion coatings: Preparation, characteristics, and application in strawberry preservation Int. J. Biol. Macromol. 2024 264 130672 10.1016/j.ijbiomac.2024.130672 38462095 289. Chen P. Hua S. Liu Y. Li C. Zhang X. Lu X. Sun C. Sun C. Huang L. Preparation and characterization of chitosan based edible coating containing vanillin/HPβCD inclusion complex and its application in chicken preservation Food Control 2024 166 110683 10.1016/j.foodcont.2024.110683 290. Heidary L. Nourbakhsh H. Javanmardi Z. Saba M.K. Biopolymer-enhanced nanoemulsions for controlled release of thyme: Impact on strawberry shelf life and quality J. Agric. Food Res. 2025 21 101796 10.1016/j.jafr.2025.101796 291. Shi Y. Li B. Yuan J. Qin Y. Zhou L. Zhong J. Liu W. Liu C. Controlled release active films prepared from temperature responded emulsions and their application in grape preservation Colloids Surf. A Physicochem. Eng. Asp. 2025 709 136190 10.1016/j.colsurfa.2025.136190 292. Talesh A.A. Amiri S. Radi M. Hosseinifarahi M. Effect of nanocomposite alginate-based edible coatings containing thymol-nanoemulsion and/or thymol-loaded nanostructured lipid carriers on the microbial and physicochemical properties of carrot Int. J. Biol. Macromol. 2025 308 129196 10.1016/j.ijbiomac.2023.129196 38184040 293. Yaashikaa P.R. Kamalesh R. Kumar P.S. Saravanan A. Vijayasri K. Rangasamy G. Recent advances in edible coatings and their application in food packaging Food Res. Int. 2023 173 113366 10.1016/j.foodres.2023.113366 37803705 294. Sáez-Orviz S. Rendueles M. Diaz M. Impact of adding prebiotics and probiotics on the characteristics of edible films and coatings-a review Food Res. Int. 2023 164 112381 10.1016/j.foodres.2022.112381 36737965 295. Guan T. Zhang Z. Li X. Cui S. McClements D.J. Wu X. Chen L. Long J. Jiao A. Qiu C. Preparation, characteristics, and advantages of plant protein-based bioactive molecule delivery systems Foods 2022 11 1562 10.3390/foods11111562 35681312 PMC9180007 296. Pellegrino M. Elechi J.O.G. Plastina P. Loizzo M.R. Application of Natural Edible Coating to Enhance the Shelf Life of Red Fruits and Their Bioactive Content Appl. Sci. 2024 14 4552 10.3390/app14114552 297. El-Sayed H.S. El-Sayed S.M. Mabrouk A.M. Nawwar G.A. Youssef A.M. Development of eco-friendly probiotic edible coatings based on chitosan, alginate and carboxymethyl cellulose for improving the shelf life of UF soft cheese J. Polym. Environ. 2021 29 1941 1953 10.1007/s10924-020-02003-3 298. Semwal A. Ambatipudi K. Navani N.K. Development and characterization of sodium caseinate based probiotic edible film with chia mucilage as a protectant for the safe delivery of probiotics in functional bakery Food Hydrocoll. Health 2022 2 100065 10.1016/j.fhfh.2022.100065 299. Paulo A.F.S. Baú T.R. Ida E.I. Shirai M.A. Edible coatings and films with incorporation of prebiotics—A review Food Res. Int. 2021 148 110629 10.1016/j.foodres.2021.110629 34507773 300. Alvarez M.V. Bambace M.F. Quintana G. Gomez-Zavaglia A. del Rosario Moreira M. Prebiotic-alginate edible coating on fresh-cut apple as a new carrier for probiotic lactobacilli and bifidobacteria LWT 2021 137 110483 10.1016/j.lwt.2020.110483 301. Tampucci S. Castagna A. Monti D. Manera C. Saccomanni G. Chetoni P. Zucchetti E. Barbagallo M. Fazio L. Santin M. Tyrosol-enriched tomatoes by diffusion across the fruit peel from a chitosan coating: A proposal of functional food Foods 2021 10 335 10.3390/foods10020335 33557256 PMC7915486 302. Kowalska H. Marzec A. Domian E. Kowalska J. Ciurzyńska A. Galus S. Edible coatings as osmotic dehydration pretreatment in Nutrient—Enhanced fruit or vegetable snacks development: A review Compr. Rev. Food Sci. Food Saf. 2021 20 5641 5674 10.1111/1541-4337.12837 34698434 303. Khatreja K. Santhiya D. Physicochemical characterization of novel okra mucilage/hyaluronic acid-based oral disintegrating films for functional food applications Int. J. Biol. Macromol. 2024 278 134633 10.1016/j.ijbiomac.2024.134633 39128761 304. Tavera-Quiroz M.J. Romano N. Mobili P. Pinotti A. Gómez-Zavaglia A. Bertola N. Green apple baked snacks functionalized with edible coatings of methylcellulose containing Lactobacillus plantarum J. Funct. Foods 2015 16 164 173 10.1016/j.jff.2015.04.024 305. García-Argueta I. Quintero-Salazar B. Dominguez-Lopez A. Gómez-Oliván L.M. Díaz-Bandera D. Dublán-García O. Effect of edible coating based on whey, inulin and gelatine with Lactobacillus casei on the textural and sensorial properties of a cracker cookie J. Prob. Health 2016 4 153 10.4172/2329-8901.1000153 306. Genevois C.E. de Escalada Pla M.F. Flores S.K. Application of edible coatings to improve global quality of fortified pumpkin Innov. Food Sci. Emerg. Technol. 2016 33 506 514 10.1016/j.ifset.2015.11.001 307. Amarillas L. Lightbourn-Rojas L. Angulo-Gaxiola A.K. Basilio Heredia J. González-Robles A. León-Félix J. The antibacterial effect of Chitosan—Based edible coating incorporated with a lytic bacteriophage against Escherichia coli O157,H7 on the surface of tomatoes J. Food Saf. 2018 38 e12571 10.1111/jfs.12571 308. Ariviani S. Kusumawati M. Atmaka W. Chitosan-garlic essential oil incorporation on beef meatball edible coatings as antioxidant-based functional food IOP Conference Series: Materials Science and Engineering IOP Publishing Bristol, UK 2019 Volume 633 012032 10.1088/1757-899X/633/1/012032 309. Bambace M.F. Alvarez M.V. del Rosario Moreira M. Novel functional blueberries: Fructo-oligosaccharides and probiotic lactobacilli incorporated into alginate edible coatings Food Res. Int. 2019 122 653 660 10.1016/j.foodres.2019.01.040 31229124 310. Pereira J.O. Soares J. Monteiro M.J. Amaro A. Gomes A. Pintado M. Cereal bars functionalized through Bifidobacterium animalis subsp. lactis BB-12 and inulin incorporated in edible coatings of whey protein isolate or alginate Food Funct. 2019 10 6892 6902 10.1039/C9FO00370C 31588471 311. Todhanakasem T. Boonchuai P. Itsarangkoon Na Ayutthaya P. Suwapanich R. Hararak B. Wu B. Young B.M. Development of bioactive Opuntia ficus-indica edible films containing probiotics as a coating for fresh-cut fruit Polymers 2022 14 5018 10.3390/polym14225018 36433145 PMC9693271 312. Castillo-Escandón V. Montfort G.R.C. Rubio A.R.I. Marszalek J.E. Subiría-Cueto R. Michel S.F. Development of healthy synbiotic corn-based snack: Nutritional composition and effect of agave fructan-alginate coating on survival of Lactobacillus acidophilus J. Cereal Sci. 2023 114 103777 10.1016/j.jcs.2023.103777 313. Freire C.D. Antunes M. Silva S.F. Neves M. Tecelão C. Seaweed Pelvetia canaliculata as a Source of Bioactive Compounds for Application in Fried Pre-Coated Mackerel (Scomber scombrus) Fillets: A Functional Food Approach Appl. Sci. 2025 15 7623 10.3390/app15137623 314. Mbonambi N.P. Seke F. Mwelase S. Fawole O.A. Improving Quality Management of ‘Ready-to-Eat’ Pomegranate Arils Using Aloe Ferox—Based Edible Coating Enriched With Encapsulated Raspberry Pomace Food Sci. Nutr. 2025 13 e70636 10.1002/fsn3.70636 40661802 PMC12257137 315. United Nation Department of Economic and Social Affairs Available online: https://sdgs.un.org/goals (accessed on 8 August 2025) 316. Reichert C.L. Bugnicourt E. Coltelli M.-B. Cinelli P. Lazzeri A. Canesi I. Braca F. Martínez B.M. Alonso R. Agostinis L. Bio-Based Packaging: Materials, Modifications, Industrial Applications and Sustainability Polymers 2020 12 1558 10.3390/polym12071558 32674366 PMC7407213 317. Shah Y.A. Bhatia S. Al-Harrasi A. Khan T.S. Advancements in the biopolymer films for food packaging applications: A short review Biotechnol. Sustain. Mater. 2024 1 2 10.1186/s44316-024-00002-1 318. Zhao X. Cornish K. Vodovotz Y. Narrowing the gap for bioplastic use in food packaging: An update Environ. Sci. Technol. 2020 54 4712 4732 10.1021/acs.est.9b03755 32202110 319. Hermann B.G. Debeer L. De Wilde B. Blok K. Patel M.K. To compost or not to compost: Carbon and energy footprints of biodegradable materials’ waste treatment Polym. Degrad. Stab. 2011 96 1159 1171 10.1016/j.polymdegradstab.2010.12.026 320. Rossi V. Cleeve-Edwards N. Lundquist L. Schenker U. Dubois C. Humbert S. Jolliet O. Life cycle assessment of end-of-life options for two biodegradable packaging materials: Sound application of the European waste hierarchy J. Clean. Prod. 2015 86 132 145 10.1016/j.jclepro.2014.08.049 321. Lamberti F.M. Ingram A. Wood J. Synergistic Dual Catalytic System and Kinetics for the Alcoholysis of Poly ( Lactic Acid Processes 2021 9 921 10.3390/pr9060921 322. Barletta M. Aversa C. Puopolo M. Recycling of PLA—Based bioplastics: The role of chain—Extenders in twin—Screw extrusion compounding and cast extrusion of sheets J. Appl. Polym. Sci. 2020 137 49292 10.1002/app.49292 323. EPA United Environmental Protection Agency Available online: https://www.epa.gov/sites/default/files/2021-01/documents/2018_ff_fact_sheet_dec_2020_fnl_508.pdf (accessed on 8 August 2025) 324. Van Roijen E.C. Miller S.A. A review of bioplastics at end-of-life: Linking experimental biodegradation studies and life cycle impact assessments Resour. Conserv. Recycl. 2022 181 106236 10.1016/j.resconrec.2022.106236 325. European Parliament and of the Council Regulation (EC) No 1333/2008 of the European Parliament and of the Council of 16 December 2008 on food additives Off. J. Eur. Union 2008 Available online: https://eur-lex.europa.eu/eli/reg/2008/1333/oj/eng (accessed on 9 September 2025) 326. European Commission Commission Regulation (EU) No 1129/2011 of 11 November 2011 amending Annex II to Regulation (EC) No 1333/2008 of the European Parliament and of the Council by establishing a Union list of food additives Off. J. Eur. Union 2011 Available online: https://eur-lex.europa.eu/eli/reg/2011/1129/oj/eng (accessed on 9 September 2025) 327. European Commission Commission Regulation (EU) No 231/2012 of 9 March 2012 laying down specifications for food additives listed in Annexes II and III to Regulation (EC) No 1333/2008 of the European Parliament and of the Council Off. J. Eur. Union 2012 Available online: https://eur-lex.europa.eu/eli/reg/2012/231/oj/eng (accessed on 9 September 2025) 328. Raybaudi-Massilia R. Mosqueda-Melgar J. Soliva-Fortuny R. Martín-Belloso O. Combinational edible antimicrobial films and coatings Antimicrobial Food Packaging Barros-Velázquez J. Academic Press New York, NY, USA Elsevier Inc Philadelphia, PA, USA 2016 633 646 329. FDA (Food and Drug Administration) CFR Title 21: Foods and Drugs, CFR Part 172: Food Additives Permitted for Direct Addition to Food for Human Consumption CFR, Subpart C: Coatings, Films and Related Substances National Geodetic Survey NOAA Silver Spring, MD, USA 2024 Available online: https://www.ecfr.gov/current/title-21/chapter-I/subchapter-B/part-172/subpart-C?toc=1 (accessed on 9 September 2025) 330. FDA CFR Title 21: Foods and Drugs, CFR Part 173: Secondary Direct Food Additives Permitted in Food for Human Consumption National Geodetic Survey NOAA Silver Spring, MD, USA 2024 Available online: https://www.accessdata.fda.gov/scripts/cdrh/cfdocs/cfCFR/CFRSearch.cfm (accessed on 9 September 2025) 331. European Commission Commission Regulation 450/2009 of 29 May 2009 on active and intelligent materials and articles intended to come into contact with food Off. J. Eur. Union 2009 Available online: https://eur-lex.europa.eu/eli/reg/2009/450/oj/eng (accessed on 9 September 2025) Figure 1 Formulation and application methods of edible biopolymer-based coatings and films for food applications. polymers-17-02472-t001_Table 1 Table 1 Examples of industrial commercially available edible coatings and films for food packaging applications from natural resources. Manufacturer Commercial Name–Patent Number Specifications Application Bio2Coat SL/Universitat Politecnica de Catalunya https://bio2coat-group.com/ No trade name Coating and film formulation Effects Fruits (spraying, nebulizing) Poly-natural https://polynatural.com/ Shel-life ® Coating formulation Effects Fruits (spraying) Notpla * https://www.notpla.com/ Ooho Formulation Effects Food products: oil, water… AgroSustain https://www.agrosustain.ch/ Afondo ® Coating formulation Effects Fruits, vegetables, and flowers (spraying, dipping) LiquidSeal HoldingBV https://www.liquidseal.nl/ Liquidseal ® Coating formulation Effects Fruits: avocado, citrus, mango, and papaya. Vegetables: cucumbers. Flowers (spraying, dipping) Mori https://www.mori.com/ Mori ® Coating formulation Effects Perishable food (wherever a food interacts with water) (dipping, spraying, glazing) Margrey Industrial SA No trade name Coating formulation Effects Fruits and vegetables (fluidization, dipping, spraying or roller impregnation) Kerry Group Services International Ltd. https://www.kerry.com/ No trade name Coating formulation Effects Baked food products (spraying, dipping) Tomorrow Machine and Eckes Granini https://goneshells.com/ GoneShells ® Formulation Effects Juices Do eat https://www.food.be/companies/do-eat No trade name Formulation Effects Bakeries, take-away food (chips, bagels.). Convenience food, prepared meals and dishes Valdís Steinars Bioplastic Skin Formulation Effects Meat Evoware * https://rethink-plastic.com/home/ No trade name Formulation Effects Food and beverages Caragum https://www.caragum.com/en/ Fibrecoat ® Coating formulation Effects Fried breaded products * Not all the products developed by the company are edible. ",
  "metadata": {
    "Title of this paper": "Commission Regulation 450/2009 of 29 May 2009 on active and intelligent materials and articles intended to come into contact with food",
    "Journal it was published in:": "Polymers",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12473381/"
  }
}