{
  "title": "Paper_1195",
  "abstract": "pmc Brain Sci Brain Sci 2399 brainsci brainsci Brain Sciences 2076-3425 Multidisciplinary Digital Publishing Institute  (MDPI) PMC12469027 PMC12469027.1 12469027 12469027 41008380 10.3390/brainsci15091020 brainsci-15-01020 1 Editorial Bridging Neurobiology, Heterogeneity, and Comorbidity in Mood Disorders https://orcid.org/0000-0001-7062-8192 Singh Balwinder Department of Psychiatry and Psychology, Mayo Clinic, Rochester, MN 55905, USA; singh.balwinder@mayo.edu 22 9 2025 9 2025 15 9 497620 1020 06 9 2025 18 9 2025 22 09 2025 27 09 2025 29 09 2025 © 2025 by the author. 2025 https://creativecommons.org/licenses/by/4.0/ Licensee MDPI, Basel, Switzerland. This article is an open access article distributed under the terms and conditions of the Creative Commons Attribution (CC BY) license ( https://creativecommons.org/licenses/by/4.0/ pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement no pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes Mood disorders are among the most disabling and complex psychiatric conditions, affecting millions worldwide and contributing substantially to morbidity, mortality, and healthcare utilization [ 1 2 3 4 5 6 This Special Issue, Clinical Research on Mood Disorders: Opportunities and Challenges In a comprehensive systematic review and meta-analysis of (es)ketamine for bipolar depression, Núñez et al. [ 7 8 9 2 10 An important limitation in measuring depression lies in the rating scales themselves, as critical symptoms—such as changes in appetite and eating behavior, which intersect with the well-established relationship between major depression and obesity—are not adequately captured [ 11 12 13 Anhedonia is a core feature of depression, yet few treatments have demonstrated efficacy in specifically targeting it [ 14 14 15 16 17 Depression frequently co-occurs with anxiety, affecting 50–60% of patients with mood disorders [ 18 19 20 An important dimension of depression is its interplay with somatic comorbidities, especially cancer. In the United States, breast cancer ranks as the second most common cancer and the second leading cause of cancer-related mortality among women [ 21 22 Together, the studies in this Special Issue showcase the progress and ongoing challenges in mood disorder research. They highlight advances in rapid-acting treatments like ketamine, while underscoring the need for standardized assessments, translational approaches, and integration of physical and mental health. Nuanced phenotyping, attention to comorbidities, and consideration of developmental and sex-specific factors are essential for identifying high-risk individuals and optimizing outcomes. Collectively, these findings point toward a future driven by innovation, collaboration, and interdisciplinary strategies to improve the lives of those affected by mood disorders. Disclaimer/Publisher’s Note: Conflicts of Interest I have received research grant support from Mayo Clinic, the National Network of Depression Centers, Breakthrough Discoveries for Thriving with Bipolar Disorder, and the National Institutes of Health (NIH); I am a KL2 Mentored Career Development Program scholar, supported by CTSA (grant number KL2TR002379) from the National Center for Advancing Translational Science; I have also received honoraria (to my institution) from Elsevier for editing a Clinical Overview on treatment-resistant depression. The contents of this comment are solely the responsibility of the authors and do not necessarily represent the official views of the NIH. References 1. Schaffer A. McIntosh D. Goldstein B.I. Rector N.A. McIntyre R.S. Beaulieu S. Swinson R. Yatham L.N. Canadian Network for Mood and Anxiety Treatments (CANMAT) Task Force The CANMAT task force recommendations for the management of patients with mood disorders and comorbid anxiety disorders Ann. Clin. Psychiatry 2012 24 6 22 10.1177/104012371202400103 22303519 2. Singh B. Port J.D. Voort J.L.V. Coombes B.J. Geske J.R. Lanza I.R. Morgan R.J. Frye M.A. A preliminary study of the association of increased anterior cingulate gamma-aminobutyric acid with remission of depression after ketamine administration Psychiatry Res. 2021 301 113953 10.1016/j.psychres.2021.113953 33933839 PMC11798341 3. Fogaca M.V. Daher F. Picciotto M.R. Effects of ketamine on GABAergic and glutamatergic activity in the mPFC: Biphasic recruitment of GABA function in antidepressant-like responses Neuropsychopharmacology 2025 50 673 684 10.1038/s41386-024-02002-1 39390105 PMC11845475 4. Fogaca M.V. Duman R.S. Cortical GABAergic Dysfunction in Stress and Depression: New Insights for Therapeutic Interventions Front. Cell. Neurosci. 2019 13 87 10.3389/fncel.2019.00087 30914923 PMC6422907 5. Singh B. Pazdernik V.K. Kung S. Vande Voort J.L. Long-Term Outcomes in Patients with Treatment-Refractory Depression Receiving Intravenous Ketamine and Intranasal Esketamine: An Observational Study J. Clin. Psychiatry 2025 86 25m15831 10.4088/JCP.25m15831 PMC12404795 40767785 6. Singh B. Ketamine and Esketamine for Depression in Daily Practice: Opportunities and Challenges J. Clin. Psychopharmacol. 2024 44 451 455 10.1097/JCP.0000000000001898 39173027 7. Nunez N.A. Joseph B. Kumar R. Douka I. Miola A. Prokop L.J. Mickey B.J. Singh B. An Update on the Efficacy of Single and Serial Intravenous Ketamine Infusions and Esketamine for Bipolar Depression: A Systematic Review and Meta-Analysis Brain Sci. 2023 13 1672 10.3390/brainsci13121672 38137120 PMC10741553 8. Singh B. Swartz H.A. Cuellar-Barboza A.B. Schaffer A. Kato T. Dols A. Sperry S.H. Vassilev A.B. Burdick K.E. Frye M.A. Bipolar disorder Lancet 2025 406 963 978 10.1016/S0140-6736(25)01140-7 40712624 PMC12340982 9. Singh B. Vande Voort J.L. Kung S. Ketamine for treatment-resistant bipolar depression-need for more data! Bipolar Disord. 2021 23 728 729 10.1111/bdi.13129 34549861 10. Ghosal S. Duman C.H. Liu R.J. Wu M. Terwilliger R. Girgenti M.J. Wohleb E. Fogaca M.V. Teichman E.M. Hare B. Ketamine rapidly reverses stress-induced impairments in GABAergic transmission in the prefrontal cortex in male rodents Neurobiol. Dis. 2020 134 104669 10.1016/j.nbd.2019.104669 31707118 11. Trevino-Alvarez A.M. Sanchez-Ruiz J.A. Barrera F.J. Rodriguez-Bautista M. Romo-Nava F. McElroy S.L. Cuellar-Barboza A.B. Weight changes in adults with major depressive disorder: A systematic review and meta-analysis of prospective studies J. Affect. Disord. 2023 332 1 8 10.1016/j.jad.2023.03.050 36963517 12. Kloiber S. Ising M. Reppermund S. Horstmann S. Dose T. Majer M. Zihl J. Pfister H. Unschuld P.G. Holsboer F. Overweight and obesity affect treatment response in major depression Biol. Psychiatry 2007 62 321 326 10.1016/j.biopsych.2006.10.001 17241618 13. Trevino-Alvarez A.M. Gluck M.E. McElroy S.L. Cuellar-Barboza A.B. The Absence of Items Addressing Increased Appetite or Weight in Depressive-Symptom Questionnaires: Implications for Understanding the Link between Major Depressive Disorder, Antidepressants, and Obesity Brain Sci. 2024 14 841 10.3390/brainsci14080841 39199532 PMC11352823 14. Al-Soleiti M. Vande Voort J.L. Singh B. Anhedonia as a Core Symptom of Depression and a Construct for Biological Research Focus 2025 23 163 172 10.1176/appi.focus.20240050 40235618 PMC11995908 15. Winer E.S. Nadorff M.R. Ellis T.E. Allen J.G. Herrera S. Salem T. Anhedonia predicts suicidal ideation in a large psychiatric inpatient sample Psychiatry Res. 2014 218 124 128 10.1016/j.psychres.2014.04.016 24774075 16. Hawes M. Galynker I. Barzilay S. Yaseen Z.S. Anhedonia and suicidal thoughts and behaviors in psychiatric outpatients: The role of acuity Depress. Anxiety 2018 35 1218 1227 10.1002/da.22814 30107636 17. Darquennes G. Wacquier B. Loas G. Hein M. Suicidal Ideations in Major Depressed Subjects: Role of the Temporal Dynamics of Anhedonia Brain Sci. 2023 13 1065 10.3390/brainsci13071065 37508997 PMC10377246 18. Kessler R.C. Sampson N.A. Berglund P. Gruber M.J. Al-Hamzawi A. Andrade L. Bunting B. Demyttenaere K. Florescu S. de Girolamo G. Anxious and non-anxious major depressive disorder in the World Health Organization World Mental Health Surveys Epidemiol. Psychiatr. Sci. 2015 24 210 226 10.1017/S2045796015000189 25720357 PMC5129607 19. Kalin N.H. The Critical Relationship Between Anxiety and Depression Am. J. Psychiatry 2020 177 365 367 10.1176/appi.ajp.2020.20030305 32354270 20. Kim E. Jung S. Lee M.Y. Park C.H. Cho S.J. Exploring the Association between Elevated Anxiety Symptoms and Low Skeletal Muscle Mass among Asymptomatic Adults: A Population-Based Study in Republic of Korea Brain Sci. 2024 14 438 10.3390/brainsci14050438 38790417 PMC11119912 21. Centers for Disease Control and Prevention Breast Cancer Statistics Available online: https://www.cdc.gov/breast-cancer/statistics/index.html (accessed on 6 September 2025) 22. Khubchandani J. Banerjee S. Batra K. Beydoun M.A. Depression Is Associated with a Higher Risk of Mortality among Breast Cancer Survivors: Results from the National Health and Nutrition Examination Survey-National Death Index Linked Study Brain Sci. 2024 14 732 10.3390/brainsci14070732 39061472 PMC11274946 ",
  "metadata": {
    "Title of this paper": "Depression Is Associated with a Higher Risk of Mortality among Breast Cancer Survivors: Results from the National Health and Nutrition Examination Survey-National Death Index Linked Study",
    "Journal it was published in:": "Brain Sciences",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12469027/"
  }
}