{
  "title": "Paper_1096",
  "abstract": "pmc J Clin Med J Clin Med 2745 jclinmed jcm Journal of Clinical Medicine 2077-0383 Multidisciplinary Digital Publishing Institute  (MDPI) PMC12470544 PMC12470544.1 12470544 12470544 41010768 10.3390/jcm14186564 jcm-14-06564 1 Article Enhancing Timeliness and Compliance of Osteoporosis Care in Oncology: Evidence from a Dedicated Bone Health Service https://orcid.org/0000-0002-6836-1422 Balzi William Conceptualization Software Resources Data curation Writing – review & editing Visualization 1 https://orcid.org/0000-0001-9261-6467 Danesi Valentina Conceptualization Writing – original draft Visualization 1 https://orcid.org/0000-0002-0356-9273 Roncadori Andrea Conceptualization Methodology Software Formal analysis Writing – review & editing Visualization 1 https://orcid.org/0000-0003-1388-3175 Massa Ilaria Conceptualization Validation Writing – review & editing Funding acquisition Project administration 1 https://orcid.org/0000-0003-0366-792X Maltoni Roberta Conceptualization Writing – review & editing Validation 1 https://orcid.org/0000-0002-0066-9172 Gentili Nicola Software Writing – review & editing 2 * https://orcid.org/0000-0003-3989-5799 Cavallucci Martina Software Data curation Writing – review & editing 2 https://orcid.org/0009-0005-8022-0242 Andalò Alice Writing – review & editing Software Data curation 2 https://orcid.org/0000-0003-1870-3380 Ridolfi Laura Validation Writing – review & editing 3 Zavoiu Venetia Writing – review & editing Validation 4 Focherini Maria Cristina Writing – review & editing Investigation 5 Giannini Raffaele Investigation Writing – review & editing 6 Campadelli Enrico Investigation Writing – review & editing 7 Tamberi Stefano Investigation Writing – review & editing 7 Calpona Sebastiano Conceptualization Validation Investigation Writing – review & editing Supervision Funding acquisition 3 Anastasilakis Athanasios D. Academic Editor 1 william.balzi@irst.emr.it valentina.danesi@irst.emr.it andrea.roncadori@irst.emr.it ilaria.massa@irst.emr.it roberta.maltoni@irst.emr.it 2 alice.andalo@irst.emr.it 3 laura.ridolfi@irst.emr.it sebastiano.calpona@irst.emr.it 4 venetia.zavoiu@irst.emr.it 5 mariacristina.focherini@auslromagna.it 6 raffaele.giannini@auslromagna.it 7 enrico.campadelli@auslromagna.it stefano.tamberi@auslromagna.it * nicola.gentili@irst.emr.it 18 9 2025 9 2025 14 18 497642 6564 04 8 2025 09 9 2025 11 9 2025 18 09 2025 27 09 2025 29 09 2025 © 2025 by the authors. 2025 https://creativecommons.org/licenses/by/4.0/ Licensee MDPI, Basel, Switzerland. This article is an open access article distributed under the terms and conditions of the Creative Commons Attribution (CC BY) license ( https://creativecommons.org/licenses/by/4.0/ Background/Objectives Methods Results p p Conclusions breast neoplasms retrospective studies real-world evidence bone density conservation agents patient care management clinical pathway postmenopausal osteoporosis IRCCS IRST Amgen L1P2980 This study was sponsored by IRCCS IRST and received a contribution from Amgen (L1P2980). Amgen had no input into the study design, analysis, interpretation of results, or the decision to publish. The funding also covered the costs related to the article processing charges. pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement yes pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes 1. Introduction Cancer and its treatment can significantly affect bone health, increasing the risk of skeletal complications [ 1 2 3 4 3 2 5 2 6 7 8 6 1 9 10 11 12 13 14 15 16 17 18 19 Moreover, randomized clinical trials have demonstrated that delaying the initiation of bone health therapy in patients with early-stage breast cancer (BC) receiving endocrine treatment is associated with clinically significant skeletal deterioration [ 20 21 p 22 20 Several studies suggest that structured pathways improve care delivery in oncology and osteoporosis. These approaches include structured clinical pathways, multidisciplinary teams, and dedicated bone health outpatient services integrated into oncology care. At Gemelli Hospital in Rome, the introduction of a new diagnostic and therapeutic assistance pathway, featuring early specialist referral and a dedicated case manager, significantly increased the rates of Dual-Energy X-ray screening and the timely initiation of antiresorptive therapy [ 23 24 25 Since 2014, the IRCCS Istituto Romagnolo per lo Studio dei Tumori “Dino Amadori” (IRST) has established an outpatient specialised bone health service integrated into the oncology pathway of BC patients [ 26 The primary objective of this analysis is to evaluate the impact of the IRST organisational model on the timeliness of bone health care in BC compared to the standard care (no bone health service) provided in the hospitals of the Local Health Authority. 2. Materials and Methods A multi-centre, retrospective observational study was conducted to assess the impact of the IRST organisational model on bone health, targeting the population of women with BC. The study population and their data were retrieved retrospectively from the administrative databases of the Emilia-Romagna region, which served as unique sources to identify patient cohorts and data. BC cases were identified based on the International Classification of Diseases, Ninth Revision, Clinical Modification (ICD-9-CM) [ 27 2.1. Study Population and Case Selections The study included all adult incident female patients residing in the Emilia-Romagna region who were diagnosed with breast cancer and underwent breast surgery at a hospital within the Emilia-Romagna region between July 2014 and June 2022, and who received oncological follow-up within the Romagna area ( Figure 1 BC case identification started with hospital discharge records (SDO), from which BC surgical procedures were selected based on the following ICD-9-CM codes: 85.41-48 (mastectomies), 85.22 (quadrectomies), 85.23 (subtotal mastectomies), 85.20-21 (removal of breast tissue and lesions), 85.24-85.25 (removal of ectopic breast tissue and nipple), and 85.33-36 (mammectomy). These procedures were considered when performed in any healthcare facility in the Emilia-Romagna region (regional code 080). Eligible patients required a primary or secondary diagnosis of invasive breast cancer, identified by ICD-9-CM codes 174.0-174.9. Additionally, cases with a primary or secondary diagnosis of in situ breast carcinoma (ICD-9-CM code 233.0) were also included. We excluded patients with evidence of metastatic disease from 1825 days (5 years) before to 180 (6 months) days after the index hospitalization, as identified by ICD-9-CM codes 197.0-197.8, 198.0-198.8, and 199.0-199.1. The 5-year presurgical and 6 month postsurgical window was applied to exclude prevalent and undetected metastatic cases, ensuring inclusion of true early-stage breast cancer patients. Furthermore, patients without any recorded oncology visits at IRST or any hospital facility belonging to the Local Health Authority (AUSL Romagna) were excluded from the study. Female patients diagnosed with malignancies other than BC within five years before the start of the study period or in the six months following the index hospitalization were also deemed ineligible. Prevalent cases were excluded by identifying patients who had undergone BC surgery between 1825 and 180 days before the index intervention and who were in oncological follow-up within the Romagna district (i.e., at least one recorded oncology visit). 2.2. Cohort Assignment The eligible population in oncological follow-up within the Romagna district was divided into two groups: The patients receiving cancer care at IRST with a dedicated bone health service; The control population consisting of patients receiving cancer care at hospitals in the Romagna district that did not have a dedicated bone health service, with the exception of the Faenza hospital. Cohort assignment was based on the frequency of oncology visits at IRST compared to other hospitals in Romagna during the accrual period. A patient was classified in the IRST cohort if the number of her visits to IRST exceeded those to other hospitals; conversely, the patient was assigned to the control cohort. Patients were followed from the date of BC surgical procedures, defined as the index date, until the end of the observational period (December 2022) or until death, whichever occurred first. Demographic and clinical data were obtained from administrative databases. The initiation date of antiresorptive treatment was defined as the first dispensation of oral drugs or the first infusion of intravenous agents, as recorded in the administrative databases, within a time window ranging from 180 days before the index surgery to the end of the observational period (31 December 2022). The use of a unique patient identification code assigned to all residents of Emilia-Romagna, regardless of the care setting (inpatient or outpatient), enabled deterministic record linkage across the various databases. This study was approved by the Scientific Medical Board of IRST IRCCS and Area Vasta Romagna. 2.3. Statistical Analysis Patients receiving cancer care at IRST or those followed in other facilities (i.e., the IRST vs. control group) were matched 1:1 without replacement using a nearest neighbour propensity score. The propensity scores for receiving cancer care at IRST were estimated using a logistic regression model accounting for age, tumour type (invasive vs. in situ), neoadjuvant hormone therapy, neoadjuvant chemotherapy, and adjuvant treatment (both endocrine treatment and chemotherapy). Furthermore, previous anti-osteoporosis (OP) treatment was also included in the logistic regression model for controlling for potential pre-exposure. Given the nature of the study, the population size was not determined by a statistical power computation; practically, all consecutive patients who met the inclusion and exclusion criteria during the accrual period were included. Means, standard deviations (SDs), medians, and ranges were used to describe quantitative variables as appropriate. Absolute frequencies, together with proportions, were used to summarize categorical variables. Furthermore, post-matching, absolute risk differences (ARDs), and number needed to treat (NNT) were derived from BMA initiation rates between cohorts to enhance clinical interpretability. Time-to-event variables (e.g., time to bone health treatment initiation) were summarised using Kaplan–Meier (KM) survival estimates, and differences between groups were formally assessed with the log-rank test. Furthermore, a Cox proportional-hazard (PH) regression model was developed to investigate the factors associated with the timing for treatment initiation. The main analysis considered time to antiresorptive treatment initiation from surgery; however, in the subgroup of patients receiving adjuvant chemotherapy, it was also deemed clinically relevant to evaluate the time to initiation of antiresorptive therapy starting from the beginning of adjuvant treatment. Additionally, the time to antiresorptive treatment initiation in an adjuvant setting was evaluated using competing risk methodology, considering metastatic progression or death prior to treatment as a single competing event. Cumulative incidence functions (CIFs) were estimated and plotted to visualize differences in the probability of event occurrence. Accordingly, the association between baseline covariates and the risk of treatment initiation (event of interest) or metastatic progression/death (competing event) was formally assessed using the Fine–Gray proportional-subdistribution-hazard model. Coherently, subdistribution hazard ratios (sHRs) with 95% confidence intervals (CIs) and p Lastly, a logistic regression model was used to determine the determinants associated with the likelihood of starting the antiresorptive treatment under analysis. Missing data were expected to be entirely random (MCAR). All reported p 3. Results Based on the search query applied to the regional administrative databases, 8045 female patients were identified. Among these, 24 patients were excluded from the analysis because they had an equal number of medical visits at both IRST and local health authorities, making it impossible to assign them to a specific cohort. The final number of patients analysed consisted of 8021 patients, divided into two groups: the IRST group (N = 3112; 38.8%) and the control group (N = 4909; 61.2%). Table 1 After applying PSM (see Supplementary Materials Table S1 Supplementary Materials Figure S1 Table 2 Supplementary Figure S2 p p Supplementary Figure S3 p According to the multivariable logistic regression model ( Table 3 p p p Patients with invasive tumours had a +76.6% higher likelihood of initiating bone health therapy than those with in situ tumours (OR: 1.766, 95% CI: 1.237–2.585, p p According to the multivariable Cox proportional-hazards regression model, which evaluated factors associated with the time to initiation of bone health treatment, patients followed at IRST experienced a significantly shorter time to treatment initiation compared to those in the control cohort (HR: 0.741, 95% CI: 0.673–0.815, p Figure 2 p p p p An analysis based on Kaplan–Meier estimates revealed a clear and statistically significant difference in the timing of bone health treatment initiation between the two care settings ( p Figure 3 Figure 3 In the competing risk analysis, initiation of antiresorptive treatment was more frequent and occurred earlier in patients treated at the CTIBL prevention facility compared with the control group ( Figure 4 Furthermore, as shown in Table 4 p p p p p p p p p In the subgroup of patients who received adjuvant chemotherapy (IRST: N = 868; Control: N = 858), no significant difference was observed in the timing of the initiation of bone health treatment. The Kaplan–Meier survival curves were largely overlapping, and the log-rank test was not statistically significant ( p Figure 5 4. Discussion This study provides robust real-world evidence supporting the clinical and organisational value of integrating a dedicated bone health service into the care pathway for patients with early-stage breast cancer. Our findings indicate that women managed at IRST, where a dedicated bone health service has been in place since 2014, were significantly more likely to receive bone-modifying therapy compared to those followed in hospitals without such a service. The marked difference observed in the first quartile of time to treatment initiation underscores the effectiveness of the IRST organisational model in ensuring timely access to bone health therapy. Notably, IRST patients in the 25th percentile initiated treatment within 22.2 months from surgery (95% CI: 18.6–25.6), whereas patients in the control group reached the same percentile nearly one year later, at 34.0 months (95% CI: 31.1–38.6). The non-overlapping confidence intervals between the two groups strongly support the presence of a systematic and clinically relevant difference in early treatment uptake. Consistently, the competing risk analysis further supported these findings, showing that antiresorptive treatment was initiated earlier and more frequently in patients managed at IRST, without differences in the risk of metastatic progression or death, thus reinforcing the comparability of the two cohorts. These results highlight the impact that dedicated services and integrated care models can have in reducing delays in the management of bone health in BC patients. The initiation of treatment occurred approximately one year earlier among IRST patients, a difference that may carry substantial clinical implications in terms of fracture prevention and long-term skeletal preservation. In contrast, the delay in the control cohort may be attributable to a more fragmented care process and the absence of standardized referral procedures for bone health evaluation. The use of denosumab was slightly lower in the IRST cohort compared to the control group (3.9% vs. 5.2%), despite overall higher rates of bone therapy administration. This result likely reflects a deliberate effort to optimize resource allocation based on patient-specific risk profiles. In fact, a local risk stratification score was developed at IRST to support clinicians in selecting the most appropriate therapy according to clinical needs and to guide the optimal use of resources, particularly in the current context of healthcare austerity. This approach is consistent with the Italian regulatory framework (e.g., Nota 79), which defines appropriateness criteria without favouring a specific agent across all subgroups [ 28 Overall, patients in the IRST group received oncological treatments more often than those in the control group, both in the neoadjuvant and adjuvant settings, consistent with the specialized and comprehensive care approach of the IRST cancer centre. However, the study’s findings indicate that older patients and those who receive neoadjuvant chemotherapy are more likely to initiate bone health therapy earlier, regardless of the institutions where they received care. Another important advantage of the IRST model is its systematic, longitudinal approach, from baseline DXA and metabolic screening at the start of endocrine therapy to annual follow-up visits and final reassessment at the end of treatment. This comprehensive strategy facilitates the early identification of high-risk patients, continuous monitoring of bone status, and timely adaptation of therapy. Moreover, the literature provides evidence that promoting patients’ education can improve compliance with treatment [ 29 The positive impact of similar initiatives has been reported internationally. Structured bone health programs in centres such as the Gemelli Hospital in Rome, the King Hussein Cancer Center in Jordan, and various Canadian institutions have led to improved adherence to guidelines, stabilization or improvement of BMD, and greater patient awareness [ 24 25 Moreover, the relevance of a dedicated bone health service is even greater in the current clinical landscape, where adjuvant endocrine therapies are increasingly extended beyond 5 years for 70–80% of early BC patients, often reaching up to 10 years of treatment [ 2 30 Another critical barrier to the effective management of CTIBL is the limited cultural and scientific attention that this topic still receives within the oncology community. Despite its well-documented impact on morbidity and long-term quality of life, bone health remains a secondary concern in many cancer care settings. This cultural underrepresentation contributes to the insufficient dissemination of information not only among healthcare professionals but also among patients themselves, resulting in low awareness, delayed recognition of symptoms, and underutilisation of preventive strategies. Bridging this knowledge gap through targeted educational initiatives and professional training is essential to enhance both clinician responsiveness and patient engagement. This study has limitations inherent to retrospective, observational designs. Data were derived from administrative databases, and clinical variables, such as BMD values, actual fracture incidence, specific risk factors, and adherence to therapy, could not be assessed. Although propensity score matching was applied to reduce selection bias, residual confounding cannot be entirely excluded. Furthermore, the study does not evaluate direct clinical outcomes (e.g., fracture reduction or quality of life) associated with earlier or more frequent treatment, which should be explored in future prospective analyses or by combining the current data with modelling approaches to better estimate fracture prevention benefits [ 31 The present analysis, despite its limitations, demonstrates that the organisation of care can significantly impact outcomes. Including bone health as part of routine oncology care, through dedicated services, early screening, and structured follow-up, can significantly improve access to therapy. Future research should focus on evaluating the long-term clinical outcomes of these interventions, refining patient stratification tools and examining their cost-effectiveness across different healthcare settings. 5. Conclusions These findings underscore the importance of integrating bone health management into oncology care pathways to reduce therapeutic inertia and improve clinical benefits in breast cancer patients at risk of bone complications. Disclaimer/Publisher’s Note: Supplementary Materials The following supporting information can be downloaded at https://www.mdpi.com/article/10.3390/jcm14186564/s1 Author Contributions Conceptualization I.M., S.C., A.R., W.B., V.D. and R.M.; Methodology, A.R.; Software, W.B., N.G., A.A., M.C. and A.R.; Validation, S.C., I.M., R.M., L.R. and V.Z. Formal Analysis, A.R.; Investigation, S.C.; M.C.F., R.G., E.C. and S.T.; Resources, W.B.; Data Curation, A.A., M.C. and W.B.; Writing—Original Draft Preparation, V.D.; Writing—Review and Editing, S.C., I.M., W.B., A.R., M.C.F., R.G., E.C., S.T., V.D., R.M., N.G., M.C., A.A., L.R. and V.Z.; Visualization, W.B., V.D. and A.R.; Supervision, S.C.; Project Administration, I.M.; Funding Acquisition, I.M. and S.C. All authors have read and agreed to the published version of the manuscript. Institutional Review Board Statement The study (protocol code IRST-OR-007) was conducted in accordance with the guidelines of the Declaration of Helsinki and was approved by the Scientific and Medical Committee of IRST and Area Vasta Romagna on 13 December 2022. Informed Consent Statement Informed consent was not required for this study, as all data were fully anonymised and could not be traced back to individual patients. Data Availability Statement The raw data presented in this study are available at a reasonable request from the corresponding author. Conflicts of Interest The authors declare no conflicts of interest. The funder, Amgen, had no role in the study’s design; in the collection, analyses, or interpretation of data; in the writing of the manuscript; or in the decision to publish the results. Abbreviations The following abbreviations are used in this manuscript: BC Breast Cancer BMAs Bone-Modifying Agents BMD Bone Mineral Density CI Confidential Interval CIFs Cumulative Incidence Functions CTIBL Cancer Treatment-Induced Bone Loss DXA Dual-Energy X-ray Absorptiometry HR Hazard Ratio ICD-9-CM International Classification of Diseases, Ninth Revision, Clinical Modification IQR Interquartile Range IRCCS Scientific Institute for Research, Hospitalization and Healthcare KM Kaplan–Meier MCAR Missing Completely at Random OP Osteoporosis OR Odds Ratio p p PH Proportional-Hazard PSM Propensity Score Matching SD Standard Deviation SDO Hospital Discharge Records SE Error Standard sHR Subdistribution Hazard Ratio Z Z-value References 1. Coleman R. Hadji P. Body J.J. Santini D. Chow E. Terpos E. Oudard S. Bruland Ø. Flamen P. Kurth A. Bone Health in Cancer: ESMO Clinical Practice Guidelines Ann. Oncol. 2020 31 1650 1663 10.1016/j.annonc.2020.07.019 32801018 2. Diana A. Carlino F. Giunta E.F. Franzese E. Guerrera L.P. Di Lauro V. Ciardiello F. Daniele B. Orditura M. Cancer Treatment–Induced Bone Loss (CTIBL): State of the Art and Proper Management in Breast Cancer Patients on Endocrine Therapy Curr. Treat. Options Oncol. 2021 22 45 10.1007/s11864-021-00835-2 33864145 PMC8052225 3. Handforth C. D’Oronzo S. Coleman R. Brown J. Cancer Treatment and Bone Health Calcif. Tissue Int. 2018 102 251 264 10.1007/s00223-017-0369-x 29353450 PMC5805796 4. Khan M.N. Khan A.A. Cancer Treatment–Related Bone Loss: A Review and Synthesis of the Literature Curr. Oncol. 2008 15 S30 S40 10.3747/co.2008.174 18231646 PMC2216420 5. Chen Z. Fracture Risk Among Breast Cancer Survivors Arch. Intern. Med. 2005 165 552 10.1001/archinte.165.5.552 15767532 6. Colzani E. Clements M. Johansson A.L.V. Liljegren A. He W. Brand J. Adolfsson J. Fornander T. Hall P. Czene K. Risk of Hospitalisation and Death Due to Bone Fractures after Breast Cancer: A Registry-Based Cohort Study Br. J. Cancer 2016 115 1400 1407 10.1038/bjc.2016.314 27701383 PMC5129831 7. Kwon M. Kim B.H. Min S.Y. Chae S. Effects of Anticancer Therapy on Osteoporosis in Breast Cancer Patients: A Nationwide Study Using Data from the National Health Insurance Service-National Health Information Database J. Clin. Med. 2025 14 732 10.3390/jcm14030732 39941403 PMC11818878 8. Lee S. Yoo J.I. Lee Y.K. Park J.W. Won S. Yeom J. Im J.W. Lim S.M. Ha Y.C. Koo K.H. Risk of Osteoporotic Fracture in Patients with Breast Cancer: Meta-Analysis J. Bone Metab. 2020 27 27 34 10.11005/jbm.2020.27.1.27 32190606 PMC7064363 9. Associazione Italiana di Oncologia Medica (AIOM) Available online: https://www.iss.it/documents/20126/8403839/LG_C0020_AIOM_Metastasi+ossee.pdf/25b94932-a5c4-2595-044f-bb149134b8c6?t=1716801199464 (accessed on 30 June 2025) 10. Hadji P. Aapro M.S. Body J.J. Bundred N.J. Brufsky A. Coleman R.E. Gnant M. Guise T. Lipton A. Management of Aromatase Inhibitor-Associated Bone Loss in Postmenopausal Women with Breast Cancer: Practical Guidance for Prevention and Treatment Ann. Oncol. 2011 22 2546 2555 10.1093/annonc/mdr017 21415233 11. Reid D.M. Doughty J. Eastell R. Heys S.D. Howell A. McCloskey E.V. Powles T. Selby P. Coleman R.E. Guidance for the Management of Breast Cancer Treatment-Induced Bone Loss: A Consensus Position Statement from a UK Expert Group Cancer Treat. Rev. 2008 34 S3 S18 10.1016/j.ctrv.2008.03.007 18515009 12. Lipton A. Toward New Horizons: The Future of Bisphosphonate Therapy Oncologist 2004 9 38 47 10.1634/theoncologist.9-90004-38 15459428 13. Roberts R. Miller M. O’Callaghan M. Koczwara B. Bone Health Management of Australian Breast Cancer Survivors Receiving Hormonal Therapy Intern. Med. J. 2015 45 1182 1185 10.1111/imj.12897 26348867 14. Bosco D. Osteoporosis and Aromatase Inhibitors: Experience and Future Prospects Clin. Cases Miner. Bone Metab. 2012 9 89 91 23087717 PMC3476523 15. Guideline C. Clinical Practice Guidelines for Full-Cycle Standardized Management of Bone Health in Breast Cancer Patients Cancer Innov. 2024 3 e111 10.1002/cai2.111 38948531 PMC11212291 16. Suarez-Almazor M.E. Herrera R. Lei X. Chavez-MacGregor M. Zhao H. Giordano S.H. Survival in Older Women with Early Stage Breast Cancer Receiving Low-dose Bisphosphonates or denosumab Cancer 2020 126 3929 3938 10.1002/cncr.33035 32573777 17. Bischof E. Schwab F.D. Georgescu Margarint E.L. Montavon C. Zünti I. Schollbach A. Schötzau A. Hirschmann A. Landin J. Meier C. Adherence to Bone Health Guidelines in Patients with Hormone Receptor-Positive Early Breast Cancer: Status and Clinical Impact in a Swiss Cohort Experience Bone Rep. 2022 16 101160 10.1016/j.bonr.2021.101160 34977282 PMC8685978 18. Mazziotti G. Pedersini R. Vena W. Cosentini D. Carrone F. Pigni S. Simoncini E.L. Torrisi R. Zambelli A. Farina D. Real-World Effectiveness of Denosumab and Bisphosphonates on Risk of Vertebral Fractures in Women with Breast Cancer Undergoing Treatment with Aromatase Inhibitors Calcif. Tissue Int. 2022 111 466 474 10.1007/s00223-022-01011-w 35902384 19. McGee S. Alzahrani M. Vandermeer L. Cole K. Larocque G. Awan A. Hutton B. Pond G. Saunders D. Clemons M. Adjuvant Bisphosphonate Use in Patients with Early Stage Breast Cancer: A Physician Survey Breast Cancer Res. Treat. 2021 187 477 486 10.1007/s10549-021-06147-1 33755864 PMC7985746 20. Brufsky A.M. Harker W.G. Beck J.T. Bosserman L. Vogel C. Seidler C. Jin L. Warsi G. Argonza-Aviles E. Hohneker J. Final 5-Year Results of Z-FAST Trial: Adjuvant Zoledronic Acid Maintains Bone Mass in Postmenopausal Breast Cancer Patients Receiving Letrozole Cancer 2012 118 1192 1201 10.1002/cncr.26313 21987386 21. Eidtmann H. de Boer R. Bundred N. Llombart-Cussac A. Davidson N. Neven P. von Minckwitz G. Miller J. Schenk N. Coleman R. Efficacy of Zoledronic Acid in Postmenopausal Women with Early Breast Cancer Receiving Adjuvant Letrozole: 36-Month Results of the ZO-FAST Study Ann. Oncol. 2010 21 2188 2194 10.1093/annonc/mdq217 20444845 22. Gnant M. Pfeiler G. Dubsky P.C. Hubalek M. Greil R. Jakesz R. Wette V. Balic M. Haslbauer F. Melbinger E. Adjuvant Denosumab in Breast Cancer (ABCSG-18): A Multicentre, Randomised, Double-Blind, Placebo-Controlled Trial Lancet 2015 386 433 443 10.1016/S0140-6736(15)60995-3 26040499 23. Amar I.D. Franceschini G. Nero C. Pasqua I. Paris I. Orlandi A. Gori S. Fabi A. Garganese G. Scambia G. Preventing Bone Loss in Breast Cancer Patients: Designing a Personalized Clinical Pathway in a Large-Volume Research Hospital J. Pers. Med. 2024 14 371 10.3390/jpm14040371 38672998 PMC11051440 24. Abdel-Razeq H. Al-Rasheed U. Mashhadani N. Al-Ibraheem A. Abdel-Razeq R. Jaradeh S.A. Mansour R. Bater R. Tbayshat S. The Efficacy of a Comprehensive Bone Health Program in Maintaining Bone Mineral Density in Postmenopausal Women with Early-Stage Breast Cancer Treated with Endocrine Therapy: Real-World Data Ir. J. Med. Sci. 2022 191 2511 2515 10.1007/s11845-021-02897-5 35088228 25. Lau G. Ibrahim M. O’Brien S. Loiselle C. Bone Fragility Related to Breast Cancer Treatment: The Pivotal Role of Nurses in Bone Health Program Development, Implementation, and Testing Can. Oncol. Nurs. J. 2022 32 401 407 10.5737/23688076323401 38919669 PMC11195586 26. Recine F. Bongiovanni A. Foca F. Mercatali L. Fausti V. Calpona S. Riva N. De Vita A. Liverani C. Spadazzi C. BoOne Heealth Manageement in Patients with Early Breast Cancer: A Retrospective Italian Osteoncology Center “Real-Life” Experience (BOHEME Study) J. Clin. Med. 2019 8 1894 10.3390/jcm8111894 31698876 PMC6912302 27. Ministero della Salute Available online: https://www.salute.gov.it/new/sites/default/files/imported/C_17_pubblicazioni_2251_allegato.pdf (accessed on 10 September 2025) 28. Agenzia del Farmaco Italiana (AIFA) Available online: https://www.aifa.gov.it/nota-79 (accessed on 30 June 2025) 29. Husnoo N. Goonoo M.S. Abbas S. Practical Management of Aromatase Inhibitor-Induced Bone Loss in Breast Cancer Patients Br. J. Med. Pract. 2016 9 a931 30. Waqas K. Lima Ferreira J. Tsourdi E. Body J.J. Hadji P. Zillikens M.C. Updated Guidance on the Management of Cancer Treatment-Induced Bone Loss (CTIBL) in Pre- and Postmenopausal Women with Early-Stage Breast Cancer J. Bone Oncol. 2021 28 100355 10.1016/j.jbo.2021.100355 33948427 PMC8080519 31. Moldovan F. Moldovan L. A Modeling Study for Hip Fracture Rates in Romania J. Clin. Med. 2025 14 3162 10.3390/jcm14093162 40364194 PMC12072267 Figure 1 Patient disposition. * 174 (ICD-9-CM) code refers to malignant neoplasm of female breast (all subcategories). Figure 2 Multivariable Cox proportional-hazards model assessing factors associated with the time to initiation of bone health treatment after surgery. Asterisks indicate levels of statistical significance ** p p Figure 3 ( a b Figure 4 Cumulative incidence plot of adjuvant antiresorptive treatment initiation and competing risk of metastatic progression or death by study group. Stacked cumulative incidence functions are shown for both the control group ( left right Figure 5 Time to initiation of bone health therapy in the subgroups of patients treated with adjuvant chemotherapy. The initiation time was calculated from the start of adjuvant chemotherapy. jcm-14-06564-t001_Table 1 Table 1 Baseline demographics and clinical characteristics of patients before propensity score matching. p  Pre-Matching Characteristics IRST Group Control Group p Median age—years [IQR 1 62 [52; 72] 64 [53; 73] <0.0001 In situ breast cancer 188 (6.0) 637 (13.0) <0.0001 Neoadjuvant chemotherapy 184 (5.9) 201 (4.1) 0.0002 Neoadjuvant hormone therapy 148 (4.8) 99 (2.0) <0.0001 Neoadjuvant supportive medications 2 199 (6.4) 200 (4.1) <0.0001 Antiresorptive therapy ≤ 180 days presurgery 113 (3.6) 168 (3.4) 0.6201 Adjuvant chemotherapy 868 (27.9) 1026 (20.9) <0.0001 Adjuvant hormone therapy 2566 (82.5) 3594 (73.2) <0.0001 Postsurgery supportive medications 2 1007 (32.4) 1045 (21.3) <0.0001 1 2 jcm-14-06564-t002_Table 2 Table 2 Baseline demographics and clinical characteristics of patients after propensity score matching. p  Post-Matching Characteristics IRST Control Group p Median age—years [IQR 1 62 [52; 72] 62 [51; 72] 0.120 In situ breast cancer 188 (6.0) 147 (4.7) 0.021 Neoadjuvant chemotherapy 184 (5.9) 149 (4.8) 0.049 Neoadjuvant hormone therapy 148 (4.8) 97 (3.1) 0.0009 Neoadjuvant supportive medications 2 199 (6.4) 159 (5.1) 0.029 Antiresorptive therapy ≤ 180 days presurgery (≥1 agent) 113 (3.6) 115 (3.7) 0.893 Bisphosphonates 108 (3.5) 110 (3.5) 0.935 Alendronate 76 (2.4) 77 (2.5) 0.157 Risedronate 21 (0.7) 22 (0.7) 0.878 Ibandronate Sodium 11 (0.4) 7 (0.2) 0.345 Zoledronic acid 2 (0.1) 0 (0.0) 0.157 Neridronate Sodium 0 (0.0) 8 (0.3) 0.008 Clodronic Acid 2 (0.1) 0 (0.0) 1.000 Denosumab 5 (0.2) 5 (0.2) 1.000 Adjuvant chemotherapy 868 (27.9) 858 (27.6) 0.777 Adjuvant hormone therapy 2566 (82.5) 2574 (82.7) 0.789 Postsurgery supportive medications 2 1007 (32.4) 981 (31.5) 0.480 Antiresorptive therapy dispensed after surgery (≥1 agent) 945 (30.4) 773 (24.8) <0.0001 Bisphosphonates 863 (27.7) 670 (21.5) <0.0001 Alendronate 665 (21.4) 524 (16.8) <0.0001 Risedronate 170 (5.5) 104 (3.3) <0.0001 Ibandronate Sodium 38 (1.2) 15 (0.5) 0.002 Zoledronate 32 (1.0) 45 (1.4) 0.136 Neridronate Sodium 9 (0.3) 8 (0.3) 0.808 Clodronic Acid 2 (0.1) 3 (0.9) 0.655 Denosumab 120 (3.9) 161 (5.2) 0.012 Median Time 3 1 NA (927; NA) NA (1255; NA) 0.0003 1 2 3 jcm-14-06564-t003_Table 3 Table 3 Multivariable logistic regression model evaluating factors associated with the initiation of bone health treatment. Odds Ratios (ORs), standard error (SE), 95% confidence interval (CI), Z-values, and p Parameter Odds Ratio SE 95% CI Z p Lower Limit Upper Limit (Intercept) 0.026 0.007 0.016 0.042 −14.343 <0.0001 Site (IRST vs. Control group) 1.393 0.085 1.236 1.571 5.431 <0.0001 Tumour type (invasive vs. in situ) 1.766 0.331 1.237 2.585 3.032 0.0024 Age 1.004 0.002 0.999 1.008 1.519 0.1288 Previous anti-OP treatment 61.557 16.900 37.091 109.490 15.007 <0.0001 Postsurgery chemotherapy 1.470 0.147 1.209 1.789 3.853 0.0001 Postsurgery hormone therapy 4.887 0.574 3.902 6.188 13.501 <0.0001 Postsurgery supportive therapy 1.349 0.130 1.116 1.628 3.107 0.0019 jcm-14-06564-t004_Table 4 Table 4 Fine–Gray competing risk regression for time to antiresorptive treatment initiation and for metastatic progression or death. Subdistribution hazard ratios (sHRs) with 95% confidence intervals (CIs) and p Fine and Gray Model Antiresorptive Treatment Initiation Metastatic Disease/Death Parameter sHR 95% CI p sHR 95% CI p Lower Limit Upper Limit Lower Limit Upper Limit CTIBL prevention facility 1.218 1.095 1.355 0.0003 0.965 0.815 1.142 0.670 Age 1.006 1.002 1.010 0.003 1.058 1.048 1.068 <0.0001 Tumour type (invasive vs. in situ) 1.127 0.852 1.491 0.400 1.974 1.005 3.874 0.048 Previous antiresorptive treatment 18.506 14.453 23.698 <0.0001 0.219 0.108 0.444 <0.0001 Postsurgery hormone therapy 2.770 2.249 3.411 <0.0001 0.463 0.382 0.562 <0.0001 ",
  "metadata": {
    "Title of this paper": "A Modeling Study for Hip Fracture Rates in Romania",
    "Journal it was published in:": "Journal of Clinical Medicine",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12470544/"
  }
}