{
  "title": "Paper_1002",
  "abstract": "pmc Molecules Molecules 3416 molecules molecules Molecules 1420-3049 Multidisciplinary Digital Publishing Institute  (MDPI) PMC12472669 PMC12472669.1 12472669 12472669 41011618 10.3390/molecules30183726 molecules-30-03726 1 Article Multimodal Detection of Magnetically and Fluorescently Dual-Labeled Murine Macrophages After Intravenous Administration https://orcid.org/0000-0002-4251-3002 Gabashvili Anna N. Conceptualization Methodology Formal analysis Investigation Data curation Writing – original draft Writing – review & editing 1 2 Znoyko Sergey L. Conceptualization Methodology Investigation Writing – original draft Writing – review & editing 1 https://orcid.org/0000-0003-3488-1128 Ryabova Anastasia V. Conceptualization Investigation Writing – original draft Writing – review & editing 1 https://orcid.org/0000-0002-3157-7158 Mochalova Elizaveta N. Investigation Writing – review & editing Funding acquisition 3 4 Griaznova Olga Yu. Formal analysis Investigation Writing – review & editing 5 Tortunova Tatiana A. Formal analysis Investigation Writing – review & editing 2 Sheveleva Olga N. Investigation Data curation Writing – review & editing 2 Butorina Nina N. Methodology Formal analysis Writing – review & editing 2 https://orcid.org/0009-0008-5419-5217 Kuziaeva Valeriia I. Methodology Investigation Writing – review & editing 2 Lyadova Irina V. Conceptualization Resources Writing – original draft Writing – review & editing Supervision Project administration Funding acquisition 2 * https://orcid.org/0000-0003-1573-5512 Nikitin Petr I. Writing – original draft Writing – review & editing Supervision Project administration Funding acquisition 1 * Li Haidong Academic Editor Liu Haiying Academic Editor 1 gabashvili_a@nsc.gpi.ru znoykos@yandex.ru nastya.ryabova@nsc.gpi.ru 2 t.tortunova@gmail.com kuzyaeva.valeriya@mail.ru 3 4 5 griaznova.oly@gmail.com * ivlyadova@mail.ru nikitin@kapella.gpi.ru 12 9 2025 9 2025 30 18 496804 3726 21 7 2025 19 8 2025 10 9 2025 12 09 2025 27 09 2025 29 09 2025 © 2025 by the authors. 2025 https://creativecommons.org/licenses/by/4.0/ Licensee MDPI, Basel, Switzerland. This article is an open access article distributed under the terms and conditions of the Creative Commons Attribution (CC BY) license ( https://creativecommons.org/licenses/by/4.0/ A variety of cells can be applied as vectors for the targeted delivery of chemotherapeutic or gene therapeutic agents to neoplasms. Macrophages are regarded as promising candidates for cell-based therapy. Accurate assessments of the efficacy and safety profiles of cell-based therapy products require the collection of data on their biodistribution and fate. The study of living cell distribution in vivo necessitates the utilization of a combination of methodologies to obtain more precise data regarding the fate of cells after their administration into animals. In the present study, a murine RAW 264.7 cell line was engineered to express enhanced green fluorescent protein (GFP). These cells were labeled with 50 nm magnetic nanoparticles (MNPs) for non-invasive real-time monitoring in mice using the magnetic particle quantification (MPQ) technique. The combination of high sensitivity and multimodality of the approach used permitted the acquisition of comprehensive data on the biodistribution of RAW-GFP cells in mice. For the first time, non-invasive, real-time monitoring of the dynamics of MNP-loaded macrophages in the bloodstream of mice has been achieved via the MPQ technique. Following intravenous administration, the cells are rapidly eliminated from the bloodstream, with subsequent accumulation mainly in the lungs and the liver. This may impose limitations on the use of such cells for drug delivery to other regions of a living organism. macrophages biodistribution magnetic nanoparticles multimodal imaging biodiagnostics non-invasive monitoring magnetic particle quantification Ministry of Science and Higher Education of the Russian Federation 075-03-2025-662 IDB RAS Government basic research program 0088-2024-0013 Russian Science Foundation 25-12-00373 Different aspects and parts of this multidisciplinary research were partially supported by a grant from the Ministry of Science and Higher Education of the Russian Federation, agreement number 075-03-2025-662, project FSMG-2023-0017 (optical visualization), the IDB RAS Government basic research program № 0088-2024-0013 (cell culture, lentiviral vectors assembly, the generation of RAW-GFP cell line, animal studies, histology, and flow cytometry analysis), and the Russian Science Foundation, grant No. 25-12-00373 (development of magnetic particle quantification tools and methodology and application for analysis of cell and tissue samples). pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement yes pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes 1. Introduction The potential of cell therapy approaches for the treatment of various diseases, including neoplastic [ 1 2 3 4 5 6 7 8 9 10 11 12 13 14 15 16 Due to their natural ability to perform phagocytosis, macrophages can be readily loaded by various exogenous labels, including fluorescent and magnetic ones. A plethora of options exists for such an approach, and the particles utilized can be nano- and micro-sized. Sapach and co-authors [ 17 18 19 20 21 22 23 24 In the context of studies employing laboratory animals, superparamagnetic iron oxide nanoparticles (SPIONs) are frequently used due to their T2 contrast properties, which facilitate the observation of macrophage distribution through magnetic resonance imaging (MRI) analysis. For instance, SPIONs have been applied to target M2 macrophages and reverse their polarization to the M1 phenotype [ 25 26 The tracking of macrophages can also be accomplished using positron emission tomography (PET) imaging. In a particular study [ 27 28 29 30 31 A number of stable macrophage cell lines have been generated using lentiviral and adenoviral transduction [ 32 33 34 In the present study, we have combined optical and magnetic techniques for the labeling of macrophages. Optical labeling was accomplished thought the use of the enhanced GFP, stably expressed in the RAW-GFP macrophage cells. This labeling facilitated the detection of the fluorescent signal of the administered cells in various tissues using confocal microscopy and optical tomography. As a complementary label, we employed 50 nm glucuronic acid-coated iron oxide magnetic nanoparticles (MNPs). The detection of the fluorescent label necessitated the preparation of tissue suspensions or histological sections. Conversely, MNP-labeled macrophages could be detected noninvasively in vivo in the bloodstream using the magnetic particle quantification (MPQ) technique, as well as ex vivo by the accumulation of intracellular iron. The utilization of a dual-labeling strategy, integrated the two aforementioned approaches, has been demonstrated to facilitate real-time monitoring of the labeled macrophages in mice. Following intravenous administration, the macrophages are rapidly eliminated from the bloodstream and accumulate mainly in the liver and the lungs. In the context of potential applications of macrophages in cell-based therapy, the rapid clearance of cells from the bloodstream, together with their subsequent accumulation in the lungs and the liver, limits the use of such a delivery strategy for targets located elsewhere in the organism. 2. Results and Discussion 2.1. Establishment of the RAW-GFP Cell Line and MNPs Uptake by the Obtained Cells In the present study, an immortalized macrophage-like cell line was utilized, which was characterized by rapid proliferation yet possessed numerous characteristics of primary macrophages. In order to obtain a cell line with a stably expressed fluorescent label, a lentiviral vector was constructed. This vector carried genes that encode for GFP and puromycin resistance. Our data indicated that a short GFP transgene sequence could be integrated into the genome with a single round of transduction with subsequent selection. As illustrated in Figure 1 + Figure 1 As previously stated, MNPs were used as a complementary label. We employed an aqueous solution of glucuronic acid-coated iron oxide MNPs (a representative TEM image of the MNPs is shown in Supplementary Figure S1 35 36 37 Figure 1 Supplementary Figure S2 Subsequently, a dynamic assessment of MNP accumulation by macrophages was performed via an evaluation of iron accumulation in the cells using Perls staining ( Figure 1 Figure 1 Given the superparamagnetic properties of the MNPs, the dynamics of their uptake by the cells were quantified by the MPQ method. For this purpose, the cells were exposed to MNPs for various durations (15 min, 30 min, 1 h, and 2 h). Thereafter, the unbound MNPs were eliminated from the cells through a series of centrifugation and washing steps. The cuvettes containing cell-bond nanoparticles were positioned inside the measuring coil of the MPQ device. The magnitude of the normalized magnetic signals ( Figure 1 6 The obtained results are in good agreement with the data acquired when assessing the iron amount in MNP-labeled RAW-GFP cells using ICP-MS and Perls staining. 2.2. Multimodal Detection of MNP-Labeled Macrophages In Vivo and Ex Vivo The subsequent task was to investigate the in vivo distribution of dual-labeled RAW-GFP cells after intravenous administration. Two commonly used routes of administration were selected for this study: the lateral tail vein and the retro-orbital venous sinus [ 38 39 Figure 2 Figure 2 40 41 42 43 44 The distribution of MNP-labeled cells was examined in the kidneys, lungs, spleen, and liver, as well as in the blood collected 2 h after the administration of RAW-GFP cells. According to the MPQ measurements, the cells were predominantly detected in the lungs and the liver, and significantly weaker signals were also noted in the spleen. No statistically significant differences were revealed between the “tail vein” and “retro-orbital” groups ( Figure 2 45 46 An optical imaging system was employed to detect the fluorescent signal in organs exhibiting high magnetic signals, including the lungs, the liver, and the spleen ( Figure 2 Supplementary Figure S3 47 The cells’ short circulation time and subsequent accumulation in the lungs and the liver may limit the ability of such cells to deliver drugs to targets located in other areas of the living organism. In order to enhance the capacity of the cells for drug delivery, it is necessary to develop advanced methods that can increase the circulation time of the cells in the bloodstream, similar to the principle realized for nanoparticles [ 48 2.3. Histological Analysis of MNP-Loaded Cell Distribution The detection of fluorescent signals in isolated organs may be complicated by several factors, including an uneven distribution of the administered cells in the tissue, the peculiarities of light propagation, and the presence of different autofluorescence signals in the organs. Therefore, a histological examination of the sections was conducted to facilitate a comparative analysis with the data obtained by the MPQ technique. Figure 3 Supplementary Figure S4 Figure 3 Figure 3 Figure 3 Supplementary Figure S4 Laser scanning confocal microscopy was employed to visualize MNP-labeled RAW-GFP cells in the lung histological sections ( Figure 4 Supplementary Figure S5a,b Representative confocal images of the kidney and the spleen are shown in Supplementary Figure S6a,b It should be mentioned that despite the extensive infiltration of the lung tissue by MNP-labeled RAW-GFP macrophages, no side effects such as dyspnea/respiratory arrest or any other signs of lung injury were observed in the animals throughout the study. To assess potential tissue damage in MNP-labeled RAW-GFP-enriched organs, a thorough analysis of all sections of the lung, liver, and spleen was conducted. The analysis revealed no evidence of tissue alterations, such as microhemorrhages or vascular occlusion by cells, in any of the sections examined. Given that the accumulation of cells occurs mainly in the lungs, the resulting cells can be supplemented with a chemotherapeutic drug, or other transgenic sequences can be integrated into the cell genome to produce CAR (chimeric antigen receptor) macrophages that can be used for the therapy of pulmonary metastases. Conversely, given the short circulation time of the cells in the bloodstream after intravenous administration, it should be considered that the efficacy of such a delivery strategy may be limited in the treatment of malignant neoplasms of other localizations. 3. Materials and Methods 3.1. Materials The following reagents were used: Roswell Park Memorial Institute (RPMI) 1640 medium, Dulbecco’s Modified Eagle Medium (DMEM), l 3.2. Cell Lines and Culture RAW 264.7 cells were cultured in RPMI-1640 medium supplemented with 5% FBS, 1% penicillin/streptomycin, and 2 mM l 2 l 3.3. Lentiviral Vector Construction and the Generation of GFP-Expressing RAW 264.7 Cells Lentiviral vectors were assembled using the HEK293T packaging cell line. The cells were seeded into 6-well plates and cultured in full DMEM at 37 °C and 5% CO 2 49 The transduction of RAW 264.7 cells with a lentiviral vector was performed using a standard protocol. Briefly, the cells were cultured in RPMI-1640 medium, supplemented with 10% heat-inactivated FBS, 2 mM l 3.4. Fluorescent Microscopy Fluorescent micrographs of RAW-GFP cells were captured with the FLoid Cell Imaging Station (Thermo Fisher Scientific, Waltham, MA, USA). 3.5. Flow Cytometry GFP expression in RAW-GFP cells was assessed using a CytoFLEX S Flow Cytometer (BD Biosciences, Franklin Lakes, NJ, USA) and the CytEXPERT v. 2.4.0.28 software (Beckman Coulter, Brea, CA, USA). The results were analyzed using the FlowJo v. 10.8.1 software (TreeStar, BD Bioscience, Franklin Lakes, NJ, USA). 3.6. Cytotoxicity Assay The impact of fluidMAG-ARA MNPs on the viability of RAW-GFP cells was evaluated using the resazurin assay according to the manufacturer’s instructions. The RAW-GFP cells were seeded into the wells of a 96-well opaque culture plate at a density of 1 × 10 5 2 em N = (A s b c b s b c 3.7. Prussian Blue Staining of Cells and Tissue Sections After 15 min, 30 min, 1 h, and 2 h of incubation of RAW-GFP cells with MNPs at a concentration of 200 µg/mL, the cells were washed with PBS and fixed with 4% paraformaldehyde in PBS. Subsequently, the cells were washed with deionized water and stained using an Iron Staining Kit (Biovitrum, Moscow, Russia). Afterwards, the cells were washed again with deionized water. Paraffin-embedded 5 µm sections of lungs, liver, kidneys, and spleen were stained by Prussian blue for detecting the MNP-labeled RAW-GFP cells according to the protocol described above. Images were taken using a CX41 FLLED light microscope (Ningbo Sunny Instruments, Yuyao City, China). 3.8. Inductively Coupled Plasma Mass Spectrometry (ICP-MS) After 15 min, 30 min, 1 h, and 2 h of incubation of RAW-GFP cells with MNPs (200 µg/mL), the cells were thoroughly washed with PBS, detached from the plastic using the trypsin solution, and pelleted by centrifugation before counting. Each cell sample (3 × 10 6 3.9. Magnetic Particle Quantification (MPQ) Real-time detection of magnetic nanoparticles in cell pellets, isolated organs, and non-invasively in the bloodstream was carried out using an updated device with a high temporal resolution of up to 1 s based on the magnetic particle quantification (MPQ) method [ 50 51 f 1 f 2 f 2 f 1 3.10. Animals Six- to eight-week-old female BALB/c mice (15–25 g) were obtained from the Stolbovaya animal facility, a branch of the Scientific Center for Biomedical Technologies of the Federal Medical and Biological Agency of the RF. The mice were housed in a temperature-controlled facility under a 12 h photoperiod, no more than ten per cage. The mice were given food and water ad libitum. 3.11. Histological Study After 2 h of incubation of RAW-GFP cells with MNPs (200 µg/mL), the cells were washed with PBS, detached with a cell scraper, counted, and injected into the tail vein or the retro-orbital venous sinus of mice (3 × 10 6 3.12. Optical Tomography Fluorescent images of mouse organs extracted 2 hours after injection of RAW-GFP cells were received via LumoTrace FLUO bioimaging system (Abisense, Sirius, Russia) using 450 and 470 nm diodes and a 550+ nm filter with an exposure time of 100 ms. 3.13. Laser Scanning Confocal Microscopy Fluorescence microscopy analysis of the paraffin-embedded tissue sections was performed using an LSM-710 laser scanning confocal microscope (Carl Zeiss Microscopy, Oberkochen, Germany), with a 20× Plan-Apochromat objective (NA = 0.8). The linear separation mode was implemented by recording fluorescence with a 32-channel GaAsP detector and separating that signal into contributions from the GFP (green channel) and autofluorescence (gray channel) spectra, pre-registered in the spectral range of 500–650 nm with excitation by a laser at a wavelength of 488 nm. The DAPI fluorescence was excited at 720 nm (two-photon excitation), using a femtosecond laser (Chameleon Ultra II, Coherent, USA), and was detected in the range from 400 to 500 nm. The 3D fluorescence images were acquired with a step of 1 µm along the Z-axis and reconstructed using the ZEN v. 1.1.2.0 software (Carl Zeiss Microscopy, Oberkochen, Germany). As a result, an overlay of GFP fluorescence, autofluorescence, and DAPI fluorescence 3D images was obtained. 3.14. Statistical Analysis All experiments were performed at least in triplicate. The statistical analysis was performed using the Prism v.6 software (GraphPad, Boston, MA, USA). The significance of the differences was evaluated using one-way ANOVA followed by Dunnett’s post hoc test. Where relevant, a two-tailed unpaired t p 4. Conclusions In this study, murine RAW macrophages were stably modified with GFP-encoding genes and additionally labeled with 50 nm MNPs before intravenous and retro-orbital venous sinus administration to mice. The internalization of MNPs in the obtained cells was dynamically assessed after 15 min, 30 min, 1 h, and 2 h of incubation with RAW-GFP cells by the MPQ technique, ICP-MS, and Perls reaction. It has been demonstrated that the accumulation of MNPs in the cells occurs in a time-dependent manner. The toxicity of MNPs was assessed through the implementation of the resazurin assay, which revealed no pronounced toxic effect. The quantity of MNP-loaded macrophage cells in the circulation was recorded in real time via the MPQ technique to provide non-invasive monitoring of the distribution dynamics of the MNP-loaded RAW-GFP cells in mice. It has been found that the cells rapidly clear from the bloodstream (within 10–15 s), with subsequent accumulation mainly in the lungs and the liver. The data obtained with the MPQ device were corroborated by histological examination of organ sections that had been stained with Prussian blue. The iron-positive cells were predominantly detected in the lungs and the liver. The distribution pattern of cells observed through confocal microscopy exhibited a high degree of similarity to that detected by Prussian blue staining. In order to enhance the efficacy of drug delivery by cells to other organs, it is imperative to explore advanced methodologies for prolonging the circulation time of these carriers. Acknowledgments We would like to thank Natasha Grigorian for her help with proofreading the manuscript. Disclaimer/Publisher’s Note: Supplementary Materials The following supporting information can be downloaded at https://www.mdpi.com/article/10.3390/molecules30183726/s1 Author Contributions Conceptualization, A.N.G., S.L.Z., A.V.R., and I.V.L.; Data curation, A.N.G. and O.N.S.; Formal analysis, A.N.G., O.Y.G., T.A.T., and N.N.B.; Funding acquisition, E.N.M., I.V.L., and P.I.N.; Investigation, A.N.G., S.L.Z., A.V.R., E.N.M., O.Y.G., T.A.T., O.N.S., and V.I.K.; Methodology, A.N.G., S.L.Z., N.N.B., and V.I.K.; Project administration, I.V.L. and P.I.N.; Resources, I.V.L.; Supervision, I.V.L. and P.I.N.; Writing—original draft, A.N.G., S.L.Z., A.V.R., I.V.L., and P.I.N.; Writing—review and editing, A.N.G., S.L.Z., A.V.R., E.N.M., O.Y.G., T.A.T., O.N.S., N.N.B., V.I.K., I.V.L., and P.I.N. All authors have read and agreed to the published version of the manuscript. Institutional Review Board Statement All animal procedures were performed in accordance with the guidelines for the care and use of laboratory animals of the Koltzov Institute of Developmental Biology, Russian Academy of Science (IDB RAS) and approved by the Ethics Committee of IDB RAS (protocol № 89 from 30 January 2025). Informed Consent Statement Not applicable. Data Availability Statement Data are contained within the article and Supplementary Materials Conflicts of Interest P.I.N. is a named inventor of the patents on MPQ. E.N.M. is stakeholder of Abisense LLC, which manufactures the LumoTrace FLUO bioimaging system. References 1. Shaim H. Shanley M. Basar R. Daher M. Gumin J. Zamler D.B. Uprety N. Wang F. Huang Y. Gabrusiewicz K. Targeting the Alphav Integrin/TGF-Beta Axis Improves Natural Killer Cell Function Against Glioblastoma Stem Cells J. Clin. Investig. 2021 131 142116 10.1172/JCI142116 34138753 PMC8279586 2. Albelda S.M. CAR T Cell Therapy for Patients with Solid Tumours: Key Lessons to Learn and Unlearn Nat. Rev. Clin. Oncol. 2024 21 47 66 10.1038/s41571-023-00832-4 37904019 3. Zhang J. Hu Y. Yang J. Li W. Zhang M. Wang Q. Zhang L. Wei G. Tian Y. Zhao K. Non-Viral, Specifically Targeted CAR-T Cells Achieve High Safety and Efficacy in B-NHL Nature 2022 609 369 374 10.1038/s41586-022-05140-y 36045296 PMC9452296 4. Gabashvili A.N. Vasiukova A.A. Rakitina A.S. Garanina A.S. The Issue on Dualistic Role of Neutrophils in Carcinogenesis and Their Possible Use for Treatment of Malignant Neoplasms Biochemistry 2025 90 303 320 10.1134/S000629792460368X 40367075 5. Cha Y. Park T.Y. Leblanc P. Kim K.S. Current Status and Future Perspectives on Stem Cell-Based Therapies for Parkinson’s Disease J. Mov. Disord. 2023 16 22 41 10.14802/jmd.22141 36628428 PMC9978267 6. Baloh R.H. Johnson J.P. Avalos P. Allred P. Svendsen S. Gowing G. Roxas K. Wu A. Donahue B. Osborne S. Transplantation of Human Neural Progenitor Cells Secreting GDNF Into the Spinal Cord of Patients with ALS: A Phase 1/2a Trial Nat. Med. 2022 28 1813 1822 10.1038/s41591-022-01956-3 36064599 PMC9499868 7. Revah O. Gore F. Kelley K.W. Andersen J. Sakai N. Chen X. Li M.Y. Birey F. Yang X. Saw N.L. Maturation and Circuit Integration of Transplanted Human Cortical Organoids Nature 2022 610 319 326 10.1038/s41586-022-05277-w 36224417 PMC9556304 8. Sung P.H. Chiang H.J. Li Y.C. Chiang J.Y. Chu C.H. Shao P.L. Lee F.Y. Lee M.S. Yip H.K. Baseline Factors Identified for the Prediction of Good Responders in Patients with end-Stage Diffuse Coronary Artery Disease Undergoing Intracoronary CD34+ Cell Therapy Stem Cell Res. Ther. 2020 11 324 10.1186/s13287-020-01835-z 32727585 PMC7391819 9. Makkar R.R. Kereiakes D.J. Aguirre F. Kowalchuk G. Chakravarty T. Malliaras K. Francis G.S. Povsic T.J. Schatz R. Traverse J.H. Intracoronary ALLogeneic Heart Stem Cells to Achieve Myocardial Regeneration (ALLSTAR): A Randomized, Placebo-Controlled, Double-Blinded Trial Eur. Heart J. 2020 41 3451 3458 10.1093/eurheartj/ehaa541 32749459 10. Bolli R. Mitrani R.D. Hare J.M. Pepine C.J. Perin E.C. Willerson J.T. Traverse J.H. Henry T.D. Yang P.C. Murphy M.P. A Phase II Study of Autologous Mesenchymal Stromal Cells and C-Kit Positive Cardiac Cells, Alone or in Combination, in Patients with Ischaemic Heart Failure: The CCTRN CONCERT-HF Trial Eur. J. Heart Fail. 2021 23 661 674 10.1002/ejhf.2178 33811444 PMC8357352 11. Huang Y. Guan Z. Dai X. Shen Y. Wei Q. Ren L. Jiang J. Xiao Z. Jiang Y. Liu D. Engineered Macrophages as Near-Infrared Light Activated Drug Vectors for Chemo-Photodynamic Therapy of Primary and Bone Metastatic Breast Cancer Nat. Commun. 2021 12 4310 10.1038/s41467-021-24564-0 34262026 PMC8280231 12. Wang Y. Zhang L. Liu Y. Tang L. He J. Sun X. Younis M.H. Cui D. Xiao H. Gao D. Engineering CpG-ASO-Pt-Loaded Macrophages (CAP@M) for Synergistic Chemo-/Gene-/Immuno-Therapy Adv. Healthc. Mater. 2022 11 2201178 10.1002/adhm.202201178 35668035 PMC9664705 13. Taciak B. Bialasek M. Kubiak M. Marszalek I. Gorczak M. Osadchuk O. Kurpiel D. Strzemecki D. Barwik K. Skorzynski M. Harnessing Macrophage-Drug Conjugates for Allogeneic Cell-Based Therapy of Solid Tumors via the TRAIN Mechanism Nat. Commun. 2025 16 1327 10.1038/s41467-025-56637-9 39900573 PMC11790938 14. Lendeckel U. Venz S. Wolke C. Macrophages: Shapes and Functions Chem. Texts 2022 8 12 10.1007/s40828-022-00163-4 PMC8907910 35287314 15. Christofides A. Strauss L. Yeo A. Cao C. Charest A. Boussiotis V.A. The complex role of tumor-infiltrating macrophages Nat. Immunol. 2022 23 1148 1156 10.1038/s41590-022-01267-2 35879449 PMC10754321 16. Guan F. Wang R. Yi Z. Luo P. Liu W. Xie Y. Liu Z. Xia Z. Zhang H. Cheng Q. Tissue Macrophages: Origin, Heterogenity, Biological Functions, Diseases and Therapeutic Targets Signal Transduct. Target Ther. 2025 10 93 10.1038/s41392-025-02124-y 40055311 PMC11889221 17. Sapach A.Y. Sindeeva O.A. Nesterchuk M.V. Tsitrina A.A. Mayorova O.A. Prikhozhdenko E.S. Verkhovskii R.A. Mikaelyan A.S. Kotelevtsev Y.V. Sukhorukov G.B. Macrophage In Vitro and In Vivo Tracking via Anchored Microcapsules ACS Appl. Mater. Interfaces 2022 14 51579 51592 10.1021/acsami.2c12004 36367877 18. Gabashvili A.N. Chmelyuk N.S. Sarkisova V.A. Melnikov P.A. Semkina A.S. Nikitin A.A. Abakumov M.A. Myxococcus xanthus Int. J. Mol. Sci. 2022 23 15591 10.3390/ijms232415591 36555233 PMC9778880 19. Gabashvili A.N. Alexandrushkina N.A. Mochalova E.N. Goliusova D.V. Sapozhnikova E.N. Makarevich P.I. Nikitin P.I. Internalization of Transferrin-Tagged Myxococcus xanthus Exp. Biol. Med. 2024 249 10055 10.3389/ebm.2024.10055 PMC11106444 38774281 20. Nichols J.M. Crelli C.V. Liu L. Pham H.V. Janjic J.M. Shepherd A.J. Tracking Macrophages in Diabetic Neuropathy with Two-Color Nanoemulsions for Near-Infrared Fluorescent Imaging and Microscopy J. Neuroinflamm. 2021 18 299 10.1186/s12974-021-02365-y PMC8697472 34949179 21. Tang S. Guo Y. Yang Y. Li Y. Gao Y. Zhang C. Xiong L. High Resolution Tracking of Macrophage Cells in Deep Organs and Lymphatics Using Fluorescent Polymer Dots RSC Adv. 2019 9 10966 10975 10.1039/C9RA00954J 35515275 PMC9062640 22. Lin Z.P. Nguyen L.N.M. Ouyang B. MacMillan P. Ngai J. Kingston B.R. Mladjenovic S.M. Chan W.C.W. Macrophages Actively Transport Nanoparticles in Tumors After Extravasation ACS Nano 2022 16 6080 6092 10.1021/acsnano.1c11578 35412309 23. Chu T. Zheng X. Manshian B.B. Soenen S.J. Optical Imaging in Biomedical Research: Guidelines and Practical Insights Health Nanotechnol. 2025 1 4 10.1186/s44301-025-00004-6 24. Miller D.A. Xu Y. Highland R. Nguyen V.T. Brown W.J. Hong G. Yao J. Wax A. Enhanced Penetration Depth in Optical Coherence Tomography and Photoacoustic Microscopy In Vivo Enabled by Absorbing Dye Molecules Optica 2025 12 24 30 10.1364/OPTICA.546779 25. Zhou Y. Que K.T. Tang H.M. Zhang P. Fu Q.M. Liu Z.J. Anti-CD206 Antibody-Conjugated Fe(3)O(4)-Based PLGA Nanoparticles Selectively Promote Tumor-Associated Macrophages to Polarize to the Pro-Inflammatory Subtype Oncol. Lett. 2020 20 298 10.3892/ol.2020.12161 33101492 PMC7577077 26. Santana J.G. Petukhova-Greenstein A. Gross M. Hyder F. Pekurovsky V. Gottwald L.A. Boustani A. Walsh J.J. Kucukkaya A.S. Malpani R. MR Imaging-Based In Vivo Macrophage Imaging to Monitor Immune Response after Radiofrequency Ablation of the Liver J. Vasc. Interv. Radiol. 2023 34 395 403 10.1016/j.jvir.2022.11.013 36423815 PMC11042914 27. Jeong H.J. Yoo R.J. Kim J.K. Kim M.H. Park S.H. Kim H. Lim J.W. Do S.H. Lee K.C. Lee Y.J. Macrophage Cell Tracking PET Imaging Using Mesoporous Silica Nanoparticles via In Vivo Bioorthogonal F-18 Labeling Biomaterials 2019 199 32 39 10.1016/j.biomaterials.2019.01.043 30735894 28. Toner Y.C. Prevot G. van Leent M.M.T. Munitz J. Oosterwijk R. Verschuur A.V.D. van Elsas Y. Peric V. Maas R.J.F. Ranzenigo A. Macrophage PET Imaging in Mouse Models of Cardiovascular Disease and Cancer with an Apolipoprotein-Inspired Radiotracer Npj Imaging 2024 2 12 10.1038/s44303-024-00009-3 38765879 PMC11096117 29. Varasteh Z. Braeuer M. Mohanta S. Steinsiek A.L. Habenicht A. Omidvari N. Topping G.J. Rischpler C. Weber W.A. Sager H.B. In vivo Visualization of M2 Macrophages in the Myocardium After Myocardial Infarction (MI) Using (68) Ga-NOTA-Anti-MMR Nb: Targeting Mannose Receptor (MR, CD206) on M2 Macrophages Front. Cardiovasc. Med. 2022 9 889963 10.3389/fcvm.2022.889963 35548425 PMC9081970 30. Chiou A.E. Hinckley J.A. Khaitan R. Varsano N. Wang J. Malarkey H.F.t. Hernandez C.J. Williams R.M. Estroff L.A. Weiner S. Fluorescent Silica Nanoparticles to Label Metastatic Tumor Cells in Mineralized Bone Microenvironments Small 2021 17 2001432 10.1002/smll.202001432 PMC7704907 32462807 31. Harizaj A. Descamps B. Mangodt C. Stremersch S. Stoppa A. Balcaen L. Brans T. De Rooster H. Devriendt N. Fraire J.C. Cytosolic Delivery of Gadolinium via Photoporation Enables Improved In Vivo Magnetic Resonance Imaging of Cancer Cells Biomater. Sci. 2021 9 4005 4018 10.1039/D1BM00479D 33899850 32. Chen Y. Wang J. Zhou N. Fang Q. Cai H. Du Z. An R. Liu D. Chen X. Wang X. Protozoan-Derived Cytokine-Transgenic Macrophages Reverse Hepatic Fibrosis Adv. Sci. 2024 11 2308750 10.1002/advs.202308750 38247166 PMC10987136 33. Choi J.U. Kim Y. Lee D.Y. Park J.S. Jeun M. Lee H.K. Park C.H. Lentivirus-Based Production of Human Chimeric Antigen Receptor Macrophages from Peripheral Blood Biomark. Res. 2025 13 1 10.1186/s40364-024-00703-9 39748414 PMC11697635 34. Klimak M. Cimino A. Lenz K.L. Springer L.E. Collins K.H. Harasymowicz N.S. Xu N. Pham C.T.N. Guilak F. Engineered Self-Regulating Macrophages for Targeted Anti-Inflammatory Drug Delivery Arthritis Res. Ther. 2024 26 190 10.1186/s13075-024-03425-3 39501398 PMC11539832 35. Zelepukin I.V. Yaremenko A.V. Ivanov I.N. Yuryev M.V. Cherkasov V.R. Deyev S.M. Nikitin P.I. Nikitin M.P. Long-Term Fate of Magnetic Particles in Mice: A Comprehensive Study ACS Nano 2021 15 11341 11357 10.1021/acsnano.1c00687 34250790 36. Yaremenko A.V. Zelepukin I.V. Ivanov I.N. Melikov R.O. Pechnikova N.A. Dzhalilova D.S. Mirkasymov A.B. Bragina V.A. Nikitin M.P. Deyev S.M. Influence of Magnetic Nanoparticle Biotransformation on Contrasting Efficiency and Iron Metabolism J. Nanobiotechnol. 2022 20 535 10.1186/s12951-022-01742-w PMC9758463 36528614 37. Zelepukin I.V. Yaremenko A.V. Yuryev M.V. Mirkasymov A.B. Sokolov I.L. Deyev S.M. Nikitin P.I. Nikitin M.P. Fast Processes of Nanoparticle Blood Clearance: Comprehensive Study J. Control. Release 2020 326 181 191 10.1016/j.jconrel.2020.07.014 32681949 38. Applegate C.C. Nelappana M.B. Cui Y. Okoro G. Nielsen E.A. Dovalovsky N.P. Smith A.M. Dobrucki I.T. Dobrucki L.W. Biodistribution of PET Radiotracers in Tumor-Bearing TRAMP Mice Administered by Retroorbital or Jugular Vein Injections Sci. Rep. 2024 14 20241 10.1038/s41598-024-71221-9 39215130 PMC11364845 39. Li Z. LoBue A. Heuser S.K. Li J. Engelhardt E. Papapetropoulos A. Patel H.H. Lilley E. Ferdinandy P. Schulz R. Best Practices for Blood Collection and Anaesthesia in Mice: Selection, Application and Reporting Br. J. Pharmacol. 2025 182 2337 2353 10.1111/bph.70029 40234101 40. Welsher K. Sherlock S.P. Dai H. Deep-Tissue Anatomical Imaging of Mice Using Carbon Nanotube Fluorophores in the Second Near-Infrared Window Proc. Natl. Acad. Sci. USA 2011 108 8943 8948 10.1073/pnas.1014501108 21576494 PMC3107273 41. Tang M. Zhou Y.Q. Blaser M.C. Steinman D.A. Simmons C.A. Ultrasound Image Velocimetry for High Spatiotemporal Resolution Blood Flow Velocity Field Mapping in Mice Ultrasound Med. Biol. 2025 51 841 851 10.1016/j.ultrasmedbio.2025.01.012 39971688 42. Bailly A.L. Correard F. Popov A. Tselikov G. Chaspoul F. Appay R. Al-Kattan A. Kabashin A.V. Braguer D. Esteve M.A. In Vivo Evaluation of Safety, Biodistribution and Pharmacokinetics of Laser-Synthesized Gold Nanoparticles Sci. Rep. 2019 9 12890 10.1038/s41598-019-48748-3 31501470 PMC6734012 43. Huang Y. Hao X. Lin Z. Li L. Jiang H. Zhang H. Geng X. Zhu H. Wen H. Bio-Distribution and Toxicity Potential of Human Umbilical Cord Mesenchymal Stem Cells in Cynomolgus Monkeys Sci. Rep. 2024 14 12251 10.1038/s41598-024-63118-4 38806615 PMC11133417 44. Nikitin M.P. Orlov A.V. Sokolov I.L. Minakov A.A. Nikitin P.I. Ding J. Bader S.D. Rozhkova E.A. Novosad V. Ultrasensitive Detection Enabled by Nonlinear Magnetization of Nanomagnetic Labels Nanoscale 2018 10 11642 11650 10.1039/C8NR01511B 29896612 45. da Conceicao Mendonca J. Lumsdaine S. Burcham L.R. Comparison of Lateral Tail Vein and Retro-Orbital Venous Sinus as Routes of Inoculation to Study Group B Streptococcal Systemic Infection Microbiol. Spectr. 2025 13 0210424 10.1128/spectrum.02104-24 39612479 PMC11705913 46. Watanabe M. Takimoto H.R. Hashimoto K. Ishii Y. Sasaki N. Effectively Simplified Adriamycin-Induced Chronic Kidney Disease Mouse Model: Retro-Orbital Vein Injection Versus Tail-Vein Injection Animal Model. Exp. Med. 2025 8 568 572 10.1002/ame2.12553 39843403 PMC11904100 47. Garcia de Jalon E. Kleinmanns K. Fosse V. Davidson B. Bjorge L. Haug B.E. McCormack E. Comparison of Five Near-Infrared Fluorescent Folate Conjugates in an Ovarian Cancer Model Mol. Imaging Biol. 2023 25 144 155 10.1007/s11307-021-01685-y 34888759 PMC9971101 48. Nikitin M.P. Zelepukin I.V. Shipunova V.O. Sokolov I.L. Deyev S.M. Nikitin P.I. Enhancement of the Blood-Circulation Time and Performance of Nanomedicines via the Forced Clearance of Erythrocytes Nat. Biomed. Eng. 2020 4 717 731 10.1038/s41551-020-0581-2 32632229 49. Weber K. Mock U. Petrowitz B. Bartsch U. Fehse B. Lentiviral Gene Ontology (Lego) Vectors Equipped with Novel Drug-Selectable Fluorescent Proteins: New Building Blocks for Cell Marking and Multi-Gene Analysis Gene Ther. 2010 17 511 520 10.1038/gt.2009.149 20016542 50. Nikitin M.P. Vetoshko P.M. Brusentsov N.A. Nikitin P.I. Highly Sensitive Room-Temperature Method of Non-Invasive In Vivo Detection of Magnetic Nanoparticles J. Magn. Magn Mater. 2009 321 1658 1661 10.1016/j.jmmm.2009.02.108 51. Nikitin P.I. Vetoshko P.M. Ksenevich T.I. New Type of Biosensor Based on Magnetic Nanoparticle Detection J. Magn. Magn Mater. 2007 311 445 449 10.1016/j.jmmm.2006.10.1180 Figure 1 Characterization of the RAW-GFP cell line and MNP uptake by the obtained cells. GFP fluorescence in RAW-GFP macrophages assessed by ( a b c d e f p Figure 2 The distribution of MNP-loaded RAW-GFP cells in mice after intravenous administration. ( a b c n d n Figure 3 Representative histological images of the lung ( a b c Figure 4 Distribution of MNP-labeled RAW-GFP macrophages in the lung, visualized by laser scanning confocal microscopy with maximum projection of the image volume; green arrows indicate RAW-GFP cells in the alveolar space. Green fluorescent signal—GFP; blue fluorescent signal—DAPI; gray color—autofluorescence signal; magnification 20× ( a b ",
  "metadata": {
    "Title of this paper": "New Type of Biosensor Based on Magnetic Nanoparticle Detection",
    "Journal it was published in:": "Molecules",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12472669/"
  }
}