{
  "title": "Paper_860",
  "abstract": "pmc Mater Today Bio Mater Today Bio 3810 mtbio Materials Today Bio 2590-0064 Elsevier PMC12475523 PMC12475523.1 12475523 12475523 41019491 10.1016/j.mtbio.2025.102305 S2590-0064(25)00875-0 102305 1 Full Length Article Myosin-actin pattern links matrix stiffness to GFAT2-hyaluronan metabolism Zhou Yuwei a Zheng Yifei a c 1 Sheng Biao f 1 Wang Jian d e Ding Kefeng d e Ji Baohua a Wu Yu ywu@zju.edu.cn a b ⁎ a b c d e f ⁎ ywu@zju.edu.cn 1 These authors contributed equally to this work. 12 2025 13 9 2025 35 497120 102305 7 7 2025 3 9 2025 11 9 2025 13 09 2025 28 09 2025 29 09 2025 © 2025 The Authors. Published by Elsevier Ltd. 2025 https://creativecommons.org/licenses/by/4.0/ This is an open access article under the CC BY license (http://creativecommons.org/licenses/by/4.0/). While dysregulated extracellular matrix deposition and stiffening are known to drive tumor progression, breast cancer cells can persist, relapse, and metastasize to soft microenvironments. The distinct strategies that tumor cells adapted to soft matrices remain to be further explored. Here, we report that breast tumor cells exploit soft matrices to activate GFAT2-mediated hyaluronan metabolism that can modulate macrophages. This process is driven by the upregulation of GFAT2 expression through enhanced nuclear translocation of NF-κB and XBP1s, coupled with elevated GFAT activity and subsequent hyaluronan production via suppressed AMPKα phosphorylation. Mechanistically, the expression and activity of GFAT2 are jointly modulated by the total cellular levels of myosin and F-actin. More specifically, the ROCK-Rac1 balance, which can regulate both the cortical-to-cytoplasmic ratio of active myosin and the circumferential arrangement of cortical F-actin, mediates the NF-κB-XBP1s-GFAT2 signaling axis. Furthermore, our in silico Graphical abstract Image 1 Highlights • Soft matrices promote GFAT2-HA biosynthesis to reprogram macrophages. • Soft matrices support GFAT2 expression through NF-κB and XBP1s. • Total levels of myosin motors and F-actin negatively affect GFAT2. • Actin ring regulated by myosin pattern links soft matrices to NF-κB/XBP1s-GFAT2. • Lower levels of p-AMPK on soft matrices support GFAT activity but not stability. Keywords Extracellular matrix GFPT Mechanotransduction Spatial pattern Breast cancer pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement yes pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes 1 Introduction The deposition and cross-linking of extracellular matrix proteins, resulting in increased matrix stiffness or rigidity, commonly serve as one of the pathological diagnostic cues. The growth of solid tumors and the alterations in the surrounding matrix are widely regarded as mutually reinforcing processes [ 1 in vitro [2] [3] [4] [5] [6] [7] 8 6 7 5 Besides, tumor metabolism can also interfere with the treatment effect and has recently been discovered to be mechanosensitive due to its dependence on the actin cytoskeleton [ [9] [10] [11] [12] [13] [14] [15] [16] high low 17 18 in vitro 19 20 [21] [22] [23] 5 24 15 25 26 in vitro [27] [28] [29] Here, we outline that matrix stiffness mechano-regulates GFAT2 expression and HA biosynthesis in breast cancer cells through myosin force patterning and cortical actin cytoskeletal reorganization. Specifically, soft matrices promote GFAT2 transcription via NF-κB/XBP1s nuclear translocation while simultaneously regulating GFAT2 protein stability and enzymatic activity through phosphorylated AMP-activated protein kinase (p-AMPK) signaling. The actin ring architecture, governed by elevated phospho-myosin light chain (pMLC) polarization at the cortical region relative to cytoplasmic pools or diminished F-actin polymerization dynamics, contributes to the mechanochemical activation of the NF-κB/XBP1s-GFAT2 axis. Notably, while p-AMPK plays a role in stabilizing the GFAT2 protein, it negatively impacts GFAT activity and consequent secretion of HA. This biophysical regulatory mechanism, active in soft microenvironments such as primary tumors, treatment-remodeled niches, and specific metastatic sites, establishes GFAT2/HA signaling as a biomechanical driver of microenvironmental reprogramming in breast cancer. 2 Materials and Methods 2.1 Cell culture and preparation of polyacrylamide gels MDA-MB-231 (RRID:CVCL_0062) and Raw 264.7 (RRID:CVCL_0493) cells were cultured in Dulbecco's Modified Eagle Medium (DMEM) supplemented with 10 % fetal bovine serum (Gibco) and 1 % penicillin-streptomycin (Gibco) at 37 °C with 5 % CO2 and were regularly checked for mycoplasma contamination. Raw 264.7 was passaged without trypsin to prevent differentiation and then checked for cellular shapes before the experiment. MDA-MB-231 were cultured on synthetic polyacrylamide (PA) hydrogels with low (∼1 Kpa) or high (∼20 Kpa) stiffness, as previously described [ 30 31 32 2.2 Reagents Compounds and working concentrations were used as follows: 0.5 μM Latrunculin A, 100 μg/ml Cycloheximide (GlpBio), 50 μM Blebbistatin, 25 μM NSC 23766, 10 μM Y27632, 10 μM Compound C, 0.5 mM AICAR, 20 μM 4μ8C, 10 μM BAY 11–7085 (MCE), 200 μg/ml hyaluronidase (Sigma). Antibodies applied for western blot as follows: polyclonal GFAT1 (RRID: AB_2110155 AB_2868470 AB_331250 AB_10622186 AB_2223172 AB_10859369 AB_2879766 AB_2637091 AB_330248 2.3 Molecular Biology experiments Total RNA of cells under paired conditions was extracted simultaneously for contrast using an RNA isolation kit (Omega) following the manufacturer's instructions. Quantitative analysis was performed by the 2 − Δ Δ Ct 27 Table S2 For western blot, proteins were separated by SDS-PAGE and transferred onto PVDF membranes (Millipore). The membranes were blocked with 5 % BSA (Solarbio) or 5 % non-fat dry milk (Solarbio) for 1 h at room temperature. Subsequently, the membranes were incubated with the appropriate primary antibody overnight at 4 °C, followed by incubation with an HRP-conjugated secondary antibody (Cell Signaling Technology) for 1 h at room temperature. HRP signals were detected using enhanced chemiluminescence (Biosharp). 2.4 GFAT activity assay To determine the activity of glutamine: fructose-6-phosphate aminotransferase (GFAT), we used a colorimetric method based on the procedure established by Fei Y et al. and R.R. et al. [ 33 34 g 2.5 Hyaluronan measurement Conditioned medium (CM) from MDA-MB-231 on soft/stiff matrices was collected after 24 h of cultivation. The concentration of hyaluronan was determined using the HA ELISA assay (MEIMIAN) and subsequently normalized to the cell count. 200 μg/ml hyaluronidase at 37 °C for 20 min was applied in CM to eliminate the effects of HA on cholesterol efflux from macrophages. 2.6 Lipid raft staining and Flow Cytometry To stain the lipid rafts, the Vybrant Alexa Fluor 488 Lipid Raft Labeling Kit (ThermoFisher Scientific) was used in accordance with the manufacturer's instructions. In brief, Raw 264.7 cells were gently blown down in DPBS, collected and washed with serum-free DMEM. They were incubated at 4 °C for 10 min with Alexa488-conjugated cholera toxin subunit B (CTB), followed by cross-linking with an anti-CTB antibody for 15 min at 4 °C. Dead cells were excluded using 7-AAD (BD Biosciences) as a gating strategy. We conducted Flow Cytometry using CytoFLEX (RRID: SCR_025067 SCR_008520 2.7 Immunofluorescence Cells fixed with 4 % paraformaldehyde on prepared PA gels were first washed with PBS and then permeabilized with a 0.2 % Triton X-100 solution. After that, they were blocked for 1 h with a 5 % BSA solution in PBS. To visualize F-actin, samples were stained with phalloidin-488 (1:500, Abcam) and DAPI (Invitrogen) for 30 min. To visualize proteins in the nuclei and phosphorylated myosin light chain (pMLC), the samples were incubated with primary antibodies diluted in a 2 % BSA solution overnight at 4 °C. The slides were then washed three times with PBST, incubated with the corresponding secondary antibodies (Cell Signaling, 1:1000) for 1 h at room temperature, and finally stained with a DAPI solution (Invitrogen). 2.8 Confocal image analysis Fluorescence images were obtained using a confocal laser scanning microscope (LSM900, Carl Zeiss). To analyze F-actin characteristics, we captured slices and overlapped stacks in ImageJ (RRID: SCR_003070 SCR_001622 The ImageJ magic wand tool was used to select the outlines of cells through summed F-actin images, and the morphological opening was then applied to remove actin branches, allowing for the delineation of the cell edge/boundary. The cell cortex is defined as a shell that begins at the cell boundary and has a thickness of 936 nm. For calculating pMLC ratios between the cellular cortex and cytoplasm, three fluorescence images of pMLC with relatively complete cell contours were summed and then divided by the cortical shell. The mean values of these two regions were then statistically compared. The ruffle index was calculated as the ratio of the area where the F-actin intensity in the cell cortex is greater than one-third of its maximum value to the total area of the cell cortex [ 35 To estimate the levels of transcription factors in nuclei, MATLAB software was used to demarcate nuclear contours and extract specific portions of transcription factors from the corresponding binarized nuclei images, slice by slice. The overall levels of transcription factors within the nuclei were quantified using ImageJ, based on the total intensity values of Z-stacks. The schematic diagram, as shown in Fig. S4C 2.9 Transfections Cells were transfected with 20 nM siRNA and performed with RNATransMate (BBI) in an FBS-free culture medium according to the manufacturer's instructions. Sequences of siRNAs are reported in Table S1 Fig. S4D 2.10 a2-Dimensional TFM To measure the force applied by cells to the hydrogel surfaces, we captured fluorescence images of cell shapes in the \"stressed\" state and 500 nm nanobeads within the hydrogel. We then trypsinized the cells from the gels and took a second set of fluorescent images of the beads at specific locations. The paired images were first jitter-corrected with the ImageJ Template Matching plugin, then computationally compared to derive the displacement field within the matrix [ 36 37 2.11 Modeling of cells with cortical region and myosin activation with chemo-mechanical feedback Following the work of Shenoy et al. [ 38 [1] σ i j = ( ρ 0 ‾ + ( K ‾ − 2 3 μ ‾ ) ε k k ) δ i j + 2 μ ‾ ε i j [2] ρ i j = ( ρ 0 ‾ + ( K ρ ‾ − 2 3 u ρ ‾ ) ε k k ) δ i j + 2 u ρ ‾ ε i j , Table S3 2.12 Statistical analysis Statistical analysis was performed and visualized by GraphPad Prism9.5 (RRID: SCR_002798 3 Results 3.1 Matrix compliance increases GFAT2 and HA secretion To examine whether HA production from TNBC cells would respond to mechanical signals, we utilized a recognized in vitro Fig. S1 Fig. 1 Fig. 1 Fig. 1 Soft matrix is sufficient to promote HA secretion through GFAT2 and p-AMPK. ± Fig. 1 To functionally characterize GFAT catalytic capacity, we implemented a colorimetric assay measuring the levels of reduced acetylpyridine adenine dinucleotide (APADH) [ 33 Fig. 1 [39] [40] [41] Fig. 1 42 43 Fig. 1 44 45 Consistent with accumulating evidence that UDP-glucose accumulation and HA levels are strongly correlated with GFAT [ 27 Fig. 1 15 46 47 Fig. 1 Fig. S2B and C 29 48 Taken together, our findings demonstrate that soft matrices effectively enhance HA synthesis by upregulating GFAT2 expression and augmenting GFAT enzymatic activity, thereby modulating cholesterol efflux of macrophages. This reveals a connection between the physical properties of the extracellular matrix and HA metabolism mediated by the newly discovered environment-sensitive transducer GFAT2. Analysis of two public datasets of human transcriptional profiles from breast cancer patients extends this relationship into an in vivo context. In the TCGA dataset [ 49 Fig. S2D and E 50 Fig. 1 Fig. 1 51 Fig. S2G 3.2 NF-κB and XBP1s link mechanical cues to GFAT2 Considering that NF-κB and XBP1s in solid tumors are primarily regulated by microenvironmental cues rather than genetic alterations [ 52 53 Fig. 1 Fig. 1 54 Fig. S2H and I 21 55 22 56 To understand the connection between NF-κB and GFAT, we inhibited NF-κB nuclear translocation using Bay 11–7085 and suppressed its expression by transfecting small interfering RNA (siRNA). Surprisingly, siRNA targeting NF-κB was sufficient to inhibit GFAT2, but not GFAT1, gene and protein expression ( Fig. 2 Fig. S3A and B 57 Fig. 2 Fig. 2 Fig. 2 Fig. 2 Transcription factors, myosin contraction, and F-actin elongation are involved in the stiffness-GFAT2-HA signaling axis. − log 10 ( p v a l u e ) ± Fig. 2 To summarize, NF-κB and XBP1s respond to matrix stiffness and influence HA production by regulating GFAT expression, particularly GFAT2. Additionally, this effect is independent of the impact of p-AMPK on GFAT activity. 3.3 Traction force and F-actin polymerization are involved in stiffness-dependent GFAT2 modulation By measuring the displacement of fluorescent particles within the matrix, we obtained the traction force exerted by the cells on the matrix ( Fig. 3 Fig. 3 59 ρ ‾ = 1 3 ( ρ 1 + ρ 2 + ρ 3 ) Fig. S3F η = 1 2 ( ρ 3 − ρ 1 ) Fig. 3 Fig. S3G in silico Fig. 1 Fig. 3 Characteristics of myosin II and F-actin in MDA-MB-231 on soft and stiff matrices. Fig. 3 Myosin inhibitor Blebbistatin (Bleb) increased nuclear levels of NF-κB, but not XBP1s ( Fig. 2 Fig. 2 60 61 Fig. 3 To explore whether matrix compliance-mediated regulation of GFAT2 is associated with actin polymerization, we treated MDA-MB-231 cells with Latrunculin A (Lat-A) and monitored GFAT transcriptional and translation activity. As expected, the inhibition of actin polymerization also increased the nuclear translocation of both NF-κB and XBP1s ( Fig. 2 Fig. 2 The disruption of both cellular contractility and actin polymerization markedly impaired AMPK signaling, as evidenced by concomitant reductions in p63-dependent mRNA transcription, protein abundance, and enzymatic activity of AMPK ( Fig. 2 Fig. 2 3.4 NF-κB/XBP1s are more closely related to cortical F-actin alignments governed by the spatial distribution of myosin On the stiff matrix, the maximum principal traction force along the cortex tended to form larger angles with the cell boundary ( Fig. 3 Fig. 3 35 Fig. 3 Fig. 3 Fig. 3 Fig. 3 Fig. 3 Based on the effects of Bleb, there was a certain discrepancy between the overall inhibition of myosin in cells and the effects of matrix stiffness ( Fig. 1 Fig. 2 Fig. 4 Fig. 4 Fig. S4A Fig. S4B Fig. 4 Fig. 4 The direction and distribution of pMLC and F-actin are involved in NF-κB and XBP1s regulating GFAT2. Fig. 4 The model revealed that solely regulating cortical-to-cytoplasmic pMLC ratios determines the directional bias of force polarization ( Fig. 4 Fig. 4 Fig. 2 3.5 p-AMPK supports GFAT2 stability but not HA secretion Phosphorylation of AMPK and its upstream regulators has been reported to inhibit the activity of GFAT1/2 and HAS2 [ 39 41 62 Fig. S3C Fig. 5 Fig. 5 Fig. 5 Fig. 5 p-AMPK supports GFAT2 stability but not HA secretion. ± Fig. 5 This greatly exceeded our expectations, so we conducted a reverse attempt to activate AMPK with AICAR in cells on the soft matrix ( Fig. S3D Fig. 5 Fig. 5 Fig. 5 Fig. 5 Fig. 5 The opposite effects of AMPK on the matrix-GFAT2-HA signaling axis, namely stabilizing GFAT2 protein and inhibiting GFAT and HAS2 activities, sparked our interest in its overall influence on the downstream products of GFAT2. Of note, CC positively influenced the downstream GFAT activities and HA secretion, while AICAR had the opposite effect ( Fig. 5 45 63 64 Fig. 5 Fig. 5 4 Discussion The survival of early-stage breast cancer often involves interactions with soft microenvironments, including early-stage breast tumor tissue, preferred metastatic sites, and post-chemotherapy residual lesions. While the malignant phenotype characterized by enhanced proliferative and migratory capacities typically manifests on stiff matrices [ 65 66 [2] [3] [4] [5] [6] [7] 6 5 7 Fig. 1 29 48 NF-κB/XBP1s, GFAT, and HA have been identified as potential malignant indicators associated with the survival and progression of breast cancer [ 5 24 [27] [28] [29] 67 Fig. S5A and B 27 48 On the soft matrix, increased nuclear translocation of NF-κB and XBP1s, along with reduced levels of p-AMPK, contribute to both GFAT2 expression and GFAT activity, respectively. Both NF-κB (through siRNA-mediated knockdown) and XBP1s (via pharmacological inhibition) have been shown to be linked to GFAT2 expression ( Fig. 2 Fig. S3A and B 21 57 58 Fig. S3E 10 12 68 Fig. 4 The link between biophysical stimuli and metabolic pathways has recently begun to attract attention, focusing on key proteins closely related to energy production and consumption [ 10 42 43 45 63 64 The malignant progression of tumors depends not only on their intrinsic proliferative and migratory capacities but also on active remodeling of cellular and extracellular matrix components within the tumor microenvironment. In this context, upregulation of GFAT2 expression and enzymatic activity on the soft matrix enhances HA secretion and subsequently disrupts membrane cholesterol homeostasis in microenvironmental macrophages. Since the impact of matrix stiffness on the soluble secretions of tumor cells is not limited to HA, and existing literature has already conducted comprehensive studies on the effects of HA on macrophages [ 15 25 Specifically, soft matrices facilitate the nuclear translocation of NF-κB and XBP1s while suppressing p-AMPK levels, thereby synchronously enhancing GFAT2 expression, enzyme activity, and HA secretion. This regulatory mechanism is governed by the total levels of active myosin and the corresponding F-actin. Notably, the active myosin pattern and its subsequent actin ring (a circumferentially aligned F-actin structure), which are determined by the ROCK-Rac1 balance, exert a specific influence on the NF-κB/XBP1s-GFAT2 signaling axis. These findings establish a novel link between extracellular matrix stiffness and tumor-stromal cell crosstalk, underscoring the critical role of biophysical stimuli in tumor metabolism via the myosin-actin pattern. While previous investigations have not specifically addressed the mechanical regulation of HA metabolism, NF-κB/XBP1s, GFAT, and HA show correlations with tumor cell preservation of viability in soft matrix-characterized early-stage tumors, preferred metastatic sites, and post-therapeutic residual tissues. This mechanobiological mechanism, mediated through microenvironmental reprogramming of HA biosynthesis, may constitute a novel survival strategy in breast cancer progression. Future investigations will focus on elucidating how the subcellular distribution of pMLC and cortical F-actin networks, along with their downstream mechanotransduction effectors, contribute to tumor adaptive strategies under mechanical stress conditions. CRediT authorship contribution statement Yuwei Zhou: Yifei Zheng: Biao Sheng: Jian Wang: Kefeng Ding: Baohua Ji: Yu Wu: Funding sources This work was supported by the 10.13039/501100001809 National Natural Science Foundation of China 12472035 10.13039/501100004731 Zhejiang Provincial Natural Science Foundation LR20A020001 National Natural Science Foundation of China 11932017 11402227 Declaration of competing interest The authors declare that they have no known competing financial interests or personal relationships that could have appeared to influence the work reported in this paper. References 1 Van Dijk M. Göransson S.A. Strömblad S. Cell to extracellular matrix interactions and their reciprocal nature in cancer Exp. Cell Res. 319 2013 1663 1670 10.1016/j.yexcr.2013.02.006 23419246 2 Li Y. Randriantsilefisoa R. Chen J. Cuellar-Camacho J.L. Liang W. Li W. Matrix stiffness regulates Chemosensitivity, stemness characteristics, and autophagy in breast cancer cells ACS Appl. Bio Mater. 3 2020 4474 4485 10.1021/acsabm.0c00448 35025446 3 Li C. Qiu S. Liu X. Guo F. Zhai J. Li Z. Deng L. Ge L. Qian H. Yang L. Xu B. Extracellular matrix-derived mechanical force governs breast cancer cell stemness and quiescence transition through integrin-DDR signaling Sig Transduct Target Ther 8 2023 247 10.1038/s41392-023-01453-0 PMC10300038 37369642 4 Ebata T. Mitsui Y. Sugimoto W. Maeda M. Araki K. Machiyama H. Harada I. Sawada Y. Fujita H. Hirata H. Kawauchi K. Substrate stiffness influences Doxorubicin-induced p53 activation via ROCK2 expression BioMed Res. Int. 2017 2017 1 10 10.1155/2017/5158961 PMC5278210 28191463 5 Drain A.P. Zahir N. Northey J.J. Zhang H. Huang P.-J. Maller O. Lakins J.N. Yu X. Leight J.L. Alston-Mills B.P. Hwang E.S. Chen Y.-Y. Park C.C. Weaver V.M. Matrix compliance permits NF-κB activation to drive therapy resistance in breast cancer J. Exp. Med. 218 2021 e20191360 10.1084/jem.20191360 PMC8025243 33822843 6 Anlaş A.A. Nelson C.M. Soft microenvironments induce chemoresistance by increasing autophagy downstream of integrin-linked kinase Cancer Res. 80 2020 4103 4113 10.1158/0008-5472.CAN-19-4021 33008805 PMC7534696 7 Romani P. Nirchio N. Arboit M. Barbieri V. Tosi A. Michielin F. Shibuya S. Benoist T. Wu D. Hindmarch C.C.T. Giomo M. Urciuolo A. Giamogante F. Roveri A. Chakravarty P. Montagner M. Calì T. Elvassore N. Archer S.L. De Coppi P. Rosato A. Martello G. Dupont S. Mitochondrial fission links ECM mechanotransduction to metabolic redox homeostasis and metastatic chemotherapy resistance Nat. Cell Biol. 24 2022 168 180 10.1038/s41556-022-00843-w 35165418 PMC7615745 8 Chen Y. Kim J. Yang S. Wang H. Wu C.-J. Sugimoto H. LeBleu V.S. Kalluri R. Type I collagen deletion in αSMA+ myofibroblasts augments immune suppression and accelerates progression of pancreatic cancer Cancer Cell 39 2021 548 565.e6 10.1016/j.ccell.2021.02.007 33667385 PMC8423173 9 Hu H. Juvekar A. Lyssiotis C.A. Lien E.C. Albeck J.G. Oh D. Varma G. Hung Y.P. Ullas S. Lauring J. Seth P. Lundquist M.R. Tolan D.R. Grant A.K. Needleman D.J. Asara J.M. Cantley L.C. Wulf G.M. Phosphoinositide 3-kinase regulates glycolysis through Mobilization of Aldolase from the actin cytoskeleton Cell 164 2016 433 446 10.1016/j.cell.2015.12.042 26824656 PMC4898774 10 Park J. Burckhardt C. Lazcano R. Solis L. Isogai T. Li L. Chen C. Gao B.N. Minna J. Bachoo R. Deberardinis R. Danuser G. Mechanical regulation of glycolysis via cytoskeleton architecture Nature 578 2020 10.1038/s41586-020-1998-1 PMC7210009 32051585 11 Romani P. Valcarcel-Jimenez L. Frezza C. Dupont S. Crosstalk between mechanotransduction and metabolism Nat. Rev. Mol. Cell Biol. 22 2021 22 38 10.1038/s41580-020-00306-w 33188273 12 Bertolio R. Napoletano F. Mano M. Maurer-Stroh S. Fantuz M. Zannini A. Bicciato S. Sorrentino G. Del Sal G. Sterol regulatory element binding protein 1 couples mechanical cues and lipid metabolism Nat. Commun. 10 2019 1326 10.1038/s41467-019-09152-7 30902980 PMC6430766 13 Bianchetti L. Barczyk M. Cardoso J. Schmidt M. Bellini A. Mattoli S. Extracellular matrix remodelling properties of human fibrocytes J Cellular Molecular Medi 16 2012 483 495 10.1111/j.1582-4934.2011.01344.x PMC3822925 21595824 14 Umana-Diaz C. Pichol-Thievend C. Marchand M.F. Atlas Y. Salza R. Malbouyres M. Barret A. Teillon J. Ardidie-Robouant C. Ruggiero F. Monnot C. Girard P. Guilluy C. Ricard-Blum S. Germain S. Muller L. Scavenger Receptor Cysteine-Rich domains of Lysyl Oxidase-Like2 regulate endothelial ECM and angiogenesis through non-catalytic scaffolding mechanisms Matrix Biol. 88 2020 33 52 10.1016/j.matbio.2019.11.003 31759052 15 Goossens P. Rodriguez-Vita J. Etzerodt A. Masse M. Rastoin O. Gouirand V. Ulas T. Papantonopoulou O. Van Eck M. Auphan-Anezin N. Bebien M. Verthuy C. Vu Manh T.P. Turner M. Dalod M. Schultze J.L. Lawrence T. Membrane cholesterol efflux drives tumor-associated macrophage reprogramming and tumor progression Cell Metab. 29 2019 1376 1389.e4 10.1016/j.cmet.2019.02.016 30930171 16 Bertero T. Oldham W.M. Grasset E.M. Bourget I. Boulter E. Pisano S. Hofman P. Bellvert F. Meneguzzi G. Bulavin D.V. Estrach S. Feral C.C. Chan S.Y. Bozec A. Gaggioli C. Tumor-stroma Mechanics Coordinate Amino acid Availability to Sustain tumor growth and malignancy Cell Metab. 29 2019 124 140.e10 10.1016/j.cmet.2018.09.012 30293773 PMC6432652 17 Chokchaitaweesuk C. Kobayashi T. Izumikawa T. Itano N. Enhanced hexosamine metabolism drives metabolic and signaling networks involving hyaluronan production and O-GlcNAcylation to exacerbate breast cancer Cell Death Dis. 10 2019 803 10.1038/s41419-019-2034-y 31645543 PMC6811536 18 Simpson N.E. Tryndyak V.P. Beland F.A. Pogribny I.P. An in vitro investigation of metabolically sensitive biomarkers in breast cancer progression Breast Cancer Res. Treat. 133 2012 959 968 10.1007/s10549-011-1871-x 22101407 19 Wang Q. Karvelsson S.T. Kotronoulas A. Gudjonsson T. Halldorsson S. Rolfsson O. Glutamine-Fructose-6-Phosphate transaminase 2 (GFPT2) is upregulated in breast epithelial–mesenchymal transition and responds to oxidative stress Mol. Cell. Proteomics 21 2022 100185 10.1016/j.mcpro.2021.100185 PMC8803663 34923141 20 Zhou L. Luo M. Cheng L. Li R. Liu B. Linghu H. Glutamine-fructose-6-phosphate transaminase 2 (GFPT2) promotes the EMT of serous ovarian cancer by activating the hexosamine biosynthetic pathway to increase the nuclear location of β-catenin Pathol. Res. Pract. 215 2019 152681 10.1016/j.prp.2019.152681 31685298 21 Szymura S.J. Zaemes J.P. Allison D.F. Clift S.H. D'Innocenzi J.M. Gray L.G. McKenna B.D. Morris B.B. Bekiranov S. LeGallo R.D. Jones D.R. Mayo M.W. NF-κB upregulates glutamine-fructose-6-phosphate transaminase 2 to promote migration in non-small cell lung cancer Cell Commun. Signal. 17 2019 24 10.1186/s12964-019-0335-5 30885209 PMC6421657 22 Wani W.Y. Zunke F. Belur N.R. Mazzulli J.R. The hexosamine biosynthetic pathway rescues lysosomal dysfunction in Parkinson's disease patient iPSC derived midbrain neurons Nat. Commun. 15 2024 5206 10.1038/s41467-024-49256-3 38897986 PMC11186828 23 Wang Z.V. Deng Y. Gao N. Pedrozo Z. Li D.L. Morales C.R. Criollo A. Luo X. Tan W. Jiang N. Lehrman M.A. Rothermel B.A. Lee A.-H. Lavandero S. Mammen P.P.A. Ferdous A. Gillette T.G. Scherer P.E. Hill J.A. Spliced X-Box binding protein 1 couples the unfolded protein response to hexosamine biosynthetic pathway Cell 156 2014 1179 1192 10.1016/j.cell.2014.01.014 24630721 PMC3959665 24 Chen X. Iliopoulos D. Zhang Q. Tang Q. Greenblatt M.B. Hatziapostolou M. Lim E. Tam W.L. Ni M. Chen Y. Mai J. Shen H. Hu D.Z. Adoro S. Hu B. Song M. Tan C. Landis M.D. Ferrari M. Shin S.J. Brown M. Chang J.C. Liu X.S. Glimcher L.H. XBP1 promotes triple-negative breast cancer by controlling the HIF1α pathway Nature 508 2014 103 107 10.1038/nature13119 24670641 PMC4105133 25 Xiao W. Zhang R. Sohrabi A. Ehsanipour A. Sun S. Liang J. Walthers C.M. Ta L. Nathanson D.A. Seidlits S.K. Brain-mimetic 3D culture Platforms allow investigation of Cooperative effects of extracellular matrix features on therapeutic resistance in glioblastoma Cancer Res. 78 2018 1358 1370 10.1158/0008-5472.CAN-17-2429 29282221 PMC5935550 26 Xiao W. Wang S. Zhang R. Sohrabi A. Yu Q. Liu S. Ehsanipour A. Liang J. Bierman R.D. Nathanson D.A. Seidlits S.K. Bioengineered scaffolds for 3D culture demonstrate extracellular matrix-mediated mechanisms of chemotherapy resistance in glioblastoma Matrix Biol. 85–86 2020 128 146 10.1016/j.matbio.2019.04.003 PMC6813884 31028838 27 Oikari S. Kettunen T. Tiainen S. Häyrinen J. Masarwah A. Sudah M. Sutela A. Vanninen R. Tammi M. Auvinen P. UDP-sugar accumulation drives hyaluronan synthesis in breast cancer Matrix Biol. 67 2018 63 74 10.1016/j.matbio.2017.12.015 29331336 28 Dong T. Kang X. Liu Z. Zhao S. Ma W. Xuan Q. Liu H. Wang Z. Zhang Q. Altered glycometabolism affects both clinical features and prognosis of triple-negative and neoadjuvant chemotherapy-treated breast cancer Tumor Biol. 37 2016 8159 8168 10.1007/s13277-015-4729-8 26715276 29 Auvinen P. Tammi R. Parkkinen J. Tammi M. Ågren U. Johansson R. Hirvikoski P. Eskelinen M. Kosma V.-M. Hyaluronan in Peritumoral stroma and malignant cells Associates with breast cancer spreading and Predicts survival Am. J. Pathol. 156 2000 529 536 10.1016/S0002-9440(10)64757-8 10666382 PMC1850058 30 Tse J.R. Engler A.J. Preparation of hydrogel substrates with Tunable mechanical properties CP Cell Biology 47 2010 10.1002/0471143030.cb1016s47 20521229 31 Denisin A.K. Pruitt B.L. Tuning the Range of polyacrylamide gel stiffness for Mechanobiology applications ACS Appl. Mater. Interfaces 8 2016 21893 21902 10.1021/acsami.5b09344 26816386 32 Oria R. Wiegand T. Escribano J. Elosegui-Artola A. Uriarte J.J. Moreno-Pulido C. Platzman I. Delcanale P. Albertazzi L. Navajas D. Trepat X. García-Aznar J.M. Cavalcanti-Adam E.A. Roca-Cusachs P. Force loading explains spatial sensing of ligands by cells Nature 552 2017 219 224 10.1038/nature24662 29211717 33 Ye F. Maegawa H. Morino K. Kashiwagi A. Kikkawa R. Xie M. Shen Z. A simple and sensitive method for glutamine:fructose-6-phosphate amidotransferase assay J. Biochem. Biophys. Methods 59 2004 201 208 10.1016/j.jbbm.2003.02.001 15165751 34 Traxinger R.R. Marshall S. Coordinated regulation of glutamine:fructose-6-phosphate amidotransferase activity by insulin, glucose, and glutamine. Role of hexosamine biosynthesis in enzyme regulation J. Biol. Chem. 266 1991 10148 10154 10.1016/S0021-9258(18)99202-1 2037571 35 Yan G. Zhou J. Yin J. Gao D. Zhong X. Deng X. Kang H. Sun A. Membrane ruffles: composition, function, formation and visualization Int. J. Mol. Sci. 25 2024 10971 10.3390/ijms252010971 PMC11507850 39456754 36 He S. Liu C. Li X. Ma S. Huo B. Ji B. Dissecting collective cell behavior in polarization and alignment on Micropatterned substrates Biophys. J. 109 2015 489 500 10.1016/j.bpj.2015.06.058 26244731 PMC4571026 37 Butler J.P. Tolić-Nørrelykke I.M. Fabry B. Fredberg J.J. Traction fields, moments, and strain energy that cells exert on their surroundings American Journal of Physiology-Cell Physiology 282 2002 C595 C605 10.1152/ajpcell.00270.2001 11832345 38 Shenoy V.B. Wang H. Wang X. A chemo-mechanical free-energy-based approach to model durotaxis and extracellular stiffness-dependent contraction and polarization of cells Interface Focus 6 2016 20150067 10.1098/rsfs.2015.0067 PMC4686242 26855753 39 Eguchi S. Oshiro N. Miyamoto T. Yoshino K. Okamoto S. Ono T. Kikkawa U. Yonezawa K. AMP‐activated protein kinase phosphorylates glutamine: fructose‐6‐phosphate amidotransferase 1 at Ser243 to modulate its enzymatic activity Genes Cells 14 2009 179 189 10.1111/j.1365-2443.2008.01260.x 19170765 40 Zibrova D. Vandermoere F. Göransson O. Peggie M. Mariño K.V. Knierim A. Spengler K. Weigert C. Viollet B. Morrice N.A. Sakamoto K. Heller R. GFAT1 phosphorylation by AMPK promotes VEGF-induced angiogenesis Biochem. J. 474 2017 983 1001 10.1042/BCJ20160980 28008135 41 Kim J. Lee H.M. Cai F. Ko B. Yang C. Lieu E.L. Muhammad N. Rhyne S. Li K. Haloul M. Gu W. Faubert B. Kaushik A.K. Cai L. Kasiri S. Marriam U. Nham K. Girard L. Wang H. Sun X. Kim J. Minna J.D. Unsal-Kacmaz K. DeBerardinis R.J. The hexosamine biosynthesis pathway is a targetable liability in KRAS/LKB1 mutant lung cancer Nat. Metab. 2 2020 1401 1412 10.1038/s42255-020-00316-0 33257855 PMC7744327 42 Hupfer A. Brichkina A. Koeniger A. Keber C. Denkert C. Pfefferle P. Helmprobst F. Pagenstecher A. Visekruna A. Lauth M. Matrix stiffness drives stromal autophagy and promotes formation of a protumorigenic niche P Natl Acad Sci Usa 118 2021 e2105367118 10.1073/pnas.2105367118 PMC8501848 34588305 43 Xie J. Bao M. Hu X. Koopman W.J.H. Huck W.T.S. Energy expenditure during cell spreading influences the cellular response to matrix stiffness Biomaterials 267 2021 120494 10.1016/j.biomaterials.2020.120494 33130323 44 Quentin T. Kitz J. Steinmetz M. Poppe A. Bär K. Krätzner R. Different expression of the catalytic alpha subunits of the AMP activated protein kinase-an immunohistochemical study in human tissue Histol. Histopathol. 26 2011 589 596 10.14670/HH-26.589 21432774 45 Cao W. Li J. Hao Q. Vadgama J.V. Wu Y. AMP-activated protein kinase: a potential therapeutic target for triple-negative breast cancer Breast Cancer Res. 21 2019 29 10.1186/s13058-019-1107-2 30791936 PMC6385460 46 Halimi H. Farjadian S. Cholesterol: an important actor on the cancer immune scene Front. Immunol. 13 2022 1057546 10.3389/fimmu.2022.1057546 PMC9719946 36479100 47 Fessler M.B. Parks J.S. Intracellular lipid Flux and membrane microdomains as organizing Principles in Inflammatory cell signaling J. Immunol. 187 2011 1529 1535 10.4049/jimmunol.1100253 21810617 PMC3151145 48 Tammi M.I. Oikari S. Pasonen-Seppänen S. Rilla K. Auvinen P. Tammi R.H. Activated hyaluronan metabolism in the tumor matrix — Causes and consequences Matrix Biol. 78–79 2019 147 164 10.1016/j.matbio.2018.04.012 29709595 49 The Cancer Genome Atlas Breast invasive carcinoma (BRCA) data https://portal.gdc.cancer.gov/projects/TCGA-BRCA 2021 50 Sun X. Gierach G.L. Sandhu R. Williams T. Midkiff B.R. Lissowska J. Wesolowska E. Boyd N.F. Johnson N.B. Figueroa J.D. Sherman M.E. Troester M.A. Relationship of mammographic density and gene expression: analysis of normal breast tissue surrounding breast cancer Clin. Cancer Res. 19 2013 4972 4982 10.1158/1078-0432.CCR-13-0029 23918601 PMC4073678 51 Győrffy B. Survival analysis across the entire transcriptome identifies biomarkers with the highest prognostic power in breast cancer Comput. Struct. Biotechnol. J. 19 2021 4101 4109 10.1016/j.csbj.2021.07.014 34527184 PMC8339292 52 Xia Y. Shen S. Verma I.M. NF-κB, an active player in human cancers Cancer Immunol. Res. 2 2014 823 830 10.1158/2326-6066.CIR-14-0112 25187272 PMC4155602 53 Spiotto M.T. Banh A. Papandreou I. Cao H. Galvez M.G. Gurtner G.C. Denko N.C. Le Q.T. Koong A.C. Imaging the unfolded protein response in primary tumors reveals microenvironments with metabolic variations that predict tumor growth Cancer Res. 70 2010 78 88 10.1158/0008-5472.CAN-09-2747 20028872 PMC2943832 54 Sero J.E. Sailem H.Z. Ardy R.C. Almuttaqi H. Zhang T. Bakal C. Cell shape and the microenvironment regulate nuclear translocation of NF-κB in breast epithelial and tumor cells Mol. Syst. Biol. 11 2015 790 10.15252/msb.20145644 26148352 PMC4380925 55 Liu L. Pan Y. Ren X. Zeng Z. Sun J. Zhou K. Liang Y. Wang F. Yan Y. Liao W. Ding Y. Liu X. Liang L. GFPT2 promotes metastasis and forms a positive feedback loop with p65 in colorectal cancer Am. J. Cancer Res. 10 2020 2510 2522 32905539 PMC7471343 56 Panarsky R. Crooks D.R. Lane A.N. Yang Y. Cassel T.A. Fan T.W.-M. Linehan W.M. Moscow J.A. Fumarate hydratase-deficient renal cell carcinoma cells respond to asparagine by activation of the unfolded protein response and stimulation of the hexosamine biosynthetic pathway Cancer Metab 8 2020 7 10.1186/s40170-020-00214-9 32774853 PMC7397616 57 Chang L.-C. Chiang S.-K. Chen S.-E. Yu Y.-L. Chou R.-H. Chang W.-C. Heme oxygenase-1 mediates BAY 11–7085 induced ferroptosis Cancer Lett. 416 2018 124 137 10.1016/j.canlet.2017.12.025 29274359 58 Tang Z. Kang B. Li C. Chen T. Zhang Z. GEPIA2: an enhanced web server for large-scale expression profiling and interactive analysis Nucleic Acids Res. 47 2019 W556 W560 10.1093/nar/gkz430 31114875 PMC6602440 59 Shenoy V.B. Wang H. Wang X. A chemo-mechanical free-energy-based approach to model durotaxis and extracellular stiffness-dependent contraction and polarization of cells Interface Focus 6 2016 20150067 10.1098/rsfs.2015.0067 PMC4686242 26855753 60 Weng S. Shao Y. Chen W. Fu J. Mechanosensitive subcellular rheostasis drives emergent single-cell mechanical homeostasis Nature Mater 15 2016 961 967 10.1038/nmat4654 27240108 PMC4996707 61 Walcott S. Sun S.X. A mechanical model of actin stress fiber formation and substrate elasticity sensing in adherent cells Proc Natl Acad Sci USA. 107 2010 7757 7762 10.1073/pnas.0912739107 20385838 PMC2867880 62 Vigetti D. Clerici M. Deleonibus S. Karousou E. Viola M. Moretto P. Heldin P. Hascall V.C. De Luca G. Passi A. Hyaluronan synthesis is inhibited by adenosine Monophosphate-activated protein kinase through the regulation of HAS2 activity in human Aortic smooth muscle cells J. Biol. Chem. 286 2011 7917 7924 10.1074/jbc.M110.193656 21228273 PMC3048678 63 Andugulapati S.B. Sundararaman A. Lahiry M. Rangarajan A. AMP-activated protein kinase promotes breast cancer stemness and drug resistance Dis. Model. Mech. 15 2022 10.1242/dmm.049203 dmm049203 PMC9150117 35195687 64 Hsu C.-C. Peng D. Cai Z. Lin H.-K. AMPK signaling and its targeting in cancer progression and treatment Semin. Cancer Biol. 85 2022 52 68 10.1016/j.semcancer.2021.04.006 33862221 PMC9768867 65 Wei S.C. Fattet L. Tsai J.H. Guo Y. Pai V.H. Majeski H.E. Chen A.C. Sah R.L. Taylor S.S. Engler A.J. Yang J. Matrix stiffness drives epithelial–mesenchymal transition and tumour metastasis through a TWIST1–G3BP2 mechanotransduction pathway Nat. Cell Biol. 17 2015 678 688 10.1038/ncb3157 25893917 PMC4452027 66 Liu X. Ye Y. Zhu L. Xiao X. Zhou B. Gu Y. Si H. Liang H. Liu M. Li J. Jiang Q. Li J. Yu S. Ma R. Su S. Liao J.-Y. Zhao Q. Niche stiffness sustains cancer stemness via TAZ and NANOG phase separation Nat. Commun. 14 2023 238 10.1038/s41467-023-35856-y 36646707 PMC9842735 67 Uhlén M. Fagerberg L. Mjoberg M. Proteomics. The human protein Atlas https://www.proteinatlas.org/ 2015 n.d. 68 Romani P. Brian I. Santinon G. Pocaterra A. Audano M. Pedretti S. Mathieu S. Forcato M. Bicciato S. Manneville J.-B. Mitro N. Dupont S. Extracellular matrix mechanical cues regulate lipid metabolism through Lipin-1 and SREBP Nat. Cell Biol. 21 2019 338 347 10.1038/s41556-018-0270-5 30718857 Appendix A Supplementary data The following is the Supplementary data to this article: Multimedia component 1 Multimedia component 1 Data availability Data will be made available on request. Appendix A Supplementary data to this article can be found online at https://doi.org/10.1016/j.mtbio.2025.102305 ",
  "metadata": {
    "Title of this paper": "Extracellular matrix mechanical cues regulate lipid metabolism through Lipin-1 and SREBP",
    "Journal it was published in:": "Materials Today Bio",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12475523/"
  }
}