{
  "title": "Paper_435",
  "abstract": "pmc J Clin Invest J Clin Invest 120 jcinvest J Clin Invest The Journal of Clinical Investigation 0021-9738 1558-8238 American Society for Clinical Investigation PMC12483557 PMC12483557.1 12483557 12483557 40762837 10.1172/JCI187204 187204 1 Research Article Inverted chimeric RNAi molecules synergistically cotarget MYC and KRAS in KRAS-driven cancers Chareddy Yogitha S. yogitha@email.unc.edu 1 2 3 Huggins Hayden P. hugginshp22@gmail.com 2 3 4 Sahoo Snehasudha S. sssahoo3@email.unc.edu 2 3 Stanland Lyla J. 3 Gutierrez-Ford Christina cgford@unc.edu 2 Whately Kristina M. kwhately@med.unc.edu 2 3 Edatt Lincy lincy13@email.unc.edu 2 3 Azam Salma H. sazam@email.unc.edu 2 Fleming Matthew C. mflem@email.unc.edu 5 6 Im Jonah jonah.h.im@gmail.com 2 4 Porrello Alessandro alessandro.porrello@gmail.com 2 3 Simmons Imani imsimmons03@gmail.com 2 Perry Jillian L. perryjl@email.unc.edu 7 8 Bowers Albert A. abower2@email.unc.edu 5 6 9 Egli Martin martin.egli@vanderbilt.edu 10 https://orcid.org/0000-0002-5250-2999 Pecot Chad V. pecot@email.unc.edu 3 11 12 1 2 3 4 5 6 7 8 9 10 11 12 Address correspondence to: Chad V. Pecot, Department of Medicine, University of North Carolia at Chapel Hill, 450 West Drive, Chapel Hill, North Carolina 27312, USA. Phone: 615.305.3955; Email: pecot@email.unc.edu 22 7 2025 1 10 2025 135 19 498024 e187204 27 11 2024 11 7 2025 22 07 2025 01 10 2025 01 10 2025 © 2025 Chareddy et al. 2025 Chareddy et al. https://creativecommons.org/licenses/by/4.0/ This work is licensed under the Creative Commons Attribution 4.0 International License. To view a copy of this license, visit http://creativecommons.org/licenses/by/4.0/ This article is available online at https://www.jci.org/articles/view/187204 Mutant KRAS has been implicated in driving a quarter of all cancer types. Although inhibition of the KRAS G12C G12C This study presents a novel chimeric siRNA that simultaneously targets KRAS and MYC, enhancing cancer inhibition in vitro and reducing tumor burden in vivo. Oncology Therapeutics Drug therapy Lung cancer Oncogenes National Institutes of Health https://doi.org/10.13039/100000002 R01CA215075,R01CA258451,1R41CA246848,1R44CA284932 National Institute of General Medical Sciences https://doi.org/10.13039/100000057 GM122741 pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement yes pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes Introduction Mutations in the GTPase KRAS are responsible for driving nearly 25% of all cancers ( 1 2 KRAS 3 4 5 G12C 6 G12C 7 9 G12C 10 11 12 17 G12C 8 9 18 19 G12C G12C Several studies have shown that mutant KRAS cooperates with the proto-oncogene c-Myc (MYC) in promoting and maintaining aggressive tumorigenesis through several mechanisms, including stimulation of inflammation, activation of pro-survival pathways, and suppression of apoptosis ( 20 22 16 23 25 26 26 27 30 4 31 35 36 38 KRAS activation can stabilize MYC either by initiating the phosphorylation of MYC at serine 62 via ERK1/2 signaling or by preventing the phosphorylation of MYC at threonine 58 via inhibition of GSK3β, which usually targets MYC protein for degradation ( 39 40 34 41 42 43 RNA interference–based (RNAi-based) therapies present a unique alternative strategy for targeting “undruggable” proteins like MYC and KRAS and operate through the RNA-induced silencing complex (RISC) ( 44 44 45 45 46 48 49 51 Results Identification of potent, chemically modified MYC and pan-KRAS siRNAs. To identify MYC MYC MYC Supplemental Table 1 https://doi.org/10.1172/JCI187204DS1 MYC Supplemental Figure 1A We transfected these siRNAs into MIA PaCa-2 pancreatic carcinoma cells (KRAS G12C MYC MYC Supplemental Figure 1B Supplemental Figure 1C To confer drug-like properties to the siRNAs ( 52 O 45 53 G12D MYC Supplemental Figure 2A Supplemental Figure 2B To assess antitumor activity, we evaluated siRNA transfection on spheroid formation to simulate the tumor microenvironment. Compared with NC siRNA, Mseq2 and Mseq3 dramatically reduced spheroid density in both cell lines ( Supplemental Figure 2C MYC Previous efforts in our laboratory led to the development of potent unmodified pan-KRAS siRNAs ( 54 54 45 51 52 O 55 Supplemental Figure 2 Cotargeting with KRAS and MYC siRNAs reduces tumorigenic properties in vitro. Mutant KRAS signaling stabilizes and hyperactivates MYC via ERK1/2, leading to MYC accumulation and sustained pro-tumorigenic signaling ( Supplemental Figure 3A 40 42 43 We evaluated the effects of RNAi-mediated KRAS and MYC silencing on tumorigenesis. Compared with NC siRNA and individual KRAS or MYC siRNAs, equimolar combinations of KRAS and MYC siRNAs resulted in significantly reduced spheroid formation in MIA PaCa-2 cells ( Supplemental Figure 3B G12V G13D Supplemental Figure 3C Inverted multivalent chimeras potently cotarget MYC and KRAS oncogenes. To ensure equimolar targeting of 2 siRNAs, we considered that phosphodiester bridges can confer “prodrug”-like activity in the plasma and allow for endonucleolytic metabolism within the target tissue ( 56 Figure 1A To test the chimeric siRNA designs, we evaluated equimolar transfections of the siRNAs at various doses and time points. Although both chimeric designs improved potency, we found that M2/K2 Inverted Chimera V1 was more potent at silencing both MYC KRAS Figure 1B Figure 1C Supplemental Figure 3D The enhanced potency of the inverted chimeric design was validated in additional cell lines ( Supplemental Figure 4 MYC KRAS KRAS Figure 1B Supplemental Figure 4 Supplemental Figure 4C Chimeric siRNAs are metabolized primarily in endosomes. The plasma half-life of ligand-conjugated siRNAs ranges from around 15 to 90 minutes, depending on variables such as the conjugated ligand, linker, oligonucleotide modifications, and delivery routes ( 50 57 53 58 57 Figure 2A 59 58 Figure 2B Supplemental Figure 5A Supplemental Figure 5B Figure 2C During the RNAi process, the RNase type III enzyme Dicer can process long dsRNA into 21- to 23-base-pair fragments ( 44 Supplemental Figure 6A Supplemental Figure 6 Figure 2D Chimeric bridge cleavage results in more potent 5′-guide overhangs. Argonaute2 (Ago2) is the key enzyme in RISC responsible for mediating RNAi ( 45 45 KRAS Supplemental Figure 7 To determine the identity of the metabolic products following endosomal processing, we incubated the M2/K2 Inverted Chimera in endosomal conditions for 48 hours and analyzed the samples with liquid chromatography–mass spectrometry (LC-MS). We detected nearly every potential metabolic product with dT overhangs, confirming cleavage at the thymidine bridge ( Supplemental Figure 8 Supplemental Table 2 We used an A-431 KRAS CRISPR knockout line stably transduced with a KRAS–firefly luciferase reporter system to evaluate knockdown efficiency on a 10-point dose-response curve ( 60 Figure 3A 56 Figure 3B Figure 3C It is possible that the potency is due to a shift in the seed region of the guide strand. To test whether this was the reason for the increase in potency, we created two Mseq2 and two Kseq2 siRNAs with overhangs that were perfectly complementary to the target mRNA ( Supplemental Figure 9A Supplemental Figure 9B Supplemental Figure 9C Figure 4, A and B Inverted MYC/KRAS chimeras synergistically target KRAS mutant cancers. To further stabilize the inverted chimera ( 59 Supplemental Figure 10A Supplemental Figure 10B Supplemental Figure 10C Supplemental Figure 10D Figure 5, A and B We found that M2/K2 Inverted Chimera V2 has far more potency than the individual siRNAs across several doses and cell lines, particularly for KRAS ( Figure 5C Supplemental Figure 11A Figure 5D Supplemental Figure 11B Figure 5E Figure 5F To evaluate the phenotypic effects of siRNA-mediated dual knockdown of MYC and KRAS, we conducted a dose-response assay and found that the inverted chimeric design substantially lowered the ED 50 Figure 6A Supplemental Figure 12 Figure 6B EGFR-targeting ligand enables specific uptake into tumors. Given the success of GalNAc-conjugated chemically optimized siRNAs ( 53 59 61 62 63 64 65 66 Figure 7A G12V n 3 53 53 Figure 7B Figure 7C To evaluate for biological effects on a protein level, we performed tumor immunohistochemistry (IHC). While both KRAS and MYC siRNA–treated groups showed a decrease in Ki67, M2/K2 Inverted Chimera V2 treatment resulted in a more significant reduction, consistent with the inhibitory effects on proliferation via on-target downregulation of MYC and KRAS. Only the inverted chimeric siRNA resulted in a small but significant increase in cleaved caspase-3. Consistent with potent on-target regulation, treatment with MYC siRNAs resulted in a 54% reduction in MYC IHC staining, and MYC/KRAS inverted chimeric siRNAs resulted in a highly significant 76% reduction ( Figure 7D Ligand-conjugated inverted MYC/KRAS chimeras have potent antitumor activity. To validate that the effect on cell viability was the result of specific gene targeting, we conducted dose-response assays in several cell lines comparing all treatment groups with an additional double-control chimera, which links 2 non-targeting siRNAs in the same configuration as M2/K2 Inverted Chimera V2. We found that the double-control chimeric siRNA had no effect on cancer cell viability ( Figure 8A Supplemental Figure 13A n 62 3 Supplemental Figure 13B Figure 8B Figure 8C Supplemental Figure 13C Figure 8D Figure 8E Figure 8F MYC KRAS Figure 8G To evaluate whether the chimeric design is an improvement over coadministration of the GE11–MYC Hi2OMe and GE11–KRAS Hi2OMe individual siRNAs, we compared these treatments using the HPAF-II (KRAS G12D 3 Supplemental Figure 13D Supplemental Figure 13E Figure 6B Figure 3C Figure 7B Figure 8F Clinical resistance to KRAS inhibitors is well documented, with MAPK effector upregulation, MYC amplification, and YAP/TAZ signaling emerging as key players in driving resistance ( 67 68 69 Supplemental Figure 12 Supplemental Figure 14A Supplemental Figure 14 Supplemental Figure 14 Finally, we compared the efficacy of the MYC/KRAS chimeric siRNA with a clinically approved KRAS G12C G12C 3 Figure 9A Supplemental Figure 15A Figure 9B Figure 9C Supplemental Figure 15B KRAS MYC Knowledge about the mechanisms of resistance to KRAS inhibition is rapidly developing; however, resistance to dual KRAS and MYC inhibition is poorly understood. In the H358 model, while tumors in the chimeric siRNA group showed significant responses to treatment (and even one complete regression), many tumors eventually lost responsiveness ( Figure 9D Figure 9E 12 16 70 G12C 71 72 S127 Discussion Therapies in oncology such as small-molecule inhibitors have resulted in remarkable improvements in survival. However, many well-characterized oncoproteins, notably MYC and about 90% of KRAS mutants, still fall into the class of “difficult-to-drug” targets. Additionally, despite the clinical success of KRAS G12C 10 11 12 17 73 39 40 In this study, we developed an inverted chimeric RNAi molecule that resulted in highly potent and synergistic cotargeting of KRAS and MYC. Our results demonstrate that the guide strand of a long chimeric siRNA strand was more potent than the same guide strand delivered as a traditional single siRNA. Unexpectedly, our data support a model that this greatly enhanced potency is the result of metabolism of the chimera’s thymidine bridge, which results in deoxythymidine (dT) overhangs on the 5′ end of the KRAS guide strand. While previous studies have found that 3′-dT overhangs can affect a siRNA’s potency and in vivo stability ( 74 75 76 77 78 79 57 The modularity of the inverted chimeric siRNAs shown in this study may provide a meaningful clinical advantage over traditional strategies such as small-molecule inhibitors because of their ability to target multiple “undruggable” genes. The thymidine bridge properties of these chimeric siRNAs ensure that the individual siRNA molecules of choice are delivered to the cell in equimolar proportions, another strong advantage over single-agent small-molecule inhibitors, which can only interact with one target. Additionally, the prodrug-like metabolic processing of these chimeric molecules in acidified lysosomes leads to dramatically more potent siRNA products. We observed that the MYC/KRAS chimeric siRNA combined with an approved KRAS G12C Despite potential low receptor density and intratumoral heterogeneity challenges in delivering ligand-conjugated siRNAs to tumors ( 51 50 Finally, our efficacy experiments in larger tumors indicate that there may be limitations to achieving sufficient delivery of this RNAi molecule, which may be related to increased tumor heterogeneity, disrupted vascular perfusion, or insufficient tumor loading, and should be further investigated. Additionally, despite the potential increase in therapeutic window under the chimeric siRNA, continued treatment does show the eventual development of resistance through YAP signaling, which may be a driver of resistance under dual KRAS/MYC protein suppression. Further optimization of ligand-conjugated delivery of inverted chimeras may enable improved selectivity and potency of these molecules while reducing toxic side effects. The features of the inverted chimeric siRNAs are attractive and applicable to other complex diseases beyond cancer that may require dual targeting, such as cardiometabolic disorders, neurodegeneration, inflammation, or infectious diseases ( 80 Methods Further information can be found in Supplemental Methods Sex as a biological variable. For murine studies, 8- to 12-week-old female athymic nude or C57BL/6 mice were used. Sex was not considered as a biological variable, as the incidence and outcome of human lung and pancreatic cancers are nearly equivalent for each sex. siRNA transfections. The sequences of all siRNAs are in Supplemental Table 1 54 RT-qPCR. Total RNA from cell lysates was purified using the Quick RNA MicroPrep Zymo Research Kit (Genesee Scientific). For mRNA analysis, cDNA was synthesized using the iScript cDNA Synthesis Kit (Bio-Rad) per the manufacturer’s instructions. Analysis of RNA levels was determined by a StepOnePlus Real-Time PCR System (Applied Biosystems) using SYBR Green Master Mix (Bio-Rad). A list of gene-specific primers used for RT-qPCR is shown in Supplemental Table 3 –ΔΔCt Cell viability experiments. Cell viability in response to siRNA treatment was evaluated with the CellTiter-Glo 2.0 Cell Viability Assay using the manufacturer’s protocol (Promega). Resuspended MIA PaCa-2 cells in culture medium were seeded at 1,000 cells per well, and resuspended A427 cells were seeded at 3,500 cells per well, in opaque, flat-bottom 96-well plates. All cells were counted with the Countess 3 Automated Cell Counter (Thermo Fisher Scientific). All siRNAs (suspended in serum-free medium with Lipofectamine RNAiMAX) were tested in triplicate starting at 40 or 20 nM and progressing through a 10-point serial dilution. Plates were incubated in culture conditions for 5–6 days. For viability readouts, 120 μL of medium was removed from each well, and an equal volume of CellTiter-Glo 2.0 (CTG) Reagent was added. Luminescence was measured at 530 nm excitation and 590 nm emission on a Synergy2 fluorescent plate reader (BioTek). Data were analyzed in GraphPad Prism. Experiments were repeated at least 3 times, and representative dose-response curves are shown in the figures. Luciferase experiments. Changes in KRAS–firefly luciferase expression in response to siRNA treatment were evaluated with the Luc-Pair Duo-Luciferase HT Assay Kit using the manufacturer’s protocol (Genecopoeia). Resuspended cells in culture medium were added to opaque, flat-bottom 96-well plates. A-431 KRAS-luciferase cells were seeded at 3,500 cells per well and were counted with the Countess 3 Automated Cell Counter (Thermo Fisher Scientific). All siRNAs (suspended in serum-free medium with Lipofectamine RNAiMAX) were tested in triplicate starting at 40 or 20 nM and progressing through a 10-point serial dilution. Plates were incubated in culture conditions for 3–4 days. For luciferase readouts, 120 μL of medium was removed from each well, and an equal volume of working FLuc reagent was added and incubated for 10 minutes. Luminescence was measured at 530 nm excitation and 590 nm emission on a Synergy2 fluorescent plate reader (BioTek). An equal volume of working RLuc reagent was subsequently added and incubated for an additional 5 minutes, and luminescence was measured as above. The ratio of luminescence from the firefly luciferase to the Renilla luciferase was then calculated. Data were analyzed in GraphPad Prism, and ED 50 50 50 3D spheroid formation assay. A427 and MIA PaCa-2 cells were seeded into 12-well plates and treated with 5, 10, or 20 nM of siRNAs and Lipofectamine RNAiMax in culture medium without antibiotic for 24 hours. Cells were then lifted with trypsin and counted. Five thousand cells from each condition were mixed with 50 μL of cold Matrigel (Corning) and plated onto 24-well glass-bottom plates. After solidification of the matrix, complete medium with 10% FBS and antibiotic was added to every well. Plates were incubated for 4–5 days and then imaged with a Leica Dmi8 inverted microscope (×5 objective). Spheroid area and number in each condition were quantified using Organoseg software ( 81 In vivo modeling and tissue processing. Animals were cared for according to guidelines set forth by the Association for Assessment and Accreditation of Laboratory Animal Care International and the US Public Health Service Policy on Humane Care and Use of Laboratory Animals. Mouse studies were approved and supervised by the University of North Carolina at Chapel Hill Institutional Animal Care and Use Committee. Athymic nude mice or C57BL/6 mice were between 8 and 12 weeks of age at the time of injection. Cells were trypsinized, washed, and resuspended in Hanks balanced salt solution (HBSS; Gibco), and 3.5 × 10 6 5 L W 2 L W L 3 Statistics. Results for each group were compared using unpaired 1-tailed Student’s t P Study approval. Mouse studies were approved and supervised by the University of North Carolina at Chapel Hill Institutional Animal Care and Use Committee. Data availability. All data generated or analyzed during this study (including values for all data points) are included in this published article and its supplemental information and Supporting Data Values GSE261735 Author contributions YSC, AAB, ME, and CVP were involved in conceptualization of the project and relevant aims. AP was involved in data curation and software implementation for large datasets (including RNA-Seq data). YSC, HPH, SSS, LJS, CGF, KMW, LE, SHA, MCF, JI, AP, JLP, and IS were involved in formal analysis, investigation, methodology, validation, and visualization for the data included in the article. CVP is the primary project administrator and acquired funding for the project. All authors read, edited, and approved the final manuscript. Supplementary Material Supplemental data Unedited blot and gel images Supplemental table 1 Supplemental table 2 Supplemental table 3 Supporting data values CVP was supported in part by NIH R01CA215075, R01CA258451, 1R41CA246848, and 1R44CA284932, a University Cancer Research Fund (UCRF) Innovator Award, a Kickstarter Venture Services Commercialization award, a Lung Cancer Initiative of North Carolina Innovation and Alumni Award, and a North Carolina Biotechnology Center Translational Research Grant. YSC was supported by a National Institute of General Medical Sciences T32 grant (GM122741) under the Program in Translational Medicine and a UCRF Innovator Award. HPH was supported in part by an NIH 1R41CA246848 award. We thank Albert Wielgus of the Pathology Services Core (PSC) for expert technical assistance with histopathology and digital pathology. The PSC is supported in part by a National Cancer Institute Center Core Support Grant (P30CA016086). We also acknowledge the University of North Carolina at Chapel Hill Lineberger Bioinformatics Core for providing the computational resources and workflow used for the RNA-Seq data processing. Conflict of interest: Copyright: Reference information: J Clin Invest 1 Mustachio LM et al Targeting KRAS Cancers (Basel) 2021 13 6 1204 10.3390/cancers13061204 33801965 PMC7999304 2 Friday BB Adjei AA K-ras as a target for cancer therapy Biochim Biophys Acta 2005 1756 2 127 144 10.1016/j.bbcan.2005.08.001 16139957 3 Waters AM Der CJ KRAS: the critical driver and therapeutic target for pancreatic cancer Cold Spring Harb Perspect Med 2018 8 9 a031435 10.1101/cshperspect.a031435 29229669 PMC5995645 4 Dang CV et al Drugging the ‘undruggable’ cancer targets Nat Rev Cancer 2017 17 8 502 508 10.1038/nrc.2017.36 28643779 PMC5945194 5 Verdine GL Walensky LD The challenge of drugging undruggable targets in cancer: lessons learned from targeting BCL-2 family members Clin Cancer Res 2007 13 24 7264 7270 10.1158/1078-0432.CCR-07-2184 18094406 6 Ostrem JM et al K-Ras(G12C) inhibitors allosterically control GTP affinity and effector interactions Nature 2013 503 7477 548 551 10.1038/nature12796 24256730 PMC4274051 7 Hallin J et al The KRAS G12C Cancer Discov 2020 10 1 54 71 10.1158/2159-8290.CD-19-1167 31658955 PMC6954325 8 Canon J et al The clinical KRAS(G12C) inhibitor AMG 510 drives anti-tumour immunity Nature 2019 575 7781 217 223 10.1038/s41586-019-1694-1 31666701 9 Hong DS et al KRAS G12C N Engl J Med 2020 383 13 1207 1217 10.1056/NEJMoa1917239 32955176 PMC7571518 10 Janne PA et al Adagrasib in non-small-cell lung cancer harboring a KRAS G12C N Engl J Med 2022 387 2 120 131 10.1056/NEJMoa2204619 35658005 11 Skoulidis F et al Sotorasib for lung cancers with KRAS N Engl J Med 2021 384 25 2371 2381 10.1056/NEJMoa2103695 34096690 PMC9116274 12 Awad MM et al Acquired resistance to KRAS G12C N Engl J Med 2021 384 25 2382 2393 10.1056/NEJMoa2105281 34161704 PMC8864540 13 Tanaka N et al Clinical acquired resistance to KRAS G12C Cancer Discov 2021 11 8 1913 1922 10.1158/2159-8290.CD-21-0365 33824136 PMC8338755 14 Tsai YS et al Rapid idiosyncratic mechanisms of clinical resistance to KRAS G12C inhibition J Clin Invest 2022 132 4 e155523 10.1172/JCI155523 34990404 PMC8843735 15 Xue JY et al Rapid non-uniform adaptation to conformation-specific KRAS(G12C) inhibition Nature 2020 577 7790 421 425 10.1038/s41586-019-1884-x 31915379 PMC7308074 16 Zhao Y et al Diverse alterations associated with resistance to KRAS(G12C) inhibition Nature 2021 599 7886 679 683 10.1038/s41586-021-04065-2 34759319 PMC8887821 17 Akhave NS et al Mechanisms of resistance to KRAS G12C Cancer Discov 2021 11 6 1345 1352 10.1158/2159-8290.CD-20-1616 33820777 PMC8178176 18 Uras IZ et al Targeting KRAS Int J Mol Sci 2020 21 12 4325 10.3390/ijms21124325 32560574 PMC7352653 19 Schirripa M et al KRAS G12C metastatic colorectal cancer: specific features of a new emerging target population Clin Colorectal Cancer 2020 19 3 219 225 10.1016/j.clcc.2020.04.009 32605718 20 Mahauad-Fernandez WD Felsher DW The Myc and Ras partnership in cancer: indistinguishable alliance or contextual relationship? Cancer Res 2020 80 18 3799 3802 10.1158/0008-5472.CAN-20-0787 32732221 PMC7501217 21 Kerkhoff E et al Regulation of c-myc expression by Ras/Raf signalling Oncogene 1998 16 2 211 216 10.1038/sj.onc.1201520 9464539 22 Kortlever RM et al Myc cooperates with Ras by programming inflammation and immune suppression Cell 2017 171 6 1301 1315 10.1016/j.cell.2017.11.013 29195074 PMC5720393 23 Macaya I et al Signature-driven repurposing of Midostaurin for combination with MEK1/2 and KRASG12C inhibitors in lung cancer Nat Commun 2023 14 1 6332 10.1038/s41467-023-41828-z 37816716 PMC10564741 24 Wang Y et al Targeting ST8SIA6-AS1 counteracts KRAS G12C Exp Hematol Oncol 2023 12 1 105 10.1186/s40164-023-00466-3 38104151 PMC10724920 25 Silvis MR et al MYC-mediated resistance to trametinib and HCQ in PDAC is overcome by CDK4/6 and lysosomal inhibition J Exp Med 2023 220 3 e20221524 10.1084/jem.20221524 36719686 PMC9930170 26 Dang CV MYC on the path to cancer Cell 2012 149 1 22 35 10.1016/j.cell.2012.03.003 22464321 PMC3345192 27 Jain M et al Sustained loss of a neoplastic phenotype by brief inactivation of MYC Science 2002 297 5578 102 104 10.1126/science.1071489 12098700 28 Soucek L et al Design and properties of a Myc derivative that efficiently homodimerizes Oncogene 1998 17 19 2463 2472 10.1038/sj.onc.1202199 9824157 29 Gabay M et al MYC activation is a hallmark of cancer initiation and maintenance Cold Spring Harb Perspect Med 2014 4 6 a014241 10.1101/cshperspect.a014241 24890832 PMC4031954 30 Soucek L et al Modelling Myc inhibition as a cancer therapy Nature 2008 455 7213 679 683 10.1038/nature07260 18716624 PMC4485609 31 Chen H et al Targeting oncogenic Myc as a strategy for cancer treatment Signal Transduct Target Ther 2018 3 5 10.1038/s41392-018-0008-7 29527331 PMC5837124 32 Wang C et al Alternative approaches to target Myc for cancer treatment Signal Transduct Target Ther 2021 6 1 117 10.1038/s41392-021-00500-y 33692331 PMC7946937 33 Carabet LA et al Therapeutic inhibition of Myc in cancer. Structural bases and computer-aided drug discovery approaches Int J Mol Sci 2018 20 1 120 10.3390/ijms20010120 30597997 PMC6337544 34 Soucek L et al Inhibition of Myc family proteins eradicates KRas-driven lung cancer in mice Genes Dev 2013 27 5 504 513 10.1101/gad.205542.112 23475959 PMC3605464 35 Han H et al Small-molecule MYC inhibitors suppress tumor growth and enhance immunotherapy Cancer Cell 2019 36 5 483 497 10.1016/j.ccell.2019.10.001 31679823 PMC6939458 36 Habib S et al Anti- c-myc Biomedicines 2020 8 12 612 10.3390/biomedicines8120612 33333729 PMC7765184 37 Miller AJ et al Chronic microangiopathy due to DCR-MYC, a Myc-targeted short interfering RNA Am J Kidney Dis 2020 75 4 513 516 10.1053/j.ajkd.2019.09.011 31866228 38 Whitfield JR Soucek L The long journey to bring a Myc inhibitor to the clinic J Cell Biol 2021 220 8 e202103090 10.1083/jcb.202103090 34160558 PMC8240852 39 Sears R et al Multiple Ras-dependent phosphorylation pathways regulate Myc protein stability Genes Dev 2000 14 19 2501 2514 10.1101/gad.836800 11018017 PMC316970 40 Vaseva AV et al KRAS suppression-induced degradation of MYC is antagonized by a MEK5-ERK5 compensatory mechanism Cancer Cell 2018 34 5 807 822 10.1016/j.ccell.2018.10.001 30423298 PMC6321749 41 Ischenko I et al KRAS-dependent suppression of MYC enhances the sensitivity of cancer cells to cytotoxic agents Oncotarget 2017 8 11 17995 18009 10.18632/oncotarget.14929 28152508 PMC5392302 42 Podsypanina K et al Oncogene cooperation in tumor maintenance and tumor recurrence in mouse mammary tumors induced by Myc and mutant Kras Proc Natl Acad Sci U S A 2008 105 13 5242 5247 10.1073/pnas.0801197105 18356293 PMC2278195 43 Tran PT et al Combined inactivation of MYC and K-Ras oncogenes reverses tumorigenesis in lung adenocarcinomas and lymphomas PLoS One 2008 3 5 e2125 10.1371/journal.pone.0002125 18461184 PMC2365560 44 Pecot CV et al RNA interference in the clinic: challenges and future directions Nat Rev Cancer 2011 11 1 59 67 10.1038/nrc2966 21160526 PMC3199132 45 Egli M Manoharan M Re-engineering RNA molecules into therapeutic agents Acc Chem Res 2019 52 4 1036 1047 10.1021/acs.accounts.8b00650 30912917 46 Adams D et al Patisiran, an RNAi therapeutic, for hereditary transthyretin amyloidosis N Engl J Med 2018 379 1 11 21 10.1056/NEJMoa1716153 29972753 47 Ray KK et al Two phase 3 trials of inclisiran in patients with elevated LDL cholesterol N Engl J Med 2020 382 16 1507 1519 10.1056/NEJMoa1912387 32187462 48 Sardh E et al Phase 1 trial of an RNA interference therapy for acute intermittent porphyria N Engl J Med 2019 380 6 549 558 10.1056/NEJMoa1807838 30726693 49 Wong SC et al HIF2α-targeted RNAi therapeutic inhibits clear cell renal cell carcinoma Mol Cancer Ther 2018 17 1 140 149 10.1158/1535-7163.MCT-17-0471 29079709 50 Klein D et al Centyrin ligands for extrahepatic delivery of siRNA Mol Ther 2021 29 6 2053 2066 10.1016/j.ymthe.2021.02.015 33601052 PMC8178446 51 Abdelaal AM Kasinski AL Ligand-mediated delivery of RNAi-based therapeutics for the treatment of oncological diseases NAR Cancer 2021 3 3 zcab030 10.1093/narcan/zcab030 34316717 PMC8291076 52 Khvorova A Watts JK The chemical evolution of oligonucleotide therapies of clinical utility Nat Biotechnol 2017 35 3 238 248 10.1038/nbt.3765 28244990 PMC5517098 53 Nair JK et al Multivalent N-acetylgalactosamine-conjugated siRNA localizes in hepatocytes and elicits robust RNAi-mediated gene silencing J Am Chem Soc 2014 136 49 16958 16961 10.1021/ja505986a 25434769 54 Pecot CV et al Therapeutic silencing of KRAS using systemically delivered siRNAs Mol Cancer Ther 2014 13 12 2876 2885 10.1158/1535-7163.MCT-14-0074 25281617 PMC4416486 55 Brown CR et al Investigating the pharmacodynamic durability of GalNAc-siRNA conjugates Nucleic Acids Res 2020 48 21 11827 11844 10.1093/nar/gkaa670 32808038 PMC7708070 56 Subramanian RR et al Enhancing antisense efficacy with multimers and multi-targeting oligonucleotides (MTOs) using cleavable linkers Nucleic Acids Res 2015 43 19 9123 9132 10.1093/nar/gkv992 26446989 PMC4627098 57 Nair JK et al Impact of enhanced metabolic stability on pharmacokinetics and pharmacodynamics of GalNAc-siRNA conjugates Nucleic Acids Res 2017 45 19 10969 10977 10.1093/nar/gkx818 28981809 PMC5737438 58 Dominska M Dykxhoorn DM Breaking down the barriers: siRNA delivery and endosome escape J Cell Sci 2010 123 pt 8 1183 1189 10.1242/jcs.066399 20356929 59 Foster DJ et al Advanced siRNA designs further improve in vivo performance of GalNAc-siRNA conjugates Mol Ther 2018 26 3 708 717 10.1016/j.ymthe.2017.12.021 29456020 PMC5910670 60 Papke B et al Silencing of oncogenic KRAS by mutant-selective small interfering RNA ACS Pharmacol Transl Sci 2021 4 2 703 712 10.1021/acsptsci.0c00165 33860195 PMC8033609 61 Sorkin A Duex JE Quantitative analysis of endocytosis and turnover of epidermal growth factor (EGF) and EGF receptor Curr Protoc Cell Biol 2010 Chapter 15 Unit 15.14 10.1002/0471143030.cb1514s46 20235100 PMC2878126 62 Li Z et al Identification and characterization of a novel peptide ligand of epidermal growth factor receptor for targeted delivery of therapeutics FASEB J 2005 19 14 1978 1985 10.1096/fj.05-4058com 16319141 63 Genta I et al GE11 peptide as an active targeting agent in antitumor therapy: a minireview Pharmaceutics 2017 10 1 2 10.3390/pharmaceutics10010002 29271876 PMC5874815 64 Alexander-Bryant AA et al Dual peptide-mediated targeted delivery of bioactive siRNAs to oral cancer cells in vivo Oral Oncol 2017 72 123 131 10.1016/j.oraloncology.2017.07.004 28797448 PMC5580030 65 Stanland LJ et al A first-in-class EGFR-directed KRAS G12V selective inhibitor [published online June 19, 2025]. Cancer Cell 10.1016/j.ccell.2025.05.016 40541192 PMC12230742 66 Weingartner A et al Less is more: novel hepatocyte-targeted siRNA conjugates for treatment of liver-related disorders Mol Ther Nucleic Acids 2020 21 242 250 10.1016/j.omtn.2020.05.026 32590173 PMC7321783 67 Dilly J et al Mechanisms of resistance to oncogenic KRAS inhibition in pancreatic cancer Cancer Discov 2024 14 11 2135 2161 10.1158/2159-8290.CD-24-0177 38975874 PMC11528210 68 Isermann T et al KRAS inhibitors: resistance drivers and combinatorial strategies Trends Cancer 2025 11 2 91 116 10.1016/j.trecan.2024.11.009 39732595 69 Wasko UN et al Tumour-selective activity of RAS-GTP inhibition in pancreatic cancer Nature 2024 629 8013 927 936 10.1038/s41586-024-07379-z 38588697 PMC11111406 70 Yaeger R et al Molecular characterization of acquired resistance to KRASG12C-EGFR inhibition in colorectal cancer Cancer Discov 2023 13 1 41 55 10.1158/2159-8290.CD-22-0405 36355783 PMC9827113 71 Edwards AC et al TEAD inhibition overcomes YAP1/TAZ-driven primary and acquired resistance to KRASG12C inhibitors Cancer Res 2023 83 24 4112 4129 10.1158/0008-5472.CAN-23-2994 37934103 PMC10821578 72 Hagenbeek TJ et al An allosteric pan-TEAD inhibitor blocks oncogenic YAP/TAZ signaling and overcomes KRAS G12C inhibitor resistance Nat Cancer 2023 4 6 812 828 10.1038/s43018-023-00577-0 37277530 PMC10293011 73 Hofmann MH et al Expanding the reach of precision oncology by drugging all KRAS mutants Cancer Discov 2022 12 4 924 937 10.1158/2159-8290.CD-21-1331 35046095 PMC9394389 74 Strapps WR et al The siRNA sequence and guide strand overhangs are determinants of in vivo duration of silencing Nucleic Acids Res 2010 38 14 4788 4797 10.1093/nar/gkq206 20360048 PMC2919711 75 Chiu YL Rana TM RNAi in human cells: basic structural and functional features of small interfering RNA Mol Cell 2002 10 3 549 561 10.1016/S1097-2765(02)00652-4 12408823 76 Chiu YL Rana TM siRNA function in RNAi: a chemical modification analysis RNA 2003 9 9 1034 1048 10.1261/rna.5103703 12923253 PMC1370469 77 Khvorova A et al Functional siRNAs and miRNAs exhibit strand bias Cell 2003 115 2 209 216 10.1016/S0092-8674(03)00801-8 14567918 78 Schwarz DS et al Asymmetry in the assembly of the RNAi enzyme complex Cell 2003 115 2 199 208 10.1016/S0092-8674(03)00759-1 14567917 79 Lisowiec-Wachnicka J et al A systematic study on the influence of thermodynamic asymmetry of 5′-ends of siRNA duplexes in relation to their silencing potency Sci Rep 2019 9 1 2477 10.1038/s41598-018-36620-9 30792489 PMC6385221 80 Ramsay RR et al A perspective on multi-target drug discovery and design for complex diseases Clin Transl Med 2018 7 1 3 10.1186/s40169-017-0181-2 29340951 PMC5770353 81 Borten MA et al Automated brightfield morphometry of 3D organoid populations by OrganoSeg Sci Rep 2018 8 1 5319 10.1038/s41598-017-18815-8 29593296 PMC5871765 Version 1 07/31/2025 In-Press Preview Version 2 10/01/2025 Electronic publication Figure 1 Design and in vitro activity of MYC/KRAS chimeric siRNAs. ( A 4 4 B C MYC KRAS Figure 2 Stability of MYC/KRAS chimeric siRNAs in different cellular conditions. ( A B C A C D Figure 3 Characterization of MYC/KRAS chimeric siRNA mechanism of action. ( A 50 50 50 B C 50 50 50 Figure 4 Model of inverted chimeric siRNA cleavage product within Ago2 complex. ( A B KRAS Figure 5 Characterization of MYC/KRAS inverted chimeric siRNA with enhanced 2′OMe chemical modification. ( A B 4 A C MYC KRAS D E 50 F Figure 6 Effects of M2/K2 inverted chimeric siRNA on cancer cell viability. ( A 50 50 B P P P P Figure 7 Characterization of receptor-targeting ligand GE11. ( A B C D t P P Figure 8 In vivo activity and efficacy of M2/K2 inverted chimeric siRNA. ( A B n t C n n t D E n t F G MYC KRAS n n t P P P P Figure 9 Long-term in vivo efficacy of M2/K2 inverted chimeric siRNA. ( A n B C B C P P D E S127 P P ",
  "metadata": {
    "Title of this paper": "Automated brightfield morphometry of 3D organoid populations by OrganoSeg",
    "Journal it was published in:": "The Journal of Clinical Investigation",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12483557/"
  }
}