{
  "title": "Paper_327",
  "abstract": "pmc bioRxiv 3848 biorxiv BIORXIV bioRxiv 2692-8205 Cold Spring Harbor Laboratory Preprints PMC12485715 PMC12485715.1 12485715 12485715 41040222 10.1101/2025.09.22.677923 1 preprint 1 Article Dual Modes of Gene Regulation by CDK12 Wang Yubao Baluapuri Apoorva Manokaran Cherubin Ni Jing Jiang Tao Janssens Roel Marteijn Jurgen http://orcid.org/0000-0001-9321-518X Adelman Karen Zhao Jean Roberts Thomas 23 9 2025 498069 2025.09.22.677923 01 10 2025 02 10 2025 03 10 2025 https://creativecommons.org/licenses/by-nc-nd/4.0/ This work is licensed under a Creative Commons Attribution-NonCommercial-NoDerivatives 4.0 International License http://biorxiv.org/lookup/doi/10.1101/2025.09.22.677923 nihpp-2025.09.22.677923.pdf The process of transcription is driven forward by the activity of kinases including CDK7, CDK9 and CDK12. Accordingly, acute inhibition of any of these kinases results in profound downregulation of gene expression. Here, we discover that loss or inhibition of CDK12 also significantly upregulates a set of coding and non-coding loci, whose activation could contribute to the anti-proliferative effects of CDK12 inhibitors. Mechanistically, CDK12 inhibition impairs transcription elongation, leading to increased RNA polymerase II termination or arrest in long genes. However, short genes such as MYC and enhancer RNAs are highly transcribed in the absence of CDK12 activity. Indeed, in HER2+ breast cancer, a malignancy where CDK12 is co-amplified with HER2 and its expression correlates with disease status, CDK12 inhibition markedly elevates MYC expression to induce lethality. The dual effects of CDK12 inhibition elucidated herein clarify its role in transcriptional control and have significant translational implications. pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement no pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version yes pmc-prop-is-scanned-article no pmc-prop-preprint yes pmc-prop-in-epmc yes ",
  "metadata": {
    "Title of this paper": "\nDual Modes of Gene Regulation by CDK12\n",
    "Journal it was published in:": "bioRxiv",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12485715/"
  }
}