{
  "title": "Paper_121",
  "abstract": "pmc Plast Reconstr Surg Glob Open Plast Reconstr Surg Glob Open 2522 prsgo GOX Plastic and Reconstructive Surgery Global Open 2169-7574 Wolters Kluwer Health PMC12490650 PMC12490650.1 12490650 12490650 10.1097/GOX.0000000000007176 GOX-D-25-00500 1 3 Peripheral Nerve Special Topic Reliability and Accuracy of Generative Artificial Intelligence Tools in Providing General Information on Migraine Surgery Raposio Edoardo MD, PhD, FICS * † Baldelli Ilaria MD, PhD * † From the * † Edoardo Raposio, MD, PhD, FICS, Department of Surgical Sciences and Integrated Diagnostics, University of Genova, L.go R. Benzi 10, 16132 Genova, Italy, E-mail: edoardo.raposio@unige.it 10 2025 02 10 2025 13 10 498115 e7176 16 5 2025 14 8 2025 02 10 2025 03 10 2025 03 10 2025 Copyright © 2025 The Authors. Published by Wolters Kluwer Health, Inc. on behalf of The American Society of Plastic Surgeons. 2025 https://creativecommons.org/licenses/by-nc-nd/4.0/ This is an open-access article distributed under the terms of the Creative Commons Attribution-Non Commercial-No Derivatives License 4.0 (CCBY-NC-ND) Background: Numerous publicly available generative artificial intelligence tools have been introduced, aimed at research use or for the general public. The aim of this study was to investigate what information could be obtained by querying 9 of these publicly available software tools regarding the possible outcomes and complications of migraine surgery. Methods: We consulted 9 of the most well-known and widely used generative artificial intelligence tools: ChatGPT, Gemini, Perplexity, Elicit, SciSpace, Consensus, PaperPal, Julius, and Mistral AI. Each tool was asked the same question: “Detail the outcomes and complications of migraine surgery.” Results: The results we obtained were, on the whole, very satisfactory. All the tools used, in addition to being extremely fast, provided sensible and scientifically reliable answers, albeit with varying degrees of accuracy. The accuracy of the answers provided was found to be directly proportional to the number of scientific references each tool used to generate its response. The tools that provided the most complete and detailed answers were, in order, Consensus, SciSpace, Perplexity, and ChatGPT. Conclusions: In the answers provided by all the software, the universally accepted principles of migraine surgery were accurately listed, both in terms of outcomes and the rate and severity of complications. Regarding outcomes, the high success rate of the procedure was consistently emphasized. pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement yes pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes OPEN-ACCESS TRUE COUNTRY ITALY SDC T Takeaways Question: Findings: Meaning: INTRODUCTION Generative artificial intelligence (GenAI) is a subset of artificial intelligence that uses generative models to create text, images, videos, or other forms of data. These models learn the underlying patterns and structures of their training data and use this knowledge to generate new data based on input, typically provided in the form of natural language prompts. In simple terms, these tools interpret specific questions (prompts) posed by users and respond using a combination of information freely available online (eg, from sources such as Wikipedia or free texts). Recently, numerous publicly available GenAI tools have been introduced, aimed at research use or for the general public. These software tools are increasingly used both by healthcare professionals for research or institutional applications and by the general public to obtain information about the diagnosis and treatment of various diseases. Indeed, the emergence of GenAI technologies makes accessing, processing, and sharing medical information more efficient and effective. The application of GenAI with respect to surgical procedures and healthcare encompasses the following: 1. Improving medical knowledge and education GenAI’s processing capabilities can summarize volumes of medical literature, clinical guidelines, and research work into bite-sized information, making them easier to grasp. It assists in medical education by developing case reports, explaining surgical procedures, and role-playing as patients for training simulations. GenAI helps surgical students and professionals stay updated on current advances in surgery through a virtual tutor. 2. Support for clinical decision-making Virtual assistants provide patients and clinicians with automated precision medicine guidelines tailored to their specific conditions, generating comprehensive suggestions based on medical databases. Surgeons may use AI to audit best practice reviews, complication risk assessments, and postoperative care checklist evaluations for sound decision-making. 3. Educating and involving patients GenAI enables the creation of personalized health instructions by modifying surgical complexities into easily digestible terms for understanding by the patients. Chatbots and virtual assistants are capable of addressing preoperative preparation, restoration, and recovery period FAQs. Enhanced patient understanding, appreciation, and consent for treatment is aided by AI-generated multimedia content such as videos and interactive diagrams. 4. Research and systematic reviews AI enables quicker searches of literature, conducting meta-analyses, and identifying relevant studies. Global studies are analyzed through the lens of GenAI, focusing on trends in surgical outcomes, complication rates, and novel techniques over time. 5. Surgical planning and simulation Tools powered by AI aid in the preoperative planning phase by integrating imaging data of patients (magnetic resonance imaging and computed tomography scans) into 3-dimensional models, which enables proper surgical strategy formulation and execution. AI allows surgeons to virtually practice and polish skills before actually assisting in procedures. Following the initial proposal by Guyuron et al 1 2 5 MATERIALS and METHODS We consulted 9 of the most well-known and widely used GenAI tools: ChatGPT (OpenAI, San Francisco, CA), Gemini (Google DeepMind, London, United Kingdom), Perplexity (Perplexity AI, Inc., San Francisco, CA), Elicit (Elicit Research PBT, Oakland, CA), SciSpace (Polydora Technologies Private Ltd, Bangalore, India), Consensus (American Fork, UT), PaperPal (Cactus Communications Services Pte. Ltd, Singapore), Julius (Triller, New York, NY), and Mistral AI (Paris, France). The software tools were chosen based on 3 criteria: relevance to the field of biomedical research (excluding programs more oriented toward other applications, such as the generation of music, images and movies, or programming), their popularity (at the end of December 2024), and their free use. Each tool was asked the same question: “Detail the outcomes and complications of migraine surgery.” The research was carried out during the month of December 2024. The responses, along with the bibliographic references (when available) on which the answers were based, were collected and analyzed. At present, no official guidelines have been published in the literature regarding the surgical treatment of migraine. To evaluate the completeness and adequacy of the responses, we therefore relied exclusively on the number and appropriateness of the sources cited, as well as on our clinical experience of more than 15 years. RESULTS A logically valid answer was obtained from all the software. Response times were similar and always short (<4 s). ( See appendix, Supplemental Digital Content 1 https://links.lww.com/PRSGO/E373 A first distinction and analysis between the various answers was made by us on the basis of the number and quality of bibliographic sources used as references (Table 1 6 15 7 14 15 16 19 10 12 19 21 7 14 22 23 24 27 7 17 28 29 30 32 29 Table 1. Summary of Analyses Performed Using the Various Software Tools Covered in the Study Software References Degree of Detail of the Answers Flesch-Kincaid Score ChatGPT 3 +++ 11.80 Gemini 0 + 12.35 Perplexity 4 +++ 16.62 Elicit 4 ++ 15.55 SciSpace 5 +++ 15.14 Consensus 10 +++ 17.06 PaperPal 8 ++ 15.62 Julius 4 ++ 17.17 Mistral AI 0 + 11.84 +++, high; ++, medium; +, sufficient. The tools that provided the most complete and detailed answers were, in order, Consensus, SciSpace, Perplexity, and ChatGPT. Although the accuracy of the first 2 can be easily attributed to the high number of citations consulted and reported, for the latter 2 (particularly ChatGPT), the generative algorithm likely evaluates a broader range of documents than those explicitly cited. Considering that these tools are predominantly used by the general public rather than medical professionals conducting research, this approach may be both appropriate and adequate. In the answers provided by all the software, the universally accepted principles of migraine surgery were accurately listed, both in terms of outcomes and the rate and severity of complications. Regarding outcomes, the high success rate of the procedure was consistently emphasized. As for complications, they were always described as minor, rare, and usually temporary. Some tools also included additional details, perhaps overly specialized for a general audience. For instance, Consensus provided details on binary outcomes and differences between endoscopic and nonendoscopic approaches. SciSpace outlined success rates for various trigger sites. Perplexity categorized outcomes based on migraine intensity, frequency, and resolution rates. ChatGPT highlighted, among other things, details on patients’ postoperative quality of life, the different trigger sites, patient selection, and types of complications. As can be easily inferred, the 2 tools that did not report bibliographic references were the only ones where the degree of detail of the answers was lower. For example, the various percentages related to success rates or complications were almost never reported. The sensibleness and correctness of the answers were always maintained, even in these cases. To assess the level and degree of comprehensibility of the provided answers, we used the reference software Text Inspector (WebLingua Ltd, England). Created by Professor of Applied Linguistics, Stephen Bax, Text Inspector won the 2017 British Council ELTons Digital Innovation Award and is supported by its academic partner, the Centre for Research in English Language Learning and Assessment at the University of Bedfordshire. Text Inspector evaluates the level of education required for the full understanding of a given text, providing a score corresponding to each level of education (Flesch-Kincaid score, Table 2 1 Table 2. Flesch-Kincaid Score Flesch-Kincaid Score Corresponding US Educational Level Approximate UK Equivalent Typical Usage 1.0–3.0 Early elementary school Primary school (KS1–2) Children’s books, beginner reading materials 4.0–6.0 Upper elementary/middle school Primary school (KS2)/lower secondary (KS3) Standard classroom texts, general fiction 7.0–9.0 Middle school/early high school Lower secondary (KS3) Most adult fiction, general nonfiction, newspapers 10.0–12.0 High school Upper secondary (KS4–5) Academic texts, some technical writing 13.0+ College/university Higher education (university or degree-level studies) Advanced academic papers, complex technical manuals DISCUSSION To the best of our knowledge, only 1 other study has been published recently, by Chartier et al, 30 The results we obtained were, on the whole, very satisfactory. All the tools used, in addition to being extremely fast, provided sensible and scientifically reliable answers, albeit with varying degrees of accuracy. The language used was always appropriate and correct, and it was consistently fully understandable, although to people with a higher level of education (college/university) (Table 2 The capabilities of a GenAI system depend on the modality or type of the dataset used. Most of the software we used based their answers on data from accredited scientific literature; no tool used alternative or unofficial sources. This is a particularly important finding, as it helps ensure the reliability and scientific validity of the answers provided. Using generic websites as a source (rather than data derived from official scientific publications) could pose a risk of analyzing and incorporating inaccurate or incorrect information. In our investigation, this practice was apparently used by only 1 GenAI tool, Perplexity. However, it should be noted that, in this instance, the websites referenced belonged to 2 recognized scientific institutions with a high degree of reliability (the American Society of Plastic Surgeons and UT Southwestern Medical Center). Therefore, their inclusion in the dataset used by Perplexity should not be seen as a limitation but rather as an added value. As mentioned earlier, the accuracy and level of detail in the responses corresponded to the number of references cited, which ranged from 10 to none. However, it is important to note that, although less detailed, the answers provided by the 2 tools that did not cite scientific references were still logical and reasonable. The validity and reasonableness of the answers provided are also significant, as there are currently no regulations or legal requirements to ensure the accuracy of the data generated by the various GenAI tools. It is extremely important to emphasize that our survey was not intended to create a “ranking” of the selected software. The applications of GenAI are vast, ranging from document creation to the development of videos, sounds, and images. Each of the GenAI tools we used has its own specific strengths and numerous applications compared with the others. Our study aimed solely to evaluate the general reliability of the answers provided, particularly regarding a “niche” topic in plastic surgery, which is continuously evolving. Our study was limited to evaluating the reasonableness and accuracy of the answers to the given question, particularly with reference to the potential nonprofessional use of the information provided. In our opinion, it would be interesting for future studies to evaluate the usefulness and accuracy of GenAI tools for medical professionals interested in migraine surgery, particularly as an aid in producing reviews or systematic studies on the subject. The use of GenAI in healthcare is rising rapidly, but it triggers ethical issues of equal proportion, some of which include the following. Protection of Data and Its Security GenAI systems usually depend on numerous datasets, out of which some may have sensitive patient data. Adhering to data privacy policies such as Health Insurance Portability and Accountability Act (HIPAA) and General Data Protection Regulation (GDPR) is paramount if patient confidentiality is to be preserved. Having personal health information subjected to unregulated access creates a dire need for high AI security measures on most medical applications. Biased Algorithms and Lack of Transparency It is common for numerous AI approaches to have “black boxes,” procedures where their logic is opaque to the user. In medicine, it is critical to decipher how AI arrives at particular information. AI algorithms can have bias if poorly trained, which can lead to differences in the treatment of patients and adversely affect underserved groups. There must be disciplined effort toward such issues from researchers and developers. Likelihood of Misinformation GenAI can produce texts with authority but are untruthful or misleading, which may affect the medical choice. Making certain that AI-generated medical content adheres to the guidelines, as well as is evidence-based, must be additionally ensured. The study lacks a benchmark comparison against responses from migraine surgery experts. Comparing GenAI responses to those of board-certified neurologists or headache surgeons would provide a valuable reference point to assess whether AI-generated responses align with expert consensus. The application of GenAI in the medical and surgical fields brings to mind the well-known computer science saying, “garbage in, garbage out.” Almost all surgical and medical journals have a paywall, restricting access to high-quality medical information. This issue is prevalent in plastic surgery, where physicians are bound by ethical obligations to maintain patient confidentiality, particularly concerning photographs documenting their condition. GenAI has the capability to retrieve the abstracts of articles published on certain databases such as PubMed, but the information it provides is skewed toward what is available at no charge. Materials that are available at no charge tend to be biased toward presenting information in a positive light without the critique of trained professionals. For these reasons, GenAI is not able to provide the detailed and nuanced critical analysis required for clinical decision-making. Dissenting or minority perspectives are also neglected in content created by AI. Another significant problem is the understandability of the answers obtained. As already mentioned, the scores obtained were all very high (ranging from 11.80 to 17.17), reflecting the high level of education required to fully understand the responses provided. On one hand, this reflects the reliability of the sources; on the other hand, it poses a challenge for individuals with lower levels of education to fully comprehend the responses. In fact, recent studies highlighted that, regardless of plastic surgery procedure or subspecialty, resources presenting plastic surgery information to patients exceeded the American Medical Association and National Institutes of Health recommended sixth- to eighth-grade reading level. 31 32 33 34 35 36 37 38 39 40 Barriers to accessing appropriately written patient information on the internet may contribute to disparities in referral, involvement, satisfaction, and outcomes. These elements contribute to and align with the broader “health literacy crisis” 41 42 DISCLOSURE The authors have no financial interest to declare in relation to the content of this article. Supplementary Material Published online 2 October 2025.  Disclosure statements are at the end of this article, following the correspondence information. Related Digital Media are available in the full-text version of the article on www.PRSGlobalOpen.com REFERENCES 1. Guyuron B Varghai A Michelow BJ Corrugator supercilii muscle resection and migraine headaches. Plast Reconstr Surg 2000 106 429 434; discussion 435 10946944 10.1097/00006534-200008000-00030 2. Huayllani MT Janis JE Migraine surgery and determination of success over time by trigger site: a systematic review of the literature. Plast Reconstr Surg 2023 151 120e 135e 10.1097/PRS.0000000000009775 36251961 3. Raposio E Caruana G Frontal endoscopic myotomies for chronic headache. J Craniofac Surg 2015 26 e201 e203 25887206 10.1097/SCS.0000000000001353 4. Peled ZM Gfrerer L Hagan R Anatomic anomalies of the nerves treated during headache surgery. Plast Reconstr Surg Glob Open 2023 11 e5439 38025616 10.1097/GOX.0000000000005439 PMC10662871 5. Raposio E Bertozzi N Trigger site inactivation for the surgical therapy of occipital migraine and tension-type headache: our experience and review of the literature. Plast Reconstr Surg Glob Open 2019 7 e2507 31942299 10.1097/GOX.0000000000002507 PMC6908332 6. Gfrerer L Hulsen JH McLeod M Migraine surgery: an all or nothing phenomenon? Prospective evaluation of surgical outcomes. Ann Surg 2019 269 994 999 29394166 10.1097/SLA.0000000000002697 7. Elhawary H Barone N Baradaran A Efficacy and safety of migraine surgery. Ann Surg 2021 275 e315 e323 10.1097/SLA.0000000000005057 35007230 8. Alrahbeni T Mahal A Alkhouri A Surgical interventions for intractable migraine: a systematic review and meta-analysis. Int J Surg 2024 110 6306 6313 38626410 10.1097/JS9.0000000000001480 PMC11486983 9. Chang IA Wells MW Wang GM Nonpharmacologic treatments for chronic and episodic migraine: a systematic review and meta-analysis. Plast Reconstr Surg 2023 152 1087 1098 36940145 10.1097/PRS.0000000000010429 10. Israel JS Gfrerer L Austen WG Outcomes in migraine surgery. Afifi A Peled Z Janis J Surgical Treatment of Chronic Headaches and Migraines Springer; 2020 183 193 11. Nagori S Jose A Roychoudhury A Surgical management of migraine headaches: a systematic review and meta-analysis. Ann Plast Surg 2019 83 232 240 30557190 10.1097/SAP.0000000000001743 12. Raposio G Raposio E Principles and techniques of migraine surgery. Eur Rev Med Pharmacol Sci 2022 26 6110 6113 36111912 10.26355/eurrev_202209_29628 13. Gfrerer L Maman D Tessler E Nonendoscopic deactivation of nerve triggers in migraine headache patients: surgical technique and outcomes. Plast Reconstr Surg 2014 134 771 778 24945947 10.1097/PRS.0000000000000507 14. Jose A Nagori SA Roychoudhury A Surgical management of migraine headache. J Craniofac Surg 2017 29 e106 e108 10.1097/SCS.0000000000004078 29068972 15. Guyuron B Kriegler J Davis J Five-year outcome of surgical treatment of migraine headaches. Plast Reconstr Surg 2011 127 603 608 20966820 10.1097/PRS.0b013e3181fed456 16. Hatef DA Gutowski KA Culbertson GR A comprehensive review of surgical treatment of migraine surgery safety and efficacy. Plast Reconstr Surg 2020 146 187e 195e 10.1097/PRS.0000000000007020 32740592 17. Egan KG Ghasemzadeh R Israel JS Evaluation of migraine surgery outcomes through social media. Plast Reconstr Surg Glob Open 2016 4 e1084 27826478 10.1097/GOX.0000000000001084 PMC5096533 18. Yang Y Fan Y Song M Occipital nerve stimulation for migraine: a systematic review. Pain Pract 2015 16 509517 10.1111/papr.12303 25865962 19. Raposio E Raposio G Surgical therapy of migraine: a 12-year single-center experience. Eur J Plast Surg 2023 46 699 705 20. Raposio G Raposio E Temporal surgery for chronic migraine treatment: a minimally-invasive perspective. Ann Med Surg 2022 76 103578 10.1016/j.amsu.2022.103578 PMC9052296 35495408 21. Shikowitz-Behr L Austen WJ Postoperative management after headache and migraine surgery. Afifi A Peled Z Janis J Surgical Treatment of Chronic Headaches and Migraines Springer 2020 127 131 22. Urhan N Sağlam Y Akkaya F Long-term results of migraine surgery and the relationship between anatomical variations and pain. J Plast Reconstr Aesthet Surg 2023 82 284 290 37279613 10.1016/j.bjps.2023.02.005 23. Kurlander DE Ascha M Sattar A In-depth review of symptoms, triggers, and surgical deactivation of frontal migraine headaches (site I). Plast Reconstr Surg 2016 138 681 688 27556607 10.1097/PRS.0000000000002479 24. Faizo E Fallata A Mirza I The efficacy of trigger site surgery in the elimination of chronic migraine headache: an update in the rate of success and failure. Cureus 2024 16 e54504 38516471 10.7759/cureus.54504 PMC10955441 25. Evans AG Hill DS Grush AE Outcomes of surgical treatment of migraines: a systematic review & meta-analysis. Plast Surg (Oakv) 2023 31 192 205 37188139 10.1177/22925503211036701 PMC10170648 26. Omranifard M Abdali H Ardakani MR A comparison of outcome of medical and surgical treatment of migraine headache: in 1 year follow-up. Adv Biomed Res 2016 5 121 27563631 10.4103/2277-9175.186994 PMC4976529 27. Janis JE Hehr J Huayllani MT Functional outcomes between headache surgery and targeted botox injections: a prospective multicenter pilot study. JPRAS Open 2023 38 152 162 37920284 10.1016/j.jpra.2023.09.009 PMC10618225 28. Available at https://www.plasticsurgery.org/Documents/Health-Policy/Positions/ASPS-Statement_Migraine-Headache-Surgery.pdf 29. Available at https://utswmed.org/conditions-treatments/migraine/migraine-surgery/migraine-qualityoutcomes/ 30. Chartier C Gfrerer L Knoedler L Artificial intelligence–enabled evaluation of pain sketches to predict outcomes in headache surgery. Plast Reconstr Surg 2023 151 405 411 36696328 10.1097/PRS.0000000000009855 31. Tiourin E Barton N Janis JE Health literacy in plastic surgery: a scoping review. Plast Reconstr Surg Glob Open 2022 10 e4247 35433155 10.1097/GOX.0000000000004247 PMC9007188 32. Tran BNN Singh M Singhal D Readability, complexity, and suitability of online resources for mastectomy and lumpectomy. J Surg Res 2017 212 214 221 28550909 10.1016/j.jss.2017.01.012 33. Seth AK Vargas CR Chuang DJ Readability assessment of patient information about lymphedema and its treatment. Plast Reconstr Surg 2016 137 287e 295e 10.1097/01.prs.0000475747.95096.ab 26818318 34. Vargas CR Ricci JA Lee M The accessibility, readability, and quality of online resources for gender affirming surgery. J Surg Res 2017 217 198 206 28587891 10.1016/j.jss.2017.05.026 35. Chen AD Ruan QZ Bucknor A Social media: is the message reaching the plastic surgery audience? Plast Reconstr Surg 2019 144 773 781 31461046 10.1097/PRS.0000000000005988 36. Vargas CR Kantak NA Chuang DJ Assessment of online patient materials for breast reconstruction. J Surg Res 2015 199 280 286 26088084 10.1016/j.jss.2015.04.072 37. Fanning JE Okamoto LA Levine EC Content and readability of online recommendations for breast implant size selection. Plast Reconstr Surg Glob Open 2023 11 e4787 36699215 10.1097/GOX.0000000000004787 PMC9872969 38. Ricci JA Vargas CR Chuang DJ Readability assessment of online patient resources for breast augmentation surgery. Plast Reconstr Surg 2015 135 1573 1579 26017593 10.1097/PRS.0000000000001230 39. Patel AA Joshi C Varghese J Do websites serve our patients well? A comparative analysis of online information on cosmetic injectables. Plast Reconstr Surg 2022 149 655e 668e 10.1097/PRS.0000000000008921 35139065 40. Kaleeny J Levine E Okamoto L Blepharoplasty online: critical analysis of content and patient comprehensibility. Aesthetic Plast Surg 2024 48 2793 2802 38789805 10.1007/s00266-024-04083-1 PMC11300528 41. Barton N Janis JE Missing the mark: the state of health care literacy in plastic surgery. Plast Reconstr Surg Glob Open 2020 8 e2856 33133907 10.1097/GOX.0000000000002856 PMC7572040 42. Fanning JE Escobar-Domingo MJ Foppiani J Improving readability and automating content analysis of plastic surgery webpages with ChatGPT. J Surg Res 2024 299 103 111 38749313 10.1016/j.jss.2024.04.006 ",
  "metadata": {
    "Title of this paper": "Improving readability and automating content analysis of plastic surgery webpages with ChatGPT.",
    "Journal it was published in:": "Plastic and Reconstructive Surgery Global Open",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12490650/"
  }
}