{
  "title": "Paper_537",
  "abstract": "pmc RSC Adv RSC Adv 4079 rscadv RA RSC Advances 2046-2069 Royal Society of Chemistry PMC12481191 PMC12481191.1 12481191 12481191 41035479 10.1039/d5ra04981d d5ra04981d 1 Chemistry Simultaneous conversion of dialkyl phosphites to dialkyl phosphoric acids and SeO 2 https://orcid.org/0000-0003-0495-0006 H-6057-2011 Kaboudin Babak a Esfandiari Hesam a Sabzalipour Ali a Roudsari Zahra Oushyani b https://orcid.org/0000-0002-9330-178X Varmaghani Fahimeh a https://orcid.org/0000-0001-5415-568X Zhang Tianjian c https://orcid.org/0000-0001-5130-3026 Gu Yanlong c  a Department of Chemistry, Institute for Advanced Studies in Basic Sciences Gava Zang Zanjan 45137-66731 Iran kaboudin@gmail.com kaboudin@iasbs.ac.ir  b Department of Medical Biotechnology, School of Medicine, Zanjan University of Medical Sciences Zanjan Iran  c School of Chemistry and Chemical Engineering, Huazhong University of Science & Technology Wuhan 430074 China 30 9 2025 26 9 2025 15 43 497604 36213 36218 12 7 2025 15 9 2025 30 09 2025 01 10 2025 02 10 2025 This journal is © The Royal Society of Chemistry 2025 The Royal Society of Chemistry https://creativecommons.org/licenses/by-nc/3.0/ This article is licensed under a Creative Commons Attribution-Non Commercial 3.0 Unported Licence A novel, very simple, one-way, economical, and convenient reaction method for the simultaneous synthesis of dialkyl phosphoric acids and selenium nanoparticles has been developed. This communication describes the synthesis and characterization of selenium nanoparticles through the reactions of dialkyl phosphites and selenium dioxide. Dialkyl phosphites serve as reducing agents for converting selenium dioxide (a hazardous selenium source) to selenium nanoparticles (Se NPs), and conversely, selenium dioxide oxidizes dialkyl phosphites to dialkyl phosphoric acids. The impact of solvents, temperature, and ratio of materials is included in this study. Most of the prepared Se NPs tend to agglomerate, and their stability improved by the addition of β-cyclodextrin. In addition to enhancing the stability of Se NPs by cyclodextrin, the anticancer properties of the as-prepared Se NPs stabilized by β-cyclodextrin are studied. The reported method presents the conversion of selenium dioxide (a hazardous selenium source) to valuable Se NPs (hemispherical Se crystals) and industrially applicable dialkyl phosphoric acids from inexpensive materials with zero E factor and one atom economy. The reported method presents the conversion of selenium dioxide to valuable anticancer Se NPs (stabilize by β-cyclodextrin) and synthesis of industrially applicable dialkyl phosphoric acids from inexpensive materials. Iran National Science Foundation 10.13039/501100003968 4025386 Institute for Advanced Studies in Basic Sciences 10.13039/501100007513 Unassigned pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement yes pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes pubstatus Paginated Article Introduction The development of safe, efficient, and economical synthesis methods is one of the main challenges for chemists. 1–3 4–6 7–9 10 11 12 13 14 15 16 17 18 19 Organophosphorus esters are important materials that have large applications in agricultural, medicinal, industrial, and organic synthesis. 20–22 23–25 26 3 27 o o 2 28 The most common selenium sources for the synthesis of Se NPs are sodium selenite, sodium selenate, selenous acid, sodium selenosulphate, and 1,2,3-selenadiazole. Selenium in selenite and selenate forms has a hazardous effect even at extremely low concentrations. In order to avoid the use of hazardous selenium sources and additives (reductants and stabilizers) for the synthesis of Se NPs, a direct, atom-efficient, and simple transformation of SeO 2 2 29,30 2 4 24 Results and discussion Our continued interest in the green synthesis of organophosphorus compounds motivated us to explore the possibility of synthesizing dialkyl phosphoric acids from dialkyl phosphites in the presence of SeO 2 31 2 Scheme 1 2 2 2 2 3 Scheme 1 Reaction of SeO 2 With the optimized conditions in hand, the reaction between various dialkyl phosphites and SeO 2 Table 1 2 n Table 1 Reaction of SeO 2 a  a Yields refers to isolated compound 2 for the reaction of 1 (1 mmol) with SeO 2 b Compound 1g decomposed in the reaction condition. c The reaction was carried out using acetonitrile as the solvent. Linear secondary alkyl chains, such as iso t via 2 2 2 In the next attempt, the conversion of SeO 2 3 2 2 3 2 Scheme 2 Scheme 2 Reaction of SeO 2 3 2 1-Hydroxy-(2-chlorophenyl)methylphosphinic acid 3 was obtained on a gram scale from the reaction of an aldehyde with hypophosphorus acid at reflux in ethanol for 48 h ( Scheme 2 2 Scheme 2 To obtain information on the size and morphology of Se particles, all the collected samples were subjected to TEM analysis. TEM analysis of the Se particles revealed that the majority of particles agglomerated in all the samples (for example, see Fig. S50 in SI), except Se particles (DMP-Se NPs) collected from the reaction of SeO 2 Fig. 1 Fig. 1 TEM micrograph of DMP-Se NPs. The particle size distribution from the TEM micrographs revealed that particle sizes were 25–60 nm (Fig. S47; particle size distribution diagram of DMP-Se NPs). XRD pattern of DMP-Se NPs is shown in Fig. 2 Fig. 2 XRD pattern of DMP-Se NPs. Furthermore, corresponding to the color change of the reaction mixture from colorless to red, formation of Se NPs was confirmed by a sharp absorbance peak of the Se nanoparticles at 265 nm (Fig. S47). XPS spectrum of DMP-Se NPs is shown in Fig. S48. The XPS spectrum of Se revealed a binding energy of 55.18 eV for the purified selenium nanoparticles, confirming the presence of elemental selenium (Se0). The XPS spectrum of oxygen showed broad peaks, indicating the presence of different chemical states of oxygen. The O 1s peaks at 530.6–530.9 eV were attributed to the non-bridging oxygen in the phosphate group (P <svg xmlns=\"http://www.w3.org/2000/svg\" version=\"1.0\" width=\"13.200000pt\" height=\"16.000000pt\" viewBox=\"0 0 13.200000 16.000000\" preserveAspectRatio=\"xMidYMid meet\"><metadata>\nCreated by potrace 1.16, written by Peter Selinger 2001-2019\n</metadata><g transform=\"translate(1.000000,15.000000) scale(0.017500,-0.017500)\" fill=\"currentColor\" stroke=\"none\"><path d=\"M0 440 l0 -40 320 0 320 0 0 40 0 40 -320 0 -320 0 0 -40z M0 280 l0 -40 320 0 320 0 0 40 0 40 -320 0 -320 0 0 -40z\"/></g></svg> 31 The peak at 532.5–535.9 eV was assigned to the combined effects of singly bonded oxygen (–O–) in C–O–P groups, chemisorbed oxygen and oxygen in water. 32 33 As mentioned, TEM analysis showed that in the reaction media, the prepared Se NPs start to aggregate and form larger particles. In continuation to our efforts and literature reports on the synthesis of metal nanoparticles stabilized by cyclodextrins, 34 2 Fig. 3 Fig. 3 (a) Reaction mixture of SeO 2 The formation of non-aggregated Se NPs was confirmed by FE-SEM analysis. As shown in the FE-SEM image (Fig. S49 in SI), Se particles were clearly visible as hemispherical structures. Furthermore, the anticancer properties of the β-cyclodextrin-stabilized Se NPs (β-CD@SeNPs) were studied (all biological samples were purchased from the Iranian Biological Resource Center). The viability of the mouse and human breast cancer cell lines treated with different concentrations of Se NPs was evaluated using the MTT assay after 24 hours. Results depicted in Fig. S50 demonstrated that Se NPs suppressed the proliferation of breast cancer cells in a concentration-dependent manner. Regarding to the mouse breast cancer cells, the inhibitory concentration (IC 50 −1 −1 50 −1 50 −1 This study evidenced that β-CD@SeNPs can directly induce cell death in cultured mouse and human breast cancer cell lines. β-CD@SeNPs reduced cell viability in two human breast cancer cell lines, namely, MDA-MB-231 and MCF-7, and a mouse derived breast cancer cell line, 4T1. These results were consistent with earlier reports that indicated Se NPs can inhibit cell proliferation and induce apoptosis in cancer cell lines. 35,36 A decrease in viability of MDA-MB-231, MCF-7 and 4T1 cells treated with all concentrations of Se NPs confirmed that the reduction in cell number was due to enhanced cell death. In this study, cells were exposed to DMEM media containing different concentrations of Se NPs. In 4T1 cells, the IC 50 37 38 Based on our review of the literature on the conversion of SeO 2 2 Scheme 3 2 via 31 2 Scheme 3 Proposed reaction mechanism. The oxidative and reductive properties of SeO 2 2 Fig. 4 2 −1 2 1 2 2 2 Scheme 2 2 ii 2 ii iv 1 Fig. 4 Cyclic voltammograms (curves of a–i) of SeO 2 Conclusion In summary, this study focuses on the simultaneous synthesis of dialkyl phosphoric acids and selenium nanoparticles by a novel, eco-friendly, non-toxic, and sustainable method. The method involves the reaction of dialkyl phosphites with selenium dioxide in water under an optimal condition of 2 : 1 ratio of dialkyl phosphites to selenium dioxide. Dialkyl phosphites act as a reducing agent for converting selenium dioxide to selenium nanoparticles (Se NPs), and conversely, selenium dioxide oxidizes dialkyl phosphites to dialkyl phosphoric acids. Further, the Se NPs are characterized for their morphological and structural features by appropriate advanced analytical methods. TEM analysis suggests that the hemispherical-shaped nanoparticles with smooth surfaces are polydispersed. The reported method presents the synthesis of valuable Se NPs (hemispherical Se crystals) and industrially applicable dialkyl phosphoric acids from inexpensive materials with zero E factor and atom economy. Studies on the anticancer properties of β-cyclodextrin-stabilized Se NPs (β-CD@SeNPs) indicated that cells that proliferate more rapidly tend to exhibit greater sensitivity to anticancer treatments, and 4T1 has the lowest doubling time among the studied cell lines. Experimental General methods All chemicals were commercial products. NMR spectra were obtained using a 400 MHz Bruker Avance instrument, with the chemical shifts being reported as δ ppm and couplings expressed in Hertz. The chemical shift data for each signal on 1H NMR were given in units of δ relative to CHCl 3 δ 3 3 3 δ δ General procedure for the conversion of dialkyl phosphites to dialkyl phosphoric acids A solution of selenium dioxide (110 mg, 0.5 mmol) in either water or acetonitrile (4.0 mL) was prepared. Dialkyl phosphites or diaryl phosphine oxide 1 (1.0 mmol) was then added to the solution at room temperature under air. The mixture was stirred for 3 hours, during which a red coloration developed, indicating the formation of selenium nanoparticles. The reaction mixture was allowed to stand for an additional 12 hours to facilitate nanoparticle aggregation and growth. Subsequently, the solution was filtered through a 0.45 μm filter to separate the selenium nanoparticles from the solution. Finally, the filtrate was subjected to thermal treatment at 80 °C to remove the solvent, yielding the final product 2 without further purification. Conflicts of interest There are no conflicts to declare. Supplementary Material RA-015-D5RA04981D-s001 This work was funded by the Iran National Science Foundation (INSF) under project No. 4025386. The authors also gratefully acknowledge support from the Institute for Advanced Studies in Basic Sciences (IASBS). The authors would like to thank Ali Seif from IASBS for the help in graphic designing. Data availability The data supporting this article have been included as part of the Supplementary Information (SI). Supplementary information: details of analytical data of the products and copies of NMRs. See DOI: https://doi.org/10.1039/d5ra04981d References Lovato K. Fier P. S. Maloney K. M. Nat. Rev. Chem. 2021 5 546 563 37117583 10.1038/s41570-021-00288-z Simon M. O. Li C. J. Chem. Soc. Rev. 2012 41 1415 1427 22048162 10.1039/c1cs15222j Cortes-Clerget M. Yu J. Kincaid J. R. A. Walde P. Gallou F. Lipshutz B. H. Chem. Sci. 2021 12 4237 4266 34163692 10.1039/d0sc06000c PMC8179471 Butler R. N. Coyne A. G. Chem. Rev. 2010 110 6302 6337 20815348 10.1021/cr100162c Kar S. Sanderson H. Roy K. Benfenati E. Leszczynski J. Chem. Rev. 2022 122 3637 3710 34910451 10.1021/acs.chemrev.1c00631 Toda K. T. anf F. Chem. Rev. 2000 100 1025 1074 11749257 10.1021/cr940089p Bisht N. Phalswal P. Khanna P. Mater. Adv. 2022 3 1415 1431 Chhabria S. Encycl. Nanosci. Nanotehnol. 2016 20 1 32 Tinggi U. Environ. Health Prev. Med. 2008 13 102 108 19568888 10.1007/s12199-007-0019-4 PMC2698273 Zhang J. Spallholz J. E. Toxicity of selenium compounds and nano-selenium particles General, Applied and Systems Toxicology D. A. Casciano S. C. Sahu John Wiley & Sons Hoboken, NJ, USA 2011 Baig N. Kammakakm I. Falath W. Mater. Adv. 2021 2 1821 1871 (a) Huang X. Chen X. Chen Q. Yu Q. Sun D. Liu J. Acta Biomater. 2016 30 397 407 26518106 10.1016/j.actbio.2015.10.041 (b) Duncan T. V. J. Colloid Interface Sci. 2011 363 1 24 21824625 10.1016/j.jcis.2011.07.017 PMC7094330 (a) Sampath S. Sunderam V. Manjusha M. Dlamini Z. Lawrance A. V. Molecules 2024 29 801 38398553 10.3390/molecules29040801 PMC10893520 (b) Huang Y. Su E. Ren J. Qu X. Nano Today 2021 38 101205 (a) Zhang Y. Zheng W. Liu W. Chen T. Cao W. Li X. Wong Y.-S. ACS Nano 2012 6 6578 6591 22823110 10.1021/nn202452c (b) Kong L. Yuan Q. Zhu H. Li Y. Guo Q. Wang Q. Bi X. Gao X. Biomaterials 2011 32 6515 6522 21640377 10.1016/j.biomaterials.2011.05.032 Guisbiers G. Lara H. H. Mendoza-Cruz R. Naranjo G. Vincent B. A. Peralta X. G. Nash K. L. Nanomedicine 2017 13 1095 1103 27793789 10.1016/j.nano.2016.10.011 PMC5660926 Singh S. C. Mishra S. K. Srivastava R. K. Gopal R. J. Phys. Chem. C 2010 114 17374 17384 (a) Tzeng W.-Y. TsengT Y.-H. Yeh T. Tu C. –M. Sankar R. Chen Y.-H. Huang B.-H. Chou F.-C. Luo C.-W. Opt. Express 2020 28 685 694 32118991 10.1364/OE.381898 (b) Quintana M. Haro-Poniatowski E. Morales J. Batina N. Appl. Surf. Sci. 2002 195 175 186 Mayers B. T. Liu K. Sundewrland D. Xia Y. Chem. Mater. 2003 15 3852 3858 Cittrarasu V. Kaliannan D. Dharman K. Maluventhen V. Easwaran M. Liu W. C. Sci. Rep. 2021 11 1032 33441811 10.1038/s41598-020-80327-9 PMC7806947 Kaboudin B. Daliri P. Faghih S. Esfandiari H. Front. Chem. 2022 10 890696 35721002 10.3389/fchem.2022.890696 PMC9200139 Vandevelde M. Simoens A. Vandekerckhove B. Stevens C. RSC Med. Chem. 2024 15 998 1002 38516602 10.1039/d4md00043a PMC10953488 Murugavel R. Choudhury A. Walawalkar M. G. Pothiraja R. Rao C. N. Chem. Rev. 2008 108 3549 3655 18588351 10.1021/cr000119q (a) Smith K. W. Persinski L. J. US Pat. 1995 (b) Smith K. W. Persinski L. J. Chem. Abstr. 1995 123 87963 Cai Z. Zeng X. Zhang Y. Liu Y. Tang G. Zhao Y. Synyt A. Catal 2022 364 2916 2921 Ali M. M. Taha M. H. Killa H. M. J. Radioanal. Nucl. Chem. 2014 300 963 967 Tachimori S. Krooss B. Nakamura H. Radioanal J. Chem 1978 43 53 63 (a) Aithken R. A. Colett C. J. Masher S. T. E. Synthesis 2012 44 2515 2518 (b) Mesher S. T. Collett C. PCT Int. Appl. WO 2010/022496 2010 (c) Mesher S. T. Collett C. Chem. Abstr. 2010 152 339215 (a) Wu P.-L. Chen J.-H. Huang D.-S. J. Chin. Chem. Soc. 1999 46 967 (b) Wu P.-L. Chen J.-H. Huang D.-S. J. Chem., Abstr. 2000 132 166275 Krief A. Hevesi L. Selenium Dioxide Oxidations Organoselenium Chemistry I Springer Berlin, Heidelberg 1988 Kaboudin B. Alaie S. Yokomatsu T. Tetrahedron: Asymmetry 2011 22 1813 1816 Kannan A. G. Choudhury N. R. Dutta N. K. Polymer 2007 48 7078 7086 Moulder J. F. Stickle W. F. Sobol P. E. Bomben K. Chastain J. Handbook of X-ray photoelectron spectroscopy Perkin-Elmer Corporation, Physical Electronics Division M. N. Eden Prairie 1992 Pelavin M. Hendrickson D. Hollander J. Jolly W. J. Phys. Chem. 1970 74 1116 1121 Kaboudin B. Burunli B. Nazerian M. Zhang T. Gu Y. J. Organomet. Chem. 2025 1025 123477 Varlamova E. G. Baimler I. V. Gudkov S. V.  et al. Appl. Sci. 2023 13 10763 Nguyen T. H. D. Vardhanabhuti B. Lin M. Mustapha A. Food Control 2017 77 17 24 Khosravi A. Asadi J. Med. Lab. J. 2021 15 23 27 Kremmer T. Pälyi I. Daubner D. Boldizsar M. Vincze B. Paulik E. Sugar J. Pokorny E. Tury E. Anticancer Res. 1991 11 1807 1813 1768053 ",
  "metadata": {
    "Title of this paper": "\n",
    "Journal it was published in:": "RSC Advances",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12481191/"
  }
}