{
  "title": "Paper_780",
  "abstract": "pmc Clin Case Rep Clin Case Rep 2542 ccr CCR3 Clinical Case Reports 2050-0904 Wiley PMC12477054 PMC12477054.1 12477054 12477054 41031278 10.1002/ccr3.71021 CCR371021 CCR3-2025-05-1522.R1 1 Case Report Case Report Buschke–Fischer–Brauer Keratoderma: A Case Report of a Rare Skin Disorder Ahmad Dyala Sayed  1 Nasser Rim  1 Al‐janabi Moatasem Hussein https://orcid.org/0000-0003-1675-4125  2 dr.3esami2022@gmail.com Hassan Fouz  1   1 Department of Dermatology and Sexually Transmitted Disease Tishreen University Hospital Lattakia Syria   2 Department of Pathology Cancer Research Center, Tishreen University Hospital Lattakia Syria * Correspondence: dr.3esami2022@gmail.com 28 9 2025 10 2025 13 10 497443 10.1002/ccr3.v13.10 e71021 16 9 2025 07 5 2025 18 9 2025 28 09 2025 30 09 2025 01 10 2025 © 2025 The Author(s). Clinical Case Reports https://creativecommons.org/licenses/by-nc/4.0/ This is an open access article under the terms of the http://creativecommons.org/licenses/by-nc/4.0/ ABSTRACT Buschke–Fischer–Brauer keratoderma is a rare autosomal dominant disorder presenting as hyperkeratotic lesions on the palms and soles. Diagnosis requires clinical and histopathological evaluation. Management is symptomatic with keratolytics like salicylic acid and urea. Early recognition and ongoing care improve the quality of life for patients with this chronic condition. Buschke–Fischer–Brauer keratoderma genodermatosis hereditary keratoderma palmoplantar keratoderma punctate palmoplantar keratoderma pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement no pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes source-schema-version-number 2.0 cover-date October 2025 details-of-publishers-convertor Converter:WILEY_ML3GV2_TO_JATSPMC version:6.6.4 mode:remove_FC converted:28.09.2025  D. S. Ahmad R. Nasser M. H. Al‐janabi F. Hassan Buschke–Fischer–Brauer Keratoderma: A Case Report of a Rare Skin Disorder Clinical Case Reports 13 10 2025 e71021 10.1002/ccr3.71021  Funding: Guarantor of the article: Fouz Hassan 1 Introduction Palmoplantar Keratoderma (PPK) is a broad term for a group of heterogeneous diseases characterized by hyperkeratosis of the palms and soles [ 1 2 3 4 5 6 7 5 8 2 Case History/Examination A 44‐year‐old woman presented with a 15‐year history of multiple asymptomatic, small, firm keratotic lesions on her palms and soles. The patient reported a positive family history, with both her father and grandmother having similar lesions. Her past medical history and systemic review were unremarkable. On examination, numerous brownish, pitted hyperkeratotic papules coalesced into larger verrucous plaques on both palms and soles (Figures 1 2 FIGURE 1 Hyperkeratotic papules and plaques on the palms. FIGURE 2 Hyperkeratotic papules and plaques on the soles. The patient underwent routine laboratory tests, including a complete blood count, liver enzymes, creatinine, urea, electrolytes, and a chest X‐ray. All results were within normal limits. Genetic analysis was not performed as it is unavailable in our country. Two skin biopsies were obtained from hyperkeratotic lesions. Histopathological examination revealed massive hyperkeratosis, hypergranulosis, acanthosis, and papillomatosis, with a dermal lymphocytic infiltrate (Figure 3 FIGURE 3 Hematoxylin and eosin‐stained microscopic images of the lesion. (A) Low‐power view showing hyperkeratosis (40×); (B) Acanthosis and papillomatosis (40×); (C) Dermal lymphocytic infiltrate (100×); (D) Hypergranulosis (200×). 3 Differential Diagnosis, Investigations, and Treatment The patient's clinical features and histopathology findings ruled out other conditions such as psoriasis, lichen planus, and verruca vulgaris. The presence of hyperkeratosis, acanthosis, and papillomatosis was consistent with Buschke–Fischer–Brauer Keratoderma. The patient was prescribed a topical regimen consisting of salicylic acid (10 g), urea (10 g), sulfur (2 g), and Vaseline (20 g), along with urea 40% cream. 4 Outcome and Follow‐Up The patient experienced partial relief, although the lesions persisted. 5 Discussion PPPK, specifically Buschke–Fischer–Brauer disease, is a rare genetic disorder characterized by hyperkeratotic lesions on the palms and soles. The condition follows an autosomal dominant inheritance pattern and typically presents in early adulthood. Due to its rarity, there is limited literature available, with only a few case reports [ 1 2 5 8 A combination of clinical and histopathological evaluation is essential for diagnosing PPPK. In our patient, brownish pitted papules and plaques on the palms and soles, without nail, hair, or mucosal involvement, were characteristic. Histopathology revealed hyperkeratosis, hypergranulosis, acanthosis, and papillomatosis, aligning with descriptions in the literature [ 3 5 6 4 Treatment options for PPPK are primarily symptomatic, aimed at reducing lesions and improving quality of life. Common treatments include keratolytics, such as salicylic acid and urea, and systemic retinoids in more severe cases. Although our patient experienced partial improvement, the persistence of the lesions is common in PPPK, highlighting the chronic nature of the disease [ 5 7 6 Conclusion Buschke–Fischer–Brauer keratoderma is a rare but distinct form of PPPK that requires careful diagnosis and ongoing management. Our case contributes to the limited body of literature and emphasizes the importance of recognizing this condition, particularly in patients with a positive family history and characteristic lesions. Author Contributions  Dyala Sayed Ahmad: Rim Nasser: Moatasem Hussein Al‐janabi: Fouz Hassan: Ethics Statement The authors have nothing to report. Consent Written consent for the publication of patient photographs and medical information was obtained. Conflicts of Interest The authors declare no conflicts of interest. Acknowledgments The authors have nothing to report. Data Availability Statement The authors have nothing to report. References 1 O. V. Grabovskaya N. P. Teplyuk Y. V. Kolesova D. V. Ignatyev Hereditary Keratoderma. Clinical Case: Unna–Toast Keratoderma and Buschke–Fischer–Brauer Keratoderma Russian Journal of Skin and Venereal Diseases 25 4 2022 303 312 2 R. Bukhari W. Alhawsawi A. A. Radin H. D. Jan K. Al Hawsawi M. Al Ahmadi Punctate Palmoplantar Keratoderma: A Case Report of Type 1 (Buschke‐Fischer‐Brauer Disease) Case Reports in Dermatology 11 3 2019 292 296 31762743 10.1159/000503337 PMC6873031 3 A. Knowles M. Adams D. A. Glass II M. J. Adams D. Glass Punctate Palmoplantar Keratoderma: A Case Report Cureus 15 1 2023 e33769 36793812 10.7759/cureus.33769 PMC9924831 4 J. R. Antonio G. B. D. Oliveira N. C. P. Rossi L. G. G. Pires Exuberant Clinical Picture of Buschke‐Fischer‐Brauer Palmoplantar Keratoderma in Bedridden Patient Anais Brasileiros de Dermatologia 89 2014 819 821 25184927 10.1590/abd1806-4841.20142923 PMC4155966 5 J. P. Prathibha V. V. Aithal Punctate Palmoplantar Keratoderma: A Case Report and Literature Review Clinical Dermatology Review 7 2 2023 194 198 6 S. S. Vishal Anand U. R. Rakshith M. S. Srikanth A Review on Palmoplantar Keratodermas International Journal of Pharmaceutical Sciences and Nanotechnology (IJPSN) 15 6 2022 6258 7 A. Bansal H. Munde M. Guptaand S. Munde Palmoplantar Keratoderma: Rare Case Report Journal of Cytology & Histology 12 2021 567 8 M. Li L. Yang H. Shi Loss‐Of‐Function Mutation in AAGAB in Chinese Families With Punctuate Palmoplantar Keratoderma British Journal of Dermatology 169 1 2013 168 171 10.1111/bjd.12289 23448244 ",
  "metadata": {
    "Title of this paper": "Loss‐Of‐Function Mutation in AAGAB in Chinese Families With Punctuate Palmoplantar Keratoderma",
    "Journal it was published in:": "Clinical Case Reports",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12477054/"
  }
}