{
  "title": "Paper_43",
  "abstract": "pmc Gut Microbes Gut Microbes 1365 gmic Gut Microbes 1949-0976 1949-0984 Taylor & Francis PMC12490001 PMC12490001.1 12490001 12490001 41025329 10.1080/19490976.2025.2555619 2555619 1 Version of Record Research Article Research Paper Intermittent fasting triggers interorgan communication to improve the progression of diabetic osteoporosis Z. GUAN ET AL. GUT MICROBES https://orcid.org/0000-0003-3977-8998 Guan Zhiyuan  a  * Xiao Wenyu  a  * Guan Zhiqiang  b  * Xiao Jin  c  * Jin Xuehan  a Conceptualization Data curation Liu Shengfu  a Qin Yin  d  * Conceptualization Data curation Validation Visualization Writing – original draft Writing – review & editing https://orcid.org/0000-0002-4186-1355 Luo Liying  e a Tongji University Shanghai China b Xuzhou Municipal Hospital Affiliated with Xuzhou Medical University Xuzhou Jiangsu China c Affiliated Municipal Hospital of Xuzhou Medical University Xuzhou Jiangsu Province China d Wuxi Ninth People’s Hospital Affiliated to Soochow University Wuxi Jiangsu China e Shanghai Jiao Tong University School of Medicine Shanghai China CONTACT Zhiqiang Guan gzy__2008@bjmu.edu.cn Jin Xiao jinxiao2022@163.com Liying Luo miss_lyluo@163.com Yin Qin yinqin@163.com * contribute equally. 30 9 2025 2025 17 1 477378 2555619 30 09 2025 03 10 2025 03 10 2025 Integra 29 9 2025 Integra 29 9 2025 18 1 2025 03 7 2025 28 8 2025 © 2025 The Author(s). Published with license by Taylor & Francis Group, LLC. 2025 The Author(s) https://creativecommons.org/licenses/by/4.0/ This is an Open Access article distributed under the terms of the Creative Commons Attribution License ( http://creativecommons.org/licenses/by/4.0/ ABSTRACT Diabetic osteoporosis is a disease that seriously affects health, and intermittent fasting is a promising dietary approach to manage diabetes. The objective of our study was to analyze the effects of intermittent fasting on diabetic osteoporosis and its possible mechanisms. Streptozotocin-induced diabetes in mice was treated by intermittent fasting. Micro-CT and Immunostaining techniques were utilized to evaluate glycogen synthesis and morphological changes in the tibia. Gut microbiota analysis involved 16S rRNA gene amplification and sequencing. Liquid chromatography-mass spectrometry was employed, and quantitative real-time PCR assessed gene expression levels. Our study found that intermittent fasting improved blood glucose levels in diabetic mice and simultaneously enhanced cancellous bone microstructure, including BMD, BV/TV, Tb.Th, and Tb.Sp, which was revised by intervention with intermittent fasting. Intermittent fasting increased Christensenellaceae Chr) flora abundance. To further validate the role of Chr in diabetic osteoporosis treated with intermittent fasting, we used a gut microbiota transplanting and elimination experiment and Chr supplementation experiment, and the result found that Chr supplementation improved bone mass and microstructure in diabetic osteoporosis mice. In addition, Christensenellaceae facilitated the release of exosomes, which promote osteoclast activity, and exosome sequencing analysis showed miR551b upregulation in Christensenellaceae-derived exosomes, and the miR551b improves bone parameters in diabetic osteoporosis mice by supplement or inhibiting miR551b experiments. In conclusion, our study highlights the role of intermittent fasting in improving osteoporosis in diabetes by regulating changes in the abundance of Chr in the gut microbiota and improving the exosomes miR551b secreted by Chr, which in turn improves osteoblast activity. These findings provide a mechanism of intermittent fasting in managing osteoporosis via the gut microbiota-bone axis, potentially leading to innovative therapeutic approaches for diabetes-mediated osteoporosis. SUMMARY BOX HEADING * “What is already known on this topic?” Diabetes often leads to bone metabolism disorders, and intermittent fasting can have a significant impact on the body’s metabolic state. * “What this study adds” Intermittent fasting led to significant improvements in blood glucose levels and bone mass in diabetic mice, as evidenced by enhanced cancellous bone microstructure parameters such as BMD, Tb.Sp, BV/TV, and Tb.Th. Intermittent fasting increased the abundance of Christensenellaceae flora, and KEGG pathway analysis revealed that RNA processing and modifications play a critical role in this process. Supplementation with Christensenellaceae-derived exosomes, compared to Lactobacillus-derived exosomes, showed superior effects on bone microstructure. The inhibition of miR-551b and the use of exosome inhibitors like GW4869 further demonstrated the role of miR-551b in bone healing. * “How this study might affect research, practice or policy” Our findings support the mechanism of intermittent fasting in managing osteoporosis via the gut microbiota-exosome-bone axis, potentially leading to innovative therapeutic approaches for diabetes-mediated osteoporosis. GRAPHICAL ABSTRACT KEYWORDS Osteoporosis diabetes mellitus intermittent fasting exosome Christensenellaceae miR-551b Clinical Research Project of Shanghai Tenth People’s Hospital YNCR2C027 Shanghai Sailing Program 24YF2733200 Scientific research project of Shanghai Municipal Health Commission 20244Y0084 Science and Technology Project of Science and Technology Commission of Chongming District, Shanghai CKY2024-23 Shanghai Tongren Hospital, Shanghai Jiaotong University School of Medicine TRYJ2021JC02 Tongren Xinxing TRKYRC‐xx202215 National Natural Science Foundation of China 10.13039/501100001809 82301242 82502972 Changning District Health Commission 20234Y015 Cultivation grant for clinical and basicintegration research of Shanghai Tenth People’s Hospital SYYYRH2025042 This work was supported by grants from the Clinical Research Project of Shanghai Tenth People’s Hospital (YNCR2C027), Sponsored by Shanghai Sailing Program (24YF2733200), Scientific research project of Shanghai Municipal Health Commission(20244Y0084), Science and Technology Project of Science and Technology Commission of Chongming District, Shanghai(CKY2024-23) and Research Fund of Shanghai Tongren Hospital, Shanghai Jiaotong University School of Medicine (No: TRYJ2021JC02) and Tongren Xinxing (TRKYRC‐xx202215), National Natural Science Foundation of China (Grants Nos. 82301242, 82502972), Scientific research project of Changning District Health Commission(20234Y015), Cultivation grant for clinical and basicintegration research of Shanghai Tenth People’s Hospital(SYYYRH2025042). pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement yes pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes Introduction Diabetes mellitus is currently the third leading noncommunicable disease, following cardiovascular diseases and cancer. 1 2 3 4 5 Intermittent fasting(IF), as a lifestyle strategy, has been shown to enhance mitochondrial function and improve insulin sensitivity, along with reducing cardiovascular risk factors in a diet-controlled environment. 6 7 8 9–11 1 12 13 4 14 15 16 Importantly, IF alters gut microbiota composition, promoting microbial metabolites linked to cognitive function and energy expenditure, while also influencing hippocampal gene expression involved in mitochondrial growth. 17 18 19 20 21 22 23 Despite these promising insights, the mechanisms by which IF affects diabetic osteoporosis and the underlying processes remain unclear. This underscores the need to investigate how IF influences gut microbiota and its relationship to metabolic disease risk. 24–26 Materials and methods Both the institutional review board and our hospital’s ethics committee gave their approval for this research (DSYY-6420–22). Experiments involving animals must be carried out following the ARRIVE guidelines. Collection of gut microbiota Fecal samples (100–150 g) were homogenized at a 1:5 ratio in sterilized normal saline (physiological saline supplemented with 0.05% l-cysteine-HCl). The resulting slurry was centrifuged at 6000 × g for 15 min at 4°C after passing through stainless steel sieves with pore sizes of 2.0, 1.0, 0.5, and 0.25 mm to remove undigested food and small particles. To get a final concentration of 10%, GM was reconstituted in half the initial volume of sterile, decreased saline and sterile glycerol after the supernatant was disposed of. It is anticipated that the full anaerobic procedure will take around an hour. To determine the concentration of bacteria, a small sample of each GM produced was subjected to agar plating. Escherichia coli (EC) and Christensenellaceae (Chr) samples from each donor were taken, divided into tiny aliquots, and either used immediately for further research or stored at −80°C for up to eight weeks before application to study the effect of bacteria on bone. Bacterial culture As previously described, Christensenellaceae were grown in BHI broth (BD Bioscience, San Jose, CA, USA) with the addition of 0.5% porcine mucin (Sigma-Aldrich, St. Louis, MO, USA) and 0.05% l-cysteine-HCl (Sigma-Aldrich, St. Louis, MO, USA). 27 28 29 Animals, DM brought on by STZ, and sporadic fasting The STZ-induced DR and intermittent fasting studies were undertaken in adult male C57BL/6 Wild-type (WT) mice at eight weeks of age, as shown in Supplementary Figure S1. Mice were obtained from SLAM Laboratories. The mice were kept in both light and dark environments for 12 hours each. Each mouse was fed on AIN-93 M, a conventional diet purchased from TROPHIC Animal Feed Hi-Tech Co. The diabetic group received STZ injections (3 mg/kg/ICV) to induce hyperglycemia. The healthy control group was administered a vehicle under identical conditions. Blood glucose levels of 11.1 mmol/L or higher were considered hyperglycemic. Four subgroups comprised the first animal batch: Vehicle, IF (intermittent fasting group), DM-Tx (diabetic osteoporosis group), and IF-DM-Tx (diabetes osteoporosis treated with intermittent fasting group). The STZ-induced DM mice were shown to have diabetic osteoporosis. However, for a total of 28 days, the IF mice were fed freely on the days in between after going without food for 24 hours every other day. Body weight, food, and water intake were measured on the fasting day. The animals were killed after radiologic testing and pathological staining so that tissues and serum could be extracted. In the second set of animals, STZ-induced DM mice were separated into four subgroups ( n 8 8 As mentioned in the main text, stool samples from the second group of animals were selected for the third group and administered orally by gavage to 6-week-old Swiss Webster mice that were germ-free. Each fecal donor had one recipient mouse. Three cages per treatment were used, with mice housed four to a cage. In each experiment, the mouse was kept on a light/dark cycle of 12 hours and given autoclaved feed and drink at any time. Fecal pellets were taken once a week, and body weight and chow consumption were recorded. During the sacrifice, tissue from the tibia and spine was removed. The four animals were placed into four groups: ABT-Control(antibiotic treatment group), ABT+DM-Tx(antibiotic treatment with diabetic osteoporosis group), ABT+Chr-DM-Tx(antibiotic treatment and then Chr supplement group), and ABT+LG-DM-Tx(antibiotic treatment and then LG supplement group). The program for the IF regimen was the same as the sets that were previously outlined. Beginning 14 days prior to the IF regimen and continuing during the experiment, the drinking water contained the antibiotic cocktail. 22 The five sets of animal experiments: To test the role of EV secretion in Chr-induced bone health regulation, DM-Tx mice were fed 3 × 108 CFUs of GW4869-pretreated Chr orally. The four groups that made up the five sets of animals were Vehicle, DM(diabetic osteoporosis group), DM-Chr(diabetic osteoporosis with Chr supplement group), and DM-pre Chr(diabetic osteoporosis with GW4869-pretreated Chr supplement group). For the six animal experiments, siRNAs targeting mouse miR-125 were prepared by Gima (Suzhou, China) for microRNA mimics and siRNA transfection, using scrambled siRNA as a negative control (NC). Cells were transfected with siRNAs at a concentration of 50 nm for 48 hours using Lipofectamine RNAiMAX Reagent (13778–100, Invitrogen, USA) after six hours of growth in Opti-MEM (31985–070, Invitrogen, USA). The Cy3-labeled miR-551b, NC, and miR-551b mimics were provided by RiboBio (Guangzhou, China). Cells were transfected using Lipofectamine 2000 reagent (11668030, Invitrogen, USA) for 24 hours at a terminal concentration of 50 nm. 30 31 Oral glucose tolerance test (GTT) and fasting blood glucose (FBG) The insulin tolerance test, the glucose tolerance test, and the fasting blood glucose measurements were performed as described by Amir. 30 32 µCT analysis Dissected mouse femurs were preserved in 4% paraformaldehyde for one night prior to high definition μCT analysis (VIVACT 80; SCANCO Medical AG, Switzerland) according to the procedures of a previous study. 33 34 3 35 Analysis of histomorphometry, immunohistochemistry, and histology Femora were prepared for histological and immunohistochemical labeling by decalcifying them for about three days at 4°C while being continuously shaken in 0.5 M EDTA (pH = 7.4). They were then fixed in 4% paraformaldehyde for 48 hours. The samples were dehydrated in ethanol and then embedded in paraffin. To identify OCN+ osteoblasts and TRAP+ osteoclasts across the entire ROI, which was also chosen for trabecular bone imaging, bone samples were longitudinally sectioned into 5 µm-thick slices and stained for OCN and tartrate-resistant acid phosphatase (TRAP) in accordance with the previously published protocol. 23 To investigate dynamic bone formation, mice were given an intraperitoneal injection of 0.1% calcein (Sigma-Aldrich; 10 mg kg − 1 body weight) in PBS on days 9 and 3. Following collection, tibias were preserved for 48 hours in 4% paraformaldehyde, dried in progressively higher concentrations of ethanol, and then embedded in methyl methacrylate. A Leica DMI6000B fluorescence microscope (Solms, Germany) was used to generate and analyze slices of undecalcified bone that were 10 µm thick for calcein double labeling. Starting 0.3 mm distal to the proximal epiphyseal growth plate, the study zone extended 20% of the tibial length distally, excluding the growth plate and primary spongiosa but including the secondary spongiosa and cancellous bone. The periosteal and endocortical surfaces of the cortical bone were not taken into account in the study. Image-Pro Plus 6 software was used to assess the mineralized sedimentation rate (MAR) and bone resorption surface (BFR/BS) across the area of interest. 35 Tissue distribution of EVs in vivo Following the manufacturer’s ex vivo fluorescent imaging instructions, several GM-EVs (total gut microbiota with extracellular vesicles group), LG-EVs (LG supplement with extracellular vesicles group), and Chr-EVs (Chr supplement with extracellular vesicles group) were labeled using the lipophilic dye DIR iodide (Santa Cruz). Using the previously mentioned methods, any possibly redundant fluorescent dye was eliminated from the DIR-labeled GM-EVs, LG-EVs, or Chr-EVs using bottom-up Optiprep density gradient centrifugation. The resulting EV-rich fractions were centrifuged for three hours at 100,000 × g and 4°C after being diluted with 30 mL of PBS. The EV pellets were reconstituted in PBS and administered intravenously (3 × 10 9 10 10 10 Femora were continually shaken in 0.5 m EDTA (pH = 7.4) for about three days at 4°C in order to decalcify them. The samples were all submerged in 30% sucrose for the whole night in order to dehydrate them. Before being sliced into slices that were 5 µm thick and immersed in an OCT compound (Sakura Finetek USA, Inc., Torrance, CA, USA), the samples were temporarily subjected to liquid nitrogen. The slices were stained with DAPI (0.5 µg mL −1 10 35 Serology After being drawn into coagulation-promoting tubes, the blood is centrifuged for 15 minutes at 3000 rpm. After that, plasma is collected and stored at −80°C. The levels of ALP (Feimo, Beijing, China) and plasma lipopolysaccharide (LPS, J&W Pharmlab, Pennsylvania, USA) were determined using commercial enzyme-linked immunosorbent assay (ELISA) kits. Quantitative PCR The distal left tibias were stored at −80°C after being flash frozen in liquid nitrogen. We crushed the frozen tibias under liquid nitrogen using a Bessman tissue pulverizer from Spectrum Laboratories in Rancho Dominguez, California, USA. Total RNA was isolated using Invitrogen’s TRIzol reagent (Carlsbad, CA, USA). We used the 2-ΔΔCT technique to analyze the relative change in gene expression. Western blotting Western blotting was done after chondrocytes were cultivated at a density of 5 × 10 5 31 RNA‐sequence analysis Invitrogen’s TRIzol reagent was used to sequence the total RNA that was isolated from chondrocyte samples. A Nanodrop spectrophotometer was used to measure the amount and quality of the extracted RNA samples. The integrity of the RNA was evaluated using the RNA Nano6000 Assay Kit on the Bioanalyzer 2100 system (Agilent Technologies, CA, USA). 1 μg of RNA was present in each sample and was used as the input for further analysis. Using the TaqMan MicroRNA Reverse Transcription Kit (4366596, Thermo Fisher Scientific) and Megaplex RT Primers (4399970, Thermo Fisher Scientific), cDNA was produced in subchondral bone after total RNA was extracted from chondrocyte samples. The 7900HT Real-Time PCR System was then used to conduct array analysis using the TaqMan MicroRNA Array Rodent Card A (4398967, Thermo Fisher Scientific) and TaqMan Universal PCR Master Mix (4352042, Thermo Fisher Scientific). The expression of U6 (△Ct values), which has a normal Gaussian distribution, was used to normalize the expression of microRNAs as indicated by Ct values. For group comparison, fold changes in the normalized data were then noted. 31 Evs uptake assay According to manufacturer instructions, EVs were tagged with PKH26 (Catalog No. MINI26; Sigma-Aldrich). To get rid of excess dye, RAW264.7 cells were grown with labeled EVs (6 × 108 vesicles mL − 1) for three hours at 37°C. After treatment, the cells were fixed with 4% paraformaldehyde for 15 minutes and washed with PBS. Nuclei were stained with DAPI after being washed with PBS. The pictures were taken using a Carl Zeiss Axio Imager 2 fluorescence microscope (Germany). Extracellular vesicle purification After chondrocytes were cultivated to about 100% confluence, extracellular vesicles were removed. After being centrifuged overnight at 100,000 g, they were grown for 48 hours in EV-depleted media, which is made from the supernatants of the whole medium. A differential centrifugation approach (300 × g for 10 min, 3000 × g for 10 min 10,000 × g for 20 min, and 100,000 × g for 70 min) was used to separate exosomes from supernatants at 4°C. The separated exosomes were centrifuged once more for 70 minutes at 100,000 × g after being washed with PBS. Dynamic light scattering (DLS) and a Nanosizer device (ZEN3790, Malvern Instruments, UK) were used in earlier studies to evaluate the size distribution of exosomes. 31 36 The isolated exosomes on copper mesh were seen using transmission electron microscopy (TEM). The samples were cleaned with distilled water, dried, and dyed with phosphotungstic acid prior to TEM scanning. 31 37 The Pierce BCA Protein Assay (23225, Thermo Fisher Scientific, USA) was used to measure the total protein content of exosomes. Lastly, PKH26 (MINI26; Sigma-Aldrich, USA) was used to tag the exosomes in accordance with the manufacturer’s instructions. Inhibition of exosomal release The OME drug (PHR1059, Sigma Aldrich, USA) was made in DMSO and given to developing cells at a dose of 20 µg mL-1 for a whole day. The purpose of this activity was to prevent exosome (EV) release. 38 MicroRNA mimics and siRnas transfection For use in siRNA and MicroRNA Mimic transfection, Gima (Suzhou, China) produced siRNAs against mouse miR-551b. Scramble siRNA was used as the negative control (NC) in this study. Before being transfected with siRNAs using Lipofectamine RNAiMAX Reagent (13778–100, Invitrogen, USA) for 48 hours at a concentration of 50 nm, the cells were cultured in Opti-MEM (31985–070, Invitrogen, USA) for six hours. The design work for the Cy3-labeled miR-551b, NC, and miR-551b mimics was finished by RiboBio (Guangzhou, China). Lipofectamine 2000 Reagent (11668030, Invitrogen, USA) was used to transfect the cells for 24 hours at a final concentration of 50 nm. 39 Adeno-associated virus (AAV)-anti-miRNA-551b preparation and analysis Anti-miRNA-551b, an inhibitor of miRNA-551b, quickly lost its effectiveness in aqueous solutions. The chemical may have unidentified effects on various organs and systems, and pH and humidity affect systemic application. Accurate release is not guaranteed by local puncture or fractional administration. The most promising gene treatment technique at the moment is AAV. Over time, the enhanced safety profile endures. 40 41 42 Transmission electron microscopy Transmission electron microscopy was performed on carbon-coated copper grids with a 400 mesh size using EV preparations (10 µL). Next, the grids were washed three times with PBS (Electron Microscopy Sciences) right away. The grids were examined using transmission electron microscopy (TEM) (JEM 1010, JEOL, Japan) at 80 kV to produce TEM images after the extra solution was eliminated and allowed to dry. Histomorphometry We evaluated secondary spongiosa to examine its dynamic features by intraperitoneally administering calcein (20 mg/kg) five and two days before sacrifice. Image-Pro Plus version 6.0 (Media Cybernetics Inc., US) and an Olympus B×61microscope (Olympus America, Inc., Center Valley, PA) were used to capture the images. The left proximal tibia was histologically processed after 21 days of room temperature decalcification in 10% EDTA and a 24-hour fixation in 10% phosphate-buffered formalin. The proximal tibia was stained with hematoxylin and eosin (HE) and tartrate-resistant acid phosphatase. We used hematoxylin and eosin to stain the liver, spleen, and heart. 16 s rRNA gene sequencing DNA was extracted from a 0.5 g fecal sample using the QIAamp Fast DNA Stool Mini Kit (Cat. No. 51604; Qiagen, Hilden, Germany). GM’s composition and relative abundance were assessed by transferring the DNA samples to GeneSky Biological Technology (Shanghai, China) for high-throughput 16S rRNA gene sequencing. The variable V4 region of 16S rDNA was amplified and sequenced using Illumina Miseq. Prerequisites for the quality filtering were a minimum length of 200 bp, a minimum quality score of 30, the lack of primer sequence mismatches, and a maximum of six ambiguous bases. Using USEARCH, duplicate sequences were screened, and chimeras were removed. The remaining sequences were compared to the Greengene database after being classified as operational taxonomic units (OTUs) using the UCLUST technique with a 97% similarity criterion. The relative abundance of the identified microbiota was assessed at the phylum, class, order, family, genus, and species levels. Bar graphs were used to display the relative abundance of bacteria at the genus and phylum levels. 31 35 Molecular modeling and docking As previously stated, as part of our inquiry, we conducted a docking analysis of Adrβ1 and Abp1. The ChEMBL database was used to align the crystal structures of Adrβ1 and Abp1 ( https://www.ebi.ac.uk/chembl/# 43 Statistical analysis Statistical significance was established when the P-value was less than 0.05. The findings are shown using the mean ± standard deviation. The body weights from the time course investigation were evaluated using a two-way repeated-measure ANOVA. The Greenhouse-Geisser adjustment is applied to the data to reduce the likelihood that a significant result would be obtained just by coincidence. The 3 × 9 ANOVA was the result of the interaction between the intervention as a between-subject component and time (weeks 0–8 post-OVX+ABT stimulation) as a within-subject factor. Pairwise comparisons using Bonferroni correction were carried out for multiple comparisons of group means. The need for antibiotic medicine was suggested by a strong main impact of the intervention. The primary effects of time and intervention were analyzed in the data. GraphPad Prism 8.02 (La Jolla, CA, USA) was used to analyze the data using Tukey’s multiple tests and one-way ANOVA. Results Intervention with intermittent fasting impacts bone loss in diabetic mice As shown in Figure 1 Figure 1(A,B) Figure 1. Intermittent fasting improves progress in diabetic osteoporotic mice. (A) body weight. (B) body weight gain. (C)food intake. (D)change of food intake. (E)water intake. (F)change of water intake. (G) serum glucose. (H) change of glucose. (I) Representative diagram of IF-treated diabetic osteoporotic mice. (J)BMD of fourth lumbar vertebrae. (K)tb.N of fourth lumbar vertebrae. (L)tb.Th fourth lumbar vertebrae. (M)BV/TV/BW of the fourth lumbar vertebrae. (N)tb.Sp of the fourth lumbar vertebrae. (O)length of femur. (P)tb.Sp of the femur. (Q) BV/TV/BW of femur. (R)tb.N of femur. (S)tb.Th femur. (T) Ct.Th femur. (U) Ct.Ar/Tt.Ar of femur. Data are presented as mean ± SEM, and statistical significance was determined by two-way ANOVA with Newman-Keuls multiple comparisons test, n p p A mouse model of diabetes was effectively created two weeks after the intermittent fasting intervention, according to our analysis of blood glucose variations ( Figure 1(C-F) Figure 1(G-H) Figure 1(I-O) p p p Figure 1(P-U) Figure 2(A-G) Figure 2. Intermittent fasting intervention modulates gut microbiota alterations in diabetic mice. (A) Representative diagram of HE stain, trap stain, and OCN immunohistochemistry stain.(B)N.Obs/BS.(C)ostrocalcin.(D)MAR.(E)BFR.(F)maximum force. (G) stiffness. (H)community barplot analysis. (I)principal cause analysis.(J)Typing analysis on phylum level. (K)microbiotal dysbiosis index. (L) correlation analysis of intestinal microbiota.(M) heatmap analysis.(N) feature enrichment analysis.(O) venn plot. (P) COG function classification. Data are presented as mean ± SEM and statistical significance was determined by two-way ANOVA with Newman-Keuls multiple comparisons test, n p p Intermittent fasting improves the abundance of Chr bacteria in diabetic osteoporotic mice We also looked at the gut microbiome’s changes after the intermittent fasting trial since we believe it might have a significant effect. The microbial composition of these specimens was determined by high-throughput sequencing of 16S rRNA gene (16S rDNA) amplicons. At the phylum, class, order, family, genus, and species levels, the composition of the microbiota was examined. When compared to the diabetes group, the intermittent fasting intervention resulted in significant decreases in Bacteroides microbacteria and Leucobacterium recursum and large increases in Christensenellaceae and Tenericutes at the phylum level. Figure 2(H) Figure 2(I) Figure 2J Figure 2(K) Figure 2(L) Figure 2(M) Figure 2(O) Figure 2(N,P) After comparing the effects of Chr and LG on bone, we looked into whether giving diabetic osteoporosis mice direct supplements of Chr bacteria every two weeks for eight weeks had an impact on changes in bone mass in comparison to giving them LG supplements, which contain bacteria that are frequently found in the stomachs of warm-blooded animals and people. 43 Figure 3(A-N) Figure 3. Effects of Chr supplementation on diabetes-induced osteoporosis. (A) Representative diagram of bone microstructure, HE stain, OCN stain. (B)BMD of the fourth lumbar vertebrae. (C)BV/TV/BW of the fourth lumbar vertebrae. (D)tb.Th of fourth lumbar vertebrae. (E)tb.N of fourth lumbar vertebrae. (F)tb.Sp of the fourth lumbar vertebrae. (G) Tb.Th of femur. (H)tb.N of femur. (I)tb.Sp of femur. (J) BV/TV/BW of femur. (K)length of femur. (T) Ct.Th femur. (U) Ct.Ar/Tt.Ar of femur. (O)CD4+ T lymphocytes. (P) histogram of intestinal microbiota composition. (Q)the total load of gut microbiota. (R) Escherichia coli relative abundance. (S)christensenellaceae relative abundance. Data are presented as mean ± SEM, and statistical significance was determined by two-way ANOVA with Newman-Keuls multiple comparisons test, n p p Next, the impact of supplementing with Chr on osteogenesis and osteoclastogenesis was examined. The results showed that diabetic mice supplemented with Chr had a greater osteogenic response than diabetic osteoporotic mice. These results were examined by immunohistochemistry labeling and an ELISA test employing the bone formation marker OCN. While osteoblast data decreased, LG supplementation did not affect OCN levels. Chr, but not LG, was provided, according to the TRAP staining data. In diabetic mice given Chr, bacteria reduced bone resorption activity, osteoblast survival, and osteoclast development. New bone growth and mineralization increased in diabetic mice given calcified green fluorescent double standard. On the other hand, Chr supplementation led to a noteworthy trend of decreased BFR/BS and MAR values in comparison to diabetic mice (Supplement Figure 2 Figure 3(O) Figure 3(P) Figure 3(Q-S) Experiments with fecal transplantation and elimination experiments give more evidence that intermittent fasting improves the development of diabetic osteoporosis Gut microbiota is often confirmed by fecal transplantation testing and gut microbiota elimination assays. 22 23 Figures 4(A-E) Figure 4(F-J) Figure 4. Effects of fecal transplantation assays and gut microbiota elimination assays on diabetes-mediated osteoporosis. (A) Representative diagram of bone microstructure, HE stain, OCN stain of fecal transplantation assays, and gut microbiota elimination experiment. (B)tb.Sp of the fourth lumbar vertebrae. (C)tb.Th of fourth lumbar vertebrae. (D)tb.N of fourth lumbar vertebrae. (E)BV/TV/BW of the fourth lumbar vertebrae. (F)BMD of the fourth lumbar vertebrae. (G)tb.Sp of femur.(H) Tb.Th femur. (K)TRAP expression. (L)OCN expression. (M) femur BMD in gut microbiota elimination assays. (N) BV/TV/BW of femur in gut microbiota elimination assays. (O)tb.N of femur in gut microbiota elimination assays. (P) Tb.undefined.The femur of in gut microbiota elimination assays. (Q) Tb.Sp of femur in gut microbiota elimination assays. (R) BMD of the fourth lumbar vertebrae in gut microbiota elimination assays. (S)serum LPS. (T) correlated BV/TV with LPS level. Data are presented as mean ± SEM, and statistical significance was determined by two-way ANOVA with Newman-Keuls multiple comparisons test, n p p Using antibiotics are used for mice, we conducted further gut microbiota eradication experiments. According to the results, osteoblast markers like OCN significantly increased and osteoclast indicators like TRAP significantly decreased after the removal of the gut microbiota and subsequent Chr bacteria supplementation ( Figure 4(K-L) Figure 4(F-J) Figure 4(N) R p EV secretion is necessary for Chr’s anti-diabetic osteoporotic effect We preincubated Chr colonies with GW4869, a neutral sphingomyelinase (nSMase) inhibitor that limits EV release and stops Chr colonies from secreting EVs, in order to investigate the function of EVs in Chr-induced anti-osteoporosis. We next investigated the potential that the mice would be protected against OVX-induced osteoporosis by these GW4869-pretreated CHr, administered by gastric gavage twice a week for eight weeks. Prevent diabetes-induced osteoporosis in mice. The effect of GW4869 on the viability of Chr colonies was determined by counting the number of bacterial colonies on YCFA agar plates. The number of bacterial colonies on YCFA agar plates four days after GW4869 inoculation did not differ significantly from vector-treated Chr flora, indicating that GW4869 did not influence the viability of the bacteria. Normalizing EV levels to the total concentrations of all EV proteins is a common and simple method of measuring the concentration of EVs, which are determined by their proteins. The total protein content of retrieved EVs sharply dropped after four days of GW4869 treatment, suggesting a significant suppression of EV synthesis in Chr. The EVs protein levels in GMs pretreated with GW4869 were considerably lower than in the vector-pretreated group, even after GW4869 was taken out of the medium and the treatment Chr was cultivated for four additional days. We counted the number of particles in the Chr EVs treated with either vector or GW4869 using the nanoparticle tracking method (NTA). The amount of EV particles in Chr was significantly reduced following a 4-day treatment with GW4869; this decrease continued even after GW4869 was removed from the culture for 4 days. This outcome is consistent with changes in EVs’ protein composition. These results suggest that GW4869 suppresses EV secretion for a long period of time. According to micro-CT imaging, Chr may raise bone microstructure and BMD levels in diabetic mice while also increasing bone mass and microarchitecture. TV/BV, Tb. N, TB. Th, Th. Ar/Tt. Ar, Ct. Th and Ct. Here are such instances. However, both Tb.Sp. are suppressed. Furthermore, while both Chr-treated and vector-treated diabetic mice with GW4869 pretreatment showed similar amounts of bone mass and microstructural characteristics, Figure 5 Figure 5. Chr-derived exosomes may play a role in regulating diabetic osteoporosis. (A) Representative diagram of bone microstructure and HE stain. (B) the total load of gut microbiota. (C) total protein contents and D) particle numbers of EVs from GM treated with vehicle or GW4869 for 4 days, or from GM pretreated with vehicle or GW4869 for 4 days and cultured in fresh medium without vehicle or GW4869 for another 4 days. n n p p To determine whether pasteurization (70°C, 30 min) is a common method for reducing the number of microorganisms in liquids and dairy products, we used bacterial colony counting assays on plates to assess the viability of Chr and nano particle tracking assays to count the number of particles in Chr-derived EVs from pasteurized or viable Chr. Pasteurized Chr did not prevent mice from losing bone as a result of diabetes, according to prior research by Lawenius et al.. 44 Figure 5 45 Following their separation from the Chr medium, we characterized the EVs using dynamic light scattering (DLS) and transmission electron microscopy. GM, LG, and Chr EVs were spherical or cup-shaped, with corresponding dimensions of 215.02 ± 48.66 nm, 199.57 ± 52.61 nm, and 166.88 ± 35.99 nm. These values were similar to previously reported observations of bacterial EVs. Following the assignment of the E designation, the ability of GM-derived EVs, LG-derived EVs (LG-EVs), and Chr-EVs containing DIR iodide to permeate host tissues was evaluated. In vitro fluorescence imaging revealed that mice with DIR-labeled GM-derived EVs (GM-EVs) had high fluorescence signals in their tibia and femur. For one hour, COL-derived extracellular vesicles (LG-EVs) were administered orally, intravenously, or rectally ( Figure 5(T-U) Figure 5(P) Figure 6(A-B) Figure 6. Chr source mir-551b in the regulation of osteoclast activity. (A) confocal microscopy analysis of the femoral sections from mice treated with the PKH67-labeled EVs for 1 h by oral route(top line) and Representative images of the Chr Chr n p p We also utilized sera that had Chr-EVs-antibodies and collected sera from rabbits that had received injections of Chr-EVs to see whether oral Chr-EVs might be present in mouse tissues. Figure 6(B,C) Exosomes made from chromosomes emit miR-551b, which is essential for avoiding osteoporosis in diabetics To ascertain which miRNAs are essential for exosome function, we next used exosome sequencing. PCA plots are shown in Figure 6(E) Figure 6(F-H) Figure 6(E-H) In the group that was activated, miR-551b levels would soar, but in the group that was inhibited, they would fall. We next assessed alterations in ALPase activity and found that activation of miR-551 markedly enhanced cellular activity and ALPase activity; mRNA levels demonstrated significant increases in OCN, RUNX2, and ALP levels ( Figures 6(I-P) and 7(B) Figure 7. Reversal of EVs amelioration diabetic osteoporosis after miR-551b inhibition. (A) Representative diagram of bone microstructure and HE stain.(B) relative Runx2 mRNA. (C)BMD of the fourth lumbar vertebrae. (D)tb.N of fourth lumbar vertebrae. (E)BV/TV/BW of the fourth lumbar vertebrae. (F)tb.Th fourth lumbar vertebrae. (G)tb.Sp of the fourth lumbar vertebrae. (H)CTX-1. (I) N.Obs/BS. (J)osteocalcin. (K) N.Obs/BS. (L)MAR. (M) BFR/BS. Data are presented as mean ± SEM, and statistical significance was determined by two-way ANOVA with Newman-Keuls multiple comparisons test, n p p Furthermore, we simulated the molecular fitness of ALP and MiR-551b using the docking model, and the results are shown in Supplementary Figure S2, which suggests that both ALP and miR-551b have high spatial fitness. We then conducted in vivo research to confirm the function of miR-551b generated from exosomes. The results demonstrated that EV intervention led to large reductions in Tb.Sp, CTX-1, and N.OCs/BS levels and significant increases in BMD, Tb.N, BV/TV, OCN, N.Obs/BS, MAR, and BFR. The suppression of miR-551b reversed this process. Additionally, according to this data section, EV-derived miR-551b may be a key target for intermittent fasting treatments intended to cure diabetic osteoporosis. Discussion The immune and endocrine systems are among the many bodily systems that are significantly impacted by intermittent fasting. 6–9 11 17 18 46 Diabetes-induced bone loss is one of the main causes of osteoporosis. Two aspects of diabetes that may be detrimental to bone are hyperglycemia and the accumulation of advanced glycosylation end products. T1D has relatively low endogenous insulin levels, while T2D has hyperinsulinemia and insulin resistance. 47 48 49 50 51 52 The miR-551b is implicated in regulating osteoblast differentiation and bone formation through multiple pathways. In cancer studies, miR-551b directly suppresses cyclin D1 (a key cell cycle regulator) by binding to its mRNA 3‘UTR, thereby inhibiting cell proliferation. 53 54 55 56 The microbial interactions involving Christensenellaceae and other gut microbiota species have been investigated in previous studies. 27 57 58 59 60 61 62 63 Figure 2(L-M) Our data suggest that the observed miR-551b induction is primarily mediated by IF-driven remodeling of gut microbiota and associated metabolic shifts, rather than the elimination of specific nutrients. The differential expression of microRNAs and lncRNAs, including miR-15b, miR-103–2, miR-302a, miR-6985, and miR-5624, was regulated by IF, which exerts significant anti-inflammatory and immunoregulatory effects. 64 65 Intermittent fasting is effective in treating a variety of illnesses, including diabetes, cancer, heart disease, and neurological disorders, including stroke, Parkinson’s disease, and Alzheimer’s disease. 66 67 32 68 69 9 70 Several lines of evidence link intermittent fasting (IF), microbiota-dependent free fatty acid (FFA) metabolism, and systemic metabolomic reprogramming. IF significantly enriched Christensenellaceae and Lachnospiraceae – bacterial families with well-documented roles in short-chain fatty acid (SCFA) production. 71 72–74 75–78 79 80 81 82 83 84 85 86 87 88 89 90 91 92 93 In our studies, transferring IF-adapted microbiota (enriched in Christensenellaceae) to AL-fed mice significantly increased serum EV miR-551b levels, even in the absence of fasting. This demonstrates that gut microbiota remodeling is sufficient to induce miR-551b packaging into EVs, independent of host dietary cycles. While microbial EVs deliver miR-551b, the potential host cell is also involved in this process. As a signaling small molecule that regulates the body’s metabolism, miRNAs can be released through a variety of cells in a variety of ways. For example, a mouse model of middle cerebral artery occlusion (MCAO) injected with miR-100-5p-loaded hNPC-derived exosomes exhibits a smaller size of cerebral infarction, reduced apoptosis, and improved neurological function. 94 95 96 97 98 The phylum Thick-walled Bacteria includes the newly identified family Christensenellaceae, which is becoming more important for human health. The strongest correlation between the human gut and metabolic illnesses to yet has been found to be between the relative abundance of Christensenellaceae in the gut and host body mass index (BMI), which is adversely associated across numerous populations and research. 99 57 100 101 102 103 Figure 3(G-I) 24–26 27 28 30 Interventions such as intermittent fasting may impact diabetic osteoporosis by modifying the gut microbiome. The synthesis of fatty acids, bile acids, and the promotion of vitamin synthesis are some of the mechanisms of action of gut microbiota on diabetic osteoporosis that are now being studied. 104 105 106 29 31 107 108 109 Limitations There were some limitations in our study. First of all, this study has a small sample size, mainly focuses on basic experiments, and lacks the verification of clinical research results. Second, our study focused on one bacterial change in the microbiota and confirmed the interactions between the microbiota and between the microbiota and the diathesis through correlated validation. In addition, the study employs diabetic mice, which may not fully recapitulate human gut-bone axis dynamics due to species-specific differences in microbiota composition, immune responses, or bone turnover rates, and STZ-induced diabetic osteoporosis focuses on hyperglycemia-driven bone loss, potentially overlooking contributions from other osteoporosis subtypes. In addition, our study deliberately prioritized establishing the functional hierarchy of the gut-bone axis in diabetic osteoporosis, where we confirmed that miR-551b supplementation rescues bone microarchitecture while its inhibition exacerbates osteoclastogenesis. However, the deeper molecular characterization of how Christensenellaceae-derived extracellular vesicles (EVs) and miR-551b modulate bone cell activity needs to be further studied. Finally, Exosomes derived from gut microbiota can repair organ and tissue damage. In addition, it also has the advantages of long half-life, low immunogenicity, good stability, and the ability to cross the blood-brain barrier, and has shown excellent performance and potential practical applications in bone diseases. 110 111 112 113 114 Conclusion Diabetes-induced osteoporosis is mediated by EVs-miR-551b carrying Christensenellaceae via intermittent fasting. This might provide fresh insights into the mechanisms behind dietary treatments that slow the course of diabetic osteoporosis. Provenance and peer review Not commissioned, externally peer-reviewed Abbreviation  DM diabetes mellitus IF intermittent fasting GM gut microbiota Chr Christensenellaceae LG Escherichia coli CFUs colony forming units AAV adeno-associated virus FBG Fasting blood glucose GTT oral glucose tolerance test IP intraperitoneal GM-Evs total gut microbiota with extracellular vesicles group LG-Evs LG supplement with extracellular vesicles group Chr-Evs Chr supplement with extracellular vesicles group BFR/BS bone resorption surface MAR Mineralized sedimentation rate OVX ovariectomy mice Supplementary Material Supplemental Material Acknowledgments We would like to thank all participants and our hospital. Disclosure statement No potential conflict of interest was reported by the author(s). Supplementary material Supplemental data for this article can be accessed online at https://doi.org/10.1080/19490976.2025.2555619 References 1. Sun H Saeedi P Karuranga S Pinkepank M Ogurtsova K Duncan BB Stein C Basit A Chan JCN Mbanya JC IDF diabetes Atlas: global, regional and country-level diabetes prevalence estimates for 2021 and projections for 2045 Diabetes Res Clin Pract 2022 183 109119 10.1016/j.diabres.2021.109119 34879977 PMC11057359 2. Ferrari SL Abrahamsen B Napoli N Akesson K Chandran M Eastell R El-Hajj Fuleihan G Josse R Kendler DL Kraenzlin M Diagnosis and management of bone fragility in diabetes: an emerging challenge Osteoporos Int 2018 29 12 2585 27 10.1007/s00198-018-4650-2 30066131 PMC6267152 3. Xu Y Wu Q. Trends in osteoporosis and mean bone density among type 2 diabetes patients in the US from 2005 to 2014 Sci Rep 2021 11 1 3693 10.1038/s41598-021-83263-4 33580184 PMC7881186 4. Ebeling PR Nguyen HH Aleksova J Vincent AJ Wong P Milat F Secondary osteoporosis Endocr Rev 2022 43 2 240 313 10.1210/endrev/bnab028 34476488 5. Khosla S Hofbauer LC Osteoporosis treatment: recent developments and ongoing challenges Lancet Diabetes Endocrinol 2017 5 11 898 907 10.1016/S2213-8587(17)30188-2 28689769 PMC5798872 6. Varady KA Cienfuegos S Ezpeleta M Gabel K Clinical application of intermittent fasting for weight loss: progress and future directions Nat Rev Endocrinol 2022 18 5 309 321 10.1038/s41574-022-00638-x 35194176 7. Vasim I Majeed CN DeBoer MD Intermittent fasting and metabolic health Nutrients 2022 14 3 631 10.3390/nu14030631 35276989 PMC8839325 8. Patterson RE Sears DD Metabolic effects of intermittent fasting Annu Rev Nutr 2017 37 1 371 393 10.1146/annurev-nutr-071816-064634 28715993 9. Dong TA Sandesara PB Dhindsa DS Mehta A Arneson LC Dollar AL Taub PR Sperling LS Intermittent fasting: a heart healthy dietary pattern? Am J Med 2020 133 8 901 907 10.1016/j.amjmed.2020.03.030 32330491 PMC7415631 10. Duregon E Pomatto-Watson LCDD Bernier M Price NL de Cabo R Intermittent fasting: from calories to time restriction Geroscience 2021 43 3 1083 1092 10.1007/s11357-021-00335-z 33686571 PMC8190218 11. Fanti M Mishra A Longo VD Brandhorst S Time-restricted eating, intermittent fasting, and fasting-mimicking diets in weight loss Curr Obes Rep 2021 10 2 70 80 10.1007/s13679-021-00424-2 33512641 12. Kupai K Kang HL Pósa A Csonka Á Várkonyi T Valkusz Z Bone loss in diabetes mellitus: diaporosis Int J Mol Sci 2024 25 13 7269 10.3390/ijms25137269 39000376 PMC11242219 13. Wu B Fu Z Wang X Zhou P Yang Q Jiang Y Zhu D A narrative review of diabetic bone disease: characteristics, pathogenesis, and treatment Front Endocrinol (Lausanne) 2022 13 1052592 10.3389/fendo.2022.1052592 36589835 PMC9794857 14. Chau DL Edelman SV Chandran M Osteoporosis and diabetes Curr Diab Rep 2003 3 1 37 42 10.1007/s11892-003-0051-8 12643144 15. Antonopoulou M Bahtiyar G Banerji MA Sacerdote AS Diabetes and bone health Maturitas 2013 76 3 253 259 10.1016/j.maturitas.2013.04.004 23628280 16. Fang P She Y Han L Wan S Shang W Zhang Z Min W A promising biomarker of elevated galanin level in hypothalamus for osteoporosis risk in type 2 diabetes mellitus Mech Ageing Dev 2021 194 111427 10.1016/j.mad.2020.111427 33383074 17. Liu Z Dai X Zhang H Shi R Hui Y Jin X Zhang W Wang L Wang Q Wang D Gut microbiota mediates intermittent-fasting alleviation of diabetes-induced cognitive impairment Nat Commun 2020 11 1 855 10.1038/s41467-020-14676-4 32071312 PMC7029019 18. Guo Y Luo S Ye Y Yin S Fan J Xia M Intermittent fasting improves cardiometabolic risk factors and alters gut microbiota in metabolic syndrome patients J Clin Endocrinol Metab 2021 106 1 64 79 10.1210/clinem/dgaa644 33017844 19. Tai N Wong FS Wen L The role of gut microbiota in the development of type 1, type 2 diabetes mellitus and obesity Rev Endocr Metab DisorD 2015 16 1 55 65 10.1007/s11154-015-9309-0 25619480 PMC4348024 20. Hartstra AV Bouter KEC Bäckhed F Nieuwdorp M Insights into the role of the microbiome in obesity and type 2 diabetes Diabetes Care 2015 38 1 159 165 10.2337/dc14-0769 25538312 21. De Vadder F Kovatcheva-Datchary P Goncalves D Vinera J Zitoun C Duchampt A Bäckhed F Mithieux G Microbiota-generated metabolites promote metabolic benefits via gut-brain neural circuits Cell 2014 156 1–2 84 96 10.1016/j.cell.2013.12.016 24412651 22. Guan Z Jin X Guan Z Liu S Tao K Luo L The gut microbiota metabolite capsiate regulate SLC2A1 expression by targeting HIF-1α to inhibit knee osteoarthritis-induced ferroptosis Aging Cell 2023 22 6 e13807 10.1111/acel.13807 36890785 PMC10265160 23. Guan Z Xuanqi Z Zhu J Yuan W Jia J Zhang C Sun T Leng H Jiang C Xu Y Estrogen deficiency induces bone loss through the gut microbiota Pharmacol Res 2023 196 106930 10.1016/j.phrs.2023.106930 37722518 24. Gagnon E Mitchell PL Manikpurage HD Abner E Taba N Esko T Ghodsian N Thériault S Mathieu P Arsenault BJ Impact of the gut microbiota and associated metabolites on cardiometabolic traits, chronic diseases and human longevity: a Mendelian randomization study J Transl Med 2023 21 1 60 10.1186/s12967-022-03799-5 36717893 PMC9887809 25. Rastogi S Singh A Gut microbiome and human health: exploring how the probiotic genus Lactobacillus modulate immune responses Front Pharmacol 2022 13 1042189 10.3389/fphar.2022.1042189 36353491 PMC9638459 26. Rizzoli R Biver E Brennan-Speranza TC Nutritional intake and bone health Lancet Diabetes Endocrinol 2021 9 9 606 621 10.1016/S2213-8587(21)00119-4 34242583 27. Goodrich JK Waters J Poole A Sutter J Koren O Blekhman R Beaumont M Van Treuren W Knight R Bell J Human genetics shape the gut microbiome Cell 2014 159 4 789 799 10.1016/j.cell.2014.09.053 25417156 PMC4255478 28. Li J Lin S Vanhoutte PM Woo CW Xu A Akkermansia muciniphila protects against atherosclerosis by preventing metabolic endotoxemia-induced inflammation in ApoE-/- mice Circulation 2016 133 24 2434 2446 10.1161/CIRCULATIONAHA.115.019645 27143680 29. Tulkens J Vergauwen G Van Deun J Geeurickx E Dhondt B Lippens L De Scheerder M-A Miinalainen I Rappu P De Geest BG Increased levels of systemic LPS-positive bacterial extracellular vesicles in patients with intestinal barrier dysfunction Gut 2020 69 1 191 193 10.1136/gutjnl-2018-317726 30518529 PMC6943244 30. Zarrinpar A Chaix A Xu ZZ Chang MW Marotz CA Saghatelian A Knight R Panda S Antibiotic-induced microbiome depletion alters metabolic homeostasis by affecting gut signaling and colonic metabolism Nat Commun 2018 9 1 2872 10.1038/s41467-018-05336-9 30030441 PMC6054678 31. Guan Z Liu Y Luo L Jin X Guan Z Yang J Liu S Tao K Pan J Sympathetic innervation induces exosomal miR-125 transfer from osteoarthritic chondrocytes, disrupting subchondral bone homeostasis and aggravating cartilage damage in aging mice J Adv Res 2024 69 245 260 10.1016/j.jare.2024.03.022 38554999 PMC11954818 32. Zhou Q Guan Z Liu S Xuan Y Han G Chen H Jin X Tao K Guan Z The effects of metformin and alendronate in attenuating bone loss and improving glucose metabolism in diabetes mellitus mice. Aging (Albany NY 2022 14 1 272 285 10.18632/aging.203729 PMC8791222 35027504 33. Rao SS Hu Y Xie P-L Cao J Wang Z-X Liu J-H Yin H Huang J Tan Y-J Luo J Omentin-1 prevents inflammation-induced osteoporosis by downregulating the pro-inflammatory cytokines Bone Res 2018 6 1 9 10.1038/s41413-018-0012-0 29619269 PMC5876344 34. Huang J Yin H Rao S-S Xie P-L Cao X Rao T Liu S-Y Wang Z-X Cao J Hu Y Harmine enhances type H vessel formation and prevents bone loss in ovariectomized mice Theranostics 2018 8 9 2435 2446 10.7150/thno.22144 29721090 PMC5928900 35. Liu JH Chen C-Y Liu Z-Z Luo Z-W Rao S-S Jin L Wan T-F Yue T Tan Y-J Yin H Extracellular vesicles from child gut microbiota enter into bone to preserve bone mass and strength Adv Sci (Weinh) 2021 8 9 2004831 10.1002/advs.202004831 33977075 PMC8097336 36. Deng CL Hu C-B Ling S-T Zhao N Bao L-H Zhou F Xiong Y-C Chen T Sui B-D Yu X-R Photoreceptor protection by mesenchymal stem cell transplantation identifies exosomal miR-21 as a therapeutic for retinal degeneration Cell Death Differ 2021 28 3 1041 1061 10.1038/s41418-020-00636-4 33082517 PMC7937676 37. Zheng C Sui B Zhang X Hu J Chen J Liu J Wu D Ye Q Xiang L Qiu X Apoptotic vesicles restore liver macrophage homeostasis to counteract type 2 diabetes J Extracell Vesicles 2021 10 7 e12109 10.1002/jev2.12109 34084287 PMC8144839 38. Chalmin F Ladoire S Mignot G Vincent J Bruchard M Remy-Martin J-P Boireau W Rouleau A Simon B Lanneau D Membrane-associated Hsp72 from tumor-derived exosomes mediates STAT3-dependent immunosuppressive function of mouse and human myeloid-derived suppressor cells J Clin Invest 2010 120 2 457 471 10.1172/JCI40483 20093776 PMC2810085 39. Liu D Kou X Chen C Liu S Liu Y Yu W Yu T Yang R Wang R Zhou Y Circulating apoptotic bodies maintain mesenchymal stem cell homeostasis and ameliorate osteopenia via transferring multiple cellular factors Cell Res 2018 28 9 918 933 10.1038/s41422-018-0070-2 30030518 PMC6123409 40. Wang C Wang P Li F Li Y Zhao M Feng H Meng H Li J Shi P Peng J Adenovirus-associated anti-miRNA-214 regulates bone metabolism and prevents local osteoporosis in rats Front Bioeng biotechnol 2023 11 1164252 10.3389/fbioe.2023.1164252 37251576 PMC10214158 41. Li C Samulski RJ Engineering adeno-associated virus vectors for gene therapy Nat Rev Genet 2020 21 4 255 272 10.1038/s41576-019-0205-4 32042148 42. Wang C Sun W Ling S Wang Y Wang X Meng H Li Y Yuan X Li J Liu R AAV-anti-miR-214 prevents collapse of the femoral head in osteonecrosis by regulating osteoblast and osteoclast activities Mol Ther Nucleic Acids 2019 18 841 850 10.1016/j.omtn.2019.09.030 31739209 PMC6861671 43. Yang Y Lin Y Wang M Yuan K Wang Q Mu P Du J Yu Z Yang S Huang K Targeting ferroptosis suppresses osteocyte glucolipotoxicity and alleviates diabetic osteoporosis Bone Res 2022 10 1 26 10.1038/s41413-022-00198-w 35260560 PMC8904790 44. Lawenius L Scheffler JM Gustafsson KL Henning P Nilsson KH Colldén H Islander U Plovier H Cani PD de Vos WM Pasteurized Akkermansia muciniphila protects from fat mass gain but not from bone loss Am J Physiol Endocrinol Metab 2020 318 4 E480 e491 10.1152/ajpendo.00425.2019 31961709 PMC7191407 45. Moye ZD Woolston J Sulakvelidze A Bacteriophage applications for food production and processing Viruses 2018 10 4 205 10.3390/v10040205 29671810 PMC5923499 46. Li G Xie C Lu S Nichols RG Tian Y Li L Patel D Ma Y Brocker CN Yan T Intermittent fasting promotes white adipose browning and decreases obesity by shaping the gut microbiota Cell Metab 2017 26 4 672 685.e4 10.1016/j.cmet.2017.08.019 28918936 PMC5668683 47. Schwartz AV Efficacy of osteoporosis therapies in diabetic patients Calcif Tissue Int 2017 100 2 165 173 10.1007/s00223-016-0177-8 27461216 48. Hygum K Starup-Linde J Harsløf T Vestergaard P Langdahl BL Mechanisms in endocrinology: diabetes mellitus, a state of low bone turnover - a systematic review and meta-analysis Eur J Endocrinol 2017 176 3 R137 r157 10.1530/EJE-16-0652 28049653 49. Madsen JOB Herskin CW Zerahn B Jørgensen NR Olsen BS Pociot F Johannesen J Decreased markers of bone turnover in children and adolescents with type 1 diabetes Pediatr Diabetes 2020 21 3 505 514 10.1111/pedi.12987 31970841 50. Lecka-Czernik B Diabetes, bone and glucose-lowering agents: basic biology Diabetologia 2017 60 7 1163 1169 10.1007/s00125-017-4269-4 28434032 PMC5487688 51. Kaur J Khosla S Farr JN Effects of diabetes on osteocytes Curr Opin Endocrinol Diabetes Obes 2022 29 4 310 317 10.1097/MED.0000000000000733 35749726 PMC9271606 52. Manavalan JS Cremers S Dempster DW Zhou H Dworakowski E Kode A Kousteni S Rubin MR Circulating osteogenic precursor cells in type 2 diabetes mellitus J Clin Endocrinol Metab 2012 97 9 3240 3250 10.1210/jc.2012-1546 22740707 PMC3431571 53. Chang W Wang Y Li W Geng Z Long non-coding RNA myocardial infarction associated transcript promotes the proliferation of cholangiocarcinoma cells by targeting miR-551b-3p/CCND1 axis Clin Exp Pharma Physio 2020 47 6 1067 1075 10.1111/1440-1681.13283 32064660 54. Chang W Wang Y Li W Shi L Geng Z MicroRNA-551b-3p inhibits tumour growth of human cholangiocarcinoma by targeting cyclin D1 J Cell Mol Med 2019 23 8 4945 4954 10.1111/jcmm.14312 31199052 PMC6653057 55. Dong A Gao M Zheng X Ruan X Dysregulation of miR-551b-5p and SETD2 predicts poor prognosis and promotes migration and invasion of thyroid cancers Endocr Metab Immune Disord Drug Targets 2023 23 11 1400 1409 10.2174/1871530323666230417083509 37073141 56. Li M Zhi Z Jiang X Duan G-C Zhu W-N Pang Z Wang L Ge R Dai X Liu J-M Mettl9 derived circular RNA circ-METTL9 sponges miR-551b-5p to accelerate colorectal cancer progression by upregulating CDK6 Carcinogenesis 2023 44 6 463 475 10.1093/carcin/bgad031 37158456 57. Cui G Li S Ye H Yang Y Jia X Lin M Chu Y Feng Y Wang Z Shi Z Gut microbiome and frailty: insight from genetic correlation and mendelian randomization Gut Microbes 2023 15 2 2282795 10.1080/19490976.2023.2282795 37990415 PMC10730212 58. Nagpal R Neth BJ Wang S Craft S Yadav H Modified mediterranean-ketogenic diet modulates gut microbiome and short-chain fatty acids in association with Alzheimer’s disease markers in subjects with mild cognitive impairment EBioMedicine 2019 47 529 542 10.1016/j.ebiom.2019.08.032 31477562 PMC6796564 59. Yao T Wu Y Fu L Lv J Lv L Li L Christensenellaceae minuta modulates epithelial healing via PI3K-AKT pathway and macrophage differentiation in the colitis Microbiol Res 2024 289 127927 10.1016/j.micres.2024.127927 39393129 60. Bao S Zhu L Zhuang Q Wang L Xu P-X Itoh K Holzman IR Lin J Distribution dynamics of recombinant Lactobacillus in the gastrointestinal tract of neonatal rats PLOS ONE 2013 8 3 e60007 10.1371/journal.pone.0060007 23544119 PMC3609735 61. Chaikham P Apichartsrangkoon A Effects of encapsulated Lactobacillus acidophilus along with pasteurized longan juice on the colon microbiota residing in a dynamic simulator of the human intestinal microbial ecosystem Appl Microbiol BioTechnol 2014 98 1 485 495 10.1007/s00253-013-4763-7 23546419 62. Wang N Dilixiati Y Xiao L Yang H Zhang Z Different short-chain fatty acids unequally modulate intestinal homeostasis and reverse obesity-related symptoms in lead-exposed high-fat diet mice J Agric Food Chem 2024 72 34 18971 18985 10.1021/acs.jafc.4c04193 39146036 63. He B Jiang J Shi Z Wu L Yan J Chen Z Luo M Cui D Xu S Yan M Pure total flavonoids from citrus attenuate non-alcoholic steatohepatitis via regulating the gut microbiota and bile acid metabolism in mice Biomed Pharmaco Ther 2021 135 111183 10.1016/j.biopha.2020.111183 33401222 64. Cuevas-Martínez R González-Chávez SA Bermúdez M Salas-Leiva JS Vázquez-Olvera G Hinojos-Gallardo LC Chaparro-Barrera E Pacheco-Silva C Romero-Sánchez C Villegas-Mercado CE Intermittent fasting reduces inflammation and joint damage in a murine model of rheumatoid arthritis: insights from transcriptomic and metagenomic analyses BMC Rheumatol. 2024 8 1 64 10.1186/s41927-024-00436-0 39587696 PMC11587710 65. Saini SK Singh A Saini M Gonzalez-Freire M Leeuwenburgh C Anton SD Time-restricted eating regimen differentially affects circulatory miRNA expression in older overweight adults Nutrients 2022 14 9 1843 10.3390/nu14091843 35565812 PMC9100641 66. Obermayer A Tripolt NJ Pferschy PN Kojzar H Aziz F Müller A Schauer M Oulhaj A Aberer F Sourij C Efficacy and safety of intermittent fasting in people with insulin-treated type 2 diabetes (INTERFAST-2)-a randomized controlled trial Diabetes Care 2023 46 2 463 468 10.2337/dc22-1622 36508320 PMC9887629 67. Welton S Minty R O’Driscoll T Willms H Poirier D Madden S Kelly L Intermittent fasting and weight loss: systematic review Can Fam Physician 2020 66 2 117 125 32060194 PMC7021351 68. Mattson MP Longo VD Harvie M Impact of intermittent fasting on health and disease processes Ageing Res Rev 2017 39 46 58 10.1016/j.arr.2016.10.005 27810402 PMC5411330 69. Kim BH Joo Y Kim M-S Choe HK Tong Q Kwon O Effects of intermittent fasting on the circulating levels and circadian rhythms of hormones Endocrinol Metab (Seoul) 2021 36 4 745 756 10.3803/EnM.2021.405 34474513 PMC8419605 70. de Cabo R Mattson MP Effects of intermittent fasting on health, aging, and disease N Engl J Med 2019 381 26 2541 2551 10.1056/NEJMra1905136 31881139 71. Črešnovar T Habe B Mohorko N Kenig S Jenko Pražnikar Z Petelin A Early time-restricted eating with energy restriction has a better effect on body fat mass, diastolic blood pressure, metabolic age and fasting glucose compared to late time-restricted eating with energy restriction and/or energy restriction alone: a 3-month randomized clinical trial Clin Nutr 2025 49 57 68 10.1016/j.clnu.2025.04.001 40250088 72. Anton SD Moehl K Donahoo WT Marosi K Lee SA Mainous AG Leeuwenburgh C Mattson MP Flipping the metabolic switch: understanding and applying the health benefits of fasting Obes (Silver Spring) 2018 26 2 254 268 10.1002/oby.22065 PMC5783752 29086496 73. Galasso M Verde L Barrea L Savastano S Colao A Frühbeck G Muscogiuri G The impact of different nutritional approaches on body composition in people living with obesity Curr Obes Rep 2025 14 1 45 10.1007/s13679-025-00636-w 40381089 PMC12085324 74. Zhang MC Zhu Y-Z Tong Y-T Wu H-Y Shi C-L Ding Y Li W Liu X-F Yi Y-Y Postoperative intermittent fasting improves outcome of autologous fat grafting in mice Aesth Plast Surg 2025 10.1007/s00266-025-04796-x 40278876 75. Weir HJ Yao P Huynh FK Escoubas CC Goncalves RL Burkewitz K Laboy R Hirschey MD Mair WB Dietary restriction and AMPK increase lifespan via mitochondrial network and peroxisome remodeling Cell Metab 2017 26 6 884 896.e5 10.1016/j.cmet.2017.09.024 29107506 PMC5718936 76. Desjardins EM Smith BK Day EA Ducommun S Sanders MJ Nederveen JP Ford RJ Pinkosky SL Townsend LK Gutgesell RM The phosphorylation of AMPKβ1 is critical for increasing autophagy and maintaining mitochondrial homeostasis in response to fatty acids Proc Natl Acad Sci USA 2022 119 48 e2119824119 10.1073/pnas.2119824119 36409897 PMC9860314 77. Kazmirczak F Hartweck LM Vogel NT Mendelson JB Park AK Raveendran RM O-Uchi J Jhun BS Prisco SZ Prins KW Intermittent fasting activates AMP-kinase to restructure right ventricular lipid metabolism and microtubules JACC Basic Transl Sci 2023 8 3 239 254 10.1016/j.jacbts.2022.12.001 37034280 PMC10077124 78. Zhang E Cui W Lopresti M Mashek MT Najt CP Hu H Mashek DG Hepatic PLIN5 signals via SIRT1 to promote autophagy and prevent inflammation during fasting J Lipid Res 2020 61 3 338 350 10.1194/jlr.RA119000336 31932301 PMC7053830 79. Heilbronn LK Civitarese AE Bogacka I Smith SR Hulver M Ravussin E Glucose tolerance and skeletal muscle gene expression in response to alternate day fasting Obes Res 2005 13 3 574 581 10.1038/oby.2005.61 15833943 80. Bruno NE Nwachukwu JC Hughes DC Srinivasan S Hawkins R Sturgill D Hager GL Hurst S Sheu S-S Bodine SC Activation of Crtc2/Creb1 in skeletal muscle enhances weight loss during intermittent fasting Faseb J 2021 35 12 e21999 10.1096/fj.202100171R 34748223 PMC10236530 81. Liu PS Chen Y-T Li X Hsueh P-C Tzeng S-F Chen H Shi P-Z Xie X Parik S Planque M Cd40 signal rewires fatty acid and glutamine metabolism for stimulating macrophage anti-tumorigenic functions Nat Immunol 2023 24 3 452 462 10.1038/s41590-023-01430-3 36823405 PMC9977680 82. Calder PC Marine omega-3 fatty acids and inflammatory processes: effects, mechanisms and clinical relevance Biochim Biophys Acta 2015 1851 4 469 484 10.1016/j.bbalip.2014.08.010 25149823 83. Christofides A Konstantinidou E Jani C Boussiotis VA The role of peroxisome proliferator-activated receptors (PPAR) in immune responses Metabolism 2021 114 154338 10.1016/j.metabol.2020.154338 32791172 PMC7736084 84. Siriwardhana N Kalupahana NS Fletcher S Xin W Claycombe KJ Quignard-Boulange A Zhao L Saxton AM Moustaid-Moussa N N-3 and n-6 polyunsaturated fatty acids differentially regulate adipose angiotensinogen and other inflammatory adipokines in part via NF-κB-dependent mechanisms J Nutr Bio Chem 2012 23 12 1661 1667 10.1016/j.jnutbio.2011.11.009 22475809 85. Zhang A Wang J Zhao Y He Y Sun N Intermittent fasting, fatty acid metabolism reprogramming, and neuroimmuno microenvironment: mechanisms and application prospects Front Nutr 2024 11 1485632 10.3389/fnut.2024.1485632 39512520 PMC11541237 86. Guarente L Calorie restriction and sirtuins revisited Genes Dev 2013 27 19 2072 2085 10.1101/gad.227439.113 24115767 PMC3850092 87. Zhao Y Jia M Chen W Liu Z The neuroprotective effects of intermittent fasting on brain aging and neurodegenerative diseases via regulating mitochondrial function Free Radic Biol Med 2022 182 206 218 10.1016/j.freeradbiomed.2022.02.021 35218914 88. Chaudhary MR Chaudhary S Sharma Y Singh TA Mishra AK Sharma S Mehdi MM Aging, oxidative stress and degenerative diseases: mechanisms, complications and emerging therapeutic strategies Biogerontology 2023 24 5 609 662 10.1007/s10522-023-10050-1 37516673 89. Mayor E Neurotrophic effects of intermittent fasting, calorie restriction and exercise: a review and annotated bibliography Front Aging 2023 4 1161814 10.3389/fragi.2023.1161814 37334045 PMC10273285 90. Tsintzas K Betts JA Calorie counting vs. minute counting; does nutrient timing matter for weight-loss? Curr Opin In Clin Nutr Metab Care 2025 28 4 333 338 10.1097/MCO.0000000000001135 40401907 91. Shaaban S Mohsen S Ayman A Nabil R Eladrousi M Algamal R Hamdy A Impact of Ramadan intermittent fasting on patients with epilepsy: a clinical and laboratory study Epilepsy Behav 2025 170 110489 10.1016/j.yebeh.2025.110489 40382995 92. Koukach D Aljumaily M Al-Attiyah N Al-Amer R Attia Y Tayyem R From prevention to management: exploring the impact of diet on multiple sclerosis Transl Neurosci 2025 16 1 20250371 10.1515/tnsci-2025-0371 40391017 PMC12086631 93. Neema S Vausdevan B Misra P Vendhan S Sibin MK Patrikar S Efficacy of intermittent fasting in the management of chronic plaque psoriasis: a phase IIb clinical trial Indian Dermatol Online J 2025 16 3 389 396 10.4103/idoj.idoj_635_24 40395583 PMC12088499 94. Zhao X Gu C Wang M Huang S Gong X Kang M Zhang T Shen J Yang X Xi Y Human neural progenitor cell-derived exosomes deliver miR-100-5p targeting NOX4 mRNA to alleviate oxidative stress in acute ischemia injury Mol Neurobiol 2025 62 9 12344 12359 10.1007/s12035-025-04952-z 40402409 PMC12367819 95. Elayapillai SP Dogra S Hladik C Lausen J Bruns M Gossett AG Behbod F Xu C Zhang R Ding W-Q Preferential release of microRNAs via extracellular vesicles is associated with ductal carcinoma in situ to invasive breast cancer progression Cancer Lett 2025 625 217794 10.1016/j.canlet.2025.217794 40389020 96. He S Lv Y Jiang Y Tao H Chen X Peng L Recombination of miR-146b by Lactococcus lactis for remolding macrophages and the microbiome in the treatment of murine colitis J Agric Food Chem 2025 73 22 13427 13438 10.1021/acs.jafc.4c11183 40397547 97. Pan Y Zhao X Chen Q Zhao T Ma Y Wu H Xiang Y Jiang P Li W Yan Q Faecalibacterium prausnitzii extracellular vesicles regulating macrophage differentiation via homologous recombination repair in colitis model Microbiol Res 2025 298 128217 10.1016/j.micres.2025.128217 40393169 98. Zhang X Wang Y E Q Naveed M Wang X Liu Y Li M The biological activity and potential of probiotics-derived extracellular vesicles as postbiotics in modulating microbiota-host communication J Nanobiotechnol 2025 23 1 349 10.1186/s12951-025-03435-6 PMC12082936 40380331 99. Liu K Zou J Fan H Hu H You Z Causal effects of gut microbiota on diabetic retinopathy: a Mendelian randomization study Front Immunol 2022 13 930318 10.3389/fimmu.2022.930318 36159877 PMC9496187 100. Waters JL Ley RE The human gut bacteria Christensenellaceae are widespread, heritable, and associated with health BMC Biol 2019 17 1 83 10.1186/s12915-019-0699-4 31660948 PMC6819567 101. Coello K Hansen TH Sørensen N Ottesen NM Miskowiak KW Pedersen O Kessing LV Vinberg M Affective disorders impact prevalence of flavonifractor and abundance of Christensenellaceae in gut microbiota Prog Neuropsychopharmacol Biol Psychiatry 2021 110 110300 10.1016/j.pnpbp.2021.110300 33713734 102. Tavella T Rampelli S Guidarelli G Bazzocchi A Gasperini C Pujos-Guillot E Comte B Barone M Biagi E Candela M Elevated gut microbiome abundance of Christensenellaceae, Porphyromonadaceae and Rikenellaceae is associated with reduced visceral adipose tissue and healthier metabolic profile in Italian elderly Gut Microbes 2021 13 1 1 19 10.1080/19490976.2021.1880221 PMC7889099 33557667 103. Hou D Yang Y Genetically predicted elevated circulating 3,4-dihydroxybutyrate levels mediate the association between family Christensenellaceae and osteoporosis risk: a Mendelian randomization study Front Endocrinol (Lausanne) 2024 15 1388772 10.3389/fendo.2024.1388772 39086901 PMC11288937 104. Liu Y Alexeeva S Defourny KA Smid EJ Abee T Tiny but mighty: bacterial membrane vesicles in food biotechnological applications Curr Opin Biotechnol 2018 49 179 184 10.1016/j.copbio.2017.09.001 28985542 105. Britton RA Irwin R Quach D Schaefer L Zhang J Lee T Parameswaran N McCabe LR Probiotic L. reuteri treatment prevents bone loss in a menopausal ovariectomized mouse model J Cell Physiol 2014 229 11 1822 1830 10.1002/jcp.24636 24677054 PMC4129456 106. Hamilton MJ Weingarden AR Sadowsky MJ Khoruts A Standardized frozen preparation for transplantation of fecal microbiota for recurrent Clostridium difficile infection Am J Gastroenterol 2012 107 5 761 767 10.1038/ajg.2011.482 22290405 107. Jiang M Jike Y Liu K Gan F Zhang K Xie M Zhang J Chen C Zou X Jiang X Exosome-mediated miR-144-3p promotes ferroptosis to inhibit osteosarcoma proliferation, migration, and invasion through regulating ZEB1 Mol Cancer 2023 22 1 113 10.1186/s12943-023-01804-z 37461104 PMC10351131 108. Yu Y Chen M Guo Q Shen L Liu X Pan J Zhang Y Xu T Zhang D Wei G Human umbilical cord mesenchymal stem cell exosome-derived miR-874-3p targeting RIPK1/PGAM5 attenuates kidney tubular epithelial cell damage Cell Mol Biol Lett 2023 28 1 12 10.1186/s11658-023-00425-0 36750776 PMC9903493 109. Xia C Zhu K Zhang Y Chen J Yu C Gao T Zheng G Serum exosome-derived miR-146a-3p promotes macrophage M2 polarization in allergic rhinitis by targeting VAV3 via PI3K/AKT/mTOR pathway Int Immunopharmacol 2023 124 Pt B 110997 10.1016/j.intimp.2023.110997 37783052 110. Zeng ZL Xie H Mesenchymal stem cell-derived extracellular vesicles: a possible therapeutic strategy for orthopaedic diseases: a narrative review Biomater Transl 2022 3 3 175 187 10.12336/biomatertransl.2022.03.002 36654775 PMC9840092 111. Liu H Li M Zhang T Liu X Zhang H Geng Z Su J Engineered bacterial extracellular vesicles for osteoporosis therapy Chem Eng J 2022 450 138309 10.1016/j.cej.2022.138309 112. Gao Q Jiang Y Zhou D Li G Han Y Yang J Xu K Jing Y Bai L Geng Z Advanced glycation end products mediate biomineralization disorder in diabetic bone disease Cell Rep Med 2024 5 9 101694 10.1016/j.xcrm.2024.101694 39173634 PMC11524989 113. Hu Y Xiong Y Tao R Xue H Chen L Lin Z Panayi AC Mi B Liu G Advances and perspective on animal models and hydrogel biomaterials for diabetic wound healing Biomater Transl 2022 3 3 188 200 10.12336/biomatertransl.2022.03.003 36654776 PMC9840091 114. Wang H Lu B Zhou J Lai J Zheng X Guo S-Z Zhang L-M Biobased physicochemical reversible dual-cross-linked hydrogel: self-healing, antibacterial, antioxidant, and hemostatic properties for diabetic wound healing Biomacromolecules 2025 26 4 2637 2653 10.1021/acs.biomac.5c00087 40127295 ",
  "metadata": {
    "Title of this paper": "Biobased physicochemical reversible dual-cross-linked hydrogel: self-healing, antibacterial, antioxidant, and hemostatic properties for diabetic wound healing",
    "Journal it was published in:": "Gut Microbes",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12490001/"
  }
}