{
  "title": "Paper_1091",
  "abstract": "pmc J Clin Med J Clin Med 2745 jclinmed jcm Journal of Clinical Medicine 2077-0383 Multidisciplinary Digital Publishing Institute  (MDPI) PMC12470722 PMC12470722.1 12470722 12470722 41010888 10.3390/jcm14186684 jcm-14-06684 1 Article Impact of Surgical Delay on Two-Stage Breast Reconstruction During the COVID-19 Pandemic: A Retrospective Analysis https://orcid.org/0000-0002-5859-1742 Paganini Ferruccio Conceptualization Validation Investigation Data curation Writing – original draft 1 * Bascialla Elisa Conceptualization Writing – review & editing Supervision 1 Corsini Beatrice Validation Data curation Supervision 1 Truini Chiara Software Data curation 1 Arcaini Monica Formal analysis Writing – original draft 1 Fresta Lorenzo Methodology Validation 1 Lo Torto Federico Formal analysis Resources Visualization 2 Marcasciano Marco Resources Writing – review & editing 3 https://orcid.org/0009-0009-9500-404X Matarazzo Sara Formal analysis Writing – review & editing 1 https://orcid.org/0000-0002-1844-7850 Ribuffo Diego Methodology Investigation Project administration 2 Valdatta Luigi Conceptualization Resources Project administration 1 Bassetto Franco Academic Editor 1 elisabascialla@gmail.com beatricecorsini97@gmail.com chiara.truini@unimi.it marcaini@studenti.uninsubria.it lfresta@studenti.uninsubria.it smsaramatarazzo@gmail.com luigi.valdatta@uninsubria.it 2 federico.lotorto@uniroma1.it diego.ribuffo@uniroma1.it 3 m.marcasciano@unicz.it * fpaganini@studenti.uninsubria.it 22 9 2025 9 2025 14 18 497642 6684 27 8 2025 18 9 2025 20 9 2025 22 09 2025 27 09 2025 29 09 2025 © 2025 by the authors. 2025 https://creativecommons.org/licenses/by/4.0/ Licensee MDPI, Basel, Switzerland. This article is an open access article distributed under the terms and conditions of the Creative Commons Attribution (CC BY) license ( https://creativecommons.org/licenses/by/4.0/ Background: Methods: Results: Conclusions: breast reconstruction tissue expander COVID-19 pandemic surgical delay capsular contracture patient-reported outcomes This research received no external funding. pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement yes pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes 1. Introduction The COVID-19 pandemic forced surgical units worldwide to delay non-urgent procedures, including reconstructive surgery [ 1 2 3 Breast reconstruction has long been debated in the literature [ 4 5 6 7 8 9 10 11 During the pandemic (2020–2022) [ 12 13 14 15 This study leverages the pandemic as an unprecedented “natural experiment” to investigate the effects of delayed expander-to-implant exchange. We aimed to (i) quantify the delay imposed by the pandemic, (ii) evaluate early and late surgical complications, and (iii) explore patient-reported outcomes to assess the functional and psychosocial impact of prolonged expander retention. 2. Patients and Methods 2.1. Study Design This was a retrospective, single-center observational study conducted at the Department of Plastic and Reconstructive Surgery of the Circolo Hospital and Macchi Foundation in Varese, Italy. The study population consisted of all patients who underwent two-stage alloplastic breast reconstruction with a tissue expander followed by exchange to a permanent implant between December 2011 and December 2022. Data collection and analysis were performed between June and September 2024. To ensure adequate follow-up for the assessment of late complications, only patients with at least 18 months of follow-up after the second-stage procedure were included. Patients were excluded if they underwent autologous reconstruction at the second stage, received direct-to-implant reconstruction or alternative reconstructive approaches, required early expander-to-implant exchange for oncological reasons (<6 months), had implant removal without reconstruction, or were lost to follow-up. The study design was chosen to compare two naturally occurring cohorts: Case group (pandemic cohort): patients scheduled for the second-stage reconstruction between February 2020 (declaration of the COVID-19 emergency in Italy) and December 2022. Control group (pre-pandemic cohort): patients who completed the second-stage reconstruction between December 2011 and February 2020, before the pandemic. This setting provided a unique opportunity to analyze the effects of surgical delay imposed by a global health crisis. Our center was not designated as a COVID-free facility; consequently, surgical resources were frequently diverted to pandemic care, leading to unavoidable delays in expander-to-implant exchange. The study was conducted in accordance with the STROBE guidelines for observational research [ 16 2.2. Variables Analysed A wide range of variables were collected to compare the pre-pandemic and pandemic cohorts and to evaluate the impact of surgical delay. Data were retrieved from electronic medical records and organized into the following categories: Demographic variables Oncological variables Perioperative variables Reconstructive variables Outcomes ○ Early complications (within 30 postoperative days): hematoma, seroma, infection, wound dehiscence, need for reoperation, implant loss. ○ Late complications (beyond 30 days until expander replacement): rupture, capsular contracture, infection, seroma, wound dehiscence, implant exposure, reoperation. ○ Capsular contracture after definitive implant exchange (minimum 18 months follow-up). This structured dataset allowed for comparison of demographic and clinical factors between groups, evaluation of early and late complications, and identification of predictors of adverse outcomes. 2.3. Surgical Protocols Surgical indications for expander-based reconstruction were established on the basis of oncological treatment plans, breast anatomy, mastectomy flap viability, patient comorbidities, and overall compliance. In the first stage, a tissue expander was inserted into a subpectoral pocket, with an acellular dermal matrix (ADM) used in selected cases to cover the lower pole. A drain was positioned partly in the subpectoral pocket and partly in the subcutaneous layer; in patients undergoing complete axillary dissection, a second drain was placed in the axillary cavity. In the second stage, the expander was removed and the periprosthetic capsule remodelled with capsulotomies or partial capsulectomy when required. A permanent implant was then inserted. Symmetry procedures on the contralateral breast (reduction, augmentation, or mastopexy) were performed when indicated and requested by the patient. A single drain was placed during exchange procedures. 2.4. Perioperative Management and Follow-Up All patients were treated according to standardized institutional protocols, which remained unchanged during the entire study period. Antibiotic prophylaxis Analgesia Anticoagulation The first dressing change after discharge was performed 3–4 days postoperatively, followed by twice-weekly dressing changes until drain removal. Scheduled follow-up visits took place 3 and 6 months after the expansion phase, and then every 6 months for at least 18 months after definitive implant placement. 2.5. Discomfort Assessment for Delays To complement clinical outcomes, we evaluated patient-reported experiences during the expander retention period and after definitive implant placement. For this purpose, a nine-item questionnaire was specifically developed for the study ( Supplementary Figure S1 The tool investigated three domains: Physical discomfort (e.g., pain, restrictions in daily activities, sleep quality), Psychosocial impact (e.g., body image, limitations in social or occupational activities), Satisfaction with final reconstruction (perceived adaptation to the implant, willingness to undergo the procedure again). Each item was scored on a categorical scale, and responses were collected during scheduled follow-up visits after completion of the second stage of reconstruction. The questionnaire was not a validated instrument such as the BREAST-Q, since standardized tools require preoperative baseline data and do not specifically capture retrospective perceptions of surgical delay. Instead, it was designed to address the unique situation created by the COVID-19 pandemic, aiming to explore patient perspectives that would otherwise remain undocumented. 2.6. Statistical Analysis All data were entered into a dedicated database and analyzed using standard statistical software SPSS v30. Descriptive statistics were used to summarize demographic and clinical variables. Continuous variables were expressed as means with standard deviation (SD) and compared using Student’s t Postoperative complications were analyzed by timing (early, within 30 days, vs. late, beyond 30 days until expander replacement) and by reconstructive stage (expander vs. definitive implant). Correlation analyses (Spearman’s rho) were performed to evaluate associations between expander maintenance time and questionnaire scores. To account for potential confounders, a multivariate logistic regression model was built with capsular contracture as the primary outcome. Predictors included group assignment (pandemic vs. pre-pandemic), expander duration, age, smoking status, comorbidities, radiotherapy during expansion, and follow-up length. A secondary logistic regression was performed using “any complication” as the outcome. Results were reported as adjusted ORs with 95% CI. A p 3. Results Between December 2011 and April 2022, a total of 366 expander-based breast reconstructions were performed at our institution. Of these, 147 patients underwent the second-stage procedure during the COVID-19 pandemic (Group A, cases), and 219 patients completed reconstruction in the pre-pandemic period (Group B, controls). In the case group, 142 patients received expander-to-implant exchange between September 2020 and April 2022, reflecting the delay imposed by the suspension of elective surgery in the first pandemic months (February–August 2020). In the control group, 215 patients completed reconstruction between 2011 and February 2020. This division allowed for comparison of two naturally occurring cohorts of considerable size, providing one of the largest single-center analyses to date on the impact of surgical delay in two-stage breast reconstruction and strengthening the generalizability of our findings. 3.1. Demographic Analysis ( Supplementary Table S1 The mean age was 49 years (range 30–76) in the pandemic group compared with 53 years (range 25–75) in the pre-pandemic group. This difference was statistically significant ( t p Apart from age, no significant demographic or clinical differences were observed between groups. Rates of comorbidities such as diabetes, hypothyroidism, hypercholesterolemia, and arterial hypertension were similar, as were pre- and postoperative hemoglobin and hematocrit values ( Supplementary Table S2 Supplementary Table S3 Table 1 Reconstructive characteristics, including type of expander, duration of expansion, and final expansion volume, were also comparable across groups ( Table 2 3.2. Treatment Delays ( Table 2 The interval between the first and second stages of reconstruction was markedly longer in the pandemic cohort compared with the pre-pandemic group. Patients in the case group experienced an average waiting time of 481 days (SD 231), whereas controls underwent exchange after a mean of 280 days (SD 137). This difference was highly significant (t = 10.35, p These data confirm the profound impact of the COVID-19 pandemic on reconstructive scheduling. The increase of more than 200 days in the average waiting period highlights the systemic delays imposed by resource reallocation and restrictions on elective procedures, which created the unique conditions for this natural experiment. 3.3. Complication Analysis ( Table 3 Supplementary Figures S2 and S3 A total of 122 complications were observed across the entire cohort of 366 patients. Complications occurred in 43 patients in each group, but their distribution differed significantly between cohorts. The overall complication rate was higher in the pandemic group (29%) compared with the pre-pandemic group (18%), with chi-square analysis confirming statistical significance (χ 2 p jcm-14-06684-t003_Table 3 Table 3 Complications analysis.  Group 1 (Cases) Group 2 (Controls) p Total complications 29% (43) 18% (43) 0.0333 Early complications (<30 days)    Hematoma 4% (6) 2% (5) 0.3592 RTOR 0% (0) 0.5% (1)  Seroma 10% (14) 5% (12) 0.1499 RTOR 0% (0) 0% (0)  Infection 5% (7) 3% (6) 0.3892 RTOR 2% (3) 1% (2)  Wound dehiscence 8% (12) 10% (21) 0.0715 RTOR 2% (3) 1% (3)  Implant explant 1% (2) 2% (5) 0.7068 Late complications (>30 days)    Implant rupture 2% (3) 0.5% (1) 0.3055 Contracture 7% (10) 1% (3) 0.0077 ** Hematoma 0% (0) 0% (0) 1 RTOR 0% (0) 0% (0)  Seroma 1% (1) 0.5% (1) 1 RTOR 0% (0) 0% (0)  Infection 0% (0) 1% (2) 0.5196 RTOR 0% (0) 0.5% (1)  Wound dehiscence 3% (4) 0.5% (1) 0.0839 RTOR 1% (2) 0% (0)  Implant exposure 0% (0) 0% (0) 1 RTOR 0% (0) 0% (0)  Implant explant 2% (3) 1% (3) 0.6856 Legend: RTOR—Return To Operating Room; *—at Fisher exact test; ** statistically significant. When stratified by timing, early complications (within 30 days) did not differ significantly between groups ( Supplementary Figure S2 Supplementary Figure S3 2 p Capsular contracture emerged as the complication most strongly associated with surgical delay. The odds ratio for developing contracture during the expander phase was 5.32 in the pandemic group, compared with 1.2 after definitive implant exchange. Notably, once the expander was replaced with a permanent implant, the difference in contracture rates was no longer statistically significant (χ 2 p Figure 1 In addition, the rate of expander rupture was higher in the pandemic group, although this difference did not reach statistical significance. Other late complications, including infection, seroma, and wound dehiscence, occurred at similar frequencies across groups. Multivariate Analysis ( Table 4 Multivariate logistic regression was performed to account for potential confounding factors, including age, smoking status, comorbidities, radiotherapy during expansion, and follow-up duration (See Table 4 jcm-14-06684-t004_Table 4 Table 4 Multivariate logistic regression analysis for predictors of complication. Outcome Predictor OR 95% CI p Capsular contracture (Model A) Pandemic group (vs. pre-pandemic) 33.4 0.68–63.4 0.015  Age 1.01 - 0.18 (ns)  Smoking 1.08 - 0.81 (ns)  Comorbidities 0.99 - ≈1.0 (ns)  Radiotherapy during expansion - - ns  Follow-up (months) 1.05 - 0.078 (trend) Capsular contracture (Model B) Expander duration (per day) 1.006 1.002–1.009 0.002  (other covariates) - - ns Any complication (Model C) Pandemic group (vs. pre-pandemic) 1.54 0.82–4.04 0.167  Age 1.02 - 0.12 (ns)  Comorbidities 0.58 - 0.12 (ns)  Follow-up (months) 1.014 1.000–1.027 0.047  Smoking, Radiotherapy - - ns Any complication (Model D) Expander duration (per day) 1.0003 0.999–1.002 0.66  Follow-up (months) 1.012 - 0.076 (trend)  (other covariates) - - ns ns = not significant; OR = Odds Ratio; CI = Confidence Interval. Models A and C included pandemic group as main predictor; Models B and D included expander retention time as a continuous variable instead, to avoid collinearity. When capsular contracture around the expander was set as the primary outcome, belonging to the pandemic group remained an independent predictor (OR 33.4, 95% CI 0.68–63.4, p When group assignment was replaced by expander retention time as a continuous variable, longer duration was likewise an independent predictor of capsular contracture (OR 1.006 per day, 95% CI 1.002–1.009, p By contrast, when “any complication” was considered as the outcome, neither group assignment (OR 1.54, p p p Taken together, these analyses indicate that prolonged expander retention specifically increases the risk of capsular contracture, while not contributing to a broader rise in postoperative morbidity. Clinically, this means that surgical delay was the predominant driver of expander contracture, while other patient- and treatment-related factors had only a marginal role. 3.4. Reoperation Rates Reoperations for complications were required in both groups at comparable rates. Overall, 17% of patients with early complications and 10% of those with late complications underwent surgical revision, with no significant difference between the pandemic and pre-pandemic cohorts. These findings indicate that, despite the higher incidence of expander contracture in delayed patients, the overall burden of reoperation was not increased. A notable clinical vignette further illustrates the patient perspective. One patient with a history of fibromyalgia experienced persistent pain during the prolonged expander phase and, faced with repeated delays in proceeding to the second stage, ultimately chose explantation without further reconstruction. This case underscores how subjective experience and comorbid conditions can influence surgical outcomes beyond standard complication metrics. Reoperation rates observed in this series are consistent with those reported in the literature for expander–implant reconstruction, supporting the generalizability of our findings. To further qualify the severity of complications, events were classified according to the Clavien–Dindo system [ 17 18 3.5. Classification of Complications Using the Clavien-Dindo System [ 17 18 Complications were graded according to the Clavien–Dindo classification to better capture their clinical severity. Among early complications, the majority were minor (Grade 1–2), including wound healing problems, seroma, or infections managed conservatively. Grade 3b complications requiring surgical intervention were observed in 8 patients in the pandemic group and 11 in the pre-pandemic group. Late complications followed a similar distribution, with most cases classified as Grade 1–2 and only a minority requiring reoperation (Grade 3b: 5 cases in the pandemic group vs. 4 in the control group). No statistically significant differences were observed between groups in the distribution of complication grades (Fisher’s exact test, p These findings confirm that, although surgical delay increased the incidence of capsular contracture, it did not shift the overall severity profile of complications. Most adverse events remained low-grade and manageable with conservative treatment, and the rates of severe complications requiring surgical revision were comparable between cohorts. 3.6. Patient Questionnaire ( Supplementary Figure S1 Analysis of the nine-item questionnaire revealed that most responses did not differ significantly between groups ( Figure 2 Figure 3 p Correlation analyses further highlighted the impact of prolonged expander retention on patient-reported outcomes. In the pandemic cohort, longer expander duration was directly associated with higher discomfort scores (Question 6, rs = 0.2, p p p p p Taken together, these results indicate that prolonged expander maintenance had a measurable negative impact on patients’ daily lives, increasing functional limitations and discomfort. At the same time, the paradoxical finding of higher satisfaction with the definitive implant among delayed patients suggests a more complex psychological response, which is further explored in the Discussion. Figure 2 Figure 3 4. Discussion This study aimed to investigate potential complications following mastectomy and breast reconstruction, particularly associated with the prolonged retention of tissue expanders beyond six months—the timeframe generally recommended in the scientific literature [ 19 20 21 22 23 20 Other studies have suggested that extending expander retention beyond six months may increase the risk of complications, including capsular contracture and infection [ 24 25 26 Against this background, our study leverages the COVID-19 pandemic as a “natural experiment” that forced systematic delays in surgical scheduling. With one of the largest single-center cohorts analyzed to date, we were able to demonstrate that prolonged expander retention selectively increased the risk of capsular contracture, while overall complication rates remained unaffected. This selective effect adds new evidence to the literature, showing that surgical delay primarily impacts contracture rather than general morbidity. 4.1. Significance of Data Expander-based two-stage reconstruction has long been associated with timing-related outcomes. Literature generally recommends limiting expander retention to about six months [ 19 20 21 22 23 24 25 26 20 21 22 23 24 25 26 27 28 By contrast, no significant increase in overall complications was observed. Early postoperative outcomes remained stable, likely reflecting the consistent application of perioperative protocols (antibiotic prophylaxis, drain management, analgesia, anticoagulation) that were maintained throughout the pandemic. This suggests that systemic disruption affected scheduling rather than the quality of perioperative care. Device integrity remains a concern: manufacturers warn that shell fatigue and folding may occur when expanders are retained beyond recommended times [ 29 30 31 This selective effect of delay—impacting contracture but not overall complication rates—emerges as the novel contribution of our study, distinguishing it from previous literature where global morbidity was often emphasized. 4.2. Patient Questionnaire Analysis ( Supplementary Figure S1 Beyond complications, surgical delay profoundly shaped patient experience. Our custom questionnaire—developed to address perceptions of delay, given that validated instruments such as the BREAST-Q require preoperative data and do not specifically capture retrospective experiences—revealed both detrimental and paradoxical effects. Negatively, patients in the delayed group reported greater physical and occupational limitations (Question 7), in line with prior evidence that prolonged expander use may cause chronic pain, functional impairment, and reduced upper-limb mobility [ 27 32 33 34 At the same time, paradoxical responses emerged. Despite reporting more discomfort, delayed patients expressed greater satisfaction with the definitive implant. Two explanations are possible. First, longer retention may promote genuine adaptation to the prosthetic device, facilitating eventual acceptance. Second, and perhaps more plausibly, this pattern may reflect a “relief effect”: after enduring prolonged discomfort and uncertainty, patients perceive the final reconstruction more positively, independent of objective outcomes. Both mechanisms are relevant and highlight the complexity of patient perception under disrupted timelines. Correlation analyses supported this duality. Prolonged retention correlated with higher discomfort (Question 6), but inversely with sleep quality (Question 5) and return to normal habits (Question 9). These findings suggest that delay negatively affects daily well-being during expansion, yet the eventual transition to a definitive implant is perceived as particularly rewarding. Such nuances should be considered in patient counseling, especially when further delays are anticipated. 4.3. Comparison with Literature Our results strengthen existing evidence that expander retention beyond six months increases contracture risk [ 20 21 22 23 24 25 26 28 35 In contrast, infection and seroma rates were not increased, diverging from some reports linking prolonged expansion to higher morbidity [ 24 25 21 36 37 38 39 Concerns about device integrity have been raised in both clinical and experimental studies, with reports of expander rupture and shell weakness after long-term use [ 29 30 31 40 Finally, radiotherapy—commonly identified as a major risk factor for adverse prosthetic outcomes [ 41 42 43 4.4. Decision-Making Impact The COVID-19 pandemic acted as a “stress test” for reconstructive surgery. Our results show that prolonged expander retention selectively increased contracture risk without amplifying overall morbidity. Clinically, this means that when delays are unavoidable, expander-based reconstruction remains a viable and safe temporizing option—provided that patients are informed of the higher likelihood of contracture and monitored accordingly. These data also contribute to the ongoing debate about reconstructive timing. One-stage direct-to-implant or autologous procedures may circumvent the risks of prolonged expansion, but two-stage reconstruction retains value in resource-limited or emergency contexts, where shorter operative times and scheduling flexibility are critical [ 14 15 21 36 37 38 39 The paradoxical increase in satisfaction among delayed patients underscores the importance of integrating PROs into decision-making. Surgeons must not only weigh risks and benefits but also address the psychological impact of delay, acknowledging that patient adaptation and relief strongly influence satisfaction. Transparent counseling can help align expectations and optimize outcomes, even under non-standard conditions. 4.5. Study Limitations This study has limitations. Its retrospective design precludes causal inference and may leave residual confounding despite multivariate adjustment. The significant age difference between groups represents another limitation, although age was included in regression models. Patient-reported outcomes were assessed using a custom, non-validated tool. While this lacks the psychometric rigor of validated instruments such as the BREAST-Q, it was specifically designed to capture the retrospective perception of delay, which standardized questionnaires cannot address. We did not analyze granular data on perioperative medications (NSAIDs, anticoagulants, analgesics), which may influence wound healing and complications. However, consistent institutional protocols reduce the likelihood of systematic bias. Follow-up duration was slightly longer in controls, which may have led to greater detection of late complications in that group. Despite these limitations, this study provides one of the first real-world analyses of pandemic-related reconstructive delays, integrating both clinical outcomes and patient-reported measures. These insights can inform both clinical counseling and future guidelines for breast reconstruction in extraordinary healthcare circumstances. 5. Conclusions This study demonstrates that surgical delay during the COVID-19 pandemic, with expander retention beyond the recommended six months, selectively increased the risk of capsular contracture while not significantly affecting the overall complication burden. These findings suggest that delay acts as a specific rather than generalized risk factor. Patient-reported outcomes highlighted the dual nature of this experience: greater physical limitations during expander maintenance but paradoxically higher satisfaction with the final implant, likely reflecting both improved adaptation and a “relief effect.” This underlines the importance of integrating objective outcomes with the patient perspective. From a clinical standpoint, prolonged expander retention can be considered a safe temporizing strategy in extraordinary circumstances, provided that patients are carefully counseled about the higher likelihood of contracture and closely monitored throughout follow-up. Anticipating this risk and addressing expectations transparently may help preserve satisfaction even when standard timelines cannot be respected. These results offer preliminary evidence to inform future guidelines on reconstructive timing in crisis situations. Prospective, multicenter studies incorporating validated patient-reported outcome measures are warranted to confirm these findings and refine recommendations for both routine and emergency settings. Disclaimer/Publisher’s Note: Supplementary Materials The following supporting information can be downloaded at: https://www.mdpi.com/article/10.3390/jcm14186684/s1 Author Contributions Conceptualization, F.P., E.B. and L.V.; methodology, D.R., M.A. and L.F.; software, C.T.; validation, F.P., B.C. and L.F.; formal analysis, S.M., M.A. and F.L.T.; investigation, F.P. and D.R.; resources, L.V., F.L.T. and M.M.; data curation, F.P., B.C. and C.T.; writing—original draft preparation, F.P. and M.A.; writing—review and editing, M.M., S.M. and E.B.; visualization, F.L.T.; supervision, B.C. and E.B.; project administration, D.R. and L.V. All authors have read and agreed to the published version of the manuscript. Institutional Review Board Statement Ethical review and approval were waived for this study, in accordance with Italian law (EU Regulation 2016/679, Art. 9(2)(j); Legislative Decree 101/2018, Art. 110; AIFA Circular No. 7/2008; and the guidance of the Italian Data Protection Authority), as it involved a retrospective analysis of anonymized data. Informed Consent Statement Informed consent was obtained from all subjects involved in the study. Written informed consent has been obtained from the patients to publish this paper. Data Availability Statement No data collection forms, extracted data, analytic code or other materials used in this review are publicly available, but are available from the corresponding author upon reasonable request. Conflicts of Interest The authors declare no conflicts of interest. References 1. COVIDSurg Collaborative Global guidance for surgical care during the COVID-19 pandemic Br. J. Surg. 2020 107 1097 1103 10.1002/bjs.11646 32293715 PMC7262310 2. Rusch V.W. Wexner S.D. American College of Surgeons COVID-19 Communications Committee, Board of Regents, and Officers The American College of Surgeons Responds to COVID-19 J. Am. Coll. Surg. 2020 231 490 496 10.1016/j.jamcollsurg.2020.06.020 32673759 PMC7358152 3. Bartlett D.L. Howe J.R. Chang G. Crago A. Hogg M. Karakousis G. Levine E. Maker A. Mamounas E. McGuire K. Management of Cancer Surgery Cases During the COVID-19 Pandemic: Considerations Ann. Surg. Oncol. 2020 27 1717 1720 10.1245/s10434-020-08461-2 32270420 PMC7141488 4. Uroskie T.W. Colen L.B. History of breast reconstruction Semin. Plast. Surg. 2004 18 65 69 10.1055/s-2004-829040 20574484 PMC2884724 5. Muntean M.V. Oradan A.V. Corpodean A.A. Lazar G.L. Gata V.A. Vlad C. Puscas E. Lisencu I.C. Achimas-Cadariu P.A. Immediate breast reconstruction in large ptotic breasts using the inferior based dermal Flap. Indications and Technique Chirurgia 2021 116 127 135 10.21614/chirurgia.116.2Suppl.S127 33963703 6. Xie J. Yan W. Zhu Z. Wang M. Shi J. Advances in Prepectoral Breast Reconstruction Ther. Clin. Risk Manag. 2023 19 361 368 10.2147/TCRM.S404799 37095832 PMC10122485 7. Chetta M.D. Aliu O. Zhong L. Sears E.D. Waljee J.F. Chung K.C. Momoh A.O. Reconstruction of the Irradiated Breast: A National Claims-Based Assessment of Postoperative Morbidity Plast. Reconstr. Surg. 2017 139 783 792 10.1097/PRS.0000000000003168 28002254 PMC5373960 8. Tellarini A. Bascialla E. Paganini F. Fasoli V. Buttarelli F. Marra E.P. Tamborini F. Corno M. Di Giovanna D. Baraziol R. Breast reconstruction with TiLOOP ® J. Plast. Reconstr. Aesthetic Surg. 2024 97 89 114 10.1016/j.bjps.2024.07.060 39151289 9. Paganini F. Bascialla E. Corno M. Garutti L. Tellarini A. Cozzi S. Buttarelli F. Fasoli V. Valdatta L. Tamborini F. Meshed Dermal Sling for Prepectoral Breast Reconstruction Plast. Reconstr. Surg. Glob. Open 2024 12 e5534 10.1097/GOX.0000000000005534 38235351 PMC10793973 10. Tellarini A. Garutti L. Corno M. Tamborini F. Paganini F. Fasoli V. Di Giovanna D. Valdatta L. Immediate post-mastectomy prepectoral breast reconstruction with animal derived acellular dermal matrices: A systematic review J. Plast. Reconstr. Aesthetic Surg. 2023 86 94 108 10.1016/j.bjps.2023.08.020 37716255 11. Fatima H. Abbas P. Alshehri S.M. Balancing Innovation and Patient Care in Breast Cancer: Integrating Hypofractionated Proton Therapy With Breast Reconstruction Outcomes Cureus 2024 16 e58056 10.7759/cureus.58056 38738134 PMC11088419 12. Al-Benna S. Gohritz A. Breast reconstruction during the COVID-19 pandemic in resource-limited settings GMS Interdiscip. Plast. Reconstr. Surg. DGPW 2021 10 Doc10 34595087 10.3205/iprs000160 PMC8430233 13. Ko G. Li Q. Liu N. Amir E. Covelli A. Eskander A. Freitas V. Koch C.A. Ramruthan J. Reel E. Impact of the COVID-19 pandemic on breast cancer surgeries in a Canadian population Breast Cancer Res. Treat. 2024 210 147 156 10.1007/s10549-024-07547-9 39543062 PMC11787185 14. Lo Torto F. Turriziani G. Carella S. Pagnotta A. Ribuffo D. Impact of the Prepectoral Breast Reconstruction Assessment Score on Expander-Based Reconstruction Success J. Clin. Med. 2024 13 6466 10.3390/jcm13216466 39518605 PMC11546869 15. Riggio E. Toffoli E. Tartaglione C. Marano G. Biganzoli E. Local safety of immediate reconstruction during primary treatment of breast cancer. Direct-to-implant versus expander-based surgery J. Plast. Reconstr. Aesthetic Surg. 2019 72 232 242 10.1016/j.bjps.2018.10.016 30497914 16. Cuschieri S. The STROBE guidelines Saudi J. Anaesth. 2019 13 (Suppl. S1) S31 S34 10.4103/sja.SJA_543_18 30930717 PMC6398292 17. Dindo D. Demartines N. Clavien P.A. Classification of surgical complications: A new proposal with evaluation in a cohort of 6336 patients and results of a survey Ann. Surg. 2004 240 205 213 10.1097/01.sla.0000133083.54934.ae 15273542 PMC1360123 18. Clavien P.A. Barkun J. De Oliveira M.L. Vauthey J.N. Dindo D. Schulick R.D. de Santibañes E. Pekolj J. Slankamenac K. Bassi C. The clavien-dindo classification of surgical complications: Five-year experience Ann. Surg. 2009 250 187 196 10.1097/SLA.0b013e3181b13ca2 19638912 19. Morrison K.A. Ascherman B.M. Ascherman J.A. Evolving approaches to tissue expander design and application Plast. Reconstr. Surg. 2017 140 23S 29S 10.1097/PRS.0000000000003948 29064919 20. Cordeiro P.G. Albornoz C.R. McCormick B. Hudis C.A. Hu Q. Heerdt A. Matros E. What Is the Optimum Timing of Postmastectomy Radiotherapy in Two-Stage Prosthetic Reconstruction: Radiation to the Tissue Expander or Permanent Implant? Plast. Reconstr. Surg. 2015 135 1509 1517 10.1097/PRS.0000000000001278 25742523 PMC5004350 21. Campbell A.R. Didier A.J. Sheikh T.M. Ansari S. Watkins D.E. Fahoury A.M. Nandwani S.V. Rashid M. The Effects of Radiotherapy on the Sequence and Eligibility of Breast Reconstruction: Current Evidence and Controversy Cancers 2024 16 2939 10.3390/cancers16172939 39272797 PMC11394533 22. Gunnarsson G.L. Salzberg C.A. Current status of pre- and retropectoral breast reconstructions worldwide: A narrative review Gland Surg. 2024 13 1305 1314 10.21037/gs-24-13 39175699 PMC11336793 23. Colwell A.S. Taylor E.M. Recent Advances in Implant-Based Breast Reconstruction Plast. Reconstr. Surg. 2020 145 421e 432e 10.1097/PRS.0000000000006510 31985660 24. Sinha I. Pusic A.L. Wilkins E.G. Hamill J.B. Chen X. Kim H.M. Guldbrandsen G.B. Chun Y.S. Late Surgical-Site Infection in Immediate Implant-Based Breast Reconstruction Plast. Reconstr. Surg. 2017 139 20 28 10.1097/PRS.0000000000002839 28027221 PMC5675129 25. Lam T.C. Hsieh F. Boyages J. The effects of postmastectomy adjuvant radiotherapy on immediate two-stage prosthetic breast reconstruction: A systematic review Plast. Reconstr. Surg. 2013 132 511 518 10.1097/PRS.0b013e31829acc41 23676964 26. Spear S.L. Murphy D.K. Slicton A. Walker P.S. Inamed silicone breast implant core study results at 6 years Plast. Reconstr. Surg. 2007 120 8S 16S 10.1097/01.prs.0000286580.93214.df 18090808 27. Johnson A.C. Colakoglu S. Reddy A. Kerwin C.M. Flores R.A. Iorio M.L. Mathes D.W. Perioperative blocks for decreasing postoperative narcotics in breast reconstruction Anesth. Pain. Med. 2020 10 e105686 10.5812/aapm.105686 34150564 PMC8207839 28. Negrescu A.M. Nistorescu S. Bonciu A.F. Rusen L. Dumitrescu L.N. Urzica I. Cimpean A. Dinca V. Macrophage Immunomodulation and Suppression of Bacterial Growth by Polydimethylsiloxane Surface-Interrupted Microlines’ Topography Targeting Breast Implant Applications Polymers 2024 16 3046 10.3390/polym16213046 39518255 PMC11548769 29. Bryan J.L. Ockerman K.M. Spiguel L.R. Cox E.A. Han S.H. Trieu N. Fernandez M.B. Heath F. Sorice-Virk S. Postoperative Complications of Direct-to-Implant and Two-Staged Breast Reconstruction: A Stratified Analysis Plast. Surg. 2024 33 574 581 10.1177/22925503241276541 39553524 PMC11562245 30. Min K. Min J.C. Han H.H. Kim E.K. Eom J.S. Comparing outcomes of prepectoral, partial muscle-splitting subpectoral, and dual-plane subpectoral direct-to-implant reconstruction: Implant upward migration and the pectoralis muscle Gland Surg. 2024 13 852 863 10.21037/gs-24-45 39015706 PMC11247577 31. Spear S.L. Schwartz J. Dayan J.H. Clemens M.W. Outcome assessment of breast distortion following submuscular breast augmentation Aesthetic Plast. Surg. 2009 33 44 48 10.1007/s00266-008-9275-y 19052809 32. Ballance L. Wilson R.L. Kirwan C.C. Boundouki G. Taxiarchi V.P. Baker B.G. Rusius V. Rowland M. Henderson J.R. Marikakis N. Return to Activities of Daily Living after Breast Cancer Surgery: An Observational Prospective Questionnaire-Based Study of Patients Undergoing Mastectomy with or without Immediate Reconstruction Breast J. 2023 2023 9345780 10.1155/2023/9345780 37771428 PMC10533274 33. Shiraishi M. Sowa Y. Inafuku N. Sunaga A. Yoshimura K. Okazaki M. Chronic Pain Following Breast Reconstruction Ann. Plast. Surg. 2024 93 261 267 10.1097/SAP.0000000000003986 38980915 34. De Groef A. Van Kampen M. Verlvoesem N. Dieltjens E. Vos L. De Vrieze T. Christiaens M.-R. Neven P. Geraerts I. Devoogdt N. Effect of myofascial techniques for treatment of upper limb dysfunctions in breast cancer survivors: Randomized controlled trial Support. Care Cancer 2017 25 2119 2127 10.1007/s00520-017-3616-9 28197849 35. Safran T. Nepon H. Chu C.K. Winocour S. Murphy A.M. Davison P.G. Dionisopolos T. Vorstenbosch J. Current Concepts in Capsular Contracture: Pathophysiology, Prevention, and Management Semin. Plast. Surg. 2021 35 189 197 10.1055/s-0041-1731793 34526867 PMC8432999 36. Hvilsom G.B. Hölmich L.R. Henriksen T.F. Lipworth L. McLaughlin J.K. Friis S. Local complications after cosmetic breast augmentation: Results from the Danish Registry for Plastic Surgery of the breast Plast. Reconstr. Surg. 2009 124 919 925 10.1097/PRS.0b013e3181b0389e 19730312 37. Calobrace M.B. Stevens W.G. Capizzi P.J. Cohen R. Godinez T. Beckstrand M. Risk factor analysis for capsular contracture: A 10-year sientra study using round, smooth, and textured implants for breast augmentation Plast. Reconstr. Surg. 2018 141 20S 28S 10.1097/PRS.0000000000004351 29595715 38. Cordeiro P.G. Albornoz C.R. McCormick B. Hu Q. Van Zee K. The impact of postmastectomy radiotherapy on two-stage implant breast reconstruction: An analysis of long-term surgical outcomes, aesthetic results, and satisfaction over 13 years Plast. Reconstr. Surg. 2014 134 588 595 10.1097/PRS.0000000000000523 25357021 39. Ho A.L. Bovill E.S. Macadam S.A. Tyldesley S. Giang J. Lennox P.A. Postmastectomy Radiation Therapy after Immediate Two-Stage Tissue Expander/Implant Breast Reconstruction Plast. Reconstr. Surg. 2014 134 1e 10e 10.1097/PRS.0000000000000292 25028850 40. Fujii T. Yajima R. Kuwano H. Implications of Long-term Indwelling of Tissue Expander in Breast Reconstruction: Risk of Expander Rupturing Anticancer Res. 2016 36 4337 4340 27466553 41. Vinsensia M. Schaub R. Meixner E. Hoegen P. Arians N. Forster T. Hoeltgen L. Köhler C. Uzun-Lang K. Batista V. Incidence and Risk Assessment of Capsular Contracture in Breast Cancer Patients following Post-Mastectomy Radiotherapy and Implant-Based Reconstruction Cancers 2024 16 265 10.3390/cancers16020265 38254756 PMC10813520 42. Overgaard M. Hansen P.S. Overgaard J. Rose C. Andersson M. Bach F. Kjaer M. Gadeberg C.C. Mouridsen H.T. Jensen M.B. Postoperative radiotherapy in high-risk premenopausal women with breast cancer who receive adjuvant chemotherapy. Danish Breast Cancer Cooperative Group 82b Trial N. Engl. J. Med. 1997 337 949 955 10.1056/NEJM199710023371401 9395428 43. Mericli A.F. Sharabi S.E. Breast Implants and Radiation Semin. Plast. Surg. 2019 33 240 246 10.1055/s-0039-1696963 31632207 PMC6797492 Figure 1 Contracture on definitive prosthesis (Data presented as percentages. Y-axis scaled to data range for readability). Figure 2 Cases questionnaire answers (Data presented as percentages. Y-axis scaled to data range for readability). Figure 3 Controls questionnaire answers (Data presented as percentages. Y-axis scaled to data range for readability). jcm-14-06684-t001_Table 1 Table 1 Cancer treatment analysis.  Group 1 (Cases) Group 2 (Controls) Pre-mastectomy oncological treatment   Neo-adiuvant chemotherapy 16% (24) 19% (41) Radiotherapy 3% (5) 6% (13) Mastectomy type   Modified radical 62% (91) 64% (140) Skin-sparing 5% (7) 4% (8) Nipple-sparing 33% (48) 32% (69) Nodes treatment   Sentinel node biopsy 78% (115) 67% (147) Axillary dissection 21% (31) 32% (70) Post-mastectomy oncological treatment   Adiuvant chemotherapy 24% (35) 32% (71) Radiotherapy on breast expander 3% (5) 2% (4) jcm-14-06684-t002_Table 2 Table 2 Reconstruction analysis.  Group 1 (Cases) Group 2 (Controls) p Plane of breast expander positioning    Retro-pectoral 98% (144) 95% (208) N.A. Retro-pectoral with ADM 1% (2) 4% (9) N.A. Breast expander volume    250 cc 1% (1) 1% (2) N.A. 275 cc 1% (2) 3% (7) N.A. 350 cc 14% (21) 18% (39) N.A. 450 cc 33% (48) 29% (63) N.A. 550 cc 39% (57) 29% (64) N.A. 650 cc 12% (17) 19% (42) N.A. Breast expander type    LH 3% (4) 3% (7) N.A. MH 97% (142) 96% (210) N.A. TH 0% (0) 0.5% (1) N.A. Mean hospital stay without complications (days) 5 5 0.2502 Mean total number of drains 1 1 1 Mean time active drains keeping (days) 14 21 0.0146 * Mean time from surgery to first expansion (days) 22 25 0.0802 Mean expansion time without complications (days) 98 66 0.0012 * Final expansion volume    Under size 37% (54) 33% (72) N.A. Right size 38% (56) 38% (84) N.A. Over size 23% (34) 24% (53) N.A. Mean time to second stage procedure (days) 481 280 <0.00001 * Mean follow-up after second stage procedure (months) 28 33 0.0129 Legend: ADM—Acellular Dermal Matrix; N.A.—not applicable; *—statistical significant at t ",
  "metadata": {
    "Title of this paper": "Breast Implants and Radiation",
    "Journal it was published in:": "Journal of Clinical Medicine",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12470722/"
  }
}