{
  "title": "Paper_1204",
  "abstract": "pmc Cancers (Basel) Cancers (Basel) 2105 cancers cancers Cancers 2072-6694 Multidisciplinary Digital Publishing Institute  (MDPI) PMC12468927 PMC12468927.1 12468927 12468927 41008798 10.3390/cancers17182953 cancers-17-02953 1 Systematic Review Epigenetic Reprogramming by Decitabine in Triple-Negative Breast Cancer: Mechanisms, Immune Modulation, and Therapeutic Synergy Riyas Mohamed Fathima Raahima 1 https://orcid.org/0009-0009-6946-0519 Aldubaisi Safiah 1 Akbar Arshiya 1 Khan Mohammad Imran 2 https://orcid.org/0000-0001-7536-910X Yaqinuddin Ahmed 1 * Sharma Anup R. Academic Editor Sailo Bethsebie Academic Editor 1 frmohamed@alfaisal.edu saldubaisi@alfaisal.edu arshiyaakbar2019@gmail.com 2 mikhan@kfshrc.edu.sa * ayaqinuddin@alfaisal.edu 09 9 2025 9 2025 17 18 497140 2953 01 8 2025 04 9 2025 05 9 2025 09 09 2025 27 09 2025 29 09 2025 © 2025 by the authors. 2025 https://creativecommons.org/licenses/by/4.0/ Licensee MDPI, Basel, Switzerland. This article is an open access article distributed under the terms and conditions of the Creative Commons Attribution (CC BY) license ( https://creativecommons.org/licenses/by/4.0/ Simple Summary Decitabine, a DNA methyltransferase inhibitor, shows potential in treating triple-negative breast cancer (TNBC) by reactivating tumor suppressor genes and enhancing immune responses. Preclinical studies demonstrate its ability to reduce tumor growth, induce apoptosis, and improve sensitivity to chemotherapy, immunotherapy, and hormonal agents. Notably, combination therapies such as decitabine with anti-PD-1, HDAC inhibitors, or paclitaxel converting immune “cold” tumors into “hot” ones, improves outcomes. Resistance may arise from persistent DNMT expression, low DCK activity, and miRNA-regulated stemness pathways, suggesting a need for biomarker-based patient selection. A Phase II trial combining decitabine with pembrolizumab achieved a 40.7% pathologic complete response in early stage TNBC, supporting its promise in combinatorial regimens. Abstract Background/Objectives Methods Results BRCA1 CDH1 Conclusions triple-negative breast cancer TNBC decitabine DNA methyltransferase inhibitor 5-aza-2′-deoxycytidine DNMTi Alfaisal University for Internal Research IRG# 24333 The authors also want to extend appreciation to Alfaisal University for Internal Research Grant IRG# 24333 awarded to Ahmed Yaqinuddin. pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement yes pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes 1. Introduction Triple-negative breast cancer (TNBC) is a clinically and molecularly distinct subtype of breast cancer defined by the absence of estrogen receptor (ER), progesterone receptor (PR), and human epidermal growth factor receptor 2 (HER2) expression [ 1 2 3 4 5 6 7 8 9 10 11 12 13 14 13 14 One of the most pressing challenges in TNBC management is its heterogeneity and lack of effective targeted therapies [ 15 16 17 18 19 20 21 22 23 24 25 In recent years, attention has turned toward epigenetic dysregulation as a critical driver of TNBC tumorigenesis and progression [ 26 27 28 29 30 31 32 33 34 35 36 37 Decitabine (5-aza-2′-deoxycytidine) is a cytosine analog and DNA methyltransferase inhibitor (DNMTi) approved for the treatment of hematological malignancies such as myelodysplastic syndromes (MDS) and acute myeloid leukemia (AML) [ 38 39 40 41 39 40 42 43 44 Preclinical studies in TNBC models have demonstrated that decitabine can reverse key features of the malignant phenotype, including stemness, mesenchymal traits, and chemoresistance while restoring immune visibility and sensitizing tumors to immune checkpoint inhibitors and cytotoxic agents [ 26 45 46 47 48 49 50 51 52 Given TNBC’s poor prognosis, resistance to conventional therapies, and clear evidence of epigenetic disruption, a systematic appraisal of decitabine’s role in this context is both timely and necessary. Although promising data exist, the landscape remains fragmented, with varied dosing schedules, biomarkers, and outcome measures reported across studies. To date, no comprehensive review has integrated the mechanistic, preclinical, and clinical evidence supporting the use of decitabine in TNBC. This systematic review therefore aims to synthesize and critically analyze the current body of preclinical and clinical literature evaluating decitabine in TNBC. Specifically, we explore the following: The mechanistic rationale for its use based on epigenetic alterations in TNBC; Evidence of its efficacy and synergistic potential in preclinical models; Clinical outcomes, safety profiles, and combinatorial strategies being tested; Existing challenges and gaps in translating epigenetic therapy into clinical benefit; By consolidating this knowledge, we aim to inform future translational research and clinical trial design, with the goal of expanding therapeutic options for patients with this formidable breast cancer subtype. 2. Materials and Methods This systematic review adheres to the PRISMA-2020 (Preferred Reporting Items for Systematic Reviews and Meta-Analyses) [ 53 54 Tables S1 and S2 Table 1 55 2.1. Literature Search The search spanned multiple major databases—PubMed, EBSCO, Web of Science, and Semantic Scholar. To ensure retrieval accuracy, the search strategy included a combination of keywords and Medical Subject Headings (MeSH) terms, utilizing terms such as (Decitabine OR Azacitidine OR DNMT inhibitor OR 5-aza-2′-deoxycytidine OR DNA hypomethylating agents) AND (TNBC OR Triple-negative breast cancer). Boolean operators (AND/OR) were applied to structure the syntax effectively, targeting studies specifically on the role of decitabine in the treatment of TNBC. This search was conducted across titles, abstracts, and keywords and concluded on 26 April 2025. All citations were imported into Rayyan software (version 1.5.3) for subsequent processing, including duplicate removal and initial screening [ 56 2.2. Inclusion and Exclusion Criteria The inclusion criteria for this systematic review were defined to comprehensively capture studies that directly investigate the therapeutic role of decitabine in triple-negative breast cancer (TNBC) across both clinical and preclinical contexts. Eligible studies were those involving human participants diagnosed with TNBC or employing preclinical models such as in vitro TNBC cell lines (such as MDA-MB-231, HCC1937, and BT-549) or in vivo animal models (such as murine xenografts or syngeneic mouse models) derived from TNBC tumors. The intervention of interest was the administration of decitabine, whether as a single agent or in combination with other therapies, such as chemotherapeutics, immune checkpoint inhibitors, or PARP inhibitors. For comparison, studies were included if they had a control group receiving either standard-of-care treatments (such as anthracyclines or taxanes), immunotherapy, or placebo/vehicle controls. Eligible studies had to report on at least one relevant outcome related to tumor response, such as overall response rate (ORR), progression-free survival (PFS), overall survival (OS), disease-free survival (DFS), or biomarker responses, particularly those reflecting epigenetic modulation (like DNA methylation levels and DNMT1 expression) or immune alterations (like T-cell infiltration and cytokine profiles). Studies were also included if they addressed safety profiles and treatment-related adverse events, given the known hematologic toxicity of DNMT inhibitors. Finally, the review accepted a broad range of study designs, including randomized controlled trials (RCTs), non-randomized clinical trials, cohort studies, and preclinical in vivo and in vitro experimental studies, to ensure a robust synthesis of evidence across different stages of translational research. Studies were excluded if they did not specifically focus on triple-negative breast cancer (TNBC), for instance, those investigating hormone receptor-positive or HER2-positive breast cancer subtypes were omitted due to their differing biology and treatment responses. Additionally, studies in which decitabine was not the primary therapeutic intervention or where it was only mentioned peripherally were excluded to maintain a clear focus on the agent of interest. The review also excluded non-original research such as review articles, editorials, opinion pieces, conference abstracts, case reports, and letters, as these do not provide primary data suitable for extraction or quantitative synthesis. Furthermore, studies were excluded if they lacked full-text availability, were not published in English, or failed to report relevant outcome data, such as therapeutic response rates, survival outcomes, molecular or immune biomarkers, or evidence of epigenetic modulation. These exclusions were necessary to uphold the scientific quality and interpretability of the final body of evidence. 2.3. Literature Screening The initial screening process was systematic, beginning with title screening followed by abstract screening. Each article’s title and abstract were carefully evaluated against predefined inclusion and exclusion criteria. After this initial stage, a second round of evaluation involved a detailed assessment of the full-text articles. This stage was critical for refining the selection based on the same criteria, with particular emphasis on each study’s rigor and relevance to the research objectives. Full-text articles were meticulously reviewed to ensure they not only addressed the role of decitabine in the treatment of triple-negative breast cancers, but also provided adequate scientific detail on the immune responses, anti-tumor immunity, and epigenetic modulations under investigation. Discrepancies in study inclusion were resolved through consensus discussion between reviewers. This rigorous three-step screening process ensured that the final selection of studies would form a robust and relevant dataset for understanding the treatment of TNBC using decitabine. 2.4. Data Extraction Data were extracted from each included study using a structured Microsoft Excel form to ensure a thorough capture of essential information. The form collected study identification details, such as the first author, publication year, study title, and study design. Other characteristics were also documented, including type of cell line or animal model used, source of cells or tumors, and total sample size. Intervention-specific variables were recorded, detailing the type of intervention, treatment duration, dosage (mg/m 2 2.5. Risk of Bias Assessment To ensure a rigorous and transparent assessment of methodological quality and risk of bias across the diverse range of study designs included in this systematic review, two validated tools were employed based on the nature of the study. For observational studies, the Quality in Prognosis Studies (QUIPS) tool was used, which is specifically designed to assess the risk of bias in studies investigating prognostic factors or associations in non-randomized settings. The QUIPS tool evaluates six key domains: study participation, assessing whether the study population is representative of the target population; study attrition, examining the completeness of follow-up and reasons for loss to follow-up; prognostic factor measurement, ensuring accurate and consistent assessment of variables such as biomarker expression or molecular response; outcome measurement, focusing on the reliability and objectivity of endpoints like overall survival or progression-free survival; study confounding, which assesses whether potential confounding variables were adequately identified and adjusted for; and statistical analysis and reporting, evaluating the appropriateness and transparency of statistical methods used. Each domain was rated as having a low (***), moderate (**), or high risk of bias (*), and a summary judgment was made for each study [ 57 For randomized controlled trials (RCTs) included in the review, risk of bias was assessed using the Cochrane Risk of Bias 2.0 (RoB 2) tool, the gold standard for evaluating the internal validity of clinical trials. The RoB 2 tool assesses five specific domains: bias arising from the randomization process, which examines sequence generation and allocation concealment; bias due to deviations from intended interventions, assessing whether patients remained adherent to their assigned groups and whether analyses were conducted according to the intention-to-treat principle; bias due to missing outcome data, evaluating the extent of loss to follow-up and whether it could bias the results; bias in measurement of the outcome, focusing on whether outcome assessors were blinded and whether outcome definitions were applied consistently; and bias in the selection of the reported result, determining whether pre-specified outcomes were selectively reported. Each domain was judged as “low risk,” “some concerns,” or “high risk” of bias, and an overall risk of bias was assigned to each trial [ 58 All studies were independently assessed by two reviewers with expertise in systematic review methodology. Discrepancies in scoring were resolved through detailed discussion and consensus. This multi-tiered, domain-specific approach to risk of bias evaluation ensured that both clinical and observational evidence were scrutinized with appropriate methodological tools, enhancing the reliability and validity of the review’s conclusions. 3. Results 3.1. Study Selection The initial screening of identified studies began with a comprehensive review of their titles and abstracts to assess relevance based on the predefined PICOS criteria established for this systematic review. This multi-database search yielded a total of 896 records, which were systematically imported into Rayyan software to facilitate an organized and efficient screening process. Upon import, Rayyan identified and removed 30 duplicate entries, leaving 866 unique records available for evaluation. The first phase of the screening process involved a meticulous examination of the titles and abstracts against the inclusion and exclusion criteria. Title screening resulted in the exclusion of 770 records that were either irrelevant to TNBC research or lacked focus on treatment with Decitabine. Subsequently, 96 abstracts were selected for further eligibility assessment. During this secondary phase, each article underwent a detailed evaluation to ensure adherence to the inclusion criteria. A total of 74 full-texts were assessed for eligibility, out of which 47 studies were excluded for various reasons: two studies had no access to their full texts, 18 studies had insufficient data on TNBC and decitabine, 26 studies did not specifically focus on TNBC, one terminated the clinical trial, and two studies had the wrong study design. Exclusions were clearly documented to maintain transparency in the selection process. Finally, 25 studies were deemed eligible and included in the qualitative synthesis. These studies spanned various experimental designs, including preclinical models and mechanistic investigations, to provide a comprehensive analysis of the role of decitabine in the treatment of TNBC. This rigorous multi-stage review process, in line with PRISMA guidelines, underscored a systematic approach to identifying high-quality evidence pertinent to the review objectives, as depicted in Figure 1 3.2. Risk of Bias Assessment The risk of bias in the preclinical studies was conducted using the QUIPS risk of bias assessment tool (refer to Table S3 57 Figure 2 Figure 3 45 47 59 60 61 62 63 64 65 66 67 68 69 70 71 72 65 73 74 75 76 77 78 45 47 59 79 80 The risk of bias in the clinical trial conducted by Bear et al., 2025 [ 52 Table S4 58 Figure 4 52 3.3. Study Characteristics The 25 included studies focused on triple-negative breast cancer (TNBC) models, evaluating the role of decitabine (DAC) as a hypomethylating agent either as monotherapy or in combination with immunotherapy, chemotherapy, or epigenetic modulators. Experimental platforms were diverse: human TNBC cell lines (such as MDA-MB-231, BT-549, Hs578T) for mechanistic exploration, syngeneic mouse models (such as 4T1, 66cl4) for immunological profiling, and PDX systems to evaluate therapeutic durability and biomarker stratification. A small subset of studies also examined non-TNBC subtypes for comparative epigenetic analyses. Geographic representation was broad, with studies conducted across the United States, China, Finland, Egypt, Canada, Taiwan, and Italy, reflecting the global interest in epigenetic therapy for breast cancer. Refer to Table S5 3.4. Anti-Tumor Efficacy of Decitabine Decitabine (DAC), as a DNA hypomethylating agent, demonstrated consistent anti-tumor efficacy across a wide range of triple-negative breast cancer (TNBC) models, including in vitro cell lines, xenograft models, syngeneic murine models, and patient-derived xenografts (PDXs). 3.4.1. In Vitro Evidence of Cytotoxicity and Clonogenic Suppression In vitro studies consistently demonstrated that decitabine (DAC) exerts potent antiproliferative effects on TNBC cell lines through dose- and time-dependent reductions in cell viability, colony formation, and proliferation (summarized in Table 2 47 62 63 3.4.2. Tumor Volume Reduction in Murine Models Studies utilizing in vivo murine models, including both xenografts and syngeneic systems, consistently demonstrated tumor growth suppression with decitabine (DAC), often in combination with other agents (refer to Table 3 59 73 73 65 65 76 3.4.3. Patient-Derived Xenograft (PDX) Models and Clinical Translation Patient-derived xenograft (PDX) models offer high translational relevance due to their ability to retain the histopathological, molecular, and therapeutic response profiles of original patient tumors. Yu et al., 2018 developed 15 distinct TNBC PDX models from pre- and post-chemotherapy clinical specimens [ 45 45 In a multicenter Phase II trial, Bear et al., 2025 evaluated DAC (15 mg/m 2 52 Stromal TILs (sTILs): increased by 6.1% ( p PD-L1 H-score: increased by 51.1% ( p Monocytic MDSCs: decreased by 59% in blood ( p These changes were linked to increased immune infiltration and improved immune priming. The pathologic complete response (pCR) rate among TNBC patients was 40.7% (11/27), with only two recurrences at one year. Histologically, some post-treatment biopsies demonstrated lymphocyte-predominant breast cancer (LPBC) features, suggesting a shift from “cold” to “hot” immune phenotypes induced by epigenetic priming [ 52 3.5. Immune Landscape Modulation 3.5.1. Antigen Presentation and T-Cell Recruitment Decitabine (DAC) enhances tumor immunogenicity by upregulating antigen presentation machinery and modulating T-cell infiltration and phenotype. This effect is primarily mediated through epigenetic reprogramming of key immune regulatory pathways ( Table 4 59 + + + + 59 Wu et al., 2021 extended this concept in MYC-driven TNBC models (4T1 and 66cl4), where overexpression of MYC was shown to suppress STING (Stimulator of Interferon Genes) expression via DNMT1-mediated promoter hypermethylation [ 73 + + 73 3.5.2. Combination with Immune Checkpoint Inhibitors One of the most clinically impactful applications of decitabine (DAC) in triple-negative breast cancer (TNBC) involves its ability to enhance the efficacy of immune checkpoint inhibitors (ICIs), particularly anti-PD-1 therapies ( Table 5 + + 73 73 p p 52 52 3.6. Epigenetic Reactivation and Molecular Pathways 3.6.1. Tumor Suppressor Reactivation Decitabine (DAC) reactivates transcriptionally silenced tumor suppressor genes in TNBC through both direct DNA demethylation and indirect epigenetic remodeling ( Table 6 47 47 Yu et al., 2018 provided further mechanistic insight by showing that DAC promotes post-transcriptional degradation of DNMT1, DNMT3A, and DNMT3B proteins in both PDX tumors and patient-derived organoids, without significantly reducing DNMT mRNA levels [ 45 45 In the study by Vernier et al., 2020, DAC was used in combination with C29, an ERRα inhibitor, in MDA-MB-231 xenografts [ 71 71 3.6.2. Post-Transcriptional Regulation In addition to DNA methylation, DAC also affects post-transcriptional gene regulation, especially via non-coding RNAs. Chu et al., 2023 demonstrated that DAC treatment restored expression of miR-708, a tumor-suppressive microRNA commonly silenced in TNBC due to promoter hypermethylation [ 60 60 Yang et al., 2020 identified a second epigenetically regulated microRNA—miR-155—as a modulator of DAC resistance in TNBC stem-like cells (CD24 − + 61 61 3.7. Other Combination Strategies to Enhance Therapeutic Efficacy 3.7.1. Hormonal Therapies Though TNBC is typically defined by a lack of hormone receptor expression, epigenetic silencing of ERα and ERβ contributes to this phenotype. Salahuddin et al., 2022 tested whether DAC could re-sensitize MDA-MB-231 TNBC cells to hormonal signaling through epigenetic reactivation [ 74 74 3.7.2. Chemotherapy Several studies have highlighted the synergistic effects of decitabine in combination with chemotherapeutic agents in TNBC, enhancing efficacy and potentially reducing required chemotherapy doses. Yu et al., 2018 investigated the capacity of decitabine to overcome chemoresistance using a panel of 15 patient-derived xenograft (PDX)-derived organoid models [ 45 45 69 65 68 68 3.8. Mechanisms of Resistance to Decitabine Resistance to decitabine in TNBC involves a combination of epigenetic, post-translational, pharmacologic, and non-coding RNA-mediated mechanisms, which collectively impair its ability to induce tumor suppressor reactivation and immune remodeling. A prominent resistance mechanism identified by Yu et al., 2018 is the failure to degrade DNMT1, DNMT3A, and DNMT3B proteins following DAC treatment [ 45 45 A second key resistance mechanism involves deficient activation of decitabine via reduced expression of deoxycytidine kinase (DCK), the enzyme responsible for converting DAC into its active triphosphate form. Dahn et al., 2020 showed that TNBC xenografts with low DCK expression exhibit poor responses to DAC due to inadequate intracellular drug activation [ 47 47 Third, post-transcriptional mechanisms mediated by microRNAs also drive DAC resistance, particularly in cancer stem cell-enriched TNBC subpopulations. Yang et al., 2020 identified miR-155 as a critical regulator of DAC resistance in CD44 + − 61 61 Importantly, several non-contributory factors were also identified, helping to refine predictive biomarkers. Dahn et al., 2020 reports that resistance was not associated with ABCB1 overexpression (a transporter linked to taxane resistance), nor with global DNA methylation patterns, nor with suppression of viral mimicry genes such as RIG-I or MDA5. For example, knockdown of MDA5 or RIG-I had no effect on DAC sensitivity, indicating that ERV-driven immune signaling is not required for DAC response in vitro [ 47 Finally, resistance may also stem from the absence of gene silencing at key pro-apoptotic loci, as described by Nakajima et al., 2022 [ 66 66 3.9. Safety and Tolerability Across various in vivo and in vitro experimental models including murine 4T1 models, xenografts, and patient-derived xenografts (PDXs), low-dose decitabine consistently induced epigenetic reprogramming with minimal toxicity. In murine studies, including those by Russo et al., 2024 and Chu et al., 2023, no significant adverse effects were observed during decitabine monotherapy or when used in combination with immunomodulatory agents like PeptiCRAd or dexamethasone [ 59 60 59 60 In a human phase II clinical trial by Bear et al., 2025, decitabine administered in combination with pembrolizumab was also well tolerated in TNBC patients [ 52 52 Overall, decitabine appears to be a safe and tolerable epigenetic agent in TNBC models, with minimal systemic toxicity at effective doses [ 68 69 3.10. Histological and Phenotypical Changes Decitabine induces distinct histologic remodeling within TNBC tumors, both in preclinical models and clinical settings. In murine studies, such as Russo et al., 2024, combination therapy with decitabine and PeptiCRAd resulted in notable spatial reorganization of intratumoral CD8 + 59 59 52 45 On a phenotypic level, decitabine consistently reprograms TNBC cells toward increased immunogenicity and reduced malignancy. Wu et al., 2021 demonstrated that decitabine restores STING pathway activity in MYC-overexpressing tumors by inhibiting DNMT1-mediated promoter methylation, leading to upregulation of IFNβ, MHC-I, and chemokines that promote CD8 + 73 47 74 62 4. Discussion 4.1. Summary and Interpretation of Findings This systematic review evaluated 25 studies exploring the role of decitabine (DAC) in triple-negative breast cancer (TNBC), integrating data from in vitro experiments, in vivo murine models, patient-derived xenografts (PDXs), and one early-phase clinical trials. Collectively, these studies reveal a consistent and multifaceted anti-tumor effect of DAC, mediated through both direct cytotoxicity and indirect modulation of the tumor immune and epigenetic landscape. In vitro, DAC was shown to inhibit proliferation, reduce clonogenic potential, and induce apoptosis in a variety of TNBC cell lines. This was often accompanied by re-expression of silenced tumor suppressor genes such as BRCA1 CDH1 RUNX3 ISG15 OASL 46 62 63 74 In murine models, DAC treatment significantly reduced tumor volume and delayed progression, with enhanced effects observed in combination with immune modulators such as PeptiCRAd or checkpoint inhibitors like anti-PD-1 [ 47 59 65 68 + + + 59 Translational studies in PDX models, such as those by Yu et al., 2018, further demonstrated the heterogeneity of DAC response across patient-derived tumors [ 45 45 Clinically, Bear et al., 2025 evaluated DAC as a neoadjuvant priming agent in combination with pembrolizumab in early-stage TNBC patients [ 52 52 A deeper mechanistic understanding of how DAC modulates epigenetic programs in TNBC is essential for optimizing its therapeutic integration. DAC-induced hypomethylation not only reactivates silenced tumor suppressor genes but also intersects with critical signaling pathways that drive TNBC heterogeneity [ 62 66 69 71 73 81 4.2. Context Within Current Literature These findings are consistent with the growing body of literature that positions DNA methyltransferase inhibitors (DNMTis) as immunomodulatory agents capable of reversing immune evasion and epigenetic silencing in solid tumors. Previous studies in non-small cell lung cancer [ 82 83 84 73 Another emerging concept is the induction of viral mimicry by hypomethylating agents [ 85 86 87 88 87 Although the safety profile of DAC is relatively well established, placing it in a comparative framework provides added clinical perspective. Azacitidine, another hypomethylating agent, acts through similar epigenetic mechanisms but differs in pharmacokinetics, tolerability, and clinical performance, particularly in solid tumors, raising important considerations regarding agent selection [ 89 65 73 Additionally, DAC’s ability to sensitize tumors to chemotherapy and hormonal agents aligns with earlier findings in hematologic malignancies and estrogen receptor–silenced breast cancers [ 90 91 ERβ 74 4.3. Preclinical and Translational Insights on Resistance The emergence of resistance remains a consistent theme across DAC-related research [ 92 61 93 94 Preclinical studies have identified multiple mechanisms, including epigenetic silencing of pro-apoptotic genes ( NOXA 66 62 69 71 73 62 63 65 Translational models reveal additional complexities. Resistance phenotypes often correlate with failure to degrade DNMT proteins due to alterations in ubiquitination pathways (such as TRAF6 knockout) or impaired DAC activation from low deoxycytidine kinase (DCK) expression [ 47 61 Interestingly, parallels exist between resistance mechanisms observed in TNBC and those described in hematologic malignancies such as myelodysplastic syndromes and acute myeloid leukemia, where reduced DCK activity and aberrant epigenetic regulator splicing contribute to DNMTi resistance [ 95 96 4.4. Clinical Implications and Future Research Directions The translational and clinical findings summarized in this review support a compelling role for decitabine as a priming agent in TNBC, particularly in combination with immune checkpoint inhibitors. DAC’s favorable safety profile, marked by minimal myelosuppression and manageable immune-related adverse events, makes it an attractive candidate for inclusion in neoadjuvant or perioperative regimens [ 97 74 Given the heterogeneity of DAC response in TNBC, successful clinical translation will require the development and validation of predictive biomarkers to enable patient stratification [ 98 Several clinical trials have explored the role of DAC and related DNMT inhibitors in TNBC, though not all have reached completion. The DETECT trial ( NCT03295552 50 NCT05673200 99 NCT04134884 100 In parallel, mechanistic studies should further elucidate the downstream consequences of DAC-induced transcriptional reprogramming, particularly its effects on tumor plasticity, epithelial–mesenchymal transition (EMT), and immune evasion in stem-like tumor subpopulations. Rational combination strategies must also be refined through trials evaluating DAC with immunotherapies, chemotherapies, hormonal agents, and other epigenetic modulators. This includes optimizing dosing schedules (such as pulsed vs. continuous), treatment sequencing (such as priming vs. concurrent), and maintenance regimens. Finally, immune profiling and spatial transcriptomic techniques such as single-cell RNA sequencing and multiplex immunohistochemistry should be leveraged to dissect how DAC reshapes the tumor-immune microenvironment at both cellular and spatial resolutions. Future trials would benefit from embedding these approaches into adaptive frameworks to better match patients to effective regimens, minimize exposure to ineffective treatments, and enhance overall trial feasibility. 4.5. Limitations This systematic review has several limitations. First, the dominance of preclinical data (24 out of 25 studies) limits the immediate generalizability of findings to human populations. Second, methodological heterogeneity across studies, in terms of DAC dosing, treatment duration, and outcome measurement, which limits direct comparison and precludes meta-analysis. Third, long-term efficacy and recurrence data were inconsistently reported, particularly in in vivo models. Additionally, many mechanistic insights are based on a small number of models or cell lines, raising concerns about generalizability across the diverse spectrum of TNBC subtypes. The inclusion of only English-language publications minimizes interpretive errors, it may introduce publication bias by excluding relevant non-English data. Early-phase studies have demonstrated biologic activity, including evidence of demethylation and immune activation, yet results have been tempered by challenges in patient selection, optimal dosing schedules, and the narrow therapeutic window imposed by myelosuppression. Moreover, sequential or metronomic dosing strategies are being explored to balance efficacy with tolerability [ 101 5. Conclusions Decitabine exerts multifaceted anti-tumor effects in triple-negative breast cancer through epigenetic reprogramming, immune activation, and restoration of tumor suppressor function presented here as Graphical Abstract. Preclinical and early clinical data support its role as a safe and effective adjunct to immunotherapy, chemotherapy, and hormonal agents. Its favorable safety profile and ability to prime tumors into immunologically responsive states further highlight its translational potential in neoadjuvant or perioperative settings. However, resistance mechanisms and patient heterogeneity present ongoing challenges to its broad implementation. To fully realize the therapeutic potential of DAC in TNBC, future research must prioritize biomarker-driven [ 73 Acknowledgments During the preparation of this manuscript, the authors used robvis tool ( https://mcguinlu.shinyapps.io/robvis/ Disclaimer/Publisher’s Note: Supplementary Materials The following supporting information can be downloaded at https://www.mdpi.com/article/10.3390/cancers17182953/s1 Author Contributions Conceptualization, M.I.K. and A.Y.; methodology, F.R.R.M. and A.Y.; software, F.R.R.M.; validation, F.R.R.M., S.A., A.A., M.I.K. and A.Y.; data interpretation, F.R.R.M., S.A., A.A., M.I.K. and A.Y.; resources, F.R.R.M. and A.Y.; data curation, F.R.R.M., S.A. and A.A.; writing—original draft preparation, F.R.R.M., S.A., A.A., M.I.K. and A.Y.; writing—review and editing, M.I.K. and A.Y.; visualization, F.R.R.M.; supervision, A.Y.; project administration, A.Y.; funding acquisition, A.Y. All authors have read and agreed to the published version of the manuscript. Institutional Review Board Statement Not applicable. Informed Consent Statement Not applicable. Data Availability Statement The datasets analyzed during this study are publicly available in PubMed, EBSCO, Web of Science, and Semantic Scholar up to 26 April 2025. The search strategy included the following keywords and Boolean operators: (“Decitabine” OR “Azacitidine” OR “DNMT inhibitor” OR “5-aza-2′-deoxycytidine” OR “DNA hypomethylating agents”) AND (“TNBC” OR “Triple-negative breast cancer”). The full search was conducted manually and is detailed in the Section 2 Conflicts of Interest The authors declare no conflicts of interest. Abbreviations The following abbreviations are used in this manuscript: TNBC Triple-Negative Breast Cancer AKT Protein Kinase B BRCA Breast Cancer Genes CDH-1 E-Cadherin CREB1 cAMP Response Element Binding Protein 1 DAB2IP Disabled Homolog 2 Interacting Protein DNMT/DNMT1 DNA Methyltransferase DNMTi DNA Methyltransferase Inhibitor DPN Diarylpropionitrile ERα Estrogen Receptor Alpha ERβ Estrogen Receptor Beta ERBB2 Erb-B2 Receptor Tyrosine Kinase 2 ESSRA Estrogen-Related Receptor Alpha FOXM1 Forkhead Box Protein M1 FTH1 Ferritin Heavy Chain 1 GSK Glycogen Synthase Kinase-3 HMGB1 High-Mobility Group Box 1 HRR Homologous Recombination Repair hTERT Human Telomerase Reverse Transcriptase IGF-1 Insulin-like Growth Factor 1 IKKb Inhibitor of Nuclear Factor Kappa-B Kinase Subunit Beta IRF4 Interferon Regulatory Factor 4 LPAR1 Lysophosphatidic Acid Receptor 1 LRRC26 Leucine-Rich Repeat-Containing Protein 26 MYC MYC Proto-Oncogene, bHLH Transcription Factor NOXA Phorbol-12-myristate-13-acetate-Induced Protein 1 NUPR1 Nuclear Protein 1 PARP Poly (ADP-ribose) Polymerase PDT Photodynamic Therapy PIK3CB Phosphoinositide 3-Kinase Catalytic Subunit Beta POLD3 Polymerase Delta 3 Rap1B Ras-Related Protein 1b RUX3 Runt-Related Transcription Factor 3 sFRP1 Secreted Frizzled-Related Protein 1 STING Stimulator of Interferon Genes TP53 Tumor Protein P53 TPX2 Targeting Protein for Xklp2 TRAF6 Tumor Necrosis Factor Receptor-Associated Factor 6 TSPAN5 Tetraspanin 5 VEGF Vascular Endothelial Growth Factor AZA Azacitidine DAC Decitabine ADC 5-aza-2′-deoxycytidine DEX Dexamethasone DOC Docetaxel PAN Panobinostat PTX Paclitaxel ATP Adenosine Triphosphate CRT Chemoradiotherapy CSCs Cancer Stem Cells DNA Deoxyribonucleic Acid DSBs Double Strand Breaks EMT Epithelial–Mesenchymal Transition EPR Enhanced Permeability and Retention γ-H2AX Phosphorylated Form of Histone H2AX miR microRNA lncRNA Long Non-Coding RNA shRNA Short Hairpin RNA CTLs Cytotoxic T Lymphocytes ICD Immunogenic Cell Death IFN-γ Interferon Gamma IFN-β Interferon Beta IFN-I Interferon Type I ISGs Interferon-Stimulated Genes MHC-I Major Histocompatibility Complex Class I M-MDSCs Monocytic Myeloid-Derived Suppressor Cells PD-1 Programmed Cell Death Protein 1 PD-L1 Programmed Cell Death Protein Ligand 1 Treg Regulatory T Cells TEM Effector Memory T Cells ALT Alternative Lengthening of Telomeres DFS Disease-Free Survival LNEs Lipid Nanoemulsions mMSNs Macrophage-Membrane-Camouflaged Mesoporous Silica Nanoparticles NCT Neoadjuvant Chemotherapy OS Overall Survival pCR Pathological Complete Response sTILs Stromal Tumor-Infiltrating Lymphocytes iTILs Intratumoral Tumor-Infiltrating Lymphocytes CRISPR Clustered Regularly Interspaced Short Palindromic Repeats DMEM Dulbecco’s Modified Eagle Medium References 1. Penault-Llorca F. Viale G. Pathological and Molecular Diagnosis of Triple-Negative Breast Cancer: A Clinical Perspective Ann. Oncol. 2012 23 vi19 vi22 10.1093/annonc/mds190 23012297 2. Lee Y.-M. Oh M.H. Go J.-H. Han K. Choi S.-Y. Molecular Subtypes of Triple-Negative Breast Cancer: Understanding of Subtype Categories and Clinical Implication Genes Genom. 2020 42 1381 1387 10.1007/s13258-020-01014-7 33145728 3. Uscanga-Perales G.I. Santuario-Facio S.K. Ortiz-López R. Triple Negative Breast Cancer: Deciphering the Biology and Heterogeneity Available online: https://www.elsevier.es/en-revista-medicina-universitaria-304-resumen-triple-negative-breast-cancer-deciphering-S1665579616300667 (accessed on 17 July 2025) 4. Almansour N.M. Triple-Negative Breast Cancer: A Brief Review about Epidemiology, Risk Factors, Signaling Pathways, Treatment and Role of Artificial Intelligence Front. Mol. Biosci. 2022 9 836417 10.3389/fmolb.2022.836417 35145999 PMC8824427 5. Siddharth S. Sharma D. Racial Disparity and Triple-Negative Breast Cancer in African-American Women: A Multifaceted Affair between Obesity, Biology, and Socioeconomic Determinants Cancers 2018 10 514 10.3390/cancers10120514 30558195 PMC6316530 6. Chen B. Zhang X. Liu Y. Wang C. Prognostic Disparities in Young Patients Based on Breast Cancer Subtype: A Population-Based Study from the SEER Database Medicine 2023 102 e33416 10.1097/MD.0000000000033416 37000095 PMC10063271 7. Zevallos A. Bravo L. Bretel D. Paez K.J. Infante U. Cardenas N.K. Alvarado H. Posada A. Pinto J.A. The Hispanic Landscape of Triple Negative Breast Cancer Crit. Rev. Oncol. Hematol. 2020 155 103094 10.1016/j.critrevonc.2020.103094 33027724 8. O’Reilly D. Sendi M.A. Kelly C.M. Overview of Recent Advances in Metastatic Triple Negative Breast Cancer World J. Clin. Oncol. 2021 12 164 182 10.5306/wjco.v12.i3.164 33767972 PMC7968109 9. Lv Y. Ma X. Du Y. Feng J. Understanding Patterns of Brain Metastasis in Triple-Negative Breast Cancer and Exploring Potential Therapeutic Targets OncoTargets Ther. 2021 14 589 607 10.2147/OTT.S293685 PMC7837592 33519208 10. Yao H. He G. Yan S. Chen C. Song L. Rosol T.J. Deng X. Triple-Negative Breast Cancer: Is There a Treatment on the Horizon? Oncotarget 2016 8 1913 1924 10.18632/oncotarget.12284 PMC5352107 27765921 11. Newton E.E. Mueller L.E. Treadwell S.M. Morris C.A. Machado H.L. Molecular Targets of Triple-Negative Breast Cancer: Where Do We Stand? Cancers 2022 14 482 10.3390/cancers14030482 35158750 PMC8833442 12. Bianchini G. Balko J.M. Mayer I.A. Sanders M.E. Gianni L. Triple-Negative Breast Cancer: Challenges and Opportunities of a Heterogeneous Disease Nat. Rev. Clin. Oncol. 2016 13 674 690 10.1038/nrclinonc.2016.66 27184417 PMC5461122 13. Dogra A.K. Prakash A. Gupta S. Gupta M. Prognostic Significance and Molecular Classification of Triple Negative Breast Cancer: A Systematic Review Eur. J. Breast Health 2025 21 101 114 10.4274/ejbh.galenos.2025.2024-10-2 40028895 PMC11934825 14. Xiong N. Wu H. Yu Z. Advancements and Challenges in Triple-Negative Breast Cancer: A Comprehensive Review of Therapeutic and Diagnostic Strategies Front. Oncol. 2024 14 1405491 10.3389/fonc.2024.1405491 38863622 PMC11165151 15. Obidiro O. Battogtokh G. Akala E.O. Triple Negative Breast Cancer Treatment Options and Limitations: Future Outlook Pharmaceutics 2023 15 1796 10.3390/pharmaceutics15071796 37513983 PMC10384267 16. Kim E.-S. Molecular Targets and Therapies Associated with Poor Prognosis of Triple-Negative Breast Cancer (Review) Int. J. Oncol. 2025 66 52 10.3892/ijo.2025.5758 40444482 PMC12118953 17. Liu Q. Song X. Liu Z. Yu Z. Investigation of Candidate Genes and Pathways in Basal/TNBC Patients by Integrated Analysis Technol. Cancer Res. Treat. 2021 20 153303382110195 10.1177/15330338211019506 34184566 PMC8246569 18. Wei L.Y. Zhang X.J. Wang L. Hu L.N. Zhang X.D. Li L. Gao J.N. A Six-Epithelial–Mesenchymal Transition Gene Signature May Predict Metastasis of Triple-Negative Breast Cancer OncoTargets Ther. 2020 13 6497 6509 10.2147/ott.s256818 PMC7342558 32753890 19. Zhang J. Wang L. Xu X. Li X. Guan W. Meng T. Xu G. Transcriptome-Based Network Analysis Unveils Eight Immune-Related Genes as Molecular Signatures in the Immunomodulatory Subtype of Triple-Negative Breast Cancer Front. Oncol. 2020 10 1787 10.3389/fonc.2020.01787 33042828 PMC7530237 20. Thompson K.J. Leon-Ferre R.A. Sinnwell J.P. Zahrieh D. Suman V. Metzger F. Asad S. Stover D. Carey L. Sikov W.M. Luminal Androgen Receptor Breast Cancer Subtype and Investigation of the Microenvironment and Neoadjuvant Chemotherapy Response NAR Cancer 2022 4 zcac018 10.1093/narcan/zcac018 35734391 PMC9204893 21. Błaszczak E. Miziak P. Odrzywolski A. Baran M. Gumbarewicz E. Stepulak A. Triple-Negative Breast Cancer Progression and Drug Resistance in the Context of Epithelial–Mesenchymal Transition Cancers 2025 17 228 10.3390/cancers17020228 39858010 PMC11764116 22. Fultang N. Chakraborty M. Peethambaran B. Regulation of Cancer Stem Cells in Triple Negative Breast Cancer Cancer Drug Resist. 2021 4 321 342 10.20517/cdr.2020.106 35582030 PMC9019272 23. Xu T. Zhang H. Yang B.B. Qadir J. Yuan H. Ye T. Tumor-Infiltrating Immune Cells State-Implications for Various Breast Cancer Subtypes Front. Immunol. 2025 16 1550003 10.3389/fimmu.2025.1550003 40438111 PMC12116345 24. Cai W. Cai X. Fei Y. Ye R. Song D. Hu D. Zhang W. Xia M. Yang X. DNA Methylation and Immune Evasion in Triple-Negative Breast Cancer: Challenges and Therapeutic Opportunities Front. Oncol. 2025 15 1534055 10.3389/fonc.2025.1534055 39980537 PMC11839428 25. Nedeljković M. Damjanović A. Mechanisms of Chemotherapy Resistance in Triple-Negative Breast Cancer—How We Can Rise to the Challenge Cells 2019 8 957 10.3390/cells8090957 31443516 PMC6770896 26. Zhou L. Yu C.-W. Epigenetic Modulations in Triple-Negative Breast Cancer: Therapeutic Implications for Tumor Microenvironment Pharmacol. Res. 2024 204 107205 10.1016/j.phrs.2024.107205 38719195 27. Temian D.C. Pop L.A. Irimie A.I. Berindan-Neagoe I. The Epigenetics of Triple-Negative and Basal-like Breast Cancer: Current Knowledge J. Breast Cancer 2018 21 233 10.4048/jbc.2018.21.e41 30275851 PMC6158152 28. Al Aboud N.M. Simpson B. Jialal I. Genetics, Epigenetic Mechanism Available online: https://www.ncbi.nlm.nih.gov/books/NBK532999/ (accessed on 17 July 2025) 29. Handy D.E. Castro R. Loscalzo J. Epigenetic Modifications Circulation 2011 123 2145 2156 10.1161/circulationaha.110.956839 21576679 PMC3107542 30. Aine M. Nacer D.F. Arbajian E. Veerla S. Karlsson A. Häkkinen J. Johansson H.J. Rosengren F. Vallon-Christersson J. Borg Å. The DNA Methylation Landscape of Primary Triple-Negative Breast Cancer Nat. Commun. 2025 16 3041 10.1038/s41467-025-58158-x 40155623 PMC11953470 31. Tarhonska K. Wichtowski M. Wow T. Kołacińska-Wow A. Płoszka K. Fendler W. Zawlik I. Paszek S. Zuchowska A. Jabłońska E. DNA Methylation and Demethylation in Triple-Negative Breast Cancer: Associations with Clinicopathological Characteristics and the Chemotherapy Response Biomedicines 2025 13 585 10.3390/biomedicines13030585 40149562 PMC11939961 32. Esteller M. CpG Island Hypermethylation and Tumor Suppressor Genes: A Booming Present, a Brighter Future Oncogene 2002 21 5427 5440 10.1038/sj.onc.1205600 12154405 33. Oubaddou Y. Oukabli M. Fenniche S. Elktaibi A. Elochi M.R. Al Bouzidi A. Qmichou Z. Dakka N. Diorio C. Richter A. BRCA1 Promoter Hypermethylation in Malignant Breast Tumors and in the Histologically Normal Adjacent Tissues to the Tumors: Exploring Its Potential as a Biomarker and Its Clinical Significance in a Translational Approach Genes 2023 14 1680 10.3390/genes14091680 37761820 PMC10530732 34. Sheaffer K.L. Elliott E.N. Kaestner K.H. DNA Hypomethylation Contributes to Genomic Instability and Intestinal Cancer Initiation Cancer Prev. Res. 2016 9 534 546 10.1158/1940-6207.CAPR-15-0349 26883721 PMC4930698 35. Besselink N. Keijer J. Vermeulen C. Boymans S. de Ridder J. van Hoeck A. Cuppen E. Kuijk E. The Genome-Wide Mutational Consequences of DNA Hypomethylation Sci. Rep. 2023 13 6874 10.1038/s41598-023-33932-3 37106015 PMC10140063 36. Choi J.Y. James S.R. Link P.A. McCann S.E. Hong C.C. Davis W. Nesline M. Ambrosone C.B. Karpf A.R. Association between Global DNA Hypomethylation in Leukocytes and Risk of Breast Cancer Carcinogenesis 2009 30 1889 1897 10.1093/carcin/bgp143 19584139 PMC2783000 37. Gu M. Ren B. Fang Y. Ren J. Liu X. Wang X. Zhou F. Xiao R. Luo X. You L. Epigenetic Regulation in Cancer MedComm (2020) 2024 5 e495 10.1002/mco2.495 38374872 PMC10876210 38. Karahoca M. Momparler R.L. Pharmacokinetic and Pharmacodynamic Analysis of 5-Aza-2′-Deoxycytidine (Decitabine) in the Design of Its Dose-Schedule for Cancer Therapy Clin. Epigenetics 2013 5 3 10.1186/1868-7083-5-3 23369223 PMC3570332 39. Palii S.S. Van Emburgh B.O. Sankpal U.T. Brown K.D. Robertson K.D. DNA Methylation Inhibitor 5-Aza-2′-Deoxycytidine Induces Reversible Genome-Wide DNA Damage That Is Distinctly Influenced by DNA Methyltransferases 1 and 3B Mol. Cell. Biol. 2008 28 752 771 10.1128/MCB.01799-07 17991895 PMC2223421 40. Patel K. Dickson J. Din S. Macleod K. Jodrell D. Ramsahoye B. Targeting of 5-Aza-2′-Deoxycytidine Residues by Chromatin-Associated DNMT1 Induces Proteasomal Degradation of the Free Enzyme Nucleic Acids Res. 2010 38 4313 4324 10.1093/nar/gkq187 20348135 PMC2910061 41. Kikuchi A. Onoda H. Yamaguchi K. Kori S. Matsuzawa S. Chiba Y. Tanimoto S. Yoshimi S. Sato H. Yamagata A. Structural Basis for Activation of DNMT1 Nat. Commun. 2022 13 7130 10.1038/s41467-022-34779-4 36414620 PMC9681727 42. Hattori N. Sako M. Kimura K. Iida N. Takeshima H. Nakata Y. Kono Y. Ushijima T. Novel Prodrugs of Decitabine with Greater Metabolic Stability and Less Toxicity Clin. Epigenet. 2019 11 111 10.1186/s13148-019-0709-y PMC6670186 31370878 43. Noto F. Mancini J. Gambardella A.R. Curcio C. Ninno A.D. Andreone S. Buccione C. D’Urso M.T. Macchia D. Pacca A.M. Decitabine Co-Operates with the IL-33/ST2 Axis Modifying the Tumor Microenvironment and Improving the Response to PD-1 Blockade in Melanoma J. Exp. Clin. Cancer Res. 2025 44 137 10.1186/s13046-025-03381-z 40317004 PMC12048997 44. Wang L. Amoozgar Z. Huang J. Saleh M.H. Xing D. Orsulic S. Goldberg M.S. Decitabine Enhances Lymphocyte Migration and Function and Synergizes with CTLA-4 Blockade in a Murine Ovarian Cancer Model Cancer Immunol. Res. 2015 3 1030 1041 10.1158/2326-6066.CIR-15-0073 26056145 45. Yu J. Qin B. Moyer A.M. Nowsheen S. Liu T. Qin S. Zhuang Y. Liu D. Lu S.W. Kalari K.R. DNA Methyltransferase Expression in Triple-Negative Breast Cancer Predicts Sensitivity to Decitabine J. Clin. Investig. 2018 128 2376 2388 10.1172/jci97924 29708513 PMC5983332 46. Yu J. Zayas J. Qin B. Wang L. Targeting DNA Methylation for Treating Triple-Negative Breast Cancer Pharmacogenomics 2019 20 1151 1157 10.2217/pgs-2019-0078 31755366 PMC7026764 47. Dahn M.L. Cruickshank B.M. Jackson A.J. Dean C. Holloway R.W. Hall S.R. Coyle K.M. Maillet H. Waisman D.M. Goralski K.B. Decitabine Response in Breast Cancer Requires Efficient Drug Processing and Is Not Limited by Multidrug Resistance Mol. Cancer Ther. 2020 19 1110 1122 10.1158/1535-7163.mct-19-0745 32156786 48. Nik Amirah Auni N.M.A. Mohd Redzwan N. Fauzi A.N. Yahya M.M. Wong K.K. Hypomethylating Agents as Emerging Therapeutics for Triple-Negative Breast Cancer Life Sci. 2025 363 123403 10.1016/j.lfs.2025.123403 39824347 49. Zhu S. Wu Y. Song B. Yi M. Yan Y. Mei Q. Wu K. Recent Advances in Targeted Strategies for Triple-Negative Breast Cancer J. Hematol. Oncol. 2023 16 100 10.1186/s13045-023-01497-3 37641116 PMC10464091 50. Shen K. Lu M. Decitabine Plus Carboplatin in the Treatment of Metastatic TNBC (DETECT) Available online: https://clinicaltrials.gov/study/NCT03295552?cond=TNBC (accessed on 17 July 2025) 51. Wang H. Wang Z. Wang Z. Li X. Li Y. Yan N. Wu L. Liang Y. Wu J. Song H. Decitabine Induces IRF7-Mediated Immune Responses in P53-Mutated Triple-Negative Breast Cancer: A Clinical and Translational Study Front. Med. 2024 18 357 374 10.1007/s11684-023-1016-8 38157193 52. Bear H.D. Deng X. Bandyopadhyay D. Idowu M. Jenkins T.M. Kmieciak M. Williams M. Archer G. Gwaltney L. Dillon P. T-Cell Immune Checkpoint Inhibition plus Hypomethylation for Locally Advanced HER2-Negative Breast Cancer: A Phase 2 Neoadjuvant Window Trial of Decitabine and Pembrolizumab Followed by Standard Neoadjuvant Chemotherapy J. Immunother. Cancer 2025 13 e010294 10.1136/jitc-2024-010294 40021215 PMC11873355 53. Page M.J. McKenzie J.E. Bossuyt P.M. Boutron I. Hoffmann T.C. Mulrow C.D. Shamseer L. Tetzlaff J.M. Akl E.A. Brennan S.E. The PRISMA 2020 Statement: An Updated Guideline for Reporting Systematic Reviews Br. Med. J. 2021 372 n71 10.1136/bmj.n71 33782057 PMC8005924 54. Shea B.J. Reeves B.C. Wells G. Thuku M. Hamel C. Moran J. Moher D. Tugwell P. Welch V. Kristjansson E. AMSTAR 2: A critical appraisal tool for systematic reviews that include randomised or non-randomised studies of healthcare interventions, or both BMJ 2017 358 j4008 10.1136/bmj.j4008 28935701 PMC5833365 55. Amir-Behghadami M. Janati A. Population, Intervention, Comparison, Outcomes and Study (PICOS) Design as a Framework to Formulate Eligibility Criteria in Systematic Reviews Emerg. Med. J. 2020 37 387 10.1136/emermed-2020-209567 32253195 56. Rayyan AI Available online: https://rayyan.ai/reviews (accessed on 4 April 2025) 57. Grooten W.J.A. Tseli E. Äng B.O. Boersma K. Stålnacke B.-M. Gerdle B. Enthoven P. Elaborating on the Assessment of the Risk of Bias in Prognostic Studies in Pain Rehabilitation Using QUIPS—Aspects of Interrater Agreement Diagn. Progn. Res. 2019 3 5 10.1186/s41512-019-0050-0 31093575 PMC6460536 58. Cochrane Methods Risk of Bias 2 (RoB 2) Tool Available online: https://methods.cochrane.org/risk-bias-2 (accessed on 4 September 2025) 59. Russo S. Feola S. Feodoroff M. Chiaro J. Antignani G. Fusciello M. D’Alessio F. Hamdan F. Pellinen T. Mölsä R. Low-Dose Decitabine Enhances the Efficacy of Viral Cancer Vaccines for Immunotherapy Deleted J. 2024 32 200766 10.1016/j.omton.2024.200766 PMC10869747 38596301 60. Chu Y.-H. Huang Y.-C. Chiu P.-Y. Kuo W.-H. Pan Y.-R. Kuo Y.-T. Wang R.-H. Kao Y.-C. Wang Y.-H. Lin Y.-F. Combating Breast Cancer Progression through Combination Therapy with Hypomethylating Agent and Glucocorticoid iScience 2023 26 106597 10.1016/j.isci.2023.106597 37128608 PMC10148121 61. Yang L.-W. Wu X.-J. Liang Y. Ye G.-Q. Che Y.-C. Wu X.-Z. Zhu X.-J. Fan H.-L. Fan X.-P. Xu J.-F. MiR-155 Increases Stemness and Decitabine Resistance in Triple-Negative Breast Cancer Cells by Inhibiting TSPAN5 Mol. Carcinog. 2020 59 447 461 10.1002/mc.23167 32096299 62. Kim B. Pena C.D. Auguste D.T. Targeted Lipid Nanoemulsions Encapsulating Epigenetic Drugs Exhibit Selective Cytotoxicity on CDH1 − + Mol. Pharm. 2019 16 1813 1826 10.1021/acs.molpharmaceut.8b01065 30883132 63. Cooper S. Von C.A. Kang K.-T. Marlow L.A. Grebe S.K. Menefee M.E. Tun H.W. Colón-Otero G. Perez E.A. Copland J.A. Reexpression of Tumor Suppressor, SFRP1, Leads to Antitumor Synergy of Combined HDAC and Methyltransferase Inhibitors in Chemoresistant Cancers Mol. Cancer Ther. 2012 11 2105 2115 10.1158/1535-7163.MCT-11-0873 22826467 PMC3928542 64. Fan W. Li W. Li L. Qin M. Mao C. Yuan Z. Wang P. Chu B. Jiang Y. Bifunctional HDAC and DNMT Inhibitor Induces Viral Mimicry Activates the Innate Immune Response in Triple-Negative Breast Cancer Eur. J. Pharm. Sci. 2024 197 106767 10.1016/j.ejps.2024.106767 38636781 65. Gao T. Sang X. Huang X. Gu P. Liu J. Liu Y. Zhang N. Macrophage-Camouflaged Epigenetic Nanoinducers Enhance Chemoimmunotherapy in Triple Negative Breast Cancer Acta Pharm. Sin. B 2022 13 4305 4317 10.1016/j.apsb.2022.11.018 37799382 PMC10548052 66. Nakajima W. Miyazaki K. Sakaguchi M. Asano Y. Ishibashi M. Kurita T. Yamaguchi H. Takei H. Tanaka N. Epigenetic Priming with Decitabine Augments the Therapeutic Effect of Cisplatin on Triple-Negative Breast Cancer Cells through Induction of Proapoptotic Factor NOXA Cancers 2022 14 248 10.3390/cancers14010248 35008411 PMC8749981 67. Kong B. Lv Z.-D. Wang Y. Jin L.-Y. Ding L. Yang Z.-C. Down-Regulation of BRMS1 by DNA Hypermethylation and Its Association with Metastatic Progression in Triple-Negative Breast Cancer Int. J. Clin. Exp. Pathol. 2015 8 11076 11083 26617826 PMC4637641 68. He Y. Hu Q. Wang L. Chen C. Decitabine/Paclitaxel Co-Delivery Systems Modified with Anti-PD-L1 Antibodies Mediate Chemoimmunotherapy for Triple Negative Breast Cancer Mater. Des. 2023 237 112562 10.1016/j.matdes.2023.112562 69. Xiong Z. Yang L. Li N. Fu J. Liu P. Sun P. Wei W. Xie X. DAB2IP Attenuates Chemoresistance of Triple-Negative Breast Cancer through Sequestration of RAC1 to Prevent β-Catenin Nuclear Accumulation Clin. Transl. Med. 2022 12 e1133 10.1002/ctm2.1133 36536485 PMC9763535 70. Elango R. Vishnubalaji R. Shaath H. Alajez N.M. Transcriptional Alterations of Protein Coding and Noncoding RNAs in Triple Negative Breast Cancer in Response to DNA Methyltransferases Inhibition Cancer Cell Int. 2021 21 515 10.1186/s12935-021-02213-2 34565361 PMC8474815 71. Vernier M. McGuirk S. Dufour C.R. Wan L. Audet-Walsh E. St-Pierre J. Giguère V. Inhibition of DNMT1 and ERRα Crosstalk Suppresses Breast Cancer via Derepression of IRF4 Oncogene 2020 39 6406 6420 10.1038/s41388-020-01438-1 32855526 PMC7544553 72. Pacaud R. Thomas S. Chaudhuri S. Lazar A. Timmerman L.A. Munster P.N. Low Dose DNA Methyltransferase Inhibitors Potentiate PARP Inhibitors in Homologous Recombination Repair Deficient Tumors Breast Cancer Res. 2025 27 8 10.1186/s13058-024-01954-y 39819384 PMC11740508 73. Wu S.-Y. Xiao Y. Wei J.-L. Xu X.-E. Jin X. Hu X. Li D.-Q. Jiang Y.-Z. MYC Suppresses STING-Dependent Innate Immunity by Transcriptionally Upregulating DNMT1 in Triple-Negative Breast Cancer J. Immunother. Cancer 2021 9 e002528 10.1136/jitc-2021-002528 34321275 PMC8320259 74. Salahuddin A. Ghanem H. Omran G.A. Helmy M.W. Epigenetic Restoration and Activation of ERβ: An Inspiring Approach for Treatment of Triple-Negative Breast Cancer Med. Oncol. 2022 39 150 10.1007/s12032-022-01765-1 35843988 PMC9288957 75. Butler C. Sprowls S. Szalai G. Arsiwala T. Saralkar P. Straight B. Hatcher S. Hypomethylating Agent Azacitidine Is Effective in Treating Brain Metastasis Triple-Negative Breast Cancer through Regulation of DNA Methylation of Keratin 18 Gene Transl. Oncol. 2020 13 100775 10.1016/j.tranon.2020.100775 32408199 PMC7225776 76. Banerjee S. Acedo P. Sheikh S.E. Harati R. Meecham A. Williams N. Gerard G.F. Keshtgar M. MacRobert A.J. Rifat Hamoudi Combination of Verteporfin-Photodynamic Therapy with 5-Aza-2′-Deoxycytidine Enhances the Anti-Tumour Immune Response in Triple Negative Breast Cancer Front. Immunol. 2023 14 1188087 10.3389/fimmu.2023.1188087 38022682 PMC10664979 77. Miyagawa Y. Matsushita Y. Suzuki H. Komatsu M. Yoshimaru T. Kimura R. Yanai A. Honda J. Tangoku A. Sasa M. Frequent Downregulation of LRRC26 by Epigenetic Alterations Is Involved in the Malignant Progression of Triple-Negative Breast Cancer Int. J. Oncol. 2018 52 1539 1558 10.3892/ijo.2018.4301 29512727 78. Wang H. Wu D. Cai L. Li X. Zhang Z. Chen S. Aberrant Methylation of WD-Repeat Protein 41 Contributes to Tumour Progression in Triple-Negative Breast Cancer J. Cell. Mol. Med. 2020 24 6869 6882 10.1111/jcmm.15344 32394588 PMC7299681 79. Umeh-Garcia M. O’Geen H. Simion C. Gephart M.H. Segal D.J. Sweeney C.A. Aberrant Promoter Methylation Contributes to LRIG1 Silencing in Basal/Triple-Negative Breast Cancer Br. J. Cancer 2022 127 436 448 10.1038/s41416-022-01812-8 35440669 PMC9346006 80. Al-dulaimi S. Matta S. Slijepcevic P. Roberts T. 5-Aza-2′-Deoxycytidine Induces Telomere Dysfunction in Breast Cancer Cells Biomed. Pharmacother. 2024 178 117173 10.1016/j.biopha.2024.117173 39059352 81. Song P. Gao Z. Bao Y. Chen L. Huang Y. Liu Y. Dong Q. Wei X. Wnt/β-Catenin Signaling Pathway in Carcinogenesis and Cancer Therapy J. Hematol. Oncol. 2024 17 46 10.1186/s13045-024-01563-4 38886806 PMC11184729 82. Al-Yozbaki M. Jabre I. Syed N.H. Wilson C.M. Targeting DNA Methyltransferases in Non-Small-Cell Lung Cancer Semin. Cancer Biol. 2022 83 77 87 10.1016/j.semcancer.2021.01.005 33486076 83. Shafa A. Kailasam A. Prokop L. Hou X. Weroha S.J. The Role of DNA Methyltransferase Inhibitors (DNMTi) in the Treatment of Patients with Recurrent Epithelial Ovarian Cancer: A Systematic Review and Meta-Analysis Gynecol. Oncol. Rep. 2022 44 S24 10.1016/s2352-5789(22)00262-4 84. Pawlak A. Hybicka K.C. Zioło E. Strządała L. Kałas W. The Contrasting Delayed Effects of Transient Exposure of Colorectal Cancer Cells to Decitabine or Azacitidine Cancers 2022 14 1530 10.3390/cancers14061530 35326680 PMC8945888 85. Li H.-T. Jang H.J. Rohena-Rivera K. Liu M. Gujar H. Kulchycki J. Zhao S. Billet S. Zhou X. Weisenberger D.J. RNA Mis-Splicing Drives Viral Mimicry Response after DNMTi Therapy in SETD2-Mutant Kidney Cancer Cell Rep. 2023 42 112016 10.1016/j.celrep.2023.112016 36662621 PMC10034851 86. Wang R. Dong X. Zhang X. Liao J. Cui W. Li W. Exploring Viral Mimicry Combined with Epigenetics and Tumor Immunity: New Perspectives in Cancer Therapy Int. J. Biol. Sci. 2025 21 958 973 10.7150/ijbs.103877 39897033 PMC11781167 87. Chiappinelli K.B. Strissel P.L. Desrichard A. Li H. Henke C. Akman B. Hein A. Rote N.S. Cope L.M. Snyder A. Inhibiting DNA Methylation Causes an Interferon Response in Cancer via DsRNA Including Endogenous Retroviruses Cell 2015 162 974 986 10.1016/j.cell.2015.07.011 26317466 PMC4556003 88. Fitzgerald M.E. Rawling D.C. Vela A. Pyle A.M. An Evolving Arsenal: Viral RNA Detection by RIG-I-like Receptors Curr. Opin. Microbiol. 2014 20 76 81 10.1016/j.mib.2014.05.004 24912143 PMC7108371 89. Gaudy A. Laille E. Bailey R. Zhou S. Skikne B. Beach C.L. Population Pharmacokinetics of Oral Azacitidine, and Exposure–Response Analysis in Acute Myeloid Leukemia Clin. Pharmacol. Ther. 2023 114 845 852 10.1002/cpt.2982 37422689 90. Fan H. Lu X. Wang X. Liu Y. Guo B. Zhang Y. Zhang W. Nie J. Feng K. Chen M. Low-Dose Decitabine-Based Chemoimmunotherapy for Patients with Refractory Advanced Solid Tumors: A Phase I/II Report J. Immunol. Res. 2014 2014 371087 10.1155/2014/371087 24963497 PMC4054619 91. Lv M. Wang Y. Yuan Z. Zhai L. Iqbal H. Ur-Rehman U. Ning X. Wei H. Xin J. Jin Z. Decitabine Promotes the Differentiation of Poorly Differentiated Gastric Cancer Cells and Enhances the Sensitivity of NK Cell Cytotoxicity via TNF-α Sci. Rep. 2025 15 13119 10.1038/s41598-025-95741-0 40240368 PMC12003911 92. Kastl L. Brown I. Schofield A.C. Effects of Decitabine on the Expression of Selected Endogenous Control Genes in Human Breast Cancer Cells Mol. Cell. Probes 2010 24 87 92 10.1016/j.mcp.2009.10.007 19837153 93. Datta J. Ghoshal K. Motiwala T. Jacob S.T. Novel Insights into the Molecular Mechanism of Action of DNA Hypomethylating Agents: Role of Protein Kinase C δ in Decitabine-Induced Degradation of DNA Methyltransferase 1 Genes Cancer 2012 3 71 81 10.1177/1947601912452665 22893792 PMC3415671 94. Buocikova V. Tyciakova S. Pilalis E. Mastrokalou C. Urbanova M. Matuskova M. Demkova L. Medova V. Longhin E.M. Rundén-Pran E. Decitabine-Induced DNA Methylation-Mediated Transcriptomic Reprogramming in Human Breast Cancer Cell Lines; the Impact of DCK Overexpression Front. Pharmacol. 2022 13 991751 10.3389/fphar.2022.991751 36278182 PMC9585938 95. Qin T. Castoro R. El Ahdab S. Jelinek J. Wang X. Si J. Shu J. He R. Zhang N. Chung W. Mechanisms of Resistance to Decitabine in the Myelodysplastic Syndrome PLoS ONE 2011 6 e23372 10.1371/journal.pone.0023372 21858090 PMC3157379 96. Welch J.S. Petti A.A. Miller C.A. Fronick C.C. O’Laughlin M. Fulton R.S. Wilson R.K. Baty J.D. Duncavage E.J. Tandon B. TP53 and Decitabine in Acute Myeloid Leukemia and Myelodysplastic Syndromes N. Engl. J. Med. 2016 375 2023 2036 10.1056/NEJMoa1605949 27959731 PMC5217532 97. Derissen E.J.B. Beijnen J.H. Schellens J.H.M. Concise Drug Review: Azacitidine and Decitabine Oncologist 2013 18 619 624 10.1634/theoncologist.2012-0465 23671007 PMC3662854 98. Manchado E. Huang C.-H. Tasdemir N. Tschaharganeh D.F. Wilkinson J.E. Lowe S.W. A Pipeline for Drug Target Identification and Validation Cold Spring Harb. Symp. Quant. Biol. 2016 81 257 267 10.1101/sqb.2016.81.031096 28057848 PMC5469697 99. Leon-Ferre R.A. Farber D. Testing the Addition of an Anti-Cancer Drug, ASTX727 (Cedazuridine, Decitabine), to Chemotherapy (Paclitaxel) and Immunotherapy (Pembrolizumab) for Metastatic Triple-Negative Breast Cancer Available online: https://clinicaltrials.gov/study/NCT05673200?cond=TNBC (accessed on 17 July 2025) 100. Miller K. Study of ASTX727 Plus Talazoparib in Patients with Triple Negative or Hormone Resistant/HER2-Negative Metastatic Breast Cancer Available online: https://clinicaltrials.gov/study/NCT04134884?cond=TNBC (accessed on 17 July 2025) 101. Jan N. Sofi S. Qayoom H. Shabir A. Haq B.U. Macha M.A. Almilaibary A. Mir M.A. Metronomic Chemotherapy and Drug Repurposing: A Paradigm Shift in Oncology Heliyon 2024 10 e24670 10.1016/j.heliyon.2024.e24670 38314272 PMC10837507 Figure 1 Preferred Reporting Items for Systematic Reviews and Meta-Analyses (PRISMA) diagram demonstrating search strategy. Figure 2 Traffic light plot demonstrating the risk of bias assessment using the Quality in Prognosis Studies (QUIPS) tool [ 45 47 59 60 61 62 63 64 65 66 67 68 69 70 71 72 73 74 75 76 77 78 79 80 Figure 3 Summary plot demonstrating the risk of bias assessment using the Quality in Prognosis Studies (QUIPS) tool. Figure 4 Traffic light plot demonstrating the risk of bias assessment using the Cochrane ROB-2 tool [ 52 cancers-17-02953-t001_Table 1 Table 1 PICOS framework. Framework Description P (Participants) Patients with triple-negative breast cancer (TNBC); preclinical in vivo and in vitro models involving TNBC cell lines or xenografts. I (Intervention) Administration of decitabine (5-aza-2′-deoxycytidine), either as monotherapy or in combination with other therapeutic agents. C (Comparison) Standard chemotherapeutic agents, placebo, or untreated control groups. O (Outcomes) Tumor progression metrics (overall response rate, progression-free survival, overall survival, disease-free survival), biomarker responses, immune response, epigenetic modulation, histopathological changes, safety profile. S (Study Design) Preclinical in vivo/in vitro studies and clinical studies (including randomized trials, observational studies, and case series) evaluating the role of decitabine in TNBC. cancers-17-02953-t002_Table 2 Table 2 In vitro evidence of cytotoxicity and clonogenic suppression. Study Cell Lines Used Intervention Key Findings Dahn et al., 2020 [ 47 MDA-MB-468, MDA-MB-231, SUM159 0.5 mg/kg DAC for 3/5-day cycles over 3–4 weeks Dose-dependent cytotoxicity; significant reduction in clonogenic potential; apoptosis induction; observed dependence on DCK expression levels for drug activation. Chu et al., 2023 [ 60 MDA-MB-231, HCC-1395, Hs578T, MCF-10A (non-tumorigenic), MCF-7 50 mg/kg DAC Upregulation of miR-708; suppression of CD44 and Rap1B expression; inhibited migration, invasion, and clonogenicity. Salahuddin et al., 2022 [ 74 MDA-MB-231 4 µM DAC Hormonal resensitization through ERβ reactivation; increased apoptotic signaling via caspase-3 elevation; VEGF downregulation. Yang et al., 2020 [ 61 MDA-MB-231, BT-549 DAC (concentrations ranged from 2 μmol/L to 256 μmol/L) + Modulatory agents (miR-155 mimics, miR-155 inhibitors, siTSPAN5, pcDNA3.1-TSPAN5 plasmids) DAC increased miR-155, promoting resistance via TSPAN5 suppression; co-treatment with miR-155 inhibitor restored TSPAN5 and reduced tumorsphere formation. Kim et al., 2019 [ 62 MDA-MB-231, MDA-MB-436, MDA-MB-468, Hs578T, HCC1806, HCC1569, DU4475 5 μM DAC + 120 nM PAN for 24–48 h TNBC-specific cytotoxicity; CDH1 upregulation and FOXM1 suppression; induced cell cycle arrest at G2/M phase. Cooper et al., 2012 [ 63 MDA-MB-231, BT20 1 μM DAC for 72 h + 5 nM Romidepsin during the last 24 h Reduced colony-forming ability; synergistic cytotoxicity with HDAC inhibitor; reactivation of Wnt antagonist sFRP1. Vernier et al., 2020 [ 71 MDA-MB-231, MDA-MB-436, MDA-MB-468 5 μM C29 + 3–5 μM AZA Reduced proliferation; de-repression of IRF4 via disruption of DNMT1–ERα loop; induction of type I interferon-related genes. cancers-17-02953-t003_Table 3 Table 3 Tumor volume reduction in murine models. Study Murine Model Intervention Key Findings Dahn et al., 2020 [ 47 MDA-MB-468, MDA-MB-231, SUM159 0.5 mg/kg DAC for 3/5-day cycles over 3–4 weeks Significant tumor volume reduction (~60%); effect reversed in DCK-deficient tumors. Russo et al., 2024 [ 59 4T1 0.5 mg/kg DAC + PeptiCRAd (1 × 10 9 Significant tumor shrinkage in DAC + PeptiCRAd group compared to monotherapies. Wu et al., 2021 [ 73 66cl4, 4T1 0.8 mg/kg DAC daily + 100 µ Anti-PD-1 antibody on days 3, 7, 10, 14 Combination significantly reduced tumor burden compared to monotherapy. Gao et al., 2022 [ 65 4T1 10 mg/kg PTX + 2.5 mg/kg DAC + 5 mg/kg aPD-1 DAC + PTX + aPD-1 resulted in tumor rejection in 75% of mice. Banerjee et al., 2023 [ 76 4T1 6.25 mg/kg 5-ADC + 15 mg/kg Verteporfin Combo group showed smallest tumor volumes. He et al., 2024 [ 68 4T1 and PTX-resistant 4T1/PTX 30 µM DAC + 87.69 µM PTX + 0.3 mg/kg αPD-L1 Greatest tumor volume reduction in triple combo group. Vernier et al., 2020 [ 71 NIC-5231, NIC-5257 5 μM C29 + 3–5 μM 5-azadC DAC + C29 group showed maximal tumor suppression. cancers-17-02953-t004_Table 4 Table 4 Antigen presentation and T-cell recruitment. Study Model Intervention Immune Markers Affected Other Notes Bear et al., 2020 [ 52 Primary breast tumor tissue (biopsy-derived) 15 mg/m 2 ↑ sTILs, ↑ PD-L1 (H-score, CPS), ↓ M-MDSCs Correlated with pCR; effective immune recruitment. Russo et al., 2024 [ 59 4T1, MDA-MB-436 0.5 mg/kg DAC + PeptiCRAd (1 × 10 9 ↑ MHC-I, PD-L1, CD8 + Enhanced spatial relocalization of CD8 + Wu et al., 2021 [ 73 66cl4, 4T1 0.8 mg/kg DAC daily + 100 µ Anti-PD-1 antibody on days 3, 7, 10, 14 ↑ IFN-β, ISGs (CXCL10); ↑ CD8 + Strong STING pathway activation; immune inflamed phenotype. Gao et al., 2022 [ 65 4T1 10 mg/kg PTX + 2.5 mg/kg DAC + 5 mg/kg aPD-1 ↑ IFN-γ, CD8 + Induced ICD and tumor clearance in 75% of mice. cancers-17-02953-t005_Table 5 Table 5 Combination with immune checkpoint inhibitors. Study Model Intervention Synergistic Effects Other Notes Bear et al., 2020 [ 52 Primary breast tumor tissue (biopsy-derived) 15 mg/m 2 40.7% pCR rate, ↑ sTILs, ↓ M-MDSCs Correlated with pCR; effective immune recruitment. Wu et al., 2021 [ 73 66cl4, 4T1 0.8 mg/kg DAC daily + 100 µ Anti-PD-1 antibody on days 3, 7, 10, 14 Enhanced IFN-I and CD8 + MYC-DNMT1-STING axis central to synergy. Gao et al., 2022 [ 65 4T1 10 mg/kg PTX + 2.5 mg/kg DAC + 5 mg/kg aPD-1 Tumor rejection in 75% of mice. Synergized with chemo and immune priming effect. He et al., 2024 [ 68 4T1 and PTX-resistant 4T1/PTX 30 µM DAC + 87.69 µM PTX + 0.3 mg/kg αPD-L1 (in imaging studies) Triple combo showed best survival and tumor suppression. EMT reversal enhanced checkpoint efficacy. cancers-17-02953-t006_Table 6 Table 6 Tumor suppressor reactivation. Study Model Tumor Suppressor Activated Mechanisms Other Notes Yu et al., 2019 [ 46 Hs 578T, BT-549, MDA-MB-231 Global gene reprogramming including MYC downregulation TRAF6-mediated DNMT degradation. Broad reactivation of suppressed pathways; resensitization to chemotherapy. Dahn et al., 2020 [ 47 MDA-MB-468, MDA-MB-231, SUM159 BRCA1, CDH1, RUNX3 Partial promoter demethylation; viral mimicry. Linked to DAC activation via DCK; reduced tumor volume. Cooper et al., 2012 [ 63 MDA-MB-231, BT20 sFRP1 Histone and DNA demethylation with DAC + Romidepsin. Wnt pathway inhibition; induced apoptosis. Fan et al., 2024 [ 64 BT-549, HCC1937, MDA-MB-231 EMT-related markers (such as E-cadherin) Dual HDAC and DNMT inhibition. Reduced migration and invasiveness. Nakajima et al., 2022 [ 66 D-type: MDA-MB-468, HCC38 NOXA (pro-apoptotic gene) Epigenetic class profiling; unsilenced in R-type. Correlated with resistance; failure to silence pro-apoptotic gene in resistant class. Vernier et al., 2020 [ 71 MDA-MB-231, MDA-MB-436, MDA-MB-468 IRF4 Disruption of ERα-DNMT1 complex. Enhanced interferon signaling and growth suppression. ",
  "metadata": {
    "Title of this paper": "Metronomic Chemotherapy and Drug Repurposing: A Paradigm Shift in Oncology",
    "Journal it was published in:": "Cancers",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12468927/"
  }
}