{
  "title": "Paper_1091",
  "abstract": "pmc Genome Biol Genome Biol 7 genbio Genome Biology 1474-7596 1474-760X BMC PMC12477815 PMC12477815.1 12477815 12477815 41023738 10.1186/s13059-025-03727-y 3727 1 Research Variable efficiency of nonsense-mediated mRNA decay across human tissues, tumors and individuals Palou-Márquez Guillermo 1 http://orcid.org/0000-0002-7811-6711 Supek Fran fran.supek@bric.ku.dk 1 2 3 1 https://ror.org/03kpps236 grid.473715.3 0000 0004 6475 7299 Institute for Research in Biomedicine (IRB Barcelona), The Barcelona Institute for Science and Technology (BIST), 2 https://ror.org/035b05819 grid.5254.6 0000 0001 0674 042X Biotech Research and Innovation Centre, Faculty of Health and Medical Sciences, University of Copenhagen, 3 https://ror.org/0371hy230 grid.425902.8 0000 0000 9601 989X Catalan Institution for Research and Advanced Studies (ICREA), 29 9 2025 2025 26 478174 316 10 4 2024 5 8 2025 29 09 2025 30 09 2025 01 10 2025 © The Author(s) 2025 2025 https://creativecommons.org/licenses/by/4.0/ Open Access http://creativecommons.org/licenses/by/4.0/ Background Nonsense-mediated mRNA decay (NMD) is a quality-control pathway that degrades mRNA bearing premature termination codons (PTCs) resulting from mutation or mis-splicing, and that additionally participates in gene regulation of unmutated transcripts. While NMD activity is known to differ between examples of PTCs, it is less well studied if human tissues differ in NMD activity, or if individuals differ. Results We analyzed exomes and matched transcriptomes from Human tumors and healthy tissues to quantify individual-level NMD efficiency, and assess its variability between tissues, tumors, and individuals. This was done by monitoring mRNA levels of endogenous NMD target transcripts, and additionally supported by allele-specific expression of germline PTCs. Nervous system and reproductive system tissues have lower NMD efficiency than other tissues, such as the digestive tract. Next, there is systematic inter-individual variability in NMD efficiency, and we identify two underlying mechanisms. First, somatic copy number alterations can robustly associate with NMD efficiency, prominently the commonly-occurring gain at chromosome 1q that encompasses two core NMD genes: SMG5 SMG7 PMF1 GON4L KDM6B Conclusions NMD efficiency is variable across human tissues, and it is additionally variable across individuals and tumors thereof due to germline and somatic genetic alterations. Supplementary Information The online version contains supplementary material available at 10.1186/s13059-025-03727-y. http://dx.doi.org/10.13039/100010661 Horizon 2020 Framework Programme 965193 Copenhagen University Open access funding provided by Copenhagen University pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement yes pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes issue-copyright-statement © BioMed Central Ltd., part of Springer Nature 2025 Background Nonsense-mediated mRNA decay (NMD) is a quality-control mechanism that degrades mRNAs containing premature termination codons (PTCs), which can arise from nonsense mutations, frameshift mutations, or aberrant splicing events [ 1 3 4 6 7 7 In mammals, the NMD pathway primarily distinguishes between PTCs and normal stop codons through a mechanism linked to the splicing process and translation. Based on various targeted experiments that yielded this mechanistic understanding, as well as on large-scale genomic analyses of PTCs in transcriptomes, genomic rules for NMD detection or evasion were identified [ 8 10 8 11 Furthermore, non-mutated endogenous NMD targets exhibit specific features that can trigger NMD [ 5 6 12 14 15 16 12 17 18 However, the known NMD features are not perfect predictors of observed NMD efficiency of PTC [ 11 12 19 20 20 22 23 24 25 26 27 28 29 One genetic disease with many proposed links with NMD is cancer. NMD may exhibit either pro-tumor or tumor suppressor functions, as a function of cell type, the genetic context and tumor microenvironment [ 30 UPF1 31 37 38 39 UPF1/2 SMG1/6/7 40 40 Approximately 30% of inherited diseases, as well as the majority of cancers (due to mutations in tumor suppressor genes (TSGs)), are caused by PTCs resulting from frameshift mutations or nonsense variants [ 41 42 11 28 43 45 11 Additionally, NMD was considered in therapeutic contexts: it is a determinant in the efficacy of cancer immunotherapy, where only those frameshift mutations that evade NMD predict a positive immunotherapy response [ 11 44 46 47 48 50 If there were variability in NMD efficiency across individuals and/or tissues, it would impact the genetic disease phenotype as well as cancer evolution, and potentially impact on options for treatments, further motivating large-scale studies of differences in NMD efficiency. Despite reports of individual cases, a systematic study of NMD efficiency across human individuals and tissues is lacking, as well as the understanding of its mechanistic basis. Here, we address this gap by assessing NMD efficiency genome-wide. To this end, we deployed two statistical methodologies, measured globally for each individual and compared across individuals or tissues (see schematic in Fig. 1 Fig. 1 Variability and determinants of NMD efficiency across human tissues, tumors, and individuals. NMD: nonsense-mediated mRNA decay. ETG: endogenous NMD target gene method. ASE: allele-specific expression. CNA: copy number alterations. pLoF: putative loss-of-function. TCGA: The Cancer Genome Atlas project, GTex: Genotype-Tissue expression project. WES: whole-exome sequencing. iNMDeff: individual-level NMD efficiency. TSGs: tumor suppressor genes Results Individual-level quantification of NMD efficiency We quantified the individual-level NMD efficiency (iNMDeff) by utilizing matched RNA-seq and whole-exome sequencing (WES) data from two cohorts: (i) tumor tissues in The Cancer Genome Atlas (TCGA), comprising 9,766 tumor samples from 33 different cancer types, and (ii) normal tissues from the Genotype-Tissue Expression (GTex) consortium, consisting of 979 individuals across 56 tissues, totaling 17,382 samples (with a median of 19 tissues per donor). We devised two orthogonal methodologies to estimate iNMDeff in each tumor or normal sample (Additional File 1: Fig. S1A). Both are implemented using a negative binomial regression (see Methods Methods Endogenous target gene (ETG) method We started with a set of genes that had been experimentally identified as endogenous NMD targets, collated from various studies that perturbed NMD activity in human cell lines [ 5 6 13 14 51 Methods Methods Methods e We calculated the iNMDeff for the different NMD gene sets from each study separately (see Methods 13 5 6 51 Allele-specific expression (ASE) method We used exonic coding germline variants (population minor allele frequency, MAF, < 20%) to define three variant sets: (i) “NMD-triggering PTCs” resulting from nonsense variants and from frameshifting indels; (ii) “NMD-evading PTCs” also resulting from nonsense and indels; (iii) synonymous variants. The latter two were used as negative control sets. For each variant, the mutated allele counts observed in RNA-seq reads were used as NMD target levels and the wild-type allele counts at the same locus were used as control levels. We calculated the iNMDeff for each individual using the three aforementioned NMD variant sets separately. Similarly as in the ETG method, all variants within the individual were pooled to estimate the genome-wide iNMDeff, obtained from the regression coefficient of the indicator variable stating whether the variants are either mutated (1) or wild-type (0) (see Methods e In summary, we computed the NMD efficiency for each individual—iNMDeff—multiple times, varying the NMD gene/variant set used, in TCGA (Additional File 2: Table S1) and in GTex (Additional File 2: Table S2) cohorts; including the negative controls, this amounted to 11 NMD gene sets for the ETG method, and 3 NMD variant sets for the ASE method. Henceforth, the ETG gene sets and the ASE variant sets will be collectively referred to as “NMD sets”. Robustness of the individual-level NMD efficiency estimates We focused on the ETG sets generated by combining genes from multiple studies—the stringent “NMD Consensus” and the permissive “NMD All” gene sets—while the ETG iNMDeff for the rest of the NMD gene sets are detailed in Additional File 1: Fig. S2A (TCGA) and Additional File 1: Fig. S2B-C (GTex). In TCGA and GTex, the iNMDeff estimates from the ETG method (Fig. 2 2 p U p 2 Fig. 2 Individual-level and tissue-level quantification of variable NMD efficiency . A B C RP9P GAS5 D Methods UPF1 P E F To further support the concept of ETG method for estimating iNMDeff, we compared the iNMDeff estimates (from “NMD Consensus” set) with the expression of two well-known NMD target genes, RP9P GAS5 5 13 RP9P GAS5 2 UPF1 UPF2 UPF3A UPF3B SMG1 SMG5 SMG6 SMG7 SMG9 SMG8 RP9P GAS5 UPF3A ( SMG8 SMG9 52 52 MAGOH RBM8A EIF4A3 CASC3 To validate our ETG method for iNMDeff estimation, we sourced RNA-seq data from three cell lines (HeLa, HepG2, K562) from different studies [ 5 53 54 Methods Methods UPF1 2 UPF1 p n p n p n UPF1 UPF1 PRO-seq analysis of nascent RNA transcripts from three cell lines [ 55 56 Next, as a test of reliability of the ASE iNMDeff estimates, we considered the differences in distribution of efficiency across the 3 sets of variants with different expected NMD efficiency (Fig. 2 p U 2 To illustrate the ASE iNMDeff estimation, we present examples of raw allele-specific mRNA expression counts at PTC variant loci in two representative colon adenocarcinoma MSI (COAD_MSI) tumors from TCGA (Fig. 2 Methods Agreement between the two methods to estimate NMD efficiency If both ETG and ASE methods are reflecting the true NMD activity of the individual, then a correlation between the two iNMDeff estimates would be anticipated. We proceeded to estimate pan-cancer and pan-tissue correlations between iNMDeff for ASE (using “NMD-triggering PTCs” variant set) and ETG (using “NMD Consensus” set) (Additional File 1: Fig. S4A-B), revealing a statistically significant correlation (Pearson p That ETG and ASE method agree well is seen upon stratifying the various samples by bins of iNMDeff. The top decile (samples with lowest ASE iNMDeff) of TCGA patients has a median scaled ETG iNMDeff of − 0.19, while the bottom decile (samples with highest ASE iNMDeff) has a median scaled ETG iNMDeff of 0.20 (difference at p U p 2 We also tested correlations between ASE iNMDeff and ETG iNMDeff and other biological covariates or technical variables, including considering separately our NMD gene/variant sets. The “NMD Consensus” ETG gene set correlates the most to the ASE iNMDeff (Additional File 1: Fig. S4A-B and S6B-C), and thus we used it as the default ETG method gene set (List of transcripts in Additional File 2: Table S4). In summary, we developed two genomic methodologies for quantifying individual-level NMD efficiency—the ASE and ETG methods—which rely on RNA-seq signal in germline NMD-triggering PTCs variants, and in the “NMD Consensus” experimentally determined set of NMD target genes, for ASE and ETG methods, respectively. We demonstrated the robustness of these methods by various approaches, allowing us to use the ASE and the ETG method to investigate variation in iNMDeff across different human tissues and cancer types. Significant variability in NMD efficiency across human tissues and individuals Assessing inter-tissue variability of NMD efficiency Next, we applied our data set of iNMDeff estimates for 27,148 different tumoral and normal tissue samples to rigorously test the hypothesis that NMD efficiency varies across human tissues more than expected at chance. We grouped the iNMDeff estimates by cancer types in TCGA (Additional File 1: Fig. S7A), and by type of normal tissue in GTex (Additional File 1: Fig. S7B), and tested for differences between the tissues using a randomization test (see Methods 3 Fig. 3 Significant variability in NMD efficiency across human tumors, normal tissues, and individuals. A Methods B p C,D C D E F E The test was applied across both ASE and ETG estimated iNMDeff in the TCGA and GTex cohorts. We observed a significant, moderate variability deviation across both cancerous tissues in TCGA, and across normal tissues in GTex (Fig. 3 p t p p p A recent study suggested no differences in NMD efficiency between human tissues [ 57 57 p p Significant differences between tissues in NMD efficiency To identify which tissues and cancer types have the most and least efficient NMD and if their differences from other tissues are significant (Additional File 1: Fig. S7A-B), we compared the variation in iNMDeff within each specific tissue to the inter-tissue variation. We devised a statistic of Tissue-wise iNMDeff Deviation (TND, Additional File 2: Table S6-S7), with a baseline and a statistical significance derived from a randomization test (see Methods 3 3 p 3 58 The Pan-GI tissues displayed the highest iNMDeff in comparison to randomized values, i.e. positive TND, replicated across both the ETG and ASE NMD methods and in both TCGA and GTex cohorts. Specifically in TCGA (Fig. 3 p 3 p p p p p p 3 In contrast to the Pan-GI, tissues classified as Pan-reproductive generally exhibited lower iNMDeff (Fig. 3 p p p p p p For breast normal tissue, a slightly lower trend towards lower iNMDeff was observed in ETG (non-significant in ASE), aligning with trends in TCGA for breast invasive carcinoma in the basal subtype and the normal-like subtype (Fig. 3 Analysis of Pan-squamous and Pan-kidney tissues overall did not yield significant and/or consistent results across the two NMD methods, in either TCGA tumors or GTex tissues (Fig. 3 As an additional approach to assess if NMD efficiency varies across tissues, we created a linear model predicting iNMDeff, including tissue or cancer type, and other covariates (see Methods 2 Lower NMD efficiency in the tissues of the nervous system Notably, the Pan-nervous group of tissues exhibited lower observed iNMDeff (Additional File 1: Fig. S7A-B) compared to randomized expectations (Fig. 3 p p 3 p p p p Next, we hypothesized that different cell types within the nervous system might have different NMD efficiencies. To determine if the strong reduction in iNMDeff observed in normal and cancerous brain tissues is specifically linked to neuronal cells or to glial cell types, we utilized cellular composition deconvolutions from GTex tissues bulk RNA-seq data, as estimated by Donovan et al. [ 59 3 3 In TCGA tumor samples, we performed a deconvolution using the UCDBase 60 Methods 61 3 3 As an additional analysis, we assessed the expression of the neuron-specific marker RBFOX3 62 p p AQP4 63 p p In sum, our analysis underscores the significant variability of NMD efficiency across tissues, with high iNMDeff in digestive tract tissues, and low iNMDeff in the reproductive and nervous system tissues, the latter being associated with neuron content of the particular tissue. Extensive inter-individual variation of NMD efficiency Having established there exist significant differences in NMD efficiency between human tissues, we next asked whether NMD efficiency is variable between different individuals, compared to a baseline variation between different variants within the same individual. For this, we derived the measure of NMD efficiency for a set of ASE PTCs (termed pNMDeff for PTC NMD efficiency, as detailed in Methods) in the TCGA separately for somatic and germline variants, and additionally for GTex germline variants. Next, we compared the intra-individual variation (different PTCs in the same individual) with a randomized baseline, and then the inter-individual variation (same PTC across individuals) with a control randomization (Additional File 1: Fig. S11C). The randomization controls display higher variances than either inter-individual pNMDeff (excess variance = 0.83–1.01 across the three datasets, p p 1 8 As an additional statistic to support this, when examining the Spearman correlations of pNMDeff between PTCs (Additional File 1: Fig. S11D): the randomly selected pairs of samples for the same PTC (inter-individual) had a notably higher correlation than randomized controls, and similarly so for the randomly selected pairs of different PTCs within individuals (intra-individual) ( p Somatic pan-cancer CNA signatures are associated with NMD efficiency A comprehensive analysis of genetic associations between somatic mutations and iNMDeff across TCGA tumors, analyzing over 6.4 million tests across various cancer and NMD-related genes (see List in Additional File 2: Table S9) and cancer types, revealed only two significant associations: a missense variant in the TLX1 CDH1 We next proceeded to test associations of iNMDeff with somatic copy number alterations (CNAs). Given that CNAs often manifest as broader alterations affecting many neighboring genes up to an entire chromosome arm, we devised a custom method for somatic CNA association analysis. Instead of testing the gene-level CNA associations, which displayed inflation in our QQ plots (Additional File 1: Fig. S13A-B), possibly because of extensive genetic linkage between CNA of neighboring genes, our method considers recurrent large-scale, multi-gene CNAs as monolithic units. To do so, we performed a sparse principal component analysis (sparse-PCA) on the pan-cancer gene-level CNA data (see Methods Methods 4 Fig. 4 Somatic pan-cancer CNA signatures are associated with NMD efficiency. A Methods B X Y C Methods P U D SMG5 E SMG5 RBM8A SF3B4 INTS3 SMG5 INTS3 PMF1 SMG5 F SMG5 RBM8A SF3B4 INTS3 SF3B4 RBM8A 64 Chromosome 1q somatic copy number gain associates with reduced NMD efficiency To further examine these three recurrent CNA signatures, we categorized individuals based on their scores for each CNA-PC. For CNA-PC3, individuals in group “High” predominantly exhibited an arm-level gain of chromosome 1q (gene dosage GISTIC scores ~ 1, Fig. 4 4 p p To validate this 1q somatic CNA gain association with NMD efficiency in an additional data set, the GTex is not Suitable since it does not contain somatic alterations. Instead, we used the transcriptomic and CNA data of 1450 human cell lines from the Cancer Cell Line Encyclopedia (CCLE) [ 65 Methods 2 4 p p p We next asked which cancer types were most influenced by the iNMDeff changes Linked with chromosome 1q CNA gains. To study this, we analyzed the distribution of iNMDeff in individuals across the Low/Mid/High groups, for the identified CNA-PC signatures, considering each cancer type separately (Additional File 1: Fig. S18A). BRCA, liver hepatocellular carcinoma (LIHC), cholangiocarcinoma (CHOL), and LUAD had over 50% of their samples falling into group “High” for CNA-PC3, indicating that 1q gains are common in breast, Liver, and lung cancers. This is also reflected in their iNMDeff. For instance, for 62% of LUAD samples that had a 1q gain, two-thirds (67%) of those also had a lower ETG iNMDeff than the median ETG iNMDeff across the LUAD samples with no gain. These 1q gains were proposed to be selected because they increase dosage of the MDM4 66 67 TP53 68 . When examining the more localized 1q21-23.1 amplification represented by CNA-PC86, 10–13% of the tumors from BRCA, LUAD, and LIHC were found in Group “High” (Additional File 1: Fig. S18B), and associated with reduced iNMDeff. Furthermore, other cancers, including uterine carcinosarcoma (UCS), lung squamous cell carcinoma (LUSC), OV, and skin cutaneous melanoma (SKCM), also exhibited high incidences of both these recurrent 1q gain CNA-PC3 and PC86 (Additional File 1: Fig. S18A-B). We note this narrower CNA segment does not include the MDM4 BCL9 ARNT SETDB1 SF3B4 Identifying NMD-associated genes via focal CNA analysis While CNA gains can affect numerous dosage-sensitive genes in one event, only a subset of the genes or a single gene within the CNA segment are expected to be directly implicated in the observed phenotype, here the NMD deficiency. Within the 1q arm reside three known NMD factors and two NMD-related genes identified in experimental and computational studies [ 69 70 RBM8A SMG5 SMG7 SF3B4 INTS3 4 4 SMG7 To narrow down potential candidate NMD-modulating genes within this gene-dense region, we employed two scoring criteria across all genes from chr 1q. First, we calculated the correlation between gene expression—presumably the downstream effect of the CNA relevant to the phenotype—and ETG/ASE iNMDeff. Second, as a supporting test for prioritization, we assessed the correlation between gene expression and CNA. The correlation between these two scores (Fig. 4 4 INTS3 SMG5 SMG5 To pinpoint the potential causal gene(s), we considered genetic interactions inferred from gene-level CRISPR screening data obtained from the Achilles Project [ 71 onion 64 Methods UPF1 UPF2 UPF3B SMG1 Therefore, we clustered and visualized these codependency CRISPR scores involving our set of candidate genes (18 “Candidates” and 4 “Candidates NMD”), 21 “NMD-related” genes, and 18 random negative “Control” genes on chr 1q but outside the 1q21.1–23.1 region (see Methods KIAA0907 SF3B4 RBM8A SMG5 SMG6 SMG7 UPF1 UPF3B 64 4 PMF1 GON4L SMG5 PMF1 GON4L SMG6 SMG7 SMG5 SMG7 VPS72 PRPF3 SMG5 In a more detailed quantitative analysis, we examined all 274 genes within 1q21.1–23.1. For each, we computed the mean CRISPR codependency scores with 10 core NMD factor genes and compared these with the mean CRISPR score for the same gene with the previous 18 random negative control genes on 1q. We identified 14 genes with FDR < 5% (one-sided Mann–Whitney U SMG5 RBM8A SF3B4 PRPF3 U GON4L VPS72 PMF1 PMF1 GON4L Additionally, we analyzed the CNA-PC52 signature, also associated with reduced NMD efficiency and characterized by low-level gains in chromosome 2q31.1-2q36.3. This region, commonly altered in several cancer types (especially testicular germ cell tumors), contains four NMD-related genes ( CWC22 SF3B1 NOP58 FARSB Rare germline variant association analysis identifies genes associated with NMD efficiency We hypothesized that an additional cause for inter-individual variation in NMD efficiency could be germline genetic variation across individuals, affecting NMD-relevant genes. To test this, we conducted a gene-based rare variant association study (RVAS, see schematic from Fig. 5 72 Methods Fig. 5 Rare deleterious germline variants are associated with NMD efficiency. A B C LAMC1 D KDM6B We defined three stringency thresholds for determining putative loss-of-function (pLoF) for the rare germline variants, i.e. those with a MAF < 0.1%. One threshold involved only NMD-triggering PTC variants, and the other two additionally included the predicted deleterious missense variants using CADD scores [ 73 We tested all genes in which at least 2 individuals carried a rare pLoF variant, for the three pLoF stringency levels, using the two iNMDeff estimation methods, ASE and ETG, and correcting by potential confounder variables (see Methods A total of 850,721 tests associating iNMDeff with rare germline variants were conducted in GTex and 221,613 in TCGA, after excluding dataset-tissue pairs to prevent inflation (lambda ≥ 1.5). The number of tests in GTex was higher due to multiple tissue samples analyzed per individual, allowing separate testing of the same gene across various tissues. Across the three variant sets, two NMD methods, and two cohorts, considering all directions of validation, we identified 48 tissue-specific significant associations (nominal FDR ≤ 2%) that were successfully replicated. This is significantly more compared to the 24 significant associations found by randomizing the iNMDeff estimates ( p Out of these replicated associations, 27 were discovered in GTex and validated in TCGA. These hits span 10 unique individual gene-tissue type pairs clustered in 2 matched-tissues: thyroid (4) and brain (6) (Fig. 5 5 We further calibrated these nominal FDRs by comparing against a distribution of FDRs obtained from running SKAT-O on a randomization of the iNMDeff estimates. This resulted in estimates of empirical FDR (Additional File 1: Fig. S23A), where the nominal FDR of 2% corresponded to a conservatively estimated empirical FDR threshold of ~30%, calculated as 3 replicated hits from randomized iNMDeff data, versus 10 hits obtained from our observed iNMDeff values. The 10 gene-tissue pair associations that met our criteria are detailed in Fig. 5 To assess the effect size of the associations for 10 replicated genes and determine their direction of effect on iNMDeff, we utilized a gene-burden test through general linear regression (see Methods KDM6B 5 KDM6B KDM6B From the 6 brain-identified replicated genes (Fig. 5 COL19A1 NUP153 KDM6B NMD efficiency impacts somatic selection and cancer patient survival Previous research [ 11 45 Methods For TSGs, we first checked missense mutations, which normally do not trigger NMD. There was no significant difference in driver gene selection between high and low iNMDeff individual groups, defined either by the ETG method (Fig. 6 p p p 6 p 6 74 75 Fig. 6 Individual-level NMD efficiency modulates somatic selection in tumor suppressor genes and impacts progression-free survival (PFS) and response to immunotherapy. A B P C–E B C D p F,H 76 E F G I Y n X p We identified strong iNMDeff-associated PTC selection in some individual genes particularly SMAD4 TP53 NMD efficiency is associated with overall survival of cancer patients In light of our previous findings that PTC-level NMD efficiency can modulate phenotype severity of genetic diseases [ 11 Methods After applying FDR correction to all 960 tests (480 FDR adjusted meta-p combining ETG and ASE estimates of iNMDeff), we identified 17 in 960 significant tests at a nominal FDR of 5%, compared to 23 of the 9600 randomized tests, yielding an empirical FDR of 16% by randomization (results for individual percentiles given in Additional File 2: Table S16). The significant results spanned four cancer types: SKCM (median FDR meta-p = 0.78%, median hazard ratio (HR) = 1.61), ESCA_ac (FDR = 3.2%, HR = 2.22), PRAD (FDR = 2.8%, HR = 0.11), and LUAD (FDR = 0.75%, HR = 3.49). Of note, in ESCA_ac and LUAD, we were unable to calculate the Cox model for ASE at due to insufficient data; thus, the reported meta-p reflects only the ETG method. In PRAD, higher iNMDeff correlates with increased survival (Additional File 1: Fig. S27A-B). Roles of NMD in carcinogenesis are two-fold, where NMD can boost some tumor-promoting but also some tumor-suppressive mechanisms [ 30 77 1 46 78 79 6 NMD efficiency predicts progression-free survival in treated patients As another test of the impact of NMD efficiency on patient outcomes, we stratified patients based on the type of treatment and focused on progression-free survival (PFS), considering treatments separately and comparing the top 20% of individuals with the highest iNMDeff against the lowest 20%. For SKCM patients lacking available treatment data (Fig. 6 p p However, a difference emerged among patients who received immunotherapy (along with a maximum of one chemotherapy treatment; Fig. 6 p n n Next, we asked if this effect of NMD efficiency on survival is particular to immunotherapy, or it extends also to other types of therapies. Among SKCM patients treated with chemotherapy, but not immunotherapy (Fig. 6 p p p We next asked if other cancer types apart from SKCM show associations between iNMDeff and response to chemotherapy in terms of PFS. Again, from within the patients receiving chemotherapy, we compared the high iNMDeff against the low iNMDeff group. Indeed, we identified four additional cancer types at an FDR-adjusted meta- p Association of iNMDeff with immunotherapy response in diverse cancer types To validate the association of NMD efficiency with immunotherapy response, we analyzed independent datasets that had both RNA-seq and WGS/WES available: (i) Liu et al. [ 76 80 81 Methods The KM curves for PFS (Fig. 6 6 p p 6 p p 6 p p p p p Methods Tumor mutation burden (TMB) is a well-established predictor of immunotherapy response, likely due to its association with neo-antigen content. In a predictive model, we combined TMB with iNMDeff, aiming to classify immunotherapy responses into responders versus non-responders (see Methods 82 n n n n 83 The TMB model’s predictive accuracy was significantly enhanced by including iNMDeff, showing a 7.4% mean increase (for both ASE and ETG) in correctly classified patients compared to a TMB-only model, averaging across the datasets (F i 6 In conclusion, individual-level NMD efficiency can impact cancer patient survival: there was a trend of reduced PFS in immunotherapy-treated patients with high NMD efficiency, observed consistently across 3 cancer types. Furthermore, including iNMDeff improves predictive models of immunotherapy response drawing on TMB. For context, we note there is a strong prior that a globally more efficient NMD in a patient would hinder immunotherapy, based on recent work associating NMD inactivity upon individual indel mutations in a tumor and immunotherapy response [ 11 44 Discussion In our study, we quantified individual-level NMD efficiency—iNMDeff—in large-scale RNA-seq and germline WES data from normal tissues and cancers, totalling ~ 27,000 samples. We considered both normal and mutated transcripts as tools to assess the variation in NMD efficiency across individuals and tissues (Fig. 2 We found a significant variability of iNMDeff across normal tissues and cancer types (Fig. 3 40 84 UPF1 85 86 46 In contrast to the digestive tract, we observed that reproductive and nervous system tissues exhibited lower iNMDeff than other tissues, particularly so for neurons therein (as estimated from differential analysis of brain regions and glioma subtypes). A previous study in mice monitored NMD activity through the expression levels of a single gene, MEN1 23 A recent study of ASE in GTex healthy tissues reported only modest NMD differences between tissues; however, it did rank the brain samples at the low end of NMD efficiency [ 57 87 UPF1 88 89 90 91 92 93 94 95 UPF1 39 In addition to variation between tissues, variation in NMD efficiency between individuals is significant. Some of this is explained by association with somatic genetic variants in genes TLX1 CDH1 96 99 100 4 MDM4 TP53 66 MCL-1 101 102 SMG5 SMG7 RBM8A INTS3 SF3B4 PMF1 103 ) GON4L 104 PRPF3 105 VPS72 106 In addition to 1q gains, further the chromosome 2q gains (found in CNA-PC52) that we find associated with NMD efficiency are interesting to follow-up, since this arm encompasses candidate genes CWC22 SF3B1 SF3B1 U2AF1 30 107 108 AQR SF3B1 SF3B4 CDC40 109 SF3B4, PRPF3, CWC22, SF3B1 In line with this, a previous study identified significant enrichment of germline copy number variants of NMD genes in neurodevelopmental disorder patients [ 110 UPF2 RMB8A UPF2 RMB8A As for somatic variation, it was suggested that tumor evolution favors mutations and CNA co-occurring in NMD factor genes [ 20 52 In addition to somatic variants in tumors, also the rare deleterious germline variants can affect NMD efficiency in at least the thyroid and brain. We identified 10 genes with diverse functions, potentially affecting NMD efficiency indirectly (Fig. 5 CRTC1 111 NUP153 112 KDM6B 113 114 115 116 SF3B4 Next, our analysis suggests various associations of differential NMD efficiency to tumor evolution (Fig. 6 SMAD4 TP53 APC 117 119 6 74 75 In support of the idea that manipulating NMD may treat some cancers, we observed that the naturally variable NMD efficiency is associated with cancer survival phenotypes (in accord with our recent population genomic study arguing that NMD modulates phenotype severity of various heritable genetic diseases [ 11 30 77 6 11 44 6 40 120 We acknowledge that our ETG and ASE metrics represent indirect measures of NMD efficiency rather than direct assessments of the NMD degradation process. Since RNA-seq provides static snapshots of transcript abundance rather than dynamic measurements of transcription and degradation rates, our calculated ratios may be influenced by tissue-specific differences in transcriptional activity of NMD-targeted genes. However, PRO-seq analysis of nascent RNA transcription from three cell lines showed no significant differences in transcription initiation rates between NMD and non-NMD target transcripts, including when stratified by brain expression levels (Additional File 1: Fig. S3B), reassuring that our ETG measurements indeed reflect NMD activity rather than transcription rates (see Additional File 3: Text S1). In summary, our study reveals extensive variation in NMD efficiency across individuals, tissues, and tumors, resulting in part from specific genetic alterations, and underscores the potential of NMD efficiency estimates as a predictive biomarker for cancer treatment using immunotherapy and/or NMD inhibition. Future studies incorporating functional assays and direct measurements of mRNA decay kinetics would be valuable to validate these findings and assess the broader applicability of our approach as a potential biomarker. Conclusions This comprehensive analysis of individual-level NMD efficiency across ~ 27,000 samples reveals substantial tissue-specificity and inter-individual variation in NMD activity. Digestive tissues, particularly MSI cancers, exhibit elevated NMD efficiency, while reproductive and nervous system tissues show reduced activity. This variation is partially driven by genetic alterations, including copy number gains affecting multiple NMD and splicing factors, and rare inherited germline variants. Variable NMD efficiency shapes tumor evolution by influencing selective pressures on tumor suppressor genes and predicts patient responses to both immunotherapy and chemotherapy. These findings position individual-level NMD efficiency as a promising biomarker for personalized treatment strategies, particularly for identifying cancer patients who may benefit from NMD inhibition therapy. Future validation through direct measurements and clinical studies will be essential to realize the therapeutic potential of these findings. Methods Sequencing data We downloaded matched tumor and normal whole-exome sequencing (WES) bam fastq 121 https://portal.gdc.cancer.gov/ 122 https://gdac.broadinstitute.org/ 123 124 VCF https://anvilproject.org/ 65 https://depmap.org/portal/download/all/ Clinical and other data sources TCGA cancer cluster subtypes, determined based on mRNA non-matrix factorization (NMF), were sourced from the Broad Institute’s GDAC Firehose portal ( https://gdac.broadinstitute.org/) 123 112 113 https://portal.gdc.cancer.gov/) 122 https://www.cbioportal.org/) 125 quanTIseq TIL10 https://tcia.at/home) 126 TCGA cancer type stratification into subtypes The classification of TCGA cancer molecular subtypes was meticulously gathered using functions from the TCGABiolinks PanCancerAtlas_subtypes TCGAquery_subtype Breast invasive carcinoma (BRCA): Classified according to the PAM50 mRNA profiling into five subtypes: Basal, Normal-like, Luminal A (LumA), Luminal B (LumB), and HER2-enriched [ 127 Sarcoma (SARC): Based on histological subtypes [ 128 Bladder urothelial carcinoma (BLCA): Utilized mRNA clustering to divide samples into Basal squamous cell (Basal_scc), Luminal papillary (Lum_pap), and Luminal infiltrated (Lum_inf) subtypes [ 129 Head and neck squamous cell carcinoma (HNSC): Categorized based on RNA-seq data into HPV positive or negative groups [ 130 Colon adenocarcinoma (COAD), stomach adenocarcinoma (STAD), and uterine corpus endometrial carcinoma (UCEC): These cancers were classified into Microsatellite Instability (MSI) or Microsatellite Stable (MSS) [ 131 133 POLE 134 Esophageal carcinoma (ESCA): Classified into esophageal squamous-cell carcinoma (scc) and adenocarcinoma (ac) [ 135 Glioblastoma multiforme (GBM): Subdivided based on the Glioma CpG island methylator phenotype into High (G-CIMP-high) and Low (G-CIMP-low), alongside methylation cluster 6 (LGm6-GBM), Classic-like, and Mesenchymal-like [ 61 Lower grade glioma (LGG): Classified into G-CIMP-high, G-CIMP-low, Classic-like, Mesenchymal-like, PA-like, and 1p/19q codeletion (Codel) [ 61 Alignment and quantification of RNA-seq and ASE In adherence to GTex guidelines ( https://github.com/broadinstitute/gtex-pipeline/tree/master/rnaseq) 136 GRCh38.d1.vd1 STAR 137 RSEM 138 WASP 139 WASP Variant calling and annotations Variant calling in TCGA was done using Strelka2 140 configureStrelkaSomaticWorkflow.py configureStrelkaGermlineWorkflow.py configureStrelkaGermlineWorkflow.py VCF 141 gnomad211_exome 142 VCFs 143 Obtaining NMD target gene sets from various studies We created different gene sets of NMD targets from a range of studies employing both experimental and computational methods, to use in the estimation of ETG iNMDeff: Tani H. et al. [ 6 UPF1 UPF1 Colombo M. et al. [ 5 UPF1 SMG6 SMG7 UPF1 SMG6 SMG7 Karousis E. D. et al. [ 13 Courtney et al. [ 51 Schmidth S.A et al. [ 14 SMG6 The ENSEMBL gene annotation file tags some genes as “nonsense_mediated_decay.” With all this, we created distinct NMD gene sets for each study, with the exception of Schmidt. These sets are named: “NMD Tani,” “NMD Colombo,” “NMD Karousis,” “NMD Courtney,” and “NMD Ensembl.” Additionally, we constructed specific gene sets for “SMG6” and “SMG7” NMD targets. For “SMG6,” we derived the set from the intersection of SMG6 SMG7 Predicting NMD-triggering features for the selection of endogenous NMD targets and controls (ETG method) For each gene within our NMD gene sets from the ETG method, we classified its transcripts into NMD targets and controls based on computationally predicted NMD-triggering features (see schematic on Additional File 1: Fig. S1B), as per ENSEMBL definition. This classification relied on two primary features identified in the literature: (i) the presence of an upstream open-reading frame (uORF) in the 5’ untranslated region (UTR) [ 15 16 12 17 18 To delineate NMD target-control pairs for each gene, our specific criteria is shown in Additional File 1: Fig. S1B. In summary, the criteria for NMD target transcripts were as follows: (i) Presence of both a start codon and a stop codon. (ii) A median transcript expression ( \\documentclass[12pt]{minimal}\n\t\t\t\t\\usepackage{amsmath}\n\t\t\t\t\\usepackage{wasysym} \n\t\t\t\t\\usepackage{amsfonts} \n\t\t\t\t\\usepackage{amssymb} \n\t\t\t\t\\usepackage{amsbsy}\n\t\t\t\t\\usepackage{mathrsfs}\n\t\t\t\t\\usepackage{upgreek}\n\t\t\t\t\\setlength{\\oddsidemargin}{-69pt}\n\t\t\t\t\\begin{document}$$\\text{log}\\left(TPM\\right)$$\\end{document} log T P M \\documentclass[12pt]{minimal}\n\t\t\t\t\\usepackage{amsmath}\n\t\t\t\t\\usepackage{wasysym} \n\t\t\t\t\\usepackage{amsfonts} \n\t\t\t\t\\usepackage{amssymb} \n\t\t\t\t\\usepackage{amsbsy}\n\t\t\t\t\\usepackage{mathrsfs}\n\t\t\t\t\\usepackage{upgreek}\n\t\t\t\t\\setlength{\\oddsidemargin}{-69pt}\n\t\t\t\t\\begin{document}$$\\ge$$\\end{document} ≥ (iii) Presence of either a 3’UTR splice site or \\documentclass[12pt]{minimal}\n\t\t\t\t\\usepackage{amsmath}\n\t\t\t\t\\usepackage{wasysym} \n\t\t\t\t\\usepackage{amsfonts} \n\t\t\t\t\\usepackage{amssymb} \n\t\t\t\t\\usepackage{amsbsy}\n\t\t\t\t\\usepackage{mathrsfs}\n\t\t\t\t\\usepackage{upgreek}\n\t\t\t\t\\setlength{\\oddsidemargin}{-69pt}\n\t\t\t\t\\begin{document}$$\\ge$$\\end{document} ≥ (iv) If multiple transcripts meet the above criteria, the one with the highest 3’ UTR GC content is selected. For control transcripts, the requirements were: (i) Presence of both a start codon and a stop codon. (ii) A median transcript expression ( \\documentclass[12pt]{minimal}\n\t\t\t\t\\usepackage{amsmath}\n\t\t\t\t\\usepackage{wasysym} \n\t\t\t\t\\usepackage{amsfonts} \n\t\t\t\t\\usepackage{amssymb} \n\t\t\t\t\\usepackage{amsbsy}\n\t\t\t\t\\usepackage{mathrsfs}\n\t\t\t\t\\usepackage{upgreek}\n\t\t\t\t\\setlength{\\oddsidemargin}{-69pt}\n\t\t\t\t\\begin{document}$$\\text{log}\\left(TPM\\right)$$\\end{document} log T P M \\documentclass[12pt]{minimal}\n\t\t\t\t\\usepackage{amsmath}\n\t\t\t\t\\usepackage{wasysym} \n\t\t\t\t\\usepackage{amsfonts} \n\t\t\t\t\\usepackage{amssymb} \n\t\t\t\t\\usepackage{amsbsy}\n\t\t\t\t\\usepackage{mathrsfs}\n\t\t\t\t\\usepackage{upgreek}\n\t\t\t\t\\setlength{\\oddsidemargin}{-69pt}\n\t\t\t\t\\begin{document}$$\\ge$$\\end{document} ≥ (iii) Absence of any NMD-triggering features. Lastly, for a transcript to be classified as an NMD target, and a transcript to be its paired control, the ratio of their expressions must be ≤ 0.9. This threshold ensures that the selected NMD target transcripts exhibit lower expression levels compared to their corresponding controls, aligning with the expected impact of NMD-triggering features on transcript stability. To enhance the accuracy of this selection and mitigate the inclusion of potential false positives, we utilized data from cell lines with UPF1 5 53 54 54 It is important to note that not all selected transcript pairs were utilized in our ETG iNMDeff, due to the filterings performed afterwards (see section “Filterings for the ETG method”). Using NMD rules for predicting NMD-triggering vs NMD-evading PTCs (ASE method) For the ASE method, we determined whether a premature termination codon (PTC), resulting from nonsense or indel mutations, is likely to undergo NMD based on its location within the coding sequence (CDS) of the transcript. For indels, we predicted the potential generation of a downstream PTC and identified its exact genomic location with a custom script. To categorize these PTCs as either NMD-triggering or NMD-evading, we relied on established NMD rules [ 8 (i) The 55nt-rule: PTCs positioned ≤ 55 nt downstream from the last base of the penultimate exon are considered NMD-evading. (ii) The last exon rule: PTCs located within the last exon are deemed NMD-evading. (iii) The start-proximal rule: PTCs situated within the first ~200 nucleotides of the transcript are classified as NMD-evading. In scenarios where a transcript had a splice site in the 3’UTR, a PTC that would typically be classified as NMD-evading under the 55nt or last exon rule was instead considered NMD-triggering. This reclassification is due to the presence of an additional EJC located downstream of the PTC. Using this classification, we generated three distinct NMD variant sets for each individual: “NMD-triggering PTCs,” “NMD-evading PTCs,” and “Synonymous.” These sets were specifically designed to accurately estimate the NMD efficiency for each individual, along with its two negative control sets. Filterings for the ETG method To ensure an accurate estimation of ETG iNMDeff, all filtering processes were conducted on a per-individual basis and on all NMD gene sets separately. The following criteria were applied in both TCGA and GTex cohorts: We retained transcripts exhibiting a log 2 \\documentclass[12pt]{minimal}\n\t\t\t\t\\usepackage{amsmath}\n\t\t\t\t\\usepackage{wasysym} \n\t\t\t\t\\usepackage{amsfonts} \n\t\t\t\t\\usepackage{amssymb} \n\t\t\t\t\\usepackage{amsbsy}\n\t\t\t\t\\usepackage{mathrsfs}\n\t\t\t\t\\usepackage{upgreek}\n\t\t\t\t\\setlength{\\oddsidemargin}{-69pt}\n\t\t\t\t\\begin{document}$$\\ge$$\\end{document} ≥ Non-coding transcripts were excluded from the analysis. We discarded transcripts that overlapped with any type of somatic (only in TCGA) or germline truncating mutations (such as nonsense, start loss, nonstop mutations, inframe insertions and deletions, frameshift insertions and deletions, and splice site mutations) as well as those affected by CNAs (only on TCGA). A minimum of 2 pairs of NMD target-control transcripts was required for the estimation of an individual’s NMD efficiency. For all NMD gene sets, except from the “NMD Consensus” set, we randomly selected up to 50 pairs of NMD target-control transcripts. This approach was adopted to streamline the computational process. Filterings for the ASE method Similar to the ETG method, in the ASE approach, all filterings were meticulously carried out on a per-individual basis and for each NMD variant set (“NMD-triggering PTCs,” “NMD-evading PTCs,” and “Synonymous”). The following criteria were applied in both TCGA and GTex cohorts: We retained only those germline heterozygous variants that met the “PASS” threshold in the VCF A minimum total read coverage (sum of WT and MUT alleles count) requirement was set at 5 for nonsense and synonymous mutations, and at 2 for indels. Variants with a MAF > 20% were excluded to avoid confounding effects in the analysis. Common variants are known to exhibit lower NMD efficiency, likely due to evolutionary selection [ 8 11 27 57 144 Variants located in non-coding transcripts or in transcripts consisting of a single exon were excluded. Variants in 331 genes identified as undergoing positive selection were removed [ 145 For variants in genes experiencing negative selection, we employed the loss-of-function observed/expected upper bound fraction (LOEUF) estimate [ 146 We excluded variants co-occurring with any type of somatic truncating mutation (such as nonsense, start loss, nonstop mutations, inframe insertions and deletions, frameshift insertions and deletions, and splice site mutations) in TCGA. This also included variants affected by CNAs in TCGA. Specifically for the “NMD-triggering PTCs” variant set, further exclusions were made: ◦ NMD-evading PTCs (and vice versa). ◦ Frameshift variants that do not predict a downstream PTC. For the “Synonymous” variant set: ◦ We excluded variants overlapping any gene from our “NMD All” gene set to avoid confounding the analysis. In GTex only, if the variant only appeared in one tissue, then it was considered a somatic variant, and not germline, thus discarded. A minimum of 3 germline variant PTCs was required for the estimation of an individual’s NMD efficiency. Additionally, to optimize computational efficiency, we capped the number of variant pairs used in the analysis randomly sampling a maximum of 100. Quantification of individual NMD efficiency (iNMDeff) by a negative binomial regression To estimate individual NMD efficiency (iNMDeff), we employed Bayesian generalized linear models, fitting a negative binomial distribution using “ Stan 147 rstanarm 148 For the ETG method, the model is applied, pooling all filtered transcripts together within a sample, for each of the 11 NMD gene sets (includes the negative control) separately, as follows: \\documentclass[12pt]{minimal}\n\t\t\t\t\\usepackage{amsmath}\n\t\t\t\t\\usepackage{wasysym} \n\t\t\t\t\\usepackage{amsfonts} \n\t\t\t\t\\usepackage{amssymb} \n\t\t\t\t\\usepackage{amsbsy}\n\t\t\t\t\\usepackage{mathrsfs}\n\t\t\t\t\\usepackage{upgreek}\n\t\t\t\t\\setlength{\\oddsidemargin}{-69pt}\n\t\t\t\t\\begin{document}$$\\text{RawTranscriptExp}\\sim \\text{NegBin}(\\upmu ,\\uptheta )$$\\end{document} RawTranscriptExp ∼ NegBin ( μ , θ ) \\documentclass[12pt]{minimal}\n\t\t\t\t\\usepackage{amsmath}\n\t\t\t\t\\usepackage{wasysym} \n\t\t\t\t\\usepackage{amsfonts} \n\t\t\t\t\\usepackage{amssymb} \n\t\t\t\t\\usepackage{amsbsy}\n\t\t\t\t\\usepackage{mathrsfs}\n\t\t\t\t\\usepackage{upgreek}\n\t\t\t\t\\setlength{\\oddsidemargin}{-69pt}\n\t\t\t\t\\begin{document}$$\\text{log}(\\upmu )={\\upbeta }_{0}+{\\upbeta }_{1}\\cdot \\text{NMDtarget}+{\\upbeta }_{2}\\cdot \\text{geneID}+{\\upbeta }_{3}\\cdot \\text{transcriptLength}$$\\end{document} log ( μ ) = β 0 + β 1 · NMDtarget + β 2 · geneID + β 3 · transcriptLength \\documentclass[12pt]{minimal}\n\t\t\t\t\\usepackage{amsmath}\n\t\t\t\t\\usepackage{wasysym} \n\t\t\t\t\\usepackage{amsfonts} \n\t\t\t\t\\usepackage{amssymb} \n\t\t\t\t\\usepackage{amsbsy}\n\t\t\t\t\\usepackage{mathrsfs}\n\t\t\t\t\\usepackage{upgreek}\n\t\t\t\t\\setlength{\\oddsidemargin}{-69pt}\n\t\t\t\t\\begin{document}$$\\text{RawTranscriptExp}$$\\end{document} RawTranscriptExp \\documentclass[12pt]{minimal}\n\t\t\t\t\\usepackage{amsmath}\n\t\t\t\t\\usepackage{wasysym} \n\t\t\t\t\\usepackage{amsfonts} \n\t\t\t\t\\usepackage{amssymb} \n\t\t\t\t\\usepackage{amsbsy}\n\t\t\t\t\\usepackage{mathrsfs}\n\t\t\t\t\\usepackage{upgreek}\n\t\t\t\t\\setlength{\\oddsidemargin}{-69pt}\n\t\t\t\t\\begin{document}$$NMDtarget$$\\end{document} NMDtarget \\documentclass[12pt]{minimal}\n\t\t\t\t\\usepackage{amsmath}\n\t\t\t\t\\usepackage{wasysym} \n\t\t\t\t\\usepackage{amsfonts} \n\t\t\t\t\\usepackage{amssymb} \n\t\t\t\t\\usepackage{amsbsy}\n\t\t\t\t\\usepackage{mathrsfs}\n\t\t\t\t\\usepackage{upgreek}\n\t\t\t\t\\setlength{\\oddsidemargin}{-69pt}\n\t\t\t\t\\begin{document}$$\\text{geneID}$$\\end{document} geneID \\documentclass[12pt]{minimal}\n\t\t\t\t\\usepackage{amsmath}\n\t\t\t\t\\usepackage{wasysym} \n\t\t\t\t\\usepackage{amsfonts} \n\t\t\t\t\\usepackage{amssymb} \n\t\t\t\t\\usepackage{amsbsy}\n\t\t\t\t\\usepackage{mathrsfs}\n\t\t\t\t\\usepackage{upgreek}\n\t\t\t\t\\setlength{\\oddsidemargin}{-69pt}\n\t\t\t\t\\begin{document}$$\\text{transcriptLength}$$\\end{document} transcriptLength By comparing each NMD target transcript against its paired control from the same gene, we establish an internal control. This approach effectively accounts for potential confounders affecting trans-gene expression levels. For instance, CNAs or transcription factors might alter the expression of one transcript without affecting the other. Such discrepancies are particularly pertinent if comparing transcripts across different genes. Although we already exclude genes overlapping with CNAs, this internal control further ensures the robustness of our analysis against such confounding factors. For the ASE method, the model is applied, pooling all filtered germline PTCs together within a sample, for each of the 3 NMD variant sets (includes the negative control) separately, as follows: \\documentclass[12pt]{minimal}\n\t\t\t\t\\usepackage{amsmath}\n\t\t\t\t\\usepackage{wasysym} \n\t\t\t\t\\usepackage{amsfonts} \n\t\t\t\t\\usepackage{amssymb} \n\t\t\t\t\\usepackage{amsbsy}\n\t\t\t\t\\usepackage{mathrsfs}\n\t\t\t\t\\usepackage{upgreek}\n\t\t\t\t\\setlength{\\oddsidemargin}{-69pt}\n\t\t\t\t\\begin{document}$$\\text{RawAlleleExp}\\sim \\text{NegBin}(\\upmu ,\\uptheta )$$\\end{document} RawAlleleExp ∼ NegBin ( μ , θ ) \\documentclass[12pt]{minimal}\n\t\t\t\t\\usepackage{amsmath}\n\t\t\t\t\\usepackage{wasysym} \n\t\t\t\t\\usepackage{amsfonts} \n\t\t\t\t\\usepackage{amssymb} \n\t\t\t\t\\usepackage{amsbsy}\n\t\t\t\t\\usepackage{mathrsfs}\n\t\t\t\t\\usepackage{upgreek}\n\t\t\t\t\\setlength{\\oddsidemargin}{-69pt}\n\t\t\t\t\\begin{document}$$\\text{log}(\\upmu )={\\upbeta }_{0}+{\\upbeta }_{1}\\cdot \\text{NMDtarget}+{\\upbeta }_{2}\\cdot \\text{geneID}$$\\end{document} log ( μ ) = β 0 + β 1 · NMDtarget + β 2 · geneID \\documentclass[12pt]{minimal}\n\t\t\t\t\\usepackage{amsmath}\n\t\t\t\t\\usepackage{wasysym} \n\t\t\t\t\\usepackage{amsfonts} \n\t\t\t\t\\usepackage{amssymb} \n\t\t\t\t\\usepackage{amsbsy}\n\t\t\t\t\\usepackage{mathrsfs}\n\t\t\t\t\\usepackage{upgreek}\n\t\t\t\t\\setlength{\\oddsidemargin}{-69pt}\n\t\t\t\t\\begin{document}$$RawAlleleExp$$\\end{document} RawAlleleExp \\documentclass[12pt]{minimal}\n\t\t\t\t\\usepackage{amsmath}\n\t\t\t\t\\usepackage{wasysym} \n\t\t\t\t\\usepackage{amsfonts} \n\t\t\t\t\\usepackage{amssymb} \n\t\t\t\t\\usepackage{amsbsy}\n\t\t\t\t\\usepackage{mathrsfs}\n\t\t\t\t\\usepackage{upgreek}\n\t\t\t\t\\setlength{\\oddsidemargin}{-69pt}\n\t\t\t\t\\begin{document}$$NMDtarget$$\\end{document} NMDtarget \\documentclass[12pt]{minimal}\n\t\t\t\t\\usepackage{amsmath}\n\t\t\t\t\\usepackage{wasysym} \n\t\t\t\t\\usepackage{amsfonts} \n\t\t\t\t\\usepackage{amssymb} \n\t\t\t\t\\usepackage{amsbsy}\n\t\t\t\t\\usepackage{mathrsfs}\n\t\t\t\t\\usepackage{upgreek}\n\t\t\t\t\\setlength{\\oddsidemargin}{-69pt}\n\t\t\t\t\\begin{document}$$geneID$$\\end{document} geneID In both NMD methods, the coefficient assigned to the \\documentclass[12pt]{minimal}\n\t\t\t\t\\usepackage{amsmath}\n\t\t\t\t\\usepackage{wasysym} \n\t\t\t\t\\usepackage{amsfonts} \n\t\t\t\t\\usepackage{amssymb} \n\t\t\t\t\\usepackage{amsbsy}\n\t\t\t\t\\usepackage{mathrsfs}\n\t\t\t\t\\usepackage{upgreek}\n\t\t\t\t\\setlength{\\oddsidemargin}{-69pt}\n\t\t\t\t\\begin{document}$$NMDtarget$$\\end{document} NMDtarget Interestingly, both iNMDeff methods suggest a possible differential NMD activity across tissues or individuals, and the differences in their NMD estimates might reflect differently active NMD subpathways or other types of biological or technical variation. The ETG method, based on transcript-level expression, offers a high data point count per individual, crucial for estimating iNMDeff accurately, but faces challenges like confounding factors such as CNAs and varying expression levels among transcripts of a gene, which we attempted to address with rigorous filtering and pairing NMD-target transcripts with appropriate controls. Conversely, the ASE method, while robust to confounders due to its internally controlled quantification of the two alleles within the same transcript, is limited to more highly expressed genes and thus provides fewer data points, leading to potential noise issues (see Additional File 3: Text S2 for discussion). We used both methods as independent approaches, ensuring a more reliable analysis of NMD efficiency across individuals. Validation and robustness of ETG iNMDeff estimates Using cell lines with UPF1 knockdown We validated our ETG method by analyzing NMD efficiency in UPF1 UPF1 GSE152435 n GSE86148 n 5 53 GSE88148 n GSE88466 n 54 GSE88140 n GSE88266 n 54 STAR RSEM For NMD efficiency estimation, we applied our NMD Consensus gene set, comprising 130 target-control gene pairs (260 total transcripts, see Additional File 2: Table S4), and used negative binomial regression to calculate cell line NMD efficiency (cNMDeff). This approach paralleled our iNMDeff estimation methodology (see section “Quantification of individual NMD efficiency (iNMDeff) by a negative binomial regression”). By using external datasets from controlled experiments, we ensure that confounders (e.g., tissue, subtype, environment, and genetic background) do not play a role. As an additional analysis to confirm the robustness of the ETG Consensus NMD gene set, we iteratively removed one gene at a time from our NMD Consensus set and repeated the analysis with the 129 remaining genes. Therefore, this process was repeated 130 times (once for each gene in the set). Differential transcription rates as a confounding factor using PRO-seq To investigate potential confounding effects of transcription rates on NMD efficiency estimates, we analyzed PRO-seq data from three cell lines: SH-SY5Y (neuroblastoma, GSE214243 n 55 GSM5169137 n 56 GSM5169140 n 56 We quantified promoter activity by measuring PRO-seq signals near the transcription start site (TSS) and 5’UTR (as per ENSEMBL v88). For A549 and U2OS, we used processed dREG scores [ 149 The peak analysis workflow began with overlapping PRO-seq peaks to transcripts in our ETG Consensus set. Multiple peaks frequently overlapped the same transcript or both NMD-target and control transcripts due to their proximity or shared TSS. We selected peaks overlapping TSS or within 5’UTR (or if the end peak was at 1000nt distance), retaining only those within 1000nt of the TSS. Among these peaks, we selected the one with the closest distance to the TSS for each transcript. To determine TSS-peak distances, we identified peak summits representing maximum coverage positions. For A549 and U2OS, we used pre-calculated Height Summit positions, while for SH-SY5Y, we used peak midpoints due to their narrower peak width (~ 12nt compared to 499–530nt in A549 and U2OS). Peaks with the minimum score for SH-SY5Y were removed. We excluded peaks with identical summit positions between NMD and non-NMD transcripts of the same gene. Finally, scores were log-transformed and scaled to enable comparison across cell lines. To specifically address brain-associated differential NMD efficiency, we stratified transcripts into brain-upregulated and non-brain-upregulated categories based on transcript expression from GTex and TCGA datasets. For classification, mean gene TPM values were compared between merged normal brain subregions and all other tissues (GTex), or between LGG/GBM brain tumors and other cancers (TCGA). Brain-upregulation was determined using Mann–Whitney U p Randomization tests for iNMDeff variability Inter-Tissue iNMDeff variability deviation (ITNVD) test This test consists in shuffling the data 2000 iterations, to see if the iNMDeff differences observed between tissues could have happened by chance (see also Fig. 3 p \\documentclass[12pt]{minimal}\n\t\t\t\t\\usepackage{amsmath}\n\t\t\t\t\\usepackage{wasysym} \n\t\t\t\t\\usepackage{amsfonts} \n\t\t\t\t\\usepackage{amssymb} \n\t\t\t\t\\usepackage{amsbsy}\n\t\t\t\t\\usepackage{mathrsfs}\n\t\t\t\t\\usepackage{upgreek}\n\t\t\t\t\\setlength{\\oddsidemargin}{-69pt}\n\t\t\t\t\\begin{document}$$p-value= \\frac{sum(RandVarScores> ObsVarScores) + 1}{TotalNumIterations}$$\\end{document} p - v a l u e = s u m ( R a n d V a r S c o r e s > O b s V a r S c o r e s ) + 1 TotalNumIterations Tissue iNMDeff deviation (TND) test This test compares the observed tissue-specific median iNMDeff against a randomized median iNMDeff (note that these medians were essential in deriving the ITNVD score discussed above), as illustrated in Fig. 3 p \\documentclass[12pt]{minimal}\n\t\t\t\t\\usepackage{amsmath}\n\t\t\t\t\\usepackage{wasysym} \n\t\t\t\t\\usepackage{amsfonts} \n\t\t\t\t\\usepackage{amssymb} \n\t\t\t\t\\usepackage{amsbsy}\n\t\t\t\t\\usepackage{mathrsfs}\n\t\t\t\t\\usepackage{upgreek}\n\t\t\t\t\\setlength{\\oddsidemargin}{-69pt}\n\t\t\t\t\\begin{document}$$p-value= \\frac{sum(RandMedianINMDeffScores> ObsMedianINMDeffScore) + 1}{TotalNumIterations}$$\\end{document} p - v a l u e = s u m ( R a n d M e d i a n I N M D e f f S c o r e s > O b s M e d i a n I N M D e f f S c o r e ) + 1 TotalNumIterations Tissue variability of iNMDeff using linear models As an alternative approach to assess the variability of iNMDeff across different tissues and cancer subtypes, we employed a linear modeling approach. This model aimed to predict iNMDeff values, based on a set of explanatory variables. These included demographic factors (age, sex), technical aspects (RNA-seq sample library size), and others (number of NMD targets as measured in ETG or number of PTCs as measured in ASE). For cancer samples from the TCGA, we further adjusted for other variables such as tumor purity, CNA burden, race, tumor mutation burden (TMB), categories of POLE In constructing the model for each NMD method (ETG and ASE) and cohort (TCGA and GTex) separately, we adopted a rigorous approach. After establishing the initial model incorporating all variables, we systematically eliminated each variable in turn. This stepwise removal allowed us to evaluate the impact of each variable on the model’s overall explanatory power, specifically measuring the reduction in the total variance explained (R 2 Cellular deconvolution for TCGA and Hartwig tumors We applied the UniCell: Deconvolve Base ( UCDBase 60 150 2 \\documentclass[12pt]{minimal}\n\t\t\t\t\\usepackage{amsmath}\n\t\t\t\t\\usepackage{wasysym} \n\t\t\t\t\\usepackage{amsfonts} \n\t\t\t\t\\usepackage{amssymb} \n\t\t\t\t\\usepackage{amsbsy}\n\t\t\t\t\\usepackage{mathrsfs}\n\t\t\t\t\\usepackage{upgreek}\n\t\t\t\t\\setlength{\\oddsidemargin}{-69pt}\n\t\t\t\t\\begin{document}$${log}_{2}(NormValue+1))$$\\end{document} log 2 ( N o r m V a l u e + 1 ) ) Quantification of ASE PTC-NMD efficiency (pNMDeff) for inter-individual NMD efficiency variation To assess the inter-individual variability of NMD efficiency, we quantified the NMD efficiency for each PTC arising from nonsense mutations or indels, to which we refer as pNMDeff, following the approach previously described by our group[ 8  \\documentclass[12pt]{minimal}\n\t\t\t\t\\usepackage{amsmath}\n\t\t\t\t\\usepackage{wasysym} \n\t\t\t\t\\usepackage{amsfonts} \n\t\t\t\t\\usepackage{amssymb} \n\t\t\t\t\\usepackage{amsbsy}\n\t\t\t\t\\usepackage{mathrsfs}\n\t\t\t\t\\usepackage{upgreek}\n\t\t\t\t\\setlength{\\oddsidemargin}{-69pt}\n\t\t\t\t\\begin{document}$$pNMDeff = -log2(\\frac{MUT\\;RNA\\;counts}{WT\\;RNA\\;counts})$$\\end{document} p N M D e f f = - l o g 2 ( M U T R N A c o u n t s W T R N A c o u n t s ) A pNMDeff score of 0 indicates no mRNA degradation, a score of 1 indicates that the MUT RNA-seq allele counts are half of the WT allele, while a complete heterozygous mRNA degradation approaches infinity. PTCs or transcripts were systematically excluded from our analysis based on several stringent conditions: Exclusion of indels without a downstream PTC prediction. Exclusion for additional germline or somatic indel, nonsense, or splice site disrupting variants (not applicable to somatic PTCs in TCGA), or overlap with somatic CNAs. Exclusion of PTC-bearing transcripts comprising a single exon without additional 3’ UTR splice sites. Exclusion based on the gene’s LOEUF score position in the first decile, indicating negative selection, or identification of the gene under positive selection. Exclusion of homozygous PTC variants. Exclusion of PTCs with a DNA variant allele frequency > 20% (for somatic variants in TCGA). Exclusion of transcripts with median pan-tissue or pan-cancer expression level (TPM) < 5, or significant expression variation among samples (coefficient of variation > 0.5). Utilizing pNMDeff data from germline ASE in TCGA and GTex, and somatic ASE in TCGA, we assessed inter- and intra-individual variability of NMD efficiency, focusing on NMD-triggering PTCs as per canonical NMD rules[ 8 Intra-individual variability Inter-individual variability Variance-based metrics involved calculating the variance of pNMDeff scores for either at least 3 PTCs within individuals or across individuals sharing the same PTC. Each analysis was conducted separately for each cohort and was supplemented by a control analysis involving randomized pNMDeff values to establish a baseline for comparison. NMD-related gene classification We integrated data from 112 NMD-related genes to investigate gene-level associations with somatic mutations and to evaluate CRISPR codependency scores for identifying causal genes. This selection of NMD genes was informed by two pivotal studies with experimental validations. From Baird et al., [ 69 Z 70 3 7 151 SMG1 SMG5 SMG6 SMG7 SMG8 SMG9 UPF1 UPF2 UPF3A UPF3B CASC3 EIF4A3 MAGOH RBM8A ACIN1 ALYREF AQR CWC22 RNPS1 SRRM1 DHX34 ETF1 GSTP1 GNL2 NBAS SEC13 Association analysis of somatic mutations with variable iNMDeff The association between iNMDeff and somatic mutations was investigated using general linear models (“ glm stats 152 Somatic pan-cancer CNA signatures by sparse-PCA We performed a sparse principal component analysis (sparse-PCA) on the 24,777 gene CNA arm-level data in 10,654 TCGA samples, using “ sparsepca 153 In essence, sparse-PCA differs from standard PCA by performing implicit feature selection, focusing only on the most relevant genes that contribute significantly to data variation. This approach is particularly effective for high-dimensional data, as it efficiently manages sparsity, isolates key variables, reduces noise, and improves the interpretability of the results. In sparse-PCA, two parameters are pivotal: “ alpha k alpha alpha k alpha k alpha k Each component in the CNA-PC might represent either a genomic gain (Additional File 1: Fig. S14B) or deletion (Additional File 1: Fig. S14C), necessitating careful interpretation of the scores and their signs on a case-by-case basis. For example, a negative score in the CNA-PC does not automatically imply a deletion; it could be associated with a gain, such as that of chromosome 2p. Therefore, the specific context and characteristics of each CNA-PC must be thoroughly examined to accurately determine whether the observed score reflects a gain or a deletion in the genome. Association analysis of somatic pan-cancer CNA signatures with variable iNMDeff The association between individual weights of the pan-cancer CNA-PCs and our estimates of iNMDeff for both NMD methods was analyzed in 33 individual cancer types, and pan-cancer, from the TCGA. This analysis was conducted using general linear models with the “ glm stats In our analysis, ASE iNMDeff served as the initial discovery phase, leading to the identification of significant cancer or pan-cancer-specific CNA-PC associations which were then validated using ETG iNMDeff, with FDR adjustments made only for these associations. This approach identified nine total CNA-PCs significantly associated with iNMDeff at an FDR < 10%. Of these, only three pan-cancer CNA-PCs (3, 52, and 86) exhibited consistent directions in their association with NMD efficiency, indicated by the same direction of effect sizes between ASE and ETG (Additional File 1: Fig. S15). In contrast, the remaining six CNA-PCs, which included three cancer-type specific (one in PCPG and two in UCEC) and three pan-cancer CNA-PCs, showed discrepancies in the direction of NMD effect and were therefore not considered in further analyses. Prediction of iNMDeff based on gene expression for validations We developed LASSO or ridge regression models to predict iNMDeff based on gene-level expression data (proxy models). The model was constructed separately for our two NMD methods, ETG and ASE, utilizing gene expression data from either TCGA or GTex. Prior to model development, genes with low expression ( \\documentclass[12pt]{minimal}\n\t\t\t\t\\usepackage{amsmath}\n\t\t\t\t\\usepackage{wasysym} \n\t\t\t\t\\usepackage{amsfonts} \n\t\t\t\t\\usepackage{amssymb} \n\t\t\t\t\\usepackage{amsbsy}\n\t\t\t\t\\usepackage{mathrsfs}\n\t\t\t\t\\usepackage{upgreek}\n\t\t\t\t\\setlength{\\oddsidemargin}{-69pt}\n\t\t\t\t\\begin{document}$${log}_{2}\\left(TPM\\right)\\ge 0.5)$$\\end{document} log 2 T P M ≥ 0.5 ) comBat 154 155 These models were utilized in two distinct validation scenarios: (i) validating chr1q gain associated with reduced iNMDeff in the cell lines from the CCLE and (ii) validating the association of iNMDeff with PFS in external datasets from various studies. For scenario (i), we predicted the cell line NMD efficiency (cNMDeff) for 942 cells. For scenario (ii), we estimated the iNMDeff for 120 patients in Liu et al. melanoma dataset, 33 in Carroll et al. esophagus dataset, 353 in Motzer et al. kidney dataset, 251 in Hartwig cohort, and 48 in Riaz et al. melanoma dataset. Gene codependency CRISPR KO scores with NMD activity in cell line screens To delineate NMD-associated genes, we leveraged genetic interaction data derived from gene-level CRISPR screening, as provided by the Achilles Project [ 71 64 From the “Outputs generated by normalization pipelines—Normalized networks (ONION)” Section [ 156 snf_run_rpca_7_5_5.Rdata https://zenodo.org/records/7671685#.Y_gi9nbMK5c ggcorrplot ggcorrplot 4 SMG5 SF3B4 RBM8A INTS3 KIAA0907 SF3B4 RBM8A CWC22 SF3B1 NOP58 FARSB FARSB It is important to note that the KO of some NMD factors, especially UPF1 Furthermore, we quantitatively assessed the NMD association by calculating the mean CRISPR codependency scores between each candidate gene and the 10 core NMD factor genes ( UPF1 UPF2 UPF3A UPF3B SMG1 SMG5 SMG6 SMG7 SMG8 SMG9 Rare variant association studies (RVAS) via SKAT-O We conducted a gene-based rare variant association study (RVAS) following the method from a previous study in our group [ 157 72 5 \\documentclass[12pt]{minimal}\n\t\t\t\t\\usepackage{amsmath}\n\t\t\t\t\\usepackage{wasysym} \n\t\t\t\t\\usepackage{amsfonts} \n\t\t\t\t\\usepackage{amssymb} \n\t\t\t\t\\usepackage{amsbsy}\n\t\t\t\t\\usepackage{mathrsfs}\n\t\t\t\t\\usepackage{upgreek}\n\t\t\t\t\\setlength{\\oddsidemargin}{-69pt}\n\t\t\t\t\\begin{document}$$\\text{Q} \\rho =\\uprho \\times \\text{QB}+\\left(1-\\uprho \\right)\\text{QS}$$\\end{document} Q ρ = ρ × QB + 1 - ρ QS \\documentclass[12pt]{minimal}\n\t\t\t\t\\usepackage{amsmath}\n\t\t\t\t\\usepackage{wasysym} \n\t\t\t\t\\usepackage{amsfonts} \n\t\t\t\t\\usepackage{amssymb} \n\t\t\t\t\\usepackage{amsbsy}\n\t\t\t\t\\usepackage{mathrsfs}\n\t\t\t\t\\usepackage{upgreek}\n\t\t\t\t\\setlength{\\oddsidemargin}{-69pt}\n\t\t\t\t\\begin{document}$$\\text{Q}\\rho$$\\end{document} Q ρ 72 We defined three stringency thresholds for determining putative pLoF for the rare germline variants, i.e., those with a population allele frequency (MAF) of < 0.1%: (i) pLoF: NMD-triggering PTC variants. (ii) pLoF_Missense_CADD15: NMD-triggering PTC variants + Missense with CADD ≥ 15. (iii) pLoF_Missense_CADD25: NMD-triggering PTC variants + Missense with CADD ≥ 25. The predicted deleterious missense variants were calculated using CADD scores [ 69 Association testing was conducted separately for each cancer (33) or normal tissue type (56) and collectively for pan-cancer or pan-tissue analysis. We only considered individuals with European ancestry. A gene’s effect on iNMDeff was tested only if a rare pLoF variant in that gene was found in at least two individuals, across 18 matched cancer-normal tissues (Additional File 2: Table S5). This resulted in varying numbers of genes being tested per cancer or tissue type. Significant associations are allowed to validate between GTex and TCGA cohorts across the different pLoF variant sets and NMD efficiency estimation method (ETG or ASE). In other words, as long as there is a significant association in matched tissues in both GTex and TCGA, regardless of the dataset or NMD method used, the association of the gene with NMD efficiency is considered replicated. The level of significance was determined after applying FDR correction using Benjamini–Hochberg within each tissue type separately in both cohorts (only correcting using the significant genes in the validation cohort). As a negative control, we randomized the iNMDeff values and re-tested the associations in the same way. To assess the significance difference between the observed proportion of significant genes (48/1,072,334) and the randomized proportion (24/1,035,154) we calculated the Z p Additionally, we established an empirical FDR benchmark by contrasting the proportion of significant findings against those from randomized data. We calculated an empirical FDR of 30% at a nominal threshold of 5%, following this formula:  \\documentclass[12pt]{minimal}\n\t\t\t\t\\usepackage{amsmath}\n\t\t\t\t\\usepackage{wasysym} \n\t\t\t\t\\usepackage{amsfonts} \n\t\t\t\t\\usepackage{amssymb} \n\t\t\t\t\\usepackage{amsbsy}\n\t\t\t\t\\usepackage{mathrsfs}\n\t\t\t\t\\usepackage{upgreek}\n\t\t\t\t\\setlength{\\oddsidemargin}{-69pt}\n\t\t\t\t\\begin{document}$$Empirical\\;FDR\\;threshold=\\frac{\\frac{number\\;of\\;observed\\;significant\\;hits}{total\\;number\\;of\\;observed\\;tests}}{\\frac{number\\;of\\;randomized\\;significant\\;hits}{total\\;number\\;of\\;randomized\\;tests}}$$\\end{document} E m p i r i c a l F D R t h r e s h o l d = n u m b e r o f o b s e r v e d s i g n i f i c a n t h i t s t o t a l n u m b e r o f o b s e r v e d t e s t s n u m b e r o f r a n d o m i z e d s i g n i f i c a n t h i t s t o t a l n u m b e r o f r a n d o m i z e d t e s t s In more detail, we performed SKAT-O testing using the R package “ SKAT v2.0.1 SKAT_Null_Model fastDummies v1.6.3 SKAT SKATO p p p We only tested the additive type of inheritance model, encoding individual variants as follows: 0 for no rare pLoF, 1 for rare pLoF, 2 for rare pLoF with somatic loss of heterozygosity (LOH, in TCGA) or biallelic rare pLoF. Gene-burden testing to estimate effect sizes for the significant RVAS genes In addition to SKAT-O, we conducted gene-based burden testing to aggregate variants within the same gene, applying identical models as previously described. This was necessary because SKAT-O does not report effect sizes. The association testing was executed using linear regression with the 'glm' ‘stats’ \\documentclass[12pt]{minimal}\n\t\t\t\t\\usepackage{amsmath}\n\t\t\t\t\\usepackage{wasysym} \n\t\t\t\t\\usepackage{amsfonts} \n\t\t\t\t\\usepackage{amssymb} \n\t\t\t\t\\usepackage{amsbsy}\n\t\t\t\t\\usepackage{mathrsfs}\n\t\t\t\t\\usepackage{upgreek}\n\t\t\t\t\\setlength{\\oddsidemargin}{-69pt}\n\t\t\t\t\\begin{document}$$iNMDeff \\sim Gene+covariates$$\\end{document} i N M D e f f ∼ G e n e + c o v a r i a t e s P Redefinition of cancer driver gene list for estimating selection Our initial selection of cancer-related genes originated from the 727 genes listed in the Cancer Gene Census (CGC) [ 152 158 159 q q Estimating selection in cancer driver genes via dN/dS The dN/dS method is a state-of-the-art method to estimate selection, computing the dN/dS ratios for different types of mutations—missense, nonsense, and frameshift—at the gene level. A dN/dS ratio above 1 for a gene indicates positive selection, while a ratio below 1 signifies negative selection. dN/dS was calculated using the “ dndscv dndscv submod_192r_3w 160 We implemented this approach on all nonsense (stratifying NMD-triggering and NMD-evading PTCs) and missense mutations (serving as controls) found within the CGC set of genes in the pan-cancer TCGA cohort. We also applied this analysis for 33 cancer types separately, to identify cancer-specific genes. Individuals were grouped in iNMDeff high vs low, based on the median. In other words, our analysis was divided into various categories: (i) comparison between NMD-triggering and NMD-evading PTCs; (ii) comparison of individuals with high versus low iNMDeff; (iii) analysis of the two types of somatic mutations, namely nonsense/PTCs and missense; (iv) the two categories of cancer genes: TSG and OG. Consequently, each gene underwent dN/dS ratio calculation eight times, reflecting the above different contexts including mutation type, NMD region type, cancer gene type, and iNMDeff group sample type. To enhance the accuracy of our classification between NMD-triggering and NMD-evading PTCs, we incorporated a new NMD-rule [ 8 Survival analysis and Cox regressions To investigate the relationship between individual NMD efficiency and cancer survival, we employed survival analysis and Cox proportional hazards regression models for each of the 47 cancer types stratified into subtypes and for the two NMD methods. These models were used to analyze two key survival outcomes: overall survival (OS) and progression-free survival (PFS). The structure of the model was as follows: \\documentclass[12pt]{minimal}\n\t\t\t\t\\usepackage{amsmath}\n\t\t\t\t\\usepackage{wasysym} \n\t\t\t\t\\usepackage{amsfonts} \n\t\t\t\t\\usepackage{amssymb} \n\t\t\t\t\\usepackage{amsbsy}\n\t\t\t\t\\usepackage{mathrsfs}\n\t\t\t\t\\usepackage{upgreek}\n\t\t\t\t\\setlength{\\oddsidemargin}{-69pt}\n\t\t\t\t\\begin{document}$$survival\\_outcome \\sim iNMDeff\\_group + covariates$$\\end{document} s u r v i v a l _ o u t c o m e ∼ i N M D e f f _ g r o u p + c o v a r i a t e s iNMDeff_group The Cox regression analysis was systematically repeated across a spectrum of percentiles (every 5th percentile up to the 50th), enabling an intricate evaluation of NMD efficiency’s impact on survival. For example, classifying individuals at the 20th percentile is comparing the top 20% of individuals with the highest iNMDeff against the bottom 20% with the lowest iNMDeff. Meta-analysis p  \\documentclass[12pt]{minimal}\n\t\t\t\t\\usepackage{amsmath}\n\t\t\t\t\\usepackage{wasysym} \n\t\t\t\t\\usepackage{amsfonts} \n\t\t\t\t\\usepackage{amssymb} \n\t\t\t\t\\usepackage{amsbsy}\n\t\t\t\t\\usepackage{mathrsfs}\n\t\t\t\t\\usepackage{upgreek}\n\t\t\t\t\\setlength{\\oddsidemargin}{-69pt}\n\t\t\t\t\\begin{document}$$Empirical\\;FDR\\;threshold=\\frac{\\frac{number\\;of\\;observed\\;significant\\;hits}{total\\;number\\;of\\;observed\\;tests}}{\\frac{number\\;of\\;randomized\\;significant\\;hits}{total\\;number\\;of\\;randomized\\;tests}}$$\\end{document} E m p i r i c a l F D R t h r e s h o l d = n u m b e r o f o b s e r v e d s i g n i f i c a n t h i t s t o t a l n u m b e r o f o b s e r v e d t e s t s n u m b e r o f r a n d o m i z e d s i g n i f i c a n t h i t s t o t a l n u m b e r o f r a n d o m i z e d t e s t s For our survival analysis, we utilized the 'surv' 'survfit' 'survival' 'ggsurvplot' 'survminer' 'coxph' 'survival' For progression-free survival (PFS) analysis and Cox regression, we included all samples with no available treatment data as negative controls ( n Immunotherapy-treated patients from external datasets and filterings To validate our PFS or immunotherapy response findings, we utilized external patient datasets from different studies, each focusing exclusively on individuals undergoing different immunotherapy treatments: Liu et al. [ 76 \\documentclass[12pt]{minimal}\n\t\t\t\t\\usepackage{amsmath}\n\t\t\t\t\\usepackage{wasysym} \n\t\t\t\t\\usepackage{amsfonts} \n\t\t\t\t\\usepackage{amssymb} \n\t\t\t\t\\usepackage{amsbsy}\n\t\t\t\t\\usepackage{mathrsfs}\n\t\t\t\t\\usepackage{upgreek}\n\t\t\t\t\\setlength{\\oddsidemargin}{-69pt}\n\t\t\t\t\\begin{document}$${log}_{2}\\left(TPM+1\\right),$$\\end{document} log 2 T P M + 1 , Carroll et al. [ 80 convertCounts DGEobj.utils \\documentclass[12pt]{minimal}\n\t\t\t\t\\usepackage{amsmath}\n\t\t\t\t\\usepackage{wasysym} \n\t\t\t\t\\usepackage{amsfonts} \n\t\t\t\t\\usepackage{amssymb} \n\t\t\t\t\\usepackage{amsbsy}\n\t\t\t\t\\usepackage{mathrsfs}\n\t\t\t\t\\usepackage{upgreek}\n\t\t\t\t\\setlength{\\oddsidemargin}{-69pt}\n\t\t\t\t\\begin{document}$${log}_{2}\\left(TPM+1\\right)$$\\end{document} log 2 T P M + 1 Motzer et al. [ 81 \\documentclass[12pt]{minimal}\n\t\t\t\t\\usepackage{amsmath}\n\t\t\t\t\\usepackage{wasysym} \n\t\t\t\t\\usepackage{amsfonts} \n\t\t\t\t\\usepackage{amssymb} \n\t\t\t\t\\usepackage{amsbsy}\n\t\t\t\t\\usepackage{mathrsfs}\n\t\t\t\t\\usepackage{upgreek}\n\t\t\t\t\\setlength{\\oddsidemargin}{-69pt}\n\t\t\t\t\\begin{document}$${log}_{2}\\left(TPM\\right)$$\\end{document} log 2 T P M Hartwig Medical Foundation [ 82 \\documentclass[12pt]{minimal}\n\t\t\t\t\\usepackage{amsmath}\n\t\t\t\t\\usepackage{wasysym} \n\t\t\t\t\\usepackage{amsfonts} \n\t\t\t\t\\usepackage{amssymb} \n\t\t\t\t\\usepackage{amsbsy}\n\t\t\t\t\\usepackage{mathrsfs}\n\t\t\t\t\\usepackage{upgreek}\n\t\t\t\t\\setlength{\\oddsidemargin}{-69pt}\n\t\t\t\t\\begin{document}$${log}_{2}\\left(TPM+1\\right)$$\\end{document} log 2 T P M + 1 Riaz et al. [ 83 biomaRt \\documentclass[12pt]{minimal}\n\t\t\t\t\\usepackage{amsmath}\n\t\t\t\t\\usepackage{wasysym} \n\t\t\t\t\\usepackage{amsfonts} \n\t\t\t\t\\usepackage{amssymb} \n\t\t\t\t\\usepackage{amsbsy}\n\t\t\t\t\\usepackage{mathrsfs}\n\t\t\t\t\\usepackage{upgreek}\n\t\t\t\t\\setlength{\\oddsidemargin}{-69pt}\n\t\t\t\t\\begin{document}$${log}_{2}\\left(TPM+1\\right)$$\\end{document} log 2 T P M + 1 TCGA: 469 melanoma (SKCM) samples, 73 were identified as having received at least one immunotherapy treatment. The iNMDeff for these datasets was predicted using our proxy models based on gene-level expression RNA-seq data, with TCGA or GTex cohorts serving as training sets. Averages of predictions from both cohorts were taken as the final iNMDeff for each individual, calculated separately for ETG and ASE methods. This approach yielded two iNMDeff values per individual. The final sample sizes, after filtering, were 120 for Liu-SKCM, 33 for Carroll-EAC, 353 for Motzer-SKCM, 251 for Hartwig, 48 for Riaz-SKCM, and for TCGA-SKCM, we utilized directly our estimated iNMDeff values (no proxy model used here) for 36 and 73 ASE and ETG melanoma patients, respectively. Prediction model of immunotherapy response To predict immunotherapy response, we designed a simple logistic regression model incorporating TMB and our predicted iNMDeff to classify immunotherapy outcomes as “Responders” (Complete Response, CR, and Partial Response, PR) or “Non-Responders” (Stable Disease, SD, and Progressive Disease, PD). This analysis spanned various datasets, excluding Motzer-SKCM due to unavailability of TMB and treatment response data, and included TCGA-SKCM, Carrol-EAC, Liu-SKCM, and Hartwig (categorized by urinary tract, lung, and melanoma), as well as Riaz-SKCM. The approach to TMB calculation and response categorization was dataset-specific and manually curated: TCGA SKCM ( n Liu-SKCM ( n Carrol-EAC ( n Riaz-SKCM ( n Hartwig ( n n n n n Covariate adjustments were made based on dataset characteristics, incorporating age and sex generally, with Liu-SKCM excluding age but including cancer subtype due to significant TMB differences across melanoma subtypes, and Riaz-SKCM only including cancer subtype. The “ glm caret Supplementary Information  Additional File 1: Supplementary Figures S1-S29 Additional File 2: Supplementary Tables S1-S20 Additional File 3: Supplementary Text S1-S6 Additional File 4: Peer review history Publisher’s Note Springer Nature remains neutral with regard to jurisdictional claims in published maps and institutional affiliations. Acknowledgements We are grateful to Dr. Javier Lanillos for processing the TCGA RNA-Seq data in brain tumors and Hartwig RNA-Seq data using UniCell Deconvolve, and for pointing us to immunotherapy studies of interest. Further, we thank all members of the Genome Data Science lab for discussions. This publication and the underlying research are partly facilitated by Hartwig Medical Foundation and the Center for Personalized Cancer Treatment (CPCT) which have generated, analyzed, and made available data for this research (request number DR-260). The results published here are in whole or part based on data generated by the TCGA Research Network ( https://www.cancer.gov/tcga Review history The review history is available as Additional file 4. Peer review information Tim Sands was the primary editor of this article and managed its editorial process and peer review in collaboration with the rest of the editorial team. Authors’ contributions GP-M performed all data collection and curation, wrote code, and performed bioinformatics analysis and visualization of results. FS conceived and supervised the study. Both authors jointly designed the analyses, interpreted the results, and wrote the manuscript. Funding Open access funding provided by Copenhagen University G.P.-M. was funded by an AGAUR FI fellowship, and F.S. was funded by the ICREA Research Professor program. Work in the lab of F.S. was supported by an ERC StG “HYPER-INSIGHT” (757700), ERC CoG “STRUCTOMATIC” (101088342), Horizon2020 project “DECIDER” (965193), Horizon Europe project “LUCIA” (101096473), Spanish government project “REPAIRSCAPE,” CaixaResearch project “POTENT-IMMUNO” (HR22-00402), a Novo Nordisk Fonden Start Package grant, the Danish Cancer Society grant \"AI-DRIVERS\", the SGR funding of the Catalan government, the Severo Ochoa Centers of Excellence award of the Spanish government to the hosting institution. Data availability Data used in this study includes WES bam fastq https://portal.gdc.cancer.gov/ bam fastq https://portal.gdc.cancer.gov/ 121 124 VCF https://anvilproject.org/ 161 https://gdac.broadinstitute.org/ 123 https://gdac.broadinstitute.org/ 123 112 113 https://www.cbioportal.org/ 122 125 quanTIseq TIL10 https://tcia.at/home 126 61 127 133 135 5 6 13 14 51 156 snf_run_rpca_7_5_5.Rdata https://zenodo.org/records/7671685#.Y_gi9nbMK5c 65 https://depmap.org/portal/download/all/ 76 80 81 83 82 GSE214243 55 GSM5169137 56 GSM5169140 56 UPF1 GSE152435 GSE86148 5 53 GSE88148 GSE88466 54 GSE88140 GSE88266 54 https://github.com/gpalou4/iNMDeff 162 163 Declarations Ethics approval and consent to participate This work was performed using publicly available datasets and thus specific ethical approval was not sought. Competing interests The authors declare that they have no competing interests. Reference 1. Supek F Lehner B Lindeboom RGH To NMD or not to NMD: nonsense-mediated mRNA decay in cancer and other genetic diseases Trends Genet 2021 37 657 668 10.1016/j.tig.2020.11.002 33277042 Supek F, Lehner B, Lindeboom RGH. To NMD or not to NMD: nonsense-mediated mRNA decay in cancer and other genetic diseases. Trends Genet. 2021;37:657–68. 33277042 10.1016/j.tig.2020.11.002 2. Schweingruber C Rufener SC Zünd D Yamashita A Mühlemann O Nonsense-mediated mRNA decay - mechanisms of substrate mRNA recognition and degradation in mammalian cells Biochim Biophys Acta 2013 1829 612 623 10.1016/j.bbagrm.2013.02.005 23435113 Schweingruber C, Rufener SC, Zünd D, Yamashita A, Mühlemann O. Nonsense-mediated mRNA decay - mechanisms of substrate mRNA recognition and degradation in mammalian cells. Biochim Biophys Acta. 2013;1829:612–23. 23435113 10.1016/j.bbagrm.2013.02.005 3. Lykke-Andersen S Jensen TH Nonsense-mediated mRNA decay: an intricate machinery that shapes transcriptomes Nat Rev Mol Cell Biol 2015 16 665 677 10.1038/nrm4063 26397022 Lykke-Andersen S, Jensen TH. Nonsense-mediated mRNA decay: an intricate machinery that shapes transcriptomes. Nat Rev Mol Cell Biol. 2015;16:665–77. 26397022 10.1038/nrm4063 4. Wang D Inhibition of nonsense-mediated RNA decay by the tumor microenvironment promotes tumorigenesis Mol Cell Biol 2011 31 3670 80 10.1128/MCB.05704-11 21730287 PMC3165546 Wang D, et al. Inhibition of nonsense-mediated RNA decay by the tumor microenvironment promotes tumorigenesis. Mol Cell Biol. 2011;31:3670–80. 21730287 10.1128/MCB.05704-11 PMC3165546 5. Colombo M Karousis ED Bourquin J Bruggmann R Mühlemann O Transcriptome-wide identification of NMD-targeted human mRNAs reveals extensive redundancy between SMG6- and SMG7-mediated degradation pathways RNA 2017 23 189 201 10.1261/rna.059055.116 27864472 PMC5238794 Colombo M, Karousis ED, Bourquin J, Bruggmann R, Mühlemann O. Transcriptome-wide identification of NMD-targeted human mRNAs reveals extensive redundancy between SMG6- and SMG7-mediated degradation pathways. RNA. 2017;23:189–201. 27864472 10.1261/rna.059055.116 PMC5238794 6. Tani H Identification of hundreds of novel UPF1 target transcripts by direct determination of whole transcriptome stability RNA Biol 2012 9 1370 9 10.4161/rna.22360 23064114 PMC3597577 Tani H, et al. Identification of hundreds of novel UPF1 target transcripts by direct determination of whole transcriptome stability. RNA Biol. 2012;9:1370–9. 23064114 10.4161/rna.22360 PMC3597577 7. Nickless A Bailis JM You Z Control of gene expression through the nonsense-mediated RNA decay pathway Cell Biosci 2017 7 26 10.1186/s13578-017-0153-7 28533900 PMC5437625 Nickless A, Bailis JM, You Z. Control of gene expression through the nonsense-mediated RNA decay pathway. Cell Biosci. 2017;7:26. 28533900 10.1186/s13578-017-0153-7 PMC5437625 8. Lindeboom RGH Supek F Lehner B The rules and impact of nonsense-mediated mRNA decay in human cancers Nat Genet 2016 48 1112 1118 10.1038/ng.3664 27618451 PMC5045715 Lindeboom RGH, Supek F, Lehner B. The rules and impact of nonsense-mediated mRNA decay in human cancers. Nat Genet. 2016;48:1112–8. 27618451 10.1038/ng.3664 PMC5045715 9. Nagy E Maquat LE A rule for termination-codon position within intron-containing genes: when nonsense affects RNA abundance Trends Biochem Sci 1998 23 198 199 10.1016/S0968-0004(98)01208-0 9644970 Nagy E, Maquat LE. A rule for termination-codon position within intron-containing genes: when nonsense affects RNA abundance. Trends Biochem Sci. 1998;23:198–9. 9644970 10.1016/s0968-0004(98)01208-0 10. Rivas MA Effect of predicted protein-truncating genetic variants on the human transcriptome Science 2015 348 666 669 10.1126/science.1261877 25954003 PMC4537935 Rivas MA, et al. Effect of predicted protein-truncating genetic variants on the human transcriptome. Science. 2015;348:666–9. 25954003 10.1126/science.1261877 PMC4537935 11. Lindeboom RGH Vermeulen M Lehner B Supek F The impact of nonsense-mediated mRNA decay on genetic disease, gene editing and cancer immunotherapy Nat Genet 2019 51 1645 1651 10.1038/s41588-019-0517-5 31659324 PMC6858879 Lindeboom RGH, Vermeulen M, Lehner B, Supek F. The impact of nonsense-mediated mRNA decay on genetic disease, gene editing and cancer immunotherapy. Nat Genet. 2019;51:1645–51. 31659324 10.1038/s41588-019-0517-5 PMC6858879 12. Hurt JA Robertson AD Burge CB Global analyses of UPF1 binding and function reveal expanded scope of nonsense-mediated mRNA decay Genome Res 2013 23 1636 1650 10.1101/gr.157354.113 23766421 PMC3787261 Hurt JA, Robertson AD, Burge CB. Global analyses of UPF1 binding and function reveal expanded scope of nonsense-mediated mRNA decay. Genome Res. 2013;23:1636–50. 23766421 10.1101/gr.157354.113 PMC3787261 13. Karousis ED Gypas F Zavolan M Mühlemann O Nanopore sequencing reveals endogenous NMD-targeted isoforms in human cells Genome Biol 2021 22 223 10.1186/s13059-021-02439-3 34389041 PMC8361881 Karousis ED, Gypas F, Zavolan M, Mühlemann O. Nanopore sequencing reveals endogenous NMD-targeted isoforms in human cells. Genome Biol. 2021;22:223. 34389041 10.1186/s13059-021-02439-3 PMC8361881 14. Schmidt SA Identification of SMG6 cleavage sites and a preferred RNA cleavage motif by global analysis of endogenous NMD targets in human cells Nucleic Acids Res 2015 43 309 323 10.1093/nar/gku1258 25429978 PMC4288159 Schmidt SA, et al. Identification of SMG6 cleavage sites and a preferred RNA cleavage motif by global analysis of endogenous NMD targets in human cells. Nucleic Acids Res. 2015;43:309–23. 25429978 10.1093/nar/gku1258 PMC4288159 15. Somers J Pöyry T Willis AE A perspective on mammalian upstream open reading frame function Int J Biochem Cell Biol 2013 45 1690 1700 10.1016/j.biocel.2013.04.020 23624144 PMC7172355 Somers J, Pöyry T, Willis AE. A perspective on mammalian upstream open reading frame function. Int J Biochem Cell Biol. 2013;45:1690–700. 23624144 10.1016/j.biocel.2013.04.020 PMC7172355 16. Russell PJ Slivka JA Boyle EP Burghes AHM Kearse MG Translation reinitiation after uORFs does not fully protect mRNAs from nonsense-mediated decay RNA 2023 29 735 744 10.1261/rna.079525.122 36878710 PMC10187673 Russell PJ, Slivka JA, Boyle EP, Burghes AHM, Kearse MG. Translation reinitiation after uORFs does not fully protect mRNAs from nonsense-mediated decay. RNA. 2023;29:735–44. 36878710 10.1261/rna.079525.122 PMC10187673 17. Kurosaki T Maquat LE Rules that govern UPF1 binding to mRNA 3′ UTRs Proc Natl Acad Sci U S A 2013 110 3357 3362 10.1073/pnas.1219908110 23404710 PMC3587222 Kurosaki T, Maquat LE. Rules that govern UPF1 binding to mRNA 3′ UTRs. Proc Natl Acad Sci U S A. 2013;110:3357–62. 23404710 10.1073/pnas.1219908110 PMC3587222 18. Imamachi N Salam KA Suzuki Y Akimitsu N A GC-rich sequence feature in the 3′ UTR directs UPF1-dependent mRNA decay in mammalian cells Genome Res 2017 27 407 418 10.1101/gr.206060.116 27940950 PMC5340968 Imamachi N, Salam KA, Suzuki Y, Akimitsu N. A GC-rich sequence feature in the 3′ UTR directs UPF1-dependent mRNA decay in mammalian cells. Genome Res. 2017;27:407–18. 27940950 10.1101/gr.206060.116 PMC5340968 19. Nguyen LS Wilkinson MF Gecz J Nonsense-mediated mRNA decay: inter-individual variability and human disease Neurosci Biobehav Rev 2014 46 175 186 10.1016/j.neubiorev.2013.10.016 24239855 PMC4021004 Nguyen LS, Wilkinson MF, Gecz J. Nonsense-mediated mRNA decay: inter-individual variability and human disease. Neurosci Biobehav Rev. 2014;46:175–86. 24239855 10.1016/j.neubiorev.2013.10.016 PMC4021004 20. Zhao B Pritchard JR Evolution of the nonsense-mediated decay pathway is associated with decreased cytolytic immune infiltration PLoS Comput Biol 2019 15 e1007467 10.1371/journal.pcbi.1007467 31658270 PMC6837539 Zhao B, Pritchard JR. Evolution of the nonsense-mediated decay pathway is associated with decreased cytolytic immune infiltration. PLoS Comput Biol. 2019;15: e1007467. 31658270 10.1371/journal.pcbi.1007467 PMC6837539 21. Seoighe C Gehring C Heritability in the efficiency of nonsense-mediated mRNA decay in humans PLoS One 2010 5 e11657 10.1371/journal.pone.0011657 20657766 PMC2908117 Seoighe C, Gehring C. Heritability in the efficiency of nonsense-mediated mRNA decay in humans. PLoS One. 2010;5: e11657. 20657766 10.1371/journal.pone.0011657 PMC2908117 22. Wang M Assessing the activity of nonsense-mediated mRNA decay in lung cancer BMC Med Genomics 2017 10 55 10.1186/s12920-017-0292-z 28874147 PMC5586017 Wang M, et al. Assessing the activity of nonsense-mediated mRNA decay in lung cancer. BMC Med Genomics. 2017;10:55. 28874147 10.1186/s12920-017-0292-z PMC5586017 23. Zetoune AB Comparison of nonsense-mediated mRNA decay efficiency in various murine tissues BMC Genet 2008 9 83 10.1186/1471-2156-9-83 19061508 PMC2607305 Zetoune AB, et al. Comparison of nonsense-mediated mRNA decay efficiency in various murine tissues. BMC Genet. 2008;9:83. 19061508 10.1186/1471-2156-9-83 PMC2607305 24. Weischenfeldt J Mammalian tissues defective in nonsense-mediated mRNA decay display highly aberrant splicing patterns Genome Biol 2012 13 R35 10.1186/gb-2012-13-5-r35 22624609 PMC3446288 Weischenfeldt J, et al. Mammalian tissues defective in nonsense-mediated mRNA decay display highly aberrant splicing patterns. Genome Biol. 2012;13:R35. 22624609 10.1186/gb-2012-13-5-r35 PMC3446288 25. Linde L Boelz S Neu-Yilik G Kulozik AE Kerem B The efficiency of nonsense-mediated mRNA decay is an inherent character and varies among different cells Eur J Hum Genet 2007 15 1156 1162 10.1038/sj.ejhg.5201889 17625509 Linde L, Boelz S, Neu-Yilik G, Kulozik AE, Kerem B. The efficiency of nonsense-mediated mRNA decay is an inherent character and varies among different cells. Eur J Hum Genet. 2007;15:1156–62. 17625509 10.1038/sj.ejhg.5201889 26. Sato H Singer RH Cellular variability of nonsense-mediated mRNA decay Nat Commun 2021 12 7203 10.1038/s41467-021-27423-0 34893608 PMC8664836 Sato H, Singer RH. Cellular variability of nonsense-mediated mRNA decay. Nat Commun. 2021;12:7203. 34893608 10.1038/s41467-021-27423-0 PMC8664836 27. Rivas MA Impact of predicted protein-truncating genetic variants on the human transcriptome Science 2015 348 666 669 10.1126/science.1261877 25954003 PMC4537935 Rivas MA, et al. Impact of predicted protein-truncating genetic variants on the human transcriptome. Science. 2015;348:666–9. 25954003 10.1126/science.1261877 PMC4537935 28. Kerr TP Sewry CA Robb SA Roberts RG Long mutant dystrophins and variable phenotypes: evasion of nonsense-mediated decay? Hum Genet 2001 109 402 407 10.1007/s004390100598 11702221 Kerr TP, Sewry CA, Robb SA, Roberts RG. Long mutant dystrophins and variable phenotypes: evasion of nonsense-mediated decay? Hum Genet. 2001;109:402–7. 11702221 10.1007/s004390100598 29. Resta N A homozygous frameshift mutation in the ESCO2 gene: evidence of intertissue and interindividual variation in Nmd efficiency J Cell Physiol 2006 209 67 73 10.1002/jcp.20708 16775838 Resta N, et al. A homozygous frameshift mutation in the ESCO2 gene: evidence of intertissue and interindividual variation in Nmd efficiency. J Cell Physiol. 2006;209:67–73. 16775838 10.1002/jcp.20708 30. Bongiorno R Colombo MP Lecis D Deciphering the nonsense-mediated mRNA decay pathway to identify cancer cell vulnerabilities for effective cancer therapy J Exp Clin Cancer Res 2021 40 376 10.1186/s13046-021-02192-2 34852841 PMC8638473 Bongiorno R, Colombo MP, Lecis D. Deciphering the nonsense-mediated mRNA decay pathway to identify cancer cell vulnerabilities for effective cancer therapy. J Exp Clin Cancer Res. 2021;40:376. 34852841 10.1186/s13046-021-02192-2 PMC8638473 31. Cao L Human nonsense-mediated RNA decay regulates EMT by targeting the TGF-ß signaling pathway in lung adenocarcinoma Cancer Lett 2017 403 246 59 10.1016/j.canlet.2017.06.021 28663146 Cao L, et al. Human nonsense-mediated RNA decay regulates EMT by targeting the TGF-ß signaling pathway in lung adenocarcinoma. Cancer Lett. 2017;403:246–59. 28663146 10.1016/j.canlet.2017.06.021 32. Chang L The human RNA surveillance factor UPF1 regulates tumorigenesis by targeting Smad7 in hepatocellular carcinoma J Exp Clin Cancer Res 2016 35 8 10.1186/s13046-016-0286-2 26759305 PMC4711019 Chang L, et al. The human RNA surveillance factor UPF1 regulates tumorigenesis by targeting Smad7 in hepatocellular carcinoma. J Exp Clin Cancer Res. 2016;35:8. 26759305 10.1186/s13046-016-0286-2 PMC4711019 33. Sui S Wang Z Cui X Jin L Zhu C The biological behavior of tRNA-derived fragment tRF-Leu-AAG in pancreatic cancer cells Bioengineered 2022 13 10617 10628 10.1080/21655979.2022.2064206 35442152 PMC9161985 Sui S, Wang Z, Cui X, Jin L, Zhu C. The biological behavior of tRNA-derived fragment tRF-Leu-AAG in pancreatic cancer cells. Bioengineered. 2022;13:10617–28. 35442152 10.1080/21655979.2022.2064206 PMC9161985 34. Pei C-L Fei K-L Yuan X-Y Gong X-J Lncrna DANCR aggravates the progression of ovarian cancer by downregulating UPF1 Eur Rev Med Pharmacol Sci 2019 23 10657 10663 31858532 10.26355/eurrev_201912_19763 Pei C-L, Fei K-L, Yuan X-Y, Gong X-J. Lncrna DANCR aggravates the progression of ovarian cancer by downregulating UPF1. Eur Rev Med Pharmacol Sci. 2019;23:10657–63. 31858532 10.26355/eurrev_201912_19763 35. Lv Z-H Wang Z-Y Li Z-Y LncRNA PVT1 aggravates the progression of glioma via downregulating UPF1 Eur Rev Med Pharmacol Sci 2019 23 8956 8963 31696483 10.26355/eurrev_201910_19294 Lv Z-H, Wang Z-Y, Li Z-Y. LncRNA PVT1 aggravates the progression of glioma via downregulating UPF1. Eur Rev Med Pharmacol Sci. 2019;23:8956–63. 31696483 10.26355/eurrev_201910_19294 36. Zhou Y UPF1 inhibits the hepatocellular carcinoma progression by targeting long non-coding RNA UCA1 Sci Rep 2019 9 6652 10.1038/s41598-019-43148-z 31040354 PMC6491801 Zhou Y, et al. UPF1 inhibits the hepatocellular carcinoma progression by targeting long non-coding RNA UCA1. Sci Rep. 2019;9:6652. 31040354 10.1038/s41598-019-43148-z PMC6491801 37. Liu C The UPF1 RNA surveillance gene is commonly mutated in pancreatic adenosquamous carcinoma Nat Med 2014 20 596 598 10.1038/nm.3548 24859531 PMC4048332 Liu C, et al. The UPF1 RNA surveillance gene is commonly mutated in pancreatic adenosquamous carcinoma. Nat Med. 2014;20:596–8. 24859531 10.1038/nm.3548 PMC4048332 38. Chen H UPF1 contributes to the maintenance of endometrial cancer stem cell phenotype by stabilizing LINC00963 Cell Death Dis 2022 13 257 10.1038/s41419-022-04707-x 35318304 PMC8940903 Chen H, et al. UPF1 contributes to the maintenance of endometrial cancer stem cell phenotype by stabilizing LINC00963. Cell Death Dis. 2022;13:257. 35318304 10.1038/s41419-022-04707-x PMC8940903 39. Hu K Effects of UPF1 on the proliferation, migration and invasion of breast cancer strains MDA-MB-231 and MCF-7 China Biotechnol 2022 42 58 71 Hu K, et al. Effects of UPF1 on the proliferation, migration and invasion of breast cancer strains MDA-MB-231 and MCF-7. China Biotechnol. 2022;42:58–71. 40. Bokhari A Targeting nonsense-mediated mRNA decay in colorectal cancers with microsatellite instability Oncogenesis 2018 7 70 10.1038/s41389-018-0079-x 30228267 PMC6143633 Bokhari A, et al. Targeting nonsense-mediated mRNA decay in colorectal cancers with microsatellite instability. Oncogenesis. 2018;7:70. 30228267 10.1038/s41389-018-0079-x PMC6143633 41. Stenson PD The human gene mutation database: 2008 update Genome Med 2009 1 13 10.1186/gm13 19348700 PMC2651586 Stenson PD, et al. The human gene mutation database: 2008 update. Genome Med. 2009;1:13. 19348700 10.1186/gm13 PMC2651586 42. Mort M Ivanov D Cooper DN Chuzhanova NA A meta-analysis of nonsense mutations causing human genetic disease Hum Mutat 2008 29 1037 1047 10.1002/humu.20763 18454449 Mort M, Ivanov D, Cooper DN, Chuzhanova NA. A meta-analysis of nonsense mutations causing human genetic disease. Hum Mutat. 2008;29:1037–47. 18454449 10.1002/humu.20763 43. Khajavi M Inoue K Lupski JR Nonsense-mediated mRNA decay modulates clinical outcome of genetic disease Eur J Hum Genet 2006 14 1074 1081 10.1038/sj.ejhg.5201649 16757948 Khajavi M, Inoue K, Lupski JR. Nonsense-mediated mRNA decay modulates clinical outcome of genetic disease. Eur J Hum Genet. 2006;14:1074–81. 16757948 10.1038/sj.ejhg.5201649 44. Litchfield K Escape from nonsense-mediated decay associates with anti-tumor immunogenicity Nat Commun 2020 11 3800 10.1038/s41467-020-17526-5 32733040 PMC7393139 Litchfield K, et al. Escape from nonsense-mediated decay associates with anti-tumor immunogenicity. Nat Commun. 2020;11:3800. 32733040 10.1038/s41467-020-17526-5 PMC7393139 45. Hu Z Yau C Ahmed AA A pan-cancer genome-wide analysis reveals tumour dependencies by induction of nonsense-mediated decay Nat Commun 2017 8 15943 10.1038/ncomms15943 28649990 PMC5490262 Hu Z, Yau C, Ahmed AA. A pan-cancer genome-wide analysis reveals tumour dependencies by induction of nonsense-mediated decay. Nat Commun. 2017;8:15943. 28649990 10.1038/ncomms15943 PMC5490262 46. Pastor F Kolonias D Giangrande PH Gilboa E Induction of tumour immunity by targeted inhibition of nonsense-mediated mRNA decay Nature 2010 465 227 230 10.1038/nature08999 20463739 PMC3107067 Pastor F, Kolonias D, Giangrande PH, Gilboa E. Induction of tumour immunity by targeted inhibition of nonsense-mediated mRNA decay. Nature. 2010;465:227–30. 20463739 10.1038/nature08999 PMC3107067 47. Usuki F Inhibition of SMG-8, a subunit of SMG-1 kinase, ameliorates nonsense-mediated mRNA decay-exacerbated mutant phenotypes without cytotoxicity Proc Natl Acad Sci U S A 2013 110 15037 42 10.1073/pnas.1300654110 23983263 PMC3773753 Usuki F, et al. Inhibition of SMG-8, a subunit of SMG-1 kinase, ameliorates nonsense-mediated mRNA decay-exacerbated mutant phenotypes without cytotoxicity. Proc Natl Acad Sci U S A. 2013;110:15037–42. 23983263 10.1073/pnas.1300654110 PMC3773753 48. Amar-Schwartz A Inhibition of nonsense-mediated mRNA decay may improve stop codon read-through therapy for Duchenne muscular dystrophy Hum Mol Genet 2023 32 2455 63 10.1093/hmg/ddad072 37145099 Amar-Schwartz A, et al. Inhibition of nonsense-mediated mRNA decay may improve stop codon read-through therapy for Duchenne muscular dystrophy. Hum Mol Genet. 2023;32:2455–63. 37145099 10.1093/hmg/ddad072 49. Linde L Nonsense-mediated mRNA decay affects nonsense transcript levels and governs response of cystic fibrosis patients to gentamicin J Clin Invest 2007 117 683 92 10.1172/JCI28523 17290305 PMC1783999 Linde L, et al. Nonsense-mediated mRNA decay affects nonsense transcript levels and governs response of cystic fibrosis patients to gentamicin. J Clin Invest. 2007;117:683–92. 17290305 10.1172/JCI28523 PMC1783999 50. Keeling KM Attenuation of nonsense-mediated mRNA decay enhances in vivo nonsense suppression PLoS One 2013 8 e60478 10.1371/journal.pone.0060478 23593225 PMC3622682 Keeling KM, et al. Attenuation of nonsense-mediated mRNA decay enhances in vivo nonsense suppression. PLoS One. 2013;8: e60478. 23593225 10.1371/journal.pone.0060478 PMC3622682 51. French CE. et al. Transcriptome Analysis of Alternative Splicing-Coupled Nonsense-Mediated mRNA Decay in Human Cells Reveals Broad Regulatory Potential. 2020 http://biorxiv.org/lookup/doi/10.1101/2020.07.01.183327 52. Huang L RNA homeostasis governed by cell type-specific and branched feedback loops acting on NMD Mol Cell 2011 43 950 61 10.1016/j.molcel.2011.06.031 21925383 PMC4281029 Huang L, et al. RNA homeostasis governed by cell type-specific and branched feedback loops acting on NMD. Mol Cell. 2011;43:950–61. 21925383 10.1016/j.molcel.2011.06.031 PMC4281029 53. Longman D Identification of a localized nonsense-mediated decay pathway at the endoplasmic reticulum Genes Dev 2020 34 1075 1088 10.1101/gad.338061.120 32616520 PMC7397857 Longman D, et al. Identification of a localized nonsense-mediated decay pathway at the endoplasmic reticulum. Genes Dev. 2020;34:1075–88. 32616520 10.1101/gad.338061.120 PMC7397857 54. Dunham I An integrated encyclopedia of DNA elements in the human genome Nature 2012 489 57 74 10.1038/nature11247 22955616 PMC3439153 Dunham I, et al. An integrated encyclopedia of DNA elements in the human genome. Nature. 2012;489:57–74. 22955616 10.1038/nature11247 PMC3439153 55. Pfab A Belikov S Keuper M Jastroch M Mannervik M Inhibition of mitochondrial transcription by the neurotoxin MPP+ Exp Cell Res 2023 425 113536 10.1016/j.yexcr.2023.113536 36858342 Pfab A, Belikov S, Keuper M, Jastroch M, Mannervik M. Inhibition of mitochondrial transcription by the neurotoxin MPP+. Exp Cell Res. 2023;425: 113536. 36858342 10.1016/j.yexcr.2023.113536 56. Wissink EM, Martinez DM, Ehmsen KT, Yamamoto KR, Lis JT. Glucocorticoid receptor collaborates with pioneer factors and AP-1 to execute genome-wide regulation. 2021. 2021.06.01.444518 Preprint at 10.1101/2021.06.01.444518. 57. Teran NA Nonsense-mediated decay is highly stable across individuals and tissues Am J Hum Genet 2021 108 1401 8 10.1016/j.ajhg.2021.06.008 34216550 PMC8387471 Teran NA, et al. Nonsense-mediated decay is highly stable across individuals and tissues. Am J Hum Genet. 2021;108:1401–8. 34216550 10.1016/j.ajhg.2021.06.008 PMC8387471 58. Hoadley KA Cell-of-origin patterns dominate the molecular classification of 10,000 tumors from 33 types of cancer Cell 2018 173 291 304.e6 10.1016/j.cell.2018.03.022 29625048 PMC5957518 Hoadley KA, et al. Cell-of-origin patterns dominate the molecular classification of 10,000 tumors from 33 types of cancer. Cell. 2018;173:291-304.e6. 29625048 10.1016/j.cell.2018.03.022 PMC5957518 59. Donovan MKR D’Antonio-Chronowska A D’Antonio M Frazer KA Cellular deconvolution of GTEx tissues powers discovery of disease and cell-type associated regulatory variants Nat Commun 2020 11 955 10.1038/s41467-020-14561-0 32075962 PMC7031340 Donovan MKR, D’Antonio-Chronowska A, D’Antonio M, Frazer KA. Cellular deconvolution of GTEx tissues powers discovery of disease and cell-type associated regulatory variants. Nat Commun. 2020;11:955. 32075962 10.1038/s41467-020-14561-0 PMC7031340 60. Charytonowicz D Brody R Sebra R Interpretable and context-free deconvolution of multi-scale whole transcriptomic data with unicell deconvolve Nat Commun 2023 14 1350 10.1038/s41467-023-36961-8 36906603 PMC10008582 Charytonowicz D, Brody R, Sebra R. Interpretable and context-free deconvolution of multi-scale whole transcriptomic data with unicell deconvolve. Nat Commun. 2023;14:1350. 36906603 10.1038/s41467-023-36961-8 PMC10008582 61. Ceccarelli M Molecular profiling reveals biologically discrete subsets and pathways of progression in diffuse glioma Cell 2016 164 550 563 10.1016/j.cell.2015.12.028 26824661 PMC4754110 Ceccarelli M, et al. Molecular profiling reveals biologically discrete subsets and pathways of progression in diffuse glioma. Cell. 2016;164:550–63. 26824661 10.1016/j.cell.2015.12.028 PMC4754110 62. Duan W Novel insights into NeuN: from neuronal marker to splicing regulator Mol Neurobiol 2016 53 1637 1647 10.1007/s12035-015-9122-5 25680637 Duan W, et al. Novel insights into NeuN: from neuronal marker to splicing regulator. Mol Neurobiol. 2016;53:1637–47. 25680637 10.1007/s12035-015-9122-5 63. Castañeyra-Ruiz L AQP4, astrogenesis, and hydrocephalus: a new neurological perspective Int J Mol Sci 2022 23 10438 10.3390/ijms231810438 36142348 PMC9498986 Castañeyra-Ruiz L, et al. AQP4, astrogenesis, and hydrocephalus: a new neurological perspective. Int J Mol Sci. 2022;23: 10438. 36142348 10.3390/ijms231810438 PMC9498986 64. Hassan AZ Dimensionality reduction methods for extracting functional networks from large-scale CRISPR screens Mol Syst Biol 2023 19 e11657 10.15252/msb.202311657 37750448 PMC10632734 Hassan AZ, et al. Dimensionality reduction methods for extracting functional networks from large-scale CRISPR screens. Mol Syst Biol. 2023;19: e11657. 37750448 10.15252/msb.202311657 PMC10632734 65. Barretina J The cancer cell line encyclopedia enables predictive modelling of anticancer drug sensitivity Nature 2012 483 603 607 10.1038/nature11003 22460905 PMC3320027 Barretina J, et al. The cancer cell line encyclopedia enables predictive modelling of anticancer drug sensitivity. Nature. 2012;483:603–7. 22460905 10.1038/nature11003 PMC3320027 66. Girish V Oncogene-like addiction to aneuploidy in human cancers Science 2023 381 eadg4521 10.1126/science.adg4521 37410869 PMC10753973 Girish V, et al. Oncogene-like addiction to aneuploidy in human cancers. Science. 2023;381: eadg4521. 37410869 10.1126/science.adg4521 PMC10753973 67. Wang X Jiang X Mdm2 and MdmX partner to regulate p53 FEBS Lett 2012 586 1390 1396 10.1016/j.febslet.2012.02.049 22673503 Wang X, Jiang X. Mdm2 and MdmX partner to regulate p53. FEBS Lett. 2012;586:1390–6. 22673503 10.1016/j.febslet.2012.02.049 68. Fito-Lopez B Salvadores M Alvarez M-M Supek F Prevalence, causes and impact of TP53-loss phenocopying events in human tumors BMC Biol 2023 21 92 10.1186/s12915-023-01595-1 37095494 PMC10127307 Fito-Lopez B, Salvadores M, Alvarez M-M, Supek F. Prevalence, causes and impact of TP53-loss phenocopying events in human tumors. BMC Biol. 2023;21: 92. 37095494 10.1186/s12915-023-01595-1 PMC10127307 69. Baird TD ICE1 promotes the link between splicing and nonsense-mediated mRNA decay Elife 2018 7 e33178 10.7554/eLife.33178 29528287 PMC5896957 Baird TD, et al. ICE1 promotes the link between splicing and nonsense-mediated mRNA decay. Elife. 2018;7: e33178. 29528287 10.7554/eLife.33178 PMC5896957 70. Alexandrov A Shu M-D Steitz JA Fluorescence amplification method for forward genetic discovery of factors in human mRNA degradation Mol Cell 2017 65 191 201 10.1016/j.molcel.2016.11.032 28017590 PMC5301997 Alexandrov A, Shu M-D, Steitz JA. Fluorescence amplification method for forward genetic discovery of factors in human mRNA degradation. Mol Cell. 2017;65:191–201. 28017590 10.1016/j.molcel.2016.11.032 PMC5301997 71. DepMap 20Q2 Public. figshare. 2020. 10.6084/m9.figshare.12280541.v4 72. Lee S Optimal unified approach for rare-variant association testing with application to small-sample case-control whole-exome sequencing studies Am J Hum Genet 2012 91 224 37 10.1016/j.ajhg.2012.06.007 22863193 PMC3415556 Lee S, et al. Optimal unified approach for rare-variant association testing with application to small-sample case-control whole-exome sequencing studies. Am J Hum Genet. 2012;91:224–37. 22863193 10.1016/j.ajhg.2012.06.007 PMC3415556 73. Rentzsch P Witten D Cooper GM Shendure J Kircher M CADD: predicting the deleteriousness of variants throughout the human genome Nucleic Acids Res 2019 47 D1 D886 D894 10.1093/nar/gky1016 30371827 PMC6323892 Rentzsch P, Witten D, Cooper GM, Shendure J, Kircher M. CADD: predicting the deleteriousness of variants throughout the human genome. Nucleic Acids Res. 2019;47(D1):D886–94. 30371827 10.1093/nar/gky1016 PMC6323892 74. Liu Y Bodmer WF Analysis of P53 mutations and their expression in 56 colorectal cancer cell lines Proc Natl Acad Sci U S A 2006 103 976 981 10.1073/pnas.0510146103 16418264 PMC1327731 Liu Y, Bodmer WF. Analysis of P53 mutations and their expression in 56 colorectal cancer cell lines. Proc Natl Acad Sci U S A. 2006;103:976–81. 16418264 10.1073/pnas.0510146103 PMC1327731 75. Briones AC Nonsense CD247 mutations show dominant-negative features in T-cell receptor expression and function J Allergy Clin Immunol 2024 154 1022 32 10.1016/j.jaci.2024.06.019 38992472 Briones AC, et al. Nonsense CD247 mutations show dominant-negative features in T-cell receptor expression and function. J Allergy Clin Immunol. 2024;154:1022–32. 38992472 10.1016/j.jaci.2024.06.019 76. Liu D Integrative molecular and clinical modeling of clinical outcomes to PD1 blockade in patients with metastatic melanoma Nat Med 2019 25 1916 1927 10.1038/s41591-019-0654-5 31792460 PMC6898788 Liu D, et al. Integrative molecular and clinical modeling of clinical outcomes to PD1 blockade in patients with metastatic melanoma. Nat Med. 2019;25:1916–27. 31792460 10.1038/s41591-019-0654-5 PMC6898788 77. El-Bchiri J Nonsense-mediated mRNA decay impacts MSI-driven carcinogenesis and anti-tumor immunity in colorectal cancers PLoS One 2008 3 e2583 10.1371/journal.pone.0002583 18612427 PMC2440797 El-Bchiri J, et al. Nonsense-mediated mRNA decay impacts MSI-driven carcinogenesis and anti-tumor immunity in colorectal cancers. PLoS One. 2008;3: e2583. 18612427 10.1371/journal.pone.0002583 PMC2440797 78. Becker JP NMD inhibition by 5-azacytidine augments presentation of immunogenic frameshift-derived neoepitopes iScience 2021 24 102389 10.1016/j.isci.2021.102389 33981976 PMC8082087 Becker JP, et al. NMD inhibition by 5-azacytidine augments presentation of immunogenic frameshift-derived neoepitopes. iScience. 2021;24: 102389. 33981976 10.1016/j.isci.2021.102389 PMC8082087 79. Nogueira G Fernandes R García-Moreno JF Romão L Nonsense-mediated RNA decay and its bipolar function in cancer Mol Cancer 2021 20 72 10.1186/s12943-021-01364-0 33926465 PMC8082775 Nogueira G, Fernandes R, García-Moreno JF, Romão L. Nonsense-mediated RNA decay and its bipolar function in cancer. Mol Cancer. 2021;20:72. 33926465 10.1186/s12943-021-01364-0 PMC8082775 80. Carroll TM Tumor monocyte content predicts immunochemotherapy outcomes in esophageal adenocarcinoma Cancer Cell 2023 41 1222 1241.e7 10.1016/j.ccell.2023.06.006 37433281 PMC11913779 Carroll TM, et al. Tumor monocyte content predicts immunochemotherapy outcomes in esophageal adenocarcinoma. Cancer Cell. 2023;41:1222-1241.e7. 37433281 10.1016/j.ccell.2023.06.006 PMC11913779 81. Motzer RJ Avelumab plus axitinib versus sunitinib for advanced renal-cell carcinoma N Engl J Med 2019 380 1103 1115 10.1056/NEJMoa1816047 30779531 PMC6716603 Motzer RJ, et al. Avelumab plus axitinib versus sunitinib for advanced renal-cell carcinoma. N Engl J Med. 2019;380:1103–15. 30779531 10.1056/NEJMoa1816047 PMC6716603 82. Martínez-Jiménez F Pan-cancer whole-genome comparison of primary and metastatic solid tumours Nature 2023 618 333 341 10.1038/s41586-023-06054-z 37165194 PMC10247378 Martínez-Jiménez F, et al. Pan-cancer whole-genome comparison of primary and metastatic solid tumours. Nature. 2023;618:333–41. 37165194 10.1038/s41586-023-06054-z PMC10247378 83. Riaz N Tumor and microenvironment evolution during immunotherapy with nivolumab Cell 2017 171 934 949.e16 10.1016/j.cell.2017.09.028 29033130 PMC5685550 Riaz N, et al. Tumor and microenvironment evolution during immunotherapy with nivolumab. Cell. 2017;171:934-949.e16. 29033130 10.1016/j.cell.2017.09.028 PMC5685550 84. Li Y Pan-cancer proteogenomics connects oncogenic drivers to functional states Cell 2023 186 3921 3944.e25 10.1016/j.cell.2023.07.014 37582357 Li Y, et al. Pan-cancer proteogenomics connects oncogenic drivers to functional states. Cell. 2023;186:3921-3944.e25. 37582357 10.1016/j.cell.2023.07.014 85. Chen B Up-frameshift protein 1 promotes tumor progression by regulating apoptosis and epithelial-mesenchymal transition of colorectal cancer Technol Cancer Res Treat 2021 20 15330338211064438 10.1177/15330338211064438 34939866 PMC8721398 Chen B, et al. Up-frameshift protein 1 promotes tumor progression by regulating apoptosis and epithelial-mesenchymal transition of colorectal cancer. Technol Cancer Res Treat. 2021;20:15330338211064438. 34939866 10.1177/15330338211064438 PMC8721398 86. Zhu C UPF1 promotes chemoresistance to oxaliplatin through regulation of TOP2A activity and maintenance of stemness in colorectal cancer Cell Death Dis 2021 12 1 15 10.1038/s41419-021-03798-2 34021129 PMC8140095 Zhu C, et al. UPF1 promotes chemoresistance to oxaliplatin through regulation of TOP2A activity and maintenance of stemness in colorectal cancer. Cell Death Dis. 2021;12:1–15. 34021129 10.1038/s41419-021-03798-2 PMC8140095 87. Jaffrey SR Wilkinson MF Nonsense-mediated RNA decay in the brain: emerging modulator of neural development and disease Nat Rev Neurosci 2018 19 715 728 10.1038/s41583-018-0079-z 30410025 PMC6396682 Jaffrey SR, Wilkinson MF. Nonsense-mediated RNA decay in the brain: emerging modulator of neural development and disease. Nat Rev Neurosci. 2018;19:715–28. 30410025 10.1038/s41583-018-0079-z PMC6396682 88. Bruno IG Identification of a microRNA that activates gene expression by repressing nonsense-mediated RNA decay Mol Cell 2011 42 500 10 10.1016/j.molcel.2011.04.018 21596314 PMC3123134 Bruno IG, et al. Identification of a microRNA that activates gene expression by repressing nonsense-mediated RNA decay. Mol Cell. 2011;42:500–10. 21596314 10.1016/j.molcel.2011.04.018 PMC3123134 89. Wang G Jiang B Jia C Chai B Liang A Microrna 125 represses nonsense-mediated mRNA decay by regulating SMG1 expression Biochem Biophys Res Commun 2013 435 16 20 10.1016/j.bbrc.2013.03.129 23583196 Wang G, Jiang B, Jia C, Chai B, Liang A. Microrna 125 represses nonsense-mediated mRNA decay by regulating SMG1 expression. Biochem Biophys Res Commun. 2013;435:16–20. 23583196 10.1016/j.bbrc.2013.03.129 90. Lattanzi A Dynamic activity of miR-125b and miR-93 during murine neural stem cell differentiation in vitro and in the subventricular zone neurogenic niche PLoS One 2013 8 e67411 10.1371/journal.pone.0067411 23826292 PMC3694868 Lattanzi A, et al. Dynamic activity of miR-125b and miR-93 during murine neural stem cell differentiation in vitro and in the subventricular zone neurogenic niche. PLoS One. 2013;8: e67411. 23826292 10.1371/journal.pone.0067411 PMC3694868 91. Weischenfeldt J NMD is essential for hematopoietic stem and progenitor cells and for eliminating by-products of programmed DNA rearrangements Genes Dev 2008 22 1381 1396 10.1101/gad.468808 18483223 PMC2377192 Weischenfeldt J, et al. NMD is essential for hematopoietic stem and progenitor cells and for eliminating by-products of programmed DNA rearrangements. Genes Dev. 2008;22:1381–96. 18483223 10.1101/gad.468808 PMC2377192 92. Huang Z Peng Y Wei Y Tan Y Nonsense-mediated mRNA decay promote C2C12 cell proliferation by targeting PIK3R5 J Muscle Res Cell Motil 2023 44 11 23 10.1007/s10974-022-09639-9 36512272 Huang Z, Peng Y, Wei Y, Tan Y. Nonsense-mediated mRNA decay promote C2C12 cell proliferation by targeting PIK3R5. J Muscle Res Cell Motil. 2023;44:11–23. 36512272 10.1007/s10974-022-09639-9 93. Thoren LA UPF2 is a critical regulator of liver development, function and regeneration PLoS One 2010 5 e11650 10.1371/journal.pone.0011650 20657840 PMC2906512 Thoren LA, et al. UPF2 is a critical regulator of liver development, function and regeneration. PLoS One. 2010;5:e11650. 20657840 10.1371/journal.pone.0011650 PMC2906512 94. McIlwain DR Smg1 is required for embryogenesis and regulates diverse genes via alternative splicing coupled to nonsense-mediated mRNA decay Proc Natl Acad Sci U S A 2010 107 12186 91 10.1073/pnas.1007336107 20566848 PMC2901484 McIlwain DR, et al. Smg1 is required for embryogenesis and regulates diverse genes via alternative splicing coupled to nonsense-mediated mRNA decay. Proc Natl Acad Sci U S A. 2010;107:12186–91. 20566848 10.1073/pnas.1007336107 PMC2901484 95. Mühlemann O Spermatogenesis studies reveal a distinct nonsense-mediated mRNA decay (NMD) mechanism for mRNAs with long 3′UTRs PLoS Genet 2016 12 e1005979 10.1371/journal.pgen.1005979 27149371 PMC4858265 Mühlemann O. Spermatogenesis studies reveal a distinct nonsense-mediated mRNA decay (NMD) mechanism for mRNAs with long 3′UTRs. PLoS Genet. 2016;12:e1005979. 27149371 10.1371/journal.pgen.1005979 PMC4858265 96. Hansford S Hereditary diffuse gastric cancer syndrome: CDH1 JAMA Oncol 2015 1 23 32 10.1001/jamaoncol.2014.168 26182300 Hansford S, et al. Hereditary diffuse gastric cancer syndrome: CDH1 26182300 10.1001/jamaoncol.2014.168 97. Pharoah PD Guilford P Caldas C International Gastric Cancer Linkage Consortium Incidence of gastric cancer and breast cancer in CDH1 (E-cadherin) mutation carriers from hereditary diffuse gastric cancer families Gastroenterology 2001 121 1348 53 10.1053/gast.2001.29611 11729114 Pharoah PD, Guilford P, Caldas C, International Gastric Cancer Linkage Consortium. Incidence of gastric cancer and breast cancer in CDH1 (E-cadherin) mutation carriers from hereditary diffuse gastric cancer families. Gastroenterology. 2001;121:1348–53. 11729114 10.1053/gast.2001.29611 98. Kaurah P Founder and recurrent CDH1 mutations in families with hereditary diffuse gastric cancer JAMA 2007 297 2360 72 10.1001/jama.297.21.2360 17545690 Kaurah P, et al. Founder and recurrent CDH1 mutations in families with hereditary diffuse gastric cancer. JAMA. 2007;297:2360–72. 17545690 10.1001/jama.297.21.2360 99. Kurian AW Clinical evaluation of a multiple-gene sequencing panel for hereditary cancer risk assessment J Clin Oncol 2014 32 19 2001 9 10.1200/JCO.2013.53.6607 24733792 PMC4067941 Kurian AW, et al. Clinical evaluation of a multiple-gene sequencing panel for hereditary cancer risk assessment. J Clin Oncol. 2014;32(19):2001–9. 24733792 10.1200/JCO.2013.53.6607 PMC4067941 100. Karam R The NMD mRNA surveillance pathway downregulates aberrant E-cadherin transcripts in gastric cancer cells and in CDH1 mutation carriers Oncogene 2008 27 4255 4260 10.1038/onc.2008.62 18427545 Karam R, et al. The NMD mRNA surveillance pathway downregulates aberrant E-cadherin transcripts in gastric cancer cells and in CDH1 mutation carriers. Oncogene. 2008;27:4255–60. 18427545 10.1038/onc.2008.62 101. Munkhbaatar E MCL-1 gains occur with high frequency in lung adenocarcinoma and can be targeted therapeutically Nat Commun 2020 11 4527 10.1038/s41467-020-18372-1 32913197 PMC7484793 Munkhbaatar E, et al. MCL-1 gains occur with high frequency in lung adenocarcinoma and can be targeted therapeutically. Nat Commun. 2020;11:4527. 32913197 10.1038/s41467-020-18372-1 PMC7484793 102. Watson EV Chromosome evolution screens recapitulate tissue-specific tumor aneuploidy patterns Nat Genet 2024 10.1038/s41588-024-01665-2 38388848 PMC11096114 Watson EV, et al. Chromosome evolution screens recapitulate tissue-specific tumor aneuploidy patterns. Nat Genet. 2024. 10.1038/s41588-024-01665-2. 38388848 10.1038/s41588-024-01665-2 PMC11096114 103. Wang Y Devereux W Stewart TM Casero RA Cloning and characterization of human polyamine-modulated factor-1, a transcriptional cofactor that regulates the transcription of the spermidine/spermine N(1)-acetyltransferase gene J Biol Chem 1999 274 22095 22101 10.1074/jbc.274.31.22095 10419538 Wang Y, Devereux W, Stewart TM, Casero RA. Cloning and characterization of human polyamine-modulated factor-1, a transcriptional cofactor that regulates the transcription of the spermidine/spermine N(1)-acetyltransferase gene. J Biol Chem. 1999;274:22095–101. 10419538 10.1074/jbc.274.31.22095 104. Tsai S-M Chu K-C Jiang Y-J Newly identified Gon4l/Udu-interacting proteins implicate novel functions Sci Rep 2020 10 14213 10.1038/s41598-020-70855-9 32848183 PMC7449961 Tsai S-M, Chu K-C, Jiang Y-J. Newly identified Gon4l/Udu-interacting proteins implicate novel functions. Sci Rep. 2020;10:14213. 32848183 10.1038/s41598-020-70855-9 PMC7449961 105. Tanackovic G PRPF mutations are associated with generalized defects in spliceosome formation and pre-mRNA splicing in patients with retinitis pigmentosa Hum Mol Genet 2011 20 2116 30 10.1093/hmg/ddr094 21378395 PMC3090192 Tanackovic G, et al. PRPF mutations are associated with generalized defects in spliceosome formation and pre-mRNA splicing in patients with retinitis pigmentosa. Hum Mol Genet. 2011;20:2116–30. 21378395 10.1093/hmg/ddr094 PMC3090192 106. Latrick CM Molecular basis and specificity of H2A.Z–H2B recognition and deposition by the histone chaperone YL1 Nat Struct Mol Biol 2016 23 309 316 10.1038/nsmb.3189 26974126 Latrick CM, et al. Molecular basis and specificity of H2A.Z–H2B recognition and deposition by the histone chaperone YL1. Nat Struct Mol Biol. 2016;23:309–16. 26974126 10.1038/nsmb.3189 107. Leeksma AC The effect of SF3B1 mutation on the DNA damage response and nonsense-mediated mRNA decay in cancer Front Oncol 2020 10 609409 10.3389/fonc.2020.609409 33585229 PMC7880055 Leeksma AC, et al. The effect of SF3B1 mutation on the DNA damage response and nonsense-mediated mRNA decay in cancer. Front Oncol. 2020;10: 609409. 33585229 10.3389/fonc.2020.609409 PMC7880055 108. Cheruiyot A Nonsense-mediated RNA decay is a unique vulnerability of cancer cells harboring SF3B1 or U2AF1 mutations Cancer Res 2021 81 4499 513 10.1158/0008-5472.CAN-20-4016 34215620 PMC8416940 Cheruiyot A, et al. Nonsense-mediated RNA decay is a unique vulnerability of cancer cells harboring SF3B1 or U2AF1 mutations. Cancer Res. 2021;81:4499–513. 34215620 10.1158/0008-5472.CAN-20-4016 PMC8416940 109. Embree CM, Stephanou A, Singh G. Direct and indirect effects of spliceosome disruption compromise gene regulation by Nonsense-Mediated mRNA Decay. 2024;12.27.630533 Preprint at 10.1101/2024.12.27.630533. 10.1080/15476286.2025.2552517 PMC12427521 40856040 110. Nguyen LS Contribution of copy number variants involving nonsense-mediated mRNA decay pathway genes to neuro-developmental disorders Hum Mol Genet 2013 22 1816 25 10.1093/hmg/ddt035 23376982 Nguyen LS, et al. Contribution of copy number variants involving nonsense-mediated mRNA decay pathway genes to neuro-developmental disorders. Hum Mol Genet. 2013;22:1816–25. 23376982 10.1093/hmg/ddt035 111. Parra-Damas A Rubió-Ferrarons L Shen J Saura CA CRTC1 mediates preferential transcription at neuronal activity-regulated CRE/TATA promoters Sci Rep 2017 7 18004 10.1038/s41598-017-18215-y 29269871 PMC5740062 Parra-Damas A, Rubió-Ferrarons L, Shen J, Saura CA. CRTC1 mediates preferential transcription at neuronal activity-regulated CRE/TATA promoters. Sci Rep. 2017;7:18004. 29269871 10.1038/s41598-017-18215-y PMC5740062 112. Toda T Nup153 interacts with Sox2 to enable bimodal gene regulation and maintenance of neural progenitor cells Cell Stem Cell 2017 21 618 634.e7 10.1016/j.stem.2017.08.012 28919367 Toda T, et al. Nup153 interacts with Sox2 to enable bimodal gene regulation and maintenance of neural progenitor cells. Cell Stem Cell. 2017;21:618-634.e7. 28919367 10.1016/j.stem.2017.08.012 113. Cao Z KDM6B is an androgen regulated gene and plays oncogenic roles by demethylating H3K27me3 at cyclin D1 promoter in prostate cancer Cell Death Dis 2021 12 1 15 10.1038/s41419-020-03354-4 33414463 PMC7791132 Cao Z, et al. KDM6B is an androgen regulated gene and plays oncogenic roles by demethylating H3K27me3 at cyclin D1 promoter in prostate cancer. Cell Death Dis. 2021;12:1–15. 33414463 10.1038/s41419-020-03354-4 PMC7791132 114. D’Oto A KDM6B promotes activation of the oncogenic CDK4/6-pRB-E2F pathway by maintaining enhancer activity in MYCN-amplified neuroblastoma Nat Commun 2021 12 7204 10.1038/s41467-021-27502-2 34893606 PMC8664842 D’Oto A, et al. KDM6B promotes activation of the oncogenic CDK4/6-pRB-E2F pathway by maintaining enhancer activity in MYCN-amplified neuroblastoma. Nat Commun. 2021;12:7204. 34893606 10.1038/s41467-021-27502-2 PMC8664842 115. Stolerman ES Genetic variants in the KDM6B gene are associated with neurodevelopmental delays and dysmorphic features Am J Med Genet A 2019 179 1276 86 10.1002/ajmg.a.61173 31124279 Stolerman ES, et al. Genetic variants in the KDM6B gene are associated with neurodevelopmental delays and dysmorphic features. Am J Med Genet A. 2019;179:1276–86. 31124279 10.1002/ajmg.a.61173 116. Sun B Chen L Mapping genetic variants for nonsense-mediated mRNA decay regulation across human tissues Genome Biol 2023 24 164 10.1186/s13059-023-03004-w 37434206 PMC10337212 Sun B, Chen L. Mapping genetic variants for nonsense-mediated mRNA decay regulation across human tissues. Genome Biol. 2023;24:164. 37434206 10.1186/s13059-023-03004-w PMC10337212 117. Carrard J Identifying potent nonsense-mediated mRNA decay inhibitors with a novel screening system Biomedicines 2023 11 2801 10.3390/biomedicines11102801 37893174 PMC10604367 Carrard J, et al. Identifying potent nonsense-mediated mRNA decay inhibitors with a novel screening system. Biomedicines. 2023;11:2801. 37893174 10.3390/biomedicines11102801 PMC10604367 118. Martin L Identification and characterization of small molecules that inhibit nonsense-mediated RNA decay and suppress nonsense p53 mutations Cancer Res 2014 74 3104 13 10.1158/0008-5472.CAN-13-2235 24662918 PMC4040335 Martin L, et al. Identification and characterization of small molecules that inhibit nonsense-mediated RNA decay and suppress nonsense p53 mutations. Cancer Res. 2014;74:3104–13. 24662918 10.1158/0008-5472.CAN-13-2235 PMC4040335 119. Nasif S Inhibition of nonsense-mediated mRNA decay reduces the tumorigenicity of human fibrosarcoma cells NAR Cancer 2023 5 zcad048 10.1093/narcan/zcad048 37681034 PMC10480688 Nasif S, et al. Inhibition of nonsense-mediated mRNA decay reduces the tumorigenicity of human fibrosarcoma cells. NAR Cancer. 2023;5: zcad048. 37681034 10.1093/narcan/zcad048 PMC10480688 120. Popp MW Maquat LE Attenuation of nonsense-mediated mRNA decay facilitates the response to chemotherapeutics Nat Commun 2015 6 6632 10.1038/ncomms7632 25808464 PMC4375787 Popp MW, Maquat LE. Attenuation of nonsense-mediated mRNA decay facilitates the response to chemotherapeutics. Nat Commun. 2015;6:6632. 25808464 10.1038/ncomms7632 PMC4375787 121. Weinstein JN The cancer genome atlas pan-cancer analysis project Nat Genet 2013 45 1113 1120 10.1038/ng.2764 24071849 PMC3919969 Weinstein JN, et al. The cancer genome atlas pan-cancer analysis project. Nat Genet. 2013;45:1113–20. 24071849 10.1038/ng.2764 PMC3919969 122. Grossman RL Toward a shared vision for cancer genomic data N Engl J Med 2016 375 1109 1112 10.1056/NEJMp1607591 27653561 PMC6309165 Grossman RL, et al. Toward a shared vision for cancer genomic data. N Engl J Med. 2016;375:1109–12. 27653561 10.1056/NEJMp1607591 PMC6309165 123. Broad GDAC Firehose. https://gdac.broadinstitute.org/ 124. Lonsdale J The genotype-tissue expression (GTEx) project Nat Genet 2013 45 580 585 10.1038/ng.2653 23715323 PMC4010069 Lonsdale J, et al. The genotype-tissue expression (GTEx) project. Nat Genet. 2013;45:580–5. 23715323 10.1038/ng.2653 PMC4010069 125. Cerami E The cBio cancer genomics portal: an open platform for exploring multidimensional cancer genomics data Cancer Discov 2012 2 401 4 10.1158/2159-8290.CD-12-0095 22588877 PMC3956037 Cerami E, et al. The cBio cancer genomics portal: an open platform for exploring multidimensional cancer genomics data. Cancer Discov. 2012;2:401–4. 22588877 10.1158/2159-8290.CD-12-0095 PMC3956037 126. Charoentong P Pan-cancer immunogenomic analyses reveal genotype-immunophenotype relationships and predictors of response to checkpoint blockade Cell Rep 2017 18 248 62 10.1016/j.celrep.2016.12.019 28052254 Charoentong P, et al. Pan-cancer immunogenomic analyses reveal genotype-immunophenotype relationships and predictors of response to checkpoint blockade. Cell Rep. 2017;18:248–62. 28052254 10.1016/j.celrep.2016.12.019 127. Koboldt DC Comprehensive molecular portraits of human breast tumours Nature 2012 490 61 70 10.1038/nature11412 23000897 PMC3465532 Koboldt DC, et al. Comprehensive molecular portraits of human breast tumours. Nature. 2012;490:61–70. 23000897 10.1038/nature11412 PMC3465532 128. Abeshouse A Comprehensive and integrated genomic characterization of adult soft tissue sarcomas Cell 2017 171 950 965.e28 10.1016/j.cell.2017.10.014 29100075 PMC5693358 Abeshouse A, et al. Comprehensive and integrated genomic characterization of adult soft tissue sarcomas. Cell. 2017;171:950-965.e28. 29100075 10.1016/j.cell.2017.10.014 PMC5693358 129. Robertson AG Comprehensive molecular characterization of muscle-invasive bladder cancer Cell 2017 171 540 556.e25 10.1016/j.cell.2017.09.007 28988769 PMC5687509 Robertson AG, et al. Comprehensive molecular characterization of muscle-invasive bladder cancer. Cell. 2017;171:540-556.e25. 28988769 10.1016/j.cell.2017.09.007 PMC5687509 130. Lawrence MS Comprehensive genomic characterization of head and neck squamous cell carcinomas Nature 2015 517 576 582 10.1038/nature14129 25631445 PMC4311405 Lawrence MS, et al. Comprehensive genomic characterization of head and neck squamous cell carcinomas. Nature. 2015;517:576–82. 25631445 10.1038/nature14129 PMC4311405 131. Muzny DM Comprehensive molecular characterization of human colon and rectal cancer Nature 2012 487 330 337 10.1038/nature11252 22810696 PMC3401966 Muzny DM, et al. Comprehensive molecular characterization of human colon and rectal cancer. Nature. 2012;487:330–7. 22810696 10.1038/nature11252 PMC3401966 132. Levine DA Integrated genomic characterization of endometrial carcinoma Nature 2013 497 67 73 10.1038/nature12113 23636398 PMC3704730 Levine DA. Integrated genomic characterization of endometrial carcinoma. Nature. 2013;497:67–73. 23636398 10.1038/nature12113 PMC3704730 133. Bass AJ Comprehensive molecular characterization of gastric adenocarcinoma Nature 2014 513 202 209 10.1038/nature13480 25079317 PMC4170219 Bass AJ, et al. Comprehensive molecular characterization of gastric adenocarcinoma. Nature. 2014;513:202–9. 25079317 10.1038/nature13480 PMC4170219 134. Alexandrov LB Kim J Haradhvala NJ Huang MN Tian Ng AW Wu Y Boot A Covington KR Gordenin DA Bergstrom EN Islam SA The repertoire of mutational signatures in human cancer Nature 2020 578 7793 94 101 10.1038/s41586-020-1943-3 32025018 PMC7054213 Alexandrov LB, Kim J, Haradhvala NJ, Huang MN, Tian Ng AW, Wu Y, Boot A, Covington KR, Gordenin DA, Bergstrom EN, Islam SA. The repertoire of mutational signatures in human cancer. Nature. 2020;578(7793):94–101. 32025018 10.1038/s41586-020-1943-3 PMC7054213 135. Kim J Integrated genomic characterization of oesophageal carcinoma Nature 2017 541 169 175 10.1038/nature20805 28052061 PMC5651175 Kim J, et al. Integrated genomic characterization of oesophageal carcinoma. Nature. 2017;541:169–75. 28052061 10.1038/nature20805 PMC5651175 136. gtex-pipeline/rnaseq at master · broadinstitute/gtex-pipeline. GitHub https://github.com/broadinstitute/gtex-pipeline/tree/master/rnaseq 137. Dobin A STAR: ultrafast universal RNA-seq aligner Bioinformatics 2013 29 15 21 10.1093/bioinformatics/bts635 23104886 PMC3530905 Dobin A, et al. STAR: ultrafast universal RNA-seq aligner. Bioinformatics. 2013;29:15–21. 23104886 10.1093/bioinformatics/bts635 PMC3530905 138. Li B Dewey CN RSEM: accurate transcript quantification from RNA-seq data with or without a reference genome BMC Bioinformatics 2011 12 323 10.1186/1471-2105-12-323 21816040 PMC3163565 Li B, Dewey CN. RSEM: accurate transcript quantification from RNA-seq data with or without a reference genome. BMC Bioinformatics. 2011;12:323. 21816040 10.1186/1471-2105-12-323 PMC3163565 139. van de Geijn B McVicker G Gilad Y Pritchard JK WASP: allele-specific software for robust molecular quantitative trait locus discovery Nat Methods 2015 12 1061 1063 10.1038/nmeth.3582 26366987 PMC4626402 van de Geijn B, McVicker G, Gilad Y, Pritchard JK. WASP: allele-specific software for robust molecular quantitative trait locus discovery. Nat Methods. 2015;12:1061–3. 26366987 10.1038/nmeth.3582 PMC4626402 140. Kim S Strelka2: fast and accurate calling of germline and somatic variants Nat Methods 2018 15 591 594 10.1038/s41592-018-0051-x 30013048 Kim S, et al. Strelka2: fast and accurate calling of germline and somatic variants. Nat Methods. 2018;15:591–4. 30013048 10.1038/s41592-018-0051-x 141. Wang K Li M Hakonarson H ANNOVAR: functional annotation of genetic variants from high-throughput sequencing data Nucleic Acids Res 2010 38 e164 10.1093/nar/gkq603 20601685 PMC2938201 Wang K, Li M, Hakonarson H. ANNOVAR: functional annotation of genetic variants from high-throughput sequencing data. Nucleic Acids Res. 2010;38: e164. 20601685 10.1093/nar/gkq603 PMC2938201 142. Gudmundsson S Variant interpretation using population databases: lessons from gnomAD Hum Mutat 2022 43 1012 30 10.1002/humu.24309 34859531 PMC9160216 Gudmundsson S, et al. Variant interpretation using population databases: lessons from gnomAD. Hum Mutat. 2022;43:1012–30. 34859531 10.1002/humu.24309 PMC9160216 143. Ormond C Ryan NM Corvin A Heron EA Converting single nucleotide variants between genome builds: from cautionary tale to solution Brief Bioinform 2021 22 bbab069 10.1093/bib/bbab069 33822888 PMC8425424 Ormond C, Ryan NM, Corvin A, Heron EA. Converting single nucleotide variants between genome builds: from cautionary tale to solution. Brief Bioinform. 2021;22: bbab069. 33822888 10.1093/bib/bbab069 PMC8425424 144. Kim Y A spectrum of nonsense-mediated mRNA decay efficiency along the degree of mutational constraint Commun Biol 2024 7 1 9 10.1038/s42003-024-07136-y 39511375 PMC11544006 Kim Y, et al. A spectrum of nonsense-mediated mRNA decay efficiency along the degree of mutational constraint. Commun Biol. 2024;7:1–9. 39511375 10.1038/s42003-024-07136-y PMC11544006 145. van der Lee R Wiel L van Dam TJP Huynen MA Genome-scale detection of positive selection in nine primates predicts human-virus evolutionary conflicts Nucleic Acids Res 2017 45 10634 10648 10.1093/nar/gkx704 28977405 PMC5737536 van der Lee R, Wiel L, van Dam TJP, Huynen MA. Genome-scale detection of positive selection in nine primates predicts human-virus evolutionary conflicts. Nucleic Acids Res. 2017;45:10634–48. 28977405 10.1093/nar/gkx704 PMC5737536 146. Karczewski KJ The mutational constraint spectrum quantified from variation in 141,456 humans Nature 2020 581 434 443 10.1038/s41586-020-2308-7 32461654 PMC7334197 Karczewski KJ, et al. The mutational constraint spectrum quantified from variation in 141,456 humans. Nature. 2020;581:434–43. 32461654 10.1038/s41586-020-2308-7 PMC7334197 147. Stan. Stan //mc-stan.org/. 148. Bayesian Applied Regression Modeling via Stan. https://mc-stan.org/rstanarm/. 149. Wang Z Chu T Choate LA Danko CG Identification of regulatory elements from nascent transcription using dREG Genome Res 2019 29 293 303 10.1101/gr.238279.118 30573452 PMC6360809 Wang Z, Chu T, Choate LA, Danko CG. Identification of regulatory elements from nascent transcription using dREG. Genome Res. 2019;29:293–303. 30573452 10.1101/gr.238279.118 PMC6360809 150. UCSC Xena. https://xenabrowser.net/datapages/?cohort=TCGA%20Pan-Cancer%20(PANCAN)&removeHub=https%3A%2F%2Fxena.treehouse.gi.ucsc.edu%3A443. 151. Hug N Longman D Cáceres JF Mechanism and regulation of the nonsense-mediated decay pathway Nucleic Acids Res 2016 44 1483 1495 10.1093/nar/gkw010 26773057 PMC4770240 Hug N, Longman D, Cáceres JF. Mechanism and regulation of the nonsense-mediated decay pathway. Nucleic Acids Res. 2016;44:1483–95. 26773057 10.1093/nar/gkw010 PMC4770240 152. Sondka Z The COSMIC cancer gene census: describing genetic dysfunction across all human cancers Nat Rev Cancer 2018 18 696 705 10.1038/s41568-018-0060-1 30293088 PMC6450507 Sondka Z, et al. The COSMIC cancer gene census: describing genetic dysfunction across all human cancers. Nat Rev Cancer. 2018;18:696–705. 30293088 10.1038/s41568-018-0060-1 PMC6450507 153. Erichson NB Sparse principal component analysis via variable projection SIAM J Appl Math 2020 80 977 1002 10.1137/18M1211350 Erichson NB, et al. Sparse principal component analysis via variable projection. SIAM J Appl Math. 2020;80:977–1002. 154. Johnson WE Li C Rabinovic A Adjusting batch effects in microarray expression data using empirical Bayes methods Biostatistics 2007 8 118 127 10.1093/biostatistics/kxj037 16632515 Johnson WE, Li C, Rabinovic A. Adjusting batch effects in microarray expression data using empirical Bayes methods. Biostatistics. 2007;8:118–27. 16632515 10.1093/biostatistics/kxj037 155. Matching cell lines with cancer type and subtype of origin via mutational, epigenomic, and transcriptomic patterns | Science Advances. https://www.science.org/doi/10.1126/sciadv.aba1862. 10.1126/sciadv.aba1862 PMC7458440 32937430 156. Hassan AZ. et al. Data repository: ‘Dimensionality reduction methods for extracting functional networks from large-scale CRISPR screens’. 2023 doi:10.15252/msb.202311657. 10.15252/msb.202311657 PMC10632734 37750448 157. Vali-Pour M The impact of rare germline variants on human somatic mutation processes Nat Commun 2022 13 3724 10.1038/s41467-022-31483-1 35764656 PMC9240060 Vali-Pour M, et al. The impact of rare germline variants on human somatic mutation processes. Nat Commun. 2022;13:3724. 35764656 10.1038/s41467-022-31483-1 PMC9240060 158. Solimini NL Recurrent hemizygous deletions in cancers may optimize proliferative potential Science 2012 337 104 109 10.1126/science.1219580 22628553 PMC4027969 Solimini NL, et al. Recurrent hemizygous deletions in cancers may optimize proliferative potential. Science. 2012;337:104–9. 22628553 10.1126/science.1219580 PMC4027969 159. Dietlein F Identification of cancer driver genes based on nucleotide context Nat Genet 2020 52 208 218 10.1038/s41588-019-0572-y 32015527 PMC7031046 Dietlein F, et al. Identification of cancer driver genes based on nucleotide context. Nat Genet. 2020;52:208–18. 32015527 10.1038/s41588-019-0572-y PMC7031046 160. Martincorena I Universal patterns of selection in cancer and somatic tissues Cell 2017 171 1029 1041.e21 10.1016/j.cell.2017.09.042 29056346 PMC5720395 Martincorena I, et al. Universal patterns of selection in cancer and somatic tissues. Cell. 2017;171:1029-1041.e21. 29056346 10.1016/j.cell.2017.09.042 PMC5720395 161. Frankish A Gencode reference annotation for the human and mouse genomes Nucleic Acids Res 2019 47 D766 D773 10.1093/nar/gky955 30357393 PMC6323946 Frankish A, et al. Gencode reference annotation for the human and mouse genomes. Nucleic Acids Res. 2019;47:D766–73. 30357393 10.1093/nar/gky955 PMC6323946 162. A computational framework to quantify individual-level NMD efficiency and assess its variability across human tissues, tumors and individuals using RNA-seq and WES data. Github; Available: https://github.com/gpalou4/iNMDeff 163. Palou Márquez G, Supek F. Variable efficiency of nonsense-mediated mRNA decay across human tissues, tumors and individuals. 2025. Zenodo. 10.5281/zenodo.15974216. ",
  "metadata": {
    "Title of this paper": "Gencode reference annotation for the human and mouse genomes",
    "Journal it was published in:": "Genome Biology",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12477815/"
  }
}