{
  "title": "Paper_814",
  "abstract": "pmc Health Sci Rep Health Sci Rep 3569 hscirep HSR2 Health Science Reports 2398-8835 Wiley PMC12463713 PMC12463713.1 12463713 12463713 41017868 10.1002/hsr2.71289 HSR271289 1 Narrative Review Narrative Review Lip, Oral Cavity, and Pharyngeal Cancers: Global Epidemiology, Risk Factors, and Prevention: A Narrative Review Ebrahimi Rasoul  1 Masouri Mohammad Mahdi  1 Razeghian Iman  1 Azad Ghazal  1 Nejadghaderi Seyed Aria https://orcid.org/0000-0002-8692-9720  2  3 a.nejadghaderi@kmu.ac.ir ariang20@gmail.com   1 School of Medicine Shahid Beheshti University of Medical Sciences Tehran Iran   2 HIV/STI Surveillance Research Center, and WHO Collaborating Center for HIV Surveillance, Institute for Futures Studies in Health Kerman University of Medical Sciences Kerman Iran   3 Knowledge Hub for Migrant and Refugee Health, Institute for Futures Studies in Health Kerman University of Medical Sciences Kerman Iran * Correspondence: a.nejadghaderi@kmu.ac.ir ariang20@gmail.com 25 9 2025 10 2025 8 10 497543 10.1002/hsr2.v8.10 e71289 21 7 2025 29 4 2025 09 9 2025 25 09 2025 27 09 2025 29 09 2025 © 2025 The Author(s). Health Science Reports https://creativecommons.org/licenses/by/4.0/ This is an open access article under the terms of the http://creativecommons.org/licenses/by/4.0/ ABSTRACT Background and Aims Lip, oral cavity, and pharyngeal cancers (LOPC) are malignancies arising in the lip, oral cavity, and pharyngeal tissues, often asymptomatic in early stages. We aimed to perform a narrative review of the literature on the global LOPC epidemiology, economic burden, risk factors, as well as preventive strategies. Methods A comprehensive search was conducted in PubMed and Google Scholar up to June 2024, using keywords related to lip, oral, and pharyngeal cancers. Results There are several risk factors for these cancers, including tobacco smoking, alcohol consumption, low socioeconomic status, dietary factors (high meat and low fruits or vegetables consumption), genetics, radiation exposure, demographic factors, poor oropharyngeal health, human papillomavirus (HPV) infection, occupational exposures, and other factors, such as family history of cancer. Preventive strategies such as increasing public awareness, promoting routine dental check‐ups, and expanding HPV vaccination coverage can play a role in reducing the burden of these cancers. Conclusion LOPC remain a significant global health issue due to high incidence and mortality rates and various modifiable risk factors. Effective strategies targeting these factors, along with continued research on prevention and innovative treatments, are essential to reduce this burden and improve public health outcomes. global health human papillomavirus viruses pharyngeal neoplasms prevention review risk factors tobacco smoking vaccination The authors received no specific funding for this work. pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement no pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes source-schema-version-number 2.0 cover-date October 2025 details-of-publishers-convertor Converter:WILEY_ML3GV2_TO_JATSPMC version:6.6.4 mode:remove_FC converted:26.09.2025  R. Ebrahimi M. M. Masouri I. Razeghian G. Azad S. A. Nejadghaderi Lip, Oral Cavity, and Pharyngeal Cancers: Global Epidemiology, Risk Factors, and Prevention: A Narrative Review Health Science Reports 8 2025 1 17 10.1002/hsr2.71289 1 Introduction Lip, oral cavity, and pharyngeal cancers (LOPC) refer to a group of malignancies arising from the tissues of lip, oral cavity, nasopharynx, oropharynx and hypopharynx [ 1 2 3 4 5 Globally, in 2022, LOPC have been responsible for approximately 702 thousand new incident cases and 355 thousand mortalities, constituting around 3.5% and 3.6% of all incident cases and mortalities, respectively [ 6 7 8 9 10 11 12 13 14 15 16 17 18 19 19 20 21 22 Taking preventive measurements involving individuals, healthcare professionals and policymakers is necessary to address the challenges posed by LOPC [ 23 23 24 25 26 27 Although a previous review discussed the burden, trends, and risk factors of LOPC, especially in the context of the United Kingdom [ 28 2 Methods To enhance transparency and reporting quality, this review adheres to the principles outlined in the SANRA (Scale for the Assessment of Narrative Review Articles) guideline [ 29 Inclusion criteria were as follows: (1) studies published in English, (2) studies conducted on human populations, and (3) articles addressing epidemiology, risk factors, economic impact, or prevention strategies related to LOPC. We excluded (1) animal studies, (2) case reports, and (3) articles lacking original data (e.g., editorials or commentaries). Studies were screened manually by reviewing titles and abstracts, followed by full‐text assessments for relevance. Priority was given to high‐quality peer‐reviewed original articles and systematic reviews. Data were extracted narratively and synthesized thematically across domains, including global burden, socioeconomic and occupational risks, HPV‐related trends, economic implications, and prevention strategies. 3 Definition There are several types of cancers that affect the lip, oral cavity, and pharyngeal regions, each classified based on its anatomical location according to the International Classification of Diseases version 10 (ICD‐10) by the World Health Organization [ 30 31 32 1 Table 1 Definitions and International Classification of Disease (ICD) codes for different subtypes of lip, oral, and pharyngeal cancers. Lip, oral cavity and pharyngeal cancer subtypes ICD‐10 code Malignant neoplasm of lip C00 Malignant neoplasm of base of tongue C01 Malignant neoplasm of other and unspecified parts of tongue C02 Malignant neoplasm of gum C03 Malignant neoplasm of floor of mouth C04 Malignant neoplasm of palate C05 Malignant neoplasm of other and unspecified parts of mouth C06 Malignant neoplasm of parotid gland C07 Malignant neoplasm of other and unspecified major salivary glands C08 Malignant neoplasm of tonsil C09 Malignant neoplasm of oropharynx C10 Malignant neoplasm of nasopharynx C11 Malignant neoplasm of piriform sinus C12 Malignant neoplasm of hypopharynx C13 Malignant neoplasm of other and ill‐defined sites in the lip, oral cavity and pharynx C14 John Wiley & Sons, Ltd. Minor disparities exist between major institutions defining the subtypes of LOPC. In contrast to ICD‐10 codes, the National Cancer Institute counts cancers of the lip, tongue, gums, floor of mouth and hard palate as one entity called oral cavity cancers [ 2 4 Global Epidemiology Globally, about 750,000 new cases with age‐standardized incidence rate of 8.1 per 100000 population was reported in 2020 [ 33 33 34 34 33 The occurrence of LOPC rises as individual ages, with the greatest occurrence of lip/oral cavity and pharyngeal cancers observed in the 70–85+ and 60–69 age groups, respectively [ 33 33 34 In 2020, medium human development index (HDI) countries had the highest incidence and mortality of LOPC, with the age‐standardized rates of 19.5 and 7.3 per 100000, respectively [ 33 5 Economic Burden In a holistic view, to design cost‐of‐illness studies, not only all components of direct medical costs (surgery, chemotherapy, radiotherapy, follow‐up, and medications), but also direct nonmedical (transportation, caregiving and accommodation) and indirect costs (productivity loss due to disability or premature death) should be considered. For example, in France, a 2018 study estimated that the average direct medical cost per patient with head and neck cancer was approximately €50,000, with indirect medical costs adding an additional €3000 per patient [ 27 27 27 27 6 Risk Factors 6.1 Tobacco Smoking Tobacco use is frequently observed in a significant proportion of oral cavity cancer cases, serving as the primary risk factor [ 35 36 37 38 39 40 41 42 43 44 Tobacco consumption differs across various regions. While smoking is the prevailing form of tobacco use in Western countries, smokeless forms are more common in Asian nations [ 45 46 Cigarette smoke contains over 60 carcinogens, in which tobacco‐specific nitrosamines are the most important ones [ 47 48 49 p53 50 51 p53 Numerous epidemiological studies have established a dose–response relationship between the risk of oral cancer or potentially pre‐cancerous oral conditions and tobacco use [ 52 53 54 55 56 6.2 Betel Quid In countries of Southeast Asia, the occurrence of lip and oral cavity cancer is notably high. This pattern aligns with the regional prevalence of betel nut [ 57 58 59 60 61 62 63 64 There have been notable correlations observed between the levels of betel quid consumption and the risk of oral cancer [ 62 65 66 Consuming betel quid without tobacco is also a significant risk factor for the development of oral precancerous lesions (odds ratio [OR]: 5.79; 95% confidence interval [CI]: 2.41, 13.87) [ 67 68 69 62 6.3 Smokeless Tobacco Every form of tobacco is carcinogenic, and recent research has confirmed a link between smokeless tobacco (SLT) and oral and pharyngeal cancers [ 70 71 72 73 74 75 76 77 The frequency of SLT use varies greatly among and within countries, influenced by factors such as sex, age, ethnicity, and socioeconomic status [ 78 79 80 81 SLT products contain carcinogenic compounds, including polycyclic aromatic hydrocarbons, coumarin, lactones, ethyl carbamate, inorganic compounds, volatile N‐nitrosamines, some volatile aldehydes, tobacco‐specific N‐nitrosamines, and radioactive elements like Polonium 210, Uranium 235, and 238 [ 82 83 84 48 85 86 87 88 6.4 Alcohol Consumption Numerous studies have indicated that alcohol consumption increases the risk of developing cancers in the oral cavity, pharynx [ 89 90 91 46 92 The risk increases in individuals as the quantity of alcohol consumed rises [ 93 94 95 Ethanol and its metabolites, such as acetaldehyde, are recognized as carcinogenic agents found in alcoholic drinks [ 96 97 98 6.5 Socioeconomic Status Socioeconomic factors have a strong correlation with the risk of oral cancer [ 99 100 101 102 100 103 104 105 103 The influence of alcohol and tobacco use on the relationship between socioeconomic status and head and neck cancer has shown significant variation, with the unexplained or “direct” impact of low socioeconomic status estimated to be between 10% and 50% [ 106 107 108 109 110 46 111 6.6 Diet Besides the previously mentioned conventional risk factors, dietary habits also play a role in the development of oral cancer [ 112 113 114 115 115 Plant‐based foods, which are key elements of the Mediterranean diet, have a positive impact on preventing cancers of the upper aerodigestive tract [ 116 116 117 118 117 118 119 120 120 Primarily, processed red meats are the food groups that heighten cancer risk [ 121 21 122 123 124 Numerous studies over time have explored the link between malnutrition and the development of oral cancer [ 125 126 127 128 129 6.7 Genetics In addition to the widely recognized high‐risk factors such as tobacco, alcohol, and HPV 16/18, the risk of oral cancer is also influenced by individual genomic variations, known as single nucleotide polymorphisms, and the epigenetic profile of the genome [ 130 TNF‐a TNFR1 and TNFR2 131 DNMT3B 132 CYP1A1 GSTM1 GSTT1 133 CyclinD1 134 CTLA4 CD28 ICOS 135 ADH MTHFR 136 ERCC6 137 XRCCs 1–4 138 IGF‐2 139 140 The tobacco habitues often exhibit oral abnormalities such as oral leukoplakias, erythroplakias, and submucous fibrosis. However, only 5%–10% of these individuals who chew tobacco have a transformation of these oral lesions into a malignant form [ 141 142 142 The potential of genetic‐environmental risk interactions has also been demonstrated. Some risk associations linked to oral cancer have been discovered, such as genetic variations related to the metabolism of alcohol, DNA repair mechanisms, and genes involved in nicotine metabolism [ 143 ADH1B ADH7 144 Moreover, numerous epidemiological studies have linked telomere length (TL) with the risk and prognosis of many types of cancer, including head and neck squamous cell carcinoma [ 145 146 147 148 149 150 151 152 153 154 155 156 157 158 159 160 161 6.8 Radiation Lip cancers have a strong correlation with exposure to ultraviolet radiation from sunlight exposure [ 162 163 77 164 165 166 It has been proposed that the pigmentation in individuals with darker skin provides protection from long‐term solar radiation [ 167 162 77 6.9 Age and Sex Globally, the typical age for diagnosing oral cancer is usually high. For example, in the United States, most individuals diagnosed with these cancers are typically 64 years old, but they may also affect young individuals. Just over 20% of cases occur in people younger than 55 [ 168 169 170 170 The difference in diagnosis rates between sexes is consistent across most countries, likely due to varying exposure to risk factors such as tobacco, alcohol, and sunlight [ 70 54 70 171 172 173 6.10 Oropharyngeal Health Among specific head and neck cancers, the strongest links with oral hygiene are found in oral cavity cancers, which further supports the likelihood of a causal relationship [ 174 175 176 175 176 177 178 177 174 179 A marginally increased risk linked to the long‐term use of mouthwash (over 35 years) and usage more than once daily has been indicated [ 180 181 6.11 HPV There is strong evidence indicating that HPV increases the risk of cancers in the oropharyngeal area, which includes the base of the tongue, lingual tonsil, and soft palate [ 170 182 183 184 185 Globally, the proportion of oropharyngeal cancer attributed to HPV was estimated to be 18–28%, but this is nearing 70% in the United States [ 186 187 188 The occurrence of HPV‐related oropharyngeal squamous cell carcinoma varies by region and sex. The highest rates are found in North America, Europe, and Oceania [ 189 190 191 189 192 193 194 It has been uncertain to what extent oral HPV infection, in conjunction with tobacco or alcohol use, might heighten the risk of head and neck squamous cell carcinomas. There have been inconsistent reports [ 195 196 197 195 6.12 Occupational Exposures While the main risk factors for oral and pharyngeal cancers have been widely studied, there is also evidence indicating that exposure to certain workplace substances could be a contributing factor to these diseases. The interaction between tobacco and alcohol with these workplace carcinogens could potentially increase the risk of these cancers [ 198 199 200 200 201 202 201 202 Workers in construction and automotive industries, who are often exposed to asbestos and man‐made vitreous fibers, have been found to have a higher risk of developing oral and pharyngeal cancer [ 203 204 205 200 206 207 6.13 Other Risk Factors Having first‐degree relatives with a history of oral, pharyngeal, or laryngeal cancer can significantly increase the risk of developing oral and pharyngeal cancer. This risk is even higher when two or more relatives have been affected and is not dependent on alcohol or tobacco use. Individuals with a family history of lung cancer and skin melanoma also have an increased risk of oral and pharyngeal cancers [ 208 An inherited susceptibility to oral and pharyngeal cancer has been suggested by case reports of multiple family members being affected [ 209 210 211 212 213 214 215 216 217 218 219 220 221 During the observation period following transoral surgery, patients with early‐stage laryngeal, oropharyngeal, and hypopharyngeal cancer exhibited a high occurrence of newly identified secondary cancers [ 222 223 98 98 224 Physical activity could potentially impact the development of cancer at various locations by enhancing the antioxidant properties of the immune system and increasing the circulation of neutrophils, monocytes, lymphocytes, and natural killer cells [ 225 225 226 227 A structured summary of the major risk factors, categorized into modifiable and non‐modifiable groups, is provided in Table 2 Table 2 Classification of modifiable and non‐modifiable risk factors for lip, oral cavity, and pharyngeal cancers. Category Modifiable risk factors Non‐modifiable risk factors Behavioral   Tobacco smoking & chewing Smokeless tobacco Alcohol consumption Betel quid chewing   Age Sex Race/Ethnicity Infectious   HPV infection (vaccine‐preventable) — Socioeconomic/Access   Low socioeconomic status Poor oral hygiene (infrequent dental visits, poor brushing) Occupational exposures — Dietary/Nutritional   High red/processed meat consumption Low fruit & vegetable intake — Environmental/Physical   Ultraviolet radiation (sun exposure to lips) Ionizing radiation (e.g., prior radiotherapy)   Family history/genetics Telomere‐related polymorphisms Occupational/Chemical   Wood/cement/coal/asbestos dust Formaldehyde Other workplace carcinogens — Microbiome/Hygiene   Dysbiotic oral microbiome Mouthwash overuse (> 35 years, frequent) — Other/Lifestyle   Physical inactivity — John Wiley & Sons, Ltd. 7 Prevention and Recommendations 7.1 Primary Prevention Strategies Comprehensive tobacco control programs, including public education, smoking cessation support, and legislative measures, are essential for reducing the incidence of these cancers [ 175 228 175 229 HPV vaccination is a proven strategy for the prevention of these cancers. Increasing HPV vaccination coverage, especially among adolescents, can substantially reduce the incidence of HPV‐related oropharyngeal cancer [ 230 231 A diet rich in fruits and vegetables has been shown to protect against LOPC. Public health initiatives that promote healthy eating habits may contribute to cancer prevention. Additionally, reducing the intake of processed and red meats, which have been linked to an increased risk of cancer, is recommended [ 232 233 For lip cancer, particularly in regions with high sun exposure, using lip balms with a suitable sun protection factor, wearing wide‐brimmed hats, and avoiding excessive sun exposure are effective preventive measures [ 234 175 Increasing public awareness of the risk factors of oral cancer through mass media campaigns and educational programs is crucial. These campaigns should be supported by both government and private institutions [ 235 236 Health professionals, including dentists and general practitioners, should be trained to recognize the early signs of oral cancer and provide advice on smoking cessation, alcohol moderation, and sun protection [ 237 Emerging strategies include the use of vaccines and alteration of the oral microbiome to reduce the presence of pathogenic bacteria such as Fusobacterium nucleatum 238 Addressing the socioeconomic factors and occupational exposures that contribute to cancer risk, such as working in agriculture or the building industry, is also important. These interventions can help reduce the incidence of cancer in high‐risk populations [ 239 7.2 Secondary Prevention Strategies Regular dental visits provide an opportunity for the early detection of oral cancers. Dentists can perform routine oral examinations to identify precancerous lesions and early stage cancers, thereby improving the chances of successful treatment [ 240 241 l 241 242 243 7.3 Tertiary Prevention Strategies A consistent posttreatment follow‐up is crucial for patients who have undergone treatment for LOPC. Regular follow‐up visits help in detecting recurrences, second primary cancers, and managing treatment‐related complications [ 241 235 Cancer vaccines, particularly those based on mRNA, are being explored as a therapeutic option for preventing recurrence and managing residual disease. These vaccines have shown promise in boosting the immune response against cancer cells [ 241 244 Providing psychosocial support to patients and their families is essential for addressing the emotional and psychological impact of cancer diagnosis and treatment. Support groups and counseling services are beneficial [ 235 245 7.4 Recommendations Healthcare providers should receive training on the risk factors, early signs, and diagnostic techniques for LOPC. This training can improve the early detection and management of these cancers [ 232 228 229 Governments should implement laws to reduce tobacco and alcohol consumption, such as higher taxes, advertising bans, and restrictions on sales to minors. These measures have been shown to be effective in reducing the prevalence of these risk factors [ 232 246 230 8 Limitations One significant limitation of this study that warrants consideration is that it was a narrative review rather than a systematic review. Consequently, the inclusion and exclusion criteria may have significantly affected the results, and the lack of a systematic search and meta‐analysis prevented us from arriving at precise conclusions. Additionally, our search was limited to the PubMed database and Google Scholar search engine. Also, the quality of the included studies was not evaluated, which may have resulted in the inclusion of studies with flawed methodologies, potentially leading to unreliable findings. Despite these limitations, our review identified areas that require further investigation and provided a comprehensive overview on the epidemiology and risk factors of LOPC. 9 Conclusions LOPC pose a significant challenge to public health worldwide, despite progress in prevention, diagnosis, and treatment. High incidence and mortality rates persist, with certain groups, including men, older individuals, and those in low‐ and middle‐income countries. Studies indicate that several modifiable risk factors, such as tobacco and alcohol use, poor oral hygiene, and viral infections, contribute to the development of cancer. Addressing these factors could lead to improved health outcomes and a reduced cancer burden. Furthermore, ongoing research and innovation are essential to deepen our understanding of cancer mechanisms and develop new prevention, diagnosis, and treatment strategies. Given the growing prevalence of HPV and its implications for vaccination and screening programs, research in this area is particularly important. Author Contributions  Rasoul Ebrahimi: Mohammad Mahdi Masouri: Iman Razeghian: Ghazal Azad: Seyed Aria Nejadghaderi: Ethics Statement The authors have nothing to report. Conflicts of Interest The authors declare no conflicts of interest. Transparency Statement The lead author Seyed Aria Nejadghaderi affirms that this manuscript is an honest, accurate, and transparent account of the study being reported; that no important aspects of the study have been omitted; and that any discrepancies from the study as planned (and, if relevant, registered) have been explained. Acknowledgments The authors have nothing to report. Data Availability Statement The authors confirm that all data supporting the findings of this study are available within the article and its references. References 1 L. Q. M. Chow Head and Neck Cancer New England Journal of Medicine 382 1 2020 60 72 31893516 10.1056/NEJMra1715715 2 National cancer institute: NIH https://www.cancer.gov/types/head-and-neck/hp/adult/lip-mouth-treatment-pdq 3 National cancer institute: NIH www.cancer.gov/publications/dictionaries/cancer-terms/def/pharyngeal-cancer 4 J. Huang S. C. Chan S. Ko Disease Burden, Risk Factors, and Trends of Lip, Oral Cavity, Pharyngeal Cancers: A Global Analysis Cancer Medicine 12 17 2023 18153 18164 37519070 10.1002/cam4.6391 PMC10524054 5 S. Abati C. Bramati S. Bondi A. Lissoni M. Trimarchi Oral Cancer and Precancer: A Narrative Review on the Relevance of Early Diagnosis International Journal of Environmental Research and Public Health 17 24 2020 9160 33302498 10.3390/ijerph17249160 PMC7764090 6 F. Bray M. Laversanne H. Sung Global Cancer Statistics 2022: Globocan Estimates of Incidence and Mortality Worldwide for 36 Cancers in 185 Countries CA: A Cancer Journal for Clinicians 74 3 2024 229 263 38572751 10.3322/caac.21834 7 M. B. Cook S. M. Dawsey N. D. Freedman Sex Disparities in Cancer Incidence by Period and Age Cancer Epidemiology, Biomarkers & Prevention 18 4 2009 1174 1182 10.1158/1055-9965.EPI-08-1118 PMC2793271 19293308 8 J. Huang S. C. Chan S. Ko Disease Burden, Risk Factors, and Trends of Lip, Oral Cavity, Pharyngeal Cancers: A Global Analysis Cancer Medicine 12 17 2023 18153 18164 37519070 10.1002/cam4.6391 PMC10524054 9 G. L. Day W. J. Blot D. F. Austin Racial Differences in Risk of Oral and Pharyngeal Cancer: Alcohol, Tobacco, and Other Determinants JNCI Journal of the National Cancer Institute 85 6 1993 465 473 8445674 10.1093/jnci/85.6.465 10 R. S. Greenberg M. J. Huber W. S. Clark The Relation of Socioeconomic Status to Oral and Pharyngeal Cancer Epidemiology 2 3 1991 194 200 2054401 10.1097/00001648-199105000-00006 11 S. Gandini E. Botteri S. Iodice Tobacco Smoking and Cancer: A Meta‐Analysis International Journal of Cancer 122 1 2008 155 164 17893872 10.1002/ijc.23033 12 M. Hashibe P. Brennan S. Benhamou Alcohol Drinking in Never Users of Tobacco, Cigarette Smoking in Never Drinkers, and the Risk of Head and Neck Cancer: Pooled Analysis in the International Head and Neck Cancer Epidemiology Consortium JNCI Journal of the National Cancer Institute 99 10 2007 777 789 17505073 10.1093/jnci/djk179 13 N. K. Proia G. M. Paszkiewicz M. A. Sullivan Nasca G. E. Franke J. L. Pauly Smoking and Smokeless Tobacco‐Associated Human Buccal Cell Mutations and Their Association With Oral Cancer‐‐A Review Cancer Epidemiology, Biomarkers & Prevention 15 6 2006 1061 1077 10.1158/1055-9965.EPI-05-0983 16775162 14 F. Turati W. Garavello I. Tramacere A Meta‐Analysis of Alcohol Drinking and Oral and Pharyngeal Cancers: Results From Subgroup Analyses Alcohol and Alcoholism 48 1 2013 107 118 22949102 10.1093/alcalc/ags100 15 S. Petti Lifestyle Risk Factors for Oral Cancer Oral Oncology 45 4–5 2009 340 350 18674956 10.1016/j.oraloncology.2008.05.018 16 S. Syrjänen Human Papillomavirus (HPV) in Head and Neck Cancer Journal of Clinical Virology 32 Suppl 1 2005 59 66 10.1016/j.jcv.2004.11.017 15753013 17 C. de Martel J. Ferlay S. Franceschi Global Burden of Cancers Attributable to Infections in 2008: a Review and Synthetic Analysis Lancet Oncology 13 6 2012 607 615 22575588 10.1016/S1470-2045(12)70137-7 18 N. Guha S. Warnakulasuriya J. Vlaanderen K. Straif Betel Quid Chewing and the Risk of Oral and Oropharyngeal Cancers: A Meta‐Analysis With Implications for Cancer Control International Journal of Cancer 135 6 2014 1433 1443 24302487 10.1002/ijc.28643 19 K. D. Shield J. Ferlay A. Jemal The Global Incidence of Lip, Oral Cavity, and Pharyngeal Cancers by Subsite in 2012 CA: A Cancer Journal for Clinicians 67 1 2017 51 64 28076666 10.3322/caac.21384 20 D. Aune E. De Stefani A. Ronco Meat Consumption and Cancer Risk: A Case‐Control Study in Uruguay Asian Pacific Journal of Cancer Prevention 10 3 2009 429 436 19640186 21 J. Rodríguez‐Molinero B. C. Migueláñez‐Medrán C. Puente‐Gutiérrez Association Between Oral Cancer and Diet: An Update Nutrients 13 4 2021 1299 33920788 10.3390/nu13041299 PMC8071138 22 N. D. Freedman Y. Park A. F. Subar Fruit and Vegetable Intake and Head and Neck Cancer Risk in a Large United States Prospective Cohort Study International Journal of Cancer 122 10 2008 2330 2336 18092323 10.1002/ijc.23319 23 S. D'Souza V. Addepalli Preventive Measures in Oral Cancer: An Overview Biomedicine & Pharmacotherapy 107 2018 72 80 30081204 10.1016/j.biopha.2018.07.114 24 M. Lechner J. Liu L. Masterson T. R. Fenton HPV‐Associated Oropharyngeal Cancer: Epidemiology, Molecular Biology and Clinical Management Nature Reviews Clinical Oncology 19 5 2022 306 327 10.1038/s41571-022-00603-7 PMC8805140 35105976 25 A. M. Malki S. B. Raad R. Abu‐El‐Ruz Prevention of Oral Cancer Development of Oral Cancer: Risk Factors and Prevention Strategies A.‐E. Al Moustafa Cham Springer International Publishing 2017 193 217 26 National Cancer Institute: NIH https://www.cancer.gov/types/head-and-neck/hp/oral-prevention-pdq 27 R. F. Ribeiro‐Rotta E. A. Rosa V. Milani The Cost of Oral Cancer: A Systematic Review PLoS One 17 4 2022 e0266346 35446870 10.1371/journal.pone.0266346 PMC9022815 28 D. I. Conway M. Purkayastha I. G. Chestnutt The Changing Epidemiology of Oral Cancer: Definitions, Trends, and Risk Factors British Dental Journal 225 9 2018 867 873 30412558 10.1038/sj.bdj.2018.922 29 C. Baethge S. Goldbeck‐Wood S. Mertens SANRA—A Scale for the Quality Assessment of Narrative Review Articles Research Integrity and Peer Review 4 1 2019 5 30962953 10.1186/s41073-019-0064-8 PMC6434870 30 International Classification of Diseases WHO https://www.icd10data.com/ICD10CM/Codes/C00-D49/C00-C14 31 A. J. Ferrari D. F. Santomauro A. Aali Global Incidence, Prevalence, Years Lived With Disability (YLDs), Disability‐Adjusted Life‐Years (DALYS), and Healthy Life Expectancy (HALE) for 371 Diseases and Injuries in 204 Countries and Territories and 811 Subnational Locations, 1990–2021: A Systematic Analysis for the Global Burden of Disease Study 2021 Lancet 403 10440 2024 2133 2161 38642570 10.1016/S0140-6736(24)00757-8 PMC11122111 32 F. Bray M. Laversanne H. Sung Global Cancer Statistics 2022: Globocan Estimates of Incidence and Mortality Worldwide for 36 Cancers in 185 Countries CA: A Cancer Journal for Clinicians 74 3 2024 229 263 38572751 10.3322/caac.21834 33 J. Huang S. C. Chan S. Ko Disease Burden, Risk Factors, and Trends of Lip, Oral Cavity, Pharyngeal Cancers: A Global Analysis Cancer Medicine 12 17 2023 18153 18164 37519070 10.1002/cam4.6391 PMC10524054 34 A. Cunha K. Compton R. Xu The Global, Regional, and National Burden of Adult Lip, Oral, and Pharyngeal Cancer in 204 Countries and Territories: A Systematic Analysis for the Global Burden of Disease Study 2019 JAMA Oncology 9 10 2023 1401 1416 37676656 10.1001/jamaoncol.2023.2960 PMC10485745 35 S. A. Gharat M. Momin C. Bhavsar Oral Squamous Cell Carcinoma: Current Treatment Strategies and Nanotechnology‐Based Approaches for Prevention and Therapy Critical Reviews™ in Therapeutic Drug Carrier Systems 33 4 2016 363 400 10.1615/CritRevTherDrugCarrierSyst.2016016272 27910740 36 E. L. Wynder I. J. Bross Aetiological Factors in Mouth Cancer BMJ 1 5028 1957 1137 1143 13426561 10.1136/bmj.1.5028.1137 PMC1973476 37 A. Znaor P. Brennan V. Gajalakshmi Independent and Combined Effects of Tobacco Smoking, Chewing and Alcohol Drinking on the Risk of Oral, Pharyngeal and Esophageal Cancers in Indian Men International Journal of Cancer 105 5 2003 681 686 12740918 10.1002/ijc.11114 38 R. Muwonge K. Ramadas R. Sankila Role of Tobacco Smoking, Chewing and Alcohol Drinking in the Risk of Oral Cancer in Trivandrum, India: A Nested Case‐Control Design Using Incident Cancer Cases Oral Oncology 44 5 2008 446 454 17933578 10.1016/j.oraloncology.2007.06.002 39 K. Rosenquist Risk Factors in Oral and Oropharyngeal Squamous Cell Carcinoma: A Population‐Based Case‐Control Study in Southern Sweden Swedish Dental Journal. Supplement 179 2005 1 66 16335030 40 P. A. Jayalekshmi P. Gangadharan S. Akiba C. Koriyama R. R. K. Nair Oral Cavity Cancer Risk in Relation to Tobacco Chewing and Bidi Smoking Among Men In Karunagappally, Kerala, India: Karunagappally Cohort Study Cancer science 102 2 2011 460 467 21129124 10.1111/j.1349-7006.2010.01785.x PMC11159434 41 A. Madani M. Dikshit D. Bhaduri Risk for Oral Cancer Associated to Smoking, Smokeless and Oral Dip Products Indian Journal of Public Health 56 1 2012 57 60 22684175 10.4103/0019-557X.96977 42 R. Czerninski A. Zini H. D. Sgan‐Cohen Lip Cancer: Incidence, Trends, Histology and Survival: 1970‐2006 British Journal of Dermatology 162 5 2010 1103 1109 20163415 10.1111/j.1365-2133.2010.09698.x 43 S. Moore N. Johnson A. Pierce D. Wilson The Epidemiology of Mouth Cancer: A Review of Global Incidence Oral Diseases 6 2 2000 65 74 10702782 10.1111/j.1601-0825.2000.tb00104.x 44 S. Silverman Jr. Demographics and Occurrence of Oral and Pharyngeal Cancers. The outcomes, the trends, the challenge Journal of the American Dental Association 132 Suppl 2001 7s 11s 11803655 10.14219/jada.archive.2001.0382 45 P. Chaturvedi A. Singh C.‐Y. Chien S. Warnakulasuriya Tobacco Related Oral Cancer BMJ 365 2019 l2142 31167798 10.1136/bmj.l2142 46 A. Hernández‐Morales B. S. González‐López R. J. Scougall‐Vilchis Lip and Oral Cavity Cancer Incidence and Mortality Rates Associated With Smoking and Chewing Tobacco Use and the Human Development Index in 172 Countries Worldwide: An Ecological Study 2019‐2020 Healthcare 11 8 2023 1063 37107897 10.3390/healthcare11081063 PMC10137392 47 S. Petti Lifestyle Risk Factors for Oral Cancer Oral Oncology 45 4–5 2009 340 350 18674956 10.1016/j.oraloncology.2008.05.018 48 S. S. Hecht Tobacco Carcinogens, Their Biomarkers and Tobacco‐Induced Cancer Nature Reviews Cancer 3 10 2003 733 744 14570033 10.1038/nrc1190 49 H.IARC W G on the E of C R to Tobacco Smoke and Involuntary Smoking IARC Monographs on the Evaluation of Carcinogenic Risks to Humans 83 2004 1 1438 15285078 PMC4781536 50 J. Kaur A. Srivastava R. Ralhan Overexpression of p53 Protein in Betel‐ and Tobacco‐Related Human Oral Dysplasia and Squamous‐Cell Carcinoma in India International Journal of Cancer 58 3 1994 340 345 8050814 10.1002/ijc.2910580305 51 B. Chakrobarty J. Roy S. Majumdar D. Uppala Relationship Among Tobacco Habits, Human Papilloma Virus (HPV) Infection, p53 Polymorphism/Mutation and the Risk of Oral Squamous Cell Carcinoma Journal of Oral and Maxillofacial Pathology 18 2 2014 211 216 25328301 10.4103/0973-029X.140752 PMC4196289 52 X. Jiang Tobacco and Oral Squamous Cell Carcinoma: A Review of Carcinogenic Pathways Tobacco Induced Diseases 17 2019 29 31582940 10.18332/tid/105844 PMC6752112 53 S. Edirisinghe M. Weerasekera D. De Silva The Risk of Oral Cancer Among Different Categorise Tobacco Smoking Exposure in Sri Lanka Asian Pacific Journal of Cancer Prevention 23 9 2022 2929 2935 36172654 10.31557/APJCP.2022.23.9.2929 PMC9810316 54 J. Gray A. Al Maghlouth H. Al Hussain M. Al Sheef Impact of Oral and Oropharyngeal Cancer Diagnosis on Smoking Cessation Patients and Cohabiting Smokers Tobacco Induced Diseases 17 2019 75 31768167 10.18332/tid/109413 PMC6843181 55 L. Radoï S. Paget‐Bailly D. Cyr Tobacco Smoking, Alcohol Drinking and Risk of Oral Cavity Cancer by Subsite: Results of a French Population‐Based Case‐Control Study, the ICARE Study European Journal of Cancer Prevention 22 3 2013 268 276 22976386 10.1097/CEJ.0b013e3283592cce 56 M. Marron P. Boffetta Z. F. Zhang Cessation of Alcohol Drinking, Tobacco Smoking and the Reversal of Head and Neck Cancer Risk International Journal of Epidemiology 39 1 2010 182 196 19805488 10.1093/ije/dyp291 PMC2817090 57 W.‐W. Sung Y.‐C. Hsu C. Dong Y.‐C. Chen Y.‐C. Chao C.‐J. Chen Favorable Lip and Oral Cancer Mortality‐To‐Incidence Ratios in Countries With High Human Development Index and Expenditures on Health International Journal of Environmental Research and Public Health 18 11 2021 6012 34205053 10.3390/ijerph18116012 PMC8199886 58 H. Song Y. Wan Y.‐Y. Xu Betel Quid Chewing Without Tobacco:A Meta‐Analysis of Carcinogenic and Precarcinogenic Effects Asia Pacific Journal of Public Health 27 2 2015 NP47 NP57 23666841 10.1177/1010539513486921 59 A. Merchant S. S. M. Husain M. Hosain Paan Without Tobacco: An Independent Risk Factor for Oral Cancer International Journal of Cancer 86 1 2000 128 131 10728606 10.1002/(sici)1097-0215(20000401)86:1<128::aid-ijc20>3.0.co;2-m 60 H. K. Amarasinghe U. S. Usgodaarachchi N. W. Johnson R. Lalloo S. Warnakulasuriya Betel‐Quid Chewing With or Without Tobacco Is a Major Risk Factor for Oral Potentially Malignant Disorders in Sri Lanka: A Case‐Control Study Oral Oncology 46 4 2010 297 301 20189448 10.1016/j.oraloncology.2010.01.017 61 C. T. Liao H. M. Wang J. T. C. Chang Analysis of Risk Factors for Distant Metastases in Squamous Cell Carcinoma of the Oral Cavity Cancer 110 7 2007 1501 1508 17868119 10.1002/cncr.22959 62 Y. Hu R. Zhong H. Li Y. Zou Effects of Betel Quid, Smoking and Alcohol on Oral Cancer Risk: A Case‐Control Study in Hunan Province, China Substance Use & Misuse 55 9 2020 1501 1508 32569534 10.1080/10826084.2020.1750031 63 C. Travasso Betel Quid Chewing Is Responsible for Half of Oral Cancer Cases in India, Finds Study BMJ 347 2013 f7536 24343058 10.1136/bmj.f7536 64 P. C. Gupta S. Warnakulasuriya Global Epidemiology of Areca Nut Usage Addiction Biology 7 1 2002 77 83 11900626 10.1080/13556210020091437 65 S. A. Madathil M. C. Rousseau W. Wynant Nonlinear Association Between Betel Quid Chewing and Oral Cancer: Implications for Prevention Oral Oncology 60 2016 25 31 27531869 10.1016/j.oraloncology.2016.06.011 66 C. H. Lee Y. C. Ko H. L. Huang The Precancer Risk of Betel Quid Chewing, Tobacco Use and Alcohol Consumption in Oral Leukoplakia and Oral Submucous Fibrosis in Southern Taiwan British Journal of Cancer 88 3 2003 366 372 12569378 10.1038/sj.bjc.6600727 PMC2747536 67 H. Song Y. Wan Y. Y. Xu Betel Quid Chewing Without Tobacco: A Meta‐Analysis of Carcinogenic and Precarcinogenic Effects Asia Pacific Journal of Public Health 27 2 2015 NP47 NP57 23666841 10.1177/1010539513486921 68 S. A. Al‐Attas S. S. Ibrahim H. A. Amer Z. E. S. Darwish M. H. Hassan Prevalence of Potentially Malignant Oral Mucosal Lesions Among Tobacco Users in Jeddah, Saudi Arabia Asian Pacific Journal of Cancer Prevention 15 2 2014 757 762 24568491 10.7314/apjcp.2014.15.2.757 69 R. Amtha I. A. Razak B. Basuki Tobacco (Kretek) Smoking, Betel Quid Chewing and Risk of Oral Cancer In a Selected Jakarta Population Asian Pacific Journal of Cancer Prevention 15 20 2014 8673 8678 25374188 10.7314/apjcp.2014.15.20.8673 70 S. Warnakulasuriya Living With Oral Cancer: Epidemiology With Particular Reference to Prevalence and Life‐Style Changes That Influence Survival Oral Oncology 46 6 2010 407 410 20403722 10.1016/j.oraloncology.2010.02.015 71 R. Weitkunat E. Sanders P. N. Lee Meta‐Analysis of the Relation Between European and American Smokeless Tobacco and Oral Cancer BMC Public Health 7 2007 334 18005437 10.1186/1471-2458-7-334 PMC2225413 72 D. N. Sinha R. S. Abdulkader P. C. Gupta Smokeless Tobacco‐Associated Cancers: A Systematic Review and Meta‐Analysis of Indian Studies International Journal of Cancer 138 6 2016 1368 1379 26443187 10.1002/ijc.29884 73 S. Asthana S. Labani U. Kailash D. N. Sinha R. Mehrotra Association of Smokeless Tobacco Use and Oral Cancer: A Systematic Global Review and Meta‐Analysis Nicotine & Tobacco Research 21 9 2019 1162 1171 29790998 10.1093/ntr/nty074 74 S. McGuire World Cancer Report 2014. Geneva, Switzerland: World Health Organization, International Agency for Research on Cancer, WHO Press, 2015 Advances in Nutrition 7 2 2016 418 419 26980827 10.3945/an.116.012211 PMC4785485 75 A. B. Mejia P. M. Ling S. A. Glantz Quantifying the Effects of Promoting Smokeless Tobacco as a Harm Reduction Strategy in the USA Tobacco Control 19 4 2010 297 305 20581427 10.1136/tc.2009.031427 PMC3102305 76 D. N. Sinha R. A. Suliankatchi P. C. Gupta Global Burden of All‐Cause and Cause‐Specific Mortality due to Smokeless Tobacco use: Systematic Review and Meta‐Analysis Tobacco Control 27 1 2018 35 42 27903956 10.1136/tobaccocontrol-2016-053302 77 A. Miranda‐Filho F. Bray Global Patterns and Trends in Cancers of the Lip, Tongue and Mouth Oral Oncology 102 2020 104551 31986342 10.1016/j.oraloncology.2019.104551 78 M. E. Leon A. Lugo P. Boffetta Smokeless Tobacco use in Sweden and Other 17 European Countries European Journal of Public Health 26 5 2016 817 821 27048433 10.1093/eurpub/ckw032 79 N. Mummudi J. P. Agarwal S. Chatterjee I. Mallick S. Ghosh‐Laskar Oral Cavity Cancer in the Indian Subcontinent ‐ Challenges and Opportunities Clinical Oncology 31 8 2019 520 528 31174947 10.1016/j.clon.2019.05.013 80 P. Boffetta S. Hecht N. Gray P. Gupta K. Straif Smokeless Tobacco and Cancer Lancet Oncology 9 7 2008 667 675 18598931 10.1016/S1470-2045(08)70173-6 81 B. R. Campbell C. B. Sanders J. L. Netterville Early Onset Oral Tongue Squamous Cell Carcinoma: Associated Factors and Patient Outcomes Head & Neck 41 6 2019 1952 1960 30633435 10.1002/hed.25650 PMC7010313 82 R. Bhisey Chemistry and Toxicology of Smokeless Tobacco Indian Journal of Cancer 49 4 2012 364 372 23442400 10.4103/0019-509X.107735 83 A. K. Gupta S. Tulsyan M. Bharadwaj R. Mehrotra Grass Roots Approach to Control Levels of Carcinogenic Nitrosamines, NNN and NNK in Smokeless Tobacco Products Food and Chemical Toxicology 124 2019 359 366 30543893 10.1016/j.fct.2018.12.011 84 U. Wollina S. B. Verma M. Faridi K. Patil Oral Submucous Fibrosis: An Update Clinical, Cosmetic and Investigational Dermatology 8 2015 193 204 25914554 10.2147/CCID.S80576 PMC4401336 85 S. S. Hecht S. G. Carmella S. E. Murphy Similar Exposure to a Tobacco‐Specific Carcinogen in Smokeless Tobacco Users and Cigarette Smokers Cancer Epidemiology, Biomarkers & Prevention 16 8 2007 1567 1572 10.1158/1055-9965.EPI-07-0227 17684130 86 J. L. de Geus L. M. Wambier A. D. Loguercio A. Reis The Smokeless Tobacco Habit and DNA Damage: A Systematic Review and Meta‐Analysis Medicina oral, patología oral y cirugía bucal 24 2 2019 e145 e155 30818306 10.4317/medoral.22846 PMC6441603 87 J. A. Critchley Health Effects Associated With Smokeless Tobacco: A Systematic Review Thorax 58 5 2003 435 443 12728167 10.1136/thorax.58.5.435 PMC1746661 88 J. Xue S. Yang S. Seng Mechanisms of Cancer Induction by Tobacco‐Specific NNK and NNN Cancers 6 2 2014 1138 1156 24830349 10.3390/cancers6021138 PMC4074821 89 E. Gutjahr G. Gmel J. Rehm Relation Between Average Alcohol Consumption and Disease: An Overview European Addiction Research 7 3 2001 117 127 11509842 10.1159/000050729 90 K. Kjærheim M. Gaard A. Andersen The Role of Alcohol, Tobacco, and Dietary Factors in Upper Aerogastric Tract Cancers: A Prospective Study of 10,900 Norwegian Men Cancer Causes & Control 9 1 1998 99 108 9486469 10.1023/a:1008809706062 91 A. Altieri W. Garavello C. Bosetti S. Gallus C. L. Vecchia Alcohol Consumption and Risk of Laryngeal Cancer Oral Oncology 41 10 2005 956 965 15927525 10.1016/j.oraloncology.2005.02.004 92 G. D. Cruz L. C. Shulman J. V. Kumar C. R. Salazar The Cultural and Social Context of Oral and Pharyngeal Cancer Risk and Control Among Hispanics in New York Journal of Health Care for the Poor and Underserved 18 4 2007 833 846 17982210 10.1353/hpu.2007.0092 PMC2169356 93 V. Bagnardi M. Blangiardo C. L. Vecchia G. Corrao A Meta‐Analysis of Alcohol Drinking and Cancer Risk British Journal of Cancer 85 11 2001 1700 1705 11742491 10.1054/bjoc.2001.2140 PMC2363992 94 J. O. M. Andrade C. A. S. T. Santos M. C. Oliveira Fatores Associados Ao Câncer De Boca: Um Estudo De Caso‐Controle Em Uma População Do Nordeste Do Brasil Revista Brasileira de Epidemiologia 18 4 2015 894 905 95 L. A. Moreno‐López G. C. Esparza‐Gómez A. González‐Navarro R. Cerero‐Lapiedra M. J. González‐Hernández V. Domínguez‐Rojas Risk of Oral Cancer Associated With Tobacco Smoking, Alcohol Consumption and Oral Hygiene: A Case‐Control Study in Madrid, Spain Oral Oncology 36 2 2000 170 174 10745168 10.1016/s1368-8375(99)00084-6 96 IARC Working Group on the Evaluation of Carcinogenic Risks to Humans Alcohol Consumption and Ethyl Carbamate IARC Monographs on the Evaluation of Carcinogenic Risks to Humans 96 2010 3 1383 21735939 PMC4781168 97 S. M. Schwartz D. R. Doody E. D. Fitzgibbons S. Ricks P. L. Porter C. Chen Oral Squamous Cell Cancer Risk in Relation to Alcohol Consumption and Alcohol dehydrogenase‐3 Genotypes Cancer Epidemiology, Biomarkers & Prevention: A Publication of the American Association for Cancer Research, cosponsored by the American Society of Preventive Oncology 10 11 2001 1137 1144 11700261 98 G. Nishimura H. Takahashi D. Sano Risk Factors of Secondary Cancer in Laryngeal, Oropharyngeal, or Hypopharyngeal Cancer After Definitive Therapy International Journal of Clinical Oncology 29 2 2024 103 114 38057500 10.1007/s10147-023-02433-8 99 D. I. Conway D. R. Brenner A. D. McMahon Estimating and Explaining the Effect of Education and Income on Head and Neck Cancer Risk: INHANCE Consortium Pooled Analysis of 31 Case‐Control Studies From 27 Countries International Journal of Cancer 136 5 2015 1125 1139 24996155 10.1002/ijc.29063 PMC4531373 100 L. S. Lins N. V. Bezerra A. R. Freire L. D. Almeida E. H. Lucena Y. W. Cavalcanti Socio‐Demographic Characteristics Are Related to the Advanced Clinical Stage of Oral Cancer Medicina oral, patología oral y cirugía bucal 24 6 2019 e759 e763 31655836 10.4317/medoral.23105 PMC6901145 101 G. P. Moi A. M. C. Silva N. D. Galvão M. de Castro Meneghim A. C. Pereira Spatial Analysis of the Death Associated Factors Due Oral Cancer in Brazil: An Ecological Study BMC Oral health 18 1 2018 14 29361933 10.1186/s12903-018-0473-y PMC5781345 102 B. Y. Herrera‐Serna E. Lara‐Carrillo V. H. Toral‐Rizo R. Cristina do Amaral R. A. Aguilera‐Eguía Relationship Between the Human Development Index and Its Components With Oral Cancer in Latin America Journal of Epidemiology and Global Health 9 4 2019 223 232 31854163 10.2991/jegh.k.191105.001 PMC7310789 103 M. Raymundo A. Freire D. Gomes‐Freire Trend of Hospitalized Cases of Oral Cancer in Brazil and Its Relationship With Oral Health Coverage in Public Health System Between 2009 and 2017 Medicina Oral Patología Oral y Cirugia Bucal 26 1 2021 e78 e83 33247574 10.4317/medoral.24009 PMC7806343 104 I. Gómez S. Warnakulasuriya P. Varela‐Centelles Is Early Diagnosis of Oral Cancer a Feasible Objective? Who Is to Blame for Diagnostic Delay? Oral Diseases 16 4 2010 333 342 20233328 10.1111/j.1601-0825.2009.01642.x 105 A. R. Freire D. E. W. G. Freire G. A. Pucca Júnior Diagnosis of Mucosal Changes and Hospitalized Oral Cancer Patients in Brazil: Influence of Socioeconomic Factors Brazilian Oral Research 35 2021 e042 33909864 10.1590/1807-3107bor-2021.vol35.0042 106 D. I. Conway P. A. McKinney A. D. McMahon Socioeconomic Factors Associated With Risk of Upper Aerodigestive Tract Cancer in Europe European Journal of Cancer 46 3 2010 588 598 19857956 10.1016/j.ejca.2009.09.028 107 A. F. Boing J. L. F. Antunes M. B. de Carvalho How Much Do Smoking and Alcohol Consumption Explain Socioeconomic Inequalities in Head and Neck Cancer Risk? Journal of Epidemiology & Community Health 65 8 2011 709 714 20724282 10.1136/jech.2009.097691 108 G. Menvielle Smoking, Alcohol Drinking, Occupational Exposures and Social Inequalities in Hypopharyngeal and Laryngeal Cancer International Journal of Epidemiology 33 4 2004 799 806 15155704 10.1093/ije/dyh090 109 G. Rose K.‐T. Khaw M. Marmot Rose's Strategy of Preventive Medicine Oxford University Press 2008 110 N. Krieger Theories for Social Epidemiology in the 21st Century: An Ecosocial Perspective International Journal of Epidemiology 30 4 2001 668 677 11511581 10.1093/ije/30.4.668 111 J. Kuruvilla K. R. Nayar Distribution Pattern and Its Correlation for Oral Cancer Rate and Human Development Rank for Countries: An Ecological Approach Contemporary Clinical Dentistry 12 1 2021 9 13 33967531 10.4103/ccd.ccd_1_20 PMC8092092 112 F. Chen L. Yan L. Lin Dietary Score and the Risk of Oral Cancer: A Case‐Control Study in Southeast China Oncotarget 8 21 2017 34610 34616 28410222 10.18632/oncotarget.16659 PMC5470995 113 M. Dalmartello A. Decarli M. Ferraroni Dietary Patterns and Oral and Pharyngeal Cancer Using Latent Class Analysis International Journal of Cancer 147 2019 719 727 31677269 10.1002/ijc.32769 114 N. Shivappa J. R. Hébert V. Rosato W. Garavello D. Serraino C. La Vecchia Inflammatory Potential of Diet and Risk of Oral and Pharyngeal Cancer in a Large Case‐Control Study From Italy International Journal of Cancer 141 3 2017 471 479 28340515 10.1002/ijc.30711 PMC5464969 115 M. Dalmartello A. Decarli M. Ferraroni Dietary Patterns and Oral and Pharyngeal Cancer Using Latent Class Analysis International Journal of Cancer 147 3 2020 719 727 31677269 10.1002/ijc.32769 116 S. K. Clinton E. L. Giovannucci S. D. Hursting The World Cancer Research Fund/American Institute for Cancer Research Third Expert Report on Diet, Nutrition, Physical Activity, and Cancer: Impact and Future Directions Journal of Nutrition 150 4 2020 663 671 31758189 10.1093/jn/nxz268 PMC7317613 117 C. Bosetti C. La Vecchia R. Talamini Energy, Macronutrients and Laryngeal Cancer Risk Annals of Oncology 14 6 2003 907 912 12796029 10.1093/annonc/mdg251 118 E. Bidoli C. Bosetti C. La Vecchia Micronutrients and Laryngeal Cancer Risk in Italy and Switzerland: A Case–Control Study Cancer Causes & Control: CCC 14 2003 477 484 12946043 10.1023/a:1024991618398 119 C. Pelucchi R. Talamini F. Levi Fibre Intake and Laryngeal Cancer Risk Annals of Oncology 14 1 2003 162 167 12488309 10.1093/annonc/mdg032 120 B. Gupta F. Bray N. Kumar N. W. Johnson Associations Between Oral Hygiene Habits, Diet, Tobacco and Alcohol and Risk of Oral Cancer: A Case‐Control Study From India Cancer Epidemiology 51 2017 7 14 28968558 10.1016/j.canep.2017.09.003 121 M. Kumar R. Nanavati T. Modi C. Dobariya Oral Cancer: Etiology and Risk Factors: A Review Journal of Cancer Research and Therapeutics 12 2 2016 458 463 27461593 10.4103/0973-1482.186696 122 G. R. Sampaio G. M. Guizellini S. A. da Silva Polycyclic Aromatic Hydrocarbons in Foods: Biological Effects, Legislation, Occurrence, Analytical Methods, and Strategies to Reduce Their Formation International Journal of Molecular Sciences 22 11 2021 6010 34199457 10.3390/ijms22116010 PMC8199595 123 A. J. Cross J. M. Harnly L. M. Ferrucci A. Risch S. T. Mayne R. Sinha Developing a Heme Iron Database for Meats According to Meat Type, Cooking Method and Doneness Level Food and Nutrition Sciences 3 7 2012 905 913 23459329 10.4236/fns.2012.37120 PMC3583546 124 Humans IWGotEoCRt IARC Monographs on the Evaluation of Carcinogenic Risks to Humans. Red Meat and Processed Meat publications@iarc.fr 125 A. Carr S. Maggini Vitamin C and Immune Function Nutrients 9 11 2017 1211 29099763 10.3390/nu9111211 PMC5707683 126 C. Fan S. Yu S. Zhang X. Ding J. Su Z. Cheng Association Between Folate Intake and Risk of Head and Neck Squamous Cell Carcinoma: An Overall and Dose‐Response Prisma Meta‐Analysis Medicine 96 42 2017 e8182 29049201 10.1097/MD.0000000000008182 PMC5662367 127 M. F. Holick Vitamin D Deficiency New England Journal of Medicine 357 3 2007 266 281 17634462 10.1056/NEJMra070553 128 G. Sarode N. Maniyar S. C. Sarode M. Jafer S. Patil K. H. Awan Epidemiologic Aspects of Oral Cancer Disease‐a‐Month 66 12 2020 100988 32605720 10.1016/j.disamonth.2020.100988 129 D. Meza‐Valderrama E. Marco V. Dávalos‐Yerovi Sarcopenia, Malnutrition, and Cachexia: Adapting Definitions and Terminology of Nutritional Disorders in Older People With Cancer Nutrients 13 3 2021 761 33652812 10.3390/nu13030761 PMC7996854 130 R. Bhatnagar J. Dabholkar D. Saranath Genome‐Wide Disease Association Study in Chewing Tobacco Associated Oral Cancers Oral Oncology 48 9 2012 831 835 22503698 10.1016/j.oraloncology.2012.03.007 131 R. Gupta S. C. Sharma S. N. Das Association of TNF‐α and TNFR1 Promoters and 3′ UTR Region of TNFR2 Gene Polymorphisms With Genetic Susceptibility to Tobacco‐Related Oral Carcinoma in Asian Indians Oral Oncology 44 5 2008 455 463 18206417 10.1016/j.oraloncology.2007.06.003 132 K. P. Chang S. P. Hao C. T. Liu Promoter Polymorphisms of DNMT3B and the Risk of Head and Neck Squamous Cell Carcinoma in Taiwan: A Case‐Control Study Oral Oncology 43 4 2007 345 351 16920385 10.1016/j.oraloncology.2006.04.006 133 D. Anantharaman P. M. Chaubal S. Kannan R. A. Bhisey M. B. Mahimkar Susceptibility to Oral Cancer by Genetic Polymorphisms At CYP1A1, GSTM1 and GSTT1 Loci Among Indians: Tobacco Exposure as a Risk Modulator Carcinogenesis 28 7 2007 1455 1462 17307803 10.1093/carcin/bgm038 134 M. Huang Cyclin D1 Gene Polymorphism as a Risk Factor for Oral Premalignant Lesions Carcinogenesis 27 10 2006 2034 2037 16638786 10.1093/carcin/bgl048 135 P. W. Kämmerer T. Toyoshima F. Schöder Association of T‐Cell Regulatory Gene Polymorphisms With Oral Squamous Cell Carcinoma Oral Oncology 46 7 2010 543 548 20435510 10.1016/j.oraloncology.2010.03.025 136 P. Solomon G. Selvam G. Shanmugam Polymorphism in ADH and MTHFR Genes in Oral Squamous Cell Carcinoma of Indians Oral Diseases 14 7 2008 633 639 18266839 10.1111/j.1601-0825.2007.01437.x 137 C. F. Chiu M. H. Tsai H. C. Tseng A Novel Single Nucleotide Polymorphism in ERCC6 Gene Is Associated With Oral Cancer Susceptibility in Taiwanese Patients Oral Oncology 44 6 2008 582 586 17933579 10.1016/j.oraloncology.2007.07.006 138 C. Y. Yen S. Y. Liu C. H. Chen Combinational Polymorphisms of Four DNA Repair Genes XRCC1, XRCC2, XRCC3, and XRCC4 and Their Association With Oral Cancer in Taiwan Journal of Oral Pathology & Medicine 37 5 2008 271 277 18410587 10.1111/j.1600-0714.2007.00608.x 139 R. Kaur J. K. Nagpal B. R. Das Polymorphism in IGF‐2 as a Surrogate Marker for Predisposition Towards Tobacco Chewing‐Mediated Oral Cancer Tumor Biology 26 2005 147 152 15970649 10.1159/000086486 140 X. Zhou S. Mok Z. Chen Y. Li D. W. Wong Concurrent Analysis of Loss of Heterozygosity (LOH) and Copy Number Abnormality (CNA) for Oral Premalignancy Progression Using the Affymetrix 10K SNP Mapping Array Human Genetics 115 4 2004 327 330 15290239 10.1007/s00439-004-1163-1 141 U. Nair Alert for An Epidemic of Oral Cancer Due to Use of the Betel Quid Substitutes Gutkha and Pan Masala: A Review of Agents and Causative Mechanisms Mutagenesis 19 4 2004 251 262 15215323 10.1093/mutage/geh036 142 C. Scully Contemporary Issues in Oral Cancer Oral Oncology 37 2001 114 143 D. Winn Y. C. Lee M. Hashibe P. Boffetta consortium I The INHANCE Consortium: Toward a Better Understanding of the Causes and Mechanisms of Head and Neck Cancer Oral Diseases 21 6 2015 685 693 25809224 10.1111/odi.12342 144 M. Hashibe J. D. McKay M. P. Curado Multiple ADH Genes Are Associated With Upper Aerodigestive Cancers Nature Genetics 40 6 2008 707 709 18500343 10.1038/ng.151 145 Y. Gao Y. Wei X. Zhou S. Huang H. Zhao P. Zeng Assessing the Relationship Between Leukocyte Telomere Length and Cancer Risk/Mortality in UK Biobank and TCGA Datasets With the Genetic Risk Score and Mendelian Randomization Approaches Frontiers in Genetics 11 2020 583106 33193711 10.3389/fgene.2020.583106 PMC7644901 146 M. J. Machiela C. A. Hsiung X. O. Shu Genetic Variants Associated With Longer Telomere Length Are Associated With Increased Lung Cancer Risk Among Never‐Smoking Women in Asia: A Report From the Female Lung Cancer Consortium in Asia International Journal of Cancer 137 2 2015 311 319 25516442 10.1002/ijc.29393 PMC4733320 147 M. Giaccherini A. Macauda E. Orciuolo Genetically Determined Telomere Length and Multiple Myeloma Risk and Outcome Blood Cancer Journal 11 4 2021 74 33854038 10.1038/s41408-021-00462-y PMC8046773 148 I. Hosen P. S. Rachakonda B. Heidenreich Mutations in TERT Promoter and FGFR3 and Telomere Length in Bladder Cancer International Journal of Cancer 137 7 2015 1621 1629 25809917 10.1002/ijc.29526 149 Y. Gu C. Yu L. Miao Telomere Length, Genetic Variants and Risk of Squamous Cell Carcinoma of the Head and Neck in Southeast Chinese Scientific Reports 6 1 2016 20675 26857734 10.1038/srep20675 PMC4746643 150 S. Yamada K. Misawa M. Mima Telomere Shortening in Head and Neck Cancer: Association Between DNA Demethylation and Survival Journal of Cancer 12 8 2021 2165 2172 33758594 10.7150/jca.54760 PMC7974875 151 M. Castella S. Puerto A. Creus R. Marcos J. Surralles Telomere Length Modulates Human Radiation Sensitivity In Vitro Toxicology Letters 172 1–2 2007 29 36 17604920 10.1016/j.toxlet.2007.05.012 152 N. F. Mathon A. C. Lloyd Cell Senescence and Cancer Nature Reviews Cancer 1 3 2001 203 213 11902575 10.1038/35106045 153 E. H. Blackburn Switching and Signaling at the Telomere Cell 106 6 2001 661 673 11572773 10.1016/s0092-8674(01)00492-5 154 R. C. Allsopp H. Vaziri C. Patterson Telomere Length Predicts Replicative Capacity of Human Fibroblasts Proceedings of the National Academy of Sciences 89 21 1992 10114 10118 10.1073/pnas.89.21.10114 PMC50288 1438199 155 K. A. Pooley S. E. Bojesen M. Weischer A Genome‐Wide Association Scan (GWAS) for Mean Telomere Length Within the COGS Project: Identified Loci Show Little Association With Hormone‐Related Cancer Risk Human Molecular Genetics 22 24 2013 5056 5064 23900074 10.1093/hmg/ddt355 PMC3836481 156 M. Mangino S. J. Hwang T. D. Spector Genome‐Wide Meta‐Analysis Points to CTC1 and ZNF676 as Genes Regulating Telomere Homeostasis in Humans Human Molecular Genetics 21 24 2012 5385 5394 23001564 10.1093/hmg/dds382 PMC3510758 157 N. Y. Loh R. Noordam C. Christodoulides Telomere Length and Metabolic Syndrome Traits: A Mendelian Randomisation Study Aging cell 20 8 2021 e13445 34312982 10.1111/acel.13445 PMC8373272 158 D. A. Delgado C. Zhang L. S. Chen Genome‐Wide Association Study of Telomere Length Among South Asians Identifies a Second RTEL1 Association Signal Journal of Medical Genetics 55 1 2018 64 71 29151059 10.1136/jmedgenet-2017-104922 PMC5749304 159 V. Codd M. Mangino P. van der Harst Common Variants Near TERC Are Associated With Mean Telomere Length Nature Genetics 42 3 2010 197 199 20139977 10.1038/ng.532 PMC3773906 160 Y. Gu C. Yu L. Miao Telomere Length, Genetic Variants and Risk of Squamous Cell Carcinoma of the Head and Neck in Southeast Chinese Scientific Reports 6 2016 20675 26857734 10.1038/srep20675 PMC4746643 161 Z. Liu H. Ma S. Wei G. Li E. M. Sturgis Q. Wei Telomere Length and TERT Functional Polymorphisms Are Not Associated With Risk of Squamous Cell Carcinoma of the Head and Neck Cancer Epidemiology, Biomarkers & Prevention 20 12 2011 2642 2645 10.1158/1055-9965.EPI-11-0890 PMC3237736 21994403 162 A. Y. Han E. C. Kuan J. Mallen‐St Clair J. E. Alonso A. Arshi M. A. St John Epidemiology of Squamous Cell Carcinoma of the Lip in the United States: A Population‐Based Cohort Analysis JAMA Otolaryngology–Head & Neck Surgery 142 12 2016 1216 1223 27832256 10.1001/jamaoto.2016.3455 163 D. S. Rigel Cutaneous Ultraviolet Exposure and Its Relationship to the Development of Skin Cancer Journal of the American Academy of Dermatology 58 5 Suppl 2 2008 S129 S132 18410798 10.1016/j.jaad.2007.04.034 164 A. K. El‐Naggar J. K. C. Chan T. Takata J. R. Grandis P. J. Slootweg The Fourth Edition of the Head and Neck World Health Organization Blue Book: Editors' Perspectives Human Pathology 66 2017 10 12 28583885 10.1016/j.humpath.2017.05.014 165 D. P. Goldstein J. C. Irish Head and Neck Squamous Cell Carcinoma in the Young Patient Current Opinion in Otolaryngology & Head and Neck Surgery 13 4 2005 207 211 16012243 10.1097/01.moo.0000170529.04759.4c 166 R. Mroueh T. Carpén A. Mäkitie Occupational Variation in the Incidence of Lip Cancer in the Nordic Countries Acta Oncologica 62 6 2023 541 549 37337140 10.1080/0284186X.2023.2224053 167 A. Kolokythas Lip Cancer: Treatment and Reconstruction 2014 168 Americal Cancer Society https://www.cancer.org/cancer/types/oral-cavity-and-oropharyngeal-cancer/about/key-statistics.html 169 T. N. Toporcov A. Znaor Z. F. Zhang Risk Factors for Head and Neck Cancer in Young Adults: A Pooled Analysis in the INHANCE Consortium International Journal of Epidemiology 44 1 2015 169 185 25613428 10.1093/ije/dyu255 PMC4339764 170 S. C. Patel W. R. Carpenter S. Tyree Increasing Incidence of Oral Tongue Squamous Cell Carcinoma in Young White Women, Age 18 to 44 Years Journal of Clinical Oncology 29 11 2011 1488 1494 21383286 10.1200/JCO.2010.31.7883 171 R. Alhabbab R. Johar Lip Cancer Prevalence, Epidemiology, Diagnosis, and Management: A Review of the Literature Advances in Oral and Maxillofacial Surgery 6 2022 100276 172 D. Rowe R. P. Gallagher L. Warshawski A. Carruthers Females Vastly Outnumber Males in Basal Cell Carcinoma of the Upper Lip. A Peculiar Subset of High Risk Young Females Is Described Journal of Dermatologic Surgery and Oncology 20 11 1994 754 756 7962937 10.1111/j.1524-4725.1994.tb03199.x 173 M. T. Bastiaens J. J. Hoefnagel B. J. Vermeer J. N. Bouwes Bavinck J. A. Bruijn R. G. J. Westendorp Differences in Age, Site Distribution, and Sex Between Nodular and Superficial Basal Cell Carcinomas Indicate Different Types of Tumors Journal of Investigative Dermatology 110 6 1998 880 884 9620293 10.1046/j.1523-1747.1998.00217.x 174 D. Hashim S. Sartori P. Brennan The Role of Oral Hygiene in Head and Neck Cancer: Results From International Head and Neck Cancer Epidemiology (INHANCE) Consortium Annals of Oncology 27 8 2016 1619 1625 27234641 10.1093/annonc/mdw224 PMC4959929 175 J. Lissowska A. Pilarska P. Pilarski Smoking, Alcohol, Diet, Dentition and Sexual Practices in the Epidemiology of Oral Cancer in Poland European Journal of Cancer Prevention 12 1 2003 25 33 12548107 10.1097/00008469-200302000-00005 176 N. Guha P. Boffetta V. Wunsch Filho Oral Health and Risk of Squamous Cell Carcinoma of the Head and Neck and Esophagus: Results of Two Multicentric Case‐Control Studies American Journal of Epidemiology 166 10 2007 1159 1173 17761691 10.1093/aje/kwm193 177 J. S. Chang H. I. Lo T. Y. Wong Investigating the Association Between Oral Hygiene and Head and Neck Cancer Oral Oncology 49 10 2013 1010 1017 23948049 10.1016/j.oraloncology.2013.07.004 178 S. Manoharan V. Nagaraja G. D. Eslick Ill‐Fitting Dentures and Oral Cancer: A Meta‐Analysis Oral Oncology 50 11 2014 1058 1061 25169920 10.1016/j.oraloncology.2014.08.002 179 W. Ahrens H. Pohlabeln R. Foraita Oral Health, Dental Care and Mouthwash Associated With Upper Aerodigestive Tract Cancer Risk in Europe: The ARCAGE Study Oral Oncology 50 6 2014 616 625 24680035 10.1016/j.oraloncology.2014.03.001 180 P. Boffetta R. B. Hayes S. Sartori Mouthwash Use and Cancer of the Head and Neck: A Pooled Analysis From the International Head and Neck Cancer Epidemiology Consortium European Journal of Cancer Prevention 25 4 2016 344 348 26275006 10.1097/CEJ.0000000000000179 PMC4752930 181 S. Gandini E. Negri P. Boffetta C. La Vecchia P. Boyle Mouthwash and Oral Cancer Risk Quantitative Meta‐Analysis of Epidemiologic Studies Annals of Agricultural and Environmental Medicine: AAEM 19 2 2012 173 180 22742785 182 C. H. Shiboski B. L. Schmidt R. C. K. Jordan Tongue and Tonsil Carcinoma: Increasing Trends in the U.S. Population Ages 20‐44 Years Cancer 103 9 2005 1843 1849 15772957 10.1002/cncr.20998 183 M. L. Gillison Evidence for a Causal Association Between Human Papillomavirus and a Subset of Head and Neck Cancers Journal of the National Cancer Institute 92 9 2000 709 720 10793107 10.1093/jnci/92.9.709 184 A. R. Kreimer G. M. Clifford P. Boyle S. Franceschi Human Papillomavirus Types in Head and Neck Squamous Cell Carcinomas Worldwide: A Systematic Review Cancer Epidemiology, Biomarkers & Prevention 14 2 2005 467 475 10.1158/1055-9965.EPI-04-0551 15734974 185 M. L. Gillison Human Papillomavirus‐Associated Head and Neck Cancer Is a Distinct Epidemiologic, Clinical, and Molecular Entity Seminars in Oncology 31 6 2004 744 754 15599852 10.1053/j.seminoncol.2004.09.011 186 M. L. Gillison A. K. Chaturvedi W. F. Anderson C. Fakhry Epidemiology of Human Papillomavirus‐Positive Head and Neck Squamous Cell Carcinoma Journal of Clinical Oncology 33 29 2015 3235 3242 26351338 10.1200/JCO.2015.61.6995 PMC4979086 187 H. Mehanna T. Beech T. Nicholson Prevalence of Human Papillomavirus in Oropharyngeal and Nonoropharyngeal Head and Neck Cancer‐‐Systematic Review and Meta‐Analysis of Trends by Time and Region Head & Neck 35 5 2013 747 755 22267298 10.1002/hed.22015 188 D. Anantharaman B. Abedi‐Ardekani D. C. Beachler Geographic Heterogeneity in the Prevalence of Human Papillomavirus in Head and Neck Cancer International Journal of Cancer 140 9 2017 1968 1975 28108990 10.1002/ijc.30608 PMC8969079 189 N. Scott‐Wittenborn C. Fakhry Epidemiology of HPV Related Malignancies Seminars in Radiation Oncology 31 4 2021 286 296 34455984 10.1016/j.semradonc.2021.04.001 PMC9057013 190 Y. Lu Z. Xie G. Luo Global Burden of Oropharyngeal Cancer Attributable to Human Papillomavirus by Anatomical Subsite and Geographic Region Cancer Epidemiology 78 2022 102140 35303618 10.1016/j.canep.2022.102140 191 M. E. Sabatini S. Chiocca Human Papillomavirus as a Driver of Head and Neck Cancers British Journal of Cancer 122 3 2020 306 314 31708575 10.1038/s41416-019-0602-7 PMC7000688 192 E. M. Rettig M. Zaidi F. Faraji Oropharyngeal Cancer Is No Longer a Disease of Younger Patients and the Prognostic Advantage of Human Papillomavirus Is Attenuated Among Older Patients: Analysis of The National Cancer Database Oral Oncology 83 2018 147 153 30098771 10.1016/j.oraloncology.2018.06.013 PMC6500732 193 M. L. Gillison T. Broutian R. K. L. Pickard Prevalence of Oral HPV Infection in the United States, 2009‐2010 Journal of the American Medical Association 307 7 2012 693 703 22282321 10.1001/jama.2012.101 PMC5790188 194 A. K. Chaturvedi E. A. Engels W. F. Anderson M. L. Gillison Incidence Trends for Human Papillomavirus‐Related and ‐Unrelated Oral Squamous Cell Carcinomas in the United States Journal of Clinical Oncology 26 4 2008 612 619 18235120 10.1200/JCO.2007.14.1713 195 E. M. Smith J. M. Ritchie K. F. Summersgill Human Papillomavirus in Oral Exfoliated Cells and Risk of Head and Neck Cancer JNCI Journal of the National Cancer Institute 96 6 2004 449 455 15026470 10.1093/jnci/djh074 196 R. Herrero Human Papillomavirus and Oral Cancer: The International Agency for Research on Cancer Multicenter Study CancerSpectrum Knowledge Environment 95 23 2003 1772 1783 10.1093/jnci/djg107 14652239 197 S. M. Schwartz J. R. Daling M. M. Madeleine Oral Cancer Risk in Relation to Sexual History and Evidence of Human Papillomavirus Infection JNCI Journal of the National Cancer Institute 90 21 1998 1626 1636 9811312 10.1093/jnci/90.21.1626 198 S. Paget‐Bailly D. Cyr D. Luce Occupational Exposures to Asbestos, Polycyclic Aromatic Hydrocarbons and Solvents, and Cancers of the Oral Cavity and Pharynx: A Quantitative Literature Review International Archives of Occupational and Environmental Health 85 4 2012 341 351 21785866 10.1007/s00420-011-0683-y 199 S. Paget‐Bailly D. Cyr D. Luce Occupational Exposures and Cancer of the Larynx‐Systematic Review and Meta‐Analysis Journal of Occupational & Environmental Medicine 54 1 2012 71 84 22157731 10.1097/JOM.0b013e31823c1343 200 K. H. Awan R. Hegde V. J. Cheever Oral and Pharyngeal Cancer Risk Associated With Occupational Carcinogenic Substances: Systematic Review Head & Neck 40 12 2018 2724 2732 30387891 10.1002/hed.25486 201 L. Tarvainen P. Kyyrönen T. Kauppinen E. Pukkala Cancer of the Mouth and Pharynx, Occupation and Exposure to Chemical Agents in Finland [in 1971‐95] International Journal of Cancer 123 3 2008 653 659 18470913 10.1002/ijc.23286 202 H. Riechelmann Berufliche Verursachung Und Bewertung Von Mundhöhlen‐ Und Rachentumoren Laryngo‐Rhino‐Otologie 81 8 2002 573 579 12189574 10.1055/s-2002-33365 203 J. L. Marchand D. Luce A. Leclerc Laryngeal and Hypopharyngeal Cancer and Occupational Exposure to Asbestos and Man‐Made Vitreous Fibers: Results of a Case‐Control Study American Journal of Industrial Medicine 37 6 2000 581 589 10797501 10.1002/(sici)1097-0274(200006)37:6<581::aid-ajim2>3.0.co;2-d 204 A. Hildesheim M. Dosemeci C. C. Chan Occupational Exposure to Wood, Formaldehyde, and Solvents and Risk of Nasopharyngeal Carcinoma Cancer Epidemiology, Biomarkers & Prevention: A Publication of the American Association for Cancer Research, Cosponsored by the American Society of Preventive Oncology 10 11 2001 1145 1153 11700262 205 R. W. Armstrong P. B. Imrey M. S. Lye M. J. Armstrong M. C. Yu S. Sani Nasopharyngeal Carcinoma in Malaysian Chinese: Occupational Exposures to Particles, Formaldehyde and Heat International Journal of Epidemiology 29 6 2000 991 998 11101539 10.1093/ije/29.6.991 206 M. B. Hansen S. Rydin T. Menné J. Duus Johansen Quantitative Aspects of Contact Allergy to Chromium and Exposure to Chrome‐Tanned Leather Contact Dermatitis 47 3 2002 127 134 12492543 10.1034/j.1600-0536.2002.470301.x 207 S. M. Langevin M. D. McClean D. S. Michaud M. Eliot H. H. Nelson K. T. Kelsey Occupational Dust Exposure and Head and Neck Squamous Cell Carcinoma Risk in a Population‐Based Case‐Control Study Conducted in the Greater Boston Area Cancer Medicine 2 6 2013 978 986 24403272 10.1002/cam4.155 PMC3892403 208 W. Garavello R. Foschi R. Talamini Family History and the Risk of Oral and Pharyngeal Cancer International Journal of Cancer 122 8 2008 1827 1831 18076043 10.1002/ijc.23199 209 R. Ankathil A. Mathew F. Joseph M. K. Nair Is Oral Cancer Susceptibility Inherited? Report of Five Oral Cancer Families European Journal of Cancer Part B: Oral Oncology 32b 1 1996 63 67 8729621 10.1016/0964-1955(95)00055-0 210 H. Tashiro K. Abe H. Tanioka Familial Occurrence of Cancer of the Mouth Journal of Oral and Maxillofacial Surgery 44 4 1986 322 323 3457127 10.1016/0278-2391(86)90083-2 211 H. Hara S. Ozeki Y. Shiratsuchi H. Tashiro K. Jingu Familial Occurrence of Oral Cancer: Report of Cases Journal of Oral and Maxillofacial Surgery 46 12 1988 1098 1102 3193286 10.1016/0278-2391(88)90458-2 212 M. L. Bondy M. R. Spitz S. Halabi Association Between Family History of Cancer and Mutagen Sensitivity in Upper Aerodigestive Tract Cancer Patients. Cancer Epidemiology, Biomarkers & Prevention: A Publication of the American Association for Cancer Research, Cosponsored by the American Society of Preventive Oncology 2 2 1993 103 106 7682127 213 M. P. Copper A. Jovanovic J. J. Nauta Role of Genetic Factors in the Etiology of Squamous Cell Carcinoma of the Head and Neck Archives of Otolaryngology‐‐Head & Neck Surgery 121 2 1995 157 160 7840922 10.1001/archotol.1995.01890020019005 214 W. D. Foulkes J. S. Brunet L. P. Kowalski S. A. Narod E. L. Franco Family History of Cancer Is a Risk Factor for Squamous Cell Carcinoma of the Head and Neck in Brazil: A Case‐Control Study International Journal of Cancer 63 6 1995 769 773 8847131 10.1002/ijc.2910630603 215 W. D. Foulkes J. S. Brunet W. Sieh M. J. Black G. Shenouda S. A. Narod Familial Risks of Squamous Cell Carcinoma of the Head and Neck: Retrospective Case‐Control Study BMJ 313 7059 1996 716 721 8819440 10.1136/bmj.313.7059.716 PMC2352110 216 G. P. Yu Z. F. Zhang T. C. Hsu M. R. Spitz S. P. Schantz Family History of Cancer, Mutagen Sensitivity, and Increased Risk of Head and Neck Cancer Cancer Letters 146 1 1999 93 101 10656614 10.1016/s0304-3835(99)00249-9 217 S. Jefferies R. Eeles D. Goldgar The Role of Genetic Factors in Predisposition to Squamous Cell Cancer of the Head and Neck British Journal of Cancer 79 5–6 1999 865 867 10070882 10.1038/sj.bjc.6690138 PMC2362666 218 J. Mork B. Møller E. Glattre Familial Risk in Head and Neck Squamous Cell Carcinoma Diagnosed before the Age of 45: A Population‐Based Study Oral Oncology 35 4 1999 360 367 10645399 10.1016/s1368-8375(98)00069-4 219 C. La Vecchia A. Tavani S. Franceschi F. Levi G. Corrao E. Negri Epidemiology and Prevention of Oral Cancer Oral Oncology 33 5 1997 302 312 9415327 10.1016/s1368-8375(97)00029-8 220 M. DE Andrade C. I. Amos W. D. Foulkes Segregation Analysis of Squamous Cell Carcinoma of the Head and Neck: Evidence for a Major Gene Determining Risk Annals of Human Genetics 62 1998 505 510 10363128 10.1046/j.1469-1809.1998.6260505.x 221 W. Garavello R. Foschi R. Talamini Family History and the Risk of Oral and Pharyngeal Cancer International Journal of Cancer 122 2007 1827 1831 10.1002/ijc.23199 18076043 222 G. Nishimura D. Sano Y. Arai The Incidence of Newly Diagnosed Secondary Cancer; Sub‐Analysis the Prospective Study of the Second‐Look Procedure for Transoral Surgery in Patients With T1 and T2 Head and Neck Cancer International Journal of Clinical Oncology 26 1 2021 59 65 32929629 10.1007/s10147-020-01779-7 223 G. Nishimura D. Sano Y. Arai A Risk Factor for Newly Diagnosed Secondary Cancer in Patients With Early‐Stage Laryngeal, Oropharyngeal, or Hypopharyngeal Cancer: Sub‐Analysis of a Prospective Observation Study International Journal of Clinical Oncology 27 3 2022 488 494 34787745 10.1007/s10147-021-02080-x 224 A. Mesbahi F. Seyednejad A. Gasemi‐Jangjoo Estimation of Organs Doses and Radiation‐Induced Secondary Cancer Risk From Scattered Photons for Conventional Radiation Therapy of Nasopharynx: A Monte Carlo Study Japanese Journal of Radiology 28 5 2010 398 403 20585932 10.1007/s11604-010-0432-2 225 N. Nicolotti S. C. Chuang G. Cadoni Recreational Physical Activity and Risk of Head and Neck Cancer: A Pooled Analysis Within the International Head and Neck Cancer Epidemiology (INHANCE) Consortium European Journal of Epidemiology 26 8 2011 619 628 21842237 10.1007/s10654-011-9612-3 226 K. Rothman S. Greenland T. L. Lash 3rd ed Modern Epidemiology Lippincott Williams & Wilkins 2008 227 A. M. Novas D. G. Rowbottom D. G. Jenkins Tennis, Incidence of URTI and Salivary IgA International Journal of Sports Medicine 24 3 2003 223 229 12740744 10.1055/s-2003-39096 228 K. Sujatha IJCM_377A: Socio‐Demographic and Clinical Profile of Lip, Oral Cavity and Pharyngeal Cancer in An Urban Cancer Centre in Coimbatore Indian Journal of Community Medicine 49 Suppl 1 2024 S108 229 T. D. Ellington S. J. Henley V. Senkomago Trends in Incidence of Cancers of the Oral Cavity and Pharynx ‐ United States 2007‐2016 Morbidity and Mortality Weekly Report 69 15 2020 433 438 32298244 10.15585/mmwr.mm6915a1 PMC7755056 230 K. K. Kanmodi A. A. Salami J. N. Nwafor Mhealth Interventions to Improve Public Knowledge of HPV‐Associated Oral Cancer in the UK Journal of Global Medicine 4 2024 e173 231 M. Lehtinen D. Apter T. Eriksson Effectiveness of the AS04‐adjuvanted HPV‐16/18 Vaccine In Reducing Oropharyngeal HPV Infections in Young Females‐Results From a Community‐Randomized Trial International Journal of Cancer 147 1 2020 170 174 31736068 10.1002/ijc.32791 PMC7318585 232 H. Salehiniya M. Raei Oral Cavity and Lip Cancer in the World: An Epidemiological Review Biomedical Research and Therapy 7 2020 3898 3905 233 N. Taghavi I. Yazdi Type of Food and Risk of Oral Cancer Archives of Iranian Medicine 10 2 2007 227 232 17367228 234 M. M. Stepovic D. Stajic M. Sekulic Z. Rajkovic N. Djonovic Analysis of Mortality From Carcinomas Primary Localized in Region of Lip, Oral Cavity and Pharynx in Central Serbia, 1999‐2015 Iranian Journal of Public Health 49 2 2020 274 282 32461935 PMC7231697 235 S. Roy P. Raj K. Yadav Oral Cancer Awareness and Knowledge in Patients Visiting Tertiary Medical Center MedS Alliance Journal of Medicine and Medical Sciences 2 2022 15 20 236 J. M. Watson S. L. Tomar V. Dodd H. L. Logan Y. Choi Effectiveness of a Social Marketing Media Campaign to Reduce Oral Cancer Racial Disparities Journal of the National Medical Association 101 8 2009 774 782 19715040 10.1016/s0027-9684(15)31005-1 237 M. D. Mignogna S. Fedele L. L. Russo E. Ruoppo L. L. Muzio Oral and Pharyngeal Cancer: Lack of Prevention and Early Detection by Health Care Providers European Journal of Cancer Prevention 10 4 2001 381 383 11535883 10.1097/00008469-200108000-00014 238 Y. Yamamoto T. Kamiya M. Yano Oral Microbial Profile Analysis in Patients With Oral and Pharyngeal Cancer Reveals That Tumoral Fusobacterium Nucleatum Promotes Oral Cancer Progression by Activating YAP Microorganisms 11 12 2023 2957 38138101 10.3390/microorganisms11122957 PMC10746018 239 A. E. Uzcudun I. R. Retolaza A. G. Grande Pharyngeal Cancer Prevention: Evidence From a Case‐‐Control Study Involving 232 Consecutive Patients Journal of Laryngology & Otology 116 7 2002 523 531 12238672 10.1258/002221502760132395 240 S. Matos E. A. Boakye D. Crosby A. Sharma Prevalence and Factors Associated With Oral Cavity and Pharyngeal Cancer Screening in a Rural Population OTO Open 5 4 2021 2473974x211065018 10.1177/2473974X211065018 PMC8671683 34926974 241 M. C. Neetha Oral Cancer Prevention Strategies: A Great Deal Remains to be Done CODS‐Journal of Dentistry 13 1 2021 1 2 242 P. H. Chen Y. Y. Wang T. H. Lan L. P. Chan S. S. Yuan Genetic and Proteinic Linkage of MAO and COMT With Oral Potentially Malignant Disorders and Cancers of the Oral Cavity and Pharynx Cancers 13 13 2021 3268 34209963 10.3390/cancers13133268 PMC8268107 243 J. J. Caudell M. L. Gillison E. Maghami NCCN Guidelines® Insights: Head and Neck Cancers, Version 1.2022 Journal of the National Comprehensive Cancer Network 20 3 2022 224 234 35276673 10.6004/jnccn.2022.0016 244 S. Warnakulasuriya 2009 Food, nutrition and oral cancer Food Constituents and Oral Health Current Status and Future Prospects. Woodhead Publishing Series in Food Science, Technology and Nutrition, 273–295 10.1533/9781845696290.2.273 245 T. Shamim Oral Health Policy Amicable for the South Asian Association for Regional Cooperation Nations Iranian Journal of Public Health 43 11 2014 1589 1590 26060731 PMC4449513 246 L. S. Flor M. B. Reitsma V. Gupta M. Ng E. Gakidou The Effects of Tobacco Control Policies on Global Smoking Prevalence Nature Medicine 27 2 2021 239 243 10.1038/s41591-020-01210-8 PMC7884287 33479500 ",
  "metadata": {
    "Title of this paper": "The Effects of Tobacco Control Policies on Global Smoking Prevalence",
    "Journal it was published in:": "Health Science Reports",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12463713/"
  }
}