{
  "title": "Paper_39",
  "abstract": "pmc Oncol Res Oncol Res 3914 oncres OR Oncology Research 0965-0407 1555-3906 Tech Science Press PMC12494113 PMC12494113.1 12494113 12494113 10.32604/or.2025.067340 67340 1 Article ARPC1B Promotes Clear Cell Renal Cell Carcinoma Progression via the Wnt/β-Catenin Signaling Pathway ARPC1B Promotes Clear Cell Renal Cell Carcinoma Progression Via the Wnt/β-Catenin Signaling Pathway ARPC1B Promotes Clear Cell Renal Cell Carcinoma Progression Via the Wnt/β-Catenin Signaling Pathway Peng Jiayin 1 2 # Xue Yijun 2 # Cai Zhiren 2 Li Zhaoguan 2 Han Kangyan 2 Lin Xiaoqi 2 Li Yutong 1 liyutong@jnu.edu.cn Zhuo Yumin 1 tzhuoyumin@126.com 1 Department of Urology, The First Affiliated Hospital of Jinan University Guangzhou, 510620 China 2 Department of Urology, Central People’s Hospital of Zhanjiang, Guangdong Medical University Zhanjiang, 524000 China * liyutong@jnu.edu.cn tzhuoyumin@126.com # 2025 26 9 2025 33 10 498269 3127 3154 30 4 2025 15 8 2025 26 09 2025 04 10 2025 04 10 2025 © 2025 The Authors. 2025 Published by Tech Science Press. https://creativecommons.org/licenses/by/4.0/ This work is licensed under a Creative Commons Attribution 4.0 International License Background Clear cell renal cell carcinoma (ccRCC) is an aggressive malignancy associated with limited treatment options and poor prognosis. Emerging studies suggest that the actin-regulating protein actin-related protein 2/3 complex subunit 1B (ARPC1B), a key regulatory protein within the actin cytoskeleton, could play a pivotal role in ccRCC progression. The current study aimed to uncover the biological functions of ARPC1B and the molecular mechanisms driving its effects in ccRCC. Methods ARPC1B expression and prognostic implications were analyzed using data sourced from the Gene Expression Profiling Interactive Analysis (GEPIA) platform, immunohistochemical (IHC) staining on 150 tumor samples along with 30 corresponding normal tissues, and Western blotting (WB) analyses across multiple ccRCC-derived cell lines. Functional assays assessing cell proliferation, colony formation capability, migration, invasion, and in vivo Results The findings revealed a substantial elevation of ARPC1B in ccRCC tissues and cell lines, significantly associated with advanced TNM stages, higher Fuhrman grades, and reduced overall survival (OS) ( p Conclusions ARPC1B emerges as an essential oncogenic factor in ccRCC by stimulating EMT and activating the Wnt/β-catenin pathway, ultimately enhancing tumor aggressiveness and metastatic potential. Thus, targeting ARPC1B represents a promising therapeutic strategy, warranting further exploration in ccRCC management. Clear cell renal cell carcinoma (ccRCC) biomarker epithelial-to-mesenchymal transition (EMT) Wnt/β-catenin signaling actin-related protein 2/3 complex subunit 1B (ARPC1B) pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement no pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes 1 Introduction RCC is among the most prevalent and aggressive cancers involving the urinary system [ 1 3 4 7 8 9 10 11 12 14 15 17 18 20 21 23 ARPC1B is an integral component of the ARP2/3 complex [ 24 24 25 26 27 26 28 29 30 31 32 33 This study aims to investigate the clinical significance of ARPC1B expression in ccRCC and elucidate its functional contributions to tumor progression. We hypothesize that ARPC1B promotes ccRCC aggressiveness through activation of the Wnt/β-catenin signaling pathway and induction of epithelial-mesenchymal transition. Utilizing comprehensive in vitro in vivo 2 Materials and Methods 2.1 Database and Data Analysis Gene Expression Omnibus (GEO; https://www.ncbi.nlm.nih.gov/geo/ GSE53757 GSE68418 2 2 p http://gepia2.cancer-pku.cn/ 2.2 Tissue Specimens and IHC Analysis The American Joint Committee on Cancer (AJCC) 8th edition TNM staging system was employed for all cases. This tissue microarray (TMA; XT15-050) includes 150 ccRCC tissues from patients who underwent radical nephrectomy with regional lymph node dissection and 30 matched neighboring non-tumor controls; it was acquired from Shanghai Outdo Biotech Co., Ltd. (Shanghai, China) (SOBC). Critically, all surgical specimens had confirmed pathological nodal status (pN0/pN1) with no pNX cases, enabling precise pathological TNM staging (pT/pN). In the years 2008–2010, the pathological validity of surgical specimens was determined. Approval No. SHYJS-C1510001 from the SOBC Ethics Committee meant that the research could go forward in compliance with the 1975, revised 2000 Helsinki Declaration. Informed consent was obtained from all participants. For in-house histological detection of ARPC1B, Proteintech of Wuhan, China, utilized rabbit polyclonal antibodies (Cat# 13835-1-AP; dilution 1:2000). Sections were preheated at 60°C for 1 h before being rehydrated with graded ethanol (100%, 90%, and 70%, 5 min each concentration). The next step was deparaffinization twice in pure xylene, with a 15-min interval between each cycle. The sections were subjected to 3% hydrogen peroxide for 5 min to eliminate any intrinsic peroxidase activity. Once that was done, they were rinsed with phosphate-buffered saline (PBS; 0.01 M, pH 7.4; Sigma, St. Louis, MO, USA, Cat# P3813) that included 0.5% Tween 20. For 5 min at room temperature, DAKO/Agilent’s (Glostrup, Denmark) Cat# S2023, which is for protein blocking without serum, was used. To observe the results of the immunoreactivity test, antibodies were diluted with DAKO antibody diluent and then placed into the EnVision Plus Anti-Rabbit Labeled Polymer Kit (DAKO/Agilent, Cat# S0809). To ascertain the outcomes of the immunostaining procedure, the staining intensity and percentage of cells that tested positive were quantified. For no staining at all, a score of 0, moderate staining at 2, strong staining at 3, and a value of 4, indicating that more than 25% of cells stained positively, were all possible. To get the overall IHC score (ranging from 0 to 12), we multiplied the staining intensity by the percentage. With a score of 6 or more, ARPC1B expression was considered high, while with a score of 6 or lower, it was considered low. Three highly experienced uropathologists evaluated the materials separately, without any background in clinical practice. 2.3 Plasmids and Short Hairpin RNA (shRNA) Lentiviral constructs for ARPC1B overexpression and gene silencing were obtained commercially (GeneChem Co., Ltd., Shanghai, China). To achieve overexpression (OE-ARPC1B), the complete human ARPC1B open reading frame (ORF, NM_005720.4 ′ ′ ′ ′ ′ ′ ′ ′ 2.4 Cell Culture The human ccRCC cell lines 786-O (ATCC CRL-1932; short tandem repeat (STR)-authenticated Dec/2022; Mycoplasma-free) and Caki-1 (ATCC HTB-46; STR-authenticated Nov/2022; Mycoplasma-free) were procured from Pricella Biotechnology Co., Ltd. (Wuhan, China). Additionally, ccRCC cell line A-498 (ATCC HTB-44; STR-authenticated Jan/2023; Mycoplasma-free), papillary renal carcinoma cell line Caki-2 (ATCC HTB-47; STR-authenticated Jan/2023; Mycoplasma-free), and normal renal tubular epithelial cell line HK-2 (ATCC CRL-2190; STR-authenticated Aug/2022; Mycoplasma-free) were generously provided by Professor Jian Wang (Guangdong Medical University, Zhanjiang, China). Standard conditions at 37°C and 5% CO 2 2.5 Quantitative Reverse Transcription Polymerase Chain Reaction (RT-qPCR) Isolating total RNA from different isogenic cell groups (786-O and Caki-1 parental, ARPC1B-overexpressing, ARPC1B-knockdown, and corresponding vector/scrambled control cells) was done using the TRIzol reagent (Thermo Fisher Scientific, Cat# 15596026). The ToloScript All-in-one RT kit (Tolobio, Shanghai, China, Cat# 22107)’s instructions were followed for the synthesis of complementary DNA (cDNA). The 2× SYBR Green Master Mix (Applied Biosystems, Thermo Fisher Scientific, Carlsbad, CA, USA, Cat# A46109) was used to conduct the real-time PCR. The ARPC1B amplification primers were 5 ′ ′ ′ ′ ′ ′ ′ ′ −ΔΔCt 2.6 Cell Proliferation Assay Cell Counting Kit-8 (CCK-8; Dojindo, Tokyo, Japan, Cat# CK04) was used to evaluate the cells’ performance. So that rescue studies could be carried out, cells that did not have ARPC1B were treated for 24 h before plating with 30 μM of Wnt/β-catenin agonist 3 (Proteintech, Wuhan, China, Cat# CM20349). Proliferation was then assessed at 0, 24, 48, 72, and 96 h after cell seeding at 5,000 cells/well in 96-well plates using 786-O and Caki-1 isogenic panels. Each well was incubated for an additional two hours at 37°C with 5% CO 2 2.7 Colony Formation Assay After being seeded onto 6-well plates from the isogenic 786-O and Caki-1 panels in triplicate at around 500 cells per well, cells were cultured continuously for 12 days. The colonies were successfully stained with a 0.5% crystal violet solution and then fixed in 100% methanol. If a colony lacked at least 50 cells, it was not counted using the ImageJ software (v1.53; NIH, Bethesda, MD, USA) program. The colony formation rate was calculated using the formula: (Number of colonies/500 seeded cells) × 100%. 2.8 Wound Healing Assay (WHA) During the whole experiment period, the ARPC1B-knockdown cells were consistently treated with 30 μM of Wnt/β-catenin agonist 3 to create relief circumstances. In 6-well plates, cells from the 786-O and Caki-1 groups were grown for 24 h after being seeded at 1 × 10 5 2.9 Transwell Assays The rescue tests involved supplementing both chambers of the transwell device with 30 μM of Wnt/β-catenin agonist 3. The migration assays were conducted by adding 5 × 10 4 4 2.10 WB Assay The proteins from ccRCC tissues or cells from the isogenic 786-O and Caki-1 panels were extracted using radioimmunoprecipitation assay (RIPA) buffer (Solarbio, Beijing, China, Cat# R0020) that contained protease and phosphatase inhibitors (Roche, Basel, Switzerland, Cat# 04693159001). Protein levels were quantified using the BCA assay (Cat# 23225; Pierce, Waltham, MA, USA). Electrophoretic conditions of 80 V for 30 min and 120 V for 45 min were used to separate samples with 30 μg of protein per lane. The samples were denatured in 4× Laemmli loading buffer (Bio-Rad, Hercules, CA, USA, Cat# 1610747). For complete protein transfer, intact gels containing pre-stained molecular weight markers (10–250 kDa) were electrophoretically transferred to PVDF membranes (0.45 μm; Millipore, Burlington, MA, USA, Cat# IPVH00010) using a wet transfer system at constant 200 mA current. Transfer durations were optimized according to protein molecular weight: high-molecular-weight proteins (e.g., ZEB-1 at 210 kDa) required extended transfer times of 120 min to ensure efficient membrane immobilization, while standard-duration transfers of 45 min were employed for mid-range molecular weights, including β-actin (42 kDa) and ARPC1B (41 kDa). The blocking process was carried out for 1 h using 5% skim milk in Tris-buffered saline with Tween-20 (TBST, pH 7.6). Following an overnight primary antibody incubation period at 4°C, the membranes were subjected to three five-minute washes with TBST. After that, primary antibodies (1:10,000; goat anti-rabbit/mouse; Abcam, Cambridge, UK, Cat# ab6721/ab6789) that were conjugated with HRP were left to incubate at 4°C for 1.5 h. In order to identify protein signals, researchers utilized enhanced chemiluminescence (ECL; Bio-Rad, Hercules, CA, USA, Cat# 1705060). Each experiment was repeated three times independently. 2.11 Antibodies and Reagents Antibodies utilized in this research included: β-actin (Cat# 66009-1-Ig; WB 1:10,000), ARPC1B (Cat# 13835-1-AP; WB 1:5,000, IHC 1:1000), c-Myc (Cat# 10828-1-AP; WB 1:5,000, IHC 1:2000), Cyclin D1 (Cat# 60186-1-Ig; WB 1:10,000, IHC 1:3000), GSK3β (Cat# 22104-1-AP; WB 1:5,000, IHC 1:400), Phospho-GSK3β (Ser9) (Cat# 14850-1-AP; WB 1:5,000, IHC 1:600), β-catenin (Cat# 51067-2-AP; WB 1:10,000, IHC 1:200), Vimentin (Cat# 60330-1-Ig; WB 1:10,000, IHC 1:3000), N-cadherin (Cat# 22018-1-AP; WB 1:6000, IHC 1:1000), E-cadherin (Cat# 20874-1-AP; WB 1:6000, IHC 1:100), ZEB1 (Cat# 21544-1-AP; WB 1:2000, IHC 1:100), and Ki-67 (Cat# 27309-1-AP; IHC 1:2000) can from Proteintech. The Wnt/β-catenin agonist 3 (Cat# CM20349, 30 µmol/mL) was obtained from Proteintech (Wuhan, China, Cat# CM20349). 2.12 Tumor Xenograft Model Hunan Slaike Jingda Experimental Animal Co., Ltd. of Changsha, China, was the source of the 24 male BALB/c-nu mice. License No. SCXK 2021-0002 certifies that these 4-week-old, 18–22 g specimens are of SPF grade. The mice were acclimated to their new environment for one week before being employed in the research. No infections were present in this environment. Stratified randomization was used to divide the mice into four groups, with six mice in each, after they had acclimated. To inject subcutaneously into the axillary region, cells (5 × 10 6 2 3 34 2.13 Statistical Analysis Statistical analyses were performed using SPSS software (IBM, Armonk, NY, USA, version 27.0). Comparisons of categorical variables were conducted utilizing Fisher’s exact tests or chi-square tests, especially in instances where the expected frequency in any cell fell below five. Based on the distribution characteristics of continuous variables, we employed either Mann–Whitney U tests, Student’s t p 3 Results 3.1 ARPC1B Overexpression in Tumor Tissues Correlates with Poor Prognosis of ccRCC Transcriptomic analysis identified 1,488 differentially expressed genes (DEGs) common to both GEO datasets GSE53757 GSE68417 2 ARPC1B Fig. A1A C β Fig. A1D F Fig. 1A p Fig. 1B Fig. 1C Fig. 1D p Fig. A2 p Fig. 1E p p p Table 1 p Fig. 1F p Table 2 p Table 2 Figure 1 Enhanced ARPC1B expression in ccRCC tissues predicts poor patient prognosis. ( A Y 2 B Y 2 C D E F p p p Table 1 Association between ARPC1B protein expression and clinicopathological characteristics in 150 ccRCC patients Variable Patients No. of patients (%) OR 95% CI  p ARPC1B ARPC1B High (57) Age, years (median 57) 1.488 0.767–2.889 0.239 <57 75 50 25 ≥57 75 43 32 Sex 0.620 0.291–1.322 0.214 Male 107 63 44 Female 43 30 13 pTNM Stage 8.531 1.772–41.071 0.003 #** T1–T2 139 91 48 T3–T4 11 2 9 Lymph-node status 0.053 # N0 147 93 54 N1 3 0 3 Fuhrman Grade 6.656 3.110–14.246 0.001*** G1–G2 103 78 25 G3–G4 47 15 32 Note: # Using Fisher’s exact test; ** p p Table 2 Cox regression analysis for OS Variable Univariate analysis Multivariate analysis HR 95% CI  p HR 95% CI  p pTNM stage T3–4 vs. T1–2 6.644 2.813–15.695 <0.001*** 2.042 0.774–5.388 0.149 Lymph-node status N1 vs. N0 23.486 6.286–87.755 <0.001*** 4.900 1.181–20.324 0.029* Fuhrman grade G3–4 vs. G1–2 4.911 2.264–10.650 <0.001*** 1.486 0.643–3.434 0.354 ARPC1B expression High vs. low 59.588 8.086–439.121 <0.001*** 43.992 5.785–334.511 <0.001*** Note. * p p 3.2 Establishment of Stable Cell Lines and RT-qPCR Validation There was a notable increase in the expression of the ARPC1B protein in all ccRCC-derived cell lines (786-O, A-498, and Caki-1) and papillary renal carcinoma cell line Caki-2 ( p Fig. 2A p Fig. 2B Fig. 2C p Fig. A3A B Figure 2 Validation of ARPC1B protein and mRNA levels in RCC cell lines. ( A B,C p p p p > # p ### p 3.3 ARPC1B Knockdown Inhibits ccRCC Cellular Functions In Vitro To elucidate the biological impact of reduced ARPC1B expression, various cellular functional assays were conducted, focusing on ccRCC cellular behaviors. Cell proliferation assays using the CCK-8 method revealed a significant suppression of growth rate in ARPC1B-silenced 786-O and Caki-1 cells ( p Fig. 3A B p Figs. 3C A4A p Figs. 3D A4B p Figs. 3E F A4C D Figure 3 Functional effects of ARPC1B silencing on ccRCC cells. ( A,B C D E,F p p p p > ## p ### p 3.4 ARPC1B Overexpression Promotes Proliferation, Colony Formation, Migration, and Invasion of ccRCC Cells In Vitro To further confirm ARPC1B’s oncogenic activity, functional assays were conducted on 786-O and Caki-1 cells stably overexpressing ARPC1B. CCK-8 proliferation assays showed significantly increased proliferation rates in ARPC1B-overexpressing cells compared to WT and empty vector control groups ( p Fig. 4A B p Figs. 4C A5A p Figs. 4D A5B p Figs. 4E F A5C D Figure 4 Effect of ARPC1B overexpression on ccRCC cell behavior. ( A,B C D E,F p p p > ## p ### p 3.5 ARPC1B Knockdown Inhibits Tumor Growth In Vivo To assess ARPC1B’s functional role in vivo p Fig. 5A B Fig. 5C p p Fig. 5D Fig. A6 Fig. A6 in vivo Figure 5 Influence of ARPC1B knockdown on ccRCC tumor growth in vivo A B C D p p 3.6 ARPC1B Promotes ccRCC Progression via EMT In Vitro and In Vivo EMT is essential for facilitating tumor cell invasion and metastasis [ 35 37 p Figs. 6A A7A p Figs. 6B A7B in vivo Fig. 6C Fig. A7C Figure 6 Relationship between ARPC1B expression and EMT markers in vitro in vivo A B C p p p p > # p ## p ### p 3.7 ARPC1B Promotes ccRCC Progression via Wnt/β -Catenin Prior research has demonstrated that ARPC1B facilitates ovarian cancer progression via activation of the Wnt/β-catenin cascade [ 30 p Figs. 7A A8A p Figs. 7B A8B p Figs. 7C A8C p Figs. 7D A8D Fig. 8A B Fig. 8C D in vitro p Fig. 8E Fig. A9 β Figure 7 Correlation between ARPC1B expression and Wnt/β-catenin signaling. ( A B C, D p p p p > # p ## p ### p p > Figure 8 Validation of ARPC1B involvement in Wnt/β-catenin pathway activation. ( A–D E p p p p > 4 Discussion ccRCC ranks among the most frequent malignancies of the urinary system. Despite recent progress in targeted treatment strategies, patients with advanced or metastatic ccRCC continue to exhibit poor clinical outcomes [ 38 39 29 30 40 ARPC1B p p p p Clinically, the association between ARPC1B p ARPC1B Through comprehensive functional analyses, this study established ARPC1B’s critical role in ccRCC progression. In vitro in vitro 30 40 At a mechanistic level, our data underscore that ARPC1B promotes ccRCC advancement through stimulation of EMT, an essential mechanism underlying tumor invasion and metastatic capability [ 35 37 41 43 Nevertheless, the present study has several limitations. In particular, the relatively small clinical cohort and lack of genetically engineered animal models may restrict the generalizability of these conclusions. Furthermore, although we have demonstrated the activation of EMT and the Wnt/β-catenin pathway by ARPC1B, the precise molecular interactions through which ARPC1B modulates key proteins such as β-catenin and N-cadherin still require further detailed investigation. Subsequent research will employ techniques such as proximity-dependent biotin identification (BioID) and co-immunoprecipitation (co-IP) to systematically identify ARPC1B-binding proteins and further elucidate their precise functional roles in these signaling networks. Collectively, our findings provide compelling evidence highlighting ARPC1B as a vital regulator of ccRCC tumor progression. Elevated ARPC1B expression correlates significantly with aggressive tumor phenotypes, poor clinical outcomes, and activation of key oncogenic signaling pathways, specifically EMT and Wnt/β-catenin. Therapeutic targeting of ARPC1B 40 44 25 ARPC1A 45 ARPC1B’ The authors would like to express their sincere gratitude to the Cell Biology Laboratory and the Animal Experimentation Center at Zhanjiang Central People’s Hospital for their invaluable assistance and outstanding technical support. Funding Statement The authors received no specific funding for this study. Author Contributions The authors confirm contribution to the paper as follows: Conceptualization, Jiayin Peng, Yijun Xue; methodology, Jiayin Peng, Yijun Xue; software, Yijun Xue; validation, Jiayin Peng, Yijun Xue; formal analysis, Jiayin Peng; investigation, Zhiren Cai, Zhaoguan Li; resources, Jiayin Peng; data curation, Kangyan Han, Xiaoqi Lin; writing—original draft preparation, Jiayin Peng, Yijun Xue; writing—review and editing, Yutong Li; visualization, Jiayin Peng; supervision, Yumin Zhuo; project administration, Yutong Li, Yumin Zhuo. All authors reviewed the results and approved the final version of the manuscript. Availability of Data and Materials The data that support the findings of this study are available from the Corresponding Authors, upon reasonable request. Ethics Approval The study adhered to the Helsinki Declaration of 1975, as revised in 2000, and received approval from the Ethics Committee of SOBC (Approval No. SHYJS-C1510001), Informed consent was obtained from all participants; furthermore, all procedures related to animal research were approved by the Animal Research Committee of Zhanjiang Central People’s Hospital (Approval No. DW-2024016-01, Zhanjiang, China). Conflicts of Interest The authors declare no conflicts of interest to report regarding the present study. Abbreviations ARPC1B Actin-Related Protein 2/3 Complex Subunit 1B ANOVA Analysis of Variance ccRCC Clear Cell Renal Cell Carcinoma cDNA Complementary DNA CT Threshold Cycle CI Confidence Interval EMT Epithelial-Mesenchymal Transition ECL Enhanced Chemiluminescence GEPIA Gene Expression Profiling Interactive Analysis HRP Horseradish Peroxidase IHC Immunohistochemistry lncRNAs Long non-coding RNAs NC Negative Control OS Overall Survival ORF Open Reading Frame OD Optical Density PBS Phosphate-buffered Saline  p-GSK3β  Phosphorylated GSK3β RIPA Radioimmunoprecipitation Assay shRNA Short Hairpin RNA TMA Tissue Microarray TBST Tris-buffered Saline with Tween ® RT-qPCR Tissue Microarray Reverse Transcription Quantitative Polymerase Chain Reaction WB Western blotting WT Wild-Type Appendix A Figure A1 Cross-Cohort Transcriptomic Analysis of ccRCC. ( A 2 GSE53757 GSE68417 B,C GSE53757 GSE68417 D GSE53757 GSE68417 E,F GSE53757 GSE68417 Figure A2 Levels of ARPC1B-positive (IHC score ≥ 6) in ccRCC tissues (n = 150) were much greater than in adjacent non-tumor tissues (n = 30) (38% vs. 13%, p Figure A3 Validation of ARPC1B protein and mRNA levels in ccRCC cell lines. ( A,B p p p > ## p ### p Figure A4 Functional effects of ARPC1B A B C,D p p p > ## p ### p Figure A5 Effect of ARPC1B A B C,D p p p > ## p ### p Figure A6 Effects of ARPC1B in vivo A B C p p Figure A7 Relationship between ARPC1B in vitro in vivo A B ARPC1B C p p p p > # p ## p ### p Figure A8 Correlation between ARPC1B A B C,D p p p p > ## p ### p p > Figure A9 IHC examination of Wnt/β-catenin signaling marker expression in xenograft tumors from ARPC1B-knockdown groups. ( A B p p p p > References 1. Bukavina L Bensalah K Bray F Carlo M Challacombe B Karam JA et al. Epidemiology of renal cell carcinoma: 2022 update Eur Urol 2022 Nov 82 5 529 42 10.1016/j.eururo.2022.08.019 36100483 2. Mohanty SK Lobo A Cheng L The 2022 revision of the World Health Organization classification of tumors of the urinary system and male genital organs: advances and challenges Hum Pathol 2023 Jun 136 123 43 10.1016/j.humpath.2022.08.006 36084769 3. Garje R Elhag D Yasin HA Acharya L Vaena D Dahmoush L Comprehensive review of chromophobe renal cell carcinoma Crit Rev Oncol Hematol 2021 Apr 160 103287 10.1016/j.critrevonc.2021.103287 33753250 4. Young M Jackson-Spence F Beltran L Day E Suarez C Bex A et al Renal cell carcinoma Lancet 2024 Aug 3 404 10451 476 91 10.1016/S0140-6736(24)00917-6 39033764 5. Rizzo M Caliò A Brunelli M Pezzicoli G Ganini C Martignoni G et al. Clinico-pathological implications of the 2022 WHO Renal Cell Carcinoma classification Cancer Treat Rev 2023 May 116 102558 10.1016/j.ctrv.2023.102558 37060647 6. Moch H Amin MB Berney DM Compérat EM Gill AJ Hartmann A et al. The 2022 World Health organization classification of tumours of the urinary system and male genital organs—Part A: renal, penile, and testicular tumours Eur Urol 2022 Nov 82 5 458 68 10.1016/j.eururo.2022.06.016 35853783 7. Ljungberg B Albiges L Abu-Ghanem Y Bedke J Capitanio U Dabestani S et al European association of urology guidelines on renal cell carcinoma: the 2022 update Eur Urol 2022 Oct 82 4 399 410 10.1016/j.eururo.2022.03.006 35346519 8. Xu L Hu H Zheng LS Wang MY Mei Y Peng LX et al ETV4 is a theranostic target in clear cell renal cell carcinoma that promotes metastasis by activating the pro-metastatic gene FOSL1 in a PI3K-AKT dependent manner Cancer Lett 2020 Jul 10 482 74 89 10.1016/j.canlet.2020.04.002 32305558 9. Mohamed AH Abdullahi IM Eraslan A Mohamud HA Gur M Epidemiological and histopathological characteristics of renal cell carcinoma in somalia Cancer Manage Res 2022 May 30 14 1837 44 10.2147/CMAR.S361765 35668743 PMC9166404 10. Rose TL Kim WY Renal cell carcinoma: a review JAMA 2024 Sep 24 332 12 1001 10 10.1001/jama.2024.12848 39196544 PMC11790279 11. Bafadni MM Osman YM Ahmed MEIM Taha MM Idris DA Kheiralla KEK et al Clinical pathological characteristics and treatment outcomes of renal cell carcinoma (RCC): a retrospective study from Sudan Ecancermedicalscience 2023 Mar 23 17 1524 10.3332/ecancer.2023.1524 37113721 PMC10129402 12. Cheaib JG Patel HD Johnson MH Gorin MA Haut ER Canner JK et al Stage-specific conditional survival in renal cell carcinoma after nephrectomy Urol Oncol 2020 Jan 38 1 6.e1 7 10.1016/j.urolonc.2019.08.011 31522864 13. Motzer RJ Jonasch E Agarwal N Alva A Baine M Beckermann K et al. Kidney Cancer, Version 3.2022, NCCN clinical practice guidelines in oncology J Natl Compr Canc Netw 2022 Jan 20 1 71 90 10.6004/jnccn.2022.0001 34991070 PMC10191161 14. Carbonara U Simone G Capitanio U Minervini A Fiori C Larcher A et al Robot-assisted partial nephrectomy: 7-year outcomes Minerva Urol Nephrol 2021 Aug 73 4 540 3 10.23736/S2724-6051.20.04151-X 33200907 15. Joosten SC Deckers IA Aarts MJ Hoeben A Van Roermund JG Smits KM et al Prognostic DNA methylation markers for renal cell carcinoma: a systematic review Epigenomics 2017 Sep 9 9 1243 57 10.2217/epi-2017-0040 28803494 16. de Martino M Klatte T Haitel A Marberger M Serum cell-free DNA in renal cell carcinoma: a diagnostic and prognostic marker Cancer 2012 Jan 1 118 1 82 90 10.1002/cncr.26254 21713763 17. Kubiliūtė R Žukauskaitė K Žalimas A Ulys A Sabaliauskaitė R Bakavičius A et al Clinical significance of novel DNA methylation biomarkers for renal clear cell carcinoma J Cancer Res Clin Oncol 2022 Feb 148 2 361 75 10.1007/s00432-021-03837-7 34689221 PMC11800858 18. Heinemann FG Tolkach Y Deng M Schmidt D Perner S Kristiansen G et al Serum miR-122-5p and miR-206 expression: non-invasive prognostic biomarkers for renal cell carcinoma Clin Epigenetics 2018 Jan 23 10 11 10.1186/s13148-018-0444-9 29410711 PMC5781339 19. Zheng Z Zeng X Zhu Y Leng M Zhang Z Wang Q et al CircPPAP2B controls metastasis of clear cell renal cell carcinoma via HNRNPC-dependent alternative splicing and targeting the miR-182-5p/CYP1B1 axis Mol Cancer 2024 Jan 6 23 1 4 10.1186/s12943-023-01912-w 38184608 PMC10770969 20. Outeiro-Pinho G Barros-Silva D Moreira-Silva F Lobo J Carneiro I Morais A et al Epigenetically-regulated miR-30a/c-5p directly target TWF1 and hamper ccRCC cell aggressiveness Transl Res 2022 Nov 249 110 27 10.1016/j.trsl.2022.06.009 35697274 21. Rysz J Konecki T Franczyk B Ławiński J Gluba-Brzózka A The role of long noncoding RNA (lncRNAs) biomarkers in renal cell carcinoma Int J Mol Sci 2022 Dec 30 24 1 643 10.3390/ijms24010643 36614082 PMC9820502 22. Chen Z Zhang M Lu Y Ding T Liu Z Liu Y et al. Overexpressed lncRNA FTX promotes the cell viability, proliferation, migration and invasion of renal cell carcinoma via FTX/miR-4429/UBE2C axis Oncol Rep 2022 Sep 48 3 163 10.3892/or.2022.8378 35866591 PMC9350997 23. Liu H Ye T Yang X Lv P Wu X Zhou H et al A panel of four-lncRNA signature as a potential biomarker for predicting survival in clear cell renal cell carcinoma J Cancer 2020 Apr 27 11 14 4274 83 10.7150/jca.40421 32368310 PMC7196268 24. Gournier H Goley ED Niederstrasser H Trinh T Welch MD Reconstitution of human Arp2/3 complex reveals critical roles of individual subunits in complex structure and activity Mol Cell 2001 Nov 8 5 1041 52 10.1016/s1097-2765(01)00393-8 11741539 25. Randzavola LO Strege K Juzans M Asano Y Stinchcombe JC Gawden-Bone CM et al Loss of ARPC1B impairs cytotoxic T lymphocyte maintenance and cytolytic activity J Clin Invest 2019 129 12 5600 14 10.1172/JCI129388 31710310 PMC6877333 26. Welch MD DePace AH Verma S Iwamatsu A Mitchison TJ The human Arp2/3 complex is composed of evolutionarily conserved subunits and is localized to cellular regions of dynamic actin filament assembly J Cell Biol 1997 Jul 28 138 2 375 84 10.1083/jcb.138.2.375 9230079 PMC2138188 27. Kempers L Sprenkeler EGG Van Steen ACI Van Buul JD Kuijpers TW Defective neutrophil transendothelial migration and lateral motility in ARPC1B deficiency under flow conditions Front Immunol 2021 May 31 12 678030 10.3389/fimmu.2021.678030 34135903 PMC8202084 28. Kumar A Dumasia K Deshpande S Gaonkar R Balasinor NH Actin related protein complex subunit 1b controls sperm release, barrier integrity and cell division during adult rat spermatogenesis Biochim Biophys Acta 2016 Aug 1863 8 1996 2005 10.1016/j.bbamcr.2016.04.022 27113856 29. Gamallat Y Zaaluk H Kish EK Abdelsalam R Liosis K Ghosh S et al ARPC1B is associated with lethal prostate cancer and its inhibition decreases cell invasion and migration in vitro Int J Mol Sci 2022 Jan 27 23 3 1476 10.3390/ijms23031476 35163398 PMC8836051 30. Huang J Zhou H Tan C Mo S Liu T Kuang Y The overexpression of actin related protein 2/3 complex subunit 1B(ARPC1B) promotes the ovarian cancer progression via activation of the Wnt/β-catenin signaling pathway Front Immunol 2023 May 25 14 1182677 10.3389/fimmu.2023.1182677 37304283 PMC10247967 31. Ke M Zhu H Lin Y Zhang Y Tang T Xie Y et al Actin-related protein 2/3 complex subunit 1B promotes ovarian cancer progression by regulating the AKT/PI3K/mTOR signaling pathway J Transl Int Med 2024 Oct 1 12 4 406 23 10.2478/jtim-2024-0025 39360160 PMC11444474 32. Lin H Wang K Xiong Y Zhou L Yang Y Chen S et al Identification of tumor antigens and immune subtypes of glioblastoma for mRNA vaccine development Front Immunol 2022 Feb 2 13 773264 10.3389/fimmu.2022.773264 35185876 PMC8847306 33. Liao C Chen W Xu G Wang J Dong W High expression of ARPC1B correlates with immune infiltration and poor outcomes in glioblastoma Biochem Biophys Rep 2023 Dec 19 37 101619 10.1016/j.bbrep.2023.101619 38188361 PMC10770598 34. Paul ED Huraiová B Valková N Matyasovska N Gábrišová D Gubová S et al The spatially informed mFISHseq assay resolves biomarker discordance and predicts treatment response in breast cancer Nat Commun 2025 Jan 2 16 1 226 10.1038/s41467-024-55583-2 39747865 PMC11696812 35. Polyak K Weinberg RA Transitions between epithelial and mesenchymal states: acquisition of malignant and stem cell traits Nat Rev Cancer 2009 Apr 9 4 265 73 10.1038/nrc2620 19262571 36. Wu Y Terekhanova NV Caravan W Naser Al Deen N Lal P Chen S et al. Epigenetic and transcriptomic characterization reveals progression markers and essential pathways in clear cell renal cell carcinoma Nat Commun 2023 Mar 27 14 1 1681 10.1038/s41467-023-37211-7 Erratum in: Nat Commun. 2023 May 17;14(1):2817. doi:10.1038/s41467-023-38561-y 36973268 PMC10042888 37. Meng L Gao J Mo W Wang B Shen H Cao W et al. MIOX inhibits autophagy to regulate the ROS -driven inhibition of STAT3/c-Myc-mediated epithelial-mesenchymal transition in clear cell renal cell carcinoma Redox Biol 2023 Dec 68 102956 10.1016/j.redox.2023.102956 37977044 PMC10692917 38. Reustle A Di Marco M Meyerhoff C Nelde A Walz JS Winter S et al Integrative -omics and HLA-ligandomics analysis to identify novel drug targets for ccRCC immunotherapy Genome Med 2020 Mar 30 12 1 32 10.1186/s13073-020-00731-8 32228647 PMC7106651 39. Rathmell WK Rumble RB Van Veldhuizen PJ Al-Ahmadie H Emamekhoo H Hauke RJ et al. Management of metastatic clear cell renal cell carcinoma: ASCO Guideline J Clin Oncol 2022 Sep 1 40 25 2957 95 10.1200/JCO.22.00868 35728020 40. Gao Z Xu J Fan Y Zhang Z Wang H Qian M et al ARPC1B promotes mesenchymal phenotype maintenance and radiotherapy resistance by blocking TRIM21-mediated degradation of IFI16 and HuR in glioma stem cells J Exp Clin Cancer Res 2022 Nov 16 41 1 323 10.1186/s13046-022-02526-8 36380368 PMC9667586 41. Wang W Li M Wang Y Li Q Deng G Wan J et al GSK-3β inhibitor TWS119 attenuates rtPA-induced hemorrhagic transformation and activates the Wnt/β-catenin signaling pathway after acute ischemic stroke in rats Mol Neurobiol 2016 Dec 53 10 7028 36 10.1007/s12035-015-9607-2 26671619 PMC4909586 42. Wang X Jung YS Jun S Lee S Wang W Schneider A et al PAF-Wnt signaling-induced cell plasticity is required for maintenance of breast cancer cell stemness Nat Commun 2016 Feb 4 7 10633 10.1038/ncomms10633 26843124 PMC4743006 43. Wang H Liu Z Du Y Cheng X Gao S Liang W et al. High expression of ARPC1B promotes the proliferation and apoptosis of clear cell renal cell carcinoma cells, leading to a poor prognosis Mol Cell Probes 2025 Feb 79 102011 10.1016/j.mcp.2025.102011 39818256 44. Liu T Sun T Chen X Wu J Sun X Liu X et al Targeting ARPC1B overcomes immune checkpoint inhibitor resistance in glioblastoma by reversing protumorigenic macrophage polarization Cancer Res 2025 85 7 1236 52 10.1158/0008-5472.can-24-2286 39841088 45. Cao L Huang S Basant A Mladenov M Way M CK-666 and CK-869 differentially inhibit Arp2/3 iso-complexes EMBO Rep 2024 25 8 3221 39 10.1038/s44319-024-00201-x 39009834 PMC11316031 ",
  "metadata": {
    "Title of this paper": "CK-666 and CK-869 differentially inhibit Arp2/3 iso-complexes",
    "Journal it was published in:": "Oncology Research",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12494113/"
  }
}