{
  "title": "Paper_692",
  "abstract": "pmc Eur J Investig Health Psychol Educ Eur J Investig Health Psychol Educ 4080 ejihpe ejihpe European Journal of Investigation in Health, Psychology and Education 2174-8144 2254-9625 Multidisciplinary Digital Publishing Institute  (MDPI) PMC12468811 PMC12468811.1 12468811 12468811 41002770 10.3390/ejihpe15090189 ejihpe-15-00189 1 Article Mind the Gap: Sex-Specific Drivers of Human Papillomavirus Vaccination Uptake in Serbian University Students Jeremić Stojković Vida 1 https://orcid.org/0000-0002-4793-1756 Mandić-Rajčević Stefan 2 https://orcid.org/0000-0002-3323-3711 Vuković Dejana 2 Paunić Mila 3 Stojanović Ristić Snežana 3 Obradović Marija 3 Cvjetković Smiljana 1 * Morales Rodríguez Francisco Manuel Academic Editor 1 vida.jeremic-stojkovic@med.bg.ac.rs 2 stefan.mandic-rajcevic@med.bg.ac.rs dejana.vukovic@med.bg.ac.rs 3 mila.paunic@zzzzsbg.rs opsta.medicina@zzzzsbg.rs ginekologija@zzzzsbg.rs * smiljana.cvjetkovic@med.bg.ac.rs 19 9 2025 9 2025 15 9 497632 189 03 8 2025 16 9 2025 17 9 2025 19 09 2025 27 09 2025 27 09 2025 © 2025 by the authors. 2025 https://creativecommons.org/licenses/by/4.0/ Published by MDPI on behalf of the University Association of Education and Psychology. Licensee MDPI, Basel, Switzerland. This article is an open access article distributed under the terms and conditions of the Creative Commons Attribution (CC BY) license ( https://creativecommons.org/licenses/by/4.0/ Despite proven effectiveness, human papillomavirus (HPV) vaccination uptake remains suboptimal in many countries. The aim of this study was to explore differences in beliefs about HPV and HPV vaccination, the information environment and social influences shaping vaccination decisions between male and female undergraduate university students in Belgrade, and to identify sex-specific factors associated with HPV vaccine uptake. A cross-sectional study was conducted between April and December 2024. An online questionnaire was completed by 1529 female and 423 male students who were either receiving their second or third dose of the nonavalent HPV vaccine, or accessing general healthcare services at the general medicine department of the Institute for Students’ Health of Belgrade. Hierarchical logistic regression was used to identify predictors of HPV vaccine uptake in male and female students. Among female students, HPV vaccine uptake was associated with stronger beliefs in vaccine efficacy (OR = 2.01, 95% CI: 1.50–2.69) and safety (OR = 2.29, 95% CI: 1.69–3.10), lower perceived lack of information (OR = 0.71, 95% CI: 0.60–0.84), and social influence of family members, (OR = 1.45, 95% CI: 1.04–2.03), colleagues (OR = 1.62, 95% CI: 1.01–2.59) and media (OR = 1.92, CI: 1.10–3.37). Among male students, vaccine uptake was associated with stronger beliefs in vaccine efficacy (OR = 2.14, 95% CI: 1.37–3.34), lower perceived lack of information (OR = 0.71, 95% CI: 0.52–0.98), more frequent reliance on scientific literature (OR = 1.50, 95% CI: 1.15–1.97) and family (OR = 1.37, 95% CI: 1.07–1.75) and less frequent use of YouTube (OR = 0.70, CI: 0.53–0.92) as sources of information, and social influence of family (OR = 1.83, 95% CI: 1.03–3.24). This study highlights significant sex differences in factors influencing HPV vaccine uptake, indicating that tailored approach is required in designing vaccine promotion strategies. Strengthening communication on efficacy and safety, improving access to reliable information, and addressing sex-specific concerns such as safety and financial barriers in females and misinformation in males could improve uptake and equitable HPV protection. papillomavirus vaccines vaccination acceptance cross-sectional studies university students information seeking behavior This research received no external funding. pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement yes pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes 1. Introduction Cervical cancer ranks as the fifth leading cause of cancer among women in Serbia, and the second most common cancer in women aged 15 to 44 years, with the incidence being significantly higher compared to Southern Europe (18.7 vs. 7.72 per 100,000, respectively) ( Bruni et al., 2023b Djordjevic et al., 2024 At this moment, human papillomavirus (HPV) vaccine is the only recommended effective way of preventing cancers caused by persistent HPV infection. HPV vaccine is routinely recommended to girls as early as 9 years, with the recommendation being amended to include young adults until the age of 26 ( Meites, 2019 Phillips et al., 2018 Chesson et al., 2019 Altobelli et al., 2019 Cangelosi et al., 2025 Cangelosi et al., 2025 Urrutia et al., 2023 Cangelosi et al., 2025 Research from multiple countries in previous decades has demonstrated that expanding HPV vaccination programs to include males is a highly cost-effective preventive strategy, decreasing incidence of anogenital cancers, certain head and neck cancers, precancerous lesions, and genital warts in both men and women ( Elbasha & Dasbach, 2010 Burger et al., 2014 Cheng et al., 2020 Naidoo et al., 2024 Bruni et al., 2023a In Serbia, recommended immunization against diseases caused by human papillomaviruses for both girls and boys aged 9–19 years, funded by the Health Insurance Fund of Serbia, began in June 2022, with the use of the freely available nonavalent HPV vaccine (Gardasil 9). Although HPV vaccination is most effective when administered at younger ages, prior to sexual activity, vaccination in young adulthood still provides partial protective benefits ( Ellingson et al., 2023 University students present a distinctive population of young adults who autonomously make health-related decisions, including vaccination decision. Previous studies conducted among young adults suggest that confidence in HPV vaccine efficacy and safety, as well as perception of risks and severity associated with HPV-caused diseases play significant role in their decision-making ( D’Errico et al., 2020 MacDonald, 2015 Smith et al., 2017 Kaufman et al., 2021 According to the Behavioral Drivers Model, which presents a transtheoretical, comprehensive model of determinants of behavior, there are three levels of drivers, each contributing to the outcome behavior: psychological (individual cognitive and emotional factors), sociological (determinants related to interactions within families, communities, groups and society at large) and environmental (institutions, policies, systems and services, infrastructures, information, etc.) ( Petit, 2019 Initially, HPV vaccine testing and marketing to prevent cervical cancer have been specifically focused on females, which led to gender biases in the perception of the need for vaccination ( Daley et al., 2016 Dodd et al., 2014 McBride & Singh, 2018 Theotonio dos Santos et al., 2025 Brunelli et al., 2021 Chen et al., 2021 2. Materials and Methods 2.1. Study Design and Setting This was a cross-sectional study, conducted in the period June-December 2024 on a convenience sample of undergraduate university students at The Institute for Students’ Health of Belgrade (Students’ Policlinic). The primary role of the Students’ Policlinic is to provide programs of preventive care and treatment to student population, customized to focus on most prevalent health problems of students, such as problems related to reproductive health, eating disorders, mental health, skin and teeth. Data were collected at the general medicine department, where students routinely receive general healthcare services, and where vaccination with the second and third dose of the nonavalent HPV vaccine was organized during the study period. 2.2. Participants Eligible participants were undergraduate university students (aged 18–27 years) attending the Students’ Policlinic for either general healthcare services or for HPV vaccination appointment. Students were recruited by members of the research team while waiting for their appointment. Research team members were organized to cover the morning shifts and most of the afternoon shifts at the Students’ Policlinic (from 8.00 a.m. to 4:00 p.m.) every working day during the study period, approaching every student attending clinic during these hours. Approached students were verbally informed and provided information sheets about the study aims, methodology and participants’ right. If they accepted to participate, they were given a QR code, which referred to the Research Electronic Data Capture (REDCap) survey hosted on secure servers of the Faculty of Medicine, University of Belgrade. Data were collected by a self-administered questionnaire. 2.3. Study Instrument and Variables The questionnaire was developed based on the comprehensive literature review on drivers of vaccination behavior ( Larson et al., 2014 Kaufman et al., 2021 Díaz Crescitelli et al., 2020 Karafillakis et al., 2019 N HPV vaccination status Sociodemographic characteristics HPV and HPV vaccine-related beliefs Perceived vaccine efficacy: three items, α = 0.85; Perceived vaccine safety: five items, α = 0.84 (items 2 and 5 were reversely coded); Perceived danger of HPV vaccine-preventable diseases: four items, α = 0.79 (items 1, 2, 3 and 4 were reversely coded). Information environment Perceived lack of information was evaluated with four questions on a five-point Likert scale ranging from 1 “strongly disagree” to 5 “strongly agree” (α = 0.89). Item 4 was reversely coded. Higher score indicated stronger feeling of the lack of information. Use of information sources was evaluated by twelve items inquiring about the frequency of use of selected sources of information regarding HPV and HPV vaccines on five-point Likert scale ranging from 1 “Never” to 5 “Regularly”. Social influence 2.4. Bias Several steps were taken to reduce potential sources of bias in this study. Selection bias may have occurred because not all eligible students could be approached. Information bias was addressed by using pilot-tested instruments. Furthermore, assuring anonymity and confidentiality were measures taken to reduce social desirability bias. Recall bias regarding vaccination status was likely minimal, as many participants were attending the clinic to receive the vaccine. 2.5. Statistical Analysis Descriptive statistics were used to characterize the sample and study variables. Categorical variables were presented as frequencies and percentages, while continuous variables were presented as means ± standard deviation. The differences between male and female participants with regard to sociodemographic characteristics, vaccine beliefs, perceived lack of information, use of information sources and social influence were analyzed using Chi-square, Fisher’s exact test, the t-test and the Mann–Whitney U test. Factors associated with the HPV vaccination status as the main outcome variable were analyzed separately for males and females using hierarchical multivariate logistic regression. Variables were first screened in univariate analyses, and those showing associations with vaccination status at p Hierarchical approach involves adding block of variables sequentially into the regression model, to assess their incremental predictive power. Blocks of predictors were added based on theoretical and empirical considerations. Sociodemographic characteristics were entered first as basic background factors. Beliefs regarding HPV vaccination were added in the second block, reflecting individual cognitive and emotional drivers. Variables related to information environment were entered in the third block, to capture the influence of exposure to information. Finally, social influence variables were entered in the fourth block, to assess contextual and relational effects. To include categorical variables with multiple values in the regression models, dummy variables were created. Nagelkerke R Square was employed as a measure of the goodness of fit for hierarchical multivariate regression models. Multicollinearity was assessed by examining tolerance and variance inflation factor (VIF) values. All p 2.6. Ethical Consideration This study was approved by the Ethics Committee of the Faculty of Medicine (Decision No. 25/VI-6) and the Ethics Committee of the Institute for Students’ Health of Belgrade (Decision No. 1321/2). This study was voluntary and anonymous. No personal identifying data were collected and no incentives provided. Participants were informed about this study verbally and through information sheets, and they provided their consent by ticking the specified box at the beginning of the electronic survey. The consent was a condition to continue with filling the electronic data form. This study was reported in accordance with the Strengthening the Reporting of Observational Studies in Epidemiology (STROBE) Statement for cross-sectional studies ( Von Elm et al., 2007 Supplementary Material 3. Results The total of 1952 students completed the questionnaire. Sociodemographic characteristics of the sample are presented in Table 1 With respect to vaccination status, just over half of the sample had received the HPV vaccine, with uptake notably higher among women than men ( p Participants in our sample reported very positive beliefs about HPV vaccine efficacy ( Table 2 The majority of participating students considered the HPV vaccine important for their health, a view more strongly endorsed by women than men, and by vaccinated students across both sexes. Also, vast majority agreed that HPV vaccine can prevent HPV infection and protects from oncogenic strains of HPV virus, with female students again showing greater endorsement of these beliefs compared to their male peers. Vaccinated students in both male and female subgroups were more likely to share these beliefs than their unvaccinated counterparts. Participating students’ beliefs regarding HPV vaccine safety were generally positive across the sample ( Table 3 Beliefs regarding the danger of HPV vaccine preventable diseases differed markedly between male and female respondents, and between vaccinated and non-vaccinated of both sexes ( Table 4 Surveyed students most frequently relied on internet portals, social networks, friends, chosen physician and family as sources of vaccine-related information ( Table 5 Perceived lack of information about HPV vaccination was generally low among participants, with no significant differences in average scores between male and female respondents. However, unvaccinated students of both sexes reported higher scores compared to their vaccinated peers ( Table 6 Most of the surveyed students identified family members, healthcare workers and friends as having the strongest social influence on their intention to get vaccinated against HPV ( Table 7 Results of the hierarchical logistic regression analysis are presented in Table 8 In Model 1, which included sociodemographic characteristics, 8.8% of the variance in vaccination status was explained. Older age increased the likelihood of vaccination (OR = 1.11, 95% CI: 1.05–1.18, p p p p p p p p In Model 2 (adding HPV vaccination beliefs), explained variance increased to 35.6%. Religiosity remained significant but attenuated, with only students identifying as neither nonreligious nor religious more likely to be vaccinated (OR = 1.50, 95% CI: 1.03–2.19, p p p p In Model 3 (adding factors of information environment), explanatory power rose to 39.0%. Greater confidence in efficacy (OR = 1.97, 95% CI: 1.56–2.49, p p p p p In Model 4 (adding factors of social influence), explained variance increased to 40.3%. Vaccination was more likely among students with greater confidence in vaccine efficacy (OR = 1.98, 95% CI: 1.56–2.52, p p p p p p p p p Table 9 p p 2 Including beliefs about HPV vaccination in the second model, revealed that having more positive beliefs regarding HPV vaccine efficacy significantly increased the likelihood of vaccination (OR = 2.48, 95% CI: 1.60–3.83, p 2 When factors of information environment (perceived lack of information and frequency of use of selected information sources) were included in the third model, more frequent reliance on scientific literature (OR = 1.45, 95% CI: 1.12–1.89, p p p p 2 The final fourth model, which included socioeconomic characteristics, vaccine beliefs, factors of information environment and factors of social influence, explained 33.1% of variance in the vaccination. Key factors associated with higher vaccination likelihood in male students included stronger beliefs in vaccine efficacy (OR = 2.14, 95% CI: 1.37–3.34, p p p p p p Results of the hierarchical multiple logistic regression analysis of variables significantly associated with vaccination status in female respondents are presented in Table 10 p p p p p p p p In the second model, adding HPV vaccination beliefs in the second model substantially improved the predicting power (Nagelkerke R 2 p p p p p p The third model, which included factors of information environment, further improving predictive power of the model (Nagelkerke R 2 p p p p p p In the fourth model, which included factors of social influence, 44% of variance in vaccination status was explained. Female respondents with stronger confidence in HPV vaccine efficacy (OR = 2.01, 95% CI: 1.50–2.69, p p p p p p p 4. Discussion 4.1. Sex Differences in HPV Vaccine-Related Beliefs Overall, most participating students had highly positive beliefs about HPV vaccine efficacy and safety, but male students were less confident. This pattern is consistent with results of several international studies ( Aldawood et al., 2023 Dai et al., 2022 Goldfarb & Comber, 2022 Low perceived HPV-related risk and susceptibility in male students have been observed in numerous studies conducted in previous decades, ( Fontenot et al., 2014 Balcezak et al., 2022 Olusanya et al., 2023 Bruni et al., 2023a 4.2. Sex Differences in Factors of Information Environment Approximately one-half of respondents reported having all the information regarding HPV vaccination they need, with no difference in the overall perception of lack of information between male and female students. However, unvaccinated students of both sexes reported a greater perceived lack of information, underscoring the critical role of adequate and accessible information in facilitating HPV vaccine uptake. Responding students most frequently relied on informal sources of HPV vaccine-related information (internet portals, social networks, friends and family), but women reported higher engagement with nearly all sources, which can be explained by generally higher interest of females for the issue of HPV vaccination. It is generally posited that traditional media, such as television and radio, have a more substantial positive impact on vaccine uptake compared to newer forms of media, particularly social media ( Odone et al., 2015 Catalan-Matamoros & Peñafiel-Saiz, 2019 4.3. Sex Differences in Factors of Social Influence Family, healthcare workers, and friends were the strongest social influencers overall, with females more often guided by family and healthcare providers, while males were more receptive to the influence of government and health authorities. While family and healthcare setting are traditionally considered as being effective in driving healthcare choices, peer influence also entails great impact, which was established in various studies ( Khurana et al., 2015 Verelst et al., 2019 Cocchio et al., 2020 4.4. Predictors of HPV Vaccine Acceptance in Male and Female Students Confidence in vaccine efficacy, perceived lack of information, and family influence emerged as common predictors of HPV vaccine acceptance across sexes, while vaccine safety concerns, financial status and colleagues/media influence were more salient among females, and reliance on scientific literature, family and YouTube as information sources among males. These results are consistent with previous studies, which have identified perceived benefits, safety concerns, and inadequate information as central predictors of HPV vaccine uptake among young adults ( Maier et al., 2015 Liu et al., 2020 Chen et al., 2021 LaJoie et al., 2018 Quinn & Lewin, 2019 Stout et al., 2020 Goldfarb & Comber, 2022 4.5. Practical Implications Evidence suggests that community-based interventions could be a key strategy in overcoming barriers to HPV vaccination acceptance ( Brandt et al., 2019 WHO, 2017 The finding that beliefs regarding HPV vaccine safety and efficacy were among the most influencing factors of students’ vaccine uptake points to the need to create interventions based on risk communication—vaccine mechanisms and efficacy, vaccine safety surveillance mechanisms and both common and expected and rare but serious vaccine side effects ( Lewandowsky et al., 2023 To address the issue of lack of information, adequate access to trustworthy information should be enabled, using credible spokespeople (primarily chosen physicians, as they were among the most frequently relied sources and most influential social agents among both sexes), using both formal and informal communication channels. Scientific results must be communicated clearly, transparently and consistently to avoid misinterpretation. Since families strongly influence decisions about HPV vaccination in students and are often a key source of health information, it is essential that HPV vaccination promotion strategies actively involve and support family engagement. Considering the interpersonal trust and shared experiences that characterize family relationships ( Frew et al., 2014 Hesse & Rauscher, 2016 4.6. Limitations Our study had several notable limitations. First, cross-sectional design of this study does not allow for identifying causal relationship between factors and HPV vaccine uptake. Although our sample included students attending the biggest university in Serbia, which enrolls students from all over the country, we cannot generalize results to other Serbian universities or non-student young adult populations, although our results can give guidance on how health behavior of these populations could be studied and improved. Since we recruited participants among students attending the clinic either for vaccination appointment or for other services, we cannot exclude selection bias, since students who attend the clinic may be more health-conscious, or already more engaged with preventive services compared to those who do not seek care. Lastly, although the anonymity and confidentiality were guaranteed, we cannot rule out the possibility of social desirability bias. An important strength of this sample is the high reliability of students’ self-reported vaccination status, since participants were attending the Policlinic specifically to receive their second or third dose of the HPV vaccine. 5. Conclusions Our study revealed notable differences between male and female students in beliefs about HPV vaccination, the use of information sources related to the HPV vaccine, and the social influences shaping vaccination decisions. Male students exhibited lower confidence in HPV vaccine efficacy and safety, as well as lower perceived risk and susceptibility to HPV infection and HPV-related diseases, whereas female students reported more frequent use of nearly all selected sources of information, and acknowledged larger social influence of family members and healthcare workers. Furthermore, the factors associated with vaccine acceptance also varied between male and female students. While HPV vaccine uptake in both sexes was strongly predicted by confidence in vaccine efficacy, perceived lack of information and family influence, additional predictors differed—male students were more influenced by frequent reliance on scientific literature, family and YouTube channels as information sources, whereas female students were more influenced by confidence in vaccine safety, social influence of colleagues and media, and financial status. These results indicate the need to develop tailored communication strategies that respond to the distinct information needs and social contexts of male and female students, and promote the use of reliable information sources. Our results contribute to the growing evidence on sex-specific determinants of HPV vaccine uptake across different settings and cultural contexts. Recognizing and addressing these differences can improve HPV vaccination coverage, reduce the burden of HPV-related diseases and enhance the effectiveness of preventive programs targeted at young adults. Acknowledgments We would like to acknowledge the help and support provided by the nurses of the Institute for Students’ Health of Belgrade (Policlinic) and students volunteers who helped with the data collection. Disclaimer/Publisher’s Note: Supplementary Materials The following supporting information can be downloaded at: https://www.mdpi.com/article/10.3390/ejihpe15090189/s1 Author Contributions Conceptualization, S.M.-R., V.J.S., D.V. and S.C.; data curation, S.M.-R. and S.C.; formal analysis, S.M.-R., V.J.S. and S.C.; investigation, S.M.-R., V.J.S., M.P., S.S.R., M.O. and S.C.; methodology, S.M.-R., V.J.S. and S.C.; resources, M.P., S.S.R. and M.O.; supervision, D.V.; validation, M.P., S.S.R., M.O. and D.V.; writing—original draft, V.J.S., S.M.-R. and S.C.; writing—review and editing, S.M.-R., V.J.S., M.P., S.S.R., M.O., D.V. and S.C. All authors have read and agreed to the published version of the manuscript. Institutional Review Board Statement The study was conducted in accordance with the Declaration of Helsinki, and approved by the Ethics Committee of the Faculty of Medicine (Decision No. 25/VI-6; Approval date: 17 June 2024) and the Ethics Committee of the Institute for Students’ Health of Belgrade (Decision No. 1321/2; Approval date: 7 June 2024). Informed Consent Statement Informed consent was obtained from all subjects involved in this study. Data Availability Statement Data available upon reasonable request to the corresponding author. Conflicts of Interest The authors declare no conflicts of interest. References Aldawood E. Dabbagh D. Alharbi S. Alzamil L. Faqih L. Alshurafa H. H. Dabbagh R. HPV vaccine knowledge and hesitancy among health colleges’ students at a Saudi University Journal of Multidisciplinary Healthcare 2023 16 3465 3476 10.2147/JMDH.S438633 38024130 PMC10656864 Altobelli E. Rapacchietta L. Profeta V. F. Fagnano R. HPV-vaccination and cancer cervical screening in 53 WHO European Countries: An update on prevention programs according to income level Cancer Medicine 2019 8 5 2524 2534 10.1002/cam4.2048 30993902 PMC6536990 Balcezak H. C. Olusanya O. A. Tomar A. Foster M. Wigfall L. T. A 10-year systematic review of theory-driven approaches to increasing catch-up HPV vaccination rates among young adult males in colleges/university settings Journal of American College Health 2022 70 8 2535 2547 10.1080/07448481.2021.1873350 33529122 Brandt H. M. Vanderpool R. C. Curry S. J. Farris P. Daniel-Ulloa J. Seegmiller L. A. Multi-site case study of community-clinical linkages for promoting HPV vaccination Human Vaccines and Immunotherapeutics 2019 15 1599 1606 10.1080/21645515.2019.1616501 31158042 PMC6746520 Brunelli L. Bravo G. Romanese F. Righini M. Lesa L. De Odorico A. Bastiani E. Pascut S. Miceli S. Brusaferro S. Beliefs about HPV vaccination and awareness of vaccination status: Gender differences among Northern Italy adolescents Preventive Medicine Reports 2021 24 101570 10.1016/j.pmedr.2021.101570 34976634 PMC8683877 Bruni L. Albero G. Rowley J. Alemany L. Arbyn M. Giuliano A. R. Markowitz L. E. Broutet N. Taylor M. Global and regional estimates of genital human papillomavirus prevalence among men: A systematic review and meta-analysis The Lancet Global Health 2023a 11 9 e1345 e1362 10.1016/S2214-109X(23)00305-4 37591583 PMC10447222 Bruni L. Albero G. Serrano B. Mena M. Collado J. Gómez D. Muñoz J. Bosch F. de Sanjosé S. Human papillomavirus and related diseases in the world. Summary report 10 March 2023ICO/IARC information centre on HPV and cancer (HPV information Centre) 2023b Available online: https://hpvcentre.net/statistics/reports/XWX.pdf (accessed on 22 July 2025) Burger E. A. Sy S. Nygård M. Kristiansen I. S. Kim J. J. Prevention of HPV-related cancers in Norway: Cost-effectiveness of expanding the HPV vaccination program to include pre-adolescent boys PLoS ONE 2014 9 3 e89974 10.1371/journal.pone.0089974 24651645 PMC3961226 Cangelosi G. Sacchini F. Mancin S. Petrelli F. Amendola A. Fappani C. Sguanci M. Morales Palomares S. Gravante F. Caggianelli G. Papillomavirus vaccination programs and knowledge gaps as barriers to implementation: A systematic review Vaccines 2025 13 5 460 10.3390/vaccines13050460 40432072 PMC12116001 Catalan-Matamoros D. Peñafiel-Saiz C. The use of traditional media for public communication about medicines: A systematic review of characteristics and outcomes Health Communication 2019 34 4 415 423 10.1080/10410236.2017.1405485 29252009 Chen G. Wu B. Dai X. Zhang M. Liu Y. Huang H. Mei K. Wu Z. Gender differences in knowledge and attitude towards HPV and HPV vaccine among college students in Wenzhou, China Vaccines 2021 10 1 10 10.3390/vaccines10010010 35062671 PMC8779512 Cheng L. Wang Y. Du J. Human papillomavirus vaccines: An updated review Vaccines 2020 8 3 391 10.3390/vaccines8030391 32708759 PMC7565290 Chesson H. W. Meites E. Ekwueme D. U. Saraiya M. Markowitz L. E. Updated medical care cost estimates for HPV-associated cancers: Implications for cost-effectiveness analyses of HPV vaccination in the United States Human Vaccines & Immunotherapeutics 2019 15 7–8 1942 1948 10.1080/21645515.2019.1603562 31107640 PMC6746487 Cocchio S. Bertoncello C. Baldovin T. Fonzo M. Bennici S. E. Buja A. Majori S. Baldo V. Awareness of HPV and drivers of HPV vaccine uptake among university students: A quantitative, cross-sectional study Health & Social Care in the Community 2020 28 5 1514 1524 10.1111/hsc.12974 32182634 Dai Z. Si M. Su X. Wang W. Zhang X. Gu X. Ma L. Li J. Zhang S. Ren Z. Qiao Y. Willingness to human papillomavirus (HPV) vaccination and influencing factors among male and female university students in China Journal of Medical Virology 2022 94 6 2776 2786 10.1002/jmv.27478 34825712 PMC9299831 Daley E. M. Vamos C. A. Zimet G. D. Rosberger Z. Thompson E. L. Merrell L. The feminization of HPV: Reversing gender biases in US human papillomavirus vaccine policy American Journal of Public Health 2016 106 6 983 984 10.2105/AJPH.2016.303122 27153015 PMC4880257 D’Errico M. P. Tung W. C. Lu M. D’Errico R. Barriers and recommendations associated with human papillomavirus vaccination among college students The Journal for Nurse Practitioners 2020 16 7 533 537 10.1016/j.nurpra.2020.04.011 32590447 Díaz Crescitelli M. E. Ghirotto L. Sisson H. Sarli L. Artioli G. Bassi M. C. Appicciutoli G. Hayter M. A meta-synthesis study of the key elements involved in childhood vaccine hesitancy Public Health 2020 180 38 45 10.1016/j.puhe.2019.10.027 31838344 Djordjevic S. Boricic K. Radovanovic S. Simic Vukomanovic I. Mihaljevic O. Jovanovic V. Demographic and socioeconomic factors associated with cervical cancer screening among women in Serbia Frontiers in Public Health 2024 11 1275354 10.3389/fpubh.2023.1275354 38249409 PMC10796456 Dodd R. H. McCaffery K. J. Marlow L. A. Ostini R. Zimet G. D. Waller J. Knowledge of human papillomavirus (HPV) testing in the USA, the UK and Australia: An international survey Sexually Transmitted Infections 2014 90 3 201 207 10.1136/sextrans-2013-051402 24412997 PMC3995259 Elbasha E. H. Dasbach E. J. Impact of vaccinating boys and men against HPV in the United States Vaccine 2010 28 42 6858 6867 10.1016/j.vaccine.2010.08.030 20713101 Ellingson M. K. Sheikha H. Nyhan K. Oliveira C. R. Niccolai L. M. Human papillomavirus vaccine effectiveness by age at vaccination: A systematic review Human Vaccines & Immunotherapeutics 2023 19 2 2239085 10.1080/21645515.2023.2239085 37529935 PMC10399474 Fontenot H. B. Collins Fantasia H. Charyk A. Sutherland M. A. Human papillomavirus (HPV) risk factors, vaccination patterns, and vaccine perceptions among a sample of male college students Journal of American College Health 2014 62 3 186 192 10.1080/07448481.2013.872649 24328855 Frew P. M. Saint-Victor D. S. Owens L. E. Omer S. B. Socioecological and message framing factors influencing maternal influenza immunization among minority women Vaccine 2014 32 15 1736 1744 10.1016/j.vaccine.2014.01.030 24486366 Goldfarb J. A. Comber J. D. Human papillomavirus (HPV) infection and vaccination: A cross-sectional study of college students’ knowledge, awareness, and attitudes in Villanova, PA Vaccine: X 2022 10 100141 10.1016/j.jvacx.2022.100141 35118369 PMC8800100 Hesse C. Rauscher E. A. The relationship between family communication patterns and child vaccination intentions Communication Research Reports 2016 33 1 61 67 10.1080/08824096.2015.1117444 Karafillakis E. Simas C. Jarrett C. Verger P. Peretti-Watel P. Dib F. De Angelis S. Takacs J. Ali K. A. Celentano L. P. Larson H. HPV vaccination in a context of public mistrust and uncertainty: A systematic literature review of determinants of HPV vaccine hesitancy in Europe Human Vaccines & Immunotherapeutics 2019 15 10.1080/21645515.2018.1564436 PMC6783136 30633623 Kaufman J. Tuckerman J. Bonner C. Durrheim D. N. Costa D. Trevena L. Thomas S. Danchin M. Parent-level barriers to uptake of childhood vaccination: A global overview of systematic reviews BMJ Global Health 2021 6 9 e006860 10.1136/bmjgh-2021-006860 PMC8477248 34580071 Khurana S. Sipsma H. L. Caskey R. N. HPV vaccine acceptance among adolescent males and their parents in two suburban pediatric practices Vaccine 2015 33 13 1620 1624 10.1016/j.vaccine.2015.01.038 25659275 LaJoie A. S. Kerr J. C. Clover R. D. Harper D. M. Influencers and preference predictors of HPV vaccine uptake among US male and female young adult college students Papillomavirus Research 2018 5 114 121 10.1016/j.pvr.2018.03.007 29578098 PMC5886909 Larson H. J. Jarrett C. Eckersberger E. Smith D. M. Paterson P. Understanding vaccine hesitancy around vaccines and vaccination from a global perspective: A systematic review of published literature, 2007–2012 Vaccine 2014 32 19 2150 2159 10.1016/j.vaccine.2014.01.081 24598724 Lewandowsky S. Schmid P. Habersaat K. B. Nielsen S. M. Seale H. Betsch C. Böhm R. Geiger M. Craig B. Sunstein C. Sah S. MacDonald N. E. Dubé E. Fancourt D. Larson H. J. Jackson C. Mazhnaya A. Dutta M. Fountoulakis K. N. Danchin M. Lessons from COVID-19 for behavioural and communication interventions to enhance vaccine uptake Communications Psychology 2023 1 1 35 10.1038/s44271-023-00036-7 39242715 PMC11332013 Liu Y. Di N. Tao X. Knowledge, practice and attitude towards HPV vaccination among college students in Beijing, China Human Vaccines & Immunotherapeutics 2020 16 1 116 123 31373874 10.1080/21645515.2019.1638727 PMC7012165 MacDonald N. E. Vaccine hesitancy: Definition, scope and determinants Vaccine 2015 33 34 4161 4164 10.1016/j.vaccine.2015.04.036 25896383 Maier C. Maier T. Neagu C. E. Vlădăreanu R. Romanian adolescents’ knowledge and attitudes towards human papillomavirus infection and prophylactic vaccination European Journal of Obstetrics & Gynecology and Reproductive Biology 2015 195 77 82 10.1016/j.ejogrb.2015.09.029 26479435 McBride K. R. Singh S. Predictors of adults’ knowledge and awareness of HPV, HPV-associated cancers, and the HPV vaccine: Implications for health education Health Education & Behavior 2018 45 1 68 76 10.1177/1090198117709318 28595454 Meites E. Human papillomavirus vaccination for adults: Updated recommendations of the Advisory Committee on Immunization Practices MMWR. Morbidity and Mortality Weekly Report 2019 68 698 702 10.15585/mmwr.mm6832a3 31415491 PMC6818701 Naidoo D. Govender K. Mantell J. E. Breaking barriers: Why including boys and men is key to HPV prevention BMC Medicine 2024 22 1 525 10.1186/s12916-024-03701-8 39516809 PMC11549739 Odone A. Ferrari A. Spagnoli F. Visciarelli S. Shefer A. Pasquarella C. Signorelli C. Effectiveness of interventions that apply new media to improve vaccine uptake and vaccine coverage: A systematic review Human Vaccines & Immunotherapeutics 2015 11 1 72 82 10.4161/hv.34313 25483518 PMC4514191 Olusanya O. A. Tomar A. Thomas J. Alonge K. Wigfall L. T. Application of the theoretical domains framework to identify factors influencing catch-up HPV vaccinations among male college students in the United States: A review of evidence and recommendations Vaccine 2023 41 23 3564 3576 10.1016/j.vaccine.2023.04.071 37164820 Petit V. The behavioral drivers model UNICEF 2019 Available online: https://www.unicef.org/mena/media/5586/file/The_Behavioural_Drivers_Model_0.pdf (accessed on 20 July 2025) Phillips A. Patel C. Pillsbury A. Brotherton J. Macartney K. Safety of human papillomavirus vaccines: An updated review Drug Safety 2018 41 4 329 346 10.1007/s40264-017-0625-z 29280070 Quinn D. A. Lewin A. Family factors associated with emerging adults’ human papillomavirus vaccine behavior Journal of American College Health 2019 68 5 528 535 10.1080/07448481.2019.1583240 30908148 Smith L. E. Amlot R. Weinman J. Yiend J. Rubin G. J. A systematic review of factors affecting vaccine uptake in young children Vaccine 2017 35 45 6059 6069 10.1016/j.vaccine.2017.09.046 28974409 Stout M. E. Christy S. M. Winger J. G. Vadaparampil S. T. Mosher C. E. Self-efficacy and HPV vaccine Attitudes mediate the relationship between social norms and intentions to receive the HPV vaccine among college students Journal of Community Health 2020 45 1187 1195 10.1007/s10900-020-00837-5 32418009 PMC7606315 Theotonio dos Santos L. F. Marques Fidalgo T. Cordeiro Mattos A. J. Albuquerque Ribeiro G. Rizzo L. V. Andrade Rodrigues Fonseca H. Education and social determinants shaping HPV vaccine uptake: Insights from a nationwide cross-sectional study Human Vaccines & Immunotherapeutics 2025 21 1 2517488 10.1080/21645515.2025.2517488 40611644 PMC12233717 Urrutia M. T. Araya A. X. Gajardo M. Chepo M. Torres R. Schilling A. Acceptability of HPV vaccines: A qualitative systematic review and meta-summary Vaccines 2023 11 9 1486 10.3390/vaccines11091486 37766161 PMC10536942 Verelst F. Kessels R. Delva W. Beutels P. Willem L. Drivers of vaccine decision-making in South Africa: A discrete choice experiment Vaccine 2019 37 15 2079 2089 10.1016/j.vaccine.2019.02.056 30857931 Von Elm E. Altman D. G. Egger M. Pocock S. J. Gøtzsche P. C. Vandenbroucke J. P. The strengthening the reporting of observational studies in epidemiology (STROBE) statement: Guidelines for reporting observational studies The Lancet 2007 370 9596 1453 1457 10.1016/S0140-6736(07)61602-X 18064739 World Health Organization HPV vaccine comunication. Special considerations for a unique vaccine. 2016 update Geneva 2017 2017 Available online: https://www.who.int/publications/i/item/WHO-IVB-16.02 (accessed on 31 August 2025) ejihpe-15-00189-t001_Table 1 Table 1 Sociodemographic characteristics of study participants by sex.  All Participants Male Female p N N N Age (years) 21.8 (18.0–27.0) 21.7 (18.0–27.0) 21.9 (18.0–27.0) 0.200 Faculty group *:    0.047 Technology and engineering sciences 422 (21.6%) 146 (34.5%) 276 (18.1%) Sciences and mathematics 176 (9.0%) 41 (9.7%) 135 (8.8%) Medical sciences 484 (24.8%) 73 (17.3%) 411 (26.9%) Social sciences and humanities 759 (38.9%) 138 (32.6%) 621 (40.6%) Arts 33 (1.7%) 3 (0.7%) 30 (2.0%) Self-reported religiousness:     Completely nonreligious 333 (19.9%) 99 (25.9%) 234 (18.1%) <0.01 Moderately nonreligious 152 (9.1%) 41 (10.7%) 111 (8.6%) 0.224 Neither nonreligious nor religious 271 (16.2%) 47 (12.3%) 224 (17.4%) <0.05 Moderately religious 489 (29.2%) 104 (27.2%) 385 (29.8%) 0.338 Completely religious 428 (25.6%) 91 (23.8%) 337 (26.1%) 0.386 Self-assessed financial status:    <0.05 Very good 163 (8.4%) 29 (6.9%) 134 (8.8%) Good 673 (34.5%) 167 (39.5%) 506 (33.1%) Average 986 (50.5%) 199 (47.0%) 787 (51.5%) Bad 85 (4.4%) 16 (3.8%) 69 (4.5%) Very bad 7 (0.4%) 4 (0.9%) 3 (0.2%) I would rather not say 38 (1.9%) 8 (1.9%) 30 (2.0%) Relationship status:    <0.01 Single (including divorced) 1112 (58.8%) 267 (65.9%) 845 (56.9%) In a long-term relationship (including married) 727 (38.4%) 123 (30.4%) 604 (40.6%) Other–It’s complicated 52 (2.7%) 15 (13.7%) 37 (2.5%) HPV vaccination status    <0.001 Vaccinated 1062 (54.4%) 164 (38.8%) 898 (58.7%) Non-vaccinated 890 (45.6%) 259 (61.2%) 631 (41.3%) * Classification of faculties is based on the official organization of faculties at the University of Belgrade. ejihpe-15-00189-t002_Table 2 Table 2 Beliefs about HPV vaccine efficacy by sex and vaccination status.  All Participants N Male  Female  p Vaccinated N Not Vaccinated N Total N p Vaccinated N Not Vaccinated N Total N p I believe that HPV vaccine is important for my health.     <0.001    <0.001 <0.001 Strongly disagree 42 3 17 20  00.0% 22 22  Disagree 47 4 16 20  1 26 27  Neither disagree nor agree 291 15 93 108  16 167 183  Agree 396 30 72 102  113 181 294  Strongly agree 1176 112 61 173  768 235 1003  I believe that HPV vaccine can prevent HPV infection.     <0.001    <0.001 <0.01 Strongly disagree 35 4 11 15  9 11 20  Disagree 43 3 7 10  11 22 33  Neither disagree nor agree 231 8 51 59  37 135 172  Agree 571 29 80 109  242 220 462  Strongly agree 1072 120 110 230  599 243 842  I believe that HPV vaccine protects from oncogenic (those that cause cancer) strains of HPV viruses.     <0.001    <0.001 <0.001 Strongly disagree 26 3 7 10  1 15 16   Disagree 32 1 11 12  3 17 20  Neither disagree nor agree 297 17 87 104  32 161 193  Agree 461 27 63 90  170 201 371  Strongly agree 1136 116 91 207  692 237 929  Perceived HPV vaccine efficacy (total score) 4.34 (SD = 0.81) 4.53 (SD = 0.77) 3.81 (SD = 0.94) 4.09 (SD = 0.94)  4.71 (SD = 0.45) 3.99 (SD = 0.88) 4.41 (SD = 0.75)  <0.001   Total score—Vaccinated vs. non-vaccinated males: p  Total score—Vaccinated vs. non-vaccinated females: p   ejihpe-15-00189-t003_Table 3 Table 3 Beliefs about HPV vaccine safety by sex and vaccination status.  All Participants N Male  Female  p Vaccinated N Not Vaccinated N Total N p Vaccinated N Not Vaccinated N Total N p Overall, I believe that vaccines are safe.     <0.001    <0.001 <0.01 Strongly disagree 39 3 15 18  2 19 21  Disagree 77 7 14 21  10 46 56  Neither disagree nor agree 340 15 60 75  88 177 265  Agree 606 45 91 136  273 197 470  Strongly agree 890 94 79 173  525 192 717  I am concerned that HPV vaccine might cause infertility.     <0.001    <0.001 <0.001 Strongly disagree 898 84 82 166  572 160 732  Disagree 386 30 48 78  190 118 308  Neither disagree nor agree 417 26 98 124  86 207 293  Agree 152 14 17 31  25 96 121  Strongly agree 99 10 14 24  25 50 75  I believe that HPV vaccine is safe.          <0.001 Strongly disagree 39 3 13 16 <0.001 3 20 23 <0.001  Disagree 59 5 21 26  3 30 33  Neither disagree nor agree 337 11 74 85  30 222 252  Agree 505 41 74 115  223 167 390  Strongly agree 1012 104 77 181  639 192 831  Serious adverse reactions following HPV vaccination are extremely rare.     <0.001    <0.001 <0.001 Strongly disagree 35 1 8 9  15 11 26   Disagree 76 4 14 18  24 34 58  Neither disagree nor agree 636 36 142 178  134 324 458  Agree 500 45 52 97  265 138 403  Strongly agree 705 78 43 121  460 124 584  HPV vaccines have not been sufficiently studied for us to be certain about their safety.     <0.001    <0.001 <0.001 Strongly disagree 791 78 61 139  521 131 652   Disagree 448 35 44 79  237 132 369  Neither disagree nor agree 465 23 117 140  97 228 325  Agree 156 12 25 37  26 93 119  Strongly agree 92 16 12 28  17 47 64  Perceived HPV vaccine safety (total score) 4.01 (SD = 0.83) 0.417 (SD = 0.81) 3.61 (SD = 0.84) 3.82 (SD = 0.87)  4.43 (SD = 0.57) 3.56 (SD = 0.84) 4.06 (SD = 0.81)  <0.001   Total score—Vaccinated vs. non-vaccinated males: p  Total score—Vaccinated vs. non-vaccinated females: p   ejihpe-15-00189-t004_Table 4 Table 4 Beliefs about the danger of HPV vaccine-preventable diseases by sex and vaccination status.  All Participants N Male  Female  p Vaccinated N Not Vaccinated N Total N p Vaccinated N Not Vaccinated N Total N p I believe that HPV infection is not so common, so I consider myself as being at low risk of contracting it.     <0.001    <0.001 <0.001 Strongly disagree 959 68 60 128  600 231 831  Disagree 384 32 42 74  173 137 310  Neither disagree nor agree 430 38 114 152  78 200 278  Agree 107 11 34 45  20 42 62  Strongly agree 72 15 9 24  27 21 48  I believe HPV infection can be prevented by other means (etc. by condom).     <0.01    <0.001 <0.001 Strongly disagree 478 34 30 64  288 126 414  Disagree 458 38 36 74  256 128 384  Neither disagree nor agree 579 42 87 129  219 231 450  Agree 326 35 79 114  103 109 212  Strongly agree 111 15 27 42  32 37 69  Diseases caused by HPV (cancer of the cervix, vagina, vulva, anus, penis, oral cavity, and genital warts) are not that common.          <0.001 Strongly disagree 961 68 54 122 <0.001 583 256 839 <0.001  Disagree 470 43 62 105  202 163 365  Neither disagree nor agree 381 32 110 142  75 164 239  Agree 72 10 27 37  9 26 35  Strongly agree 68 11 6 17  29 22 51  HPV infection is not dangerous because it usually resolves spontaneously.     <0.001    <0.001 <0.001 Strongly disagree 1004 (51.4%) 68 74 142  580 282 862   Disagree 436 37 68 105  189 142 331  Neither disagree nor agree 396 41 101 142  88 166 254  Agree 62 6 13 19  19 24 43  Strongly agree 54 12 3 15  22 17 39  Perceived danger of the HPV vaccine-preventable diseases (total score) 3.94 (SD = 0.86) 3.70 (SD = 1.04) 3.39 (SD = 0.78) 3.51 (SD = 0.90)  4.27 (SD = 0.72) 3.78 (SD = 0.85) 4.06 (SD = 0.81)  <0.001   Total score—Vaccinated vs. non-vaccinated males: p  Total score—Vaccinated vs. non-vaccinated females: p   ejihpe-15-00189-t005_Table 5 Table 5 Frequency of use of information sources about vaccines by sex and vaccination status.  All Participants N Male  Female  p Vaccinated N Not Vaccinated N Total N p Vaccinated N Not Vaccinated N Total N p Scientific literature:     <0.001    <0.001 <0.001 Never 529 40 108 148  190 191 381  Rarely 383 30 54 84  172 127 299  Sometimes 593 41 67 108  281 204 485  Often 292 28 14 42  168 82 250  Regularly 155 25 16 41  87 27 114  National TV channels:     <0.01    0.730 <0.001 Never 668 72 119 191  283 194 477  Rarely 511 35 59 94  254 163 417  Sometimes 553 33 72 105  256 192 448  Often 165 15 6 21  82 62 144  Regularly 55 9 3 12  23 20 43  Regional TV channels:     0.241    0.270 <0.001 Never 802 85 136 221  353 228 581   Rarely 484 35 54 89  239 156 395  Sometimes 502 30 59 89  233 180 413  Often 115 6 6 12  55 48 103  Regularly 49 8 4 12  18 19 37  Internet portals:     <0.01    <0.001 <0.001 Never 266 31 68 99  71 96 167   Rarely 248 23 57 80  92 76 168  Sometimes 649 48 83 131  295 223 518  Often 554 43 38 81  299 174 473  Regularly 235 19 13 32  141 62 203  YouTube channels:     0.701    0.081 <0.01 Never 689 67 118 185  298 215 513   Rarely 402 35 50 85  191 126 317  Sometimes 509 35 59 94  225 190 415  Often 243 19 24 43  131 69 200  Regularly 100 8 8 16  53 31 84  Social networks (Instagram, Facebook, Viber, Twitter, WhatsApp):     <0.05    <0.001 <0.001 Never 300 38 82 120  87 93 180  Rarely 305 31 62 93  118 94 212  Sometimes 587 44 69 113  252 222 474  Often 483 33 30 63  269 151 420  Regularly 277 18 16 34  172 71 243  Family:     <0.001    <0.001 <0.001 Never 397 47 104 151  125 121 246  Rarely 361 25 58 83  150 128 278  Sometimes 617 41 71 112  278 227 505  Often 358 26 18 26.5%  211 103 33.0%  Regularly 219 25 8 44  134 52 314  Friends:          <0.001 Never 256 26 87 113 <0.001 59 84 143 <0.001  Rarely 321 31 48 79  133 109 242  Sometimes 673 53 73 126  305 242 547  Often 485 34 37 71  271 143 414  Regularly 217 20 14 34  130 53 183  Your chosen physician, or physician you visit most often:     <0.001    <0.001 <0.001 Never 400 39 95 134  137 129 266   Rarely 357 28 53 81  139 137 276  Sometimes 610 44 80 124  268 218 486  Often 353 27 18 45  214 94 308  Regularly 232 26 13 39  140 53 193  Healthcare professionals in media:     <0.01    <0.01 <0.001 Never 431 44 85 129  156 146 302   Rarely 384 25 51 76  173 135 308  Sometimes 645 46 90 136  299 210 509  Often 331 29 22 51  178 102 280  Regularly 161 20 11 31  92 38 130  Religious leaders:     <0.05    <0.001 <0.01 Never 1459 125 180 305  731 423 1154  Rarely 197 12 26 38  78 81 159  Sometimes 242 15 44 59  74 109 183  Often 29 4 5 9  9 11 20  Regularly 25 8 4 12  6 7 13  Government:     0.551    <0.05 0.109 Never 1128 90 141 231  553 344 897  Rarely 375 30 49 79  173 123 296  Sometimes 362 32 59 91  138 133 271  Often 53 5 5 10  21 22 43  Regularly 34 7 5 12  13 9 22  ejihpe-15-00189-t006_Table 6 Table 6 Perceived lack of information by sex and vaccination status.  All Participants N Male  Female  p Vaccinated N Not Vaccinated N Total N p Vaccinated N Not Vaccinated N Total N p It is hard to make the decision whether to vaccinate against HPV, since there is a lack of information about vaccines.     <0.001    <0.001 <0.05 Strongly disagree 533 63 58 121  336 76 412  Disagree 368 35 32 67  215 86 301  Neither disagree nor agree 598 41 112 153  186 259 445  Agree 305 15 36 51  128 126 254  Strongly agree 148 10 21 31  33 84 117  Incomplete information regarding the HPV vaccines I come across make me confused.     <0.001    <0.001 <0.05 Strongly disagree 574 66 52 118  373 83 456  Disagree 379 27 37 64  223 92 315  Neither disagree nor agree 589 40 107 147  196 246 442  Agree 279 23 47 70  80 129 209  Strongly agree 131 8 16 24  26 81 107  Contradictory information regarding the HPV vaccines I come across make me confused.          <0.01 Strongly disagree 590 68 63 131 <0.001 367 92 459 <0.001  Disagree 360 29 33 62  206 92 298  Neither disagree nor agree 623 42 120 162  204 257 461  Agree 243 19 28 47  88 108 196  Strongly agree 136 6 15 21  33 82 115  I have all the information I need regarding HPV vaccination.     <0.001    <0.001 <0.01 Strongly disagree 173 3 42 45  30 98 128   Disagree 216 20 38 58  57 101 158  Neither disagree nor agree 564 37 100 137  172 255 427  Agree 558 49 48 97  346 115 461  Strongly agree 441 55 31 86  293 62 355  Perceived lack of information (total score) 2.5 (SD = 1.06) 2.22 (SD = 1.01) 2.79 (SD = 0.94) 2.6  2.13 (SD = 0.96) 3.06 (SD = 0.99) 2.5 (SD = 1.08)  0.193   Total score—Vaccinated vs. non-vaccinated males: p  Total score—Vaccinated vs. non-vaccinated females: p   ejihpe-15-00189-t007_Table 7 Table 7 Self-ranked influence of social agents on vaccination intention by sex.  All Participants N Male  Female  p Vaccinated N Not Vaccinated N Total N p Vaccinated N Not Vaccinated N Total N p Own attitudes 1767 145 226 371 0.724 832 564 1396 <0.05 <0.05 Family 857 69 85 154 0.054 427 276 703 0.141 <0.001 Friends 503 44 59 103 0.344 257 143 400 <0.01 0.451 Peers 74 14 10 24 0.043 29 21 50 0.915 <0.05 Faculty colleagues 231 25 18 43 <0.01 141 47 188 <0.001 0.230 Community members 14 2 2 4 0.643 4 6 10 0.334 0.519 National health authorities (Ministry of health, Institute of Public Health) 255 27 45 72 0.808 98 85 183 0.129 <0.01 Religious leaders 17 1 6 7 0.256 1 9 10 <0.01 0.070 Healthcare workers 616 37 75 504 0.146 297 207 504 0.912 <0.05 Government 7 00.0% 6 6 N/A 1 00.0% 1 N/A <0.01 Media (TV, radio, newspapers, internet) 160 21 19 40 0.061 90 30 120 <0.001 0.286 ejihpe-15-00189-t008_Table 8 Table 8 Hierarchical multiple logistic regression analysis of variables significantly associated with vaccination status in the total sample. Variable Model 1 Model 2 Model 3 Model 4 OR (95% CI) OR (95% CI) OR (95% CI) OR (95% CI) Age 1.11 (1.05–1.18) *** 1.04 (0.98–1.11) 1.05 (0.98–1.12) 1.05 (0.98–1.12) Religiosity     Completely nonreligious 2.69 (1.97–3.68) *** 1.29 (0.89–1.85) 1.28 (0.87–1.88) 1.27 (0.86–1.88) Moderately nonreligious 2.08 (1.40–3.07) *** 1.15 (0.74–1.80) 1.19 (0.74–1.90) 1.16 (0.72–1.87) Neither nonreligious nor religious 1.93 (1.39–2.66) *** 1.50 (1.03–2.19) * 1.46 (0.99–2.14) 1.46 (0.99–2.15) Moderately religious 1.62 (1.23–2.13) ** 1.36 (0.99–1.87) 1.39 (0.99–1.92) 1.39 (0.99–1.94) Completely religious Ref. Ref. Ref. Ref. Faculty group:     Technology and engineering sciences 0.45 (0.37–0.61) *** 0.89 (0.63–1.26) 0.99 (0.69–1.43) 1.03 (0.70–1.50) Sciences and mathematics 0.47 (0.32–0.70) *** 0.77 (0.50–1.19) 0.88 (0.56–1.39) 0.88 (0.55–1.39) Medical sciences Ref. Ref. Ref. Ref. Social sciences and humanities 0.53 (0.41–0.69) *** 0.87 (0.65–1.18) 0.95 (0.68–1.31) 0.98 (0.70–1.38) Self-assessed financial status     Very good 1.99 (0.90–4.43) 1.15 (0.45–2.90) 0.87 (0.34–2.18) 0.77 (0.31–1.95) Good 2.05 (0.99–4.26) 1.22 (0.52–2.83) 0.98 (0.42–2.27) 0.84 (0.36–1.94) Average 1.73 (0.84–3.57) 1.17 (0.51–2.70) 1.01 (0.44–2.31) 0.87 (0.38–1.99) Poor 0.92 (0.39–2.15) 0.43 (0.16–1.13) 0.41 (0.16–1.08) 0.37 (0.14–1.00) Very poor Ref. Ref. Ref. Ref. Beliefs about vaccine efficacy  2.26 (1.80–2.85) *** 1.97 (1.56–2.49) *** 1.98 (1.56–2.52) *** Beliefs about vaccine safety  2.36 (1.89–2.95) *** 1.83 (1.42–2.35) *** 1.80 (1.40–2.32) *** Beliefs about danger of diseases  1.18 (1.01–1.38) * 1.10 (0.93–1.30) 1.09 (0.92–1.29) Perceived lack of information   0.74 (0.64–0.85) *** 0.73 (0.63–0.85) *** Scientific literature (frequency of use as a source)   1.09 (0.97–1.23) 1.11 (0.99–1.26) YouTube channels   0.89 (0.79–1.01) 0.88 (0.77–0.99) * Social networks (frequency of use as a source)   1.12 (0.99–1.26) 1.12 (0.99–1.26) Family (frequency of use as a source)   1.20 (1.07–1.35) ** 1.11 (0.98–1.26) Chosen physician (frequency of use as a source)   1.12 (1.00–1.26) * 1.18 (1.05–1.32) ** Religious leaders (frequency of use as a source)   0.87 (0.73–1.04) 0.89 (0.75–1.07) Family (social influence)    1.64 (1.23–2.18) ** Friends (social influence)    1.09 (0.82–1.45) Colleagues from faculty (social influence)    1.63 (1.09–2.44) * Religious leaders (social influence)    0.70 (0.14–3.41) Media (social influence)    1.81 (1.16–2.82) ** Nagelkerke R 2 0.088 0.356 0.390 0.403 * p p p ejihpe-15-00189-t009_Table 9 Table 9 Hierarchical multiple logistic regression analysis of variables significantly associated with vaccination status in male participants. Variable Model 1 Model 2 Model 3 Model 4 OR (95% CI) OR (95% CI) OR (95% CI) OR (95% CI) Religiosity     Completely nonreligious 1.83 (0.99–3.38) 1.10 (0.53–2.26) 1.03 (0.48–2.20) 1.02 (0.47–2.21) Moderately nonreligious 1.43 (0.65–3.14) 0.92 (0.39–2.20) 0.90 (0.35–2.27) 0.88 (0.34–2.24) Neither nonreligious nor religious 1.20 (0.56–2.56) 0.92 (0.41–2.09) 0.86 (0.36–2.03) 0.93 (0.39–2.23) Moderately religious 0.83 (0.44–1.57) 0.76 (0.38–1.52) 0.64 (0.31–1.33) 0.68 (0.33–1.43) Completely religious Ref. Ref. Ref. Ref. Faculty group:     Technology and engineering sciences 0.50 (0.27–0.92) * 0.90 (0.46–1.77) 1.55 (0.70–3.44) 1.63 (0.72–3.70) Sciences and mathematics 0.59 (0.26–1.31) 1.16 (0.47–2.87) 2.02 (0.75–0.55) 2.04 (0.74–5.61) Medical sciences Ref. Ref. Ref. Ref. Social sciences and humanities 0.32 (0.17–0.60) *** 0.54 (0.27–1.06) 0.822 (0.37–1.81) 0.88 (0.39–1.99) Beliefs about vaccine efficacy  2.48 (1.60–3.83) *** 2.21 (1.42–3.44) *** 2.14 (1.37–3.34) * Beliefs about vaccine safety  1.24 (0.79–1.94) 0.98 (0.58–1.67) 1.01 (0.59–1.73) Beliefs about danger of diseases  1.04 (0.77–1.39) 1.05 (0.76–1.45) 1.02 (0.73–1.41) Perceived lack of information   0.74 (0.54–1.01) 0.71 (0.52–0.98) * Scientific literature (frequency of use as a source)   1.45 (1.12–1.89) ** 1.50 (1.15–1.97) ** YouTube channels (frequency of use as a source)   0.72 (0.55–0.94) * 0.70 (0.53–0.92) * Family (frequency of use as a source)   1.45 (1.15–1.84) ** 1.37 (1.07–1.75) * Family (social influence)    1.83 (1.03–3.24) * Colleagues from faculty (social influence)    1.58 (0.66–3.79) Media (social influence)    1.74 (0.77–3.95) Nagelkerke R 2 0.074 0.228 0.313 0.331 * p p p ejihpe-15-00189-t010_Table 10 Table 10 Hierarchical multiple logistic regression analysis of variables significantly associated with vaccination status in female participants. Variable Model 1 Model 2 Model 3 Model 4 OR (95% CI) OR (95% CI) OR (95% CI) OR (95% CI) Age 1.16 (1.08–1.24) *** 1.08 (0.99–1.17) 1.07 (0.99–1.16) 1.07 (0.99–1.16) Religiosity     Completely nonreligious 3.74 (2.54–5.52) *** 1.66 (1.06–2.60) * 1.51 (0.95–2.42) 1.51 (0.94–2.42) Moderately nonreligious 2.47 (1.55–3.93) *** 1.28 (0.74–2.20) 1.19 (0.68–2.11) 1.14 (0.64–2.03) Neither nonreligious nor religious 2.10 (1.46–3.02) *** 1.65 (1.07–2.54) * 1.56 (1.00–2.42) 1.53 (0.98–2.39) Moderately religious 1.88 (1.37–2.57) *** 1.57 (1.08–2.28) * 1.57 (1.07–2.30) * 1.54 (1.05–2.27) Completely religious Ref. Ref. Ref. Ref. Faculty group:     Technology and engineering sciences 0.50 (0.35–0.71) *** 0.97 (0.64–1.47) 0.99 (0.64–1.54) 1.01 (0.64–1.59) Sciences and mathematics 0.44 (0.28–0.69) *** 0.61 (0.37–1.02) 0.65 (0.38–1.10) 0.64 (0.37–1.09) Medical sciences Ref. Ref. Ref. Ref. Social sciences and humanities 0.60 (0.45–0.81) *** 1.00 (0.71–1.42) 1.06 (0.73–1.55) 1.10 (0.75–1.62) Self-assessed financial status     Very good 1.70 (0.66–4.39) 1.23 (0.41–3.74) 0.84 (0.28–2.59) 0.79 (0.26–2.42) Good 1.67 (0.70–4.00) 1.04 (0.38–2.89) 0.78 (0.28–2.16) 0.69 (0.25–1.91) Average 1.34 (0.56–3.17) 1.07 (0.39–2.92) 0.83 (0.30–2.26) 0.74 (0.27–2.02) Poor 0.55 (0.20–1.50) 0.30 (0.09–0.94) * 0.23 (0.07–0.75) * 0.22 (0.07–0.71) * Very poor Ref Ref. Ref. Ref. Very good 1.70 (0.66–4.39) 1.23 (0.41–3.74)   Beliefs about vaccine efficacy  2.18 (1.64–2.89) *** 1.96 (1.48–2.62) *** 2.01 (1.50–2.69) *** Beliefs about vaccine safety  3.14 (2.40–4.13) *** 2.35 (1.74–3.18) *** 2.29 (1.69–3.10) *** Beliefs about danger of diseases  1.11 (0.91–1.36) 1.05 (0.86–1.30) 1.05 (0.85–1.30) Perceived lack of information   0.71 (0.60–0.84) *** 0.71 (0.60–0.84) *** Scientific literature (frequency of use as a source)   1.03 (0.90–1.18) 1.05 (0.911–1.20) Social networks (frequency of use as a source)   1.08 (0.96–1.23) 1.07 (0.94–1.21) Family (frequency of use as a source)   1.12 (0.98–1.28) 1.06 (0.91–1.23) Chosen physician (frequency of use as a source)   1.06 (0.93–1.21) 1.12 (0.98–1.28) Religious leaders (frequency of use as a source)   0.80 (0.65–0.98) * 0.81 (0.66–1.00) Family (social influence)    1.45 (1.04–2.03) * Friends (social influence)    1.24 (0.88–1.73) Colleagues from faculty (social influence)    1.62 (1.01–2.59) * Media (social influence)    1.92 (1.10–3.37) * Nagelkerke R 2 0.112 0.407 0.429 0.440 * p p ",
  "metadata": {
    "Title of this paper": "The strengthening the reporting of observational studies in epidemiology (STROBE) statement: Guidelines for reporting observational studies",
    "Journal it was published in:": "European Journal of Investigation in Health, Psychology and Education",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12468811/"
  }
}