{
  "title": "Paper_263",
  "abstract": "pmc Arq Bras Cir Dig Arq Bras Cir Dig 2852 abcd abcd Arquivos Brasileiros de Cirurgia Digestiva : ABCD 0102-6720 2317-6326 Colégio Brasileiro de Cirurgia Digestiva PMC12490266 PMC12490266.1 12490266 12490266 10.1590/0102-67202025000028e1897 00322 1 Original Article APACHE II, SOFA, and SAPS III after transhiatal and thoracoscopic in prone position esophagectomy for esophageal cancer: a single-center retrospective cohort analysis APACHE II, SOFA e SAPS III após esofagectomia transhiatal e toracoscópica para câncer de esôfago: análise de coorte retrospectiva de centro único https://orcid.org/0000-0002-4498-6786 FERRER José Antonio Possatto Conceptualization Data analysis Investigation Literature review Methodology Writing – original draft  1 https://orcid.org/0000-0003-0510-7360 TERCIOTI Valdir JUNIOR Conceptualization Literature review Methodology Writing – original draft  1 https://orcid.org/0000-0002-1630-7889 FALCÃO Antonio Luis Eiras Conceptualization Data analysis Investigation Methodology Writing – original draft  2 https://orcid.org/0000-0001-7415-1635 COELHO João de Souza NETO Investigation Literature review Methodology  1 https://orcid.org/0000-0002-1516-5946 MACEDO Ary Augusto de Castro Investigation Literature review Methodology  1 https://orcid.org/0000-0001-7452-1165 ANDREOLLO Nelson Adami Conceptualization Data analysis Investigation Literature review Methodology Writing – original draft  1 https://orcid.org/0000-0002-8996-6658 LOPES Luiz Roberto Data analysis Writing – original draft  1  1  2 Correspondence lopes@unicamp.br Conflict of interests: Editor: https://orcid.org/0000-0001-7452-1165 29 9 2025 2025 38 483180 e1897 25 2 2024 12 5 2025 29 09 2025 03 10 2025 03 10 2025 https://creativecommons.org/licenses/by/4.0/ This is an open-access article distributed under the terms of the Creative Commons Attribution License ABSTRACT Background: Esophagectomy is a major, invasive, and long-lasting surgery performed in patients with comorbidities and compromised nutritional conditions. The historical challenges of surgical treatment of esophageal cancer are to overcome mortality, improve survival, and decrease morbidity. Aims: The aim of the study is to compare the intraoperative morbidity of two distinct surgical techniques of esophagectomy in esophageal cancer, transhiatal esophagectomy and video-assisted thoracoscopy in the prone position, analyzing intraoperative physiological parameters, scores on admission to the intensive care unit (ICU) (APACHE II, SOFA, and SAPS III), and postoperative evolution. Methods: Retrospective, cross-sectional study evaluating patients admitted to the ICU in the immediate postoperative period of elective esophagectomy for esophageal neoplasia (squamous cell carcinoma and adenocarcinoma). Data were obtained from a computerized registry database of the ICU and from patient records. Results: Sixty-three patients over 18 years of age were evaluated and divided into two groups: 31 (49.21%) underwent transhiatal esophagectomy, and 32 (50.79%) underwent videoassisted thoracoscopic esophagectomy. No statistically significant difference was observed for length of ICU stay (p=0.5309), length of postoperative hospital stay (p=0.3066), or death in the perioperative period (30 days, p=0.6562). Regarding intraoperative parameters, no statistically significant difference was observed for patients who received blood transfusion (p=0.2097); amount in milliliters (p=0.2893); patients who used vasoactive drugs (VADs) (p=0.9243); time VAD use (p=0.9327); volume of fluids infused in milliliters (p=0.7825); or diuresis in milliliters (p=0.7286). A statistically significant difference was observed for surgical time (310 min in transhiatal esophagectomy vs. 373 min in video-assisted thoracoscopy, p=0.0012) and anesthetic time (385 minutes in transhiatal vs. 467 min in video-assisted thoracoscopy, p<0.0001). A statistically significant difference was observed in the number of patients extubated at the end of the procedure (48.38% in transhiatal vs. 9.37% in video-assisted thoracoscopy, p=0.0022). Regarding gasometric parameters at the end of the surgical procedure, only pO 2 Conclusions: This study showed no differences between the transhiatal and thoracoscopic esophagectomy in the prone position, in prognostic score performance, studied operative parameters, ICU stay and hospital stay times, and perioperative mortality, in agreement with literature findings. The advent of minimally invasive techniques in video-assisted esophagectomies brought the same benefits as thoracotomy, offering greater safety in mediastinal dissection under direct vision, in addition to mitigating the physiological repercussions of thoracotomies. VISUAL ABSTRACT  ARTICLE HIGHLIGHTS Esophagectomy is still considered one of the most complex operations, due to the need for oncological radicality, being indicated after adequate and thorough preoperative evaluation The main postoperative complications are cardiorespiratory and infectious Patients needs in the immediate postoperative period, resources and support from Intensive Care Units (ICU) for their recovery, including ventilatory support, parenteral nutrition, and others. The most commonly used severity scores in ICU are APACHE II, SOFA and SAPS III, which show the patient’s severity status or not, treatment effectiveness, and therefore guide decision-making. Summary CENTRAL MESSAGE Esophagectomy is still considered one of the most complex operations due to the need for oncological radicality, being indicated after adequate and thorough preoperative evaluation and performed in institutions that have specialized medical teams and intensive care resources, considering its possible postoperative complications. It is performed by thoracotomy, transhiatal, and recently, with the progress of video surgery, by thoracoscopy in prone positions as a minimally invasive procedure. Considering esophagectomy being a major surgery, highly invasive, and of long duration, regardless of the access route or surgical tactic employed, in the immediate postoperative period, they need resources and support from intensive care units (ICUs) for their recovery, including ventilatory support, parenteral nutrition, and others. It is very important to employ in dices or scores to evaluate metabolic, hemodynamic, and infectious conditions that better guide the intensivist in their conduct and treatments. PERSPECTIVES This study showed no differences between the transhiatal and tho racoscopic esophagectomy in the prone position in prognostic score performance, studied operative parameters, ICU stay and hospital stay times, and perioperative mortality, in agreement with literature findings. Transhiatal esophagectomy is a technique that emerged with the objective of reducing pulmonary morbidity caused by thoracotomy. Recently, the advent of minimally invasive techniques in video-assisted esophagectomies brought the same benefits as thoracotomy, offering greater safety in mediastinal dissection under direct vision and allowing more adequate lymphadenectomy, in addition to mitigating the physiological repercussions of thoracotomies. RESUMO Racional: A esofagectomia é uma cirurgia de grande porte, invasiva e de longa duração; realizada em pacientes com comorbidades e condições nutricionais comprometidas. Os desafios históricos do tratamento cirúrgico do câncer esofágico são superar mortalidade, melhorar sobrevida e diminuir a morbidade. Objetivos: Comparar a morbidade transoperatória de duas técnicas cirúrgicas distintas de esofactomia no câncer esofágico, a esofagectomia transhiatal e a videotoracoscopia em posição prona, analisando parâmetros fisiológicos intraoperatórios, escores de admissão à Unidade de Terapia Intensiva (SOFA, SAPS III e APACHE II) e evolução pós-operatória. Métodos: Estudo retrospectivo, transversal, avaliando pacientes admitidos à Unidade de Terapia Intensiva (UTI) em pós-operatório imediato de esofagectomia em caráter eletivo por neoplasia de esôfago (carcinoma spinocelular e adenocarcinoma). Os dados foram obtidos de uma base de registro informatizado do Serviço de Terapia Intensiva e dos prontuários dos pacientes. Resultados: Foram avaliados 63 pacientes maiores de 18 anos de idade, distribuídos em dois grupos: 31 (49,21%) submetidos a esofagectomia transhiatal; e 32 (50,79%) submetidos a esofagectomia por videotoracoscopia. Não foi observado diferença estatisticamente significativa para tempo de internação em UTI (p=0,5309), tempo de internação pós-operatória (p=0,3066) e óbito no período perioperatório (30 dias, p=0,6562). Com relação aos parâmetros intraoperatórios, não foi observado diferença estatisticamente significativa para pacientes que receberam transfusão (p=0,2097); quantidade de hemoderivados em ml (p=0,2893); pacientes que fizeram uso de droga vasoativa (DVA) (p=0,9243); tempo de uso de DVA (p=0.9327); volume de líquidos infundidos em ml (p=0,7825); diurese em ml (p=0,7286). Observada diferença estatisticamente significativa para tempo cirúrgico (310 minutos na esofagectomia trans hiatal vs 373 minutos na videotoracoscopia, p=0,0012) e tempo anestésico (385 minutos na trans hiatal vs 467 minutos na videotoracoscopia, p<0,0001). Observada diferença estatisticamente significativa na quantidade de pacientes extubados ao final do procedimento (48,38% na transhiatal vs 9,37% na videotoracoscopia, p=0,0022). Com relação aos parâmetros gasométricos ao final do procedimento cirúrgico, apenas pO 2 Conclusões: Este estudo não demonstrou diferenças entre a esofagectomia transhiatal e a toracoscópica em posição prona, no desempenho dos escores prognósticos, nos parâmetros operatórios estudados, nos tempos de internação na UTI e permanência hospitalar, bem como na mortalidade perioperatória, em concordância com os achados da literatura. O advento das técnicas minimamente invasivas nas esofagectomias videoassistidas trouxe os mesmos benefícios da toracotomia, oferecendo maior segurança na dissecção mediastinal sob visão direta, além de atenuar as repercussões fisiológicas das toracotomias. Keywords: Esophageal Neoplasms Esophagectomy Thoracoscopy Critical Cares Prognosis Minimally Invasive Surgical Procedures Palavras-chave: Neoplasias Esofágicas Esofagectomia Toracoscopia Cuidados Críticos Prognóstico Procedimentos Cirúrgicos Minimamente Invasivos pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement no pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes INTRODUCTION Esophagectomy is still considered one of the most complex operations due to the need for oncological radicality, being indicated after adequate and thorough preoperative evaluation and performed in institutions that have specialized medical teams and intensive care resources, considering its possible postoperative complications  5 9 36  12 33  6 12 14 16 25 29 35 In addition to adequate preoperative evaluation of the patient’s clinical and nutritional conditions and the location and extent of the esophageal tumor or the esophagogastric junction, esophagectomy complications are also associated with the access route for esophageal removal and digestive tract reconstruction  8 10 19 23  1 8 9 46 Transhiatal esophagectomy, also called transmediastinal, described by Pinotti et al. and Orringer et al., was the surgery of choice for many years, employed by most services performing this operation for treating both adenocarcinoma of the esophagogastric junction and squamous cell carcinoma of the esophagus. In these procedures, the patient undergoes laparotomy or laparoscopy and left cervicotomy  17 28 42 43 Recently, with the progress of video surgery and better equipment and instruments, the access route for esophagectomy began to be performed by videothoracoscopy. The best patient position option is lateral dorsal decubitus, also called the prone position. Thus, services that opt for this access route initially perform esophagectomy with the patient in the aforementioned position, then the patient is changed to the dorsal decubitus position and undergoes laparotomy and left cervicotomy, the gastric tube is constructed, and this tube is trans posed to the cervical region via the posterior mediastinum, and cervical esophagogastric anastomosis is performed  4 10 18 36 41 46 In summary, services that routinely practice esophagectomy for treating esophageal tumors can opt for the transhiatal route or videothoracoscopy. The choice of access route for esophagectomy may depend on the patient’s physical type, weight, clinical conditions, and tumor location, although in most cases, one or another access route can be employed  1 3 7 27 42 46 Therefore, esophagectomy, being a major surgery, highly invasive and of long duration, regardless of the access route or surgical tactic employed, patients most often have a history of smoking and alcoholism and present compromised nutritional conditions. Furthermore, intraoperatively, the patient may need infusion of many fluids, blood transfusions, and vasoactive drugs (VADs). Considering these arguments, in the immediate postoperative period, they need resources and support from ICUs for their recovery, including ventilatory support, parenteral nutrition, and others. It is very important to employ indices or scores to evaluate metabolic, hemodynamic, and infectious conditions that better guide the intensivist in their conduct and treatments  15 29 31 43 45 The most commonly used severity scores in the ICU are APACHE II (Acute Physiology and Chronic Health Evaluation), SOFA (Sequential Organ Failure Assessment), and SAPS III (Simplified Acute Physiology Score), which show the patient’s severity status or not, treatment effectiveness, and therefore guide decision-making. Severity indices aim to provide a quantitative description of the degree of organic dys function of the patient, with their condition being translated into a numerical value, considering their clinical and laboratory conditions  13 15 31 34 40 44 The objective of the present work is to analyze two groups of patients undergoing esophagectomy to treat esophageal cancer: transhiatal and videothoracoscopy, comparing the severity indices APACHE II, SOFA, and SAPS III in the immediate postoperative period and at ICU admission. METHODS The study was retrospective, observational, cross-sectional, and quantitative, evaluating data obtained from a computerized registry database of the intensive care service of the Hospital de Clínicas of the State University of Campinas (UNICAMP). The computerized registry database was daily fed with data referring to clinical, physiological, laboratory, and score quantitative parameters by professionals from the ICU team  15 Inclusion criteria The inclusion criteria for study participants were: Patients over 18 years old; Undergoing elective esophagectomy; Undergoing esophagectomy for neoplasia; Operated by the same team. Exclusion criteria The exclusion criteria were: Patients under 18 years old; Patients undergoing emergency surgery; Patients undergoing esophagectomy for non-neoplastic diseases; Patients undergoing esophagectomy for neoplasias other than adenocarcinoma or squamous cell carcinoma. The database search retrieved 64 patients admitted in the immediate postoperative period to the ICU, undergoing elective esophagectomy for esophageal neoplasia, operated by the esophagus, stomach, and duodenum group, from January 2013 to October 2017. One patient operated for gastrointestinal stromal tumor in the esophagus was excluded. Participants were divided into two groups: transhiatal esophagectomy (31 patients) and videothoracoscopic esophagectomy (32 patients), operated with standardized operative techniques by a single surgical team. All patients remained postoperatively in a single ICU, therefore followed by a single team of intensivist physicians. Transhiatal esophagectomy The surgical procedure begins with the patient in horizontal dorsal decubitus. Median laparotomy is performed; opening of the gastrocolic ligament and access to the retrocavity; section of short and left gastroepiploic vessels, with release of gastric fundus and posterior wall; lymphadenectomy of the gastric lesser curvature and celiac trunk; dissection of the diaphragmatic hiatus and anterior opening; left cervicotomy, with isolation and section of cervical esophagus; blunt manual dissection of thoracic esophagus through hiatal opening and cervicotomy; esophageal excision to the abdominal cavity; construction of gastric tube along lesser curvature, using mechanical staplers; transposition of gastric tube through hiatal opening to cervical region; manual end-to-side esophagogastric anastomosis. Intrathoracic and cervical lymph nodes found were removed. Jejunostomy for nutritional support were introduced and drainage of cervical anastomosis were performed  1 5 39 42 Videothoracoscopic esophagectomy The surgical procedure begins with the patient in the prone position. With orotracheal intubation with a wire-reinforced tube, with carbon dioxide pneumothorax, and cavitary pressure of 8 mmHg. The first 10 mm trocar was positioned in the fifth intercostal space at the midaxillary line, the second 5 mm in the seventh intercostal space at the posterior axillary line, and the third 10 mm in the fourth intercostal space at the posterior axillary line. Dissection was performed with atraumatic forceps for esophageal manipulation and monopolar electrocautery (hook), mobilizing the esophagus with its periesophageal lymphatic drainage chains and thoracic duct en bloc. Section of the azygos vein after ligatures with cotton thread and placement of metallic clips. Right and left paratracheal, superior and inferior tracheobronchial, infracarinal, periesophageal lymph node chains, and thoracic duct were removed en bloc. Finishing the thoracic time, a 28 French caliber drain was placed along the esophageal resection bed. Direct visualization of pulmonary re-expansion was performed. Then the patient was repositioned to dorsal decubitus, undergoing median laparotomy; opening of the gastrocolic ligament and access to the retrocavity; sectioning of the short and left gastroepiploic vessels, with release of the gastric fundus and posterior wall; lymphadenectomy of the gastric lesser curvature and celiac trunk; and dissection of the diaphragmatic hiatus. Left cervicotomy, with isolation and section of cervical esophagus; esophageal excision to abdominal cavity; construction of gastric tube through stapling along lesser curvature; exeresis of the surgical specimen; passage of gastric tube through hiatal opening to cervical region; manual end-to-side esophagogastric anastomosis. Jejunostomy for nutritional support were introduced and drainage of cervical anastomosis were performed  18 19 21 39 Intraoperative parameters The following intraoperative parameters were evaluated: Surgical time (in minutes); Anesthetic time (in minutes); Need for blood transfusion and quantity (in ml); Need for VAD use and time of use (in minutes); Diuresis (in ml); Total volume of infused fluids (in ml); Last arterial blood gas of anesthetic time, collected after completion of the surgical act, with the following parameters evaluated: Partial pressure of oxygen (pO 2 Partial pressure of carbon dioxide (pCO 2 Bicarbonate anion concentration (HCO 3− Serum lactate level; Hemoglobin level (Hb); Hematocrit (Ht). Patient extubated at the end of the procedure (yes or no). Intensive care unit admission scores Prognostic scores for ICU admission were evaluated in the immediate postoperative period: SAPS III; APACHE II; SOFA. The SAPS III score was calculated with data from the first hour of ICU admission, using the worst variables in this period. The APACHE II score was calculated with data from the first 24 h of admission, also using the worst variables in this period. The SOFA score is calculated with the worst result for each parameter. Additionally, the following parameters were evaluated during the hospital stay period: Days of postoperative hospitalization, obtained by subtraction between surgery day and hospital discharge day (or death); Days of ICU stay, obtained by subtraction between surgery day and clinical ICU discharge day; Deaths, considered during the entire hospital stay (in ICU and ward). Statistical analysis To describe the sample profile according to the variables under study, frequency tables of categorical variables with absolute frequency (n) and percentage (%) values were created, and descriptive statistics of numerical variables were calculated, with mean, standard deviation, minimum and maximum values, and median. The chi-square test was used for statistical comparison of categorical variables, and the Mann-Whitney test for numerical variables. For statistical analysis, the computer program the SAS System for Windows (Statistical Analysis System), version 9.4, SAS Institute Inc., 2002–2008, Cary, NC, USA, was used. The present study was approved by the Ethics and Research Committee of the Faculty of Medical Sciences (FCM) of UNICAMP (Nº 2.886.114). RESULTS Sixty-three patients over 18 years old were evaluated who were admitted in immediate postoperative period of elective esophagectomy for neoplasia and operated from January 2013 to October 2017. Of the 63 patients, 31 (49.21%) underwent transhiatal esophagectomy, and 32 (50.79%) underwent esophagectomy with thoracic dissection by videothoracoscopy. There were 14 female patients (22.22%) and 49 male patients (77.78%). Comparing the transhiatal and videothoracoscopy subgroups, a statistically significant difference was observed (p=0.0127, p<0.05) ( Table 1 Table 1 Comparison between transhiatal and videothoracoscopy groups according to sex. Sex Transhiatal Videothoracoscopy Total Female 11 3 14 Male 20 29 49 Total 31 32 63 The age range was 58.9±7.45 years. Comparing the two groups, a statistically significant difference was observed (p=0.0453, p<0.05) ( Table 2 Table 2 Comparison between transhiatal and videothoracoscopy groups according to age range. Transhiatal Videothoracoscopy p-value Mean–Median (SD) Mean–Median (SD) Age (years) 56.94–58 (7.84) 60.97–60.50 (6.58) 0.0453 SD: standard deviation. Twenty-five patients (39.68%) were operated for adenocarcinoma of the esophagogastric junction, and 38 patients (60.32%) for squamous cell carcinoma. Patients with squamous cell carcinoma were previously submitted to neoadjuvant radiotherapy and chemotherapy, and patients with adenocarcinoma were operated upfront1. Comparing the two groups, a statistically significant difference was observed (p=0.0090, p<0.05), adjusted for sex and age ( Table 3 Table 3 Comparison between transhiatal and videothoracoscopy groups according to histological type. Histological type Transhiatal Videothoracoscopy Total Adenocarcinoma 17 8 25 Squamous cell 14 24 38 Total 31 32 63 Of the 63 patients analyzed, 46 (73.02%) did not receive blood products, and 17 (26.98%) received blood transfusions. Comparing the groups, no statistically significant difference was observed (p=0.2097, p>0.05), already adjusted for sex and age ( Table 4 Table 4 Comparison between transhiatal and videothoracoscopy groups for blood transfusion. Transfusion Transhiatal Videothoracoscopy Total No 24 22 46 Yes 7 10 17 Total 31 32 63 Regarding the use of VAD, 26 patients (41.27%) did not use them during the surgical-anesthetic act, and 37 (58.37%) used them ( Table 5 Table 5 Comparison between transhiatal and videothoracoscopy groups for vasoactive drug use. VAD Transhiatal Videothoracoscopy Total No 12 14 26 Yes 19 18 37 Total 31 32 63 VAD: vasoactive drug. At the end of the surgical procedure, 18 patients (28.57%) were extubated; however, 46 patients (71.43%) were sent to the ICU on mechanical ventilation. Comparing the two groups, a statistically significant difference was observed (p=0.0022, p<0.05), already adjusted for sex and age ( Table 6 Table 6 Comparison between transhiatal and videothoracoscopy groups for extubation at the end of surgery. Extubation Transhiatal Videothoracoscopy Total No 16 29 45 Yes 15 3 18 Total 31 32 63 The quantitative variables of intraoperative parameters are summarized below, with comparison between subgroups already adjusted for sex and age ( Table 7 Table 7 Comparison between transhiatal and videothoracoscopy groups for intraoperative parameters. n=63 Transhiatal (n=31) Videothoracoscopy (n=32) p-value Mean±SD–Median (min–max) Mean±SD–Median (min–max) Surgical time (min) 342.22±69.62–345(200–555) 310.32±79.20–290(200–555) 373.13±40.26–375(290–460)–0.0012 Anesthetic time (min) 427.46±82.22–435 (235–675) 385.65±86.15–375 (235–675) 467.97±53.80–467.50 (360–570) <0.0001 Blood transfusion (mL) 339.47±102.77–300 (200–600) 384±121.90–320 (280–600) 308.30±79.05–300 (200–500) 0.2893 VAD time (min) 172.57±93.14–170 (25–385) 171.32±76.39–175 (30–325) 173.89±110.39–155 (25–385) 0.9327 Fluid volume (mL) 5245.90±1329.89–5000 (1810–10500) 5184.27±1603.49–4900 (1810–10500) 5303.69±1033.31–5050 (3000–7500) 0.7825 Diuresis (mL) 631.56±369.06–500 (200–1700) 582.50±279.25–500 (200–1350) 679.03±438.52–500 (200–1700) 0.7286 pO 2 163.33±43.65–155 (68–264) 144.44±36.65–142 (68–233) 180.44±42.89–177.50 (116–264) 0.0010 pCO 2 37.88±4.78–36.90 (29.40–56.60) 38±5.34–37 (30.10–56.60) 37.77±4.29–36.90 (29.40–48.90) 0.6629 HCO 3 21.80±2.02–21.30 (18.20–28.40) 21.76±2.20–21.40 (18.20–28.40) 21.84±1.93–21.20 (18.92–27.00) 0.8729 Lactate 2.15±1.15–1.90 (0.60–5.90) 2.23±1.08–2.05 (1–5.5) 2.16±1.23–1.85 (0.60–5.90) 0.6648 Hb 11.20±1.68–11 (7.40–15.90) 11.38±1.73–11.20 (9.20–15.90) 11.04±1.64–11 (7.4–15.1) 0.4127 Ht 34.54±5.06–34.10 (23.20–48.60) 35.08±5.20–34.70 (28.40–48.60) 34.06±4.96–34.10 (23.20–46.40) 0.4275 SD: standard deviation; min: minimum; max: maximum; VAD: vasoactive drugs; pO 2 2 3 The results of ICU admission scores (APACHE II, SOFA, SAPS III) are summarized in Table 8 Table 8 Comparison between transhiatal and videothoracoscopy groups for prognostic scores at admission. There was no statistically significant difference between groups. n=63 Transhiatal (n=31) Videothoracoscopy (n=32) p-value Mean±SD–Median (min–max) Mean±SD–Median (min–max) APACHE II 9.63±2.97–10 (4–17) 9.03±2.69–8 (4–14) 10.22±3.16–10 (5–17) 0.6542 SOFA 3.21±±2.16–3 (0–8) 3.35±2.37–2 (0–8) 3.06±1.97–3 (0–7) 0.8949 SAPS III 40.98±7.12–40 (26–66) 39.67±6.57–39.50 (32–55) 42.22±7.49–42 (26–66) 0.7656 SD: standard deviation; APACHE II: Acute Physiology and Chronic Health Evaluation; SOFA: Sequential Organ Failure Assessment; SAPS III: Simplified Acute Physiology Score. The results regarding days of ICU stay and days of postop erative hospitalization are summarized below, with compari sons between groups already adjusted for sex and age ( Table 9 Table 9 Comparison between transhiatal and videothoracoscopy groups for ICU stay time and postoperative hospitalization time. n=63 Transhiatal (n=31) Videothoracoscopy (n=32) p-value Mean±SD–Median (min–max) Mean±SD–Median (min–max) ICU stay (days) 6.9±7.14–6 (2–41) 5.84±2.35–6 (2–13) 7.94±9.72–5.50 (2–41) 0.5309 Postoperative hospitalization (days) 13.17±11.62–9 (2–65) 15.83±14.49–9 (4–65) 10.52±7.09–9 (2–34) 0.3066 SD: standard deviation; min: minimum; max: maximum; ICU: intensive care unit. There were five deaths (7.94%) among the 63 patients, two in the transhiatal group and three in the videothoracoscopy group (p=0.6562, p>0.05), already adjusted for sex and age. DISCUSSION There are, in clinical practice in intensive care, two main categories of scores: SOFA, which synthesizes physiological de rangements by organs and provides an objective assessment of the extent and severity of dysfunction. It comprises six organ systems, with 0 to 4 points assigned according to the degree of dysfunction, also based on laboratory tests. Although it was created to describe morbidity, a correlation between SOFA score and mortality was observed through retrospective analy sis of the European/North American Study of Severity System database, which indicated good correlation of the score with survival, as well as good distribution of patients among differ ent score values  15 34 Daily scores can be calculated and used to describe the de gree of organ dysfunction during a patient’s ICU stay, in contrast to prognostic systems designed to give a prediction based mainly on the time of ICU admission  15 44 The other main category is the disease severity prognos tic model, evaluated by APACHE and SAPS, which employs vital physiological data and information related to the nature of the current disease at the time of ICU admission to predict the probability of death. The APACHE II score was presented more than 35 years ago, in 1985, using data from 5,815 pa tients hospitalized between 1979 and 1982 in 13 hospitals in the United States. It was developed to estimate disease severity and predict hospital mortality, both for deaths occurring in the ICU and for those occurring in wards after ICU discharge. For its calculation, the worst values of laboratory tests in the first 24 h of ICU hospitalization, age, and chronic diseases pri or to ICU admission should be considered  15 24 31 34 40 The SAPS III score was developed using data from 303 ICUs and 16,784 patients. It is composed of 20 different variables of laboratory tests and vital data, easily measurable in the first hour of patient admission to the ICU. For each of the analyzed variables, a weight is assigned according to the severity of the physiological disturbance. Theoretically, the lowest value attributed by the score is 16, and the highest is 217 points. The physiological variables that compose the acute physiological score are temperature, systolic blood pressure, heart and respiratory rate, blood oxygenation, arterial pH, sodium, potassium, creatinine, bilirubin, hematocrit, leukocytes, platelets, and Glasgow coma scale  31 34 40 However, the SAPS III system was not developed to be representative of all types of patients, especially in specific ar eas or individual types of diseases, as it was designed for the general ICU population. The SAPS III model prediction is based exclusively on data evaluated within the first hour of ICU admission  34 The consulted literature is poor in comparing the perfor mance of prognostic scores of patients undergoing two distinct surgical techniques for esophagectomy, transhiatal and video thoracoscopy. In this research, no statistically significant differences were observed between the two groups when comparing prognostic scores. The physiological variables of the three scores are composed of laboratory data and vital signs. Creatinine, a variable used in all three scores, changes above normal limits only when glomerular function is below 50%; diuresis is affected in even later stages of renal failure  13 15  13 40 44  13 22 31 40 44 Unlike other parameters, the Glasgow coma scale score to be used is the best value in APACHE II. In patients using sedatives, it is considered normal, thus disregarding the extubation difference between subgroups  24  40 This study did not record a statistically significant difference regarding the number of patients who used VADs intraoperatively. The age difference between patients undergoing the two esophagectomy techniques did not affect the scores, since both are within the same age scoring range. Additionally, patients admitted for elective surgery receive the same scoring value if there are chronic conditions. The comorbidity profile of the two subgroups is similar, considering that patients with important comorbidities are not candidates for esophagectomy  12 14 16 The cardiorespiratory repercussions described in the introduction are greater in patients undergoing thoracotomy in left lateral decubitus, and selective ventilation. Even such alterations are reversed intraoperatively with reestablishment of ventilation in both lungs. Pressure lability and arrhythmias that occur during mediastinal manipulation in transhiatal esophagectomy are also reversed as manipulations cease  6 9 14 16 33 A study conducted by Yatabe et al., evaluating a sample of 15 patients undergoing minimally invasive esophagectomy (cervical lymphadenectomy, thoracoscopy, and laparoscopy), with thoracic dissection in the prone position and selective ventilation, observed an APACHE II admission score of 13±4 and a SOFA score of 2±1. The sample mean age was 66±10 years, which could justify the higher APACHE II score. The surgical (605 min) and anesthetic (668 min) times described were longer than those found in this research. However, the surgical technique employed by the authors was totally minimally invasive  45 Mitaka et al.  32 Arméstar et al.  2 Park et al., analyzing 7227 patients admitted to ICUs between 1995 and 2007 in the United Kingdom after elective esophagectomy for cancer, recorded that the mean APACHE II score was 13.8, with a population with a mean age of 64 years  37 The longer surgical time in the videothoracoscopy group (mean of 373.13 min) and anesthetic time (mean of 467.97 min), compared to the transhiatal group (310.32 and 385.65 min, respectively) determined the lower extubation rate: 9.37% in the videothoracoscopy group versus 51.16% in the transhiatal group, extubated at the end of the procedure by the anesthetic team (p=0.0022, p<0.05). This fact was also reflected in the pO 2 Compared to transhiatal esophagectomy, videothoracoscopy adds important operative time due to patient positioning, decubitus change, and meticulous mediastinal dissection. Comparing transhiatal dissection with thoracotomy, Márton et al., in a retrospective study, observed longer operative time in thoracotomy; however, without differences regarding transfusion need and mortality. Also, they observed no differences regarding serum procalcitonin dosage and microalbuminuria or inflammatory response markers in the early postoperative period  30 Schoppmann et al. retrospectively compared 31 patients undergoing videothoracoscopic esophagectomy in left lateral decubitus with 31 patients undergoing thoracotomy, with selective ventilation in both groups. They observed fewer transfused patients, a lower incidence of pneumonia, shorter mechanical ventilation time, and shorter ICU and hospital stay times in the videothoracoscopy group  38 Kanekiyo et al. evaluated 85 patients undergoing videothoracoscopic esophagectomy in the prone position and selective ventilation, with abdominal time by videolaparoscopy, and 104 patients undergoing esophagectomy by thoracotomy in the left lateral decubitus and laparotomy. They observed longer surgical time, less bleeding, shorter postoperative stay, and fewer pulmonary complications in videothoracoscopy. Disease-free survival at 5 years and overall survival showed no statistically significant differences  21 Li et al. made a retrospective analysis of 38 patients undergoing videothoracoscopic esophagectomy in the left lateral decubitus and selective ventilation, comparing them with 21 patients undergoing videothoracoscopy in the prone position, with non-selective ventilation and pneumothorax. No differences were observed regarding blood loss, intraoperative respiratory parameters, or postoperative pain scores. Thoracoscopy in the prone position showed shorter thoracic surgical time and shorter ICU stay  26 Jínek et al.  20  11 CONCLUSIONS The study showed no differences between the two studied groups in prognostic score performance, studied operative parameters, ICU stay and hospital stay times, and perioperative mortality, in agreement with literature findings. Transhiatal esophagectomy is a technique that emerged with the objective of reducing pulmonary morbidity caused by thoracotomy. Recently, the advent of minimally invasive techniques in video-assisted esophagectomies brought the same benefits as thoracotomy, offering greater safety in mediastinal dissection under direct vision and allowing more adequate lymphadenectomy, in addition to mitigating the physiological repercussions of thoracotomies. Financial source: DATA AVAILABILITY The Information regarding the investigation, methodology, and data analysis of the article are archived under the responsibility of the authors. HOW TO CITE THIS ARTICLE Ferrer JAP, Tercioti Junior V, Falcão ALE, Coelho Neto JS, Macedo AAC, Andreollo NA, et al. APACHE II, SOFA, and SAPS III after transhiatal and thoracoscopic in prone position esophagectomy for esophageal cancer: a single-center retrospective cohort analysis. ABCD Arq Bras Cir Dig. 2025;38:e1897. https://doi.org/10.1590/0102-67202025000028e1897. REFERENCES 1 Alves IPF Tercioti V Junior Coelho JS Neto Ferrer JAP Carvalheira JBC Pereira EB Neoadjuvant chemoradiotherapy followed by transhiatal esophagectomy in locally advanced esophageal squamous cell carcinoma: impact of pathological complete response Arq Bras Cir Dig 2022 34 3 e1621 10.1590/0102672020210002e1621 35019133 PMC8735162 2 Arméstar F Mesalles E Font A Arellano A Roca J Klamburg J Serious postoperative complications after esophagectomy for esophageal carcinoma: analysis of risk factors Med Intensiva 2009 33 5 224 32 10.1016/s0210-5691(09)71756-5 19624996 3 Avery KN Metcalfe C Berrisford R Barham CP Donovan JL Elliott J The feasibility of a randomized controlled trial of esophagectomy for esophageal cancer--the ROMIO (Randomized Oesophagectomy: Minimally Invasive or Open) study: protocol for a randomized controlled trial Trials 2014 5 200 10.1186/17456215-15-200 PMC4084574 24888266 4 Biere SSAY Cuesta MA van der Peet DL Minimally invasive versus open esophagectomy for cancer: a systematic review and meta-analysis Minerva Chir 2009 64 2 12133 19365313 5 Boshier PR Anderson O Hanna GB Transthoracic versus transhiatal esophagectomy for the treatment of esophagogastric cancer: a meta-analysis Ann Surg 2011 254 6 894 906 10.1097/SLA.0b013e3182263781 21785341 6 Briez N Piessen G Torres F Lebuffe G Triboulet JP Mariette C Effects of hybrid minimally invasive oesophagectomy on major postoperative pulmonary complications Br J Surg 2012 99 11 1547 53 10.1002/bjs.8931 23027071 7 Burdall OC Boddy AP Fullick J Blazeby J Krysztopik R Streets C A comparative study of survival after minimally invasive and open oesophagectomy Surg Endosc 2015 29 2 431 7 10.1007/s00464-014-3694-4 25125095 8 Chang T Hsiao PN Tsai MY Huang PM Cheng YJ Perioperative management and outcomes of minimally invasive esophagectomy: case study of a high-volume tertiary center in Taiwan J Thorac Dis 2018 10 3 1670 6 10.21037/jtd.2018.01.147 29707319 PMC5906220 9 Cuesta MA Biere SSAY van Berge Henegouwen MI van der Peet DL Randomised trial, Minimally Invasive Oesophagectomy versus open oesophagectomy for patients with resectable oesophageal cancer J Thorac Dis 2012 4 5 462 4 10.3978/j.issn.20721439.2012.08.12 23050108 PMC3461077 10 Dantoc M Cox MR Eslick GD Evidence to support the use of minimally invasive esophagectomy for esophageal cancer: a meta-analysis Arch Surg 2012 147 8 768 76 10.1001/archsurg.2012.1326 22911078 11 Deo KB Singh H Gupta V Das A Verma GR Gupta R Thoracoscopy-assisted esophagectomy vs transhiatal esophagectomy for carcinoma esophagus: a prospective comparison of short-term outcomes J Gastrointest Cancer 2022 53 2 333 40 10.1007/s12029021-00607-z 33629171 12 Dhungel B Diggs BS Hunter JG Sheppard BC Vetto JT Dolan JP Patient and peri-operative predictors of morbidity and mortality after esophagectomy: American College of Surgeons National Surgical Quality Improvement Program (ACS-NSQIP), 2005-2008 J Gastrointest Surg 2010 14 10 1492 501 10.1007/s11605010-1328-2 20824375 13 Dias AT Matta PO Nunes WA Severity indexes in an adult intensive care unit: clinical evaluation and nursing work Rev Bras Ter Intensiva 2006 18 3 276 81 10.1590/S0103-507X2006000300010 25310442 14 Dumont P Wihlm JM Hentz JG Roeslin N Lion R Morand G Respiratory complications after surgical treatment of esophageal cancer. A study of 309 patients according to the type of resection. Eur J Cardiothorac Surg 1995 9 10 539 43 10.1016/s10107940(05)80001-6 8562096 15 Falcão ALE Barros AGA Bezerra AAM Ferreira NL Logato CM Silva FP The prognostic accuracy evaluation of SAPS 3, SOFA and APACHE II scores for mortality prediction in the surgical ICU: an external validation study and decision-making analysis Ann Intensive Care 2019 9 1 18 10.1186/s13613-019-0488-9 30701392 PMC6353976 16 Ferguson MK Durkin AE Preoperative prediction of the risk of pulmonary complications after esophagectomy for cancer J Thorac Cardiovasc Surg 2002 123 4 661 9 10.1067/mtc.2002.120350 11986593 17 Fonseca S Ramos IGS Maegawa FAB Uson PLS Junio Tustumi F Variables related to locoregional and distant recurrence in esophageal cancer Arq Bras Cir Dig 2025 38 e1889 10.1590/010267202025000020e1889 40767665 PMC12324769 18 Gemmill EH McCulloch P Systematic review of minimally invasive resection for gastro-oesophageal cancer Br J Surg 2007 94 12 1461 7 10.1002/bjs.6015 17973268 19 Iwahashi M Nakamori M Nakamura M Ojima T Katsuda M Iida T Clinical benefits of thoracoscopic esophagectomy in the prone position for esophageal cancer Surg Today 2014 44 9 1708 15 10.1007/s00595-013-0782-3 24254061 20 Jínek T Adamcik L Duda M Skrovina M Hybrid thoracoscopic esophagectomy for cancer – retrospective analysis and comparison with transhiatal resection Rozhl Chir 2018 97 7 320 7 30442013 21 Kanekiyo S Takeda S Tsutsui M Nishiyama M Kitahara M Shindo Y Low invasiveness of thoracoscopic esophagectomy in the prone position for esophageal cancer: a propensity score-matched comparison of operative approaches between thoracoscopic and open esophagectomy Surg Endosc 2018 32 4 1945 53 10.1007/s00464-017-5888-z 29075967 22 Keegan MT Soares M What every intensivist should know about prognostic scoring systems and risk-adjusted mortality Rev Bras Ter Intensiva 2016 28 3 264 9 10.5935/0103-507X.20160052 27737416 PMC5051184 23 Khan O Nizar S Vasilikostas G Wan A Minimally invasive versus open oesophagectomy for patients with oesophageal cancer: a multicentre, open-label, randomised controlled trial J Thorac Dis 2012 4 5 465 6 10.3978/j.issn.2072-1439.2012.08.16 23050109 PMC3461074 24 Knaus WA Draper EA Wagner DP Zimmerman JE APACHE II: a severity of disease classification system Crit Care Med 1985 13 10 818 29 3928249 25 Kozlow JH Berenholtz SM Garrett E Dorman T Pronovost PJ Epidemiology and impact of aspiration pneumonia in patients undergoing surgery in Maryland, 19992000 Crit Care Med 2003 31 7 1930 7 10.1097/01.CCM.0000069738.73602.5F 12847385 26 Li NL Peng WL Liu CC Shih CH Comparison of the short-term postoperative results of prone positioning and lateral decubitus positioning during thoracoscopic esophagectomy Wideochir Inne Tech Maloinwazyjne 2015 10 1 37 43 10.5114/wiitm.2015.48698 25960791 PMC4414103 27 Luketich JD Alvelo-Rivera M Buenaventura PO Christie NA McCaughan JS Litle VR Minimally invasive esophagectomy: outcomes in 222 patients Ann Surg 2003 238 4 486 94 discussion 494-5 10.1097/01.sla.0000089858.40725.68 14530720 PMC1360107 28 Maas KW Bierre SSAY van Hoogstraten IMW van der Peet DL Cuesta MA Immunological changes after minimally invasive or conventional esophageal resection for cancer: a randomized trial World J Surg 2014 38 1 131 7 10.1007/s00268-013-2233-0 24101016 29 Maas KW Cuesta MA van Berge Henegouwen MI Roig J Bonavina L Quality of life and late complications after minimally invasive compared to open esophagectomy: results of a randomized trial World J Surg 2015 39 8 198693 10.1007/s00268-015-3100-y PMC4496501 26037024 30 Márton S Szakmány T Papp A Cseke L Horváth PO Does transthoracic compared to transhiatal resection alter the early postoperative course of oesophagectomy? Dis Esophagus 2005 18 3 155 9 10.1111/j.1442-2050.2005.00479.x 16045576 31 Metnitz PGH Moreno RP Almeida E Jordan B Bauer P Campos RA SAPS 3--from evaluation of the patient to evaluation of the intensive care unit. Part 1: objectives, methods and cohort description Intensive Care Med 2005 31 10 1336 44 10.1007/s00134005-2762-6 16132893 PMC1315314 32 Mitaka C Ishibashi C Kawagoe I Hashimoto T Takahashi M Satoh D Correlation between urinary biomarker and organ failure in patients with sepsis and patients after esophagectomy: a prospective observational study J Intensive Care 2020 8 11 10.1186/s40560020-0428-7 31988752 PMC6969466 33 Molena D Mungo B Stem M Lidor AO Incidence and risk factors for respiratory complications in patients undergoing esophagectomy for malignancy: a NSQIP analysis Semin Thorac Cardiovasc Surg 2014 26 4 287 94 10.1053/j.semtcvs.2014.12.002 25837540 34 Moreno RP Metnitz PGH Almeida E Jordan B Bauer P Campos RA SAPS 3--from evaluation of the patient to evaluation of the intensive care unit. Part 2: development of a prognostic model for hospital mortality at ICU admission Intensive Care Med 2005 31 10 1345 55 10.1007/s00134-005-2763-5 16132892 PMC1315315 35 Murthy SC Law S Whooley BP Alexandrou A Chu KM Wong J Atrial fibrillation after esophagectomy is a marker for postoperative morbidity and mortality J Thorac Cardiovasc Surg 2003 126 4 1162 7 10.1016/s0022-5223(03)00974-7 14566263 36 Nagpal K Ahmed K Vats A Yakoub D James D Ashrafian H Is minimally invasive surgery beneficial in the management of esophageal cancer? A meta-analysis Surg Endosc 2010 24 7 1621 9 10.1007/s00464-009-0822-7 20108155 37 Park DP Welch CA Harrison HA Palser TR Cromwell DA Gao F Outcomes following oesophagectomy in patients with oesophageal cancer: a secondary analysis of the ICNARC Case Mix Programme Database Crit Care 2009 13 Suppl 2 S1 10.1186/cc7868 PMC2791299 20003248 38 Schoppmann SF Prager G Langer FB Riegler FM Kabon B Fleischmann E Open versus minimally invasive esophagectomy: a single-center case controlled study Surg Endosc 2010 24 12 3044 53 10.1007/s00464-010-1083-1 20464423 39 Sgourakis G Gockel I Radtke A Musholt TJ Timm S Rink A Minimally invasive versus open esophagectomy: meta-analysis of outcomes Dig Dis Sci 2010 55 1 3031 40 10.1007/s10620010-1153-1 20186484 40 Silva JM Junior Malbouisson LMS Nuevo HL Barbosa LGT Marubayashi LY Teixeira IC Applicability of the simplified acute physiology score (SAPS 3) in Brazilian hospitals Rev Bras Anestesiol 2010 60 1 20 31 20169260 41 Smithers BM Gotley DC Martin I Thomas JM Comparison of the outcomes between open and minimally invasive esophagectomy Ann Surg 2007 245 2 232 40 10.1097/01.sla.0000225093.58071.c6 17245176 PMC1876975 42 Tercioti-Junior V Lopes LR Coelho-Neto JS Carvalheira JB Andreollo NA Esophagogastric junction adenocarcinoma: multivariate analyses of surgical morbi-mortality and adjuvant therapy Arq Bras Cir Dig 2012 25 4 22934 10.1590/s0102-67202012000400004 23411920 43 Verhage RJ Hazebroek EJ Boone J Van Hillegersberg R Minimally invasive surgery compared to open procedures in esophagectomy for cancer: a systematic review of the literature Minerva Chir 2009 64 2 135 46 19365314 44 Vincent JL Mendonça A Cantraine F Moreno R Takala J Suter PM Use of the SOFA score to assess the incidence of organ dysfunction/failure in intensive care units: results of a multicenter, prospective study. Working group on \"sepsis-related problems\" of the European Society of Intensive Care Medicine Crit Care Med 1998 26 11 1793 800 10.1097/00003246-199811000-00016 9824069 45 Yatabe T Kitagawa H Yamashita K Hanazaki K Yokoyama M Energy expenditure measured using indirect calorimeter after minimally invasive esophagectomy in ventilated postoperative patients Asia Pac J Clin Nutr 2014 23 4 555 9 10.6133/apjcn.2014.23.4.20 25516312 46 Zingg U McQuinn A DiValentino D Esterman AJ Bessell JR Thompson SK Minimally invasive versus open esophagectomy for patients with esophageal cancer Ann Thorac Surg 2009 87 3 911 9 10.1016/j.athoracsur.2008.11.060 19231418 ",
  "metadata": {
    "Title of this paper": "Minimally invasive versus open esophagectomy for patients with esophageal cancer",
    "Journal it was published in:": "Arquivos Brasileiros de Cirurgia Digestiva : ABCD",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12490266/"
  }
}