{
  "title": "Paper_1236",
  "abstract": "pmc Materials (Basel) Materials (Basel) 3169 materials materials Materials 1996-1944 Multidisciplinary Digital Publishing Institute  (MDPI) PMC12471921 PMC12471921.1 12471921 12471921 41010139 10.3390/ma18184295 materials-18-04295 1 Review Recent Advances in pH-Responsive Liposomes: Lessons Learnt and New Directions in Nanomedicine Development Tsirogianni Antonia Georgia Chountoulesi Maria * https://orcid.org/0000-0002-1197-9010 Pippa Natassa * Baldino Lucia Academic Editor Section of Pharmaceutical Technology, Department of Pharmacy, School of Health Sciences, National and Kapodistrian University of Athens, Panepistimioupolis Zografou, 15771 Athens, Greece; angetsirogianni@gmail.com * mchountoules@pharm.uoa.gr natpippa@pharm.uoa.gr 13 9 2025 9 2025 18 18 496812 4295 21 7 2025 04 9 2025 10 9 2025 13 09 2025 27 09 2025 29 09 2025 © 2025 by the authors. 2025 https://creativecommons.org/licenses/by/4.0/ Licensee MDPI, Basel, Switzerland. This article is an open access article distributed under the terms and conditions of the Creative Commons Attribution (CC BY) license ( https://creativecommons.org/licenses/by/4.0/ The development of pH-responsive liposomes represents a promising strategy for targeted drug delivery, enhancing therapeutic efficacy while minimizing toxicity and side effects. These innovative nanocarriers are typically synthesized via the thin film hydration method and can be further modified to exhibit stimuli-responsive behavior. pH-responsive liposomes are biocompatible, biodegradable, and capable of encapsulating both hydrophilic and hydrophobic drugs, increasing their versatility in drug delivery. In this mini-review, we explore the mechanism of action of pH-responsive liposomes, analyzing the factors that influence both their intracellular and extracellular behavior. Various formulations are examined, and their characteristics are compared to optimize therapeutic outcomes. Furthermore, we discuss the potential applications in anticancer therapy, in gene therapy, and in bacterial infections as vaccines and diagnostic agents. pH-responsive liposomes anticancer triggered release phospholipids gene therapy acid microenvironment tumor targeting This research received no external funding. pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement no pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes 1. Introduction Liposomes are advanced nanotechnology-based drug delivery systems that have revolutionized the way therapeutic agents are transported and delivered within the body. These amphipathic spherical vesicles, composed of phospholipid bilayers, have the ability to encapsulate both hydrophilic and hydrophobic drugs, allowing them to serve as versatile carriers for a wide range of therapeutic agents [ 1 2 3 Historically, in the late 1970s, after a fifteen-year-long observation of the “lipidic bubbles” by Alec D. Bangham, pH-responsive and other stimulus-responsive liposomes appeared in the literature ( Scheme 1 1 2 3 Scheme 1 4 5 6 The aim of this mini-review is to present the advantages of pH-responsive liposomes and to highlight their added value in the field of pharmaceutical technology. Their usage for delivery of antitumor Active Pharmaceutical Ingredients (APIs) makes them ideal drug delivery platforms by minimizing the adverse reactions, leading to an increased therapeutic index. Special attention is also given to other applications in the field of nanomedicines, such as vaccine development and infectious diseases. 2. Methods The literature search was conducted in the PubMed and Google Scholar databases using the keywords “pH-responsive liposomes” between 2020 and 2025 (the total number of papers is 51) ( Scheme 2 3. Recent Advances in pH-Responsive Liposomes These liposomal formulations can be classified based on their application and the type of drug or active compound they encapsulate, as different therapeutic agents require specific formulations for optimal efficacy. These categories include chemotherapeutic or other drugs for cancer treatment, gene and RNA therapeutics for targeted genetic interventions, antibiotics for bacterial infections, immunogenic agents for vaccine development, and diagnostic agents. 3.1. Structural Properties of pH-Responsive Liposomes 3.1.1. Formulation Approaches First, a more in-depth investigation into the mechanism of action of pH-sensitive liposomes is required and has been conducted by numerous researchers exploring various factors that could influence the behavior of these liposomes in targeted environments. Ashrafizadeha et al. used various examples of different APIs, such as doxorubicin, siRNA, SN25860, oleanolic acid, and ursolic acid, encapsulated in liposomes with a high entrapment efficacy, and demonstrated rapid drug release in the tumor’s acidic environment and efficient endosomal escape. Common materials used for the synthesis of each liposomal formulation include peptide H7K(R2)2, PEGylated lipids, OA, HA, folate, glycidol, and malachite green leuco derivatives (MG-Xs). These liposomes are proposed for treating multiple cancer types, including gliomas, colorectal tumors, and cervical, pancreatic, and breast cancer cells [ 5 3.1.2. Influence of Lipids and PEG Liposomes were developed using the thin film hydration method with materials such as Dioleoylphosphatidylethanolamine (DOPE), Cholesteryl hemisuccinate (CHEMS), Distearoylphosphatidylethanolamine DSPE, dipalmitoylphosphatidylethanolamine DPPE, EYPC, Dipalmitoylphosphatidylcholine DPPC, cholesterol (CHOL), PC, PE, PEG-phospholipids, Hz bonds, and several polymers and copolymers. Additionally, various peptides (CPP, cRGDfK, lysine, cysteine, SKDEEWHKNNFPLSP), orthoester nucleoside lipids, and PEPC were used. Nevertheless, the interactions with serum proteins have not yet been studied [ 4 7 6 8 3.1.3. Encapsulation Efficiency and Trends In a more profound study into liposomal formulation, Naziris et al. analyzed the physiochemical characteristics of pH-responsive chimeric liposomes. In order to evaluate the lyotropic and thermotropic behavior, size and ζ-potential, polydispersity, pH responsiveness, and protein interactions, they developed liposomes using HSPC, PDMA-b-PLMA (70–30 {1} and 58–42 {2}), and (9:0.1 and 9:0.5) via the thin film hydration method. These formulations displayed size ranges (Dh = 75.4 to 189.1 nm) and ζ-potential variations (−0.27 to 19.3 mV) corresponding to dispersion medium, biomaterial concentration, and pH adjustment. The liposomes showed high stability, low PDI, pH-triggered drug release, and low in vivo toxicity, indicating their potential for clinical applications as drug delivery systems. However, further studies are required for scale-up and clinical trials [ 9 10 11 Lado-Touriño et al. investigated the role of (F)2-(imidazol-1-yl)succinic acid (ISUCA), pH-sensitive lipids incorporated in liposomes. For this purpose, they used PE, PC, PS, or OA, Palmitoyl-oleoyl-phosphatidylcholine POPC, and ISUCA to form liposomes with ISUCA, ISUCA-2Ol, ISUCA-2Pal, and ISUCA-Pal-Ol through coarse-grained molecular dynamics simulations (MARTINI forcefield). Their mechanism of action focuses on destabilizing the liposomal bilayers under acidic conditions, enabling pH- responsive drug release. In greater detail, these lipids have the ability to increase the area per lipid and diffusion coefficients while decreasing hydrophobic thickness and the order parameter. Furthermore, chemically, ISUCA functions as a hydrophilic head group that becomes protonated in acidic environments. This protonation destabilizes the liposomal membrane, triggering drug release, following the mechanism of action of pH-responsive liposomes. Additional research exploring their stability in physiological environments, biocompatibility, and interactions with blood proteins should be conducted [ 12 13 2 14 15 16 17 3.2. Recent Developments in pH-Responsive Liposomes for Applications in Pharmaceutical Nanotechnology 3.2.1. Cancer Nanotherapeutics pH-responsive liposomes are predominantly utilized in cancer treatment thanks to their unique mechanism of action, which reduces the risk of chemotherapeutic agents that are associated with high systemic toxicity. Several researchers have studied their formulations and potential use while making alterations to enhance their therapeutic efficacy. Nunes et al. developed folate-coated pH-sensitive liposomes for tumor-targeted drug delivery. The liposomes, composed of DOPE, CHEMS, and DSPE-PEG2000 (5.8:3.7:0.45:0.05) and DOPE, CHEMS, DSPE-PEG2000, and DSPE-PEG2000-Fol (5.8:3.7:0.45:0.05), were prepared using lipid film hydration and extrusion methods for size reduction. The prepared formulations showed sizes around 160 nm with low polydispersity and neutral z-potential. Encapsulating the anticancer drug irinotecan at high rates, around 60% (encapsulation efficiency EE = 62.3 ± 0.9%, loading capacity LC = 6.2 ± 0.1%) this formulation is proposed for colorectal cancer therapy. The authors proved controlled release in the tumor’s acidic environment, indicating higher release rates at lower pH. Further investigation is needed, as it shows potential for clinical trials in other types of cancer [ 18 19 w w 20 21 22 w w 23 24 25 26 27 28 3 2+ 29 w w 30 w w 31 32 33 Huang et al., trying to enhance the activity of liposomal drugs against solid tumors, prepared three novel lipids that carry imidazole-based headgroups of incremental basicity that were incorporated into the membrane of PEGylated liposomes containing doxorubicin (DOX) to render pH-sensitive convertible liposomes. The imidazole lipids were designed to protonate and cluster with negatively charged phosphatidylethanolamine-polyethylene glycol when pH decreases from 7.4 to 6.0, thereby triggering enhanced DOX release ( Figure 1 34 pH-responsive liposomes were also designed, aiming to address various challenges in cancer therapy, including enhancing the efficiency of sonodynamic therapy (SDT) and reducing systemic toxicity. A major drawback of SDT is its reduced efficacy in the hypoxic tumor microenvironment as an oxygen-dependent therapy. Zhang et al. proposed a formulation composed of DPPC, cholesterol, and DSPE-PEOz2000 (12:4:4) that reduces oxygen consumption and attenuates hypoxia-induced resistance to SDT. The liposomes were prepared using the thin film hydration method and were loaded with an API (IR780) as a sonosensitizer and metformin, an antihyperglycemic drug, as the SDT enhancer. They exhibited a diameter of approximately 200 m, a negative surface charge, and were well-dispersed and homogeneous ( Figure 2 35 Similarly, a concerning complication with dermaseptin-PP (65) in anticancer lung therapy is the elevated risk of hemolysis. Wang et al. addressed this by developing a novel formulation to encapsulate this a-helix anticancer peptide, aiming to enhance efficacy and reduce the risk of hemolysis. Using the thin-film hydration method, liposomes composed of cholesterol, DSPE-Hyd-PEG2k (25:10), lecithin, and DSPE were constructed with a diameter of approximately 97 nm, a ζ-potential of 7 mV, and a PDI of 0.15, indicating uniformity in size distribution and stability. The drug was loaded, achieving adequate encapsulation efficiency and loading capacity (EE = 86%, LC = 7%). Notably, cellular uptake increased significantly at pH 5 compared to pH 7.4, highlighting the system’s potential for targeted drug release in acidic tumor environments. The only limitation that requires further investigation is scalability [ 36 Figure 3 37 Through another groundbreaking approach, Liu et al. introduce pH-sensitive azidosugar liposomes coated with a natural cancer-cell membrane, offering a novel approach to tumor-selective glycan engineering. These nanoparticles were formulated with DSPE-PEG-NH2, DOPE (1:1), and N-azidoacetylgalactosamine tetraacylated (Ac4GalNA), via the thin film hydration method. With a small size (Dh = 164 nm) and negative ζ-potential, they effectively encapsulated rhodamine B and exhibited pH-dependent release. Thoroughly, the drug’s release rate nearly tripled at an acidic pH compared to a basic pH after 12 h. These characteristics enhance tumor selectivity by reducing protein corona formulation and promoting efficient phagocytosis by macrophages, highlighting their potential as extracellular vesicles. However, concerns remain regarding the possibility of off-target effects on cancer cells, especially if some subtypes share the same biomarkers. Limitations associated with biopsies or surgical resections, such as patient discomfort and increased healthcare costs, persist [ 38 w w 39 40 41 42 In line with this, Ding et al. developed pH-sensitive liposomal nanocarriers for anticancer therapy, evaluating them in vivo and in vitro. Liposomes, composed of egg PC, CHEMS, and CHOL (33:13:5), were prepared via the film hydration technique and then modified with single-stranded DNA aptamer AS1411 and gold nanoparticles. They were loaded with morin hydrate, achieving high encapsulation efficiency, a large hydrodynamic diameter, and a positive ζ-potential. This novel formulation exhibited pH-responsive drug release, enhancing targeted delivery and therapeutic efficacy. Notably, morin hydrate release was fivefold higher in the tumor’s acidic microenvironment compared to alkaline conditions. Despite its promising results, limitations include difficulty in large-scale production and high associated costs [ 43 w w 44 45 Cancer stem-like cells (CSLCs) are one of the main problems in tumor treatment owing to high tumorigenicity and chemotherapy resistance. Ba et al. synthesized a novel mitochondria-targeted derivative, triphentlphosphonium-resveratrol (TPP-Res), and simultaneously encapsulated it with doxorubicin (Dox) in pH-sensitive liposomes to reverse chemotherapeutic resistance of CSLCs ( Figure 4 46 Some representative examples of the above-described pH-sensitive targeting strategies of liposomes used in anticancer therapy are illustrated in Figure 4 A summary of the aforementioned literature case studies regarding the treatment of cancer is also presented in Table 1 3.2.2. Gene Delivery and Targeting pH-responsive liposomes have emerged as a promising tool in gene therapy due to their ability to deliver specific therapeutic agents. Ramírez-Acosta et al. developed nanobioconjugates/magneto-liposomes, composed of soy lecithin, chloroform, and magnetite/silver-pDMAEMA-PEA-BUFII, that could function as pH-responsive polymeric vehicles for the transport and release of circular DNA. The formulation process involved lipid bilayer hydration and sonication, yielding large, uniform liposomes with high stability, suitable for drug delivery. Encapsulation of 3 μg of DNA demonstrated a low but effective loading capacity, with release occurring in a pH- triggered manner. However, delivery efficiency remained limited, at 8.1%, underscoring the need for further optimization at both pre-clinical and clinical scales [ 47 w w 48 materials-18-04295-t001_Table 1 Table 1 pH-responsive liposomes intended for anticancer treatment. Formulation API Therapeutic Indication Preparation Protocol EE Characteristics Release Profile Added Value Reference DOPE, CHEMS, DSPE-PEG2000 cisplatin cancer thin-film hydration EE = 61.23 ± 1.98% Dh = 191.2 ± 1.67 nm Korsmeyer- Peppas model, anticancer therapy [ 8 DOPE, CHEMS, DSPE-PEG2000/DSPE-PEG2000-Fol irrinotecan colorectal cancer lipid film hydration, size calibration (extrusion) EE = 62.3 ± 0.9 % Dh = 165.2 ± 3.1 nm Controlled release in tumor’s acidic environment folate-coated pH-sensitive liposomes for anticancer therapy (colorectal cancer) [ 18 DPPC, DSPE-PEG-NH2, /CHEMS, PEG bis(amine), Folate doxycycline and docetaxel non-small cell lung cancer thin-film hydration EE = 60.1 ± 1.1% Dh = 82.2 ± 2.4 nm Targeting FRβ and controlled pH dependent drug release: FRβ-targeted pH-sensitive liposomes for early diagnosis and treatment of non-small cell lung cancer (NSCLC) [ 19 phosphatidylocholine (E80), DOPE, CHEMS, DSPE-PEG2000-COOH, folic acid and iRGD surface modifications fluorouracil breast cancer thin-film hydration EE = 93.1 ± 2.58% Dh = 152 ± 3.27 nm pH-triggered release at 24, 48 and 72 h: 5-Fluorouracil (5-FU)-loaded folic acid (FA) and iRGD (peptide) surface-modified pHLips (FA-iRGD-5-FU-pHLips) for breast cancer treatment [ 20 DPPC, cholesterol, DDAB, DG-CDP NH2-PEGylated gold nanoparticles ovarian cancer cells thin-film hydration, extrusion EE = 78 ± 4 % Dh = 651 ± 9 nm zero order model, Peppas model or the Higuchi model, controlled release at acidic pH and hyperthermia conditions nanocarrier with a self-targeted component, a dual pH/thermo- [ 22 DOPE, CHEMS, DSPE-PEG2000 and DSPE-PEG2000-DVar7 doxorubicin highly malignant tumors thin-film hydration and filtration EE = 93% Dh = 130 nm pH triggered release in acidic environment, at pH = 5.3 the drug’s release was five times higher than at pH = 7.4, prolonged drug release DVar7 peptide-based dual pH-responsive liposome with acidity regulation (injection of glycose in tumor environment) for anticancer therapy—in vivo experiments/potential usage in more malignant tumor models [ 23 DOPE, CHEMS, DSPE-PEG2000/HSPC Doxorubicin, cervical cancer lipid film hydration, extrusion, ultracentrifugation   SpHL-DOX has a faster intracellular release when compared to nSpHL-DOX but promoted sustained release if compared to free-DOX mechanism of intracellular release from pH-sensitive liposomes using cervical cancer HeLa cells (viability, internalization, intracellular trafficking and delivery) +cell death mechanism/ [ 24 DOTAP and cholesterol all-trans retinoic acid (ATRA) lung cancer thin-film hydration method, ultracentrifugation, extrusion EE = 93.7 ± 3.6% Dh = 231 ± 2.35 nm gradual/steady release kinetics cationic pH-responsive liposome for anticancer therapy [ 25 EPC, PDMAEMA-b-PLMA TRAM-34 glioblastoma thin-film hydration method EE1 = 73% 1 (9:0.5:1.75): pH-responsive drug release, pH-responsive liposomes for the treatment of glioblastoma [ 26 DOPE, DSPE-PEG2000, CHEMS pirfenidone idiopathic pulmonary fibrosis ammonium sulfate gradient method, calcium acetate gradient method EE = 86.65 ± 1.36% Dh = 106.6 ± 1.36% rapid release at acidic pH, 80% of the drug was released during 24 h, long-lasting release, the action time of drug could be prolonged by PSLs pH-sensitive PEGylated liposome [ 27 PC and 3-methylglutarylated-dextran residues (Mglu-Dex) sorafenib and hemin antigen delivery and immune modulation     pH-sensitive hybrid liposomal vesicle (liposomes +amphiphilic dendrimers for TME, [ 28 DOPA, DSPE-PEG5000 and carbonic anydrase inhibitor coating carbonic anhydrase inhibitor (CAI) anticancer immunotherapy one pot method, thin film dispersion–membrane extrusion technique EE = 61.7 ± 1.1% Dh = 115.5 ± 14.0 nm at pH = 5.8 2+ 2+ pH-responsive liposome-coated carbonic anhydrase inhibitor (CAI)-loaded calcium carbonate nanoparticle in anticancer radio-immunotherapy as it causes calcium death and strengthen the immune responses [ 29 CHEMS, DSPE-mPEG2000-COOH, DOPE RA-V, PD-A/PD-L1 inhibitor colorectal cancer therapy thin film hydration method, ultrasonic treatment, extrusion EE = 80.1% (for RA-V) Dh = 192.46 ± 7.91 nm controlled drug release in the intracellular acidic environments Liposome in anti-tumor immunity as cancer cell camouflage [ 30 lecithin and PEG-OE-L Chlorine e6 (Ce6), paclitaxel and doxorubicin many cancer types thin film ultrasonic dispersion method EE = 92.27% (for paclitaxel) and EE = 90.34% (for Ce6) Dh = 58.23 nm rapid drug release and enhanced endocytosis in a slightly acidic environment in light irradiation at 660 nm/ pH and photo dual-responsive liposomes for targeted anti-tumor activity [ 31 SN38-PA, LA-SN38 and Di-SN38-PC Moeixitecan, transferrin, TAT-PEG-SN38, survivin siRNA colon cancer film dispersion technique   prolonged release, reversible pH-dependent hydrolysis of lactone ring (at pH = 7.4 the lactone ring partially hydrolyzes to a carboxylate form without having any therapeutic effect, at pH = 9 the lactone ring is hydrolyzed and SN38 only exists in the carboxylate form) SN38-based drug delivery systems for anticancer therapy with stronger cytotoxicity [ 32 cholesterol, soy lecithin, DSPE-PEG2000, C18-TAT peptide and cinnamaldehyde Pt (IV) prodrug disuccinatocisplatin (DSCP) and cinnamaldehyde (CA) many cancer types lyophilization (DSCP),  Dh = 155 ± 3.6 nm CA release: TME-/+ pH-responsive liposome enhancing intracellular ROS activates the apoptotic pathway of tumor cells (synergistic strategy in anticancer therapy) [ 33 lipids that carry imidazole-based headgroups, phosphatidylethanolamine-polyethylene glycol doxorubicin solid tumors thin-film hydration, freeze–thaw cycles, extrusion EE = 89.86 ± 1.27 Dh = 128.1 ± 8.3 nm pH-triggered release, pH-sensitive PEGylated convertible liposomes with imidazole-based lipids (DHMI) [ 34 DPPC, cholesterol and DSPE-PEOz2000 IR780 as a sonosensitizer and metformin sonodynamic therapy (SDT) thin-film hydration LE = Dh = 220.193 nm metformin had a pH- triggered release: pH-responsive drug-loaded liposomes to reduce oxygen consumption, attenuate hypoxia-induced resistance to SDT, and improve the SDT [ 35 cholesterol, DSPE-Hyd-PEG2k, lecithin and DSPE dermaseptin-PP (65) lung cancer thin-film hydration EE = 86.26 ± 0.19% Dh = 96.78 ± 1.50 nm the cellular uptake increased with the decrease in pH (at pH = 5 was x2 higher than that at pH = 7.4 pH-responsive liposome encapsulates an a-helix anticancer peptide to enhance efficacy and reduce risk hemolysis in lung cancer [ 36 lecithin (egg yolk) and cholesterol, modified with ginsenoside and hyaluronic acid paclitaxel HCT-116 cells thin-film dispersion technique EE = 95.31 ± 1.41% Dh = 188.50 ± 0.40 nm rapid release within the first 5 h, followed by a slower release from the 5th to the 10th hour, ultimately stabilizing at the 12th hour/ ginsenoside compound K(CK)/HA—modified liposomes for anticancer therapy [ 37 DSPE-PEG-NH2, DOPE and N-azidoacetylgalactosamine tetraacylated (Ac4GalNA), Rhodamin as marker many cancer types thin-film hydration EE = 36.4% Dh = 164 nm pH triggered release: pH-responsive azidosugar liposomes camouflaged with natural cancer-cell membrane for tumor cell-selective glycan engineering (reduced protein corona formulation and admirable phagocytosis by macrophages) [ 38 DOPE, CHEMS, DSPC and mPEG2000-DSPE cytotoxin (CTX) many cancer types thin-film hydration EE = 51.78% Dh = 127.92 ± 3.75 nm sustained and controlled release in tumor acidic microenvironment, pH-responsive liposomes with high CTX load for targeted acidic stimuli release in tumor microenvironment [ 39 DOPE, CHEMS, cholesterol and pH-responsive peptide (DPRP) gene, siRNA, docetaxel, aptamers many cancer types thin-film hydration EE = 95.9 ± 0.52% Dh = 211.3 ± 1.6 nm the imine bond of DPRP exhibited a pH response in the tumor cell environment and maintained high stability under physiological conditions pH-responsive peptide (DPRP) anchored in liposome’s surface for anticancer therapy [ 40 DSPE-PEG2000, DOPE, CHEMS and PEI-elastase PD-L1 siRNA many cancer types thin-film hydration  Dh = 175.7 ± 10.2 nm higher release at pH = 6.5–7.0 PEI-elastase/PD-L1siRNA encapsulated in (PEG-modified) pH-sensitive liposomes for enhancing tumor immunogenicity and downregulating PD-L1 expression [ 41 DODAG, DOPC, cholesterol, MeO-PEG2000-DSPE and pH-responsive peptide (LAH4-L1) siRNA many cancer types lipid film hydration and five freeze–thaw cycles, extrusion EE > 90% Dh = 115 ± 10 nm  pH-responsive peptide (LAH4-L1) combined with PEGylated cationic liposome showed improved gene silencing efficiency in cells and general labeled siRNA tumor accumulation (after using focused ultrasound FUS) [ 42 egg PC, CHEMS and cholesterol, modified with single-stranded DNA aptamer AS1411 and gold nanoparticles Morin hydrate many cancer types film hydration EE = 89.6% Dh = 150 nm pH responsive drug release: 54% at pH = 5.0, 10% at pH = 7.4 pH-sensitive liposomes modified with single-stranded DNA aptamer AS1411 and gold nanoparticles for anticancer therapy (in vitro + in vivo) [ 43 PE, CHEMS and cholesterol, modified with hyaluronic acid P-gp siRNA and doxorubicin breast cancer ultrasonic hydration EE = 92.98% Dh = 210 nm GSH-dependent (6% to 62% as GSH ‘s concentration rose from 0 to 10 mM/redox sensitive behavior) + pH/redox dual responsive nanocarrier system (coated by lipid bilayer and modified with HA) as a siRNA delivery tool targeting breast cancer cells (to protect siRNA enzymatic degradation within the body and enable efficient delivery to target) [ 44 DPPC, DOPE, cholesterol, DSPE-PEG2000, oleic acid and Lissamine, with an anti-nucleolin aptamer γ-cyclodextrin with echinomycin breast and lung cancer thin-film hydration, lyophilization EE = 4.6 ± 0.53% Dh = 152 ± 11 nm pH triggered release: PEGylated pH-sensitive liposome with anti-nucleolin aptamer encapsulates γ-cyclodextrin with echinomycin (AptNCL-PEGLippH-ECgCD) in anticancer therapy [ 45 DOPE, HSPC, CHEMS and cholesterol triphentlphosphonium-resveratrol (TPP-Res), doxorubicin cancer stem-like cells thin-film hydration, ammonium sulfate gradient method, extrusion EE = 94.5 ± 0.32% for doxorubicin Dh = 165.2 ± 5.7 nm similar steady, sustained pH-responsive release: pH-responsive liposome combined with mitochondria-targeted derivate TPP-Res show effective endo-lysosomal escape, mitochondrial targeting by decreasing mitochondrial membrane potential, activating caspase, reducing ATP level and suppressing the Wnt/β-catenin pathway [ 46 3.2.3. Bacterial Infections Research by Deiss-Yehiely et al. and others has expanded the use of pH-responsive liposomes into bacterial infections, offering a breakthrough in biofilm-targeted drug delivery. On the one hand, using the thin film hydration method, liposomes composed of CHOL, DSPC, and DSPG (34:33:33) were formed and coated via the layer-by-layer technique with polycationic poly-L-lysine and polyanion 1–5. These polymers undergo rapid hydrolysis in acidic biofilm environments, converting the surface charge from negative to positive, enabling deeper biofilm penetration. The resulting pH-responsive nanocarriers loaded with tobramycin achieved great loading capacities targeted Pseudomonas aeruginosa infections. They exhibited small sizes (Dh = 117 nm), narrow polydispersity, and a large positive ζ-potential, enhancing drug delivery and biofilm penetration. These promising findings have yet to be explored for treating infections caused by other microbial species [ 49 2 St. aureus Myc. Tuberculosis 50 v v 51 3.2.4. Nanovaccines The applications of pH-responsive liposomes extend into vaccination strategies, as demonstrated by Szachniewicz et al., who explored their potential and developed pH-sensitive liposomes loaded with the triple fusion antigen protein Ag85B-ESAT6-Rv2034 (AER) for use in tuberculosis vaccination. The liposomes, created using the thin film hydration method, were composed of DOPC, EPC, DOPE, and DOBAQ (3:4:5:2). They demonstrated small particle sizes with narrow size distribution and a positive ζ-potential, which indicates a stable surface charge. This formulation showed the best stability and immune responsiveness as a promising vaccine. However, further research is required as regards CD4+ and CD8+ T-cell activation, B-cell responses, and the long-term effects of antigen dose and excipients on vaccine efficacy. Discrepancies with genetic knockout results and the single time point assessment also warrant further investigation into immune response dynamics and long-term protection [ 52 A summary of the aforementioned literature case studies regarding the treatment of infections and vaccination is also presented in Table 2 3.2.5. Diagnosis It is a well-accepted principle that faster diagnosis contributes to more favorable outcomes. In alignment with this, pH-responsive liposomes have been effectively utilized as advanced diagnostic tools. Kang and Park introduced an innovative portable, rapid, and sensitive method for detecting acetylcholine’s concentration with pH-sensitive liposomes. Using DPPC and DPGS (60:40) or pure DPPC, they synthesized liposomes through the thin film hydration method, achieving a uniform average size of 150 nm, with a distribution range of 130–170 nm and highly positive or negative ζ-potential. The resulting formulation encapsulated potassium ferricyanide, K3Fe[CN]6, which was released in a pH-triggered manner. Upon further analysis, the hydrolysis of Ach produced acetic acid and choline, reducing the pH value. This pH reduction destabilized the liposomes, triggering the release of potassium ferricyanide. However, concerns remain regarding the formulation’s resistance and proper storage conditions to maintain efficacy and prevent degradation over time. Last but not least, a compatible, user-friendly device should be designed for daily use to enable faster diagnosis and improve prognosis [ 53 v v 54 2 2 55 3.2.6. Other Applications Expanding the application of pH-responsive liposomes, Feng et al. investigated an innovative method to prevent the deterioration of blueberries during storage and transportation. They developed pH-sensitive liposomes covered in a film with controlled release properties and oxidation resistance. For this purpose, they used Tween-80, high-potency lecithin (PC), CHOL, and DPPH (CHOL/PC with 30 wt% and TP/CHOL-PC with 5 wt%), and through thin-film dispersion and drop-casting methods, liposomes with a diameter of approximately 810 nm and negative ζ-potential were constructed. Tea polyphenols (TP), sodium alginate (SA), and carboxymethylcellulose (CMC) were encapsulated (EE = 61%) into the resulting formulations and were released in a pH-triggered way (23.07% at pH = 6, 41.08% at pH = 3). This form of packaging shows great potential for applications in other fruits or vegetables and could be adapted for various produce types by integrating different polysaccharides and antioxidants, thyme, or oregano [ 56 4. Trends and Challenges for the Design and Development of pH-Responsive Liposomes 4.1. Formulation Trends As mentioned above, several techniques are used to design and develop pH-responsive liposomes. In the majority of cases, the thin-film hydration method is chosen for the laboratory preparation of pH-responsive liposomes since it is very easy. Sonication, extrusion through filters, and freeze–thaw are used as size reduction methods. Recently, hybrid polymer-grafted liposomes with pH-responsive drug release properties were formulated using controlled microfluidics. This technique gave the opportunity to control the crucial formulation parameters, including the flow rate ratio (FRR) and the total flow rate (TFR). FRR is of paramount importance for the collective injection speed of both phases through the microfluidic chip, while FTR is for the proportion between the aqueous and lipid phases. The microfluidic techniques increased the storage stability of the prepared systems for three months, which is very promising for the scale-up of the pharmaceutical formulation [ 57 58 59 60 61 In general, the current formulation strategies of the pH-sensitive liposomes are mostly directed to increase the precision of the targeting, with exploitation of many different categories of functional biomaterials, like peptides, antibodies, targeting ligands like folate, customized pH-sensitive polymers, etc., along with increasing their stealth properties and fine-tuning the triggers, for example, with PEGylation protective layers to balance their circulation longevity in acidic environments towards effective intracellular delivery. Furthermore, the combination of smart structural design strategies, like multi-component delivery vehicles and multi-layered or polymer-integrated liposomes that combine robustness with responsive release profiles, along with other stimuli-type modalities, like temperature sensitivity, are currently being investigated [ 62 PEGylation is a strategy to increase the circulation time of liposomes and imparts “stealth” properties but also influences the pH responsiveness [ 63 64 65 ® 63 64 65 On the other hand, PEGylation is also synonymous in some cases with accelerated blood clearance, formation of anti-PEG antibodies, hypersensitivity, and complement activation-related pseudoallergy [ 66 67 Table 1 68 4.2. Formulation Challenges The central formulation goal is to achieve pH responsiveness and the endosomal escape of the prepared liposomes. The conditions of the microenvironment of the cancer, which is synonymous with human cancers’ heterogeneous extracellular matrix, especially the pH, vary in the different types of tumors, making the studies of the formulation scientists quite challenging [ 69 70 71 5. Conclusions Stimuli-responsive drug delivery systems, like pH-responsive liposomes, have gained significant attention for their ability to enhance therapeutic efficacy while minimizing toxicity. The development of pH-responsive liposomes represents a promising strategy for carrying both drugs and natural compounds, particularly when combined with other nanocarriers such as gold nanocarriers or polymeric micelles, or when triggered by external stimuli like light, redox conditions, heat, ultrasound, or magnetic fields. Such approaches contribute to more targeted therapy, while PEGylation further prolongs circulation time, resulting in improved systemic stability and optimized therapeutic outcomes. These liposomes are formulated using the thin film hydration method, with lipids such as DOPE, CHEMS, CHOL, DPPC, DOBAQ, EPC, and DOPC. Commonly used solutions in this process include chloroform, methanol, and water in various ratios. The hydrodynamic diameter ranges from 100 nm to 200 nm, which is influenced by surface modifications in liposomal formulation such as aptamers or PEGylation. Their ζ-potential varies corresponding to pH alterations, remaining negative at neutral pH conditions and changing to positive in acidic pH. PEGylated liposomes tend to have more neutral ζ-potential (−5 to −28 mV) in contrast to cationic liposomes with positive charge (+20 to +50 mV). The polydispersity index remains close to zero, indicating a homogenous size distribution. Despite their advantages, pH-responsive liposomes face several limitations that hinder their clinical application. The limited number of in vivo studies complicates the research on their behavior in complex biological environments. Furthermore, the lack of clinical trials restrains their impact on different populations, giving insufficient information for their therapeutic profile and side effects. Moreover, dose alterations are not usually tested, which further complicates their applicability in personalized medicine, as they can significantly affect drug release, efficacy, and biocompatibility. Stability still remains a pressing concern, as the liposomal membrane may destabilize, provoking degradation, aggregation, or release of the therapeutic compound prematurely. Last but not least, scalability continues to be a challenge, as the production of uniform, stable-in-storage-and-distribution, industrial-scale pH-responsive liposomes could jeopardize safety and therapeutic efficacy. To the best of the authors’ knowledge, there are not any pH-responsive liposomes available in the market, except the vaccines for COVID-19, which use ionizable lipids [ 72 Disclaimer/Publisher’s Note: Author Contributions Conceptualization, M.C. and N.P.; investigation, A.G.T., M.C. and N.P.; writing—original draft preparation, A.G.T. and M.C.; writing—mini-review and editing, M.C. and N.P.; visualization, M.C.; supervision, N.P. All authors have read and agreed to the published version of the manuscript. Institutional Review Board Statement Not applicable. Informed Consent Statement Not applicable. Data Availability Statement No new data were created or analyzed in this study. Data sharing is not applicable to this article. Conflicts of Interest The authors declare no conflict of interest. Abbreviations The following abbreviations are used in this manuscript: CHEMS Cholesteryl hemisuccinate CHOL Cholesterol DCPM Dicetylphosphatemethylester DCPA Dicaproylphosphatidic acid DODAG Dioleoyl-dimethylammonium-glutaryl DOBA Dioleoylbenzylamidopropyl-quaternary ammonium DOPC Dioleoylphosphatidylcholine DOPE Dioleoylphosphatidylethanolamine DOTAP Dioleoyltrimethylammonium propane DPGS Dipalmitoylphosphatidylglycerol sodium salt DPPC Dipalmitoylphosphatidylcholine DPPE Dipalmitoylphosphatidylethanolamine DPPG Dipalmitoylphosphatidylglycerol DPPH Dipalmitoylphosphatidylhydrazide DSPC Distearoylphosphatidylcholine DSPE Distearoylphosphatidylethanolamine DSPG Distearoylphosphatidylglycerol EPC Egg phosphatidylcholine EYPC Egg yolk phosphatidylcholine HA Hyaluronic Acid HEPES 4-(2-hydroxyethyl)-1-piperazineethanesulfonic acid HSPC Hydrogenated soy phosphatidylcholine MPLA Monophosphoryl lipid A OA Oleic acid PC Phosphatidylcholine PDMA-b-PLMA Poly(2-(dimethylamino)ethyl methacrylate)-block-poly(lauryl methacrylate) PDMAEMA-b-PLMA Poly(N,N-dimethylaminoethyl methacrylate)-block-poly(lauryl methacrylate) PLGA Poly(lactic-co-glycolic acid) POPC Palmitoyl-oleoyl-phosphatidylcholine PS Particle Size PDI Polydispersity Index EE Entrapment/Encapsulation Efficiency Dh Hydrodynamic diamete References 1. Abbasi H. Rahbar N. Kouchak M. Khalil Dezfuli P. Handali S. Functionalized Liposomes as Drug Nanocarriers for Active Targeted Cancer Therapy: A Systematic Mini-review J. Liposome Res. 2022 32 195 210 10.1080/08982104.2021.1903035 33729077 2. Pande S. Liposomes for Drug Delivery: Mini-review of Vesicular Composition, Factors Affecting Drug Release and Drug Loading in Liposomes Artif. Cells Nanomed. Biotechnol. 2023 51 428 440 10.1080/21691401.2023.2247036 37594208 3. Large D.E. Abdelmessih R.G. Fink E.A. Auguste D.T. Liposome Composition in Drug Delivery Design, Synthesis, Characterization, and Clinical Application Adv. Drug Deliv. Rev. 2021 176 113851 10.1016/j.addr.2021.113851 34224787 4. Antoniou A.I. Giofrè S. Seneci P. Passarella D. Pellegrino S. Stimulus-Responsive Liposomes for Biomedical Applications Drug Discov. Today 2021 26 1794 1824 10.1016/j.drudis.2021.05.010 34058372 5. Ashrafizadeh M. Delfi M. Zarrabi A. Bigham A. Sharifi E. Rabiee N. Paiva-Santos A.C. Kumar A.P. Tan S.C. Hushmandi K. Stimuli-Responsive Liposomal Nanoformulations in Cancer Therapy: Pre-Clinical & Clinical Approaches J. Control. Release 2022 351 50 80 35934254 10.1016/j.jconrel.2022.08.001 6. Kashapov R. Gaynanova G. Gabdrakhmanov D. Kuznetsov D. Pavlov R. Petrov K. Zakharova L. Sinyashin O. Self-Assembly of Amphiphilic Compounds as a Versatile Tool for Construction of Nanoscale Drug Carriers Int. J. Mol. Sci. 2020 21 6961 10.3390/ijms21186961 32971917 PMC7555343 7. Rana A. Adhikary M. Singh P.K. Das B.C. Bhatnagar S. “Smart” Drug Delivery: A Window to Future of Translational Medicine Front. Chem. 2022 10 1095598 10.3389/fchem.2022.1095598 36688039 PMC9846181 8. Shah H. Madni A. Khan M.M. Ahmad F.-U.-D. Jan N. Khan S. Rahim M.A. Khan S. Ali M.M. Kazi M. pH-Responsive Liposomes of Dioleoyl Phosphatidylethanolamine and Cholesteryl Hemisuccinate for the Enhanced Anticancer Efficacy of Cisplatin Pharmaceutics 2022 14 129 10.3390/pharmaceutics14010129 35057025 PMC8779429 9. Naziris N. Saitta F. Chrysostomou V. Libera M. Trzebicka B. Fessas D. Pispas S. Demetzos C. pH-Responsive Chimeric Liposomes: From Nanotechnology to Biological Assessment Int. J. Pharm. 2020 574 118849 10.1016/j.ijpharm.2019.118849 31759108 10. Rustad E.A.L. von Hofsten S. Kumar R. Lænsman E.A. Berge G. Škalko-Basnet N. The pH-Responsive Liposomes: The Effect of PEGylation on Release Kinetics and Cellular Uptake in Glioblastoma Cells Pharmaceutics 2022 14 1125 10.3390/pharmaceutics14061125 35745698 PMC9227832 11. Yanagihara S. Kitayama Y. Yuba E. Harada A. Preparing Size-Controlled Liposomes Modified with Polysaccharide Derivatives for pH-Responsive Drug Delivery Applications Life 2023 13 2158 10.3390/life13112158 38004298 PMC10672248 12. Lado-Touriño I. Cerpa-Naranjo A. Coarse-Grained Molecular Dynamics of pH-Sensitive Lipids Int. J. Mol. Sci. 2023 24 4632 10.3390/ijms24054632 36902063 PMC10003205 13. Giraldo A.-M.V. Eriksson I. Wennmalm S. Fyrner T. Ederth T. Öllinger K. Interactions of the Lysosomotropic Detergent O-Methyl-Serine Dodecylamide Hydrochloride (MSDH) with Lipid Bilayer Membranes—Implications for Cell Toxicity Int. J. Mol. Sci. 2020 21 3136 10.3390/ijms21093136 32365555 PMC7247706 14. Fuentes G.V. Doucet E.N. Abraham A. Rodgers N.K. Alonso F. Euceda N. Quinones M.H. Riascos P.A. Pierre K. Sarker N.H. Nanocomposite Liposomes for pH-Controlled Porphyrin Release into Human Prostate Cancer Cells RSC Adv. 2020 10 17094 17100 10.1039/D0RA00846J 35496928 PMC9053171 15. Goldbach N. Benna I. Wicky B.I.M. Croft J.T. Carter L. Bera A.K. Nguyen H. Kang A. Sankaran B. Yang E.C. De Novo Design of Monomeric Helical Bundles for pH-Controlled Membrane Lysis Protein Sci. 2023 32 e4769 10.1002/pro.4769 37632837 PMC10578055 16. Alghurabi H. Tagami T. Ogawa K. Ozeki T. Preparation, Characterization, and In Vitro Evaluation of Eudragit S100-Coated Bile Salt-Containing Liposomes for Oral Colonic Delivery of Budesonide Polymers 2022 14 2693 10.3390/polym14132693 35808738 PMC9268925 17. Odeh F. Nsairat H. Alshaer W. Alsotari S. Buqaien R. Ismail S. Awidi A. Al Bawab A. Remote Loading of Curcumin-in-Modified β-Cyclodextrins into Liposomes Using a Transmembrane pH Gradient RSC Adv. 2019 9 37148 37161 10.1039/C9RA07560G 35542296 PMC9075600 18. Nunes S. Miranda S.E.M. Silva J.O. Fernandes R.S. Lemos J.D. Ferreira C.A. Townsend D.M. Cassali G.D. Oliveira M.C. Barros A.L.B. pH-Responsive and Folate-Coated Liposomes Encapsulating Irinotecan as an Alternative to Improve Efficacy of Colorectal Cancer Treatment Biomed. Pharmacother. 2021 144 112317 10.1016/j.biopha.2021.112317 34634556 PMC9052206 19. Park Y.I. Kwon S.-H. Lee G. Motoyama K. Kim M.W. Lin M. Niidome T. Choi J.H. Lee R. pH-Sensitive Multi-Drug Liposomes Targeting Folate Receptor β for Efficient Treatment of Non-Small Cell Lung Cancer J. Control. Release 2021 330 1 14 10.1016/j.jconrel.2020.12.011 33321157 20. Pandey P. Arya D.K. Deepak P. Ali D. Alarifi S. Srivastava S. Lavasanifar A. Rajinikanth P.S. αvβ3 Integrin and Folate-Targeted pH-Sensitive Liposomes with Dual Ligand Modification for Metastatic Breast Cancer Treatment Bioengineering 2024 11 800 10.3390/bioengineering11080800 39199757 PMC11352135 21. Alrbyawi H. Stimuli-Responsive Liposomes of 5-Fluorouracil: Progressive Steps for Safe and Effective Treatment of Colorectal Cancer Pharmaceutics 2024 16 966 10.3390/pharmaceutics16070966 39065663 PMC11280302 22. García M.C. Calderón-Montaño J.M. Rueda M. Longhi M. Rabasco A.M. López-Lázaro M. Prieto-Dapena F. González-Rodríguez M.L. pH-Temperature Dual-Sensitive Nucleolipid-Containing Stealth Liposomes Anchored with PEGylated AuNPs for Triggering Delivery of Doxorubicin Int. J. Pharm. 2022 619 121691 10.1016/j.ijpharm.2022.121691 35331830 23. Zhai L. Luo C. Gao H. Du S. Shi J. Wang F. A Dual pH-Responsive DOX-Encapsulated Liposome Combined with Glucose Administration Enhanced Therapeutic Efficacy of Chemotherapy for Cancer Int. J. Nanomed. 2021 16 3185 3199 10.2147/IJN.S303874 34007173 PMC8121622 24. Dos Reis S.B. Silva J.d.O. Garcia-Fossa F. Leite E.A. Malachias A. Pound-Lana G. Mosqueira V.C.F. Oliveira M.C. de Barros A.L.B. de Jesus M.B. Mechanistic Insights into the Intracellular Release of Doxorubicin from pH-Sensitive Liposomes Biomed. Pharmacother. 2021 134 110952 10.1016/j.biopha.2020.110952 33348307 25. Grace V.M.B. Wilson D.D. Guruvayoorappan C. Danisha J.P. Bonati L. Liposome Nano-Formulation with Cationic Polar Lipid DOTAP and Cholesterol as a Suitable pH-Responsive Carrier for Molecular Therapeutic Drug (All-Trans Retinoic Acid) Delivery to Lung Cancer Cells IET Nanobiotechnol. 2021 15 380 390 10.1049/nbt2.12028 34694713 PMC8675848 26. Naziris N. Pippa N. Sereti E. Chrysostomou V. Kędzierska M. Kajdanek J. Ionov M. Miłowska K. Balcerzak Ł. Garofalo S. Chimeric Stimuli-Responsive Liposomes as Nanocarriers for the Delivery of the Anti-Glioma Agent TRAM-34 Int. J. Mol. Sci. 2021 22 6271 10.3390/ijms22126271 34200955 PMC8230631 27. Han M. Song Y. Liu S. Lu X. Su L. Liu M. Zhu X. Sun K. Lu Y. Wang A. Engineering of Stimulus-Responsive Pirfenidone Liposomes for Pulmonary Delivery During Treatment of Idiopathic Pulmonary Fibrosis Front. Pharmacol. 2022 13 882678 10.3389/fphar.2022.882678 35548360 PMC9081653 28. Cheng Z. Fobian S.-F. Gurrieri E. Amin M. D’Agostino V.G. Falahati M. Zalba S. Debets R. Garrido M.J. Saeed M. Lipid-Based Nanosystems: The Next Generation of Cancer Immune Therapy J. Hematol. Oncol. 2024 17 53 10.1186/s13045-024-01574-1 39030582 PMC11265205 29. Qian R. Yi X. Liu T. Chen H. Wang Y. Hu L. Guo L. Yang K. Deng H. Regulation of Ion Homeostasis for Enhanced Tumor Radio-Immunotherapy Adv. Sci. 2023 10 e2304092 10.1002/advs.202304092 PMC10646238 37740415 30. Yao Y. Chen H. Tan N. Cancer-Cell-Biomimetic Nanoparticles Systemically Eliminate Hypoxia Tumors by Synergistic Chemotherapy and Checkpoint Blockade Immunotherapy Acta Pharm. Sin. B 2022 12 2103 2119 10.1016/j.apsb.2021.10.010 35847496 PMC9279713 31. Shen H. Zhang C. Wang C. Jiang J. Tang F. Li C. Yuan H. Yang X. Tong Z. Huang Y. Lutein-Based pH and Photo Dual-Responsive Novel Liposomes Coated with Ce6 and PTX for Tumor Therapy ACS Omega 2023 8 31436 31449 10.1021/acsomega.3c04228 37663483 PMC10468958 32. Qi Q.-R. Tian H. Yue B.-S. Zhai B.-T. Zhao F. Research Progress of SN38 Drug Delivery System in Cancer Treatment Int. J. Nanomed. 2024 19 945 964 10.2147/IJN.S435407 38293612 PMC10826519 33. Tang T. Gong Y. Gao Y. Pang X. Liu S. Xia Y. Liu D. Zhu L. Fan Q. Sun X. A pH-Responsive Liposomal Nanoplatform for Co-Delivery of a Pt(IV) Prodrug and Cinnamaldehyde for Effective Tumor Therapy Front. Bioeng. Biotechnol. 2023 11 1191534 10.3389/fbioe.2023.1191534 37214306 PMC10196200 34. Huang R. Gyanani V. Zhao S. Lu Y. Guo X. Imidazole-Based pH-Sensitive Convertible Liposomes for Anticancer Drug Delivery Pharmaceuticals 2022 15 306 10.3390/ph15030306 35337105 PMC8949415 35. Zhang N. Tan Y. Yan L. Zhang C. Xu M. Guo H. Zhuang B. Zhou L. Xie X. Modulation of Tumor Hypoxia by pH-Responsive Liposomes to Inhibit Mitochondrial Respiration for Enhancing Sonodynamic Therapy Int. J. Nanomed. 2020 15 5687 5700 10.2147/IJN.S256038 PMC7418152 32821097 36. Wang C. Dong Z. Zhang Q. Guo M. Hu W. Dong S. Jakkree T. Lu Y. Du S. Stimulus-Responsive Nano Lipidosome for Enhancing the Anti-Tumour Effect of a Novel Peptide Dermaseptin-PP IET Nanobiotechnol. 2023 17 352 359 10.1049/nbt2.12128 37042087 PMC10288360 37. You X. Liu H. Chen Y. Zhao G. Multifunctional Liposomes Co-Modified with Ginsenoside Compound K and Hyaluronic Acid for Tumor-Targeted Therapy Polymers 2024 16 405 10.3390/polym16030405 38337294 PMC10857112 38. Liu Z. Wang F. Liu X. Sang Y. Zhang L. Ren J. Qu X. Cell Membrane-Camouflaged Liposomes for Tumor Cell-Selective Glycans Engineering and Imaging in Vivo Proc. Natl. Acad. Sci. USA 2021 118 e2022769118 10.1073/pnas.2022769118 34301864 PMC8325163 39. Lin Q. Jing Y. Yan C. Chen X. Zhang Q. Lin X. Xu Y. Chen B. Design and Application of pH-Responsive Liposomes for Site-Specific Delivery of Cytotoxin from Cobra Venom Int. J. Nanomed. 2024 19 5381 5395 10.2147/IJN.S461728 PMC11164093 38859950 40. Zhao T. Liang C. Zhao Y. Xue X. Ma Z. Qi J. Shen H. Yang S. Zhang J. Jia Q. Multistage pH-Responsive Codelivery Liposomal Platform for Synergistic Cancer Therapy J. Nanobiotechnol. 2022 20 177 10.1186/s12951-022-01383-z PMC8976966 35366888 41. Du L. Gong Y. Zhang X. Sun J. Gao F. Shen M. Bai H. Yang T. Cheng X. Li S. PD-L1 siRNA Hitched Polyethyleneimine-Elastase Constituting Nanovesicle Induces Tumor Immunogenicity and PD-L1 Silencing for Synergistic Antitumor Immunotherapy J. Nanobiotechnol. 2024 22 442 10.1186/s12951-024-02700-4 PMC11282766 39068444 42. Abuhelal S. Centelles M.N. Wright M. Mason A.J. Thanou M. Development of Cationic Lipid LAH4-L1 siRNA Complexes for Focused Ultrasound Enhanced Tumor Uptake Mol. Pharm. 2023 20 2341 2351 10.1021/acs.molpharmaceut.2c00909 36989421 PMC10155207 43. Ding X. Yin C. Zhang W. Sun Y. Zhang Z. Yang E. Sun D. Wang W. Designing Aptamer-Gold Nanoparticle-Loaded pH-Sensitive Liposomes Encapsulate Morin for Treating Cancer Nanoscale Res. Lett. 2020 15 68 10.1186/s11671-020-03297-x 32232589 PMC7105578 44. Yang Y. Yang S. Zhang B. Wang J. Meng D. Cui L. Zhang L. Hybrid Liposome-MSN System with Co-Delivering Potential Effective Against Multidrug-Resistant Tumor Targets in Mice Model Int. J. Nanomed. 2024 19 8949 8970 10.2147/IJN.S472276 PMC11378800 39246424 45. Lafi Z. Alshaer W. Hatmal M.M. Zihlif M. Alqudah D.A. Nsairat H. Azzam H. Aburjai T. Bustanji Y. Awidi A. Aptamer-Functionalized pH-Sensitive Liposomes for a Selective Delivery of Echinomycin into Cancer Cells RSC Adv. 2021 11 29164 29177 10.1039/D1RA05138E 35479561 PMC9040599 46. Ba S. Qiao M. Jia L. Zhang J. Zhao X. Hu H. Chen D. Construction of Hierarchical-Targeting pH-Sensitive Liposomes to Reverse Chemotherapeutic Resistance of Cancer Stem-like Cells Pharmaceutics 2021 13 1205 10.3390/pharmaceutics13081205 34452166 PMC8399523 47. Ramírez-Acosta C.M. Cifuentes J. Castellanos M.C. Moreno R.J. Muñoz-Camargo C. Cruz J.C. Reyes L.H. pH-Responsive, Cell-Penetrating, Core/Shell Magnetite/Silver Nanoparticles for the Delivery of Plasmids: Preparation, Characterization, and Preliminary In Vitro Evaluation Pharmaceutics 2020 12 561 10.3390/pharmaceutics12060561 32560390 PMC7356180 48. Xi K. Gu Y. Tang J. Chen H. Xu Y. Wu L. Cai F. Deng L. Yang H. Shi Q. Microenvironment-Responsive Immunoregulatory Electrospun Fibers for Promoting Nerve Function Recovery Nat. Commun. 2020 11 4504 10.1038/s41467-020-18265-3 32908131 PMC7481196 49. Deiss-Yehiely E. Cárcamo-Oyarce G. Berger A.G. Ribbeck K. Hammond P.T. pH-Responsive, Charge-Reversing Layer-by-Layer Nanoparticle Surfaces Enhance Biofilm Penetration and Eradication ACS Biomater. Sci. Eng. 2023 9 4794 4804 10.1021/acsbiomaterials.3c00481 37390118 PMC11117027 50. Wang D.-Y. Yang G. van der Mei H.C. Ren Y. Busscher H.J. Shi L. Liposomes with Water as a pH-Responsive Functionality for Targeting of Acidic Tumor and Infection Sites Angew. Chem. Int. Ed. 2021 60 17714 17719 10.1002/anie.202106329 PMC8362074 34028150 51. Luo J. Li X. Dong S. Zhu P. Liu W. Zhang S. Du J. Layer-by-Layer Coated Hybrid Nanoparticles with pH-Sensitivity for Drug Delivery to Treat Acute Lung Infection Drug Deliv. 2021 28 2460 2468 10.1080/10717544.2021.2000676 34766544 PMC8592614 52. Szachniewicz M.M. van den Eeden S.J.F. van Meijgaarden K.E. Franken K.L.M.C. van Veen S. Geluk A. Bouwstra J.A. Ottenhoff T.H.M. Cationic pH-Sensitive Liposome-Based Subunit Tuberculosis Vaccine Induces Protection in Mice Challenged with Mycobacterium tuberculosis Eur. J. Pharm. Biopharm. 2024 203 114437 10.1016/j.ejpb.2024.114437 39122053 53. Kang M.K. Park J.-W. Acetylcholine Detection Based on pH-Sensitive Liposomes ACS Omega 2021 6 14963 14967 10.1021/acsomega.1c01023 34151077 PMC8209822 54. He R. Sun S. Cui J. Chi M. Wang Z. Hu S. pH/Magnetic Dual Responsive Pickering Emulsion Stabilized by Fe 3 4 2 Phys. Chem. Chem. Phys. 2023 25 25780 25788 10.1039/D3CP03400C 37724345 55. Sia C.S. Tey B.T. Goh B.H. Low L.E. Controlled Assembly of Superparamagnetic Iron Oxide Nanoparticles into Nanoliposome for Pickering Emulsion Preparation Colloids Surf. B Biointerfaces 2024 241 114051 10.1016/j.colsurfb.2024.114051 38954935 56. Feng X. Li Y. Cui Z. Tang R. Sodium Alginate/Carboxymethyl Cellulose Films Embedded with Liposomes Encapsulated Green Tea Extract: Characterization, Controlled Release, Application RSC Adv. 2024 14 245 254 10.1039/D3RA05196J 38173599 PMC10758806 57. Alaqabani H. Hammad A. Abosnwber Y. Perrie Y. Novel microfluidic development of pH-responsive hybrid liposomes: In vitro and in vivo assessment for enhanced wound healing Int. J. Pharm. 2024 667 Pt A 124884 10.1016/j.ijpharm.2024.124884 39471888 58. Grau M. Wagner E. Strategies and mechanisms for endosomal escape of therapeutic nucleic acids Curr. Opin. Chem. Biol. 2024 81 102506 10.1016/j.cbpa.2024.102506 39096817 59. Sun D. Lu Z.R. Structure and function of cationic and ionizable lipids for nucleic acid delivery Pharm. Res. 2023 40 27 46 Erratum in: Pharm. Res. 2024 41 https://doi.org/10.1007/s11095-024-03714-1 10.1007/s11095-022-03460-2 36600047 PMC9812548 60. Wang W. Wang L. Zhang Y. Zhang Y. Guan B.-O. Biomimetic liposomes as a pH/ROS cascade-responsive nanoagent with high selectivity for breast carcinoma in photothermal therapy Mater. Des. 2023 234 112304 10.1016/j.matdes.2023.112304 61. Efimova A.A. Abramova T.A. Yatsenko I.V. Kazantsev A.V. Pozdyshev D.V. Lukashev N.V. Muronets V.I. Yaroslavov A.A. pH-Sensitive Multiliposomal Containers for Encapsulation and Rapid Release of Bioactive Substances Molecules 2025 30 2608 10.3390/molecules30122608 40572570 PMC12195906 62. Jayapriya P. Pardhi E. Vasave R. Guru S.K. Madan J. Mehra N. A review on Stimuli-pH responsive liposomal formulation in cancer therapy J. Drug Deliv. Sci. Technol. 2023 90 105172 10.1016/j.jddst.2023.105172 63. Lim C. Shin Y. Lee S. Lee S. Lee M.-Y. Shin B.S. Oh K.T. Dynamic Drug Release State and PEG Length in PEGylated Liposomal Formulations Define the Distribution and Pharmacological Performance of Drug J. Drug Deliv. Sci. Technol. 2022 76 10382 10.1016/j.jddst.2022.103825 64. Mahmoudzadeh M. Magarkar A. Koivuniemi A. Róg T. Bunker A. Mechanistic Insight into How PEGylation Reduces the Efficacy of pH-Sensitive Liposomes from Molecular Dynamics Simulations Mol. Pharm. 2021 18 2612 2621 10.1021/acs.molpharmaceut.1c00122 34096310 PMC8289284 65. Tenchov R. Sasso J.M. Zhou Q.A. PEGylated Lipid Nanoparticle Formulations: Immunological Safety and Efficiency Perspective Bioconjug. Chem. 2023 34 941 960 10.1021/acs.bioconjchem.3c00174 37162501 PMC10190134 66. Ibrahim M. Ramadan E. Elsadek N.E. Emam S.E. Shimizu T. Ando H. Ishima Y. Elgarhy O.H. Sarhan H.A. Hussein A.K. Polyethylene Glycol (PEG): The Nature, Immunogenicity, and Role in the Hypersensitivity of PEGylated Products J. Control. Release 2022 351 215 230 10.1016/j.jconrel.2022.09.031 36165835 67. Parshad B. Arora S. Singh B. Pan Y. Tang J. Hu Z. Patra H.K. Towards Precision Medicine Using Biochemically Triggered Cleavable Conjugation Commun. Chem. 2025 8 100 10.1038/s42004-025-01491-5 40175511 PMC11965331 68. Dos Santos N. Allen C. Doppen A.M. Anantha M. Cox K.A.K. Gallagher R.C. Karlsson G. Edwards K. Kenner G. Samuels L. Influence of Poly(ethylene glycol) Grafting Density and Polymer Length on Liposomes: Relating Plasma Circulation Lifetimes to Protein Binding Biochim. Biophys. Acta Biomembr. 2007 1768 1367 1377 10.1016/j.bbamem.2006.12.013 17400180 69. Senjab R.M. AlSawaftah N. Abuwatfa W.H. Husseini G.A. Advances in liposomal nanotechnology: From concept to clinics RSC Pharm. 2024 1 928 948 10.1039/D4PM00176A 70. Padilla M.S. Mrksich K. Wang Y. Haley R.M. Li J.J. Han E.L. El-Mayta R. Kim E.H. Dias S. Gong N. Branched endosomal disruptor (BEND) lipids mediate delivery of mRNA and CRISPR-Cas9 ribonucleoprotein complex for hepatic gene editing and T cell engineering Nat. Commun. 2025 16 996 10.1038/s41467-024-55137-6 39856035 PMC11759712 71. Anchordoquy T. Artzi N. Balyasnikova I.V. Barenholz Y. La-Beck N.M. Brenner J.S. Chan W.C.W. Decuzzi P. Exner A.A. Gabizon A. Mechanisms and barriers in nanomedicine: Progress in the field and future directions ACS Nano 2024 18 13983 13999 10.1021/acsnano.4c00182 38767983 PMC11214758 72. Jiang Y. Li W. Wang Z. Lu J. Lipid-Based Nanotechnology: Liposome Pharmaceutics 2023 16 34 10.3390/pharmaceutics16010034 38258045 PMC10820119 Figures, Schemes and Table materials-18-04295-sch001_Scheme 1 Scheme 1 Historical overview of pH responsive liposomes. materials-18-04295-sch002_Scheme 2 Scheme 2 Statistical analysis of the applications of pH-responsive liposomes according to the research criteria of this study. Figure 1 Characteristic surface and morphology alterations of the pH-sensitive liposomes during the pH-response process, triggering content release. ( A 34 B 16 Figure 2 Schematic illustration of self-synthesized MI-PEOz-lip and its proposed anti-tumor mechanism. After intravenous injection, MI-PEOz-lip is expected to accumulate in tumors via the EPR effect. Then, the incorporation of pH-sensitive lipids into this liposome allows metformin to be rapidly released at the tumor site in response to the acidic pH of the tumor microenvironment. The released metformin reverses hypoxia in the tumor by reducing oxygen consumption and further increases IR780 to produce more ROS in hypoxic tumors. Adapted from [ 34 Figure 3 The cumulative drug release of liposomes in ( a b c d p p p 37 Figure 4 Targeting strategies of pH-responsive liposomes in anticancer therapy: ( A 46 B 20 C 34 materials-18-04295-t002_Table 2 Table 2 pH-responsive liposomes intended for antimicrobial treatment and vaccination. Formulation of pH-Responsive Liposomes Active Agent Therapeutic Indication Reference cholesterol, DSPC and DSPG, coated with polycationic poly-L-Lysine and polyanion tobramycin Pseudomonas aeruginosa [ 49 DCPA or DPPC or DCPM ciprofloxacin and rhodamine St. aureus Myc. Tuberculosis [ 50 DSPC and cholesterol, coated with PBAE/NaAlg streptomycin acute lung infection (ALI) bacteria [ 51 DOPC, EPC, DOPE and DOBAQ triple fusion antigen protein Ag85B-ESAT6-Rv2034 tuberculosis vaccination [ 52 ",
  "metadata": {
    "Title of this paper": "Lipid-Based Nanotechnology: Liposome",
    "Journal it was published in:": "Materials",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12471921/"
  }
}