{
  "title": "Paper_1051",
  "abstract": "Indian J Otolaryngol Head Neck Surg Indian J Otolaryngol Head Neck Surg 1415 ijoto Indian Journal of Otolaryngology and Head & Neck Surgery 2231-3796 0973-7707 Springer PMC11455751 PMC11455751.1 11455751 11455751 39376331 10.1007/s12070-024-04688-7 4688 1 Other Articles Bilateral Chylothorax Following Neck Dissection: A Systematic Review and Proposed Management Algorithm http://orcid.org/0000-0001-7287-7694 Hussain Salman q80salman98@gmail.com 1 Hayat Jafar 2 Ibrahim Fatma 2 Almutairi Abdulmuhsen 3 Alhajri Bedour 2 Al-Gilani Maha 1 1 https://ror.org/03c4mmv16 grid.28046.38 0000 0001 2182 2255 Department of Otolaryngology - Head and Neck Surgery, University of Ottawa, 2 3 1 7 2024 10 2024 76 5 472259 4900 4909 9 1 2024 4 4 2024 01 10 2025 01 10 2025 07 10 2024 01 10 2025 © Association of Otolaryngologists of India 2024. Springer Nature or its licensor (e.g. a society or other partner) holds exclusive rights to this article under a publishing agreement with the author(s) or other rightsholder(s); author self-archiving of the accepted manuscript version of this article is solely governed by the terms of such publishing agreement and applicable law. 2024 Aims Bilateral chylothoraces are rare but potentially life-threatening complications of neck dissections (ND). The condition is generally treated with a combination of dietary, medical, procedural, and surgical approaches. The aim of this review is to highlight the management options currently utilized in clinical practice and propose a management algorithm for this condition. Methods In accordance to Preferred Reporting Items for Systematic Reviews and Meta-Analyses (PRISMA) guidelines; utilizing the Pubmed, EMBASE, and Web of Science databases, a systematic review of all available literature on bilateral chylothoraces was conducted. Primary outcomes measures included clinical presentations and type of neck dissection performed with interventions employed to manage the condition. Secondary outcome measures included the time to resolution alongside patient outcomes. Results We identified 37 patients (female n = 27, male n = 10) who presented with bilateral chylothoraces within the years 1951–2018. The mean age was 51.4 ± 16.5 years within the age ranges of 17–78 years. Most common pathologies included papillary thyroid carcinoma (n = 16), squamous cell carcinoma (SCC) of the larynx (n = 3), supraglottic SCC (n = 3). Left sided ND was done in (n = 18); bilateral ND in (n = 17); central/left ND in (n = 2). Chylothorax was treated by surgery in n = 10, n = 5 of which performed lymph node embolization; and n = 5 used lymph node ligation. Resolution was found in all cases. Discharge times ranged from 2 to 40 days. Conclusions This systematic review highlights the different management modalities in treating bilateral chylothoraces alongside providing a decision algorithm in treating the condition by suggesting diagnostic tools and management modalities to optimize patient care. Keywords Bilateral chylothorax Neck dissection Thoracic duct Surgical management Octreotide pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access no pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement no pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes issue-copyright-statement © Association of Otolaryngologists of India 2024 ",
  "metadata": {
    "Title of this paper": "Bilateral Chylothorax Following Neck Dissection: A Systematic Review and Proposed Management Algorithm",
    "Journal it was published in:": "Indian Journal of Otolaryngology and Head & Neck Surgery",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC11455751/"
  }
}