{
  "title": "Paper_93",
  "abstract": "pmc Future Sci OA Future Sci OA 3121 fsoa Future Science OA 2056-5623 Taylor & Francis PMC12490355 PMC12490355.1 12490355 12490355 41025624 10.1080/20565623.2025.2565097 2565097 1 Version of Record Method Method Rehabilitation intervention to prevent adverse events related to ADT in patients with metastatic prostate cancer S. di Girolamo et al. https://orcid.org/0000-0001-5156-7400 Di Girolamo Stefania  a https://orcid.org/0000-0001-8014-2591 Bressi Barbara  b https://orcid.org/0000-0002-9926-8458 Masini Cristina  a https://orcid.org/0000-0001-6435-9504 Fugazzaro Stefania  c https://orcid.org/0000-0002-4645-0336 Costi Stefania  b  d Messori Monica  b https://orcid.org/0009-0008-1406-2313 Pecorari Alessia  b Galavotti Maria Beatrice  b Sola Carlotta  c Ferrara Claudia  c https://orcid.org/0000-0002-1598-9451 Altavilla Amelia  a Ciardiello Giamaica  a  e https://orcid.org/0000-0001-8225-2938 Braglia Luca  e Augugliaro Matteo  f https://orcid.org/0000-0002-3159-5268 Pinto Carmine  a a Medical Oncology Unit, Azienda USL-IRCCS Di Reggio Emilia Reggio Emilia Italy b Research and EBP Unit, Azienda USL-IRCCS di Reggio Emilia Reggio Emilia Italy c Physical Medicine and Rehabilitation Unit, Azienda USL-IRCCS Di Reggio Emilia Reggio Emilia Italy d Department of Surgery, Medicine, Dentistry and Morphological Sciences, University of Modena and Reggio Emilia Modena Italy e Clinical Trial Center, Azienda USL-IRCCS di Reggio Emilia Reggio Emilia Italy f Radiation Oncology Unit, Azienda USL-IRCCS di Reggio Emilia Reggio Emilia Italy CONTACT barbara.bressi@ausl.re.it Research and EBP Unit, Azienda USL-IRCCS di Reggio Emilia Viale Umberto I, 50 42123 Reggio Emilia Italy 30 9 2025 2025 11 1 476499 2565097 30 09 2025 03 10 2025 03 10 2025 16 5 2025 19 9 2025 KnowledgeWorks Global Ltd. 30 9 2025 published online in a building issue 30 9 2025 © 2025 The Author(s). Published by Informa UK Limited, trading as Taylor & Francis Group 2025 The Author(s) https://creativecommons.org/licenses/by-nc/4.0/ This is an Open Access article distributed under the terms of the Creative Commons Attribution-NonCommercial License ( http://creativecommons.org/licenses/by-nc/4.0/ Abstract In patients with prostate cancer (PCa), androgen deprivation therapy (ADT) is associated with multiple side effects, including increased fat mass (FM), loss of muscle mass and strength, osteoporosis, risk of falls, disability, fatigue, and a decline in quality of life (QoL). Multicomponent exercise programs have been shown to mitigate several of these adverse events. Preliminary evidence suggests that exercise can be safely implemented in patients with metastatic PCa and that physical inactivity should be avoided, even in advanced stages. However, studies involving this fragile population remain limited. This single-arm interventional study aims to evaluate the feasibility and safety of an exercise-based rehabilitation program in hormone-sensitive patients undergoing ADT, alone or combined with other therapies. HIGHLIGHTS Prostate cancer treatment overview In recent years, patients with metastatic prostate cancer have experienced longer survival rates, but they have also faced treatment-related adverse events that can compromise both quality of life and life expectancy. The extended survival has resulted in prolonged exposure to androgen deprivation therapy (ADT), which is associated with adverse events such as muscle weakness, fatigue, osteoporosis, and an increased risk of falls and fractures. While exercise has the potential to mitigate these adverse events, concerns about its safety in an elderly population, particularly those with bone metastases, have limited its widespread application. However, exercise guidelines for cancer survivors recommend that cancer patients, including those with bone metastases, should avoid physical inactivity. ReCaP trial design The ReCaP trial is a drug-free single-arm single-center interventional study investigating the feasibility of a tailored exercise program for metastatic prostate cancer (PCa) patients undergoing androgen deprivation therapy (ADT). Eligible patients are adult men (≥18 years) with a diagnosis of metastatic PCa and an ECOG Performance Status (PS) of 0–1 who are candidates for ADT alone or in combination with other treatments. Patients with physical or psychological/psychiatric conditions that may limit adherence to the study, or those with other active malignancies, will be excluded. The following data will be collected upon baseline assessment: sociodemographic data, anthropometric data, ECOG PS and medical history, including, bone lesions, pain, risk of pathological fractures, muscle strength, physical performance, level of fatigue, and level of habitual physical activity. Enrolled participants will be invited to participate in a 12-week rehabilitation program, starting within 3 months of initiating ADT. The intervention consists of a multicomponent tailored exercise program (including aerobic, resistance, and balance exercises) performed thrice weekly, with 2 supervised and 1 home-based session. Outcomes will be assessed at baseline (T0), at the end of the intervention (T1), and at follow-up, which will occur 24 weeks and 12 months from baseline (T2 and T3). A total of 38 participants will be enrolled, with a 20-month accrual period. ReCaP trial endpoints Primary outcome will be the feasibility of the rehabilitation intervention measured by adherence, defined as percentage of participants who complete treatment schedule ≥ 75% after 12 weeks. Secondary outcomes will be: recruitment rate and retention rates, safety, upper limbs muscle strength, physical performance, level of fatigue, habitual physical activity level. Secondary outcomes will be measured at baseline, after 12 weeks, 24 weeks and 12 months. Keywords rehabilitation feasibility adverse events androgen-deprivation therapy metastatic prostate cancer exercise This research was funded by the Italian Ministry of Health as part of the program “5perMille, year 2021” promoted by the AUSL-IRCCS of Reggio Emilia, Italy. This study was partially supported by the Italian Ministry of Health-Ricerca Corrente Annual Program 2026. pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement no pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes 1. Introduction 1.1. Background and rationale Recent research has provided strong evidence supporting the role of exercise in improving the tolerance to various side effects of cancer therapies, such as fatigue, anxiety, depression, physical function, sleep disturbances, and bone health. Exercise has also been shown to improve quality of life and even survival in some cancer types [ 1 2 3 4 Exercise is especially crucial for patients with metastatic prostate cancer (PCa). Recent advances in therapy, particularly the combination of ADT with androgen receptor pathway inhibitors (ARPIs), and in selected cases, with ARPIs and Docetaxel during the hormone-sensitive stage, have significantly improved survival rates in these patients [ 5–9 While the addition of ARPIs to ADT has demonstrated benefits in preserving—or even improving—specific QoL parameters such as general health status and pain control, these regimens are also associated with a potential increase in ADT-related AEs. Furthermore, heterogeneity in QoL assessment tools and time points across studies hinder reliable comparisons and limit the generalizability of results [ 10 11 Over the past decades, significant efforts have been made to mitigate the adverse effects related to sexual dysfunction. Recently, increased focus on ED management in metastatic prostate cancer has emerged, supported by a growing range of pharmacological treatments tailored to patients’ needs, comorbidities, and ED causes (e.g., hormone therapy, surgery, radiotherapy). Multimodal approaches are often recommended to optimize outcomes [ 12 Concerning musculoskeletal toxicities, since prostate cancer predominantly affects older men, these side effects are often compounded by age-related loss of muscle mass [ 13 14 The decline in LM in patients with PCa also leads to reduced muscle strength and worsens performance on physical function tests compared to both untreated PCa survivors and age-matched men without cancer. Low muscle strength is associated with self-reported functional limitations and an increased risk of both current and future disabilities [ 15 14 16 7 17 6 18 Adopting a healthy lifestyle that combines proper diet and regular exercise has proven effective in improving the FM/LM ratio in the general population. In patients with prostate cancer, research conducted over the last 20 years has shown that combined aerobic and resistance exercise reduces FM, improves muscle strength and cardiovascular function, and seems to positively impact QoL [ 19 However, few studies have focused specifically on patients with metastatic PCa, likely due to concerns about age and bone metastases, which increase the risk of skeletal fractures, spinal compression, and bone pain. Preliminary data suggest that, with careful planning, exercise can be safely incorporated into the treatment of this population [ 20 21 22 Recent research has also highlighted that muscle mass is inversely associated with cancer-related fatigue. Two studies involving advanced cancer patients showed lower fatigue scores in men with higher skeletal muscle mass [ 23 24 25 26 27 Several studies have demonstrated that resistance exercise [ 28 29–31 Based on these findings, we hypothesize that a tailored exercise program, recommended by cancer care providers and delivered by qualified exercise professionals, could be both feasible and beneficial to patients with metastatic PCa undergoing ADT, even in the presence of bone metastases. Additionally, we aim to assess whether the program can lead to lifestyle changes over a 12-month period. 1.2. Objectives The main aim of the current study is to assess the feasibility of a tailored exercise program, measured by adherence to exercise program, in metastatic PCa patients undergoing ADT. Secondary aims are to deepen the knowledge of other feasibility aspects (recruitment/retention), to monitor safety, to assess the effects on reducing the AEs of ADT (loss of strength, loss of physical performance and fatigue, number of accidental falls and fractures), and to monitor pain and changes in physical activity habits. 2. Methods 2.1. Trial design, inclusion criteria and participant timeline This is a drug-free single-arm single-center feasibility interventional study. The Institutional Review Board (Comitato Etico Area Vasta Emilia Nord—AVEN) approved the trial on 16/05/2023. This study protocol was prospectively registered on ClinicalTrials.gov with the Identifier NCT06238596 32 33 Exclusion criteria are the following: Physical or psychological/psychiatric conditions that may limit adherence to the study (heart failure NYHA 3–4, pathologic fractures, previous disability limiting exercise, moderate-severe cognitive impairment, psychiatric disorders, et cetera); Additional concomitant active malignancies. Eligible patients will be invited to participate in a 12-week rehabilitation intervention, consisting of three sessions per week, within 3 months from ADT start (first administration of LH-RH analogue). Outcomes will be assessed at baseline (T0), at the end of the intervention (T1), and at follow-up, which will occur 24 weeks and 12 months from baseline (T2 and T3). Figure 1 Figure 1. Schematic study flow diagram. Study flow diagram illustrating the progression of participants from eligibility assessment and enrollment through follow-up to inclusion in the final data analysis. The diagram schematically represents key study stages, including screening, baseline assessments, interventions, follow-up visits, and outcome measurements. 2.2. Recruitment procedures Eligible patients will be identified by oncologists and radiotherapists. If inclusion and exclusion criteria are met, oncologists will introduce and discuss with patients the main aspects of the trial. Furthermore, study information sheets will be provided and, if patients agree to participate, a written consent will be collected. The recruitment period is estimated to be 20 months. 2.3. Baseline assessment At the baseline assessment the oncologist will collect sociodemographic data (age, education level, availability of caregiver), anthropometric data (weight and height), ECOG PS and medical history, including date of diagnosis of PCa, histology of cancer, previous treatment for localized disease and response to oncological treatments, number of metastatic sites, site of metastasis (pelvis, vertebrae, ribs, proximal femur and all regions), date of start of ADT, other treatments associated with ADT, comorbidities, and recent accidental falls and fractures. Also, a physiatrist will collect data on sites of bone lesions, their associated level of pain by the numerical rating scale (NRS), and the risk of pathological fractures. Cancer-related instability of the vertebral column will be assessed by the spinal instability neoplastic score (SINS), which is a reliable tool to guide the management of patients with neoplastic spinal disease [ 34 35 A physiotherapist will collect functional data for all participants on muscle strength, physical performance, level of fatigue, and level of habitual physical activity. Anthropometric, clinical, and functional data will also be monitored per the follow-up schedule shown in Table 1 Table 1. Data collected and follow-up scheduled. Assessment and timepoint T0 (baseline +/− 10 days) T1 (12 weeks +/− 10 days) T2 (24 weeks +/− 10 days) T3 (12 months +/− 10 days) ICF sign X    Oncology or radiotherapy visit X   X Enrollment X    Socio-demographic data X    Height and weight X X X X Medical history X    Clinical data (ECOG-PS, comorbidities and therapies, falls and fractures, bone pain, response to oncological treatments) X X X X Physiatrist visit x    Physiotherapy clinical assessment      HGS X X X X  SPPB X X X X  FACIT-Fatigue scale X X X X  IPAQ-SF X X X X Experimental treatment ←-----------------------------------➔   Feasibility and safety assessment      Recruitment rate X     Retention rate X X X X  Adherence rate X X    AEs related and not related to intervention X X X X Abbreviations: ICF: informed consent form; ECOG-PS: Eastern Cooperative Oncology Group Performance Status; HGS: Hand Grip Strength; SPPB: Short Physical Performance Battery; FACIT-Fatigue Scale: Functional Assessment of Chronic Illness Therapy - Fatigue Scale; IPAQ-SF: International Physical Activity Questionnaire—Short Form; AEs: adverse events. 2.4. Rehabilitation intervention The rehabilitation intervention consists of a thrice-weekly individually tailored multicomponent exercise program for 12 weeks. Two sessions per week will be supervised by a physiotherapist in person or by online videoconference, as preferred by participants. In-person sessions will be conducted in small groups (up to 6) or individually at the Physical Medicine and Rehabilitation Unit of Santa Maria Nuova Hospital of Reggio Emilia, according to scheduled appointments. Furthermore, participants will be recommended and educated on how to perform a third weekly unsupervised session at home. The physiotherapist will provide an exercise booklet with pictures, video, and explanations of the exercises performed during the supervised sessions to maximize accuracy of the unsupervised execution by participants and to support long-term home-based exercise. Overall, the dose of the 12-week individually tailored multicomponent exercise program adheres to the recommendation of the guidelines for cancer survivors [ 1 36 At the end of the 12 weeks, the physiotherapist will recommend carrying on performing the exercise program in the home-based setting, using the tailored booklet. The multicomponent exercise program includes aerobic, resistance, and balance exercises, according with the exercise guidelines for cancer survivors [ 1 20 37 38 Sessions will last approximately 60 minutes and will be organized as follows: a 10-minute warm-up, 20–30 minutes of aerobic exercise, and 30 minutes of resistance, balance, and (if indicated) impact-loading exercises. The session will conclude with a 5-minute cool-down period of light aerobic activities (walking, stationary bike) or flexibility exercise, based on the participant’s preferences. The details of each exercise component are the following: Progressive aerobic exercise: 20–30 minutes of aerobic activity at moderate intensity (walking or stationary bikes), with a target intensity of 60–85% estimated maximum heart rate (% HRmax), The duration of aerobic exercise will increase from 20 to 30 minutes over 12 weeks, increasing by 5 minutes every 4 weeks. Progressive resistance exercise: strength activity of the major trunk, lower, and upper extremity muscle groups at a moderate intensity ranging from 8 to 15 repetitions, for 2–4 sets for each exercise. The progression of exercise intensity will change over the weeks based on the participant’s compliance and performance. Balance exercise: standing balance activities (e.g., stand on one leg, stand with unstable support base) and dynamic functional tasks (e.g., stop walking balanced on one foot, walking backward). Balance exercise will be associated with cognitive tasks (e.g., counting, memory/attention tasks). To provide progression, exercises will be modified by introducing difficulties (e.g., adding further cognitive or motor task). Impact-loading exercise (if indicated): activities that provide impact with the ground reaction force using the body weight as a load (e.g., hopping, going up and down steps, sudden changes in walk direction, acceleration/deceleration). Flexibility exercises: 2–3 repetitions for 30–60 seconds of static stretching for upper and lower extremity muscle groups. To provide a large number of stimuli, several tools will be used (e.g., resistance bands, fitball, unstable supports, hurdles, soft balls, step, et cetera). A detailed description summary of exercises, progression, and tools is provided in Table 2 39 Table 2. Summary of exercise program and modifications for bone metastases. Type of exercise Duration Exercise without BM Exercise with BM Aerobic exercise 20–30 min Walking or stationary bike with a target intensity of 60-80% of HRmax. If pelvis and/or femur BM § Resistance exercise* 30 min Lower and upper extremity muscle groups and postural and trunk muscles: strengthening with graduated anklets, weights, resistance bands, fitball, step. If pelvis and/or femur BM and upper limbs BM : Balance exercise* Standing balance activities and dynamic functional tasks associated with cognitive tasks. Tools used include unstable support. If pelvis, and/or femur BM § Impact-loading exercise* Hopping, going up and down steps, multidirectional movements, acceleration/deceleration. Tools used include weight, graduate anklets, hurdles, steps, training cone markers. If pelvis, axial skeleton (lumbar,, thoracic, cervical, ribs) and/or femur BM : Flexibility exercise 5 minutes Static stretching for upper and lower extremity muscle groups. If axial skeleton BM: exclusion of spine flexion/extension/rotation, especially when BM involves junctional and mobile spine (C1-T2; T11-L4) and patient refers pain. Abbreviations: BM, bone metastases; HRmax: maximum heart rate; ROM: range of motion.  § Exercises are not permitted in patients with axial lumbar skeleton BM associated to bone pain and/or orthopedic indications of physical limitation. * For this type of activity, the use of circuits with different exercises performed continuously for multiple repetitions or for set times is planned. 2.5. Outcome measures The primary outcome will be the feasibility of the rehabilitation intervention measured by adherence rate, defined as the percentage of study participants who complete a minimum of 75% of the treatment schedule [ 40 Secondary outcomes include recruitment rate, retention rates, safety, upper limbs muscle strength, physical performance, level of fatigue, habitual physical activity level ( Table 3 Table 3. Secondary outcomes. Outcome Description Recruitment rate Percentage of eligible patients who agree to participate in the study. Safety Monitoring of accidental falls, traumatic and pathological fractures during the study, and pain at bone metastasis sites (measured using the NRS Scale). Adverse events (AEs) related and unrelated to the rehabilitation intervention (such as pain, falls, or fractures occurring during exercise sessions) will be recorded. Upper limbs muscle strength Assessed using a hand grip strength (HGS) dynamometer [ 48 Physical performance Measured using the Short Physical Performance Battery (SPPB) test [ 49 Level of fatigue Assessed using the Functional Assessment of Chronic Illness Therapy-Fatigue (FACIT-F) scale [ 50 Habitual physical activity level Assessed using the International Physical Activity Questionnaire – Short Form (IPAQ-SF) [ 51 2.6. Statistical analysis 2.6.1. Sample size calculation We dimensioned this feasibility study on the primary outcome (the percentage of adherent participants) and considering a single arm (phase-2-like) experimental study setup [ 41 2.6.2. Statistical methods for primary and secondary outcomes Analysis by outcome: We will perform a one-tailed exact binomial test for feasibility proportion against the null hypothesis (p0 = 60%, alternative: unilateral, greater); a p Following outcome order: Recruitment rate will be estimated as percentage and accompanied by a Clopper Pearson two-tailed 95% confidence interval. Retention rates at 12 and 24 weeks and at 12 months will be analyzed as outcome 2.a. Safety outcomes will be summarized by tables, listings, and descriptive statistics. Upper strength will be estimated as the percentage of participants with Hand Grip Strength (HGS) ≥27 kg on the primary hand (normal strength) at baseline and after 12 weeks and compared using McNemar’s test for paired proportions. A p-value below 0.05 will be considered statistically significant. Otherwise, strength in kg will be summarized in time by graphs and proper summary descriptive statistics. Short Physical Performance Battery (SPPB) measurements (% of participants with score ≥ 8 at baseline and after 12 weeks) will be analyzed as outcome 2.d. Functional Assessment Of Chronic Illness Therapy—Fatigue (FACIT-F) measurements mean delta estimate (12 weeks baseline) will be accompanied by a 95% confidence interval assuming an asymptotically normal distribution of the estimator. Otherwise, the outcome in time will be descriptively summarized. International Physical Activity Questionnaire Short Form (IPAQ-SF) classifications will be analyzed as contingency table against time (absolute and relative frequencies within time); to explore the association of time with IPAQ (baseline vs 12 weeks) we will compare a mixed effect ordinal model (fixed effect: time, random effect: 1 intercept per participants) with its null counterpart via likelihood ratio test. A complete case analysis will be performed; we expect that primary outcome missingness will be negligible (<5%) and will have been accounted for in trial dimensioning. 2.6.3. Data collection management and monitoring All data will be entered electronically. The data will be processed by an electronic Case Report Form (CRF). Azienda U.S.L.—IRCCS of Reggio Emilia will process the personal data of the subjects participating in the study as independent Data Controller and according to the realization of the study itself. In accordance with current European legislation, informed consent of participants will be collected for enrollment in the study and the processing of personal data, pursuant to GDPR 679/2016, D.Lgs. 196/2003, as amended by D.Lgs. 101/2018. The identification data of the subject will be recorded in coded form. Personal data will be pseudo-anonymized. The identification data (name) and the corresponding alphanumeric codes will be stored in a separate “decoding” file. Only the participant code (i.e., participant ID) will be recorded in the CRF. All the information collected in the CRF will be made accessible only to collaborators authorized by the PI as data processing responsible and access to the CRF will only be possible for the staff involved in the study. The Principal Investigator is responsible for the data monitoring. No external data monitoring committee is planned for this feasibility study. The investigators will allow site trial related monitoring, audits, Institutional Review Board/Independent Ethics Committees review and regulatory inspections of the study (both during and after its completion). 2.6.3.1. Harm and adverse event reporting The baseline accurate assessment of participants, including identification of bone frailty and sites of metastases, helps clinicians to offer the most personalized rehabilitation intervention to each participant, respecting his/her general condition and overall frailty, if present. A different exercise program has been set up for participants with bone metastases, according to recent expert consensus recommendations [ 42 Safety data will be collected in terms of the number of accidental falls and fractures, in accordance with the aim and outcomes of the present protocol. Participants may be exposed to harm related to exercise and physical activity; we will distinguish between AEs related to the exercise program (pain or falls or fractures occurring during exercise sessions) and AEs not related to exercise. Insurance for participants is provided. 3. Ethics and dissemination The trial will be carried out in compliance with the protocol, the ethical principles laid down in the Declaration of Helsinki, in accordance with the General Data Protection Regulation, the principles of Good Clinical Practice, and other relevant regulations. The investigator will immediately inform the Research Institution of any urgent safety measures taken to protect the trial participants against any immediate hazard. Prior to participation in the trial, written informed consent must be obtained from each participant according to ICH-GCP and to the regulatory and legal requirements of the participating country. Each signature must be personally dated by each signatory, and the informed consent form must be retained by the investigator as part of the trial records. A signed copy of the informed consent must be given to each participant. In terms of dissemination strategy, the Trial Steering Committee aims to publish the ReCaP protocol to share with clinicians and other research groups participants’ timeline assessments and intervention description. After data analyses, the results of the study will be disseminated, preferring an open access practice to improve the accessibility and reproducibility of its outcomes. 4. Conclusion There is growing evidence supporting the benefits of physical exercise for patients living with cancer, particularly in reducing treatment side effects, improving quality of life, and, in some cases, even enhancing survival. Cancer associations have endorsed the implementation of exercise in clinical practice, yet it remains an underutilized approach [ 43 44 45 4 The ReCaP trial aims to explore, as a primary outcome, the feasibility of a tailored exercise program for metastatic prostate cancer patients, adding rehabilitation to the standard care. In this population of cancer patients, the concerns mentioned above are intensified by older age, the predominance of bone metastases, and comorbidities. We believe that demonstrating the feasibility of a structured exercise program in this patient population may help increase healthcare professionals’ confidence in prescribing such interventions in clinical practice. The assessment of secondary outcomes is useful to describe the effect of the intervention. Functional indicators, fatigue levels, and physical activity level provide concrete data, while the recruitment rate reflects its acceptability. Safety monitoring ensures the intervention is well tolerated and free of significant risks. As a single-arm study, the effectiveness of the rehabilitation intervention on health outcomes cannot be determined due to the lack of a control group. Additionally, the population under study will likely be heterogeneous, since eligible patients may vary in terms of disease burden and therapies associated to ADT. For example, some study participants may be candidates for triplet therapy, which includes novel hormonal agents and chemotherapy, and/or may receive concomitant steroids if required by their treatment protocols. Moreover, comorbidities such as metabolic syndrome [ 46 47 Furthermore, excluding patients with ECOG PS >1, advanced heart failure (NYHA 3–4), pathologic fractures, and cognitive impairment may limit the generalizability of our findings to frailer patients. However, these criteria were necessary to properly evaluate the feasibility of the rehabilitation program particularly in this early phase of investigation. Future research should explore the applicability of such interventions in more vulnerable populations. Thanks to the long term follow-up, we aim to determine whether exercise prescription over the course of a year can significantly influence participants’ lifestyles, promoting lasting improvements in their physical activity habits and overall well-being. With these limitations in mind, the results of this study will provide us with data on the feasibility and safety of the exercise in this population, while the assessment of intervention effectiveness on secondary outcomes remains exploratory and descriptive due to the single-arm design. If the study successfully meets its primary endpoint, future randomized controlled trials with sufficient statistical power could be designed to assess the effectiveness of a rehabilitation program integrated into cancer care. Acknowledgements We thank the General and Scientific Directorates of our company for the opportunity to conduct this trial and for their support. No generative AI tools or technologies were used in the writing, editing, or proofreading of this manuscript. Ethical statement The study will be open to enrollment only after the approval of Ethics Committee and the authorization issued by General Manager of Azienda U.S.L.—IRCCS of Reggio Emilia, pursuant to L.R. 9/2017. The study protocol, each amendment, and the consent for data processing must be approved and notified to the Ethics Committee. This study will be conducted in full conformance with the ICH E6 guideline for Good Clinical Practice and the principles of the Declaration of Helsinki, or the applicable laws and regulations of the country in which the research is conducted, whichever affords the greater protection to the individual. The study will comply with the requirements of the ICH E2A guideline (Clinical Safety Data Management: Definitions and Standards for Expedited Reporting), with the E.U. Clinical Trial Directive (2001/20/EC) and applicable local, regional, and national laws. Consent for publication Informed consent is attached to the protocol. Author contributions SdG is the Chief Investigator; she conceived the study, led the proposal and protocol development. MA, SF, SC, LB, CP, and GC contributed to the study design and to the development of the proposal. All authors read and approved the final manuscript. Disclosure statement The authors have no other relevant affiliations or financial involvement with any organization or entity with a financial interest in or financial conflict with the subject matter or materials discussed in the manuscript apart from those disclosed. Data availability statement The investigator is responsible for archiving and storing the essential documents of the study before, during the conduct and after the completion or possible interruption of the study itself, in accordance with what/for the time required by current legislation. The data collected in the database will be strictly anonymous and the participant enrolled in the study will only be identified with a number. Participant’s original data (e.g., demographic and medical information) and the original signed informed consent and privacy form will be shared only with personnel authorized by the principal investigators and only for specific protocol aims. Final full dataset will be available to the trial investigators (SdG, SF, SC, MA, GC, LB, and CP). References Papers of special note have been highlighted as either of interest (•) or of considerable interest (••) to readers. 1 Campbell KL Winters-Stone KM Wiskemann J et al. Exercise guidelines for cancer survivors: consensus statement from international multidisciplinary roundtable Med Sci Sports Exerc 2019 51 11 2375 2390 10.1249/MSS.0000000000002116 31626055 PMC8576825 ** These guidelines recommend exercise training to improve physical fitness and functioning, enhance quality of life and mitigate cancer-related fatigue. 2 Mctiernan A Friedenreich CM Katzmarzyk PT et al. Physical activity in cancer prevention and survival: a systematic review Med Sci Sports Exerc 2019 51 6 1252 1261 10.1249/MSS.0000000000001937 31095082 PMC6527123 3 Fisher A Williams K Beeken R et al. Recall of physical activity advice was associated with higher levels of physical activity in colorectal cancer patients BMJ Open 2015 5 4 e006853 10.1136/bmjopen-2014-006853 PMC4420935 25922098 4 Nadler M Bainbridge D Tomasone J et al. Oncology care provider perspectives on exercise promotion in people with cancer: an examination of knowledge, practices, barriers, and facilitators Support Care Cancer 2017 25 7 2297 2304 10.1007/s00520-017-3640-9 28258503 5 Fizazi K Tran N Fein L et al. Abiraterone plus prednisone in metastatic, castration-sensitive prostate cancer N Engl J Med 2017 377 4 352 360 10.1056/NEJMoa1704174 28578607 6 Davis ID Martin AJ Stockler MR et al. Enzalutamide with standard first-line therapy in metastatic prostate cancer N Engl J Med 2019 381 2 121 131 10.1056/NEJMoa1903835 31157964 7 Chi KN Agarwal N Bjartell A et al. Apalutamide for metastatic, castration-sensitive prostate cancer N Engl J Med 2019 381 1 13 24 10.1056/NEJMoa1903307 31150574 8 Fizazi K Foulon S Carles J et al. Abiraterone plus prednisone added to androgen deprivation therapy and docetaxel in de novo metastatic castration-sensitive prostate cancer (PEACE-1): a multicentre, open-label, randomised, phase 3 study with a 2 × 2 factorial design Lancet 2022 399 10336 1695 1707 10.1016/S0140-6736(22)00367-1 35405085 9 Smith MR Hussain M Saad F et al. Darolutamide and survival in metastatic, hormone-sensitive prostate cancer N Engl J Med 2022 386 12 1132 1142 10.1056/NEJMoa2119115 35179323 PMC9844551 10 Afferi L Longoni M Moschini M et al. Health-related quality of life in patients with metastatic hormone-sensitive prostate cancer treated with androgen receptor signaling inhibitors: the role of combination treatment therapy Prostate Cancer Prostatic Dis 2024 27 2 173 182 10.1038/s41391-023-00668-0 37055663 ** This study indicates that the addition of ARSIs to ADT in mHSPC tends to increase overall HR-QoL and prolong time to first deterioration of pain/fatigue compared with ADT alone. 11 Collins L Basaria S. Adverse effects of androgen deprivation therapy in men with prostate cancer: a focus on metabolic and cardiovascular complications Asian J Androl 2012 14 2 222 225 10.1038/aja.2011.109 22343494 PMC3735099 12 Longoni M Bertini A Schifano N et al. A review on pharmacological options for the treatment of erectile dysfunction: state of the art and new strategies Expert Opin Pharmacother 2023 24 12 1375 1386 10.1080/14656566.2023.2221785 37272398 13 Rosenberg IH. Sarcopenia: origins and clinical relevance J Nutr 1997 127 5 Suppl 990S 991S 10.1093/jn/127.5.990S 9164280 14 Beaudart C Zaaria M Pasleau F et al. Health outcomes of sarcopenia: a systematic review and meta-analysis. Wright JM, editor PLoS ONE 2017 12 1 e0169548 10.1371/journal.pone.0169548 28095426 PMC5240970 15 Basaria S Lieb J Tang AM et al. Long‐term effects of androgen deprivation therapy in prostate cancer patients Clin Endocrinol (Oxf) 2002 56 6 779 786 10.1046/j.1365-2265.2002.01551.x 12072048 16 Shao Y Moore DF Shih W et al. Fracture after androgen deprivation therapy among men with a high baseline risk of skeletal complications BJU Int 2013 111 5 745 752 10.1111/j.1464-410X.2012.11758.x 23331464 PMC3625488 17 Armstrong AJ Szmulewitz RZ Petrylak DP et al. ARCHES: a randomized, phase III study of androgen deprivation therapy with enzalutamide or placebo in men with metastatic hormone-sensitive prostate cancer J Clin Oncol 2019 37 32 2974 2986 10.1200/JCO.19.00799 31329516 PMC6839905 18 Matsukawa A Yanagisawa T Rajwa P et al. Toxicities of taxane-based chemotherapy in prostate cancer Curr Opin Urol 2025 35 4 453 460 10.1097/MOU.0000000000001296 40364782 19 Andersen MF Midtgaard J Bjerre ED. Do patients with prostate cancer benefit from exercise interventions? A systematic review and meta-analysis Int J Environ Res Public Health 2022 19 2 972 10.3390/ijerph19020972 35055794 PMC8776086 20 Galvão DA Taaffe DR Spry N et al. Exercise preserves physical function in prostate cancer patients with bone metastases Med Sci Sports Exerc 2018 50 3 393 399 10.1249/MSS.0000000000001454 29036016 PMC5828380 21 Schmitz KH Courneya KS Matthews C et al. American College of Sports Medicine roundtable on exercise guidelines for cancer survivors Med Sci Sports Exerc 2010 42 7 1409 1426 10.1249/MSS.0b013e3181e0c112 20559064 22 Rock CL Doyle C Demark‐Wahnefried W et al. Nutrition and physical activity guidelines for cancer survivors CA Cancer J Clin 2012 62 4 243 274 10.3322/caac.21142 22539238 23 Neefjes ECW Van Den Hurk RM Blauwhoff‐Buskermolen S et al. Muscle mass as a target to reduce fatigue in patients with advanced cancer J Cachexia Sarcopenia Muscle 2017 8 4 623 629 10.1002/jcsm.12199 28639432 PMC5566642 24 Kilgour RD Vigano A Trutschnigg B et al. Cancer‐related fatigue: the impact of skeletal muscle mass and strength in patients with advanced cancer J Cachexia Sarcopenia Muscle 2010 1 2 177 185 10.1007/s13539-010-0016-0 21475694 PMC3060645 25 Lilleby W Stensvold A Dahl AA. Fatigue and other adverse effects in men treated by pelvic radiation and long-term androgen deprivation for locally advanced prostate cancer Acta Oncol 2016 55 7 807 813 10.3109/0284186X.2015.1127417 26959297 26 Nelson AM Gonzalez BD Jim HSL et al. Characteristics and predictors of fatigue among men receiving androgen deprivation therapy for prostate cancer: a controlled comparison Support Care Cancer 2016 24 10 4159 4166 10.1007/s00520-016-3241-z 27142516 PMC4995123 27 Storey DJ McLaren DB Atkinson MA et al. Clinically relevant fatigue in men with hormone-sensitive prostate cancer on long-term androgen deprivation therapy Ann Oncol 2012 23 6 1542 1549 10.1093/annonc/mdr447 22007078 28 Winters-Stone KM Dobek JC Bennett JA et al. Resistance training reduces disability in prostate cancer survivors on androgen deprivation therapy: evidence from a randomized controlled trial Arch Phys Med Rehabil 2015 96 1 7 14 10.1016/j.apmr.2014.08.010 25194450 PMC4433162 29 Cormie P Galvão DA Spry N et al. Can supervised exercise prevent treatment toxicity in patients with prostate cancer initiating androgen‐deprivation therapy: a randomised controlled trial BJU Int 2015 115 2 256 266 10.1111/bju.12646 24467669 30 Galvão DA Taaffe DR Spry N et al. Combined resistance and aerobic exercise program reverses muscle loss in men undergoing androgen suppression therapy for prostate cancer without bone metastases: a randomized controlled trial J Clin Oncol 2010 28 2 340 347 10.1200/JCO.2009.23.2488 19949016 31 Taaffe DR Newton RU Spry N et al. Effects of different exercise modalities on fatigue in prostate cancer patients undergoing androgen deprivation therapy: a year-long randomised controlled trial Eur Urol 2017 72 2 293 299 10.1016/j.eururo.2017.02.019 28249801 32 Chan A-W Tetzlaff JM Altman DG et al. SPIRIT 2013 statement: defining standard protocol items for clinical trials Ann Intern Med 2013 158 3 200 207 10.7326/0003-4819-158-3-201302050-00583 23295957 PMC5114123 33 Oken MM Creech RH Tormey DC et al. Toxicity and response criteria of the Eastern cooperative oncology group Am J Clin Oncol 1982 5 6 649 656 10.1097/00000421-198212000-00014 7165009 34 Fox S Spiess M Hnenny L et al. Spinal instability neoplastic score (SINS): reliability among spine fellows and resident physicians in orthopedic surgery and neurosurgery Global Spine J 2017 7 8 744 748 10.1177/2192568217697691 29238637 PMC5721994 35 Mirels H. Metastatic disease in long bones. A proposed scoring system for diagnosing impending pathologic fractures Clin Orthop Relat Res 1989 249 256 264 2684463 36 Bull FC Al-Ansari SS Biddle S et al. World Health Organization 2020 guidelines on physical activity and sedentary behaviour Br J Sports Med 2020 54 24 1451 1462 10.1136/bjsports-2020-102955 33239350 PMC7719906 37 Weller S Hart NH Bolam KA et al. Exercise for individuals with bone metastases: A systematic review Crit Rev Oncol Hematol 2021 166 103433 10.1016/j.critrevonc.2021.103433 34358650 ** This systematic review shows that supervised exercise appears safe, feasible and effective for individuals with bone metastasis 38 Bressi B Cagliari M Contesini M et al. Physical exercise for bone health in men with prostate cancer receiving androgen deprivation therapy: a systematic review Support Care Cancer 2021 29 4 1811 1824 10.1007/s00520-020-05830-1 33119791 PMC7892525 39 Galvão DA Taaffe DR Cormie P et al. Efficacy and safety of a modular multi-modal exercise program in prostate cancer patients with bone metastases: a randomized controlled trial BMC Cancer 2011 11 1 517 10.1186/1471-2407-11-517 22166044 PMC3267706 ** This study demonstrates the efficacy and safety of a modular multi-modal exercise program in prostate cancer patients with bone metastases. 40 Hawley-Hague H Horne M Skelton DA et al. Review of how we should define (and measure) adherence in studies examining older adults’ participation in exercise classes BMJ Open 2016 6 6 e011560 10.1136/bmjopen-2016-011560 PMC4932302 27338884 41 Chow SC Shao J Wang H. Sample size calculations in clinical research Chapman & Hall/CRC Biostatistic Series 2008 2nd edition 42 Campbell KL Cormie P Weller S et al. Exercise recommendation for people with bone metastases: expert consensus for health care providers and exercise professionals JCO Oncol Pract 2022 18 5 e697 e709 10.1200/OP.21.00454 34990293 PMC9810134 ** International Bone Metastases Exercise Working Group recommends the integration of exercise programming into clinical care for people with bone metastasis. 43 Coletta AM Basen-Engquist KM Schmitz KH. Exercise across the cancer care continuum: why it matters, how to implement it, and motivating patients to move Am Soc Clin Oncol Educ Book 2022 42 1 7 10.1200/EDBK_349635 35394822 44 Ligibel JA Jones LW Brewster AM et al. Oncologists’ attitudes and practice of addressing diet, physical activity, and weight management with patients with cancer: findings of an asco survey of the oncology workforce J Oncol Pract 2019 15 6 e520 e528 10.1200/JOP.19.00124 31095436 PMC6827390 45 Arem H Duan X Ehlers DK et al. Provider discussion about lifestyle by cancer history: a nationally representative survey Cancer Epidemiol Biomarkers Prev 2021 30 2 278 285 10.1158/1055-9965.EPI-20-1268 33268489 PMC7867611 46 Rendina D D’Elia L Evangelista M et al. Metabolic syndrome is associated to an increased risk of low bone mineral density in free-living women with suspected osteoporosis J Endocrinol Invest 2021 44 6 1321 1326 10.1007/s40618-020-01428-w 32960417 47 Crocetto F Barone B D’Aguanno G et al. Vitamin D, a regulator of androgen levels, is not correlated to PSA serum levels in a cohort of the middle italy region participating to a prostate cancer screening campaign J Clin Med 2023 12 5 1831 10.3390/jcm12051831 36902619 PMC10003229 48 Guerra RS Amaral TF Sousa AS et al. Handgrip strength measurement as a predictor of hospitalization costs Eur J Clin Nutr 2015 69 2 187 192 10.1038/ejcn.2014.242 25369830 49 Welch SA Ward RE Beauchamp MK et al. The short physical performance battery (SPPB): a quick and useful tool for fall risk stratification among older primary care patients J Am Med Dir Assoc 2021 22 8 1646 1651 10.1016/j.jamda.2020.09.038 33191134 PMC8113335 50 Cella D Eton DT Lai JS et al. Combining anchor and distribution-based methods to derive minimal clinically important differences on the Functional Assessment of Cancer Therapy (FACT) anemia and fatigue scales J Pain Symptom Manage 2002 24 6 547 561 10.1016/S0885-3924(02)00529-8 12551804 51 Mendes MA da Silva I Ramires V et al. Metabolic equivalent of task (METs) thresholds as an indicator of physical activity intensity PLoS ONE 2018 13 7 e0200701 10.1371/journal.pone.0200701 30024953 PMC6053180 ",
  "metadata": {
    "Title of this paper": "Metabolic equivalent of task (METs) thresholds as an indicator of physical activity intensity",
    "Journal it was published in:": "Future Science OA",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12490355/"
  }
}