{
  "title": "Paper_232",
  "abstract": "pmc Health Sci Rep Health Sci Rep 3569 hscirep HSR2 Health Science Reports 2398-8835 Wiley PMC12491652 PMC12491652.1 12491652 12491652 10.1002/hsr2.71260 HSR271260 1 Letter to the Editor Letter to the Editor Letter to the Editor: The Lineage and Sublineage Investigation of Human Papillomavirus Type 16 in Tehran, Iran, During 2022–2023 Shakir Shanza https://orcid.org/0009-0002-9994-3414  1 Ali Syed Hassan https://orcid.org/0009-0004-5360-6249  1 Iqbal Javed https://orcid.org/0000-0003-2627-685X  2 jiqbal3@hamad.qa   1 Liaquat University of Medical and Health Sciences (LUMHS) Jamshoro Sindh Pakistan   2 ⁠Nursing Department Hamad Medical Corporation Doha Qatar * Correspondence: jiqbal3@hamad.qa 02 10 2025 10 2025 8 10 497543 10.1002/hsr2.v8.10 e71260 27 6 2025 18 8 2025 02 10 2025 04 10 2025 04 10 2025 © 2025 The Author(s). Health Science Reports https://creativecommons.org/licenses/by/4.0/ This is an open access article under the terms of the http://creativecommons.org/licenses/by/4.0/ This study was supported by Qatar National Library. pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement no pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes source-schema-version-number 2.0 cover-date October 2025 details-of-publishers-convertor Converter:WILEY_ML3GV2_TO_JATSPMC version:6.6.4 mode:remove_FC converted:03.10.2025 The authors of “The Lineage and Sublineage Investigation of Human Papillomavirus Type 16 in Tehran, Iran, During 2022‐2023: A Cross‐Sectional Study” offered no comments.  Dear Editor, We have read the article published by Khezeli et al., titled “The Lineage and Sublineage Investigation of Human Papillomavirus Type 16 in Tehran, Iran, During 2022–2023: A Cross‐Sectional Study” 1 2 3 Additionally, this study would not be able to differentiate between D1 and D4 sublineage, using E6 gene analysis only, results in a gap in phylogenetic resolution. A single gene analysis might not be able to fully reflect the complexity of genetic variants, unlike the phylogenetic analyses, which were carried out with MAUVE. MAUVE phylogenetic analysis evaluates the genetic composition of sublineages like D1 and D4. MAUVE phylogenetic analysis helps researchers to compare genomic sequences in great detail and to find particular mutations and changes within these D1 and D2 sub lineages that might be linked to an elevated risk of cancer in these particular sublineages [ 4 Lastly, this study does not include host genetic data, for example, HLA typing which limits the association between viral variants with host susceptibility. Cervical cancer risk is influenced by HLA gene variation, which has been connected to varying immunological responses to HPV [ 5 5 In conclusion, we want to thank the author for giving us the privilege to further investigate this remarkable topic to enhance the findings regarding the limitations. To further amplify this topic, future research should include larger and geographically diverse populations, use WGS, and integrate host genetic factors like HLA typing to improve lineage classification, evaluate virus‐host interactions, and guide towards targeted prevention and early diagnosis strategies for cervical cancer. Author Contributions  Shanza Shakir: Syed Hassan Ali: Javed Iqbal: Ethics Statement The authors have nothing to report. Consent The authors have nothing to report. Conflicts of Interest The authors declare no conflicts of interest. Acknowledgments The authors would like to thank the study entitled “ Data Availability Statement The authors have nothing to report. References 1 M. Salehi‐Vaziri F. Sadeghi H. Haeri Lineages and Sublineages of Human Papillomavirus Type 16 in Cervical Samples of Iranian Women Future Virology 18 4 2023 215 224 10.2217/fvl-2022-0174 2 Y. Liu Y. Pan W. Gao Y. Ke Z. Lu Whole‐Genome Analysis of Human Papillomavirus Types 16, 18, and 58 Isolated From Cervical Precancer and Cancer Samples in Chinese Women Scientific Reports 7 1 2017 10.1038/s41598-017-00364-9 PMC5428204 28325903 3 X. Zhe H. Xin Z. Pan Genetic Variations in E6, E7 and the Long Control Region of Human Papillomavirus Type 16 Among Patients With Cervical Lesions in Xinjiang, China Cancer Cell International 19 1 2019 65 10.1186/s12935-019-0774-5 30930693 PMC6425590 4 Ömür Baysal Figshare 2020 10.6084/m9.figshare.12326402 5 L. Bahls R. Yamakawa K. Zanão Human Leukocyte Antigen Class I and Class II Polymorphisms and Serum Cytokine Profiles in Cervical Cancer International Journal of Molecular Sciences 18 9 2017 1478 10.3390/ijms18091478 28858203 PMC5618471 ",
  "metadata": {
    "Title of this paper": "Human Leukocyte Antigen Class I and Class II Polymorphisms and Serum Cytokine Profiles in Cervical Cancer",
    "Journal it was published in:": "Health Science Reports",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12491652/"
  }
}