{
  "title": "Paper_976",
  "abstract": "pmc BMC Psychol BMC Psychol 2645 bmcpsychol BMC Psychology 2050-7283 BMC PMC12482605 PMC12482605.1 12482605 12482605 41024190 10.1186/s40359-025-03393-6 3393 1 Research A feasibility study of scheduling a remission consultation in the management of patients treated for localized breast cancer Alonso Sandrine 1 Kabani Sarah 1 Fabbro-Peray Pascale 1 Houédé Nadine 2 3 Duwig Luc luc.duwig@chu-nimes.fr 4 1 https://ror.org/0275ye937 grid.411165.6 0000 0004 0593 8241 Department of Biostatistics, Clinical Epidemiology, Public Health and Innovation in Methodology (BESPIM), CHU Nîmes, Univ Montpellier, 2 https://ror.org/0275ye937 grid.411165.6 0000 0004 0593 8241 Institut de Cancérologie du Gard, CHU Nîmes, Univ Montpellier, 3 4 https://ror.org/051escj72 grid.121334.6 0000 0001 2097 0141 Department of Medical Oncology CHU Nîmes, Univ Montpellier, 29 9 2025 2025 13 478359 1087 10 10 2024 29 8 2025 29 09 2025 01 10 2025 01 10 2025 © The Author(s) 2025 2025 https://creativecommons.org/licenses/by/4.0/ Open Access http://creativecommons.org/licenses/by/4.0/ Purpose To assess the feasibility of a remission consultation with on-going personalized care for patients treated for localized breast cancer entering a monitoring phase, while collecting quality of life data for one year. The primary objective was to evaluate the rate of acceptance of the remission consultation and, in the group who accepted, evaluate the change in quality of life using the EORTC QLQ-C30 over time. The secondary objectives were to evaluate change over time of the patient’s perception of body image via the BIS score, change over time in psychological distress score on a visual analog scale, time until return to work, and to describe the characteristics of patients according to the management methods chosen. Methods Patients in remission from non-metastatic breast cancer were invited to a one-hour consultation interview to assess psychological condition and identify personalized supportive care needs. Various psychological follow-up options were offered depending on patient needs (e.g., anxiety or depression; fear of recurrence; or difficulty reconnecting with family, friends or at work). Patients were followed up at 3, 6 and 12 months after the remission consultation. Results Of the 69 patients included, 50 (72% [95%CI 60–83]) accepted the remission consultation with a psychotherapist, with 27 opting for further follow-up. There was a significant improvement in patients’ overall quality of life ( p p p Conclusion This study evaluated acceptance rate of remission consultations and the change in patients’ quality of life, well-being and reintegration over one year following the consultation. These results suggest that a remission consultation is feasible and would be well-received by a considerable number of patients. Offering a consultation at this stage represents a first step towards a better psychological management following cancer. These preliminary results require confirmation in a multicenter study with a randomized design. Trial registration number NCT02740491 Supplementary Information The online version contains supplementary material available at 10.1186/s40359-025-03393-6. Keywords Body image Cancer remission Consultation Psycho-oncology Quality of life Transition Cancer survivors pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement yes pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes issue-copyright-statement © BioMed Central Ltd., part of Springer Nature 2025 Background In parallel with therapeutic progress, cancer care optimization is essential, in the form of a personalized accompaniment and considering all the patient’s physical, psychological and social requirements [ 1 2 3 1 3 The incidence of breast cancer in France is over 50,000 cases per year and increasing by 0.6% each year, whilst the mortality rate is decreasing by 1.3% [ 4 5 6 7 8 9 10 11 The mental effort to recover from the trial of cancer presents a substantial burden, with wider implications both to the patient and their family [ 12 13 14 15 13 We hypothesized that a “remission” consultation, offered at the end of treatment alongside optional psychological accompaniment, may have a beneficial impact on these patients’ quality of life and body image perception. The aim was to accompany patients in the intermediate stage between somatic remission and psychological healing during their return to normal life. The accompaniment should lead to overall better reintegration of patients into their private and social lives. The primary outcome of this study was to assess the acceptance rate of the remission consultation and, among those who accepted, to evaluate the change in quality of life over one year following the consultation. This included assessing feasibility of implementing such consultations and collecting quality of life data for one year. Secondary outcomes were evaluating the change of body image and psychological distress over one year following the consultation, assessing return to work, and describing the characteristics of patients based to the management methods chosen. Methods This was a prospective monocentric, pilot study. The study was approved by the French Commission Nationale de l’Informatique et des Libertés (number 1931126 v 0), is registered on clinicaltrials.gov ( NCT02740491 Participants Participants were prospectively recruited from the Medical Oncology department of Nîmes University Hospital. Eligible participants were those > 18 years old receiving care for localized breast cancer having completed adjuvant treatment (chemotherapy, radiotherapy) within the previous 9 months. As this was a non-interventional study, signed consent was not required under the French Jardé law. However, a non-opposition letter detailing the study purpose was provided to eligible patients and patient data were only included if they did not return the non-opposition form. Patients were excluded if they had metastatic disease. Any patient experiencing relapse during the 12 months of follow-up was removed from the study. Patients were followed-up for 12 months. Remission consultation At the end of their treatment, following the final consultation with their referring oncologist, patients were invited to participate in a “remission” consultation with a psychotherapist. The remission consultation lasted around one hour and was structured in two parts: the first focused on assessing the patient’s psychological state, while the second involved developing a personalized follow-up plan. First, patients were asked to recount their cancer journey, in their own words: “How did she react to the news? How did the people around her (family, friends, spouse, children, etc.) react? Is she supported? Has she stopped working or returned to work? How does she feel today? Does she have any specific needs? Is she still undergoing treatment (especially hormone therapy), and are there any side effects?”. The need for supportive care other than psychological support could then be determined: pain management, dietetics (weight gain, for example, under hormone therapy), adapted physical activity, intimacy/sexuality (vaginal dryness, dyspareunia, etc., with a gynecologist if necessary), sophrology, music therapy, socio-esthetic care, and information on post-breast cancer spa treatments. The patients were provided with information on other supportive services (e.g., oncology coordinating nurse) and organizations (e.g., Espace de rencontres et d’information, Ligue contre le cancer) and helped to make necessary appointments. Finally, the patient’s psychological state was determined: anxiety, depression, fear of recurrence, difficulty finding her place in her relationship, family, work, friends, change in body image, loss of femininity, sexuality etc. The clinician then recommended psychotherapy follow-up according to presence of any of the following: anxiety or depression; fear of recurrence; not recognizing oneself (psychologically or because of body changes: mastectomy, breast reconstruction, weight gain); or difficulty in reintegrating into the family or couple, or reconnecting with friends or at work. Depending on the patient’s needs, psychological support was offered either with the psychologist who performed the remission consultation, a psychologist the patient had seen previously, or with a private therapist. Patients could opt out of further visits, or switch between the different types of follow-up. Data collection and outcome measures Patient characteristics provided by the oncologist were recorded, even for those who declined to participate. Before or at the start of the remission consultation, patients were asked to complete self-administered questionnaires that assessed quality of life, body image, and psychological distress. During follow-up, these questionnaires were completed during routine consultations where possible, or they were sent by post at 3, 6, and 12 months after the remission consultation. Patients who did not return the mailed questionnaires were recontacted up to three times. The feasibility of implementing a remission consultation was assessed by calculating the acceptance rate among all patients to whom the consultation was offered. Among those who accepted, engagement in this process was evaluated through the rate of patients who completed self-administered questionnaires during follow-up up to 12 months after the remission consultation. The change in patients’ quality of life assessed at baseline, 3, 6 and 12 months was measured using the EORTC Quality of Life Questionnaire-Core 30 (QLQ-C30) version 3 [ 16 17 18 19 20 The change in body image assessed at baseline, 3, 6 and 12 months was measured using the Body Image Scale (BIS). The BIS is a 10-item questionnaire assessing negative sentiments towards body image in cancer patients on a 0 (not at all) to 3 (very much) scale; it is complementary to the QLQ-C30, is validated in French [ 21 22 23 24 The date until return to work after the last radiotherapy or chemotherapy treatment was recorded for patients undergoing the remission consultation. To estimate the time until return to work, patients who did not return to work during the follow-up period were censored at their last known follow-up date or at the end of the study period and patients who had returned to work prior to the remission consultation were excluded. Patient characteristics including age, living alone, living with dependents, social isolation, precarious socio-economic situation (unemployment or job loss), medical and psychiatric comorbidities, physical sequelae, untreated symptoms, and psychosocial unmet needs during treatment, were described and compared according to the management methods chosen at the end of the consultation. Comparisons were performed only for management methods applied to at least five patients. Sample size This was a feasibility study and therefore a sample size calculation was not possible. It was considered that 50 patients would be representative of the patient population. Patients thus formed a convenience sample. Statistical methods All statistical analyses were performed using SAS© (SAS Institute, Cary, NC, USA) version 9.4. Continuous variables were reported as means with standard deviations or medians with 25th and 75th percentiles, while qualitative variables were presented as frequencies with percentages. Student’s t-test or the Wilcoxon-Mann-Whitney test (depending on the distribution of continuous variables), as well as Chi-square or Fisher’s exact test, were used to compare the characteristics of patients who accepted or declined the consultation and those for whom different follow-up options were chosen by the psychologist during the consultation (among the most frequently observed, n 1  Table 1 Main characteristics of patients available at the remission consultation according to their required follow-up* (among the most frequently observed: n Characteristics Not required ( n Psychotherapeutic ( n p Age (years) 61 [50–69] 51 [46–59] 0.09 BMI (Kg/m 2 25 [23–28] 25 [22–28] 1  Level of study Primary school High school College University (≤ 2 years) University (> 2 years) 1 (4%) 2 (9%) 10 (46%) 3 (14%) 6 (27%) /1 0 1 (5%) 7 (35%) 1 (5%) 11 (55%) 0.42  Professional domain Farming Artisan, Traders, Entrepreneurs Freelance and Managerial Administrative/commercial/technical, Supervisors Employed Manuel Laborers Retired, Unemployed or Inactive 1 (4.5%) 3 (13.6%) 0 5 (22.7%) 8 (36.4%) 1 (4.5%) 4 (18.2%) 0 2 (9.5%) 3 (14.3%) 5 (23.8%) 9 (42.9%) 2 (9.5%) 0 0.37 Living alone 2 (9%) 9 (43%) 0.01 Dependent child 8 (36%) 10 (48%) 0.45 Lost job 1 (5%) 1 (5%) 1 Alcoholism history 4 (18%) 0 0.11 Smoker 2 (10%) / 2 0 /7 0.57 Depressive symptoms 0 5 (24%) 0.02 Current psychological follow-up 0 7 (33%) 0.004 Current psychiatric follow-up 0 0 - Alopecia 16 (76%) /1 2 (10%) < 0.001 Lymphedema 3 (14%) 4 (19%) 0.70 Persistent pain 15 (68%) 15 (71%) 0.82 Time since last treatment to consultation (days) 99 [49–125] 131 [55–213] 0.09 Data are mean (SD), medians [25th-75th], or number (%), /: missing data. BMI: Body Mass Index Results Enrolment and baseline characteristics Sixty-nine patients were enrolled between September 2016 and May 2018. The flow diagram is detailed in Fig. 1  Fig. 1 Flow diagram Table 2 2 n  Table 2 Patient characteristics collected by oncologist after the end of treatment Total ( n Refused consultation ( n Accepted consultation ( n p Age (years) 56 (10) 58 (10) 56 (11) 0.53 BMI (Kg/m 2 25 [22–28] 25 [22–32] 25 [22–28] 0.65  Level of study Primary school High school College University (≤ 2 years) University (> 2 years) /2 5 (8%) 6 (9%) 25 (37%) 6 (9%) 25 (37%) /1 4 (22%) 3 (17%) 7 (39%) 1 (5%) 3 (17%) /1 1 (2%) 3 (6%) 18 (37%) 5 (10%) 22 (45%) 0.02  Professional domain Farming Artisan, Traders, Entrepreneurs Freelance and Managerial Administrative/commercial/technical, Supervisors Employed Manuel Laborers Retired, Unemployed or Inactive /1 1 (1.5%) 9 (13.2%) 7 (10.3%) 15 (22.1%) 24 (35.3%) 4 (5.9%) 8 (11.8%) /1 0 3 (16.7%) 0 4 (22.2%) 6 (33.3%) 1 (5.6%) 4 (22.2%) 1 (2%) 6 (12%) 7 (14%) 11 (22%) 18 (36%) 3 (6%) 4 (8%) 0.55 Living alone 17 (25%) 5 (26%) 12 (24%) 1 Dependent child 25 (36%) 3 (16%) 22 (44%) 0.03 Lost job 5 (7%) 2 (11%) 3 (6%) 0.60 History of alcohol abuse 7 (10%) 3 (16%) 4 (8%) 0.38 Smoker 5 (9%) /13 2 (13%) / 3 3 (8%) /10 0.21 Depressive symptoms 9 (13%) 2 (11%) 7 (14%) 1 Current psychological follow-up 11 (16%) 1 (5%) 10 (20%) 0.27 Current psychiatric follow-up 0 0 0 - Alopecia 28 (42%) /2 8 (44%) /1 20 (41%) /1 0.79 Lymphedema 8 (12%) 1 (5%) 7 (14%) 0.43 Persistent pain 41 (59%) 8 (42%) 33 (66%) 0.07 Time since last treatment to oncologist consultation (days) 104 [36–191] 142 [80–190] 78 [28–194] 0.06 Data are mean (SD), medians [25th-75th], or number (%), /: missing data. BMI: Body Mass Index Acceptance Fifty patients to whom the consultation was offered accepted to participate, with an acceptance rate of 72% [95%CI 60–83]. Among the 19 patients who refused, the reasons provided were most commonly that it was not considered necessary ( n n n 1 The rate of patients who completed at least one self-administered questionnaire was 49 (98%) at the remission consultation (the non-respondent subsequently completed questionnaires), 48 (96%) at 3 months, 45 (90%) at 6 months, and 48 (96%) at 12 months. Patients who refused the consultation had less often completed at least two years of university education ( n n p n n p n n Characteristics according to follow-up At the end of the remission consultation, 27 patients (54%) wished for further follow-up, with most ( n 1 The main characteristics of patients for the most frequent choices, namely those not requiring follow-up and those requiring psychotherapeutic follow-up, are presented in Table 1 n n p n p n n p n p Change over time of quality of life, body image and psychological distress. There was an increase in patient general quality of life over time ( p p p p p p Improvements in functioning were accompanied by reductions in symptoms. Fatigue decreased from 44 [33–67] to 33 [22–56] ( p p p Body image also improved, with the BIS score decreasing from 11 [4–18] at baseline to 7 [3–14] at 12 months ( p p p 3  Table 3 Longitudinal change in quality of life (EORTC QLQ-C30), body image (BIS) and psychological distress (VAS) for patients who accepted the remission consultation Baseline ( n 3 months n 6 months n 12 months n p QLQ-C30 Summary score Change: 75 [64–90] - 78 [62–91] 2.6 [0; 5.6]; p 78 [62–91] 4.5 [2.5; 6.8]; p 83 [63–90] 4.5 [1.3; 7.6]; p 0.01 Physical Functioning Change: 80 [67–87] - 80 [67–93] 6.7 [0; 6.7]; p 80 [67–87] 0 [0; 6.7]; p 87 [73–93] 6.7 [0; 6.7]; p 0.002 Role Functioning 67 [50–100] 67 [67–100] 83 [67–100] 67 [67–100] 0.50 Emotional Functioning Change: 75 [42–92] - 71 [50–92] 8.3 [0; 8.3]; p 75 [58–92] 8.3 [0; 8.3]; p 83 [58–92] 8.3 [4.2; 16.7]; p 0.02 Cognitive Functioning Change: 67 [50–100] - 83 [67–83] 0 [0; 16.7]; p 83 [67–100] 0 [0; 16.7]; p 83 [67–100] 0 [0; 16.7]; p 0.05 Social Functioning 83 [50–100] 83 [58–100] 83 [67–100] 100 [67–100] 0.32 Global health status 67 [50–83] 67 [50–83] 67 [58–83] 75 [58–83] 0.13 Fatigue Change: 44 [33–67] - 33 [22–61] 0 [-11.1; 0]; p 33 [22–44] -11.1 [-11.1; 0]; p 33 [22–56] -11.1 [-11.1; 0]; p 0.05 Nausea Vomiting 0 [0–17] 0 [0–0] 0 [0–0] 0 [0–17] 0.40 Pain Change: 33 [17–50] - 33 [17–58] 0 [0; 0]; p 33 [17–50] 0 [-8.3; 0]; p 25 [17–58] -16.7 [-16.7; 0]; p 0.02 Dyspnea Change: 33 [0–33] - 33 [0–33] 0 [0; 0]; p 33 [0–33] 0 [0; 0]; p 33 [0–33] 0 [0; 0]; p 0.02 Insomnia 33 [0–67] 33 [0–67] 33 [0–67] 33 [0–67] 0.09 Appetite loss 0 [0–17] 0 [0–0] 0 [0–0] 0 [0–17] 0.38 Constipation 0 [0–33] 0 [0–33] 0 [0–33] 0 [0–33] 0.74 Diarrhea 0 [0–0] 0 [0–0] 0 [0–0] 0 [0–0] 0.87 Financial difficulties 0 [0–33] 0 [0–33] 0 [0–33] 0 [0–33] 0.74 Body Image Scale Change: 11 [4–18] - 7 [2–16] -1.5 [-2; -0.5]; p 9 [2–18] -1.5 [-3; 0]; p 7 [3–14] -3 [-4; -1]; p 0.007 Psychological distress Change: 20 [0–50] - 20 [5–50] 0 [-9; 0] 15 [5–40] 0 [-10; 0] 10 [2–30] 0 [-10; 0] 0.65 Data are medians [25th-75th]. p p p In sensitivity analysis, similar results were observed for changes in QLQ-C30 summary score, BIS, and psychological distress, both in unadjusted and adjusted linear mixed model (Supplementary Table 1 Time to return to work Of the 50 patients accepting the consultation, 12 (25%) returned to work over the course of the study, at a median of 259 [112–365] days after last treatment (radio- or chemotherapy). Considering only the eight patients returning to work after the consultation, the median interval until return was 166 [118–299] days after remission consultation. Four patients (8%) returned to work prior to the remission consultation, rising to six (12%) at 3 months, nine (18%) at 6 months and 12 (25%) at 12 months. From the remission consultation ( n 2 Discussion In this study, we assessed the benefit of a remission consultation for patients with breast cancer on their quality of life and body image perception. Encouragingly, patients’ acceptance rate of the remission consultation was high, with around three quarters of patients accepting it. This rate is similar to that found in a study in patients with various cancers (59% breast cancer) undergoing screening for adjustment disorder [ 25 26 11 25 The overall quality of life score increased significantly from 75 to 83 over the 12 months of follow-up. Emotional score and overall health score also increased. In parallel, two major symptoms, fatigue and pain, decreased in intensity. Fatigue, an extremely subjective symptom affected by emotional status with direct associations with quality of life, functioning, and coping [ 27 28 20 These trajectories in quality of life mirror those found by Schmidt et al. in a cohort of breast cancer patients followed for five years [ 29 30 31 At the end of the remission consultation, 44% of the women did not require aftercare, and only one patient refused aftercare despite the clinician judging it necessary. Among the participants opting for aftercare, most chose the analytical psychotherapy proposed by the investigator who performed the remission consultation. This could possibly be explained by affectionate transference towards the psychoanalyst, established and firmly engrained early on, right from the remission consultation. Some patients likely chose to continue with the hospital psychoanalyst due to the cost of sessions in private practice in France, for which they would have been liable, whereas the hospital care was state-supported. For the patients opting for different follow-up, 8% were already undergoing therapy by a hospital or freelance mental health care professional and 4% had undergone brief therapy (hypnosis). It should be noted that 55% of the patients who had benefitted from psychotherapeutic accompaniment had followed further education courses (at least 2 years), compared with 27% who had not. This further confirms the tendency already observed among those who accepted the remission consultation or not. This high level of women still requiring aftercare 12 months after remission corroborates the findings of Stanton et al. in 2005 [ 32 Body image perception improved over time, with a decreased BIS score from 11 to 7 after 12 months, which indicates that patients had a better perception of their body image over time and made progress in the psychotherapeutic work. This change crosses the cut-off point for psychological distress of ≥ 10, although no MID has been calculated for this scale [ 23 33 14 34 35 33 The return-to-work rate increased over the course of the study. We found that 8% of patients had resumed work prior to the remission consultation, rising to 25% at 12 months after the remission consultation. These rates appear modest in comparison with the published literature, but are an encouraging sign of the good physical and psychological health for these 25% of women. For 16% of women who resumed work after the remission consultation, the median time taken to resume work was 166 days after the consultation. These rates are considerably lower than found in a systematic review of studies applying various interventions (counseling and physical exercises) at the transition stage, where the return-to-work rate was over 75% [ 36 37 38 Study limitations This study had several limitations. The sample size was small, although 50 patients seemed sufficient for an observational pilot study to judge the feasibility of the remission consultation and subsequent management. Recruitment into the study was complicated by the limited consultation slots available by study investigators and the inclusion criteria that required patients to be enrolled within 9 months following final treatment. In future studies, more including oncologists will be necessary, and follow-up schedules optimized. The small sample size and the study design did not allow analyses leading to robust conclusions, thus the differing characteristics in the group of patients who accepted the remission consultation (higher education level, higher socio-professional profile and more dependent children), should be investigated in future studies. Moreover, treatment and tumor characteristics such as histological subtype and cancer stage were not collected in this study, yet they would likely influence outcomes; this information will be essential to record in future studies. We only considered quality of life and body image, whereas breast cancer patients also experience other problems such as anxiety and impaired sexual function. Moreover, the major bias of our study is the absence of a control group, preventing us from directly attributing the improvements observed to the remission consultation. This makes it challenging to disentangle the effects of the remission consultation from the natural recovery process or other external factors influencing quality of life. There are ethical implications of randomizing patients to a control group with no intervention, which could leave patients in distress. However, an active control group could be a more appropriate option, for example offering a final consultation with a non-specialist (general practitioner or nurse). In our study, the patients refusing the remission consultation could have later psychological follow-up if they wished. The benefit of a simple VAS for measuring psychological distress was the low burden for patients, however, more exhaustive and widely used questionnaires should be considered in future studies, such as the Psychosocial Distress Questionnaire-Breast Cancer or the 12-item General Health Questionnaire. Clinical implications This study is a first step towards establishing a better psychological management after breast cancer. To the best of our knowledge, it is the only study that has attempted to measure the impact of a post-cancer consultation on patients’ quality of life and well-being, as well as their reintegration. Specifically, this consultation considers the specific “transition” period that is not classically targeted in clinical studies, but is an important moment presenting the opportunity to help guide patients towards their preferred therapy. Conclusion Based on our positive preliminary results, we envisage proposing a remission consultation at our institution for women who have finished their treatment for localized breast cancer and entering into a monitoring phase for patients displaying signs of psychological distress. Coordination and organization between the hospital and the patient’s personal doctor would have to be carefully considered in order to monitor this new flow of patients. While our study aimed to assess the impact of a remission consultation, it is important to note that quality of life improvements observed over time are consistent with findings from studies tracking quality of life without specific interventions. This highlights the natural progression of quality of life and suggests that the changes observed in our study cannot be solely attributed to the remission consultation. Nevertheless, our results are encouraging, warranting further studies with a multicentric design with a control group to confirm them the benefit of integrating a remission consultation with optional psychological follow-up for patients, as a future standard procedure in post-cancer management. Supplementary Information Below is the link to the electronic supplementary material.  Supplementary Material 1  Supplementary Material 2 Publisher’s note Springer Nature remains neutral with regard to jurisdictional claims in published maps and institutional affiliations. Acknowledgements The authors are grateful to Dorian Multedo for datamanagement, Sarah El Sherif for valuable help in data collection, Pierre Rataboul for help writing the protocol and Teresa Sawyers for translation. The study was funded by an internal grant from the CHU Nîmes. Author contributions Sandrine Alonso analysed and interpreted the data, Sarah Kabani interpreted the data and edited the original draft, Pascale Fabbro-Peray contributed to the methodology, Nadine Houédé contributed to the study design, and Luc Duwig conceived the project, recruited patients, collected data and wrote the original draft. All authors read and approved the final manuscript. Funding The study was financed by an institutional grant. Data availability All data from this study are accessible upon reasonable request to luc.duwig@chu-nimes.fr. Declarations Ethical approval The study was approved by the French Commission Nationale de l’Informatique et des Libertés (number 1931126 v 0), is registered on clinicaltrials.gov ( NCT02740491 Consent for publication Not applicable. Competing interests The authors declare no competing interests. Abbreviations BIS Body image scale EORTC QLQ-C30 European organisation for research and treatment of cancer quality of life questionnaire-core 30 MID Minimally important differences VAS Visual analogue scale References 1. Bergerot C Jacobsen PB Rosa WE Global unmet psychosocial needs in cancer care: health policy eClinicalMedicine 2024 78 102942 10.1016/j.eclinm.2024.102942 39634034 PMC11615525 Bergerot C, Jacobsen PB, Rosa WE, et al. Global unmet psychosocial needs in cancer care: health policy. eClinicalMedicine. 2024;78:102942. 10.1016/j.eclinm.2024.102942 39634034 10.1016/j.eclinm.2024.102942 PMC11615525 2. Jefford M Tattersall MH Informing and involving cancer patients in their own care Lancet Oncol 2002 3 10 629 37 10.1016/S1470-2045(02)00877-X 12372725 Jefford M, Tattersall MH. Informing and involving cancer patients in their own care. Lancet Oncol. 2002;3(10):629–37. 10.1016/S1470-2045(02)00877-X 12372725 10.1016/s1470-2045(02)00877-x 3. Evans Webb M Murray E Younger ZW Goodfellow H Ross J The supportive care needs of cancer patients: a systematic review J Cancer Educ Off J Am Assoc Cancer Educ 2021 36 5 899 908 10.1007/s13187-020-01941-9 PMC8523012 33492650 Evans Webb M, Murray E, Younger ZW, Goodfellow H, Ross J. The supportive care needs of cancer patients: a systematic review. J Cancer Educ Off J Am Assoc Cancer Educ. 2021;36(5):899–908. 10.1007/s13187-020-01941-9 10.1007/s13187-020-01941-9 PMC8523012 33492650 4. Defossez G, Le Guyader–Peyrou S, Uhry Z, et al. National estimates of cancer incidence and mortality in metropolitan France between 1990 and 2018. Overview. 2019. 5. INCa. La vie cinq ans après un diagnostic de cancer. 2018. 6. Syrowatka A Motulsky A Kurteva S Predictors of distress in female breast cancer survivors: a systematic review Breast Cancer Res Treat 2017 165 2 229 45 10.1007/s10549-017-4290-9 28553684 PMC5543195 Syrowatka A, Motulsky A, Kurteva S, et al. Predictors of distress in female breast cancer survivors: a systematic review. Breast Cancer Res Treat. 2017;165(2):229–45. 10.1007/s10549-017-4290-9 28553684 10.1007/s10549-017-4290-9 PMC5543195 7. Bungener C Bioy A é Cavro The Lazarus syndrome: an issue of remission. Thoughts about cancer disease in adults Rev Francoph Psycho-Oncol 2005 4 2 74 9 10.1007/s10332-005-0059-1 Bungener C, Bioy A, é. Cavro. The Lazarus syndrome: an issue of remission. Thoughts about cancer disease in adults. Rev Francoph Psycho-Oncol. 2005;4(2):74–9. 10.1007/s10332-005-0059-1 8. Cupit-Link M Syrjala KL Hashmi SK Damocles’ syndrome revisited: update on the fear of cancer recurrence in the complex world of today’s treatments and survivorship Hematol Oncol Stem Cell Ther 2018 11 3 129 34 10.1016/j.hemonc.2018.01.005 29476707 PMC6098978 Cupit-Link M, Syrjala KL, Hashmi SK. Damocles’ syndrome revisited: update on the fear of cancer recurrence in the complex world of today’s treatments and survivorship. Hematol Oncol Stem Cell Ther. 2018;11(3):129–34. 10.1016/j.hemonc.2018.01.005 29476707 10.1016/j.hemonc.2018.01.005 PMC6098978 9. Park CL Zlateva I Blank TO Self-identity after cancer: survivor, victim, patient, and person with cancer J Gen Intern Med 2009 24 S2 430 5 10.1007/s11606-009-0993-x 19838845 PMC2763169 Park CL, Zlateva I, Blank TO. Self-identity after cancer: survivor, victim, patient, and person with cancer. J Gen Intern Med. 2009;24(S2):430–5. 10.1007/s11606-009-0993-x 19838845 10.1007/s11606-009-0993-x PMC2763169 10. Yi JC Syrjala KL Anxiety and depression in cancer survivors Med Clin North Am 2017 101 6 1099 113 10.1016/j.mcna.2017.06.005 28992857 PMC5915316 Yi JC, Syrjala KL. Anxiety and depression in cancer survivors. Med Clin North Am. 2017;101(6):1099–113. 10.1016/j.mcna.2017.06.005 28992857 10.1016/j.mcna.2017.06.005 PMC5915316 11. Becker H McAdam M Malatok S Croce E Eunju C Gonzales E What AYAs with breast cancer and their providers tell Us about survivorship need J Oncol Navig Surviv 2022 13 4 111 21 Becker H, McAdam M, Malatok S, Croce E, Eunju C, Gonzales E. What AYAs with breast cancer and their providers tell Us about survivorship need. J Oncol Navig Surviv. 2022;13(4):111–21. 12. Caruso R Breitbart W Mental health care in oncology. Contemporary perspective on the psychosocial burden of cancer and evidence-based interventions Epidemiol Psychiatr Sci 2020 29 e86 10.1017/S2045796019000866 31915100 PMC7214708 Caruso R, Breitbart W. Mental health care in oncology. Contemporary perspective on the psychosocial burden of cancer and evidence-based interventions. Epidemiol Psychiatr Sci. 2020;29:e86. 10.1017/S2045796019000866 31915100 10.1017/S2045796019000866 PMC7214708 13. Dauchy S Ellien F Lesieur A Quelle prise En charge psychologique Dans l’après-cancer ? Les recommandations de La Société Française de Psycho-Oncologie (SFPO) Psycho-Oncol 2013 7 1 4 17 10.1007/s11839-013-0409-3 Dauchy S, Ellien F, Lesieur A, et al. Quelle prise En charge psychologique Dans l’après-cancer ? Les recommandations de La Société Française de Psycho-Oncologie (SFPO). Psycho-Oncol. 2013;7(1):4–17. 10.1007/s11839-013-0409-3 14. Davis C Tami P Ramsay D Body image in older breast cancer survivors: A systematic review Psychooncology 2020 29 5 823 32 10.1002/pon.5359 32048373 Davis C, Tami P, Ramsay D, et al. Body image in older breast cancer survivors: A systematic review. Psychooncology. 2020;29(5):823–32. 10.1002/pon.5359 32048373 10.1002/pon.5359 15. Allen JD Savadatti S Levy AG The transition from breast cancer patient to Survivor Psychooncology 2009 18 1 71 8 10.1002/pon.1380 18613299 Allen JD, Savadatti S, Levy AG. The transition from breast cancer patient to. Survivor Psychooncology. 2009;18(1):71–8. 10.1002/pon.1380 18613299 10.1002/pon.1380 16. Aaronson NK Ahmedzai S Bergman B The European organization for research and treatment of cancer QLQ-C30: A Quality-of-Life instrument for use in international clinical trials in oncology JNCI J Natl Cancer Inst 1993 85 5 365 76 10.1093/jnci/85.5.365 8433390 Aaronson NK, Ahmedzai S, Bergman B, et al. The European organization for research and treatment of cancer QLQ-C30: A Quality-of-Life instrument for use in international clinical trials in oncology. JNCI J Natl Cancer Inst. 1993;85(5):365–76. 10.1093/jnci/85.5.365 8433390 10.1093/jnci/85.5.365 17. Giesinger JM Kieffer JM Fayers PM Replication and validation of higher order models demonstrated that a summary score for the EORTC QLQ-C30 is robust J Clin Epidemiol 2016 69 79 88 10.1016/j.jclinepi.2015.08.007 26327487 Giesinger JM, Kieffer JM, Fayers PM, et al. Replication and validation of higher order models demonstrated that a summary score for the EORTC QLQ-C30 is robust. J Clin Epidemiol. 2016;69:79–88. 10.1016/j.jclinepi.2015.08.007 26327487 10.1016/j.jclinepi.2015.08.007 18. Fayers P Aaronson N Bjorda K Groenvold M Curran D Bottomley A EORTC QLQ-C30 scoring manual 2001 3 Brussels European Organisation for Research and Treatment of Cancer Fayers P, Aaronson N, Bjorda K, Groenvold M, Curran D, Bottomley A. EORTC QLQ-C30 scoring manual. 3rd ed. Brussels: European Organisation for Research and Treatment of Cancer. 2001. 19. Musoro JZ Coens C Fiteni F Minimally important differences for interpreting EORTC QLQ-C30 scores in patients with advanced breast cancer JNCI Cancer Spectr 2019 3 3 pkz037 10.1093/jncics/pkz037 32328553 PMC7050000 Musoro JZ, Coens C, Fiteni F, et al. Minimally important differences for interpreting EORTC QLQ-C30 scores in patients with advanced breast cancer. JNCI Cancer Spectr. 2019;3(3):pkz037. 10.1093/jncics/pkz037 32328553 10.1093/jncics/pkz037 PMC7050000 20. Osoba D Rodrigues G Myles J Zee B Pater J Interpreting the significance of changes in health-related quality-of-life scores J Clin Oncol Off J Am Soc Clin Oncol 1998 16 1 139 44 10.1200/JCO.1998.16.1.139 9440735 Osoba D, Rodrigues G, Myles J, Zee B, Pater J. Interpreting the significance of changes in health-related quality-of-life scores. J Clin Oncol Off J Am Soc Clin Oncol. 1998;16(1):139–44. 10.1200/JCO.1998.16.1.139 10.1200/JCO.1998.16.1.139 9440735 21. Brédart A Swaine Verdier A Dolbeault S Traduction/adaptation Française de l’échelle body image scale (BIS) évaluant La perception de l’image du corps Chez des femmes Atteintes de cancer du Sein Psycho-Oncol 2007 1 1 24 30 10.1007/s11839-007-0001-9 Brédart A, Swaine Verdier A, Dolbeault S. Traduction/adaptation Française de l’échelle body image scale (BIS) évaluant La perception de l’image du corps Chez des femmes Atteintes de cancer du Sein. Psycho-Oncol. 2007;1(1):24–30. 10.1007/s11839-007-0001-9 22. Falk Dahl CA Reinertsen KV Nesvold I-L Fosså SD Dahl AA A study of body image in long-term breast cancer survivors Cancer 2010 116 15 3549 57 10.1002/cncr.25251 20564138 Falk Dahl CA, Reinertsen KV, Nesvold I-L, Fosså SD, Dahl AA. A study of body image in long-term breast cancer survivors. Cancer. 2010;116(15):3549–57. 10.1002/cncr.25251 20564138 10.1002/cncr.25251 23. Chopra D De La Garza R Lacourt TE Clinical relevance of a body image scale cut point of 10 as an indicator of psychological distress in cancer patients: results from a psychiatric oncology clinic Support Care Cancer 2021 29 1 231 7 10.1007/s00520-020-05491-0 32342222 PMC11077630 Chopra D, De La Garza R, Lacourt TE. Clinical relevance of a body image scale cut point of 10 as an indicator of psychological distress in cancer patients: results from a psychiatric oncology clinic. Support Care Cancer. 2021;29(1):231–7. 10.1007/s00520-020-05491-0 32342222 10.1007/s00520-020-05491-0 PMC11077630 24. Dolbeault S Bredart A Mignot V Screening for psychological distress in two French cancer centers: feasibility and performance of the adapted distress thermometer Palliat Support Care 2008 6 2 107 17 10.1017/S1478951508000187 18501045 Dolbeault S, Bredart A, Mignot V, et al. Screening for psychological distress in two French cancer centers: feasibility and performance of the adapted distress thermometer. Palliat Support Care. 2008;6(2):107–17. 10.1017/S1478951508000187 18501045 10.1017/S1478951508000187 25. Van Beek FE Wijnhoven LMA Custers Ja Adjustment disorder in cancer patients after treatment: prevalence and acceptance of psychological treatment Support Care Cancer Off J Multinatl Assoc Support Care Cancer 2022 30 2 1797 806 10.1007/s00520-021-06530-0 PMC8486632 34599663 Van Beek FE, Wijnhoven LMA, Custers Ja. E, et al. Adjustment disorder in cancer patients after treatment: prevalence and acceptance of psychological treatment. Support Care Cancer Off J Multinatl Assoc Support Care Cancer. 2022;30(2):1797–806. 10.1007/s00520-021-06530-0 10.1007/s00520-021-06530-0 PMC8486632 34599663 26. Sender A Friedrich M Schmidt R Geue K Cancer-specific distress, supportive care needs and satisfaction with psychosocial care in young adult cancer survivors Eur J Oncol Nurs 2020 44 101708 10.1016/j.ejon.2019.101708 31874354 Sender A, Friedrich M, Schmidt R, Geue K. Cancer-specific distress, supportive care needs and satisfaction with psychosocial care in young adult cancer survivors. Eur J Oncol Nurs. 2020;44:101708. 10.1016/j.ejon.2019.101708 31874354 10.1016/j.ejon.2019.101708 27. Abrahams HJG Gielissen MFM Verhagen CAHHVM Knoop H The relationship of fatigue in breast cancer survivors with quality of life and factors to address in psychological interventions: A systematic review Clin Psychol Rev 2018 63 1 11 10.1016/j.cpr.2018.05.004 29852324 Abrahams HJG, Gielissen MFM, Verhagen CAHHVM, Knoop H. The relationship of fatigue in breast cancer survivors with quality of life and factors to address in psychological interventions: A systematic review. Clin Psychol Rev. 2018;63:1–11. 10.1016/j.cpr.2018.05.004 29852324 10.1016/j.cpr.2018.05.004 28. Musoro JZ Coens C Sprangers MAG Minimally important differences for interpreting EORTC QLQ-C30 change scores over time: A synthesis across 21 clinical trials involving nine different cancer types Eur J Cancer Oxf Engl 1990 2023 188 171 82 10.1016/j.ejca.2023.04.027 37257278 Musoro JZ, Coens C, Sprangers MAG, et al. Minimally important differences for interpreting EORTC QLQ-C30 change scores over time: A synthesis across 21 clinical trials involving nine different cancer types. Eur J Cancer Oxf Engl 1990. 2023;188:171–82. 10.1016/j.ejca.2023.04.027 10.1016/j.ejca.2023.04.027 37257278 29. Schmidt ME Wiskemann J Steindorf K Quality of life, problems, and needs of disease-free breast cancer survivors 5 years after diagnosis Qual Life Res 2018 27 8 2077 86 10.1007/s11136-018-1866-8 29740782 Schmidt ME, Wiskemann J, Steindorf K. Quality of life, problems, and needs of disease-free breast cancer survivors 5 years after diagnosis. Qual Life Res. 2018;27(8):2077–86. 10.1007/s11136-018-1866-8 29740782 10.1007/s11136-018-1866-8 30. Muzzatti B, Bomben F, Flaiban C, Piccinin M, Annunziata MA. Quality of life and psychological distress during cancer: a prospective observational study involving young breast cancer female patients. BMC Cancer. 2020;20(1). 10.1186/s12885-020-07272-8 10.1186/s12885-020-07272-8 PMC7425052 32791959 31. Gernier F Joly F Klein D Mercier M Velten M Licaj I Cancer-related fatigue among long-term survivors of breast, cervical, and colorectal cancer: a French registry–based controlled study Support Care Cancer 2020 10.1007/s00520-020-05427-8 32253602 Gernier F, Joly F, Klein D, Mercier M, Velten M, Licaj I. Cancer-related fatigue among long-term survivors of breast, cervical, and colorectal cancer: a French registry–based controlled study. Support Care Cancer. 2020. 10.1007/s00520-020-05427-8 32253602 10.1007/s00520-020-05427-8 32. Stanton AL Ganz PA Rowland JH Meyerowitz BE Krupnick JL Sears SR Promoting adjustment after treatment for cancer Cancer 2005 104 S11 2608 13 10.1002/cncr.21246 16247779 Stanton AL, Ganz PA, Rowland JH, Meyerowitz BE, Krupnick JL, Sears SR. Promoting adjustment after treatment for cancer. Cancer. 2005;104(S11):2608–13. 10.1002/cncr.21246 16247779 10.1002/cncr.21246 33. Paterson CL, Lengacher CA, Donovan KA, Kip KE, Tofthagen CS. Body image in younger breast cancer survivors: A systematic review. Cancer Nurs. 2015;1. 10.1097/NCC.0000000000000251 10.1097/NCC.0000000000000251 PMC4607543 25881807 34. Rosenberg SM Dominici LS Gelber S Association of breast cancer surgery with quality of life and psychosocial Well-being in young breast cancer survivors JAMA Surg 2020 155 11 1035 10.1001/jamasurg.2020.3325 32936216 PMC7495332 Rosenberg SM, Dominici LS, Gelber S, et al. Association of breast cancer surgery with quality of life and psychosocial Well-being in young breast cancer survivors. JAMA Surg. 2020;155(11):1035. 10.1001/jamasurg.2020.3325 32936216 10.1001/jamasurg.2020.3325 PMC7495332 35. Edward K, Chipman M, Stephenson J, Robinson K, Giandinoto J, Trisno R. Recovery in early stage breast cancer—An Australian longitudinal study. Int J Nurs Pract. 2019;25(4). 10.1111/ijn.12747 10.1111/ijn.12747 31168880 36. Hoving J, Broekhuizen M, Frings-Dresen M. Return to work of breast cancer survivors: a systematic review of intervention studies. BMC Cancer. 2009;9(1). 10.1186/1471-2407-9-117 10.1186/1471-2407-9-117 PMC2678275 19383123 37. Bijker R Duijts SFA Smith SN de Wildt-Liesveld R Anema JR Regeer BJ Functional impairments and Work-Related outcomes in breast cancer survivors: A systematic review J Occup Rehabil 2018 28 3 429 51 10.1007/s10926-017-9736-8 29086111 PMC6096518 Bijker R, Duijts SFA, Smith SN, de Wildt-Liesveld R, Anema JR, Regeer BJ. Functional impairments and Work-Related outcomes in breast cancer survivors: A systematic review. J Occup Rehabil. 2018;28(3):429–51. 10.1007/s10926-017-9736-8 29086111 10.1007/s10926-017-9736-8 PMC6096518 38. Vayr F Montastruc M Savall F Work adjustments and employment among breast cancer survivors: a French prospective study Support Care Cancer 2020 28 1 185 92 10.1007/s00520-019-04799-w 31001691 Vayr F, Montastruc M, Savall F, et al. Work adjustments and employment among breast cancer survivors: a French prospective study. Support Care Cancer. 2020;28(1):185–92. 10.1007/s00520-019-04799-w 31001691 10.1007/s00520-019-04799-w ",
  "metadata": {
    "Title of this paper": "Work adjustments and employment among breast cancer survivors: a French prospective study",
    "Journal it was published in:": "BMC Psychology",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12482605/"
  }
}