{
  "title": "Paper_380",
  "abstract": "pmc NMC Case Rep J NMC Case Rep J 3170 nmccrj NMC Case Report Journal 2188-4226 Japan Neurosurgical Society PMC12483536 PMC12483536.1 12483536 12483536 41036425 10.2176/jns-nmc.2025-0028 1 Case Report Myxoid Glioneuronal Tumours with PDGFRA p.K385 Mutations Causing Hydrocephalus and Successfully Treated with Neuroendoscopic Surgery: A Case Report and Literature Review WAKISAKA Shoko 1 2 NAGATA Yuichi 2 FUKUOKA Toshiki 3 OHKA Fumiharu 2 SATAKE Yoshinari 4 TAKEUCHI Kazuhito 2 SAITO Ryuta 2  1  2  3  4 Corresponding author: Yuichi Nagata, M.D., Ph.D. Department of Neurosurgery, Nagoya University Hospital, 65 Tsurumai-cho, Showa-ku, Nagoya, Aichi 466-8560, Japan. e-mail: ynagata@med.nagoya-u.ac.jp 2025 9 9 2025 12 482343 361 367 31 1 2025 5 4 2025 09 09 2025 01 10 2025 02 10 2025 © 2025 The Japan Neurosurgical Society https://creativecommons.org/licenses/by-nc-nd/4.0/ This work is licensed under a Creative Commons Attribution-NonCommercial-NoDerivatives International License. Myxoid glioneuronal tumour (MGNT) is a new WHO classification of brain tumours and is defined as tumours with PDGFRA p.K385 mutations. MGNT has a predilection for the septum pellucidum, their clinical features have not yet been clarified because only a few reports exist. In this report, we present the case of a patient with an MGNT that was suitable for endoscopic resection. We discuss the clinical characteristics of MGNTs discovered during a literature review. A 19-year-old female presented with a worsening headache and a disturbance of consciousness. Head MRI revealed a mass lesion in the septum pellucidum and severe obstructive hydrocephalus. She underwent neuroendscopic surgery under general anaesthesia, and near total resection was achieved. Her symptoms improved immediately after surgery, and she was discharged without any morbidities. Pathological examination and genetic testing confirmed the diagnosis of an MGNT. A literature review revealed that 7 of 18 MGNTs developed in the septum pellucidum. Three patients had disseminated lesions at initial diagnosis, and one showed dissemination during the follow-up period. Among the 14 patients who underwent tumour resection surgery, 3 experienced recurrence or regrowth and required additional treatments. All 18 patients were alive at the last follow-up. An MGNT is a tumour that predominantly affects young people and is currently considered to have a good prognosis. However, close postoperative observation is needed because an MGNT often disseminates intracranially and/or into the spinal cord. In addition, we believe that MGNTs located in the septum pellucidum are good candidates for endoscopic resection. myxoid glioneuronal tumour dysembryoplastic neuroepithelial tumour neuroendoscopic surgery pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement no pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes Introduction Myxoid glioneuronal tumours (MGNTs) are central nervous system tumours that have been recently reclassified. According to the 2021 WHO CNS5, MGNTs are classified as grade I tumours. 1 ) 2 , 3 ) 4 , 5 ) 6 ) Case Report The patients provided informed consent for the publication of this case report and accompanying images. Patient A 19-year-old woman presented to our hospital with a two-day history of a worsening headache, mild disturbance of consciousness (E4V4V6 on the Glasgow Coma Scale) and an unsteady gait. She exhibited gait disturbances but no hemiplegia. Head computed tomography (CT) revealed ventriculomegaly and narrowed brain sulci, which indicated hydrocephalus ( Fig. 1a Fig. 1b Fig. 1c and d Fig. 1e Fig. 1 Radiological findings and intraoperative images. a-e); Preoperative radiological findings. a) CT image showing hydrocephalus. b) There was no calcification in the mass lesion. c) The mass lesion showed low intensity on T1-weighted imaging (T1WI). d) T2-weighted imaging (T2WI) showing that the intratumor component has almost the same signal as the spinal fluid. e) Axial contrast-enhanced T1WI revealed that the lesion had no signs of enhancement. f-i); Intraoperative images obtained during neuroendoscopy. f) A white tumour (white double arrow head) was observed protruding from the septum pellucidum. White arrow head: Thalamostriate vein, white asterisk: Choroid plexus. g) The right foramen of Monro (white arrow) was obstructed by the tumour. h) The tumour (white arrow head) was easily removed using suction. The tumour was hypovascular. i) The right foramen of Monro (white arrow) was no longer obstructed after tumour removal. White arrow head: Thalamostriate vein, white asterisk: Choroid plexus. j-l); Postoperative radiological findings. j) CT image showing improvement of the hydrocephalus. k) Axial contrast-enhanced T1WI revealed no residual tumour. l) The most recent MR image showing no tumour recurrence. Surgery The patient was placed in a supine position with the upper body raised approximately 15 degrees. A horizontal, 3-cm, linear skin incision was made in the right frontal region. Then, a burr hole was made in the frontal bone. After the dura mater was incised, corticotomy with a 9-mm cut was performed on the right frontal lobe. A 6.8-mm transparent cylinder (Neuroport Mini Ⓡ Ⓡ Fig. 1f Fig. 1g Fig. 1h 7 ) Fig. 1i Postoperative course The patient's symptoms of intracranial hypertension were relieved immediately after surgery. CT performed one day after surgery revealed improvement in hydrocephalus ( Fig. 1j Fig. 1k Fig. 1k Fig. 1l Pathology Microscopic examination of the tumour specimens revealed the proliferation of oligodendrocyte-like cells with monotonous round to oval nuclei and clear cytoplasm ( Fig. 2a Fig. 2b Fig. 2c Fig. 2d Fig. 2e and f Fig. 2g Fig. 2h Fig. 2 Histologic and immunohistochemical features of the tumour. a) Mucin was observed within the cyst. b) Tumour cells formed clusters around small blood vessels, accompanied by loose fibrous stroma. c) The tumour cells were mostly uniform in size, with several having clear cytoplasm and showing an oligodendrocyte-like appearance. d) Areas with a considerable amount of neuroglial fibres were observed in the tumour stroma. e) A considerable amount of neuroglial fibres showed positive staining for GFAP, as shown on the right side of the photograph. f) Tumour cells showed positive staining for Oligo2. g) Tumour cells showed positive staining for Sox10 staining. h) Synaptophysin staining was positive in the cytoplasm of perivascular cells and a few tumour cells. Additionally, granular positive findings were observed in the background. i) Genomic sequence around PDGFRA K385 analyzed with sanger sequencing. Each base is described using colored letter; A (green), G (black), C (blue) and T (red). Wild-type sequence of PDGFRA K385 is AAG (Wild-type). Sequence of K385I is ATT (Mutant). PDGFRA p.K385L mutation Genomic DNA was extracted from frozen tumour tissue obtained intraoperatively using the QIAamp DNA Mini Kit (Qiagen, Hilden, Germany) in accordance with the manufacturer's instructions. Sanger sequencing was performed to detect mutations in the PDGFRA gene. We amplified a 351-base pair (bp) fragment for the sequence encoding K385 of the PDGFRA gene. Conventional PCR was performed as follows: 35 cycles of denaturation at 94°C for 45 s, annealing at 58°C for 45 s, and extension at 72°C for 45 s, with a final extension step at 72°C for 10 min. PDGFRA forward primer (5′-TCCAGACCTTCAGTGTGTGC-3′) and reverse primer (5′-TTGGAAGACACTCATCTACAGAGC-3′) were used. Sequencing analysis was performed using ApE software (v2.0.70). Sanger sequencing under these conditions revealed the PDGFRA K385I mutation ( Fig. 2i Discussion In 2018, MGNTs were classified as a new type of brain tumour characterized by the PDGFRA p.K385 mutation. 2 , 3 ) 4 ) 8 , 9 ) 9 , 10 ) 11 ) 11 ) 12 , 13 ) 14 , 15 ) A review of previous papers revealed 17 cases of genetically diagnosed MGNT, and 18 cases, including ours, have been reported ( Table 1 16 19 ) 6 , 16 ) 6 , 18 , 19 ) 6 , 19 ) 6 ) Table 1 Clinical and pathological characteristics of MGNT Case Age Sex Tumor location Presenting symptoms Dissemination Adjuvant therapy recurrence follow-up period (year) Immunohistochemical features GFAP Oligo2 Ki67 Lucas et al (2020) 1 22 M Septum pellucidum Cognitive impairment None None recurrence 6.2 Strong positivity N/A 1 2 31 M Septum pellucidum None Intraventricular None None 1.1 Strong positivity N/A 3 3 10 M Septum pellucidum None None None None 4.3 Strong positivity Strong positivity 3 4 8 F Genu of corpus callosum Headaches None None None 1.7 Strong positivity Strong positivity N/A 5 65 F Septum pellucidum Headaches, cognitive impairment None None recurrence 12.1 N/A N/A 1 6 6 F Genu of corpus callosum None, incidental finding on follow-up imaging for prior suboccipital decompression of Chiari malformation None Stereotactic laser interstitial thermal therapy (LITT) N/A 0.5 Strong positivity N/A 4 7 28 F Rostrum of corpus callosum Headaches None None None 0.4 Strong positivity N/A 2 8 14 M Periventricular white matter of lateral ventricle Headaches, ataxia Intraventricular 54 Gy N/A 0.2 Strong positivity Strong positivity N/A Kleinschmidt et al (2022) 9 41 F Midbrain tectum Headache and neck pain Posterior fossa lesions included cerebellar nodular and leptomeningeal, cervical and thoracic cord and L5 nerve root N/A None N/A N/A N/A N/A Gilani et al (2022) 10 10 F Anterior right temporal lobe Seizures N/A N/A None N/A N/A Positive MIB1 < 1 Zhou et al (2022) 11 4 M Frontal boundary of the right ventricle Fever and convulsions N/A N/A None N/A Positive N/A N/A Caporalini et al (2023) 12 2 M Periventricular white matter of lateral ventricle Seizures None None None 10 Strong positivity Strong positivity < 1–3 13 8 M Septum pellucidum Seizures None None None 3 Strong positivity Strong positivity < 1–3 14 8 F Periventricular white matter of lateral ventricle Seizures None None None 6 Strong positivity Strong positivity < 1–3 15 10 F Septum pellucidum Headaches None None None 3 Strong positivity Strong positivity < 1–3 16 19 M Periventricular white matter of lateral ventricle Seizures None None 4 Strong positivity Strong positivity < 1–3 17 14 M Periventricular white matter of lateral ventricle Incidental finding None None None 1 Strong positivity Strong positivity < 1-3 presents 18 19 F Septum pellucidum Headache and disturbance of consciousness None None None 2 Positive <1 Our patient was successfully treated with endoscopic surgery using a mini-tubular retractor. MGNTs are hypovascular, as evidenced by Gd enhancement on MR images. In addition, MGNTs are soft and can be easily debulked using suction. Therefore, endoscopic surgery with a small-diameter cylinder can easily achieve intraoperative haemostasis and tumour debulking. 20 ) 21 23 ) The prognosis for MGNTs that are effectively removed by surgical treatment is good. Among the 9 patients who underwent GTR, two (22.2%) experienced tumour recurrence, and among the 5 patients who underwent STR, one experienced tumour enlargement and dissemination. Chemotherapy and/or radiation therapy were administered in some cases with tumour recurrence or regrowth; however, the effects of these therapies are unclear. All 18 patients were alive at the latest follow-up with mean follow-up period of 3.7 years (range: 0.2-12.1 years). Conclusion MGNTs originating in the septum pellucidum are good candidates for endoscopic tumour resection because of their location and hypovascularity. Close observation is needed even after tumour resection, as there are reports of some MGMTs disseminating, especially in cases in which gross total resection was not performed. The efficacy of chemotherapy and radiotherapy for MGNTs remains unclear. Studies of more cases are needed to clarify the inherent clinical characteristics of MGNTs. Disclaimer Author Ryuta Saito is one of the Editorial Board members of the Journal. This author was not involved in the peer-review or decision-making process for this paper. Conflicts of Interest Disclosure No potential conflicts of interest were disclosed. Acknowledgments Takanori Hirose Department of Diagnostic Pathology, Hyogo Cancer Center, Hyogo, Japan. 1) Meredith DM Pisapia DJ 2021 World Health Organization classification of brain tumors Continuum (Minneap Minn) 2023 29 1638 61 38085892 10.1212/CON.0000000000001355 2) Solomon DA Korshunov A Sill M Myxoid glioneuronal tumor of the septum pellucidum and lateral ventricle is defined by a recurrent PDGFRA p.K385 mutation and DNT-like methylation profile Acta Neuropathol 2018 136 339 43 30006677 10.1007/s00401-018-1883-2 PMC7787982 3) Bale TA Rosenblum MK The 2021 WHO classification of tumors of the central nervous system: an update on pediatric low-grade gliomas and glioneuronal tumors Brain Pathol 2022 32 e13060 35218102 10.1111/bpa.13060 PMC9245930 4) Rahim S Ud Din N Abdul-Ghafar J Clinicopathological features of dysembryoplastic neuroepithelial tumor: a case series J Med Case Rep 2023 17 327 37525202 10.1186/s13256-023-04062-1 PMC10391907 5) Sontowska I Matyja E Malejczyk J Dysembryoplastic neuroepithelial tumour: insight into the pathology and pathogenesis Folia Neuropathol 2017 55 1 13 28430287 10.5114/fn.2017.66708 6) Lucas CG Villanueva-Meyer JE Whipple N Myxoid glioneuronal tumor, PDGFRA p.K385-mutant: clinical, radiologic, and histopathologic features Brain Pathol 2020 30 479 94 31609499 10.1111/bpa.12797 PMC7780370 7) Nagata Y Takeuchi K Yamamoto T Fully endoscopic transcylinder trans-magendie foraminal approach for fourth ventricular cavernoma: a technical case report World Neurosurg 2020 142 104 7 32599186 10.1016/j.wneu.2020.06.171 8) Qaddoumi I Ellison DW Morris EB Dysembryoplastic neuroepithelial tumors and cognitive outcome: cure at a price? Cancer 2010 116 5461 9 20672357 10.1002/cncr.25528 PMC3556450 9) Ahluwalia R Miles L Hayes L Pediatric septal dysembryoplastic neuroepithelial tumor (sDNT): case-based update Childs Nerv Syst 2020 36 1127 30 32249358 10.1007/s00381-020-04581-y 10) Cataltepe O Marshall P Smith TW Dysembryoplastic neuroepithelial tumor located in pericallosal and intraventricular area in a child. Case report J Neurosurg Pediatr 2009 3 456 60 19485727 10.3171/2009.1.PEDS0823 11) Daumas-Duport C Scheithauer BW Chodkiewicz JP Dysembryoplastic neuroepithelial tumor: a surgically curable tumor of young patients with intractable partial seizures. Report of thirty-nine cases Neurosurgery 1988 23 545 56 3143922 10.1227/00006123-198811000-00002 12) Phi JH Kim SH Dysembryoplastic neuroepithelial tumor: a benign but complex tumor of the cerebral cortex Brain Tumor Res Treat 2022 10 144 50 35929111 10.14791/btrt.2022.0015 PMC9353162 13) Tonetti DA Ares WJ Richardson RM Long-term recurrence of dysembryoplastic neuroepithelial tumor: clinical case report Surg Neurol Int 2017 8 140 28781917 10.4103/2152-7806.210257 PMC5523508 14) Chiang JCH Harreld JH Tanaka R Septal dysembryoplastic neuroepithelial tumor: a comprehensive clinical, imaging, histopathologic, and molecular analysis Neuro Oncol 2019 21 800 8 30726976 10.1093/neuonc/noz037 PMC6556860 15) Zamora C Castillo M From dysembryoplastic neuroepithelial tumors to myxoid glioneuronal tumors, a new entity AJNR Am J Neuroradiol 2021 42 E77 8 34531194 10.3174/ajnr.A7273 PMC8583259 16) Kleinschmidt-DeMasters BK Chiang J Donson AM Myxoid glioneuronal tumor, PDGFRA p.K385L-mutant, arising in midbrain tectum with multifocal CSF dissemination Brain Pathol 2022 32 e13008 34297434 10.1111/bpa.13008 PMC8713525 17) Gilani A Siddiq Z Kleinschmidt-DeMasters BK Temporal lobe myxoid glioneuronal tumor, PDGFRA p.K385L-mutant with DNA methylation confirmation Brain Pathol 2022 32 e13079 35562106 10.1111/bpa.13079 PMC9425008 18) Zhou J Qu K Lv M A 4-year-old boy with a ventricular mass Brain Pathol 2022 32 e13081 35699689 10.1111/bpa.13081 PMC9425003 19) Caporalini C Scagnet M Giunti L Myxoid glioneuronal tumor: histopathologic, neuroradiologic, and molecular features in a single center series Neoplasia 2023 37 100885 36764090 10.1016/j.neo.2023.100885 PMC9929589 20) Takeuchi K Ohka F Nagata Y Endoscopic trans-mini-cylinder biopsy for intraparenchymal brain lesions World Neurosurg 2022 167 e1147 53 36089269 10.1016/j.wneu.2022.08.147 21) Narvaez EO Inada BSY de Almeida P Myxoid glioneuronal tumour - report of three cases of a new tumour in a typical location and review of literature BJR Case Rep 2021 7 20200139 35047190 10.1259/bjrcr.20200139 PMC8749391 22) Takeuchi K Nagata Y Tanahashi K Efficacy and safety of the endoscopic “wet-field” technique for removal of supratentorial cavernous malformations Acta Neurochir (Wien) 2022 164 2587 94 35732840 10.1007/s00701-022-05273-z 23) Takeuchi K Ohka F Nagata Y Endoscopic debulking canalization for optic pathway glioma with obstructive hydrocephalus Childs Nerv Syst 2023 39 3421 5 37365300 10.1007/s00381-023-06053-5 ",
  "metadata": {
    "Title of this paper": "Endoscopic debulking canalization for optic pathway glioma with obstructive hydrocephalus",
    "Journal it was published in:": "NMC Case Report Journal",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12483536/"
  }
}