{
  "title": "Paper_226",
  "abstract": "pmc Prev Med Rep 2904 pmedr Preventive Medicine Reports 2211-3355 Elsevier PMC12491731 PMC12491731.1 12491731 12491731 10.1016/j.pmedr.2025.103205 S2211-3355(25)00244-X 103205 1 Regular article Participation, knowledge, and attitudes toward cervical cancer screening among migrant Burmese women on China-Myanmar border: a cross-sectional study Hu Jiawei a b 1 Wang Honghao a 1 Zhao Shuang c Huang Liuye d Chen Xiaoqing e Zhao Xuelian a Zhang Yong zhangyong@cicams.ac.cn a ⁎ Zhao Fanghui zhaofangh@cicams.ac.cn a ⁎ a b c d e ⁎ zhangyong@cicams.ac.cn zhaofangh@cicams.ac.cn 1 These authors have contributed equally to this work and share first authorship. 10 2025 18 8 2025 58 495729 103205 10 5 2025 6 8 2025 7 8 2025 18 08 2025 04 10 2025 04 10 2025 © 2025 The Authors 2025 https://creativecommons.org/licenses/by-nc-nd/4.0/ This is an open access article under the CC BY-NC-ND license (http://creativecommons.org/licenses/by-nc-nd/4.0/). Objective This study aimed to investigate cervical cancer screening participation, knowledge of cervical cancer and screening, attitudes toward relevant healthcare services, and associated factors among migrant Burmese women in Mangshi, a county on the China-Myanmar border in Southwest China's Yunnan province. Methods A cross-sectional study was conducted in Mangshi Maternal and Child Health Hospital from October 2020 to December 2021. Migrant Burmese women attending routine gynecological examinations were recruited via convenient sampling. An interviewer-administered questionnaire was utilized to collect data. Logistic regressions were utilized to assess factors associated with cervical cancer screening participation and knowledge level. Results Among 1504 participants, 31.3 % ever attended cervical cancer screening. In the recommended age group of 25–64 years, the participation rate was 35.2 %. Screening participation was associated with age, marital status, occupation, and history of genital tract infection. Approximately 20.9 % had heard of human papillomavirus, 23.2 % knew cervical cancer is preventable, and 41.6 % had heard of cervical cancer screening. Awareness of risk factors, screening techniques, and symptoms was limited. The median knowledge score was 2.0 out of 19.0. Knowledge level was associated with education, age at menarche, number of sexual partners, and history of genital tract infection. Most (99.7 %) participants were willing to attend cervical cancer screening, but only 84.5 % would accept therapy if necessary. The most common barrier to therapy was unaffordable cost. Conclusions Migrant Burmese women in Mangshi had suboptimal screening participation and inadequate cervical cancer knowledge. Screening policies should prioritize socioeconomically disadvantaged women. Enhancing targeted health education is essential. Highlights • Migrant Burmese women in China had limited cervical cancer screening participation and knowledge. • Screening policies should prioritize socioeconomically marginalized Burmese women. • Tailored health education addressing linguistic and cultural barriers is vital. Keywords Cervical cancer Cervical cancer screening Immigrant Burmese Practice Knowledge Attitude pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement no pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes 1 Introduction Cervical cancer is the fourth common cancer among women globally, with an estimated 662,301 new cases and 348,874 deaths in 2022, disproportionately affecting low- and middle-income countries ( Bray et al., 2024 Li et al., 2017 Sun et al., 2024 Correspondingly, the World Health Organization and China's National Health Commission have launched initiatives to eliminate cervical cancer through expanded population-based screening. According to the Guidelines for Cervical Cancer Screening in China Li et al., 2023 Action Plan to Accelerate the Elimination of Cervical Cancer (2023–2030) Simms et al., 2019 Zhao et al., 2023 Bao et al., 2018 Bruni et al., 2022 Bucchi et al., 2019 Rosato et al., 2023 Crawford et al., 2016 Marques et al., 2020 Mangshi, a multiethnic border county in Dehong prefecture, Southwest China's Yunnan province, with a population of 464.3 thousand, hosts a large number of Burmese migrants who are at increased risk of sexually transmitted infections (STIs). Human immunodeficiency virus prevalence among migrant Burmese in cross-border marriages in Dehong prefecture and its capital Mangshi county has reached 2.0 % ( Xu et al., 2022 Yang et al., 2021 Gong et al., 2019 Han et al., 2016 2 Methods 2.1 Study design and participants This cross-sectional study was conducted at Mangshi Maternal and Child Health Hospital between October 2020 and December 2021. The hospital is the only facility that undertakes population-based cervical and breast cancer screening in the county. The Cervical and Breast Cancer Screening Clinic of this hospital offers free routine gynecological examinations to women with a history of sexual activity. All women attending routine gynecological examinations at the screening clinic were eligible if they: 1) were aged 14–70 years; 2) had initiated sexual intercourse; 3) had an intact cervix; 4) had no history of cervical treatment and pelvic radiotherapy; 5) were not currently pregnant; 6) were born in Myanmar with Burmese nationality; and 8) could understand the objectives, procedures, potential risks, and expected benefits of the study, and volunteered to attend the study. 2.2 Sample size determination and sampling Sample size was determined using the single-population proportion formula: (1) n = Z 1 − α / 2 2 p 1 − p / d 2 Assuming a 25.7 % expected screening coverage ( Zhang et al., 2020 2.3 Instrument and variables 2.3.1 Questionnaire The questionnaire used for interview was developed by a multidisciplinary team of gynecologists and epidemiologists and applied in several previous studies on knowledge, attitudes, and practices regarding cervical cancer ( He et al., 2017 Zhang et al., 2018a Zhang et al., 2018b Zhao et al., 2022 2.3.2 Outcome variables The primary outcome was cervical cancer screening participation, which was defined if a participant had ever attended cervical cancer screening. The secondary outcome was knowledge level. In this domain, single-choice questions were scored as one for “yes” and zero for “no” or “unknown”; multiple-choice questions awarded one point per correct answer, with a maximum score of 19 points. Knowledge level was dichotomized into high (>2 points) and low (≤2 points) levels based on the median knowledge score (2 points), following the method adopted in previous studies ( Hu et al., 2021 Xu et al., 2021 2.3.3 Explanatory variables Included variables and categorizations are as follows: age (14–24, 25–29, 30–34, 35–39, 40–44, 45–49, 50–63), marital status (single, married/cohabitating, divorced/widowed/separated), education (no formal education, primary, secondary or higher), occupational status (housewife/unemployed, farmer/laborer, public institution/company), age at menache (<14, ≥14), age at sexual debut (<20, ≥20), number of sexual partners in the last three years (≤1, >1, refuse to answer), number of deliveries (0, 1, 2, ≥3), and history of genital tract infection (GTI) (yes, no). 2.3.4 Other descriptive variables In the knowledge domain, participants who had heard of cervical cancer screening were asked about the information source. In attitudes domain, participants were asked about the willingness to participate in cervical cancer screening and perceived facilitators for participation. Regarding attitudes toward therapy, participants were asked whether they would be willing to receive therapy in a hypothetical situation where treatment would be required following screening or diagnostic results indicating precancerous lesions or cervical cancer. Participants unwilling to receive therapy even if necessary were asked about perceived barriers. 2.4 Interview and data collection All participants were interviewed face-to-face and one-on-one by trained health workers using the questionnaire in appropriate settings to ensure privacy, either at the clinic, participants' homes, or community centers in their villages, depending on participants' availability and scheduling considerations. Necessary prevention measures were implemented throughout the survey, including mask wearing, body temperature check, physical distancing, and hand disinfection, in light of the public health situation during the Covid-19 pandemic. Data were entered by trained health workers via the Goodata system, which allowed safe storage of data, data export, logic checks, and outlier and discrepancy alerts. Personal identifiers were removed from the database used for analysis to ensure participants' confidentiality. The data were stored securely in password-protected files, and access to data was limited to the core research team. 2.5 Statistical analysis Participants' characteristics were reported using frequencies with percentages. Univariable and multivariable binary logistic regressions were applied to identify factors associated with cervical cancer screening participation and knowledge level. Variables with p p 2.6 Ethics Ethical approval was obtained from the Ethics Committee of the National Cancer Center/Cancer Hospital, Chinese Academy of Medical Sciences and Peking Union Medical College, Beijing, China (Approval Number: 18-190/1768). All participants, as well as the parents/guardians of minors under the age of 18, were fully informed of the objectives, procedures, potential risks, and expected benefits, and voluntarily participated in the study. Written informed consent was obtained from all adult participants. Both written informed consent from parents/guardians and written assent from participants were obtained for minors under the age of 18. For participants who were illiteracy, fingerprint was used instead of signature for informed consent. Participants had the right to leave the study at any time. All methods were performed following relevant guidelines and regulations, and participants' privacy, confidentiality, and rights were consistently protected throughout the study. 3 Results 3.1 Sociodemographic characteristics A total of 1504 out of 1588 Burmese women with valid responses were included in the final analysis. The age of participants ranged between 14 and 63 years. The majority (88.1 %) were married or cohabitating. Approximately 40.2 % had no formal education, and 68.3 % worked as farmers or laborers. Over half experienced menarche at age 14 or later (56.7 %) and first intercourse at age 20 or later (60.0 %). Most (90.5 %) reported no more than one sexual partner in the last three years. About half (49.9 %) gave birth to two children, and 2.1 % reported a history of genital tract infection (GTI) ( Table 1 Table 1 Sociodemographic characteristics of Burmese women in Mangshi, China, 2020–2021 ( n Table 1 Characteristics N % Age (years) 14–24 249 16.6 25–29 323 21.5 30–34 338 22.5 35–39 251 16.7 40–44 190 12.6 45–49 82 5.5 50–63 71 4.7 Marital status Single 112 7.4 Married/cohabitating 1325 88.1 Divorced/widowed/separated 67 4.5 Education No formal education 604 40.2 Primary 672 44.7 Secondary or higher 228 15.2 Occupational status Housewife/unemployed 182 12.1 Farmer/laborer 1027 68.3 Public institution/company 295 19.6 Age at menarche (years) <14 651 43.3 ≥14 853 56.7 Age at sexual debut (years) <20 601 40.0 ≥20 903 60.0 Number of sexual partners in the last 3 years ≤1 1361 90.5 >1 62 4.1 Refuse to answer 81 5.4 Number of deliveries 0 183 12.2 1 337 22.4 2 750 49.9 ≥3 234 15.6 History of genital tract infection Yes 31 2.1 No 1473 97.9 3.2 Factors associated with cervical cancer screening participation Approximately 31.3 % of all participants and 35.2 % of those in recommended age group (25–64 years) had participated in cervical cancer screening before. As shown in Table 2 Table 2 Table 2 Associated factors of cervical cancer screening participation among Burmese women in Mangshi, China, 2020–2021 (n = 1504). Table 2 Variables Participation Univariable analysis Multivariable analysis OR (95 % CI) aOR (95 % CI) Age (years) 14–24 29 (11.6) 1.00 1.00 25–29 82 (25.4) 2.58 (1.63–4.09) 1.64 (1.00–2.70) 30–34 122 (36.1) 4.28 (2.74–6.70) 2.12 (1.29–3.49) 35–39 103 (41.0) 5.28 (3.33–8.38) 2.63 (1.56–4.42) 40–44 83 (43.7) 5.88 (3.63–9.53) 2.77 (1.59–4.82) 45–49 30 (36.6) 4.38 (2.42–7.92) 2.08 (1.08–3.98) 50–63 22 (31.0) 3.41 (1.81–6.43) 1.65 (0.81–3.35) Marital status Single 3 (2.7) 0.05 (0.02–0.17) 0.22 (0.06–0.81) Married/cohabitating 446 (33.7) 1.00 1.00 Divorced/widowed/separated 22 (32.8) 0.96 (0.57–1.62) 1.36 (0.75–2.45) Education No formal education 238 (39.4) 1.00 1.00 Primary 185 (27.5) 0.58 (0.46–0.74) 0.78 (0.61–1.01) Secondary or higher 48 (21.1) 0.41 (0.29–0.59) 0.88 (0.58–1.33) Occupational status Housewife/unemployed 35 (19.2) 1.00 1.00 Farmer/laborer 392 (38.2) 2.59 (1.76–3.83) 2.34 (1.56–3.50) Public institution/company 44 (14.9) 0.74 (0.45–1.20) 1.02 (0.60–1.72) Age at menarche (years) <14 217 (33.3) 1.18 (0.95–1.47) – ≥14 254 (29.8) 1.00 Age at sexual debut (years) <20 157 (26.1) 1.00 1.00 ≥20 314 (34.8) 1.51 (1.20–1.89) 1.16 (0.89–1.50) Number of sexual partners in the last 3 years ≤1 445 (32.7) 1.00 1.00 >1 4 (6.5) 0.14 (0.05–0.39) 0.39 (0.13–1.24) Refuse to answer 22 (27.2) 0.77 (0.46–1.27) 0.82 (0.47–1.41) Number of deliveries 0 19 (10.4) 1.00 1.00 1 76 (22.6) 2.51 (1.47–4.31) 0.84 (0.44–1.59) 2 294 (39.2) 5.57 (3.39–9.15) 1.39 (0.75–2.57) ≥3 82 (35.0) 4.66 (2.70–8.04) 1.11 (0.57–2.15) History of genital tract infection Yes 16 (51.6) 2.39 (1.17–4.87) 4.11 (1.78–9.52) No 445 (30.9) 1.00 1.00 – Not included in multivariable regression model. aOR, adjusted odds ratio; CI, confidence interval; OR, unadjusted odds ratio. 3.3 Knowledge about cervical cancer and screening Knowledge scores ranged from 0 to 17, with a median (interquartile range) of 2.0 (1.0–3.0). Approximately one-fifth had heard of human papillomavirus (HPV) (20.9 %) or knew cervical cancer is preventable (23.2 %). HPV infection (12.2 %) and multiple sexual partners (12.0 %) were the most frequently identified risk factors. A total of 626 (41.6 %) participants had heard of cervical cancer screening, mainly through health professionals (91.4 %) ( Fig. 1 Table 3 Fig. 1 Information sources of cervical cancer screening for Burmese women in Mangshi, China (2020–2021) (multiple choices). Fig. 1 Table 3 Knowledge about cervical cancer and screening among Burmese women in Mangshi, China, 2020–2021 (n = 1504). Table 3 Characteristics N % Heard of human papillomavirus 315 20.9 Is aware that cervical cancer is preventable 349 23.2 Is aware of the risk factors of cervical cancer Human papillomavirus infection 183 12.2 Multiple sexual partners 180 12.0 Poor hygiene 114 7.6 Human immunodeficiency virus infection 88 5.9 Smoking 79 5.3 Multiparity 14 0.9 Use of oral contraceptive pills 4 0.3 Sexually transmitted infections other than human immunodeficiency virus and human papillomavirus 1 0.1 Heard of cervical cancer screening 626 41.6 Is aware of the techniques used in primary screening Colposcopy 103 6.8 Human papillomavirus test 90 6.0 Cytology test 67 4.5 Visual inspection with acetic acid/visual inspection with Lugol's iodine 2 0.1 Agree that women at appropriate ages should attend screening regularly 1501 99.8 Is aware of the symptoms of cervical cancer Abnormal vaginal discharge 118 7.8 Intermenstrual vaginal bleeding 113 7.5 Post-coital vaginal bleeding 59 3.9 3.4 Factors associated with knowledge about cervical cancer and screening A total of 489 (32.5 %) participants with a knowledge score of >2 points were identified as having a high knowledge level. As presented in Table 3 Table 4 Table 4 Associated factors of knowledge about cervical cancer and screening among Burmese women in Mangshi, China, 2020–2021 (n = 1504). Table 4 Variables High knowledge level N (%) Univariable analysis Multivariable analysis OR (95 % CI) aOR (95 % CI) Age (years) 14–24 84 (33.7) 1.00 1.00 25–29 107 (33.1) 0.97 (0.69–1.38) 1.07 (0.74–1.54) 30–34 108 (32.0) 0.92 (0.65–1.31) 1.10 (0.76–1.60) 35–39 93 (37.1) 1.16 (0.80–1.67) 1.37 (0.93–2.03) 40–44 58 (30.5) 0.86 (0.58–1.29) 1.10 (0.71–1.69) 45–49 24 (29.3) 0.81 (0.47–1.40) 1.05 (0.59–1.84) 50–63 15 (21.1) 0.53 (0.28–0.99) 0.68 (0.35–1.30) Marital status Single 36 (32.1) 0.97 (0.64–1.46) – Married/cohabitating 435 (32.8) 1.00 Divorced/widowed/separated 18 (26.9) 0.75 (0.43–1.31) Education No formal education 170 (28.1) 1.00 1.00 Primary 212 (31.5) 1.18 (0.92–1.50) 1.16 (0.91–1.49) Secondary or higher 107 (46.9) 2.26 (1.65–3.09) 2.26 (1.61–3.17) Occupational status Housewife/unemployed 63 (34.6) 1.00 – Farmer/laborer 342 (33.3) 0.94 (0.68–1.31) Public institution/company 84 (28.5) 0.75 (0.51–1.12) Age at menarche (years) <14 244 (37.5) 1.49 (1.20–1.85) 1.48 (1.19–1.85) ≥14 245 (28.7) 1.00 1.00 Age at sexual debut (years) <20 195 (32.4) 1.00 – ≥20 294 (32.6) 1.01 (0.81–1.25) Number of sexual partners in the last 3 years ≤1 457 (33.6) 1.00 1.00 >1 17 (27.4) 0.75 (0.42–1.32) 0.60 (0.33–1.10) Refuse to answer 15 (18.5) 0.45 (0.25–0.80) 0.51 (0.28–0.90) Number of deliveries 0 57 (31.1) 1.00 – 1 97 (28.8) 0.89 (0.60–1.32) 2 276 (36.8) 1.29 (0.91–1.82) ≥3 59 (25.2) 0.75 (0.48–1.15) History of genital tract infection Yes 20 (64.5) 3.89 (1.85–8.19) 3.12 (1.46–6.71) No 469 (31.8) 1.00 1.00 – Not included in multivariable regression model. aOR, adjusted odds ratio; CI, confidence interval; OR, unadjusted odds ratio. 3.5 Attitudes toward cervical cancer screening and therapy Most (99.7 %) participants expressed the willingness to attend cervical cancer screening in the future. Health education (93.1 %) and well-organization (66.0 %) were the most frequently mentioned facilitators. Unaffordable cost (84.5 %) was the predominantly mentioned barrier among those who were unwilling to receive therapy even if necessary ( Table 5 Table 5 Attitudes toward cervical cancer screening and therapy among Burmese women in Mangshi, China, 2020–2021 (n = 1504). Table 5 Characteristics N % Willingness to participate in cervical cancer screening 1500 99.7 Perceived facilitators to participating in cervical cancer screening a Health education 1397 93.1 Well-organized programs 990 66.0 Providing transportation subsidies 489 32.6 Persuasion from family members or friends 480 32.0 Option of self-sampling method 115 7.7 Willingness to receive therapy if necessary 1271 84.5 Perceived barriers to receiving therapy b Unaffordable cost of therapy 197 84.5 A far distance from hospitals 17 7.3 Presenting no symptoms 11 4.7 Time constraint 6 2.6 Other 2 0.9 a Participants who were willing to attend cervical cancer screening ( n b Participants who were unwilling to receive therapy even if necessary ( n 4 Discussion This study revealed low cervical cancer screening participation and limited cervical cancer knowledge among migrant Burmese women in Mangshi, China. Although most expressed willingness to attend screening, approximately 15 % were unwilling to receive therapy even if necessary, primarily due to unaffordable cost. Approximately 35.2 % of Burmese women in recommended age group in our study had attended cervical cancer screening, notably lower than that of native Chinese in the capital city of Yunnan province (58.1 %) ( Yuanyue et al., 2018 Rosato et al., 2023 Al-Oseely et al., 2023 Chigbu et al., 2013 Hertzum-Larsen et al., 2019 Al-Oseely et al., 2023 Currently, however, there is no specific national cervical cancer screening policies/programs in China for migrant populations. In many regions, access to free screening services is restricted by quotas, household registration, or place of residence, which limits the inclusion of migrant women. Some border areas in Yunnan province have made specific provisions to include Burmese women in free screening programs. However, in many of these cases, eligibility is limited to those with legal residency and a formal marital relationship with Chinese citizen; Mangshi only lifted these restrictions in 2025. Similarly in Guangxi province, the border town Naliang has extended free screening services to Vietnamese women, but still restricts eligibility to those registered as local residents or permanent inhabitants. These underscore urgent need to address structural barriers in policies to improve access to cervical cancer screening among migrant women in recommended screening age group, especially those without legal citizenship and socioeconomically disadvantaged ( Guerrero et al., 2016 High knowledge level is also associated with cervical cancer screening participation among migrant women ( Al-Oseely et al., 2023 Mon et al., 2009 Wint, 2019 Yuanyue et al., 2018 Bhattacharya et al., 2022 Ekechi et al., 2014 Riza et al., 2020 Migrant Burmese women in our study demonstrated poorer knowledge of cervical cancer etiology, risk factors, and symptoms compared to both native Chinese women in the same province and native Burmese women ( Mon et al., 2009 Yuanyue et al., 2018 Uysal Toraman and Yildirim, 2018 Azzani et al., 2023 Women with vulnerable characteristics should be prioritized in health education. In our study, higher education and earlier menarche were associated with better knowledge, and history of GTI was associated with both better knowledge and screening participation, consistent with previous findings ( Argaw et al., 2022 Issa et al., 2021 Muluneh et al., 2019 Zhang et al., 2023 Peruga et al., 1993 Zhang et al., 2023 In the attitude domain, good organization was another critical facilitator mentioned by Burmese women. As most lacked access to workplace-based health check-ups, this strategy in urban areas is unfeasible in remote low-resource areas. Instead, community- or village-based screening programs should be considered. HPV-testing, with its lower frequency requirements and self-sampling option, may also enhance participation among hard-to-reach women ( Alam et al., 2023 Arrossi et al., 2015 Our study shows fewer women were willing to receive therapy than to undergo screening, with unaffordable cost being the most vital barrier. This phenomenon may be attributed to the limitations in financial support policies. In China, public financial assistance schemes for cervical/breast cancer therapy targeting women with low-income are subject to local household registration in most regions, including border areas like Mangshi. Even those maintaining a legal marriage with a Chinese citizen, who may have access to free screening programs, may be excluded from assistance schemes for cancer therapy. This emphasizes the need for robust follow-up and referral systems and inclusive financial support to address health inequity in low-resource border areas. To our knowledge, this is the first study assessing cervical cancer screening participation, knowledge, and attitudes among migrant women in China. The findings could provide insights for tailoring screening strategies and health education for migrant women in remote areas with limited health resources. However, several limitations should be noted. First, it was a monocenter study without probability sampling, though a sample size larger than anticipation might partly offset selection bias. Therefore, conclusions are limited to Burmese women in Mangshi county, and generalization to other migrant populations in border areas should be made with caution. Second, the cross-sectional design made it impossible to establish causal relationships between independent factors and outcomes. Third, recall and reporting biases inevitably existed in self-reported data. Fourth, critical factors including residency status were not fully collected. 5 Conclusions In summary, migrant Burmese women in China's southwest border areas had insufficient screening participation and inadequate knowledge regarding cervical cancer. Screening policies and financial support should prioritize socioeconomically marginalized migrant women in recommended age group. Structural barriers, such as limitations on household registration, residency status, and marital relationship, should be reduced to promote health equity. Targeted health education is essential, particularly for those who have low education, experience menarche at an older age, refuse to report sexual history, and have no GTI history. Linguistic and cultural barriers should be addressed. Screening programs should adapt to migrants' living conditions. CRediT authorship contribution statement Jiawei Hu: Honghao Wang: Shuang Zhao: Liuye Huang: Xiaoqing Chen: Xuelian Zhao: Yong Zhang: Fanghui Zhao: Funding This work was supported by the 10.13039/501100002855 Ministry of Science and Technology of the People's Republic of China 2018YFC1315504 10.13039/501100005150 Chinese Academy of Medical Sciences 2021-I2M-1-004 Declaration of competing interest The authors declare that they have no known competing financial interests or personal relationships that could have appeared to influence the work reported in this paper. References Alam Z. Cairns J.M. Scott M. Interventions to increase cervical screening uptake among immigrant women: a systematic review and meta-analysis PLoS ONE 18 6 2023 e0281976 10.1371/journal.pone.0281976 PMC10237485 37267330 Al-Oseely S. Abdul Manaf R. Ismail S. Factors affecting cervical cancer screening among Yemeni immigrant women in Klang Valley, Malaysia: a cross sectional study PLoS ONE 18 12 2023 e0290152 10.1371/journal.pone.0290152 PMC10723656 38100481 Argaw M. Embiale A. Amare B. Knowledge, and practice of cervical cancer prevention and associated factors among commercial sex workers in Shashemene town, west Arsi, Oromia region Ethiopia. BMC Womens Health 22 1 2022 233 35710370 10.1186/s12905-022-01819-6 PMC9205103 Arrossi S. Thouyaret L. Herrero R. Effect of self-collection of HPV DNA offered by community health workers at home visits on uptake of screening for cervical cancer (the EMA study): a population-based cluster-randomised trial Lancet Glob. Health 3 2 2015 e85 e94 25617202 10.1016/S2214-109X(14)70354-7 Azzani M. Ba-Alawi E. Atroosh W.M. Awareness of cervical cancer and its associated socio-demographic factors among Yemeni immigrant women in Malaysia BMC Womens Health 23 1 2023 19 36647066 10.1186/s12905-023-02172-y PMC9841630 Bao H. Zhang L. Wang L. Significant variations in the cervical cancer screening rate in China by individual-level and geographical measures of socioeconomic status: a multilevel model analysis of a nationally representative survey dataset Cancer Med. 7 5 2018 2089 2100 29573569 10.1002/cam4.1321 PMC5943548 Bhattacharya M. Xiong S. McRee A.L. Nativity differences in awareness and knowledge about HPV infection and vaccination among U.S. adults: findings from a national population-based sample J. Immigr. Minor. Health 24 3 2022 794 798 34455520 10.1007/s10903-021-01268-7 PMC8882698 Bray F. Laversanne M. Sung H. Global cancer statistics 2022: GLOBOCAN estimates of incidence and mortality worldwide for 36 cancers in 185 countries CA Cancer J. Clin. 74 3 2024 229 263 38572751 10.3322/caac.21834 Bruni L. Serrano B. Roura E. Cervical cancer screening programmes and age-specific coverage estimates for 202 countries and territories worldwide: a review and synthetic analysis Lancet Glob. Health 10 8 2022 e1115 e1127 35839811 10.1016/S2214-109X(22)00241-8 PMC9296658 Bucchi D. Chiavarini M. Bianconi F. Immigration, screening, and cervical cancer incidence: an application of age-period-cohort analysis Eur. J. Cancer Prev. 28 6 2019 529 536 30431461 10.1097/CEJ.0000000000000495 PMC6784855 Chigbu C.O. Onyebuchi A.K. Ajah L.O. Motivations and preferences of rural Nigerian women undergoing cervical cancer screening via visual inspection with acetic acid Int. J. Gynaecol. Obstet. 120 3 2013 262 265 23228820 10.1016/j.ijgo.2012.10.011 Crawford J. Ahmad F. Beaton D. Cancer screening behaviours among south Asian immigrants in the UK, US and Canada: a scoping study Health Soc. Care Commun. 24 2 2016 123 153 10.1111/hsc.12208 25721339 Ekechi C. Olaitan A. Ellis R. Knowledge of cervical cancer and attendance at cervical cancer screening: a survey of black women in London BMC Public Health 14 2014 1096 25339243 10.1186/1471-2458-14-1096 PMC4216339 Gong Y.R. Qiao S.J. Yang S.J. HIV prevalence and risk factors among premarital couples in Dehong prefecture of Yunnan Province, 2017 Chin. J. Dis. Control Prev. 23 1 2019 114 117 Guerrero N. Zhang X. Rangel G. Cervical and breast Cancer screening among Mexican migrant women, 2013 Prev. Chronic Dis. 13 2016 E104 27513995 10.5888/pcd13.160036 PMC4993116 Han J.Z. Yang Y.C. Xu C.P. Prevalence of HIV infections and its risk factors among premarital couples in Mangshi municipal from 2006 to 2013 Chin. Primary Health Care 30 3 2016 52 54 He M. Du J. Zhao F.H. Barriers and influencing factors of opportunistic screening for cervical cancer among urban women Chin. J. Public Health 33 8 2017 1166 1169 Hertzum-Larsen R. Kjær S.K. Frederiksen K. Participation in cervical cancer screening among immigrants and Danish-born women in Denmark Prev. Med. 123 2019 55 64 30796926 10.1016/j.ypmed.2019.02.023 Hu S. Xu X. Zhang Y. A nationwide post-marketing survey of knowledge, attitude and practice toward human papillomavirus vaccine in general population: implications for vaccine roll-out in mainland China Vaccine 39 1 2021 35 44 33243631 10.1016/j.vaccine.2020.11.029 Issa T. Babi A. Issanov A. Knowledge and awareness of human papillomavirus infection and human papillomavirus vaccine among Kazakhstani women attending gynecological clinics PLoS ONE 16 12 2021 e0261203 10.1371/journal.pone.0261203 PMC8668105 34898639 Li M.Z. Wei L.H. Sui L. Guidelines for cervical cancer screening in China Chin. J. Clin. Obstet. Gynecol. 24 4 2023 437 442 Li X. Zheng R. Li X. Trends of incidence rate and age at diagnosis for cervical cancer in China, from 2000 to 2014 Chin. J. Cancer Res. 29 6 2017 477 486 29353970 10.21147/j.issn.1000-9604.2017.06.02 PMC5758729 Marques P. Nunes M. Antunes M.D.L. Factors associated with cervical cancer screening participation among migrant women in Europe: a scoping review Int. J. Equity Health 19 1 2020 160 32917224 10.1186/s12939-020-01275-4 PMC7488650 Mon M.M. Mon M. Than K.K. Women’s awareness, knowledge and perceived magnitude regarding common female cancers in Yangon, Myanmar Asian Pac. J. Cancer Prev. 10 6 2009 1047 1050 20192581 Muluneh B.A. Atnafu D.D. Wassie B. Predictors of cervical cancer screening service utilization among commercial sex workers in Northwest Ethiopia: a case-control study BMC Womens Health 19 1 2019 162 31842845 10.1186/s12905-019-0862-7 PMC6915973 Peruga A. Kofie V.Y. Martinez R.M. Who won’t tell: predictors of refusal to report number of sex partners Int. J. STD AIDS 4 2 1993 86 89 8499036 10.1177/095646249300400205 Riza E. Karakosta A. Tsiampalis T. Knowledge, attitudes and perceptions about cervical Cancer risk, prevention and human papilloma virus (HPV) in vulnerable women in Greece Int. J. Environ. Res. Public Health 17 18 2020 6892 32967173 10.3390/ijerph17186892 PMC7559737 Rosato I. Dalla Zuanna T. Tricarico V. Adherence to cervical Cancer screening programs in migrant populations: a systematic review and Meta-analysis Int. J. Environ. Res. Public Health 20 3 2023 2200 36767568 10.3390/ijerph20032200 PMC9915157 Simms K.T. Steinberg J. Caruana M. Impact of scaled up human papillomavirus vaccination and cervical screening and the potential for global elimination of cervical cancer in 181 countries, 2020-99: a modelling study Lancet Oncol. 20 3 2019 394 407 30795950 10.1016/S1470-2045(18)30836-2 Sun K. Han B. Zeng H. Incidence and mortality of cancers in female genital organs - China, 2022 China CDC Wkly 6 10 2024 195 202 38523812 10.46234/ccdcw2024.040 PMC10960515 Uysal Toraman A. Yildirim N. Knowledge about cervical Cancer risk factors and practices of pap testing among Turkish immigrant women in the United States J. Immigr. Minor. Health 20 5 2018 1222 1229 28929252 10.1007/s10903-017-0653-x Wint Y.Y. Determinants of Cervical cancer Awareness, Knowledge, and Preventive Practice among Women in Yaungoo 2019 Yangon University of Economics Xu C.P. Du B.L. Hou Y. The prevalence of HIV, hepatitis C virus and syphilis and related factors among cross-border couples in Mangshi county, Dehong Dai and Jingpo autonomous prefecture of Yunnan province from 2017 to 2019 Chin. J. Prev. Med. 56 8 2022 1101 1106 10.3760/cma.j.cn112150-20211029-01001 35922238 Xu X. Wang Y. Liu Y. A nationwide post-marketing survey of knowledge, attitudes and recommendations towards human papillomavirus vaccines among healthcare providers in China Prev. Med. 146 2021 106484 10.1016/j.ypmed.2021.106484 33647350 Yang Y.C. Li Z.H. Li L. Prevalence and correlates of HIV infection among cross-border families in Dehong Dai and Jingpo autonomous prefecture Chin. J. Epidemiol. 42 4 2021 683 689 10.3760/cma.j.cn112338-20200903-01124 34814451 Yuanyue L. Baloch Z. Shanshan L. Cervical cancer, human papillomavirus infection, and vaccine-related knowledge: awareness in Chinese women Cancer Control 25 1 2018 1073274818799306 10.1177/1073274818799306 PMC6144517 30213198 Zhang A.A. Dang L. He T. Cognition and acceptability of cervical cancer screening and vaccination between Han and Mongolian women in Ordos Chin. J. Clin. Oncol. Rehabil. 25 10 2018 1153 1158 Zhang B. Wang S. Yang X. Knowledge, willingness, uptake and barriers of cervical cancer screening services among Chinese adult females: a national cross-sectional survey based on a large e-commerce platform BMC Womens Health 23 1 2023 435 37592252 10.1186/s12905-023-02554-2 PMC10436426 Zhang L. Remila R. Hu S.Y. The awareness and evaluation of women and local health providers towards cervical cancer and screening in Xiangyuan County, Shanxi Province Chin. J. Women Children Health 9 2 2018 1–5+9 Zhang M. Zhong Y. Zhao Z. Cervical cancer screening rates among Chinese women - China, 2015 China CDC Wkly 2 26 2020 481 486 34594684 10.46234/ccdcw2020.128 PMC8393124 Zhao X.L. Wang Y. Liu Z.H. Knowledge and its influencing factors of cervical cancer screening and human papillomavirus vaccines among 19 201 Chinese population Chin. J. Cancer Prev. Treat. 29 9 2022 623 629+649 Zhao X.L. Hu S.Y. Hu J.W. Tackling barriers to scale up human papillomavirus vaccination in China: progress and the way forward Infect. Dis. Poverty 12 1 2023 86 37735709 10.1186/s40249-023-01136-6 PMC10512493 Data availability Data will be made available on request. ",
  "metadata": {
    "Title of this paper": "Tackling barriers to scale up human papillomavirus vaccination in China: progress and the way forward",
    "Journal it was published in:": "Preventive Medicine Reports",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12491731/"
  }
}