{
  "title": "Paper_551",
  "abstract": "pmc EJNMMI Res EJNMMI Res 1625 ejnmmires EJNMMI Research 2191-219X Springer PMC12474809 PMC12474809.1 12474809 12474809 41003924 10.1186/s13550-025-01310-x 1310 1 Short Communication Quantitative evaluation of thyroid bed accumulation in I-131 radiotherapy: a comparison of laryngeal edema and non-edematous cases http://orcid.org/0000-0002-2817-2838 Konishi Kenta kkonishi@hama-med.ac.jp 1 Wakabayashi Kohei 1 Asao Tomoyuki 1 Kokubo Ryo 1 Aramaki Shuhei 1 Ikenohira Tsutomu 1 Fujita Haruka 2 Nakamura Katsumasa 1 https://ror.org/00ndx3g44 grid.505613.4 0000 0000 8937 6696 Department of Radiation Oncology, Hamamatsu University School of Medicine, 2 https://ror.org/0042ytd14 grid.415797.9 0000 0004 1774 9501 Division of Radiation Oncology, Shizuoka Cancer Center Hospital, 26 9 2025 2025 15 479053 119 28 4 2025 15 8 2025 26 09 2025 28 09 2025 28 09 2025 © The Author(s) 2025 2025 https://creativecommons.org/licenses/by/4.0/ Open Access http://creativecommons.org/licenses/by/4.0/ pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement no pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes issue-copyright-statement © Springer-Verlag GmbH Germany, part of Springer Nature 2025 Introduction The standard treatment for patients with differentiated thyroid cancer (DTC) is iodine-131 (I-131) radioactive iodine therapy (RAI) after a total thyroidectomy [ 1 The cause of laryngeal edema has not been established. Two possible causes are radiation-induced inflammation from remnant thyroid tissue and allergy [ 2 3 4 Methods of quantitative evaluation The patients'I-131 whole-body scan and SPECT/CT were conducted 3 days after the administration of RAI with a SPECT/CT system (Symbia Intevo 6, Siemens Healthcare, Erlangen, Germany). We used Syngo.via imaging software (Siemens Healthcare), which allowed us to measure the SUV and absolute radioactivity concentration (kBq/mL) in the lesion with the highest uptake. Volume of interest (VOI) segmentation was performed based on 40% of the maximum SUV value, and quantitative parameters (SUV and kBq/mL) were then calculated within the defined VOI This fixed-percentage threshold segmentation is an inbuilt contouring method recommended by Siemens, in which all voxels within a user-defined sphere with values > 40% of the maximum voxel value are included to determine the region of interest (ROI). The maximum SUV (SUVmax), mean SUV (SUVmean), maximum kBq/mL (max kBq/mL), and mean kBq/mL (mean kBq/mL) within the defined ROI were automatically calculated. The method was carried out as described [ 4 We compared the SUV and kBq/mL values of the thyroid bed of the present three patients with those of 14 patients identified in our previous study [ 4 Case reports Patient 1 A 61-year-old Japanese woman had undergone a right thyroid lobectomy for papillary carcinoma of the thyroid 20 years ago. Eight years later, she underwent a right cervical resection due to a recurrence at cervical lymph nodes. Three years later, a right paratracheal lymphadenectomy was performed to remove the tissue surrounding the right lobe of the thyroid gland. Seven years after that, cervical lymph-node and lung metastases appeared, and a dissection of the remaining thyroid and neck metastases was performed. Three months after that surgery, the patient underwent an iodine-controlled diet for 2 weeks and thyroid-hormone withdrawal, and she was then administered 3.70 GBq of I-131. Approximately 30 h after the administration, she experienced the sensation of tightness in the neck and respiratory distress. However, the symptoms were mild, she did not require any treatment, and she was monitored. Two days later, laryngoscopy was performed because there was no improvement in symptoms. The laryngoscopy demonstrated that the patient's epiglottis was swollen, the posterior interpharyngeal space had narrowed, and the airway was constricted (Fig. 1 Fig. 1 Patient 1, 61-year-old woman. a b c Patient 2 This 54-year-old Japanese woman had undergone a subtotal thyroidectomy and right neck dissection for poorly differentiated carcinoma of the thyroid 20 months ago. The pathological stage was T1bN1bM0, and 5 of the 12 lymph nodes were positive. Ultrasonography revealed approximately 4 mL of thyroid tissue remaining, but performing a reoperation was considered difficult due to the risk of recurrent laryngeal nerve palsy. Five months later, the patient was treated with 3.70 GBq I-131 for the removal of the remnant tissue and as adjuvant therapy. Before the treatment, a 2-week iodine-controlled diet and thyroid hormone withdrawal were performed. Twenty-four hours after the RAI administration, the patient started to experience neck swelling and dyspnea. Laryngoscopy revealed edema of the bilateral larynx and vocal cords (Fig. 2 Fig. 2 Patient 2, a 54-year-old woman. a b c Patient 3 A 29-year-old Japanese man had undergone a left thyroid lobectomy and left selective neck dissection for papillary adenocarcinoma 11 years earlier. The pathological stage was unknown. Ten years later, he underwent a completion thyroidectomy and neck dissection due to a recurrence of cervical lymph nodes. He also had multiple lung metastases. Three months after the surgery, he received a 2-week iodine-controlled diet and thyroid-hormone withdrawal and was then administered 3.70 GBq of I-131. Two days after this therapy, he experienced dysphonia and dysphagia. Laryngoscopy revealed slight edema of the vocal cords (Fig. 3 Fig. 3 Patient 3, a 29-year-old man. a b Results Three patients developed laryngeal edema after receiving 3.70 GBq of I-131. All showed strong I-131 uptake in the thyroid bed on SPECT/CT. Compared to 14 patients without edema, these three patients had significantly higher SUVmax, SUVmean, maximum kBq/mL, and mean kBq/mL values (Table 1 Table 1 Comparison of quantitative values in cases with and without laryngeal edema Patient 1 Patient 2 Patient 3 Study [ 4 p SUVmax 43.2 337.04 75.5 4.52 ± 3.54 < 0.01 SUVmean 25 242.34 30.2 2.70 ± 2.11 < 0.01 maximum kBq/mL 2608 15,083 2909 196.4 ± 143.8 < 0.01 mean kBq/mL 1510 10,845 1163 117.3 ± 85.7 < 0.01 The quantitative values in the cases with laryngeal edema were significantly higher than those of the 14 previous cases without laryngeal edema *Mann–Whitney U test Discussion At our institution, approximately 70 patients are treated with I-131 therapy at a standard dose of 3.70 GBq each year, and from the beginning of quantitative measurements in 2017 to the completion of this report in mid-2025, we have encountered only three patients with laryngeal edema. The occurrence of laryngeal edema following radioactive iodine therapy is rare, with only a small number of cases documented. However, Kinuya et al. reported that three (2.9%) of 102 patients who underwent I-131 therapy for thyroid cancer developed laryngeal edema, suggesting that the incidence of laryngeal edema might be higher than previously thought [ 5 Bal et al. reported that 15 (16.1%) of 93 patients who received 0.55–2.22 GBq of I-131 after undergoing a hemithyroidectomy for thyroid cancer developed laryngeal edema [ 6 Kinuya et al. suggested that the mechanism of laryngeal edema caused by RAI remains largely unclear but the edema is often improved with antiallergic medications and hydrocortisone, leading them to speculate that some form of allergic reaction might be involved [ 7 2 Although our present sample size is limited to the cases of three patients with laryngeal edema, all three patients demonstrated significantly higher quantitative values in the thyroid bed compared to 14 patients without edema. This suggests that high I-131 uptake in the thyroid bed might be a contributing factor to the development of laryngeal edema. Although not directly related to the study’s primary aim, we note that external radiation exposure at a distance of 1 m from the patients was measured 48 h after I-131 administration as part of routine discharge criteria in Japan (< 30 μSv/h). However, no consistent relationship between this measurement and the occurrence of laryngeal edema was observed in the present cases. Landström et al. suggested, based on their own cases and a review of 4studies, that residual thyroid tissue and high doses of I-131 might contribute to the development of laryngeal edema [ 8 One limitation of this study is the small sample size (n = 3). A further accumulation of cases is necessary to validate these findings. Conclusions In summary, we quantitatively confirmed that I-131 accumulated to a high degree in patients who developed laryngeal edema, and our findings suggest that an extremely high I-131 uptake in the thyroid bed could be one of the causes of laryngeal edema. Abbreviations DTC Differentiated thyroid cancer) RAI Radioactive iodine therapy SPECT Single photon emission computed tomography SUV Standardized uptake value CT Computed tomography VOI Volume of interest ROI Region of interest Publisher's Note Springer Nature remains neutral with regard to jurisdictional claims in published maps and institutional affiliations. Acknowledgements Not applicable. Author contributions KK and KM designed the study. KK, KW, TA and RK collected the data and performed the analysis. KK, TI interpreted the data. KK prepared the original manuscript. SA, HF and KM provided supervision. All authors contributed to the writing of the manuscript and to the revision of the manuscript. Funding Not applicable. Availability of data and materials The datasets used and/or analysed during the current study are available from the corresponding author on reasonable request. Declarations Ethics approval and consent to participate The retrospective analysis of 14 non-edematous cases used for comparison in this study was approved by the Ethics Committee of Hamamatsu University School of Medicine (Approval No. 19-086). The current retrospective report of the three cases with laryngeal edema was separately reviewed and approved by the same committee (Approval No. 81-062). Consent for publication The requirement for informed consent was waived by the committee based on the opt-out method, in accordance with institutional guidelines. Competing interests The authors have no potential conflicts of interest to disclose concerning this article. Informed consent The study protocol was reviewed and approved by the institutional review board, and informed consent was not required because of its retrospective nature. References 1. The Japanese clinical practice guidelines for the management of thyroid tumor 2018. J JAES JSTS. 2018;36:46–56. 2. Goolden AW Kam KC Fitzpatrick ML Munro AJ Oedema of the neck after ablation of the thyroid with radioactive iodine Br J Radiol 1986 59 702 583 586 10.1259/0007-1285-59-702-583 3708267 Goolden AW, Kam KC, Fitzpatrick ML, Munro AJ. Oedema of the neck after ablation of the thyroid with radioactive iodine. Br J Radiol. 1986;59(702):583–6. 3708267 10.1259/0007-1285-59-702-583 3. Dong F Li L Bian Y Standardized uptake value using thyroid quantitative SPECT/CT for the diagnosis and evaluation of Graves' disease: a prospective multicenter study Biomed Res Int 2019 10.1155/2019/7589853 30834273 PMC6374828 Dong F, Li L, Bian Y, et al. Standardized uptake value using thyroid quantitative SPECT/CT for the diagnosis and evaluation of Graves’ disease: a prospective multicenter study. Biomed Res Int. 2019. 10.1155/2019/7589853. 30834273 10.1155/2019/7589853 PMC6374828 4. Konishi K Ishiba R Ikenohira T Asao T Hirata M Ohira K Komatsu T Sawada M Tanahashi Y Goshima S Magata Y Nakamura K The relationship between the quantitative evaluation of thyroid bed uptake and the disappearance of accumulation in adjuvant radioactive iodine therapy for diferentiated thyroid cancer Ann Nucl Med 2021 35 159 166 10.1007/s12149-020-01546-8 33387279 Konishi K, Ishiba R, Ikenohira T, Asao T, Hirata M, Ohira K, Komatsu T, Sawada M, Tanahashi Y, Goshima S, Magata Y, Nakamura K. The relationship between the quantitative evaluation of thyroid bed uptake and the disappearance of accumulation in adjuvant radioactive iodine therapy for diferentiated thyroid cancer. Ann Nucl Med. 2021;35:159–66. 33387279 10.1007/s12149-020-01546-8 5. Kinuya S Yokoyama K Michigishi T Tonami N Respiratory distress caused by radioiodine therapy in patients with differentiated thyroid cancer Ann Nucl Med 2006 20 7 499 502 10.1007/BF02987260 17037283 Kinuya S, Yokoyama K, Michigishi T, Tonami N. Respiratory distress caused by radioiodine therapy in patients with differentiated thyroid cancer. Ann Nucl Med. 2006;20(7):499–502. 17037283 10.1007/BF02987260 6. Bal CS Kumar A Pant GS Radioiodine lobar ablation as an alternative to completion thyroidectomy in patients with differentiated thyroid cancer Nucl Med Commun 2003 24 2 203 208 10.1097/00006231-200302000-00013 12548045 Bal CS, Kumar A, Pant GS. Radioiodine lobar ablation as an alternative to completion thyroidectomy in patients with differentiated thyroid cancer. Nucl Med Commun. 2003;24(2):203–8. 12548045 10.1097/00006231-200302000-00013 7. Kinuya S Yoneyama T Michigishi T Airway complication occurring during radioiodine treatment for Graves’ disease Ann Nucl Med 2007 21 367 369 10.1007/s12149-007-0034-y 17705018 Kinuya S, Yoneyama T, Michigishi T. Airway complication occurring during radioiodine treatment for Graves’ disease. Ann Nucl Med. 2007;21:367–9. 17705018 10.1007/s12149-007-0034-y 8. Landström F Sandberg J Reizenstein J Life-threatening airway complication after radioactive iodine treatment: a case report and review of the literature Anticancer Res 2023 43 4 1853 1855 10.21873/anticanres.16339 36974787 Landström F, Sandberg J, Reizenstein J. Life-threatening airway complication after radioactive iodine treatment: a case report and review of the literature. Anticancer Res. 2023;43(4):1853–5. 36974787 10.21873/anticanres.16339 ",
  "metadata": {
    "Title of this paper": "Life-threatening airway complication after radioactive iodine treatment: a case report and review of the literature",
    "Journal it was published in:": "EJNMMI Research",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12474809/"
  }
}