{
  "title": "Paper_199",
  "abstract": "pmc J Biomed Opt J Biomed Opt 953 jbiomedopt JBO Journal of Biomedical Optics 1083-3668 1560-2281 Society of Photo-Optical Instrumentation Engineers PMC12493121 PMC12493121.1 12493121 12493121 10.1117/1.JBO.30.S3.S34101 25-0825 1 Special Issue Honoring Brian C. Wilson, Pioneer in Biomedical Optics Editorial Pioneer of Biomedical Optics: Brian C. Wilson Pogue Brian W. a Lilge Lothar b c d Andersson-Engels Stefan e f Madsen Steen J. g Olivo Malini C. h Vitkin Alex b d a Thayer School of Engineering at Dartmouth United States b University of Toronto Canada c University of Johannesburg South Africa d University Health Network Canada e Tyndall National Institute Ireland f University College Cork Ireland g University of Nevada, Las Vegas United States h Agency for Science Singapore 3 10 2025 12 2025 30 Suppl 3 489476 S34101 03 10 2025 04 10 2025 04 10 2025 © 2025 The Authors 2025 The Authors https://creativecommons.org/licenses/by/4.0/ Published by SPIE under a Creative Commons Attribution 4.0 International License. Distribution or reproduction of this work in whole or in part requires full attribution of the original publication, including its DOI. Abstract. The editorial introduces the special issue honoring Brian C. Wilson as a pioneer of biomedical optics. pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement no pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes running-head JBO Editorial 1 Introduction Dr Brian Wilson’s career is foundational in biomedical optics and biophotonics. He invented and articulated many key aspects of enabling technologies, deepened our fundamental theoretical understanding, and drove the medical translation of novel devices. His impact could be quantified in many ways—traditional measures such as publications, funded grants, citations, trainees, etc. are indeed all outstanding—but perhaps his larger and longer-lasting impact has been his altruistic approach that infects his colleagues with scientific curiosity, thereby initiating the establishment of large research group in biophotonics and advancing collaborations across institutions, countries and disciplines. The overarching goal of clinical impact, advancing hand-in-hand with the underlying approaches of basic scientific insight and technological innovation, is his signature approach. This unique blend of altruism in interactions, innovation, and scientific rigor in methodology has yielded widespread networks of collaborators across all continents, and justly earned Brian the reputation of being one of the most desired biophotonics consultants to major institutions and companies across the world. His role in the application of optics in cancer research also positioned him at the forefront of many advisory boards, both national and international, that shape the science of optical devices to enhance and advance human health. Brian’s scientific journey, and the subsequent expansion of biophotonics R&D in Canada, occurred in two major steps, first when he launched the original Biomedical Optics Group at the Hamilton Regional Cancer Centre/McMaster University [ Fig. 1(a) Laboratory for Applied Biophotonics Fig. 1(b) Fig. 2 Fig. 3 Fig. 1 An early pre-digital photograph of Brian C. Wilson associated with a paper in the IEEE (bearing a striking resemblance to a young Ringo Starr as relayed by Dr. Michael Patterson) and a more recent digital photo from Toronto. Fig. 2 Brian C. Wilson publication record showing (a) continuous progression over nearly 4 decades, and (b) a surprising similarity to the Toronto skyline. Fig. 3 Wordle of key publication co-authors (a) and key scientific words from his publications (b) over the course of 45+ years of work. Dr. Wilson completed his PhD in experimental particle physics University of Glasgow and CERN, Geneva. He subsequently transitioned to medical physics at the Royal Marsden Hospital/Institute of Cancer Research in London, where he worked on therapeutic and diagnostic radiology/nuclear medicine. This continued upon moving to Australia, and then in Canada, where he developed a parallel career in biophotonics, particularly applied to cancer research diagnostics and therapeutics. His impact in the field is broader than his specific scientific contributions and extends internationally. His infectious spirit and genuine collegiality have inspired many others and provided innovative ideas to other institutions, building their own biophotonics initiatives. Examples of prominent collaborators are illustrated in Fig. 3 2 Founding Principles of Photodynamic Therapy – Initiating Canadian Biomedical Optics His transition to biomedical optics occurred when he stumbled across a seminal paper on problems in dosimetry of the emerging modality of photodynamic therapy, PDT. This led to fundamental studies of tissue optics, starting with the first paper on the use of the Monte Carlo model of light propagation in tissue, 1 2 – 5 5 , 6 3 , 7 – 9 Fig. 4(a) Fig. 4(b) 10 – 13 Fig. 5 Fig. 4 (a) Balloon irradiator devised to illuminate PDT in the resection bed of the brain during neurosurgical treatment, used in many clinical cases. 7 5 Fig. 5 The time-dependent diffusion equation was first solved analytically by Michael Patterson, Britton Chance, and Brian Wilson, 11 A seminal theoretical paper by Patterson, Wilson and Chance in 1989 11 14 , 15 In parallel, Dr. Wilson carried out fundamental photobiological studies on PDT-induced resistance with colleague Gurmit Singh, 16 – 18 19 – 21 22 – 25 3 Explosion of Biophotonics – Toronto Years His move to Toronto in 1993 as Head of the Division of Clinical Physics at the Princess Margaret Hospital and Professor of Medical Biophysics at the University of Toronto enabled him to expand his research in new directions, including advanced instrumentation for singlet oxygen dosimetry, 26 – 39 40 – 46 36 , 47 , 48 49 – 54 55 He also recognized the potential of PDT in non-cancer applications, such as targeting bacteria and viruses, including for organ transplantation and, most recently, SARS-CoV-2, which included a first-in-class clinical trial for nasal photo-decontamination. 54 , 56 57 A major spin-off from his PDT work was fluorescence spectroscopy/imaging-based diagnostics, in which he led many early conceptual and technological studies, clinical trials, and commercial translation, particularly based on endogenous and exogenous fluorophores. Notable here is his collaboration with Toronto GI endoscopist Dr. Norman Marcon on the detection of dysplastic lesions in Barrett’s esophagus and adenomatous polyps in the colon. 58 – 60 Broad interest in fluorescence diagnostics merged with his focus on PDT in glioma tumors, developing an extensive series of studies with collaborators, using Photofrin fluorescence for surgical guidance (FGS) with graduate student Victor Yang and others. 61 Fig. 6 62 – 65 66 67 68 , 69 70 – 78 49 – 53 , 79 60 , 80 – 84 Fig. 6 (a) Design of an early co-axial multi-wavelength fluorescence imaging and spectroscopy system. (b) Surgical setup with the prototype system and examples of white light before resection (c), after resection (d) and corresponding fluorescence images (e) and (f) in intracranial rabbit tumor model. 62 These advances were accompanied by interest in contrast agents and in the 2000s the push in nanotechnology for multimodal imaging and theranostics. This spans C-60 (Bucky balls), quantum dots, SERS-coated gold nanoparticles, and scintillation nanoparticles for x-ray-mediated PDT. 85 – 87 88 – 93 A unique aspect of his career is his increasing focus on photobiology in addition to optical biophysics and engineering. Most recently, this has included functional and mechanistic studies of 2-photon activation and immune stimulation in photodynamic therapy, applied to cutaneous and ocular melanoma. 54 , 94 , 95 4 Shaping Careers, Institutions, and the International Landscape in Biomedical Optics and Biophotonics To date Brian has supervised 20 MS students, 25 PhD/MD-PhD students, and 41 postdoctoral trainees (including Clinical Fellows), with another 8 trainees currently. The number of senior faculty who owe their career advancement to formal and informal mentorship and collaboration with Dr. Wilson is in the hundreds. Appreciation of his mentorship from his own trainees and those of his collaborators is evident in the fact that he is continues to publish with many of them. A key part of his approach to science has been cross-institutional collaborations, focusing on advancing the field rather than simply advancing his own program or institution. This is evident in the numerous advisory boards and visiting appointments he has maintained over the past 4+ decades. Importantly, he has been advisory to foundational centers on biophotonics at the Wellman Center for Photomedicine in Boston 96 Fig. 7 Fig. 7 (a) The locations of co-author institutions for individuals who published multiple papers with Prof. Wilson illustrate his impact throughout extensive global collaborations, especially with former trainees. (b) At a recent International Photodynamic Society Meeting in Finland, with Lothar Lilge (UHN/U Toronto), Carolyn Cross (Ondine Biomed Inc), and Tayyaba Hasan (MGH/Harvard). Fig. 8 Receiving SPIE Fellow status in 2018, 4 years after receiving the SPIE Britton Chance Award. His positions in international advisory boards have gone on to shape biophotonics worldwide. His practical approach to translating research findings for human benefit naturally led him to become involved with companies as a founder or advisory board member in over 23 ventures. This contribution continues and will help shape the face of clinical and commercial biophotonics in the future. The number of conferences he organized over his career is extensive, and his involvement continues to this day. He has been a committee chair of nearly every biomedical optics and photodynamic therapy conference that has existed. This includes a NATO Advanced Institute on Biophotonics, the Gordon Research Conferences, Engineering Conferences International, the International Society for Optics Within Lifesciences (OWLS), Photonics North, and the International Photodynamic Association, to name a few. He initiated and presided over Biophotonics Week in Quebec in 2010, which comprised five separate complementary conferences in biophotonics. He has actively participated in all the biomedical optics major conferences for decades, leading where needed, such as SPIE-BiOS and Optica Biomed. His real forte was shaping focused topical conferences with key speakers and leading groups to advance fields rather than just report on results. Among his notable awards are the Mark Award of the American Society for Laser Medicine & Surgery, a Lifetime Achievement Award from the NIH Workshop on Optical Imaging, the Robert L. Noble Prize in Cancer Research, the OSA/Optica Michael S. Feld Biophotonics Award, the SPIE Britton Chance Award ( Fig. 8 Dr. Wilson continues his career unabated, carrying on research, advising, and consulting at a level unheard of for most academics. He is truly a foundational pioneer of biomedical optics/biophotonics and translational cancer research, with immense local, regional, and global impact. Disclosures No conflicts of interest, financial or otherwise, are declared by the authors. References 1. Wilson B. C. Adam G. A Monte Carlo model for the absorption and flux distributions of light in tissue Med. Phys. 10 6 824 830 1983 MPHYA6 0094-2405 10.1118/1.595361 6656695 2. Wilson B. C. Muller P. J. Yanch J. C. Instrumentation and light dosimetry for intra-operative photodynamic therapy (PDT) of malignant brain tumours Phys. Med. Biol. 31 2 125 133 1986 PHMBA7 0031-9155 10.1088/0031-9155/31/2/002 3008201 3. Wilson B. C. Patterson M. S. The physics of photodynamic therapy Phys. Med. Biol. 31 4 327 360 1986 PHMBA7 0031-9155 10.1088/0031-9155/31/4/001 3526361 4. Patterson M. S. et al. The measurement of dihematoporphyrin ether concentration in tissue by reflectance spectrophotometry Photochem. Photobiol. 46 3 337 343 1987 PHCBAP 0031-8655 10.1111/j.1751-1097.1987.tb04778.x 2959972 5. Wilson B. C. Patterson M. S. Flock S. T. Indirect versus direct techniques for the measurement of the optical properties of tissues Photochem. Photobiol. 46 5 601 608 1987 PHCBAP 0031-8655 10.1111/j.1751-1097.1987.tb04820.x 3441488 6. Flock S. T. Wilson B. C. Patterson M. S. Total attenuation coefficients and scattering phase functions of tissues and phantom materials at 633 nm Med. Phys. 14 5 835 841 1987 MPHYA6 0094-2405 10.1118/1.596010 3683313 7. Muller P. J. Wilson B. C. Photodynamic therapy: cavitary photoillumination of malignant cerebral tumours using a laser coupled inflatable balloon Can. J. Neurol. Sci. 12 S4 371 373 1985 10.1017/S0317167100035563 3002572 8. Muller P. J. Wilson B. C. Photodynamic therapy of malignant primary brain tumours: clinical effects, post-operative ICP, and light penetration of the brain Photochem. Photobiol. 46 5 929 935 1987 PHCBAP 0031-8655 10.1111/j.1751-1097.1987.tb04871.x 3441514 9. Muller P. J. Wilson B. C. Photodynamic therapy of malignant brain tumours Can. J. Neurol. Sci. 17 2 193 198 1990 10.1017/S0317167100030444 2357655 10. Wyman D. R. Patterson M. S. Wilson B. C. Similarity relations for the interaction parameters in radiation transport Appl. Opt. 28 24 5243 5249 1989 APOPAI 0003-6935 10.1364/AO.28.005243 20556035 11. Patterson M. S. Chance B. Wilson B. C. Time resolved reflectance and transmittance for the non-invasive measurement of tissue optical properties Appl. Opt. 28 12 2331 2336 1989 APOPAI 0003-6935 10.1364/AO.28.002331 20555520 12. Madsen S. J. et al. Experimental tests of a simple diffusion model for the estimation of scattering and absorption coefficients of turbid media from time-resolved diffuse reflectance measurements Appl. Opt. 31 18 3509 3517 1992 APOPAI 0003-6935 10.1364/AO.31.003509 20725319 13. Prahl S. A. et al. Determination of optical properties of turbid media using pulsed photothermal radiometry Phys. Med. Biol. 37 6 1203 1217 1992 PHMBA7 0031-9155 10.1088/0031-9155/37/6/001 1626021 14. Farrell T. J. Patterson M. S. Wilson B. A diffusion theory model of spatially resolved, steady-state diffuse reflectance for the noninvasive determination of tissue optical properties in vivo Med. Phys. 19 4 879 888 1992 MPHYA6 0094-2405 10.1118/1.596777 1518476 15. Kienle A. et al. Spatially resolved absolute diffuse reflectance measurements for noninvasive determination of the optical scattering and absorption coefficients of biological tissue Appl. Opt. 35 13 2304 2314 1996 APOPAI 0003-6935 10.1364/AO.35.002304 21085367 16. Singh G. et al. Resistance to photodynamic therapy in radiation induced fibrosarcoma-1 and Chinese hamster ovary-multi-drug resistant. Cells in vitro Photochem. Photobiol. 54 2 307 312 1991 PHCBAP 0031-8655 10.1111/j.1751-1097.1991.tb02021.x 1838198 17. Sharkey S. M. et al. Mitochondrial alterations in photodynamic therapy-resistant cells Cancer Res. 53 20 4994 4999 1993 CNREA8 0008-5472 8402690 18. Moorehead R. A. et al. Cross-resistance to cisplatin in cells resistant to photofrin-mediated photodynamic therapy Cancer Res. 54 10 2556 2559 1994 CNREA8 0008-5472 7909492 19. Chen Q. et al. The effect of light fluence rate in photodynamic therapy of normal rat brain Radiat. Res. 132 1 120 123 1992 RAREAE 0033-7587 10.2307/3578343 1410268 20. Chen Q. et al. Effects of light beam size on fluence distribution and depth of necrosis in superficially applied photodynamic therapy of normal rat brain Photochem. Photobiol. 56 3 379 384 1992 PHCBAP 0031-8655 10.1111/j.1751-1097.1992.tb02174.x 1438573 21. Lilge L. et al. Light dosimetry for intraperitoneal photodynamic therapy in a murine xenograft model of human epithelial ovarian carcinoma Photochem. Photobiol. 68 3 281 288 1998 PHCBAP 0031-8655 10.1111/j.1751-1097.1998.tb09682.x 9747583 22. Patterson M. S. Wilson B. C. Graff R. In vivo tests of the concept of photodynamic threshold dose in normal rat liver photosensitized by aluminum chlorosulphonated phthalocyanine Photochem. Photobiol. 51 3 343 349 1990 PHCBAP 0031-8655 10.1111/j.1751-1097.1990.tb01720.x 2356229 23. Farrell T. J. et al. Comparison of the in vivo photodynamic threshold dose for photofrin, mono- and tetrasulfonated aluminum phthalocyanine using a rat liver model Photochem. Photobiol. 68 3 394 399 1998 PHCBAP 0031-8655 10.1111/j.1751-1097.1998.tb09698.x 9747595 24. Lilge L. Wilson B. C. Photodynamic therapy of intracranial tissues: a preclinical comparative study of four different photosensitizers J. Clin. Laser Med. Surg. 16 2 81 91 1998 JCLSEO 10.1089/clm.1998.16.81 9663099 25. Lilge L. Portnoy M. Wilson B. C. Apoptosis induced in vivo by photodynamic therapy in normal brain and intracranial tumour tissue Br. J. Cancer 83 8 1110 1117 2000 BJCAAI 0007-0920 10.1054/bjoc.2000.1426 10993661 PMC2363569 26. Patterson M. S. Madsen S. J. Wilson B. C. Experimental tests of the feasibility of singlet oxygen luminescence monitoring in vivo during photodynamic therapy J. Photochem. Photobiol B 5 1 69 84 1990 10.1016/1011-1344(90)85006-I 2111394 27. Niedre M. Patterson M. S. Wilson B. C. Direct near-infrared luminescence detection of singlet oxygen generated by photodynamic therapy in cells in vitro and tissues in vivo Photochem. Photobiol. 75 4 382 391 2002 PHCBAP 0031-8655 10.1562/0031-8655(2002)0750382DNILDO2.0.CO2 12003128 28. Niedre M. J. et al. In vitro tests of the validity of singlet oxygen luminescence measurements as a dose metric in photodynamic therapy Cancer Res. 63 22 7986 7994 2003 CNREA8 0008-5472 14633731 29. Niedre M. J. et al. Imaging of photodynamically generated singlet oxygen luminescence in vivo Photochem. Photobiol. 81 4 941 943 2005 PHCBAP 0031-8655 10.1111/j.1751-1097.2005.tb01466.x 15865471 30. Niedre M. J. et al. Singlet oxygen luminescence as an in vivo photodynamic therapy dose metric: validation in normal mouse skin with topical amino-levulinic acid Br. J. Cancer 92 2 298 304 2005 BJCAAI 0007-0920 10.1038/sj.bjc.6602331 15655542 PMC2361839 31. Jarvi M. T. et al. Singlet oxygen luminescence dosimetry (SOLD) for photodynamic therapy: current status, challenges and future prospects Photochem. Photobiol. 82 5 1198 1210 2006 PHCBAP 0031-8655 10.1562/2006-05-03-IR-891 16808593 32. Chen J. et al. Using the singlet oxygen scavenging property of carotenoid in photodynamic molecular beacons to minimize photodamage to non-targeted cells Photochem. Photobiol. Sci. 6 12 1311 1317 2007 PPSHCB 1474-905X 10.1039/b706820d 18046487 33. Zheng G. et al. Photodynamic molecular beacon as an activatable photosensitizer based on protease-controlled singlet oxygen quenching and activation Proc. Natl. Acad. Sci. U. S. A. 104 21 8989 8994 2007 10.1073/pnas.0611142104 17502620 PMC1868591 34. Lovell J. F. et al. FRET quenching of photosensitizer singlet oxygen generation J. Phys. Chem. B 113 10 3203 3211 2009 JPCBFK 1520-6106 10.1021/jp810324v 19708269 35. Jarvi M. T. et al. The influence of oxygen depletion and photosensitizer triplet-state dynamics during photodynamic therapy on accurate singlet oxygen luminescence monitoring and analysis of treatment dose response Photochem. Photobiol. 87 1 223 234 2011 PHCBAP 0031-8655 10.1111/j.1751-1097.2010.00851.x 21143603 36. Jarvi M. T. Patterson M. S. Wilson B. C. Insights into photodynamic therapy dosimetry: simultaneous singlet oxygen luminescence and photosensitizer photobleaching measurements Biophys. J. 102 3 661 671 2012 BIOJAU 0006-3495 10.1016/j.bpj.2011.12.043 22325290 PMC3274798 37. Li B. et al. Correlation of in vitro cell viability and cumulative singlet oxygen luminescence from protoporphyrin IX in mitochondria and plasma membrane Photodiagn. Photodyn. Ther. 46 104080 2024 10.1016/j.pdpdt.2024.104080 38583747 38. Yang W. et al. Correction of multispectral singlet oxygen luminescent dosimetry (MSOLD) for tissue optical properties in photofrin-mediated photodynamic therapy Antioxidants 13 12 1458 2024 10.3390/antiox13121458 39765787 PMC11672821 39. Vikas V. et al. Analysis of singlet oxygen luminescence generated by protoporphyrin IX Antioxidants 14 2 176 2025 10.3390/antiox14020176 40002363 PMC11851838 40. Mariampillai A. et al. Speckle variance detection of microvasculature using swept-source optical coherence tomography Opt. Lett. 33 13 1530 1532 2008 OPLEDP 0146-9592 10.1364/OL.33.001530 18594688 41. Yang V. X. et al. Interstitial Doppler optical coherence tomography Opt. Lett. 30 14 1791 1793 2005 OPLEDP 0146-9592 10.1364/OL.30.001791 16092347 42. Yang V. X. et al. Endoscopic Doppler optical coherence tomography in the human GI tract: initial experience Gastrointest. Endosc. 61 7 879 890 2005 10.1016/S0016-5107(05)00323-8 15933695 43. Li H. et al. Feasibility of interstitial Doppler optical coherence tomography for in vivo detection of microvascular changes during photodynamic therapy Lasers Surg. Med. 38 8 754 761 2006 LSMEDI 0196-8092 10.1002/lsm.20387 16927368 44. Standish B. A. et al. Interstitial Doppler optical coherence tomography monitors microvascular changes during photodynamic therapy in a Dunning prostate model under varying treatment conditions J. Biomed. Opt. 12 3 034022 2007 JBOPFO 1083-3668 10.1117/1.2744068 17614730 45. Standish B. A. et al. Doppler optical coherence tomography monitoring of microvascular tissue response during photodynamic therapy in an animal model of Barrett’s esophagus Gastrointest. Endosc. 66 2 326 333 2007 10.1016/j.gie.2007.02.040 17643708 46. Standish B. A. et al. Interstitial Doppler optical coherence tomography as a local tumor necrosis predictor in photodynamic therapy of prostatic carcinoma: an in vivo study Cancer Res. 68 23 9987 9995 2008 CNREA8 0008-5472 10.1158/0008-5472.CAN-08-1128 19047181 47. Farrell T. J. et al. Modeling of photosensitizer fluorescence emission and photobleaching for photodynamic therapy dosimetry Appl. Opt. 37 31 7168 7183 1998 APOPAI 0003-6935 10.1364/AO.37.007168 18301543 48. Douplik A. et al. Assessment of photobleaching during endoscopic autofluorescence imaging of the lower GI tract Lasers Surg. Med. 42 3 224 231 2010 LSMEDI 0196-8092 10.1002/lsm.20892 20333739 49. Karotki A. et al. Simultaneous two-photon excitation of photofrin in relation to photodynamic therapy Photochem. Photobiol. 82 2 443 452 2006 PHCBAP 0031-8655 10.1562/2005-08-24-RA-657 16613497 50. Khurana M. et al. Quantitative in vitro demonstration of two-photon photodynamic therapy using photofrin and visudyne Photochem. Photobiol. 83 6 1441 1448 2007 PHCBAP 0031-8655 10.1111/j.1751-1097.2007.00185.x 18028219 51. Samkoe K. S. et al. Complete blood vessel occlusion in the chick chorioallantoic membrane using two-photon excitation photodynamic therapy: implications for treatment of wet age-related macular degeneration J. Biomed. Opt. 12 3 034025 2007 JBOPFO 1083-3668 10.1117/1.2750663 17614733 52. Dahlstedt E. et al. One- and two-photon activated phototoxicity of conjugated porphyrin dimers with high two-photon absorption cross sections Org. Biomol. Chem. 7 5 897 904 2009 OBCRAK 1477-0520 10.1039/b814792b 19225672 53. Luo T. Wilson B. C. Lu Q. B. Evaluation of one- and two-photon activated photodynamic therapy with pyropheophorbide-a methyl ester in human cervical, lung and ovarian cancer cells J. Photochem. Photobiol. B 132 102 110 2014 JPPBEG 1011-1344 10.1016/j.jphotobiol.2014.02.002 24607610 54. Pires L. et al. Femtosecond pulsed laser photodynamic therapy activates melanin and eradicates malignant melanoma Proc. Natl. Acad. Sci. U. S. A. 121 14 e2316303121 2024 10.1073/pnas.2316303121 38551838 PMC10998568 55. Wilson B. C. Patterson M. S. Lilge L. Implicit and explicit dosimetry in photodynamic therapy: a New paradigm Lasers Med. Sci. 12 3 182 199 1997 10.1007/BF02765099 20803326 56. Overchuk M. et al. Photodynamic and photothermal therapies: synergy opportunities for nanomedicine ACS Nano 17 9 7979 8003 2023 ANCAC3 1936-0851 10.1021/acsnano.3c00891 37129253 PMC10173698 57. Wilson B. C. Weersink R. A. The Yin and Yang of PDT and PTT Photochem. Photobiol. 96 2 219 231 2020 PHCBAP 0031-8655 10.1111/php.13184 31769516 58. Wong Kee Song L. M. Wilson B. C. Endoscopic detection of early upper GI cancers Best Pract. Res. Clin. Gastroenterol. 19 6 833 856 2005 10.1016/j.bpg.2005.04.006 16338645 59. Dacosta R. S. Wilson B. C. Marcon N. E. Spectroscopy and fluorescence in esophageal diseases Best Pract. Res. Clin. Gastroenterol. 20 1 41 57 2006 10.1016/j.bpg.2005.08.003 16473800 60. Wilson B. C. Detection and treatment of dysplasia in Barrett’s esophagus: a pivotal challenge in translating biophotonics from bench to bedside J. Biomed. Opt. 12 5 051401 2007 JBOPFO 1083-3668 10.1117/1.2795688 17994862 61. Yang V. X. et al. A multispectral fluorescence imaging system: design and initial clinical tests in intra-operative Photofrin-photodynamic therapy of brain tumors Lasers Surg. Med. 32 3 224 232 2003 LSMEDI 0196-8092 10.1002/lsm.10131 12605430 62. Bogaards A. et al. Increased brain tumor resection using fluorescence image guidance in a preclinical model Lasers Surg. Med. 35 3 181 190 2004 LSMEDI 0196-8092 10.1002/lsm.20088 15389738 63. Lilge L. et al. The sensitivity of normal brain and intracranially implanted VX2 tumour to interstitial photodynamic therapy Br. J. Cancer 73 3 332 343 1996 BJCAAI 0007-0920 10.1038/bjc.1996.58 8562339 PMC2074425 64. Lilge L. O’Carroll C. Wilson B. C. A solubilization technique for photosensitizer quantification in ex vivo tissue samples J. Photochem. Photobiol. B 39 3 229 235 1997 JPPBEG 1011-1344 10.1016/S1011-1344(97)00010-9 9253199 65. Olivo M. Wilson B. C. Mapping ALA-induced PPIX fluorescence in normal brain and brain tumour using confocal fluorescence microscopy Int. J. Oncol. 25 1 37 45 2004 IJONES 1019-6439 15201987 66. Bekelis K. et al. Quantitative and qualitative 5-aminolevulinic acid-induced protoporphyrin IX fluorescence in skull base meningiomas Neurosurg. Focus 30 5 E8 2011 10.3171/2011.2.FOCUS1112 PMC3116440 21529179 67. Stepp H. et al. ALA and malignant glioma: fluorescence-guided resection and photodynamic treatment J. Environ. Pathol. Toxicol. Oncol. 26 2 157 164 2007 JEPOEC 0731-8898 10.1615/JEnvironPatholToxicolOncol.v26.i2.110 17725542 68. Hadjipanayis C. G. Widhalm G. Stummer W. What is the surgical benefit of utilizing 5-aminolevulinic acid for fluorescence-guided surgery of malignant gliomas? Neurosurgery 77 5 663 673 2015 NEQUEB 10.1227/NEU.0000000000000929 26308630 PMC4615466 69. Lakomkin N. Hadjipanayis C. G. Fluorescence-guided surgery for high-grade gliomas J. Surg. Oncol. 118 2 356 361 2018 JSONAU 0022-4790 10.1002/jso.25154 30125355 70. Roberts D. W. et al. Coregistered fluorescence-enhanced tumor resection of malignant glioma: relationships between delta-aminolevulinic acid-induced protoporphyrin IX fluorescence, magnetic resonance imaging enhancement, and neuropathological parameters. Clinical article J. Neurosurg. 114 3 595 603 2011 JONSAC 0022-3085 10.3171/2010.2.JNS091322 20380535 PMC2921008 71. Valdes P. A. et al. Delta-aminolevulinic acid-induced protoporphyrin IX concentration correlates with histopathologic markers of malignancy in human gliomas: the need for quantitative fluorescence-guided resection to identify regions of increasing malignancy Neuro Oncol. 13 8 846 856 2011 10.1093/neuonc/nor086 21798847 PMC3145475 72. Valdes P. A. et al. Combined fluorescence and reflectance spectroscopy for in vivo quantification of cancer biomarkers in low- and high-grade glioma surgery J. Biomed. Opt. 16 11 116007 2011 JBOPFO 1083-3668 10.1117/1.3646916 22112112 PMC3221714 73. Valdes P. A. et al. Quantitative fluorescence in intracranial tumor: implications for ALA-induced PpIX as an intraoperative biomarker J. Neurosurg. 115 1 11 17 2011 JONSAC 0022-3085 10.3171/2011.2.JNS101451 21438658 PMC3129387 74. Konecky S. D. et al. Spatial frequency domain tomography of protoporphyrin IX fluorescence in preclinical glioma models J. Biomed. Opt. 17 5 056008 2012 JBOPFO 1083-3668 10.1117/1.JBO.17.5.056008 22612131 PMC3381025 75. Valdes P. A. et al. 5-Aminolevulinic acid-induced protoporphyrin IX fluorescence in meningioma: qualitative and quantitative measurements in vivo Neurosurgery 10 Suppl 1 74 83 2014 NEQUEB 10.1227/NEU.0000000000000117 23887194 PMC4237006 76. Jermyn M. et al. Improved sensitivity to fluorescence for cancer detection in wide-field image-guided neurosurgery Biomed. Opt. Express 6 12 5063 5074 2015 BOEICL 2156-7085 10.1364/BOE.6.005063 26713218 PMC4679278 77. Valdes P. A. et al. Quantitative fluorescence using 5-aminolevulinic acid-induced protoporphyrin IX biomarker as a surgical adjunct in low-grade glioma surgery J. Neurosurg. 123 3 771 780 2015 JONSAC 0022-3085 10.3171/2014.12.JNS14391 26140489 PMC4646619 78. Roberts D. W. et al. Red-light excitation of protoporphyrin IX fluorescence for subsurface tumor detection J. Neurosurg. 128 6 1690 1697 2017 JONSAC 0022-3085 10.3171/2017.1.JNS162061 28777025 PMC5797501 79. Khurana M. et al. Drug and light dose responses to focal photodynamic therapy of single blood vessels in vivo J. Biomed. Opt. 14 6 064006 2009 JBOPFO 1083-3668 10.1117/1.3262521 20059244 80. Shim M. G. et al. In vivo near-infrared Raman spectroscopy: demonstration of feasibility during clinical gastrointestinal endoscopy Photochem. Photobiol. 72 1 146 150 2000 PHCBAP 0031-8655 10.1562/0031-8655(2000)072&#x0003c;0146:IVNIRS&#x0003e;2.0.CO;2 10911740 81. Dacosta R. S. Wilson B. C. Marcon N. E. New optical technologies for earlier endoscopic diagnosis of premalignant gastrointestinal lesions J. Gastroenterol. Hepatol. 17 Suppl S85 S104 2002 JGHEEO 1440-1746 10.1046/j.1440-1746.17.s1.8.x 12000596 82. DaCosta R. S. Wilson B. C. Marcon N. E. Optical techniques for the endoscopic detection of dysplastic colonic lesions Curr. Opin. Gastroenterol. 21 1 70 79 2005 COGAEK 15687888 83. Jermyn M. et al. A review of Raman spectroscopy advances with an emphasis on clinical translation challenges in oncology Phys. Med. Biol. 61 23 R370 R400 2016 PHMBA7 0031-9155 10.1088/0031-9155/61/23/R370 27804917 84. Desroches J. et al. A new method using Raman spectroscopy for in vivo targeted brain cancer tissue biopsy Sci. Rep. 8 1 1792 2018 SRCEC3 2045-2322 10.1038/s41598-018-20233-3 29379121 PMC5788981 85. Tam N. C. et al. Facile synthesis of Raman active phospholipid gold nanoparticles Bioconjug. Chem. 21 12 2178 2182 2010 BCCHES 1043-1802 10.1021/bc100386a 21090645 86. Diaz R. J. et al. Focused ultrasound delivery of Raman nanoparticles across the blood-brain barrier: potential for targeting experimental brain tumors Nanomedicine 10 5 e1075 e1087 2014 1743-5889 10.1016/j.nano.2013.12.006 PMC4074278 24374363 87. Clement S. et al. X-ray induced singlet oxygen generation by nanoparticle-photosensitizer conjugates for photodynamic therapy: determination of singlet oxygen quantum yield Sci. Rep. 6 19954 2016 SRCEC3 2045-2322 10.1038/srep19954 26818819 PMC4730142 88. MacLaughlin C. M. et al. Porphysome nanoparticles for enhanced photothermal therapy in a patient-derived orthotopic pancreas xenograft cancer model: a pilot study J. Biomed. Opt. 21 8 084002 2016 JBOPFO 1083-3668 10.1117/1.JBO.21.8.084002 27552306 89. Kato T. et al. Preclinical investigation of folate receptor-targeted nanoparticles for photodynamic therapy of malignant pleural mesothelioma Int. J. Oncol. 53 5 2034 2046 2018 IJONES 1019-6439 10.3892/ijo.2018.4555 30226590 PMC6192720 90. Kinoshita T. et al. A novel laser fiberscope for simultaneous imaging and phototherapy of peripheral lung cancer Chest 156 3 571 578 2019 CHETBF 0012-3692 10.1016/j.chest.2019.04.010 31034817 91. Ujiie H. et al. Porphyrin-high-density lipoprotein: a novel photosensitizing nanoparticle for lung cancer therapy Ann. Thorac. Surg. 107 2 369 377 2019 10.1016/j.athoracsur.2018.08.053 30316853 92. Guidolin K. et al. Porphyrin-lipid nanovesicles (Porphysomes) are effective photosensitizers for photodynamic therapy Nanophotonics 10 12 3161 3168 2021 10.1515/nanoph-2021-0220 36405498 PMC9646248 93. Valic M. S. et al. Cutaneous photosensitivity of phototheranostic porphyrin-lipid nanoparticles Photochem. Photobiol. 1 18 2025 PHCBAP 0031-8655 10.1111/php.14088 40191965 94. Pires L. et al. Dual-agent photodynamic therapy with optical clearing eradicates pigmented melanoma in preclinical tumor models Cancers 12 7 1956 2020 10.3390/cancers12071956 32708501 PMC7409296 95. Pires L. et al. Optical clearing of melanoma in vivo: characterization by diffuse reflectance spectroscopy and optical coherence tomography J. Biomed. Opt. 21 8 081210 2016 JBOPFO 1083-3668 10.1117/1.JBO.21.8.081210 27300502 96. Parrish J. A. Wilson B. C. Current and future trends in laser medicine Photochem. Photobiol. 53 6 731 738 1991 PHCBAP 0031-8655 10.1111/j.1751-1097.1991.tb09885.x 1886931 ",
  "metadata": {
    "Title of this paper": "Current and future trends in laser medicine",
    "Journal it was published in:": "Journal of Biomedical Optics",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12493121/"
  }
}