{
  "title": "Paper_972",
  "abstract": "pmc Surg Neurol Int Surg Neurol Int 1278 sni Surgical Neurology International 2229-5097 2152-7806 Scientific Scholar PMC12482727 PMC12482727.1 12482727 12482727 41036053 10.25259/SNI_441_2025 10.25259/SNI_441_2025 1 Case Report Early recurrence of olfactory neuroblastoma: A case report and literature review Roman Alex 1 2 https://orcid.org/0000-0001-7118-6840 alexroman__@hotmail.com de Araújo Moisés Augusto 2 moises_augustus@hotmail.com Batista Arend Rudolfh 3 https://orcid.org/0009-0006-1454-4270 rudolfharend77@gmail.com Peroni Bruno Zilli 4 https://orcid.org/0000-0001-7717-9481 bruno.peroni@hotmail.com Savaris Daniel Felipe 4 daniel.savaris@yahoo.com.br Rabello Renata dos Santos 4 renata.rabello@uffs.edu.br Kauer Victor Luiz Ferreira 3 https://orcid.org/0009-0007-0794-3334 mdvictorkauer@gmail.com Ribeiro Filipe Virgilio 5 filipevirgilioribeiro@gmail.com 1 2 3 4 5 * Corresponding author: alexroman__@hotmail.com 2025 22 8 2025 16 481491 358 02 5 2025 17 7 2025 22 08 2025 01 10 2025 02 10 2025 Copyright: © 2025 Surgical Neurology International 2025 https://creativecommons.org/licenses/by-nc-sa/4.0/ This is an open-access article distributed under the terms of the Creative Commons Attribution-Non Commercial-Share Alike 4.0 License, which allows others to remix, transform, and build upon the work non-commercially, as long as the author is credited and the new creations are licensed under the identical terms. Background: Olfactory neuroblastoma (ONB) is a rare malignant tumor of the sinonasal cavity, often presenting with nonspecific symptoms and requiring complex multidisciplinary management. Case Description: A 55-year-old male developed progressive anosmia and recurrent epistaxis. Imaging revealed an invasive lesion involving the nasal cavity, paranasal sinuses, and intracranial space, along with cervical lymph node metastases. Diagnosis was confirmed histologically. Patient underwent craniofacial approach, cervical lymphadenectomy, and adjuvant radiotherapy. Despite aggressive treatment, early recurrence occurred in both nasal and intracranial compartments. With curative options exhausted, the patient was transitioned to palliative care. Conclusion: ONB has a high risk of recurrence, typically occurring years after initial treatment. However, early recurrence, as seen in this case, is rare and associated with aggressive tumor features such as high-grade histology and incomplete resection. These cases present significant therapeutic challenges and underscore the importance of close surveillance and further research into optimal management strategies for early recurrent ONB. Micro neurosurgery Olfactory neuroblastoma Oncology Paranasal sinus tumor Radiotherapy pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement no pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes  INTRODUCTION Olfactory neuroblastoma (ONB) is a rare malignant tumor of the sinonasal cavity, originating from the neuroectoderm with neuroendocrine differentiation. It is believed that this tumor arises from the olfactory placodes, which are replaced by respiratory mucosa in adults, located in the upper portion of the nasal cavity.[ 1 14 CASE PRESENTATION A 55-year-old male farmer with no comorbidities, prior surgeries, or allergies, lifelong non-smoker and non-drinker, presented in 2020 with anosmia, progressing to intermittent epistaxis; one episode per month. In 2021, patient required multiple medical visits for non-self-limiting bleeding. In 2022, patient developed headaches, bilateral nasal obstruction, clear nasal discharge, and edema in the left retroauricular region, without signs of inflammation, otological complaints, snoring, or trauma history. Despite two cauterizations – April and July –, bleeding persisted, occurring 3 times weekly but now self-limiting. A sinus X-ray revealed right maxillary sinus opacification and left maxillary mucosal thickening, indicating sinusopathy. A cavum X-ray showed no alterations. Video nasopharyngoscopy identified a bilateral mass from the septum in the anterior ethmoidal region, raising suspicion of a nasal tumor. A computed tomography (CT) scan (November, 2022) showed an expansile, infiltrative lesion in the nasal cavity and paranasal sinuses, with bone erosion and remodeling, extending through the cribriform plate into the intracranial frontal region, suggesting neoplasm. Magnetic resonance imaging (MRI) on the same date confirmed a solid lesion with a cystic component, extending into the inferior frontal lobes. Positron emission tomography-CT (PET-CT) was not performed due to its limited availability in the resource-limited settings. During a follow-up consultation, the patient reported growth in the left cervical region for 8 months and right for 1 month. Physical examination revealed a multinodular, firm, painless lesion in the left cervical region level II, approximately 4 cm, near the inferior pole of the parotid gland, adhered to deep planes. The patient was referred for neurosurgery due to suspected metastatic ONB. On May, 2023, a core biopsy of the left parotid confirmed the diagnosis, with pathology showing round cell proliferation and immunohistochemistry findings consistent with ONB-positive for chromogranin A, synaptophysin, Ki-67, S100, and pancytokeratin. According to histopathological findings, Hyams grade included by the pathology study was compatible with a Grade IV lesion. Following a multidisciplinary discussion, surgery and adjuvant radiotherapy were chosen. Surgery Neurosurgery was performed on August 09, 2023, using a combined transcranial and transfacial approach – anterior craniofacial resection and lateral transfacial rhinotomy, considering the Kadish stage D tumor and its diffuse intracranial invasion [ Figure 1 Figure 1: Preoperative magnetic resonance imaging from June, 2023: (a) Sagittal view, (b) axial view, and (c) coronal view, evidencing local aggressive tumor with intracranial invasion. Arrows indicate tumor invasion. The patient required 38 days of intensive care in postoperative, during which he developed acute renal failure necessitating hemodialysis, sepsis of pulmonary origin due to Klebsiella pneumoniae Furthermore, postoperative CT dated August 10, 2023, showed evidence of postoperative changes from bifrontal craniotomy at the skull base, with no signs of ischemia or intracranial hemorrhage. Otherwise, MRI dated August 23, 2023 [ Figure 2 Figure 2: Postoperative magnetic resonance imaging from August 23, 2023: (a-c) axial view with contrast enhancement, and (d) sagittal view, indicating possible tumor recurrence. Arrows indicate tumor invasion. Follow-up A neck MRI – dated November, 2023 – showed bilateral cervical lymphadenopathy at level IIB, measuring 3.4 × 3.0 cm, and Level IIA: lymph nodes located anteromedial to the spinal accessory nerve, measuring 3.7 × 3.3 cm on the left, and level IIA on the right, measuring 2.5 × 2.0 cm. In addition, a nodular lesion in the right parapharyngeal space measuring 2.1 × 1.3 cm was observed. On April, 2024, a selective left cervical lymphadenectomy was performed. Pathology confirmed ONB metastasis in 1/1 cervical lymph node at level II, 4/6 at level III, and no metastasis in seven nodes at level IV. Due to the inability to perform right-sided lymphadenectomy in the same surgical time, another procedure was scheduled for August, 2024. In the interim, a CT scan dated June, 2024, showed left-sided cervical tumor recurrence, with lesions measuring 1.6 × 1.4 cm and 1.8 × 1.8 cm at level IB, as well as enlarged lymph nodes on the right at level IB – 1.2 cm – and level IIA – 2.5 × 2.0 cm. In addition, a lesion with soft-tissue density extending into the ethmoid cells, sphenoid sinus, frontal sinus, and intraparenchymal olfactory fossa was identified. A new selective cervical resection was performed on August, 2024, removing three right cervical lymph nodes, one left cervical lymph node, and tracheostomy. Following this, the patient reported discomfort in the nasal cavity and frontal regions. MRI – dated September, 2024 – showed tumor recurrence in the nasal cavity and anterior cranial fossa. A new neurosurgical approach was contraindicated due to high surgical risk. Chemotherapy was contraindicated due to a lack of documented benefits in the literature. In addition, cervical tumor growth on the left side, measuring approximately 4 cm, was observed. Thus, radiotherapy was chosen, consisting of 25 sessions with a daily dose of 200 cGy using 6 megavolts (MV) energy, completed between September 25, 2024, and October 30, 2024. Post-radiotherapy control MRI dated November, 2024, showed an increase in the nodular area with extra-axial enhancement at the base of the right frontal lobe – 3.1 × 2.4 cm, previously 2.4 × 2.2 cm. A soft-tissue component medial to the left medial rectus muscle was noted, measuring 2.4 × 1.0 × 1.0 cm, with invasion of the olfactory fossa. In addition, a nodular formation near the right medial pterygoid muscle measured approximately 2.2 × 1.7 cm – previously 1.8 × 1.5 cm –, showing diffusion restriction [ Figure 3 Given the patient’s active disease and contraindications for further surgical intervention, palliative care was opted. At present, the patient is minimally symptomatic, presenting with subclinical secondary hypothyroidism – thyroid-stimulating hormone 0.3 mUI/L and T4L 0.9 mUI/L – and reporting occasional pain in the paranasal sinuses, relieved by dipyrone, and is under follow-up with oncology, otorhinolaryngology, nutrition, speech therapy, and dentistry. Figure 4 Figure 3: Post-radiotherapy control magnetic resonance imaging dated November 29, 2024: (a-c) axial view, and (d) sagittal view, indicating tumor intracranial, orbitary and olfactory fossa invasion, besides a nodular formation near the right medial pterygoid muscle. Arrows indicate tumor invasion. Figure 4: Overview of the chronological progression of the reported case. DISCUSSION The latency from symptom onset to ONB diagnosis averages 6–12 months, with approximately 70% of cases identified at advanced stages.[ 8 6 Symptoms vary according to tumor location: invasion of the cribriform plate may cause anosmia; ocular involvement may lead to diplopia, proptosis, or epiphora; and extension to the auditory tube may result in otalgia or otitis media. Finally, invasion of the anterior cranial fossa may cause cognitive changes and headaches.[ 10 In 1992, Dulguerov and Calcaterra proposed a tumor, node and metastasis (TNM)-based staging system for ONB, utilizing CT and MRI for detailed assessment.[ 6 1 1 PET-CT is valuable in the initial evaluation and in the detection of distant metastases and lymph node involvement, particularly in high-grade tumors. It also plays an important role in follow-up due to its ability to detect early recurrence. [ 1 3 9 Staging is essential in ONB management. The Kadish system classifies tumors into four stages: A (limited to the nasal cavity), B (involving the nasal cavity and paranasal sinuses), C (extending beyond these areas), and D (with cervical lymph node involvement or distant metastases, per 1 3 3 6 Diagnosis is confirmed by biopsy. In this scenario, the histological classification of the tumor is based on the Hyams grading system, in which grade I represents a well-differentiated tumor and grade IV corresponds to a poorly differentiated or undifferentiated tumor. The classification takes into account mitotic activity, nuclear pleomorphism, rosette formation, necrosis, architectural disruption, and fibrillary matrix dispersion.[ 1 8 11 Multimodal therapy – particularly surgery combined with radiotherapy – remains the most effective treatment approach for high-grade or invasive ONB, despite the absence of standardized guidelines.[ 1 3 5 6 8 10 8 Conventionally, en bloc 3 5 6 11 en bloc 3 6 10 12 Contraindications to endoscopic resection include extensive involvement of the lacrimal sac, supraorbital region, carotid artery, or brain, in which cases craniofacial or combined surgical approaches may be necessary.[ 1 4 5 10 Surgery combined with adjuvant radiotherapy has historically reduced recurrence and mortality in ONB.[ 8 12 13 11 15 8 Cervical metastases occur in 5–33% of ONB cases, emphasizing the importance of neck imaging during staging.[ 1 12 1 8 10 Chemotherapy may be used as adjuvant, neoadjuvant, concurrent with radiotherapy, or palliative treatment.[ 8 7 1 8 9 In terms of prognosis, ONB demonstrates variable clinical behavior, with recurrences reported as late as 19.7 years post-treatment, necessitating lifelong surveillance. Semiannual follow-up is recommended during the first 5 years, followed by annual monitoring up to 10 years. Continued surveillance is essential due to the risk of late recurrence.[ 3 8 12 5 8 3 6 8 Poor prognostic factors include female sex, age <20 or >50 years, advanced stage, high-grade tumor, cervical lymph node involvement, distant metastases, positive margins, high mitotic index, and dural, orbital, or intracranial invasion.[ 2 3 6 7 12 1 2 9 12 A retrospective study of 143 ONB patients found that 64 experienced recurrences at a median of 4.74 years post-treatment. It showed that early recurrence is uncommon, but when present, it correlates with high tumor grade and positive surgical margins, requiring more aggressive treatment and associated with poorer outcomes.[ 12 This study has limitations, mainly due to the short follow-up period and intrinsic limitations of the report of a single case. Furthermore, the lack of pre- and postoperative PETCT may hinder important imaging findings that ultimately guide medical-decision. On the other hand, this case adds to the current literature by documenting a rare and aggressive presentation of ONB, marked by early postoperative recurrence and extensive cervical lymph node metastases, despite near-total resection and adjuvant radiotherapy. It notably underscores the challenges of managing advanced-stage central nervous system neoplasms in resource-limited settings, reinforcing the importance of individualized, multidisciplinary care. The exceptionally rapid recurrence and progression highlight the critical need for early detection, close surveillance, and the current lack of effective systemic therapies in palliative contexts. CONCLUSION ONB remains a rare and challenging malignancy, especially in advanced stages with intracranial invasion and cervical lymph node metastases. This case illustrates the aggressive clinical behavior that ONB can present, even following extensive surgical resection and adjuvant therapy. The early recurrence and progressive regional dissemination observed emphasize the limitations of current treatment strategies and the urgent need for more effective systemic options, particularly in palliative care settings. Furthermore, this case reinforces the importance of comprehensive, multidisciplinary management and long-term follow-up. As ONB continues to lack standardized treatment protocols due to its low prevalence overall, individual case reports such as the present contribute valuable insight into clinical decision-making, highlight prognostic uncertainties, and underline the necessity of collaborative research to improve outcomes in this complex disease. How to cite this article: et al Authors’ contributions: Both Rudolfh Batista Arend, Bruno Zilli Peroni, and Daniel Felipe Savaris gathered information, discussed, and wrote the case report. Alex Romam and Moisés Augusto de Araújo were involved in the patient treatment/examination and have provided input from their specific fields. Renata dos Santos Rabello was responsible for organizing the project, and handling the necessary documentation. Ethics approval: The project followed the research ethics guidelines of Brazil and is registered and approved by the Institution’s Ethics Committee (CEP 603/05) number 7.288.479. Declaration of patient consent: The authors certify that they have obtained all appropriate patient consent. Financial support and sponsorship: Publication of this article was made possible by the James I. and Carolyn R. Ausman Educational Foundation. Conflicts of interest: There are no conflicts of interest. Use of artificial intelligence (AI)-assisted technology for manuscript preparation: The authors confirm that there was no use of artificial intelligence (AI)-assisted technology for assisting in the writing or editing of the manuscript and no images were manipulated using AI. REFERENCES 1 Abdelmeguid AS Olfactory neuroblastoma Curr Oncol Rep 2018 20 1 7 29411144 10.1007/s11912-018-0661-6 2 Abdelmeguid AS Bell D Roberts D Ferrarotto R Phan J Su SY Long-term outcomes of olfactory neuroblastoma: MD anderson cancer center experience and review of the literature Laryngoscope 2021 132 290 7 34272876 10.1002/lary.29732 3 Arnold MA Farnoosh S Gore MR Comparing kadish and modified dulguerov staging systems for olfactory neuroblastoma: An individual participant data meta-analysis Otolaryngol Head Neck Surg 2020 163 18 27 10.1177/0194599820915487 32286935 4 Bartel R Gonzales-Compta X Cisa E Cruellas F Torres A Rovira A Importance of neoadjuvant chemotherapy in olfactory neuroblastoma treatment: Series report and literature review Acta Otorrinolaringol Esp (Engl Ed) 2018 69 208 13 29061289 10.1016/j.otorri.2017.07.001 5 Dulguerov P Allal AS Calcaterra TC Esthesioneuroblastoma: A meta-analysis and review Lancet Oncol 2001 2 683 90 11902539 10.1016/S1470-2045(01)00558-7 6 Dulguerov P Calcaterra T Esthesioneuroblastoma: The UCLA experience 1970-1990 Laryngoscope 1992 102 843 9 1495347 10.1288/00005537-199208000-00001 7 Goshtasbi K Abiri A Abouzari M Sahyouni R Wang BY Tajudeen BA Hyams grading as a predictor of metastasis and overall survival in esthesioneuroblastoma: A meta-analysis Int Forum Allergy Rhinol 2019 9 1054 62 31251848 10.1002/alr.22373 PMC7276257 8 Lopez F Agaimy A Franchi A Suárez C Poorten VV Mäkitie AA Update on olfactory neuroblastoma Virchows Arch 2024 484 567 85 38386106 10.1007/s00428-024-03758-z 9 Marinelli JP Janus JR Gompel JJ Link MJ Foote RL Lohse CM Esthesioneuroblastoma with distant metastases: Systematic review and meta-analysis Head Neck 2018 40 2295 303 29756250 10.1002/hed.25209 10 Mehta GU Raza SM Su SY Hanna EY DeMonte F Management of olfactory neuroblastoma, neuroendocrine carcinoma, and sinonasal undifferentiated carcinoma involving the skullbase J Neurooncol 2020 150 367 75 32424573 10.1007/s11060-020-03537-1 11 Meerwein CM Nikolaou G Binz GH Soyka MB Holzmann D Surgery as single-modality treatment for early-stage olfactory neuroblastoma: An institutional experience, systematic review and meta-analysis Am J Rhinol Allergy 2020 35 525 34 33174762 10.1177/1945892420973163 12 Ni G Pinheiro-Neto CD Iyoha E Gompel JJ Link MJ PerisCalda M Recurrent esthesioneuroblastoma: Long-term outcomes of salvage therapy Cancers (Basel) 2013 15 1506 10.3390/cancers15051506 PMC10000736 36900297 13 Papacharalampous GX Vlastarakos PV Chrysovergis A Saravakos PK Kotsis GP Davilis DI Olfactory neuroblastoma (esthesioneuroblastoma): Towards minimally invasive surgery and multi-modality treatment strategies-an updated critical review of the current literature J BUON 2013 18 557 63 24065464 14 Thompson LD Olfactory neuroblastoma Head Neck Pathol 2009 3 252 9 20596981 10.1007/s12105-009-0125-2 PMC2811627 15 Vuong HG Ngo TN Dunn IF Consolidating the hyams grading system in esthesioneuroblastoma-an individual participant data meta-analysis J Neurooncol 2021 153 15 22 33770323 10.1007/s11060-021-03746-2 Disclaimer The views and opinions expressed in this article are those of the authors and do not necessarily reflect the official policy or position of the Journal or its management. The information contained in this article should not be considered to be medical advice; patients should consult their own physicians for advice as to their specific medical needs. ",
  "metadata": {
    "Title of this paper": "Consolidating the hyams grading system in esthesioneuroblastoma-an individual participant data meta-analysis",
    "Journal it was published in:": "Surgical Neurology International",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12482727/"
  }
}