{
  "title": "Paper_910",
  "abstract": "pmc BMC Med Genomics BMC Med Genomics 573 bmcmedgeno BMC Medical Genomics 1755-8794 BMC PMC12487069 PMC12487069.1 12487069 12487069 41035082 10.1186/s12920-025-02213-5 2213 1 Research Mono-allelic MUTYH mutation as the likely inherited etiology of hereditary breast cancer in a patient from a multi-cancer family- report of a family and literature review Sarmadi Akram 1 2 Javanmard Shaghayegh Haghjooy 3 Zeinalian Mehrdad 1 2 Hosseinzadeh Majid 1 2 http://orcid.org/0000-0003-0730-750X Tabatabaiefar Mohammad Amin tabatabaiefar@med.mui.ac.ir 1 2 1 https://ror.org/04waqzz56 grid.411036.1 0000 0001 1498 685X Department of Genetics and Molecular Biology, School of Medicine, Isfahan University of Medical Sciences, 2 https://ror.org/04waqzz56 grid.411036.1 0000 0001 1498 685X Pediatric Inherited Diseases Research Center, Research Institute for Primordial Prevention of Non-Communicable Disease, Isfahan University of Medical Sciences, 3 https://ror.org/01c4pz451 grid.411705.6 0000 0001 0166 0922 Metabolomics and Genomics Research Center, Cellular and Molecular Institute, Endocrinology and Metabolism Research Institute, Tehran University of Medical Sciences, 1 10 2025 2025 18 478351 146 6 6 2025 14 8 2025 01 10 2025 02 10 2025 03 10 2025 © The Author(s) 2025 2025 https://creativecommons.org/licenses/by-nc-nd/4.0/ Open Access http://creativecommons.org/licenses/by-nc-nd/4.0/ Background Breast cancer (BC) is the most prevalent cancer globally. Carriers of pathogenic variants in high- or moderate-penetrance genes, have an increased risk of developing hereditary BC (HBC). While, MUTYH is known to be associated with hereditary colonic polyposis and colorectal carcinoma, its role in BC is controversial. This study investigated the genetic cause of HBC in an Iranian family with a history of multiple cancer cases. Methods Clinical examination and exome sequencing (ES) was performed in a patient suffering from invasive ductal carcinoma from a family with several cases of different types of cancer. The pathogenicity of detected variants was done based on American Collage of Medical Genetics (ACMG) and Sanger sequencing was carried out for its validation. Furthermore, we performed a comprehensive review of the literature. Results Here, a pathogenic variant (p. A287Pfs*32) was identified in the MUTYH Conclusion In this study, a heterozygous pathogenic variant in the MUTYH Keywords Hereditary breast cancer (HBC) MUTYH Exome sequencing (ES) Mono-allelic mutation pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement no pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes issue-copyright-statement © BioMed Central Ltd., part of Springer Nature 2025 Introduction Cancer is the manifestation of uncontrolled cell proliferation in the body with hundreds of cancer types identified. Breast cancer (BC) is the most common malignancy among women, accounting for about 25% of all new cancer cases [ 1 2 BRCA1 BRCA2 3 4 5 BRCA1/2 CDH1 PALB2 PTEN STK11 TP53 ATM BARD1 BRIP1 CHEK2 NF1 RAD51C/D 6 7 8 8 The mutY homolog ( MUTYH 9 10 11 MUTYH 9 12 14 15 18 The National Cancer Care Network (NCCN) provides guidelines for genetic testing and clinical management of HBC in patients with early-onset BC (under age 40) and with a strong family history of breast, ovarian and other related cancers. Testing for BRCA1/2 19 20 BRCA1/2 Materials and methods Subject and clinical data A 43-year-old Iranian woman, (proband (III-4) in Fig. 1 BRCA1/2  Fig. 1 A MUTYH B DNA extraction and molecular testing The peripheral blood lymphocytes (5 ml) were collected from the patient and genomic DNA was extracted using CTGA PersPure UltraRapid Genomic DNA Extraction kit from blood (Cinna Teb Gene Azma, Iran), according to the manufacturer’s instruction. The quality of DNA extraction was checked using 1% agarose gel electrophoresis and Nanodrop 2000 instrument (Thermo Fisher Scientific Inc, USA) was used for assessing the concentration of it. BRCA1/2 variant screening was performed using the Axen™ BRCA1/2 panel (The amplicon libraries were sequenced by MiSeqDx sequencer). Exome sequencing (ES) and bioinformatics analyses About 300 ng of extracted genomic DNA was subjected to exome sequencing (ES) using the NovaSeq 6000 platform (Illumina, US), with the mean coverage depth of 100X for greater than 92% of targeted regions. These clean reads were aligned to the human genome sequence (GRCh37/hg19) reference, using the Burrows-Wheeler Aligner (BWA) ( http://bio-bwa.sourceforge.net/ 21 22 For assessing the pathogenicity of the candidate variants, several bioinformatics tools were used: Genome Aggregation Database (gnomAD v4.0.0) was used for population allele frequency analysis. MutationTaster ( http://www.mutationtaster.org/ http://mutationassessor.org http://mutpred.mutdb.org/ http://sift.jcvi.org Sanger sequencing and segregation analysis To confirm the potential causative variants, direct Sanger sequencing was performed in the family members. Using exon-specific custom primers, we examined the co-segregation of the genotype with cancer phenotypes among cancer-affected family members. PCR amplification was conducted with designed primers (F: GGTGTCTGCAAAGGAGCTCT & R: TCCCTGAGGCTAAGAGCTGT), followed by fragment sequencing. Finally, electropherograms were compared with reference sequence ( NM_001128425.2 Results Clinical findings A 43-year-old Iranian woman was referred to our center with clinical manifestations of right breast malignancy. She was initially diagnosed with BC at age 39. Her family history revealed two sisters diagnosed with BC at ages 45 and 47, and a brother who developed pancreatic cancer in his 40 s and died several years later. Their mother was also deceased in her 50 s from BC. Additionally, two nieces were affected by BC at ages 38 and 29. Other reported malignancies in the family included liver, lung, and prostate cancers, as well as a brain tumor. Physical examination revealed a 3.6 cm discrete mass with inflammatory skin changes and no nipple discharge in the right breast. Imaging studies (mammography and ultrasound) confirmed a 3.2 cm mass and pathological examination of the mastectomy specimen showed a 22 × 18 × 6.5 cm breast tissue containing a 3 cm ill-circumscribed, creamy-brown, firm mass located 3 cm from the skin, 2.5 cm from the deep margin, and 4 cm from the medial margin. Twenty lymph nodes were identified in the axillary fatty tissue, with the largest measuring 4 cm. Neoplastic proliferation of epithelial cells in nests, sheets and rarely tubular patterns were the microscopic description of the specimen. The specimen showed lymphovascular invasion, severe pleomorphism and ductal carcinoma in Situ (DCIS), while the nipple was uninvolved. All 20 lymph nodes demonstrated tumoral involvement. Immunohistochemical (IHC) analysis showed that the tumor was estrogen receptor (ER) 0%, progesterone receptor (PR) 0%, and human epidermal growth factor receptor 2 (HER2) + 1 (negative), consistent with Triple Negative Breast Cancer (TNBC). Her cancer was classified as stage 2 and grade III. Molecular findings and bioinformatics analyses BRCA1/2 NGS-based screening on the extracted DNA of the patient showed no mutation. Thus, the DNA sample was subjected to for ES. Analyzing the data obtained from ES identified a heterozygous frameshift variant (c.859delG, p. A287Pfs*32) in exon 10 of MUTYH 23 24 PVS1 PS4 PM2 PP3 PVS1: It is a null variant, where loss of function is a known mechanism of disease. PS4: The prevalence of the variant in affected individuals is significantly increased compared to the prevalence in controls (or at extremely low frequency in Exome Sequencing Project, 1000 Genomes Project, ExAC). PM2: Extremely low frequency in gnomAD population databases. PP3: Multiple lines of computational evidence supported the deleterious effect of the variant on the gene or gene product (Table 1  Table 1 In silico analysis of identified variants in the MUTYH  Variant Location (hg19/ NM_001128425.2  Amio-acid alteration  1000 G  ExAC  Mutation Taster2.0  ACMG classification  Mutation Assessor Chr1: 45,332,240 A287P Not found 1 Disease-Causing Pathogenic (PVS1, PS4, PM2 and PP3) 0.998 High  DNA change  Zygosity  PolyPhen-2  CADD  SIFT  MetaLR  REVEL c.859delG Hetero 0.995 27 0.0 0.962 0.963 cDNA.1075delG g.8231delG Probably damaging Deleterious Damaging Likely Disease- Causing Sanger sequencing and segregation analysis The segregation of the detected variant with the phenotype (breast cancer in four patients and a healthy sister of proband) was confirmed using the Sanger sequencing method. DNA sequence electropherogram of the family members are shown in the (Fig. 1 Discussion Breast cancer (BC) remains the leading cause of cancer-related deaths among women worldwide, though incidence and mortality rates vary significantly across regions due to economic and lifestyle disparities [ 11 25 26 27 Nielsen MUTYH 28 2 Table 2 Classification of breast cancer genes, their locations and the related cancers Genes classification Gene name Location Related cancer High-penetrance genes BRCA1 17q21 Hereditary Breast cancer- Ovarian, Pancreatic and Fallopian tube cancer BRCA2 13q12.3 Hereditary breast cancer- Ovarian, Pancreatic, Prostate and Fallopian tube cancer CDH1 16q22.1 Ovarian and endometrial carcinoma- Gastric, colorectal and Prostate cancer PALB2 16P12.2 Pancreatic and Ovarian cancer PTEN 10q23 Endometrial, Prostate and Thyroid cancer STK11 19p13.3 Pancreatic, Pancreas, Colon and Testicular cancer- ovarian sex cord-stromal tumors TP53 17p13.1 Brain tumor- Adrenocortical carcinoma Moderate-penetrance genes ATM 11q23 Ovarian and Prostate cancer CHEK2 22q12.1 Prostate, Colon, Osteosarcoma, Lung and Kidney cancer BRIP1 17q23.2 Prostate, Cervix and vaginal, Ovary, Colon, Kidney, Brain, Pharynx and Skin cancer NF1 17q11.2 Pheochromocytoma and Paraganglioma- Melanoma, Skin and Adrenocortical cancer- Brain tumors BARD1 2q34 Hereditary Breast cancer, Triple-Negative Breast Cancer RAD51C 17q11 Breast, Ovarian, fallopian tube and primary peritoneal cancer RAD51D 17q12 Breast, fallopian tube and ovarian cancer Low-penetrance genes MSH6 2p16.3 Ovarian, Endometrial, Gastric and Lung cancer NBN 8q21.3 Breast, Ovarian, Prostate, Stomach and cervical cancer, Wilms tumor MUTYH 1p34.3 Hereditary Nonpolyposis Colorectal cancer-Adenomatous Polyposis Coli- Breast cancer RECQL 12p12.1 Ovarian cancer- Squamous cell carcinoma LSP1 11p15.5 Breast and Ovarian cancer FGFR2 10q26 Breast, Stomach, Lung, Bladder and Synovial cancer MAP3K1 5q11.2 Breast cancer TGF-β1 19q13.1 Breast, Lung, Liver, Prostate and Colorectal cancer TOX3 16q12.1 Breast and Lung cancer In our studied patient, we identified a heterozygous allele in the MUTYH 27 29 30 31 30 Chan. et al. MUTYH 32 MUTYH 33 34 MUTYH 35 To assess MUTYH’s role in BC pathogenesis, we reviewed literature, published between 2005 and 2024. Our analysis of 18 studies involving 21,860 BC, ovarian cancer (OC), and HBOC patients revealed MUTYH pathogenic variant frequencies ranging from 0.3 to 8.7% [ 18 35 51 2 MUTYH 13 43 10 12 14 16 33 47 52 54 Panigoro 55 MUTYH MUTYH 10  Fig. 2 The prevalence of MUTYH mutations in the literature (published between 2005 to 2024). Each column depicts a separate study whose sample size is shown in the horizontal axis and the percentage of MUTYH mutation is shown in the vertical axis Several studies reporting p.Y179C and p.G382D as the most common pathogenic variants in the MUTYH 35 56 57 58 MUTYH 59 3  Fig. 3 Schematic presentation of the structural domains of MUTYH. The disease-causing mutations reported to cause breast cancer are shown at the bottom. It is the first report of the variant (p. A287Pfs*32), causing breast cancer This study identified variant lies within Fe-S cluster domain of MUTYH, a highly conserved region essential for its repair function, present in nearly all MutY homologs, with the exception of certain bacterial lineages [ 60 61 61 62 59 There are reports of some other genes which are well-known for their causative role in a cancer in bi-allelic form, while mono-allelic variants may predispose carriers to other cancer types. For instance, bi-allelic variants in the PALB2 63 51 Our study suffers from a series of limitations including: the relatively small sample size of the patients in the co-segregation, the inherent technical limitation of ES, which lacks the capability to detect deep intronic variants. Furthermore, tumor profiling and functional analysis were not performed. Conclusion In this study, using exome sequencing, we identified the potential disease-causing variant in a large family with several cases of different types of cancer. While mutations in the MUTYH Publisher’s Note Springer Nature remains neutral with regard to jurisdictional claims in published maps and institutional affiliations. Acknowledgements We take this opportunity to express our thanks to all individuals who cooperated in this study, specially the staff at the Iranian Cancer Control Center (MACSA) and also to the patient and family. Authors’ contributions Study design: MAT; Data collection, analysis, and interpretation: MAT, AS, SHJ and MZ; Clinical evaluation: MT, SHJ, MH and MZ; manuscript preparation: AS; figures preparation: AS; critically reviewed by MAT. All authors have read and approved the manuscript. Funding This work was financially supported by Isfahan University of Medical Sciences grant NO. 3402373. MAT has received this research support. Data availability All the data used and analyzed in this study are available in the GSA for Human ([https://ngdc.cncb.ac.cn/](https:/ngdc.cncb.ac.cn)) with accession code: HRA011620. Please access it from the following link: ([https://bigd.big.ac.cn/gsa-human/browse/HRA011620](https:/bigd.big.ac.cn/gsa-human/browse/HRA011620)). The variant’s data is also available in the ClinVar repository with accession number: SCV006303273. Declarations Ethics approval and consent to participate The study was conducted according to the guidelines of the Declaration of Helsinki and approved by the Review Board of Isfahan University of Medical Sciences (ethics code: IR.MUI.MED.REC.1402.208). Written informed consent was obtained from all of the participants in the study and from the parents of the participant younger than the age of 16. Consent for publication Written informed consent for publication of clinical details and clinical images was obtained from the all of the participants and from the parents of the participant under the age of 18. Competing interests The authors declare no competing interests. References 1. Saini A Kumar M Bhatt S Saini V Malik A Cancer causes and treatments Int J Pharm Sci Res 2020 11 7 3121 34 Saini A, Kumar M, Bhatt S, Saini V, Malik A. Cancer causes and treatments. Int J Pharm Sci Res. 2020;11(7):3121–34. 2. Ehsan L Waheed MT Akbar F Siddiqui Z Sattar AK Kirmani S Challenges and opportunities in the establishment of a hereditary breast cancer clinic at an academic medical center in a low-middle income country J Genet Couns 2022 31 4 998 1002 10.1002/jgc4.1555 35099095 Ehsan L, Waheed MT, Akbar F, Siddiqui Z, Sattar AK, Kirmani S. Challenges and opportunities in the establishment of a hereditary breast cancer clinic at an academic medical center in a low-middle income country. J Genet Couns. 2022;31(4):998–1002. 35099095 10.1002/jgc4.1555 3. Pal M Das D Pandey M Understanding genetic variations associated with Familial breast cancer World J Surg Oncol 2024 22 1 271 10.1186/s12957-024-03553-9 39390525 PMC11465949 Pal M, Das D, Pandey M. Understanding genetic variations associated with Familial breast cancer. World J Surg Oncol. 2024;22(1):271. 39390525 10.1186/s12957-024-03553-9 PMC11465949 4. Mavaddat N Dorling L Carvalho S Allen J Gonzalez-Neira A Keeman R Pathology of tumors associated with pathogenic germline variants in 9 breast cancer susceptibility genes JAMA Oncol 2022 8 3 e216744 e 10.1001/jamaoncol.2021.6744 35084436 PMC8796069 Mavaddat N, Dorling L, Carvalho S, Allen J, Gonzalez-Neira A, Keeman R, et al. Pathology of tumors associated with pathogenic germline variants in 9 breast cancer susceptibility genes. JAMA Oncol. 2022;8(3):e216744–e. 35084436 10.1001/jamaoncol.2021.6744 PMC8796069 5. Hu C Hart SN Gnanaolivu R Huang H Lee KY Na J A population-based study of genes previously implicated in breast cancer N Engl J Med 2021 384 5 440 51 10.1056/NEJMoa2005936 33471974 PMC8127622 Hu C, Hart SN, Gnanaolivu R, Huang H, Lee KY, Na J, et al. A population-based study of genes previously implicated in breast cancer. N Engl J Med. 2021;384(5):440–51. 33471974 10.1056/NEJMoa2005936 PMC8127622 6. Tung N Lin NU Kidd J Allen BA Singh N Wenstrup RJ Frequency of germline mutations in 25 cancer susceptibility genes in a sequential series of patients with breast cancer J Clin Oncol 2016 34 13 1460 8 10.1200/JCO.2015.65.0747 26976419 PMC4872307 Tung N, Lin NU, Kidd J, Allen BA, Singh N, Wenstrup RJ, et al. Frequency of germline mutations in 25 cancer susceptibility genes in a sequential series of patients with breast cancer. J Clin Oncol. 2016;34(13):1460–8. 26976419 10.1200/JCO.2015.65.0747 PMC4872307 7. Nielsen SM Russell EM Ellsworth RE Hughes KS Heald B Beitsch PD Utilization of cancer screening, prevention, and treatment in women with variants of uncertain significance in breast cancer susceptibility genes J Natl Compr Canc Netw 2025 23 6 248 54 10.6004/jnccn.2025.7011 40306323 Nielsen SM, Russell EM, Ellsworth RE, Hughes KS, Heald B, Beitsch PD, et al. Utilization of cancer screening, prevention, and treatment in women with variants of uncertain significance in breast cancer susceptibility genes. J Natl Compr Canc Netw. 2025;23(6):248–54. 40306323 10.6004/jnccn.2025.7011 8. Girard E Eon-Marchais S Olaso R Renault Al, Damiola F Dondon M Familial breast cancer and DNA repair genes: insights into known and novel susceptibility genes from the GENESIS study, and implications for multigene panel testing Int J Cancer 2019 144 8 1962 74 10.1002/ijc.31921 30303537 PMC6587727 Girard E, Eon-Marchais S, Olaso R, Renault Al, Damiola F, Dondon M, et al. Familial breast cancer and DNA repair genes: insights into known and novel susceptibility genes from the GENESIS study, and implications for multigene panel testing. Int J Cancer. 2019;144(8):1962–74. 30303537 10.1002/ijc.31921 PMC6587727 9. van Loon B Hübscher U An 8-oxo-guanine repair pathway coordinated by MUTYH glycosylase and DNA polymerase λ Proc Natl Acad Sci 2009 106 43 18201 6 10.1073/pnas.0907280106 19820168 PMC2775316 van Loon B, Hübscher U. An 8-oxo-guanine repair pathway coordinated by MUTYH glycosylase and DNA polymerase λ. Proc Natl Acad Sci. 2009;106(43):18201–6. 19820168 10.1073/pnas.0907280106 PMC2775316 10. Out AA Wasielewski M Huijts PE Van Minderhout IJ Houwing-Duistermaat JJ Tops CM MUTYH gene variants and breast cancer in a Dutch case–control study Breast Cancer Res Treat 2012 134 219 27 10.1007/s10549-012-1965-0 22297469 PMC3397219 Out AA, Wasielewski M, Huijts PE, Van Minderhout IJ, Houwing-Duistermaat JJ, Tops CM, et al. MUTYH gene variants and breast cancer in a Dutch case–control study. Breast Cancer Res Treat. 2012;134:219–27. 22297469 10.1007/s10549-012-1965-0 PMC3397219 11. Bray F Ferlay J Soerjomataram I Siegel RL Torre LA Jemal A Global cancer statistics 2018: GLOBOCAN estimates of incidence and mortality worldwide for 36 cancers in 185 countries Cancer J Clin 2018 68 6 394 424 10.3322/caac.21492 30207593 Bray F, Ferlay J, Soerjomataram I, Siegel RL, Torre LA, Jemal A. Global cancer statistics 2018: GLOBOCAN estimates of incidence and mortality worldwide for 36 cancers in 185 countries. Cancer J Clin. 2018;68(6):394–424. 10.3322/caac.21492 30207593 12. Fulk K LaDuca H Black MH Qian D Tian Y Yussuf A Monoallelic MUTYH carrier status is not associated with increased breast cancer risk in a multigene panel cohort Fam Cancer 2019 18 197 201 10.1007/s10689-018-00114-4 30582135 Fulk K, LaDuca H, Black MH, Qian D, Tian Y, Yussuf A, et al. Monoallelic MUTYH carrier status is not associated with increased breast cancer risk in a multigene panel cohort. Fam Cancer. 2019;18:197–201. 30582135 10.1007/s10689-018-00114-4 13. Rennert G Lejbkowicz F Cohen I Pinchev M Rennert HS Barnett-Griness O MutYH mutation carriers have increased breast cancer risk Cancer 2012 118 8 1989 93 10.1002/cncr.26506 21952991 Rennert G, Lejbkowicz F, Cohen I, Pinchev M, Rennert HS, Barnett-Griness O. MutYH mutation carriers have increased breast cancer risk. Cancer. 2012;118(8):1989–93. 21952991 10.1002/cncr.26506 14. Thompson AB Sutcliffe EG Arvai K Roberts ME Susswein LR Marshall ML Monoallelic MUTYH pathogenic variants ascertained via multi-gene hereditary cancer panels are not associated with colorectal, endometrial, or breast cancer Fam Cancer 2022 21 4 415 22 10.1007/s10689-021-00285-7 34981295 Thompson AB, Sutcliffe EG, Arvai K, Roberts ME, Susswein LR, Marshall ML, et al. Monoallelic MUTYH pathogenic variants ascertained via multi-gene hereditary cancer panels are not associated with colorectal, endometrial, or breast cancer. Fam Cancer. 2022;21(4):415–22. 34981295 10.1007/s10689-021-00285-7 15. Sung P-L Wen K-C Chen Y-J Chao T-C Tsai Y-F Tseng L-M The frequency of cancer predisposition gene mutations in hereditary breast and ovarian cancer patients in taiwan: from BRCA1/2 to multi-gene panels PLoS ONE 2017 12 9 e0185615 10.1371/journal.pone.0185615 28961279 PMC5621677 Sung P-L, Wen K-C, Chen Y-J, Chao T-C, Tsai Y-F, Tseng L-M, et al. The frequency of cancer predisposition gene mutations in hereditary breast and ovarian cancer patients in taiwan: from BRCA1/2 to multi-gene panels. PLoS ONE. 2017;12(9):e0185615. 28961279 10.1371/journal.pone.0185615 PMC5621677 16. Jian W Shao K Qin Q Wang X Song S Wang X Clinical and genetic characterization of hereditary breast cancer in a Chinese population Hereditary Cancer Clin Pract 2017 15 1 9 10.1186/s13053-017-0079-4 PMC5663067 29093764 Jian W, Shao K, Qin Q, Wang X, Song S, Wang X. Clinical and genetic characterization of hereditary breast cancer in a Chinese population. Hereditary Cancer Clin Pract. 2017;15:1–9. 10.1186/s13053-017-0079-4 PMC5663067 29093764 17. Tung N Battelli C Allen B Kaldate R Bhatnagar S Bowles K Frequency of mutations in individuals with breast cancer referred for BRCA 1 and BRCA 2 testing using next-generation sequencing with a 25‐gene panel Cancer 2015 121 1 25 33 10.1002/cncr.29010 25186627 Tung N, Battelli C, Allen B, Kaldate R, Bhatnagar S, Bowles K, et al. Frequency of mutations in individuals with breast cancer referred for BRCA 1 and BRCA 2 testing using next-generation sequencing with a 25‐gene panel. Cancer. 2015;121(1):25–33. 25186627 10.1002/cncr.29010 18. Kurian AW Hare EE Mills MA Kingham KE McPherson L Whittemore AS Clinical evaluation of a multiple-gene sequencing panel for hereditary cancer risk assessment J Clin Oncol 2014 32 19 2001 9 10.1200/JCO.2013.53.6607 24733792 PMC4067941 Kurian AW, Hare EE, Mills MA, Kingham KE, McPherson L, Whittemore AS, et al. Clinical evaluation of a multiple-gene sequencing panel for hereditary cancer risk assessment. J Clin Oncol. 2014;32(19):2001–9. 24733792 10.1200/JCO.2013.53.6607 PMC4067941 19. Daly MB Pal T Berry MP Buys SS Dickson P Domchek SM Genetic/familial high-risk assessment: breast, ovarian, and pancreatic, version 2.2021, NCCN clinical practice guidelines in oncology J Natl Compr Canc Netw 2021 19 1 77 102 10.6004/jnccn.2021.0001 33406487 Daly MB, Pal T, Berry MP, Buys SS, Dickson P, Domchek SM, et al. Genetic/familial high-risk assessment: breast, ovarian, and pancreatic, version 2.2021, NCCN clinical practice guidelines in oncology. J Natl Compr Canc Netw. 2021;19(1):77–102. 33406487 10.6004/jnccn.2021.0001 20. Finch AP Lubinski J Møller P Singer CF Karlan B Senter L Impact of oophorectomy on cancer incidence and mortality in women with a BRCA1 or BRCA2 mutation J Clin Oncol 2014 32 15 1547 53 10.1200/JCO.2013.53.2820 24567435 PMC4026578 Finch AP, Lubinski J, Møller P, Singer CF, Karlan B, Senter L, et al. Impact of oophorectomy on cancer incidence and mortality in women with a BRCA1 or BRCA2 mutation. J Clin Oncol. 2014;32(15):1547–53. 24567435 10.1200/JCO.2013.53.2820 PMC4026578 21. Nouri Z Sarmadi A Narrei S Sehhati M Tabatabaiefar MA Whole exome sequencing identified a novel LAMA2 frameshift variant causing merosin-deficient congenital muscular dystrophy in a patient with cardiomyopathy, and autism-like behavior Neuromuscul Disord 2022 32 9 776 84 10.1016/j.nmd.2022.07.400 35989179 Nouri Z, Sarmadi A, Narrei S, Sehhati M, Tabatabaiefar MA. Whole exome sequencing identified a novel LAMA2 frameshift variant causing merosin-deficient congenital muscular dystrophy in a patient with cardiomyopathy, and autism-like behavior. Neuromuscul Disord. 2022;32(9):776–84. 35989179 10.1016/j.nmd.2022.07.400 22. Sarmadi A Adelian S Nouri Z Javanmard SH Omidzadeh R Tabatabaiefar MA A novel NBN germline mutation as the likely inherited etiology of various cancer types in an Iranian family Egypt J Med Hum Genet 2025 26 1 1 9 10.1186/s43042-025-00719-2 Sarmadi A, Adelian S, Nouri Z, Javanmard SH, Omidzadeh R, Tabatabaiefar MA. A novel NBN germline mutation as the likely inherited etiology of various cancer types in an Iranian family. Egypt J Med Hum Genet. 2025;26(1):1–9. 23. Olschwang S Blanché H De Moncuit C Thomas G Similar colorectal cancer risk in patients with monoallelic and biallelic mutations in the MYH gene identified in a population with adenomatous polyposis Genet Test 2007 11 3 315 20 10.1089/gte.2007.9995 17949294 Olschwang S, Blanché H, De Moncuit C, Thomas G. Similar colorectal cancer risk in patients with monoallelic and biallelic mutations in the MYH gene identified in a population with adenomatous polyposis. Genet Test. 2007;11(3):315–20. 17949294 10.1089/gte.2007.9995 24. Richards S Aziz N Bale S Bick D Das S Gastier-Foster J Standards and guidelines for the interpretation of sequence variants: a joint consensus recommendation of the American college of medical genetics and genomics and the association for molecular pathology Genet Sci 2015 17 5 405 23 10.1038/gim.2015.30 PMC4544753 25741868 Richards S, Aziz N, Bale S, Bick D, Das S, Gastier-Foster J, et al. Standards and guidelines for the interpretation of sequence variants: a joint consensus recommendation of the American college of medical genetics and genomics and the association for molecular pathology. Genet Sci. 2015;17(5):405–23. 10.1038/gim.2015.30 PMC4544753 25741868 25. Ukaegbu C Levi Z Fehlmann TD Uno H Chittenden A Inra JA Characterizing germline APC and MUTYH variants in Ashkenazi Jews compared to other individuals Fam Cancer 2021 20 111 6 10.1007/s10689-020-00198-x 32743790 PMC7854904 Ukaegbu C, Levi Z, Fehlmann TD, Uno H, Chittenden A, Inra JA, et al. Characterizing germline APC and MUTYH variants in Ashkenazi Jews compared to other individuals. Fam Cancer. 2021;20:111–6. 32743790 10.1007/s10689-020-00198-x PMC7854904 26. Win AK Jenkins MA Dowty JG Antoniou AC Lee A Giles GG Prevalence and penetrance of major genes and polygenes for colorectal cancer Cancer Epidemiol Biomarkers Prev 2017 26 3 404 12 10.1158/1055-9965.EPI-16-0693 27799157 PMC5336409 Win AK, Jenkins MA, Dowty JG, Antoniou AC, Lee A, Giles GG, et al. Prevalence and penetrance of major genes and polygenes for colorectal cancer. Cancer Epidemiol Biomarkers Prev. 2017;26(3):404–12. 27799157 10.1158/1055-9965.EPI-16-0693 PMC5336409 27. Barreiro RAS Sabbaga J Rossi BM Achatz MIW Bettoni F Camargo AA Monoallelic deleterious MUTYH germline variants as a driver for tumorigenesis J Pathol 2022 256 2 214 22 10.1002/path.5829 34816434 Barreiro RAS, Sabbaga J, Rossi BM, Achatz MIW, Bettoni F, Camargo AA, et al. Monoallelic deleterious MUTYH germline variants as a driver for tumorigenesis. J Pathol. 2022;256(2):214–22. 34816434 10.1002/path.5829 28. Nielsen M Franken P Reinards T Weiss M Wagner A Van der Klift H Multiplicity in polyp count and extracolonic manifestations in 40 Dutch patients with MYH associated polyposis coli (MAP) J Med Genet 2005 42 9 e54 e 10.1136/jmg.2005.033217 16140997 PMC1736132 Nielsen M, Franken P, Reinards T, Weiss M, Wagner A, Van der Klift H, et al. Multiplicity in polyp count and extracolonic manifestations in 40 Dutch patients with MYH associated polyposis coli (MAP). J Med Genet. 2005;42(9):e54–e. 16140997 10.1136/jmg.2005.033217 PMC1736132 29. Viel A Bruselles A Meccia E Fornasarig M Quaia M Canzonieri V A specific mutational signature associated with DNA 8-oxoguanine persistence in MUTYH-defective colorectal cancer EBioMedicine 2017 20 39 49 10.1016/j.ebiom.2017.04.022 28551381 PMC5478212 Viel A, Bruselles A, Meccia E, Fornasarig M, Quaia M, Canzonieri V, et al. A specific mutational signature associated with DNA 8-oxoguanine persistence in MUTYH-defective colorectal cancer. EBioMedicine. 2017;20:39–49. 28551381 10.1016/j.ebiom.2017.04.022 PMC5478212 30. Thibodeau ML Zhao EY Reisle C Ch’ng C Wong H-L Shen Y Base excision repair deficiency signatures implicate germline and somatic MUTYH aberrations in pancreatic ductal adenocarcinoma and breast cancer oncogenesis Mol Case Stud 2019 5 2 a003681 10.1101/mcs.a003681 PMC6549570 30833417 Thibodeau ML, Zhao EY, Reisle C, Ch’ng C, Wong H-L, Shen Y, et al. Base excision repair deficiency signatures implicate germline and somatic MUTYH aberrations in pancreatic ductal adenocarcinoma and breast cancer oncogenesis. Mol Case Stud. 2019;5(2):a003681. 10.1101/mcs.a003681 PMC6549570 30833417 31. Pilati C Shinde J Alexandrov LB Assié G André T Hélias-Rodzewicz Z Mutational signature analysis identifies MUTYH deficiency in colorectal cancers and adrenocortical carcinomas J Pathol 2017 242 1 10 5 10.1002/path.4880 28127763 Pilati C, Shinde J, Alexandrov LB, Assié G, André T, Hélias-Rodzewicz Z, et al. Mutational signature analysis identifies MUTYH deficiency in colorectal cancers and adrenocortical carcinomas. J Pathol. 2017;242(1):10–5. 28127763 10.1002/path.4880 32. Chan GH Ong PY Low JJ Kong HL Ow SG Tan DS Clinical genetic testing outcome with multi-gene panel in Asian patients with multiple primary cancers Oncotarget 2018 9 55 30649 10.18632/oncotarget.25769 30093976 PMC6078133 Chan GH, Ong PY, Low JJ, Kong HL, Ow SG, Tan DS, et al. Clinical genetic testing outcome with multi-gene panel in Asian patients with multiple primary cancers. Oncotarget. 2018;9(55):30649. 30093976 10.18632/oncotarget.25769 PMC6078133 33. Win AK Cleary SP Dowty JG Baron JA Young JP Buchanan DD Cancer risks for monoallelic MUTYH mutation carriers with a family history of colorectal cancer Int J Cancer 2011 129 9 2256 62 10.1002/ijc.25870 21171015 PMC3291738 Win AK, Cleary SP, Dowty JG, Baron JA, Young JP, Buchanan DD, et al. Cancer risks for monoallelic MUTYH mutation carriers with a family history of colorectal cancer. Int J Cancer. 2011;129(9):2256–62. 21171015 10.1002/ijc.25870 PMC3291738 34. Network N NCCN genetic/familial high-risk assessment: colorectal Version 2014 10.6004/jnccn.2019.0044 Network N. NCCN genetic/familial high-risk assessment: colorectal. Version. 2014. 10.6004/jnccn.2019.0044. 35. Peña-López J Jiménez-Bou D Ruíz-Gutiérrez I Martín-Montalvo G Alameda-Guijarro M Rueda-Lara A Prevalence and distribution of MUTYH pathogenic variants, is there a relation with an increased risk of breast cancer?? Cancers 2024 16 2 315 10.3390/cancers16020315 38254803 PMC10813893 Peña-López J, Jiménez-Bou D, Ruíz-Gutiérrez I, Martín-Montalvo G, Alameda-Guijarro M, Rueda-Lara A, et al. Prevalence and distribution of MUTYH pathogenic variants, is there a relation with an increased risk of breast cancer?? Cancers. 2024;16(2):315. 38254803 10.3390/cancers16020315 PMC10813893 36. Maxwell KN Wubbenhorst B D’Andrea K Garman B Long JM Powers J Prevalence of mutations in a panel of breast cancer susceptibility genes in BRCA1/2-negative patients with early-onset breast cancer Genet Sci 2015 17 8 630 8 10.1038/gim.2014.176 PMC4465412 25503501 Maxwell KN, Wubbenhorst B, D’Andrea K, Garman B, Long JM, Powers J, et al. Prevalence of mutations in a panel of breast cancer susceptibility genes in BRCA1/2-negative patients with early-onset breast cancer. Genet Sci. 2015;17(8):630–8. 10.1038/gim.2014.176 PMC4465412 25503501 37. Ellingson MS Hart SN Kalari KR Suman V Schahl KA Dockter TJ Exome sequencing reveals frequent deleterious germline variants in cancer susceptibility genes in women with invasive breast cancer undergoing neoadjuvant chemotherapy Breast Cancer Res Treat 2015 153 435 43 10.1007/s10549-015-3545-6 26296701 PMC4559569 Ellingson MS, Hart SN, Kalari KR, Suman V, Schahl KA, Dockter TJ, et al. Exome sequencing reveals frequent deleterious germline variants in cancer susceptibility genes in women with invasive breast cancer undergoing neoadjuvant chemotherapy. Breast Cancer Res Treat. 2015;153:435–43. 26296701 10.1007/s10549-015-3545-6 PMC4559569 38. Lin P-H Kuo W-H Huang A-C Lu Y-S Lin C-H Kuo S-H Multiple gene sequencing for risk assessment in patients with early-onset or Familial breast cancer Oncotarget 2016 7 7 8310 10.18632/oncotarget.7027 26824983 PMC4884994 Lin P-H, Kuo W-H, Huang A-C, Lu Y-S, Lin C-H, Kuo S-H, et al. Multiple gene sequencing for risk assessment in patients with early-onset or Familial breast cancer. Oncotarget. 2016;7(7):8310. 26824983 10.18632/oncotarget.7027 PMC4884994 39. Rummel SK Lovejoy L Shriver CD Ellsworth RE Contribution of germline mutations in cancer predisposition genes to tumor etiology in young women diagnosed with invasive breast cancer Breast Cancer Res Treat 2017 164 593 601 10.1007/s10549-017-4291-8 28503720 Rummel SK, Lovejoy L, Shriver CD, Ellsworth RE. Contribution of germline mutations in cancer predisposition genes to tumor etiology in young women diagnosed with invasive breast cancer. Breast Cancer Res Treat. 2017;164:593–601. 28503720 10.1007/s10549-017-4291-8 40. Kaur RP Shafi G Benipal RPS Munshi A Frequency of pathogenic germline mutations in cancer susceptibility genes in breast cancer patients Med Oncol 2018 35 6 81 10.1007/s12032-018-1143-2 29700634 Kaur RP, Shafi G, Benipal RPS, Munshi A. Frequency of pathogenic germline mutations in cancer susceptibility genes in breast cancer patients. Med Oncol. 2018;35(6):81. 29700634 10.1007/s12032-018-1143-2 41. Meiss AE Thomas M Modesitt SC Ring KL Atkins KA Mills AM Clinicopathologic characterization of breast carcinomas in patients with non-BRCA germline mutations: results from a single institution’s high-risk population Hum Pathol 2018 82 20 31 10.1016/j.humpath.2018.06.024 29958926 Meiss AE, Thomas M, Modesitt SC, Ring KL, Atkins KA, Mills AM. Clinicopathologic characterization of breast carcinomas in patients with non-BRCA germline mutations: results from a single institution’s high-risk population. Hum Pathol. 2018;82:20–31. 29958926 10.1016/j.humpath.2018.06.024 42. Oliver J Quezada Urban R Franco Cortés CA Díaz Velásquez CE Montealegre Paez AL Pacheco-Orozco RA Latin American study of hereditary breast and ovarian cancer LACAM: a genomic epidemiology approach Front Oncol 2019 9 1429 10.3389/fonc.2019.01429 31921681 PMC6933010 Oliver J, Quezada Urban R, Franco Cortés CA, Díaz Velásquez CE, Montealegre Paez AL, Pacheco-Orozco RA, et al. Latin American study of hereditary breast and ovarian cancer LACAM: a genomic epidemiology approach. Front Oncol. 2019;9:1429. 31921681 10.3389/fonc.2019.01429 PMC6933010 43. Rizzolo P Silvestri V Bucalo A Zelli V Valentini V Catucci I Contribution of MUTYH variants to male breast cancer risk: results from a multicenter study in Italy Front Oncol 2018 8 583 10.3389/fonc.2018.00583 30564557 PMC6288482 Rizzolo P, Silvestri V, Bucalo A, Zelli V, Valentini V, Catucci I, et al. Contribution of MUTYH variants to male breast cancer risk: results from a multicenter study in Italy. Front Oncol. 2018;8:583. 30564557 10.3389/fonc.2018.00583 PMC6288482 44. Schneider BP Stout LA Philips S Schroeder C Scott SF Hunter C Implications of incidental germline findings identified in the context of clinical whole exome sequencing for guiding cancer therapy JCO Precision Oncol 2020 4 1109 21 10.1200/PO.19.00354 35050776 Schneider BP, Stout LA, Philips S, Schroeder C, Scott SF, Hunter C, et al. Implications of incidental germline findings identified in the context of clinical whole exome sequencing for guiding cancer therapy. JCO Precision Oncol. 2020;4:1109–21. 10.1200/PO.19.00354 35050776 45. Ryu JS Lee HY Cho EH Yoon KA Kim MK Joo J Exon splicing analysis of intronic variants in multigene cancer panel testing for hereditary breast/ovarian cancer Cancer Sci 2020 111 10 3912 25 10.1111/cas.14600 32761968 PMC7540976 Ryu JS, Lee HY, Cho EH, Yoon KA, Kim MK, Joo J, et al. Exon splicing analysis of intronic variants in multigene cancer panel testing for hereditary breast/ovarian cancer. Cancer Sci. 2020;111(10):3912–25. 32761968 10.1111/cas.14600 PMC7540976 46. Chen B Zhang G Li X Ren C Wang Y Li K Comparison of BRCA versus non-BRCA germline mutations and associated somatic mutation profiles in patients with unselected breast cancer Aging 2020 12 4 3140 10.18632/aging.102783 32091409 PMC7066887 Chen B, Zhang G, Li X, Ren C, Wang Y, Li K, et al. Comparison of BRCA versus non-BRCA germline mutations and associated somatic mutation profiles in patients with unselected breast cancer. Aging. 2020;12(4):3140. 32091409 10.18632/aging.102783 PMC7066887 47. Kurian AW Hughes E Handorf EA Gutin A Allen B Hartman A-R Breast and ovarian cancer penetrance estimates derived from germline multiple-gene sequencing results in women JCO Precision Oncol 2017 1 1 12 10.1200/PO.16.00066 35172496 Kurian AW, Hughes E, Handorf EA, Gutin A, Allen B, Hartman A-R, et al. Breast and ovarian cancer penetrance estimates derived from germline multiple-gene sequencing results in women. JCO Precision Oncol. 2017;1:1–12. 10.1200/PO.16.00066 35172496 48. de Oliveira JM Zurro NB Coelho AVC Caraciolo MP de Alexandre RB Cervato MC The genetics of hereditary cancer risk syndromes in brazil: a comprehensive analysis of 1682 patients Eur J Hum Genet 2022 30 7 818 23 10.1038/s41431-022-01098-7 35534704 PMC9259741 de Oliveira JM, Zurro NB, Coelho AVC, Caraciolo MP, de Alexandre RB, Cervato MC, et al. The genetics of hereditary cancer risk syndromes in brazil: a comprehensive analysis of 1682 patients. Eur J Hum Genet. 2022;30(7):818–23. 35534704 10.1038/s41431-022-01098-7 PMC9259741 49. Tatineni S Tarockoff M Abdallah N Purrington KS Assad H Reagle R Racial and ethnic variation in multigene panel testing in a cohort of BRCA1/2-negative individuals who had genetic testing in a large urban comprehensive cancer center Cancer Med 2022 11 6 1465 73 10.1002/cam4.4541 35040284 PMC8921894 Tatineni S, Tarockoff M, Abdallah N, Purrington KS, Assad H, Reagle R, et al. Racial and ethnic variation in multigene panel testing in a cohort of BRCA1/2-negative individuals who had genetic testing in a large urban comprehensive cancer center. Cancer Med. 2022;11(6):1465–73. 35040284 10.1002/cam4.4541 PMC8921894 50. Di Rado S Giansante R Cicirelli M Pilenzi L Dell’Elice A Anaclerio F Detection of germline mutations in a cohort of 250 relatives of mutation carriers in multigene panel: impact of pathogenic variants in other genes beyond BRCA1/2 Cancers 2023 15 24 5730 10.3390/cancers15245730 38136276 PMC10741895 Di Rado S, Giansante R, Cicirelli M, Pilenzi L, Dell’Elice A, Anaclerio F, et al. Detection of germline mutations in a cohort of 250 relatives of mutation carriers in multigene panel: impact of pathogenic variants in other genes beyond BRCA1/2. Cancers. 2023;15(24):5730. 38136276 10.3390/cancers15245730 PMC10741895 51. Nunziato M Di Maggio F Pensabene M Esposito MV Starnone F De Angelis C Multi-gene panel testing increases germline predisposing mutations’ detection in a cohort of breast/ovarian cancer patients from Southern Italy Front Med 2022 9 894358 10.3389/fmed.2022.894358 PMC9403188 36035419 Nunziato M, Di Maggio F, Pensabene M, Esposito MV, Starnone F, De Angelis C, et al. Multi-gene panel testing increases germline predisposing mutations’ detection in a cohort of breast/ovarian cancer patients from Southern Italy. Front Med. 2022;9:894358. 10.3389/fmed.2022.894358 PMC9403188 36035419 52. Beiner ME Zhang WW Zhang S Gallinger S Sun P Narod SA Mutations of the MYH gene do not substantially contribute to the risk of breast cancer Breast Cancer Res Treat 2009 114 575 8 10.1007/s10549-008-0042-1 18454351 Beiner ME, Zhang WW, Zhang S, Gallinger S, Sun P, Narod SA. Mutations of the MYH gene do not substantially contribute to the risk of breast cancer. Breast Cancer Res Treat. 2009;114:575–8. 18454351 10.1007/s10549-008-0042-1 53. Win AK Reece JC Dowty JG Buchanan DD Clendenning M Rosty C Risk of extracolonic cancers for people with biallelic and monoallelic mutations in MUTYH Int J Cancer 2016 139 7 1557 63 10.1002/ijc.30197 27194394 PMC5094810 Win AK, Reece JC, Dowty JG, Buchanan DD, Clendenning M, Rosty C, et al. Risk of extracolonic cancers for people with biallelic and monoallelic mutations in MUTYH. Int J Cancer. 2016;139(7):1557–63. 27194394 10.1002/ijc.30197 PMC5094810 54. Guindalini RSC Viana DV Kitajima JPFW Rocha VM López RVM Zheng Y Detection of germline variants in Brazilian breast cancer patients using multigene panel testing Sci Rep 2022 12 1 4190 10.1038/s41598-022-07383-1 35264596 PMC8907244 Guindalini RSC, Viana DV, Kitajima JPFW, Rocha VM, López RVM, Zheng Y, et al. Detection of germline variants in Brazilian breast cancer patients using multigene panel testing. Sci Rep. 2022;12(1):4190. 35264596 10.1038/s41598-022-07383-1 PMC8907244 55. Panigoro SS Listiyaningsih E Nurlaila I Mahesworo B Hidayat AA Budiarto A Intronic variant of MUTYH gene exhibits a strong association with early onset of breast cancer susceptibility in Indonesian women population Asian Pac J Cancer Prevention: APJCP 2021 22 12 3985 10.31557/APJCP.2021.22.12.3985 PMC9080386 34967580 Panigoro SS, Listiyaningsih E, Nurlaila I, Mahesworo B, Hidayat AA, Budiarto A, et al. Intronic variant of MUTYH gene exhibits a strong association with early onset of breast cancer susceptibility in Indonesian women population. Asian Pac J Cancer Prevention: APJCP. 2021;22(12):3985. 10.31557/APJCP.2021.22.12.3985 PMC9080386 34967580 56. Aretz S Tricarico R Papi L Spier I Pin E Horpaopan S MUTYH-associated polyposis (MAP): evidence for the origin of the common European mutations p. Tyr179Cys and p. Gly396Asp by founder events Eur J Hum Genet 2014 22 7 923 9 10.1038/ejhg.2012.309 23361220 PMC4060104 Aretz S, Tricarico R, Papi L, Spier I, Pin E, Horpaopan S, et al. MUTYH-associated polyposis (MAP): evidence for the origin of the common European mutations p. Tyr179Cys and p. Gly396Asp by founder events. Eur J Hum Genet. 2014;22(7):923–9. 23361220 10.1038/ejhg.2012.309 PMC4060104 57. Vogt S Jones N Christian D Engel C Nielsen M Kaufmann A Expanded extracolonic tumor spectrum in MUTYH-associated polyposis Gastroenterology 2009 137 6 1976 85 10.1053/j.gastro.2009.08.052 19732775 Vogt S, Jones N, Christian D, Engel C, Nielsen M, Kaufmann A, et al. Expanded extracolonic tumor spectrum in MUTYH-associated polyposis. Gastroenterology. 2009;137(6):1976–85. e10. 19732775 10.1053/j.gastro.2009.08.052 58. Nielsen M Joerink-Van de Beld MC Jones N Vogt S Tops CM Vasen HF Analysis of MUTYH genotypes and colorectal phenotypes in patients with MUTYH-associated polyposis Gastroenterology 2009 136 2 471 6 10.1053/j.gastro.2008.10.056 19032956 Nielsen M, Joerink-Van de Beld MC, Jones N, Vogt S, Tops CM, Vasen HF, et al. Analysis of MUTYH genotypes and colorectal phenotypes in patients with MUTYH-associated polyposis. Gastroenterology. 2009;136(2):471–6. 19032956 10.1053/j.gastro.2008.10.056 59. Raetz AG David SS When you’re strange: unusual features of the MUTYH glycosylase and implications in cancer DNA Repair 2019 80 16 25 10.1016/j.dnarep.2019.05.005 31203172 PMC6812671 Raetz AG, David SS. When you’re strange: unusual features of the MUTYH glycosylase and implications in cancer. DNA Repair. 2019;80:16–25. 31203172 10.1016/j.dnarep.2019.05.005 PMC6812671 60. Trasviña-Arenas CH David SS Delaye L Azuara-Liceaga E Brieba LG Evolution of base excision repair in entamoeba histolytica is shaped by gene loss, gene duplication, and lateral gene transfer DNA Repair 2019 76 76 88 10.1016/j.dnarep.2019.02.009 30822689 Trasviña-Arenas CH, David SS, Delaye L, Azuara-Liceaga E, Brieba LG. Evolution of base excision repair in entamoeba histolytica is shaped by gene loss, gene duplication, and lateral gene transfer. DNA Repair. 2019;76:76–88. 30822689 10.1016/j.dnarep.2019.02.009 61. Xu Z Zhang L Zhang W Meng D Zhang H Jiang Y SIRT6 rescues the age related decline in base excision repair in a PARP1-dependent manner Cell Cycle 2015 14 2 269 76 10.4161/15384101.2014.980641 25607651 PMC4614943 Xu Z, Zhang L, Zhang W, Meng D, Zhang H, Jiang Y, et al. SIRT6 rescues the age related decline in base excision repair in a PARP1-dependent manner. Cell Cycle. 2015;14(2):269–76. 25607651 10.4161/15384101.2014.980641 PMC4614943 62. Mostoslavsky R Chua KF Lombard DB Pang WW Fischer MR Gellon L Genomic instability and aging-like phenotype in the absence of mammalian SIRT6 Cell 2006 124 2 315 29 10.1016/j.cell.2005.11.044 16439206 Mostoslavsky R, Chua KF, Lombard DB, Pang WW, Fischer MR, Gellon L, et al. Genomic instability and aging-like phenotype in the absence of mammalian SIRT6. Cell. 2006;124(2):315–29. 16439206 10.1016/j.cell.2005.11.044 63. Tischkowitz M Xia B PALB2/FANCN: recombining cancer and Fanconi anemia Cancer Res 2010 70 19 7353 9 10.1158/0008-5472.CAN-10-1012 20858716 PMC2948578 Tischkowitz M, Xia B. PALB2/FANCN: recombining cancer and Fanconi anemia. Cancer Res. 2010;70(19):7353–9. 20858716 10.1158/0008-5472.CAN-10-1012 PMC2948578 ",
  "metadata": {
    "Title of this paper": "PALB2/FANCN: recombining cancer and Fanconi anemia",
    "Journal it was published in:": "BMC Medical Genomics",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12487069/"
  }
}