{
  "title": "Paper_1020",
  "abstract": "pmc Discov Oncol Discov Oncol 4139 discon Discover Oncology 2730-6011 Springer PMC12480182 PMC12480182.1 12480182 12480182 41021150 10.1007/s12672-025-03553-5 3553 1 Research SMPD2 affects the prognosis of cancer patients by mediating lipid metabolism and the immune microenvironment Li Qing-Yan 1 Huang Jia-Ming 3 Yuan Xiang 4 Guo Hui-Long 1 Zhang Wei 1 Chen Yu-Chuan 2832886254@qq.com 5 Li Yi-yi liyiyi56@smu.edu.cn 4 Song Ze songze@sysush.com 2 1 https://ror.org/00rfd5b88 grid.511083.e 0000 0004 7671 2506 Emergency and Disaster Medicine Center, The Seventh Affiliated Hospital of Sun Yat-sen University, 2 https://ror.org/00rfd5b88 grid.511083.e 0000 0004 7671 2506 Oncology Department, The Seventh Affiliated Hospital of Sun Yat-Sen University, 3 4 https://ror.org/01vjw4z39 grid.284723.8 0000 0000 8877 7471 Department of Radiation Oncology, Nanfang Hospital, Southern Medical University, 5 https://ror.org/01vjw4z39 grid.284723.8 0000 0000 8877 7471 State Key Laboratory of Organ Failure Research; Key Laboratory of Infectious Diseases Research in South China, Ministry of Education; Guangdong Provincial Key Laboratory for Prevention and Control of Major Liver Diseases; Guangdong Provincial Clinical Research Center for Viral Hepatitis; Guangdong Institute of Hepatology; Guangdong Provincial Research Center for Liver Fibrosis Engineering and Technology; Department of Infectious Diseases, Nanfang Hospital, Southern Medical University, 29 9 2025 12 2025 16 478248 1741 5 6 2025 30 8 2025 29 09 2025 01 10 2025 01 10 2025 © The Author(s) 2025 2025 https://creativecommons.org/licenses/by-nc-nd/4.0/ Open Access http://creativecommons.org/licenses/by-nc-nd/4.0/ The gene Sphingomyelin phosphodiesterase 2 (SMPD2), a member of the SMPD family, plays crucial roles in cell cycle progression and cell proliferation. However, the pathogenic implications of SMPD2 across various cancers remain poorly understood. Its potential involvement in lipid metabolism and immune-related processes within the tumor microenvironment has not been systematically characterized. To address these gaps, we conducted a comprehensive pan-cancer analysis of SMPD2. Using a range of computational tools, we investigated its role in tumor immune infiltration, immune evasion, tumor progression, therapy response, and prognosis across various cancer types. Our findings suggest that SMPD2 is widely expressed across cancers in The Cancer Genome Atlas (TCGA) and its expression levels are associated with tumor stages and clinical outcomes. Additionally, SMPD2 was found to be involved in tumor immune evasion across different cancer types. The methylation status of SMPD2 was inversely correlated with its mRNA expression levels, which were associated with dysfunctional T cell phenotypes and worse prognoses in diverse cancer cohorts. Furthermore, SMPD2 expression was linked to heterogeneous therapeutic outcomes across multiple cancer types, including variable responses to immune checkpoint blockade. Interestingly, SMPD2 demonstrated superior predictive capacity for treatment response and overall survival in immune checkpoint blockade sub-cohorts compared to three of the seven established biomarkers. While functional experiments are warranted, our results provide a data-driven, pan-cancer landscape of SMPD2 expression and its potential relevance to immune modulation and clinical outcomes Overall, SMPD2 may serve as a candidate biomarker for cancer prognosis and therapeutic response, and a potential target for future mechanistic studies. Supplementary Information The online version contains supplementary material available at 10.1007/s12672-025-03553-5. Keywords SMPD2 Biomarker Immune cell infiltration Pan-cancer Prognosis pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement yes pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes issue-copyright-statement © Springer Science+Business Media LLC, part of Springer Nature 2025 Introduction The rising incidence and mortality rates of cancer have garnered significant attention [ 1 Ceramides, a class of bioactive sphingolipids, are key regulators of fundamental cellular processes such as cell death, proliferation, autophagy, and drug resistance [ 2 3 4 5 7 Emerging evidence suggests that sphingolipid metabolism is intricately linked to antitumor immunity, particularly through its influence on immune cell function and response to immunotherapy. Among the nSMase family, SMPD2 (also known as nSMase1) stands out for its subcellular localization and functional roles. It is predominantly found in the endoplasmic reticulum (ER) and Golgi apparatus [ 5 8 9 10 11 12 The tumor microenvironment (TME) is a highly complex and heterogeneous ecosystem comprising malignant cells, fibroblasts, vasculature, immune, and immunosuppressive cells. This complexity fosters interactions that often lead to immune dysfunction, such as T-cell anergy, and impaired anti-tumor immune responses [ 13 14 15 16 17 Sphingolipids, as structural components of cell membranes, regulate immune cell surface dynamics and modulate lymphocyte trafficking, inflammatory responses, and chemotaxis [ 18 20 21 23 24 However, the specific contributions of SMPD2 in shaping the immune landscape of tumors remain unclear. An integrated analysis of SMPD2 expression in cancer and its associations with immune contexture, prognosis, and therapy response may uncover novel insights into its clinical and biological significance. Systematically profiling diverse immune and stromal cell types across cancers remains challenging using experimental methods alone. In this context, bioinformatics approaches offer efficient and scalable alternatives by integrating multi-omics and clinical data to extract immune-related features. Such computational frameworks have become indispensable for cancer biomarker discovery, prognosis modeling, and therapeutic response prediction. In this study, we conducted a comprehensive pan-cancer analysis of SMPD2 using publicly available datasets. We investigated its expression patterns, epigenetic regulation, associations with immune cell infiltration and immune checkpoint expression, prognostic implications, and therapeutic relevance across multiple cancer types. Our goal was to delineate the potential role of SMPD2 in the tumor immune microenvironment and evaluate its utility as a biomarker and research target. Materials and methods Data acquisition We downloaded the uniformly processed and batch-corrected pan-cancer dataset TCGA TARGET GTEx (PANCAN; N https://xenabrowser.net/ Primary Solid Tumor Primary Tumor Bone Marrow Peripheral Blood Metastatic Differential SMPD2 expression analysis To assess SMPD2 expression across different tumor stages, we employed the expression DIY module in GEPIA2 to generate pathological stage plots (I, II, III, IV) for TCGA cancer types. Additionally, we used the TNMplot module from the Kaplan-Meier (KM) plotter for differential gene expression analysis across tumor, normal, and metastatic tissues. The prognostic differences of SMPD2 expression across 38 tumor types were analyzed using the dichotomy method. Differential expression and survival analysis Differential expression of SMPD2 between tumor and normal tissues was analyzed across 34 cancer types using the Wilcoxon rank-sum test in R (version 3.6.4). Tumor types with fewer than three samples per group were excluded. For survival analysis, patients were stratified into high- and low-expression groups based on median SMPD2 expression. Kaplan–Meier (KM) survival curves, log-rank tests, and Cox proportional hazards regression models were used to evaluate overall survival (OS), disease-specific survival (DSS), and progression-free survival (PFS). Hazard ratios (HR) and 95% confidence intervals (CI) were calculated using the R packages survival and survminer. Immune cell infiltration analysis To estimate immune cell infiltration, we used multiple complementary methods: TIMER2.0 was applied to quantify the infiltration of six major immune cell types (B cells, CD4 + T cells, CD8 + T cells, neutrophils, macrophages, dendritic cells) across 38 tumor types. ESTIMATE scores, including ImmuneScore, StromalScore, and ESTIMATE Score, were computed using the R package estimate (v1.0.13), which infers tumor purity based on gene expression. xCell-based immune deconvolution was performed using the IOBR R package (v0.99.9), yielding enrichment scores for 67 immune and stromal cell types, including immunosuppressive populations such as Tregs, M2 macrophages, and fibroblasts. For all immune-related scores, Pearson correlation coefficients between SMPD2 expression and infiltration scores were calculated using the psych (version 2.1.6) corr.test function in R. Immune checkpoint co-expression analysis We curated a List of 60 immune checkpoint–related genes (24 inhibitory and 36 stimulatory) based on the study The Immune Landscape of Cancer [ 25 r Tumor mutation burden, neoantigens, and functional enrichment We analyzed the correlation between SMPD2 expression and tumor mutation burden (TMB) using TCGA mutation data. Associations were evaluated using Spearman’s rank correlation. Differential expression and functional enrichment analysis Gene expression and corresponding clinical data of the target cancer type were retrieved using the TCGAbiolinks R package. Project identifiers and data types were specified to batch download high-throughput data via the GDC API. Standardized preprocessing was conducted to remove batch effects. Patients were stratified into high and low expression groups based on SMPD2 transcript levels. Differential gene expression analysis between the two groups was performed using the DESeq2 or edgeR package in R. Genes were considered significantly differentially expressed if they met both the adjusted p-value threshold ( p Functional enrichment analysis of the identified differentially expressed genes (DEGs) was then conducted. Gene Ontology (GO) analysis and Kyoto Encyclopedia of Genes and Genomes (KEGG) pathway analysis were performed using the clusterProfiler and org.Hs.eg.db packages in R. Enrichment results for biological processes, molecular functions, cellular components, and signaling pathways were visualized using bar plots. Epigenetic methylation analysis We used the TCGA methylation module of the UALCAN interactive web resource to analyze differential methylation levels of SMPD2 between tumor and paired normal tissues across TCGA cancer types. Promoter methylation levels were represented by beta (β) values ranging from 0 (unmethylated) to 1 (fully methylated). Different β value cutoff points were considered to indicate hypomethylation (β: 0.25–0.3) and hypermethylation (β: 0.5–0.7). We also used the TIDE server to assess the effects of methylation on dysfunctional T cell phenotypes and prognoses. Patient samples Noncancerous adjacent tissue and cancerous tissue of HCC were collected along with informed consent from patients under a protocol approved by the Medical Ethics Committee of Nanfang Hospital, Southern Medical University, Guangzhou, Guangdong, China (No. NEFC-2021-394). All samples were obtained from the Division of Hepatobiliopancreatic Surgery, Department of General Surgery, Nanfang Hospital, Southern Medical University, Guangzhou, Guangdong, China. All experiments were performed in accordance with relevant guidelines and regulations. Immunohistochemistry analysis Formalin-fixed paraffin-embedded HCC specimens were treated with xylene and later rehydrated in alcohol at decreasing concentrations. Sections were boiled in citrate antigenic retrieval buffer (pH = 6.0) for 3 min, cooled to room temperature (RT), and endogenous peroxidase activity was quenched with 3% hydrogen peroxide for 10 min. Sections were blocked with 10% goat serum at RT for 30 min, then incubated with human SMPD2, human PD-L1, and human LAG-3 antibodies at 4 °C overnight. After washing, sections were incubated with a biotinylated secondary antibody at RT for 30 min, followed by a final wash with 1x PBS. Sections were then incubated with horseradish-conjugated streptavidin at RT for 20 min, developed with 3,3-diaminobenzidine tetrahydrochloride, and counterstained with hematoxylin. An IHC staining without primary antibody served as a negative control. Statistical analysis and multiple testing correction All statistical analyses were conducted using R version 3.6.4. For group comparisons, Wilcoxon Rank Sum tests were used. For correlation analyses, Pearson or Spearman methods were applied depending on data distribution. To account for multiple comparisons across expression, immune correlation, and survival analyses, we performed false discovery rate (FDR) correction using the Benjamini–Hochberg method. Unless otherwise specified, an FDR-adjusted p-value < 0.05 was considered statistically significant. In visualizations, significance thresholds were denoted as p Results Expression levels of SMPD2 Analysis of the GTEx dataset revealed that SMPD2 is expressed at low levels in muscle tissues but is most highly expressed in the testis (Fig. 1 1 p −37 p −51 p −31 p −8 p −40 p −3 p −13 p −14 p −51 p −60 p −8 p −16 p −30 p −4 p −22 p −20 p −47 p −6 p −5 p −8 p −3 p −21 p −6 p −60 p −49 p −8 p −13 1 1  Fig. 1 SMPD2 expression in different tissue types; a b c d Prognostic relevance of SMPD2 expression in tumor To assess the correlation between SMPD2 expression and patient prognosis across the 38 tumor types, with results compiled as forest plots ( p For Disease-specific survival (DSS), we observed that high expression of SMPD2 was associated with poor prognosis in five tumor types: TCGA-GBMLGG glioblastoma multiforme and lower-grade glioma ( n p −12 n p −4 n p n p n p −3 n p −3 2 Overall survival (OS) analysis revealed that high expression was associated with poor prognosis in five tumor types: TCGA-GBMLGG glioblastoma multiforme and lower-grade glioma ( n p −12 n p −4 n p n p n p −3 n p −3 2 S1 p p p  Fig. 2 Prognostic relevance of SMPD2 expression in 38 tumor types. a b Relationship between SMPD2 expression and immune cell infiltration To investigate the immunological relevance of SMPD2 in the tumor microenvironment, we comprehensively analyzed its association with immune cell infiltration, immune checkpoint gene expression, and tumor mutational characteristics across cancer types. SMPD2 expression exhibited diverse correlations with immune cell infiltration levels across cancers. Using the TIMER2.0 algorithm, we observed both positive and negative correlations between SMPD2 and the infiltration of B cells, CD4⁺ and CD8⁺ T cells, neutrophils, macrophages, and dendritic cells, indicating a heterogeneous immune regulatory landscape associated with SMPD2 (Fig. 3 3 3 3 PDCD1 CTLA4 LAG3 3 3  Fig. 3 The SMPD2 expression correlated with immune infiltration. a b c d e f Transcriptomic and functional pathway alterations associated with SMPD2 overexpression Comparison of gene expression profiles between SMPD2-high and -low tumors revealed marked transcriptional differences. A volcano plot illustrates the global DEG distribution (Fig. 3 S2 Functional enrichment analysis of the upregulated genes revealed strong associations with key metabolic and immune-related pathways. KEGG analysis identified significant enrichment in complement and coagulation cascades, cholesterol metabolism, steroid hormone biosynthesis, bile secretion, and drug metabolism via cytochrome P450 (Fig. 3 In line with this, GO biological process analysis further highlighted enrichment in organic acid biosynthetic process, steroid metabolic process, and small molecule catabolic process, supporting a role for SMPD2 in shaping the metabolic landscape of tumors (Fig. S2 Collectively, these findings suggest that SMPD2 may contribute to tumor progression by orchestrating transcriptomic programs linked to metabolic adaptation and immunosuppressive microenvironmental remodeling.  Fig. 4 Transcriptomic and pathway alterations associated with high SMPD2 expression. A p B Epigenetic modifications of SMPD2 is associated with dysfunctional T cell phenotypes and poor prognoses in cancer cohorts Promoter methylation status was analysed and it was found that SMPD2 is hypermethylated in PRAD, while hypomethylated in cancers such as BRCA, BLCA, LUAD, LUSC, THCA, UCEC, and READ (Fig. 5 5 5  Fig. 5 Methylation-mediated T cell phenotype dysregulation is associated with poor prognosis. A B C Association of SMPD2 expression with therapeutic responses The impact of SMPD2 expression on chemotherapeutic responses was investigated and it was found that SMPD2 expression did not significantly affect chemotherapy responses in ovarian cancer and colorectal cancer patients. However, higher SMPD2 expression was associated with favorable trends in treatment response in breast cancer and glioblastoma patients (Fig. 6 6  Fig. 6 SMPD2 expression associated with therapeutic responses. A B Verification of SMPD2 expression in vitro and in vivo To further illustrate the expression pattern of SMPD2 in HCC, we investigated SMPD2 expression in HCC tissues collected from 24 cases in our center as stated above. SMPD2 expression in liver tissues from HCC patients was also visualized through immunostaining. We found that the protein level of SMPD2 was overexpressed in HCC tissues in majority of the enrolled patients, thus it was significantly overexpressed in HCC tissues than in general (Figs. 7 7  Fig. 7 Verification of SMPD2 expression in vitro and in vivo. a b Conclusion In summary, our pan-cancer analysis revealed that SMPD2 is differentially expressed across multiple cancer types and is significantly associated with patient prognosis, immune features, and therapeutic responses. High SMPD2 expression predicted poorer survival outcomes in cancers such as ACC, KIRC, LGG, LIHC, and SKCM, while lower expression was unfavorable in UCEC and PAAD. SMPD2 expression was positively correlated with immune checkpoint molecules, immune cell infiltration, and tumor mutational burden, suggesting a potential role in immune evasion. Additionally, SMPD2 methylation status was linked to dysfunctional T cell phenotypes and clinical outcomes, further supporting its involvement in immune regulation. Importantly, transcriptomic and enrichment analyses revealed that SMPD2 may contribute to tumor progression by modulating key metabolic and immunosuppressive pathways, including lipid metabolism, steroid biosynthesis, and complement activation. These mechanisms may underlie its impact on therapeutic responses, especially in the context of chemotherapy and immune checkpoint blockade. Overall, SMPD2 emerges as a promising biomarker and potential therapeutic target in cancer. Future studies should aim to experimentally validate its mechanistic roles and assess its clinical utility in precision oncology. Discussion Our pan-cancer integrative analysis revealed that SMPD2 is aberrantly expressed across multiple cancer types and is closely associated with patient prognosis, tumor heterogeneity, and the tumor microenvironment. In several cancers, SMPD2 may act as a tumor-promoting factor, potentially through its roles in immune modulation and genomic instability. Expression patterns of SMPD2 Our analysis of the GTEx and CCLE databases demonstrated that SMPD2 is predominantly expressed in the testis and shows variable expression in different cancer cell lines. Notably, high SMPD2 expression was observed in several cancers, including BLCA, BRCA, CHOL, GBM, KIRP, LIHC, LUSC, PRAD, READ, THCA, and UCEC. This suggests that SMPD2 may play diverse roles depending on the tissue context. The observed low expression in certain cancers, such as HNSC and KICH, further highlight the tissue-specific regulation of SMPD2. Prognostic significance Our survival analysis indicates that SMPD2 expression significantly impacts prognosis in various cancers. High SMPD2 expression was associated with poor survival in ACC, KIRC, LGG, LIHC, and SKCM, suggesting that SMPD2 may act as an oncogene in these cases. Conversely, low SMPD2 expression was linked to poorer outcomes in UCEC and PAAD. These differential effects highlight the complex role of SMPD2 in cancer biology and its potential utility as a prognostic biomarker. Role in immune microenvironment We observed significant positive correlations between SMPD2 expression and key immune checkpoint molecules, including PD-1, PD-L1, and CTLA4, across multiple tumor types. This suggests that SMPD2 may contribute to immune evasion mechanisms and could represent a potential target for immunotherapy [ 26 27 28 Transcriptomic and pathway mechanisms Transcriptome-wide comparisons revealed that high SMPD2 expression is associated with the upregulation of genes involved in lipid metabolism, steroid biosynthesis, and xenobiotic detoxification. These findings suggest that SMPD2 may promote tumor adaptation by enhancing metabolic plasticity, a hallmark of cancer cells that supports survival under stress and therapeutic pressure [ 29 30 Epigenetic modifications Abnormal DNA methylation is an important epigenetic regulator involving tumorigenesis [ 31 25 32 Therapeutic implications The impact of SMPD2 on therapeutic responses was also explored. While SMPD2 expression did not significantly affect chemotherapeutic responses in glioblastoma, ovarian, and colorectal cancers, it was associated with improved outcomes in breast cancer patients undergoing chemotherapy. Furthermore, higher SMPD2 expression correlated with better responses to PD-L1 immune checkpoint blockade in melanoma and GBM patients. PD-1 (PD) pathway blockade is a highly promising therapy [ 33 34 Validation and prospects In vitro validation of SMPD2 expression in various cancer tissues confirmed its differential expression, with overexpression observed in several tumor types. Notably, SMPD2 was highly expressed in HCC tissues, and its levels positively correlated with PD-L1 and LAG-3, indicating its potential role in creating an immunosuppressive microenvironment. Overall, our study highlights the multifaceted role of SMPD2 in cancer, from influencing tumor progression and immune interactions to affecting therapeutic responses. Future research should focus on elucidating the precise mechanisms by which SMPD2 regulates these processes and explore its potential as a therapeutic target or biomarker in cancer treatment. While our findings provide novel insights into the potential roles of SMPD2 in cancer, several limitations should be considered. First, our analyses were primarily based on large-scale transcriptomic and clinical data from public databases, which may introduce bias due to data heterogeneity. Second, although we identified significant correlations between SMPD2 and immune checkpoint molecules, functional validation through in vitro or in vivo experiments was not feasible in the current study due to experimental constraints. Further experimental studies are warranted to validate these associations and clarify the mechanistic roles of SMPD2 in tumor immunity. Supplementary Information Below is the link to the electronic supplementary material.  Supplementary Material 1.  Supplementary Material 2. Abbreviations GBM Glioblastoma multiforme GBMLGG Glioblastoma multiforme and lower-grade glioma LGG Lower-grade glioma UCEC Uterine corpus endometrial carcinoma BRCA Breast invasive carcinoma ESCA Esophageal carcinoma STES Stomach and esophageal carcinoma KIRP Kidney renal papillary cell carcinoma COAD Colon adenocarcinoma COADREAD Colorectal adenocarcinoma PRAD Prostate adenocarcinoma STAD Stomach adenocarcinoma LIHC Liver hepatocellular carcinoma BLCA Bladder carcinoma PAAD Pancreatic adenocarcinoma ALL Acute lymphoblastic leukemia LAML Acute myeloid leukemia CHOL Cholangiocarcinoma LUAD Lung adenocarcinoma HNSC Head and neck squamous cell carcinoma KIRC Kidney renal clear cell carcinoma WT Wilms tumor SKCM Skin cutaneous melanoma THCA Thyroid carcinoma TGCT Testicular germ cell tumor ACC Adrenocortical carcinoma KICH Kidney chromophobe SMPD2 Sphingomyelin phosphodiesterase 2 TME Tumor microenvironment ICB Immune checkpoint blockade TMB Tumor mutational burden GTEx Genotype-tissue expression CCLE Cancer cell line encyclopedia IHC Immunohistochemistry HR Hazard ratio CI Confidence interval DFS Disease-free survival OS Overall survival PFS Progression-free survival MDSCs Myeloid-derived suppressor cells Tregs Regulatory T cells CAFs Cancer-associated fibroblasts nSMase Neutral sphingomyelinase nSMase1 Neutral sphingomyelinase 1 LAG-3 Lymphocyte activation gene 3 PD-L1 Programmed death-ligand 1 PD-1 Programmed cell death protein 1 GSEA Gene Set Enrichment Analysis KEGG Kyoto Encyclopedia of Genes and Genomes TIDE Tumor immune dysfunction and exclusion Publisher’s note Springer Nature remains neutral with regard to jurisdictional claims in published maps and institutional affiliations. Li Qing-Yan, Huang Jia-Ming and Yuan Xiang contributed equally to this work. Acknowledgements Not applicable. Author contributions Li Qing-Yan: Conceptualization, Methodology, Writing – Original Draft, Writing – Review & Editing.Huang Jia-Ming: Data Collection, Data Analysis, Visualization, Writing – Original Draft.Yuan Xiang: Supervision, Validation, Project Administration, Writing – Review & Editing.Guo Hui-Long: Software, Formal Analysis, Writing – Original Draft.Zhang Wei: Data acquisition and statistical analysis.Chen Yu-Chuan: Resources, Data Curation, Writing – Review & Editing.Li Yi-yi: Resources, Writing – Review & Editing.Song Ze: Study Supervision, Writing – Review & Editing.Li Qing-Yan, Huang Jia-Ming, Yuan Xiang contributed equally to this work and share first authorship.Chen Yu-Chuan, Li Yi-yi, and Song Ze: Co-corresponding authors. Funding No funding was received for this study. Data availability The datasets generated and/or analyzed during the current study are available in the TCGA ( [https://cancergenome.nih.gov/](https:/cancergenome.nih.gov) ), GTEx ( [https://commonfund.nih.gov/GTEx](https:/commonfund.nih.gov/GTEx) ), and CCLE ( [https://portals.broadinstitute.org/ccle/](https:/portals.broadinstitute.org/ccle) ). Additional data generated in this study are not publicly available due to patient privacy and institutional restrictions but are available from the corresponding author on reasonable request. Declarations Ethics approval and consent to participate This study was approved by the Ethics Committee of Nanfang Hospital, Southern Medical University (No. NEFC-2021-394).All procedures performed in studies involving human participants were in accordance with the ethical standards of the institutional research committee and with the 1964 Helsinki Declaration and its later amendments or comparable ethical standards.Informed consent was obtained from all individual participants included in the study. Consent for publication Not applicable. Competing interests The authors declare no competing interests. References 1. Siegel RL, Giaquinto AN, Jemal A, Cancer statistics. Cancer JC. 2024;74(1):12–49. doi: 10.3322/caac.21820. Epub 2024 Jan 17. Erratum in: CA Cancer J Clin. 2024 Mar-Apr;74(2):203. doi: 10.3322/caac.21830. 10.3322/caac.21820 38230766 2. Clarke CJ. Neutral sphingomyelinases in cancer. In Advances in cancer research, Vol. 140. Elsevier; 2018. pp. 97–11910.1016/bs.acr.2018.04.010. 10.1016/bs.acr.2018.04.010 30060818 3. Liu B Xiao J Dong M Qiu Z Jin J Human alkaline ceramidase 2 promotes the growth, invasion, and migration of hepatocellular carcinoma cells via sphingomyelin phosphodiesterase acid-like 3B Cancer Sci 2020 111 7 2259 74 10.1111/cas.14453 32391585 PMC7385342 Liu B, Xiao J, Dong M, Qiu Z, Jin J. Human alkaline ceramidase 2 promotes the growth, invasion, and migration of hepatocellular carcinoma cells via sphingomyelin phosphodiesterase acid-like 3B. Cancer Sci. 2020;111(7):2259–74. 10.1111/cas.14453. 32391585 10.1111/cas.14453 PMC7385342 4. Ogretmen B, Hannun YA. Biologically active sphingolipids in cancer pathogenesis and treatment. Nat Rev Cancer. 2004;4(8):604–16. 10.1038/nrc1411. 10.1038/nrc1411 15286740 5. Clarke CJ Mediwala K Jenkins RW Sutton CA Tholanikunnel BG Hannun YA Neutral sphingomyelinase-2 mediates growth arrest by retinoic acid through modulation of ribosomal S6 kinase J Biol Chem 2011 286 24 21565 76 10.1074/jbc.M110.193375 21536668 PMC3122215 Clarke CJ, Mediwala K, Jenkins RW, Sutton CA, Tholanikunnel BG, Hannun YA. Neutral sphingomyelinase-2 mediates growth arrest by retinoic acid through modulation of ribosomal S6 kinase. J Biol Chem. 2011;286(24):21565–76. 10.1074/jbc.M110.193375. 21536668 10.1074/jbc.M110.193375 PMC3122215 6. Hurwitz SN Jung SK Kobulsky DR Fazelinia H Spruce LA Pérez EB Groen N Mesaros C Kurre P Neutral Sphingomyelinase Blockade enhances hematopoietic stem cell fitness through an integrated stress response Blood 2023 142 20 1708 23 10.1182/blood.2023022147 37699202 PMC10667352 Hurwitz SN, Jung SK, Kobulsky DR, Fazelinia H, Spruce LA, Pérez EB, Groen N, Mesaros C, Kurre P. Neutral Sphingomyelinase Blockade enhances hematopoietic stem cell fitness through an integrated stress response. Blood. 2023;142(20):1708–23. 10.1182/blood.2023022147. 37699202 10.1182/blood.2023022147 PMC10667352 7. Sindhu S, Leung YH, Arefanian H, Madiraju SRM, Al-Mulla F, Ahmad R, Prentki M. Neutral sphingomyelinase‐2 and cardiometabolic diseases. Obes Rev. 2021;22(8). 10.1111/obr.13248. 10.1111/obr.13248 PMC8365731 33738905 8. Yabu T Shiba H Shibasaki Y Nakanishi T Imamura S Touhata K Yamashita M Stress-induced ceramide generation and apoptosis via the phosphorylation and activation of nSMase1 by JNK signaling Cell Death Differ 2015 22 2 258 73 10.1038/cdd.2014.128 25168245 PMC4291487 Yabu T, Shiba H, Shibasaki Y, Nakanishi T, Imamura S, Touhata K, Yamashita M. Stress-induced ceramide generation and apoptosis via the phosphorylation and activation of nSMase1 by JNK signaling. Cell Death Differ. 2015;22(2):258–73. 10.1038/cdd.2014.128. 25168245 10.1038/cdd.2014.128 PMC4291487 9. Shamseddine AA Airola MV Hannun YA Roles and regulation of neutral sphingomyelinase-2 in cellular and pathological processes Adv Biol Regul 2015 57 24 41 10.1016/j.jbior.2014.10.002 25465297 PMC4684640 Shamseddine AA, Airola MV, Hannun YA. Roles and regulation of neutral sphingomyelinase-2 in cellular and pathological processes. Adv Biol Regul. 2015;57:24–41. 10.1016/j.jbior.2014.10.002. 25465297 10.1016/j.jbior.2014.10.002 PMC4684640 10. Tonnetti L Verí MC Bonvini E D’Adamio L A role for neutral sphingomyelinase-mediated ceramide production in T cell receptor-induced apoptosis and mitogen-activated protein kinase-mediated signal transduction J Exp Med 1999 189 10 1581 9 10.1084/jem.189.10.1581 10330437 PMC2193632 Tonnetti L, Verí MC, Bonvini E, D’Adamio L. A role for neutral sphingomyelinase-mediated ceramide production in T cell receptor-induced apoptosis and mitogen-activated protein kinase-mediated signal transduction. J Exp Med. 1999;189(10):1581–9. 10.1084/jem.189.10.1581. 10330437 10.1084/jem.189.10.1581 PMC2193632 11. Lin M Liao W Dong M Zhu R Xiao J Sun T Chen Z Wu B Jin J Exosomal neutral Sphingomyelinase 1 suppresses hepatocellular carcinoma via decreasing the ratio of sphingomyelin/ceramide FEBS J 2018 285 20 3835 48 10.1111/febs.14635 30106227 Lin M, Liao W, Dong M, Zhu R, Xiao J, Sun T, Chen Z, Wu B, Jin J. Exosomal neutral Sphingomyelinase 1 suppresses hepatocellular carcinoma via decreasing the ratio of sphingomyelin/ceramide. FEBS J. 2018;285(20):3835–48. 10.1111/febs.14635. 30106227 10.1111/febs.14635 12. Zhong L Kong JN Dinkins MB Leanhart S Zhu Z Spassieva SD Qin H Lin HP Elsherbini A Wang R Jiang X Nikolova-Karakashian M Wang G Bieberich E Increased liver tumor formation in neutral sphingomyelinase-2-deficient mice J Lipid Res 2018 59 5 795 804 10.1194/jlr.M080879 29567647 PMC5928441 Zhong L, Kong JN, Dinkins MB, Leanhart S, Zhu Z, Spassieva SD, Qin H, Lin HP, Elsherbini A, Wang R, Jiang X, Nikolova-Karakashian M, Wang G, Bieberich E. Increased liver tumor formation in neutral sphingomyelinase-2-deficient mice. J Lipid Res. 2018;59(5):795–804. 29567647 10.1194/jlr.M080879 PMC5928441 13. Companioni O Mir C Garcia-Mayea Y LLeonart ME Targeting sphingolipids for cancer therapy Front Oncol 2021 11 745092 10.3389/fonc.2021.745092 34737957 PMC8560795 Companioni O, Mir C, Garcia-Mayea Y, LLeonart ME. Targeting sphingolipids for cancer therapy. Front Oncol. 2021;11:745092. 10.3389/fonc.2021.745092. 34737957 10.3389/fonc.2021.745092 PMC8560795 14. Han S Bao X Zou Y Wang L Li Y Yang L Liao A Zhang X Jiang X Liang D Dai Y Zheng QC Yu Z Guo J d-lactate modulates M2 tumor-associated macrophages and remodels immunosuppressive tumor microenvironment for hepatocellular carcinoma Sci Adv 2023 9 29 eadg2697 10.1126/sciadv.adg2697 37467325 PMC10355835 Han S, Bao X, Zou Y, Wang L, Li Y, Yang L, Liao A, Zhang X, Jiang X, Liang D, Dai Y, Zheng QC, Yu Z, Guo J. d-lactate modulates M2 tumor-associated macrophages and remodels immunosuppressive tumor microenvironment for hepatocellular carcinoma. Sci Adv. 2023;9(29):eadg2697. 10.1126/sciadv.adg2697. 37467325 10.1126/sciadv.adg2697 PMC10355835 15. Zhang H Yue X Chen Z Liu C Wu W Zhang N Liu Z Yang L Jiang Q Cheng Q Luo P Liu G Define cancer-associated fibroblasts (CAFs) in the tumor microenvironment: new opportunities in cancer immunotherapy and advances in clinical trials Mol Cancer 2023 22 1 159 10.1186/s12943-023-01860-5 37784082 PMC10544417 Zhang H, Yue X, Chen Z, Liu C, Wu W, Zhang N, Liu Z, Yang L, Jiang Q, Cheng Q, Luo P, Liu G. Define cancer-associated fibroblasts (CAFs) in the tumor microenvironment: new opportunities in cancer immunotherapy and advances in clinical trials. Mol Cancer. 2023;22(1):159. 10.1186/s12943-023-01860-5. 37784082 10.1186/s12943-023-01860-5 PMC10544417 16. Wang H Franco F Ho PC Metabolic regulation of Tregs in cancer: opportunities for immunotherapy Trends Cancer 2017 3 8 583 92 10.1016/j.trecan.2017.06.005 28780935 Wang H, Franco F, Ho PC. Metabolic regulation of Tregs in cancer: opportunities for immunotherapy. Trends Cancer. 2017;3(8):583–92. 10.1016/j.trecan.2017.06.005. 28780935 10.1016/j.trecan.2017.06.005 17. Lindau D Gielen P Kroesen M Wesseling P Adema GJ The immunosuppressive tumour network: myeloid-derived suppressor cells, regulatory T cells and natural killer T cells Immunology 2013 138 2 105 15 10.1111/imm.12036 23216602 PMC3575763 Lindau D, Gielen P, Kroesen M, Wesseling P, Adema GJ. The immunosuppressive tumour network: myeloid-derived suppressor cells, regulatory T cells and natural killer T cells. Immunology. 2013;138(2):105–15. 10.1111/imm.12036. 23216602 10.1111/imm.12036 PMC3575763 18. Giussani P Prinetti A Tringali C The role of sphingolipids in cancer immunotherapy Int J Mol Sci 2021 22 12 6492 10.3390/ijms22126492 34204326 PMC8234743 Giussani P, Prinetti A, Tringali C. The role of sphingolipids in cancer immunotherapy. Int J Mol Sci. 2021;22(12):6492. 10.3390/ijms22126492. 34204326 10.3390/ijms22126492 PMC8234743 19. Ogretmen B Hannun YA Biologically active sphingolipids in cancer pathogenesis and treatment Nat Rev Cancer 2004 4 8 604 16 10.1038/nrc1411 15286740 Ogretmen B, Hannun YA. Biologically active sphingolipids in cancer pathogenesis and treatment. Nat Rev Cancer. 2004;4(8):604–16. 10.1038/nrc1411. 15286740 10.1038/nrc1411 20. Gomez-Muñoz A Presa N Gomez-Larrauri A Rivera I-G Trueba M Ordoñez M Control of inflammatory responses by ceramide, sphingosine 1-phosphate and ceramide 1-phosphate Prog Lipid Res 2016 61 51 62 10.1016/j.plipres.2015.09.002 26703189 Gomez-Muñoz A, Presa N, Gomez-Larrauri A, Rivera I-G, Trueba M, Ordoñez M. Control of inflammatory responses by ceramide, sphingosine 1-phosphate and ceramide 1-phosphate. Prog Lipid Res. 2016;61:51–62. 10.1016/j.plipres.2015.09.002. 26703189 10.1016/j.plipres.2015.09.002 21. Henry B Möller C Dimanche-Boitrel M-T Gulbins E Becker KA Targeting the ceramide system in cancer Cancer Lett 2013 332 2 286 94 10.1016/j.canlet.2011.07.010 21862212 Henry B, Möller C, Dimanche-Boitrel M-T, Gulbins E, Becker KA. Targeting the ceramide system in cancer. Cancer Lett. 2013;332(2):286–94. 10.1016/j.canlet.2011.07.010. 21862212 10.1016/j.canlet.2011.07.010 22. Whitman SP, Civoli F, Daniel LW. Protein kinase CbetaII activation by 1-beta-D-arabinofuranosylcytosine is antagonistic to stimulation of apoptosis and Bcl-2alpha down-regulation. J Biol Chem. 1997;272(38):23481-4. 10.1074/jbc.272.38.23481. 10.1074/jbc.272.38.23481 9295281 23. Hendley AM, Ashe S, Urano A, Ng M, Phu TA, Peng XL, Luan C, Finger AM, Jang GH, Kerper NR, Berrios DI, Jin D, Lee J, Riahi IR, Gbenedio OM, Chung C, Roose JP, Yeh JJ, Gallinger S, Biankin AV, O’Kane GM, Ntranos V, Chang DK, Dawson DW, Kim GE, Weaver VM, Raffai RL, Hebrok M. [preprint]SMase2-mediated exosome secretion shapes the tumor microenvironment to immunologically support pancreatic cancer. BioRxiv. 2024 Sep 25:2024.09.23.614610. 10.1101/2024.09.23.614610. 24. Montfort A, Bertrand F, Rochotte J, Gilhodes J, Filleron T, Milhès J, Dufau C, Imbert C, Riond J, Tosolini M, Clarke CJ, Dufour F, Constantinescu AA, Junior NDF, Garcia V, Record M, Cordelier P, Brousset P, Rochaix P, et al. Neutral sphingomyelinase 2 heightens anti-melanoma immune responses and anti-PD-1 therapy efficacy. Cancer Immunol Res. 2021;9(5):568–582. 10.1158/2326-6066.CIR-20-0342. 10.1158/2326-6066.CIR-20-0342 PMC9631340 33727246 25. Yang X Gao L Zhang S Comparative pan-cancer DNA methylation analysis reveals cancer common and specific patterns Brief Bioinform 2016 10.1093/bib/bbw063 27436122 Yang X, Gao L, Zhang S. Comparative pan-cancer DNA methylation analysis reveals cancer common and specific patterns. Brief Bioinform. 2016. 10.1093/bib/bbw063. 27436122 10.1093/bib/bbw063 26. Ohaegbulam KC Assal A Lazar-Molnar E Yao Y Zang X Human cancer immunotherapy with antibodies to the PD-1 and PD-L1 pathway Trends Mol Med 2015 21 1 24 33 10.1016/j.molmed.2014.10.009 25440090 PMC4282825 Ohaegbulam KC, Assal A, Lazar-Molnar E, Yao Y, Zang X. Human cancer immunotherapy with antibodies to the PD-1 and PD-L1 pathway. Trends Mol Med. 2015;21(1):24–33. 10.1016/j.molmed.2014.10.009. 25440090 10.1016/j.molmed.2014.10.009 PMC4282825 27. Li R, Han D, Shi J, Han Y, Tan P, Zhang R, Li J. Choosing tumor mutational burden wisely for immunotherapy: a hard road to explore. Biochim Biophys Acta (BBA) Rev Cancer. 2020;1874(2):188420. 10.1016/j.bbcan.2020.188420. 10.1016/j.bbcan.2020.188420 32828886 28. Zhang Y Peng J Du H Zhang N Fang X Identification and validation of Immune- and Stemness-Related prognostic signature of melanoma Front Cell Dev Biology 2021 9 755284 10.3389/fcell.2021.755284 PMC8602573 34805163 Zhang Y, Peng J, Du H, Zhang N, Fang X. Identification and validation of Immune- and Stemness-Related prognostic signature of melanoma. Front Cell Dev Biology. 2021;9:755284. 10.3389/fcell.2021.755284. 10.3389/fcell.2021.755284 PMC8602573 34805163 29. Jin HR, Wang J, Wang ZJ et al. Lipid metabolic reprogramming in tumor microenvironment: from mechanisms to therapeutics. J Hematol Oncol. 2023;16(1):103. 10.1186/s13045-023-01498-2 10.1186/s13045-023-01498-2 PMC10498649 37700339 30. Alzahrani AM Rajendran P The multifarious link between cytochrome P450s and cancer Oxid Med Cell Longev 2020 2020 3028387 10.1155/2020/3028387 31998435 PMC6964729 Alzahrani AM, Rajendran P. The multifarious link between cytochrome P450s and cancer. Oxid Med Cell Longev. 2020;2020:3028387. 10.1155/2020/3028387. Published 2020 Jan 3. 31998435 10.1155/2020/3028387 PMC6964729 31. Lee PP Fitzpatrick DR Beard C Jessup HK Lehar S Makar KW Pérez-Melgosa M Sweetser MT Schlissel MS Nguyen S Cherry SR Tsai JH Tucker SM Weaver WM Kelso A Jaenisch R Wilson CB A critical role for Dnmt1 and DNA methylation in T cell development, function, and survival Immunity 2001 15 5 763 74 10.1016/S1074-7613(01)00227-8 11728338 Lee PP, Fitzpatrick DR, Beard C, Jessup HK, Lehar S, Makar KW, Pérez-Melgosa M, Sweetser MT, Schlissel MS, Nguyen S, Cherry SR, Tsai JH, Tucker SM, Weaver WM, Kelso A, Jaenisch R, Wilson CB. A critical role for Dnmt1 and DNA methylation in T cell development, function, and survival. Immunity. 2001;15(5):763–74. 10.1016/S1074-7613(01)00227-8. 11728338 10.1016/s1074-7613(01)00227-8 32. Zou W, Wolchok JD, Chen L. PD-L1 (B7-H1) and PD-1 pathway Blockade for cancer therapy: mechanisms, response biomarkers, and combinations. Sci Transl Med. 2016;8(328). 10.1126/scitranslmed.aad7118. 10.1126/scitranslmed.aad7118 PMC4859220 26936508 33. Rizvi NA, Hellmann MD, Snyder A, Kvistborg P, Makarov V, Havel JJ, Lee W, Yuan J, Wong P, Ho TS, Miller ML, Rekhtman N, Moreira AL, Ibrahim F, Bruggeman C, Gasmi B, Zappasodi R, Maeda Y, Sander C, et al. Mutational landscape determines sensitivity to PD-1 blockade in non–small cell lung cancer. Science. 2015;348(6230):124–128. 10.1126/science.aaa1348. 10.1126/science.aaa1348 PMC4993154 25765070 34. Thorsson V, Gibbs DL, Brown SD et al. The immune landscape of cancer [published correction appears in Immunity. 2019;51(2):411–412. 10.1016/j.immuni.201908.004]. Immunity. 2018;48(4):812–830.e14. https://doi.org/10.1016/j.immuni.2018.03.023. ",
  "metadata": {
    "Title of this paper": "A critical role for Dnmt1 and DNA methylation in T cell development, function, and survival",
    "Journal it was published in:": "Discover Oncology",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12480182/"
  }
}