{
  "title": "Paper_340",
  "abstract": "pmc Perm J 1290 permanentej tpj The Permanente Journal 1552-5767 1552-5775 Kaiser Permanente PMC12485245 PMC12485245.1 12485245 12485245 40566857 10.7812/TPP/25.041 TPJ-25-041 1 Original Research quality-improvement Quality improvement health-disparities Health disparities Chagas Disease in Northern California: Observed Prevalence, Clinical Characteristics, and Outcomes Within an Integrated Health Care Delivery System https://orcid.org/0000-0002-8231-3806 Hernandez Salvador MD  1  2 Srikanth Kishan K MD  3 https://orcid.org/0000-0003-0714-5176 Bommireddi Akshay MD, MBA  4 Leong Thomas K MPH  5 Miller David A MD  6 Ambrosy Andrew P MD  1  5 Zaroff Jonathan MD  1  1 Department of Cardiology, Kaiser Permanente San Francisco Medical Center San Francisco CA USA  2 Department of Cardiology, Kaiser Permanente Walnut Creek Medical Center Walnut Creek CA USA  3 Department of Internal Medicine, Kaiser Permanente San Francisco Medical Center San Francisco CA USA  4 Department of Internal Medicine, Kaiser Permanente Santa Clara Medical Center Santa Clara CA USA  5 Division of Research, Kaiser Permanente Northern California Oakland CA USA  6 Department of Infectious Disease, Kaiser Permanente San Rafael Medical Center San Rafael CA USA Salvador Hernandez, MD salvador.x.hernandez@kp.org 2025 26 6 2025 498051 40 48 26 06 2025 02 10 2025 03 10 2025 © 2025 The Authors. 2025 https://creativecommons.org/licenses/by-nc-nd/4.0/ Published by The Permanente Federation LLC under the terms of the CC BY-NC-ND 4.0 license https://creativecommons.org/licenses/by-nc-nd/4.0/ Abstract Introduction Chagas disease (CD) is caused by the protozoan parasite Trypanosoma cruzi Methods In this cohort study from 2006 to 2022, the authors identified patients with CD by screening the electronic medical record for International Classification of Diseases, 9th Revision and 10th Revision codes. The authors obtained demographic, medical history, electrocardiographic, echocardiographic, and pharmacy data. Adverse outcomes, including all-cause mortality, heart failure hospitalization, and heart transplantation, were identified by database programming and confirmed by manual chart review. Results There were 53 cases of CD in total, and 75% of patients self-identified as Hispanic. The mean age was 49 years old, and 45% were female. Dyslipidemia (45%) and hypertension (32%) were common comorbidities. A total of 7 patients (13%) had a left ventricular ejection fraction < 45%. During the follow-up period, adverse outcomes included 4 cardiovascular deaths, 5 heart failure hospitalizations, and 4 heart transplantations. The prevalence of diagnosed CD in the Kaiser Permanente Northern California population has risen from 0.22 per 100,000 persons from 2006 to 2010 to 0.70 per 100,000 persons from 2018 to 2022. Discussion The prevalence of diagnosed CD in Kaiser Permanente Northern California increased during the study period, and patients with CD frequently had poor cardiovascular outcomes, likely due to the patients presenting with advanced disease. Conclusion Systematic screening and awareness are likely to facilitate early diagnosis and improve treatment to avoid chronic complications of CD. Keywords Chagas disease Cardiovascular disease Cardiomyopathy pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement no pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes Introduction Chagas disease (CD) is caused by the protozoan parasite Trypanosoma cruzi  1  2 The majority of CD infections in the United States are chronic, and they are acquired while living in endemic areas of Latin America, where Chagas cardiomyopathy is a leading cause of heart failure.  1,3  3 When CD is detected prior to advanced end-organ damage, monitoring and treatment strategies can mitigate progression to severe disease.  4  5,6  7,8 In this retrospective cohort study, the authors aimed to describe the demographic and clinical characteristics of the population with CD within the Kaiser Permanente Northern California integrated health care system. Additionally, the authors looked to estimate the prevalence of diagnosed CD, identify the potential number of at-risk participants, and quantify the rates of adverse cardiovascular events. Methods The authors examined data from Kaiser Permanente Northern California , a large integrated health care delivery system with 21 hospitals and more than 260 freestanding clinics. Kaiser Permanente Northern California provides comprehensive care for approximately 4.5 million people across northern California, and its membership is highly representative of the local population with regard to age, sex, race and ethnicity, and socioeconomic status.  9 The authors assembled a cohort of all adult Kaiser Permanente Northern California members with a documented history of CD from January 1, 2006, to December 31, 2022, based on a CD diagnosis from International Classification of Diseases, 9th Revision and 10th Revision ( T cruzi T cruzi T cruzi T cruzi T cruzi Table 1 Table 1: Chagas testing methods by commercial laboratories and the Centers for Disease Control and Prevention Laboratory/organization Test Methodology Confirmatory testing ARUP Laboratory  T cruzi Semiquantitative ELISA CDC confirmatory testing Quest Diagnostics Chagas screening assay T cruzi ELISA CDC confirmatory testing Mayo Clinic  T cruzi T cruzi ELISA CDC confirmatory testing CDC Laboratory IgG serology testing TESA N/A ARUP, Associated Regional and University Pathologists; CDC, Centers for Disease Control and Prevention; ELISA, enzyme-linked immunosorbent assay; IgG, immunoglobulin G; N/A, not applicable; T cruzi Trypanosoma cruzi The study’s inclusion criteria were age > 18 years on the index date (date of CD diagnosis), Kaiser Permanente Northern California membership preceding the index date, and at least 6 months of membership after the index date. Patients were censored from the follow-up analysis if they ended Kaiser Permanente Northern California membership, died, or reached the end of the study period on December 31, 2022. This exclusion was due to the lack of comprehensive clinical data for these individuals, which limited the ability to fully assess their clinical course and outcomes. The process of patient selection into the cohort and follow-up is summarized in Figure 1 Figure 1: Flow diagram illustrating the patient selection process for the Kaiser Permanente Northern California Chagas analytic cohort. T cruzi Trypanosoma cruzi The authors reported baseline demographic and clinical characteristics using research databases and manual chart review. The data included medical history, vital signs, laboratory results, electrocardiographic (ECG) data, echocardiographic data, and CD-specific therapies, including the antiparasitic drugs benznidazole and nifurtimox that are approved by the US Food and Drug Administration. Observed prevalence referred to the proportion of confirmed CD cases identified within the Kaiser Permanente Northern California membership during the study period. This metric represented the cases diagnosed through clinical suspicion, incidental detection, or laboratory testing. This differed from true prevalence, which would require population-wide screening of all at-risk individuals. Throughout this manuscript, the authors will refer to observed prevalence to clarify this distinction. The observed population prevalence of CD was quantified as the number of CD cases per 100,000 patients in the population within each calendar year. Due to the overall low observed prevalence of CD, the authors dichotomized temporal trends, comparing observed prevalence at the beginning (2006–2010) vs the end (2018–2022) of the study timeline. The authors captured the following outcomes of interest during follow-up: all-cause mortality, heart failure hospitalization, ischemic stroke, cardiac arrest or sustained ventricular arrhythmia, implantation of a pacemaker or implantable cardioverter-defibrillator, and heart transplantation. All-cause mortality was identified using Kaiser Permanente Northern California administrative records, Social Security vital status data, and the state of California death registry. The other outcomes were identified using validated ICD-9 and ICD-10 codes and Current Procedural Terminology procedure codes.  10 Results The study cohort included 53 confirmed CD cases. During the study timeline, the observed population prevalence of CD rose from 0.22 cases per 100,000 members between 2006 and 2010 to 0.70 cases per 100,000 members between 2018 and 2022. Over this time, the proportion of Kaiser Permanente Northern California members who self-identified as Hispanic also increased, from 19.2% between 2006 and 2010, to 22% between 2018 and 2022. Diagnostically, 21 of the 53 patients were discovered to have CD incidentally through blood donation screening. A total of 9 patients had been tested abroad, 5 patients were tested due to a positive family history, 6 patients were tested by Kaiser Permanente Northern California cardiology due to high clinical suspicion, and 1 patient with HIV was tested due to a brain lesion biopsy. Data on diagnostic circumstances were unavailable for the remaining 11 patients. Figure 2 Figure 2: Map of Kaiser Permanente locations where Chagas disease cases were detected. Demographic and clinical data are shown in Table 2 Table 2: Demographic and clinical characteristics of the population with Chagas disease Demographic characteristics Overall N = 53 Age, y, mean (SD) 49.1 (13.5) Age category, y, n (%)  18–30 4 (7.5) 31–40 13 (24.5) 41–50 13 (24.5) 51–60 11 (20.8) 61–70 11 (20.8) 71 and above 1 (1.9) Sex, n (%)  Female 24 (45.3) Male 29 (54.7) Race and ethnicity, n (%)  White 8 (15.1) Black 0 (0.0) Hispanic 40 (75.5) Asian/Pacific Islander 2 (3.8) Other/Unknown 3 (5.7) Country of origin, n (%)  Bolivia 6 (11.3) Brazil 2 (3.8) Myanmar 1 (1.9) China 1 (1.9) Costa Rica 1 (1.9) El Salvador 14 (26.4) Mexico 12 (22.6) United Kingdom 1 (1.9) United States 3 (5.7) Other 1 (1.9) Unknown 11 (20.8) Low educational attainment, n (%)  No 33 (62.3) Yes 4 (7.5) Unknown 16 (30.2) Low median household income, n (%)  No 37 (69.8) Yes 0 (0.0) Unknown 16 (30.2)  Medical history, n (%  Atrial fibrillation or flutter 7 (13.2) Ischemic stroke or TIA 3 (5.7) Acute myocardial infarction 2 (3.8) Coronary artery bypass graft 0 (0.0) Percutaneous coronary intervention 1 (1.9) Heart failure 8 (15.1) Mitral or aortic valvular disease 4 (7.5) Peripheral artery disease 0 (0.0) Hyperthyroidism 1 (1.9) Hypothyroidism 8 (15.1) Chronic liver disease 1 (1.9) Chronic lung disease 7 (13.2) Diagnosed dementia 8 (15.1) Diagnosed depression 0 (0.0) Hypertension 17 (32.1) Dyslipidemia 24 (45.3) Diabetes mellitus 7 (13.2) Hospitalized bleeding 3 (5.7)  Baseline medication, n (%  ACE inhibitor 10 (18.9) Angiotensin II receptor blocker 7 (13.2) Beta blocker 15 (28.3) Calcium channel blocker 3 (5.7) Diuretic 10 (18.9) Aldosterone receptor antagonist 5 (9.4) Alpha blocker 0 (0.0) Statin 15 (28.3) Other lipid-lowering agent 1 (1.9) Nonaspirin antiplatelet agent 2 (3.8) Anticoagulant 6 (11.3) Diabetic therapy 5 (9.4) Nonsteroidal anti-inflammatory drug 5 (9.4)  Vital signs  Tobacco use, n (%)  Any smoker 15 (28.3) Nonsmoker 38 (71.7) Systolic blood pressure, mmHg  Mean (SD) 118.5 (19.4) Missing, n (%) 3 (5.7) Diastolic blood pressure, mmHg  Mean (SD) 69.2 (10.6) Missing, n (%) 3 (5.7) Body mass index, kg/m 2  Mean (SD) 29.2 (4.9) Missing, n (%) 4 (7.5)  Laboratory results  High density lipoprotein, mg/dL, n (%)  ≥ 60 6 (11.3) 50–59 12 (22.6) 40–49 7 (13.2) 35–39 6 (11.3) < 35 2 (3.8) Unknown 20 (37.7) Low density lipoprotein, mg/dL, n (%)  ≥ 200 0 (0.0) 160–199 1 (1.9) 130–159 5 (9.4) 100–129 14 (26.4) 70–99 10 (18.9) < 70 4 (7.5) Unknown 19 (35.8) ACE, angiotensin-converting-enzyme; SD, standard deviation; TIA, transient ischemic attack. Of the 53 patients in the cohort, 40 patients did not have endpoints and were classified in the chronic indeterminate phase as defined by positive serology for T cruzi A total of 13 of the 53 patients who were positive for CD met criteria for CD with organ involvement. Of these patients, 12 patients had cardiac involvement and 1 patient had central nervous system involvement. The Rassi score, a prognostic tool for predicting mortality in chronic Chagasic cardiomyopathy, was utilized to assess their long-term prognosis. This score estimated the 10-year mortality risk based on various clinical factors. At the time of diagnosis, 12 of the patients with organ involvement were classified into the Rassi score categories associated with severe disease with high mortality risk. This indicated a projected mortality rate of 84% over the next 10 years.  3 The review of echocardiographic data showed that 7 patients (13%) had a left ventricular ejection fraction < 45%, 2 of whom had apical aneurysm formation. The review of ECG data showed that conduction abnormalities were present in only a small number of patients. These included right bundle branch block (17%), left bundle branch block (4%), left anterior fascicular block (6%), and bifascicular block (right bundle branch block + left anterior fascicular block, 11%). The chart review confirmed adverse outcomes (AO) included 4 cardiovascular deaths, 5 heart failure hospitalizations, 2 ischemic strokes, 4 heart transplantations, 11 sustained ventricular arrhythmia events, and 7 implantable cardioverter-defibrillators. A total of 8 patients had 2 or more AO. Discussion To the knowledge of the authors, this is the first review of CD cases over time within an integrated health care system in northern California. Data on the prevalence of CD in northern California are limited, and the condition is likely underdiagnosed. CD can remain subclinical for extended periods but can lead to severe AO. In this study, the authors described the clinical characteristics and burden of CD within Kaiser Permanente Northern California during a period without a systematic screening program. During the final years of the study, the observed prevalence of CD was 0.70 cases per 100,000 individuals, with most patients self-identifying as Hispanic. The primary countries of origin for these patients were Mexico, El Salvador, and Bolivia, aligning with the demographic findings of other prevalence studies in the United States.  11,12  2,13  10,11,14,15  16 At the snapshot of this analysis, based on the available data, the authors did not believe that any of the patients in the indeterminate phase progressed to the determinate phase of CD. However, the authors could not definitively state that progression did not occur beyond the study period, as follow-up data were limited. Additionally, none of the cases identified in this study were considered to be locally acquired T cruzi Additionally, although most CD cases in the United States are considered to be imported from highly endemic regions, 78 autochthonous infections were reported between 1950 and 2022.  8  2 T cruzi  10 Studies have also shown that advanced Chagas cardiomyopathy is associated with a substantially higher chance of all-cause mortality, heart transplantation, and heart failure–related hospitalizations.  15  17 The chronic complications from CD include cardiomyopathy and heart transplants, which are expensive due to medications, procedures, follow-up visits, and multiple hospitalizations. Early detection and treatment programs could help decrease the economic impact of these cases. Studies have indicated that the economic burden of CD is comparable to or greater than that of other conditions, such as cervical cancer and Lyme disease.  18  14 This study provided evidence that CD continues to be present and underdiagnosed in northern California and that, without proactive screening strategies, there will be unmitigated progression to severe complications. Ideally, early screening for CD should be initiated at the first contact of at-risk patients with a medical system. This could potentially be in the primary care setting through a systematic approach including early diagnosis and treatment. When chronic complications are identified, a multidisciplinary approach is optimal, possibly involving gastroenterologists, cardiologists, infectious diseases specialists, pediatricians, and obstetricians. The strengths of the study included access to comprehensive records from an integrated health system, dual screening sources (laboratory and ICD codes), and practitioner confirmation of the CD diagnosis and AO in all cases. This descriptive study also had several limitations. The retrospective design and absence of proactive screening lacked power to determine true prevalence. Additionally, in the Kaiser Permanente Northern California system, ethnicity and country of origin are self-reported, leading to gaps in the data. Prior medical records for patients diagnosed with and treated for CD in other countries were also unavailable to the study investigators. Additionally, a limitation of this study was that the authors did not investigate whether the cases identified among patients residing in the United States were locally acquired through autochthonous transmission. As a result, the authors could not determine if these cases were contracted through local vector-borne transmission within the United States. Despite these limitations, this study should heighten awareness about the need for CD screening. It should also reinforce the importance of considering CD in the workup for cardiomyopathy in northern California, especially with a large and growing Hispanic population. Conclusion CD cases in Kaiser Permanente Northern California have been increasingly identified since 2006, yet there likely remains a great deal of undiagnosed illness, and the disease is often diagnosed at advanced stages, leading to severe cardiovascular complications. Priority actions needed are  1  2  3 Acknowledgments The authors acknowledge the contribution of patients whose electronic health record data supported this study. The first author also recognizes the mentorship of Dr Sheba K Meymandi, an enduring advocate for individuals affected by Chagas disease. Author Contributions: Conflicts of Interest: Funding: Data-Sharing Statement: References 1. Manne-Goehler J Umeh CA Montgomery SP Wirtz VJ Estimating the burden of Chagas disease in the United States PLOS Negl Trop Dis 2016 10 11 e0005033 10.1371/journal.pntd.0005033 27820837 PMC5098725 2. 2020 Census Profile California 2020 Accessed 10 June 2025 https://naleo.org/wp-content/uploads/2021/12/2020-Census-Profiles-CA.pdf 3. Rassi A Rassi A Marin-Neto JA Chagas disease Lancet 2010 375 9723 1388 1402 10.1016/S0140-6736(10)60061-X 20399979 4. Cardoso CS Ribeiro ALP Oliveira CDL et al. Beneficial effects of benznidazole in Chagas disease: NIH SaMi-Trop cohort study PLOS Negl Trop Dis 2018 12 11 e0006814 10.1371/journal.pntd.0006814 30383777 PMC6211620 5. Pearlman JD Chagas’ disease in northern California: No longer an endemic diagnosis Am J Med 1983 75 6 1057 1060 10.1016/0002-9343(83)90888-4 6650538 6. Requena-Méndez A Bussion S Aldasoro E et al. Cost-effectiveness of Chagas disease screening in Latin American migrants at primary health-care centres in Europe: A Markov model analysis Lancet Glob Health 2017 5 4 e439 e447 10.1016/S2214-109X(17)30073-6 28256340 7. Shender LA Lewis MD Rejmanek D Mazet JAK Molecular diversity of Trypanosoma cruzi detected in the vector triatoma protracta from California, USA PLOS Negl Trop Dis 2016 10 1 e0004291 10.1371/journal.pntd.0004291 26797311 PMC4721664 8. Valdez-Tah A Ibarra-Cerdeña CN Call to action: A literature review of Chagas disease risk in California 1916-2018 PLOS Negl Trop Dis 2021 15 2 e0009035 10.1371/journal.pntd.0009035 33630839 PMC7906329 9. Velasco M Gimeno-Feliú LA Molina I et al. Screening for Trypanosoma cruzi infection in immigrants and refugees: Systematic review and recommendations from the Spanish society of infectious diseases and clinical microbiology Euro Surveill 2020 25 8 1900393 10.2807/1560-7917.ES.2020.25.8.1900393 32127121 PMC7055039 10. Forsyth CJ Manne-Goehler J Bern C et al. Recommendations for screening and diagnosis of Chagas disease in the United States J Infect Dis 2022 225 9 1601 1610 10.1093/infdis/jiab513 34623435 PMC9071346 11. Meymandi SK Forsyth CJ Soverow J et al. Prevalence of Chagas disease in the Latin American-born population of Los Angeles Clin Infect Dis 2017 64 9 1182 1188 10.1093/cid/cix064 28329123 PMC5399937 12. Irish A Whitman JD Clark EH Marcus R Bern C Updated estimates and mapping for prevalence of Chagas disease among adults, United States Emerg Infect Dis 2022 28 7 1313 1320 10.3201/eid2807.212221 13. Davis AC Voelkel JL Remmers CL Adams JL McGlynn EA Comparing Kaiser Permanente members to the general population: Implications for generalizability of research Perm J 2023 27 2 87 98 10.7812/TPP/22.172 37170584 PMC10266863 14. Traina MI Sanchez DR Hernandez S et al. Prevalence and impact of Chagas disease among Latin American immigrants with nonischemic cardiomyopathy in Los Angeles, California Circ Heart Fail 2015 8 5 938 943 10.1161/CIRCHEARTFAILURE.115.002229 26206855 PMC10108371 15. Hernandez S Flores CA Viana GM Sanchez DR Traina MI Meymandi SK Autochthonous transmission of Trypanosoma cruzi in southern California Open Forum Infect Dis 2016 3 4 ofw227 10.1093/ofid/ofw227 28018928 PMC5170498 16. Custer B Agapova M Bruhn R et al. Epidemiologic and laboratory findings from 3 years of testing United States blood donors for Trypanosoma cruzi . Transfusion 2012 52 9 1901 1911 10.1111/j.1537-2995.2012.03569.x 22339233 17. Organization PAH. Chagas Disease 2020 Accessed 17 March 2025 https://www.paho.org/en/topics/chagas-disease 18. Lee BY Bacon KM Bottazzi ME Hotez PJ Global economic burden of Chagas disease: A computational simulation model Lancet Infect Dis 2013 13 4 342 348 10.1016/S1473-3099(13)70002-1 23395248 PMC3763184 ",
  "metadata": {
    "Title of this paper": "Global economic burden of Chagas disease: A computational simulation model",
    "Journal it was published in:": "The Permanente Journal",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12485245/"
  }
}