{
  "title": "Paper_1142",
  "abstract": "pmc J Surg Case Rep J Surg Case Rep 2009 jscr jscr Journal of Surgical Case Reports 2042-8812 Oxford University Press PMC12476091 PMC12476091.1 12476091 12476091 41018920 10.1093/jscr/rjaf764 rjaf764 1 Case Report AcademicSubjects/MED00910 jscrep/0130 Optimizing sentinel lymph node detection in melanoma: the value of dual tracer techniques in unpredictable drainage patterns https://orcid.org/0009-0007-1987-2465 Shahid Sehar  Department of General Surgery, Mildura Base Public Hospital Mildura, VIC 3500 Australia Galketiya Kuda  Department of General Surgery, Mildura Base Public Hospital Mildura, VIC 3500 Australia Corresponding author. Department of General Surgery Mildura Base Public Hospital, Mildura VIC 3500, Australia. E-mail: sshahid@mbph.org.au 9 2025 26 9 2025 2025 9 496005 rjaf764 20 7 2025 05 9 2025 26 09 2025 28 09 2025 29 09 2025 © The Author(s) 2025. Published by Oxford University Press and JSCR Publishing Ltd. 2025 https://creativecommons.org/licenses/by-nc/4.0/ This is an Open Access article distributed under the terms of the Creative Commons Attribution Non-Commercial License ( https://creativecommons.org/licenses/by-nc/4.0/ Abstract Sentinel lymph node biopsy plays a vital role in staging and treatment planning for patients with melanoma. We describe the case of a 54-year-old man with a primary melanoma on the lower back, where preoperative lymphoscintigraphy revealed drainage to both the expected inguinal region and the axilla. This case illustrates the practical value of using both blue dye and scintigraphy to guide sentinel node identification, especially when lymphatic drainage patterns are less predictable. melanoma sentinel lymph node biopsy blue dye lymphoscintigraphy dual drainage regional surgery pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement no pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes Introduction Melanoma is an aggressive skin cancer with a high potential for lymphatic spread. Sentinel lymph node biopsy (SLNB) provides crucial prognostic information and guides decisions about further management. Typically, SLNB is considered when the Breslow thickness exceeds 1 mm. The most used methods for identifying sentinel nodes include blue dye and radiotracer (scintigraphy). While either method can be used alone, combining both increases detection sensitivity and reduces the risk of missing involved nodes. One key advantage of scintigraphy is its ability to detect drainage pathways that may not align with what would be expected from the tumors’ location. Case report A 54-year-old man presented with a pigmented lesion on his right lower back that had gradually increased in size. Excision biopsy confirmed malignant melanoma with a Breslow thickness of 2.1 mm and a close peripheral margin of 0.5 mm. At a multidisciplinary oncology meeting, a decision was made to proceed with a wide local excision and SLNB. Preoperative lymphoscintigraphy was performed to detect the sentinel lymph node ( Fig. 1 Fig. 2 Fig. 3 Fig. 4 Figure 1 Lymphoscintigraphy showing drainage from the right lower back lesion. Figure 2 Expected drainage path toward the right inguinal lymph nodes. Figure 3 Unexpected drainage visualized toward the right axillary lymph nodes. Figure 4 Intraoperative gamma probe confirming dual drainage to axillary and inguinal regions. Histology showed no residual malignancy in the re-excision specimen. The right axillary node showed involvement by metastatic melanoma, while the groin lymph node was negative. A decision for adjuvant therapy with BRAF (B-Raf proto-oncogene, serine/threonine kinase involved in the MAPK/ERK pathway and frequently mutated in melanoma)/MEK (mitogenactivated protein kinase kinase, a downstream target in the MAPK/ERK pathway) inhibitors was made following discussion at multidisciplinary meeting. Discussion SLNB is used in melanoma staging in selected patients depending on factors including Breslow thickness. Sentinel lymph node metastasis is a key prognostic factor and influences adjuvant therapy decisions [ 1 2 3 Sentinel node identification typically involves peritumoral injection of blue dye and radioisotopes. Most studies indicate that using both techniques increases sensitivity and specificity [ 4 5 Scintigraphy provides a clear advantage by detecting sentinel nodes outside of expected drainage pathways. There are reported cases in breast cancer where sentinel nodes were identified in the ipsilateral axilla despite previous surgeries [ 6 7 In our patient, the groin was the expected site of drainage. However, scintigraphy demonstrated dual drainage, and the axillary node was found to be involved. Although newer agents like indocyanine green (ICG) are being studied for SLNB, they are not yet widely available, especially in regional settings. Blue dye remains a practical and accessible tool that still holds value in combination with scintigraphy. Trials support ICG use, but accessibility remains a limiting factor [ 8 This case reinforces the importance of not assuming drainage patterns based on tumor location alone. SLNB relies on anatomy, sound surgical technique, and the coordinated effort of a multidisciplinary team. Conclusion Scintigraphy plays a critical role in identifying sentinel nodes in atypical drainage patterns. When combined with blue dye, it enhances the accuracy of staging and guides appropriate treatment [ 9 Conflict of interest statement None declared. Funding None declared. Patient consent Written informed consent was obtained from the patient for publication of this case report and accompanying images. References 1. Amersi F Morton DL The role of sentinel lymph node biopsy in the management of melanoma Adv Surg 2007 41 241 56 10.1016/j.yasu.2007.05.015 17972569 PMC2171363 2. Dogan NU Dogan S Favero G et al. The basics of sentinel lymph node biopsy: anatomical and pathophysiological considerations and clinical aspects J Surg Oncol 2020 121 449 57 10.1002/jso.25995 PMC6699370 31467535 3. Wong SL Faries MB Kennedy EB et al. Sentinel lymph node biopsy and management of regional lymph nodes in melanoma: American Society of Clinical Oncology and Society of Surgical Oncology Clinical practice guideline update J Clin Oncol 2018 36 399 413 10.1200/JCO.2017.75.7724 29232171 4. Alazraki N Glass EC Castronovo F et al. Procedure guideline for lymphoscintigraphy and the use of intraoperative gamma probe for sentinel lymph node localization in melanoma of intermediate thickness 1.0 J Nucl Med 2002 43 1414 8 12368382 5. Quartuccio N Siracusa M Pappalardo M et al. Sentinel node identification in melanoma: current clinical impact, new emerging SPECT radiotracers and technological advancements. An update of the last decade Curr Radiopharm 2020 13 32 41 10.2174/1874471012666191015100837 31749441 PMC7509753 6. Ahmed M Baker R Rubio IT Meta-analysis of aberrant lymphatic drainage in recurrent breast cancer Br J Surg 2016 103 1579 88 10.1002/bjs.10289 27598038 7. Lizarraga IM Scott-Conner CEH Muzahir S et al. Management of contralateral axillary sentinel lymph nodes detected on lymphoscintigraphy for breast cancer Ann Surg Oncol 2013 20 3317 22 10.1245/s10434-013-3151-y 23975295 8. Stoffels I Dissemond J Pöppel T et al. Intraoperative fluorescence imaging for sentinel lymph node detection: prospective clinical trial to compare the usefulness of indocyanine green vs technetium Tc 99m for identification of sentinel lymph nodes JAMA Surg 2015 150 617 23 10.1001/jamasurg.2014.3502 26017057 9. Dumitra T Faries MB Melanoma sentinel lymph node biopsy in the modern era Surg Oncol 2024 57 102162 10.1016/j.suronc.2024.102162 39556928 ",
  "metadata": {
    "Title of this paper": "Melanoma sentinel lymph node biopsy in the modern era",
    "Journal it was published in:": "Journal of Surgical Case Reports",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12476091/"
  }
}