{
  "title": "Paper_161",
  "abstract": "pmc Gynecol Oncol Rep Gynecol Oncol Rep 2729 gore Gynecologic Oncology Reports 2352-5789 Elsevier PMC12495285 PMC12495285.1 12495285 12495285 10.1016/j.gore.2025.101953 S2352-5789(25)00178-X 101953 1 Research Report Cervical HPV 18 detection is associated with high-grade cervical dysplasia in Kenyan and Ugandan women living with HIV Nakalembe Miriam a Mpamani Collins a Namugga Jane a Nakisige Carolyn a Banturaki Grace a Tonui Phillip b Itsura Peter b Orang’o Omenge c Muthoka Kapten d Ngeresa Anthony d Musick Beverly e Ermel Aaron f Loehrer Patrick f h Brown Darron R. f g h Tong Yan tongy@iu.edu e h ⁎ a b c d e f g h ⁎ th tongy@iu.edu 10 2025 19 9 2025 61 495222 101953 30 6 2025 3 9 2025 7 9 2025 19 09 2025 05 10 2025 05 10 2025 © 2025 The Author(s) 2025 https://creativecommons.org/licenses/by-nc-nd/4.0/ This is an open access article under the CC BY-NC-ND license (http://creativecommons.org/licenses/by-nc-nd/4.0/). Highlights • Cervical biopsy was performed twice on 114 Kenyan and Ugandan women living with HIV and receiving ART. • CIN2/3 was present in 11.4% of these women. • HPV 18 detection in cervical swabs was strongly associated with CIN2/3. • CD4 count, HIV viral load measurements, and plasma aflatoxin detections were not associated with CIN2/3. Objectives Cervical cancer, caused by “high-risk” (HR) HPV, is the most common malignancy and the leading cause of cancer deaths among women living in Kenya and Uganda. Women living with HIV (WLWH) are at a high risk for HR-HPV infection. This longitudinal, observational cohort analysis was conducted to identify factors that are important among WLWH in prediction of cervical intraepithelial neoplasia grades 2 or 3 (CIN2/3). Methods Data of this analysis was based on a study of HPV natural history and cervical cancer among Kenyan and Ugandan WLWH. Demographic, behavioral and biological data were collected; HR-HPV DNA testing of cervical swabs was performed (Roche Cobas Assay); all WLWH underwent cervical biopsy on two occasions. Results Of 114 WLWH enrolled, the median age was 38.2 years. All WLWH were receiving ART during the study. CIN2/3 was found in 13 (11.4 %) WLWH; HPV 16 was detected in 10 (8.8 %); HPV 18 in 11 (9.6 %), and Non-16/18 HR-HPV in 62 (54.4 %). Aflatoxin exposure was not associated with CIN2/3 in this analysis. A multivariable logistic regression found that cervical detection of HPV 18 was significantly associated with CIN2/3 (OR = 6.36, 95 % CI = 1.36–29.75, p = 0.019), after adjusting for the effects of HIV viral load, CD4 counts, and Non-16/18 HR-HPV detection. Conclusions CIN2/3 was detected in 11.4% of WLWH; HPV 18 detection in cervical swabs was strongly associated with CIN2/3. Larger studies among WLWH are needed to determine optimal approaches for screening and treatment to prevent cervical cancer. Keywords HPV 18 Cervical intraepithelial neoplasia Kenyan women Ugandan women Women living with HIV pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement no pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes 1 Introduction Cervical cancer is the most common malignancy and the leading cause of cancer deaths among women living in sub-Saharan Africa. The countries of Kenya and Uganda contribute to the high burden of cervical cancer with incident rates of 56.2 and 40.1 cases per 100,000 per year, respectively ( Sung, 2021 Walboomers et al., 1999 Wei et al., 2024 Blossom et al., 2007 de Sanjose et al., 2007 Nakigozi et al., 2024 Kobayashi et al., 2024 Kobayashi et al., 2024 Ermel et al., 2019 Castle et al., 2021 2 Methods 2.2 Study design This observational cohort study was conducted on data collected from a longitudinal three-year study that began in November of 2020 to evaluate the natural history of HPV infections and cervical cancer among WLWH in Eastern Africa ( Tong et al., 2022 2.3 Study participants For the overall study, Kenyan and Ugandan women were invited to enroll in a three-year longitudinal study at two sites: the CCSP at MTRH in Kenya, and the UCI Clinic in Uganda. Kenyan women living in or within 30 km of Eldoret who present for cervical cancer screening at the CCRP, and Ugandan women living within 30 km of Mulago who present for cervical cancer screening at the UCI/IDI clinic were asked to participate in the study if they were between the ages of 21 and 60 years, and were willing to return for four total visits over a three-year total period. Additional inclusion criteria included no prior hysterectomy, no history of invasive cervical cancer, and the ability to understand and provide written, informed consent to participate in the study. Exclusion criteria included current pregnancy, inability to consent due to mental or physical disability, a condition that rendered the person unable to attend annual visits, and inability to fully visualize the squamo-columnar junction of the cervix during the VIA examination. Details of social sexual history were captured in questionnaires. In the overall project, a balanced cohort of women was recruited: 1:1 ratio of enrollment in Kenya vs. Uganda, and 1:1 ratio of WLWH and a control group of women not living with HIV, as previously described ( Tong et al., 2022 2.4 Interview and sample collection A structured face-to-face interview was conducted at each study visit with trained research assistants to capture participants’ medical, social, behavioral, and biological information. Blood samples were collected at the Enrollment, Month 12, and Month 24 visits for CD4 cell counts and HIV viral load assessments. For each participant, a portion of the blood sample obtained at the Month 12 visit was processed as plasma then sent to Johns Hopkins University (Baltimore, Maryland, U.S.A.) for assessment of aflatoxin (AFB 1 Tong et al., 2023 2.5 HPV testing A cervical swab for HPV testing was collected from all WLWH by a nurse or physician at the Enrollment, Month 12, and Month 24 visits. Swabs were placed in standard transport media and frozen at −20 °C, then delivered at room temperature to the Lancet Laboratory in Nairobi or the UCI Laboratory in Kampala. HR-HPV DNA testing was conducted using the Roche Cobas Assay (Roche Diagnostics, Alameda, CA). This assay provides detection of 14 HR-HPV types, including (HPV 16, 18, 31, 33, 35, 39, 45, 51, 52, 56, 58, 59, 66 and 68), described as “Any HR-HPV type” in this report. In addition, the assay provides specific detection of HPV 16 and HPV 18, and detection of 12 additional oncogenic types (HPV 31, 33, 35, 39, 45, 51, 52, 56, 58, 59, 66 and 68) as a group, (described in this report as “Non-16/18 HR-HPV”). HPV DNA test results were not used to triage women for VIA, and all women underwent VIA, since this is the current standard of care in sub-Saharan Africa; treatment was based on VIA results. 2.6 Quantification of HIV viral load, CD4 cell count HIV RNA viral load (HIV VL) was determined in serum specimens using the Abbott Real Time HIV-1 Assay (Kenya) or the Roche COBAS AmpliPrep/COBAS TaqMan HIV-1 Test (Uganda). These assays have a limit of detection of 40 copies/mL (Kenya) and 20 copies/mL (Uganda), and specimens below these limits were considered “undetectable”. CD4 cell counts were determined by flow cytometry and is reported as CD4 cells/µL ( Tong et al., 2023 2.7 Gynecological examination and cervical biopsy A gynecological examination was performed on all participants at each annual visit. All WHLH underwent VIA. All WLWH underwent colposcopic examination and cervical biopsy (two sites, generally at 6 and 12o’clock) at the Enrollment and Month 24 visits, regardless of VIA results. Cervical biopsy was performed at the month 12 visit if a suspicious lesion was identified on VIA examination. Biopsy specimens were placed in labelled tubes containing buffered formalin and transported to the pathology laboratory for paraffin embedding, preparation of sections, staining, and pathological assessment. All women were treated according to local standards, including loop electro-excisional procedure (LEEP) for a diagnosis of CIN2 or CIN3. 2.8 Statistical analysis Demographic and behavioral characteristics of WLWH were assessed at each annual visit, included age, marital status, years of education completed, homeownership, travel time to healthcare center, number of lifetime sex partners, and age of sexual debut. Aflatoxin variables included detectable plasma AFB 1 1 HIV-associated factors included receiving ART (yes vs. no), CD4 cell count (cells/uL), detectable HIV VL (yes vs. no) and HIV VL (copies/mL). For statistical analysis, those serum specimens with an undetectable HIV VL were assigned a value of 0 copies/mL. These variables were calculated as composite values from the Enrollment, Month 12 and Month 24 measurements. CD4 cell counts, and HIV viral load measurements were calculated as the mean of the three measurements (Enrollment, Month 12 and Month 24) HIV viral load was counted as “detectable” if a participant’s HIV VL was detected in any of the three measurements. HPV factors included detection of HPV 16, HPV 18, Non-16/18 HR-HPV, or Any HR-HPV, as well as persistent detection of HPV 16 or HPV 18. Detection of a type-specific HPV or an HPV combination was calculated as detection of the type-specific HPV or HPV group in any of the Enrollment, Month 12 or Month 24 measurements. Detection of persistent HPV 16 or HPV 18 was calculated as detection of the type-specific HPV in at least two of the three time points: Enrollment, Month 12 or Month 24. Biopsy-proven CIN2/3 was defined as having either CIN2 or CIN3 detected in a participant’s cervical biopsy specimens acquired either the Enrollment or Month 24 visit; the highest grade of dysplasia was used in the statistical analysis. Demographic and behavioral characteristics, plasma AFB 1 3 Results 3.1 Demographic and behavioral characteristics of WLWH A total of 120 WLWH met the study inclusion criteria and were enrolled. Of these, 114 WLWH (54 Kenyan and 60 Ugandan) completed the Enrollment, Month 12, and Month 24 visits. Demographic and behavioral data collected at the Enrollment visit are presented in Table 1 Table 1 Demographic and behavioral characteristics, plasma aflatoxin, HIV-associated factors, and HPV detection and persistence among 114 Kenyan and Ugandan WLWH. Variable a OverallN = 114 Country p-value KenyaN = 54 UgandaN = 60 Age (years), median (IQR) 38.2 (32.4, 42.7) 40.2 (36.7, 44.6) 35.2 (31.0, 40.0) 0.002 f Years of education, median (IQR) 9.0 (7.0, 12.0) 10.0 (8.0, 12.0) 9.0 (6.0, 11.0) 0.179 f Married or living with a partner, n (%) 46 (40.4 %) 15 (27.8 %) 31 (51.7 %) 0.009 g Home ownership, n (%) 28 (24.6 %) 15 (27.8 %) 13 (21.7 %) 0.449 g Travel to health clinic > 30 min, n (%) 51 (44.7 %) 18 (33.3 %) 33 (55.0 %) 0.020 g Life-time sex partners, median (IQR) 4.0 (3.0, 5.0) 4.0 (3.0, 5.0) 3.5 (2.5, 5.0) 0.945 h Age of sex debut, median (IQR) 17.0 (15.0, 19.0) 18.0 (16.0, 19.0) 17.0 (15.0, 19.0) 0.727 f Detectable plasma aflatoxin, n (%) 82 (71.9 %) 22 (40.7 %) 60 (100.0 %) 0<.001 g Aflatoxin concentration pg/µL, (mean, range) 0.652 (0.000, 8.601) 0.037 (0.000, 0.433) 1.205 (0.104, 8.601) 0<.001 h Receiving ART b 114 (100.0 %) 54 (100.0 %) 60 (100.0 %) −- CD4 cell count (cells/uL), (median, IQR) 752.5 (600.0, 985.7) 697.0 (531.3, 891.3) 821.3 (605.3, 1018.0) 0.118 f Detectable HIV viral load, n (%) 26 (22.8 %) 13 (24.1 %) 13 (21.7 %) 0.760 g HIV viral load (copies/mL), (mean, range) 2671.7 (0.0, 136456.0) 5220.6 (0.0, 136456.0) 377.8 (0.0, 11484.3) 0.497 h HPV 16, n (%) 10 (8.8 %) 4 (7.4 %) 6 (10.0 %) 0.746 i HPV 18, n (%) 11 (9.6 %) 7 (13.0 %) 4 (6.7 %) 0.256 g Non-16/18 HR-HPV c 62 (54.4 %) 27 (50.0 %) 35 (58.3 %) 0.372 g Any HR-HPV d 65 (57.0 %) 28 (51.9 %) 37 (61.7 %) 0.291 g Persistent HPV 16 e 2 (1.8 %) 0 2 (3.3 %) 0.497 i Persistent HPV 18 e 6 (5.3 %) 4 (7.4 %) 2 (3.3 %) 0.420 i a Age, education, marital status, home ownership, travel time to health clinic, life-time sex partners, and age of sex debut were measured at the Enrollment visit; plasma aflatoxin was measured at the Month 12; HIV-associated factors were composite values over the Enrollment, Month 12 and Month 24 measures; HPV detection and persistence were composite values over the Enrollment, Month 12 and Month 24 measures. b Receiving ART: receiving ART at Enrollment, Month 12, or Month 24. c Non-16/18 HR-HPV: detection of HPV 31, 33, 35, 39, 45, 51, 52, 56, 58, 59, 66 or 68 at Enrollment, Month 12, or Month 24. d Any HR-HPV: detection of HPV 16, 18, 31, 33, 35, 39, 45, 51, 52, 56, 58, 59, 66 or 68 at Enrollment, Month 12, or Month 24. e Persistent HPV: detection of a type-specific HPV in two or three samples of Enrollment, Month 12, or Month 24. f p-value obtained from Student’s t g p-value obtained from Chi-Square test. h p-value obtained from Wilcoxon rank sum test. i p-value obtained from Fisher’s exact test. 3.2 Plasma AFB 1 Table 1 1 1 1 3.3 HIV-related factors HIV-related factors are shown in Table 1 3.4 HR-HPV detection When all three study visits were considered, HPV 16 was detected in 8.8 %, HPV 18 in 9.6 %, Non-16/18 HR-HPV in 54.4 %, and Any HR-HPV in 57.0 % WLWH; persistent HPV 16 occurred in 1.8 %, persistent HPV 18 in 5.3 %. None of these values differ significantly between Kenyan or Ugandan WLWH ( Table 1 3.5 CIN2/3 lesions and associated HPV distribution in cervical swabs from 13 WLWH Based on pathological assessment, CIN2/3 was found in 11.4 % of WLWH, including 16.7 % Kenyan vs. 6.7 % Ugandan women (p = 0.093). Of the 13 CIN2/3 cases, 6 were CIN3 and 7 were CIN2. There were no invasive cervical cancers diagnosed. The specific HPV types detected in cervical swabs associated with each CIN2/3 case are shown in Table 2 Table 2 Pathology and HPV detection/persistence in 13 Kenyan and Ugandan WLHW with biopsy-proven CIN2/3. No. Pathology HPV detection HPV persistence Country 1 CIN3 HPV 16, 18 HPV 18 Kenya 2 CIN3 HPV 18, Non-16/18 HR-HPV a HPV 18 Kenya 3 CIN3 HPV 18 − Kenya 4 CIN3 Non-16/18 HR-HPV − Uganda 5 CIN3 Non-16/18 HR-HPV − Kenya 6 CIN3 None detected b − Uganda 7 CIN2 HPV 18, Non-16/18 HR-HPV − Kenya 8 CIN2 HPV 18, Non-16/18 HR-HPV − Kenya 9 CIN2 Non-16/18 HR-HPV − Uganda 10 CIN2 Non-16/18 HR-HPV − Uganda 11 CIN2 Non-16/18 HR-HPV − Kenya 12 CIN2 Non-16/18 HR-HPV − Kenya 13 CIN2 None detected b − Kenya a Non-16/18 HR-HPV: detection of HPV 31, 33, 35, 39, 45, 51, 52, 56, 58, 59, 66 or 68. b The result of the Roche Cobas Assay was negative in this participant’s cervical swabs. 3.6 Factors associated with CIN2/3 detection Table 3 1 1 Table 3 Univariate analysis of CIN2/3 in association with demographics and behavioral characteristics, plasma aflatoxin, HIV-associated factors, and HPV detection and persistence in 114 Kenyan and Ugandan WLWH. Variable a CIN2/3 f Univariate logistic regression model of CIN2/3 No N = 101 YesN = 13 OR (95 % CI) p-value Country: Kenya 45 (44.6 %) 9 (69.2 %) 2.80 (0.81–9.69) g 0.104 Uganda 56 (55.4 %) 4 (30.8 %) Age (years), median (IQR) 38.1 (32.5, 42.7) 39.6 (29.1, 45.2) 1.01 (0.93–1.10) 0.754 Years of education, median (IQR) 9.0 (7.0, 12.0) 8.0 (8.0, 11.0) 1.02 (0.88–1.18) 0.771 Married or living with a partner, n (%) 40 (39.6 %) 6 (46.2 %) 1.31 (0.41–4.17) 0.651 Home ownership, n (%) 26 (25.7 %) 2 (15.4 %) 0.52 (0.11–2.52) 0.421 Travel to health clinic > 30 min, n (%) 43 (42.6 %) 8 (61.5 %) 2.16 (0.66–7.06) 0.203 Life-time sex partners, median (IQR) 4.0 (3.0, 5.0) 3.0 (2.0, 5.0) 0.88 (0.67–1.16) 0.376 Age of sex debut, median (IQR) 17.0 (15.0, 19.0) 18.0 (16.0, 19.0) 1.17 (0.97–1.42) 0.104 Detectable plasma aflatoxin, n (%) 74 (73.3 %) 8 (61.5 %) 0.58 (0.18–1.94) 0.380 Aflatoxin concentration pg/µL, (mean, range) 0.713 (0.000, 8.601) 0.177 (0.000, 0.955) 0.94 (0.86–1.03) h 0.190 Receiving ART b 101 (100.0 %) 13 (100.0 %) −- −- CD4 cell count (cells/uL), (median, IQR) 760.7 (609.3, 987.3) 503.0 (331.7, 925.0) 1.00 (1.00–1.00) 0.056 i Detectable HIV viral load, n (%) 20 (19.8 %) 6 (46.2 %) 3.47 (1.05–11.47) 0.041 HIV viral load (copies/mL), (mean, range) 1639.6 (0.0, 101827.0) 10690.8 (0.0, 136456.0) 1.07 (1.01–1.15) h 0.036 i HPV 16, n (%) 9 (8.9 %) 1 (7.7 %) 0.85 (0.10–7.33) 0.884 HPV 18, n (%) 6 (5.9 %) 5 (38.5 %) 9.90 (2.47–39.69) 0.001 i Non-16/18 HR-HPV c 52 (51.5 %) 10 (76.9 %) 3.14 (0.82–12.09) 0.096 i Any HR-HPV d 54 (53.5 %) 11 (84.6 %) 4.79 (1.01–22.70) 0.049 Persistent HPV 16 e 2 (2.0 %) 0 3.23 (0.0–27.65) 0.784 Persistent HPV 18 e 4 (4.0 %) 2 (15.4 %) 4.41 (0.72–26.90) 0.108 a Age, education, marital status, home ownership, travel time to health clinic, sex partner, and age of sex debut were measured at the Enrollment; plasma aflatoxin was measured at the Month 12; HIV-associated factors were composite measures over the Enrollment, Month 12 and Month 24 measurements; HPV detection and persistence were composite measures over the Enrollment, Month 12 and Month 24 measurements. b Receiving ART: receiving ART at Enrollment, Month 12, and Month 24. c Non16/18 HR-HPV: detection of HPV 31, 33, 35, 39, 45, 51, 52, 56, 58, 59, 66 or 68 at Enrollment, Month 12, or Month 24. d Any HR-HPV: detection of HPV 16, 18, 31, 33, 35, 39, 45, 51, 52, 56, 58, 59, 66 or 68 at Enrollment, Month 12, or Month 24. e Persistent HPV: detection of a type-specific HPV (HPV 16 or 18) in two or three samples collected at the Enrollment, Month 12, or Month 24. f Biopsy-proven CIN2/3 at Enrolment, Month 12, or Month 24. g Odds Ratio (OR) indicates comparison of Kenya vs. Uganda. h Log transformation was performed on the original value to normalize skewed distribution of the variable and obtain more reliable model estimates. i Selected variables with a p-value ≤ 0.10 in a univariate model were included in the subsequent multivariable model. Selected variables with a p-value ≤ 0.10 in the univariate analysis (CD4 cell count, HIV viral load, HPV 18 detection, and detection of Non-16/18 HR-HPV) were then included in a multivariable model. Two variables with a p-value ≤ 0.10 in the univariate analysis were not selected for inclusion in the multivariable model: detectable HIV VL and detection of any HR-HPV. Detectable HIV VL, a binary variable, was not selected because the continuous variable of HIV VL (copies/mL) was preferred. Detection of any HR-HPV was not selected because HPV 18 is a component of this variable. Table 4 Table 4 Multivariable logistic regression model of CIN2/3 with HIV-associated factors and HPV detections based on 114 WLWH. Variable OR (95 % CI) p-value CD4 cell count (cells/uL) 1.00 (0.99–1.01) 0.182 HIV viral load (copies/mL) a 1.03 (0.95–1.12) 0.466 Non-16/18 HR-HPV b 2.64 (0.61–11.46) 0.196 HPV 18 6.49 (1.37–30.78) 0.019 a Log transformation was performed on the original value to normalize skewed distribution of the variable and obtain more reliable model estimate. b Non-16/18 HR-HPV: detection of HPV 31, 33, 35, 39, 45, 51, 52, 56, 58, 59, 66 or 68. 4 Discussion The current study explored behavioral and biological factors among WLWH that are associated with CIN2/3. In this analysis, 114 Kenyan and Ugandan WLWH were followed for 24 months; all underwent cervical biopsy at enrollment and two years later. CIN2/3 was detected in 11.4 % of all WLWH. HR-HPV of any of the 14 types detected in the Roche Cobas Assay was detected in 57.0 % of cervical swabs in these Kenyan and Ugandan WLWH when all three study visits were considered. For the overall study, HR-HPV was detected in 48.1 % of HIV-uninfected women when all three study visits were considered (data not shown). The high prevalence of HR-HPV in this cohort is consistent with other studies: a meta-analysis found a prevalence of 51 % among WLWH living in developing countries ( Bogale et al., 2020 Ermel et al., 2019 Infection with HR-HPV is a necessary step in development of cervical cancer ( Walboomers et al., 1999 Kobayashi et al., 2024 Ermel et al., 2019 Castle et al., 2021 Naucler et al., 2011 Clifford et al., 2017 Wheeler, 2013 Cruikshank et al., 2025 Woodman et al., 2003 Clifford et al., 2003 Clifford et al., 2003 Clifford et al., 2003 Clifford et al., 2003 Woodman et al., 2003 Hildesheim et al., 1999 Schwartz et al., 2001 Bulk et al., 2007 Kang et al., 2011 Aflatoxin is a potent carcinogen and immunosuppressant agent present in contaminated corn and other crops. However, there is no data available on the effects of aflatoxin exposure on cervical pre-cancers or cancers. Our group previously showed that plasma AFB 1 Tong et al., 2023 Zhang et al., 2019 Ambinder, 2000 There are several potential limitations of this study. First, a modest number of WLWH were enrolled; therefore, results generated from in this study may not be representative of the overall WLWH population. A wide confidence interval in the association between detection of cervical HPV 18 and CIN2/3 could be due the modest number of study participants. However, the enrolled WLWH were followed for 24 months and were well characterized, including three study visits with HPV and HIV tests, and two cervical biopsies for all participants. A strong association was found between HPV 18 detection in cervical swabs and CIN2/3 in cervical biopsies, despite the modest number of participants. Second, the Roche Cobas Assay does not permit a detailed analysis of HR-HPV type distribution, except for specific detection of HPV 16 and HPV 18. While HPV 18 detection in cervical swabs was clearly associated with CIN2/3, it is possible that an association of another HR-HPV type (HPV 45, for example) with CIN2/3 was missed, because detailed HPV typing information was not available. Third, although all WLWH in the study were receiving ART, it has been shown that such women are still at high risk for CIN2/3 and cervical cancer ( Kelly et al., 2018 In conclusion, CIN2/3 was detected in 11.4 % of Kenyan and Ugandan WLWH who were receiving ART. Most cervical cancers are caused by HPV 16 and HPV 18, and WLWH who have cervical samples that test positive for either of these types should be followed closely ( Cho et al., 2024 Einstein et al., 2023 CRediT authorship contribution statement Miriam Nakalembe: Collins Mpamani: Jane Namugga: Carolyn Nakisige: Grace Banturaki: Phillip Tonui: Peter Itsura: Omenge Orang’o: Kapten Muthoka: Anthony Ngeresa: Beverly Musick: Aaron Ermel: Patrick Loehrer: Darron R. Brown: Yan Tong: 2.1 Ethics approval and consent to participate The study was approved by the Kenya Medical Research Institute’s Scientific and Ethics Review Unit (KEMRI-SERU) at the Moi Teaching and Referral Hospital (MTRH) (ELD/MTRH/RP/10/2/v.2/2010) and Moi University, Eldoret, Kenya (FAN0003758), the Infectious Diseases Institute and the Uganda Cancer Institute (UCI), Makerere University, Kampala, Uganda (UG-REC-019), and the Institutional Review Board of Indiana University (IU-11449). Written informed consent for participation and for use of clinical specimens was obtained from all participants either in Swahili, Luganda, or English. All study procedures were performed in accordance with relevant guidelines and regulations outlined by the Ethics Review Boards indicated above. Declaration of competing interest The authors declare that they have no known competing financial interests or personal relationships that could have appeared to influence the work reported in this paper. References Sung H. Global Cancer Statistics 2020: GLOBOCAN estimates of incidence and mortality worldwide for 36 cancers in 185 countries CA Cancer J. Clin. 71 3 2021 209 249 33538338 10.3322/caac.21660 Walboomers J.M.M. Human papillomavirus is a necessary cause of invasive cervical cancer worldwide J. Pathol. 189 1 1999 12 19 10451482 10.1002/(SICI)1096-9896(199909)189:1<12::AID-PATH431>3.0.CO;2-F Wei F. Causal attribution of human papillomavirus genotypes to invasive cervical cancer worldwide: a systematic analysis of the global literature Lancet 404 10451 2024 435 444 39097395 10.1016/S0140-6736(24)01097-3 Blossom D.B. Human papillomavirus genotypes associated with cervical cytologic abnormalities and HIV infection in Ugandan women J. Med. Virol. 79 6 2007 758 765 17457908 10.1002/jmv.20817 PMC2846524 de Sanjose S. Worldwide prevalence and genotype distribution of cervical human papillomavirus DNA in women with normal cytology: a meta-analysis Lancet Infect. Dis. 7 7 2007 453 459 17597569 10.1016/S1473-3099(07)70158-5 Nakigozi H. Prevalence of genital high-risk human papillomavirus infections and associated factors among women living with human immunodeficiency virus in Uganda BMC Cancer 24 1 2024 243 38383366 10.1186/s12885-024-11928-0 PMC10882885 Kobayashi O. Carcinogenesis and epidemiology of cervical cancer: the hallmark of human papillomavirus-associated cancer J. Obstet. Gynaecol. Res. 50 Suppl 1 2024 25 30 38839079 10.1111/jog.15997 Ermel A. A cross-sectional analysis of factors associated with detection of oncogenic human papillomavirus in human immunodeficiency virus-infected and uninfected Kenyan women BMC Infect. Dis. 19 1 2019 352 31029097 10.1186/s12879-019-3982-7 PMC6487004 Castle P.E. Einstein M.H. Sahasrabuddhe V.V. Cervical cancer prevention and control in women living with human immunodeficiency virus CA Cancer J. Clin. 71 6 2021 505 526 34499351 10.3322/caac.21696 PMC10054840 Tong Y. The East Africa Consortium for human papillomavirus and cervical cancer in women living with HIV/AIDS Ann. Med. 54 1 2022 1202 1211 35521812 10.1080/07853890.2022.2067897 PMC9090376 Tong Y. Association of plasma aflatoxin with persistent detection of oncogenic human papillomaviruses in cervical samples from Kenyan women enrolled in a longitudinal study BMC Infect. Dis. 23 1 2023 377 37280534 10.1186/s12879-023-08323-8 PMC10242809 Bogale A.L. Molecular epidemiology of human papillomavirus among HIV infected women in developing countries: systematic review and meta-analysis Virol. J. 17 1 2020 179 33198743 10.1186/s12985-020-01448-1 PMC7670609 Naucler P. Human papillomavirus type-specific risk of cervical cancer in a population with high human immunodeficiency virus prevalence: case-control study J. Gen. Virol. 92 Pt 12 2011 2784 2791 21900420 10.1099/vir.0.034298-0 Clifford G.M. Tully S. Franceschi S. Carcinogenicity of human papillomavirus (HPV) types in HIV-positive women: a meta-analysis from HPV infection to cervical cancer Clin. Infect. Dis. 64 9 2017 1228 1235 28199532 10.1093/cid/cix135 PMC5399941 Wheeler C.M. The natural history of cervical human papillomavirus infections and cervical cancer: gaps in knowledge and future horizons Obstet. Gynecol. Clin. North Am. 40 2 2013 165 176 23732023 10.1016/j.ogc.2013.02.004 Cruikshank M.E. Updating the basic biology of human papillomavirus infection in the early natural history of cervical cancer Am. J. Obstet. Gynecol. 2025 10.1016/j.ajog.2025.06.038 40562265 Woodman C.B. Human papillomavirus type 18 and rapidly progressing cervical intraepithelial neoplasia Lancet 361 9351 2003 40 43 12517465 10.1016/S0140-6736(03)12120-4 Clifford G. Comparison of HPV type distribution in high-grade cervical lesions and cervical cancer: a meta-analysis Br. J. Cancer 89 1 2003 101 105 12838308 10.1038/sj.bjc.6601024 PMC2394204 Clifford G.M. Human papillomavirus types in invasive cervical cancer worldwide: a meta-analysis Br. J. Cancer 88 1 2003 63 73 12556961 10.1038/sj.bjc.6600688 PMC2376782 Hildesheim A. Risk factors for rapid-onset cervical cancer Am. J. Obstet. Gynecol. 180 3 1999 571 577 10076130 10.1016/s0002-9378(99)70256-5 Schwartz S.M. Human papillomavirus and prognosis of invasive cervical cancer: a population-based study J. Clin. Oncol. 19 7 2001 1906 1915 11283122 10.1200/JCO.2001.19.7.1906 Bulk S. The contribution of HPV18 to cervical cancer is underestimated using high-grade CIN as a measure of screening efficiency Br. J. Cancer 96 8 2007 1234 1236 17375047 10.1038/sj.bjc.6603693 PMC2360158 Kang W.D. HPV-18 is a poor prognostic factor, unlike the HPV viral load, in patients with stage IB-IIA cervical cancer undergoing radical hysterectomy Gynecol. Oncol. 121 3 2011 546 550 21334052 10.1016/j.ygyno.2011.01.015 Zhang J. Detection and concentration of plasma aflatoxin is associated with detection of oncogenic human papillomavirus in Kenyan women Open Forum Infect. Dis. 6 9 2019 10.1093/ofid/ofz354 PMC6736060 31392332 Ambinder R.F. Gammaherpesviruses and “Hit-and-Run” oncogenesis Am. J. Pathol. 156 1 2000 1 3 10623645 10.1016/S0002-9440(10)64697-4 PMC1868625 Kelly H. Association of antiretroviral therapy with high-risk human papillomavirus, cervical intraepithelial neoplasia, and invasive cervical cancer in women living with HIV: a systematic review and meta-analysis Lancet HIV 5 1 2018 e45 e58 29107561 10.1016/S2352-3018(17)30149-2 PMC5757426 Cho E.H. Evaluation of clinical usefulness of HPV-16 and HPV-18 genotyping for cervical cancer screening J. Gynecol. Oncol. 35 6 2024 e72 38522949 10.3802/jgo.2024.35.e72 PMC11543248 Einstein M.H. Primary human papillomavirus testing and other new technologies for cervical cancer screening Obstet. Gynecol. 142 5 2023 1036 1043 37708516 10.1097/AOG.0000000000005393 Acknowledgement This study was funded by the National Cancer Institute, United States 1U54CA190151-01 ",
  "metadata": {
    "Title of this paper": "Primary human papillomavirus testing and other new technologies for cervical cancer screening",
    "Journal it was published in:": "Gynecologic Oncology Reports",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12495285/"
  }
}