{
  "title": "Paper_89",
  "abstract": "J Opt Microsyst J Opt Microsyst 319 nihpa Journal of optical microsystems 2708-5260 pmc-is-collection-domain yes pmc-collection-title NIHPA Author Manuscripts PMC12490782 PMC12490782.1 12490782 12490782 NIHMS2062450 10.1117/1.jom.4.3.034501 NIHMS2062450 NIHPA2062450 1 Article Compact scattering-based light sheet microscopy probe using a custom miniature objective lens Zhao Jingwei a Kim Yongjun b Sugimura Momoka a Marcelino Kenneth a Romero Rafael b Liang Brooke c Khan Michelle d Yang Eric c Kang Dongkyun a b * a b c d * dkkang@arizona.edu 8 2024 6 8 2024 4 3 498135 10.1117/1.jom.4.3.034501 04 03 2025 02 10 2025 03 10 2025 03 10 2025 We have developed a compact scattering-based light sheet microscopy (sLSM) probe capable of imaging unstained tissues with cellular resolution. In the compact sLSM probe, a custom miniature objective lens was developed to achieve a high lateral resolution, large field of view (FOV), and small field curvature. The measured resolution of the custom objective was 1.65–1.97 μm across the FOV of ± 1.0 mm. The compact probe had dimensions of 4 cm in width and height, and 10 cm in length. The compact sLSM probe achieved an axial resolution better than 5.6 μm over a depth range of 206.2 μm, and a lateral resolution of 1.9 μm. Preliminary results showed that the compact sLSM probe could visualize cellular details of fixed human anal epithelial tissues in a similar manner to a bench LSM device using off-the-shelf objective lenses. light sheet microscopy compact microscope unstained tissue imaging miniature objective lens custom objective lens intrinsic scattering pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access no pmc-prop-olf no pmc-prop-manuscript yes pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement no pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes ",
  "metadata": {
    "Title of this paper": "Compact scattering-based light sheet microscopy probe using a custom miniature objective lens",
    "Journal it was published in:": "Journal of optical microsystems",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12490782/"
  }
}