{
  "title": "Paper_1008",
  "abstract": "pmc Front Immunol Front Immunol 1754 frontimmu Front. Immunol. Frontiers in Immunology 1664-3224 Frontiers Media SA PMC12481161 PMC12481161.1 12481161 12481161 41035636 10.3389/fimmu.2025.1612623 1 Immunology Original Research Integrated multi-omics analysis of single-cell and spatial transcriptomics reveals distinct hpv-associated immune microenvironment features and prognostic signatures in cervical cancer Su Qiuyue  1  † Tian Xiangdong  2  † Li Fucheng  3  † Yu Xi  1 Gong Wenchen  2 Chen Yurong  1 Wang Jianan  3 Yang Siqi  1 Zhang Shaojun  4 Zhang Qian  5  * Yang Shanshan  1  *  1 Department of Gynecological Radiotherapy, Harbin Medical University Cancer Hospital Harbin China  2 Department of Endoscopy, Tianjin Medical University Cancer Institute & Hospital, National Clinical Research Center for Cancer, Tianjin’s Clinical Research Center for Cancer, Tianjin Key Laboratory of Digestive Cancer Tianjin China  3 Department of Breast Surgery, Harbin Medical University Cancer Hospital Harbin China  4 Medical Research Institute, Guangdong Provincial People’s Hospital (Guangdong Academy of Medical Sciences), Southern Medical University Guangzhou China  5 Department of Abdominal Radiotherapy, Harbin Medical University Cancer Hospital Harbin China Edited by: Kang Wang Reviewed by: Rama Rao Damerla  Akhileshwar Namani  Minghao Dang *Correspondence: Qian Zhang, zhangqian@hrbmu.edu.cn yangshanshan@hrbmu.edu.cn †These authors have contributed equally to this work 16 9 2025 2025 16 480569 1612623 25 4 2025 11 8 2025 16 09 2025 01 10 2025 02 10 2025 Copyright © 2025 Su, Tian, Li, Yu, Gong, Chen, Wang, Yang, Zhang, Zhang and Yang. 2025 Su, Tian, Li, Yu, Gong, Chen, Wang, Yang, Zhang, Zhang and Yang https://creativecommons.org/licenses/by/4.0/ This is an open-access article distributed under the terms of the Creative Commons Attribution License (CC BY). The use, distribution or reproduction in other forums is permitted, provided the original author(s) and the copyright owner(s) are credited and that the original publication in this journal is cited, in accordance with accepted academic practice. No use, distribution or reproduction is permitted which does not comply with these terms. Background Cervical cancer (CC) is a highly heterogeneous malignancy primarily driven by persistent infection with high-risk human papillomavirus (HPV). However, comprehensive analyses of heterogeneity in the immune microenvironment, particularly its spatial heterogeneity, between HPV-positive and HPV-negative CC remain limited, despite their critical clinical significance. Methods We performed single-cell RNA sequencing (scRNA-seq) and spatial transcriptomics (ST) sequencing on collected cervical cancer samples, integrating scRNA-seq, ST, and bulk RNA-seq to analyze distinct cell subtypes and characterize their spatial distribution. Multiplex immunofluorescence analysis was further utilized to validate HPV status-specific expression patterns. Cox regression and LASSO regression analyses were used to identify the prognostic signature on the TCGA dataset. Results Through integrative analysis, we found that HPV-positive samples demonstrated elevated proportions of CD4 + + ANXA1 FPR1/3 + + + MDK LRP1 Conclusion Based on integrated multi-omics data, we precisely delineated the spatial transcriptional features of the tumor microenvironment in CC with different HPV statuses, including identifying distinct CD8 + cervical cancer HPV single-cell sequencing spatial transcriptomics tumor microenvironment prognostic factor National Natural Science Foundation of China 10.13039/501100001809 82373207, 82203423 Natural Science Foundation of Tianjin Municipality 10.13039/501100006606 23JCYBJC00600 The author(s) declare financial support was received for the research and/or publication of this article. This study was supported by National Natural Science Foundation of China (82373207, 82203423), Natural Science Foundation of Tianjin (23JCYBJC00600), Tianjin Key Medical Discipline (Specialty) Construction Project (TJYXZDXK-009A), Climing program of Harbin Medical University Cancer Hospital (PDY2024-06). pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement yes pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes section-in-acceptance Cancer Immunity and Immunotherapy Introduction Cervical cancer (CC) remains one of the most lethal malignancies affecting women worldwide ( 1 2 3 3 4 The critical influence of the tumor microenvironment (TME) on carcinogenesis and therapeutic effectiveness has been widely recognized. Cancer cells can adapt to and thrive in novel microenvironments by modulating their interactions with stromal cells, altering their mechanical properties ( 5 6 Single-cell sequencing technology plays a crucial role in studying the TME in CC, enabling a detailed understanding of the cellular composition and interactions that drive tumor progression and response to therapies ( 7 8 Materials and methods Patient sample collection Four fresh samples of pathologically diagnosed squamous cell carcinoma of the cervix were collected from Harbin Medical University Cancer Hospital, with written informed consent obtained from all patients and approval from the Institute Research Medical Ethics Committee of Harbin Medical University (Ethics Approval No. KY2019-16). Conducted in accordance with the Declaration of Helsinki, the study included two HPV-positive and two HPV-negative CC individuals for scRNA-seq analysis. HPV infection status was determined using a commercial HPV Genotyping Diagnosis Kit (Genetel Pharmaceuticals, Shenzhen, China) with parallel analysis via HPV genotype DNA microarray reader system (HPV-GenoCam-9600, Genetel Pharmaceuticals), in addition, P16 expression was evaluated through immunohistochemistry. Detailed clinical and pathological information is presented in  Supplementary Table S1 3 Single‐cell sequencing analysis All procedures adhered to the manufacturer’s protocol (BD Biosciences). Single-cell suspensions from each sample were initially stained with two fluorescent dyes, Calcein AM (Thermo Fisher Scientific, Cat. No. C1430) and Draq7 (Cat. No. 564904), to accurately determine cell concentration and viability using the BD Rhapsody™ Scanner before proceeding with single-cell multiplexing labeling. Cell viability ranged from 70% to 80%. Each sample’s single-cell suspension was sequentially labeled with the BD Human Single-Cell Multiplexing Kit (Cat. No. 633781) before pooling. The BD Rhapsody Express system, using a micro-well cartridge, captured the single-cell transcriptome. Approximately 18–000 cells were captured across more than 200–000 micro-wells in each batch. Excess oligonucleotide barcode beads were loaded onto the cartridge to ensure nearly every micro-well contained one bead paired with a micro-well. Cells were lysed with cell lysis buffer, releasing polyadenylated RNA molecules that hybridized with the beads. The beads were then harvested into a single tube for reverse transcription. During cDNA synthesis, each cDNA molecule was labeled with a molecular index and a cell label indicating its source cell at the 3’ end of the mRNA transcript. The entire transcriptome library was prepared through double-strand cDNA synthesis, ligation, and general amplification involving 13 PCR cycles. To enrich the 3’ end of transcriptional products associated with cell labels and molecular indices, the sequencing library of the whole transcriptome amplification products was prepared using random start-up PCR. These libraries were sequenced on the HiSeq2500 (Illumina) using the PE150 model. The BD Whole Transcriptome Analysis (WTA) Rhapsody analysis pipeline was used to process sequencing data, including alignment and generation of gene/barcode matrix. 10x Genomics Visium ST The tumor and background tissue sections from another 3 patients were processed for ST using the 10x Genomics Visium platform. Visium spatial gene expression data for formalin-fixed paraffin-embedded (FFPE) tissues were acquired in strict accordance with the meticulously detailed protocols furnished by 10× Genomics for tissue preparation and library construction. The FFPE tissues underwent a sequential series of processing steps. First, they underwent deparaffinization, a process essential for removing paraffin wax. This was followed by staining, which facilitated the visualization and identification of tissue components. Subsequently, the version 1 human whole-transcriptome probe panels were applied to the deparaffinized, stained, and decrosslinked tissues. Upon completion of the hybridization process, where complementary nucleic acid sequences anneal to each other, ligation of the probes was carried out. The ligation products were liberated from the tissue through RNase treatment and permeabilization techniques. Spatially barcoded oligonucleotides were then utilized to capture the ligated probe products, and an extension reaction of the probes was subsequently initiated. Libraries were generated from the extended probes through standard molecular biology techniques such as polymerase chain reaction-based amplification and purification steps. To assess the integrity and quantity of each resultant library, a Qubit fluorometer and an Agilent TapeStation were employed, leveraging their respective capabilities for accurate nucleic acid quantification and quality assessment. The final libraries were subjected to high-throughput sequencing on an Illumina NovaSeq 6000 platform. This sequencing process yielded 28-base-pair (bp) reads, which encompassed spatial barcodes and unique molecular identifier (UMI) sequences. The spatial barcodes were crucial for mapping the origin of each sequenced fragment within the tissue, while the UMIs enabled the quantification of unique transcripts, reducing the impact of PCR amplification biases. In addition, 50-bp probe reads were generated, which were essential for transcriptomic profiling and gene expression analysis. ST analysis The gene-spot matrices generated after processing the ST data of ST and Visium samples were analyzed using the Seurat package (version 4.3.0). Spots were filtered based on a minimum detected gene count of 200 genes, and genes with fewer than 10 read counts or expressed in fewer than 3 spots were removed. Inter-spot normalization was performed using the LogVMR function. Dimensionality reduction and clustering were carried out on the first 30 principal components using principal component analysis. To better visualize the spatial expression of features, the spots were enhanced using the “spatialEnhance” function of the BayesSpace package (version 1.6.0) ( 9 10 Inferring super-resolution tissue architecture The cell type composition of each point was determined using the iStar algorithm. The iStar is a weakly supervised model ( 11 Raw sequencing data processing and identification of major cell populations Quality control and downstream analysis of the scRNA-seq-derived gene expression matrix were performed using the Seurat pipeline (v4.3.0) in R (v4.2.3) ( 12 Highly variable genes were selected for unsupervised clustering analysis through the Seurat pipeline. Dimensionality reduction was achieved using the first 20 principal components derived from 2000 highly variable genes. Cell clustering was performed with the FindClusters function at a resolution of 0.8, followed by two-dimensional visualization using Uniform Manifold Approximation and Projection (UMAP) ( 13 Calculation of the gene set activity level Gene set activity analysis was performed on TCGA-CESC(Cervical Squamous Cell Carcinoma and Endocervical Adenocarcinoma) samples using the AUCell R package (version 1.20.2) ( 14 Pseudotime trajectory analysis Developmental trajectories of heterogeneous cell clusters were reconstructed using Monocle2 (version 2.26.0) ( 15 + + Cell-cell communication analysis Intercellular communication networks were systematically analyzed using CellChat (version 1.6.1) to delineate HPV status-dependent signaling patterns ( 16 17 MHC II and DC maturation scores Gene signature scores were computed at single-cell resolution using Seurat’s AddModuleScore function. Two specific immunological signatures were quantified (1): MHC class II score, derived from the expression profile of MHC class II-related genes; and (2) Dendritic cell (DC) maturation score, calculated based on established DC maturation markers (  Supplementary Table S2 Differential gene expression analysis Differential gene expression analysis was performed to compare: (i) HPV-infected versus non-infected epithelial cells, and (ii) HPV-infected versus non-infected cDC2s, using Seurat’s FindMarkers function with Wilcoxon rank sum test. Significant DEGs were selected based on the following criteria (1): log fold change (lnFC) > 0.25 (2), p < 0.05, and (3) minimum percentage (min.pct) > 0.1. Pathway enrichment analysis of epithelial cell-specific DEGs was subsequently conducted using the ReactomePA package (version 1.42.0) through its enrichPathway function, with false discovery rate (FDR) correction for multiple testing. Establishment and verification of prognostic model Utilizing epithelial cell differential genes with prognostic value, an ERS was established to predict the prognosis of CC. Firstly, univariate Cox regression analysis was employed to evaluate the impact of these genes on the survival status of CC patients. Subsequently, the least absolute shrinkage and selection operator (LASSO) regression method was utilized to further reduce the number of candidate genes, ultimately constructing the ERS. With the ERS, patients were classified into a high-risk group or a low-risk group according to the median risk score. Receiver operating characteristic (ROC) curves, calibration curves, and decision curve analysis (DCA) were applied to assess the accuracy and clinical utility of the ERS. Differences in the immune TME The “CIBERSORT” R package ( 18 19 20 Multiplex immunofluorescence mIF was carried out using a multiple fluorescent staining kit (abs50014; Absin, Shanghai, China) according to the manufacturer’s instructions. Briefly, the sections were dewaxed in xylene, rehydrated through an alcohol gradient, and incubated with serum. Following heat repair, the sections were incubated with primary antibodies ( CD8 CD4 PD1 ANXA1 MDK DAPI Results Super-resolution tissue architecture in HPV-positive and HPV-negative CC To explore TME heterogeneity between HPV-positive and HPV-negative CC, we performed ST with tumor sections from three patients with CC (  Figure 1A 21 22 11  Figure 1B EPCAM CD3E JCHAIN LYZ  Figure 1C Figure 1 Super-resolution tissue architecture resolved by iStar in HPV-positive and HPV-negative CC. (A) (B) + + (C) EPCAM CD3E JCHAIN LYZ (D) (E) (F) (G) + Diagram illustrating a multi-omic analysis of cervical tissue samples comparing HPV positive and negative cases. Panels include A) workflow of spatial transcriptomics and ScRNA-seq analysis. B) Tissue section images highlighting various cell types. C) Expression levels of specific markers for different cell types. D) UMAP plots showing clustering of cell types. E) Spatial transcriptomics images with clusters labeled for HPV positive and negative samples. F and G) Box plots show K-distances for naive B and CD4 cells between HPV positive and negative samples, indicating statistical differences. Based on cellular activities and molecular characteristics, we identified four different fibroblast subtypes. Of note, one of which was present only in HPV-negative patients (fibroblast 4). This discrepancy may be due to a series of cellular and molecular changes caused by HPV infection, which in turn affect the differentiation and existence status of fibroblasts. Meanwhile, we identified the spatial locations of nine immune cell subtypes, including three B cell subtypes (memory B cell, naive B cell and plasma), four myeloid cell subtypes (neutrophil, mast, macrophage and DC), and two T cell subtypes (CD4 + + 23 We performed UMAP visualization of cell clusters using Seurat and analyzed the marker gene expression in each cluster (  Figures 1D, E  Supplementary Figures S1A, B  Figure 1E Our findings indicated that the distribution of cell clusters identified by Seurat clustering was similar to the distribution of cell types determined by the iStar method. For example, spots dominated by epithelial cells in Seurat clusters (clusters 2, 3, 4, 6, and 9) exhibited a similar distribution in tissue sections to the epithelial cell subsets identified by the iStar method; spots dominated by immune cells in the Seurat cluster (cluster 0) showed a similar distribution to the T cell subsets identified by the iStar method. These results further validated the authenticity and superiority of the iStar method, as it can identify different cell types within each spot as accurately as possible by integrating histological images. In addition, we found that the spatial locations of memory B cells and naive B cells are adjacent, and the spatial locations of CD4 + + +  Figures 1F, G 24 25 26 27 Single-cell landscape in HPV-positive and HPV-negative CC We conducted single-cell RNA sequencing (scRNA-seq) on samples derived from untreated CC patients, stratified into HPV-negative and HPV-positive cohorts (  Figure 1A EPCAM KRT19 CD24 CDH1 CD3D CD3E CD19 MS4A1 COL1A1 DCN C1R LILRA4 XCR3 IRF7 CD68 LYZ TYROBP  Figure 2A  Supplementary Figure S2A, B  Figure 2B  Figure 2C  Supplementary Table S3  Supplementary Figure S2C  Figure 2C Figure 2 Single-cell landscape of HPV-positive and HPV-negative CC. (A, B) (C) (D) (E) (F) (G) Multiple plots visualize cell type distributions and HPV infection status. Panel A displays a UMAP plot of cell types. Panel B shows another UMAP plot for HPV infection. Panel C provides a bar graph of cell proportions by HPV status. Panel D presents a UMAP of T cell types. Panel E illustrates a UMAP plot of myeloid cell types. Panel F contains bar graphs and box plots for T cell clusters and their proportions, highlighting significant differences with p-values. Panel G features bar graphs and box plots for myeloid clusters, indicating significant differences by HPV status with p-values. T and myeloid cells critically regulate tumor progression in the TME, where T cells particularly mediate antiviral and antitumor immunity ( 28 31  Figures 2D, E  Supplementary Figures S2D, H  Supplementary Table S4 + + + + + + + +  Supplementary Figure S2D  Supplementary Figure S2H Our analysis of T cell subtypes revealed distinct patterns between HPV- and HPV+ samples. Among CD4 + + + +  Figure 2F  Supplementary Figures S2E, F, G + +  Figures 2F In parallel, we analyzed the myeloid compartment to explore potential differences in immune cell composition. In HPV- patients, we observed higher proportions of macrophages, monocytes, and LAMP3+ DCs, while cDC2s were significantly reduced compared to HPV+ patients (  Figure 2G −4  Figure 2G  Supplementary Figure S2I + + Distinct CD8 + T cells play a central role in the TME and constitute the predominant immune cell population ( 32 +  Supplementary Figures S3A, B + 33 +  Figures 3A, B  Figure 3C + + + + + IFIT + +  Figure 3D Figure 3 Distinct developmental trajectory inference between HPV-positive and HPV-negative CC. (A) + (B) + (C) + + (D) + (E) (F) + (G) + Graphical illustration of CD8+ T cell type analysis and gene expression related to pseudotime and HPV infection. Panels A and B display scatter plots of CD8+ T cells colored by pseudotime and state, with trajectories indicating different fates. Panels C and D show density plots and component scatter plots comparing HPV positive and negative states across pseudotime. Panel E presents a heatmap demonstrating gene expression across CD8+ T cell types and branches, differentiated by colors. Panels F and G provide bar graphs of gene expression versus pseudotime and CD8+ T cell proportions, comparing HPV positive and negative groups. We further analyzed transcription factors (TFs) dynamically regulated along the pseudotime trajectory (  Figure 3E BHLHE40 RBPJ  Figure 3F  Figure 3G BHLHE40 34 35 RBPJ + 36 37 Conversely, Fate 1 exhibited increasing expression of STAB1 TRIM22  Figure 3F STAB1 38 TRIM22 39 STAB1 TRIM22  Figure 3G + STAB1 TRIM22 BHLHE40 RBPJ HPV+ and HPV- cervical cancers diverge in TME cell-cell communication To delineate HPV-specific crosstalk patterns, we performed CellphoneDB and Cellchat analyses comparing CD4 + + + +  Figure 4A +  Figure 4B  Figures 4C, D Figure 4 Characteristics of cell-cell communication between HPV-positive and HPV-negative CC in TME. (A) + + (B) (C) + − + − + (D) − + − + − + − (E) + (F–H) (F) (G) (H) (I) FCER1A CD1C CD4 CD68 APOC1 CD8A Various data visualizations comparing HPV-positive and HPVnegative samples are included. A: Bar plots depicting interaction intensities between major cell types and CD4⁺ T cells /CD8⁺ T cells. B: Scatter plots of all cell clusters, mapped by the count of their significant incoming and outgoing signaling patterns. C: Combination of scatter plots and bar graphs depicting HPV count differences and speciﬁc cell interactions. D: Plots of differences in epithelial sources and target interactions. E: Bar charts of relative information ﬂow in increased signaling pathways. F and G: Dot plots of increased signaling pathways in HPV-positive samples with color scales for communication probability and signiﬁcance. H: Additional dot plot for various signaling pathways with similar metrics. I: Immunohistochemistry images from patients displaying CD4, CD1C, FCER1A in HPV-positive, and CD8A, CD68, APOC1 in HPV-negative samples, with detailed insets. Analysis of DC/T-cells transitions revealed activated VEGF and complement signaling pathways in HPV-positive CC, whereas the APP signaling pathway was more prominent in HPV-negative CC (  Figure 4E 40 +  Figure 4F SERPINB9 NR4A3 PRDM1 LILRB2 TNFAIP3  Supplementary Figure S3D  Supplementary Figure S3E 41 + LGALS9 CD45  Figure 4G STAT1 NR3C1 CREM  Supplementary Figures S3F, G FKBP4 NR3C1 NRF2 42  Figure 4H To spatially characterize the cellular communication networks identified in our single-cell analyses, we performed spatial transcriptomic profiling using canonical markers for cDC2s ( FCER1G CD1C CD68 APOC1 + +  Figure 4I + HPV infection-Dependent Epithelial cell crosstalk and immune pathways analysis To explore the potential mechanisms underlying immune cell recruitment, we analyzed the ligand-receptor interactions of chemokines between different cell clusters in HPV-positive and HPV-negative tumors. CellPhoneDB analysis revealed that in HPV-positive tumors, epithelial cells exhibited a stronger interaction with cDC2s (  Figure 5A ANXA1 FPR1 ANXA1 FPR3  Figure 5B MDK SOLR1 MDK LRP1  Figure 5C  Figure 5D MDK LRP1 43 Figure 5 Analysis of epithelial cell-cell crosstalk in HPV-positive and HPV-negative samples. (A) (B) (C) (D) (E, F) MDK (G) (H) (I) LGALS9 CD274 TNFRSF14 CTLA4 (J) CD8 CD4 ANXA1 MDK PDCD1 Scientific illustration depicting various analyses related to HPV infection. Panels include (A) differential interaction strengths among epithelial cells, macrophages, monocytes, and cDC2s; (B) potential interactions between epithelial cells and cDC2s; (C) interactions with macrophages/monocytes; (D) data on epithelial source and accuracy rates; (E) tumor microenvironment (TME) scores for MDK and LRP1; (F) epithelial differential expression graph; (G) diagram of interactions among cell types; (H) cell proportion charts for specific markers; (I) immunofluorescence images comparing HPV+ and HPV- conditions for various markers. To investigate this possibility, we assessed the impact of MDK LRP1 20 MDK LRP1 MDK LRP1  Figures 5E, F MDK LRP1 To uncover the transcriptional signatures of tumor cells, we performed differential gene expression analysis on epithelial cells from both HPV-positive and HPV-negative tumors. ANXA1 MDK  Figure 5G + 44  Supplementary Figure S4A ANXA1 FPR1/3 + + LGALS9 CD45 MDK LRP1 SORL1 +  Figure 5C Immune checkpoint analysis revealed that HPV-positive tumors exhibited high expression of LGALS9 CD274 TNFRSF14 CD80/86 CTLA4 +  Figures 5H, I + ANXA1 + MDK  Figure 5J Construction of an epithelial−related prognostic signature The molecular and immune landscape of CC varies significantly based on HPV status, leading to distinct prognostic outcomes. However, the impact of epithelial-related transcriptional alterations in this context remains unclear. To address this, we constructed an epithelial-related risk score (ERS) based on DEGs upregulated in epidermal cells in HPV-positive samples. This model was constructed using 269 HPV-positive patients in the TCGA CC cohort as a training set, with 92 prognostic genes identified through univariate COX analysis ( P  Figures 6A, B  Supplementary Figure S4B Figure 6 A newly-identified ERS exhibits robust predictive power regarding the prognosis of CC. (A, B) (C) (D) (E) (F) (G) (H) GSE52903 (I) GSE52903 (J) (K) (L) (M) (N) A series of charts/plots analyzing the predictive power of the newly identified ERS for CC prognosis. Panels include: A) Coefficients vs. log Lambda. B) Mean-squared error vs. log Lambda. C) Survival probability over time for high and low groups. D and I) ROC curves showing sensitivity and specificity. E) Calibration curve for predicted vs. actual survival probability. F) Net benefit graph based on risk. G and H) Kaplan-Meier survival plots for different datasets. J) Box plot comparing risk scores between non-responders and responders. K) Risk score distribution and correlation with events. L) Stacked bar chart of estimated cell type proportions. M and N) Box plots of various scores and proportions between groups. Patients were then divided into high- and low-risk groups based on the median risk score to evaluate the prognostic value of the ERS. Kaplan-Meier survival analysis showed significant differences in patient overall survival (OS) between the high- and low-risk groups (  Figure 6C  Figure 6D  Figure 6E  Figure 6F P  Figure 6G GSE52903 GSE52903 GSE52903  Figures 6H, I 45  Figure 6J Further analysis of the relationship between risk scores, survival time, and survival status highlighted that patients in the high-risk group had a poorer prognosis. The heatmap illustrated the relationship between 12 genes and risk levels, with a negative correlation between the high-risk group and genes such as YWHAG SH3GLB2 ANKRD22 SCML1 P4HA1  Figure 6K + +  Figures 6L, M  Figure 6N Discussion HPV-negative CC accounts for approximately 3-8% of all CC cases and demonstrates significantly poorer clinical outcomes. Compared to HPV-positive CC, along with distinct molecular profiles. Despite these differences, current clinical guidelines maintain similar treatment recommendations for both subtypes ( 3 4 46 48 1 49 50 The ST technology empowers the in-depth characterization of the spatial patterns of gene expression within tissues. It not only serves as a crucial tool for exploring the intricate mechanisms of intercellular communication but also paves the way for mapping the spatiotemporal sequence of cell development. However, current ST platforms face technical constraints, being limited by either suboptimal single-cell resolution or incomplete transcriptome coverage. The innovative iStar technology overcomes these limitations by integrating machine learning with ST, providing rapid and precise cellular deconvolution of tissue microenvironments. This breakthrough facilitates near single-cell resolution ST data generation with full transcriptome coverage. In our research, we harnessed the iStar technology to conduct a meticulous analysis of untreated CC tumors. As a result, we were able to furnish a spatially resolved and exquisitely detailed map of the heterogeneity landscape within CC tumors. Spatial mapping revealed that memory B cells and naive B cells, along with CD4 + 24 27 + + 51 CD80 CD86 CD28 + 25 Our study revealed substantial disparities in both cellular composition and transcriptomic profiles between HPV-negative and HPV-positive CC specimens. A particularly striking observation was the significantly elevated frequency of CD4 + + + + + + 52 51 53 2 54 The dynamic crosstalk between epithelial and immune cells plays a pivotal role in malignant tumor pathogenesis ( 55 ANXA1 FPR1/3 + + LGALS9 CD45 56 ANXA1 FPR1 57 58 ANXA1 FPR1 MDK LRP1 SORL1 + MDK LRP1 59 60 CXCL1 CXCL1 60 MDK LRP1 43 MDK-LRP1 9 + + Immunotherapy has become a promising strategy in the fight against cancer, leveraging host immune system modulation to achieve precise tumor targeting ( 61 1 62 PD-L1 CTLA-4 1 PD1 PD-L1 + CTLA-4 49 62 PD-L1 PD-L1 PD1 63 PD1 PD-L1 PD-L1 64 66 Our study revealed distinct immune checkpoint profiles between HPV-associated and HPV-independent cervical carcinomas. HPV-positive CC tumors exhibited epithelial cells with significant enrichment of immune checkpoint ligands ( LGALS9 CD274 TNFRSF14 CD80/86 CTLA4 CTLA-4 CD28 CD80 CD86 CTLA-4 67 68 CTLA-4 1 2 69 PD1/PD-L1 CTLA-4/CD86 70 CTLA-4 In view of the pivotal role that epithelial cells play in the occurrence and development of CC, we selected the DEGs of epithelial cells in HPV-positive and HPV-negative CC to construct a prognostic model. From the perspective of cell communication, epithelial cells are located upstream in the cell communication network. They can regulate the functions of downstream immune cells such as DCs and macrophages by expressing a variety of receptors. In HPV-positive CC patients, the abnormal state of epithelial cells may lead to a disorder in their regulatory function on downstream immune cells, thereby affecting the patients’ immune response and prognosis. Therefore, investigating the DEGs of epithelial cells contributes to revealing the potential mechanisms by which they regulate the tumor immune microenvironment, providing important clues for predicting the prognosis of HPV-positive patients. Moreover, epithelial cells are one of the major cell types in the TME of CC. This characteristic endows them with a central position in tumor development and the formation of intratumoral heterogeneity. By analyzing the DEGs of epithelial cells, we can gain a deeper understanding of the nature of intratumoral heterogeneity and uncover molecular markers closely related to the prognosis of HPV-positive patients. The ERS performed well in the TCGA cohorts. The AUC values at 1-year, 3-year, and 5-year time points all exceeded 0.79. Furthermore, the infiltration of immune cells in the low-risk group was significantly higher than that in the high-risk group, indicating that ERS may be helpful in evaluating the response to immunotherapy. Our study in the PRJEB25780 cohort confirmed the correlation between ERS and the efficacy of immunotherapy. ERS can assist us in better understanding the pathogenesis and biological behavior of CC, thus holding potential clinical application value. This study is constrained by three primary limitations. Firstly, the small sample size in scRNA and ST analysis limits the statistical power and generalizability of our findings. A key reason for this is the low clinical incidence of HPV-negative CC, which makes sample accumulation challenging. The exclusion of certain cell types, such as B cells and fibroblasts, due to insufficient sample quantity, results in a relatively small representation of these clusters in our analysis. Further investigation is needed to elucidate their roles in the TME and their interactions with other cells. Larger sample sizes in future studies are crucial to validate our conclusions and allow for a more in-depth exploration of cell subclusters associated with treatment response. Secondly, although ST has provided valuable insights, the relatively low spatial resolution of the Visium platform may not fully capture the intricate cellular interactions and heterogeneity within cervical tumors. In the future, an integrated multi-omics approach that combines sub-cellular resolution ST with proteomics and metabolomics could offer a more comprehensive understanding of the HPV-related immune microenvironment and prognostic features in CC. Thirdly, variability in tumor volume in CC can significantly impact cell proportions and heterogeneity. Biopsy examination alone may not capture the entire tumor, and additional multipoint inspections or resections could help mitigate this limitation. Conclusions Collectively, our study underscored the molecular heterogeneity within the TME based on the HPV infection status and comprehensively characterized the variants of epithelial and immune cell clusters at the single-cell and ST levels, providing novel insights into the remodeling of the tumor ecosystem in CC based on HPV infection status. Lastly, the differential genes of epithelial cells were utilized to construct the ERS, a prognostic prediction model for CC. These findings may provide insights for the development of new treatment strategies for CC. Acknowledgments We express our gratitude for the provision of data by databases such as TCGA and GEO. Sincere appreciation is extended to the reviewers and editors for their valuable comments. Abbreviations APCs, antigen-presenting cells; AUC, area-under-the-curve; CC, cervical cancer; CTLA-4, cytotoxic T-lymphocyte associated protein 4; DCA, decision curve analysis; DEGs, differentially expressed genes; ERS, epithelial cell-related signature; FFPE, formalin-fixed paraffin-embedded; HPV, human papillomavirus; LASSO, least absolute shrinkage and selection operator; mIF, multiplex immunofluorescence; OS, overall survival; PD-L1, programmed cell death 1 ligand 1; ROC, receiver operating characteristic; Ro/e, ratio of observed to expected; scRNA-seq, single-cell RNA sequencing; ST, spatial transcriptomics; STAB1, stabilin-1; TFs, transcription factors; TME, tumor microenvironment; Treg, regulatory T; UMAP, Uniform Manifold Approximation and Projection; UMI, unique molecular identifier Data availability statement The single cell RNA sequencing data presented in the study are deposited in the GEO repository, accession number GSE171894 Ethics statement The studies involving humans were approved by the Institute Research Medical Ethics Committee of Harbin Medical University (Ethics Approval No. KY2019-16). The studies were conducted in accordance with the local legislation and institutional requirements. The participants provided their written informed consent to participate in this study. Author contributions QS: Formal Analysis, Writing – original draft, Conceptualization. XT: Software, Writing – original draft, Supervision, Funding acquisition. FL: Formal Analysis, Writing – review & editing, Data curation. XY: Methodology, Writing – original draft. WG: Writing – original draft, Supervision, Validation, Funding acquisition. YC: Software, Writing – review & editing. JW: Writing – original draft, Data curation. SQY: Writing – original draft, Data curation, Validation. SZ: Resources, Writing – review & editing, Project administration. QZ: Project administration, Writing – original draft, Data curation. SSY: Writing – review & editing, Funding acquisition, Conceptualization. Conflict of interest The authors declare that the research was conducted in the absence of any commercial or financial relationships that could be construed as a potential conflict of interest. Generative AI statement The author(s) declare that no Generative AI was used in the creation of this manuscript. Any alternative text (alt text) provided alongside figures in this article has been generated by Frontiers with the support of artificial intelligence and reasonable efforts have been made to ensure accuracy, including review by the authors wherever possible. If you identify any issues, please contact us. Publisher’s note All claims expressed in this article are solely those of the authors and do not necessarily represent those of their affiliated organizations, or those of the publisher, the editors and the reviewers. Any product that may be evaluated in this article, or claim that may be made by its manufacturer, is not guaranteed or endorsed by the publisher. Supplementary material The Supplementary Material for this article can be found online at: https://www.frontiersin.org/articles/10.3389/fimmu.2025.1612623/full#supplementary-material Supplementary Figure 1 Seurat-based UMAP visualization of cell clusters. (A) (B) Supplementary Figure 2 Single-cell landscape of HPV-positive and HPV-negative CC. (A) (B) (C) (D) (E) (F) (G) + + + + + + (H) (I) Supplementary Figure 3 Distinct developmental trajectory inference between HPV-positive and HPV-negative CC. (A) (B) (C) BHLHE40 RBPJ SATB1 TRIM22 + (D) (E) (F) (G) Supplementary Figure 4 Pathway enrichment analysis of HPV-positive/negative CC and permutation-based validation of ERS genes. (A) (B) References 1 Abu-Rustum NR Yashar CM Arend R Barber E Bradley K Brooks R NCCN guidelines ® J Natl Compr Cancer Network 2023 21 1224–33 10.6004/jnccn.2023.0062 38081139 2 Rahangdale L Mungo C O’Connor S Chibwesha CJ Brewer NT Human papillomavirus vaccination and cervical cancer risk BMJ 2022 379 e070115 10.1136/bmj-2022-070115 36521855 3 Schiffman M Doorbar J Wentzensen N de Sanjosé S Fakhry C Monk BJ Carcinogenic human papillomavirus infection Nat Rev Dis Primers 2016 2 16086 10.1038/nrdp.2016.86 27905473 4 Cancer Genome Atlas Research Network, Albert Einstein College of Medicine, Analytical Biological Services, Barretos Cancer Hospital, Baylor College of Medicine, Beckman Research Institute of City of Hope, et al. Integrated genomic and molecular characterization of cervical cancer Nature 2017 543 378–84 10.1038/nature21386 28112728 PMC5354998 5 Cambria E Coughlin MF Floryan MA Offeddu GS Shelton SE Kamm RD Linking cell mechanical memory and cancer metastasis Nat Rev Cancer 2024 24 216–28 10.1038/s41568-023-00656-5 38238471 PMC11146605 6 Weiss F Lauffenburger D Friedl P Towards targeting of shared mechanisms of cancer metastasis and therapy resistance Nat Rev Cancer 2022 22 157–73 10.1038/s41568-021-00427-0 35013601 PMC10399972 7 Lei Y Tang R Xu J Wang W Zhang B Liu J Applications of single-cell sequencing in cancer research: progress and perspectives J Hematol Oncol 2021 14 91 10.1186/s13045-021-01105-2 34108022 PMC8190846 8 Jin Y Zuo Y Li G Liu W Pan Y Fan T Advances in spatial transcriptomics and its applications in cancer research Mol Cancer 2024 23 129 10.1186/s12943-024-02040-9 38902727 PMC11188176 9 Zhao E Stone MR Ren X Guenthoer J Smythe KS Pulliam T Spatial transcriptomics at subspot resolution with BayesSpace Nat Biotechnol 2021 39 1375–84 10.1038/s41587-021-00935-2 34083791 PMC8763026 10 Wei R He S Bai S Sei E Hu M Thompson A Spatial charting of single-cell transcriptomes in tissues Nat Biotechnol 2022 40 1190–9 10.1038/s41587-022-01233-1 35314812 PMC9673606 11 Zhang D Schroeder A Yan H Yang H Hu J Lee MYY Inferring super-resolution tissue architecture by integrating spatial transcriptomics with histology Nat Biotechnol 2024 42 1372–7 10.1038/s41587-023-02019-9 38168986 PMC11260191 12 Butler A Hoffman P Smibert P Papalexi E Satija R Integrating single-cell transcriptomic data across different conditions, technologies, and species Nat Biotechnol 2018 36 411–20 10.1038/nbt.4096 29608179 PMC6700744 13 Becht E McInnes L Healy J Dutertre CA Kwok IWH Ng LG Dimensionality reduction for visualizing single-cell data using UMAP Nat Biotechnol 2019 37 38 44 10.1038/nbt.4314 30531897 14 Aibar S González-Blas CB Moerman T Huynh-Thu VA Imrichova H Hulselmans G SCENIC: single-cell regulatory network inference and clustering Nat Methods 2017 14 1083–6 10.1038/nmeth.4463 28991892 PMC5937676 15 Trapnell C Cacchiarelli D Grimsby J Pokharel P Li S Morse M The dynamics and regulators of cell fate decisions are revealed by pseudotemporal ordering of single cells Nat Biotechnol 2014 32 381–6 10.1038/nbt.2859 24658644 PMC4122333 16 Jin S Guerrero-Juarez CF Zhang L Chang I Ramos R Kuan CH Inference and analysis of cell-cell communication using CellChat Nat Commun 2021 12 1088 10.1038/s41467-021-21246-9 33597522 PMC7889871 17 Efremova M Vento-Tormo M Teichmann SA Vento-Tormo R CellPhoneDB: inferring cell-cell communication from combined expression of multi-subunit ligand-receptor complexes Nat Protoc 2020 15 1484–506 10.1038/s41596-020-0292-x 32103204 18 Chen B Khodadoust MS Liu CL Newman AM Alizadeh AA Profiling tumor infiltrating immune cells with CIBERSORT Methods Mol Biol 2018 1711 243–59 10.1007/978-1-4939-7493-1_12 29344893 PMC5895181 19 Zhang L Yu X Zheng L Zhang Y Li Y Fang Q Lineage tracking reveals dynamic relationships of T cells in colorectal cancer Nature 2018 564 268–72 10.1038/s41586-018-0694-x 30479382 20 Yoshihara K Shahmoradgoli M Martínez E Vegesna R Kim H Torres-Garcia W Inferring tumour purity and stromal and immune cell admixture from expression data Nat Commun 2013 4 2612 10.1038/ncomms3612 24113773 PMC3826632 21 Bergenstråhle L He B Bergenstråhle J Abalo X Mirzazadeh R Thrane K Super-resolved spatial transcriptomics by deep data fusion Nat Biotechnol 2022 40 476–9 10.1038/s41587-021-01075-3 34845373 22 Hu J Coleman K Zhang D Lee EB Kadara H Wang L Deciphering tumor ecosystems at super resolution from spatial transcriptomics with TESLA Cell Syst 2023 14 404 417.e404 10.1016/j.cels.2023.03.008 37164011 PMC10246692 23 Zheng L Qin S Si W Wang A Xing B Gao R Pan-cancer single-cell landscape of tumor-infiltrating T cells Science 2021 374 abe6474 10.1126/science.abe6474 34914499 24 Syedbasha M Bonfiglio F Linnik J Stuehler C Wüthrich D Egli A Interferon-λ Enhances the Differentiation of Naive B Cells into Plasmablasts via the mTORC1 Pathway Cell Rep 2020 33 108211 10.1016/j.celrep.2020.108211 33027651 25 Hilligan KL Ronchese F Antigen presentation by dendritic cells and their instruction of CD4+ T helper cell responses Cell Mol Immunol 2020 17 587–99 10.1038/s41423-020-0465-0 32433540 PMC7264306 26 Chen J Larsson L Swarbrick A Lundeberg J Spatial landscapes of cancers: insights and opportunities Nat Rev Clin Oncol 2024 21 660–74 10.1038/s41571-024-00926-7 39043872 27 Pernot S Evrard S Khatib AM The give-and-take interaction between the tumor microenvironment and immune cells regulating tumor progression and repression Front Immunol 2022 13 850856 10.3389/fimmu.2022.850856 35493456 PMC9043524 28 Cunha LD Yang M Carter R Guy C Harris L Crawford JC LC3-associated phagocytosis in myeloid cells promotes tumor immune tolerance Cell 2018 175 429 441.e416 10.1016/j.cell.2018.08.061 30245008 PMC6201245 29 Bollard CM Heslop HE T cells for viral infections after allogeneic hematopoietic stem cell transplant Blood 2016 127 3331–40 10.1182/blood-2016-01-628982 27207801 PMC4929925 30 Kranz LM Diken M Haas H Kreiter S Loquai C Reuter KC Systemic RNA delivery to dendritic cells exploits antiviral defence for cancer immunotherapy Nature 2016 534 396 401 10.1038/nature18300 27281205 31 Roche PA Furuta K The ins and outs of MHC class II-mediated antigen processing and presentation Nat Rev Immunol 2015 15 203–16 10.1038/nri3818 25720354 PMC6314495 32 Itahashi K Irie T Yuda J Kumagai S Tanegashima T Lin YT BATF epigenetically and transcriptionally controls the activation program of regulatory T cells in human tumors Sci Immunol 2022 7 eabk0957 10.1126/sciimmunol.abk0957 36206353 33 LaFleur MW Nguyen TH Coxe MA Miller BC Yates KB Gillis JE PTPN2 regulates the generation of exhausted CD8(+) T cell subpopulations and restrains tumor immunity Nat Immunol 2019 20 1335–47 10.1038/s41590-019-0480-4 31527834 PMC6754306 34 Li C Zhu B Son YM Wang Z Jiang L Xiang M The transcription factor bhlhe40 programs mitochondrial regulation of resident CD8(+) T cell fitness and functionality Immunity 2020 52 201–2 10.1016/j.immuni.2019.12.008 31940270 PMC7004238 35 Cook ME Jarjour NN Lin CC Edelson BT Transcription factor bhlhe40 in immunity and autoimmunity Trends Immunol 2020 41 1023–36 10.1016/j.it.2020.09.002 33039338 PMC7606821 36 Huang H Zhou P Wei J Long L Shi H Dhungana Y  In vivo Cell 2021 184 1245 1261.e1221 10.1016/j.cell.2021.02.021 33636132 PMC8101447 37 Jiang Y Wang Y Chen G Sun F Wu Q Huang Q Nicotinamide metabolism face-off between macrophages and fibroblasts manipulates the microenvironment in gastric cancer Cell Metab 2024 36 1806 1822.e1811 10.1016/j.cmet.2024.05.013 38897198 38 Pombinho R Pinheiro J Resende M Meireles D Jalkanen S Sousa S Stabilin-1 plays a protective role against Listeria monocytogenes infection through the regulation of cytokine and chemokine production and immune cell recruitment Virulence 2021 12 2088–103 10.1080/21505594.2021.1958606 34374322 PMC8366540 39 Hatakeyama S TRIM family proteins: roles in autophagy, immunity, and carcinogenesis Trends Biochem Sci 2017 42 297 311 10.1016/j.tibs.2017.01.002 28118948 40 Ilson DH Emerging evidence for VEGF and immune checkpoint inhibition in oesophagogastric cancer Lancet Gastroenterol Hepatol 2022 7 200–1 10.1016/s2468-1253(21)00428-3 34998470 41 Bosteels C Neyt K Vanheerswynghels M van Helden MJ Sichien D Debeuf N Inflammatory Type 2 cDCs Acquire Features of cDC1s and Macrophages to Orchestrate Immunity to Respiratory Virus Infection Immunity 2020 52 1039 1056.e1039 10.1016/j.immuni.2020.04.005 32392463 PMC7207120 42 Wei HJ Gupta A Kao WM Almudallal O Letterio JJ Pareek TK Nrf2-mediated metabolic reprogramming of tolerogenic dendritic cells is protective against aplastic anemia J Autoimmunity 2018 94 33 44 10.1016/j.jaut.2018.07.005 30025621 43 Zhang Y Zuo C Liu L Hu Y Yang B Qiu S Single-cell RNA-sequencing atlas reveals an MDK-dependent immunosuppressive environment in ErbB pathway-mutated gallbladder cancer J Hepatology 2021 75 1128–41 10.1016/j.jhep.2021.06.023 34171432 44 Coelho MA Cooper S Strauss ME Karakoc E Bhosle S Gonçalves E Base editing screens map mutations affecting interferon-γ signaling in cancer Cancer Cell 2023 41 288 303.e286 10.1016/j.ccell.2022.12.009 36669486 PMC9942875 45 Kim ST Cristescu R Bass AJ Kim KM Odegaard JI Kim K Comprehensive molecular characterization of clinical responses to PD-1 inhibition in metastatic gastric cancer Nat Med 2018 24 1449–58 10.1038/s41591-018-0101-z 30013197 46 Liu C Li X Huang Q Zhang M Lei T Wang F Single-cell RNA-sequencing reveals radiochemotherapy-induced innate immune activation and MHC-II upregulation in cervical cancer Signal Transduct Target Ther 2023 8 44 10.1038/s41392-022-01264-9 36710358 PMC9884664 47 Bedard MC Chihanga T Carlile A Jackson R Brusadelli MG Lee D Single cell transcriptomic analysis of HPV16-infected epithelium identifies a keratinocyte subpopulation implicated in cancer Nat Commun 2023 14 1975 10.1038/s41467-023-37377-0 37031202 PMC10082832 48 Ou Z Lin S Qiu J Ding W Ren P Chen D Single-nucleus RNA sequencing and spatial transcriptomics reveal the immunological microenvironment of cervical squamous cell carcinoma Adv Sci (Weinh) 2022 9 e2203040 10.1002/advs.202203040 35986392 PMC9561780 49 Ferrall L Lin KY Roden RBS Hung CF Wu TC Cervical cancer immunotherapy: facts and hopes Clin Cancer Res 2021 27 4953–73 10.1158/1078-0432.Ccr-20-2833 33888488 PMC8448896 50 Huppert LA Green MD Kim L Chow C Leyfman Y Daud AI Tissue-specific Tregs in cancer metastasis: opportunities for precision immunotherapy Cell Mol Immunol 2022 19 33 45 10.1038/s41423-021-00742-4 34417572 PMC8752797 51 Palucka K Banchereau J Cancer immunotherapy via dendritic cells Nat Rev Cancer 2012 12 265–77 10.1038/nrc3258 22437871 PMC3433802 52 Cebula M Riehn M Hillebrand U Kratzer RF Kreppel F Koutsoumpli G TLR9-mediated conditioning of liver environment is essential for successful intrahepatic immunotherapy and effective memory recall Mol Ther 2017 25 2289–98 10.1016/j.ymthe.2017.06.018 28716576 PMC5628774 53 Stanley MA Epithelial cell responses to infection with human papillomavirus Clin Microbiol Rev 2012 25 215–22 10.1128/cmr.05028-11 22491770 PMC3346303 54 Puram SV Mints M Pal A Qi Z Reeb A Gelev K Cellular states are coupled to genomic and viral heterogeneity in HPV-related oropharyngeal carcinoma Nat Genet 2023 55 640–50 10.1038/s41588-023-01357-3 37012457 PMC10191634 55 Krausgruber T Fortelny N Fife-Gernedl V Senekowitsch M Schuster LC Lercher A Structural cells are key regulators of organ-specific immune responses Nature 2020 583 296 302 10.1038/s41586-020-2424-4 32612232 PMC7610345 56 Jiang H Kuang L Zhang T Zhao X Annexin A1-FPR1 Interaction in dendritic cells promotes immune microenvironment modulation in Thyroid Cancer Cell Biol Toxicology 2025 41 97 10.1007/s10565-025-10042-6 40483281 PMC12145322 57 Le Naour J Liu P Zhao L Adjemian S Sztupinszki Z Taieb J A TLR3 ligand reestablishes chemotherapeutic responses in the context of FPR1 deficiency Cancer Discovery 2021 11 408–23 10.1158/2159-8290.Cd-20-0465 33046534 58 Baracco EE Stoll G Van Endert P Zitvogel L Vacchelli E Kroemer G Contribution of annexin A1 to anticancer immunosurveillance Oncoimmunology 2019 8 e1647760 10.1080/2162402x.2019.1647760 32923172 PMC7457921 59 Shi N Chen S Wang D Wu T Zhang N Chen M MDK promotes M2 macrophage polarization to remodel the tumour microenvironment in clear cell renal cell carcinoma Sci Rep 2024 14 18254 10.1038/s41598-024-69183-z 39107475 PMC11303797 60 Yuan F Wang Y Yuan L Tang T Ye L Li Y EGFRvIII-positive glioblastoma contributes to immune escape and Malignant progression via the c-Fos-MDK-LRP1 axis Cell Death Disease 2025 16 453 10.1038/s41419-025-07771-1 40527884 PMC12174314 61 Riley RS June CH Langer R Mitchell MJ Delivery technologies for cancer immunotherapy Nat Rev Drug Discovery 2019 18 175–96 10.1038/s41573-018-0006-z 30622344 PMC6410566 62 Monk BJ Enomoto T Kast WM McCormack M Tan DSP Wu X Integration of immunotherapy into treatment of cervical cancer: Recent data and ongoing trials Cancer Treat Rev 2022 106 102385 10.1016/j.ctrv.2022.102385 35413489 PMC10697630 63 Allouch S Malki A Allouch A Gupta I Vranic S Al Moustafa AE High-risk HPV oncoproteins and PD-1/PD-L1 interplay in human cervical cancer: recent evidence and future directions Front Oncol 2020 10 914 10.3389/fonc.2020.00914 32695664 PMC7338567 64 Chung HC Ros W Delord JP Perets R Italiano A Shapira-Frommer R Efficacy and safety of pembrolizumab in previously treated advanced cervical cancer: results from the phase II KEYNOTE-158 study J Clin Oncol 2019 37 1470–8 10.1200/jco.18.01265 30943124 65 Lyford-Pike S Peng S Young GD Taube JM Westra WH Akpeng B Evidence for a role of the PD-1:PD-L1 pathway in immune resistance of HPV-associated head and neck squamous cell carcinoma Cancer Res 2013 73 1733–41 10.1158/0008-5472.Can-12-2384 23288508 PMC3602406 66 Borcoman E Le Tourneau C Pembrolizumab in cervical cancer: latest evidence and clinical usefulness Ther Adv Med Oncol 2017 9 431–9 10.1177/1758834017708742 28607581 PMC5455883 67 Van Coillie S Wiernicki B Xu J Molecular and cellular functions of CTLA-4 Adv Exp Med Biol 2020 1248 7 32 10.1007/978-981-15-3266-5_2 32185705 68 Hosseini A Gharibi T Marofi F Babaloo Z Baradaran B CTLA-4: From mechanism to autoimmune therapy Int Immunopharmacology 2020 80 106221 10.1016/j.intimp.2020.106221 32007707 69 John P Pulanco MC Galbo PM Jr. Wei Y Ohaegbulam KC Zheng D The immune checkpoint B7x expands tumor-infiltrating Tregs and promotes resistance to anti-CTLA-4 therapy Nat Commun 2022 13 2506 10.1038/s41467-022-30143-8 35523809 PMC9076640 70 Patel SS Weirather JL Lipschitz M Lako A Chen PH Griffin GK The microenvironmental niche in classic Hodgkin lymphoma is enriched for CTLA-4-positive T cells that are PD-1-negative Blood 2019 134 2059–69 10.1182/blood.2019002206 31697809 PMC7218752 ",
  "metadata": {
    "Title of this paper": "The microenvironmental niche in classic Hodgkin lymphoma is enriched for CTLA-4-positive T cells that are PD-1-negative",
    "Journal it was published in:": "Frontiers in Immunology",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12481161/"
  }
}