{
  "title": "Paper_1143",
  "abstract": "pmc Prev Med Rep 2904 pmedr Preventive Medicine Reports 2211-3355 Elsevier PMC12476072 PMC12476072.1 12476072 12476072 41019615 10.1016/j.pmedr.2025.103242 S2211-3355(25)00281-5 103242 1 Infectious Disease Inequalities in breast cancer incidence and mortality in women with and without disabilities in South Korea: A population-based cohort study Kang Hee-Yeon a Park Eunjung a Bui Thi Tra a Kim Byungmi a b Oh Jin-Kyoung jkoh@ncc.re.kr a b ⁎ a b ⁎ jkoh@ncc.re.kr 11 2025 12 9 2025 59 497710 103242 24 1 2025 5 9 2025 6 9 2025 12 09 2025 28 09 2025 29 09 2025 © 2025 The Authors. Published by Elsevier Inc. 2025 https://creativecommons.org/licenses/by/4.0/ This is an open access article under the CC BY license (http://creativecommons.org/licenses/by/4.0/). Objective Women with disabilities often face functional limitations and comorbidities that increase cancer risk. This study investigated breast cancer incidence and mortality among women with and without disabilities in South Korea. Methods We analyzed 2.87 million cancer-free women aged ≥30 who participated in the 2002–2003 national health screening program, linking the National Health Insurance Database, Cancer Registry, and cause-of-death records (2003–2019). Standardized incidence ratios (SIRs), standardized mortality ratios (SMRs), and mortality-to-incidence (M/I) ratios were calculated by disability status. Cox proportional hazards models with piecewise follow-up estimated adjusted hazard ratios (aHRs) for breast cancer outcomes. Results Among 296,689 women with disabilities, 3579 developed breast cancer and 465 died from it; among 2.58 million without disabilities, 46,267 developed it and 3779 died. Women with disabilities had lower incidence (SIR ratio 0.86, 95 % CI 0.83, 0.90) but comparable breast cancer-specific mortality (SMR ratio 1.00, 95 % CI 0.89, 1.13). Cox models showed consistently lower aHRs for breast cancer incidence and mortality early on, but aHRs for all-cause mortality increased over time. Conclusions Despite lower incidence, women with disabilities experienced similar breast cancer-specific mortality and higher long-term all-cause mortality. These findings underscore persistent inequalities and highlight the need for timely, equitable cancer care. Highlights • Women with disabilities had lower breast cancer incidence but comparable mortality. • They faced inequalities in screening access, diagnostic timeliness, and cancer care. • Systemic barriers may underlie these inequalities in breast cancer outcomes. Keywords Breast cancer Disability Incidence Mortality Health inequalities pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement yes pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes Abbreviations NHID National Health Information Database CCI Charlson Comorbidity Index 1 Introduction In 2021, approximately 1.3 billion people—16 % of the global population—were living with disabilities ( World Health Organization, 2022 World Health Organization, 2011 World Health Organization, 2022 Iezzoni, 2022 Bahk et al., 2022 Kuper and Heydt, 2019 Majer et al., 2011 World Health Organization, 2022 Iezzoni, 2022 World Health Organization, 2011 Among these inequalities, breast cancer presents a particular challenge for women with disabilities. Breast cancer is the most frequently diagnosed cancer and the leading cause of cancer-related death among women worldwide, accounting for 24.5 % of cases and 15.5 % of cancer deaths in 2020 ( Sung et al., 2021 Kang et al., 2023 The National Cancer Screening Program offers free or low-cost biennial mammography, yet access barriers persist for disadvantaged groups, including people with disabilities ( Kang, 2022 Andiwijaya et al., 2022 Gross et al., 2020 Iezzoni et al., 2021 Keegan et al., 2023 Previous Korean studies have examined breast cancer inequalities by income, region, and education ( Choi et al., 2018 Park et al., 2023 Shin et al., 2020 This study aimed to investigate inequalities in breast cancer incidence and mortality among women with and without disabilities in Korea between 2003 and 2019, using nationwide population-based data. 2 Methods 2.1 Data sources We used the National Health Information Database (NHID; 2002–2019), a nationwide administrative database managed by the National Health Insurance Service of Korea (approval No. NHIS-2022-1-785). The NHID covers more than 50 million Koreans under a universal, single-payer healthcare system and includes sociodemographic information, healthcare utilization data, national health screening results, and mortality records ( Seong et al., 2017 The NHID is widely used in longitudinal epidemiologic research and enables linkage to external data sources via unique personal identifiers. We linked it to the Korea Central Cancer Registry (1999–2019), which provides nationwide cancer statistics with 98.2 % completeness as of 2021 ( Park et al., 2024 Shin et al., 2005 2.2 Study design and participants We conducted a retrospective cohort study of women aged ≥30 years who participated in the general health screening program between January 1, 2002, and December 31, 2003. Of 14,005,088 eligible women, 2,894,303 (20.7 %) were screened during this period. After excluding 21,432 women with prior cancer diagnoses ( n n Fig. 1 Fig. 1 Flow chart of study participant selection in the National Health Screening Program (2002−2003). Fig. 1 2.3 Main exposure and outcomes The main exposure, disability status, was identified from the Korea National Disability Registration System (2002–2019), which is integrated into the NHID. Established in 1988, this system requires medical certification by specialists under the Act on Welfare of Persons with Disabilities ( Jeon et al., 2015 Kim et al., 2023 The primary outcome, incident breast cancer, was defined as the first diagnosis of primary invasive breast cancer (ICD-O-3 site code C50, behavior code /3) between January 1, 2003, and December 31, 2019, according to Korea Central Cancer Registry records. Carcinoma in situ (behavior code /2 or ICD-10 code D05) was excluded. Follow-up began on January 1, 2003, and continued until breast cancer diagnosis, death, or December 31, 2019, whichever occurred first, regardless of other cancer diagnoses. Breast cancer-specific mortality was defined as death with an underlying cause of breast cancer (ICD-10 C50) in Statistics Korea records. 2.4 Covariates Covariates included age group (10-year intervals); income level (quintiles based on insurance premiums); residential area (metropolitan, urban, rural); smoking status (current or not); alcohol use (≥1/week or rarely); physical activity (≥1/week or none); overweight status (BMI ≥25 kg/m 2 Charlson et al., 1987 Quan et al., 2005 2.5 Statistical analysis We calculated age- and calendar year-adjusted standardized incidence ratios (SIRs) and standardized mortality ratios (SMRs) for breast cancer by disability status using indirect standardization, with national female population rates as the reference. Data were stratified by disability status, 10-year age groups (30–39, 40–49, …, ≥80), and calendar year (2003–2019). Exact 95 % confidence intervals (CIs) were calculated assuming a Poisson distribution ( Ulm, 1990 Choi et al., 2017 Hebert et al., 2009 Wagner et al., 2012 Morris and Gardner (1988) Fig. 1 All analyses were performed using SAS Enterprise Guide 7.1 (SAS Institute Inc., Cary, NC, USA). Additional details on statistical procedures and variable definitions are provided in Supplementary Methods S1. 2.6 Ethics statement This study was approved by the Institutional Review Board of the National Cancer Center, Korea (NCC2022–0180). Informed consent was waived due to the use of de-identified secondary data. 3 Results 3.1 Study participants Of the 2,872,871 cancer-free women at baseline in 2002, 296,689 (10.3 %) developed disabilities during follow-up, while 2,576,182 (89.7 %) did not. Women with disabilities were older (mean age: 58.4 vs 49.6 years), more likely to reside in rural areas, had lower income levels, higher rates of smoking and overweight status, lower levels of physical activity, reduced breast cancer screening uptake, and greater comorbidity burdens. All differences were statistically significant ( Table 1 Table 1 General characteristics of women aged ≥30 years with and without disabilities in South Korea, 2002–2003. Table 1 Total Women Women P a n (%) n (%) n (%) Total 2,872,871 (100.0) 296,689 (100.0) 2,576,182 (100.0) Age (Mean ± SD) 50.5 ± 11.8 58.4 ± 10.1 49.6 ± 11.6 <0.0001 Age group 30–39 490,175 (17.1) 9608 (3.2) 480,567 (18.7) <0.0001 40–49 1,008,647 (35.1) 52,704 (17.8) 955,943 (37.1) 50–59 669,82 7 (23.3) 84,853 (28.6) 584,974 (22.7) 60–69 510,241 (17.8) 111,731 (37.7) 398,510 (15.5) 70–79 170,446 (5.9) 34,977 (11.8) 135,469 (5.3) ≥ 80 23,535 (0.8) 2816 (0.9) 20,719 (0.8) Income level I (Lowest) 537,671 (19.0) 56,267 (19.2) 481,404 (18.9) <0.0001 II 450,038 (15.9) 51,451 (17.6) 398,587 (15.7) III 552,085 (19.5) 59,358 (20.3) 492,727 (19.4) IV 577,801 (20.4) 55,979 (19.1) 521,822 (20.5) V (Highest) 719,812 (25.4) 69,709 (23.8) 650,103 (25.6) Residential area Metropolitan 1,564,763 (54.6) 134,117 (45.3) 1,430,646 (55.7) <0.0001 City 821,999 (28.7) 90,580 (30.6) 731,419 (28.5) Rural 479,391 (16.7) 71,190 (24.1) 408,201 (15.9) Smoking status Current smoker 78,021 (2.8) 9723 (3.4) 68,298 (2.7) <0.0001 Non-smoker 2,702,642 (97.2) 277,382 (96.6) 2,425,260 (97.3) Alcohol consumption ≥ 1 per week 209,102 (7.4) 16,811 (5.8) 192,291 (7.6) <0.0001 Rarely 2,601,845 (92.6) 272,233 (94.2) 2,329,612 (92.4) Physical activity None 1,902,001 (68.0) 209,787 (72.8) 1,692,214 (67.5) <0.0001 ≥ 1 per week 893,352 (32.0) 78,421 (27.2) 814,931 (32.5) Overweight Yes 900,151 (31.4) 131,939 (44.5) 768,212 (29.9) <0.0001 (BMI ≥ 25 kg/m 2 No 1,969,791 (68.6) 164,385 (55.5) 1,805,406 (70.2) CCI 0 1,435,514 (50.0) 104,294 (35.2) 1,331,220 (51.7) <0.0001 1–2 1,216,340 (42.3) 145,645 (49.1) 1,070,695 (41.6) ≥ 3 221,017 (7.7) 46,750 (15.8) 174,267 (6.8) Breast cancer Screening (≥ 1) Ever 2,653,736 (92.4) 266,179 (89.6) 2,387,557 (92.5) <0.0001 (2002–2019) b Never 219,135 (7.6) 30,510 (10.4) 188,625 (7.5) Breast cancer diagnosis Ever 49,846 (1.7) 3579 (1.2) 46,267 (1.8) <0.0001 (2003–2019) b Never 2,823,025 (98.3) 293,110 (98.8) 2,529,915 (98.2) Age at death (Mean ± SD) b 77.0 ± 11.4 77.3 ± 9.7 76.9 ± 11.8 <0.0001 Death (2003–2019) b Death 285,017 (9.9) 61,927 (20.9) 223,090 (8.7) <0.0001 Survival 2,587,854 (90.1) 234,762 (79.1) 2,353,092 (91.3) Causes of death Breast cancer death 4244 (0.2) 465 (0.2) 3779 (0.2) <0.0001 (2003–2019) c Other death 280,773 (9.8) 61,462 (20.7) 219,311 (8.5) Survival 2,587,854 (90.1) 234,762 (79.1) 2,353,092 (91.3) Abbreviations: All variables are from baseline (2002–2003) unless otherwise noted. a t b 3.2 Standardized incidence and mortality ratios We observed 4,718,046 person-years for women with disabilities and 42,380,085 person-years for women without, with mean follow-up durations of 16.4 and 15.8 years, respectively. Between 2003 and 2019, 3579 women with disabilities and 46,267 without developed breast cancer, resulting in 465 and 3779 breast cancer-specific deaths, respectively. Compared with the general population, women with disabilities had 12 % lower breast cancer incidence and 41 % lower breast cancer-specific mortality (SIR 0.88 [95 % CI 0.85, 0.91]; SMR 0.59 [95 % CI 0.53, 0.64]) ( Fig. 2 Fig. 2 Standardized incidence ratios and standardized mortality ratios of breast cancer, and rate ratios by disability status, Korea, 2003–2019. (A) Standardized incidence and mortality of breast cancer, (B) Breast cancer incidence after disability registration and breast cancer mortality. Notes: Fig. 2 Among women diagnosed with breast cancer after disability registration, both incidence and mortality were further reduced (SIR 0.64 [95 % CI, 0.62, 0.67]; SMR 0.44 [95 % CI 0.39, 0.48]); however, the M/I ratio remained elevated (1.19 [95 % CI 1.09, 1.29]) ( Fig. 2 3.3 Differences in breast cancer outcomes and all-cause mortality by disability status Among 2,695,095 women with complete data, 45,872 developed breast cancer and 266,328 died, including 3845 from breast cancer specifically. The mean follow-up was 16.2 years for breast cancer incidence and 16.4 years for both breast cancer-specific and all-cause mortality. Disability was consistently associated with lower breast cancer incidence across all follow-up intervals, with adjusted HRs (aHRs) of 0.30 (95 % CI 0.27, 0.33) for 0–<60 months, 0.64 (95 % CI 0.59, 0.69) for 60–<120 months, and 0.84 (95 % CI 0.79, 0.89) for ≥120 months ( Fig. 3 Fig. 3 Adjusted hazard ratios for breast cancer incidence, breast cancer-specific mortality, and all-cause mortality among Korean women with and without disabilities within three follow-up intervals. (A) Breast cancer incidence, (B) Breast cancer mortality, (C) All-cause mortality. Notes: 2 Fig. 3 Breast cancer-specific mortality was also lower among women with disabilities, with aHRs of 0.33 (95 % CI 0.23, 0.48), 0.64 (95 % CI 0.52, 0.79), and 0.82 (95 % CI 0.71, 0.96) across the same intervals ( Fig. 3 By contrast, all-cause mortality was initially lower (aHR 0.60 [95 % CI 0.58, 0.62]) but increased over time (1.19 [95 % CI 1.17, 1.21] and 1.38 [95 % 1.37, 1.40]), indicating a shift from a protective to adverse effect ( Fig. 3 4 Discussion Women with disabilities had lower breast cancer incidence but similar mortality compared with those without, resulting in slightly higher M/I ratios. This suggests potential inequalities in the quality or timeliness of cancer care after diagnosis. The lower incidence was more pronounced among women with preexisting disabilities. Previous studies have reported mixed findings depending on disability type and setting ( Iezzoni, 2022 Iezzoni et al., 2021 Parish et al., 2013 Satge et al., 2020 Iezzoni et al., 2021 Satge et al., 2020 Disability was associated with persistently lower breast cancer incidence and breast cancer-specific mortality across follow-up intervals. Adjusted HRs showed that incidence and mortality hazards were substantially reduced during the early follow-up period and remained lower over time. In contrast, all-cause mortality, initially lower (suggesting a protective effect of disability), increased significantly over time, eventually surpassing that of women without disabilities. These divergent trends may reflect competing risks or underlying conditions related to disabilities. Women with disabilities in our study had 3.06 times higher odds of dying from non-breast cancer causes than from breast cancer, relative to women without disabilities (crude OR = 3.06). This highlights the need for further research into competing mortality risks and the broader chronic disease burden in this population. Factors related to breast cancer screening accessibility were strongly associated with breast cancer incidence, particularly in the early follow-up period (0–<60 months). Never having undergone screening showed the strongest association (aHR 17.41), which diminished to aHR 2.05 at 60–<120 months and 1.15 at ≥120 months. This pattern likely reflects the detection of prevalent cases among screened individuals, with the introduction of the National Cancer Screening Program creating an immediate surge in diagnostic opportunities for pre-existing asymptomatic cancers. The effect subsequently attenuated as these cases were censored from later analyses. Residing in metropolitan areas, where access to healthcare services is typically better, also showed strong associations. Bioclinical factors, such as overweight status, smoking, alcohol consumption, and engaging in regular physical activity (≥1 time per week), were associated with higher breast cancer incidence (Supplementary Table S4). Notably, sociodemographic, behavioral, and clinical factors—including lower income level, smoking, overweight status, and comorbidities—were consistently associated with higher breast cancer-specific mortality and all-cause mortality. While disability and rural residence were associated with both breast cancer incidence and mortality, lower income was particularly linked to increased breast cancer mortality despite lower incidence. This suggests inequalities in the timeliness or effectiveness of treatment and underscores the critical role of income in shaping prognosis. Contrary to the patterns observed for breast cancer incidence and mortality, disability and rural residence showed reversed associations with all-cause mortality, and income level had an inverse association with breast cancer incidence but not with breast cancer mortality. These findings may reflect inequalities in cancer detection and management, particularly regarding screening and diagnostic access. All-cause mortality appeared to be primarily driven by poorer overall health, socioeconomic disadvantage, and clinical vulnerability—including disability status, low income, and unfavorable health behaviors. Persistent inequalities in cancer care access and outcomes among people with disabilities have been documented globally ( Iezzoni, 2022 Edwards et al., 2020 Iezzoni, 2022 Agaronnik et al., 2021 Iezzoni, 2022 Edwards et al., 2020 Seo et al., 2021 Agaronnik et al., 2022 In Korea, efforts to address these challenges remain limited. The National Cancer Screening Program recommends biennial mammography for women aged ≥40, offered either free of charge or with a 10 % copayment (approximately USD 3.50), depending on income level ( Lee et al., 2025 Shin et al., 2020 Kang et al., 2024 Shin et al., 2020 The Disability-Friendly General Medical Examination Program, introduced in 2017 under the Act on Guarantee of the Right to Health and Access to Medical Services for Persons with Disabilities, aims to improve access to general medical examinations for individuals with disabilities. However, coverage remains limited: as of 2021, fewer than 100 designated medical institutions were available, and access was restricted to officially registered individuals ( National Rehabilitation Center, 2024 This study had several limitations. First, the study population comprised women who voluntarily participated in the National Health Screening Program, representing about 20.7 % of Korean women. These participants may have been more health-conscious and better resourced than the general population, potentially underestimating both breast cancer incidence and related inequalities. Second, disability status was analyzed without accounting for disability type or severity due to data limitations. Future research should explore these differences to identify target populations for intervention. Third, we relied on the first year of disability registration as a proxy for disability onset, which may not fully capture the true duration of disability exposure. Finally, the temporal relationship between disability onset and cancer diagnosis could not be firmly established, limiting causal inferences. 5 Conclusion Our findings underscore persistent inequalities in breast cancer outcomes among women with disabilities in Korea, despite lower incidence. These inequities appear to stem from delayed screening, later diagnosis, and systemic barriers to cancer care. Addressing these gaps requires policy measures that ensure equitable access throughout the cancer care continuum, including prevention, early detection, treatment, and survivorship. Future research should prioritize the design, implementation, and evaluation of disability-inclusive interventions and examine the role of disability type and severity in shaping cancer outcomes. CRediT authorship contribution statement Hee-Yeon Kang: Eunjung Park: Thi Tra Bui: Byungmi Kim: Jin-Kyoung Oh: Funding This study was supported by the 10.13039/100008746 National Cancer Center, Republic of Korea NCC-2210862 NCC-2310652 Declaration of competing interest The authors declare that they have no known competing financial interests or personal relationships that could have appeared to influence the work reported in this paper. References Agaronnik N. El-Jawahri A. Iezzoni L. Implications of physical access barriers for breast cancer diagnosis and treatment in women with mobility disability J. Disabil Policy Stud. 33 2022 46 54 10.1177/10442073211010124 35875606 PMC9307057 Agaronnik N.D. El-Jawahri A. Iezzoni L.I. Perspectives of patients with pre-existing mobility disability on the process of diagnosing their cancer J. Gen. Intern. Med. 36 2021 1250 1257 10.1007/s11606-020-06327-7 33205226 PMC8131437 Andiwijaya F.R. Davey C. Bessame K. Ndong A. Kuper H. Disability and participation in breast and cervical cancer screening: a systematic review and meta-analysis Int. J. Environ. Res. Public Health 19 2022 10.3390/ijerph19159465 PMC9368105 35954824 Bahk J. Kang H.Y. Khang Y.H. Disability type-specific mortality patterns and life expectancy among disabled people in South Korea using 10-year combined data between 2008 and 2017 Prev. Med. Rep. 29 2022 101958 10.1016/j.pmedr.2022.101958 PMC9501987 36161125 Charlson M.E. Pompei P. Ales K.L. MacKenzie C.R. A new method of classifying prognostic comorbidity in longitudinal studies: development and validation J. Chronic. Dis. 40 1987 373 383 10.1016/0021-9681(87)90171-8 3558716 Choi E. Lee S. Nhung B.C. Suh M. Park B. Jun J.K. Choi K.S. Cancer mortality-to-incidence ratio as an indicator of cancer management outcomes in Organization for Economic Cooperation and Development countries Epidemiol. Health 39 2017 e2017006 10.4178/epih.e2017006 PMC5434228 28171715 Choi E. Lee Y.Y. Suh M. Lee E.Y. Mai T.T.X. Ki M. Oh J.K. Cho H. Park B. Socioeconomic inequalities in cervical and breast cancer screening among women in Korea, 2005–2015 Yonsei Med. J. 59 2018 1026 1033 10.3349/ymj.2018.59.9.1026 30328316 PMC6192888 Edwards D.J. Sakellariou D. Anstey S. Barriers to, and facilitators of, access to cancer services and experiences of cancer care for adults with a physical disability: a mixed methods systematic review Disabil. Health J. 13 2020 100844 10.1016/j.dhjo.2019.100844 31668781 Gross S.E. Pfaff H. Swora M. Ansmann L. Albert U.S. Gross-Kunkel A. Health disparities among breast cancer patients with/without disabilities in Germany Disabil. Health J. 13 2020 100873 10.1016/j.dhjo.2019.100873 31780299 Hebert J.R. Daguise V.G. Hurley D.M. Wilkerson R.C. Mosley C.M. Adams S.A. Puett R. Burch J.B. Steck S.E. Mapping cancer mortality-to-incidence ratios to illustrate racial and sex disparities in a high-risk population Cancer 115 2009 2539 2552 10.1002/cncr.24270 19296515 PMC2688832 Iezzoni L.I. Cancer detection, diagnosis, and treatment for adults with disabilities Lancet Oncol. 23 2022 e164 e173 10.1016/S1470-2045(22)00018-3 35358465 Iezzoni L.I. Rao S.R. Agaronnik N.D. El-Jawahri A. Associations between disability and breast or cervical cancers, accounting for screening disparities Med. Care 59 2021 139 147 10.1097/MLR.0000000000001449 33201087 PMC7855335 Jeon B. Kwon S. Kim H. Health care utilization by people with disabilities: a longitudinal analysis of the Korea Welfare Panel Study (KoWePS) Disabil. Health J. 8 2015 353 362 10.1016/j.dhjo.2015.01.001 25812476 Kang E. Choi K.S. Jun J.K. Kim Y. Lee H.J. Choi C.K. Kim T.H. Lee S.H. Suh M. Trends in Cancer-screening rates in Korea: findings from the National Cancer Screening Survey, 2004–2023 Cancer Res. Treat. 57 2024 28 38 10.4143/crt.2024.325 39091146 PMC11729312 Kang H.T. Current status of the National Health Screening Programs in South Korea Korean J. Fam. Med. 43 2022 168 173 10.4082/kjfm.22.0052 35610963 PMC9136500 Kang M.J. Jung K.-W. Bang S.H. Choi S.H. Park E.H. Yun E.H. Kim H.-J. Kong H.-J. Im J.-S. Cancer statistics in Korea: incidence, mortality, survival, and prevalence in 2020 Cancer Res. Treat. 55 2023 385 399 10.4143/crt.2023.447 36915245 PMC10101796 Keegan G. Rizzo J.R. Joseph K.A. Disparities in breast cancer among patients with disabilities: care gaps, accessibility, and best practices J. Natl. Cancer Inst. 115 2023 1139 1144 10.1093/jnci/djad130 37421404 Kim M. Jung W. Kim S.Y. Park J.H. Shin D.W. The Korea National Disability Registration System Epidemiol. Health 45 2023 e2023053 10.4178/epih.e2023053 PMC10482564 37189275 Kuper H. Heydt P. The Missing Billion: Access to Health Services for 1 Billion People with Disabilities 2019 London School of Hygiene and Tropical Medicine London Lee K. Suh M. Choi K.S. Current status of the National Cancer Screening Program in Korea: history, achievements, and future directions J. Prev. Med. Public Health 58 2025 337 347 10.3961/jpmph.25.268 40575987 PMC12332392 Majer I.M. Nusselder W.J. Mackenbach J.P. Klijs B. van Baal P.H. Mortality risk associated with disability: a population-based record linkage study Am. J. Public Health 101 2011 e9 15 10.2105/AJPH.2011.300361 PMC3222426 22021307 Morris J.A. Gardner M.J. Calculating confidence intervals for relative risks (odds ratios) and standardised ratios and rates Br. Med. J. (Clin. Res. Ed) 296 1988 1313 1316 10.1136/bmj.296.6632.1313 PMC2545775 3133061 National Rehabilitation Center, Disability-Friendly General Medical Examination Program. https://www.nrc.go.kr/eng/html/content.do?depth=n_cc&menu_cd=03_08 Parish S.L. Swaine J.G. Son E. Luken K. Receipt of mammography among women with intellectual disabilities: medical record data indicate substantial disparities for African American women Disabil. Health J. 6 2013 36 42 10.1016/j.dhjo.2012.08.004 23260609 Park E.H. Kang M.J. Jung K.W. Park E.H. Yun E.H. Kim H.J. Kong H.J. Choi C.K. Im J.S. Regional disparities in major cancer incidence in Korea, 1999-2018 Epidemiol Health 45 2023 e2023089 10.4178/epih.e2023089 PMC10867526 37857340 Park E.H. Jung K.W. Park N.J. Kang M.J. Yun E.H. Kim H.J. Kim J.E. Kong H.J. Im J.S. Cancer statistics in Korea: incidence, mortality, survival, and prevalence in 2021 Cancer Res. Treat. 56 2024 357 371 10.4143/crt.2024.253 38487832 PMC11016640 Quan H. Sundararajan V. Halfon P. Fong A. Burnand B. Luthi J.C. Saunders L.D. Beck C.A. Feasby T.E. Coding algorithms for defining comorbidities in ICD-9-CM and ICD-10 administrative data Med. Care. 43 2005 1130 1139 10.1097/01.mlr.0000182534.19832.83 16224307 Satge D. Axmon A. Tretarre B. Sandberg M. Ahlstrom G. Cancer diagnoses among older people with intellectual disability compared with the general population: a national register study J. Intellect Disabil. Res. 64 2020 579 588 10.1111/jir.12734 32395851 Seo J.Y. Shin D.W. Yu S.J. Jung J.H. Han K. Cho I.Y. Kim S.Y. Choi K.S. Park J.H. Disparities in liver cancer surveillance among people with disabilities: a national database study in Korea J. Clin. Gastroenterol. 55 2021 439 448 10.1097/MCG.0000000000001405 32889960 Seong S.S. Kim Y.Y. Khang Y.H. Park J.H. Kang H.J. Lee H. Do C.H. Song J.S. Hyon Bang J. Data resource profile: the National Health Information Database of the National Health Insurance Service in South Korea Int. J. Epidemiol. 46 2017 799 800 10.1093/ije/dyw253 27794523 PMC5837262 Shin D.W. Yu J. Cho J. Lee S.K. Jung J.H. Han K. Kim S.Y. Yoo J.E. Yeob K.E. Breast cancer screening disparities between women with and without disabilities: a national database study in South Korea Cancer 126 2020 1522 1529 10.1002/cncr.32693 31904881 Shin H.R. Won Y.J. Jung K.W. Kong H.J. Yim S.H. Lee J.K. Noh H.I. Lee J.K. Pisani P. Nationwide cancer incidence in Korea, 1999∼2001; first result using the national cancer incidence database Cancer Res. Treat. 37 2005 325 331 10.4143/crt.2005.37.6.325 19956367 PMC2785938 Sung H. Ferlay J. Siegel R.L. Laversanne M. Soerjomataram I. Jemal A. Bray F. Global cancer statistics 2020: GLOBOCAN estimates of incidence and mortality worldwide for 36 cancers in 185 countries CA Cancer J Clin. 71 2021 209 249 10.3322/caac.21660 33538338 Ulm K. A simple method to calculate the confidence interval of a standardized mortality ratio (SMR) Am. J. Epidemiol. 131 1990 373 375 10.1093/oxfordjournals.aje.a115507 2296988 Wagner S.E. Hurley D.M. Hebert J.R. McNamara C. Bayakly A.R. Vena J.E. Cancer mortality-to-incidence ratios in Georgia: describing racial cancer disparities and potential geographic determinants Cancer 118 2012 4032 4045 10.1002/cncr.26728 22294294 PMC3342438 World Health Organization World Report on Disability 2011 WHO Press World Health Organization, Geneva World Health Organization Global Report on Health Equity for Persons with Disabilities 2022 WHO Press World Health Organization, Geneva Appendix A Supplementary data  Supplementary material Image 1 Data availability The data used in this study (NHIS-2022-1-785) were provided by the National Health Insurance Service (NHIS) of Korea with permission from the National Health Insurance Data Review Committee ( http://nhiss.nhis.or.kr Appendix A Supplementary data to this article can be found online at https://doi.org/10.1016/j.pmedr.2025.103242 ",
  "metadata": {
    "Title of this paper": "Cancer mortality-to-incidence ratios in Georgia: describing racial cancer disparities and potential geographic determinants",
    "Journal it was published in:": "Preventive Medicine Reports",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12476072/"
  }
}