{
  "title": "Paper_1120",
  "abstract": "pmc PeerJ PeerJ 2057 peerj peerj PeerJ 2167-8359 PeerJ, Inc PMC12476862 PMC12476862.1 12476862 12476862 41025051 10.7717/peerj.20069 20069 1 Gynecology and Obstetrics Women’s Health Establishment and verification of a nomogram model based on the inflammatory indicators of patients with cervical cancer for predicting the risk of their lymph node metastasis Song Liyun hehe271565227@126.com Qin Kaiyun Bai Suning Wu Qi Zhao Jing Qi Jie Zhang Junmei Wang Yazhuo Zhang Yuan Xu Ren  Department of Gynecology, Hebei General Hospital, Hebei Medical University Shijiazhuang Hebei China Upadhyay Rohit 25 9 2025 2025 13 478561 e20069 7 5 2025 21 8 2025 25 09 2025 29 09 2025 30 09 2025 ©2025 Song et al. 2025 Song et al. https://creativecommons.org/licenses/by/4.0/ This is an open access article distributed under the terms of the Creative Commons Attribution License Based on inflammatory indicators, this study aimed to predict the risk of lymph node metastasis (LNM) in patients with cervical squamous cell carcinoma (CSCC) and establish a predictive nomogram model. Methods This retrospective study analyzed the clinical data of 194 patients with stage IA2-IIA2 who underwent surgery at Hebei General Hospital (between January 2017 and August 2023). Patients were divided into two groups based on the presence of LNM or not. Clinical data of the participants were gathered and analyzed to compare the two groups. Logistic regression analysis was used to analyze the factors influencing LNM in patients with CSCC. R software was used to construct a nomogram model to predict LNM in patients with CSCC, and its accuracy was verified. Results Squamous cell carcinoma antigen (SCC-Ag) level, D-dimer level, platelet (PLT) count, and platelet-to-lymphocyte ratio (PLR) index were significantly higher in patients with LNM than in those without LNM ( P P P P P Conclusion Establishing a nomogram model based on preoperative inflammatory indicators of patients with CSCC can accurately predict the risk of LNM, providing evidence for implementing a clinical diagnosis and treatment scheme. Cervical squamous cell carcinoma Lymph node metastasis Inflammatory indicator Lymphatic vascular space invasion Nomogram model Prediction The authors received no funding for this work. pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement yes pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes Introduction Cervical cancer (CC) is one of the most common gynecological malignancies in women worldwide and one of the major causes of cancer-related deaths in women. Approximately 604,000 new cases of CC are diagnosed every year, and CC causes approximately 341,000 deaths annually worldwide ( Sung et al., 2021 Li, Wu & Cheng, 2016 Levy et al., 2009 CC metastasis can be classified into direct extension, spread through the lymphatic system, and spread through the bloodstream. Lymph node metastasis (LNM) is one of the most important prognostic factors for CC. Although the vast majority of women with early-stage CC have a favorable prognosis, those with LNM are at a higher risk of relapse and mortality ( Huang & Fang, 2018 Matsuo et al., 2019 Carlson et al., 2016 Shah et al., 2011 Despite the potential benefits of pelvic lymphadenectomy in improving the long-term survival of CC patients with LNM, the decision to undergo an extensive lymphadenectomy may come with risks of unnecessary complications like blood vessel injuries, nerve injuries, infection, lymphocytes, and lymphedema ( Khatun et al., 2017 Obrzut et al., 2017 Barquet-Muñoz et al., 2017 Imaging technology is commonly utilized to evaluate LNM in CC patients. Nevertheless, preoperative tests such as endoscopic ultrasonography and computed tomography (CT) do not provide precise LNM assessments ( Togami et al., 2014 Martínez et al., 2013 Liu, Gao & Li, 2017 Tumor metastasis through lymphatic vessels typically begins at the sentinel lymph node (SLN), which is important for the diagnosis and treatment of diseases. Evidence suggests that SLN biopsy can be used for lymph node staging in patients with early CC. In a study by Wydra et al. (2006) Huang & Fang, 2018 Cibula & McCluggage, 2019 Cibula et al., 2020 Zhang et al., 2021 Lecuru et al., 2019 Bizzarri et al., 2021 Mounting evidence indicates a correlation between nutritional status, inflammation, and survival rates in different types of cancer. Many studies have demonstrated that various factors, such as nutritional markers and inflammation levels, can predict the prognosis of various types of tumors ( Kim et al., 2021 Bullock et al., 2020 Wang et al., 2021 Kumarasamy et al., 2019 Nomograms are prevalent prognostic tools in oncology and medicine, valued for generating individualized numerical probabilities of clinical events by combining multiple prognostic and determinant variables ( Balachandran et al., 2015 Balachandran et al., 2015 The objective of this study was to identify independent predictors of inflammatory markers and to establish and validate a nomogram to predict the risk of LNM in patients with cervical squamous cell carcinoma (CSCC). Using the nomogram, patients at low risk for LNM can be identified, helping to determine the necessity for adjunctive therapy and predict prognosis. Materials and Methods Inclusion and exclusion criteria This study retrospectively included 194 patients with CSCC who underwent surgery at Hebei General Hospital between January 1, 2017, and August 1, 2023. The Ethics Committee of Hebei General Hospital approved this study in accordance with the Declaration of Helsinki. The time when data were accessed for research purposes was 10/5/2024. The inclusion criteria were as follows: (1) all necessary information regarding the patient’s age, medical history, previous treatment, and other basic clinical details is complete; (2) pathologically confirmed primary SCC of the uterine cervix, a clinical diagnosis of International Federation of Gynecology and Obstetrics (FIGO) stage IA2-IIA2 disease; (3) all patients underwent radical hysterectomy with/without oophorectomy with pelvic lymphadenectomy with/without para-aortic lymphadenectomy. Exclusion criteria: (1) other types of CC other than CSCC; (2) patients who had not undergone pelvic lymphadenectomy; (3) patients missing complete clinical and pathological records; (4) patients with tumors spread to the peritoneum or distant metastatic sites; (5) patients with other diagnoses of cancer; (6) patients with other benign disorders affecting serum SCC-Ag; (7) patients with infectious diseases, autoimmune conditions, severe liver or kidney issues, thrombotic disorders, pregnancy, or preexisting blood disorders. Clinical and laboratory data collection Clinical information, LNM status, and preoperative hematological data were collected for all patients. Clinical information included patient age, FIGO stage, body mass index (BMI), hypertension, and diabetes mellitus. The pathological features mainly included the lymph vascular space invasion (LVSI) and LNM. One week before treatment, the following hematological parameters were obtained: albumin, fibrinogen, neutrophil count, monocyte count, platelet count, lymphocyte count, D-dimer level, and SCC-Ag level. The combination of ultrasound, MR, and CT scans, along with an enhancement scan, helps to assess local tumor infiltration, evaluate the spread of retroperitoneal lymph nodes, and detect distant metastases. Positron emission tomography/computed tomography (PET-CT) can be used to rule out metastatic diseases. Two senior pathologists reviewed the pathological examinations, and the Ethics Committee of Hebei General Hospital approved the collection of the patients’ clinical and laboratory data, following the Declaration of Helsinki. The ethical committee’s conclusion that informed consent was not necessary meant that written informed consent was no longer necessary. The patient information was de-identified. This retrospective study adhered to the STROBE guidelines ( Von Elm et al., 2007 Inflammation-related markers The following formula was used for serum inflammation-related markers: FAR = fibrinogen (g/L)/albumin (g/L); PNI = albumin (g/L) + 5 × lymphocyte count (10 9 9 9 9 9 9 9 9 9 9 Statistical analysis Data analysis was performed using IBM SPSS V26.0 (IBM Corp., Armonk, NY, USA), GraphPad Prism 9.0 (GraphPad Software, Inc., La Jolla, CA, USA), and the R Environment for Statistical Computing software. A P U Key parameters were analyzed using univariate and multivariate logistic regression analyses to develop a nomogram that can predict pelvic LNM. Calibration curves were plotted and assessed based on the agreement between predictions and observations, and the Hosmer–Lemeshow goodness-of-fit test was performed. A bootstrap procedure with 10,000 resamples was conducted to internally validate the nomograms. The developed model was characterized based on area under the curve (AUC) and ROC. Results Baseline information of SCC patients The clinical data of 194 patients who had initially been diagnosed with CSCC and treated surgically in the hospital from January 1, 2017, to August 1, 2023, were included in this retrospective study. There were 15 patients with stage IA2, 52 with stage IB1, 50 with stage IB2, 22 with stage IB3, 34 with stage IIA1, and 21 with stage IIA2. Of the 194 patients with CSCC included in this study, 139 (71.65%) had FIGO stage I. These patients were divided into two groups based on LNM: the group with LNM confirmed by pathological examination (presence of LMN, n n Table 1 Huang & Fang, 2018 Kwon et al., 2018 10.7717/peerj.20069/table-1 Table 1 Baseline characteristics of patients with SCC. Variables Lymph node positive ( n Lymph node negative ( n (Mann– Whitney U) Z/ x 2 P Age (years, Median (IQR)) 56 (15) 53 (17) −0.169 0.866 BMI (kg/m 2 24.82 (5.28) 25.07 (4.48) −0.946 0.344 Diabetes, n (%) 4 (10.81) 23 (14.65) 0.368 0.544 Hypertension, n (%) 10 (27.03) 40 (25.48) 0.038 0.846 LVSI, n (%) 26 (70.27) 57 (36.31) 14.111 <0.001 SCC-Ag (ng/ml, Median (IQR)) 8.78 (12.13) 2.86 (5.75) −3.793 <0.001 N (10 9 4.17 (2.26) 3.96 (1.94) −0.739 0.460 L (10 9 1.70 (0.86) 1.62 (0.66) −0.381 0.703 M (10 9 0.30 (0.14) 0.27 (0.11) −0.989 0.323 PLT (10 9 274.00 (81.00) 248.00 (84.00) −2.570 0.010 SII (10 9 638.24 (688.36) 575.56 (417.47) −1.912 0.056 NLR, Median (IQR) 2.47 (1.64) 2.28 (1.52) −0.985 0.325 PLR, Median (IQR) 165.95 (129.81) 148.53 (74.93) −2.116 0.034 MLR, Median (IQR) 2.47 (1.64) 2.28 (1.52) −0.985 0.325 FAR, Median (IQR) 0.07 (0.03) 0.07 (0.02) −1.024 0.306 PNI, Median (IQR) 51.98 (6.30) 50.45 (5.50) −0.096 0.924 D-Dimer (mg/L) 0.37 (0.31) 0.29 (0.29) −2.819 <0.001  Notes.  N absolute neutrophil count L absolute lymphocyte count M monocyte count PLT blood platelet count SII platelet count (10 9 9 9 NLR neutrophil count (10 9 9 PLR platelet count (10 9 9 MLR monocyte count (10 9 9 FAR fibrinogen(g/L)/albumin(g/L) PNI albumin (g/L) + 5 × lymphocyte count (10 9 The age range of the lymph-positive CSCC patients was 31–70 years, and that of the lymph-negative patients was 28–78 years. Age did not differ significantly between the two groups. Table 1 P P P P P P P P P P P P P 10.7717/peerj.20069/fig-1 Figure 1 Receiver operating characteristic curves for the use of SCC-Ag, PLT, PLR, and D-Dimer to predict LNM of SCC patients in stage IA2-IIA2. SCC-Ag, squamous cell carcinoma antigen; PLT, platelet; PLR, platelet-to-lymphocyte ratio; LNM, lymph node metastasis. We created ROC curves by analyzing the connection between SCC-Ag, PLT, PLR, D-dimer, and LNM in CSCC. We determined the optimal cut-off value, sensitivity, and specificity ( Fig. 1 Table 2 P P P P Univariate and multivariate predictors for LNM Independent risk factors linked to LNM occurrence were determined using univariate and multivariate logistic regression analyses. In univariate analysis, positive LVSI, serum SCC-Ag ≥5.63 ng/ml, PLT≥207 × 109/L, and PLR ≥248.739 were associated with pelvic LNM in CSCC. Multivariate logistic analysis revealed that the following parameters were independent factors for pelvic LNM: LVSI (odds ratio (OR) = 6.182, 95% confidence interval (CI) [2.463–15.513], P P P Table 3 Construction and validation of the nomogram model for predicting pelvic LNM This study eliminated non-significant variables to create a high-performing association model with strong predictive capabilities. Using the results of the abovementioned multivariate analysis, a nomogram was formulated to estimate LNM, incorporating serum SCC-Ag, LVSI, and PLR. This nomogram enabled the evaluation of LNM risk for individual patients, highlighting the impact of each risk factor on the overall risk of lymph node metastasis ( Fig. 2 The concordance index (C-index) is a generalization of the area under the ROC curve. It quantifies the ability to distinguish low- and high-risk patients (an utterly random prediction had a C-index of 0.5, and a perfect rule had a C-index of 1.0). It was almost equal to the AUC of the ROC curve, which plotted the sensitivity against 1—specificity to predict the outcome ( Fig. 3 10.7717/peerj.20069/table-2 Table 2 Cut-off value and diagnostic value of SCC-Ag, PLT, PLR, and D-Dimer. Variables AUC Cut-off 95%CI P Sensitivity (%) Specificity (%) SCC-Ag 0.705 5.631 0.635–0.769 <0.001 68.6 70.1 PLT 0.636 207 0.564- 0.704 0.004 97.30 26.11 PLR 0.612 248.739 0.539–0.681 0.039 27.03 94.27 D-Dimer 0.651 0.27 0.579–0.718 0.001 86.11 46.50  Notes.  PLT blood platelet count PLR platelet count (10 9 9 AUC area under the curve CI confidence interval 10.7717/peerj.20069/table-3 Table 3 Univariate and multivariate logistic regression analyses of variables. Variable Character Univariate Multivariate OR (95% CI) p OR (95% CI) p LVSI Absent 1.0 (Reference) <0.001 Reference <0.001 Present 4.147 (1.908–9.013) 6.182 (2.463–15.513) SCC-Ag (ng/ml) <5.631 1.0 (Reference) 0.003 Reference 0.001 ≥5.631 1.039 (1.013–1.066) 1.047 (1.018–1.078) PLT (10 9 <207 1.0 (Reference) 0.013 Reference 0.271 ≥207 1.008 (1.002–1.014) 1.004 (0.997–1.012) PLR <248.739 1.0 (Reference) 0.005 Reference 0.021 ≥248.739 1.008 (1.002–1.013) 1.008 (1.001–1.014) D-Dimer (mg/L) <0.27 1.0 (Reference) 0.237 ≥0.27 1.108 (0.935–1.314)  Notes.  LVSI lymph vascular space invasion PLT blood platelet count PLR platelet count (10 9 9 CI confidence interval 10.7717/peerj.20069/fig-2 Figure 2 Nomogram predicting the risk of lymph node metastasis in early-stage cervical cancer patients. SCC-Ag, squamous cell carcinoma antigen; LVSI, lymph vascular space invasion; PLR, platelet-to- lymphocyte ratio; LNM Risk, lymph node metastasis risk. 10.7717/peerj.20069/fig-3 Figure 3 ROC curve of the developed model. ROC, operating characteristic curve; AUC, greater area under the ROC curve. By comparing the nomogram with an ideal curve, we developed a calibration curve that displayed a high level of agreement between the predicted and observed results in the calibration plot ( Fig. 4 p 10.7717/peerj.20069/fig-4 Figure 4 Internal verification plots of the nomogram calibration curves by 10-fold cross-validation. Discussion CC screening programs have contributed to worldwide growth in the early detection of CC ( Cohen et al., 2019 Sturgeon et al., 2010 Nanthamongkolkul & Hanprasertpong, 2018 Sakuragi, 2007 Aslan et al., 2020 Wang et al., 2020 Huang & Fang, 2018 Kwon et al., 2018 Xie et al., 2018 In recent years, there has been a significant focus on the preoperative evaluation of LNM. Typically, CT or magnetic resonance imaging (MRI) is utilized to assess LNM in patients with CC, focusing primarily on lymph node size ( Lee & Atri, 2019 Liu et al., 2021 Bogani et al., 2024 Cibula & McCluggage (2019) Cibula & McCluggage, 2019 Cibula et al., 2020 Lecuru et al., 2019 Nomograms are a pictorial representation of a complex mathematical formula ( Grimes, 2008 Kim et al. (2014) Inflammation is a vital characteristic of the tumor microenvironment and plays a central role in tumor initiation, promotion, progression, invasion, and metastasis ( Grivennikov, Greten & Karin, 2010 Arneth, 2019 Kulbe et al., 2012 Sasahara et al., 2020 Yoshida et al., 2019 Ryan et al., 2009 Recent research has revealed that various factors, such as nutritional and inflammatory markers, can predict the outcome of diverse types of cancer. In this study, we aimed to identify independent prediction parameters from inflammatory parameters and to establish and validate a nomogram to predict the risk of lymph node metastasis in patients with cervical cancer. Utilizing the nomogram makes it possible to identify patients who are unlikely to have LNM, thus aiding in decisions regarding the need for additional therapy and prognosis determination. Our study examined the diagnostic utility of albumin, fibrinogen, neutrophil count, monocyte count, platelet count, lymphocyte count, D-dimer, SCC-Ag, and six inflammatory-nutritional markers (PNI, NLR, PLR, MLR, SII, and FAR) in patients with early-stage SCC with LNM. The values of SCC-Ag, PLT, PLR, and D-dimer were significantly higher in patients with LNM than in those without LNM ( P P P P P P SCC-Ag acts as an indicator of CC and plays a role in predicting and determining the prognosis of CSCC ( Kato & Torigoe, 1977 Zhu et al. (2021) Lin et al. (2000) Cheng et al., 2017 Haemmerle et al., 2018 Wang et al. Wang et al., 2017 Ding et al., 2010 Ye et al., 2015 Luo et al., 2015 Peelay et al. (2023) Univariate and multivariate logistic regression analyses were conducted to examine how clinical and pathological features are related to the occurrence of LNM. Univariate analysis indicated that positive LVSI, serum SCC-Ag ≥ 5.63 ng/ml, PLT level ≥207 ×109/L, and PLR ≥ 248.739 were notably linked to LNM. However, D-dimer did not show significance as a predictor in the univariate model. In a multivariate model, positive LVSI, serum SCC-Ag ≥5.63 ng/ml, and PLR ≥248.739 were viable predictors of LNM. The results of the univariate and multivariate logistic regression analyses are presented in Table 3 Fig. 2 Our study showed that a nomogram is a valuable tool for predicting the risk of LNM, demonstrating its practicality in clinical settings for LNM prediction. However, it is essential to acknowledge the limitations of the present study. Single-center retrospective studies could have patient selection bias as a drawback. Moreover, because we have information from only one center, our verification process is limited to internal verification. Conclusion In conclusion, we developed a nomogram based on three parameters, LVSI, serum SCC-Ag, and PLR, and achieved good results in predicting LNM in cervical squamous cell carcinoma. Supplemental Information 10.7717/peerj.20069/supp-1 Supplemental Information 1 Data We would like to thank all doctors, nurses, patients, and their family members for their kindness in supporting this study. Abbreviations SII systemic immune-inflammation index FAR fibrinogen-to-albumin ratio PNI prognostic nutritional index NLR neutrophil-to-lymphocyte ratio PLR platelet-to-lymphocyte ratio MLR monocyte-to-lymphocyte ratio ROC operating characteristic curve AUC greater area under the ROC curve CSCC cervical squamous cell carcinoma SCC-Ag squamous cell carcinoma antigen PLT platelet LVSI lymph vascular space invasion LNM lymph node metastasis CC cervical cancer CT computed tomography SLN sentinel lymph node SLNB sentinel lymph node biopsy FIGO Federation of Gynecology and Obstetrics CI confidence interval OR odds ratio C-index concordance index CSCC cervical squamous cell carcinoma PET/CT Positron emission tomography/computed tomography MIC micro-metastases ITC isolated tumor cell Additional Information and Declarations Competing Interests The authors declare there are no competing interests. Author Contributions Liyun Song Kaiyun Qin Suning Bai Qi Wu Jing Zhao Jie Qi Junmei Zhang Yazhuo Wang Yuan Zhang Ren Xu Ethics The following information was supplied relating to ethical approvals (i.e., approving body and any reference numbers): This study was approved by the Ethics Committee of Hebei General Hospital. Research Ethics Review No. 2024-LW-074. Data Availability The following information was supplied regarding data availability: Data is available in the Supplementary File References Arneth (2019) Arneth B 2019 Tumor microenvironment Medicina 56 1 15 10.3390/medicina56010015 31906017 PMC7023392 Aslan et al. (2020) Aslan K Meydanli MM Oz M Tohma YA Haberal A Ayhan A 2020 The prognostic value of lymph node ratio in stage IIIC cervical cancer patients triaged to primary treatment by radical hysterectomy with systematic pelvic and para-aortic lymphadenectomy Journal of Gynecologic Oncology 31 1 e1 10.3802/jgo.2020.31.e1 31788991 PMC6918892 Balachandran et al. (2015) Balachandran VP Gonen M Smith JJ De Matteo RP 2015 Nomograms in oncology: more than meets the eye The Lancet Oncology 16 4 e173-e180 10.1016/S1470-2045(14)71116-7 25846097 PMC4465353 Barquet-Muñoz et al. (2017) Barquet-Muñoz SA Rendón-Pereira GJ Acuña González D Peñate MV Herrera-Montalvo LA Gallardo-Alvarado LN Cantú-de León DF Pareja R 2017 Role of pelvic and para-aortic lymphadenectomy in abandoned radical hysterectomy in cervical cancer World Journal of Surgical Oncology 15 23 10.1186/s12957-016-1067-2 28088221 PMC5237563 Bizzarri et al. (2021) Bizzarri N Luigi PA Ferrandina G Zannoni GF Carbone MV Fedele C Teodorico E Gallotta V Gueli Alletti S Chiantera V Fagotti A Scambia G Fanfani F 2021 Sentinel lymph node mapping with indocyanine green in cervical cancer patients undergoing open radical hysterectomy: a single-institution series Journal of Cancer Research and Clinical Oncology 147 3 649 659 10.1007/s00432-020-03393-6 33000339 PMC7873085 Bogani et al. (2024) Bogani G Scambia G Fagotti A Fanfani F Ciavattini A Sopracordevole F Malzoni M Casarin J Ghezzi F Vizza E Cosentino F Berretta R Cuccu I Ferrari FA Chiappa V Vizzielli G Investigator of the ETERNITY trial Raspagliesi F 2024 Sentinel node mapping, sentinel node mapping plus back-up lymphadenectomy, and lymphadenectomy in Early-sTage cERvical caNcer scheduled for fertilItY-sparing approach: The ETERNITY project European Journal of Surgical Oncology 50 9 108467 10.1016/j.ejso.2024.108467 38901291 Bullock et al. (2020) Bullock AF Greenley SL McKenzie GAG Paton LW Johnson MJ 2020 Relationship between markers of malnutrition and clinical outcomes in older adults with cancer: systematic review, narrative synthesis and meta-analysis European Journal of Clinical Nutrition 74 11 1519 1535 10.1038/s41430-020-0629-0 32366995 PMC7606134 Carlson et al. (2016) Carlson RW Scavone JL Koh WJ McClure JS Greer BE Kumar R McMillian NR Anderson BO 2016 NCCN framework for resource stratification: a framework for providing and improving global quality oncology care Journal National Comprehensive Cancer Network 14 8 961 969 10.6004/jnccn.2016.0103 27496112 Cheng et al. (2017) Cheng J Zeng Z Ye Q Zhang Y Yan R Liang C Wang J Li M Yi M 2017 The association of pretreatment thrombocytosis with prognosis and clinicopathological significance in cervical cancer: a systematic review and meta-analysis Oncotarget 8 15 24327 24336 10.18632/oncotarget.15358 28212582 PMC5421850 Cibula et al. (2020) Cibula D Kocian R Plaikner A Jarkovsky J Klat J Zapardiel I Pilka R Torne A Sehnal B Ostojich M Petiz A Sanchez OA Presl J Buda A Raspagliesi F Kascak P van Lonkhuijzen L Barahona M Minar L Blecharz P Pakiz M Wydra D Snyman LC Zalewski K Zorrero C Havelka P Redecha M Vinnytska A Vergote I Tingulstad S Michal M Kipp B Slama J Marnitz S Bajsova S Hernandez A Fischerova D Nemejcova K Kohler C 2020 Sentinel lymph node mapping and intraoperative assessment in a prospective, international, multicentre, observational trial of patients with cervical cancer: the SENTIX trial European Journal of Cancer 137 69 80 10.1016/j.ejca.2020.06.034 32750501 Cibula & McCluggage (2019) Cibula D McCluggage WG 2019 Sentinel lymph node (SLN) concept in cervical cancer: current limitations and unanswered questions Gynecologic Oncology 152 1 202 207 10.1016/j.ygyno.2018.10.007 30318103 Cohen et al. (2019) Cohen PA Jhingran A Oaknin A Denny L 2019 Cervical Cancer 393 10167 169 182 10.1016/S0140-6736(18)32470-X 30638582 Ding et al. (2010) Ding PR An X Zhang RX Fang YJ Li LR Chen G Wu XJ Lu ZH Lin JZ Kong LH Wan DS Pan ZZ 2010 Elevated preoperative neutrophil to lymphocyte ratio predicts risk of recurrence following curative resection for stage IIA colon cancer International Journal of Colorectal Disease 25 12 1427 1433 10.1007/s00384-010-1052-0 20821217 Grimes (2008) Grimes DA 2008 The nomogram epidemic: resurgence of a medical relic Annals of Internal Medicine 149 4 273 275 10.7326/0003-4819-149-4-200808190-00010 18711159 Grivennikov, Greten & Karin (2010) Grivennikov SI Greten FR Karin M 2010 Immunity, and inflammation, and cancer Cell 140 6 883 899 10.1016/j.cell.2010.01.025 20303878 PMC2866629 Haemmerle et al. (2018) Haemmerle M Stone RL Menter DG Afshar-Kharghan V Sood AK 2018 The platelet lifeline to cancer: challenges and opportunities Cancer Cell 33 6 965 983 10.1016/j.ccell.2018.03.002 29657130 PMC5997503 Huang & Fang (2018) Huang BX Fang F 2018 Progress in the study of lymph node metastasis in early-stage cervical cancer Current Medical Science 38 4 567 574 10.1007/s11596-018-1915-0 30128863 Kato & Torigoe (1977) Kato H Torigoe T 1977 Radioimmunoassay for tumor antigen of human cervical squamous cell carcinoma Cancer 40 4 1621 1628 10.1002/1097-0142(197710)40:4&#x0003c;1621::aid-cncr2820400435&#x0003e;3.0.co;2-i 332328 Khatun et al. (2017) Khatun S Huda AQ Begum SK Ferdous J 2017 Evaluation of pelvic lymphadenectomy during radical hysterectomy for cervical cancer Mymensingh Medical Journal 26 2 287 292 28588163 Kim et al. (2014) Kim DY Shim SH Kim SO Lee SW Park JY Suh DS Kim JH Kim YM Kim YT Nam JH 2014 Preoperative nomogram for the identification of lymph node metastasis in early cervical cancer British Journal of Cancer 110 34 41 10.1038/bjc.2013.718 24231954 PMC3887306 Kim et al. (2021) Kim SI Kim SJ Kim SJ Cho DS 2021 Prognostic nutritional index and prognosis in renal cell carcinoma: a systematic review and meta-analysis Journal of Urologic Oncology 39 10 623 630 10.1016/j.urolonc.2021.05.028 34253447 Kulbe et al. (2012) Kulbe H Chakravarty P Leinster DA Charles KA Kwong J Thompson RG Coward JI Schioppa T Robinson SC Gallagher WM Galletta L Australian Ovarian Cancer Study Group Salako MA Smyth JF Hagemann T Brennan DJ Bowtell DD Balkwill FR 2012 A dynamic inflammatory cytokine network in the human ovarian cancer microenvironment Cancer Research 72 1 66 75 10.1158/0008-5472.CAN-11-2178 22065722 PMC3252703 Kumarasamy et al. (2019) Kumarasamy C Sabarimurugan S Madurantakam RM Lakhotiya K Samiappan S Baxi S Nachimuthu R Gothandam KM Jayaraj R 2019 Prognostic significance of blood inflammatory biomarkers NLR, PLR, and LMR in cancer—a protocol for systematic review and meta-analysis Medicine 98 24 e14834 10.1097/MD.0000000000014834 31192906 PMC6587598 Kwon et al. (2018) Kwon J Eom KY Kim YS Park W Chun M Lee J Kim YB Yoon WS Kim JH Choi JH Chang SK Jeong BK Lee SH Cha J 2018 The prognostic impact of the number of metastatic lymph nodes and a new prognostic scoring system for recurrence in early-stage cervical cancer with high risk factors: a multicenter cohort study (KROG 15-04) Cancer Research and Treatment 50 3 964 974 10.4143/crt.2017.346 29081219 PMC6056979 Lecuru et al. (2019) Lecuru FR McCormack M Hillemanns P Anota A Leitao M Mathevet P Zweemer R Fujiwara K Zanagnolo V Zahl Eriksson AG Hudson E Ferron G Plante M 2019 SENTICOL III: an international validation study of sentinel node biopsy in early cervical cancer. A GINECO, ENGOT, GCIG and multicenter study International Journal of Gynecological Cancer 29 4 829 834 10.1136/ijgc-2019-000332 30898938 PMC7445752 Lee & Atri (2019) Lee SI Atri M 2019 2018 FIGO staging system for uterine cervical cancer: enter cross-sectional imaging Radiology 292 1 15 24 10.1148/radiol.2019190088 31135294 Levy et al. (2009) Levy MH Back A Benedetti C Billings JA Block S Boston B Bruera E Dy S Eberle C Foley KM Karver SB Knight SJ Misra S Ritchie CS Spiegel D Sutton L Urba S Von Roenn JH Weinstein SM 2009 NCCN clinical practice guidelines in oncology: palliative care Journal National Comprehensive Cancer Network 7 4 436 473 10.6004/jnccn.2009.0031 19406043 Li, Wu & Cheng (2016) Li H Wu X Cheng X 2016 Advances in diagnosis and treatment of metastatic cervical cancer Journal of Gynecologic Oncology 27 4 e43 10.3802/jgo.2016.27.e43 27171673 PMC4864519 Lin et al. (2000) Lin H ChangChien CC Huang EY Tseng CW Eng HL Huang CC 2000 The role of pretreatment squamous cell carcinoma antigen in predicting nodal metastasis in early stage cervical cancer Acta Obstetricia et Gynecologica Scandinavica 79 2 140 144 10.1034/j.1600-0412.2000.079002140.x 10696963 Liu, Gao & Li (2017) Liu B Gao S Li S 2017 A comprehensive comparison of CT, MRI, positron emission tomography or positron emission tomography/CT, and diffusion weighted imaging-MRI for detecting the lymph nodes metastases in patients with cervical cancer: a meta-analysis based on 67 studies Gynecologic and Obstetric Investigation 82 3 209 222 10.1159/000456006 28183074 Liu et al. (2021) Liu S Feng Z Zhang J Ge H Wu X Song S 2021 A novel 2-deoxy-2-fluorodeoxyglucose ( 18 Quantitative Imaging in Medicine and Surgery 11 1 240 248 10.21037/qims-20-348 33392025 PMC7719953 Luo et al. (2015) Luo YL Chi PD Zheng X Zhang L Wang XP Chen H 2015 Preoperative D-dimers as an independent prognostic marker in cervical carcinoma Tumor Biology 36 11 8903 8911 10.1007/s13277-015-3650-5 26071675 Martínez et al. (2013) Martínez A Mery E Filleron T Boileau L Ferron G Querleu D 2013 Accuracy of intraoperative pathological examination of SLN in cervical cancer Gynecologic Oncology 130 3 525 529 10.1016/j.ygyno.2013.01.023 23500089 Matsuo et al. (2019) Matsuo K Machida H Mandelbaum RS Konishi I Mikami M 2019 Validation of the 2018 FIGO cervical cancer staging system Gynecologic Oncology 152 1 87 93 10.1016/j.ygyno.2018.10.026 30389105 PMC7528458 Nanthamongkolkul & Hanprasertpong (2018) Nanthamongkolkul K Hanprasertpong J 2018 Predictive factors of pelvic lymph node metastasis in early-stage cervical cancer Oncology Research and Treatment 41 4 194 198 10.1159/000485840 29562222 Obrzut et al. (2017) Obrzut B Semczuk A Naróg M Obrzut M Król P 2017 Prognostic parameters for patients with cervical cancer FIGO stages IA2-IIB: a long-term follow-up Oncology 93 2 106 114 10.1159/000471766 28463843 Peelay et al. (2023) Peelay Z Parekh D Patil VM Noronha V Menon N Prabhash K 2023 Real-world analysis of the use of lenvatinib in differentiated thyroid cancers Ecancermedicalscience 17 1500 10.3332/ecancer.2023.1500 36816785 PMC9937066 Ryan et al. (2009) Ryan AM Reynolds JV Healy L Byrne M Moore J Brannelly N McHugh A McCormack D Flood P 2009 Enteral nutrition enriched with eicosapentaenoic acid (EPA) preserves lean body mass following esophageal cancer surgery: results of a double-blinded randomized controlled trial Annals of Surgery 249 3 355 63 10.1097/SLA.0b013e31819a4789 19247018 Sakuragi (2007) Sakuragi N 2007 Up-to-date management of lymph node metastasis and the role of tailored lymphadenectomy in cervical cancer International Journal of Clinical Oncology 12 3 165 175 10.1007/s10147-007-0661-2 17566838 Sasahara et al. (2020) Sasahara M Kanda M Ito S Mochizuki Y Teramoto H Ishigure K Murai T Asada T Ishiyama A Matsushita H Tanaka C Kobayashi D Fujiwara M Murotani K Kodera Y 2020 The preoperative prognostic nutritional index predicts short-term and long-term outcomes of patients with stage II/III gastric cancer: analysis of a multi-institution dataset Digestive Surgery 37 2 135 144 10.1159/000497454 30840952 Shah et al. (2011) Shah M Lewin SN Deutsch I Burke WM Sun X Herzog TJ Wright JD 2011 Therapeutic role of lymphadenectomy for cervical cancer Cancer 117 2 310 317 10.1002/cncr.25408 20862747 Sturgeon et al. (2010) Sturgeon CM Duffy MJ Hofmann BR Lamerz R Fritsche HA Gaarenstroom K Bonfrer J Ecke TH Grossman HB Hayes P Hoffmann RT Lerner SP Löhe F Louhimo J Sawczuk I Taketa K Diamandis EP National Academy of Clinical Biochemistry 2010 National Academy of Clinical Biochemistry Laboratory Medicine Practice Guidelines for use of tumor markers in liver, bladder, cervical, and gastric cancers Clinical Chemistry 56 6 e1-e48 10.1373/clinchem.2009.133124 20207771 Sung et al. (2021) Sung H Ferlay J Siegel RL Laversanne M Soerjomataram I Jemal A Bray F 2021 Global Cancer Statistics 2020: GLOBOCAN estimates of incidence and mortality worldwide for 36 cancers in 185 countries CA A Cancer Journal for Clinicians 71 3 209 249 10.3322/caac.21660 33538338 Togami et al. (2014) Togami S Kamio M Yanazume S Yoshinaga M Douchi T 2014 Can pelvic lymphadenectomy be omitted in stage IA2 to IIB uterine cervical cancer? International Journal of Gynecological Cancer 24 6 1072 1076 10.1097/IGC.0000000000000163 24905616 Von Elm et al. (2007) Von Elm E Altman DG Egger M Pocock SJ Gøtzsche PC Vandenbroucke JP STROBE Initiative 2007 The Strengthening the Reporting of Observational Studies in Epidemiology (STROBE) statement: guidelines for reporting observational studies Lancet 370 9596 1453 1457 10.1016/S0140-6736(07)61602-X 18064739 Wang et al. (2021) Wang D Hu X Xiao L Long G Yao L Wang Z Zhou L 2021 Prognostic nutritional index and systemic immune-inflammation index predict the prognosis of patients with HCC Journal of Gastrointestinal Surgery 25 2 421 427 10.1007/s11605-019-04492-7 32026332 PMC7904713 Wang et al. (2017) Wang L Jia J Lin L Guo J Ye X Zheng X Chen Y 2017 Predictive value of hematological markers of systemic inflammation for managing cervical cancer Oncotarget 8 27 44824 44832 10.18632/oncotarget.14827 28148894 PMC5546522 Wang et al. (2020) Wang R Tao X Wu X Jiang H Xia H 2020 Number of removed pelvic lymph nodes as a prognostic marker in FIGO stage IB1 cervical cancer with negative lymph nodes Journal of Minimally Invasive Gynecology 27 4 946 952 10.1016/j.jmig.2019.08.002 31394263 Wydra et al. (2006) Wydra D Sawicki S Wojtylak S Bandurski T Emerich J 2006 Sentinel node identification in cervical cancer patients undergoing transperitoneal radical hysterectomy: a study of 100 cases International Journal of Gynecological Cancer 16 2 649 654 10.1111/j.1525-1438.2006.00402.x 16681741 Xie et al. (2018) Xie X Song K Cui B Jiang J Yang X Kong B 2018 A comparison of the prognosis between adenocarcinoma and squamous cell carcinoma in stage IB-IIA cervical cancer International Journal of Clinical Oncology 23 3 522 531 10.1007/s10147-017-1225-8 29299705 Ye et al. (2015) Ye S Zhang W Yang J Cao D Huang H Wu M Lang J Shen K 2015 Pattern of venous thromboembolism occurrence in gynecologic malignancy: incidence, timing, and distribution a 10-year retrospective single-institutional study Medicine 94 50 e2316 10.1097/MD.0000000000002316 26683971 PMC5058943 Yoshida et al. (2019) Yoshida K Yoshikawa N Shirakawa A Niimi K Suzuki S Kajiyama H Kikkawa F 2019 Prognostic value of neutrophil-to-lymphocyte ratio in early-stage ovarian clear-cell carcinoma Journal of Gynecologic Oncology 30 6 e85 31576683 10.3802/jgo.2019.30.e85 PMC6779610 Zhang et al. (2021) Zhang X Bao B Wang S Yi M Jiang L Fang X 2021 Sentinel lymph node biopsy in early stage cervical cancer: a meta-analysis Cancer Medicine 10 8 2590 2600 10.1002/cam4.3645 33314779 PMC8026927 Zhu et al. (2021) Zhu C Zhang W Wang X Jiao L Chen L Jiang J 2021 Predictive value of preoperative serum squamous cell carcinoma antigen level for lymph node metastasis in early-stage cervical squamous cell carcinoma Medicine 100 33 e26960 10.1097/MD.0000000000026960 34414964 PMC8376392 ",
  "metadata": {
    "Title of this paper": "Predictive value of preoperative serum squamous cell carcinoma antigen level for lymph node metastasis in early-stage cervical squamous cell carcinoma",
    "Journal it was published in:": "PeerJ",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12476862/"
  }
}