{
  "title": "Paper_435",
  "abstract": "pmc Discov Oncol Discov Oncol 4139 discon Discover Oncology 2730-6011 Springer PMC12480160 PMC12480160.1 12480160 12480160 41021135 10.1007/s12672-025-02862-z 2862 1 Research Low pre-treatment neutrophil-to-lymphocyte ratio predicted a better survival in recurrent/metastatic cervical cancer treated with PD-1/PD-L1 inhibitors Li Jing 1 Wang Yulu 1 Pei Jiayu 1 Wang Min 2 Wang Dian 2 Guo Ruixia 2 Qiu Haifeng wyl000707@163.com 2 1 https://ror.org/056swr059 grid.412633.1 Department of Oncology, The First Affiliated Hospital of Zhengzhou University, 2 https://ror.org/056swr059 grid.412633.1 Department of Gynecology, The First Affiliated Hospital of Zhengzhou University, 29 9 2025 12 2025 16 478248 1756 23 11 2024 29 5 2025 29 09 2025 01 10 2025 01 10 2025 © The Author(s) 2025 2025 https://creativecommons.org/licenses/by-nc-nd/4.0/ Open Access http://creativecommons.org/licenses/by-nc-nd/4.0/ Background A precise predictor is urgently needed for immunotherapy in cervical cancer (CC), which would be very helpful for disease monitoring. Thus, we explore the relationship between pre-treatment neutrophil-to-lymphocyte ratio (NLR) and prognosis in recurrent/metastatic CC patients who were treated with PD-1/PD-L1 inhibitors. Methods A total of 282 patients with recurrent/metastatic cervical cancer were enrolled in this retrospective study from December 2018 to September 2023. The area under the receiver operating characteristic (ROC) curve was used to identify the optimal threshold for evaluating the influence of pre-treatment NLR on patients’ survival. Kaplan-Meier analysis was conducted to determine the predictive roles of pre-treatment NLR for progression-free survival of immunotherapy (PFSi) and overall survival (OS). Results A pre-treatment NLR = 3.91 was determined to be the optimal cut-off value for predicting patient prognosis, with an AUC of 0.636 ( P P P P P P Conclusion The pre-treatment NLR could be a biomarker for predicting the response to anti-PD-1/PD-L1 therapy in recurrent/metastatic CC. In combination with PD-L1 status, it may improve the benefits of immunotherapy and lower the treatment costs. Keywords Cervical cancer NLR Inflammatory indicators PD-1/PD-L1 inhibitors PD-L1 status Henan Province Medical Science and Technology Attack Plan Province and Ministry Joint Construction Project SBGJ202103072 Key Scientific Research Projects Plan of Higher Education Institutions in Henan Province 22A320011 pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement no pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes issue-copyright-statement © Springer Science+Business Media LLC, part of Springer Nature 2025 Introduction Globally, cervical cancer (CC) is one of the cancers with the highest prevalence and mortality rates among women [ 1 2 3 4 5 8 6 7 9 11 As the clinical experience accumulated, an interesting phenomenon was noticed: PD-L1 status was not always a reliable marker for predicting the efficacy of PD-1/PD-L1 inhibitors [ 10 11 N 12 Peripheral blood is one of the most commonly used samples in the clinic and has been proven to be candidate markers [ 13 14 15 19 20 21 P 22 P P 23 Methods Data source and patient selection This study was conducted at the First Affiliated Hospital of Zhengzhou University, and the protocol was approved by the Institutional Ethics Review Committee at the First Affiliated Hospital of Zhengzhou University (No. 2023-KY-0461). The ethical principles of this research follow the Declaration of Helsinki. The patient or family members signed the information obtained for informed consent for clinical data statistics, which was anonymized. All recurrent/metastatic CC patients who were treated in our center between December 2018 and September 2023 were screened, and 305 cases were recruited into this study. The inclusion criteria were: (1) pathologically diagnosed CC, including squamous cell carcinoma (SCC), adenocarcinoma (AC), and adenosquamous cell carcinoma (ASC); (2) patients with recurrent or metastatic CC who accepted at least two cycles of treatment with PD-1/PD-L1 inhibitors; (3) the interval from any anti-cancer treatments (like surgery, chemotherapy, and radiotherapy) to NLR obtained was longer than two weeks; (4) no inflammatory disease or the use of antibiotics within four weeks before the time point of NLR obtained; (5) the information of pre-treatment neutrophil count and lymphocyte count was available; (6) patient demographic information was recorded at the First Affiliated Hospital of Zhengzhou University. The exclusion criteria included: (1) uncommon pathological types of CC, such as gastric-type carcinoma, neuroendocrine carcinoma, and others; (2) recurrent/metastatic CC who did not undergo the anti-PD-1/PD-L1 therapy; (3) patients with incomplete medical records. Follow-up During the treatment, follow-up was conducted every two to three months or when a tumor progression was suspected. After the treatment finished, patients were then followed every 2–3 months in the first and second years, every 6 months in the third and fourth years, and once a year in the fifth year and later. The contents of the follow-up included physical examination (especially pelvic examination), plasma tumor markers, and imaging tests (ultrasonography, computed tomography, magnetic resonance imaging, and positron emission tomography-computed tomography). At the time of the last follow-up (January 2024), 23 patients were lost to contact. Thus, 282 patients were enrolled for the final analysis. Progression free survival of immunotherapy (PFSi) was defined as the duration from the initiation of anti-PD-1/PD-L1 therapy to the subsequent disease progression. OS was defined as the duration from the time of pathological diagnosis to the date of death. The response evaluation was conducted by our experienced gynecological oncologists strictly following the Response Evaluation Criteria in Solid Tumors version 1.1 (RECIST 1.1) and classified into four groups: complete response (CR), partial response (PR), stable disease (SD), and progressive disease (PD). ORR is the sum of CR and PR. Statistical analysis Frequency distributions and percentages were utilized to present categorical variables, while median values and ranges were reported for continuous variables. Patients were grouped according to quartiles of pretreatment NLR, and survival analyses were performed to clarify the relationship between pretreatment NLR and the prognosis of patients on immunotherapy. To determine the optimal critical threshold of NLR for predicting the survival outcome, receiver operating characteristic (ROC) curve analysis was selected over alternative statistical methods (e.g., quartile-based stratification or maximally selected rank statistics) because it objectively balances sensitivity (true positive rate) and specificity (1 − false positive rate) across all possible thresholds, thus avoiding arbitrary categorization [ 24 2 P Results Baseline characteristics of recurrent/metastatic CC patients The baseline characteristics of the 282 patients are shown in Table 1 N N N N  Table 1 Baseline characteristics of the 282 recurrent/metastatic CC patients Characteristic Total ( n NLR< 3.91 ( n NLR ≥ 3.91 ( n Age, median (range) 53 (22-79) 52 (31-79) 54 (22-78) Histology n (%) Squamous cell carcinoma 250 (88.7) 100 (85.5) 150 (90.9) No Squamous cell carcinoma 32 (11.3) 17 (14.5) 15 (9.1) PD-L1 status n (%) 0.0 Positive 69 (24.5) 23 (19.7) 46 (27.9) Negative 40 (14.3) 13 (11.1) 27 (16.4) Unknown 173 (61.3) 81 (69.3) 92 (55.8) Immunotherapy line n (%) First line a 210 (74.5) 87 (74.4) 123 (74.5) Second line b 72 (25.5) 30 (25.6) 42 (25.5) Duration of immunotherapy Less than 3 months 61 (21.6) 14 (11.8) 47 (28.8) More than 3 months 221 (78.4) 105 (88.2) 116 (71.2) Combination of radiotherapy Yes 66 (23.4) 31 (26.1) 35 (21.5) No 216 (76.6) 88 (73.9) 128 (78.5) All variables are displayed as n (%) unless otherwise noted a b Lower pre-treatment NLR predicted a better prognosis in recurrent/metastatic CC The patients were divided into four groups based on the quartiles of pre-treatment NLR (25% quartile = 2.82, 50% quartile = 4.57, 75% quartile = 7.60). As shown in Fig. 1 P 1 P 1 P 1 n n P 1 Kaplan-Meier analyses in Fig. 2 P 2 P 2 3 3 P P P P 3 n P P 3 n P P 3 2 P  Table 2 Interactive validation of immunotherapy outcome by PD-L1 status and pre-treatment NLR grouping PD-L1 status NLR Mean difference Standard error  P 95%CI Positive 1 2 – 0.342 0.119 0.004 – 0.576 – 0.107 2 1 0.342 0.119 0.004 0.107 0.576 Negative 1 2 – 0.28 0.156 0.074 – 0.588 0.027 2 1 0.28 0.156 0.074 – 0.027 0.588 1 Pre-treatment NLR< 3.91 2 Pre-treatment NLR≥ 3.91 We conducted treatment-line stratified analyses to elucidate the combined prognostic value of pretreatment NLR and PD-L1 expression status. Among 60 PD-L1 positive CC patients who initiated anti-PD-1/PD-L1 immunotherapy at the first recurrence or metastasis, a lower pretreatment NLR was significantly associated with prolonged PFSi ( P 4 P 4 3 P P 4 P 4  Table 3 Interactive validation of immunotherapy outcomes by number of treatment lines, PD-L1 status and pretreatment NLR grouping Immunotherapy line PD-L1 status NLR Mean difference Standard error  P 95%CI First line Positive 1 2 – 0.3 0.13 0.022 – 0.556 – 0.044 2 1 0.3 0.13 0.022 0.044 0.556 Negative 1 2 – 0.135 0.21 0.519 – 0.548 0.277 2 1 0.135 0.21 0.519 – 0.277 0.548 Second line Positive 1 2 – 0.6 0.318 0.06 – 1.226 0.026 2 1 0.6 0.318 0.06 – 0.026 1.226 Negative 1 2 – 0.429 0.253 0.092 – 0.928 0.07 2 1 0.429 0.253 0.092 – 0.07 0.928 First line: Patients who received immunotherapy after the first recurrence/metastasis Second line: Patients received immunotherapy after the second recurrence/metastasis 1 Pre-treatment NLR< 3.91 2 Pre-treatment NLR ≥ 3.91 A low pre-treatment NLR was related to better responses to PD-1/PD-L1 Blockade in recurrent/metastatic CC We then detected the relationship between pre-treatment NLR and the best tumor response to immunotherapy. In the low NLR group, the immunotherapy achieved an objective response in 43 out of 117 patients (ORR = 36.8%), including 9 CR (7.7%) and 34 PR (29.1%). In contrast, only 30 patients (18.2%) showed PR in the high NLR group, while no CR was observed (ORR = 18.2%, P 4  Table 4 Best treatment response in low and high NLR group Low NLR High NLR P CR 9 (7.7) 0 (0) PR 34 (29.1) 30 (18.2) SD 59 (50.4) 105 (63.6) PD 15 (12.8) 30 (18.2) ORR 43(36.8) 30 (18.2) 0.000 All variables displayed as n (%) unless otherwise noted Discussion Up to date, a panel of biomarkers (including PD-L1 expression, microsatellite instability, TMB, tumor-infiltrating lymphocytes, and others) is the efficacy predictor for cancer immunotherapy [ 25 28 During the last decade, NLR has been well recognized as a prognostic predictor for CC, either in early-stage tumors treated by radical surgery or late-stage cases who received radiotherapy and chemotherapy [ 29 32 N N 20 21 As is well known, inflammation plays an important role in the initiation and progression of various cancers [ 33 37 38 39 44 45 P 46 47 48 23 P 3 P 3 n 49 50 51 52 53 54 55 58 r 59 60 62 63 64 Finally, for clinicians to integrate NLR and PD-L1 status in their practice to guide therapeutic decisions, it is possible to conduct a pretreatment NLR assessment for patients with advanced cervical cancer, upon diagnosis, if PD-L1 expression is positive. In cases where both PD-L1 is positive and NLR is in the lower risk group, clinicians may consider prioritizing immunotherapy as a first-line treatment option, given the significantly improved prognosis indicated by our study. Conversely, for patients with positive PD-L1 but high NLR, a more comprehensive treatment approach, such as combination therapy, may be more appropriate, as the high NLR may indicate a more aggressive tumor microenvironment that could potentially blunt the effects of immunotherapy alone. Limitations and improvements The retrospective design of this study has some limitations. First, in addition to PD-1/PD-L1 inhibitors, each patient received chemotherapy containing different drugs. This may have introduced unforeseen bias into our statistical analysis. Second, PD-L1 status was not available in a large portion of patients, which may impair the power of our result that NLR failed to predict outcomes of immunotherapy in the PD-L1 negative population. Third, retrospective studies often lack pre-specified follow-up time points, and patients with advanced disease may be lost to early follow-up due to rapid disease progression, leading to bias in overall survival time and overestimation or underestimation of true survival. Finally, tumor progression itself can lead to neutrophilia and lymphopenia, and combination chemotherapy can affect the detection of inflammatory markers, making it difficult to accurately predict the efficacy of immunotherapy. We propose a two-stage study to remedy the limitations of this study. First, a prospective cohort study will be conducted to enroll patients with advanced cervical cancer who meet immunotherapy eligibility criteria and have assessable PD-L1 status. This study will dynamically assess the predictive value of inflammatory biomarkers (including NLR, PLR, and MLR) for immunotherapy efficacy. Serial measurements will be performed at two critical time points: before initiating treatment and before the third treatment cycle. Concurrently, we will implement a multicenter retrospective analysis to validate whether baseline NLR levels demonstrate a predictive capacity for immunotherapy outcomes across diverse clinical settings. Conclusion We demonstrated that pre-treatment NLR could serve as a prognostic marker for immunotherapy in PD-L1 positive, recurrent/metastatic CC. These findings were consistent no matter the start time of immunotherapy. Thus, we proposed that implementing NLR assessment in combination with PD-L1 status may help improve patient outcomes and optimize treatment strategies for CC patients.  Fig. 1 Kaplan–Meier survival curves and ROC curve analysis: association between pretreatment NLR quartiles and Progression Free Survival (PFSi)/ Overall Survival (OS) in recurrent/Metastatic cervical cancer patients treated with PD-1/PD-L1 inhibitors. The survival analysis presented a notable correlation between lower NLR and prolonged PFSi ( P P P  Fig. 2 Comparison of PFSi and OS between low and high pretreatment NLR groups in recurrent/Metastatic cervical cancer patients treated with PD-1/PD-L1 in hibitors. Compared to the high-NLR cohort (median PFSi: 10 months; 95% CI 3.3-16.7), low-NLR patients demonstrated extended PFS intervals (median PFSi: 35 months, 95% CI 24.6-45.4, P P  Fig. 3 Survival analysis of recurrent/metastatic cervical cancer patients undergoing anti-PD-1/PD-L1 therapy stratified by NLR, treatment line, and PD-L1 expression status. For patients initiating anti-PD-1/PD-L1 therapy post-initial recurrence/metastasis (A-B), the low-NLR subgroup maintained superior outcomes (PFSi: median 40 vs. 11 months, P P P P n P P n P P  Fig. 4 Survival analysis of PD-L1 positive recurrent/metastatic cervical cancer patient treated with anti-PD-1/PD-L1 therapy stratified by treatment line and pretreatment NLR. Among PD-L1 positive CC patients who received anti-PD-1/PD-L1 treatments at the first tumor recurrence/metastasis, a lower pre-treatment NLR ( N P P P P Abbreviations CC Cervical cancer NLR Neutrophil-to-lymphocyte ratio ROC Receiver operating characteristic PFS Progression free survival PFSi Progression free survival of immunotherapy OS Overall survival ORR Objective response rate PD-1/PD-L1 Programmed cell death-1/ Programmed death ligand-1 DCR Disease control rate FDA Food and Drug Administration MLR Monocyte-to-lymphocyte ratio PLR platelet-to-lymphocyte ratio SCC Squamous cell carcinoma AC Adenocarcinoma ASC Adeno-squamous cell carcinoma CR Complete response PR Partial response SD Stable disease PD Progression disease Publisher’s note Springer Nature remains neutral with regard to jurisdictional claims in published maps and institutional affiliations. Jing Li, Yulu Wang have contributed equally to this work. Author contributions HFQ contributed to the study design, manuscript preparation and modification. JL and YLW performed data acquisition and statistical analysis and prepared the manuscript.JYP, MW and DW helped with data collection and patients follow up. RXG critically revise the manuscript for important intellectual content. All authors contributed to the article and approved the final manuscript. Funding Our work is granted by the Key Scientific Research Projects Plan of Higher Education Institutions in Henan Province (22A320011) and the Henan Province Medical Science and Technology Attack Plan Province and Ministry Joint Construction Project (SBGJ202103072). Availability of data and materials Data supporting the results of this study are available from the corresponding author, but the availability of these data is restricted, and these data are used for the current study with permission from the First Affiliated Hospital of Zhengzhou University. Declarations Ethics approval and consent to participate This study was conducted at a single center (the First Affiliated Hospital of Zhengzhou University) and approved by the Institutional Ethics Review Committee at the First Affiliated Hospital of Zhengzhou University (No. 2023-KY-0461). The ethical principles of this research follow the Declaration of Helsinki. The information obtained has been signed by the patient or family members for informed consent for clinical data statistics, and it was anonymized. Consent for publication Not applicable. Competing interests The authors declare no competing interests. References 1. Sung H Ferlay J Siegel RL Laversanne M Soerjomataram I Jemal A Global Cancer statistics 2020: GLOBOCAN estimates of incidence and mortality worldwide for 36 cancers in 185 countries CA Cancer J Clin 2021 71 209 49 33538338 10.3322/caac.21660 Sung H, Ferlay J, Siegel RL, Laversanne M, Soerjomataram I, Jemal A, et al. Global Cancer statistics 2020: GLOBOCAN estimates of incidence and mortality worldwide for 36 cancers in 185 countries. CA Cancer J Clin. 2021;71:209–49. 33538338 10.3322/caac.21660 2. Han B, Zheng R, Zeng H, Wang S, Sun K, Chen R et al. Cancer incidence and mortality in china, 2022. J Natl Cancer Cent. 2024;:S2667005424000061. 10.1016/j.jncc.2024.01.006 PMC11256708 39036382 3. Grau-Bejar JF Garcia-Duran C Garcia-Illescas D Mirallas O Oaknin A Advances in immunotherapy for cervical cancer Ther Adv Med Oncol 2023 15 17588359231163836 10.1177/17588359231163836 37007635 PMC10052578 Grau-Bejar JF, Garcia-Duran C, Garcia-Illescas D, Mirallas O, Oaknin A. Advances in immunotherapy for cervical cancer. Ther Adv Med Oncol. 2023;15:17588359231163836. 37007635 10.1177/17588359231163836 PMC10052578 4. Schmidt MW Battista MJ Schmidt M Garcia M Siepmann T Hasenburg A Efficacy and safety of immunotherapy for cervical Cancer—A systematic review of clinical trials Cancers 2022 14 441 10.3390/cancers14020441 35053603 PMC8773848 Schmidt MW, Battista MJ, Schmidt M, Garcia M, Siepmann T, Hasenburg A, et al. Efficacy and safety of immunotherapy for cervical Cancer—A systematic review of clinical trials. Cancers. 2022;14:441. 35053603 10.3390/cancers14020441 PMC8773848 5. Duan J Cui L Zhao X Bai H Cai S Wang G Use of immunotherapy with programmed cell death 1 vs programmed cell death ligand 1 inhibitors in patients with cancer: A systematic review and Meta-analysis JAMA Oncol 2020 6 375 84 10.1001/jamaoncol.2019.5367 31876895 PMC6990765 Duan J, Cui L, Zhao X, Bai H, Cai S, Wang G, et al. Use of immunotherapy with programmed cell death 1 vs programmed cell death ligand 1 inhibitors in patients with cancer: A systematic review and Meta-analysis. JAMA Oncol. 2020;6:375–84. 31876895 10.1001/jamaoncol.2019.5367 PMC6990765 6. Frenel J-S Le Tourneau C O’Neil B Ott PA Piha-Paul SA Gomez-Roca C Safety and efficacy of pembrolizumab in advanced, programmed death ligand 1–Positive cervical cancer: results from the phase Ib KEYNOTE-028 trial J Clin Oncol 2017 35 4035 41 10.1200/JCO.2017.74.5471 29095678 Frenel J-S, Le Tourneau C, O’Neil B, Ott PA, Piha-Paul SA, Gomez-Roca C, et al. Safety and efficacy of pembrolizumab in advanced, programmed death ligand 1–Positive cervical cancer: results from the phase Ib KEYNOTE-028 trial. J Clin Oncol. 2017;35:4035–41. 29095678 10.1200/JCO.2017.74.5471 7. Chung HC Ros W Delord J-P Perets R Italiano A Shapira-Frommer R Efficacy and safety of pembrolizumab in previously treated advanced cervical cancer: results from the phase II KEYNOTE-158 study J Clin Oncol 2019 37 1470 8 10.1200/JCO.18.01265 30943124 Chung HC, Ros W, Delord J-P, Perets R, Italiano A, Shapira-Frommer R, et al. Efficacy and safety of pembrolizumab in previously treated advanced cervical cancer: results from the phase II KEYNOTE-158 study. J Clin Oncol. 2019;37:1470–8. 30943124 10.1200/JCO.18.01265 8. Abaza T El-Aziz MKA Daniel KA Karousi P Papatsirou M Fahmy SA Emerging role of circular RNAs in hepatocellular carcinoma immunotherapy Int J Mol Sci 2023 24 16484 10.3390/ijms242216484 38003674 PMC10671287 Abaza T, El-Aziz MKA, Daniel KA, Karousi P, Papatsirou M, Fahmy SA, et al. Emerging role of circular RNAs in hepatocellular carcinoma immunotherapy. Int J Mol Sci. 2023;24:16484. 38003674 10.3390/ijms242216484 PMC10671287 9. Monk BJ Colombo N Tewari KS Dubot C Caceres MV Hasegawa K First-Line Pembrolizumab + Chemotherapy versus Placebo + Chemotherapy for persistent, recurrent, or metastatic cervical cancer: final overall survival results of KEYNOTE-826 J Clin Oncol 2023 41 5505 11 10.1200/JCO.23.00914 37910822 Monk BJ, Colombo N, Tewari KS, Dubot C, Caceres MV, Hasegawa K, et al. First-Line Pembrolizumab + Chemotherapy versus Placebo + Chemotherapy for persistent, recurrent, or metastatic cervical cancer: final overall survival results of KEYNOTE-826. J Clin Oncol. 2023;41:5505–11. 37910822 10.1200/JCO.23.00914 10. Yi M Jiao D Xu H Liu Q Zhao W Han X Biomarkers for predicting efficacy of PD-1/PD-L1 inhibitors Mol Cancer 2018 17 129 10.1186/s12943-018-0864-3 30139382 PMC6107958 Yi M, Jiao D, Xu H, Liu Q, Zhao W, Han X, et al. Biomarkers for predicting efficacy of PD-1/PD-L1 inhibitors. Mol Cancer. 2018;17:129. 30139382 10.1186/s12943-018-0864-3 PMC6107958 11. Tewari KS Monk BJ Vergote I Miller A De Melo AC Kim H-S Survival with Cemiplimab in recurrent cervical Cancer N Engl J Med 2022 386 544 55 10.1056/NEJMoa2112187 35139273 Tewari KS, Monk BJ, Vergote I, Miller A, De Melo AC, Kim H-S, et al. Survival with Cemiplimab in recurrent cervical Cancer. N Engl J Med. 2022;386:544–55. 35139273 10.1056/NEJMoa2112187 12. An J Tang J Li BX Xiong H Qiu H Luo L Efficacy and safety of the Anti–PD-L1 mAb Socazolimab for recurrent or metastatic cervical cancer: a phase I Dose-Escalation and expansion study Clin Cancer Res 2022 28 5098 106 10.1158/1078-0432.CCR-22-1280 36136294 An J, Tang J, Li BX, Xiong H, Qiu H, Luo L, et al. Efficacy and safety of the Anti–PD-L1 mAb Socazolimab for recurrent or metastatic cervical cancer: a phase I Dose-Escalation and expansion study. Clin Cancer Res. 2022;28:5098–106. 36136294 10.1158/1078-0432.CCR-22-1280 13. Mosca M Nigro MC Pagani R De Giglio A Di Federico A Neutrophil-to-Lymphocyte ratio (NLR) in NSCLC, gastrointestinal, and other solid tumors: immunotherapy and beyond Biomolecules 2023 13 1803 10.3390/biom13121803 38136673 PMC10741961 Mosca M, Nigro MC, Pagani R, De Giglio A, Di Federico A. Neutrophil-to-Lymphocyte ratio (NLR) in NSCLC, gastrointestinal, and other solid tumors: immunotherapy and beyond. Biomolecules. 2023;13:1803. 38136673 10.3390/biom13121803 PMC10741961 14. Liu F Luo H Zhu Z Zhu P Huang J Prognostic significance of peripheral blood-derived neutrophil/lymphocyte ratio in patients with digestive cancer J Cell Physiol 2019 234 22775 86 10.1002/jcp.28842 31140613 Liu F, Luo H, Zhu Z, Zhu P, Huang J. Prognostic significance of peripheral blood-derived neutrophil/lymphocyte ratio in patients with digestive cancer. J Cell Physiol. 2019;234:22775–86. 31140613 10.1002/jcp.28842 15. Gregory AD, Houghton AM. Tumor-Associated neutrophils: new targets for Cancer therapy. Cancer Res. 10.1158/0008-5472.CAN-10-2583 21427354 16. Zheng F Meng Q Zhang L Chen J Zhao L Zhou Z Prognostic roles of hematological indicators for the efficacy and prognosis of immune checkpoint inhibitors in patients with advanced tumors: a retrospective cohort study World J Surg Oncol 2023 21 198 10.1186/s12957-023-03077-8 37420219 PMC10326931 Zheng F, Meng Q, Zhang L, Chen J, Zhao L, Zhou Z, et al. Prognostic roles of hematological indicators for the efficacy and prognosis of immune checkpoint inhibitors in patients with advanced tumors: a retrospective cohort study. World J Surg Oncol. 2023;21:198. 37420219 10.1186/s12957-023-03077-8 PMC10326931 17. Hammad R Aglan RB Mohammed SA Awad EA Elsaid MA Bedair HM Cytotoxic T cell expression of Leukocyte-Associated Immunoglobulin-Like Receptor-1 (LAIR-1) in viral hepatitis C-Mediated hepatocellular carcinoma Int J Mol Sci 2022 23 12541 10.3390/ijms232012541 36293412 PMC9604124 Hammad R, Aglan RB, Mohammed SA, Awad EA, Elsaid MA, Bedair HM, et al. Cytotoxic T cell expression of Leukocyte-Associated Immunoglobulin-Like Receptor-1 (LAIR-1) in viral hepatitis C-Mediated hepatocellular carcinoma. Int J Mol Sci. 2022;23:12541. 36293412 10.3390/ijms232012541 PMC9604124 18. Hammad R Eldosoky MA Elmadbouly AA Aglan RB AbdelHamid SG Zaky S Monocytes subsets altered distribution and dysregulated plasma hsa-miR-21-5p and hsa-miR-155-5p in HCV-linked liver cirrhosis progression to hepatocellular carcinoma J Cancer Res Clin Oncol 2023 149 15349 64 10.1007/s00432-023-05313-w 37639012 PMC10620275 Hammad R, Eldosoky MA, Elmadbouly AA, Aglan RB, AbdelHamid SG, Zaky S, et al. Monocytes subsets altered distribution and dysregulated plasma hsa-miR-21-5p and hsa-miR-155-5p in HCV-linked liver cirrhosis progression to hepatocellular carcinoma. J Cancer Res Clin Oncol. 2023;149:15349–64. 37639012 10.1007/s00432-023-05313-w PMC10620275 19. Elanany MM Mostafa D Hamdy NM Remodeled tumor immune microenvironment (TIME) parade via natural killer cells reprogramming in breast cancer Life Sci 2023 330 121997 121997 10.1016/j.lfs.2023.121997 37536617 Elanany MM, Mostafa D, Hamdy NM. Remodeled tumor immune microenvironment (TIME) parade via natural killer cells reprogramming in breast cancer. Life Sci. 2023;330:121997–121997. 37536617 10.1016/j.lfs.2023.121997 20. Calo CA Barrington DA Brown M Gonzalez L Baek J Huffman A High pre-treatment neutrophil-to-lymphocyte ratio as a prognostic marker for worse survival in patients with recurrent/metastatic cervical cancer treated with immune checkpoint inhibitors Gynecol Oncol Rep 2022 42 101040 10.1016/j.gore.2022.101040 35855965 PMC9287632 Calo CA, Barrington DA, Brown M, Gonzalez L, Baek J, Huffman A, et al. High pre-treatment neutrophil-to-lymphocyte ratio as a prognostic marker for worse survival in patients with recurrent/metastatic cervical cancer treated with immune checkpoint inhibitors. Gynecol Oncol Rep. 2022;42:101040. 35855965 10.1016/j.gore.2022.101040 PMC9287632 21. Cheng M Li G Liu Z Yang Q Jiang Y Pretreatment Neutrophil-to-Lymphocyte ratio and lactate dehydrogenase predict the prognosis of metastatic cervical Cancer treated with combination immunotherapy J Oncol 2022 2022 1 7 10.1155/2022/1828473 PMC9596258 36304986 Cheng M, Li G, Liu Z, Yang Q, Jiang Y. Pretreatment Neutrophil-to-Lymphocyte ratio and lactate dehydrogenase predict the prognosis of metastatic cervical Cancer treated with combination immunotherapy. J Oncol. 2022;2022:1–7. 10.1155/2022/1828473 PMC9596258 36304986 22. Valero C Lee M Hoen D Weiss K Kelly DW Adusumilli PS Pretreatment neutrophil-to-lymphocyte ratio and mutational burden as biomarkers of tumor response to immune checkpoint inhibitors Nat Commun 2021 12 729 10.1038/s41467-021-20935-9 33526794 PMC7851155 Valero C, Lee M, Hoen D, Weiss K, Kelly DW, Adusumilli PS, et al. Pretreatment neutrophil-to-lymphocyte ratio and mutational burden as biomarkers of tumor response to immune checkpoint inhibitors. Nat Commun. 2021;12:729. 33526794 10.1038/s41467-021-20935-9 PMC7851155 23. Banna GL Signorelli D Metro G Galetta D De Toma A Cantale O Neutrophil-to-lymphocyte ratio in combination with PD-L1 or lactate dehydrogenase as biomarkers for high PD-L1 non-small cell lung cancer treated with first-line pembrolizumab Transl Lung Cancer Res 2020 9 1533 42 10.21037/tlcr-19-583 32953525 PMC7481583 Banna GL, Signorelli D, Metro G, Galetta D, De Toma A, Cantale O, et al. Neutrophil-to-lymphocyte ratio in combination with PD-L1 or lactate dehydrogenase as biomarkers for high PD-L1 non-small cell lung cancer treated with first-line pembrolizumab. Transl Lung Cancer Res. 2020;9:1533–42. 32953525 10.21037/tlcr-19-583 PMC7481583 24. Nahm FS Receiver operating characteristic curve: overview and practical use for clinicians Korean J Anesthesiol 2022 75 25 36 10.4097/kja.21209 35124947 PMC8831439 Nahm FS. Receiver operating characteristic curve: overview and practical use for clinicians. Korean J Anesthesiol. 2022;75:25–36. 35124947 10.4097/kja.21209 PMC8831439 25. Chan TA Yarchoan M Jaffee E Swanton C Quezada SA Stenzinger A Development of tumor mutation burden as an immunotherapy biomarker: utility for the oncology clinic Ann Oncol Off J Eur Soc Med Oncol 2019 30 44 56 10.1093/annonc/mdy495 PMC6336005 30395155 Chan TA, Yarchoan M, Jaffee E, Swanton C, Quezada SA, Stenzinger A, et al. Development of tumor mutation burden as an immunotherapy biomarker: utility for the oncology clinic. Ann Oncol Off J Eur Soc Med Oncol. 2019;30:44–56. 10.1093/annonc/mdy495 PMC6336005 30395155 26. Paijens ST Vledder A de Bruyn M Nijman HW Tumor-infiltrating lymphocytes in the immunotherapy era Cell Mol Immunol 2021 18 842 59 10.1038/s41423-020-00565-9 33139907 PMC8115290 Paijens ST, Vledder A, de Bruyn M, Nijman HW. Tumor-infiltrating lymphocytes in the immunotherapy era. Cell Mol Immunol. 2021;18:842–59. 33139907 10.1038/s41423-020-00565-9 PMC8115290 27. Zhao P Li L Jiang X Li Q Mismatch repair deficiency/microsatellite instability-high as a predictor for anti-PD-1/PD-L1 immunotherapy efficacy J Hematol OncolJ Hematol Oncol 2019 12 54 10.1186/s13045-019-0738-1 31151482 PMC6544911 Zhao P, Li L, Jiang X, Li Q. Mismatch repair deficiency/microsatellite instability-high as a predictor for anti-PD-1/PD-L1 immunotherapy efficacy. J Hematol OncolJ Hematol Oncol. 2019;12:54. 31151482 10.1186/s13045-019-0738-1 PMC6544911 28. Gibney GT Weiner LM Atkins MB Predictive biomarkers for checkpoint inhibitor-based immunotherapy Lancet Oncol 2016 17 e542 51 10.1016/S1470-2045(16)30406-5 27924752 PMC5702534 Gibney GT, Weiner LM, Atkins MB. Predictive biomarkers for checkpoint inhibitor-based immunotherapy. Lancet Oncol. 2016;17:e542–51. 27924752 10.1016/S1470-2045(16)30406-5 PMC5702534 29. Chen JL-Y, Huang C-Y, Shih I-L, Liou Y-M, Tai Y-J, Chiang Y-C et al. Prognostic nutritional index and neutrophil-lymphocyte ratio predict toxicities and prognosis in patients with cervical cancer treated with curative radiochemotherapy. J Formos Med Assoc Taiwan Yi Zhi. 2023;:S0929-6646(23)00440-0. 10.1016/j.jfma.2023.10.022 37996325 30. Fan X Wang Y Yang N Zhu P Prognostic analysis of patients with stage IIIC1p cervical cancer treated by surgery World J Surg Oncol 2023 21 186 10.1186/s12957-023-03076-9 37344912 PMC10283242 Fan X, Wang Y, Yang N, Zhu P. Prognostic analysis of patients with stage IIIC1p cervical cancer treated by surgery. World J Surg Oncol. 2023;21:186. 37344912 10.1186/s12957-023-03076-9 PMC10283242 31. Bruno M Bizzarri N Teodorico E Certelli C Gallotta V Pedone Anchora L The potential role of systemic inflammatory markers in predicting recurrence in early-stage cervical cancer Eur J Surg Oncol J Eur Soc Surg Oncol Br Assoc Surg Oncol 2024 50 107311 10.1016/j.ejso.2023.107311 38056022 Bruno M, Bizzarri N, Teodorico E, Certelli C, Gallotta V, Pedone Anchora L, et al. The potential role of systemic inflammatory markers in predicting recurrence in early-stage cervical cancer. Eur J Surg Oncol J Eur Soc Surg Oncol Br Assoc Surg Oncol. 2024;50:107311. 10.1016/j.ejso.2023.107311 38056022 32. Chen S Zhang L Yan G Cheng S Fathy AH Yan N Neutrophil-to-Lymphocyte ratio is a potential prognostic biomarker in patients with ovarian cancer: A Meta-Analysis BioMed Res Int 2017 2017 7943467 28815182 10.1155/2017/7943467 PMC5549495 Chen S, Zhang L, Yan G, Cheng S, Fathy AH, Yan N, et al. Neutrophil-to-Lymphocyte ratio is a potential prognostic biomarker in patients with ovarian cancer: A Meta-Analysis. BioMed Res Int. 2017;2017:7943467. 28815182 10.1155/2017/7943467 PMC5549495 33. Crusz SM Balkwill FR Inflammation and cancer: advances and new agents Nat Rev Clin Oncol 2015 12 584 96 10.1038/nrclinonc.2015.105 26122183 Crusz SM, Balkwill FR. Inflammation and cancer: advances and new agents. Nat Rev Clin Oncol. 2015;12:584–96. 26122183 10.1038/nrclinonc.2015.105 34. Da L Qu Z Zhang C Shen Y Huang W Zhang Y Prognostic value of inflammatory markers and clinical features for survival in advanced or metastatic esophageal squamous cell carcinoma patients receiving anti-programmed death 1 treatment Front Oncol 2023 13 1144875 10.3389/fonc.2023.1144875 37035159 PMC10076857 Da L, Qu Z, Zhang C, Shen Y, Huang W, Zhang Y, et al. Prognostic value of inflammatory markers and clinical features for survival in advanced or metastatic esophageal squamous cell carcinoma patients receiving anti-programmed death 1 treatment. Front Oncol. 2023;13:1144875. 37035159 10.3389/fonc.2023.1144875 PMC10076857 35. Greten FR Grivennikov SI Inflammation and cancer: triggers, mechanisms, and consequences Immunity 2019 51 27 41 10.1016/j.immuni.2019.06.025 31315034 PMC6831096 Greten FR, Grivennikov SI. Inflammation and cancer: triggers, mechanisms, and consequences. Immunity. 2019;51:27–41. 31315034 10.1016/j.immuni.2019.06.025 PMC6831096 36. Ozawa Y Amano Y Kanata K Hasegwa H Matsui T Kakutani T Impact of early inflammatory cytokine elevation after commencement of PD-1 inhibitors to predict efficacy in patients with non-small cell lung cancer Med Oncol Northwood Lond Engl 2019 36 33 10.1007/s12032-019-1255-3 30825015 Ozawa Y, Amano Y, Kanata K, Hasegwa H, Matsui T, Kakutani T, et al. Impact of early inflammatory cytokine elevation after commencement of PD-1 inhibitors to predict efficacy in patients with non-small cell lung cancer. Med Oncol Northwood Lond Engl. 2019;36:33. 10.1007/s12032-019-1255-3 30825015 37. Wang H Huang Z Xu B Zhang J He P Gao F The predictive value of systemic immune-inflammatory markers before and after treatment for pathological complete response in patients undergoing neoadjuvant therapy for breast cancer: a retrospective study of 1994 patients Clin Transl Oncol 2024 10.1007/s12094-023-03371-7 38190034 Wang H, Huang Z, Xu B, Zhang J, He P, Gao F, et al. The predictive value of systemic immune-inflammatory markers before and after treatment for pathological complete response in patients undergoing neoadjuvant therapy for breast cancer: a retrospective study of 1994 patients. Clin Transl Oncol. 2024. 38190034 10.1007/s12094-023-03371-7 38. Fu M, Li Z, Ma J, Shen F, Zhang X. Study on the predictive value of pretreatment peripheral blood inflammatory markers regarding Immuno. 10.1080/00365521.2024.2319319 38362884 39. Huang W Jiang Y Xiong W Sun Z Chen C Yuan Q Noninvasive imaging of the tumor immune microenvironment correlates with response to immunotherapy in gastric cancer Nat Commun 2022 13 5095 10.1038/s41467-022-32816-w 36042205 PMC9427761 Huang W, Jiang Y, Xiong W, Sun Z, Chen C, Yuan Q, et al. Noninvasive imaging of the tumor immune microenvironment correlates with response to immunotherapy in gastric cancer. Nat Commun. 2022;13:5095. 36042205 10.1038/s41467-022-32816-w PMC9427761 40. Zheng M Systemic inflammation shapes clinical outcomes in response to immune checkpoint Blockade treatment: moving toward optimizing antitumor immunity J Immunother Cancer 2023 11 e006462 10.1136/jitc-2022-006462 36889809 PMC10008381 Zheng M. Systemic inflammation shapes clinical outcomes in response to immune checkpoint Blockade treatment: moving toward optimizing antitumor immunity. J Immunother Cancer. 2023;11:e006462. 36889809 10.1136/jitc-2022-006462 PMC10008381 41. Butner JD Elganainy D Wang CX Wang Z Chen S-H Esnaola NF Mathematical prediction of clinical outcomes in advanced cancer patients treated with checkpoint inhibitor immunotherapy Sci Adv 2020 6 eaay6298 10.1126/sciadv.aay6298 32426472 PMC7190324 Butner JD, Elganainy D, Wang CX, Wang Z, Chen S-H, Esnaola NF, et al. Mathematical prediction of clinical outcomes in advanced cancer patients treated with checkpoint inhibitor immunotherapy. Sci Adv. 2020;6:eaay6298. 32426472 10.1126/sciadv.aay6298 PMC7190324 42. Liu J Gao D Li J Hu G Liu J Liu D The predictive value of systemic inflammatory factors in advanced, metastatic esophageal squamous cell carcinoma patients treated with camrelizumab OncoTargets Ther 2022 15 1161 70 10.2147/OTT.S382967 PMC9553430 36238132 Liu J, Gao D, Li J, Hu G, Liu J, Liu D. The predictive value of systemic inflammatory factors in advanced, metastatic esophageal squamous cell carcinoma patients treated with camrelizumab. OncoTargets Ther. 2022;15:1161–70. 10.2147/OTT.S382967 PMC9553430 36238132 43. Qiu X Shi Z Tong F Lu C Zhu Y Wang Q Biomarkers for predicting tumor response to PD-1 inhibitors in patients with advanced pancreatic cancer Hum Vaccines Immunother 2023 19 2178791 10.1080/21645515.2023.2178791 PMC10026926 36809234 Qiu X, Shi Z, Tong F, Lu C, Zhu Y, Wang Q, et al. Biomarkers for predicting tumor response to PD-1 inhibitors in patients with advanced pancreatic cancer. Hum Vaccines Immunother. 2023;19:2178791. 10.1080/21645515.2023.2178791 PMC10026926 36809234 44. Hwang M Canzoniero JV Rosner S Zhang G White JR Belcaid Z Peripheral blood immune cell dynamics reflect antitumor immune responses and predict clinical response to immunotherapy J Immunother Cancer 2022 10 e004688 10.1136/jitc-2022-004688 35688557 PMC9189831 Hwang M, Canzoniero JV, Rosner S, Zhang G, White JR, Belcaid Z, et al. Peripheral blood immune cell dynamics reflect antitumor immune responses and predict clinical response to immunotherapy. J Immunother Cancer. 2022;10:e004688. 35688557 10.1136/jitc-2022-004688 PMC9189831 45. Tan S Zheng Q Zhang W Zhou M Xia C Feng W Prognostic value of inflammatory markers NLR, PLR, and LMR in gastric cancer patients treated with immune checkpoint inhibitors: a meta-analysis and systematic review Front Immunol 2024 15 1408700 10.3389/fimmu.2024.1408700 39050856 PMC11266030 Tan S, Zheng Q, Zhang W, Zhou M, Xia C, Feng W. Prognostic value of inflammatory markers NLR, PLR, and LMR in gastric cancer patients treated with immune checkpoint inhibitors: a meta-analysis and systematic review. Front Immunol. 2024;15:1408700. 39050856 10.3389/fimmu.2024.1408700 PMC11266030 46. Fang R Chen Y Huang B Wang Z Zhu X Liu D Predicting response to PD-1 inhibitors in head and neck squamous cell carcinomas using peripheral blood inflammatory markers Transl Oncol 2025 51 102222 10.1016/j.tranon.2024.102222 39616985 PMC11647630 Fang R, Chen Y, Huang B, Wang Z, Zhu X, Liu D, et al. Predicting response to PD-1 inhibitors in head and neck squamous cell carcinomas using peripheral blood inflammatory markers. Transl Oncol. 2025;51:102222. 39616985 10.1016/j.tranon.2024.102222 PMC11647630 47. Ouyang H Xiao B Huang Y Wang Z Baseline and early changes in the neutrophil–lymphocyte ratio (NLR) predict survival outcomes in advanced colorectal cancer patients treated with immunotherapy Int Immunopharmacol 2023 123 110703 10.1016/j.intimp.2023.110703 37536184 Ouyang H, Xiao B, Huang Y, Wang Z. Baseline and early changes in the neutrophil–lymphocyte ratio (NLR) predict survival outcomes in advanced colorectal cancer patients treated with immunotherapy. Int Immunopharmacol. 2023;123:110703. 37536184 10.1016/j.intimp.2023.110703 48. Pan C Wu Q Vicky, Voutsinas J Houlton JJ Barber B Futran N Neutrophil to lymphocyte ratio and peripheral blood biomarkers correlate with survival outcomes but not response among head and neck and salivary cancer treated with pembrolizumab and Vorinostat Head Neck 2023 45 391 7 10.1002/hed.27252 36412064 PMC9812876 Pan C, Wu Q, Vicky, Voutsinas J, Houlton JJ, Barber B, Futran N, et al. Neutrophil to lymphocyte ratio and peripheral blood biomarkers correlate with survival outcomes but not response among head and neck and salivary cancer treated with pembrolizumab and Vorinostat. Head Neck. 2023;45:391–7. 36412064 10.1002/hed.27252 PMC9812876 49. Hedrick CC Malanchi I Neutrophils in cancer: heterogeneous and multifaceted Nat Rev Immunol 2022 22 173 87 10.1038/s41577-021-00571-6 34230649 Hedrick CC, Malanchi I. Neutrophils in cancer: heterogeneous and multifaceted. Nat Rev Immunol. 2022;22:173–87. 34230649 10.1038/s41577-021-00571-6 50. Masucci MT Minopoli M Carriero MV Tumor associated neutrophils. Their role in tumorigenesis, metastasis, prognosis and therapy Front Oncol 2019 9 1146 10.3389/fonc.2019.01146 31799175 PMC6874146 Masucci MT, Minopoli M, Carriero MV. Tumor associated neutrophils. Their role in tumorigenesis, metastasis, prognosis and therapy. Front Oncol. 2019;9:1146. 31799175 10.3389/fonc.2019.01146 PMC6874146 51. Aarts CEM Hiemstra IH Béguin EP Hoogendijk AJ Bouchmal S van Houdt M Activated neutrophils exert myeloid-derived suppressor cell activity damaging T cells beyond repair Blood Adv 2019 3 3562 74 10.1182/bloodadvances.2019031609 31738831 PMC6880908 Aarts CEM, Hiemstra IH, Béguin EP, Hoogendijk AJ, Bouchmal S, van Houdt M, et al. Activated neutrophils exert myeloid-derived suppressor cell activity damaging T cells beyond repair. Blood Adv. 2019;3:3562–74. 31738831 10.1182/bloodadvances.2019031609 PMC6880908 52. Arneth B Tumor microenvironment Med Kaunas Lith 2019 56 15 10.3390/medicina56010015 PMC7023392 31906017 Arneth B. Tumor microenvironment. Med Kaunas Lith. 2019;56:15. 10.3390/medicina56010015 PMC7023392 31906017 53. Habanjar O Bingula R Decombat C Diab-Assaf M Caldefie-Chezet F Delort L Crosstalk of inflammatory cytokines within the breast tumor microenvironment Int J Mol Sci 2023 24 4002 10.3390/ijms24044002 36835413 PMC9964711 Habanjar O, Bingula R, Decombat C, Diab-Assaf M, Caldefie-Chezet F, Delort L. Crosstalk of inflammatory cytokines within the breast tumor microenvironment. Int J Mol Sci. 2023;24:4002. 36835413 10.3390/ijms24044002 PMC9964711 54. Dranoff G Cytokines in cancer pathogenesis and cancer therapy Nat Rev Cancer 2004 4 11 22 10.1038/nrc1252 14708024 Dranoff G. Cytokines in cancer pathogenesis and cancer therapy. Nat Rev Cancer. 2004;4:11–22. 14708024 10.1038/nrc1252 55. Quail DF Amulic B Aziz M Barnes BJ Eruslanov E Fridlender ZG Neutrophil phenotypes and functions in cancer: A consensus statement J Exp Med 2022 219 e20220011 10.1084/jem.20220011 35522219 PMC9086501 Quail DF, Amulic B, Aziz M, Barnes BJ, Eruslanov E, Fridlender ZG, et al. Neutrophil phenotypes and functions in cancer: A consensus statement. J Exp Med. 2022;219:e20220011. 35522219 10.1084/jem.20220011 PMC9086501 56. Que H Fu Q Lan T Tian X Wei X Tumor-associated neutrophils and neutrophil-targeted cancer therapies Biochim Biophys Acta Rev Cancer 2022 1877 188762 10.1016/j.bbcan.2022.188762 35853517 Que H, Fu Q, Lan T, Tian X, Wei X. Tumor-associated neutrophils and neutrophil-targeted cancer therapies. Biochim Biophys Acta Rev Cancer. 2022;1877:188762. 35853517 10.1016/j.bbcan.2022.188762 57. Jaillon S Ponzetta A Di Mitri D Santoni A Bonecchi R Mantovani A Neutrophil diversity and plasticity in tumour progression and therapy Nat Rev Cancer 2020 20 485 503 10.1038/s41568-020-0281-y 32694624 Jaillon S, Ponzetta A, Di Mitri D, Santoni A, Bonecchi R, Mantovani A. Neutrophil diversity and plasticity in tumour progression and therapy. Nat Rev Cancer. 2020;20:485–503. 32694624 10.1038/s41568-020-0281-y 58. Babar Q Saeed A Tabish TA Sarwar M Thorat ND Targeting the tumor microenvironment: potential strategy for cancer therapeutics Biochim Biophys Acta BBA - Mol Basis Dis 2023 1869 166746 10.1016/j.bbadis.2023.166746 37160171 Babar Q, Saeed A, Tabish TA, Sarwar M, Thorat ND. Targeting the tumor microenvironment: potential strategy for cancer therapeutics. Biochim Biophys Acta BBA - Mol Basis Dis. 2023;1869:166746. 10.1016/j.bbadis.2023.166746 37160171 59. Rubenich DS Domagalski JL Gentil GFS Eichberger J Fiedler M Weber F The Immunomodulatory Ballet of tumour-derived extracellular vesicles and neutrophils orchestrating the dynamic CD73/PD‐L1 pathway in cancer J Extracell Vesicles 2024 13 e12480 10.1002/jev2.12480 38978304 PMC11231043 Rubenich DS, Domagalski JL, Gentil GFS, Eichberger J, Fiedler M, Weber F, et al. The Immunomodulatory Ballet of tumour-derived extracellular vesicles and neutrophils orchestrating the dynamic CD73/PD‐L1 pathway in cancer. J Extracell Vesicles. 2024;13:e12480. 38978304 10.1002/jev2.12480 PMC11231043 60. Yokosuka T Takamatsu M Kobayashi-Imanishi W Hashimoto-Tane A Azuma M Saito T Programmed cell death 1 forms negative costimulatory microclusters that directly inhibit T cell receptor signaling by recruiting phosphatase SHP2 J Exp Med 2012 209 1201 17 10.1084/jem.20112741 22641383 PMC3371732 Yokosuka T, Takamatsu M, Kobayashi-Imanishi W, Hashimoto-Tane A, Azuma M, Saito T. Programmed cell death 1 forms negative costimulatory microclusters that directly inhibit T cell receptor signaling by recruiting phosphatase SHP2. J Exp Med. 2012;209:1201–17. 22641383 10.1084/jem.20112741 PMC3371732 61. Gou Q Dong C Xu H Khan B Jin J Liu Q PD-L1 degradation pathway and immunotherapy for cancer Cell Death Dis 2020 11 955 10.1038/s41419-020-03140-2 33159034 PMC7648632 Gou Q, Dong C, Xu H, Khan B, Jin J, Liu Q, et al. PD-L1 degradation pathway and immunotherapy for cancer. Cell Death Dis. 2020;11:955. 33159034 10.1038/s41419-020-03140-2 PMC7648632 62. Cha J-H Chan L-C Li C-W Hsu JL Hung M-C Mechanisms controlling PD-L1 expression in cancer Mol Cell 2019 76 359 70 10.1016/j.molcel.2019.09.030 31668929 PMC6981282 Cha J-H, Chan L-C, Li C-W, Hsu JL, Hung M-C. Mechanisms controlling PD-L1 expression in cancer. Mol Cell. 2019;76:359–70. 31668929 10.1016/j.molcel.2019.09.030 PMC6981282 63. Zhang H Liu L Liu J Dang P Hu S Yuan W Roles of tumor-associated macrophages in anti-PD-1/PD-L1 immunotherapy for solid cancers Mol Cancer 2023 22 58 10.1186/s12943-023-01725-x 36941614 PMC10029244 Zhang H, Liu L, Liu J, Dang P, Hu S, Yuan W, et al. Roles of tumor-associated macrophages in anti-PD-1/PD-L1 immunotherapy for solid cancers. Mol Cancer. 2023;22:58. 36941614 10.1186/s12943-023-01725-x PMC10029244 64. Nakamura K Smyth MJ Myeloid immunosuppression and immune checkpoints in the tumor microenvironment Cell Mol Immunol 2020 17 1 12 10.1038/s41423-019-0306-1 31611651 PMC6952382 Nakamura K, Smyth MJ. Myeloid immunosuppression and immune checkpoints in the tumor microenvironment. Cell Mol Immunol. 2020;17:1–12. 31611651 10.1038/s41423-019-0306-1 PMC6952382 ",
  "metadata": {
    "Title of this paper": "Myeloid immunosuppression and immune checkpoints in the tumor microenvironment",
    "Journal it was published in:": "Discover Oncology",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12480160/"
  }
}