{
  "title": "Paper_650",
  "abstract": "pmc Int J Mol Sci Int J Mol Sci 808 ijms ijms International Journal of Molecular Sciences 1422-0067 Multidisciplinary Digital Publishing Institute  (MDPI) PMC12470071 PMC12470071.1 12470071 12470071 41009610 10.3390/ijms26189045 ijms-26-09045 1 Review Functional Complexity of Thermogenic Adipose Tissue: From Thermogenesis to Metabolic and Fibroinflammatory Crosstalk https://orcid.org/0000-0001-5515-6473 Jalloul Wael https://orcid.org/0000-0002-4881-5407 Grierosu Irena Cristina * Jalloul Despina https://orcid.org/0000-0001-9697-750X Stefanescu Cipriana https://orcid.org/0000-0001-8233-8862 Ghizdovat Vlad Mannino Federica Academic Editor Department of Biophysics and Medical Physics-Nuclear Medicine, Grigore T. Popa University of Medicine and Pharmacy Iasi, 700115 Iasi, Romania * irena.raileanu@umfiasi.ro 17 9 2025 9 2025 26 18 497349 9045 01 8 2025 11 9 2025 14 9 2025 17 09 2025 27 09 2025 29 09 2025 © 2025 by the authors. 2025 https://creativecommons.org/licenses/by/4.0/ Licensee MDPI, Basel, Switzerland. This article is an open access article distributed under the terms and conditions of the Creative Commons Attribution (CC BY) license ( https://creativecommons.org/licenses/by/4.0/ Brown adipose tissue (BAT) has shifted from being considered a transient thermogenic organ of infancy to a metabolically dynamic and multifunctional tissue throughout life. Histologically and developmentally distinct from white and beige adipocytes, BAT originates from a myogenic lineage and is characterised by a high mitochondrial density, multilocular lipid droplets, and abundant sympathetic innervation. Its defining function, non-shivering thermogenesis, is mediated by uncoupling protein 1 (UCP1) and complemented by alternative mechanisms such as futile creatine and calcium cycling. Beyond heat production, thermogenic fat is crucial in regulating whole-body metabolism. It contributes to glucose, lipid, and branched-chain amino acid homeostasis, and engages in endocrine and paracrine signalling through a rich secretome of batokines, lipid mediators, and extracellular vesicle-bound microRNAs. These signals orchestrate crosstalk with the liver, skeletal muscle, pancreas, and immune system, enhancing insulin sensitivity, vascularisation, and anti-inflammatory responses. Brown/Beige fat also exhibits notable anti-fibrotic properties and supports adipose tissue remodelling, maintaining structural and functional plasticity under metabolic stress. This review offers a comprehensive synthesis of thermogenic adipose tissue biology, integrating its structural, developmental, and molecular features with its expanding physiological functions, highlighting its pivotal role in energy balance as well as its emerging therapeutic potential in obesity, type 2 diabetes, and related metabolic disorders. brown adipose tissue thermogenesis beige adipocytes batokines insulin sensitivity UCP1-independent pathways metabolic syndrome This research received no external funding. pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement no pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes 1. Adipose Tissue: Origins and Structural Characteristics For a considerable period, adipose tissue was viewed primarily as an inert energy reservoir and, consequently, received limited scientific attention. This perception was further reinforced by societal biases, particularly among individuals attempting to lose weight, who associated fat accumulation with negative health outcomes. However, scientific advancements have profoundly reshaped this view, showing that adipose tissue plays complex roles in systemic physiology, including endocrine, immunomodulatory, and thermogenic functions [ 1 From a cellular perspective, adipose tissue is far more heterogeneous than initially believed. While mature adipocytes account for the majority of tissue volume, particularly in white adipose depots, these cells represent only around 50% of the total cell population. The remaining fraction, known as the stromal vascular compartment, comprises preadipocytes, immune cells, endothelial cells, pericytes, nerve fibres, and fibroblasts. This diversity underlines the dynamic nature of adipose tissue and its ability to respond to varying physiological states [ 2 3 Far from being solely structural, the extracellular matrix (ECM) of adipose tissue plays a central role in modulating cellular behaviour and facilitating tissue expansion. Composed of proteins like collagen (types I, III, and VI), laminin, fibronectin, and various proteoglycans, the ECM undergoes constant remodelling. These changes influence adipocyte differentiation, immune cell infiltration, vascularisation, and metabolic regulation. Dysregulation of ECM dynamics is closely associated with adipose dysfunction in metabolic disorders such as obesity and type 2 diabetes (T2D) [ 2 4 5 In addition to adipocytes, adipose tissue exhibits numerous immune cells, including macrophages, lymphocytes, and mast cells, as well as extensive vascular and neural networks. The number and type of immune cells present vary depending on the tissue’s metabolic condition. For example, pro-inflammatory macrophages accumulate in obese states and contribute to insulin resistance, whereas anti-inflammatory phenotypes are more prevalent in lean tissue. This immunological environment is vital for maintaining local and systemic metabolic homeostasis [ 3 6 Moreover, adipose tissue shows a notable capacity for regeneration. It is now well established that human fat cells are renewed at a steady rate of approximately 10% per year. This rate implies a complete turnover of adipocytes approximately every 10 to 12 years. Such regenerative dynamics are comparable to bone remodelling and highlight the tissue’s continuous adaptation to metabolic demands throughout life [ 7 8 Considering the distinctions in origins, structure, growth, and function, professionals categorised adipose tissue into three principal varieties: white adipose tissue (WAT), brown adipose tissue (BAT), and beige adipose tissue (BeigeAT). WAT primarily stores energy, BAT dissipates energy through thermogenesis, and BeigeAT emerges in white depots under certain stimuli, exhibiting thermogenic properties. Each type differs in cellular origin, morphology, and metabolic role, justifying this classification within the broader adipose lineage [ 1 9 1.1. White Adipose Tissue The development of human WAT originates during mid-gestation, particularly between weeks 13 and 27 of foetal development, when progenitor cells derived from the mesoderm begin differentiating into preadipocytes. These cells ultimately mature into white adipocytes under the influence of local and systemic signalling factors, including hormonal, nutritional, and transcriptional regulators [ 1 10 11 1 White fat becomes the predominant form of adipose tissue in adulthood, typically representing 15–25% of total body mass in men and 25–35% in women, depending on age, sex hormones, and lifestyle factors [ 12 13 14 13 The defining structural unit of WAT is the unilocular adipocyte, which is a large spherical cell that contains a single lipid droplet occupying most of the intracellular space. The cytoplasm is thinly distributed, and mitochondria are relatively few, distinguishing white adipocytes morphologically and functionally from their brown and beige counterparts [ 9 12 Functionally, WAT is far more than a passive reservoir of lipids. It plays central roles in systemic metabolic regulation, including endocrine signalling via adipokines (such as leptin and adiponectin), energy homeostasis, thermoregulation, immune responses, and glucose metabolism [ 15 16 17 18 12 15 19 20 1.2. Beige Adipose Tissue Beige adipocytes originate from a precursor population resembling vascular smooth muscle-like cells that are negative for the transcription factors paired box 7 (PAX7) and myogenic factor 5 (MYF5), with PAX7 being essential for the maintenance of quiescent muscle satellite cells and MYF5 playing a crucial role in the early commitment of these progenitors to the myogenic lineage. In vivo lineage-tracing experiments using Myh11-Cre models have confirmed that at least a subset of beige cells arises from this smooth muscle-like lineage, rather than the myogenic line that gives rise to classical brown adipocytes [ 21 Despite their different developmental origin, beige and brown adipocytes share a key transcriptional regulator, the PR domain containing 16 (PRDM16), which orchestrates thermogenic gene programmes. PRDM16 overexpression in subcutaneous WAT induces thermogenic genes such as UCP1, cell death-inducing DNA fragmentation factor-like effector A (CIDEA), and peroxisome proliferator-activated receptor gamma coactivator 1-α (PGC1α), enabling the conversion of white or beige progenitors into thermogenically active cells [ 21 22 Morphologically, beige adipocytes are distinguishable by multilocular to unilocular lipid droplets and an intermediate mitochondrial density. They possess a moderate mitochondrial content, greater than WAT but lower than BAT [ 23 21 24 Although BeigeAT can adopt a white-fat-like phenotype under warm ambient conditions, it maintains the potential to activate a thermogenic programme under appropriate stimuli. However, human epidemiological and imaging studies indicate that the abundance and functional relevance of beige fat in adult humans can be variable and context-dependent, warranting further investigation [ 25 1.3. Brown Adipose Tissue During human foetal development, classical BAT arises from a specialised subpopulation of mesodermal progenitor cells expressing PAX7, MYF5, and engrailed 1 (EN1), which also contributes to skeletal muscle and dermal lineages [ 22 26 27 12 1 28 In certain situations, such as cold exposure, research has shown that adults can reactivate brown fat, which accounts for only ~1.5% of body mass and 4.3% of total adipose tissue [ 12 29 30 31 32 33 31 32 33 Brown adipocytes are characterised by multiple small lipid droplets and a notably dense population of mitochondria, which imparts their distinctive brown nuance [ 12 34 35 36 37 34 37 Figure 1 In addition to sympathetic stimulation, several endocrine and paracrine factors strongly modulate BAT development and thermogenic activation. Cardiac natriuretic peptides, such as atrial natriuretic peptide (ANP), have been shown to directly induce lipolysis and UCP1 expression in both human and murine adipocytes through cGMP–p38 MAPK signalling [ 39 Thyroid hormone signalling is also indispensable, as triiodothyronine (T3) enhances mitochondrial biogenesis and UCP1 transcription in brown adipocytes, and local activation by type II deiodinase is critical for full thermogenic competence [ 40 41 Bone morphogenetic protein 7 (BMP7) promotes commitment of mesenchymal progenitors toward the brown adipocyte lineage and potently induces UCP1 expression and mitochondrial biogenesis in vitro and in vivo [ 42 Furthermore, the myokine irisin, released from skeletal muscle during exercise, was shown to drive browning of white adipose tissue and increase UCP1 levels through the induction of thermogenic gene programmes [ 43 Collectively, these findings reinforce the integrative role of endocrine and paracrine cues in the regulation of BAT and its systemic metabolic effects. 2. How Does BAT Work? BAT primarily functions to prevent hypothermia by releasing excess energy as heat, and notably, thermogenesis can occur without triggering muscle shivering in response to cold exposure, thus helping maintain thermal and energy balance [ 44 Beyond heat production, both BAT and beige fat play essential roles in metabolic regulation by clearing various substrates from circulation, including glucose, fatty acids, cholesterol, and branched-chain amino acids (BCAAs) [ 45 46 47 45 At the tissue level, thermogenic fat is distinguished by lower levels of inflammation and fibrosis, alongside increased angiogenesis and lipid turnover, collectively contributing to tissue integrity and systemic metabolic homeostasis [ 44 Furthermore, BAT and beige adipocytes secrete signalling molecules, termed batokines, that act through autocrine, paracrine, and endocrine pathways. These include hormones (e.g., fibroblast growth factor 21 (FGF21), neuregulin 4 (NRG4), interleukin 6 (IL-6), vascular endothelial growth factor A (VEGF-A)), lipid mediators (e.g., 12,13-dihydroxy-9Z-octadecenoic acid (12,13-diHOME)), and exosomal microRNAs (e.g., microRNA-99b (miR-99b)). Collectively, batokines enhance insulin sensitivity, regulate lipid and glucose metabolism, and influence vascular and immune functions. Beyond thermogenesis, BAT also contributes to systemic lipid clearance and protection against atherosclerosis, underscoring its role as a regulator of metabolic and cardiovascular health [ 32 33 48 49 These combined actions of BAT and beige fat, thermogenesis, substrate clearance, tissue remodelling, and adipokines secretion, emphasise their potential as therapeutic targets in combating obesity, type 2 diabetes, and related metabolic disorders. These functions are summarised in Figure 2 49 50 2.1. Thermoregulatory Function Since the discovery of brown fat in human adults, there has been a growing interest in understanding its physiology and function. Preserving the stability of the body’s internal temperature is essential for appropriate physiological functioning. Known as a non-shivering “heat producer”, BAT mainly works to sustain an optimal body temperature [ 50 9 Beyond the primary role of BAT mitochondria in synthesising ATP, they are also capable of generating heat. During ATP production, the F1F0-ATPase complex in the mitochondrial inner membrane depends on an electrochemical gradient formed by the translocation of H + 1 51 + + 50 52 51 53 Initially, it was believed that UCP1-mediated uncoupling required intracellular free fatty acids (FAs), released through local lipolysis in brown adipocytes. Cold exposure and β3-adrenergic signalling induce lipolysis, producing FAs that directly bind and activate UCP1, supporting β-oxidation and thermogenesis. Earlier studies using genetic ablation of adipose triglyceride lipase (ATGL) or its coactivator comparative gene identification-58 (CGI-58) suggested that local brown fat lipolysis might not be strictly necessary, as heat production in BAT was maintained under cold exposure [ 54 55 56 57 58 Moreover, hepatic breakdown of WAT-derived fatty acids promotes the synthesis of acylcarnitines, a class of FA derivatives that can be transported to BAT and utilised to enhance mitochondrial β-oxidation and heat generation, thus highlighting an inter-organ collaboration between WAT, the liver, and BAT [ 59 60 61 In beige adipocytes, an additional thermogenic mechanism, superstoichiometric futile creatine cycling, has been identified. In this pathway, ATP produced by the ETC is transported from the mitochondrial matrix to the intermembrane space by the adenine nucleotide translocator (ANT). This ATP is used by creatine kinase B (CKB) to convert creatine into phosphocreatine (PCr). Subsequently, tissue-nonspecific alkaline phosphatase (TNAP) hydrolyses PCr back to creatine, generating heat as a byproduct of this futile cycle [ 1 51 62 Studies suggest that futile creatine cycling operates independently of UCP1 and may contribute to thermogenesis under specific stimuli such as pharmacologic agents (e.g., β3-agonists) or exercise-induced browning of WAT. This pathway is gaining attention for its therapeutic potential in obesity and metabolic syndrome, especially in individuals with low UCP1 activity [ 63 64 Researchers indicate that post-translational modifications can regulate mitochondrial uncoupled respiration. Upon cold exposure, reactive oxygen species (ROS) induce sulfenylation of cysteine residue Cys253 in UCP1, a site located near the purine nucleotide-binding interface within the inner mitochondrial membrane, thereby promoting thermogenic activity [ 65 66 Heat generation can also occur via UCP1-independent mechanisms such as calcium (Ca 2+ 2+ 2+ 2+ 2+ 2+ 67 2+ Type 1 SERCA (SERCA1), specific to skeletal muscle, interacts with the micropeptide sarcolipin (Sln), which uncouples ATP hydrolysis from Ca 2+ 68 2+ 69 ❖ The import of calcium ions into the intracellular space is stimulated by activated α1-adrenergic receptors. ❖ Type 2 RYR (RYR2) is stimulated by activated β3-adrenergic receptors, resulting in an increase in calcium ion discharge from the endoplasmic reticulum. Evidence has confirmed these mechanisms in vivo using an optogenetic approach to specifically induce UCP1-independent Ca 2+ 70 50 71 Figure 3 Table 1 In addition to calcium and creatine cycling, a futile lipid cycle has been proposed as another UCP1-independent thermogenic mechanism. This process involves continuous triglyceride hydrolysis and re-esterification, consuming ATP and dissipating energy as heat, and acts as an intra-adipocyte metabolic rheostat [ 77 78 Alongside these mechanisms, recent work has identified Chromosome 4 open reading frame 3 (C4orf3) (also termed ALN) as an endoplasmic reticulum-anchored peptide that acts as a molecular resistor of SERCA2b-mediated Ca 2+ 2+ 79 2.2. Principal Metabolic Functions While the thermogenic function of BAT has long been recognised, research has increasingly highlighted its broader metabolic significance, particularly its potential role in maintaining systemic energy homeostasis and mitigating a range of metabolic disorders [ 80 2.2.1. Glucose Homeostasis BAT fulfils its thermogenic role by actively absorbing glucose following catecholamine stimulation. In parallel, insulin acts synergistically by binding to insulin receptors on brown adipocytes and activating downstream signalling, which drives the translocation of glucose transporter type 4 (GLUT4) to the cell surface. This mechanism significantly enhances the movement of glucose into the cells, thereby promoting intracellular glucose uptake [ 50 80 Moreover, BAT mass and activity decline with age and in metabolic disorders, a process often referred to as BAT involution. This reduction in functional brown adipocytes may contribute to impaired glucose uptake, diminished insulin sensitivity, and systemic metabolic dysregulation [ 81 82 83 Of note, brown and white adipose tissues exhibit distinct glucose uptake mechanisms. While glucose entry into WAT is strictly dependent on insulin-stimulated GLUT4, brown adipocytes are capable of utilising glucose transporter type 1 (GLUT1) independently of insulin via adrenergic stimulation [ 84 85 As previously discussed, adipocytes expressing UCP1 play a crucial role in maintaining glucose homeostasis. This function has been substantiated by numerous studies: ❖ Genetic deletion of UCP1 in murine models leads to hyperglycaemia, hyperinsulinaemia, and increased adiposity [ 86 ❖ Brown fat transplantation enhances insulin sensitivity and glucose uptake in both WAT and BAT through insulin-mediated pathways [ 87 CL316243 88 ❖ Overexpression of PRDM16, a key transcriptional regulator of beige adipocyte identity, leads to elevated BeigeAT activity and improved insulin and glucose responsiveness. Conversely, PRDM16-deficient mice show diminished beige fat development and impaired insulin sensitivity [ 22 89 ❖ In models with PRDM16 overexpression but lacking UCP1, glucose uptake remained elevated, suggesting that BeigeAT retains insulin sensitivity independently of UCP1-mediated thermogenesis [ 69 ❖ Studies have identified a non-thermogenic function of BAT in the regulation of systemic insulin sensitivity. Specifically, impaired mitochondrial BCAA uptake via the transporter Solute Carrier Family 25 Member 44 (SLC25A44) in BAT leads to intracellular accumulation of BCAAs and their ketoacid derivatives (BCKAs), resulting in elevated oxidative stress, disrupted hepatic insulin signalling, and widespread insulin resistance. Notably, these effects occur independently of changes in energy expenditure or overall adiposity [ 90 91 ❖ Batokine production, including FGF21, appears to connect BAT to systemic glucose metabolism. FGF21 released by activated BAT exerts endocrine actions on liver and adipose tissue, enhancing glucose disposal and promoting WAT browning [ 92 93 94 95 96 ❖ In obese individuals, reduced BAT thermogenesis and insulin sensitivity are commonly observed. Nonetheless, multiple studies suggest that activation of thermogenic pathways, regardless of the stimulus, can restore glycaemic control and insulin responsiveness in this population [ 97 31 32 98 Beyond adipose-specific effects, both BAT and BeigeAT are increasingly recognised as regulators of whole-body glucose metabolism, with potential roles in modulating insulin action in tissues such as the liver and skeletal muscle. Although these systemic interactions remain incompletely characterised, current evidence points to their involvement in energy expenditure, anti-inflammatory signalling, and endocrine crosstalk with other metabolic organs [ 50 Recent studies have highlighted an additional metabolic aspect of BAT: its potential to suppress tumour growth by outcompeting cancer cells for glucose. Exposure of tumour-bearing mice to cold conditions activates BAT, leading to a substantial decrease in blood glucose levels and reducing glycolysis in cancer cells. Furthermore, implanting engineered adipocytes that utilise increased amounts of glucose and fatty acids has been shown to suppress tumour progression, further supporting a direct competition for metabolic resources between BAT and cancer cells [ 99 100 2.2.2. Synthesis and Degradation of Lipids Free FAs are a vital energy source for BAT and BeigeAT, complementing glucose to sustain their thermogenic and metabolic functions [ 50 56 Preclinical studies have demonstrated that cold exposure in mice enhances fatty acid uptake by BAT, reducing circulating triglyceride-rich lipoproteins (TRLs) [ 101 CL316243 47 Moreover, BAT activation has been associated with increased high-density lipoprotein cholesterol (HDL-C), enhancing cholesterol efflux and HDL regeneration [ 101 102 103 104 Lipidomic analyses have revealed that BAT undergoes dynamic remodelling during metabolic challenge, modulating its lipid mediator profile and systemic impacts [ 105 106 A growing body of research has shed light on the influence of both BAT and BeigeAT on lipid metabolism, particularly through their roles in fat-driven inter-organ communication. This complex, multi-organ crosstalk is typically initiated by cold exposure and unfolds through a series of tightly regulated steps, ultimately contributing to the restoration of systemic lipid homeostasis [ 50 107 108 ❖ Cold stimulation of the body initiates hepatic conversion of cholesterol into bile acids, followed by their excretion. ❖ These bile acids play a key role in maintaining intestinal microbiota homeostasis. ❖ In turn, the bile acids stimulate gut microbial activity and metabolite production. ❖ The combination of microbiota-derived signalling molecules and bile acids in the circulation activates brown adipocytes. ❖ Activated BAT secretes phospholipid transfer protein (PLTP). ❖ PLTP supports HDL biogenesis, particularly in structural stabilisation. ❖ The resulting HDL particles reduce circulating ceramide and phospholipid levels and enhance lipid excretion via faeces. In contrast to these protective mechanisms, statin therapy has been shown to impair BAT and BeigeAT function by interfering with the mevalonate and geranylgeranyl pyrophosphate biosynthesis pathways, potentially limiting their lipid-processing capacity [ 109 Taken together, these findings illustrate the complex and systemic role of brown and beige adipose tissues in lipid synthesis and clearance. Nonetheless, further clinical and mechanistic research is required to fully characterise these endocrine and metabolic interactions. 2.2.3. Branched-Chain Amino Acid Consumption Extensive research has characterised BCAAs, leucine (Leu), valine (Val), and isoleucine (Ile) as essential not only for protein synthesis, athletic recovery, and cognitive and psychomotor performance [ 110 111 90 112 50 90 In murine models, impaired BCAA catabolism, resulting from deficient mitochondrial enzymes such as branched-chain keto acid dehydrogenase e1 α subunit (BCKDHA) or branched-chain amino acid transaminase 2 (BCAT2), leads to elevated plasma BCAAs, reduced insulin sensitivity, glucose intolerance, and weight gain [ 90 113 114 113 115 BAT and BeigeAT play a critical role in systemic BCAA clearance. Cold-activated BAT significantly increases BCAA-nitrogen flux and metabolite synthesis [ 91 18 45 In addition, BCAAs serve as substrates for the generation of monomethyl branched-chain fatty acids (mmBCFAs) in BAT and other tissues, especially following cold exposure. These unique lipids derive from BCAA carbon and contribute to adipose tissue lipid synthesis [ 114 115 114 116 2.3. Produced Adipokines and Their Effects Brown and beige fats are metabolically active tissues that secrete a complex array of signalling proteins, often referred to as adipokines, adipocytokines, or, more specifically, batokines. These bioactive molecules function in both autocrine/paracrine and endocrine manners and play a pivotal role in maintaining whole-body metabolic homeostasis [ 1 9 87 117 Support for these endocrine effects has been established through comparisons of animal models either lacking BAT or genetically modified to lack the mitochondrial UCP1. In both scenarios, substantial physiological alterations were observed, indicating that thermogenic fat plays more than a local metabolic role [ 86 118 69 Expanding on this concept, researchers have catalogued numerous BAT/BeigeAT-derived polypeptides that impact not only neighbouring cells but also distant tissues via systemic circulation [ 107 119 120 121 Table 2 In addition to peptide-based signals, BAT also produces specific lipid-derived metabolites, including 12,13-diHOME. Exposure to cold has been shown to elevate circulating levels of this oxylipin, which promotes lipid uptake in brown adipocytes [ 61 131 Moreover, brown fat is capable of generating extracellular vesicles carrying functional microRNAs, which participate in both local and systemic gene regulation. These vesicle-bound microRNAs mediate communication with other tissues, such as the liver, pancreas, and skeletal muscle, and may play a role in modulating insulin signalling and lipid metabolism [ 132 133 Despite this growing body of knowledge, the complete spectrum of batokines, particularly those with therapeutic relevance, remains incompletely elucidated. It is therefore essential to identify new molecular actors secreted by BAT/BeigeAT and to characterise their target tissues, mechanisms of action, and potential as clinical tools for treating obesity-related metabolic disorders ( Figure 4 2.4. Fibro-Inflammatory Aspects The structural integrity and intercellular signalling of adipocytes are heavily reliant on the ECM and its intricate composition [ 5 135 5 136 137 138 An imbalanced ECM, particularly an excess of pro-fibrotic components like collagen types I, III, and VI, can result in dysfunctional, fibrotic adipose tissue [ 139 17 140 141 142 143 In contrast, brown and beige fats exhibit protective anti-fibrotic properties. These benefits were evident in preclinical models exposed to cold or PRDM16 stimulation, both of which promoted ECM remodelling, favouring adipocyte health [ 144 145 144 Two principal molecular pathways have been elucidated by which thermogenic brown and beige adipose tissues exert anti-fibrotic effects. First, PRDM16 stimulates the local secretion of β-hydroxybutyrate (BHB), which suppresses fibrogenesis in adipose precursor cells and promotes beige adipocyte differentiation [ 145 144 145 In addition, the benefits of BAT/BeigeAT in controlling blood glucose levels have been shown to be related to their capacity to fight fibro-inflammation. These findings have been demonstrated in a group of animals that showed an enhancement in insulin and glucose tolerances after receiving BHB. Moreover, the high expression of GTF2IRD1 in thermogenic fat has also been correlated with better glucose and insulin metabolism [ 144 It has been observed that the composition of the ECM is closely linked to the thermogenic activity of brown and beige adipose tissues, particularly their capacity to generate heat [ 121 146 147 148 138 149 150 Another important aspect is that both white and brown fat contribute significantly to immune system regulation by modulating immune responses through the secretion of tissue-specific signalling molecules that influence the complement cascade [ 120 120 In individuals with obesity, white adipocytes produce a range of pro-inflammatory cytokines, including tumour necrosis factor-α (TNF-α), interferon-γ, interleukin-1β (IL-1β), and IL-6, which collectively increase macrophage infiltration in adipose tissue from below 10% to nearly 40% [ 151 152 153 154 155 156 In contrast, BAT displays anti-inflammatory properties and may attenuate immune activation in obesity. For instance, research has shown that elevated expression of programmed death ligand 1 (PD-L1) in brown adipocytes reduces T-cell activation [ 157 1 158 Figure 5 3. Conclusions BAT has evolved from a physiological curiosity to a central player in metabolic homeostasis, immunomodulation, and inter-organ communication. Its unique origin, structural specialisation, and bioenergetic capacity, anchored in both UCP1-dependent and alternative thermogenic mechanisms, grant BAT and beige fat a distinct identity within the adipose lineage. More than a site of heat production, BAT/BeigeAT acts as a systemic metabolic regulator, capable of clearing glucose, lipids, and amino acids while secreting a diverse array of bioactive molecules that affect distant tissues. The endocrine and paracrine networks emerging from thermogenic fat depots underscore their integration within broader physiological systems, including the liver, pancreas, skeletal muscle, cardiovascular system, and immune landscape. Furthermore, the anti-fibrotic and anti-inflammatory properties of BAT/BeigeAT not only sustain tissue plasticity but also offer protection against metabolic dysfunction and organ crosstalk failure. As the global burden of obesity and metabolic syndrome escalates, BAT/BeigeAT offers a compelling therapeutic target, one that combines energy expenditure, substrate clearance, endocrine signalling, and tissue remodelling in a single physiological unit. Yet, despite significant progress in imaging, mechanistic understanding, and functional characterisation, the clinical translation of thermogenic fat-based strategies remains in its infancy. The question is no longer whether brown and beige adipose tissues are relevant to adult human health, but how we can activate, sustain, and harness their full potential in real-world metabolic medicine. Future research must move beyond description and into intervention. Large-scale clinical trials, longitudinal metabolic imaging, and precise molecular targeting are urgently needed to bridge the gap between BAT/BeigeAT biology and therapeutic innovation. The next frontier in adipose research is not in understanding if thermogenic fat can be therapeutic, but how fast we can make that a reality. Acknowledgments The authors would like to thank Cipriana Stefanescu for insightful scientific discussions and valuable guidance during the development of this manuscript. Disclaimer/Publisher’s Note: Author Contributions Conceptualization, W.J., V.G. and D.J.; methodology, C.S., I.C.G. and W.J.; software, D.J.; validation, C.S.; formal analysis, I.C.G.; investigation, W.J. and V.G.; resources, W.J., V.G.; data curation, W.J.; writing—original draft preparation, W.J. and D.J.; writing—review and editing, W.J. and D.J.; visualization, I.C.G.; supervision, V.G. and C.S. All authors have read and agreed to the published version of the manuscript. Institutional Review Board Statement Not applicable. Informed Consent Statement Not applicable. Data Availability Statement Not applicable. Conflicts of Interest The authors declare no conflicts of interest. Abbreviations The following abbreviations are used in this manuscript: 12,13-diHOME 12,13-dihydroxy-9z-octadecenoic acid AMPK AMP-activated protein kinase ANP atrial natriuretic peptide ANT adenine nucleotide translocator APOA5 apolipoprotein A-V ATGL adipose triglyceride lipase ATP adenosine triphosphate BAT brown adipose tissue BCAAs branched-chain amino acids BCAT1/2 branched-chain amino acid aminotransferase 1 or 2 BCAT2 branched-chain amino acid transaminase 2 BCKAs branched-chain keto acids BCKDHA branched-chain keto acid dehydrogenase e1 α subunit BCKDHB branched-chain keto acid dehydrogenase e1 β subunit BeigeAT beige adipose tissue BHB β-hydroxybutyrate BMP bone morphogenetic protein BMP7 bone morphogenetic protein 7 BMP8B bone morphogenetic protein 8b C4orf3 chromosome 4 open reading frame 3 CACT carnitine-acylcarnitine translocase Ca 2+ calcium CD36 cluster of differentiation 36 CFH complement factor H CGI-58 coactivator comparative gene identification 58 cGMP–p38 MAPK cyclic guanosine monophosphate–p38 mitogen-activated protein kinase CIDEA Cell death–inducing DNA fragmentation factor-like effector A CKB creatine kinase B COL6A3 collagen type VI α 3 CoQ coenzyme Q CPT1 carnitine palmitoyltransferase I CPT2 carnitine palmitoyltransferase II CTGF connective tissue growth factor CXCL14 C-X-C motif chemokine ligand 14 Cyt C cytochrome C ECM extracellular matrix EN1 engrailed 1 EPSTI1 epithelial stromal interaction 1 ETC electron transport chain ETP endotrophin FAs fatty acids FGF21 fibroblast growth factor 21 GDF15 growth differentiation factor 15 GLUT1 glucose transporter type 1 GLUT4 glucose transporter type 4 GTF2IRD1 general transcription factor 2 I repeat domain-containing 1 HDL-C high-density lipoprotein cholesterol IL-1β interleukin-1β IL-6 Interleukin-6 Ile isoleucine IP3R inositol trisphosphate receptors LAMA4 laminin α 4 Leu leucine LHX8 lim homeobox protein 8 LPL lipoprotein lipase miR-99b microRNA-99b mmBCFAs monomethyl branched-chain fatty acids MMP metalloproteinase mTORC2 mechanistic target of rapamycin complex 2 MYF5 myogenic factor 5 NGF nerve growth factor NRG4 neuregulin 4 PAX7 paired box 7 PCr phosphocreatine PD-L1 programmed death ligand 1 PGC1α peroxisome proliferator-activated receptor gamma coactivator 1-α Pi inorganic phosphate PLTP phospholipid transfer protein PPARγ peroxisome proliferator activated receptor PRDM16 pr domain containing 16 ROS reactive oxygen species RYR2 type 2 RYR RYRs ryanodine receptors S100B s100 calcium-binding protein B SDH succinate dehydrogenase SERCA sarcoplasmic/endoplasmic reticulum calcium ATPase SERCA1 type 1 SERCA SERCA2B type 2b SERCA SIRT5 desuccinylase sirtuin 5 SLC25A44 solute carrier family 25 member 44 SLIT2 slit guidance ligand 2 Sln sarcolipin SNS sympathetic nervous system T2D type 2 diabetes T3 triiodothyronine TBX1 t-box 1 TCA tricarboxylic acid TCF21 transcription factor 21 TGF-β transforming growth factor-β TLE3 transducin-like enhancer of split 3 TMEM26 transmembrane protein 26 TNAP tissue-nonspecific alkaline phosphatase TNF-α tumour necrosis factor-α TRLs triglyceride-rich lipoproteins UCP1 uncoupling protein 1 Val valine VEGF-A vascular endothelial growth factor A VLDL-TG very-low-density lipoprotein triglycerides WAT white adipose tissue ZIC1 zinc finger protein of the cerebellum 1 References 1. Cypess A.M. Reassessing Human Adipose Tissue N. Engl. J. Med. 2022 386 768 779 10.1056/NEJMra2032804 35196429 2. Mo Y.-Y. Han Y.-X. Xu S.-N. Jiang H.-L. Wu H.-X. Cai J.-M. Li L. Bu Y.-H. Xiao F. Liang H.-D. Adipose Tissue Plasticity: A Comprehensive Definition and Multidimensional Insight Biomolecules 2024 14 1223 10.3390/biom14101223 39456156 PMC11505740 3. Di Rocco G. Trivisonno A. Trivisonno G. Toietta G. Dissecting Human Adipose Tissue Heterogeneity Using Single-cell Omics Technologies Stem Cell Res. Ther. 2024 15 322 10.1186/s13287-024-03931-w 39334440 PMC11437900 4. Sun K. Li X. Scherer P.E. Extracellular Matrix (ECM) and Fibrosis in Adipose Tissue: Overview and Perspectives Compr. Physiol. 2023 13 4387 4407 10.1002/j.2040-4603.2023.tb00254.x 36715281 PMC9957663 5. Ruiz-Ojeda F.J. Méndez-Gutiérrez A. Aguilera C.M. Plaza-Díaz J. Extracellular Matrix Remodeling of Adipose Tissue in Obesity and Metabolic Diseases Int. J. Mol. Sci. 2019 20 4888 10.3390/ijms20194888 31581657 PMC6801592 6. Wensveen F.M. Valentić S. Šestan M. Turk Wensveen T. Polić B. The “Big Bang” in Obese Fat: Events Initiating Obesity-Induced Adipose Tissue Inflammation Eur. J. Immunol. 2015 45 2446 2456 10.1002/eji.201545502 26220361 7. Spalding K.L. Arner E. Westermark P.O. Bernard S. Buchholz B.A. Bergmann O. Blomqvist L. Hoffstedt J. Näslund E. Britton T. Dynamics of Fat Cell Turnover in Humans Nature 2008 453 783 787 10.1038/nature06902 18454136 8. Sender R. Milo R. The Distribution of Cellular Turnover in the Human Body Nat. Med. 2021 27 45 48 10.1038/s41591-020-01182-9 33432173 9. Sampath S.C. Sampath S.C. Bredella M.A. Cypess A.M. Torriani M. Imaging of Brown Adipose Tissue: State of the Art Radiology 2016 280 4 19 10.1148/radiol.2016150390 27322970 PMC4942993 10. Berry D.C. Stenesen D. Zeve D. Graff J.M. The Developmental Origins of Adipose Tissue Development 2013 140 3939 3949 10.1242/dev.080549 24046315 PMC3775412 11. Berry R. Rodeheffer M.S. Characterization of the Adipocyte Cellular Lineage in Vivo Nat. Cell Biol. 2013 15 302 308 10.1038/ncb2696 23434825 PMC3721064 12. Koenen M. Hill M.A. Cohen P. Sowers J.R. Obesity, Adipose Tissue and Vascular Dysfunction Circ. Res. 2021 128 951 968 10.1161/CIRCRESAHA.121.318093 33793327 PMC8026272 13. Gallagher D. Heymsfield S.B. Heo M. Jebb S.A. Murgatroyd P.R. Sakamoto Y. Healthy Percentage Body Fat Ranges: An Approach for Developing Guidelines Based on Body Mass Index123 Am. J. Clin. Nutr. 2000 72 694 701 10.1093/ajcn/72.3.694 10966886 14. Levitt D.G. Heymsfield S.B. Pierson R.N. Shapses S.A. Kral J.G. Physiological Models of Body Composition and Human Obesity Nutr. Metab. 2007 4 19 Erratum in Nutr. Metab. 2009 6 10.1186/1743-7075-4-19 PMC2082278 17883858 15. Emont M.P. Jacobs C. Essene A.L. Pant D. Tenen D. Colleluori G. Di Vincenzo A. Jørgensen A.M. Dashti H. Stefek A. A Single-Cell Atlas of Human and Mouse White Adipose Tissue Nature 2022 603 926 933 Erratum in Nature 2023 620 10.1038/s41586-022-04518-2 35296864 PMC9504827 16. Rosen E.D. Spiegelman B.M. What We Talk about When We Talk about Fat Cell 2014 156 20 44 10.1016/j.cell.2013.12.012 24439368 PMC3934003 17. Sun K. Tordjman J. Clément K. Scherer P.E. Fibrosis and Adipose Tissue Dysfunction Cell Metab. 2013 18 470 477 10.1016/j.cmet.2013.06.016 23954640 PMC3795900 18. Arner P. Andersson D.P. Bäckdahl J. Dahlman I. Rydén M. Weight Gain and Impaired Glucose Metabolism in Women Are Predicted by Inefficient Subcutaneous Fat Cell Lipolysis Cell Metab. 2018 28 45 54.e3 10.1016/j.cmet.2018.05.004 29861390 19. DeMarco V.G. Aroor A.R. Sowers J.R. The Pathophysiology of Hypertension in Patients with Obesity Nat. Rev. Endocrinol. 2014 10 364 376 10.1038/nrendo.2014.44 24732974 PMC4308954 20. Aroor A.R. McKarns S. Demarco V.G. Jia G. Sowers J.R. Maladaptive Immune and Inflammatory Pathways Lead to Cardiovascular Insulin Resistance Metabolism 2013 62 1543 1552 10.1016/j.metabol.2013.07.001 23932846 PMC3809332 21. Long J.Z. Svensson K.J. Tsai L. Zeng X. Roh H.C. Kong X. Rao R.R. Lou J. Lokurkar I. Baur W. A Smooth Muscle-like Origin for Beige Adipocytes Cell Metab. 2014 19 810 820 10.1016/j.cmet.2014.03.025 24709624 PMC4052772 22. Seale P. Bjork B. Yang W. Kajimura S. Chin S. Kuang S. Scimè A. Devarakonda S. Conroe H.M. Erdjument-Bromage H. PRDM16 Controls a Brown Fat/Skeletal Muscle Switch Nature 2008 454 961 967 10.1038/nature07182 18719582 PMC2583329 23. Machado S.A. Pasquarelli-do-Nascimento G. da Silva D.S. Farias G.R. de Oliveira Santos I. Baptista L.B. Magalhães K.G. Browning of the White Adipose Tissue Regulation: New Insights into Nutritional and Metabolic Relevance in Health and Diseases Nutr. Metab. 2022 19 61 10.1186/s12986-022-00694-0 PMC9446768 36068578 24. Kajimura S. Spiegelman B.M. Seale P. Brown and Beige Fat: Physiological Roles beyond Heat Generation Cell Metab. 2015 22 546 559 10.1016/j.cmet.2015.09.007 26445512 PMC4613812 25. Lizcano F. The Beige Adipocyte as a Therapy for Metabolic Diseases Int. J. Mol. Sci. 2019 20 5058 10.3390/ijms20205058 31614705 PMC6834159 26. Schulz T.J. Tseng Y.-H. Brown Adipose Tissue: Development, Metabolism and Beyond Biochem. J. 2013 453 167 178 10.1042/BJ20130457 23805974 PMC3887508 27. Zhang C. Weng Y. Shi F. Jin W. The Engrailed-1 Gene Stimulates Brown Adipogenesis Stem Cells Int. 2016 2016 7369491 10.1155/2016/7369491 27148369 PMC4842372 28. Lidell M.E. Betz M.J. Dahlqvist Leinhard O. Heglind M. Elander L. Slawik M. Mussack T. Nilsson D. Romu T. Nuutila P. Evidence for Two Types of Brown Adipose Tissue in Humans Nat. Med. 2013 19 631 634 10.1038/nm.3017 23603813 29. Leitner B.P. Huang S. Brychta R.J. Duckworth C.J. Baskin A.S. McGehee S. Tal I. Dieckmann W. Gupta G. Kolodny G.M. Mapping of Human Brown Adipose Tissue in Lean and Obese Young Men Proc. Natl. Acad. Sci. USA 2017 114 8649 8654 10.1073/pnas.1705287114 28739898 PMC5559032 30. Zhang F. Hao G. Shao M. Nham K. An Y. Wang Q. Zhu Y. Kusminski C.M. Hassan G. Gupta R.K. An Adipose Tissue Atlas: An Image-Guided Identification of Human-like BAT and Beige Depots in Rodents Cell Metab. 2018 27 252 262.e3 10.1016/j.cmet.2017.12.004 29320705 PMC5764189 31. Jalloul W. Moscalu M. Moscalu R. Jalloul D. Grierosu I.C. Gutu M. Haba D. Mocanu V. Gutu M.M. Stefanescu C. Are MTV and TLG Accurate for Quantifying the Intensity of Brown Adipose Tissue Activation? Biomedicines 2024 12 151 10.3390/biomedicines12010151 38255256 PMC10813038 32. Jalloul W. Moscalu M. Moscalu R. Jalloul D. Grierosu I.C. Ionescu T. Stolniceanu C.R. Ghizdovat V. Mocanu V. Iliescu R. Off the Beaten Path in Oncology: Active Brown Adipose Tissue by Virtue of Molecular Imaging Curr. Issues Mol. Biol. 2023 45 7891 7914 10.3390/cimb45100499 37886942 PMC10604972 33. Jalloul W. Moscalu M. Grierosu I. Ionescu T. Stolniceanu C.R. Gutu M. Ghizdovat V. Mocanu V. Azoicai D. Iliescu R. Brown Adipose Tissue Biodistribution and Correlations Particularities in Parathyroid Pathology Personalized Diagnosis Diagnostics 2022 12 3182 10.3390/diagnostics12123182 36553189 PMC9777039 34. Gaspar R.C. Pauli J.R. Shulman G.I. Muñoz V.R. An Update on Brown Adipose Tissue Biology: A Discussion of Recent Findings Am. J. Physiol. Endocrinol. Metab. 2021 320 E488 E495 10.1152/ajpendo.00310.2020 33459179 PMC7988785 35. Enerbäck S. The Origins of Brown Adipose Tissue N. Engl. J. Med. 2009 360 2021 2023 10.1056/NEJMcibr0809610 19420373 36. Nedergaard J. Cannon B. The Browning of White Adipose Tissue: Some Burning Issues Cell Metab. 2014 20 396 407 10.1016/j.cmet.2014.07.005 25127354 37. Poekes L. Lanthier N. Leclercq I.A. Brown Adipose Tissue: A Potential Target in the Fight against Obesity and the Metabolic Syndrome Clin. Sci. 2015 129 933 949 10.1042/CS20150339 26359253 38. Shao M. Wang Q.A. Song A. Vishvanath L. Busbuso N.C. Scherer P.E. Gupta R.K. Cellular Origins of Beige Fat Cells Revisited Diabetes 2019 68 1874 1885 10.2337/db19-0308 31540940 PMC6754244 39. Bordicchia M. Liu D. Amri E.-Z. Ailhaud G. Dessì-Fulgheri P. Zhang C. Takahashi N. Sarzani R. Collins S. Cardiac Natriuretic Peptides Act via P38 MAPK to Induce the Brown Fat Thermogenic Program in Mouse and Human Adipocytes J. Clin. Investig. 2012 122 1022 1036 10.1172/JCI59701 22307324 PMC3287224 40. Lee J.-Y. Takahashi N. Yasubuchi M. Kim Y.-I. Hashizaki H. Kim M.-J. Sakamoto T. Goto T. Kawada T. Triiodothyronine Induces UCP-1 Expression and Mitochondrial Biogenesis in Human Adipocytes Am. J. Physiol. Cell Physiol. 2012 302 C463 C472 10.1152/ajpcell.00010.2011 22075692 41. De Jesus L.A. Carvalho S.D. Ribeiro M.O. Schneider M. Kim S.W. Harney J.W. Larsen P.R. Bianco A.C. The Type 2 Iodothyronine Deiodinase Is Essential for Adaptive Thermogenesis in Brown Adipose Tissue J. Clin. Investig. 2001 108 1379 1385 10.1172/JCI200113803 11696583 PMC209445 42. Tseng Y.-H. Kokkotou E. Schulz T.J. Huang T.L. Winnay J.N. Taniguchi C.M. Tran T.T. Suzuki R. Espinoza D.O. Yamamoto Y. New Role of Bone Morphogenetic Protein 7 in Brown Adipogenesis and Energy Expenditure Nature 2008 454 1000 1004 Erratum in Nature 2009 459 10.1038/nature07221 18719589 PMC2745972 43. Boström P. Wu J. Jedrychowski M.P. Korde A. Ye L. Lo J.C. Rasbach K.A. Boström E.A. Choi J.H. Long J.Z. A PGC1α-Dependent Myokine That Drives Browning of White Fat and Thermogenesis Nature 2012 481 463 468 10.1038/nature10777 22237023 PMC3522098 44. Xue S. Lee D. Berry D.C. Thermogenic Adipose Tissue in Energy Regulation and Metabolic Health Front. Endocrinol. 2023 14 1150059 10.3389/fendo.2023.1150059 PMC10067564 37020585 45. Abdelhafez Y.G. Wang G. Li S. Pellegrinelli V. Chaudhari A.J. Ramirez A. Sen F. Vidal-Puig A. Sidossis L.S. Klein S. The Role of Brown Adipose Tissue in Branched-Chain Amino Acid Clearance in People iScience 2024 27 110559 10.1016/j.isci.2024.110559 39175781 PMC11340589 46. Ying Z. Tramper N. Zhou E. Boon M.R. Rensen P.C.N. Kooijman S. Role of Thermogenic Adipose Tissue in Lipid Metabolism and Atherosclerotic Cardiovascular Disease: Lessons from Studies in Mice and Humans Cardiovasc. Res. 2023 119 905 918 10.1093/cvr/cvac131 35944189 PMC10153643 47. Berbée J.F.P. Boon M.R. Khedoe P.P.S.J. Bartelt A. Schlein C. Worthmann A. Kooijman S. Hoeke G. Mol I.M. John C. Brown Fat Activation Reduces Hypercholesterolaemia and Protects from Atherosclerosis Development Nat. Commun. 2015 6 6356 10.1038/ncomms7356 25754609 PMC4366535 48. Ziqubu K. Dludla P.V. Mabhida S.E. Jack B.U. Keipert S. Jastroch M. Mazibuko-Mbeje S.E. Brown Adipose Tissue-Derived Metabolites and Their Role in Regulating Metabolism Metabolism 2024 150 155709 10.1016/j.metabol.2023.155709 37866810 49. Markina N.O. Matveev G.A. Zasypkin G.G. Golikova T.I. Ryzhkova D.V. Kononova Y.A. Danilov S.D. Babenko A.Y. Role of Brown Adipose Tissue in Metabolic Health and Efficacy of Drug Treatment for Obesity J. Clin. Med. 2024 13 4151 10.3390/jcm13144151 39064191 PMC11277946 50. Cohen P. Kajimura S. The Cellular and Functional Complexity of Thermogenic Fat Nat. Rev. Mol. Cell Biol. 2021 22 393 409 10.1038/s41580-021-00350-0 33758402 PMC8159882 51. Chen K.Y. Brychta R.J. Abdul Sater Z. Cassimatis T.M. Cero C. Fletcher L.A. Israni N.S. Johnson J.W. Lea H.J. Linderman J.D. Opportunities and Challenges in the Therapeutic Activation of Human Energy Expenditure and Thermogenesis to Manage Obesity J. Biol. Chem. 2020 295 1926 1942 10.1074/jbc.REV119.007363 31914415 PMC7029124 52. Klingenberg M. UCP1—A Sophisticated Energy Valve Biochimie 2017 134 19 27 10.1016/j.biochi.2016.10.012 27794497 53. Symonds M.E. Brown Adipose Tissue Growth and Development Scientifica 2013 2013 305763 10.1155/2013/305763 24278771 PMC3820149 54. Schreiber R. Diwoky C. Schoiswohl G. Feiler U. Wongsiriroj N. Abdellatif M. Kolb D. Hoeks J. Kershaw E.E. Sedej S. Cold-Induced Thermogenesis Depends on ATGL-Mediated Lipolysis in Cardiac Muscle, but Not Brown Adipose Tissue Cell Metab. 2017 26 753 763.e7 10.1016/j.cmet.2017.09.004 28988821 PMC5683855 55. Shin H. Ma Y. Chanturiya T. Cao Q. Wang Y. Kadegowda A.K.G. Jackson R. Rumore D. Xue B. Shi H. Lipolysis in Brown Adipocytes Is Not Essential for Cold-Induced Thermogenesis in Mice Cell Metab. 2017 26 764 777.e5 10.1016/j.cmet.2017.09.002 28988822 PMC5905336 56. Mouisel E. Bodon A. Noll C. Cassant-Sourdy S. Marques M.-A. Flores-Flores R. Riant E. Bergoglio C. Vezin P. Caspar-Bauguil S. Cold-Induced Thermogenesis Requires Neutral-Lipase-Mediated Intracellular Lipolysis in Brown Adipocytes Cell Metab. 2025 37 429 440.e5 10.1016/j.cmet.2024.10.018 39566492 57. Anderson C.M. Kazantzis M. Wang J. Venkatraman S. Goncalves R.L.S. Quinlan C.L. Ng R. Jastroch M. Benjamin D.I. Nie B. Dependence of Brown Adipose Tissue Function on CD36-Mediated Coenzyme Q Uptake Cell Rep. 2015 10 505 515 10.1016/j.celrep.2014.12.048 25620701 PMC4318762 58. Putri M. Syamsunarno M.R.A.A. Iso T. Yamaguchi A. Hanaoka H. Sunaga H. Koitabashi N. Matsui H. Yamazaki C. Kameo S. CD36 Is Indispensable for Thermogenesis under Conditions of Fasting and Cold Stress Biochem. Biophys. Res. Commun. 2015 457 520 525 10.1016/j.bbrc.2014.12.124 25596128 PMC4344115 59. Simcox J. Geoghegan G. Maschek J.A. Bensard C.L. Pasquali M. Miao R. Lee S. Jiang L. Huck I. Kershaw E.E. Global Analysis of Plasma Lipids Identifies Liver-Derived Acylcarnitines as a Fuel Source for Brown Fat Thermogenesis Cell Metab. 2017 26 509 522.e6 10.1016/j.cmet.2017.08.006 28877455 PMC5658052 60. McGarry J.D. Brown N.F. The Mitochondrial Carnitine Palmitoyltransferase System. From Concept to Molecular Analysis Eur. J. Biochem. 1997 244 1 14 10.1111/j.1432-1033.1997.00001.x 9063439 61. Wade G. McGahee A. Ntambi J.M. Simcox J. Lipid Transport in Brown Adipocyte Thermogenesis Front. Physiol. 2021 12 787535 10.3389/fphys.2021.787535 35002769 PMC8733649 62. Rahbani J.F. Roesler A. Hussain M.F. Samborska B. Dykstra C.B. Tsai L. Jedrychowski M.P. Vergnes L. Reue K. Spiegelman B.M. Creatine Kinase B Controls Futile Creatine Cycling in Thermogenic Fat Nature 2021 590 480 485 10.1038/s41586-021-03221-y 33597756 PMC8647628 63. Bunk J. Hussain M.F. Delgado-Martin M. Samborska B. Ersin M. Shaw A. Rahbani J.F. Kazak L. The Futile Creatine Cycle Powers UCP1-Independent Thermogenesis in Classical BAT Nat. Commun. 2025 16 3221 10.1038/s41467-025-58294-4 40185737 PMC11971250 64. Vargas-Castillo A. Sun Y. Smythers A.L. Grauvogel L. Dumesic P.A. Emont M.P. Tsai L.T. Rosen E.D. Zammit N.W. Shaffer S.M. Development of a Functional Beige Fat Cell Line Uncovers Independent Subclasses of Cells Expressing UCP1 and the Futile Creatine Cycle Cell Metab. 2024 36 2146 2155.e5 10.1016/j.cmet.2024.07.002 39084217 PMC12005060 65. Chouchani E.T. Kazak L. Jedrychowski M.P. Lu G.Z. Erickson B.K. Szpyt J. Pierce K.A. Laznik-Bogoslavski D. Vetrivelan R. Clish C.B. Mitochondrial ROS Regulate Thermogenic Energy Expenditure and Sulfenylation of UCP1 Nature 2016 532 112 116 Erratum in Nature 2016 536 10.1038/nature17399 27027295 PMC5549630 66. Wang G. Meyer J.G. Cai W. Softic S. Li M.E. Verdin E. Newgard C. Schilling B. Kahn C.R. Regulation of UCP1 and Mitochondrial Metabolism in Brown Adipose Tissue by Reversible Succinylation Mol. Cell 2019 74 844 857.e7 10.1016/j.molcel.2019.03.021 31000437 PMC6525068 67. de Meis L. Uncoupled ATPase Activity and Heat Production by the Sarcoplasmic Reticulum Ca2+-ATPase. Regulation by ADP J. Biol. Chem. 2001 276 25078 25087 10.1074/jbc.M103318200 11342561 68. Bal N.C. Maurya S.K. Sopariwala D.H. Sahoo S.K. Gupta S.C. Shaikh S.A. Pant M. Rowland L.A. Bombardier E. Goonasekera S.A. Sarcolipin Is a Newly Identified Regulator of Muscle-Based Thermogenesis in Mammals Nat. Med. 2012 18 1575 1579 Erratum in Nat. Med. 2012 18 10.1038/nm.2897 22961106 PMC3676351 69. Ikeda K. Kang Q. Yoneshiro T. Camporez J.P. Maki H. Homma M. Shinoda K. Chen Y. Lu X. Maretich P. UCP1-Independent Signaling Involving SERCA2b-Mediated Calcium Cycling Regulates Beige Fat Thermogenesis and Systemic Glucose Homeostasis Nat. Med. 2017 23 1454 1465 10.1038/nm.4429 29131158 PMC5727902 70. Tajima K. Ikeda K. Tanabe Y. Thomson E.A. Yoneshiro T. Oguri Y. Ferro M.D. Poon A.S.Y. Kajimura S. Wireless Optogenetics Protects against Obesity via Stimulation of Non-Canonical Fat Thermogenesis Nat. Commun. 2020 11 1730 10.1038/s41467-020-15589-y 32265443 PMC7138828 71. Aquilano K. Sciarretta F. Turchi R. Li B.-H. Rosina M. Ceci V. Guidobaldi G. Arena S. D’Ambrosio C. Audano M. Low-Protein/High-Carbohydrate Diet Induces AMPK-Dependent Canonical and Non-Canonical Thermogenesis in Subcutaneous Adipose Tissue Redox Biol. 2020 36 101633 10.1016/j.redox.2020.101633 32863211 PMC7358542 72. Jones S.A. Sowton A.P. Lacabanne D. King M.S. Palmer S.M. Zögg T. Pardon E. Steyaert J. Ruprecht J.J. Kunji E.R.S. Proton Conductance by Human Uncoupling Protein 1 Is Inhibited by Purine and Pyrimidine Nucleotides EMBO J. 2025 44 2353 2365 10.1038/s44318-025-00395-3 40021843 PMC12000319 73. Bast-Habersbrunner A. Fromme T. Purine Nucleotides in the Regulation of Brown Adipose Tissue Activity Front. Endocrinol. 2020 11 118 10.3389/fendo.2020.00118 32210919 PMC7076073 74. Divakaruni A.S. Humphrey D.M. Brand M.D. Fatty Acids Change the Conformation of Uncoupling Protein 1 (UCP1) J. Biol. Chem. 2012 287 36845 36853 10.1074/jbc.M112.381780 22952235 PMC3481287 75. Kazak L. Chouchani E.T. Jedrychowski M.P. Erickson B.K. Shinoda K. Cohen P. Vetrivelan R. Lu G.Z. Laznik-Bogoslavski D. Hasenfuss S.C. A Creatine-Driven Substrate Cycle Enhances Energy Expenditure and Thermogenesis in Beige Fat Cell 2015 163 643 655 10.1016/j.cell.2015.09.035 26496606 PMC4656041 76. Guarnieri A.R. Benson T.W. Tranter M. Calcium Cycling as a Mediator of Thermogenic Metabolism in Adipose Tissue Mol. Pharmacol. 2022 102 51 59 10.1124/molpharm.121.000465 35504660 PMC9341262 77. Sharma A.K. Khandelwal R. Wolfrum C. Futile Lipid Cycling: From Biochemistry to Physiology Nat. Metab. 2024 6 808 824 10.1038/s42255-024-01003-0 38459186 78. Oeckl J. Janovska P. Adamcova K. Bardova K. Brunner S. Dieckmann S. Ecker J. Fromme T. Funda J. Gantert T. Loss of UCP1 Function Augments Recruitment of Futile Lipid Cycling for Thermogenesis in Murine Brown Fat Mol. Metab. 2022 61 101499 10.1016/j.molmet.2022.101499 35470094 PMC9097615 79. Auger C. Li M. Fujimoto M. Ikeda K. Yook J.-S. O’Leary T.R. Caycedo M.P.H. Xiaohan C. Oikawa S. Verkerke A.R.P. Identification of a Molecular Resistor That Controls UCP1-Independent Ca2+ Cycling Thermogenesis in Adipose Tissue Cell Metab. 2025 37 1311 1325.e9 10.1016/j.cmet.2025.03.009 40199326 PMC12137002 80. Tabei S. Chamorro R. Meyhöfer S.M. Wilms B. Metabolic Effects of Brown Adipose Tissue Activity Due to Cold Exposure in Humans: A Systematic Review and Meta-Analysis of RCTs and Non-RCTs Biomedicines 2024 12 537 10.3390/biomedicines12030537 38540150 PMC10968636 81. Huang Z. Zhang Z. Moazzami Z. Heck R. Hu P. Nanda H. Ren K. Sun Z. Bartolomucci A. Gao Y. Brown Adipose Tissue Involution Associated with Progressive Restriction in Progenitor Competence Cell Rep. 2022 39 110575 10.1016/j.celrep.2022.110575 35417710 PMC9664906 82. Yu X. Benitez G. Wei P.T. Krylova S.V. Song Z. Liu L. Zhang M. Xiaoli A.M. Wei H. Chen F. Involution of Brown Adipose Tissue through a Syntaxin 4 Dependent Pyroptosis Pathway Nat. Commun. 2024 15 2856 10.1038/s41467-024-46944-y 38565851 PMC10987578 83. Guerra C. Navarro P. Valverde A.M. Arribas M. Brüning J. Kozak L.P. Kahn C.R. Benito M. Brown Adipose Tissue-Specific Insulin Receptor Knockout Shows Diabetic Phenotype without Insulin Resistance J. Clin. Investig. 2001 108 1205 1213 10.1172/JCI13103 11602628 PMC209529 84. Dallner O.S. Chernogubova E. Brolinson K.A. Bengtsson T. Beta3-Adrenergic Receptors Stimulate Glucose Uptake in Brown Adipocytes by Two Mechanisms Independently of Glucose Transporter 4 Translocation Endocrinology 2006 147 5730 5739 10.1210/en.2006-0242 16959848 85. Olsen J.M. Sato M. Dallner O.S. Sandström A.L. Pisani D.F. Chambard J.-C. Amri E.-Z. Hutchinson D.S. Bengtsson T. Glucose Uptake in Brown Fat Cells Is Dependent on mTOR Complex 2–Promoted GLUT1 Translocation J. Cell Biol. 2014 207 365 374 10.1083/jcb.201403080 25385184 PMC4226734 86. Lowell B.B. S-Susulic V. Hamann A. Lawitts J.A. Himms-Hagen J. Boyer B.B. Kozak L.P. Flier J.S. Development of Obesity in Transgenic Mice after Genetic Ablation of Brown Adipose Tissue Nature 1993 366 740 742 10.1038/366740a0 8264795 87. Stanford K.I. Middelbeek R.J.W. Townsend K.L. An D. Nygaard E.B. Hitchcox K.M. Markan K.R. Nakano K. Hirshman M.F. Tseng Y.-H. Brown Adipose Tissue Regulates Glucose Homeostasis and Insulin Sensitivity J. Clin. Investig. 2013 123 215 223 10.1172/JCI62308 23221344 PMC3533266 88. de Souza C.J. Hirshman M.F. Horton E.S. CL-316,243, a Beta3-Specific Adrenoceptor Agonist, Enhances Insulin-Stimulated Glucose Disposal in Nonobese Rats Diabetes 1997 46 1257 1263 10.2337/diab.46.8.1257 9231648 89. Cohen P. Levy J.D. Zhang Y. Frontini A. Kolodin D.P. Svensson K.J. Lo J.C. Zeng X. Ye L. Khandekar M.J. Ablation of PRDM16 and Beige Adipose Causes Metabolic Dysfunction and a Subcutaneous to Visceral Fat Switch Cell 2014 156 304 316 10.1016/j.cell.2013.12.021 24439384 PMC3922400 90. Yoneshiro T. Wang Q. Tajima K. Matsushita M. Maki H. Igarashi K. Dai Z. White P.J. McGarrah R.W. Ilkayeva O.R. BCAA Catabolism in Brown Fat Controls Energy Homeostasis through SLC25A44 Nature 2019 572 614 619 10.1038/s41586-019-1503-x 31435015 PMC6715529 91. Verkerke A.R.P. Wang D. Yoshida N. Taxin Z.H. Shi X. Zheng S. Li Y. Auger C. Oikawa S. Yook J.-S. BCAA-Nitrogen Flux in Brown Fat Controls Metabolic Health Independent of Thermogenesis Cell 2024 187 2359 2374.e18 10.1016/j.cell.2024.03.030 38653240 PMC11145561 92. Liu Y. Qian S.-W. Tang Y. Tang Q.-Q. The Secretory Function of Adipose Tissues in Metabolic Regulation Life Metab. 2024 3 loae003 10.1093/lifemeta/loae003 39872218 PMC11748999 93. Chau M.D.L. Gao J. Yang Q. Wu Z. Gromada J. Fibroblast Growth Factor 21 Regulates Energy Metabolism by Activating the AMPK-SIRT1-PGC-1alpha Pathway Proc. Natl. Acad. Sci. USA 2010 107 12553 12558 10.1073/pnas.1006962107 20616029 PMC2906565 94. Lewis J.E. Monnier C. Marshall H. Fowler M. Green R. Cooper S. Chiotellis A. Luckett J. Perkins A.C. Coskun T. Whole-Body and Adipose Tissue-Specific Mechanisms Underlying the Metabolic Effects of Fibroblast Growth Factor 21 in the Siberian Hamster Mol. Metab. 2020 31 45 54 10.1016/j.molmet.2019.10.009 31918921 PMC6889485 95. Hanssen M.J.W. Broeders E. Samms R.J. Vosselman M.J. van der Lans A.A.J.J. Cheng C.C. Adams A.C. van Marken Lichtenbelt W.D. Schrauwen P. Serum FGF21 Levels Are Associated with Brown Adipose Tissue Activity in Humans Sci. Rep. 2015 5 10275 10.1038/srep10275 25985218 PMC4434994 96. Justesen S. Haugegaard K.V. Hansen J.B. Hansen H.S. Andersen B. The Autocrine Role of FGF21 in Cultured Adipocytes Biochem. J. 2020 477 2477 2487 10.1042/BCJ20200220 32648929 97. Roberts-Toler C. O’Neill B.T. Cypess A.M. Diet-Induced Obesity Causes Insulin Resistance in Mouse Brown Adipose Tissue Obesity 2015 23 1765 1770 10.1002/oby.21134 26242777 PMC4551605 98. Carpentier A.C. Blondin D.P. Human Brown Adipose Tissue Is Not Enough to Combat Cardiometabolic Diseases J. Clin. Investig. 2023 133 1150059 10.1172/JCI175288 PMC10688973 38038130 99. Seki T. Yang Y. Sun X. Lim S. Xie S. Guo Z. Xiong W. Kuroda M. Sakaue H. Hosaka K. Brown-Fat-Mediated Tumour Suppression by Cold-Altered Global Metabolism Nature 2022 608 421 428 10.1038/s41586-022-05030-3 35922508 PMC9365697 100. Nguyen H.P. An K. Ito Y. Kharbikar B.N. Sheng R. Paredes B. Murray E. Pham K. Bruck M. Zhou X. Implantation of Engineered Adipocytes Suppresses Tumor Progression in Cancer Models Nat. Biotechnol. 2025 1 17 10.1038/s41587-024-02551-2 39905264 PMC12319119 101. Bartelt A. Bruns O.T. Reimer R. Hohenberg H. Ittrich H. Peldschus K. Kaul M.G. Tromsdorf U.I. Weller H. Waurisch C. Brown Adipose Tissue Activity Controls Triglyceride Clearance Nat. Med. 2011 17 200 205 10.1038/nm.2297 21258337 102. Bartelt A. John C. Schaltenberg N. Berbée J.F.P. Worthmann A. Cherradi M.L. Schlein C. Piepenburg J. Boon M.R. Rinninger F. Thermogenic Adipocytes Promote HDL Turnover and Reverse Cholesterol Transport Nat. Commun. 2017 8 15010 10.1038/ncomms15010 28422089 PMC5399294 103. Chondronikola M. Yoshino J. Ramaswamy R. Giardina J.D. Laforest R. Wahl R.L. Patterson B.W. Mittendorfer B. Klein S. Very-Low-Density Lipoprotein Triglyceride and Free Fatty Acid Plasma Kinetics in Women with High or Low Brown Adipose Tissue Volume and Overweight/Obesity Cell Rep. Med. 2024 5 101370 10.1016/j.xcrm.2023.101370 38232692 PMC10829791 104. Yang K. Zhang R. Zhang X. Gao Q. Guo X. Gu L. Zhang H. Zhang J. Zheng J. Jiang M. Associations between Brown Adipose Tissue Activity, Serum Lipid Profiles, and Cardiovascular Events: Insights from 18F-Fluorodeoxyglucose PET/Computed Tomography Analysis Nucl. Med. Commun. 2025 46 855 861 10.1097/MNM.0000000000002007 40524531 105. Cho Y.K. Lee S. Lee J. Doh J. Park J.-H. Jung Y.-S. Lee Y.-H. Lipid Remodeling of Adipose Tissue in Metabolic Health and Disease Exp. Mol. Med. 2023 55 1955 1973 10.1038/s12276-023-01071-4 37653032 PMC10545718 106. Magro B.S. Dias D.P.M. Brown and Beige Adipose Tissue: New Therapeutic Targets for Metabolic Disorders Health Sci. Rev. 2024 10 100148 10.1016/j.hsr.2024.100148 107. Sponton C.H. Hosono T. Taura J. Jedrychowski M.P. Yoneshiro T. Wang Q. Takahashi M. Matsui Y. Ikeda K. Oguri Y. The Regulation of Glucose and Lipid Homeostasis via PLTP as a Mediator of BAT-Liver Communication EMBO Rep. 2020 21 e49828 10.15252/embr.201949828 32672883 PMC7507062 108. Worthmann A. John C. Rühlemann M.C. Baguhl M. Heinsen F.-A. Schaltenberg N. Heine M. Schlein C. Evangelakos I. Mineo C. Cold-Induced Conversion of Cholesterol to Bile Acids in Mice Shapes the Gut Microbiome and Promotes Adaptive Thermogenesis Nat. Med. 2017 23 839 849 10.1038/nm.4357 28604703 109. Balaz M. Becker A.S. Balazova L. Straub L. Müller J. Gashi G. Maushart C.I. Sun W. Dong H. Moser C. Inhibition of Mevalonate Pathway Prevents Adipocyte Browning in Mice and Men by Affecting Protein Prenylation Cell Metab. 2019 29 901 916.e8 10.1016/j.cmet.2018.11.017 30581121 110. de Campos-Ferraz P.L. Ribeiro S.M.L. Luz S.D.S. Lancha A.H. Tirapegui J. Exercise x BCAA Supplementation in Young Trained Rats: What Are Their Effects on Body Growth? J. Sports Sci. Med. 2011 10 483 490 24150622 PMC3737814 111. Fernstrom J.D. Branched-Chain Amino Acids and Brain Function J. Nutr. 2005 135 1539S 1546S 10.1093/jn/135.6.1539s 15930466 112. Neinast M.D. Jang C. Hui S. Murashige D.S. Chu Q. Morscher R.J. Li X. Zhan L. White E. Anthony T.G. Quantitative Analysis of the Whole-Body Metabolic Fate of Branched Chain Amino Acids Cell Metab. 2019 29 417 429.e4 10.1016/j.cmet.2018.10.013 30449684 PMC6365191 113. Choi B.H. Hyun S. Koo S.-H. The Role of BCAA Metabolism in Metabolic Health and Disease Exp. Mol. Med. 2024 56 1552 1559 10.1038/s12276-024-01263-6 38956299 PMC11297153 114. Wallace M. Green C.R. Roberts L.S. Lee Y.M. McCarville J.L. Sanchez-Gurmaches J. Meurs N. Gengatharan J.M. Hover J.D. Phillips S.A. Enzyme Promiscuity Drives Branched-Chain Fatty Acid Synthesis in Adipose Tissues Nat. Chem. Biol. 2018 14 1021 1031 10.1038/s41589-018-0132-2 30327559 PMC6245668 115. Green C.R. Wallace M. Divakaruni A.S. Phillips S.A. Murphy A.N. Ciaraldi T.P. Metallo C.M. Branched-Chain Amino Acid Catabolism Fuels Adipocyte Differentiation and Lipogenesis Nat. Chem. Biol. 2016 12 15 21 10.1038/nchembio.1961 26571352 PMC4684771 116. Su X. Magkos F. Zhou D. Eagon J.C. Fabbrini E. Okunade A.L. Klein S. Adipose Tissue Monomethyl Branched-Chain Fatty Acids and Insulin Sensitivity: Effects of Obesity and Weight Loss Obesity 2015 23 329 334 10.1002/oby.20923 25328153 PMC4310778 117. Gunawardana S.C. Piston D.W. Reversal of Type 1 Diabetes in Mice by Brown Adipose Tissue Transplant Diabetes 2012 61 674 682 10.2337/db11-0510 22315305 PMC3282804 118. Enerbäck S. Jacobsson A. Simpson E.M. Guerra C. Yamashita H. Harper M.E. Kozak L.P. Mice Lacking Mitochondrial Uncoupling Protein Are Cold-Sensitive but Not Obese Nature 1997 387 90 94 10.1038/387090a0 9139827 119. Ali Khan A. Hansson J. Weber P. Foehr S. Krijgsveld J. Herzig S. Scheideler M. Comparative Secretome Analyses of Primary Murine White and Brown Adipocytes Reveal Novel Adipokines Mol. Cell Proteom. 2018 17 2358 2370 10.1074/mcp.RA118.000704 PMC6283297 30135203 120. Deshmukh A.S. Peijs L. Beaudry J.L. Jespersen N.Z. Nielsen C.H. Ma T. Brunner A.D. Larsen T.J. Bayarri-Olmos R. Prabhakar B.S. Proteomics-Based Comparative Mapping of the Secretomes of Human Brown and White Adipocytes Reveals EPDR1 as a Novel Batokine Cell Metab. 2019 30 963 975.e7 10.1016/j.cmet.2019.10.001 31668873 121. Villarroya J. Cereijo R. Giralt M. Villarroya F. Secretory Proteome of Brown Adipocytes in Response to cAMP-Mediated Thermogenic Activation Front. Physiol. 2019 10 67 10.3389/fphys.2019.00067 30792664 PMC6374321 122. Yuko O.-O. Saito M. Brown Fat as a Regulator of Systemic Metabolism beyond Thermogenesis Diabetes Metab. J. 2021 45 840 852 10.4093/dmj.2020.0291 34176254 PMC8640153 123. Dan X. Li K. Xu J. Yan P. The Potential of Neuregulin 4 as a Novel Biomarker and Therapeutic Agent for Vascular Complications in Type 2 Diabetes Mellitus J. Inflamm. Res. 2024 17 8543 8554 10.2147/JIR.S492115 39539725 PMC11559183 124. Yan C. Burley G. Gao H. Shi Y.-C. Emerging Insights into Brown Adipose Tissue Crosstalk With Pancreatic β-Cells in Metabolic Regulation Endocrinology 2025 166 bqaf118 10.1210/endocr/bqaf118 40658727 PMC12287633 125. Svensson K.J. Long J.Z. Jedrychowski M.P. Cohen P. Lo J.C. Serag S. Kir S. Shinoda K. Tartaglia J.A. Rao R.R. A Secreted Slit2 Fragment Regulates Adipose Tissue Thermogenesis and Metabolic Function Cell Metab. 2016 23 454 466 10.1016/j.cmet.2016.01.008 26876562 PMC4785066 126. Campderrós L. Moure R. Cairó M. Gavaldà-Navarro A. Quesada-López T. Cereijo R. Giralt M. Villarroya J. Villarroya F. Brown Adipocytes Secrete GDF15 in Response to Thermogenic Activation Obesity 2019 27 1606 1616 10.1002/oby.22584 31411815 127. Mendez-Gutierrez A. Aguilera C.M. Cereijo R. Osuna-Prieto F.J. Martinez-Tellez B. Rico M.C. Sanchez-Infantes D. Villarroya F. Ruiz J.R. Sanchez-Delgado G. Cold Exposure Modulates Potential Brown Adipokines in Humans, but Only FGF21 Is Associated with Brown Adipose Tissue Volume Obesity 2024 32 560 570 10.1002/oby.23970 38247441 128. Jena J. García-Peña L.M. Weatherford E.T. Marti A. Bjorkman S.H. Kato K. Koneru J. Chen J.H. Seeley R.J. Abel E.D. GDF15 Is Required for Cold-Induced Thermogenesis and Contributes to Improved Systemic Metabolic Health Following Loss of OPA1 in Brown Adipocytes eLife 2023 12 e86452 10.7554/eLife.86452 37819027 PMC10567111 129. Chung H.K. Ryu D. Kim K.S. Chang J.Y. Kim Y.K. Yi H.-S. Kang S.G. Choi M.J. Lee S.E. Jung S.-B. Growth Differentiation Factor 15 Is a Myomitokine Governing Systemic Energy Homeostasis J. Cell Biol. 2017 216 149 165 10.1083/jcb.201607110 27986797 PMC5223607 130. Cereijo R. Gavaldà-Navarro A. Cairó M. Quesada-López T. Villarroya J. Morón-Ros S. Sánchez-Infantes D. Peyrou M. Iglesias R. Mampel T. CXCL14, a Brown Adipokine That Mediates Brown-Fat-to-Macrophage Communication in Thermogenic Adaptation Cell Metab. 2018 28 750 763.e6 10.1016/j.cmet.2018.07.015 30122557 131. Stanford K.I. Goodyear L.J. Muscle-Adipose Tissue Cross Talk Cold Spring Harb. Perspect. Med. 2018 8 a029801 10.1101/cshperspect.a029801 28507197 PMC5685935 132. Chen K.Y. Cypess A.M. Laughlin M.R. Haft C.R. Hu H.H. Bredella M.A. Enerbäck S. Kinahan P.E. Lichtenbelt W.V.M. Lin F.I. Brown Adipose Reporting Criteria in Imaging STudies (BARCIST 1.0): Recommendations for Standardized FDG-PET/CT Experiments in Humans Cell Metab. 2016 24 210 222 10.1016/j.cmet.2016.07.014 27508870 PMC4981083 133. Thomou T. Mori M.A. Dreyfuss J.M. Konishi M. Sakaguchi M. Wolfrum C. Rao T.N. Winnay J.N. Garcia-Martin R. Grinspoon S.K. Adipose-Derived Circulating miRNAs Regulate Gene Expression in Other Tissues Nature 2017 542 450 455 Erratum in Nature 2017 545 10.1038/nature21365 28199304 PMC5330251 134. Martinez-Sanchez N. Imbernon M. Editorial: Adipokines, Batokines & Cardiokines: Crosstalk with Metabolic Organs Front. Endocrinol. 2024 15 1481180 10.3389/fendo.2024.1481180 PMC11427350 39345887 135. Divoux A. Clément K. Architecture and the Extracellular Matrix: The Still Unappreciated Components of the Adipose Tissue Obes. Rev. 2011 12 e494 e503 10.1111/j.1467-789x.2010.00811.x 21366833 136. Bonnans C. Chou J. Werb Z. Remodelling the Extracellular Matrix in Development and Disease Nat. Rev. Mol. Cell Biol. 2014 15 786 801 10.1038/nrm3904 25415508 PMC4316204 137. Kitchener R.L. Grunden A.M. Prolidase Function in Proline Metabolism and Its Medical and Biotechnological Applications J. Appl. Microbiol. 2012 113 233 247 10.1111/j.1365-2672.2012.05310.x 22512465 138. Pellegrinelli V. Figueroa-Juárez E. Samuelson I. U-Din M. Rodriguez-Fdez S. Virtue S. Leggat J. Çubuk C. Peirce V.J. Niemi T. Defective Extracellular Matrix Remodeling in Brown Adipose Tissue Is Associated with Fibro-Inflammation and Reduced Diet-Induced Thermogenesis Cell Rep. 2023 42 112640 10.1016/j.celrep.2023.112640 37318951 139. Wynn T.A. Ramalingam T.R. Mechanisms of Fibrosis: Therapeutic Translation for Fibrotic Disease Nat. Med. 2012 18 1028 1040 10.1038/nm.2807 22772564 PMC3405917 140. DeBari M.K. Abbott R.D. Adipose Tissue Fibrosis: Mechanisms, Models, and Importance Int. J. Mol. Sci. 2020 21 6030 10.3390/ijms21176030 32825788 PMC7503256 141. Lackey D.E. Burk D.H. Ali M.R. Mostaedi R. Smith W.H. Park J. Scherer P.E. Seay S.A. McCoin C.S. Bonaldo P. Contributions of Adipose Tissue Architectural and Tensile Properties toward Defining Healthy and Unhealthy Obesity Am. J. Physiol. Endocrinol. Metab. 2014 306 E233 E246 10.1152/ajpendo.00476.2013 24302007 PMC3920015 142. Muir L.A. Neeley C.K. Meyer K.A. Baker N.A. Brosius A.M. Washabaugh A.R. Varban O.A. Finks J.F. Zamarron B.F. Flesher C.G. Adipose Tissue Fibrosis, Hypertrophy, and Hyperplasia: Correlations with Diabetes in Human Obesity Obesity 2016 24 597 605 10.1002/oby.21377 26916240 PMC4920141 143. Khan T. Muise E.S. Iyengar P. Wang Z.V. Chandalia M. Abate N. Zhang B.B. Bonaldo P. Chua S. Scherer P.E. Metabolic Dysregulation and Adipose Tissue Fibrosis: Role of Collagen VI Mol. Cell Biol. 2009 29 1575 1591 10.1128/MCB.01300-08 19114551 PMC2648231 144. Hasegawa Y. Ikeda K. Chen Y. Alba D.L. Stifler D. Shinoda K. Hosono T. Maretich P. Yang Y. Ishigaki Y. Repression of Adipose Tissue Fibrosis through a PRDM16-GTF2IRD1 Complex Improves Systemic Glucose Homeostasis Cell Metab. 2018 27 180 194.e6 10.1016/j.cmet.2017.12.005 29320702 PMC5765755 145. Wang W. Ishibashi J. Trefely S. Shao M. Cowan A.J. Sakers A. Lim H.-W. O’Connor S. Doan M.T. Cohen P. A PRDM16-Driven Metabolic Signal from Adipocytes Regulates Precursor Cell Fate Cell Metab. 2019 30 174 189.e5 10.1016/j.cmet.2019.05.005 31155495 PMC6836679 146. Li Y. Wang X. Wang F. You L. Xu P. Cao Y. Chen L. Wen J. Guo X. Cui X. Identification of Intracellular Peptides Associated with Thermogenesis in Human Brown Adipocytes J. Cell Physiol. 2019 234 7104 7114 10.1002/jcp.27465 30387133 147. Grandoch M. Flögel U. Virtue S. Maier J.K. Jelenik T. Kohlmorgen C. Feldmann K. Ostendorf Y. Castañeda T.R. Zhou Z. 4-Methylumbelliferone Improves the Thermogenic Capacity of Brown Adipose Tissue Nat. Metab. 2019 1 546 559 10.1038/s42255-019-0055-6 31602424 PMC6786893 148. Gonzalez Porras M.A. Stojkova K. Vaicik M.K. Pelowe A. Goddi A. Carmona A. Long B. Qutub A.A. Gonzalez A. Cohen R.N. Integrins and Extracellular Matrix Proteins Modulate Adipocyte Thermogenic Capacity Sci. Rep. 2021 11 5442 10.1038/s41598-021-84828-z 33686208 PMC7940610 149. Sun K. Park J. Gupta O.T. Holland W.L. Auerbach P. Zhang N. Goncalves Marangoni R. Nicoloro S.M. Czech M.P. Varga J. Endotrophin Triggers Adipose Tissue Fibrosis and Metabolic Dysfunction Nat. Commun. 2014 5 3485 10.1038/ncomms4485 24647224 PMC4076823 150. Bagchi M. Kim L.A. Boucher J. Walshe T.E. Kahn C.R. D’Amore P.A. Vascular Endothelial Growth Factor Is Important for Brown Adipose Tissue Development and Maintenance FASEB J. 2013 27 3257 3271 10.1096/fj.12-221812 23682123 PMC3714576 151. Weisberg S.P. McCann D. Desai M. Rosenbaum M. Leibel R.L. Ferrante A.W. Obesity Is Associated with Macrophage Accumulation in Adipose Tissue J. Clin. Investig. 2003 112 1796 1808 10.1172/JCI200319246 14679176 PMC296995 152. Kawai T. Autieri M.V. Scalia R. Adipose Tissue Inflammation and Metabolic Dysfunction in Obesity Am. J. Physiol. Cell Physiol. 2021 320 C375 C391 10.1152/ajpcell.00379.2020 33356944 PMC8294624 153. Aruwa C.E. Sabiu S. Adipose Tissue Inflammation Linked to Obesity: A Review of Current Understanding, Therapies and Relevance of Phyto-Therapeutics Heliyon 2024 10 e23114 10.1016/j.heliyon.2023.e23114 38163110 PMC10755291 154. Kiran S. Kumar V. Murphy E.A. Enos R.T. Singh U.P. High Fat Diet-Induced CD8+ T Cells in Adipose Tissue Mediate Macrophages to Sustain Low-Grade Chronic Inflammation Front. Immunol. 2021 12 680944 10.3389/fimmu.2021.680944 34248964 PMC8261297 155. Wang Q. Wang Y. Xu D. The Roles of T Cells in Obese Adipose Tissue Inflammation Adipocyte 2021 10 435 445 10.1080/21623945.2021.1965314 34515616 PMC8463033 156. Perry R.J. Camporez J.-P.G. Kursawe R. Titchenell P.M. Zhang D. Perry C.J. Jurczak M.J. Abudukadier A. Han M.S. Zhang X.-M. Hepatic Acetyl CoA Links Adipose Tissue Inflammation to Hepatic Insulin Resistance and Type 2 Diabetes Cell 2015 160 745 758 10.1016/j.cell.2015.01.012 25662011 PMC4498261 157. Ingram J.R. Dougan M. Rashidian M. Knoll M. Keliher E.J. Garrett S. Garforth S. Blomberg O.S. Espinosa C. Bhan A. PD-L1 Is an Activation-Independent Marker of Brown Adipocytes Nat. Commun. 2017 8 647 10.1038/s41467-017-00799-8 28935898 PMC5608754 158. Eljaafari A. Pestel J. Le Magueresse-Battistoni B. Chanon S. Watson J. Robert M. Disse E. Vidal H. Adipose-Tissue-Derived Mesenchymal Stem Cells Mediate PD-L1 Overexpression in the White Adipose Tissue of Obese Individuals, Resulting in T Cell Dysfunction Cells 2021 10 2645 10.3390/cells10102645 34685625 PMC8534339 Figure 1 Overview of the origins and distinctive features of white, beige, and brown adipocytes [ 9 12 37 38 Figure 2 Principal functions of brown and beige adipocytes [ 50 Figure 3 UCP1-independent thermogenic mechanisms in thermogenic adipose tissues [ 1 50 51 Figure 4 Brown/Beige adipocytes: Part of a multi-organ crosstalk [ 33 37 48 134 Figure 5 Fibro-inflammatory aspects of adipose tissue [ 1 5 17 120 121 135 136 137 138 139 140 141 142 143 144 145 146 147 148 149 150 151 152 153 154 155 156 157 158 ijms-26-09045-t001_Table 1 Table 1 Comparative mechanisms of UCP1-dependent and UCP1-independent thermogenesis in adipose tissues.  UCP1-Dependent Thermogenesis UCP1-Independent Thermogenesis  Main Protein  ❖ UCP1  ❖ SERCA, Sln, futile creatine cycling proteins  Location  ❖ Inner mitochondrial membrane of brown and beige adipocytes  ❖ Skeletal muscle, beige adipocytes, subcutaneous white adipocytes  Activation Stimuli  ❖ Cold exposure, β3-adrenergic receptor stimulation, lipolysis-derived free FAs activate UCP1  ❖ Cold exposure, β3-adrenergic receptor stimulation, α1-adrenergic receptor stimulation, exercise, pharmacological agents (β3-agonists), dietary cues (high-carbohydrate, low-protein)  Energy Source  ❖ Proton gradient dissipation via H +  ❖ ATP hydrolysis uncoupled from Ca 2+ 2+  Inhibitory Mechanisms  ❖ Purine nucleotides (ATP, guanosine diphosphate (GDP)) inhibit UCP1 activity  ❖ Not applicable directly to a single uncoupler; regulation through protein signalling  Post-translational Modifications  ❖ Sulfenylation of Cys253, succinylation at Lys56 and Lys151 modulated by SIRT5  ❖ Not directly applicable, regulation mainly via protein–protein interactions and AMPK activation  Role of ROS  ❖ Required for sulfenylation and activation of UCP1  ❖ Indirect; ROS can influence Ca 2+  Heat Production Efficiency  ❖ Up to 300 W/kg, highly efficient in brown adipocytes  ❖ Lower than the UCP1 pathway per cell, but significant in muscle and beige fat; cumulative effect substantial  Fatty Acid Requirement  ❖ Essential in the fasted state via ATGL/HSL-mediated intracellular lipolysis; dispensable in the fed state when exogenous substrates are available  ❖ Independent of fatty acid oxidation; dependent on ATP hydrolysis  Metabolic Benefits and Non-thermogenic Roles  ❖ Enhances glucose and insulin tolerance, protects against obesity and T2D, modulates ECM remodelling and immune profile  ❖ Similar metabolic benefits, especially in individuals with low UCP1 activity; potential therapeutic target for obesity and metabolic syndrome; may impact fibro-inflammatory balance and metabolic resilience  Additional Notes  ❖ UCP1 activity can be inhibited by mutations or post-translational modifications; requires an intact mitochondrial proton gradient  ❖ Creatine futile cycling and Ca 2+  Key References  ❖ Chen et al., 2020 [ 51 50 52 72 73 74 56  ❖ Bunk et al., 2025 [ 63 75 76 64 ijms-26-09045-t002_Table 2 Table 2 Principal BAT/BeigeAT-derived polypeptides and their principal effects [ 48 50 66 122 123 124 125 126 127 128 129 130  Polypeptides Effects/Organs  Autocrine/Paracrine actions  ❖ BMP8B ❖ SLIT2 ❖ IL-6 ❖ FGF21  ❖ Thermogenesis regulation  ❖ VEGF-A  ❖ Vascularisation regulation  ❖ CXCL14 ❖ GDF15  ❖ Immunity regulation  ❖ NGF1 ❖ S100B  ❖ Fatty tissue innervation  Endocrine actions  ❖ NRG4  ❖ Hepatic lipogenesis inhibition  ❖ Myostatin/growth differentiation factor 8 (GDF8)  ❖ Regulation of skeletal muscle function  ❖ FGF21  ❖ Regulation of BeigeAT production and cardiac remodelling  ❖ PLTP  ❖ Regulation of hepatic glucose and metabolism ",
  "metadata": {
    "Title of this paper": "Adipose-Tissue-Derived Mesenchymal Stem Cells Mediate PD-L1 Overexpression in the White Adipose Tissue of Obese Individuals, Resulting in T Cell Dysfunction",
    "Journal it was published in:": "International Journal of Molecular Sciences",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12470071/"
  }
}