{
  "title": "Paper_245",
  "abstract": "pmc Front Nutr Front Nutr 2731 fnut Front. Nutr. Frontiers in Nutrition 2296-861X Frontiers Media SA PMC12491058 PMC12491058.1 12491058 12491058 10.3389/fnut.2025.1666684 1 Nutrition Original Research Global, regional, and national burden of chronic kidney disease attributable to red meat consumption from 1990 to 2021 Gu Jie  1 Zhang Jiaying  2  3  * 1 Division of Geriatrics, Huashan Hospital, Fudan University Shanghai China 2 Division of Nutrition, Huashan Hospital, Fudan University Shanghai China 3 National Clinical Research Center for Aging and Medicine, Huashan Hospital, Fudan University Shanghai China Edited by: Milan Tuba Reviewed by: Ming Yi Zheng Yuan *Correspondence: Jiaying Zhang, 14131220006@fudan.edu.cn 19 9 2025 2025 12 480739 1666684 15 7 2025 08 9 2025 19 09 2025 04 10 2025 04 10 2025 Copyright © 2025 Gu and Zhang. 2025 Gu and Zhang https://creativecommons.org/licenses/by/4.0/ This is an open-access article distributed under the terms of the Creative Commons Attribution License (CC BY). The use, distribution or reproduction in other forums is permitted, provided the original author(s) and the copyright owner(s) are credited and that the original publication in this journal is cited, in accordance with accepted academic practice. No use, distribution or reproduction is permitted which does not comply with these terms. Objectives High red meat is a crucial risk factor for chronic kidney disease (CKD). However, detailed reports on the burden of CKD due to red meat are limited. We aimed to assess the global, regional and national trends in CKD attributable to high red meat. Study design A comprehensive analysis was performed using data from the Global Burden of Diseases (GBD) 2021. Methods Age-standardized mortality rates (ASMR) and age-standardized DALYs rates (ASDR) were key parameters used to evaluate CKD burden. The estimated annual percentage change (EAPC) was calculated to evaluate the secular trends of ASMR/ASDR. We further explored the associations of socio-demographic index (SDI) with ASMR/ASDR. Results From 1990 to 2021, CKD caused by high red meat led to a continuous rise in global ASMR/ASDR. Regionally, both ASMR and ASDR of CKD showed slight positive correlations with SDI, with correlation coefficients of 0.16 and 0.20, respectively. High SDI region experienced the heaviest disease burden, with the most significant increase in ASMR [EAPC 0.44 (95% CI: 0.36–0.52)], related to aging and epidemiological changes. Middle SDI region followed closely, with the highest ASDR increase [EAPC 0.44 (95% CI: 0.36–0.52)]. The USA had the highest number of CKD deaths due to high red meat, followed by China. Type 2 diabetes was the primary mediator linking increased red meat consumption to CKD. Conclusion CKD attributable to high red meat consumption has led to a continuous rise in global burden from 1990 to 2021, with high and middle SDI regions bearing the brunt of the burden. chronic kidney disease deaths disability-adjusted life years Global Burden of Disease Study high red meat intake National Natural Science Foundation of China 10.13039/501100001809 82000707 The author(s) declare that financial support was received for the research and/or publication of this article. This research was funded by the National Natural Science Foundation of China, Grant Number 82000707. pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement yes pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes section-at-acceptance Nutritional Epidemiology 1 Introduction Chronic kidney disease (CKD) is a major public health problem globally, with prevalence and incidence rates that have increased in the past 30 years by 40% ( 1 2 3 4 Red meat refers to mammalian muscle, mainly including beef, lamb, pork, etc. Red meat is characterized by a high level of myoglobin, which gives it a red color in the raw meat state. Red meat is an important part of many cultural diets and is rich in protein, vitamins, and minerals. These nutrients are essential for growth, repair, and the maintenance of normal physiological functions in the body ( 5 6 7 8 9 There is a significant association between red meat intake and the risk of CKD. Studies have shown that consuming higher amounts of red meat increases the risk of developing CKD and end-stage renal disease ( 10 11 12 13 14 The Global Burden of Disease (GBD) study is a comprehensive research initiative that systematically quantifies health loss from hundreds of diseases, injuries, and risk factors across populations worldwide. Its primary aim is to provide a standardized, comparable measurement of health trends to inform policy and prioritize health systems planning. GBD 2021 data-base provides comprehensive epidemiological data on 371 diseases and 88 attributable risk factors across 204 countries and territories, spanning the years 1990 to 2021. The GBD framework employs a rigorous methodology that integrates vast amounts of epidemiological data using advanced statistical models, such as disease model-Bayesian meta-regression (DisMod-MR) 2.1 and Spatio-Temporal Gaussian Process Regression (ST-GPR), to produce estimates of incidence, prevalence, mortality, and disability ( 15 2 Methods 2.1 Data resource We retrieved data on annual deaths, DALYs, age-standardized mortality rate (ASMR), and age-standardized DALY rate (ASDR) of CKD attributable to high red meat intake, based on sex, age (5-year age groups of patients aged 25–94 and ≥95 years), in 204 countries and regions between 1990 and 2021 from the Global Health Data Exchange website. 1 2.2 Definitions of CKD and high red meat intake In the 2021 GBD Study, CKD was defined by an estimated glomerular filtration rate (eGFR) of less than 60 mL/min/1.73 m 2 2 16 2.3 Statistical analyses All data were reported as numbers with 95% uncertainty intervals (UIs) based on the 2.5th and 97.5th percentiles of the ordered 1,000 estimates. The average trends of ASMR and ASDR of high red meat intake-attributed CKD from 1990 to 2021 were calculated using an estimated annual percentage change (EAPC), which was widely accepted to reflect the trend of age-standardized rates (ASR) over a time interval. The natural logarithm of ASR is assumed to fit a linear regression model expressed as y α βx ϵ y f x ϵ β 17 18 p 2.4 Data visualization To illustrate the burden across various regions, we created a world map displaying ASDR, ASMR and EAPC. To identify key drivers, we performed a gender-specific decomposition analysis of three factors: population, aging, and epidemiological trends. All statistical analyses and data visualization were performed employing R software (version 4.4.2). In this study, software packages such as ggplot2, dplyr and map were used. 3 Results 3.1 Global burden Compared to 1990, there has been a substantial increase in the burden of DALYs and deaths ( Figure 1 Supplementary Figure 1 Supplementary Tables 1, 2 Figure 1 World map of ASDR of CKD attributable to high red meat intake across 204 countries and territories. (A) (B) Map A shows global variations in the Estimated Annual Percentage Change (EAPC) in Age-Standardized Death Rate (ASDR), using a color scale from -2 to 4. Insets highlight specific regions like the Caribbean and Central America, and Southeast Asia. Map B compares ASDRs globally for both sexes, males, and females between 1990 and 2021. A color gradient represents ASDR ranging from 10 to 30 per 100,000 people. Among 21 GBD regions, ASMR and ASDR were the highest in Southern Latin America (SLA) and Tropical Latin America (TLA). In contrast, South Asia had the lowest ASMR and ASDR. High-income North America presented the most significant annual increasing trends in ASMR and ASDR ( Figure 1 Supplementary Figure 1 Supplementary Tables 1, 2 At the national level, Mexico and Northern Mariana Islands had the highest CKD burden in terms of ASDR, while Sri Lanka, Bangladesh, Tajikistan, and India had the lowest. China, followed by the United Stated of America (USA), had the greatest number of deaths of CKD attributable to high red meat both 1990 and 2021 ( Supplementary Table 3 3.2 Global trends by SDI Except for the low SDI region, the DALYs burden of CKD have experienced a tremendous increase from 1990 to 2021, with the highest increase detected in the middle SDI quintile ( Supplementary Table 2 Across 21 GBD regions, we investigated the association between SDI and the disease burden of CKD from 1990 to 2021. ASDR showed a slightly positive correlation with SDI ( ρ p ρ p Figure 2A Supplementary Figure 2A Figure 2 CKD-related ASDR attributable to high red meat intake across 21 GBD regions and 204 countries, by SDI for both sexes combined, 1990–2021. (A) (B) Scatter plots showing the relationship between the Socio-Demographic Index (SDI) and Age-Standardized Death Rate (ASDR) per 100,000 people. Plot A shows a positive correlation (R = 0.36, P < 0.001) across various global regions represented by different symbols and colors. Plot B shows a smaller, yet significant correlation (ρ = 0.19, P = 0.006) with countries labeled, showing varied ASDR based on SDI rankings. Across 204 countries, our results demonstrated that there was also a slightly positive association between ASDR and SDI ( ρ p ρ p Figure 2B Supplementary Figure 2B 3.3 Decomposition analysis At the global level and across five SDI quintiles, population was the largest contributor to the DALYs. From 1990 to 2021, the contribution of population was highest in the low SDI region. Aging had the most significant influence in the high-middle SDI region. The contribution of aging was negative in the low SDI region. Epidemiological change had the most significant influence in the low-middle SDI region. Conversely, the contribution of epidemiological change was negative in the low SDI region ( Figure 3A Figure 3B Figure 3 Changes in (A) (B) Bar charts compare Disability-Adjusted Life Years (DALYs) and deaths across different Socio-Demographic Index (SDI) levels globally, for both genders, females, and males. Each bar is segmented by aging, population growth, and epidemiological change. Panel A shows DALYs, while panel B shows deaths, with noticeable differences in segment sizes across SDI levels. 3.4 Global trends by age and sex Globally, the ASMR and ASDR increased with age, peaking in those 95 plus. Both ASMR and ASDR rose in males and females from 1990 to 2021. Across most age groups, ASDR and ASMR were higher for males, but the gender gap narrowed from 1990 to 2021 ( Figure 4 Supplementary Figure 3 Figure 4 Changes in ASDR of CKD due to high red meat intake from 1990 to 2021 by sex in different SDI quintiles. (A) (B) Bar charts labeled A and B compare age-specific death rates (ASDR) by sex across five social development index (SDI) levels: Global, High, High-middle, Middle, Low-middle, and Low. Chart A shows data for 1990, while chart B shows data for 2021. Both charts display age groups from 25 to 29 up to 95 plus. In all charts, ASDR increases with age, with variations across SDI levels. Female and male data are color-coded. 3.5 Causal attribution Apart from type 1 diabetes mellitus, CKD caused by glomerulonephritis, hypertension, T2DM, and other unspecified causes has all been associated with high red meat. High red meat can lead to an increase in global CKD levels, primarily through T2DM ( Figure 5 Supplementary Table 4 Supplementary Table 5 Figure 5 Trends of global burden of CKD due to high red meat intake from 1990 to 2021. Bar charts display the (A) (B) Two bar graphs illustrate trends from 1990 to 2019 in four categories of chronic kidney disease (CKD) causes identified by colors. Graph A shows Disability-Adjusted Life Years (DALYs) and graph B depicts deaths per year. An ascending line trend indicates a general increase in both DALYs and deaths, with CKD due to diabetes mellitus type 2 as the primary contributor, followed by hypertension, glomerulonephritis, and other unspecified causes. Accompanying lines indicate age-standardized rates for each cause. 3.6 CKD burden in China and the USA In China, between 1990 and 2021, both ASDR and ASMR rose. Males consistently had higher rates than females, and this pattern was mirrored in the EAPCs. The most notable increases in ASDR and ASMR were linked to glomerulonephritis ( Supplementary Tables 6, 7 Supplementary Tables 8, 9 4 Discussion Our study comprehensively analyzed the global burden of CKD attributable to increased red meat consumption from 1990 to 2021, stratified by year, age, sex, region, and SDI. Our findings indicated that, globally, the DALYs and deaths of CKD attributed to high red meat consumption remained substantial and significantly increased from 1990 to 2021. This suggests that the burden of CKD due to increased red meat consumption continues to be a major global public health issue. According to the GBD 2019, CKD ranked 12th among the 133 leading causes of death in the GBD Study ( 19 2 20 The burden of disease is closely linked to socioeconomic development. In our study, we found that at both regional and national levels, as SDI increased, both ASMR and ASDR also rose, aligning with the levels of red meat consumption across different regions and countries. High-income countries consumed about five times more red meat than low-income countries ( 21 22 At the regional level, SLA and TLA had the highest ASMR and ASDR, consistent with previous research findings ( 22 23 24 Recent investigations have revealed that, in addition to a high red meat diet, high body mass index (BMI) and high fasting plasma glucose are also significant contributors to the increasing burden of CKD. However, there are notable differences in the relative contributions of these risk factors across different regions and diseases. Tan et al. examined the global burden of CKD attributable to high BMI using GBD 2021 data and confirmed that the global burden of CKD attributable to high BMI has risen markedly over the past three decades, particularly in high-SDI regions ( 25 25–28 We further employed decomposition analysis to explicitly disentangle the contributions of demographic drivers from true epidemiological shifts to the changing burden of CKD attributable to red meat consumption. The analysis clearly distinguished that for DALYs, the burden in the high-middle SDI region was primarily driven by demographic aging. In contrast, the low-middle SDI region was most affected by an epidemiological shift (reflected in changing ASMR), while the low SDI region’s burden was predominantly driven by population growth. A similar pattern was observed for mortality, where the high SDI region faced the largest demographic driver of aging, while population growth was the key demographic driver in other regions. These findings logically align with broader population trends: severe aging in high-middle SDI regions and rapid growth in low SDI regions. Therefore, while the risk factor (red meat) is epidemiological, its resulting burden is simultaneously modulated by independent demographic forces. This underscores that public health measures should be tailored with different focuses for regions with varying SDI levels. The results of this study showed that for individuals aged 25 and above, both the ASMR and ASDR attributable to red meat consumption increased with age in both men and women, reaching their peak at the age of 95. This suggests that older adults are at higher risk for CKD, with a higher prevalence of the disease, which is consistent with previous research findings ( 23 29 We further explored the cause of CKD due to increased red meat consumption and found that T2DM was the main cause. Consuming large amounts of red meat leads to increased intake of saturated fats, cholesterol, iron, and salt, as well as excessive acid load. It may also result in the gut microbiota producing higher levels of uremic toxins, such as trimethylamine N-oxide, indole sulfate, and p-cresyl sulfate. These metabolic disturbances and uremic toxins are closely associated with an increased risk of T2DM ( 5 30–32 33 34 The highest number of CKD deaths due to high red meat intake occurred in the USA, followed by China, a result that caught our attention. Decomposition analysis indicated that the main effect on both ASDR and ASMR in both SDI regions was aging. China and the USA rank first and third in global population size, respectively, which suggests that both a large population base and aging could contribute to the two countries having the highest red meat intake associated CKD death tolls worldwide. This study has certain limitations. We used the GBD 2021 database, which primarily consists of national and regional data without individual-level data, making it impossible to validate our conclusions on a personal level. Besides, GBD 2021 does not include dietary survey results, thus it does not establish a causal relationship between red meat consumption and CKD. Lastly, individuals who consume high amounts of red meat may also have other unhealthy lifestyle habits, such as low vegetable and fruit consumption, lack of exercise, smoking, and other confounding factors such as overweight status and lower education levels. These confounders may influence the relationship between red meat consumption and CKD. 5 Conclusion Between 1990 and 2021, CKD caused by high red meat consumption led to a continuous rise in global ASDR and ASMR, with high and middle SDI regions bearing the brunt of the burden. Older adults and men exhibited a higher disease burden, however, the gender gap has gradually narrowed over time. In light of these findings, governments worldwide should strengthen education on diet, particularly in high and middle SDI regions to reduce the CKD burden caused by increased red meat consumption. The authors thank the Institute for Health Metrics and Evaluation for sharing valuable GBD data.  1 http://ghdx.healthdata.org/gbd-results-tool Data availability statement The original contributions presented in the study are included in the article/ Supplementary material Ethics statement Ethical approval was not required for the studies involving humans because this research utilized publicly accessible data from the GBD database. As the study involved secondary data analysis and did not directly involve human subjects, patient data, or interventions, it was not required to obtain approval from an institutional ethical review board. The studies were conducted in accordance with the local legislation and institutional requirements. Written informed consent for participation was not required from the participants or the participants’ legal guardians/next of kin in accordance with the national legislation and institutional requirements because this research utilized publicly accessible data from the GBD database. As the study involved secondary data analysis and did not directly involve human subjects, patient data, or interventions, it was not required to obtain approval from an institutional ethical review board. Author contributions JG: Writing – original draft, Writing – review & editing, Conceptualization, Investigation, Software. JZ: Writing – original draft, Writing – review & editing, Funding acquisition, Project administration, Supervision. Conflict of interest The authors declare that the research was conducted in the absence of any commercial or financial relationships that could be construed as a potential conflict of interest. Generative AI statement The authors declare that no Gen AI was used in the creation of this manuscript. Any alternative text (alt text) provided alongside figures in this article has been generated by Frontiers with the support of artificial intelligence and reasonable efforts have been made to ensure accuracy, including review by the authors wherever possible. If you identify any issues, please contact us. Publisher’s note All claims expressed in this article are solely those of the authors and do not necessarily represent those of their affiliated organizations, or those of the publisher, the editors and the reviewers. Any product that may be evaluated in this article, or claim that may be made by its manufacturer, is not guaranteed or endorsed by the publisher. Supplementary material The Supplementary material for this article can be found online at: https://www.frontiersin.org/articles/10.3389/fnut.2025.1666684/full#supplementary-material References 1. Bikbov B Purcell C Levey AS Smith M Abdoli A Abebe M Global, regional, and national burden of chronic kidney disease, 1990–2017: a systematic analysis for the Global Burden of Disease Study 2017 Lancet 2020 395 709 33 10.1016/S0140-6736(20)30045-3 32061315 PMC7049905 2. Nahorna A Baur H The relevance of identifying the biomechanical and functional effects of abdominar obesity on activities of daily living in individuals with low back pain Curr Issues Sport Sci 2023 8 067 10.36950/2023.2ciss067 3. Ayodele OE Alebiosu CO Burden of chronic kidney disease: an international perspective Adv Chronic Kidney Dis 2010 17 215 24 10.1053/j.ackd.2010.02.001 20439090 4. Wang V Vilme H Maciejewski ML Boulware LE The economic burden of chronic kidney disease and end-stage renal disease Semin Nephrol 2016 36 319 30 10.1016/j.semnephrol.2016.05.008 27475662 5. Mafra D Borges NA Cardozo LFM d F Anjos JS Black AP Moraes C Red meat intake in chronic kidney disease patients: two sides of the coin Nutrition 2018 46 26 32 10.1016/j.nut.2017.08.015 29290351 6. Farvid MS Sidahmed E Spence ND Mante Angua K Rosner BA Barnett JB Consumption of red meat and processed meat and cancer incidence: a systematic review and meta-analysis of prospective studies Eur J Epidemiol 2021 36 937 51 10.1007/s10654-021-00741-9 34455534 7. Pan L Chen L Lv J Pang Y Guo Y Pei P Association of red meat consumption, metabolic markers, and risk of cardiovascular diseases Front Nutr 2022 9 833271 10.3389/fnut.2022.833271 35495958 PMC9051033 8. Lajous M Bijon A Fagherazzi G Rossignol E Boutron-Ruault MC Clavel-Chapelon F Processed and unprocessed red meat consumption and hypertension in women Am J Clin Nutr 2014 100 948 52 10.3945/ajcn.113.080598 25080454 9. González N Marquès M Nadal M Domingo JL Meat consumption: which are the current global risks? A review of recent (2010–2020) evidences Food Res Int 2020 137 109341 10.1016/j.foodres.2020.109341 33233049 PMC7256495 10. Mirmiran P Yuzbashian E Aghayan M Mahdavi M Asghari G Azizi F A prospective study of dietary meat intake and risk of incident chronic kidney disease J Ren Nutr 2020 30 111 8 10.1053/j.jrn.2019.06.008 31422013 11. Lew QLJ Jafar TH Koh HWL Jin A Chow KY Yuan JM Red meat intake and risk of ESRD J Am Soc Nephrol 2017 28 304 12 10.1681/ASN.2016030248 27416946 PMC5198288 12. Odermatt A The western-style diet: a major risk factor for impaired kidney function and chronic kidney disease Am J Physiol Renal Physiol 2011 301 F919 31 10.1152/ajprenal.00068.2011 21880837 13. Iammarino M Marino R Nardelli V Ingegno M Albenzio M Red meat heating processes, toxic compounds production and nutritional parameters changes: what about risk–benefit? Foods 2024 13 445 10.3390/foods13030445 38338580 PMC10855356 14. Clonan A Roberts KE Holdsworth M Socioeconomic and demographic drivers of red and processed meat consumption: implications for health and environmental sustainability Proc Nutr Soc 2016 75 367 73 10.1017/S0029665116000100 27021468 PMC4974628 15. Li T Zhang H Lian M He Q Lv M Zhai L Global status and attributable risk factors of breast, cervical, ovarian, and uterine cancers from 1990 to 2021 J Hematol Oncol 2025 18 5 10.1186/s13045-025-01660-y 39794860 PMC11721161 16. Afshin A Sur PJ Fay KA Cornaby L Ferrara G Salama JS Health effects of dietary risks in 195 countries, 1990–2017: a systematic analysis for the Global Burden of Disease Study 2017 Lancet 2019 393 1958 72 10.1016/S0140-6736(19)30041-8 30954305 PMC6899507 17. Jin Z Wang D Zhang H Liang J Feng X Zhao J Incidence trend of five common musculoskeletal disorders from 1990 to 2017 at the global, regional and national level: results from the Global Burden of Disease Study 2017 Ann Rheum Dis 2020 79 1014 22 10.1136/annrheumdis-2020-217050 32414807 18. Hankey BF Ries LA Kosary CL Feuer EJ Merrill RM Clegg LX Partitioning linear trends in age-adjusted rates Cancer Causes Control 2000 11 31 5 10.1023/A:1008953201688 10680727 19. Kyu HH Abate D Abate KH Abay SM Abbafati C Abbasi N Global, regional, and national disability-adjusted life-years (DALYs) for 359 diseases and injuries and healthy life expectancy (HALE) for 195 countries and territories, 1990–2017: a systematic analysis for the Global Burden of Disease Study 2017 Lancet 2018 392 1859 922 10.1016/S0140-6736(18)32335-3 30415748 PMC6252083 20. Roth GA Abate D Abate KH Abay SM Abbafati C Abbasi N Global, regional, and national age-sex-specific mortality for 282 causes of death in 195 countries and territories, 1980–2017: a systematic analysis for the Global Burden of Disease Study 2017 Lancet 2018 392 1736 88 10.1016/S0140-6736(18)32203-7 30496103 PMC6227606 21. Ranabhat CL Park MB Kim CB Influence of alcohol and red meat consumption on life expectancy: results of 164 countries from 1992 to 2013 Nutrients 2020 12 459 10.3390/nu12020459 32059386 PMC7071474 22. Wei H Ren J Li R Qi X Yang F Li Q Global, regional, and national burden of chronic kidney disease attributable to high fasting plasma glucose from 1990 to 2019: a systematic analysis from the Global Burden of Disease Study 2019 Front Endocrinol 2024 15 1379634 10.3389/fendo.2024.1379634 38601204 PMC11004380 23. Ying M Shao X Qin H Yin P Lin Y Wu J Disease burden and epidemiological trends of chronic kidney disease at the global, regional, national levels from 1990 to 2019 Nephron 2024 148 113 23 10.1159/000534071 37717572 PMC10860888 24. Satija A Hu FB Bowen L Bharathi AV Vaz M Prabhakaran D Dietary patterns in India and their association with obesity and central obesity Public Health Nutr 2015 18 3031 41 10.1017/S1368980015000312 25697609 PMC4831640 25. Tan H Liu Z Zhang Y Yang K Zeng Y Li G Global burden and trends of high BMI-attributable chronic kidney disease: a comprehensive analysis from 1990 to 2021 and projections to 2035 Front Nutr 2025 12 1611227 10.3389/fnut.2025.1611227 40777172 PMC12330218 26. Brauer M Roth GA Aravkin AY Zheng P Abate KH Abate YH Global burden and strength of evidence for 88 risk factors in 204 countries and 811 subnational locations, 1990–2021: a systematic analysis for the Global Burden of Disease Study 2021 Lancet 2024 403 2162 203 10.1016/S0140-6736(24)00933-4 38762324 PMC11120204 27. Zhou X-D Chen Q-F Yang W Zuluaga M Targher G Byrne CD Burden of disease attributable to high body mass index: an analysis of data from the Global Burden of Disease Study 2021 EClinicalMedicine 2024 76 102848 10.1016/j.eclinm.2024.102848 39386160 PMC11462227 28. Gu J You H Global and regional drivers of chronic kidney disease burden in older adults: the dominant role of high fasting plasma glucose and the rise of obesity in China Arch Gerontol Geriatr 2025 139 106006 10.1016/j.archger.2025.106006 40902229 29. Elliot SJ Berho M Korach K Doublier S Lupia E Striker GE Gender-specific effects of endogenous testosterone: female α-estrogen receptor-deficient C57Bl/6J mice develop glomerulosclerosis Kidney Int 2007 72 464 72 10.1038/sj.ki.5002328 17495854 30. Shi W Huang X Schooling CM Zhao JV Red meat consumption, cardiovascular diseases, and diabetes: a systematic review and meta-analysis Eur Heart J 2023 44 2626 35 10.1093/eurheartj/ehad336 37264855 31. Neeland IJ Marso SP Ayers CR Lewis B Oslica R Francis W Effects of liraglutide on visceral and ectopic fat in adults with overweight and obesity at high cardiovascular risk: a randomised, double-blind, placebo-controlled, clinical trial Lancet Diabetes Endocrinol 2021 9 595 605 10.1016/S2213-8587(21)00179-0 34358471 32. Jee Ko G Obi Y Tortorici AR Kalantar-Zadeh K Dietary protein intake and chronic kidney disease Curr Opin Clin Nutr Metab Care 2017 20 77 85 10.1097/MCO.0000000000000342 27801685 PMC5962279 33. Liu G Zong G Wu K Hu Y Li Y Willett WC Meat cooking methods and risk of type 2 diabetes: results from three prospective cohort studies Diabetes Care 2018 41 1049 60 10.2337/dc17-1992 29530926 PMC5911789 34. Gu X Drouin-Chartier JP Sacks FM Hu FB Rosner B Willett WC Red meat intake and risk of type 2 diabetes in a prospective cohort study of United States females and males Am J Clin Nutr 2023 118 1153 63 10.1016/j.ajcnut.2023.08.021 38044023 PMC10739777 ",
  "metadata": {
    "Title of this paper": "Red meat intake and risk of type 2 diabetes in a prospective cohort study of United States females and males",
    "Journal it was published in:": "Frontiers in Nutrition",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12491058/"
  }
}