{
  "title": "Paper_79",
  "abstract": "pmc Front Immunol Front Immunol 1754 frontimmu Front. Immunol. Frontiers in Immunology 1664-3224 Frontiers Media SA PMC12491222 PMC12491222.1 12491222 12491222 10.3389/fimmu.2025.1656370 1 Immunology Review Notch signaling in cancer: metabolic reprogramming and therapeutic implications Wang Shuang-Shuang  1  2  3  * Lv Hui-Lin  1  2  3 Nie Rong-Zu  1  2  3 Liu Ya-Ping  1  2  3 Hou Yan-Jie  1  2  3 Chen Chen  1  2  3 Tao Xing-Yue  1  2  3 Luo Huo-Min  1  2  3 Li Pei-Feng  1  2  3  *  1 College of Food and Bioengineering, Zhengzhou University of Light Industry Zhengzhou China  2 Henan Key Laboratory of Cold Chain Food Quality and Safety Control, Zhengzhou University of Light Industry Zhengzhou China  3 Institute of Life and Health, Zhengzhou University of Light Industry Zhengzhou China Edited by: Subhadeep Roy Reviewed by: Sapna Jain  Lakhveer Singh *Correspondence: Pei-Feng Li, peifengli@zzuli.edu.cn wangsh052@zzuli.edu.cn 19 9 2025 2025 16 480569 1656370 30 6 2025 02 9 2025 19 09 2025 04 10 2025 04 10 2025 Copyright © 2025 Wang, Lv, Nie, Liu, Hou, Chen, Tao, Luo and Li. 2025 Wang, Lv, Nie, Liu, Hou, Chen, Tao, Luo and Li https://creativecommons.org/licenses/by/4.0/ This is an open-access article distributed under the terms of the Creative Commons Attribution License (CC BY). The use, distribution or reproduction in other forums is permitted, provided the original author(s) and the copyright owner(s) are credited and that the original publication in this journal is cited, in accordance with accepted academic practice. No use, distribution or reproduction is permitted which does not comply with these terms. The evolutionarily conserved Notch signaling pathway is essential for cell-fate determination, organogenesis, and tissue homeostasis. Notch receptors and their ligands are transmembrane proteins with epidermal growth factor–like repeats; ligand–receptor binding triggers canonical Notch signaling. Notch signaling is context dependent in cancer, functioning as either an oncogene or a tumor suppressor. Aberrant Notch activation promotes epithelial–mesenchymal transition, sustains cancer stem–like phenotypes, and drives metabolic reprogramming, thereby facilitating tumor progression and therapeutic resistance. Current clinical efforts target the pathway with γ-secretase inhibitors (GSIs), monoclonal and bispecific antibodies, and synthetic Notch (synNotch) approaches. Clinical translation, however, is constrained by dose-limiting toxicity, a paucity of predictive biomarkers, and compensatory resistance through intersecting pathways. Priorities for future work include the development of highly selective Notch modulators, biomarker-guided combination regimens, and targeted delivery systems to realize the translational potential of Notch-targeted therapies in precision oncology. notch signaling pathway cancer metabolic reprogramming tumormicroenvironment metabolism The author(s) declare financial support was received for the research and/or publication of this article. This research was financially supported by grants from the China Postdoctoral Science Foundation (2024M763020), and the Doctoral Scientific Research Foundation of Zhengzhou University of Light Industry (2025BSJJ017). pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement yes pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes section-in-acceptance Cancer Immunity and Immunotherapy 1 Introduction Cancer has become a significant threat to global health, with a disease burden that cannot be ignored. In 2022, cancer resulted in 9.67 million deaths worldwide and accounted for 250 million disability-adjusted life years (DALYs). This significantly diminishes patients’ quality of life and leads to substantial social productivity losses ( 1 In modern medicine, cancer remains a global health challenge, and its complexity and diversity necessitate a comprehensive understanding of its biological characteristics from multiple perspectives. Cancer reflects not only dysregulated cell proliferation but also extensive reprogramming of cellular metabolism, which furnishes the energy and biosynthetic precursors necessary for tumor growth and survival. The Notch signaling pathway has recently gained prominence in cancer metabolism research as a crucial factor in determining cell fate. The Notch signaling pathway facilitates intercellular communication via receptor-ligand interactions, impacting cell differentiation, proliferation, and apoptosis. This pathway’s abnormal activation is linked to the onset and development of diverse tumors, where its influence can be either promotive or suppressive, contingent on the cell type and microenvironment. The Notch signaling pathway’s complexity stems from its capacity to perform varied functions across different biological contexts, highlighting its potential as a therapeutic target in cancer treatment. Cancer metabolic reprogramming involves tumor cells altering metabolic pathways to support rapid proliferation, enhancing energy supply and biosynthetic precursor production. The Notch signaling pathway significantly influences tumor growth, survival, and therapeutic response by regulating essential metabolic pathways, including glucose, fatty acids, and amino acids. Current research focuses on the Notch signaling pathway’s role in glycolysis and its effects on fatty acid and amino acid metabolism. The Notch signaling pathway’s role in the tumor microenvironment is gaining increased attention. These interactions are vital for tumor initiation and progression, influencing tumor development and treatment responses, which are key areas for future research. With a deeper understanding of the Notch signaling pathway’s role in cancer metabolism, targeted therapies are being developed and show promise. Future research will evaluate the efficacy and safety of these targeted treatments and investigate their synergistic effects with other therapies. Future research will concentrate on creating personalized treatment strategies tailored to the Notch signaling pathway’s activation status and patients’ unique genetic backgrounds. In conclusion, elucidating the influence of Notch signaling on cancer metabolism holds considerable promise. It may reveal novel diagnostic biomarkers and therapeutic targets, improving treatment efficacy and patient quality of life. Continued research will facilitate the development of more precise, mechanism-based therapies and contribute to more effective management of this global health burden. 2 Overview of cancer and the notch pathway 2.1 Overview of cancer Cancer (malignant neoplasm) is characterized by invasion of surrounding tissues and, often, dissemination to distant sites via the bloodstream and lymphatic system, resulting in metastatic tumors. Its development is a multistage, multifactorial process influenced by genetic, environmental, lifestyle, and other factors. Cancer types vary and can be classified by tissue origin into epithelial-derived (e.g., lung, breast, and colorectal cancers) and non-epithelial-derived (e.g., lymphomas and leukemias). Cancer development generally results from genetic mutations in cells that can disrupt cell cycle regulation, inhibit apoptosis, promote angiogenesis, and enable immune evasion. The clinical manifestations of cancer are diverse, and in the early stages, there may be no symptoms or the symptoms may be subtle. As the disease progresses, patients may experience symptoms such as lumps, pain, weight loss, and fatigue. Cancer treatment options encompass surgical resection, radiotherapy, chemotherapy, targeted therapy, and immunotherapy. Surgery is the preferred treatment method for many early-stage cancers, physically removing the tumor. Radiotherapy utilizes high-energy rays to damage cancer cell DNA, whereas chemotherapy uses drugs to inhibit cancer cell proliferation. Targeted therapy aims at specific molecular markers on cancer cells, while immunotherapy boosts the patient’s immune system to identify and destroy these cells. 2.2 Overview of the notch signaling pathway The Notch signaling pathway was first discovered in mutant fruit flies, where the notched wing phenotype was caused by mutations in this gene ( 2 3 4 5 The Notch signaling pathway is evolutionarily conserved and facilitates direct signal transmission between cell membrane receptors and nuclear effector molecules without intermediates. In contrast to traditional signaling pathways like those involving G protein-coupled receptors and enzyme-linked receptors, the Notch signaling pathway uniquely requires the receptor to undergo three cleavages for signal transmission to the nucleus. The Notch signaling pathway includes Notch receptors and ligands, intracellular effectors like CSL (CBF-1/Suppressor of Hairless/Lag-1) DNA-binding protein, downstream target genes such as the Hes (hairy and enhancer of split) and Hey (hairy and enhancer-of-split related with YRPW motif) gene families, along with regulatory molecules like Fringe, Numb, Deltex, and Mastermind ( 6 5 The Notch signaling pathway comprises two types: the classical and non-canonical signal transduction pathways. The classical Notch signaling pathway begins when the Notch receptor binds to its ligand, leading to its cleavage by the -secretase complex and the subsequent release of the Notch intracellular domain (NICD). NICD translocates to the nucleus, engages with the CSL co-repressor complex, and activates transcription of downstream target genes. Research indicates that the Notch signaling pathway can operate independently of ligands and CSL via the non-canonical pathway, which bypasses -secretase cleavage and potentially influences cellular functions through alternative mechanisms ( 7 9 10 11 14 15 16 17 The Notch signaling pathway’s activation and function are crucial for various cellular processes. This pathway is initiated when Notch receptors interact with specific ligands, leading to a series of proteolytic cleavages. These cleavages release the Notch intracellular domain, which translocates to the nucleus to regulate gene expression. The pathway plays a significant role in cell differentiation, proliferation, and apoptosis, highlighting its importance in developmental and physiological contexts. 2.3 Notch signaling pathway activation The Notch receptor is a single-pass transmembrane heterodimer composed of the Notch extracellular domain (NECD), transmembrane domain (TMD), and Notch intracellular domain (NICD) ( 18 19 20 21 23 24 25 26 27 2+ 28 29 30 31 32 33 34 35 36 3 Functions of the notch signaling pathway The Notch signaling pathway is essential for preserving cancer cells’ stem cell-like properties, increasing invasiveness, and fostering chemoresistance. This pathway can function as both an oncogene and a tumor suppressor across different cancer types. Dysregulation of the Notch signaling pathway can facilitate epithelial-mesenchymal transition (EMT) and angiogenesis in malignant tumors, processes that are intimately linked to cancer proliferation, invasion, and metastasis ( 37 38 The Notch signaling pathway has garnered significant interest regarding its role in cancer energy metabolism. For example, oncogenic Notch signaling promotes T-ALL cell proliferation through Asb2-mediated NF-κB ( 39 40 41 3.1 The notch signaling pathway plays a crucial role in tumor development The association between the Notch signaling pathway and tumor development was initially identified in human T-cell acute lymphoblastic leukemia (T-ALL) ( 42  Table 1 Table 1 NOTCH signaling in cancers. Cancer type Involved NOTCH components Relevant evidence Ref. T-cell acute lymphoblastic leukemia NOTCH1, NOTCH3 Transplanted hematopoietic progenitor cells with activation of Notch1 signaling in murine models can develop T-ALL; Activating mutations of NOTCH3 without NOTCH1 has also been found in several T-ALLs. ( 115 116 Breastcancer NOTCH1, NOTCH4, JAG1 Upregulation of non-mutated NOTCH1 and JAG1 is associated with poorprognosis of BC; The mutations of Notch1 and Notch4 mediated by the mouse mammary tumor virus can promote epithelial mammary tumorigenesis; ( 117 118 Squamouscellcancers NOTCH1-3 Inactivated NOTCH1–3 were detected in SCCs pecimens; The genomic aberrations in NOTCH1 induced by mutagenic agent could cause an increasing tumor burden in SCCs; ( 119 121 In oncology, the Notch signaling pathway has a highly intricate role, as it can either encourage or suppress the initiation and progression of various tumors, potentially having different effects at different stages of tumor growth. Due to the complexity and diversity of its regulatory mechanisms, the Notch signaling pathway has become an important potential target for the study and treatment of various diseases. In cervical cancer development, high Notch signaling expression inhibits cell growth, whereas low expression decreases apoptosis. Inhibiting the Notch signaling pathway expression induces apoptosis in pancreatic cancer cells ( 43 44 45 46 47 48 16 49 3.2 The influence of notch signaling on cancer metabolism The Notch signaling pathway is essential for intercellular communication, transmitting vital information in normal cells and playing a pivotal role in cancer development ( 50 51 52 53 21  Table 2 Table 2 The relationship between the Notch signaling pathway and related diseases. Type of disease Point of application Mechanism of action Congenital scoliosis (CS) Mutations in Notch Signaling Pathway-Related Genes (HES7, LFNG, MESP2, DLL3) Gene Mutations Lead to Abnormal Spinal Development Alagille Syndrome(ALGS) JAG1 gene mutation Mutations in the JAG1 gene lead to biliary ductal dysgenesis, thereby affecting the liver and other multiple systems. Tetralogy of Fallot(TOF) Variants in the 3′ untranslated region (3′UTR) of the NOTCH1 and JAG1 genes. Genetic variants impact cardiac development, leading to abnormalities in the ventricular outflow tract. Non-alcoholic Fatty Liver Disease(NAFLD)Non-alcoholic Fatty Liver Disease(NASH Notch1/Notch2 Elevated expression of Notch1/Notch2 Aberrant activation of the Notch signaling pathway promotes lipogenesis and hepatic fibrosis. Diabetes mellitus Inhibition of the Notch signaling pathway Inhibition of the Notch signaling pathway promotes the differentiation of pancreatic cells into β-cells, thereby improving glucose homeostasis. Pancreatic Ductal Adenocarcinoma(PDAC) Activation of the Notch signaling pathway Synergizes with Ras to promote oncogenesis T-cell acute lymphoblastic leukemia(T-ALL) Gain-of-function mutations in Notch1 Elevated expression of Notch1 drives cell proliferation and oncogenesis. In the reprogramming of cancer metabolism and the regulation of the tumor microenvironment, the Notch signaling pathway demonstrates its key role in balancing oncogenic and tumor-suppressive effects. The complexity of this pathway lies in its ability to exert entirely different functions in various biological contexts, making it a highly promising target in cancer therapy. 3.3 Metabolic reprogramming regulation Metabolic reprogramming is essential in the development and progression of diseases such as cancer, diabetes, cardiovascular, and neurodegenerative disorders. It refers to the phenomenon where cellular metabolic pathways change under different physiological or pathological conditions, such as cancer, inflammation, infection, or cell differentiation. This metabolic shift involves multiple aspects, including energy production, biosynthesis, and cellular signaling, to adapt to changes in cellular function. Metabolic reprogramming is a hallmark of cancer, encompassing changes in the metabolism of glucose, fatty acids, and amino acids (  Table 3 Table 3 Types of metabolic reprogramming regulated by the notch signaling pathway. Category Primary mechanisms Associated with glucose catabolism Anaerobic glycolysis and aerobic oxidation Associated with fatty acid catabolism Fatty acid oxidation (β-oxidation) Associated with amino acid catabolism Protein degradation, amino acid deamination, and urea cycle 3.3.1 Notch pathway and glucose metabolism Glucose metabolism primarily occurs through two pathways: anaerobic and aerobic oxidation. Anaerobic oxidation, also known as glycolysis, is the process by which glucose is converted into lactate, while aerobic oxidation involves the complete oxidation of glucose in the presence of oxygen, ultimately producing water and carbon dioxide. Aerobic glycolysis supplies energy and facilitates the synthetic metabolic growth of cancer cells. The Notch signaling pathway is pivotal in the glycolysis phase of cancer cell metabolic reprogramming. This process, known as the Warburg effect ( 54  Figure 1 55 Figure 1 The Warburg effect in cancer cells ( 132 Illustration depicting cellular glucose metabolism and signaling pathways. Glucose enters the cell via GLUT1, undergoing the Warburg effect to produce pyruvate and ATP. Pyruvate converts to lactate via LDHA or acetyl-CoA for the TCA cycle. HIF-1 influences lactate production and is linked to the Notch signaling pathway. Notch receptors interact with ligands Delta and Jagged, activating γ-secretase to release NICD, which enters the nucleus and affects gene expression by interacting with Hes and CSL. Research has demonstrated that in gastric cancer cells, activation of the Notch pathway significantly enhances glycolytic activity by upregulating downstream genes such as c-Myc, promoting the synthesis of a series of key glycolytic enzymes, including LDHA, PFKB3, PKM2, PGK1, HK2, GLUT1, ALDOA, PEPCK, and GLUT3 ( 56 57 59 60 61 3.3.2 Notch pathway and fatty acid metabolism Lipids, or fats, consist of molecules such as triglycerides, phospholipids, sphingolipids, cholesterol, and cholesteryl esters. Among these lipids, fatty acids (FAs) are the core components, which not only constitute lipids but can also exist independently. The metabolism of FAs involves their uptake, synthesis, oxidation, transformation, and storage. The sources of FAs are divided into exogenous and endogenous. Cells uptake fatty acids from their environment via transport proteins on the plasma membrane, including fatty acid translocase (FAT), fatty acid transport proteins (FATPs/SLC27), and plasma membrane fatty acid-binding protein (FABP). Endogenous fatty acids are synthesized from acetyl-CoA in the cytoplasm, which is derived from glycolysis, the tricarboxylic acid cycle, or the pentose phosphate pathway. Fatty acid oxidation (FAO), or β-oxidation, is a vital mitochondrial process integral to the energy metabolism and stress response in cancer cells. Key enzymes such as carnitine palmitoyltransferase I (CPT 1) are potential targets for cancer therapy ( 62  Figure 2 Figure 2 Fatty acid metabolism in cancer cells ( 133 de novo Diagram illustrating cellular metabolic pathways influenced by Notch signaling and exogenous fatty acids. It includes components like NICD-CSL, c-Myc, SREBP, and FASN in relation to fatty acid synthesis, glycolysis, glutamine metabolism, and the TCA cycle. Arrows indicate interactions and transformations, such as the conversion of glucose to pyruvic acid and fatty acids to acyl-CoA, affecting ATP production. Fatty acid synthesis de novo The Notch signaling pathway orchestrates lipid metabolic homeostasis through multi-level regulatory mechanisms. This pathway promotes hepatic fatty acid synthesis by maintaining the stability of mTORC1 (mechanistic target of rapamycin complex 1) ( 63 63 64 65 66 69 70 71 72 73 74 75 3.3.3 Notch pathway and amino acid metabolism Amino acid metabolism and catabolism mainly include protein degradation, amino acid deamination, and the urea cycle. Amino acids play significant physiological roles in the body, such as protein synthesis, signal transduction, and gene expression regulation. Glutamine metabolism is essential in tumor cells. Activation of the Notch signaling pathway enhances glutaminase expression, boosting glutamine metabolism to supply nitrogen and energy to tumor cells. In acute T-cell lymphoblastic leukemia (T-ALL), inhibiting the Notch1 signaling pathway influences glutamine catabolism ( 76 77 78 80 81 82 Notch signaling also participates in regulating the activity of mTORC1 ( 83 84 85 86  Table 4 Table 4 Notch and metabolic pathways. Metabolic pathways Interaction with the notch pathway Tumor types Ref. mTOR Notch activates the PI3K/AKT/mTOR pathway to promote tumor growth. Breast cancer, T-ALL, and breast cancer stem cells (BCSCs). ( 122 123 HIF-1α Notch stabilizes HIF-1α to promote the Warburg effect. Hypoxia enhances Notch signaling (upregulating DLL4). Notch and HIF-1α cooperatively regulate EMT progression and metabolic reprogramming in breast cancer. Notch1 and HIF-1α show synergistic co-expression in breast cancer. Glioblastoma (GBM), Renal cell carcinoma (RCC), Breast cancer ( 108 124 125 MYC Notch1 directly activates MYC transcription. T-ALL, Breast cancer, NSCLC、SCLC ( 126 127 Wnt/β-catenin Notch and Wnt competitively regulate stem cell differentiation. Colorectal cancer (CRC), HCC ( 128 130 p53 p53 inhibits Notch1 expression and impedes cell differentiation. cervical cancer, HCC ( 109 131 3.4 The role of notch signaling pathway in the tumor microenvironment The tumor microenvironment (TME) primarily comprises blood vessels, immune cells, fibroblasts, and the extracellular matrix ( 87 88  Table 5 Table 5 Regulation of multiple cell types in the tumor microenvironment by the notch signaling pathway. Cell type Regulatory mechanisms Specific functions Fibroblasts Activation of the Notch signaling pathway Promotes the activation of cancer-associated fibroblasts (CAFs), secretion of extracellular matrix components, and remodeling of the tumor microenvironment. Endothelial cells The Dll4/Notch1 signaling pathway Through interaction with tumor cells, it inhibits tumor cell proliferation and participates in tumor angiogenesis. Endothelial cells Interplay between Notch signaling and immune cells Regulates the polarization of tumor-associated macrophages (TAMs) to influence the immunosuppressive microenvironment; affects the activity and function of T cells, which may promote immune evasion. Stem cells Notch signaling sustains stem cell properties. Sustains the self-renewal and differentiation capacity of cancer stem cells, thereby promoting tumor recurrence and drug resistance. Tumor cells Activation or inhibition of the Notch signaling pathway Promotes tumor cell proliferation, survival, and inhibits apoptosis; regulates epithelial-mesenchymal transition (EMT), thereby enhancing the capacity for invasion and metastasis; sustains the stemness properties of cancer cells, augmenting tumor aggressiveness. 3.4.1 Regulation of CAFs by notch signaling pathway CAFs play a significant role in maintaining an ideal microenvironment for tumor cell survival and proliferation and promoting angiogenesis ( 89 90 91 92 93 94 3.4.2 Notch signaling pathway regulates MDSCs During tumor immune escape, myeloid-derived suppressor cells (MDSCs) play a key role. Tumor cells attract MDSCs to the target organ by secreting cytokines or chemokines. In this process, MDSCs exert their inhibitory function by secreting arginase-1, inducible nitric oxide synthase, and reactive oxygen species, which can effectively inhibit the proliferation of CD4 + + 95 3.4.3 Regulation of tregs by notch signaling pathway Regulatory T cells (Tregs), a subset of CD4 + 96 97 3.4.4 Regulation of NK cells by the notch signaling pathway As critical effector cells of the innate immune system, natural killer (NK) cells directly eliminate tumor cells through cytotoxic activity. The Notch signaling pathway not only plays a pivotal role in regulating the development and functional maturation of NK cells but also establishes a unique immune evasion mechanism in cancer stem cells (CSCs) via the Notch3 receptor. Studies have demonstrated that Notch3 is the only member of the Notch receptor family confirmed to directly regulate the expression of programmed death-ligand 1 (PD-L1) ( 98 99 100 101 102 103 53 93 3.4.5 Regulation of TAMs by the notch signaling pathway The Notch signaling pathway is essential for controlling the polarization of tumor-associated macrophages (TAMs), encouraging their conversion into the M1 type, which is an anti-tumor active phenotype. The Notch signaling pathway facilitates macrophage polarization to the M1 type by modulating downstream molecules miR-125a and miR-148a-3p expression ( 104 105 3.5 The dual role of notch signaling in cancer pathogenesis The Notch signaling pathway exhibits a complex dual role in cancer, with its dysregulation being closely associated with the pathogenesis of various malignancies. However, recent studies have revealed significant tumor type-dependent heterogeneity and metabolic crosstalk mechanisms. In terms of targeted therapies, γ-secretase inhibitors (GSIs) such as nirogacestat have demonstrated efficacy in desmoid tumor clinical trials but face dose-limiting gastrointestinal toxicity in solid tumors ( 106 107 59 108 109 108 110 106 111 112 114  Table 6 Table 6 Clinical targeting of the notch pathway. Target Drug name Conditions Phase Current states γ-Secretase RO4929097 (R4733) Breast Cancer I Terminated Metastatic Pancreas Cancer II Completed Advanced Solid Tumors I Completed Nirogacestat Desmoid Tumors/Aggressive Fibromatosis II Active, not recruiting AL101 Advanced solid tumors I Completed Advanced Breast Cancer II Terminated Advanced Cancer And Leukemia I Completed DLL3 Rovalpituzumab tesirine (Rova-T) Small cell lung cancer III Completed HPN-328 Small cell lung cancer I/II Terminated DLL4 Enoticumab (REGN421) Advanced Solid Malignan cies I Completed Demcizumab (OMP 21M18) Non-Squamous Non Small Cell Lung Cancer I Completed Notch 1 Brontictuzumab (OMP 52M51) Solid Tumors I Completed Notch 3 PF-06650808 Advanced solid tumors I Terminated Notch 2/3 Tarextumab (OMP-59R5) Pancreatic Cancer I/II Completed 4 Summary and future prospects Targeting the Notch signaling pathway has demonstrated significant therapeutic potential in various malignancies, with current clinical development primarily focusing on three key strategies: 1) γ-secretase inhibitors (GSIs), including nirogacestat, DAPT, and PF-03084014; 2) Notch receptor/ligand-targeting antibodies, such as DLL3-targeted tarlatamab; and 3) synthetic Notch (synNotch) therapies. Clinical evidence indicates that NOTCH1 mutation status serves as a predictive biomarker for immunotherapy efficacy in esophageal squamous cell carcinoma (ESCC). However, Notch-targeted therapies face several critical challenges: First, GSIs exhibit dose-limiting toxicities, including gastrointestinal effects, dermatologic adverse events, and potential impacts on growth and development, along with off-target effects that limit clinical utility. Second, the pathway demonstrates context-dependent oncogenic or tumor-suppressive functions (e.g., pro-tumorigenic in NSCLC versus tumor-suppressive in EBT), necessitating highly individualized treatment approaches. Third, complex resistance mechanisms involving crosstalk with key pathways like Wnt and PXR substantially complicate therapeutic outcomes. Fourth, while DLL3-targeted agents (e.g., Amgen’s tarlatamab) have achieved breakthroughs in small cell lung cancer treatment, drug resistance remains problematic, and biomarker selection systems require optimization Fifth, although natural compounds like quercetin show specific Notch pathway modulatory activity, their low bioavailability presents a significant challenge. To address these challenges, future research should prioritize the following: 1) the development of highly selective novel inhibitors, particularly those derived from optimized natural products; 2) the establishment of precision biomarker stratification systems for personalized therapy; 3) the investigation of combination strategies involving immune checkpoint inhibitors (e.g., PD-1 antibodies) and targeted therapies; 4) the enhancement of drug delivery efficiency through nanotechnology; 5) the formulation of spatiotemporal sequential treatment strategies to overcome tumor heterogeneity; and 6) the conduct of large-scale, multicenter clinical trials to thoroughly evaluate long-term efficacy and safety. These advancements will facilitate the translation of Notch-targeted therapies from the laboratory to clinical practice, thereby opening new avenues for precision oncology. Author contributions SW: Writing – original draft, Visualization, Supervision, Writing – review & editing, Funding acquisition, Conceptualization. HL: Writing – review & editing, Writing – original draft, Conceptualization, Visualization, Project administration. RN: Investigation, Writing – review & editing. YL: Investigation, Writing – review & editing. YH: Writing – review & editing, Methodology. CC: Investigation, Writing – original draft. XT: Investigation, Writing – review & editing. HL: Investigation, Writing – original draft. PL: Funding acquisition, Project administration, Writing – review & editing, Supervision, Conceptualization, Writing – original draft. Conflict of interest The authors declare that the research was conducted in the absence of any commercial or financial relationships that could be construed as a potential conflict of interest. Generative AI statement The author(s) declare that no Generative AI was used in the creation of this manuscript. Any alternative text (alt text) provided alongside figures in this article has been generated by Frontiers with the support of artificial intelligence and reasonable efforts have been made to ensure accuracy, including review by the authors wherever possible. If you identify any issues, please contact us. Publisher’s note All claims expressed in this article are solely those of the authors and do not necessarily represent those of their affiliated organizations, or those of the publisher, the editors and the reviewers. Any product that may be evaluated in this article, or claim that may be made by its manufacturer, is not guaranteed or endorsed by the publisher. Supplementary material The Supplementary Material for this article can be found online at: https://www.frontiersin.org/articles/10.3389/fimmu.2025.1656370/full#supplementary-material References 1 Bray F Ferlay J Soerjomataram I Siegel RL Torre LA Jemal A Global cancer statistics 2018: GLOBOCAN estimates of incidence and mortality worldwide for 36 cancers in 185 countries CA Cancer J Clin 2018 68 394 424 10.3322/caac.21492 30207593 2 Metz CW Bridges CB Incompatibility of mutant races in drosophila Proc Natl Acad Sci U.S.A 1917 3 673–8 10.1073/pnas.3.12.673 16586764 PMC1091355 3 Artavanis-Tsakonas S Muskavitch MA Yedvobnick B Molecular cloning of Notch, a locus affecting neurogenesis in Drosophila melanogaster Proc Natl Acad Sci U S A. 1983 80 1977–81 10.1073/pnas.80.7.1977 6403942 PMC393735 4 Sachan N Sharma V Mutsuddi M Mukherjee AJFJ Notch signalling: multifaceted role in development and disease FEBS J. 2024 291 3030–59 10.1111/febs.16815 37166442 5 Pei Q Yi Q Tang L Liver fibrosis resolution: from molecular mechanisms to therapeutic opportunities Int J Mol Sci 2023 24 9671 10.3390/ijms24119671 37298621 PMC10253436 6 Binghan Z Wanling L Yaling L Yunkai Y Huan Z Kongming W Notch signaling pathway: architecture, disease, and therapeutics Signal Transduct Target Ther 2022 7 95 10.1038/s41392-022-00934-y 35332121 PMC8948217 7 Shawber C Nofziger D Hsieh JJ Lindsell C Bogler O Hayward D Notch signaling inhibits muscle cell differentiation through a CBF1-independent pathway Development 1996 122 3765–73 10.1242/dev.122.12.3765 9012498 8 Shin HM Minter LM Cho OH Gottipati S Fauq AH Golde TE Notch1 augments NF-κB activity by facilitating its nuclear retention EMBO J 2006 25 129–38 10.1038/sj.emboj.7600902 16319921 PMC1356346 9 Sanders PGT Muñoz -Descalzo S Balayo T Wirtz-Peitz F Hayward P Arias AM Ligand-independent traffic of notch buffers activated armadillo in drosophila PLoS Biol 2009 7 e1000169 10.1371/journal.pbio.1000169 19668359 PMC2716527 10 Sanalkumar R James DJJC Sciences ML Non-canonical activation of Notch signaling/target genes in vertebrates Cell Mol Life Sci 2010 67 2957–68 10.1007/s00018-010-0391-x 20458516 PMC11115867 11 Andersen P Uosaki H Shenje LT Kwon C Non-canonical Notch signaling: emerging role and mechanism Trends Cell Biol 2012 22 257–65 10.1016/j.tcb.2012.02.003 22397947 PMC3348455 12 Hurlbut GD Kankel MW Lake RJ Artavanis-Tsakonas S Crossing paths with Notch in the hyper-network Curr Opin Cell Biol 2007 19 166–75 10.1016/j.ceb.2007.02.012 17317139 13 Liu L Zhang L Zhao S Zhao XY Min PX Ma YD Non-canonical notch signaling regulates actin remodeling in cell migration by activating PI3K/AKT/cdc42 pathway Front Pharmacol 2019 10 370 10.3389/fphar.2019.00370 31057403 PMC6477508 14 Bhat V Sun YJ Weger S Raouf AJSC and development, notch-induced expression of FZD7 requires noncanonical NOTCH3 signaling in human breast epithelial cells Stem Cells Dev 2016 25 522–9 10.1089/scd.2015.0315 26847503 15 Jin S Mutvei AP Chivukula IV Andersson ER Ramskld D Sandberg R Non-canonical Notch signaling activates IL-6/JAK/STAT signaling in breast tumor cells and is controlled by p53 and IKKα/IKKβ Oncogene 2013 32 4892–902 10.1038/onc.2012.517 23178494 PMC3795477 16 Lee MJ Zhu J An JH Lee SE Kim TY Oh E A transcriptomic analysis of cerebral microvessels reveals the involvement of Notch1 signaling in endothelial mitochondrial-dysfunction-dependent BBB disruption Fluids Barriers CNS 2022 19 64 10.1186/s12987-022-00363-7 36028880 PMC9414148 17 Perumalsamy LR Nagala M Banerjee P Sarin A Differentiation, A hierarchical cascade activated by non-canonical Notch signaling and the mTOR|[ndash]|Rictor complex regulates neglect-induced death in mammalian cells Cell Death Differentiation 2009 16 879–89 10.1038/cdd.2009.20 19265851 18 Chillakuri C Sheppard D Lea SM Handford PA Notch receptor Cligand binding and activation: Insights from molecular studies – ScienceDirect Semin Cell Dev Biol 2012 23 421–8 10.1016/j.semcdb.2012.01.009 22326375 PMC3415683 19 Kovall RA Gebelein B Sprinzak D Kopan R The canonical notch signaling pathway: structural and biochemical insights into shape, sugar, and force Dev Cell 2017 41 228–41 10.1016/j.devcel.2017.04.001 28486129 PMC5492985 20 Rana NA Haltiwanger RS Fringe benefits: functional and structural impacts of O-glycosylation on the extracellular domain of Notch receptors Curr Opin Struct Biol 2011 21 583–9 10.1016/j.sbi.2011.08.008 21924891 PMC3195399 21 Nowell CS Radtke F Notch as a tumour suppressor Nat Rev Cancer 2017 17 145–59 10.1038/nrc.2016.145 28154375 22 Gordon WR Roy M Vardar-Ulu D Garfinkel M Mansour MR Aster JC Structure of the Notch1-negative regulatory region: implications for normal activation and pathogenic signaling in T-ALL Blood 2009 113 4381–90 10.1182/blood-2008-08-174748 19075186 PMC2676092 23 Stephenson NL Avis JM Direct observation of proteolytic cleavage at the S2 site upon forced unfolding of the Notch negative regulatory region Proc Natl Acad Sci U.S.A 2012 109 E2757–65 10.1073/pnas.1205788109 23011796 PMC3478610 24 Shweta V Pamela S Multiple roles for O-glycans in Notch signalling FEBS Lett 2018 592 3819–34 10.1002/1873-3468.13251 30207383 PMC6289669 25 Matsumoto K Luther KB Haltiwanger RS Diseases related to Notch glycosylation Mol Aspects Med 2021 79 100938 10.1016/j.mam.2020.100938 33341260 26 Logeat F Bessia C Brou C Lebail O Jarriault S Seidah NG The Notch1 receptor is cleaved constitutively by a furin-like convertase Proc Natl Acad Sci U.S.A 1998 95 8108–12 10.1073/pnas.95.14.8108 9653148 PMC20937 27 Lake RJ Grimm LM Alexey V Andrew B Spyros AT Rafael LJPO  In vivo PLoS One 2009 4 e6728 10.1371/journal.pone.0006728 19701455 PMC2726433 28 Hu B Phan SH Notch in fibrosis and as a target of anti-fibrotic therapy Pharmacol Res 2016 108 57 64 10.1016/j.phrs.2016.04.010 27107790 PMC5074914 29 Lieber T Kidd S Young M.W kuzbanian-mediated cleavage of drosophila notch Genes Dev 2002 16 209–21 10.1101/gad.942302 11799064 PMC155326 30 Zolkiewska AJC Sciences ML ADAM proteases: ligand processing and modulation of the Notch pathway Cell Mol Life Sci 2008 65 2056–68 10.1007/s00018-008-7586-4 18344021 PMC2674646 31 Reichrath J Reichrath S Notch signaling in prevention and therapy: fighting cancer with a two-sided sword Adv Exp Med Biol 2021 1287 1 7 10.1007/978-3-030-55031-8 33034022 32 Strooper BD Annaert W Cupers P Saftig P Craessaerts K Mumm JS A presenilin-1-dependent γ-secretase-like protease mediates release of Notch intracellular domain Nature 1999 398 518–22 10.1038/19083 10206645 33 Shim YS Lee HS Hwang JS Aberrant notch signaling pathway as a potential mechanism of central precocious puberty Int J Mol Sci 2022 23 3332 10.3390/ijms23063332 35328752 PMC8950842 34 Schroeter EH Kisslinger JA Kopan R Notch-1 signalling requires ligand-induced proteolytic release of intracellular domain Nature 1998 393 382–6 10.1038/30756 9620803 35 Kim GS Park HS Lee YC OPTHiS identifies the molecular basis of the direct interaction between CSL and SMRT corepressor Mol Cells 2018 41 842–52 10.14348/molcells.2018.0196 30157580 PMC6182220 36 Guo M Niu Y Xie M Liu X Notch signaling, hypoxia, and cancer Front Oncol 2023 13 1078768 10.3389/fonc.2023.1078768 36798826 PMC9927648 37 Piao HY Guo S Wang Y Zhang J Long noncoding RNA NALT1-induced gastric cancer invasion and metastasis via NOTCH signaling pathway World J Gastroenterol 2019 25 6508–26 10.3748/wjg.v25.i44.6508 31802831 PMC6886014 38 Shi Q Xue C Zeng Y Yuan X Chu Q Jiang S Notch signaling pathway in cancer: from mechanistic insights to targeted therapies Signal Transduct Target Ther 2024 9 128 10.1038/s41392-024-01828-x 38797752 PMC11128457 39 Wei W Li N Li Z Yan LJC Letters MB The notch pathway promotes NF-κB activation through Asb2 in T cell acute lymphoblastic leukemia cells Cell Mol Biol Lett 2018 23 37 10.1186/s11658-018-0102-4 30116272 PMC6085606 40 Chen L Lu H Peng D Cao LL Ballout F Srirmajayam K Activation of NOTCH signaling via DLL1 is mediated by APE1-redox-dependent NF-κB activation in oesophageal adenocarcinoma Gut 2023 72 421–32 10.1136/gutjnl-2022-327076 35750470 PMC9789198 41 Clara JA Monge C Yang Y Takebe NJSS LLC BM Targeting signalling pathways and the immune microenvironment of cancer stem cells- a clinical update Nat Rev Clin Oncol 2020 17 204–32 10.1038/s41571-019-0293-2 31792354 42 Brechbiel J Miller-Moslin K Adjei AA Crosstalk between hedgehog and other signaling pathways as a basis for combination therapies in cancer Cancer Treat Rev 2014 40 750–9 10.1016/j.ctrv.2014.02.003 24613036 43 Hao Z Cairns RA Inoue S Li WY Mak TW Idh1 mutations contribute to the development of T-cell Malignancies in genetically engineered mice Proc Natl Acad Sci U.S.A 2016 113 1387–92 10.1073/pnas.1525354113 26787889 PMC4747700 44 Chen W Zhang Y Li R Huang W Wei X Zeng D Notch3 transactivates glycogen synthase kinase-3-beta and inhibits epithelial-to-mesenchymal transition in breast cancer cells Cells 2022 11 2872 10.3390/cells11182872 36139447 PMC9497076 45 De Santis F Romero-Cordoba SL Castagnoli L Volpari T Faraci S Fuca G BCL6 and the Notch pathway: a signaling axis leading to a novel druggable biotarget in triple negative breast cancer Cell Oncol (Dordr) 2022 45 257–74 10.1007/s13402-022-00663-y 35357654 46 Wang F Xia X Wang J Sun Q Cheng B Notch1 signaling contributes to the oncogenic effect of HBx on human hepatic cells Biotechnol Lett 2013 35 29 37 10.1007/s10529-012-1048-7 22986536 47 Kagawa S Natsuizaka M Whelan KA Facompre N Cellular senescence checkpoint function determines differential Notch1-dependent oncogenic and tumor-suppressor activities Oncogene 2015 34 2347–59 10.1038/onc.2014.169 24931169 PMC4268095 48 Kurz J Weiss A-C Thiesler H Qasrawi F Deuper L Kaur J Notch signaling is a novel regulator of visceral smooth muscle cell differentiation in the murine ureter Development 2022 149 199735 10.1242/dev.199735 35103284 49 Koike H Harada M Kusamoto A Kunitomi C Xu Z Tanaka T Notch signaling induced by endoplasmic reticulum stress regulates cumulus-oocyte complex expansion in polycystic ovary syndrome Biomolecules 2022 12 1037 10.3390/biom12081037 36008931 PMC9405998 50 Xia R Xu M Yang J Ma X The role of Hedgehog and Notch signaling pathway in cancer Mol BioMed 2022 3 44 10.1186/s43556-022-00099-8 36517618 PMC9751255 51 Braune EB Lendahl U Notch – a goldilocks signaling pathway in disease and cancer therapy Discov Med 2016 21 189–96 27115169 52 Weng AP Ferrando AA Lee W Morris JP Silverman LB Activating mutations of NOTCH1 in human T cell acute lymphoblastic leukemia Science 2004 306 269–71 10.1126/science.1102160 15472075 53 Yamaguchi N Oyama T Ito E Satoh H Azuma S Hayashi M NOTCH3 signaling pathway plays crucial roles in the proliferation of erbB2-negative human breast cancer cells Cancer Res 2008 68 1881–8 10.1158/0008-5472.CAN-07-1597 18339869 54 Krisher RL Prather RS A role for the Warburg effect in preimplantation embryo development: metabolic modification to support rapid cell proliferation Mol Reprod Dev 2012 79 311–20 10.1002/mrd.22037 22431437 PMC3328638 55 Ying H Kimmelman AC Lyssiotis CA Hua S Chu GC Fletcher-Sananikone E Oncogenic kras maintains pancreatic tumors through regulation of anabolic glucose metabolism Cell 2012 149 656–70 10.1016/j.cell.2012.01.058 22541435 PMC3472002 56 He D Chen M Chang L Gu J Liu F Gao X  De novo Cancer Lett 2022 549 215837 10.1016/j.canlet.2022.215837 35921972 57 Kuwabara S Yamaki M Yu H Itoh M Notch signaling regulates the expression of glycolysis-related genes in a context-dependent manner during embryonic development Biochem Biophys Res Commun 2018 503 803–8 10.1016/j.bbrc.2018.06.079 29913146 58 Xie M Fu XG Jiang K Notch1/TAZ axis promotes aerobic glycolysis and immune escape in lung cancer Cell Death Dis 2021 12 832 10.1038/s41419-021-04124-6 34482375 PMC8418606 59 Moriyama H Moriyama M Ozawa T Tsuruta D Iguchi T Tamada S Notch signaling enhances stemness by regulating metabolic pathways through modifying p53, NF-κB, and HIF-1α Stem Cells Dev 2018 27 935–47 10.1089/scd.2017.0260 29717634 60 Pajvani UB Shawber CJ Samuel VT Birkenfeld AL Shulman GI Kitajewski J Inhibition of Notch signaling ameliorates insulin resistance in a FoxO1-dependent manner Nat Med 2011 17 961–7 10.1038/nm.2378 21804540 PMC3387563 61 Kumar S Chatterjee M Ghosh P Ganguly KK Basu M Ghosh MK Targeting PD-1/PD-L1 in cancer immunotherapy: An effective strategy for treatment of triple-negative breast cancer (TNBC) patients Genes Dis 2022 10 1318–50 10.1016/j.gendis.2022.07.024 37397537 PMC10311058 62 Su Y Yuan Q Mitochondrial fatty acid oxidase CPT1A ameliorates postoperative cognitive dysfunction by regulating astrocyte ferroptosis Brain Res 2025 1850 149424 10.1016/j.brainres.2024.149424 39725377 63 Pajvani UB Qiang L Kangsamaksin T Kitajewski J Ginsberg HN Accili D Inhibition of Notch uncouples Akt activation from hepatic lipid accumulation by decreasing mTorc1 stability Nat Med 2013 19 1054–60 10.1038/nm.3259 23832089 PMC3737382 64 Song NJ Yun UJ Yang S Wu C Seo CR Gwon AR Notch1 deficiency decreases hepatic lipid accumulation by induction of fatty acid oxidation Sci Rep 2016 6 19377 10.1038/srep19377 26786165 PMC4726366 65 Hewage SM Au-Yeung KKW Prashar S Wijerathne CUB Karmin. O Siow YL Lingonberry improves hepatic lipid metabolism by targeting notch1 signaling Antioxidants (Basel) 2022 11 472 10.3390/antiox11030472 35326122 PMC8944850 66 Han SH Wu MY Nam BY Park JT Yoo TH Kang SW PGC-1 α protects from notch-induced kidney fibrosis development J Am Soc Nephrol 2017 28 3312–22 10.1681/ASN.2017020130 28751525 PMC5661291 67 Sharma S Sirin Y Susztak K The story of Notch and chronic kidney disease Curr Opin Nephrol Hypertens 2011 20 56 61 10.1097/MNH.0b013e3283414c88 21088575 PMC3164509 68 Bi P Kuang S Notch signaling as a novel regulator of metabolism Trends Endocrinol Metab 2015 26 248–55 10.1016/j.tem.2015.02.006 25805408 PMC4435535 69 Huang XY Gan RH Xie J She L Zhao Y Ding LC The oncogenic effects of HES1 on salivary adenoid cystic carcinoma cell growth and metastasis BMC Cancer 2018 18 436 10.1186/s12885-018-4350-5 29665790 PMC5904989 70 Ross DA Rao PK Kadesch TJM Biology C Dual roles for the Notch target gene Hes-1 in the differentiation of 3T3-L1 preadipocytes Mol Cell Biol 2004 24 3505–13 10.1128/MCB.24.8.3505-3513.2004 15060169 PMC381674 71 Kitamura T Kitamura YI Funahashi Y Shawber CJ Castrillon DH Kollipara R A Foxo/Notch pathway controls myogenic differentiation and fiber type specification J Clin Invest 2007 117 2477–85 10.1172/JCI32054 17717603 PMC1950461 72 Harjes U Bridges E McIntyre A Fielding BA Harris AL Fatty acid-binding protein 4, a point of convergence for angiogenic and metabolic signaling pathways in endothelial cells J Biol Chem 2014 289 23168–76 10.1074/jbc.M114.576512 24939870 PMC4132814 73 Ahmad N Moton S Kuttikrishnan S Prabhu KS Masoodi T Ahmad S Fatty acid synthase: A key driver of ovarian cancer metastasis and a promising therapeutic target Pathol Res Pract 2024 260 155465 10.1016/j.prp.2024.155465 39018927 74 Li C Gao T Zhao Q Li Z Wang Z Ding S Inhibition of CPT1A activates the cGAS/STING pathway to enhance neutrophil-mediated tumor abrogation in triple-negative breast cancer Cancer Lett 2025 16 217991 10.1016/j.canlet.2025.217991 40825468 75 Matsufuji S Kitajima Y Higure K Kimura N Maeda S Yamada K A HIF-1 inhibitor combined with palmitic acid and L-carnitine treatment can prevent the fat metabolic reprogramming under hypoxia and induce apoptosis in hepatocellular carcinoma cells Cancer Metab 2023 11 25 10.1186/s40170-023-00328-w 38066600 PMC10709876 76 Herranz D Ambesi-Impiombato A Sudderth J Sánchez-Martín M Ferrando A An oncogenic metabolic switch mediates resistance to NOTCH1 inhibition in T-ALL Cancer Res 2014 74 965–5 10.1158/1538-7445.AM2014-965 77 Sanchez-Martin M Ferrando A The NOTCH1-MYC highway toward T-cell acute lymphoblastic leukemia Blood 2017 129 1124–33 10.1182/blood-2016-09-692582 28115368 78 Zhou W Feng X Ren C Jiang X Liu W Huang W Over-expression of BCAT1, a c-Myc target gene, induces cell proliferation, migration and invasion in nasopharyngeal carcinoma Mol Cancer 2013 12 53 10.1186/1476-4598-12-53 23758864 PMC3698204 79 McCalley S Pirman D Clasquin M Johnson K Jin S Vockley J Metabolic analysis reveals evidence for branched chain amino acid catabolism crosstalk and the potential for improved treatment of organic acidurias Mol Genet Metab 2019 128 57 61 10.1016/j.ymgme.2019.05.008 31133529 PMC6864255 80 Edmunds LR Sharma L Kang A Lu J Vockley J Basu S Correction: c-Myc programs fatty acid metabolism and dictates acetyl-CoA abundance and fate J Biol Chem 2014 289 25382–92 10.1074/jbc.M114.580662 25053415 PMC4155699 81 Gao P Tchernyshyov I Chang T Lee Y Kita K c-Myc suppression of miR-23a/b enhances mitochondrial glutaminase expression and glutamine metabolism Nature 2009 458 762–5 10.1038/nature07823 19219026 PMC2729443 82 Hu J Wang T Xu J Wu S Liu H WEE1 inhibition induces glutamine addiction in T-cell acute lymphoblastic leukemia Haematologica 2021 106 1816–27 10.3324/haematol.2019.231126 31919076 PMC8252940 83 Chan SM Weng AP Tibshirani R Aster JC Utz PJ Notch signals positively regulate activity of the mTOR pathway in T-cell acute lymphoblastic leukemia Blood 2007 110 278–86 10.1182/blood-2006-08-039883 17363738 PMC1896117 84 Grzes KM Swamy M Hukelmann JL Emslie E Sinclair LV Cantrell DAJL Control of amino-acid transport coordinates metabolic reprogramming in T cell Malignancy Leukemia 2017 31 2771–9 10.1038/leu.2017.160 28546582 PMC5729345 85 Guo Y Cang X Zhu L Zhu M Li A Wang Z PPP1CA/YAP/GS/Gln/mTORC1 pathway activates retinal Müller cells during diabetic retinopathy Exp Eye Res 2021 210 108703 10.1016/j.exer.2021.108703 34280391 86 Shimobayashi M Hall M.N Multiple amino acid sensing inputs to mTORC1 Cell Res 2016 26 7 20 10.1038/cr.2015.146 26658722 PMC4816134 87 Olivier M Patrick M Notch signaling in the tumor microenvironment Cancer Cell 2018 34 536–48 10.1016/j.ccell.2018.07.009 30146333 88 Joyce JA Pollard JW Microenvironmental regulation of metastasis Nat Rev Cancer 2009 9 239–52 10.1038/nrc2618 19279573 PMC3251309 89 Liu Z Chen M Zhao R Huang Y Liu F Li B CAF-induced placental growth factor facilitates neoangiogenesis in hepatocellular carcinoma Acta Biochim Biophys Sin 2019 52 18 25 10.1093/abbs/gmz134 31828297 90 Xiong S Wang R Chen Q Luo J Wang JL Zhao ZX Cancer-associated fibroblasts promote stem cell-like properties of hepatocellular carcinoma cells through IL-6/STAT3/Notch signaling Am J Cancer Res 2018 8 302–16 29511600 PMC5835697 91 Studebaker AW Storci G Werbeck JL Sansone P Sasser AK Tavolari S Fibroblasts isolated from common sites of breast cancer metastasis enhance cancer cell growth rates and invasiveness in an interleukin-6-dependent manner Cancer Res 2008 68 9087–95 10.1158/0008-5472.CAN-08-0400 18974155 92 Pupo M Pisano A Abonante S Maggiolini M Musti AM GPER activates Notch signaling in breast cancer cells and cancer-associated fibroblasts (CAFs) Int J Biochem Cell Biol 2014 46 56 67 10.1016/j.biocel.2013.11.011 24275097 93 Boelens MC Nabet BY Wu TJ Yoon T Minn AJ Azzam DJ Exosome transfer from stromal to breast cancer cells regulates therapy resistance pathways Cell 2014 159 499 513 10.1016/j.cell.2014.09.051 25417103 PMC4283810 94 Liu C Liu L Chen XJ Cheng JM Zhang H Zhang CC LSD1 stimulates cancer-associated fibroblasts to drive notch3-dependent self-renewal of liver cancer stem-like cells Cancer Res 2018 78 938–49 10.1158/0008-5472.CAN-17-1236 29259010 95 Salminen A Kaarniranta K Kauppinen AJC Sciences ML Immunosenescence: the potential role of myeloid-derived suppressor cells (MDSC) in age-related immune deficiency Cell Mol Life Sci 2019 76 1901–18 10.1007/s00018-019-03048-x 30788516 PMC6478639 96 Williams LM Rudensky AY Maintenance of the Foxp3-dependent developmental program in mature regulatory T cells requires continued expression of Foxp3 Nat Immunol 2007 8 277–84 10.1038/ni1437 17220892 97 Ortiz-Martínez F Gutiérrez-Aviñó FJ Sanmartín E Pomares-Navarro E Villalba-Riquelme C García-Martínez A Association of Notch pathway down-regulation with Triple Negative/Basal-like breast carcinomas and high tumor-infiltrating FOXP3 + Exp Mol Pathol 2016 100 460–8 10.1016/j.yexmp.2016.04.006 27118257 98 Mansour FA Al-Mazrou A Al-Mohanna F Al-Alwan M Ghebeh H PD-L1 is overexpressed on breast cancer stem cells through notch3/mTOR axis Oncoimmunology 2020 9 1729299 10.1080/2162402X.2020.1729299 32313717 PMC7153827 99 Casey SC Tong L Li Y Do R Walz S Fitzgerald KN MYC regulates the antitumor immune response through CD47 and PD-L1 Science 2016 352 227–31 10.1126/science.aac9935 26966191 PMC4940030 100 Parsa AT Waldron JS Panner A Crane CA Parney IF Barry JJ Loss of tumor suppressor PTEN function increases B 7 1 Nat Med 2006 13 84–8 10.1038/nm1517 17159987 101 Lafkas D Rodilla V Huyghe M Mourao L Kiaris H Fre S Notch3 marks clonogenic mammary luminal progenitor cells in vivo J Cell Biol 2013 203 47 56 10.1083/jcb.201307046 24100291 PMC3798243 102 Baker A Wyatt D Bocchetta M Li J Filipovic A Green A Notch-1-PTEN-ERK1/2 signaling axis promotes HER2 + Oncogene 2018 37 4489–504 10.1038/s41388-018-0251-y 29743588 PMC9115842 103 Choy L Hagenbeek TJ Solon M French D Finkle D Shelton A Constitutive NOTCH3 signaling promotes the growth of basal breast cancers Cancer Res 2017 77 1439–52 10.1158/0008-5472.CAN-16-1022 28108512 104 Qinfeng H Junhong L Jinghui Z Ailing W The carcinogenic role of the notch signaling pathway in the development of hepatocellular carcinoma J Cancer 2019 10 1570–9 10.7150/jca.26847 31031867 PMC6485212 105 Zhao JL Huang F He F Gao CC Liang SQ Ma PF Forced activation of notch in macrophages represses tumor growth by upregulating miR-125a and disabling tumor-associated macrophages Cancer Res 2016 76 1403–15 10.1158/0008-5472.CAN-15-2019 26759236 106 Zheng C Huang J Xu G Li W Weng X Zhang S The Notch signaling pathway in desmoid tumor: Recent advances and the therapeutic prospects Biochim Biophys Acta Mol Basis Dis 2024 1870 166907 10.1016/j.bbadis.2023.166907 37793461 107 Zhou D Byers LA Sable B Smit M-AD Sadraei NH Dutta S Clinical pharmacology profile of AMG 119, the first chimeric antigen receptor T (CAR-T) cell therapy targeting delta-like ligand 3 (DLL3), in patients with relapsed/refractory small cell lung cancer (SCLC) J Clin Pharmacol 2024 64 362–70 10.1002/jcph.2346 37694295 108 De Francesco EM Maggiolini M Musti AM Crosstalk between notch, HIF-1α and GPER in breast cancer EMT Int J Mol Sci 2018 19 2011 10.3390/ijms19072011 29996493 PMC6073901 109 Wang C Qi R Li N Wang Z An H Zhang Q Notch1 signaling sensitizes tumor necrosis factor-related apoptosis-inducing ligand-induced apoptosis in human hepatocellular carcinoma cells by inhibiting Akt/Hdm2-mediated p53 degradation and up-regulating p53-dependent DR5 expression J Biol Chem 2009 284 16183–90 10.1074/jbc.M109.002105 19376776 PMC2713568 110 Lu Z Du W Jiao X Wang Y Shi J Shi Y NOTCH1 mutation and survival analysis of tislelizumab in advanced or metastatic esophageal squamous cell carcinoma: A biomarker analysis from the randomized, phase III, RATIONALE-302 trial J Clin Oncol 2025 43 1898–909 10.1200/JCO-24-01818 40179324 PMC12118624 111 Wang Z-J Zhan X-Y Ma L-Y Yao K Dai H-Y Kumar Santhanam R Activation of the γ-secretase/NICD-PXR/Notch pathway induces Taxol resistance in triple-negative breast cancer Biochem Pharmacol 2024 230 116577 10.1016/j.bcp.2024.116577 39427919 112 Kim B Stephen SL Hanby AM Horgan K Perry SL Richardson J Chemotherapy induces Notch1-dependent MRP1 up-regulation, inhibition of which sensitizes breast cancer cells to chemotherapy BMC Cancer 2015 15 634 10.1186/s12885-015-1625-y 26362310 PMC4567818 113 Simões BM O’Brien CS Eyre R Silva A Yu L Sarmiento-Castro A Anti-estrogen resistance in human breast tumors is driven by JAG1-NOTCH4-dependent cancer stem cell activity Cell Rep 2015 12 1968–77 10.1016/j.celrep.2015.08.050 26387946 PMC4594158 114 Zhang CC Yan Z Zong Q Fang DD Painter C Zhang Q Synergistic effect of the γ-secretase inhibitor PF-03084014 and docetaxel in breast cancer models Stem Cells Transl Med 2013 2 233–42 10.5966/sctm.2012-0096 23408105 PMC3659764 115 Pear WS Aster JC Scott ML Hasserjian RP Baltimore DJ Exclusive development of T cell neoplasms in mice transplanted with bone marrow expressing activated notch alleles J Exp Med 1996 183 2283–91 10.1084/jem.183.5.2283 8642337 PMC2192581 116 Bernasconi-Elias P Hu T Jenkins D Firestone B Gans S Kurth E Characterization of activating mutations of NOTCH3 in T-cell acute lymphoblastic leukemia and anti-leukemic activity of NOTCH3 inhibitory antibodies Oncogene 2016 35 6077–86 10.1038/onc.2016.133 27157619 PMC5102827 117 Reedijk M Odorcic S Chang L Zhang H Miller N McCready DR High-level coexpression of JAG1 and NOTCH1 is observed in human breast cancer and is associated with poor overall survival Cancer Res 2005 65 8530–7 10.1158/0008-5472.CAN-05-1069 16166334 118 Callahan R Smith GH MMTV-induced mammary tumorigenesis: gene discovery, progression to Malignancy and cellular pathways Oncogene 2000 19 992 1001 10.1038/sj.onc.1203276 10713682 119 Cibulskis K Tward AD Kostic AD Stransky N Egloff AM The mutational landscape of head and neck squamous cell carcinoma Science 2011 333 1157–60 10.1126/science.1208130 21798893 PMC3415217 120 Natsuizaka M Whelan KA Kagawa S Tanaka K Giroux V Chandramouleeswaran PM Interplay between Notch1 and Notch3 promotes EMT and tumor initiation in squamous cell carcinoma Nat Commun 2017 8 1758 10.1038/s41467-017-01500-9 29170450 PMC5700926 121 Nassar D Latil M Boeckx B Lambrechts D Blanpain C Genomic landscape of carcinogen-induced and genetically induced mouse skin squamous cell carcinoma Nat Med 2015 21 946–54 10.1038/nm.3878 26168291 122 Nguyen TL Nokin M-J Terés S Tomé M Bodineau C Galmar O Downregulation of Glutamine Synthetase, not glutaminolysis, is responsible for glutamine addiction in Notch1-driven acute lymphoblastic leukemia Mol Oncol 2021 15 1412–31 10.1002/1878-0261.12877 33314742 PMC8096784 123 Zhang C Xu S Yin C Hu S Liu P The role of the mTOR pathway in breast cancer stem cells (BCSCs): mechanisms and therapeutic potentials Stem Cell Res Ther 2025 16 156 10.1186/s13287-025-04218-4 40158191 PMC11954216 124 Ercan C Vermeulen JF Hoefnagel L Bult P van der Groep P van der Wall E HIF-1α and NOTCH signaling in ductal and lobular carcinomas of the breast Cell Oncol (Dordr) 2012 35 435–42 10.1007/s13402-012-0102-8 23008060 125 Qiang L Wu T Zhang HW Lu N Hu R Wang YJ HIF-1α is critical for hypoxia-mediated maintenance of glioblastoma stem cells by activating Notch signaling pathway Cell Death Differ 2012 19 284–94 10.1038/cdd.2011.95 21818118 PMC3263503 126 Ng J Sutherland KD NOTCH your usual suspect: MYC charged with controlling neuroendocrine cell-fate in small cell lung cancer Cancer Cell 2020 38 17 20 10.1016/j.ccell.2020.06.009 32663464 127 Liu Y Zhu C Tang L Chen Q Guan N Xu K MYC dysfunction modulates stemness and tumorigenesis in breast cancer Int J Biol Sci 2021 17 178–87 10.7150/ijbs.51458 33390842 PMC7757029 128 Braune E-B Seshire A Lendahl U Notch and wnt dysregulation and its relevance for breast cancer and tumor initiation Biomedicines 2018 6 101 10.3390/biomedicines6040101 30388742 PMC6315509 129 Disoma C Zhou Y Li S Peng J Xia Z Wnt/β-catenin signaling in colorectal cancer: Is therapeutic targeting even possible Biochimie 2022 195 39 53 10.1016/j.biochi.2022.01.009 35066101 130 Kim W Khan SK Gvozdenovic-Jeremic J Kim Y Dahlman J Kim H Hippo signaling interactions with Wnt/β-catenin and Notch signaling repress liver tumorigenesis J Clin Invest 2017 127 137–52 10.1172/JCI88486 27869648 PMC5199712 131 Yugawa T Handa K Narisawa-Saito M Ohno SI Fujita M Kiyono TJM Regulation of notch1 gene expression by p53 in epithelial cells Mol Cell Biol 2007 27 3732–42 10.1128/MCB.02119-06 17353266 PMC1899981 132 Delgir S Bastami M Ilkhani K Safi A Seif F Alivand MR The pathways related to glutamine metabolism, glutamine inhibitors and their implication for improving the efficiency of chemotherapy in triple-negative breast cancer Mutat Res Rev Mutat Res 2021 787 108366 10.1016/j.mrrev.2021.108366 34083056 133 Munir R Lisec J Swinnen JV Zaidi N Too complex to fail? Targeting fatty acid metabolism for cancer therapy Prog Lipid Res 2021 85 101143 10.1016/j.plipres.2021.101143 34856213 ",
  "metadata": {
    "Title of this paper": "Too complex to fail? Targeting fatty acid metabolism for cancer therapy",
    "Journal it was published in:": "Frontiers in Immunology",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12491222/"
  }
}