{
  "title": "Paper_909",
  "abstract": "pmc BMC Public Health BMC Public Health 63 bmcph BMC Public Health 1471-2458 BMC PMC12487170 PMC12487170.1 12487170 12487170 41029623 10.1186/s12889-025-24534-x 24534 1 Research Relationship between biological ageing, premature mortality, life expectancy, and number of live births: a prospective cohort study of the UK women Guo Huanyu 1 Liu Yuqing 1 Yang Ruiming 2 Li Xuebing 1 Teng Yubing 1 Wei Wei 102594@hrbmu.edu.cn 2 3 4 Zhang Dandan dandanzhang@hrbmu.edu.cn 1 1 https://ror.org/05vy2sc54 grid.412596.d 0000 0004 1797 9737 Department of Obstetrics and Gynecology, The First Affiliated Hospital of Harbin Medical University, 2 https://ror.org/05jscf583 grid.410736.7 0000 0001 2204 9268 Department of Nutrition and Food Hygiene, School of Public Health, Key Laboratory of Precision nutrition and health, Ministry of Education, Harbin Medical University, 3 https://ror.org/05jscf583 grid.410736.7 0000 0001 2204 9268 Department of Pharmacology, College of Pharmacy Key Laboratory of Cardiovascular Research, Ministry of Education, Harbin Medical University, 4 https://ror.org/05jscf583 grid.410736.7 0000 0001 2204 9268 National Key Discipline, School of Public Health, Department of Nutrition and Food Hygiene, Harbin Medical University, 30 9 2025 2025 25 478168 3239 23 5 2024 20 8 2025 30 09 2025 02 10 2025 02 10 2025 © The Author(s) 2025 2025 https://creativecommons.org/licenses/by-nc-nd/4.0/ Open Access http://creativecommons.org/licenses/by-nc-nd/4.0/ Objective There are varying perspectives on the impact of the number of live births on health, and few studies have explored whether the number of live births is associated with female aging. Given the global impact of age-related diseases and premature death, this study aimed to evaluate the associations of the number of live births with the biological ageing, premature mortality and life expectancy of women. Methods A total of 272,494 participants from the UK Biobank who completed the questionnaire on the number of Live births between 2006 and 2010 at baseline were enrolled. Participants were categorized into 6 groups based on the number of live births, and participants with one live birth composed the reference group. A general linear regression model and Cox proportional hazards model were used to evaluate the associations of the number of live births with biological ageing and premature mortality in women. A restricted cubic spline (RCS) was used to visualize the dose‒response relationship. Moreover, the latest Office for National Statistics life tables were used to calculate life expectancy. Results During a median follow-up of 12.7 years, 10,992 cases of all-cause premature death were documented. After adjustment for potential confounders, compared to women who had one live birth, women who had no live births had a greater risk of premature death (hazard ratio, HR = 1.17, 95% CI: 1.09–1.25), whereas women with two or three live births had a lower risk of premature death (HR = 0.88, 95% CI: 0.83–0.93, HR = 0.88, 95% CI: 0.83–0.95), which showed a U-shaped relationship ( P P Conclusions There was a U-shaped relationship between the number of live births and the biological ageing, premature mortality and life expectancy of women. Women who had no live births or five or more live births were more likely to experience accelerated biological ageing, with a higher risk of premature death and a lower life expectancy. Based on these evidence, it is recommended that healthcare providers focus on guiding women towards a balanced reproductive strategy that optimizes both health outcomes and longevity. Supplementary Information The online version contains supplementary material available at 10.1186/s12889-025-24534-x. Keywords Number of live births Biological ageing Premature mortality Life expectancy Childbearing http://dx.doi.org/10.13039/501100001809 National Natural Science Foundation of China 62102121 Zhang Dandan Outstanding Youth Fund of the First Affiliated Hospital of Harbin Medical University 2024JQ01 Zhang Dandan pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement yes pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes issue-copyright-statement © BioMed Central Ltd., part of Springer Nature 2025 Introduction Currently, there are two contrasting viewpoints regarding the health impact of the number of live births. Some studies have proposed that childbirth may reduce the risk of breast cancer, uterine cancer, and ovarian cancer by influencing hormone levels and the expression of specific genomic traits [ 1 2 3 Biological aging refers to the irreversible natural changes in the metabolic and physical characteristics of cells as individuals age, leading to impaired self-regulation and regeneration capabilities, changes in the structure and function of tissues and organs, and an increased risk of age-related diseases [ 4 5 6 9 Furthermore, the results from observational studies regarding the potential link between the number of live births and women’s risk of mortality are inconsistent [ 10 13 14 15 16 14 15 17 18 19 20 24 To fill this knowledge gap, this study utilized data from the UK Biobank (UKB) to assess the associations between the number of live births and the biological ageing, premature all-cause mortality, and life expectancy of women. Moreover, to perform an accurate evaluation, extensive confounders, including socioeconomic factors, lifestyle factors and biological factors, were adjusted for. This study provides novel insights into the relationships between the number of live births and the biological ageing, premature all-cause mortality, and life expectancy of women for clinical and public health reference for the first time and will be useful for the development of future interventions. Materials and methods Study population A brief overview of the UKB study design is provided below, as the study design and methods have been reported elsewhere in detail previously [ 25 26 n n n Exposure assessment The number of live births is a useful indicator of reproductive history. To determine the number of live births, participants were asked ‘How many children have you given birth to? (Please include live births only)’ in a touch-screen questionnaire completed at baseline (2006–2010). Due to small number of women with the highest parity, we pooled data from women with five or more live births. In accordance with previous studies [ 14 27 28 Ascertainment of premature mortality and biological ageing Death information and the date of death were confirmed by reference to the death certificates held by the NHS Information Centre for participants from England and Wales and the NHS Central Register Scotland for participants from Scotland. The participants were considered to have premature mortality if their deaths occurred at an age younger than 75 years [ 29 30 Biological ageing was measured from different perspectives, including the frailty index (FI), ΔKDM-biological age and homeostatic disorder (HD). The FI, ΔKDM-biological age and HD were previously constructed and validated in the UKB [ 31 32 Covariates We also controlled for a series of confounders in all models, including age (years), race (white, mixed, Asian or Asian British, black or black British, Chinese or other ethnic group), Townsend Deprivation Index (TDI), qualifications (college or university degree, A levels/AS levels or equivalent, O levels/General Certificate of Secondary Education (GCSE) or equivalent, Certificate of Secondary Education (CSE) or equivalent, National Vocational Qualification (NVQ), Higher National Diploma (HND), Higher National Certificate (HNC) or equivalent, other professional qualifications, e.g., nursing, teaching; responses options of none of the above or prefer not to answer), body mass index (BMI), smoking status (never, past and current), alcohol consumption status (never, past and current), metabolic equivalent task (MET) minutes per week for moderate activity (minutes), MET minutes per week for vigorous activity (minutes), summed MET minutes per week for all activities (total MET minutes per week for all activities, including walking, moderate and vigorous activity), histories of diseases (diabetes, hypertension, asthma, emphysema and chronic bronchitis), and female-specific factors (use of oral contraceptive pills, history of stillbirth, spontaneous miscarriage or termination, menarche). The TDI is a composite measure of deprivation based on unemployment, non-car ownership, non-home ownership, and household overcrowding. A greater TDI implies a greater degree of deprivation. Details of the assessment of covariates are described in the Supplementary material. Statistical analysis The baseline characteristics, in terms of demographics, lifestyle factors, health conditions and female-specific factors, are presented as the mean (standard deviation, SD) and number (percentage). General linear models and a chi-square test were used to compare the differences in baseline characteristics according to the number of live births. To examine the associations between the number of live births and ageing-related markers and premature death due to all causes and to provide more information on this issue, we calculated the FI, ΔKDM-biological age (Δ = chronological age minus KDM-biological age) and HD based on previous studies. The participants were divided into six groups based on the number of live births (none, one, two, three, four or 5 or more), and general linear models were generated to determine the differences in the FI, ΔKDM-biological age and HD among the groups, with adjustment for potential covariates. Furthermore, we used women with one live birth as the reference group, and the relationship between the number of live births and premature all-cause death was evaluated using Cox proportional hazards regression (CPH) models. The survival time was reported as months between the baseline UKB survey and the death or census date (1 February 2022). A series of CPH models were developed. Model 1 was a crude model without adjustment for covariates, and the other four CPH models were adjusted for potential covariates, including four aspects—demographic characteristics (Model 2), lifestyle habits (Model 3), disease status at the time of the baseline survey (Model 4), and female-specific factors (Model 5)—to evaluate whether the different covariates influenced the number of live births and the risk of premature all-cause death in women. Additionally, we performed a restricted cubic spline (RCS) analysis to visualize the survival relationship between the number of live births and the risk of premature all-cause death in women after adjustment for these covariates. The covariates in the general linear regression, CPH and RCS models were identified based on previous studies, and a directed acyclic graph was constructed to identify the final covariates. We tested the proportional risk hypothesis using Schoenfeld residual to ensure the validity of the model hypothesis (Supplementary Fig. 2). Furthermore, we plotted a correlation coefficient heatmap between continuous variables and premature mortality (Supplementary Fig. 3) to test the linearity assumption. Details of these are described in the Supplementary material. To test the potential association between the number of live births and the risk of premature all-cause mortality, we evaluated interactions by incorporating multiplicative interaction terms of the number of live births and age, race, BMI, TDI, alcohol drinker status, smoking status, history of diagnosed diabetes, hypertension, asthma, emphysema and chronic bronchitis in the CPH models. If the multiplicative interaction terms were statistically significant, we performed a stratified analysis to provide more detailed information on the associations between these covariates. To transform the results of the CPH models to more direct knowledge of the health impacts of the number of live births on life expectancy, we calculated the life expectancy by the number of live births. Life expectancy is a statistical concept that refers to the average number of years a group or individual is expected to live, based on the current mortality rates at specific ages, within a defined period. This estimation is derived from Life Table, which provide detailed data on age-specific mortality rates. Life expectancy is a comprehensive health indicator that reflects exposures during both acute and life-course stages [ 33 34 37 30 38 𝑗 𝑗 𝑗 𝑗 Several sensitivity analyses were performed. In the first analysis, participants whose follow-up duration was less than 1 or 2 years were excluded to determine whether severe illness affected the results, as the impact of the number of live births on premature death and biological ageing is long term, and shorter follow-up times (less than one or two years) due to serious illnesses could influence the relationships between the number of live births and premature death and biological ageing. The second analysis involved additional adjustments for dietary factors (including fresh fruit intake, dried fruit intake, oily fish intake, salt added to food, cereal intake, processed meat intake, and mineral and other dietary supplements intake) to examine whether dietary factors had an effect on the relationship. The third analysis involved further adjustment for biochemical indicators (including albumin, triglyceride, glucose, low-density lipoprotein (LDL) cholesterol, and total bilirubin levels) to remove the impact of certain biochemical indicators unrelated to reproduction on outcomes. The fourth sensitivity analysis excluded participants under the age of 50 to eliminate the potential impact of women who had not completed childbearing on the study results. The fifth sensitivity analysis excluding women with pregnancy outcomes such as stillbirth, spontaneous abortion, or pregnancy termination, including women with a history of stillbirth, spontaneous abortion or termination of pregnancy, wowen that do not konw and prefer not to answer, in order to investigate whether these pregnancy outcomes could introduce bias into the findings. The sixth sensitivity analysis used participants’ birth dates as the starting time of the study to account for potential confounding effects related to age. However, since birth dates are considered sensitive personal information, the data was not aggregated. Instead, we compiled the participants’ birth year and month to estimate their approximate birth dates. Seventh, to eliminate the potential influence of the reference group selection, we conducted two additional sensitivity analyses, using the groups with 0 Live births and 2 live births as the reference groups, respectively. Since the average total fertility rate (TFR) in the sample was 1.8, we chose the closest value, the mode, which corresponds to participants with two live births, as the reference group for analysis. Additionally, comparing individuals with no childbirth experience to those who have given birth in terms of biological aging, premature mortality, and life expectancy provides valuable insights. Therefore, we also analyzed participants with zero live births as the reference group. All the statistical analyses were conducted with R 4.2.2, and p values < 0.05 were considered to indicate statistical significance. Results Basic characteristics of participants according to the number of live births The basic characteristics of the participants according to the number of live births are shown in Table 1 P P P  Table 1 Baseline characteristics according to number of live births Characteristics number of live births 0 1 2 3 4 ≥ 5 P Age (years) 53.9(8.1) 55.2(8.1) 57.0(7.7) 57.7(7.8) 58.3(7.8) 58.5(8.0) <0.001 Race [N, (%)] <0.001 White 45,057(88.2) 32,490(89.1) 110,292(92.6) 43,833(90.8) 11,237(86.5) 3520(78.2) Non-white 5858(11.5) 3842(10.5) 8616(7.2) 4324(9) 1718(13.2) 958(21.3) Qualifications [N, (%)] <0.001 College or University degree 21,914(42.9) 11,071(30.4) 34,231(28.7) 13,295(27.5) 3171(24.4) 758(16.8) Below College or University degree 23,853(46.7) 18,893(51.8) 62,225(52.2) 24,386(50.5) 6131(47.2) 1911(42.5) None of above 4571(8.9) 5858(16.1) 20,687(17.4) 9689(20.1) 3372(25.9) 1656(36.8) The missing value 750(1.5) 637(1.7) 2018(1.7) 919(1.9) 323(2.5) 175(3.9) Townsend deprivation index −0.8(3.2) −1.1(3.1) −1.8(2.8) −1.4(3.0) −0.6(3.3) 0.8(3.6) <0.001 BMI (kg/m²) [N, (%)] <0.001 <25 kg/m 2 22,611(44.3) 14,472(39.7) 47,446(39.8) 17,748(36.8) 4111(31.6) 1135(25.2) 25–29.9 kg/m 2 16,958(33.2) 13,222(36.3) 45,462(38.2) 18,681(38.7) 4940(38) 1613(35.8) ≥ 30 kg/m 2 11,519(22.5) 8765(24) 26,253(22) 11,860(24.6) 3946(30.4) 1752(38.9) Alcohol drinker status [N, (%)] <0.001 Never 2670(5.2) 1907(5.2) 5930(5) 3251(6.7) 1298(10) 828(18.4) Previous 1890(3.7) 1520(4.2) 3739(3.1) 1818(3.8) 685(5.3) 309(6.9) Current 46,468(91) 32,981(90.5) 109,378(91.8) 43,172(89.4) 10,992(84.6) 3348(74.4) Smoking status [N, (%)] <0.001 Never 31,146(61) 20,010(54.9) 72,244(60.6) 28,413(58.8) 7442(57.3) 2543(56.5) Previous 14,899(29.2) 12,163(54.9) 37,498(31.5) 15,424(31.9) 4114(31.7) 1271(28.2) Current 4916(9.6) 4153(11.4) 8982(7.5) 4252(8.8) 1363(10.5) 656(28.2) MET minutes per week for moderate activity (minutes) [N, (%)] <0.001 Low 15,004(29.4) 10,001(27.4) 29,756(25) 11,433(23.7) 2974(22.9) 1020(22.7) Intermediate 14,057(27.5) 9334(25.6) 30,742(25.8) 12,071(25) 3019(23.2) 967(21.5) High 12,193(23.9) 9101(25.0) 31,025(26.0) 13,185(27.3) 3540(27.2) 1144(25.4) The missing value 9834(19.2) 8023(22.0) 27,638(23.2) 11,600(24.0) 3464(26.7) 1369(30.4) MET minutes per week for vigorous activity (minutes) [N, (%)] Low 14,193(27.8) 9990(27.4) 29,552(24.8) 11,976(24.8) 3289(25.3) 1188(26.4) Intermediate 12,986(25.4) 9100(25.0) 31,270(26.2) 12,538(26.0) 3268(25.1) 1027(22.8) High 14,075(27.6) 9346(25.6) 30,701(25.8) 12,175(25.2) 2976(22.9) 916(20.4) The missing value 9834(19.2) 8023(22.0) 27,638(23.2) 11,600(24.0) 3464(26.7) 1369(30.4) Summed MET minutes per week for all activity (minutes) [N, (%)] <0.001 Low 14,247(27.9) 9947(27.3) 30,065(25.2) 11,728(24.3) 3119(24) 1082(24) Intermediate 14,341(28.1) 9248(25.4) 30,758(25.8) 11,959(24.8) 2949(22.7) 934(20.8) High 12,666(24.8) 9241(25.3) 30,700(25.8) 13,002(26.9) 3465(26.7) 1115(24.8) The missing value 9834(19.2) 8023(22.0) 27,638(23.2) 11,600(24.0) 3464(26.7) 1369(30.4) Current diabetes [N, (%)] 1694(3.3) 1428(3.9) 4006(3.4) 2054(4.3) 756(5.8) 435(9.7) <0.001 Current hypertension [N, (%)] 14,640(28.7) 12,208(33.5) 40,358(33.9) 17,717(36.7) 5459(42.0) 2229(49.5) <0.001 Current asthma [N, (%)] 4619(9.0) 2987(8.2) 9516(8.0) 3901(8.1) 1075(8.3) 375(8.3) <0.001 Current emphysema and chronic bronchitis [N, (%)] 291(0.6) 307(0.8) 757(0.6) 345(0.7) 118(0.9) 60(1.3) <0.001 Use of oral contraceptive pills [N, (%)] 38,114(74.6) 30,573(83.9) 100,106(84.0) 38,605(79.9) 9853(75.8) 3024(67.2) <0.001 History of stillbirth, spontaneous miscarriage or termination [N, (%)] 9950(19.5) 13,083(35.9) 38,370(32.2) 18,079(37.4) 5523(42.5) 2179(48.4) 0.235 Age when periods started (years) 12.9(1.6) 13.0(1.6) 13.0(1.6) 13.0(1.6) 13.1(1.7) 13.2(1.8) <0.001 Continuous variables are presented as mean (SD, standard deviation). Categorical variables are presented as numbers (%, percentage) BMI Association between the number of live births and the risk of all-cause premature mortality The association between the number of live births and the risk of premature all-cause mortality is shown in Table 2 2 3  Table 2 Hazard ratios and 95% confidence intervals for number of live births with the hazard of premature all-cause mortality 0 1 2 3 4 ≥ 5 P for trend Case/N 2206/51,088 1544/36,459 4440/119,161 1951/48,289 600/12,997 251/4500 M1 1.02(0.96,1.09) Ref 0.88(0.83,0.93) 0.95(0.89,1.02) 1.10(0.99,1.20) 1.33(1.17,1.52) 0.628 M2 1.13(1.06,1.21) Ref 0.82(0.78,0.87) 0.86(0.80,0.92) 0.92(0.84,1.01) 1.05(0.91,1.20) <0.001 M3 1.17(1.10,1.25) Ref 0.87(0.82,0.92) 0.88(0.82,0.94) 0.90(0.82,0.99) 0.97(0.84,1.11) <0.001 M4 1.18(1.10,1.26) Ref 0.87(0.83,0.93) 0.88(0.83,0.95) 0.90(0.82,0.99) 0.94(0.82,1.08) <0.001 M5 1.17(1.09,1.25) Ref 0.88(0.83,0.93) 0.88(0.83,0.95) 0.90(0.81,0.99) 0.94(0.82,1.07) <0.001 Data are HRs and 95%CI Model 1 was not adjusted Model 2 was adjusted for age, race, qualifications, Townsend deprivation index (TDI) Model 3 was model 2 with additional adjustments for BMI, alcohol drinker status, smoke status, MET minutes per week for moderate activity, MET minutes per week for vigorous activity, summed MET minutes per week for all activity Model 4 was model 3 with additional adjustments for diabetes, hypertension, asthma, emphysema and chronic bronchitis Model 5 was model 4 with additional adjustments for use of oral contraceptive pills, history of stillbirth, spontaneous miscarriage or termination, age when periods started (menarche) The potential nonlinear association between all-cause premature mortality and the number of Live births was intuitively described using an RCS based on Model 5. We found that both nulliparous women and women with more than five live births had a greater risk of premature mortality, which showed a nonlinear trend for the association between the number of live births and the risk of premature mortality. Similarly, the RCS also showed a U-shaped relationship (P for nonlinearity < 0.001), which further supports the findings of the CPH models, as shown in Supplementary Fig. 4. The nadir for premature all-cause death risk was estimated from the RCS to be two live births, which was significantly lower than one live birth. Additionally, the all-cause premature mortality risk of women with three or four live births was lower than that of women with one live birth. Moreover, women without any live births had a significantly greater risk of premature all-cause death than women with one live birth. Although the data for women with five or more live births were not significant, there was a clear upwards trend in the RCS curve. Additionally, we found a similar relationship between the number of children and premature all-cause mortality among men and among women. Compared with men with one child, men with two, three or four children had lower risks of premature all-cause mortality (HR 2 3 4 0 Sensitivity analyses did not affect the assessment of the relationship between the number of live births and all-cause premature mortality risk (Supplementary Table 2). Similar results were observed after excluding participants with less than 1 and 2 years of follow-up, respectively. To avoid the possible influence of biochemical indicators on the results, we repeated our analyses by adjusting for biochemical indicators. The results barely changed. The results after further adjusting for covariates and dietary factors remained almost the same. Additionally, the sensitivity analysis, which included only women older than 50 years at enrollment, showed no significant change, as shown in Supplementary Table 3. The sensitivity analysis, excluding women with stillbirths, spontaneous miscarriages, or terminations, yielded similar results. Consistent with previous findings, women with zero live births had the highest rate of premature mortality, while those with two or three live births had a lower rate of premature mortality compared to those with one live birth (Supplementary Table 4). Although the confidence interval for women with four live births showed a marginally non-significant association, it still suggested a clear protective trend. In addition, the results of the sensitivity analysis, using participants’ date of birth as the study’s starting time to calculate the number of follow-up years, as presented in the Supplementary Table 5, reveal similar findings. Moreover, we conducted two supplementary sensitivity analyses, using the zero Live births group and the two Live births group as reference groups, respectively. The results indicated that the choice of reference group did not alter the assessment of the relationship between the number of live births and all-cause premature mortality, as detailed in Supplementary Tables 6 and 7. We found that, when using zero live births as the reference group, women with a history of childbirth had a significantly lower risk of all-cause premature mortality, with the lowest risk observed among those who had given live birth twice, a value significantly lower than for those with only one live birth. When using the two live births group as the reference group, both zero and one live birth remained significantly associated with a higher risk of all-cause premature mortality. However, no statistically significant association was found between having more than two live births (including three, four, five or more) and the risk of all-cause premature mortality. This may be because women with more than two live births lose the protective effect against premature mortality observed in those with exactly two live births. Associations between the number of live births and the risk of premature all-cause mortality stratified by potential risk factors We examined whether demographics, lifestyle behaviours and disease status at baseline modified the association between the number of live births and the risk of premature mortality. The P values of the interaction terms between these confounders and the number of live births, age, race, TDI, alcohol consumption status, smoking status, diabetes status, hypertension status, emphysema status and chronic bronchitis status significantly modified this association (P for interaction < 0.05) (Table 3  Table 3 Stratified analyses for association between the number of live births and hazard of premature all-cause mortality number of live births Case/ N 0 1 2 3 4 ≥ 5 P P for inteaction Born year(Age at baseline) ≥ 1980 (<50) 1089/64,391 1.29(1.08,1.54) 1(refrence) 0.77(0.64,0.93) 0.90(0.72,1.12) 1.19(0.87,1.63) 1.08(0.68,1.71) 0.039 <0.001 <1980 (≥ 50) 9903/208,103 1.11(1.04,1.19) 1(refrence) 0.90(0.85,0.96) 0.90(0.84,0.96) 0.89(0.81,0.99) 0.92(0.80,1.06) <0.001 Race White 10,054/246,429 1.14(1.07,1.23) 1(refrence) 0.87(0.82,0.92) 0.86(0.80,0.92) 0.88(0.80,0.98) 1.01(0.88,1.17) <0.001 <0.001 Mixed 370/9582 1.29(0.91,1.85) 1(refrence) 0.72(0.51,1.02) 0.93(0.65,1.32) 0.83(0.54,1.28) 0.62(0.36,1.06) 0.026 Other ethnic group 529/15,735 1.56(1.17,2.08) 1(refrence) 1.10(0.83,1.46) 1.37(1.01,1.87) 1.33(0.87,2.04) 0.62(0.32,1.18) 0.693 Townsend deprivation index < median 4851/136,251 1.12(1.01,1.25) 1(refrence) 0.88(0.81,0.96) 0.90(0.81,0.99) 0.89(0.76,1.04) 0.82(0.60,1.12) <0.001 0.015 ≥median 6141/136,243 1.20(1.11,1.31) 1(refrence) 0.86(0.80,0.93) 0.87(0.80,0.95) 0.90(0.80,1.01) 0.97(0.83,1.13) <0.001 BMI <25 kg/m 2 3719/107,523 1.15(1.03,1.28) 1(refrence) 0.87(0.79,0.96) 0.87(0.77,0.97) 0.92(0.77,1.09) 1.24(0.97,1.58) 0.002 0.767 25–29.9 kg/m 2 3790/99,616 1.25(1.11,1.40) 1(refrence) 0.90(0.81,0.99) 0.94(0.84,1.06) 1.02(0.87,1.20) 0.93(0.72,1.20) 0.009 ≥ 30 kg/m 2 3326/64,095 1.13(0.99,1.27) 1(refrence) 0.88(0.79,0.98) 0.86(0.77,0.97) 0.82(0.69,0.96) 0.83(0.67,1.04) <0.001 Alcohol drinker status Never 807/15,884 1.14(0.89,1.46) 1(refrence) 0.79(0.64,0.99) 0.76(0.60,0.97) 0.69(0.50,0.95) 0.73(0.51,1.06) <0.001 <0.001 Previous 783/9961 1.13(0.90,1.41) 1(refrence) 0.76(0.62,0.94) 0.75(0.59,0.95) 0.61(0.44,0.85) 0.78(0.53,1.15) <0.001 Current 9380/246,339 1.18(1.10,1.27) 1(refrence) 0.90(0.84,0.96) 0.91(0.85,0.98) 0.97(0.87,1.08) 1.01(0.86,1.18) <0.001 Smoking status Never 5136/161,798 1.21(1.10,1.34) 1(refrence) 0.89(0.81,0.97) 0.88(0.79,0.97) 0.88(0.76,1.02) 0.86(0.69,1.08) <0.001 <0.001 Previous 3753/85,369 1.14(1.02,1.27) 1(refrence) 0.89(0.81,0.98) 0.86(0.77,0.96) 0.92(0.79,1.08) 0.94(0.74,1.20) <0.001 Current 2026/24,322 1.15(0.99,1.33) 1(refrence) 0.82(0.72,0.94) 0.93(0.80,1.07) 0.88(0.71,1.07) 1.05(0.82,1.34) 0.062 Diabetes Yes 963/10,373 1.10(0.89,1.36) 1(refrence) 0.72(0.59,0.87) 0.71(0.57,0.87) 0.67(0.50,0.89) 0.76(0.54,1.08) <0.001 <0.001 No 9997/261,492 1.18(1.10,1.27) 1(refrence) 0.90(0.84,0.95) 0.91(0.84,0.97) 0.93(0.84,1.03) 0.98(0.84,1.13) <0.001 Hypertension Yes 3098/58,498 1.16(1.03,1.32) 1(refrence) 0.88(0.79,0.99) 0.89(0.79,1.01) 0.87(0.73,1.04) 0.90(0.70,1.15) 0.001 0.016 No 7894/213,996 1.17(1.08,1.27) 1(refrence) 0.87(0.82,0.94) 0.88(0.81,0.95) 0.91(0.81,1.02) 0.95(0.81,1.11) <0.001 Asthma Yes 777/22,473 1.25(0.97,1.61) 1(refrence) 0.94(0.75,1.18) 0.92(0.71,1.20) 0.95(0.67,1.36) 1.12(0.70,1.80) 0.232 0.711 No 10,215/250,021 1.16(1.08,1.24) 1(refrence) 0.87(0.82,0.93) 0.88(0.82,0.94) 0.89(0.81,0.98) 0.92(0.80,1.06) <0.001 Emphysema and chronic bronchitis Yes 242/1878 0.89(0.57,1.39) 1(refrence) 0.65(0.45,0.94) 0.81(0.54,1.23) 0.71(0.41,1.25) 0.50(0.24,1.03) 0.047 <0.001 No 10,750/270,616 1.17(1.10,1.26) 1(refrence) 0.88(0.83,0.93) 0.89(0.83,0.95) 0.90(0.82,0.99) 0.95(0.83,1.09) <0.001 Results were adjusted for age, race, qualifications, Townsend deprivation index (TDI), BMI, alcohol drinker status, smoke status, MET minutes per week for moderate activity, MET minutes per week for vigorous activity, summed MET minutes per week for all activity; history of diabetes, hypertension, asthma, emphysema and chronic bronchitis, use of oral contraceptive pills, history of stillbirth, spontaneous miscarriage or termination, age when periods started (menarche) at baseline. Association between the number of live births and the risk of premature cause-specific mortality The results of the multivariable CPH regression models of the association between the number of Live births and the risk of premature cause-specific mortality are presented in Supplementary Table 8. We documented the total number of cases of premature mortality from CVD ( n n 2 3 4 2 3 3 0 4 3 5 Association between the number of live births and estimated life expectancy We estimated a lower or higher life expectancy (years) due to the different parities, as shown in Fig. 1  Fig. 1 The estimated difference of cumulative survival time (years) from 40 years of age onward among women with distinct number of live births relative to the reference group. The “Higher” indicator on the upper axis corresponds to increased life expectancy in women with varying live birth parity relative to the reference group, whereas the “Lower” annotation on the lower axis signifies reduced life expectancy in these parity-specific cohorts Association between the number of live births and biological ageing The estimated values of the FI, ΔKDM-biological age and HD for each live birth group after multiple covariate corrections calculated using a general linear model are presented in a box plot in Fig. 2 for trend  Fig. 2 Frailty index, △KDM-biological age, homeostatic disorder (HD) adjusted for multiple covariates. Adjusted covariates included age, race, qualifications, Townsend deprivation index (TDI), BMI, alcohol drinker status, smoke status, MET minutes per week for moderate activity, MET minutes per week for vigorous activity, summed MET minutes per week for all activity; history of diabetes, hypertension, asthma, emphysema and chronic bronchitis, use of oral contraceptive pills, history of stillbirth, spontaneous miscarriage or termination, age when periods started (menarche) at baseline Discussion In this prospective study of 272,494 participants from the UKB, we found that compared with women who had only one live birth, women who had no live births were associated with a greater risk of premature all-cause mortality and a lower life expectancy, whereas those with two, three, or four live births were associated with a lower risk of premature all-cause mortality and a greater life expectancy. These associations were independent of biological factors, lifestyle habits, socioeconomic status, and preexisting diseases. Similarly, this study revealed a relationship between the number of live births and premature all-cause mortality via sensitivity analyses, demonstrating the robustness of the results. Moreover, compared with those of women with one live birth, the estimated values of the FI, ΔKDM-biological age and HD adjusted for multiple covariates in women with two or three live births were lower, and the corresponding values in women with five or more live births were greater. Our results on premature mortality are consistent with results reported in Sweden [ 14 17 The findings of the subgroup analyses suggested that the association between the number of live births and the risk of all-cause premature mortality differed among different races, which may be attributed to the relatively small sample sizes of the mixed group and other ethnic groups. In addition to genetic factors influencing racial differences in different countries, socioeconomic-environmental factors also play an important role in these differences. Studies have shown that there are racial differences in fertility patterns [ 39 40 41 39 40 41 42 43 42 43 In addition, our study provides novel evidence of the relationship between the number of live births and mortality risk. Our results on premature cause-specific mortality indicate that the risk of premature all-cause mortality associated with a greater number of live births could be partly attributed to premature CVD-specific and cancer-specific mortality. These observations are consistent with previous evidence linking the number of live births with various conditions, including CVDs [ 44 45 46 47 48 49 50 51 53 53 54 55 1 2 For the first time, we reported that women who had no Live births were more Likely to have a 1.40-year lower Life expectancy at age 40 years (95% CI: 0.77–2.00), and women with two, three or four Live births had a 1.13- (95% CI: 0.64–1.64), 1.13- (95% CI: 0.45–1.64), and 0.93-year (95% CI: 0.09–1.85) higher life expectancy, respectively, than participants with one live birth. Moreover, we found that accelerated biological ageing and functional decline were potential influencing factors, as the estimated values of the FI, ΔKDM-biological age and HD after adjustment for multiple covariates exhibited significant changes. Our research is similar to the changes in HD caused by the number of live births in previous articles, giving rise to a U-shaped overall relationship between the number of live births and biological ageing [ 56 57 58 45 59 60 61 3 62 64 65 65 19 The present findings may have several public health implications. First, the evidence is complementary to that on the association between the number of live births and all-cause mortality and fills the gap in the understanding of the relationships between the number of live births and all-cause premature mortality, life expectancy, and biological aging. Second, the evidence provides a better understanding of the number of live births needed to maximize women’s health benefits. The number of live births is easily assessed in clinical and public settings, and recommendations on behavioural changes regarding pregnancy or contraception for women in need are provided. Our findings could help guide and improve the development of strategies and practices for women’s health. Although our study has several advantages, including a large sample size, extensive covariate adjustment, and consistent results in several sensitivity and subgroup analyses, several potential limitations should be carefully considered. First, we cannot exclude the possibility that a high number of live births is a marker for a lower socioeconomic level. However, subgroup analyses indicated that the positive association between the number of live births and the risk of mortality was consistent across the socioeconomic subgroup groups. Second, in this study, we determined the number of live births by asking “How many children have you given birth to? (Please include live births only)”. Because this question did not include the number of stillbirths, spontaneous miscarriages or terminations that women may have had, we could not obtain specific data associated with these situations. As described earlier, if the number of live births affects long-term health conditions, the number of stillbirths, spontaneous miscarriages or terminations will also be an important source of information. Further studies including these basic facts are needed to investigate the effects of the number of stillbirths, spontaneous miscarriages or terminations on long-term health. Third, although we controlled for many socioeconomic factors and lifestyle factors, we lacked explicit information on marital status, age at first birth, attitudes and values, and early life circumstances that may be associated with both fertility and health. Therefore, we could not exclude single women and those who never experienced pregnancy. These unadjusted covariates may affect the relationship between the number of live births and premature all-cause death. Fourth, our study was only performed in the UK population, and these results may not be generalizable to populations in other regions [ 25 Conclusions In conclusion, our study revealed relationships between the number of live births and the risk of premature all-cause mortality, life expectancy, and biological ageing in women. Smoking and alcohol consumption may affect the association between the number of live births and premature all-cause mortality. Further clinical trials are warranted to validate these findings. Supplementary Information  Supplementary Fig. 1: Flow chart of study population. Supplementary Fig. 2: Schoenfeld Residual Distribution of Live Births for Proportional Hazards Assumption Test. The x-axis represents time, and the y-axis represents the Schoenfeld residuals. The residual points are stratified and clustered around fixed values (such as −2, −1, 0, etc.) without a clear time trend, indicating that the risk effect of the number of live births remains stable over time, thus fulfilling the proportional hazards assumption and confirming the reliability of the model’s foundation. Supplementary Fig. 3: Correlation Coefficient Heatmap of Continuous Variables and Premature Mortality Risk. A heatmap was generated to visualize the linear correlation coefficients among three variables: number of live births, menarche, and premature mortality. The red squares on the diagonal (with a correlation coefficient of 1) represent the mathematical inevitability of self-correlation for each variable. The off-diagonal blue regions (with correlation coefficients approaching 0) indicate no significant linear association among the number of live births, age at menarche, and premature mortality. Supplementary Fig. 4: RCS analysis of the relationship between the number of live births and premature all-cause mortality. The model was adjusted for age, race, qualifications, Townsend deprivation index (TDI), BMI, alcohol drinker status, smoke status, MET minutes per week for moderate activity, MET minutes per week for vigorous activity, summed MET minutes per week for all activity; history of diabetes, hypertension, asthma, emphysema and chronic bronchitis, use of oral contraceptive pills, history of stillbirth, spontaneous miscarriage or termination, age when periods started (menarche) at baseline. Abbreviations HR Hazard ratio CI Confidence interval SD Standard deviation BMI Body mass index FI Frailty index HD Homeostatic disorder CVD Cardiovascular disease CHD Coronary heart disease MET Metabolic Equivalent Task RCS Restricted cubic spline ICD International classification of disease Publisher’s Note Springer Nature remains neutral with regard to jurisdictional claims in published maps and institutional affiliations. Huanyu Guo and Yuqing Liu are contributed equally. Acknowledgements This research has been conducted using the UK Biobank Resource (applicationID:103547). We thank the participants in the UK Biological Sample Library and UKB’s research team for their generous contributions to creating an important research resource. All authors have read and approved the final version of the manuscript. Clinical trial number Not Applicable Authors’ contributions D.Z. had full access to all the data in the study and takes responsibility for the integrity of the data and the accuracy of the data analysis. D.Z. and W.W. conceived and designed the experiment. H.G. performed the analysis with assistance and guidance from Y.L. and X.L., R.Y. contributed to data quality control of UKB data. H.G. and W.W. wrote the manuscript with the participation of all authors. Y.T. contributed significantly to manuscript preparation, particularly in sentence translation and grammar correction. All authors provided critical revisions of the draft and approved the submitted draft. Funding This work was supported by National Natural Science Foundation of China [62102121 to D.Z.] and Outstanding Youth Fund of the First Affiliated Hospital of Harbin Medical University [2024JQ01 to D.Z.]. Data availability The datasets used and/or analysed during the current study are available from the corresponding author on reasonable request. Declarations Ethics approval and consent to participate All procedures followed were in accordance with the ethical standards of the responsible committee on human experimentation (institutional and national) and with the Helsinki Declaration of 1975, as revised in 2008 (5). This research has been conducted using the UK Biobank Resource. The UK biobank has approval from the North West Multi-centre Research Ethics Committee (MREC) as a Research Tissue Bank (RTB) approval (application ID:103547), and all participants agreed and provided written informed consent. Consent for publication Not Applicable. Competing interests The authors declare no competing interests. References 1. Russo J Mailo D Hu YF Balogh G Sheriff F Russo IH Breast differentiation and its implication in cancer prevention Clin Cancer Res 2005 11 931s 6s 10.1158/1078-0432.931s.11.2 15701889 Russo J, Mailo D, Hu YF, Balogh G, Sheriff F, Russo IH. Breast differentiation and its implication in cancer prevention. Clin Cancer Res. 2005;11:931s–6s. 15701889 2. Kelsey JL Gammon MD John EM Reproductive factors and breast cancer Epidemiol Rev 1993 15 1 36 47 10.1093/oxfordjournals.epirev.a036115 8405211 Kelsey JL, Gammon MD, John EM. Reproductive factors and breast cancer. Epidemiol Rev. 1993;15(1):36–47. 10.1093/oxfordjournals.epirev.a036115. 8405211 10.1093/oxfordjournals.epirev.a036115 3. Kirkwood TB Rose MR Evolution of senescence: late survival sacrificed for reproduction Philos Trans R Soc Lond B Biol Sci 1991 332 1262 15 24 10.1098/rstb.1991.0028 1677205 Kirkwood TB, Rose MR. Evolution of senescence: late survival sacrificed for reproduction. Philos Trans R Soc Lond B Biol Sci. 1991;332(1262):15–24. 1677205 10.1098/rstb.1991.0028 4. Dziechciaż M Filip R Biological psychological and social determinants of old age: bio-psycho-social aspects of human aging Ann Agric Environ Med 2014 21 4 835 8 10.5604/12321966.1129943 25528930 Dziechciaż M, Filip R. Biological psychological and social determinants of old age: bio-psycho-social aspects of human aging. Ann Agric Environ Med. 2014;21(4):835–8. 10.5604/12321966.1129943. 25528930 10.5604/12321966.1129943 5. Pyo IS Yun S Yoon YE Choi JW Lee SJ Mechanisms of aging and the preventive effects of Resveratrol on age-related diseases Molecules 2020 25 20 4649 10.3390/molecules25204649 33053864 PMC7587336 Pyo IS, Yun S, Yoon YE, Choi JW, Lee SJ. Mechanisms of aging and the preventive effects of Resveratrol on age-related diseases. Molecules. 2020;25(20):4649. 10.3390/molecules25204649. ( PMID: 33053864; PMCID: PMC7587336 33053864 10.3390/molecules25204649 PMC7587336 6. Finkel T Serrano M Blasco MA The common biology of cancer and ageing Nature 2007 448 7155 767 74 10.1038/nature05985 17700693 Finkel T, Serrano M, Blasco MA. The common biology of cancer and ageing. Nature. 2007;448(7155):767–74. 10.1038/nature05985. 17700693 10.1038/nature05985 7. Samani NJ van der Harst P Biological ageing and cardiovascular disease Heart 2008 94 5 537 9 10.1136/hrt.2007.136010 18411343 Samani NJ, van der Harst P. Biological ageing and cardiovascular disease. Heart. 2008;94(5):537–9. 10.1136/hrt.2007.136010. 18411343 10.1136/hrt.2007.136010 8. Wyss-Coray T Ageing, neurodegeneration and brain rejuvenation Nature 2016 539 7628 180 6 10.1038/nature20411 27830812 PMC5172605 Wyss-Coray T. Ageing, neurodegeneration and brain rejuvenation. Nature. 2016;539(7628):180–6. 10.1038/nature20411. PMID: 27830812; PMCID: PMC5172605. 27830812 10.1038/nature20411 PMC5172605 9. Bray F Laversanne M Weiderpass E Soerjomataram I The ever-increasing importance of cancer as a leading cause of premature death worldwide Cancer 2021 127 16 3029 3030 10.1002/cncr.33587 34086348 Bray F, Laversanne M, Weiderpass E, Soerjomataram I. The ever-increasing importance of cancer as a leading cause of premature death worldwide. Cancer. 2021;127(16):3029–30. 10.1002/cncr.33587. 34086348 10.1002/cncr.33587 10. Kojima G Ogawa K Iliffe S Taniguchi Y Walters K Number of pregnancies and trajectory of frailty index: english longitudinal study of ageing J Am Med Dir Assoc 2020 21 9 1249 e12531 10.1016/j.jamda.2020.04.010 32522494 Kojima G, Ogawa K, Iliffe S, Taniguchi Y, Walters K. Number of pregnancies and trajectory of frailty index: english longitudinal study of ageing. J Am Med Dir Assoc. 2020;21(9):1249-e12531. 32522494 10.1016/j.jamda.2020.04.010 11. Roos E Burstrom B Saastamoinen P Lahelma E A comparative study of the patterning of women’s health by family status and employment status in Finland and Sweden Soc Sci Med 2005 60 11 2443 51 10.1016/j.socscimed.2004.11.020 15814170 Roos E, Burstrom B, Saastamoinen P, Lahelma E. A comparative study of the patterning of women’s health by family status and employment status in Finland and Sweden. Soc Sci Med. 2005;60(11):2443–51. 15814170 10.1016/j.socscimed.2004.11.020 12. Lockhart PA Martin P Johnson MA Shirtcliff E Poon LW The Relationship of Fertility, Lifestyle, and Longevity Among Women J Gerontol A Biol Sci Med Sci. 2017 72 6 754 759 27519884 10.1093/gerona/glw158 Lockhart PA, Martin P, Johnson MA, Shirtcliff E, Poon LW. The Relationship of Fertility, Lifestyle, and Longevity Among Women. J Gerontol A Biol Sci Med Sci. 2017;72(6):754–9. 27519884 10.1093/gerona/glw158 13. Hurt LS Ronsmans C Thomas SL The effect of number of births on women’s mortality: systematic review of the evidence for women who have completed their childbearing Popul Stud Camb 2006 60 55 71 10.1080/00324720500436011 16464775 Hurt LS, Ronsmans C, Thomas SL. The effect of number of births on women’s mortality: systematic review of the evidence for women who have completed their childbearing. Popul Stud Camb. 2006;60:55–71. 16464775 10.1080/00324720500436011 14. Barclay K Keenan K Grundy E Kolk M Myrskylä M Reproductive history and post-reproductive mortality: a sibling comparison analysis using Swedish register data Soc Sci Med 2016 155 82 92 10.1016/j.socscimed.2016.02.043 26994961 Barclay K, Keenan K, Grundy E, Kolk M, Myrskylä M. Reproductive history and post-reproductive mortality: a sibling comparison analysis using Swedish register data. Soc Sci Med. 2016;155:82–92. 10.1016/j.socscimed.2016.02.043. 26994961 10.1016/j.socscimed.2016.02.043 15. Grundy E Tomassini C Fertility history and health in later life: a record linkage study in England and Wales Soc Sci Med 2005 61 1 217 28 10.1016/j.socscimed.2004.11.046 15847974 Grundy E, Tomassini C. Fertility history and health in later life: a record linkage study in England and Wales. Soc Sci Med. 2005;61(1):217–28. 15847974 10.1016/j.socscimed.2004.11.046 16. Jacobs MB Kritz-Silverstein D Wingard DL Barrett-Connor E The association of reproductive history with all-cause and cardiovascular mortality in older women: the rancho Bernardo study Fertil Steril 2012 97 1 118 24 10.1016/j.fertnstert.2011.10.028 22130321 PMC3245788 Jacobs MB, Kritz-Silverstein D, Wingard DL, Barrett-Connor E. The association of reproductive history with all-cause and cardiovascular mortality in older women: the rancho Bernardo study. Fertil Steril. 2012;97(1):118–24. 10.1016/j.fertnstert.2011.10.028. 22130321 10.1016/j.fertnstert.2011.10.028 PMC3245788 17. Grundy E Kravdal O Reproductive history and mortality in late middle age among Norwegian men and women Am J Epidemiol 2008 167 3 271 9 10.1093/aje/kwm295 18000019 Grundy E, Kravdal O. Reproductive history and mortality in late middle age among Norwegian men and women. Am J Epidemiol. 2008;167(3):271–9. [PubMed: 18000019]. 18000019 10.1093/aje/kwm295 18. Kravdal Ø Relationship between childbearing and cancer incidence due to biology or lifestyle? Examples of the importance of using data on men Int J Epidemiol 1996 24 477 84 10.1093/ije/24.3.477 7672885 Kravdal Ø. Relationship between childbearing and cancer incidence due to biology or lifestyle? Examples of the importance of using data on men. Int J Epidemiol. 1996;24:477–84. 10.1093/ije/24.3.477 7672885 19. Knoester C Eggebeen DJ The effects of the transition to parenthood and subsequent children on men’s well-being and social participation J Fam Issues 2006 27 1532 60 10.1177/0192513X06290802 Knoester C, Eggebeen DJ. The effects of the transition to parenthood and subsequent children on men’s well-being and social participation. J Fam Issues. 2006;27:1532–60. 20. Lund E Arnesen E Borgan JK Pattern of childbearing and mortality in married women–a national prospective study from Norway J Epidemiol Community Health 1990 44 3 237 40 10.1136/jech.44.3.237 2273363 PMC1060649 Lund E, Arnesen E, Borgan JK. Pattern of childbearing and mortality in married women–a national prospective study from Norway. J Epidemiol Community Health. 1990;44(3):237–40. 2273363 10.1136/jech.44.3.237 PMC1060649 21. Serbin LA Karp J The intergenerational transfer of psychosocial risk: mediators of vulnerability and resilience Annu Rev Psychol 2004 55 333 63 10.1146/annurev.psych.54.101601.145228 14744219 Serbin LA, Karp J. The intergenerational transfer of psychosocial risk: mediators of vulnerability and resilience. Annu Rev Psychol. 2004;55:333–63. 14744219 10.1146/annurev.psych.54.101601.145228 22. Mastekaasa A Parenthood, gender and sickness absence Soc Sci Med 2000 50 1827 42 10.1016/S0277-9536(99)00420-7 10798335 Mastekaasa A. Parenthood, gender and sickness absence. Soc Sci Med. 2000;50:1827–42. 10798335 10.1016/s0277-9536(99)00420-7 23. D’Elio M Ness R Matthews K Are life stress and social support related to parity in women? Behav Med 1997 23 87 94 10.1080/08964289709596732 9309348 D’Elio M, Ness R, Matthews K, et al. Are life stress and social support related to parity in women? Behav Med. 1997;23:87–94. 9309348 10.1080/08964289709596732 24. Evenson RJ Simon RW Clarifying the relationship between parenthood and depression J Health Soc Behav 2005 46 341 58 10.1177/002214650504600403 16433280 Evenson RJ, Simon RW. Clarifying the relationship between parenthood and depression. J Health Soc Behav. 2005;46:341–58. 16433280 10.1177/002214650504600403 25. Sudlow C Gallacher J Allen N Beral V Burton P Danesh J Downey P Elliott P Green J Landray M Liu B Matthews P Ong G Pell J Silman A Young A Sprosen T Peakman T Collins R UK biobank: an open access resource for identifying the causes of a wide range of complex diseases of middle and old age PLoS Med 2015 12 3 e1001779 10.1371/journal.pmed.1001779 25826379 PMC4380465 Sudlow C, Gallacher J, Allen N, Beral V, Burton P, Danesh J, Downey P, Elliott P, Green J, Landray M, Liu B, Matthews P, Ong G, Pell J, Silman A, Young A, Sprosen T, Peakman T, Collins R. UK biobank: an open access resource for identifying the causes of a wide range of complex diseases of middle and old age. PLoS Med. 2015;12(3):e1001779. 10.1371/journal.pmed.1001779. PMID: 25826379; PMCID: PMC4380465. 25826379 10.1371/journal.pmed.1001779 PMC4380465 26. Batty GD Gale CR KivimÃ¤ki M Deary IJ Bell S Comparison of risk factor associations in UK Biobank against representative, general population based studies with conventional response rates: prospective cohort study and individual participant meta-analysis BMJ 2020 368 m131 10.1136/bmj.m131 32051121 PMC7190071 Batty GD, Gale CR, KivimÃ¤ki M, Deary IJ, Bell S. Comparison of risk factor associations in UK Biobank against representative, general population based studies with conventional response rates: prospective cohort study and individual participant meta-analysis. BMJ. 2020;368:m131. 32051121 10.1136/bmj.m131 PMC7190071 27. Bai Y Wang X Yang Y Tang Y Wang J Han P Parity and bladder cancer risk: a dose-response meta-analysis BMC Cancer 2017 17 1 31 10.1186/s12885-016-3023-5 28061845 PMC5219774 Bai Y, Wang X, Yang Y, Tang Y, Wang J, Han P. Parity and bladder cancer risk: a dose-response meta-analysis. BMC Cancer. 2017;17(1):31. 10.1186/s12885-016-3023-5. PMID: 28061845; PMCID: PMC5219774. 28061845 10.1186/s12885-016-3023-5 PMC5219774 28. Halland F Morken NH DeRoo LA Klungsøyr K Wilcox AJ Skjærven R Association of women’s reproductive history with Long-term mortality and effect of socioeconomic factors Obstet Gynecol 2015 126 6 1181 7 10.1097/AOG.0000000000001155 26551179 PMC5706764 Halland F, Morken NH, DeRoo LA, Klungsøyr K, Wilcox AJ, Skjærven R. Association of women’s reproductive history with Long-term mortality and effect of socioeconomic factors. Obstet Gynecol. 2015;126(6):1181–7. PMID: 26551179; PMCID: PMC5706764. 26551179 10.1097/AOG.0000000000001155 PMC5706764 29. Lewer D Jayatunga W Aldridge RW Edge C Marmot M Story A Hayward A Premature mortality attributable to socioeconomic inequality in England between 2003 and 2018: an observational study Lancet Public Health 2020 5 1 e33 e41 10.1016/S2468-2667(19)30219-1 31813773 PMC7098478 Lewer D, Jayatunga W, Aldridge RW, Edge C, Marmot M, Story A, Hayward A. Premature mortality attributable to socioeconomic inequality in England between 2003 and 2018: an observational study. Lancet Public Health. 2020;5(1):e33–41. 10.1016/S2468-2667(19)30219-1. 31813773 10.1016/S2468-2667(19)30219-1 PMC7098478 30. Ma H Xue Q Wang X Adding salt to foods and hazard of premature mortality Eur Heart J 2022 43 30 2878 88 10.1093/eurheartj/ehac208 35808995 PMC9890626 Ma H, Xue Q, Wang X, et al. Adding salt to foods and hazard of premature mortality. Eur Heart J. 2022;43(30):2878–88. 10.1093/eurheartj/ehac208. 35808995 10.1093/eurheartj/ehac208 PMC9890626 31. Williams DM Jylhävä J Pedersen NL A frailty index for UK biobank participants J Gerontol A Biol Sci Med Sci 2019 74 582 7 10.1093/gerona/gly094 29924297 PMC6417451 Williams DM, Jylhävä J, Pedersen NL, et al. A frailty index for UK biobank participants. J Gerontol A Biol Sci Med Sci. 2019;74:582–7. 29924297 10.1093/gerona/gly094 PMC6417451 32. Levine ME Modeling the rate of senescence: can estimated biological age predict mortality more accurately than chronological age? J Gerontol A Biol Sci Med Sci 2013 68 6 667 74 10.1093/gerona/gls233 23213031 PMC3660119 Levine ME. Modeling the rate of senescence: can estimated biological age predict mortality more accurately than chronological age? J Gerontol A Biol Sci Med Sci. 2013;68(6):667–74. 10.1093/gerona/gls233. 23213031 10.1093/gerona/gls233 PMC3660119 33. Karlsson O Chang AY Norheim OF Mao W Bolongaita S Jamison DT Priority health conditions and global life expectancy disparities JAMA Netw Open 2025 8 5 e2512198 10.1001/jamanetworkopen.2025.12198 40408105 PMC12102710 Karlsson O, Chang AY, Norheim OF, Mao W, Bolongaita S, Jamison DT. Priority health conditions and global life expectancy disparities. JAMA Netw Open. 2025;8(5):e2512198. 10.1001/jamanetworkopen.2025.12198. PMID: 40408105; PMCID: PMC12102710. 40408105 10.1001/jamanetworkopen.2025.12198 PMC12102710 34. Arias E United States life tables, 2008 Natl Vital Stat Rep 2012 61 3 1 63 24974590 Arias E. United States life tables, 2008. Natl Vital Stat Rep. 2012;61(3):1–63. 24974590 35. Chiang CL World Health Organization Life table and mortality analysis 1979 Publisher Geneva: World Health Organization Chiang CL, World Health Organization. Life table and mortality analysis. Publisher: Geneva: World Health Organization; 1979. 36. Li Y Pan A Wang DD Liu X Dhana K Franco OH Kaptoge S Di Angelantonio E Stampfer M Willett WC Hu FB Impact of healthy lifestyle factors on life expectancies in the US population Circulation 2018 138 4 345 355 10.1161/CIRCULATIONAHA.117.032047 29712712 PMC6207481 Li Y, Pan A, Wang DD, Liu X, Dhana K, Franco OH, Kaptoge S, Di Angelantonio E, Stampfer M, Willett WC, Hu FB. Impact of healthy lifestyle factors on life expectancies in the US population. Circulation. 2018;138(4):345–55. 10.1161/CIRCULATIONAHA.117.032047. 29712712 10.1161/CIRCULATIONAHA.117.032047 PMC6207481 37. Woloshin S Schwartz LM Welch HG The risk of death by age, sex, and smoking status in the united states: putting health risks in context J Natl Cancer Inst 2008 100 12 845 53 10.1093/jnci/djn124 18544745 PMC3298961 Woloshin S, Schwartz LM, Welch HG. The risk of death by age, sex, and smoking status in the united states: putting health risks in context. J Natl Cancer Inst. 2008;100(12):845–53. 18544745 10.1093/jnci/djn124 PMC3298961 38. Li Y Schoufour J Wang DD Dhana K Pan A Liu X Song M Liu G Shin HJ Sun Q Al-Shaar L Wang M Rimm EB Hertzmark E Stampfer MJ Willett WC Franco OH Hu FB Healthy lifestyle and life expectancy free of cancer, cardiovascular disease, and type 2 diabetes: prospective cohort study BMJ 2020 368 l6669 10.1136/bmj.l6669 31915124 PMC7190036 Li Y, Schoufour J, Wang DD, Dhana K, Pan A, Liu X, Song M, Liu G, Shin HJ, Sun Q, Al-Shaar L, Wang M, Rimm EB, Hertzmark E, Stampfer MJ, Willett WC, Franco OH, Hu FB. Healthy lifestyle and life expectancy free of cancer, cardiovascular disease, and type 2 diabetes: prospective cohort study. BMJ. 2020;368:l6669. 10.1136/bmj.l6669. PMID: 31915124; PMCID: PMC7190036. 31915124 10.1136/bmj.l6669 PMC7190036 39. Zang E Sariego C Krishnan A The interplay of race/ethnicity and education in fertility patterns Popul Stud 2022 76 3 363 85 10.1080/00324728.2022.2130965 PMC9613612 36256449 Zang E, Sariego C, Krishnan A. The interplay of race/ethnicity and education in fertility patterns. Popul Stud. 2022;76(3):363–85. 10.1080/00324728.2022.2130965. 10.1080/00324728.2022.2130965 PMC9613612 36256449 40. Maher JY Pal L Illuzzi JL Achong N Lundsberg LS Racial and ethnic differences in reproductive knowledge and awareness among women in the united States F S Rep 2022 3 2 Suppl 46 54 35937452 10.1016/j.xfre.2022.03.006 PMC9349232 Maher JY, Pal L, Illuzzi JL, Achong N, Lundsberg LS. Racial and ethnic differences in reproductive knowledge and awareness among women in the united States. F S Rep. 2022;3(2 Suppl):46–54. PMID: 35937452; PMCID: PMC9349232. 35937452 10.1016/j.xfre.2022.03.006 PMC9349232 41. Bundy JD Mills KT He H LaVeist TA Ferdinand KC Chen J He J Social determinants of health and premature death among adults in the USA from 1999 to 2018: a National cohort study Lancet Public Health 2023 8 6 e422 31 10.1016/S2468-2667(23)00081-6 37244672 PMC10349537 Bundy JD, Mills KT, He H, LaVeist TA, Ferdinand KC, Chen J, He J. Social determinants of health and premature death among adults in the USA from 1999 to 2018: a National cohort study. Lancet Public Health. 2023;8(6):e422–31. 10.1016/S2468-2667(23)00081-6. PMID: 37244672; PMCID: PMC10349537. 37244672 10.1016/S2468-2667(23)00081-6 PMC10349537 42. Mackenbach JP Damhuis RA Been JV De gezondheidseffecten Van Roken [The effects of smoking on health: growth of knowledge reveals even grimmer picture] Ned Tijdschr Geneeskd 2017 160 D869 28098043 Mackenbach JP, Damhuis RA, Been JV. De gezondheidseffecten Van Roken [The effects of smoking on health: growth of knowledge reveals even grimmer picture]. Ned Tijdschr Geneeskd. 2017;160:D869. Dutch. PMID: 28098043. 28098043 43. Meza V Arnold J Díaz LA Ayala Valverde M Idalsoaga F Ayares G Devuni D Arab JP Alcohol consumption: medical implications, the liver and beyond Alcohol Alcohol 2022 57 3 283 291 10.1093/alcalc/agac013 35333295 Meza V, Arnold J, Díaz LA, Ayala Valverde M, Idalsoaga F, Ayares G, Devuni D, Arab JP. Alcohol consumption: medical implications, the liver and beyond. Alcohol Alcohol. 2022;57(3):283–91. 10.1093/alcalc/agac013. 35333295 10.1093/alcalc/agac013 44. Chen SX Rasmussen KM Finkelstein J Støvring H Nøhr EA Kirkegaard H Maternal reproductive history and premenopausal risk of hypertension and cardiovascular disease: a Danish cohort study BMJ Open 2019 9 11 e030702 10.1136/bmjopen-2019-030702 31690605 PMC6858240 Chen SX, Rasmussen KM, Finkelstein J, Støvring H, Nøhr EA, Kirkegaard H. Maternal reproductive history and premenopausal risk of hypertension and cardiovascular disease: a Danish cohort study. BMJ Open. 2019;9(11):e030702. 10.1136/bmjopen-2019-030702. PMID: 31690605; PMCID: PMC6858240. 31690605 10.1136/bmjopen-2019-030702 PMC6858240 45. Moazzeni SS Asgari S Azizi F Hadaegh F Live birth/parity number and the risk of incident hypertension among parous women during over 13 years of follow-up J Clin Hypertens 2021 23 11 2000 8 10.1111/jch.14369 PMC8630610 34657376 Moazzeni SS, Asgari S, Azizi F, Hadaegh F. Live birth/parity number and the risk of incident hypertension among parous women during over 13 years of follow-up. J Clin Hypertens. 2021;23(11):2000–8. 10.1111/jch.14369 PMC8630610 34657376 46. Merritt MA Riboli E Murphy N Reproductive factors and risk of mortality in the European prospective investigation into cancer and nutrition; a cohort study BMC Med 2015 13 252 10.1186/s12916-015-0484-3 26515238 PMC4627614 Merritt MA, Riboli E, Murphy N, et al. Reproductive factors and risk of mortality in the European prospective investigation into cancer and nutrition; a cohort study. BMC Med. 2015;13:252. 26515238 10.1186/s12916-015-0484-3 PMC4627614 47. Moazzeni SS Toreyhi H Asgari S Azizi F Tehrani FR Hadaegh F Number of parity/live birth (s) and cardiovascular disease among Iranian women and men: results of over 15 years of follow-up BMC Pregnancy Childbirth 2021 21 1 1 10.1186/s12884-020-03499-2 33413159 PMC7792076 Moazzeni SS, Toreyhi H, Asgari S, Azizi F, Tehrani FR, Hadaegh F. Number of parity/live birth (s) and cardiovascular disease among Iranian women and men: results of over 15 years of follow-up. BMC Pregnancy Childbirth. 2021;21:1–1. 33413159 10.1186/s12884-020-03499-2 PMC7792076 48. Gaist D Pedersen L Cnattingius S Sørensen HT Parity and risk of subarachnoid hemorrhage in women a nested case-control study based on National Swedish registries Stroke 2004 35 28 32 10.1161/01.STR.0000105933.16654.B4 14657450 Gaist D, Pedersen L, Cnattingius S, Sørensen HT. Parity and risk of subarachnoid hemorrhage in women a nested case-control study based on National Swedish registries. Stroke. 2004;35:28–32 ( [PubMed] [Google Scholar] 14657450 10.1161/01.STR.0000105933.16654.B4 49. Yang C-Y Chang C-C Kuo H-W Chiu H-F Parity and risk of death from subarachnoid hemorrhage in women: evidence from a cohort in Taiwan Neurology 2006 67 514 5 10.1212/01.wnl.0000227938.06750.ec 16894119 Yang C-Y, Chang C-C, Kuo H-W, Chiu H-F. Parity and risk of death from subarachnoid hemorrhage in women: evidence from a cohort in Taiwan. Neurology. 2006;67:514–5. [PubMed] [Google Scholar]. 16894119 10.1212/01.wnl.0000227938.06750.ec 50. Steenland K Lally C Thun M Parity and coronary heart disease among women in the American Cancer Society CPS II population Epidemiology 1996 7 6 641 3 10.1097/00001648-199611000-00014 8899393 Steenland K, Lally C, Thun M. Parity and coronary heart disease among women in the American Cancer Society CPS II population. Epidemiology. 1996;7(6):641–3. 10.1097/00001648-199611000-00014. 8899393 10.1097/00001648-199611000-00014 51. Msolly A Gharbi O Ben Ahmed S Impact of menstrual and reproductive factors on breast cancer risk in Tunisia: a case-control study Med Oncol 2013 30 1 480 10.1007/s12032-013-0480-4 23377925 Msolly A, Gharbi O, Ben Ahmed S. Impact of menstrual and reproductive factors on breast cancer risk in Tunisia: a case-control study. Med Oncol. 2013;30(1):480. 10.1007/s12032-013-0480-4. ( Epub 2013 Feb 2. PMID: 23377925 23377925 10.1007/s12032-013-0480-4 52. Yavari P Mosavizadeh M Sadrol-Hefazi B Mehrabi Y Reproductive characteristics and the risk of breast cancer–a case-control study in Iran Asian Pac J Cancer Prev 2005 6 3 370 5 16236002 Yavari P, Mosavizadeh M, Sadrol-Hefazi B, Mehrabi Y. Reproductive characteristics and the risk of breast cancer–a case-control study in Iran. Asian Pac J Cancer Prev. 2005;6(3):370–5 PMID: 16236002. 16236002 53. Milne RL Osorio A Ramón y Cajal T Baiget M Lasa A Diaz-Rubio E de la Hoya M Caldés T Teulé A Lázaro C Blanco I Balmaña J Sánchez-Ollé G Vega A Blanco A Chirivella I Esteban Cardeñosa E Durán M Velasco E Martínez de Dueñas E Tejada MI Miramar MD Calvo MT Guillén-Ponce C Salazar R San Román C Urioste M Benítez J Parity and the risk of breast and ovarian cancer in BRCA1 and BRCA2 mutation carriers Breast Cancer Res Treat 2010 119 1 221 32 10.1007/s10549-009-0394-1 19370414 Milne RL, Osorio A, Ramón y Cajal T, Baiget M, Lasa A, Diaz-Rubio E, de la Hoya M, Caldés T, Teulé A, Lázaro C, Blanco I, Balmaña J, Sánchez-Ollé G, Vega A, Blanco A, Chirivella I, Esteban Cardeñosa E, Durán M, Velasco E, Martínez de Dueñas E, Tejada MI, Miramar MD, Calvo MT, Guillén-Ponce C, Salazar R, San Román C, Urioste M, Benítez J. Parity and the risk of breast and ovarian cancer in BRCA1 and BRCA2 mutation carriers. Breast Cancer Res Treat. 2010;119(1):221–32. 10.1007/s10549-009-0394-1. Epub 2009 Apr 16. PMID: 19370414. 19370414 10.1007/s10549-009-0394-1 54. Koushik A Grundy A Abrahamowicz M Arseneau J Gilbert L Gotlieb WH Lacaille J Mes-Masson AM Parent MÉ Provencher DM Richardson L Siemiatycki J Hormonal and reproductive factors and the risk of ovarian cancer Cancer Causes Control 2017 28 5 393 403 10.1007/s10552-016-0848-9 28102526 Koushik A, Grundy A, Abrahamowicz M, Arseneau J, Gilbert L, Gotlieb WH, Lacaille J, Mes-Masson AM, Parent MÉ, Provencher DM, Richardson L, Siemiatycki J. Hormonal and reproductive factors and the risk of ovarian cancer. Cancer Causes Control. 2017;28(5):393–403. 10.1007/s10552-016-0848-9. Epub 2017 Jan 19. PMID: 28102526. 28102526 10.1007/s10552-016-0848-9 55. Tekalegn Y Sahiledengle B Woldeyohannes D Atlaw D Degno S Desta F Bekele K Aseffa T Gezahegn H Kene C High parity is associated with increased risk of cervical cancer: Systematic review and meta-analysis of case-control studies Womens Health (Lond) 2022 18 17455065221075904 10.1177/17455065221075904 35114865 PMC8819811 Tekalegn Y, Sahiledengle B, Woldeyohannes D, Atlaw D, Degno S, Desta F, Bekele K, Aseffa T, Gezahegn H, Kene C. High parity is associated with increased risk of cervical cancer: Systematic review and meta-analysis of case-control studies. Womens Health (Lond). 2022;18:17455065221075904 PMID: 35114865; PMCID: PMC8819811. 35114865 10.1177/17455065221075904 PMC8819811 56. Shirazi TN Hastings WJ Rosinger AY Ryan CP Parity predicts biological age acceleration in post-menopausal, but not pre-menopausal, women Sci Rep 2020 10 1 20522 10.1038/s41598-020-77082-2 33239686 PMC7689483 Shirazi TN, Hastings WJ, Rosinger AY, Ryan CP. Parity predicts biological age acceleration in post-menopausal, but not pre-menopausal, women. Sci Rep. 2020;10(1):20522. 10.1038/s41598-020-77082-2. PMID: 33239686; PMCID: PMC7689483. 33239686 10.1038/s41598-020-77082-2 PMC7689483 57. Gomes CS Pirkle CM Barbosa JFS Vafaei A Câmara SMA Guerra RO Age at first birth, parity and history of hysterectomy are associated to frailty status: cross-sectional analysis from the International Mobility in Aging Study -Imias J Cross-Cult Gerontol 2018 33 4 337 354 10.1007/s10823-018-9360-x 30374614 Gomes CS, Pirkle CM, Barbosa JFS, Vafaei A, Câmara SMA, Guerra RO. Age at first birth, parity and history of hysterectomy are associated to frailty status: cross-sectional analysis from the International Mobility in Aging Study -Imias. J Cross-Cult Gerontol. 2018;33(4):337–54. 10.1007/s10823-018-9360-x. 30374614 10.1007/s10823-018-9360-x 58. Mueller NT Mueller NJ Odegaard AO Gross MD Koh WP Yuan JM Pereira MA Higher parity is associated with an increased risk of type-II diabetes in Chinese women: the Singapore Chinese health study BJOG 2013 120 12 1483 9 10.1111/1471-0528.12364 23786390 PMC4038299 Mueller NT, Mueller NJ, Odegaard AO, Gross MD, Koh WP, Yuan JM, Pereira MA. Higher parity is associated with an increased risk of type-II diabetes in Chinese women: the Singapore Chinese health study. BJOG. 2013;120(12):1483–9. 10.1111/1471-0528.12364. 23786390 10.1111/1471-0528.12364 PMC4038299 59. Parikh NI Cnattingius S Mittleman MA Ludvigsson JF Ingelsson E Subfertility and risk of later life maternal cardiovascular disease Hum Reprod 2012 27 2 568 75 10.1093/humrep/der400 22131387 PMC3283089 Parikh NI, Cnattingius S, Mittleman MA, Ludvigsson JF, Ingelsson E. Subfertility and risk of later life maternal cardiovascular disease. Hum Reprod. 2012;27(2):568–75. 10.1093/humrep/der400. 22131387 10.1093/humrep/der400 PMC3283089 60. Giubertoni E Bertelli L Bartolacelli Y Origliani G Modena MG Parity as predictor of early hypertension during menopausal transition J Hypertens 2013 31 3 501 7 10.1097/HJH.0b013e32835c1742 23196900 Giubertoni E, Bertelli L, Bartolacelli Y, Origliani G, Modena MG. Parity as predictor of early hypertension during menopausal transition. J Hypertens. 2013;31(3):501–7. 10.1097/HJH.0b013e32835c1742. 23196900 10.1097/HJH.0b013e32835c1742 61. Gunderson EP Jacobs DR Jr Chiang V Lewis CE Tsai A Quesenberry CP Jr Sidney S Childbearing is associated with higher incidence of the metabolic syndrome among women of reproductive age controlling for measurements before pregnancy: the CARDIA study Am J Obstet Gynecol 2009 201 2 177.e1 10.1016/j.ajog.2009.03.031 19560114 PMC2807822 Gunderson EP, Jacobs DR Jr, Chiang V, Lewis CE, Tsai A, Quesenberry CP Jr, Sidney S. Childbearing is associated with higher incidence of the metabolic syndrome among women of reproductive age controlling for measurements before pregnancy: the CARDIA study. Am J Obstet Gynecol. 2009;201(2):177.e1. 19560114 10.1016/j.ajog.2009.03.031 PMC2807822 62. Winkvist A Rasmussen KM Habicht JP A new definition of maternal depletion syndrome Am J Public Health 1992 82 5 691 4 10.2105/ajph.82.5.691 1566948 PMC1694126 Winkvist A, Rasmussen KM, Habicht JP. A new definition of maternal depletion syndrome. Am J Public Health. 1992;82(5):691–4. 10.2105/ajph.82.5.691. PMID: 1566948; PMCID: PMC1694126. 1566948 10.2105/ajph.82.5.691 PMC1694126 63. Winikoff B The effects of birth spacing on child and maternal health Stud Fam Plann 1983 14 10 231 45 10.2307/1965748 6648993 Winikoff B. The effects of birth spacing on child and maternal health. Stud Fam Plann. 1983;14(10):231–45. PMID: 6648993. 6648993 64. Westendorp RG Kirkwood TB Human longevity at the cost of reproductive success Nature 1998 396 6713 743 6 10.1038/25519 9874369 Westendorp RG, Kirkwood TB. Human longevity at the cost of reproductive success. Nature. 1998;396(6713):743–6. 10.1038/25519. 9874369 10.1038/25519 65. Epel ES Blackburn EH Lin J Dhabhar FS Adler NE Morrow JD Cawthon RM Accelerated telomere shortening in response to life stress Proc Natl Acad Sci U S A 2004 101 49 17312 5 10.1073/pnas.0407162101 15574496 PMC534658 Epel ES, Blackburn EH, Lin J, Dhabhar FS, Adler NE, Morrow JD, Cawthon RM. Accelerated telomere shortening in response to life stress. Proc Natl Acad Sci U S A. 2004;101(49):17312–5. 10.1073/pnas.0407162101. 15574496 10.1073/pnas.0407162101 PMC534658 ",
  "metadata": {
    "Title of this paper": "Accelerated telomere shortening in response to life stress",
    "Journal it was published in:": "BMC Public Health",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12487170/"
  }
}