{
  "title": "Paper_653",
  "abstract": "pmc Int J Mol Sci Int J Mol Sci 808 ijms ijms International Journal of Molecular Sciences 1422-0067 Multidisciplinary Digital Publishing Institute  (MDPI) PMC12469994 PMC12469994.1 12469994 12469994 41009578 10.3390/ijms26189012 ijms-26-09012 1 Review UCH-L1 in Alzheimer’s Disease: A Crucial Player in Dementia-Associated Mechanisms https://orcid.org/0000-0001-6828-356X Porchietto Elisa 1 2 † Morello Giulia 1 2 † Cicilese Giulia 1 2 https://orcid.org/0000-0001-6074-9628 Rainero Innocenzo 1 Rubino Elisa 1 https://orcid.org/0000-0003-2817-2835 Tamagno Elena 1 2 https://orcid.org/0000-0003-1610-1917 Boschi Silvia 1 * ‡ Guglielmotto Michela 1 2 ‡ Lyubchenko Yuri Academic Editor 1 elisa.porchietto@unito.it g.morello@unito.it giulia.cicilese@unito.it innocenzo.rainero@unito.it elisa.rubino@unito.it elena.tamagno@unito.it michela.guglielmotto@unito.it 2 * silvia.boschi@unito.it † These authors contributed equally to this work. ‡ These authors share senior authorship. 16 9 2025 9 2025 26 18 497349 9012 18 8 2025 14 9 2025 15 9 2025 16 09 2025 27 09 2025 29 09 2025 © 2025 by the authors. 2025 https://creativecommons.org/licenses/by/4.0/ Licensee MDPI, Basel, Switzerland. This article is an open access article distributed under the terms and conditions of the Creative Commons Attribution (CC BY) license ( https://creativecommons.org/licenses/by/4.0/ Ubiquitin carboxyl-terminal hydrolase L1 (UCH-L1) is a critical deubiquitinating enzyme that is highly expressed in the central nervous system, where it participates in protein degradation and turnover as part of the ubiquitin–proteasome system (UPS). Convincing evidence supports the role of UCH-L1 dysfunction in several neurodegenerative disorders, given its unique position at the crossroad of several aetiopathogenic pathways, including those implicated in Alzheimer’s disease (AD) onset. Indeed, UCH-L1 depletion correlates with decreased levels of triggering receptor expressed on myeloid cells 2 (TREM2), with consequent effects on neuroinflammation. Notably, UCH-L1 can affect the level of phosphorylated tau protein, thus contributing to the formation of neurofibrillary tangles (NFTs). In addition, UCH-L1 influences β-Secretase 1 (BACE1) expression, resulting in the abnormal accumulation of amyloid-β plaques in brain parenchyma. These findings underline UCH-L1’s centrality in maintaining the homeostasis of protein folding and aggregation, which are significantly impaired in AD and AD-related dementias. Given these assumptions, UCH-L1 is recognized as a potential biomarker for AD, highlighting its relevance in governing the fate of crucial pathological mediators of cognitive impairment and neurodegeneration. Herein, we contextualize the involvement of UCH-L1 in different dementia-associated pathways and summarize the state of the art of UCH-L1 as a biomarker for AD diagnosis. UCH-L1 amyloid-β tau hyperphosphorylation synaptic plasticity neuroinflammation biomarker protein misfolding Alzheimer’s disease (AD) Department of Neuroscience “Rita Levi-Montalcini”, University of Torino This research was funded by the Department of Neuroscience “Rita Levi-Montalcini”, University of Torino, Italy, under the project “Dipartimenti di Eccellenza 2023–2027”. pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement no pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes 1. Mechanistic Insights into UCH-L1 Enzyme Structure and Function Ubiquitination is a crucial post-translational modification that regulates protein fate by modulating stability, turnover, and overall functionality [ 1 2 3 4 5 6 7 8 9 The UCH-L1 enzyme consists of 223 amino acids and has a molecular weight of ~24.8 kDa [ 6 10 11 12 13 14 15 13 16 17 18 As extensively reviewed by Mi and Graham [ 19 20 21 22 23 11 24 17 25 26 UCH-L1 is not only subjected to different post-transcriptional modifications, but different polymorphisms have also been described. For instance, S18Y polymorphism was believed to be protective against AD [ 27 28 29 Despite its well-recognized activity as a hydrolase, an additional important function has been discovered, hinting at the pivotal role of this mediator in governing cellular homeostasis. Indeed, Liu and colleagues identified in vitro dimerization-dependent ubiquityl ligase activity. This enzymatic process mediates the linkage of a Lys-63-linked ubiquitin chain to substrates, preventing their proteasomal degradation and thereby promoting their stabilization. This process seems to support the accumulation of α-synuclein in PD [ 30 31 32 33 On the other hand, UCH-L1 acts as a monoubiquitin stabilizer, influencing ubiquitin directly by maintaining a stable pool of mono-ubiquitin, which is essential for the proper function of protein degradation machinery [ 14 34 35 36 37 UCH-L1 is a crucial enzyme in brain homeostasis, and this is supported by the fact that alterations in its functionality result in pathological outcomes: this review aims to dissect the role of UCH-L1 in neurodegenerative disorders, with a particular focus on AD. Moreover, it provides a comprehensive overview of the most relevant clinical data, with the ultimate goal of evaluating the role of UCH-L1 as a candidate biomarker in neurodegenerative disorders. 2. Unveiling the Role of UCH-L1 in Governing Crucial AD-Associated Hallmarks Alzheimer’s disease, the most common form of dementia worldwide, is a multifactorial disorder characterized by an intricate interplay among Aβ plaque deposition, tau-mediated neurofibrillary tangle formation (NFT), and neuroinflammation, which result in synaptic alterations and ultimately neurodegeneration [ 38 2.1. Amyloid-β Plaque Deposition Consistent scientific reports have unraveled the effects of UCH-L1 on Aβ plaque synthesis and accumulation [ 39 40 40 21 41 42 18 43 44 40 39 UCH-L1 can also indirectly affect the fate of Aβ plaques acting on BACE1 (β-site amyloid precursor protein cleaving enzyme 1). Indeed, BACE1 is the rate-limiting enzyme for the amyloidogenic cutting of APP. In particular, the proteolytic action of BACE1 generates a soluble APP β fragment and a C99 transmembrane terminal. The C99 fragment endures an intra-membranous cut by γ-secretase, generating the Aβ oligomers, which exert deleterious effects [ 45 46 47 48 41 49 In conclusion, UCH-L1 regulates Aβ plaque formation through both direct mechanisms, via APP ubiquitination and degradation, and indirect mechanisms, by modulating BACE1 stability and activity. Notably, decreased UCH-L1 expression and activity lead to a reduction in the free ubiquitin pool and, ultimately, impair proteasomal protein degradation, including BACE1, in both preclinical and clinical models of AD ( Figure 1 50 2.2. Tau Protein The tau protein, encoded by the MAPT gene (Microtubule-Associated Protein Tau), has the primary role of promoting tubulin assembly and stabilizing polymerized microtubules [ 51 52 53 54 55 56 Several lines of evidence suggest that UCH-L1 downregulation, which is documented in an AD pathological context, is also related to the tau protein and NFTs [ 21 57 58 59 57 60 59 21 58 61 Altogether, the strict correlation between UCH-L1 and tau protein, a crucial histopathological feature of AD, corroborates the multifaced interplays in which UCH-L1 is involved, highlighting its importance in the onset of the pathological phosphorylation of tau and ultimate accumulation within the NFTs ( Figure 2 2.3. Synaptic Loss The impairment of synaptic plasticity is a critical downstream consequence of the pathological accumulation of Aβ plaques and NFTs in AD, which ultimately leads to cognitive decline and the impairment of memory [ 62 63 64 39 65 40 66 Another pivotal signaling pathway involved in neuronal survival and synaptic plasticity is the Brain-Derived Neurotrophic Factor/tropomyosin receptor kinase B (BDNF/TrkB) signaling [ 67 42 68 69 An overview of the experimental approaches and major findings linking UCH-L1 to Alzheimer’s disease pathogenesis across different model systems is presented in Table 1 Figure 3 3. UCH-L1 as a Target and Modulator of Neuroinflammatory Pathways The term neuroinflammation refers to the activation of the CNS’s innate immune system in response to injury, infection, or the accumulation of abnormal proteins [ 70 71 72 73 74 75 76 77 78 79 80 81 In particular, UCH-L1 engages in a complex and multifaceted interplay with neuroinflammatory pathways, including oxidative stress and ROS production: indeed, recent studies position UCH-L1 as a key scavenger molecule for ROS in the CNS, and this is crucial for the redox balance in neurons, resulting in its abundance in this cell type [ 82 83 84 21 85 41 12 The UCH-L1-related dysfunctions play a crucial role in the exacerbation of neuroinflammation, but neuroinflammatory-typical signaling pathways seem to also have a direct effect on UCH-L1. The different pathological pathways involving inflammatory processes and protein degradation’s dysfunction seem to converge on NF-κB, a well-known transcriptional factor, whose nuclear translocation determines the expression of genes involved in cell survival and growth, stress responses, as well as inflammatory processes [ 86 41 50 Figure 3 49 87 88 89 90 Notably, the so-called “neurodegenerative microglia” are characterized by the secretion of high levels of extracellular vesicles (EVs) carrying different types of cargos, including phosphorylated tau, lipids, and microRNAs [ 91 92 93 The effect of UCH-L1 is not limited to microglial cells, astrocytes also appear to be influenced by its modulation, although through partially distinct mechanisms. Astrocytic cells are traditionally considered supportive cells, nevertheless they are now recognized as active players in neuroinflammatory and neurodegenerative processes [ 94 95 As mentioned before, neuroinflammation is the result of microglia and astroglia cell activation, as well as peripheral leukocyte infiltration through disrupted BBB. Indeed, the increased permeabilization of the BBB is a crucial event in neurodegenerative disorders, as it further amplifies neuroinflammatory events [ 75 96 97 98 99 Overall, these findings demonstrate that UCH-L1 is critically involved in multiple pathways underlying AD pathogenesis, including amyloid and tau metabolism, synaptic function, and neuroinflammatory responses. A concise overview of these mechanisms is provided in Table 2 4. UCH-L1 as a Predictive Cerebrospinal Fluid (CSF) Biomarker for AD Given the centrality of different hallmarks associated with AD and their pathogenic relevance in disease onset and progression, recent research has focused on translating these insights into measurable and predictive biomarkers for the diagnosis of AD and related dementia, i.e., p-tau181, p-tau217, and p-tau231 [ 100 101 102 103 104 105 106 107 108 109 The first study was conducted by Öhrfelt and colleagues, who investigated UCH-L1 levels in the CSF. They reported a strong increase in the levels of UCH-L1 in AD patients from two different independent cohorts, with no differences between other dementia or sMCI (stable Mild Cognitive Impairment). This suggests that UCH-L1 dysfunction may occur already in the earlier preclinical phases of the disease. Intriguingly, UCH-L1 levels in CSF can discriminate AD patients from controls with high diagnostic accuracy, as suggested by an ROC (Receiver Operating Characteristic) curve analysis. The increase in UCH-L1 is paired with the parallel increase in p-tau 231, supporting its role as an additional predictive biomarker for AD [ 101 102 103 104 110 105 106 111 107 112 113 114 115 108 116 117 118 119 97 109 UCH-L1 may represent a promising biomarker for AD, especially in CSF. However, regarding its potential use as a plasma biomarker, current data do not support its clinical utility. Indeed, even if the collection of CSF is certainly more invasive, UCH-L1-derived levels probably better mirror what happens in the CNS; on the contrary, UCH-L1 peripheral expression suffers from a lack of knowledge about the mechanistic events which are responsible for the flux in the bloodstream of a protein which is almost only neuronal. Nevertheless, longitudinal studies and novel advanced technologies could better elucidate the role of UCH-L1 levels in plasma and improve its reliability in AD blood-based diagnostics. 5. Conclusions UCH-L1 is one of the most abundant proteins expressed in the brain and its high levels reflect its central role in maintaining cellular homeostasis. In particular, UCH-L1 regulates ubiquitin levels and orchestrates protein degradation. Additionally, it interacts with various intracellular modulators, especially in the context of AD, including APP, tau protein, NFTs, and neural circuitries. Impaired UCH-L1 functionality, whether in activity, stability, or expression may contribute to the pathogenesis of dementia. From a translational perspective, UCH-L1 has also emerged as a promising early-stage biomarker, particularly in the CSF, where its levels correlate with disease progression, MMSE scores, and tau pathology. In line with the A/T/N classification framework [ 111 24 39 40 42 10 Disclaimer/Publisher’s Note: Conflicts of Interest The authors declare no conflicts of interest. Abbreviations AD Alzheimer’s disease APP Amyloid precursor protein Aβ Amyloid-β BACE1 β-site amyloid precursor protein cleaving enzyme 1 CNS Central nervous system CSF Cerebrospinal fluid MMSE Mini Mental State Examination NFTs Neurofibrillary tangles NF-κB Nuclear Factor kappa B PD Parkinson’s disease ROS Reactive oxygen species UCH-L1 Ubiquitin C-terminal hydrolase References 1. Kumar D. Ambasta R.K. Kumar P. Ubiquitin biology in neurodegenerative disorders: From impairment to therapeutic strategies Ageing Res. Rev. 2020 61 101078 10.1016/j.arr.2020.101078 32407951 2. Gao L. Zhang W. Shi X.H. Chang X. Han Y. Liu C. Jiang Z. Yang X. The mechanism of linear ubiquitination in regulating cell death and correlative diseases Cell Death Dis. 2023 14 659 10.1038/s41419-023-06183-3 37813853 PMC10562472 3. Harrigan J.A. Jacq X. Martin N.M. Jackson S.P. Deubiquitylating enzymes and drug discovery: Emerging opportunities Nat. Rev. Drug Discov. 2018 17 57 78 10.1038/nrd.2017.152 28959952 PMC7097658 4. Ramirez J. Prieto G. Olazabal-Herrero A. Borràs E. Fernandez-Vigo E. Alduntzin U. Osinalde N. Beaskoetxea J. Lectez B. Aloria K. A Proteomic Approach for Systematic Mapping of Substrates of Human Deubiquitinating Enzymes Int. J. Mol. Sci. 2021 22 4851 10.3390/ijms22094851 34063716 PMC8124392 5. Snyder N.A. Silva G.M. Deubiquitinating enzymes (DUBs): Regulation, homeostasis, and oxidative stress response J. Biol. Chem. 2021 297 101077 10.1016/j.jbc.2021.101077 34391779 PMC8424594 6. Wilkinson K.D. Lee K. Deshpande S. Duerksen-Hughes P. Boss J.M. Pohl J. The neuron-specific protein PGP 9.5 is a ubiquitin carboxyl-terminal hydrolase Science 1989 246 670 673 10.1126/science.2530630 2530630 7. Matuszczak E. Tylicka M. Komarowska M.D. Debek W.A. Hermanowicz, Ubiquitin carboxy-terminal hydrolase L1-physiology and pathology Cell Biochem. Funct. 2020 38 533 540 10.1002/cbf.3527 32207552 8. Wang K.K. Yang Z. Sarkis G. Torres I. Raghavan V. Ubiquitin C-terminal hydrolase-L1 (UCH-L1) as a therapeutic and diagnostic target in neurodegeneration, neurotrauma and neuro-injuries Expert. Opin. Ther. Targets 2017 21 627 638 10.1080/14728222.2017.1321635 28434268 9. Sjölin K. Kultima K. Larsson A. Freyhult E. Zjukovskaja C. Alkass K. Burman J. Distribution of five clinically important neuroglial proteins in the human brain Mol. Brain 2022 15 52 10.1186/s13041-022-00935-6 35765081 PMC9241296 10. Wang X. Zhang N. Li M. Hong T. Meng W. Ouyang T. Ubiquitin C-terminal hydrolase-L1: A new cancer marker and therapeutic target with dual effects (Review) Oncol. Lett. 2023 25 123 10.3892/ol.2023.13709 36844618 PMC9950345 11. Bishop P. Rocca D. Henley J.M. Ubiquitin C-Terminal hydrolase L1 (UCH-L1): Structure, distribution and roles in brain function and dysfunction Biochem. J. 2016 473 2453 2462 10.1042/BCJ20160082 27515257 PMC4980807 12. Puri S. Hsu S.-T.D. Functional dynamics of human ubiquitin C-terminal hydrolases Front. Biophys. 2024 2 1479898 10.3389/frbis.2024.1479898 13. Bishop P. Rubin P. Thomson A.R. Rocca D. Henley J.M. The Ubiquitin C-Terminal Hydrolase L1 (UCH-L1) C Terminus Plays a Key Role in Protein Stability, but Its Farnesylation Is Not Required for Membrane Association in Primary Neurons J. Biol. Chem. 2014 289 36140 36149 10.1074/jbc.M114.557124 25326379 PMC4276877 14. Tramutola A. Di Domenico F. Barone E. Perluigi M. Butterfield D.A. It Is All about (U)biquitin: Role of Altered Ubiquitin-Proteasome System and UCHL1 in Alzheimer Disease Oxidative Med. Cell. Longev. 2016 2016 2756068 10.1155/2016/2756068 26881020 PMC4736377 15. Das C. Hoang Q.Q. Kreinbring C.A. Luchansky S.J. Meray R.K. Ray S.S. Lansbury P.T. Ringe D. Petsko G.A. Structural basis for conformational plasticity of the Parkinson’s disease-associated ubiquitin hydrolase UCH-L1 Proc. Natl. Acad. Sci. USA 2006 103 4675 4680 Erratum in Proc. Natl. Acad. Sci. USA 2006 103 10.1073/pnas.0510403103 16537382 PMC1450230 16. Jia F. Fu L. Roles of Ubiquitin Ligases and Deubiquitylases in Alzheimer’s Disease Mol. Neurobiol. 2025 62 7747 7761 10.1007/s12035-025-04739-2 39932514 17. Liu Z. Meray R.K. Grammatopoulos T.N. Fredenburg R.A. Cookson M.R. Liu Y. Logan T. Lansbury P.T. Membrane-associated farnesylated UCH-L1 promotes α-synuclein neurotoxicity and is a therapeutic target for Parkinson’s disease Proc. Natl. Acad. Sci. USA 2009 106 4635 4640 10.1073/pnas.0806474106 19261853 PMC2651203 18. Donovan L.E. Higginbotham L. Dammer E.B. Gearing M. Rees H.D. Xia Q. Duong D.M. Seyfried N.T. Lah J.J. Levey A.I. Analysis of a membrane-enriched proteome from postmortem human brain tissue in Alzheimer’s disease Proteom. Clin. Appl. 2012 6 201 211 10.1002/prca.201100068 PMC3338199 22532456 19. Mi Z. Graham S.H. Role of UCHL1 in the pathogenesis of neurodegenerative diseases and brain injury Ageing Res. Rev. 2023 86 101856 10.1016/j.arr.2023.101856 36681249 PMC9992267 20. Castegna A. Aksenov M. Aksenova M. Thongboonkerd V. Klein J.B. Pierce W.M. Booze R. Markesbery W.R. Butterfield D.A. Proteomic identification of oxidatively modified proteins in alzheimer’s disease brain. part I: Creatine kinase BB, glutamine synthase, and ubiquitin carboxy-terminal hydrolase L-1 Free Radic. Biol. Med. 2002 33 562 571 10.1016/S0891-5849(02)00914-0 12160938 21. Choi J. Levey A.I. Weintraub S.T. Rees H.D. Gearing M. Chin L.S. Li L. Oxidative Modifications and Down-regulation of Ubiquitin Carboxyl-terminal Hydrolase L1 Associated with Idiopathic Parkinson’s and Alzheimer’s Diseases J. Biol. Chem. 2004 279 13256 13264 10.1074/jbc.M314124200 14722078 22. Sultana R. Boyd-Kimball D. Poon H.F. Cai J. Pierce W.M. Klein J.B. Merchant M. Markesbery W.R. Butterfield D.A. Redox proteomics identification of oxidized proteins in Alzheimer’s disease hippocampus and cerebellum: An approach to understand pathological and biochemical alterations in AD Neurobiol. Aging 2006 27 1564 1576 10.1016/j.neurobiolaging.2005.09.021 16271804 23. Butterfield D.A. Gnjec A. Poon H.F. Castegna A. Pierce W.M. Klein J.B. Martins R.N. Redox proteomics identification of oxidatively modified brain proteins in inherited Alzheimer’s disease: An initial assessment J. Alzheimer’s Dis. 2006 10 391 397 10.3233/JAD-2006-10407 17183150 24. Nakamura T. Oh C.K. Liao L. Zhang X. Lopez K.M. Gibbs D. Deal A.K. Scott H.R. Spencer B. Masliah E. Noncanonical transnitrosylation network contributes to synapse loss in Alzheimer’s disease Science 2021 371 eaaw0843 10.1126/science.aaw0843 33273062 PMC8091809 25. Koharudin L.M.I. Liu H. Di Maio R. Kodali R.B. Graham S.H. Gronenborn A.M. Cyclopentenone prostaglandin-induced unfolding and aggregation of the Parkinson disease-associated UCH-L1 Proc. Natl. Acad. Sci. USA 2010 107 6835 6840 10.1073/pnas.1002295107 20231490 PMC2872412 26. Toyama T. Abiko Y. Katayama Y. Kaji T. Kumagai Y. Mercuration of ubiquitin carboxyl-terminal hydrolase L1 through Cys152 by methylmercury causes inhibition of its catalytic activity and reduction of monoubiquitin levels in SH-SY5Y cells J. Toxicol. Sci. 2015 40 887 893 10.2131/jts.40.887 26558469 27. Forero D.A. Benítez B. Arboleda G. Yunis J.J. Pardo R. Arboleda H. Analysis of functional polymorphisms in three synaptic plasticity-related genes (BDNF, COMT AND UCHL1) in Alzheimer’s disease in Colombia Neurosci. Res. 2006 55 334 341 10.1016/j.neures.2006.04.006 16698101 28. Xue S. Jia J. Genetic association between Ubiquitin Carboxy-terminal Hydrolase-L1 gene S18Y polymorphism and sporadic Alzheimer’s disease in a Chinese Han population Brain Res. 2006 1087 28 32 10.1016/j.brainres.2006.02.121 16626667 29. Zetterberg M. Sjölander A. von Otter M. Palmér M. Landgren S. Minthon L. Wallin A. Andreasen N. Blennow K. Zetterberg H. Ubiquitin carboxy-terminal hydrolase L1 (UCHL1) S18Y polymorphism in Alzheimer’s disease Mol. Neurodegener. 2010 5 11 10.1186/1750-1326-5-11 20302621 PMC2848225 30. Liu Y. Fallon L. Lashuel H.A. Liu Z. Lansbury P.T. The UCH-L1 Gene Encodes Two Opposing Enzymatic Activities that Affect-Synuclein Degradation and Parkinson’s Disease Susceptibility Cell 2002 111 209 218 10.1016/S0092-8674(02)01012-7 12408865 31. Setsuie R. Wada K. The functions of UCH-L1 and its relation to neurodegenerative diseases Neurochem. Int. 2007 51 105 111 10.1016/j.neuint.2007.05.007 17586089 32. Bdarneh A. Maniv I. Glickman M.H. Ubiquitin C-Terminal Hydrolase L1 (UCHL1), Beyond Hydrolysis BioEssays 2025 47 e70028 10.1002/bies.70028 40491163 PMC12278803 33. Bilguvar K. Tyagi N.K. Ozkara C. Tuysuz B. Bakircioglu M. Choi M. Delil S. Caglayan A.O. Baranoski J.F. Erturk O. Recessive loss of function of the neuronal ubiquitin hydrolase UCHL1 leads to early-onset progressive neurodegeneration Proc. Natl. Acad. Sci. USA 2013 110 3489 3494 10.1073/pnas.1222732110 23359680 PMC3587195 34. Osaka H. Ubiquitin carboxy-terminal hydrolase L1 binds to and stabilizes monoubiquitin in neuron Hum. Mol. Genet. 2003 12 1945 1958 10.1093/hmg/ddg211 12913066 35. Larsen C.N. Krantz B.A. Wilkinson K.D. Substrate Specificity of Deubiquitinating Enzymes: Ubiquitin C-Terminal Hydrolases Biochemistry 1998 37 3358 3368 10.1021/bi972274d 9521656 36. van Leeuwen F.W. de Kleijn D.P.V. van den Hurk H.H. Neubauer A. Sonnemans M.A.F. Sluijs J.A. Köycü S. Ramdjielal R.D.J. Salehi A. Martens G.J.M. Frameshift Mutants of β Amyloid Precursor Protein and Ubiquitin-B in Alzheimer’s and Down Patients Science 1998 279 242 247 10.1126/science.279.5348.242 9422699 37. Maniv I. Sarji M. Bdarneh A. Feldman A. Ankawa R. Koren E. Magid-Gold I. Reis N. Soteriou D. Salomon-Zimri S. Altered ubiquitin signaling induces Alzheimer’s disease-like hallmarks in a three-dimensional human neural cell culture model Nat. Commun. 2023 14 5922 10.1038/s41467-023-41545-7 37739965 PMC10516951 38. Zhang J. Kong G. Yang J. Pang L. Li X. Pathological mechanisms and treatment progression of Alzheimer’s disease Eur. J. Med. Res. 2025 30 625 10.1186/s40001-025-02886-9 40660381 PMC12261696 39. Gong B. Cao Z. Zheng P. Vitolo O.V. Liu S. Staniszewski A. Moolman D. Zhang H. Shelanski M. Arancio O. Ubiquitin Hydrolase Uch-L1 Rescues β-Amyloid-Induced Decreases in Synaptic Function and Contextual Memory Cell 2006 126 775 788 10.1016/j.cell.2006.06.046 16923396 40. Zhang M. Cai F. Zhang S. Zhang S. Song W. Overexpression of ubiquitin carboxyl-terminal hydrolase L1 (UCHL1) delays Alzheimer’s progression in vivo Sci. Rep. 2014 4 7298 10.1038/srep07298 25466238 PMC4252905 41. Guglielmotto M. Monteleone D. Boido M. Piras A. Giliberto L. Borghi R. Vercelli A. Fornaro M. Tabaton M. Tamagno E. Aβ1-42-mediated down-regulation of Uch-L1 is dependent on NF-κB activation and impaired BACE1 lysosomal degradation Aging Cell 2012 11 834 844 10.1111/j.1474-9726.2012.00854.x 22726800 42. Poon W.W. Carlos A.J. Aguilar B.L. Berchtold N.C. Kawano C.K. Zograbyan V. Yaopruke T. Shelanski M. Cotman C.W. β-Amyloid (Aβ) Oligomers Impair Brain-derived Neurotrophic Factor Retrograde Trafficking by Down-regulating Ubiquitin C-terminal Hydrolase, UCH-L1 J. Biol. Chem. 2013 288 16937 16948 10.1074/jbc.M113.463711 23599427 PMC3675626 43. Toyama Y. Nirasawa T. Morishima M. Saito Y. Irie K. Murayama S. Ikegawa M. Integrated Spatial Multi-Omics Study of Postmortem Brains of Alzheimer’s Disease Acta Histochem. Cytochem. 2024 57 119 130 10.1267/ahc.24-00025 38988692 PMC11231568 44. Ichihara N. Wu J. Chui D.H. Yamazaki K. Wakabayashi T. Kikuchi T. Axonal degeneration promotes abnormal accumulation of amyloid β-protein in ascending gracile tract of gracile axonal dystrophy (GAD) mouse Brain Res. 1995 695 173 178 10.1016/0006-8993(95)00729-A 8556328 45. Cole S.L. Vassar R. The Alzheimer’s disease Beta-secretase enzyme BACE1 Mol. Neurodegener. 2007 2 22 10.1186/1750-1326-2-22 18005427 PMC2211305 46. Zhou Z. Chan C.H. Ma Q. Xu X. Xiao Z. Tan E.-K. The roles of amyloid precursor protein (APP) in neurogenesis Cell Adhes. Migr. 2011 5 280 292 10.4161/cam.5.4.16986 21785276 PMC3210295 47. Qing H. Zhou W. Christensen M.A. Sun X. Tong Y. Song W. Degradation of BACE by the ubiquitin-proteasome pathway FASEB J. 2004 18 1571 1573 10.1096/fj.04-1994fje 15289451 48. Zhang M. Deng Y. Luo Y. Zhang S. Zou H. Cai F. Wada K. Song W. Control of BACE1 degradation and APP processing by ubiquitin carboxyl-terminal hydrolase L1 J. Neurochem. 2012 120 1129 1138 10.1111/j.1471-4159.2011.07644.x 22212137 49. Guglielmotto M. Monteleone D. Vasciaveo V. Repetto I.E. Manassero G. Tabaton M. Tamagno E. The decrease of Uch-L1 activity is a common mechanism responsible for Aβ 42 accumulation in Alzheimer’s and vascular disease Front. Aging Neurosci. 2017 9 320 10.3389/fnagi.2017.00320 29033830 PMC5627155 50. Wang R. Zhang M. Zhou W. Ly P.T.T. Cai F. Song W. NF-κB signaling inhibits ubiquitin carboxyl-terminal hydrolase L1 gene expression J. Neurochem. 2011 116 1160 1170 10.1111/j.1471-4159.2011.07172.x 21210816 51. Avila J. Lucas J.J. Pérez M. Hernandez F. Role of Tau Protein in Both Physiological and Pathological Conditions Physiol. Rev. 2004 84 361 384 10.1152/physrev.00024.2003 15044677 52. Jiang G. Xie G. Li X. Xiong J. Cytoskeletal Proteins and Alzheimer’s Disease Pathogenesis: Focusing on the Interplay with Tau Pathology Biomolecules 2025 15 831 10.3390/biom15060831 40563471 PMC12190275 53. Medeiros R. Baglietto-Vargas D. LaFerla F.M. The Role of Tau in Alzheimer’s Disease and Related Disorders CNS Neurosci. Ther. 2011 17 514 524 10.1111/j.1755-5949.2010.00177.x 20553310 PMC4072215 54. Chen Y. Yu Y. Tau and neuroinflammation in Alzheimer’s disease: Interplay mechanisms and clinical translation J. Neuroinflamm. 2023 20 165 10.1186/s12974-023-02853-3 37452321 PMC10349496 55. Tiwari S. Atluri V. Kaushik A. Yndart A. Nair M. Alzheimer’s disease: Pathogenesis, diagnostics, and therapeutics Int. J. Nanomed. 2019 14 5541 5554 10.2147/IJN.S200490 PMC6650620 31410002 56. Poppek D. Keck S. Ermak G. Jung T. Stolzing A. Ullrich O. Davies K.J.A. Grune T. Phosphorylation inhibits turnover of the tau protein by the proteasome: Influence of RCAN1 and oxidative stress Biochem. J. 2006 400 511 520 10.1042/BJ20060463 16939415 PMC1698600 57. Xie M. Han Y. Yu Q. Wang X. Wang S. Liao X. UCH-L1 Inhibition Decreases the Microtubule-Binding Function of Tau Protein J. Alzheimer’s Dis. 2015 49 353 363 10.3233/JAD-150032 26444754 58. Minjarez B. Calderón-González K.G. Rustarazo M.L.V. Herrera-Aguirre M.E. Labra-Barrios M.L. Rincon-Limas D.E. del Pino M.M.S. Mena R. Luna-Arias J.P. Identification of proteins that are differentially expressed in brains with Alzheimer’s disease using iTRAQ labeling and tandem mass spectrometry J. Proteom. 2016 139 103 121 10.1016/j.jprot.2016.03.022 27012543 59. Yu Q. Zhang H. Li Y. Liu C. Wang S. Liao X. UCH-L1 Inhibition Suppresses tau Aggresome Formation during Proteasomal Impairment Mol. Neurobiol. 2017 55 3812 3821 10.1007/s12035-017-0558-7 28540657 60. Zhao Z.-B. Wu L. Xiong R. Wang L.-L. Zhang B. Wang C. Li H. Liang L. Chen S.-D. MicroRNA-922 promotes tau phosphorylation by downregulating ubiquitin carboxy-terminal hydrolase L1 (UCHL1) expression in the pathogenesis of Alzheimer’s disease Neuroscience 2014 275 232 237 10.1016/j.neuroscience.2014.06.013 24950120 61. Chen J. Huang R.Y.C. Turko I.V. Mass spectrometry assessment of ubiquitin carboxyl-terminal hydrolase L1 partitioning between soluble and particulate brain homogenate fractions Anal. Chem. 2013 85 6011 6017 10.1021/ac400831z 23682718 PMC4013546 62. Crimins J.L. Pooler A. Polydoro M. Luebke J.I. Spires-Jones T.L. The intersection of amyloid beta and tau in glutamatergic synaptic dysfunction and collapse in Alzheimer’s disease Ageing Res. Rev. 2013 12 757 763 10.1016/j.arr.2013.03.002 23528367 PMC3735866 63. Hegde A.N. Inokuchi K. Pei W. Casadio A. Ghirardi M. Chain D.G. Martin K.C. Kandel E.R. Schwartz J.H. Ubiquitin C-Terminal Hydrolase Is an Immediate-Early Gene Essential for Long-Term Facilitation in Aplysia Cell 1997 89 115 126 10.1016/S0092-8674(00)80188-9 9094720 64. Cookson M.R. Hardy J. The Persistence of Memory N. Engl. J. Med. 2006 355 2697 2698 10.1056/NEJMcibr065999 17182998 65. Sakurai M. Sekiguchi M. Zushida K. Yamada K. Nagamine S. Kabuta T. Wada K. Reduction in memory in passive avoidance learning, exploratory behaviour and synaptic plasticity in mice with a spontaneous deletion in the ubiquitin C-terminal hydrolase L1 gene Eur. J. Neurosci. 2008 27 691 701 10.1111/j.1460-9568.2008.06047.x 18279321 66. Cartier A.E. Djakovic S.N. Salehi A. Wilson S.M. Masliah E. Patrick G.N. Regulation of Synaptic Structure by Ubiquitin C-Terminal Hydrolase L1 J. Neurosci. 2009 29 7857 7868 10.1523/JNEUROSCI.1817-09.2009 19535597 PMC2748938 67. Wang Y. Liang J. Xu B. Yang J. Wu Z. Cheng L. TrkB/BDNF signaling pathway and its small molecular agonists in CNS injury Life Sci. 2024 336 122282 10.1016/j.lfs.2023.122282 38008209 68. Guo Y.-Y. Lu Y. Zheng Y. Chen X.-R. Dong J.-L. Yuan R.-R. Huang S.-H. Yu H. Wang Y. Chen Z.-Y. Ubiquitin C-Terminal Hydrolase L1 (UCH-L1) Promotes Hippocampus-Dependent Memory via Its Deubiquitinating Effect on TrkB J. Neurosci. 2017 37 5978 5995 10.1523/JNEUROSCI.3148-16.2017 28500221 PMC6596500 69. Chen F. Sugiura Y. Myers K.G. Liu Y. Lin W. Ubiquitin carboxyl-terminal hydrolase L1 is required for maintaining the structure and function of the neuromuscular junction Proc. Natl. Acad. Sci. USA 2010 107 1636 1641 10.1073/pnas.0911516107 20080621 PMC2824399 70. Konsman J.P. Cytokines in the Brain and Neuroinflammation: We Didn’t Starve the Fire! Pharmaceuticals 2022 15 140 10.3390/ph15020140 35215252 PMC8878213 71. DiSabato D.J. Quan N. Godbout J.P. Neuroinflammation: The devil is in the details J. Neurochem. 2016 139 136 153 10.1111/jnc.13607 26990767 PMC5025335 72. Al-Ghraiybah N.F. Wang J. Alkhalifa A.E. Roberts A.B. Raj R. Yang E. Kaddoumi A. Glial Cell-Mediated Neuroinflammation in Alzheimer’s Disease Int. J. Mol. Sci. 2022 23 10572 10.3390/ijms231810572 36142483 PMC9502483 73. Ronaldson P.T. Davis T.P. Regulation of blood–brain barrier integrity by microglia in health and disease: A therapeutic opportunity J. Cereb. Blood Flow Metab. 2020 40 S6 S24 10.1177/0271678X20951995 32928017 PMC7687032 74. Pasko V.I. Churkina A.S. Shakhov A.S. Kotlobay A.A. Alieva I.B. Modeling of Neurodegenerative Diseases: ‘Step by Step’ and ‘Network’ Organization of the Complexes of Model Systems Int. J. Mol. Sci. 2023 24 604 10.3390/ijms24010604 36614047 PMC9820769 75. Chen T. Dai Y. Hu C. Lin Z. Wang S. Yang J. Zeng L. Li S. Li W. Cellular and molecular mechanisms of the blood–brain barrier dysfunction in neurodegenerative diseases Fluids Barriers CNS 2024 21 60 10.1186/s12987-024-00557-1 39030617 PMC11264766 76. Thibaudeau T.A. Anderson R.T. Smith D.M. A common mechanism of proteasome impairment by neurodegenerative disease-associated oligomers Nat. Commun. 2018 9 1097 10.1038/s41467-018-03509-0 29545515 PMC5854577 77. Hershko A. Ciechanover A. The Ubiquitin system for protein degradation Annu. Rev. Biochem. 1992 61 761 807 10.1146/annurev.bi.61.070192.003553 1323239 78. Han D. Zheng W. Wang X. Chen Z. Proteostasis of α-Synuclein and Its Role in the Pathogenesis of Parkinson’s Disease Front. Cell. Neurosci. 2020 14 45 10.3389/fncel.2020.00045 32210767 PMC7075857 79. Thapa R. Bhat A.A. Shahwan M. Ali H. PadmaPriya G. Bansal P. Rajotiya S. Barwal A. Prasad G.V.S. Pramanik A. Proteostasis disruption and senescence in Alzheimer’s disease pathways to neurodegeneration Brain Res. 2024 1845 149202 10.1016/j.brainres.2024.149202 39216694 80. McNaught K.S.P. Olanow C.W. Schapira, Jenner, Isacson, Hunot, Tatton, Beal, Proteolytic stress: A unifying concept for the etiopathogenesis of Parkinson’s disease Ann. Neurol. 2003 53 S73 S86 10.1002/ana.10512 12666100 81. Sonninen T.M. Goldsteins G. Laham-Karam N. Koistinaho J. Lehtonen Š. Proteostasis Disturbances and Inflammation in Neurodegenerative Diseases Cells 2020 9 2183 10.3390/cells9102183 32998318 PMC7601929 82. Choi J.E. Lee J.J. Kang W. Kim H.J. Cho J.H. Han P.L. Lee K.J. Proteomic Analysis of Hippocampus in a Mouse Model of Depression Reveals Neuroprotective Function of Ubiquitin C-terminal Hydrolase L1 (UCH-L1) via Stress-induced Cysteine Oxidative Modifications Mol. Cell. Proteom. 2018 17 1803 10.1074/mcp.RA118.000835 PMC6126396 29959188 83. Puri S. Hsu S.T.D. Cross-over Loop Cysteine C152 Acts as an Antioxidant to Maintain the Folding Stability and Deubiquitinase Activity of UCH-L1 Under Oxidative Stress J. Mol. Biol. 2021 433 166879 10.1016/j.jmb.2021.166879 33617897 84. Gabbita S.P. Aksenov M.Y. Lovell M.A. Markesbery W.R. Decrease in Peptide Methionine Sulfoxide Reductase in Alzheimer’s Disease Brain J. Neurochem. 1999 73 1660 1666 10.1046/j.1471-4159.1999.0731660.x 10501213 85. Di Domenico F. Head E. Butterfield D.A. Perluigi M. Oxidative Stress and Proteostasis Network: Culprit and Casualty of Alzheimer’s-Like Neurodegeneration Adv. Geriatr. 2014 2014 527518 10.1155/2014/527518 86. Qin Z.H. Tao L.Y. Chen X. Dual roles of NF-κB in cell survival and implications of NF-κB inhibitors in neuroprotective therapy Acta Pharmacol. Sin. 2007 28 1859 1872 10.1111/j.1745-7254.2007.00741.x 18031598 87. Zhang Z. Liu N. Chen X. Zhang F. Kong T. Tang X. Yang Q. Chen W. Xiong X. Chen X. UCHL1 regulates inflammation via MAPK and NF-κB pathways in LPS-activated macrophages Cell Biol. Int. 2021 45 2107 2117 10.1002/cbin.11662 34288216 88. Liang Z. Damianou A. Vendrell I. Jenkins E. Lassen F.H. Washer S.J. Grigoriou A. Liu G. Yi G. Lou H. Proximity proteomics reveals UCH-L1 as an essential regulator of NLRP3-mediated IL-1β production in human macrophages and microglia Cell Rep. 2024 43 114152 10.1016/j.celrep.2024.114152 38669140 89. Smith J.A. Das A. Ray S.K. Banik N.L. Role of pro-inflammatory cytokines released from microglia in neurodegenerative diseases Brain Res. Bull. 2012 87 10 20 10.1016/j.brainresbull.2011.10.004 22024597 PMC9827422 90. Guglielmotto M. Repetto I.E. Monteleone D. Vasciaveo V. Franchino C. Rinaldi S. Tabaton M. Tamagno E. Stroke and Amyloid-β Downregulate TREM-2 and Uch-L1 Expression that Synergistically Promote the Inflammatory Response J. Alzheimer’s Dis. 2019 71 907 920 10.3233/JAD-190494 31450501 91. Clayton K. Delpech J.C. Herron S. Iwahara N. Ericsson M. Saito T. Saido T.C. Ikezu S. Ikezu T. Plaque associated microglia hyper-secrete extracellular vesicles and accelerate tau propagation in a humanized APP mouse model Mol. Neurodegener. 2021 16 18 Erratum in Mol. Neurodegener. 2021 16 10.1186/s13024-021-00440-9 33752701 PMC7986521 92. Cohn W. Melnik M. Huang C. Teter B. Chandra S. Zhu C. McIntire L.B. John V. Gylys K.H. Bilousova T. Multi-Omics Analysis of Microglial Extracellular Vesicles From Human Alzheimer’s Disease Brain Tissue Reveals Disease-Associated Signatures Front. Pharmacol. 2021 12 766082 10.3389/fphar.2021.766082 34925024 PMC8675946 93. Duan J. Lv A. Guo Z. Liu Q. Tian C. Yang Y. Bi J. Yu X. Peng G. Luo B. CX3CR1+/UCHL1+ microglial extracellular vesicles in blood: A potential biomarker for multiple sclerosis J. Neuroinflamm. 2024 21 254 10.1186/s12974-024-03243-z PMC11465848 39385200 94. Patani R. Hardingham G.E. Liddelow S.A. Functional roles of reactive astrocytes in neuroinflammation and neurodegeneration Nat. Rev. Neurol. 2023 19 395 409 10.1038/s41582-023-00822-1 37308616 95. Ding L. Chu W. Xia Y. Shi M. Li T. Zhou F.Q. Deng D.Y.B. UCHL1 facilitates protein aggregates clearance to enhance neural stem cell activation in spinal cord injury Cell Death Dis. 2023 14 479 10.1038/s41419-023-06003-8 37507386 PMC10382505 96. Li J. Yu C. Sun Y. Li Y. Serum ubiquitin C-terminal hydrolase L1 as a biomarker for traumatic brain injury: A systematic review and meta-analysis Am. J. Emerg. Med. 2015 33 1191 1196 10.1016/j.ajem.2015.05.023 26087705 97. U.S. Food and Drug Administration (FDA) Evaluation of Automatic Class III Designation for Banyan Brain Trauma Indicator_Decision-Memorandum 2018 Available online: https://www.accessdata.fda.gov/cdrh_docs/reviews/DEN170045.pdf (accessed on 14 July 2025) 98. Wang J. Ji C. Ye W. Rong Y. Ge X. Wang Z. Tang P. Zhou Z. Luo Y. Cai W. Deubiquitinase UCHL1 promotes angiogenesis and blood–spinal cord barrier function recovery after spinal cord injury by stabilizing Sox17 Cell. Mol. Life Sci. 2024 81 137 10.1007/s00018-024-05186-3 38478109 PMC10937794 99. Corada M. Orsenigo F. Bhat G.P. Conze L.L. Breviario F. Cunha S.I. Claesson-Welsh L. Beznoussenko G.V. Mironov A.A. Bacigaluppi M. Fine-Tuning of Sox17 and Canonical Wnt Coordinates the Permeability Properties of the Blood-Brain Barrier Circ. Res. 2019 124 511 525 10.1161/CIRCRESAHA.118.313316 30591003 PMC6407809 100. Leuzy A. Bollack A. Pellegrino D. Teunissen C.E. La Joie R. Rabinovici G.D. Franzmeier N. Johnson K. Barkhof F. Shaw L.M. Considerations in the clinical use of amyloid PET and CSF biomarkers for Alzheimer’s disease Alzheimer’s Dement. 2025 21 e14528 10.1002/alz.14528 40042435 PMC11881640 101. Öhrfelt A. Johansson P. Wallin A. Andreasson U. Zetterberg H. Blennow K. Svensson J. Increased Cerebrospinal Fluid Levels of Ubiquitin Carboxyl-Terminal Hydrolase L1 in Patients with Alzheimer’s Disease Dement. Geriatr. Cogn. Dis. Extra 2016 6 283 294 10.1159/000447239 27504117 PMC4965532 102. Schulz I. Kruse N. Gera R.G. Kremer T. Cedarbaum J. Barbour R. Zago W. Schade S. Otte B. Bartl M. Systematic Assessment of 10 Biomarker Candidates Focusing on α-Synuclein-Related Disorders Mov. Disord. 2021 36 2874 2887 10.1002/mds.28738 34363416 103. Zhou M. Haque R.U. Dammer E.B. Duong D.M. Ping L. Johnson E.C.B. Lah J.J. Levey A.I. Seyfried N.T. Targeted mass spectrometry to quantify brain-derived cerebrospinal fluid biomarkers in Alzheimer’s disease Clin. Proteom. 2020 17 19 10.1186/s12014-020-09285-8 32514259 PMC7257173 104. Peña-Bautista C. Álvarez-Sánchez L. Balaguer Á. Raga L. García-Vallés L. Baquero M. Cháfer-Pericás C. Defining Alzheimer’s Disease through Proteomic CSF Profiling J. Proteome Res. 2024 23 5096 5106 10.1021/acs.jproteome.4c00590 39373095 105. Chatziefstathiou A. Canaslan S. Kanata E. Vekrellis K. Constantinides V.C. Paraskevas G.P. Kapaki E. Schmitz M. Zerr I. Xanthopoulos K. SIMOA Diagnostics on Alzheimer’s Disease and Frontotemporal Dementia Biomedicines 2024 12 1253 10.3390/biomedicines12061253 38927460 PMC11201638 106. Paciotti S. Wojdała A.L. Bellomo G. Toja A. Chipi E. Piersma S.R. Pham T.V. Gaetani L. Jimenez C.R. Parnetti L. Potential diagnostic value of CSF metabolism-related proteins across the Alzheimer’s disease continuum Alzheimers Res. Ther. 2023 15 124 10.1186/s13195-023-01269-8 37454217 PMC10350263 107. Wojdała A.L. Bellomo G. Gaetani L. Toja A. Chipi E. Shan D. Chiasserini D. Parnetti L. Trajectories of CSF and plasma biomarkers across Alzheimer’s disease continuum: Disease staging by NF-L, p-tau181, and GFAP Neurobiol. Dis. 2023 189 106356 10.1016/j.nbd.2023.106356 37977432 108. Sarto J. Ruiz-García R. Guillén N. Ramos-Campoy Ó. Falgàs N. Esteller D. Contador J. Fernández G. González Y. Tort-Merino A. Diagnostic Performance and Clinical Applicability of Blood-Based Biomarkers in a Prospective Memory Clinic Cohort Neurology 2023 100 E860 E873 10.1212/WNL.0000000000201597 36450604 PMC9984216 109. Lobue C. Stopschinski B.E. Calveras N.S. Douglas P.M. Huebinger R. Cullum C.M. Hart J. Gonzales M.M. Blood Markers in Relation to a History of Traumatic Brain Injury Across Stages of Cognitive Impairment in a Diverse Cohort J. Alzheimer’s Dis. 2024 97 345 358 10.3233/JAD-231027 38143366 PMC10947497 110. Anaya-Cubero E. Fernández-Irigoyen J. Santamaría E. Application of Single Molecule Array (SIMOA) in Cerebrospinal Fluid Methods Mol. Biol. 2025 2914 25 39 10.1007/978-1-0716-4462-1_3 40167908 111. Jack C.R. Bennett D.A. Blennow K. Carrillo M.C. Dunn B. Haeberlein S.B. Holtzman D.M. Jagust W. Jessen F. Karlawish J. NIA-AA Research Framework: Toward a biological definition of Alzheimer’s disease Alzheimer’s Dement. 2018 14 535 562 10.1016/j.jalz.2018.02.018 29653606 PMC5958625 112. Moscoso A. Karikari T.K. Grothe M.J. Ashton N.J. Lantero-Rodriguez J. Snellman A. Zetterberg H. Blennow K. Schöll M. CSF biomarkers and plasma p-tau181 as predictors of longitudinal tau accumulation: Implications for clinical trial design Alzheimer’s Dement. 2022 18 2614 2626 10.1002/alz.12570 35226405 113. Janelidze S. Stomrud E. Smith R. Palmqvist S. Mattsson N. Airey D.C. Proctor N.K. Chai X. Shcherbinin S. Sims J.R. Cerebrospinal fluid p-tau217 performs better than p-tau181 as a biomarker of Alzheimer’s disease Nat. Commun. 2020 11 1683 10.1038/s41467-020-15436-0 32246036 PMC7125218 114. Barthélemy N.R. Bateman R.J. Hirtz C. Marin P. Becher F. Sato C. Gabelle A. Lehmann S. Cerebrospinal fluid phospho-tau T217 outperforms T181 as a biomarker for the differential diagnosis of Alzheimer’s disease and PET amyloid-positive patient identification Alzheimer’s Res. Ther. 2020 12 26 10.1186/s13195-020-00596-4 32183883 PMC7079453 115. Kawahata I. Sekimori T. Oizumi H. Takeda A. Fukunaga K. Using Fatty Acid-Binding Proteins as Potential Biomarkers to Discriminate between Parkinson’s Disease and Dementia with Lewy Bodies: Exploration of a Novel Technique Int. J. Mol. Sci. 2023 24 13267 10.3390/ijms241713267 37686075 PMC10487513 116. Barrachina M. Castaño E. Dalfó E. Maes T. Buesa C. Ferrer I. Reduced ubiquitin C-terminal hydrolase-1 expression levels in dementia with Lewy bodies Neurobiol. Dis. 2006 22 265 273 10.1016/j.nbd.2005.11.005 16380264 117. Li R. Wang J. Xie W. Liu J. Wang C. UCHL1 from serum and CSF is a candidate biomarker for amyotrophic lateral sclerosis Ann. Clin. Transl. Neurol. 2020 7 1420 1428 10.1002/acn3.51141 32729234 PMC7448153 118. Mondello S. Palmio J. Streeter J. Hayes R.L. Peltola J. Jeromin A. Ubiquitin Carboxy-Terminal Hydrolase L1 (UCH-L1) is increased in cerebrospinal fluid and plasma of patients after epileptic seizure BMC Neurol. 2012 12 85 10.1186/1471-2377-12-85 22931063 PMC3500207 119. Ng A.S.L. Tan Y.J. Lu Z. Ng E.Y. Ng S.Y.E. Chia N.S.Y. Setiawan F. Xu Z. Keong N.C.H. Tay K.Y. Plasma ubiquitin C-terminal hydrolase L1 levels reflect disease stage and motor severity in Parkinson’s disease Aging 2020 12 1488 1495 10.18632/aging.102695 31932518 PMC7053593 Figure 1 UCH-L1 plays a crucial role in the regulation of the pathogenic mechanisms that lead to Aβ plaque formation by a dual mechanism, with a direct and indirect effect on the amyloid precusor protein (APP) processing pathway. On one hand, it interacts with APP by promoting its ubiquitination, thus regulating APP turnover within neurons; on the other hand, it indirectly regulates APP processing by promoting BACE1 degradation. Reduced UCH-L1 expression results in higher levels of APP and BACE1 levels, thereby creating the ideal conditions for the generation of amyloid plaques (Created with BioRender.com, Created in BioRender. Guglielmotto, M. (2025) https://BioRender.com/tksi419 Figure 2 UCH-L1 strictly regulates protein homeostasis in the brain, including tau protein stability and phosphorylation levels. Under physiological conditions, UCH-L1 preserves tau solubility and prevents its pathological phosphorylation. In AD and other tauopathies, lower UCH-L1 levels contribute to protein misfolding, thus promoting the formation of NFTs, which ultimately lead to synaptic dysfunction and progressive neuronal loss (Created with BioRender.com, Guglielmotto, M. (2025) https://BioRender.com/egzowmu Figure 3 UCH-L1 is the most abundant protein in neuronal cells, hence the wide range of processes this protein is involved in, mainly affecting neuroinflammation and synaptic processes. Generally, NDMAR-driven stimulation of synaptic activity significantly upregulates UCH-L1 activity and promotes free monomeric ubiquitin, necessary for correct proteostasis. Indeed, UCH-L1 takes part in PKA-CREB signaling: rescuing UCH-L1 depletion repristinates PKA-regulatory subunit IIα, promoting CREB phosphorylation, and ultimately synaptic plasticity maintenance, learning, and memory. UCH-L1 also interacts with the BDNF/TrkB pathway. Indeed, UCH-L1 participates in the ubiquitination of TrkB and the rescue of UCH-L1 restores the BDNF/TrkB cascade, which allows the maintenance of neuronal functionality. In parallel, UCH-L1 is tightly linked with neuroinflammatory signaling. UCH-L1 interacts with the NF-κB pathway, supporting a feed-forward loop which exacerbates inflammatory processes. Oxidative stress, which closely relates to neuroinflammation too, is also a crucial event linked to UCH-L1: on one hand, this enzyme plays a key scavenger role, on the other hand, when reactive oxygen species (ROS) production increases, UCH-L1 activity is compromised by oxidative damage itself. (Created with BioRender.com, Guglielmotto, M. (2025) https://BioRender.com/klk3wji ijms-26-09012-t001_Table 1 Table 1 Experimental evidence of UCH-L1 involvement in Alzheimer’s disease pathogenesis. Summary of key findings from post-mortem studies, animal models, and cell-based systems supporting the role of UCH-L1 in amyloid-beta and tau metabolism and synaptic function. Model/System Experimental Findings Human AD brain Proteomic and ICC studies 9 18 21 41 42 43 58 61  - ↓ soluble UCH-L1 in cortex/hippocampus - Redistribution in plaque-rich areas - Colocalization with NFTs Knockout mice (gad) UCH-L1-null 44 65  - ↑ Aβ accumulation, synaptic dysfunction, memory deficits APP/PS1, APP23/PS45 mice Overexpression or peptide restoration of UCH-L1 [ 39 40 49  - ↓ plaque burden, rescued LTP and memory Cell lines (HEK293, SH-SY5Y, N2a) siRNA knockdown/overexpression [ 40 48 57 59 60  - UCH-L1 loss → ↑ tau phosphorylation, aggregation - UCH-L1 gain → reduced Aβ and tau burden Aplysia and hippocampal slices UCH-L1 modulation [ 39 63 64  - Regulates PKA–CREB, synaptic plasticity, and memory formation The arrows provide a quick visual representation of the increase or decrease of the marker. ijms-26-09012-t002_Table 2 Table 2 Summary of the main roles of UCH-L1 in Alzheimer’s disease pathogenesis. The table highlights the contribution of UCH-L1 alterations to amyloid and tau pathology, synaptic dysfunction, and neuroinflammation/oxidative stress. AD Hallmark/ Main Findings Relevance to AD Amyloid-β plaques  - UCH-L1 promotes APP degradation and regulates BACE1 stability [ 39 40 41 43 44 48 49 - ↓ UCH-L1 → ↑ Aβ accumulation; overexpression/TAT-UCH-L1 reduces plaque burden [ 39 40  - Dysfunction of UCH-L1 accelerates amyloid pathology - Restoration counteracts Aβ load Tau protein and NFTs  - Loss/inhibition of UCH-L1 → ↑ tau phosphorylation and aggregation [ 57 59 60 - UCH-L1 colocalizes with NFTs in AD brain [ 21 58 61 - Soluble UCH-L1 inversely correlates with NFTs [ 21  - UCH-L1 maintains tau homeostasis - Dysfunction drives NFT accumulation Synaptic  - UCH-L1 regulates PKA–CREB [ 39 63 64 65 42 66 67 68 - Deficiency impairs LTP, memory, and plasticity; overexpression rescues synaptic function [ 39 40  - Reduced UCH-L1 activity contributes to cognitive decline in AD Neuroinflammation/  - UCH-L1 undergoes oxidation, nitrosylation, and carbonylation [ 20 21 22 23 24 - NF-κB suppresses UCH-L1 expression, fueling inflammation and amyloid accumulation [ 41 49 50 86 - UCH-L1 inhibition impairs NLRP3 inflammasome and cytokine production [ 87 88  - Oxidative damage and inflammatory signaling impair UCH-L1 - Amplifying neurodegeneration The arrows provide a quick visual representation of the increase or decrease of the marker. ",
  "metadata": {
    "Title of this paper": "Plasma ubiquitin C-terminal hydrolase L1 levels reflect disease stage and motor severity in Parkinson’s disease",
    "Journal it was published in:": "International Journal of Molecular Sciences",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12469994/"
  }
}