{
  "title": "Paper_243",
  "abstract": "pmc Res Health Serv Reg Res Health Serv Reg 4604 rhsr Research in Health Services & Regions 2730-9827 Springer PMC12491118 PMC12491118.1 12491118 12491118 41039095 10.1007/s43999-025-00075-z 75 1 Original Paper Educational differences in cancer incidence, stage at time of diagnosis, and survival in Norway http://orcid.org/0009-0006-9339-5997 Al-Shather Kenz KenzAlShather@gmail.com 1 2 Nilssen Yngvar 3 Larsen Inger Kristin 3 Hem Erlend 1 2 Bringedal Berit Horn 2 1 https://ror.org/01xtthb56 grid.5510.1 0000 0004 1936 8921 Department of Behavioural Medicine, Institute of Basic Medical Sciences, Faculty of Medicine, University of Oslo, 2 https://ror.org/022w6y159 grid.457609.9 0000 0000 8838 7932 Institute for Studies of the Medical Profession, 3 https://ror.org/03sm1ej59 grid.418941.1 0000 0001 0727 140X Department of Registration, Cancer Registry of Norway, 3 10 2025 12 2025 4 481483 15 3 6 2025 15 9 2025 03 10 2025 04 10 2025 04 10 2025 © The Author(s) 2025 2025 https://creativecommons.org/licenses/by/4.0/ Open Access http://creativecommons.org/licenses/by/4.0/ Aim The study investigates differences in cancer incidence, stage, and survival between municipalities with varying levels of education in Norway. It replicates the design of a similar study conducted in Oslo to assess whether similar patterns are present nationwide. Method We used aggregated data from the Cancer Registry of Norway (2014–2023) to calculate age-standardized incidence rates, stage at diagnosis, and five-year relative survival for colon, rectal, lung, melanoma, breast, and prostate cancer across municipalities. Municipalities were grouped by educational level (low, medium, high), and outcomes were compared. Results The study included 191,213 cases. Age-standardized incidence rates (per 100,000 person-years) differed significantly by education for all cancer types except breast cancer ( p p p p p p p Conclusion Cancer incidence, stage, and survival varied between municipalities grouped by inhabitants’ educational level. Findings align with those of the Oslo study, highlighting consistent education-related disparities in cancer outcomes nationwide. Supplementary Information The online version contains supplementary material available at 10.1007/s43999-025-00075-z. Keywords Cancer incidence Cancer stage at diagnosis Cancer survival Social inequality Health inequality Norway University of Oslo (incl Oslo University Hospital) Open access funding provided by University of Oslo (incl Oslo University Hospital) pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement yes pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes issue-copyright-statement © Zentralinstitut für die kassenärztliche Versorgung in der Bundesrepublik Deutschland 2025 Introduction Since 2017, cancer has been the leading cause of death in Norway [ 1 2 3 4 4 1 Despite efforts to prevent inequalities in cancer care, evidence suggests that social disparities persist in Norway. A recent OECD report on European countries found that groups with lower education were less likely to receive screening, had a higher prevalence of major cancer risk factors, and had higher cancer mortality [ 5 6 8 9 11 While substantial research has been conducted on cancer inequalities in Norway, previous studies have often focused only on a few specific cancer sites or examined cancer incidence, stage at diagnosis, and survival independently rather than together [ 6 8 9 11 In this study, we use education as a measure of socioeconomic status. While other features of municipalities, such as average income, the share of immigrants, and poverty rates, also influence local living conditions relevant to health, educational level is especially relevant in understanding cancer disparities because it often reflects differences in health literacy and risk behaviors [ 12 18 19 This study examines education at the municipal level. While most prior research uses individual-level data, studying municipalities may reveal insights not apparent at the individual level. Municipalities vary in health knowledge, social norms, and quality of primary health services. These differences might affect patient behavior, healthcare access, and cancer outcomes. Although aggregate measures do not replace individual analyses, they may offer valuable insight into contextual influences on cancer outcomes. A recent study in Oslo examined educational disparities in cancer outcomes at the district level. Districts with higher educational levels had increased incidences of breast, melanoma, and prostate cancers. Districts with lower educational levels had a higher incidence of lung cancer [ 20 20 20 Our study examines educational differences between municipalities. This allows us to compare the results with the findings from Oslo to investigate whether similar patterns exist on a national level. Municipalities were chosen instead of counties because they are responsible for primary health care, public health measures, and welfare services locally in Norway. We therefore assumed that access to health care would be more homogeneous within these units than if we had used counties as the units of analysis. While the Oslo study provided important insights into disparities in an urban area it is still unclear whether this represents a general pattern, or whether these disparities are specific to Oslo. Oslo’s population and healthcare system may not fully represent the entire country. It has the highest population density in Norway [ 21 22 23 Methods Study sample and data sources This is a registry-based study that included the most common cancer sites diagnosed in the period from 1 January 2014 to 31 December 2023. The cases were identified using the Cancer Registry of Norway (CRN), and the following cancer sites were included: colon (C18), rectum (C19–20), lung (C33–34), melanoma (C43), breast (C50), and prostate (C61) cancer. All cases were identified according to the International Classification of Diseases and Related Health Problems (ICD-10). Cancer stage at diagnosis was classified into localized, where cancer remains only in the organ it started in; regional, where cancer has grown into nearby organs, structures, or lymph nodes; and distant, indicating the spread of cancer to distant lymph nodes or distant parts of the body; and unknown, where no information about the stage was available. The categories were based on the American National Cancer Institute (NCI) Surveillance, Epidemiology, and End Results (SEER) Summary Staging system. This classification is often used for statistical purposes and facilitates long-term comparisons [ 24 In addition to patient and tumor characteristics like date of diagnosis, stage at diagnosis, and date of death, we also obtained patients’ place of residence through the CRN. The CRN was established in 1952 and has since 1953 systematically registered nationwide cancer data. Mandatory reporting by healthcare providers ensures nearly complete data coverage, with a completeness rate of 98.7% for 2019–2023 [ 25 Despite the possibility of studying this over a longer timeframe, we chose to restrict the analysis to a ten-year period. A longer period would make interpretations more difficult, since changes in cancer treatments and diagnostics over time influence outcomes in ways that are hard to account for. On the other hand, looking at a shorter period would increase the risk of random year-to-year variations affecting the results. By selecting a ten-year period, we aim to reduce the impact of changes in cancer care while ensuring that the timeframe is long enough to minimize the influence of random variation. Norway’s population is about 5.6 million [ 26 27 The educational level was based on the percentage of municipal residents with more than four years of college or university education. We used this to categorize municipalities into low-, mid-, and high-educational levels, setting the cut-off points at the 33rd and 66th percentiles. In high-education municipalities, more than 6.9% of residents had more than four years of higher education, while in mid-education municipalities, this ranged between 5.2% and 6.9%. In low-education municipalities, less than 5.2% of residents had more than four years of higher education. Data on the educational level in the municipalities for 2023 was obtained from Statistics Norway [ 28 Statistical analysis Incidence rates were adjusted for age using direct age standardization by applying a weighted average of the rates observed across 18 distinct age brackets (0–4, 5–9, …, 85+). The weights were based on the age distribution of the Norwegian population in 2014. The age-standardized incidence rate for all the cancer types was calculated for the three education areas and is reported as cases per 100,000 person-years. To assess whether incidence rates differed significantly across municipalities based on proportion of high education, we fitted a Poisson regression model with the number of cancer cases as the dependent variable and educational level as the main independent variable. Population size was included as an offset term to account for differences in exposure time across groups. An overall difference in incidence rates between groups was evaluated using a likelihood ratio test. Differences in stage at diagnosis across educational groups were assessed using Pearson’s chi-square test. Relative survival was estimated using flexible parametric survival models, with restricted cubic splines for the baseline cumulative hazard function, implemented via the stpm3 framework [ 29 Results The study included 191,213 cancer cases registered between 1 January 2014 and 31 December 2023. This consists of 31,270 cases of colon cancer (16.4%), 14,034 cases of rectal cancer (7.3%), 33,401 cases of lung cancer (17.5%), 23,910 cases of melanoma (12.5%), 36,826 cases of breast cancer (19.3%), and 51,772 cases of prostate cancer (27.1%). In Norway, 12.0% of residents over the age of 16 had more than four years of higher education in 2023. Municipal educational levels ranged from 2.7% to 24.1%, with a mean of 6.7%. Urban areas with universities and job opportunities for higher education individuals rank high in education levels. In contrast, less central locations with economies centered around industries that do not require high levels of education rank lower. Table 1  Table 1 Table presenting the total number of residents, cancer cases, municipalities, and basic demographic characteristics across the three educational categories. Municipalities were grouped by educational level (low, medium, high) based on the percentage of the population with more than four years of higher education: low (≤ 5.2%), mid (5.2–6.9%), high (6.9–24.1%). Population numbers are based on the 2023 mid-year population from the cancer registry of Norway, calculated as the mean of the population size on 1 January 2023 and 1 January 2024 Municipality group Low Mid High N 20,126 (10.5%) 39,918 (20.9%) 131,169 (68.6%) ICD10gr Colon 3,360 (16.7%) 6,795 (17.0%) 21,115 (16.1%) Rectum 1,574 (7.8%) 2,983 (7.5%) 9,477 (7.2%) Lung 4,032 (20.0%) 7,436 (18.6%) 21,933 (16.7%) Melanoma of the skin 2,092 (10.4%) 4,365 (10.9%) 17,453 (13.3%) Breast 3,312 (16.5%) 6,978 (17.5%) 26,536 (20.2%) Prostate 5,756 (28.6%) 11,361 (28.5%) 34,655 (26.4%) Age at diagnosis 69.3 (12.0) 68.7 (12.3) 67.9 (12.9) Sex Females 8,537 (42.4%) 17,271 (43.3%) 60,786 (46.3%) Males 11,589 (57.6%) 22,647 (56.7%) 70,383 (53.7%) Number of municipalities 110 123 123 Urban (%)* >=80% 2,516 (12.5%) 9,342 (23.4%) 112,539 (85.8%) 20%-80% 16,353 (81.3%) 29,872 (74.8%) 18,306 (14.0%) <20% 1,257 (6.2%) 704 (1.8%) 324 (0.2%) Population 479,065 1,040,108 4,000,421 * Urban classification based on Statistics Norway’s (SSB) definition of urban settlement [ 52 Incidence Table 2 p p  Table 2 Age-standardized incidence rate per 100,000 person-years in the low-, mid-, and high-education areas for all included cancer types (95% confidence interval in parentheses). Municipalities were grouped by educational level (low, medium, high) based on the percentage of the population with more than four years of higher education: low (≤ 5.2%), mid (5.2–6.9%), high (6.9–24.1%). Overall p Low-education areas Mid-education areas High-education areas p  Colon cancer 54.5 (52.7–56.4) 56.6 (55.3–58.0) 54.7 (54.0–55.5) p  Rectal cancer 25.9 (24.6–27.2) 25.2 (24.3–26.3) 24.5 (24.0–25.0) p  Lung cancer 64.4 (62.4–66.5) 61.0 (59.6–62.4) 56.3 (55.6–57.1) p  Melanoma of the skin 36.9 (35.3–38.6) 38.1 (37.0–39.3) 45.2 (44.6–45.9) p  Breast cancer 120.3 (116.1–124.6) 124.0 (121.1–127.0) 135.6 (134.0–137.2) p  Prostate cancer 191.5 (186.5–196.6) 194.6 (191.0–198.3) 189.8 (187.8–191.9) p Colon cancer rates were similar across educational levels (54.5 for low, 56.6 for mid, and 54.7 for high); rectal cancer rates also show a similar pattern (25.9 for low, 25.2 for mid, and 24.5 for high). Prostate cancer rates were consistently high across all education levels (191.5 for low, 194.6 for mid, and 189.8 for high). For lung cancer, the incidence rate decreases with higher educational levels, showing a negative gradient (64.4 for low, 61.0 for mid, and 56.3 for high). Incidence rates for both melanoma and breast cancer show a positive gradient with increasing education levels. Melanoma incidence rates rise from 36.9 in low-education areas to 38.1 in mid and 45.2 in high. Similarly, breast cancer rates were higher in mid- and high-education areas (120.3 for low, 124.0 for mid, and 135.6 for high). Stage at time of diagnosis As shown in Fig. 1  Fig. 1 Percentage of cancer cases diagnosed at the localized, regional, distant, or unknown stage for the different cancer types from 2014–2023, categorized by educational level (low, mid, and high). Overall p 1 At the same time, the proportion of patients diagnosed at a localized stage was generally higher in the mid- or high-education areas, as seen in colon cancer (18.4% in the high-education areas) and breast cancer (55.8% in the mid-education areas). However, we observed an exception for melanoma, where the low-education areas had the highest proportion of patients diagnosed at a localized stage. Regional spread shows mixed trends, peaking in those with medium or high education, except for colon cancer, which was highest in the low-education areas. Statistical testing indicated that education was significantly associated with stage at diagnosis only for lung cancer ( p p Survival The results show only minor differences in five-year relative survival between educational areas for most cancer types (Table 3 2 p  Table 3 Five-year relative survival (95% confidence interval in parentheses) by educational level, unadjusted and adjusted for age, sex, urban/rural residence, and stage at diagnosis. Municipalities were grouped by educational level (low, medium, high) based on the percentage of the population with more than four years of higher education: low (≤ 5.2%), mid (5.2–6.9%), high (6.9–24.1%). Overall p Cancer type Unadjusted five-year survival (95% CI) Adjusted five-year survival p Low Mid High Low Mid High  Colon 68(66-70.2) 69.6(68.1–71.1) 70.1(69.3–71) 69.3(67.8–70.9) 69.9(68.8–71.1) 70(69.3–70.7) 0,746  Rectal 71.2(68.2–74.2) 74.1(72-76.3) 75(73.8–76.2) 73.7(71.5–76.1) 73.9(72.1–75.6) 75.2(74.1–76.3) 0,355  Lung 27(25.5–28.6) 27.7(26.5–28.9) 29(28.2–29.7) 27.6(26.5–28.9) 28(27.1–29) 28.8(28.2–29.4) 0,175  Melanoma of the skin 93.8(92.1–95.5) 94.1(93-95.3) 94.9(94.3–95.4) 94.2(92.9–95.4) 94.5(93.6–95.3) 94.9(94.4–95.4) 0,518  Breast 91.9(90.6–93.2) 93.3(92.5–94.2) 94.2(93.8–94.6) 91.4(90.2–92.6) 92.4(91.5–93.2) 93(92.5–93.4) 0,037  Prostate 96.3(95.3–97.3) 97.4(96.7–98) 97.6(97.2–98) 94.4(93.8–95.1) 95(94.5–95.5) 95.1(94.8–95.4) 0,196  Fig. 2 Unadjusted relative survival up to five years after diagnosis for colon, rectal, lung, melanoma of the skin, breast, and prostate cancer, stratified by educational level (low, mid, high) For colon cancer, the adjusted five-year survival was 69.6% in the low-education areas compared to 70.9% in the high-education areas. For rectal cancer, survival was 73.7% in the low-education areas and 75.0% in the high-education areas. Lung cancer patients had a survival rate of 27.6% in the low-education areas and 28.8% in the high-education areas. For melanoma of the skin, the adjusted five-year survival was 94.2% in the low-education areas and 94.9% in the high-education areas. For prostate cancer, survival was 94.4% in the low-education areas and 95.1% in the high-education areas. Breast cancer patients had survival rates of 91.4% in the low-education areas and 93.0% in the high-education areas. This difference between the educational groups was statistically significant ( p p Discussion This study indicates that educational disparities in cancer incidence vary by cancer site. Melanoma and breast cancer have a higher incidence in high-education areas, while lung cancer shows a lower incidence in high-education areas. Colon, rectal, and prostate cancer rates show small absolute differences across education groups were small, yet statistically significant. Educational differences in stage at diagnosis and survival were more consistent across the different cancer sites, with generally worse outcomes in low-education areas. Although the differences were not statistically significant for most cancer types, data analysis over a 10-year period underscores their consistency. The findings highlight a consistent trend of lower survival rates for patients in low-education areas, underscoring the potential impact of educational level on cancer outcomes. Overall, the patterns observed in incidence, stage at diagnosis, and survival were consistent with those reported in the Oslo study. This study showed a higher incidence rate of breast cancer and melanoma in high-education areas, although the difference for breast cancer was not statistically significant. The same patterns have been reported in previous studies [ 7 20 6 30 31 32 33 34 Furthermore, studies have also shown that patients with lower educational levels have lower adherence to breast cancer screening [ 35 36 37 38 20 39 Previous studies have also found similar incidence rates of colon and rectal cancer between different educational levels [ 20 39 20 39 42 43 44 Furthermore, previous studies have indicated that lower socioeconomic status correlates with later diagnosis stages [ 20 45 p p 17 17 Lastly, we also found lower survival for all cancer types in the low-education areas, similar to findings from previous studies [ 20 46 47 20 48 49 The patterns observed in this study may also be explained by the fact that education was measured at the municipal level rather than the individual level. One might speculate that cancer outcomes are shaped by the community’s educational profile, not just a person’s own education. For example, people with low education in municipalities with high educational attainment may benefit from greater availability of preventive services. They may also benefit from stronger social norms around healthcare use. A previous Norwegian study found that patients who live in a municipality where the average educational level is high have a better cancer prognosis than others [ 50 51 Overall, this study found that municipalities with lower educational attainment consistently had lower survival rates for the six most prevalent cancer types in Norway, regardless of cancer incidence. It also showed that low-education municipalities had the highest proportion diagnosed at advanced stages for melanoma of the skin, colon, rectal, breast, and prostate cancer. This study corresponds with the findings in the Oslo study, providing further evidence of education-related disparities in cancer outcomes. Similar patterns were observed regarding cancer incidence, stage at diagnosis, and survival both in Oslo and Norway. This consistency across Norway suggests that these disparities are not isolated to urban areas like Oslo and may indicate systemic issues within healthcare accessibility and education-related inequities nationwide. Strengths and limitations This study is strengthened by the near-complete (98.7%) nationwide coverage of cancer diagnoses from the Cancer Registry of Norway. However, these findings should be interpreted in light of their limitations. Since we used aggregated data, we could not include information about comorbidities, transport time to the nearest hospital or primary care physician, or other factors that may influence cancer outcomes. This may have affected the results for incidence, stage, and survival. The study identifies correlations, but several potential confounding variables could not be controlled for. Data aggregation can also mask individual-level variations and potentially lead to loss of important information. For example, while a municipality may have a high average educational level, individuals within that municipality with lower education may still experience poorer health outcomes. We did not have access to data on individual-level education due to data protection restrictions. Therefore, we cannot separate the effect of living in a high- or low-education municipality from the effect of an individual’s own education. This may complicate the interpretation of the results. Although aggregate data carries the risk of ecological fallacy and cannot fully account for within-municipality heterogeneity, it provides relevant insights into community-level disparities. Examining both the individual and aggregate level in future studies could provide a more complete understanding of educational differences in cancer outcomes. Focusing on a recent period ensures consistency in cancer treatment protocols and minimizes random year-to-year variations. However, it limits our ability to capture long-term trends in cancer outcomes. Given that data on educational level have been available since 1970, an analysis over a longer period could provide valuable insights into how social inequalities in cancer have evolved. Implications and interpretations This study highlights the correlation between educational level and cancer outcomes. Our findings are similar to those of a previous study conducted in Oslo, which showed that the low-education areas had higher lung cancer incidence, lower five-year relative survival rates overall, and a greater proportion of distant-stage diagnoses for most cancer types. This similarity highlights the consistency of the results in the current study. The association between lower educational level, a higher proportion diagnosed at late stages, and poorer survival outcomes suggest possible barriers faced by those in the low-education areas. These barriers may include limited access to healthcare, lower health literacy, and/or challenges in accessing or utilizing preventive care and cancer screening services. Higher education was linked to earlier diagnoses and better survival rates, possibly reflecting greater health awareness, better health-seeking behavior, and easier access to healthcare. The variations in cancer incidence may suggest differences in risk factors, genetic predisposition, and lifestyle. Addressing cancer disparities will require public health strategies that tackle the root causes of the inequalities. For instance, underserved communities with lower educational attainment may benefit from better access to cancer screening, preventive care, and health education campaigns. Disparities can also be maintained, enforced or reduced at the clinical level. However, the evidence base remains insufficient for reliable decision-making. Future research should focus on uncovering factors that perpetuate these disparities, such as differences in healthcare infrastructure and cultural influence on health-seeking behavior. Supplementary Information Below is the link to the electronic supplementary material.  Supplementary Material 1 Publisher’s note Springer Nature remains neutral with regard to jurisdictional claims in published maps and institutional affiliations. Acknowledgements The authors would like to thank the Research Council of Norway for the grant, and the Medical Faculty at the University of Oslo for research funds. Author contributions All authors contributed to the study conception and design. Yngvar Nilssen prepared and analyzed the data. Kenz Al-Shather wrote the first draft of the manuscript, and all authors commented on previous versions. All authors read and approved the final manuscript. Funding Open access funding provided by University of Oslo (incl Oslo University Hospital). Author Kenz Al-Shather has received a research grant from The Research Council of Norway through its Medical Student Research Program at the University of Oslo (grant number 271555/F20). Author Yngvar Nilssen, Inger Kristin Larsen, Erlend Hem, and Berit Horn Bringedal declare they have no financial interests. Data availability Data underlying this article can be requested from the Cancer Registry of Norway through https://helsedata.no Declarations Ethics approval and consent to participate The project used aggregate register data with no personal information that could be linked to patients and was therefore not submitted to the Regional Committees for Medical and Health Research Ethics neither did it require a license from the Data Inspectorate to process sensitive personal data. Competing interests No competing interests. References 1. OECD EU country cancer profile: Norway 2023 2023 Paris OECD Publishing OECD (2023) EU country cancer profile: Norway 2023. OECD Publishing, Paris. 10.1787/0fcf5d28-en 2. Sørlie MS Sveen KA Raknes G Slungård GF Reistad SR Dødsårsaker i Norge 2023 [Causes of death in Norway 2023] 2024 Norway Norwegian Institute of Public Health Sørlie MS, Sveen KA, Raknes G, Slungård GF, Reistad SR (2024) Dødsårsaker i Norge 2023 [Causes of death in Norway 2023]. Norwegian Institute of Public Health, Norway 3. Global cancer burden growing, amidst mounting need for services (2024) Press relase No. 345. [press release]. World Health Organization, International Agency for Resarch on Cancer 4. Tikkanen R, Osborn R, Mossialos E, Djordjevic A, Wharton G The Commonwealth Fund: International Health Care System Profiles, Norway. [updated Jun 5 2020. Available from: https://www.commonwealthfund.org/international-health-policy-center/countries/norway 5. (2024) Beating cancer inequalities in the EU: spotlight on cancer prevention and early detection. OECD Health Policy Studies. 10.1787/14fdc89a-en 6. Larsen IK Myklebust T Babigumira R Vinberg E Møller B Ursin G Education, income and risk of cancer: results from a Norwegian registry-based study Acta Oncol 2020 59 11 1300 1307 10.1080/0284186x.2020.1817548 32924698 Larsen IK, Myklebust T, Babigumira R, Vinberg E, Møller B, Ursin G (2020) Education, income and risk of cancer: results from a Norwegian registry-based study. Acta Oncol 59(11):1300–1307. 10.1080/0284186x.2020.1817548 32924698 10.1080/0284186X.2020.1817548 7. Mihor A Tomsic S Zagar T Lokar K Zadnik V Socioeconomic inequalities in cancer incidence in europe: a comprehensive review of population-based epidemiological studies Radiol Oncol 2020 54 1 1 13 10.2478/raon-2020-0008 32074075 PMC7087422 Mihor A, Tomsic S, Zagar T, Lokar K, Zadnik V (2020) Socioeconomic inequalities in cancer incidence in europe: a comprehensive review of population-based epidemiological studies. Radiol Oncol 54(1):1–13. 10.2478/raon-2020-0008 32074075 10.2478/raon-2020-0008 PMC7087422 8. Pizzato M Martinsen JI Heikkinen S Vignat J Lynge E Sparén P Socioeconomic status and risk of lung cancer by histological subtype in the nordic countries Cancer Med 2022 11 8 1850 1859 10.1002/cam4.4548 35166068 PMC9041078 Pizzato M, Martinsen JI, Heikkinen S, Vignat J, Lynge E, Sparén P et al (2022) Socioeconomic status and risk of lung cancer by histological subtype in the nordic countries. Cancer Med 11(8):1850–1859. 10.1002/cam4.4548 35166068 10.1002/cam4.4548 PMC9041078 9. Nilssen Y Eriksen MT Guren MG Møller B Factors associated with emergency-onset diagnosis, time to treatment and type of treatment in colorectal cancer patients in Norway BMC Cancer 2021 21 1 757 10.1186/s12885-021-08415-1 34187404 PMC8244161 Nilssen Y, Eriksen MT, Guren MG, Møller B (2021) Factors associated with emergency-onset diagnosis, time to treatment and type of treatment in colorectal cancer patients in Norway. BMC Cancer 21(1):757. 10.1186/s12885-021-08415-1 34187404 10.1186/s12885-021-08415-1 PMC8244161 10. Nilssen Y Brustugun OT Møller B Factors associated with emergency-related diagnosis, time to treatment and type of treatment in 5713 lung cancer patients Eur J Public Health 2021 31 5 967 974 10.1093/eurpub/ckab071 34233351 PMC8565486 Nilssen Y, Brustugun OT, Møller B (2021) Factors associated with emergency-related diagnosis, time to treatment and type of treatment in 5713 lung cancer patients. Eur J Public Health 31(5):967–974. 10.1093/eurpub/ckab071 34233351 10.1093/eurpub/ckab071 PMC8565486 11. Nilssen Y Strand TE Fjellbirkeland L Bartnes K Brustugun OT O’Connell DL Lung cancer treatment is influenced by income, education, age and place of residence in a country with universal health coverage Int J Cancer 2016 138 6 1350 1360 10.1002/ijc.29875 26421593 Nilssen Y, Strand TE, Fjellbirkeland L, Bartnes K, Brustugun OT, O’Connell DL et al (2016) Lung cancer treatment is influenced by income, education, age and place of residence in a country with universal health coverage. Int J Cancer 138(6):1350–1360. 10.1002/ijc.29875 26421593 10.1002/ijc.29875 12. Droomers M Westert GP Do lower socioeconomic groups use more health services, because they suffer from more illnesses? Eur J Public Health 2004 14 3 311 313 10.1093/eurpub/14.3.311 15369040 Droomers M, Westert GP (2004) Do lower socioeconomic groups use more health services, because they suffer from more illnesses? Eur J Public Health 14(3):311–313. 10.1093/eurpub/14.3.311 15369040 10.1093/eurpub/14.3.311 13. Grosse FK Eikemo TA Von dem Knesebeck O Education and self-reported health care seeking behaviour in European welfare regimes: results from the European social survey Int J Public Health 2010 55 3 217 220 10.1007/s00038-009-0073-3 19763393 Grosse FK, Eikemo TA, Von dem Knesebeck O (2010) Education and self-reported health care seeking behaviour in European welfare regimes: results from the European social survey. Int J Public Health 55(3):217–220. 10.1007/s00038-009-0073-3 19763393 10.1007/s00038-009-0073-3 14. Pampel FC, Krueger PM, Denney JT (2010) Socioeconomic disparities in health behaviors. Annu Rev Sociol 36. 10.1146/annurev.soc.012809.102529. :349 – 70 10.1146/annurev.soc.012809.102529 PMC3169799 21909182 15. Wamala S Merlo J Bostrom G Hogstedt C Agren G Socioeconomic disadvantage and primary non-adherence with medication in Sweden Int J Qual Health Care 2007 19 3 134 140 10.1093/intqhc/mzm011 17449480 Wamala S, Merlo J, Bostrom G, Hogstedt C, Agren G (2007) Socioeconomic disadvantage and primary non-adherence with medication in Sweden. Int J Qual Health Care 19(3):134–140. 10.1093/intqhc/mzm011 17449480 10.1093/intqhc/mzm011 16. Glazier RH Agha MM Moineddin R Sibley LM Universal health insurance and equity in primary care and specialist office visits: a population-based study Ann Fam Med 2009 7 5 396 405 10.1370/afm.994 19752467 PMC2746511 Glazier RH, Agha MM, Moineddin R, Sibley LM (2009) Universal health insurance and equity in primary care and specialist office visits: a population-based study. Ann Fam Med 7(5):396–405. 10.1370/afm.994 19752467 10.1370/afm.994 PMC2746511 17. Kickbusch I, Pelikan JM, Apfel F, Tsouros AD, editors. Health literacy: the solid facts. Copenhagen: The World Health Organization, Regional Office for Europe; 2013. 18. Jansen T Rademakers J Waverijn G Verheij R Osborne R Heijmans M The role of health literacy in explaining the association between educational attainment and the use of out-of-hours primary care services in chronically ill people: a survey study BMC Health Serv Res 2018 18 1 394 10.1186/s12913-018-3197-4 29855365 PMC5984471 Jansen T, Rademakers J, Waverijn G, Verheij R, Osborne R, Heijmans M (2018) The role of health literacy in explaining the association between educational attainment and the use of out-of-hours primary care services in chronically ill people: a survey study. BMC Health Serv Res 18(1):394. 10.1186/s12913-018-3197-4 29855365 10.1186/s12913-018-3197-4 PMC5984471 19. Aaberge R Mogstad M Vestad OL Vestre A Økonomisk Ulikhet i Norge i Det 21. århundre (SSB analyse No. 2021/13) 2021 Oslo Statistisk Sentralbyrå Aaberge R, Mogstad M, Vestad OL, Vestre A (2021) Økonomisk Ulikhet i Norge i Det 21. århundre [Economic inequality in Norway in the 21st century] (SSB analyse No. 2021/13). Statistisk Sentralbyrå, Oslo. 20. Al-Rammahy A Fadum EA Nilssen Y Larsen IK Hem E Bringedal BH Educational disparities in cancer incidence, stage, and survival in Oslo Res Health Serv Reg 2024 3 1 1 10.1007/s43999-024-00037-x 39177868 PMC11281764 Al-Rammahy A, Fadum EA, Nilssen Y, Larsen IK, Hem E, Bringedal BH (2024) Educational disparities in cancer incidence, stage, and survival in Oslo. Res Health Serv Reg 3(1):1. 10.1007/s43999-024-00037-x 39177868 10.1007/s43999-024-00037-x PMC11281764 21. Statistics Norway 11342: Population and area, by region, contents and year (M) 2007–2025 2024 [Available from: https://www.ssb.no/statbank/table/11342/tableViewLayout1/ 22. Statistics Norway 09817: Immigrants and Norwegian-born to immigrant parents, by region, immigration category, contents, year and country background 2020–2023 2024 [Available from: https://www.ssb.no/en/statbank/table/09817/tableViewLayout1/ 23. Oslo Univeristy Hospital (2024) ; cited 2024 07.04.2025]. Available from: https://www.oslo-universitetssykehus.no/oslo-university-hospital#about-the-hospital 24. American Cancer Society Cancer Staging [updated Sept 10 2024. Available from: https://www.cancer.org/cancer/diagnosis-staging/staging.html 25. Larsen IK Møller B Johannesen TB Robsahm TE Larønningen S Seglem AH Cancer in Norway 2023 - Cancer incidence, mortality, survival and prevalence in Norway 2024 Oslo Cancer Registry of Norway. Norwegian Institute of Public Health Larsen IK, Møller B, Johannesen TB, Robsahm TE, Larønningen S, Seglem AH et al (2024) Cancer in Norway 2023 - Cancer incidence, mortality, survival and prevalence in Norway. Cancer Registry of Norway. Norwegian Institute of Public Health, Oslo 26. Statistics Norway Population: Statistics Norway; [updated Nov 20 2024. Available from: https://www.ssb.no/en/befolkning/folketall/statistikk/befolkning 27. Norwegian Ministry of Local Government and Regional Development. Kommunenes oppgaver finansiering og tjenesteproduksjon. [Municipal responsibilities, funding, and service provision] (2022) [Available from: https://www.regjeringen.no/no/dokumenter/nou-2022-10/id2925606/?ch=5#fn2 28. Statistics Norway 09429: Educational attainment, by municipality and sex (M) 1970–2023: Statistics Norway; [Available from: https://www.ssb.no/en/statbank/table/09429/ 29. Royston P, Lambert PC (2011) Flexible parametric survival analysis using stata: beyond the Cox model. Stata 30. Jiang R Wang X Sun Z Wu S Chen S Cai H Association of education level with the risk of female breast cancer: a prospective cohort study BMC Womens Health 2023 23 1 91 10.1186/s12905-023-02245-y 36882777 PMC9993575 Jiang R, Wang X, Sun Z, Wu S, Chen S, Cai H (2023) Association of education level with the risk of female breast cancer: a prospective cohort study. BMC Womens Health 23(1):91. 10.1186/s12905-023-02245-y 36882777 10.1186/s12905-023-02245-y PMC9993575 31. Kravdal Ø Rindfuss RR Changing relationships between education and fertility: A study of women and men born 1940 to 1964 Am Sociol Rev 2008 73 5 854 873 10.1177/000312240807300508 Kravdal Ø, Rindfuss RR (2008) Changing relationships between education and fertility: A study of women and men born 1940 to 1964. Am Sociol Rev 73(5):854–873. 10.1177/000312240807300508 32. Anderson KN Schwab RB Martinez ME Reproductive risk factors and breast cancer subtypes: a review of the literature Breast Cancer Res Treat 2014 144 1 1 10 10.1007/s10549-014-2852-7 24477977 PMC4026199 Anderson KN, Schwab RB, Martinez ME (2014) Reproductive risk factors and breast cancer subtypes: a review of the literature. Breast Cancer Res Treat 144(1):1–10. 10.1007/s10549-014-2852-7 24477977 10.1007/s10549-014-2852-7 PMC4026199 33. Nelson HD Zakher B Cantor A Fu R Griffin J O’Meara ES Risk factors for breast cancer for women aged 40 to 49 years Ann Intern Med 2012 156 9 635 648 10.7326/0003-4819-156-9-201205010-00006 22547473 PMC3561467 Nelson HD, Zakher B, Cantor A, Fu R, Griffin J, O’Meara ES et al (2012) Risk factors for breast cancer for women aged 40 to 49 years. Ann Intern Med 156(9):635–648. 10.7326/0003-4819-156-9-201205010-00006 22547473 10.1059/0003-4819-156-9-201205010-00006 PMC3561467 34. Dong J-Y Qin L-Q Education level and breast cancer incidence: a meta-analysis of cohort studies Menopause 2020 27 1 113 118 10.1097/gme.0000000000001425 31479033 Dong J-Y, Qin L-Q (2020) Education level and breast cancer incidence: a meta-analysis of cohort studies. Menopause 27(1):113–118. 10.1097/gme.0000000000001425 31479033 10.1097/GME.0000000000001425 35. Damiani G Basso D Acampora A Bianchi CB Silvestrini G Frisicale EM The impact of level of education on adherence to breast and cervical cancer screening: evidence from a systematic review and meta-analysis Prev Med 2015 81 281 289 10.1016/j.ypmed.2015.09.011 26408405 Damiani G, Basso D, Acampora A, Bianchi CB, Silvestrini G, Frisicale EM et al (2015) The impact of level of education on adherence to breast and cervical cancer screening: evidence from a systematic review and meta-analysis. Prev Med 81:281–289. 10.1016/j.ypmed.2015.09.011 26408405 10.1016/j.ypmed.2015.09.011 36. Le M Hofvind S Tsuruda K Braaten T Bhargava S Lower attendance rates in breastscreen Norway among immigrants across all levels of socio-demographic factors: a population-based study J Public Health 2019 27 2 229 240 10.1007/s10389-018-0937-1 Le M, Hofvind S, Tsuruda K, Braaten T, Bhargava S (2019) Lower attendance rates in breastscreen Norway among immigrants across all levels of socio-demographic factors: a population-based study. J Public Health 27(2):229–240. 10.1007/s10389-018-0937-1 37. Mueller AM Goessinger EV Cerminara SE Kostner L Amaral M Huber SM Educational level-dependent melanoma awareness in a high-risk population in Switzerland Front Oncol 2023 13 1174542 10.3389/fonc.2023.1174542 37207151 PMC10189064 Mueller AM, Goessinger EV, Cerminara SE, Kostner L, Amaral M, Huber SM et al (2023) Educational level-dependent melanoma awareness in a high-risk population in Switzerland. Front Oncol 13:1174542. 10.3389/fonc.2023.1174542 37207151 10.3389/fonc.2023.1174542 PMC10189064 38. Elwood JM Jopson J Melanoma and sun exposure: an overview of published studies Int J Cancer 1997 73 2 198 203 10.1002/(sici)1097-0215(19971009)73:2&#x0003c;198::aid-ijc6&#x0003e;3.0.co;2-r 9335442 Elwood JM, Jopson J (1997) Melanoma and sun exposure: an overview of published studies. Int J Cancer 73(2):198–203. 10.1002/(sici)1097-0215(19971009)73:2%3C198::aid-ijc6%3E3.0.co;2-r 9335442 10.1002/(sici)1097-0215(19971009)73:2<198::aid-ijc6>3.0.co;2-r 39. Vinberg E, Karlsson L, Møller B, Ursin G, Larsen IK (2019) Special issue 2018: social inequality, immigration and cancer – A report on cancer incidence by country of origin, education, income and place of residence. [Sosiale ulikheter, innvandring Og kreft – En rapport Om Kreftforekomst Etter landbakgrunn, utdanning, Inntekt Og bosted]. Cancer Registry of Norway, Oslo 40. Sidorchuk A Agardh EE Aremu O Hallqvist J Allebeck P Moradi T Socioeconomic differences in lung cancer incidence: a systematic review and meta-analysis Cancer Causes Control 2009 20 4 459 471 10.1007/s10552-009-9300-8 19184626 Sidorchuk A, Agardh EE, Aremu O, Hallqvist J, Allebeck P, Moradi T (2009) Socioeconomic differences in lung cancer incidence: a systematic review and meta-analysis. Cancer Causes Control 20(4):459–471. 10.1007/s10552-009-9300-8 19184626 10.1007/s10552-009-9300-8 41. Redondo-Sánchez D, Petrova D, Rodríguez-Barranco M, Fernández-Navarro P, Jiménez-Moleón JJ, Sánchez MJ (2022) Socio-Economic inequalities in lung cancer outcomes: an overview of systematic reviews. Cancers (Basel) 14(2). 10.3390/cancers14020398 10.3390/cancers14020398 PMC8773607 35053559 42. Tetzlaff F Nowossadeck E Jansen L Michalski N Barnes B Kraywinkel K Widening area-based socioeconomic inequalities in cancer mortality in Germany between 2003 and 2019 Sci Rep 2023 13 1 17833 10.1038/s41598-023-45254-5 37857781 PMC10587166 Tetzlaff F, Nowossadeck E, Jansen L, Michalski N, Barnes B, Kraywinkel K et al (2023) Widening area-based socioeconomic inequalities in cancer mortality in Germany between 2003 and 2019. Sci Rep 13(1):17833. 10.1038/s41598-023-45254-5 37857781 10.1038/s41598-023-45254-5 PMC10587166 43. Silventoinen K Piirtola M Jelenkovic A Sund R Tarnoki AD Tarnoki DL Smoking remains associated with education after controlling for social background and genetic factors in a study of 18 twin cohorts Sci Rep 2022 12 1 13148 10.1038/s41598-022-17536-x 35909142 PMC9339539 Silventoinen K, Piirtola M, Jelenkovic A, Sund R, Tarnoki AD, Tarnoki DL et al (2022) Smoking remains associated with education after controlling for social background and genetic factors in a study of 18 twin cohorts. Sci Rep 12(1):13148. 10.1038/s41598-022-17536-x 35909142 10.1038/s41598-022-17536-x PMC9339539 44. Giskes K Kunst AE Benach J Borrell C Costa G Dahl E Trends in smoking behaviour between 1985 and 2000 in nine European countries by education J Epidemiol Community Health 2005 59 5 395 401 10.1136/jech.2004.025684 15831689 PMC1733079 Giskes K, Kunst AE, Benach J, Borrell C, Costa G, Dahl E et al (2005) Trends in smoking behaviour between 1985 and 2000 in nine European countries by education. J Epidemiol Community Health 59(5):395–401. 10.1136/jech.2004.025684 15831689 10.1136/jech.2004.025684 PMC1733079 45. Rosskamp M, Verbeeck J, Gadeyne S, Verdoodt F, De Schutter H (2021) Socio-Economic Position, cancer incidence and stage at diagnosis: A nationwide cohort study in Belgium. Cancers (Basel) 13(5). 10.3390/cancers13050933 10.3390/cancers13050933 PMC7956180 33668089 46. Hussain SK Lenner P Sundquist J Hemminki K Influence of education level on cancer survival in Sweden Ann Oncol 2008 19 1 156 162 10.1093/annonc/mdm413 17785761 Hussain SK, Lenner P, Sundquist J, Hemminki K (2008) Influence of education level on cancer survival in Sweden. Ann Oncol 19(1):156–162. 10.1093/annonc/mdm413 17785761 10.1093/annonc/mdm413 47. Vaccarella S Georges D Bray F Ginsburg O Charvat H Martikainen P Socioeconomic inequalities in cancer mortality between and within countries in europe: a population-based study Lancet Reg Health Eur 2023 25 100551 10.1016/j.lanepe.2022.100551 36818237 PMC9929598 Vaccarella S, Georges D, Bray F, Ginsburg O, Charvat H, Martikainen P et al (2023) Socioeconomic inequalities in cancer mortality between and within countries in europe: a population-based study. Lancet Reg Health Eur 25:100551. 10.1016/j.lanepe.2022.100551 36818237 10.1016/j.lanepe.2022.100551 PMC9929598 48. Crawford SM Sauerzapf V Haynes R Zhao H Forman D Jones AP Social and geographical factors affecting access to treatment of lung cancer Br J Cancer 2009 101 6 897 901 10.1038/sj.bjc.6605257 19690543 PMC2743361 Crawford SM, Sauerzapf V, Haynes R, Zhao H, Forman D, Jones AP (2009) Social and geographical factors affecting access to treatment of lung cancer. Br J Cancer 101(6):897–901. 10.1038/sj.bjc.6605257 19690543 10.1038/sj.bjc.6605257 PMC2743361 49. Zielinski A Borgquist L Halling A Distance to hospital and socioeconomic status influence secondary health care use Scand J Prim Health Care 2013 31 2 83 88 10.3109/02813432.2012.759712 23301541 PMC3656400 Zielinski A, Borgquist L, Halling A (2013) Distance to hospital and socioeconomic status influence secondary health care use. Scand J Prim Health Care 31(2):83–88. 10.3109/02813432.2012.759712 23301541 10.3109/02813432.2012.759712 PMC3656400 50. Kravdal Ø Does place matter for cancer survival in norway? A multilevel analysis of the importance of hospital affiliation and municipality socio-economic resources Health Place 2006 12 4 527 537 10.1016/j.healthplace.2005.08.005 16168701 Kravdal Ø (2006) Does place matter for cancer survival in norway? A multilevel analysis of the importance of hospital affiliation and municipality socio-economic resources. Health Place 12(4):527–537. 10.1016/j.healthplace.2005.08.005 16168701 10.1016/j.healthplace.2005.08.005 51. Kravdal O Mortality effects of average education: a multilevel study of small neighbourhoods in rural and urban areas in Norway Int J Equity Health 2009 8 41 10.1186/1475-9276-8-41 20003181 PMC2797775 Kravdal O (2009) Mortality effects of average education: a multilevel study of small neighbourhoods in rural and urban areas in Norway. Int J Equity Health 8:41. 10.1186/1475-9276-8-41 20003181 10.1186/1475-9276-8-41 PMC2797775 52. (SSB) SN Concept Variable Urban Settlement 2002 [Available from: https://www.ssb.no/a/metadata/conceptvariable/vardok/141/en?utm_source=chatgpt.com ",
  "metadata": {
    "Title of this paper": "Mortality effects of average education: a multilevel study of small neighbourhoods in rural and urban areas in Norway",
    "Journal it was published in:": "Research in Health Services & Regions",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12491118/"
  }
}