{
  "title": "Paper_43",
  "abstract": "pmc Sci Adv Sci Adv 2850 sciadv sciadv Science Advances 2375-2548 American Association for the Advancement of Science PMC12494012 PMC12494012.1 12494012 12494012 41042872 10.1126/sciadv.ady1640 ady1640 1 Research Article Biomedicine and Life Sciences SciAdv r-articles Cell Biology Stem Cells Cell Biology Single-cell atlas of cervical organoids uncovers epithelial immune heterogeneity and intercellular cross-talk during Chlamydia infection Single-cell insights into cervical epithelial immunity https://orcid.org/0000-0003-1754-6555 Prakash Pon Ganish Data curation Formal analysis Investigation Methodology Software Validation Visualization Writing - original draft Writing - review & editing  1  2 https://orcid.org/0000-0002-2026-0446 Kumar Naveen Formal analysis Investigation Methodology Validation Visualization Writing - original draft  1  2 https://orcid.org/0000-0001-8449-9985 Koster Stefanie Methodology  3 https://orcid.org/0009-0007-7405-756X Wentland Christian Data curation Formal analysis Investigation Visualization  1 Dhanraj Jayabhuvaneshwari Investigation Validation  1 https://orcid.org/0000-0001-6479-8080 Gurumuthy Rajendra Kumar Conceptualization Formal analysis Investigation Methodology Supervision Validation Writing - original draft Writing - review & editing  1  3 https://orcid.org/0000-0003-3290-5966 Chumduri Cindrilla Conceptualization Formal analysis Funding acquisition Investigation Methodology Project administration Resources Supervision Validation Writing - original draft Writing - review & editing  1  2  3 * 1 2 3 * cindrilla.chumduri@bce.au.dk 03 10 2025 03 10 2025 11 40 498113 eady1640 13 4 2025 02 9 2025 03 10 2025 04 10 2025 04 10 2025 Copyright © 2025 The Authors, some rights reserved; exclusive licensee American Association for the Advancement of Science. No claim to original U.S. Government Works. Distributed under a Creative Commons Attribution License 4.0 (CC BY). 2025 The Authors https://creativecommons.org/licenses/by/4.0/ This is an open-access article distributed under the terms of the Creative Commons Attribution license The uterine cervix is a critical mucosal interface that balances immune defense and reproductive function, yet how its distinct epithelial compartments coordinate responses to infection remains unclear. Here, we integrate patient-derived three-dimensional cervical organoids, single-cell transcriptomics, and native tissue analysis to construct a high-resolution atlas of epithelial cell diversity and immune dynamics during Chlamydia trachomatis Organoids and single-cell analysis uncover diverse cervical epithelial immune strategies to fight infection. http://dx.doi.org/10.13039/501100001659 Deutsche Forschungsgemeinschaft CRC 1583 http://dx.doi.org/10.13039/501100001659 Deutsche Forschungsgemeinschaft RTG 2157 http://dx.doi.org/10.13039/501100001659 Deutsche Forschungsgemeinschaft CH2527/2-1 http://dx.doi.org/10.13039/501100009708 Novo Nordisk Fonden NNF220C0077183 http://dx.doi.org/10.13039/501100009708 Novo Nordisk Fonden NNF23OC0086551 pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement yes pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes INTRODUCTION Epithelial cells form the frontline of defense across human organ systems, playing pivotal roles in tissue homeostasis, immune surveillance, and pathogen defense ( 1 2 3 4 6 The cervix is a primary entry point for sexually transmitted pathogens, including Chlamydia trachomatis 7 8 9 10 Traditional in vitro models, including immortalized cervical cell lines, have provided foundational insights into Chlamydia pathogenesis but lack the structural, cellular, and immunological complexity of the human cervix ( 11 12 13 14 15 Single-cell RNA sequencing (scRNA-seq) has revolutionized our ability to dissect epithelial complexity and cellular responses at high resolution. When combined with 3D organoid systems, it enables comprehensive mapping of epithelial differentiation trajectories, infection-induced remodeling, and intercellular communication networks ( 16 17 In this study, we leverage scRNA-seq and patient-derived ecto- and endocervical organoids to construct a high-resolution cellular atlas of cervical epithelial heterogeneity during Chlamydia infection. We validate the transcriptional fidelity of cervical organoids against native tissue and uncover distinct immune specializations of squamous and columnar epithelia. Upon infection, we observe profound transcriptional reprogramming in endocervical bystander cells, including interferon (IFN) activation, antimicrobial responses, and activation of antigen-presentation pathways. In contrast, ectocervical cells prioritize structural maintenance and regeneration, exhibiting restrained immune activation. Using ligand-receptor (L-R) interaction modeling, we show that infection rewires epithelial communication networks, with bystander cells emerging as key epithelial signaling node for immune coordination and regenerative signaling. Together, our work reveals a compartmentalized yet integrated epithelial defense architecture and offers a powerful platform to advance mechanistic understanding of host-pathogen interactions and epithelial remodeling in the FRT, with future potential to inform targeted therapeutic strategies. RESULTS Integrative scRNA-seq analysis of patient-derived cervical organoids and native tissue To investigate host-pathogen interactions and epithelial cellular dynamics in the cervix, we combined patient-derived cervical organoids with scRNA-seq. Organoids were generated from adult epithelial stem cells isolated from ecto- and endocervical tissues of healthy donors, expanded in lineage-specific cultures, and subsequently infected with green fluorescent protein (GFP)–labeled Chlamydia. Infected and uninfected cells were sorted using fluorescence-activated cell sorting (FACS), and high-throughput scRNA-seq was performed using the 10X Genomics platform, capturing epithelial states in both homeostasis and infection ( Fig. 1A Fig. 1. Experimental setup and single-cell characterization of the cervical epithelial landscape using patient-derived 3D organoids. ( A B C D E F G H I J K L M z We first examined uninfected organoids to explore epithelial heterogeneity under homeostatic conditions. Unsupervised clustering segregated ecto- and endocervical cells into two transcriptionally distinct clusters, reflecting their lineage specificity and functional divergence ( Fig. 1B Subclustering of the scRNA-seq data revealed six squamous epithelial subtypes from ectocervical organoids (O-Sq1A, O-Sq1B, O-Sq1C, O-Sq2A, O-Sq2B, and O-Sq3) and five columnar epithelial subpopulations from endocervical organoids (O-Co1A, O-Co1B, O-Co2, O-Co3, and O-Co4) ( Fig. 1, C and D COL17A1 TP63 ODC1 CDK1 MKI67 KRT14 KRT6A SOX4 FOSB 18 CRNN KRT13 Pseudotime analysis revealed two distinct differentiation trajectories originating from O-Sq1A basal stem-like cells: one leading to parabasal cells (O-Sq2A and O-Sq2B) and the other toward terminally differentiated squamous cells (O-Sq3) ( Fig. 1E COL17A1 TP63 MUC21 MKI67 Fig. 1F In the endocervical epithelium, subclusters O-Co1A and O-Co1B exhibited distinct molecular profiles, with O-Co1A cells expressing LGR5 19 MUC5B MUC5AC 20 21 SLC26A2 GUCY1A1 DMBT1 22 23 MKI67 HMGB2 HLA-A HLA-B HLA-DQA1 HLA-DRA 24 25 TUBA1A FOXJ1 LGR5 + Fig. 1G LGR5 TUBA1A MKI67 Fig. 1H To assess whether patient-derived organoids faithfully recapitulate in vivo transcriptional profiles, we integrated five publicly available human cervical tissue scRNA-seq datasets ( 26 30 Fig. 1I Fig. 1J Fig. 1, I and J Next, reclustering of the integrated epithelial cell (IEC) population revealed nine transcriptionally distinct subclusters (IEC-1 to IEC-9) ( Fig. 1K We then examined the proportion of epithelial subclusters (IEC-1 to IEC-9) across both organoid and tissue-derived datasets. Notably, patient-derived 3D organoids contributed to all nine epithelial subpopulations, demonstrating their ability to recapitulate the cellular diversity of native cervical tissue ( Fig. 1L 2 Fig. 1M scRNA-seq analysis confirms high transcriptional fidelity of patient-derived cervical organoids to native tissue To further validate the transcriptional similarity between cervical organoids and native tissue, we extracted squamous and columnar epithelial cells from tissue datasets and performed reclustering, identifying nine squamous and six columnar subpopulations ( Fig. 2, A and B COL17A1 TP63 IGFBP6 JUN SOX4 FOSB MKI67 CDK1 KRT6A MMP7 , KRT13 SPINK5 CRNN Fig. 2. Transcriptional fidelity of patient-derived 3D cervical organoids compared to native cervical tissue. ( A B C D E F G H Columnar subtypes displayed a distinct transcriptional landscape. T-Columnar-1A expressed AXIN2 PTGS2 31 32 MUC5AC MUC5B AGR2 MKI67 PCNA CD74 HLA-DPB1 FOXJ1 TUBA1A To assess the spatial distribution of epithelial subtypes in tissue and organoids, we performed immunohistochemistry (IHC) ( Fig. 2C 33 35 36 To assess transcriptional fidelity between epithelial subtypes, we first embedded organoid- and tissue-derived epithelial clusters into a shared Uniform Manifold Approximation and Projection (UMAP) space ( Fig. 2D To quantify transcriptional similarity between epithelial subtypes of organoid and tissue, we performed cluster similarity analysis by computing similarity scores based on fold-change distributions across shared gene features, ensuring accurate pairing of equivalent cell types across datasets. This analysis revealed four distinct similarity networks, visualized as a community clustering map where nodes represent organoid (O-) or tissue (T-) epithelial populations, and the arrows indicate the direction of transcriptional similarity ( Fig. 2E Fig. 2F To investigate lineage-specific transcriptional regulation, we inferred transcription factor (TF) activity from the expression of downstream target genes ( Fig. 2, G and H TP63 JUN KLF5 SOX15 37 38 FOXM1 MYC E2F 39 40 PAX8 FOXJ1 HNF4A NANOG STAT5A RFX5 ATF3 41 43 TCF7L2 ATF1 FOXO3 ZEB1 To further characterize regional epithelial identity, we analyzed HOX gene expression patterns, key regulators of development ( 44 Differential innate immune architectures of cervical epithelia inform region-specific mucosal defense Despite the well-established role of epithelia in host defense, the contribution of ectocervical and endocervical epithelial subtypes to innate immune responses remain poorly defined. To address this, we used microarray and scRNA-seq analysis to profile epithelial innate immune gene expression at both global and single-cell resolution. This approach enabled us to define epithelial subtypes with distinct immune roles, providing a high-resolution view of region-specific immune heterogeneity ( Fig. 3, A to F Fig. 3. Molecular features of innate immune defense and barrier function in squamous and columnar epithelia of the cervix. ( A B D E F G + − − + To assess barrier integrity across squamous and columnar epithelia, we analyzed the expression of mucins, cytokeratins (KRTs), ciliary genes, and intercellular junction markers. Both organoids and tissue exhibited consistent gene expression patterns, validating the reliability of our models. The endocervical columnar epithelium expressed higher levels of both gel-forming and membrane-bound mucins such as MUC1 MUC4 MUC5B MUC6 MUC12 MUC13 MUC16 45 MUC2 MUC12 MUC13 MUCL3 MUC15 MUC21 Fig. 3B 46 Fig. 3C GJA1 GJA3 DSG2 DSC1 3 CLDN5 CLDN8 GJC1 CDH2 UBA1 PKP4 KAZN A key component of innate host defense is the secretion of antimicrobial peptides (AMPs), which bridge innate and adaptive immunity ( 47 Fig. 3D DEFB1 DEFB4A CHGA LTF LYZ TOR2A HRNR RARRES2 48 SAA1 SAA2 SNCA TSLP SPINK9 Growing evidence suggests that epithelial cells contribute to antigen presentation, influencing both CD8 + + 24 49 Fig. 3E Fig. 3G To further characterize pathogen recognition, we examined the expression of pattern recognition receptors (PRRs), including Toll-like receptors (TLRs), nucleotide-binding oligomerization domain–like receptors (NLRs), and retinoic acid–inducible gene-I–like receptors (RLRs) ( Fig. 3F TLR1 TLR2 Fig. 3F TLR5 NLRP2 CLEC16A CLEC4F TLR2 50 TLR5 Mobiluncus 51 53 TLR1 CLEC2D CLEC4E NLRP1 TLR6 TLR3 NOD2 CLEC2B CLEC7A Fig. 3F We next analyzed cytokine and chemokine expression across tissue and organoid (fig. S5C), revealing distinct inflammatory and immunomodulatory signatures across ecto- and endocervix. In ectocervical basal squamous cells (O-Sq1A-C), genes linked to inflammatory regulation, including CCL26 IL18 IL1RAP IL20RB IL31RA 54 CXCL14 CXCL6 CXCL17 CXCR2 IL1B CXCL1 CXCL3 CXCL8 CCL28 CCL2 IL23A IL10 IL1R1 IL1RL2 IL18R1 IL1A CCL2 Together, these findings demonstrate regional specialization of innate immune profiles within the ectocervical and endocervical epithelia, highlighting differences in barrier formation, AMP secretion, antigen presentation, and cytokine signaling. These compartmentalized responses likely contribute to the protection of the FRT against infections. Decoding cell type–specific responses of ecto- and endocervical epithelia to Chlamydia infection To investigate epithelial subtype–specific responses to infections, we evaluated Chlamydia-infected patient–derived ecto- and endocervical organoids ( Fig. 4A Fig. 4. Single-cell transcriptomics reveals epithelial subtype–specific responses to Chlamydia infection. ( A B C D E F G H I J P ****P K L STAT1 STAT2 IRF9 M N + scRNA-seq analysis revealed compartment-specific transcriptional responses to Chlamydia infection ( Fig. 4, B to H Fig. 4, C and D Fig. 4E Fig. 4F Fig. 4G Fig. 4H To identify key transcriptional regulators underlying epithelial subtype–specific infection responses, we performed TF activity analysis, revealing five major gene modules (GMs) that distinguished ecto- and endocervical epithelial responses ( Fig. 4I IRF1 IRF2 IRF9 NFKB1 STAT1 STAT2 55 56 ATF2 CDX2 FOXJ2 AHR SPI1 ESRRA RFX1 RARA GATA2 GATA4 SOX9 TP63 KLF4 ATF4 SMAD3 FOS TP53 Fig. 4I To further delineate biological pathways activated in response to Chlamydia infection, we performed enrichment analysis, revealing a clear divergence between squamous and columnar epithelial responses. The enrichment for the GO term “defense response to bacterium” was statistically significant in infected and bystander endocervical populations ( Fig. 4J 4 2 At the transcriptional level, columnar subsets, particularly Co3B, Co3C, and infected Co4B, displayed strong up-regulation of ISGs, including IFI6 IFI27 IFITM2 IFITM3 ISG20 IFI30 Fig. 4K TP63 TFAP2C MYC SP1 IRF9 STAT2 IRF1 IRF2 NFKB1 STAT1 STAT2 IRF9 Fig. 4L Fig. 4M Fig. 4N These findings reveal notable epithelial subtype–specific immune responses to Chlamydia infection. Notably, bystander columnar cells undergo extensive transcriptional reprogramming, mounting a robust proinflammatory and IFN-driven response that may serve to limit infection spread and reinforce mucosal immunity. Overall, the transcriptional immune response to Chlamydia infection is notably stronger in endocervical epithelial subsets than in their squamous counterparts of the ectocervix. Innate immune and antimicrobial responses of cervical epithelial subtypes to Chlamydia infection To investigate the impact of Chlamydia infection on innate immune responses across epithelial subpopulations, we analyzed gene expression profiles of defense-related markers. Our findings revealed distinct, cell type–specific immune responses, with both infected and bystander cells showing strong up-regulation of innate immunity-associated genes. Notably, epithelial subtypes that expressed mucins and tight junction markers under homeostatic conditions retained their expression postinfection but at elevated levels in both infected and bystander populations ( Fig. 5A MUC15 MUC21 NLRP1 TLR6 TLR2 TLR5 CLEC4F Fig. 5A Fig. 5, B and C Fig. 5. Chlamydia infection alters innate immune and proliferative programs across cervical epithelial subtypes. ( A B C HLA-B HLA-C HLA-DMB HLA-DRA TLR1 TLR2 TLR5 D DEFB1 P t E F G MKI67 CDK1 Further analysis of chemical barrier components, including AMPs, cytokines, and chemokines revealed their up-regulation across subsets of both infected and bystander cells in the ectocervix and endocervix. ( Fig. 5A CLEC2B NOD1 CAMP ADM CXCR5 TLR2 TLR3 CLEC16A DEFB1 DEFB4A RNASE7 CXCL6 CCL2 CXCL1 IL1B DEFB1 Fig. 5, A and D Fig. 5E Pathway enrichment analysis revealed stronger activation of adaptive immune response in endocervical epithelia compared to ectocervical cells, with the highest response observed in Co3C bystander and infected populations ( Fig. 5F Chlamydia infection has previously been associated with epithelial hyperproliferation ( 15 Fig. 5G Together, these results highlight the distinct, cell type–specific innate immune responses of ectocervical and endocervical epithelial subtypes following Chlamydia infection. While squamous epithelial cells prioritize barrier integrity and PRR signaling, columnar cells exhibit a more immune-competent phenotype characterized by enhanced antigen presentation and defensin-mediated antimicrobial defense. These findings underscore the role of epithelial subpopulations in shaping host-pathogen interactions and suggest that the differential immune responses of cervical epithelial compartments may influence infection outcomes and susceptibility to reinfection. Coordinated intercellular communication among epithelial subtypes enhances immune and tissue regenerative signaling Epithelial cell-cell interactions are fundamental for maintaining tissue integrity and coordinating immune responses during infections. Toward this, we used CellChat ( 57 4 Endocervical columnar epithelia displayed distinct infection-induced signaling adaptations. Pathways such as IL-1, TNF, NCAM, TRAIL, and GALECTIN were strongly enriched during infection, whereas SEMA4, CDH5, DES, and TGF-β were predominant in uninfected conditions (fig. S9, D and F, and table S11). Notably, Co3 cells emerged as key regulators of IL-1, TNF, OCLN, and GALECTIN signaling (fig. S9F). IL-1 signaling, specifically initiated by Co3 cells, targeted Co1A stem cells, suggesting a potential role in both immune activation and regenerative responses. To further dissect epithelial communication networks, we examined L-R interactions in squamous and columnar epithelia before and after Chlamydia infection. In squamous epithelial cells, we identified 17 up-regulated and 30 down-regulated L-R pairs postinfection. Basal (Sq1C) and parabasal (Sq2A-B) cells up-regulated ligands such as AREG LAMB3 LAMC2 ANGPTL4 Fig. 6A 58 MPZL1 BMP7 COL4A5 DSC2 JAG2 Fig. 6B 59 60 DSG2 JAG1 OCLN COL4A1 61 64 Fig. 6. Cell-cell communication analysis reveals differential signaling patterns and networks among ecto- and endocervical epithelial subtypes during Chlamydia infection. ( A B C D E F G H I J K Pattern recognition–based signaling analysis in ectocervical epithelia identified two outgoing (OP-1 and OP-2) and five incoming (IP-1 to IP-5) signaling patterns ( Fig. 6, C and D Fig. 6C 65 66 Fig. 6D 65 67 To investigate how infected epithelial cells influence neighboring bystander populations, we mapped directional L-R interactions originating from infected cells and targeting bystander cells (fig. S9G). TNF signaling from Sq2B-infected cells targeted bystander cells expressing TNFRSF1A, while Sq1A and Sq3-infected cells triggered the CD46-JAG1 axis, influencing Sq1A-D bystander cells. The strongest infection-induced interaction involved MIF signaling, where infected epithelial cells expressed MIF, which engage CD74/CD44 receptors on basal (Sq1A-B) and parabasal (Sq2B) bystanders. Network centrality analysis highlighted the critical role of bystander epithelial cells in mediating immune and tissue repair responses, particularly via MIF, SEMA6, and CADM signaling ( Fig. 6E 68 69 In endocervical columnar epithelia, we identified 15 up-regulated and 19 down-regulated L-R pairs postinfection. LAMB3 AREG TNF IL1B Fig. 6F HSPG2 70 71 LAMC1 LAMA5 LAMB2 CADM1 72 73 Fig. 6G Fig. 6H We further identified four outgoing (OP-3 to OP-6) and five incoming (IP-6 to IP-10) signaling patterns in columnar epithelia ( Fig. 6, I and J Fig. 6I Fig. 6J + Fig. 6K 74 Our study reveals distinct intercellular signaling networks within squamous and columnar epithelia during both homeostasis and Chlamydia infection. While both epithelial lineages engage in signaling pathways that support barrier integrity and tissue repair, endocervical columnar epithelia exhibit a more dynamic and infection-responsive communication profile. Notably, transcriptionally remodeled Co3B and Co3C bystander cells exhibited a unique coordination mechanism, activating a broader set of inflammatory and immune response pathways than their squamous counterparts. DISCUSSION By integrating patient-derived 3D cervical organoids with single-cell transcriptomics and native tissue analysis, our study provides an in-depth, region-resolved high-resolution atlas of cervical epithelial heterogeneity and infection-induced immune dynamics. We show that organoid-derived squamous and columnar epithelial subtypes faithfully recapitulate the molecular, transcriptional, and spatial features of native tissue, supporting the use of these models for interrogating anatomical region–specific host-pathogen interactions. Our findings reveal that stratified ectocervical and columnar endocervical epithelia adopt distinct intrinsic immune strategies to limit infection, preserve tissue integrity, and coordinate responses across cellular compartments ( Fig. 7 Fig. 7. Graphical summary of cervical epithelial cellular diversity, innate mucosal immune features, and Chlamydia-induced responses. ( A B C D E . F Our findings demonstrate that cervical epithelial heterogeneity arises not only from lineage-specific differentiation trajectories but also from regionally distinct immunological specializations. Ectocervical squamous epithelia prioritize and maintain a structural defense strategy enriched in barrier-associated genes and signaling pathways such as NOTCH and TGF-β ( 4 49 75 Infection with Chlamydia revealed substantial differences in epithelial responses between cervical compartments. In ectocervical organoids, infection was broadly distributed but did not alter differentiation trajectories. The response was characterized by up-regulation of stress-responsive TFs (e.g., TP53 KLF4 ATF4 NLRP1 TLR6 STAT1 STAT2 IRF9 76 78 This phenomenon of epithelial reprogramming was further reflected in the cell-cell interaction landscape. Chlamydia infection extensively reshaped the L-R networks, with selective induction and suppression of signaling pathways. In the squamous epithelium of ectocervix, infection promoted CADM, SEMA4, SEMA6, CD99, and JAM signaling, indicative of epithelial remodeling and barrier restoration ( 68 79 4 18 80 DEFB1 81 Together, our findings establish that cervical epithelial subtypes are not passive barriers but are active sensors and regulators of mucosal immunity. They engage in cell-intrinsic defenses, transmit paracrine signals to modulate bystander activation, and coordinate tissue-level communication to limit infection and support regeneration. The compartmentalization of these responses reflects adaptation to the distinct anatomical and functional roles of the ecto- and endocervix. From a translational perspective, these findings offer a framework for identifying immune-competent epithelial subsets (e.g., Co3B/C and Sq2B) and key signaling nodes (e.g., Co3C and Sq1A), as potential targets for modulating mucosal immunity. IFN signaling and MIF-CD74/CD44 interactions pathways may be leveraged for therapeutic intervention. Moreover, the epithelial remodeling signatures uncovered here may serve as biomarkers of infection-induced dysregulation, with implications for predicting persistent infection, metaplasia, or disease progression to conditions like cancer. Thus, our study establishes a scalable, region-specific cervical organoid platform integrated with single-cell transcriptomics to dissect host-pathogen interactions. Future extensions incorporating immune cells, microbiota, controlled hormonal environments, or coinfections (e.g., HPV) will enable more comprehensive modeling of epithelial-immune cross-talk, mucosal homeostasis and infection susceptibility. Collectively, our findings reveal a highly coordinated, epithelial-intrinsic immune architecture in the human cervix that governs defense and regeneration during infection, informing next-generation mucosal vaccines and epithelial-targeted interventions to protect reproductive health and prevent infection-associated disorders. MATERIALS AND METHODS Antibodies and chemicals The following primary antibodies were used for immunofluorescence: mouse anti–acetylated tubulin–Alexa Fluor 647 (1:300, Santa Cruz Biotechnology, sc-23950-AF647), mouse anti–E-cadherin–Alexa Fluor 488 (1:50, BD Biosciences, 560061), mouse anti–E-cadherin (1:50, BD Biosciences, 610181), rabbit anti–KRT5–Alexa Fluor 488 (1:300, Abcam, ab193894), mouse anti-MUC5B (1:200, Abcam, ab77995), rabbit anti-MUC21 (1:200, ProteinAtlas, HPA052028), rabbit anti-KRT8 (1:200, Abcam, ab59400), mouse-anti-KRT6 (1:50, Abcam, ab18586), recombinant rabbit anti-PAX8 (1:200, Abcam, ab239363), goat anti– C. trachomatis Immunofluorescence histochemistry Immunofluorescence staining was performed on paraffin-embedded tissue and organoid sections as described previously ( 14 15 qRT-PCR analysis Total RNA of the uninfected and Chlamydia-infected human ectocervical and endocervical organoid pellets or flow cytometric sorted cell pellets were isolated using AllPrep DNA/RNA Mini Kit (QIAGEN, #80204) according to the manufacturer’s protocol. Using the RevertAid First-Strand cDNA Synthesis Kit (Fisher Scientific, K1621), 1 μg of uninfected and infected human ecto- and endocervix RNA was converted into cDNA according to the manufacturer’s protocol. qRT-PCR was performed using the following reaction mixture: 12.5 ng of cDNA, 3.6 μl of respective forward and reverse primer mix (10 μM) mix, 10 μl of GreenMasterMix (2×) High ROX for qPCR (Genexxon Biosciences, M3052.0000), and made up the volume to 20 μl of DNase/RNase-free water. The following qRT-PCR cycle program was used: 95°C for 10 min, followed by 40 cycles at 95°C for 15 s and 60°C for 60 s. The melting cycle of 95°C for 15 s, 60°C for 16 s, and 95°C for 15 s were used. The expression level of human GAPDH (glyceraldehyde 3-phosphate dehydrogenase), a housekeeping gene, was used to normalize the relative mRNA levels of respective genes in the uninfected and Chlamydia-infected human ecto- and endocervix organoids. Following primers for GAPDH were used as controls: forward 5′-GGTATCGTGGAAGGACTCATGAC-3′, reverse: 5′-ATGCCAGTGAGCTTCCCGTTCAG-3′; All samples were measured as triplicates. The forward and reverse primers were designed with a melting temperature of 60°C from Sigma-Aldrich (100 μM) and were diluted to 10 μM before use. The following primer pairs were used: TLR1- forward: 5′-AGTTGTCAGCGATGTGTTCG-3′, reverse: 5′-AAAATCCAAATGCAGGAACG-3′, TLR2- forward: 5′-GGTTCAAGCCCCTTTCTTCT-3′, reverse: 5′-TTCCCACTCTCAGGATTTGC-3′, reverse 5′- TTTCCAGAGCCGTGCTAAGT-3′, TLR5- forward: 5′- TGCCACTGTTGAGTGCAAGTC-3′, reverse: 5′-ACCTGGAGAAGCCGAAGGTAAG-3′, HLA-B- forward: 5′-ATACCTGGAGAACGGGAAGG-3′, reverse: 5′-CAGTGTCCTGAGTTTGGTCCT-3′, HLA-C- forward: 5′-ATTACATCGCCCTGAACGAG-3′, reverse: 5′-GTGTGTCTTTGGGGGTTCTG-3′, HLA-DMB- forward: 5′-CTCACAGCACCTCAACCAAA-3′, reverse: 5′- AGAAGCCCCACACATAGCAG-3′, HLA-DRA- forward: 5′-GAAATGGAAAACCTGTCACCA-3′, reverse: 5′-GCATCAAACTCCCAGTGCTT-3′, CCL2- forward: 5′-CCCCAGTCACCTGCTGTTAT-3′, reverse: GAGTTTGGGTTTGCTTGTCC-3′, DEFB1- forward: 5′- AGATGGCCTCAGGTGGTAAC-3′, reverse: 5′-CACTTGGCCTTCCCTCTGTA-3′. Relative mRNA levels of the samples were measured in terms of fold-change [2^-(∆∆Ct)] by SYBR-Green detection with qRT-PCR, StepOnePlus Real-Time PCR System (Applied BiosystemsTM), and StepOneTM Software (v2.3, Applied Biosystems). Culturing of organoids and C. trachomatis Human cervical tissue samples were provided by the Department of Gynecology, Charité University Hospital, and August-Viktoria Klinikum, Berlin. Usage for scientific research was approved by their ethics committee (EA1/059/15), and informed consent was obtained from all subjects. The study complies with all relevant ethical regulations regarding research involving human participants. Biopsies were sourced from standard surgical procedures. Only anatomically normal tissue biopsies from anonymous female donors aged between 35 and 75 years undergoing gynecological procedures for benign conditions were processed within 2 to 3 hours after removal. In line with ethical approvals and anonymization protocols, detailed clinical metadata such as menopausal status or surgical indication were not available to investigators. Organoids were generated from ecto- and endocervical biopsies, processed and independently obtained from a total of six individuals. While some ecto- and endocervical tissues may have originated from the same donor, samples were not patient-matched, as the study focused on region-specific epithelial responses. The ecto- and endocervix organoids were cultured according to the previously described methods ( 14 C. trachomatis AMP treatment and infectivity assay For AMP treatment, the required amount of bacteria was pretreated with either HBD1 (25 μg/ml, Peptanova, #4337-s) in the presence of 2 mM dithiothreitol or HBD2 (25 μg/ml, Peptanova, #4338-s) or in the presence of both in SPG buffer for 30 min at room temperature. Human endocervical organoids were infected with pretreated bacteria at MOI of 5 for 2 hours in the infection medium. Organoids were washed and allowed to grow in Matrigel for 48 hours. After 48 hpi, organoids were harvested and centrifuged into pellet. Pellet was transferred into 15-ml falcon tubes with 1 ml of infection medium. Approximately 1 ml of sterile glass beads were added to flacon tubes and vortexed for 4 min. Cell suspension was diluted to 1:2. Fifty microliters of diluted sample was added to previously grown HeLa cells monolayers in 96-well plates and incubated for 2 hours. The media were replaced with complete media and incubated for 24 hours. After 24 hpi, the media were removed, added 200 μl of ice-cold methanol incubated plate at 4°C overnight. Methanol was washed twice with 200 μl of 1× phosphate-buffered saline (PBS). The cells were stained with DAPI (1:1000) in 0.2% bovine serum albumin (BSA) solution in PBS for 1 hours. The cells were washed with 1× PBS, images were taken from the fluorescent microscope, and infectivity per milliliter was calculated. Flow cytometric sorting of C. trachomatis Organoids were incubated with 2 ml of TrypLE in a shaker (20 min, 37°C, 180 rpm for ecto cervix and 10 min, 37°C, 180 rpm for endo cervix organoids). The organoids were made into single cells by pipetting up and down 20 times using a 1-ml pipette tip and diluted with 5 ml of 0.04% BSA-PBS solution. After inverting, the cells were passed through a 40-μm cell strainer. The suspension was transferred to 75-mm Falcon tubes with cell strainer caps (Fisher Scientific) and placed on ice. Cells were sorted for GFP-positive and -negative cells into a Falcon tube containing ice-cold 0.04% BSA-PBS solution using BD FACSAria III Cell Sorter (BDbiosciences) running the FACSDiva software (BDbiosciences). Using side-scatter and forward-scatter properties, any cell debris, doublets, or aggregates were excluded. Cells were sorted using GFP (502LP-530/30) filters for positive and negative cells. Microarray expression profiling and analysis Organoids were washed, pelleted, and resuspended in 1-ml TRIzol reagent (Invitrogen, #15596026). RNA was isolated using the Allprep and RNeasy Mini Kit (Qiagen, #80204) according to the manufacturer’s protocol, and quality was assessed by Agilent 2100 Bioanalyzer with RNA Nano 6000 microfluidics kit (Agilent Technologies, #5067-1511). Microarray experiments were performed as previously described ( 15 P 82 83 P P scRNA-seq sample preparation Organoids from three biological replicates of human ectocervical cells and two biological replicates of human endocervical cells were harvested (0.04% BSA-PBS) after Chlamydia infection. Single cells were prepared from the organoids as above in 0.04% BSA-PBS solution. After inverting, the cells were passed through a 40-μm cell strainer. Single cells were pooled at an equal ratio from biological samples and processed for the Cell Multiplexing Oligo (CMO) labeling using kit 3′ CellPlex Kit Set A (10x Genomics, #PN-1000261). CMO-labeled cells were pooled at an equal ratio, made the cell concentration to 2000 cell/μl, and proceeded for the library preparation. Single cells were partitioned into nanoliter-scale Gel-Bead-In-EMulsions using a 10X Chromium Controller. The library was prepared using Single-Cell 3′ reagent kit v3 for reverse transcription, cDNA amplification, and library construction according to the manufacturer’s protocol. Sequencing was performed in paired-end mode with an S1 100-cycles kit using Illumina Novaseq 6000 sequencer. Bioinformatic analysis of scRNA-seq data from patient-derived cervical organoids Processing of raw sequencing data and downstream analysis The CellRanger (v.6.1.1) software from the 10X Genomics platform was used to demultiplex and process the raw sequencing data of uninfected and Chlamydia-infected ecto- and endocervical organoid samples. We used the “cellranger multi” pipeline with default parameters. Reads were aligned to the 10X reference human genome build GRCh38-2020-A. Downstream analysis for the generated digital gene expression matrices was performed using the R package Seurat (v.4.1.1) ( 84 LGR5 KRT8 18 TP63 KRT5 14 Normalization and variance stabilization of the count data were performed using the R package sctransform (v.0.3.3) ( 85 Differential expression analysis and GSEA Differentially expressed genes between cell types and clusters were identified using the “FindAllMarkers” function from the Seurat R package, with default parameters. GSEA was performed on scRNA-seq count data using the default functions provided by the R package escape (v.1.4.1) ( 86 87 Signature scoring analysis Gene signature scoring for our scRNA-seq data was performed using the R package Ucell (v.1.1.1) ( 88 U Cell-cell interaction analysis We used CellChat’s (v.1.1.3) ( 57 Cell transition trajectory and pseudotime analysis Developmental trajectories in our data were modeled using the R package URD (v.1.1.1) ( 89 90 TP63 + LGR5 + KRT13 MUC21 + TUBA1A + TF activity analysis TF activities in ecto- and endocervical epithelia were investigated using the R package Dorothea (v. 1.4.2) ( 91 z Integrative analysis with cervical tissue scRNA-seq data To assess transcriptional similarities between in vivo cervical tissue and 3D organoid models, we used publicly available scRNA-seq cervical tissue datasets from five sources ( 26 30 92 We then performed integrative analysis using the ‘IntegrateLayers’ function with ‘Harmony-based’ integration method. Clustering was performed using the FindNeighbors and FindClusters functions based on the top 15 principal components, with a resolution of 0.1. Nonlinear dimensionality reduction was performed using the RunUMAP function for visualization. As a result, a total of 109,594 integrated cells were obtained. Since the external datasets contained additional cell types such as stromal, immune, endothelial, and smooth muscle cells, we first extracted epithelial cell clusters by identifying epithelial marker genes ( KRT5 KRT14 KRT13 KRT7 KRT8 KRT18 PAX8 93 94 Statistical analysis and reproducibility GraphPad Prism (v.8) was used for statistical calculations and the generation of plots. The data are displayed as means ± SEM. P Acknowledgments We thank the Core Unit SysMed at the University of Würzburg for scRNA-seq. We also thank S. M. Kurian for assistance with sample preparation. Funding: Author contributions: Competing interests: Data and materials availability: https://ebi.ac.uk/biostudies/arrayexpress https://ngdc.cncb.ac.cn/gsa/ GSE168652 GSE208653 https://ncbi.nlm.nih.gov/geo/ Supplementary Materials The PDF file includes: Figs. S1 to S9 Legends for tables S1 to S11 Legend for data S1 Other Supplementary Material for this manuscript includes the following: Tables S1 to S11 Data S1 REFERENCES AND NOTES 1 A. M. Marchiando W. V. Graham J. R. Turner Epithelial barriers in homeostasis and disease Annu. Rev. Pathol. 5 119 144 2010 20078218 10.1146/annurev.pathol.4.110807.092135 2 J. C. Brazil M. Quiros A. Nusrat C. A. Parkos Innate immune cell-epithelial crosstalk during wound repair J. Clin. Invest. 129 2983 2993 2019 31329162 10.1172/JCI124618 PMC6668695 3 J. Gunther H. M. Seyfert The first line of defence: Insights into mechanisms and relevance of phagocytosis in epithelial cells Semin. Immunopathol. 40 555 565 2018 30182191 10.1007/s00281-018-0701-1 PMC6223882 4 C. Chumduri R. K. Gurumurthy H. Berger O. Dietrich N. Kumar S. Koster V. Brinkmann K. Hoffmann M. Drabkina P. Arampatzi D. Son U. Klemm H. J. Mollenkopf H. Herbst M. Mangler J. Vogel A. E. Saliba T. F. Meyer Opposing Wnt signals regulate cervical squamocolumnar homeostasis and emergence of metaplasia Nat. Cell Biol. 23 184 197 2021 33462395 10.1038/s41556-020-00619-0 PMC7878191 5 A. J. McNairn G. Guasch Epithelial transition zones: Merging microenvironments, niches, and cellular transformation Eur. J. Dermatol. 21 21 28 2011 21628126 10.1684/ejd.2011.1267 6 V. Giroux A. K. Rustgi Metaplasia: Tissue injury adaptation and a precursor to the dysplasia-cancer sequence Nat. Rev. Cancer 17 594 604 2017 28860646 10.1038/nrc.2017.68 PMC5998678 7 S. S. Witkin E. Minis A. Athanasiou J. Leizer I. M. Linhares Chlamydia trachomatis Clin. Vaccine Immunol. 24 e00203-17 2017 28835360 10.1128/CVI.00203-17 PMC5629669 8 C. D. J. den Heijer C. Hoebe J. H. M. Driessen P. Wolffs I. V. F. van den Broek B. M. Hoenderboom R. Williams F. de Vries N. Dukers-Muijrers Chlamydia trachomatis Clin. Infect. Dis. 69 1517 1525 2019 31504315 10.1093/cid/ciz429 PMC6792126 9 C. Chumduri R. K. Gurumurthy P. K. Zadora Y. Mi T. F. Meyer Chlamydia infection promotes host DNA damage and proliferation but impairs the DNA damage response Cell Host Microbe 13 746 758 2013 23768498 10.1016/j.chom.2013.05.010 10 P. K. Zadora C. Chumduri K. Imami H. Berger Y. Mi M. Selbach T. F. Meyer R. K. Gurumurthy Integrated phosphoproteome and transcriptome analysis reveals Chlamydia-induced epithelial-to-mesenchymal transition in host cells Cell Rep. 26 1286 1302.e8 2019 30699355 10.1016/j.celrep.2019.01.006 11 S. Filardo M. Di Pietro R. Sessa Better in vitro tools for exploring Chlamydia trachomatis Life 12 1065 2022 35888153 10.3390/life12071065 PMC9323215 12 J. R. Masters HeLa cells 50 years on: The good, the bad and the ugly Nat. Rev. Cancer 2 315 319 2002 12001993 10.1038/nrc775 13 C. Chumduri M. Y. Turco Organoids of the female reproductive tract J. Mol. Med. Berl 99 531 553 2021 33580825 10.1007/s00109-020-02028-0 PMC8026429 14 R. K. Gurumurthy S. Koster N. Kumar T. F. Meyer C. Chumduri Patient-derived and mouse endo-ectocervical organoid generation, genetic manipulation and applications to model infection Nat. Protoc. 17 1658 1690 2022 35546639 10.1038/s41596-022-00695-6 15 S. Koster R. K. Gurumurthy N. Kumar P. G. Prakash J. Dhanraj S. Bayer H. Berger S. M. Kurian M. Drabkina H. J. Mollenkopf C. Goosmann V. Brinkmann Z. Nagel M. Mangler T. F. Meyer C. Chumduri Modelling Chlamydia and HPV co-infection in patient-derived ectocervix organoids reveals distinct cellular reprogramming Nat. Commun. 13 1030 2022 35210413 10.1038/s41467-022-28569-1 PMC8873204 16 S. Triana C. Metz-Zumaran C. Ramirez C. Kee P. Doldan M. Shahraz D. Schraivogel A. R. Gschwind A. K. Sharma L. M. Steinmetz C. Herrmann T. Alexandrov S. Boulant M. L. Stanifer Single-cell analyses reveal SARS-CoV-2 interference with intrinsic immune response in the human gut Mol. Syst. Biol. 17 e10232 2021 33904651 10.15252/msb.202110232 PMC8077299 17 W. Lee S. Lee J. K. Yoon D. Lee Y. Kim Y. B. Han R. Kim S. Moon Y. J. Park K. Park B. Cha J. Choi J. Kim N. Y. Ha K. Kim S. Cho N. H. Cho T. J. Desai J. H. Chung J. H. Lee J. I. Kim A single-cell atlas of in vitro multiculture systems uncovers the in vivo lineage trajectory and cell state in the human lung Exp. Mol. Med. 55 1831 1842 2023 37582976 10.1038/s12276-023-01076-z PMC10474282 18 N. Kumar P. G. Prakash C. Wentland S. M. Kurian G. Jethva V. Brinkmann H. J. Mollenkopf T. Krammer C. Toussaint A. E. Saliba M. Biebl C. Jurgensen B. Wiedenmann T. F. Meyer R. K. Gurumurthy C. Chumduri Decoding spatiotemporal transcriptional dynamics and epithelial fibroblast crosstalk during gastroesophageal junction development through single cell analysis Nat. Commun. 15 3064 2024 38594232 10.1038/s41467-024-47173-z PMC11004180 19 B. K. Koo H. Clevers Stem cells marked by the R-spondin receptor LGR5 Gastroenterology 147 289 302 2014 24859206 10.1053/j.gastro.2014.05.007 20 R. Seishima C. Leung S. Yada K. B. A. Murad L. T. Tan A. Hajamohideen S. H. Tan H. Itoh K. Murakami Y. Ishida S. Nakamizo Y. Yoshikawa E. Wong N. Barker Neonatal Wnt-dependent Lgr5 positive stem cells are essential for uterine gland development Nat. Commun. 10 5378 2019 31772170 10.1038/s41467-019-13363-3 PMC6879518 21 Y. Ueda H. Mogami Y. Kawamura M. Takakura A. Inohaya E. Yasuda Y. Matsuzaka Y. Chigusa S. Ito M. Mandai E. Kondoh Cervical MUC5B and MUC5AC are barriers to ascending pathogens during pregnancy J. Clin. Endocrinol. Metab. 107 3010 3021 2022 36112402 10.1210/clinem/dgac545 22 J. Madsen J. Mollenhauer U. Holmskov Review: Gp-340/DMBT1 in mucosal innate immunity Innate Immun. 16 160 167 2010 20418254 10.1177/1753425910368447 23 A. Kumar S. Priyamvada Y. Ge D. Jayawardena M. Singhal A. N. Anbazhagan I. Chatterjee A. Dayal M. Patel K. Zadeh S. Saksena W. A. Alrefai R. K. Gill M. Zadeh N. Zhao M. Mohamadzadeh P. K. Dudeja A novel role of SLC26A3 in the maintenance of intestinal epithelial barrier integrity Gastroenterology 160 1240 1255.e3 2021 33189700 10.1053/j.gastro.2020.11.008 PMC7956241 24 A. T. Shenoy C. Lyon De Ana E. I. Arafa I. Salwig K. A. Barker F. T. Korkmaz A. Ramanujan N. S. Etesami A. M. Soucy I. M. C. Martin B. R. Tilton A. Hinds W. N. Goltry H. Kathuria T. Braun M. R. Jones L. J. Quinton A. C. Belkina J. P. Mizgerd Antigen presentation by lung epithelial cells directs CD4(+) T(RM) cell function and regulates barrier immunity Nat. Commun. 12 5834 2021 34611166 10.1038/s41467-021-26045-w PMC8492657 25 M. Koyama P. Mukhopadhyay I. S. Schuster A. S. Henden J. Hulsdunker A. Varelias M. Vetizou R. D. Kuns R. J. Robb P. Zhang B. R. Blazar R. Thomas J. Begun N. Waddell G. Trinchieri R. Zeiser A. D. Clouston M. A. Degli-Esposti G. R. Hill MHC class II antigen presentation by the intestinal epithelium initiates graft-versus-host disease and is influenced by the microbiota Immunity 51 885 898.e7 2019 31542340 10.1016/j.immuni.2019.08.011 PMC6959419 26 C. Li H. Wu L. Guo D. Liu S. Yang S. Li K. Hua Single-cell transcriptomics reveals cellular heterogeneity and molecular stratification of cervical cancer Commun. Biol. 5 1208 2022 36357663 10.1038/s42003-022-04142-w PMC9649750 27 C. Liu M. Zhang X. Yan Y. Ni Y. Gong C. Wang X. Zhang L. Wan H. Yang C. Ge Y. Li W. Zou R. Huang X. Li B. Sun B. Liu J. Yue J. Yu Single-cell dissection of cellular and molecular features underlying human cervical squamous cell carcinoma initiation and progression Sci. Adv. 9 eadd8977 2023 36706185 10.1126/sciadv.add8977 PMC9882988 28 C. Li L. Guo S. Li K. Hua Single-cell transcriptomics reveals the landscape of intra-tumoral heterogeneity and transcriptional activities of ECs in CC Mol. Ther. Nucleic Acids 24 682 694 2021 33996252 10.1016/j.omtn.2021.03.017 PMC8099483 29 C. Li K. Hua Dissecting the single-cell transcriptome network of immune environment underlying cervical premalignant lesion, cervical cancer and metastatic lymph nodes Front. Immunol. 13 897366 2022 35812401 10.3389/fimmu.2022.897366 PMC9263187 30 X. Qu Y. Wang Q. Jiang T. Ren C. Guo K. Hua J. Qiu Interactions of Indoleamine 2,3-dioxygenase-expressing LAMP3 + + + Cancer Commun. 43 1207 1228 2023 10.1002/cac2.12486 PMC10631485 37794698 31 S. M. Syed M. Kumar A. Ghosh F. Tomasetig A. Ali R. M. Whan D. Alterman P. S. Tanwar Endometrial Axin2(+) cells drive epithelial homeostasis, regeneration, and cancer following oncogenic transformation Cell Stem Cell 26 64 80.e13 2020 31883834 10.1016/j.stem.2019.11.012 32 L. Marions K. G. Danielsson Expression of cyclo-oxygenase in human endometrium during the implantation period Mol. Hum. Reprod. 5 961 965 1999 10508225 10.1093/molehr/5.10.961 33 M. Kessler K. Hoffmann V. Brinkmann O. Thieck S. Jackisch B. Toelle H. Berger H. J. Mollenkopf M. Mangler J. Sehouli C. Fotopoulou T. F. Meyer The Notch and Wnt pathways regulate stemness and differentiation in human fallopian tube organoids Nat. Commun. 6 8989 2015 26643275 10.1038/ncomms9989 PMC4686873 34 D. J. Fu A. J. De Micheli M. Bidarimath L. H. Ellenson B. D. Cosgrove A. Flesken-Nikitin A. Y. Nikitin Cells expressing PAX8 are the main source of homeostatic regeneration of adult mouse endometrial epithelium and give rise to serous endometrial carcinoma Dis. Model. Mech. 13 dmm047035 2020 32998907 10.1242/dmm.047035 PMC7648606 35 T. Arakawa S. Fukuda T. Hirata K. Neriishi Y. Wang A. Takeuchi A. Saeki M. Harada Y. Hirota T. Matsumoto K. Koga O. Wada-Hiraike M. Kurihara T. Fujii Y. Osuga PAX8: A highly sensitive marker for the glands in extragenital endometriosis Reprod. Sci. 1933719119828095 2019 30764713 10.1177/1933719119828095 36 E. A. McGlade K. K. Stephens S. Winuthayanon P. Anamthathmakula M. J. Holtzman W. Winuthayanon Classical estrogen signaling in ciliated epithelial cells of the oviduct is nonessential for fertility in female mice Endocrinology 165 bqad163 2023 37942801 10.1210/endocr/bqad163 PMC10658216 37 M. Senoo F. Pinto C. P. Crum F. McKeon p63 Is essential for the proliferative potential of stem cells in stratified epithelia Cell 129 523 536 2007 17482546 10.1016/j.cell.2007.02.045 38 R. Sulahian J. Chen Z. Arany U. Jadhav S. Peng A. K. Rustgi A. J. Bass A. Srivastava J. L. Hornick R. A. Shivdasani SOX15 governs transcription in human stratified epithelia and a subset of esophageal adenocarcinomas Cell Mol. Gastroenterol. Hepatol. 1 598 609.e6 2015 26516633 10.1016/j.jcmgh.2015.07.009 PMC4620585 39 I.-C. Wang Y.-J. Chen D. Hughes V. Petrovic M. L. Major H. J. Park Y. Tan T. Ackerson R. H. Costa Forkhead box M1 regulates the transcriptional network of genes essential for mitotic progression and genes encoding the SCF (Skp2-Cks1) ubiquitin ligase Mol. Cell. Biol. 25 10875 10894 2005 16314512 10.1128/MCB.25.24.10875-10894.2005 PMC1316960 40 H. Muller K. Helin The E2F transcription factors: Key regulators of cell proliferation Biochim. Biophys. Acta 1470 M1 M12 2000 10656985 10.1016/s0304-419x(99)00030-x 41 B. J. Colleypriest Z. D. Burke L. P. Griffiths Y. Chen W. Y. Yu R. Jover M. Bock L. Biddlestone J. M. Quinlan S. G. Ward J. Mark Farrant J. M. W. Slack D. Tosh Hnf4α is a key gene that can generate columnar metaplasia in oesophageal epithelium Differentiation 93 39 49 2017 27875772 10.1016/j.diff.2016.11.001 PMC5293356 42 S. Lemeille M. Paschaki D. Baas L. Morle J. L. Duteyrat A. Ait-Lounis E. Barras F. Soulavie J. Jerber J. Thomas Y. Zhang M. J. Holtzman W. S. Kistler W. Reith B. Durand Interplay of RFX transcription factors 1, 2 and 3 in motile ciliogenesis Nucleic Acids Res. 48 9019 9036 2020 32725242 10.1093/nar/gkaa625 PMC7498320 43 S. P. Choksi G. Lauter P. Swoboda S. Roy Switching on cilia: Transcriptional networks regulating ciliogenesis Development 141 1427 1441 2014 24644260 10.1242/dev.074666 44 H. Du H. S. Taylor The role of Hox genes in female reproductive tract development, adult function, and fertility Cold Spring Harb. Perspect. Med. 6 a023002 2015 26552702 10.1101/cshperspect.a023002 PMC4691806 45 Y. Andersch-Bjorkman K. A. Thomsson J. M. Holmen Larsson E. Ekerhovd G. C. Hansson Large scale identification of proteins, mucins, and their O-glycosylation in the endocervical mucus during the menstrual cycle Mol. Cell. Proteomics 6 708 716 2007 17220477 10.1074/mcp.M600439-MCP200 46 L. Ramms G. Fabris R. Windoffer N. Schwarz R. Springer C. Zhou J. Lazar S. Stiefel N. Hersch U. Schnakenberg T. M. Magin R. E. Leube R. Merkel B. Hoffmann Keratins as the main component for the mechanical integrity of keratinocytes Proc. Natl. Acad. Sci. U.S.A. 110 18513 18518 2013 24167246 10.1073/pnas.1313491110 PMC3831947 47 J.-Y. Ma S. Shao G. Wang Antimicrobial peptides: Bridging innate and adaptive immunity in the pathogenesis of psoriasis Chin. Med. J. 133 2966 2975 2020 33237697 10.1097/CM9.0000000000001240 PMC7752697 48 B. Becknell J. D. Spencer A. R. Carpenter X. Chen A. Singh S. Ploeger J. Kline P. Ellsworth B. Li E. Proksch A. L. Schwaderer D. S. Hains S. S. Justice K. M. McHugh Expression and antimicrobial function of beta-defensin 1 in the lower urinary tract PLOS ONE 8 e77714 2013 24204930 10.1371/journal.pone.0077714 PMC3804605 49 C. R. Wira R. M. Rossoll R. C. Young Polarized uterine epithelial cells preferentially present antigen at the basolateral surface: Role of stromal cells in regulating class II-mediated epithelial cell antigen presentation J. Immunol. 175 1795 1804 2005 16034121 10.4049/jimmunol.175.3.1795 50 E. Latorre C. Mendoza E. Layunta A. I. Alcalde J. E. Mesonero TLR2, TLR3, and TLR4 activation specifically alters the oxidative status of intestinal epithelial cells Cell Stress Chaperones 19 289 293 2014 24068346 10.1007/s12192-013-0461-8 PMC3933612 51 J. Yang H. Yan TLR5: Beyond the recognition of flagellin Cell. Mol. Immunol. 14 1017 1019 2017 29151579 10.1038/cmi.2017.122 PMC5719140 52 C. M. Dude A. Saylany A. Brown M. Elovitz L. Anton Microbial supernatants from Mobiluncus mulieris Anaerobe 61 102127 2020 31760081 10.1016/j.anaerobe.2019.102127 53 E. J. Dela Cruz T. L. Fiedler C. Liu M. M. Munch C. M. Kohler A. R. Oot J. M. Wallis J. Wang A. Frishman K. Garcia A. Wiser J. E. Balkus S. Srinivasan J. L. Golob L. K. Sycuro J. M. Marrazzo T. R. Hawn D. N. Fredricks Genetic variation in Toll-like receptor 5 and colonization with flagellated bacterial vaginosis-associated bacteria Infect. Immun. 89 e00060-20 2021 33199356 10.1128/IAI.00060-20 PMC8097276 54 M. A. Williams A. O’Callaghan S. C. Corr IL-33 and IL-18 in inflammatory bowel disease etiology and microbial interactions Front. Immunol. 10 1091 2019 31139196 10.3389/fimmu.2019.01091 PMC6527769 55 K. L. Hosey S. Hu W. A. Derbigny Role of STAT1 in Chlamydia-induced type-1 interferon production in oviduct epithelial cells J. Interferon Cytokine Res. 35 901 916 2015 26262558 10.1089/jir.2015.0013 PMC4642836 56 H. M. Lazear J. W. Schoggins M. S. Diamond Shared and distinct functions of type I and type III interferons Immunity 50 907 923 2019 30995506 10.1016/j.immuni.2019.03.025 PMC6839410 57 S. Jin C. F. Guerrero-Juarez L. Zhang I. Chang R. Ramos C. H. Kuan P. Myung M. V. Plikus Q. Nie Inference and analysis of cell-cell communication using CellChat Nat. Commun. 12 1088 2021 33597522 10.1038/s41467-021-21246-9 PMC7889871 58 D. M. W. Zaiss W. C. Gause L. C. Osborne D. Artis Emerging functions of amphiregulin in orchestrating immunity, inflammation, and tissue repair Immunity 42 216 226 2015 25692699 10.1016/j.immuni.2015.01.020 PMC4792035 59 Z. Bao R. Chen P. Zhang S. Lu X. Chen Y. Yao X. Jin Y. Sun J. Zhou A potential target gene for the host-directed therapy of mycobacterial infection in murine macrophages Int. J. Mol. Med. 38 823 833 2016 27432120 10.3892/ijmm.2016.2675 PMC4990325 60 W. K. Fang L. D. Liao L. Y. Li Y. M. Xie X. E. Xu W. J. Zhao J. Y. Wu M. X. Zhu Z. Y. Wu Z. P. Du B. L. Wu D. Xie M. Z. Guo L. Y. Xu E. M. Li Down-regulated desmocollin-2 promotes cell aggressiveness through redistributing adherens junctions and activating beta-catenin signalling in oesophageal squamous cell carcinoma J. Pathol. 231 257 270 2013 23836524 10.1002/path.4236 61 C. M. Van Itallie A. S. Fanning J. Holmes J. M. Anderson Occludin is required for cytokine-induced regulation of tight junction barriers J. Cell Sci. 123 2844 2852 2010 20663912 10.1242/jcs.065581 PMC2915885 62 H. Ungewiß F. Vielmuth S. T. Suzuki A. Maiser H. Harz H. Leonhardt D. Kugelmann N. Schlegel J. Waschke Desmoglein 2 regulates the intestinal epithelial barrier via p38 mitogen-activated protein kinase Sci. Rep. 7 6329 2017 28740231 10.1038/s41598-017-06713-y PMC5524837 63 N. Schlegel M. Meir W. M. Heupel B. Holthofer R. E. Leube J. Waschke Desmoglein 2-mediated adhesion is required for intestinal epithelial barrier integrity Am. J. Physiol. Gastrointest. Liver Physiol. 298 G774 G783 2010 20224006 10.1152/ajpgi.00239.2009 64 X. Q. Xu Y. Liu B. Zhang H. Liu D. D. Shao J. B. Liu X. Wang L. N. Zhou W. H. Hu W. Z. Ho IL-22 suppresses HSV-2 replication in human cervical epithelial cells Cytokine 123 154776 2019 31344598 10.1016/j.cyto.2019.154776 PMC6739152 65 J. J. Worthington T. M. Fenton B. I. Czajkowska J. E. Klementowicz M. A. Travis Regulation of TGFbeta in the immune system: An emerging role for integrins and dendritic cells Immunobiology 217 1259 1265 2012 22902140 10.1016/j.imbio.2012.06.009 PMC3690473 66 S. M. Kanth S. Gairhe P. Torabi-Parizi The role of semaphorins and their receptors in innate immune responses and clinical diseases of acute inflammation Front. Immunol. 12 672441 2021 34012455 10.3389/fimmu.2021.672441 PMC8126651 67 C. M. Ertle F. R. Rommel S. Tumala Y. Moriwaki J. Klein J. Kruse U. Gieler E. M. J. Peters New pathways for the skin’s stress response: The cholinergic neuropeptide SLURP-1 can activate Mast cells and alter cytokine production in mice Front. Immunol. 12 631881 2021 33815383 10.3389/fimmu.2021.631881 PMC8012551 68 L. Treps A. Le Guelte J. Gavard Emerging roles of Semaphorins in the regulation of epithelial and endothelial junctions Tissue Barriers 1 e23272 2013 24665374 10.4161/tisb.23272 PMC3879177 69 M. Sakurai-Yageta M. Masuda Y. Tsuboi A. Ito Y. Murakami Tumor suppressor CADM1 is involved in epithelial cell structure Biochem. Biophys. Res. Commun. 390 977 982 2009 19854157 10.1016/j.bbrc.2009.10.088 70 V. De Pasquale M. S. Quiccione S. Tafuri L. Avallone L. M. Pavone Heparan sulfate proteoglycans in viral infection and treatment: A special focus on SARS-CoV-2 Int. J. Mol. Sci. 22 6574 2021 34207476 10.3390/ijms22126574 PMC8235362 71 F. Zhang C. Sodroski H. Cha Q. Li T. J. Liang Infection of hepatocytes with HCV increases cell surface levels of heparan sulfate proteoglycans, uptake of cholesterol and lipoprotein, and virus entry by up-regulating SMAD6 and SMAD7 Gastroenterology 152 257 270.e7 2017 27693511 10.1053/j.gastro.2016.09.033 PMC5547743 72 K. Manivannan A. G. Rowan Y. Tanaka G. P. Taylor C. R. Bangham CADM1/TSLC1 Identifies HTLV-1-infected cells and determines their susceptibility to CTL-mediated lysis PLOS Pathog. 12 e1005560 2016 27105228 10.1371/journal.ppat.1005560 PMC4841533 73 A. Kulkarni T. Ferreira C. Bretscher A. Grewenig N. El-Andaloussi S. Bonifati T. Marttila V. Palissot J. A. Hossain F. Azuaje H. Miletic L. A. R. Ystaas A. Golebiewska S. P. Niclou R. Roeth B. Niesler A. Weiss L. Brino A. Marchini Oncolytic H-1 parvovirus binds to sialic acid on laminins for cell attachment and entry Nat. Commun. 12 3834 2021 34158478 10.1038/s41467-021-24034-7 PMC8219832 74 L. Farr S. Ghosh S. Moonah Role of MIF cytokine/CD74 receptor pathway in protecting against injury and promoting repair Front. Immunol. 11 1273 2020 32655566 10.3389/fimmu.2020.01273 PMC7325688 75 P. K. Wallace G. R. Yeaman K. Johnson J. E. Collins P. M. Guyre C. R. Wira MHC class II expression and antigen presentation by human endometrial cells J. Steroid Biochem. Mol. Biol. 76 203 211 2001 11384879 10.1016/s0960-0760(00)00149-7 76 M. L. Stanifer C. Guo P. Doldan S. Boulant Importance of type I and III interferons at respiratory and intestinal barrier surfaces Front. Immunol. 11 608645 2020 33362795 10.3389/fimmu.2020.608645 PMC7759678 77 A. Vanderheiden P. Ralfs T. Chirkova A. A. Upadhyay M. G. Zimmerman S. Bedoya H. Aoued G. M. Tharp K. L. Pellegrini C. Manfredi E. Sorscher B. Mainou J. L. Lobby J. E. Kohlmeier A. C. Lowen P. Y. Shi V. D. Menachery L. J. Anderson A. Grakoui S. E. Bosinger M. S. Suthar Type I and type III interferons restrict SARS-CoV-2 infection of human airway epithelial cultures J. Virol. 94 e00985-20 2020 32699094 10.1128/JVI.00985-20 PMC7495371 78 R. He C. A. Torres Y. Wang C. He G. Zhong Type-I interferon signaling protects against Chlamydia trachomatis Infect. Immun. 91 e0015323 2023 37191510 10.1128/iai.00153-23 PMC10269118 79 M. Hagiyama R. Kimura A. Yoneshige T. Inoue T. Otani A. Ito Cell adhesion molecule 1 contributes to cell survival in crowded epithelial monolayers Int. J. Mol. Sci. 21 4123 2020 32527032 10.3390/ijms21114123 PMC7312920 80 M. Nassar Y. Tabib T. Capucha G. Mizraji T. Nir M. Pevsner-Fischer G. Zilberman-Schapira O. Heyman G. Nussbaum H. Bercovier A. Wilensky E. Elinav T. Burstyn-Cohen A. H. Hovav GAS6 is a key homeostatic immunological regulator of host-commensal interactions in the oral mucosa Proc. Natl. Acad. Sci. U.S.A. 114 E337 E346 2017 28049839 10.1073/pnas.1614926114 PMC5255577 81 D. Yang O. Chertov S. N. Bykovskaia Q. Chen M. J. Buffo J. Shogan M. Anderson J. M. Schroder J. M. Wang O. M. Howard J. J. Oppenheim Beta-defensins: Linking innate and adaptive immunity through dendritic and T cell CCR6 Science 286 525 528 1999 10521347 10.1126/science.286.5439.525 82 M. E. Ritchie B. Phipson D. Wu Y. Hu C. W. Law W. Shi G. K. Smyth limma Nucleic Acids Res. 43 e47 2015 25605792 10.1093/nar/gkv007 PMC4402510 83 T. Wu E. Hu S. Xu M. Chen P. Guo Z. Dai T. Feng L. Zhou W. Tang L. Zhan X. Fu S. Liu X. Bo G. Yu clusterProfiler 4.0: A universal enrichment tool for interpreting omics data Innovation 2 100141 2021 34557778 10.1016/j.xinn.2021.100141 PMC8454663 84 Y. Hao S. Hao E. Andersen-Nissen W. M. Mauck III S. Zheng A. Butler M. J. Lee A. J. Wilk C. Darby M. Zager P. Hoffman M. Stoeckius E. Papalexi E. P. Mimitou J. Jain A. Srivastava T. Stuart L. M. Fleming B. Yeung A. J. Rogers J. M. McElrath C. A. Blish R. Gottardo P. Smibert R. Satija Integrated analysis of multimodal single-cell data Cell 184 3573 3587.e29 2021 34062119 10.1016/j.cell.2021.04.048 PMC8238499 85 C. Hafemeister R. Satija Normalization and variance stabilization of single-cell RNA-seq data using regularized negative binomial regression Genome Biol. 20 296 2019 31870423 10.1186/s13059-019-1874-1 PMC6927181 86 N. Borcherding A. Vishwakarma A. P. Voigt A. Bellizzi J. Kaplan K. Nepple A. K. Salem R. W. Jenkins Y. Zakharia W. Zhang Mapping the immune environment in clear cell renal carcinoma by single-cell genomics Commun. Biol. 4 122 2021 33504936 10.1038/s42003-020-01625-6 PMC7840906 87 J. Alquicira-Hernandez J. E. Powell Nebulosa recovers single-cell gene expression signals by kernel density estimation Bioinformatics 37 2485 2487 2021 33459785 10.1093/bioinformatics/btab003 88 M. Andreatta S. J. Carmona UCell: Robust and scalable single-cell gene signature scoring Comput. Struct. Biotechnol. J. 19 3796 3798 2021 34285779 10.1016/j.csbj.2021.06.043 PMC8271111 89 S. Siebert J. A. Farrell J. F. Cazet Y. Abeykoon A. S. Primack C. E. Schnitzler C. E. Juliano Stem cell differentiation trajectories in Hydra Science 365 eaav9314 2019 31346039 10.1126/science.aav9314 PMC7104783 90 P. Angerer L. Haghverdi M. Buttner F. J. Theis C. Marr F. Buettner destiny: Diffusion maps for large-scale single-cell data in R Bioinformatics 32 1241 1243 2016 26668002 10.1093/bioinformatics/btv715 91 L. Garcia-Alonso C. H. Holland M. M. Ibrahim D. Turei J. Saez-Rodriguez Benchmark and integration of resources for the estimation of human transcription factor activities Genome Res. 29 1363 1375 2019 31340985 10.1101/gr.240663.118 PMC6673718 92 Y. Hao T. Stuart M. H. Kowalski S. Choudhary P. Hoffman A. Hartman A. Srivastava G. Molla S. Madad C. Fernandez-Granda R. Satija Dictionary learning for integrative, multimodal and scalable single-cell analysis Nat. Biotechnol. 42 293 304 2024 37231261 10.1038/s41587-023-01767-y PMC10928517 93 O. Gonzalez-Velasco, ClusterFoldSimilarity: Calculate similarity of clusters from different single cell samples using foldchanges. (2024). 94 S. E. Marsh, scCustomize: Custom Visualizations & Functions for Streamlined Analyses of Single Cell Sequencing. 10.5281/zenodo.5706430 ",
  "metadata": {
    "Title of this paper": "Dictionary learning for integrative, multimodal and scalable single-cell analysis",
    "Journal it was published in:": "Science Advances",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12494012/"
  }
}