{
  "title": "Paper_836",
  "abstract": "pmc Cell Death Discov Cell Death Discov 2906 cddiscover Cell Death Discovery 2058-7716 Nature Publishing Group PMC12462522 PMC12462522.1 12462522 12462522 40998798 10.1038/s41420-025-02722-3 2722 1 Article TRIM21 promotes colorectal cancer development through regulating DNA replication by TCF3/MCM2/5 axis http://orcid.org/0000-0002-5991-7919 Zhang Xintian 1 Yao Han 1 Hou Yichao 1 Zhou Kun 1 Liang Yu 1 Hou Lidan 1 Zhang Xingming 2 Wang Wenfeng 2 Du Leilei 2 Yao Mengfei 2 http://orcid.org/0000-0003-0016-6505 Wang Jianhua jianhuaw2007@qq.com 2 http://orcid.org/0000-0001-9657-0021 Meng Xiangjun meng_xiangjun@yahoo.com 1 1 https://ror.org/0220qvk04 grid.16821.3c 0000 0004 0368 8293 Shanghai Key Laboratory of Gut Microecology and Associated Major Diseases Research, Digestive Disease Research and Clinical Translation Center, Department of Gastroenterology, Shanghai Ninth People’s Hospital, Shanghai Jiao Tong University School of Medicine, 2 https://ror.org/013q1eq08 grid.8547.e 0000 0001 0125 2443 Cancer Institute, Fudan University Shanghai Cancer Center, Department of Oncology, Shanghai Medical College, Fudan University, 25 9 2025 2025 11 478456 422 25 1 2025 3 8 2025 20 8 2025 25 09 2025 26 09 2025 26 09 2025 © The Author(s) 2025 2025 https://creativecommons.org/licenses/by/4.0/ Open Access http://creativecommons.org/licenses/by/4.0/ Disrupting DNA replication has been employed for treating cancers. In the present study, we found that Tripartite motif containing 21 (TRIM21) was highly expressed in colorectal cancer (CRC) and could be valuable for predicting the prognosis of CRC patients. Further study demonstrated that TRIM21 positively regulated the expression of MCM2 and MCM5, DNA replication and proliferation of CRC cells both in vitro and in vivo. In addition, TRIM21 knockdown inhibited both replication initiation and velocity, and increased the chemosensitivity of CRC cells to 5-FU and SN-38. Our study also revealed that DNA replication inhibition following TRIM21 knockdown could not be restored by cell cycle checkpoint kinase inhibitors, but partially by Transcription Factor 3 (TCF3) knockdown. TCF3 directly suppressed MCM2 MCM5 Subject terms Gastrointestinal cancer Cell growth Interdisciplinary Program of Shanghai Jiao Tong University,YG2024ZD11 Interdisciplinary Program of Shanghai Ninth People’s Hospital,JYJC202125 https://doi.org/10.13039/501100001809 National Natural Science Foundation of China (National Science Foundation of China) 32071377 Yao Han pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement yes pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes issue-copyright-statement © Cell Death Differentiation Association (ADMC) 2025 Introduction Colorectal cancer (CRC) is one of the malignant tumors with increasing morbidity and mortality rates [ 1 2 DNA replication is a tightly regulated process that involves the coordination of many protein molecules [ 3 4 5 6 7 9 10 11 Replication stress (RS) is a major challenge for maintaining genome stability. RS can be induced by inhibitors of DNA replication or aberrant expression of DNA replication proteins et al. [ 4 12 17 18 19 12 16 20 21 22 15 17 23 28 Tripartite motif containing 21 (TRIM21) belongs to the TRIM protein family and is encoded by TRIM21 29 30 32 In this paper, we reported that TRIM21 positively regulated DNA replication and proliferation of CRC cells through Transcription Factor 3 (TCF3). Suppressing TRIM21 expression could enhance the sensitivity of CRC cells to chemotherapeutic drugs interfering with DNA synthesis. These new findings might provide promising alternative options for CRC in clinic. Results TRIM21 level was correlated with clinicopathological features and prognosis of CRC patients In Cohort 1, TRIM21 mRNA level was significantly higher in CRC tissues than that in normal tissues, consistent with the results from the NCBI Gene Expression Omnibus (GEO) database ( GSE100179 http://gepia.cancer-pku.cn/ 1 B 1 1C 1D 1 F Fig. 1 TRIM21 level was correlated with clinicopathological features and prognosis of CRC patients. A n n P B n n GSE100179 n n n n P C n n P D n n n P E n F n n TRIM21 regulated CRC cell proliferation and was associated with DNA replication Following detection of TRIM21 expression across multiple CRC cell lines (Supplementary Fig. 1A B 1C 2A 2B 1D 2C 2D 3 4 2 F Fig. 2 TRIM21 regulated CRC cell proliferation and was associated with DNA replication. A P P B P P C n D P P P E P P P F TRIM21 regulated DNA replication in CRC cells Verifying the effect on DNA replication, we found the proportion of EdU-positive cells in the TRIM21 knockdown group was significantly lower than that in the control group, and vice versa (Fig. 3 B 2A B 28 33 34 35 2C D 3C 3D 2E 3E Fig. 3 TRIM21 regulated DNA replication in CRC cells. A P P P B P C D E P Temporal and spatial distribution of TRIM21 protein Our immunoblotting data in Fig. 2F 3A 3B 3C 3D 3E TRIM21 knockdown enhanced the chemosensitivity of CRC cells As mentioned above, decreased levels of replication-associated proteins would result in fewer origin “licensing” events, potentially increasing tumor cell susceptibility to replication inhibitors [ 12 16 20 36 37 4A 4 C 4A D Fig. 4 TRIM21 knockdown enhanced the chemosensitivity of CRC cells. A P P B P P C P P P P Regulation of DNA replication by TRIM21 was independent of the DNA damage response DNA damage activates DNA damage response (DRR), during which the cell cycle will be transiently arrested to repair these damages [ 38 39 5A 40 41 38 5B 42 5C TCF3 regulated DNA replication of CRC cells As TRIM21 regulated MCM2 and MCM5 mRNA levels in our study, we examined the transcriptional regulation of MCM2 MCM5 https://maayanlab.cloud/chea3/ 5 B MCM2 MCM5 5C 43 http://cistrome.org/db/#/ 5C MCM2 MCM2 MCM5 MCM5 6A B MCM2 MCM5 Fig. 5 TCF3 regulated DNA replication of CRC cells. A P B P P P C MCM2 MCM5 D P E P F P P G P H P P P P We also explored whether TCF3 could function as a substrate of TRIM21, but the Co-Immunoprecipitation (Co-IP) experiment did not show any interaction between the two (Supplementary Fig. 6C 44 45 6D TCF3 TCF3 6E When studying TCF3’s effects on DNA replication in CRC cells, we found that TCF3 overexpression inhibited cell proliferation and reduced the percentage of EdU-positive cells, while TCF3 knockdown had the opposite results (Fig. 5 F 5 H TCF3 downregulation partially restored the inhibition of DNA replication caused by TRIM21 knockdown Rescue experiments were carried out to investigate whether TRIM21 regulated DNA replication through TCF3. Figure 6 B 6C 6 E 6F Fig. 6 TCF3 downregulation partially restored the inhibition of DNA replication caused by TRIM21 knockdown. A B A B P P P C P P D E P P P F P P P TRIM21 regulated tumor growth via TCF3 in vivo A subcutaneous xenograft tumor model was established using lentivirus-stably transfected HCT116 cell lines (Supplementary Fig. 7A B 7 B 7C 7C E Fig. 7 TRIM21 regulated tumor growth via TCF3 in vivo. A n B P P P C P P P D Altogether, TRIM21 knockdown in CRC cells upregulated TCF3 expression, which in turn inhibited MCM2 MCM5 7D Discussion The present study demonstrated that TRIM21 modulated MCM2 MCM5 It is reported that TRIM21 plays diverse roles in different cancers through its E3 ligase activity. For example, on the one hand, TRIM21 translocated β-catenin from cytoplasm to nucleus, thus promoting glioblastoma progression [ 46 47 48 49 50 51 TCF3 Regarding research on TCF3, it has been reported to play a suppressive role in CRC tumorigenesis, but the transcriptional regulation of MCM2 MCM5 52 53 MCM2 MCM5 What’s more, studies have revealed that aberrant MCMs expression can induce RS and enhance the efficacy of replication inhibitors. For instance, MCMs knockdown in pancreatic ductal adenocarcinoma and CRC cells enhanced the sensitivity of tumor cells to CMG inhibitors [ 25 21 22 48 In conclusion, by employing clinical samples and a series in vitro and in vivo experiments, we preliminary explored the mechanism by which TRIM21 regulating DNA replication through TCF3/MCM2/5 axis, and eventually affecting CRC development and chemosensitivity to replication inhibitors. Materials and methods Cell culture and treatment Human normal colonic epithelial cells NCM460 and HCT8-5FU cells were purchased from iCell Bioscience Inc. (Shanghai, China). Other CRC cell lines were from the ATCC. All cells were cultured according to the ATCC protocol. All human cell lines have been authenticated using STR profiling. All experiments were performed with mycoplasma-free cells. jetPRIME ® 2 RT-qPCR Total RNA was isolated according to the protocol of TRIzol reagent (Ambion, USA). PrimeScript™ RT reagent Kit with gDNA Eraser (TAKARA, Japan) and ProFlex PCR System (Thermo Fisher Scientific, USA) were used for reverse transcription. RT-qPCR was performed with TB Green ® −ΔΔCt 3 Western blot Cells were lysed with RIPA lysis buffer (Thermo Fisher Scientific, USA) and kept on ice for 1 h. Next, the supernatant was acquired after centrifugation and quantified. 40 μg total protein was then separated by SDS-PAGE and transferred onto PVDF membranes (Millipore, USA). The membranes were treated with 5% skim milk, followed by incubation with primary and secondary antibodies. Primary antibodies against GAPDH (60004-1-Ig), Histone-H3 (17168-1-AP), Lamin B1 (12987-1-AP), TRIM21 (12108-1-AP), PCNA (60097-1-Ig) and TCF3 (21242-1-AP) were from Proteintech (USA); CCND1 (#2922), CDK4 (#12790) and CDK6 (#13331) were from CST (USA); γH2AX (ab81299), pCHK1 (ab58567) and Myc-tag (ab9132) were from Abcam (UK); MCM2 (A23477), MCM5 (A5008) and Flag-tag (AE092) were from ABclonal (China). The results were visualized and imaged by the ECL kit and chemiluminescence imaging system (Tanon, China). Nuclear and chromatin protein extraction Nuclear and chromatin proteins were extracted with the nuclear protein extraction kit (Thermo Fisher Scientific, USA). Briefly, cells were incubated with Cytoplasmic Extraction Reagent Ⅰ and Ⅱ sequentially on ice. The supernatant was removed and the pellet was suspended with Nuclear Extraction Reagent, followed by vortexing for 15 s every 2 min in 40 min. Lamin B1 was used as an internal control. Chromatin protein extraction was performed with ChromaFlash™ Chromatin Extraction Kit (Epigentek, USA). In brief, cells were cross-linked and lysed with Working Lysis Buffer. After centrifugation, the supernatant was supplemented with Chromatin Buffer. Histone-H3 was used as an internal control. Flow cytometry analysis Cell cycle and apoptosis analysis were carried out with PI/RNase Staining Buffer and Annexin-V-PE/7-AAD Apoptosis Detection Kit (BD Biosciences, USA), respectively. For cell cycle analysis, cells were treated with RNase and then stained with PI. For apoptosis analysis, cells were stained successively with Annexin-V-PE and 7-AAD. All samples were protected from light and tested as soon as possible. Cell viability and proliferation assay Cells were seeded into 96-well plates, and proliferation/viability was detected by CCK-8 according to the protocol (DOJINDO LABORATORIES, Japan). The absorbance value at 450 nm wavelength was measured using a microplate reader (BioTek, USA). EdU staining and detection EdU staining was performed by Cell-Light EdU Apollo In Vitro Kit (Ribobio, China) according to manufacturer’s instructions. Briefly, cells were pulsed with 10 μM EdU for 2 hours before fixation. After neutralization and permeabilization, cells were incubated in the dark for 10 minutes with Apollo staining solution. EdU detection was implemented with laser confocal microscopy (Leica, Germany) and flow cytometry (Beckman Coulter, USA). Cell synchronization The experiment referred to several literatures with some modifications [ 35 54 DNA fiber assay The experiment referred to several literatures with some modifications [ 55 57 https://www.leica-microsystems.com/ Immunofluorescence Cells were seeded in confocal culture dishes, fixed, then permeabilized and blocked, followed by incubation with primary antibody against TRIM21 (12108-1-AP, Proteintech, USA) at 4 °C overnight. 12 hours later, cells were incubated with secondary antibody and anti-fluorescence quench agent (Thermo Fisher Scientific, USA). Observations were performed using laser confocal microscopy (Leica, German) as soon as possible. Isolation of proteins on nascent DNA (iPOND) The experiment referred to literatures with some modifications [ 58 59 Chromatin Immunoprecipitation (ChIP) ChIP assay was carried out with EZ-ChIP™ Kit (Merck, Germany) according to manufacturer’s instructions. After cross-linking and neutralization, cells were resuspended in the SDS lysate mixture. Immunoprecipitation dilution buffer was added to each sample, and the mixture was sonicated and centrifuged. Next, the samples were added with indicated antibodies and incubated overnight at 4 °C. Due to the commercial unavailability of ChIP-grade antibodies against endogenous TRIM21 and TCF3, we used validated anti-Flag (AE092, ABclonal, China) and anti-Myc (ab9132, Abcam, UK) antibodies. The second day, each sample was added with protein G agarose and incubated for 1 h. After that, the agarose was washed and eluted. The eluted samples were then reversely cross-linked and used for DNA purification, purified DNA was used for PCR or qPCR analysis. The primer sequences were listed in Supplementary Table 4 Luciferase reporter assay Luciferase reporter assay was conducted with Dual Luciferase Reporter Gene Assay Kit (11402ES, YEASEN, China) according to manufacturer’s protocol. Cells were co-transfected with luciferase reporter plasmids and gene overexpression plasmid or control plasmid. After 48 h, cells were lysed, and both firefly and Renilla luciferase activities were tested using a multimode microplate reader (BioTek, USA). Transfection efficiency was normalized by dividing the firefly luciferase activity by the corresponding Renilla luciferase activity. Immunohistochemistry (IHC) Paraffin sections were placed at 65°C overnight and deparaffinized with xylene and ethanol. Endogenous peroxidase was then removed by 3% hydrogen peroxide-methanol. Subsequently, the sections were treated with Tris/EDTA and blocked with 1% BSA, followed by incubation with primary antibody at 4 °C overnight. Primary antibodies against TRIM21 (12108-1-AP) and TCF3 (67140-1-Ig) were from Proteintech (USA); MCM2 (A23477), MCM5 (A5008) and MKI67 (A20018) were from ABclonal (China); BrdU (ab6326) was from Abcam (UK). The following day, the sections were incubated with secondary antibody and stained with 3,3’-diaminobenzidine and hematoxylin. Eventually, these sections were dehydrated and sealed. The results were interpreted by immunoreactive score (IRS) performed by two pathologists. The scoring criteria involved staining intensity (SI) and percentage of positive cells (PP). The SI was scored from 0 to 3 (0, negative staining; 1, weak staining; 2, moderate staining; 3, strong staining). The PP was scored from 0 to 4 (0, negative; 1, PP ≤ 25%; 2, 25% < PP ≤ 50%; 3, 50% < PP ≤ 75%; 4, 75% < PP ≤ 100%). The IRS was the product of these two scores. Co-Immunoprecipitation (Co-IP) Cells were lysed with Pierce® IP Lysis Buffer (Thermo Fisher Scientific, USA) and centrifuged. The supernatant was then divided and added with anti-TRIM21 (12108-1-AP, Proteintech, USA), anti-TCF3 (21242-1-AP, Proteintech, USA) or rabbit control IgG (AC005, ABclonal, China) antibody, followed by incubation overnight at 4 °C. The second day, each sample was added with Protein A/G-Agarose (Santa Cruz Biotechnology, USA) and incubated, followed by thorough washing and elution with loading buffer. Patient specimens Cohort1 contained 98 CRC samples and 97 normal samples. Clinicopathological characteristics and follow-up data were obtained from 93 CRC patients in Cohort2 (Supplementary Table 5 CRC xenograft model 4-week-old BALB/c male nude mice were purchased from Charles River Laboratories (Beijing, China) and housed in a specific pathogen-free environment. After skin disinfection, we injected 2 × 10 6 n 2 RNA sequencing The RNA sequencing was performed by OE Biotech Co, Ltd (Shanghai, China) using Illumina Hiseq X Ten platform to generate raw data. Each group had three biological replicates. The analysis of RNA-seq data was performed according to the TopHat-HTSeq-DeSeq2 frame. Statistical analysis Statistical analysis was performed by GraphPad Prism 8.0 (GraphPad Software). All experiments were repeated at least three times, and data were presented as mean ± SD. Student’s t U P Supplementary information  Revised Supplementary Data Full and Uncropped Western Blots Publisher’s note Supplementary information The online version contains supplementary material available at 10.1038/s41420-025-02722-3. Acknowledgements We are grateful to Dr. Liguang Chen for the critical reading of the paper. This work was supported by the Interdisciplinary Program of Shanghai Jiao Tong University (YG2024ZD11), Interdisciplinary Program of Shanghai Ninth People’s Hospital (JYJC202125), Shanghai Sailing Program (22YF1423100) and National Natural Science Foundation of China (32071377, 82203245). Author contributions XTZ. performed original manuscript draft, investigation and formal analysis. HY provided funding and performed formal analysis. Y.C.H. provided funding. KZ performed the investigation and validation. YL performed investigation and validation. LDH, XMZ, WFW, LLD, and MFY performed the investigation. JHW was responsible for conceptualization, project administration, providing resources, supervision, reviewing and editing the manuscript. XJM was responsible for reviewing and editing the manuscript, validation, supervision, providing resources, project administration, investigation, funding acquisition, formal analysis, data curation, conceptualization. Data availability Our high-throughput sequencing data can be downloaded from the GEO database under the accession number GSE276995 GSE100179 Competing interests The authors declare no competing interests. Ethics approval and consent to participate The written informed consent form was obtained from each CRC patient and this research was approved by the Ethics Committee of the Ninth People’s Hospital Affiliated with Shanghai Jiao Tong University. The procedure complied with the provisions of the Declaration of Helsinki of 1975. Establishment of CRC xenograft model conformed to the National Institutes of Health Guidelines for the Care and Use of Laboratory Animals. Animal feeding and experimental procedures were in accordance with principles of the Ethics Committee of Shanghai Jiao Tong University. References 1. Siegel RL Giaquinto AN Jemal A Cancer statistics, 2024 CA Cancer J Clin 2024 74 12 49 38230766 10.3322/caac.21820 Siegel RL, Giaquinto AN, Jemal A. Cancer statistics, 2024. CA Cancer J Clin. 2024;74:12–49. 38230766 10.3322/caac.21820 2. Xie YH Chen YX Fang JY Comprehensive review of targeted therapy for colorectal cancer Signal Transduct Target Ther 2020 5 22 10.1038/s41392-020-0116-z 32296018 PMC7082344 Xie YH, Chen YX, Fang JY. Comprehensive review of targeted therapy for colorectal cancer. Signal Transduct Target Ther. 2020;5:22. 32296018 10.1038/s41392-020-0116-z PMC7082344 3. Attali I Botchan MR Berger JM Structural mechanisms for replicating DNA in eukaryotes Annu Rev Biochem 2021 90 77 106 10.1146/annurev-biochem-090120-125407 33784179 Attali I, Botchan MR, Berger JM. Structural mechanisms for replicating DNA in eukaryotes. Annu Rev Biochem. 2021;90:77–106. 33784179 10.1146/annurev-biochem-090120-125407 4. Fragkos M Ganier O Coulombe P Méchali M DNA replication origin activation in space and time Nat Rev Mol Cell Biol 2015 16 360 74 10.1038/nrm4002 25999062 Fragkos M, Ganier O, Coulombe P, Méchali M. DNA replication origin activation in space and time. Nat Rev Mol Cell Biol. 2015;16:360–74. 25999062 10.1038/nrm4002 5. Wu L Chen H Yang C Origin recognition complex subunit 1(ORC1) is a potential biomarker and therapeutic target in cancer BMC Med Genomics 2023 16 243 10.1186/s12920-023-01691-9 37833711 PMC10571394 Wu L, Chen H, Yang C. Origin recognition complex subunit 1(ORC1) is a potential biomarker and therapeutic target in cancer. BMC Med Genomics. 2023;16:243. 37833711 10.1186/s12920-023-01691-9 PMC10571394 6. Petropoulos M Champeris Tsaniras S Nikou S Maxouri S Dionellis VS Kalogeropoulou A Cdt1 overexpression drives colorectal carcinogenesis through origin overlicensing and DNA damage J Pathol 2023 259 10 20 10.1002/path.6017 36210634 Petropoulos M, Champeris Tsaniras S, Nikou S, Maxouri S, Dionellis VS, Kalogeropoulou A, et al. Cdt1 overexpression drives colorectal carcinogenesis through origin overlicensing and DNA damage. J Pathol. 2023;259:10–20. 36210634 10.1002/path.6017 7. Wang J Amin A Cheung MH Shi L Liang C Targeted inhibition of the expression of both MCM5 and MCM7 by miRNA-214 impedes DNA replication and tumorigenesis in hepatocellular carcinoma cells Cancer Lett 2022 539 215677 10.1016/j.canlet.2022.215677 35490917 Wang J, Amin A, Cheung MH, Shi L, Liang C. Targeted inhibition of the expression of both MCM5 and MCM7 by miRNA-214 impedes DNA replication and tumorigenesis in hepatocellular carcinoma cells. Cancer Lett. 2022;539:215677. 35490917 10.1016/j.canlet.2022.215677 8. Zhou H, Xiong Y, Zhang G, Liu Z, Li L, Hou S, et al. Elevated expression of minichromosome maintenance 3 indicates poor outcomes and promotes G1/S cell cycle progression, proliferation, migration and invasion in colorectal cancer. Biosci Rep. 2020;40:BSR20201503. 10.1042/BSR20201503 PMC7350890 32597491 9. Sheng Y Wei J Yu F Xu H Yu C Wu Q A critical role of nuclear m6A reader YTHDC1 in leukemogenesis by regulating MCM complex-mediated DNA replication Blood 2021 138 2838 52 10.1182/blood.2021011707 34255814 PMC8718631 Sheng Y, Wei J, Yu F, Xu H, Yu C, Wu Q, et al. A critical role of nuclear m6A reader YTHDC1 in leukemogenesis by regulating MCM complex-mediated DNA replication. Blood. 2021;138:2838–52. 34255814 10.1182/blood.2021011707 PMC8718631 10. Giaginis C Georgiadou M Dimakopoulou K Tsourouflis G Gatzidou E Kouraklis G Clinical significance of MCM-2 and MCM-5 expression in colon cancer: association with clinicopathological parameters and tumor proliferative capacity Dig Dis Sci 2009 54 282 91 10.1007/s10620-008-0305-z 18465232 Giaginis C, Georgiadou M, Dimakopoulou K, Tsourouflis G, Gatzidou E, Kouraklis G, et al. Clinical significance of MCM-2 and MCM-5 expression in colon cancer: association with clinicopathological parameters and tumor proliferative capacity. Dig Dis Sci. 2009;54:282–91. 18465232 10.1007/s10620-008-0305-z 11. Zhao Y Wang Y Zhu F Zhang J Ma X Zhang D Gene expression profiling revealed MCM3 to be a better marker than Ki67 in prognosis of invasive ductal breast carcinoma patients Clin Exp Med 2020 20 249 59 10.1007/s10238-019-00604-4 31980982 Zhao Y, Wang Y, Zhu F, Zhang J, Ma X, Zhang D. Gene expression profiling revealed MCM3 to be a better marker than Ki67 in prognosis of invasive ductal breast carcinoma patients. Clin Exp Med. 2020;20:249–59. 31980982 10.1007/s10238-019-00604-4 12. Boyer AS Walter D Sørensen CS DNA replication and cancer: from dysfunctional replication origin activities to therapeutic opportunities Semin Cancer Biol 2016 37-38 16 25 10.1016/j.semcancer.2016.01.001 26805514 Boyer AS, Walter D, Sørensen CS. DNA replication and cancer: from dysfunctional replication origin activities to therapeutic opportunities. Semin Cancer Biol. 2016;37-38:16–25. 26805514 10.1016/j.semcancer.2016.01.001 13. Thomas A Pommier Y Targeting topoisomerase I in the era of precision medicine Clin Cancer Res 2019 25 6581 9 10.1158/1078-0432.CCR-19-1089 31227499 PMC6858945 Thomas A, Pommier Y. Targeting topoisomerase I in the era of precision medicine. Clin Cancer Res. 2019;25:6581–9. 31227499 10.1158/1078-0432.CCR-19-1089 PMC6858945 14. Lajous H Lelièvre B Vauléon E Lecomte P Garcion E Rethinking alkylating(-Like) agents for solid tumor management Trends Pharm Sci 2019 40 342 57 10.1016/j.tips.2019.03.003 30979523 Lajous H, Lelièvre B, Vauléon E, Lecomte P, Garcion E. Rethinking alkylating(-Like) agents for solid tumor management. Trends Pharm Sci. 2019;40:342–57. 30979523 10.1016/j.tips.2019.03.003 15. Mughal MJ Mahadevappa R Kwok HF DNA replication licensing proteins: Saints and sinners in cancer Semin Cancer Biol 2019 58 11 21 10.1016/j.semcancer.2018.11.009 30502375 Mughal MJ, Mahadevappa R, Kwok HF. DNA replication licensing proteins: Saints and sinners in cancer. Semin Cancer Biol. 2019;58:11–21. 30502375 10.1016/j.semcancer.2018.11.009 16. Petropoulos M Champeris Tsaniras S Taraviras S Lygerou Z Replication licensing aberrations, replication stress, and genomic instability Trends Biochem Sci 2019 44 752 64 10.1016/j.tibs.2019.03.011 31054805 Petropoulos M, Champeris Tsaniras S, Taraviras S, Lygerou Z. Replication licensing aberrations, replication stress, and genomic instability. Trends Biochem Sci. 2019;44:752–64. 31054805 10.1016/j.tibs.2019.03.011 17. Xiang S Reed DR Alexandrow MG The CMG helicase and cancer: a tumor “engine” and weakness with missing mutations Oncogene 2023 42 473 90 10.1038/s41388-022-02572-8 36522488 PMC9948756 Xiang S, Reed DR, Alexandrow MG. The CMG helicase and cancer: a tumor “engine” and weakness with missing mutations. Oncogene. 2023;42:473–90. 36522488 10.1038/s41388-022-02572-8 PMC9948756 18. Moiseeva TN Bakkenist CJ Dormant origin signaling during unperturbed replication DNA Repair 2019 81 102655 10.1016/j.dnarep.2019.102655 31311769 PMC6764875 Moiseeva TN, Bakkenist CJ. Dormant origin signaling during unperturbed replication. DNA Repair. 2019;81:102655. 31311769 10.1016/j.dnarep.2019.102655 PMC6764875 19. Morales-Valencia J David G The origins of cancer cell dormancy Curr Opin Genet Dev 2022 74 101914 10.1016/j.gde.2022.101914 35500379 PMC9156570 Morales-Valencia J, David G. The origins of cancer cell dormancy. Curr Opin Genet Dev. 2022;74:101914. 35500379 10.1016/j.gde.2022.101914 PMC9156570 20. Thakur BL Ray A Redon CE Aladjem MI Preventing excess replication origin activation to ensure genome stability Trends Genet 2022 38 169 81 10.1016/j.tig.2021.09.008 34625299 PMC8752500 Thakur BL, Ray A, Redon CE, Aladjem MI. Preventing excess replication origin activation to ensure genome stability. Trends Genet. 2022;38:169–81. 34625299 10.1016/j.tig.2021.09.008 PMC8752500 21. Hatoyama Y Kanemaki MT The assembly of the MCM2-7 hetero-hexamer and its significance in DNA replication Biochem Soc Trans 2023 51 1289 95 10.1042/BST20221465 37145026 PMC10317167 Hatoyama Y, Kanemaki MT. The assembly of the MCM2-7 hetero-hexamer and its significance in DNA replication. Biochem Soc Trans. 2023;51:1289–95. 37145026 10.1042/BST20221465 PMC10317167 22. Reed DR Alexandrow MG Myc and the replicative CMG helicase: the creation and destruction of cancer: Myc over-activation of CMG helicases drives tumorigenesis and creates a vulnerability in CMGs for therapeutic intervention Bioessays 2020 42 e1900218 10.1002/bies.201900218 32080866 PMC8223603 Reed DR, Alexandrow MG. Myc and the replicative CMG helicase: the creation and destruction of cancer: Myc over-activation of CMG helicases drives tumorigenesis and creates a vulnerability in CMGs for therapeutic intervention. Bioessays. 2020;42:e1900218. 32080866 10.1002/bies.201900218 PMC8223603 23. Gao Y Liu Y Liu Y Peng Y Yuan B Fu Y UHRF1 promotes androgen receptor-regulated CDC6 transcription and anti-androgen receptor drug resistance in prostate cancer through KDM4C-mediated chromatin modifications Cancer Lett 2021 520 172 83 10.1016/j.canlet.2021.07.012 34265399 Gao Y, Liu Y, Liu Y, Peng Y, Yuan B, Fu Y, et al. UHRF1 promotes androgen receptor-regulated CDC6 transcription and anti-androgen receptor drug resistance in prostate cancer through KDM4C-mediated chromatin modifications. Cancer Lett. 2021;520:172–83. 34265399 10.1016/j.canlet.2021.07.012 24. Wang Y Chen H Liu W Yan H Zhang Y Cheung AHK MCM6 is a critical transcriptional target of YAP to promote gastric tumorigenesis and serves as a therapeutic target Theranostics 2022 12 6509 26 10.7150/thno.75431 36185598 PMC9516235 Wang Y, Chen H, Liu W, Yan H, Zhang Y, Cheung AHK, et al. MCM6 is a critical transcriptional target of YAP to promote gastric tumorigenesis and serves as a therapeutic target. Theranostics. 2022;12:6509–26. 36185598 10.7150/thno.75431 PMC9516235 25. Bryant VL Elias RM McCarthy SM Yeatman TJ Alexandrow MG Suppression of reserve MCM complexes chemosensitizes to gemcitabine and 5-fluorouracil Mol Cancer Res 2015 13 1296 305 10.1158/1541-7786.MCR-14-0464 26063742 PMC4573356 Bryant VL, Elias RM, McCarthy SM, Yeatman TJ, Alexandrow MG. Suppression of reserve MCM complexes chemosensitizes to gemcitabine and 5-fluorouracil. Mol Cancer Res. 2015;13:1296–305. 26063742 10.1158/1541-7786.MCR-14-0464 PMC4573356 26. Li J Liu J Liang Z He F Yang L Li P Simvastatin and Atorvastatin inhibit DNA replication licensing factor MCM7 and effectively suppress RB-deficient tumors growth Cell Death Dis 2017 8 e2673 10.1038/cddis.2017.46 28300827 PMC5386551 Li J, Liu J, Liang Z, He F, Yang L, Li P, et al. Simvastatin and Atorvastatin inhibit DNA replication licensing factor MCM7 and effectively suppress RB-deficient tumors growth. Cell Death Dis. 2017;8:e2673. 28300827 10.1038/cddis.2017.46 PMC5386551 27. Liang Z Li W Liu J Li J He F Jiang Y Simvastatin suppresses the DNA replication licensing factor MCM7 and inhibits the growth of tamoxifen-resistant breast cancer cells Sci Rep 2017 7 41776 10.1038/srep41776 28150753 PMC5288718 Liang Z, Li W, Liu J, Li J, He F, Jiang Y, et al. Simvastatin suppresses the DNA replication licensing factor MCM7 and inhibits the growth of tamoxifen-resistant breast cancer cells. Sci Rep. 2017;7:41776. 28150753 10.1038/srep41776 PMC5288718 28. Yu S Wang G Shi Y Xu H Zheng Y Chen Y MCMs in cancer: prognostic potential and mechanisms Anal Cell Pathol 2020 2020 3750294 10.1155/2020/3750294 PMC7023756 32089988 Yu S, Wang G, Shi Y, Xu H, Zheng Y, Chen Y. MCMs in cancer: prognostic potential and mechanisms. Anal Cell Pathol.2020;2020:3750294. 10.1155/2020/3750294 PMC7023756 32089988 29. Itoh K Itoh Y Frank MB Protein heterogeneity in the human Ro/SSA ribonucleoproteins. The 52- and 60-kD Ro/SSA autoantigens are encoded by separate genes J Clin Invest 1991 87 177 86 10.1172/JCI114968 1985094 PMC295020 Itoh K, Itoh Y, Frank MB. Protein heterogeneity in the human Ro/SSA ribonucleoproteins. The 52- and 60-kD Ro/SSA autoantigens are encoded by separate genes. J Clin Invest. 1991;87:177–86. 1985094 10.1172/JCI114968 PMC295020 30. Jones EL Laidlaw SM Dustin LB TRIM21/Ro52—roles in innate immunity and autoimmune disease Front Immunol 2021 12 738473 10.3389/fimmu.2021.738473 34552597 PMC8450407 Jones EL, Laidlaw SM, Dustin LB. TRIM21/Ro52—roles in innate immunity and autoimmune disease. Front Immunol. 2021;12:738473. 34552597 10.3389/fimmu.2021.738473 PMC8450407 31. Chen X Cao M Wang P Chu S Li M Hou P The emerging roles of TRIM21 in coordinating cancer metabolism, immunity and cancer treatment Front Immunol 2022 13 968755 10.3389/fimmu.2022.968755 36159815 PMC9506679 Chen X, Cao M, Wang P, Chu S, Li M, Hou P, et al. The emerging roles of TRIM21 in coordinating cancer metabolism, immunity and cancer treatment. Front Immunol. 2022;13:968755. 36159815 10.3389/fimmu.2022.968755 PMC9506679 32. Wang HT Hur S Substrate recognition by TRIM and TRIM-like proteins in innate immunity Semin Cell Dev Biol 2021 111 76 85 10.1016/j.semcdb.2020.09.013 33092958 PMC7572318 Wang HT, Hur S. Substrate recognition by TRIM and TRIM-like proteins in innate immunity. Semin Cell Dev Biol. 2021;111:76–85. 33092958 10.1016/j.semcdb.2020.09.013 PMC7572318 33. Li J Dong J Wang W Yu D Fan X Hui YC The human pre-replication complex is an open complex Cell 2023 186 98 111.e21 10.1016/j.cell.2022.12.008 36608662 Li J, Dong J, Wang W, Yu D, Fan X, Hui YC, et al. The human pre-replication complex is an open complex. Cell. 2023;186:98–111.e21. 36608662 10.1016/j.cell.2022.12.008 34. Lewis JS Gross MH Sousa J Henrikus SS Greiwe JF Nans A Mechanism of replication origin melting nucleated by CMG helicase assembly Nature 2022 606 1007 14 10.1038/s41586-022-04829-4 35705812 PMC9242855 Lewis JS, Gross MH, Sousa J, Henrikus SS, Greiwe JF, Nans A, et al. Mechanism of replication origin melting nucleated by CMG helicase assembly. Nature. 2022;606:1007–14. 35705812 10.1038/s41586-022-04829-4 PMC9242855 35. Surani AA Colombo SL Barlow G Foulds GA Montiel-Duarte C Optimizing cell synchronization using nocodazole or double thymidine block Methods Mol Biol 2021 2329 111 21 10.1007/978-1-0716-1538-6_9 34085219 Surani AA, Colombo SL, Barlow G, Foulds GA, Montiel-Duarte C. Optimizing cell synchronization using nocodazole or double thymidine block. Methods Mol Biol. 2021;2329:111–21. 34085219 10.1007/978-1-0716-1538-6_9 36. Vodenkova S Buchler T Cervena K Veskrnova V Vodicka P Vymetalkova V 5-fluorouracil and other fluoropyrimidines in colorectal cancer: Past, present and future Pharm Ther 2020 206 107447 10.1016/j.pharmthera.2019.107447 31756363 Vodenkova S, Buchler T, Cervena K, Veskrnova V, Vodicka P, Vymetalkova V. 5-fluorouracil and other fluoropyrimidines in colorectal cancer: Past, present and future. Pharm Ther. 2020;206:107447. 10.1016/j.pharmthera.2019.107447 31756363 37. Wu D Li Y Zhu L Zhang W Xu S Yang Y A biocompatible superparamagnetic chitosan-based nanoplatform enabling targeted SN-38 delivery for colorectal cancer therapy Carbohydr Polym 2021 274 118641 10.1016/j.carbpol.2021.118641 34702462 Wu D, Li Y, Zhu L, Zhang W, Xu S, Yang Y, et al. A biocompatible superparamagnetic chitosan-based nanoplatform enabling targeted SN-38 delivery for colorectal cancer therapy. Carbohydr Polym. 2021;274:118641. 34702462 10.1016/j.carbpol.2021.118641 38. Wang Y Huang Y Cheng E Liu X Zhang Y Yang J LSD1 is required for euchromatic origin firing and replication timing Signal Transduct Target Ther 2022 7 102 10.1038/s41392-022-00927-x 35414135 PMC9005705 Wang Y, Huang Y, Cheng E, Liu X, Zhang Y, Yang J, et al. LSD1 is required for euchromatic origin firing and replication timing. Signal Transduct Target Ther. 2022;7:102. 35414135 10.1038/s41392-022-00927-x PMC9005705 39. Wozniak KJ Simmons LA Hydroxyurea induces a stress response that alters DNA replication and nucleotide metabolism in Bacillus subtilis J Bacteriol 2021 203 e0017121 10.1128/JB.00171-21 34031038 PMC8407345 Wozniak KJ, Simmons LA. Hydroxyurea induces a stress response that alters DNA replication and nucleotide metabolism in Bacillus subtilis. J Bacteriol. 2021;203:e0017121. 34031038 10.1128/JB.00171-21 PMC8407345 40. Huang RX Zhou PK DNA damage response signaling pathways and targets for radiotherapy sensitization in cancer Signal Transduct Target Ther 2020 5 60 10.1038/s41392-020-0150-x 32355263 PMC7192953 Huang RX, Zhou PK. DNA damage response signaling pathways and targets for radiotherapy sensitization in cancer. Signal Transduct Target Ther. 2020;5:60. 32355263 10.1038/s41392-020-0150-x PMC7192953 41. Smith HL Southgate H Tweddle DA Curtin NJ DNA damage checkpoint kinases in cancer Expert Rev Mol Med 2020 22 e2 10.1017/erm.2020.3 32508294 Smith HL, Southgate H, Tweddle DA, Curtin NJ. DNA damage checkpoint kinases in cancer. Expert Rev Mol Med. 2020;22:e2. 32508294 10.1017/erm.2020.3 42. Li S Wang L Wang Y Zhang C Hong Z Han Z The synthetic lethality of targeting cell cycle checkpoints and PARPs in cancer treatment J Hematol Oncol 2022 15 147 10.1186/s13045-022-01360-x 36253861 PMC9578258 Li S, Wang L, Wang Y, Zhang C, Hong Z, Han Z. The synthetic lethality of targeting cell cycle checkpoints and PARPs in cancer treatment. J Hematol Oncol. 2022;15:147. 36253861 10.1186/s13045-022-01360-x PMC9578258 43. Wöhner M Tagoh H Bilic I Jaritz M Poliakova DK Fischer M Molecular functions of the transcription factors E2A and E2-2 in controlling germinal center B cell and plasma cell development J Exp Med 2016 213 1201 21 10.1084/jem.20152002 27261530 PMC4925024 Wöhner M, Tagoh H, Bilic I, Jaritz M, Poliakova DK, Fischer M, et al. Molecular functions of the transcription factors E2A and E2-2 in controlling germinal center B cell and plasma cell development. J Exp Med. 2016;213:1201–21. 27261530 10.1084/jem.20152002 PMC4925024 44. Li Z Huan C Wang H Liu Y Liu X Su X TRIM21-mediated proteasomal degradation of SAMHD1 regulates its antiviral activity EMBO Rep 2020 21 e47528 10.15252/embr.201847528 31797533 PMC6944907 Li Z, Huan C, Wang H, Liu Y, Liu X, Su X, et al. TRIM21-mediated proteasomal degradation of SAMHD1 regulates its antiviral activity. EMBO Rep. 2020;21:e47528. 31797533 10.15252/embr.201847528 PMC6944907 45. Kong X Lu X Wang S Hao J Guo D Wu H Type I interferon/STAT1 signaling regulates UBE2M-mediated antiviral innate immunity in a negative feedback manner Cell Rep 2023 42 112002 10.1016/j.celrep.2023.112002 36662617 Kong X, Lu X, Wang S, Hao J, Guo D, Wu H, et al. Type I interferon/STAT1 signaling regulates UBE2M-mediated antiviral innate immunity in a negative feedback manner. Cell Rep. 2023;42:112002. 36662617 10.1016/j.celrep.2023.112002 46. Li Y Bao L Zheng H Geng M Chen T Dai X E3 ubiquitin ligase TRIM21 targets TIF1γ to regulate β-catenin signaling in glioblastoma Theranostics 2023 13 4919 35 10.7150/thno.85662 37771771 PMC10526654 Li Y, Bao L, Zheng H, Geng M, Chen T, Dai X, et al. E3 ubiquitin ligase TRIM21 targets TIF1γ to regulate β-catenin signaling in glioblastoma. Theranostics. 2023;13:4919–35. 37771771 10.7150/thno.85662 PMC10526654 47. Wang F Zhang Y Shen J Yang B Dai W Yan J The ubiquitin E3 ligase TRIM21 promotes hepatocarcinogenesis by suppressing the p62-Keap1-Nrf2 antioxidant pathway Cell Mol Gastroenterol Hepatol 2021 11 1369 85 10.1016/j.jcmgh.2021.01.007 33482392 PMC8024979 Wang F, Zhang Y, Shen J, Yang B, Dai W, Yan J, et al. The ubiquitin E3 ligase TRIM21 promotes hepatocarcinogenesis by suppressing the p62-Keap1-Nrf2 antioxidant pathway. Cell Mol Gastroenterol Hepatol. 2021;11:1369–85. 33482392 10.1016/j.jcmgh.2021.01.007 PMC8024979 48. Zhu X Xue J Jiang X Gong Y Gao C Cao T TRIM21 suppresses CHK1 activation by preferentially targeting CLASPIN for K63-linked ubiquitination Nucleic Acids Res 2022 50 1517 30 10.1093/nar/gkac011 35048968 PMC8860585 Zhu X, Xue J, Jiang X, Gong Y, Gao C, Cao T, et al. TRIM21 suppresses CHK1 activation by preferentially targeting CLASPIN for K63-linked ubiquitination. Nucleic Acids Res. 2022;50:1517–30. 35048968 10.1093/nar/gkac011 PMC8860585 49. Nguyen JQ Irby RB TRIM21 is a novel regulator of Par-4 in colon and pancreatic cancer cells Cancer Biol Ther 2017 18 16 25 10.1080/15384047.2016.1252880 27830973 PMC5323013 Nguyen JQ, Irby RB. TRIM21 is a novel regulator of Par-4 in colon and pancreatic cancer cells. Cancer Biol Ther. 2017;18:16–25. 27830973 10.1080/15384047.2016.1252880 PMC5323013 50. Chen X Li Z Yong H Wang W Wang D Chu S Trim21-mediated HIF-1α degradation attenuates aerobic glycolysis to inhibit renal cancer tumorigenesis and metastasis Cancer Lett 2021 508 115 26 10.1016/j.canlet.2021.03.023 33794309 Chen X, Li Z, Yong H, Wang W, Wang D, Chu S, et al. Trim21-mediated HIF-1α degradation attenuates aerobic glycolysis to inhibit renal cancer tumorigenesis and metastasis. Cancer Lett. 2021;508:115–26. 33794309 10.1016/j.canlet.2021.03.023 51. Sun Z, Mai H, Xue C, Fan Z, Li J, Chen H, et al. Hsa-LINC02418/mmu-4930573I07Rik regulated by METTL3 dictates anti-PD-L1 immunotherapeutic efficacy via enhancement of Trim21-mediated PD-L1 ubiquitination. J Immunother Cancer. 2023;11:e007415. 10.1136/jitc-2023-007415 PMC10693898 38040417 52. Zhao H Zhao C Li H Zhang D Liu G E2A attenuates tumor-initiating capacity of colorectal cancer cells via the Wnt/beta-catenin pathway J Exp Clin Cancer Res 2019 38 276 10.1186/s13046-019-1261-5 31234887 PMC6591938 Zhao H, Zhao C, Li H, Zhang D, Liu G. E2A attenuates tumor-initiating capacity of colorectal cancer cells via the Wnt/beta-catenin pathway. J Exp Clin Cancer Res. 2019;38:276. 31234887 10.1186/s13046-019-1261-5 PMC6591938 53. Shah M Rennoll SA Raup-Konsavage WM Yochum GS A dynamic exchange of TCF3 and TCF4 transcription factors controls MYC expression in colorectal cancer cells Cell Cycle 2015 14 323 32 10.4161/15384101.2014.980643 25659031 PMC4353228 Shah M, Rennoll SA, Raup-Konsavage WM, Yochum GS. A dynamic exchange of TCF3 and TCF4 transcription factors controls MYC expression in colorectal cancer cells. Cell Cycle. 2015;14:323–32. 25659031 10.4161/15384101.2014.980643 PMC4353228 54. Wang RC Wang Z Synchronization of cultured cells to G1, S, G2, and M phases by double thymidine block Methods Mol Biol 2022 2579 61 71 10.1007/978-1-0716-2736-5_5 36045198 Wang RC, Wang Z. Synchronization of cultured cells to G1, S, G2, and M phases by double thymidine block. Methods Mol Biol. 2022;2579:61–71. 36045198 10.1007/978-1-0716-2736-5_5 55. Halliwell JA Gravells P Bryant HE DNA fiber assay for the analysis of DNA replication progression in human pluripotent stem cells Curr Protoc Stem Cell Biol 2020 54 e115 10.1002/cpsc.115 32584505 Halliwell JA, Gravells P, Bryant HE. DNA fiber assay for the analysis of DNA replication progression in human pluripotent stem cells. Curr Protoc Stem Cell Biol. 2020;54:e115. 32584505 10.1002/cpsc.115 56. Chanou A Hamperl S Single-molecule techniques to study chromatin Front Cell Dev Biol 2021 9 699771 10.3389/fcell.2021.699771 34291054 PMC8287188 Chanou A, Hamperl S. Single-molecule techniques to study chromatin. Front Cell Dev Biol. 2021;9:699771. 34291054 10.3389/fcell.2021.699771 PMC8287188 57. Biber S Wiesmüller L Analysis of replication dynamics using the single-molecule DNA fiber spreading assay Methods Mol Biol 2021 2267 57 71 10.1007/978-1-0716-1217-0_4 33786784 Biber S, Wiesmüller L. Analysis of replication dynamics using the single-molecule DNA fiber spreading assay. Methods Mol Biol. 2021;2267:57–71. 33786784 10.1007/978-1-0716-1217-0_4 58. Sirbu BM Couch FB Cortez D Monitoring the spatiotemporal dynamics of proteins at replication forks and in assembled chromatin using isolation of proteins on nascent DNA Nat Protoc 2012 7 594 605 10.1038/nprot.2012.010 22383038 PMC3671908 Sirbu BM, Couch FB, Cortez D. Monitoring the spatiotemporal dynamics of proteins at replication forks and in assembled chromatin using isolation of proteins on nascent DNA. Nat Protoc. 2012;7:594–605. 22383038 10.1038/nprot.2012.010 PMC3671908 59. Aranda S Di Croce L Isolation of chromatin proteins by genome capture Methods Mol Biol 2023 2655 91 9 10.1007/978-1-0716-3143-0_8 37212991 Aranda S, Di Croce L. Isolation of chromatin proteins by genome capture. Methods Mol Biol. 2023;2655:91–9. 37212991 10.1007/978-1-0716-3143-0_8 ",
  "metadata": {
    "Title of this paper": "Isolation of chromatin proteins by genome capture",
    "Journal it was published in:": "Cell Death Discovery",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12462522/"
  }
}