{
  "title": "Paper_1124",
  "abstract": "pmc World J Radiol 1322 worldjradiol WJR World Journal of Radiology 1949-8470 Baishideng Publishing Group Inc PMC12476808 PMC12476808.1 12476808 12476808 41025056 10.4329/wjr.v17.i9.110267 jWJR.v17.i9.eid110267 1 Retrospective Study Magnetic resonance tractography of the cervical spine: A rapid diffusion tensor imaging protocol to serve as a clinical evaluation tool Supsupin EP et al Supsupin Emilio P Department of Radiology, University of Florida College of Medicine, Jacksonville, FL 32209, United States Serrano Alejandro Department of Radiology, University of Florida College of Medicine, Jacksonville, FL 32209, United States. alejandro.serrano@jax.ufl.edu Louviere Christopher Department of Radiology, University of Florida College of Medicine, Jacksonville, FL 32209, United States Pearson Luke Department of Radiology, University of Florida College of Medicine, Jacksonville, FL 32209, United States Hernandez Mauricio Department of Radiology, University of Florida College of Medicine, Jacksonville, FL 32209, United States Sekar Vashisht Department of Neurological Surgery, University of Florida College of Medicine, Jacksonville, FL 32209, United States Amer Aboubakr Department of Neurological Surgery, University of Florida College of Medicine, Jacksonville, FL 32209, United States Cikla Ulas Department of Neurological Surgery, University of Florida College of Medicine, Jacksonville, FL 32209, United States Virarkar Mayur Department of Radiology, University of Florida College of Medicine, Jacksonville, FL 32209, United States Gumus Kazim Z Department of Radiology, University of Florida College of Medicine, Jacksonville, FL 32209, United States Co-corresponding authors: Alejandro Serrano and Kazim Z Gumus. Author contributions: Supsupin EP conception and design of the study, supervision; Serrano A manuscript writing; analyzed data; Louviere C manuscript writing; analyzed data; Pearson L data curation; literature review; Hernandez M data curation; statistical analysis, manuscript revision; Virarkar M analyzed data; manuscript revision; Gumus KZ project supervision; analyzed data, final approval of the manuscript; Sekar V conceptual input; manuscript revision; Amer A conceptual input; manuscript revision; Cikla U conceptual input; manuscript revision. All authors contributed to this paper with the conception and design of the study, literature review and analysis, drafting and critical revision and editing, and approval of the final version. We would like to clarify that two co-corresponding authors are listed because one of the authors has since left the institution and will no longer have access to their institutional email. Including both authors ensures continuity in correspondence and availability for any future queries regarding the manuscript. Corresponding author: Alejandro Serrano, MD, Research Fellow, Department of Radiology, University of Florida College of Medicine, 655 8 th alejandro.serrano@jax.ufl.edu 28 9 2025 28 9 2025 17 9 497737 110267 3 6 2025 21 6 2025 9 9 2025 28 09 2025 29 09 2025 30 09 2025 ©The Author(s) 2025. Published by Baishideng Publishing Group Inc. All rights reserved. 2025 https://creativecommons.org/licenses/by-nc/4.0/ This article is an open-access article that was selected by an in-house editor and fully peer-reviewed by external reviewers. It is distributed in accordance with the Creative Commons Attribution NonCommercial (CC BY-NC 4.0) license, which permits others to distribute, remix, adapt, build upon this work non-commercially, and license their derivative works on different terms, provided the original work is properly cited and the use is non-commercial. See: https://creativecommons.org/Licenses/by-nc/4.0/ BACKGROUND Spinal cord injury can lead to long-term disability, but current imaging methods are limited in predicting outcomes. Rapid diffusion tensor imaging (DTI) has shown promise, yet its clinical utility remains underexplored. AIM To evaluate the potential applications of a short DTI sequence, incorporated into a cervical spine magnetic resonance imaging (MRI) protocol, for characterizing a range of symptomatic spinal cord pathologies. We propose that cervical spine tractography can provide essential diagnostic information beyond what is currently available from conventional MRI. METHODS We utilized a quick DTI sequence to create tractography models of the cervical spinal cord in four patients with distinct pathologies of various etiologies: Cord contusion, metastasis, myelopathy, and multiple sclerosis. We used DSI Studio software for post-processing of tractography cases. Fiber tract findings for each pathology case were compared to five control cases from the same scanner by looking for individual differences in white matter tract integrity based on the fractional anisotropy (FA) and mean diffusivity (MD) of the regions of interest from controls. These correlated with clinical presentations and conventional MRI findings. RESULTS Control cases showed consistent and intact tract patterns with stable FA and MD values. In pathological cases, abnormalities in fiber orientation and tract continuity correlated with clinical symptoms and lesion locations. CONCLUSION The tractography models can provide additional information on white matter disruption that was not discernible on standard MRI sequences. However, its clinical use remains limited due to the need for specialized imaging protocols and complex post-processing, restricting its use to mostly academic settings. Cervical spinal cord Diffusion tensor imaging Tractography Fractional anisotropy Mean diffusivity pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement no pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes  Core Tip: INTRODUCTION Spinal cord injury (SCI) remains one of the most debilitating and financially costly injuries in the United States. It is estimated that around 250000 to 500000 patients each year suffer from SCIs globally, with 17000 new SCI cases occurring in the United States yearly[ 1 1 Clinical imaging is essential for understanding and accurately managing spinal pathologies. Even patients with an overtly unrelated primary injury will often undergo imaging if there is a remote possibility that spinal cord function could be compromised (cite guidelines). Magnetic resonance imaging (MRI) is the gold-standard imaging modality for characterizing and diagnosing spinal cord pathologies in a stabilized spine[ 1 4 1 4 Diffusion tensor imaging (DTI) is an MRI sequence that indirectly measures the direction of diffusion of water molecules in tissues to assess the direction of neural fiber tracts[ 2 The diffusion directions acquired from the tensors are extracted from the images and are integrated into the tractography workflow. Fibers are traced following the direction of diffusion from voxel to voxel. Fibers are continuously generated until a stopping condition is met, for example, low anisotropy from injury, a sharp angle change, or reaching gray matter. There are two types of tracking algorithms: Deterministic Tractography and Probabilistic Tractography. The former follows a single dominant direction in voxels, this gives cleaner tracts but is limited when discriminating between multiple fibers in one voxel. The latter considers uncertainty in fiber directions, allowing for the mapping of complex regions with crossing fibers, this tracking method includes the possibility of generating false positives. DTI captures water molecules' Brownian motion, representing their diffusion across three-dimensional space. Tracking their movement allows us to obtain the molecular diffusion rate, also known as the apparent diffusion coefficient[ 2 4 2 4 6 2 4 6 et al 4 7 8 Anisotropy, coupled with the rate of water molecule diffusion, can represent neuronal tracts, called “tractography”. The directionality of the tracts is measured in the anteroposterior, transverse, and cranio-caudal axes (CC), with assigned corresponding colors[ 2 4 5 A DTI sequence typically takes 5-10 minutes to perform as part of clinical imaging, concurrently with conventional MRI sequences. Recent advances in MRI hardware and software can reduce its duration to a few minutes, making it more feasible for large volume clinical imaging. The relatively short time needed to acquire MRI with DTI makes this sequence a feasible tool for the timely clinical evaluation of spinal cord injuries[ 2 3 There is a spectrum of applications available for magnetic resonance (MR) tractography[ 1 4 5 6 Altered connectivity patterns can be seen in diseases like Alzheimer where there is a loss of long-range connections secondary to cell death from Tau deposition. Surgical Planning can benefit by providing information on the location of major tracts to avoid damaging them[ 4 5 8 7 1 2 4 8 Several challenges limit the widespread clinical adoption of tractography. Obtaining imaging acquisitions optimized for tractography, and performing the necessary complex post-processing remains a resource-intensive and time-consuming process[ 3 4 5 9 Nevertheless, tractography remains valuable in certain clinical scenarios as it offers a non-invasive method for assessing the extent of white matter injury, evaluating mass effect from tumors on the surrounding tissue, and tracking the progression of lesions in degenerative conditions such as MS[ 2 9 10 1 3 MATERIALS AND METHODS Image acquisition We obtained Institutional Review Board (IRB-01) approval for this retrospective study. We integrated a DTI sequence based on a spin-echo echo planar imaging technique into our cervical MRI exam protocol on our institution's 3.0 Tesla MRI scanner. The sequence parameters were as follows: Axial plane, repetition time of 9200 ms, echo time of 82 ms, 37 slices, slice thickness of 3 mm, matrix size of 128 × 128, three signal averages, b values of 0 and 1000 s/mm² across six directions in order to improve clinical feasibility with a total scan time of approximately 2 minutes (Table 1 Table 1 Results with fractional anisotropy and mean diffusivity values obtained using DSI Studio  Case  Cranial FA  z-score  Cranial MD  z-score  Central FA  z-score  Central MD  z-score  Caudal FA  z-score  Caudal MD  z-score Control 1 0.57 1.97 1.35 -0.78 0.57 0.86 1.24 -1.91 0.53 0.97 1.49 -0.03 Control 2 0.37 -0.22 0.99 -1.60 0.51 0.30 1.44 0.17 0.54 1.12 1.15 -1.72 Control 3 0.37 -0.22 2.01 0.73 0.52 0.39 1.47 0.49 0.45 -0.26 1.51 0.07 Control 4 0.31 -0.88 1.71 0.04 0.48 0.02 1.41 -0.14 0.47 0.05 1.78 1.41 Control 5 0.37 -0.22 2.01 0.73 0.52 0.39 1.47 0.49 0.45 -0.26 1.51 0.07 Metastatic 0.35 -0.44 2.08 0.88 0.27 -1.96 1.51 0.90 0.36 -1.63 1.54 0.22 Myelopathy 0.72 1.69 1.2 -0.80 0.57 1.18 1.57 1.25 0.62 1.65 1.23 -0.95 Contusion 0.51 0.93 1.18 -0.83 0.38 -1.82 1.33 -0.69 0.44 -0.91 1.43 -0.24 Multiple sclerosis 0.41 0.11 2.01 0.77 0.4 -1.76 1.53 1.04 0.44 -0.91 1.41 -0.32 Each pathology case was individually compared against the five control cases. z-scores were used to determine the relative increase or reduction of a given pathological case’s fractional anisotropy and mean diffusivity values compared to the mean control values. Pathological cases were not compared against one another. FA: Fractional anisotropy; MD: Mean diffusivity. Patient/case selection We identified cases of spinal cord pathology for visualization with tractography using the EPIC Electronic Medical Record system and PACS at our home institution for patients who underwent MRI-Cervical Spine studies with DTI sequences at our institution. Patients whose reports stated no significant cord changes were identified, and five were selected from PACS to be included as controls. Additionally, we selected four pathological cases representing different etiologies for evaluation against the control group. We present a brief discussion of the four pathological cases below. For our control case, we selected imaging from a 22 year-old man undergoing MRI of the cervical spine for trauma, the imaging report showed no cord signal abnormality, neural foraminal narrowing, or spinal cord narrowing. This patient had no significant relevant medical history, such as a history of cancer, traumatic SCI, or neurodegenerative disease (Figure 1 Figure 1  Control case. A case of a 51 year-old male presenting with cervical myelopathy. MRI of the cervical spine without contrast demonstrated disc extrusion at the level of C5-C6 with cord compression and hyper-intense T2 signaling in the spinal cord. The patient reported difficulty walking and balancing and poor motor coordination of his lower extremities. He worked as an automotive mechanic and stated his job performance had worsened because he was repeatedly dropping small objects due to numbness and tingling in his left hand. A case of an 82 year-old male presenting with spinal cord contusion. He had a relevant medical history of aortic stenosis, type 2 diabetes mellitus, and carotid stenosis. The patient experienced a traumatic fall after being struck by a vehicle door, causing a temporary loss of consciousness. Subsequent MRI of the cervical spine with contrast illustrated spinal cord acute cord contusion in the setting of severe spinal canal stenosis showing severe cord flattening at C3-C4 and elevated intramedullary signal (Figure 2 Figure 2  Contusion case. A 62 year-old woman presenting with breast cancer, with metastases to the lungs, spine, and brain. She reported progressive weakness and numbness in her upper and lower extremities. At the time of the imaging, the patient began receiving palliative chemotherapy and radiation therapy. MRI of the cervical spine, with and without contrast, illustrated diffusely abnormal T2 signaling with spinal cord edema and focal abnormal enhancement at the posterior of the cervical spinal cord at the level of C2-C3 where there is a metastatic lesion from breast cancer (Figure 3 Figure 3  Metastasis case. A 35-year-old female who was evaluated for a potential flare-up of MS, with concern for an active demyelinating lesion in the cervical spine. She presented symptoms of numbness and weakness of the lower extremities. We limited our evaluation of this case to obtain measures of white matter integrity, FA, and MD. Tractography workflow We selected the eligible cases based on the imaging report impressions, regardless of the indication for the imaging. Controls the availability of high-quality cervical spine MRI images from our institution’s PACS system (Visage 7). MRI scans from both control and pathology groups were exported and anonymized using the PACS-native anonymization functionality to maintain patient confidentiality. Following anonymization, distortion correction was performed using DSI Studio’s built-in correction tools to mitigate motion artifacts and image distortions inherent to spinal cord imaging. Distortion-corrected DICOM files were subsequently imported into DSI Studio for further processing. To minimize the inclusion of non-spinal structures, exclusion masks (region of avoidance) were applied. Tracking parameters were customized to optimize visualization and anatomical accuracy, with key parameters set as follows: Tracking index = FA; tracking threshold = variable; minimum fiber length = 10 mm; maximum fiber length = 1000 mm. A comprehensive list of all tracking parameters used can be found in Table 2 Table 2 Magnetic resonance tractography parameters  Tracking parameters Distortion correction DSI studio Native Motion Correction tool Software package DSI studio (version. 2024.12.28 Hou Release) FA threshold 0.15504-0.23520 Angular threshold 0-90° Minimum length (mm) 10 mm Maximum length (mm) 1000 mm Step size (mm) 0.1 mm Reconstruction algorithm Deterministic (Euler) ROA design One ROA excluding the whole spinal cord Filtering Topology informed pruning ROA: Region of avoidance; FA: Fractional anisotropy. Post-processing involved the removal of anatomically implausible fiber tracts and spurious fibers using DSI Studio’s Topology Informed Pruning option[ 11 Supplementary material Statistical analysis A quantitative assessment of white matter integrity was performed using FA and MD values from each ROI using DSI Studio. We performed comparative analyses between individual pathology cases and control groups to evaluate differences in spinal cord microstructural integrity. Due to the inherent limitations of the available data: (1) Small overall sample sizes; (2) Differences in clinical etiology of pathological cases; and (3) Lack of standardized FA and MD ranges for different pathologies, only relative differences could be compared between single case measurements and those of the five control values. Therefore, z-scores were calculated for FA and MD values between all controls and single pathology cases across three cervical spinal cord levels: (1) Cranial segment (above the lesion); (2) Central segment (at the level of the lesion); and (3) Cudal (below the lesion). We avoided direct comparisons between pathological cases, or lumping all pathological cases into a group, in order to reduce potential confounding due inter-pathology variability & clinically distinct etiologies. For each lesion, the differences if any, in the z-score of the FA and MD values was quantified for each pathological case relative to the range of the control-derived z-scores, which allowed the team to assess the extent to which spinal cord pathology white matter signal properties varied at level of the lesion as well as across unaffected sections. Lastly, effect sizes (Cohen’s d) could not be calculated for each pathological case comparison, since only one of each case type was available for analysis. RESULTS Rendered MR tractography images yielded directional information about the patients' spinal cords and the disruptions in neural fibers resulting from lesions. We visualized the control case of a 22 year-old man undergoing an MRI of the cervical spine for trauma. The imaging report showed no cord signal abnormality, neural foraminal narrowing, or spinal cord narrowing. This patient had no significant relevant medical history, such as a history of cancer, traumatic SCI, or neurodegenerative disease (Figure 1 Tractography model for the case of the 82-year-old male presenting with spinal cord contusion whose imaging illustrated severe spinal canal stenosis from disc herniation and degenerative spondylosis at the levels of C2-C3 and C3-C4, with severe spinal cord flattening at C3-C4 and reversal of cervical kyphosis. Additionally, there is an elevated intramedullary signal. Tractography model shows a region of fibers in the posterior spinal cord at the lesion level is organized anterior-posteriorly instead of the normal CC (Figure 2 Our second case from a 62-year-old woman presenting with breast cancer, with metastases to the lungs, spine, and brain, significant focal abnormal enhancement at the posterior of the cervical spinal cord at the level of C2-C3, due to a metastatic lesion. The tractography model reveals the metastatic lesion left an indentation that is apparent in the posterior-anterior view that can be seen at the level of C2-C3. The fibers anterior to the lesion appear displaced anteriorly, forming a concave groove present at the level of the metastatic lesion in the posterior spinal cord. Fibers in this region curve inwards toward the spinal cord and appear compressed and displaced (Figure 4 Figure 4  Overall fractional anisotropy values are lower at the pathological region while mean diffusivity values are higher than in the control. The third SCI case was a 51-year-old male presenting with cervical myelopathy. The tractography of this case demonstrates fibers extending from the cerebellum and brainstem to the C7-T1 intervertebral disc. Gross visualization demonstrates spurious fibers throughout the length of the spinal cord. However, the gross structure is visible with an apparent interruption in fiber connections at the level of C5-C6. At this location, the cord extrusion and subsequent compression have narrowed the spinal canal. Fibers crossing this section of the spinal cord area are minimal. Tractography model analysis demonstrated a normal FA (0.57, z-score 1.18) (control range 0.48-0.57, control z-score range -1.36-1.17) and a slightly elevated MD (1.57, z-score 1.25) at the lesion site (control range 1.24-1.47, control z-score range -1.77-0.34). Cranial to the lesion, FA values were slightly elevated (0.72, z-score 1.69) (control range 0.31-0.57, control z-score range -0.89-0.74), and MD (1.2, z-score -0.80) were within normal limits (control range -0.99-2.01, control z-score range -0.45-1.08). Caudal to the lesion, FA values were slightly higher (0.62, z-score 1.65) (control range 0.45-0.54, control z-score range -0.90-0.45), and MD values were within range (1.23, z-score -0.95) (control range 1.15-1.78, control z-score range -1.30-1.48). The fourth case belongs to a 35-year-old female with a medical history of MS. The patient was admitted to the institution for a suspected MS flare associated with lower extremity weakness and acute hypoxic respiratory failure from multifocal pneumonia. Her imaging studies revealed prior multifocal demyelinating plaques in the cervical cord at the level of C4-C5 that had progressed in extent. For this case, ROI measurements were only significant in the location of the lesion. FA at the site of the demyelinating plaque at C4-C5 was moderately low (0.4, z-score -1.75) (control range 0.48-0.57, control z-score range -0.35-1.23), and MD was slightly elevated (1.53, z-score 1.04) (control range 1.24-1.47, control z-score range -1877-0.43). Cranial region showed FA values within normal range (0.41, z-score 0.11) (control range 0.31-0.57, control z-score range -0.33-1.90) and MD values (2.01, z-score 0.77) also within normal range (control range -0.99-2.01, control z-score range -1.62-0.77). Caudal region showed FA values were slightly low (0.44, z-score -0.91)) (control range 0.45-0.54, control z-score range -0.68-1.37), and MD values within normal range (1.41, z-score -0.32) (control range 1.15-1.78, control z-score range -1.60-1.50). DISCUSSION Accurate visualization of the spinal cord is of great interest to the surgical fields for pre-operative planning. Tractography models can demonstrate particularities in the areas of interest where lesions have occurred. Our goal was to determine the feasibility of integrating tractography in clinical scenarios. The imaging necessary for tractography is non-invasive, and acquiring DTI adds negligible increases in scan times. We examined cases with imaging from patients with no reported spinal cord lesions and obtained the key measurements (FA, MD) in three regions for each case. Tractography models were generated using DSI Studio Tractography clinical applications The ability to characterize nerve fibers with tractography has opened new possibilities for clinical application. After all, the promise of visualizing neural fiber anatomy and function provides additional clinical information that may aid in developing therapeutic plans or surgical planning by assessing severity or improvements on follow-up characterization to assist with evaluating disease progression[ 2 3 12 In practice, the difficulty in implementing tractography for widespread clinical care stems from the difficulty in obtaining scans optimized for tractography and the following postprocessing. Even under ideal acquisition conditions, tractography is inherently limited by its reliance on modeling algorithms that estimate white matter trajectories. Accurate mapping becomes increasingly unreliable in regions with complex, dense fiber architecture, such as areas with significant crossing, parallel, and branching fibers. What this means for surgical applications will depend on the type of intervention planned. Tumor lesions may be large enough to accurately assess the anatomical location and extent of damage by looking at key measurements like FA and MD values. Still, the risk of false-positive and false-negative fibers being present limits the confidence in tractography models[ 13 14 13 14 2 15 Case discussion This study highlights the utility of tractography in evaluating spinal cord microstructure across various pathologies. By comparing each case to a control subject, we were able to identify patterns of fiber disruption and diffusion. We began with a control case with the case of a 22-year-old male with normal spinal cord imaging and no pathology. The tractography model showed coherent cranio-caudal alignment of fibers, and FA and MD values were within expected ranges, establishing our baseline for healthy subjects[ 16 The tractography model from the C3-C4 spinal cord contusion case revealed abnormal fiber orientation in the posterior spinal cord at this level. FA was moderately reduced, consistent with axonal disorganization or injury, while MD remained within normal range. This mismatch may reflect localized disruption of directional coherence (FA) without extensive tissue breakdown, preserving extracellular diffusion (MD). Such a pattern is common in chronic compression, where structural disarray precedes widespread edema or necrosis[ 17 18 The second tractography model, involving metastatic breast cancer to the cervical cord at C2-C3 showed anterior displacement and deformation of fibers by the lesion. The lesion FA values decreased, indicating tract disruption, while MD was slightly elevated, suggesting surrounding edema or increased extracellular space from tumor infiltration. This combination reflects a directional disruption (low FA) and mild diffusion facilitation (high MD), a finding consistent with infiltrative masses[ 19 The third tractography model involving cervical myelopathy at C5-C6 showed tract disruption on imaging, yet FA was within or above normal, and MD was only mildly elevated. This paradoxical finding likely reflects mechanisms commonly observed in chronic spinal cord compression. In such cases, FA may remain artificially elevated due to selective preservation of organized fiber populations, even as others degenerate[ 17 18 20 21 19 The last tractography model, consisting of a MS case at the level of C4-C5, C5 showed that FA values were moderately reduced at the lesion site, while MD was only slightly elevated. This could represent localized demyelination with decreases in (FA), but with limited edema or axonal loss, keeping MD relatively stable. FA was mildly low caudally, which could be explained by the extension of demyelination[ 22 Limitations This study has several limitations that should be acknowledged. First, our sample size was relatively small, comprising four cases with spinal cord pathology and six control cases. Including a larger set of cases would strengthen the statistical significance of our findings. Another noteworthy limitation involves the diffusion acquisition protocol. The scanners used to obtain diffusion-weighted imaging only included six acquisition directions. The limited number of directions in our protocol may have contributed to variability in key measurements representing white matter integrity, such as FA and MD. Given the lack of reverse-phase encoding sequences for the selected imaging cases, eddy current artifacts could not be corrected. Although traumatic SCI is a major focus of the field, such cases were excluded from the present study due to practical constraints in the acute setting. Patients with acute traumatic SCI frequently present with hemodynamic instability, with some patients requiring strict immobilization, all of which complicate the implementation of extended or non-standard research imaging protocols[ 23 24 Acquisition directions Prior work in literature has emphasized the importance of higher-direction acquisitions; typically, at least 17 directions ensure the accuracy and fidelity in tractography reconstructions[ 8 et al 8 25 8 9 1 4 DTI and generalized q-sampling imaging Fiber resolution methods aim to characterize the orientation and trajectory of white matter tracts by modeling water diffusion patterns within each voxel. These methods differ in how they interpret the diffusion signal and in their ability to resolve complex fiber geometries. DTI models diffusion by capturing only the principal direction of water diffusion, assuming a single dominant fiber direction per voxel. Thus, fiber bundles that cross over or demonstrate sudden changes in direction are challenging to model accurately. Generalized Q-sampling Imaging (GQI) employs a model-free reconstruction method that estimates the spin distribution function from diffusion signals, enabling it to resolve multiple fiber orientations within a single voxel. It can resolve multiple fiber orientations per voxel and provide better reconstructions in regions of complex anatomy. However, this resolution method often yields false-positive fiber bundles[ 26 In the current study, we employed deterministic tractography using the Euler algorithm due to its computational efficiency, reproducibility, and ease of clinical interpretation[ 27 28 For future studies we intend to expand the dataset to include a broader spectrum of spinal cord pathologies, including traumatic injuries and progressive neurodegenerative diseases. This will allow us to explore the utility of tractography across a broader clinical spectrum. Several recent studies and systematic reviews in literature support the importance of such methodological advancements for broader clinical applications[ 2 4 5 9 Planned improvements to our protocol include the implementation of reverse phase-encoding acquisitions and an increase in the number of diffusion directions. Preliminary results using a 15-direction protocol (acquisition time approximately 3.5 minutes) demonstrate improved angular resolution and more robust tract reconstruction without a prohibitive increase in scan duration. Additionally, the incorporation of reverse phase-encoding show improvements in geometric distortion correction, particularly in the lower cervical spine where susceptibility artifacts are most pronounced[ 29 30 CONCLUSION Diffusion MR tractography offers clinically relevant insights into spinal cord lesions without substantially prolonging scan time. It is essential to understand that tractography models are highly dependent on image acquisition parameters and post-processing. As such, these processes should be performed by trained personnel to ensure the accuracy and reliability of the results. Utility in surgical planning is constrained to procedures that prioritize the preservation of healthy tissue. In clinical scenarios, FA and MD values derived from tractography may correlate with the severity and progression of SCI, offering potential value in the diagnosis and follow-up of patients with spinal cord lesions. Further research with the goal of refining post-processing protocols is necessary. The inclusion of reverse phase-encoding sequences to address eddy current distortions and the use of a higher number of diffusion directions are expected to address sources of error. Enhancing acquisition fidelity will reduce the need for corrective post-processing and yield models with greater anatomical accuracy. This is essential for tractography to be reliably integrated into the clinical evaluation of spinal cord lesions, particularly in cases where precise anatomical detail is crucial.  Institutional review board statement:  Informed consent statement:  Conflict-of-interest statement:  Provenance and peer review:  Peer-review model:  Specialty type:  Country of origin:  Peer-review report’s classification  Scientific Quality:  Novelty:  Creativity or Innovation:  Scientific Significance:  P-Reviewer: S-Editor: L-Editor: P-Editor: 1 Nanda G Jain P Suman A Mahajan H Role of diffusion tensor imaging and tractography in spinal cord injury J Clin Orthop Trauma 2022 33 101997 36118562 10.1016/j.jcot.2022.101997 PMC9475303 2 Yamada K Sakai K Akazawa K Yuen S Nishimura T MR tractography: a review of its clinical applications Magn Reson Med Sci 2009 8 165 174 20035125 10.2463/mrms.8.165 3 Wu BW Barr S Applications of Whole Brain Tractography and Implications for Clinical Practice Cureus 2017 9 e1753 29226043 10.7759/cureus.1753 PMC5716682 4 Costanzo R Brunasso L Paolini F Benigno UE Porzio M Giammalva GR Gerardi RM Umana GE di Bonaventura R Sturiale CL Visocchi M Iacopino DG Maugeri R Spinal Tractography as a Potential Prognostic Tool in Spinal Cord Injury: A Systematic Review World Neurosurg 2022 164 25 32 35500874 10.1016/j.wneu.2022.04.103 5 Rao JS Zhao C Yang ZY Li SY Jiang T Fan YB Li XG Diffusion tensor tractography of residual fibers in traumatic spinal cord injury: a pilot study J Neuroradiol 2013 40 181 186 23428240 10.1016/j.neurad.2012.08.008 6 Ciccarelli O Catani M Johansen-Berg H Clark C Thompson A Diffusion-based tractography in neurological disorders: concepts, applications, and future developments Lancet Neurol 2008 7 715 727 18635020 10.1016/S1474-4422(08)70163-7 7 Koskinen E Brander A Hakulinen U Luoto T Helminen M Ylinen A Ohman J Assessing the state of chronic spinal cord injury using diffusion tensor imaging J Neurotrauma 2013 30 1587 1595 23758292 10.1089/neu.2013.2943 8 Dauleac C Frindel C Mertens P Jacquesson T Cotton F Overcoming challenges of the human spinal cord tractography for routine clinical use: a review Neuroradiology 2020 62 1079 1094 32363485 10.1007/s00234-020-02442-8 9 Yeh FC Irimia A Bastos DCA Golby AJ Tractography methods and findings in brain tumors and traumatic brain injury Neuroimage 2021 245 118651 34673247 10.1016/j.neuroimage.2021.118651 PMC8859988 10 van Den Hauwe L Sundgren PC Flanders AE Spinal Trauma and Spinal Cord Injury (SCI). 2020 Feb 15. In: Diseases of the Brain, Head and Neck, Spine 2020–2023: Diagnostic Imaging [Internet]. Cham (CH): Springer; 2020 11 Yeh FC Panesar S Barrios J Fernandes D Abhinav K Meola A Fernandez-Miranda JC Automatic Removal of False Connections in Diffusion MRI Tractography Using Topology-Informed Pruning (TIP) Neurotherapeutics 2019 16 52 58 30218214 10.1007/s13311-018-0663-y PMC6361061 12 Yang JY Yeh CH Poupon C Calamante F Diffusion MRI tractography for neurosurgery: the basics, current state, technical reliability and challenges Phys Med Biol 2021 66 10.1088/1361-6560/ac0d90 34157706 13 Irfanoglu MO Walker L Sarlls J Marenco S Pierpaoli C Effects of image distortions originating from susceptibility variations and concomitant fields on diffusion MRI tractography results Neuroimage 2012 61 275 288 22401760 10.1016/j.neuroimage.2012.02.054 PMC3653420 14 Thomas C Ye FQ Irfanoglu MO Modi P Saleem KS Leopold DA Pierpaoli C Anatomical accuracy of brain connections derived from diffusion MRI tractography is inherently limited Proc Natl Acad Sci U S A 2014 111 16574 16579 25368179 10.1073/pnas.1405672111 PMC4246325 15 Bao J Tu H Li Y Sun J Hu Z Zhang F Li J Diffusion Tensor Imaging Revealed Microstructural Changes in Normal-Appearing White Matter Regions in Relapsing-Remitting Multiple Sclerosis Front Neurosci 2022 16 837452 35310094 10.3389/fnins.2022.837452 PMC8924457 16 Dauleac C Boukhari A Jacquesson T Frindel C Cotton F Microstructural Characteristics of Cervical Spinal Cord Using High Angular Resolution Diffusion Imaging (HARDI) and Tractography in Healthy Subjects Clin Neuroradiol 2025 35 315 324 39704830 10.1007/s00062-024-01481-5 17 Ellingson BM Salamon N Hardy AJ Holly LT Prediction of Neurological Impairment in Cervical Spondylotic Myelopathy using a Combination of Diffusion MRI and Proton MR Spectroscopy PLoS One 2015 10 e0139451 26431174 10.1371/journal.pone.0139451 PMC4592013 18 Nouri A Tetreault L Singh A Karadimas SK Fehlings MG Degenerative Cervical Myelopathy: Epidemiology, Genetics, and Pathogenesis Spine (Phila Pa 1976) 2015 40 E675 E693 25839387 10.1097/BRS.0000000000000913 19 Farquharson S Tournier JD Calamante F Fabinyi G Schneider-Kolsky M Jackson GD Connelly A White matter fiber tractography: why we need to move beyond DTI J Neurosurg 2013 118 1367 1377 23540269 10.3171/2013.2.JNS121294 20 Shabani S Kaushal M Budde MD Wang MC Kurpad SN Diffusion tensor imaging in cervical spondylotic myelopathy: a review J Neurosurg Spine 2020 33 65 72 32109862 10.3171/2019.12.SPINE191158 21 Schneider T Thomas DL Kachramanoglou C Ciccarelli O Alexander DC Wheeler-Kingshott CA Fuzzy partial volume correction of spinal cord DTI parameters. 2025. Available from: https://cds.ismrm.org/protected/11MProceedings/PDFfiles/4556.pdf 22 Wheeler-Kingshott CA Stroman PW Schwab JM Bacon M Bosma R Brooks J Cadotte DW Carlstedt T Ciccarelli O Cohen-Adad J Curt A Evangelou N Fehlings MG Filippi M Kelley BJ Kollias S Mackay A Porro CA Smith S Strittmatter SM Summers P Thompson AJ Tracey I The current state-of-the-art of spinal cord imaging: applications Neuroimage 2014 84 1082 1093 23859923 10.1016/j.neuroimage.2013.07.014 PMC4371134 23 Chaggar R Gill R Evaluating initial screening practices for calcium dysregulation after acute traumatic spinal cord injury: a retrospective review Spinal Cord Ser Cases 2024 10 54 10.1038/s41394-024-00663-0 PMC11291971 39085204 24 Korupolu R Uhlig-Reche H Achilike EC Reeh C Pedroza C Stampas A Factors Associated With Ventilator Weaning Success and Failure in People With Spinal Cord Injury in an Acute Inpatient Rehabilitation Setting: A Retrospective Study Top Spinal Cord Inj Rehabil 2022 28 129 138 35521063 10.46292/sci21-00062 PMC9009196 25 Crombe A Alberti N Hiba B Uettwiller M Dousset V Tourdias T Cervical Spinal Cord DTI Is Improved by Reduced FOV with Specific Balance between the Number of Diffusion Gradient Directions and Averages AJNR Am J Neuroradiol 2016 37 2163 2170 27365330 10.3174/ajnr.A4850 PMC7963780 26 Jin Z Bao Y Wang Y Li Z Zheng X Long S Wang Y Differences between generalized Q-sampling imaging and diffusion tensor imaging in visualization of crossing neural fibers in the brain Surg Radiol Anat 2019 41 1019 1028 31144009 10.1007/s00276-019-02264-1 PMC6694094 27 Petersen MV Lund TE Sunde N Frandsen J Rosendal F Juul N Østergaard K Probabilistic versus deterministic tractography for delineation of the cortico-subthalamic hyperdirect pathway in patients with Parkinson disease selected for deep brain stimulation J Neurosurg 2017 126 1657 1668 27392264 10.3171/2016.4.JNS1624 28 Dauleac C Frindel C Pélissou-Guyotat I Nicolas C Yeh FC Fernandez-Miranda J Cotton F Jacquesson T Full cervical cord tractography: A new method for clinical use Front Neuroanat 2022 16 993464 36237419 10.3389/fnana.2022.993464 PMC9550930 29 Schilling KG Combes AJE Ramadass K Rheault F Sweeney G Prock L Sriram S Cohen-Adad J Gore JC Landman BA Smith SA O'Grady KP Influence of preprocessing, distortion correction and cardiac triggering on the quality of diffusion MR images of spinal cord Magn Reson Imaging 2024 108 11 21 38309376 10.1016/j.mri.2024.01.008 PMC11218893 30 Mohammadi S Nagy Z Hutton C Josephs O Weiskopf N Correction of vibration artifacts in DTI using phase-encoding reversal (COVIPER) Magn Reson Med 2012 68 882 889 22213396 10.1002/mrm.23308 PMC3569871 Data sharing statement The data that support the findings of this study are available from the corresponding author upon reasonable request. ",
  "metadata": {
    "Title of this paper": "Correction of vibration artifacts in DTI using phase-encoding reversal (COVIPER)",
    "Journal it was published in:": "World Journal of Radiology",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12476808/"
  }
}