{
  "title": "Paper_678",
  "abstract": "pmc Healthcare (Basel) Healthcare (Basel) 2994 healthcare healthcare Healthcare 2227-9032 Multidisciplinary Digital Publishing Institute  (MDPI) PMC12469339 PMC12469339.1 12469339 12469339 41008423 10.3390/healthcare13182291 healthcare-13-02291 1 Article New Generation Automatic Massage Chairs for Enhancing Daytime Naps: A Crossover Placebo-Controlled Trial https://orcid.org/0000-0001-6270-8782 Ntoumas Ilias Conceptualization Methodology Formal analysis Investigation Writing – original draft Writing – review & editing Visualization 1 https://orcid.org/0009-0002-6368-2283 Antoniou Nikolas Writing – original draft Writing – review & editing 1 https://orcid.org/0000-0003-0029-1189 Giannaki Christoforos D. Writing – original draft Writing – review & editing 2 3 Papanikolaou Fotini Writing – original draft Writing – review & editing 1 Pappas Aggelos Writing – original draft Writing – review & editing 1 https://orcid.org/0000-0003-2957-641X Dardiotis Efthimios Writing – original draft Writing – review & editing 4 Karatzaferi Christina Conceptualization Methodology Formal analysis Investigation Writing – original draft Writing – review & editing Visualization Supervision Project administration 1 https://orcid.org/0000-0002-2462-995X Sakkas Giorgos K. Conceptualization Methodology Formal analysis Investigation Writing – original draft Writing – review & editing Visualization Supervision Project administration 1 2 * Bouloukaki Izolde Academic Editor 1 intoumas@uth.gr adoniounikolas@gmail.com papanikolf@gmail.com apappa66@yahoo.com ck@uth.gr 2 giannaki.c@unic.ac.cy 3 4 edar@med.uth.gr * gsakkas@uth.gr 12 9 2025 9 2025 13 18 497454 2291 05 8 2025 03 9 2025 05 9 2025 12 09 2025 27 09 2025 29 09 2025 © 2025 by the authors. 2025 https://creativecommons.org/licenses/by/4.0/ Licensee MDPI, Basel, Switzerland. This article is an open access article distributed under the terms and conditions of the Creative Commons Attribution (CC BY) license ( https://creativecommons.org/licenses/by/4.0/ Background/Objectives Methods Results p p p Conclusions NCT06784700 daytime nap massage chair EEG sleepiness scale handgrip heart rate This research received no external funding. pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement yes pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes 1. Introduction The fast-paced nature of the modern lifestyle often contributes to increased stress before bedtime that negatively impacts many aspects of sleep quality, highlighting the need for interventions that promote relaxation. One of those interventions is daytime napping. Naps are typically defined as short periods of sleep, usually lasting from 10 to 30 min, taken during the day to supplement nighttime rest. Naps can enhance cognitive and physical performance, improve mood, and increase alertness, making them an effective strategy for mitigating all-cause fatigue [ 1 2 3 Another potential method to mitigate pre-sleep stress is massage therapy [ 4 5 6 7 8 AEMCs offer a non-pharmacological alternative for achieving relaxation and improving sleep quality, particularly for individuals with high working stress levels [ 9 10 Massage chairs offer many automatic massage options for alleviating muscle tension and reduce fatigue, contributing to improved functionality and well-being, as well as promoting sleep [ 11 Therefore, the purpose of the present study was to examine the effectiveness of various automatic massage protocols available οn AEMCs in regards to relaxation and indices of sleep quality in healthy individuals prior to daytime nap. Based on the design and aims of the current study, it was hypothesized that the ES-massage would be the most effective condition in promoting relaxation and improving sleep quality among the four protocols tested. 2. Materials and Methods 2.1. Subjects Twelve (N = 12) healthy individuals (age 21.8 ± 2.2 years, 6 F/6 M) who met the inclusion criteria and agreed to take part in the study were enrolled ( Figure 1 A CONSORT diagram summarizes recruitment, enrollment, and dropout rates. 2.2. Study Design Subjects were randomly assigned into four conditions: (1) Control (CON), in which participants did not receive any massage program, but instead rested for 30 min in an automatic switch-off electric massage chair, followed by another 30 min lying on a standard double bed; (2) easy-sleep (ES), where participants underwent a 30 min preselected massage program and then rested for an additional 30 min on the same double bed; (3) fatigue-recovery (FR), in which participants received a 30 min preselected massage session followed by 30 min lying on the double bed; and (4) worker-mode (WM), where participants completed a 30-min preselected massage program, followed by 30 min of rest on the double bed ( Figure 2 NCT06784700 https://clinicaltrials.gov/study/NCT06784700 Supplementary Materials 2.3. Procedure All measurements were performed in a sleep lab. Prior to the start of the study, participants completed a Visual Analog Sleepiness Scale (VASS) to evaluate overall sleepiness and health, which was linked to a portable EEG/EOG polysomnography system (HST-mit-tablet, SOMNOmedics, Randersacker, Germany). Each participant then spent 30 min in the automatic massage chair, followed by an additional 30 min lying on a double bed after completing the pre-selected massage session. The sleepiness was assessed at baseline, after the massage session, and after the 30 min “nap time”. Additionally, at the beginning and end of each condition, participants completed three maximal handgrip attempts to evaluate muscle tone, and their vital signs, including heart rate and blood pressure, were obtained. The study concluded after 60 min of recording. Participants were free to sleep or remain awake during the intervention period. All experimental sessions were conducted between 9:00 a.m. and 6:00 p.m., with each participant maintaining the same testing time across all four conditions. 2.4. Body Composition Body composition was evaluated using anthropometric measurements, including body mass index (BMI), and assessed through bioelectrical impedance analysis with a Tanita DC-360S device (Tanita Corporation, Tokyo, Japan), following established standard procedures [ 12 2.5. Visual Scale The Visual Analog Sleepiness Scale (VASS) was employed to evaluate participants’ levels of sleepiness using a standard 1–10 rating system. Specifically, scores of 0–2 indicated “no sleepiness”, 3–5 corresponded to “moderate sleepiness”, 6–8 reflected “high sleepiness”, and 9–10 represented “very high sleepiness”. 2.6. Brain Activity/Sleep Architecture A portable sleep monitoring system was utilized to evaluate both sleep quality and quantity (Home Sleep Test, SOMNOmedics, GmbH, Germany). The system recorded EEG, EOG, and EMG signals overnight. EEG data were analyzed in 30 s epochs using SOMNOmedics PSG analysis software (Domino panel ver. 3.0.0.8), beginning with automatic analysis, followed by manual editing. PSG was conducted with the HomeSleepTest REM+ device, with electrodes placed according to the 10/20 system at key brain regions: Fp1 (left) and M1 for EEG and near the eyes for EOG. Sleep parameters were reported as follows: Total Sleep Time (total sleep duration during the recording), Sleep Efficiency (Total Sleep Time/Time in Bed), Sustained Sleep Efficiency (Total Sleep Time/[Time in Bed—Stage 2 Sleep Latency]), Sleep Latency (time from lights off to the first epoch of any sleep stage, including N1), N1 Sleep Latency (time from lights off to the start of N1 stage), N2 Sleep Latency (time from lights off to the onset of stage 2), REM Latency (time from sleep onset to first REM stage), Wakes (number of awakenings or transitions to full wakefulness during sleep); and WASO (the total duration (in minutes) of wakefulness occurring after the onset of sleep and before final awakening). 2.7. Handgrip Strength Assessment The handgrip test was employed to evaluate the maximum isometric strength of the dominant hand and arm muscles using a Marsden MG-4800 Hand Dynamometer, and it served as an indicator of muscle tone and alertness [ 13 2.8. Massage Session Automatic Electric Massage Chair (AEMC) In this study, a Z1 Full Body 4D Massage Chair (Z1-SL Massage Chair, Volos, Greece, www.back2life.gr Figure 3 2.8.1. Massage Auto-Programs of the AEMC The three preselected automatic massage programs were designed by the manufacturer to enhance relaxation, reduce muscle strain, and aid recovery by applying a variety of massage techniques focused on specific muscle areas. The muscle groups that received the massage effect were divided into two main sections (upper and lower body), with each section comprising three subcategories, as described in ( Table 1 2.8.2. Easy-Sleep Program The easy-sleep (ES) program aims to promote overall body relaxation using slow, gentle motions combined with light air compression, making it suitable for use before bedtime. It incorporates techniques such as kneading, tapping, rolling, and deep tissue massage, targeting specific muscle areas. 2.8.3. Fatigue-Recovery Program The fatigue-recovery (FR) program is intended to ease muscle tension and reduce fatigue after a demanding day, while improving circulation and aiding in muscle restoration. It employs kneading, tapping, rolling, and deep tissue massage techniques directed at specific muscle areas. 2.8.4. Worker-Mode Program The worker-mode (WM) program is designed for individuals who spend long periods sitting or performing demanding tasks. It helps relieve stiffness in the shoulders, back, and lower back through kneading, tapping, rolling, and deep tissue massage techniques applied to targeted muscle groups. 2.9. Statistical Analysis The statistical analysis was performed using IBM SPSS Statistics version 29.0 (IBM Corporation, Armonk, NY, USA). An independent samples t p 2.10. Power Analysis Sample size estimations were performed using G*Power 3.1 [ 14 2.11. Trial Registration The trial was registered under the title “The Usefulness of Automatic Massage Chairs Before Bedtime in Sleep Quality (RoboSleep)” with the full protocol to be accessible through the ClinicalTrials.gov website, trial registration number: NCT06784700 2.12. Data Availability Data for the study are available at ClinicalTrials.gov, with registration number NCT06784700 3. Results Subject characteristics are presented in Table 2 p Pre- and post-intervention assessments among the four different groups are shown in Table 3 Table 3 In particular, handgrip strength was reduced after the CON, ES, FR, and WM trials accordingly (%Δ-change: −12.31% ± 11.5; %Δ-change: −11.85% ± 11.5; %Δ-change: −12.42% ± 11.4; %Δ-change: −15.32% ± 9.9, p Moreover, heart rate was reduced after the ES, FR, and WM trials, accordingly (%Δ-change: −21.59% ± 22.8; %Δ-change: −14.69 ± 15.1; %Δ-change: −15.32% ± 9.9, p p p p A comparative analysis of the VASS across all conditions is presented in Table 4 p p The sleep parameters are reported in Table 5 p p Table 5 In the ES-massage group, participants reached an average TST of 26.76 ± 11.8 min and SE of 43.44 ± 18.7%. These values confirm that participants entered measurable sleep stages during the nap trials, validating the sleep data collected. 4. Discussion To the best of our knowledge, this is the first study to investigate the effects of automatic electric massage chair protocols on body relaxation and sleep efficiency using objective and subjective measurements. The main outcome of the current study, when objective measurements of relaxation were used, was that the easy-sleep massage program exerted the most significant effect, reducing heart rate by −21.59% ( Table 3 Table 4 Table 5 15 16 Table 1 17 The current study shows that a 30 min full-body ES massage chair program benefits both objective measures and subjective experiences in healthy individuals. The ES protocol incorporates techniques such as kneading, tapping, deep tissue pressure, and rolling, specifically designed to promote muscle relaxation, enhance blood circulation, and alleviate muscular tension. Particularly, the majority of the massage duration, i.e., 22 out of 30 min (73% of the total time), was focused on the cervical (neck) and shoulder regions of the upper-body ( Table 1 18 Additionally, a significant portion of the total duration of the ES massage program was focused on the area of the heel and foot (70%), ( Table 1 19 20 21 Furthermore, the ES program recorded the largest decrease in heart rate, i.e., −21.55%, indicating a significant parasympathetic activation, promoting relaxation and reducing stress levels, findings that are in agreement with a study by Fu et al. demonstrating a significant reduction in heart rate and improvement in heart rate variability [ 22 23 In another study by Khairudin et al., the use of an AEMC for treating labor pain in primiparous women showed a significant reduction in pain levels, indicating that mechanical massage may serve as a viable, non-invasive alternative approach for pain management during pregnancy and labor [ 24 Additionally, massage therapy using an AEMC appears to have a positive effect on chemotherapy-related side effects [ 25 26 Another important type of user that benefited from AEMCs is professional athletes. A study by Juncheng Xie et al. [ 27 From a hormonal point of view, there is evidence that massage promotes the release of serotonin [ 28 29 It is evident, therefore, that the use of massage chairs can benefit not only people with increased stress or various health issues but also totally healthy individuals in sustaining a healthy lifestyle or promoting a power nap for boosting their cognitive function or improving creativity. In this study, we recognize several notable strengths, as well as certain unforeseen limitations. The main strengths include the fact that a combination of both objective and subjective methods were employed to evaluate relaxation and brain activity. Additionally, the data analysis was conducted under blinded conditions, with all researchers unaware of the specific session type. Finally, the utilization of a real-time EEG monitoring system offered objective assessment of brain activity, providing valuable insight into the immediate effects of massage on neural function. One limitation is the small sample size, even though the study had more than 95% power to detect statistically significant differences for the primary outcome. Another important limitation is that we cannot precisely identify the specific muscle groups targeted during the automatic massage session, since there was no use of EMG recording. Furthermore, the menstrual cycle of female participants was not controlled in the study; however, none of the female participants were in the menstrual phase at the time. Additionally, other factors that might influence outcomes, such as changes in participants’ sleep habits or psychological state, were not assessed, and this should be considered as a potential limitation. Finally, while researcher blinding was strictly maintained, we did not assess whether participants could guess the type of massage program utilized, which should be considered when interpreting the results. 5. Conclusions Massage routines such the easy-sleep method, focusing on massaging the cervical and shoulder regions to maximize the sense of relaxation and comfort, are among the most effective protocols for promoting sleep efficiency. These findings support the use of automatic electric massage chairs as a non-pharmacological tool for promoting relaxation and enhancing the feeling of drowsiness. Further research is needed to explore its broader applications in populations with sleep disorders. Acknowledgments We would like to thank all participants who volunteered to participate in this study. Disclaimer/Publisher’s Note: Supplementary Materials The following supporting information can be downloaded at: https://www.mdpi.com/article/10.3390/healthcare13182291/s1 Author Contributions Conceptualization, I.N., C.K. and G.K.S.; methodology, I.N., G.K.S. and C.K.; formal analysis, I.N., G.K.S. and C.K.; investigation, I.N., G.K.S. and C.K.; writing—original draft preparation, I.N., G.K.S., C.K., C.D.G., F.P., E.D., N.A. and A.P.; writing—review and editing, I.N., G.K.S., C.K., C.D.G., F.P., E.D., N.A. and A.P.; visualization, I.N., G.K.S. and C.K.; supervision, G.K.S. and C.K.; project administration, G.K.S. and C.K. All authors read and approved the final manuscript. All authors have read and agreed to the published version of the manuscript. Institutional Review Board Statement The study was approved by the Human Research and Ethics Committee of the University of Thessaly (approval code: 2334-4/4-2/7 February 2024; approval date: 7 February 2024). All subjects provided their written informed consent prior to study participation. The study has been registered as a clinical trial at ClinicalsTrials.gov ( NCT06784700 Informed Consent Statement Informed consent was obtained from all subjects involved in this study. Data Availability Statement The original contributions presented in the study are included in the article; further inquiries can be directed to the corresponding author. Conflicts of Interest The authors declare no conflicts of interest. References 1. Dutheil F. Danini B. Bagheri R. Fantini M.L. Pereira B. Moustafa F. Trousselard M. Navel V. Effects of a short daytime nap on the cognitive performance: A systematic review and meta-analysis Int. J. Environ. Res. Public Health 2021 18 10212 10.3390/ijerph181910212 34639511 PMC8507757 2. Lastella M. Halson S.L. Vitale J.A. Memon A.R. Vincent G.E. To nap or not to nap? A systematic review evaluating napping behavior in athletes and the impact on various measures of athletic performance Nat. Sci. Sleep 2021 13 841 862 10.2147/NSS.S315556 34194254 PMC8238550 3. Nishida M. Ichinose A. Murata Y. Shioda K. Effect of napping on a bean bag chair on sleep stage, muscle activity, and heart rate variability PeerJ 2022 10 e13284 10.7717/peerj.13284 35573181 PMC9097667 4. Ntoumas I. Karatzaferi C. Giannaki C.D. Papanikolaou F. Pappas A. Dardiotis E. Sakkas G.K. The Impact of Relaxation Massage Prior to Bedtime on Sleep Quality and Quantity in People with Symptoms of Chronic Insomnia: A Home-Based Sleep Study Healthcare 2025 13 180 10.3390/healthcare13020180 39857207 PMC11765054 5. Labrique-Walusis F. Keister K.J. Russell A.C. Massage therapy for stress management: Implications for nursing practice Orthop. Nurs. 2010 29 254 257 10.1097/NOR.0b013e3181e517c6 20664464 6. Moyer C.A. Rounds J. Hannum J.W. A Meta-Analysis of Massage Therapy Research Psychol. Bull. 2004 130 3 18 10.1037/0033-2909.130.1.3 14717648 7. Sharpe P.A. Williams H.G. Granner M.L. Hussey J.R. A randomised study of the effects of massage therapy compared to guided relaxation on well-being and stress perception among older adults Complement. Ther. Med. 2007 15 157 163 10.1016/j.ctim.2007.01.004 17709060 8. Kang J. Cho Y.S. Lee M. Yun S. Jeong Y.J. Won Y.-H. Hong J. Kim S. Effects of nonpharmacological interventions on sleep improvement and delirium prevention in critically ill patients: A systematic review and meta-analysis Aust. Crit. Care 2023 36 640 649 10.1016/j.aucc.2022.04.006 35718628 9. Engen D.J. Wahner-Roedler D.L. Vincent A. Chon T.Y. Cha S.S. Luedtke C.A. Loehrer L.L. Dion L.J. Rodgers N.J. Bauer B.A. Feasibility and effect of chair massage offered to nurses during work hours on stress-related symptoms: A pilot study Complement. Ther. Clin. Pract. 2012 18 212 215 10.1016/j.ctcp.2012.06.002 23059434 10. Youn B.Y. Cho H. Joo S. Kim H.J. Kim J.Y. Utilization of massage chairs for promoting overall health and wellness: A rapid scoping review Explore 2024 20 285 297 10.1016/j.explore.2023.10.002 37839928 11. Kim Y.J. Kim H.R. Jung Y.H. Park Y.H. Seo S.W. Effects of electrical automatic massage on cognition and sleep quality in alzheimer’s disease spectrum patients: A randomized controlled trial Yonsei Med. J. 2021 62 717 725 10.3349/ymj.2021.62.8.717 34296549 PMC8298867 12. Masakul P. Rungsihirunrat K. The Effectiveness of 3-Month Exercise Program on Body Composition in Overweight Adult Army Male Officers at Support Unit of Armed Forces Development Command, Bangkok, Thailand: A Quasi-Experimental Study Int. J. Multidiscip. Res. Publ. 2020 3 31 36 13. Higgins S.C. Adams J. Hughes R. Measuring hand grip strength in rheumatoid arthritis Rheumatol. Int. 2018 38 707 714 10.1007/s00296-018-4024-2 29626222 14. Faul F. Erdfelder E. Lang A.G. Buchner A. Statistics textbooks in the Behav. Res. Methods 2007 39 175 191 10.3758/BF03193146 17695343 15. Kunikata H. Watanabe K. Miyoshi M. Tanioka T. The effects measurement of hand massage by the autonomic activity and psychological indicators J. Med. Investig. 2012 59 206 212 10.2152/jmi.59.206 22450009 16. Peng S. Ying B. Chen Y. Sun X. Effects of massage on the anxiety of patients receiving percutaneous coronary intervention Psychiatr. Danub. 2015 27 44 49 25751447 17. Li G. Liu D. Yang D. He L. The Impact of Different Muscle Relaxation Techniques on the Upper Trapezius and Its Relationship with the Middle Trapezius J. Physiol. Investig. 2024 67 225 232 10.4103/ejpi.EJPI-D-24-00041 39206782 18. Chu H. Park S.-J. Jeong Y. Kim S. Yeom S.-R. Lee S. Youn B.-Y. Effect of a massage chair (BFM-M8040) on neck and shoulder pain in office workers: A randomized controlled clinical trial Heliyon 2023 9 e20287 10.1016/j.heliyon.2023.e20287 37767509 PMC10520820 19. Gökbulut N. Ibici Akça E. Karakayali Ay Ç. The impact of foot massage given to postmenopausal women on anxiety, fatigue, and sleep: A randomized-controlled trial Menopause 2022 29 1254 1262 10.1097/GME.0000000000002062 36126237 20. Paramita D.A.M.D.P. Widnyana M. Effectiveness of Physiotherapy Interventions on Achilles Tendinopathy Kinesiol. Physiother. Compr. 2022 1 7 10 10.62004/kpc.v1i1.2 21. Stefansson S.H. Brandsson S. Langberg H. Arnason A. Using Pressure Massage for Achilles Tendinopathy: A Single-Blind, Randomized Controlled Trial Comparing a Novel Treatment Versus an Eccentric Exercise Protocol Orthop. J. Sports Med. 2019 7 2325967119834284 10.1177/2325967119834284 30915381 PMC6429908 22. Fu M. Sun C. Liu T. Li S. Effect of Massotherapy on the Fatigue Recovery Using the Smart Massage Chair: A Randomized Controlled Trial J. Mech. Med. Biol. 2022 22 2240046 10.1142/S0219519422400462 23. Lim J.H. Kim H. Jeon C. Cho S. The effects on mental fatigue and the cognitive function of mechanical massage and binaural beats (brain massage) provided by massage chairs Complement. Ther. Clin. Pract. 2018 32 32 38 10.1016/j.ctcp.2018.04.008 30057053 24. Khairudin M.N. Vallikkannu N. Gan F. Hamdan M. Tan P.C. Electric massage chairs reduce labor pain in nulliparous patients: A randomized crossover trial Am. J. Obstet. Gynecol. MFM 2024 6 101324 10.1016/j.ajogmf.2024.101324 38447674 25. Kim J.W. Lim A.R. Lee J.Y. Lee J.Y. Lee S. Choi Y.J. Kim Y.H. Park K.H. The clinical effect of an electric massage chair on chemotherapy-induced nausea and vomiting in cancer patients: Randomized phase II cross-over trial BMC Complement. Med. Ther. 2024 24 163 10.1186/s12906-024-04464-8 38641782 PMC11027524 26. Cygańska A. Truszczyńska-Baszak A. Tomaszewski P. Impact of exercises and chair massage on musculoskeletal pain of young musicians Int. J. Environ. Res. Public Health 2020 17 5128 10.3390/ijerph17145128 32708600 PMC7400366 27. Xie J. Fu M. Liu T. Li S. Liu G. Wang J. Ji C. Zhang T. Clinical studies on the electric automatic massage therapy for recovery of acute sports fatigue Technol. Health Care 2023 31 185 197 10.3233/THC-236016 37038791 PMC10200183 28. Carley D.W. Farabi S.S. Physiology of sleep Diabetes Spectrum. 2016 29 5 9 10.2337/diaspect.29.1.5 26912958 PMC4755451 29. Baek J.Y. Lee E. Gil B. Jung H.W. Jang I.Y. Clinical effects of using a massage chair on stress measures in adults: A pilot randomized controlled trial Complement. Ther. Med. 2022 66 102825 10.1016/j.ctim.2022.102825 35339652 Figure 1 CONSORT diagram. Figure 2 Study flow chart. Subjects assigned in random order in all four different conditions over four continuous weeks. (EEG) = electroencephalography; (CON) = control protocol; (ES) = easy-sleep auto massage auto-program condition; (FR) = fatigue-recovery massage auto-program condition; (WM) = worker-mode massage auto-program condition; VASS: Visual Analog Sleepiness Scale. Start: (1) participants completed the VASS prior to the initiation of the measurement; (2) after massage: participants also completed the VASS exactly 30 min after the transition from the electric automatic massage chair to the bed; (3) after nap: participants also completed the VASS exactly 30 min after waking up from the nap in the bed. Figure 3 Automatic electric massage chair (model: Z1-SL Full Body 4D). healthcare-13-02291-t001_Table 1 Table 1 Specification of the four different conditions. Massage Muscle Groups CON (ES) (FR) (WM)  I. Cervical Spine and Shoulders - 22 13 14  II. Back and Hands - 18 13 21  III. Spinal Area - 8 11 10  IV. Gluteal Muscles and Biceps Femoris - 6 7 11  V. Gastrocnemius (calf) - 17 16 18  VI. Heels and Feet - 20 18 17 Note: CON: control; ES: easy-sleep massage program; FR: fatigue-recovery massage program; WM: worker-mode massage program. healthcare-13-02291-t002_Table 2 Table 2 Baseline characteristics. Parameters Values N 12 Sex 6 M/6 F Age (years) 21.8 ± 2.2 Body Height (cm) 171.1 ± 9.7 Body Weight (kg) 68.1 ± 9.3 BMI (kg/m 2 23.17 ± 1.2 Fat (%) 19.5 ± 6.6 Muscle Mass (kg) 53.2 ± 13.5 Note: Data are presented as Mean ± SD. Significance level: p healthcare-13-02291-t003_Table 3 Table 3 Pre- and post-intervention assessment among the four different protocols using an electric automatic massage chair.   CON   ES   FR   WM  Variables Pre Post p Pre Post p Pre Post p Pre Post p    (Δ-Change%)   (Δ-Change%)   (Δ-Change%)   (Δ-Change%)  N 12 12 - 12 12 - 12 12 - 12 12 -  Systolic Pressure (mmHg) 128.6 ± 22.4 119.4 ± 10.4 0.118 116.9 ± 9.3 116.3 ± 11.5 0.840 123.4 ± 13.6 118.0 ± 13.7 0.076 123.0 ± 14.0 118.1 ± 12.0 0.116  Diastolic Pressure (mmHg) 72.7 ± 9.9 66.9 ± 8.5 0.076 70.3 ± 7.2 64.8 ± 6.7 0.004 71.8 ± 12.7 64.9 ± 9.3 0.051 71.3 ± 10.2 63.1 ± 9.6 0.003  Heart Rate (beats/min) 74.0 ± 10.0 75.4 ± 16.9 0.729 85.7 ± 22.1 67.2 ± 5.8 0.007 75.3 ± 12.6 64.2 ± 8.3 0.000 74.1 ± 9.3 63.4 ± 8.7 0.001 ***  Handgrip Strength (kg) 34.3 ± 8.8 30.1 ± 7.4 0.001 34.2 ± 8.7 30.1 ± 7.5 0.008 * 33.4 ± 7.2 29.3 ± 8.7 0.019 33.4 ± 7.5 28.3 ± 7.1 0.002 ** Note: Data are presented as Mean ± SD. Significance level: p t p p p healthcare-13-02291-t004_Table 4 Table 4 VASS across three phases for the four automatic electric massage chair protocols. Sleepiness Scale Baseline After Massage Chair After Nap p  N 12 12 12 -  (CON) 2.91 ± 2.0 5.66 ± 2.5 * 7.00 ± 2.0 * <0.001 (2.75% ± 0.5) (4.09% ± 0.0)  (ES) 3.08 ± 1.8 5.83 ± 1.8 * 7.58 ± 2.3 * <0.001 (2.75% ± 0.0) (4.50% ± 0.5)  (FR) 3.25 ± 1.7 5.91 ± 2.1 * 7.66 ± 2.2 * <0.001 (2.66% ± 0.4) (4.41% ± 0.5)  (WM) 4.08 ± 2.1 6.75 ± 1.5 * 7.75 ± 2.2 * <0.001 (2.67% ± 0.6) (3.67% ± 0.1) Note: Data are presented as Mean ± SD. Significance level: p p p p p p p p p p p healthcare-13-02291-t005_Table 5 Table 5 Sleep parameters among the four different conditions. Variables CON ES FR WM p 2  N 12 12 12 12 -  TST (min) 20.60 ± 12.5 26.76 ± 11.8 * 25.74 ± 13.8 25.06 ± 13.6 0.239 (13.5 to 27.7) (20.1 to 33.4) (17.9 to 33.5) (17.4 to 32.8) (0.121)  Sleep Efficiency (%) 37.75 ± 21.2 43.44 ± 18.7 * 25.74 ± 13.8 25.06 ± 13.6 <0.001 (25.8 to 49.8) (32.8 to 54) (17.9 to 33.5) (17.4 to 32.8) (0.449)  Sustained Sleep Efficiency (%) 41.88 ± 18.5 49.74 ± 17.9 39.45 ± 25.0 42.03 ± 21.0 0.413 (31.4 to 52.4) (39.6 to 59.8) (25.4 to 53.6) (30.1 to 53.9) (0.079)  Sleep Latency (min) 8.43 ± 13.2 8.36 ± 10.3 3.79 ± 5.0 7.47 ± 12.7 0.556 (0.96 to 15.9) (2.53 to 14.2) (0.96 to 6.62) (0.28 to 14.7) (0.049)  Sleep Latency N1 (min) 8.75 ± 13.1 9.53 ± 10.3 7.28 ± 9.0 8.10 ± 12.9 0.864 (1.34 to 16.2) (3.7 to 15.4) (2.19 to 12.4) (0.8 to 15.4) (0.010)  Sleep Latency N2 (min) 17.73 ± 15.4 11.25 ± 11.3 7.93 ± 13.4 16.31 ± 14.5 0.306 (9.02 to 26.4) (4.86 to 17.6) (0.35 to 15.5) (8.11 to 24.5) (0.123)  Wakes (index) 8.91 ± 3.36 9.75 ± 3.4 8.91 ± 4.1 8.75 ± 4.4 0.861 (7.01 to 10.8) (7.83 to 11.7) (6.59 to 11.2) (6.26 to 11.2) (0.018)  Wake > 3 min (index) 2.09 ± 0.8 2.09 ± 1.1 2.45 ± 1.6 2.72 ± 1.5 0.587 (1.64 to 2.54) (1.47 to 2.71) (1.55 to 3.36) (1.87 to 3.57) (0.054)  WASO (Wake After Sleep Onset) (min·s) 30.25 ± 11.1 26.79 ± 8.1 27.04 ± 10.5 29.4 ± 12.7 0.803 (24 to 36.5) (22.2 to 31.4) (21.1 to 33) (22.2 to 36.6) (0.032) Note: Data are presented as Mean ± SD. Significance level: p p p p ",
  "metadata": {
    "Title of this paper": "Clinical effects of using a massage chair on stress measures in adults: A pilot randomized controlled trial",
    "Journal it was published in:": "Healthcare",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12469339/"
  }
}