{
  "title": "Paper_1014",
  "abstract": "pmc Eur J Hum Genet Eur J Hum Genet 1300 ejhg European Journal of Human Genetics 1018-4813 1476-5438 Nature Publishing Group PMC12480692 PMC12480692.1 12480692 12480692 40745490 10.1038/s41431-025-01918-6 1918 1 Article Biallelic MED29 http://orcid.org/0000-0001-6793-499X Arkush Leo 1 http://orcid.org/0000-0003-2492-9239 van Woerden Geeske M. 2 Ziv Limor 3 Marek-Yagel Dina 4 Fonseca Reginald 5 http://orcid.org/0009-0008-5043-4188 Brevé Esmee 5 Barel Ortal 6 Shalva Nechama 4 Veber Alvit 4 Anikster Yair 4 7 Ben-Ami Raichman Dominique 8 Musallam Banan 9 Marcu Shai 10 Nissenkorn Andreea 7 11 Mandel Hanna 12 13 Kushner Steven A. 14 15 Ben Zeev Bruria 1 7 http://orcid.org/0000-0001-6218-3170 Heimer Gali galih.md@gmail.com 1 7 1 https://ror.org/020rzx487 grid.413795.d 0000 0001 2107 2845 Pediatric Neurology Unit, The Edmond and Lily Safra Children’s Hospital, Sheba Medical Center, 2 https://ror.org/018906e22 grid.5645.2 0000 0004 0459 992X Dept Neuroscience, Dept of Clinical Genetics and Erasmus MC Center of Expertise for Neurodevelopmental Disorders (ENCORE), Erasmus MC, 3 https://ror.org/020rzx487 grid.413795.d 0000 0001 2107 2845 Cancer Research Center, Sheba Medical Center, 4 https://ror.org/020rzx487 grid.413795.d 0000 0001 2107 2845 Metabolic Disease Unit, The Edmond and Lily Safra Children’s Hospital, Sheba Medical Center, 5 https://ror.org/018906e22 grid.5645.2 0000 0004 0459 992X Dept Neuroscience, Erasmus MC, 6 https://ror.org/020rzx487 grid.413795.d 0000 0001 2107 2845 Genomic Unit, Sheba Cancer Research Center, Sheba Medical Center, 7 https://ror.org/04mhzgx49 grid.12136.37 0000 0004 1937 0546 Gray Faculty of Medical and Health Sciences, Tel Aviv University, 8 https://ror.org/020rzx487 grid.413795.d 0000 0001 2107 2845 Department of Diagnostic Imaging, Sheba Medical Center, 9 https://ror.org/02b988t02 grid.469889.2 0000 0004 0497 6510 Pediatric Neurology Unit, Emek Medical Center, 10 https://ror.org/04aw32z04 grid.415114.4 0000 0004 0497 7855 Department of Pediatrics, Baruch Padeh Medical Center, 11 https://ror.org/04ayype77 grid.414317.4 0000 0004 0621 3939 Pediatric Neurology Unit, Wolfson Medical Center, 12 https://ror.org/05mw4gk09 grid.415739.d 0000 0004 0631 7092 Unit of Inherited Metabolic Disorders, Ziv Medical Center, 13 https://ror.org/05mw4gk09 grid.415739.d 0000 0004 0631 7092 Institute of Human Genetics, Ziv Medical Center, 14 https://ror.org/01esghr10 grid.239585.0 0000 0001 2285 2675 Department of Psychiatry, Columbia University Irving Medical Center, 15 https://ror.org/00hj8s172 grid.21729.3f 0000 0004 1936 8729 SNF Center for Precision Psychiatry & Mental Health, Columbia University, 31 7 2025 10 2025 33 10 497870 1271 1280 1 11 2024 20 5 2025 14 7 2025 31 07 2025 01 10 2025 01 10 2025 © The Author(s) 2025 2025 https://creativecommons.org/licenses/by/4.0/ Open Access http://creativecommons.org/licenses/by/4.0/ Pontocerebellar hypoplasia (PCH) represents a group of disorders characterized by cerebellum and pons hypoplasia, variable cerebral involvement, microcephaly, severe global developmental delay (GDD), and seizures. We sought the genetic cause of PCH in two siblings. Genetic workup was performed by whole-exome sequencing followed by Sanger validation. Morpholino-knockdown zebrafish embryos with human wild-type gene rescue were used to assess cerebellar development and motor function. Transfected mouse hippocampal cultures and electroporated mouse embryos were employed to assess functional effects on neuronal morphology and development. Both patients presented with profound GDD, severe microcephaly, cataracts, and variably seizures. Their MRIs demonstrated marked cerebellar and pontine hypoplasia. Both were homozygous for a c.416T > C, p.(Leu139Pro) MED29 MED29 MED29 MED29 Subject terms Genetics research Experimental models of disease https://doi.org/10.13039/501100003977 Israel Science Foundation (ISF) 2023/14 Heimer Gali pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement yes pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes issue-copyright-statement © European Society of Human Genetics 2025 Introduction Pontocerebellar hypoplasia (PCH) describes a group of neurodegenerative disorders, with significant clinical and neuroradiological variability, typically characterized by limited acquisition of developmental milestones, motor impairments, severe intellectual disability, and epilepsy, associated with dysfunction of the cortex, cerebellum, and basal ganglia. An increasing number of genetic defects associated with distinct subtypes have been identified. The most prevalent is PCH2A, which is related to biallelic pathogenic variants in TSEN54 1 Mediator (MED) is a large multiprotein complex with a role in RNA polymerase II (Poll II) gene transcription. Although most of the MED subunits have not been shown to be associated with human disease, there are accumulating descriptions of severe neurodevelopmental disorders arising from pathogenic variants in specific subunits of the complex. Homozygous variants in the genes coding for MED11 MED17 MED20 MED27 2 6 MED23 MED25 7 8 Here we present a novel homozygous variant in MED29 Materials and methods Clinical and genetic workup The proband underwent a thorough neurological examination and workup including brain magnetic resonance imaging (MRI), electroencephalogram (EEG), and metabolic investigations. DNA was extracted from peripheral blood. Trio whole-exome sequencing (WES) of the proband and his parents, followed by bioinformatics, was performed at the Center for Human Genome Variation, Duke University School of Medicine, Durham, North Carolina, USA [ 9 10 Zebrafish strains and maintenance Zebrafish experiments were conducted at the Sheba Medical Center zebrafish facility. All experiments were performed on zebrafish ( Danio rerio huC:Gal4) 11 12 Morpholino injections Morpholinos (MOs) were obtained from GENE Tools LLC (Philomath, Oregon, United States). The following translation-blocking MOs (ATG) were used: Med29MO atg Med17MO atg p53MO atg Med17MO atg Med29MO atg p53MO atg huC:Gal4) Rescue constructs and injections For rescue experiments, human wild-type (wt) MED29 hMed29 wt Med29MO atg p53MO atg huC:Gal4 Med29 RNA probes and whole-mount in situ hybridization PCR amplicons of zebrafish Med17 NM_001077574.1 Med29 NM_173271.1 Pvalb7 NM_205574.2 Rora2 NM_001110167.1 Vglut1 NM_001098755.1 13 PCR and RTPCR Total RNA was extracted (TRIZOL) from a pool of 5–10 uninjected and injected zebrafish larvae according to the manufacturer’s protocol. After DNase treatment, total RNA was used as template to prepare cDNA (High-Capacity, Applied Biosystems™) using PolydT primers. cDNA was used as template for RT-PCR to determine the expression levels of the following cerebellar genes: s100b (gene id Klf9 Med29 Klf8 VglutI Aldocb ( Zic1 Reelin ( pValb7 14 16 ppiab NM_001328424.1 Behavioral test and imaging At 6 dpf, tg(HUC:GAL4) larvae were injected with Med29MO atg UAS: Med29 17 1 2 Statistical analysis for zebrafish experiments Med29MO atg Pvalb7 n Pvalb7 Mouse strains and maintenance Mouse experiments were conducted at the Department of Clinical Genetics at the Erasmus Medical Center. For the primary hippocampal neurons, FvB/NHanHsd FvB/NHanHsd in-utero FvB/NHanHsd C57Bl6/J ad libitum Primary hippocampal cultures Adult pregnant female mice were sacrificed via cervical dislocation at E16.5 of gestation. Pups were immediately removed from the uterus, and brain tissue was collected in ice-cold Neural Basal Medium (NB; Gibco, 21103049). Hippocampi were isolated from embryonal brains and collected in 10 mL ice cold NB, after which the tissue was washed twice with cold NB and incubated with Trypsin/EDTA (Sigma; T3924) at 37 °C. The tissue was then washed twice with warm NB and kept in supplemented NB (1%penicillin/streptomycin (Sigma; p4333)/1%GlutaMax (Gibco; 350500-38)/2%B27-supplement (Gibco; 17504044) for dissociation. Single cell dissociated neurons were seeded into 12-well plates containing Poly-D-Lysine (Sigma; P0899) coated coverslips with 1 mL supplemented NB per well. Cells were incubated at 37 °C/5% CO 2 Cloning of the plasmids for neuronal transfections MED29 WT NM_001321571.2 MED29 WT 18 19 MED29 WT Med29 1 2 3 Neuronal transfections and immunological staining Primary hippocampal neurons (e16.5) were transfected on days in vitro (DIV) 3 with the following constructs for the overexpression experiments: empty vector control, MED29 WT Leu139Pro In utero electroporation In utero 18 19 ® WT Leu139Pro Med29 Perfusion and immunohistochemistry Pups were sacrificed on the day of birth or one day after birth (P0 or P1; postnatal day 0 or 1, respectively), through cardiac perfusion with saline solution, followed by 4% PFA. After perfusion, the brains were isolated and post-fixed in 4% PFA for 1 h at room temperature. The brains were then stored overnight in 30% sucrose in 0.1 M PB. Perfused brains were embedded in 14% gelatin/30% sucrose, and free-floating sections were made using a cryo-microtome (40–50 µm thick). Sections were washed in 0.1 M PB and counterstained with 4′,6-diamidino-2-phenylindole solution (DAPI, 1:10000, Invitrogen) before being mounted on glass and covered with Mowiol (Sigma). Only a selection of sections was used for counterstaining. Stained and covered brain slices were used for confocal imaging. Confocal microscopy Images were acquired using a LSM700 confocal microscope (Zeiss). For primary hippocampal neurons, images were taken from 8 to 10 transfected neurons per condition (20× objective, 0.5 zoom, 1024 × 1024) per batch of neurons, with a minimum of 2 batches of neurons per condition. For the migration analysis, images were taken from two to three non-consecutive sections from at least three successfully targeted animals per condition (10× objective, 0.5 zoom, 1024 × 1024). Images were analyzed using NIH ImageJ. Statistical analysis for mice experiments Neuronal morphology Total neurite length and number of branches were traced using ImageJ and its plug-in module NeuronJ. Within each batch, the data was normalized to the MED29 WT t WT Leu139Pro Med29 Neuronal migration Data were assumed to be normally distributed. Statistical analysis was performed on data of the first four bins of each cropped image, corresponding to the cortical plate (CP). The CP was anatomically defined as the most proximal 40% of the dorsoventral distance between the pia and ventricle. In the overexpression experiments, all conditions were compared to empty vector control and to MED29 WT WT Leu139Pro Med29 P Results Case studies The proband was born to healthy, consanguineous parents of Middle Eastern Arab descent. Pregnancy and birth were unremarkable. He was born at full term with a birth weight of 2.5 kg, head circumference (HC) of 32 cm (1.71 standard deviations [SD] below the mean) and an Apgar score of 9 at minutes 1 and 5. Bilateral cataracts were noted prior to discharge, for which he later underwent surgery. He presented to our tertiary center for neurological evaluation at the age of 10 months with profound GDD, severe microcephaly (HC 40 cm, −4.71 SD 1A 1C SD SD SD Fig. 1 Clinical data of the proband and his family. A B C D E MED29 His younger brother was born at 40 weeks with a birth weight of 2.5 kg, HC of 32 cm (−1.71 SD SD SD 1B Genetic workup Following the WES filtering process, 16 candidate variants were identified, in genes which were either not previously described in association with human disease or were associated with a phenotype not consistent with the patient’s clinical picture. Of these, stood out a homozygous MED29 NM_017592 NM_017592.4 MED29 MED29 1 E 1 MED29 MED29 Zebrafish modeling ISH demonstrated strong expression of both MED17 MED29 2A MED17 MED29 + + 2B p 2C MED29 1 2 MED29 2 E MED29 2F 2G Fig. 2 Zebrafish knockdown modeling and rescue. A B MED17 MED29 P53 MED17 MED29 C MED29 MED17 MED29 MED17 D MED29 MED29 E MED29 MED29 MED29 F MED29 MED29 MED29 G D MED29 MED29 MED29 Mice modeling To assess the pathogenicity of the p.(Leu139Pro) missense variant, mouse primary hippocampal neurons were transfected at DIV3 with either empty vector control, MED29 WT MED29 Leu139Pro MED29 WT F p F p WT p 3 B Leu139Pro WT Leu139Pro p Leu139Pro WT p 3 B Leu139Pro WT Leu139Pro Med29 Med29 Med29 p Med29 p t 3 D Leu139Pro Fig. 3 Increased and decreased expression levels of MED29 affect neuronal development in culture; reduced expression levels of MED29 affects neuronal migration in vivo. A WT Leu139Pro B C Med29 D MED29 p p E WT Leu139Pro F Leu139Pro G Med29 H p p To further substantiate the role of MED29 in neuronal development, we made use of the in-utero 20 MED29 In utero 21 WT WT F p WT p 3 F Leu139Pro WT Leu139Pro WT p Leu139Pro p 3 F Med29 Med29 p t 3 H Discussion We report a novel homozygous MED29 22 23 MED29 24 The Mediator complex serves as a bridge, connecting the transcription factor with the Pol II machinery, alongside formation of the pre-initiation complex. It also acts a “hub” for coordinating multiple steps in the transcription process, including mRNA and non-coding RNA processing and epigenetic regulation [ 9 1 MED17 3 25 MED17 6 MED20 5 MED27 4 26 MED11 2 26 26 https://michelanglo.sgc.ox.ac.uk/r/med27 Table 1 Clinical phenotype of previously described MEDopathies and individuals described here. MED12 [ 29 31 MED17 [ 3 6 25 MED20 [ 5 MED25 [ 8 MED27 [ 4 26 MED11 [ 2 MED29 current work Cerebellar hypoplasia/atrophy +/- ++ ++ - ++ + ++ Cerebral atrophy +/- ++ ++ + + ++ ++ Basal ganglia abnormalities - - ++ - + + + Myelination abnormality - ++ - n/a + + ++ Corpus callosum abnormality + ++ ++ - + - ++ Microcephaly +/- ++ ++ ++ + ++ ++ Spasticity - ++ ++ n/a + +/- ++ Axial hypotonia + ++ ++ ++ + ++ ++ Dystonia - - + + + + - Ataxia +/- +/- - n/a + n/a n/a Behavioral abnormalities ++ - - n/a +/- n/a n/a GDD/ID + ++ ++ ++ ++ ++ ++ Seizures +/- ++ - +/- + + + Cataracts - - + + + +/- ++ Dysmorphism ++ - - ++ + ++ - Hearing loss +/- - - - +/- ++ n/a Cardiac defects - - - + - +/- n/a Mode of inheritance X-linked AR AR AR AR AR AR ++ Always observed, + Frequently observed, +/- Variably observed, - Never observed. n/a – no available data. However, there is increasing data of milder phenotypes lacking the striking neuroradiological signs described above, in disorders associated with other subunits. Among these are MED12 MED13 CDK8 27 32 MED25 8 In common with other patients reported with variants in MED11 MED17 MED20 MED27 MED29 MED29 MED29 To model the different clinical aspects of MED29 dysfunction we used three different modalities—zebrafish morphants, mouse primary hippocampal cultures, and mouse embryos. Consistent with zebrafish models of TSEN54-related PCH [ 33 MED29 MED17 MED17 MED29 34 MED29 MED29 Leu139Pro MED29 Leu139Pro In conclusion, we demonstrate that MED29 35 36 MED29 Supplementary information  Supplementary video 1 Supplementary video 2 Supplementary Table 1 Supplementary video Legends Publisher’s note These authors contributed equally: Leo Arkush, Geeske M. van Woerden, Limor Ziv. These authors jointly supervised this work: Steven A. Kushner, Bruria Ben Zeev, Gali Heimer. Supplementary information The online version contains supplementary material available at 10.1038/s41431-025-01918-6. Acknowledgements This work is dedicated to the memory of Shai Marcu, 1968–2023, our dear friend and colleague. Author contributions Conceptualization: GH, BBZ, SAK; Investigation: GMvW, LZ, DMY, RF, EB, NS, AV, OB; Patient clinical and diagnostic evaluations: LA, YA, DAR, BM, SM, YA, AN, HM, GH. Writing—original draft and editing: LA, GH, SAK, BBV. Writing—review, editing and final approval—all authors. Funding GH was supported by a grant from the Israel Science Foundation. Grant number ­ 2023/14. Open access funding provided by Tel Aviv University. Data availability The data generated in this study can be found within the article. Raw data is available from the corresponding author request. Competing interests All authors declare no competing interests. Ethics approval The molecular studies were approved by the ethical committee of Sheba Medical Center and the Israeli Ministry of Health. Written informed consent was obtained from all participants or their respective legal guardians. Personal data was de-identified. All animal experiments were approved by the Local Animal Experimentation Ethical Committee, in accordance with Institutional Animal Care and Use Committee guidelines (IRN2019-0030). References 1. van Dijk T Baas F Barth PG Poll-The BT What’s new in pontocerebellar hypoplasia? An update on genes and subtypes Orphanet J Rare Dis 2018 13 92 10.1186/s13023-018-0826-2 29903031 PMC6003036 van Dijk T, Baas F, Barth PG, Poll-The BT. What’s new in pontocerebellar hypoplasia? An update on genes and subtypes. Orphanet J Rare Dis. 2018;13:92. 29903031 10.1186/s13023-018-0826-2 PMC6003036 2. Calì E Lin SJ Rocca C Sahin Y Al Shamsi A El Chehadeh S A homozygous MED11 C-terminal variant causes a lethal neurodegenerative disease Genetics Med 2022 24 2194 203 10.1016/j.gim.2022.07.013 36001086 PMC10519206 Calì E, Lin SJ, Rocca C, Sahin Y, Al Shamsi A, El Chehadeh S, et al. A homozygous MED11 C-terminal variant causes a lethal neurodegenerative disease. Genetics Med. 2022;24:2194–203. 36001086 10.1016/j.gim.2022.07.013 PMC10519206 3. Fattal-Valevski A ben Sira L Lerman-Sagie T Strausberg R Bloch-Mimouni A Edvardson S Delineation of the phenotype of MED17-related disease in Caucasus-Jewish families European J Paediatr Neurol 2021 32 40 5 10.1016/j.ejpn.2020.08.011 33756211 Fattal-Valevski A, ben Sira L, Lerman-Sagie T, Strausberg R, Bloch-Mimouni A, Edvardson S, et al. Delineation of the phenotype of MED17-related disease in Caucasus-Jewish families. European J Paediatr Neurol. 2021;32:40–5. 33756211 10.1016/j.ejpn.2020.08.011 4. Meng L Isohanni P Shao Y Graham BH Hickey SE Brooks S MED27 Variants Cause Developmental Delay, Dystonia, and Cerebellar Hypoplasia Ann Neurol 2021 89 828 33 10.1002/ana.26019 33443317 Meng L, Isohanni P, Shao Y, Graham BH, Hickey SE, Brooks S, et al. MED27 Variants Cause Developmental Delay, Dystonia, and Cerebellar Hypoplasia. Ann Neurol. 2021;89:828–33. 33443317 10.1002/ana.26019 5. Vodopiutz J Schmook MT Konstantopoulou V Plecko B Greber-Platzer S Creus M MED20 mutation associated with infantile basal ganglia degeneration and brain atrophy Eur J Pediatr 2015 174 113 8 10.1007/s00431-014-2463-7 25446406 Vodopiutz J, Schmook MT, Konstantopoulou V, Plecko B, Greber-Platzer S, Creus M, et al. MED20 mutation associated with infantile basal ganglia degeneration and brain atrophy. Eur J Pediatr. 2015;174:113–8. 25446406 10.1007/s00431-014-2463-7 6. Agostini A Marchetti D Izzi C Cocco I Pinelli L Accorsi P Expanding the phenotype of MED 17 mutations: description of two new cases and review of the literature Am J Med Genet Part B Neuropsychiatr Genet 2018 177 687 90 10.1002/ajmg.b.32677 30345598 Agostini A, Marchetti D, Izzi C, Cocco I, Pinelli L, Accorsi P, et al. Expanding the phenotype of MED 17 mutations: description of two new cases and review of the literature. Am J Med Genet Part B Neuropsychiatr Genet. 2018;177:687–90. 10.1002/ajmg.b.32677 30345598 7. Hashemi-Gorji F Fardaei M Tabei SMB Miryounesi M Novel mutation in the MED23 gene for intellectual disability: a case report and literature review Clin Case Rep 2019 7 331 5 10.1002/ccr3.1942 30847200 PMC6389469 Hashemi-Gorji F, Fardaei M, Tabei SMB, Miryounesi M. Novel mutation in the MED23 gene for intellectual disability: a case report and literature review. Clin Case Rep. 2019;7:331–5. 30847200 10.1002/ccr3.1942 PMC6389469 8. Basel-Vanagaite L Smirin-Yosef P Essakow JL Tzur S Lagovsky I Maya I Homozygous MED25 mutation implicated in eye-intellectual disability syndrome Hum Genet 2015 134 577 87 10.1007/s00439-015-1541-x 25792360 Basel-Vanagaite L, Smirin-Yosef P, Essakow JL, Tzur S, Lagovsky I, Maya I, et al. Homozygous MED25 mutation implicated in eye-intellectual disability syndrome. Hum Genet. 2015;134:577–87. 25792360 10.1007/s00439-015-1541-x 9. Zhu X Petrovski S Xie P Ruzzo EK Lu YF McSweeney KM Whole-exome sequencing in undiagnosed genetic diseases: interpreting 119 trios Genet Med 2015 17 774 81 10.1038/gim.2014.191 25590979 PMC4791490 Zhu X, Petrovski S, Xie P, Ruzzo EK, Lu YF, McSweeney KM, et al. Whole-exome sequencing in undiagnosed genetic diseases: interpreting 119 trios. Genet Med. 2015;17:774–81. 25590979 10.1038/gim.2014.191 PMC4791490 10. Heimer G Marek-Yagel D Eyal E Barel O Oz Levi D Hoffmann C SLC1A4 mutations cause a novel disorder of intellectual disability, progressive microcephaly, spasticity and thin corpus callosum Clin Genet 2015 88 327 35 10.1111/cge.12637 26138499 Heimer G, Marek-Yagel D, Eyal E, Barel O, Oz Levi D, Hoffmann C, et al. SLC1A4 mutations cause a novel disorder of intellectual disability, progressive microcephaly, spasticity and thin corpus callosum. Clin Genet. 2015;88:327–35. 26138499 10.1111/cge.12637 11. Park HC Kim CH Bae YK Yeo SY Kim SH Hong SK Analysis of upstream elements in the HuC promoter leads to the establishment of transgenic zebrafish with fluorescent neurons Dev Biol 2000 227 279 93 10.1006/dbio.2000.9898 11071755 Park HC, Kim CH, Bae YK, Yeo SY, Kim SH, Hong SK, et al. Analysis of upstream elements in the HuC promoter leads to the establishment of transgenic zebrafish with fluorescent neurons. Dev Biol. 2000;227:279–93. 11071755 10.1006/dbio.2000.9898 12. Choe CP Choi SY Kee Y Kim MJ Kim SH Lee Y Transgenic fluorescent zebrafish lines that have revolutionized biomedical research Lab Anim Res 2021 37 26 10.1186/s42826-021-00103-2 34496973 PMC8424172 Choe CP, Choi SY, Kee Y, Kim MJ, Kim SH, Lee Y, et al. Transgenic fluorescent zebrafish lines that have revolutionized biomedical research. Lab Anim Res. 2021;37:26. 34496973 10.1186/s42826-021-00103-2 PMC8424172 13. Ziv L Levkovitz S Toyama R Falcon J Gothilf Y Functional development of the zebrafish pineal gland: light-induced expression of period2 is required for onset of the circadian clock J Neuroendocrinol 2005 17 314 20 10.1111/j.1365-2826.2005.01315.x 15869567 Ziv L, Levkovitz S, Toyama R, Falcon J, Gothilf Y. Functional development of the zebrafish pineal gland: light-induced expression of period2 is required for onset of the circadian clock. J Neuroendocrinol. 2005;17:314–20. 15869567 10.1111/j.1365-2826.2005.01315.x 14. Bae YK Kani S Shimizu T Tanabe K Nojima H Kimura Y Anatomy of zebrafish cerebellum and screen for mutations affecting its development Dev Biol 2009 330 406 26 10.1016/j.ydbio.2009.04.013 19371731 Bae YK, Kani S, Shimizu T, Tanabe K, Nojima H, Kimura Y, et al. Anatomy of zebrafish cerebellum and screen for mutations affecting its development. Dev Biol. 2009;330:406–26. 19371731 10.1016/j.ydbio.2009.04.013 15. Tsai MY Lu YF Liu YH Lien HW Huang CJ Wu JL Modulation of p53 and met expression by Krüppel-like factor 8 regulates zebrafish cerebellar development Dev Neurobiol 2015 75 908 26 10.1002/dneu.22258 25528982 Tsai MY, Lu YF, Liu YH, Lien HW, Huang CJ, Wu JL, et al. Modulation of p53 and met expression by Krüppel-like factor 8 regulates zebrafish cerebellar development. Dev Neurobiol. 2015;75:908–26. 25528982 10.1002/dneu.22258 16. Lebrun C Avci HX Wehrlé R Doulazmi M Jaudon F Morel MP Klf9 is necessary and sufficient for Purkinje cell survival in organotypic culture Mol Cell Neurosci 2013 54 9 21 10.1016/j.mcn.2012.11.010 23201237 Lebrun C, Avci HX, Wehrlé R, Doulazmi M, Jaudon F, Morel MP, et al. Klf9 is necessary and sufficient for Purkinje cell survival in organotypic culture. Mol Cell Neurosci. 2013;54:9–21. 23201237 10.1016/j.mcn.2012.11.010 17. Scott EK The Gal4/UAS toolbox in zebrafish: new approaches for defining behavioral circuits J Neurochem 2009 110 441 56 10.1111/j.1471-4159.2009.06161.x 19457087 Scott EK. The Gal4/UAS toolbox in zebrafish: new approaches for defining behavioral circuits. J Neurochem. 2009;110:441–56. 19457087 10.1111/j.1471-4159.2009.06161.x 18. Proietti Onori M Koopal B Everman DB Worthington JD Jones JR Ploeg MA The intellectual disability-associated CAMK2G p.Arg292Pro mutation acts as a pathogenic gain-of-function Hum Mutat 2018 39 2008 24 10.1002/humu.23647 30184290 PMC6240363 Proietti Onori M, Koopal B, Everman DB, Worthington JD, Jones JR, Ploeg MA, et al. The intellectual disability-associated CAMK2G p.Arg292Pro mutation acts as a pathogenic gain-of-function. Hum Mutat. 2018;39:2008–24. 30184290 10.1002/humu.23647 PMC6240363 19. Küry S van Woerden GM Besnard T Proietti Onori M Latypova X Towne MC De novo mutations in protein kinase genes CAMK2A and CAMK2B cause intellectual disability Am J Hum Genet 2017 101 768 88 10.1016/j.ajhg.2017.10.003 29100089 PMC5673671 Küry S, van Woerden GM, Besnard T, Proietti Onori M, Latypova X, Towne MC, et al. De novo mutations in protein kinase genes CAMK2A and CAMK2B cause intellectual disability. Am J Hum Genet. 2017;101:768–88. 29100089 10.1016/j.ajhg.2017.10.003 PMC5673671 20. Saito T In vivo electroporation in the embryonic mouse central nervous system Nat Protoc 2006 1 1552 8 10.1038/nprot.2006.276 17406448 Saito T. In vivo electroporation in the embryonic mouse central nervous system. Nat Protoc. 2006;1:1552–8. 17406448 10.1038/nprot.2006.276 21. Taniguchi Y Young-Pearse T Sawa A Kamiya A In utero electroporation as a tool for genetic manipulation in vivo to study psychiatric disorders: from genes to circuits and behaviors Neuroscientist 2012 18 169 79 10.1177/1073858411399925 21551077 PMC3530425 Taniguchi Y, Young-Pearse T, Sawa A, Kamiya A. In utero electroporation as a tool for genetic manipulation in vivo to study psychiatric disorders: from genes to circuits and behaviors. Neuroscientist. 2012;18:169–79. 21551077 10.1177/1073858411399925 PMC3530425 22. Yin JW Wang G The Mediator complex: a master coordinator of transcription and cell lineage development Development 2014 141 977 87 10.1242/dev.098392 24550107 Yin JW, Wang G. The Mediator complex: a master coordinator of transcription and cell lineage development. Development. 2014;141:977–87. 24550107 10.1242/dev.098392 23. Sato S Tomomori-Sato C Parmely TJ Florens L Zybailov B Swanson SK A set of consensus mammalian mediator subunits identified by multidimensional protein identification technology Mol Cell 2004 14 685 91 10.1016/j.molcel.2004.05.006 15175163 Sato S, Tomomori-Sato C, Parmely TJ, Florens L, Zybailov B, Swanson SK, et al. A set of consensus mammalian mediator subunits identified by multidimensional protein identification technology. Mol Cell. 2004;14:685–91. 15175163 10.1016/j.molcel.2004.05.006 24. Kuuselo R, Savinainen K, Sandström S, Autio R, Kallioniemi A. MED29, a component of the mediator complex, possesses both oncogenic and tumor suppressive characteristics in pancreatic cancer. Int J Cancer. 2011;129:2553–65. 10.1002/ijc.25924 PMC3118263 21225629 25. Kaufmann R Straussberg R Mandel H Fattal-Valevski A Ben-Zeev B Naamati A Infantile cerebral and cerebellar atrophy is associated with a mutation in the MED17 subunit of the transcription preinitiation mediator complex Am J Hum Genet 2010 87 667 70 10.1016/j.ajhg.2010.09.016 20950787 PMC2978946 Kaufmann R, Straussberg R, Mandel H, Fattal-Valevski A, Ben-Zeev B, Naamati A, et al. Infantile cerebral and cerebellar atrophy is associated with a mutation in the MED17 subunit of the transcription preinitiation mediator complex. Am J Hum Genet. 2010;87:667–70. 20950787 10.1016/j.ajhg.2010.09.016 PMC2978946 26. Maroofian R Kaiyrzhanov R Cali E Zamani M Zaki MS Ferla M Biallelic MED27 variants lead to variable ponto-cerebello-lental degeneration with movement disorders Brain 2023 146 5031 43 10.1093/brain/awad257 37517035 PMC10690011 Maroofian R, Kaiyrzhanov R, Cali E, Zamani M, Zaki MS, Ferla M, et al. Biallelic MED27 variants lead to variable ponto-cerebello-lental degeneration with movement disorders. Brain. 2023;146:5031–43. 37517035 10.1093/brain/awad257 PMC10690011 27. Comeau D Belliveau J Bouhamdani N Amor MB Expanding the phenotypic spectrum for CDK8-related disease: a case report Am J Med Genet A 2024 194 e63537 10.1002/ajmg.a.63537 38193604 Comeau D, Belliveau J, Bouhamdani N, Amor MB. Expanding the phenotypic spectrum for CDK8-related disease: a case report. Am J Med Genet A. 2024;194:e63537. 38193604 10.1002/ajmg.a.63537 28. Snijders Blok L Hiatt SM Bowling KM Prokop JW Engel KL Cochran JN De novo mutations in MED13, a component of the Mediator complex, are associated with a novel neurodevelopmental disorder Hum Genet 2018 137 375 88 10.1007/s00439-018-1887-y 29740699 PMC5973976 Snijders Blok L, Hiatt SM, Bowling KM, Prokop JW, Engel KL, Cochran JN, et al. De novo mutations in MED13, a component of the Mediator complex, are associated with a novel neurodevelopmental disorder. Hum Genet. 2018;137:375–88. 29740699 10.1007/s00439-018-1887-y PMC5973976 29. Togi S, Ura H, Niida Y. Qualitative and quantitative analysis of MED12 c.887G>A causing both missense and splicing variants in X-linked Ohdo syndrome. Am J Med Genet A. 2024:24;e63628. 10.1002/ajmg.a.63628 38655688 30. Polla DL Bhoj EJ Verheij JBGM Wassink-Ruiter JSK Reis A Deshpande C De novo variants in MED12 cause X-linked syndromic neurodevelopmental disorders in 18 females Genet Med 2021 23 645 52 10.1038/s41436-020-01040-6 33244165 Polla DL, Bhoj EJ, Verheij JBGM, Wassink-Ruiter JSK, Reis A, Deshpande C, et al. De novo variants in MED12 cause X-linked syndromic neurodevelopmental disorders in 18 females. Genet Med. 2021;23:645–52. 33244165 10.1038/s41436-020-01040-6 31. van de Plassche S, de Brouwer AP. MED12-related (neuro)developmental disorders: a question of causality. Genes. 2021;28;12. 10.3390/genes12050663 PMC8146938 33925166 32. Risheg H Graham JM Clark RD Rogers RC Opitz JM Moeschler JB A recurrent mutation in MED12 leading to R961W causes Opitz-Kaveggia syndrome Nat Genet 2007 39 451 3 10.1038/ng1992 17334363 Risheg H, Graham JM, Clark RD, Rogers RC, Opitz JM, Moeschler JB, et al. A recurrent mutation in MED12 leading to R961W causes Opitz-Kaveggia syndrome. Nat Genet. 2007;39:451–3. 17334363 10.1038/ng1992 33. Kasher PR Namavar Y van Tijn P Fluiter K Sizarov A Kamermans M Impairment of the tRNA-splicing endonuclease subunit 54 (tsen54) gene causes neurological abnormalities and larval death in zebrafish models of pontocerebellar hypoplasia Hum Mol Genet 2011 20 1574 84 10.1093/hmg/ddr034 21273289 Kasher PR, Namavar Y, van Tijn P, Fluiter K, Sizarov A, Kamermans M, et al. Impairment of the tRNA-splicing endonuclease subunit 54 (tsen54) gene causes neurological abnormalities and larval death in zebrafish models of pontocerebellar hypoplasia. Hum Mol Genet. 2011;20:1574–84. 21273289 10.1093/hmg/ddr034 34. Coolen M Altin N Rajamani K Pereira E Siquier-Pernet K Puig Lombardi E Recessive PRDM13 mutations cause fatal perinatal brainstem dysfunction with cerebellar hypoplasia and disrupt Purkinje cell differentiation Am J Hum Genet 2022 109 909 27 10.1016/j.ajhg.2022.03.010 35390279 PMC9118116 Coolen M, Altin N, Rajamani K, Pereira E, Siquier-Pernet K, Puig Lombardi E, et al. Recessive PRDM13 mutations cause fatal perinatal brainstem dysfunction with cerebellar hypoplasia and disrupt Purkinje cell differentiation. Am J Hum Genet. 2022;109:909–27. 35390279 10.1016/j.ajhg.2022.03.010 PMC9118116 35. André KM Sipos EH Soutourina J Mediator roles going beyond transcription Trends Genet 2021 37 224 34 10.1016/j.tig.2020.08.015 32921511 André KM, Sipos EH, Soutourina J. Mediator roles going beyond transcription. Trends Genet. 2021;37:224–34. 32921511 10.1016/j.tig.2020.08.015 36. Zakaria RBM Malta M Pelletier F Addour-Boudrahem N Pinchefsky E Martin CS Classic “PCH” genes are a rare cause of radiologic pontocerebellar hypoplasia Cerebellum 2024 23 418 30 10.1007/s12311-023-01544-2 36971923 Zakaria RBM, Malta M, Pelletier F, Addour-Boudrahem N, Pinchefsky E, Martin CS, et al. Classic “PCH” genes are a rare cause of radiologic pontocerebellar hypoplasia. Cerebellum. 2024;23:418–30. 36971923 10.1007/s12311-023-01544-2 ",
  "metadata": {
    "Title of this paper": "Classic “PCH” genes are a rare cause of radiologic pontocerebellar hypoplasia",
    "Journal it was published in:": "European Journal of Human Genetics",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12480692/"
  }
}