{
  "title": "Paper_1187",
  "abstract": "pmc Vaccines (Basel) Vaccines (Basel) 2764 vaccines vaccines Vaccines 2076-393X Multidisciplinary Digital Publishing Institute  (MDPI) PMC12474148 PMC12474148.1 12474148 12474148 41012120 10.3390/vaccines13090917 vaccines-13-00917 1 Article Trusted Voices: Assessing Trusted Sources of Human Papillomavirus Vaccine Information Among a Sample of Hispanic Parents Martinez Alyssa A. 1 Shastri Surendranath S. Conceptualization Methodology Software Validation Formal analysis Writing – original draft Writing – review & editing Supervision 2 https://orcid.org/0000-0001-9226-3139 Frietze Gabriel A. 3 * Plans-Rubió Pedro Academic Editor 1 aamartinez18@utep.edu 2 ssshastri@mdanderson.org 3 * gafrietze@utep.edu 28 8 2025 9 2025 13 9 497676 917 09 7 2025 19 8 2025 26 8 2025 28 08 2025 28 09 2025 29 09 2025 © 2025 by the authors. 2025 https://creativecommons.org/licenses/by/4.0/ Licensee MDPI, Basel, Switzerland. This article is an open access article distributed under the terms and conditions of the Creative Commons Attribution (CC BY) license ( https://creativecommons.org/licenses/by/4.0/ Background/Objectives: Hispanics living in the United States have higher rates of diagnosis and mortality from certain kinds of cancers, including human papillomavirus (HPV)-related cancers. HPV vaccines can prevent 90% of HPV-associated cancers. Methods: The purpose of this study was to recruit a sample of Hispanic parents to investigate trusted sources of HPV vaccine information. An online survey was used to collect data from Hispanic parents who reported having children between the ages of 11 and 17. Results: Parents of children 11–17 years of age ( n M age SD p p r p HPV vaccine trusted sources of information Hispanic healthcare provider recommendations Cancer Prevention and Research Institute of Texas (CPRIT) RP210153 This publication was supported by the Cancer Prevention and Research Institute of Texas (CPRIT) under award number RP210153. pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement yes pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes 1. Introduction Human papillomavirus (HPV) is one of the most common sexually transmitted infections (STIs) and a leading cause of several cancers in both men and women [ 1 2 3 2 4 5 Currently, there are six HPV vaccines available which can prevent approximately 90% of HPV-associated cancers [ 6 7 8 8 8 9 Since its introduction, the HPV vaccine has contributed to global declines in HPV infection, pre-cancerous lesions of the cervix, cervical cancer, and genital warts, demonstrating its positive public health impact [ 10 6 11 12 13 14 15 Understanding both national and international epidemiology along with the challenges that influence vaccine acceptability, such as culture, is crucial for developing culturally competent public health messages that promote HPV vaccine uptake. There is a critical need for the development of culturally competent public health messages that are effective at promoting the HPV vaccine in Hispanic families, a population that may face unique barriers related to healthcare access, cultural beliefs, and trusted sources of health information. Our study will address this gap by providing data to drive the development of public health messages that promote HPV vaccination through the use of trusted sources of information (or trusted messengers of vaccine information). 1.1. Hispanic Culture and the Role of Family Cancer outcomes are highly influenced by social, cultural, behavioral, and biological factors [ 16 17 1.2. Trusted Sources of Vaccine Information HCP recommendations play a pivotal role in increasing acceptance of the HPV vaccine. In a review by Olson et al. (2020), which examined communication strategies to address parental hesitancy toward childhood vaccinations, HCPs were identified as the most influential source of vaccine information for parents [ 18 19 1.3. Theoretical Framework The Health Belief Model (HBM) [ 20 17 21 21 22 1.4. Purpose This cross-sectional study aimed to gather early insights into which messengers are viewed as credible sources of HPV vaccine information by MA parents of children aged 11 to 17 years ( n 1.5. Aims and Hypotheses The primary aim of this project was to identify who parents trust for HPV vaccine recommendations. The secondary aim of this project was to examine factors that are associated with HPV vaccination. It is hypothesized that the most trusted source of HPV vaccine information will be healthcare providers. That is, medical doctors (MDs) will be perceived as the most trusted source of HPV vaccine information. In addition, it is hypothesized that the HBM constructs (perceived susceptibility, severity, benefits, and barriers) will predict vaccine acceptance. 2. Materials and Methods 2.1. Study Design A cross-sectional survey designed for an inventory assessment of HPV-related items was deployed in a Hispanic majority sample between October 2022 and January 2023, following the STROBE reporting guidelines (See Supplementary Files S1 2.2. Setting The study was conducted in El Paso, Texas, a United States/Mexico border city with a predominately Hispanic population. 2.3. Participants Parents with children eligible for the HPV vaccine (ages 11–17) were recruited to complete a 30-min online survey and were compensated with a USD 15 electronic gift card for their participation. The survey assessed trustworthy messengers of HPV vaccine information and social, cultural, and behavioral correlates of accepting the HPV vaccine. Participants were recruited using Facebook geotargeted advertisements. A power analysis using G*Power 3 [ 23 r 24 2.4. Measures A 30-min survey was administered to parents to assess basic demographics, trusted sources of HPV information, familial attitudes about vaccines, and factors from the HBM. See Table 1 2.5. Data Sources/Measurement The survey was administered via QuestionPro which can be used on a computer, cellphone, or tablet. Facebook’s Geotargeting features were utilized to target individuals who live in El Paso and are over the age of 18. 2.6. Bias Mitigation The “prevent ballot stuffing” option via QuestionPro was utilized to prevent participants from completing the survey more than once. Additionally, the El Paso Vaccine Community Advisory Board (EPV-CAB) was developed to provide feedback on our surveys and recruitment approaches, ensuring that we included culturally and linguistically sensitive assessments. The EPV-CAB conducted quarterly meetings to ensure input from community stakeholders with diverse backgrounds, including a director from a local immunization clinic, a registered nurse, a licensed vocational nurse working at a local youth educational program, a community needs coordinator from the Texas Department State Health Services (DSHS) public health, and an operations manager from the El Paso Pediatric Association. 2.7. Approach to Analysis Descriptive statistics delineated participant characteristics. Means and standard deviations were examined for continuous variables, and percentages were examined for categorical variables. Percentages from a select-all-that-apply-style item were calculated and used as a preliminary index of trustworthy messengers to promote the HPV vaccine. Items on a Likert-type scale assessed the level of trust for each HPV vaccine messenger. Multiple imputation was not used for missing data given that less than 5% of the data was missing. Correlation analyses examined the association between individual and family beliefs about vaccines. A Bonferroni correction was applied to account for multiplicity in testing (α/10 = 0.005). Two hierarchical linear regression models examined predictors of HPV vaccine likelihood, which was a continuous variable. Moreover, two hierarchical logistic regression models examined predictors of ever vaccinating child with the HPV vaccine (Yes/No), which was a dichotomous variable. In each of the models, sociodemographic variables (age, primary language, household income, and gender identity) were entered in step 1, and all other variables were entered in step 2. Model 1: A hierarchical linear regression analysis was performed to predict HPV vaccine likelihood based on the top five trusted sources of information after controlling for age, primary language, household income, and gender identity. Model 2: Hierarchical logistic regression was performed to assess the impact of the top five trusted sources of information on ever vaccinating child with the HPV vaccine (Yes/No) after controlling for age, primary language, household income, and gender identity. Model 3: A hierarchical linear regression analysis was performed to predict HPV vaccine likelihood using five factors from the HBM (perceived safety, perceived effectiveness, perceived harm, perceived susceptibility, and perceived barriers) after controlling for age, primary language, household income, and gender identity. Model 4: Hierarchical logistic regression was performed to predict ever vaccinating child with the HPV vaccine (Yes/No), using factors from the HBM after controlling for age, primary language, household income, and gender identity. 3. Results Participant Characteristics A total of 203 Hispanic adults ( M age SD n n n n n n n n Table 2 The top five credible and trustworthy sources of HPV vaccine information (as indexed by the “select all that apply” items) were medical doctors (95.1%), registered nurses (54%), the Centers for Disease Control [and Prevention] (47.8%), the World Health Organization (45.3%), and pharmacists (25.6%). Religious leaders (3%) were reported to be the least trustworthy source of HPV vaccine information. See Table 3 M SD M SD M SD M SD M SD Correlations ranged from −0.27 to 0.73 (see Table 4 r p r p Table 4 Model 1 included a hierarchical linear regression analysis predicting HPV vaccine likelihood based on five trustworthy sources of information: medical doctors (MDs), registered nurses (RNs), the Centers for Disease Control and Prevention (CDC), the World Health Organization (WHO), and pharmacists. Sociodemographic variables including age, language, household income, and gender identity were included in step 1 of the model, and the five trustworthy sources of information were entered in step 2 of the model. Preliminary analyses were conducted to ensure no serious violations of the assumptions of normality, linearity, multicollinearity, and homoscedasticity. After controlling for sociodemographic variables, the results indicate that trust in RNs (beta = 0.35, t p t p F p R 2 R 2 Table 5 Model 2 included a hierarchical logistic regression assessing the impact of the five trusted sources of information on ever vaccinating child with the HPV vaccine (Yes/No). Sociodemographic variables including age, language, household income, and gender identity were included in step 1 of the model, and the five trustworthy sources of information were entered in step 2 of the model. The full model containing all predictors was statistically significant, Χ 2 n p Model 3 included a hierarchical linear regression analysis predicting HPV vaccine likelihood based on the five factors from the HBM. Sociodemographic variables were included in step 1 of the model, and the five factors from the HBM were entered in step 2 of the model. Preliminary analyses were conducted to ensure no serious violations of the assumptions of normality, linearity, multicollinearity, and homoscedasticity. After controlling for sociodemographic variables, the results indicate that perceived effectiveness (beta = 0.50, t p t p F p R 2 R 2 Table 6 Model 4 included a hierarchical logistic regression was performed to examine the impact of the HBM on ever vaccinating child with the HPV vaccine (Yes/No). Age, language, household income, and gender identity were included in step 1 of the model, and the five factors from the HBM were entered in step 2 of the model. The full model containing all predictors was statistically significant, Χ 2 n p p 4. Discussion The disparities in HPV vaccination and cervical cancer incidence and mortality among Hispanics underscore the critical importance of developing effective HPV vaccination programs and the need to tailor prevention strategies to populations at greatest risk. The current study highlights the critical role of credible and trusted sources of health information, such as MDs and other HCPs in promoting HPV vaccination. The degree of trust in vaccine information is closely related to the messenger delivering the information. In this study, the top five trusted sources of HPV vaccine information were MDs, RNs, the CDC, the WHO, and PharmDs. These findings align with a seminal review by Brewer and Fazekas (2007) which found that both parents and young adults were more likely to accept the HPV vaccine when it was recommended by a healthcare provider [ 30 31 Furthermore, the findings from this study suggest that religious leaders may not be effective messengers for promoting vaccine information among MAs, as they were identified as the least trusted source, with only 2.7% of participants reporting trust in them. Current research on the role of religious leaders in vaccine promotion has yielded mixed results. For example, Hicken et al. (2024) found that in areas where medical professionals already endorsed vaccines, religious leaders’ support influenced vaccine uptake in only one out of six countries studied, highlighting that medical practitioners remain the most effective advocates for vaccination [ 32 33 34 35 Another important finding that emerged is that individual vaccine beliefs were strongly associated with family vaccine beliefs. For example, the belief that vaccines cause autism was strongly correlated with one’s family’s belief that vaccines cause autism. Similar results are reported by Frietze et al. (2023a) using the same assessment tool [ 17 Finally, factors from the HBM emerged as predictors of likelihood to accept the HPV vaccine and for parents having ever vaccinated their child. In a literature review among studies that pertained to African American and Latino parents, Galbraith et al. (2016) found that vaccine safety, effectiveness, and provider recommendations were positively associated with uptake and acceptability [ 36 37 This study has several strengths, including the unique population of Hispanic parents recruited from non-clinic settings who may not have access to routine care. Our focus on Hispanic parents allows for understanding factors that may be specific to this population and that influence who individuals trust for vaccine information. Another strength is that we evaluated levels of trust associated with a large number of sources of information ranging from HCPs to religious leaders, yielding insight into who individuals trust the most for vaccine information. Finally, an additional strength that emerged is the inclusion of the HBM to guide our understanding of the factors that contribute to vaccine intentions. Despite the strengths of this study, a number of limitations exist. Although focusing on a Hispanic population provides important findings about who individuals trust for vaccine information, these findings may not be generalizable to other ethnic groups. Additionally, this study was conducted online and utilized online recruitment strategies, which may have contributed to issues accessing the survey. Another limitation of the study is that it utilized a cross-sectional design which cannot establish causal relationships. Future studies should utilize an experimental design to identify whether trusted sources of information truly cause differences in vaccine acceptance. 5. Conclusions This study underscores the importance of trusted messengers in shaping HPV vaccine acceptance among Hispanic parents. Consistent with our hypothesis, medical doctors and registered nurses emerged as the most credible sources of HPV vaccine information, alongside institutional authorities such as the CDC and WHO. Importantly, pharmacists also surfaced as underutilized yet trusted sources, highlighting an opportunity to expand their role in vaccine promotion, especially in medically underserved communities with limited access to physicians. Conversely, religious and political figures were identified as the least trusted messengers, suggesting that public health interventions relying on these voices are unlikely to be effective within this population. Beyond identifying trusted sources, our findings demonstrate that parental vaccine acceptance is influenced by both individual and family beliefs, with misconceptions such as the belief that vaccines cause autism. This reinforces the need for culturally sensitive, family-centered approaches that address intergenerational attitudes and misinformation. Guided by the HBM, we found that perceived effectiveness and perceived harm were key predictors of vaccine likelihood, underscoring the relevance of theoretical frameworks in understanding and addressing parental decision making. These results have several clinical and public health implications. Interventions aimed at increasing HPV vaccination rates in Hispanic communities should (1) prioritize HCPs, pharmacists, and public health authorities as frontline messengers, (2) integrate family-level education to counteract misinformation and strengthen collective acceptance of vaccines, and (3) employ theoretical models such as the HBM to design and evaluate communication strategies. Furthermore, future research should explore experimental designs to establish causal relationships and further refine intervention strategies. By leveraging trusted voices and addressing culturally rooted beliefs, public health interventions can advance HPV vaccination uptake and reduce HPV-associated cancer disparities among Hispanic populations. Acknowledgments We thank the Health Communication and Risk Perception (HCRP) laboratory at the University of Texas at El Paso, School of Pharmacy, for their support and assistance with the project. We would also like to declare that portions of the abstract from this manuscript was published as part of a poster presentation and are available in the proceedings of the 16th AACR Conference on the Science of Cancer Health Disparities in Racial/Ethnic Minorities and the Medically Underserved, available online at https://aacrjournals.org/cebp/article/32/12_Supplement/A043/730975/Abstract-A043-Trusted-sources-of-human Disclaimer/Publisher’s Note: Supplementary Materials The following supporting information can be downloaded at: https://www.mdpi.com/article/10.3390/vaccines13090917/s1 Author Contributions Conceptualization, A.A.M., S.S.S. and G.A.F.; methodology, A.A.M., S.S.S. and G.A.F.; software, A.A.M. and G.A.F.; validation, A.A.M., S.S.S. and G.A.F.; formal analysis, A.A.M. and G.A.F.; investigation, A.A.M., S.S.S. and G.A.F.; resources, A.A.M., S.S.S. and G.A.F.; data curation, A.A.M. and G.A.F.; writing—original draft preparation, A.A.M., S.S.S. and G.A.F.; writing—review and editing, A.A.M., S.S.S. and G.A.F.; visualization, A.A.M. and G.A.F.; supervision, S.S.S. and G.A.F.; project administration, A.A.M. and G.A.F.; funding acquisition, G.A.F. All authors have read and agreed to the published version of the manuscript. Institutional Review Board Statement This study was conducted in accordance with the Declaration of Helsinki and approved by the Institutional Review Board of the University of Texas at El Paso (UTEP) (Protocol Code: 1867231-3, Approval Date: 19 October 2022). Informed Consent Statement Informed consent was obtained from all subjects in the study. Data Availability Statement The dataset supporting the conclusions of this article is available at Mendeley repository. Conflicts of Interest The authors declare no conflicts of interest. Abbreviations The following abbreviations are used in this manuscript: HPV Human papillomavirus MD Medical doctor RN Registered nurse CDC Centers for Disease Control WHO World Health Organization PharmD Pharmacist References 1. National Cancer Institute Causes, Risk Factors, and Prevention 2023 Available online: https://www.cancer.gov/types/cervical/causes-risk-prevention (accessed on 3 May 2024) 2. Centers for Disease Control and Prevention Cancers Linked with HPV each Year. CDC Available online: https://www.cdc.gov/cancer/hpv/cases.html (accessed on 11 June 2025) 3. World Health Organization Cervical Cancer [Fact Sheet]. WHO Available online: https://www.who.int/news-room/fact-sheets/detail/cervical-cancer (accessed on 5 March 2024) 4. U.S. Department of Health and Human Services, Office of Minority Health Cancer and Hispanic Americans Available online: https://minorityhealth.hhs.gov/cancer-and-hispanic-americans (accessed on 13 February 2025) 5. Centers for Disease Control and Prevention Cancer and Hispanic or Latino People Available online: https://www.cdc.gov/cancer/health-equity/hispanic-latino.html (accessed on 13 February 2025) 6. American Cancer Society Risk Factors for Cervical Cancer 2023 Available online: https://www.cancer.org/cancer/types/cervical-cancer/causes-risks-prevention/risk-factors.html (accessed on 11 June 2025) 7. U.S. Food and Drug Administration Gardasil 9 2025 Available online: https://www.fda.gov/vaccines-blood-biologics/vaccines/gardasil-9 (accessed on 11 June 2025) 8. Centers for Disease Control and Prevention HPV Vaccine Information for Young Women and Men Available online: https://www.cdc.gov/hpv/vaccines/index.html (accessed on 6 November 2023) 9. World Health Organization Immunization Coverage [Fact Sheet]. WHO Available online: https://www.who.int/news-room/fact-sheets/detail/immunization-coverage (accessed on 15 July 2025) 10. Kamolratanakul S. Pitisuttithum P. Human Papillomavirus Vaccine Efficacy and Effectiveness against Cancer Vaccines 2021 9 1413 10.3390/vaccines9121413 34960159 PMC8706722 11. Saxena K. Marden J.R. Carias C. Bhatti A. Patterson-Lomba O. Gomez-Lievano A. Yao L. Chen Y.T. Impact of the COVID-19 pandemic on adolescent vaccinations: Projected time to reverse deficits in routine adolescent vaccination in the United States Curr. Med. Res. Opin. 2021 37 2077 2087 10.1080/03007995.2021.1981842 34538163 12. Nguyen P. Calderon-Mora J. Singh V. Hernandez A. Roy S. Molokwu J. Impact of the COVID-19 pandemic on HPV vaccine uptake in a predominantly Hispanic Border Community: A retrospective cross-sectional analysis of the “Tiempo de Vacunarte Program” Arch. Public Health 2024 82 96 10.1186/s13690-024-01318-0 38915042 PMC11194890 13. Centers for Disease Control and Prevention Products—Data Briefs—Number 495—February 2024. Centers for Disease Control and Prevention Available online: https://www.cdc.gov/nchs/products/databriefs/db495.htm (accessed on 14 February 2024) 14. Hernandez A. Calderón-Mora J. Lara H. Drury N. Molokwu J. Barriers to HPV vaccine series completion among a predominantly hispanic border population: A mixed method evaluation Arch. Public Health 2024 82 112 10.1186/s13690-024-01344-y 39049107 PMC11267782 15. Cangelosi G. Sacchini F. Mancin S. Petrelli F. Amendola A. Fappani C. Sguanci M. Morales Palomares S. Gravante F. Caggianelli G. Papillomavirus Vaccination Programs and Knowledge Gaps as Barriers to Implementation: A Systematic Review Vaccines 2025 13 460 10.3390/vaccines13050460 40432072 PMC12116001 16. Yanez B. McGinty H.L. Buitrago D. Ramirez A.G. Penedo F.J. Cancer outcomes in Hispanics/Latinos in the United States: An integrative review and conceptual model of determinants of health J. Lat. Psychol. 2016 4 114 10.1037/lat0000055 27429867 PMC4943845 17. Frietze G. Padilla M. Cordero J. Gosselink K. Moya E. Human Papillomavirus Vaccine Acceptance (HPV-VA) and Vaccine Uptake (HPV-VU): Assessing the impact of theory, culture, and trusted sources of information in a Hispanic community BMC Public Health 2023 23 1781 10.1186/s12889-023-16628-1 37710232 PMC10500881 18. Olson O. Berry C. Kumar N. Addressing parental vaccine hesitancy towards childhood vaccines in the United States: A systematic literature review of communication interventions and strategies Vaccines 2020 8 590 10.3390/vaccines8040590 33049956 PMC7712553 19. Oh N.L. Biddell C.B. Rhodes B.E. Brewer N.T. Provider communication and HPV vaccine uptake: A meta-analysis and systematic review Prev. Med. 2021 148 106554 10.1016/j.ypmed.2021.106554 33857561 20. Rosenstock I.M. The health belief model and preventive health behavior Health Educ. Monogr. 1974 2 354 386 10.1177/109019817400200405 21. Frietze G.A. Mancera B.M. Kenney M.J. COVID-19 Testing, Vaccine Perceptions, and Trust among Hispanics Residing in an Underserved Community Int. J. Environ. Res. Public Health 2023 20 5076 10.3390/ijerph20065076 36981984 PMC10049437 22. Padilla M.E. Frietze G.A. Aguirre M. Loya A.M. Jallad S. Romero E. Cruz N. Understanding influenza immunization uptake rates among the Hispanic LGBTQIA community J. Am. Pharm. Assoc. 2019 59 560 564 10.1016/j.japh.2019.02.007 30979574 23. Faul F. Erdfelder E. Lang A.-G. Buchner A. G*Power 3: A flexible statistical power analysis program for the social, behavioral, and biomedical sciences Behav. Res. Methods 2007 39 175 191 10.3758/BF03193146 17695343 24. Newman P.A. Logie C.H. Doukas N. Asakura K. HPV vaccine acceptability among men: A systematic review and meta-analysis Sex. Transm. Infect. 2013 89 568 574 10.1136/sextrans-2012-050980 23828943 PMC3812849 25. Katz M.L. Krieger J.L. Roberto A.J. Human papillomavirus (HPV): College male’s knowledge, perceived risk, sources of information, vaccine barriers and communication J. Men’s Health 2011 8 175 184 10.1016/j.jomh.2011.04.002 21966351 PMC3181096 26. Brabin L. Roberts S.A. Farzaneh F. Kitchener H.C. Future acceptance of adolescent human papillomavirus vaccination: A survey of parental attitudes Vaccine 2006 24 3087 3094 10.1016/j.vaccine.2006.01.048 16500736 27. McRee A.L. Brewer N.T. Reiter P.L. Gottlieb S.L. Smith J.S. The Carolina HPV immunization attitudes and beliefs scale (CHIAS): Scale development and associations with intentions to vaccinate Sex. Transm. Dis. 2010 37 234 239 10.1097/OLQ.0b013e3181c37e15 19940807 28. Dempsey A.F. Fuhrel-Forbis A. Konrath S. Use of the Carolina HPV Immunization Attitudes and Beliefs Scale (CHIAS) in young adult women PLoS ONE 2014 9 e100193 10.1371/journal.pone.0100193 24945630 PMC4063751 29. Frietze G. Oliva R. Shenberger-Trujillo J.M. Human Papillomavirus (HPV) Vaccine Acceptability in Hispanic Males Living on the U.S./Mexico Border Hisp. Health Care Int. 2020 19 55 62 10.1177/1540415320921479 32410518 30. Brewer N.T. Fazekas K.I. Predictors of HPV vaccine acceptability: A theory-informed, systematic review Prev. Med. 2007 45 107 114 10.1016/j.ypmed.2007.05.013 17628649 31. Lucero D. Moreno V.A. Delgado D. Nieto A.H. Rodriguez-Cruz N. Le Q. Lindsay A.C. Understanding HPV Vaccine Initiation and Intention Among Central American Immigrant Parents in the United States: The Role of Vaccine Literacy and Healthcare Provider Recommendations Vaccines 2025 13 130 10.3390/vaccines13020130 40006677 PMC11860528 32. Hicken A. Jones P. Menon A. Rozek L.S. Can endorsement by religious leaders move the needle on vaccine hesitancy? Vaccine 2024 42 918 923 10.1016/j.vaccine.2024.01.009 38242735 33. Purvis R.S. Hallgren E. Moore R.A. Willis D.E. Hall S. Gurel-Headley M. McElfish P.A. Trusted Sources of COVID-19 Vaccine Information among Hesitant Adopters in the United States Vaccines 2021 9 1418 10.3390/vaccines9121418 34960164 PMC8706404 34. Seyd B. Hamm J.A. Jennings W. McKay L. Anness M. Trust the messenger: Public trust in sources of information on COVID-19 Parliam. Aff. 2025 78 257 278 10.1093/pa/gsae029 35. Chu J. Pink S.L. Willer R. Religious identity cues increase vaccination intentions and trust in medical experts among American Christians Proc. Natl. Acad. Sci. USA 2021 118 e2106481118 10.1073/pnas.2106481118 34795017 PMC8670469 36. Galbraith K.V. Lechuga J. Jenerette C.M. Moore L.A. Palmer M.H. Hamilton J.B. Parental acceptance and uptake of the HPV vaccine among African-Americans and Latinos in the United States: A literature review Soc. Sci. Med. 2016 159 116 126 10.1016/j.socscimed.2016.04.028 27180256 37. Zampetakis L.A. Melas C. The health belief model predicts vaccination intentions against COVID-19: A survey experiment approach Appl. Psychol. Health Well-Being 2021 13 469 484 10.1111/aphw.12262 33634930 PMC8014148 vaccines-13-00917-t001_Table 1 Table 1 Assessment tools. Variable Name Description Sample Item(s) Basic Demographics Survey Fifteen items assessing basic demographics such as age, gender, ethnicity, primary language spoken at home (English or Spanish) and related information (see Supplementary Materials “What is your age in years?” Background Questionnaire Twenty-three items assessing parental status, who has provided vaccine recommendations, household size (as a proxy of multigenerational households), and items related to vaccinating one’s own children (see Supplementary Materials “Who has provided you with recommendations or guidance about whether YOUR CHILD should receive the HPV vaccine?” (Select all the apply). Independent Variables   Trustworthy HPV Informational Sources A 13-item questionnaire adapted from Frietze et al. (2023b) assessed trustworthy HPV informational sources [ 21 Supplementary Materials “I would trust information about the HPV vaccine if the information was provided from a Medical Doctor (MD).” Perceived Severity A single item adapted from Katz et al. (2011) assessed perceived severity of HPV [ 25 “How severe do you think genital HPV infection is for yourself?” Perceived Safety Three items adapted from Brabin et al. (2006) assessed perceived safety of the HPV vaccine [ 26 “I worry about the short-term side effects of the HPV vaccine.” “I worry that the HPV vaccine might negatively affect my body.” “I worry that the HPV vaccine might have unknown long-term side effects.” Response options range from (1) Strongly disagree, to (5) Strongly agree. Response options were reverse-coded for all three questions so that higher scores indicate greater perceived safety of the HPV vaccine. A composite score was created by averaging the three items. Perceived Effectiveness Three items adapted from Brabin et al. (2006) assessed perceived effectiveness of the HPV vaccine [ 26 “I believe the HPV vaccine is effective in preventing genital HPV (e.g., vaginal, penile, or anal).” “I believe the HPV vaccine works in preventing genital HPV (e.g., vaginal, penile, or anal).” “I believe if I get the HPV vaccine, I will be less likely to get genital HPV (e.g., vaginal, penile, or anal).” Response options range from (1) Strongly disagree, to (5) Strongly agree. Higher scores indicate greater perceived effectiveness of the HPV vaccine. Perceived Harm Three items representing a subscale of the validated Carolina HPV Immunization Attitudes and Beliefs Scale (CHIAS) assessed perceived harm [ 27 “I think the HPV vaccine may cause health problems in the future.” “I think the HPV vaccine is unsafe.” “I think the HPV vaccine might cause short-term problems like fever or discomfort.” Response options range from (1) Strongly disagree, to (5) Strongly agree. A composite score was created by averaging the three items. Previous studies have demonstrated high re-test reliability estimates (0.73–0.80) [ 27 28 Attention A single item served as an attention check. Failure to respond correctly to this item results in the exclusion of the subject’s data from analysis. “If you are paying attention, please select “Blue” for the following response.” Individual and Family Beliefs about Vaccines Ten items from Frietze et al. (2020) assessed individual and family beliefs about vaccines [ 29 “My family believes vaccines cause Autism”. Response options range from (1) Strongly disagree, to (5) Strongly agree. Pandemic Barriers Towards Child Healthcare Three items developed by the research team assessed barriers towards getting the HPV vaccine (see Supplementary Materials “The ongoing COVID-19 pandemic has been a barrier towards vaccinating my child”, “The ongoing COVID-19 pandemic has prevented me from taking my child to their pediatrician for their wellness check-ups”, “I have reduced the amount of times that a take my child to their pediatrician due to the COVID-19 pandemic.” Response options range from (1) Strongly disagree, to (5) Strongly agree. A composite score was created by averaging the three items. Dependent Variables   Ever vaccinated child with the HPV vaccine (Yes/No) A single item adapted from Frietze et al. (2023a) assessed if parents have ever vaccinated their children with the HPV vaccine [ 17 “Have any of your children received the Human Papillomavirus (HPV) vaccine?” HPV Vaccine Likelihood (Self) A single item developed by the research team assessed participants likelihood to get vaccinated with the HPV vaccine if eligible. “How likely are you to get vaccinated with the HPV vaccine if you are eligible?” vaccines-13-00917-t002_Table 2 Table 2 Demographic and background information ( N Variable Total Responses Percentage of Responses Ethnicity   Hispanic 203 100% Primary Language   English 111 54.7% Spanish 86 42.4% Other 1 0.5% Missing 5 2.5% Language that survey was completed in   English 152 74.9% Spanish 51 25.1% Household income   Less than USD 5000 5 2.5% USD 5001–USD 20,000 20 9.9% USD 20,001–USD 40,000 55 27.1% USD 40,001–USD 60,000 47 23.2% USD 60,001–USD 80,000 34 16.7% USD 80,001–USD 100,000 21 10.3% USD 100,001 or more 17 8.4% Do not know 2 1% Prefer not to answer 2 1% How many children do you have?   1 47 23.2% 2 75 36.9% 3 44 21.7% 4 21 10.3% 5 9 4.4% More than 5 4 2% Missing 3 1.5% Have any of your children ever received   Yes 138 68% No 54 26.6% Prefer not to answer 2 1% Unsure 7 3.4% Missing 2 1% vaccines-13-00917-t003_Table 3 Table 3 Trusted sources of HPV information ( N If You Were Receiving Information About HPV and the  n Percentage Medical doctor (MD) 193 95.1% Registered nurse (RN) 110 54.2% Centers for Disease Control and Prevention 97 47.8% World Health Organization (WHO) 92 45.3% Pharmacist (PharmD) 52 25.6% Dr. Anthony Fauci, Chief Medical Advisor of the 55 27.1% School nurse 47 23.2% Community health worker or promotor(a) de salud 41 20.2% Family/friends 21 10.3% Community leader from El Paso (e.g., Mayor Oscar 17 8.4% The President of the United States 16 7.9% Religious leader (e.g., a priest, pastor, or other) 6 3% Note: Item is a “select all that apply” response; response options do not total to 100%. vaccines-13-00917-t004_Table 4 Table 4 Individual and family beliefs about vaccines.  1 2 3 4 5 6 7 8 9 10  1. I had negative feelings about vaccines while I was growing up. - - - - - - - - - -  2. I believe vaccines can cause serious illness. 0.65 ** - - - - - - - - -  3. I believe vaccines are safe and effective. −0.35 ** −0.46 ** - - - - - - - -  4. I believe everyone should be immunized against serious diseases. −0.41 ** −0.49 ** 0.52 ** - - - - - - -  5. I believe vaccines cause autism. 0.37 ** 0.44 ** −0.42 ** −0.35 ** - - - - - -  6. My family had negative feelings about vaccines while I was growing up. 0.60 ** 0.46 ** −0.33 ** −0.38 ** 0.30 ** - - - - -  7. My family believes vaccines can cause serious illness. 0.49 ** 0.55 ** −0.41 ** −0.45 ** 0.44 ** 0.73 ** - - - -  8. My family believes vaccines are safe and effective. −0.34 ** −0.42 ** 0.43 ** 0.47 ** −0.27 ** −0.52 ** −0.57 ** - - -  9. My family believes everyone should be immunized against serious diseases. −0.46 ** −0.55 ** 0.47 ** 0.60 ** −0.34 ** −0.59 ** −0.63 ** 0.68 ** - -  10. My family believes vaccines cause autism 0.37 ** 0.43 ** −0.36 ** −0.46 ** 0.58 ** 0.45 ** 0.55 ** −0.44 ** −0.50 ** - Mean (SD) 2.05 (1.03) 2.23 (1.10) 4.19 (0.89) 4.26 (0.81) 2.02 (1.00) 1.89 (1.00) 2.05 (1.06) 4.01 (0.99) 4.11 (0.42) 2.06 (1.01)  n 201 201 202 202 202 202 202 202 202 202 Note: Correlations are reported using Pearson’s correlation coefficient (two-tailed). ** p vaccines-13-00917-t005_Table 5 Table 5 Hierarchical linear regression predicting HPV vaccine likelihood ( n Variables  B  SE B β 95% Confidence Intervals  p Lower Upper Step 1       Constant 3.634 0.740  2.173 5.096 <0.001 Age −0.002 0.014 −0.009 −0.029 0.025 0.909 Primary Language −0.009 0.185 −0.004 −0.373 0.356 0.963 Household Income −0.110 0.057 −0.145 −0.224 −0.003 0.056 Gender Identity 0.387 0.250 0.117 −0.107 0.881 0.124 Step 2       Constant 0.765 0.771  0.757 2.286 0.323 Age −0.001 0.012 −0.005 −0.026 0.024 0.936 Primary Language −0.071 0.167 −0.007 −0.348 0.313 0.917 Household Income −0.118 0.051 −0.155 −0.219 −0.018 0.022 Gender Identity 0.278 0.224 0.084 −0.164 0.720 0.217 Medical Doctors (MDs) 0.014 0.075 0.015 −0.135 0.163 0.853 Registered Nurses (RNs) 0.346 0.103 0.299 0.143 0.550 <0.001 Centers for Disease and Control (CDC) 0.279 0.124 0.220 0.033 0.524 0.026 World Health Organization (WHO) 0.157 0.125 0.124 −0.089 0.403 0.210 Pharmacists −0.015 0.096 −0.013 −0.204 0.175 0.878 Note: Higher scores for the dependent variable indicate higher likelihood to vaccinate self if eligible and not already vaccinated on a 5-point scale. Sample size is less than 203 due to missing data. R 2 R 2 Adjusted vaccines-13-00917-t006_Table 6 Table 6 Hierarchical linear regression predicting HPV vaccine likelihood from HBM ( n Variables  B  SE B β 95% Confidence Intervals  p Lower Upper Step 1       Constant 3.770 0.747  2.295 5.244 <0.001 Age −0.004 0.014 −0.022 −0.031 0.023 0.772 Primary Language −0.027 0.185 −0.011 −0.392 0.337 0.882 Household Income −0.109 0.057 −0.144 −0.222 −0.004 0.059 Gender Identity 0.382 0.254 0.144 −0.118 0.883 0.133 Step 2       Constant 2.273 1.155  0.008 4.554 0.051 Age −0.014 0.012 −0.077 −0.037 0.009 0.233 Primary Language 0.000 0.164 −0.000 −0.325 0.324 0.999 Household Income −0.071 0.049 −0.094 −0.168 0.025 0.144 Gender Identity 0.194 0.222 0.058 −0.244 0.632 0.383 Perceived safety 0.191 0.098 0.163 0.003 0.384 0.053 Perceived effectiveness 0.500 0.130 0.294 0.244 0.756 <0.001 Perceived harm −0.300 0.136 −0.198 −0.568 −0.032 0.029 Perceived severity 0.087 0.063 0.091 −0.037 0.210 0.170 Perceived barriers 0.013 0.085 0.011 −0.155 0.182 0.876 Note: Sample size is less than 203 due to missing data. R 2 R 2 Adjusted ",
  "metadata": {
    "Title of this paper": "The health belief model predicts vaccination intentions against COVID-19: A survey experiment approach",
    "Journal it was published in:": "Vaccines",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12474148/"
  }
}