{
  "title": "Paper_1136",
  "abstract": "pmc Am J Health Promot Am J Health Promot 464 sageopen AHP American Journal of Health Promotion 0890-1171 2168-6602 pmc-is-collection-domain yes pmc-collection-title Sage Choice PMC12476475 PMC12476475.1 12476475 12476475 40424540 10.1177/08901171251346607 10.1177_08901171251346607 1 Qualitative Research Lung Cancer Prevention Among Appalachian Kentucky Women: A Community-Engaged Mixed Method Study https://orcid.org/0000-0002-6954-2663 Thompson Jessica R. PhD 1 2 Schoenberg Nancy E. PhD 3 Hull Pamela C. PhD 2 3 1 8082 The Pennsylvania State University 2 4530 University of Kentucky 3 4530 University of Kentucky Jessica R. Thompson, PhD, Health Policy and Administration, Penn State University, 601E Ford Building, University Park, PA 16802, USA. Email: jrthompson@psu.edu 27 5 2025 11 2025 39 8 497721 1164 1174 4 12 2024 4 4 2025 15 5 2025 28 09 2025 29 09 2025 29 09 2025 © The Author(s) 2025 2025 SAGE Publications https://creativecommons.org/licenses/by/4.0/ This article is distributed under the terms of the Creative Commons Attribution 4.0 License ( https://creativecommons.org/licenses/by/4.0/ https://us.sagepub.com/en-us/nam/open-access-at-sage Purpose Appalachian Kentucky (KY) residents experience the highest lung cancer rates in the US with declines lagging among women; we sought to uncover barriers and facilitators to lung cancer prevention for Appalachian KY women and to identify community-specific interventions. Approach We utilized concept mapping, a participatory mixed method, to generate consensus on perceived barriers and facilitators. Setting/Participants We recruited 71 adult women from Appalachian KY counties. Method After collecting online concept mapping data, we used multidimensional scaling to generate a point map of perceived similarities and hierarchical cluster analysis to create a thematic cluster map. We compared average cluster ratings across importance and feasibility. During focus group discussions, we shared concept maps to gather insights on intervention areas. Results Participants listed 70 barriers and facilitators in 8 thematic clusters, including community-level, healthcare, and tobacco-related factors. Participants identified three intervention areas: 1) educational campaigns, including efforts directed toward youth, mothers, and those eligible for lung cancer screening; 2) policy, such as smoke-free laws, inclusion of vaping in existing policies, and advertisement bans; and 3) improving access to lung cancer screening. Conclusion Our findings support multilevel interventions for lung cancer prevention, including improving awareness, local policy, and screening access for Appalachian KY women. This research contributes novel understanding of local and gender-specific barriers and informs future Appalachian lung cancer prevention studies. participatory mixed methods community-engaged research Appalachian region lung cancer prevention women’s health Department of Behavioral Science, College of Medicine, University of Kentucky National Cancer Institute https://doi.org/10.13039/100000054 K99/R00CA277245 pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement yes pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes typesetter ts10 Lung cancer is the leading cause of cancer-related death for women in the US, including the Appalachian region.  1  1  2  1  3  4 Lung cancer risk among Appalachian women extends beyond the individual level and requires solutions that address social and community contexts. Known lung cancer risk factors fall across social-ecological levels. At an individual level, in addition to the behavioral risk factor of tobacco use, studies show women are more likely than men to develop non-small cell lung cancer, most commonly found in non-smokers 5 6  7 8 9  10 11 15  3  16 17 18 The socioeconomic inequities women in Appalachia experience support the need for risk reduction and prevention solutions capable of addressing multilevel factors. Overall, women experience higher poverty rates in the US than men.  19 3 20 21  22  23 Purpose Despite the high prevalence of lung cancer mortality among women in the Appalachian region, we currently lack published research on lung cancer primary or secondary prevention in this population.  24  25 Methods Design We utilized an observational design with concept mapping methodology. As a community-engaged research method, concept mapping has been applied across a variety of health topics, 25 26 27 29  30  26  30 Step 2 Step 3 Step 5 Sample From September to December 2022, we recruited 71 Appalachian Kentucky (KY) women to participate in concept mapping activities. Due to our interest in both primary and secondary prevention, individuals had to be adults (18+), identify as women, and have lived in one of the 54 Appalachian KY counties for at least 2 years to be eligible to participate. We recruited participants through: 1) existing lists of previous research participants interested in additional studies maintained by the study team; 2) ResearchMatch, a national electronic database and web-based recruitment tool  31  32  33 Measures All online concept mapping activities for this project were conducted using the Groupwisdom platform developed by Concept Systems Inc.  34  35 Step 1 36 37 In the brainstorming activity ( Step 2 What are all the factors (good or bad) that affect the lung health of women in your community Supplemental Table 1 Step 3 how important is this item for behaviors to keep your lungs healthy how feasible would it be to address this item for women in your community  30 Analysis With the data resulting from the sorting and rating activities, we generated various conceptual maps and rating comparisons ( Step 4  30  30 We then brought these maps and rating comparisons to participants, with the goal of soliciting their interpretation ( Step 5 Results Participant Characteristics Participants in this study (N = 71) had an average age of 48.5 years old. Approximately 28.1% of participants had less than a college education. Participants had diverse health insurance coverage, including over 50% with a public health insurance plan. Three-quarters of our sample identified as non-Hispanic white, which is slightly more diverse than the Appalachian KY region. Notably, we spoke to women in 34 of the 54 Appalachian counties in the state. Table 1 Table 1. Demographics for the Concept Mapping Participants (N = 71). Variable Mean (SD) freq. (%) Age 48.5 (15.8) Educational attainment Completed high school or GED 5 (7.0) Some college or vocational school 15 (21.1) Bachelor’s degree or higher 51 (71.8) Insurance type  a Employer, military, or private 35 (47.3) Medicaid 9 (12.2) Medicare 28 (37.8) Kentucky health insurance marketplace 2 (2.7) Race/ethnicity  a Black or African American 13 (17.1) White 57 (75.0) Hispanic, Latin American, or Spanish origin 4 (5.2) American Indian or Alaska native 2 (2.6) a Cluster Maps and Names The sorting and rating data from the concept mapping activities resulted in an 8-cluster solution. A list of all the items sorted by cluster is available in Table 2 Figure 1 Table 2. List of Final of Concept Mapping Brainstormed Items Sorted by Cluster. Cluster # Item 1. Community programs & resources 1 School programs about lung issues and the negatives of smoking 2 Availability of healthy and affordable foods 9 Education on lung health and the side effects of smoking 30 Education/programs on the importance of lung cancer screening 51 Exposure to good health practices/behaviors 63 Maintaining lung health as a top priority by those in power 66 Access to exercise facilities (e.g., walking tracks, gyms, local parks, etc.) 2. Availability & access to healthcare 5 Local health facilities with lung screening and treatment options 16 Free healthcare and screening to detect lung health issues early 19 Use of prescription inhalers and medicines to improve lung health 25 Ability to get screened at a younger age 32 Access to transportation to doctor’s appointments 34 Distance to treatment facilities 45 Cost of lung care/treatment services 47 Quality of available healthcare 49 Having a primary care doctor 52 Availability of healthcare providers 54 Medical facilities for the healthcare of women 69 Training for health care workers on screening and detecting lung cancer 3. Barriers to seeking healthcare 3 Fear they won’t be able to afford doctor appointments or treatment 4 Not attending to their own health to take care of children or partners 17 Getting/staying healthy is too expensive 26 Fear to go to the doctor because of what the diagnosis may be 41 Not going to the doctor until the symptoms are severe 62 Low household income 65 Untreated medical conditions 4. Health conditions & genetics 38 High asthma rates 40 Obesity 46 Health conditions that can make lung problems worse 61 Genetics 5. Community influences & social norms 6 Stress women experience in their lives 8 Attitude of “it is what it is” when it comes to health 12 Alcohol use/excess drinking 21 Not caring what others think/social pressures about quitting smoking 22 Use of smoking among people in recovery/treatment from drug abuse and alcoholism 5. Community influences & social norms cont 23 Acceptance and normalization of smoking 33 Peer pressure 50 Substance use 56 Growing up watching others, including women, in the family smoke 64 Smoking as a way to socialize 6. Smoking & tobacco use 10 Availability of tobacco, vaping, and nicotine products 11 People smoking at a young age 14 High smoking rates 20 Side effects of smoking 36 Allowing smoking in public spaces 37 Effects of overdose drugs (e.g., naloxone) 39 Growing up around second-hand smoke 42 Acceptance of vaping, including indoors 44 Second-hand smoke in the community 53 High vaping rates 55 Advertisements aimed at young people 67 Co-use of smoking with other drugs and alcohol 70 Mothers smoking while pregnant 7. Physical environment 7 Fresh air 13 Older homes and structures with expensive upkeep 15 County smoke-free policies for not smoking in buildings 35 Availability of safe drinking water 68 Large and established forests 8. Environmental concerns & pollution 18 Air fresheners 24 Climate conditions 27 Chemicals/pesticides being used in local communities 28 Working in places that could be risky to lung health 29 Pollution from vehicles (e.g., cars, diesel trucks, farm machinery) 31 Environmental toxins in the home like plastics and radon gas 43 Asbestos in houses and other buildings 48 Run-off from coal mines 57 Pollution from manufacturing companies, plants, or factories 58 Pollen in allergy seasons (spring and fall) 59 Open burns of vegetation and garbage 60 Miners coming home covered in coal dust Figure 1. Combined Point and Cluster Maps From Sorting and Rating Data With Participant Developed Cluster Names. Cluster Ratings Figure 2 Figure 3 Figure 2. Comparison of Average Cluster Ratings Across Rating Scales (Importance and Feasibility). Figure 3. Go-Zone Plot for Top Rated Clusters (1, 2, 3, 6, and 7) With Items in Each Zone. Focus Areas Community-Level Factors Items commonly raised by participants at the community-level focused on policy and educational factors. For example, all three groups pointed out the importance of items 15 (County smoke-free policies for not smoking in buildings) 1 (School programs about lung issues and the negatives of smoking) 63 (Maintaining lung health as a top priority by those in power) 30 (Education/programs on the importance of lung cancer screening) I think the smoke-free policies. I don’t know which counties have them. Sometimes when I’m travelling, I’m still shocked to see it [people smoking] when I’m in a restaurant or things like that. Because in the communities I’m in, that’s not allowed. So, I think focusing on those places where there’s still smoking allowed in county and city buildings, outside the doors of the hospitals, things like that are really important. Participants further discussed how the implementation and continued enforcement of these policies requires the support and influence of those in power, many of whom see local politicians as putting “their efforts into things that are so stupid that just don’t amount to a hill of beans compared to death or living conditions or bad water issues - those should be priority things.” Discussions of education tended to focus on reaching younger individuals, women during pregnancy, and those eligible for lung cancer screening. Participants described a general lack of awareness in areas such as vaping risks and the lung cancer screening process. A participant stated: “There’s so many people, women especially, in my immediate social group that’s their defense [for why they vape]: ‘You don’t know there’s something wrong with this.’” Healthcare Factors Within the healthcare area, only one item consistently rose to the top of the discussions: 41 (Not going to the doctor until the symptoms are severe) If I know too much, I have all of these things going through my mind, and it scares me. And, do I really want to know the answer? Even though you really need to go to the doctor, you’re scared of what you might find. And that may be a reason why some women might not go and get the care that they need. Sometimes it just comes down to, I’ve got to bite this bullet and go get this checked out. I think that’s what it is… the symptoms outweigh the fear, but it can truly be too late then. Additionally, practical considerations also played a key role in deciding to seek healthcare. For example, participants in various groups raised items 5 (Local health facilities with lung screening and treatment options) 34 (Distance to treatment facilities) 16 (Free healthcare and screening to detect lung health issues early) 16 (Training for health care workers on screening and detecting lung cancer) Tobacco Use Factors Participants across groups commonly discussed generational variation in both the exposure and use of differing tobacco and nicotine products. All groups raised the importance of items 53 (High vaping rates) 42 (Acceptance of vaping, including indoors) 11 (People smoking at a young age) 55 (Advertisements aimed at young people) Smoking is promoted in a lot of places. If you go to the gas station, there’s a lot of signs that say buy cigarettes, buy vape, buy this, cheap price… instead, you know, put anti-smoking campaign ads up, these are your lungs when you smoke, and this is how it affects the children in your car, instead of promoting it the way it is now. Likewise, participants frequently mentioned that pregnancy is an ideal time for intervention, such as item 70 (Mothers smoking while pregnant) The two groups I would focus on are the mothers and the teenagers, and I suppose the teenagers are mostly vaping right now. So, if you can keep them from starting smoking… I suppose if you’re pregnant you have a different attitude about health all together and if you can get to the middle schools and high schools when kids start vaping. Finally, for older individuals, participants most often cited item 39 (Growing up around second-hand smoke) Potential Intervention Strategies At the end of each discussion group, we asked participants to highlight the most important area for future lung cancer prevention interventions and any related strategies. This conversation resulted in the identification of three key areas: 1) educational campaigns, particularly directed toward youth, mothers, and those eligible for lung cancer screening, focused on vaping, environmental risks, and screening resources; 2) policy, specifically ways to build a public movement around smoke-free laws, inclusion of vaping into existing policies, and advertisement bans; and 3) free and accessible lung cancer screening, including means to reduce barriers and meet people where they live. Participants advocating for educational campaigns raised a number of strategies, including working with local organizations, Cooperative Extension Service offices, and recovery programs to create and share educational materials. Participants suggested highlighting personal stories and experiences within any developed educational materials and to consider generational differences (i.e., how the needs and tobacco use patterns among younger women may differ from older women in the community). A participant described how “word of mouth [here] can either hurt you or help you from somebody that was actually screened [or treated]… they tell someone else… and then the community knows,” highlighting the power of personal stories. The conversation around policy solutions had fewer concrete suggestions but largely focused on ways to engage local community leaders who shape the norms and practices in the area. As one participant elaborates: “In [my town], there was smoking everywhere, and we had a doctor who really took this on as a cause, and eventually, [the town] adopted a no smoking policy, but it took somebody in power to make that happen.” Finally, participants suggested approaches including mobile screening units, expanding insurance coverage (or awareness of existing coverage), and utilizing non-physician, local community health workers to connect participants with screening opportunities. One participant shared: People have different ideas about what lung cancer screening is all about… so maybe if we could get some non-professional healthcare workers. Maybe just people in the neighborhood who would know about screening and could be resource people to go to. I think that would be a really important thing. Discussion Principal Findings Our results indicated that a focus on community-level awareness and change, including policy efforts and educational campaigns may reduce risk and increase prevention for lung cancer among women in Appalachia. Most participants seemed aware that KY does not have a state-wide smoke-free law, resulting in a patchwork of enacted laws at the county or municipal level with few laws currently present in Appalachia areas of the state. 9 38 14 15  14 Interestingly, participants did not focus their discussion on tobacco cessation or on those who already smoke in their communities, which may reflect a perception that many efforts are already underway  39 40 41 42 43  44 Participants also highlighted the importance of the awareness and implementation of lung cancer screening in their communities. As with radon, few participants expressed knowledge of lung cancer screening or related guidelines,  45  46 47 48 Our findings support multilevel interventions for lung cancer prevention, including improving awareness, local policy, and screening access for Appalachian KY women. This research contributes novel understanding of local and gender-specific barriers and informs future Appalachian lung cancer prevention studies. Women in these communities desire new strategies to address non-smokers at risk for lung cancer (i.e., due to second-hand smoke or radon exposure) and more tailored existing tobacco cessation and lung risk reduction strategies that meet their needs. Incident cases of lung cancer among women in the US are projected to exceed those of men as of 2023, indicating current strategies, most of which were developed when male tobacco use was much more common than female tobacco use, may not work as well for this population. Future research should include an exploration of current evidence-based practices to reduce risk or prevent lung cancer among women, with particular focus among those in rural and Appalachian communities, and determine what adaptations or specific strategies would be most effective to prevent lung cancer among this population. Limitations This study has a few notable limitations. Although we utilized several recruitment strategies to improve diversity of the sample, our participants are more educated than the general population of Appalachian KY. However, we did succeed in recruiting a relatively diverse sample in terms of race and ethnicity and in reaching women in 34 different counties, increasing the variety of thought and perceptions present in our data. Additionally, by collecting data online, we may have biased our sample towards those who are more likely to participate due to access to or familiarity with technology. In previous studies,  36 “So What?” What is Already Known on This Topic? Lung cancer is the leading cause of cancer-related death for US women, including the Appalachian region, with decreases among women lagging behind those of men. Despite high rates, we currently lack published research on lung cancer risk and prevention among Appalachian women, indicating the need for novel primary and secondary prevention strategies. What Does This Article Add? Using concept mapping, a participatory mixed method, our participants listed 70 perceived barriers and facilitators affecting lung cancer prevention grouped in 8 thematic clusters, including community-level, healthcare, and tobacco-related factors. Our findings indicate three potential intervention areas: educational campaigns, policy, access to lung cancer screening. What are the Implications for Health Promotion Practice or Research? Changing trends in lung cancer incidence, with annual cases among women now exceeding men in the US, indicate the need for new prevention strategies. Our findings provide a novel exploration of barriers and facilitators to lung cancer prevention for Appalachian women and describes areas for continued focus within research and intervention development. Supplemental Material Supplemental Material - Lung Cancer Prevention Among Appalachian Kentucky Women: A Community-Engaged Mixed Method Study Supplemental Material for Lung Cancer Prevention Among Appalachian Kentucky Women: A Community-Engaged Mixed Method Study by Jessica R. Thompson, Nancy E. Schoenberg, and Pamela C. Hull in American Journal of Health Promotion Author Contributions: The authors declared no potential conflicts of interest with respect to the research, authorship, and/or publication of this article. Funding: Supplemental Material: Ethical Statement Ethical Approval All activities were approved by the University of Kentucky IRB as expedited under protocol #78464. Informed Consent We received a waiver to document consent for this project, and informed consent was gathered orally. ORCID iD Jessica R. Thompson https://orcid.org/0000-0002-6954-2663 Data Availability Statement The datasets generated during and/or analyzed during the current study are available from the corresponding author on reasonable request. * References 1 North CM Christiani DC Women and lung cancer: what is new? Semin Thorac Cardiovasc Surg 2013 25 2 87 94 10.1053/j.semtcvs.2013.05.002 24216523 PMC3827695 2 Cardarelli K Westneat S Dunfee M May B Schoenberg N Browning S Persistent disparities in smoking among rural Appalachians: evidence from the Mountain Air Project BMC Public Health 2021 21 1 270 10.1186/s12889-021-10334-6 33530976 PMC7856720 3 Alberg AJ Brock MV Ford JG Samet JM Spivack SD Epidemiology of lung cancer: diagnosis and management of lung cancer: American College of Chest Physicians evidence-based clinical practice guidelines Chest (Am Coll Chest Physicians) 2013 143 5 e1S e29S 10.1378/chest.12-2345 PMC4694610 23649439 4 American Cancer Society Key statistics for lung cancer https://www.cancer.org/cancer/lung-cancer/about/key-statistics.html Accessed February 2022. 5 Chlebowski RT Schwartz AG Wakelee H et al. Oestrogen plus progestin and lung cancer in postmenopausal women (women’s health initiative trial): a post-hoc analysis of a randomised controlled trial Lancet 2009 374 9697 1243 1251 10.1016/s0140-6736(09)61526-9 19767090 PMC2995490 6 Scaglia NC Chatkin JM Pinto JA Tsukazan MT Wagner MB Saldanha AF Role of gender in the survival of surgical patients with nonsmall cell lung cancer Ann Thorac Med 2013 8 3 142 147 10.4103/1817-1737.114297 23922608 PMC3731855 7 Brainson CF Huang B Chen Q et al. Description of a lung cancer hotspot: disparities in lung cancer histology, incidence, and survival in Kentucky and appalachian Kentucky Clin Lung Cancer 2021 22 6 e911 e920 10.1016/j.cllc.2021.03.007 33958300 PMC8495887 8 Paoletti L Jardin B Carpenter MJ Cummings KM Silvestri GA Current status of tobacco policy and control J Thorac Imag 2012 27 4 213 219 10.1097/RTI.0b013e3182518673 PMC3409436 22847588 9 Hahn EJ Rayens MK Wiggins AT Gan W Brown HM Mullett TW Lung cancer incidence and the strength of municipal smoke-free ordinances Cancer 2018 124 2 374 380 10.1002/cncr.31142 29193013 10 Slatore CG Au DH Gould MK American Thoracic Society Disparities in Healthcare Group An official American Thoracic Society systematic review: insurance status and disparities in lung cancer practices and outcomes Am J Respir Crit Care Med 2010 182 9 1195 1205 10.1164/rccm.2009-038ST 21041563 11 Health UDo, Services H The Health Consequences of Involuntary Exposure to Tobacco Smoke: A Report of the Surgeon General Atlanta, GA US Department of Health and Human Services, Centers for Disease… 2006 20669524 12 Alberg AJ Yung RC Strickland P Nelson J Respiratory cancer and exposure to arsenic, chromium, nickel, and polycyclic aromatic hydrocarbons Clin Occup Environ Med 2002 2 4 779 801 13 National Research Council (US) Committee on Health Risks of Exposure to Radon. Health Effects of Exposure to Radon: BEIR VI Washington (DC) National Academies Press (US) 1999 10.17226/5499 14 Stanifer SR Rayens MK Wiggins A Gross D Hahn EJ Home radon testing in rural Appalachia J Rural Health 2022 38 1 251 261 10.1111/jrh.12552 33382465 PMC8243395 15 Stanifer SR Rayens MK Wiggins A Hahn EJ Social determinants of health, environmental exposures and home radon testing West J Nurs Res 2021 44 1939459211009561 10.1177/01939459211009561 PMC10953677 33882759 16 Stewart AL Barinas-Mitchell E Matthews KA et al. Social role-related stress and social role-related reward as related to subsequent subclinical cardiovascular disease in a longitudinal study of midlife women: the study of women’s health across the nation Psychosom Med 2019 81 9 821 832 10.1097/psy.0000000000000733 31299023 PMC6832794 17 Park EJ Lee H Kim HC Residential radon exposure and cigarette smoking in association with lung cancer: a matched case-control study in Korea Int J Environ Res Publ Health 2020 17 8 2946 10.3390/ijerph17082946 PMC7215527 32344675 18 Lorenzo-González M Torres-Durán M Barbosa-Lorenzo R Provencio-Pulla M Barros-Dios JM Ruano-Ravina A Radon exposure: a major cause of lung cancer Expet Rev Respir Med 2019 13 9 839 850 10.1080/17476348.2019.1645599 31318276 19 American Psychological Association Fact Sheet: Women & Socioeconomic Status https://www.apa.org/pi/ses/resources/publications/women Accessed 21 September 2021. 20 Sabatino SA Coates RJ Uhler RJ Breen N Tangka F Shaw KM Disparities in mammography use among US women aged 40-64 years, by race, ethnicity, income, and health insurance status, 1993 and 2005 Med Care 2008 46 692 700 18580388 10.1097/MLR.0b013e31817893b1 21 Lee H Harris KM Gordon-Larsen P Life course perspectives on the links between poverty and obesity during the transition to young adulthood Popul Res Pol Rev 2009 28 4 505 532 10.1007/s11113-008-9115-4 PMC2743510 20161083 22 Health care costs and access disparities in Appalachia 2012 23 Robbins CL Keyserling TC Jilcott PS et al. Outcomes of cardiovascular disease risk factor screening and referrals in a family planning clinic J Womens Health 2015 24 2 131 137 10.1089/jwh.2014.4938 PMC4331243 25517351 24 Thompson JR Risser LR Dunfee MN Schoenberg NE Burke JG Place, power, and premature mortality: a rapid scoping review on the health of women in Appalachia Am J Health Promot 2021 35 8901171211011388 10.1177/08901171211011388 33906415 25 Vaughn LM Jones JR Booth E Burke JG Concept mapping methodology and community-engaged research: a perfect pairing Eval Progr Plann 2017 60 229 237 10.1016/j.evalprogplan.2016.08.013 27591958 26 Thompson JR Burke JG Increasing community participation in public health research: applications for concept mapping methodology Prog Community Health Partnersh 2020 14 2 243 250 10.1353/cpr.2020.0025 33416645 27 Weinstein LC LaNoue M Hurley K Sifri R Myers R Using concept mapping to explore barriers and facilitators to breast cancer screening in formerly homeless women with serious mental illness J Health Care Poor Underserved 2015 26 3 908 925 10.1353/hpu.2015.0104 26320922 28 Gallups SF Demirci J Nilsen M Burke J Bender C Rosenzweig MQ Using concept mapping to explore interpersonal communication components of patient navigation in breast cancer care Cancer Nurs 2022 46 321 330 10.1097/ncc.0000000000001118 35439221 PMC11182702 29 Hydeman JA Uwazurike OC Adeyemi EI Beaupin LK Survivorship needs of adolescent and young adult cancer survivors: a concept mapping analysis J Cancer Surviv 2019 13 1 34 42 10.1007/s11764-018-0725-5 30604138 PMC6699632 30 Kane M Trochin W Concept mapping for planning and evaluation Applied Social Research Methods Series Thousand Oaks, CA Sage Publications, Ltd. 2007 200 31 Harris PA Scott KW Lebo L Hassan N Lightner C Pulley J ResearchMatch: a national registry to recruit volunteers for clinical research Acad Med 2012 87 1 66 73 10.1097/ACM.0b013e31823ab7d2 22104055 PMC3688834 32 University of Kentucky Center for Clinical and Translational Science Wellness, Health & You (WHY) https://www.ccts.uky.edu/participate-research/wellness-health-you-why Accessed August 2022. 33 Vanderbilt University Research Electronic Data Capture (REDCap) https://projectredcap.org/about/ Accessed 11 August 2022. 34 Concept Systems Incorporated GroupWisdom Accessed May 2022. https://groupwisdom.com/ 35 Zoom Video Communications Inc Zoom Accessed September 2022. https://zoom.us/ 36 Burus T Thompson JR McAfee CR et al. A framework and process for community-engaged, mixed-methods cancer needs assessments Cancer Causes Control 2024 35 1319 1332 10.1007/s10552-024-01892-2 38809305 PMC11461567 37 Thompson JR Burus T McAfee C et al. A community-engaged, mixed-methods approach to prioritizing needs in a statewide assessment of community cancer needs Prev Chronic Dis 2024 21 E103 10.5888/pcd21.240183 39724002 PMC11675799 38 Christian WJ Walker CJ Huang B Hahn EJ Effect of local smoke-free ordinances on smoking prevalence in Kentucky, 2002-2009 South Med J 2019 112 7 369 375 10.14423/smj.0000000000001000 31282965 PMC6687407 39 Gupta S Scheuter C Kundu A Bhat N Cohen A Facente SN Smoking-cessation interventions in Appalachia: a systematic review and meta-analysis Am J Prev Med 2020 58 2 261 269 10.1016/j.amepre.2019.09.013 31740013 40 Rayens MK McGeeney T Wiggins AT et al. Smoke-free ordinances and youth tobacco use in Kentucky Am J Health Promot 2022 36 4 673 677 10.1177/08901171211066913 35081759 41 Mattingly DT Hart JL Vu TT Walker KL Appalachian youth e-cigarette harm perceptions and tobacco use Popul Med 2021 3 1 10.18332/popmed/132120 PMC8411871 34485919 42 Bailey BA Effectiveness of a pregnancy smoking intervention: the Tennessee intervention for pregnant smokers program Health Educ Behav 2015 42 6 824 831 10.1177/1090198115590780 26157040 43 Chertok IR Casey ML Greenfield K Approach to addressing prenatal smoking in West Virginia W Va Med J 2014 110 4 36 40 25322586 44 Sangani R Rojas E Forte M et al. Electronic cigarettes and vaping-associated lung injury (EVALI): a rural appalachian experience Hosp Pract 2021 49 2 79 87 10.1080/21548331.2020.1843282 PMC8371980 33136442 45 Cardarelli R Roper KL Cardarelli K et al. Identifying community perspectives for a lung cancer screening awareness campaign in Appalachia Kentucky: the terminate lung cancer (TLC) study J Cancer Educ 2017 32 1 125 134 10.1007/s13187-015-0914-0 26411308 PMC5569580 46 United States Preventive Services Task Force Lung Cancer: Screening https://www.uspreventiveservicestaskforce.org/uspstf/recommendation/lung-cancer-screening Accessed February 2024. 47 Schoenberg NE Hopenhayn C Christian A Knight EA Rubio A An in-depth and updated perspective on determinants of cervical cancer screening among central Appalachian women Women Health 2005 42 2 89 105 16537302 10.1300/j013v42n02_06 48 Studts CR Tarasenko YN Schoenberg NE Shelton BJ Hatcher-Keller J Dignan MB A community-based randomized trial of a faith-placed intervention to reduce cervical cancer burden in Appalachia Prev Med 2012 54 6 408 414 10.1016/j.ypmed.2012.03.019 22498022 PMC3368037 ",
  "metadata": {
    "Title of this paper": "A community-based randomized trial of a faith-placed intervention to reduce cervical cancer burden in Appalachia",
    "Journal it was published in:": "American Journal of Health Promotion",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12476475/"
  }
}