{
  "title": "Paper_1229",
  "abstract": "pmc Medicina (Kaunas) Medicina (Kaunas) 3494 medicina medicina Medicina 1010-660X 1648-9144 Multidisciplinary Digital Publishing Institute  (MDPI) PMC12472091 PMC12472091.1 12472091 12472091 41011055 10.3390/medicina61091664 medicina-61-01664 1 Article Elevated Levels of sLAG-3 as a Possible Biomarker in Graves’ Disease With and Without Thyroid Eye Disease: A Prospective Observational Case–Control Study https://orcid.org/0009-0000-5703-5448 Cieplińska Katarzyna Conceptualization Methodology Validation Formal analysis Investigation Data curation Writing – original draft Visualization 1 * https://orcid.org/0009-0009-5481-8071 Niedziela Emilia Methodology Software Validation Formal analysis Investigation Data curation Writing – review & editing Visualization 2 3 Jagielska Edyta Resources Data curation 1 Pałyga Iwona Data curation Resources 2 3 Słuszniak Anna Investigation Writing – review & editing Methodology Validation 1 https://orcid.org/0000-0001-5647-5898 Kowalska Aldona Methodology Validation Writing – review & editing Supervision Project administration Funding acquisition 2 3 Chieh-Chih Tsai Academic Editor 1 2 emilia.niedziela@onkol.kielce.pl 3 * katarzyna.cieplinska@onkol.kielce.pl 13 9 2025 9 2025 61 9 497654 1664 19 8 2025 09 9 2025 11 9 2025 13 09 2025 27 09 2025 29 09 2025 © 2025 by the authors. 2025 https://creativecommons.org/licenses/by/4.0/ Published by MDPI on behalf of the Lithuanian University of Health Sciences. Licensee MDPI, Basel, Switzerland. This article is an open access article distributed under the terms and conditions of the Creative Commons Attribution (CC BY) license ( https://creativecommons.org/licenses/by/4.0/ Background and Objectives: Materials and Methods: n n Results: p p p p Conclusions: thyroid eye disease Graves’ disease soluble lymphocyte-activation gene-3 clinical activity score soluble immune checkpoints This research received no external funding. pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement no pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes 1. Introduction Graves’ disease (GD) is an autoimmune disorder characterized by loss of T lymphocyte tolerance to the self-antigen, thyrotropin hormone receptor (TSH-R). In GD, stimulatory autoantibodies activate TSH-R, leading to thyroid hypertrophy, as well as dysregulated thyroid hormone production and secretion [ 1 2 3 4 5 Thyroid eye disease (TED), also known as Graves’ ophthalmopathy, is an extra-thyroidal manifestation that affects approximately 30% of patients with GD, although less than 10% have severe forms of TED requiring immunosuppressive treatment. Similarly to GD, TED is an autoimmune disease. The underlying pathophysiology of TED is complex, with key factors including activated CD4 + 6 7 8 9 10 11 12 13 14 15 9 Lymphocyte-activation gene-3 (LAG-3, CD233) is referred to as a third IC, after the U.S. Food and Drug Administration approved the combination drug relatlimab/nivolumab (anti-LAG-3/anti-PD-1) for treatment of inoperable or metastatic melanoma in 2022 [ 16 16 17 18 19 20 Soluble LAG-3 (sLAG-3) is formed when lymphocytes shed the LAG-3 receptor from their surface through the activity of two TCR-induced transmembrane metalloproteases, ADAM10 and ADAM17, thereby terminating the inhibitory LAG-3 signal. A soluble isoform of the LAG-3 protein, known as LAG-3V3, which is formed by alternative RNA splicing, has also been described [ 17 18 19 20 21 22 23 24 25 26 27 28 Recently, soluble immune checkpoint molecules (sICs), including sLAG-3, have become the focus of increasing scientific interest regarding their impact on autoimmune disease pathomechanisms [ 29 2. Materials and Methods 2.1. Study Population Patients with GD ( n 7 Table 1 7 Figure 1 2.2. Measurement and Analysis of Serum sLAG-3 Concentration Serum sLAG-3 concentration was measured using a commercially available double-antibody sandwich enzyme-linked immunosorbent assay kit for human lymphocyte-activation gene (LAG-3) (Shanghai Sunred Biological Technology Co., Ltd., Shanghai, China) according to the manufacturer’s instructions. The material used for the analysis was serum that had been separated from whole blood by prior centrifugation and stored at −80 °C. Standards, comprising five-point serial dilutions, and samples were added to 96-well plates pre-coated with a monoclonal antibody specific for human LAG-3. Samples from HCs were analyzed simultaneously alongside patient samples. After incubation and washing, bound sLAG-3 was detected using a biotinylated anti-LAG-3 monoclonal antibody conjugated to Streptavidin-HRP, forming an immunological complex. Substrate was then added, and, after a suitable time, the reaction was stopped using stop solution. Absorbance of samples was measured at 450 nm using a microplate reader (Multiskan ® 2.3. Additional Tests Including Routine Thyroid Assessment Thyroid-stimulating hormone (TSH), free thyroxine (FT4), and free triiodothyronine (FT3) were measured using the chemiluminescence method with an ARCHITECT i2000 immunoassay analyzer (Abbott Laboratories, Chicago, IL, USA). Thyroid-stimulating immunoglobulin (TSI) and interleukin 6 (IL-6) were analyzed using an IMMULITE 2000 XPi analyzer (Siemens, Erlangen, Germany). The IMMULITE 2000 TSI test is a fully automated, two-step chemiluminescent immunoassay. The IMMULITE 2000 IL-6 assay is an immunoenzymatic, sequential sandwich solid-phase test. Antithyroid peroxidase (aTPO) and anti-thyroglobulin (aTG) antibodies were measured on the COBAS e411 Analyzer (Roche Diagnostics GmbH Mannheim, Germany using electrochemiluminescence technology. Anti-TSH-R was measured on a Maglumi 1000 Analyzer (SNIBE, Shenzhen, China) using two recombinant human TSH receptors (hTSHR) in a bridging immunoassay design; the capture receptor was fixed on a solid phase (polystyrene bead), while the signal receptor, a recombinant hTSHR labeled with alkaline phosphatase, was suspended in a buffer solution. 2.4. Statistical Analysis Continuous variables are presented as means, standard deviations, medians, quartiles, and ranges (minimum and maximum), while categorical data are summarized as frequencies and percentages. The normality of distributions was verified using the Shapiro–Wilk test. The three experimental groups were compared using the chi-square test for categorical variables. Normally distributed continuous variables were analyzed using one-way ANOVA, followed by post hoc pairwise t p 3. Results 3.1. Patient Characteristics Patient characteristics are summarized in Table 1 3.2. Comparison of sLAG -3 Concentrations Among Study Groups Levels of sLAG-3 were significantly elevated in serum from GD patients both without ( p p p Table 2 Figure 2 The post hoc power analysis comparing sLAG-3 levels between GD patients (n = 35) and healthy controls (n = 37) indicated an effect size of medium magnitude (Cohen’s d = 0.49) and a statistical power of 0.53 at α = 0.05. Thus, while differences were detectable, the study was moderately underpowered to fully exclude type II error. ROC analysis demonstrated a moderate ability of sLAG-3 to discriminate GD patients from healthy controls (AUC = 0.69). The optimal cut-off point, determined by the Youden index, was 4.18 ng/mL, corresponding to 68.6% sensitivity and 62.2% specificity ( Table 3 Figure 3 3.3. Effects of IVGC Treatment In the TED group, IVGC treatment had no significant effect on sLAG-3 levels measured after 3 months of treatment relative to those at baseline ( p Table 4 3.4. Analysis of Correlation of sLAG-3 Levels with Clinical and Laboratory Parameters Levels of sLAG-3 did not correlate with CAS ( p Table 3 In the sensitivity analysis including smoking status, no significant association was observed between smoking and sLAG-3 levels. Compared with current smokers, neither former smokers ( β p β p β p In the multivariable logistic regression model restricted to TED patients, none of the analyzed variables (sLAG-3, TSI, IL-6, age, smoking status, ATD status, or disease duration) showed significant association with active disease defined as CAS ≥ 3 (all p Table 5 4. Discussion There have been few studies focused on the interaction between soluble and membrane ICs expressed on cells involved in orbital inflammation [ 30 31 32 33 Recently, there has been increasing research interest in sLAG-3, which has been extensively studied in the context of cancer, but also in conditions with autoimmune etiology. Elevated plasma concentrations of sLAG-3 are observed in patients with active immune thrombocytopenia, while its levels normalize during remission [ 34 35 36 37 Yehudai-Ofir et al. demonstrated a potential role for sLAG-3 as a predictor of acute graft-versus-host disease development [ 38 33 p p 33 p 31 This is the first published investigation of the effect of IVGC treatment on sLAG-3 levels in TED; we noted no significant difference before and after 3 months of steroid treatment ( p 39 Table 3 Elevated sLAG-3 levels are presumably associated with increased lymphocyte activation in the GD and TED autoimmune process as T cell activation and cytokine production require LAG-3 release from the cell membrane [ 21 40 Injection of recombinant sLAG-3 into mice with gastric cancer prolonged overall survival and increased CD8 + + 41 33 42 43 44 Studies of differences in the expression of ICs on cells in orbital tissues and levels of sICs in peripheral blood will be essential to improve the understanding of the interaction of immune cells and OFs in TED pathogenesis. Recent studies show that teprotumumab, an anti-IGF-1R inhibitor, attenuates constitutive expression of MHC-II and B7 family costimulatory molecules in OFs [ 45 The strengths of our study include consistent comparisons between disease groups with and without orbitopathy and the inclusion of a control group. Our study also has limitations: first, the sample size was small due to the rarity of TED; second, some of our patients had previously been treated with ATD as the majority had GD prior to TED onset. Therefore, further studies on larger samples including patients in different phases of the disease are needed. Moreover, we did not investigate the mechanisms underlying the functional impact of sLAG-3 in GD and TED. Finally, we emphasize the need to assess the phenotype of immune cells in orbital tissues in the context of ICs, together with their interaction with other cells in the orbit and sICs, to gain a better understanding of TED pathophysiology. 5. Conclusions In conclusion, although the mechanism underlying the function of sLAG-3 in GD and TED remains unclear, our results demonstrate a significant increase in this molecule in patients with GD relative to that in HCs, supporting a potential role for the dysregulation of sLAG-3 in the development of GD and its extra-thyroidal manifestations, such as TED. sICs are established to influence lymphocyte function by interacting with their ligands on the cell surface, possibly enhancing the immune response or contributing to maintenance of a state of tolerance [ 46 Disclaimer/Publisher’s Note: Author Contributions Conceptualization, K.C.; methodology, K.C., E.N., A.S. and A.K.; software, E.N.; validation, K.C., A.K., E.N. and A.S.; formal analysis, K.C. and E.N.; investigation, K.C., E.N. and A.S.; resources, I.P. and E.J. data curation, K.C., E.N., E.J. and I.P.; writing—original draft preparation, K.C.; writing—review and editing, E.N., A.S. and A.K.; visualization, K.C. and E.N.; supervision, A.K.; project administration, A.K.; funding acquisition, A.K. All authors have read and agreed to the published version of the manuscript. Institutional Review Board Statement This study was approved by the Bioethics Committee of the Collegium Medicum of Jan Kochanowski University in Kielce (Bioethics Committee Resolution No. 18/2025). Informed Consent Statement All subjects were informed about the purpose of the study and gave written informed consent to participate in the study. Data Availability Statement The raw data supporting the conclusions of this article will be made available by the authors upon request. Conflicts of Interest The authors declare no conflicts of interest. Abbreviations The following abbreviations are used in this manuscript: APC Antigen-presenting cells ATD Antithyroid drugs CAS Clinical Activity Score EUGOGO European Graves’ Orbitopathy Group GD Graves’ disease HCs Healthy control subjects hTSHR Recombinant human TSH receptors ICs Immune checkpoint molecules IVGC Intravenous glucocorticosteroid MHC class II Major histocompatibility complex class II NA Not applicable OF Orbital fibroblast Q1 First quartile Q3 Third quartile RA Rheumatoid arthritis rhLAG-3 Recombinant human LAG-3 SD Standard deviation sICP Soluble immune checkpoint sICs Soluble immune checkpoint molecules sLAG-3 Soluble LAG-3 TCR T cell antigen receptor TED Thyroid eye disease TSH Thyroid-stimulating hormone TSH-R Thyrotropin hormone receptor TSI Thyroid-stimulating immunoglobulin References 1. Kahaly G.J. Bartalena L. Hegedüs L. Leenhardt L. Poppe K. Pearce S.H. 2018 European Thyroid Association Guideline for the Management of Graves’ Hyperthyroidism Eur. Thyroid. J. 2018 7 167 186 10.1159/000490384 30283735 PMC6140607 2. Kustrimovic N. Gallo D. Piantanida E. Bartalena L. Lai A. Zerbinati N. Tanda M.L. Mortara L. Regulatory T Cells in the Pathogenesis of Graves’ Disease Int. J. Mol. Sci. 2023 24 16432 10.3390/ijms242216432 38003622 PMC10671795 3. Gallo D. Piantanida E. Gallazzi M. Bartalena L. Tanda M.L. Bruno A. Mortara L. Immunological Drivers in Graves’ Disease: NK Cells as a Master Switcher Front. Endocrinol. 2020 11 406 10.3389/fendo.2020.00406 32765422 PMC7379480 4. Fröhlich E. Wahl R. Thyroid Autoimmunity: Role of Anti-thyroid Antibodies in Thyroid and Extra-Thyroidal Diseases Front. Immunol. 2017 8 521 10.3389/fimmu.2017.00521 28536577 PMC5422478 5. Gallo D. Tanda M.L. Piantanida E. Predicting the Risk of Graves Disease Relapse: Commentary on “Thyroid Peroxidase Antibody Positivity is Associated with Relapse-Free Survival Following Antithyroid Drug Treatment for Graves Disease” Endocr. Pract. 2020 26 1039 1041 10.4158/EP-2020-0230 33471693 6. Cieplińska K. Niedziela E. Kowalska A. Immunological Processes in the Orbit and Indications for Current and Potential Drug Targets J. Clin. Med. 2023 13 72 10.3390/jcm13010072 38202079 PMC10780108 7. Bartalena L. Kahaly G.J. Baldeschi L. Dayan C.M. Eckstein A. Marcocci C. Marino M. Vaidya B. Wiersinga W.M. The 2021 European Group on Graves’ Orbitopathy (Eugogo) Clinical Practice Guidelines for the Medical Management of Graves’ Orbitopathy Eur. J. Endocrinol. 2021 185 G43 G67 10.1530/EJE-21-0479 34297684 8. Bartalena L. Tanda M.L. Current concepts regarding Graves’ orbitopathy J. Intern. Med. 2022 292 692 716 10.1111/joim.13524 35604323 PMC9796560 9. Rotondo Dottore G. Torregrossa L. Caturegli P. Ionni I. Sframeli A. Sabini E. Menconi F. Piaggi P. Sellari-Franceschini S. Nardi M. Association of T and B Cells Infiltrating Orbital Tissues with Clinical Features of Graves Orbitopathy JAMA Ophthalmol. 2018 136 613 619 10.1001/jamaophthalmol.2018.0806 29710102 PMC6583879 10. Bartalena L. Piantanida E. Gallo D. Lai A. Tanda M.L. Epidemiology, Natural History, Risk Factors, and Prevention of Graves’ Orbitopathy Front. Endocrinol. 2020 11 615993 10.3389/fendo.2020.615993 33329408 PMC7734282 11. Marinò M. Rotondo Dottore G. Ionni I. Lanzolla G. Sabini E. Ricci D. Sframeli A. Mazzi B. Menconi F. Latrofa F. Serum antibodies against the insulin-like growth factor-1 receptor (IGF-1R) in Graves’ disease and Graves’ orbitopathy J. Endocrinol. Investig. 2019 42 471 480 10.1007/s40618-018-0943-8 30132285 12. Tanda M.L. Gallo D. Ippolito S. Bartalena L. Piantanida E. Treatment of moderate-to-severe and active Graves’ orbitopathy: A step forward from the OPTIC study J. Endocrinol. Investig. 2020 43 1523 1525 10.1007/s40618-020-01223-7 32306294 13. Rotondo Dottore G. Bucci I. Lanzolla G. Dallan I. Sframeli A. Torregrossa L. Casini G. Basolo F. Figus M. Nardi M. Genetic Profiling of Orbital Fibroblasts from Patients with Graves’ Orbitopathy J. Clin. Endocrinol. Metab. 2021 106 e2176 e2190 10.1210/clinem/dgab035 33484567 14. Lehmann G.M. Feldon S.E. Smith T.J. Phipps R.P. Immune mechanisms in thyroid eye disease Thyroid 2008 18 959 965 10.1089/thy.2007.0407 18752427 PMC2795569 15. Fang S. Lu Y. Huang Y. Zhou H. Fan X. Mechanisms That Underly T Cell Immunity in Graves’ Orbitopathy Front. Endocrinol. 2021 12 648732 10.3389/fendo.2021.648732 33868176 PMC8049604 16. Aggarwal V. Workman C.J. Vignali D.A.A. LAG-3 as the third checkpoint inhibitor Nat. Immunol. 2023 24 1415 1422 10.1038/s41590-023-01569-z 37488429 PMC11144386 17. Burnell S.E.A. Capitani L. MacLachlan B.J. Mason G.H. Gallimore A.M. Godkin A. Seven mysteries of LAG-3: A multi-faceted immune receptor of increasing complexity Immunother. Adv. 2021 2 ltab025 10.1093/immadv/ltab025 35265944 PMC8895726 18. Wang J. Klein C. Cochran J.R. Sockolosky J. Lippow S.M. Exploring new frontiers in LAG-3 biology and therapeutics Trends Pharmacol. Sci. 2025 46 638 652 10.1016/j.tips.2025.05.008 40514283 19. Ruffo E. Wu R.C. Bruno T.C. Workman C.J. Vignali D.A.A. Lymphocyte-activation gene 3 (LAG3): The next immune checkpoint receptor Semin. Immunol. 2019 42 101305 10.1016/j.smim.2019.101305 31604537 PMC6920665 20. Triebel F. LAG-3: A regulator of T-cell and DC responses and its use in therapeutic vaccination Trends Immunol. 2003 24 619 622 10.1016/j.it.2003.10.001 14644131 21. Li N. Wang Y. Forbes K. Vignali K.M. Heale B.S. Saftig P. Hartmann D. Black R.A. Rossi J.J. Blobel C.P. Metalloproteases regulate T-cell proliferation and effector function via LAG-3 EMBO J. 2007 26 494 504 10.1038/sj.emboj.7601520 17245433 PMC1783452 22. Malinga N.Z. Siwele S.C. Steel H.C. Kwofie L.L. Meyer P.W. Smit T. Anderson R. Rapoport B.L. Kgokolo M.C. Systemic levels of the soluble co-inhibitory immune checkpoints, CTLA-4, LAG-3, PD-1/PD-L1 and TIM-3 are markedly increased in basal cell carcinoma Transl. Oncol. 2022 19 101384 10.1016/j.tranon.2022.101384 35255355 PMC8898970 23. Liu X. Xu Y. Wu X. Liu Y. Wu Q. Wu J. Zhang H. Zhou M. Qu J. Soluble Immune-related proteins as new candidate serum biomarkers for the diagnosis and progression of Lymphangioleiomyomatosis Front. Immunol. 2022 13 844914 10.3389/fimmu.2022.844914 35300340 PMC8923288 24. Li Y. Wang W. Tian J. Zhou Y. Shen Y. Wang M. Tang L. Liu C. Zhang X. Shen F. Clinical significance of Soluble LAG-3 (sLAG-3) in patients with Cervical Cancer determined via enzyme-linked immunosorbent assay with monoclonal antibodies Technol. Cancer Res. Treat. 2023 22 15330338231202650 10.1177/15330338231202650 37968933 PMC10655791 25. Wang Q. Zhang J. Tu H. Liang D. Chang D.W. Ye Y. Wu X. Soluble immune checkpoint-related proteins as predictors of tumor recurrence, survival, and T cell phenotypes in clear cell renal cell carcinoma patients J. Immunother. Cancer. 2019 7 334 10.1186/s40425-019-0810-y 31783776 PMC6884764 26. Gorgulho J. Roderburg C. Beier F. Bokemeyer C. Brümmendorf T.H. Loosen S.H. Luedde T. Soluble lymphocyte activation gene-3 (sLAG3) and CD4/CD8 ratio dynamics as predictive biomarkers in patients undergoing immune checkpoint blockade for solid malignancies Br. J. Cancer. 2024 130 1013 1022 10.1038/s41416-023-02558-7 38233492 PMC10951205 27. Botticelli A. Zizzari I.G. Scagnoli S. Pomati G. Strigari L. Cirillo A. Cerbelli B. Di Filippo A. Napoletano C. Scirocchi F. The Role of Soluble LAG3 and Soluble Immune Checkpoints Profile in Advanced Head and Neck Cancer: A Pilot Study J. Pers. Med. 2021 11 651 10.3390/jpm11070651 34357118 PMC8304359 28. Landeira-Viñuela A. Arias-Hidalgo C. Juanes-Velasco P. Alcoceba M. Navarro-Bailón A. Pedreira C.E. Lecrevisse Q. Díaz-Muñoz L. Sánchez-Santos J.M. Hernández Á.P. Unravelling soluble immune checkpoints in chronic lymphocytic leukemia: Physiological immunomodulators or immune dysfunction Front. Immunol. 2022 13 965905 10.3389/fimmu.2022.965905 36248816 PMC9554405 29. Yuan L. Wang Y. Shen X. Ma F. Wang J. Yan F. Soluble form of immune checkpoints in autoimmune diseases J. Autoimmun. 2024 147 103278 10.1016/j.jaut.2024.103278 38943864 30. Shu X. Shao Y. Chen Y. Zeng C. Huang X. Wei R. Immune checkpoints: New insights into the pathogenesis of thyroid eye disease Front. Immunol. 2024 15 1392956 10.3389/fimmu.2024.1392956 38817600 PMC11137266 31. Khamisi S. Anders Karlsson F. Ljunggren Ö. Thulin M. Larsson A. Increased plasma levels of soluble programmed death ligand 1 (sPD-L1) and fibroblast growth factor 23 (FGF-23) in patients with Graves’ ophthalmopathy in comparison to hyperthyroid patients without Graves’ ophthalmopathy Cytokine 2023 169 156269 10.1016/j.cyto.2023.156269 37307688 32. Cieplińska K. Niedziela E. Rdzanek A.K. Słuszniak A. Chrapek M. Pałyga I. Kowalska A. Association between clinical activity score and serum sPD-1 and sPD-L1 levels during systemic glucocorticoid treatment for active moderate-to-severe thyroid eye disease Cytokine 2025 187 156862 10.1016/j.cyto.2025.156862 39842384 33. Yin Q. Zhu T. Song D. Fang S. Zhou H. Guan H. Soluble immune checkpoints associated with disease activity and treatment response in GD and TED J. Clin. Endocrinol. Metab. 2024 110 1537 1549 10.1210/clinem/dgae763 39475457 34. Qiao J. Luo Q. Liu N. Wei G. Wu X. Lu J. Tang K. Wu Y. Zi J. Li X. Increased ADAM10 expression in patients with immune thrombocytopenia Int. Immunopharmacol. 2018 55 63 68 10.1016/j.intimp.2017.12.004 29223855 35. Saadati N. Khodashahi M. Rezaieyazdi Z. Sahebari M. Saremi Z. Mohammadian Haftcheshmeh S. Rafatpanah H. Salehi M. Serum Level of Soluble Lymphocyte-Activation Gene 3 Is Increased in Patients with Rheumatoid Arthritis Iran. J. Immunol. 2020 17 324 332 10.22034/iji.2020.83264.1617 33382389 36. Pyo J.Y. Yoon T. Ahn S.S. Song J.J. Park Y.B. Lee S.W. Soluble immune checkpoint molecules in patients with antineutrophil cytoplasmic antibody-associated vasculitis Sci. Rep. 2022 12 21319 10.1038/s41598-022-25466-x 36494415 PMC9734661 37. Gao X. Wang X. Guan Y. Wang L. Gao Y. Niu J. Soluble immune checkpoints are elevated in patients with primary biliary cholangitis Eur. J. Med. Res. 2023 28 477 10.1186/s40001-023-01419-6 37915081 PMC10621234 38. Dana Yehudai-Ofir Nasren Eiza Israel J. Henig, Tsila Zuckerman, Zahava Vadasz, Soluble LAG3: A Potential Marker for the Development and Activity of Acute Graft-Versus-Host Disease Blood 2023 142 (Suppl. S1) 4795 10.1182/blood-2023-184496 39. Liu J. Zhu T. Yang L. Qian W. Fang L. Zhang W. Zhang H. Wang Y. Yu B. Sun J. Cigarette Smoking Drives Thyroid Eye Disease Progression via RAGE Signaling Activation Thyroid 2025 35 803 815 10.1089/thy.2025.0062 40501349 40. Huard B. Mastrangeli R. Prigent P. Bruniquel D. Donini S. El-Tayar N. Maigret B. Dréano M. Triebel F. Characterization of the major histocompatibility complex class II binding site on LAG-3 protein Proc. Natl. Acad. Sci. USA 1997 94 5744 5749 10.1073/pnas.94.11.5744 9159144 PMC20850 41. Li N. Jilisihan B. Wang W. Tang Y. Keyoumu S. Soluble LAG3 acts as a potential prognostic marker of gastric cancer and its positive correlation with CD8+T cell frequency and secretion of IL-12 and INF-γ in peripheral blood Cancer Biomark. 2018 23 341 351 10.3233/CBM-181278 30223387 42. El Mir S. Triebel F. A soluble lymphocyte activation gene-3 molecule used as a vaccine adjuvant elicits greater humoral and cellular immune responses to both particulate and soluble antigens J. Immunol. 2000 164 5583 5589 10.4049/jimmunol.164.11.5583 10820232 43. Andreae S. Piras F. Burdin N. Triebel F. Maturation and activation of dendritic cells induced by lymphocyte activation gene-3 (CD223) J. Immunol. 2002 168 3874 3880 10.4049/jimmunol.168.8.3874 11937541 44. Prigent P. El Mir S. Dréano M. Triebel F. Lymphocyte activation gene-3 induces tumor regression and antitumor immune responses Eur. J. Immunol. 1999 29 3867 3876 10.1002/(SICI)1521-4141(199912)29:12&#x0003c;3867::AID-IMMU3867&#x0003e;3.0.CO;2-E 10601994 45. Fernando R. Caldera O. Smith T.J. Therapeutic IGF-I receptor inhibition alters fibrocyte immune phenotype in thyroid-associated ophthalmopathy Proc. Natl. Acad. Sci. USA 2021 118 e2114244118 10.1073/pnas.2114244118 34949642 PMC8719891 46. Riva A. Editorial: Soluble immune checkpoints: Novel physiological immunomodulators Front. Immunol. 2023 14 1178541 10.3389/fimmu.2023.1178541 37026008 PMC10070990 Figure 1 Flow diagram of participant selection. GD, Graves’ disease; TED, thyroid eye disease. Figure 2 sLAG-3 levels in patients with GD with and without TED and HCs. p Figure 3 ROC curve for sLAG-3 in discriminating Graves’ disease patients (GD, n n p medicina-61-01664-t001_Table 1 Table 1 Patient characteristics. Characteristic Patients with GD Without TED (N = 35) Patients with GD and TED (N = 47) Age (years)   Mean (SD) 53.09 (17.78) 55.13 (12.02) Median (Q1, Q3) 57 (39.00, 67.00) 54 (46.00, 64.00) Range 20–80 20–78 Sex   Female 26 (74.29%) 30 (68.09%) Male 9 (25.71%) 15 (31.92%) Smoking history   Non-smoker 25 (75.76%) 20 (42.55%) Former smoker 3 (9.10%) 11 (23.40%) Active smoker 5 (15.15%) 16 (34.04%) Duration of GD (months)   Mean (SD) 55.60 (63.43) 23.72 (37.40) Median (Q1, Q3) 36 (4.00, 72.00) 12 (7.00, 24.00) Range 1–240 2–240 Duration of GD (months)   ≤12 12 (35.29%) 26 (55.32%) >12 22 (64.71%) 21 (44.68%) Duration of TED (months)   Mean (SD) NA 6.25 (3.98) Median (Q1, Q3) NA 6 (3.00, 8.00) Range NA 1–18 Duration of TED (months)   ≤12 NA 45 (95.75%) >12 NA 2 (4.26%) TSH (µIU/mL)   Mean (SD) 1.36 (2.62) 4.49 (12.15) Median (Q1, Q3) 0.39 (0.01, 1.41) 0.92 (0.11–1.98) Range 0–12.49 0–71.08 TSH (µIU/mL)   <0.35 15 (46.88%) 16 (34.04%) 0.35–4.94 14 (43.75%) 25 (53.19%) >4.94 3 (9.38%) 6 (12.77%) Maximum CAS at baseline   1 NA 2 (4.25%) 2 NA 4 (8.51%) 3 NA 13 (27.66%) 4 NA 14 (29.79%) 5 NA 9 (19.15%) 6 NA 4 (8.51%) 7 NA 1 (2.13%) Maximum CAS at baseline   Mean (SD) NA 3.85 (1.32) Median (Q1, Q3) NA 4 (3, 5) Range NA 1–7 TSI at baseline (IU/L)   Mean (SD) 4.15 (4.12) 6.40 (7.93) Median (Q1, Q3) 2.17 (1.33, 5.98) 2.90 (0.72, 10.3) Range 0.31–15.20 0.1–37.4 TSI at baseline > 2 (IU/L)   No 17 (48.57%) 19 (40.43%) Yes 18 (51.43%) 28 (59.57%) sLAG-3 at baseline (ng/mL)   Mean (SD) 6.73 (4.52) 6.86 (5.06) Median (Q1, Q3) 4.73 (3.63, 7.75) 4.94 (4.23, 6.23) Range 2.10–20.43 0.848–23.84 IL-6 at baseline (pg/mL)   Mean (SD) 3.37 (2.40) 3.30 (2.37) Median (Q1, Q3) 2.40 (2.00, 3.36) 2.2 (2, 3.51) Range 2–11.6 <2–12.5 IL-6 at baseline (pg/mL)   <3.4 27 (77.14%) 29 (61.70%) >3.4 8 (22.86%) 10 (38.30%) Antithyroid drugs   Treatment-naïve 2 (5.71%) 6 (12.77%) Currently under treatment 23 (65.71%) 38 (80.85%) Previously treated, not currently 10 (28.57%) 3 (6.38%) GD, Graves’ disease; TED, thyroid eye disease; SD, standard deviation; Q1, first quartile; Q3, third quartile; NA, not applicable; TSH, thyroid-stimulating hormone; CAS, Clinical Activity Score; TSI, thyroid-stimulating immunoglobulin; sLAG-3, soluble lymphocyte-activation gene 3; IL-6, interleukin 6. medicina-61-01664-t002_Table 2 Table 2 Comparison of sLAG-3 levels in patients with GD with and without TED and HCs.  HCs (N = 37) Patients with GD Without TED (N = 35) Patients with GD and TED (N = 47) p p p Age (years)       Mean (SD) 55.11 (13.89) 53.09 (17.78) 55.13 (12.02) 0.5913 * 0.9945 * 0.5597 ** Median (Q1, Q3) 55 (45, 67) 57 (39, 67) 54 (46, 64)    Range 23–78 20–80 20–78    Sex    0.2702 *** 0.5708 *** 0.5416 *** Female 23 (62.16%) 26 (74.29%) 32 (68.09%)    Male 14 (37.84%) 9 (25.71%) 15 (31.92%)    sLAG-3 at baseline (ng/mL)    0.0129 **** <0.001 **** 1.000 **** Mean (SD) 4.76 (3.56) 6.73 (4.52) 6.68 (5.06)    Median (Q1, Q3) 3.94 (3.28, 4.71) 4.73 (3.63, 7.75) 5.06 (4.23, 6.16)    Range 2.46–19.85 2.10–20.43 0.85–23.84    * t t medicina-61-01664-t003_Table 3 Table 3 ROC analysis of sLAG-3 for discriminating GD patients from healthy controls. Parameter Value 95% CI p AUC 0.69 0.56–0.81 0.004 Optimal cut-off (ng/mL) 4.18 – – Sensitivity (%) 68.6 – – Specificity (%) 62.2 – – False positives (n) 14 – – False negatives (n) 11 – – Youden index 0.307 – – medicina-61-01664-t004_Table 4 Table 4 sLAG-3 levels in patients with TED at baseline and after 12 weeks of IVGC treatment. At Baseline sLAG-3 at Baseline (ng/mL) sLAG-3 at 12 Weeks (ng/mL) p All patients 6.68 (5.06) 6.91 (4.86) 0.0536 4.94 (4.23, 6.23) 5.13 (4.62, 6.54) 0.85–23.84 0.79–23.84 TSH 0.35–4. 94 (µIU/mL) 7.12 (5.92) 7.34 (5.61) 0.0777 5.07 (4.19–6.44) 5.19 (4.79–6.89) 0.85–23.84 0.79–23.84 TSH < 0.35 (µIU/mL) 6.78 (4.47) 7.05 (4.43) 0.6051 5.19 (4.38–6.50) 5.42 (4.68–7.30) 2.92–18.25 3.10–17.95 TSI > 2 (IU/L) 7.36 (6.07) 7.46 (5.81) 0.1213 4.91 (4.29–5.98) 5.04 (4.61–6.64) 2.92–23.84 3.10–23.84 TSI ≤ 2 (IU/L) 5.67 (2.89) 6.10 (2.96) 0.2432 5.07 (4.17–6.90) 5.35 (4.68–6.54) 0.85–13.59 0.79–13.32 IL-6 < 3.4 (pg/mL) 6.62 (4.80) 6.60 (4.52) 0.1658 4.94 (4.23–6.09) 5.03 (4.64–5.64) 2.09–23.84 2.99–23.84 IL-6 > 3.4 (pg/mL) 7.53 (5.98) 7.94 (5.81) 0.4413 5.19 (4.69–7.33) 6.07 (4.68–8.69) 4.10–23.84 4.60–23.84 Non-smokers 8.12 (6.79) 8.71 (6.64) 0.1570 5.07 (4.29–8.61) 5.42 (4.68–9.96) 2.09–23.84 2.99–23.84 Active Smokers 6.01 (3.43) 5.78 (2.36) 0.3794 4.95 (4.29–5.72) 5.01 (4.61–5.99) 3.15–15.41 3.60–13.32 Duration of TED ≤ 6 months 7.61 (6.03) 8.00 (5.95) 0.0734 5.20 (4.21–8.38) 5.35 (4.59–9.87) 2.09–23.84 2.99–23.84 Duration of TED > 6 months 5.30 (2.74) 5.31 (1.66) 0.3144 4.84 (4.36–5.44) 5.13 (4.64–5.92) 0.85–15.41 0.79–8.83 Duration of GD ≤ 12 months 6.80 (4.69) 7.29 (4.72) 0.1094 5.14 (4.36–6.23) 5.27 (4.68–8.69) 2.09–23.84 2.99–23.84 Duration of GD > 12 months 6.53 (5.60) 6.43 (5.11) 0.2471 4.76 (4.10–5.44) 5.13 (4.60–5.76) 0.848–23.84 0.787–23.84 sLAG-3, soluble lymphocyte-activation gene 3; SD, standard deviation; Q1, first quartile; Q3, third quartile; TSH, thyroid-stimulating hormone; TSI, thyroid-stimulating immunoglobulin; ATD, antithyroid drugs; IL-6, interleukin 6; TED, thyroid eye disease; GD, Graves’ disease; NA, not applicable; CAS, Clinical Activity Score. medicina-61-01664-t005_Table 5 Table 5 Multivariable logistic regression analysis of factors associated with active thyroid eye disease (CAS ≥ 3) in TED patients. Variable OR 95% CI p lag3 0.99 0.85–1.15 0.89 TSI 1.04 0.93–1.17 0.46 IL6 1.00 0.72–1.39 1.00 Age 1.02 0.96–1.10 0.51 Smoking (former vs. current) 1.98 0.23–17.1 0.54 Smoking (never vs. current) 0.44 0.07–2.76 0.38 ATD status (former vs. current) – – 1.00 * ATD status (never vs. current) 0.46 0.01–16.2 0.67 GD duration (months) 1.03 0.98–1.08 0.31 * Estimates for ATD status were unstable due to small subgroup sizes. ",
  "metadata": {
    "Title of this paper": "Editorial: Soluble immune checkpoints: Novel physiological immunomodulators",
    "Journal it was published in:": "Medicina",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12472091/"
  }
}