{
  "title": "Paper_988",
  "abstract": "pmc BMC Cancer BMC Cancer 16 bmccanc BMC Cancer 1471-2407 BMC PMC12482105 PMC12482105.1 12482105 12482105 41029538 10.1186/s12885-025-14763-z 14763 1 Research Prevalence of breast, cervical, and colorectal cancer screenings among select New York City populations http://orcid.org/0000-0002-4808-1167 Wyatt Laura C. Laura.Wyatt@nyulangone.org 1 Nguyễn Charlie H. 1 LeCroy Madison N. 1 Foster Victoria 1 Kranick Julie 1 Yusuf Yousra 1 Sifuentes Sonia 1 2 Trinh-Shevrin Chau 1 Kwon Simona C. 1 1 https://ror.org/0190ak572 grid.137628.9 0000 0004 1936 8753 Department of Population Health, NYU Grossman School of Medicine, 2 https://ror.org/034qswm17 grid.427800.9 Bay Area Cancer Connections, 30 9 2025 2025 25 478185 1469 21 2 2025 28 7 2025 30 09 2025 01 10 2025 02 10 2025 © The Author(s) 2025 2025 https://creativecommons.org/licenses/by/4.0/ Open Access http://creativecommons.org/licenses/by/4.0/ Background Prior studies have found racial and ethnic disparities in cancer screenings, yet smaller minority ethnic groups are often aggregated. Methods Data from the 2021–2022 Community Health Resources and Needs Assessment (Cancer CHRNA) and the 2017–2020 NYC Community Health Survey (CHS) examined the prevalence of breast, cervical, and colorectal cancer screenings among Eastern European, Afro-Caribbean, Latine, Chinese, Korean, South Asian, and Southwest Asian and North African (SWANA) groups in New York City. Multivariable logistic regression models estimated adjusted relative risks of cancer screening outcomes by group. Results Up-to-date mammogram screening was low (< 70%) among all groups except Afro-Caribbean in the Cancer CHRNA; and among South Asian, Chinese, and Eastern European groups in the CHS. In logistic regression, South Asian and SWANA groups were less likely to have received an up-to-date mammogram compared to the Afro-Caribbean group in the Cancer CHRNA; no group differences were found in the CHS. Up-to-date Pap screening was low (< 70%) among all groups except Latina in the Cancer CHRNA; and among South Asian and Chinese groups in the CHS. In logistic regression, all other groups were less likely to have received an up-to-date Pap test compared to the Latina group in the Cancer CHRNA; and Chinese and South Asian groups were less likely to have received an up-to-date Pap test compared to the Latina group in the CHS. Up-to-date colonoscopy screening was low (< 70%) among all groups in the Cancer CHRNA; and among SWANA, South Asian, Chinese, and Eastern European groups in the CHS. In logistic regression, all groups except Chinese were less likely to have received an up-to-date colonoscopy compared to the Eastern European group in the Cancer CHRNA; and the Chinese and SWANA groups were less likely to have received an up-to-date colonoscopy compared to the Afro-Caribbean group in the CHS. Conclusions Disparities in cancer screenings differed by screening type and survey, with larger disparities found among groups in the Cancer CHRNA. System level efforts are needed to monitor cancer screening disparities by disaggregating diverse groups; culturally tailored strategies should be used to raise awareness to increase screening. Clinical trial information Not applicable. Supplementary Information The online version contains supplementary material available at 10.1186/s12885-025-14763-z. Keywords Cancer screening Mammography Papanicolaou test Colonoscopy Ethnic and racial minorities Urban population Resource-Limited settings https://doi.org/10.13039/100007316 Division of Cancer Prevention, National Cancer Institute P30CA016087 P30CA016087 P30CA016087 P30CA016087 P30CA016087 P30CA016087 Nguyễn Charlie H. LeCroy Madison N. Foster Victoria Kranick Julie Trinh-Shevrin Chau Kwon Simona C. https://doi.org/10.13039/100020365 Centers for Disease Control and Prevention Foundation U01DP006643 U01DP006643 U01DP006643 U01DP006643 U01DP006643 LeCroy Madison N. Foster Victoria Kranick Julie Trinh-Shevrin Chau Kwon Simona C. Dune Road Foundation, Inc. pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement yes pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes issue-copyright-statement © BioMed Central Ltd., part of Springer Nature 2025 Background Screening is an important early detection tool for cancers. Cancer screenings are generally lower among non-White racial and ethnic groups compared to White groups [ 1 4 5 In New York City (NYC), colonoscopy screening rates have increased since 2003 for White, Black, and Latine groups—largely due to an initiative to increase timely colonoscopy screening [ 6 7 7 9 7 7 10 While the NYC Community Health Survey (CHS) collects colonoscopy screening rates every year, Pap and mammogram screening data is collected more sporadically. Pap screening was last collected in 2017, and mammogram screening was last collected in 2019. A 2011 report from the NYC Department of Health and Mental Hygiene (DOHMH) found that among women aged 40 and over, Black (81%) and Latina (84%) women were more likely than White (75%) and Asian (76%) women to have received a mammogram in the past two years. Similar results were shown for cervical cancer screening: Black (81%) and Latina (84%) women aged 18 and over were more likely to have been screened in the past three years compared to White (77%) and Asian (68%) women [ 11 12 13 While large health surveys often include broad racial and ethnic groups of White, Black, Latine, and Asian individuals, analyses are not always disaggregated by subgroups or often report only White, Black, Hispanic, and Other. When included, the Asian American group is often aggregated with the Native Hawaiian and Pacific Islander (NH/PI) group, masking potentially differences. Additionally, smaller groups such American Indian and Alaska Native (AIAN) are often aggregated into an “other” group, combining racial and ethnic categories with small sample sizes [ 14 15 16 In the large metropolitan city of NYC, immigrants account for a substantial proportion of the population (37.5%) [ 17 Materials & Methods Cancer CHRNA The Perlmutter Cancer Center (PCC) at NYU Langone Health (NYULH) collaborated with 23 community partners to develop the Cancer CHRNA, a cross-sectional survey to document self-reported socio-demographics and cancer screening knowledge, attitudes, behaviors and resources available among racial and ethnic minoritized and immigrant populations in the PCC catchment area (lower Manhattan, Brooklyn, Queens, and parts of Nassau and Suffolk counties). Questions were taken from other sources, including the BRFSS [ 18 19 20 To reach minoritized immigrant populations, participants were recruited through in-person clinical and highly frequented community-based settings such as nail salons, halal trucks, and at community events, as well as through virtual recruitment via partner-generated client lists, and flyers placed at community locations. Each study community health worker (CHW) was assigned one to two clinical partners where they were embedded for our clinically based recruitment. Similarly, each CHW was paired with one to two community-based organizations that serve the community they represented. Furthermore, CHW managers worked with CHW to design a culturally tailored plan for reaching people in additional locations to ensure recruitment was inclusive of populations that are not often included in health research; these locations varied by target population. For instance, halal trucks were included for the SWANA population, while Spanish language senior centers were a focus for Latine recruitment. Recruitment materials included a website URL, QR code, and contact information for multilingual staff. Eligibility criteria included aged ≥ 18 years of age, catchment area residence, and speaking a survey administration language. A translation company translated the survey from English into Arabic, Bangla, Simplified and Traditional Chinese, Haitian Creole, Korean, Russian, Spanish, and Urdu. CHWs checked and edited translations as needed. Approximately 38% of individuals were surveyed in-person by CHWs, who simultaneously entered the data into REDCap, while 62% were surveyed directly online through REDCap [ 21 22 New York City Community Health Survey (CHS) The CHS is a population-based telephone survey conducted annually by the DOHMH to provide data on the health of New Yorkers. Each year, approximately 10,000 NYC adults aged ≥ 18 years are surveyed on approximately 125 questions, covering general health status and mental health; health care access; nutrition and physical activity; smoking; cancer screening; and other health topics. While questions change across years (including cancer screening-related questions), a core group of demographic variables are included every year. The survey is conducted in English, Spanish, Russian, Chinese, Bengali, and Haitian Creole by telephone; Bengali and Haitian Creole were added in 2018. A computer-assisted telephone interviewing system is used to collect the survey data from individuals living in a household with a landline or who have a cellular telephone, using a list of telephone numbers provided by the commercial vendor. Among agreement to participate in the survey, one adults is randomly selected from the household to complete the survey [ 23 Measures Outcome: cancer screening The outcome of up-to-date breast cancer screening included self-report of a mammogram < 2 years ago among women aged 40–75 years, following recent US Preventive Services Task force (USPSTF) and the American College of Obstetricians and Gynecologists (ACOG) guidelines, which have recently changed to include initiation at age 40 rather than age 50 [ 24 26 The outcome of up-to-date cervical cancer screening included self-report of a Pap test < 3 years ago among women aged 21–65 years based on USPSTF and ACOG guidelines [ 27 28 The outcome of up-to-date colonoscopy screening included self-report of a colonoscopy < 10 years ago among adults aged 50–75 years based on previous USPSTF guidelines; this age recommendation, rather than the new guidelines for age 45–75 years, was used due to the years of CHS data collection (prior to 2022) [ 29 30 31 For each cancer screening outcome, variables were dichotomized into yes (screened within the recommended time) and no/don’t know (not screened within the recommended time, never been screened, or don’t know). Race and ethnicity The Cancer CHRNA asked “What is your race or ethnic background?” with the following response categories (check all that apply): White; Hispanic, Latina/o, or Spanish origin; Black; Middle Eastern or North African; NH/PI; Asian; AI/AN, First Nations, Indigenous People of the Americas, or Alaska Native; and Some other race or origin (please specify). Each selection included an additional branching question for detailed ethnic group (e.g., Chinese, Korean, Bangladeshi, etc. for Asian subgroup; see Additional file 2). Country of birth, self-reported language spoken at home, and survey completion language were used to impute race and ethnicity when these questions were skipped. To place participants into appropriate groupings, some write-in responses were recategorized (e.g., White other: ‘Syrian’ was moved to SWANA: Syrian). The CHS-calculated race and ethnicity variable included combined categories from two questions: (1) “Are you Hispanic or Latino?” and (2) “Which one or more of the following would you use to describe yourself as…” Response categories included White, NH; Hispanic; Black, NH; Asian/PI, NH; North African/Middle Eastern, NH (added in 2019); and Other, NH. A separate question assessed detailed Black race/ethnicity beginning in 2019, and additional questions assessed detailed Asian and Hispanic ethnicities (asked all years). Central/Western Asian and Eastern European ethnicities were determined using country of birth only; Latine race/ethnicity was determined using detailed race/ethnicity; Afro-Caribbean race/ethnicity included individuals reporting “Caribbean or West Indian” ancestry and Black individuals born in Caribbean countries; Chinese and Korean ethnicities included Asian American individuals reporting the respective Asian American ancestry as well as Asian American individuals born in China or Korea, respectively, who did not report detailed race/ethnicity; South Asian race/ethnicity included individuals reporting a South Asian race/ethnicity and a South Asian country of birth; and Indo-Caribbean race/ethnicity included individuals reporting a South Asian race/ethnicity and a Caribbean country of birth (see Additional file 2 for detailed questions). Final groups for the Cancer CHRNA include Eastern European, Afro-Caribbean, Latine, Chinese, Korean, South Asian, and SWANA. Final groups for the CHS include Eastern European, Afro-Caribbean, Latine, Chinese, South Asian, and SWANA; SWANA is included for colonoscopy screening only due to sample size, and Korean was excluded from all outcomes due to sample size. The term SWANA is used rather than MENA, because it was believed to be a more accurate geographical representation of this group; MENA and SWANA are often used interchangeably [ 32 Socio-demographics Age categorizations were used, because the CHS dataset did not include a continuous age variable. Age groups for breast cancer screening include: 40–44, 45–64, and 65–75 years; age groups for cervical cancer screening include 21–24, 25–44, and 45–65 years; and age groups for CRC screening include: 50–64 and 65–75 years. CHS age cut points end at 64 and 74, due to the shared categorizations. Additional socio-demographic variables included: educational attainment (< high school, high school, some college/technical school, and college graduate), annual household income (<$20,000, $20,000-$74,999, ≥$75,000, and don’t know/decline to state) for Cancer CHRNA, and poverty group (< 200%, 200–399%, and≥400%) for CHS. Access to care Access to care included insurance status (private/other type, public, and none), a doctor’s visit in the past year for Cancer CHRNA, and having a regular health provider for CHS. Acculturation proxies Nativity was assessed by being born in the US; US territories were considered US-born for the CHS and foreign-born for the Cancer CHRNA. Language was measured using the survey administration language (English or a non-English language) for Cancer CHRNA only; survey language variables were not included on the CHS dataset. Statistical analysis We describe participant characteristics by ethnic group by dataset for: (1) women aged 40–75 years answering the mammogram screening questions; (2) women aged 21–65 years answering the Pap screening questions; and (3) individuals aged 50–75 years answering the colonoscopy screening questions. For Cancer CHRNA, unweighted frequencies were run for participant characteristics and cancer screening outcomes; ns and percentages are presented for participant characteristics and cancer screening outcomes, while stratified by ethnic group. For CHS data, weights were applied to each record, consisting of an adjustment for the probability of selection and post-stratification weight. Post-stratification weights were created by weighting each record to the population of 34 United Hospital Fund (UHF) neighborhoods, accounting for respondents’ age, gender, and race/ethnicity [ 23 33 Multivariable relative risk regression was performed to determine if racial and ethnic groups were associated with timely Cancer screenings, after adjusting for socio-demographic, health, and acculturation proxy variables. Reference groups were chosen for each outcome based on the group with the highest cancer screening rates within each dataset and cancer screening outcome; The adjusted relative risk (RR) of each up-to-date screening (mammogram, Pap test, and colonoscopy) was calculated across categories of predictors by estimating two regression models. Model 1 included ethnic group and age group (gender was included for colonoscopy screening). Model 2 included the variables from Model 1, as well as education, income or poverty group, health insurance, recent doctor’s visit or regular health care provider, and nativity. English language proficiency was included for Cancer CHRNA only. RRs and 95% confidence intervals are presented. For Cancer CHRNA data, SAS was used for analysis using proc genmod and Poisson distribution. For CHS data, SAS-callable SUDAAN was used to account for the complex sampling design. Results Breast cancer screening – Cancer CHRNA In the Cancer CHRNA, n 1 Table 1 Characteristics by racial/ethnic group, females ages 40–75 (Cancer CHRNA 2021–2022), n (%) Eastern European ( n Afro-Caribbean ( n Latina ( n Chinese ( n Korean ( n South Asian ( n SWANA ( n Mammogram < 2 years ago 58 (72.5) 41 (73.2) 96 (69.0) 158 (69.6) 59 (63.4) 34 (54.8) 45 (50.6) Age, categories 40–44 10 (12.5) 10 (17.8) 32 (23.0) 39 (17.2) 9 (9.7) 13 (21.0) 18 (20.2) 45–64 47 (58.7) 36 (64.3) 93 (66.9) 91 (40.1) 55 (59.1) 44 (71.0) 49 (55.1) 65–75 23 (28.8) 10 (17.9) 14 (10.1) 97 (42.8) 29 (31.2) 5 (8.0) 22 (24.7) Education < High school 3 (3.8) 11 (20.0) 48 (34.8) 122 (54.5) 3 (3.4) 18 (29.0) 24 (27.0) High school 14 (17.5) 10 (18.2) 24 (17.4) 42 (18.7) 20 (22.7) 11 (17.8) 9 (10.1) Some college 26 (32.5) 15 (27.3) 31 (22.5) 26 (11.6) 14 (15.9) 9 (14.5) 22 (24.7) College graduate 37 (46.2) 19 (34.5) 35 (25.4) 34 (15.2) 51 (58.0) 24 (38.7) 34 (38.2) Income < $20k 20 (25.6) 11 (21.2) 33 (25.2) 77 (38.7) 25 (29.8) 13 (22.8) 47 (54.7) $20k - < $75k 28 (35.9) 21 (40.4) 57 (43.5) 65 (32.7) 42 (50.0) 21 (36.8) 22 (25.6) ≥ $75k 12 (15.4) 2 (3.8) 16 (12.2) 15 (7.5) 8 (9.5) 5 (8.8) 3 (3.5) Don’t know/Skipped 18 (23.1) 18 (34.6) 25 (19.1) 42 (21.1) 9 (10.7) 18 (31.6) 14 (16.3) Health Insurance Private/Other 34 (42.5 25 (45.4) 46 (33.1) 57 (25.6) 18 (20.0) 11 (18.6) 10 (11.3) Public 38 (47.5) 21 (38.2) 61 (43.9) 157 (70.4) 51 (56.7) 40 (67.8) 73 (82.0) Uninsured 8 (10.0) 9 (16.4) 32 (23.2) 9 (4.0) 21 (23.3) 6 (13.6) 6 (6.7) Last doctor’s visit < 1 year 68 (86.1) 43 (76.8) 103 (74.1) 180 (80.4) 64 (71.1) 57 (95.0) 66 (75.0) ≥ 1year/Never 11 (13.9) 13 (23.2) 36 (25.9) 44 (19.6) 26 (28.9) 3 (5.0) 22 (25.0) Born in the US Yes 4 (5.0) 0 (0.0) 33 (23.9) 14 (6.3) 2 (2.2) 2 (3.2) 2 (2.3) No 76 (95.0) 56 (100.0) 105 (76.1) 210 (93.7) 91 (97.8) 60 (96.8) 86 (97.7) English spoken fluency Very well/Well 43 (54.4) 40 (74.1) 60 (46.2) 51 (24.8) 23 (26.4) 34 (58.6) 45 (53.6) Not well/Not at all 36 (45.6) 14 (25.9) 70 (53.9) 155 (75.2) 64 (73.6) 24 (41.4) 39 (46.4) Abbreviations SWANA US CHRNA After adjustment for age group, South Asian (RR: 0.75, 95% CI: 0.58-0.98) and SWANA (RR: 0.70, 95% CI: 0.54-0.90) individuals were less likely to have received an up-to-date mammogram compared to the Afro-Caribbean group. Similar results were seen after adjustment for all variables (income, education, health insurance, check-up in the past year, nativity, and English language fluency) (Table 3 Breast cancer screening – CHS In the CHS, n=1,244 women were eligible for breast cancer screening, answered mammogram screening questions, and identified as one of the included ethnic groups (Table 2 Table 2 Characteristics by racial/ethnic group, females ages 40–74 (CHS 2018, Crude), weighted % Eastern European ( n Afro-Caribbean ( n Latina ( n Chinese ( n South Asian ( n Mammogram < 2 years ago 68.9 a 79.2 74.8 67.8 a 64.2 a Age categories 40–44 14.5 17.0 17.4 14.2 44.7 45–64 64.5 61.6 65.6 68.8 50.9 65–74 21.0 21.4 17.0 17.0 4.4 Education < High school 0.6 25.6 53.9 52.2 50.4 High school 24.5 23.6 17.8 22.0 23.4 Some college 19.5 24.3 15.9 9.4 6.6 College graduate 55.4 26.5 12.4 16.4 19.6 Poverty Rate <200% 33.1 48.3 73.5 76.7 72.8 200–399% 17.8 18.4 6.3 13.3 4.1 ≥400% 49.1 33.3 20.2 13.0 23.1 Health Insurance Private/Other 60.0 48.6 27.5 26.6 23.6 Public 36.9 35.2 54.9 67.1 68.5 Uninsured 3.0 16.2 17.6 6.2 7.9 Has a regular provider Yes 92.5 b 89.5 b 86.8 91.0 b 98.2 b No 7.5 a 10.5 a 13.2 9.0 a 8.0 a Born in the US Yes 0.0 c 18.2 24.7 1.4 0.0 c No 100.0 c 81.8 75.3 98.6 100.0 c Abbreviations SWANA US CHS Weighted to the 2000 US population, only percentages are presented a b c d After adjustment for age group, there were no differences by ethnic group for up-to-date mammogram screening. Similar results were seen after adjustment for all other variables (poverty group, education, health insurance, having a regular provider, and nativity) (Table 3 Table 3 Adjusted relative risk of being up a mammogram <2 years ago among women ages 40-75, RR (95% CI) Cancer CHRNA 2021-2022 CHS 2018 Model 1 (n=746) Model 2 ( n Model 1 ( n Model 2 ( n Race or Ethnicity Eastern European 0.98 (0.80-1.20) 0.94 (0.75-1.17) 0.86 (0.69-1.08) 0.87 (0.67-1.12) Afro-Caribbean 1 [Reference] 1 [Reference] 1 [Reference] 1 [Reference] Latina 0.95 (0.79-1.15) 0.98 (0.78-1.23) 0.95 (0.85-1.05) 0.95 (0.85-1.06) Chinese 0.95 (0.80-1.14) 0.88 (0.72-1.09) 0.85 (0.71-1.02) 0.87 (0.72-1.04) Korean 0.85 (0.69-1.06) 0.94 (0.74-1.20) — — South Asian 0.75 (0.58-0.98) 0.74 (0.56-0.97) 0.89 (0.59-1.34) 0.85 (0.57-1.28) SWANA 0.70 (0.54-0.90) 0.75 (0.57-0.98) — — Abbreviations SWANA CHRNA CHS RR CI Bolded values are significant at p CHS data includes individuals aged 40-74 Model 1: adjusted for age group Model 2: adjusted for age group, income or poverty group, education, health insurance, check-up <1 year ago for has a regular provider, nativity, and English spoken fluency (Cancer CHRNA only) Cervical cancer screening – Cancer CHRNA In the Cancer CHRNA, n=1,117 women respondents were eligible for cervical cancer screening, answered Pap screening questions, and identified as one of the ethnic groups (Table 4 Table 4 Characteristics by racial/ethnic group, females ages 21-65 (Cancer CHRNA 2021-2022), n (%) Eastern European ( n Afro-Caribbean ( n Latina ( n Chinese ( n Korean ( n South Asian ( n SWANA ( n Pap screening <3 years ago 53 (55.8) 64 (55.6) 202 (76.8) 133 (53.2) 45 (38.8) 78 (12.6) 42 (35.9) Age, categories 21-24 8 (8.4) 17 (14.8) 27 (10.3) 16 (6.4) 8 (6.9) 30 (18.6) 12 (10.3) 25-44 36 (37.9) 59 (51.3) 140 (53.2) 134 (53.6) 50 (43.1) 87 (54.0) 55 (47.0) 45-64 51 (53.7) 39 (33.9) 96 (36.5) 100 (40.0) 58 (50.0) 44 (27.3) 50 (42.7) Education <High school 5 (5.3) 11 (9.7) 76 (29.2) 78 (31.2) 1 (0.9) 24 (14.9) 15 (12.8) High school 14 (14.7) 14 (12.4) 47 (18.1) 60 (24.0) 22 (19.3) 20 (12.4) 7 (6.0) Some college 30 (31.6) 32 (28.3) 66 (25.4) 41 (16.4) 24 (21.0) 31 (19.3) 35 (29.9) College graduate 46 (48.2) 56 (49.6) 71 (27.3) 71 (28.4) 67 (58.8) 86 (53.4) 60 (51.3) Household Income < $20k 21 (22.6) 15 (14.3) 76 (30.6) 49 (20.9) 24 (22.9) 39 (26.0) 49 (43.7) $20k - < $75k 41 (44.1) 46 (43.8) 112 (45.2) 105 (44.9) 52 (49.5) 58 (38.7) 44 (39.3) $75k 16 (17.2) 6 (5.7) 26 (10.5) 29 (12.4) 20 (19.0) 17 (11.3) 6 (5.4) Not reported 15 (16.1) 38 (36.2) 34 (13.7) 51 (21.8) 9 (8.6) 36 (24.0) 13 (11.6) Health Insurance Private/Other 41 (43.2) 39 (35.1) 83 (31.9) 101 (41.2) 40 (34.8) 37 (24.2) 23 (20.0) Public 36 (37.9) 49 (44.1) 112 (43.1) 121 (49.4) 37 (32.2) 85 (55.6) 80 (69.6) Uninsured 18 (18.9) 23 (20.7) 65 (25.0) 23 (9.4) 38 (33.0) 31 (20.3) 12 (10.4) Last doctor’s visit < 1 year 68 (72.3) 83 (72.8) 180 (68.4) 185 (74.9) 66 (57.9) 124 (79.0) 80 (69.0) 1 year/Never 26 (27.7) 31 (27.2) 83 (31.6) 62 (25.1) 48 (42.1) 33 (21.0) 36 (31.0) Born in the US Yes 12 (12.8) 19 (16.5) 86 (32.8) 34 (13.7) 19 (16.5) 35 (22.0) 23 (18.8) No 82 (87.2) 96 (83.5) 176 (67.2) 215 (86.3) 96 (83.5) 124 (78.0) 93 (80.2) English spoken fluency Very well/Well 62 (66.0) 89 (80.2) 131 (52.4) 110 (47.0) 53 (48.6) 113 (73.4) 82 (73.9) Not well/Not at all 32 (34.0) 22 (47.6) 119 (47.6) 124 (53.0) 56 (51.4) 41 (26.6) 29 (26.1) Abbreviations SWANA US CHRNA After adjustment for age group, Eastern European (RR: 0.71, 95% CI: 0.58-0.85), Afro-Caribbean (RR: 0.74, 95% CI: 0.62-0.88), Chinese (RR: 0.68, 95% CI: 0.60-.78), Korean (RR: 0.49, 95% CI: 0.39-0.62), South Asian (RR: 0.66, 95% CI: 0.56-0.78) and SWANA (RR: 0.47, 95% CI: 0.36-0.60) individuals were less likely to have received an up-to-date Pap test compared to Latina individuals. Similar results were seen after adjustment for all variables (age group, income, education, health insurance, check-up in the past year, nativity, and English language fluency) (Table 6 Cervical cancer screening – CHS In the CHS, n=1,983 women were eligible for cervical cancer screening, answered Pap screening questions, and identified as one of the ethnic groups (Table 5 Table 5 Characteristics by racial/ethnic group, females ages 21-64 (CHS 2017, crude), weighted % Eastern European ( n Afro-Caribbean ( n Latina ( n Chinese ( n South Asian ( n Pap screening <3 years ago 78.3 84.9 80.5 57.9 51.5 a Age categories 21-24 d 8.7 a 7.1 6.1 a d 25-44 52.3 a 38.3 52.2 56.5 67.4 a 45-64 44.4 a 53.0 40.7 37.4 24.1 a Education <High school 0.0 c 7.4 38.3 26.5 4.3 High school 14.4 a 27.3 20.3 34.7 29.7 Some college 8.1 a 30.5 23.3 11.1 26.7 College graduate 77.5 a 34.8 18.1 27.7 39.3 Poverty Rate <200% 38.7 43.0 65.9 67.6 45.8 200-399% 13.4 27.9 17.9 14.2 18.8 400% 47.9 29.1 16.2 18.2 35.4 Health Insurance Private/Other 66.6 54.7 29.1 38.2 60.2 Public 23.6 36.3 49.1 54.0 27.7 Uninsured 9.8 9.0 21.8 7.8 12.1 Has a regular provider Yes 86.7 a 94.4 a 78.9 90.5 88.7 a No 13.3 a 5.6 a 21.1 9.5 11.3 a Born in the US Yes 0.0 c 0.0 c 36.1 5.2 0.0 c No 100.0 c 100.0 c 63.9 94.8 100.0 c Abbreviations SWANA US CHS a b c d After adjustment for age group, Chinese (RR: 0.71, 95% CI: 0.63-0.81) and South Asian (RR: 0.64, 95% CI: 0.43-0.95) individuals were less likely to have received an up-to-date Pap test compared to Latina individuals. Similar results were seen after adjustment for all variables (poverty group, education, health insurance, having a regular provider, and nativity) (Table 6 Table 6 Adjusted relative risk of a Pap test <3 years ago among women ages 21-65, RR (95% CI) Cancer CHRNA 2021-2022 CHS 2017 Model 1 ( n Model 2 ( n Model 1 ( n Model 2 ( n Race or Ethnicity Eastern European 0.71 (0.58-0.85) 0.63 (0.53-0.76) 0.97 (0.86-1.09) 0.93 (0.80-1.08) Afro-Caribbean 0.74 (0.62-0.88) 0.68 (0.55-0.83) 1.06 (0.98-1.14) 1.04 (0.95-1.30) Latina 1 [Reference] 1 [Reference] 1 [Reference] 1 [Reference] Chinese 0.68 (0.60-0.78) 0.61 (0.53-0.71) 0.71 (0.63-0.81) 0.67 (0.57-0.77) Korean 0.49 (0.39-0.62) 0.46 (0.35-0.59) — — South Asian 0.66 (0.56-0.78) 0.59 (0.49-0.72) 0.64 (0.43-0.95) 0.59 (0.38-0.90) SWANA 0.47 (0.36-0.60) 0.48 (0.37-0.62) — — Abbreviations SWANA CHRNA CHS RR CI Bolded values are significant at p CHS data includes individuals aged 21-64 Model 1: adjusted for age group Model 2: adjusted for age group, income or poverty group, education, health insurance, check-up <1 year ago for has a regular provider, nativity, and English spoken fluency (Cancer CHRNA only) CRC screening – Cancer CHRNA In the Cancer CHRNA, n=790 respondents were eligible for CRC screening, answered CRC screening questions, and identified as one of the ethnic groups (Table 7 Table 7 Characteristics by racial/ethnic group, ages 50-75 (Cancer CHRNA 2021-2022), n (%) Eastern European ( n Afro-Caribbean ( n Latine ( n Chinese ( n Korean ( n South Asian ( n SWANA ( n Any CRC screening 66 (75.9) 24 (46.2) 50 (45.5) 163 (64.7) 46 (46.5) 25 (35.2) 56 (47.1) Colonoscopy <10 years ago 60 (69.0) 18 (34.6) 41 (37.3) 147 (58.3) 39 (39.4) 19 (26.8) 50 (42.0) Sigmoidoscopy <5 years ago 1 (1.2) 4 (7.7) 0 (0.0) 2 (0.8) 5 (5.1) 0 (0.0) 3. (2.5) FOBT <1 year ago 11 (12.6) 5 (9.6) 16 (14.7) 41 (16.3) 2 (2.1) 9 (13.0) 6 (5.1) Age, categories 50-64 51 (58.6) 38 (73.1) 87 (79.1) 102 (40.5) 60 (60.6) 60 (84.5) 69 (58.0) 65-75 36 (41.4) 14 (26.9) 23 (20.9) 150 (59.5) 39 (39.4) 11 (15.5) 50 (42.0) Sex Male 28 (32.2) 13 (25.5) 34 (30.9) 84 (33.3) 29 (29.3) 32 (45.1) 56 (48.3) Female 59 (67.8) 39 (74.5) 76 (69.1) 168 (66.7) 70 (70.7) 39 (54.9) 60 (51.7) Education <High school 6 (6.9) 11 (21.6) 43 (40.2) 154 (61.9) 3 (3.1) 16 (22.5) 36 (30.2) High school 15 (17.2) 14 (27.4) 17 (15.9) 46 (18.5) 18 (19.2) 14 (19.7) 16 (13.5) Some college 28 (32.2) 15 (29.4) 20 (18.7) 24 (9.6) 18 (19.2) 10 (14.1) 23 (19.3) College graduate 38 (43.7) 11 (21.6) 27 (25.2) 25 (10.0) 55 (58.5) 31 (43.7) 44 (37.0) Household Income < $20k 26 (30.2) 11 (22.0) 33 (31.7) 112 (49.3) 29 (31.8) 15 (22.4) 74 (64.3) $20k - < $75k 31 (36.1) 17 (34.0) 36 (34.6) 48 (21.1) 47 (51.7) 25 (37.3) 23 (20.0) $75k 14 (16.3) 1 (2.0) 12 (11.5) 13 (5.7) 6 (6.6) 7 (10.4) 1 (0.9) Not reported 15 (17.4) 21 (42.0) 23 (22.1) 54 (23.8) 9 (9.9) 20 (29.9) 17 (14.8) Health Insurance Private/Other 35 (41.2) 28 (54.9) 36 (32.7) 46 (18.6) 21 (21.9) 9 (13.0) 13 (11.1) Public 43 (50.6) 18 (35.3) 48 (43.7) 195 (78.6) 60 (62.5) 52 (75.4) 96 (82.1) Uninsured 7 (8.2) 5 (9.8) 26 (23.6) 7 (2.8) 15 (15.6) 8 (11.6) 8 (6.8) Last doctor’s visit < 1 year 71 (83.5) 38 (73.1) 79 (72.5) 202 (81.8) 75 (76.5) 66 (94.3) 88 (75.2) 1 year/Never 14 (16.5) 14 (26.9) 30 (27.5) 45 (18.2) 23 (23.5) 4 (5.7) 29 (24.8) Born in the US Yes 5 (5.7) 0 (0.0) 27 (24.6) 12 (4.8) 1 (1.0) 1 (1.4) 2 (1.7) No 82 (94.3) 51 (100.0) 83 (75.4) 237 (95.2) 98 (99.0) 69 (98.6) 114 (98.3) English spoken fluency Very well/Well 41 (47.1) 34 (68.0) 44 (43.1) 37 (15.7) 16 (17.4) 41 (60.3) 59 (52.7) Not well/Not at all 46 (52.9) 16 (32.0) 58 (56.9) 198 (84.3) 76 (82.6) 27 (39.7) 53 (47.3) Abbreviations SWANA US CHRNA CRC FOBT After adjustment for age group, Afro-Caribbean (RR: 0.50, 95% CI: 0.33-0.75), Latine (RR: 0.57, 95% CI: 0.44-0.76), Chinese (RR: 0.80, 95% CI: 0.68-0.96), Korean (RR: 0.57, 95% CI: 0.44-0.75), South Asian (RR: 0.43, 95% CI: 0.28-0.65) and SWANA (RR: 0.63, 95% CI: 0.49-0.81) individuals were less likely to have received an up-to-date colonoscopy compared to Eastern European individuals. Similar results were seen after adjustment for all variables (sex, income, education, health insurance, check-up in the past year, nativity, and English language fluency), but Chinese individuals were no longer significantly different from the Eastern European group (Table 9 In the CHS, n 8 Table 8 Characteristics by racial/ethnic group, ages 50-74 (CHS 2018-2020, crude), weighted percent Eastern European ( n Afro-Caribbean ( n Latine ( n Chinese ( n South Asian ( n SWANA ( n Colonoscopy < 10 years ago 68.2 72.4 71.1 62.8 58.2a 53.3 a Age categories 50–64 60.4 71.9 76.0 68.2 87.4 71.8 65–74 39.6 28.1 24.0 31.8 12.6 28.2 Sex Male 40.5 39.2 38.8 44.8 68.2 a 67.8 a Female 59.5 60.8 61.2 55.2 31.8 a 32.2 a Education < High school 8.5 a 23.8 50.2 53.7 24.5 a 6.8 a High school 16.7 27.5 20.2 30.6 26.2 a 19.6 a Some college 19.2 23.0 18.8 5.7 10.3 a 20.1 College graduate 55.6 25.7 10.8 10.0 39.0 a 53.5 a Poverty Rate <200% 41.4 46.7 69.7 71.2 64.8 a 33.2 a 200–399% 24.2 20.0 13.3 14.5 15.7 19.4 ≥400% 34.4 33.4 17.0 14.3 19.5 47.4 a Health Insurance Private/Other 45.3 49.2 28.9 31.6 31.1 57.8 Public 47.3 38.2 53.6 66.7 55.1 34.9 Uninsured 7.4 12.6 17.5 1.7 13.8 7.3 Has a regular provider Yes 85.7 87.8 84.9 97.3 94.8 b 77.2 a No 14.3 12.2 15.1 2.7 5.2 a 22.8 b Born in the US Yes 0.0 c 11.1 31.0 3.1 a 0.0 c 5.8 No 100.0 c 88.9 69.0 96.9 b 100.0 c 94.2 Abbreviations SWANA US CHS Weighted to the 2000 US population, only percentages are presented a b c After adjustment for age group, Chinese (RR: 0.86, 95% CI: 0.76-0.98) and SWANA (RR: 0.76, 95% CI: 0.59-0.97) individuals were less likely to have received and up-to-date colonoscopy compared to Afro-Caribbean individuals. Similar results were seen after adjustment for all variables (sex, poverty group, education, health insurance, having a regular health provider, and nativity) (Table 9 Table 9 Adjusted relative risk of a colonoscopy screening <10 years ago among individuals ages 50-75, RR (95% CI) Cancer CHRNA 2021-2022 CHS – 2017-2020 Model 1 ( n Model 2 ( n Model 1 ( n Model 2 ( n Race or Ethnicity Eastern European 1 [Reference] 1 [Reference] 0.92 (0.80-1.06) 0.92 (0.79-1.07) Afro-Caribbean 0.50 (0.33-0.75) 0.50 (0.32-0.79) 1 [Reference] 1 [Reference] Latine 0.57 (0.44-0.76) 0.74 (0.56-0.98) 0.99 (0.91-1.08) 1.03 (0.93-1.13) Chinese 0.80 (0.68-0.96) 0.88 (0.72-1.08) 0.86 (0.76-0.98) 0.87 (0.76-1.00) Korean 0.57 (0.44-0.75) 0.68 (0.51-0.91) — — South Asian 0.43 (0.28-0.65) 0.46 (0.30-0.69) 0.86 (0.71-1.05) 0.84 (0.68-1.58) SWANA 0.63 (0.49-0.81) 0.69 (0.52-0.91) 0.76 (0.59-0.97) 0.73 (0.55-0.97) Abbreviations SWANA CHRNA CHS RR CI Bolded values are significant at p<0.05 CHS data includes individuals aged 50-74 Model 1: adjusted for age group and sex Model 2: adjusted for age group, sex, income or poverty group, education, health insurance, check-up <1 year ago for has a regular provider, nativity, and English spoken fluency (Cancer CHRNA only) Discussion This study examined breast, cervical, and CRC screening among seven diverse racial and ethnic groups from two recent NYC datasets. In this updated examination of cancer screening rates, we found low up-to-date cancer screening prevalence for many non-White groups, especially in the more community focused Cancer CHRNA sample. The Healthy People 2030 target for breast cancer screening (receiving an a mammogram in the past 2 years among women aged 50-74 years), is 80.3%; this age grouping differs from our data reporting (age 40-75 years) [ 34 Similarly, the 2022 NY BRFSS found low mammogram screening prevalence among NH Asian and PI (69.3%) and NH White (73.1%) women [ 13 35 37 The Healthy People 2030 target for cervical cancer screening (receiving a Pap test in the past 3 years among women aged 21-65 years) is 79.2% [ 38 Similarly, the 2020 NY BRFSS found low cervical cancer screening among NH Asian and PI women (63.6%) [ 12 35 37 The Healthy People 2030 target for CRC screening (receiving a CRC screening in the recommended time frame for adults aged 45-75 years) is 72.8% [ 39 10 The DOHMH has focused efforts to increase colonoscopy screening among minoritized groups in NYC over the past two decades, especially among Black and Latine groups [ 7 8 Barriers to cancer screenings among racial and ethnic minoritized groups include cost, time, lack of provider recommendations, limited knowledge, and a shortage of campaigns or educational materials in non-English languages. Other challenges may include limitations in healthcare and language access, as well as limited resources to reach and engage immigrant communities [ 5 40 41 42 43 44 45 46 46 More culturally and community tailored interventions and information dissemination are needed for groups with low screening uptake [ 40 41 46 47 48 49 50 51 Sampling modalities and populations represented may also help explain some of the findings in screenings, as well as differences across datasets; the Cancer CHRNA, which saw lower prevalence among many groups in comparison to the CHS, sampled more in non-English speaking groups; but both surveys included Chinese, Spanish, Haitian Creole, Russian, and Bengali languages. Bengali and Haitian Creole were added to the CHS in 2018, thus would not be applicable to Pap test which collected data for 2017 only. The Cancer CHRNA also included Urdu and Korean languages. The top languages spoken by foreign-born individuals with limited English proficiency in NYC include many of the languages surveyed: Chinese, Russian, Bengali, Haitian Creole, Arabic, and Korean [ 52 53 Some limitations should be noted. First, survey data were self-reported, and we cannot distinguish between screening and diagnostic tests. Second, Central Asian, Indo-Caribbean, detailed Latine groups, and mixed race were excluded due to sample size, and other groups were excluded once subset for age and sex (e.g., subgroups of Korean and SWANA women aged 40-75 in one year of CHS data for mammogram screening); once subset for age and sex, some groups were small and should interpreted with caution (e.g., Afro-Caribbeans, Korean, and South Asian males in the Cancer CHRNA), as well as flagged estimates from the CHS. Additionally, this data may not be generalizable to the NYC population, as the subgroups chosen were based off the oversampling for the Cancer CHRNA survey. Third, the CHS only collects colonoscopy modality for CRC screening; many average risk individuals choose to have FOBT testing. Fourth, different age cut-offs were used for the CHS due to the DOHMH coded age categories (74 vs. 75, and 64 vs. 65 years). Fifth, screening guidelines are continually updated; for example, CRC screening is now recommended beginning at age 45 (previously 50 years) [ 29 54 25 55 Conclusion We found large variations in screening rates by detailed racial and ethnic groups in NYC. This highlights the importance of data disaggregation, which helps to identify emerging disparities when granular racial and ethnic categories are available. Continued efforts are needed to investigate barriers to cancer screening in these diverse, racial and ethnic minoritized groups in NYC, as well as to increase knowledge and screening efforts using culturally and linguistically tailored strategies and interventions. Evidence-based, culturally tailored interventions utilizing CHWs have the potential to increase screening rates among groups susceptible to social determinants of health and systems-level challenges to accessing the healthcare system [ 50 56 57 Supplementary Information  Supplementary Material 1.  Supplementary Material 2.  Supplementary Material 3. Publisher’s note Springer Nature remains neutral with regard to jurisdictional claims in published maps and institutional affiliations. Acknowledgements This research was supported by the NCI (P30CA016087), CDC (U01DP006643), and Dune Road Foundation, Inc. and is solely the responsibility of the authors. We would like to thank Alice Liang, Alzahraa Ahmed, Alexandr Trifonov, Abiha Kazmi, Ana Sikharulidze, Reem Ali, Cecilia Chabani, Kimberly Charles, Kunika Chahal, Yaena Song, Sumbal Marry, LiFang Chen, NYULH PCC’s Community Advisory Board, American Cancer Society, Arab-American Family Support Center, CAMBA, Arthur Ashe Institute for Urban Health, Caribbean Women’s Health Association, Center for Family Life, the Chinese-American Planning Council, HealthFirst, the NYC DOHMH, RiseBoro Community Partnership, SHARE Cancer Support, Women’s Empowerment Coalition of NYC, Brooklyn Center for Quality Life, Haitian Americans United for Progress, RUSA LGBTQ+, Edith and Carl Marks Jewish Community House of Bensonhurst, NORC Program of the Shorefront YM-YWHA, Brighton Neighborhood Association, Asian Americans for Equality, Korean Community Services, Salam Arabic Lutheran Church, Happy Family Social Adult Day Care Center, and South Asian Council for Social Services. Thank you to the New York City Department of Health and Mental Hygiene for help in finalizing this manuscript. Authors' contributions LCW: Conceptualization (lead), Data Curation, Formal Analysis, Validation, Writing – Original Draft Preparation, and Writing – Review & Editing. CHN: Conceptualization (supporting), Writing – Review & Editing. ML: Writing – Review & Editing. JK: Writing – Review & Editing. VF: Funding acquisition, Project administration, Supervision, Conceptualization (supporting), Methodology, Writing – Review & Editing. YY: Conceptualization (supporting), Supervision, Writing – Review & Editing. Sonia Sifuentes: Project administration, Supervision, Resources, Writing – Review & Editing. CT: Funding acquisition, Methodology, Resources, Writing – Review & Editing. SCK: Funding acquisition, Methodology, Resources, Writing – Review & Editing. Funding This research was supported by the NCI (P30CA016087), CDC (U01DP006643), and Dune Road Foundation, Inc. and is solely the responsibility of the authors. Data availability Cancer CHRNA data is available on request from the corresponding author upon reasonable request. CHS data is available through a data use agreement with the NYC DOHMH. Declarations Ethics approval and consent to participate The study was conducted in accordance with the Declaration of Helsinki. Informed consent was obtained from all individual participants in the study. Study approval was received by the NYU Langone Health IRB ethics committee for the Cancer CHRNA; CHS data was received via a data use agreement and was considered exempt from IRB review per self-certification. Consent for publication Not applicable. Competing interests The authors declare no competing interests. References 1. McDaniel CC Hallam HH Cadwallader T Lee HY Chou C Persistent racial disparities in cervical cancer screening with Pap test Prev Med Rep 2021 24 101652 10.1016/j.pmedr.2021.101652 34976700 PMC8684022 McDaniel CC, Hallam HH, Cadwallader T, Lee HY, Chou C. Persistent racial disparities in cervical cancer screening with pap test. Prev Med Rep. 2021;24: 101652.McDaniel CC, Hallam HH, Cadwallader T, Lee HY, Chou C. Persistent racial disparities in cervical cancer screening with pap test. Prev Med Rep. 2021;24: 101652. 34976700 10.1016/j.pmedr.2021.101652 PMC8684022 2. Kane WJ Fleming MA 2nd Lynch KT Friel CM Williams MD Hedrick TL Yan G Hoang SC Associations of race, ethnicity, and social determinants of health with colorectal cancer screening Dis Colon Rectum 2023 66 9 1223 33 10.1097/DCR.0000000000002371 35533321 PMC9643677 Kane WJ, Fleming MA 2nd, Lynch KT, Friel CM, Williams MD, Hedrick TL, Yan G, Hoang SC. Associations of race, ethnicity, and social determinants of health with colorectal cancer screening. Dis Colon Rectum. 2023;66(9):1223–33. 35533321 10.1097/DCR.0000000000002371 PMC9643677 3. Santiago-Rodriguez EJ Shariff-Marco S Gomez SL Hiatt RA Disparities in colorectal cancer screening by time in the U.S. and race/ethnicity, 2010–2018 Am J Prev Med 2023 65 1 74 82 36803993 10.1016/j.amepre.2023.01.033 Santiago-Rodriguez EJ, Shariff-Marco S, Gomez SL, Hiatt RA. Disparities in colorectal cancer screening by time in the U.S. and race/ethnicity, 2010–2018. Am J Prev Med. 2023;65(1):74–82. 36803993 10.1016/j.amepre.2023.01.033 4. Ma ZQ Richardson LC Cancer screening prevalence and associated factors among US adults Prev Chronic Dis 2022 19 E22 10.5888/pcd19.220063 35446757 PMC9044902 Ma ZQ, Richardson LC. Cancer screening prevalence and associated factors among US adults. Prev Chronic Dis. 2022;19:E22. 35446757 10.5888/pcd19.220063 PMC9044902 5. Goel MS Wee CC McCarthy EP Davis RB Ngo-Metzger Q Phillips RS Racial and ethnic disparities in cancer screening: the importance of foreign birth as a barrier to care J Gen Intern Med 2003 18 12 1028 35 10.1111/j.1525-1497.2003.20807.x 14687262 PMC1494963 Goel MS, Wee CC, McCarthy EP, Davis RB, Ngo-Metzger Q, Phillips RS. Racial and ethnic disparities in cancer screening: the importance of foreign birth as a barrier to care. J Gen Intern Med. 2003;18(12):1028–35. 14687262 10.1111/j.1525-1497.2003.20807.x PMC1494963 6. Citywide Colorectal Cancer Control Coalition (C5.) [ https://www.nyc.gov/site/doh/providers/resources/citywide-colon-cancer-control-coalition.page 7. Colorectal Cancer Prevention and Detection. : Timely Screening among New Yorkers Ages 50 and Older [ https://www.nyc.gov/assets/doh/downloads/pdf/survey/colorectal-cancer-screening-2020.pdf 8. Wyatt LC Patel S Kranick JA Raveis VH Ravenell JE Yi SS Kwon SC Islam NS Disparities in colorectal cancer screening among South Asians in New York city: a cross-sectional study J Cancer Educ 2022 37 5 1510 8 10.1007/s13187-021-01991-7 33723796 PMC8440659 Wyatt LC, Patel S, Kranick JA, Raveis VH, Ravenell JE, Yi SS, Kwon SC, Islam NS. Disparities in colorectal cancer screening among South Asians in New York city: a cross-sectional study. J Cancer Educ. 2022;37(5):1510–8. 33723796 10.1007/s13187-021-01991-7 PMC8440659 9. Wyatt LC, Russo R, Kranick JA, Elfassy T, Kwon SC, Wong JA, Ðoàn LN, Trinh-Shevrin C. 2012–2018 Health Atlas for Asian Americans, Native Hawaiians, and Pacific Islanders: A comprehensive look at AA and NH&PI health in the U.S. In.; 2022. https://med.nyu.edu/departments-institutes/population-health/divisions-sections-centers/health-behavior/sites/default/files/pdf/csaah-health-atlas.pdf 10. Screening and Risk Factors Report by State. Received at Least One Recommended CRC Test [ https://statecancerprofiles.cancer.gov/risk/index.php?topic=colorec&risk=v521&race=00&sex=2&type=risk&sortVariableName=default&sortOrder=default#results 11. Disparities in Breast. Colorectal and Cervical Cancers in New York City [ https://www.nyc.gov/assets/doh/downloads/pdf/episrv/disparitiestwo.pdf 12. Screening and Risk Factor Reports by State. : Pap Test in Past 3 Years No Hysterectomy [ https://statecancerprofiles.cancer.gov/risk/index.php?topic=women&risk=v17&race=00&datatype=0&type=risk&sortVariableName=default&sortOrder=default#results 13. Screening. and Risk Factors Report by State (Had a Mammogram in the Past 2 Years) [ https://statecancerprofiles.cancer.gov/risk/index.php?stateFIPS=00&topic=women&risk=v06&race=00&sex=2&type=risk#results 14. Collection A. and Reporting of Asian American Health Data [ https://aanhpihealth.org/wp-content/uploads/2023/06/Data_Disaggregation_Manual_052323.pdf 15. Racial Disparities in Cancer Outcomes, Screening, and, Treatment. [ https://www.kff.org/racial-equity-and-health-policy/issue-brief/racial-disparities-in-cancer-outcomes-screening-and-treatment/ 16. Islam NS Khan S Kwon S Jang D Ro M Trinh-Shevrin C Methodological issues in the collection, analysis, and reporting of granular data in Asian American populations: historical challenges and potential solutions J Health Care Poor Underserved 2010 21 4 1354 81 10.1353/hpu.2010.0939 21099084 PMC3086449 Islam NS, Khan S, Kwon S, Jang D, Ro M, Trinh-Shevrin C. Methodological issues in the collection, analysis, and reporting of granular data in Asian American populations: historical challenges and potential solutions. J Health Care Poor Underserved. 2010;21(4):1354–81. 21099084 10.1353/hpu.2010.0939 PMC3086449 17. DP02: Selected Social Characteristics in the United States. 2023 1-Year Estimates [ https://data.census.gov/table/ACSDP1Y2023 18. Behavioral Risk Factor Surveillance System. Survey Data & Documentation [ https://www.cdc.gov/brfss/data_documentation/index.htm 19. Health Information National Trends Survey. What is HINTS? [ https://hints.cancer.gov/ 20. PhenX, Toolkit. [ https://www.phenxtoolkit.org/ 21. Harris PA Taylor R Minor BL Elliott V Fernandez M O’Neal L McLeod L Delacqua G Delacqua F Kirby J The REDCap consortium: Building an international community of software platform partners J Biomed Inf 2019 95 103208 10.1016/j.jbi.2019.103208 PMC7254481 31078660 Harris PA, Taylor R, Minor BL, Elliott V, Fernandez M, O’Neal L, McLeod L, Delacqua G, Delacqua F, Kirby J, et al. The REDCap consortium: Building an international community of software platform partners. J Biomed Inf. 2019;95:103208. 10.1016/j.jbi.2019.103208 PMC7254481 31078660 22. Harris PA Taylor R Thielke R Payne J Gonzalez N Conde JG Research electronic data capture (REDCap)—a metadata-driven methodology and workflow process for providing translational research informatics support J Biomed Inform 2009 42 2 377 81 10.1016/j.jbi.2008.08.010 18929686 PMC2700030 Harris PA, Taylor R, Thielke R, Payne J, Gonzalez N, Conde JG. Research electronic data capture (REDCap)—a metadata-driven methodology and workflow process for providing translational research informatics support. J Biomed Inform. 2009;42(2):377–81. 18929686 10.1016/j.jbi.2008.08.010 PMC2700030 23. Community Health Survey [ https://www.nyc.gov/site/doh/data/data-sets/community-health-survey.page 24. : Breast Cancer, Sreening. [ https://www.uspreventiveservicestaskforce.org/uspstf/recommendation/breast-cancer-screening 25. Breast Cancer Risk Assessment and Screening in Average-Risk Women. [ https://www.acog.org/clinical/clinical-guidance/practice-bulletin/articles/2017/07/breast-cancer-risk-assessment-and-screening-in-average-risk-women 26. Age to Initiate Routine Breast Cancer Screening ACOG clinical practice update Obstet Gynecol 2025 145 1 e40 4 10.1097/AOG.0000000000005757 39388713 Age to Initiate Routine Breast Cancer Screening. ACOG clinical practice update. Obstet Gynecol. 2025;145(1):e40–4. 39388713 10.1097/AOG.0000000000005757 27. Updated Cervical Cancer Screening Guidelines. [ https://www.acog.org/clinical/clinical-guidance/practice-advisory/articles/2021/04/updated-cervical-cancer-screening-guidelines 28. : Cervical Cancer, Screening. [ https://www.uspreventiveservicestaskforce.org/uspstf/recommendation/cervical-cancer-screening 29. : Colorectal Cancer, Screening. [ https://www.uspreventiveservicestaskforce.org/uspstf/recommendation/colorectal-cancer-screening 30. : Colorectal Cancer, Screening. [ https://www.uspreventiveservicestaskforce.org/uspstf/recommendation/colorectal-cancer-screening-june-2016 31. Colorectal Cancer Screening Tests. [ https://www.cancer.org/cancer/types/colon-rectal-cancer/detection-diagnosis-staging/screening-tests-used.html 32. ‘Systematically erased’. Middle Eastern and North African women and LGBTQ + Americans don’t see themselves in U.S. data [ https://19thnews.org/2023/05/middle-eastern-north-african-americans-census-data/ 33. BES Data Reliability Flowchart. [ https://www.nyc.gov/assets/doh/downloads/pdf/episrv/bes-data-reliability.pdf 34. Increase the proportion of females who. get screened for breast cancer — C–05 [ https://health.gov/healthypeople/objectives-and-data/browse-objectives/cancer/increase-proportion-females-who-get-screened-breast-cancer-c-05 35. Shoemaker ML White MC Breast and cervical cancer screening among Asian subgroups in the USA: estimates from the National health interview survey, 2008, 2010, and 2013 Cancer Causes Control 2016 27 6 825 9 27106576 10.1007/s10552-016-0750-5 PMC5664931 Shoemaker ML, White MC. Breast and cervical cancer screening among Asian subgroups in the USA: estimates from the National health interview survey, 2008, 2010, and 2013. Cancer Causes Control. 2016;27(6):825–9. 27106576 10.1007/s10552-016-0750-5 PMC5664931 36. Shoemaker ML White MC Breast and cervical cancer screening among Hispanic subgroups in the USA: estimates from the National health interview survey 2008, 2010, and 2013 Cancer Causes Control 2016 27 3 453 7 26809510 10.1007/s10552-016-0718-5 PMC5666577 Shoemaker ML, White MC. Breast and cervical cancer screening among Hispanic subgroups in the USA: estimates from the National health interview survey 2008, 2010, and 2013. Cancer Causes Control. 2016;27(3):453–7. 26809510 10.1007/s10552-016-0718-5 PMC5666577 37. Sun J Frick KD Liang H Chow CM Aronowitz S Shi L Examining cancer screening disparities by race/ethnicity and insurance groups: a comparison of 2008 and 2018 National health interview survey (NHIS) data in the united States PLoS One 2024 19 2 e0290105 10.1371/journal.pone.0290105 38416784 PMC10901319 Sun J, Frick KD, Liang H, Chow CM, Aronowitz S, Shi L. Examining cancer screening disparities by race/ethnicity and insurance groups: a comparison of 2008 and 2018 National health interview survey (NHIS) data in the united States. PLoS One. 2024;19(2): e0290105. 38416784 10.1371/journal.pone.0290105 PMC10901319 38. Increase the proportion of females who. get screened for cervical cancer — C–09 [ https://health.gov/healthypeople/objectives-and-data/browse-objectives/cancer/increase-proportion-females-who-get-screened-cervical-cancer-c-09 39. Increase the proportion of adults who. get screened for colorectal cancer — C–07 [ https://health.gov/healthypeople/objectives-and-data/browse-objectives/cancer/increase-proportion-adults-who-get-screened-colorectal-cancer-c-07 40. Nardi C Sandhu P Selix N Cervical cancer screening among minorities in the united States J Nurse Pract 2016 12 10 675 82 10.1016/j.nurpra.2016.08.036 Nardi C, Sandhu P, Selix N. Cervical cancer screening among minorities in the united States. J Nurse Pract. 2016;12(10):675–82. 41. Muthukrishnan M Arnold LD James AS Patients’ self-reported barriers to colon cancer screening in federally qualified health center settings Prev Med Rep 2019 15 100896 10.1016/j.pmedr.2019.100896 31193550 PMC6531912 Muthukrishnan M, Arnold LD, James AS. Patients’ self-reported barriers to colon cancer screening in federally qualified health center settings. Prev Med Rep. 2019;15: 100896. 31193550 10.1016/j.pmedr.2019.100896 PMC6531912 42. Francois F Elysee G Shah S Gany F Colon cancer knowledge and attitudes in an immigrant Haitian community J Immigr Minor Health 2009 11 4 319 25 10.1007/s10903-008-9126-6 18322798 PMC3327052 Francois F, Elysee G, Shah S, Gany F. Colon cancer knowledge and attitudes in an immigrant Haitian community. J Immigr Minor Health. 2009;11(4):319–25. 18322798 10.1007/s10903-008-9126-6 PMC3327052 43. Consedine NS Reddig MK Ladwig I Broadbent EA Gender and ethnic differences in colorectal cancer screening embarrassment and physician gender preferences Oncol Nurs Forum 2011 38 6 E409 417 10.1188/11.ONF.E409-E417 22037340 Consedine NS, Reddig MK, Ladwig I, Broadbent EA. Gender and ethnic differences in colorectal cancer screening embarrassment and physician gender preferences. Oncol Nurs Forum. 2011;38(6):E409–417. 22037340 10.1188/11.ONF.E409-E417 44. Shapiro E Barriers to colorectal cancer screening among Russian-speaking immigrants: the importance of culture and home country experiences J Immigr Minor Health 2022 24 5 1300 8 10.1007/s10903-021-01291-8 34671898 Shapiro E. Barriers to colorectal cancer screening among Russian-speaking immigrants: the importance of culture and home country experiences. J Immigr Minor Health. 2022;24(5):1300–8. 34671898 10.1007/s10903-021-01291-8 45. Kohler RE Dharamdasani T Tarn J Macenat M Mathur JMF Bandera S Kinney EV Satagopan AY Breast cancer beliefs and screening behaviors among South Asian immigrant women living in the united States BMC Womens Health 2025 25 1 98 10.1186/s12905-025-03634-1 40038678 PMC11877708 Kohler RE, Dharamdasani T, Tarn J, Macenat M, Mathur JMF, Bandera S, Kinney EV, Satagopan AY. Breast cancer beliefs and screening behaviors among South Asian immigrant women living in the united States. BMC Womens Health. 2025;25(1):98. 40038678 10.1186/s12905-025-03634-1 PMC11877708 46. Islam N, Patel S, Brooks-Griffin Q, Kemp P, Raveis V, Riley L, Gummi S, Nur PQ, Ravenell J, Cole H, Kwon S. Understanding barriers and facilitators to breast and cervical cancer screening among Muslim women in new York city: perspectives from key informants. SM J Community Med 2017, 3(1). PMC5889113 29629435 47. Afsah YR Kaneko N Barriers to cervical cancer screening faced by immigrant Muslim women: a systematic scoping review BMC Public Health 2023 23 1 2375 10.1186/s12889-023-17309-9 38037019 PMC10687813 Afsah YR, Kaneko N. Barriers to cervical cancer screening faced by immigrant Muslim women: a systematic scoping review. BMC Public Health. 2023;23(1):2375. 38037019 10.1186/s12889-023-17309-9 PMC10687813 48. Escriba-Aguir V Rodriguez-Gomez M Ruiz-Perez I Effectiveness of patient-targeted interventions to promote cancer screening among ethnic minorities: a systematic review Cancer Epidemiol 2016 44 22 39 10.1016/j.canep.2016.07.009 27459464 Escriba-Aguir V, Rodriguez-Gomez M, Ruiz-Perez I. Effectiveness of patient-targeted interventions to promote cancer screening among ethnic minorities: a systematic review. Cancer Epidemiol. 2016;44:22–39. 27459464 10.1016/j.canep.2016.07.009 49. Nelson HD Cantor A Wagner J Jungbauer R Fu R Kondo K Stillman L Quinones A Effectiveness of patient navigation to increase cancer screening in populations adversely affected by health disparities: a meta-analysis J Gen Intern Med 2020 35 10 3026 35 10.1007/s11606-020-06020-9 32700218 PMC7573022 Nelson HD, Cantor A, Wagner J, Jungbauer R, Fu R, Kondo K, Stillman L, Quinones A. Effectiveness of patient navigation to increase cancer screening in populations adversely affected by health disparities: a meta-analysis. J Gen Intern Med. 2020;35(10):3026–35. 32700218 10.1007/s11606-020-06020-9 PMC7573022 50. Wyatt LC Chebli P Patel S Alam G Naeem A Maxwell AE Raveis VH Ravenell J Kwon SC Islam NS A culturally adapted breast and cervical cancer screening intervention among Muslim women in New York city: results from the MARHABA trial J Cancer Educ 2023 38 2 682 90 10.1007/s13187-022-02177-5 35585475 PMC9674795 Wyatt LC, Chebli P, Patel S, Alam G, Naeem A, Maxwell AE, Raveis VH, Ravenell J, Kwon SC, Islam NS. A culturally adapted breast and cervical cancer screening intervention among Muslim women in New York city: results from the MARHABA trial. J Cancer Educ. 2023;38(2):682–90. 35585475 10.1007/s13187-022-02177-5 PMC9674795 51. Briant KJ Sanchez JI Ibarra G Escareno M Gonzalez NE Jimenez Gonzalez V Marchello N Louie S Thompson B Using a culturally tailored intervention to increase colorectal cancer knowledge and screening among Hispanics in a rural community Cancer Epidemiol Biomarkers Prev 2018 27 11 1283 8 10.1158/1055-9965.EPI-17-1092 29871884 PMC6214743 Briant KJ, Sanchez JI, Ibarra G, Escareno M, Gonzalez NE, Jimenez Gonzalez V, Marchello N, Louie S, Thompson B. Using a culturally tailored intervention to increase colorectal cancer knowledge and screening among Hispanics in a rural community. Cancer Epidemiol Biomarkers Prev. 2018;27(11):1283–8. 29871884 10.1158/1055-9965.EPI-17-1092 PMC6214743 52. Language, Access. [ https://www.nyc.gov/site/planning/about/language-access.page 53. 2023 Annual Report on New York City’. s Immigrant Population and Initiatives of the Office [ https://www.nyc.gov/site/immigrants/about/annual-report.page 54. American Cancer Society Guideline for Colorectal Cancer Screening. [ https://www.cancer.org/cancer/types/colon-rectal-cancer/detection-diagnosis-staging/acs-recommendations.html 55. : Breast Cancer, Screening. [ https://www.uspreventiveservicestaskforce.org/uspstf/recommendation/breast-cancer-screening 56. Okasako-Schmucker DL Peng Y Cobb J Buchanan LR Xiong KZ Mercer SL Sabatino SA Melillo S Remington PL Kumanyika SK Community health workers to increase cancer screening: 3 community guide systematic reviews Am J Prev Med 2023 64 4 579 94 10.1016/j.amepre.2022.10.016 36543699 PMC10033345 Okasako-Schmucker DL, Peng Y, Cobb J, Buchanan LR, Xiong KZ, Mercer SL, Sabatino SA, Melillo S, Remington PL, Kumanyika SK, et al. Community health workers to increase cancer screening: 3 community guide systematic reviews. Am J Prev Med. 2023;64(4):579–94. 36543699 10.1016/j.amepre.2022.10.016 PMC10033345 57. Community Preventive Services Task Force All Active Recommendations. [ https://www.thecommunityguide.org/media/pdf/cpstf-finding-lists/CPSTF-All-Findings-508.pdf 10.1016/j.amepre.2016.04.012 27745679 ",
  "metadata": {
    "Title of this paper": "Community health workers to increase cancer screening: 3 community guide systematic reviews",
    "Journal it was published in:": "BMC Cancer",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12482105/"
  }
}