{
  "title": "Paper_15",
  "abstract": "pmc MedComm (2020) MedComm (2020) 4101 mcomm MCO2 MedComm 2688-2663 Wiley PMC12495453 PMC12495453.1 12495453 12495453 10.1002/mco2.70401 MCO270401 1 Review Review Proteolysis‐Targeting Chimera (PROTAC): Current Applications and Future Directions Fan Gang  1  2 Chen Shilin  3  2 Zhang Qingping  4  2 Yu Na  5 Shen Ziyang  6 Liu Zhaoji  7 Guo Weiming  8  2 Tang Zhihan  9  10 tangzhihan@usc.edu.cn Yang Jing  3  2 yangjing.med@email.szu.edu.cn Liu Miao  6 mliu0@bwh.harvard.edu   1 Medical Research Center Affiliated Nanshan Hospital of Shenzhen University Shenzhen China   2 Pan‐Vascular Research Group Affiliated Nanshan Hospital of Shenzhen University Shenzhen China   3 Department of Endocrinology Affiliated Nanshan Hospital of Shenzhen University Shenzhen China   4 Department of Neurosurgery Affiliated Nanshan Hospital of Shenzhen University Shenzhen China   5 Department of Biology Boston University Boston Massachusetts USA   6 Department of Pathology Brigham and Women's Hospital Harvard Medical School Boston Massachusetts USA   7 Department of Medicine Beth Israel Deaconess Medical Center Boston Massachusetts USA   8 Department of Orthopaedics The First Affiliated Hospital of Guilin Medical University Guilin China   9 Institute of Cardiovascular Disease Key Laboratory for Arteriosclerology of Hunan Province Hunan International Scientific and Technological Cooperation Base of Arteriosclerotic Disease School of Basic Medical Sciences Hengyang Medical School University of South China Hengyang Hunan China   10 School of Basic Medical Sciences Hunan University of Medicine Huaihua China 04 10 2025 10 2025 6 10 496875 10.1002/mco2.v6.10 e70401 27 8 2025 26 2 2025 28 8 2025 04 10 2025 05 10 2025 05 10 2025 © 2025 The Author(s). MedComm https://creativecommons.org/licenses/by/4.0/ This is an open access article under the terms of the http://creativecommons.org/licenses/by/4.0/ ABSTRACT Targeted protein degradation (TPD) represents a paradigm shift in drug discovery, moving beyond traditional binding‐based inhibition toward active removal of disease‐driving proteins. This approach has unlocked therapeutic possibilities for previously “undruggable” targets, including transcription factors like MYC and STAT3, mutant oncoproteins such as KRAS G12C, and scaffolding molecules lacking conventional binding pockets. Among TPD strategies, proteolysis‐targeting chimeras (PROTACs) have emerged as the leading clinical platform, with the first molecule entering trials in 2019 and progression to Phase III completion by 2024. This comprehensive review examines PROTAC development across diverse therapeutic areas, analyzing key targets including kinases, hormone receptors, antiapoptotic proteins, and epigenetic modulators. We evaluate clinical progression of breakthrough candidates such as ARV‐110 for prostate cancer, ARV‐471 for breast cancer, and BTK degraders, while discussing critical challenges including the “hook effect” and oral bioavailability limitations. The review explores future directions encompassing innovative delivery strategies, tissue‐specific degrader design, and approaches for expanding E3 ligase repertoires and overcoming resistance. This review provides essential foundations for rational target selection, molecular optimization, and clinical translation strategies. By integrating mechanistic insights with clinical realities, this analysis offers perspectives on PROTAC technology advancement and identifies opportunities for transforming treatment of complex diseases resistant to conventional therapies. PROTACs are reshaping drug discovery through targeted protein degradation. Clinical programs now extend to prostate, breast, lung, hematologic, and solid tumors, with key targets including AR, ER, BTK, STAT3, Bcl‐xL, BRD9, Kras, and so on. These degraders overcome resistance, broaden therapeutic scope, and provide solutions for “undruggable” proteins, advancing from molecular design to Phase III trials and opening opportunities across oncology, immunology, neurology, and metabolic disease. clinical translation drug discovery PROTAC target protein degradation ubiquitin–proteasome system National Natural Science Foundation of China 10.13039/501100001809 82471623 Guangdong Natural Science Foundation 10.13039/501100003453 2025A1515010482 Shenzhen Medical Research Fund A2403066 Shenzhen Natural Science Foundation JCYJ20240813114423031 Shenzhen Nanshan District Science and Technology Plan NSZD2023041 Key Project of the Hunan Provincial Natural Science Foundation University Joint Fund 2025JJ90128 pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement no pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes source-schema-version-number 2.0 cover-date October 2025 details-of-publishers-convertor Converter:WILEY_ML3GV2_TO_JATSPMC version:6.6.4 mode:remove_FC converted:04.10.2025  G. Fan S. Chen Q. Zhang Proteolysis‐Targeting Chimera (PROTAC): Current Applications and Future Directions MedComm 6 10 2025 e70401 10.1002/mco2.70401  Funding Gang Fan, Shilin Chen, and Qingping Zhang have contributed equally to this work. 1 Introduction Recent years have witnessed remarkable advances in proteomics and structural biology that have significantly deepened our understanding of disease‐associated molecular mechanisms, yet these developments have simultaneously exposed critical limitations inherent in conventional drug discovery approaches. While small‐molecule inhibitors [ 1 2 3 4 5 6 7 8 9 10 11 12 13 14 15 Clinical validation of PROTAC technology has been most compelling in oncology, where conventional approaches have repeatedly failed. For example, androgen receptor (AR) variants that drive resistance to standard antagonists remain susceptible to degradation‐based strategies [ 16 17 18 19 20 21 22 23 23 24 25 26 The challenges confronting PROTAC technology are as substantial as its promise. Molecular weight and polarity constraints continue to limit oral bioavailability and tissue distribution profiles. The “hook effect,” whereby higher concentrations paradoxically reduce activity, complicates dose optimization strategies [ 27 28 This comprehensive review seeks to provide a systematic analytical framework for understanding PROTAC technology development. We begin by examining the design principles and degradation mechanisms that underpin PROTAC function, followed by a systematic comparison with traditional therapeutic modalities to establish their unique pharmacological advantages. Subsequently, we provide comprehensive coverage of representative targets and molecules across diverse therapeutic areas, ranging from well‐established kinase and hormone receptor degraders to emerging applications targeting transcription factors and immune regulatory proteins. The clinical landscape section evaluates current programs across different developmental phases, analyzing both successes and setbacks to identify key lessons for future development strategies. Our discussion of delivery systems addresses one of the field's most pressing challenges, exploring both molecular optimization strategies and advanced carrier technologies. Finally, we outline future directions encompassing molecular design optimization, E3 ligase toolbox expansion, organ‐specific targeting strategies, and approaches for overcoming clinical translation barriers. Through integration of mechanistic insights with clinical realities, this analysis provides both a current state assessment and a roadmap for future innovation as PROTAC technology transitions from a promising concept to transformative clinical reality across multiple therapeutic domains. 2 Design Principles and Degradation Mechanism of PROTACs PROTAC technology leverages the endogenous ubiquitin–proteasome system (UPS) to achieve selective elimination of target proteins and represents a hallmark of event‐driven pharmacology [ 29 30 31 32 1 33 34 35 36 37 38 39 40 41 42 43 44 45 46 47 48 49 50 51 52 53 54 55 FIGURE 1 Mechanism and molecular architecture of PROTACs. Schematic illustration of a canonical PROTAC molecule comprising three components: a target protein (POI)‐binding ligand, an E3 ubiquitin ligase‐recruiting ligand, and a linker connecting the two functional domains. Degradation mechanism: The PROTAC facilitates ternary complex formation (POI–PROTAC–E3), enabling ubiquitin (Ub) transfer to lysine residues on the POI. The polyubiquitinated POI is subsequently recognized and degraded by the 26S proteasome. Following target degradation, the PROTAC molecule is recycled to engage additional target proteins, demonstrating the catalytic nature that enables sub‐stoichiometric target elimination. 3 Pharmacological Advantages of PROTACs Compared with Traditional Therapies The emergence of PROTAC technology marks a paradigm shift in pharmacological strategy—from traditional inhibition to targeted degradation—opening new avenues in precision medicine. Table 1 TABLE 1 Systematic comparison of PROTACs with conventional therapeutic modalities. Feature/capability Small molecule inhibitors Monoclonal antibodies (mAbs) Gene‐based medicines PROTAC protein degraders  Mechanism of action Occupancy‐driven (binds & inhibits) Yes Yes No No Event‐driven (catalytic degradation) No No Possible Yes Sub‐stoichiometric activity (catalytic) No No Possible Yes  Target engagement Eliminates disease‐causing proteins Indirectly Indirectly Yes Yes Disrupts Scaffolding/nonenzymatic function Weak/no Possible Yes Yes Targets “undruggable” proteins Rarely Rarely Yes Yes Targets intracellular proteins Yes No Yes Yes Targets cell surface proteins Possible Yes Limited Possible  Pharmacokinetics/administration Broad tissue penetration High Low Low/variable Moderate Systemic delivery Yes Yes Limited/challenging Yes Oral bioavailability High (many) No No Possible/developing Route of administration Oral/Injection Injection Injection/complex Oral/injection  Development & practicality Ease of manufacturing Relatively easy Complex Very complex Moderate/developing Ease of development (drug discovery) Challenging Established Complex Emerging/potential Potential for high dose dependence Yes (often) Yes Variable Low (catalytic) John Wiley & Sons, Ltd. 3.1 Fundamental Differences in Mechanism of Action 3.1.1 A Pharmacological Revolution: Occupancy‐Driven versus Event‐Driven Traditional small‐molecule inhibitors and mAbs rely on an occupancy‐driven mechanism, requiring sustained binding to the target protein's active site to maintain inhibitory effects [ 40 56 57 58 59 60 3.1.2 Sub‐Stoichiometric Activity: A Distinct Advantage One of PROTACs’ most compelling features is their sub‐stoichiometric activity [ 61 3 62 3.2 Target Engagement and Functional Disruption 3.2.1 Direct Elimination versus Indirect Suppression of Pathogenic Proteins Traditional small molecules and mAbs indirectly suppress pathogenic proteins by inhibiting their function, leaving the proteins intact and potentially active through alternative pathways [ 63 64 65 66 3.2.2 Disruption of Scaffold and Nonenzymatic Functions Many disease‐related proteins exert pathogenicity via scaffold functions or protein–protein interactions rather than enzymatic activity [ 67 68 69 70 71 72 73 3.2.3 Unlocking the “Undruggable” A major challenge in drug development is the vast array of so‐called “undruggable” targets—proteins lacking well‐defined binding pockets or catalytic sites [ 74 75 76 77 78 3.2.4 Intracellular and Extracellular Target Coverage Small molecules and PROTACs exhibit excellent cell permeability, enabling efficient targeting of intracellular proteins [ 79 80 81 82 83 84 85 3.3 Pharmacokinetics and Administration 3.3.1 Tissue Distribution Small molecules offer superior tissue permeability, enabling broad distribution. PROTACs, with molecular weights between small molecules and biologics, offer moderate tissue penetration [ 86 87 88 89 90 3.3.2 Delivery Platforms and Routes of Administration Systemic delivery is feasible for all modalities but varies in complexity. Small molecules, mAbs, and PROTACs are generally straightforward to administer. Gene therapies face greater challenges due to their reliance on complex vectors [ 91 3.4 Development and Practical Considerations 3.4.1 Manufacturing Complexity Small molecules are synthetically straightforward. mAbs require biotechnological production [ 92 93 94 3.4.2 Drug Discovery Efficiency Small molecule development is hindered by the limitations of target druggability [ 95 96 3.4.3 Dose Dependency and Therapeutic Window Traditional therapies often show strong dose dependence, requiring high systemic exposure for efficacy. Gene therapies vary in dose response [ 97 4 Representative Targets and PROTAC Molecules PROTAC technology has exploded onto the drug discovery scene in recent years, capturing attention primarily because it works so differently from traditional inhibitors. While conventional drugs need to continuously occupy their targets to maintain effect, PROTACs can essentially “tag” proteins for destruction and walk away [ 98 2 FIGURE 2 Therapeutic targets and representative PROTAC degraders. The major target classes addressed by PROTAC technology include kinases, transcription factors, hormone receptors, epigenetic regulators, immune targets, metabolic enzymes, and components of the ubiquitin–proteasome system. Key representative degraders are illustrated for each target category. 4.1 Kinase Targets Kinases have emerged as the poster children of PROTAC development, and for good reason. These proteins occupy central roles in numerous disease pathways, and an extensive library of kinase inhibitors is already available to serve as starting points for PROTAC design—providing a significant advantage. Kinases span several major families, including receptor tyrosine kinases (EGFR, FGFR, VEGFR, IGF‐1R, FLT3) [ 99 100 101 2 72 102 103 104 105 106 107 108 109 110 111 112 113 114 115 116 117 118 119 120 121 122 123 124 125 126 124 127 128 129 130 131 132 133 134 135 136 137 138 139 140 141 142 143 144 145 146 147 148 149 150 151 152 153 154 133 155 156 157 What is remarkable about this kinase PROTAC explosion is how it reflects the underlying biology. These are not just random targets—they represent the key nodes in disease‐relevant signaling networks. The rapid expansion from initial proof‐of‐concept molecules to numerous validated degraders across nearly every major kinase family underscores the broad applicability of this technology. More importantly, it is giving us shots at targets that traditional drug discovery could not touch, which could translate into new therapeutic options for patients who have run out of alternatives. 4.2 Transcription Factors Transcription factors, functioning within the cell nucleus and predominantly featuring flat surface structures lacking druggable pockets, have long been considered “undruggable” targets for traditional small molecules and mAbs [ 158 159 2 160 161 β‐Catenin, as the core transcriptional regulatory factor of the Wnt/β‐catenin signaling pathway, is abnormally activated in various malignancies including colorectal cancer [ 162 163 164 RNA/DNA‐binding proteins also represent important transcriptional regulatory nodes, with multiple related targets currently incorporated into PROTAC development pipelines. RHAU (DHX36)[ 165 166 50 167 The antagonistic roles of transcription factors STAT3 and STAT5 signaling pathways in dendritic cells represent important factors determining immunotherapy responsiveness. Research by Zhou et al. [ 168 PROTAC research targeting transcription factors and their related regulatory factors has gradually overcome “undruggable” limitations, with current strategies primarily focusing on indirect interference (such as the BRD4–cMyc axis), structure‐induced binding (such as β‐catenin), and precise degradation of posttranscriptional regulatory targets (such as RHAU and SF3B1) [ 169 4.3 Hormone Receptors Among hormone receptor‐related targets, AR and estrogen receptor (ER) represent among the most mature targets for PROTAC technology, with multiple representative degraders emerging (Figure 2 170 47 171 172 173 174 175 2 176 47 177 178 179 ERα is abnormally activated in over 70% of breast cancers [ 180 181 182 183 184 185 50 186 PROTAC design strategies for AR/ER targets primarily focus on two aspects: first, selecting existing antagonists (such as enzalutamide, tamoxifen) [ 187 188 4.4 Antiapoptotic and Oncogenic Proteins Among “undruggable” targets, antiapoptotic proteins and oncogenic mutant proteins have long been considered difficult to effectively inhibit. However, with PROTAC technology development, this situation is rapidly changing. Degraders targeting key proteins such as Bcl‐2 family members, MDM2, KRAS, and SHP2 have successively emerged, demonstrating considerable selectivity and biological activity (Figure 2 Bcl‐xL, a key regulatory factor inhibiting cell apoptosis within the Bcl‐2 family, is widely involved in cell survival and chemotherapy resistance processes in various malignancies [ 189 190 191 192 193 194 195 196 197 Similar to Bcl‐xL, MDM2, as an E3 ligase for p53 protein, represents a core node for negative p53 regulation. In TP53 wild‐type tumors, MDM2 overexpression can mediate p53 degradation through ubiquitination, suppressing its tumor suppressor function [ 198 199 200 201 For mutant protein targets, BRAFV600E and KRASG12C represent typical driver mutations long considered “undruggable” [ 202 203 204 205 BI882370 D max 206 207 208 209 210 SHP2, a protein tyrosine phosphatase, plays critical signal bridging and amplification roles across multiple receptor tyrosine kinase pathways, representing a key synergistic factor for EGFR, ALK, and other driver mutation tumors [ 198 199 200 201 202 203 204 205 Overall, targeted degradation strategies for antiapoptotic and tumor suppressor pathway‐related proteins are breaking through inherent “undruggable” barriers. The common characteristics of this target class include structural complexity, functional diversity, and high involvement in tumor cell survival regulation. PROTACs achieve novel dimensional intervention modalities by reconstructing protein fate, not only providing breakthroughs for treating highly drug‐resistant malignancies with cryptic targets but also continuously expanding the theoretical and practical boundaries of protein degradation technology. 4.5 Epigenetic Regulatory Targets Among epigenetic regulatory targets, BRD4 undoubtedly remains one of the most intensively studied subjects [ 211 212 213 214 215 Researchers have continued to push the boundaries with increasingly sophisticated designs. QCA represents a newer generation of BRD4 degraders that builds on lessons learned from earlier molecules, offering improved potency profiles [ 216 217 218 219 220 221 222 223 224 225 226 227 228 229 Additionally, the compounds, ENL [ 230 231 232 233 234 235 236 237 238 239 4.6 Immune and Inflammatory Targets Among immune and inflammatory targets, the PD‐1/PD‐L1 pathway and STAT3 represent extremely promising key nodes in current PROTAC research (Figure 2 240 241 242 243 244 245 Additionally, some immune‐related factors have also developed effective degradation tools. Macrophage migration inhibitory factor participates in inflammatory factor secretion and tumor immunosuppression formation, with its degradation capable of blocking proinflammatory signaling axes [ 246 247 248 PROTAC designs targeting immune and inflammatory regulatory proteins continuously advance the possibilities for targeted degradation of transmembrane proteins, transcription factors, and immune auxiliary molecules. Particularly, PD‐1 peptide PROTAC strategies demonstrate clear advantages, providing new intervention pathways for overcoming immune checkpoint blockade therapy resistance and enhancing T‐cell activation levels, while establishing molecular foundations for future combination therapeutic strategies. 4.7 Metabolic and Enzymatic Targets Among metabolic and enzymatic targets, NAMPT, the rate‐limiting enzyme in NAD⁺ biosynthetic pathways, frequently participates in dynamic physiological regulation and stress responses (Figure 2 249 250 D max 251 H‐PGDS plays a critical role in prostaglandin D 2 2 2 252 253 Among other enzyme classes, PARP1/14 degradation mechanisms can achieve complete clearance of DNA repair enzymes, helping resolve residual activity and drug resistance issues faced by traditional PARP inhibitors in tumor therapy [ 254 255 256 257 4.8 UPS‐Related Targets In UPS‐related targets, researchers focus not only on substrate protein degradation but also begin exploring targeted modulation of key regulatory factors within the system. For instance, E3 ligases themselves can become targets for PROTAC molecules. CRBN and VHL represent the most commonly used E3 ligands, while degradation attempts of these components themselves expand PROTAC application boundaries in “self‐regulation” and systemic intervention aspects (Figure 2 258 259 260 261 Additionally, PSMD13 (also known as hRpn13), as a 26S proteasome regulatory subunit, has degrader XL5–VHL‐2 proven to block IκBα degradation and inhibit NF‐κB activation [ 262 263 264 Simultaneously, some uncategorized targets have also been validated for degradability in recent years. LXR‐β, a nuclear receptor participating in cholesterol homeostasis and immune regulation [ 265 266 These targets, located at ubiquitin system hub nodes or cell cycle core regulatory positions, provide important breakthroughs for precisely regulating intracellular homeostasis and developing novel anticancer or anti‐inflammatory therapeutic methods. Unlike traditional POI targeting strategies, PROTACs can achieve multipathway synergistic regulation through “degrading core regulatory factors.” 4.9 Novel PROTAC Formats and Conjugation Technologies Several new PROTAC formats have been developed due to the development of PROTAC technology (Figure 2 267 Specific types are still growing in the PROTAC research. Progressive additions to degradation approaches include traditional driver proteins, E3 ligases, proteasome proteins, and governmental cells [ 268 261 4.10 Summary and Comparative Analysis of Representative PROTAC Targets PROTAC has advanced rapidly across multiple classes of targets, including kinases, transcription factors, hormone receptors, and others [ 269 270 271 272 273 274 Among these targets, kinases remain one of the most intensively studied classes, supported by rich inhibitor libraries and well‐characterized disease associations. For example, BTK reached Phase III trials (e.g., BGB‐16673) [ 275 276 277 272 278 279 280 281 Beyond these relatively mature categories, PROTACs are beginning to tackle nuclear proteins long regarded as “undruggable,” including Myc, β‐catenin, and STAT3 [ 282 283 284 285 286 287 288 Epigenetic regulators such as BRD4, EZH2, and CBP/p300 are also compelling targets, given their central role in transcriptional reprogramming [ 289 290 291 292 5 PROTACs in the Clinic: Current Landscape and Leading Programs An increasing number of PROTAC programs are entering clinical trials, demonstrating strong momentum in the field. According to US FDA clinical trial registry data, over 50 PROTAC candidates are currently under evaluation across various clinical phases (Table 2 293 181 TABLE 2 Clinical landscape of PROTAC therapeutics. PROTAC NCT number Phase Status Target Objectives Preliminary findings References ARV‐471 NCT05930925 I Completed ERα Healthy volunteers Not reported NCT05538312 I Completed ERα Healthy volunteers Not reported [ 294 NCT04072952 I/II Active, not recruiting ERα Breast cancer Not reported [ 295 NCT06125522 I/II Active, not recruiting ERα Breast cancer Not reported NCT05501769 I Active, not recruiting ERα Breast cancer Not reported [ 296 NCT05573555 I/II Active, not recruiting ERα Breast cancer Not reported NCT05732428 I Completed ERα Breast cancer Not reported [ 297 NCT05549505 II Completed ERα Breast cancer Not reported [ 298 NCT05548127 I/II Active, not recruiting ERα Breast cancer Not reported [ 299 NCT05673889 I Completed ERα Healthy volunteers Not reported [ 300 NCT05652660 I Completed ERα Healthy volunteers Not reported [ 300 NCT05909397 III Active, not recruiting ERα Breast cancer Significant PFS benefit in ESR1‐mutated patients; well‐tolerated [ 301 NCT05463952 I Active, not recruiting ERα Breast cancer Not reported [ 301 NCT05654623 III Active, not recruiting ERα Breast cancer Enhanced PFS in the ESR1‐mutated subgroup [ 302 NCT06347861 I Completed ERα Healthy volunteers Not reported NCT06911788 I Completed ERα Healthy volunteers Not reported NCT06645938 I Completed ERα Healthy volunteers Not reported NCT06005688 I Completed ERα Healthy volunteers Not reported NCT06256510 I Completed ERα Healthy volunteers Not reported [ 303 NCT06206837 I/II Active, not recruiting ERα Breast cancer Not reported [ 304 NCT06275841 I Completed ERα Healthy volunteers Not reported ARV‐110 NCT03888612 II Completed AR Prostate cancer PSA50 response 16% overall, 46% in AR T878A/H875Y mutants [ 305 NCT05177042 I Completed AR Prostate cancer Not reported [ 306 ARV‐766 NCT05067140 I/II Active, not recruiting AR Prostate cancer Pan‐AR degradation; 51% PSA50 in AR LBD mutants [ 307 CC‐94676 NCT06764485 III Recruiting AR Prostate cancer Ongoing rechARge study; rPFS primary endpoint [ 308 NCT04428788 I Active, not recruiting AR Prostate cancer Preliminary efficacy and manageable safety in heavily [ 309 NCT06417229 I Completed AR Healthy volunteers Not reported NCT06433505 I Completed AR Healthy volunteers Not reported AC176 NCT05241613 I Terminated AR mCRPC Not reported NCT05673109 I Terminated AR mCRPC Not reported HP518 NCT06155084 I/II Recruiting AR mCRPC Not reported NCT05252364 I Completed AR mCRPC most AEs Grade 1–2 [ 2 HRS‐5041 NCT05942001 I Recruiting AR Prostate cancer Not reported NCT06559007 I Completed AR Prostate cancer Not reported NCT07014488 I Not yet recruiting AR Prostate cancer Not reported NCT06568094 I/II Recruiting AR Prostate cancer Not reported NCT06738745 II Not yet recruiting AR Prostate cancer Not reported NCT07115446 I Not yet recruiting AR Prostate cancer Not reported NCT06830850 I Recruiting AR mCRPC Not reported GT20029 NCT06692465 II Completed AR Androgenetic alopecia and acne vulgaris Met primary endpoint; good safety and efficacy [ 310 NCT06468579 I Completed AR Acne, alopecia Not reported NCT05428449 I Completed AR Androgenetic alopecia, acne vulgaris Good safety/tolerability [ 311 AH‐001 NCT06927960 I Recruiting AR Androgenetic alopecia Not reported KT‐474 NCT06058156 II Active, not recruiting IRAK4 Atopic dermatitis ≥95% IRAK4 degradation in blood and skin [ 312 NCT04772885 I Completed IRAK4 Healthy volunteer, atopic dermatitis, hidradenitis suppurativa Good safety/tolerability [ 313 NCT06028230 II Active, not recruiting IRAK4 Hidradenitis suppurativa Not reported [ 314 KT‐413 NCT05233033 I Completed IRAK4, IKZF1/3 Non‐Hodgkin lymphoma, DLBCL Good safety/tolerability [ 315 KT‐333 NCT05225584 I Completed STAT3 Liquid and solid tumors, T cell lymphomas 31.4% ORR in 51 patients [ 316 KT‐621 NCT06945458 I Recruiting STAT6 Atopic dermatitis Rapid STAT6 degradation in blood cells [ 317 NCT06673667 I Recruiting STAT6 Healthy volunteers Not reported KT‐253 NCT05775406 I Completed MDM2 High grade myeloid malignancies, acute lymphocytic, leukemia, lymphoma, solid tumors Tolerability [ 318 NX‐2127 NCT04830137 I Recruiting BTK, IKZF1/3 Relapsed/Refractory B‐cell malignancies 80% BTK degradation at 100 mg dose; preliminary antitumor activity [ 319 NX‐5948 NCT06717269 I Recruiting BTK Healthy volunteers Not reported NCT06691828 I Completed BTK Healthy volunteers Not reported NCT06593457 I Completed BTK Healthy volunteers Not reported NCT05131022 I Recruiting BTK Relapsed/refractory B‐cell malignancies 84.2% ORR in 49 patients [ 320 HSK29116 NCT04861779 I Unknown status BTK Relapsed/refractory B‐cell malignancies Not reported [ 321 BGB‐16673 NCT05294731 I/II Recruiting BTK B‐cell malignancy, non‐Hodgkin lymphoma, mantle cell lymphoma Not reported NCT07005713 I Recruiting BTK Chronic spontaneous urticaria Not reported NCT06634589 I/II Recruiting BTK B‐cell malignancy, relapsed cancer, refractory cancer Not reported [ 322 NCT06973187 III Active, not recruiting BTK CLL, SLL 78% ORR in CLL, 94% at 200 mg dose [ 323 NCT05006716 I/II Recruiting BTK B‐cell malignancy, marginal zone lymphoma, follicular lymphoma Not reported [ 324 NCT06970743 III Recruiting BTK CLL, SLL Not reported NCT06846671 III Recruiting BTK CLL Not reported DT‐2216 NCT04886622 I Recruiting BCL‐X T cell lymphomas Not reported [ 325 NCT06620302 I/II Completed BCL‐X Childhood fibrolamellar carcinoma, recurrent childhood fibrolamellar carcinoma, recurrent childhood malignant solid neoplasm Not reported [ 326 NCT06964009 I Recruiting BCL‐X Ovarian cancer Not reported CFT‐8634 NCT05355753 I Terminated BRD9 Synovial sarcoma, soft tissue sarcoma Failed to show efficacy in heavily pretreated patients [ 327 FHD‐609 NCT04965753 I Terminated BRD9 Synovial sarcoma Grade 4 QTc prolongation led to clinical hold [ 328 CFT‐1946 NCT05668585 I Active, not recruiting BRAF V600 Solid tumors, melanoma, NSCLC Avoids paradoxical RAF activation [ 329 CG001419 NCT06636500 I Recruiting NTRK Healthy volunteer, pain management Not reported PRT3789 NCT06682806 II Recruiting SMARCA2 Advanced solid tumor, esophageal cancer, metastatic solid tumor Tumor shrinkage in NSCLC and esophageal cancer [ 330 NCT05639751 I On hold SMARCA2 Advanced solid tumor, NSCLC Tumor shrinkage in NSCLC and esophageal cancer [ 331 PRT7732 NCT06560645 I Recruiting SMARCA2 Advanced solid tumor, NSCLC Not reported [ 332 MT‐4561 NCT06943521 I/II Recruiting BRD4 Advanced solid tumors Not reported LT‐002‐158 NCT06932003 I/II Not yet recruiting IRAK4 Hidradenitis suppurativa Not reported NCT06082323 I Recruiting IRAK4 Healthy volunteer, hidradenitis suppurativa, atopic dermatitis Not reported NCT06931990 I/II Not yet recruiting IRAK4 Atopic dermatitis Not reported TQB3019 NCT06943677 I Recruiting BTK Advanced malignant cancer Active against both BTK WT and C481S; exhibits excellent metabolic stability and favorable oral bioavailability [ 333 AUTX‐703 NCT06846606 I Recruiting KAT2A/KAT2B Myelodysplastic syndromes, acute myeloid leukemia Not reported PT0253 NCT06797336 I Recruiting Kras G12D Solid tumor Not reported BG‐60366 NCT06685718 I Recruiting EGFR NSCLC Not reported CFT8919 NCT06641609 I Not Yet Recruiting EGFR NSCLC Not reported [ 334 BTX‐9341 NCT06515470 I Recruiting CDK4/6 Breast cancer Not reported ARV‐393 NCT06393738 I Recruiting BCL6 Non‐Hodgkin lymphoma, angioimmunoblastic T‐cell lymphoma Not reported [ 335 ASP4396 NCT06364696 I Recruiting Kras G12D Solid tumor Not reported [ 336 ASP3082 NCT05382559 I Recruiting Kras G12D Solid tumor Selective degradation of KRAS G12D in preclinical models [ 337 BGB‐45035 NCT06342713 I Recruiting IRAK4 Healthy volunteers Not reported NCT07100938 II Recruiting IRAK4 Rheumatoid arthritis Not reported BMS‐986458 NCT06090539 I/II Recruiting BCL6 Relapsed/refractory non‐Hodgkin lymphoma Increased CD20 expression; tumor regression in preclinical models [ 338 AXT‐1003 NCT05965505 I Terminated EZH2 Relapsed/refractory non‐Hodgkin lymphoma Early termination; reasons undisclosed [ 339 NCT06484985 I Recruiting EZH2 Non‐Hodgkin lymphoma, advanced solid tumor Not reported HSK40118 NCT06050980 I Recruiting EGFR NSCLC Not reported [ 340 AC676 NCT05780034 I Recruiting BTK Relapsed/refractory B‐cell malignancies Not reported [ 341 AC682 NCT05489679 I Terminated ERα Breast cancer Not reported [ 342 NCT05080842 I Terminated ERα Breast cancer Not reported [ 342  Abbreviations John Wiley & Sons, Ltd. The first PROTAC molecule, ARV‐110, entered clinical trials in 2019—a watershed moment that marked PROTAC technology's transition from the laboratory bench to actual clinical practice [ 343 344 By mid‐2025, three PROTAC drugs have made it to Phase III trials with US FDA: vepdegestrant (ARV‐471), catadegbrutinib (BGB‐16673, NCT06973187 345 346 Overall, PROTAC technology has evolved from early proof‐of‐concept stages to a mature technology platform with clear commercialization prospects. The breakthrough of three drugs entering Phase III trials and the first NDA submission marks PROTAC technology's imminent entry into the industrialization era. 5.1 Hormone Receptor Degraders—The Most Mature Clinical Domain: AR Degraders AR degraders represent a significant breakthrough in PROTAC technology for treating genitourinary malignancies. Prostate cancer, one of the most common male malignancies [ 347 348 2 5.1.1 ARV‐110 As the world's first AR–PROTAC entering clinical trials, ARV‐110 employs classic bifunctional molecular design, with one end binding AR and the other recruiting E3 ubiquitin ligase CRBN to achieve AR‐specific degradation through ternary complex formation. In Phase I/II clinical trials ( NCT03888612 349 350 272 5.1.2 CC‐94676 (BMS‐986365) CC‐94676 (also known as BMS‐986365) is the second PROTAC molecule globally to enter Phase III. In Phase I first‐in‐human clinical trials (CC‐94676‐PCA‐001, NCT04428788 351 NCT06764485 351 5.1.3 ARV‐766 ARV‐766 is Arvinas’ second‐generation AR degrader, a novel, potent oral PROTAC AR degrader. Compared with first‐generation ARV‐110, ARV‐766 incorporates three key structural optimizations: replacing the middle six‐membered ring with a substituted four‐membered ring, substituting the chlorine atom on the left aromatic ring with methoxy, and replacing fluorinated thalidomide with fluorinated benzamide, which serves as a CRBN ligand with high selectivity and plasma stability. ARV‐766's important breakthrough lies in its pan‐AR degradation capability, degrading AR LBD mutations including AR L702H, H875Y, and T878A, while ARV‐110 cannot degrade AR L702H mutations, which account for approximately 11% of metastatic CRPC patients [ 352 NCT05067140 353 5.1.4 Other AR–PROTAC Programs in Development Beyond the major programs above, multiple AR–PROTAC candidates are currently in development, including Accutar Biotech's AC‐0176 ( NCT05241613 354 NCT05252364 2 NCT06559007 5.1.5 Dermatology Indications—Innovative Exploration of Expanded Applications AR–PROTAC applications in dermatology represent an important expansion of TPD technology into nononcology indications. Kintor Pharmaceutical's GT20029, as the world's first topical PROTAC compound entering clinical trials [ 355 NCT06692465 310 NCT06927960 356 5.2 ERα Degraders—Breast Cancer Breakthrough ARV‐471 ( NCT05654623 ERα degraders represent the most promising breakthrough in PROTAC technology for solid tumor treatment, with this field forming a complete pipeline from proof‐of‐concept to late‐stage clinical development (Table 2 181 NCT05489679 357 NCT05654623 358 p p 359 5.3 BTK Degraders 5.3.1 BGB‐16673 ( NCT06973187 BGB‐16673, as the most promising BTK–PROTAC, is the first such drug entering Phase III clinical trials, marking an important milestone for BTK degrader technology [ 360 323 5.3.2 NX‐2127 ( NCT04830137 NX‐2127 [ 361 5.3.3 NX‐5948 ( NCT06717269 NX‐5948 [ 362 5.3.4 Other Candidates HSK29116 ( NCT04861779 NCT06943677 NCT05780034 321 363 364 5.4 IRAK4 Degraders IRAK4 degraders represent an important breakthrough in immune inflammatory disease treatment, with significant mechanistic advantages over traditional small molecule inhibitors. IRAK4, as a key component of the MyD88 complex, not only possesses kinase activity but also serves important scaffolding functions, while traditional IRAK4 kinase inhibitors only block kinase activity without completely inhibiting scaffolding function. Protein degraders achieve more complete target inhibition by utilizing cellular UPSs to completely eliminate IRAK4 protein, simultaneously eliminating both kinase and scaffolding functions. KT‐413 is a bifunctional molecule that not only degrades IRAK4 but also simultaneously degrades IMiD substrates Ikaros and Aiolos, currently in Phase I clinical trials for MYD88‐mutated tumors ( NCT05233033 365 366 NCT06058156 367 313 NCT06932003 NCT06342713 5.5 KRAS G12D Degraders KRAS occupies a special position in cancer research history. For over 40 years since its discovery by Harvey and Kirsten in the 1960s [ 368 369 370 371 372 373 374 ASP3082 is the first KRAS G12D proteasome‐targeting chimeric degrader entering clinical trials [ 375 NCT05382559 376 ASP4396 from the same company is another KRAS G12D degrader designed to target KRAS G12D mutant protein degradation through the UPS, potentially providing higher efficacy and safety than inhibitors by blocking both enzymatic activity and scaffolding functions with higher target selectivity [ 336 NCT06364696 PT0253 is an emerging program that, according to preclinical comparative data, shows best‐in‐class potential and may overcome limitations of current clinical‐stage KRAS inhibitors, currently in Phase I clinical trials for KRAS G12D mutant advanced solid tumors ( NCT06797336 377 5.6 EGFR Degraders EGFR degraders represent an innovative therapeutic strategy for overcoming traditional EGFR inhibitor resistance, showing tremendous clinical value in NSCLC treatment. Traditional EGFR inhibitors like gefitinib, erlotinib, and osimertinib have achieved significant efficacy in EGFR‐mutated NSCLC patients but inevitably develop acquired resistance, mainly caused by secondary mutations like T790M and C797S [ 378 CFT8919 is a representative program in this field—a potent and selective EGFR L858R degrader based on allosteric EGFR binding motifs, developed using the company's proprietary BiDAC degradation platform technology [ 379 380 NCT06641609 381 NCT06685718 NCT06050980 5.7 BCL6 Degraders BMS‐986458 is a first‐in‐class highly selective BCL6 ligand‐directed degrader currently in Phase I/II clinical trials ( NCT06090539 382 NCT06393738 383 5.8 BRD4 and BRD9 Targeting: Innovative Strategies and Clinical Challenges MT‐4561 is a novel BRD4 degrader currently undergoing Phase II clinical evaluation. ( NCT06943521 BRD9 is a key protein in chromatin regulatory systems, participating in BAF complex functional regulation, playing crucial roles in cancers like synovial sarcoma and SMARCB1‐deficient tumors [ 384 327 328 However, while CFT‐8634 was well‐tolerated in clinical trials ( NCT05355753 327 NCT04965753 385 5.9 SMARCA2 Targeting Twin Stars: PRT3789 and PRT7732 PRT3789 [ 386 387 388 232 In a Phase I ( NCT05639751 389 5.10 STAT3 and STAT6 Targeting KT‐333 is a STAT3‐targeting PROTAC degrader using VHL‐dependent mechanisms, currently in Phase Ia/1b clinical trials ( NCT05225584 390 KT‐621 is the world's first STAT6‐targeting PROTAC drug, showing good pharmacokinetic characteristics in healthy subjects with rapid degradation of STAT6 protein in blood immune cells [ 391 NCT06945458 5.11 PROTAC Drugs Targeting Other Protein Targets Under Clinical Evaluation As PROTAC technology continues developing, new PROTAC drugs keep emerging, providing new strategies for cancer treatment through protein degradation mechanisms. DT‐2216 [ 392 NCT04886622 339 393 NCT05965505 In hematologic malignancy treatment, AUTX‐703 [ 394 NCT06846606 395 NCT05775406 In solid tumor treatment, CFT‐1946 represents an important technological breakthrough as a novel bifunctional degradation activating compound (BIDAC) that simultaneously inhibits and degrades mutant BRAF V600 protein. Compared with traditional BRAF inhibitors, CFT‐1946's unique advantage lies in avoiding paradoxical RAF activation phenomena, since degraded BRAF V600 mutant protein cannot form dimeric signaling complexes. This drug is selective for mutant protein without affecting wild‐type BRAF, currently in Phase I/II clinical studies for multiple BRAF V600‐mutated solid tumors including melanoma [ 396 NCT05668585 Additionally, BTX‐9341 [ 397 NCT06515470 CG001419 NCT06636500 5.12 Clinical Challenges and Future Development Directions for PROTAC Drugs Despite remarkable progress in recent years, with vepdegestrant and other candidates entering Phase III trials and even submitting NDAs, this revolutionary technology still faces severe challenges on the path to commercialization [ 181 Oral bioavailability represents the largest technical bottleneck for PROTAC drugs. Since PROTAC molecular weights typically exceed 800 Da, far beyond ideal ranges for oral drugs, they universally possess unfavorable oral absorption characteristics including high molecular weight, multiple hydrogen bond donors/acceptors, and high polar surface area. For example, ARV‐110's recommended Phase II dose is 420 mg once daily, with only 23.8% oral bioavailability in rats [ 398 Safety challenges are equally concerning, with recent terminations of multiple PROTAC programs due to serious safety issues serving as warnings for the entire field. FHD‐609 [ 328 327 Facing these challenges, future PROTAC technology development requires multidimensional innovative breakthroughs. At the molecular design level, researchers are working on developing shorter, more rigid linkers to reduce molecular flexibility, exploring novel E3 ligase ligands for smaller, more stable alternatives, and introducing prodrug strategies to improve bioavailability through in vivo activation. Delivery technology innovation is also becoming important, including using lipid nanoparticles (LNPs) for enhanced stability, developing ADCs for precise targeting, and local administration strategies following GT20029's [ 355 For safety assessment, establishing more comprehensive cardiac toxicity evaluation models, developing PROTAC‐specific safety assessment indicators, utilizing humanized organ‐on‐chip technology for toxicity prediction, and constructing AI‐based toxicity prediction models are current research focuses. Next‐generation PROTAC technology development is also anticipated, including reversible PROTAC molecular design, multitarget PROTAC strategies, and novel E3 ligase development beyond traditional VHL, CRBN, and IAP systems [ 399 400 401 Despite current multiple challenges, with advancing science and technology and accumulating clinical experience, issues including oral bioavailability, safety, and mechanistic understanding are expected to be gradually resolved. 6 Delivery Systems for PROTACs: Challenges and Strategic Solutions PROTACs, as an emerging class of targeted protein degraders, have demonstrated immense therapeutic potential surpassing traditional inhibitors in a series of clinical trials. However, effectively delivering PROTACs to intracellular targets and ensuring their stability and bioavailability in complex biological environments remain core challenges that must be overcome to fully unleash their pharmacological activity. PROTAC molecules are often larger and more complex than traditional small molecule drugs, which leads to difficulties in crossing biological membranes, evading biological barriers, and avoiding nonspecific binding. To overcome these delivery hurdles, researchers have developed a variety of innovative strategies, which can be broadly categorized into two main approaches: structural optimization of the PROTAC molecule itself to enhance its cell permeability, and the use of various advanced delivery systems for its encapsulation or conjugation (Figure 3 FIGURE 3 Advanced delivery strategies for PROTACs. Delivery platforms, including exosomes, liposomes, antibodies, aptamers, and polymeric/nonorganic nanoparticles, have been developed to enhance the stability, bioavailability, tissue specificity, and cellular uptake of PROTACs. 6.1 Optimizing PROTAC Molecules for Enhanced Cell Permeability The passive diffusion of traditional small molecule drugs into cells generally adheres to the Ro5, where parameters such as molecular weight, lipophilicity, and the number of hydrogen bond donors and acceptors should fall within specific ranges to ensure good oral bioavailability and cell permeability. However, many PROTAC molecules, particularly chimeras linking two or more functional domains, often have molecular weights that exceed the Ro5 limits, falling into the eRo5 or even bRo5 categories [ 402 To address this issue, a “chemical endocytic medicinal chemistry” strategy has been proposed, aiming to actively promote PROTAC entry into cells via endocytic pathways through structural modifications [ 402 402 6.2 Advanced Delivery Systems: Constructing Multifunctional Vehicles In addition to structural optimization of the PROTAC molecule itself, encapsulating or conjugating PROTACs into various advanced delivery systems is another major category of strategies for addressing their delivery challenges. These systems aim to protect PROTACs from enzymatic degradation, improve their solubility, prolong their systemic circulation time, and achieve targeted delivery to specific cells or tissues (Figure 3 6.2.1 Conjugate‐Based Delivery Systems Conjugate delivery strategies achieve precise targeting and efficient delivery by covalently linking PROTAC molecules to biomolecules with specific delivery functions. 6.2.1.1 Antibody–PROTAC Conjugates Drawing on the successful experience of ADCs, DACs leverage the high specificity of antibodies to recognize specific cell surface antigens. Antibodies can precisely bind to receptors on the surface of target cells and mediate the internalization of the conjugated PROTACs into cells via receptor‐mediated endocytosis. The advantage of this strategy lies in its excellent cell and tissue specificity, which can effectively reduce the accumulation of PROTACs in nontarget cells, thereby lowering systemic toxicity, while enhancing PROTAC enrichment at target sites to improve efficacy. DACs represent a powerful platform for achieving precise tumor‐targeted delivery of PROTACs. Maneiro et al. [ 3 403 403 6.2.1.2 Aptamer–PROTAC Conjugates This emerging conjugation strategy utilizes nucleic acid molecules, such as aptamers or engineered oligonucleotides, as PROTAC delivery vehicles. Aptamers are nucleic acid molecules obtained through in vitro selection that can bind to specific target molecules with high affinity and specificity [ 404 405 406 6.2.2 Nanoparticle‐Based Delivery Systems Nanoparticles, as versatile drug delivery platforms, have garnered significant attention due to their nanoscale size, high drug loading capacity, and modifiability. They can effectively encapsulate PROTACs, protecting them from enzymatic degradation and rapid clearance, while promoting cellular uptake and targeted delivery through various mechanisms. 6.2.2.1 Liposomes Liposomes, versatile vesicles composed of one or more lipid bilayers surrounding an aqueous core, are highly effective carriers for delivering PROTACs due to their ability to encapsulate both hydrophilic and hydrophobic molecules. For PROTACs, which often suffer from poor water solubility, low bioavailability, and limited cell permeability due to their large molecular weight (>800 Da) and polar surfaces, liposomes offer a promising solution by encapsulating these molecules within the lipid bilayer or aqueous compartment. This encapsulation enhances in vivo stability, protects PROTACs from premature degradation, and minimizes nonspecific interactions with biological systems, thereby reducing off‐target effects and toxicity [ 404 407 408 409 75 404 6.2.2.2 Polymer‐Based Nanostructures These nanoparticles are fabricated from biodegradable polymers (e.g., PLGA, PLA), possessing good biocompatibility and controlled release characteristics. Polymeric NPs can encapsulate PROTACs in the form of micelles, nanospheres, or nanocapsules, providing drug protection and sustained release effects. Their surfaces are easily functionalized, allowing for attachment of targeting ligands to achieve specific cellular uptake, or to trigger PROTAC release in response to the tumor microenvironment. Recent advances demonstrate that stereocomplexation of P(LLA‐stat‐EtGly) and P(DLA‐stat‐EtGly) can tune melting temperature and crystallinity of polymers, directly impacting mechanical properties and drug release behavior without affecting hydrophilic/hydrophobic balance [ 410 410 411 410 411 411 6.2.2.3 Exosome‐Based Nanoparticles Exosome‐mediated PROTAC delivery systems represent a revolutionary drug delivery paradigm that demonstrates tremendous potential in the field of antiviral therapeutics. PROTACs constitute a class of bifunctional molecules capable of harnessing the cellular UPS for selective degradation of target proteins, while exosomes serve as naturally occurring nanoscale extracellular vesicles that possess excellent biocompatibility, stability, and the capacity to traverse biological barriers, thereby providing an optimal carrier platform for targeted PROTAC delivery [ 40 412 413 414 6.2.2.4 Nonorganic Nanoparticles Inorganic NPs, such as gold NPs, silica NPs, and magnetic NPs, have also been explored for PROTAC delivery. These inorganic nanomaterials generally possess good biocompatibility, ease of surface modification, and controllable physicochemical properties. By modifying the surface of NPs with amino or thiol groups, PROTACs can be conjugated and enter cells via endocytosis. A notable example is the development of NIR‐activatable PROTAC nanocages using UCNPs‐based MSNs. In this system, a photocaged PROTAC targeting BRD4 was loaded into UMSNs to construct NIR light‐activatable nanocages that could be activated upon 980 nm laser irradiation to release active PROTAC for TPD and cancer cell apoptosis [ 415 416 PROTAC delivery research is advancing toward multifunctional, intelligent, and targeted approaches. From the structural optimization of PROTAC molecules themselves to a diverse array of advanced delivery systems, each strategy offers a unique solution to the specific challenges faced in PROTAC delivery. Future research will likely combine the advantages of multiple strategies to develop more efficient and safer PROTAC delivery platforms, ultimately propelling these revolutionary drugs toward clinical application. 6.2.3 Key Challenges and Future Perspectives: Critical Insights on PROTAC Delivery Systems After thoroughly examining the current landscape of PROTAC technology, it is become clear that the field has reached a pivotal juncture. The ability to solve delivery challenges will ultimately determine whether these promising molecules can achieve their transformative potential. In our view, the delivery system puzzle represents both the most formidable barrier and the most exciting opportunity for innovation in the PROTAC arena. The fundamental challenge arises from an inherent paradox: PROTACs need to be large enough to simultaneously engage both the target protein and E3 ligase, yet must retain sufficient drug‐like properties for effective delivery. When molecular weights routinely exceed 1000 Da, conventional small molecule delivery principles simply fall short [ 417 Among the various delivery strategies explored, each presents distinct advantages and limitations that require careful consideration. Nanoparticle‐based systems, particularly LNPs, offer excellent protection against enzymatic degradation and enable targeted delivery through surface modifications [ 418 419 420 Looking ahead, several key developments could revolutionize PROTAC delivery. First, integrating artificial intelligence and machine learning could enable prediction of optimal delivery strategies based on PROTAC structure and target tissue characteristics [ 243 Solving the delivery challenge will require unprecedented collaboration between medicinal chemists, formulation scientists, clinicians, and regulatory experts. Based on the rapid progress we have witnessed and the creative solutions emerging from laboratories worldwide, we remain optimistic that while the delivery challenges facing PROTACs are formidable, they are ultimately surmountable. 7 Future Directions and Improvement Strategies for PROTAC Technology As PROTAC technology transitions from the proof‐of‐concept stage to the critical juncture of clinical application, the field is confronting unprecedented opportunities and challenges. While multiple PROTAC molecules have successfully entered clinical trials and demonstrated encouraging therapeutic efficacy, realizing their full potential as next‐generation precision medicine tools requires systematic optimization across multiple dimensions, including molecular design, delivery strategies, and clinical translation. Based on current technical bottlenecks and clinical needs, the future development of PROTAC technology can be categorized into six core directions. These developmental pathways will collectively propel TPD technology from laboratory settings toward broader clinical applications (Figure 4 FIGURE 4 Future directions and improvement strategies for PROTAC technology. Emerging areas of development are highlighted, such as the expansion of the E3 ligase toolbox, organ‐specific targeting, advanced molecular designs, prodrug strategies, and combination therapies. These innovations aim to overcome current limitations and broaden the therapeutic applicability of PROTACs. 7.1 Molecular Design and Pharmacokinetic Optimization 7.1.1 Strategies for Enhancing Ternary Complex Stability The core mechanism of PROTAC molecules relies on forming stable ternary complexes (POI–PROTAC–E3 ligase), but most current PROTAC molecules form ternary complexes with limited stability, directly impacting protein degradation efficiency [ 421 7.1.2 Improvement of Cellular Permeability and Oral Bioavailability Traditional PROTAC molecules, due to their large molecular weight (typically exceeding 800 Da) and multiple hydrogen bond donors and acceptors, often face challenges of poor cell membrane permeability and low oral bioavailability [ 422 252 7.1.3 Mechanistic Elucidation and Circumvention of the “Hook Effect” The “hook effect” represents a unique challenge for PROTAC technology, referring to the phenomenon where PROTAC molecules paradoxically exhibit decreased degradation efficiency at high concentrations [ 423 424 7.2 Expansion of E3 Ligase Toolbox 7.2.1 Development of Novel E3 Ligase Ligands Although the human genome encodes over 600 E3 ubiquitin ligases, current PROTAC design primarily relies on a few E3 ligases, such as CRBN, VHL, IAP, and MDM2. This limited E3 ligase selection significantly restricts the application scope and optimization space of PROTAC technology [ 425 7.2.2 Utilization of Tissue‐Specific E3 Ligases Different tissues and cell types exhibit significant variations in E3 ligase expression patterns, providing a natural foundation for achieving tissue‐specific protein degradation. For example, certain E3 ligases are highly expressed in the nervous system while showing low expression in peripheral tissues [ 426 427 7.2.3 Implementation of Tumor‐Selective Applications Tumor cells and normal cells exhibit systematic differences in E3 ligase expression, proteasome activity, cell cycle status, and other aspects [ 428 7.3 Development of Advanced Delivery Strategies 7.3.1 Application of Nanocarrier Systems Nanocarrier technology provides innovative solutions for addressing PROTAC molecule delivery challenges. Various nanodelivery systems, including LNPs, polymeric nanoparticles, and inorganic nanocarriers, are being utilized for PROTAC molecule encapsulation and delivery [ 429 430 7.3.2 Innovation in AOCs AOCs represent an important developmental direction for TPD technology. By conjugating PROTAC molecules with specific antibodies, AOCs can achieve highly specific cellular targeted delivery [ 431 7.3.3 Refinement of Prodrug Design Prodrug design holds unique value in PROTAC technology, not only improving drug physicochemical properties but also enabling conditional activation and targeted release [ 432 7.4 Development of Organ‐Specific PROTACs 7.4.1 Design of Blood–Brain Barrier Penetrating PROTACs Treatment of central nervous system diseases has consistently been a major challenge for PROTAC technology, primarily due to strict blood–brain barrier (BBB) restrictions on macromolecular drugs [ 433 434 7.4.2 Development of Kidney/Liver‐Targeted PROTACs The kidneys and liver, as major metabolic and excretory organs, play crucial roles in the development and progression of numerous diseases. Developing organ‐specific PROTAC molecules holds significant importance for treating kidney diseases (such as renal fibrosis, glomerular diseases) and liver diseases (such as hepatic fibrosis, fatty liver disease) [ 435 436 7.4.3 Application of Inhaled Formulations in Pulmonary Diseases Treatment of pulmonary diseases such as pulmonary fibrosis, asthma, and lung cancer can achieve local high‐concentration drug exposure through inhalation administration while reducing systemic side effects [ 437 7.5 Overcoming Clinical Translation Barriers 7.5.1 In‐Depth Study of Resistance Mechanisms Compared with traditional small molecule inhibitors, PROTAC molecules face unique resistance challenges. PROTAC resistance may arise from multiple levels: target protein mutations leading to decreased PROTAC binding ability, E3 ligase expression or functional abnormalities, proteasome system dysfunction, insufficient intracellular PROTAC concentrations, and others [ 438 439 7.5.2 Establishment of Predictive Biomarkers Personalized PROTAC therapy requires establishment of effective predictive biomarker systems. These biomarkers should predict patient responsiveness to specific PROTAC treatments, including both efficacy and toxicity [ 440 7.5.3 Optimization of Combination Treatment Strategies Combined application of PROTAC molecules with other therapeutic modalities holds tremendous potential. PROTACs can be combined with traditional chemotherapy drugs, targeted therapy drugs, immunotherapy drugs, radiotherapy, and others, improving therapeutic efficacy through synergistic actions of different mechanisms. For example, PROTAC degradation of antiapoptotic proteins can enhance chemotherapy sensitivity [ 441 442 7.6 Expansion of Therapeutic Areas 7.6.1 Targeted Treatment of Inflammatory Diseases Inflammatory diseases such as rheumatoid arthritis, inflammatory bowel disease, and systemic lupus erythematosus involve complex inflammatory signaling networks, with many key regulatory proteins difficult to target with traditional drugs [ 443 159 7.6.2 Protein Homeostasis Regulation in Age‐Related Diseases The aging process is accompanied by functional decline of protein homeostasis systems, leading to accumulation of harmful proteins and loss of key functional proteins. PROTAC technology can exert antiaging effects by selectively degrading aging‐related harmful proteins (such as key proteins in senescent cell antiapoptotic pathways). For example, PROTAC degraders of antiapoptotic proteins BCL‐XL and BCL‐2 have demonstrated significant antiaging effects [ 444 7.6.3 Conquering Undruggable Targets in Metabolic Diseases Metabolic diseases such as diabetes, obesity, and lipid metabolism disorders involve numerous metabolic regulatory proteins [ 445 446 447 448 Future development of PROTAC technology will advance simultaneously along multiple dimensions, from fundamental molecular design optimization to complex clinical translation applications. Each developmental direction contains tremendous innovative potential. With continuous integration of cutting‐edge technologies such as artificial intelligence, nanotechnology, and precision medicine, PROTACs are poised to become core technological platforms for next‐generation precision therapy. However, realizing this vision requires close collaboration among academia, industry, and regulatory agencies to collectively propel PROTAC technology from laboratory to clinic, ultimately benefiting patients worldwide. The next decade will be a critical period for PROTAC technology development, and we have reason to believe that this revolutionary technology will bring unprecedented breakthroughs to human health endeavors. 8 Conclusion and Prospects 8.1 Transformative Impact and Current Achievements The development of PROTACs represents a paradigmatic shift in drug discovery, fundamentally altering our approach to therapeutic intervention from traditional occupancy‐driven inhibition to event‐driven protein degradation. This comprehensive analysis reveals that PROTAC technology has successfully transitioned from academic curiosity to clinical reality within just two decades, achieving unprecedented milestones that validate its revolutionary potential. The successful progression of multiple PROTAC candidates through clinical trials, with vepdegestrant (ARV‐471) becoming the first to submit for US FDA approval based on Phase III data [ 181 449 450 385 402 8.2 Addressing Current Limitations and Emerging Solutions Despite these remarkable achievements, PROTAC technology continues to face significant challenges that require systematic resolution for broader clinical adoption. The molecular weight and polarity constraints that limit oral bioavailability remain formidable obstacles, as evidenced by the relatively high doses required for many clinical candidates and the associated manufacturing complexities. The “hook effect” phenomenon, where excessive concentrations paradoxically reduce degradation efficiency, necessitates careful dose optimization and represents a unique pharmacological challenge not encountered with traditional therapeutics [ 451 8.3 Future Directions and Transformative Potential Looking ahead, PROTAC technology stands poised to expand into entirely new therapeutic territories that were previously considered intractable. The successful targeting of cellular senescence pathways through selective degradation of antiapoptotic proteins opens unprecedented opportunities for addressing age‐related diseases and extending healthspan. The development of brain‐penetrant PROTACs promises to revolutionize treatment of neurodegenerative diseases, where protein aggregation and misfolding represent central pathological mechanisms. In autoimmune and inflammatory diseases, the ability to selectively degrade key regulatory proteins like IRAK4 and STAT6 offers more precise intervention strategies compared with broad immunosuppression [ 452 453 8.4 Transforming Modern Medicine The ultimate impact of PROTAC technology extends far beyond individual therapeutic applications, it represents a fundamental expansion of the druggable proteome and a new paradigm for addressing complex diseases. By enabling therapeutic intervention against proteins that have resisted conventional drug discovery efforts for decades, PROTACs are democratizing access to previously privileged targets and opening new avenues for treating rare diseases, cancer subtypes, and complex genetic disorders. The technology's unique ability to achieve catalytic, sub‐stoichiometric effects while potentially reducing off‐target toxicity positions it as a cornerstone of next‐generation precision medicine. As we stand at the threshold of the first PROTAC drug approvals, the field faces the exciting challenge of translating this revolutionary technology into broad clinical benefit. The successful resolution of current technical limitations, combined with continued innovation in molecular design, delivery strategies, and clinical application, will determine whether PROTACs fulfill their transformative potential. The convergence of advancing scientific understanding, technological sophistication, and clinical validation suggests that TPD will become an indispensable tool in the modern therapeutic arsenal, offering hope for patients with currently intractable diseases and fundamentally changing how we approach drug discovery and development in the decades to come. The journey from the first PROTAC entering clinical trials in 2019 to potential approval in 2025 represents not merely a technological achievement, but the dawn of a new era in medicine where the impossible becomes possible through the elegant manipulation of cellular protein homeostasis. Author Contributions M.L., Z.H.T., and J.Y. designed this study. G.F., S.L.C, Q.P.Z, N.Y. and Z.Y.S. collected related articles. G.F., S.L.C., Q.P.Z., N.Y., Z.Y.S., Z.J.L, and W.M.G. wrote the manuscript and completed the figures. M.L., Z.H.T., J.Y., and G.F. revised manuscripts and completed tables. G.F., Z.H.T. and J.Y. provided funding support. All authors reviewed and approved the final manuscript. Ethics Statement The authors have nothing to report. Conflicts of Interest The authors disclose no conflicts of interest. Acknowledgments This work is supported by the National Natural Science Foundation of China (82471623), Guangdong Natural Science Foundation (2025A1515010482), Shenzhen Medical Research Fund (A2403066), Shenzhen Natural Science Foundation (JCYJ20240813114423031), Shenzhen Nanshan District Science and Technology Plan Project (NSZD2023041), and the Key Project of the Hunan Provincial Natural Science Foundation University Joint Fund (2025JJ90128). We acknowledge BioRender.com for assisting in the creation of graphical figures. Data Availability Statement No data were used for the research described in the article. References 1 J. Jin Y. Wu Z. Zhao Small‐molecule PROTAC mediates targeted protein degradation to treat STAT3‐dependent epithelial cancer JCI Insight 7 22 2022 e160606 36509291 10.1172/jci.insight.160606 PMC9746828 2 A. A. Azad H. Gurney C. Underhill Phase 1 study of HP518, a PROTAC AR degrader in patients With mCRPC: Results on safety, pharmacokinetics, and anti‐tumor activity Investigational New Drugs 43 2 2025 435 445 40289067 10.1007/s10637-025-01533-8 3 M. A. Maneiro N. Forte M. M. Shchepinova Antibody–PROTAC conjugates enable HER2‐dependent targeted protein degradation of BRD4 ACS Chemical Biology 15 6 2020 1306 1312 32338867 10.1021/acschembio.0c00285 PMC7309268 4 S. J. Heidorn C. Milagre S. Whittaker Kinase‐dead BRAF and oncogenic RAS cooperate to drive tumor progression Through CRAF Cell 140 2 2010 209 221 20141835 10.1016/j.cell.2009.12.040 PMC2872605 5 J. H. Bushweller Targeting transcription factors in cancer—From undruggable to reality Nature Reviews Cancer 19 11 2019 611 624 31511663 10.1038/s41568-019-0196-7 PMC8820243 6 M. J. Henley A. N. Koehler Advances in targeting ‘undruggable’transcription factors With small molecules Nature Reviews Drug Discovery 20 9 2021 669 688 34006959 10.1038/s41573-021-00199-0 7 L. Shu A. Chen L. Li NRG1 regulates Fra‐1 transcription and metastasis of triple‐negative breast cancer cells via the c‐Myc ubiquitination as manipulated by ERK1/2‐mediated Fbxw7 phosphorylation Oncogene 41 6 2022 907 919 34992218 10.1038/s41388-021-02142-4 8 A. L. Hopkins C. R. Groom The druggable genome Nature Reviews Drug Discovery 1 9 2002 727 730 12209152 10.1038/nrd892 9 A. D. Buhimschi H. A. Armstrong M. Toure Targeting the C481S ibrutinib‐resistance mutation in Bruton's tyrosine kinase using PROTAC‐mediated degradation Biochemistry 57 26 2018 3564 3575 29851337 10.1021/acs.biochem.8b00391 10 Y. Sun N. Ding Y. Song Degradation of Bruton's tyrosine kinase mutants by PROTACs for potential treatment of ibrutinib‐resistant non‐Hodgkin lymphomas Leukemia 33 8 2019 2105 2110 30858551 10.1038/s41375-019-0440-x 11 Y. S. Arbel B.‐Z. Katz R. Gabizon Proteolysis targeting chimeras for BTK efficiently inhibit B‐cell receptor signaling and can overcome ibrutinib resistance in CLL cells Frontiers in Oncology 11 2021 646971 34055615 10.3389/fonc.2021.646971 PMC8159153 12 S. Cao L. Ma Y. Liu Proteolysis‐targeting chimera (PROTAC) modification of dovitinib enhances the antiproliferative effect Against FLT3‐ITD‐positive acute myeloid leukemia cells Journal of Medicinal Chemistry 64 22 2021 16497 16511 34694800 10.1021/acs.jmedchem.1c00996 13 K. M. Sakamoto K. B. Kim A. Kumagai Protacs: Chimeric molecules that target proteins to the Skp1–Cullin–F box complex for ubiquitination and degradation Proceedings of the National Academy of Sciences of the United States of America 98 15 2001 8554 8559 11438690 10.1073/pnas.141230798 PMC37474 14 D. P. Petrylak X. Gao N. J. Vogelzang First‐in‐human phase I study of ARV‐110, an androgen receptor (AR) PROTAC degrader in patients (pts) With metastatic castrate‐resistant prostate cancer (mCRPC) following enzalutamide (ENZ) and/or abiraterone (ABI)[Z] American Society of Clinical Oncology 157 2020 259 267 15 C. Arnold PROTAC protein degraders to drug the undruggable enter phase 3 trials Nature Medicine 30 11 2024 3030 3031 10.1038/d41591-024-00072-8 39379566 16 S. Ha G. Luo H. Xiang A Comprehensive Overview of Small‐Molecule Androgen Receptor Degraders: Recent Progress and Future Perspectives Journal of Medicinal Chemistry 65 24 2022 16128 16154 36459083 10.1021/acs.jmedchem.2c01487 17 C. Wang Y. Zhang J. Wang D. Xing VHL‐based PROTACs as potential therapeutic agents: Recent progress and perspectives European Journal of Medicinal Chemistry 227 2022 113906 34656901 10.1016/j.ejmech.2021.113906 18 M. Hay D. W. Thomas J. L. Craighead C. Economides J. Rosenthal Clinical development success rates for investigational drugs Nature Biotechnology 32 1 2014 40 51 10.1038/nbt.2786 24406927 19 Y.‐L. Tseng P.‐C. Lu C.‐C. Lee Degradation of neurodegenerative disease‐associated TDP‐43 aggregates and oligomers via a proteolysis‐targeting chimera Journal of Biomedical Science 30 1 2023 27 37101169 10.1186/s12929-023-00921-7 PMC10131537 20 X. Jiang J. Zhou Y. Wang PROTACs suppression of GSK‐3β, a crucial kinase in neurodegenerative diseases European Journal of Medicinal Chemistry 210 2021 112949 33097303 10.1016/j.ejmech.2020.112949 21 M. Peyman Study of new strategies for steatotic liver disease: SIRT1‐mediated modulation of VLDLR levels and evaluation of a soluble epoxyde hydrolase‐targeted PROTAC 2024 22 J. Huang Z. Ma Z. Yang Discovery of Ibrutinib‐based BTK PROTACs With in vivo anti‐inflammatory efficacy by inhibiting NF‐κB activation European Journal of Medicinal Chemistry 259 2023 115664 37487306 10.1016/j.ejmech.2023.115664 23 H. Wang S. Yuan Q. Zheng Dual inhibition of CDK4/6 and XPO1 induces senescence With acquired vulnerability to CRBN‐based PROTAC drugs Gastroenterology 166 6 2024 1130 1144 38262581 10.1053/j.gastro.2024.01.025 24 Y. Yang N. Jn‐Simon Y. He A BCL‐xL/BCL‐2 PROTAC effectively clears senescent cells in the liver and reduces MASH‐driven hepatocellular carcinoma in mice Nature Aging 5 3 2025 386 400 39890936 10.1038/s43587-025-00811-7 25 V. Reen M. D'Ambrosio P. P. Søgaard SMARCA4 regulates the NK‐mediated killing of senescent cells Science Advances 11 3 2025 eadn2811 39813356 10.1126/sciadv.adn2811 PMC11734740 26 M. Chang F. Gao G. Gnawali Selective elimination of senescent cancer cells by galacto‐modified PROTACs Journal of Medicinal Chemistry 67 9 2024 7301 7311 38635879 10.1021/acs.jmedchem.4c00152 PMC11227109 27 N. Y. Zhang D. Y. Hou X. J. Hu Nano proteolysis targeting chimeras (PROTACs) With anti‐hook effect for tumor therapy Angewandte Chemie International Edition 62 37 2023 e202308049 37486792 10.1002/anie.202308049 28 K. Moreau M. Coen A. X. Zhang Proteolysis‐targeting chimeras in drug development: A safety perspective British Journal of Pharmacology 177 8 2020 1709 1718 32022252 10.1111/bph.15014 PMC7070175 29 K. Li C. M. Crews PROTACs: Past, present and future Chemical Society Reviews 51 12 2022 5214 5236 35671157 10.1039/d2cs00193d PMC10237031 30 L. M. Simpson L. Glennie A. Brewer Target protein localization and its impact on PROTAC‐mediated degradation Cell Chemical Biology 29 10 2022 1482 1504 36075213 10.1016/j.chembiol.2022.08.004 31 D. C. Scott S. Dharuman E. Griffith Principles of paralog‐specific targeted protein degradation engaging the C‐degron E3 KLHDC2 Nature Communications 15 1 2024 8829 10.1038/s41467-024-52966-3 PMC11470957 39396041 32 R. Beveridge D. Kessler K. Rumpel Native Mass Spectrometry Can Effectively Predict PROTAC Efficacy ACS Central Science 6 7 2020 1223 1230 32724856 10.1021/acscentsci.0c00049 PMC7379389 33 M. S. Gadd A. Testa X. Lucas Structural basis of PROTAC cooperative recognition for selective protein degradation Nature Chemical Biology 13 5 2017 514 521 28288108 10.1038/nchembio.2329 PMC5392356 34 V. Haridas S. Dutta A. Munjal S. Singh Inhibitors to degraders: Changing paradigm in drug discovery Iscience 27 5 2024 109574 38646175 10.1016/j.isci.2024.109574 PMC11031827 35 X. Teng X. Zhao Y. Dai ClickRNA‐PROTAC for Tumor‐Selective Protein Degradation and Targeted Cancer Therapy Journal of the American Chemical Society 146 40 2024 27382 27391 39320981 10.1021/jacs.4c06402 36 Y. Y. Shi G. Fan R. Tan Treating ICB‐resistant cancer by inhibiting PD‐L1 via DHHC3 degradation induced by cell penetrating peptide‐induced chimera conjugates Cell Death and Disease 15 9 2024 701 39349454 10.1038/s41419-024-07073-y PMC11442653 37 Y. Chen Z. Xia U. Suwal Dual‐ligand PROTACS mediate superior target protein degradation in vitro and therapeutic efficacy in vivo Chemical Science 15 42 2024 17691 17701 39391379 10.1039/d4sc03555k PMC11462456 38 D. Park J. Izaguirre R. Coffey H. Xu Modeling the Effect of Cooperativity in Ternary Complex Formation and Targeted Protein Degradation Mediated by Heterobifunctional Degraders ACS Bio Med Chem Au 3 1 2023 74 86 10.1021/acsbiomedchemau.2c00037 PMC10125322 37101604 39 S. Shi Y. Du Y. Zou Rational Design for Nitroreductase (NTR)‐Responsive Proteolysis Targeting Chimeras (PROTACs) Selectively Targeting Tumor Tissues Journal of Medicinal Chemistry 65 6 2022 5057 5071 35175763 10.1021/acs.jmedchem.1c02221 40 D. P. Bondeson B. E. Smith G. M. Burslem Lessons in PROTAC Design From Selective Degradation With a Promiscuous Warhead Cell Chemical Biology 25 1 2018 78 87 29129718 10.1016/j.chembiol.2017.09.010 PMC5777153 41 M. Ignatov A. Jindal S. Kotelnikov High Accuracy Prediction of PROTAC Complex Structures Journal of the American Chemical Society 145 13 2023 7123 7135 36961978 10.1021/jacs.2c09387 PMC10240388 42 H. Nassar A. C. Sarnow I. Celik Ternary Complex Modeling, Induced Fit Docking and Molecular Dynamics Simulations as a Successful Approach for the Design of VHL‐Mediated PROTACs Targeting the Kinase FLT3 Archiv der Pharmazie ‐ Chemistry in Life Sciences 358 4 2025 e3126 10.1002/ardp.202500102 PMC11995253 40223615 43 D. Weerakoon R. J. Carbajo L. De Maria C. Tyrchan H. Zhao Impact of PROTAC Linker Plasticity on the Solution Conformations and Dissociation of the Ternary Complex Journal of Chemical Information and Modeling 62 2 2022 340 349 35018781 10.1021/acs.jcim.1c01036 44 J. S. Schneekloth Jr. F. N. Fonseca M. Koldobskiy Chemical genetic control of protein levels: Selective in vivo targeted degradation Journal of the American Chemical Society 126 12 2004 3748 3754 15038727 10.1021/ja039025z 45 G. E. Winter D. L. Buckley J. Paulk Drug Development. Phthalimide conjugation as a strategy for in vivo target protein degradation Science 348 6241 2015 1376 1381 25999370 10.1126/science.aab1433 PMC4937790 46 K. Raina J. Lu Y. Qian PROTAC‐induced BET protein degradation as a therapy for castration‐resistant prostate cancer Proceedings of the National Academy of Sciences of the United States of America 113 26 2016 7124 7129 27274052 10.1073/pnas.1521738113 PMC4932933 47 X. Han C. Wang C. Qin Discovery of ARD‐69 as a Highly Potent Proteolysis Targeting Chimera (PROTAC) Degrader of Androgen Receptor (AR) for the Treatment of Prostate Cancer Journal of Medicinal Chemistry 62 2 2019 941 964 30629437 10.1021/acs.jmedchem.8b01631 48 R. G. Guenette S. W. Yang J. Min B. Pei P. R. Potts Target and tissue selectivity of PROTAC degraders Chemical Society Reviews 51 14 2022 5740 5756 35587208 10.1039/d2cs00200k 49 S. Park D. Kim W. Lee Discovery of pan‐IAP degraders via a CRBN recruiting mechanism European Journal of Medicinal Chemistry 245 Pt 2 2023 114910 36410083 10.1016/j.ejmech.2022.114910 50 J. Hines S. Lartigue H. Dong Y. Qian C. M. Crews MDM2‐Recruiting PROTAC Offers Superior, Synergistic Antiproliferative Activity via Simultaneous Degradation of BRD4 and Stabilization of p53 Cancer Research 79 1 2019 251 262 30385614 10.1158/0008-5472.CAN-18-2918 PMC6318015 51 X. Zhang V. M. Crowley T. G. Wucherpfennig M. M. Dix B. F. Cravatt Electrophilic PROTACs that degrade nuclear proteins by engaging DCAF16 Nature Chemical Biology 15 7 2019 737 746 31209349 10.1038/s41589-019-0279-5 PMC6592777 52 S. He J. Ma Y. Fang Homo‐PROTAC mediated suicide of MDM2 to treat non‐small cell lung cancer Acta Pharmaceutica Sinica B 11 6 2021 1617 1628 34221872 10.1016/j.apsb.2020.11.022 PMC8245912 53 G. M. Burslem B. E. Smith A. C. Lai The Advantages of Targeted Protein Degradation Over Inhibition: An RTK Case Study Cell Chemical Biology 25 1 2018 67 77 29129716 10.1016/j.chembiol.2017.09.009 PMC5831399 54 M. Békés D. R. Langley C. M. Crews PROTAC targeted protein degraders: The Past is prologue Nature Reviews Drug Discovery 21 3 2022 181 200 35042991 10.1038/s41573-021-00371-6 PMC8765495 55 D. Antermite S. D. Friis J. R. Johansson Late‐stage synthesis of heterobifunctional molecules for PROTAC applications via ruthenium‐catalysed C‒H amidation Nature Communications 14 1 2023 8222 10.1038/s41467-023-43789-9 PMC10716378 38086825 56 M. Surowka C. Klein A pivotal decade for bispecific antibodies? Mabs 16 1 2024 2321635 38465614 10.1080/19420862.2024.2321635 PMC10936642 57 Z. Liu M. Hu Y. Yang An overview of PROTACs: A promising drug discovery paradigm Molecular Biomedicine 3 1 2022 46 36536188 10.1186/s43556-022-00112-0 PMC9763089 58 W. Wang Q. Zhou T. Jiang A novel small‐molecule PROTAC selectively promotes tau clearance to improve cognitive functions in Alzheimer‐Like models Theranostics 11 11 2021 5279 5295 33859747 10.7150/thno.55680 PMC8039949 59 P. Pfaff K. T. G. Samarasinghe C. M. Crews E. M. Carreira Reversible Spatiotemporal Control of Induced Protein Degradation by Bistable PhotoPROTACs ACS Central Science 5 10 2019 1682 1690 31660436 10.1021/acscentsci.9b00713 PMC6813558 60 X. Sun H. Gao Y. Yang PROTACs: Great opportunities for academia and industry Signal Transduction and Targeted Therapy 4 2019 64 31885879 10.1038/s41392-019-0101-6 PMC6927964 61 H. Zhou T. Zhou W. Yu Targeted Protein Degradation by KLHDC2 Ligands Identified by High Throughput Screening BioRxiv 2025 10.7554/eLife.106844 PMC12169847 40522120 62 J. Gao L. Yang S. Lei Stimuli‐activatable PROTACs for precise protein degradation and cancer therapy Science Bulletin (Beijing) 68 10 2023 1069 1085 10.1016/j.scib.2023.04.028 37169612 63 T. A. Lee E. Y. Tsai S. H. Liu Post‐translational Modification of PD‐1: Potential Targets for Cancer Immunotherapy Cancer Research 84 6 2024 800 807 38231470 10.1158/0008-5472.CAN-23-2664 PMC10940856 64 L. Mittal R. K. Tonk A. Awasthi S. Asthana Targeting cryptic‐orthosteric site of PD‐L1 for inhibitor identification using structure‐guided approach Archives of Biochemistry and Biophysics 713 2021 109059 34673001 10.1016/j.abb.2021.109059 65 R. V. Mancuso K. Welzenbach P. Steinberger S. Krähenbühl G. Weitz‐Schmidt Downstream effect profiles discern different mechanisms of integrin αLβ2 inhibition Biochemical Pharmacology 119 2016 42 55 27613223 10.1016/j.bcp.2016.09.002 66 P. S. Dragovich T. H. Pillow R. A. Blake Antibody‐Mediated Delivery of Chimeric BRD4 Degraders. Part 2: Improvement of In Vitro Antiproliferation Activity and In Vivo Antitumor Efficacy Journal of Medicinal Chemistry 64 5 2021 2576 2607 33596073 10.1021/acs.jmedchem.0c01846 67 A. Ikeuchi H. Nakano T. Kamiya T. Yamane Y. Kawarasaki A method for reverse interactome analysis: High‐resolution mapping of interdomain interaction network in Dam1 complex and its specific disorganization based on the interaction domain expression Biotechnology Progress 26 4 2010 945 953 20730753 10.1002/btpr.403 68 H. Oh S. Lee Y. Oh Kv7/KCNQ potassium channels in cortical hyperexcitability and juvenile seizure‐related death in Ank2‐mutant mice Nature Communications 14 1 2023 3547 10.1038/s41467-023-39203-z PMC10272139 37321992 69 N. H. Murray C. R. M. Asquith Z. Fang Small‐molecule inhibition of the archetypal UbiB protein COQ8 Nature Chemical Biology 19 2 2023 230 238 36302899 10.1038/s41589-022-01168-3 PMC9898131 70 S. Zeng Y. Jin H. Xia Discovery of highly efficient CRBN‐recruiting HPK1‐PROTAC as a potential chemical tool for investigation of scaffolding roles in TCR signaling Bioorganic Chemistry 143 2024 107016 38086239 10.1016/j.bioorg.2023.107016 71 M. Gazorpak K. M. Hugentobler D. Paul Harnessing PROTAC technology to combat stress hormone receptor activation Nature Communications 14 1 2023 8177 10.1038/s41467-023-44031-2 PMC10710461 38071198 72 C. P. Tinworth H. Lithgow L. Dittus PROTAC‐Mediated Degradation of Bruton's Tyrosine Kinase Is Inhibited by Covalent Binding ACS Chemical Biology 14 3 2019 342 347 30807093 10.1021/acschembio.8b01094 73 L. M. Gockel V. Pfeifer F. Baltes Design, synthesis, and characterization of PROTACs targeting the androgen receptor in prostate and lung cancer models Archiv Der Pharmazie 355 5 2022 e2100467 35128717 10.1002/ardp.202100467 74 Y. Xiong Y. Zhong H. Yim Bridged Proteolysis Targeting Chimera (PROTAC) Enables Degradation of Undruggable Targets Journal of the American Chemical Society 144 49 2022 22622 22632 36448571 10.1021/jacs.2c09255 PMC9772293 75 A. Chan R. M. Haley M. A. Najar Lipid‐mediated intracellular delivery of recombinant bioPROTACs for the rapid degradation of undruggable proteins Nature Communications 15 1 2024 5808 10.1038/s41467-024-50235-x PMC11237011 38987546 76 S. F. Bakhoum Targeting the undruggable Science 380 6640 2023 47 10.1126/science.adg7671 37023189 77 S. Imaide K. M. Riching N. Makukhin Trivalent PROTACs enhance protein degradation via combined avidity and cooperativity Nature Chemical Biology 17 11 2021 1157 1167 34675414 10.1038/s41589-021-00878-4 PMC7611906 78 Y. Wang G. Yang X. Zhang Antitumor Effect of Anti‐c‐Myc Aptamer‐Based PROTAC for Degradation of the c‐Myc Protein Advanced science (Weinheim) 11 26 2024 e2309639 10.1002/advs.202309639 PMC11234457 38682443 79 Y. Jiang Q. Deng H. Zhao Development of Stabilized Peptide‐Based PROTACs Against Estrogen Receptor α ACS Chemical Biology 13 3 2018 628 635 29271628 10.1021/acschembio.7b00985 80 I. Cardoso J. Stamnaes J. T. Andersen Transglutaminase 2 interactions With extracellular matrix proteins as probed With celiac disease autoantibodies FEBS Journal 282 11 2015 2063 2075 25808416 10.1111/febs.13276 81 N. Roehlen M. Muller Z. Nehme Treatment of HCC With claudin‐1‐specific antibodies suppresses carcinogenic signaling and reprograms the tumor microenvironment Journal of Hepatology 78 2 2023 343 355 36309131 10.1016/j.jhep.2022.10.011 82 T. Xu F. Zhang D. Chen Interrogating heterogeneity of cysteine‐engineered antibody‐drug conjugates and antibody‐oligonucleotide conjugates by capillary zone electrophoresis‐mass spectrometry Mabs 15 1 2023 2229102 37381585 10.1080/19420862.2023.2229102 PMC10312020 83 K. O. Nagornov N. Gasilova A. N. Kozhinov Drug‐to‐Antibody Ratio Estimation via Proteoform Peak Integration in the Analysis of Antibody‐Oligonucleotide Conjugates With Orbitrap Fourier Transform Mass Spectrometry Analytical Chemistry 93 38 2021 12930 12937 34519496 10.1021/acs.analchem.1c02247 84 L. Wang Y. Ke Q. He A novel ROR1‐targeting antibody‐PROTAC conjugate promotes BRD4 degradation for solid tumor treatment Theranostics 15 4 2025 1238 1254 39816690 10.7150/thno.102531 PMC11729552 85 K. Chan P. S. Sathyamurthi M. A. Queisser Antibody‐Proteolysis Targeting Chimera Conjugate Enables Selective Degradation of Receptor‐Interacting Serine/Threonine‐Protein Kinase 2 in HER2+ Cell Lines Bioconjugate Chemistry 34 11 2023 2049 2054 37917829 10.1021/acs.bioconjchem.3c00366 PMC10655034 86 L. Yang Y. Yang J. Zhang Sequential responsive nano‐PROTACs for precise intracellular delivery and enhanced degradation efficacy in colorectal cancer therapy Signal Transduction and Targeted Therapy 9 1 2024 275 39419977 10.1038/s41392-024-01983-1 PMC11486899 87 Y. Liu H. Wang M. Ding Ultrasound‐Activated PROTAC Prodrugs Overcome Immunosuppression to Actuate Efficient Deep‐Tissue Sono‐Immunotherapy in Orthotopic Pancreatic Tumor Mouse Models Nano Letters 24 28 2024 8741 8751 38953486 10.1021/acs.nanolett.4c02287 88 Q. Xu X. Hu I. Ullah Biomimetic Hybrid PROTAC Nanovesicles Block Multiple DNA Repair Pathways to Overcome Temozolomide Resistance Against Orthotopic Glioblastoma Advanced Materials 37 29 2025 e2504253 40347032 10.1002/adma.202504253 89 V. Subbotin G. Fiksel Modeling multi‐needle injection Into solid tumor American Journal of Cancer Research 9 10 2019 2209 2215 31720083 PMC6834475 90 H. M. Eltaher L. A. Blokpoel Ferreras A. R. Jalal J. E. Dixon Direct contact‐mediated non‐viral gene therapy using thermo‐sensitive hydrogel‐coated dressings Biomaterials Advances 143 2022 213177 36371970 10.1016/j.bioadv.2022.213177 91 N. W. Keiser E. Cant S. Sitaraman A. Shoemark M. P. Limberis Restoring Ciliary Function: Gene Therapeutics for Primary Ciliary Dyskinesia Human Gene Therapy 34 17–18 2023 821 835 37624733 10.1089/hum.2023.102 92 M. M. Chang L. Gaidukov G. Jung Small‐molecule control of antibody N‐glycosylation in engineered mammalian cells Nature Chemical Biology 15 7 2019 730 736 31110306 10.1038/s41589-019-0288-4 93 A. Greer‐Short A. Greenwood E. C. Leon AAV9‐mediated MYBPC3 gene therapy With optimized expression cassette enhances cardiac function and survival in MYBPC3 cardiomyopathy models Nature Communications 16 1 2025 2196 10.1038/s41467-025-57481-7 PMC11880196 40038304 94 R. D. Koilkonda H. Yu T. H. Chou Safety and effects of the vector for the Leber hereditary optic neuropathy gene therapy clinical trial JAMA ophthalmology 132 4 2014 409 420 24457989 10.1001/jamaophthalmol.2013.7630 PMC4266107 95 M. Kostic L. H. Jones Critical Assessment of Targeted Protein Degradation as a Research Tool and Pharmacological Modality Trends in Pharmacological Sciences 41 5 2020 305 317 32222318 10.1016/j.tips.2020.02.006 PMC7202367 96 W. He S. Zeng C. Xu Streamlined collaboration can boost CRISPR gene therapies for rare diseases Nature 631 8019 2024 28 10.1038/d41586-024-02132-y 38956334 97 F. A. Voza B. J. Byrne Y. Y. Ortiz Codon‐Optimized and de novo‐Synthesized E‐Selectin/AAV2 Dose‐Response Study for Vascular Regeneration Gene Therapy Annals of Surgery 280 4 2024 570 583 38975668 10.1097/SLA.0000000000006436 PMC11379359 98 G. Li S. S. Lin Z. L. Yu A PARP1 PROTAC as a novel strategy Against PARP inhibitor resistance via promotion of ferroptosis in p53‐positive breast cancer Biochemical Pharmacology 206 2022 115329 36309080 10.1016/j.bcp.2022.115329 99 K. Salokas X. Liu T. Öhman Physical and functional interactome atlas of human receptor tyrosine kinases EMBO Reports 23 6 2022 e54041 35384245 10.15252/embr.202154041 PMC9171411 100 S. Solouki A. August W. Huang Non‐receptor tyrosine kinase signaling in autoimmunity and therapeutic implications Pharmacology & Therapeutics 201 2019 39 50 31082431 10.1016/j.pharmthera.2019.05.008 PMC6738557 101 A. Odelgard E. Hägglund L. Guy S. G. E. Andersson Phylogeny and Expansion of Serine/Threonine Kinases in Phagocytotic Bacteria in the Phylum Planctomycetota Genome Biology and Evolution 16 4 2024 evae068 38547507 10.1093/gbe/evae068 PMC11032199 102 Z. Du C. M. Lovly Mechanisms of receptor tyrosine kinase activation in cancer Molecular Cancer 17 1 2018 58 29455648 10.1186/s12943-018-0782-4 PMC5817791 103 X. Wang Z. Qin W. Qiu Novel EGFR inhibitors Against resistant L858R/T790M/C797S mutant for intervention of non‐small cell lung cancer European Journal of Medicinal Chemistry 277 2024 116711 39094277 10.1016/j.ejmech.2024.116711 104 R. B. Kargbo Potent PROTACs Targeting EGFR Mutants in Drug Discovery Acs Medicinal Chemistry Letters 13 12 2022 1835 1836 36518691 10.1021/acsmedchemlett.2c00459 PMC9743937 105 H. Y. Zhao X. Y. Yang H. Lei Discovery of potent small molecule PROTACs targeting mutant EGFR European Journal of Medicinal Chemistry 208 2020 112781 32883633 10.1016/j.ejmech.2020.112781 106 Y. Wang L. Han F. Liu Targeted degradation of anaplastic lymphoma kinase by gold nanoparticle‐based multi‐headed proteolysis targeting chimeras Colloids and Surfaces B, Biointerfaces 188 2020 110795 31991291 10.1016/j.colsurfb.2020.110795 107 C. Ren N. Sun Y. Kong Structure‐based discovery of SIAIS001 as an oral bioavailability ALK degrader constructed From Alectinib European Journal of Medicinal Chemistry 217 2021 113335 33751979 10.1016/j.ejmech.2021.113335 108 N. Sun C. Ren Y. Kong Development of a Brigatinib degrader (SIAIS117) as a potential treatment for ALK positive cancer resistance European Journal of Medicinal Chemistry 193 2020 112190 32179332 10.1016/j.ejmech.2020.112190 109 C. Ren N. Sun H. Liu Discovery of a Brigatinib Degrader SIAIS164018 With Destroying Metastasis‐Related Oncoproteins and a Reshuffling Kinome Profile Journal of Medicinal Chemistry 64 13 2021 9152 9165 34138566 10.1021/acs.jmedchem.1c00373 110 G. Du J. Jiang Q. Wu Discovery of a Potent Degrader for Fibroblast Growth Factor Receptor 1/2 Angewandte Chemie International Edition in English 60 29 2021 15905 15911 10.1002/anie.202101328 PMC8324087 33915015 111 Y. Uemoto C. A. Lin B. Wang Selective degradation of FGFR1/2 overcomes antiestrogen resistance in ER+ breast cancer With FGFR1/2 alterations Cancer Letters 619 2025 217668 40127812 10.1016/j.canlet.2025.217668 PMC12143203 112 M. Javle S. Roychowdhury R. K. Kelley Infigratinib (BGJ398) in previously treated patients With advanced or metastatic cholangiocarcinoma With FGFR2 fusions or rearrangements: Mature results From a multicentre, open‐label, single‐arm, phase 2 study Lancet Gastroenterol Hepatol 6 10 2021 803 815 34358484 10.1016/S2468-1253(21)00196-5 113 M. M. Hurley J. D. Coffin T. Doetschman FGF receptor inhibitor BGJ398 partially rescues osteoarthritis‐Like phenotype in older high molecular weight FGF2 transgenic mice via multiple mechanisms Scientific Reports 12 1 2022 15968 36153352 10.1038/s41598-022-20269-6 PMC9509331 114 G. Botrus P. Raman T. Oliver T. Bekaii‐Saab Infigratinib (BGJ398): An investigational agent for the treatment of FGFR‐altered intrahepatic cholangiocarcinoma Expert Opinion on Investigational Drugs 30 4 2021 309 316 33307867 10.1080/13543784.2021.1864320 115 Y. Shan R. Si J. Wang Discovery of novel anti‐angiogenesis agents. Part 11: Development of PROTACs based on active molecules With potency of promoting vascular normalization European Journal of Medicinal Chemistry 205 2020 112654 32750566 10.1016/j.ejmech.2020.112654 116 F. H. Shah Y. S. Nam J. Y. Bang Targeting vascular endothelial growth receptor‐2 (VEGFR‐2): Structural biology, functional insights, and therapeutic resistance Archives of Pharmacal Research 48 5 2025 404 425 40341988 10.1007/s12272-025-01545-1 PMC12106596 117 Z. Zhang M. Xu R. Shi Natural Compound‐Rhein and PROTACs Unleash Potent VEGFR‐2 Degraders Chemistry and Biodiversity 21 8 2024 e202400753 38818648 10.1002/cbdv.202400753 118 R. Yerushalmi K. A. Gelmon S. Leung Insulin‐Like growth factor receptor (IGF‐1R) in breast cancer subtypes Breast Cancer Research and Treatment 132 1 2012 131 142 21574055 10.1007/s10549-011-1529-8 119 Y. Chen X. Yuan M. Tang Degrading FLT3‐ITD protein by proteolysis targeting chimera (PROTAC) Bioorganic Chemistry 119 2022 105508 34959180 10.1016/j.bioorg.2021.105508 120 W. Ye X. Wu X. Wang The proteolysis targeting chimera GMB‐475 combined With dasatinib for the treatment of chronic myeloid leukemia With BCR::ABL1 mutants Frontiers in pharmacology 13 2022 931772 36263131 10.3389/fphar.2022.931772 PMC9574342 121 X. Yu W. H. Guo H. Lin Discovery of a potent BTK and IKZF1/3 triple degrader Through reversible covalent BTK PROTAC development Current Research in Chemical Biology 2 2022 100029 36712232 10.1016/j.crchbi.2022.100029 PMC9879287 122 R. Gabizon A. Shraga P. Gehrtz Efficient Targeted Degradation via Reversible and Irreversible Covalent PROTACs Journal of the American Chemical Society 142 27 2020 11734 11742 32369353 10.1021/jacs.9b13907 PMC7349657 123 G. M. Burslem D. P. Bondeson C. M. Crews Scaffold hopping enables direct access to more potent PROTACs With in vivo activity Chemical Communications 56 50 2020 6890 6892 32519703 10.1039/d0cc02201b PMC7404552 124 Y. Yang H. Gao X. Sun Global PROTAC Toolbox for Degrading BCR‐ABL Overcomes Drug‐Resistant Mutants and Adverse Effects Journal of Medicinal Chemistry 63 15 2020 8567 8583 32657579 10.1021/acs.jmedchem.0c00967 125 T. S. Yu S. Q. Han L. J. Wang Effects of orelabrutinib, a BTK inhibitor, on antibody‐mediated platelet destruction in primary immune thrombocytopenia British Journal of Haematology 206 4 2025 1186 1199 40069128 10.1111/bjh.20045 126 L. E. Nyhoff A. S. Griffith E. S. Clark Btk Supports Autoreactive B Cell Development and Protects Against Apoptosis but Is Expendable for Antigen Presentation Journal of Immunology 207 12 2021 2922 2932 10.4049/jimmunol.2000558 PMC9117567 34799428 127 A. C. Lai M. Toure D. Hellerschmied Modular PROTAC Design for the Degradation of Oncogenic BCR‐ABL Angewandte Chemie International Edition in English 55 2 2016 807 810 10.1002/anie.201507634 PMC4733637 26593377 128 Q. Zhao C. Ren L. Liu Discovery of SIAIS178 as an Effective BCR‐ABL Degrader by Recruiting Von Hippel‐Lindau (VHL) E3 Ubiquitin Ligase Journal of Medicinal Chemistry 62 20 2019 9281 9298 31539241 10.1021/acs.jmedchem.9b01264 129 B. Tong J. N. Spradlin L. F. T. Novaes A Nimbolide‐Based Kinase Degrader Preferentially Degrades Oncogenic BCR‐ABL ACS Chemical Biology 15 7 2020 1788 1794 32568522 10.1021/acschembio.0c00348 PMC7891886 130 Y. H. Jin M. C. Lu Y. Wang Azo‐PROTAC: Novel Light‐Controlled Small‐Molecule Tool for Protein Knockdown Journal of Medicinal Chemistry 63 9 2020 4644 4654 32153174 10.1021/acs.jmedchem.9b02058 131 H. Liu X. Ding L. Liu Discovery of novel BCR‐ABL PROTACs based on the cereblon E3 ligase design, synthesis, and biological evaluation European Journal of Medicinal Chemistry 223 2021 113645 34217059 10.1016/j.ejmech.2021.113645 132 H. Liu R. Sun C. Ren Construction of an IMiD‐based azide library as a kit for PROTAC research Organic & Biomolecular Chemistry 19 1 2021 166 170 33226388 10.1039/d0ob02120b 133 M. He C. Cao Z. Ni PROTACs: Great opportunities for academia and industry (an update From 2020 to 2021) Signal Transduction and Targeted Therapy 7 1 2022 181 35680848 10.1038/s41392-022-00999-9 PMC9178337 134 J. J. Lee R. A. H. van de Ven E. Zaganjor Inhibition of epithelial cell migration and Src/FAK signaling by SIRT3 Proceedings of the National Academy of Sciences of the United States of America 115 27 2018 7057 7062 29915029 10.1073/pnas.1800440115 PMC6142214 135 C. P. El Haibi P. K. Sharma R. Singh PI3Kp110‐, Src‐, FAK‐dependent and DOCK2‐independent migration and invasion of CXCL13‐stimulated prostate cancer cells Molecular Cancer 9 2010 85 20412587 10.1186/1476-4598-9-85 PMC2873439 136 R. P. Law J. Nunes C. W. Chung Discovery and Characterisation of Highly Cooperative FAK‐Degrading PROTACs Angewandte Chemie International Edition in English 60 43 2021 23327 23334 10.1002/anie.202109237 34416073 137 I. Menzl T. Zhang A. Berger‐Becvar A kinase‐independent role for CDK8 in BCR‐ABL1(+) leukemia Nature Communications 10 1 2019 4741 10.1038/s41467-019-12656-x PMC6802219 31628323 138 B. Jiang Y. Gao J. Che Discovery and resistance mechanism of a selective CDK12 degrader Nature Chemical Biology 17 6 2021 675 683 33753926 10.1038/s41589-021-00765-y PMC8590456 139 W. Chen Y. Wu C. Yang CDK9 targeting PROTAC L055 inhibits ERα‐positive breast cancer Biomedicine & Pharmacotherapy 177 2024 116972 38906024 10.1016/j.biopha.2024.116972 140 C. Yang C. A. Boyson M. Di Liberto CDK4/6 Inhibitor PD 0332991 Sensitizes Acute Myeloid Leukemia to Cytarabine‐Mediated Cytotoxicity Cancer Research 75 9 2015 1838 1845 25744718 10.1158/0008-5472.CAN-14-2486 PMC4417369 141 S. Hati M. Zallocchi R. Hazlitt AZD5438‐PROTAC: A selective CDK2 degrader that protects Against cisplatin‐ and noise‐induced hearing loss European Journal of Medicinal Chemistry 226 2021 113849 34560429 10.1016/j.ejmech.2021.113849 PMC8608744 142 M. Teng J. Jiang Z. He Development of CDK2 and CDK5 Dual Degrader TMX‐2172 Angewandte Chemie International Edition in English 59 33 2020 13865 13870 10.1002/anie.202004087 PMC7703486 32415712 143 M. De Dominici P. Porazzi Y. Xiao Selective inhibition of Ph‐positive ALL cell growth Through kinase‐dependent and ‐independent effects by CDK6‐specific PROTACs Blood 135 18 2020 1560 1573 32040545 10.1182/blood.2019003604 PMC7193186 144 J. Hu J. Wei H. Yim Potent and Selective Mitogen‐Activated Protein Kinase Kinase 1/2 (MEK1/2) Heterobifunctional Small‐molecule Degraders Journal of Medicinal Chemistry 63 24 2020 15883 15905 33284613 10.1021/acs.jmedchem.0c01609 PMC7770057 145 A. Prahallad C. Sun S. Huang Unresponsiveness of colon cancer to BRAF(V600E) inhibition Through feedback activation of EGFR Nature 483 7387 2012 100 103 22281684 10.1038/nature10868 146 I. You E. C. Erickson K. A. Donovan Discovery of an AKT Degrader With Prolonged Inhibition of Downstream Signaling Cell Chemical Biology 27 1 2020 66 73 31859249 10.1016/j.chembiol.2019.11.014 PMC6980747 147 E. C. Erickson I. You G. Perry Multiomic profiling of breast cancer cells uncovers stress MAPK‐associated sensitivity to AKT degradation Science Signaling 17 825 2024 eadf2670 38412255 10.1126/scisignal.adf2670 PMC10949348 148 X. Yu J. Xu L. Xie Design, Synthesis, and Evaluation of Potent, Selective, and Bioavailable AKT Kinase Degraders Journal of Medicinal Chemistry 64 24 2021 18054 18081 34855399 10.1021/acs.jmedchem.1c01476 PMC8819633 149 X. Mu L. Bai Y. Xu J. Wang H. Lu Protein targeting chimeric molecules specific for dual bromodomain 4 (BRD4) and Polo‐Like kinase 1 (PLK1) proteins in acute myeloid leukemia cells Biochemical and Biophysical Research Communications 521 4 2020 833 839 31708096 10.1016/j.bbrc.2019.11.007 150 T. Niu K. Li L. Jiang Noncovalent CDK12/13 dual inhibitors‐based PROTACs degrade CDK12‐Cyclin K complex and induce synthetic lethality With PARP inhibitor European Journal of Medicinal Chemistry 228 2022 114012 34864331 10.1016/j.ejmech.2021.114012 151 Z. Li B. J. Pinch C. M. Olson Development and Characterization of a Wee1 Kinase Degrader Cell Chemical Biology 27 1 2020 57 65 31735695 10.1016/j.chembiol.2019.10.013 PMC6980656 152 B. Adhikari J. Bozilovic M. Diebold PROTAC‐mediated degradation reveals a non‐catalytic function of AURORA‐A kinase Nature Chemical Biology 16 11 2020 1179 1188 32989298 10.1038/s41589-020-00652-y PMC7610535 153 X. Liu Y. Zhang S. Wu Palmatine induces G2/M phase arrest and mitochondrial‐associated pathway apoptosis in colon cancer cells by targeting AURKA Biochemical Pharmacology 175 2020 113933 32224138 10.1016/j.bcp.2020.113933 154 W. Yue H. Y. Zhang H. Schatten T. G. Meng Q. Y. Sun CtIP regulates G2/M transition and bipolar spindle assembly During mouse oocyte meiosis Journal of Genetics and Genomics 51 12 2024 1435 1446 39277031 10.1016/j.jgg.2024.09.005 155 C. Donoghue M. Cubillos‐Rojas N. Gutierrez‐Prat Optimal linker length for small molecule PROTACs that selectively target p38α and p38β for degradation European Journal of Medicinal Chemistry 201 2020 112451 32634680 10.1016/j.ejmech.2020.112451 156 D. R. McDonald D. Brown F. A. Bonilla R. S. Geha Interleukin receptor‐associated kinase‐4 deficiency impairs Toll‐Like receptor‐dependent innate antiviral immune responses Journal of Allergy and Clinical Immunology 118 6 2006 1357 1362 17157666 10.1016/j.jaci.2006.08.006 157 L. Fu J. Zhang B. Shen Discovery of Highly Potent and Selective IRAK1 Degraders to Probe Scaffolding Functions of IRAK1 in ABC DLBCL Journal of Medicinal Chemistry 64 15 2021 10878 10889 34279092 10.1021/acs.jmedchem.1c00103 158 Z. Tao X. Wu Targeting Transcription Factors in Cancer: From ”Undruggable“ to “Druggable” Methods in Molecular Biology 2594 2023 107 131 36264492 10.1007/978-1-0716-2815-7_9 PMC9724592 159 M. Dai S. Radhakrishnan R. Li Targeted Protein Degradation: An Important Tool for Drug Discovery for ”Undruggable“ Tumor Transcription Factors Technology in Cancer Research and Treatment 21 2022 15330338221095950 35466792 10.1177/15330338221095950 PMC9047787 160 F. Sias S. Zoroddu R. Migheli L. Bagella Untangling the Role of MYC in Sarcomas and Its Potential as a Promising Therapeutic Target International Journal of Molecular Sciences 26 5 2025 10.3390/ijms26051973 PMC11900228 40076599 161 S. Lier A. Sellmer F. Orben A novel Cereblon E3 ligase modulator With antitumor activity in gastrointestinal cancer Bioorganic Chemistry 119 2022 105505 34838332 10.1016/j.bioorg.2021.105505 162 Y. Li C. Liu X. Zhang CCT5 induces epithelial‐mesenchymal transition to promote gastric cancer lymph node metastasis by activating the Wnt/β‐catenin signalling pathway British Journal of Cancer 126 12 2022 1684 1694 35194191 10.1038/s41416-022-01747-0 PMC9174209 163 Q. Liu J. Wang Z. Guo CMTM6 promotes hepatocellular carcinoma progression Through stabilizing β‐catenin Cancer Letters 583 2024 216585 38101607 10.1016/j.canlet.2023.216585 164 H. Liao X. Li L. Zhao A PROTAC peptide induces durable β‐catenin degradation and suppresses Wnt‐dependent intestinal cancer Cell Discovery 6 2020 35 32550000 10.1038/s41421-020-0171-1 PMC7280531 165 E. P. Booy R. Howard O. Marushchak The RNA helicase RHAU (DHX36) suppresses expression of the transcription factor PITX1 Nucleic Acids Research 42 5 2014 3346 3361 24369427 10.1093/nar/gkt1340 PMC3950718 166 M. Hluchý P. Gajdušková I. Ruiz de Los Mozos CDK11 regulates pre‐mRNA splicing by phosphorylation of SF3B1 Nature 609 7928 2022 829 834 36104565 10.1038/s41586-022-05204-z 167 R. A. Gama‐Brambila J. Chen J. Zhou A PROTAC targets splicing factor 3B1 Cell Chemical Biology 28 11 2021 1616 1627 34048672 10.1016/j.chembiol.2021.04.018 168 J. Zhou K. Tison H. Zhou STAT5 and STAT3 balance shapes dendritic cell function and tumour immunity Nature 643 8071 2025 519 528 40369063 10.1038/s41586-025-09000-3 PMC12240842 169 X. Xie T. Yu X. Li Recent advances in targeting the ”undruggable“ proteins: From drug discovery to clinical trials Signal Transduction and Targeted Therapy 8 1 2023 335 37669923 10.1038/s41392-023-01589-z PMC10480221 170 D. P. Petrylak X. Gao N. J. Vogelzang First‐in‐human phase I study of ARV‐110, an androgen receptor (AR) PROTAC degrader in patients (pts) With metastatic castrate‐resistant prostate cancer (mCRPC) following enzalutamide (ENZ) and/or abiraterone (ABI) Journal of Clinical Oncology 38 15 2020 3500 3500 171 L. Zhao X. Han J. Lu D. McEachern S. Wang A highly potent PROTAC androgen receptor (AR) degrader ARD‐61 effectively inhibits AR‐positive breast cancer cell growth in vitro and tumor growth in vivo Neoplasia 22 10 2020 522 532 32928363 10.1016/j.neo.2020.07.002 PMC7498667 172 X. Han L. Zhao W. Xiang Discovery of Highly Potent and Efficient PROTAC Degraders of Androgen Receptor (AR) by Employing Weak Binding Affinity VHL E3 Ligase Ligands Journal of Medicinal Chemistry 62 24 2019 11218 11231 31804827 10.1021/acs.jmedchem.9b01393 173 X. Han L. Zhao W. Xiang Strategies Toward Discovery of Potent and Orally Bioavailable Proteolysis Targeting Chimera Degraders of Androgen Receptor for the Treatment of Prostate Cancer Journal of Medicinal Chemistry 64 17 2021 12831 12854 34431670 10.1021/acs.jmedchem.1c00882 PMC8880306 174 W. Xiang L. Zhao X. Han Discovery of ARD‐2585 as an Exceptionally Potent and Orally Active PROTAC Degrader of Androgen Receptor for the Treatment of Advanced Prostate Cancer Journal of Medicinal Chemistry 64 18 2021 13487 13509 34473519 10.1021/acs.jmedchem.1c00900 PMC8855934 175 A. D. Takwale S. H. Jo Y. U. Jeon Design and characterization of cereblon‐mediated androgen receptor proteolysis‐targeting chimeras European Journal of Medicinal Chemistry 208 2020 112769 32961381 10.1016/j.ejmech.2020.112769 176 K. Dalal M. Roshan‐Moniri A. Sharma Selectively targeting the DNA‐binding domain of the androgen receptor as a prospective therapy for prostate cancer Journal of Biological Chemistry 289 38 2014 26417 26429 25086042 10.1074/jbc.M114.553818 PMC4176249 177 K. Sienkiewicz C. Yang B. M. Paschal A. Ratan Genomic analyses of the metastasis‐derived prostate cancer cell lines LNCaP, VCaP, and PC3‐AR Prostate 82 4 2022 442 451 34951700 10.1002/pros.24290 PMC8792310 178 G. T. Lee N. Nagaya J. Desantis Effects of MTX‐23, a Novel PROTAC of Androgen Receptor Splice Variant‐7 and Androgen Receptor, on CRPC Resistant to Second‐Line Antiandrogen Therapy Molecular Cancer Therapeutics 20 3 2021 490 499 33277442 10.1158/1535-7163.MCT-20-0417 179 E. S. Antonarakis C. Lu H. Wang AR‐V7 and resistance to enzalutamide and abiraterone in prostate cancer New England Journal of Medicine 371 11 2014 1028 1038 25184630 10.1056/NEJMoa1315815 PMC4201502 180 M. M. Regan G. Viale M. G. Mastropasqua Re‐evaluating adjuvant breast cancer trials: Assessing hormone receptor status by immunohistochemical versus extraction assays Journal of the National Cancer Institute 98 21 2006 1571 1581 17077359 10.1093/jnci/djj415 181 E. P. Hamilton C. Ma M. De Laurentiis VERITAC‐2: A Phase III study of vepdegestrant, a PROTAC ER degrader, versus fulvestrant in ER+/HER2‐ advanced breast cancer Future Oncology 20 32 2024 2447 2455 39072356 10.1080/14796694.2024.2377530 PMC11524203 182 A. S. Lu M. Rouhimoghadam C. K. Arnatt E. J. Filardo A. K. Salem Proteolytic Targeting Chimeras With Specificity for Plasma Membrane and Intracellular Estrogen Receptors Molecular Pharmaceutics 18 3 2021 1455 1469 33600191 10.1021/acs.molpharmaceut.1c00018 PMC9671096 183 B. L. Roberts Z. X. Ma A. Gao Two‐Stage Strategy for Development of Proteolysis Targeting Chimeras and its Application for Estrogen Receptor Degraders ACS Chemical Biology 15 6 2020 1487 1496 32255606 10.1021/acschembio.0c00140 184 B. Hu J. Hu Complete elimination of estrogen receptor α by PROTAC estrogen receptor α degrader ERD‐148 in breast cancer cells Breast Cancer Research and Treatment 203 2 2024 383 396 37847455 10.1007/s10549-023-07136-2 185 Y. Dai N. Yue J. Gong Development of cell‐permeable peptide‐based PROTACs targeting estrogen receptor α European Journal of Medicinal Chemistry 187 2020 111967 31865016 10.1016/j.ejmech.2019.111967 186 T. L. Gonzalez M. Hancock S. Sun Targeted degradation of activating estrogen receptor α ligand‐binding domain mutations in human breast cancer Breast Cancer Research and Treatment 180 3 2020 611 622 32067153 10.1007/s10549-020-05564-y 187 D. R. Cochrane S. Bernales B. M. Jacobsen Role of the androgen receptor in breast cancer and preclinical analysis of enzalutamide Breast Cancer Research 16 1 2014 R7 24451109 10.1186/bcr3599 PMC3978822 188 R. R. Shah E. De Vita P. S. Sathyamurthi Structure‐Guided Design and Optimization of Covalent VHL‐Targeted Sulfonyl Fluoride PROTACs Journal of Medicinal Chemistry 67 6 2024 4641 4654 38478885 10.1021/acs.jmedchem.3c02123 PMC10982999 189 V. Ritter F. Krautter D. Klein V. Jendrossek J. Rudner Bcl‐2/Bcl‐xL inhibitor ABT‐263 overcomes hypoxia‐driven radioresistence and improves radiotherapy Cell Death and Disease 12 7 2021 694 34257274 10.1038/s41419-021-03971-7 PMC8277842 190 E. González‐Gualda M. Pàez‐Ribes B. Lozano‐Torres Galacto‐conjugation of Navitoclax as an efficient strategy to increase senolytic specificity and reduce platelet toxicity Aging Cell 19 4 2020 e13142 32233024 10.1111/acel.13142 PMC7189993 191 Y. Jia L. Han C. L. Ramage Co‐targeting BCL‐XL and BCL‐2 by PROTAC 753B eliminates leukemia cells and enhances efficacy of chemotherapy by targeting senescent cells Haematologica 108 10 2023 2626 37078252 10.3324/haematol.2022.281915 PMC10542840 192 Y. Jia Q. Zhang W. Zhang Abstract CC09‐01: Targeting BCL‐XL/BCL‐2 by PROTAC 753b effectively eliminates AML cells and enhances efficacy of chemotherapy by targeting senescent cells Molecular Cancer Therapeutics 20 12 2021 193 X. Zhang D. Thummuri Y. He Utilizing PROTAC technology to address the on‐target platelet toxicity associated With inhibition of BCL‐X L Chemical Communications 55 98 2019 14765 14768 31754664 10.1039/c9cc07217a PMC7057339 194 Y. Xu Z. Lei J. Zhu L. Wan Mivebresib synergized With PZ703b, a novel Bcl‐xl PROTAC degrader, induces apoptosis in bladder cancer cells via the mitochondrial pathway Biochemical and Biophysical Research Communications 623 2022 120 126 35921705 10.1016/j.bbrc.2022.07.045 195 D. Lv P. Pal X. Liu Development of a BCL‐xL and BCL‐2 dual degrader With improved anti‐leukemic activity Nature Communications 12 1 2021 6896 10.1038/s41467-021-27210-x PMC8617031 34824248 196 S. Khan J. Wiegand P. Zhang BCL‐X(L) PROTAC degrader DT2216 synergizes With sotorasib in preclinical models of KRAS(G12C)‐mutated cancers Journal of Hematology & Oncology 15 1 2022 23 35260176 10.1186/s13045-022-01241-3 PMC8905794 197 S. Khan X. Zhang D. Lv A selective BCL‐X(L) PROTAC degrader achieves safe and potent antitumor activity Nature Medicine 25 12 2019 1938 1947 10.1038/s41591-019-0668-z PMC6898785 31792461 198 C. Xu H. Liu C. J. Pirozzi TP53 wild‐type/PPM1D mutant diffuse intrinsic pontine gliomas are sensitive to a MDM2 antagonist Acta Neuropathol Commun 9 1 2021 178 34732238 10.1186/s40478-021-01270-y PMC8565061 199 J. Yang Y. Li A. Aguilar Simple Structural Modifications Converting a Bona fide MDM2 PROTAC Degrader Into a Molecular Glue Molecule: A Cautionary Tale in the Design of PROTAC Degraders Journal of Medicinal Chemistry 62 21 2019 9471 9487 31560543 10.1021/acs.jmedchem.9b00846 PMC7354697 200 B. Wang J. Liu I. Tandon Development of MDM2 degraders based on ligands derived From Ugi reactions: Lessons and discoveries European Journal of Medicinal Chemistry 219 2021 113425 33862513 10.1016/j.ejmech.2021.113425 PMC8165035 201 A. Goerg G. Piendl V. Albert Mdm2 targeting via PROteolysis TArgeting Chimeras (PROTAC) is efficient in p53 wildtype, p53‐mutated, and abemaciclib‐resistant estrogen receptor‐positive cell lines and superior to mdm2 inhibition BMC cancer 25 1 2025 978 40452017 10.1186/s12885-025-14361-z PMC12128487 202 J. Martínez‐Quintanilla D. Cabot D. Sabia Precision Oncology and Systemic Targeted Therapy in Pseudomyxoma Peritonei Clinical Cancer Research 30 18 2024 4082 4099 39018564 10.1158/1078-0432.CCR-23-4072 PMC11393541 203 A. G. Chapdelaine G. C. Ku G. Sun M. K. Ayrapetov The Targeted Degradation of BRAF V600E Reveals the Mechanisms of Resistance to BRAF‐Targeted Treatments in Colorectal Cancer Cells Cancers (Basel) 15 24 2023 5805 38136350 10.3390/cancers15245805 PMC10741866 204 G. Posternak X. Tang P. Maisonneuve Functional characterization of a PROTAC directed Against BRAF mutant V600E Nature Chemical Biology 16 11 2020 1170 1178 32778845 10.1038/s41589-020-0609-7 PMC7862923 205 R. Gutzmer D. Stroyakovskiy H. Gogas Atezolizumab, vemurafenib, and cobimetinib as first‐line treatment for unresectable advanced BRAF(V600) mutation‐positive melanoma (IMspire150): Primary analysis of the randomised, double‐blind, placebo‐controlled, phase 3 trial Lancet 395 10240 2020 1835 1844 32534646 10.1016/S0140-6736(20)30934-X 206 D. S. Hong M. G. Fakih J. H. Strickler KRAS(G12C) Inhibition With Sotorasib in Advanced Solid Tumors New England Journal of Medicine 383 13 2020 1207 1217 32955176 10.1056/NEJMoa1917239 PMC7571518 207 S. I. Ou P. A. Jänne T. A. Leal First‐in‐Human Phase I/IB Dose‐Finding Study of Adagrasib (MRTX849) in Patients With Advanced KRAS(G12C) Solid Tumors (KRYSTAL‐1) Journal of Clinical Oncology 40 23 2022 2530 2538 35167329 10.1200/JCO.21.02752 PMC9362872 208 M. J. Bond L. Chu D. A. Nalawansha K. Li C. M. Crews Targeted Degradation of Oncogenic KRAS(G12C) by VHL‐Recruiting PROTACs ACS Central Science 6 8 2020 1367 1375 32875077 10.1021/acscentsci.0c00411 PMC7453568 209 L. Li Y. Wu Z. Yang Discovery of KRas G12C‐IN‐3 and Pomalidomide‐based PROTACs as degraders of endogenous KRAS G12C With potent anticancer activity Bioorganic Chemistry 117 2021 105447 34715575 10.1016/j.bioorg.2021.105447 210 F. Yang Y. Wen C. Wang Efficient targeted oncogenic KRAS(G12C) degradation via first reversible‐covalent PROTAC European Journal of Medicinal Chemistry 230 2022 114088 35007863 10.1016/j.ejmech.2021.114088 211 M. Yang K. Liu P. Chen Bromodomain‐containing protein 4 (BRD4) as an epigenetic regulator of fatty acid metabolism genes and ferroptosis Cell Death and Disease 13 10 2022 912 36309482 10.1038/s41419-022-05344-0 PMC9617950 212 L. Liu C. Yang B. P. Lavayen Targeted BRD4 protein degradation by dBET1 ameliorates acute ischemic brain injury and improves functional outcomes associated With reduced neuroinflammation and oxidative stress and preservation of blood‐brain barrier integrity Journal of Neuroinflammation 19 1 2022 168 35761277 10.1186/s12974-022-02533-8 PMC9237998 213 G. Li L. Ma C. Feng MZ1, a BRD4 inhibitor, exerted its anti‐cancer effects by suppressing SDC1 in glioblastoma BMC cancer 24 1 2024 220 38365636 10.1186/s12885-024-11966-8 PMC10870565 214 L. He C. Chen G. Gao K. Xu Z. Ma ARV‐825‐induced BRD4 protein degradation as a therapy for thyroid carcinoma Aging 12 5 2020 4547 4557 32163373 10.18632/aging.102910 PMC7093165 215 X. Liao X. Qian Z. Zhang ARV‐825 Demonstrates Antitumor Activity in Gastric Cancer via MYC‐Targets and G2M‐Checkpoint Signaling Pathways Frontiers in oncology 11 2021 753119 34733788 10.3389/fonc.2021.753119 PMC8559897 216 C. Qin Y. Hu B. Zhou Discovery of QCA570 as an Exceptionally Potent and Efficacious Proteolysis Targeting Chimera (PROTAC) Degrader of the Bromodomain and Extra‐Terminal (BET) Proteins Capable of Inducing Complete and Durable Tumor Regression Journal of Medicinal Chemistry 61 15 2018 6685 6704 30019901 10.1021/acs.jmedchem.8b00506 PMC6545111 217 M. Actis J. Cresser‐Brown E. A. Caine Evaluation of Cereblon‐Directing Warheads for the Development of Orally Bioavailable PROTACs Journal of Medicinal Chemistry 68 3 2025 3591 3611 39813384 10.1021/acs.jmedchem.4c02709 218 R. P. Nowak Y. Xiong N. Kirmani Structure‐Guided Design of a ”Bump‐and‐Hole“ Bromodomain‐Based Degradation Tag Journal of Medicinal Chemistry 64 15 2021 11637 11650 34279939 10.1021/acs.jmedchem.1c00958 219 K. Xu Z. J. Wu A. C. Groner EZH2 oncogenic activity in castration‐resistant prostate cancer cells is Polycomb‐independent Science 338 6113 2012 1465 1469 23239736 10.1126/science.1227604 PMC3625962 220 D. Du D. Xu L. Zhu Structure‐Guided Development of Small‐Molecule PRC2 Inhibitors Targeting EZH2‐EED Interaction Journal of Medicinal Chemistry 64 12 2021 8194 8207 34077206 10.1021/acs.jmedchem.0c02261 221 A. Testa S. J. Hughes X. Lucas J. E. Wright A. Ciulli Structure‐Based Design of a Macrocyclic PROTAC Angewandte Chemie International Edition in English 59 4 2020 1727 1734 10.1002/anie.201914396 PMC7004083 31746102 222 G. Xue K. Wang D. Zhou H. Zhong Z. Pan Light‐Induced Protein Degradation With Photocaged PROTACs Journal of the American Chemical Society 141 46 2019 18370 18374 31566962 10.1021/jacs.9b06422 223 F. Potjewyd A. W. Turner J. Beri Degradation of Polycomb Repressive Complex 2 With an EED‐Targeted Bivalent Chemical Degrader Cell Chemical Biology 27 1 2020 47 56 31831267 10.1016/j.chembiol.2019.11.006 PMC7004250 224 A. Ma E. Stratikopoulos K. S. Park Discovery of a first‐in‐class EZH2 selective degrader Nature Chemical Biology 16 2 2020 214 222 31819273 10.1038/s41589-019-0421-4 PMC6982609 225 Z. Liu X. Hu Q. Wang Design and Synthesis of EZH2‐Based PROTACs to Degrade the PRC2 Complex for Targeting the Noncatalytic Activity of EZH2 Journal of Medicinal Chemistry 64 5 2021 2829 2848 33606537 10.1021/acs.jmedchem.0c02234 226 Y. Tu Y. Sun S. Qiao Design, Synthesis, and Evaluation of VHL‐Based EZH2 Degraders to Enhance Therapeutic Activity Against Lymphoma Journal of Medicinal Chemistry 64 14 2021 10167 10184 34196564 10.1021/acs.jmedchem.1c00460 227 J. E. Thomas 2nd M. Wang W. Jiang Discovery of Exceptionally Potent, Selective, and Efficacious PROTAC Degraders of CBP and p300 Proteins Journal of Medicinal Chemistry 66 12 2023 8178 8199 37276143 10.1021/acs.jmedchem.3c00492 228 R. Vannam J. Sayilgan S. Ojeda Targeted degradation of the enhancer lysine acetyltransferases CBP and p300 Cell Chemical Biology 28 4 2021 503 514 33400925 10.1016/j.chembiol.2020.12.004 229 V. Tejwani T. Carroll T. Macartney PROTAC‐mediated conditional degradation of the WRN helicase as a potential strategy for selective killing of cancer cells With microsatellite instability Scientific Reports 14 1 2024 20824 39242638 10.1038/s41598-024-71160-5 PMC11379953 230 X. Li Y. Yao F. Wu Y. Song A proteolysis‐targeting chimera molecule selectively degrades ENL and inhibits malignant gene expression and tumor growth Journal of Hematology & Oncology 15 1 2022 41 35395864 10.1186/s13045-022-01258-8 PMC8994274 231 M. F. Mabanglo B. Wilson M. Noureldin Crystal structures of DCAF1‐PROTAC‐WDR5 ternary complexes provide insight Into DCAF1 substrate specificity Nature Communications 15 1 2024 10165 10.1038/s41467-024-54500-x PMC11585590 39580491 232 J. Cantley X. Ye E. Rousseau Selective PROTAC‐mediated degradation of SMARCA2 is efficacious in SMARCA4 mutant cancers Nature Communications 13 1 2022 6814 10.1038/s41467-022-34562-5 PMC9649729 36357397 233 X. Liu A. Wang Y. Shi PROTACs in Epigenetic Cancer Therapy: Current Status and Future Opportunities Molecules (Basel, Switzerland) 28 3 2023 1217 36770884 10.3390/molecules28031217 PMC9919707 234 L. Garnar‐Wortzel T. R. Bishop S. Kitamura Chemical Inhibition of ENL/AF9 YEATS Domains in Acute Leukemia ACS Central Science 7 5 2021 815 830 34079898 10.1021/acscentsci.0c01550 PMC8161486 235 X. Yu D. Li J. Kottur A selective WDR5 degrader inhibits acute myeloid leukemia in patient‐derived mouse models Science Translational Medicine 13 613 2021 eabj1578 34586829 10.1126/scitranslmed.abj1578 PMC8500670 236 M. Mota S. R. Sweha M. Pun Targeting SWI/SNF ATPases in H3.3K27M diffuse intrinsic pontine gliomas Proceedings of the National Academy of Sciences of the United States of America 120 18 2023 e2221175120 37094128 10.1073/pnas.2221175120 PMC10161095 237 W. Farnaby M. Koegl M. J. Roy BAF complex vulnerabilities in cancer demonstrated via structure‐based PROTAC design Nature Chemical Biology 15 7 2019 672 680 31178587 10.1038/s41589-019-0294-6 PMC6600871 238 P. D. Fischer E. Papadopoulos J. M. Dempersmier A biphenyl inhibitor of eIF4E targeting an internal binding site enables the design of cell‐permeable PROTAC‐degraders European Journal of Medicinal Chemistry 219 2021 113435 33892272 10.1016/j.ejmech.2021.113435 PMC8846605 239 Y. Sun Y. Zhang X. Chen Discovery of a potent and selective proteolysis targeting chimera (PROTAC) degrader of NSD3 histone methyltransferase European Journal of Medicinal Chemistry 239 2022 114528 35717870 10.1016/j.ejmech.2022.114528 240 X. Jiang J. Wang X. Deng Role of the tumor microenvironment in PD‐L1/PD‐1‐mediated tumor immune escape Molecular Cancer 18 1 2019 10 30646912 10.1186/s12943-018-0928-4 PMC6332843 241 M. He C. Cao Z. Ni PROTACs: Great opportunities for academia and industry (an update From 2020 to 2021) Signal Transduction and Targeted Therapy 7 1 2022 181 35680848 10.1038/s41392-022-00999-9 PMC9178337 242 Q. Wang J. Wang D. Yu Benzosceptrin C induces lysosomal degradation of PD‐L1 and promotes antitumor immunity by targeting DHHC3 Cell Reports Medicine 5 2 2024 101357 38237597 10.1016/j.xcrm.2023.101357 PMC10897506 243 Y. Y. Shi D. R. Dong G. Fan M. Y. Dai M. Liu A cyclic peptide‐based PROTAC induces intracellular degradation of palmitoyltransferase and potently decreases PD‐L1 expression in human cervical cancer cells Frontiers in immunology 14 2023 1237964 37849747 10.3389/fimmu.2023.1237964 PMC10577221 244 M. Y. Dai Y. Y. Shi A. J. Wang High‐potency PD‐1/PD‐L1 degradation induced by Peptide‐PROTAC in human cancer cells Cell Death and Disease 13 11 2022 924 36333311 10.1038/s41419-022-05375-7 PMC9636179 245 R. Xu H. Zhou L. Bai Discovery of SD‐436: A Potent, Highly Selective and Efficacious STAT3 PROTAC Degrader Capable of Achieving Complete and Long‐Lasting Tumor Regression Journal of Medicinal Chemistry 67 22 2024 20495 20513 39509603 10.1021/acs.jmedchem.4c01946 246 L. Schindler L. C. D. Smyth J. Bernhagen M. B. Hampton N. Dickerhof Macrophage migration inhibitory factor (MIF) enhances hypochlorous acid production in phagocytic neutrophils Redox Biology 41 2021 101946 33823474 10.1016/j.redox.2021.101946 PMC8047225 247 A. Majumdar A. D. Petrescu Y. Xiong N. Noy Nuclear translocation of cellular retinoic acid‐binding protein II is regulated by retinoic acid‐controlled SUMOylation Journal of Biological Chemistry 286 49 2011 42749 42757 21998312 10.1074/jbc.M111.293464 PMC3234969 248 N. Ohoka G. Tsuji T. Shoda Development of Small Molecule Chimeras That Recruit AhR E3 Ligase to Target Proteins ACS Chemical Biology 14 12 2019 2822 2832 31580635 10.1021/acschembio.9b00704 249 Y. Wu C. Pu Y. Fu NAMPT‐targeting PROTAC promotes antitumor immunity via suppressing myeloid‐derived suppressor cell expansion Acta Pharmaceutica Sinica B 12 6 2022 2859 2868 35755293 10.1016/j.apsb.2021.12.017 PMC9214341 250 J. Cheng J. Zhang S. He Photoswitchable PROTACs for Reversible and Spatiotemporal Regulation of NAMPT and NAD() Angewandte Chemie International Edition in English 63 12 2024 e202315997 10.1002/anie.202315997 38282119 251 K. Bi J. Cheng S. He Discovery of Highly Potent Nicotinamide Phosphoribosyltransferase Degraders for Efficient Treatment of Ovarian Cancer Journal of Medicinal Chemistry 66 1 2023 1048 1062 36563407 10.1021/acs.jmedchem.2c01990 252 H. Osawa T. Kurohara T. Ito N. Shibata Y. Demizu CRBN ligand expansion for hematopoietic prostaglandin D(2) synthase (H‐PGDS) targeting PROTAC design and their in vitro ADME profiles Bioorganic & Medicinal Chemistry 84 2023 117259 37018877 10.1016/j.bmc.2023.117259 253 Y. Murakami H. Osawa T. Kurohara Structure‐activity relationship study of PROTACs Against hematopoietic prostaglandin D(2) synthase RSC Medicinal Chemistry 13 12 2022 1495 1503 36561070 10.1039/d2md00284a PMC9749925 254 X. Wang D. T. Weaver The ups and downs of DNA repair biomarkers for PARP inhibitor therapies American Journal of Cancer Research 1 3 2011 301 327 21968427 PMC3180060 255 D. Fu Y. Yuan F. Qin Design, synthesis and biological evaluation of tyrosinase‐targeting PROTACs European Journal of Medicinal Chemistry 226 2021 113850 34628235 10.1016/j.ejmech.2021.113850 256 L. C. Czuba K. M. Hillgren P. W. Swaan Post‐translational modifications of transporters Pharmacology & Therapeutics 192 2018 88 99 29966598 10.1016/j.pharmthera.2018.06.013 PMC6263853 257 A. Bensimon M. D. Pizzagalli F. Kartnig Targeted Degradation of SLC Transporters Reveals Amenability of Multi‐Pass Transmembrane Proteins to Ligand‐Induced Proteolysis Cell Chemical Biology 27 6 2020 728 739 32386596 10.1016/j.chembiol.2020.04.003 PMC7303955 258 N. Park J. Marquez T. K. Pham Cereblon contributes to cardiac dysfunction by degrading Cav1.2α European Heart Journal 43 20 2022 1973 1989 35190817 10.1093/eurheartj/ehac072 259 C. E. Powell G. Du J. W. Bushman Selective degradation‐inducing probes for studying cereblon (CRBN) biology RSC Medicinal Chemistry 12 8 2021 1381 1390 34458741 10.1039/d0md00382d PMC8372211 260 C. Maniaci S. J. Hughes A. Testa Homo‐PROTACs: Bivalent small‐molecule dimerizers of the VHL E3 ubiquitin ligase to induce self‐degradation Nature Communications 8 1 2017 830 10.1038/s41467-017-00954-1 PMC5635026 29018234 261 M. Hanafi X. Chen N. Neamati Discovery of a Napabucasin PROTAC as an Effective Degrader of the E3 Ligase ZFP91 Journal of Medicinal Chemistry 64 3 2021 1626 1648 33506674 10.1021/acs.jmedchem.0c01897 PMC8083113 262 W. Bi L. Zhu Z. Zeng Investigations Into the role of 26S proteasome non‐ATPase regulatory subunit 13 in neuroinflammation Neuroimmunomodulation 21 6 2014 331 337 24642793 10.1159/000357811 263 J. J. Chi H. Li Z. Zhou A novel strategy to block mitotic progression for targeted therapy EBioMedicine 49 2019 40 54 31669221 10.1016/j.ebiom.2019.10.013 PMC6945239 264 B. K. Neilsen B. Chakraborty J. L. McCall WDR5 supports colon cancer cells by promoting methylation of H3K4 and suppressing DNA damage BMC cancer 18 1 2018 673 29925347 10.1186/s12885-018-4580-6 PMC6011590 265 C. Rébé R. Filomenko M. Raveneau Identification of biological markers of liver X receptor (LXR) activation at the cell surface of human monocytes PLoS ONE 7 11 2012 e48738 23185273 10.1371/journal.pone.0048738 PMC3504056 266 H. Xu N. Ohoka H. Yokoo Development of Agonist‐Based PROTACs Targeting Liver X Receptor Frontiers in Chemistry 9 2021 674967 34124002 10.3389/fchem.2021.674967 PMC8187946 267 J. Li X. Chen A. Lu C. Liang Targeted protein degradation in cancers: Orthodox PROTACs and Beyond Innovation (Camb) 4 3 2023 100413 37033156 10.1016/j.xinn.2023.100413 PMC10074253 268 J. A. Marteijn L. T. van der Meer J. J. Smit The ubiquitin ligase Triad1 inhibits myelopoiesis Through UbcH7 and Ubc13 interacting domains Leukemia 23 8 2009 1480 1489 19340006 10.1038/leu.2009.57 269 V. M. Vergara A. R. Mayer E. Damaraju K. Hutchison V. D. Calhoun The effect of preprocessing pipelines in subject classification and detection of abnormal resting state functional network connectivity using group ICA Neuroimage 145 2017 365 376 27033684 10.1016/j.neuroimage.2016.03.038 PMC5035165 270 R. B. Kargbo PROTAC Degradation of IRAK4 for the Treatment of Neurodegenerative and Cardiovascular Diseases[Z] ACS Publications 2019 1251 1252 10.1021/acsmedchemlett.9b00385 PMC6746078 31531192 271 X. Yang Z. Wang Y. Pei Discovery of thalidomide‐based PROTAC small molecules as the highly efficient SHP2 degraders European Journal of Medicinal Chemistry 218 2021 113341 33780898 10.1016/j.ejmech.2021.113341 272 X. Gao H. A. Burris III J. Vuky Phase 1/2 study of ARV‐110, an androgen receptor (AR) PROTAC degrader, in metastatic castration‐resistant prostate cancer (mCRPC)[Z] American Society of Clinical Oncology 40 6 2022 17 17 273 S. M. Gough J. J. Flanagan J. Teh Oral estrogen receptor PROTAC vepdegestrant (ARV‐471) is highly efficacious as monotherapy and in combination With CDK4/6 or PI3K/mTOR pathway inhibitors in preclinical ER+ breast cancer models Clinical Cancer Research 30 16 2024 3549 3563 38819400 10.1158/1078-0432.CCR-23-3465 PMC11325148 274 S. Jaime‐Figueroa A. D. Buhimschi M. Toure J. Hines C. M. Crews Design, synthesis and biological evaluation of Proteolysis Targeting Chimeras (PROTACs) as a BTK degraders With improved pharmacokinetic properties Bioorganic & Medicinal Chemistry Letters 30 3 2020 126877 31879210 10.1016/j.bmcl.2019.126877 PMC7318425 275 J. F. Seymour C. Y. Cheah R. Parrondo First results From a phase 1, first‐in‐human study of the Bruton's tyrosine kinase (BTK) degrader Bgb‐16673 in patients (Pts) With relapsed or refractory (R/R) B‐cell malignancies (BGB‐16673‐101) Blood 142 2023 4401 276 L. Zheng J. Cao L. Ma LC‐MF‐4, a Novel FGFR3 Degrader for Therapeutic Intervention in FGFR3‐Altered Cancers Journal of Medicinal Chemistry 68 13 2025 13858 13871 40575843 10.1021/acs.jmedchem.5c00731 277 H. Zhang H.‐Y. Zhao X.‐X. Xi Discovery of potent epidermal growth factor receptor (EGFR) degraders by proteolysis targeting chimera (PROTAC) European Journal of Medicinal Chemistry 189 2020 112061 31951960 10.1016/j.ejmech.2020.112061 278 D. E. Rathkopf M. R. Patel A. D. Choudhury First‐in‐human phase 1 study of CC‐94676, a first‐in‐class androgen receptor (AR) ligand‐directed degrader (LDD), in patients (pts) With metastatic castration‐resistant prostate cancer (mCRPC)[Z] American Society of Clinical Oncology 2024 279 E. P. Hamilton A. F. Schott R. Nanda ARV‐471, an estrogen receptor (ER) PROTAC degrader, combined With palbociclib in advanced ER+/human epidermal growth factor receptor 2–negative (HER2‐) breast cancer: Phase 1b cohort (part C) of a phase 1/2 study[Z] American Society of Clinical Oncology 40 16 2022 TPS1120 TPS1120 280 T. H. Bae K. W. Sung T. M. Pham An Autophagy‐Targeting Chimera Induces Degradation of Androgen Receptor Mutants and AR‐v7 in Castration‐Resistant Prostate Cancer Cancer Research 85 2 2025 342 359 39531508 10.1158/0008-5472.CAN-24-0591 PMC11733533 281 X. Han Y. Sun Strategies for the discovery of oral PROTAC degraders aimed at cancer therapy Cell Reports Physical Science 3 10 2022 101062 282 S. R. Boyd S. Chamakuri A. J. Trostle MYC‐targeting PROTACs lead to bimodal degradation and N‐terminal truncation ACS Chemical Biology 20 4 2025 896 906 40146931 10.1021/acschembio.4c00864 283 S. U. Zaman P. P. Pagare H. Ma Novel PROTAC probes targeting KDM3 degradation to eliminate colorectal cancer stem cells Through inhibition of Wnt/β‐catenin signaling RSC Medicinal Chemistry 15 11 2024 3746 3758 10.1039/d4md00122b PMC11393732 39281802 284 H. Zhou L. Bai R. Xu Structure‐based discovery of SD‐36 as a potent, selective, and efficacious PROTAC degrader of STAT3 protein Journal of Medicinal Chemistry 62 24 2019 11280 11300 31747516 10.1021/acs.jmedchem.9b01530 PMC8848307 285 P. Zhang X. Zhang X. Liu PROTACs are effective in addressing the platelet toxicity associated With BCL‐XL inhibitors Exploration of Targeted anti‐tumor Therapy 1 4 2020 259 34296214 10.37349/etat.2020.00017 PMC8293695 286 M. J. Bond L. Chu D. A. Nalawansha K. Li C. M. Crews Targeted degradation of oncogenic KRASG12C by VHL‐recruiting PROTACs ACS Central Science 6 8 2020 1367 1375 32875077 10.1021/acscentsci.0c00411 PMC7453568 287 E. Jeon C. Kim M. Ko KRASG12D selective VHL‐PROTAC With sparing KRASWT and other KRAS mutants European Journal of Medicinal Chemistry 297 2025 117928 40651134 10.1016/j.ejmech.2025.117928 288 C. Zhou Z. Fan Y. Gu Design, Synthesis, and Biological Evaluation of Potent and Selective PROTAC Degraders of Oncogenic KRASG12D Journal of Medicinal Chemistry 67 2 2024 1147 1167 38197882 10.1021/acs.jmedchem.3c01622 289 M. Gonzales‐Cope S. Sidoli N. V. Bhanu K.‐J. Won B. A. Garcia Histone H4 acetylation and the epigenetic reader Brd4 are critical regulators of pluripotency in embryonic stem cells BMC Genomics [Electronic Resource] 17 1 2016 95 26847871 10.1186/s12864-016-2414-y PMC4740988 290 R. A. Rao N. Dhele S. Cheemadan Ezh2 mediated H3K27me3 activity facilitates somatic transition During human pluripotent reprogramming Scientific Reports 5 1 2015 8229 25648270 10.1038/srep08229 PMC4316165 291 Q. Chen B. Yang X. Liu Histone acetyltransferases CBP/p300 in tumorigenesis and CBP/p300 inhibitors as promising novel anticancer agents Theranostics 12 11 2022 4935 35836809 10.7150/thno.73223 PMC9274749 292 J. Guo F. Yu K. Zhang Beyond inhibition Against the PD‐1/PD‐L1 pathway: Development of PD‐L1 inhibitors targeting internalization and degradation of PD‐L1 RSC Medicinal Chemistry 15 4 2024 1096 1108 38665824 10.1039/d3md00636k PMC11042118 293 G. Zhong X. Chang W. Xie X. Zhou Targeted protein degradation: Advances in drug discovery and clinical practice Signal Transduction and Targeted Therapy 9 1 2024 308 39500878 10.1038/s41392-024-02004-x PMC11539257 294 L. Tran J. A. Winton K. T. Matschke The Effect of Itraconazole on the Pharmacokinetics of Vepdegestrant, a PROteolysis TArgeting Chimera (PROTAC) Estrogen Receptor Degrader in Healthy Adult Participants 2024 295 S. Hurvitz A. Schott C. Ma 205P VERITAC update: Phase II study of ARV‐471, a PROteolysis TArgeting Chimera (PROTAC) estrogen receptor (ER) degrader in ER+/human epidermal growth factor receptor 2 (HER2)‐advanced breast cancer ESMO Open 8 1 2023 101394 296 A. Philipovskiy A. Schott J. Cortés 256TiP TACTIVE‐E: Phase Ib study of ARV‐471, a PROteolysis TArgeting Chimera (PROTAC) estrogen receptor (ER) degrader, in combination With everolimus in ER+/human epidermal growth factor receptor 2 (HER2)‐advanced breast cancer ESMO Open 8 1 2023 297 H. Iwata E. Hamilton C. Ma 73TiP Global phase III studies evaluating vepdegestrant in estrogen receptor (ER)+/human epidermal growth factor receptor 2 (HER2)‐advanced breast cancer: VERITAC‐2 and VERITAC‐3 Annals of Oncology 34 2023 S1493 298 P. Fasching K. Clifton Z. Katashvili 154TiP TACTIVE‐N: Open‐label, randomized, noncomparative neoadjuvant phase 2 study of ARV‐471, a PROteolysis TArgeting Chimera (PROTAC) estrogen receptor (ER) degrader, or anastrozole in postmenopausal women With ER+/human epidermal growth factor receptor 2 (HER2)‐localized breast cancer ESMO Open 8 1 2023 299 J. Hilton K. J. Jerzak A. J. Chien Abstract P4‐12‐03: Vepdegestrant, a PROteolysis TArgeting Chimera (PROTAC) Estrogen Receptor (ER) Degrader, Plus Abemaciclib in ER‐Pos/Human Epidermal Growth Factor Receptor 2 (HER2)‐Negative Advanced or Metastatic Breast Cancer: TACTIVE‐U Prelim Phase 1b Results Clinical Cancer Research 31 12 2025 300 D. Z. Yang L. Zhou J. A. Winton Effect of vepdegestrant, a PROTAC oestrogen receptor degrader, on dabigatran and rosuvastatin pharmacokinetics in healthy participants British Journal of Clinical Pharmacology 2025 10.1002/bcp.70198 40825714 301 H. Iwata Y. Naito M. Hattori 58P Safety and pharmacokinetics (PK) of vepdegestrant in Japanese patients With estrogen receptor (ER)+/human epidermal growth factor receptor 2 (HER2)‐advanced breast cancer: Results From a Japanese phase I study Annals of Oncology 34 2023 S1488 S1489 302 M. Campone C. X. Ma M. De Laurentiis VERITAC‐2: A global, randomized phase 3 study of ARV‐471, a proteolysis targeting chimera (PROTAC) estrogen receptor (ER) degrader, vs fulvestrant in ER+/human epidermal growth factor receptor 2 (HER2)‐advanced breast cancer Journal of Clinical Oncology 41 16 2023 303 S. Drescher W. Tan Y. Zhang J. P. Smith Abstract P4‐08‐13: Evaluating CYP3A4‐Mediated Drug Interaction Risks for Vepdegestrant, a PROteolysis TArgeting Chimera (PROTAC) Estrogen Receptor (ER) Degrader, in Combination With Cyclin‐Dependent Kinase (CDK) 4/6 Inhibitors and Everolimus Clinical Cancer Research 31 12 2025 304 M. Telli C. Gawryletz M. Wei 264TiP TACTIVE‐K: Phase Ib/II study of vepdegestrant, a proteolysis targeting chimera (PROTAC) estrogen receptor (ER) degrader, in combination With PF‐07220060, a cyclin‐dependent kinase (CDK) 4 inhibitor, in ER+/human epidermal growth factor receptor 2 (HER2)‐advanced breast cancer ESMO Open 9 2024 103285 305 H. Yokoo M. Naito Y. Demizu Investigating the cell permeability of proteolysis‐targeting chimeras (PROTACs) Expert Opinion on Drug Discovery 18 4 2023 357 361 36908022 10.1080/17460441.2023.2187047 306 W. Zhao Y. Jiang X. Li H. Wang Nanotechnology‐Enabled Targeted Protein Degradation for Cancer Therapeutics Wiley Interdisciplinary Reviews: Nanomedicine and Nanobiotechnology 16 6 2024 e2020 39663650 10.1002/wnan.2020 307 D. P. Petrylak M. McKean J. M. Lang ARV‐766, a PROteolysis TArgeting Chimera (PROTAC) Androgen Receptor Degrader, in Metastatic Castration‐Resistant Prostate Cancer: Initial Results of a Phase 1/2 Study Journal of Clinical Oncology 42 16 2024 308 K. N. Chi R. R. McKay S. Sandhu A phase 3 trial of the androgen receptor ligand‐directed degrader, BMS‐986365, versus investigator's choice in patients With metastatic castration‐resistant prostate cancer (CA071‐1000‐rechARge)[Z] American Society of Clinical Oncology 2025 309 D. Rathkopf M. Patel A. Choudhury 1597MO Clinical activity of BMS‐986365 (CC‐94676), a dual androgen receptor (AR) ligand‐directed degrader and antagonist, in heavily pretreated patients (pts) With metastatic castration‐resistant prostate cancer (mCRPC) Annals of Oncology 35 2024 S962 S963 10.1016/j.annonc.2024.09.005 PMC12094577 39293515 310 M. M. Koralewicz O. A. Szatkowska Topical solutions for androgenetic alopecia: Evaluating efficacy and safety Forum Dermatologicum 10 3 2024 71 78 311 H. A. Patel L. Guo S. R. Feldman The impact of current investigational drugs for acne on future treatment strategies Expert Opinion on Investigational Drugs 33 2 2024 127 132 38369920 10.1080/13543784.2024.2313091 312 A. Philippidis Up‐to‐$2 B Sanofi Collaboration Pays Off for Kymera: Targeted protein degradation therapy developer generates $55 M in milestone payments From partnership to develop lead candidate in atopic dermatitis, hidradenitis suppurativa GEN Edge 5 1 2023 898 903 313 S. Agarwal A. A. McDonald V. Campbell Pharmacokinetics and Pharmacodynamics of KT‐474, a Novel Selective Interleukin‐1 Receptor–Associated Kinase 4 (IRAK4) Degrader, in Healthy Adults Clinical and Translational Science 18 3 2025 e70181 40055981 10.1111/cts.70181 PMC11889407 314 L. Chen R. Luo L. Ma Discovery of LC‐MI‐3: A Potent and Orally Bioavailable Degrader of Interleukin‐1 Receptor‐Associated Kinase 4 for the Treatment of Inflammatory Diseases Journal of Medicinal Chemistry 67 10 2024 8060 8076 38722184 10.1021/acs.jmedchem.4c00181 315 J. K. Lue D. A. Stevens M. E. Williams Phase 1 study of KT‐413, a targeted protein degrader of IRAK4 and IMiD substrates, in adult patients With relapsed or refractory B‐cell non‐Hodgkin lymphoma[Z] Washington, DC American Society of Hematology 2022 316 S. Chakraborty C. Morganti J. Dey A STAT3 degrader demonstrates pre‐clinical efficacy in Venetoclax resistant Acute Myeloid Leukemia Blood 142 2023 2787 317 G. Nitulescu O. T. Olaru C. Andrei G. M. Nitulescu A. Zanfirescu Targeting Intracellular Pathways in Atopic Dermatitis With Small Molecule Therapeutics Current Issues in Molecular Biology 47 8 2025 659 40864813 10.3390/cimb47080659 PMC12384770 318 A. M. Shahid W. Vainchenker S. N. Constantinescu JCMM Annual Review on Advances in Biotechnology for the Treatment of Haematological Malignancies: A Review of the Latest In‐Patient Developments 2024–2025 Journal of Cellular and Molecular Medicine 29 13 2025 e70700 40619749 10.1111/jcmm.70700 PMC12230202 319 R. Lokaj FDA Places Partial Hold on NX‐2127 Phase 1 Trial in B‐Cell Malignancies Cancer Network 2023 320 K. Linton F. Forconi D. Lewis PB2296: ROBUST BRUTON'S TYROSINE KINASE (BTK) DEGRADATION WITH NX‐5948, AN ORAL BTK DEGRADER, IN A FIRST‐IN‐HUMAN PHASE 1A TRIAL IN PATIENTS (PTS) WITH RELAPSED/REFRACTORY B CELL MALIGNANCIES HemaSphere 7 S3 2023 e593178d 321 J. Li W. Xu P. Yan Abstract CT128: Phase 1 study of HSK29116, a Bruton tyrosine kinase (BTK) proteolysis‐targeting chimera (PROTAC) agent, in patients With relapsed or refractory B‐cell malignancies Cancer Research 83 8 2023 CT128 CT128 322 R. T. Salvaris J. Brennan K. L. Lewis BTK is the target that keeps on giving: A review of BTK‐degrader drug development, clinical data, and future directions in CLL Cancers 17 3 2025 557 39941922 10.3390/cancers17030557 PMC11817010 323 M. C. Thompson R. D. Parrondo A. M. Frustaci Preliminary efficacy and safety of the Bruton tyrosine kinase degrader BGB‐16673 in patients With relapsed or refractory chronic lymphocytic Leukemia/Small lymphocytic lymphoma: Results From the phase 1 CaDAnCe‐101 study Blood 144 2024 885 324 X. Feng Y. Wang T. Long P1239: Bruton Tyrosine Kinase (Btk) Protein Degrader Bgb‐16673 Is less apt to cause, and able to overcome variable BTK resistance mutations compared to other BTK inhibitors (BTKi) HemaSphere 7 S3 2023 e368855c 325 D. Mahadevan M. Barve D. Mahalingam Abstract CT063: First in human phase 1 study of DT2216, a selective BCL‐xL degrader, in patients With relapsed/refractory solid malignancies ( NCT04886622 Cancer Research 85 8 2025 CT063 CT063 326 X. Qin A. Presser L. Johnson Paclitaxel‐induced mitotic arrest results in a convergence of apoptotic dependencies that can be safely exploited by BCL‐XL degradation to overcome cancer chemoresistance BioRxiv 2025 327 L. L. Poling D. Cocozziello M. He CFT8634, a Clinical Stage BRD9 Bi DAC™ Degrader, Is Active in a Subset of Multiple Myeloma Cell Line Models and Synergistic When Combined With Pomalidomide Blood 142 2023 6594 328 J. A. Livingston J.‐Y. Blay J. Trent A phase I study of FHD‐609, a heterobifunctional degrader of bromodomain‐containing protein 9, in patients With advanced synovial sarcoma or SMARCB1‐deficient tumors Clinical Cancer Research 31 4 2025 628 638 39660994 10.1158/1078-0432.CCR-24-2583 329 M. McKean A. I. Spira E. Rosen A phase 1/2 study of CFT1946, a novel, bifunctional degradation activating compound (BIDAC) degrader, of mutant BRAF V600 as monotherapy and in combination With trametinib, in mutant BRAF V600 solid tumors[Z] American Society of Clinical Oncology 2023 330 T. A. Yap M. Gutierrez W. T. Iams A phase 2 safety and efficacy study of PRT3789 in combination With pembrolizumab in patients With advanced or metastatic solid tumors and a SMARCA4 mutation[Z] American Society of Clinical Oncology 2025 331 M. Wang A. Moore A. Grego Abstract C013: Clinical biomarkers based on PK/PD modeling to guide the development for a first‐in‐class, highly selective SMARCA2 (BRM) degrader, PRT3789 Molecular Cancer Therapeutics 22 12 2023 C013 C013 332 T. S. Wilson P. Scaffidi Compromised epigenetic robustness in cancer: Fueling evolution, exposing weakness Trends in Cancer 11 6 2025 575 590 40055120 10.1016/j.trecan.2025.02.001 333 J. Ren J. Wang S. Xu Preclinical development of TQB3019: A potent and selective oral BTK degrader leveraging the OAPD® platform to overcome acquired resistance mutations Cancer Research 85 8 2025 400 400 334 N. C. Rallabandi D. Panpatil D. Gahtory U. Navik R. Kumar EGFR molecular degraders: Preclinical successes and the road ahead[Z] Taylor & Francis 2025 633 636 10.1080/17568919.2025.2463871 PMC11938961 39928493 335 A. Van Acker L. DeCarr S. Eaton ARV‐393, a PROTAC B‐cell lymphoma 6 (BCL6) degrader, combined With biologics or small molecule inhibitors (SMIs) induces tumor regressions in diffuse large B‐cell lymphoma (DLBCL) models Cancer Research 85 8 2025 1655 1655 336 S. Sen A. F. Hezel A. Kasi Trial in progress: Phase 1 study of the selective protein degrader ASP4396 in patients With locally advanced or metastatic solid tumors With KRAS G12D mutations[Z] American Society of Clinical Oncology 2025 337 T. Nagashima T. Yoshinari Y. Nishizono Novel KRAS G12D degrader ASP3082 demonstrates in vivo, dose‐dependent KRAS degradation, KRAS pathway inhibition, and antitumor efficacy in multiple KRAS G12D‐mutated cancer models Cancer Research 83 7 2023 5735 5735 338 L. Groocock G. Deb J. Zhu BMS‐986458 a potential first‐in‐class, highly selective, potent and well tolerated BCL6 ligand directed degrader (LDD) demonstrates multi‐modal anti‐tumor efficacy for the treatment of B‐cell non‐Hodgkin's lymphoma Blood 144 2024 957 339 Y. Guo R. Cheng Y. Wang Regulation of EZH2 protein stability: New mechanisms, roles in tumorigenesis, and roads to the clinic EBioMedicine 100 2024 104972 38244292 10.1016/j.ebiom.2024.104972 PMC10835131 340 D. Romaniello A. Morselli I. Marrocco Strategies to Overcome Resistance to Osimertinib in EGFR‐Mutated Lung Cancer International Journal of Molecular Sciences 26 7 2025 2957 40243603 10.3390/ijms26072957 PMC11988377 341 M. R. Patel M. Tees F. T. Awan Abstract PO‐009: AC676 a BTK chimeric degrader: Phase 1 study in patients With b‐cell malignancies Blood Cancer Discovery 5 3 2024 PO–009–PO–009 342 J. Min X. Liu R. Peng New generation estrogen receptor‐targeted agents in breast cancer: Present situation and future prospectives Acta Materia Medica 3 1 2024 57 39373009 10.15212/amm-2024-0006 PMC11450757 343 Y. Wang X. Jiang F. Feng W. Liu H. Sun Degradation of proteins by PROTACs and other strategies Acta Pharmaceutica Sinica B 10 2 2020 207 238 32082969 10.1016/j.apsb.2019.08.001 PMC7016280 344 X. Gao H. A. Burris III J. Vuky Phase 1/2 study of ARV‐110, an androgen receptor (AR) PROTAC degrader, in metastatic castration‐resistant prostate cancer (mCRPC) Journal of Clinical Oncology 40 6 2022 17 17 345 K. N. Chi R. R. McKay S. Sandhu rechARge: A randomized phase III trial of the androgen receptor ligand‐directed degrader, BMS‐986365, vs investigator's choice in patients With mCRPC Future oncology 21 14 2025 1 7 40455815 10.1080/14796694.2025.2502318 PMC12150650 346 M. Campone M. De Laurentiis K. Jhaveri Vepdegestrant, a PROTAC estrogen receptor degrader, in advanced breast cancer New England Journal of Medicine 393 6 2025 556 568 40454645 10.1056/NEJMoa2505725 347 R. L. Siegel A. N. Giaquinto A. Jemal Cancer statistics, 2024 CA: A Cancer Journal for Clinicians 74 1 2024 12 49 38230766 10.3322/caac.21820 348 S. K. Bagal P. C. Astles C. Diène Discovery of a Series of Orally Bioavailable Androgen Receptor Degraders for the Treatment of Prostate Cancer Journal of Medicinal Chemistry 67 14 2024 11732 11750 38991141 10.1021/acs.jmedchem.4c00269 349 X. Gao H. Iii J. Vuky Phase 1/2 study of ARV‐110, an androgen receptor (AR) PROTAC degrader, in metastatic castration‐resistant prostate cancer (mCRPC) Journal of Clinical Oncology 40 2022 17 17 350 L. Ma X. Han Bavdegalutamide (ARV‐110): A potent PROTAC androgen receptor degrader for the treatment of metastatic‐castration resistant prostate cancer Drug Discovery Stories 2025 357 378 351 K. N. Chi R. R. McKay S. Sandhu rechARge: A randomized phase III trial of the androgen receptor ligand‐directed degrader, BMS‐986365, vs investigator's choice in patients With mCRPC Future Oncology 21 14 2025 1771 1777 40455815 10.1080/14796694.2025.2502318 PMC12150650 352 P. A. Watson V. K. Arora C. L. Sawyers Emerging mechanisms of resistance to androgen receptor inhibitors in prostate cancer Nature Reviews Cancer 15 12 2015 701 711 26563462 10.1038/nrc4016 PMC4771416 353 D. P. Petrylak M. McKean J. M. Lang ARV‐766, a proteolysis targeting chimera (PROTAC) androgen receptor (AR) degrader, in metastatic castration‐resistant prostate cancer (mCRPC): Initial results of a phase 1/2 study Journal of Clinical Oncology 42 16 2024 5011 5011 354 Q. H. Chen E. Munoz D. Ashong Insight Into Recent Advances in Degrading Androgen Receptor for Castration‐Resistant Prostate Cancer Cancers (Basel) 16 3 2024 663 38339414 10.3390/cancers16030663 PMC10854644 355 D. Saceda‐Corralo M. Domínguez‐Santas S. Vañó‐Galván R. Grimalt What's new in therapy for male androgenetic alopecia? American Journal of Clinical Dermatology 24 1 2023 15 24 36169916 10.1007/s40257-022-00730-y 356 C.‐C. Chou P.‐C. Cheng H.‐C. Chen 52243 AH‐001: An Emerging Androgen Receptor Degrader Showing Therapeutic Potential in Addressing Androgenetic Alopecia (AGA) Journal of the American Academy of Dermatology 91 3 2024 AB119 357 A. Grinshpun Clinician's guide to targeted estrogen receptor degradation using PROTAC in patients With estrogen receptor‐positive metastatic breast cancer Current Opinion in Oncology 35 6 2023 472 478 37427531 10.1097/CCO.0000000000000972 PMC10566586 358 M. Campone M. D. Laurentiis K. Jhaveri Vepdegestrant, a PROTAC Estrogen Receptor Degrader, in Advanced Breast Cancer New England Journal of Medicine 393 6 2025 556 568 40454645 10.1056/NEJMoa2505725 359 H. Iwata Y. Naito M. Hattori Safety and pharmacokinetics of vepdegestrant in Japanese patients With ER+ advanced breast cancer: A phase 1 study International Journal of Clinical Oncology 30 1 2025 72 82 39565495 10.1007/s10147-024-02648-3 PMC11700046 360 J. Li X. Chen A. Lu C. Liang Targeted protein degradation in cancers: Orthodox PROTACs and Beyond The Innovation 4 3 2023 100413 37033156 10.1016/j.xinn.2023.100413 PMC10074253 361 S. Montoya J. Bourcier M. Noviski Kinase‐impaired BTK mutations are susceptible to clinical‐stage BTK and IKZF1/3 degrader NX‐2127 Science 383 6682 2024 eadi5798 38301010 10.1126/science.adi5798 PMC11103405 362 D. W. Robbins M. Noviski R. Rountree Nx‐5948, a Selective Degrader of BTK With Activity in Preclinical Models of Hematologic and Brain Malignancies Blood 138 2021 2251 363 M. Patel M. Tees N. Khan IBCL‐147 AC676, an Orally Bioavailable BTK Chimeric Degrader in Patients With B‐cell Malignancies Clinical Lymphoma Myeloma and Leukemia 24 2024 S494 364 M. T. Tees D. A. Bond N. Khan A Phase 1 Study of AC676, a Novel BTK Chimeric Degrader, in Patients With B‐Cell Malignancies Blood 144 1 2024 4422.4421 4422.4421 365 J. K. Lue D. A. Stevens M. E. Williams Phase 1 Study of KT‐413, a Targeted Protein Degrader of IRAK4 and IMiD Substrates, in Adult Patients With Relapsed or Refractory B‐Cell Non‐Hodgkin Lymphoma Blood 140 1 2022 12143 12144 366 M. M. Weiss X. Zheng N. Ji Discovery of KT‐413, a Targeted Protein Degrader of IRAK4 and IMiD Substrates Targeting MYD88 Mutant Diffuse Large B‐Cell Lymphoma Journal of Medicinal Chemistry 67 13 2024 10548 10566 38920289 10.1021/acs.jmedchem.3c01823 367 S. D. Edmondson Discovery of the First Clinical Protein Degrader for the Treatment of Autoimmune Indications: Orally Bioavailable and Selective IRAK4 Degrader KT‐474 Journal of Medicinal Chemistry 67 20 2024 18017 18021 39376047 10.1021/acs.jmedchem.4c02264 368 J. J. Harvey An unidentified virus which causes the rapid production of tumours in mice Nature 204 1964 1104 1105 10.1038/2041104b0 14243400 369 W. H. Kirsten L. A. Mayer Morphologic responses to a murine erythroblastosis virus Journal of the National Cancer Institute 39 2 1967 311 335 18623947 370 M. Malumbres M. Barbacid RAS oncogenes: The first 30 years Nature Reviews Cancer 3 6 2003 459 465 12778136 10.1038/nrc1097 371 J. M. Ostrem U. Peters M. L. Sos J. A. Wells K. M. Shokat K‐Ras(G12C) inhibitors allosterically control GTP affinity and effector interactions Nature 503 7477 2013 548 551 24256730 10.1038/nature12796 PMC4274051 372 E. C. Nakajima N. Drezner X. Li FDA Approval Summary: Sotorasib for KRAS G12C‐Mutated Metastatic NSCLC Clinical Cancer Research 28 8 2022 1482 1486 34903582 10.1158/1078-0432.CCR-21-3074 PMC9012672 373 S. S. Zhang A. Lee M. Nagasaka CodeBreak 200: Sotorasib Has Not Broken the KRAS(G12C) Enigma Code Lung Cancer (Auckl) 14 2023 27 30 37101895 10.2147/LCTT.S403461 PMC10123019 374 H. Shen J. Lundy A. H. Strickland KRAS G12D Mutation Subtype in Pancreatic Ductal Adenocarcinoma: Does It Influence Prognosis or Stage of Disease at Presentation? Cells 11 19 2022 3175 36231137 10.3390/cells11193175 PMC9562007 375 S. Ramalingam F. Skoulidis R. Govindan P52.03 Efficacy of Sotorasib in <em>KRAS</em>p.G12C‐Mutated NSCLC With Stable Brain Metastases: A Post‐Hoc Analysis of CodeBreaK 100 Journal of Thoracic Oncology 16 10 2021 S1123 376 A. W. Tolcher W. Park J. S. Wang Trial in progress: A phase 1, first‐in‐human, open‐label, multicenter, dose‐escalation and dose‐expansion study of ASP3082 in patients With previously treated advanced solid tumors and KRAS G12D mutations Journal of Clinical Oncology 41 4 2023 TPS764 TPS764 377 M. Li H. Wang F. Wang Recent Advance of KRAS‐G12C Inhibitors for Cancer Therapy European Journal of Medicinal Chemistry 2025 117878 40554983 10.1016/j.ejmech.2025.117878 378 D. Rangachari C. To J. E. Shpilsky EGFR‐Mutated Lung Cancers Resistant to Osimertinib Through EGFR C797S Respond to First‐Generation Reversible EGFR Inhibitors but Eventually Acquire EGFR T790M/C797S in Preclinical Models and Clinical Samples Journal of Thoracic Oncology 14 11 2019 1995 2002 31377341 10.1016/j.jtho.2019.07.016 PMC6823139 379 J. W. Li G. Zheng F. J. Kaye L. Wu PROTAC therapy as a new targeted therapy for lung cancer Molecular Therapy 31 3 2023 647 656 36415148 10.1016/j.ymthe.2022.11.011 PMC10014230 380 N. C. Rallabandi D. Panpatil D. Gahtory U. Navik R. J. F. M. C. Kumar EGFR molecular degraders: Preclinical successes and the road ahead[Z] Taylor & Francis 2025 1 4 10.1080/17568919.2025.2463871 PMC11938961 39928493 381 X. Zhou L. Zeng Z. Huang Strategies Beyond 3rd EGFR‐TKI Acquired Resistance: Opportunities and Challenges Cancer medicine 14 9 2025 e70921 40322930 10.1002/cam4.70921 PMC12051098 382 L. Groocock G. Deb J. Zhu BMS‐986458 a Potential First‐in‐Class, Highly Selective, Potent and Well Tolerated BCL6 Ligand Directed Degrader (LDD) Demonstrates Multi‐Modal Anti‐Tumor Efficacy for the Treatment of B‐Cell Non‐Hodgkin's Lymphoma Blood 144 1 2024 957 957 383 P. F. Caimi S. F. Huntington S. Landrette Phase 1 Study of ARV‐393, a PROTAC BCL6 Degrader, in Advanced Non‐Hodgkin Lymphoma Blood 144 2024 6505 384 G. L. Brien D. Remillard J. Shi Targeted degradation of BRD9 reverses oncogenic gene expression in synovial sarcoma Elife 7 2018 e41305 30431433 10.7554/eLife.41305 PMC6277197 385 V. Vetma S. O'Connor A. Ciulli Development of PROTAC degrader drugs for cancer Annual Review of Cancer Biology 9 2024 119 140 386 R. Guo A. Dowlati I. Dagogo‐Jack 603O First clinical results From a phase I trial of PRT3789: A first‐in‐class intravenous SMARCA2 degrader, in patients With advanced solid tumors With a SMARCA4 mutation Annals of Oncology 35 2024 S483 S484 387 J. H. Kim J. H. Woo C. Y. Lim SMARCA4‐deficient non‐small cell lung carcinoma: Clinicodemographic, computed tomography, and positron emission tomography‐computed tomography features Journal of thoracic disease 16 3 2024 1753 1764 38617754 10.21037/jtd-23-1606 PMC11009581 388 X. Liang X. Gao F. Wang Clinical characteristics and prognostic analysis of SMARCA4‐deficient non‐small cell lung cancer Cancer medicine 12 13 2023 14171 14182 37184108 10.1002/cam4.6083 PMC10358186 389 T. Füreder Best of ESMO: Pan‐tumor highlights Memo—Magazine of European Medical Oncology 18 2 2025 1 4 390 N. Li J. Sheng H.‐H. Zhu Breakthroughs in treatment for hematological malignancies: Latest updates on molecular glue, PROTACs and RNA degraders From ASH 2024 Journal of Hematology & Oncology 18 1 2025 26 40045307 10.1186/s13045-025-01674-6 PMC11884154 391 A. Wang B. Yang A. Hossain Potent and Selective Oral Stat6 Degrader KT‐621 Inhibits IL‐4/IL‐13 in Mouse Models of Asthma Annals of Allergy, Asthma & Immunology 133 6 2024 S57 392 Y. He R. Koch V. Budamagunta DT2216—a Bcl‐xL‐specific degrader is highly active Against Bcl‐xL‐dependent T cell lymphomas Journal of Hematology & Oncology 13 1 2020 95 32677976 10.1186/s13045-020-00928-9 PMC7364785 393 W. Dai X. Qiao Y. Fang Epigenetics‐targeted drugs: Current paradigms and future challenges Signal Transduction and Targeted Therapy 9 1 2024 332 39592582 10.1038/s41392-024-02039-0 PMC11627502 394 H. Duparc J. Neef J. Kandiah AUTX703, a Novel and Potent KAT2A and KAT2B Protein Degrader, Induces Differentiation and Offers Survival Advantage in a Primary Human AML Xenograft Model Blood 144 2024 3585 395 Y. K. Chutake M. F. Mayo N. Dumont KT‐253, a Novel MDM2 Degrader and p53 Stabilizer, Has Superior Potency and Efficacy Than MDM2 Small‐Molecule Inhibitors Molecular Cancer Therapeutics 24 4 2025 497 510 39648478 10.1158/1535-7163.MCT-24-0306 PMC11962396 396 M. McKean A. I. Spira E. Rosen A phase 1/2 study of CFT1946, a novel, bifunctional degradation activating compound (BIDAC) degrader, of mutant BRAF V600 as monotherapy and in combination With trametinib, in mutant BRAF V600 solid tumors Journal of Clinical Oncology 41 16 2023 TPS3163 TPS3163 397 H. Majeski K. Chahal A. Pasis Characterization of BTX‐9341, a bifunctional degrader of CDK4 and CDK6 for HR+/HER2‐ breast cancer and glioblastoma multiforme Journal of Clinical Oncology 42 16 2024 3111 3111 398 Y. He Y. Zheng C. Zhu Radioactive ADME Demonstrates ARV‐110's High Druggability Despite Low Oral Bioavailability Journal of Medicinal Chemistry 67 16 2024 14277 14291 39072617 10.1021/acs.jmedchem.4c01104 399 T. Ishida A. Ciulli E3 Ligase Ligands for PROTACs: How They Were Found and How to Discover New Ones SLAS Discovery 26 4 2021 484 502 33143537 10.1177/2472555220965528 PMC8013866 400 T. Sobierajski J. Małolepsza M. Pichlak E. Gendaszewska‐Darmach K. M. Błażewska The impact of E3 ligase choice on PROTAC effectiveness in protein kinase degradation Drug Discovery Today 29 7 2024 104032 38789027 10.1016/j.drudis.2024.104032 401 J. Liu Y. Liu J. Tang Recent advances in dual PROTACs degrader strategies for disease treatment European Journal of Medicinal Chemistry 279 2024 116901 39341095 10.1016/j.ejmech.2024.116901 402 Z. Wang B. S. Pan R. K. Manne CD36‐mediated endocytosis of proteolysis‐targeting chimeras Cell 188 12 2025 3219 3237 40250420 10.1016/j.cell.2025.03.036 PMC12167158 403 L. Wang Y. Ke Q. He A novel ROR1‐targeting antibody‐PROTAC conjugate promotes BRD4 degradation for solid tumor treatment Theranostics 15 4 2025 1238 39816690 10.7150/thno.102531 PMC11729552 404 Y. Chen I. Tandon W. Heelan Proteolysis‐targeting chimera (PROTAC) delivery system: Advancing protein degraders towards clinical translation Chemical Society Reviews 51 13 2022 5330 5350 35713468 10.1039/d1cs00762a PMC9382890 405 L. Zhang L. Li X. Wang Development of a novel PROTAC using the nucleic acid aptamer as a targeting ligand for tumor selective degradation of nucleolin Molecular Therapy Nucleic Acids 30 2022 66 79 36250201 10.1016/j.omtn.2022.09.008 PMC9535278 406 Y. Sun L. Jiang Z. Zhang Conjugated Polyelectrolyte/Single Strand DNA Hybrid Polyplexes for Efficient Nucleic Acid Delivery and Targeted Protein Degradation ACS Appl Mater Interfaces 16 16 2023 19987 19994 38108633 10.1021/acsami.3c14640 407 P. Kou E. S. Levy A. D. Nguyen Development of liposome systems for enhancing the PK properties of bivalent PROTACs Pharmaceutics 15 8 2023 2098 37631312 10.3390/pharmaceutics15082098 PMC10458015 408 X. Chen F. Li B. Cui Liposomes‐mediated enhanced antitumor effect of docetaxel With BRD4‐PROTAC as synergist for breast cancer chemotherapy/immunotherapy International Journal of Pharmaceutics 668 2025 124973 39566696 10.1016/j.ijpharm.2024.124973 409 Y. Fu D. Rathod K. Patel Protein kinase C inhibitor anchored BRD4 PROTAC PEGylated nanoliposomes for the treatment of vemurafenib‐resistant melanoma Experimental Cell Research 396 1 2020 112275 32898554 10.1016/j.yexcr.2020.112275 PMC12045034 410 K. Scheuer D. Bandelli C. Helbing Self‐assembly of copolyesters Into stereocomplex crystallites tunes the properties of polyester nanoparticles Macromolecules 53 19 2020 8340 8351 411 F. J. Cimas E. Niza A. Juan Controlled Delivery of BET‐PROTACs: In vitro evaluation of MZ1‐loaded polymeric antibody conjugated nanoparticles in breast cancer Pharmaceutics 12 10 2020 986 33086530 10.3390/pharmaceutics12100986 PMC7589709 412 N. Mukerjee S. Maitra A. Ghosh V. Subramaniyan R. Sharma Exosome‐mediated PROTACs delivery to target viral infections Drug Development Research 84 6 2023 1031 1036 37391892 10.1002/ddr.22091 413 N. Mukerjee S. Maitra A. Ghosh Synergizing proteolysis‐targeting chimeras and nanoscale exosome‐based delivery mechanisms for HIV and antiviral therapeutics ACS Applied Nano Materials 7 4 2024 3499 3514 414 R. Kojima D. Bojar G. Rizzi Designer exosomes produced by implanted cells intracerebrally deliver therapeutic cargo for Parkinson's disease treatment Nature Communications 9 1 2018 1305 10.1038/s41467-018-03733-8 PMC5880805 29610454 415 Q. He, L. Zhou, D. Yu, et al., \"Near‐Infrared‐Activatable PROTAC Nanocages for Controllable Target Protein Degradation and On‐Demand Antitumor Therapy,\" Journal of Medicinal Chemistry 66, no. 15 (2023): 10458‐10472. 10.1021/acs.jmedchem.3c00587 37279091 416 Y. Wu, X. Chang, G. Yang, et al., \"A Physiologically Responsive Nanocomposite Hydrogel for Treatment of Head and Neck Squamous Cell Carcinoma via Proteolysis‐Targeting Chimeras Enhanced Immunotherapy,\" Advanced Materials 35, no. 12 (2023): e2210787. 10.1002/adma.202210787 36656993 417 G. Fan J. Lu R. Tan Potent Efficacy of Computer‐Aided Designed Peptide Degrader Drug on PCSK9‐Mediated Hypercholesterolemia BioRxiv 2025 418 J. Chang X. Chen Z. Glass Integrating combinatorial lipid nanoparticle and chemically modified protein for intracellular delivery and genome editing Accounts of Chemical Research 52 3 2018 665 675 30586281 10.1021/acs.accounts.8b00493 PMC6513672 419 J. Huang Z. Yao B. Li Y. Ping Targeted delivery of PROTAC‐based prodrug activated by bond‐cleavage bioorthogonal chemistry for microneedle‐assisted cancer therapy Journal of Controlled Release 361 2023 270 279 37541594 10.1016/j.jconrel.2023.07.062 420 R. Bargakshatriya S. K. Pramanik Leading prodrug strategies for targeted and specific release Future Medicinal Chemistry 17 8 2025 865 868 40085509 10.1080/17568919.2025.2479412 421 X. Zhang Z. Song X. Zhang Unconventional PROTACs for Targeted Protein Degradation in Cancer Therapy Angewandte Chemie (International ed in English) 64 31 2025 e202507702 40492592 10.1002/anie.202507702 422 R. K. Rej S. R. Allu J. Roy Orally Bioavailable Proteolysis‐Targeting Chimeras: An Innovative Approach in the Golden Era of Discovering Small‐Molecule Cancer Drugs Pharmaceuticals (Basel) 17 4 2024 10.3390/ph17040494 PMC11054475 38675453 423 J. Tate G. Ward Interferences in immunoassay Clinical Biochemist Reviews 25 2 2004 105 120 18458713 PMC1904417 424 M. Schröder M. Renatus X. Liang DCAF1‐based PROTACs With activity Against clinically validated targets overcoming intrinsic‐and acquired‐degrader resistance Nature Communications 15 1 2024 275 10.1038/s41467-023-44237-4 PMC10766610 38177131 425 I. Sosič A. Bricelj C. Steinebach E3 ligase ligand chemistries: From building blocks to protein degraders Chemical Society Reviews 51 9 2022 3487 3534 35393989 10.1039/d2cs00148a 426 L. Lescouzères P. Bomont E3 Ubiquitin Ligases in Neurological Diseases: Focus on Gigaxonin and Autophagy Front in Physiology 11 2020 1022 10.3389/fphys.2020.01022 PMC7642974 33192535 427 P. Lu Y. Cheng L. Xue Selective degradation of multimeric proteins by TRIM21‐based molecular glue and PROTAC degraders Cell 187 25 2024 7126 7142 39488207 10.1016/j.cell.2024.10.015 428 Y. Sun E3 ubiquitin ligases as cancer targets and biomarkers Neoplasia 8 8 2006 645 654 16925947 10.1593/neo.06376 PMC1601942 429 S. Datta P. Verma B. Dhara Interplay of precision therapeutics and MD study: Calocybe indica's potentials Against cervical cancer and its interaction With VEGF via octadecanoic acid Journal of Cellular and Molecular Medicine 28 8 2024 e18302 38652115 10.1111/jcmm.18302 PMC11037404 430 O. Koshkina T. Rheinberger V. Flocke Biodegradable polyphosphoester micelles act as both background‐free (31)P magnetic resonance imaging agents and drug nanocarriers Nature Communications 14 1 2023 4351 10.1038/s41467-023-40089-0 PMC10356825 37468502 431 J. Dugal‐Tessier S. Thirumalairajan N. Jain Antibody‐oligonucleotide conjugates: A twist to antibody‐drug conjugates Journal of Clinical Medicine 10 4 2021 838 33670689 10.3390/jcm10040838 PMC7922418 432 C. Wang Y. Zhang W. Chen Y. Wu D. Xing New‐generation advanced PROTACs as potential therapeutic agents in cancer therapy Molecular Cancer 23 1 2024 110 38773495 10.1186/s12943-024-02024-9 PMC11107062 433 K. Farrell T. J. Jarome Is PROTAC technology really a game changer for central nervous system drug discovery? Expert Opinion on Drug Discovery 16 8 2021 833 840 33870803 10.1080/17460441.2021.1915979 PMC8298267 434 K. R. Mittal N. Pharasi B. Sarna Nanotechnology‐based drug delivery for the treatment of CNS disorders Translational Neuroscience 13 1 2022 527 546 36741545 10.1515/tnsci-2022-0258 PMC9883694 435 A. Suzuki R. Henao M. C. Reed Lower hepatic CBS and PEMT expression in advanced NAFLD: Inferencing strategies to lower homocysteine With a mathematical model Metabolism and Target Organ Damage 4 3 2024 N/A‐N/A 436 A. Mantovani G. Targher PNPLA3 rs738409 polymorphism and kidney dysfunction: An association Beyond nonalcoholic fatty liver disease? Metabolism and Target Organ Damage 3 4 2023 N/A‐N/A 437 B. Wang L. Wang Q. Yang Pulmonary inhalation for disease treatment: Basic research and clinical translations Materials Today Bio 25 2024 100966 10.1016/j.mtbio.2024.100966 PMC10840005 38318475 438 S.‐M. Qi J. Dong Z.‐Y. Xu PROTAC: An effective targeted protein degradation strategy for cancer therapy Frontiers in pharmacology 12 2021 692574 34025443 10.3389/fphar.2021.692574 PMC8138175 439 S. Zeng W. Huang X. Zheng Proteolysis targeting chimera (PROTAC) in drug discovery paradigm: Recent progress and future challenges European Journal of Medicinal Chemistry 210 2021 112981 33160761 10.1016/j.ejmech.2020.112981 440 R. G. Guenette S. W. Yang J. Min B. Pei P. R. Potts Target and tissue selectivity of PROTAC degraders Chemical Society Reviews 51 14 2022 5740 5756 35587208 10.1039/d2cs00200k 441 C. Shi H. Zhang P. Wang PROTAC induced‐BET protein degradation exhibits potent anti‐osteosarcoma activity by triggering apoptosis Cell Death & Disease 10 11 2019 815 31653826 10.1038/s41419-019-2022-2 PMC6814818 442 R. Kamaraj S. Ghosh S. Das Targeted Protein Degradation (TPD) for Immunotherapy: Understanding Proteolysis Targeting Chimera‐Driven Ubiquitin‐Proteasome Interactions Bioconjugate Chemistry 35 8 2024 1089 1115 38990186 10.1021/acs.bioconjchem.4c00253 PMC11342303 443 Y. Xiang M. Zhang D. Jiang Q. Su J. Shi The role of inflammation in autoimmune disease: A therapeutic target Frontiers in immunology 14 2023 1267091 37859999 10.3389/fimmu.2023.1267091 PMC10584158 444 Y. He X. Zhang J. Chang Using proteolysis‐targeting chimera technology to reduce navitoclax platelet toxicity and improve its senolytic activity Nature Communications 11 1 2020 1996 10.1038/s41467-020-15838-0 PMC7181703 32332723 445 A. Di Vincenzo M. Crescenzi M. Granzotto R. Vettor M. Rossato Relationship Between sex hormones, markers of adiposity and inflammation in male patients With severe obesity undergoing bariatric surgery Metabolism and Target Organ Damage 3 3 2023 N/A–N/A 446 D. Ricciardi R. Galiero V. Todisco Neurophysiological assessment of peripheral neuropathy Through whole plantar nerve conduction in type 2 diabetes mellitus and healthy control subjects Metabolism and Target Organ Damage 4 3 2024 N/A–N/A 447 G. Luo Z. Li X. Lin Discovery of an orally active VHL‐recruiting PROTAC that achieves robust HMGCR degradation and potent hypolipidemic activity in vivo Acta Pharmaceutica Sinica B 11 5 2021 1300 1314 34094835 10.1016/j.apsb.2020.11.001 PMC8148065 448 M.‐X. Li Y. Yang Q. Zhao Degradation versus inhibition: Development of proteolysis‐targeting chimeras for overcoming statin‐induced compensatory upregulation of 3‐hydroxy‐3‐methylglutaryl coenzyme A reductase Journal of Medicinal Chemistry 63 9 2020 4908 4928 32321253 10.1021/acs.jmedchem.0c00339 449 S. Li X. Wang J. Huang Decoy‐PROTAC for specific degradation of “Undruggable” STAT3 transcription factor Cell death & disease 16 1 2025 197 40118821 10.1038/s41419-025-07535-x PMC11928565 450 X. Wu D. Pan S. Tang Y. J. B. Shen Targeting the” undruggable“ cancer driver genes: Ras, myc, and tp53 International Journal of Cancer 47 7 2023 451 N. Cruz‐Rodriguez H. Tang B. Bateman W. Tang M. J. L. Deininger BCR: ABL1 Proteolysis‐targeting chimeras (PROTACs): The new frontier in the treatment of Ph+ leukemias? Leukemia 38 9 2024 1885 1893 39098922 10.1038/s41375-024-02365-w PMC11569815 452 H. Yadav R. K. Shirumalla Emerging trends in IRAK‐4 kinase research Molecular Biology Reports 50 9 2023 7825 7837 37490192 10.1007/s11033-023-08438-w 453 S. Banerjee A. Biehl M. Gadina S. Hasni D. M. Schwartz JAK–STAT signaling as a target for inflammatory and autoimmune diseases: Current and future prospects Drugs 77 2017 521 546 28255960 10.1007/s40265-017-0701-9 PMC7102286 ",
  "metadata": {
    "Title of this paper": "JAK–STAT signaling as a target for inflammatory and autoimmune diseases: Current and future prospects",
    "Journal it was published in:": "MedComm",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12495453/"
  }
}