{
  "title": "Paper_1235",
  "abstract": "pmc Medicina (Kaunas) Medicina (Kaunas) 3494 medicina medicina Medicina 1010-660X 1648-9144 Multidisciplinary Digital Publishing Institute  (MDPI) PMC12471930 PMC12471930.1 12471930 12471930 41011027 10.3390/medicina61091636 medicina-61-01636 1 Article Effectiveness of Oncological Physiotherapy on Shoulder Dysfunction After Cervical Lymph Node Dissection in Head and Neck Cancer: A Pilot Randomized Controlled Trial https://orcid.org/0009-0008-5311-3048 Pérez-García Raquel Conceptualization Methodology Investigation Resources Writing – original draft Writing – review & editing 1 2 https://orcid.org/0000-0002-1782-2524 Abuín-Porras Vanesa Investigation Writing – original draft Writing – review & editing 2 * https://orcid.org/0000-0001-8690-0998 Pecos-Martín Daniel Conceptualization Methodology Writing – review & editing 1 3 https://orcid.org/0000-0001-6598-829X Romero-Morales Carlos Formal analysis Data curation Writing – review & editing 2 Anarte-Lazo Ernesto Academic Editor 1 raquel.perez@universidadeuropea.es daniel.pecos@uah.es 2 carlos.romero@universidadeuropea.es 3 * vanesa.abuin@universidadeuropea.es 10 9 2025 9 2025 61 9 497654 1636 24 7 2025 01 9 2025 04 9 2025 10 09 2025 27 09 2025 29 09 2025 © 2025 by the authors. 2025 https://creativecommons.org/licenses/by/4.0/ Published by MDPI on behalf of the Lithuanian University of Health Sciences. Licensee MDPI, Basel, Switzerland. This article is an open access article distributed under the terms and conditions of the Creative Commons Attribution (CC BY) license ( https://creativecommons.org/licenses/by/4.0/ Background and Objectives Materials and Methods Results: p p p Conclusions NCT05604235 head and neck cancer oncological physiotherapy shoulder pain shoulder dysfunction This research received no external funding. pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement yes pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes 1. Introduction Head and neck cancer (HNC) encompasses malignancies of the oral cavity, pharynx, and larynx that frequently require multimodal treatment [ 1 2 3 4 5 6 7 8 Rehabilitation is central to addressing these sequelae. Strengthening of the scapular stabilizers and shoulder girdle, mobility and postural retraining, and progressive functional exercise are recommended and have shown benefits for pain and function in this population, although effect sizes and protocols vary across studies [ 9 10 Neurodynamic mobilization techniques (NDMTs) are manual therapy procedures designed to restore the excursion and mechanical interface of peripheral nerves through graded positioning, tensioning, and sliding [ 11 12 A search of the literature reveals no clinical trials evaluating neurodynamic mobilization techniques (NDMTs) specifically for shoulder dysfunction following cervical lymph node dissection in head and neck cancer (HNC) patients. A recent systematic review identified progressive resistance training as effective but did not include NDMTs among the studied interventions [ 9 13 12 Therefore, the objective of this pilot randomized controlled trial was to determine whether adding NDMTs to a conventional program improves shoulder dysfunction after CLND in patients with HNC. We hypothesized that, compared with strengthening alone, the combined program would yield greater improvements in patient-reported outcomes and shoulder function across the treatment period and short-term follow-up. 2. Materials and Methods This study was conducted as a pilot randomized controlled trial, with the primary aim of evaluating feasibility and preliminary clinical effects of a physiotherapy program incorporating neurodynamic mobilization techniques. It followed the CONSORT (Consolidated Standards of Reporting Trials) extension for clinical trials [ 14 15 NCT05604235 Figure 1 2.1. Participants Participants with shoulder dysfunction after HNC surgery, diagnosed by an oncologist were enrolled in the study. The study sample consisted of individuals between 18 and 80 years of age, with a diagnosis of head and neck cancer and treated with cervical lymph node resection between levels II and V, having shoulder pain and dysfunction. Subjects were excluded if they had bone metastases, lymph node dissection at cervical level I, or they had previous shoulder injuries. We conducted an assessor-blinded randomized trial. Because the nature of the intervention prevented blinding of participants and treating therapists, only outcome assessors were masked to group assignment. Allocation was concealed with sequentially numbered, opaque, sealed envelopes prepared and administered by an independent researcher who had no role in screening, treatment delivery, or outcome assessment. 2.2. Outcomes All outcome measures were administered by a blinded assessor at baseline assessment (pretreatment), mid-term (1 week), at treatment completion (3 months), and 3 months post-treatment completion (long term follow-up). The data regarding the gender, age, level of cervical lymph node dissection, upper limb affected of the participants were recorded during the face-to-face interviews on a pre-prepared evaluation form. Primary outcome (quality of life). Quality of life was measured with the QLQ-H&N35 questionnaire [ 16 17 17 18 Pain intensity. Pain intensity was assessed using a visual analog scale (VAS) [ 19 20 Upper-limb disability. Disability related to shoulder problems was evaluated with the Disabilities of the Arm, Shoulder and Hand (DASH) questionnaire [ 21 21 Neurodynamic test. The neurodynamic test was administered with the patient seated [ 22 22 Skeletal muscle function. Skeletal muscle performance was examined using a handgrip strength test [ 23 ® 23 2.3. Interventions Participants in both groups underwent 16 therapy sessions over eight weeks (two sessions per week). Control group (strengthening): Ten strengthening exercises primarily targeting the trapezius and sternocleidomastoid were performed with 2-kg weights, 20 repetitions per exercise, each session. The exercises included shoulder flexion and abduction with the elbow extended; scapular retraction/protraction in standing; bent-over row sequence without abduction; prone horizontal abduction with scapular retraction; seated scapular retraction with shoulders at 90° abduction and elbows at 90°; resisted ipsilateral lateral flexion and rotation of the cervical spine; an upright row with elastic band; and prone external rotation at 90° abduction. A complete step-by-step protocol (positions, cues, and execution) is provided in Supplementary Material S1 Participants allocated to the neurodynamic group received neurodynamic mobilizations for accessory spinal nerve in addition to conventional treatment, performed by the same physiotherapist ( Supplementary Material S1 The NDMTs were performed with the patient in lateral decubitus on the unaffected side, the cervical spine was placed in flexion and a retraction of the scapula was performed. From this position, the patient was asked to slowly move his neck increasing flexion and up to neutral position, at the same time the physiotherapist mobilized the arm towards slight shoulder distraction and scapula depression [ 22 Supplementary Material S1 2.4. Statistical Analysis Statistical analyses were conducted using RStudio (v1.4; RStudio, PBC, Boston, MA, USA) and IBM SPSS Statistics (v25; IBM, Armonk, NY, USA). Baseline descriptive summaries and independent-samples t p t To analyze outcomes at baseline, mid-term, final, and 3-month assessments, we fit a mixed linear model for repeated measures, specifying subject-level random effects by identifying each participant. This specification allowed us to distinguish changes attributable to individual variability from those due to group differences. We reported the intraclass correlation coefficient (ICC) and the percentage of variance, together with R-squared and conditional R-squared values, to evaluate variation in individual responses. Fixed factors included time (baseline, mid-term, post) and intervention (groups) to model intra- and inter-subject effects. Bonferroni-adjusted post hoc pairwise comparisons were applied. Effect sizes were expressed as partial eta squared (ηp 2 p 3. Results Twenty participants were randomized (10 per group). Cervical dissection levels were II–V (50%), III–V (30%), and IV–V (20%). The affected side was left in 55%. A total of 65% received surgery plus radiotherapy, 30% surgery only, and 5% surgery plus chemotherapy. All participants were positive on the neurodynamic test at baseline. Table 1 Considering Table 2 p In addition, mixed linear models reported that pain intensity [ICC = 0.610, (R 2 m 2 c 2 m 2 c 2 m 2 c 4. Discussion The main aim of this study was to determine the effects of adding a neurodynamic mobilization intervention into a multimodal treatment approach on management of shoulder dysfunction in patients treated with head and neck cancer surgery. In this pilot randomized trial, adding neurodynamic mobilization to a conventional program was associated with improvements in pain, disability, and head-and-neck–specific quality of life compared with strengthening alone. In this line, the significant improvements in pain intensity, shoulder functionality (DASH score), and quality of life (NH35) between the experimental and control groups suggest that NDMTs could be a valuable addition in oncological physiotherapy programs. Our primary outcome showed a significant group×time interaction favoring NDMTs for the QLQ-H&N35 ( p 15 17 18 The benefits observed with NDMTs may be explained by their capacity to reduce neural mechanosensitivity and restore normal nerve excursion, particularly in the spinal accessory nerve affected by cervical lymph node dissection. These techniques improve axoplasmic flow, reduce intraneural edema, and decrease adverse mechanical tension, which together may lower nociceptive input and enhance neuromuscular function [ 24 25 26 27 28 5 7 12 24 27 28 29 Regarding the findings in the reduction in pain intensity, the NDMTs group reported significantly lower pain levels in VAS scale. This aligns with prior studies in other cancer populations, such as breast cancer patients, where the application of NDMTs have been shown improvements in pain intensity [ 24 12 25 26 27 30 Considering the improvements in shoulder function, the NDMTs group exhibited enhanced motor function recovery, which supports findings from other studies related to the benefits of resistance exercises and physiotherapy interventions for shoulder rehabilitation in cancer patients [ 29 30 31 32 33 9 Regarding strength, there were no significant differences between the groups. Since both of them performed a strength exercise program it is likely that both experienced improvements in strength, leading to similar outcomes and reducing the likelihood of a statistically significant difference between them. In addition, the ICC value (0.813) suggests that strength changes depended more on individual differences (ICC = 0.813) rather than the treatment alone. Shoulder dysfunction related with HNC surgery has a significant impact on daily life, including activities of daily living, social interactions, and quality of life [ 29 34 35 36 37 4.1. Limitations This study has several limitations that should be acknowledged. First, the small sample size (n = 20) and pilot design limit the statistical power and generalizability of the findings, although they do provide a foundation for future research. Second, the short follow-up duration (3 months post-treatment) may not fully capture long-term outcomes or the sustainability of improvements in shoulder function and quality of life. Third, the intervention protocol was standardized across participants, which may not reflect individualized clinical practice or account for patient-specific variability in response to treatment. Additionally, participants and the treating physiotherapist could not be blinded, which may introduce performance or response bias; we mitigated detection bias through assessor blinding and matched session frequency/duration across groups Finally, the absence of objective measures of nerve function (e.g., electromyography or nerve conduction studies) limits mechanistic conclusions. Future larger-scale trials with extended follow-up and more robust neurophysiological assessments are warranted to validate and expand upon these preliminary findings. 4.2. Future Lines Further work should delineate the optimal dosage, frequency, and duration of neurodynamic mobilization, and evaluate its comparative and additive benefits against established rehabilitation approaches. Larger, adequately powered multicenter trials with longer follow-up are needed to determine whether these effects translate into sustained improvements in pain, function, and quality of life among cancer survivors. 4.3. Practical Applications The findings of the present study suggest that NDMTs could be effectively integrated into standard physiotherapy protocols for patients experiencing shoulder dysfunction after HNC surgery. An early implementation of these techniques in the postoperative period may prevent the progression of shoulder dysfunction, improving recovery and reducing long-term disability. 5. Conclusions Neurodynamic mobilization techniques (NDMTs) significantly improve pain, shoulder function, and quality of life in patients with shoulder dysfunction after head and neck cancer surgery. Integrating NDMTs into oncological physiotherapy protocols may enhance recovery and prevent long-term disability. These results are preliminary and require confirmation in larger, multicenter studies with longer follow-up. Disclaimer/Publisher’s Note: Supplementary Materials The following supporting information can be downloaded at: https://www.mdpi.com/article/10.3390/medicina61091636/s1 Author Contributions Conceptualization, R.P.-G. and D.P.-M.; Data curation, C.R.-M.; Formal analysis, C.R.-M.; Investigation, R.P.-G. and V.A.-P.; Methodology, R.P.-G. and D.P.-M.; Resources, R.P.-G.; Writing—original draft, R.P.-G. and V.A.-P.; Writing—review and editing, R.P.-G., V.A.-P., D.P.-M. and C.R.-M. All authors have read and agreed to the published version of the manuscript. Institutional Review Board Statement The study design was approved by Complejo Hospitalario Universitario de Canarias, Spain (CHUNSC_2021_91) and the trial was registered (ClinicalTrials: NCT05604235 Informed Consent Statement Informed consent was obtained from all subjects involved in the study. Data Availability Statement Data are available as supplementary material Conflicts of Interest The authors declare no conflicts of interest. Abbreviations The following abbreviations are used in this manuscript: HNC Head and Neck Cancer NDMTs Neurodynamic Mobilization Techniques QLQH&N35 Quality of life Head & Neck VAS Visual Analog Scale DASH Disabilities of the Arm, Shoulder and Hand References 1. Guo K. Xiao W. Chen X. Zhao Z. Lin Y. Chen G. Epidemiological Trends of Head and Neck Cancer: A Population-based Study BioMed Res. Int. 2021 2021 1738932 34337000 10.1155/2021/1738932 PMC8294963 2. Seijas-Tamayo R. Fernández-Mateos J. Adansa Klain J.C. Mesía R. Pastor Borgoñón M. Pérez-Ruiz E. Vázquez Fernández S. Salvador Coloma C. Rueda Domínguez A. Taberna M. Epidemiological Characteristics of a Spanish Cohort of Patients Diagnosed with Squamous Cell Carcinoma of Head and Neck: Distribution of Risk Factors by Tumor Location Clin. Transl. Oncol. 2016 18 1114 1122 10.1007/s12094-016-1493-1 27112939 3. Gormley M. Creaney G. Schache A. Ingarfield K. Conway D.I. Reviewing the Epidemiology of Head and Neck Cancer: Definitions, Trends and Risk Factors Br. Dent. J. 2022 233 780 786 10.1038/s41415-022-5166-x 36369568 PMC9652141 4. Carazo-Casas C. Gil-Prieto R. Hernández-Barrera V. Gil de Miguel Á. Trends in Hospitalization and Death Rates among Patients with Head and Neck Cancer in Spain, 2009 to 2019 Hum. Vaccines Immunother. 2022 18 2082192 10.1080/21645515.2022.2082192 PMC9621082 35930449 5. Mehanna H. Paleri V. West C.M.L. Nutting C. Head and Neck Cancer—Part 1: Epidemiology, Presentation, and Prevention BMJ 2010 341 c4684 10.1136/bmj.c4684 20855405 6. Owens D. Paleri V. Jones A.V. Head and Neck Cancer Explained: An Overview of Management Pathways Br. Dent. J. 2022 233 721 725 10.1038/s41415-022-5199-1 36369551 PMC9650163 7. Anderson G. Ebadi M. Vo K. Novak J. Govindarajan A. Amini A. An Updated Review on Head and Neck Cancer Treatment with Radiation Therapy Cancers 2021 13 4912 10.3390/cancers13194912 34638398 PMC8508236 8. Ronen O. Robbins K.T. Shaha A.R. Kowalski L.P. Mäkitie A.A. Florek E. Ferlito A. Emerging Concepts Impacting Head and Neck Cancer Surgery Morbidity Oncol. Ther. 2023 11 1 13 10.1007/s40487-022-00217-0 36565427 PMC9935772 9. Almeida K.A.M. Rocha A.P. Carvas N. Jr. Pinto A.C.P.N. Rehabilitation Interventions for Shoulder Dysfunction in Patients with Head and Neck Cancer: Systematic Review and Meta-Analysis Phys. Ther. 2020 100 1997 2008 10.1093/ptj/pzaa147 32750136 10. Baldoman D. Vandenbrink R. Physical Therapy Challenges in Head and Neck Cancer Multidisciplinary Care of the Head and Neck Cancer Patient Springer International Publishing Cham, Switzerland 2018 209 223 10.1007/978-3-319-65421-8_12 29435844 11. Ballestero-Pérez R. Plaza-Manzano G. Urraca-Gesto A. Romo-Romo F. Atín-Arratibel M.d.l.Á. Pecos-Martín D. Gallego-Izquierdo T. Romero-Franco N. Effectiveness of Nerve Gliding Exercises on Carpal Tunnel Syndrome: A Systematic Review J. Manip. Physiol. Ther. 2017 40 50 59 10.1016/j.jmpt.2016.10.004 27842937 12. Joshi D. Shah S. Shinde S.B. Patil S. Effect of Neural Tissue Mobilization on Sensory-Motor Impairments in Breast Cancer Survivors with Lymphedema: An Experimental Study Asian Pac. J. Cancer Prev. APJCP 2023 24 313 10.31557/APJCP.2023.24.1.313 36708582 PMC10152862 13. Carvalho A.P.V. Vital F.M.R. Soares B.G.O. Exercise Interventions for Shoulder Dysfunction in Patients Treated for Head and Neck Cancer Cochrane Database Syst. Rev. 2012 2012 CD008693 10.1002/14651858.CD008693.pub2 22513964 PMC11537249 14. Zwarenstein M. Treweek S. Gagnier J.J. Altman D.G. Tunis S. Haynes B. Oxman A.D. Moher D. Improving the Reporting of Pragmatic Trials: An Extension of the CONSORT Statement BMJ 2008 337 a2390 10.1136/bmj.a2390 19001484 PMC3266844 15. World Medical Association World Medical Association Declaration of Helsinki: Ethical Principles for Medical Research Involving Human Subjects JAMA-J. Am. Med. Assoc. 2013 310 2191 2194 10.1001/jama.2013.281053 24141714 16. Osoba D. Rodrigues G. Myles J. Zee B. Pater J. Interpreting the Significance of Changes in Health-Related Quality-of-Life Scores J. Clin. Oncol. 1998 16 139 144 10.1200/JCO.1998.16.1.139 9440735 17. Beck A.-J.C.C. Kieffer J.M. Retèl V.P. van Overveld L.F.J. Takes R.P. van den Brekel M.W.M. van Harten W.H. Stuiver M.M. Mapping the EORTC QLQ-C30 and QLQ-H&N35 to the EQ-5D for Head and Neck Cancer: Can Disease-Specific Utilities Be Obtained? PLoS ONE 2019 14 e0226077 10.1371/journal.pone.0226077 31834892 PMC6910681 18. Arraras J.I. Arias F. Tejedor M. Vera R. Pruiá E. Marcos M. Martínez E. Valerdi J.J. El Cuestionario de Calidad de Vida Para Tumores de Cabeza y Cuello de La EORTC QLQ-HFN35. Estudio de Validación Para Nuestro País Oncología 2001 24 482 491 19. Bjordal K. Hammerlid E. Ahlner-Elmqvist M. De Graeff A. Boysen M. Evensen J.F. Biörklund A. De Leeuw J.R.J. Fayers P.M. Jannert M. Quality of Life in Head and Neck Cancer Patients: Validation of the European Organization for Research and Treatment of Cancer Quality of Life Questionnaire-H&N35 J. Clin. Oncol. 1999 17 1008 10.1200/jco.1999.17.3.1008 10071296 20. Boonstra A.M. Preuper H.R.S. Reneman M.F. Posthumus J.B. Stewart R.E. Reliability and Validity of the Visual Analogue Scale for Disability in Patients with Chronic Musculoskeletal Pain Int. J. Rehabil. Res. 2008 31 165 169 10.1097/MRR.0b013e3282fc0f93 18467932 21. Rodriguez C.S. McMillan S. Yarandi H. Pain Measurement in Older Adults with Head and Neck Cancer and Communication Impairments Cancer Nurs. 2004 27 425 433 10.1097/00002820-200411000-00001 15632781 22. Beaton D.E. Katz J.N. Fossel A.H. Wright J.G. Tarasuk V. Bombardier C. Measuring the Whole or the Parts?: Validity, Reliability, and Responsiveness of the Disabilities of the Arm, Shoulder and Hand Outcome Measure in Different Regions of the Upper Extremity J. Hand Ther. 2001 14 128 142 10.1016/S0894-1130(01)80043-0 11382253 23. Cubas C.L. Neurodynamics in Clinical Practice [Neurodinámica En La Práctica Clínica] Wolters Kluwer Alphen aan den Rijn, The Netherlands 2022 8418892064 24. Velkumary S. Sethi P. Feula J.M. Subhashri S. Abirami M. Association of Handgrip Strength and Endurance with Body Composition in Head and Neck Cancer Patients J. Fam. Med. Prim. Care 2021 10 910 916 10.4103/jfmpc.jfmpc_1695_20 34041097 PMC8138385 25. Giacalone A. Alessandria P. Ruberti E. The Physiotherapy Intervention for Shoulder Pain in Patients Treated for Breast Cancer: Systematic Review Cureus 2019 11 e6416 10.7759/cureus.6416 31988817 PMC6970094 26. Adiguzel Tat H. Kirmaci Z.I.K. Erel S. Inanç Y. Berktas D.T. The Effects of Neurodynamic Mobilization Exercises on Upper Extremity Pain, Muscle Strength, and Functions in Patients with Multiple Sclerosis: A Randomised Controlled, Single Blinded Study Mult. Scler. Relat. Disord. 2025 93 106240 10.1016/j.msard.2024.106240 39731903 27. Macias C.H. Ortega J.R. Serrano-Sánchez F.J. Díaz-Mancha J.A. Fernández Seguín L. Cabañes-García J. Effectiveness of the Scapula Mobilization Technique on the Neural Mechanosensitivity of the Upper Limb Neural Test 1 in Individuals with Mechanical Cervicalgia. A Randomized Controlled Trial J. Bodyw. Mov. Ther. 2024 40 1926 1931 10.1016/j.jbmt.2024.10.006 39593546 28. Shamsi H. Khademi-Kalantari K. Okhovatian F. Effects of Neural Mobilization Techniques on Painand Disabilityin Patients with Neurodynamic Dysfunction: A Systematic Review of Randomized Controlled Trials J. Mod. Rehabil. 2021 15 209 218 10.18502/jmr.v15i4.7741 29. Do J.H. Yoon I.J. Cho Y.K. Ahn J.S. Kim J.K. Jeon J. Comparison of Hospital Based and Home Based Exercise on Quality of Life, and Neck and Shoulder Function in Patients with Spinal Accessary Nerve Injury after Head and Neck Cancer Surgery Oral Oncol. 2018 86 100 104 10.1016/j.oraloncology.2018.06.019 30409289 30. González-Matilla R. Abuín-Porras V. Casuso-Holgado M.J. Riquelme I. Heredia-Rizo A.M. Effects of Neural Mobilization in Disorders Associated with Chronic Secondary Musculoskeletal Pain: A Systematic Review and Meta-Analysis Complement. Ther. Clin. Pract. 2022 49 101618 10.1016/j.ctcp.2022.101618 35780543 31. Barreto Mozzini C. Ribeiro Rodrigues T. Bergmann A. Cristina Roussenq S. Paulo Kowalski L. Lopes Carvalho A. Adherence to a Shoulder Dysfunction Physical Therapy Protocol after Neck Dissection with Accessory Nerve Preservation in Head-and-Neck Cancer Patients: An Uncontrolled Clinical Trial J. Health Sci. 2022 16 22 29 PMC9288137 35949697 32. McNeely M.L. Parliament M.B. Seikaly H. Jha N. Magee D.J. Haykowsky M.J. Courneya K.S. Effect of Exercise on Upper Extremity Pain and Dysfunction in Head and Neck Cancer Survivors: A Randomized Controlled Trial Cancer 2008 113 214 222 10.1002/cncr.23536 18457329 33. Chan D.N.S. Lui L.Y.Y. So W.K.W. Effectiveness of Exercise Programmes on Shoulder Mobility and Lymphoedema after Axillary Lymph Node Dissection for Breast Cancer: Systematic Review J. Adv. Nurs. 2010 66 1902 1914 10.1111/j.1365-2648.2010.05374.x 20626480 34. Monleon S. Ferrer M. Tejero M. Pont A. Piqueras M. Belmonte R. Shoulder Strength Changes One Year After Axillary Lymph Node Dissection or Sentinel Lymph Node Biopsy in Patients With Breast Cancer Arch. Phys. Med. Rehabil. 2016 97 953 963 10.1016/j.apmr.2015.12.014 26763950 35. Devoogdt N. Van Kampen M. Christiaens M.R. Troosters T. Piot W. Beets N. Nys S. Gosselink R. Short- and Long-Term Recovery of Upper Limb Function after Axillary Lymph Node Dissection Eur. J. Cancer Care 2011 20 77 86 10.1111/j.1365-2354.2009.01141.x 19708945 36. Ackerman I.N. Fotis K. Pearson L. Schoch P. Broughton N. Brennan-Olsen S.L. Bucknill A. Cross E. Bunting-Frame N. Page R.S. Impaired Health-Related Quality of Life, Psychological Distress, and Productivity Loss in Younger People with Persistent Shoulder Pain: A Cross-Sectional Analysis Disabil. Rehabil. 2022 44 3785 3794 10.1080/09638288.2021.1887376 33620022 37. Pak S.S. Janela D. Freitas N. Costa F. Moulder R. Molinos M. Areias A.C. Bento V. Cohen S.P. Yanamadala V. Comparing Digital to Conventional Physical Therapy for Chronic Shoulder Pain: Randomized Controlled Trial J. Med. Internet Res. 2023 25 e49236 10.2196/49236 37490337 PMC10474513 Figure 1 CONSORT 2010 Flow Diagram. medicina-61-01636-t001_Table 1 Table 1 Sociodemographic features of the sample. Data Experimental (n = 10) Controls (n = 10) p t Age, years 0.443 Weight, kilograms 0.756 Height, meters 0.439 BMI, k/m 2 0.817 Sex, masculine/feminine 6/4 7/3 N/A Abbreviations: BMI = Body Mass Index. medicina-61-01636-t002_Table 2 Table 2 Mixed linear model to assess the time and groups factors for pain intensity, test neuro, strength, HN35, painHN35 and DASH.      Fixed Effects Outcome Measure Time Point Experimental n = 10 Control n = 10 ICC, (R 2 m 2 c Time η p 2 Group × Time η p 2 Pain intensity    ICC = 0.610, (R 2 m 2 c F (1, 3) = 89.41; P = 0.001 (0.832) F (1, 3) = 25.11; P = 0.001 (0.582)  Baseline 6.80 ±2.44 6.10 ± 1.66     Middle–Term 5.50 ± 1.9 5.70 ± 1.5     Final 1.00 ± 1.2 4.80 ± 1.5     Follow up 0.40 ± 0.5 3.70 ± 1.16    Test Neuro    ICC = 0.103 (R 2 m 2 c F (1, 3) = 42.00; P = 0.001 (0.700) F (1, 3) = 6.92; P = 0.001 (0.278)  Baseline 1.00 ± 0.0 1.00 ± 0.0     Middle–Term 0.90 ± 0.0 1.00 ± 0.0     Final 0.10 ± 0.3 0.80 ± 0.4     Follow up 0.40 ± 0.0 0.40 ± 0.0    Strength    ICC = 0.813 (R 2 m 2 c F (1, 3) = 76.36; P = 0.001 (0.809) F (1, 3) = 0.393; P = 0.759 (0.021)  Baseline 19.0 ± 11.6 26.7 ± 9.9     Middle–Term 26.3 ± 10.3 32.8 ± 9.0     Final 35.5 ± 10.8 43.5 ± 9.2     Follow up 37.3 ± 9.5 45.3 ± 6.9    HN35    ICC = 0.010 (R 2 m 2 c F (1, 3) = 1127.2; P = 0.001 (0.984) F (1, 3) = 4.23; P = 0.009 (0.190)  Baseline 1.09 ± 0.2 1.33 ± 0.2     Middle–Term 36.7 ± 5.3 41.5 ± 4.8     Final 1.08 ± 0.1 1.22 ± 0.1     Follow up 0.03 ± 0.0 0.03 ± 0.0    PainHN35    ICC = 0.771 (R 2 m 2 c F (1, 3) = 32.933; P = 0.001 (0.647) F (1, 3) = 7.753; P = 0.001 (0.301)  Baseline 29.31 ± 17.5 21.2 ± 17.7     Middle–Term 20.8 ± 15.4 17.5 ± 15.8     Final 5.78 ± 4.4 14.1 ± 14.0     Follow up 3.0 ± 2.0 10.8 ± 13.7    DASH    ICC = 0.413, (R 2 m 2 c F (1, 3) = 505.4; P = 0.001 (0.966) F (1, 3) = 36.2; P = 0.001 (0.668)  Baseline 56.5 ± 10.9 46.6 ± 5.0     Middle–Term 36.7 ± 5.3 41.5 ± 4.8     Final 1.8 ± 2.6 17.3 ± 5.4     Follow up 0.7 ± 1.5 14.7 ± 4.3    ",
  "metadata": {
    "Title of this paper": "Comparing Digital to Conventional Physical Therapy for Chronic Shoulder Pain: Randomized Controlled Trial",
    "Journal it was published in:": "Medicina",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12471930/"
  }
}