{
  "title": "Paper_1224",
  "abstract": "pmc Neurol Int Neurol Int 1527 neurolint neurolint Neurology International 2035-8385 2035-8377 Multidisciplinary Digital Publishing Institute  (MDPI) PMC12472282 PMC12472282.1 12472282 12472282 41002936 10.3390/neurolint17090148 neurolint-17-00148 1 Article Association Between Carotid Artery Small Plaque on Computed Tomography Angiography and Embolic Stroke of Undetermined Source Nagasawa Junpei Yokoyama Tatsuhiro Ogawa Makiko Okamoto Ryuichi Shibukawa Mari Ebina Junya Hirayama Takehisa Kano Osamu * Fonkem Ekokobe Academic Editor Bhagat Riwaj Academic Editor Department of Neurology, Toho University Faculty of Medicine, Tokyo 143-8541, Japan; n.junpei62@gmail.com * osamu.kano@med.toho-u.ac.jp 14 9 2025 9 2025 17 9 497663 148 07 7 2025 09 9 2025 11 9 2025 14 09 2025 27 09 2025 27 09 2025 © 2025 by the authors. 2025 https://creativecommons.org/licenses/by/4.0/ Licensee MDPI, Basel, Switzerland. This article is an open access article distributed under the terms and conditions of the Creative Commons Attribution (CC BY) license ( https://creativecommons.org/licenses/by/4.0/ Objectives Materials and Methods Results Conclusions carotid artery small plaque embolic stroke of undetermined source computed tomography angiography unstable plaque JSPS KAKENHI 25K10759 This study was supported by JSPS KAKENHI (grant number: 25K10759, accessed on 12 March 2025). pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement no pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes 1. Introduction Embolic stroke of undetermined source (ESUS) represents nearly one-sixth of ischemic strokes and is associated with a higher likelihood of recurrence compared with other subtypes [ 1 Therefore, it is necessary to consider further effective preventive strategies that are tailored to the specific underlying embolic source. In earlier hypotheses, the majority of embolic sources in ESUS were believed to be occult paroxysmal atrial fibrillation (Paf) [ 2 3 Nevertheless, both the NAVIGATE ESUS and RE-SPECT ESUS trials, which evaluated direct oral anticoagulants against aspirin in ESUS patients, failed to show a superiority of direct-acting oral anticoagulants (DOACs) over aspirin [ 4 5 These findings suggest that subclinical atrial fibrillation may not be the predominant cause of ESUS and that alternative mechanisms such as arteriogenic cerebral embolism may play a more significant role. Moreover, even with prolonged cardiac rhythm monitoring using an insertable cardiac monitor (ICM), Paf is detected in only approximately 23% of patients with ESUS [ 6 7 8 Other potential causes of ESUS include low-risk cardioembolic sources, paradoxical embolism through a patent foramen ovale (PFO), cancer-associated stroke, and aortic arch atheroma. However, an increasing number of reports suggest that arteriogenic cerebral embolism may be more prevalent than previously thought [ 9 Stenosis of ≥50% is required to determine whether cerebral infarction is caused by carotid atherosclerotic disease according to the commonly used classification criteria for cerebral infarction [ 10 11 However, even non-stenotic small plaques with a stenosis rate of <50% have been recently reported to become embolic sources of cerebral infarction [ 12 13 Herein, we evaluated the relationship between non-stenotic plaques and ESUS using computed tomography (CT) angiography (CTA). We predicted that in patients with ESUS of the anterior circulatory system, more non-stenotic plaques would exist in the carotid artery ipsilateral to the infarct than on the contralateral side. 2. Materials and Methods We conducted a retrospective review of a comprehensive, single-center database that prospectively collected data on a consecutive series of patients who were hospitalized for acute stroke at our institution between April 2017 and December 2022; from this cohort, we identified and enrolled those who met the diagnostic criteria for ESUS during the study period according to predefined inclusion and exclusion criteria. Inclusion criteria (entry) were Age ≥ 18 years; Diagnosis of unilateral anterior circulation ESUS according to the Cryptogenic Stroke/ESUS International Working Group criteria; Underwent CTA during the index hospitalization. Exclusion criteria (exit) were 4. ESUS involving posterior circulation; 5. Bilateral anterior circulation ESUS (excluded because our study aimed to evaluate the relationship between carotid small plaques and ESUS, and such plaques are unlikely to cause bilateral anterior circulation infarcts, making side-to-side comparison unfeasible); 6. Incomplete or poor-quality CTA images. From an initial 71 patients with unilateral anterior circulation ESUS, 36 without CTA were excluded, leaving 35 patients for the final analysis. We diagnosed ESUS according to the Cryptogenic Stroke/ESUS International Working Group criteria as follows: (a) ischemic stroke detected using CT or magnetic resonance imaging (MRI) that is not lacunar; (b) absence of extracranial or intracranial atherosclerosis causing ≥ 50% luminal stenosis in the arteries supplying the area of ischemia; (c) no major risk of cardioembolic embolism source; and (d) stroke was not attributed to any other defined etiology, such as arteritis, arterial dissection, migraine with vasospasm, or substance abuse. The degree of arterial stenosis was assessed using the North American Symptomatic Carotid Endarterectomy Trial (NASCET) criteria, which is a widely recognized and extensively utilized method for evaluating the severity of vascular narrowing [ 14 CTA acquisition parameters were as follows: 64-slice multidetector CT scanner (Aquilion Precision; Canon Medical Systems), slice thickness of 0.625 mm, and intravenous administration of 70 mL of nonionic contrast medium (iopamidol, 370 mgI/mL) at a rate of 26–30 mgI/kg/sec, with imaging from the aortic arch to the circle of Willis using a bolus-tracking technique. CTA images were evaluated using axial, sagittal, and coronal source images with a standardized window level setting (WL: 300 HU, WW: 700 HU) optimized for vascular assessment. CTA was performed within 7 days after symptom onset. We evaluated the presence or absence of non-stenotic carotid artery plaque lesions ipsilateral and contralateral to the cerebral infarction lesion using CTA and quantitatively compared the thickness of these plaques between the two sides. All images were reviewed independently by two board-certified neurologists blinded to both the stroke side and all clinical data. Agreement between raters was evaluated with Cohen’s kappa coefficient (κ = 0.87), indicating strong agreement. In cases of disagreement, consensus was reached through joint review. Plaque thickness was measured manually using electronic calipers perpendicular to the vessel wall at the point of maximal protrusion into the lumen ( Figure 1 15 16 17 18 Additionally, we investigated whether additional non-stenotic plaques were present on the ESUS side than on the contralateral side. The side identified as the ESUS side corresponded to the hemisphere in which the cerebral infarction occurred, as confirmed by imaging findings. Based on our study hypothesis, we anticipated that non-stenotic plaques would be more frequently observed on the ipsilateral side of the cerebral infarction, corresponding to the ESUS side. Additionally, we collected data regarding the medical history and baseline characteristics of each patient, including age, sex, National Institutes of Health Stroke Scale (NIHSS) score at admission, hypertension, diabetes, dyslipidemia, chronic kidney disease, smoking status, and history of alcohol consumption. For clarity, Figure 1 Figure 2 Statistical Analysis We conducted a statistical analysis to evaluate differences in the presence of carotid artery plaques between the ESUS side and the contralateral (non-ESUS) side. Categorical variables were summarized and reported as absolute numbers accompanied by their corresponding percentages, whereas continuous data were described as mean ± standard deviation. Categorical comparisons were made using either the chi-squared test or Fisher’s exact test, selected according to the distribution of expected frequencies. For continuous variables, unpaired (independent samples) t p 3. Results During the study period from April 2017 to December 2022, a total of 951 individuals were hospitalized at our center with a diagnosis of stroke. Among these, 755 patients were determined to have experienced cerebral infarction based on neuroimaging and clinical evaluation. Of this subgroup, 109 individuals met the diagnostic criteria for ESUS. After applying exclusion criteria—specifically eliminating patients with ESUS affecting the posterior circulation or those with bilateral anterior circulation involvement—a total of 71 patients were identified as having ESUS localized to the unilateral anterior circulation. Subsequently, patients who had not undergone computed tomography angiography (CTA) were further excluded from the study population ( n Figure 2 A total of 951 patients with stroke were hospitalized during the study period, of whom 755 had cerebral infarction. Among these, 109 were diagnosed with ESUS. After excluding cases involving posterior or bilateral anterior circulation, 71 patients with unilateral anterior circulation ESUS remained. Of these, 36 who did not undergo CT were excluded, leaving 35 patients enrolled in the study. Within this cohort of 35 patients, we investigated the prevalence of carotid artery plaques exceeding 3 mm in maximum thickness, comparing findings between the side corresponding to the ESUS-related infarction and the contralateral, unaffected side. The proportion of patients with plaques greater than 3 mm was significantly higher on the ESUS side compared to the contralateral side, with prevalence rates of 31% (11 out of 35 patients) versus 8% (3 out of 35 patients), respectively. Statistical analysis revealed this difference to be significant ( p Table 1 In terms of quantitative plaque burden, the mean thickness of carotid artery plaques on the ESUS-affected side was calculated to be 1.93 ± 2.01 mm (mean ± standard deviation), with a median plaque thickness of 2.0 mm and an interquartile range (IQR) spanning from 0.0 to 3.3 mm. These findings indicate considerable variability in plaque size, including the presence of patients with notably large plaques. In contrast, the contralateral carotid artery demonstrated a reduced average plaque thickness of 1.09 ± 1.46 mm, accompanied by a median value of 0 mm and an IQR ranging from 0.0 to 2.8 mm. This distribution suggests that a significant portion of patients exhibited either minimal plaque accumulation or an absence of detectable plaques on the contralateral side. Although the side-by-side comparison in plaque thickness did not reach the threshold for statistical significance ( p To further explore the clinical relevance of carotid plaque burden, we compared baseline characteristics between two patient subgroups—those with and those without plaques measuring ≥ 3 mm on the ESUS side. Variables assessed included age, sex, NIHSS score at admission, and typical vascular risk factors including hypertension, dyslipidemia, diabetes mellitus, chronic kidney disease, smoking history, and alcohol use. Nevertheless, none of these variables showed statistically significant differences between the two groups ( Table 2 4. Discussion In the present study, we demonstrated that patients diagnosed with embolic stroke of undetermined source (ESUS) were significantly more likely to exhibit non-stenotic carotid artery plaques measuring 3 mm or greater on the infarcted side compared to the contralateral side. This asymmetrical distribution of plaque burden provides new evidence supporting the hypothesis that non-stenotic carotid plaques—although traditionally regarded as having limited clinical significance compared to hemodynamically significant stenotic lesions—may play a more prominent and active role in the pathogenesis of ESUS than previously appreciated. This finding carries important clinical implications, particularly given the fact that ESUS continues to pose a substantial diagnostic and therapeutic challenge in everyday stroke management. The term ESUS encompasses a heterogeneous group of patients, and the embolic sources in many of these cases often remain elusive, even after comprehensive diagnostic workup. In this context, identifying a plausible arterial embolic source—such as non-stenotic atherosclerotic plaque formation—could significantly enhance our mechanistic understanding of stroke etiology in ESUS and serve as a basis for improved clinical decision-making. More specifically, recognizing these non-stenotic plaques as potential contributors to cerebral embolism may allow clinicians to more accurately stratify stroke risk in patients who lack conventional high-risk embolic sources, such as paroxysmal atrial fibrillation or severe carotid artery stenosis. Such insights could help refine current diagnostic frameworks and enable the development of more individualized secondary prevention strategies, tailored to the underlying mechanism of stroke in each patient. The implication of our findings is that a substantial subset of patients who are currently grouped under the broad and often ambiguous category of ESUS may actually harbor covert atherosclerotic mechanisms that are not detected by conventional criteria focused primarily on the degree of stenosis. These subclinical atherogenic sources could represent actionable targets for therapy, particularly through intensified antiplatelet regimens or more aggressive lipid-lowering strategies aimed at plaque stabilization. This evolving paradigm—shifting from a purely stenosis-based approach to one that incorporates detailed plaque morphology and vulnerability—has the potential to significantly improve clinical outcomes by enabling more precise, mechanism-specific, and individualized treatment approaches for this complex and heterogeneous patient population. According to widely accepted classification criteria for ischemic stroke, such as the TOAST (Trial of Org 10172 in Acute Stroke Treatment) criteria, carotid atherosclerotic disease is generally considered a causative embolic source only when the degree of stenosis reaches 50% or greater [ 10 11 In recent years, this notion has gained increasing support from a number of observational and imaging studies, which suggest that the risk posed by non-stenotic carotid plaques may be considerably greater than previously considered. Supporting this evolving perspective, several recent studies have reported that even non-stenotic small plaques with a stenosis rate of less than 50% can serve as embolic sources of cerebral infarction [ 12 Our findings are consistent with these previous clinical studies in demonstrating a higher prevalence of ipsilateral non-stenotic plaques in patients with ESUS. However, our work extends prior evidence by using CTA—a widely available, standardized, and reproducible modality—instead of ultrasound or MRI, thereby highlighting the feasibility of incorporating plaque assessment into routine acute stroke imaging. This practical advantage could facilitate broader application in clinical settings, particularly in centers without ready access to advanced plaque imaging techniques. Of these mechanisms, increasing focus has been directed toward the link between non-stenotic plaques and ESUS, since accumulating evidence indicates that such lesions may act as hidden arterial sources of embolism in this subtype of stroke. These findings challenge the long-held assumption that only hemodynamically significant stenosis is clinically relevant. For example, a high-resolution MRI-based plaque imaging study demonstrated that only carotid plaques with a thickness of ≥2.2 mm exhibited imaging features characteristic of unstable plaques, such as intraplaque hemorrhage or lipid-rich necrotic cores [ 19 Previous reports that examined the size threshold differentiating asymptomatic from symptomatic carotid plaques in patients with carotid artery stenosis have also reported cutoff values of ≥2.2 mm and ≥3.5 mm, further reinforcing the clinical significance of plaque thickness in risk stratification and suggesting that even moderately sized plaques may have pathogenic potential depending on their composition and biological behavior [ 16 20 17 18 CTA has several advantages in that it does not require any special examination techniques and demonstrates high inter-examiner reliability, unlike ultrasonography, which is more operator-dependent. Furthermore, many medical institutions already widely utilize CTA as a routine imaging modality. In addition, the relatively short examination time makes CTA particularly suitable for use in the acute phase of cerebral infarction, where rapid evaluation is essential. Compared to MRI and ultrasonography, CTA provides superior visualization and an easier evaluation of calcified vascular lesions, which can be challenging to assess accurately by those modalities. In addition, CTA allows for a comprehensive evaluation of vascular territories that are challenging to examine with ultrasound or MRA, including the proximal part of the common carotid artery and the distal internal carotid artery segment adjacent to the skull base. Taking all these advantages into consideration, we believe that CTA is a highly useful tool for evaluating potential embolic sources in patients diagnosed with ESUS. Recently, the clinical concept of symptomatic non-stenotic carotid disease (SyNC) has been introduced to characterize patients who experience ischemic cerebrovascular events despite the lack of substantial narrowing in the carotid artery. This framework acknowledges that non-stenotic carotid plaques may nevertheless possess high-risk features, such as plaque instability or thrombogenic potential, which contribute to stroke pathogenesis [ 13 21 In the present study, we found that the presence or absence of carotid artery plaques measuring 3 mm or greater on the ESUS side was not associated with any significant differences in traditional vascular risk factors or baseline clinical characteristics, including hypertension, diabetes mellitus, dyslipidemia, chronic kidney disease, and lifestyle factors such as smoking and alcohol consumption. Previous studies have reported that males tend to have a higher prevalence of non-stenotic carotid artery plaques compared to females. Furthermore, these studies have indicated that there are notable sex differences in the risk factors associated with non-stenotic carotid plaques, where aging and hypertension are considered the primary risk factors in male patients, whereas tobacco use is recognized as a more prominent risk factor among female patients [ 22 Our findings should be interpreted considering several important limitations, which are summarized below. First, our small sample size ( n Finally, this was a single-center, retrospective study conducted in a Japanese cohort, excluding posterior circulation and bilateral ESUS cases. These factors limit external validity, and findings may not be generalizable to other populations or stroke subtypes. To address these limitations, future studies employing prospective study designs are essential. In particular, large-scale, multicenter prospective research would provide more robust evidence by minimizing selection bias and increasing the generalizability of findings. Such well-designed prospective investigations would also allow for a more precise evaluation of carotid plaque characteristics using advanced imaging modalities, thereby contributing to a deeper understanding of their clinical significance and improving patient care. In addition, our study highlights important research gaps in this field. First, there is a scarcity of studies evaluating symptomatic non-stenotic carotid disease (SyNC) using CTA, particularly in the context of ESUS. Second, most existing data are derived from single-center, retrospective analyses, which limit the generalizability of findings. Third, there is a need for future multicenter, prospective studies incorporating advanced imaging modalities—such as high-resolution MRI or targeted carotid ultrasound—to better characterize plaque morphology and vulnerability. By identifying these gaps, our study helps set a research agenda for future investigations. Our study addresses one of these gaps by providing preliminary evidence that non-stenotic carotid plaque thickness, as assessed by CTA, is associated with the side of infarction in ESUS. This relationship has been underexplored in the literature, and our findings contribute to a growing body of evidence supporting the role of small, non-stenotic plaques as potential embolic sources. These results may inform future research aimed at refining diagnostic criteria for ESUS and guiding mechanism-specific preventive strategies. 5. Conclusions Patients with ESUS were more likely to demonstrate non-stenotic plaques of ≥3 mm within the carotid artery on the infarcted side compared with the carotid artery on the opposite side. These findings support the concept that small, non-stenotic plaques may be a source of embolism. However, given the limited sample size, a lack of plaque vulnerability assessment, and restricted generalizability, our results should be interpreted cautiously and viewed as hypothesis-generating. Larger, prospective, multicenter studies with comprehensive plaque characterization are warranted. Acknowledgments We would like to thank Editage ( www.editage.jp Disclaimer/Publisher’s Note: Author Contributions J.N., J.E., R.O. and M.S. conceived the study. T.Y., M.O. and T.H. developed the statistical analysis plan. J.N. drafted the original manuscript. O.K. supervised the study. All authors reviewed the draft and critically revised the manuscript for intellectual content. All authors have read and agreed to the published version of the manuscript. Institutional Review Board Statement This study was approved by the Ethics Committee of Toho University Omori Medical Center (approval number: M20187 Informed Consent Statement Patient consent was waived due to the retrospective nature of the study, with an opt-out procedure provided for all potential participants. Data Availability Statement The data that support the findings of this study are not publicly available because they contain information that could compromise the privacy of research participants but are available from the corresponding author upon reasonable request. Conflicts of Interest The authors have no conflicts of interest to declare. During the preparation of this work, the author(s) used ChatGPT (OpenAI, GPT-4) to assist with English language editing and to improve the clarity and organization of the text. After using this tool, the author(s) reviewed and edited the content as needed and take full responsibility for the content of the publication. References 1. Hart R.G. Catanese L. Perera K.S. Ntaios G. Connolly S.J. Embolic Stroke of Undetermined Source: A Systematic Review and Clinical Update Stroke 2017 48 867 872 10.1161/STROKEAHA.116.016414 28265016 2. Ntaios G. Papavasileiou V. Milionis H. Makaritsis K. Manios E. Spengos K. Michel P. Vemmos K. Embolic strokes of undetermined source in the Athens stroke registry: A descriptive analysis Stroke 2015 46 176 181 10.1161/STROKEAHA.114.007240 25378429 3. Hart R.G. Sharma M. Mundl H. Shoamanesh A. Kasner S.E. Berkowitz S.D. Pare G. Kirsch B. Pogue J. Pater C. Rivaroxaban for secondary stroke prevention in patients with embolic strokes of undetermined source: Design of the NAVIGATE ESUS randomized trial Eur. Stroke J. 2016 1 146 154 10.1177/2396987316663049 31008276 PMC6301240 4. Hart R.G. Sharma M. Mundl H. Kasner S.E. Bangdiwala S.I. Berkowitz S.D. Swaminathan B. Lavados P. Wang Y. Wang Y. Rivaroxaban for Stroke Prevention after Embolic Stroke of Undetermined Source N. Engl. J. Med. 2018 378 2191 2201 10.1056/NEJMoa1802686 29766772 5. Diener H.C. Sacco R.L. Easton J.D. Granger C.B. Bernstein R.A. Uchiyama S. Kreuzer J. Cronin L. Cotton D. Grauer C. Dabigatran for Prevention of Stroke after Embolic Stroke of Undetermined Source N. Engl. J. Med. 2019 380 1906 1917 10.1056/NEJMoa1813959 31091372 6. Snyman S. Seder E. David-Muller M. Klein V. Doche E. Suissa L. Deharo J.C. Robinet-Borgomano E. Maille B. Atrial Fibrillation Detected by Implantable Monitor in Embolic Stroke of Undetermined Source: A New Clinical Entity J. Clin. Med. 2022 11 5740 10.3390/jcm11195740 36233608 PMC9571950 7. Edwards J.D. Healey J.S. Fang J. Yip K. Gladstone D.J. Atrial Cardiopathy in the Absence of Atrial Fibrillation Increases Risk of Ischemic Stroke, Incident Atrial Fibrillation, and Mortality and Improves Stroke Risk Prediction J. Am. Heart Assoc. 2020 9 e013227 10.1161/JAHA.119.013227 32431188 PMC7428995 8. Kamel H. Longstreth W.T. Jr. Tirschwell D.L. Kronmal R.A. Marshall R.S. Broderick J.P. Aragón García R. Plummer P. Sabagha N. Pauls Q. Apixaban to Prevent Recurrence After Cryptogenic Stroke in Patients with Atrial Cardiopathy: The ARCADIA Randomized Clinical Trial JAMA 2024 331 573 581 10.1001/jama.2023.27188 38324415 PMC10851142 9. Jones E.F. Kalman J.M. Calafiore P. Tonkin A.M. Donnan G.A. Proximal aortic atheroma. An independent risk factor for cerebral ischemia Stroke 1995 26 218 224 7831691 10. Adams H.P. Jr. Bendixen B.H. Kappelle L.J. Biller J. Love B.B. Gordon D.L. Marsh E.E. 3rd Classification of subtype of acute ischemic stroke. Definitions for use in a multicenter clinical trial. TOAST. Trial of Org 10172 in Acute Stroke Treatment Stroke 1993 24 35 41 10.1161/01.STR.24.1.35 7678184 11. Hart R.G. Diener H.C. Coutts S.B. Easton J.D. Granger C.B. O’Donnell M.J. Sacco R.L. Connolly S.J. Embolic strokes of undetermined source: The case for a new clinical construct Lancet Neurol. 2014 13 429 438 10.1016/S1474-4422(13)70310-7 24646875 12. Kamtchum-Tatuene J. Nomani A.Z. Falcione S. Munsterman D. Sykes G. Joy T. Spronk E. Vargas M.I. Jickling G.C. Non-stenotic Carotid Plaques in Embolic Stroke of Unknown Source Front. Neurol. 2021 12 719329 10.3389/fneur.2021.719329 34630291 PMC8492999 13. Ospel J.M. Kappelhof M. Ganesh A. Kallmes D.F. Brinjikji W. Goyal M. Symptomatic non-stenotic carotid disease: Current challenges and opportunities for diagnosis and treatment J. Neurointerv Surg. 2024 16 418 424 10.1136/jnis-2022-020005 37068939 14. Barnett H.J.M. Taylor D.W. Haynes R.B. Sackett D.L. Peerless S.J. Ferguson G.G. Fox A.J. Rankin R.N. Hachinski V.C. Wiebers D.O. Beneficial effect of carotid endarterectomy in symptomatic patients with high-grade carotid stenosis N. Engl. J. Med. 1991 325 445 453 1852179 10.1056/NEJM199108153250701 15. Ebrahim S. Papacosta O. Whincup P. Wannamethee G. Walker M. Nicolaides A.N. Dhanjil S. Griffin M. Belcaro G. Rumley A. Carotid plaque, intima media thickness, cardiovascular risk factors, and prevalent cardiovascular disease in men and women: The British Regional Heart Study Stroke 1999 30 841 850 10.1161/01.STR.30.4.841 10187889 16. Gupta A. Baradaran H. Kamel H. Pandya A. Mangla A. Dunning A. Marshall R.S. Sanelli P.C. Evaluation of computed tomography angiography plaque thickness measurements in high-grade carotid artery stenosis Stroke 2014 45 740 745 10.1161/STROKEAHA.113.003882 24496392 17. Komatsu T. Iguchi Y. Arai A. Sakuta K. Sakai K. Terasawa Y. Mitsumura H. Matsushima M. Large but Nonstenotic Carotid Artery Plaque in Patients with a History of Embolic Stroke of Undetermined Source Stroke 2018 49 3054 3056 10.1161/STROKEAHA.118.022986 30571401 18. Coutinho J.M. Derkatch S. Potvin A.R. Tomlinson G. Kiehl T.R. Silver F.L. Mandell D.M. Nonstenotic carotid plaque on CT angiography in patients with cryptogenic stroke Neurology 2016 87 665 672 10.1212/WNL.0000000000002978 27412144 PMC4999163 19. Trelles M. Eberhardt K.M. Buchholz M. Schindler A. Bayer-Karpinska A. Dichgans M. Reiser M.F. Nikolaou K. Saam T. CTA for screening of complicated atherosclerotic carotid plaque—American Heart Association type VI lesions as defined by MRI AJNR Am. J. Neuroradiol. 2013 34 2331 2337 10.3174/ajnr.A3607 23868157 PMC7965199 20. Gupta A. Mtui E.E. Baradaran H. Salama G. Pandya A. Kamel H. Giambrone A. Sanelli P.C. CT angiographic features of symptom-producing plaque in moderate-grade carotid artery stenosis AJNR Am. J. Neuroradiol. 2015 36 349 354 10.3174/ajnr.A4098 25213881 PMC7965661 21. Tonetti D.A. Desai S.M. Nayar G. Jankowitz B.T. Jovin T.G. Jadhav A.P. Symptomatic nonstenotic carotid disease: Evaluation of a proposed classification scheme in a prospective cohort J. Clin. Neurosci. 2021 90 21 25 10.1016/j.jocn.2021.04.039 34275551 22. Jochmann S.L. Sievering E.M.W. Ernst J. Ringlstetter R. Grosshennig A. Weissenborn K. Grosse G.M. Sex-Specific Risk Factors of Nonstenotic Carotid Plaque in Embolic Stroke of Unknown Source: A Case-Control Study Stroke 2024 55 296 300 10.1161/STROKEAHA.123.044833 38152961 Figure 1 Measuring plaque size using computed tomography angiography. ( a b c d Figure 2 Flow chart illustrating the inclusion and exclusion criteria of the patients. neurolint-17-00148-t001_Table 1 Table 1 Prevalence of plaques > 3 mm in the embolic stroke of undetermined source and contralateral sides of the carotid arteries.  Embolic Stroke of Undetermined Source Side Contralateral Side OR (95%CI) p Plaque ≥ 3 mm 11 (31%) 3 (8%) 4.96 (1.24–19.77) 0.01 neurolint-17-00148-t002_Table 2 Table 2 Background of the patients with plaques > 3 mm.  Plaque (+) n Plaque (−) n p Male, n 8 (72) 11 (45) 0.13 Age (mean ± SD) years 72.9 ± 17 65.0 ± 14.7 0.20 NIHSS (mean ± SD) 4.1 ± 2.8 5.3 ± 7.8 0.51 Hypertension, n 10 (92) 19 (79) 0.41 Dyslipidemia, n 5 (45) 12 (50) 0.90 Diabetes, n 4 (36) 6 (25) 0.77 CKD, n 2 (18) 2 (8) 0.57 Smoker, n 3 (27) 12 (50) 0.28 Alcoholic, n 3 (27) 4 (16) 0.65 NIHSS, National Institutes of Health Stroke Scale; AF, atrial fibrillation; CKD, chronic kidney disease. ",
  "metadata": {
    "Title of this paper": "Sex-Specific Risk Factors of Nonstenotic Carotid Plaque in Embolic Stroke of Unknown Source: A Case-Control Study",
    "Journal it was published in:": "Neurology International",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12472282/"
  }
}