{
  "title": "Paper_1116",
  "abstract": "Diving Hyperb Med Diving Hyperb Med 3469 dhmj Diving Hyperb Med Diving and Hyperbaric Medicine 1833-3516 2209-1491 South Pacific Underwater Medicine Society and the European Underwater and Baromedical Society PMC11659066 PMC11659066.1 11659066 11659066 39288930 10.28920/dhm54.3.233-236 1 Case Report Lateral ST-elevation myocardial infarction from systemic air embolism after CT guided lung biopsy Htay Aung Myo 1 Wilson Emma 1  1 Dr Aung Myo Htay, Department of Diving and Hyperbaric Medicine, Royal Hobart Hospital, 48 Liverpool Street, Hobart, Tasmania 7000, Australia, htay.aung@ths.tas.gov.au Conflicts of interest: 30 9 2024 9 2024 54 3 471973 233 236 27 6 2023 7 6 2024 30 09 2025 30 09 2025 21 12 2024 30 09 2025 Copyright: © 2024 Diving and Hyperbaric Medicine Journal. This article is the copyright of the authors who grant Diving and Hyperbaric Medicine a non-exclusive licence to publish the article in electronic and other forms. 2024 Systemic air embolism is a rare but potentially life-threatening complication of computed tomography (CT)-guided lung biopsy. The largest lung biopsy audits report an incidence rate of approximately 0.061% for systemic air embolism, with a mortality rate of 0.07–0.15%. A prompt diagnosis with high index of suspicion is essential, and hyperbaric oxygen treatment (HBOT) is the definitive management. We report the case of a 44-year-old lady who developed a lateral ST elevation myocardial infarction from coronary artery air embolism following CT-guided lung biopsy for evaluation of a left lung lesion. The biopsy was performed in the right lateral decubitus position, and the patient reported chest pain after coughing during the procedure. The clinician decided to proceed, taking four biopsy samples as no pneumothorax was identified in the intraprocedural CT image. The patient was noted to have hypotension with ongoing chest pain post-procedure. Resuscitative measures were taken to stabilise her haemodynamics, and she was successfully treated with HBOT with total resolution of air embolism. She developed a left sided pneumothorax post-treatment and needed intercostal chest drain insertion. The left lung fully re-expanded, and the patient was discharged home after day two of admission. Keywords Arterial gas embolism Cardiac Coronary Iatrogenic Complications and management Funding pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access no pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement no pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes ",
  "metadata": {
    "Title of this paper": "Lateral ST-elevation myocardial infarction from systemic air embolism after CT guided lung biopsy",
    "Journal it was published in:": "Diving and Hyperbaric Medicine",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC11659066/"
  }
}