{
  "title": "Paper_432",
  "abstract": "pmc Sci Rep Sci Rep 1579 scirep Scientific Reports 2045-2322 Nature Publishing Group PMC12480515 PMC12480515.1 12480515 12480515 41023226 10.1038/s41598-025-18735-y 18735 1 Article Synthesis, antiproliferative activity targeting lung cancer and in silico studies of hydroxypiperidine substituted thiosemicarbazones Aftab Hina 1 Islam Muhammad 2 3 Şenol Halil 4 Batool Zahra 1 Ateşoğlu Şeyma 5 6 Çakır Furkan 4 Akbaş Fahri 6 Taslimi Parham parham_taslimi_un@yahoo.com 7 Alanazi Abdullah K. 8 Noreen Faiqa 1 Shafiq Zahid zahidshafiq@bzu.edu.pk 1 1 https://ror.org/05x817c41 grid.411501.0 0000 0001 0228 333X Institute of Chemical Sciences, Bahauddin Zakariya University, 2 https://ror.org/023e9bm81 grid.459796.0 0000 0004 4910 4505 Department of Basic Sciences and Humanities (Chemistry), Muhammad Nawaz Sharif University of Engineering and Technology (MNSUET), 3 https://ror.org/012tb2g32 grid.33763.32 0000 0004 1761 2484 School of Pharmaceutical Science and Technology, Tianjin University, 4 https://ror.org/04z60tq39 grid.411675.0 0000 0004 0490 4867 Department of Pharmaceutical Chemistry, Bezmialem Vakif University, Faculty of Pharmacy, 5 https://ror.org/04z60tq39 grid.411675.0 0000 0004 0490 4867 Institute of Health Sciences, Department of Biotechnology, Bezmialem Vakif University, 6 https://ror.org/04z60tq39 grid.411675.0 0000 0004 0490 4867 Department of Medical Biology, Bezmialem Vakif University, Faculty of Medicine, 7 https://ror.org/03te4vd35 grid.449350.f 0000 0004 0369 647X Department of Biotechnology, Faculty of Science, Bartin University, 8 https://ror.org/014g1a453 grid.412895.3 0000 0004 0419 5255 Department of Chemistry, College of Science, Taif University, 29 9 2025 2025 15 478255 33402 28 6 2025 3 9 2025 29 09 2025 01 10 2025 01 10 2025 © The Author(s) 2025 2025 https://creativecommons.org/licenses/by-nc-nd/4.0/ Open Access http://creativecommons.org/licenses/by-nc-nd/4.0/ This study focuses on the synthesis, characterization, and evaluation of 13 novel hydroxypiperidine-substituted thiosemicarbazone derivatives (5a-m) 5f R 50 5f 50 K i 5f 5f 5f 5f Supplementary Information The online version contains supplementary material available at 10.1038/s41598-025-18735-y. Keywords Thiosemicarbazone Lung cancer Carbonic anhydrase Molecular docking Molecular dynamics Subject terms Biochemistry Cancer Chemical biology Chemistry Computational biology and bioinformatics Drug discovery pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement yes pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes issue-copyright-statement © Springer Nature Limited 2025 Introduction Cancer is a complex and multifactorial disease characterized by the uncontrolled growth and proliferation of abnormal cells, often driven by disruptions in cellular metabolism and enzyme activity 1 3 4 7 Metabolic enzymes such as carbonic anhydrases (CAs) play a pivotal role in tumor progression by regulating pH homeostasis, facilitating cell survival in hypoxic environments, and promoting metastasis 8 13 14 15 16 18 19 20 21 23 Thiosemicarbazone derivatives are an important class of biologically active compounds and they are known for their remarkable anticancer 24 28 29 30 31 32 33 34 36 37 39 1 40 41 42 43 44 46  Fig. 1 Some known biologically active thiosemicarbazones and piperidine under clinical trials for cancer. The design of hydroxypiperidine-substituted thiosemicarbazone derivatives is based on the dual functionality of these pharmacophores. Hydroxypiperidine enhances aqueous solubility and provides hydrogen bonding and hydrophobic interactions within enzyme active sites, while thiosemicarbazones are known for their strong metal-chelating ability and capacity to interact with catalytic Zn 2+ 47 49 50 52 53 54 Molecular docking and molecular dynamics simulations are very important and indispensable in drug discovery, offering valuable information about ligand-receptor interactions and complex stability. Docking predicts binding modes and affinities, while dynamics simulates molecular motions over time, capturing conformational changes and induced-fit effects. As a result, these techniques enhance the design of selective and potent drug candidates, reducing experimental costs and accelerating development. The aim of this study is to synthesize and characterize 13 novel hydroxypiperidine-substituted thiosemicarbazone derivatives (5a-m) Results and discussions Chemistry Thiosemicarbazone and hydroxypiperidine moieties exhibit a broad spectrum of biological and pharmacological activities. Consequently, combining these two components into a single molecular structure is a promising approach to develop more potent biologically active compounds. The desired compounds 5a-m 2 (1) (2) 2 3 (3) (3) 5a-m 4a-m 5a–m 3 4 4a-m The formation of 4-(4-hydroxypiperidin-1-yl) benzaldehyde-based thiosemicarbazones 5a–m 1 13 1 5a-m  Fig. 2 Synthetic route for the synthesis of thiosemicarbazones. Biological activity studies In this study, the cytotoxic effects of the synthesized compounds were determined using the A549 (lung cancer) and BEAS2B (non-cancerous lung epithelial) cell lines to evaluate their potential anticancer activity and toxicity. Additionally, enzyme inhibition studies were performed against human carbonic anhydrase isoforms I (hCA I) and II (hCA II) to assess their inhibitory effects on these important metabolic enzymes. Cytotoxicity studies Cytotoxicity studies were carried out using the MTT assay to determine the viability of A549 and BEAS2B cells after treatment with the synthesized compounds. The results are presented in Table 1 50  Table 1 Cytotoxicity of synthesized target compounds against A549 and BEAS2B cell lines. Compounds R IC 50 Selectivity index BEAS2B A549 BEAS2B/A549  5a Phenyl 18.88 ± 0.91 3.77 ± 0.25 5.0  5b 4-Fluorophenyl 29.08 ± 1.40 2.81 ± 0.19 10.3  5c 4-Chlorophenyl 13.71 ± 0.66 2.92 ± 0.20 4.7  5d 4-Bromophenyl 19.80 ± 0.95 1.85 ± 0.12 10.7  5e 4-Methoxyphenyl 17.54 ± 0.84 5.20 ± 0.35 3.4  5f 2,3-Dichlorophenyl 16.88 ± 0.81 0.58 ± 0.04 28.9  5 g 2,6-Dimethylphenyl 12.68 ± 0.61 1.56 ± 0.10 8.1  5 h Benzyl 12.64 ± 0.61 4.25 ± 0.28 3.0  5i 4-Chlorobenzyl 13.43 ± 0.64 1.46 ± 0.10 9.2  5j 4-Methylbenzyl 15.91 ± 0.76 3.28 ± 0.22 4.8  5k Phenethyl 15.01 ± 0.72 1.33 ± 0.09 11.3  5 L Cyclohexyl 14.45 ± 0.69 3.83 ± 0.26 3.8  5 m Isobutyl 10.76 ± 0.52 1.50 ± 0.10 7.2  Sorafenib Reference drug 15.78 ± 0.15 2.92 ± 0.03 5.4 The cytotoxicity data presented in Table 1 50 5f R 5b R 50 5d R 5i R 50 50 5e R 5 h 5 L 50 5f 5b 5d 3  Fig. 3 Structure–activity relationship (SAR) of the synthesized thiosemicarbazones. SAR analysis indicates that halogen-substituted phenyl groups enhance both cytotoxicity and enzyme inhibition, whereas electron-donating or bulky substituents generally reduce activity. The experimental and computational results highlights the importance of the hydroxypiperidine-thiosemicarbazone scaffold combined with halogenated aromatic substituents in maximizing anticancer efficacy. Figure 3 Enzyme Inhibition and kinetic studies Enzyme inhibition studies were performed to determine the inhibitory effects of the synthesized compounds on human carbonic anhydrase isoforms I (hCA I) and II (hCA II). The IC 50 K i 50 K i 2 4 The IC 50 5f 5b 5 m The K i 5f K i 5f 5b 5d K i  Table 2 IC 50 K i Compounds IC 50 K i hCA I hCA II hCA I hCA II  5a 550.44 506.59 590.80 ± 18.32 506.90 ± 13.27  5b 394.78 254.70 438.93 ± 14.49 283.18 ± 18.35  5c 421.60 377.76 463.50 ± 12.86 401.11 ± 9.52  5d 477.96 331.59 501.28 ± 14.72 333.54 ± 14.47  5e 632.71 578.84 668.45 ± 13.63 602.85 ± 15.23  5f 309.16 267.27 311.66 ± 10.14 271.32 ± 11.91  5 g 482.06 424.40 488.31 ± 15.95 435.91 ± 10.25  5 h 545.18 504.28 553.62 ± 18.04 560.61 ± 19.44  5i 408.42 373.51 409.76 ± 15.07 378.20 ± 12.33  5j 721.42 698.44 759.30 ± 16.32 778.22 ± 15.18  5k 705.82 641.33 784.42 ± 18.24 656.35 ± 18.41  5 L 528.51 465.13 551.88 ± 12.80 481.56 ± 11.71  5 m 769.13 695.14 794.20 ± 19.19 716.37 ± 18.90  AZA 701.34 615.07 750.01 ± 23.19 644.01 ± 15.67 In comparison to the reference drug AZA (Acetazolamide), which has IC 50 5f 5b 5d. 5f  Fig. 4 The Lineweaver-Burk plots of the best inhibitor on of isoenzyme ( 5f Molecular Docking studies Molecular docking studies were conducted to investigate the binding interactions of the synthesized compounds with key targets involved in lung cancer progression. In addition to hCA I and hCA II, multiple other molecular targets were selected to further explore the potential of these compounds. These included hCA IX, hCA XII, VEGFR1, VEGFR2, and BRAF. By evaluating the binding energies, interaction patterns, and affinity of the compounds with these proteins, the studies aimed to identify the most promising candidates with diverse molecular mechanisms of action. Molecular docking studies were performed on the three most active compounds (5b 5d 5f) 3  Table 3 Docking scores and MM-GBSA ΔG binding free energies of synthesized compounds. Proteins PDB ID IFD XP glide scores (kcal/mol) MM-GBSA ΔG bind. (kcal/mol) 5b 5d 5f 5b 5d 5f hCA I  1AZM − 5.795 − 6.055 − 7.411 − 17.96 − 15.85 − 55.82 hCA II  1A42 − 5.783 − 6.045 − 6.926 − 15.40 − 20.62 − 44.02 hCA IX  6G9U − 5.903 − 6.004 − 6.594 − 24.10 − 32.90 − 28.38 hCA XII  4HT2 − 6.863 − 6.584 − 6.950 − 18.17 − 25.31 − 19.50 VEGFR-1  3HNG − 10.519 − 11.695 − 11.075 − 76.57 − 78.21 − 80.92 VEGFR-2  4ASE − 10.603 − 10.980 − 11.297 − 61.73 − 69.19 − 81.61 BRAF  6XFP − 10.684 − 10.444 − 11.111 − 68.71 − 82.60 − 77.19 Molecular docking studies showed that compound 5f 5f 5d 5b 5f 5f 5b 5d 5f For hCA IX, 5f 5b 5f 5f 5b 5d 5f 5d 5b 5f 5b 5d 5f 5f The MM-GBSA binding free energy calculations support the docking results, highlighting 5f 5f 5f 5f 5f 5b 5d Overall, 5f 5f Molecular Docking ligand–protein interaction analysis Molecular docking 2D and 3D ligand protein interaction (LPI) analysis of compound 5f with hCAI, hCAII and VEGFR2 are given in Fig. 5 5 5f hCAI 5f 5f Figure 5 5f hCAI 5f  Fig. 5 Molecular docking LPI of 5f a 5f-hCAI b 5f-hCAI c 5f-hCAII d 5f-hCAII e 5f-VEGFR2 f 5f-VEGFR2 Figure 5 5f hCAII 5f 5f 5f 5 5f hCAII 5f Figure 5 5f VEGFR2 5f 22 5f 5 5f VEGFR2 5f As conclusion, molecular docking studies revealed that compound 5f 5f 5f Molecular dynamics (MD) simulation Molecular dynamics (MD) simulations are essential in drug discovery, providing valuable information about the stability of protein-ligand complexes. The Root Mean Square Deviation (RMSD) measures the deviation in atomic positions over time, helping assess the stability and conformational changes of the complex. In this study, 100 ns MD simulations were performed on the 5f-hCAI 5f-hCAII 5f-VEGFR2 5 6 5f-hCAI 5f 6 5f-hCAI The ligand atoms exhibited a higher average RMSD of 3.5 Å (red), suggesting some degree of flexibility or conformational adjustment during the simulation. However, the ligand’s average deviation from its initial binding position was only 0.9 Å (pink), demonstrating that it remained stably bound within the binding site despite minor conformational changes. These results highlight the dynamic, but stable nature of the ligand-protein complex, reflecting favorable binding interactions over the simulation period.  Fig. 6 The 100 ns MD simulation analysis of 5f a 5f-hCAI b 5f-hCAI c 5f-hCAII d 5f-hCAII e 5f-VEGFR2 f 5f-VEGFR2. Figure 6 5f-hCAII 5f 6 5f-hCAII Figure 6 5f-VEGFR2 6 5f-VEGFR2 5f-VEGFR2 As conclusion, the MD simulations revealed key interactions that stabilize the 5f-protein 5f-hCAI 5f-hCAII 5f-VEGFR2 5f ADME-T prediction ADMET (Absorption, Distribution, Metabolism, Excretion, and Toxicity) prediction is vital in drug design to assess pharmacokinetics and safety. Key factors include hydrogen bonding, solubility, LogP, and Lipinski’s Rule of Five for oral bioavailability. Permeability studies like Caco-2 and MDCK assess absorption and BBB penetration, while metabolic stability ensures efficacy. Toxicity predictions identify risks such as hepatotoxicity, nephrotoxicity, and cardiotoxicity, helping select safe, effective drug candidates 55 57 4  Table 4 ADME-T prediction of the most active compounds. Parameters* 5b 5d 5f mol MW 372.46 433.36 423.36 Donor HB 3 3 3 Accept HB 6 6 6 QPlogPo/w 3.869 4.172 4.532 QPlogS − 6.191 − 6.635 − 6.974 QPPCaco 1377 1344 1590 QPlogBB − 0.463 − 0.417 − 0.229 QPPMDCK 2903 4105 8127 %HOA 100 100 100 Rule of Five 0 0 0 Rule of Three 1 1 1 Hepatotoxicity Inactive (57%) Inactive (59%) Inactive (59%) Neurotoxicity Active (70%) Active (70%) Active (72%) Nephrotoxicity Inactive (53%) Inactive (53%) Inactive (52%) Cardiotoxicity Inactive (76%) Inactive (76%) Inactive (76%) Carcinogenicity Active (50%) Active (50%) Inactive (53%) Mutagenicity Inactive (58%) Inactive (58%) Inactive (58%) Predicted LD 50 950 mg/kg 950 mg/kg 8 mg/kg Predicted toxicity class 4 4 2 Toxicity prediction accuracy 67.38% 67.38% 67.38% *MW: Molecular weight (130.0–725.0); Donor HB: Donated H-bonds (0.0–6.0); Accept HB: Accepted H-bonds (2.0–20.0); QPlogPo/w: Octanol/water partition coefficient (–2.0–6.5); QPlogS: Aqueous solubility (log S, − 6.5–0.5); QPPCaco: Caco-2 permeability (< 25 poor, > 500 great); QPlogBB: Brain/blood partition (–3.0–1.2); QPPMDCK: MDCK permeability (< 25 poor, > 500 great); %HOA: Human oral absorption (0–100%, > 80% high, < 25% poor); Ro5: Lipinski’s rule violations (max 4); Ro3: Jorgensen’s rule violations (max 3); Organ Toxicity: Active/inactive with probability; Predicted Toxicity Class: From 1 (toxic) to 6 (safe). Table 4 5b 5d 5f 5f 5f The compounds also show 100% human oral absorption, indicating potential for oral bioavailability. Toxicity predictions indicate neurotoxicity for all compounds (70%-72%), but hepatotoxicity, nephrotoxicity, and cardiotoxicity are predicted as inactive. Carcinogenicity is predicted as active for 5b 5d 5f 50 5b 5d 5f Conclusions In conclusion, the synthesis and characterization of the novel hydroxypiperidine-substituted thiosemicarbazone derivatives (5a-m) 5f 5f 50 5f 5b 5d 50 The enzyme inhibition studies further demonstrated the potential of these compounds as carbonic anhydrase inhibitors. Compound 5f 50 K i 5f 5f 5f 5f Overall, the results from cytotoxicity, enzyme inhibition, molecular docking, and ADMET predictions highlight 5f 5f 5f Experimental section General The chemical reagents and solvents employed in this investigation were obtained from various vendors and suppliers, including Fluka, Sigma Aldrich, and Oakwood. All reagents and solvents were of analytical quality. The melting points were determined utilizing the open capillary technique with a Fisher-Johns electrical melting point. Thin-layer chromatography (TLC) was performed on precoated plates to monitor the reaction process and evaluate the purity of the chemicals, with spots analyzed under UV light. The 1 13 d 6 Synthesis of hydroxypiperidine substituted thiosemicarbazones Synthesis of 4-(4-hydroxypiperidin-1-yl) benzaldehyde (3) Compound (3) 58 (1mmol) (1) 2 3 (1mmol) (2) General method for the synthesis of thiosemicarbazones (5a–m) The desired thiosemicarbazones (5a-m) 59 (3) (0.1 g 5mmol) (4a-m) (5mmol) (5a-m). Characterization data for each compound is given below: (E)- -N- Pale Yellow solid. m.p. 1 H NMR (400 MHz DMSO- d 6 ) δ J J J J J 13 C NMR (100 MHz DMSO- d 6 ) δ Elemental Anal. 19 22 4 ESI-HRMS: m/z 19 22 4 + + HPLC (E)-N- Pale Yellow. m.p. 1 H NMR (400 MHz DMSO- d 6 ) δ J J J 13 C NMR (100 MHz DMSO- d 6 ) δ Elemental Anal. 19 21 4 ESI-HRMS: m/z 19 21 4 + + HPLC (E)-N- Yellow solid. m.p. 1 H NMR (400 MHz DMSO- d 6 ) δ J J J J J 13 C NMR (100 MHz DMSO- d 6 ) δ Elemental Anal. 19 21 4 ESI-HRMS: m/z 19 21 4 + + (E)-N- White solid. m.p. 1 H NMR (400 MHz DMSO- d 6 ) δ J J 13 C NMR (100 MHz DMSO- d 6 ) δ Elemental Anal. 19 21 4 ESI-HRMS: m/z 19 21 89 4 + + HPLC (E)-2- -N- Light Yellow solid. m.p. 1 H NMR (400 MHz DMSO- d 6 ) δ J J J 13 C NMR (100 MHz DMSO- d 6 ) δ Elemental Anal. 20 24 4 2 ESI-HRMS: m/z 20 24 4 2 + + HPLC (E)-N- Off white solid. m.p. 1 H NMR (400 MHz DMSO- d 6 ) δ J J J J 13 C NMR (100 MHz DMSO- d 6 ) δ Elemental Anal. 19 20 2 4 ESI-HRMS: m/z 19 20 2 4 + + HPLC (E)-N- Yellow solid. m.p. 1 H NMR (400 MHz DMSO- d 6 ) δ J J 13 C NMR (100 MHz DMSO- d 6 ) δ Elemental Anal. 21 26 4 ESI-HRMS: m/z 21 26 4 + + HPLC (E)-N- Lemon color. m.p. 1 H NMR (400 MHz DMSO- d 6 ) δ J J J 13 C NMR (100 MHz DMSO- d 6 ) δ Elemental Anal. 20 24 4 ESI-HRMS: m/z 20 24 4 + + HPLC (E)-N- Yellow solid. m.p. 1 H NMR (400 MHz DMSO- d 6 ) δ J J J 13 C NMR (100 MHz DMSO- d 6 ) δ Elemental Anal. 20 23 4 ESI-HRMS: m/z 20 23 4 + + HPLC (E)- -N- Off white solid. m.p. 1 H NMR (400 MHz DMSO- d 6 ) δ J J J J J J 13 C NMR (100 MHz DMSO- d 6 ) δ Elemental Anal. 21 26 4 ESI-HRMS: m/z 21 26 4 + + HPLC (E)- -N- Yellow solid. m.p. 1 H NMR (400 MHz DMSO- d 6 ) δ J J J J 13 C NMR (100 MHz DMSO- d 6 ) δ Elemental Anal. 21 26 4 ESI-HRMS: m/z 21 26 4 + + HPLC (E)-N- Mustard solid. m.p. 1 H NMR (400 MHz DMSO- d 6 ) δ J J J 13 C NMR (100 MHz DMSO- d 6 ) δ Elemental Anal. 19 28 4 ESI-HRMS: m/z 19 28 4 + + HPLC (E)- -N- Off white solid. m.p. 1 H NMR (400 MHz DMSO- d 6 ) δ J J J J HPLC Elemental Anal. 17 26 4 ESI-HRMS: m/z 17 26 4 + + HPLC Biological activity studies Cell culture Human adenocarcinomic alveolar basal epithelial cells (A549, ATCC ® ® 2 MTT cell viability assay The effects of compounds on cell viability against A549 and BEAS2B cells were evaluated using 3-(4,5-dimethylthiazol-2-yl)-2,5-diphenyltetrazolium bromide (MTT)) proliferation assay. A549 and BEAS2B cells were seeded in 96-well plates (1 × 10 4 50 50 60 Carbonic anhydrase Inhibition activity Cytosolic CA isoenzyme (CA I and II) purification was previously published using a straightforward one-step procedure using Sepharose-4B-L tyrosine-sulfanilamide affinity chromatography. Using spectrophotometry, the amount of protein in the column effluents was measured at 280 nm. Following the purification of both CA isoenzymes, sodium dodecyl sulfate-polyacrylamide gel electrophoresis (SDS-PAGE) was performed using a Bio-Rad Mini Gel system (Mini-PROTEAN Tetra System, Guangdong, China). SDS (0.1%) was present in the stacking gel (3%) and running gel (10%), which were both conducted in acrylamide. Verpoorte et al. used the esterase method to determine the activities of CA I and II isoenzymes. The UV–VIS Spectrophotometer, Shimadzu, UVmini-1240, Kyoto, Japan, was used to spectrophotometrically record the increase in absorbance of the reaction solution at 348 nm. Additionally, the Bradford method was used to determine the amount of protein at 595 nm. The standard protein utilized was bovine serum albumin. The activity (%) versus compound plots were used to get the IC 50 K i Computational studies Molecular docking and dynamics simulations were conducted using Schrödinger Molecular Modeling Software (2024-1) with the Maestro interface (version 13.9) and Desmond (D. E. Shaw Research). Protein and ligand preparation followed established protocols from our group 61 65 66 Supplementary Information Below is the link to the electronic supplementary material.  Supplementary Material 1 Publisher’s note Springer Nature remains neutral with regard to jurisdictional claims in published maps and institutional affiliations. Acknowledgements The authors extend their appreciation to Taif University, Saudi Arabia, for supporting this work through project number (TU-DSPP-2024-16). Z.S. is thankful to the Alexander von Humboldt Foundation for the award of Return Fellowship for Experienced Researchers. Author contributions H.A., M. I. and Z. B. did synthesis of compounds and characterization; P. T. and A.K.A. did biological aactivities / assays; H. Ş., Ş. A., F. Ç., and F. A. carried out Molecular Docking / MD Simulation / anticancer activity and made graphs; F. N. and Z. S. did NMR analysis and interpretation / graphs / SAR; Z. S. developed the concept and supervision, wrote and revised the manuscript. Funding This research was funded by Taif University, Saudi Arabia, project No (TU-DSPP-2024-16). Data availability All data generated or analyzed during this study are included in this published article [and its supplementary information files. Declarations Competing interests The authors declare no competing interests. References 1. Hausman DM What is cancer? Perspect. Biol. Med. 2019 62 778 784 10.1353/pbm.2019.0046 31761807 Hausman, D. M. What is cancer? Perspect. Biol. Med. 62 31761807 10.1353/pbm.2019.0046 2. Lou Y Simultaneous quantification of mirabegron and vibegron in human plasma by HPLC-MS/MS and its application in the clinical determination in patients with tumors associated with overactive bladder J. Pharm. Biomed. Anal. 2024 240 115937 10.1016/j.jpba.2023.115937 38198885 Lou, Y. et al. Simultaneous quantification of mirabegron and vibegron in human plasma by HPLC-MS/MS and its application in the clinical determination in patients with tumors associated with overactive bladder. J. Pharm. Biomed. Anal. 240 38198885 10.1016/j.jpba.2023.115937 3. Liu R Wang S Tian F Yi L SIR-3DCNN: A framework of multivariate time series classification for lung cancer detection IEEE Trans. Instrum. Meas. 2025 PP 1 1 10.1109/TIM.2025.3563000 Liu, R., Wang, S., Tian, F. & Yi, L. SIR-3DCNN: A framework of multivariate time series classification for lung cancer detection. IEEE Trans. Instrum. Meas. PP 4. Bray F Global cancer statistics 2022: GLOBOCAN estimates of incidence and mortality worldwide for 36 cancers in 185 countries CA Cancer J. Clin. 2024 74 229 263 10.3322/caac.21834 38572751 Bray, F. et al. Global cancer statistics 2022: GLOBOCAN estimates of incidence and mortality worldwide for 36 cancers in 185 countries. CA Cancer J. Clin. 74 38572751 10.3322/caac.21834 5. Kratzer, T. B. et al. Lung cancer statistics, CANCER 10.1002/cncr.35128 38279776 6. Zhang Y Effects of Web-Based acceptance and commitment therapy on Health-Related outcomes among patients with lung cancer: A feasibility randomized controlled trial Psycho-Oncology 2024 33 e70045 10.1002/pon.70045 39681977 Zhang, Y. et al. Effects of Web-Based acceptance and commitment therapy on Health-Related outcomes among patients with lung cancer: A feasibility randomized controlled trial. Psycho-Oncology 33 39681977 10.1002/pon.70045 7. Li Y CircMYBL1 suppressed acquired resistance to osimertinib in non-small-cell lung cancer Cancer Genet. 2024 284–285 34 42 10.1016/j.cancergen.2024.04.001 38626533 Li, Y. et al. CircMYBL1 suppressed acquired resistance to osimertinib in non-small-cell lung cancer. Cancer Genet. 284–285 38626533 10.1016/j.cancergen.2024.04.001 8. Köse A Köse LP Şenol H Ulusoy-Güzeldemirci N New 4-methanesulfonyloxy benzohydrazide derivatives as potential antioxidant and carbonic anhydrase I and II inhibitors: synthesis, characterization, molecular docking, dynamics & ADME studies J. Mol. Struct. 2025 1325 140937 10.1016/j.molstruc.2024.140937 Köse, A., Köse, L. P., Şenol, H. & Ulusoy-Güzeldemirci, N. New 4-methanesulfonyloxy benzohydrazide derivatives as potential antioxidant and carbonic anhydrase I and II inhibitors: synthesis, characterization, molecular docking, dynamics & ADME studies. J. Mol. Struct. 1325 9. Polat Köse, L. & Köse, A. Identification of hCA I, hCA II, AChE and BChE Inhibitory Properties of Some Norcantharimide Derivatives; Molecular Docking, SAR and in silico ADME Studies. ChemistrySelect 10. Dincel ED Synthesis and in vitro carbonic anhydrase and acetylcholinesterase inhibitory activities of novel hydrazide–hydrazone compounds containing 1,2,4-triazole ring Phosphorus Sulfur Silicon Relat. Elem. 2024 199 236 244 10.1080/10426507.2024.2320672 Dincel, E. D. et al. Synthesis and in vitro carbonic anhydrase and acetylcholinesterase inhibitory activities of novel hydrazide–hydrazone compounds containing 1,2,4-triazole ring. Phosphorus Sulfur Silicon Relat. Elem. 199 11. Tokalı, F. S., Taslimi, P., Sadeghi, M. & Şenol, H. Synthesis and Evaluation of Quinazolin-4(3)-one Derivatives as Multitarget Metabolic Enzyme Inhibitors: A Biochemistry-Oriented Drug Design. ChemistrySelect 12. Wang S Fluorofenidone enhances cisplatin efficacy in non-small cell lung cancer: a novel approach to inhibiting cancer progression Transl Lung Cancer Res. 2024 13 3175 3188 10.21037/tlcr-24-811 39670015 PMC11632444 Wang, S. et al. Fluorofenidone enhances cisplatin efficacy in non-small cell lung cancer: a novel approach to inhibiting cancer progression. Transl Lung Cancer Res. 13 39670015 10.21037/tlcr-24-811 PMC11632444 13. Wang J Dong X Liu Y Lin K Chen J Copy number gain of MET gene with low level in a metastatic lung adenocarcinoma patient represents response to salvage treatment with Savolitinib and osimertinib: a case report Front. Oncol. 2025 15 1507677 10.3389/fonc.2025.1507677 40365349 PMC12069039 Wang, J., Dong, X., Liu, Y., Lin, K. & Chen, J. Copy number gain of MET gene with low level in a metastatic lung adenocarcinoma patient represents response to salvage treatment with Savolitinib and osimertinib: a case report. Front. Oncol. 15 40365349 10.3389/fonc.2025.1507677 PMC12069039 14. Ökten S SAR evaluation of disubstituted Tacrine analogues as promising cholinesterase and carbonic anhydrase inhibitors Indian J. Pharm. Educ. Res. 2019 53 268 275 10.5530/ijper.53.2.35 Ökten, S. et al. SAR evaluation of disubstituted Tacrine analogues as promising cholinesterase and carbonic anhydrase inhibitors. Indian J. Pharm. Educ. Res. 53 15. Zengin Kurt B Synthesis of coumarin-sulfonamide derivatives and determination of their cytotoxicity, carbonic anhydrase inhibitory and molecular Docking studies Eur. J. Med. Chem. 2019 183 111702 10.1016/j.ejmech.2019.111702 31542715 Zengin Kurt, B. et al. Synthesis of coumarin-sulfonamide derivatives and determination of their cytotoxicity, carbonic anhydrase inhibitory and molecular Docking studies. Eur. J. Med. Chem. 183 31542715 10.1016/j.ejmech.2019.111702 16. Al-Sanea MM Design Synthesis, Pharmacological evaluation of Quinazolin-4(3H)-Ones bearing Urea functionality as potential VEGFR-2 inhibitors Drug Des. Devel Ther. 2024 18 5109 5127 10.2147/dddt.S490930 39554760 PMC11568772 Al-Sanea, M. M. et al. Synthesis, Pharmacological evaluation of Quinazolin-4(3H)-Ones bearing Urea functionality as potential VEGFR-2 inhibitors. Drug Des. Devel Ther. 18 39554760 10.2147/DDDT.S490930 PMC11568772 17. Liu MT Li H Apatinib has anti-tumor effects and induces autophagy in lung cancer cells with high expression of VEGFR-2 Iran. J. Basic. Med. Sci. 2024 27 1370 1379 10.22038/ijbms.2024.74820.16246 39386238 PMC11459337 Liu, M. T. & Li, H. Apatinib has anti-tumor effects and induces autophagy in lung cancer cells with high expression of VEGFR-2. Iran. J. Basic. Med. Sci. 27 39386238 10.22038/ijbms.2024.74820.16246 PMC11459337 18. Szczepanski, J. et al. Rhodanine-Piperazine hybrids as potential VEGFR, EGFR, and HER2 targeting Anti-Breast cancer agents. Int. J. Mol. Sci. 25 10.3390/ijms252212401 PMC11594716 39596465 19. Swalduz, A. et al. Real-world efficacy of the dabrafenib-trametinib (D-T) combination in BRAF V600E-mutated metastatic non-small cell lung cancer (NSCLC): results from the IFCT-2004 blade cohort. Lung Cancer 199 10.1016/j.lungcan.2024.108038 39616778 20. Di Federico, A. et al. Clinical and preclinical activity of EGFR tyrosine kinase inhibitors in Non-Small-Cell lung cancer harboring < i > braf class 3 mutations. Jco Precision Oncol. 8 10.1200/PO.24.00240 PMC11661570 39637338 21. Tokalı FS Şenol H Ateşoğlu Ş Tokalı P Akbaş F Exploring highly selective polymethoxy Fenamate isosteres as novel anti-prostate cancer agents: synthesis, biological activity, molecular docking, molecular dynamics, and ADME studies J. Mol. Struct. 2025 1319 139519 10.1016/j.molstruc.2024.139519 Tokalı, F. S., Şenol, H., Ateşoğlu, Ş., Tokalı, P. & Akbaş, F. Exploring highly selective polymethoxy Fenamate isosteres as novel anti-prostate cancer agents: synthesis, biological activity, molecular docking, molecular dynamics, and ADME studies. J. Mol. Struct. 1319 22. Zengin Kurt B Synthesis of Sorafenib – Ruthenium complexes, investigation of biological activities and applications in drug delivery systems as an anticancer agent J. Med. Chem. 2024 67 4463 4482 10.1021/acs.jmedchem.3c01115 38471014 PMC10983010 Zengin Kurt, B. et al. Synthesis of Sorafenib – Ruthenium complexes, investigation of biological activities and applications in drug delivery systems as an anticancer agent. J. Med. Chem. 67 38471014 10.1021/acs.jmedchem.3c01115 PMC10983010 23. Lin X Regulation of oncoprotein 18/stathmin signaling by ERK concerns the resistance to taxol in nonsmall cell lung cancer cells Cancer Biother Radiopharm 2016 31 37 43 10.1089/cbr.2015.1921 26881937 Lin, X. et al. Regulation of oncoprotein 18/stathmin signaling by ERK concerns the resistance to taxol in nonsmall cell lung cancer cells. Cancer Biother Radiopharm 31 26881937 10.1089/cbr.2015.1921 24. Aftab H Design, synthesis, in vitro and in Silico studies of novel piperidine derived thiosemicarbazones as inhibitors of dihydrofolate reductase Sci. Rep. 2024 14 22645 10.1038/s41598-024-72858-2 39349528 PMC11442999 Aftab, H. et al. Design, synthesis, in vitro and in Silico studies of novel piperidine derived thiosemicarbazones as inhibitors of dihydrofolate reductase. Sci. Rep. 14 39349528 10.1038/s41598-024-72858-2 PMC11442999 25. Danisman-Kalindemirtas, F. et al. Enhanced anticancer effect of newly synthesised albumin-bound Fe(III)-S-Methyl-thiosemicarbazones on breast cancer cells. J. Taibah Univ. Sci. 18 26. Ibrahim, A. B. M., Mayer, P. & Abbas, S. M. Thiosemicarbazones and derived Tin complexes: synthesis, structural analysis and in vitro evaluation against bacterial and cancer cells. Appl. Organomet. Chem. 38 27. Mohammed, M. O., Alkubaisi, H. M. M., Haj, N. Q. & Synthesis Identification, and anti-cancer evaluation of some heterocyclic Chitosan-Thiosemicarbazones compounds and their nickle (II) complexes. Res. Chem. 12 28. Oliveira DDS Advances in breast cancer drug discovery: A review of therapeutic strategies and studies involving photosensitizers, caged Xanthones and thiosemicarbazones derivatives J. Braz. Chem. Soc. 2023 10.21577/0103-5053.20230128 Oliveira, D. D. S. et al. Advances in breast cancer drug discovery: A review of therapeutic strategies and studies involving photosensitizers, caged Xanthones and thiosemicarbazones derivatives. J. Braz. Chem. Soc. 29. Da Silva JG PerdigÃO CCH Speziali NL Beraldo H Chalcone-derived thiosemicarbazones and their zinc(II) and gallium(III) complexes: spectral studies and antimicrobial activity J. Coord. Chem. 2013 66 385 401 10.1080/00958972.2012.757762 Da Silva, J. G., PerdigÃO, C. C. H., Speziali, N. L. & Beraldo, H. Chalcone-derived thiosemicarbazones and their zinc(II) and gallium(III) complexes: spectral studies and antimicrobial activity. J. Coord. Chem. 66 30. Saeed A Al-Masoudi NA Latif M Synthesis and antiviral activity of new substituted Methyl [2-(arylmethylene-hydrazino)-4-oxo-thiazolidin-5-ylidene]acetates Arch. Pharm. (Weinheim) 2013 346 618 625 10.1002/ardp.201300057 23828482 Saeed, A., Al-Masoudi, N. A. & Latif, M. Synthesis and antiviral activity of new substituted Methyl [2-(arylmethylene-hydrazino)-4-oxo-thiazolidin-5-ylidene]acetates. Arch. Pharm. (Weinheim) 346 23828482 10.1002/ardp.201300057 31. Santacruz MCS Fabiani M Castro EF Cavallaro LV Finkielsztein LM Synthesis, antiviral evaluation and molecular Docking studies of N4 Aryl substituted/unsubstituted thiosemicarbazones derived from 1-indanones as potent anti-bovine viral diarrhea virus agents Bioorg. Med. Chem. Lett. 2017 25 4055 4063 10.1016/j.bmc.2017.05.056 28600079 Santacruz, M. C. S., Fabiani, M., Castro, E. F., Cavallaro, L. V. & Finkielsztein, L. M. Synthesis, antiviral evaluation and molecular Docking studies of N4 Aryl substituted/unsubstituted thiosemicarbazones derived from 1-indanones as potent anti-bovine viral diarrhea virus agents. Bioorg. Med. Chem. Lett. 25 10.1016/j.bmc.2017.05.056 28600079 32. Farzaliyeva A Synthesis and biological studies of acetophenone-based novel chalcone, semicarbazone, thiosemicarbazone and Indolone derivatives: Structure-Activity relationship, molecular docking, molecular dynamics, and kinetic studies J. Mol. Struct. 2025 1321 140197 10.1016/j.molstruc.2024.140197 Farzaliyeva, A. et al. Synthesis and biological studies of acetophenone-based novel chalcone, semicarbazone, thiosemicarbazone and Indolone derivatives: Structure-Activity relationship, molecular docking, molecular dynamics, and kinetic studies. J. Mol. Struct. 1321 33. Uytun, A. N. et al. Synthesis of novel thiosemicarbazone derivatives and investigation of their dual ache and MAO-B inhibitor effects. J. Mol. Recognit. 35 10.1002/jmr.2990 36056718 34. Abdelbaki, H. et al. Synthesis of bioactive 1,4-disubstituted 1,2,3-triazole-linked thiosemicarbazone derivatives using Cu2O microbeads catalysis for enhanced antibacterial and antioxidant activities. J. Mol. Struct. 1324 35. Azimi, F. et al. Kinetic studies, molecular docking, and antioxidant activity of novel 1,3-diphenyl pyrazole-thiosemicarbazone with anti-tyrosinase and anti-melanogenesis properties. Bioorg. Chem. 152 10.1016/j.bioorg.2024.107722 39213796 36. Sousa, G. L. S. et al. Discovery of novel thiosemicarbazone-acridine targeting butyrylcholinesterase with antioxidant, metal complexing and neuroprotector abilities as potential treatment of Alzheimer’s disease: In vitro, in vivo, and in silico studies. Eur. J. Med. Chem. 281 10.1016/j.ejmech.2024.117030 39531933 37. Çelik, E. et al. DNA and hemoglobin binding activities: investigation of coumarin-thiosemicarbazone hybrids. Bioorg. Chem. 153 10.1016/j.bioorg.2024.107857 39383810 38. Jacob, J. M. et al. Multi-faceted investigation of copper(II) chelates based on ONS donor thiosemicarbazone: crystal structures, spectral aspects, DNA binding, cytotoxicity and computational studies. J. Mol. Struct. 1319 39. Nicolás, A., Quero, J. G., Barroso, M., Gandara, Z. & Gude, L. D. N. A. Interactions and Biological Activity of 2,9-Disubstituted 1,10-Phenanthroline Thiosemicarbazone-Based Ligands and a 4-Phenylthiazole Derivative. Biology-Basel 10.3390/biology13010060 PMC10813753 38275736 40. Finch, R. A., Liu, M. C., Cory, A. H., Cory, J. G. & Sartorelli, A. C. in Advances in Enzyme Regulation 41. Lee KC Noveroske JW Almassian B Short-term toxicological evaluation of triapine (3-amino-pyridine-2-carboxaldehyde thiosemicarbazone or 3-AP), a ribonucleotide reductase inhibitor with potential antitumor activity, in dogs and rats Int. J. Toxicol. 2000 19 85 93 10.1080/109158100224890 Lee, K. C., Noveroske, J. W. & Almassian, B. Short-term toxicological evaluation of triapine (3-amino-pyridine-2-carboxaldehyde thiosemicarbazone or 3-AP), a ribonucleotide reductase inhibitor with potential antitumor activity, in dogs and rats. Int. J. Toxicol. 19 42. Dharmasivam, M. et al. The thiosemicarbazone, dpc, broadly synergizes with multiple anti-cancer therapeutics and demonstrates temperature- and energy-dependent uptake by tumor cells. Biochim. Et Biophys. Acta-General Subj. 1866 10.1016/j.bbagen.2022.130152 35436509 43. Stariat J Identification of in vitro metabolites of the novel anti-tumor thiosemicarbazone, dpc, using ultra-high performance liquid chromatography-quadrupole-time-of-flight mass spectrometry Anal. Bioanal. Chem. 2013 405 1651 1661 10.1007/s00216-012-6562-x 23180090 Stariat, J. et al. Identification of in vitro metabolites of the novel anti-tumor thiosemicarbazone, dpc, using ultra-high performance liquid chromatography-quadrupole-time-of-flight mass spectrometry. Anal. Bioanal. Chem. 405 23180090 10.1007/s00216-012-6562-x 44. Doumi, I., Lang, L., Vileno, B., Deponte, M. & Faller, P. Glutathione protects other cellular thiols against oxidation by Cu < SUP > II-Dp44mT. Chemistry-A Eur. J. 30 10.1002/chem.202304212 38408264 45. Ismail, M. et al. Biomimetic Dp44mT-nanoparticles selectively induce apoptosis in Cu-loaded glioblastoma resulting in potent growth Inhibition. Biomaterials 289 10.1016/j.biomaterials.2022.121760 36044788 46. Krishan, S., Sahni, S. & Richardson, D. R. The anti-tumor agent, Dp44mT, promotes nuclear translocation of tfeb < i > via inhibition of the AMPK-mTORC1 axis. Biochim. Et Biophys. Acta-Molecular Basis Disease 1866 10.1016/j.bbadis.2020.165970 32950675 47. Abdel-Aziz AA Synthesis and anti-inflammatory activity of sulfonamides and carboxylates incorporating trimellitimides: dual cyclooxygenase/carbonic anhydrase inhibitory actions Bioorg. Chem. 2019 84 260 268 10.1016/j.bioorg.2018.11.033 30508771 Abdel-Aziz, A. A. et al. Synthesis and anti-inflammatory activity of sulfonamides and carboxylates incorporating trimellitimides: dual cyclooxygenase/carbonic anhydrase inhibitory actions. Bioorg. Chem. 84 30508771 10.1016/j.bioorg.2018.11.033 48. Celebioglu HU Cytotoxic effects, carbonic anhydrase isoenzymes, alpha-glycosidase and acetylcholinesterase inhibitory properties, and molecular Docking studies of heteroatom-containing sulfonyl hydrazone derivatives J. Biomol. Struct. Dyn. 2021 39 5539 5550 10.1080/07391102.2020.1792345 32691677 Celebioglu, H. U. et al. Cytotoxic effects, carbonic anhydrase isoenzymes, alpha-glycosidase and acetylcholinesterase inhibitory properties, and molecular Docking studies of heteroatom-containing sulfonyl hydrazone derivatives. J. Biomol. Struct. Dyn. 39 32691677 10.1080/07391102.2020.1792345 49. Eshal J Synthesis, biological evaluation, and in Silico studies of phenyl naphthalene-2-sulfonate derived thiosemicarbazones as potential carbonic anhydrase inhibitors Bioorg. Chem. 2025 155 108118 10.1016/j.bioorg.2024.108118 39793219 Eshal, J. et al. Synthesis, biological evaluation, and in Silico studies of phenyl naphthalene-2-sulfonate derived thiosemicarbazones as potential carbonic anhydrase inhibitors. Bioorg. Chem. 155 39793219 10.1016/j.bioorg.2024.108118 50. Altunoluk OC Özbek O Kalay E Tokalı FS Aslan ON Surface characterization of barium(II)-selective potentiometric sensor based on a newly synthesized thiosemicarbazone derivative molecule Electroanalysis 2024 36 e202300407 10.1002/elan.202300407 Altunoluk, O. C., Özbek, O., Kalay, E., Tokalı, F. S. & Aslan, O. N. Surface characterization of barium(II)-selective potentiometric sensor based on a newly synthesized thiosemicarbazone derivative molecule. Electroanalysis 36 51. Tokalı FS Alım Z Yırtıcı Ü Carboxylate- and Sulfonate-Containing Quinazolin-4(3H)-one rings: synthesis, characterization, and carbonic anhydrase I–II and acetylcholinesterase Inhibition properties ChemistrySelect 2023 8 e202204191 10.1002/slct.202204191 Tokalı, F. S., Alım, Z. & Yırtıcı, Ü. Carboxylate- and Sulfonate-Containing Quinazolin-4(3H)-one rings: synthesis, characterization, and carbonic anhydrase I–II and acetylcholinesterase Inhibition properties. ChemistrySelect 8 52. Tokalı FS Synthesis of new carboxylates and sulfonates containing thiazolidin-4-one ring and evaluation of inhibitory properties against some metabolic enzymes J. Iran. Chem. Soc. 2023 20 2631 2642 10.1007/s13738-023-02861-3 Tokalı, F. S. et al. Synthesis of new carboxylates and sulfonates containing thiazolidin-4-one ring and evaluation of inhibitory properties against some metabolic enzymes. J. Iran. Chem. Soc. 20 53. Nemr MTM Design, synthesis and mechanistic study of new benzenesulfonamide derivatives as anticancer and antimicrobial agents carbonic anhydrase IX Inhibition Rsc Adv. 2021 11 26241 26257 10.1039/d1ra05277b 35479426 PMC9037358 Nemr, M. T. M. et al. Design, synthesis and mechanistic study of new benzenesulfonamide derivatives as anticancer and antimicrobial agents carbonic anhydrase IX Inhibition. Rsc Adv. 11 35479426 10.1039/d1ra05277b PMC9037358 54. Pastorekova S Zatovicova M Pastorek J Cancer-associated carbonic anhydrases and their Inhibition Curr. Pharm. Des. 2008 14 685 698 10.2174/138161208783877893 18336315 Pastorekova, S., Zatovicova, M. & Pastorek, J. Cancer-associated carbonic anhydrases and their Inhibition. Curr. Pharm. Des. 14 18336315 10.2174/138161208783877893 55. Moussaoui M Design and optimization of Quinazoline derivatives as potent EGFR inhibitors for lung cancer treatment: A comprehensive QSAR, ADMET, and molecular modeling investigation ACS Omega 2024 9 45842 45857 10.1021/acsomega.4c04639 39583714 PMC11579736 Moussaoui, M. et al. Design and optimization of Quinazoline derivatives as potent EGFR inhibitors for lung cancer treatment: A comprehensive QSAR, ADMET, and molecular modeling investigation. ACS Omega 9 39583714 10.1021/acsomega.4c04639 PMC11579736 56. Moussaoui M QSAR, ADMET, molecular docking, and dynamics studies of 1,2,4-triazine-3(2H)-one derivatives as tubulin inhibitors for breast cancer therapy Sci. Rep. 2024 14 16418 10.1038/s41598-024-66877-2 39013949 PMC11252338 Moussaoui, M. et al. QSAR, ADMET, molecular docking, and dynamics studies of 1,2,4-triazine-3(2H)-one derivatives as tubulin inhibitors for breast cancer therapy. Sci. Rep. 14 39013949 10.1038/s41598-024-66877-2 PMC11252338 57. Zareei S Mohammadi-Khanaposhtani M Adib M Mahdavi M Taslimi P Sulfonamide-phosphonate hybrids as new carbonic anhydrase inhibitors: in vitro enzymatic inhibition, molecular modeling, and ADMET prediction J. Mol. Struct. 2023 1271 134114 10.1016/j.molstruc.2022.134114 Zareei, S., Mohammadi-Khanaposhtani, M., Adib, M., Mahdavi, M. & Taslimi, P. Sulfonamide-phosphonate hybrids as new carbonic anhydrase inhibitors: in vitro enzymatic inhibition, molecular modeling, and ADMET prediction. J. Mol. Struct. 1271 58. Aftab H Synthesis, in vitro biological evaluation and in Silico studies of novel pyrrolidine derived thiosemicarbazones as dihydrofolate reductase inhibitors RSC Adv. 2024 14 31409 31421 10.1039/D4RA05071A 39380649 PMC11460214 Aftab, H. et al. Synthesis, in vitro biological evaluation and in Silico studies of novel pyrrolidine derived thiosemicarbazones as dihydrofolate reductase inhibitors. RSC Adv. 14 39380649 10.1039/d4ra05071a PMC11460214 59. Munir, I. et al. Synthesis of 6-ethoxyphenyl 4-fluorobenzenesulfonate-tagged thiosemicarbazones as carbonic anhydrase inhibitors: In-vitro and in Silico approach. Bioorganic & Med. Chemistry 10.1016/j.bmc.2025.118301 40645021 60. Tokalı FS Şenol H Yetke HI Hacıosmanoğlu-Aldogan E Novel quinazoline-chromene hybrids as anticancer agents: synthesis, biological activity, molecular docking, dynamics and ADME studies Arch. Pharm. 2023 356 e2300423 10.1002/ardp.202300423 37736677 Tokalı, F. S., Şenol, H., Yetke, H. I. & Hacıosmanoğlu-Aldogan, E. Novel quinazoline-chromene hybrids as anticancer agents: synthesis, biological activity, molecular docking, dynamics and ADME studies. Arch. Pharm. 356 10.1002/ardp.202300423 37736677 61. Demirkıran Ö Cytotoxic meroterpenoids from brown Alga Stypopodium schimperi (Kützing) verlaque & Boudouresque with comprehensive molecular Docking & dynamics and ADME studies Process Biochem. 2024 136 90 108 10.1016/j.procbio.2023.11.029 Demirkıran, Ö. et al. Cytotoxic meroterpenoids from brown Alga Stypopodium schimperi (Kützing) verlaque & Boudouresque with comprehensive molecular Docking & dynamics and ADME studies. Process Biochem. 136 62. Petrova OV Synthesis of pyrrole-heterocyclic derivatives as anti-Alzheimer and antidiabetic candidates: an in vitro-in Silico study J. Mol. Struct. 2024 1315 138998 10.1016/j.molstruc.2024.138998 Petrova, O. V. et al. Synthesis of pyrrole-heterocyclic derivatives as anti-Alzheimer and antidiabetic candidates: an in vitro-in Silico study. J. Mol. Struct. 1315 63. Şenol H Ghaffari-Moghaddam M Toraman A Güller U Novel chalcone derivatives of ursolic acid as acetylcholinesterase inhibitors: synthesis, characterization, biological activity, ADME prediction, molecular Docking and molecular dynamics studies J. Mol. Struct. 2024 1295 136804 10.1016/j.molstruc.2023.136804 Şenol, H., Ghaffari-Moghaddam, M., Toraman, A., Güller, U. & G. Ö. & Novel chalcone derivatives of ursolic acid as acetylcholinesterase inhibitors: synthesis, characterization, biological activity, ADME prediction, molecular Docking and molecular dynamics studies. J. Mol. Struct. 1295 64. Şenol H Synthesis and anticancer activity of novel derivatives of alpha,beta-Unsaturated ketones based on oleanolic acid: in vitro and in Silico studies against prostate cancer cells Chem. Biodivers. 2023 20 e202301089 10.1002/cbdv.202301089 37596247 Şenol, H. et al. Synthesis and anticancer activity of novel derivatives of alpha,beta-Unsaturated ketones based on oleanolic acid: in vitro and in Silico studies against prostate cancer cells. Chem. Biodivers. 20 37596247 10.1002/cbdv.202301089 65. Kılınç N Açar M Tuncay S Karasakal FÖ Potential inhibitors identification of severe acute respiratory syndrome-related coronavirus 2 (SARS-COV-2) angiotensin-converting enzyme 2 and main protease from Anatolian traditional plants Lett. Drug Des. Discov 2022 19 996 1006 10.12688/f1000research.52168.2 Kılınç, N., Açar, M., Tuncay, S. & Karasakal, F. Ö. Potential inhibitors identification of severe acute respiratory syndrome-related coronavirus 2 (SARS-COV-2) angiotensin-converting enzyme 2 and main protease from Anatolian traditional plants. Lett. Drug Des. Discov 19 66. Çakır F Novel 4-((3-fluorobenzyl)oxy)benzohydrazide derivatives as promising anti-prostate cancer agents: synthesis, characterization and in vitro & in Silico biological activity studies J. Mol. Struct. 2025 1322 140702 10.1016/j.molstruc.2024.140702 Çakır, F. et al. Novel 4-((3-fluorobenzyl)oxy)benzohydrazide derivatives as promising anti-prostate cancer agents: synthesis, characterization and in vitro & in Silico biological activity studies. J. Mol. Struct. 1322 ",
  "metadata": {
    "Title of this paper": "Novel 4-((3-fluorobenzyl)oxy)benzohydrazide derivatives as promising anti-prostate cancer agents: synthesis, characterization and in vitro & in Silico biological activity studies",
    "Journal it was published in:": "Scientific Reports",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12480515/"
  }
}