{
  "title": "Paper_1113",
  "abstract": "pmc Biomed Res Int Biomed Res Int 2029 bmri BMRI BioMed Research International 2314-6133 2314-6141 Wiley PMC12445129 PMC12445129.1 12445129 12445129 41031253 10.1155/bmri/2449997 BMRI2449997 1 Research Article Article The Danger of Long‐Term Use of Rauwolfia vomitoria Dagadu Perpetua  1 Adjei Samuel https://orcid.org/0000-0001-5954-908X  2 sadjei@noguchi.ug.edu.gh Asare George Awuku https://orcid.org/0000-0002-8002-5579  3 gaasare@ug.edu.gh Bugyei Kwasi  1 Apandago Mahamadu Rodger  3 Ohwo Ufuoma  4 Rahman Habibur  5 Banerjee Baisakhi bbanerjee@wiley.com   1 Department of Medical Pharmacology University of Ghana Medical School Accra Ghana ug.edu.gh   2 Department of Animal Experimentation Noguchi Memorial Institute for Medical Research (NMIMR) University of Ghana Accra Ghana ug.edu.gh   3 Department of Medical Laboratory Sciences University of Ghana Accra Ghana ug.edu.gh   4 Department of Medical Laboratory Science Novena University Ogume Ogume Delta State Nigeria   5 Department of Pathology Bangladesh Agricultural University Mymensingh Bangladesh bau.edu.bd 18 9 2025 2025 2025 479482 2449997 25 7 2025 09 1 2025 13 8 2025 18 09 2025 30 09 2025 01 10 2025 Copyright © 2025 Perpetua Dagadu et al. BioMed Research International published by John Wiley & Sons Ltd. 2025 https://creativecommons.org/licenses/by/4.0/ This is an open access article under the terms of the http://creativecommons.org/licenses/by/4.0/  Rauwolfia vomitoria R. vomitoria R. vomitoria. R. vomitoria C C p C μ p p C p Keywords hepatotoxicity plant extract Rauwolfia vomitoria safety sub-chronic toxicity pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement no pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes source-schema-version-number 2.0 cover-date 2025 details-of-publishers-convertor Converter:WILEY_ML3GV2_TO_JATSPMC version:6.6.3 mode:remove_FC converted:18.09.2025  Dagadu Perpetua Adjei Samuel Asare George Awuku Bugyei Kwasi Apandago Mahamadu Rodger Ohwo Ufuoma Rahman Habibur The Danger of Long‐Term Use of Rauwolfia vomitoria BioMed Research International 2025 2449997 2025 10.1155/bmri/2449997  Academic Editor: 1. Introduction  Rauwolfia vomitoria 1 2 R. vomitoria 2 3 Medicinal purposes include the roots being used as a decoction to aid neural relaxation and sleep [ 4 5 6 R. vomitoria 7 R. vomitoria Rauwolfia serpentina 8 More studies in recent times have reported the hypoglycaemic and antihyperglycaemic effects, justifying the use of R. vomitoria R. vomitoria 9 The cholesterol‐lowering effect of the methanolic leave extract of R. vomitoria R. vomitoria 10 The aqueous leaf extract of R. vomitoria p 11 Improvement in testosterone levels was observed with an aqueous ethanolic extract that was administered to rats at 20, 40 and 100 mg/kg bwt for 60 days. At a dose of 40 mg/kg bwt, the weight of reproductive organs increased. Furthermore, serum testosterone increased significantly. Testicular antioxidants such as thiobarbituric acid (TBA), glutathione and catalase also increased. Thus, the study suggests male fertility improvement with R. vomitoria 12 Other health benefits of R. vomitoria 13 The antitumour effect on cell lines and ovarian cancer models was evaluated using 20 and 50 mg/kg bwt on mice. The growth of tumour was suppressed by 36% and 66%, respectively, in the mice. Furthermore, there was synergistic interaction potentiating the effect of carboplatin [ 14 It has been reported that 16 mg/kg bwt R vomitoria 15 15 A ß‐carboline alkaloid alstonine, found in the root bark extract, had reserpine removed. Deionised water was used to dissolve the R. vomitoria R. vomitoria 16 R. vomitoria 16 R. vomitoria 1 Genotoxic and cytotoxic assessments using male germ cell lines of the pest grasshopper Zonocerus variegatus 17 Toxicity studies especially on the liver and kidney have been examined in different studies. Ethanolic extracts of the leaf and root were orally administered to rats daily at 1 and 2 g/kg bwt for 14 days. Liver and kidney function tests were performed, and relative organ weights were determined. Both blood and tissue samples did not reveal hepatorenal toxicity [ 18 Chronic toxicity studies on Wistar rats for 60 days using the aqueous root extract of R. vomitoria R. vomitoria 19 Similar studies were undertaken to assess the safety of R. vomitoria 20 21 The crude ethanolic extract on foetal lungs at 150 and 250 mg/kg bwt leaf extract showed marked distortion of the architecture of the lungs in Wistar rats [ 22 When aqueous stem back of R. vomitoria R. vomitoria 23 The active pharmacological agents determined by GC‐MS showed 22 and 16 phytochemicals in the leaf and roots, respectively. Squalene > phytol > n − hexadecanoic acid > tetradecenal > 9, 12, 15 − octadecatrienoic acid > ethyl ester. The roots contained cis − vaccenic acid > n − hexadecanoic acid > ( E) − 9 − octadecenoic acid ethyl ester > cyclohexanecarbonitrile > 1 − (−4 − chlorophenyl) > 8H − azeceno [5, 4 − b] indol − 8 − one > 5 − ethylidene. Thus, the therapeutic effect may be greater in the leaf than in the roots [ 24 The compelling therapeutic advantages intermingled with diverse controversies of toxicities, necessitated the need to proceed on a long‐term investigation to determine the safety of R. vomitoria 2. Material and Methods 2.1. Plant Material 2.1.1. Plant Collection and Identification Plant roots of R. vomitoria Kakapenpen 2.1.2. Preparation of Aqueous Extract of R. vomitoria 2.1.2.1. Plant Extracts The roots were carefully washed with water, subdued‐sun‐dried for 2 weeks, pulverised, packaged in sample bottles, labelled appropriately, and stored at room temperature (25°C–27°C) prior to the onset of the experiment. The powdered rootbark of R. vomitoria 25 26 Carica papaya 27 30 R. vomitoria 31 R. vomitoria 32 R. vomitoria 33 R. vomitoria R. vomitoria The rootbark was macerated separately for 24 h with 4000 mL of distilled water and was heated for 1 h afterwards [ 34 34 34 35 36 37 34 2.2. Experimental Animals Rats were obtained and housed at the Department of Animal Experimentation (DAE), Noguchi Memorial Institute for Medical Research (NMIMR), University of Ghana. Animals were allowed to acclimatise for 7 days in plastic cages with wire screen tops at room temperature. Wood shavings were used as bedding in accordance with ethical guidelines. Rats were made to be under 12‐h light and 12‐h darkness. Temperature and humidity were set at 22 ° ° ad libitum 38 2.2.1. Experimental Design Experimental procedures were carried out in accordance with international ethics guidelines on animal care, the National Institutes of Health Guide for the care and use of laboratory animals and the University of Ghana‐Institutional Animal Care and Use Committee’s (IACUC) guidelines. The study was an experimental design that included the use of 54 adult pathogen‐free male Sprague‐Dawley (SD) rats weighing 300–400 g. 2.3. Experimentation Rats were randomised into four (4) groups which included the normal control group (group C). A stratified randomisation method was used. Basically, all rats were labelled, weighed and ranked from the lowest to the highest. They were divided into weight strata of quantiles. From each weight stratum, one rat was selected for a group, thus ensuring a fair distribution of weights across groups. By so doing, biases were minimised. The experimental setup included daily administration of plant extract R. vomitoria RVRAE 2.4. Termination of Experiment Rats were anaesthetised using isoflurane gas administered within a chamber. The chamber was rapidly saturated with 4%–5% isoflurane (Pharmanova, India) gas. A 10‐L chamber was used with a flow rate of about 5 L per minute. The chamber was carefully controlled to ensure the appropriate concentration of isoflurane was attained. An amount of 5 mL of blood was drawn by cardiac puncture and discharged into EDTA and heparinised Eppendorf tubes. Rats were then euthanised using isoflurane in a glass euthanasia chamber and observed for death as an end point. Organs harvested for evaluation included prostate, seminal and other systemic organs such as the liver, kidneys, heart, lungs, spleen and pancreas. Organs were weighed, rinsed in normal saline solution and placed in 10% buffered formalin for histological analysis. 2.4.1. Laboratory Test 2.4.1.1. PSA (Principle and Methods) PSA analyses were carried out using the MyBiosource Rat PSA ELISA kit (San Diego, USA). This ELISA kit employed the Sandwich‐ELISA principle. The manufacturer’s instructions were followed. The microwells of the ELISA plate were precoated with an antibody specific to rat PSA. Samples and standards were added to the ELISA plate wells, which combined with the PSA in the serum. A biotinylated detection antibody specific for rat PSA and avidin‐horseradish peroxidase (HRP) conjugate were added successively to each microplate well and incubated. Unbound components were washed away. Substrate solution was added and incubated. The enzyme–substrate reaction that occurred subsequently was terminated by the addition of a stop solution (Conc. HCl). The optical density (OD) was measured spectrophotometrically at a wavelength of 450 ± 2 nm. The OD value obtained was proportional to the concentration of rat PSA. 2.4.1.2. General Chemistry The general chemistry analysis was performed using the Seamaty microfluidic dry chemistry analyser (Sichuan Province, China). This analyser operation was based on an embedded system and utilised a reagent disc, based on the principle of spectrophotometry to determine the concentrations of 19 parameters in a blood sample. The parameters measured included total protein, globulin, albumin, albumin/globulin ratio, total bilirubin, direct bilirubin, L‐ γ 2.4.1.3. Haematological Parameter Tests The Mindray BC 5000 haematology analyser (Shenzhen, China) was used in performing the haematology analyses. The analyser employed the electrical impedance method to determine the count and size distribution of red blood cells (RBC), white blood cells (WBC) and platelets (PLTs). In addition, it used a colorimetric method to determine haemoglobin (HGB). 2.4.1.4. Histopathological Study Tissues were fixed in appropriate fixatives and processed using Leica TP 1020 tissue processor (Wetzlar, Germany) which employed the routine paraffin embedding procedure. The embedded tissues were subjected to serial sectioning of a thickness of 4 μ 2.4.1.5. Statistical Analysis Data was processed in SPSS Version 29. Continuous variables were expressed as mean ± SD. ANOVA was performed to determine areas of statistical differences. Post hoc Bonferroni analysis was then performed to determine specific groups with differences. 2.4.1.6. Ethical Consideration The protocol was reviewed and approved by the University of Ghana Institutional Animal Care and Use Committee (UG‐ IACUC) with ethics approval number UG‐IACUC 040/23–24. Rats were maintained and treated humanely in line with the five f’s of freedom from hunger and thirst, freedom from discomfort, freedom from pain, injury or disease, freedom from stress and distress, and freedom to express (most) normal behaviour. Additionally, the reduction and refinement principle as part of the 3 R principles used in animal studies were applied. 3. Results From Table 1 Table 1 Effect of Rauwolfia vomitoria RV RV RV  Control  Low dose  Medium dose  High dose  p value ALB 37.8 ± 2.5 34.6 ± 2.8 37.1 ± 1.1 34.2 ± 1.5 NS TP 74.8 ± 2.5 70.9 ± 4.5 74.1 ± 4.9 71.8 ± 2.8 NS GLOB 37.0 ± 2.1 36.3 ± 2.6 37.0 ± 4.5 37.5 ± 3.8 NS A/G 1.0 ± 0.1 1.0 ± 0.1 1.0 ± 0.1 0.9 ± 0.1 NS TB 1.3 ± 0.9 1.1 ± 1.0 1.6 ± 1.2 2.1 ± 1.3 NS DB 0.8 ± 0.6 0.7 ± 0.6 0.6 ± 0.4 0.9 ± 0.5 NS IBIL 0.6 ± 0.4 0.7 ± 0.1 1.0 ± 1.0 1.1 ± 1.2 NS GGT 3.0 ± 1.3 2.4 ± 0.5 2.4 ± 0.5 3.4 ± 1.1 NS AST 166.7 ± 34.9 151.2 ± 29.4 189.4 ± 41.5 162.6 ± 80.7 NS ALT 73.8 ± 35.1 84.4 ± 37.4 61.8 ± 13.1 52.0 ± 18.03 NS ALP 144.2 ± 29.3 ∗ 246.4 ± 66.9 ∗ † 161.2 ± 48.8 †§ 116.8 ± 16.8 § 0.008 ∗ † § TBA 27.9 ± 7.6 ∗ †§ 19.0 ± 5.5 ∗ 18.6 ± 4.3 † 13.2 ± 3.6 § 0.046 ∗ † §  Note: n p p p Abbreviations: A/G, albumin/globulin ratio; ALB, albumin (g/dL); ALP, alkaline phosphatase (IU); ALT, alanine aminotransferase (IU); AST, aspartate aminotransferase (IU); DB, direct bilirubin ( μ γ μ μ Post hoc analysis showed differences between the C and the LD, LD and the MD, and MD and the HD. There was a steady decline of ALT from the LD to the HD. Generally, a dose‐dependent decrease was observed. TBA demonstrated a dose‐dependent decrease. Statistically significant differences were observed between the C and LD and MD and HD. Furthermore, TBA showed significant differences between the C group and the MD group. Finally, there was significance between the C group and the HD group. From Table 2 3 p p Table 2 Effect of Rauwolfia vomitoria RV RV RV RV  Control  Low dose  Medium dose  High dose  p value BUN 7.1 ± 0.5 6.9 ± 1.1 8.1 ± 1.3 7.5 ± 0.6 NS Crea 43.9 ± 9.5 41.9 ± 7.0 38.5 ± 13.1 46.0 ± 9.2 NS BUN/Crea 167.7 ± 37.9 169.9 ± 41.7 242.0 ± 136.4 167.7 ± 29.4 NS UA 170.8 ± 35.3 194.9 ± 41.8 225.6 ± 67.9 307.9 ± 270.2 NS  Note: n Abbreviations: BUN, blood urea nitrogen (mmol/L); Crea, creatinine ( μ μ Table 3 Effect of Rauwolfia vomitoria RV RV RV RV  Control  Low dose  Medium dose  High dose  p value TC 1.8 ± 0.3 1.7 ± 0.4 1.7 ± 0.2 1.8 ± 0.1 NS TG 1.3 ± 0.3 ∗ 1.1 ± 0.5 0.8 ± 0.3 0.7 ± 0.4 ∗ 0.041 HDL 1.0 ± 0.1 0.9 ± 0.3 1.0 ± 0.2 1.0 ± 0.115 NS LDL 0.3 ± 0.1 ∗ 0.3 ± 0.2 0.4 ± 0.1 0.5 ± 0.1 ∗ 0.043  Note: n Abbreviations: HDL, high‐density lipoprotein cholesterol (mmol/L); LDL, low‐density lipoprotein cholesterol (mmol/L); NS, not significant; TC, total cholesterol (mmol/L); TG, triglycerides (mmol/L).  ∗ Miscellaneous assays were also performed as seen in Table 4 p p 5 p 6 7 Table 4 Effect of Rauwolfia vomitoria RV RV RV RV  Control  Low dose  Medium dose  High dose  p value GLU 5.2 ± 2.0 ∗ 13.0 ± 6.2 ∗ †§ 4.0 ± 1.3 † 5.8 ± 1.5 § 0.001 ∗ † § AMY 1352 ± 144 ∗ † 1631 ± 150 ∗ 1074.2 ± 58.9 † 1294 ± 282 0.006 ∗ † CK 447.0 ± 222.5 299.8 ± 120.7 486.2 ± 242.6 486.8 ± 290.3 NS PSA 0.357 ± 0.065 0.437 ± 0.173 0.410 ± 0.126 0.315 ± 0.056 NS  Note: n p p p Abbreviations: AMY, amylase (IU); CK, creatinine kinase (IU); GLU, fasting glucose (mmol/L); NS, not significant; PSA, prostate‐specific antigen (ng/mL). Table 5 Effect of Rauwolfia vomitoria RV RV RV RV  Parameter  Control  Low dose  Medium dose  High dose  p values RBC 9.27 ± 0.423 8.60 ± 0.651 9.10 ± 0.441 9.04 ± 0.288 NS HGB 15.19 ± 0.491 14.00 ± 0.622 15.11 ± 0.674 14.73 ± 0.753 NS HCT 44.03 ± 1.36 ∗ 40.91 ± 1.87 ∗ 44.26 ± 2.27 43.13 ± 2.65 0.027 MCV 47.56 ± 1.49 47.74 ± 1.99 48.70 ± 2.62 47.72 ± 2.35 NS MCH 16.40 ± 0.412 16.34 ± 0.728 16.64 ± 0.800 16.30 ± 0.701 NS MCHC 34.49 ± 0.453 34.23 ± 0.431 34.17 ± 0.680 34.17 ± 0.450 NS RDW‐CV 15.67 ± 0.704 15.31 ± 0.773 15.50 ± 0.614 15.23 ± 0.628 NS RDW‐SD 27.94 ± 1.41 27.36 ± 1.45 28.21 ± 1.16 27.17 ± 0.956 NS PLT 922 ± 259 857 ± 178 796 ± 170 990 ± 65.9 NS MPV 7.63 ± 0.411 7.77 ± 0.419 7.69 ± 0.339 7.32 ± 0.248 NS PDW 14.96 ± 0.127 14.94 ± 0.172 15.06 ± 0.140 14.92 ± 0.160 NS PCT 0.698 ± 0.180 0.666 ± 0.138 0.612 ± 0.130 0.725 ± 0.048 NS P‐LCC 110.5 ± 27.51 111 ± 29.38 104.3 ± 24.98 101 ± 17.75 NS P‐LCR 12.53 ± 3.30 12.97 ± 2.41 13.26 ± 2.50 10.22 ± 1.84 NS  Note: n p Abbreviations: HCT, haematocrits (%); HGB, haemoglobin concentration (g/dL); MCH, mean corpuscular haemoglobin (pg); MCHC, mean corpuscular haemoglobin concentration (g/dL); MCV, mean corpuscular volume (fL); MPV, mean platelet volume (fL); NS, statistically not significant; PCT, plateletcrit (×10 3 6  ∗ Table 6 Effect of Rauwolfia vomitoria RV)  Parameter  Control  Low dose  Medium dose  High dose  p value WBC 6.80 ± 2.178 7.31 ± 2.24 5.58 ± 2.85 6.16 ± 3.26 NS Neu# 1.82 ± 0.648 1.70 ± 0.559 1.62 ± 1.38 1.46 ± 0.444 NS Lym # 3.79 ± 1.71 4.48 ± 1.65 3.04 ± 1.54 3.74 ± 2.57 NS Mon# 0.619 ± 0.178 0.689 ± 0.208 0.416 ± 0.223 0.492 ± 0.201 NS Eos# 0.534 ± 0.231 0.414 ± 0.187 0.484 ± 0.343 0.447 ± 0.232 NS Bas# 0.030 ± 0.010 0.029 ± 0.028 0.024 ± 0.011 0.023 ± 0.015 NS Neu% 28.13 ± 8.82 23.41 ± 3.49 27.69 ± 9.92 27.80 ± 10.91 NS Lym% 53.14 ± 13.92 60.27 ± 7.93 54.73 ± 11.35 55.18 ± 13.58 NS Mon% 9.61 ± 2.70 9.50 ± 1.06 7.69 ± 2.79 8.67 ± 2.29 NS Eos% 8.63 ± 4.75 6.36 ± 4.18 9.41 ± 5.88 7.88 ± 2.47 NS Bas% 0.486 ± 0.212 0.457 ± 0.597 0.486 ± 0.587 0.467 ± 0.250 NS  Note: n Abbreviations: Bas, basophil count (U/L); Eos, eosinophil (U/L) count; Lym, lymphocytes (%); Mon, monocyte (U/L); Neu, neutrophil count (U/L); NS, statistically not significant; WBC, white blood cell count (×10 3  ∗ p Table 7 Organ/relative organ weights of various groups after 90 days of treatment with R. vomitoria.  Organ/rel. organ wt.  Control  Low dose  Medium dose  High dose  p value Heart (g) 0.93 ± 0.04 0.86 ± 0.04 0.98 ± 0.06 0.95 ± 0.09 NS Rel. weight (10 −3 3.23 ± 0.18 3.15 ± 0.09 3.91 ± 0.37 3.51 ± 0.28 NS Liver (g) 8.30 ± 0.31 7.74 ± 0.41 7.66 ± 0.27 7.43 ± 0.49 NS Rel. weight (10 −3 2.89 ± 0.13 2.83 ± 0.09 2.82 ± 0.14 2.75 ± 0.12 NS Kidney (g) 0.88 ± 0.04 0.84 ± 0.04 0.84 ± 0.05 0.80 ± 0.04 NS Rel. weight (10 −3 3.07 ± 0.17 2.92 ± 0.15 3.09 ± 0.19 2.96 ± 0.12 NS Spleen (g) 0.53 ± 0.04 0.56 ± 0.02 0.48 ± 0.03 0.58 ± 0.05 NS Rel. weight (10 −3 1.86 ± 0.19 2.05 ± 0.10 1.83 ± 0.21 2.15 ± 0.16 NS Prostate (g) 0.47 ± 0.04 0.49 ± 0.06 0.57 ± 0.09 0.58 ± 0.07 NS Rel. weight (10 −3 1.64 ± 0.16 1.77 ± 0.19 2.03 ± 0.31 2.16 ± 0.27 NS Pancreas 0.93 ± 0.07 0.98 ± 0.12 0.67 ± 0.09 0.72 ± 0.06 NS Rel. weight (10 −3 3.24 ± 0.29 3.76 ± 0.44 2.43 ± 0.34 2.65 ± 0.19 NS Testes (g) 2.44 ± 0.22 2.68 ± 0.32 2.55 ± 0.15 2.42 ± 0.15 NS Rel. weight (10 −3 8.55 ± 0.93 9.79 ± 1.00 9.49 ± 0.85 8.96 ± 0.47 NS S. vesicle (g) 1.34 ± 0.14 1.34 ± 0.05 1.09 ± 0.25 1.03 ± 0.17 NS Rel. weight (10 −3 4.64 ± 0.43 4.93 ± 0.15 3.86 ± 0.81 3.88 ± 0.67 NS Lungs (g) 2.13 ± 0.12 ∗ 1.81 ± 0.05 ∗ 1.77 ± 0.15 1.62 ± 0.17 0.029 ∗ Rel. weight (10 −3 7.49 ± 0.64 6.69 ± 0.27 6.53 ± 0.62 5.95 ± 0.51 NS  Note: n Abbreviations: NS, statistically not significant; Rel. weight, relative weight. Figure 1 2 3 Figure 1 Photomicrographs of kidney sections of rats treated with R. vomitoria (a) (b) (c) (d) Figure 2 Photomicrographs of liver sections of rats treated with R. vomitoria aqueous root bark extract for 90 days. (a) Control gp, (b) low dose = 10 mg/kg bwt, (c) medium dose = 25 mg/kg bwt, and (d) high dose = 50 mg/kg bwt. All four photomicrographs: (a) a normal‐looking portal triad (arrows); (b) the portal triad (solid arrow): portal veins, red blood cells, and inflammatory cells (broken arrow); (c) more inflammatory cells (solid arrow) within the parenchyma of the liver: the portal vein is infiltrated by red blood cells (broken arrow) and inflammatory cells (arrowheads); and (d) the portal veins looking elongated (circled) and filled with aged red blood cells (arrows) (magnification = ×100). (a) (b) (c) (d) Figure 3 Photomicrographs of lung sections of rats treated with R. vomitoria (a) (b) (c) (d) 4. Discussion Allopathic medicines have tremendously improved health and have been well researched. However, other undesirable side effects are sometimes recorded. The quest for natural products for prostamegaly is on the increase. Most of these products have anecdotal evidence of therapeutic efficacy, but few have been well researched for their safety. In the case of natural products for prostate enlargement, Serenoa repens 39 Croton membranaceus 40 R. vomitoria α 1 The point of conjuncture on R. vomitoria’s R. vomitoria 21 24 19 R. vomitoria 41 4 R. vomitoria 42 Looking at the whole profile, from blood to tissue, as well as other related assays of the biliary tree, liver injury is possible. This may have occurred judging from the fact that such biliary tree disorders are evidenced by increased GGT or ALP. Table 3 Although normal histoarchitecture of the liver was observed in another study [ 41 2 41 ALP results were inconsistent compared to total bile acids (TBAs) that decreased dose dependently. Bile acids are synthesised in the liver, and the dose‐dependent decrease is suggestive of possible hepatic dysfunction such as cirrhosis or hepatitis [ 43 2b 2c 2d The reduction in the bile acid pool has implications for fat emulsification; hence, the impeded absorption of dietary fat leading to reduced TG synthesis (Table 3 Serenoa repens 44 Croton membranaceus 40 Urtica dioica The alteration of the lipid metabolism profile is also seen in a significant dose‐dependent increase of LDL. The poor utilisation of cholesterol to build bile acids implies that cholesterol levels may increase [ 45 46 The aforementioned suggestion agrees with the possibility of reduced digestive enzymes. Table 4 For some reason, the LDs of R. vomitoria 47 The lungs demonstrated some changes in histoarchitecture as similarly observed by others [ 23 5. Conclusion The study demonstrated a dose‐dependent decrease in lung weights. This is further evidenced by the lung histological abnormalities. The lungs were therefore affected by the extract. With respect to the liver, ALP and TBA increased significantly, demonstrating a liver pathological condition. The liver histology also showed abnormalities, as seen in the photomicrographs. Such presentations of the liver are suggestive of hepatotoxicity. It is obvious that safety concerns can be raised about the use of the aqueous root bark extract of R. vomitoria Conflicts of Interest The authors declare no conflicts of interest. Author Contributions P.D.: experimentation and writing; S.A.: conceptualisation and editing; G.A.A.: conceptualisation, writing, and editing; K.B.: supervision; R.A.M.: experimentation and data curation; U.O.: editing and H.R.: histological analysis. Funding No funding was received for this manuscript. Data Availability Statement The data that support the findings of this study are available on request from the corresponding author. The data are not publicly available due to privacy or ethical restrictions. 1 Fang T. Xue Z. S. Li J. X. Liu J. K. Wu D. Li M. Q. Song Y. T. Yun S. F. Yan J. Rauwolfia vomitoria Extract Suppresses Benign Prostatic Hyperplasia by Reducing Expression of Androgen Receptor and 5 α Journal of Integrative Medicine 2021 19 258 264 33341427 10.1016/j.joim.2020.12.002 2 Asare G. A. Dagadu P. Adjei S. Asiedu B. Takaidza S. Naidoo V. Amoah B. Orabueze I. O. Bugyei K.  Rauwolfia vomitoria Phytomedicine Plus 2025 5 100739 10.1016/j.phyplu.2025.100739 3 Orwa C. Mutua A. Kindt R. Jamnadass R. Simons A. Agroforesree Database: A Tree Reference and Selection Guide Version 4.0 World Agroforestry Centre 4 Kerharo J. Bouquet A. Plantes médicinales et toxique de la côte d’Ivoire Haute Volta, Edition Vigot 1950 67 5 Bisong S. Brown R. Osim E. E. Comparative Effects of Rauwolfia vomitoria Journal of Ethnophamacology 2010 132 334 339 10.1016/j.jep.2010.08.045 20800668 6 Burkill H. M. Entry for Lasiurus hirsutus The Useful Plants of West Tropical Africa 1985 2nd edition Royal Botanic Gardens 7 Adegoke E. A. Akisanya A. Naqvi S. H. Z. Studies of Nigerian Medicinal Plants I. Preliminary Survey of Plant Alkaloids Journal of West African Science Association 1968 13 13 33 8 Bouquet A. Féticheurs et médecines traditionnelles du Congo (Brazzaville) Mémoires ORSTOM. Paris 1969 36 238 288 9 Willaman J. J. Li H. L. Alkaloid- Bearing Plants and Their Contained Alkaloids. 1957–1968 Lloydia, Supplement 1970 33 1 286 10 N’doua L. A. R. Abo K. J. C. Aoussi S. Kouakou L. K. Ehile E. E. Aqueous Extract of Rauwolfia vomitoria American Scientific Research Journal for Engineering, Technology, and Sciences 2016 20 66 77 https://asrjetsjournal.org/index.php/American_Scientific_Journal/article/download/1706/778 11 Owoade A. O. Adetutu A. Ogundipe O. O. Owoade A. W. Hypolipidemic Potentials of Methanolic Extract of Rauvolfia vomitoria Asian Plant Research Journal 2021 8 15 25 10.9734/aprj/2021/v8i430181 12 Otis T. B. I. Marie-Odile T. W. Dotia K. Emmanuel A. M. Kofi K. Effect of Aqueous Extract of Rauvolfia vomitoria International Journal of Biochemistry Research & Review 2021 30 28 40 10.9734/ijbcrr/2021/v30i830284 13 Kada A. S. Aneng E. Mbouh M. Manfo F. P. T. Ngimgoh S. N. Nantia E. A. Testicular Antioxidants and Testosterone Enhancing Effects of the Hydro-Ethanolic Extract of Rauvolfia vomitoria Investigational Medicinal Chemistry and Pharmacology 2021 4 14 Isaiah A. M. Effiong E. E. Fidelis U. A. Olawale O. Idongesit N. J. Friday U. U. Vitamin E Supplementation With Rauwolfia vomitoria North American Journal of Medical Science 2012 4 86 89 10.4103/1947-2714.93383 PMC3296325 22408754 15 Igimi A. O. Ezekiel I. Eze E. D. Adams D. M. Adam A. Mohammed K. R. Quadri K. K. Okpanachi A. O.  Rauwolfia vomitoria International Journal of Biochemistry and Physiology 2018 3 000138 10.23880/IJBP-16000138 16 Olatokunboh A. O. Kayode Y. O. Adeola O. K. Anticonvulsant Activity of Rauvolfia vomitoria African Journal of Pharmacy and Pharmacology 2009 3 319 322 17 Bemis D. L. Capodice J. L. Gorroochurn P. Katz A. E. Buttyan R. Anti-Prostate Cancer Activity of a Beta-Carboline Alkaloid Enriched Extract From Rauwolfia vomitoria International Journal of Oncology 2006 29 1065 1073 17016636 18 Ingrid D. T. Akwanjoh S. R. Abdoul N. Yacouba M. Cytogenotoxicity Assessment of Aqueous Extracts of Rauvolfia vomitoria Asian Journal of Biochemistry, Genetics and Molecular Biology 2021 7 19 31 10.9734/ajbgmb/2021/v7i230170 19 Oyewole O. Massaquoi H. Oral Administration of Rauwolfia vomitoria African Journal of Biotechnology 2008 7 1577 1580 https://www.ajol.info/index.php/ajb/article/view/58728 20 N’Cho R. P. Koné M. Gbogbo M. Oussou N. J. B. Yapo A. P. Chronic Toxicity Study of Aqueous Roots Extract of Rauvolfia vomitoria International Journal of Current Microbiology and Applied Sciences 2021 10 567 577 21 Eteng M. U. Ibekwe H. Abolaji A. O. Okoi A. I. Onwuka F. C. Osuchukwu N. C. Effect of Rauwolfia vomitoria African Journal of Biotechnology 2009 8 4604 4607 22 Ekong M. B. Muonagolu N. Akpan U. B.  Rauwolfia vomitoria Medicine, Biology, Environmental Science 2018 2 A22 A26 10.21276/AAMS.1929 23 Eluwa M. Osim K. Ekong M. Ekanem T. Akpantah A. Effa E. Nwakanma A. Effect of Crude Ethanolic Leaf Extract of Rauwolfia vomitoria Egyptian Academic Journal of Biological Sciences, Histology & Histochemistry 2014 5 1 7 10.21608/eajbsd.2014.14126 24 Bonheur Y. D. D. Désiré D. D. P. Antoine K. S. David F. Théophile D. Acute and Sub-Acute Toxicity of the Aqueous Extract of the Stem Bark of Rauwolfia vomitoria World Journal of Advanced Research and Reviews 2020 8 373 385 10.30574/wjarr.2020.8.3.0490 25 Asoro I. I. Ebuehi O. A. T. Igwo-Ezikpe M. N. GC-MS Analysis of the Rauwolfia vomitoria European Journal of Medicinal Plants 2021 32 34 45 10.9734/ejmp/2021/v32i630398 26 Jurčević Šangut I. Pavličević L. Šamec D. Influence of Air Drying, Freeze Drying and Oven Drying on the Biflavone Content in Yellow Ginkgo ( Ginkgo biloba Applied Science 2024 14 10.3390/app14062330 27 Hu L. Wang C. Guo X. Chen D. Zhou W. Chen X. Zhang Q. Flavonoid Levels and Antioxidant Capacity of Mulberry Leaves: Effects of Growth Period and Drying Methods Frontiers of Plant Science 2021 12 684974 10.3389/fpls.2021.684974 PMC8371438 34421942 28 Roshanak S. Rahimmalek M. Goli S. A. H. Evaluation of Seven Different Drying Treatments in Respect to Total Flavonoid, Phenolic, Vitamin C Content, Chlorophyll, Antioxidant Activity and Color of Green Tea ( Camellia sinensis C. assamica Journal of Food Science and Technology 2016 53 721 729 10.1007/s13197-015-2030-x 26787992 PMC4711456 29 Yap J. Y. Hii C. L. Ong S. P. Lim K. H. Abas F. Pin K. Y. Effects of Drying on Total Polyphenols Content and Antioxidant Properties of Carica papaya Journal of Science, Food and Agriculture 2020 100 2932 2937 10.1002/jsfa.10320 32031257 30 Nguyen Q.-V. Doan M. D. Bui Thi B. H. Nguyen M. T. Tran Minh D. Nguyen A. D. Le T. M. Nguyen T. H. Nguyen T. D. Tran V. C. Hoang V. C. The Effect of Drying Methods on Chlorophyll, Polyphenol, Flavonoids, Phenolic Compounds Contents, Color and Sensory Properties, and In Vitro Drying Technology 2023 41 1291 1302 10.1080/07373937.2022.2145305 31 Ekong M. B. Bassey O. O. Ebeh D. I. Usukuma G. D. Samuel D. C. Bassey R. B. Peter A. I. Mbadugha C. C. Okokon J. E. Akpanabiatu M. I.  Rauvolfia vomitoria Acta Epileptologica 2024 6 10.1186/s42494-024-00183-2 PMC11960394 40217363 32 Yu J. Ma Y. Drisko J. Chen Q. Antitumor Activities of Rauwolfia vomitoria Current Therapeutic Research, Clinical and Experimental 2013 75 8 14 10.1016/j.curtheres.2013.04.001 24465036 PMC3898180 33 Eluwa M. A. Ekanem T. B. Udoh P. B. Ekong M. B. Asuquo O. R. Akpantah A. O. Nwakanma A. O. Teratogenic Effect of Crude Ethanolic Root Bark and Leaf Extracts of Rauwolfia vomitoria Neuroscience Journal 2013 2013 906731 10.1155/2013/906731 26317105 PMC4437256 34 Afriyie D. K. Asare G. A. Bugyei K. Asiedu-Gyekye I. Gyan B. A. Adjei S. Addo P. Sittie A. Nyarko A. K. Anti-Atherogenic and Anti-Ischemic Potentials of Croton membranaceus Pharmacognosy Research 2013 5 10 16 10.4103/0974-8490.105640 23598919 PMC3579014 35 Sukhdev Handa S. Preet S. Khanuja S. Longo G. Extraction Technologies for Medicinal and Aromatic Plants Scientific Development Dutt Rakesh United Nations Industrial Development Organization and the International Centre for Science and High Technology, 2008 Earth, Environmental and Marine Sciences and Technologies International Centre for Science and High Technology ICS-UNIDO, AREA Science Park 36 Casassa F. Harbertson J. Balancing Tannin Maturity and Extraction 2016 Issue of Wines & Vines https://winebusinessanalytics.com/features/article/173851/Balancing-Tannin-Maturity-and-Extraction 37 Cao X. Zhang Y. Xun H. Wang J. Tang F. High-Yield Recovery of Antioxidant Compounds from Bambusa chungii Antioxidants 2022 11 10.3390/antiox11112231 PMC9686541 36421418 38 Bateson P. Thirty Years of Collaboration With Gabriel Horn Neuroscience and Biobehavioral Reviews 2015 50 4 11 10.1016/j.neubiorev.2014.09.019 25305059 39 Franco J. V. Trivisonno L. F. Sgarbossa N. Alvez G. A. Fieiras C. Escobar Liquitay C. M. Jung J. H.  Serenoa repens World Journal of Men’s Health 2024 42 518 530 10.5534/wjmh.230222 PMC11216968 38164033 40 Asare G. A. Afriyie D. Ngala R. A. Appiah A. A. Anang Y. Musah I. Adjei S. Bamfo-Quaicoe K. Sule D. Gyan B. A. Arhin P. Edoh D. A. Shrinkage of Prostate and Improved Quality of Life: Management of BPH Patients With Croton membranaceus Evidence Based Complement and Alternative Medicine 2015 2015 365205 10.1155/2015/365205 PMC4461762 26106434 41 Ibrahim R. B. Onanuga I. O. Amin A. Bolaji A. O. Ajibola M. I. Sub-Acute Toxicity of Rauwolfia vomitoria SMU Medical Journal 2015 2 166 176 42 Ezejindu D. N. Okafor I. A. Anibeze C. I. P. Uloleme G. C. The Effects of Rauwolfia vomitoria IOSR Journal of Pharmacy and Biological Sciences (IOSR-JPBS) 2013 7 18 22 10.9790/3008-0721822 43 Sauerbruch T. Hennenberg M. Trebicka J. Beuers U. Bile Acids, Liver Cirrhosis, and Extrahepatic Vascular Dysfunction Frontiers of Physiology 2021 12 718783 10.3389/fphys.2021.718783 PMC8358446 34393832 44 Yun J. M. Lee M. Kim D. Prasad K. S. Eun S. Kim O. K. Lee J. Standardized Saw Palmetto Extract Directly and Indirectly Affects Testosterone Biosynthesis and Spermatogenesis Journal of Medicinal Food 2021 24 617 625 10.1089/jmf.2021.K.0021 34161166 45 Li T. Chiang J. Y. L. Regulation of Bile Acid and Cholesterol Metabolism by PPARs PPAR Research 2009 2009 501739 10.1155/2009/501739 19636418 PMC2712638 46 Agrawal N. Freitas Corradi P. Gumaste N. Goldberg I. J. Triglyceride Treatment in the Age of Cholesterol Reduction Progress in Cardiovascular Diseases 2016 59 107 118 10.1016/j.pcad.2016.08.003 27544319 PMC5364728 47 Pierzynowska K. Oredsson S. Pierzynowski S. Amylase-Dependent Regulation of Glucose Metabolism and Insulin/Glucagon Secretion in the Streptozotocin-Induced Diabetic Pig Model and in a Rat Pancreatic Beta-Cell Line, BRIN-BD11 Journal of Diabetes Research 2020 2020 2148740 10.1155/2020/2148740 33294459 PMC7688362 ",
  "metadata": {
    "Title of this paper": "Amylase-Dependent Regulation of Glucose Metabolism and Insulin/Glucagon Secretion in the Streptozotocin-Induced Diabetic Pig Model and in a Rat Pancreatic Beta-Cell Line, BRIN-BD11",
    "Journal it was published in:": "BioMed Research International",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12445129/"
  }
}