{
  "title": "Paper_462",
  "abstract": "Indian J Otolaryngol Head Neck Surg Indian J Otolaryngol Head Neck Surg 1415 ijoto Indian Journal of Otolaryngology and Head & Neck Surgery 2231-3796 0973-7707 Springer PMC11455772 PMC11455772.1 11455772 11455772 39376268 10.1007/s12070-024-04773-x 4773 1 Other Articles Thyroid Uncomplicated Surgery with Lack Placement of Drains. A Retrospective Analysis http://orcid.org/0000-0002-5615-6915 Sanna Andrea and_sanna@yahoo.it 1 Buzzi G. 1 Prando D. 1 Mantovan B. 1 Sanna F. 2 Bagolini F. 1 De Luca M. 1 1 2 https://ror.org/01111rn36 grid.6292.f 0000 0004 1757 1758 Department of Statistical and Financial Sciences, Bologna University, 1 6 2024 10 2024 76 5 472259 4937 4941 10 4 2024 19 5 2024 01 10 2025 01 10 2025 07 10 2024 01 10 2025 © Association of Otolaryngologists of India 2024. Springer Nature or its licensor (e.g. a society or other partner) holds exclusive rights to this article under a publishing agreement with the author(s) or other rightsholder(s); author self-archiving of the accepted manuscript version of this article is solely governed by the terms of such publishing agreement and applicable law. 2024 Background: Thyroid drains after thyroid surgery are often used despite evidence. The aim of this retrospective study was to determine the post-operative complication rates following thyroid uncomplicate surgery without drain. Material and methods: The medical records of two hundred and thirty-nine patients who undergone thyroid surgery without and with drain were reviewed. The rate of post-operative either complications and pain were evaluated. Results: The distribution of the operations performed were similar in two groups, in no-drain group (group A) there were total thyroidectomy 68.7% and lobectomy 31.3% while in drain group (group B) the total thyroidectomy were 70.8% and the lobectomy were 29.2%, this without statistical significant difference. Postoperative complications that occurred included seromas, hematoma and wound infections were without significantly differences. Postoperative pain was significantly lower in group A than in group B at two timepoint. The mean hospital stay was significantly shorter in the non-drained group. Conclusions: The no-drain uncomplicated thyroid surgery was safe and didn’t increase a rates of post-operative complications. In addition, we achieved significant reduction of postoperative pain, hospital stay and overall costs. Keywords Thyroid surgery Complications Drain use pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access no pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement no pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes issue-copyright-statement © Association of Otolaryngologists of India 2024 ",
  "metadata": {
    "Title of this paper": "Thyroid Uncomplicated Surgery with Lack Placement of Drains. A Retrospective Analysis",
    "Journal it was published in:": "Indian Journal of Otolaryngology and Head & Neck Surgery",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC11455772/"
  }
}