{
  "title": "Paper_407",
  "abstract": "pmc BMC Oral Health BMC Oral Health 53 bmcorhl BMC Oral Health 1472-6831 BMC PMC12481880 PMC12481880.1 12481880 12481880 41023949 10.1186/s12903-025-06882-7 6882 1 Case Report Parotid gland myoepithelioma with prominent cystic changes: a rare case report and review of the literature Wu Mengna 1 2 Zhang Tonghan zthlove1982@163.com 1 2 1 https://ror.org/041yj5753 grid.452802.9 Department of Oral and Maxillofacial Surgery, Hospital of Stomatology, 2 https://ror.org/02xe5ns62 grid.258164.c 0000 0004 1790 3548 School of Stomatology, Jinan University, 29 9 2025 2025 25 478159 1504 10 1 2025 2 9 2025 29 09 2025 01 10 2025 01 10 2025 © The Author(s) 2025 2025 https://creativecommons.org/licenses/by-nc-nd/4.0/ Open Access http://creativecommons.org/licenses/by-nc-nd/4.0/ Myoepithelioma of the salivary gland is very rare. Due to the non-specific nature of myoepithelioma symptom, it can be easily mistaken for other benign or malignant tumors. Diagnosis of myoepithelioma primarily relies on histopathological evaluation and immunohistochemical analysis. The treatment of myoepithelioma is complete removal of the tumor. We report a case of a parotid myoepithelioma with cystic degeneration and review the related literature. Keywords Myoepithelioma Benign salivary gland tumor Parotid gland pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement no pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes issue-copyright-statement © BioMed Central Ltd., part of Springer Nature 2025 Introduction Myoepithelioma is a rare benign tumor of the salivary gland, constituting approximately 1% of all salivary gland tumors. There is no significant gender predilection, and it can affect individuals from childhood to old age, with a peak incidence between 40 and 50 years [ 1 Case presentation Clinical history A 66-year-old female patient presented with a 5-year history of a left parotid mass. She reported no specific symptoms or triggers associated with the mass, which was initially detected 5 years prior. An ultrasound at a local hospital revealed a cystic mass in the left parotid region, suspected to be a first branchial cleft cyst. No abnormalities were noted in the right parotid gland. No treatment was initiated at that time. Two years later, a follow-up ultrasound indicated a mixed mass in the left parotid gland, suggestive of a pleomorphic adenoma. The mass had been increasing slowly in size over the last 5 years, prompting her to come to our hospital for further treatment. On presentation, she reported no significant changes in appetite, sleep, or weight, and no family or genetic history of similar conditions. Physical and auxiliary examination Physical examination revealed slight asymmetry of the bilateral maxillofacial regions, with normal mouth opening and jaw movement. No facial numbness or dry mouth was noted. A 2.5 cm *2.5 cm mass was palpated at the lower pole of the left posterior parotid gland, with normal mobility, no tenderness, firm consistency, well-defined borders, and a smooth surface. The overlying skin was intact with no erythema, edema, or ulceration, and the skin temperature was normal. No enlarged lymph nodes were detected in the bilateral cervical regions, and the right parotid gland appeared unremarkable. Auxiliary examination included a cone beam computed tomography (CBCT) of the parotid gland, which demonstrated an oval tumor measuring 29 mm *21 mm in the left parotid gland, with clear margins and nodular enhancement. No enlarged lymph nodes were observed around the mass, and the right parotid gland was normal (Fig. 1 Fig. 1 Imaging examination of left parotid myoepithelioma. A B C Diagnosis and surgical procedure The preoperative diagnosis was \"left parotid gland mass, nature undetermined.\" Upon admission, relevant investigations were conducted, and contraindications were ruled out. The patient underwent a \"left parotid gland lesion excision and partial superficial parotidectomy\" under general anesthesia. A 5-cm curved incision was made anterior to the left earlobe and along the posterior border of the left parotid gland. A well-circumscribed solid mass was identified. The facial nerve branches were carefully dissected and preserved, and a portion of the superficial lobe of the parotid gland was resected. The mass was bluntly dissected and completely removed, and the surgical cavity was irrigated. Adjacent tissues were separated, and a sliding flap was formed to facilitate closure, followed by layered wound closure. Pathological findings Pathological examination revealed an irregular tissue specimen measuring 3 cm × 2.5 cm × 1.5 cm. Grossly, a cystic cavity measuring 2.5 cm × 1.5 cm with a 0.1 cm thick cyst wall and a smooth inner surface was observed. Microscopically, the tumor exhibited well-defined borders and was primarily composed of myoepithelial cells arranged in tubular, microcystic, and lamellar patterns. The cells had round, oval, or spindle-shaped nuclei, with some cytoplasm appearing clear or eosinophilic. No focal chondromyxoid stroma was identified on microscopic examination. The tumor stroma was lipomatous and fibrous (Fig. 2 Fig. 2 ( A B C D Immunohistochemistry (Fig. 3 Fig. 3 Immunohistochemical stain, × 200. ( A B C D E F G H Pathological diagnosis and prognosis The pathological diagnosis was “(left parotid tissue) myoepithelial tumor with cystic degeneration”. The patient recovered well after surgery and was followed up for 1 year without recurrence. Discussion Epidemiology and morbidity Mpithelioma is a rare type of salivary gland tumor, accounting for less than 1% of all salivary gland tumors, whereas myoepitheliomas as a whole account for approximately 1–2% of salivary gland tumors. Its cystic transformation may be associated with degenerative changes within the tumor (e.g., hemorrhage, necrosis, or mucus accumulation) and is commonly seen in long-standing tumors. Common sites: Mainly in the parotid gland (about 50% of cases), occasionally in other areas of the head and neck such as the parapharyngeal space. Age and sex distribution: The age of onset spans a wide range, with cases reported in the literature ranging from 30 to 80 years of age, with no apparent gender preference [ 2 3 4 Clinical features of myoepithelioma Clinically, the manifestations of this tumor are non-specific, resembling those of most salivary gland tumors, with a prolonged history often spanning several months to years. This similarity makes it challenging to differentiate from pleomorphic adenoma. Typically, these tumors present as unilateral, painless, well-defined, and slowly growing masses, either solitary and circular or nodular. Most are solid, though some may be cystic, and a few cases exhibit potential for malignant transformation. The cut surface is typically grayish-white or grayish-yellow, solid or gelatinous, and occasionally contains hemorrhagic cavities [ 5 6 7 Overview of pathogenesis and pathological features The pathology of myoepithelioma is characterized by myoepithelial differentiation, which is a bi-directional differentiation potential of myoepithelial cells with complex and diverse morphology. 60% to 70% of myoepithelioma are derived from pleomorphic adenoma (PA). It has a characteristic multilobular distribution under low magnification, mostly forming solid, lamellar, and beam-reticulated structures. Necrosis is common in the center of the tumor nodule, and pseudocysts or true cystic degeneration may occur, as well as small squamous epithelial differentiation zones. Meanwhile, tumor infiltration of surrounding normal tissues and destructive growth are usually suggestive of malignant pathology. Myoepithelioma is often composed of one or several cell types, including spindle cells, plasma-like cells, epithelioid cells, and clear cells. Myoepithelioma are classified as clear cell type, spindle cell type, plasma-like cell type, epithelioid cell type, and mixed cell type based on the proportion of cell types that make up the tumor's cellular morphology. The diagnosis of myoepithelioma by pathological cell histomorphology alone is not accurate and often requires a combination of immunohistochemistry [ 8 9 The myxoid regions and hyalinized substances observed under microscopy are associated with the synthesis and secretion of proteoglycans by neoplastic myoepithelial cells. Solid myoepithelioma is more frequently encountered compared to cystic variants. In this case, the tumor is characterized by cystic changes, potentially attributed to the tumor's rich content of mucous and eosinophilic hyalinized material. Immunohistochemical characteristics Given the significant heterogeneity of myoepithelial cells, immunohistochemical staining may exhibit diverse reactions and expressions across different types of myoepithelial cells [ 10 11 Myoepithelioma and cystic changes Myoepithelioma is a rare salivary gland tumor, accounting for about 1% of all salivary gland tumors and most commonly originating from the parotid gland. With the extensive development of immunohistochemical techniques, the diagnosis of myoepithelioma is becoming more and more standardized, and it is considered that myoepithelioma may originate from the reserve cells of the intercalary ducts or from the ductal vesicular unit complex by immunohistochemical and other technical analyses. Cystic metaplastic myoepithelioma is a predominantly solid myoepithelioma with cystic changes secondary to a degenerative process (e.g., hemorrhage, necrosis, or mucin accumulation). It is distinguished from “cystic myoepithelioma,” which implies a primary cystic structure. Cystic degeneration occurs in 5%−15% of myoepitheliomas in terms of incidence, especially in long-standing or larger tumors (> 3 cm). Differential diagnosis Pleomorphic adenomas, alternatively termed salivary gland mixed tumors, represent the most frequent salivary gland tumors and serve as the primary differential diagnosis for myoepithelioma. The key distinction lies in their structural organization. Pleomorphic adenomas primarily consist of glandular epithelium, myoepithelium, mucoid, and chondroid tissues, with a cartilaginous mucoid stroma. Conversely, myoepitheliomas are predominantly composed of myoepithelial cells, featuring a stroma rich in mucous and basement membrane-like substances [ 12 13 Warthin's tumor, also referred to as papillary cystadenoma lymphomatosum, is the second most prevalent benign parotid gland tumor following pleomorphic adenomas [ 14 15 Myoepithelial carcinoma, previously known as malignant myoepithelioma, exhibits tumor cell morphology similar to that of benign myoepithelioma. The primary distinction lies in the invasive or destructive growth pattern of the former, as opposed to the localized, slow-growing nature of the latter, which does not invade surrounding tissues. The Ki-67 index serves as a key diagnostic criterion to distinguish myoepithelial carcinoma from myoepithelioma. Myoepithelial carcinoma typically exhibits a significantly elevated Ki-67 proliferation index, whereas myoepithelioma usually demonstrates a low Ki-67 index. Furthermore, nuclear division rates exceeding 7 per 10 high-power fields and a Ki-67 proliferation index greater than 10% suggest myoepithelial carcinoma [ 16 17 Basal cell adenoma, a relatively uncommon benign salivary gland tumor, is more prevalent in males. The tumor cells form solid, tubular, or membranous structures, with surrounding cells arranged in a palisade pattern [ 18 Acinar cell carcinoma is an epithelial malignancy of the salivary gland, characterized by acinar cell differentiation, evidenced by cytoplasmic prozyme secretory granules. The tumor cells are serous acinar cells containing intracellular or extracellular microvesicles, and histopathological variants include solid, lobular, microcystic, and follicular patterns [ 19 1 Table 1 Differential diagnosis of myoepithelioma Diseases Main identification points Pleomorphic adenomas The basic structure includes glandular epithelium, myoepithelium, mucoid tissue and chondroid tissue Warthin's tumor The tumor has a history of growth and decline, and its basic structure includes glandular epithelium and lymphoid stroma Myoepithelial carcinoma The cell atypia is obvious and the tumor is invasive Basal cell adenoma The basic structure is composed of basal-like cell, and the surrounding cells are arranged in a palisade shape Acinar cell carcinoma The main basic structure is acinar cell. Immunohistochemical analysis: myoepithelial calponin (-), P63 (-) Treatment and prognosis The treatment method of myoepithelioma is the same as that of other benign salivary gland tumors, with radical surgical excision being the preferred approach. Incomplete removal increases the risk of recurrence. To prevent recurrence or malignant transformation, the tumor should be excised along with a margin of normal tissue beyond the tumor capsule. Surrounding tissue should be resected as extensively as possible without compromising function. In parotid gland lesions, careful dissection and preservation of the facial nerve are crucial during partial or total tumor removal. For palatal tumors, normal tissue should be resected 0.5 cm from the tumor margin, excluding the periosteum. Submandibular gland tumors require comprehensive resection of the gland [ 20 21 Conclusions In conclusion, salivary gland myoepithelioma is a rare neoplasm that poses significant diagnostic challenges due to its morphological overlap with both benign lesions (e.g., pleomorphic adenoma) and malignant tumors. Preoperative differentiation requires comprehensive evaluation of clinical history and imaging characteristics (e.g., ultrasound, MRI), with surgical planning tailored to the anatomical site and extent of the lesion. Definitive diagnosis relies on histopathological examination supplemented by immunohistochemical profiling (e.g., SMA, S-100, calponin). This case report of a parotid cystic myoepithelioma underscores the importance of integrating clinical, radiological, and pathological data to enhance diagnostic accuracy. Furthermore, it provides critical insights into the tumor’s clinicopathological spectrum, therapeutic management, and prognostic implications, serving as a valuable reference for optimizing clinical decision-making. Abbreviations CBCT Cone beam computed tomography WHO World Health Organization CT Computed tomography MRI Magnetic resonance imaging FAP Familial adenomatous polyposis MC Myoepithelial carcinoma EMC Epithelial myoepithelial carcinoma CCMC Clear cell myoepithelial carcinoma FISH Immunofluorescence in situ hybridization BM Benign myoepithelioma PA Pleomorphic adenoma CK Cytokeratin Publisher's Note Springer Nature remains neutral with regard to jurisdictional claims in published maps and institutional affiliations. Acknowledgements Not applicable. Authors’ contributions Mengna Wu drafted the manuscript and prepared all the figures and a table.Tonghan Zhang reviewed and revised the manuscript. All authors approved the version submitted for publication. Funding Not applicable. Data availability No datasets were generated or analysed during the current study. Declarations Ethics approval and consent to participate Not applicable. Consent for publication Written informed consent was obtained from the patient for publication of this Case report and any accompanying images. A copy of the written consent is available for review by the Editor of this journal. Competing interests The authors declare no competing interests. References 1. Ochiai S Myoepithelioma arising in the buccal mucosa: a case report and review of the literature Cureus 2024 16 11 e73263 39650863 10.7759/cureus.73263 PMC11625198 Ochiai S, et al. Myoepithelioma arising in the buccal mucosa: a case report and review of the literature. Cureus. 2024;16(11):e73263. 39650863 10.7759/cureus.73263 PMC11625198 2. Yu G Research progress in diagnosis and treatment of salivary gland tumors Beijing Da Xue Xue Bao Yi Xue Ban 2025 57 1 1 6 39856499 10.19723/j.issn.1671-167X.2025.01.001 PMC11759788 Yu G, et al. Research progress in diagnosis and treatment of salivary gland tumors. Beijing Da Xue Xue Bao Yi Xue Ban. 2025;57(1):1–6. 39856499 10.19723/j.issn.1671-167X.2025.01.001 PMC11759788 3. Young J A case of myoepithelial carcinoma displaying biallelic inactivation of the tumour suppressor gene APC in a patient with familial adenomatous polyposis J Clin Pathol 2002 55 3 230 231 10.1136/jcp.55.3.230 11896079 PMC1769611 Young J, et al. A case of myoepithelial carcinoma displaying biallelic inactivation of the tumour suppressor gene APC in a patient with familial adenomatous polyposis. J Clin Pathol. 2002;55(3):230–1. 11896079 10.1136/jcp.55.3.230 PMC1769611 4. Skálová A Clear cell myoepithelial carcinoma of salivary glands showing EWSR1 rearrangement: molecular analysis of 94 salivary gland carcinomas with prominent clear cell component Am J Surg Pathol 2015 39 3 338 348 10.1097/PAS.0000000000000364 25581728 Skálová A, et al. Clear cell myoepithelial carcinoma of salivary glands showing EWSR1 rearrangement: molecular analysis of 94 salivary gland carcinomas with prominent clear cell component. Am J Surg Pathol. 2015;39(3):338–48. 25581728 10.1097/PAS.0000000000000364 5. Weitzel, M, J.E. Cohn, and H. Spector, Myoepithelioma of the Parotid Gland: A Case Report with Review of the Literature and Classic Histopathology. Case Rep Otolaryngol. 2017;2017:p.6036179. 10.1155/2017/6036179 PMC5576410 28900549 6. Wang S Myoepithelioma of the parotid gland: CT imaging findings AJNR Am J Neuroradiol 2008 29 7 1372 1375 10.3174/ajnr.A1109 18467518 PMC8119138 Wang S, et al. Myoepithelioma of the parotid gland: CT imaging findings. AJNR Am J Neuroradiol. 2008;29(7):1372–5. 18467518 10.3174/ajnr.A1109 PMC8119138 7. Yaman H Myoepithelioma of the parotid gland in a child: a case report J Pediatr Surg 2010 45 7 E5 7 10.1016/j.jpedsurg.2010.04.009 20638511 Yaman H, et al. Myoepithelioma of the parotid gland in a child: a case report. J Pediatr Surg. 2010;45(7):E5-7. 20638511 10.1016/j.jpedsurg.2010.04.009 8. Kalra Y A rare presentation of Myoepithelioma of the Parotid Gland manifesting as an infra-auricular swelling Cureus 2024 16 10 e70746 39493007 10.7759/cureus.70746 PMC11530963 Kalra Y, et al. A rare presentation of Myoepithelioma of the Parotid Gland manifesting as an infra-auricular swelling. Cureus. 2024;16(10):e70746. 39493007 10.7759/cureus.70746 PMC11530963 9. Shah AA Mulla AF Mayank M Pathophysiology of myoepithelial cells in salivary glands J Oral Maxillofac Pathol 2016 20 3 480 490 10.4103/0973-029X.190952 27721615 PMC5051298 Shah AA, Mulla AF, Mayank M. Pathophysiology of myoepithelial cells in salivary glands. J Oral Maxillofac Pathol. 2016;20(3):480–90. 27721615 10.4103/0973-029X.190952 PMC5051298 10. Liu DW Zuo JH Observation of myoepithelial cell proliferation in atrophic parotid gland of rats by immunohistochemical double staining J Appl Stomatology 2014 30 03 331 335 Liu DW, Zuo JH, et al. Observation of myoepithelial cell proliferation in atrophic parotid gland of rats by immunohistochemical double staining. J Appl Stomatology. 2014;30(03):331–5. 11. Yang YW Mao QT Sun JD Clinical pathological analysis of 31 cases of salivary gland myoepithelioma [J] Stomatology 2003 02 79 81 Yang YW, Mao QT, Sun JD, et al. Clinical pathological analysis of 31 cases of salivary gland myoepithelioma. Stomatology. 2003;02:79–81. 12. Hellquist H Analysis of the clinical relevance of histological classification of benign epithelial salivary gland tumours Adv Ther 2019 36 8 1950 1974 10.1007/s12325-019-01007-3 31209701 PMC6822986 Hellquist H, et al. Analysis of the clinical relevance of histological classification of benign epithelial salivary gland tumours. Adv Ther. 2019;36(8):1950–74. 31209701 10.1007/s12325-019-01007-3 PMC6822986 13. Ding J MRI and CT imaging characteristics of myoepithelioma of the parotid gland Acta Radiol 2016 57 7 837 843 10.1177/0284185115609364 26508793 Ding J, et al. MRI and CT imaging characteristics of myoepithelioma of the parotid gland. Acta Radiol. 2016;57(7):837–43. 26508793 10.1177/0284185115609364 14. Torous VF Faquin WC The milan system classification of Warthin tumor: a large institutional study of 124 cases highlighting cytologic features that limit definitive interpretation Cancer Cytopathol 2022 130 9 714 725 10.1002/cncy.22588 35617489 Torous VF, Faquin WC. The milan system classification of Warthin tumor: a large institutional study of 124 cases highlighting cytologic features that limit definitive interpretation. Cancer Cytopathol. 2022;130(9):714–25. 35617489 10.1002/cncy.22588 15. Rizkou FE Parotid's intranodal palisaded myofibroblastoma: a very rare tumour Indian J Otolaryngol Head Neck Surg 2023 75 3 2702 2706 10.1007/s12070-023-03771-9 37636792 PMC10447659 Rizkou FE, et al. Parotid’s intranodal palisaded myofibroblastoma: a very rare tumour. Indian J Otolaryngol Head Neck Surg. 2023;75(3):2702–6. 37636792 10.1007/s12070-023-03771-9 PMC10447659 16. Lavareze L Clinicopathological and survival profile of patients with salivary gland myoepithelial carcinoma: a systematic review J Oral Pathol Med 2023 52 2 101 108 10.1111/jop.13395 36504414 Lavareze L, et al. Clinicopathological and survival profile of patients with salivary gland myoepithelial carcinoma: a systematic review. J Oral Pathol Med. 2023;52(2):101–8. 36504414 10.1111/jop.13395 17. Argyris PP Wakely PE Jr. Cytopathology of salivary gland myoepithelial carcinoma: a study of 13 cases and review of the literature J Am Soc Cytopathol 2023 12 6 461 468 10.1016/j.jasc.2023.05.001 37270329 Argyris PP, Wakely PE Jr. Cytopathology of salivary gland myoepithelial carcinoma: a study of 13 cases and review of the literature. J Am Soc Cytopathol. 2023;12(6):461–8. 37270329 10.1016/j.jasc.2023.05.001 18. Terada T Basal cell adenocarcinoma of the parotid gland: comparison with basal cell adenoma for preoperative diagnosis Auris Nasus Larynx 2021 48 2 310 316 10.1016/j.anl.2020.08.024 32950324 Terada T, et al. Basal cell adenocarcinoma of the parotid gland: comparison with basal cell adenoma for preoperative diagnosis. Auris Nasus Larynx. 2021;48(2):310–6. 32950324 10.1016/j.anl.2020.08.024 19. Piana S Dedifferentiated acinic cell carcinoma of the parotid gland with myoepithelial features Arch Pathol Lab Med 2002 126 9 1104 1105 10.5858/2002-126-1104-DACCOT 12204062 Piana S, et al. Dedifferentiated acinic cell carcinoma of the parotid gland with myoepithelial features. Arch Pathol Lab Med. 2002;126(9):1104–5. 12204062 10.5858/2002-126-1104-DACCOT 20. Zhu QT Analysis of clinical diagnosis and treatment of 200 cases of parotid gland masses Med Theory Pract 2015 28 05 649 700 Zhu QT. Analysis of clinical diagnosis and treatment of 200 cases of parotid gland masses. Med Theory Pract. 2015;28(05):649–700. 21. Oh SJ Moon D Spindle cell myoepithelioma of the parotid gland Arch Craniofac Surg 2019 20 5 336 340 10.7181/acfs.2018.02341 31658801 PMC6822074 Oh SJ, Moon D. Spindle cell myoepithelioma of the parotid gland. Arch Craniofac Surg. 2019;20(5):336–40. 31658801 10.7181/acfs.2018.02341 PMC6822074 ",
  "metadata": {
    "Title of this paper": "Spindle cell myoepithelioma of the parotid gland",
    "Journal it was published in:": "BMC Oral Health",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12481880/"
  }
}