{
  "title": "Paper_278",
  "abstract": "pmc Chin J Traumatol Chin J Traumatol 3010 cjt Chinese Journal of Traumatology 1008-1275 Elsevier PMC12489486 PMC12489486.1 12489486 12489486 40274522 10.1016/j.cjtee.2024.10.007 S1008-1275(25)00031-8 1 Original Article Dimethyloxalylglycine improves functional recovery through inhibiting cell apoptosis and enhancing blood-spinal cord barrier repair after spinal cord injury Han Wen 18840843748@163.com a ⁎ Ding Chao-chao a Wei Jie b Dai Dan-Dan a Wang Nan a Ren Jian-Min a Chen Hai-Lin a Xie Ling xieling0612@163.com c ⁎⁎ a b c ⁎ 18840843748@163.com ⁎⁎ xieling0612@163.com 9 2025 22 3 2025 28 5 498168 361 369 26 3 2024 26 9 2024 7 10 2024 22 03 2025 03 10 2025 03 10 2025 © 2025 Published by Elsevier B.V. on behalf of Chinese Medical Association. 2025 https://creativecommons.org/licenses/by-nc-nd/4.0/ This is an open access article under the CC BY-NC-ND license (http://creativecommons.org/licenses/by-nc-nd/4.0/). Purpose The secondary damage of spinal cord injury (SCI) starts from the collapse of the blood spinal cord barrier (BSCB) to chronic and devastating neurological deficits. Thereby, the retention of the integrity and permeability of BSCB is well-recognized as one of the major therapies to promote functional recovery after SCI. Previous studies have demonstrated that activation of hypoxia inducible factor-1α (HIF-1α) provides anti-apoptosis and neuroprotection in SCI. Endogenous HIF-1α, rapidly degraded by prolylhydroxylase, is insufficient for promoting functional recovery. Dimethyloxalylglycine (DMOG), a highly selective inhibitor of prolylhydroxylase, has been reported to have a positive effect on axon regeneration. However, the roles and underlying mechanisms of DMOG in BSCB restoration remain unclear. Herein, we aim to investigate pathological changes of BSCB restoration in rats with SCI treated by DOMG and evaluate the therapeutic effects of DMOG. Methods The work was performed from 2022 to 2023. In this study, Allen's impact model and human umbilical vein endothelial cells were employed to explore the mechanism of DMOG. In the phenotypic validation experiment, the rats were randomly divided into 3 groups: sham group, SCI group, and SCI + DMOG group (10 rats for each). Histological analysis via Nissl staining, Basso-Beattie-Bresnahan scale, and footprint analysis was used to evaluate the functional recovery after SCI. Western blotting, TUNEL assay, and immunofluorescence staining were employed to exhibit levels of tight junction and adhesion junction of BSCB, HIF-1α, cell apoptosis, and endoplasmic reticulum (ER) stress. The one-way ANOVA test was used for statistical analysis. The difference was considered statistically significant at p Results In this study, we observed the expression of HIF-1α reduced in the SCI model. DMOG treatment remarkably augmented HIF-1α level, alleviated endothelial cells apoptosis and disruption of BSCB, and enhanced functional recovery post-SCI. Besides, the administration of DMOG offset the activation of ER stress induced by SCI, but this phenomenon was blocked by tunicamycin (an ER stress activator). Finally, we disclosed that DMOG maintained the integrity and permeability of BSCB by inhibiting ER stress, and inhibition of HIF-1α erased the protection from DMOG. Conclusions Our findings illustrate that the administration of DMOG alleviates the devastation of BSCB and HIF-1α-induced inhibition of ER stress. Keywords Spinal cord injury Dimethyloxalylglycine Hypoxia inducible factor-1α Blood spinal cord barrier Endoplasmic reticulum stress pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement no pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes 1 Introduction It has been reported that spinal cord injury (SCI) causes long-term disabilities for over 27 million patients worldwide. 1 2 , 3 In adult mammals, secondary functional impairment of SCI begins with the disruption of the blood spinal cord barrier (BSCB), leading to loss of integrity and increased permeability. 4 , 5 6 7 , 8 As a special structure in the spinal cord circulatory system, BSCB regulates the molecular exchange between the blood and parenchyma. 6 , 9 10 6 , 11 Hypoxia inducible factors (HIFs) compose HIF-α and HIF-β, with 3 isoforms (HIF-1, HIF-2, and HIF-3). 12 13 14 15 , 16 17 18 19 20 21 22 ER is a crucial subcellular organelle to handle the synthesis, modification, and folding of proteins, which are vital in cellular function and survival activities. 23 24 25 26 27 28 , 29 30 Herein, we assumed that DMOG application may inhibit ER stress by upregulating the expression of HIF-1α to attenuate apoptosis and enhance BSCB restoration after SCI in vivo in vitro 2 Methods 2.1 SCI model and drug administration Adult female Sprague Dawley rats ( n 22 in vitro in vivo in vitro in vivo in vitro in vivo 2.2 Oxygen-glucose deprivation (OGD) model The medium was replaced with glucose-free Dulbecco's Modified Eagle Medium, and the cells were exposed to an anaerobic environment containing 5% CO 2 2 2.3 Tissue collection and preparation All rats sacrificed at specific time points following SCI were anesthetized with 2% pentobarbital sodium (40 mg/kg, intraperitoneal). Spinal cord segments (around 1 cm) from the injury site as the center were dissected. For pathological section staining such as Nissl staining and immunofluorescence staining, the tissue above was immediately fixed by 4% paraformaldehyde for 6 h and post-embedded in paraffin. Slices (5 μM thick, vertically or horizontally) were mounted on slides, and then dried naturally air and stored at room temperature for subsequent staining. For Western blot, segments were stored at −80 °C immediately. 2.4 Western blot Proteins of animals or human umbilical vein endothelial cells (HUVECs) were first quantified with bicinchoninic acid reagents and 80 μg proteins were mixed into a target system. Then, after being separated on 10% (w/v) gels, the system was transferred onto PVDF membrane (Bio-Rad, Hercules, CA, USA), and next, after blocked with 5% (w/v) non-fat milk (Bio-Rad) in Tris-buffered saline mixed with 0.1% Tween-20 for 2 h at room temperature. Then those were incubated overnight at 4 °C with primary antibodies (P120 (1:2000, Abcam), Occludin (1:2000, Cell Signaling Technologies), ZO-1 (1:200 Sigma Aldrich), HIF-1α (1:200, Abcam), ATF6 (1:2000, Proteintech), GRP78 (1:2000, Proteintech), Chop (1:2000, Abcam), Bax (1:2000, Abcam), Bcl 2 2.5 Histology and immunofluorescence assay All the slices (5 μM thick, vertically) were taken from preservation tissue at rostral 5 mm and caudal 5 mm of the spinal cord. The slices for histological analysis were treated by Nissl staining with the manufacturer's instructions. Light microscopy was used to obtain Brightfield images for Nissl staining. For immunofluorescence, after a series of operations such as dewaxing and hydration, slices were treated with primary antibodies against the following proteins overnight at 4 °C: β-catenin (1:500, Abcam), HIF-1α (1:400, Abcam), Chop (1:400, Abcam), and Cleaved caspase3 (1:400, Abcam). Washed with PBST 4 times for 3 min each, the sections were then incubated with AlexaFluor 488 or AlexaFluor 568 donkey antirabbit/rat secondary antibodies for 1 h at 37 °C. After repeating the washing procedure, the slices were incubated with dihydrochloride (4′,6-Diamidino-2-phenylindole dihydrochloride) solution for 7 min, followed by another wash, and then mounted with a coverslip for sealing. A confocal fluorescence microscope (Nikon, Japan) was used to capture all images, and Image J was analyzed. 2.6 TUNEL assay TUNEL staining assay (Beyotime Biotechnology company) was a typical method to measure apoptotic levels. Sections were obtained and were performed at 1 dpi with the instructions. Nikon ECLIPSE Ti microscope (Nikon, Japan) was employed to capture the images. Three rats were measured in each group. TUNEL-positive cells were counted from 5 to 10 randomly selected slices to calculate the average number in each group. 2.7 Locomotion recovery assessment Basso-Beattie-Bresnahan (BBB) locomotion and footprint analysis were 2 main and critical tools for locomotion recovery, which were conducted by independent 4 staff. Rats moved freely in an open experimental field for 5 min. Walking ability was assessed by the BBB scale (at optimal timepoint: 0, 1, 3, 5, 7, 14, 21, and 28 dpi) ranging from 0 (no limb movement or weight support) to 21 (normal walking). The footprint analysis was performed at 14 dpi, staining the animal's posterior limb in red and the fore limb in blue. 2.8 Statistical analysis All data were collected and collated as mean ± standard error of the mean (SEM). Differences between groups in BBB scores were organized with a one-way analysis of variance (ANOVA) followed by Tukey's Multiple comparison test. Statistical analysis of other data was performed using one-way ANOVA. All analyses were conducted using GraphPad Prism 9 for Windows was hired to statistically analyze the data. There is a significant statistical difference when p 3 Results 3.1 DMOG favors functional repair after SCI in rats To explore the effects of DMOG on SCI, rats were randomly dispensed to 3 groups: sham, SCI, or SCI + DMOG groups (DMOG treatment group) ( n Fig. 1 Fig. 1 Fig. 1 Fig. 1 DMOG favors functional repair after SCI in rats ( n ∗ vs p p p # vs # p ## p DMOG: dimethyloxalylglycine; SCI: spinal cord injury; BBB: Basso-Beattie-Bresnahan; VMN: ventral motor neurons; SEM: standard error of the mean. Fig. 1 3.2 DMOG lessens the loss of connecting proteins in the BSCB To identify the role of DMOG in blood-spinal cord barrier disruption, Western blot was used to evaluate the expression levels of TJ (Occludin and ZO-1) and AJ (P120 and β-catenin) proteins after DMOG treatment for SCI. The results demonstrated that compared with the sham group, the levels of those proteins in the spinal cord were strikingly reduced after SCI, which was remarkably blocked by DMOG treatment ( Fig. 2 in vitro in vitro. Fig. 2 Fig. 2 DMOG lessens the loss of connecting proteins in the BSCB ( n p p p p GAPDH: glyceraldehyde-3-phosphate dehydrogenase; SCI: spinal cord injury; DMOG: dimethyloxalylglycine; BSCB: blood spinal cord barrier; AJ: adhesion junction; TJ: tight junction; SEM: standard error of the mean. Fig. 2 3.3 DMOG hinders cell apoptosis induced by SCI Apoptosis runs throughout the entire process of SCI recovery. Endothelial cells are the main cytoskeleton of BSCB, and thus the retainment of the survival of endothelial cells is critical for BSCB integrity. To figure out whether DMOG promoted endothelial cell survival after SCI, TUNEL assay, Western blot, and immunofluorescence staining of proteins linked with apoptosis (Bax, Bcl 2 2 Fig. 3 Fig. 3 in vivo Fig. 2 Fig. 3 DMOG hinders cell apoptosis induced by SCI ( n 2 in vivo p p p p GAPDH: glyceraldehyde-3-phosphate dehydrogenase; SCI: spinal cord injury; DMOG: dimethyloxalylglycine; SCI: spinal cord injury, SEM: standard error of the mean. Fig. 3 3.4 HIF-1α stabilization is the key to DMOG-induced BSCB recovery PHD inhibitors have been reported to have a future in neuroprotection through HIF-dependent mechanisms. Thereby, the level of HIF-1α expression was assessed to explore its role in the anti-SCI effect of DMOG. As shown in Fig. 4 in vivo Fig. 4 Fig. 4 Hif-1α stabilization is the key to DMOG-induced BSCB recovery ( n p p p p GAPDH: glyceraldehyde-3-phosphate dehydrogenase; OGD: oxygen-glucose deprivation; Hif-1α: hypoxia inducible factor-1α; DMOG: dimethyloxalylglycine; BSCB: blood spinal cord barrier, SEM: standard error of the mean. Fig. 4 3.5 DMOG inhibits ER stress through stabilizing HIF-1α expression Emerging evidence has proved that ER stress has a bearing on SCI and plays a pivotal role in maintaining the stability of BSCB and cellular homeostasis. To ensure the effect of DMOG on ER stress induced by SCI, proteins that related to ER stress (ATF6, GRP78, and chop) were first tested. Compared with the control group, the expression of ATF6 and GRP78 remarkably raised, prompting that OGD condition can activate ER stress. In contrast, DMOG administration downregulated the level of those 2 proteins ( Fig. 5 Fig. 5 Fig. 5 DMOG inhibits ER stress through stabilizing Hif-1α expression in vivo n p p p p GAPDH: glyceraldehyde-3-phosphate dehydrogenase; OGD: oxygen-glucose deprivation; DAPI: dihydrochloride (4′,6-Diamidino-2-phenylindole dihydrochloride) solution; TM: tunicamycin; DMOG: dimethyloxalylglycine; ER: endoplasmic reticulum; Hif-1α: hypoxia inducible factor-1α, SEM: standard error of the mean. Fig. 5 4 Discussion SCI contains a series of primary damage events (which are considered irreversible) and secondary damage events (which lead to devastating results in functional dysfunction). 8 31 32 21 33 , 34 2 The function of BSCB mainly depends on ECs and junction complexes. Junction complexes contain TJ and AJ. 35 4 , 36 5 37 38 39 Fig. 1 Fig. 2 Fig. 3 2 ER stress was proven to be involved in cell death in many models of diseases including Alzheimer's disease, 40 41 24 42 43 44 45 46 In summary, our study demonstrates that inhibition of PHD by DMOG maintains the integrity and permeability of BSCB and improves functional recovery after SCI ( Fig. 6 Fig. 6 A schematic diagram to show the potential molecular mechanism that DMOG decreases apoptosis and collapse of BSCB and promotes functional recovery after SCI by Hif-1α stabilization. DMOG: dimethyloxalylglycine; ER: endoplasmic reticulum; BSCB: blood spinal cord barrier; SCI: spinal cord injury; Hif-1α: hypoxia inducible factor-1α. Fig. 6 CRediT authorship contribution statement Wen Han: Chao-chao Ding: Jie Wei: Dan-Dan Dai: Nan Wang: Jian-Min Ren: Hai-Lin Chen: Ling Xie: Ethical statement The care and use of animals were approved by the Laboratory Animal Ethics Committee of Wenzhou Medical University. Funding This work was supported by 10.13039/100007834 Natural Science Foundation of Ningbo Municipality 2021J260 2021J033 2023J165 Declaration of competing interest The authors have no relevant financial or non-financial interests to disclose. References 1 GBD 2016 Neurology Collaborators Global, regional, and national burden of neurological disorders, 1990-2016: a systematic analysis for the Global Burden of Disease Study 2016 Lancet Neurol 18 2019 459 480 10.1016/S1474-4422(18)30499-X 30879893 PMC6459001 2 Abrams G.M. Ganguly K. Management of chronic spinal cord dysfunction Continuum (Minneap Minn) 21 2015 188 200 10.1212/01.CON.0000461092.86865.a4 25651225 PMC4325904 3 Ramer L.M. Ramer M.S. Bradbury E.J. Restoring function after spinal cord injury: towards clinical translation of experimental strategies Lancet Neurol 13 2014 1241 1256 10.1016/S1474-4422(14)70144-9 25453463 4 Jin L.Y. Li J. Wang K.F. Blood-spinal cord barrier in spinal cord injury: a review J Neurotrauma 38 2021 1203 1224 10.1089/neu.2020.7413 33292072 5 Kong G. Xiong W. Li C. Treg cells-derived exosomes promote blood-spinal cord barrier repair and motor function recovery after spinal cord injury by delivering miR-2861 J Nanobiotechnol 21 2023 364 10.1186/s12951-023-02089-6 PMC10552208 37794487 6 Yao Y. Xu J. Yu T. Flufenamic acid inhibits secondary hemorrhage and BSCB disruption after spinal cord injury Theranostics 8 2018 4181 4198 10.7150/thno.25707 30128046 PMC6096396 7 Nakazaki M. Morita T. Lankford K.L. Small extracellular vesicles released by infused mesenchymal stromal cells target M2 macrophages and promote TGF-β upregulation, microvascular stabilization and functional recovery in a rodent model of severe spinal cord injury J Extracell Vesicles 10 2021 e12137 10.1002/jev2.12137 PMC8408371 34478241 8 Lu D. Wu J.P. Yang Q.W. Recent advances in lipid nanovesicles for targeted treatment of spinal cord injury Front Bioeng Biotechnol 11 2023 1261288 10.3389/fbioe.2023.1261288 PMC10486273 37691909 9 Kim H.W. Yong H. Shea G. Blood-spinal cord barrier disruption in degenerative cervical myelopathy Fluids Barriers CNS 20 2023 68 10.1186/s12987-023-00463-y 37743487 PMC10519090 10 Xue C. Ma X. Guan X. Small extracellular vesicles derived from umbilical cord mesenchymal stem cells repair blood-spinal cord barrier disruption after spinal cord injury through down-regulation of Endothelin-1 in rats PeerJ 11 2023 e16311 10.7717/peerj.16311 PMC10624166 37927780 11 Xie Y. Luo Z. Peng W. Inhibition of UTX/KDM6A improves recovery of spinal cord injury by attenuating BSCB permeability and macrophage infiltration through the MLCK/p-MLC pathway J Neuroinflammation 20 2023 259 10.1186/s12974-023-02936-1 37951955 PMC10638785 12 Semenza G.L. Roth P.H. Fang H.M. Transcriptional regulation of genes encoding glycolytic enzymes by hypoxia-inducible factor 1 J Biol Chem 269 1994 23757 23763 8089148 13 Phan A.T. Goldrath A.W. Hypoxia-inducible factors regulate T cell metabolism and function Mol Immunol 68 2015 527 535 10.1016/j.molimm.2015.08.004 26298577 PMC4679538 14 Colgan S.P. Furuta G.T. Taylor C.T. Hypoxia and innate immunity: keeping up with the HIFsters Annu Rev Immunol 38 2020 341 363 10.1146/annurev-immunol-100819-121537 31961750 PMC7924528 15 Konieczny P. Xing Y. Sidhu I. Interleukin-17 governs hypoxic adaptation of injured epithelium Science 377 2022 eabg9302 10.1126/science.abg9302 PMC9753231 35709248 16 Semenza G.L. Targeting HIF-1 for cancer therapy Nat Rev Cancer 3 2003 721 732 10.1038/nrc1187 13130303 17 Chen M.H. Wang Y.H. Sun B.J. HIF-1α activator DMOG inhibits alveolar bone resorption in murine periodontitis by regulating macrophage polarization Int Immunopharmacol 99 2021 107901 10.1016/j.intimp.2021.107901 34273637 18 Yin L. Tang Q. Ke Q. Sequential anti-infection and proangiogenesis of DMOG@ZIF-8/Gelatin-PCL electrospinning dressing for chronic wound healing ACS Appl Mater Interfaces 15 2023 48903 48912 10.1021/acsami.3c09584 37877332 19 Shi J. Yu T. Song K. Dexmedetomidine ameliorates endotoxin-induced acute lung injury in vivo and in vitro by preserving mitochondrial dynamic equilibrium through the HIF-1a/HO-1 signaling pathway Redox Biol 41 2021 101954 10.1016/j.redox.2021.101954 PMC8027777 33774474 20 Gupta A. Song M.H. Youn D.H. Prolyl hydroxylase inhibition protects against murine MC903-induced skin inflammation by downregulating TSLP Front Immunol 15 2024 1330011 10.3389/fimmu.2024.1330011 PMC10940402 38495889 21 Nagamine Y. Tojo K. Yazawa T. Inhibition of prolyl hydroxylase attenuates fas ligand-induced apoptosis and lung injury in mice Am J Respir Cell Mol Biol 55 2016 878 888 10.1165/rcmb.2015-0266OC 27494234 22 Li Y. Han W. Wu Y. Stabilization of hypoxia inducible factor-1α by dimethyloxalylglycine promotes recovery from acute spinal cord injury by inhibiting neural apoptosis and enhancing axon regeneration J Neurotrauma 36 2019 3394 3409 10.1089/neu.2018.6364 31232175 23 Cai Y. Li J. Zhang Z. Zbtb38 is a novel target for spinal cord injury Oncotarget 8 2017 45356 45366 10.18632/oncotarget.17487 28514761 PMC5542192 24 Hetz C. Zhang K.Z. Kaufman R.J. Mechanisms, regulation and functions of the unfolded protein response Nat Rev Mol Cell Biol 21 2020 421 438 10.1038/s41580-020-0250-z 32457508 PMC8867924 25 Han D. Lerner A.G. Vande Walle L. IRE1alpha kinase activation modes control alternate endoribonuclease outputs to determine divergent cell fates Cell 138 2009 562 575 10.1016/j.cell.2009.07.017 19665977 PMC2762408 26 Song B. Scheuner D. Ron D. Chop deletion reduces oxidative stress, improves beta cell function, and promotes cell survival in multiple mouse models of diabetes J Clin Investig 118 2008 3378 3389 10.1172/JCI34587 18776938 PMC2528909 27 Spaan C.N. Smit W.L. van Lidth de Jeude J.F. Expression of UPR effector proteins ATF6 and XBP1 reduce colorectal cancer cell proliferation and stemness by activating PERK signaling Cell Death Dis 10 2019 490 10.1038/s41419-019-1729-4 31227689 PMC6588629 28 Lin Z. Hu Y. Wang Z. Intranasal basic fibroblast growth factor attenuates endoplasmic reticulum stress and brain injury in neonatal hypoxic-ischaemic injury Am J Transl Res 9 2017 275 288 28337259 PMC5340666 29 Zhou K. Zheng Z. Li Y. TFE3, a potential therapeutic target for Spinal Cord Injury via augmenting autophagy flux and alleviating ER stress Theranostics 10 2020 9280 9302 10.7150/thno.46566 32802192 PMC7415792 30 Chen Z.R. Guo H.H. Lu Z.D. Hyperglycemia aggravates spinal cord injury through endoplasmic reticulum stress mediated neuronal apoptosis, gliosis and activation Biomed Pharmacother 112 2019 108672 10.1016/j.biopha.2019.108672 30784940 31 Tran K.A. Partyka P.P. Jin Y. Vascularization of self-assembled peptide scaffolds for spinal cord injury repair Acta Biomater 104 2020 76 84 10.1016/j.actbio.2019.12.033 31904559 32 Ratan R.R. Siddiq A. Aminova L. Small molecule activation of adaptive gene expression: tilorone or its analogs are novel potent activators of hypoxia inducible factor-1 that provide prophylaxis against stroke and spinal cord injury Ann N Y Acad Sci 1147 2008 383 394 10.1196/annals.1427.033 19076458 PMC2921907 33 Aminova L.R. Siddiq A. Ratan R.R. Antioxidants, HIF prolyl hydroxylase inhibitors or short in terfering RNAs to BNIP3 or PUMA, can prevent prodeath effects of the transcriptional activator, HIF-1 alpha, in a mouse hippocampal neuronal line Antioxid Redox Signal 10 2008 1989 1998 10.1089/ars.2008.2039 18774900 PMC2612757 34 Miyake S. Muramatsu R. Hamaguchi M. Prolyl hydroxylase regulates axonal rewiring and motor recovery after traumatic brain injury Cell Death Dis 6 2015 e1638 10.1038/cddis.2015.5 PMC4669805 25675298 35 Bartanusz V. Jezova D. Alajajian B. The blood-spinal cord barrier: morphology and clinical implications Ann Neurol 70 2011 194 206 10.1002/ana.22421 21674586 36 Greene C. Hanley N. Campbell M. Claudin-5: gatekeeper of neurological function Fluids Barriers CNS 16 2019 3 10.1186/s12987-019-0123-z 30691500 PMC6350359 37 Zhou R. Li J. Chen Z. Pathological hemodynamic changes and leukocyte transmigration disrupt the blood-spinal cord barrier after spinal cord injury J Neuroinflammation 20 2023 118 10.1186/s12974-023-02787-w 37210532 PMC10200062 38 Xie Y. Sun Y. Liu Y. Targeted delivery of RGD-CD146(+)CD271(+) human umbilical cord mesenchymal stem cell-derived exosomes promotes blood-spinal cord barrier repair after spinal cord injury ACS Nano 17 2023 18008 18024 10.1021/acsnano.3c04423 37695238 39 Kumar H. Ropper A.E. Lee S.H. Propitious therapeutic modulators to prevent blood-spinal cord barrier disruption in spinal cord injury Mol Neurobiol 54 2017 3578 3590 10.1007/s12035-016-9910-6 27194298 40 Dai Z. Hu T. Wei J. Network-based identification and mechanism exploration of active ingredients against Alzheimer's disease via targeting endoplasmic reticulum stress from traditional Chinese medicine Comput Struct Biotechnol J 23 2024 506 519 10.1016/j.csbj.2023.12.017 38261917 PMC10796977 41 Meng F. Li J. Dong K. Juan-tong-yin potentially impacts endometriosis pathophysiology by enhancing autophagy of endometrial stromal cells via unfolded protein reaction-triggered endoplasmic reticulum stress J Ethnopharmacol 325 2024 117859 10.1016/j.jep.2024.117859 38316218 42 Soni K.K. Hwang J. Ramalingam M. Endoplasmic reticulum stress causing apoptosis in a mouse model of an ischemic spinal cord injury Int J Mol Sci 24 2023 1307 10.3390/ijms24021307 36674822 PMC9862494 43 Zheng B. Ye L. Zhou Y. Epidermal growth factor attenuates blood-spinal cord barrier disruption via PI3K/Akt/Rac 1 pathway after acute spinal cord injury J Cell Mol Med 20 2016 1062 1075 10.1111/jcmm.12761 26769343 PMC4882989 44 Zhang H.Y. Zhang X. Wang Z.G. Exogenous basic fibroblast growth factor inhibits ER stress-induced apoptosis and improves recovery from spinal cord injury CNS Neurosci Ther 19 2013 20 29 10.1111/cns.12013 23082997 PMC6493620 45 Zhou Y. Ye L. Zheng B. Phenylbutyrate prevents disruption of blood-spinal cord barrier by inhibiting endoplasmic reticulum stress after spinal cord injury Am J Transl Res 8 2016 1864 1875 27186310 PMC4859915 46 He Z. Zou S. Yin J. Inhibition of endoplasmic reticulum stress preserves the integrity of blood-spinal cord barrier in diabetic rats subjected to spinal cord injury Sci Rep 7 2017 7661 10.1038/s41598-017-08052-4 28794417 PMC5550423 Acknowledgments The work was completed with cooperation and assistance of students and staff in Cixi Biomedical Research Institute, Wenzhou Medical University, Zhejiang, China. Peer review under responsibility of Chinese Medical Association. ",
  "metadata": {
    "Title of this paper": "Inhibition of endoplasmic reticulum stress preserves the integrity of blood-spinal cord barrier in diabetic rats subjected to spinal cord injury",
    "Journal it was published in:": "Chinese Journal of Traumatology",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12489486/"
  }
}