{
  "title": "Paper_1012",
  "abstract": "pmc Research (Wash D C) Research (Wash D C) 3712 research RESEARCH Research 2639-5274 AAAS Science Partner Journal Program PMC12480759 PMC12480759.1 12480759 12480759 41035818 10.34133/research.0901 0901 1 Research Article Health Science Cancer-Associated Fibroblast-Derived GDF15 Induces Oxidative Stress and Neutrophil Infiltration in Head and Neck Squamous Cell Carcinoma through the PI3K/AKT/STAT3 Axis Cascade Zhao Zhijie  1  † Cai Huabao  2  3  4  † Zhao Zhenzhen  5  † Wang Xiaojing  6  † Nie Wenyang  5 Zhao Fu  7 Chen Yisheng  8 Ding Yanyu  4  9  * https://orcid.org/0000-0002-0524-9951 Luo Zhiwen  10  * Lin Zhiheng  11  * Ding Yantao  12  13  * 1 Department of Plastic and Reconstructive Surgery, Shanghai Ninth People’s Hospital Shanghai Jiao Tong University School of Medicine China 2 Department of Neurosurgery The First Affiliated Hospital of Anhui Medical University China 3 Center for Scientific Research of Anhui Medical University Anhui Medical University China 4 Institute of Health and Medicine Hefei Comprehensive National Science Center China 5 First Clinical Medical College Shandong University of Traditional Chinese Medicine China 6 Department of Rheumatology and Immunology, Tongren Hospital, School of Medicine Shanghai Jiao Tong University China 7 School of Traditional Chinese Medicine Jinan University China 8 Fujian Key Laboratory of Toxicant and Drug Toxicology, Medical College Ningde Normal University China 9 Department of Immunology, School of Basic Medicine Anhui Medical University China 10 Department of Sport Medicine, Huashan Hospital Fudan University China 11 Department of Gynecology, Longhua Hospital Shanghai University of Traditional Chinese Medicine China 12 Department of Dermatology, The First Affiliated Hospital Anhui Medical University China 13 Key Laboratory of Dermatology (Anhui Medical University) Ministry of Education China * yantaoding@ahmu.edu.cn linzhiheng@shutcm.edu.cn zwluo22@m.fudan.edu.cn YancyDing@126.com † These authors contributed equally to this work. 30 9 2025 2025 8 478155 0901 28 5 2025 27 8 2025 28 8 2025 30 9 2025 30 09 2025 01 10 2025 02 10 2025 Copyright © 2025 Zhijie Zhao et al. 2025 Zhijie Zhao et al. https://creativecommons.org/licenses/by/4.0/ Exclusive licensee Science and Technology Review Publishing House. No claim to original U.S. Government Works. Distributed under a Creative Commons Attribution License (CC BY 4.0) Background: Methods: Results: Conclusion: Postdoctoral Science Foundation of Jiangsu Province http://dx.doi.org/10.13039/501100010246 2023M742332 Not Applicable pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement yes pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes Introduction With a 5-year survival rate of less than 50%, head and neck squamous cell carcinoma (HNSCC) ranks as the sixth most common cancer globally and is a serious threat to human health. It is a malignant tumor that develops in the mucosal epithelium of the oral cavity, pharynx, and larynx [ 1 2 3 4 5 6 Fibroblasts within the tumor microenvironment (TME) exhibit marked phenotypic and functional heterogeneity. Several studies have demonstrated that cancer-associated fibroblasts (CAFs) contribute to the growth of tumors via several pathways during various phases of the tumor’s life cycle [ 7 9 Results Identification of a subtype of fibroblasts with active proliferation and enhanced stemness in HNSCC We assembled single-cell sequencing datasets from 32 patients, encompassing 4 distinct stages: normal tissue (N), precancerous leukoplakia (LP), primary carcinoma (C), and lymph node metastases (LN). Figure 1 1 1 1 1 Fig. 1. Visualization of fibroblast subtypes in head and neck squamous cell carcinoma (HNSCC). (A) Overall flowchart of this study. (B) The circular plot visualizes the clustering distribution of cells within HNSCC, with cells colored based on their respective categories. Double circular orbits (from outer to inner) sequentially represent cell types and sample tissue sources and were stained according to the cell categories. Starting from the upper left corner and proceeding clockwise, the 4 illustrations display the nCount-RNA and nFeature-RNA for all cells, along with the scores for the S phase and G2/M phase of the cells. (C) For various cell types, the bubble plot shows the differential expression of the top 5 most important marker genes; the size of the bubbles denotes the percentage of expression, while the color of the bubbles indicates the intensity of expression. (D and E) Various cell types’ distributions across sample tissue sources and cell cycle phases are shown using UMAP plots. (F) The heatmaps show that we calculated the Ro/e values for each cell type in different sample tissue sources and at different cell cycle phases, in order to quantify the distribution deviations of these cells. (G) A total of 13,963 high-quality fibroblasts from HNSCC were clustered into 8 distinct clusters. (H) Bubble plot illustrates how the top 5 marker genes expressed differently in various fibroblast subtypes. (I and J) Bar graph visualization illustrates the proportion of fibroblast subtypes in various sample tissue sources and cell cycle phase. (K and L) UMAP plots and bar graphs display the cell phase G2/M and cell phase S scores of fibroblast subtypes. DEG, differentially expressed genes; GSVA, gene set variation analysis; ST, spatial transcriptome. As one of the most crucial stromal components, fibroblasts play an indispensable role in cancer progression owing to their functional diversity. Based on cluster-specific gene expression profiles, we identified 8 distinct fibroblast subtypes (Fig. 1 + + + + + + + + The sources of the samples and cycle phase distribution of all fibroblasts are illustrated in Fig. S1 1 + + + + + + 1 + S1 2 Fig. 2. The heterogeneous graph of fibroblast subtypes in HNSCC. (A) The UMAP plot illustrates the trajectory and distribution of lineage 2 cell differentiation trajectory fitted through Slingshot across all fibroblasts. The direction of differentiation (from naïve to mature) is represented by arrows. Lineage 2: C2 PCOLCE2 + + + + + + Stemness features are generally associated with enhanced proliferative potential [ 10 S1 + Characterization of the biological properties of C7 PCLAF + To better elucidate the roles of fibroblast subtypes during HNSCC progression, we performed enrichment analysis and differentially expressed genes among the fibroblast subtype (Fig. S1 + Normal fibroblasts may undergo transformation into CAFs through certain pathways, exhibiting increased malignant features and metabolic activity. C7 PCLAF + S1 11 12 13 + To further elucidate the lineage differentiation order of fibroblast subtypes during HNSCC progression, we utilized Slingshot to infer the developmental trajectory of fibroblasts. In line with previous observations, the differentiation trajectory of fibroblasts originated from the C2 and C0 subtypes, primarily derived from normal tissues. The C1 and C7 subtypes derived from tumor tissues were mainly located at the terminal stage of lineage 2 (Fig. 2 S2 2 S2 To further interpret the biological implications of this lineage transformation, we sought to investigate the functional heterogeneity among these fibroblast subtypes. Research indicates that fibroblasts in the TME can be categorized into 6 distinct subtypes based on varying gene expression and functional characteristics [ 14 16 + 2 S2 + + 2 + 2 TGFB1 in tumor cells negatively regulated PCLAF expression in fibroblasts Given their prominent spatial localization and mCAF-like characteristics, we investigated whether C7 PCLAF + S2 + + + + S2 S2 + S2 To explore the expression patterns of TGFB1 and PCLAF in HNSCC, we first analyzed their expression levels in clinical samples. Analyses of samples demonstrated that PCLAF and TGFB1 expressions were much higher in tumor (T) than in adjacent normal (N) tissues (Figs. S3 S4 S3 S3 S3 S4 S5 S5 To determine the clinical value of PCLAF + S6 + + S6 S6 GDF15 induced up-regulation of PCLAF expression through the transcription factor IRF5 To further explore the transcriptional mechanisms underlying PCLAF up-regulation in HNSCC, we first identified interferon regulatory factor 5 (IRF5) as a potential transcription factor for PCLAF using the JASPAR database. To investigate the transcriptional regulation of PCLAF by IRF5, we analyzed the human PCLAF promoter region and identified 3 predicted IRF5 binding sites (TFBS1 to TFBS3) located upstream of the transcription start site (Fig. S7 S7 S7 S7 P70573 S8 Macrophage inhibitory factor-1, also known as growth differentiation factor 15 (GDF15), belongs to the TGF-β superfamily and is linked to the activation of many tumor-promoting pathway [ 17 19 S8 S8 S8 GDF15 interacted with its receptor GFRAL to enhance oxidative stress in tumor cells and mediate the malignant behavior of HNSCC Based on the above results, we further calculated the expression level of GDF15 in HNSCC cells in single-cell data. Initially, we performed InferCNV analysis on epithelial cells in the sample to obtain tumor cells (Fig. S9 S9 S9 3 4 Fig. 3. GDF15 secreted by CAFs promoted oxidative stress and malignancy in HNSCC cells via the GFRAL. (A) Protein expression of GDF15 in FaDu and Cal-27 cells. (B) Relative intracellular reactive oxygen species (ROS) levels in FaDu and Cal-27 cells treated with various concentrations of recombinant human GDF15 protein (rhGDF15) (0, 50, 250, and 500 ng/ml). (C) Representative images of colony formation assays following rhGDF15 treatment in FaDu and Cal-27 cells. (D) Western blot (WB) detection of SOD2, GPX1, and Nrf2 protein levels in response to rhGDF15 treatment. (E) Quantification of ROS levels in FaDu and Cal-27 cells cultured in CAF-conditioned medium (sup.) or cocultured with CAFs (coc.), with or without GDF15 knockdown (sh1 and sh2) in CAFs. (F) WB analysis of SOD2, GPX1, and Nrf2 expression in cells treated as in (E). (G) Transwell assays evaluate cell migration in FaDu and Cal-27 cells under the indicated conditions. (H) WB shows GFRAL expression in FaDu and Cal-27 cells with or without GFRAL knockdown (shR1# and shR2#). (I and J) qRT-PCR analysis of SOD2, GPX1, and Nrf2 mRNA expression in FaDu (I) and Cal-27 (J) cells treated as indicated in (E). (K) WB of antioxidant proteins in FaDu and Cal-27 cells treated with rhGDF15 ± GFRAL knockdown. (L) Colony formation assay under the same conditions as in (K). (M and N) qRT-PCR quantification of oxidative stress marker genes in Cal-27 (M) and FaDu (N) cells after GFRAL knockdown and rhGDF15 stimulation. Data are presented as mean ± SD from 3 independent experiments. **P Fig. 4. GDF15 elevated oxidative stress and promoted secretion of TNF-α, EGF, and IL-6. (A) WB analysis of oxidative stress markers (SOD2, GPX1, and Nrf2) in FaDu and Cal-27 cells cocultured with CAFs or their supernatants, with or without GFRAL knockdown (1# and 2#). (B and C) Tumor volume curves in PDX-1 and CDX-1 models show effects of sodium fluoride (SF)-induced oxidative stress and cisplatin treatment. (D) PDO1 cell viability over time with or without SF treatment. (E) Tumor volume of CDX mice injected with FaDu cells under the indicated conditions. (F) Tumor regression rates were assessed by limiting dilution in PDX-1 mice injected with FaDu cells or GFRAL-knockdown FaDu cells cocultured with CAFs or GDF15-deficient CAFs. (G) In vivo bioluminescent imaging (photonic flux) of tumor progression in PDX-1 mice across 2, 3, and 4 weeks. (H) Experimental schematic of coculture and conditioned medium transfer systems between CAFs and tumor cells. (I) WB shows GDF15 expression in CAF clones with shRNA knockdown. (J) Representative images of colony formation assays with FaDu and Cal-27 cells cultured with CAFs (coc.) or CAF supernatants (sup.), in the presence or absence of GFRAL knockdown. (K) WB analysis of EGF, TNF-α, and IL-6 expression in FaDu and Cal-27 cells following rhGDF15 stimulation. (L and M) qRT-PCR quantification of SOD2, GPX1, and Nrf2 mRNA expression in FaDu and Cal-27 cells under different CAF coculture conditions. (N) Enzyme-linked immunosorbent assay quantification of TNF-α, EGF, and IL-6 protein levels in cell culture supernatants. (O and P) qRT-PCR analysis of TNF-α and EGF mRNA expression in HNSCC cells with or without GDF15 stimulation or CAF coculture. (Q) WB shows that GFRAL knockdown suppressed rhGDF15-induced TNF-α and EGF expression in FaDu and Cal-27 cells. Data represent mean ± SD from 3 independent experiments. *P **P t Recent studies have linked GDF15 to oxidative stress and drug resistance in cancer cells. However, analysis of oxidative-stress-related pathways showed that tumor cells with high GDF15 expression only exhibited a weak oxidative stress advantage (Fig. S9 3 3 To explore the role of GDF15 receptor GDNF family receptor alpha like (GFRAL) in this mechanism, we established and validated a GFRAL knockdown HNSCC cell line (Fig. 3 3 4 GDF15 elevated oxidative stress and increased secretion of TNF-α, EGF, and IL-6, contributing to poor tumor prognosis To evaluate the impact of oxidative stress on tumor progression and therapy resistance in vivo, we employed 3 independent mouse models: patient-derived xenograft (PDX), cell-derived xenograft (CDX), and patient-derived organoid (PDO). In the PDX model, pretreatment with sodium fluoride (SF) to induce oxidative stress increased tumor burden and diminished cisplatin responsiveness (Fig. 4 4 4 4 4 4 A schematic illustration of the CAFs–tumor coculture or supernatant transfer system is shown in Fig. 4 4 4 4 4 4 GDF15 regulated intracellular oxidative stress via the PI3K/AKT/STAT3/TNF-α/p53/CTCF pathway To investigate how GDF15-induced oxidative stress was transcriptionally regulated, we first analyzed the promoter regions of SOD2, GPX1, and Nrf2 and identified multiple predicted binding sites for CTCF (Fig. 5 5 Fig. 5. GDF15 regulated intracellular oxidative stress through the PI3K/AKT/STAT3/TNF-α/p53/CTCF pathway. (A, C, and E) Schematic diagrams of the predicted CTCF binding sites in the promoter regions of SOD2 (A), GPX1 (C), and Nrf2 (E). Three transcription factor binding sites (TFBS1 to TFBS3) are indicated relative to the transcription start site, with sequences for wild-type and mutant sites shown. (B, D, and F) ChIP-qPCR quantification of CTCF enrichment on SOD2 (B), GPX1 (D), and Nrf2 (F) promoters in FaDu and Cal-27 cells following treatment with control, recombinant human TNF-α protein (rhTNF-α), rhGDF15, or rhGDF15+anti-TNF-α. (G) WB analysis of p53 and oxidative-stress-related proteins in FaDu and Cal-27 cells under indicated treatments. (H and I) qRT-PCR quantification of SOD2, GPX1, and Nrf2 mRNA levels in FaDu (H) and Cal-27 (I) cells treated as above. (J) Flow cytometry analysis of intracellular ROS levels in FaDu and Cal-27 cells under the indicated conditions: rhGDF15, CAF supernatant (CAF-sup.), CAF coculture (CAF-coc.), and anti-TNF-α treatment. (K) WB revealed that GDF15 modulated TNF-α, EGF, and IL-6 expression via the PI3K/AKT/STAT3 pathway. (L) Tumor growth images of FaDu and Cal-27 xenografts treated with rhTNF-α or rhTNF-α+si-p53. (M) qRT-PCR analysis of CTCF mRNA expression in FaDu and Cal-27 cells under rhGDF15, rhTNF-α, or rhGDF15+anti-TNF-α conditions. Data are presented as mean ± SD of 3 independent experiments. *P **P t Next, we explored whether p53, a known regulator of both CTCF and oxidative stress, was implicated in this regulatory pathway. Results showed that TNF-α stimulation up-regulated p53, SOD2, GPX1, and Nrf2, while p53 knockdown attenuated these effects (Fig. 5 5 To further examine the upstream cues leading to TNF-α expression and reactive oxygen species (ROS) elevation, we quantified intracellular ROS levels using flow cytometry. Treatment with rhGDF15 or conditioned media from CAFs increased ROS production in both FaDu and Cal-27 cells, while TNF-α neutralization markedly reversed this effect (Fig. 5 5 In vivo experiments confirmed that TNF-α treatment enhanced tumor growth in both FaDu and Cal-27 xenograft models, and this effect was dependent on p53 (Fig. 5 5 S10 5 GDF15 promoted neutrophil recruitment and pro-tumorigenic activation via TNF-α-dependent paracrine signaling Next, we explored the downstream inflammatory consequences of GDF15–TNF-α signaling. To ensure the validity of neutrophil-based functional assays, we first examined neutrophil viability ex vivo. Annexin V/propidium iodide staining showed that freshly isolated neutrophils remained largely viable (>50%) up to 24 h in culture (Fig. S10 S10 S10 S10 S10 S10 S10 To further evaluate how GDF15 affects neutrophil function, we treated neutrophils with conditioned tumor cell supernatants. We found that treatment with tumor cell supernatants conditioned with rhGDF15 or CAF-conditioned medium reduced neutrophil secretion of sTRAIL and MCP1, which are typically associated with neutrophil-mediated antitumor immunity. Notably, treatment with anti-TNF-α antibody restored the secretion of both factors (Fig. S10 S10 In vivo bioluminescence imaging showed that rhGDF15 stimulation increased tumor burden in FaDu xenografts coinjected with mesenchymal stem cells (MSCs), and similar results were observed in GDF15 knockout animals (Fig. S10 S10 Irinotecan and risperidone were regulators of GDF15–GFRAL signaling To investigate the molecular dynamics properties of GDF15–GFRAL, we utilized docking energy maps obtained for Food and Drug Administration-approved small-molecule drugs (Fig. 6 6 6 6 6 6 6 Fig. 6. Molecular dynamics simulation of GDF15–GFRAL. (A) Food and Drug Administration drug docking energy map. (B) Root mean square deviation variations of GDF15–GFRAL within GDF15, GFRAL, GDF15–GFRAL–SM-1, and GDF15–GFRAL–SM-2 systems (left). Root mean square deviation fluctuations of ligands relative to the protein in GDF15–GFRAL–SM-1 and GDF15–GFRAL–SM-2 systems (right). (C and D) Temporal changes in radius of gyration (Rg) and root mean square fluctuation (RMSF) for GDF15–GFRAL, GDF15–GFRAL–SM-1, and GDF15–GFRAL–SM-2. (E) Free energy landscapes (FELs) of GDF15–GFRAL, GDF15–GFRAL–SM-1, and GDF15–GFRAL–SM-2. The color gradient from blue to red indicated increasing free energy; densely clustered blue points represent the lowest-energy states, corresponding to the most stable protein conformations. (F) Dynamic cross-correlation matrices of GDF15–GFRAL, GDF15–GFRAL–SM-1, and GDF15–GFRAL–SM-2. Lighter colors denote stronger negative correlations, whereas darker colors indicate stronger positive correlations. (G) Solvent-accessible surface area (SASA) analyses for GDF15–GFRAL, GDF15–GFRAL–1261SM-1, and GDF15–GFRAL–SM-2. Upon protein–protein interaction, amino acid residues at the interface became closer, reducing solvent exposure; thus, a smaller SASA indicated tighter binding. (H) Binding interface between GDF15 and GFRAL with interaction regions highlighted in red. (I) Electrostatic potential maps of GDF15–GFRAL, GDF15–GFRAL–SM-1, and GDF15–GFRAL–SM-2 complexes. (J) Binding conformations of SM-1 and SM-2 within the GDF15–GFRAL complex. (K) Interaction force distribution maps of SM-1 and SM-2 with GDF15–GFRAL. (L) Structural evolution of GDF15–GFRAL, GDF15–GFRAL–SM-1, and GDF15–GFRAL–SM-2 proteins throughout the simulation. The solvent-accessible surface area plot (Fig. 6 6 6 6 6 6 SM-2 inhibited the malignant behavior of tumor cells To functionally dissect pharmacological modulators of the GDF15 axis, we tested 2 small molecules in cocultured FaDu and Cal-27 HNSCC cells. SM-1 treatment significantly increased GDF15 protein levels (Fig. S11 S11 S11 S11 S11 In contrast, SM-2 treatment down-regulated GDF15 expression in cocultured tumor cells (Fig. S11 S11 S11 S11 S11 These findings identify SM-1 as a GDF15 activator that exacerbates oxidative stress and malignant behaviors, and SM-2 as a GDF15 suppressor with therapeutic potential to mitigate tumor progression. Discussion Even though breakthroughs in immune checkpoints have markedly improved the survival rate of HNSCC patients, more patients are unable to benefit from current treatments due to poor risk management and limited personalized treatment strategies [ 20 21 We identified, for the first time, a subtype of fibroblasts in HNSCC characterized by high expression of PCLAF. As a classic proliferating cell nuclear antigen clamp-associated factor, previous studies have linked PCLAF to malignant proliferation in tumor tissues [ 21 22 23 + 24 25 Interestingly, our studies revealed that a subtype of fibroblasts with high PCLAF expression tended to display stromal fibroblastic features. Previous studies have found that CAFs expressing high levels of PCLAF can enhance the synthesis of collagen and fibronectin, extracellular matrix components, contributing to a supportive niche for tumor cells [ 26 27 It is worth mentioning that we observed that TGFB1 treatment could inhibit PCLAF expression in tumor cells. This may be related to the fact that TGFB1 induces growth inhibitory responses through suppressor of mothers against decapentaplegic (SMAD)-dependent and nonclassical signaling pathways, interfering with the expression of cell cycle regulatory factors including PCLAF [ 28 29 As a key marker of oxidative stress, GDF15 possesses independent prognostic value in cancer and cardiovascular and aging-related diseases [ 18 30 31 32 34 The activation of the classical inflammatory pathway PI3K/AKT/STAT3 establishes a foundation for the excessive secretion of pro-inflammatory factors. A patient’s tumor burden eventually rises as a result of prolonged chronic inflammation, which causes an imbalance in antioxidant levels and an excess of oxygen species that are reactive in nature. This indicates that the overactivation of oxidative stress in tumor cells is closely linked to a persistent inflammatory imbalance. One of the innate immune system’s essential components, the role of neutrophils in malignant tumors has garnered considerable attention in recent years [ 35 36 37 38 Finally, we report for the first time the dual regulatory roles of 2 small-molecule compounds, SM-1 and SM-2, in modulating the GDF15–GFRAL signaling pathway. Specifically, SM-1 enhances the stability of the GDF15–GFRAL complex, thereby activating a GDF15-mediated, tumor-promoting oxidative stress response. This compound may serve as a valuable chemical probe for investigating the physiological functions of GDF15. In contrast, SM-2 functions as a novel small-molecule inhibitor that disrupts GDF15–GFRAL interactions at both structural and functional levels. By remodeling the interfacial electrostatic landscape and altering conformational dynamics, SM-2 attenuates CAF-mediated paracrine signaling and the associated pro-tumorigenic oxidative stress. These properties position SM-2 as a promising lead compound for therapeutic targeting of GDF15-driven malignancies. Further studies are warranted to assess its in vivo efficacy and pharmacokinetics, as well as to pursue structure-based optimization to enhance its potency and specificity. Conclusion This work clarifies GDF15’s critical function in fibroblast–tumor cell interactions in 3 key ways: First, GDF15 promotes the growth and invasion of HNSCC cells by up-regulating PCLAF expression via IRF5. Second, GDF15 binds to its receptor GFRAL and activates a chronic inflammatory response via the PI3K/AKT/STAT3 pathway, which induces an imbalance in oxidative stress, resulting in increased tumor burden and drug resistance. Third, GDF15 modulates the ERK1/2 pathway by regulating TNF-α, leading to enhanced neutrophil infiltration and the onset of lung metastasis. Finally, the small-molecule compound SM-2 inhibits the malignant behavior of tumor cells by blocking the binding of GDF15–GFRAL. These findings offer a novel perspective for a more profound understanding of the molecular mechanisms underlying HNSCC and establish a foundation for potential therapeutic strategies. They underscore the clinical applicability of interventions targeting GDF15 and its downstream signaling pathways in the treatment of HNSCC. Materials and Methods Sources and processing of single-cell data The single-cell RNA sequencing (scRNA-seq) data of HNSCC were collected from Gene Expression Omnibus database ( https://www.ncbi.nlm.nih.gov/geo/ GSE181919 39 40 41 AUCell analysis We used the scgmt (v0.0.3, https://github.com/ZhaoLabs-SJTU/scgmt Intercellular communication Using the CellChat R package (v1.6.1) [ 42 Spatial transcriptomic data analysis The spatial transcriptomics dataset was obtained from the public repository of 10x Genomics ( https://www.10xgenomics.com/resources/datasets/human-melanoma-if-stained-ffpe-2-standard To infer the spatial distribution of different cell populations within tissue sections, we employed the robust cell type decomposition method, using an integrated scRNA-seq reference dataset. Additionally, we conducted a comprehensive analysis of the spatial expression patterns of key genes and signaling pathways to construct a functional landscape of the tissue microenvironment [ 43 Primary fibroblasts In the same patient, CAFs were obtained from fresh human tissues, while NFs were isolated from the noncancerous area at least 5 cm from the outer tumor edge. Within 30 min after excision, tissues from HNSCC and matched normal tissues were extracted. Fresh tissues were immediately preserved in Dulbecco’s modification of Eagle’s medium supplemented with 10% fetal bovine serum and antibiotics before being sent on ice to the laboratory. The MSCs (bone marrow MSCs) were kindly supplied by Professor Dai Hanren of Anhui Medical University’s School of Pharmacy. Flow cytometry analysis The surface expression of ROS, CD154, and CD95 by HNSCC cells and neutrophils treated with the appropriate conditions was evaluated using flow cytometry analysis. The other methods can be found in the Materials and Methods section of the Supplementary Materials. Ethical Approval This study was approved by the Ethical Committee of the First Affiliated Hospital of Anhui Medical University (Ethics Approval No. PJ2023-12-45). Acknowledgments We would like to thank Figdraw for its contribution to this article. Image ID: TWUSS54055. Funding: Author contributions: Competing interests: Data Availability The GEO and TCGA repositories make the single-cell sequencing datasets created and/or examined during this investigation openly accessible. The primary paper and the Supplementary Materials contain all of the unique contributions made throughout this investigation. The associated authors can be contacted with questions about the original data. Supplementary Materials Supplementary 1 Materials and Methods Figs. S1 to S11 Table S1 References 1. Leemans CR Braakhuis BJ Brakenhoff RH The molecular biology of head and neck cancer Nat Rev Cancer 2011 11 1 9 22 21160525 10.1038/nrc2982 2. Fan Y Zhou Y Lu M Si H Li L Tang B Responsive dual-targeting exosome as a drug carrier for combination cancer immunotherapy Research 2021 2021 2021 9862876 34541546 10.34133/2021/9862876 PMC8426567 3. Guo Y Zhang X Wang SZ Feng HH Wu SY Wu FG Metal-phenolic network-facilitated “foe-to-friend” conversion of melittin for cancer immunotherapy with boosted abscopal effect Research 2023 8 6 52 10.34133/research.0052 PMC10013787 36930774 4. Yang Y Ma B Han L Xu W du X Wei W Liao T Ji Q Qu N Wang Y Integrated single-cell and bulk RNA sequencing analyses reveal a prognostic signature of cancer-associated fibroblasts in head and neck squamous cell carcinoma Front Genet 2022 13 1028469 36568368 10.3389/fgene.2022.1028469 PMC9775281 5. Saleh K Eid R Haddad FG Khalife-Saleh N Kourie HR New developments in the management of head and neck cancer—Impact of pembrolizumab Ther Clin Risk Manag 2018 2018 14 295 303 10.2147/TCRM.S125059 PMC5822846 29497306 6. Thorsson V Gibbs DL Brown SD Wolf D Bortone DS Ou Yang TH Porta-Pardo E Gao GF Plaisier CL Eddy JA et al. The immune landscape of cancer Immunity 2018 48 4 812 830 29628290 10.1016/j.immuni.2018.03.023 PMC5982584 7. Fiori ME Di Franco S Villanova L Bianca P Stassi G De Maria R Cancer-associated fibroblasts as abettors of tumor progression at the crossroads of EMT and therapy resistance Mol Cancer 2019 18 1 70 30927908 10.1186/s12943-019-0994-2 PMC6441236 8. Hinshaw DC Shevde LA The tumor microenvironment innately modulates cancer progression Cancer Res 2019 79 18 4557 4566 31350295 10.1158/0008-5472.CAN-18-3962 PMC6744958 9. Joshi RS Kanugula SS Sudhir S Pereira MP Jain S Aghi MK The role of cancer-associated fibroblasts in tumor progression Cancer 2021 13 6 1399 10.3390/cancers13061399 PMC8003545 33808627 10. Lytle NK Barber AG Reya T Stem cell fate in cancer growth, progression and therapy resistance Nat Rev Cancer 2018 18 11 669 680 30228301 10.1038/s41568-018-0056-x PMC8388042 11. Tufail M Jiang CH Li N Altered metabolism in cancer: Insights into energy pathways and therapeutic targets Mol Cancer 2024 23 1 203 39294640 10.1186/s12943-024-02119-3 PMC11409553 12. Zou S Qin B Yang Z Wang W Zhang J Zhang Y Meng M Feng J Xie Y Fang L et al. Csn6 mediates nucleotide metabolism to promote tumor development and chemoresistance in colorectal cancer Cancer Res 2023 83 3 414 427 36512632 10.1158/0008-5472.CAN-22-2145 13. Jiang X Ma Y Wang T Zhou H Wang K Shi W Qin L Guan J Li L Long B et al. Targeting UBE2T potentiates gemcitabine efficacy in pancreatic cancer by regulating pyrimidine metabolism and replication stress Gastroenterology 2023 164 7 1232 1247 36842710 10.1053/j.gastro.2023.02.025 14. Zhang M Yang H Wan L Wang Z Wang H Ge C Liu Y Hao Y Zhang D Shi G et al. Single-cell transcriptomic architecture and intercellular crosstalk of human intrahepatic cholangiocarcinoma J Hepatol 2020 73 5 1118 1130 32505533 10.1016/j.jhep.2020.05.039 15. Lavie D Ben-Shmuel A Erez N Scherz-Shouval R Cancer-associated fibroblasts in the single-cell era Nat Cancer 2022 3 7 793 807 35883004 10.1038/s43018-022-00411-z PMC7613625 16. Obradovic A Graves D Korrer M Wang Y Roy S Naveed A Xu Y Luginbuhl A Curry J Gibson M et al. Immunostimulatory cancer-associated fibroblast subpopulations can predict immunotherapy response in head and neck cancer Clin Cancer Res 2022 28 10 2094 2109 35262677 10.1158/1078-0432.CCR-21-3570 PMC9161438 17. Li S Ma YM Zheng PS Zhang P GDF15 promotes the proliferation of cervical cancer cells by phosphorylating AKT1 and Erk1/2 through the receptor ErbB2 J Exp Clin Cancer Res 2018 37 1 80 29636108 10.1186/s13046-018-0744-0 PMC5894198 18. Breit SN Brown DA Tsai VW The GDF15-GFRAL pathway in health and metabolic disease: Friend or foe? Annu Rev Physiol 2021 83 127 151 33228454 10.1146/annurev-physiol-022020-045449 19. Balsano R Kruize Z Lunardi M Comandatore A Barone M Cavazzoni A Re Cecconi AD Morelli L Wilmink H Tiseo M et al. Transforming growth factor-beta signaling in cancer-induced cachexia: From molecular pathways to the clinics Cells 2022 11 17 2671 36078078 10.3390/cells11172671 PMC9454487 20. Ge J Meng Y Guo J Chen P Wang J Shi L Wang D Qu H Wu P Fan C et al. Human papillomavirus-encoded circular RNA circE7 promotes immune evasion in head and neck squamous cell carcinoma Nat Commun 2024 15 1 8609 39366979 10.1038/s41467-024-52981-4 PMC11452643 21. Kim MJ Cervantes C Jung YS Zhang X Zhang J Lee SH Jun S Litovchick L Wang W Chen J et al. PAF remodels the DREAM complex to bypass cell quiescence and promote lung tumorigenesis Mol Cell 2021 81 8 1698 1714 33626321 10.1016/j.molcel.2021.02.001 PMC8052288 22. Emanuele MJ Ciccia A Elia AE Elledge SJ Proliferating cell nuclear antigen (PCNA)-associated KIAA0101/PAF15 protein is a cell cycle-regulated anaphase-promoting complex/cyclosome substrate Proc Natl Acad Sci USA 2011 108 24 9845 9850 21628590 10.1073/pnas.1106136108 PMC3116415 23. Povlsen LK Beli P Wagner SA Poulsen SL Sylvestersen KB Poulsen JW Nielsen ML Bekker-Jensen S Mailand N Choudhary C Systems-wide analysis of ubiquitylation dynamics reveals a key role for PAF15 ubiquitylation in DNA-damage bypass Nat Cell Biol 2012 14 10 1089 1098 23000965 10.1038/ncb2579 24. Li M Mu XD Song JR Zhai PT Cheng Y le Y Li ZB PAF enhances cancer stem cell properties via β-catenin signaling in hepatocellular carcinoma Cell Cycle 2021 20 10 1010 1020 33970778 10.1080/15384101.2021.1919826 PMC8172152 25. Kim MJ Xia B Suh HN Lee SH Jun S Lien EM Zhang J Chen K Park JI PAF-Myc-controlled cell stemness is required for intestinal regeneration and tumorigenesis Dev Cell 2018 44 5 582 596 29533773 10.1016/j.devcel.2018.02.010 PMC5854208 26. Kalluri R The biology and function of fibroblasts in cancer Nat Rev Cancer 2016 16 9 582 598 27550820 10.1038/nrc.2016.73 27. Imanaka-Yoshida K. Extracellular matrix remodeling in vascular development and disease. In: Nakanishi T, Markwald R, Baldwin H, Keller B, Srivastava D, Yamagishi H, editors. Etiology and morphogenesis of congenital heart disease 29787131 28. Hryciw A Jun YC Brongersma ML Plasmon-enhanced emission from optically-doped MOS light sources Opt Express 2009 17 1 185 19129887 10.1364/oe.17.000185 29. González JA Amich F Postigo-Mota S Vallejo JR Therapeutic and prophylactic uses of invertebrates in contemporary Spanish ethnoveterinary medicine J Ethnobiol Ethnomed 2016 12 1 36 27595672 10.1186/s13002-016-0111-1 PMC5011348 30. Tang H Inoki K Brooks SV Okazawa H Lee M Wang J Kim M Kennedy CL Macpherson PCD Ji X et al. mTORC1 underlies age-related muscle fiber damage and loss by inducing oxidative stress and catabolism Aging Cell 2019 18 3 Article e12943 30924297 10.1111/acel.12943 PMC6516169 31. Sharma A Stevens SR Lucas J Fiuzat M Adams KF Whellan DJ Donahue MP Kitzman DW Piña IL Zannad F et al. Utility of growth differentiation factor-15, a marker of oxidative stress and inflammation, in chronic heart failure: Insights from the HF-ACTION study JACC Heart Fail 2017 5 10 724 734 28958347 10.1016/j.jchf.2017.07.013 PMC8023398 32. Kwakkel G Kollen B Twisk J Impact of time on improvement of outcome after stroke Stroke 2006 37 9 2348 2353 16931787 10.1161/01.STR.0000238594.91938.1e 33. Bona ACD Chitolina RF Fermino ML de Castro Poncio L Weiss A Lima JBP Paldi N Bernardes ES Henen J Maori E Larval application of sodium channel homologous dsRNA restores pyrethroid insecticide susceptibility in a resistant adult mosquito population Parasit Vectors 2016 9 1 397 27416771 10.1186/s13071-016-1634-y PMC4946210 34. Chen Y Orlicky DJ Matsumoto A Singh S Thompson DC Vasiliou V Aldehyde dehydrogenase 1B1 (ALDH1B1) is a potential biomarker for human colon cancer Biochem Biophys Res Commun 2011 405 2 173 179 21216231 10.1016/j.bbrc.2011.01.002 PMC3112362 35. Wu Y Ma J Yang X Nan F Zhang T Ji S Rao D Feng H Gao K Gu X et al. Neutrophil profiling illuminates anti-tumor antigen-presenting potency Cell 2024 187 6 1422 1439 38447573 10.1016/j.cell.2024.02.005 36. Hedrick CC Malanchi I Neutrophils in cancer: Heterogeneous and multifaceted Nat Rev Immunol 2022 22 3 173 187 34230649 10.1038/s41577-021-00571-6 37. Sobczak M Kocik E Redowicz MJ A novel Amoeba proteus 120 kDa actin-binding protein with only 1 filamin repeat and a coiled-coil region Biochem Cell Biol 2007 85 22 31 17464342 10.1139/o06-177 38. Pfister C Dawczynski H Schingale F Selenium deficiency in lymphedema and lipedema—A retrospective cross-sectional study from a specialized clinic Nutrients 2020 12 5 1211 32344864 10.3390/nu12051211 PMC7281982 39. Yu X Xie L Ge J Li H Zhong S Liu X Integrating single-cell RNA-seq and spatial transcriptomics reveals MDK-NCL dependent immunosuppressive environment in endometrial carcinoma Front Immunol 2023 2023 14 1145300 10.3389/fimmu.2023.1145300 PMC10110842 37081869 40. Hao Y Hao S Andersen-Nissen E Mauck WR Zheng S Butler A Lee MJ Wilk AJ Darby C Zager M et al. Integrated analysis of multimodal single-cell data Cell 2021 184 13 3573 3587 34062119 10.1016/j.cell.2021.04.048 PMC8238499 41. Zhao Z Ding Y Tran LJ Chai G Lin L Innovative breakthroughs facilitated by single-cell multi-omics: Manipulating natural killer cell functionality correlates with a novel subcategory of melanoma cells Front Immunol 2023 2023 14 1196892 10.3389/fimmu.2023.1196892 PMC10332463 37435067 42. Jin S Guerrero-Juarez CF Zhang L Chang I Ramos R Kuan CH Myung P Plikus MV Nie Q Inference and analysis of cell-cell communication using CellChat Nat Commun 2021 12 1 1088 33597522 10.1038/s41467-021-21246-9 PMC7889871 43. Cable DM Murray E Zou LS Goeva A Macosko EZ Chen F Irizarry RA Robust decomposition of cell type mixtures in spatial transcriptomics Nat Biotechnol 2022 40 4 517 526 33603203 10.1038/s41587-021-00830-w PMC8606190 ",
  "metadata": {
    "Title of this paper": "Robust decomposition of cell type mixtures in spatial transcriptomics",
    "Journal it was published in:": "Research",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12480759/"
  }
}