{
  "title": "Paper_554",
  "abstract": "pmc J Community Health J Community Health 365 springeropen Journal of Community Health 0094-5145 1573-3610 pmc-is-collection-domain yes pmc-collection-title Springer PMC12474630 PMC12474630.1 12474630 12474630 40451989 10.1007/s10900-025-01482-6 1482 1 Original Paper Community-level Social Vulnerability and Cervical Cancer Mortality Among Young and Old Adults in the State of Alabama Patel Pranali G. 1 Chowdhury Sabrina 1 Wiener Howard W. 1 George Justin T. 2 Abdalla Ehsan 3 Ye Yuanfan 4 Boitano Teresa K. L. 4 Sudenga Staci L. 5 Oates Gabriela R. 6 http://orcid.org/0000-0002-7002-357X Shrestha Sadeep sshrestha@uab.edu 1 7 1 https://ror.org/008s83205 grid.265892.2 0000000106344187 Department of Epidemiology, School of Public Health, University of Alabama at Birmingham, 2 https://ror.org/00j0z5m32 grid.236631.3 0000 0004 0435 2150 Alabama Department of Public Health, 3 https://ror.org/0137n4m74 grid.265253.5 0000 0001 0707 9354 Department of Graduate Public Health, Tuskegee University, 4 https://ror.org/008s83205 grid.265892.2 0000 0001 0634 4187 Department of Obstetrics and Gynecology, Heersink School of Medicine, University of Alabama at Birmingham, 5 https://ror.org/05dq2gs74 grid.412807.8 0000 0004 1936 9916 Division of Epidemiology, Vanderbilt University Medical Center, 6 https://ror.org/008s83205 grid.265892.2 0000 0001 0634 4187 Department of Medicine, Heersink School of Medicine, University of Alabama at Birmingham, 7 1 6 2025 2025 50 5 497685 985 992 14 5 2025 01 06 2025 28 09 2025 28 09 2025 © The Author(s) 2025 2025 https://creativecommons.org/licenses/by/4.0/ Open Access http://creativecommons.org/licenses/by/4.0/ In addition to individual factors, differences in community-level factors impact mortality rates of cervical cancer (CC), especially in the Southeast United States, where CC one-year mortality is significantly higher than national average. This study investigated the association between community-level social vulnerability measured using the Centers for Disease Control and Prevention’s Social Vulnerability Index (SVI) and overall and one-year CC mortality in Alabama. Retrospective cohort study using Alabama State Cancer Registry data from 2012 to 2021. Outcome of interest was mortality due to CC. Residential addresses were geocoded to determine SVI scores categorized into quartiles. Cox proportional hazards model was used to assess associations between SVI quartiles and overall and one-year CC mortality adjusting for age at diagnosis, race, marital status, and insurance status. Further, CC mortality in younger adults (≤50 years) was compared with older adults (> 50 years). A total of 1,325 women with CC were included in the study. The median age at diagnosis was 49 years (IQR: 39–62) and 69.73% were White. Median follow-up time was 9 months (IQR: 5–17). Among older adults, we observed statistically significant association between higher SVI quartiles and overall mortality (Q4: aHR 1.86; 95% CI 1.15, 3.01; p p p Keywords Cervical cancer HPV Mortality Socioeconomic Community-level Social Vulnerability http://dx.doi.org/10.13039/100008333 University of Alabama at Birmingham Quetelet Endowed Professorship Research Fund Shrestha Sadeep pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement no pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes issue-copyright-statement © Springer Science+Business Media, LLC, part of Springer Nature 2025 Introduction Cervical cancer remains a significant public health issue and is the fourth cause of cancer morbidity and mortality among women worldwide [ 16 5 23 4 27 27 3 Community-level factors, such as neighborhood social, economic, and living conditions, contribute to outcomes in cervical cancer. One measure of such community conditions is the Social Vulnerability Index (SVI) developed by the Centers for Disease Control and Prevention (CDC) [ 28 26 15 17 18 6 26 Given the higher burden of cervical cancer in Alabama, a comprehensive understanding of the role of community environments is crucial. To address this gap, we determined the one-year and overall survival of cervical cancer patients and the independent effect of SVI on survival rates utilizing data from the Alabama Statewide Cancer Registry (ASCR). In addition, we explored the association between SVI and cervical cancer mortality among younger and older adult cancer patients. Methods Study Design and Setting We conducted a retrospective cohort study using ASCR data from 2012 to 2021. The ASCR is a comprehensive, population-based cancer registry established in 1995 by the Alabama Department of Public Health [ 2 Exposure Our primary exposure variable was the 2010 SVI, a composite measure calculated from 14 variables collected annually by the American Community Survey and aggregated to Census tracts using 5-year estimates. The index provides an overall vulnerability score and four thematic subscores of a community’s (1) socioeconomic status, (2) household composition and disability, (3) minority status and language, and (4) housing type and transportation [ 28 Outcome Our primary outcome of interest was cervical cancer mortality. Individuals who were alive or lost to follow-up at last contact were censored. This information was based on vital status data obtained from the ASCR, which includes comprehensive data from medical records, death certificates, reports from healthcare providers, and cancer registry entries [ 13 Covariates Covariates were examined based on their relevance to cervical cancer outcomes in the literature and their potential to confound the relationship between area-level social vulnerability and cervical cancer mortality. Known confounders, age at diagnosis (in years as continuous variable), self-reported race (Black/White), type of insurance (Insured/Private Insurance/Medicare/Medicaid), and marital status (Single/Married/Divorced) were adjusted in all analyses [ 20 32 Statistical Analysis We used descriptive statistics to compare participant characteristics overall and by SVI quartiles. We reported frequency and percentages for categorical variables and median and interquartile range (IQR) for continuous variables. We used Cox proportional hazards models to estimate hazard ratios (HR) and 95% confidence intervals (CI) to assess the association between overall SVI (quartiles) and cervical cancer mortality. Cox regression models were adjusted for age at diagnosis (as continuous), race, marital status, and insurance type. The proportional hazards assumption was tested and confirmed for all the covariates. Since our data showed a higher proportion of cervical cancer mortality in the first year, we specifically assessed the association between overall SVI and one-year mortality. We performed a stratified analysis to examine whether the association between overall SVI and cervical cancer mortality varied among older (> 50 years) and younger adults (≤50 years), as defined by the National Cancer Institute (NCI) [ 23 p Results A total of 1,325 women with cervical cancer were included in the study. The median age at diagnosis was 49 years (IQR: 39–62 years). The majority ( n 1  Table 1 Baseline characteristics of participants, overall and by Social Vulnerability Index (SVI) quartiles Characteristics OverallN (%) # Social Vulnerability Index (SVI) Quartiles* Q1N (%) # Q2N (%) # Q3N (%) # Q4N (%) # Age at cancer diagnosis (in years), median (IQR) 49 (39–62) 47 (39–61) 49 (40–62) 51 (39–64) 50 (40–61)  Race White 903 (69.73) 277 (86.83) 258 (78.42) 233 (71.25) 135 (42.19) Black 392 (30.27) 42 (13.17) 71 (21.58) 94 (28.75) 185 (57.81)  Insurance Not insured 124 (9.36) 25 (7.55) 30 (9.06) 32 (9.67) 37 (11.14) Private insurance 484 (36.53) 168 (50.76) 130 (39.27) 107 (32.33) 79 (23.80) Medicaid 381 (28.75) 61 (18.43) 95 (28.70) 106 (32.02) 119 (35.84) Medicare 336 (25.36) 77 (23.26) 76 (22.96) 86 (25.98) 97 (29.22)  Marital Status Single 351 (27.42) 51 (16.35) 88 (28.85) 78 (26.71) 134 (44.37) Married 510 (42.11) 169 (54.17) 129 (42.30) 129 (44.18) 83 (27.48) Divorced/Separated/Widowed 350 (28.90) 92 (29.49) 88 (28.85) 85 (29.11) 85 (28.15) # * Only complete observations were included in the analyses Table 2  Table 2 Association between Social Vulnerability Index (SVI) and Cervical Cancer Mortality (N: overall = 1168; one year = 751) Social Vulnerability Index (SVI) Crude HR (95% CI) p Adjusted HR (95% CI) # p  Overall Mortality Q1 Ref Ref Q2 1.03 (0.75, 1,41) 0.873 0.99 (0.70, 1.38) 0.929 Q3 1.06 (0.76, 1.46) 0.743 1.05 (0.74, 1.48) 0.790 Q4 1.31 (0.97, 1.77) 0.078 1.27 (0.90, 1.78) 0.168  One year Mortality Q1 Ref Ref Q2 1.45 (0.90, 2.34) 0.130 1.27 (0.76, 2.13) 0.361 Q3 1.59 (0.99, 2.55) 0.054 1.58 (0.96, 2.61) 0.075 Q4 1.95 (1.24, 3.07) 0.004 * 1.66 (0.99, 2.80) 0.056 HR – Hazard Ratio; 95% CI – Confidence interval Cox model was used to examine association between SVI and cervical cancer mortality # Ref – Reference; p-value was set at < 0.05 Only complete observations were included in the analyses *SVI quartiles – 0 < Q1 ≤ 0.311, 0.311 < Q2 ≤ 0.532, 0.532 < Q3 ≤ 0.770, Q4 > 0.770 Table 3 p p  Table 3 Association between Social Vulnerability Index (SVI) and Cervical Cancer Mortality among Women Younger (N: overall = 600; one year = 417) andOlder than 50 years (N: overall = 568; one year = 334) Social Vulnerability Index (SVI) ≤50 years > 50 years Crude HR (95% CI) p-value Adjusted HR (95% CI) # p-value Crude HR (95% CI) p-value Adjusted HR (95% CI) # p-value  Overall Mortality Q1 Ref Ref Ref Ref Q2 0.78 (0.50, 1.22) 0.281 0.69 (0.43, 1.11) 0.128 1.31 (0.82, 2.08) 0.256 1.31 (0.80, 2.12) 0.284 Q3 0.75 (0.45, 1.23) 0.252 0.63 (0.36, 1.09) 0.096 1.37 (0.88, 2.14) 0.164 1.51 (0.95, 2.42) 0.083 Q4 1.04 (0.68, 1.59) 0.852 0.80 (0.48, 1.32) 0.381 1.60 (1.04, 2.47) 0.033 * 1.86 (1.15, 3.01) 0.012 *  One year Mortality Q1 Ref Ref Ref Ref Q2 1.06 (0.53, 2.16) 0.864 0.77 (0.35, 1.65) 0.497 1.80 (0.92, 3.50) 0.084 1.79 (0.86, 3.73) 0.118 Q3 0.76 (0.34, 1.69) 0.495 0.64 (0.26, 1.58) 0.335 2.24 (1.19, 4.24) 0.013 * 2.66 (1.34, 5.29) 0.005 * Q4 1.60 (0.83, 3.10) 0.159 0.98 (0.44, 2.19) 0.960 2.27 (1.19, 4.30) 0.013 * 2.45 (1.18, 5.08) 0.016 * HR – Hazard Ratio; 95% CI – Confidence interval Cox model was used to examine association between SVI and cervical cancer mortality # Ref – Reference; p-value was set at < 0.05 Only complete observations were included in the analyses *SVI quartiles – 0 < Q1 ≤ 0.311, 0.311 < Q2 ≤ 0.532, 0.532 < Q3 ≤ 0.770, Q4 > 0.770 Furthermore, we observed an increased hazard of one-year mortality with higher overall SVI scores. In the unadjusted model, women residing in SVI Q4 areas had a 95% significantly higher hazard of mortality within one-year of diagnosis compared to counterparts in SVI Q1 areas (HR: 1.95; 95% CI: 1.24, 3.07; p ( 2 ). When stratified by age group, the association between SVI quartiles and one-year mortality in younger women was not statistically significant. However, among older women, the unadjusted model showed a statistically significant increase in hazard of one-year mortality in SVI Q3 (HR: 2.24; 95% CI: 1.19, 4.24; p p p p ( 3 ) Figure 1 2 p p p p  Fig. 1 Kaplan-Meier Curve for One Year Mortality by SVI quartile (highest vs. lowest) in Older Women (> 50 years) with Cervical Cancer ( N  Fig. 2 Kaplan-Meier Curve for Overall Mortality by SVI Quartile (highest vs. lowest) in Older Women (> 50 years) with Cervical Cancer ( N Discussion The present study is one of the first to examine the relationship between community- level factors measured with the CDC’s SVI and cervical cancer mortality in Alabama using the state registry data. Our findings provide information on community-level social vulnerability and age-related disparities in cervical cancer mortality. Although not significant in the overall study population, our results suggest an increasing trend in hazard of mortality with increased community-level social vulnerability after adjusting for age, race, marital status, and insurance type. This association was significantly stronger in magnitude among older women, with nearly double hazard in mortality in the highest vulnerability group compared to the lowest. Specifically, older women who lived in areas with high overall vulnerability showed increased risk of cervical cancer mortality within one year. These observations highlight community-level disparities that warrants further investigation. Our finding aligns with other studies linking community vulnerability with poorer cancer outcomes. A study conducted in Ohio reported a higher cervical cancer mortality rate in high SVI counties (2.5 vs. 1.8 per 100,000) compared to low SVI counties [ 24 18 29 1 11 31 Our study findings are consistent with previous literature that reported declining survival with increasing age among women with cervical cancer [ 10 14 21 9 14 19 22 10 12 25 30 Our study is one of the first to report an association between community-level social vulnerability and one-year mortality in women with cervical cancer, which may reflect the effect of pre-existing health conditions, inadequate access to healthcare, and low socioeconomic status on survival outcomes. One-year mortality is specifically relevant in cervical cancer, as any delays in early diagnosis and treatment initiation can significantly affect survival. Few other studies have shown results similar to our findings that women in areas with higher social vulnerability were more likely to experience increased cancer-specific mortality [ 7 18 8 As with most analyses of state registry data, our study has limitations. Firstly, approximately half (47.9%) of the patients in the registry had missing data for a stage of cancer. Future studies should explore the association between SVI and cervical cancer mortality across stages of cancer. Secondly, we did not have information on treatment initiation, treatment adherence, or pre-existing comorbid conditions, which limited our understanding of the role of these factors in mortality outcomes. Lastly, the study is not generalizable to other regions of the U.S. Despite the limitations, our study provides insights into the association of community-level social vulnerability and cervical cancer mortality rate in Alabama, with worse outcomes observed in older women. The study has important implications for public health strategies aimed at reducing the burden of cervical cancer mortality in high-risk regions. Additionally, it is important to distinguish between younger and older cancer patients as they face different healthcare challenges and access, comorbidity burden, and screening practices. Future analyses should focus on larger, nationally representative samples that account for comorbidity burden and staging of cancer. Interventions should address vulnerable populations such as older women in order to mitigate the burden of cervical cancer and reduce disparities among population groups. Publisher’s Note Springer Nature remains neutral with regard to jurisdictional claims in published maps and institutional affiliations. Acknowledgements The authors thank all patients included in the study and Program in Epidemiology of Inflammation, Infection and Immunity (PEIII) Research group for helpful insight and discussions of the results. This study was supported by the Quetelet Endowed Professorship Research Fund (PI: Dr. Shrestha). Data Availability The deidentified data from the Alabama Statewide Cancer Registry (ASCR) that support the findings of this study are available from the corresponding author upon reasonable request, following the institutional data sharing agreement. Declarations Conflict of interest This study was supported by the Quetelet Endowed Professorship Research Fund (PI: Dr. Shrestha). Dr. Sudenga reports personal fees from Merck outside the submitted work. The other authors have nothing to disclose. References 1. Abdalla E Habtemariam T Fall S Troy R Tameru B Nganwa D A comparative study of health disparities in cervical Cancer mortality rates through time between black and Caucasian women in Alabama and the US Int J Stud Nurs 2021 6 1 9 23 10.20849/ijsn.v6i1.864 35356704 PMC8963192 Abdalla, E., Habtemariam, T., Fall, S., Troy, R., Tameru, B., & Nganwa, D. (2021). A comparative study of health disparities in cervical Cancer mortality rates through time between black and Caucasian women in Alabama and the US. Int J Stud Nurs 6 35356704 10.20849/ijsn.v6i1.864 PMC8963192 2. Alabama State Cancer Registry. Alabama Public Health https://www.alabamapublichealth.gov/ascr/ 3. Amboree TL Damgacioglu H Sonawane K Adsul P Montealegre JR Deshmukh AA Recent trends in cervical cancer incidence, stage at diagnosis, and mortality according to county-level income in the united States, 2000–2019 International Journal of Cancer 2024 154 9 1549 1555 10.1002/ijc.34860 38270521 PMC11410343 Amboree, T. L., Damgacioglu, H., Sonawane, K., Adsul, P., Montealegre, J. R., & Deshmukh, A. A. (2024). Recent trends in cervical cancer incidence, stage at diagnosis, and mortality according to county-level income in the united States, 2000–2019. International Journal of Cancer 154 38270521 10.1002/ijc.34860 PMC11410343 4. America’s (2025). Health Rankings analysis of America’s Health Rankings composite measure, United Health Foundation, AmericasHealthRankings.org, accessed. 5. Arbyn M Weiderpass E Bruni L de Sanjosé S Saraiya M Ferlay J Bray F Estimates of incidence and mortality of cervical cancer in 2018: A worldwide analysis The Lancet Global Health 2020 8 2 e191 e203 10.1016/S2214-109X(19)30482-6 31812369 PMC7025157 Arbyn, M., Weiderpass, E., Bruni, L., de Sanjosé, S., Saraiya, M., Ferlay, J., & Bray, F. (2020). Estimates of incidence and mortality of cervical cancer in 2018: A worldwide analysis. The Lancet Global Health 8 31812369 10.1016/S2214-109X(19)30482-6 PMC7025157 6. Bauer C Zhang K Xiao Q Lu J Hong YR Suk R County-Level social vulnerability and breast, cervical, and colorectal Cancer screening rates in the US, 2018 JAMA Network Open 2022 5 9 e2233429 e2233429 10.1001/jamanetworkopen.2022.33429 36166230 PMC9516325 Bauer, C., Zhang, K., Xiao, Q., Lu, J., Hong, Y. R., & Suk, R. (2022). County-Level social vulnerability and breast, cervical, and colorectal Cancer screening rates in the US, 2018. JAMA Network Open 5 36166230 10.1001/jamanetworkopen.2022.33429 PMC9516325 7. Borho, L., Elishaev, E., Bao, R., O’Brien, E., Dinkins, K., Berger, J., Boisen, M.,Comerci, J., Courtney-Brooks, M., Edwards, R. P., Garrett, A. A., Kelley, J. L., Lesnock,J., Mahdi, H. S., Olawaiye, A., Rush, S., Sukumvanich, P., Taylor, S., Aneja, R., Modugno, F. (2025). Association of neighborhood social vulnerability with ovarian cancer survival. Gynecol Oncol,192, 32–39. 10.1016/j.ygyno.2024.10.030. 10.1016/j.ygyno.2024.10.030 PMC12208197 39577071 8. Brady KC Stephens CP Sudan SK Singh AP Dasgupta S Singh S Breast and cervical cancer disparities in Alabama: Current scenario, ongoing efforts to reduce the disparity gaps, and what more we could be doing Cancer Health Disparities 2022 6 e1 e10 36777282 PMC9909834 Brady, K. C., Stephens, C. P., Sudan, S. K., Singh, A. P., Dasgupta, S., & Singh, S. (2022). Breast and cervical cancer disparities in Alabama: Current scenario, ongoing efforts to reduce the disparity gaps, and what more we could be doing. Cancer Health Disparities 6 36777282 PMC9909834 9. Brady D Kohler U Zheng H Novel estimates of mortality associated with poverty in the US JAMA Internal Medicine 2023 183 6 618 619 10.1001/jamainternmed.2023.0276 37067817 PMC10111231 Brady, D., Kohler, U., & Zheng, H. (2023). Novel estimates of mortality associated with poverty in the US. JAMA Internal Medicine 183 37067817 10.1001/jamainternmed.2023.0276 PMC10111231 10. Centers for Disease Control and Prevention/ Agency for Toxic Substances and Disease Registry/ Geospatial Research, Analysis, and Services Program. CDC/ATSDR Social Vulnerability Index (2010) Database (Alabama). https://www.atsdr.cdc.gov/placeandhealth/svi/data_documentation_download.html 11. Chen KY Blackford AL Sedhom R Gupta A Hussaini SMQ Local social vulnerability as a predictor for Cancer-Related mortality among US counties The Oncologist 2023 28 9 e835 e838 10.1093/oncolo/oyad176 37335883 PMC10485383 Chen, K. Y., Blackford, A. L., Sedhom, R., Gupta, A., & Hussaini, S. M. Q. (2023). Local social vulnerability as a predictor for Cancer-Related mortality among US counties. The Oncologist 28 37335883 10.1093/oncolo/oyad176 PMC10485383 12. Cooley JJP Maguire FB Morris CR Parikh-Patel A Abrahão R Chen HA Keegan THM Cervical Cancer stage at diagnosis and survival among women ≥ 65 years in California Cancer Epidemiology, Biomarkers & Prevention 2023 32 1 91 97 10.1158/1055-9965.Epi-22-0793 PMC9833840 36620897 Cooley, J. J. P., Maguire, F. B., Morris, C. R., Parikh-Patel, A., Abrahão, R., Chen, H. A., & Keegan, T. H. M. (2023). Cervical Cancer stage at diagnosis and survival among women ≥ 65 years in California. Cancer Epidemiology, Biomarkers & Prevention 32 10.1158/1055-9965.EPI-22-0793 PMC9833840 36620897 13. Elhussin I Nganwa D Peaster R Egiebor-Aiwan O James CM Heath J Webb L Abdalla E Disparities in cervical Cancer treatment options between African American (Black) and white women in Alabama J Healthc Sci Humanit 2020 10 1 61 83 35261815 PMC8900975 Elhussin, I., Nganwa, D., Peaster, R., Egiebor-Aiwan, O., James, C. M., Heath, J., Webb, L., & Abdalla, E. (2020). Disparities in cervical Cancer treatment options between African American (Black) and white women in Alabama. J Healthc Sci Humanit 10 35261815 PMC8900975 14. Hahn RA Truman BI Education improves public health and promotes health equity International Journal of Health Services 2015 45 4 657 678 10.1177/0020731415585986 25995305 PMC4691207 Hahn, R. A., & Truman, B. I. (2015). Education improves public health and promotes health equity. International Journal of Health Services 45 25995305 10.1177/0020731415585986 PMC4691207 15. Health, A. S. C. R. (2020). B. o. F. H. S. A. D. o. P. ALABAMA DATA ACQUISITION MANUAL https://www.alabamapublichealth.gov/ASCR/assets/12042020adammanualrevision.pdf 16. Holt HK Calip GS Peterson CE David SM Geller S Guadamuz JS Sociodemographic inequities in overall survival among younger and older women with cervical cancer Cancer Causes and Control 2025 10.1007/s10552-025-01961-0 39847161 Holt, H. K., Calip, G. S., Peterson, C. E., David, S. M., Geller, S., & Guadamuz, J. S. (2025). Sociodemographic inequities in overall survival among younger and older women with cervical cancer. Cancer Causes and Control 39847161 10.1007/s10552-025-01961-0 17. Johnson CR Muhimpundu S Han X Mumma MT Shrubsole MJ Zheng W Spalluto LB Lipworth L Sudenga SL The influence of residential segregation, urbanicity, and population density on hepatocellular carcinoma incidence among a low socioeconomic population Cancer Epidemiology Biomarkers & Prevention 2025 34 2 348 354 10.1158/1055-9965.Epi-24-1119 PMC11932245 39625692 Johnson, C. R., Muhimpundu, S., Han, X., Mumma, M. T., Shrubsole, M. J., Zheng, W., Spalluto, L. B., Lipworth, L., & Sudenga, S. L. (2025). The influence of residential segregation, urbanicity, and population density on hepatocellular carcinoma incidence among a low socioeconomic population. Cancer Epidemiology Biomarkers & Prevention 34 10.1158/1055-9965.EPI-24-1119 PMC11932245 39625692 18. Li Z Liu P Yin A Zhang B Xu J Chen Z Zhang Z Zhang Y Wang S Tang L Kong B Song K Global landscape of cervical cancer incidence and mortality in 2022 and predictions to 2030: The urgent need to address inequalities in cervical cancer International Journal of Cancer 2025 10.1002/ijc.35369 40026066 Li, Z., Liu, P., Yin, A., Zhang, B., Xu, J., Chen, Z., Zhang, Z., Zhang, Y., Wang, S., Tang, L., Kong, B., & Song, K. (2025). Global landscape of cervical cancer incidence and mortality in 2022 and predictions to 2030: The urgent need to address inequalities in cervical cancer. International Journal of Cancer 40026066 10.1002/ijc.35369 19. Lo CH Tun KM Pan CW Lee JK Singh H Samadder NJ Association between social vulnerability and Gastrointestinal Cancer mortality in the united States counties Gastro Hep Advances 2024 3 6 821 829 10.1016/j.gastha.2024.05.007 39280915 PMC11401585 Lo, C. H., Tun, K. M., Pan, C. W., Lee, J. K., Singh, H., & Samadder, N. J. (2024). Association between social vulnerability and Gastrointestinal Cancer mortality in the united States counties. Gastro Hep Advances 3 39280915 10.1016/j.gastha.2024.05.007 PMC11401585 20. Mehta A Jeon WJ Nagaraj G Association of US county-level social vulnerability index with breast, colorectal, and lung cancer screening, incidence, and mortality rates across US counties Frontiers in Oncology 2024 14 1422475 10.3389/fonc.2024.1422475 39169944 PMC11335618 Mehta, A., Jeon, W. J., & Nagaraj, G. (2024). Association of US county-level social vulnerability index with breast, colorectal, and lung cancer screening, incidence, and mortality rates across US counties. Frontiers in Oncology 14 39169944 10.3389/fonc.2024.1422475 PMC11335618 21. Mode NA Evans MK Zonderman AB Race, neighborhood economic status, income inequality and mortality PLoS One 2016 11 5 e0154535 10.1371/journal.pone.0154535 27171406 PMC4865101 Mode, N. A., Evans, M. K., & Zonderman, A. B. (2016). Race, neighborhood economic status, income inequality and mortality. PLoS One 11 27171406 10.1371/journal.pone.0154535 PMC4865101 22. Niu X Roche LM Pawlish KS Henry KA Cancer survival disparities by health insurance status Cancer Medicine 2013 2 3 403 411 10.1002/cam4.84 23930216 PMC3699851 Niu, X., Roche, L. M., Pawlish, K. S., & Henry, K. A. (2013). Cancer survival disparities by health insurance status. Cancer Medicine 2 23930216 10.1002/cam4.84 PMC3699851 23. Quinn BA Deng X Colton A Bandyopadhyay D Carter JS Fields EC Increasing age predicts poor cervical cancer prognosis with subsequent effect on treatment and overall survival Brachytherapy 2019 18 1 29 37 10.1016/j.brachy.2018.08.016 30361045 PMC6338515 Quinn, B. A., Deng, X., Colton, A., Bandyopadhyay, D., Carter, J. S., & Fields, E. C. (2019). Increasing age predicts poor cervical cancer prognosis with subsequent effect on treatment and overall survival. Brachytherapy 18 30361045 10.1016/j.brachy.2018.08.016 PMC6338515 24. Sarfati D Koczwara B Jackson C The impact of comorbidity on cancer and its treatment CA: A Cancer Journal for Clinicians 2016 66 4 337 350 10.3322/caac.21342 26891458 Sarfati, D., Koczwara, B., & Jackson, C. (2016). The impact of comorbidity on cancer and its treatment. CA: A Cancer Journal for Clinicians 66 26891458 10.3322/caac.21342 25. SEER Cancer Stat Facts: Cervical Cancer. National Cancer Institute. Bethesda, MD,. Retrieved February from https://seer.cancer.gov/statfacts/html/cervix.html 26. Social Vulnerability and Cancer in Ohio. (June 2023). 27. Tipirneni R Politi MC Kullgren JT Kieffer EC Goold SD Scherer AM Association between health insurance literacy and avoidance of health care services owing to cost JAMA Netw Open 2018 1 7 e184796 10.1001/jamanetworkopen.2018.4796 30646372 PMC6324372 Tipirneni, R., Politi, M. C., Kullgren, J. T., Kieffer, E. C., Goold, S. D., & Scherer, A. M. (2018). Association between health insurance literacy and avoidance of health care services owing to cost. JAMA Netw Open 1 30646372 10.1001/jamanetworkopen.2018.4796 PMC6324372 28. Tran T Rousseau MA Farris DP Bauer C Nelson KC Doan HQ The social vulnerability index as A risk stratification tool for health disparity research in cancer patients: A scoping review Cancer Causes and Control 2023 34 5 407 420 10.1007/s10552-023-01683-1 37027053 PMC10080510 Tran, T., Rousseau, M. A., Farris, D. P., Bauer, C., Nelson, K. C., & Doan, H. Q. (2023). The social vulnerability index as A risk stratification tool for health disparity research in cancer patients: A scoping review. Cancer Causes and Control 34 37027053 10.1007/s10552-023-01683-1 PMC10080510 29. U.S. Cancer Statistics Working Group. U.S. Cancer Statistics Data Visualizations Tool. U.S. Department of Health and Human Services. Centers for Disease Control and Prevention and National Cancer Institute. (2024). https://www.cdc.gov/cancer/dataviz 30. Williams GR Mackenzie A Magnuson A Olin R Chapman A Mohile S Allore H Somerfield MR Targia V Extermann M Cohen HJ Hurria A Holmes H Comorbidity in older adults with cancer J Geriatr Oncol 2016 7 4 249 257 10.1016/j.jgo.2015.12.002 26725537 PMC4917479 Williams, G. R., Mackenzie, A., Magnuson, A., Olin, R., Chapman, A., Mohile, S., Allore, H., Somerfield, M. R., Targia, V., Extermann, M., Cohen, H. J., Hurria, A., & Holmes, H. (2016). Comorbidity in older adults with cancer. J Geriatr Oncol 7 26725537 10.1016/j.jgo.2015.12.002 PMC4917479 31. Yoo W Kim S Huh WK Dilley S Coughlin SS Partridge EE Chung Y Dicks V Lee JK Bae S Recent trends in Racial and regional disparities in cervical cancer incidence and mortality in united States PLoS One 2017 12 2 e0172548 10.1371/journal.pone.0172548 28234949 PMC5325259 Yoo, W., Kim, S., Huh, W. K., Dilley, S., Coughlin, S. S., Partridge, E. E., Chung, Y., Dicks, V., Lee, J. K., & Bae, S. (2017). Recent trends in Racial and regional disparities in cervical cancer incidence and mortality in united States. PLoS One 12 28234949 10.1371/journal.pone.0172548 PMC5325259 32. Yuan R Zhang C Li Q Ji M He N The impact of marital status on stage at diagnosis and survival of female patients with breast and gynecologic cancers: A meta-analysis Gynecologic Oncology 2021 162 3 778 787 10.1016/j.ygyno.2021.06.008 34140180 Yuan, R., Zhang, C., Li, Q., Ji, M., & He, N. (2021). The impact of marital status on stage at diagnosis and survival of female patients with breast and gynecologic cancers: A meta-analysis. Gynecologic Oncology 162 34140180 10.1016/j.ygyno.2021.06.008 ",
  "metadata": {
    "Title of this paper": "The impact of marital status on stage at diagnosis and survival of female patients with breast and gynecologic cancers: A meta-analysis",
    "Journal it was published in:": "Journal of Community Health",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12474630/"
  }
}