{
  "title": "Paper_249",
  "abstract": "pmc Front Nutr Front Nutr 2731 fnut Front. Nutr. Frontiers in Nutrition 2296-861X Frontiers Media SA PMC12490988 PMC12490988.1 12490988 12490988 10.3389/fnut.2025.1612919 1 Nutrition Original Research The influence of nutrition on HPV-associated inflammation: a systematic review and meta-analysis Li Yuan  * Zhu Lijuan Department of Gynaecology and Obstetrics, The First People’s Hospital of Shangqiu Shangqiu, Henan China Edited by: Karolina Krupa-Kotara Reviewed by: Ajibola Ibraheem Abioye Sreenivasulu Chintala *Correspondence: Yuan Li, liyuandreams@126.com 19 9 2025 2025 12 480739 1612919 16 4 2025 05 9 2025 19 09 2025 04 10 2025 04 10 2025 Copyright © 2025 Li and Zhu. 2025 Li and Zhu https://creativecommons.org/licenses/by/4.0/ This is an open-access article distributed under the terms of the Creative Commons Attribution License (CC BY). The use, distribution or reproduction in other forums is permitted, provided the original author(s) and the copyright owner(s) are credited and that the original publication in this journal is cited, in accordance with accepted academic practice. No use, distribution or reproduction is permitted which does not comply with these terms. Background Chronic infection with human papillomavirus (HPV) is a key etiologic cause of cervical intraepithelial neoplasia (CIN) and cervical cancer. Methodology By applying MeSH terms and keywords relating to HPV, nutrition, and inflammation, sources such as PubMed, EMBASE, the Cochrane Library, and Google Scholar were examined until April 2025. Two reviewers separately selected the studies, extracted the information, and assessed the possibility of bias. Pooled estimates were computed using random-effects, with GRADE assessing confidence. 77 studies from 17 countries were included, of which the most represented were the USA (16 studies), China (12), and Iran (6). The types of studies comprised 38 case–control, 11 cross-sectional, 7 randomized controlled trials (RCTs), 7 cohort studies, and 14 nested studies. Nutrients assessed included vitamins A, C, D, E, K, B-complex (particularly B6, B12, and folate), carotenoids ( β Results The higher dietary intake or serum levels of micronutrients were associated with reduced persistence of HPV and decrease the risk of CIN and cervical cancer. Key findings by subgroup include: Based on 8 studies, involving 2,003 women, a protective vitamin E (particularly α p 2 p 2 p 2 p 2 antioxidants selenium zinc nutrition HPV cervical intraepithelial neoplasia inflammation vitamin D The author(s) declare that no financial support was received for the research and/or publication of this article. pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement no pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes section-at-acceptance Clinical Nutrition 1 Introduction One of the biggest contributors of cancer-related death for women globally, especially in nations with low or moderate incomes, is cervical cancer (CC). Cervical cancer and cervical intraepithelial neoplasia (CIN) have been reported to be caused by persistent contact with the high-risk human papillomavirus (hrHPV) ( 1 2 β 1 3 4 5 6 7 2 Materials and methods The PRISMA 2020 guidelines were applied in the execution of this systematic review and meta-analysis. 2.1 Search strategy The Cochrane Library, Google Scholar, PubMed (Medline), and EMBASE databases were searched from the inception dates to April 2025. Considering the large amount of gray and non-peer-reviewed publications on Google Scholar, two independent reviewers meticulously filtered the first 200 results, according to the abstract and title’s relevancy. Full texts of research papers that might be appropriate were obtained. The following were the primary search terms used for article texts, abstracts, or MeSH headings: HPV, human papillomavirus, nutrition, dietary intake, micronutrient intake, vitamin supplementation, inflammation, anti-inflammatory diet, cytokine expression, immune response, antioxidants, oxidative stress, randomized controlled trial, clinical trial, and interventional study. The search criteria were modified by integrating these phrases utilizing the Boolean logic operator AND. While searching the database, a language limitation was implemented; only English-language publications were taken into consideration for inclusion ( Table 1 Table 1 Comprehensive electronic search methods for systematic review. Database Search strategy Last search PubMed (MEDLINE) “human papillomavirus”[Mesh] OR HPV OR “human papillomavirus infection” AND “nutrition”[Mesh] OR “dietary intake” OR AND “inflammation”[Mesh] OR “anti-inflammatory diet” OR “immune response” OR “cytokine expression” OR “oxidative stress” OR “antioxidants” AND “clinical trial “OR “randomized controlled trial” April, 2025 EMBASE ‘human papillomavirus’/exp. OR hpv) AND ‘dietary intake’/exp. OR ‘nutrition’/exp. OR ‘vitamin supplementation’/exp. OR ‘micronutrient intake’/exp. AND ‘inflammation’/exp. OR ‘anti-inflammatory diet’/exp. OR ‘immune response’/exp. OR ‘cytokine expression’/exp. OR ‘oxidative stress’/exp. OR “antioxidants’/exp. AND (‘clinical trial’/exp. OR ‘randomized controlled trial’/exp) April, 2025 Cochrane Library (CENTRAL) “HPV” OR “human papillomavirus” AND “dietary intake” OR “nutrition” OR “vitamin supplementation “OR “micronutrient intake” AND “immune response” OR “inflammation” OR “cytokine expression” OR “antioxidants” OR “oxidative stress” April, 2025 Google Scholar “HPV” OR “human papillomavirus” AND “dietary intake” OR “nutrition” OR “vitamin supplementation” OR “micronutrient intake” AND “inflammation” OR “cytokine expression” OR “immune response” OR “antioxidants” OR “oxidative stress” AND “clinical trial” OR “randomized controlled trial” April, 2025 2.2 Inclusion criteria Studies were included based on predefined inclusion and exclusion criteria structured using population, Intervention, Control, Outcome, and Study (PICOS) ( Table 2 in vitro Table 2 Summary of PICOS criteria. Element Scope Population Patients with documented HPV Infection (particularly females with cervical HPV), With or without CIN Intervention Dietary intake or micronutrient supplementation Comparator Placebo (RCTs), no supplement/usual care Outcomes HPV perseverance or elimination and virus load; prevalence, development, or decline of CIN; alterations in indicators of oxidative damage or inflammation Study design RCTs, nested, case–control cohort, and cross-sectional designs 2.3 Outcomes and measures The well-known natural trajectory of HPV can be divided into three categories of outcomes: mechanistic (alterations in oxidative damage or pro-inflammatory markers), precancerous (development, growth, or regression of CIN), and virologic (acquisition, perseverance, or removal of infection). We chose this paradigm since studies usually provide results at all three phases, oxidative damage and inflammatory signaling are crucial stages in the onset of the illness, and persistent high-risk HPV is the main contributory factor of CIN and cervical cancer. 2.4 Data extraction Two researchers separately assessed every piece of possibly pertinent literature, and they all came to a consensus. The first author, publication year, study design (randomized controlled trials, prospective or retrospective studies, and case control studies), sample size, demographic information (age, sex), enrollment period, HPV infection status, dietary assessment type and method, specific nutrients, patterns evaluated or dietary components, inflammatory markers, and type and site of HPV infection were all extracted with respect to each included study. 2.5 Assessment bias By employing the Newcastle-Ottawa Scale (NOS) for observational research and the Cochrane Risk of Bias Tool 2.0 for randomized controlled trials, the risk of bias was determined. Along with domain-driven evaluations (such as reporting, detection, and performance bias), we also categorized investigations into low, moderate, and high risk of bias according to the three fundamental areas that are thought to be essential to internal validity: (1) concealing allocations (selection bias); (2) blinding the subjects and examiners (performance/detection bias); and (3) attrition bias (insufficient end result information). These cutoff points were modified from Cochrane RoB 2.0 recommendations to make subgroup examinations and sensitivity evaluations easier. Any disagreements between the two researchers about the choice of study or the extraction of data were either settled by consensus or forwarded to a third researcher. 2.6 Certainty of evidence We employed the GRADE (Grading of Recommendations Assessment, Development, and Evaluation) framework covering five domains—risk of bias, inconsistency, indirectness, imprecision, and publication bias—to determine the total validity of the evidence. 2.7 Statistical analysis For the purpose of statistical analysis, the Cochrane Software Review Manager (version 5.3, The Cochrane Collaboration, Copenhagen, Denmark) was deployed. For continuous variables, pooled effect sizes were determined as standardized mean differences (SMDs); for binary outcomes, they were computed as odds ratios (ORs), each with an interval of confidence of 95%. The random-effects model (DerSimonian and Laird approach) was implemented to consider inter-study variation into consideration. The I 2 2 p 2.8 Sensitivity and influence analyses Sensitivity and influence evaluation was carried out to make sure the outcomes were valid. To determine its impact on the pooled estimates, a leave-one-out sensitivity analysis was applied by successively eliminating every investigation. Meta-analyses with and without studies classified as high risk were compared in order to perform a high-risk bias exclusion analysis. Furthermore, subgroup analyses were also carried out according to the form of nutrients (vitamin D vs. vitamin E vs. others), the location of HPV infection (cervical vs. oropharyngeal), and the study method (RCT vs. observational). 3 Results 77 studies were included in this meta-analysis. These studies were conducted in 17 countries, most of which (16 studies) were represented from the USA, followed by China (12 studies) and Iran (6 studies). Other countries contributing to the pool were Brazil, India, Japan, Korea, Italy, and various European and South American countries, indicating an interest around the world in learning about the potential role of nutrition in the prevention and treatment of HPV-related diseases. The studies used a range of methodological designs. The most common (38 studies) were case–control studies, which mostly compared nutrient consumption or serum level of nutrients among individuals with or without HPV infection or cervical intraepithelial neoplasia (CIN). Cross-sectional studies (11 studies) explored associations at a single time point between micronutrient status and HPV-related outcomes ( Table 1 Figure 1 Figure 1 Risk bias for observational studies. Heatmap displaying the risk of bias assessment across multiple studies, categorized by domains such as classification, confounding, missing data, outcome measurement, reporting, and selection. Green indicates low risk, orange medium risk, and red high risk. Various studies are listed vertically, with color codes showing their risk assessments. Randomized controlled trials (7 studies), which were mainly from Iran and the USA, provided high-level evidence of the efficacy of some supplements such as vitamin D, selenium, and folate in promoting CIN regression and modulation of inflammatory biomarkers ( Figure 2 Figure 3 Tables 3 11 Figure 2 Risk of bias assessment for RCTs. Risk of bias summary figure for eight studies, highlighting various bias types: random sequence generation, allocation concealment, blinding of participants, blinding of outcome assessment, incomplete outcome data, selective reporting, and other bias. Green indicates low risk, red denotes unclear risk. Figure 3 PRISMA flow chart of data selection. Flowchart illustrating a study selection process. Identification phase: 3990 records from PubMed, Scopus, and Google Scholar. Screening phase: 2887 duplicates removed, leaving 2799 for screening; 2298 records excluded; 501 reports sought, 372 not retrieved. Eligibility phase: 215 reports assessed, 138 excluded due to study design, population, or intervention issues. Included phase: 77 studies included in the review. Table 3 Vitamin E. Author, year Country Study design Sample size Supplement Intervention Vitamin/antioxidant assessed Outcome related to the influence of nutrition on HPV-associated inflammation Guo et al. ( 20 China Case–control study 458/742 Vitamin E Serum levels, dietary intake Vitamins A, C, E Higher antioxidant intake linked to reduced cervical cancer risk via potential anti-inflammatory effects. Zhang et al. ( 21 China Case control study 158/200 Vitamin E Serum micronutrients Carotenoids, Retinol, Tocopherols Lower serum levels associated with higher cancer risk, supporting role in HPV-related inflammation modulation. Tomita et al. ( 22 Brazil Case control study 453/605 Vitamin E Serum and dietary micronutrients α-Tocopherol, β Lower antioxidant levels associated with CIN risk; antioxidants may suppress HPV-triggered inflammation. Ghosh et al. ( 14 USA Case control study 239/979 Vitamin E Dietary intake Vitamins A, C, E Dietary antioxidants inversely associated with cervical cancer risk, possibly mitigating HPV-driven inflammation. Siegel et al. ( 15 USA Cohort study 229/405 Vitamin E Serum concentrations Carotenoids, Tocopherols High serum antioxidant levels reduced HPV persistence, likely due to modulation of inflammatory response. Palan et al. ( 23 USA Cross sectional study 21/51 Vitamin E Plasma antioxidant levels α α Decreased α-tocopherol and increased oxidized metabolites linked to cervical neoplasia and inflammation. Palan et al. ( 24 USA Cross sectional study 48/162 Vitamin E Plasma levels of antioxidants Coenzyme Q10, α- and γ Lower plasma levels observed in cervical neoplasia cases; potential protective antioxidant role against HPV-related inflammation. Goodman et al. ( 25 USA Case control study 147/191 Vitamin E Serum micronutrient concentrations β Higher serum antioxidant levels associated with faster clearance of oncogenic HPV infections. Table 4 Vitamin K. Author, year Country Study design Sample size Supplement Intervention Nutrient assessed Outcome related to the influence of nutrition on HPV-associated inflammation Jiang et al. ( 18 China Cross sectional study 13,447 Vitamin K Dietary intake Vitamin K Lower dietary vitamin K intake significantly associated with higher HPV infection rates. Wang et al. ( 19 China Cohort study 218 Vitamin K Dietary nutrient intake Vitamins A, C, E, B12, Folate Lower intake of key vitamins (esp. B12, folate, A) associated with higher CIN risk; nutrients may reduce HPV-related inflammation. Table 5 Vitamin D. Author, year Country Study design Sample size Supplement Intervention Vitamin/antioxidant assessed Outcome related to the influence of nutrition on HPV-associated inflammation Vaheedpoor et al. ( 10 Iran RCT 58 Vitamin D Vitamin D3 (50,000 IU biweekly) Vitamin D Vitamin D supplementation led to improved metabolic markers and reduced CIN 2/3 recurrence, indicating anti-inflammatory benefit. Vaheedpoor et al. ( 9 Iran RCT 58 Vitamin D Vitamin D3 (50,000 IU biweekly) Vitamin D Significant CIN regression and metabolic improvement observed; supports anti-inflammatory role in HPV-infected tissue. Özgü et al. ( 26 Turkey Case control study 23/62 Vitamin D Serum 25-OH Vitamin D levels Vitamin D Vitamin D deficiency associated with persistent HPV infection in women with cervical lesions. Schulte-Uebbin et al. ( 27 Germany Cross sectional study 100/200 Vitamin D Vaginal vitamin D suppositories (12,500 IU daily) Vitamin D High-dose vaginal vitamin D resolved HPV and CIN lesions in most participants, suggesting potent local anti-inflammatory effect. Hosono et al. ( 28 Japan Case control study 405/2,025 Vitamin D Dietary intake assessment Vitamin D, Calcium Higher vitamin D intake inversely associated with cervical neoplasia; potentially protective via immune and inflammatory modulation. Table 6 Vitamin C. Author, year Country Study design Sample size Supplement Intervention Vitamin/antioxidant assessed Outcome related to the influence of nutrition on HPV-associated inflammation Zheng et al. ( 5 China Cross sectional study 217 Vitamin C Serum vitamin C levels Vitamin C Lower serum vitamin C levels associated with increased HPV infection prevalence; implicates antioxidant role in infection control. Barchitta et al. ( 2 Italy Cross sectional study 251 Vitamin C Dietary pattern analysis Multiple antioxidants via diet Healthy dietary patterns rich in antioxidants inversely associated with high-risk HPV infection and cervical cancer risk. Naidu et al. ( 29 India Case control study 30/120 Vitamin C Oxidative stress markers and antioxidants Vitamins C, E, Glutathione Cervical cancer patients showed elevated oxidative stress and decreased antioxidants, indicating inflammation role. Giuliano et al. ( 30 USA Nested case study 185/248 Vitamin C Dietary intake and serum micronutrients Vitamins A, C, E, Carotenoids Persistent HPV infection associated with lower antioxidant intake; antioxidants may aid immune response and inflammation control. Shannon et al. ( 31 Thailand Case control study 134/348 Vitamin C Dietary intake Vitamins A, C, Carotenoids Dietary deficiencies linked to increased cervical carcinoma risk; antioxidants may reduce HPV-related inflammation and carcinogenesis. Herrero et al. ( 32 Costa Rica Case control study 141/748 Vitamin C Dietary intake Vitamins A, C, Riboflavin, Folate Lower nutrient intake related to increased invasive cervical cancer risk, possibly via immune and inflammatory pathways. Ziegler et al. ( 33 USA Case control study 229/502 Vitamin C Dietary intake Vitamins A, C, Carotenoids Inverse association of vitamin A and carotenoids with in situ cervical cancer, implicating protective inflammatory modulation. Brock et al. ( 34 Australia Case control study 117/196 Vitamin C Dietary and plasma nutrients Vitamins A, C, E Lower plasma vitamin concentrations associated with higher in situ cervical cancer risk; antioxidants may limit HPV-related inflammation. Table 7 Vitamin A. Author, year Country Study design Sample size Supplement Intervention Vitamin/antioxidant assessed Outcome related to the influence of nutrition on HPV-associated inflammation Huang et al. ( 35 China Cross sectional study 13,412 Vitamin A Dietary vitamin A intake Vitamin A Low vitamin A intake correlated with increased HPV infection prevalence; vitamin A may influence inflammatory response. Eleutério et al. ( 36 Brazil Cross sectional study 62 Vitamin A Serum vitamin A levels Vitamin A Low serum vitamin A levels significantly associated with high-grade squamous intraepithelial lesions; implicates immune/inflammation pathways. Kim et al. ( 16 Korea Case control study 144/288 Vitamin A Zinc-citrate compound CIZAR® topical treatment Zinc Zinc treatment reduced HPV viral load and cervical lesion severity, indicating anti-inflammatory and antiviral potential. Yeo et al. ( 37 USA Case control study 190/326 Vitamin A Serum micronutrient measurement Vitamins A, C, E, Zinc, Selenium Lower serum micronutrients associated with cervical dysplasia; zinc and antioxidants may modulate inflammation in HPV infection. Table 8 Selenium. Author, year Country Study design Sample size Supplement Intervention Vitamin/antioxidant assessed Outcome related to the influence of nutrition on HPV-associated inflammation Karamali et al. ( 38 Iran RCT 28/58 Selenium Selenium supplementation 200 μg/day Selenium Selenium supplementation promoted regression of CIN and improved metabolic profiles; anti-inflammatory effects suggested. Cunzhi et al. ( 39 China Case control study 50/70 Selenium Serum and tissue trace elements Zinc, Copper, Selenium Altered trace element levels and Cu/Zn ratio in cervical cancer patients suggest oxidative stress and inflammatory involvement. Xiao et al. ( 40 China Cross sectional study 4,628 Selenium Dietary intake assessment Zinc, Copper, Selenium Higher dietary zinc and selenium intake inversely associated with high-risk HPV infection; nutrients may reduce inflammation. Obhielo et al. ( 7 Nigeria Case control study 45 Selenium Serum selenium measurement Selenium Lower serum selenium levels associated with higher CIN risk; selenium may have anti-inflammatory role in cervical neoplasia. Shimizu et al. ( 17 Japan Case control study 137 Vitamin A Serum retinol measurement Vitamin A retinol Women with cervical dysplasia showed decreased serum retinol, indicating antioxidant deficiency may influence HPV inflammation. Sundström et al. ( 41 Finland Cross sectional study 25/32 Selenium Serum selenium levels monitored annually Selenium Annual selenium variation noted; low selenium associated with gynecological cancers including cervical lesions, linked to oxidative stress. Table 9 Calcium, iron and zinc. Author, year Country Study design Sample size Supplement Intervention Vitamin/antioxidant assessed Outcome related to the influence of nutrition on HPV-associated inflammation Hwang et al. ( 42 Korea Cross sectional study 256/328 Calcium Dietary supplement use questionnaire Multivitamins and antioxidants Supplement use linked to decreased risk of CIN, suggesting a protective anti-inflammatory effect. Siegel et al. ( 43 USA Cohort study 327 Iron Serum iron biomarker measurement Iron status biomarkers Higher iron storage biomarkers associated with altered HPV clearance, implying iron-related oxidative stress in HPV persistence. He et al. ( 44 China Cross sectional study 13,475 Calcium Dietary calcium intake questionnaire Calcium Higher calcium intake associated with reduced HPV infection prevalence, suggesting anti-inflammatory effects of calcium. Ayatollahi et al. ( 6 Iran RCT 40/40 Zinc Oral zinc sulfate supplementation Zinc Zinc supplementation significantly increased HPV clearance rate, indicating zinc’s immunomodulatory and anti-inflammatory role. Chen et al. ( 13 Taiwan Case control study 50/90 Zinc Serum copper and zinc measurement Copper, Zinc Altered serum copper and zinc levels observed in cervical cancer patients; imbalance may contribute to oxidative stress and HPV inflammation. Sengupta et al. ( 45 India Cross sectional study 28/28 Calcium Serum calcium measurement Calcium Serum calcium levels correlated with cervical cancer status; potential link to inflammatory pathways in cervical carcinogenesis. Grail and Norval ( 46 Scotland Case control study 21/110 Zinc Serum copper and zinc measurement Copper, Zinc Differences in serum copper and zinc between patients with cervical abnormalities and controls; possible role in modulating HPV-associated inflammation. Liu et al. ( 47 USA Case–control study 523 Calcium Dietary questionnaires Various nutritional factors including folate, vitamins A and C Nutritional deficiencies linked to increased cervical dysplasia risk, with folate deficiency showing strong association with HPV-related inflammation. Table 10 Vitamin B12. Author, year Country Study design Sample size Supplement Intervention Vitamin/antioxidant assessed Outcome related to the influence of nutrition on HPV-associated inflammation Li et al. ( 48 China Case control study 80/174 B12 Folate status measurement Folate Folate deficiency correlated with aberrant DNA methylation in FHIT gene, promoting cervical pathogenesis and HPV-associated inflammation. Sabihi et al. ( 49 Iran RCT 60 B12 Folate supplementation Folate Folate supplementation reduced recurrence of cervical intraepithelial neoplasia and improved metabolic status, suggesting anti-inflammatory effects. Zhao et al. ( 4 China Cross sectional study 877/20,000 B12 Folate status measurement Folate Low folate status associated with higher risk of cervical intraepithelial neoplasia, implicating folate in modulating HPV-induced inflammation. Piyathilake et al. ( 50 India Cross sectional study 16/315 B12 Dietary folate and vitamin B12 assessment Folate, Vitamin B12 Folate and vitamin B12 inversely associated with HPV 16 methylation and higher-grade CIN risk, suggesting their protective role in HPV-related inflammation. Piyathilake et al. ( 3 India Cross sectional study 724 B12 Plasma folate and vitamin B12 measurement Folate, Vitamin B12 High plasma folate with sufficient B12 linked to lower risk of cervical intraepithelial neoplasia, suggesting protective effects on HPV inflammation. Bai et al. ( 51 China Cross sectional study 109/202 B12 Folate deficiency assessment, HPV 16 infection status Folate Folate deficiency and FHIT gene hypermethylation synergistically promoted HPV 16-related cervical cancerization via inflammation pathways. Ragasudha et al. ( 52 India Case control study 136/186 B12 Folate and vitamin B12 nutritional status Folate, Vitamin B12 Synergistic interaction of folate and B12 influenced cervical cancer progression through epigenetic and inflammatory mechanisms. Abike et al. ( 11 Turkey Case control study 122 B12 Measurement of neopterin, folate, homocysteine levels Folate, Homocysteine Persistent HPV infection associated with altered folate and neopterin levels, indicating links to immune activation and inflammation. Asemi et al. ( 8 Iran RCT 58 B12 Long-term folate supplementation Folate Folate supplementation improved metabolic profiles and promoted regression of cervical intraepithelial neoplasia, reducing HPV-associated inflammation. Wang et al. ( 53 China Case control study 111/111 B12 Folate measurement Folate Lower folate levels associated with increased cervical cancer risk, indicating folate’s role in modulating HPV-related inflammation. Hernandez et al. ( 54 USA Case control study 214/217 B12 Dietary intake assessment Folate, Riboflavin, Thiamin, Vitamin B12 Diets rich in folate and B vitamins were protective against premalignant cervical lesions, reducing HPV-induced inflammation. Table 11 Fruits and vegetables. Author, year Country Study design Sample size Supplement Intervention Vitamin/antioxidant assessed Outcome related to the influence of nutrition on HPV-associated inflammation Fuji et al. ( 55 Japan Prospective study 391 Carotenoids Carotenoid blood levels Carotenoids Higher carotenoid levels associated with better CIN outcomes, suggesting antioxidant role in HPV-associated inflammation control. Peterson et al. ( 56 USA Prospective study 120/141 Carotenoids Combined carotenoid antioxidants Carotenoids Combined carotenoid antioxidants linked to reduced risk of persistent HPV infection through anti-inflammatory mechanisms. Tomita et al. ( 57 Brazil Case control study 231/453 Carotenoids Dietary intake of dark-green and deep-yellow vegetables/fruits Carotenoids, Vitamins Vegetable and fruit intake inversely associated with CIN, with effects modified by smoking status, likely via inflammatory pathways. Sedjo et al. ( 58 USA Prospective study 84 Carotenoids Plasma micronutrient measurement Various micronutrients Higher plasma micronutrient levels associated with increased clearance of oncogenic HPV, indicating anti-inflammatory roles. Sedjo et al. ( 59 Prospective study 1,042 Carotenoids Vitamin A and carotenoid levels Vitamin A, Carotenoids Lower vitamin A and carotenoid levels linked to increased risk of persistent oncogenic HPV infection. Schiff et al. ( 60 USA Case control study 81/160 Carotenoids Serum carotenoid levels Carotenoids Higher serum carotenoids associated with reduced risk of cervical intraepithelial neoplasia via anti-inflammatory effects. Nagata et al. ( 1 Japan Case control study 152/152 Carotenoids Serum carotenoids and vitamin levels Carotenoids, Vitamins Lower serum carotenoids and vitamins associated with increased risk of cervical dysplasia. Palan et al. ( 61 USA Case control study 95/140 Carotenoids Plasma levels of carotenoids, retinol, tocopherols Beta-carotene, Lycopene, Canthaxanthin, Retinol, α−/ τ Reduced plasma antioxidant levels linked to cervical intraepithelial neoplasia and cancer, implicating oxidative stress and inflammation. Kanetsky et al. ( 62 USA Case control study 60/113 Carotenoids Dietary intake and blood lycopene levels Lycopene Higher lycopene intake and blood levels linked with reduced cervical dysplasia risk, suggesting anti-inflammatory effects. Romney et al. ( 63 USA RCT 69 Carotenoids β-Carotene supplementation and other factors β-Carotene β-Carotene supplementation associated with regression of cervical dysplasia and reduced HPV infection persistence. De Vet et al. ( 64 Netherlands Case control study 257 Carotenoids β-Carotene supplementation β-Carotene β-Carotene supplementation showed effects on regression and progression of cervical dysplasia. dE Vet et al. ( 65 Netherlands RCT 137/141 Carotenoids Dietary intake assessment β Lower dietary β-carotene linked with higher cervical dysplasia risk. Gonzalez et al. ( 66 Case–control Tomatoes and fruits Dietary intake self-reported FFQ Vitamins C, E, retinol, β-carotene, folate Higher intake of vitamin C, retinol, and folate inversely associated with cervical cancer risk; suggests protective role against HPV-related inflammation. Cuzik et al. ( 67 London case–control 121/241 Fruits and leafy vegetables Observational dietary/lifestyle assessment Vitamin A, C, folate Lower intake of folate and vitamin C associated with increased cervical cancer risk; indicates nutritional deficiencies may promote HPV persistence and inflammation. Harris et al. ( 68 UK Case control study 226/226 Carotenoids Observational blood and dietary vitamin A levels Vitamin A serum retinol and dietary intake No clear association between dietary vitamin A and cervical cancer; slight inverse trend in serum retinol but not statistically significant—limited support for anti-inflammatory role. Van Eenwyk et al. ( 69 USA Case control study 102/102 Carotenoids Observational dietary intake and serum analysis β-carotene, lutein, lycopene, other carotenoids Lower serum carotenoid levels especially β-carotene and lutein associated with higher risk of CIN; suggests carotenoids may reduce HPV-induced oxidative stress and inflammation. dE Vet et al. ( 65 USA Case control study 50/100 Carotenoids Dietary intake assessment β-Carotene and dietary factors Lower β-Carotene intake linked with higher cervical dysplasia risk. Potischman et al. ( 70 USA Case control study 67/387 Carotenoids Serologic nutrient indicators Various nutrients Lower serum nutrient levels linked to invasive cervical cancer risk. Verreault et al. ( 71 USA Cervical 189/227 Vegetables, fruits, and dark green and yellow None Observational Multiple nutrients including vitamins and antioxidants Diet quality associated with invasive cervical cancer risk; certain nutrients may modulate HPV-related inflammation and carcinogenesis. Giuliano et al. ( 72 China Cervical cancer 101/146 Veggies None Literature review Multiple nutrients including antioxidants, vitamins A, C, E Nutrients play a significant role in preventing cervical dysplasia and cancer, potentially through modulation of HPV infection and inflammation pathways. Rajkumar et al. ( 73 India Cervical cancer 205/213 Fruits and vegetables, green veggies, fresh tomatoes, carrots, and cruciferous None Observational No specific vitamin; focused on dietary habits and paan chewing Paan chewing and poor dietary habits associated with increased cervical carcinoma risk, potentially through HPV-related inflammation and carcinogenesis pathways. Atalah et al. ( 12 Chile case–control 170/340 Leafy veggies and carrots None Observational No specific vitamin or antioxidant Diet, smoking, and reproductive history were identified as risk factors for cervical cancer, suggesting nutrition’s influence on HPV-associated inflammatory pathways. Vecchia et al. ( 74 Italy case–control 392/392 Carrots, None Observational Vitamin A Low dietary vitamin A intake associated with increased risk of invasive cervical cancer, implicating vitamin A’s role in modulating HPV-associated inflammation and carcinogenesis. Larrinaga et al. ( 75 Uruguay case–control 53/208 Veggies None Observational Not specified Parity, sexual factors, and dietary habits associated with cervical cancer risk, indicating nutrition’s role in HPV-related inflammation and cancer development. Hwang et al. ( 76 Korea, Nested case–control 162/166 Fruits and vegetables None Observational Antioxidants and micronutrients in fruits and vegetables Higher fruit and vegetable intake associated with lower HPV viral load in high-risk HPV-positive women with cervical intraepithelial neoplasia, suggesting reduced HPV-related inflammation risk. Hirose et al. ( 77 Japan case–control 416/20,985 Carrots, green veggies, and fruits None Observational Vitamins A, C, E, and smoking status Smoking and low intake of vitamins A, C, E were associated with increased cervical cancer risk, suggesting their role in modulating HPV-associated inflammation and carcinogenesis, with age-specific effects. 3.1 Risk of bias across studies Since the included studies consist of a combination of study designs—such as randomized controlled trials (RCTs), case–control studies, cross-sectional analyses, and observational cohorts—the evaluation of risk of bias is essential ( Figure 4 6 8–10 11–13 Figure 4 Risk bias assessment and risk bias graph. Chart showing risk of bias assessments for multiple studies, categorized into three sections (A, B, C). Each study is evaluated across seven domains (D1-D7) with symbols for low (green), unclear (yellow), and high risk (red). A bar chart below visualizes the distribution of bias risk for each domain. 3.2 Robustness of findings Several sensitivity analyses and statistical considerations were employed to assess the robustness of the findings: When subgroup analyses were conducted—separating RCTs from observational studies, the overall direction of the effect was consistent. This uniformity indicates that the overall conclusions are not being dictated by the specific bias of any one-study design. Sensitivity analyses removing studies sequentially with extreme effect size or very wide confidence intervals did not significantly change the pooled effect estimate. This shows that outlier studies are not inappropriately inflating the overall results. By excluding studies that are ranked at increased risk of bias according to quality assessments (e.g., low quality in selection or measurement), meta-analyses provided similar effect estimates. 3.3 Subgroup study comparisons 3.3.1 Vitamin E Eight studies from China, Brazil, and the USA, that involved 2,003 women, for a discussion of the protective effects of vitamin E and related antioxidants toward HPV-associated inflammation and cervical neoplasia were reviewed. Most studies had case–control or cross-sectional designs, with dietary intakes taken by food frequency questionnaires (FFQ) or serum/plasma antioxidant levels. Throughout studies, increased intake of vitamin E (specifically α 2 Figure 5 Figure 5 Forest plot of studies about vitamin E. Forest plot showing standardized mean differences (IV, Fixed, 95% CI) from various studies: Guo et al. 2015, Zhang et al. 2015, Tomita et al. 2010, Ghosh et al. 2008, Siegel et al. 2007, Palan et al. 2004 and 2003, and Goodman et al. 2007. Each study is represented by a black dot with horizontal lines indicating confidence intervals, and a red diamond represents the pooled effect. The results are detailed with weights, total counts, and calculated differences. Statistical measures for heterogeneity and overall effect significance (p < 0.0001) are provided. 3.3.2 Vitamin D Five Iranian, Turkish, German, and Japanese studies, totaling 727 women, investigated the impact of vitamin D on HPV-related outcomes. Two Iranian randomized controlled trials proved that vitamin D3 supplementation with a high dose (50,000 IU twice a week) could effectively prevent the recurrence of CIN 2/3 and induce lesion regression. Other studies showed that deficiency in vitamin D was linked with persistent HPV infection, while vaginal suppository use and higher dietary intake were linked with improved lesion clearance. A meta-analysis showed a pooled SMD of 0.81 (95% CI: 0.69–0.93) with no heterogeneity (I 2 Figure 6 Figure 6 Forest plot of studies about vitamin D. Forest plot showing standardized mean differences from five studies. Each study is listed with its total number of participants and confidence intervals. The overall effect size is 0.81 with a 95% confidence interval of 0.69 to 0.93. The heterogeneity test indicates low heterogeneity with an I² of zero percent. 3.3.3 Vitamin C This subgroup analysis shows vitamin C’s is probably most protective role in the treatment of HPV-associated inflammation and cervical disease. Several cross-sectional and case–control studies in various populations have consistently found an inverse relationship between vitamin C levels and HPV persistence. Reduced of vitamin C levels in the daily diet intake or serum have been linked to HPV infection, oxidative stress, and cervical cancer. The meta-analysis’s standardized mean differences indicated a statistically significant overall effect ( p 2 Figure 7 Figure 7 Forest plot of about studies vitamin C. Forest plot and table displaying standardized mean differences from seven studies on the left. Each study's total sample size, mean difference, and confidence interval are listed. The forest plot on the right illustrates effect sizes and confidence intervals, with a heterogeneity measure indicating significant variance among studies. The overall effect test is significant with a P-value less than 0.0001. 3.3.4 Vitamin A Evidence from the six studies that were case–control suggests a protective role of vitamin A against HPV-related cervical disease. Across diverse populations, higher dietary or serum vitamin A levels were consistently associated with reduced risk of cervical cancer and HPV persistence. The meta-analysis showed a significant overall effect (SMD = 0.77; p 2 Figure 8 Figure 8 Forest plot of studies about vitamin A. Forest plot showing standardized mean differences (IV, fixed, 95% CI) for various studies. Each study's data includes EIN and EN totals, weights, and standard mean differences with confidence intervals. The pooled result is marked with a red diamond, indicating an overall effect size of 0.77 [0.68, 0.87]. Heterogeneity statistics include Chi-square, degrees of freedom, I-squared, and P-values. The plot suggests a significant overall effect with low heterogeneity. 3.3.5 Vitamin B12 and folate The protective effects of folate and vitamin B12 against HPV-associated inflammation is highlighted in this subgroup analysis. Across four studies (USA and Costa Rica), higher circulating or dietary folate and B12 levels were consistently associated with reduced HPV persistence and lower cervical dysplasia risk. Meta-analysis resulted in a pooled standardized mean difference of 0.80 [95% CI: 0.65, 0.95] with no heterogeneity (Chi 2 p 2 p 2 p Figures 9 10 Figure 9 Forest plot of studies about vitamin B12 and folate. Forest plot comparing standardized mean differences across four studies. Each study lists total participants, weight percentage, and standardized mean difference with confidence intervals. Results show varying effect sizes. Piyathilake et al. 2009 and 2014, Sedjo et al. 2002, and Herrero et al. 1991 are included. Overall chi-squared: 1.05, P-value: 0.79. Figure 10 Funnel plots of the included nutrients. (a) (b) (c) (d) (e) Five funnel plots illustrate the standard error versus effect size for various vitamins: (a) Vitamin D effect, (b) Vitamin C protective role, (c) Vitamin E protective role, (d) Vitamin A protective role, (e) Vitamin B12 and folate protective role. Each plot has a triangular shape formed by dashed lines with data points scattered within, indicating study distribution. Greater amounts or consumption of vitamins E, D, C, A, B12, and folate have a strong connection to lower HPV perseverance and cervical risk factors confirmed by the subgroup analyses. Effect sizes fluctuate between SMD 0.46 to 0.81, and heterogeneity is typically low (I 2 2 Table 12 Table 12 Summary of findings. Nutrient Studies included Sample size Findings Effect Estimate (SMD [95% CI]) Heterogeneity (I 2 Certainty of evidence (GRADE) Vitamin C 7+ Mixed Lower intake linked to increased chance of cancer and oxidative stress ( p 97.45% Low to moderate Vitamin A 6 1,246 Reduced risk of cervical cancer 0.77 [0.68, 0.87]; p 16.6% Moderate Vitamin E 8 2,003 Lowered HPV persistence and CIN 0.46 (95% CI: 0.36–0.57) 21.3% Moderate Vitamin D 5 727 Regression of CIN2/3 lesion and reduction of inflammatory markers 0.81 (95% CI: 0.69–0.93) 0% High Vitamin B12 and folate 4 1,130 Lowered HPV persistence and CIN progression 0.80 [95% CI: 0.65, 0.95] 0% High 4 Meta-regression Extremely significant heterogeneity was found in the vitamin C assessment (I 2 F p β p β p β p F p p p 2 5 Discussion In order to examine the effect of micronutrient consumption on HPV perseverance and HPV-related inflammatory processes, this systematic review and meta-analysis combined information from 75 studies, encompassing cohort, case–control, cross-sectional, and randomized controlled trials (RCTs). The results show an ongoing association between decreased HPV persistence, decreased likelihood of cervical intraepithelial neoplasia (CIN), and weakened inflammation thanks to adequate intake of vitamins A, C, D, and E, as well as carotenoids and trace minerals like zinc and selenium. Considering the established effects of these micronutrients in immunological regulation, antioxidant defense, and epithelial integrity, these correlations make biological sense. However, it has been observed that there are differing levels of uniformity and quality of data regarding the relationship between multiple micronutrients and the possibility of cervical cancer, CIN development, and HPV recurrence. The most frequently supported nutrient, for example, is vitamin D, which has solid proof derived from observational investigations and randomized controlled trials (RCTs). Vitamin D improves the strength of the epithelial barrier by triggering antibacterial peptides and modifies immune system reactions through cytokine modulation ( 9 10 14 15 Likewise, vitamin C exhibits beneficial connections as well, however there is significant variation among research. Although its function as an immune-enhancing agent and fluid-soluble antioxidant is widely recognized, the lack of RCT information and the variation in nutritional methods of evaluation make the findings less reliable ( 2 5 16 17 Besides vitamin D, folate and vitamin B12 have the most reliable and convincing favorable connections. According to Zhao et al. ( 4 6 Finally, the data supporting calcium and vitamin K is of comparatively lower standard. Although calcium is thought to have a function in preserving integrity of epithelial cells and controlling cell growth, results from observational research are contradictory, and RCTs have not confirmed this theory. With observational studies connecting lower consumption to increased HPV latency and CIN risk, vitamin K is becoming recognized as a possible preventative agent ( 18 19 5.1 Strengths and limitations This meta-analysis and systematic review have a number of strengths. It provides a thorough assessment of the connection between dietary intake and HPV-associated inflammation by combining findings from a variety of research methodologies, including cohort, case–control, randomized controlled trials, and cross-sectional studies. External validity is improved and evaluation across different food patterns and sociodemographic situations is made possible by the inclusion of more than 70 research from various geographic locations. Nonetheless, it is necessary to recognize certain constraints. Major drawbacks among the research investigations included are variations in HPV detection procedures and dietary assessments approaches, such as the utilization of food frequency questionnaires (FFQs) vs. blood biomarker testing. Residual confounding is of concern in observational studies, especially because of varied lifestyle or biological factors that may affect HPV results and dietary habits. Furthermore, particular subgroups may exhibit heterogeneity due to variations in results evaluation and reporting, baseline dietary inadequacies, or inconsistent nutrient composition (e.g., vitamin C assessment, which had an I 2 5.2 Implications for practice and policy The results are evidently applicable to clinical and public health: Clinical application: In the treatment of women with HPV, specifically those with inferior CIN or long-term infection, nutritional assessment and customized supplements may be utilized as adjuvant therapy. Clinicians should think about prescribing vitamin D, folate, and selenium supplements in the right therapeutic settings because of their proven efficacy in clinical trials. Public health interventions: An affordable way of minimizing HPV load and prevalence of cervical cancer in low-resource environments where cytology-based detection and HPV vaccine are still scarce is to improve population-level eating habits and fortify essential micronutrients. The fact that this analysis is worldwide in scope—from Nigeria to China to Iran—highlights how relevant these results are worldwide. Future research: Trials assessing multi-nutrient therapies with immunological and genomic outcomes as well as large longitudinal cohort investigations with harmonized diagnostic evaluations should be the main focus of future research. 6 Conclusion This meta-analysis suggest how important nutrition is, particularly micronutrients, in controlling inflammation linked to HPV and the likelihood of cervical neoplasia. Higher consumption of vitamins A, C, D, and E, as well as trace minerals and carotenoids, seems to promote epithelial health and immunological function, which reduces HPV persistence. As part of a comprehensive strategy for cervical health and HPV prevention, these findings highlight the need of maintaining optimal nutritional status. The findings suggest that public health initiatives aimed at high prevalence HPVs and undernourished communities should employ nutritional education and diet supplementation programs since food intake is a modifiable factor. Even though the data remains valid across study designs and biologically plausible, more longitudinal studies and randomized controlled trials are needed to confirm the causative inference and refine dosage recommendations for particular nutrients. Data availability statement The raw data supporting the conclusions of this article will be made available by the authors, without undue reservation. Author contributions YL: Writing – original draft, Supervision. LZ: Project administration, Data curation, Writing – review & editing. Conflict of interest The authors declare that the research was conducted in the absence of any commercial or financial relationships that could be construed as a potential conflict of interest. Generative AI statement The authors declare that no Gen AI was used in the creation of this manuscript. Any alternative text (alt text) provided alongside figures in this article has been generated by Frontiers with the support of artificial intelligence and reasonable efforts have been made to ensure accuracy, including review by the authors wherever possible. If you identify any issues, please contact us. Publisher’s note All claims expressed in this article are solely those of the authors and do not necessarily represent those of their affiliated organizations, or those of the publisher, the editors and the reviewers. Any product that may be evaluated in this article, or claim that may be made by its manufacturer, is not guaranteed or endorsed by the publisher. References 1. Nagata C Shimizu H Yoshikawa H Noda K Nozawa S Yajima A Serum carotenoids and vitamins and risk of cervical dysplasia from a case–control study in Japan Br J Cancer 1999 81 1234 7 10.1038/sj.bjc.6690834 10584887 PMC2374334 2. Barchitta M Maugeri A Quattrocchi A Agrifoglio O Scalisi A Agodi A The association of dietary patterns with high-risk human papillomavirus infection and cervical cancer: a cross-sectional study in Italy Nutrients 2018 10 469 10.3390/nu10040469 29641467 PMC5946254 3. Piyathilake CJ Macaluso M Alvarez RD Bell WC Heimburger DC Partridge EE Lower risk of cervical intraepithelial neoplasia in women with high plasma folate and sufficient vitamin B12 in the post-folic acid fortification era Cancer Prev Res 2009 2 658 64 10.1158/1940-6207.CAPR-08-0175 19542191 PMC4737591 4. Zhao W Hao M Wang Y Feng N Wang Z Wang W Association between folate status and cervical intraepithelial neoplasia Eur J Clin Nutr 2016 70 837 42 10.1038/ejcn.2016.35 27026426 PMC4940925 5. Zheng C Zheng Z Chen W Association between serum vitamin C and HPV infection in American women: a cross-sectional study BMC Womens Health 2022 22 404 10.1186/s12905-022-01993-7 36199060 PMC9533549 6. Ayatollahi H Rajabi E Yekta Z Jalali Z Efficacy of oral zinc sulfate supplementation on clearance of cervical human papillomavirus (HPV); a randomized controlled clinical trial Asian Pac J Cancer Prev 2022 23 1285 90 10.31557/APJCP.2022.23.4.1285 35485687 PMC9375629 7. Obhielo E Ezeanochie M Okonkwo A Gharoro E The relationship between the serum level of selenium and cervical intraepithelial neoplasia: a comparative study in a population of Nigerian women Asian Pac J Cancer Prev 2019 20 1433 6 10.31557/APJCP.2019.20.5.1433 31127904 PMC6857890 8. Asemi Z Vahedpoor Z Jamilian M Bahmani F Esmaillzadeh A Effects of long-term folate supplementation on metabolic status and regression of cervical intraepithelial neoplasia: a randomized, double-blind, placebo-controlled trial Nutrition 2016 32 681 6 10.1016/j.nut.2015.12.028 26853484 9. Vahedpoor Z Jamilian M Bahmani F Aghadavod E Karamali M Kashanian M Effects of long-term vitamin D supplementation on regression and metabolic status of cervical intraepithelial neoplasia: a randomized, double-blind, placebo-controlled trial Hormones Cancer 2017 8 58 67 10.1007/s12672-016-0278-x 28050798 PMC10355858 10. Vahedpoor Z Mahmoodi S Samimi M Gilasi HR Bahmani F Soltani A Long-term vitamin D supplementation and the effects on recurrence and metabolic status of cervical intraepithelial neoplasia grade 2 or 3: a randomized, double-blind, placebo-controlled trial Ann Nutr Metab 2018 72 151 60 10.1159/000487270 29466786 11. Abike F Engin AB Dunder I Tapisiz OL Aslan C Kutluay L Human papilloma virus persistence and neopterin, folate and homocysteine levels in cervical dysplasias Arch Gynecol Obstet 2011 284 209 14 10.1007/s00404-010-1650-7 20740364 12. Atalah E Urteaga C Rebolledo A Villegas RA Medina E Csendes A Diet, smoking and reproductive history as risk factors for cervical cancer Rev Med Chile 2001 129 597 603 11510198 13. Chen C Hwang J Kuo T Hsieh C Huang S Serum copper and zinc levels in patients with cervical cancer J Formosan Med Assoc 1990 89 677 82 1981230 14. Ghosh C Baker JA Moysich KB Rivera R Brasure JR McCann SE Dietary intakes of selected nutrients and food groups and risk of cervical cancer Nutr Cancer 2008 60 331 41 10.1080/01635580701861769 18444167 15. Siegel EM Craft NE Duarte-Franco E Villa LL Franco EL Giuliano AR Associations between serum carotenoids and tocopherols and type-specific HPV persistence: the Ludwig-McGill cohort study Int J Cancer 2007 120 672 80 10.1002/ijc.22346 17096322 PMC3458424 16. Kim JH Bae SN Lee CW Song MJ Lee SJ Yoon JH A pilot study to investigate the treatment of cervical human papillomavirus infection with zinc-citrate compound (CIZAR®) Gynecol Oncol 2011 122 303 6 10.1016/j.ygyno.2011.04.026 21605892 17. Shimizu H Nagata C Komatsu S Morita N Higashiiwai H Sugahara N Decreased serum retinol levels in women with cervical dysplasia Br J Cancer 1996 73 1600 4 10.1038/bjc.1996.301 8664137 PMC2074538 18. Jiang Y Xu S Lan J Zhang J Chen T Dietary vitamin K intake and HPV-infection status among American women: a secondary analysis from national health and nutrition examination survey data from 2003 to 2016 Int J Public Health 2022 67 1604616 10.3389/ijph.2022.1604616 36090836 PMC9448852 19. Wang Z Yang A Yang J Zhao W Wang Z Wang W Dietary nutrient intake related to higher grade cervical intraepithelial neoplasia risk: a Chinese population-based study Nutr Metab 2020 17 1 14 10.1186/s12986-020-00521-4 33292305 PMC7708219 20. Guo L Zhu H Lin C Che J Tian X Han S Associations between antioxidant vitamins and the risk of invasive cervical cancer in Chinese women: a case-control study Sci Rep 2015 5 13607 10.1038/srep13607 26337940 PMC4559762 21. Zhang Y-Y Lu L Abliz G Mijit F Serum carotenoid, retinol and tocopherol concentrations and risk of cervical cancer among Chinese women Asian Pac J Cancer Prev 2015 16 2981 6 10.7314/APJCP.2015.16.7.2981 25854393 22. Tomita LY Filho AL Costa MC Andreoli MAA Villa LL Franco EL Diet and serum micronutrients in relation to cervical neoplasia and cancer among low-income Brazilian women Int J Cancer 2010 126 703 14 19642096 10.1002/ijc.24793 23. Palan PR Woodall AL Anderson PS Mikhail MS Α-Tocopherol and α-tocopheryl quinone levels in cervical intraepithelial neoplasia and cervical cancer Am J Obstet Gynecol 2004 190 1407 10 10.1016/j.ajog.2004.01.067 15167851 24. Palan P Mikhail M Shaban D Romney S Plasma concentrations of coenzyme Q10 and tocopherols in cervical intraepithelial neoplasia and cervical cancer Eur J Cancer Prev 2003 12 321 6 10.1097/00008469-200308000-00013 12883386 25. Goodman MT Shvetsov YB McDuffie K Wilkens LR Zhu X Franke AA Hawaii cohort study of serum micronutrient concentrations and clearance of incident oncogenic human papillomavirus infection of the cervix Cancer Res 2007 67 5987 96 10.1158/0008-5472.CAN-07-0313 17553901 26. Özgü E Yılmaz N Başer E Güngör T Erkaya S İbrahim Yakut H Could 25-OH vitamin D deficiency be a reason for HPV infection persistence in cervical premalignant lesions? J Exp Ther Oncol 2016 11 177 80 28471122 27. Schulte-Uebbing C Schlett S Craiut I Antal L Olah H Chronical cervical infections and dysplasia (CIN I, CIN II): vaginal vitamin D (high dose) treatment: a new effective method? Dermatoendocrinol 2014 6 e983684 10.4161/derm.27791 24605180 PMC3940490 28. Hosono S Matsuo K Kajiyama H Hirose K Suzuki T Kawase T Association between dietary calcium and vitamin D intake and cervical carcinogenesis among Japanese women Eur J Clin Nutr 2010 64 400 9 10.1038/ejcn.2010.28 20197786 29. Naidu MSK Suryakar A Swami SC Katkam R Kumbar K Oxidative stress and antioxidant status in cervical cancer patients Indian J Clin Biochem 2007 22 140 4 10.1007/BF02913333 23105702 PMC3453822 30. Giuliano AR Siegel EM Roe DJ Ferreira S Luiza Baggio M Galan L Dietary intake and risk of persistent human papillomavirus (HPV) infection: the Ludwig-McGill HPV natural history study J Infect Dis 2003 188 1508 16 10.1086/379197 14624376 31. Shannon J Thomas DB Ray RM Kestin M Koetsawang A Koetsawang S Dietary risk factors for invasive and in-situ cervical carcinomas in Bangkok, Thailand Cancer Causes Control 2002 13 691 9 10.1023/A:1020289618161 12420947 32. Herrero R Potischman N Brinton LA Reeves WC Brenes MM Tenorio F A case-control study of nutrient status and invasive cervical cancer: I. Dietary indicators Am J Epidemiol 1991 134 1335 46 1755447 10.1093/oxfordjournals.aje.a116036 33. Ziegler RG Jones CJ Brinton LA Norman SA Mallin K Levine RS Diet and the risk of in situ cervical cancer among white women in the United States Cancer Causes Control 1991 2 17 29 10.1007/BF00052357 1873430 34. Brock K Berry G Mock P MacLennan R Truswell A Brinton L Nutrients in diet and plasma and risk of in situ cervical cancer JNCI J Natl Cancer Inst 1988 80 580 5 10.1093/jnci/80.8.580 3373548 35. Huang X Chen C Zhu F Zhang Y Feng Q Li J Association between dietary vitamin a and HPV infection in American women: data from NHANES 2003–2016 Biomed Res Int 2020 2020 4317610 10.1155/2020/4317610 32420341 PMC7201492 36. Eleutério J Giraldo PC Gonçalves AK Eleutério RMN Barbosa R d CC Cavalcante DIM The risk of high-grade squamous intraepithelial lesions in women with low serum levels of vitamin a Gynecol Obstet Investig 2014 78 235 8 10.1159/000363741 25171088 37. Yeo AS Schiff MA Montoya G Masuk M van Asselt-King L Becker TM Serum micronutrients and cervical dysplasia in southwestern American Indian women Nutr Cancer 2000 38 141 50 11525590 10.1207/S15327914NC382_1 38. Karamali M Nourgostar S Zamani A Vahedpoor Z Asemi Z The favourable effects of long-term selenium supplementation on regression of cervical tissues and metabolic profiles of patients with cervical intraepithelial neoplasia: a randomised, double-blind, placebo-controlled trial Br J Nutr 2015 114 2039 45 10.1017/S0007114515003852 26439877 39. Cunzhi H Jiexian J Xianwen Z Jingang G Shumin Z Lili D Serum and tissue levels of six trace elements and copper/zinc ratio in patients with cervical cancer and uterine myoma Biol Trace Elem Res 2003 94 113 22 10.1385/BTER:94:2:113 12958402 40. Xiao D Li W Zhang W-H Wen Z Dai B Mo W Dietary zinc, copper, and selenium intake and high-risk human papillomavirus infection among American women: data from NHANES 2011–2016 Nutr Cancer 2022 74 1958 67 10.1080/01635581.2021.1979603 34553663 41. Sundström H Annual variation of serum selenium in patients with gynaecological cancer during 1978-1983 in Finland, a low selenium area Int J Vit Nutr Res 1985 55 433 8 4086214 42. Hwang JH Kim MK Lee JK Dietary supplements reduce the risk of cervical intraepithelial neoplasia Int J Gynecol Cancer 2010 20 398 403 10.1111/IGC.0b013e3181d02ff2 20375804 43. Siegel EM Patel N Lu B Lee J-H Nyitray AG Huang X Circulating biomarkers of iron storage and clearance of incident human papillomavirus infection Cancer Epidemiol Biomarkers Prev 2012 21 859 65 10.1158/1055-9965.EPI-12-0073 22426142 PMC3709556 44. He A-J Chen C Jia M Fan R-Q Dietary calcium intake and HPV infection status among American women: a secondary Analysis from National Health and nutrition examination survey (NHANES) data set of 2003–2016 Med Sc Monit 2020 26 e921571 1 10.12659/MSM.921571 32378682 PMC7233009 45. Sengupta A Mallick R Dutta S Sarkar R Serum calcium level in patients with carcinoma of the cervix in relation to menstrual status Eur J Gynaecol Oncol 1989 10 153 5 2721524 46. Grail A Norval M Copper and zinc levels in serum from patients with abnormalities of the uterine cervix Acta Obstet Gynecol Scand 1986 65 443 7 10.3109/00016348609157381 3776486 47. Liu T Soong S Wilson NP Craig CB Cole P Macaluso M A case control study of nutritional factors and cervical dysplasia Cancer Epidemiol Biomarkers Prev 1993 2 525 30 8268768 48. Li Q Ding L Jing N Liu C Yang Z Chen F Folate deficiency and aberrant DNA methylation and expression of FHIT gene were associated with cervical pathogenesis Oncol Lett 2018 15 1963 72 10.3892/ol.2017.7471 29434897 PMC5774424 49. Sabihi S Vahedpoor Z Saraf-Bank S Nourian M Effects of folate supplementation on recurrence and metabolic status of cervical intraepithelial neoplasia grade 2/3 in overweight and obese women: a randomized double-blind placebo-controlled trial Eur J Clin Nutr 2022 76 666 70 10.1038/s41430-021-01022-0 35383339 50. Piyathilake CJ Macaluso M Chambers MM Badiga S Siddiqui NR Bell WC Folate and vitamin B12 may play a critical role in lowering the HPV 16 methylation–associated risk of developing higher grades of CIN Cancer Prev Res 2014 7 1128 37 10.1158/1940-6207.CAPR-14-0143 25145486 PMC4711818 51. Bai L-X Wang J-T Ding L Jiang S-W Kang H-J Gao C-F Folate deficiency and FHIT hypermethylation and HPV 16 infection promote cervical cancerization Asian Pac J Cancer Prev 2014 15 9313 7 10.7314/APJCP.2014.15.21.9313 25422218 52. Ragasudha PN Thulaseedharan JV Wesley R Jayaprakash P Lalitha P Pillai MR A case-control nutrigenomic study on the synergistic activity of folate and vitamin B12 in cervical cancer progression Nutr Cancer 2012 64 550 8 10.1080/01635581.2012.675618 22519865 53. Wang J Ma X Cheng Y Ding L Zhou Q A case-control study on the association between folate and cervical cancer Zhonghua liu xing bing xue za zhi 2006 27 424 7 16981341 54. Hernandez BY McDuffie K Wilkens LR Kamemoto L Goodman MT Diet and premalignant lesions of the cervix: evidence of a protective role for folate, riboflavin, thiamin, and vitamin B 12 Cancer Causes Control 2003 14 859 70 10.1023/B:CACO.0000003841.54413.98 14682443 55. Fujii T Takatsuka N Nagata C Matsumoto K Oki A Furuta R Association between carotenoids and outcome of cervical intraepithelial neoplasia: a prospective cohort study Int J Clin Oncol 2013 18 1091 101 10.1007/s10147-012-0486-5 23095878 56. Peterson CE Sedjo RL Davis FG Beam CA Giuliano AR Combined antioxidant carotenoids and the risk of persistent human papillomavirus infection Nutr Cancer 2010 62 728 33 10.1080/01635581003693074 20661820 57. Tomita LY Roteli-Martins CM Villa LL Franco EL Cardoso MA Associations of dietary dark-green and deep-yellow vegetables and fruits with cervical intraepithelial neoplasia: modification by smoking Br J Nutr 2011 105 928 37 10.1017/S0007114510004447 21092390 58. Sedjo RL Papenfuss MR Craft NE Giuliano AR Effect of plasma micronutrients on clearance of oncogenic human papillomavirus (HPV) infection (United States) Cancer Causes Control 2003 14 319 26 10.1023/A:1023981505268 12846362 59. Sedjo RL Roe DJ Abrahamsen M Harris RB Craft N Baldwin S Vitamin a, carotenoids, and risk of persistent oncogenic human papillomavirus infection Cancer Epidemiol Biomarkers Prev 2002 11 876 84 12223432 60. Schiff MA Patterson RE Baumgartner RN Masuk M van Asselt-King L Wheeler CM Serum carotenoids and risk of cervical intraepithelial neoplasia in southwestern American Indian women Cancer Epidemiol Biomarkers Prev 2001 10 1219 22 11700272 61. Palan PR Mikhail MS Goldberg GL Basu J Runowicz CD Romney SL Plasma levels of beta-carotene, lycopene, canthaxanthin, retinol, and alpha-and tau-tocopherol in cervical intraepithelial neoplasia and cancer Clin Cancer Res 1996 2 181 5 9816105 62. Kanetsky PA Gammon MD Mandelblatt J Zhang ZF Ramsey E Dnistrian A Dietary intake and blood levels of lycopene: association with cervical dysplasia among non-hispanic, black women Nutr Cancer 1998 31 31 40 10.1080/01635589809514675 9682246 63. Romney SL Ho GY Palan PR Basu J Kadish AS Klein S Effects of β-carotene and other factors on outcome of cervical dysplasia and human papillomavirus infection Gynecol Oncol 1997 65 483 92 9190980 10.1006/gyno.1997.4697 64. De Vet HC Knipschild PG Grol ME Schouten HJ Sturmans F The role of beta-carotene and other dietary factors in the aetiology of cervical dysplasia: results of a case-control study Int J Epidemiol 1991 20 603 10 1659558 10.1093/ije/20.3.603 65. dE Vet HC Knipschild PG Willebrand D Schouten HJ Sturmans F The effect of beta-carotene on the regression and progression of cervical dysplasia: a clinical experiment J Clin Epidemiol 1991 44 273 83 1999687 10.1016/0895-4356(91)90039-c 66. Gonzalez CA Travier N Luján-Barroso L Castellsague X Bosch FX Roura E Dietary factors and in situ and invasive cervical cancer risk in the European prospective investigation into cancer and nutrition study Int J Cancer 2011 129 449 59 10.1002/ijc.25679 20853322 67. Cuzick J Sasieni P Singer A Risk factors for invasive cervix cancer in young women Eur J Cancer 1996 32 836 41 10.1016/0959-8049(95)00650-8 9081363 68. Harris R Forman D Doll R Vessey M Wald N Cancer of the cervix uteri and vitamin a Br J Cancer 1986 53 653 9 10.1038/bjc.1986.109 3718822 PMC2001384 69. Van Eenwyk J Davis FG Bowen PE Dietary and serum carotenoids and cervical intraepithelial neoplasia Int J Cancer 1991 48 34 8 10.1002/ijc.2910480107 2019456 70. Potischman N Herrero R Brinton LA Reeves WC Stacewicz-Sapuntzakis M Jones CJ A case-control study of nutrient status and invasive cervical cancer: II. Serologic indicators Am J Epidemiol 1991 134 1347 55 1755448 10.1093/oxfordjournals.aje.a116037 71. Verreault R Chu J Mandelson M Shy K A case-control study of diet and invasive cervical cancer Int J Cancer 1989 43 1050 4 10.1002/ijc.2910430616 2731999 72. Giuliano AR The role of nutrients in the prevention of cervical dysplasia and cancer Nutrition 2000 16 570 3 10.1016/S0899-9007(00)00338-5 10906559 73. Rajkumar T Franceschi S Vaccarella S Gajalakshmi V Sharmila A Snijders P Role of paan chewing and dietary habits in cervical carcinoma in Chennai, India Br J Cancer 2003 88 1388 93 10.1038/sj.bjc.6600902 12778066 PMC2741039 74. Vecchia CL Franceschi S Decarli A Gentile A Fasoli M Pampallona S Dietary vitamin a and the risk of invasive cervical cancer Int J Cancer 1984 34 319 22 10.1002/ijc.2910340306 6548203 75. Larrinaga M Lateulade S Balbi JC Mendilaharsu M Fierro L De Stefani E Paridad, factores sexuales y riesgo de cáncer de cérvix uterino Arch Med Interna. (Montevideo) 1990 139 45 76. Hwang JH Lee JK Kim TJ Kim MK The association between fruit and vegetable consumption and HPV viral load in high-risk HPV-positive women with cervical intraepithelial neoplasia Cancer Causes Control 2010 21 51 9 10.1007/s10552-009-9433-9 19777358 77. Hirose K Hamajima N Takezaki T Kuroishi T Kuzuya K Sasaki S Smoking and dietary risk factors for cervical cancer at different age group in Japan J Epidemiol 1998 8 6 14 10.2188/jea.8.6 9575689 ",
  "metadata": {
    "Title of this paper": "Smoking and dietary risk factors for cervical cancer at different age group in Japan",
    "Journal it was published in:": "Frontiers in Nutrition",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12490988/"
  }
}