{
  "title": "Paper_225",
  "abstract": "pmc CNS Neurosci Ther CNS Neurosci Ther 3640 cnsneurosci CNS CNS Neuroscience & Therapeutics 1755-5930 1755-5949 Wiley PMC12491777 PMC12491777.1 12491777 12491777 41039850 10.1111/cns.70603 CNS70603 CNSNT-2025-825 1 Original Article Original Article A Drug Delivery to Improve Prognosis of Traumatic Brain Injury Mice Through Mouse‐Derived Nerve Growth Factor Coated by a Nanoparticle Zhao Ruichen  1 zhaoruichen121797@163.com Dong Shiying  1 Wu Di  1 Tian Yu  1 Yuan Jiangyuan https://orcid.org/0000-0001-6548-5131  1 Mi Liang  1 Wu Chenrui  1 Tong Shiao  1 Jiang Rongcai  1  2 jiang116216@163.com   1 Department of Neurosurgery Tianjin Medical University General Hospital Tianjin China   2 Department of Neurosurgery, Xuanwu Hospital Capital Medical University Beijing China * Correspondence: zhaoruichen121797@163.com jiang116216@163.com 02 10 2025 10 2025 31 10 497992 10.1111/cns.v31.10 e70603 01 8 2025 01 4 2025 02 9 2025 02 10 2025 04 10 2025 04 10 2025 © 2025 The Author(s). CNS Neuroscience & Therapeutics https://creativecommons.org/licenses/by/4.0/ This is an open access article under the terms of the http://creativecommons.org/licenses/by/4.0/ ABSTRACT Objective The large molecular weight and limited permeability of mouse‐derived nerve growth factor (mNGF) across the blood–brain barrier (BBB) have restricted its therapeutic use after brain injury. We therefore hypothesized that encapsulating mNGF in nanoparticles would facilitate BBB transit, increase delivery to the brain parenchyma, and consequently improve the treatment of traumatic brain injury (TBI). Methods Nanoparticles were used to encapsulate the high‐molecular‐weight protein mNGF to improve its delivery. Traumatic brain injury (TBI) was induced in mice, which were then allocated to four groups, including a sham group. Intramuscular injections of mNGF—either free or nanoparticle‐encapsulated—were administered. To elucidate the mechanism of action, the aquaporin‐4 inhibitor 2‐nicotinamide‐1,3,4‐thiadiazole (TGN‐020) was additionally given to the nanoparticle group. Glymphatic function (cerebrospinal fluid influx and efflux) was quantified by immunofluorescence. Blood–brain barrier integrity, peri‐lesional parenchymal structure, and axonal repair were examined using Evans blue extravasation, immunofluorescence, and Western blotting. Neuronal apoptosis and focal neurological damage were measured with TUNEL staining and Western blot analysis. Functional outcomes were assessed with the modified Neurological Severity Score, rotarod performance, and the Morris water maze. Results Nanoparticle encapsulation markedly increased the amount of mNGF that reached the brain parenchyma relative to conventional administration. Enhanced delivery enabled substantially more exogenous mNGF to traverse the BBB in TBI mice than did uncoated mNGF. The treatment attenuated TBI‐induced neuronal apoptosis, up‐regulated genes involved in neurogenesis and myelinogenesis, restored glymphatic inflow and outflow, repaired BBB structure and function, and mitigated cognitive deficits. These benefits were abolished by the aquaporin‐4 inhibitor TGN‐020, indicating that mNGF improves TBI outcome by correcting AQP4 dysfunction. To our knowledge, this is the first demonstration that nanocrystallized mNGF can cross the BBB efficiently after TBI and thereby foster neural repair and functional recovery. This study is the first to demonstrate that mNGF, when nanocrystallized, crosses the BBB more effectively in TBI mice, subsequently aiding the repair and functional recovery of the nervous system post‐injury. blood–brain barrier glymphatic system nerve growth factor traumatic brain injury National Natural Science Foundation of China 10.13039/501100001809 82071390 82271394 pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement yes pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes source-schema-version-number 2.0 cover-date October 2025 details-of-publishers-convertor Converter:WILEY_ML3GV2_TO_JATSPMC version:6.6.4 mode:remove_FC converted:03.10.2025  R. Zhao S. Dong D. Wu A Drug Delivery to Improve Prognosis of Traumatic Brain Injury Mice Through Mouse‐Derived Nerve Growth Factor Coated by a Nanoparticle CNS Neuroscience & Therapeutics 31 10 2025 e70603 10.1111/cns.70603 41039850  Funding: Ruichen Zhao, Shiying Dong and Di Wu contributed equally to this study. 1 Introduction Traumatic brain injury (TBI) is most often caused by road traffic accidents, sports trauma, combat violence, and accidental falls. These insults precipitate extensive neuronal loss, pronounced neuroinflammation, and subsequent cognitive decline [ 1 2 The glymphatic system, responsible for clearing metabolic waste, is vital for protecting the central nervous system (CNS) from toxic accumulation [ 3 4 5 6 7 NGF, a pivotal neurotrophic molecule, has been administered directly in clinical trials for TBI treatment [ 8 9 10 11 N‐Butyl cyanoacrylate (NBCA), widely used as a surgical tissue adhesive, has also been investigated as a precursor for nanoparticle synthesis [ 12 13 14 2 Methods and Materials 2.1 Animals The ethics approval statement was labeled as No. IRB2025‐DW‐41. All procedures were approved by the Animal Care and Use Committee of Tianjin Medical University General Hospital and complied with the NIH Guide for the Care and Use of Laboratory Animals. Male C57BL/6 mice (HFK Bioscience Corporation) aged 8 to 12 weeks and weighing 20–25 g were housed under controlled conditions (temperature 18°C–22°C, relative humidity 50%–60%) with a 12‐h light/dark cycle and free access to food and water. 2.2 Preparation for PBCA Nanocarriers were synthesized as described previously [ 15 g 16 2.3 Production of Polysorbate 80‐Coated mNGF PBCA Commercial mNGF (NOBEX, SINOBIOWAY BIOMEDICINE CO.) was labeled with fluorescein isothiocyanate (FITC, green) to track the protein after delivery. Conjugation was performed in a mildly alkaline buffer, protected from light, for 4 h. Unbound FITC was removed by dialysis, followed by desalting to obtain FITC‐labeled mNGF. To load mNGF onto PBCA nanoparticles, 10 μg of purified mNGF was added to 1 mL of a 0.2 mg/mL PBCA suspension in normal saline, yielding a final mNGF concentration of 10 μg/mL. The mixture was stirred at room temperature for 15 min to promote adsorption to the nanoparticle surface. Prior studies indicate that polysorbate 80 enhances the CNS targeting of PBCA carriers [ 17 18 2.4 Drug Loading Capacity ( DL EE Encapsulation efficiency was determined by quantifying protein content. High‐performance liquid chromatography (HPLC) is widely used in plasma proteomics and plays a key role in diagnostics [ 19 2.5 Experiment Design and Drug Administration To evaluate the efficacy of PBCA‐mNGF, we used a controlled cortical impact (CCI) model of TBI in mice. Four groups were established—Sham, TBI + PBCA, TBI + mNGF, and TBI + PBCA‐mNGF. Ten mice per group were reserved for behavioral testing, and an additional six per group were used for histologic and biochemical analyses. TBI was induced with a digitally controlled impactor fitted with a 4‐mm flat tip (depth 2.2 mm, velocity 5 m/s, dwell time 200 ms) [ 20 1 5 21 FIGURE 1 NBCA monomer was extracted from surgical glue by liquid‐phase separation. The solution was neutralized to pH 7, yielding a turbid white suspension that was filtered through 0.8 μm paper to remove impurities; this filtrate was designated “Raw liquid” and stored at 4°C. After ultracentrifugation (16 g 2.6 Hematoxylin–Eosin ( HE HE staining was performed as described previously [ 22 2.7 Drug Concentration Quantification To verify drug levels in the CNS, optical density (OD) values in brain homogenates were measured with a microplate reader (Thermo Fisher Scientific, USA). Brain samples were collected as previously described [ 22 n 2.8 Primary BMEC To assess PBCA transport capacity, primary brain microvascular endothelial cells (BMECs) were cultured in Dulbecco's Modified Eagle Medium (DMEM) supplemented with 10% fetal bovine serum at 37°C in 5% CO 2 23 24 25 2.9 In Vivo Tissue‐Targeting Distribution Analysis In vivo biodistribution was evaluated as described earlier [ 26 2.10 Serum Stability Although PBCA's physicochemical stability is well documented [ 27 28 2.2 n 2.25 2.11 Drug Release Drug release was assessed as previously described [ 22 2.3 2.4 2.12 Cell Counting Kit‐8 ( CCK A CCK‐8 assay [ 29 2.13 Blood Biochemical Examination Blood chemistry was performed as reported previously [ 30 n 31 2.14 Intracisternal Tracer Infusions Lymphatic function was assessed by infusing a fluorescent tracer into the cerebrospinal fluid (CSF), as described previously [ 13 5 2.15 Intraparenchymal Injections Parenchymal efflux capacity was evaluated as reported previously [ 32 2.14 2.16  AQP4 AQP4 polarization was quantified by measuring immunofluorescence (IF) intensity in perivascular regions. Thresholding defined the percentage of vascular profiles whose AQP4 signal met or exceeded baseline (“AQP4 area %”). Depolarized regions were visualized, and polarization was calculated as: Polarization % = 100 − Depolarization % 2.17 Laser Speckle Imaging Cerebral blood flow (CBF) was measured 3 days after TBI with the PeriCam PSI system (Perimed AB, Sweden) following published methods [ 33 2.18  EB Blood–brain barrier integrity was evaluated using EB dye [ 34 2.19 IF IF staining followed standard protocols [ 35 2.20 Western Blot ( WB WB was performed as previously described. Target proteins included zonula occludens‐1 (ZO‐1, 220 kDa), occludin (59 kDa), neuronal nuclei (NeuN, 53 kDa), postsynaptic density‐95 (PSD‐95, 95 kDa), myelin basic protein (MBP, 20 kDa), neurofilament‐200 (NF‐200, 200 kDa), B‐cell lymphoma‐2 (Bcl‐2, 22 kDa), and β‐actin (43 kDa). Lesion‐site lysates were collected, and Sham samples served as controls. After SDS‐PAGE and transfer, polyvinylidene difluoride (PVDF; Millipore) membranes were blocked with 5% skim milk and incubated overnight at 4°C with primary antibodies. HRP‐conjugated secondary antibodies were applied for 1 h, blots were visualized on a ChemiDoc Touch system, and band density was quantified with ImageJ. 2.21  TUNEL Apoptotic neurons were detected with the CF488 TUNEL Cell Apoptosis Detection Kit per the manufacturer's instructions. NeuN immunofluorescence, using the same primary antibody as in WB, identified neurons. The percentage of NeuN‐positive cells that were also TUNEL‐positive was determined with a fluorescence microscope and ImageJ. 2.22 Rotarod Test Motor coordination and balance were assessed on a rotarod (YLS‐4C, Beijing) 1, 3, 5, 7, and 14 days after TBI, following published procedures [ 36 2.23 Morris Water Maze ( MWM Spatial learning and memory were evaluated with the MWM [ 37 2.24 Modified Neurological Severity Score ( mNSS Neurological deficits were scored on days 1, 3, 5, 7, and 14 after injury using the mNSS [ 35 2.25 Statistical Analysis Animals were randomly assigned, and all experiments were repeated at least twice by investigators blinded to group allocation. Data are presented as mean ± standard deviation (SD). Normality was checked with the Shapiro–Wilk test. Two‐group comparisons used unpaired, two‐tailed Student's t p 3 Results 3.1 Basic Properties of PBCA Figure 1 2A,Ca,Cb 2Ba,b 2A FIGURE 2 Basic properties of PBCA nanoparticles. (A) TEM images of PBCA particles at four key time points, shown at 50, 100, 200, and 500 nm magnifications. (B) Representative zeta‐potential curves corresponding to panel A. (C) Representative particle‐size distribution curves at the same four time points. (D) Quantification of PBCA zeta potential across the four stages. (E) Quantification of mean particle size across the four stages. (F) Representative HPLC chromatogram of mNGF, with retention time indicated near the peak. (G) Standard curve relating peak area to concentration, generated from five external standards. (H) Encapsulation efficiency (EE %) and drug‐loading capacity (DL %) for PBCA‐mNGF ( n n n Zeta potential reflects surface charge; higher absolute values usually confer greater colloidal stability. Here, PBCA potentials ranged from 0 to −1.2 mV, remaining within ±10 mV (Figure 2D 2Bc 2A 2A,Ba,b,d 2A,Bc,d HPLC assessed nanocrystallization efficiency and quantified mNGF loading in 1 mL PBCA‐mNGF samples. Five replicates and five external standards generated the calibration curve shown in Figure 2F 2G 2H Intrinsic nanoparticle behavior was further characterized (Figure 2J,I 3.2  PBCA mNGF BBB TBI We assessed the toxicity of PBCA and mNGF both in vivo and in vitro. For neuronal evaluation, PC12 cells underwent a cytotoxicity assay. The data indicated that neither unloaded PBCA nor FITC‐labeled mNGF significantly affected cell viability (Figure 3A,B 3C,D FIGURE 3 mNGF Exhibits an Enhanced Ability to Traverse the BBB and Reach the Cerebral Parenchyma. (A) Cell‐viability assay for unloaded PBCA ( n n n n n n n n To verify mNGF delivery to brain parenchyma, the protein was conjugated to FITC (green) and visualized by fluorescence microscopy. Pharmacokinetic studies indicate that mNGF reaches peak plasma concentration at 4.01 h, with a distribution half‐life ( kα kₑ 3E 3I To measure absolute delivery, we first established a standard curve for FITC‐labeled mNGF (Figure 3F Y = − 105271.08714 + 2802011.08750 X − 91791.39446 X 2 Y : OD values X : concentration μg / mL R 2 = 0.99919 Using this curve, we converted cerebral OD readings to drug concentrations (Figure 3J 3G,K 3H,L 3.3  PBCA mNGF TBI The exchange of cerebrospinal fluid (CSF) and interstitial fluid (ISF) is fundamental to glymphatic structure and function, supporting cerebral waste clearance [ 11 4B FIGURE 4 PBCA‐loaded mNGF attenuated glymphatic system dysfunction 3 days following TBI. (A) Schematic illustrating fluorescent‐tracer injection into the cisterna magna or brain parenchyma 3 days post‐TBI in the four experimental groups. (B) Representative coronal sections showing tracer influx: RITC‐dextran (red) and nuclei (DAPI, blue). Scale bar, 1 mm. (C) Representative sections showing tracer clearance under the same staining conditions. Scale bar, 1 mm. (D) Co‐immunofluorescence (co‐IF) for AQP4 (red) and CD31 (green) in peri‐lesional cortex; DAPI marks nuclei. Scale bar, 100 μm ( n n n n n n To compare drug‐delivery modes for solute clearance, 0.5 μL of tracer was stereotactically injected into cortical parenchyma adjacent to the lesion. One hour later, residual fluorescence was quantified. Elevated tracer retention indicated impaired clearance. Post‐TBI brains contained significantly more residue; free mNGF produced minimal improvement, but PBCA‐mNGF markedly reduced tracer levels, signifying enhanced interstitial solute removal (Figure 4C AQP4 facilitates paravascular CSF recirculation and ISF clearance [ 38 4D 4B,C 4F,G Reactive astrogliosis was evaluated by dual staining for GFAP (green) and AQP4 (red). GFAP expression rose sharply in the TBI + PBCA group, remained unchanged in the TBI + mNGF group, and decreased—though not to sham levels—in the PBCA‐mNGF group. High‐magnification images (white boxes) showed closer alignment of astrocytic end‐feet with AQP4 in Sham and TBI + PBCA‐mNGF cortices than in untreated or TBI + mNGF brains (Figure 4E 3.4  PBCA mNGF BBB TBI We assessed BBB integrity—crucial for fluid exchange and solute clearance—using Evans blue (EB) extravasation. In the ipsilateral hemisphere, neither tissue reddening (erythrosis) nor EB leakage was appreciably reduced in the TBI + mNGF group compared with the TBI + PBCA group. By contrast, nanoparticle delivery markedly increased mNGF deposition in the parenchyma, mitigating TBI‐induced BBB injury. Consequently, the TBI + PBCA‐mNGF group exhibited less erythrosis, diminished EB extravasation, and lower EB content (Figure 5A,B FIGURE 5 PBCA‐mNGF attenuated BBB disruption 3 days following TBI. (A) Representative images from the Evans blue (EB) extravasation assay. Scale bar, 0.5 cm. (B) Quantification of EB content in brain tissue ( n n n Laser speckle imaging performed on day 3 post‐TBI revealed greater CBF signals in the PBCA‐mNGF group than in the conventional‐treatment group, although values remained below those of sham mice (Figure 5C,D 5E,G,H 5F,I 3.5  PBCA mNGF TBI TUNEL staining showed that conventional mNGF administration minimally reduced neuronal death, whereas the TBI + PBCA‐mNGF group displayed fewer apoptotic neurons, though counts remained above sham levels (Figure 6A,C,J 6D FIGURE 6 With the assistance of PBCA, mNGF more effectively inhibited neuronal death and promoted the expression of myelin‐related proteins 3 days post‐TBI. (A) TUNEL (green) and NeuN (red) co‐staining in injured cortex at 40× and 400× magnification; white boxes mark regions of interest (ROIs). TUNEL + + n n n n n n n PBCA‐mNGF also enhanced myelin‐related proteins. MBP—a principal CNS myelin component—was up‐regulated only in the PBCA‐mNGF group, whereas free mNGF produced no significant change. Postsynaptic PSD‐95 and axonal NF‐200 likewise increased more robustly with PBCA‐mNGF. Immunofluorescence corroborated these findings: fluorescence signals for MBP, PSD‐95, and NF‐200 were highest in the PBCA‐mNGF cohort (Figure 6E–G,M–O Preliminary data (Figure S1A,B 3.6 “ TBI PBCA mNGF TBI To determine how mNGF influences post‐TBI recovery, we performed a battery of motor and cognitive assays (Figure 7A 7B FIGURE 7 “TBI + PBCA‐mNGF” group demonstrated improved recovery of motor and cognitive function post‐TBI. (A) Timeline of behavioral testing. Modified Neurological Severity Scores (mNSS) and rotarod assessments were performed on days 1, 3, 5, 7, and 14; Morris water‐maze (MWM) trials began on day 15 and ended on day 20. (B) Rotarod performance (latency to fall) for each group ( n n n n n Consistent with these findings, mNSS differed significantly between the two mNGF groups on day 3; thereafter, scores in all TBI cohorts trended downward without further significant separation (Figure 7C 7D–I 7J Finally, co‐administration of the AQP4 inhibitor TGN‐020 negated the benefits of PBCA‐mNGF: drainage dysfunction and metabolite accumulation re‐emerged, and behavioral as well as cognitive scores deteriorated (Figure 7B–J 4 Discussion Few studies have examined mNGF therapy in TBI mice, largely because large molecules are difficult to deliver to the cerebral cortex. Our data show that delivery efficiency in the TBI + PBCA‐mNGF group exceeded that of all other groups. Fluorescence imaging (Figure 3E 39 40 41 42 43 Moreover, our study is the first to demonstrate that mNGF acts as a neuroprotective agent by preventing AQP4 depolarization and limiting reactive astrocyte proliferation. We also observed that mNGF up‐regulates genes supporting BBB structure while down‐regulating those associated with neuronal apoptosis. Three days after TBI, the PBCA‐mNGF group exhibited the best recovery of CBF and the least EB leakage; the other TBI groups still showed marked ischemia and substantial dye extravasation. In parallel, tight‐junction proteins remained better preserved in PBCA‐mNGF brains, suggesting maintained BBB integrity. Although mNGF is well known to promote peripheral axon regeneration, its CNS role is less understood. Because PBCA nanocarriers traverse the BBB, we hypothesized that mNGF could mitigate acute CNS injury. Indeed, PBCA‐mNGF reduced neuronal loss and apoptosis‐related protein levels, implying protection against neurodegeneration. This effect may involve microglial deactivation: CD68/Iba‐1 co‐staining revealed post‐TBI microglial swelling that was attenuated by mNGF. Clarifying this mechanism will be a priority in future work. Importantly, PBCA‐mNGF also improved cognitive performance and motor recovery—outcomes that could translate into better patient quality of life and social reintegration [ 38 25 44 45 46 Retrospective studies have emphasized restoring the cerebral glymphatic system to correct structural and functional deficits, and numerous interventions have been reported to improve TBI prognosis. For example, exogenous interleukin‐33 (IL‐33) promotes metabolic‐waste clearance by enhancing drainage from meningeal lymphatics to deep cervical lymph nodes [ 47  Cannabis sativa 48 5 49 12 50 Nanocrystallization is not the only way to enhance NGF penetration. Under hypoxic–ischemic conditions, β‐NGF—a synthetic NGF analog—distributes more readily in juvenile than in adult rats, implying that delivery efficiency depends on BBB integrity [ 51 52 44 53 5 Conclusion This study demonstrates that nanoparticle carriers markedly enhance the delivery of mNGF to brain parenchyma, thereby conferring neuroprotection. In the acute phase of TBI, mNGF appears to restore glymphatic function, preserve BBB integrity, and reduce injury‐induced apoptosis—all factors that contribute to improved prognosis in TBI mice. Accordingly, nanoparticle‐mediated mNGF delivery warrants further investigation as a promising therapeutic strategy for traumatic brain injury. Ethics Statement The ethics approval statement was labeled as No. IRB2025‐DW‐41. All the animal experimental procedures described in this study were approved by the Animal Care and Use Committee of Tianjin Medical University General Hospital, Tianjin, China. Conflicts of Interest The authors declare no conflicts of interest. Supporting information  Figure S1: n n Acknowledgments The authors are grateful to Dr. Rongcai Jiang for the financial support. Data Availability Statement The data that support the findings of this study are available from the corresponding author upon reasonable request. References 1 S. Kundu S. Singh What Happens in TBI? A Wide Talk on Animal Models and Future Perspective Current Neuropharmacology 21 5 2023 1139 1164 10.2174/1570159X20666220706094248 35794772 PMC10286592 2 B. L. Brett R. C. Gardner J. Godbout K. Dams‐O'Connor C. D. Keene Traumatic Brain Injury and Risk of Neurodegenerative Disorder Biological Psychiatry 91 5 2022 498 507 10.1016/j.biopsych.2021.05.025 34364650 PMC8636548 3 L. M. Hablitz M. Nedergaard The Glymphatic System: A Novel Component of Fundamental Neurobiology Journal of Neuroscience 41 37 2021 7698 7711 10.1523/JNEUROSCI.0619-21.2021 34526407 PMC8603752 4 T. Yi S. Jin H. Yin P. Gao T. Zhu The Glymphatic System: A New Exploration of Pathological Mechanism in Stroke Chinese General Practice 25 9 2022 1136 1140 5 C. Lv S. Han Z. Sha Cerebral Glucagon‐Like Peptide‐1 Receptor Activation Alleviates Traumatic Brain Injury by Glymphatic System Regulation in Mice CNS Neuroscience & Therapeutics 29 12 2023 3876 3888 10.1111/cns.14308 37353947 PMC10651945 6 F. R. Buccellato M. D'Anca M. Serpente A. Arighi D. Galimberti The Role of Glymphatic System in Alzheimer's and Parkinson's Disease Pathogenesis Biomedicine 10 9 2022 2261 10.3390/biomedicines10092261 PMC9496080 36140362 7 Y. Fu J. Bi Y. Yan Rapid Immunodot AQP4 Assay for Neuromyelitis Optica Spectrum Disorder JAMA Neurology 80 10 2023 1105 1112 10.1001/jamaneurol.2023.2974 37669037 PMC10481325 8 L. Aloe L. Bracci‐Laudiero S. Bonini L. Manni The Expanding Role of Nerve Growth Factor: From Neurotrophic Activity to Immunologic Diseases Allergy 52 9 1997 883 894 10.1111/j.1398-9995.1997.tb01247.x 9298172 9 C. Rizzi A. Tiberi M. Giustizieri NGF Steers Microglia Toward a Neuroprotective Phenotype Glia 66 7 2018 1395 1416 10.1002/glia.23312 29473218 PMC6001573 10 L. Manni A. Antonelli N. Costa L. Aloe Stress Alters Vascular‐Endothelial Growth Factor Expression in Rat Arteries: Role of Nerve Growth Factor Basic Research in Cardiology 100 2 2005 121 130 10.1007/s00395-004-0502-7 15739121 11 Y. Fukuyama M. Kubo K. Harada The Search for, and Chemistry and Mechanism of, Neurotrophic Natural Products Journal of Natural Medicines 74 4 2020 648 671 10.1007/s11418-020-01431-8 32643028 PMC7456418 12 Y. Lin Y. Pan Y. Shi X. Huang N. Jia J. Y. Jiang Delivery of Large Molecules via Poly(Butyl Cyanoacrylate) Nanoparticles Into the Injured Rat Brain Nanotechnology 23 16 2012 165101 10.1088/0957-4484/23/16/165101 22460562 13 V. Reukov V. Maximov A. Vertegel Proteins Conjugated to Poly(Butyl Cyanoacrylate) Nanoparticles as Potential Neuroprotective Agents Biotechnology and Bioengineering 108 2 2011 243 252 10.1002/bit.22958 20939007 14 R. N. Alyautdin V. E. Petrov K. Langer A. Berthold D. A. Kharkevich J. Kreuter Delivery of Loperamide Across the Blood‐Brain Barrier With Polysorbate 80‐Coated Polybutylcyanoacrylate Nanoparticles Pharmaceutical Research 14 3 1997 325 328 10.1023/a:1012098005098 9098875 15 L. Zheng L. Shen Z. Li Design, Preparation, and Evaluation of Osthol Poly‐Butyl‐Cyanoacrylate Nanoparticles With Improved In Vitro Anticancer Activity in Neuroblastoma Treatment Molecules 27 20 2022 6908 10.3390/molecules27206908 36296500 PMC9609737 16 J. C. Olivier L. Fenart R. Chauvet C. Pariat R. Cecchelli W. Couet Indirect Evidence That Drug Brain Targeting Using Polysorbate 80‐Coated Polybutylcyanoacrylate Nanoparticles Is Related to Toxicity Pharmaceutical Research 16 1999 1836 1842 10644071 10.1023/a:1018947208597 17 A. E. Gulyaev S. E. Gelperina I. N. Skidan A. S. Antropov G. Y. Kivman J. Kreuter Significant Transport of Doxorubicin Into the Brain With Polysorbate 80‐Coated Nanoparticles Pharmaceutical Research 16 10 1999 1564 1569 10.1023/a:1018983904537 10554098 18 J. Kreuter D. Shamenkov V. Petrov Apolipoprotein‐Mediated Transport of Nanoparticle‐Bound Drugs Across the Blood‐Brain Barrier Journal of Drug Targeting 10 4 2002 317 325 10.1080/10611860290031877 12164380 19 X. T. Li X. R. A Application Value of Plasma Proteomics in the Diagnosis and Pathogenesis of High Altitude Polycythemia Zhonghua Yi Xue Za Zhi 102 45 2022 3624 3629 10.3760/cma.j.cn112137-20220411-00765 36480867 20 M. Shi L. Mi F. Li Fluvoxamine Confers Neuroprotection via Inhibiting Infiltration of Peripheral Leukocytes and M1 Polarization of Microglia/Macrophages in a Mouse Model of Traumatic Brain Injury Journal of Neurotrauma 39 17–18 2022 1240 1261 10.1089/neu.2021.0355 35502478 21 I. F. Harrison O. Ismail A. Machhada Impaired Glymphatic Function and Clearance of Tau in an Alzheimer's Disease Model Brain 143 8 2020 2576 2593 10.1093/brain/awaa179 32705145 PMC7447521 22 X. Zhang X. Huang D. Hang Targeting Pyroptosis With Nanoparticles to Alleviate Neuroinflammatory for Preventing Secondary Damage Following Traumatic Brain Injury Science Advances 10 2 2024 eadj4260 10.1126/sciadv.adj4260 38198543 PMC10780956 23 V. Taggi A. M. Schäfer A. Dolce H. E. Meyer Zu Schwabedissen A Face‐To‐Face Comparison of the BBB Cell Models hCMEC/D3 and hBMEC for Their Applicability to Adenoviral Expression of Transporters Journal of Neurochemistry 168 9 2024 2611 2620 10.1111/jnc.16125 38735840 24 J. Yuan X. Liu M. Nie Inactivation of ERK1/2 Signaling Mediates Dysfunction of Basal Meningeal Lymphatic Vessels in Experimental Subdural Hematoma Theranostics 14 1 2024 304 323 10.7150/thno.87633 38164141 PMC10750213 25 M. A. McMillin G. A. Frampton A. P. Seiwell N. S. Patel A. N. Jacobs S. DeMorrow TGFβ1 Exacerbates Blood‐Brain Barrier Permeability in a Mouse Model of Hepatic Encephalopathy via Upregulation of MMP9 and Downregulation of Claudin‐5 Laboratory Investigation 95 8 2015 903 913 10.1038/labinvest.2015.70 26006017 PMC5040071 26 C. Zhang C. Wei X. Huang MPC‐n (IgG) Improves Long‐Term Cognitive Impairment in the Mouse Model of Repetitive Mild Traumatic Brain Injury BMC Medicine 21 1 2023 199 10.1186/s12916-023-02895-7 37254196 PMC10228048 27 R. A. Barmin A. Dasgupta A. Rix Enhanced Stable Cavitation and Nonlinear Acoustic Properties of Poly(Butyl Cyanoacrylate) Polymeric Microbubbles After Bioconjugation ACS Biomaterials Science & Engineering 10 1 2024 75 81 10.1021/acsbiomaterials.2c01021 36315422 28 B. Wang K. Wu R. Liu Phyllanthi Tannin Loaded Solid Lipid Nanoparticles for Lung Cancer Therapy: Preparation, Characterization, Pharmacodynamics and Safety Evaluation Molecules 28 21 2023 7399 10.3390/molecules28217399 37959818 PMC10647271 29 A. Saro Z. Gao P. A. Kambey M. Li J. Huang HIV‐1 gp120 Protein Activates Cyclin‐Dependent Kinase 1, a Possible Link to Central Nervous System Cell Death Viruses 14 12 2022 2793 10.3390/v14122793 36560797 PMC9786227 30 D. E. Karatoprak R. Engin S. Sahin İ. İclek M. A. Durak Investigation of Neuroprotective Efficacy of Dexpanthenol in an Experimental Head Injury Model Journal of Korean Neurosurgical Association 67 5 2024 521 530 10.3340/jkns.2023.0219 PMC11375073 38449284 31 S. E. Gelperina A. S. Khalansky I. N. Skidan Toxicological Studies of Doxorubicin Bound to Polysorbate 80‐Coated Poly(Butyl Cyanoacrylate) Nanoparticles in Healthy Rats and Rats With Intracranial Glioblastoma Toxicology Letters 126 2 2002 131 141 10.1016/s0378-4274(01)00456-8 11751017 32 C. Macks D. Jeong J. S. Lee Local Delivery of RhoA siRNA by PgP Nanocarrier Reduces Inflammatory Response and Improves Neuronal Cell Survival in a Rat TBI Model Nanomedicine 32 2021 102343 10.1016/j.nano.2020.102343 33259960 PMC8714129 33 S. Hanalioglu T. Hidayatov I. Isikay C. C. Aktas M. Yemisci M. Mut Early Cerebral Blood Flow Changes, Cerebrovascular Reactivity and Cortical Spreading Depolarizations in Experimental Mild Traumatic Brain Injury Model Turkish Neurosurgery 32 3 2022 488 499 10.5137/1019-5149.JTN.37742-22.1 35615768 34 G. Shi L. Liu Y. Cao Inhibition of Neutrophil Extracellular Trap Formation Ameliorates Neuroinflammation and Neuronal Apoptosis via STING‐Dependent IRE1α/ASK1/JNK Signaling Pathway in Mice With Traumatic Brain Injury Journal of Neuroinflammation 20 1 2023 222 10.1186/s12974-023-02903-w 37777772 PMC10543875 35 C. Gao Y. Qian J. Huang A Three‐Day Consecutive Fingolimod Administration Improves Neurological Functions and Modulates Multiple Immune Responses of CCI Mice Molecular Neurobiology 54 2017 8348 8360 27924525 10.1007/s12035-016-0318-0 36 J. Chen Y. Li L. Wang Therapeutic Benefit of Intravenous Administration of Bone Marrow Stromal Cells After Cerebral Ischemia in Rats Stroke 32 4 2001 1005 1011 10.1161/01.str.32.4.1005 11283404 37 N. H. Johnson N. A. Kerr J. P. de Rivero Vaccari H. M. Bramlett R. W. Keane W. D. Dietrich Genetic Predisposition to Alzheimer's Disease Alters Inflammasome Activity After Traumatic Brain Injury Translational Research 257 2023 66 77 10.1016/j.trsl.2023.02.001 36758791 PMC10192027 38 J. Q. Lai Y. C. Shi S. Lin X. R. Chen Metabolic Disorders on Cognitive Dysfunction After Traumatic Brain Injury Trends in Endocrinology and Metabolism 33 7 2022 451 462 35534336 10.1016/j.tem.2022.04.003 39 J. J. Iliff M. J. Chen B. A. Plog Impairment of Glymphatic Pathway Function Promotes Tau Pathology After Traumatic Brain Injury Journal of Neuroscience 34 49 2014 16180 16193 25471560 10.1523/JNEUROSCI.3020-14.2014 PMC4252540 40 B. A. Plog M. Nedergaard The Glymphatic System in Central Nervous System Health and Disease: Past, Present, and Future Annual Review of Pathology 13 2018 379 394 10.1146/annurev-pathol-051217-111018 PMC5803388 29195051 41 C. Muñoz‐Ballester S. Robel Astrocyte‐Mediated Mechanisms Contribute to Traumatic Brain Injury Pathology WIREs Mechanical Engineering and Mechanics 15 5 2023 e1622 10.1002/wsbm.1622 PMC10526985 37332001 42 Z. Ren J. J. Iliff L. Yang ‘Hit & Run’ Model of Closed‐Skull Traumatic Brain Injury (TBI) Reveals Complex Patterns of Post‐Traumatic AQP4 Dysregulation Journal of Cerebral Blood Flow and Metabolism 33 6 2013 834 845 10.1038/jcbfm.2013.30 23443171 PMC3677112 43 M. M. Salman P. Kitchen A. Halsey Emerging Roles for Dynamic Aquaporin‐4 Subcellular Relocalization in CNS Water Homeostasis Brain 145 2021 64 75 10.1093/brain/awab311 PMC9088512 34499128 44 A. Gatto L. Capossela G. Conti Intranasal Human‐Recombinant NGF Administration Improves Outcome in Children With Post‐Traumatic Unresponsive Wakefulness Syndrome Biology Direct 18 1 2023 61 10.1186/s13062-023-00418-1 37789391 PMC10546699 45 M. F. Yang D. X. Ren X. Pan C. X. Li S. Y. Xu The Role of Astrocytes in Migraine With Cortical Spreading Depression: Protagonists or Bystanders? A Narrative Review Pain Therapeutics 13 4 2024 679 690 10.1007/s40122-024-00610-9 PMC11255162 38743247 46 China Nerve Growth Factor Clinical Application Expert Consensus Collaborative Group Expert Consensus on the Clinical Application of Nerve Growth Factor (Enjingfu) Chinese Journal of Neuromedicine 11 4 2012 416 420 10.3760/cma.J.iSSN.1671&#x02013;8925.2012.04.021 47 M. Liu J. Huang T. Liu Exogenous Interleukin 33 Enhances the Brain's Lymphatic Drainage and Toxic Protein Clearance in Acute Traumatic Brain Injury Mice Acta Neuropathologica Communications 11 1 2023 61 10.1186/s40478-023-01555-4 37024941 PMC10080777 48 S. Dong H. Zhao M. Nie Cannabidiol Alleviates Neurological Deficits After Traumatic Brain Injury by Improving Intracranial Lymphatic Drainage Journal of Neurotrauma 41 2024 539 10.1089/neu.2023.0539 38553903 49 S. Tong L. Xie X. Xie Nano‐Plumber Reshapes Glymphatic‐Lymphatic System to Sustain Microenvironment Homeostasis and Improve Long‐Term Prognosis After Traumatic Brain Injury Advanced Science 10 34 2023 e2304284 10.1002/advs.202304284 37867233 PMC10700187 50 M. Liu A. Dasgupta P. Koczera Drug Loading in Poly (Butyl Cyanoacrylate)‐based Polymeric Microbubbles Molecular Pharmaceutics 17 8 2020 2840 2848 10.1021/acs.molpharmaceut.0c00242 32589435 PMC7611892 51 W. Zhou J. Zhang G. Wang L. Ling C. Yan Permeability and Distribution of Nerve Growth Factor in the Brain of Neonatal Rats by Periphery Venous Injection in Hypoxic‐Ischemic State Springerplus 5 1 2016 1893 10.1186/s40064-016-3594-2 27843750 PMC5084138 52 Y. Zhao X. Mao H. Wang The Influence of Electronic Acupuncture at a Specific Frequency in Facilitating the Passage of NGF Through the Blood‐Brain Barrier and Its Effect on Learning and Memory in MCAO/R Rats Journal of Integrative Neuroscience 21 3 2022 79 10.31083/j.jin2103079 35633160 53 H. Cheng Z. Cui S. Guo X. Zhang Y. Huo S. Mao Mucoadhesive Versus Mucopenetrating Nanoparticles for Oral Delivery of Insulin Acta Biomaterialia 135 2021 506 519 10.1016/j.actbio.2021.08.046 34487859 ",
  "metadata": {
    "Title of this paper": "Mucoadhesive Versus Mucopenetrating Nanoparticles for Oral Delivery of Insulin",
    "Journal it was published in:": "CNS Neuroscience & Therapeutics",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12491777/"
  }
}