{
  "title": "Paper_1185",
  "abstract": "pmc Vet Sci Vet Sci 3286 vetsciences vetsci Veterinary Sciences 2306-7381 Multidisciplinary Digital Publishing Institute  (MDPI) PMC12474188 PMC12474188.1 12474188 12474188 41012768 10.3390/vetsci12090843 vetsci-12-00843 1 Brief Report Evaluation of the Preoperative Antiseptic Efficacy of Ozone on Dog Skin in Comparison with Traditional Methods Melanie Pierre 1 https://orcid.org/0009-0003-2747-8258 Niola Carlotta 2 * Guerrini Federico 3 Pareto Nicolò 4 https://orcid.org/0000-0001-8643-507X Mancini Simone 1 5 https://orcid.org/0000-0002-1717-2947 Fratini Filippo 1 5 Liu Jianzhu Academic Editor Tanaka Ryou Academic Editor 1 pierre.melanie@unipi.it simone.mancini@unipi.it filippo.fratini@unipi.it 2 3 fede.guerrini@icloud.com 4 nico.pareto@gmail.com 5 * c.niola@ozonovetpisa.it 01 9 2025 9 2025 12 9 497675 843 11 7 2025 22 8 2025 30 8 2025 01 09 2025 28 09 2025 29 09 2025 © 2025 by the authors. 2025 https://creativecommons.org/licenses/by/4.0/ Licensee MDPI, Basel, Switzerland. This article is an open access article distributed under the terms and conditions of the Creative Commons Attribution (CC BY) license ( https://creativecommons.org/licenses/by/4.0/ Simple Summary Infections during surgery are a serious concern in both human and veterinary medicine. In order to minimize this risk, patients’ skin must be carefully cleaned and sterilized before any procedure. The objective of this study was to test the effectiveness of ozonated bidistilled water as an antimicrobial agent during preoperative surgical scrub in dogs. Researchers compared it with other commonly used antiseptics in veterinary practice, including alcoholic chlorhexidine, soap-based chlorhexidine, and ethyl alcohol. Sixty-three dogs undergoing abdominal or thoracic surgery were included in the study. The skin was divided into small areas, each treated with different antiseptics. The number of viable bacteria was measured before and after cleaning. The results show that ozonated water is as effective as traditional antiseptics. Abstract This paper aims to assess the antiseptic capacity of a double-distilled ozonated water solution and compare it to standard presurgical antiseptic protocols based on chlorhexidine and alcohol. Sixty-three canine patients undergoing different surgical procedures (such as thoracic, abdominal, proximal limb, or cervical) were enrolled in the study. Following extensive preoperative clipping of the selected anatomical regions, four standardized skin areas (6 × 6 cm each) were aseptically sampled according to a predefined protocol: Area 1 received soap-based chlorhexidine followed by alcoholic chlorhexidine; Area 2 was prepared using a combination of soap-based chlorhexidine and ozonated water; Areas 3 and 4 underwent presurgical skin antisepsis with a combination of ethyl alcohol and ozonated water, and ozonated water alone, respectively. Two different samples per area were collected using bacteriological buffers in order to evaluate the bacterial count at 90 s and 180 s, respectively. Those samples were sown via streak plating on Petri dishes using PCA (plate count agar) as the medium. The determination of the total mesophilic bacterial count on Petri dishes was used to assess the efficacy of the antiseptics in different areas. Results show that ozonated bidistilled water demonstrated comparable or superior efficacy compared to other antiseptics tested in this study. Its integration into surgical protocols could enhance patient safety while controlling environmental concerns associated with the massive use of chemical antiseptics. ozonated water dogs antiseptics This research received no external funding. pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement no pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes 1. Introduction Skin in mammals represents a crucial protective barrier, separating the organism from the external environment. It performs vital functions such as protection against pathogens, regulation of body temperature, and sensory perception [ 1 2 3 4 Both veterinary and human surgeons use various antiseptic agents during the cleaning and antisepsis phases prior to surgery; this preparation is also performed on the anatomical region that will be affected by surgery. In this study, two of the main and most common antiseptic agents—chlorhexidine and ethyl alcohol—are considered for comparison with ozone (O 3 5 6 Medical alcohol, in its forms of ethyl alcohol and isopropyl alcohol, is effective against a wide range of microorganisms, including both Gram-positive and Gram-negative bacteria, viruses, and fungi. It acts rapidly in its antimicrobial action, significantly reducing the bacterial load on the skin within seconds. The antimicrobial mechanism is well established, involving protein denaturation and disruption of lipid membranes, but it is believed that alcohol causes denaturation and precipitation of proteins, which in turn leads to damage to the cell membrane and eventual lysis [ 7 8 Chlorhexidine is likely the most widely used biocidal agent in antiseptic products, including as a skin antiseptic, in formulations for oral mucosa, for antisepsis of the surgeon’s hands, and even as a preservative [ 8 9 10 w v w v v v 11 12 13 14 In this context, there is growing interest in exploring alternative antiseptic methods, including ozone, which offers potential advantages in terms of efficacy, environmental impact, and patient safety. As a powerful oxidizing agent, ozone has demonstrated rapid microbial inactivation against a wide range of pathogens, including those resistant to other antiseptics [ 15 Ozone is distinguished by its capacity to induce a redox oxidative stimulus, which is crucial for intercellular and tissue signaling as well as the regulation of biological processes. Its antibacterial mechanism is primarily driven by its potent oxidative reactivity: ozone selectively targets the double bonds of unsaturated fatty acids within the bacterial cell membrane, initiating lipid peroxidation. This process disrupts the membrane’s integrity, altering its permeability and ultimately leading to cellular lysis. Additionally, ozone exerts oxidative effects on essential proteins and nucleic acids, thereby interfering with the bacterium’s metabolic and replicative functions. The formation of reactive oxygen species (ROS) and secondary peroxides further exacerbates intracellular oxidative damage, resulting in rapid and efficient microbial eradication without inducing the development of resistance [ 16 17 These properties render ozone particularly advantageous in the treatment of infectious diseases. Its antibacterial efficacy stems from its ability to react with the double bonds of lipids in the bacterial membrane, thereby promoting oxidative damage to nucleic acids and amino acid side chains and generating biologically active compounds, such as the superoxide anion (O 2 − 2 2 18 Studies investigating infections caused by Gram-positive, Gram-negative, and MRSA bacteria exposed to ozone have demonstrated significant damage to the bacterial membrane [ 19 20 21 While the efficacy of commonly used antiseptic agents is well established and supported by extensive clinical validation, this study aims to offer a novel perspective by exploring the use of ozone as a skin antiseptic in preoperative procedures. Specifically, it investigates the potential of ozonated water as part of emerging antiseptic strategies, with efficacy potentially comparable to conventional protocols and distinct advantages, including greater biocompatibility and a favorable safety profile. 2. Materials and Methods 2.1. Inclusion Criteria The study included sixty-three canine patients, regardless of breed, age, or sex, presenting for surgical procedures. The authors considered the weight and the available skin surface for sampling. Specifically, patients with a sampleable skin surface between 144 cm 2 2 2 Additionally, subjects with previous contamination of the skin by alcohol, ultrasound gels, or other preoperative diagnostic products that could alter the normal skin microbiota were also excluded from the study. 2.2. Preparation of Ozonated Bidistilled Water and Other Antiseptic Supplies The ozone generator (Herrmann Apparatebau GmbH ® 19 22 23 In order to prolong the shelf life of the bidistilled water and enhance the stability of the ozone concentration, the solution was stored at 4 °C. It is noteworthy that the ozone has a reported half-life of approximately 10–30 min at room temperature in water, which can be extended to several hours at low temperatures and optimal pH [ 24 A soap-based chlorhexidine solution was prepared in a glass container for the impregnation of non-sterile cotton gauzes. Additionally, gauzes saturated with Isopropyl alcohol and a solution of chlorhexidine in 95% alcohol (ESOFORM, Rovigo, Italy Cleansing solution for hands and skin 0.5%) were used for antiseptic purposes with a spray dispenser used for the precise application of the latter. 2.3. Sampling Procedure Sterile Cultiplast ® ® Figure 1 - Area 1: soap-based chlorhexidine + alcoholic chlorhexidine - Area 2: soap-based chlorhexidine + ozonated water (20 µg/mL) - Area 3: ethyl alcohol + ozonated water (20 µg/mL) - Area 4: ozonated water (20 µg/mL) The authors intentionally selected a 6 × 6 cm area as the standard sampling unit, as it represented the largest common surface area applicable to both large and small dogs within the inclusion criteria range (sampleable skin surface between 144 cm 2 2 Preoperative clipping in dogs undergoing procedures involving the cervical region or proximal limbs allowed for the exposure of a sufficiently wide skin surface, enabling the collection of four standardized 6 × 6 cm sampling areas even in subjects of varying body sizes. Although multiple anatomical sites were included, the study focused exclusively on the quantitative assessment of bacterial load reduction, without performing microbiological identification. This approach reflects common clinical practice, where antiseptic protocols are uniformly applied across different surgical sites, regardless of regional variations in resident microbiota, although such differences could theoretically influence antiseptic susceptibility and should be considered in future research. An initial sterile swab was used to collect a representative sample of microorganisms from the previously shaved skin surface, serving as a “Control”. Subsequently, the authors subdivided the primary sampling non-prewashed areas into smaller zones measuring 3 × 6 cm, each corresponding to a specific antiseptic treatment and sampling time (90 s and 180 s denominates “P” and “S” series, respectively) to monitor any variations in microbial load. Furthermore, in Area 3, ethyl alcohol was combined with ozone to leverage its potent lipid-dissolving properties during mechanical friction, thereby enhancing the overall antimicrobial efficacy, which is conventionally augmented through association with other antiseptics [ 12 The effectiveness of each antiseptic protocol was assessed on anatomically comparable but separate skin areas within the same subject, enabling a direct intra-individual comparison. This methodological approach reduced inter-subject variability and contributed to increasing uniformity and reliability of the collected data. As an integral aspect of the comprehensive evaluation protocol, local irritation was assessed by direct visual inspection immediately prior to the surgical procedure and before any incision was made. The evaluation was based on predefined visual criteria for cutaneous inflammation, including erythema, swelling, and other visible changes. The details of the zones and sampling times are summarized in the table below ( Table 1 All the bacteriological swabs used for sampling were immersed in 2 mL of sterile physiological solution and stored in the refrigerator at +4 °C, waiting to be transported in a refrigerated bag to the Microbiology Laboratory of the Department of Veterinary Sciences in Pisa. 2.4. Mesophilic Bacterial Count Determination Samples were processed in a laminar flow hood to minimize the risk of contamination. For further microbiological analysis, 2 mL of sterile saline solution was added to each test tube and sown by streak plate method onto Petri dishes containing Agar Plate Count medium (Oxoid ® 2 The total viable mesophilic bacterial count was expressed in log CFU/mL/cm 2 25 l o g  C F U / m L = ∑ c V ( n 1 + 0.1 × n 2 ) × d × S + 40 % ∑ c V n 1  d S 2 A correction factor of 40% was incorporated by the authors, grounded in scientific evidence suggesting that only approximately 60% of the microbial sample is recovered from the swab surface [ 26 This methodology was employed to quantify the viable mesophilic bacterial load in the sampled areas, ensuring accurate and reproducible results in the context of the antiseptic efficacy evaluation. 2.5. Statistical Analysis Log-transformed data (log 10 2 10 2 Despite the promising results, this study has several limitations. The relatively small sample size and the high prevalence of zero bacterial counts limited the ability to perform robust statistical analyses. Future research with larger cohorts is necessary to confirm the findings and strengthen statistical power. 3. Results All 63 patients were included in the final analysis, with no observed skin alterations or adverse effects, such as erythema, edema, or other local reactions, regardless of the assessment method. No statistically significant differences were observed among the antimicrobial agents used, either after the first treatment phase (P-series, 90 s) or after the second phase (S-series, 180 s). These findings confirm the antimicrobial effectiveness of all agents tested, as all treatment groups showed a reduction of approximately 1 log CFU/cm 2 2 Figure 2 Regarding the statistical significance of the results between groups, no statistically significant differences were observed among the antimicrobial treatments at either the first treatment phase (P-series, 90 s) or the second treatment phase (S-series, 180 s). As shown in Figure 3 2 2 2 2 2 Despite these measurable reductions, the differences between groups did not reach statistical significance, indicating that all tested antimicrobial protocols demonstrated similar efficacy under the experimental conditions. 4. Discussion The canine cutaneous microbiome is inherently composed of a complex and diverse population of aerobic, facultative anaerobic, and obligate anaerobic bacterial species [ 27 In the analysis of the results, the authors focused primarily on viable bacterial load, as it is a crucial determinant for assessing the effectiveness of the treatment and for monitoring the biological and clinical responses post-operatively. Due to the comparable efficacy of the various protocols, it is pertinent to critically examine the different antiseptic agents, emphasizing specific challenges associated with their use. The findings indicate that ozone, when applied in the form of bidistilled water, achieves a reduction in bacterial load comparable to that obtained with chlorhexidine and ethyl alcohol, thereby supporting its potential role as a valuable adjunct in veterinary preoperative antiseptic protocols. This observation is particularly relevant in light of ozone’s advantageous characteristics, including its high biocompatibility, rapid onset of action, and low incidence of adverse effects when administered at controlled concentrations [ 28 29 30 17 19 31 32 33 34 While ozone is distinguished by its rapid antimicrobial action and relatively low incidence of adverse effects, other antiseptics, such as chlorhexidine and alcohol, exhibit both advantages and limitations that influence their efficacy and safety in specific clinical contexts. Ethyl alcohol is indeed effective in the presence of organic matter; however, it lacks sustained residual activity, meaning its antiseptic efficacy rapidly diminishes upon evaporation. Furthermore, while the effects are generally mild and localized, it may cause irritation and desiccation of the skin, which in turn increases the risk of cutaneous lesions, particularly in patients with heightened sensitivity [ 35 12 36 Consistent with its non-specific mechanism of action and the residual antibacterial effect, the use of chlorhexidine is widespread. However, there are several limitations, such as its potential toxicity to the eyes, ears, and brain tissue [ 37 8 38 37 39 40 41 42 In the veterinary field, the use of antiseptic agents is inherently complex, as it requires the maintenance of high hygienic standards while simultaneously limiting the dissemination of antimicrobial-resistant pathogens naturally colonizing the skin microbiota [ 43 44 43 44 45 46 Staphylococcus epidermidis Staphylococcus aureus Klebsiella pneumoniae Acinetobacter baumannii 45 47 In this context, veterinary medicine could greatly benefit from the adoption of protocols that integrate the use of ozone. Indeed, compared to other antiseptics, ozone has not been shown to present significant toxicity when used within safe dosages [ 28 29 48 17 19 31 32 Staphylococcus aureus Pseudomonas aeruginosa Klebsiella pneumoniae 33 34 49 50 Furthermore, the persistence of antimicrobial efficacy constitutes a pivotal determinant of surgical asepsis, directly influencing the maintenance of a sterile operative field and the prevention of bacterial recolonization during and after surgical interventions. Among currently available antiseptics, the prolonged bacteriostatic and bactericidal activity of chlorhexidine is extensively substantiated and represents a critical clinical advantage [ 36 5. Conclusions This preliminary study demonstrates that the application of bidistilled ozone water for preoperative skin antisepsis in dogs achieves a bacterial load reduction comparable to that of chlorhexidine and ethyl alcohol. Given its favorable safety profile, rapid antimicrobial action, and minimal adverse effects at controlled concentrations, ozone represents a promising adjunct in veterinary surgical antisepsis protocols. While not intended to replace conventional antiseptics, the integration of ozone may enhance infection control strategies, particularly in the context of increasing antimicrobial resistance. Further rigorous investigations are warranted to optimize and fully elucidate the role of ozone in clinical practice. Disclaimer/Publisher’s Note: Author Contributions Conceptualization, P.M. and F.F.; methodology, P.M. and F.F.; software, C.N. and S.M.; validation, P.M. and F.F.; formal analysis, F.G., N.P., C.N. and S.M.; investigation, F.G., N.P., C.N., S.M. and F.F.; resources, P.M. and F.F.; data curation, C.N. and S.M.; writing—original draft preparation, C.N., F.G. and N.P.; writing—review and editing, P.M., C.N., F.G., N.P. and F.F.; visualization, F.G., N.P., C.N. and S.M.; supervision, P.M. and F.F.; project administration, P.M. and F.F.; funding acquisition, P.M. and F.F. All authors have read and agreed to the published version of the manuscript. Institutional Review Board Statement The study received approval as a non-experimental veterinary clinical practice by the Ethical Committee of the University of Pisa at its meeting on 28 October 2018, which evaluated the submitted project entitled “Use of oxygen-ozone treatment in the disinfection of the preoperative field in dogs: a comparison of protocols” and issued a favorable opinion for implementation as a non-experimental clinical practice in accordance with Article 2, paragraph 1, letter b, of Legislative Decree 26/2014 (Res. No. 51/2018). Informed Consent Statement Written informed consent has been obtained from the patients’ owner for the publication of this paper. Data Availability Statement The raw data supporting the conclusions of this article will be made available by the authors upon request. Conflicts of Interest The authors declare no conflicts of interest. References 1. Baudouin C. Charveron M. Tarroux R. Gall Y. Environmental pollutants and skin cancer Cell Biol. Toxicol. 2002 18 341 348 10.1023/A:1019540316060 12240965 2. Lee J.H. Kang B.T. Kim H.J. Effect of indoor air pollution on atopic dermatitis in dogs Allergy 2023 78 862 864 10.1111/all.15521 36125232 3. Frey E. Costin M. Granick J. AAFP/AAHA Antimicrobial Stewardship Guidelines J. Am. Anim. Hosp. Assoc. 2022 58 1 5 10.5326/1547-3317-58.4.1 35793483 4. Sørensen T.M. Scahill K. Ruperez J.E. Antimicrobial prophylaxis in companion animal surgery: A scoping review for European Network for Optimization of Antimicrobial Therapy (ENOVAT) guidelines Vet. J. 2024 304 106101 10.1016/j.tvjl.2024.106101 38490359 5. Thongrueang N. Liu S.S. Hsu H.Y. Lee H.H. An in vitro comparison of antimicrobial efficacy and cytotoxicity between povidone-iodine and chlorhexidine for treating clinical endometritis in dairy cows PLoS ONE 2022 17 e0271274 10.1371/journal.pone.0271274 35802692 PMC9269917 6. Crosse K.R. Pre-surgical hand preparation in veterinary practice N. Z. Vet. J. 2022 70 69 78 10.1080/00480169.2021.1987348 34586948 7. Stawarz-Janeczek M. Kryczyk-Poprawa A. Muszyńska B. Disinfectants used in stomatology and SARS-CoV-2 infection Eur. J. Dent. 2021 15 388 400 10.1055/s-0041-1724154 33694135 PMC8184310 8. Hoang T.P.N. Ghori M.U. Conway B.R. Topical Antiseptic Formulations for Skin and Soft Tissue Infections Pharmaceutics 2021 13 558 10.3390/pharmaceutics13040558 33921124 PMC8071503 9. Belo L. Serrano I. Cunha E. Skin asepsis protocols as a preventive measure of surgical site infections in dogs: Chlorhexidine-alcohol versus povidone-iodine BMC Vet. Res. 2018 14 95 10.1186/s12917-018-1368-5 29540169 PMC5852956 10. Wade R.G. Burr N.E. McCauley G. The Comparative Efficacy of Chlorhexidine Gluconate and Povidone-iodine Antiseptics for the Prevention of Infection in Clean Surgery: A Systematic Review and Network Meta-analysis Ann. Surg. 2021 274 e481 e488 10.1097/SLA.0000000000004076 32773627 11. Privitera G.P. Costa A.L. Brusaferro S. Skin antisepsis with chlorhexidine versus iodine for the prevention of surgical site infection: A systematic review and meta-analysis Am. J. Infect. Control. 2017 45 180 189 10.1016/j.ajic.2016.09.017 27838164 12. WHO, World Health Organization Global Guidelines on the Prevention of Surgical Site Infection 2017 Available online: https://apps.who.int/iris/bitstream/handle/10665/250680/9789241549882-eng.pdf?sequence=8 (accessed on 30 April 2022) 13. McDonnell G. Russell A.D. Antiseptics and disinfectants: Activity, action, and resistance [published correction appears in Clin Microbiol Rev 2001 Jan;14(1):227] Clin. Microbiol. Rev. 1999 12 147 179 10.1128/CMR.12.1.147 9880479 PMC88911 14. Auda S.H. Mahrous G.M. Ibrahim M.A. Novel chlorhexidine dermal patches, preparation characterization and antimicrobial evaluation Polymer Bull. 2017 74 3995 4007 10.1007/s00289-017-1935-0 15. Epelle E.I. Cojuhari N. Mohamedsalih A. The synergistic antibacterial activity of ozone and surfactant mists RSC Adv. 2023 13 22593 22605 10.1039/D3RA03346E 37501772 PMC10369041 16. Viebahn-Haensler R. León Fernández O.S. Ozone in Medicine. The Low-Dose Ozone Concept and Its Basic Biochemical Mechanisms of Action in Chronic Inflammatory Diseases Int. J. Mol. Sci. 2021 22 7890 10.3390/ijms22157890 34360655 PMC8346137 17. Rangel K. Cabral F.O. Lechuga G.C. Potent Activity of a High Concentration of Chemical Ozone against Antibiotic-Resistant Bacteria Molecules. 2022 27 3998 10.3390/molecules27133998 35807244 PMC9268618 18. Burgassi S. Zanardi I. Travagli V. How much ozone bactericidal activity is compromised by plasma components? J. Appl. Microbiol. 2009 106 1715 1721 10.1111/j.1365-2672.2008.04141.x 19226394 19. Song M. Zeng Q. Xiang Y. The antibacterial effect of topical ozone on the treatment of MRSA skin infection Mol. Med. Rep. 2018 17 2449 2455 10.3892/mmr.2017.8148 29207120 PMC5783482 20. Roth A. Maruthamuthu M.K. Nejati S. Wearable adjunct ozone and antibiotic therapy system for treatment of Gram-negative dermal bacterial infection Sci. Rep. 2022 12 13927 10.1038/s41598-022-17495-3 35977975 PMC9385669 21. Wu T. Li Z. Wei Y. Advances in understanding mechanisms underlying mitochondrial structure and function damage by ozone Sci. Total Environ. 2023 861 160589 10.1016/j.scitotenv.2022.160589 36462650 22. Fontes B. Cattani Heimbecker A.M. de Souza Brito G. Effect of low-dose gaseous ozone on pathogenic bacteria BMC Infect. Dis. 2012 12 358 10.1186/1471-2334-12-358 23249441 PMC3541223 23. Bocci V. Ossigeno Ozono Terapia: Comprensione dei Meccanismi di Azione e Possibilità Terapeutiche CEA Pove del Grappa VI, Italy 2000 24. Bocci V. E Borrelli V. Travagli, and I. Zanardi. The ozone paradox: Ozone is a strong oxidant as well as a medical drug Med. Res. Rev. 2009 29 646 682 10.1002/med.20150 19260079 25. ISO 7932: 2004 Microbiology of Food and Animal Feeding Stuffs—Horizontal Method for the Enumeration of Presumptive Bacillus cereus—Colony-Count Technique at 30 Degrees C ISO Geneva, Switzerland 2004 26. Dalmaso G. Bini M. Qualification of high recovery, flocked swabs as compared to traditional rayon swabs for microbiological environmental monitoring of surfaces PDA J. Pharm. Sci. Technol. 2008 62 191 199 18661868 27. Štempelová L. Micenková L. Andrla P. Strompfová V. The skin microbiome on healthy and inflammatory altered canine skin determined by next generation sequencing Front. Microbiol. 2025 16 1528747 10.3389/fmicb.2025.1528747 40083787 PMC11903403 28. Bocci V.A. Scientific and medical aspects of ozone therapy. State of the art Arch. Med. Res. 2006 37 425 435 10.1016/j.arcmed.2005.08.006 16624639 29. Hiragaki K. Tomiya I. Masaru N. Generation of ozone foam and its application for disinfection Eur. Phys. J. Appl. Phys. 2015 71 20810 10.1051/epjap/2015140508 30. Matsuda A. Ano T. Nakamura Y. Itoi T. Arai K. Kutara K. Sugimoto K. Maeta N. Ozone water has antibacterial properties in dogs without skin barrier impairment Vet. Dermatol. 2025 36 283 290 10.1111/vde.13339 40084489 31. Zeng J. Lu J. Mechanisms of action involved in ozone-therapy in skin diseases Int. Immunopharmacol. 2018 56 235 241 10.1016/j.intimp.2018.01.040 29414657 32. Breidablik H.J. Lysebo D.E. Johannessen L. Effects of hand disinfection with alcohol hand rub, ozonated water, or soap and water: Time for reconsideration? J. Hosp. Infect. 2020 105 213 215 10.1016/j.jhin.2020.03.014 32229145 PMC7271282 33. Bialoszewski D. Pietruczuk-Padzik A. Kalicinska A. Activity of ozonated water and ozone against Staphylococcus aureus and Pseudomonas aeruginosa biofilms Med. Sci. Monit. 2011 17 BR339 BR344 10.12659/MSM.882044 22037737 PMC3539485 34. Wang X. Liao D. Ji Q.M. Analysis of Bactericidal Effect of Three Medical Ozonation Dosage Forms on Multidrug-Resistant Bacteria from Burn Patients Infect. Drug Resist. 2022 15 1637 1643 10.2147/IDR.S353277 35418764 PMC8995158 35. Pedersen L.K. Held E. Johansen J.D. Less skin irritation from alcohol-based disinfectant than from detergent used for hand disinfection Br. J. Dermatol. 2005 153 1142 1146 10.1111/j.1365-2133.2005.06875.x 16307649 36. Asimus E. Palierne S. Blondel M. Comparison of hydroalcoholic rubbing and conventional chlorhexidine scrubbing for aseptic skin preparation in dogs Vet. Surg. 2019 48 1466 1472 10.1111/vsu.13222 31034647 37. Epstein N.E. Review: Perspective on ocular toxicity of presurgical skin preparations utilizing Chlorhexidine Gluconate/Hibiclens/Chloraprep Surg. Neurol. Int. 2021 12 335 10.25259/SNI_566_2021 34345476 PMC8326148 38. Boyce J.M. Alcohols as Surface Antiseptics in Healthcare Settings Infect. Control Hosp. Epidemiol. 2018 39 323 328 10.1017/ice.2017.301 29374503 39. Bever G.J. Brodie F.L. Hwang D.G. Corneal Injury from Presurgical Chlorhexidine Skin Preparation World Neurosurg. 2016 96 e1 e610 10.1016/j.wneu.2016.09.035 27647026 40. Sharp G. Green S. Rose M. Chlorhexidine-induced anaphylaxis in surgical patients: A review of the literature ANZ J. Surg. 2016 86 237 243 10.1111/ans.13269 26361890 41. Opstrup M.S. Jemec G.B.E. Garvey L.H. Chlorhexidine Allergy: On the Rise and Often Overlooked Curr. Allergy Asthma Rep. 2019 19 23 10.1007/s11882-019-0858-2 30874959 42. Rutkowski K. Wagner A. Chlorhexidine: A new latex? Eur. Urol. 2015 68 345 347 10.1016/j.eururo.2015.04.040 25979569 43. Swales N. Cogan T. Failure to achieve asepsis following surgical skin preparation is influenced by bacterial resistance to chlorhexidine, but not skin preparation technique Vet. Nurs. J. 2017 32 224 227 10.1080/17415349.2017.1328994 44. Melanie P. Niola C. Plataroti I. Mancini S. Fratini F. Use of Ozone in Veterinary Dentistry as an Alternative to Conventional Antibiotics and Antiseptics Vet. Sci. 2024 11 163 10.3390/vetsci11040163 38668430 PMC11053877 45. Bhardwaj P. Ziegler E. Palmer K.L. Chlorhexidine induces VanA-type Vancomycin resistance genes in enterococci Antimicrob. Agents Chemother. 2016 60 2209 2221 10.1128/AAC.02595-15 26810654 PMC4808233 46. Wand M.E. Bock L.J. Bonney L.C. Sutton J.M. Mechanisms of Increased Resistance to Chlorhexidine and Cross-Resistance to Colistin following Exposure of Klebsiella pneumoniae Clinical Isolates to Chlorhexidine Antimicrob. Agents Chemother. 2016 61 e01162-16 10.1128/AAC.01162-16 27799211 PMC5192135 47. Hayashi M. Kawamura K. Matsui M. Suzuki M. Suzuki S. Shibayama K. Arakawa Y. Reduction in chlorhexidine efficacy against multi-drug-resistant Acinetobacter baumannii J. Hosp. Infect. 2017 95 318 323 10.1016/j.jhin.2016.12.004 28159381 48. Rajabi A. Farajzadeh D. Dehghanzadeh R. Optimizing ozone dose and contact time for removal of antibiotic-resistant P. aeruginosa A. baumannii E. coli Environ. Sci. Pollut. Res. Int. 2023 30 55569 55581 10.1007/s11356-023-26270-4 36897448 49. Azuma T. Usui M. Hayashi T. Inactivation of Antibiotic-Resistant Bacteria in Wastewater by Ozone-Based Advanced Water Treatment Processes Antibiotics 2022 11 210 10.3390/antibiotics11020210 35203813 PMC8868322 50. Botondi R. Lembo M. Eramo V. The Use of Ozone Technology: An Eco-Friendly Method for the Sanitization of the Dairy Supply Chain Foods 2023 12 987 10.3390/foods12050987 36900504 PMC10001170 Figure 1 Graphical representation of the primary 6 × 6 cm sampling areas and their corresponding sub-zones (3 × 6 cm). The delineation of the sampling areas was performed using 6 × 6 cm sterilized metal templates and marked with a dermographic pen, thereby ensuring consistency and reproducibility of the sampling procedure across all subjects, including small-breed dogs ( a b Figure 2 A graphical representation illustrates the equivalent efficacy of all the antimicrobial agents tested, highlighting the marked reduction in viable microbial counts for each treatment. Figure 3 Illustration of Delta-log values expressed as log reduction compared to the untreated control (light blue bars). The effectiveness of each treatment is represented as the logarithmic reduction in microbial load (Δlog 10 2 vetsci-12-00843-t001_Table 1 Table 1 Summary of antiseptic agents used and related sampling areas. Primary Sampling Area Antiseptic Treatment First Sampling (90”) Second Sampling (180”) Control - - - Area 1 Soap-based chlorhexidine + alcoholic chlorhexidine Subzone 1 “ P1 Subzone 1 “ S1 Area 2 Soap-based chlorhexidine + ozonated water (20 µg/mL) Subzone 2 “ P2 Subzone 2 “ S2 Area 3 Ethyl alcohol + ozonated water (20 µg/mL) Subzone 3 “ P3 Subzone 3 “ S3 Area 4 Ozonated water (20 µg/mL) Subzone 4 “ P4 Subzone 4 “ S4 ",
  "metadata": {
    "Title of this paper": "The Use of Ozone Technology: An Eco-Friendly Method for the Sanitization of the Dairy Supply Chain",
    "Journal it was published in:": "Veterinary Sciences",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12474188/"
  }
}