{
  "title": "Paper_139",
  "abstract": "pmc Int J Cancer Int J Cancer 379 blackwellopen IJC International Journal of Cancer 0020-7136 1097-0215 pmc-is-collection-domain yes pmc-collection-title Wiley Open Access Collection PMC12496001 PMC12496001.1 12496001 12496001 40762633 10.1002/ijc.70046 IJC70046 1 Research Article RESEARCH ARTICLE Cancer Epidemiology Swab‐based anal cancer screening in men living with HIV Rozemeijer et al. Rozemeijer Kirsten https://orcid.org/0000-0002-9597-1728  1  2 Dias Gonçalves Lima Fernando https://orcid.org/0000-0003-0546-7956  1  2  3  4 Kuyvenhoven Esther J.  3  4 de Vries Henry J. C.  3  5  6  7 Steenbergen Renske D. M. https://orcid.org/0000-0002-2327-9839  1  2 Prins Jan M.  4 Siegenbeek van Heukelom Matthijs L.  3 m.l.vanheukelom@amsterdamumc.nl   1 Department of Pathology Amsterdam UMC, Vrije Universiteit Amsterdam Amsterdam The Netherlands   2 Cancer Center Amsterdam Imaging and Biomarkers Amsterdam The Netherlands   3 Department of Dermatology Amsterdam UMC, University of Amsterdam Amsterdam The Netherlands   4 Department of Internal Medicine Amsterdam UMC, University of Amsterdam Amsterdam The Netherlands   5 Center for Sexual Health, Department of Infectious Diseases Public Health Service Amsterdam Amsterdam The Netherlands   6 Amsterdam Institute for Global Health and Development Amsterdam The Netherlands   7 Amsterdam Institute for Infection and Immunity Infectious Diseases Amsterdam The Netherlands * Correspondence m.l.vanheukelom@amsterdamumc.nl 05 8 2025 01 12 2025 157 11 498301 10.1002/ijc.v157.11 2259 2268 13 6 2025 12 12 2024 25 6 2025 04 10 2025 05 10 2025 05 10 2025 © 2025 The Author(s). International Journal of Cancer https://creativecommons.org/licenses/by/4.0/ This is an open access article under the terms of the http://creativecommons.org/licenses/by/4.0/ Abstract Screening for and treatment of anal cancer precursor lesions, high‐grade squamous intraepithelial lesions (HSIL), can prevent anal cancer. Recent guidelines set by the International Anal Neoplasia Society recommend digital anal rectal examination (DARE) and anal swab‐based screening of high‐risk individuals by means of high‐risk (hr)HPV testing or cytology. We used our biobank containing data of more than 600 high‐resolution anoscopy (HRA) screened participants (94% men with HIV) to compare the possible screening algorithms. We selected the 298 screening participants in whom anal swabs were successfully tested for hrHPV and cytology, parallel to HRA screening (DARE followed by complete visual inspection by HRA). We compared outcomes of several strategies (single‐test, co‐testing, two‐step testing) with one or two positive tests required for HRA referral, resulting in 20 possible screening algorithms. We also assessed the sensitivity of DARE to detect anal cancer. We found that the percentage of missed HSIL was lowest with hrHPV testing, either alone (14.2%) or combined with cytology (≥ASCUS threshold: 4.4%; HSIL threshold: 8.8%) (co‐testing or two‐step testing, with ≥1 positive test required for HRA referral). Using these screening algorithms, 61.0 %, 79.0 %, and 63.7% of the participants were referred for HRA. While in some scenarios a small percentage of cancers was missed, all were detected by DARE. Whatever strategy is chosen, screening outcomes will have to be monitored closely to evaluate the program and make adaptations when necessary. What's New? Screening, combined with treatment of precancerous lesions, is key to preventing anal cancer. Here, the authors compare different screening algorithms. The International Anal Neoplasia Society recommends swab‐based screening as a first step, either cytology‐based or HPV‐based, and digital anal rectal exam (DARE). The authors assembled a biobank containing more than 600 paired swabs and biopsies, with which they compared the performance of different screening algorithms. High‐risk HPV testing, either alone or combined with cytology, missed the fewest lesions. These results can help guide the implementation of anal cancer screening programs that best suit the available resources. anal cancer cancer screening cytology human papillomavirus viruses test taking strategies pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement yes pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes source-schema-version-number 2.0 cover-date 1 December 2025 details-of-publishers-convertor Converter:WILEY_ML3GV2_TO_JATSPMC version:6.6.4 mode:remove_FC converted:04.10.2025  Rozemeijer K Dias Gonçalves Lima F Kuyvenhoven EJ Swab‐based anal cancer screening in men living with HIV Int J Cancer 2025 157 11 2259 2268 10.1002/ijc.70046 40762633 PMC12496001 Jan M. Prins and Matthijs L. Siegenbeek van Heukelom shared last authors and contributed equally to this study. Abbreviations AIN anal intraepithelial neoplasia ASCUS atypical squamous cells of undetermined significance DARE digital anal rectal examination FFPE formalin‐fixed and paraffin‐embedded HPV human papillomavirus HRA high‐resolution anoscopy hrHPV high‐risk human papillomavirus HSIL high‐grade squamous intraepithelial lesion IANS International Anal Neoplasia Society LAST Lower Anogenital Squamous Terminology LSIL low‐grade squamous intraepithelial lesion MSMLWH men who have sex with men living with HIV PLWH people living with HIV TWLWH transgender women living with HIV 1 INTRODUCTION Anal cancer incidence is rising, with men who have sex with men and living with HIV (MSMLWH) having the highest risk.  1  2  3  4 The gold standard to detect precursor lesions is high‐resolution anoscopy (HRA), with biopsies taken of suspicious lesions. However, HRA‐based screening is costly, difficult to perform, and burdensome for participants. Furthermore, HRA capacity in many places is limited. Therefore, the International Anal Neoplasia Society (IANS) recently published guidelines on anal cancer screening recommending swab‐based screening as a first step.  5 During the past 7 years, we have assembled a biobank containing paired anal swabs and biopsies of more than 600 screened participants. These participants were regularly screened (i.e., DARE, followed by anal cytology and HRA with intra‐anal biopsies taken from anal abnormalities) and in parallel, an anal swab was taken (i.e., before the complete visual inspection by HRA). hrHPV and cytology testing were performed on a subset of these swabs. This allowed us to compare in retrospect the performance of 20 possible screening algorithms (step‐by‐step procedures used to assess participants) of anal swab‐based screening followed by HRA in case of a positive test, as recommended by the IANS guidelines. For this total of 20 algorithms, we calculated and compared, for our screening population per 100 screening participants: the number of missed histologically proven anal HSIL and anal cancers; the number of cytology and hrHPV tests performed; and HRA referral rates. Finally, we assessed the sensitivity and specificity of history taking and DARE for HRA‐detected anal cancers. 2 MATERIALS AND METHODS 2.1 Study participants and biobank At the HRA clinic of the department of Dermatology, Amsterdam UMC, MSMLWH and transgender women living with HIV (TWLWH) over 35 years, and persons referred because of anal symptoms are screened for anal HSIL. Screening consists of DARE followed by complete visual inspection by HRA, with intra‐anal biopsies taken from suspicious lesions according to previous IANS guidelines.  6  7 2.2 Testing strategies and screening algorithms The possible strategies consisted of single‐testing (one test is performed), co‐testing (simultaneously two tests are performed), and two‐step testing (consecutively two tests are performed). With co‐testing and two‐step testing, the number of positive tests required for a HRA referral can vary (at least one positive test required, two positive tests required, or risk stratification), resulting in a total of 7 strategies. In each strategy, various tests can be used (hrHPV, HPV16, and cytology with different thresholds), resulting in 20 possible screening algorithms. See Table 1 1 TABLE 1 Description of seven anal swab‐based testing strategies and 20 possible screening algorithms. Test strategies Screening algorithms Indication for HRA referral A. Single test hrHPV Positive result HPV16 Cytology (threshold ≥ASCUS) Cytology (threshold HSIL) B1. Co‐testing hrHPV + cytology (threshold ≥ASCUS) ≥ 1 positive result hrHPV + cytology (threshold HSIL) B2. Co‐testing hrHPV + cytology (threshold ≥ASCUS) 2 positive results hrHPV + cytology (threshold HSIL) B3. Co‐testing hrHPV (with genotyping) + cytology HPV16 OR HSIL OR hrHPV positive (non16) + ≥ASCUS C1. Two‐step testing Step 1: hrHPV, step 2: cytology (threshold ≥ASCUS) HRA referral if one or both tests are positive; second test if the first test is negative Step 1: hrHPV, step 2: cytology (threshold HSIL) Step 1: Cytology (threshold ≥ASCUS), step 2: hrHPV Step 1: Cytology (threshold HSIL), step 2: hrHPV C2. Two‐step testing Step 1: hrHPV, step 2: cytology (threshold ≥ASCUS) HRA referral if both tests are positive; second test if the first test is positive Step 1: hrHPV, step 2: cytology (threshold HSIL) Step 1: Cytology (threshold ≥ASCUS), step 2: hrHPV Step 1: Cytology (threshold HSIL), step 2: hrHPV C3. Two‐step testing Step 1: hrHPV (genotyping), step 2: cytology (threshold ≥ASCUS) HPV16 OR hrHPV positive (non16) + ≥ASCUS Step 1: hrHPV (genotyping), step 2: cytology (threshold HSIL) HPV16 OR hrHPV positive (non16) + HSIL Step 1: Cytology, step 2: hrHPV HSIL OR ≥ ASCUS + hrHPV positive Abbreviations: ASCUS, atypical squamous cells of undetermined significance; HRA, high‐resolution anoscopy; hrHPV, high‐risk human papillomavirus; HSIL, high‐grade squamous intraepithelial lesions. 2.3 Procedures and assays 2.3.1 Collection of the material The anal swab specimen was collected by inserting a moistened Dacron swab and slowly retracting it while rotating and applying firm lateral pressure. Thereafter, the swab was transferred to a vial with 20 mL of ThinPrep medium (Hologic, Bedford, MA, USA) and swirled vigorously to release material. 2.3.2 Cytology testing Liquid‐based cytology was performed as part of regular care and graded according to the Bethesda System criteria and reporting terms.  8  9 2.3.3  DNA 4 mL of the (residual) collected ThinPrep solution was used for DNA isolation. DNA was isolated using the NucleoMag 96 DNA isolation kit (Macherey‐Nagel, Düren, Germany) and a Microlab Star robotic system (Hamilton, Gräfelfing, Germany) according to the manufacturer's recommendations. 2.3.4  hrHPV Swabs were tested for hrHPV as described previously using the GP5+/6 +—PCR EIA followed by Luminex typing or the QIAscreen HPV PCR Test (QIAgen, Venlo The Netherlands; an equivalent of the HPV‐Risk assay).  10  11  12  13  14 2.3.5 Histopathology Anal biopsies were formalin‐fixed and paraffin‐embedded (FFPE) and examined by experienced pathologists. Low‐grade squamous intraepithelial lesions (LSIL; AIN1) and HSIL (AIN2‐3) were diagnosed and reported in accordance with criteria, terminology, and recommendations of the Lower Anogenital Squamous Terminology (LAST) project, where p16immunohistochemistry was used to support the AIN diagnosis if indicated. 2.4 Data analysis 2.4.1 Main analysis First, we assessed the prevalence of no dysplasia or LSIL (≤LSIL), HSIL, and HRA‐detected anal cancer at baseline (i.e., moment of inclusion in the biobank). The biopsy with the highest histological grade was used as the study endpoint. Second, we determined the detection of histologically proven ≤LSIL, HSIL, and anal cancer with testing on anal swabs with hrHPV, HPV16, cytology (≥ASCUS), and cytology (HSIL). For the current analysis, we only included screening participants in whom the swab was successfully tested on both cytology and hrHPV. Furthermore, we excluded participants if there was no complete intra‐anal visualization by HRA or if no biopsies were taken of all suspicious lesions visualized by HRA, to avoid misclassification of the histological diagnosis (Figure 1 FIGURE 1 Flowchart from our screening population. Created with BioRender.com In sensitivity analyses, analyses were restricted to participants who were treated for HSIL in the past, to participants in whom the simultaneously obtained cytology results were available before histology was performed, and finally assuming a 50% lower anal cancer prevalence. 2.5 Sensitivity and specificity of history taking and DARE HRA To assess the sensitivity of history taking and DARE to detect anal cancer, we identified all participants with HRA‐detected anal cancer who took part in our biobank study. Their electronic patient records were screened for anal symptoms and DARE findings. We calculated the sensitivity of history taking and physical examination. In case of a recurrence, the first diagnosed HRA‐detected cancer was selected. To assess the specificity, we included all participants of whom the presence of physical symptoms and DARE findings were recorded in the biobank. We excluded participants if there was no complete intra‐anal visualization by HRA or if no biopsies were taken of all suspicious lesions visualized by HRA to avoid misclassification of the histological diagnosis. 2.6 Software Statistical analyses and calculations were performed with Excel version 2408. 3 RESULTS 3.1 Study population Per August 10, 2024, 627 screening participants were included in our Amsterdam UMC biobank. 95.7% were males, 3.3% were females, and 1.0% were transwomen (Table 2 TABLE 2 Characteristics of biobank participants at the moment of inclusion, Amsterdam UMC 2018–2024. Population of the Amsterdam UMC biobank Population of the Amsterdam UMC biobank with an hrHPV and cytology test on anal swabs Population of the Amsterdam UMC biobank with history taking and DARE Used to determine prevalence of ≤LSIL, HSIL, and HRA‐detected anal cancer Used to assess performance of hrHPV testing and cytology Used to assess performance of history taking and DARE  n 627 298 439 Participant characteristics Age, median (range) 53 (26–83) 53 (29–83) 53 (29–83) Gender Male 600 (95.7) 294 (98.7) 417 (95.0) Female 21 (3.3) 3 (1.0) 17 (3.9) Transwomen 6 (1.0) 1 (0.3) 5 (1.1) HIV status Positive 598 (95.4) 291 (97.7) 417 (95.0) Negative 27 (4.3) 7 (2.3) 21 (4.8) Unknown 2 (0.3) 0 (0.0) 1 (0.2) First‐time screeners 179 (29.2)  a 72 (25.0)  b 139 (33.1)  c Treated in the past for HSIL 301 (49.1)  a 150 (52.1)  b 194 (46.2)  c Histopathological diagnosis No dysplasia 359 (57.3) 139 (46.6) 226 (51.5) LSIL 72 (11.5) 36 (12.1) 50 (11.4) HSIL 182 (29.0) 113 (37.9) 144 (32.8) HRA‐detected cancer  d 14 (2.2) 10 (3.4) 19 (4.3)  Note n Abbreviations: DARE, digital anal rectal examination; HRA, high‐resolution anoscopy; hrHPV, high‐risk human papillomavirus; HSIL, high‐grade squamous intraepithelial lesions; LSIL, low‐grade squamous intraepithelial lesions.  a Screening history was unknown for 14 screening participants.  b Screening history was unknown for 10 screening participants.  c Screening history was unknown for 19 screening participants.  d For 14 participants, anal cancer was detected at the moment of inclusion in the biobank. Five additional participants had a history of anal cancer prior to inclusion in the biobank. To avoid any misclassification, 156 out of 627 participants were excluded due to incomplete intra‐anal visualization ( n n n n 1 2 3.2 Performance of the swab‐based screening algorithms 3.2.1 Main analysis The screening algorithms showing the lowest percentage of HSIL missed were: hrHPV testing (strategy A); hrHPV with cytology (≥ASCUS or HSIL threshold) co‐testing or two‐step testing (strategies B1 + C1: at least one of both tests need to be positive); Cytology (≥ASCUS and HSIL threshold) with hrHPV two‐step testing (strategy C1: at least one of both tests need to be positive). With these algorithms only 4.4%–14.2% of HSIL were missed, corresponding with 1.3–4.1 HSIL per 100 screening participants, assuming a 29% HSIL prevalence. In 61.0%–79.0% of the participants, HRA referral would be indicated (Table 3 TABLE 3 Number of anal high‐grade squamous intraepithelial lesions (HSIL) and anal cancers missed, number of tests taken, and high‐resolution anoscopy (HRA) referral rates for 7 strategies and 20 screening algorithms: Projected outcomes per 100 screening participants.  a Numbers of lesions missed per 100 screening participants Number of tests per 100 screening participants  n a  n a Cytology tests hrHPV tests (with or without genotyping) HRA referral rate  Strategy A: Single testing HRA referral if test is positive HPV16 18.5 (63.7%) 0.6 (30.0%) 0 100 19.0 hrHPV 4.1 (14.2%) 0.6 (30.0%) 0 100 61.0 Cytology (≥ASCUS) 5.4 (18.6%) 0.2 (10.0%) 100 0 61.7 Cytology (HSIL) 15.7 (54.0%) 0.6 (30.0%) 100 0 20.3  Strategy B1: Co‐testing (≥1) HRA referral if one or both tests are positive hrHPV + cytology (≥ASCUS) 1.3 (4.4%) 0.0 (0%) 100 100 79.0 hrHPV + cytology (HSIL) 2.6 (8.8%) 0.2 (10.0%) 100 100 63.7  Strategy B2: Co‐testing (2) HRA referral if both tests are positive hrHPV + cytology (≥ASCUS) 8.2 (28.3%) 0.8 (40.0%) 100 100 43.7 hrHPV + cytology (HSIL) 17.2 (59.3%) 1.0 (50.0%) 100 100 17.5  Strategy B3: Co‐testing (risk stratification) HRA referral if one of the screening tests indicates high risk or if both tests indicates intermediate risk hrHPV (genotyping) + cytology  b 7.7 (26.5%) 0.2 (10.0%) 100 100 47.2  Strategy C1: Two‐step testing (≥1) HRA referral if one or both tests are positive; second test if the first test is negative hrHPV + cytology (≥ASCUS) 1.3 (4.4%) 0.0 (0%) 39.0 100 79.0 hrHPV + cytology (HSIL) 2.6 (8.8%) 0.2 (10.0%) 39.0 100 63.7 Cytology (≥ASCUS) + hrHPV 1.3 (4.4%) 0.0 (0%) 100 38.3 79.0 Cytology (HSIL) + hrHPV 2.6 (8.8%) 0.2 (10.0%) 100 79.7 63.7  Strategy C2: Two‐step testing (2) HRA referral if both tests are positive; second test if the first test is positive hrHPV + cytology (≥ASCUS) 8.2 (28.3%) 0.8 (40.0%) 61.0 100 43.7 hrHPV + cytology (HSIL) 17.2 (59.3%) 1.0 (50.0%) 61.0 100 17.5 Cytology (≥ASCUS) + hrHPV 8.2 (28.3%) 0.8 (40.0%) 100 61.7 43.7 Cytology (HSIL) + hrHPV 17.2 (59.3%) 1.0 (50.0%) 100 20.3 17.5  Strategy C3: Two‐step testing (risk stratification) HRA referral if the first test indicates high risk or if the first test indicates intermediate risk and the second test is positive; second test if the first test indicates intermediate risk hrHPV (genotyping) + cytology (≥ASCUS)  c 7.4 (25.7%) 0.6 (30.0%) 42.0 100 46.2 hrHPV (genotyping) + cytology (HSIL)  d 12.1 (41.6%) 0.6 (30.0%) 42.0 100 29.0 Cytology + hrHPV  e 8.5 (29.2%) 0.4 (20.0%) 100 41.4 44.6 Abbreviations: ASC‐H, atypical squamous cells of undetermined significance cannot exclude HSIL; ASCUS, atypical squamous cells of undetermined significance; HRA, high‐resolution anoscopy; hrHPV, high‐risk human papillomavirus; HSIL, high‐grade squamous intraepithelial lesions; LSIL, low‐grade squamous intraepithelial lesions.  a Prevalence was set equal to the prevalence as found in the Amsterdam UMC biobank: ≤LSIL prevalence 69%, HSIL prevalence 29%, HRA‐detected anal cancer prevalence 2%. Test performances were based on 175 ≤ LSIL, 113 HSIL, and 10 anal cancers.  b HRA referral if hrHPV test is positive for HPV16 (regardless of cytology outcome), if cytology outcome is HSIL or ASC‐H (regardless of hrHPV outcome), or if hrHPV test is positive (non16) combined with an ASCUS or LSIL cytology outcome.  c Immediate HRA referral if hrHPV test is positive for HPV16; also HRA referral if hrHPV test is positive (non16) combined with ASCUS or worse cytology outcome; second test if hrHPV test is positive (non16).  d Immediate HRA referral if hrHPV test is positive for HPV16; also HRA referral if hrHPV test is positive (non16) combined with HSIL cytology; second test if hrHPV test is positive (non16).  e Immediate HRA referral if cytology outcome is HSIL or ASC‐H; also HRA referral if cytology outcome is ASCUS or LSIL combined with a positive hrHPV test; second test if cytology outcome is ASCUS or LSIL. The screening algorithms without missing any anal cancers were: hrHPV with cytology (≥ASCUS) co‐testing or two‐step testing (strategies B1 + C1: at least one of both tests need to be positive); Cytology (≥ASCUS) with hrHPV two‐step testing (strategy C1: at least one of both tests need to be positive). With these algorithms, in 79.0% of the participants, HRA referral would be indicated. The screening algorithms with high specificity, and thus low HRA referral rates, were (Supplementary Table 1 HPV16 testing (strategy A); Cytology (HSIL threshold) (strategy A); hrHPV with cytology (HSIL threshold) co‐testing or two‐step testing (strategies B2 + C2: both tests need to be positive); hrHPV (genotyping) with cytology (HSIL threshold) two‐step risk stratification testing (C3: hrHPV test need to be positive for HPV16 or positive [non16] combined with HSIL cytology). HRA referral rate in these algorithms ranged between 17.5% and 29.0%. This was at the expense of missing 30 to 50% of the cancers and missing 41.6%–63.7% of the HSIL (Table 3 When focusing on the total number of hrHPV (with or without genotyping) and cytology tests needed, all algorithms of strategy A required per 100 screening participants 100 tests. All algorithms of strategy B required 200 tests, and algorithms of strategy C required between 120.3 and 179.7 tests. 3.3 Sensitivity analyses When restricting analyses to participants with a previous HSIL treatment, a higher percentage of HSIL were missed for all algorithms (+0.1 to +10.3 percentage points) except for single hrHPV screening (−1.7 percentage points), while the prevalence of HSIL decreased by 5 percentage points (i.e., 24 instead of 29%). As a result, the change in numbers of HSIL missed ranged between −2.4 and + 1.6 per 100 screening participants. For instance, with single cytology (≥ASCUS threshold) testing, 28.6% of HSIL were missed as compared to 18.6% before, corresponding with an increase of +10.0 percentage points. Combined with the 5 percentage points decrease in HSIL prevalence, this led to missing 7.0 HSIL per 100 participants with a previous HSIL treatment, compared to 5.4 per 100 in the overall group of participants, corresponding to an increase of 1.6 HSIL missed per 100 participants (i.e., +1.6). Because ≤LSIL detection also changed by −2.6 to +2.9, and ≤LSIL prevalence increased by 4 percentage points, the change in HRA referral rates ranged between −5.6 and +0.9 per 100 screening participants. Algorithms with the largest change in HRA referral rates were single cytology testing (strategy A1) (≥ASCUS threshold, −5.6 percentage points; HSIL threshold; −4.5 percentage points) and hrHPV with cytology co‐testing or two‐step testing (strategies B2 + C2: both tests need to be positive) (≥ASCUS threshold, −3.2 percentage points; HSIL threshold; −3.9 percentage points). The relative performance of the strategies and screening algorithms was unaffected (Supplementary Table 2 When restricting analyses to HSIL cases where cytology was performed before histology results were available ( n When we decreased the anal cancer prevalence in the screened population by 50%, effects were minimal. HRA referral rates decreased by at most 0.6 per 100 screening participants, and the relative performance of the strategies and screening algorithms remained similar (data not shown). 3.4 Sensitivity and specificity of history taking and DARE HRA Overall, in 19 participants in the Amsterdam UMC biobank, anal cancer was detected with HRA screening. For 14 participants, anal cancer was detected at the moment of inclusion (i.e., at baseline); five additional participants had a history of anal cancer prior to inclusion (Table 2 4 3 4 4 TABLE 4 Sensitivity and specificity of history taking and DARE, in 19 screening participants with anal cancer and 420 screening participants without anal cancer. History taking DARE Positive Negative Positive Negative HRA‐detected anal cancer 18/19 (94.7%) 1/19 (5.3%) 19/19 (100%) 0/19 (0.0%) No HRA‐detected anal cancer 101/420 (24.0%) 319/420 (76.0%) 85/420 (20.2%) 335/420 (79.8%)  Note n n n Abbreviations: DARE, digital anal rectal examination; HRA, high‐resolution anoscopy. The specificity of reported complaints during history taking was 76.0%. The specificity of abnormal findings during DARE was 79.8% (Table 4 3 4 4 DISCUSSION When focusing on test sensitivity to detect HSIL, all screening algorithms of strategies B1 (co‐testing) and C1 (two‐step testing) were promising: hrHPV combined with cytology (≥ASCUS or HSIL threshold). Only 4.4%–8.8% of HSIL were missed, while the percentage of screening participants referred to HRA ranged between 63.7% and 79.0%. The total number of hrHPV and cytology tests needed for 100 screening participants were for strategy B1 (co‐testing) 200 tests, and for strategy C1 (two‐step testing) 138.3 to 179.7 tests. With hrHPV only testing (strategy A), more HSIL were missed (14.2%), but only 61.0% of screening participants would be referred for HRA. When focusing on test sensitivity to detect anal cancer, hrHPV combined with cytology (≥ASCUS threshold) co‐testing or two‐step testing (strategies B1 + C1) was most promising. However, performing DARE also detected all cancers. From the 19 participants with screen‐detected cancers in this study, all had abnormalities at DARE (sensitivity of 100%) and all except one presented with anal cancer symptoms. This underlines the importance of DARE and history taking for the detection of cancer. These findings are in line with Berry et al.  15 The HSIL detection rates of cytology (≥ASCUS or HSIL threshold), HPV16, and hrHPV testing are in line with those reported in two previous systematic reviews.  16  17  18  19 It is estimated that 10% of anal cancers are independent of hrHPV.  20 The IANS guidelines indicate several swab‐based screening strategies: hrHPV‐based, cytology‐based, or a combination of these. The data presented here can help identify the screening strategy that best suits the local situation. In many centers, including our own, capacity to perform cytology is limited. In that case, the following options remain: HPV16 testing (strategy A); hrHPV testing, either alone (strategy A) or combined with cytology two‐step testing (ASCUS or HSIL threshold) (strategy C1); hrHPV (genotyping) with cytology (ASCUS or HSIL threshold) two‐step risk stratification testing (strategy C3). When HRA capacity is also limited, HPV16 testing (strategy A) or hrHPV (genotyping) with cytology (HSIL threshold) two‐step risk stratification testing (strategy C3) is the best option. The strength of this study is that we are the first to combine all strategies and algorithms of the recently published guidelines  5 A limitation of this study is that it concerns a Dutch screening population which is restricted to MSMLWH and TWLWH. Nonetheless, the HSIL prevalence of 29% in MSMLWH is comparable with that of international studies.  21 In this data‐driven strategy paper, we calculated and compared outcomes of the various possible screening strategies and algorithms of anal swab‐based screening as proposed by the 2024 guidelines of the International Anal Neoplasia Society, using data of a real‐world screening population. The data presented here can help identify the screening strategy that best suits the local situation. Nevertheless, performing a DARE and/or history taking should be the cornerstone of every screening program. Whatever strategy is chosen, screening outcomes will have to be monitored closely to evaluate the program and make adaptations when necessary. AUTHOR CONTRIBUTIONS  Kirsten Rozemeijer: Fernando Dias Gonçalves Lima: Esther J. Kuyvenhoven: Henry J. C. de Vries: Renske D. M. Steenbergen: Jan M. Prins: Matthijs L. Siegenbeek van Heukelom: FUNDING INFORMATION KR was supported by a grant from Stichting Life Sciences & Health ‐ TKI, and FDGL was supported by the Amsterdam Academic Medical Centres PhD Scholarship. The source of funding did not have any influence on the design of the study, collection, analysis, interpretation of the data, writing of the manuscript, or the decision to submit the article for publication. CONFLICT OF INTEREST STATEMENT KR received consultancy fees from FUJIREBIO paid to her institution. RDMS is a minority stockholder of Self‐screen B.V., a spin‐off company of VUmc, which owns patents on methylation markers and HPV detection. RDMS received consultancy fees from AstraZeneca paid to her institution. HJCdV received financial compensation or goods for research from Medigene, Gilead, and MSD; financial compensation for presentations from Abbott and Janssen; and financial compensation for advice to Medigene and Novartis. All other authors report no potential conflicts. ETHICS STATEMENT We adhered to the Declaration of Helsinki and the Code of Conduct for Responsible Use of Left‐over Material of the Dutch Federation of Biomedical Scientific Societies. All participants gave written informed consent. Ethical approval was waived by the Institutional Review Board of the Amsterdam UMC, location AMC, under reference number 18/316 (paired anal swabs and biopsies of AIN) and under number 18/333 (swabs of anal cancer). DISCLOSURE The contents of this manuscript have not been copyrighted or published previously. However, test performances of hrHPV and cytology, which were used as input for this simulation study, were derived from swabs of which a subset was used in our recently published paper.  7 Supporting information  Supplementary table 1. a  Supplementary table 2  Supplementary table 3  Supplementary table 4  Supplementary Figure 1 ACKNOWLEDGEMENTS We thank all study participants. We thank Sylvia Duin, Timo ter Braak, and Yara van den Burgt (Amsterdam UMC; Pathology) for excellent technical assistance; Stèfanie Dick for assistance with the Amsterdam UMC biobank; Peter Tabak for collecting anal swabs; Vincent Scheepmaker for collecting data. DATA AVAILABILITY STATEMENT All source code is publicly available on GitHub ( https://github.com/KRozemeijer/Projected-Outcomes-for-Different-Screening-Algorithms.git REFERENCES 1 Clifford GM Georges D Shiels MS A meta‐analysis of anal cancer incidence by risk group: toward a unified anal cancer risk scale Int J Cancer 2021 148 1 38 47 32621759 10.1002/ijc.33185 PMC7689909 2 van der Zee RP Richel O de Vries HJ Prins JM The increasing incidence of anal cancer: can it be explained by trends in risk groups? Neth J Med 2013 71 8 401 411 24127500 3 Palefsky JM Lee JY Jay N Treatment of anal high‐grade squamous intraepithelial lesions to prevent anal cancer N Engl J Med 2022 386 24 2273 2282 35704479 10.1056/NEJMoa2201048 PMC9717677 4 van der Zee RP Wit F Richel O Effect of the introduction of screening for cancer precursor lesions on anal cancer incidence over time in people living with HIV: a nationwide cohort study Lancet HIV 2023 10 2 e97 e106 36640800 10.1016/S2352-3018(22)00368-X 5 Stier EA Clarke MA Deshmukh AA International anal neoplasia Society's consensus guidelines for anal cancer screening Int J Cancer 2024 154 1694 1702 38297406 10.1002/ijc.34850 6 Hillman RJ Cuming T Darragh T 2016 IANS international guidelines for practice standards in the detection of anal cancer precursors J Low Genit Tract Dis 2016 20 4 283 291 27561134 10.1097/LGT.0000000000000256 7 Dias Goncalves Lima F Rozemeijer K van der Zee RP DNA methylation analysis on anal swabs for anal cancer screening in people living with HIV J Infect Dis 2024 jiae627 10.1093/infdis/jiae627 39718982 8 Solomon D Davey D Kurman R The 2001 Bethesda system: terminology for reporting results of cervical cytology JAMA 2002 287 16 2114 2119 11966386 10.1001/jama.287.16.2114 9 Nayar R Wilbur DC The pap test and Bethesda 2014 Cancer Cytopathol 2015 123 5 271 281 25931431 10.1002/cncy.21521 10 van der Zee RP Richel O van Noesel CJM Cancer risk stratification of anal intraepithelial neoplasia in human immunodeficiency virus‐positive men by validated methylation markers associated with progression to cancer Clin Infect Dis 2021 72 12 2154 2163 32266940 10.1093/cid/ciaa397 PMC8204787 11 van der Zee RP van Noesel CJM Martin I DNA methylation markers have universal prognostic value for anal cancer risk in HIV‐negative and HIV‐positive individuals Mol Oncol 2021 15 11 3024 3036 33580586 10.1002/1878-0261.12926 PMC8564631 12 van den Helder R Steenbergen RDM van Splunter AP HPV and DNA methylation testing in urine for cervical intraepithelial neoplasia and cervical cancer detection Clin Cancer Res 2022 28 10 2061 2068 35266975 10.1158/1078-0432.CCR-21-3710 13 Hesselink AT Berkhof J van der Salm ML Clinical validation of the HPV‐risk assay, a novel real‐time PCR assay for detection of high‐risk human papillomavirus DNA by targeting the E7 region J Clin Microbiol 2014 52 3 890 896 24391196 10.1128/JCM.03195-13 PMC3957775 14 Meijer CJ Berkhof J Castle PE Guidelines for human papillomavirus DNA test requirements for primary cervical cancer screening in women 30 years and older Int J Cancer 2009 124 3 516 520 18973271 10.1002/ijc.24010 PMC2789446 15 Berry JM Jay N Cranston RD Progression of anal high‐grade squamous intraepithelial lesions to invasive anal cancer among HIV‐infected men who have sex with men Int J Cancer 2014 134 5 1147 1155 23934991 10.1002/ijc.28431 16 Clarke MA Deshmukh AA Suk R A systematic review and meta‐analysis of cytology and HPV‐related biomarkers for anal cancer screening among different risk groups Int J Cancer 2022 151 11 1889 1901 35793241 10.1002/ijc.34199 PMC9588562 17 Dias Goncalves Lima F Viset JD Leeflang MMG Limpens J Prins JM de Vries HJC The accuracy of anal swab‐based tests to detect high‐grade anal intraepithelial neoplasia in HIV‐infected patients: a systematic review and meta‐analysis Open Forum Infect Dis 2019 6 5 ofz191 31123696 10.1093/ofid/ofz191 PMC6524827 18 Jin FY Poynten IM Hillman RJ Does use of anal cytology as a triage test improve the performance of high‐risk human papillomavirus screening in gay and bisexual men for anal cancer prevention? Int J Cancer 2024 156 575 586 39279187 10.1002/ijc.35185 PMC11621999 19 Gaisa M Deshmukh A Sigel K Liu Y 2024 anal cancer screening guidelines: analysis of clinical performance and HRA utilization in a large cohort of persons with HIV Clin Infect Dis 2025 ciaf052 10.1093/cid/ciaf052 PMC12448577 39899367 20 Alemany L Saunier M Alvarado‐Cabrero I Human papillomavirus DNA prevalence and type distribution in anal carcinomas worldwide Int J Cancer 2015 136 1 98 107 24817381 10.1002/ijc.28963 PMC4270372 21 Machalek DA Poynten M Jin F Anal human papillomavirus infection and associated neoplastic lesions in men who have sex with men: a systematic review and meta‐analysis Lancet Oncol 2012 13 5 487 500 22445259 10.1016/S1470-2045(12)70080-3 ",
  "metadata": {
    "Title of this paper": "Anal human papillomavirus infection and associated neoplastic lesions in men who have sex with men: a systematic review and meta‐analysis",
    "Journal it was published in:": "International Journal of Cancer",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12496001/"
  }
}