{
  "title": "Paper_832",
  "abstract": "pmc Adv Sci (Weinh) Adv Sci (Weinh) 2933 advsci ADVS Advanced Science 2198-3844 Wiley PMC12462952 PMC12462952.1 12462952 12462952 40619620 10.1002/advs.202507186 ADVS70655 1 Research Article Research Article Engineered Anti‐Senescence Trachea With Post‐Transplanted Regenerative Homeostasis Pan Ziyin  1  2 Tang Hai  1  2 Wang Lanlan  5 Bai Qingfeng  1  2 Chen Yi  1  2 Cao Runfeng  1  2 Lin Weikang  6 Wang Lei  1  2 Hu Yulong  1  2 Zhao Guofang  7 Yang Minglei  7  8 Sun Weiyan  1  2 swythoracic@tongji.edu.cn Zhang Kun  4 zhang1986kun@126.com Li Dawei  3 ldw@jiangnan.edu.cn Chen Chang https://orcid.org/0000-0002-9981-3110  1  2 changchenc@tongji.edu.cn   1 Department of Thoracic Surgery, Shanghai Pulmonary Hospital Tongji University School of Medicine Shanghai 200433 China   2 Shanghai Engineering Research Center of Lung Transplantation, Shanghai Pulmonary Hospital Tongji University Shanghai 200433 China   3 Nonwoven Technology Laboratory College of Textile Science and Engineering Jiangnan University Wuxi 214122 China   4 Central Laboratory and Department of Medical Ultrasound, Sichuan Academy of Medical Sciences, Sichuan Provincial People's Hospital, School of Medicine University of Electronic Science and Technology of China Sichuan 610072 China   5 College of Fashion Henan Institute of Science and Technology Xinxiang 453003 China   6 Department of Thoracic Oncology Surgery, Fujian Cancer Hospital Clinical Oncology School of Fujian Medical University Fuzhou 350014 China   7 Department of Cardiothoracic Surgery Ningbo No.2 Hospital Ningbo 315010 China   8 Ningbo Institute of Life and Health Industry University of Chinese Academy of Sciences Ningbo 315016 China * swythoracic@tongji.edu.cn zhang1986kun@126.com ldw@jiangnan.edu.cn changchenc@tongji.edu.cn 06 7 2025 9 2025 12 36 497525 10.1002/advs.v12.36 e07186 04 6 2025 21 4 2025 06 07 2025 26 09 2025 26 09 2025 © 2025 The Author(s). Advanced Science published by Wiley‐VCH GmbH https://creativecommons.org/licenses/by/4.0/ This is an open access article under the terms of the http://creativecommons.org/licenses/by/4.0/ Abstract Post‐transplanted dysfunction remains the key unsolved challenge to construct bioengineered complex organs. Herein, by analyzing the bioengineered trachea, it is found that multiple tissue senescences occur, and poor endogenous cellular contact and exogenous immune microenvironment dysregulation are identified as two crucial factors during senescence. Therefore, a Hebe engineered trachea (Hebe‐ET) with a ring–ring structure and dual anti‐senescence designs is proposed for maintaining regenerative homeostasis after transplantation. First, in the cartilage rings, a fiber‐film structural scaffold is designed to promote close‐packed cellular contact, significantly reducing senescent P21+ chondrocytes. Furthermore, between the cartilage rings are distributed fibrous connective tissue rings, in which the loaded quercetin induces an immune cascade to restrain senescence in multiple cells, including chondrocytes, endothelial cells, and fibroblasts via mitochondrion‐targeted oxidative stress scavenging, promoting the development of the full tracheal components in vivo. Based on these designs, 12 weeks after orthotopic transplantation, the Hebe‐ET achieves sustainable youth and develops a natural‐like structure with mature cartilage phenotype, reconstructed vascular network, and epithelium coverage. The mechanical property exceeds that of the natural trachea, and 87.5% of animals survived. This study first reveals the necessity of anti‐senescence design in the fabrication of complex organ substitutes and proposes an effective engineering strategy for segmental trachea reconstruction. Bioengineered trachea undergoes post‐transplanted senescence, which is found in this study for the first time. Hebe‐ET is designed with dual anti‐senescence strategies: fiber‐film scaffold in cartilage rings for close‐packed cell interaction, and quercetin‐loaded fibrous rings for immune modulation. After transplantation, Hebe‐ET develops a natural‐like structure, with enhanced mechanical properties and normal tracheal functions. long‐segment tracheal defect post‐transplanted dysfunction senescence tissue‐engineered trachea Noncommunicable Chronic Diseases‐National Science and Technology Major Project 2024ZD0529005 National Natural Science Foundation of China 10.13039/501100001809 92259205 82402494 824B2061 National Key Research and Development Program of the Ministry of Science and Technology 2022YFC2407401 2024ZD0529000 2024YFC3044600 2023ZD0516200 2024ZD0540700 Science and Technology Commission of Shanghai Municipality 10.13039/501100003399 24YF2735500 Shanghai Municipal Health Commission 10.13039/100017950 2023ZZ02025 Clinical Research Foundation of Shanghai Pulmonary Hospital FKLY20007 pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement yes pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes source-schema-version-number 2.0 cover-date September 25, 2025 details-of-publishers-convertor Converter:WILEY_ML3GV2_TO_JATSPMC version:6.6.4 mode:remove_FC converted:25.09.2025  Z. Pan H. Tang L. Wang Engineered Anti‐Senescence Trachea With Post‐Transplanted Regenerative Homeostasis Adv. Sci. 12 36 2025 e07186 10.1002/advs.202507186 PMC12462952 40619620 1 Introduction Senescence disrupts normal cellular functions and, as a cellular fate, is characterized by permanent cell cycle arrest and the secretion of large amounts of harmful factors. In addition to the cellular level, with the accumulation of senescence, cell proliferation decreases, and tissue regenerative homeostasis is disturbed; thus, tissue repair is impaired. [  1  2 ] [  3 ] [  4 ] [  5 ] [  6 ] [  7  8 ] Therefore, to detect the relationship between post‐transplantation functional loss and tissue senescence in tracheal substitutes and thus propose a solution, a dysfunctional engineered trachea constructed from a conventional silk fibroin (SF) scaffold was analyzed (a trachea with a “ring–ring” structure, and ring‐shaped SF scaffolds alternately stacked with chondrocyte rings formed by inoculating chondrocytes on the scaffold). SF was chosen because of its clinical translation potential as a natural source protein with good biocompatibility, biodegradability, and low immunogenicity. [  9 ] [  10 ] First, in order to optimize the development pattern of chondrocytes, on the original basis, enhanced SF films were introduced, and a hybrid scaffold with a “fiber‐film” structure was constructed. Intercellular communication was proven to be regulated by the growth environment provided by the scaffold, which ultimately affects cell behavior and the fate of regenerated tissue. [  11  12  13 ] [  14  15 ] Furthermore, quercetin was introduced into the fibrous connective tissue rings between the cartilage rings. Quercetin is a polyphenolic flavonoid monomer compound found in natural plants. [  16 ] [  17  18  19 ] [  20  21 ] [  22 ] In summary, based on the above dual anti‐senescence designs, Hebe‐ET showed no signs of functional loss 12 weeks after transplantation and presented stable mechanical properties, mature cartilaginous phenotype, transmural vascular network in the fibrous connective tissue, and epithelial coverage of the inner wall. This study revealed, for the first time, the critical role of senescence in the long‐term bioactivity maintenance of tracheal substitutes in vivo and provided a reference for the development of complex organ substitutes that meet clinical needs. 2 Results 2.1 Multiple Tissue Senescence Was Found in the Post‐Transplanted Dysfunctional Trachea (DT) To identify the key driving factors, we analyzed the DT prepared from conventional non‐woven SF fiber scaffolds (C‐SFSs) ( Figure  1 1B 1C 1D,E 1F 1G 1H + + 1I Figure 1 Cause analysis of post‐transplantation tracheal dysfunction. A) Schematic diagram of the preparation of Hebe‐ET and the mechanism of dual anti‐senescence design. B) The gross view of DT after post‐transplantated sampling. C) Bronchoscopy images of DT after transplantation. Scale bar, 1mm. (D,E) H&E tissue section staining of DT. D) The representative longitudinal section of DT and natural trachea (upper right corner). The horizontal dotted line represents the boundary of the normal lumen, and the dotted box represents two representative tissue regions (cartilage degradation and inflammatory granulation proliferation). Scale bar, 1mm. E) Enlarged H&E staining images of the representative area. Scale bar: 200µm. F) Survival curve of experimental rabbits in the DT group, normal rabbits without any treatment as control, n (H‐I) 2.2 Fabrication and Characterization of SF Scaffolds with Hybrid Fiber‐Film Structure We then performed P21 IF staining of the chondrocytes seeded on C‐SFS and found that the senescent phenotype of the cells was significantly reduced with a high‐density growth pattern. The same results were also obtained when the chondrocytes were cultured in flat Petri dishes. The proportion of β‐gal positive cells increased significantly, and the chondrocytes lost their normal polygon shape and became spindle‐like with a low‐density growth pattern, indicating the loss of the phenotype ( Figure  2 2C Figure 2 Design, manufacture, and characterization of improved HSFS with hybrid “fiber‐film” structure. A) Senescence condition with high/low‐density cell growth pattern. i) P21 IF staining of chondrocytes after inoculation on C‐SFS (three‐dimensional perspective). Scale bar: 70µm. ii) β‐gal staining of chondrocytes seeded in culture dishes (two‐dimensional perspective). Scale bar, 100µm. B) P21 fluorescence intensity ( n n n n n n n N p p p p p The non‐woven fiber scaffold (HSFS‐0, namely, C‐SFS) was composed of randomly distributed isolated short fibers obtained by needle punching after silk loosing (Figure S1A 2D S1B 2D S1B 2E 2F,G 2H,I p p 2J,K In terms of mechanical properties, the stress–strain curves reflected that both the compressive and tensile properties of the scaffolds tended to enhance with increasing SF film volume (Figure 2L,M,O,P p 2N S1C 2Q S1D Subsequently, the in vitro hemolysis test was performed to assess the blood compatibility of the scaffolds. As shown in Figure 2R 2S S1E,F 2.3 Efficacy Assessment of HSFS to Optimize the Cartilage Growth Pattern and Promote Cartilage Development Primary chondrocytes were cultured in HSFS leaching solution for 7 d, followed by live/dead staining and observation of the cell status under a fluorescence microscope. Results showed that the viability increased with the prolongation of the culture time, and the proportion of viable cells (green staining) was greater than 90% after 7 d, with no significant difference among all the groups (Figure S2A,B S2C To visualize the growth status of chondrocytes on HSFSs with different film parameters, IF staining for F‐actin/DAPI was performed to label the cytoskeleton after incubation for 1, 4, and 7 days, respectively. First, as shown in Figure  3 S3 3D S4A 3E,F S4B 3G,H 3I Figure 3 HSFS changed growth patterns and promoted the development and regeneration of cartilage tissue. A) The permeability of chondrocytes on HSFS‐1, 3, and 5 was visualized (from the side view) by F‐actin (white)/DAPI (Red) IF staining. Scale bar: 100µm. B,C) Average cell penetration depth and spreading width quantification, n n n n n n p p p p p HSFS‐3 has good mechanical properties as well as suitable porosity, which is favorable for chondrocyte infiltration, adhesion, and close‐packed cellular contact. Therefore, we chose this parameter for subsequent cartilage tissue construction, developed cartilage tissue in vitro using induction medium, and implanted this tissue subcutaneously into nude mice for further evaluation of the regenerative capability in vivo. First, the microstructure of the chondrocyte tissue was determined by SEM during 4W culture in vitro. Initially, the chondrocytes adhered to the scaffold, and then, the cells proliferated and covered the scaffold surface. After 2 weeks, the cells began to merge and secrete matrix, and finally, the cells could not be observed, with the scaffold surface completely wrapped by abundant cartilaginous matrix (Figure 3J S1 S5A–C S2 + S7 Type II collagen (Col II) in natural cartilage is distributed in a network and plays a key role in maintaining mechanical strength. We performed Sirius red staining and observed the direction arrangement of the Col II network under the polarizing microscope in the cartilage tissues at each culture time point. Results showed that the density of cartilaginous extracellular matrix (ECM) increased significantly after implantation in vivo, and the collagen fibers inside the tissues intersected with a network structure, similar to that of natural tracheae (Figure 3K Finally, histological staining was performed to further confirm that, after 4 weeks of in vivo culture in nude mice, the deposition of cartilage‐specific ECM increased significantly, resembling that of natural tracheae (Figure 3L–N 3O 3P S6D 3Q S6E,F S6 2.4 Immune Niche Regulation by Oxidative Stress Modulation and Mitochondrial Protection by Quercetin Immune regulation through macrophage reprogramming is the second way to resist senescence. To simulate the inflammatory environment in vivo, we used lipopolysaccharide (LPS)‐induced M1‐phenotype macrophages as the negative control (LPS group), IL4&IL13‐induced M2‐phenotype macrophages as the positive control (IL4&IL13 group), and M0‐phenotype macrophages cultured in complete medium as the blank group ( Figure  4 Figure 4 The regulatory impacts of quercetin on macrophages in vitro and the mechanism exploration. A) Schematic diagram of quercetin regulating macrophage polarization. B–F) Macrophages were cultured for 4 days under different conditions (in complete culture and supplemented with LPS, IL4&13, quercetin, and quercetin+LPS). B) IF staining: F4/80 (yellow), CD86 (red), CD206 (green), and nucleus (DAPI, blue), scale bar: 25µm. C,D) Quantitative analysis of fluorescence intensity of CD86 and CD206, n n n n n n N p p p p p Cell morphology and specific markers are often used to distinguish macrophages with different phenotypes. [  23 ] S8A,B p 4B–D S8C 4E,F Recent research advances have suggested the critical role of the immuno‐metabolic profile in the activation and associated functional changes of macrophages. [  24 ] [  25  26 ] 4G S9 4G Then cytology experiments were carried out to determine the total cellular ROS and mitochondrial superoxide production levels in macrophages with the DCFH‐DA probe and MitoSOX reagents, respectively. Almost no DCFH‐DA positive cells were found in the Qu group, and the intensity of superoxide in the mitochondria was also significantly reduced (Figure 4H,J 4K,L 4M 4N–P The above results suggested that the application of quercetin could exert the anti‐oxidative stress effect through mitochondrial empowerment and ROS scavenging, thus achieving protective effects on mitochondria to induce M2‐phenotype macrophage polarization, which regulated the immune microenvironment in the anti‐inflammatory direction (Figure 4Q 2.5 In Vitro Validation that Quercetin Promotes Multiple Tissue Regeneration through an Immune‐Senescence Cascade To mimic the in vivo microenvironment as much as possible, we established a Transwell co‐culture system of macrophages with chondrocytes, endothelial cells, and fibroblasts to reveal the potential of quercetin to slow the senescence of the three lineages of cells by immune microenvironment regulation, thus promoting the regeneration of multiple tracheal components (cartilage, blood vessels, and fibrous connective tissues) ( Figure  5 Figure 5 In vitro validation of quercetin promoting multiple cell lineage regeneration through the immune‐senescence cascade. A) Schematic diagram of the cellular co‐culture system and functional verification. B–F) Related changes of rabbit primary chondrocytes under different culture conditions in vitro. B,C) β‐gal staining of chondrocytes and quantification of the proportion of positive cells. Scale bar: 100µm. n n n n n n n n n N p p p p p According to the results of β‐gal staining, γH2AX and high mobility group box‐1 protein (HMGB1) immunofluorescence staining (Figure S10A–D S10E–G 5B–D p 5E 5F S10f–H We also observed the growth and development of endothelial cells and fibroblasts in the co‐culture system. Similarly, β‐gal staining, γH2AX, and HMGB1 immunofluorescence staining showed that the senescence and cell cycle arrest of endothelial cells and fibroblasts could be alleviated by immune microenvironment remodeling (Figure 5G–I S11A–D S12A–E S11E–G p S11H 5J,K S11I 5L,M,P,Q S12F 2.6 Further Functional Maintenance and Development of Multiple Tracheal Tissues In Vivo In order to explore the regeneration of multiple tracheal tissues in vivo, we first constructed the “sandwich” model ( Figure  6 6B 6C–F S13A 6G,H Figure 6 Construction of the sandwich model and validation of tracheal multiple tissue regeneration in vivo. A) Schematic diagram of the sandwich model and tissue regeneration verification. B) Gross photographs of the sandwich model before and after 4 weeks of intramuscular embedding. The red arrow represents cartilage; The blue arrow represents regenerated fibrous connective tissue. C) Alcian blue staining of sandwich tissues (SF‐SW and SF@Q‐SW) after embedding (including the fibrous connective tissue above and the cartilage below). Scale bar: 100µm. D) COL2 (red) and MMP13 (green) IF staining and 3D surface plot analysis of fluorescence intensity. Scale bar: 25µm. E,F) Quantitative analysis of fluorescence intensity of COL2 and MMP13 in (D). n n n n p p p p p Subsequently, we evaluated the regeneration of fibrous connective tissue. First, the fibrous connective tissue of the SF@Q‐SW group contained more M2‐polarized macrophages (Figure 6I,K 6JL S14A 6L 6M,N Subsequently, we also constructed the subcutaneous embedding model to evaluate the regeneration of fibrous connective tissue. Figure S15A S15A,B S15C,D In addition, after subcutaneous embedding for 4 weeks, the acute inflammatory reaction in the infiltrating tissue inside the scaffold was downregulated, and the proportion of neutrophils was reduced (Figure S16A S16B,C In conclusion, the above results indicated that the regeneration of multiple components (cartilage, fibrous connective tissue, and blood vessels) of the trachea could be further enhanced in vivo. According to the comparison results with the control group, it was mainly due to the quercetin‐mediated immune‐senescence cascade, which restored cell viability and removed senescent cells to achieve further tissue development in vivo. 2.7 Orthotopic Transplantation of the Hebe Engineered Trachea into Rabbits with Segmental Tracheal Defects We constructed a tracheal‐like structure with alternate stacking of cartilage and fibrous connective tissue rings. First, The Hebe‐ET was ectopically embedded into the para‐tracheal muscles of rabbits for 4 weeks to initiate pre‐vascularization, and the vascular pedicles surrounded the trachea with good blood supply. The vascularized bioengineered trachea was subsequently transplanted into the tracheal defect for reconstruction ( Figure  7 7C,D S3 7E,F Figure 7 Orthotopic transplantation of the engineered trachea. A) Schematic diagram of orthotopic transplantation. B) I) The Hebe‐ET was assembled and ectopically embedded for pre‐vascularization; II) The pedicled Hebe‐ET after 4‐week pre‐vascularization. The white arrow indicated the vascular pedicle; III) End‐to‐end anastomosis between the Hebe‐ET and the natural rabbit trachea (NT). The Hebe‐ET was outlined by the dotted line. C) Photographs of the Hebe‐ET sampled 12 weeks after transplantation. D) Bronchoscope images. Scale bar: 1mm. E) Survival curve of experimental rabbits in Hebe‐ET group, and HSF‐ET group as control, n n n p p p p p Histological staining of tracheal longitudinal sections showed that the structure of Hebe‐ET was perfectly similar to that of the natural trachea. The ring–ring cartilage structure of the tracheal substitute was well preserved and showed typical lacunae. The overall structure of the connective tissue was similar to that of the natural trachea, which showed good regenerative conditions with functional vascular regeneration. The inner wall of Hebe‐ET was covered by the epithelium (Figure 7G,H S17A 7I S17B S18 7J,K S17B 7L,M Finally, IF staining for CD86 and CD206 showed the presence of M2‐phenotype rather than M1‐phenotype macrophages in the fibrous connective tissue of the Hebe‐ET group compared with those in the control group, and the level of oxidative stress was significantly reduced in this region (Figure 7N,O 7P,Q 3 Discussion There is still a lack of clinical solutions for the repair of segmental tracheal defects. Previous reports have investigated tracheal reconstruction with allogenic and autologous tissue transplantation, but major clinical limitations still exist, such as insufficient blood supply and necrosis of the graft, tracheomalacia, and stenosis, and the need for patients to take immunosuppressants for a long time. [  27  28  29 ] [  30 ] [  8 ] [  31  32 ] [  31  32  33 ] However, the causes of ET failure in vivo remain unknown, so the theoretical basis of tracheal design is still limited; thus, realizing a breakthrough in therapeutic efficacy is difficult. This work focused on overall tracheal senescence as the driving factor of dysfunction. Senescence is associated with a wide range of clinically important degenerative diseases. [  3  4 ] First, if the cartilage tissue develops poorly in vivo, accompanied by the degradation of the biomaterial loaded with chondrocytes, the original secreted chondrogenic ECM dissipates, and the mechanical properties of the trachea rapidly weaken, leading to the collapse of the tracheal lumen. [  34  35 ] [  11  36  37 ] [  9  10 ] [  38  39  40 ] [  41  42 ] Deterioration of the regenerative microenvironment is a key factor in cellular senescence, with impacts including clonal expansion and infiltration of immune cells in regenerative niches and loss of functional cellular phenotypes. [  43 ] [  44 ] [  45 ] [  46 ] [  47 ] As the first line of host defense after tracheal substitute implantation, macrophages are heterogeneous and plastic [  48 ] [  24  25  26 ] [  49 ] [  50 ] Finally, we assembled the two types of rings designed for anti‐senescence into a tissue‐engineered trachea and embedded it in the paracervical region of New Zealand rabbits for pre‐vascularization before in situ transplantation. The results were consistent with those obtained from the in vitro study; the cartilage rings were neatly aligned and did not degrade, and the lumen of the trachea did not collapse, with good vascularization between the cartilage rings and epithelium coverage on the inner wall, resulting in good survival of the rabbits. In addition, senescence and inflammation‐related markers were not expressed in the experimental group, which confirmed that the entire trachea was in youth and free from inflammatory cells. However, with regard to pre‐clinical experiments, before tracheal transplantation, the suitability of the animal model should always be carefully evaluated so as to obtain reliable and useful results from preclinical experiments. The selection of animal species as tracheal research models depends on multiple aspects, including operability, body size, cost, etc., but the most important is the anatomical, physiological, and genetic characteristics similar to those of humans. [  51 ] [  52 ] [  53 ] [  54 ] [  55 ] [  56 ] [  57 ] 4 Conclusion In summary, with regard to the key challenge of post‐transplanted dysfunction for bioengineered tracheae, this work emphasized senescence as the core mechanism and focused on two key factors: poor endogenous cellular contact and imbalance of the exogenous immune microenvironment. Then Hebe‐ET with a combination of physical and chemical strategies for anti‐senescence was innovatively constructed, and its long‐term functional maintenance was verified in the long‐segmental trachea defect model in rabbits, with highly native‐like morphological characteristics and multiple tissue regeneration (cartilage, transmural vascular network, and epithelium). Further research still needs to be carried out such as performing the repair of a larger tracheal defect (>6 cm) in a large animal model (such as a macaque or pig) and focusing on evaluating the long‐term survival outcome (>1 year) of the animal after tracheal reconstruction, which is an important research direction to push this tracheal replacement to clinical application. 5 Experimental Section Animals New Zealand rabbits were purchased from Shanghai Jiagan Experimental Animal Company (Shanghai, China). SD rats and Balb/c nude (6‐week‐old) mice were purchased from Shanghai Slake Laboratory Animal Company. Animals’ routine care and study were carried out according to the guidelines of animal care and use (National Research Council and Tongji University). Procedures for the use of animals were approved by the Ethics Committee of Shanghai Pulmonary Hospital (Shanghai, China). We complied with all institutional and governmental regulations on animal ethics. Construction of the Hybrid Silk Fibroin Scaffold (HSFS) For the preparation of SF non‐woven fiber, the raw silk (Jiaxing Silk Co. Ltd., China) was cut and combed, and the fiber mesh was formed by layered lapping. Subsequently, the collected SF mesh was fixed for needle punching (ZSZC01‐220, China), and the punching depth was 10 mm, which produced fiber entanglement inside the fiber mesh, turning the loose fiber mesh into enhanced non‐woven fiber fabric. The obtained non‐woven fibers were boiled in 0.02 m 2 3 For the preparation of SF film, silk was dissolved in 9.3 m −1 Scanning Electron Microscopy (SEM) Microstructure (top and side views) of HSFS was observed using SEM (JSM‐7001F, JEOL, Japan). Before imaging, a gold layer of 4 nm was applied to the sample surface using an auto‐sputter fine coater (JFC 1600, JEOL, Japan). Swelling and Volume Change Ratio Test For the former, the dry weight of the scaffold (W d W d d d d d Mechanical Performance Cylindrical samples (10 mm in diameter and 5 mm in height) were prepared. The tensile properties were tested using an EZ‐LX universal testing machine (Shimadzu, Japan) with a clamping distance of 10 mm and a stretching speed of 10 mm min −1 −1 Hydrophilic Property Hydrophilicity was evaluated by measuring the contact angle of deionized water droplets on the surface of the scaffold. The contact angles were measured by a contact angle meter (JC2000 DM, Shanghai). Water Vapor Transmission Rate (WVTR) Calculation WVTR was used to evaluate the permeability of HSFS. Briefly, samples (surface area: S) divided the sealed space into upper and lower chambers. The upper chamber was vented with water vapor, which passed through the material and into the dryer in the lower chamber (initial mass: W i f −2 −1 i f In vitro Hemolysis Test Hemolysis test was carried out to evaluate the hemocompatibility of HSFS. Fresh anti‐coagulated whole blood was washed three times and centrifuged to obtain precipitated red blood cells (RBC), and then mixed with PBS to obtain RBC suspension. Subsequently, HSFS was soaked in PBS for 24 h to obtain the leaching solution. 200 µL RBC suspension and 800 µL leaching solution were mixed and incubated at 37 °C for 1 h. The RBC suspension mixed with deionized water and PBS was used as negative and positive controls, respectively. Finally, the samples were centrifuged at 5000 rpm min −1 s – ns pc – ns s pc nc Blood Clotting Test The scaffolds were first placed in a 6‐well plate and incubated for 10 min at 37 °C. Then, 100 µL of rabbit whole blood was first dropped on the samples, followed by the addition of 20 µL CaCl 2 −1 s w s w DPPH Clearance Assay DPPH was dissolved in ethanol with a concentration of 100 µ m b s b b s Chondrocyte Culture and In Vitro Biocompatibility of HSFS The chondrocytes used in this study were derived from rabbit ears. Rabbits were anesthetized, and 4×6 cm 2 2 6 −1 2 Chondrocytes were cultured in the scaffold leaching solution for 7 days, and then stained using a live/dead cell staining kit (Invitrogen, USA) and observed under the fluorescence microscope (Olympus IX73, Japan). The proliferative activity of the cells in the leaching solution was detected using a CCK‐8 kit (Dojindo, Japan) according to the manufacturer's instructions, and the absorbance value of the supernatant at 450 nm was measured. Regeneration of Cartilage Tissue In Vitro and In Vivo HSFS were sterilized before cell inoculation: scaffolds were soaked in 75% ethanol, followed by PBS washing 2–3 times, and then irradiated under UV light. Subsequently, chondrocytes were inoculated into the scaffolds at a cell density of 3×10 7 Biochemical Analysis of Cartilage Tissue Tissues were lyophilized in a vacuum, and cartilage biochemical assessment was performed according to the kit instructions. The DNA content of the tissues was determined using the TIANamp Genomic DNA Kit (Tiangen Biotech, Beijing). The samples were digested with papain at 65 °C for 12 h, and the GAG content was quantified using the Sulfated Glycosaminoglycan Assay Kit (Biocolor, UK). Finally, the HYP content of the tissues was determined by the alkaline hydrolysis method (Jiancheng, China). Induction of Macrophage Polarization In Vitro Macrophages (RAW264.7 lineage, purchased from Pricella) were inoculated in 6‐well plates at a density of 2×10 5 −1 −1 Flow Cytometry Analysis of Macrophage To analyze macrophage polarization, cells were digested and collected (1×10 5 ROS Level Assay Following the manufacturer's instructions, DCFH‐DA (Beyotime, China) and MitoSOX Red (Invitrogen, USA) fluorescent probes were used to detect intracellular and mitochondrial ROS production levels in macrophages. Briefly, the cell culture medium was removed, and an appropriate volume (1–2 mL) of diluted DCFH‐DA and MitoSOX working solution was added to each well to incubate cells for 20 min at 37 °C. Afterward, cells were washed three times with PBS to remove residual fluorescent probes that had not entered the cells. Finally, cells were observed by light microscope and fluorescence microscope (Olympus IX73, Japan) alternately. Mitochondrial Membrane Potential Assay Mitochondrial membrane potential assay kit with JC‐1 (Beyotime, China) was used according to the instructions. Briefly, macrophages were rinsed twice with PBS and then incubated with JC‐1 working solution for 20 min at 37 °C. Subsequently, the cells were washed twice with JC‐1 dilution buffer after ice bathing, and the images were captured using the fluorescence microscope immediately after the cell culture medium was added. The red/green fluorescence intensity was quantified using ImageJ software. Cellular ATP Production Level ATP assay kit (Beyotime, China) was used to determine the ATP production level of macrophages. Add 200 µL lysis solution into each well to disintegrate macrophages at 4 °C, centrifuge at 12000×g for 4 min, collect supernatant (20 µL), and add ATP detection working solution (100 µL) into a 96‐well plate (black). The fluorescence intensity was read by the microplate reader. ATP concentration was calculated according to the standard curve. Mitochondrial Microstructure Morphology After incubation, macrophages were obtained with cell scrapers. Cell microspheres were collected at the bottom of 1.5 mL EP tubes after centrifugation and fixed in 2.5% glutaraldehyde pre‐cooled at 4 °C overnight. Subsequently, the samples were rinsed with 1% osmium tetroxide and fixed for 1 h. After gradient dehydration in ethanol, the cell microspheres were embedded in resin to prepare ultrathin sections. Subsequently, the sections were stained with uranyl acetate and lead citrate. Finally, transmission electron microscopy (TEM) was used to observe whether the cellular mitochondria underwent morphological changes, such as vacuolization, cristae collapse, and mitochondrial swelling/disintegration. Construction of the Co‐Incubation Transwell Model In Vitro To determine the potential paracrine impacts of macrophages on the regeneration of multiple tissues (cartilage, blood vessels, fibrous connective tissue) after polarization. Expanded macrophages were inoculated into the upper chamber of Transwell (Corning, USA) at a density of 5×10 4 4 Cellular Senescence‐Associated β‐Gal Staining β‐gal staining was performed on the above‐mentioned three cell lineages in the lower chamber of Transwell to detect cell senescence using the Senescence β‐Galactosidase Staining Kit (Beyotime, China). Briefly, aspirate cell culture medium, wash cells once with PBS, and then fix cells for 15 min at room temperature. Afterward, cells were washed three times for 3 minutes each time. Subsequently, the staining working solution was added to incubate cells at 37 °C overnight, and then cells were observed under the light microscope. Cell Cycle Assay Cell cycle assay kit (Elabscience, China) was used to analyze the cell cycle progression of trilineage cells as mentioned above. Briefly, approximately 5×10 5 DNA Damage Detection DNA damage assay kit by γ‐H2AX immunofluorescence (Beyotime, China) was used to analyze the DNA damage condition of trilineage cells as mentioned above. Briefly, cells were fixed in 4% paraformaldehyde for 15 min, then washed and immersed in blocking solution for 20 min. Cells were subsequently incubated with γ‐H2AX primary antibody overnight, washed three times with PBS, and then incubated with secondary antibody for 1 h. Cell nuclei were visualized by DAPI. Afterwards, Cells were observed under the fluorescence microscope, and ImageJ software was used to quantify the fluorescence intensity of positive cells. Toluidine Blue Staining The secretion and distribution of chondrogenic glycosaminoglycans were detected using toluidine blue stain solution (Solarbio, China). Cells were rinsed twice with PBS, stained for 5 min, gently pipetted with distilled water, and let stand for 15 min. Finally, the cells were washed twice with distilled water and observed under the light microscope. Enzyme‐Linked Immunosorbent Assay (ELISA) Concentrations of regeneration‐related cytokines, including pro‐chondrogenic growth factors (IGF‐1, TGF‐β1, and FGF‐2) and pro‐angiogenic factors (TGF‐β3, PDGF‐AA, and VEGF‐A), were determined in the conditional medium of macrophages using ELISA assay kits (Elabscience, China). All assays were performed according to the manufacturer's instructions. Briefly, a standard working solution or sample was first added and incubated at 37 °C for 90 min. Afterward, biotinylated antibody working solution, HRP enzyme conjugate working solution, substrate solution, and termination solution were added and incubated in sequence, and the OD value was read at 450 nm immediately. Scratch Wound Healing Assay The scratch wound healing assay was performed to explore the migration ability of HUVECs. Briefly, when cells labeled with Dil grew to 70%–80% fusion, they were treated with 50 nmol mL −1 Tube Formation Assay In Vitro The tube formation assay was performed to test the ability of HUVECs to form blood vessels. Briefly, the Matrigel (Corning, USA) was first prepared overnight at 0 °C and added to the bottom of pre‐cooled 48‐well plates in each well and incubated for 30 min at 37 °C, 5% CO 2 5 Crystal Violet Staining The Transwell inserts were placed in well plates, wetted with serum‐free medium before cell inoculation, and incubated at 37 °C and 5% CO 2 5 −1 Real‐Time Quantitative PCR Total cellular RNA was extracted using TRIzol reagent (Invitrogen, USA), and a NanoDrop 2000 spectrophotometer (Thermo Fisher Scientific, USA) was used to assess the integrity and purity of the extracted RNA. Transcription reversal DNA (cDNA) was performed to form a complementary according to the instructions of the commercial reverse transcription kit (Takara Bio, Japan). qPCR was performed to assess the expression levels of COL2, ACAN, COL1, COLX, CD31, VEGF‐α, and HIF‐1α. The primers are listed in Table S1 Scaffold Subcutaneous Embedding Model SF@Q‐S with a diameter of 6 mm and a thickness of 2 mm were embedded subcutaneously on the back of SD rats for 2 and 4 weeks, respectively. The residual scaffold material and the surrounding tissues were sampled for subsequent study. SF‐S were used as controls. Construction of the Sandwich Model As mentioned above, chondrocytes were inoculated with ring‐shaped HSFS, cultured in vitro for 4W to form the cartilage ring, placed between two HSFS@Q ring‐shaped scaffolds to form a “sandwich” structure (SF@Q‐SW), which was embedded in the paratracheal muscle of rabbits for 2 and 4 weeks. The middle cartilage layer and the upper and lower fibrous connective tissue layers were evaluated for subsequent functional assessment, respectively. HSFS without quercetin was used to replace HSFS@Q to construct the sandwich model (SF‐SW) as controls. Repair of Long‐Segmental Tracheal Defects in Rabbits New Zealand rabbits weighing 2 kg were selected for the repair of long tracheal defects. A cartilage ring and a fibrous connective tissue ring were constructed by inoculating chondrocytes and loading quercetin in the HSFS, respectively. Subsequently, the two rings were alternately stacked on a silicone tube to form the Hebe engineered trachea (Hebe‐ET), and the biomimetic trachea was wrapped with cervical muscles for pre‐vascularization. The natural trachea with the same length as Hebe‐ET was circumferentially resected to create the long segmental tracheal defect. After pre‐vascularization for 4 weeks, Hebe‐ET with vascular pedicles was separated from the surrounding tissues and transplanted to the tracheal defect site. End‐to‐end anastomosis was performed using 4‐0 absorbable suture (Jinhuan, China). To avoid infection, animals underwent intramuscular injection with penicillin sodium (40 000 U kg −1 Respiratory Function Monitoring The respiratory rate of the animals was monitored once a week, which was recorded during a 10‐min observation period at three different time points of the day (7:00 a.m., 12:00 p.m., and 7:00 p.m.). Before each test, the animals were acclimatized for 15 min to ensure that they were in a calm, undisturbed state. The total number of respiratory breaths recorded at the three time points was averaged as the respiratory rate of the animal for that day. Histological and Immunofluorescent Staining Analysis Tissues were fixed in 4% paraformaldehyde for 24 h, followed by gradient dehydration in ethanol, and were prepared as paraffin samples and set at a thickness of 8 µm for tissue sectioning. H&E, Safranine‐O, Alcian Blue, and Sirius Red staining were performed using the staining kits (Solarbio, China). Staining was performed according to the recommended procedure. The expression of CD86, CD206, F4/80, F‐actin, P16, P21, HMGB1, CK14, FOXJ1, α‐SMA, CD31, COL2, and MMP13 were detected by immunofluorescence staining under the standard IF protocol as follows: all samples were washed with PBS and subsequently permeabilized in 0.3% TritonX‐100 (Sigma–Aldrich, USA) for 5 min, then washed with PBS and blocked with 5% BSA (Sangon Biotech, China). Tissues were subsequently incubated with primary antibody overnight, washed three times with PBS, and then incubated with secondary antibody for 1 h. Cell nuclei were visualized by DAPI. Afterwards, tissue sections were observed under the fluorescence microscope, and ImageJ software was used to quantify the fluorescence intensity or the proportion of positive cells. Statistical Analysis All the data were presented as mean ± standard deviation (SD) values. Data were analyzed using GraphPad Prism software (10.3). One‐way analysis of variance (ANOVA) was used to determine the level of significance between three or more groups. Differences between the two groups were analyzed using an independent samples t‐test. In all cases, p Conflict of Interest The authors declare no conflict of interest. Supporting information Supporting Information Supplemental Movie 1 Supplemental Movie 2 Supplemental Movie 3 Acknowledgements Z.P H.T,L.W contributed equally to this work. The authors declare that they have no competing interests. Noncommunicable Chronic Diseases‐National Science and Technology Major Project 2024ZD0529005; National Natural Science Foundation of China 92259205, 824B2061, 82402494; National Key Research and Development Program of the Ministry of Science and Technology 2022YFC2407401, 2024ZD0529000, 2024YFC3044600, 2023ZD0516200, 2024ZD0540700; Science and Technology Commission of Shanghai Municipality 24YF2735500; Clinical Research Foundation of Shanghai Pulmonary Hospital FKLY20007; Ningbo Top Medical and Health Research Program 2022030208; Shanghai Municipal Health Commission 2023ZZ02025. Data Availability Statement The data which supports the findings of this study is available from the corresponding authors upon reasonable request. 1 M. Ogrodnik A. J. Carlos P. D. Adams D. F. F. D'Adda D. J. Baker C. L. Bishop T. Chandra M. Collado J. Gil V. Gorgoulis F. Gruber E. Hara P. Jansen‐Durr D. Jurk S. Khosla J. L. Kirkland V. Krizhanovsky T. Minamino L. J. Niedernhofer J. F. Passos N. Ring H. Redl P. D. Robbins F. Rodier K. Scharffetter‐Kochanek J. M. Sedivy E. Sikora K. Witwer T. von Zglinicki M. H. Yun Cell 2024 187 4150 39121846 10.1016/j.cell.2024.05.059 PMC11790242 2 A. Brunet M. A. Goodell T. A. Rando Nat. Rev. Mole. Cell Biol. 2023 24 45 10.1038/s41580-022-00510-w PMC9879573 35859206 3 N. Geng M. Fan B. Kuang F. Zhang M. Xian L. Deng C. Chen Y. Pan J. Chen N. Feng L. Liang Y. Ye K. Liu X. Li Y. Du F. Guo Nat. Commun. 2024 15 7712 39231947 10.1038/s41467-024-51746-3 PMC11375154 4 S. Jin Y. Wang X. Wu Z. Li L. Zhu Y. Niu Y. Zhou Y. Liu Adv. Mater. 2023 35 2211602 10.1002/adma.202211602 36779444 5 F. Pesce E. D. Stea C. Divella M. Accetturo P. Laghetti P. Gallo M. Rossini F. Cianciotta L. Crispino A. Granata M. Battaglia G. Lucarelli S. R. de Cordoba G. Stallone L. Gesualdo G. Castellano Am. J. Transplant. 2021 21 838 33091234 10.1111/ajt.16350 6 W. Chen W. Xiao X. Liu P. Yuan S. Zhang Y. Wang W. Wu Bioact. Mater. 2022 11 283 34977432 10.1016/j.bioactmat.2021.09.027 PMC8668428 7 E. Stocco S. Barbon M. Mammana G. Zambello M. Contran P. P. Parnigotto V. Macchi M. T. Conconi F. Rea R. De Caro J. Tissue Eng. 2023 14 10.1177/20417314231151826 PMC9974632 36874984 8 W. Neville P. Bolanowski S. H. J. Thorac. Cardiovasc. Surg. 1976 4 525 966785 9 D. Lin M. Li L. Wang J. Cheng Y. Yang H. Wang J. Ye Y. Liu Adv. Funct. Mater. 2024 34 2405255 10 H. A. Tran T. T. Hoang A. Maraldo T. N. Do D. L. Kaplan K. S. Lim J. Rnjak‐Kovacina Mater. Today 2023 65 244 11 A. Saraswathibhatla D. Indana O. Chaudhuri Nat. Rev. Mol. Cell Biol. 2023 24 495 36849594 10.1038/s41580-023-00583-1 PMC10656994 12 Y. Liu Q. Guo X. Zhang Y. Wang X. Mo T. Wu Adv. Fiber Mater. 2023 5 1241 13 S. Wang S. Hashemi S. Stratton T. L. Arinzeh Adv. Healthc. Mater. 2021 10 2001244 10.1002/adhm.202001244 33274860 14 X. Li Y. Cheng P. Gu C. Zhao Z. Li L. Tong W. Zeng J. Liang E. Luo Q. Jiang Z. Zhou Y. Fan X. Zhang Y. Sun Adv. Mater. 2024 36 2310876 10.1002/adma.202310876 38321645 15 H. Su Y. Ma W. Li H. Ren X. Maimaitikelimu F. Lin H. Zhang S. Liu Q. Chen H. Wang Chem. Eng. J. 2025 503 158134 16 N. Yang T. Wu M. Li X. Hu R. Ma W. Jiang Z. Su R. Yang C. Zhu Bioact. Mater. 2025 43 48 39318638 10.1016/j.bioactmat.2024.09.012 PMC11421951 17 M. K. Han T. A. Barreto F. J. Martinez A. T. Comstock U. S. Sajjan BMJ Open Respir. Res. 2020 7 392 10.1136/bmjresp-2018-000392 PMC7047491 32071149 18 A. Nambiar D. R. Kellogg J. Justice M. Goros J. Gelfond R. Pascual S. Hashmi M. Masternak L. Prata N. Lebrasseur A. Limper S. Kritchevsky N. Musi T. Tchkonia J. Kirkland EbioMedicine 2023 90 1004481 10.1016/j.ebiom.2023.104481 PMC10006434 36857968 19 M. J. Houghton E. Balland M. J. Gartner B. J. Thomas K. Subbarao G. Williamson BioFactors 2024 50 1268 38886986 10.1002/biof.2084 PMC11627474 20 T. T. Nguyen S. Corvera Nat. Metab. 2024 6 793 38783156 10.1038/s42255-024-01046-3 PMC11238912 21 V. Moiseeva A. Cisneros V. Sica O. Deryagin Y. Lai S. Jung E. Andrés J. An J. Segalés L. Ortet V. Lukesova G. Volpe A. Benguria A. Dopazo S. A. Benitah Y. Urano A. Del Sol M. A. Esteban Y. Ohkawa A. L. Serrano E. Perdiguero P. Muñoz‐Cánoves Nature 2023 613 169 36544018 10.1038/s41586-022-05535-x PMC9812788 22 H. Tang W. Sun X. Liu Q. Gao Y. Chen C. Xie W. Lin J. Chen L. Wang Z. Fan L. Zhang Y. Ren Y. She Y. He C. Chen Sci. Transl. Med. 2023 15 abo4272 10.1126/scitranslmed.abo4272 37729433 23 Q. Q. Yang L. Zhang Y. L. Zhou J. B. Tang Colloids Surf., B. 2022 209 112145 10.1016/j.colsurfb.2021.112145 34637957 24 M. Li Y. Yang L. Xiong P. Jiang J. Wang C. Li J. Hematol. Oncol. 2023 16 80 37491279 10.1186/s13045-023-01478-6 PMC10367370 25 C. Li C. Deng S. Wang X. Dong B. Dai W. Guo Q. Guo Y. Feng H. Xu X. Song L. Cao Redox Biol. 2024 70 103059 38316066 10.1016/j.redox.2024.103059 PMC10862067 26 Y. Chen G. Wu M. Li M. Hesse Y. Ma W. Chen H. Huang Y. Liu W. Xu Y. Tang H. Zheng C. Li Z. Lin G. Chen W. Liao Y. Liao J. Bin Y. Chen Redox Biol. 2022 56 102446 36057161 10.1016/j.redox.2022.102446 PMC9437906 27 Z. H. Tan L. Liu S. Dharmadhikari K. M. Shontz L. Kreber S. Sperber J. Yu W. Y. Byun S. C. Nyirjesy Bioeng. Transl. Med. 2023 8 10525 10.1002/btm2.10525 PMC10487308 37693070 28 S. Iwasaki K. Deguchi R. Iwai Y. Nakayama H. Okuyama Bioengineering 2024 11 243 38534518 10.3390/bioengineering11030243 PMC10968659 29 S. Wei Y. Zhang F. Luo K. Duan M. Li G. Lv Bioeng. Transl. Med. 2024 9 10671 10.1002/btm2.10671 PMC11256149 39036086 30 L. Soriano T. Khalid D. Whelan N. O'Huallachain K. C. Redmond F. J. O'Brien C. O'Leary S. Cryan Eur. Respir. Rev. 2021 30 210154 34750116 10.1183/16000617.0154-2021 PMC9488721 31 Y. Xu Y. Guo Y. Li Y. Huo Y. She H. Li Z. Jia G. Jiang G. Zhou Z. You L. Duan Adv. Funct. Mater. 2020 30 2004276 32 Y. Sun Y. Huo X. Ran H. Chen Q. Pan Y. Chen Y. Zhang W. Ren X. Wang G. Zhou Y. Hua Bioact. Mater. 2024 32 52 37818289 10.1016/j.bioactmat.2023.09.011 PMC10562117 33 E. Gao Y. Wang P. Wang Q. Wang Y. Wei D. Song H. Xu J. Ding Y. Xu H. Xia R. Chen L. Duan Adv. Funct. Mater. 2023 33 2212830 34 W. Dai X. Gong C. Wang P. Liu W. Shi J. Cheng C. Cao X. Hu J. Wang Y. Ao Chem. Eng. J. 2024 498 155138 35 R. Wang B. Mehrjou D. Dehghan Banian B. Y. H. Wang Q. Li S. Deng C. Liu Z. Zhang Y. Zhu H. Wang D. Li X. Lu J. C. Y. Cheng M. T. Y. Ong H. F. Chan G. Li P. K. Chu W. Y. W. Lee Arthr. Rheumatol. 2025 77 283 39482250 10.1002/art.43028 PMC11865692 36 L. Rijns M. J. Hagelaars J. J. B. van der Tol S. Loerakker C. V. C. Bouten P. Y. W. Dankers Adv. Mater. 2024 36 2300873 10.1002/adma.202300873 37264535 37 Y. Ma T. Han Q. Yang J. Wang B. Feng Y. Jia Z. Wei F. Xu Adv. Funct. Mater. 2021 31 2100848 38 Q. Li S. Xu Q. Feng Q. Dai L. Yao Y. Zhang H. Gao H. Dong D. Chen X. Cao Bioact. Mater. 2021 6 3396 33842736 10.1016/j.bioactmat.2021.03.013 PMC8010633 39 M. Najberg M. Haji Mansor T. Taillé C. Bouré R. Molina‐Peña F. Boury J. L. Cenis E. Garcion C. Alvarez‐Lorenzo Carbohydr. Polym. 2020 237 116107 32241442 10.1016/j.carbpol.2020.116107 40 A. Kopp R. Smeets M. Gosau N. Kröger S. Fuest M. Köpf M. Kruse J. Krieger R. Rutkowski A. Henningsen S. Burg Bioact. Mater. 2020 5 241 32123778 10.1016/j.bioactmat.2020.01.010 PMC7036448 41 Z. Zhu S. Ling J. Yeo S. Zhao L. Tozzi M. J. Buehler F. Omenetto C. Li D. L. Kaplan Adv. Funct. Mater. 2018 28 1704757 32440259 10.1002/adfm.201704757 PMC7241598 42 S. Yang C. Zhao Y. Yang J. Ren S. Ling ACS Nano 2023 17 7662 37042465 10.1021/acsnano.3c00105 43 J. P. de Magalhães Sci. Amer. Assoc. Adv. Sci. 2024 384 1300 44 X. Li C. Li W. Zhang Y. Wang P. Qian H. Huang Signal Transduct. Target. Ther. 2023 8 239 37291105 10.1038/s41392-023-01502-8 PMC10248351 45 W. Xia M. Li X. Jiang X. Huang S. Gu J. Ye L. Zhu M. Hou T. Zan J. Nanobiotechnol. 2022 20 144 10.1186/s12951-022-01348-2 PMC9744129 35305652 46 A. Salminen Ageing Res. Rev. 2023 89 101995 37391015 10.1016/j.arr.2023.101995 47 A. N. Kundu C. E. Dougan S. Mahmoud A. Kilic A. Panagiotou N. R. Richbourg N. Irakoze S. R. Peyton Adv. Mater. 2023 35 2301493 10.1002/adma.202301493 PMC10528529 37227134 48 Z. Li S. Zhang Z. Fu Y. Liu Z. Man C. Shi C. Tang C. Chen Q. Chai Z. Yang J. Zhang X. Zhao H. Xu M. Han Y. Wang Z. Liao G. Yu B. Shi K. Zhao W. Li X. Jiang Sci. Adv. 2023 9 adg3365 10.1126/sciadv.adg3365 PMC10413653 37256944 49 S. Wang Z. Yao X. Zhang J. Li C. Huang Y. Ouyang Y. Qian C. Fan Adv. Sci. 2022 9 2270199 10.1002/advs.202202542 PMC9631092 36000796 50 K. Li S. Hu J. Huang Y. Shi W. Lin X. Liu W. Mao C. Wu C. Pan Z. Xu H. Wang L. Gao H. Chen Nano Today 2023 50 101839 51 M. Mammana A. Bonis V. Verzeletti A. Dell Amore F. Rea Bioengineering. 2024 11 198 38391684 10.3390/bioengineering11020198 PMC10886658 52 A. M. Al‐Ayoubi S. S. Rehmani C. F. Sinclair R. S. Lebovics F. Y. Bhora Ann. Thorac. Surg. 2017 103 381 27983955 10.1016/j.athoracsur.2016.10.034 53 M. A. Khan S. Bhusal C. L. Lau A. S. Krupnick Front Immunol. 2025 16 1567657 40438113 10.3389/fimmu.2025.1567657 PMC12116303 54 M. Ohno Y. Fuchimoto H. Hsu M. Higuchi M. Komura T. Yamaoka A. Umezawa S. Enosawa T. Kuroda Pediatr. Surg. Int. 2017 33 1065 28819688 10.1007/s00383-017-4138-8 55 Y. Zhang S. Wei M. Li G. Lv Front. Bioeng. Biotechnol. 2024 12 1452780 39234265 10.3389/fbioe.2024.1452780 PMC11371696 56 E. M. Genden B. M. Laitman Transplantation 2023 107 1698 36782283 10.1097/TP.0000000000004509 57 M. J. Elliott C. R. Butler A. Varanou‐Jenkins L. Partington C. Carvalho E. Samuel C. Crowley P. Lange N. J. Hamilton R. E. Hynds T. Ansari P. Sibbons A. Fierens C. Mclaren D. Roebuck C. Wallis N. Muthialu R. Hewitt D. Crabbe S. M. Janes P. De Coppi M. W. Lowdell M. A. Birchall Stem Cells Transl. Med. 2017 6 1458 28544662 10.1002/sctm.16-0443 PMC5689750 ",
  "metadata": {
    "Title of this paper": "Engineered Anti‐Senescence Trachea With Post‐Transplanted Regenerative Homeostasis",
    "Journal it was published in:": "Advanced Science",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12462952/"
  }
}