{
  "title": "Paper_1082",
  "abstract": "pmc Neuropsychiatr Dis Treat Neuropsychiatr Dis Treat 503 neurodist ndt Neuropsychiatric Disease and Treatment 1176-6328 1178-2021 Dove Press PMC12478207 PMC12478207.1 12478207 12478207 41030888 10.2147/NDT.S543628 543628 1 Original Research Study on the Therapeutic Effect of Yu-Mu-Tiao-Shen Acupuncture on Rats with Autism Spectrum Disorder Jia et al Jia et al Jia Qianfang  1  2  3  4 * http://orcid.org/0009-0001-9991-6419 Wang Xiaofang  4 * Li Zihan  5 Li Wenjing  1 Jia Ru  1 Yue Zhixia  1 Zhu Zijian  6 Ma Bingxia  7 1 Department of Children Rehabilitation, First Affiliated Hospital of Xinxiang Medical University Xinxiang People’s Republic of China 2 Xinxiang Key Laboratory of Autism Disease Mechanism Research Xinxiang People’s Republic of China 3 Xinxiang Autism Integration Education Engineering and Technology Research Center Xinxiang People’s Republic of China 4 Hebei University of Chinese Medicine Shijiazhuang People’s Republic of China 5 First Clinical College of Xinxiang Medical University Xinxiang People’s Republic of China 6 The First Affiliated Hospital of Xinxiang Medical University, School of Medical Engineering, Xinxiang Medical University Xinxiang Henan People’s Republic of China 7 First Affiliated Hospital of Henan University of Traditional Chinese Medicine, Pediatrics College Zhengzhou People’s Republic of China Correspondence: Bingxia Ma, Email mbx1963@126.com * These authors contributed equally to this work 25 9 2025 2025 21 478630 2195 2210 29 5 2025 18 9 2025 25 09 2025 30 09 2025 01 10 2025 © 2025 Jia et al. 2025 Jia et al. https://creativecommons.org/licenses/by-nc/4.0/ This work is published and licensed by Dove Medical Press Limited. The full terms of this license are available at https://www.dovepress.com/terms.php http://creativecommons.org/licenses/by-nc/4.0/ https://www.dovepress.com/terms.php Purpose Acupuncture has been shown to improve symptoms of Autism Spectrum Disorder (ASD), but its underlying mechanisms remain unclear. This study aims to explore the behavioral effects of Yu-Mu-Tiao-Shen Acupuncture on ASD model rats and investigate the potential molecular mechanisms based on SFRP5, β-catenin, and GSK-3β. Patients and Methods On gestation day 12.5, SD (Sprague-Dawley) rats were intraperitoneally injected with valproic acid (VPA), and their offspring were considered a reliable ASD rat model. The offspring were randomly assigned to the VPA group or the VPA_acupuncture group (n=7), with a normal group serving as the control. The VPA_acupuncture group underwent Yu-Mu-Tiao-Shen Acupuncture from postnatal days 8 to 28. All rats underwent behavioral testing, including social interaction, open field, and Morris water maze tests. Subsequently, hippocampal and prefrontal cortical tissues were extracted for histological analysis and RNA sequencing to assess gene expression differences across groups, as well as protein expression in hippocampal tissues. Results Behavioral tests demonstrated that the Yu-Mu-Tiao-Shen acupuncture technique improved spontaneous activity, abnormal social interaction, and alleviated learning and memory impairments in autistic rat models. In the VPA_acupuncture group, total travel distance, average speed, social interaction time, time spent exploring novel rats, and the number of platform crossings were significantly increased (P < 0.05). Transmission electron microscopy revealed abnormal synaptic and mitochondrial structures in the hippocampal tissue of the VPA group. In contrast, the SD and VPA_acupuncture groups showed relatively intact pre- and post-synaptic membrane structures and normal mitochondrial morphology. Differentially expressed gene (DEG) analysis revealed 111 significantly altered genes in the hippocampus and 282 in the prefrontal cortex between the VPA_acupuncture and VPA groups. Furthermore, in the VPA_acupuncture group, the hippocampal expression levels of SFRP5, β-catenin, and GSK-3β proteins were significantly reduced compared to the model group (P < 0.05). Conclusion Yu-Mu-Tiao-Shen Acupuncture can regulate the expression of relevant proteins, modulating synaptic plasticity in hippocampal and prefrontal neurons, which effectively improves motor, social cognitive, and spatial memory abilities in ASD rats. This study provides valuable insights for further exploration of ASD treatments. Graphical Abstract  Keywords Yu-Mu points sishencong points acupuncture ASD autism spectrum disorder behavioral experiments pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement no pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes Introduction Autism Spectrum Disorder (ASD) is a severe neurodevelopmental disorder, with a steadily increasing global prevalence in recent years, resulting in a significant burden on affected families and society. 1 2 3 4–6 As an important component of traditional Chinese medicine, acupuncture has gradually garnered increasing attention in the treatment of ASD. 7 8 9 10 11 12–14 Traditional Chinese Medicine (TCM) theories such as the “Heart-Brain Connection Theory”, “Xuanfu Theory”, and the “Transformation and Steaming Theory” provide a theoretical basis for the Yu-mu-Tiao-shen acupuncture technique, elucidating its significance in regulating organ functions, balancing the flow of Qi, blood, and Yin-Yang, and improving neurological and psychiatric disorders. The “Shenyu” point helps to calm the Qi and regulate the mind. The “Pishu” point strengthens the spleen, generates blood, and nourishes the heart to calm the spirit. The “Shenshu” point has a tonifying effect on the kidneys and strengthens the marrow, promoting mental calmness. The “Mu points” are all located in the abdominal region around the gastric area, with the “Zhongfu” point regulating Qi and unblocking meridians, relieving liver Qi stagnation. The “Zhongwan” point, a Mu point of the stomach, adjusts the Qi mechanism of the five organs, strengthens the spleen and stomach, and generates Qi and blood. The “Guanyuan” point, a Mu point of the small intestine, supplements the original Qi, and tonifies the kidneys, consolidating the foundation. The “Shuyu” and “Mu” points are two specific types of acupuncture points—one located anteriorly, the other posteriorly, one Yin and one Yang. When used together, they complement each other to harmonize Yin and Yang, facilitate the flow of Qi through the organs and meridians, regulate the balance of Qi and blood, and coordinate the mental state of the five organs. The “Four Spirit Needle” technique has various therapeutic effects, including sedating the spirit, opening the orifices and awakening the brain, calming the liver and extinguishing wind, dispelling wind and relieving pain, and promoting blood circulation and unblocking meridians. 15 16 Clinically, the combination of “Shuyu” and “Mu” points is used to apply the corresponding acupoints of the affected organs in order to exert a synergistic effect for the treatment of various diseases. Studies have shown that rapid needling of the “Shuyu” and “Mu” points can improve sleep disorders in children with ASD and alleviate core symptoms. 17 18 19 20 21 Functional imaging studies have confirmed that acupuncture specifically activates the left hippocampus and bilateral pons, enhancing the functional connectivity between the parietal and frontal lobes to improve language cognition. 22 23 24 17 Based on this, the present study proposes a multi-acupoint combination acupuncture treatment plan, which integrates the theory of “Shuyu and Mu point combination” in Traditional Chinese Medicine with the concept of “spiritual regulation”. The “Yu-Mu-Tiao-Shen acupuncture” is used to improve the behavior, social cognition, and spatial memory function of rats in a VPA-induced ASD model. Additionally, RNA sequencing and Western blot (WB) techniques are employed to further explore the potential mechanisms, providing a more systematic and scientific reference for acupuncture treatment of ASD. Materials and Methods Animals and Grouping The experiment involved 15 female SD rats and 15 male SD rats, all aged 6 weeks, with a weight of 200 ± 20g. The rats were kept in an environment with a temperature of 21–24°C, humidity of 50–60%, and a 12-hour light/dark cycle. They had free access to food and water. After 1 week of acclimatization, the rats were divided into groups and subjected to interventions. Vaginal smears were taken from female rats, and the day when sperm was observed under the microscope was marked as day 1 of pregnancy. Using the Matlab R2022a random number generation function, the pregnant rats were randomly assigned to two groups: the VPA group (n = 12) and the control group (n = 3). The VPA group received an intraperitoneal injection of valproic acid (600 mg/kg) on day 12.5 of pregnancy, which led to offspring showing neurodevelopmental abnormalities and displaying ASD-like behaviors at birth. The control group received an equal volume of saline injection at the same time. The expected duration of the study for the newborn rats was from PND 0 to PND 21. We followed the method described by Roulle et al. 24 Figure 1 Figure 1 Model Preparation and Experimental Procedure. All experiments followed the National Standards for Laboratory Animal Management. This study was approved by the Animal Ethics Committee of Henan University of Chinese Medicine (IACUC-202404016). Intervention During the period from PND 8 to 28, rats in the VPA_acupuncture group received daily acupuncture treatment. The acupuncture points included Sishen (EX-NH1), Feishu (BL 13), Shenshu (BL 23), Shanzhong (CV 17), Zhongwan (CV 12), Guanyuan (CV 4), Shenmen (HT 7), Pishu (BL 20), and Qimen (LR 14), with a needle depth of 3mm. During the Sishen acupuncture, the needle tip was directed toward Baihui (GV 20), and the needle was retained for 20 minutes. The procedure employed the horizontal insertion technique, with the needle positioned at a 15–20° angle to the skin surface, ensuring that the sensation of the needle was conducted toward the Baihui area. After needling in the other acupuncture points, rapid needling was performed, as shown in Figure 2 Figure 2 Experimental diagram of acupuncture. Notes A B C Both the SD and VPA groups also underwent restraint to minimize the physiological responses caused by handling, which could introduce errors into the experimental results, thus improving the reliability of the findings. Behavioral Experiments Open Field Test On the night of PND 29, the three groups of rats were placed in an open field (40cm × 40cm × 40cm) for an open field test. The walls and bottom of the box were black and opaque. The rats were allowed to explore freely for 10 minutes, and their movements were continuously monitored and recorded using tracking software (TopScanLite). We recorded the rats’ movement trajectories, velocity, time spent in the center area of the field, and other behavioral parameters to assess their exploratory behavior and locomotor activity. The experiment was conducted quietly, and between two tests, the box was cleaned with 75% alcohol and cotton cloths to eliminate any odors. Three-Chamber Social Test On PND 30, the three-chamber social interaction test was conducted to evaluate the rats’ social interest and social memory. The rectangular three-chamber apparatus, visible within the camera’s field of view, was divided into three sections, each separated by transparent resin glass, with channels connecting them. The test subject was placed in the center chamber, and a same-strain, same-gender unfamiliar rat was placed in the upper right chamber. After the subject rat became familiar with the environment for 3–5 minutes, it was reintroduced into the center chamber, and its movement trajectories were recorded for social behavior evaluation. Following this, a social novelty preference test was performed. The experimental animal was placed in the central starting area, and the side compartment was closed off. An unfamiliar stimulus rat was introduced into the previously empty side chamber, making it the novel rat. We continuously recorded the movement trajectories and dwell times of the experimental subject in both side chambers to quantify its preference for the novel social stimulus. The experiment was conducted quietly, and between two tests, the box was cleaned with 75% alcohol and cotton cloths to remove any odors. Morris Water Maze Test On PND 31, the Morris water maze (MWM) test was conducted to assess the rats’ spatial learning and memory abilities. The diameter of the water maze was 160 cm, and a circular platform with a diameter of 8 cm was placed 35 cm from the pool wall at the center of the third quadrant. A camera visible within the experimental area was used to track the rat’s movements. The rats were placed on the platform and allowed to search for the platform until they successfully found it, and their movement trajectories were recorded. Tissue Preparation Twenty-four hours after completion of behavioral testing, the experimental rats were anesthetized using a gas anesthesia machine (R520IP, RWD, China) in an induction chamber. The initial anesthesia parameters were set at 5% isoflurane mixed gas at a flow rate of 0.2 L/min. After confirming deep anesthesia following a 5-minute induction period, cervical dislocation was performed for euthanasia. The whole brain was immediately extracted and rinsed with physiological saline to remove blood residues. After drying the surface with filter paper, the brain was placed in a pre-chilled Petri dish on ice. Coronal sections were used to sample the prefrontal cortex (within 2 mm anterior to bregma), and hippocampal tissue was carefully isolated. Portions of the tissue were aliquoted into 2 mL sterile Eppendorf tubes and stored at −80 °C for subsequent analyses. Transmission Electron Microscope The remaining hippocampal tissue was prepared for transmission electron microscopy (TEM) to observe ultrastructural features. Tissue blocks were trimmed to 1 mm × 1 mm and sectioned at a thickness of 100–110 nm. Sections were stained with 1% toluidine blue for 5 minutes, followed by rinsing. Ultrastructural observations of cellular morphology, organelles, and synaptic structures were conducted under TEM. Non-Targeted Genomics Analysis For transcriptome analysis, mRNA-Seq was performed on the prefrontal cortex and hippocampus of rats from the control, model, and acupuncture groups to investigate differential gene expression. FastQC was used to assess sequence quality, HISAT2 was used for aligning sequences to the rat reference genome, and DESeq2 was employed for gene expression quantification and comparison across groups. Expression of SFRP5, β-Catenin, and GSK-3β Proteins in Hippocampus Hippocampal tissues stored at −80 °C were used for total protein extraction. Equal amounts of protein (30 μg) were separated by SDS-PAGE and transferred to membranes for Western blotting. Bands were visualized using a gel imaging system, and grayscale values were quantified using ImageJ software, with β-actin serving as the internal control. Statistical Analysis Data analysis was conducted using MATLAB. Results are presented as mean ± standard deviation (±SD). One-way ANOVA was used to determine statistical significance among groups, followed by Bonferroni post hoc tests. A p-value < 0.05 was considered statistically significant. Results Behavioral Results Analysis Acupuncture Improved Spontaneous Activity in a Rat Model of VPA The open field test (OFT), three-chamber social interaction test, and Morris water maze (MWM) are established paradigms for evaluating animal behavior and cognitive function. In the OFT, representative locomotor trajectories of VPA_acupuncture and SD groups are shown in Figure 3A Table 1 Figure 3B C Table 1 Comparison of Open Field Test Results Across Groups Group Total Distance (mm) Average Speed (mm/s) SD 23869.46±4000.54 39.78±6.67 VPA 9061.94±2820.45 a 15.10±4.70 a VPA_Acupuncture 23904.55±4656.57 b 39.84±7.76 b F-Value 23.12 23.11 P-value <0.001 <0.001 Notes a (P < 0.05) b (P<0.05) Figure 3 Results of open field test. Notes B C Acupuncture Improved Abnormal Social Activity in a VPA Rat Model In the three-chamber social interaction test, the VPA_acupuncture group displayed normal patterns of social interest and memory, with significant improvements compared to the VPA group (P < 0.001). Representative movement trajectories during the social novelty preference test are shown in Figure 4A Figures 4B C Table 2 Table 2 Time Spent in Each Zone During the Three-Chamber Social Test for Each Group [(±s), n=7] Experiment 1: Assessment of Experiment 2: Social Novelty Group Time Spent Visiting Rat (s) Time Spent Visiting Novel Rat (s) SD 368.09 ± 60.13 340.10 ± 119.17 VPA 182.80 ± 74.15 a 113.80 ± 83.52 a VPA_Acupuncture 345.18 ± 40.01 a 350.39 ± 90.54 a F-Value 16.88 10.68 P-value <0.001 <0.001 Notes a (P < 0.05) Figure 4 Results of Three-chamber social test. Notes A B C Acupuncture Alleviated Impaired Learning and Memory in the VPA Rat Model In the Morris water maze test, the model group showed fluctuating latency times that were significantly longer than those of the control group, whereas the acupuncture group demonstrated latency patterns closer to those of the control group, with no significant difference between the two (P > 0.05) and notably reduced error margins compared to the model group. The number of successful platform landings was significantly higher in the acupuncture group than in the model group (P < 0.01), suggesting that acupuncture reduced behavioral variability and improved spatial memory in ASD model rats. Representative trajectories for each group are shown in Figure 5A Figures 5B–E Figure 5 Results of Morris Water Maze Experiment. Notes A B C D E Transmission Electron Microscopy Analysis In this study, we also analyzed the effects of acupuncture on the autism model rats. The control group showed relatively mild synaptic damage, with the mitochondrial structure still intact, the pre- and post-synaptic membrane structures continuous, an appropriate number of synaptic vesicles, and minimal damage. The synaptic gap was clear, with an appropriate width. In the acupuncture group, the mitochondria appeared slightly swollen, the pre- and post-synaptic membrane structures were clear but slightly shorter, the number of synaptic vesicles was moderate, with a small amount of damage, and the synaptic gap appeared somewhat blurred. The ASD group showed the most severe damage, with slight mitochondrial swelling, the pre- and post-synaptic membranes slightly blurred or broken, a reduced number of synaptic vesicles, most of them damaged, and a synaptic gap that was blurred and slightly narrow ( Figure 6 Figure 6 Figure 6 Results of transmission electron microscopy. Notes A B Untargeted Genomic Analysis of Biological Samples Due to its cysteine-rich domain and high similarity to the Wnt binding site on curling proteins, Sfrp5 has the ability to regulate core processes such as cell proliferation, differentiation, and migration. 25 26 27 In this study, we also analyzed the effect of acupuncture on gene expression in autism model rats. Log1 transformation of the data revealed that there were 111 differentially expressed genes (DEGs) in the hippocampus between the acupuncture and model groups ( Figure 7A Figure 7B Figure 7C Figure 7D Figure 7 RNA result analysis. Notes A B C D Western Blot (WB) Western blotting results showed that in the hippocampus, the expression levels of β-catenin and GSK-3β in the model group were significantly lower than those in the normal and acupuncture groups (P < 0.05) ( Figure 8 Figure 9 Figure 8 Results of immunoimprinting of β-catenin and GSK-3β protein. Notes A B C D Figure 9 Results of immunoimprinting of SFRP5 protein. Notes A B C D Discussion The prenatal valproic acid exposure model is an important animal model in autism spectrum disorder research, as it effectively replicates the core behavioral and neuropathological features of ASD and is widely used. 28 29 In the context of the rising diagnosis rates of autism in children, finding effective intervention methods has become particularly important. Acupuncture, originating from traditional Chinese medicine, is one of the treasures of Chinese culture that has been passed down and developed over thousands of years. This paper proposes a multi-point combination acupuncture treatment plan that integrates the theory of acupoint selection from Traditional Chinese Medicine with the “regulation of the mind” concept, combining them into the “Yumu Acupuncture”. The effectiveness of acupuncture in treating autism has been clinically confirmed, but research into its potential related neurobiological biomarkers and neural circuits is also crucial. In previous ASD animal studies, acupuncture interventions were typically administered after postnatal day 23 (PND23), 22 30 We found that in the open field test, the VPA-induced model group showed a greater tendency to stay in the peripheral area compared to the SD and VPA_acupuncture groups, indicating an elevated baseline anxiety level in the model rats. Acupuncture significantly alleviated this anxiety. Additionally, the VPA_acupuncture group exhibited a significant increase in both total distance traveled and average speed compared to the VPA group, reaching levels comparable to the SD group, suggesting that acupuncture helped restore motor function to near-normal levels. These results indicate that the Yu-Mu-Tiao-Shen Acupuncture method significantly improves motor ability in ASD model rats, which is consistent with the findings of He J et al using electroacupuncture treatment. 31 Neurons, as the basic functional units of the central nervous system, process information through their electrical excitability and dendrites. Synapses, specialized structures for communication between neurons, exhibit plasticity, which forms the cellular basis for cognitive functions. Mitochondria produce ATP through oxidative phosphorylation and regulate calcium homeostasis and reactive oxygen species (ROS) levels, providing metabolic support for the energy-demanding neuronal activities and synaptic transmission. Transmission electron microscopy results show that synaptic damage in the VPA group of rats was relatively more severe, while in the VPA_acupuncture group, mitochondrial swelling was reduced compared to the VPA group, and the pre-and post-synaptic membrane structures were clearer and more abundant, with an increased number of synaptic vesicles. The neuronal cell membrane structure in the VPA _acupuncture group was more intact compared to the VPA group, with fewer dissolutions in the matrix and cristae. These findings suggest that the Yu-Mu-Tiao-Shen cupuncture method may be related to synaptic remodeling and could have a certain reparative effect. Furthermore, we observed that this result aligns with the trend observed in the transmission electron microscopy findings of Chen S et al, who used acupuncture at the “GV24” and bilateral “GB13” acupuncture points, both of which showed some improvement after treatment. 32 Among the differentially expressed genes (DEGs), there were significant differences between the VPA_acupuncture group and the VPA group. KEGG pathway analysis revealed that the DEGs between these two groups were primarily enriched in biological processes such as central nervous system development, cell differentiation, and regulation of the Wnt signaling pathway. Abnormalities in cell differentiation, metabolism, and signaling pathways may contribute to the pathogenesis of ASD, and acupuncture may alleviate clinical manifestations and symptoms of ASD by reducing the number of these dysregulated pathways. Through clustering analysis and extensive literature review, the authors identified key DEGs closely associated with the pathogenesis of autism and the therapeutic mechanisms of acupuncture. Among these, the SFRP5 gene—currently a research hotspot—plays a crucial regulatory role in the Wnt signaling pathway. Due to the high structural similarity between its cysteine-rich domain and the Wnt-binding site of Frizzled receptors, SFRP5 is capable of modulating essential processes such as cell proliferation, differentiation, and migration. The SFRP5/Wnt signaling pathway has been reported to induce the secretion of pro-inflammatory cytokines and chemokines in neurodegenerative diseases. Previous studies have highlighted the pivotal role of SFRP5 in various pathological conditions, suggesting that it may participate in the pathogenesis of ASD through interactions between metabolic and neural mechanisms. The results of the above study suggest that the Yu-Mu-Tiao-Shen acupuncture technique can significantly improve the motor, social cognitive, and spatial memory abilities of rats. This indicates that the therapeutic effect of acupuncture is not solely due to the mechanical stimulation at the acupuncture sites, but may involve more complex biological effects. In the three-chamber social interaction test, there were significant differences in the time spent by each group in the different sections, but the overall trend did not affect the assessment of the effect of the Yu-Mu Tiao-Shen acupuncture technique on the rats’ social behavior. However, despite achieving some positive results, this study has certain limitations, such as the lack of a placebo acupuncture group and the potential individual differences among the experimental rats. More autism models are needed to validate our further findings. Additionally, the interactions between the various differentially expressed genes, synaptic structural and functional changes, and how they work together in the autistic rat model need to be explored in future research. These issues are crucial for further understanding the pathogenesis, particularly for identifying drug targets and improving the prevention and treatment of autism. In conclusion, this study designed and validated the role of the Yu-Mu-Tiao-Shen acupuncture technique in improving social behavior at the behavioral level in ASD rat models. It provides guidance for future in-depth exploration of its objective mechanisms in genomics and metabolomics, offering a more effective and standardized reference for acupuncture treatment of ASD. Conclusion In conclusion, this study designs and verifies the effect of Yu-mu-Tiao-Shen acupuncture on the improvement of social behavior in ASD model rats at the behavioral level, providing guidance for further in-depth research on its mechanisms in genomics and metabolomics. It also offers a more effective and standardized reference for acupuncture treatment of ASD. Acknowledgments This research was financially supported by grants from 2023 Special Project for Scientific Research in Henan Province (HSRP-DFCTCM-2023-3-06) and Henan Provincial Medical Science and Technology Tackling Program Joint Co-construction Project (LHGJ20210516). Data Sharing Statement The datasets created and examined in this study can be obtained from the corresponding author upon reasonable request. Ethics All experiments followed the National Standards for Laboratory Animal Management. This study was approved by the Animal Ethics Committee of Henan University of Chinese Medicine (IACUC-202404016). Author Contributions All authors made a significant contribution to the work reported, whether that is in the conception, study design, execution, acquisition of data, analysis and interpretation, or in all these areas; took part in drafting, revising or critically reviewing the article; gave final approval of the version to be published; have agreed on the journal to which the article has been submitted; and agree to be accountable for all aspects of the work. Disclosure The authors report no conflicts of interest in this work. References 1. Howes OD Rogdaki M Findon JL Autism spectrum disorder: consensus guidelines on assessment, treatment and research from the British association for psychopharmacology J Psychopharmacol 2018 32 1 3 29 10.1177/0269881117741766 29237331 PMC5805024 2. Talantseva OI Romanova RS Shurdova EM The global prevalence of autism spectrum disorder: a three-level meta-analysis Front Psychiatry 2023 14 1071181 10.3389/fpsyt.2023.1071181 36846240 PMC9947250 3. Lord C Bishop SL Recent advances in autism research as reflected in DSM-5 criteria for autism spectrum disorder Annu Rev Clin Psychol 2015 11 1 53 70 10.1146/annurev-clinpsy-032814-112745 25581244 4. Derieux C Léauté A Brugoux A Chronic sodium bromide treatment relieves autistic-like behavioral deficits in three mouse models of autism Neuropsychopharmacology 2022 47 9 1680 1692 10.1038/s41386-022-01317-1 35418620 PMC9283539 5. Tyzio R Nardou R Ferrari DC Oxytocin-mediated GABA inhibition during delivery attenuates autism pathogenesis in rodent offspring Science 2014 343 6171 675 692 10.1126/science.1247190 24503856 6. Brignell A Marraffa C Williams K May T Memantine for autism spectrum disorder Cochrane Database Syst Rev 2022 8 8 CD013845 10.1002/14651858.CD013845.pub2 36006807 PMC9409629 7. Bianco G Fascial neuromodulation: an emerging concept linking acupuncture, fasciology, osteopathy and neuroscience Eur J Transl Myol 2019 29 3 8331 10.4081/ejtm.2019.8331 31579478 PMC6767840 8. Sun Y Chen Z Xu Y Functional recovery with electro-acupuncture stimulation in an Mecp2-knockout rat model of Rett syndrome Engineering 2022 12 83 89 10.1016/j.eng.2020.06.032 9. Lee B Kim BK Kim HJ Efficacy and safety of electroacupuncture for insomnia disorder: a multicenter, randomized, assessor-blinded, controlled trial Nat Sci Sleep 2020 13 1145 1159 10.2147/NSS.S281231 PMC7735782 33328773 10. Liu SH Shi XJ Fan FC Peripheral blood neurotrophic factor levels in children with autism spectrum disorder: a meta-analysis Sci Rep 2021 11 1 15 10.1038/s41598-020-79080-w 33420109 PMC7794512 11. Yu Z Zhang P Tao C Efficacy of nonpharmacological interventions targeting social function in children and adults with autism spectrum disorder: a systematic review and meta-analysis PLoS One 2023 18 9 e0291720 10.1371/journal.pone.0291720 37725597 PMC10508624 12. Yang J Pei Y Pan YL Enhanced antidepressant-like effects of electroacupuncture combined with citalopram in a rat model of depression Evid Based Complement Alternat Med 2013 2013 107380 10.1155/2013/107380 23737815 PMC3666268 13. Xu J She Y Su N Zhang R Lao L Xu S Effects of electroacupuncture on chronic unpredictable mild stress rats depression-like behavior and expression of p-ERK/ERK and p-P38/P38 Evid Based Complement Alternat Med 2015 2015 650729 10.1155/2015/650729 26366182 PMC4558448 14. Zhang Y Zeng J Wu D Effect and safety of acupuncture for autism spectrum disorders: a protocol for systematic review and meta-analysis Medicine 2021 100 11 e22269 10.1097/MD.0000000000022269 33725922 PMC7982233 15. Li X Li JC Lu QQ Research status and prospects of acupuncture for autism spectrum disorders Front Psychiatr 2023 14 942069 10.3389/fpsyt.2023.942069 PMC10248508 37304438 16. Dang W-L Ma B-X Cognition of children with autistic disorder based on Xuanfu theory and steaming changes in infant theory China J Tradition Chinese Med Pharm 2020 35 4914 4916 17. Li W Dang W Effect of rapid needling at shu acupoint and mu acupoint on core clinical symptoms of children with autism spectrum Acta Chinese Med 2022 37 1792 1797 18. Zhang J Ma B Clinical study on method of quick needling at shumu point for children with autism spectrum disorder New Chinese Med 2021 53 144 147 19. Zhang C Wang L Clinical effect of acupuncture combined with rehabilitation training on children with autism spectrum disorder Hebei J Trad Chin Med 2022 44 288 291 20. Du F Qi P Yang F Clinical effect of scalp acupuncture combined with sandplay on autism spectrum disorder in children Clin Res Pra 2022 7 113 116 21. Zhang H Shang Q Ma C Effects of acupuncture combined with sensory integration training and exercise intervention on autistic children J Clin Pathol Res 2019 39 371 376 22. Chen S Huang L Liu G Acupuncture ameliorated behavioral abnormalities in the autism rat model via pathways for hippocampal serotonin Neuropsychiatr Dis Treat 2023 19 951 972 10.2147/NDT.S398321 37096024 PMC10122481 23. Chen S Wang J Chen X Chinese acupuncture: a potential treatment for autism rat model via improving synaptic function Heliyon 2024 10 17 e37130 10.1016/j.heliyon.2024.e37130 39286195 PMC11402746 24. Roullet F Wollaston L Decatanzaro D Beha-vioral and molecular changes in the mouse in response to prenatal exposure to the anti-epileptic drug valproicacid Neuroscience 2010 170 2 514 522 10.1016/j.neuroscience.2010.06.069 20603192 25. Zhang Y Ran Y Ma Y Elevated serum SFRP5 levels during preeclampsia and its potential association with trophoblast dysfunction via Wnt/β-catenin suppression Reprod Sci 2022 29 1 163 172 10.1007/s43032-021-00698-w 34382203 26. Yadav SS Hussain S Dwivedi P Assesement of serum Sfrp5/Wnt-5a level and its utility in the risk stratification of treatment naïve patients with metabolic syndrome J Immunoassay Immunochem 2023 44 1 1 12 10.1080/15321819.2022.2104125 35880703 27. Lindner K Beckenbauer K van Ek LC Isoform- and cell-state-specific lipidation of ApoE in astrocytes Cell Rep 2022 38 9 110 115 10.1016/j.celrep.2022.110435 35235798 28. Chaliha D Albrecht M Vaccarezza M A systematic review of the valproic-acid-induced rodent model of autism Dev Neurosci 2020 42 1 12 48 10.1159/000509109 32810856 29. Yang J Li X Tan J Prenatal exposure to valproic acid induces increased autism-like behaviors and impairment of learning and memory functions in rat offspring by upregulating ADAM10 expression Neurochem Res 2025 50 3 14 16 10.1007/s11064-025-04398-8 PMC12003443 40240730 30. Center for Disease Control and Prevention Treatment and intervention services for autism spectrum disorder NCBDDD 2020 31. He J Zhao C Liu W Neurochemical changes in the hippocampus and prefrontal cortex associated with electroacupuncture for learning and memory impairment Int J Mol Med 2018 41 2 709 716 10.3892/ijmm.2017.3287 29207061 PMC5752233 32. Chen S Wang J Chen X Chinese acupuncture: a potential treatment for autism rat model via improving synaptic function Heliyon 2024 10 12 17 10.1016/j.heliyon.2024.e37130 PMC11402746 39286195 ",
  "metadata": {
    "Title of this paper": "Chinese acupuncture: a potential treatment for autism rat model via improving synaptic function",
    "Journal it was published in:": "Neuropsychiatric Disease and Treatment",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12478207/"
  }
}