{
  "title": "Paper_639",
  "abstract": "pmc J Clin Med J Clin Med 2745 jclinmed jcm Journal of Clinical Medicine 2077-0383 Multidisciplinary Digital Publishing Institute  (MDPI) PMC12470494 PMC12470494.1 12470494 12470494 41010688 10.3390/jcm14186484 jcm-14-06484 1 Article In Endometrial Cancers Originating from the Uterine Corpus, Does the Location of the Tumor Affect the Prognosis? https://orcid.org/0000-0003-2837-8497 Görgülü Gökşen Writing – original draft 1 * https://orcid.org/0000-0003-3112-0091 Doğan Özdaş Emel Data curation 1 https://orcid.org/0000-0003-2310-6732 Özdaş Erol Data curation 1 https://orcid.org/0000-0002-8574-0627 Küçükatalay Özge 2 https://orcid.org/0000-0002-1719-4257 Kasap Esin Formal analysis 2 https://orcid.org/0000-0002-7060-717X Karadeniz Tuğba Conceptualization 3 https://orcid.org/0000-0002-8494-4302 Sancı Muzaffer Supervision 1 Magann Everett F. Academic Editor 1 egecim2704@gmail.com emelege06@hotmail.com drsanci@yahoo.com 2 ozgekucukatalay@gmail.com dresincelik@windowslive.com 3 tugbakaradeniz@gmail.com * goksengorgulu1923@hotmail.com 15 9 2025 9 2025 14 18 497642 6484 09 6 2025 27 8 2025 10 9 2025 15 09 2025 27 09 2025 29 09 2025 © 2025 by the authors. 2025 https://creativecommons.org/licenses/by/4.0/ Licensee MDPI, Basel, Switzerland. This article is an open access article distributed under the terms and conditions of the Creative Commons Attribution (CC BY) license ( https://creativecommons.org/licenses/by/4.0/ Objectives: Methods: Results: p p p Conclusions: endometrioid adenocarcinoma uterine corpus endometrial cancer uterine wall This research received no external funding. pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement no pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes 1. Introduction Endometrial cancer (EC) is a uterine malignancy with globally increasing mortality and incidence rates [ 1 2 3 4 EC is often identified in its initial stages, which is a promising indicator of prognosis [ 5 6 7 8 Anatomical variations in the uterine wall thickness and lymphovascular drainage pathways may influence tumor behavior within the corpus. Fundus and upper corpus regions typically drain to para-aortic lymph nodes, whereas lower uterine segments and lateral walls drain to pelvic iliac nodal basins, potentially altering patterns of metastasis and recurrence [ 9 10 EC is classified according to its site of origin in two sections of the uterus, the LUS (lower uterine segment) and the UC (uterine corpus), with tumors of UC origin being more common [ 11 12 2. Materials and Methods 2.1. Study Design and Patient Selection This retrospective cohort study was conducted at the University of Health Sciences, İzmir Tepecik Training and Research Hospital. Institutional ethical approval was obtained prior to data collection (approval No: 2022/02-13, date: 15 February 2022). All procedures conformed to the ethical standards outlined in the Declaration of Helsinki and the Good Clinical Practice guidelines. Between January 2015 and January 2022, 664 patients underwent surgery for endometrial cancer at our clinic. Of these patients, 446 had endometrioid adenocarcinoma, 284 of which were Stage 2 or higher. Of the remaining 162 patients, 40 had LUSI. Furthermore, of the remaining 122 patients, 54 did not have a 60-month follow-up period ( Figure 1 2.2. Surgical Procedure All patients underwent total abdominal hysterectomy with bilateral salpingo-oophorectomy. An intraoperative frozen section analysis was performed to assess the depth of myometrial invasion and tumor grade, using a cryostat (CryoStar NX50, Thermo Fisher Scientific, Waltham, MA, USA). Patients with ≥50% myometrial invasion or high-grade tumors (Grade 3) underwent pelvic and para-aortic lymphadenectomy. The surgeries were performed by a consistent team of gynecologic oncologists using standardized techniques. 2.3. Pathology Evaluation Tumor location within the uterine wall was determined based on postoperative final pathology reports, using both macroscopic gross examination of the surgical specimen and microscopic histopathological evaluation. In cases where the macroscopic and microscopic findings differed, the final classification was based on the microscopic assessment. All pathology evaluations were performed by two independent gynecologic pathologists blinded to the clinical outcomes. The inter-rater reliability was assessed based on Cohen’s kappa coefficient, and disagreements were resolved via consensus review. Histopathological evaluation was performed using hematoxylin and eosin (H&E) staining (Dako, Agilent Technologies, Glostrup, Denmark). Postoperative pathology reports were reviewed to confirm the histological subtype, tumor grade, tumor size, depth of myometrial invasion, lymphovascular space invasion (LVSI), and lymph node status. The tumor origin was classified based on the region of the uterine wall in which the tumor was predominantly located, as described in the final pathology report and confirmed by the pathologist. The patients were categorized into four groups based on tumor location: anterior wall, posterior wall, fundus, and lateral wall. 2.4. Adjuvant Therapy Adjuvant therapy indications and protocols followed the National Comprehensive Cancer Network (NCCN) guidelines in effect during the study period. All patients who met the criteria for adjuvant treatment received standardized regimens for their respective risk groups, including external beam radiotherapy, vaginal brachytherapy, or chemotherapy, as indicated. Treatment protocols and dosages were consistent across all tumor location groups to minimize treatment-related variability that could confound survival analysis. No adjuvant treatment was administered to patients with Grades 1–2 tumors, <50% myometrial invasion, and LVSI negativity. Vaginal brachytherapy was given to patients with ≥50% myometrial invasion but negative LVSI and to those with Grades 1–2 tumors and positive LVSI. Patients with Grade 3 tumors and/or ≥50% myometrial invasion received external beam radiotherapy (EBRT), provided they had negative lymph nodes after surgical staging. 2.5. Follow-Up Protocol Patients were followed at 3-month intervals during the first two years, every 6 months for the next three years, and annually thereafter. Clinical evaluation and imaging (MRI or CT scan) were performed at each visit to assess for recurrence. Magnetic resonance imaging (MRI) examinations were performed using a 1.5-Tesla scanner (Siemens Healthineers, Erlangen, Germany), while computed tomography (CT) scans were acquired with a 64-slice scanner (Toshiba Medical Systems, Tokyo, Japan). Disease-free survival (DFS) was defined as the time from primary surgery to either recurrence or last follow-up. Overall survival (OS) was calculated from the date of surgery to death or last follow-up. 2.6. Statistical Analysis SPSS (SPSS Statistics version 22.0, IBM Corp., Armonk, NY, USA, SPSS Inc.) statistical software was used for statistical analysis. Statistical comparisons were made using Scheffe’s post hoc test in the analysis of variance, the Kruskal–Wallis tests for nonparametric variables, and ANOVA for parametric values. To assess categorical data, both Fisher’s exact tests and the Pearson chi-square test were utilized. Categorical variables were presented as numbers and percentages ( n p p 3. Results Over the course of this study, 664 patients diagnosed with EC underwent surgery, and 68 of those who met the specified criteria were incorporated into this study. The mean age of all patients was 58.5 (54–67.75) years. The mean BMI was 36 (30.8–43.8) kg/m 2 Table 1 The patients were separated into four groups according to the region of the uterine wall in which the tumor originated: the anterior wall, posterior wall, fundus, and lateral wall. The mean age of patients in the anterior group was 58 (53–67) years, and their BMI was 37.5 (36–44) kg/m 2 2 2 2 p p Table 2 p p Table 2 p Table 2 p p p p Table 2 Figure 2 When it came to comparing survival between the groups, no meaningful difference was observed according to DFS and OS ( p p p Table 2 Figure 2 Figure 3 An odds ratio analysis revealed that LVSI was present in 43.5% of anterior/posterior tumors compared with 13.3% of fundal/lateral tumors (OR 5.00, 95% CI 1.52–16.45, p p p Table 3 4. Discussion This study found that the presence of LVSI and the ex rate were higher in EC tumors originating from the anterior and posterior walls of the UC compared with tumors originating from the fundus and lateral walls. Increased BMI (obesity), postmenopausal status, advanced age, nulliparity, and systemic diseases such as DM and HT are known to be important demographic risk factors for the development of EC [ 13 14 In a study conducted by Kizer et al. which included 481 patients, no meaningful difference was found between corpus ( n n 15 In studies comparing patients with endometrioid-type adenocarcinoma with and without LUSI in terms of myometrial invasion and grade, a notable difference was observed in regard to myometrial invasion. Still, no meaningful difference was found regarding grade [ 15 16 14 17 17 Involvement of the lower uterine segment is linked to a higher likelihood of LVSI, even in the initial stages. Studies have found that LVSI is more prevalent in patients with lower uterine segment involvement [ 18 19 20 p LUSI is recognized as a poor prognostic factor [ 7 20 7 19 21 17 21 To our knowledge, this is the first study to investigate prognostic differences according to specific uterine wall locations in tumors confined to the corpus. The less aggressive course observed in fundal and lateral tumors may be related to anatomical factors, such as their greater distance from cervical and parametrial lymphovascular channels and a more limited lymphatic drainage network in these regions [ 22 23 In the present study, anterior and posterior tumors were significantly associated with higher rates of LVSI, recurrence, and mortality compared with fundal and lateral tumors. The observed odds of LVSI were approximately five times higher in anterior/posterior tumors, while recurrence and mortality were markedly elevated in these groups, with no events recorded in fundal and lateral tumors. In the Kaplan–Meier analysis, anterior and posterior tumors showed earlier recurrence and mortality events compared with fundal and lateral tumors; however, these differences did not reach statistical significance, likely due to the small number of events in the fundal and lateral groups and the limited sample size, which reduced the statistical power. Previous studies have demonstrated that tumor location within the uterus can influence patterns of lymphatic drainage and metastatic spread, with tumors on the anterior and posterior walls more frequently involving pelvic nodal basins and demonstrating aggressive pathological features [ 9 10 24 A key novelty of our work lies in evaluating the prognostic implications of tumor location within the uterine corpus, an aspect not previously analyzed in early stage endometrioid carcinoma. This focus may contribute to refining risk stratification models and tailoring follow-up protocols. The relatively small sample size—particularly the lateral wall subgroup ( n 25 One of the most significant advances in the diagnosis and treatment of endometrial carcinomas over the past decade has been the ability to molecularly distinguish and classify these carcinomas. Molecular classification has also been introduced in the FIGO 2023 staging system for endometrial cancer [ 26 27 28 29 The limitations of this study include its retrospective nature, small number of cases, and lack of molecular classification. Despite these limitations, its strength lies in being the first study to assess the prognostic impact of tumor location within the corpus in early stage endometrioid carcinoma. 5. Conclusions This study determined that LVSI and ex rate are higher in patients with tumors originating from the anterior and posterior walls. The high ex rate due to these two wall localizations may be due to LVSI, which is another prognostic factor. We believe that the prognosis may be poor for UC tumors originating from the anterior and posterior walls. Closer follow-up may be necessary for endometrial cancers originating from the anterior and posterior uterine walls. However, further prospective studies with more cases are required. Disclaimer/Publisher’s Note: Author Contributions Writing—original draft preparation, G.G.; data collection, E.D.Ö., E.Ö. and Ö.K.; statistical analysis, E.K.; work design and organization, T.K. and M.S. All authors have read and agreed to the published version of the manuscript. Institutional Review Board Statement Ethical approval was granted by the Health Sciences University, İzmir Tepecik Training and Research Hospital Ethics Committee (No: 2022/02-13, Date: 15 February 2022). Informed Consent Statement Due to the retrospective nature of this study, informed consent was not obtained from the participants. Data Availability Statement The data that support the findings of this study are available from the corresponding author upon reasonable request. Conflicts of Interest The authors declare no conflicts of interest. References 1. Henley S.J. Ward E.M. Scott S. Ma J. Anderson R.N. Firth A.U. Thomas C.C. Islami F. Weir H.K. Lewis D.R. Annual report to the nation on the status of cancer, part I: National cancer statistics Cancer 2020 126 2225 2249 10.1002/cncr.32802 32162336 PMC7299151 2. Bray F. Laversanne M. Sung H. Ferlay J. Siegel R.L. Soerjomataram I. Jemal A. Global cancer statistics 2022: GLOBOCAN estimates of incidence and mortality worldwide for 36 cancers in 185 countries CA Cancer J. Clin. 2024 74 229 263 10.3322/caac.21834 38572751 3. Morice P. Leary A. Creutzberg C. Abu-Rustum N. Darai E. Endometrial cancer Lancet 2016 387 1094 1108 10.1016/S0140-6736(15)00130-0 26354523 4. Siegel R.L. Miller K.D. Jemal A. Cancer statistics, 2018 CA Cancer J. Clin. 2018 68 7 30 10.3322/caac.21442 29313949 5. Jemal A. Siegel R. Xu J. Ward E. Cancer statistics, 2010 CA Cancer J. Clin. 2010 60 277 300 10.3322/caac.20073 20610543 6. Southcott B.M. Carcinoma of the endometrium Drugs 2001 61 1395 1405 10.2165/00003495-200161100-00003 11558829 7. Gemer O. Gdalevich M. Voldarsky M. Barak F. Ben Arie A. Schneider D. Levy T. Anteby E. Lavie O. Lower uterine segment involvement is associated with adverse outcome in patients with stage I endometroid endometrial cancer: Results of a multicenter study Eur. J. Surg. Oncol. (EJSO) 2009 35 865 869 10.1016/j.ejso.2008.10.007 19013746 8. Pavlakis K. Rodolakis A. Vagios S. Voulgaris Z. Messini I. Yiannou P. Vlachos A. Panoskaltsis T. Identifiable Risk Factors for Lymph Node Metastases in Grade 1 Endometrial Carcinoma Int. J. Gynecol. Cancer 2017 27 1694 1700 10.1097/IGC.0000000000001070 28786874 9. Dabi Y. Bendifallah S. Kolanska K. Boudy A.S. Querleu D. Akladios C. Zilberman S. Darai E. Touboul C. Anatomical basis of lymph node detection in gynecologic cancers: A review from a surgical perspective Chin. Clin. Oncol. 2021 10 15 10.21037/cco-20-228 33548983 10. Chen F. Gong Y. Xie Y. Zhu L. Chen L. Xiao J. Jiang N. Sun L. Sui L. Assessment of key parameters of normal uterus in women of reproductive age Sci. Rep. 2023 13 17794 10.1038/s41598-023-44489-6 37852992 PMC10584964 11. Hendrickson M.R. Kempson R.L. Normal Histology of the Uterus and Fallopian Tubes Histology for Pathologists Lippincott-Raven Publishers Philadelphia, PA, USA 1997 12. Jacques S.M. Qureshi F. Ramirez N.C. Malviya V.K. Lawrence W.D. Tumors of the uterine isthmus: Clinicopathologic features and immunohistochemical characterization of p53 expression and hormone receptors Int. J. Gynecol. Pathol. 1997 16 38 44 10.1097/00004347-199701000-00007 8986531 13. Amant F. Moerman P. Neven P. Timmerman D. Van Limbergen E. Vergote I. Endometrial cancer Lancet 2005 366 491 505 10.1016/S0140-6736(05)67063-8 16084259 14. Phelan C. Montag A.G. Rotmensch J. Waggoner S.E. Yamada S.D. Mundt A.J. Outcome and management of pathological stage I endometrial carcinoma patients with involvement of the lower uterine segment Gynecol. Oncol. 2001 83 513 517 10.1006/gyno.2001.6407 11733964 15. Kizer N.T. Gao F. Guntupalli S. Thaker P.H. Powell M.A. Goodfellow P.J. Mutch D.G. Zighelboim I. Lower uterine segment involvement is associated with poor outcomes in early-stage endometrioid endometrial carcinoma Ann. Surg. Oncol. 2011 18 1419 1424 10.1245/s10434-010-1454-9 21181281 PMC3393646 16. Miyoshi A. Kanao S. Naoi H. Otsuka H. Yokoi T. Investigation of the clinical features of lower uterine segment carcinoma: Association with advanced stage disease and indication of poorer prognosis Arch. Gynecol. Obstet. 2018 297 193 198 10.1007/s00404-017-4576-5 29116461 17. Erkaya S. Öz M. Topçu H.O. ŞirVan A.L. Güngör T. Meydanli M.M. Is lower uterine segment involvement a prognostic factor in endometrial cancer? Turk. J. Med. Sci. 2017 47 300 306 10.3906/sag-1602-137 28263506 18. Dilek S. Dede M. Gezginç K. Yenen M.C. Göktolga U. Ulutin H.C. Deveci M.S. Erdemoglu E. Aydogdu T. Does the localisation of tumour at stage I endometrial endometrioid adenocarcinoma have an impact on invasion of the tumour and individualisation of the surgical procedure? Eur. J. Gynaecol. Oncol. 2008 29 138 140 18459547 19. Davidesko S. Meirovitz M. Shaco-Levy R. Yarza S. Samueli B. Kezerle Y. Kessous R. The significance of lower uterine segment involvement in endometrial cancer Eur. J. Surg. Oncol. 2024 50 108007 10.1016/j.ejso.2024.108007 38382274 20. Akdöner A. Kurt S. Yavuz O. Bayram E. Üresin M. Ulukuş E.Ç. Effect of low uterine segment involvement on prognosis of early stage endometrial cancer J. Obstet. Gynaecol. Res. 2024 50 991 1001 10.1111/jog.15933 38575743 21. Lavie O. Uriev L. Gdalevich M. Barak F. Peer G. Auslender R. Anteby E. Gemer O. The outcome of patients with stage I endometrial cancer involving the lower uterine segment Int. J. Gynecol. Cancer 2008 18 1079 1083 10.1111/j.1525-1438.2007.01150.x 18081795 22. Freytag D. Pape J. Dhanawat J. Günther V. Maass N. Gitas G. Laganà A.S. Allahqoli L. Meinhold-Heerlein I. Moawad G.N. Challenges Posed by Embryonic and Anatomical Factors in Systematic Lymphadenectomy for Endometrial Cancer J. Clin. Med. 2020 9 4107 10.3390/jcm9124107 33352762 PMC7766017 23. Marquardt R.M. Kim T.H. Shin J.-H. Jeong J.-W. Progesterone and Estrogen Signaling in the Endometrium: What Goes Wrong in Endometriosis? Int. J. Mol. Sci. 2019 20 3822 10.3390/ijms20153822 31387263 PMC6695957 24. Geppert B. Lönnerfors C. Bollino M. Arechvo A. Persson J. A study on uterine lymphatic anatomy for standardization of pelvic sentinel lymph node detection in endometrial cancer Gynecol. Oncol. 2017 145 256 261 10.1016/j.ygyno.2017.02.018 28196672 25. Hamad A.A. Ahmed S.K. Understanding the Lower and Upper Limits of Sample Sizes in Clinical Research Cureus 2025 17 e76724 10.7759/cureus.76724 39897306 PMC11783334 26. Berek J.S. Matias-Guiu X. Creutzberg C. Fotopoulou C. Gaffney D. Kehoe S. Lindemann K. Mutch D. Concin N. FIGO staging of endometrial cancer: 2023 J. Gynecol. Oncol. 2023 34 e85 10.3802/jgo.2023.34.e85 37593813 PMC10482588 27. León-Castillo A. de Boer S.M. Powell M.E. Mileshkin L.R. Mackay H.J. Leary A. Nijman H.W. Singh N. Pollock P.M. Bessette P. Molecular Classification of the PORTEC-3 Trial for High-Risk Endometrial Cancer: Impact on Prognosis and Benefit From Adjuvant Therapy J. Clin. Oncol. 2020 38 3388 3397 10.1200/JCO.20.00549 32749941 PMC7527156 28. Medeiros F. Muto M.G. Lee Y. Elvin J.A. Callahan M.J. Feltmate C. Garber J.E. Cramer D.W. Crum C.P. The Tubal Fimbria Is a Preferred Site for Early Adenocarcinoma in Women With Familial Ovarian Cancer Syndrome Am. J. Surg. Pathol. 2006 30 230 236 10.1097/01.pas.0000180854.28831.77 16434898 29. Levine D. The Cancer Genome Atlas Research Network Integrated genomic characterization of endometrial carcinoma Nature 2013 497 67 73 10.1038/nature12113 23636398 PMC3704730 Figure 1 Patient flow diagram. Figure 2 Oncologic outcomes according to tumor location in the uterine corpus. Figure 3 DFS and OS Kaplan–Meier curves based on tumor wall location. jcm-14-06484-t001_Table 1 Table 1 Patient demographic, pathology, and survival data. Features Patients ( n Age 58.5 (54–67.75) BMI (kg/m 2 36 (30.8–43.8) Nulliparity 1 (1.5) DM 15 (22.1) HT 19 (27.9) Grade 1 17 (25) Grade 2 47 (69.1) Grade 3 4 (5.9) Tumor Size (mm) 40 (30–50) Stage 1A 51 (75) Stage 1B 17 (25) Anterior Wall 13 (19.1) Posterior Wall 10 (14.7) Fundus 41 (60.3) Lateral Wall 4 (5.9) LVSI 16 (23.5) Recurrence 8 (11.8) DFS (month) 67 (60–74) OS (month) 67 (61–74.75) Ex 8 (11.8) Alive 60 (88.2) BMI, body mass index; DM, diabetes mellitus; HT, hypertension, LVSI, lymphovascular space invasion; DFS, disease-free survival; OS, overall survival. Age, BMI, tumor size, DFS, and OS are given as means (quartiles); other data are given as n jcm-14-06484-t002_Table 2 Table 2 Comparison of demographic, pathology, and survival results according to the region of the uterine wall in which the tumor originated. Features Anterior n Posterior n Fundus n Lateral n p Age 58 (53–67) 60 (57–63) 56 (52–63) 64 (57–68) 0.388 BMI (kg/m 2 37.5 (36–44) 34.2 (30–44) 33 (27–44) 36 (36–36) 0.520 Nulliparity 1 (7.5) 0 (0) 0 (0) 0 (0) 0.231 DM 2 (15.4) 4 (40) 8 (19.5) 1 (25) 0.497 HT 2 (15.4) 4 (40) 12 (29.3) 1 (25) 0.616 Grade 1 3 (23.1) 1 (10) 12 (29.3) 1 (25) 0.501 Grade 2 9 (69.2) 9 (90) 27 (65.9) 2 (50) 0.501 Grade 3 1 (7.7) 0 (0) 2 (4.9) 1 (25) 0.501 Tumor Size (mm) 40 (32–47) 45 (32–52) 35 (26–50) 20 (12–42) 0.320 Stage 1A 8 (61.5) 8 (80) 32 (78) 3 (75) 0.661 Stage 1B 5(38.5) 2 (20) 9 (22) 1 (25) 0.661 LVSI 5 (38.5) 5 (50) 5 (12.2) 1 (25)  0.038 Recurrence 4 (30.8) 4 (40) 0 (0) 0 (0)  <0.001 DFS (month) 68 (63–71) 64.5 (42–67) 67 (60–75) 65 (61–72) 0.310 OS (month) 68 (66–75) 66.5 (52–70) 67 (60–75) 65 (61–72) 0.632 Ex 4 (30.8) 4 (40) 0 (0) 0 (0)  <0.001 Alive 9 (69.2) 6 (60) 41 (100) 4 (100)  <0.001 BMI, body mass index; DM, diabetes mellitus; HT, hypertension, LVSI, lymphovascular space invasion; DFS, disease-free survival; OS, overall survival. Age, BMI, tumor size, DFS, and OS are given as means (quartiles); other data are given as n jcm-14-06484-t003_Table 3 Table 3 Association between tumor location and LVSI, recurrence, and mortality with odds ratios and 95% confidence intervals. Outcome Anterior/Posterior n Fundus/Lateral n OR (95% CI) p LVSI 10/23 (43.5%) 6/45 (13.3%) 5.00 (1.52–16.45)  0.013 Recurrence 8/23 (34.8%) 0/45 (0.0%) 48.00 (2.60–886.66)  <0.0001 Mortality 8/23 (34.8%) 0/45 (0.0%) 48.00 (2.60–886.66)  <0.0001 LVSI, lymphovascular space invasion; OR, odds ratio; CI, confidence interval. ",
  "metadata": {
    "Title of this paper": "Integrated genomic characterization of endometrial carcinoma",
    "Journal it was published in:": "Journal of Clinical Medicine",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12470494/"
  }
}