{
  "title": "Paper_1045",
  "abstract": "J Maxillofac Oral Surg J Maxillofac Oral Surg 1433 jmos Journal of Maxillofacial & Oral Surgery 0972-8279 0974-942X Springer PMC11456028 PMC11456028.1 11456028 11456028 39376757 10.1007/s12663-022-01814-2 1814 1 Original Article Estimation of Blood Loss in Patients Undergoing Surgery for Oral Malignancies: a Clinical Study Varshini Amrutha 1 http://orcid.org/0000-0003-1075-7077 Anehosur Venkatesh venkyrao12@yahoo.co.in 1 Joshi Vajendra K. 2 Kumar Niranjan 3 1 grid.522991.4 Department of Oral and Maxillofacial Surgery, SDM Craniofacial Research Centre, SDM College of Dental Sciences and Hospital, Shri Dharmasthala Manjunatheshwara University, 2 grid.522991.4 Department of Anaesthesiology, SDM Craniofacial Research Centre, SDM College of Dental Sciences and Hospital, Shri Dharmasthala Manjunatheshwara University, 3 grid.496597.0 0000 0004 1772 8241 Department of Plastic Surgery, SDM College of Medical Sciences and Hospital, Shri Dharmasthala Manjunatheswara University, 31 10 2022 10 2024 23 5 472260 1072 1078 13 7 2021 17 10 2022 01 10 2025 01 10 2025 07 10 2024 01 10 2025 © The Association of Oral and Maxillofacial Surgeons of India 2022. Springer Nature or its licensor (e.g. a society or other partner) holds exclusive rights to this article under a publishing agreement with the author(s) or other rightsholder(s); author self-archiving of the accepted manuscript version of this article is solely governed by the terms of such publishing agreement and applicable law. 2022 Objective The primary objective is to estimate the blood loss following major surgery like neck dissection, resection of primary and reconstruction; secondarily to evaluate the incidence of blood transfusion, to assess various options of blood conservation to avert blood transfusions. Study design The data for the prospective study were obtained from 2017–2019. The predictor variables were drawn from demographic characteristics, biopsy report, haemoglobin status, comorbidities, staging, surgical planning, intraoperative and post-operative measures taken for blood loss assessment. Outcome variables were estimation of blood loss, incidence of blood transfusion and measures to avoid. Results Thirty-eight patients 29 males (76.3%) comparison to nine females (23.6%) with 35 cases (92.1%) of oral squamous cell carcinoma. Average blood loss was 673.5 ml with a range of 400–807 ml. There was direct co-relation between the duration of surgery and amount of blood loss. In 76.3% patient’s blood transfusion was avoided which is significant. Conclusion Though there is no single standardized method as the accuracy is still questionable. In this study blood loss and incidence of blood transfusion was low so as to promote the hypothesis of blood conservation and transfusion in major surgeries by various pre, intra and post-operative measures. Keywords Oral malignancies Surgery Blood loss Blood conservation pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access no pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement no pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes issue-copyright-statement © The Association of Oral and Maxillofacial Surgeons of India 2024 ",
  "metadata": {
    "Title of this paper": "Estimation of Blood Loss in Patients Undergoing Surgery for Oral Malignancies: a Clinical Study",
    "Journal it was published in:": "Journal of Maxillofacial & Oral Surgery",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC11456028/"
  }
}