{
  "title": "Paper_924",
  "abstract": "pmc Oncol Lett Oncol Lett 1736 onclett OL Oncology Letters 1792-1074 1792-1082 Spandidos Publications PMC12485598 PMC12485598.1 12485598 12485598 41040910 10.3892/ol.2025.15282 OL-30-5-15282 1 Review Progress of MRI-based radiomics and deep learning for predicting the prognosis of locally advanced rectal cancer (Review) Shi Yuting 1 Huang Qiuhan 2 Lyu Jiali 2 Dong Tianjie 2 Sun Jihong 2 3 4 1 2 3 4 Correspondence to sunjihong@zju.edu.cn 11 2025 19 9 2025 30 5 495953 536 08 1 2025 03 9 2025 19 09 2025 02 10 2025 03 10 2025 Copyright: © 2025 Shi et al. 2025 https://creativecommons.org/licenses/by-nc-nd/4.0/ This is an open access article distributed under the terms of the Creative Commons Attribution-NonCommercial-NoDerivs License Rectal cancer (RC) ranks among the most common malignant tumors worldwide, with ~30% of patients presenting at a locally advanced stage at the time of diagnosis. The standard treatment for locally advanced RC (LARC) combines neoadjuvant chemoradiotherapy (nCRT) with total mesorectal excision. While this treatment paradigm has been effective in reducing the local recurrence rate, its efficacy in enhancing overall survival and disease-free survival is still limited. Consequently, the identification of adverse prognostic factors in patients with LARC is crucial for improving long-term survival outcomes. Traditional imaging methods offer limited predictive power for early diagnosis, treatment efficacy assessment and prognosis in LARC. Recent advancements in MRI-based radiomics and deep learning (DL), leveraging high-dimensional feature extraction and nonlinear modeling, have markedly enhanced prognostic predictive performance. Single-sequence MRI radiomics models derived from pre-nCRT imaging demonstrate areas under the curve (AUC) of 0.79–0.87 for predicting local recurrence and distant metastasis. Multiparametric radiomic models further improve predictive accuracy, achieving AUCs of 0.81–0.83. Delta radiomics, which captures temporal-spatial heterogeneity evolution in tumors during therapy, elevates AUC performance to 0.77–0.89. Notably, DL-based models exhibit superior and more stable predictive capabilities, with concordance indices (C-indices) ranging from 0.82 to 0.94. This paper reviews recent progress in MRI-based radiomics and DL for predicting the prognosis of patients with LARC subjected to nCRT. locally advanced rectal cancer neoadjuvant chemoradiotherapy radiomics deep learning prognosis Major Program Co-sponsored by Province and Ministry WKJ-ZJ-2210 Fundamental Research Funds for the Central Universities 226-2024-00059 ‘Pioneer’ and ‘Leading Goose’ R&D Program of Zhejiang 2024C03047 This study was supported by the Major Program Co-sponsored by Province and Ministry (grant no. WKJ-ZJ-2210), the Fundamental Research Funds for the Central Universities (grant no. 226-2024-00059) and the ‘Pioneer’ and ‘Leading Goose’ R&D Program of Zhejiang (grant no. 2024C03047). pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement no pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes 1. Introduction Colorectal cancer (CRC) is the third most common malignant tumor worldwide and the second leading cause of cancer-related deaths ( 1 2 3 4 5 6 7 8 9 10 In recent years, groundbreaking advancements have been made in two therapeutic domains. First, for the microsatellite instability-high (MSI-H)/mismatch repair-deficient (dMMR) subtype, which constitutes ~3% of patients with LARC ( 11 12 et al 13 et al 14 15 16 17 18 19 The tumor-node-metastasis (TNM) staging system ( 20 22 23 24 In addition to tumor staging, several clinicopathological factors, such as neurovascular invasion and tumor differentiation, play a role in prognostic evaluations. The tumor regression grade (TRG) is a key tool for assessing tumor response after nCRT ( 25 26 27 28 Imaging plays a vital role in diagnosing and managing LARC, with computed tomography (CT), magnetic resonance imaging (MRI) and positron emission tomography/computed tomography (PET/CT) being the primary modalities used. CT is essential for staging LARC due to its rapid acquisition, clear visualization of lesions and ability to assess peri-lesional involvement ( 29 30 MRI has emerged as the preferred modality for diagnosing, staging and prognosticating LARC, owing to its superior soft-tissue resolution and its ability to perform multi-sequence, multi-parameter imaging ( 31 32 33 34 35 et al 36 37 38 39 With the ongoing advancements in precision medicine, radiomics and deep learning (DL) are increasingly applied in the diagnosis and treatment of various diseases ( 40 41 Several studies have explored the use of radiomics from CT and PET/CT imaging to predict the prognosis of LARC treated with nCRT, yielding promising results. A retrospective study involving 411 patients with LARC demonstrated that CT-based radiomics features could independently predict OS in patients with LARC undergoing nCRT ( 42 et al 43 et al 44 Conventional imaging modalities, such as MRI and CT, predominantly rely on morphological indicators (e.g., tumor size, enhancement patterns), which are insufficient to distinguish viable tumor residues from post-therapeutic fibrosis during pretreatment or early treatment phases. Furthermore, existing prognostic biomarkers, such as TRG, require postoperative pathological confirmation and thus fail to dynamically guide therapeutic adjustments. Additional limitations include the lack of objective quantification methods for intratumoral heterogeneity, inadequate integration of multimodal data (imaging, genomic and clinical parameters), and challenges associated with the ‘black-box’ nature of DL models and their poor cross-center generalizability. These issues have substantially hindered the clinical translation of precision predictive frameworks. This review focuses on radiomics and DL technologies, delineating how they overcome the constraints of conventional approaches by addressing critical research gaps-specifically, the limited timeliness of early prediction, insufficient analysis of tumor heterogeneity and the absence of synergistic multidimensional data integration. By resolving these challenges, the present analysis provides innovative conceptual frameworks to advance precision oncology frameworks for LARC. As a result, this paper will focus on recent research exploring MRI-based radiomics and DL for prognostic prediction in patients with LARC undergoing nCRT ( Table I https://pubmed.ncbi.nlm.nih.gov/ https://www.webofscience.com/ https://scholar.google.com/ 45 2. Process of radiomics Radiomics, first introduced by Lambin et al 46 47 48 49 50 52 53 3. Applications of radiomics to predict prognosis Baseline-based radiomics Prior to nCRT in patients with LARC, baseline MRI can provide pivotal tumor characteristics, including tumor size, morphology, location, MRF invasion and lymph node metastasis. Such information is crucial for predicting tumor behavior, devising personalized treatment strategies and evaluating therapeutic outcomes. T2WI is often used for segmenting the tumor ROI due to its superior soft tissue contrast and multiplanar imaging capabilities. Accordingly, numerous studies extracted radiomics features based on pre-treatment T2WI to construct predictive models. For instance, in a retrospective study by Jayaprakasam et al 54 Several studies have enhanced predictive models by incorporating multiple MRI sequences, such as DWI, apparent ADC and CE-TIWI, alongside T2WI ( 55 57 et al 55 et al 56 These findings highlight the value of baseline MRI radiomics features, which provide extensive quantitative data to inform predictive models. The single-sequence models achieved AUC values ranging from 0.79 to 0.87 for predicting LR/DM ( 54 56 58 Timing-based radiomics Tumor heterogeneity in RC and its changes during treatment underscore the importance of post-treatment imaging analysis. Tibermacine et al 59 et al 60 Delta radiomics quantifies changes in tumor morphology and heterogeneity by analyzing differences between pre- and post-treatment images. It enables early prediction of tumor behavior, such as nCRT efficacy, LR and DM. As a result, it provides a foundation for personalized treatment strategies for patients ( 21 61 et al 62 et al 63 64 Based on multimodal radiomics In the management of LARC, several factors beyond radiomic features influence patient prognosis, including tumor indicators, pathological T-stage, N-stage, EMVI and MRF status ( 34 35 et al 65 66 67 Certain studies suggest that combining radiomics features with clinical parameters in a joint model could enhance predictive accuracy. In a multicenter retrospective study involving 629 patients, Liu et al 57 68 et al 69 et al 55 Although radiomics-based imaging methods have shown improved predictive power for assessing nCRT outcomes in patients with LARC, manual lesion outlining for radiomics analysis remains time-consuming and labor-intensive. As a result, DL approaches may offer valuable potential for advancing research in this area. 4. Deep learning processes and applications DL encompasses a broad range of machine learning algorithms based on multi-layer deep neural networks, rather than a specific model. Unlike radiomics, DL automatically learns to extract and select high-dimensional features through neural networks, enhancing the robustness of the model and enabling more comprehensive extraction of image information ( 70 DL offers several advantages over radiomics: First, DL automatically learns and extracts features from images, eliminating the need for expert-driven manual feature extraction. This reduces bias and increases efficiency. Second, while radiomics features are generally applicable, they often lack specificity. In tumors that tend to undergo significant transformations, such as colorectal cancer, traditional radiomics can be less effective. By contrast, DL can extract more disease-specific features tailored to the particular type or stage of disease. Additionally, DL models exhibit strong adaptability and excellent generalization, allowing them to be adjusted and optimized for different tasks and data types. As a result, they can maintain high performance across diverse datasets and scenarios ( 71 Studies using DL have primarily focused on evaluating the efficacy of nCRT in patients with LARC ( 72 73 et al 74 In a multinational, multicenter study with a large cohort, Jiang et al 75 et al 76 These studies highlight that DL models, compared to traditional machine learning models (e.g., RF, logistic regression) and manual radiological assessment, have evolved with deeper algorithmic development and model training, resulting in superior performance in prognostic prediction. This progress offers clinicians the potential for early, non-invasive risk assessment of patients and could eventually replace the labor-intensive process of manual outlining. However, DL-based studies remain limited compared to traditional radiomics. Therefore, further research is necessary to validate model stability and explore their clinical potential. Comparative analysis demonstrates distinct performance variations between radiomics and DL approaches in prognostic prediction. Radiomic models utilizing pre-T2WI imaging combined with clinical covariates exhibit moderate predictive capability for DM. For instance, the model developed by Wang et al 68 et al 74 In predicting the prognosis of nCRT for LARC, radiomics and DL each show potential but differ in accuracy, usability and clinical feasibility. Radiomics demonstrates certain accuracy in predicting DFS, LR and DM. For instance, the radiomics model based on multiparametric MRI achieves an AUC of 0.83 for predicting LR or DM ( 56 55 By contrast, DL exhibits superior predictive performance. A DL model based on pre-treatment MRI achieves AUC values of 0.938 and 0.894 in the training and validation sets, respectively, for predicting distant metastasis, and the MuST model shows a significantly higher C-index than radiomics models ( 74 76 Overall, both technologies face challenges related to data heterogeneity, insufficient generalizability and reproducibility. Current studies are mostly based on single-center, small-sample retrospective data and lack external validation. In radiomics workflows, subtle differences in image acquisition, ROI segmentation and feature extraction can lead to variability in results. DL models are significantly influenced by the quality of training data and the parameter optimization process is complex, making complete reproducibility across studies difficult. Future research should focus on constructing multi-center standardized databases, developing more robust feature extraction algorithms and addressing the ‘black-box’ issue of models through explainable technologies to enhance their clinical application value and feasibility. 5. Challenges and prospects Radiomics, as an emerging technology, still faces several challenges in clinical application. One major issue is data standardization and quality control. Variations in equipment and inconsistencies in scanning parameters can impact the accuracy of image feature extraction and the generalization of models. Additionally, the stability and reproducibility of radiomics features limit the broader applicability of these models. Another challenge is the manual delineation of lesion ROIs, which is not only time-consuming but also prone to subjective bias, potentially compromising model accuracy. Future advancements in fully or semi-automated segmentation technologies are expected to address this limitation. Currently, most radiomics studies rely on small, single-center datasets. To improve the accuracy and reliability of these models, further validation through large-scale, multicenter, prospective studies is essential. Likewise, the performance of DL models is heavily contingent upon the availability of extensive, high-quality labeled image datasets. Nonetheless, in the domain of medical imaging, the assembly of such datasets poses considerable challenges, especially when dealing with lesions that exhibit substantial variability. Despite the growing trend towards automated data annotation, the incorporation of manual review and verification processes remains essential to guarantee the precision and reliability of the data. Additionally, DL models, particularly complex neural networks, are often criticized as ‘black boxes’ because their decision-making processes are opaque, hindering their interpretability and trustworthiness in clinical settings ( 77 The clinical implementation of artificial intelligence (AI)-based prognostic models faces critical ethical and technical challenges. First, data bias compromises model fairness, as training datasets with insufficient racial, age or gender representation (e.g., overrepresentation of specific populations) reduce predictive accuracy in minority groups. Second, technical biases from cross-institutional variations in MRI field strengths and scanning protocols introduce systematic feature extraction errors. Finally, the opacity of ‘black-box’ decision mechanisms in DL models undermines clinical credibility, where nonlinear decision pathways lack transparency and conflict with medical traceability requirements. Current studies demonstrate that multimodal radiomics models, which combine preoperative CT and MRI data, offer substantial advantages in predicting the response to nCRT in patients with LARC, outperforming any single imaging modality ( 78 79 Future research should prioritize three key directions to address current limitations. First, a standardized multicenter validation framework should be established through international collaboration, including unified MRI protocols (e.g., field strength, sequence parameters, contrast agent use) and open-access LARC imaging databases. Additionally, prospective clinical trials are needed to evaluate model performance in real-world settings, providing evidence for translational practice. Second, an Explainable AI model should be developed by integrating Class Activation Mapping to visualize decision regions and Shapley Additive Explanations values to quantify imaging feature contributions ( 80 et al 81 Traditional medical imaging captures the morphological features of LARC from a macroscopic perspective, revealing overall structural and functional changes. By contrast, genetic and pathological analyses provide an in-depth view of the molecular mechanisms and histological alterations at the microscopic level, offering a more detailed understanding of tumor biology ( 82 83 Looking ahead, improving data quality, fostering multicenter collaborations and applying advanced analytics will be crucial. The ongoing development of automated DL segmentation algorithms and end-to-end modeling approaches has the potential to overcome the limitations of current technologies. Additionally, the integration of multimodal models combining radiomics, pathomics and genomics will likely offer a more holistic view of prognosis, improving predictive accuracy and further advancing the field of precision medicine. 6. Conclusion MRI-based radiomics and DL show promising predictive performance in assessing the prognosis of nCRT in LARC. These technologies hold substantial clinical potential as tools for early, non-invasive assessment, aiding clinicians in patient risk stratification and playing a pivotal role in the development of personalized treatment plans. Acknowledgements Not applicable. Availability of data and materials Not applicable. Authors' contributions JS and QH designed and conducted this review. JS critically revised the final version of the manuscript. YS, TD and JL conceived and drafted the manuscript. YS and TD prepared the table. JS provided funding for the research. Data authentication is not applicable. All authors have read and approved the final version of the manuscript. Ethics approval and consent to participate Not applicable. Patient consent for publication Not applicable. Competing interests The authors declare that they have no competing interests. Abbreviations ADC apparent diffusion coefficient AUC area under the curve CEA carcinoembryonic antigen CE-TIWI contrast-enhanced T1-weighted imaging C-index concordance index CNNs convolutional neural networks CRC colorectal cancer CT computed tomography DFS disease-free survival DL deep learning DM distant metastasis DMFS DM-free survival DWI diffusion-weighted imaging EMVI extramural vascular invasion LARC locally advanced rectal cancer LASSO least absolute shrinkage and selection operator LR local recurrence LRFS local recurrence-free survival LRR local recurrence rate MRF mesorectal fascia MRI magnetic resonance imaging MS manual segmentation MSI microsatellite instability nCRT neoadjuvant chemoradiotherapy OS overall survival PET/CT positron emission tomography/computed tomography PFS progression-free survival PRISMA Preferred Reporting Items for Systematic Reviews and Meta-Analyses RC rectal cancer RF random forests ROI regions of interest SVM support vector machines TNM tumor-node-metastasis TRG tumor regression grade T2WI T2-weighted imaging ViT vision transformer References 1 Siegel RL Wagle NS Cercek A Smith RA Jemal A Colorectal cancer statistics, 2023 CA Cancer J Clin 73 233 254 2023 36856579 10.3322/caac.21772 2 Morgan E Arnold M Gini A Lorenzoni V Cabasag CJ Laversanne M Vignat J Ferlay J Murphy N Bray F Global burden of colorectal cancer in 2020 and 2040: Incidence and mortality estimates from GLOBOCAN Gut 72 338 344 2023 10.1136/gutjnl-2022-327736 36604116 3 Staal FCR van der Reijd DJ Taghavi M Lambregts DMJ Beets-Tan RGH Maas M Radiomics for the prediction of treatment outcome and survival in patients with colorectal cancer: A systematic review Clin Colorectal Cancer 20 52 71 2021 33349519 10.1016/j.clcc.2020.11.001 4 Aklilu M Eng C The current landscape of locally advanced rectal cancer Nat Rev Clin Oncol 8 649 659 2011 10.1038/nrclinonc.2011.118 21826084 5 Benson AB Venook AP Al-Hawary MM Arain MA Chen YJ Ciombor KK Cohen S Cooper HS Deming D Garrido-Laguna I NCCN guidelines insights: Rectal cancer, version 6.2020 J Natl Compr Canc Netw 18 806 815 2020 10.6004/jnccn.2020.0032 32634771 6 van der Valk MJM Hilling DE Bastiaannet E Kranenbarg EMK Beets GL Figueiredo NL Habr-Gama A Perez RO Renehan AG van de Velde CJH IWWD Consortium Long-term outcomes of clinical complete responders after neoadjuvant treatment for rectal cancer in the International watch & wait database (IWWD): An international multicentre registry study Lancet 391 2537 2545 2018 10.1016/S0140-6736(18)31078-X 29976470 7 Gauci C Ravindran P Pillinger S Lynch AC Robotic surgery for multi-visceral resection in locally advanced colorectal cancer: Techniques, benefits and future directions Laparoscopic, Endoscopic and Robotic Surgery 6 123 126 2023 10.1016/j.lers.2023.11.001 8 Valentini V van Stiphout RG Lammering G Gambacorta MA Barba MC Bebenek M Bonnetain F Bosset JF Bujko K Cionini L Selection of appropriate end-points (pCR vs 2yDFS) for tailoring treatments with prediction models in locally advanced rectal cancer Radiother Oncol 114 302 309 2015 10.1016/j.radonc.2015.02.001 25716096 9 Fokas E Liersch T Fietkau R Hohenberger W Beissbarth T Hess C Becker H Ghadimi M Mrak K Merkel S Tumor regression grading after preoperative chemoradiotherapy for locally advanced rectal carcinoma revisited: Updated results of the CAO/ARO/AIO-94 trial J Clin Oncol 32 1554 1562 2014 10.1200/JCO.2013.54.3769 24752056 10 van Gijn W Marijnen CA Nagtegaal ID Kranenbarg EM Putter H Wiggers T Rutten HJ Påhlman L Glimelius B van de Velde CJ Dutch Colorectal Cancer Group Preoperative radiotherapy combined with total mesorectal excision for resectable rectal cancer: 12-year follow-up of the multicentre, randomised controlled TME trial Lancet Oncol 12 575 582 2011 10.1016/S1470-2045(11)70097-3 21596621 11 Glynne-Jones R Wyrwicz L Tiret E Brown G Rödel C Cervantes A Arnold D ESMO Guidelines Committee Rectal cancer: ESMO clinical practice guidelines for diagnosis, treatment and follow-up Ann Oncol 28 iv22 iv40 2017 10.1093/annonc/mdx224 28881920 12 Cabezón-Gutiérrez L Custodio-Cabello S Palka-Kotlowska M Díaz-Pérez D Mateos-Dominguez M Galindo-Jara P Neoadjuvant immunotherapy for dMMR/MSI-H locally advanced rectal cancer: The future new standard approach? Eur J Surg Oncol 49 323 328 2023 10.1016/j.ejso.2022.10.018 36400657 13 Cercek A Lumish M Sinopoli J Weiss J Shia J Lamendola-Essel M El Dika IH Segal N Shcherba M Sugarman R PD-1 blockade in mismatch repair-deficient, locally advanced rectal cancer N Engl J Med 386 2363 2376 2022 10.1056/NEJMoa2201445 35660797 PMC9492301 14 Yang R Wu T Yu J Cai X Li G Li X Huang W Zhang Y Wang Y Yang X Locally advanced rectal cancer with dMMR/MSI-H may be excused from surgery after neoadjuvant anti-PD-1 monotherapy: A multiple-center, cohort study Front Immunol 14 1182299 2023 10.3389/fimmu.2023.1182299 37441082 PMC10333582 15 Bahadoer RR Dijkstra EA van Etten B Marijnen CAM Putter H Kranenbarg EM Roodvoets AGH Nagtegaal ID Beets-Tan RGH Blomqvist LK Short-course radiotherapy followed by chemotherapy before total mesorectal excision (TME) versus preoperative chemoradiotherapy, TME, and optional adjuvant chemotherapy in locally advanced rectal cancer (RAPIDO): A randomised, open-label, phase 3 trial Lancet Oncol 22 29 42 2021 10.1016/S1470-2045(20)30555-6 33301740 16 Conroy T Bosset JF Etienne PL Rio E François É Mesgouez-Nebout N Vendrely V Artignan X Bouché O Gargot D Neoadjuvant chemotherapy with FOLFIRINOX and preoperative chemoradiotherapy for patients with locally advanced rectal cancer (UNICANCER-PRODIGE 23): A multicentre, randomised, open-label, phase 3 trial Lancet Oncol 22 702 715 2021 10.1016/S1470-2045(21)00079-6 33862000 17 Zwart WH Temmink SJD Hospers GAP Marijnen CAM Putter H Nagtegaal ID Blomqvist L Kranenbarg EM Roodvoets AGH Martling A Oncological outcomes after a pathological complete response following total neoadjuvant therapy or chemoradiotherapy for high-risk locally advanced rectal cancer in the RAPIDO trial Eur J Cancer 204 114044 2024 10.1016/j.ejca.2024.114044 38636289 18 Conroy T Castan F Etienne PL Rio E Mesgouez-Nebout N Evesque L Vendrely V Artignan X Bouché O Gargot D Total neoadjuvant therapy with mFOLFIRINOX versus preoperative chemoradiotherapy in patients with locally advanced rectal cancer: Long-term results of the UNICANCER-PRODIGE 23 trial Ann Oncol 35 873 881 2024 10.1016/j.annonc.2024.06.019 38986769 19 Dijkstra EA Nilsson PJ Hospers GAP Bahadoer RR Kranenbarg EMK Roodvoets AGH Putter H Berglund Å Cervantes A Crolla R Locoregional failure during and after short-course radiotherapy followed by chemotherapy and surgery compared with long-course chemoradiotherapy and surgery: A 5-year follow-up of the RAPIDO trial Ann Surg 278 e766 e772 2023 10.1097/SLA.0000000000005799 36661037 PMC10481913 20 Valentini V van Stiphout RG Lammering G Gambacorta MA Barba MC Bebenek M Bonnetain F Bosset JF Bujko K Cionini L Nomograms for predicting local recurrence, distant metastases, and overall survival for patients with locally advanced rectal cancer on the basis of European randomized clinical trials J Clin Oncol 29 3163 3172 2011 10.1200/JCO.2010.33.1595 21747092 21 Sun Y Lin H Lu X Huang Y Xu Z Huang S Wang X Chi P A nomogram to predict distant metastasis after neoadjuvant chemoradiotherapy and radical surgery in patients with locally advanced rectal cancer J Surg Oncol 115 462 469 2017 10.1002/jso.24522 28105657 22 Merkel S Weber K Schellerer V Göhl J Fietkau R Agaimy A Hohenberger W Hermanek P Prognostic subdivision of ypT3 rectal tumours according to extension beyond the muscularis propria Br J Surg 101 566 572 2014 10.1002/bjs.9419 24477831 23 Park IJ You YN Agarwal A Skibber JM Rodriguez-Bigas MA Eng C Feig BW Das P Krishnan S Crane CH Neoadjuvant treatment response as an early response indicator for patients with rectal cancer J Clin Oncol 30 1770 1776 2012 10.1200/JCO.2011.39.7901 22493423 PMC3383178 24 Bera K Katz I Madabhushi A Reimagining T staging through artificial intelligence and machine learning image processing approaches in digital pathology JCO Clin Cancer Inform 4 1039 1050 2020 10.1200/CCI.20.00110 33166198 PMC7713520 25 Patel UB Taylor F Blomqvist L George C Evans H Tekkis P Quirke P Sebag-Montefiore D Moran B Heald R Magnetic resonance imaging-detected tumor response for locally advanced rectal cancer predicts survival outcomes: MERCURY experience J Clin Oncol 29 3753 3760 2011 10.1200/JCO.2011.34.9068 21876084 26 De Mattia E Polesel J Mezzalira S Palazzari E Pollesel S Toffoli G Cecchin E Predictive and prognostic value of oncogene mutations and microsatellite instability in locally-advanced rectal cancer treated with neoadjuvant radiation-based therapy: A systematic review and meta-analysis Cancers (Basel) 15 1469 2023 10.3390/cancers15051469 36900260 PMC10001009 27 Watanabe T Kobunai T Yamamoto Y Matsuda K Ishihara S Nozawa K Iinuma H Shibuya H Eshima K Heterogeneity of KRAS status may explain the subset of discordant KRAS status between primary and metastatic colorectal cancer Dis Colon Rectum 54 1170 1178 2011 10.1097/DCR.0b013e31821d37a3 21825899 28 Ciocan RA Ciocan A Mihăileanu FV Ursu CP Ursu Ș Bodea C Cordoș AA Chiș BA Al Hajjar N Dîrzu N Dîrzu DS Metabolic signatures: Pioneering the frontier of rectal cancer diagnosis and response to neoadjuvant treatment with biomarkers-a systematic review Int J Mol Sci 25 2381 2024 10.3390/ijms25042381 38397058 PMC10889270 29 Raman SP Chen Y Fishman EK Evolution of imaging in rectal cancer: Multimodality imaging with MDCT, MRI, and PET J Gastrointest Oncol 6 172 184 2015 25830037 10.3978/j.issn.2078-6891.2014.108 PMC4311095 30 Kinkel K Lu Y Both M Warren RS Thoeni RF Detection of hepatic metastases from cancers of the gastrointestinal tract by using noninvasive imaging methods (US, CT, MR imaging, PET): A meta-analysis Radiology 224 748 756 2002 10.1148/radiol.2243011362 12202709 31 Horvat N Rocha CC Oliveira BC Petkovska I Gollub MJ MRI of rectal cancer: Tumor staging, imaging techniques, and management Radiographics 39 367 387 2019 10.1148/rg.2019180114 30768361 PMC6438362 32 Nahas SC Nahas CS Marques CF Ribeiro U Jr Cotti GC Imperiale AR Capareli FC Chen AT Hoff PM Cecconello I Pathologic complete response in rectal cancer: Can we detect it? Lessons learned from a proposed randomized trial of watch-and-wait treatment of rectal cancer Dis Colon Rectum 59 255 263 2016 10.1097/DCR.0000000000000558 26953983 33 Smith JJ Garcia-Aguilar J Advances and challenges in treatment of locally advanced rectal cancer J Clin Oncol 33 1797 1808 2015 10.1200/JCO.2014.60.1054 25918296 PMC4559608 34 Park H Predictive factors for early distant metastasis after neoadjuvant chemoradiotherapy in locally advanced rectal cancer World J Gastrointest Oncol 13 252 264 2021 10.4251/wjgo.v13.i4.252 33889277 PMC8040066 35 Joo JI Lim SW Oh BY Prognostic impact of carcinoembryonic antigen levels in rectal cancer patients who had received neoadjuvant chemoradiotherapy Ann Coloproctol 37 179 185 2021 10.3393/ac.2020.11.27 33971705 PMC8273711 36 Smith N Brown G Preoperative staging of rectal cancer Acta Oncol 47 20 31 2008 10.1080/02841860701697720 17957502 37 Smith NJ Barbachano Y Norman AR Swift RI Abulafi AM Brown G Prognostic significance of magnetic resonance imaging-detected extramural vascular invasion in rectal cancer Br J Surg 95 229 236 2008 10.1002/bjs.5917 17932879 38 Nougaret S Reinhold C Mikhael HW Rouanet P Bibeau F Brown G The use of MR imaging in treatment planning for patients with rectal carcinoma: have you checked the ‘DISTANCE’? Radiology 268 330 344 2013 10.1148/radiol.13121361 23882096 39 Nougaret S Gormly K Lambregts DMJ Reinhold C Goh V Korngold E Denost Q Brown G MRI of the rectum: A decade into DISTANCE, moving to DISTANCED Radiology 314 e232838 2025 10.1148/radiol.232838 39772798 40 Hosny A Parmar C Quackenbush J Schwartz LH Aerts H Artificial intelligence in radiology Nat Rev Cancer 18 500 510 2018 10.1038/s41568-018-0016-5 29777175 PMC6268174 41 Bi WL Hosny A Schabath MB Giger ML Birkbak NJ Mehrtash A Allison T Arnaout O Abbosh C Dunn IF Artificial intelligence in cancer imaging: Clinical challenges and applications CA Cancer J Clin 69 127 157 2019 30720861 10.3322/caac.21552 PMC6403009 42 Wang J Shen L Zhong H Zhou Z Hu P Gan J Luo R Hu W Zhang Z Radiomics features on radiotherapy treatment planning CT can predict patient survival in locally advanced rectal cancer patients Sci Rep 9 15346 2019 10.1038/s41598-019-51629-4 31653909 PMC6814843 43 Bundschuh RA Dinges J Neumann L Seyfried M Zsótér N Papp L Rosenberg R Becker K Astner ST Henninger M Textural parameters of tumor heterogeneity in 18 J Nucl Med 55 891 897 2014 10.2967/jnumed.113.127340 24752672 44 Bang JI Ha S Kang SB Lee KW Lee HS Kim JS Oh HK Lee HY Kim SE Prediction of neoadjuvant radiation chemotherapy response and survival using pretreatment [(18)F]FDG PET/CT scans in locally advanced rectal cancer Eur J Nucl Med Mol Imaging 43 422 431 2016 10.1007/s00259-015-3180-9 26338180 45 Page MJ McKenzie JE Bossuyt PM Boutron I Hoffmann TC Mulrow CD Shamseer L Tetzlaff JM Akl EA Brennan SE The PRISMA 2020 statement: An updated guideline for reporting systematic reviews BMJ 372 n71 2021 10.1136/bmj.n71 33782057 PMC8005924 46 Lambin P Rios-Velazquez E Leijenaar R Carvalho S van Stiphout RG Granton P Zegers CM Gillies R Boellard R Dekker A Aerts HJ Radiomics: Extracting more information from medical images using advanced feature analysis Eur J Cancer 48 441 446 2012 10.1016/j.ejca.2011.11.036 22257792 PMC4533986 47 Scapicchio C Gabelloni M Barucci A Cioni D Saba L Neri E A deep look into radiomics Radiol Med 126 1296 1311 2021 10.1007/s11547-021-01389-x 34213702 PMC8520512 48 Floca R Bohn J Haux C Wiestler B Zöllner FG Reinke A Weiß J Nolden M Albert S Persigehl T Radiomics workflow definition & challenges-German priority program 2177 consensus statement on clinically applied radiomics Insights Imaging 15 124 2024 10.1186/s13244-024-01704-w 38825600 PMC11144687 49 Lin M Tang X Cao L Liao Y Zhang Y Zhou J Using ultrasound radiomics analysis to diagnose cervical lymph node metastasis in patients with nasopharyngeal carcinoma Eur Radiol 33 774 783 2023 10.1007/s00330-022-09122-6 36070091 50 Ghosh A Yekeler E Teixeira SR Dalal D States L Role of MRI radiomics for the prediction of MYCN amplification in neuroblastomas Eur Radiol 33 6726 6735 2023 10.1007/s00330-023-09628-7 37178203 51 Xie F Zhao Q Li S Wu S Li J Li H Chen S Jiang W Dong A Wu L Establishment and validation of novel MRI radiomic feature-based prognostic models to predict progression-free survival in locally advanced rectal cancer Front Oncol 12 901287 2022 10.3389/fonc.2022.901287 36408187 PMC9669703 52 Chiloiro G Cusumano D Romano A Boldrini L Nicolì G Votta C Tran HE Barbaro B Carano D Valentini V Delta radiomic analysis of mesorectum to predict treatment response and prognosis in locally advanced rectal cancer Cancers (Basel) 15 3082 2023 10.3390/cancers15123082 37370692 PMC10296157 53 Steyerberg EW Harrell FE Jr Prediction models need appropriate internal, internal-external, and external validation J Clin Epidemiol 69 245 247 2016 10.1016/j.jclinepi.2015.04.005 25981519 PMC5578404 54 Jayaprakasam VS Paroder V Gibbs P Bajwa R Gangai N Sosa RE Petkovska I Pernicka JS Fuqua JL III Bates DDB MRI radiomics features of mesorectal fat can predict response to neoadjuvant chemoradiation therapy and tumor recurrence in patients with locally advanced rectal cancer Eur Radiol 32 971 980 2022 10.1007/s00330-021-08144-w 34327580 PMC9018044 55 Cui Y Yang W Ren J Li D Du X Zhang J Yang X Prognostic value of multiparametric MRI-based radiomics model: Potential role for chemotherapeutic benefits in locally advanced rectal cancer Radiother Oncol 154 161 169 2021 10.1016/j.radonc.2020.09.039 32976874 56 Huang H Han L Guo J Zhang Y Lin S Chen S Lin X Cheng C Guo Z Qiu Y Pretreatment MRI-based radiomics for prediction of rectal cancer outcome: A discovery and validation study Acad Radiol 31 1878 1888 2024 10.1016/j.acra.2023.10.055 37996362 57 Liu Z Meng X Zhang H Li Z Liu J Sun K Meng Y Dai W Xie P Ding Y Predicting distant metastasis and chemotherapy benefit in locally advanced rectal cancer Nat Commun 11 4308 2020 10.1038/s41467-020-18162-9 32855399 PMC7452897 58 Wei Q Chen L Hou X Lin Y Xie R Yu X Zhang H Wen Z Wu Y Liu X Chen W Multiparametric MRI-based radiomic model for predicting lymph node metastasis after neoadjuvant chemoradiotherapy in locally advanced rectal cancer Insights Imaging 15 163 2024 10.1186/s13244-024-01726-4 38922456 PMC11208366 59 Tibermacine H Rouanet P Sbarra M Forghani R Reinhold C Nougaret S GRECCAR Study Group Radiomics modelling in rectal cancer to predict disease-free survival: Evaluation of different approaches Br J Surg 108 1243 1250 2021 10.1093/bjs/znab191 34423347 60 Jalil O Afaq A Ganeshan B Patel UB Boone D Endozo R Groves A Sizer B Arulampalam T Magnetic resonance based texture parameters as potential imaging biomarkers for predicting long-term survival in locally advanced rectal cancer treated by chemoradiotherapy Colorectal Dis 19 349 362 2017 10.1111/codi.13496 27538267 61 Dinapoli N Barbaro B Gatta R Chiloiro G Casà C Masciocchi C Damiani A Boldrini L Gambacorta MA Dezio M Magnetic resonance, vendor-independent, intensity histogram analysis predicting pathologic complete response after radiochemotherapy of rectal cancer Int J Radiat Oncol Biol Phys 102 765 774 2018 10.1016/j.ijrobp.2018.04.065 29891200 62 Jeon SH Song C Chie EK Kim B Kim YH Chang W Lee YJ Chung JH Chung JB Lee KW Delta-radiomics signature predicts treatment outcomes after preoperative chemoradiotherapy and surgery in rectal cancer Radiat Oncol 14 43 2019 10.1186/s13014-019-1246-8 30866965 PMC6417065 63 Chiloiro G Rodriguez-Carnero P Lenkowicz J Casà C Masciocchi C Boldrini L Cusumano D Dinapoli N Meldolesi E Carano D Delta radiomics can predict distant metastasis in locally advanced rectal cancer: The challenge to personalize the cure Front Oncol 10 595012 2020 10.3389/fonc.2020.595012 33344243 PMC7744725 64 Chiloiro G Boldrini L Preziosi F Cusumano D Yadav P Romano A Placidi L Lenkowicz J Dinapoli N Bassetti MF A predictive model of 2yDFS during MR-Guided RT Neoadjuvant chemoradiotherapy in locally advanced rectal cancer patients Front Oncol 12 831712 2022 10.3389/fonc.2022.831712 35280799 PMC8907443 65 Park H Kim KA Jung JH Rhie J Choi SY MRI features and texture analysis for the early prediction of therapeutic response to neoadjuvant chemoradiotherapy and tumor recurrence of locally advanced rectal cancer Eur Radiol 30 4201 4211 2020 10.1007/s00330-020-06835-4 32270317 66 Miles KA Ganeshan B Hayball MP CT texture analysis using the filtration-histogram method: What do the measurements mean? Cancer Imaging 13 400 406 2013 10.1102/1470-7330.2013.9045 24061266 PMC3781643 67 Hocquelet A Auriac T Perier C Dromain C Meyer M Pinaquy JB Denys A Trillaud H Senneville BD Vendrely V Pre-treatment magnetic resonance-based texture features as potential imaging biomarkers for predicting event free survival in anal cancer treated by chemoradiotherapy Eur Radiol 28 2801 2811 2018 10.1007/s00330-017-5284-z 29404766 68 Wang C Chen J Zheng N Zheng K Zhou L Zhang Q Zhang W Predicting the risk of distant metastasis in patients with locally advanced rectal cancer using model based on pre-treatment T2WI-based radiomic features plus postoperative pathological stage Front Oncol 13 1109588 2023 10.3389/fonc.2023.1109588 37746305 PMC10517628 69 Meng Y Zhang Y Dong D Li C Liang X Zhang C Wan L Zhao X Xu K Zhou C Novel radiomic signature as a prognostic biomarker for locally advanced rectal cancer J Magn Reson Imaging 13 doi: 10.1002/jmri.25968 2018 10.1002/jmri.25968 29437271 70 Trebeschi S van Griethuysen JJM Lambregts DMJ Lahaye MJ Parmar C Bakers FCH Peters N Beets-Tan RGH Aerts H Deep learning for fully-automated localization and segmentation of rectal cancer on multiparametric MR Sci Rep 7 5301 2017 10.1038/s41598-017-05728-9 28706185 PMC5509680 71 Shen D Wu G Suk HI Deep learning in medical image analysis Annu Rev Biomed Eng 19 221 248 2017 10.1146/annurev-bioeng-071516-044442 28301734 PMC5479722 72 Shin J Seo N Baek SE Son NH Lim JS Kim NK Koom WS Kim S MRI radiomics model predicts pathologic complete response of rectal cancer following chemoradiotherapy Radiology 303 351 358 2022 10.1148/radiol.211986 35133200 73 Liu Z Zhang XY Shi YJ Wang L Zhu HT Tang Z Wang S Li XT Tian J Sun YS Radiomics analysis for evaluation of pathological complete response to neoadjuvant chemoradiotherapy in locally advanced rectal cancer Clin Cancer Res 23 7253 7262 2017 10.1158/1078-0432.CCR-17-1038 28939744 74 Liu X Zhang D Liu Z Li Z Xie P Sun K Wei W Dai W Tang Z Ding Y Deep learning radiomics-based prediction of distant metastasis in patients with locally advanced rectal cancer after neoadjuvant chemoradiotherapy: A multicentre study EBioMedicine 69 103442 2021 10.1016/j.ebiom.2021.103442 34157487 PMC8237293 75 Jiang X Zhao H Saldanha OL Nebelung S Kuhl C Amygdalos I Lang SA Wu X Meng X Truhn D An mri deep learning model predicts outcome in rectal cancer Radiology 307 e222223 2023 10.1148/radiol.222223 37278629 76 Zhang S Cai G Xie P Sun C Li B Dai W Liu X Qiu Q Du Y Li Z Improving prognosis and assessing adjuvant chemotherapy benefit in locally advanced rectal cancer with deep learning for MRI: A retrospective, multi-cohort study Radiother Oncol 188 109899 2023 10.1016/j.radonc.2023.109899 37660753 77 Najjar R Redefining radiology: A review of artificial intelligence integration in medical imaging Diagnostics (Basel) 13 2760 2023 10.3390/diagnostics13172760 37685300 PMC10487271 78 Li ZY Wang XD Li M Liu XJ Ye Z Song B Yuan F Yuan Y Xia CC Zhang X Li Q Multi-modal radiomics model to predict treatment response to neoadjuvant chemotherapy for locally advanced rectal cancer World J Gastroenterol 26 2388 2402 2020 10.3748/wjg.v26.i19.2388 32476800 PMC7243642 79 Shahzadi I Zwanenburg A Lattermann A Linge A Baldus C Peeken JC Combs SE Diefenhardt M Rödel C Kirste S Analysis of MRI and CT-based radiomics features for personalized treatment in locally advanced rectal cancer and external validation of published radiomics models Sci Rep 12 10192 2022 10.1038/s41598-022-13967-8 35715462 PMC9205935 80 Zhou B Khosla A Lapedriza A Oliva A Torralba A Learning deep features for discriminative localization Computer Vision and Pattern Recognition (cs.CV) 2015 10.48550/arXiv.1512.04150 81 Kazerooni AF Kraya A Rathi KS Kim MC Vossough A Khalili N Familiar AM Gandhi D Khalili N Kesherwani V Multiparametric MRI along with machine learning predicts prognosis and treatment response in pediatric low-grade glioma Nat Commun 16 340 2025 10.1038/s41467-024-55659-z 39747214 PMC11697432 82 Bando H Ohtsu A Yoshino T Therapeutic landscape and future direction of metastatic colorectal cancer Nat Rev Gastroenterol Hepatol 20 306 322 2023 10.1038/s41575-022-00736-1 36670267 83 Dayde D Tanaka I Jain R Tai MC Taguchi A Predictive and prognostic molecular biomarkers for response to neoadjuvant chemoradiation in rectal cancer Int J Mol Sci 18 573 2017 10.3390/ijms18030573 28272347 PMC5372589 Table I. Summary of radiomics and deep learning applications for predicting prognosis after nCRT. Study No. of patients Design MRI timing Sequence Feature type Feature selection Classification Prediction target AUC C-index Accuracy Sensitity Specificity Main finding (Refs.) Jalil et al 56 Retros- Pre-nCRT, T2WI Radiomics Filtration Histogram OS, / / / / / Lower mean ( 60 2017 pective post-nCRT feature histogram DFS, MPP in single RFS medium center texture was independently associated with OS and DFS, kurtosis in medium texture predicted RFS Meng et al 108 Retros- Pre-nCRT CE-TIWI Radiomics LASSO, LASSO, DFS Training= Training= / / / / ( 69 2018 pective feature, Cox Cox 0.842, 0.804 sngle clinical regression regression validation= (95% CI: center feature 0.837 0.736–0.873), P=0.001; validation= 0.788 (95% CI: 0.718–0.857), P=0.005 Jeon et al 101 Retros- Pre-nCRT, T2WI Radiomics LASSO Cox LR, / / / / / Both 2D and ( 62 2019 pective post-nCRT feature proportional DM, 3D Rad scores sngle hazards DFS emerged as center independent prognostic factors Chiloiro et al 213 Retros- Pre-nCRT, T2WI Radiomics MWU, Logistic DM / / 0.785 0.714 0.857 / ( 63 2020 pective post-nCRT feature PCC regression sngle center Park et al 78 Pre-nCRT T2WI Radiomics Chi-square Logistic LR 0.639 / 0.677 0.657 0.596 GLRLM_ ( 65 2020 feature, test or regression LRLGE was clinical independent significantly feature t-test able to predict LR Liu et al 629 Pre-nCRT T2WI, Radiomics ICC, Cox LASSO, DM Primary= Primary= / / / / ( 57 2020 ADC feature, regression, Cox 0.97, 0.855 clinical PCC regression validation1= (95% CI: feature 0.86, 0.812–0.899), validation2= validation1= 0.89, 0.848 validation3= (95% CI: 0.85 0.773–0.923), validation2= 0.831 (95% CI: 0.742–0.920), validation3= 0.825 (95% CI: 0.728–0.921) Cui et al 186 Retros- Pre-nCRT T2WI, Radiomics ICC, Boruta Boruta, DFS / Training= / / / / ( 55 2021 pective ADC, feature, algorithm, Multivariate 0.780 sngle CE-TIWI clinical RF Cox (95% CI: center feature regression 0.718–0.843), validation= 0.803 (95% CI: 0.717–0.889) Tibermacine 146 Retros- Pre-nCRT, T2WI Radiomics Wilcoxon RF DFS Training= / / / / / ( 59 et al pective post-nCRT feature, test 0.77–0.89, multi- clinical validation= center feature 0.67–0.76 Liu et al 235 Retros- Pre-nCRT T2WI, DL feature / CNN DMFS Primary= Primary= / / / / ( 74 2021 pective DWI 0.938, 0.851 multi- validation= (95% CI: center 0.892 0.795–0.906), validation= 0.747 (95% CI: 0.665–0.830) Jayaprakasam 236 Pre-nCRT T2WI Radiomics MWU, SVM LR, LR: 0.79, / / LR: 0.683, LR: 0.807, / ( 54 et al feature, LASSO DM DM: 0.87 DM: 0.800 DM: 0.884 clinical feature Chiloiro et al 48 Pre-nCRT, T2WI Radiomics MWU, Logistic DFS 0.92 / / 1 0.775 / ( 64 2022 post-nCRT feature, PCC regression clinical feature Xie et al 166 Pre-nCRT, T2WI Radiomics ICC LASSO, PFS / Training= / / / / ( 51 2022 post-nCRT feature, Cox 0.942 clinical regression (95% CI: feature 0.922–0.962), validation= 0.752 (95% CI: 0.684–0.820) Chiloiro et al 203 Retros- Pre-nCRT, T2WI Radiomics MWU Logistic DFS Training= / / Training= Training= / ( 52 2023 pective post-nCRT feature regression 0.79, 0.62, 0.88, sngle validation= validation= validation= center 0.70 0.91 0.46 Wang et al 260 Retros- Pre-nCRT T2WI Radiomics ICC, Cox LASSO, DM Training= Validation= / / / / ( 68 2023 pective feature, regression, Cox 0.83, 0.788 sngle clinical PCC, regression validation= (95% CI center feature LASSO 0.74 0.751- 0.825) Zhang et al 800 Pre-nCRT T2WI, DL feature / CNN OS, / OS=0.7234 / / / / ( 76 2023 DWI, DMFS, (95% CI: ADC LRFS 0.6674- 0.7796), DMFS= 0.7097 (95% CI: 0.6515- 0.7679), LRFS= 0.6794 (95% CI: 0.5605- 0.7982) Jiang et al 725 Pre-nCRT T2WI DL feature / XGBoost OS, / OS=0.82, / / / / ( 75 2023 DFS DFS=0.69 Huang et al 454 Retros- Pre-nCRT T2WI, Radiomics LASSO Logistic LR or Training= / / 0.58–0.87 0.58–0.87 / ( 56 2024 pective DWI, feature regression DM 0.83, multi- CE-TIWI internal center validation= 0.81, external validation= 0.82 ADC, apparent diffusion coefficient; AUC, area under the curve; CE-TIWI, contrast-enhanced T1-weighted imaging; C-index, concordance index; CNN, convolutional neural network; DFS, disease-free survival; DM, distant metastasis; DMFS, DM-free survival; DWI, diffusion-weighted imaging; ICC, intraclass correlation coefficient; LASSO, least absolute shrinkage and selection operator; LR, local recurrence; LRFS, local recurrence-free survival; MWU, Mann-Whitney U-test; nCRT, neoadjuvant chemoradiotherapy; OS, overall survival; PCC, Pearson correlation coefficient; PFS, progression-free survival; RF, random forest; SVM, support vector machine; T2WI, T2-weighted imaging; XGBoost, eXtreme gradient boosting. ",
  "metadata": {
    "Title of this paper": "Predictive and prognostic molecular biomarkers for response to neoadjuvant chemoradiation in rectal cancer",
    "Journal it was published in:": "Oncology Letters",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12485598/"
  }
}