{
  "title": "Paper_707",
  "abstract": "pmc Curr Issues Mol Biol Curr Issues Mol Biol 4181 cimb cimb Current Issues in Molecular Biology 1467-3037 1467-3045 Multidisciplinary Digital Publishing Institute  (MDPI) PMC12468620 PMC12468620.1 12468620 12468620 41020815 10.3390/cimb47090693 cimb-47-00693 1 Article The SMIM25-COX-2 Wang Zhenxing 1 2 Li Xia 1 Zhang Shiyi 1 Sun Jiamin 1 2 https://orcid.org/0000-0002-5408-2377 Lu Qinchen 1 Tao Yuting 1 Liang Shuang 1 Lan Xiuwan 3 https://orcid.org/0000-0002-1494-6396 Zhong Jianhong 4 * Wang Qiuyan 1 * Liobikas Julius Academic Editor 1 wangzhenxing@stu.gxmu.edu.cn lixiadeya@163.com shiyizhang990622@163.com sjm18172067558@163.com luqinchen@stu.gxmu.edu.cn tytxzxh@126.com 202320183@sr.gxmu.edu.cn 2 3 lanxiuwan@163.com 4 * zhongjianhong@gxmu.edu.cn wangqiuyan@gxmu.edu.cn 27 8 2025 9 2025 47 9 497442 693 31 7 2025 20 8 2025 26 8 2025 27 08 2025 27 09 2025 30 09 2025 © 2025 by the authors. 2025 https://creativecommons.org/licenses/by/4.0/ Licensee MDPI, Basel, Switzerland. This article is an open access article distributed under the terms and conditions of the Creative Commons Attribution (CC BY) license ( https://creativecommons.org/licenses/by/4.0/ Hepatocellular carcinoma (HCC) is a malignancy that is notorious for its dismal prognosis. Dysregulation of the tumor microenvironment (TME) in HCC has emerged as a key hallmark in determining disease progression and the response to immunotherapy. The aim of this study was to identify novel TME regulators that contribute to therapeutic resistance, thus providing mechanistic insights for targeted interventions. The expression of SMIM25 SMIM25 SMIM25 SMIM25 SMIM25 p SMIM25 SMIM25 SMIM25 SMIM25 SMIM25 cyclooxygenase-2 COX-2 COX-2 SMIM25 p SMIM25-COX-2 SMIM25 HCC SMIM25 immunosuppressive microenvironment COX-2 immunotherapy Guangxi science and technology development project AB23026002 2024GXNSFAA010070 AD22035042 Natural Science Foundation of China 82260569 Guangxi Natural Science Fund for Innovation Research Team 2016GXNSFGA380006 Innovation Project of Guangxi Graduate Education YCBZ2023101 First-class discipline innovation-driven talent program of Guangxi Medical University This work was supported by Guangxi science and technology development project (AB23026002, 2024GXNSFAA010070, AD22035042), Natural Science Foundation of China (82260569), Guangxi Natural Science Fund for Innovation Research Team (2016GXNSFGA380006), Innovation Project of Guangxi Graduate Education (YCBZ2023101) and First-class discipline innovation-driven talent program of Guangxi Medical University. pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement yes pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes 1. Introduction Hepatocellular carcinoma (HCC) is a highly prevalent malignancy of the digestive system, ranking sixth globally among all cancers by incidence, and accounting for the fourth-highest cancer-related mortality worldwide [ 1 2 3 In recent years, cancer immunotherapy has demonstrated significant clinical efficacy in various advanced malignancies. In particular, immunotherapy with immune checkpoint inhibitors has shown encouraging results in certain cancer types, notably melanoma and lung cancer [ 4 5 6 programmed cell death protein 1 PD-1 PD-L1) 7 8 PD-1 9 10 Given the limitations of current treatments, the development of novel therapeutic modalities is of paramount importance. Among the most promising are peptide-based therapeutics, which offer unique advantages in cancer treatment due to their high specificity and favorable safety profiles [ 11 PD-1 PD-L1 12 13 14 15 In this study, we identified a long non-coding RNA (lncRNA) called SMIM25 SMIM25 SMIM25 SMIM25 COX-2 2. Materials and Methods 2.1. Patients and Samples A total of 58 HCC tissue samples were collected from HCC patients who underwent potentially curative hepatic resection at Guangxi Medical University Cancer Hospital, China, from 1 January 2018 to 30 November 2020 (Guangxi cohort 1). A total of 74 HCC tissue samples were collected from HCC patients who underwent potentially curative hepatic resection at Guangxi Medical University Cancer Hospital, China, from January 1 to 30 November 2021 (Guangxi cohort 2). Written informed consent was provided by all participants. The collection and use of these samples were approved by the Ethics Committee of Guangxi Medical University (Approval No.: 20200137). The collection and handling procedures strictly adhered to institutional standards and the principles of the Declaration of Helsinki. Comprehensive clinical and pathological information was gathered on age, sex, tumor number, tumor size, Barcelona Clinical Liver Cancer stage [ 16 17 18 19 n n 2.2. RNA Extraction and Reverse Transcription–Polymerase Chain Reaction (RT-PCR) RNA was extracted from tissues, whole blood, and liver cancer cells using TRIzol reagent (Invitrogen, Carlsbad, CA, USA), strictly following the manufacturer’s guidelines. Following this, ribosomal RNA was removed from the total RNA samples with the aid of the Ribo-Zero rRNA Removal Kit (Illumina, CA, USA). The resultant purified RNA was then converted into cDNA using the PrimeScript™ RT Reagent Kit provided by Takara (Dalian, China). To determine the expression levels of SMIM25, RT-PCR was performed using SYBR Green Mix (Roche, Boston, MA, USA) along with the specified primer pairs: for GAPDH SMIM25 GAPDH − ΔΔCT 2.3. RNA In Situ Hybridization (ISH) Assay The RNA ISH assay was conducted adhering to the guidelines provided by the Boster kit (MK1030,Boster Biological Technology, Pleasanton, CA, USA). Standard procedures were employed for dewaxing paraffin sections to water, followed by a prehybridization step with prehybridization solution maintained at 42 °C for a duration of 2 h. Subsequently, the sections were incubated with a solution containing digoxigenin-labeled probes at 37 °C for 4 h. Post-incubation, the slides underwent rigorous washing and were then subjected to a streptavidin-peroxidase reaction system. They were stained with DAB for a period of 1 min. Counterstaining was performed using 0.1% hematoxylin sourced from Solarbio (Beijing, China) for a duration ranging from 30 s to 1 min. After permeabilization with xylene, the slides were sealed using neutral gum. After permeabilization with xylene, the slides were sealed using neutral gum. Following staining, slides were scanned using a Nano Zoomer S60 Digital slide scanner (HAMAMATSU, Hamamatsu City, Japan). Quantification was performed using ImageJ software (version 1.54k). Each image was scored based on staining intensity, categorized into three levels: negative, weakly positive, and strongly positive [ 20 2.4. Immunohistochemistry Antibodies for anti- CD4 CD8 CD68 Collagen_1 α-SMA Collagen_5 Section 2.14 2.5. Cell Culture The HCC-LM3 (LM3) and THLE2 cell lines were obtained from the Stem Cell Bank of the Chinese Academy of Sciences (Shanghai, China). All cell lines underwent rigorous mycoplasma testing via PCR-based methods, with results confirming negative status. These cell lines were subsequently cultivated and maintained in Dulbecco’s Modified Eagle Medium (DMEM; Gibco, Guangzhou, China), which was enriched with penicillin (100 U/mL), streptomycin (0.1 mg/mL), and 10% fetal bovine serum (FBS; Gibco, Guangzhou, China). Cells were passaged at 80–90% confluence every 2–3 days at 1:4 ratio through enzymatic digestion using TrypLE solution (Life Technologies, Carlsbad, CA, USA) and cultured in an atmosphere containing 5% CO 2 2.6. Cell Transfection and Drug Treatment During the logarithmic growth phase, HCC cells underwent transfection procedures. Prior to transfection, these cells were plated into 6-well dishes, and their density was adjusted to 70%. Subsequently, they were transfected with lentivirus harboring pGWLV11-new (sourced from Genewiz, Suzhou, China), which carries the gene for SMIM25 COX-2 COX-2 COX-2 COX-2 5 COX-2 COX-2 COX-2 COX-2 COX-2 2.7. 3-(4,5-Dimethylthiazol-2-yl)-2,5-diphenyltetrazolium Bromide (MTT) Assay The HCC cells were plated in 96-well plates at a cellular density of 1500 cells per well. Subsequently, the cells were exposed to two treatment conditions: 0 µM and 25 µM of celecoxib, respectively. At designated time intervals, 10 μL of MTT solution (5 mg/mL; Sigma, New York, NY, USA) was administered to each well, followed by an additional 4-h incubation period. Following this, 100 μL of DMSO was introduced to each well to dissolve the formed formazan crystals. The absorbance values were then determined at a wavelength of 490 nm utilizing a microplate reader (model: FLUOstar Omega, BMG LABTECH, Ortenberg, Germany). All experimental procedures were conducted in triplicate to ensure accuracy and reproducibility. 2.8. Scratch Migration Assay For the scratch migration assay, cells were plated in six-well dishes at a density of 1 × 10 6 2.9. Animal Experiments All animal procedures were performed in strict accordance with the Guidelines for the Care and Use of Laboratory Animals and were approved by the Institutional Animal Care and Use Committee of Guangxi Medical University (Approval No:202204017). A total of ten 5-week-old male BALB/c nude mice were sourced from the Laboratory Animal Center of Guangxi Medical University. The animals were housed in individually ventilated cages under specific-pathogen-free (SPF) conditions with ad libitum access to sterile food and water, and were allowed a one-week acclimatization period before the experiment. Using a computer-generated random number list, mice were randomly assigned to two groups ( n 6 SMIM25 SMIM25 6 2 2 2.10. Whole—Transcriptome Sequencing RNA of appropriate concentration and purity was extracted from fresh tumor tissues and sequenced on an Illumina platform. The quality of the sequencing raw data was assessed using FastQC software (v0.11.9) and raw reads with joints, repeats, and low-sequencing quality were removed using Trimmatic (v0.39) [ 21 22 23 2.11. Differentially Expressed Genes and Enrichment Analysis The DESeq2 package within the R environment was employed to discern differentially expressed genes(DEGs), characterized by expression change of |log2 (fold change)| ≥ 1.5 with a false discovery rate (FDR)-adjusted p https://david.ncifcrf.gov/ http://kobas.cbi.pku.edu.cn/ SMIM25 p 2.12. Single-Sample GSEA (ssGSEA) Based on the results of RNA sequencing, ssGSEA was performed to quantify 27 immune signatures [ 24 2.13. Cytometry Based on Time of Flight (CyTOF) 2.13.1. Preparation of Single-Cell Suspensions Excised tumor tissues were promptly immersed in pre-chilled transfer buffer comprising DMEM, supplemented with 2% human serum and 1% penicillin/streptomycin, and subsequently stored in an iced container. For the preparation of single-cell suspensions, the tumor tissues underwent initial mincing into minute fragments, no larger than 1 mm 3 Following incubation, the tissue suspension contained within the C tube was dispersed into individual cells through the utilization of the Gentle MACS dissociator (manufactured by Miltenyi, Bergisch Gladbach, Germany), employing a pre-installed protocol (designated as h_tumor_01). The C tube was then inverted and securely attached to the sleeve of the GentleMACS dissociator. Subsequently, the h_tumor_02 program of the GentleMACS was executed once more, and the suspension was further incubated at 37 °C for an additional 30 min. Subsequently, 80% of the cell suspension was aspirated for future applications, whereas the remaining cells underwent processing with the m_imptumor_01 program, utilizing the separator for this purpose. Subsequently, the tissue suspension was filtered on ice through a 70-micrometer cell strainer sourced from Falcon (Shanghai, China). The cells were then pelleted via centrifugation at 1500 revolutions per minute for a duration of five minutes, after which the supernatant was decanted and discarded. Subsequently, the cells were incubated with three volumes of red blood cell lysis buffer manufactured by Solarbio and transferred into a 2-mL low-bind tube. Following a 10-min incubation period on ice, the cells were centrifuged at 450× g 2.13.2. Antibody Labeling and Cell Staining A panel of thirty-five antibodies ( Supplementary Table S1 2.13.3. CyTOF Data Acquisition and Analysis Cell samples were detected using a Helios 2 CyTOF mass spectrometer/flow cytometer with a detection speed < 500 cells/s. The collected flow cytometry data were then standardized and processed with CyTOF software v6.7, and uploaded onto a cloud-based platform (Cytobank ( www.cytobank.org 2.13.4. Imaging Mass Cytometry(IMC) Liver tissue specimens were sourced from the Pathology Department at Guangxi Medical University Cancer Hospital. The antibody ( Supplementary Table S2 2 2 The resulting data were exported in MCD file format and visualized through the MCD viewer software provided by Fluidigm. To enhance the distinction between antibody signals and background noise, each marker was visually inspected, and a threshold for minimum signal intensity was established within the Fluidigm MCD viewer. The sample image was cropped to facilitate independent analysis of distinct scanning regions, with each original image being imported into histoCAT (version 1.75), a software tool designed for multichannel tissue imaging data analysis. To delineate cell subpopulations exhibiting distinct phenotypic traits, cells were clustered based on their protein expression profiles utilizing the PhenoGraph algorithm. 2.14. Quantitative Analysis Using ImageJ For immunohistochemically stained sections, 2–4 high-resolution images per patient (encompassing tumor and stromal regions) were analyzed using the IHC Profiler plugin integrated in ImageJ. The plugin automatically quantified optical density (OD) values through a standardized workflow: (1) color deconvolution, (2) intensity scoring, and (3) calculation of positive area percentage. For imaging mass cytometry data, tumor and stromal regions were differentiated based on epithelial cell (Arginase) and type I collagen staining patterns. The workflow comprised: Threshold-based segmentation: Raw images were processed via Image > Adjust > Threshold, with manual adjustment of sliders to isolate target regions, followed by Apply to generate binary masks. ROI management: Selections were converted to regions of interest (ROIs) using Edit > Selection > Create Selection and stored in the ROI Manager (Analyze > Tools > ROI Manager). Quantification: Target fluorescence channels were activated in the ROI Manager window. After toggling Show All to visualize ROIs, integrated density (IntDen) was measured via Measure. 2.15. CMap Connectivity Analysis for Drug Prediction Differentially expressed genes (DEGs) between SMIM25 p https://clue.io/ SMIM25 Supplementary Table S3 2.16. Statistical Analysisy Data were expressed as mean ± standard deviation (SD). Statistical analyses were conducted utilizing SPSS version 25.0 (Chicago, IL, USA) and GraphPad Prism version 8.0 (GraphPad Software, Chicago, IL, USA). Intergroup differences were assessed using the independent t SMIM25 p t p p p p p 3. Results 3.1. SMIM25 To identify potential lncRNA biomarkers for the prognosis of HCC, we conducted a comprehensive analysis of differentially expressed lncRNAs in a cohort of 58 pairs of tumor and normal liver tissues utilizing whole-transcriptome sequencing. This revealed a significant upregulation of the lncRNA SMIM25 p Figure 1 SMIM25 Figure 1 SMIM25 p Figure 1 SMIM25 Figure 1 SMIM25 Supplementary Figure S1A SMIM25 Figure 1 SMIM25 SMIM25 p Supplementary Figure S1B SMIM25 CK19 p CK19 p Supplementary Figure S1C SMIM25 p Supplementary Figure S1D SMIM25 Supplementary Figure S1E SMIM25 3.2. Transcriptome Analysis of SMIM25 To gain deeper insight into the biological relevance of SMIM25 SMIM25 n SMIM25 n Figure 2 SMIM25 Figure 2 Figure S2 SMIM25 BCL2A1 BIRC5 SNAI1 VIM SMIM25 p SMIM25 Supplementary Figure S3A,B SMIM25 Figure 2 SMIM25 PDCD1 CTLA4 CD209 CDK1 TTK BUB1B SMIM25 p Figure 2 SMIM25 3.3. SMIM25 Transcriptome profiling revealed significant enrichment of immune-related functionalities in the group with high SMIM25 SMIM25 SMIM25 SMIM25 p Figure 3 SMIM25 p Figure 3 25 SMIM25 Figure 3 SMIM25 Figure 3 LOX 26 MMP 27 SMIM25 Figure 3 Figure S4 SMIM25 SMIM25 SMIM25 Figure 4 SMIM25 p Figure 4 SMIM25 CD4 CD8 p Figure 4 SMIM25 CD4 CD68 p Figure 4 SMIM25 3.4. An Immunosuppression-Related Cell Cluster That Has High SMIM25 To investigate the impact of SMIM25 SMIM25 SMIM25 28 29 Figure 5 CD4 CD8 CD45RA Figure 5 SMIM25 p Figure 5 CD279 TIM_3 IL_6 IL_10 IL_17A Supplementary Figure S5 SMIM25 Figure 5 p Figure 5 SMIM25 3.5. SMIM25 COX-2 We next explored the effects of SMIM25 SMIM25 SMIM25 p Figure 6 SMIM25 p Figure 6 SMIM25 Supplementary Figure S6A,B SMIM25 SMIM25 p Figure 6 Figure S6C SMIM25 Given the potential link between SMIM25 SMIM25 COX-2 HAVCR2 CD86 PDCD1LG2 Figure 6 SMIM25 COX-2 SMIM25 COX-2 p Figure 6 COX-2 SMIM25 COX-2 COX-2 COX-2 SMIM25 p Figure 6 COX-2 SMIM25 COX-2 SMIM25 COX-2 SMIM25 p Figure 6 SMIM25 COX-2 COX-2 SMIM25 3.6. Predictive Value of the Synergistic SMIM25-COX-2 Given the role of SMIM25 SMIM25 SMIM25 SMIM25 Supplementary Figure S7A,B SMIM25 p Figure 7 p Figure 7 p Figure 7 SMIM25 p Figure 7 PD-L1 SMIM25 SMIM25 Figure 7 COX-2 SMIM25 COX-2 p Figure 7 COX-2 SMIM25 p Figure 7 SMIM25 COX-2 SMIM25 COX-2 p Figure 7 SMIM25 JAK COX SMIM25 Figure 7 Supplementary Table S3 COX-2 SMIM25 4. Discussion Small integral membrane protein 25 ( SMIM25 LINC01272 PELATON GCRL1 30 31 SMIM25 p53 p53 32 SMIM25 33 SMIM25 SMIM25 To further investigate the impact of SMIM25 SMIM25 SMIM25 CTLA4 PDCD1 CD274 PDCD1LG2 34 35 SMIM25 IL-10 TGF-β CTLA-4 PD-1 36 37 38 Immunotherapy has emerged as a crucial adjunct therapy for cancer by inhibiting immunosuppressive mechanisms and enhancing adaptive T-cell-based therapies [ 39 25 40 41 42 SMIM25 COX-2 43 COX-2 SMIM25 SMIM25 COX-2 COX-2 SMIM25 PD-1 COX-2 44 45 COX-2 46 47 COX-2 α-PD-L1 48 49 Our findings are subject to several limitations that warrant further investigation. Although we showed that (1) SMIM25 SMIM25 COX-2 COX-2 SMIM25 COX-2 COX-2 SMIM25 SMIM25 SMIM25 SMIM25 SMIM25-COX-2 SMIM25-COX-2 SMIM25-COX-2 5. Conclusions In summary, our results demonstrate that SMIM25 SMIM25 SMIM25 SMIM25 COX-2 SMIM25-COX-2 Acknowledgments The authors thank the National Natural Science Foundation of China and Guangxi Medical University for their support. Disclaimer/Publisher’s Note: Supplementary Materials The following supporting information can be downloaded at: https://www.mdpi.com/article/10.3390/cimb47090693/s1 Author Contributions Conceptualization, Z.W. and X.L. (Xia Li); Methodology, S.Z.; Software, Y.T.; Formal Analysis, J.S.; Investigation, Q.L.; Data Curation, S.L.; Resources, X.L. (Xiuwan Lan); Writing—Original Draft Preparation, Z.W. and X.L. (Xia Li); Writing—Review and Editing, J.Z. and Q.W.; Supervision, Q.W.; All authors have read and agreed to the published version of the manuscript. Institutional Review Board Statement This study was conducted in accordance with the Declaration of Helsinki and approved by the Ethics Committee of Guangxi Medical University (Approval No.: 20200137, Date: 30 July 2020). Written informed consent was obtained from all participants. Informed Consent Statement Informed consent for participation was obtained from all subjects involved in the study. Data Availability Statement All data generated and described in this article are available from the corresponding author on reasonable request. Conflicts of Interest The author declares there are no conflicts of interest. Abbreviations The following abbreviations are used in this manuscript: HCC Hepatocellular Carcinoma TME The Tumor Microenvironment LncRNA Long Non-Coding RNA SMIM25 Small Integral Membrane Protein 25 ECM The Extracellular Matrix GSEA Gene Set Enrichment Analysis ssGSEA Single-Sample GSEA CyTOF Cytometry Based on Time of Flight ROIs Regions of Interest DEGs Differentially Expressed Genes References 1. Sung H. Ferlay J. Siegel R.L. Laversanne M. Soerjomataram I. Jemal A. Bray F. Global Cancer Statistics 2020: Globocan Estimates of Incidence and Mortality Worldwide for 36 Cancers in 185 Countries CA Cancer J. Clin. 2021 71 209 249 10.3322/caac.21660 33538338 2. Wang W. Wei C. Advances in the Early Diagnosis of Hepatocellular Carcinoma Genes Dis. 2020 7 308 319 10.1016/j.gendis.2020.01.014 32884985 PMC7452544 3. Guo D.Z. Zhang X. Zhang S.Q. Zhang S.Y. Zhang X.Y. Yan J.Y. Dong S.Y. Zhu K. Yang X.R. Fan J. Single-Cell Tumor Heterogeneity Landscape of Hepatocellular Carcinoma: Unraveling the Pro-Metastatic Subtype and Its Interaction Loop with Fibroblasts Mol. Cancer 2024 23 157 10.1186/s12943-024-02062-3 39095854 PMC11295380 4. Hodi F.S. O’Day S.J. McDermott D.F. Weber R.W. Sosman J.A. Haanen J.B. Gonzalez R. Robert C. Schadendorf D. Hassel J.C. Improved Survival with Ipilimumab in Patients with Metastatic Melanoma N. Engl. J. Med. 2010 363 711 723 Correction in N. Engl. J. Med. 2010 363 10.1056/NEJMoa1003466 20525992 PMC3549297 5. Versluis J.M. Menzies A.M. Sikorska K. Rozeman E.A. Saw R.P.M. van Houdt W.J. Eriksson H. Klop W.M.C. Ch’ng S. van Thienen J.V. Survival Update of Neoadjuvant Ipilimumab Plus Nivolumab in Macroscopic Stage III Melanoma in the Opacin and Opacin-Neo Trials Ann. Oncol. 2023 34 420 430 10.1016/j.annonc.2023.01.004 36681299 6. Shi J. Liu J. Tu X. Li B. Tong Z. Wang T. Zheng Y. Shi H. Zeng X. Chen W. Single-Cell Immune Signature for Detecting Early-Stage Hcc and Early Assessing Anti-Pd-1 Immunotherapy Efficacy J. Immunother. Cancer 2022 10 e003133 10.1136/jitc-2021-003133 35101942 PMC8804705 7. Finn R.S. Ryoo B.Y. Merle P. Kudo M. Bouattour M. Lim H.Y. Breder V. Edeline J. Chao Y. Ogasawara S. Pembrolizumab as Second-Line Therapy in Patients with Advanced Hepatocellular Carcinoma in Keynote-240: A Randomized, Double-Blind, Phase III Trial J. Clin. Oncol. 2020 38 193 202 10.1200/JCO.19.01307 31790344 8. Qin S. Ren Z. Meng Z. Chen Z. Chai X. Xiong J. Bai Y. Yang L. Zhu H. Fang W. Camrelizumab in Patients with Previously Treated Advanced Hepatocellular Carcinoma: A Multicentre, Open-Label, Parallel-Group, Randomised, Phase 2 Trial Lancet Oncol. 2020 21 571 580 10.1016/S1470-2045(20)30011-5 32112738 9. El-Khoueiry A.B. Sangro B. Yau T. Crocenzi T.S. Kudo M. Hsu C. Kim T.Y. Choo S.P. Trojan J. Welling T.H.R. Nivolumab in Patients with Advanced Hepatocellular Carcinoma (CheckMate 040): An Open-Label, Non-Comparative, Phase 1/2 Dose Escalation and Expansion Trial Lancet 2017 389 2492 2502 10.1016/S0140-6736(17)31046-2 28434648 PMC7539326 10. Qiu X. Zhou T. Li S. Wu J. Tang J. Ma G. Yang S. Hu J. Wang K. Shen S. Spatial Single-Cell Protein Landscape Reveals Vimentin(High) Macrophages as Immune-Suppressive in the Microenvironment of Hepatocellular Carcinoma Nat. Cancer 2024 5 1557 1578 10.1038/s43018-024-00824-y 39327501 11. Araste F. Abnous K. Hashemi M. Taghdisi S.M. Ramezani M. Alibolandi M. Peptide-Based Targeted Therapeutics: Focus on Cancer Treatment J. Control. Release 2018 292 141 162 10.1016/j.jconrel.2018.11.004 30408554 12. Islam M.K. Stanslas J. Peptide-Based and Small Molecule Pd-1 and Pd-L1 Pharmacological Modulators in the Treatment of Cancer Pharmacol. Ther. 2021 227 107870 10.1016/j.pharmthera.2021.107870 33895183 13. Fu X.Y. Yin H. Chen X.T. Yao J.F. Ma Y.N. Song M. Xu H. Yu Q.Y. Du S.S. Qi Y.K. Three Rounds of Stability-Guided Optimization and Systematical Evaluation of Oncolytic Peptide LTX-315 J. Med. Chem. 2024 67 3885 3908 10.1021/acs.jmedchem.3c02232 38278140 14. Yin H. Chen X.T. Chi Q.N. Ma Y.N. Fu X.Y. Du S.S. Qi Y.K. Wang K.W. The Hybrid Oncolytic Peptide Ntp-385 Potently Inhibits Adherent Cancer Cells by Targeting the Nucleus Acta Pharmacol. Sin. 2023 44 201 210 10.1038/s41401-022-00939-x 35794372 PMC9813345 15. Yin H. Fu X.Y. Gao H.Y. Ma Y.N. Yao J.F. Du S.S. Qi Y.K. Wang K.W. Design, Synthesis and Anticancer Evaluation of Novel Oncolytic Peptide-Chlorambucil Conjugates Bioorg Chem. 2023 138 106674 10.1016/j.bioorg.2023.106674 37331169 16. Llovet J.M. Brú C. Bruix J. Prognosis of hepatocellular carcinoma: The BCLC staging classification Semin. Liver Dis. 1999 19 329 338 10.1055/s-2007-1007122 10518312 17. Reig M. Cabibbo G. Antiviral Therapy in the Palliative Setting of Hcc (Bclc-B and -C) J. Hepatol. 2021 74 1225 1233 10.1016/j.jhep.2021.01.046 33582128 18. Zhou L. Rui J.A. Zhou W.X. Wang S.B. Chen S.G. Qu Q. Edmondson-Steiner Grade: A Crucial Predictor of Recurrence and Survival in Hepatocellular Carcinoma Without Microvascular Invasio Pathol. Res. Pract. 2017 213 824 830 10.1016/j.prp.2017.03.002 28554743 19. Zhou Z. Cao S. Chen C. Chen J. Xu X. Liu Y. Liu Q. Wang K. Han B. Yin Y. A Novel Nomogram for the Preoperative Prediction of Edmondson-Steiner Grade III-IV in Hepatocellular Carcinoma Patients J. Hepatocell. Carcinoma 2023 10 1399 1409 10.2147/JHC.S417878 37641593 PMC10460586 20. Allred D.C. Harvey J.M. Berardo M. Clark G.M. Prognostic and Predictive Factors in Breast Cancer by Immunohistochemical Analysis Mod. Pathol. 1998 11 155 168 9504686 21. Bolger A.M. Lohse M. Usadel B. Trimmomatic: A flexible Trimmer for Illumina Sequence Data Bioinformatics 2014 30 2114 2120 10.1093/bioinformatics/btu170 24695404 PMC4103590 22. Kim D. Paggi J.M. Park C. Bennett C. Salzberg S.L. Graph-Based Genome Alignment and Genotyping with Hisat2 and Hisat-Genotype Nat. Biotechnol. 2019 37 907 915 10.1038/s41587-019-0201-4 31375807 PMC7605509 23. Pertea M. Pertea G.M. Antonescu C.M. Chang T.C. Mendell J.T. Salzberg S.L. StringTie Enables Improved Reconstruction of a Transcriptome from Rna-Seq Reads Nat. Biotechnol. 2015 33 290 295 10.1038/nbt.3122 25690850 PMC4643835 24. He Y. Jiang Z. Chen C. Wang X. Classification of Triple-Negative Breast Cancers Based on Immunogenomic Profiling J. Exp. Clin. Cancer Res. 2018 37 327 10.1186/s13046-018-1002-1 30594216 PMC6310928 25. Sun X. Wu B. Chiang H.C. Deng H. Zhang X. Xiong W. Liu J. Rozeboom A.M. Harris B.T. Blommaert E. Tumour Ddr1 Promotes Collagen Fibre Alignment to Instigate Immune Exclusion Nature 2021 599 673 678 10.1038/s41586-021-04057-2 34732895 PMC8839149 26. Dewidar B. Meyer C. Dooley S. Meindl-Beinker A.N. TGF-β in Hepatic Stellate Cell Activation and Liver Fibrogenesis-Updated 2019 Cells 2019 8 1419 10.3390/cells8111419 31718044 PMC6912224 27. Davis F.M. Melvin W.J. Mangum K. Tsoi L.C. Joshi A.D. Cai Q. Henke P.K. Gudjonsson J.E. Gallagher K.A. The Histone Methyltransferase SETDB2 Modulates Tissue Inhibitors of Metalloproteinase-Matrix Metalloproteinase Activity During Abdominal Aortic Aneurysm Development Ann. Surg. 2023 278 426 440 10.1097/SLA.0000000000005963 37325923 PMC10526639 28. Narvaez-Montoya C. Mahlknecht J. Torres-Martínez J.A. Mora A. Pino-Vargas E. FlowSOM Clustering—A Novel Pattern Recognition Approach for Water Research: Application to a Hyper-Arid Coastal Aquifer System Sci. Total Environ. 2024 915 169988 10.1016/j.scitotenv.2024.169988 38211857 29. Liu X. Song W. Wong B.Y. Zhang T. Yu S. Lin G.N. Ding X. A Comparison Framework and Guideline of Clustering Methods for Mass Cytometry Data Genome Biol. 2019 20 297 10.1186/s13059-019-1917-7 31870419 PMC6929440 30. Chen L. Huang Y. High Expression of Lncrna Pelaton Serves as a Risk Factor for the Incidence and Prognosis of Acute Coronary Syndrome Sci. Rep. 2022 12 8030 10.1038/s41598-022-11260-2 35577857 PMC9110396 31. Subhash S. Kalmbach N. Wegner F. Petri S. Glomb T. Dittrich-Breiholz O. Huang C. Bali K.K. Kunz W.S. Samii A. Transcriptome-Wide Profiling of Cerebral Cavernous Malformations Patients Reveal Important Long Noncoding Rna Molecular Signatures Sci. Rep. 2019 9 18203 10.1038/s41598-019-54845-0 31796831 PMC6890746 32. Fu H. Zhang Z. Li D. Lv Q. Chen S. Zhang Z. Wu M. Lncrna Pelaton, a Ferroptosis Suppressor and Prognositic Signature for Gbm Front. Oncol. 2022 12 817737 10.3389/fonc.2022.817737 35574340 PMC9097896 33. Leng X. Liu G. Wang S. Song J. Zhang W. Zhang X. Rong L. Ma Y. Song F. Linc01272 Promotes Migration and Invasion of Gastric Cancer Cells Via Emt Onco Targets Ther. 2020 13 3401 3410 10.2147/OTT.S242073 32368096 PMC7184168 34. Pardoll D.M. The Blockade of Immune Checkpoints in Cancer Immunotherapy Nat. Rev. Cancer 2012 12 252 264 10.1038/nrc3239 22437870 PMC4856023 35. Li B. Chan H.L. Chen P. Immune Checkpoint Inhibitors: Basics and Challenges Curr. Med. Chem. 2019 26 3009 3025 10.2174/0929867324666170804143706 28782469 36. Maharaj K. Uriepero A. Sahakian E. Pinilla-Ibarz J. Regulatory T Cells (Tregs) in Lymphoid Malignancies and the Impact of Novel Therapies Front. Immunol. 2022 13 943354 10.3389/fimmu.2022.943354 35979372 PMC9376239 37. Massa D. Tosi A. Rosato A. Guarneri V. Dieci M.V. Multiplexed in Situ Spatial Protein Profiling in the Pursuit of Precision Immuno-Oncology for Patients with Breast Cancer Cancers 2022 14 4885 10.3390/cancers14194885 36230808 PMC9562913 38. Yao H. Yu S. Luo Y. Wang M. Wang X. Xu S. Chen Y. Xie Z. Effects of Plasma-Derived Exosomes from the Normal and Thin Bactrian Camels on Hepatocellular Carcinoma and Their Differences at Transcriptome and Proteomics Levels Front. Oncol. 2023 13 994340 10.3389/fonc.2023.994340 36816960 PMC9933125 39. Ai H. Yang H. Li L. Ma J. Liu K. Li Z. Cancer/Testis Antigens: Promising Immunotherapy Targets for Digestive Tract Cancers Front. Immunol. 2023 14 1190883 10.3389/fimmu.2023.1190883 37398650 PMC10311965 40. Grout J.A. Sirven P. Leader A.M. Maskey S. Hector E. Puisieux I. Steffan F. Cheng E. Tung N. Maurin M. Spatial Positioning and Matrix Programs of Cancer-Associated Fibroblasts Promote T-cell Exclusion in Human Lung Tumors Cancer Discov. 2022 12 2606 2625 10.1158/2159-8290.CD-21-1714 36027053 PMC9633420 41. Liu J. Chiang H.C. Xiong W. Laurent V. Griffiths S.C. Dülfer J. Deng H. Sun X. Yin Y.W. Li W. A Highly Selective Humanized Ddr1 Mab Reverses Immune Exclusion by Disrupting Collagen Fiber Alignment in Breast Cancer J. Immunother. Cancer 2023 11 e006720 10.1136/jitc-2023-006720 37328286 PMC10277525 42. Tharp K.M. Kersten K. Maller O. Timblin G.A. Stashko C. Canale F.P. Menjivar R.E. Hayward M.K. Berestjuk I. Ten Hoeve J. Tumor-Associated Macrophages Restrict Cd8 + Nat. Cancer 2024 5 1045 1062 10.1038/s43018-024-00775-4 38831058 PMC12204312 43. Jain R. Hussein M.A. Pierce S. Martens C. Shahagadkar P. Munirathinam G. Oncopreventive and Oncotherapeutic Potential of Licorice Triterpenoid Compound Glycyrrhizin and its Derivatives: Molecular Insights Pharmacol. Res. 2022 178 106138 10.1016/j.phrs.2022.106138 35192957 PMC8857760 44. Hu H. Kang L. Zhang J. Wu Z. Wang H. Huang M. Lan P. Wu X. Wang C. Cao W. Neoadjuvant Pd-1 Blockade with Toripalimab, with or Without Celecoxib, in Mismatch Repair-Deficient or Microsatellite Instability-High, Locally Advanced, Colorectal Cancer (Picc): A Single-Centre, Parallel-Group, Non-Comparative, Randomised, Phase 2 Trial Lancet Gastroenterol. Hepatol. 2022 7 38 48 10.1016/S2468-1253(21)00348-4 34688374 45. Li J. Wu C. Hu H. Qin G. Wu X. Bai F. Zhang J. Cai Y. Huang Y. Wang C. Remodeling of the Immune and Stromal Cell Compartment by Pd-1 Blockade in Mismatch Repair-Deficient Colorectal Cancer Cancer Cell 2023 41 1152 1169.e1157 10.1016/j.ccell.2023.04.011 37172580 46. Peng K. Liu Y. Liu S. Wang Z. Zhang H. He W. Jin Y. Wang L. Xia X. Xia L. Targeting Mek/Cox-2 Axis Improve Immunotherapy Efficacy in Dmmr Colorectal Cancer with Pik3ca Overexpression Cell. Oncol. 2024 47 1043 1058 10.1007/s13402-024-00916-y 38315285 47. Zhang A. Zou X. Yang S. Yang H. Ma Z. Li J. Effect of Nets/Cox-2 Pathway on Immune Microenvironment and Metastasis in Gastric Cancer Front. Immunol. 2023 14 1177604 10.3389/fimmu.2023.1177604 37153547 PMC10156975 48. Yu B. Wang Y. Bing T. Tang Y. Huang J. Xiao H. Liu C. Yu Y. Platinum Prodrug Nanoparticles with Cox-2 Inhibition Amplify Pyroptosis for Enhanced Chemotherapy and Immune Activation of Pancreatic Cancer Adv. Mater. 2024 36 e2310456 10.1002/adma.202310456 38092007 49. Zhang P. Zhong D. Yu Y. Wang L. Li Y. Liang Y. Shi Y. Duan M. Li B. Niu H. Integration of Sting Activation and Cox-2 Inhibition Via Steric-Hindrance Effect Tuned Nanoreactors for Cancer Chemoimmunotherapy Biomaterials 2024 311 122695 10.1016/j.biomaterials.2024.122695 38954960 Figure 1 The upregulation of SMIM25 A B SMIM25 C SMIM25 D SMIM25 E SMIM25 F G H SMIM25 p p p p Figure 2 Transcriptome profiling elucidates the link between SMIM25 A SMIM25 B SMIM25 C SMIM25 D SMIM25 E SMIM25 F SMIM25 p p p Figure 3 Activation of Extracellular Matrix(ECM) pathways in the high expression of SMIM25 A SMIM25 B SMIM25 C SMIM25 D E SMIM25 F SMIM25 p p p Figure 4 SMIM25 A D α-SMA Collagen_1 COL5A1 CD4 CD8 CD68 SMIM25 E CD4 CD8 SMIM25 F SMIM25 collagen_1 CD4 CD8 CD68 PD-L1 G CD4 CD68 SMIM25 p p p Figure 5 Single-cell Mass Cytometry analysis elucidates the immunosuppressive microenvironment prevalent in the high expression of SMIM25 A SMIM25 B C SMIM25 D SMIM25 E SMIM25 F SMIM25 G p p p Figure 6 SMIM25 COX-2 A SMIM25 B SMIM25 SMIM25 C SMIM25 D SMIM25 E COX-2 SMIM25 F G COX-2 SMIM25 COX-2 H J H I J SMIM25 COX-2 p p p p Figure 7 SMIM25 COX-2 A C SMIM25 A B C D SMIM25 E SMIM25 F COX-2 G SMIM25 COX-2 H SMIM25 COX-2 I SMIM25 p ",
  "metadata": {
    "Title of this paper": "Integration of Sting Activation and Cox-2 Inhibition Via Steric-Hindrance Effect Tuned Nanoreactors for Cancer Chemoimmunotherapy",
    "Journal it was published in:": "Current Issues in Molecular Biology",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12468620/"
  }
}