{
  "title": "Paper_182",
  "abstract": "pmc Cureus Cureus 2757 cureus Cureus 2168-8184 Cureus Inc. PMC12494460 PMC12494460.1 12494460 12494460 10.7759/cureus.91558 1 Obstetrics/Gynecology Predictors of Spontaneous Preterm Birth Among Pregnant Women With a History of Cervical Conization Muacevic Alexander Adler John R Yamada Takuma 1 Takahashi Naruhiko 1 Yamamoto Ryo 1 Hayashi Shusaku 2  1  2 Shusaku Hayashi hayashis@wch.opho.jp 3 9 2025 9 2025 17 9 495976 e91558 3 9 2025 03 09 2025 04 10 2025 04 10 2025 Copyright © 2025, Yamada et al. 2025 Yamada et al. https://creativecommons.org/licenses/by/4.0/ This is an open access article distributed under the terms of the Creative Commons Attribution License CC-BY 4.0., which permits unrestricted use, distribution, and reproduction in any medium, provided the original author and source are credited. This article is available from https://cureus.com/articles/392799-predictors-of-spontaneous-preterm-birth-among-pregnant-women-with-a-history-of-cervical-conization Objective To explore the predictors of spontaneous preterm birth (PTB) among pregnant women with a history of cervical conization. Methods This retrospective cohort study included pregnant women with a history of conization who visited a tertiary perinatal center before 20 weeks of gestation between 2013 and 2022. Exclusion criteria were cerclage before 24 weeks of gestation, premature rupture of membranes or delivery before 24 weeks of gestation, multiple pregnancies, fetal death, and major fetal anomalies. Multivariate logistic regression analysis was performed to examine the associations between spontaneous PTB before 37 weeks of gestation and variables, including previous spontaneous PTB or second-trimester loss, in vitro fertilization (IVF), pre-pregnancy body mass index, current smoking status, and mid-trimester cervical length (CL). The spontaneous PTB rates among groups stratified by independent predictors were calculated. Results The final analysis included 119 women. Of these, 16 (13.4%) had spontaneous PTB. Multivariate logistic regression analysis revealed that IVF [adjusted odds ratio (OR) = 4.5; 95% confidence interval (CI): 1.2-15.9; p = 0.021] and CL (adjusted OR per 1 mm increment = 0.88; 95% CI: 0.82-0.94; p < 0.001) were significant predictors of spontaneous PTB. The incidence of spontaneous PTB in women who conceived by IVF and/or had a shortened CL<25 mm was 31.1% (14/45), whereas women who did not undergo IVF or had a shortened CL had a lower incidence of 2.7% (2/74). Conclusion Conception by IVF and a shortened CL are significant predictors of spontaneous PTB in women with a history of conization. cervical conization cervical length measurement high-risk pregnancy in vitro fertilization spontaneous preterm birth pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement no pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes Introduction A history of cervical conization is associated with preterm birth (PTB). According to a meta-analysis that included 53 observational studies, the incidence of PTB was 11.2% among pregnant women who underwent excisional treatment for cervical intraepithelial neoplasia before pregnancy, with a relative risk of 1.87 [95% confidence interval (CI): 1.64-2.12] compared with non-treated women [ 1 2 Screening of a short cervix using transvaginal ultrasonography in the mid-trimester has been shown to be an effective predictive method for PTB in both low and high-risk populations [ 3 4 5 4 6 7 Predictors of PTB in women with a history of cervical conization have not been extensively investigated, except for some surgical variables and mid-trimester CL [ 1 8 Materials and methods This retrospective cohort study included pregnant women with a history of cervical conization who visited before 20 weeks of gestation and gave birth at Osaka Women’s and Children’s Hospital, a tertiary perinatal center in Japan, between January 2013 and December 2022. The exclusion criteria were cerclage before 24 weeks of gestation, premature rupture of membranes (PROM) or delivery before 24 weeks of gestation, multiple pregnancies, fetal death, and major fetal anomalies. The clinical data of the study participants were extracted from their electronic medical records. This study was approved by the Institutional Review Board of Osaka Women’s and Children’s Hospital (approval number 1549-2, date: January 20, 2023). The requirement for informed consent was waived because of the retrospective nature of this study. At our hospital, prenatal management for pregnant women with a history of cervical conization is the same as that for women without such a history. Gestational age was primarily determined by early ultrasound [first-trimester crown-rump length (CRL)]. In cases where the last menstrual period (LMP) and CRL-based gestational age were in close agreement, LMP was used to confirm the estimated due date. The CL is measured at approximately 22 weeks of gestation in women without previous spontaneous PTB. Follow-up measurements were performed at the discretion of the physicians. Women with previous spontaneous PTB underwent fortnightly CL screening between 16 and 23 weeks of gestation. All CL measurements were performed by experienced obstetricians using transvaginal ultrasonography in a standard manner [ 9 The primary outcome was spontaneous PTB, followed by preterm labor or PROM before 37 weeks of gestation. The characteristics of the women, pregnancy course, and perinatal outcomes were compared between the two groups (spontaneous PTB vs. other births) using the Pearson chi-square or Fisher’s exact test for categorical variables and the Mann-Whitney U test for continuous variables. There were no missing data in this study; therefore, no imputation or case exclusion was necessary. Univariate logistic regression analyses were performed to examine the associations between the primary outcome and predictor variables, including obstetric history (previous second-trimester loss or spontaneous PTB), method of conception, body mass index before pregnancy, current smoking status, and CL. A multivariate prediction model was constructed using the backward selection procedure, initially considering variables with a univariate p-value<0.20. The study participants were stratified into groups according to independent predictors, and the incidence of spontaneous PTB in each group was calculated. Statistical significance was set at p<0.05. Statistical analyses were performed using SPSS 21.0 (IBM Corp., Armonk, NY, USA). Because the objective of this study was exploratory, the sample size was not predetermined. Results We identified 164 pregnant women with a history of cervical conization during the study period. After exclusion (13 women underwent cerclage before 24 weeks of gestation, 7 women experienced PROM or delivered before 24 weeks of gestation, 17 women had multiple pregnancies, and 8 women had major fetal anomalies), 119 women were eligible for the analysis. Of these, 21(17.6%) had PTB before 37 weeks of gestation, 16 (13.4%) had spontaneous PTB, and 5 (4.2%) had medically indicated PTB. Spontaneous PTB before 34 weeks of gestation occurred in seven women (5.9%). The baseline characteristics and pregnancy course of all study participants are shown in Table 1 Table 1 Characteristics of pregnant women with a history of cervical conization Values are presented as n (%) or median (interquartile range). BMI: body mass index; PTB: preterm birth; CL: cervical length; IVF: in vitro fertilization.   Pregnancy outcome    Characteristics Total (n=119) Spontaneous PTB (n=16) Other births (n=103) Statistical method Test statistic p-value Maternal age, years 35 (32-38) 35 (33-38) 35 (32-38) Mann-Whitney U U=860.5 0.776 BMI before pregnancy, kg/m 2 20.6 (19.1-22.5) 20.8 (18.1-22.2) 20.6 (19.2-22.5) Mann-Whitney U U=772.5 0.688 -BMI<18.5 kg/ m 2 18 (15.1) 5 (31.3) 13 (12.6) Fisher's exact - 0.067 Multipara 59 (49.6) 8 (50.0) 51 (49.5) Chi-square χ²=0.001 1 Previous second-trimester loss or spontaneous PTB 9 (7.6) 4 (25.0) 5 (4.9) Fisher's exact - 0.019 -Second-trimester loss 1 (0.8) 0 1 (1.0) - - - -Spontaneous PTB 8 (6.7) 4 (25.0) 4 (3.9) - - - IVF 28 (23.5) 8 (50.0) 20 (19.4) Fisher's exact - 0.022 Current smoking status 22 (18.5) 4 (25.0) 18 (17.5) Fisher's exact - 0.493 Mid-trimester CL, mm 32.0 (25.9-38.0) 23.5 (19.4-27.0) 32.7 (28.3-38.3) Mann-Whitney U U=327.0 <0.001 -CL<25 mm 23 (19.3) 8 (50.0) 15 (14.6) Fisher's exact - 0.003 Of the nine women with a history of spontaneous PTB, four received prophylaxis with 17OHP-C. A woman underwent cerclage, as indicated by physical examination, at 24 weeks of gestation. Women who had a spontaneous PTB were more likely to have conceived by IVF and had a prior second-trimester loss, prior spontaneous PTB, and shorter mid-trimester CL than those who did not have a spontaneous PTB. Although not significant, there was a higher rate of being underweight before pregnancy in women with spontaneous PTB. Other variables were similar between outcome groups. In the univariate analysis, obstetric history, conception by IVF, and shortened CL had p-values<0.20. A multiple logistic regression model of the spontaneous PTB was constructed using backward selection using these variables. Method of conception (adjusted OR for IVF: 4.5; 95% CI: 1.2-15.9; p=0.021) and CL (adjusted OR per 1 mm increment: 0.88; 95% CI: 0.82-0.94; p<0.001) remained significant variables (Table 2 Table 2 Univariate and multivariate logistic regression analyses for spontaneous preterm birth *Adjusted for variables with a univariate p-value<0.20. OR: odds ratio; CI, confidence interval; PTB: preterm birth; BMI: body mass index; CL: cervical length; IVF: in vitro fertilization.  Crude OR (95% CI) p-value Adjusted OR* (95% CI) p-value Previous second-trimester loss or spontaneous PTB 6.5 (1.5-27.7) 0.011 4.2 (0.84-20.7) 0.08 BMI before pregnancy per 1 increment 0.93 (0.78-1.11) 0.45 - - IVF 4.2 (1.4-12.4) 0.011 4.5 (1.2-15.9) 0.021 Current smoking status 1.6 (0.46-5.4) 0.47 - - Mid-trimester CL per 1 mm increment 0.89 (0.83-0.95) <0.001 0.88 (0.82-0.94) <0.001 The study participants were divided into four groups according to two independent predictors of spontaneous PTB: method of conception and CL, with a threshold of 25 mm. The spontaneous PTB rates were 33.3% (2/6), 35.3% (6/17), 27.3% (6/22), and 2.7% (2/74) in IVF-conceived women with shortened CL, naturally conceived women with shortened CL, IVF-conceived women with normal CL, and naturally conceived women with normal CL, respectively (Figure 1 Figure 1 Rates of spontaneous preterm birth according to the independent predictors in 119 women with prior conization CL: cervical length; IVF: in vitro fertilization. When combining groups with either of the predictive factors, the incidence of spontaneous PTB was 31.1% (14/45). The sensitivity and specificity of the shortened CL alone were 50.0% and 85.4%, respectively. Assuming that either IVF or shortened CL was positive, the sensitivity and specificity were 87.5% and 69.9%, respectively. Discussion In the present study, we found two independent predictors of spontaneous PTB among pregnant women with prior cervical conization: the method of conception and mid-trimester CL. The incidence of spontaneous PTB in women with a history of conization who conceived by IVF and/or had a shortened CL was approximately 30%, whereas those without IVF or shortened CL had a lower incidence of 3%. The majority of previous studies on the predictors of PTB in pregnant women with prior cervical conization have focused on the surgical method, surgical specimen depth, and CL [ 5 8 8 10 3 5 5 3 4 6 11 4 6 A multivariate model, combined with other clinical variables, improved the predictive accuracy of CL for spontaneous PTB in the general obstetric population. Pils et al. assessed the association between CL values obtained by sequential transvaginal ultrasonography and other clinical variables and PTB before 34 weeks of gestation in women with prior cervical conization [ 12 Conception by IVF is a known determinant of PTB in the general obstetric population. According to a meta-analysis, singleton pregnancies after IVF are associated with a higher risk of PTB than spontaneous conception (risk ratio 1.54, 95% CI: 1.47-1.62) [ 13 14 15 Our finding that conception by IVF and a shortened CL are independent predictors of spontaneous PTB in women with prior conization has clinical implications. The use of these two predictors may facilitate better risk stratification than the use of CL alone. Women who did not undergo IVF or without a shortened CL may not require further surveillance or intervention unless they are symptomatic. Women who underwent IVF or with a shortened CL may be considered to be at high risk for spontaneous PTB. Obstetricians should consider prescribing progesterone or offering cerclage placement to women with shortened CL. Although no preventative interventions targeting women who conceived by IVF have been established, patient education for those women on the avoidance of risk-increasing lifestyle habits and early symptoms of spontaneous PTB may be worth recommending. Future investigations are warranted to establish effective interventions to prevent spontaneous PTB in these women. Our study had several limitations. First, the sample size was limited because this was a retrospective, single-center study. Large-scale multicenter studies would allow researchers to draw more robust conclusions regarding the predictors of spontaneous PTB in pregnant women with prior conization. Second, detailed information on the surgical procedure was not available; therefore, we could not include the methods of conization and excisional depth in the analysis. Third, the generalizability of our findings may be limited, as the study population consisted exclusively of Japanese women with a relatively low mean BMI compared to international populations [ 16 17 18 Conclusions We found that conception by IVF and a shortened mid-trimester CL are significant predictors of spontaneous PTB among pregnant women with prior cervical conization. Risk stratification using these predictors may improve the sensitivity of the spontaneous PTB prediction. Further research is needed to validate our findings and develop preventative therapies for at-risk women with a non-shortened CL. Disclosures Human subjects: Animal subjects: Conflicts of interest: Payment/services info: Financial relationships: Other relationships: Author Contributions Concept and design: Acquisition, analysis, or interpretation of data: Drafting of the manuscript: Critical review of the manuscript for important intellectual content: References 1 Obstetric outcomes after conservative treatment for cervical intraepithelial lesions and early invasive disease Cochrane Database Syst Rev Kyrgiou M Athanasiou A Kalliala IE 0 11 2017 10.1002/14651858.CD012847 PMC6486192 29095502 2 Risk of preterm birth after the excisional surgery for cervical lesions: a propensity-score matching study in Japan J Matern Fetal Neonatal Med Miyakoshi K Itakura A Abe T 845 851 34 2021 31092078 10.1080/14767058.2019.1619687 3 The association between cervical excisional procedures, midtrimester cervical length, and preterm birth Am J Obstet Gynecol Miller ES Grobman WA 242 244 211 2014 10.1016/j.ajog.2014.03.004 24607751 4 Preterm birth prevention post-conization: a model of cervical length screening with targeted cerclage PLoS One Kindinger LM Kyrgiou M MacIntyre DA 0 11 2016 10.1371/journal.pone.0163793 PMC5094773 27812088 5 Prior cone biopsy: prediction of preterm birth by cervical ultrasound Am J Obstet Gynecol Berghella V Pereira L Gariepy A Simonazzi G 1393 1397 191 2004 15507971 10.1016/j.ajog.2004.06.087 6 Outcome of pregnancy after laser conization: implications for infection as a causal link with preterm birth J Obstet Gynaecol Res Masamoto H Nagai Y Inamine M 838 842 34 2008 18834343 10.1111/j.1447-0756.2008.00852.x 7 Cervical length and obstetric history predict spontaneous preterm birth: development and validation of a model to provide individualized risk assessment Ultrasound Obstet Gynecol Celik E To M Gajewska K Smith GC Nicolaides KH 549 554 31 2008 18432605 10.1002/uog.5333 8 Adverse obstetric outcomes after local treatment for cervical preinvasive and early invasive disease according to cone depth: systematic review and meta-analysis BMJ Kyrgiou M Athanasiou A Paraskevaidi M 0 354 2016 10.1136/bmj.i3633 PMC4964801 27469988 9 ISUOG Practice Guidelines: role of ultrasound in the prediction of spontaneous preterm birth Ultrasound Obstet Gynecol Coutinho CM Sotiriadis A Odibo A 435 456 60 2022 35904371 10.1002/uog.26020 10 Comparative effectiveness and risk of preterm birth of local treatments for cervical intraepithelial neoplasia and stage IA1 cervical cancer: a systematic review and network meta-analysis Lancet Oncol Athanasiou A Veroniki AA Efthimiou O 1097 1108 23 2022 35835138 10.1016/S1470-2045(22)00334-5 PMC9630146 11 Transvaginal ultrasonography in the prediction of preterm birth after treatment for cervical intraepithelial neoplasia Obstet Gynecol Crane JM Delaney T Hutchens D 37 44 107 2006 16394037 10.1097/01.AOG.0000192169.44775.76 12 Sequential cervical length screening in pregnancies after loop excision of the transformation zone conisation: a retrospective analysis BJOG Pils S Eppel W Seemann R Natter C Ott J 457 462 121 2014 24148580 10.1111/1471-0528.12390 13 Obstetric and perinatal outcomes in singleton pregnancies resulting from IVF/ICSI: a systematic review and meta-analysis Hum Reprod Update Pandey S Shetty A Hamilton M Bhattacharya S Maheshwari A 485 503 18 2012 22611174 10.1093/humupd/dms018 14 Treatment for cervical intraepithelial neoplasia and subsequent IVF deliveries Hum Reprod Jakobsson M Gissler M Tiitinen A Paavonen J Tapper AM 2252 2255 23 2008 18635529 10.1093/humrep/den271 15 Cervical conization doubles the risk of preterm and very preterm birth in assisted reproductive technology twin pregnancies Hum Reprod Pinborg A Ortoft G Loft A Rasmussen SC Ingerslev HJ 197 204 30 2015 25358346 10.1093/humrep/deu260 16 Preconception and early-pregnancy body mass index in women and men, time to pregnancy, and risk of miscarriage JAMA Netw Open Boxem AJ Blaauwendraad SM Mulders AG 0 7 2024 10.1001/jamanetworkopen.2024.36157 PMC11413718 39298166 17 Time from cervical conization to pregnancy and preterm birth Obstet Gynecol Himes KP Simhan HN 314 319 109 2007 17267830 10.1097/01.AOG.0000251497.55065.74 18 Early clindamycin for bacterial vaginosis in pregnancy (PREMEVA): a multicentre, double-blind, randomised controlled trial Lancet Subtil D Brabant G Tilloy E 2127 2179 17 2018 10.1016/S0140-6736(18)31617-9 30322724 ",
  "metadata": {
    "Title of this paper": "Early clindamycin for bacterial vaginosis in pregnancy (PREMEVA): a multicentre, double-blind, randomised controlled trial",
    "Journal it was published in:": "Cureus",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12494460/"
  }
}