{
  "title": "Paper_497",
  "abstract": "pmc Biochem Biophys Rep Biochem Biophys Rep 3295 bbpr Biochemistry and Biophysics Reports 2405-5808 Elsevier PMC12477846 PMC12477846.1 12477846 12477846 41030787 10.1016/j.bbrep.2025.102254 S2405-5808(25)00341-3 102254 1 Research Article VH032 suppresses glioma proliferation by inhibiting the VHL/HIF-1α/VEGF pathway Zhang Yi a Zhu Xin-yu a Gu Jia-rong b Wang Peng a Wen Yu-jun a Hou Shao-zhang a Yang Jing-yu c Gu Jin-hai 20080033@nxmu.edu.cn a ⁎ a b c ⁎ 20080033@nxmu.edu.cn 12 2025 18 9 2025 44 495892 102254 4 4 2025 2 9 2025 5 9 2025 18 09 2025 30 09 2025 01 10 2025 © 2025 The Authors. Published by Elsevier B.V. 2025 https://creativecommons.org/licenses/by/4.0/ This is an open access article under the CC BY license (http://creativecommons.org/licenses/by/4.0/). Purpose VH032 is a VHL ligand employed for the recruitment of the von Hippel-Lindau (VHL) protein. Recent studies reveal VHL exhibits significant antitumour effects on various tumor cells. Nevertheless, VH032's impacts on glioma cells remain largely unexplored. Methods The study explored VH032's impact on glioma cell lines U87MG and U251 through a series of experimental assessments. The experiments included cell viability assays, wound healing assays and transwell assays. The apoptotic activity of VH032 was determined via flow cytometry. Finally, a xenograft tumor model composed of nude mice was used to confirm the results. Results In vitro, the CCK-8 assay indicated that VH032 potently inhibited the proliferation of glioma cells. Wound healing and transwell assays further revealed that the drug significantly impaired glioma cell migration and invasion. Flow cytometry analysis demonstrated an increased rate of apoptosis in the drug-treated cell population. Moreover, the inhibitory effect on the VHL/HIF-1α/VEGF signaling pathway was confirmed, supporting its role in reducing tumour growth. The xenograft mouse study confirmed that VH032 markedly inhibited tumour growth. Conclusion These findings suggest that VH032 is a novel and promising chemotherapeutic agent for gliomas, acting through the interference of the VHL/HIF-1α/VEGF signaling pathway to suppress migration and invasion of glioma cells. Highlights • VH032 represents a promising therapeutic candidate for the treatment of glioma, particularly refractory GBM. • It exerts potent antitumor effects by inhibiting tumor cell proliferation, migration, and invasion through suppression of the VHL/HIF-1α/VEGF signaling pathway, while also inducing apoptosis and G2/M phase cell cycle arrest. • In vivo studies have demonstrated its efficacy in significantly suppressing tumor growth, highlighting its potential for clinical translation. Keywords VH032 Glioma Apoptosis Proliferation VHL HIF-1α VEGF pathway pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement yes pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes 1 Introduction Gliomas are tumors that arise from glial cells of the brain, including astrocytes, oligodendrocytes, and ependymal cells [ 1 2 3 4 5 6 7 8 9 10 Von Hippel-Lindau (VHL) is an E3 ligase that functions primarily as a tumor suppressor gene and plays a crucial role in cancer prevention [ 11 12 13 14 15 16 17 Therefore, the objective of this study was to systematically investigate the in vitro and in vivo anti-tumor effects of VH032 on glioma cell lines, specifically U87MG and U251, and to elucidate the potential underlying mechanisms. 2 Methods 2.1 Reagents VH032 (99.64 % purity) was purchased from MedChemExpress (USA) for this study. It was carefully handled and suspended in dimethyl sulfoxide (DMSO), then diluted with complete cell culture medium so that the final DMSO concentration did not exceed 0.1 %, thereby minimizing side effects. Dulbecco's modified Eagle's medium (DMEM), phosphate-buffered saline (PBS), and fetal bovine serum (FBS) were purchased from Thermo Fisher (Waltham, MA, USA). A Cell Counting Kit-8 (CCK-8) was purchased from MedChemExpress. Penicillin/streptomycin (100 × ) was purchased from Beijing Solarbio Science & Technology Co., Ltd. (Beijing, China). The BCA Protein Assay Kit, Annexin V-FITC Apoptosis Detection Kit, and Cell Cycle and Apoptosis Analysis Kit were purchased from Jiangsu KeyGEN BioTECH Co., Ltd. (Jiangsu, China). Tris-buffered saline with Tween-20 (TBS-T) was purchased from Wuhan Servicebio Technology Co., Ltd. (Wuhan, China). Primary antibodies against VHL, VEGF, and HIF-1 alpha were purchased from Proteintech Group, Inc. (Wuhan, China). Primary antibodies against Tubulin beta, as well as secondary antibodies (goat anti-rabbit IgG and goat anti-mouse IgG), were purchased from Affinity Biosciences Ltd (Jiangsu, China). The experimental instruments used included a cell incubator (Thermo Fisher Scientific), an inverted microscope (Olympus Company, Japan), and a freezing centrifuge (ST16R, Thermo). 2.2 Cell lines and cell culture Human U87MG and U251GBM cell lines were cultured in the Key Laboratory of Cranial Diseases, Ningxia Medical University. Both cell lines were cultured in DMEM supplemented with 10 % FBS and 1 % antibiotics: streptomycin and penicillin under a 5 % CO 2 2.3 Cell viability analysis Cells were plated at 8 × 10 3 2.4 Wound healing assays Following a seed of U87MG and U251 cell types onto 6-well plates with an 80–90 % confluence of growth. Scraping the surface of the plate vertically with the tip of a 200 μL sterile pipette gun produces a cell wound of similar width. After taking out of the previous medium, fresh serum-free medium with the indicated concentration of VH032 was added. Scratched area images in each group were captured with an inverted microscope at 0 and 24 h. Area quantification of the wounds healing was determined with the aid of ImageJ software. 2.5 Cell invasion assays A mixture of Matrigel matrix and pre-cooled serum-free medium (1:8) was uniformly applied to the surface of the upper chamber of the transwell and incubated overnight. Subsequently, 1 × 10 4 2.6 Cell cycle analysis After 24 h of treatment with VH032, U87MG and U251 cells were harvested and fixed in 70 % pre-cooled ethanol at −20 °C for at least 24 h. The cells were then stained with propidium iodide (PI) and RNase for 20 min before being analysed by flow cytometry. 2.7 Annexin V-FITC/PI double staining assay An Annexin V-FITC/PI Apoptosis Detection Kit was used to find the effect of VH032 against apoptosis in the cells of the human glioma. Cells U87MG and U251 were inoculated in 6-well plates at a density of 4 × 10 5 2.8 Western blotting analysis Proteins of U87MG and U251 cells were treated with VH032 for 24 h and then extracted and quantified by the BCA Protein Assay Kit. Equal quantities of protein (40 μg per lane) were resolved on 8–10 % SDS-PAGE gels and transferred to PVDF membranes in a Bio-Rad wet transfer system (Bio-Rad, USA). Afterward, the membranes were blocked with 5 % skim milk powder for 1 h and then further incubated overnight at 4 °C with the appropriate primary antibodies. Thereafter, membranes were incubated with their corresponding secondary antibodies at room temperature for 1.5 h. After washing, the film was exposed, imaged with a gel imaging system, and the grayscale values were measured. 2.9 Xenograft tumor model BALB/c female nude mice, aged 5–6 weeks and weighing 18–20 g, were selected for the experiment and purchased from GemPharmatech Co., Ltd. in Jiangsu, China. The animal housing and tumor-bearing model construction were conducted in an SPF barrier environment at the Experimental Animal Center of Ningxia Medical University. In a sterile condition, each nude mouse was subcutaneously inoculated with 100 μL of U87MG cell suspension containing 1 × 10 7 Every three days, the mice were weighed, along with the longest (L) and shortest (S) tumor measurements. According to the tumor volume equation, volume = 0.5 × L × S 2 The experimental method was approved by the Animal Care and Use Committee of Ningxia Medical University (Approval No. IACUC-NYLAC-2024-097). All efforts were made to minimize pain and reduce the number of animals used in the research. 2.10 Statistical analysis All the experiments' results were drawn from three or more tests done using GraphPad Prism 9.5.1 (GraphPad Software, Inc., La Jolla, CA, USA). Continuous variable data were represented as means ± standard deviations (SDs). The t 3 Results 3.1 VH032 suppressed glioma cell proliferation The effect of VH032 on glioma cell proliferation was examined by treating the cells with varying concentrations of the compound. The results of the CCK-8 assay indicated that as the concentration of VH032 increased within a specific range, the viability of glioma cells decreased in a dose-dependent manner ( Fig. 1 Fig. 1 VH032 inhibits the proliferation of glioma cells. a. The viability of U87MG and U251 glioma cells at various concentrations of VH032 was assessed via the CCK-8 assay. b Fig. 1 Furthermore, we verified the drug's effect by conducting a CCK-8 cytotoxicity test using VH032 with the measured IC50 concentration, which demonstrated that both glioblastoma U87MG and U251 cells exhibited significant inhibition of proliferation following drug treatment. Notably, this inhibitory effect was observed relatively quickly, beginning approximately 12 h posttreatment, and exhibited a time-dependent nature ( Fig. 1 3.2 VH032 inhibited glioma cell migration and invasion This study investigates VH032's impact on glioma cell migration and invasion through wound healing and transwell assays. The results indicated that VH032 could effectively inhibit wound healing ( Fig. 2 Fig. 2 Fig. 2 VH032 inhibits the migration and invasion of glioma cells. a. VH032 inhibits the migration of glioma cells in wound healing assay. The migratory capacity of U87MG (treated with 59.2 μM VH032) and U251 (treated with 85.07 μM VH032) cells was evaluated at 0 h and 24 h. b. Transwell assesses were performed using U87MG (59.2 μM VH032) and U251 (85.07 μM VH032) to evaluate the effect of VH032 on glioma cell invasion. Fig. 2 3.3 VH032 caused apoptosis in glioma cells The process of apoptosis, which refers to programmed cell death, plays a crucial role; evasion of this mechanism allows tumor cells to proliferate indefinitely [ 18 Fig. 3 Fig. 3a VH032 induced the apoptosis of glioma cells. Flow cytometry analysis of apoptotic U87MG (59.2 μM VH032) and U251 (85.07 μM VH032) cells via Annexin V-FITC/PI staining after 24 h of treatment. The effect of VH032 on the apoptosis of glioma cells was significantly increased. Fig. 3a 3.4 VH032 induced G2/M phase cell cycle arrest in glioma cells Flow cytometry is capable of quantifying the DNA content within cells and analysing its distribution across various phases of the mitotic cycle. The data and statistical data indicate that following 24 h of treatment with VH032 (59.2 μM for U87MG and 85.07 μM for U251), there was a notable alteration in the proportion of U87 MG and U251 cells at each phase, with a significant increase in those arrested at the G2/M stage. These findings suggest that VH032 effectively induces G2/M phase arrest in U87 MG and U251 cells ( Fig. 3 Fig. 3b VH032 induced G2/M cell cycle arrest in glioma cells. Flow cytometry analysis of cell cycle distribution in U87MG (59.2 μM VH032) and U251 (85.07 μM VH032) cells after 24 h of treatment, and the proportion of cells in the G2/M phase increased significantly. Fig. 3b 3.4.1 VH032 inhibited the VHL/HIF-1α/VEGF signaling pathway in glioma cells The above results demonstrated that VH032 has a significant regulatory effect on tumor migration, invasion and apoptosis. To gain a deeper understanding of the molecular mechanisms at play, we conducted a western blotting analysis. The findings indicated that VH032 (59.2 μM for U87MG and 85.07 μM for U251) had a significant effect in lowering the total protein levels of VHL, HIF-1α, and VEGF ( Fig. 4 Fig. 4 VH032 affects cell viability, migration, invasion and apoptosis by inhibiting the VHL/HIF-1α/VEGF signalling pathway. Western blotting analysis of VHL, HIF-1α, and VEGF protein levels in U87MG (59.2 μM VH032) and U251 (85.07 μM VH032) cells after 24 h of treatment. Fig. 4 3.5 VH032 inhibited glioma cell proliferation in vivo Throughout the experiment, all the nude mice showed healthy growth, with no signs of infection, weight loss, adverse reactions, or death. Over the course of the experiment, the tumor volume in the nude mice increased progressively. The tumors in the control group were significantly larger than those in the VH032-treated group (7.5 mg/kg, daily intraperitoneal injection for 21 days); in particular, the VH032 group showed a marked decrease in both the average tumor volume and weight ( Fig. 5 Fig. 5 VH032 inhibited tumor growth in xenografted mice. Tumor extraction and imaging were performed in control mice and VH032-treated mice. After 21 days of treatment with VH032, the mean volume and weight of the glioma grafts were decreased. Fig. 5 4 Discussion The intention of the study was, in particular, to ascertain the effect that VH032 has against the glioblastoma (GBM) development and the proposed cellular mechanisms involved. The data provided reveal that VH032 inhibits the growth of tumors through interference with the VHL, HIF-1α, and VEGF signaling pathways. Brain tumors are characterized by high incidence and mortality owing to their localized and locally invasive growth, with gliomas being the most common primary brain tumors [ 19 20 Recent studies have shown that VHL exhibits antitumour effects in various types of malignancies [ 21 First, the results of the CCK-8 assay indicated that an increase in the VH032 concentration within a specific range led to a decrease in the viability of glioma cells as the dose increased. The efficacy of the drug was further corroborated through CCK-8 cell cytotoxicity experiments, which demonstrated significant inhibition of cell proliferation in U87MG and U251 glioblastoma cells following drug treatment. Additionally, the viability of glioma cells decreased over time. Secondly, the wound healing and transwell assays confirmed the effects of VH032 on cell migration and invasion. The processes of migration and invasion in malignant tumor cells are intricate and multifaceted [ 22 23 Additionally, recent studies demonstrated that activation of the VHL/HIF-1α/VEGF pathway relates with tumor cell occurrence, growth, prognosis, and drug resistance [ [24] [25] [26] [27] ] 28 29 [30] [31] [32] 5 Conclusions The results of the present study revealed that VH032 plays a crucial role in antitumour effects on glioma cells in vitro by inhibiting the VHL/HIF-1α/VEGF signalling pathway and interfering with the proliferation, invasion, migration, apoptosis and cycle distribution of glioma cells. Taken together, these findings provide evidence that VH032 is a potential therapeutic agent for glioma. CRediT authorship contribution statement Yi Zhang: Xin-yu Zhu: Jia-rong Gu: Peng Wang: Yu-jun Wen: Shao-zhang Hou: Jing-yu Yang: Jin-hai Gu: Ethics approval and consent to participate Approval of the research protocol by an institutional review board: The research protocol was approved by the Institutional Review Board of Ningxia Medical University(Approval no. IACUC-NYLAC-2024-097). Animal Studies: All animal procedures and experimental methods were approved by the Medical Ethics Committee of Ningxia Medical University. Clinical trial number Not applicable. Data availability The data used to support the findings of this study are included within the article. Funding The author(s) disclosed receipt of the following financial support for research, authorship, and/or publication of this article: This work was supported by the 10.13039/501100004772 Natural Science Foundation of Ningxia 2022AAC03357 2020AAC03152 2021AAC03121 10.13039/501100001809 National Natural Science Foundation of China 82260269 Declaration of competing interest The authors declare that they have no competing interests. References 1 Levin V.A. Are gliomas preventable?[J]. Recent results Cancer Res. 174 2007 205 215 10.1007/978-3-540-37696-5_18 17302198 2 Thakkar J.P. Dolecek T.A. Horbinski C. Epidemiologic and molecular prognostic review of glioblastoma Cancer Epidemiol. Biomarkers Prev. 23 10 2014 1985 1996 25053711 10.1158/1055-9965.EPI-14-0275 PMC4185005 3 Liu C. Chang C. Hsueh K. Migration/invasion of malignant gliomas and implications for therapeutic treatment Int. J. Mol. Sci. 19 4 2018 1115 29642503 10.3390/ijms19041115 PMC5979613 4 Ramezani S. Vousooghi N. Joghataei M.T. The role of kinase signaling in resistance to bevacizumab therapy for glioblastoma multiforme Cancer Biother. Rad. 34 6 2019 345 354 10.1089/cbr.2018.2651 31411929 5 Linkous A. Balamatsias D. Snuderl M. Modeling patient-derived glioblastoma with cerebral organoids Cell Rep. 26 12 2019 3203 3211 30893594 10.1016/j.celrep.2019.02.063 PMC6625753 6 Chen P. Lu Y. He B. Rab32 promotes glioblastoma migration and invasion via regulation of ERK/Drp1-mediated mitochondrial fission Cell Death Dis. 14 3 2023 198 36922509 10.1038/s41419-023-05721-3 PMC10017813 7 Wu W. Klockow J.L. Zhang M. Glioblastoma multiforme (GBM): an overview of current therapies and mechanisms of resistance Pharmacol. Res. 171 2021 105780 10.1016/j.phrs.2021.105780 PMC8384724 34302977 8 Kumari S. Gupta R. Ambasta R.K. Multiple therapeutic approaches of glioblastoma multiforme: from terminal to therapy Biochim. Biophys. Acta Rev. Canc 1878 4 2023 188913 10.1016/j.bbcan.2023.188913 37182666 9 Bouche M. Dong Y.C. Sheikh S. Novel treatment for glioblastoma delivered by a radiation responsive and radiopaque hydrogel ACS Biomater. Sci. Eng. 7 7 2021 3209 3220 34160196 10.1021/acsbiomaterials.1c00385 PMC8411482 10 Stylli S.S. Novel treatment strategies for glioblastoma Cancers (Basel) 12 10 2020 10.3390/cancers12102883 PMC7599818 33049911 11 Gossage L. Eisen T. Maher E.R. VHL, the story of a tumour suppressor gene Nat. Rev. Cancer 15 1 2015 55 64 25533676 10.1038/nrc3844 12 Hu J. Tan P. Ishihara M. Tumor heterogeneity in VHL drives metastasis in clear cell renal cell carcinoma Signal Transduct. Targeted Ther. 8 1 2023 155 10.1038/s41392-023-01362-2 PMC10110583 37069149 13 Li C. Hu S. Yue Y. Ultrasound microbubble-mediated VHL regulates the biological behavior of ovarian cancer cells Ultrasound Med. Biol. 47 3 2021 723 732 33261909 10.1016/j.ultrasmedbio.2020.11.001 14 Matloob S.A. Paraskevopoulos D. O'Toole S.M. VHL: trends and insight into a multi-modality, interdisciplinary approach for management of central nervous system hemangioblastoma Acta Neurochir. Suppl. 135 2023 81 88 38153453 10.1007/978-3-031-36084-8_14 15 Peng S. Zhang J. Tan X. The VHL/HIF axis in the development and treatment of pheochromocytoma/paraganglioma Front. Endocrinol. 11 2020 586857 10.3389/fendo.2020.586857 PMC7732471 33329393 16 Lin W. Li Y. Yang L. Development of BODIPY FL VH032 as a High-Affinity and Selective von Hippel-Lindau E3 Ligase Fluorescent Probe and Its Application in a Time-Resolved Fluorescence Resonance Energy-Transfer Assay ACS Omega 6 1 2021 680 695 33458521 10.1021/acsomega.0c05221 PMC7807814 17 Klein V.G. Townsend C.E. Testa A. Understanding and improving the membrane permeability of VH032-Based PROTACs ACS Med. Chem. Lett. 11 9 2020 1732 1738 32939229 10.1021/acsmedchemlett.0c00265 PMC7488288 18 Mohamed M.S. Bishr M.K. Almutairi F.M. Inhibitors of apoptosis: clinical implications in cancer Apoptosis 22 12 2017 1487 1509 29067538 10.1007/s10495-017-1429-4 19 Ostrom Q.T. Cioffi G. Waite K. CBTRUS statistical report: primary brain and other central nervous system tumors diagnosed in the United States in 2014-2018 Neuro Oncol. 23 12 Suppl 2 2021 i1 i105 10.1093/neuonc/noab200 PMC8491279 34608945 20 Stupp R. Taillibert S. Kanner A.A. Maintenance therapy with tumor-treating fields plus temozolomide vs temozolomide alone for glioblastoma: a randomized clinical trial JAMA 314 23 2015 2535 2543 26670971 10.1001/jama.2015.16669 21 Barontini M. Dahia P.L. VHL disease Best Pract. Res. Clin. Endocrinol. Metabol. 24 3 2010 401 413 10.1016/j.beem.2010.01.002 20833332 22 Ridley A.J. Schwartz M.A. Burridge K. Cell migration: integrating signals from front to back Science 302 5651 2003 1704 1709 14657486 10.1126/science.1092053 23 Pistritto G. Trisciuoglio D. Ceci C. Apoptosis as anticancer mechanism: function and dysfunction of its modulators and targeted therapeutic strategies Aging (Albany NY) 8 4 2016 603 619 27019364 10.18632/aging.100934 PMC4925817 24 Mazumder S. Higgins P.J. Samarakoon R. Downstream targets of VHL/HIF-alpha signaling in renal clear cell carcinoma progression: mechanisms and therapeutic relevance Cancers (Basel) 15 4 2023 10.3390/cancers15041316 PMC9953937 36831657 25 Choueiri T.K. Kaelin W.J. Targeting the HIF2-VEGF axis in renal cell carcinoma Nat. Med. 26 10 2020 1519 1530 33020645 10.1038/s41591-020-1093-z 26 Chakraborty C. Mitra S. Roychowdhury A. Deregulation of LIMD1-VHL-HIF-1alpha-VEGF pathway is associated with different stages of cervical cancer Biochem. J. 475 10 2018 1793 1806 29654110 10.1042/BCJ20170649 27 Kim H. Shim B.Y. Lee S.J. Loss of Von Hippel-Lindau (VHL) Tumor Suppressor Gene Function: VHL-HIF Pathway and Advances in Treatments for Metastatic Renal Cell Carcinoma (RCC) Int. J. Mol. Sci. 22 18 2021 10.3390/ijms22189795 PMC8470481 34575959 28 Semenza G.L. Targeting HIF-1 for cancer therapy Nat. Rev. Cancer 3 10 2003 721 732 13130303 10.1038/nrc1187 29 Jing X. Yang F. Shao C. Role of hypoxia in cancer therapy by regulating the tumor microenvironment Mol. Cancer 18 1 2019 157 31711497 10.1186/s12943-019-1089-9 PMC6844052 30 Melincovici C.S. Bosca A.B. Susman S. Vascular endothelial growth factor (VEGF) - key factor in normal and pathological angiogenesis Rom. J. Morphol. Embryol. 59 2 2018 455 467 30173249 31 Patel S.A. Nilsson M.B. Le X. Molecular mechanisms and future implications of VEGF/VEGFR in cancer therapy Clin. Cancer Res. 29 1 2023 30 39 35969170 10.1158/1078-0432.CCR-22-1366 PMC10274152 32 Wang L. Zhang L. Shen W. High expression of VEGF and PI3K in glioma stem cells provides new criteria for the grading of gliomas Exp. Ther. Med. 11 2 2016 571 576 Statements and Declarations 26893649 10.3892/etm.2015.2906 PMC4734098 Appendix A Supplementary data The following is the Supplementary data to this article: Multimedia component 1 Multimedia component 1 Data availability Data will be made available on request. Appendix A Supplementary data to this article can be found online at https://doi.org/10.1016/j.bbrep.2025.102254 ",
  "metadata": {
    "Title of this paper": "High expression of VEGF and PI3K in glioma stem cells provides new criteria for the grading of gliomas",
    "Journal it was published in:": "Biochemistry and Biophysics Reports",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12477846/"
  }
}