{
  "title": "Paper_621",
  "abstract": "pmc Int J Mol Sci Int J Mol Sci 808 ijms ijms International Journal of Molecular Sciences 1422-0067 Multidisciplinary Digital Publishing Institute  (MDPI) PMC12471175 PMC12471175.1 12471175 12471175 41009678 10.3390/ijms26189117 ijms-26-09117 1 Article Apoptosis Inhibitor of Macrophage (AIM) Modulates Calcium Oxalate-Induced Ureteral Fibrosis in AIM-Felinized Mice Machida Yuka Validation Formal analysis Investigation Data curation Writing – original draft Writing – review & editing Visualization 1 Watanabe Masaki Methodology Validation Formal analysis Resources Writing – original draft 2 Suzuki Fumi Validation Formal analysis Investigation Data curation Writing – original draft Visualization 1 https://orcid.org/0009-0001-5076-7184 Ando Ryo Investigation Resources 3 Watanabe Koudai Investigation 1 Moriya Yugo Investigation 1 Maeda Kenichi Resources 1 https://orcid.org/0000-0002-4510-5397 Okano Shozo Resources 1 https://orcid.org/0000-0001-8457-1561 Okamura Tadashi Resources 4 https://orcid.org/0000-0002-5912-5647 Sugisawa Ryoichi Methodology Writing – review & editing Project administration 5 https://orcid.org/0000-0002-7971-3024 Sasaki Nobuya Conceptualization Supervision Project administration Funding acquisition 2 https://orcid.org/0000-0002-6837-3546 Iwai Satomi Conceptualization Methodology Resources Writing – review & editing Supervision Project administration Funding acquisition 1 * Cordaro Marika Academic Editor 1 2 3 4 5 * iwai@vmas.kitasato-u.ac.jp 18 9 2025 9 2025 26 18 497349 9117 08 8 2025 10 9 2025 15 9 2025 18 09 2025 27 09 2025 29 09 2025 © 2025 by the authors. 2025 https://creativecommons.org/licenses/by/4.0/ Licensee MDPI, Basel, Switzerland. This article is an open access article distributed under the terms and conditions of the Creative Commons Attribution (CC BY) license ( https://creativecommons.org/licenses/by/4.0/ Calcium oxalate (CaOx) stones account for 90% of uroliths in cats and contribute to ureteral inflammation and fibrosis, although the underlying mechanism remains unclear. Apoptosis inhibitor of macrophage (AIM) is known to play a protective role against tubular injury in feline kidney disease. This study investigated whether AIM contributes to ureteral fibrosis by using AIM-felinized mice subjected to CaOx bead-induced ureteral injury. Male C57BL/6 mice ( n p feline ureteral obstruction apoptosis inhibitor of macrophage mouse mode This research received no external funding. pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement yes pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes 1. Introduction Ureteral obstruction in cats is increasingly recognized in veterinary medicine [ 1 2 3 4 5 6 7 8 5 9 10 1 2 5 11 Currently, treatment options include surgical reconstruction, such as ureterostomy, ureterectomy with anastomosis, ureteral stenting, and subcutaneous ureteral bypass (SUB) system placement [ 12 13 14 15 7 16 The extent of ureteral damage caused by ureterolithiasis in cats is believed to differ from that in dogs, humans, or mice. In cats, the ureteral diameter is approximately 0.4 mm [ 17 Furthermore, feline tissue healing is more prone to granulation tissue formation and is considered less regenerative than in dogs [ 18 In previous studies, ureteral obstruction models have been created in mice or rats by surgical ligation of the ureter [ 19 20 21 21 In 1999, Toru Miyazaki and colleagues discovered Apoptosis Inhibitor of Macrophage (AIM, also called CD5L) [ 22 23 24 25 26 27 28 29 30 31 32 33 34 27 31 35 36 37 38 39 40 41 32 42 43 44 45 46 47 48 49 50 It has been reported that feline AIM differs from that of humans and mice [ 41 51 33 51 33 51 Moreover, AIM-felinized mice show higher mortality from AKI compared to wild-type mice, whereas administration of recombinant AIM improves both renal function and survival [ 51 2. Results 2.1. Blood Biochemistry Test In terms of blood urea nitrogen (BUN), a marker of kidney function, the values were as follows: fA-C group (29.6 ± 6.84 mg/dL), fA-U group (31.5 ± 7.83 mg/dL), koA-C group (35.4 ± 13.57 mg/dL), koA-U group (33.6 ± 4.88 mg/dL), mA-C group (35.5 ± 9.24 mg/dL), and mA-U group (33.8 ± 3.65 mg/dL). No significant differences were observed among the groups ( Figure 1 Figure 1 2.2. Histopathological Findings Using Hematoxylin and Eosin (HE) stained tissue sections, we evaluated the infiltration of inflammatory cells, the shedding of the transitional epithelium, and vascular dilation. The degree of inflammatory cell infiltration in the renal parenchyma, renal pelvis, and ureter was graded from 0 to 3 ( Figure 2 Figure 3 Figure 4 2.3. Quantification of Fibrosis Using Masson’s Trichrome (MT) stained tissue sections, we quantified fibrosis using Image J. The percentages of fibrotic areas were as follows: fA-C (70.56 ± 2.38%), fA-U (58.42 ± 0.58%), koA-C (61.25 ± 1.00%), koA-U (56.47 ± 0.29%), mA-C (44.36 ± 1.50%), and mA-U (35.94 ± 2.75%). Statistically significant differences ( p p Figure 5 2.4. Immunohistochemistry (IHC) Staining 2.4.1. αSMA (Acta2) Sections stained with a rabbit polyclonal anti-αSMA antibody were imaged, and the proportion of αSMA-positive cells relative to the ureteral area was calculated. The results were as follows: fA-C group (3.53 × 10 −5 −5 −5 −5 −5 −5 p p p Figure 6 2.4.2. AIM (CD5L) Tissue sections stained with rabbit polyclonal anti-CD5L antibody were used to assess the AIM-positive area relative to the CaOx crystal area using ImageJ. The percentages were: fA-C (11.3 ± 4.70%), koA-C (12.71 ± 1.69%), and mA-C (42.60 ± 9.54%). Statistically significant differences ( p p p Figure 7 3. Discussion Most disease models of ureteral obstruction have focused on its impact on the kidneys, while few studies have examined the ureter specifically. Furthermore, existing ureter-focused models have involved external damage such as ligation, and only one previous study has established a model of intraluminal injury [ 21 23 24 25 26 27 34 42 33 51 At necropsy, both CaOx-implanted (C) and unilateral ureteral obstruction (U) groups showed hydronephrosis in the left kidney. No significant differences were observed in blood biochemical tests among the groups, and no marked abnormalities were detected, suggesting, as reported previously [ 52 19 20 Complete or partial obstruction of the ureter, or migration of stones, can cause severe tissue injury to the kidney and ureter [ 20 53 54 21 In our study, histopathological examination revealed epithelial desquamation and immune cell infiltration (neutrophils, macrophages, lymphocytes) around CaOx beads in the fA-C, koA-C, and mA-C groups. Although the koA-C group showed a tendency toward higher infiltration scores in the renal parenchyma, pelvis, and ureter, no clear differences in inflammatory cell infiltration were observed among the AIM variants. In site-specific evaluations, the ureter in the CaOx group had the highest infiltration scores compared to the sham group. This suggests that inflammation in the renal parenchyma and pelvis was primarily induced by UUO, while in the ureter, it was due to direct injury from CaOx beads. These inflammatory responses were not significantly influenced by AIM activity. TGF-β, a pro-fibrotic cytokine produced by macrophages, activates fibroblasts involved in physiological wound repair [ 55 55 To confirm AIM expression in ureteral tissue, IHC staining using rabbit polyclonal anti-AIM antibody was performed. Matsuura et al. confirmed that AIM binds to CaOx crystals [ 42 51 42 However, IHC staining in this study assessed AIM in tissue rather than its direct binding to intraluminal CaOx beads. The CaOx crystals found in the tissue likely resulted from binding of AIM to intraluminal CaOx beads and subsequent phagocytosis via KIM-1 expressing epithelial cells. Therefore, while we cannot confirm AIM activity in urine, the possibility remains that UUO-induced AKI in the left kidney could have led to AIM dissociation from IgM, filtration through the glomerulus, and excretion into the urine. The CaOx beads used in this study need further optimization. They are mechanically weak, disintegrate easily, and often deform when in contact with moisture during implantation. In some cases, this led to bead migration into the renal pelvis. However, this could resemble the clinical scenario of renal pelvic stones and may serve as a dual model for ureteral and renal injury. While glyoxylic acid-induced CaOx crystal formation in the kidney has been used in mice [ 42 In conclusion, this study demonstrates that feline AIM exhibits a distinct phenotype in response to intraluminal ureteral injury compared to mouse AIM. This suggests that AIM plays a role in tissue response to ureterolithiasis, and that feline AIM may contribute to the increased susceptibility to fibrosis observed in cats. Future work using this model will focus on investigating mechanisms and therapies to suppress or prevent fibrosis. This study is the first to demonstrate that feline AIM, characterized by its high affinity for IgM, is associated with increased ureteral fibrosis in response to CaOx-induced injury. These findings provide novel insights into the molecular basis of feline-specific ureteral pathology and fibrosis progression. 4. Materials and Methods 4.1. Test Animals 18 C57BL/6J mice (CLEA Japan, Tokyo, Japan) (body weight: 22.15 ± 0.93 g, 8 weeks old, male), 18 AIM-knockout C57BL/6J mice (University of Tokyo, Tokyo, Japan) (22.91 ± 1.17 g, 8 weeks old, male) and 18 AIM-felinized C57BL/6J mice (University of Tokyo, Tokyo, Japan) (23.52 ± 1.72 g, 8 weeks old, male) were used (total n AIM-Knockout and AIM Felinized C57BL/6J Mice AIM-knockout mice [ 22 Cd5l 51 Cd5l Figure 8 fAIM_f: GAGTGGGGCTCTGTCTGC fAIM_r: TCAAGCATCAGGTAGGGCCAG Figure 8 Identification of the feline AIM gene in AIM-felinized mice. 4.2. Experimental Groups Each mouse genotype (mA, koA, fA) was divided into two groups: CaOx implantation group (C group): left ureter was implanted with CaOx beads ( n n Table 1 4.3. Ureteral Lumen Injury Model 4.3.1. Preparation of a CaOx Beads CaOx monohydrate (FUJIFILM Wako Pure Chemicals Corporation, Osaka, Japan) was dissolved in saline solution (Otsuka Pharmaceutical Co., Ltd., Osaka, Japan) to prepare a 1 g/mL solution. A volume of 5 µL of the solution was aspirated using a micropipette and allowed to dry spontaneously at the pipette tip, forming beads. Each bead weighed 4.2 ± 0.12 µg and had a rough surface with face with a diameter of 1.22 ± 0.88 mm ( Figure 9 4.3.2. Anesthesia Protocol, Analgesic Management Mice were placed in an induction chamber and anesthetized with 3% isoflurane (MSD Animal Health, Tokyo, Japan). After mask application, anesthesia was maintained at 1–2% isofluraine, with respiratory monitoring. Butorphanol tartrate (5 mg/kg) (Vetorufar ® 4.3.3. Ureteral Ligation and Insertion of CaOx Beads The proximal one-third of the left ureter was triple-ligated with 8-0 Prolene TM Figure 10 Figure 9 4.4. Endpoint Criteria As humane endpoints, if (1) appetite was attenuated and (2) body weight was reduced by more than 20%, the animals were deeply anesthetized with isoflurane and then euthanized by cervical dislocation. 4.5. Blood and Biochemical Tests On day 14 post-implantation, approximately 0.4 mL of blood was collected from the posterior vena cava and centrifuged (1700× g 4.6. Histopathological Examination 4.6.1. Tissue Collection and Sectioning Fourteen days after bead implantation, mice were anesthetized using a triple anesthesia protocol: medetomidine hydrochloride (0.75 mg/kg), midazolam (4 mg/kg), and butorphanol tartrate (5 mg/kg). Following anesthesia and exsanguination via the posterior vena cava, both kidneys and ureters were harvested ( Figure 11 4.6.2. Tissue Staining Tissue sections were stained with HE and MT stain after normal histological processing. For MT staining, tissue slides were deparaffinized with xylene and alcohol, immersed in an equal volume mixture of 10% potassium dichromate solution/10% trichloroacetic acid solution for 20 min, and stained with iron hematoxylin for 5 min. The cells were then stained with a mixture of equal volumes of 2.5% phosphotungstic acid solution/2.5% phosphomolybdic acid for 40 s, immersed in 0.75% orange G solution for 1 min, and then in a mixture of Ponceau-Kiridin, fuchsin acid, and azofloxin for 25 min. Finally, after staining with 2.5% phosphotungstic acid solution for 7 min, the connective tissues were stained with aniline blue, and the specimens were then stained with alcohol, dehydrated, and sealed. HE-stained tissue specimens were used to evaluate tissue structure under the microscope. The degree of inflammatory cell infiltration in the kidney, renal pelvis, and ureter was classified as Grade 0–4 ( n Figure 2 56 4.6.3. Fibrosis Quantification Quantification of fibrosis was performed using MT-stained tissue sections. Each subgroup initially included n n n 4.7. IHC Staining 4.7.1. αSMA (Acta2) Paraffin-embedded tissue sections (5 µm thick) were heat-treated at 98 °C for 45 min in a 200-fold diluted antigen retrieval solution (ImmunoSaver, Nissin EM Co., Ltd., Tokyo, Japan) to perform antigen retrieval. Next, the sections were incubated in a mixture of 30% hydrogen peroxide (H 2 2 ® 2 n n n 4.7.2. AIM (CD5L) Immunohistochemistry for AIM was performed following the same protocol as described in Section 4.7.1 2 2 n 4.8. Statistical Analysis All statistical analyses were performed using JMP Pro 17 (SAS Institute, Cary, NC, USA). Normality was assessed using the Shapiro–Wilk test, and homogeneity of variances was evaluated using Levene’s test. Depending on the results, data were analyzed by one-way ANOVA or Kruskal–Wallis test. Post hoc comparisons were performed using Tukey–Kramer or Steel–Dwass tests when significant differences were detected. A p Acknowledgments We are deeply grateful to Toru Miyazaki of The Institute of AIM Medicine for his generous provision of the AIM-felinized mice, which played a critical role in the success of this study. We are also grateful to the staff of the Laboratory of Small Animal Surgery 2, the Laboratory of Laboratory Animal Science, the Laboratory of Veterinary Pathology, and the Kitasato University Veterinary Teaching Hospital for their continuous support and cooperation. Disclaimer/Publisher’s Note: Supplementary Materials The following supporting information can be downloaded at: https://www.mdpi.com/article/10.3390/ijms26189117/s1 Author Contributions Conceptualization, M.W., N.S. and S.I.; data curation, Y.M. (Yuka Machida) and F.S.; formal analysis, Y.M. (Yuka Machida), M.W. and F.S.; funding acquisition, N.S. and S.I.; investigation, Y.M. (Yuka Machida), F.S., R.A., K.W. and Y.M. (Yugo Moriya); methodology, M.W., R.S. and S.I.; project administration, R.S., N.S. and S.I.; resources, M.W., R.A., K.M., S.O., T.O. and S.I.; supervision, N.S. and S.I.; validation, Y.M. (Yuka Machida), M.W. and F.S.; visualization, Y.M. (Yuka Machida) and F.S.; writing—original draft, Y.M. (Yuka Machida), M.W. and F.S.; writing—review and editing, Y.M. (Yuka Machida), R.S. and S.I. All authors have read and agreed to the published version of the manuscript. Institutional Review Board Statement The animal study protocol was approved by the Institutional Review Board (Ethics Committee) of Kitasato University (Approval No. 24-019, 1 April 2024), and all experiments were conducted in accordance with the Guidelines for Laboratory Animals and the Manual for the Care and Management of Laboratory Animals. The microbiological status of the animals was monitored regularly in accordance with the guidelines of the Japanese Association of Public and Private University Laboratory Animal Facilities. Informed Consent Statement Not applicable. Data Availability Statement All data gene rated or analyzed during this study are included in this published article. Conflicts of Interest The authors declare no conflicts of interest. Abbreviations The following abbreviations are used in this manuscript: AIM Apoptosis inhibitor of macrophage CKD Chronic kidney disease AKI Acute kidney injury CaOx Calcium oxalate UUO Unilateral ureteral obstruction HE Hematoxylin and Eosin MT Masson’s Trichrome αSMA Alpha-smooth muscle actin BUN Blood urea nitrogen CRE Creatinine TGF-β Transforming growth factor-beta ECM Extracellular matrix SRCR Scavenger receptor cysteine-rich References 1. Cannon A.B. Westropp J.L. Ruby A.L. Kass P.H. Evaluation of trends in urolith composition in cats: 5230 cases (1985–2004) J. Am. Vet. Med. Assoc. 2007 231 570 576 10.2460/javma.231.4.570 17696857 2. Kyles A.E. Hardie E.M. Wooden B.G. Adin C.A. Stone E.A. Gregory C.R. Mathews K.G. Cowgill L.D. Vaden S. Nyland T.G. Clinical, clinicopathologic, radiographic, and ultrasonographic abnormalities in cats with ureteral calculi: 163 cases (1984–2002) J. Am. Vet. Med. Assoc. 2005 226 932 936 10.2460/javma.2005.226.932 15786996 3. Kyles A.E. Stone E.A. Gookin J. Spaulding K. Clary E.M. Wylie K. Spodnick G. Diagnosis and surgical management of ob-structive ureteral calculi in cats: 11 cases (1993–1996) J. Am. Vet. Med. Assoc. 1998 213 1150 1556 10.2460/javma.1998.213.08.1150 9787383 4. A Palm C. Westropp J.L. Cats and Calcium Oxalate: Strategies for managing lower and upper tract stone disease J. Feline Med. Surg. 2011 13 651 660 10.1016/j.jfms.2011.07.018 21872792 PMC10832665 5. Iwai S. Ureterolithiasis in Cats Jpn. J. Vet. Anesth. Surg. 2021 52 1 13 10.2327/jjvas.52.1 6. Hardie E.M. E Kyles A. Management of ureteral obstruction Vet. Clin. N. Am. Small Anim. Pract. 2004 34 989 1010 10.1016/j.cvsm.2004.03.008 15223212 7. Reicherz A. Eltit F. Scotland K. Almutairi K. Bell R. Mojtahedzadeh B. Cox M. Chew B. Lange D. Indwelling stents cause severe inflammation and fibrosis of the ureter via urothelial–mesenchymal transition Sci. Rep. 2023 13 5492 10.1038/s41598-023-31885-1 37015949 PMC10073185 8. Low W.W. Uhl J.M. Kass P.H. Ruby A.L. Westropp J.L. Evaluation of trends in urolith composition and characteristics of dogs with urolithiasis: 25,499 cases (1985–2006) J. Am. Vet. Med. Assoc. 2010 236 193 200 10.2460/javma.236.2.193 20074011 9. Wormser C. Clarke D.L. Aronson L.R. Outcomes of ureteral surgery and ureteral stenting in cats: 117 cases (2006–2014) J. Am. Vet. Med. Assoc. 2016 248 518 525 10.2460/javma.248.5.518 26885594 10. Culp W.T.N. Palm C.A. Hsueh C. Mayhew P.D. Hunt G.B. Johnson E.G. Drobatz K.J. Outcome in cats with benign ureteral obstructions treated by means of ureteral stenting versus ureterotomy J. Am. Vet. Med. Assoc. 2016 249 1292 1300 10.2460/javma.249.11.1292 27875083 11. Bartges J.W. Callens A.J. Urolithiasis Vet. Clin. N. Am. Small Anim. Pract. 2015 45 747 768 10.1016/j.cvsm.2015.03.001 26002797 12. Zaid M.S. Berent A.C. Weisse C. Caceres A. Feline Ureteral Strictures: 10 Cases (2007–2009) J. Vet. Intern. Med. 2011 25 222 229 10.1111/j.1939-1676.2011.0679.x 21314722 13. Berent A.C. Weisse C.W. Bagley D.H. Lamb K. Use of a subcutaneous ureteral bypass device for treatment of benign ureteral obstruction in cats: 174 ureters in 134 cats (2009–2015) J. Am. Vet. Med. Assoc. 2018 253 1309 1327 10.2460/javma.253.10.1309 30398425 14. Kulendra N.J. Borgeat K. Syme H. Dirrig H. Halfacree Z. Survival and complications in cats treated with subcutaneous ureteral bypass J. Small Anim. Pract. 2020 62 4 11 10.1111/jsap.13226 32926426 15. Lulich J.P. Berent A.C. Adams L.G. Westropp J.L. Bartges J.W. Osborne C.A. ACVIMSmall Animal Consensus Recommendations on the Treatment and Prevention of Uroliths in Dogs and Cats J. Vet. Intern. Med. 2016 30 1564 1574 10.1111/jvim.14559 27611724 PMC5032870 16. Reicherz A. Eltit F. Almutairi K. Mojtahedzadeh B. Herout R. Chew B. Cox M. Lange D. Ureteral Obstruction Promotes Ureteral Inflammation and Fibrosis Eur. Urol. Focus 2023 9 371 380 10.1016/j.euf.2022.09.014 36244955 17. Kochin E.J. Gregory C.R. Wisner E. Cain G. Gourley I.M. Evaluation of a method of ureteroneocystostomy in cats J. Am. Vet. Med. Assoc. 1993 202 257 260 10.2460/javma.1993.202.02.257 8428831 18. Bohling M.W. Wound Healing. Feline Soft Tissue and General Surgery Langley-Hobbs S.J. Demetrious L. Ladlow J.F. Saunders Elsevier New York, NY, USA 2014 171 175 19. Chevalier R.L. Forbes M.S. Thornhill B.A. Ureteral obstruction as a model of renal interstitial fibrosis and obstructive nephropathy Kidney Int. 2009 75 1145 1152 10.1038/ki.2009.86 19340094 20. Chuang Y.H. Chuang W.L. Huang S.P. Liu K.M. Huang C.H. The temporal relationship between the severity of hydroureter and the dynamic changes of obstructed ureters in a rat model Br. J. Urol. 1995 76 303 310 10.1111/j.1464-410X.1995.tb07705.x 7551837 21. Watanabe M. Ando R. Sugisawa R. Sasaki N. Iwai S. A novel in vivo model of ureteral fibrosis induced by calcium oxalate beads in C57BL/6J mice Urolithiasis 2023 51 119 10.1007/s00240-023-01491-x 37801093 22. Miyazaki T. Hirokami Y. Matsuhashi N. Takatsuka H. Naito M. Increased Susceptibility of Thymocytes to Apoptosis in Mice Lacking AIM, a Novel Murine Macrophage-derived Soluble Factor Belonging to the Scavenger Receptor Cysteine-rich Domain Superfamily J. Exp. Med. 1999 189 413 422 10.1084/jem.189.2.413 9892623 PMC2192994 23. Hiramoto E. Tsutsumi A. Suzuki R. Matsuoka S. Arai S. Kikkawa M. Miyazaki T. The IgM pentamer is an asymmetric pentagon with an open groove that binds the AIM protein Sci. Adv. 2018 4 eaau1199 10.1126/sciadv.aau1199 30324136 PMC6179379 24. Kai T. Yamazaki T. Arai S. Miyazaki T. Aguila M.B. Stabilization and Augmentation of Circulating AIM in Mice by Synthesized IgM-Fc PLoS ONE 2014 9 e97037 10.1371/journal.pone.0097037 24804991 PMC4013091 25. Chen Q. Ishii K. Mori H. Nishijima A. Arai S. Miyazaki T. Rosenthal P.B. Cryo-EM reveals structural basis for human AIM/CD5L recognition of polymeric immunoglobulin M Nat. Commun. 2024 15 9387 10.1038/s41467-024-53615-5 39477921 PMC11525585 26. Yasuda K. Nishijima A. Inoue T. Takagi T. Tanabe K. Minakuchi J. Arai S. Miyazaki T. Release of Apoptosis Inhibitor of Macrophage (AIM) from Pentameric IgM in Serum Predicts Prognosis after Hemodialysis Initiation Commun. Med. 2025 5 15 10.1038/s43856-025-00735-8 39794503 PMC11724077 27. Arai S. Maehara N. Iwamura Y. Honda S.-I. Nakashima K. Kai T. Ogishi M. Morita K. Kurokawa J. Mori M. Obesity-Associated Autoantibody Production Requires AIM to Retain the Immunoglobulin M Immune Complex on Follicular Dendritic Cells Cell Rep. 2013 3 1187 1198 10.1016/j.celrep.2013.03.006 23562157 28. Arai S. Miyazaki T. A scavenging system against internal pathogens promoted by the circulating protein apoptosis inhibitor of macrophage (AIM) Semin. Immunopathol. 2018 40 567 575 10.1007/s00281-018-0717-6 30310974 PMC6223838 29. Martinez V.G. Escoda-Ferran C. Simões I.T. Arai S. Mascaró M.O. Carreras E. Martínez-Florensa M. Yelamos J. Miyazaki T. Lozano F. The macrophage soluble receptor AIM/Api6/CD5L displays a broad pathogen recognition spectrum and is involved in early response to microbial aggression Cell. Mol. Immunol. 2014 11 343 354 10.1038/cmi.2014.12 24583716 PMC4085514 30. Miyazaki T. Yamazaki T. Sugisawa R. Gershwin M.E. Arai S. AIM associated with the IgM pentamer: Attackers on stand-by at aircraft carrier Cell. Mol. Immunol. 2018 15 563 574 10.1038/cmi.2017.141 29375122 PMC6078943 31. Arai S. Miyazaki T. Impacts of the apoptosis inhibitor of macrophage (AIM) on obesity-associated inflammatory diseases Semin. Immunopathol. 2014 36 3 12 10.1007/s00281-013-0405-5 24281248 PMC3912372 32. Maehara N. Taniguchi K. Okuno A. Ando H. Hirota A. Li Z. Wang C.-T. Arai S. Miyazaki T. AIM/CD5L attenuates DAMPs in the injured brain and thereby ameliorates ischemic stroke Cell Rep. 2021 36 109693 10.1016/j.celrep.2021.109693 34525359 33. Arai S. Kitada K. Yamazaki T. Takai R. Zhang X. Tsugawa Y. Sugisawa R. Matsumoto A. Mori M. Yoshihara Y. Apoptosis inhibitor of macrophage protein enhances intraluminal debris clearance and ameliorates acute kidney injury in mice Nat. Med. 2016 22 183 193 10.1038/nm.4012 26726878 34. Yamazaki T. Sugisawa R. Hiramoto E. Takai R. Matsumoto A. Senda Y. Nakashima K. Nelson P.S. Lucas J.M. Morgan A. A proteolytic modification of AIM promotes its renal excretion Sci. Rep. 2016 6 38762 10.1038/srep38762 27929116 PMC5144010 35. Komatsu G. Nonomura T. Sasaki M. Ishida Y. Arai S. Miyazaki T. AIM-deficient mouse fed a high-trans fat, high-cholesterol diet: A new animal model for nonalcoholic fatty liver disease Exp. Anim. 2019 68 147 158 10.1538/expanim.18-0108 30487357 PMC6511520 36. Kurokawa J. Arai S. Nakashima K. Nagano H. Nishijima A. Miyata K. Ose R. Mori M. Kubota N. Kadowaki T. Macrophage-Derived AIM Is Endocytosed into Adipocytes and Decreases Lipid Droplets via Inhibition of Fatty Acid Synthase Activity Cell Metab. 2010 11 479 492 10.1016/j.cmet.2010.04.013 20519120 37. Kurokawa J. Nagano H. Ohara O. Kubota N. Kadowaki T. Arai S. Miyazaki T. Apoptosis inhibitor of macrophage (AIM) is required for obesity-associated recruitment of inflammatory macrophages into adipose tissue Proc. Natl. Acad. Sci. USA 2011 108 12072 12077 10.1073/pnas.1101841108 21730133 PMC3141977 38. Maehara N. Arai S. Mori M. Iwamura Y. Kurokawa J. Kai T. Kusunoki S. Taniguchi K. Ikeda K. Ohara O. Circulating AIM Prevents Hepatocellular Carcinoma through Complement Activation Cell Rep. 2014 9 61 74 10.1016/j.celrep.2014.08.058 25284781 39. Miyazaki T. Kurokawa J. Arai S. AIMing at Metabolic Syndrome-Towards the Development of Novel Therapies for Metabolic Diseases via Apoptosis Inhibitor of Macrophage (AIM) Circ. J. 2011 75 2522 2531 10.1253/circj.CJ-11-0891 21970839 40. Okanoue T. Yamaguchi K. Shima T. Mitsumoto Y. Mizuno M. Katayama T. Seko Y. Moriguchi M. Umemura A. Itoh Y. Serum levels of immunoglobulin M-free inhibitors of macrophage/CD5L as a predictive and early diagnostic marker for nonalcoholic steatohepatitis-associated hepatocellular carcinoma Hepatol. Res. 2022 52 998 1008 10.1111/hepr.13826 35939571 41. Sugisawa R. Komatsu G. Hiramoto E. Takeda N. Yamamura K.-I. Arai S. Miyazaki T. Independent modes of disease repair by AIM protein distinguished in AIM-felinized mice Sci. Rep. 2018 8 13157 10.1038/s41598-018-31580-6 30177770 PMC6120884 42. Matsuura K. Maehara N. Hirota A. Eguchi A. Yasuda K. Taniguchi K. Nishijima A. Matsuhashi N. Shiga Y. Ishii R. Two independent modes of kidney stone suppression achieved by AIM/CD5L and KIM-1 Commun. Biol. 2022 5 783 10.1038/s42003-022-03750-w 35922481 PMC9349198 43. Nemoto H. Honjo M. Arai S. Miyazaki T. Aihara M. Apoptosis inhibitor of macrophages/CD5L enhances phagocytosis in the trabecular meshwork cells and regulates ocular hypertension J. Cell. Physiol. 2023 238 2451 2467 10.1002/jcp.31097 37584382 44. Ozawa T. Maehara N. Kai T. Arai S. Miyazaki T. Dietary fructose-induced hepatocellular carcinoma development manifested in mice lacking apoptosis inhibitor of macrophage (AIM) Genes Cells 2016 21 1320 1332 10.1111/gtc.12446 27813205 45. Takahata A. Arai S. Hiramoto E. Kitada K. Kato R. Makita Y. Suzuki H. Nakata J. Araki K. Miyazaki T. Crucial Role of AIM/CD5L in the Development of Glomerular Inflammation in IgA Nephropathy J. Am. Soc. Nephrol. 2020 31 2013 2024 10.1681/ASN.2019100987 32611589 PMC7461693 46. Takimoto-Sato M. Suzuki M. Kimura H. Ge H. Matsumoto M. Makita H. Arai S. Miyazaki T. Nishimura M. Konno S. Apoptosis inhibitor of macrophage (AIM)/CD5L is involved in the pathogenesis of COPD Respir. Res. 2023 24 201 10.1186/s12931-023-02508-0 37592330 PMC10433671 47. Tomita T. Arai S. Kitada K. Mizuno M. Suzuki Y. Sakata F. Nakano D. Hiramoto E. Takei Y. Maruyama S. Apoptosis inhibitor of macrophage ameliorates fungus-induced peritoneal injury model in mice Sci. Rep. 2017 7 6450 10.1038/s41598-017-06824-6 28743989 PMC5527077 48. Wang C.-T. Tezuka T. Takeda N. Araki K. Arai S. Miyazaki T. Joles J.A. High salt exacerbates acute kidney injury by disturbing the activation of CD5L/apoptosis inhibitor of macrophage (AIM) protein PLoS ONE 2021 16 e0260449 10.1371/journal.pone.0260449 34843572 PMC8629239 49. Yamazaki T. Mori M. Arai S. Tateishi R. Abe M. Ban M. Nishijima A. Maeda M. Asano T. Kai T. Circulating AIM as an Indicator of Liver Damage and Hepatocellular Carcinoma in Humans PLoS ONE 2014 9 e109123 10.1371/journal.pone.0109123 25302503 PMC4193837 50. Yasuda K. Shimodan S. Maehara N. Hirota A. Iijima R. Nishijima A. Mori H. Toyama R. Ito A. Yoshikawa Y. AIM/CD5L ameliorates autoimmune arthritis by promoting removal of inflammatory DAMPs at the lesions J. Autoimmun. 2023 142 103149 10.1016/j.jaut.2023.103149 38006711 51. Sugisawa R. Hiramoto E. Matsuoka S. Iwai S. Takai R. Yamazaki T. Mori N. Okada Y. Takeda N. Yamamura K.-I. Impact of feline AIM on the susceptibility of cats to renal disease Sci. Rep. 2016 6 35251 10.1038/srep35251 27731392 PMC5059666 52. Le Clef N. Verhulst A. D’Haese P.C. A Vervaet B. Unilateral Renal Ischemia-Reperfusion as a Robust Model for Acute to Chronic Kidney Injury in Mice PLoS ONE 2016 11 e0152153 10.1371/journal.pone.0152153 27007127 PMC4805266 53. Capelouto C.C. Saltzman B. The Pathophysiology of Ureteral Obstruction J. Endourol. 1993 7 93 103 10.1089/end.1993.7.93 8518834 54. Moe O.W. Kidney stones: Pathophysiology and medical management Lancet 2006 367 333 344 10.1016/S0140-6736(06)68071-9 16443041 55. Frangogiannis N.G. Transforming growth factor–β in tissue fibrosis J. Exp. Med. 2020 217 e20190103 10.1084/jem.20190103 32997468 PMC7062524 56. Mann P.C. Vahle J. Keenan C.M. Baker J.F. Bradley A.E. Goodman D.G. Harada T. Herbert R. Kaufmann W. Kellner R. International Harmonization of Toxicologic Pathology Nomenclature: An overview and review of basic principles Toxicol. Pathol. 2012 40 7S 13S 10.1177/0192623312438738 22637736 Figure 1 ( A B n Figure 2 Evaluation of inflammatory cell infiltration in HE-stained sections. The scale bar represents 200 µm. All images were captured at the same magnification. (Representative images used for quantification in each group are shown in Supplementary Figure S1 a d e h i l a e i b f j c g k d h l Figure 3 ( A B n Figure 4 Representative HE-stained images (×100) of ureteral tissue from the fA–C ( A B n A B Supplementary Figure S2 Figure 5 ( A n B n a b c d e f Figure 6 ( A n n p B n a b c d e f 2 5 Figure 7 ( A n p B n a b c Figure 9 Implanted Calcium oxalate (CaOx) beads. Each division corresponds to 1 mm. Figure 10 Creation of a UUO model via ligation of the left ureter. ▲: Left Kidney ★: Left Ureter. Figure 11 Left kidney and ureter during tissue collection. Each division on the scale marks indicates 1 mm. ijms-26-09117-t001_Table 1 Table 1 Experimental Groups.  Calcium Oxalate Group Unilateral Ureteral Obstruction C Group U Group C57BL/6 mA mA-C Group mA-U Group Mouse AIM-KO-C57BL/6 koA koA-C Group koA-U Group AIM Felinized C57BL/6 fA fA-C Group fA-U Group ",
  "metadata": {
    "Title of this paper": "International Harmonization of Toxicologic Pathology Nomenclature: An overview and review of basic principles",
    "Journal it was published in:": "International Journal of Molecular Sciences",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12471175/"
  }
}