{
  "title": "Paper_505",
  "abstract": "pmc Cureus Cureus 2757 cureus Cureus 2168-8184 Cureus Inc. PMC12477411 PMC12477411.1 12477411 12477411 41030726 10.7759/cureus.91208 1 Obstetrics/Gynecology Diagnosis of Pelvic Actinomycosis and Fusobacterium Infection Using 16S rRNA Gene Analysis for Formalin-Fixed Paraffin-Embedded (FFPE) Tissue After Intrauterine Device (IUD) Removal Muacevic Alexander Adler John R Kitakura Erika 1 2 Onuma Toshimichi 2 Orisaka Makoto 2 Yoshida Yoshio 2  1  2 Yoshio Yoshida yyoshida@u-fukui.ac.jp 28 8 2025 8 2025 17 8 494304 e91208 28 8 2025 28 08 2025 30 09 2025 01 10 2025 Copyright © 2025, Kitakura et al. 2025 Kitakura et al. https://creativecommons.org/licenses/by/4.0/ This is an open access article distributed under the terms of the Creative Commons Attribution License CC-BY 4.0., which permits unrestricted use, distribution, and reproduction in any medium, provided the original author and source are credited. This article is available from https://cureus.com/articles/389921-diagnosis-of-pelvic-actinomycosis-and-fusobacterium-infection-using-16s-rrna-gene-analysis-for-formalin-fixed-paraffin-embedded-ffpe-tissue-after-intrauterine-device-iud-removal Severe pelvic infections present a diagnostic challenge owing to the clinical and radiological resemblance to malignancy. Pelvic actinomycosis has been implicated in the exacerbation of other anaerobic infections. Herein, we present the case of a 65-year-old woman who developed severe pelvic actinomycosis and Fusobacterium The patient presented with lower abdominal pain. Imaging revealed an enlarged uterus with extensive parametrial invasion, bilateral hydronephrosis, and rectal stenosis, mimicking uterine sarcoma. Laboratory tests revealed elevation in the levels of inflammatory markers and renal dysfunction. Surgery was performed under suspicion of malignancy; however, histopathological examination revealed no malignant cells. Grocott staining identified filamentous organisms consistent with Actinomyces Actinomyces israelii Fusobacterium nucleatum This case highlights the fact that pelvic actinomycosis and Fusobacterium Fusobacterium Actinomyces israelii Fusobacterium nucleatum 16s rrna actinomyces israelii fusobacterium nucleatum gynecological malignancy intrauterine device mixed anaerobic infection next-generation sequencing pelvic infection pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement no pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes Introduction Pelvic actinomycosis is a rare, chronic infection often associated with the prolonged use of intrauterine devices (IUDs) [ 1 2 4 Actinomyces israelii 5 6 Actinomyces 7 8 9 Fusobacterium Actinomyces Fusobacterium Case presentation A 65-year-old woman (gravida 3, para 3) presented to our emergency department with a chief complaint of lower abdominal pain and diarrhea. She did not have any other symptoms. The patient was 155 cm tall, weighed 61 kg, and had a BMI of 25.5 kg/m². She had experienced menopause at the age of 56 years, and had a medical history of hypertension, arrhythmia, and appendectomy for appendicitis. The patient had been previously diagnosed with uterine fibroids and was therefore undergoing follow-up care at a local clinic. Her medications included butylscopolamine bromide, bacterial butyric acid granules, pilsicainide hydrochloride hydrate, olmesartan medoxomil, and amlodipine besylate. Her family history included hypertension in her mother and breast cancer in her sister. The patient had undergone IUD insertion in 1984 following the birth of her third child, which had been removed eight months prior to presentation due to irregular bleeding and abdominal pain. After removal of the IUD, her symptoms resolved promptly. There were no clinical signs of infection during this period. On admission, her temperature was 36.7°C, blood pressure was 130/85 mmHg, and pulse was 81/minute. Pelvic examination revealed an enlarged uterus with poor mobility, whereas rectal examination detected a firm induration consistent with mass effect and adhesion. Laboratory findings indicated elevated inflammatory markers with a white blood cell count of 23,200/μL (normal: 3300-8600/μL) and C-reactive protein level of 4.89 mg/dL (normal: 0-0.14 mg/dL). Renal dysfunction was evident, with a blood urea nitrogen level of 23 mg/dL (normal: 8-20 mg/dL) and creatinine level of 1.30 mg/dL (normal: 0.46-0.79 mg/dL); however, tumor markers were all below cutoff values (carcinoembryonic antigen (CEA), 3.6 ng/ml; cancer antigen 19-9 (CA19-9), 11.2 U/ml; CA125, 19.2 U/ml; and squamous cell carcinoma (SCC), 0.8 ng/ml). The patient’s lactate dehydrogenase level was 166 U/L (normal: 124-222 U/L). Contrast-enhanced computed tomography (CT) revealed an enlarged uterus containing uterine fibroids with partial calcification, cervical enlargement, perirectal edema, and bilateral hydronephrosis (Figures 1a 1b 1c 1d 1e 1f Figure 1 Imaging findings of the patient CT: computed tomography; PET-CT: positron emission tomography/computed tomography; MRI: magnetic resonance imaging; FDG: fluorodeoxyglucose (a, b) Contrast-enhanced CT showing an enlarged uterus and bilateral hydronephrosis and hydroureter. (c) T2-weighted MRI showing a heterogeneous signal intensity from the cervix to the body of the enlarged uterus. (d) Contrast-enhanced MRI showing heterogeneous contrast enhancement. (e, f) PET-CT showing intense FDG uptake in the mass extending from the cervix to the uterine body and in the paraaortic lymph node (yellow arrow) Cervical cytology revealed negative for intraepithelial lesion or malignancy (NILM). Barium enema examination subsequently revealed circumferential stenosis of the rectum without gross lesions, while total colonoscopy showed no mucosal invasion. Based on the results of these preoperative examinations, uterine sarcoma with extensive invasion was suspected, and open surgery was performed. Intraoperative findings included an enlarged uterus, extensive parametrial invasion, and firm rectal adhesions (Figure 2a 2b Figure 2 Operative findings Operative findings, including (a) firm adhesions around the enlarged uterus in the pelvic cavity and (b) resected specimen of the uterus However, rapid intraoperative pathological diagnosis using frozen section of the excised uterus indicated no malignant findings. The final pathological diagnosis further confirmed no apparent malignant tumor in the uterus, ovaries, and lymph node. However, hematoxylin and eosin staining of the excised uterus revealed bacterial colonies with extensive neutrophil infiltration and inflammatory fibrosis in the endometrium and myometrium (Figure 3a bacilli 3b Actinomyces 3c Figure 3 Histopathological findings Histopathological findings of the excised uterus. (a) Hematoxylin and eosin staining revealed bacterial colonies with extensive neutrophil infiltration. (b) Gram staining confirmed the presence of Gram-positive bacilli Actinomyces The cultures of the ascitic fluid collected through the postoperative drain were monitored for three days, during which no growth was observed, confirming a negative result. NGS of 16S rRNA from FFPE tissue of the endometrium and myometrium was performed in three independent areas of the uterus. Genomic DNA was extracted from FFPE tissue sections using the NucleoSpin DNA FFPE XS kit (MACHEREY-NAGEL, Düren, Germany), and a negative control was processed in parallel without tissue. The V1-V2 region of the 16S rRNA gene was amplified by polymerase chain reaction (PCR), followed by purification using KAPA HyperPure Beads (Roche, Basel, Switzerland). Indexing was performed using the Nextera XT Index Kit v2 (Illumina, San Diego, CA, USA). Final libraries were sequenced on the Illumina MiSeq platform (Illumina, San Diego, CA, USA). NGS analysis revealed the presence of Actinomyces israelii Fusobacterium nucleatum 1 Table 1 16S rRNA bacterial flora analysis rRNA: ribosomal RNA Genus Species Occupancy rate Area 1   Fusobacterium F. nucleatum 96.30% Actinomyces A. israelii 2.60% Mesorhizobium  Mesorhizobium 0.30% Cutibacterium C. acnes 0.20% Pseudomonas P. donghuensis 0.20% Chelatococcus C. daeguensis 0.10% Unclassified  0.20% Others  0.10% Area 2   Fusobacterium F. nucleatum 95.10% Actinomyces A. israelii 1.70% Cutibacterium C. acnes 0.70% Pseudomonas P. donghuensis 0.40% Aquamicrobium A. lusatiense 0.30% Enterococcus E. cecorum 0.30% Paracoccus P. marinus 0.20% Others  0.20% Area 3   Fusobacterium F. nucleatum 98.40% Actinomyces A. israelii 0.70% Pseudomonas P. donghuensis 0.40% Cutibacterium C. acnes 0.20% Asticcacaulis A. excentricus 0.10% Enterobacteriaceae  Enterobacteriaceae 0.10% Others  0.10% Discussion The important clinical implications of this case include the following: First, mixed infection pelvic actinomycosis and Fusobacterium can develop even following IUD removal, causing hydronephrosis and intestinal infiltration through the extensive invasion of the parametrium, presenting a clinical picture similar to that of malignant tumors. Therefore, in patients with a history of IUD use, this disease should be considered, regardless of the patient’s current IUD status. Secondly, mixed infections, including synergistic relationships between Actinomyces israelii Fusobacterium nucleatum Actinomyces bacillus 1 Actinomyces israelii 7 10 1 11 12 7 7 7 8 Fusobacterium nucleatum Actinomyces israelii 5 Actinomyces Fusobacterium nucleatum 13 15 Actinomyces israelii Fusobacterium nucleatum Actinomyces Actinomyces 5 6 11 12 Fusobacterium nucleatum Actinomyces 6 Fusobacterium nucleatum Actinomyces 6 Actinomyces israelii Fusobacterium nucleatum Severe pelvic infection following IUD removal is difficult to differentiate from gynecological malignancies. Cases of pelvic actinomycosis developing despite IUD removal, or in the absence of IUD insertion, have previously been reported [ 2 16 17 2 4 Actinomyces 18 Actinomyces 19 Actinomyces Conclusions This is an extremely rare case of severe mixed pelvic infection caused by Actinomyces israelii Fusobacterium nucleatum Actinomyces israelii usobacterium nucleatum Disclosures Human subjects: Conflicts of interest: Payment/services info: Financial relationships: Other relationships: Author Contributions Concept and design: Acquisition, analysis, or interpretation of data: Drafting of the manuscript: Critical review of the manuscript for important intellectual content: References 1 Pelvic actinomycosis Can J Infect Dis Med Microbiol García-García A Ramírez-Durán N Sandoval-Trujillo H Romero-Figueroa MD 9428650 2017 2017 28684963 10.1155/2017/9428650 PMC5480022 2 Tubo-ovarian actinomycosis mimicking as ovarian malignancy: report of three cases Indian J Pathol Microbiol Munjal K Nandedkar S Subedar V Jain S 870 871 53 2010 21045457 10.4103/0377-4929.72020 3 Pelvic actinomycosis with hydronephrosis and colon stricture simulating an advanced ovarian cancer J Gynecol Oncol Lee YK Bae JM Park YJ Park SY Jung SY 154 156 19 2008 19471564 10.3802/jgo.2008.19.2.154 PMC2676461 4 A case of pelvic actinomycosis unrelated to an intrauterine device Jpn J Clin Oncol Ikeda S Kato T 237 238 42 2012 22375028 10.1093/jjco/hys015 5 Coinfection of Fusobacterium nucleatum and Actinomyces israelii in mastoiditis diagnosed by next-generation DNA sequencing J Clin Microbiol Salipante SJ Hoogestraat DR Abbott AN 1789 1792 52 2014 24574281 10.1128/JCM.03133-13 PMC3993667 6 Fusobacterium nucleatum ATCC 10953 requires Actinomyces naeslundii ATCC 43146 for growth on saliva in a three-species community that includes Streptococcus oralis 34 Appl Environ Microbiol Periasamy S Chalmers NI Du-Thumm L Kolenbrander PE 3250 3257 75 2009 19286780 10.1128/AEM.02901-08 PMC2681650 7 Actinomycosis BMJ Wong VK Turmezei TD Weston VC 0 343 2011 10.1136/bmj.d6099 21990282 8 Actinomycosis: diagnostic and therapeutic considerations and a review of 32 cases Laryngoscope Bennhoff DF 1198 1217 94 1984 6381942 10.1288/00005537-198409000-00013 9 Performance and application of 16S rRNA gene cycle sequencing for routine identification of bacteria in the clinical microbiology laboratory Clin Microbiol Rev Church DL Cerutti L Gürtler A Griener T Zelazny A Emler S 33 2020 10.1128/CMR.00053-19 PMC7484979 32907806 10 Actinomycosis: a great pretender. Case reports of unusual presentations and a review of the literature Int J Infect Dis Acevedo F Baudrand R Letelier LM Gaete P 358 362 12 2008 18164641 10.1016/j.ijid.2007.10.006 11 Thoracic vertebral actinomycosis: Actinomyces israelii and Fusobacterium nucleatum J Clin Microbiol Honda H Bankowski MJ Kajioka EH Chokrungvaranon N Kim W Gallacher ST 2009 2014 46 2008 18337385 10.1128/JCM.01706-07 PMC2446836 12 Pyometra perforation caused by Actinomyces without intrauterine device involvement Case Rep Obstet Gynecol Hagiya H 658902 2013 2013 23762685 10.1155/2013/658902 PMC3670553 13 Actinomyces and related organisms in human infections Clin Microbiol Rev Könönen E Wade WG 419 442 28 2015 25788515 10.1128/CMR.00100-14 PMC4402957 14 Mixed infection involving Actinomyces, Aggregatibacter, and Fusobacterium species presenting as perispinal tumor Anaerobe Ghafghaichi L Troy S Budvytiene I Banaei N Baron EJ 174 178 16 2010 19628046 10.1016/j.anaerobe.2009.07.003 15 Mixed infection of Actinomyces israelii and Fusobacterium nucleatum presenting as a neck mass BMJ Case Rep King JP Dhar M Smith SJ Emmanuel J 0 13 2020 10.1136/bcr-2020-239043 PMC7737052 33318282 16 Urinary undiversion for pelvic actinomycosis: a long-term follow up Int J Urol Maeda H Shichiri Y Kinoshita H 111 113 6 1999 10226818 10.1046/j.1442-2042.1999.00628.x 17 Abdominal-pelvic actinomycosis mimicking malignant neoplasm Infect Dis Obstet Gynecol Pusiol T Morichetti D Pedrazzani C Ricci F 747059 2011 2011 21904441 10.1155/2011/747059 PMC3163399 18 IUDs and colonization or infection with Actinomyces Contraception Westhoff C 0 50 75 2007 10.1016/j.contraception.2007.01.006 17531616 19 The importance of the removal of the intrauterine device in genital colonization by actinomyces Gynecol Obstet Invest Bonacho I Pita S Gómez-Besteiro MI 119 123 52 2001 11586040 10.1159/000052955 ",
  "metadata": {
    "Title of this paper": "The importance of the removal of the intrauterine device in genital colonization by actinomyces",
    "Journal it was published in:": "Cureus",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12477411/"
  }
}