{
  "title": "Paper_769",
  "abstract": "pmc Genes Dis Genes Dis 3547 genesdiss Genes & Diseases 2352-4820 2352-3042 Chongqing Medical University PMC12466132 PMC12466132.1 12466132 12466132 41019511 10.1016/j.gendis.2025.101720 S2352-3042(25)00209-0 101720 1 Rapid Communication Forward genetics identifies HN1L/JPT2 as a novel carboplatin resistance gene in ovarian cancer Wei Han a Motolani Aishat a Nephew Kenneth P. b c Jiang Guanglong d Alipourgivi Faranak a Sun Steven a Huang Xiumei b e Opyrchal Mateusz b f Sandusky George g Liu Yunlong d Lu Tao lut@iu.edu a b d h ⁎ a b c d e f g h ⁎ lut@iu.edu 1 2026 13 6 2025 13 1 497147 101720 3 10 2024 20 4 2025 11 5 2025 13 06 2025 27 09 2025 29 09 2025 © 2025 The Authors. Publishing services by Elsevier B.V. on behalf of KeAi Communications Co., Ltdé. 2025 Chongqing Medical University https://creativecommons.org/licenses/by/4.0/ This is an open access article under the CC BY license (http://creativecommons.org/licenses/by/4.0/). pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement yes pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes Ovarian cancer (OC) is the deadliest gynecologic malignancy, with platinum-based chemotherapy, such as carboplatin, remaining the standard first-line treatment. However, resistance to carboplatin poses a major therapeutic challenge, and its mechanisms are not fully understood. 1 2 in vitro The VBIM technology 2 Fig. 1 Figure 1 VBIM identifies HN1L as a novel mediator of Carbo resistance via NF-κB activation in OC. (A D) P (E G) , P # P (H L) P $ P # P (M, N) P n P # P (O–R) P P https://ualcan.path.uab.edu/cgi-bin/ualcan-res.pl (S–U) https://ualcan.path.uab.edu/cgi-bin/ualcan-res.pl (V) Figure 1 To assess HN1L's role in carboplatin resistance in OC, A2780 and SKOV3 cells were engineered to overexpress or knock down HN1L. Clonogenic assays showed that HN1L-overexpressing cells were significantly more resistant to carboplatin, while shHN1L cells were more sensitive. IC50 values in A2780 cells were 1 μM (control), 4.8 μM (HN1L), and 0.5 μM (shHN1L); in SKOV3 cells, 2 μM, 6.8 μM, and 0.8 μM, respectively. These findings suggest HN1L overexpression enhances carboplatin resistance in OC cells ( Fig. 1 NF-κB signaling has long been associated with chemoresistance, including resistance to platinum agents. 1 , 3 Fig. 1 Microarray analysis of 293C6 cells identified 818 NF-κB–responsive genes upon IL-1β stimulation, 40% of which were further up-regulated by HN1L. Approximately 26% of these co-regulated genes have previously been implicated in platinum resistance ( Fig. 1 Fig. 1 4 Fig. 1 Fig. S1 To explore the mechanism of NF-κB activation, we analyzed IκBα (nuclear factor κB inhibitor alpha) degradation following HN1L overexpression. Western blotting showed rapid IκBα degradation within 15 min of IL-1β treatment and recovery by 60 min, indicating that HN1L amplifies NF-κB activity, potentially through pathways downstream of IκBα ( Fig. 1 In vitro Fig. 1 In vivo Fig. 1 OC n Fig. 1 Proteomic data from The National Cancer Institute's Clinical Proteomic Tumor Analysis Consortium (CPTAC) confirmed significant HN1L overexpression in primary OC compared with normal ovarian tissue ( p Fig. 1 Fig. 1 Fig. 1 Fig. 1 To investigate transcriptional regulation of HN1L, we analyzed its promoter and found predicted binding motifs for E2F transcription factor 1 (E2F1), nuclear transcription factor Y (NFY), and early growth response 1 (EGR1). Notably, an NF-κB p50 binding site was identified at −703 bp ( Fig. 1 Based on our data, we propose a model ( Fig. 1 Importantly, our findings do not exclude additional mechanisms of action. Whether HN1L influences other pathways such as phosphoinositide 3-kinase (PI3K)/protein kinase B (AKT), or WNT remains to be investigated. For example, hematological and neurological expressed 1 (HN1), a homolog of HN1L, regulates glycogen synthase kinase 3 beta (GSK3β) phosphorylation via PI3K/AKT and has been implicated in drug resistance. HN1 is also among a panel of four genes that can distinguish OC from normal ovarian tissue and may serve as a diagnostic biomarker. Our VBIM technique enables discovery of genetic changes influencing cellular phenotypes. Previously, we identified NF-κB regulators F-box and leucine-rich repeat 11 (FBXL11) 2 5 The NF-κB target genes up-regulated by HN1L in this study are implicated in multiple cancer hallmarks. IL1RAP plays a key role in inflammation and is overexpressed in various solid and hematological cancers. MVP is a vault complex protein associated with non-P-glycoprotein-mediated multidrug resistance. 4 Interestingly, HN1L expression was highest in early-stage (I–II) OC, and somewhat lower in late-stage (III–IV) disease ( Fig. 1 In summary, using the VBIM screening platform, we identified HN1L as a novel gene driving carboplatin resistance in OC. Mechanistically, HN1L activates NF-κB signaling, resulting in the up-regulation of pro-survival and drug resistance genes. HN1L functions downstream of IκBα and promotes tumorigenesis both in vitro in vivo Collectively, our findings establish HN1L as a promising diagnostic biomarker and therapeutic target. Targeting HN1L, alone or in combination with carboplatin, could help overcome platinum resistance in OC and potentially in other HN1L-driven cancers. CRediT authorship contribution statement Han Wei: Aishat Motolani: Kenneth P. Nephew: Guanglong Jiang: Faranak Alipourgivi: Steven Sun: Xiumei Huang: Mateusz Opyrchal: George Sandusky: Yunlong Liu: Tao Lu: Funding This work was supported by the US National Institutes of Health 1R01GM120156-01A1 R03CA223906-01 1R03CA283225-A1 Kay Yow Cancer Fund (V Foundation for Cancer Research) (USA) 4486242 Showalter Scholar fund from Indiana University School of Medicine 2286263 Indiana University Melvin and Bren Simon Comprehensive Cancer Center IUSCCC 2987664 Conflict of interests As a member of Editorial Board of Genes & Diseases References 1 Eskander R.N. Moore K.N. Monk B.J. Overcoming the challenges of drug development in platinum-resistant ovarian cancer Front Oncol 13 2023 1258228 10.3389/fonc.2023.1258228 PMC10616588 37916177 2 Lu T. Jackson M.W. Singhi A.D. Validation-based insertional mutagenesis identifies lysine demethylase FBXL11 as a negative regulator of NFkappaB Proc Natl Acad Sci U S A 106 38 2009 16339 16344 19805303 10.1073/pnas.0908560106 PMC2736141 3 Momeny M. Yousefi H. Eyvani H. Blockade of nuclear factor-κB (NF-κB) pathway inhibits growth and induces apoptosis in chemoresistant ovarian carcinoma cells Int J Biochem Cell Biol 99 2018 1 9 29567488 10.1016/j.biocel.2018.03.015 4 Szaflarski W. Sujka-Kordowska P. Pula B. Expression profiles of vault components MVP, TEP1 and vPARP and their correlation to other multidrug resistance proteins in ovarian cancer Int J Oncol 43 2 2013 513 520 23739867 10.3892/ijo.2013.1975 5 Jiao D. Zhang J. Chen P. HN1L promotes migration and invasion of breast cancer by up-regulating the expression of HMGB1 J Cell Mol Med 25 1 2021 397 410 33191617 10.1111/jcmm.16090 PMC7810958 Appendix A Supplementary data The following is the Supplementary data to this article. Multimedia component 1 Multimedia component 1 Acknowledgements We thank Dr. Tong-Chuan He (Molecular Oncology Laboratory, Department of Orthopedic Surgery and Rehabilitation Medicine, University of Chicago Medical Center, Chicago, IL 60637, USA) and Dr. Daniela Matei (Department of Obstetrics & Gynecology, Feinberg School of Medicine, Northwestern University, Chicago, Illinois 60611, USA) for their highly constructive and valuable feedback of this manuscript. We also thank Ms. Yun for her technical support. Peer review under the responsibility of the Genes & Diseases Editorial Office, in alliance with the Association of Chinese Americans in Cancer Research (ACACR, Baltimore, MD, USA). Appendix A Supplementary data to this article can be found online at https://doi.org/10.1016/j.gendis.2025.101720 ",
  "metadata": {
    "Title of this paper": "HN1L promotes migration and invasion of breast cancer by up-regulating the expression of HMGB1",
    "Journal it was published in:": "Genes & Diseases",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12466132/"
  }
}