{
  "title": "Paper_1248",
  "abstract": "pmc Life (Basel) Life (Basel) 2582 life life Life 2075-1729 Multidisciplinary Digital Publishing Institute  (MDPI) PMC12471379 PMC12471379.1 12471379 12471379 41010422 10.3390/life15091480 life-15-01480 1 Article Genetic Variants in Cytokines IL-10 IL-17A https://orcid.org/0000-0003-2611-0972 Monroy-Jaramillo Nancy Conceptualization Methodology Investigation Resources Writing – original draft Writing – review & editing Supervision Project administration 1 * † https://orcid.org/0000-0003-2803-9444 Ortega-Vázquez Alberto Methodology Software Formal analysis Investigation Resources Writing – original draft Writing – review & editing Funding acquisition 2 † López-López Marisol Investigation Writing – original draft Writing – review & editing 2 Adalid-Peralta Laura Virginia Conceptualization Methodology Resources Writing – original draft Writing – review & editing Supervision 3 Kalinderi Kallirhoe Academic Editor 1 2 aortega@correo.xoc.uam.mx mlopez@correo.xoc.uam.mx 3 laura.adalid@innn.edu.mx * nancy.monroy@innn.edu.mx † These authors contributed equally to this work. 20 9 2025 9 2025 15 9 497651 1480 19 8 2025 15 9 2025 18 9 2025 20 09 2025 27 09 2025 29 09 2025 © 2025 by the authors. 2025 https://creativecommons.org/licenses/by/4.0/ Licensee MDPI, Basel, Switzerland. This article is an open access article distributed under the terms and conditions of the Creative Commons Attribution (CC BY) license ( https://creativecommons.org/licenses/by/4.0/ Background/Objective: Parkinson’s disease (PD) is the most common neurodegenerative movement disorder, in which the inflammatory hypothesis posits that dysregulation of the immune system is an important factor in its etiology. Based on our previous findings, we aimed to explore if promoter functional genetic variants in cytokines encoded by IL-10 IL-17A IL-13 IL-10_ IL-10_ IL-13 IL-17A IL-17_ IL-17A p 95% IL-10 IL-10 IL_17A Parkinson’s disease IL-10 IL-13 IL-17A inflammation This research received no external funding. pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement yes pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes 1. Introduction Parkinson’s disease (PD) is the second most prevalent neurodegenerative disorder; the majority of cases are sporadic and multifactorial, and its etiology has not been clearly established [ 1 2 3 4 5 6 6 3 4 In PD, dysregulated cytokine secretion is driven by a profound imbalance between pro-inflammatory and regulatory immune cells, contributing to disease progression [ 7 8 9 9 7 8 9 Some reports have observed increased serum IL-10 levels in patients with PD compared with control participants [ 6 10 11 12 6 13 14 15 16 17 18 19 IL-10 13 14 15 16 17 18 19 20 20 13 14 15 16 17 18 19 The action of IL-13 as an anti-inflammatory cytokine is through a heterodimeric receptor complex which is expressed in dopaminergic neurons and includes its subunit, IL-13Rα1. This subunit lies within the PARK12 21 22 IL-13 21 22 Sommer et al. (2019) found that Th17 cells accelerated the death of midbrain neurons induced by PD patient-derived induced pluripotent stem cells, indicating that IL-17A may be involved in PD pathogenesis [ 7 21 23 21 24 25 24 26 27 IL-17A IL-17A 28 IL-10 can directly suppress the production of IL-17A, while some IL-17-producing Tregs can also co-secrete IL-10, suggesting a complex, context-dependent, and sometimes reciprocal regulatory relationship [ 29 30 It has been proposed that certain genetic differences in the immune response, especially in the production of anti-inflammatory and pro-inflammatory cytokines, could influence the risk of developing this disease [ 3 4 5 26 31 Despite all this evidence, the causal relationship between circulating pro- and anti-inflammatory cytokines and the risk and clinical variables of PD has not been yet elucidated, and there is only one single study on Europeans [ 32 IL-10_ IL-10_ IL-13 IL-17A IL-17_ Supplementary Table S1 33 34 35 36 37 38 IL-10 IL-13 IL-17A 2. Materials and Methods For the present study, we included DNA samples from a biobank of the Department of Genetics (Instituto Nacional de Neurología y Neurocirugía Manuel Velasco Suárez, INNN), as follows: for population genetics purposes, 239 consecutive and unrelated patients with a clinical diagnosis of MM sporadic PD patients and 84 MM healthy controls were included. Then, a subgroup of participants was selected from this cohort for the detailed biochemical and clinical analyses. This subgroup was called the “clinical group” and consisted of 26 untreated PD patients who were seen at the outpatient clinic of the INNN, and 21 paired by sex and age, apparently healthy controls at enrollment. From all individuals blood plasmas were available for analytical measurements (see below). Patients were diagnosed by movement disorder specialists according to the Movement Disorder Society clinical diagnostic criteria for PD [ 39 The remaining 213 patients and 63 controls were only used for the population genetics part of the study, giving a total sample study of 239 PD patients and 84 controls. All participants (controls and patients, including those from the biobank) reported both parents and four grandparents of MM origin to ensure ethnic homogeneity. The present study was carried out in accordance with the latest version of the Declaration of Helsinki, and the study design was reviewed and approved by the local ethical and research committees. Written informed consent was obtained from all participants after the nature of the procedures had been fully explained (approval codes INNN_38/19 and 95/14; biobank samples from INNN_110/09 and 42/10). 2.1. Molecular Analysis Genomic DNA from peripheral blood mononuclear cells (PBMCs) of 239 PD patients and 84 controls was isolated using standard procedures. Two SNVs of the IL-10 IL-13 IL-17A ® Supplementary Table S1 After performing population genetics analysis (see below) in all samples, different genetic models were applied for each genetic variant: codominant, dominant, recessive, overdominant, and additive models. Moreover, to determine whether certain haplotypes may be associated with PD in an MM population, linkage disequilibrium (LD) and haplotype blocks were calculated using Haploview [ 40 2 2.2. Biochemical Analysis The following biochemical and clinical data were uniquely available for the 26 untreated PD patients and 21 controls (clinical group). Cytokine levels were determined via an enzyme-linked immunosorbent assay (ELISA) in plasma samples of the clinical group to explore the overall effect of immune response at the baseline and at one-year of dopaminergic replacement treatment (DRT) in PD patients. A hemogram was included for the total blood cell count, and the clinical data of PD patients was evaluated by movement disorder specialists, who used the Hoen and Yahr scale (HY), the Movement Disorder Society-sponsored version of the Unified Parkinson’s Disease Rating Scale (MDS-UPDRS) total scale, the Schwab and England Activities of Daily Living (SE-ADL) scale, and Beck’s Depression Inventory (BDI). The neutrophil–lymphocyte index (NLI) and the systemic immune-inflammation index (SII) were calculated using the counts of neutrophils, lymphocytes, and platelets from a routine blood test, as reported [ 41 26 41 2.3. Statistical Analysis Allelic and genotypic frequencies were calculated using Haploview [ 40 2 IL-10 Descriptive and inferential statistics were used to describe the demographic characteristics of the study groups. Associations in the clinical group (26 PD patients and 21 controls) were assessed using the student’s t 2 The multivariate regression analysis included inflammation indices, with biochemical and clinical parameters. Covariates included in the analyses were age and sex for all participants, while plasma cytokine levels (at the baseline in untreated patients and one year post-DRT) were only considered for PD patients. All statistical tests were performed using SPSS ® 42 p 3. Results 3.1. Clinical and Biochemical Parameters in Patients and Controls Demographic, biochemical, and clinical characteristics of the participants are shown in Table 1 p p p p p 3.2. Distribution of Genetic Variants in the Participants Allele and genotype frequency distribution for the five genetic variants was calculated for PD patients and controls, and frequencies were then compared between (i) total PD patients and total controls, (ii) treated patients and untreated patients, and (iii) untreated PD patients in the clinical group and controls in the clinical group ( Table 2 IL-10 IL-13 IL-17A Table 2 f IL-17A p 95% 95% p 95% 95% 95% 95% p p IL-10 p IL-10 p IL-13 p Table 2 OR and RR values of gene frequencies between untreated patients and controls in the clinical group were also calculated ( Supplementary Table S2 This analysis showed that being a carrier of the minor allele of IL-10 95% p IL-10 95% p 95% p IL-10 95% 95% Supplementary Table S2 The genetic frequencies found were like those formerly documented in the IL-10 33 IL-13 34 35 IL-17A 36 37 p IL-10 IL-10 f IL-13 f f IL-17A 3.3. Association Analysis of Genetic Variants and Clinical and Biochemical Parameters The analysis of plasma concentrations of cytokines (baseline and one year after DRT) and inflammation indexes vs. the observed genotypes in patients and controls in the clinical group, under all inheritance models tested for each variant, revealed several differences ( Table 3 Supplementary Table S3 IL-10 p IL-10 p IL-10 p Table 3 Supplementary Table S3 p p p p IL-10 p p For the SNV IL-13 p Table 3 Supplementary Table S3 IL-17A p 3.4. Haplotype Analysis The haplotype analysis for the SNVs of IL-10 Figure 1 IL-10_ IL-10_ 2 f f f f f f f f p IL-17A Supplementary Tables S2 and S3 Table 3 Then, the IL-10 p p p Figure 2 Supplementary Table S2 Lastly, the multivariate analysis showed a highly significant positive correlation between cytokine IL-10 levels at the baseline and after one year of DRT in PD patients (r = 0.71, p p Figure 3 Figure 3 Promoter variants of pro- and anti-inflammatory cytokine genes IL-17A IL-10 Table 3 Supplementary Table S3 There were some other associations between frequencies of the IL-10 p p p 4. Discussion Chronic inflammation (in the nervous system or peripheral) plays a central role in PD risk, standing out in terms of the relevant inflammation in the progression of the disease. However, little is known about the impact of genetic variants of cytokines related to immune response in the development and progression of PD in MM patients. Herein, after determining the gene frequencies of functional variants in IL-10 IL-13 IL-17A IL-17A IL-10 IL-10 IL-10 is an anti-inflammatory cytokine that exerts a neuroprotective effect that is mediated through its receptor via the JAK/STAT3 pathway. This activation leads to a decrease in the cleavage of caspase-3 and caspase-9, which in turn reduces neuronal death in models of PD. IL-10 has been shown to promote increased primary neurite length in dopaminergic neurons [ 43 Functional genetic variants at positions c.-1082 (rs1800896), c.-819 (rs1800871), and c.-592 (rs1800872) in the IL-10 38 44 45 46 47 48 Our results showed differences in allele and genotype frequencies of IL-10 p p p The CC carriers of the IL-10 p 49 50 51 38 IL-10_ IL-10_ p IL-10 Some researchers have investigated a possible relationship between IL-10 17 52 IL-10 10 53 IL-10 IL-17 plays a dual role in PD, not only promoting inflammation but also directly contributing to neurodegeneration. Experimental models have demonstrated that IL-17 induces neuronal death via IL-17/IL-17R signaling and activation of the NF-κB pathway, whereas blocking IL-17 or its receptor markedly reduces neuronal death [ 7 IL-17A IL-17A 54 55 56 IL-17A IL-17A IL-17A IL-17A 28 IL-17A 28 p IL-17A 57 IL-17A IL-17A 36 Nevertheless, the above observed associations of IL-10 IL-17A There is evidence that genetic variants of IL-13 58 59 IL-13_ p Table 2 The combined activity of IL-10, IL-17A, and IL-13 is context-dependent, suggesting complex and sometimes contradictory roles, with some interactions exacerbating or dampening inflammation in PD. Researchers are currently studying whether inflammation itself is a cause of neurodegeneration or a response to an already-ongoing process that contributes to the development of PD. Previous work of our group reported that plasma IL-17A levels in untreated PD patients were significantly different to those in controls ( p 30 p 41 IL-10 IL-17A Our findings indicate that the IL-10 IL-10 IL-17A + 8 9 26 Neurodegeneration and neuroinflammation are two intertwined mechanisms contributing to PD pathophysiology, and it is not clearly established if these processes differ according to disease duration [ 60 60 61 62 It has been proposed that immune cell ageing may synergize with a genetic predisposition background and environmental stressors to accelerate PD [ 4 63 64 We are aware of several limitations of our study, including the small sample size of participants with clinical data and an unbalanced sample of controls; thus, these limitations have hindered additional statistical analysis. In this sense, our findings should be interpreted with caution as preliminary data. Because the MM population has a distinct genetic background [ 65 IL-10 IL-17A 5. Conclusions This study suggests that genetic variants in IL-10 IL-17A Acknowledgments Authors acknowledge Diego Curiel-Pérez for technical support. Disclaimer/Publisher’s Note: Supplementary Materials The following supporting information can be downloaded at: https://www.mdpi.com/article/10.3390/life15091480/s1 66 67 68 69 70 71 72 73 Author Contributions Conceptualization, N.M.-J. and L.V.A.-P.; methodology, N.M.-J., L.V.A.-P. and A.O.-V.; software, A.O.-V.; formal analysis, A.O.-V.; investigation, M.L.-L., N.M.-J. and A.O.-V.; resources, N.M.-J., L.V.A.-P. and A.O.-V.; writing—original draft preparation, A.O.-V. and N.M.-J.; writing—review and editing, N.M.-J., L.V.A.-P., M.L.-L. and A.O.-V.; visualization, A.O.-V.; supervision, N.M.-J. and L.V.A.-P.; project administration, N.M.-J. and A.O.-V.; funding acquisition, A.O.-V. All authors have read and agreed to the published version of the manuscript. Institutional Review Board Statement The study was conducted in accordance with the Declaration of Helsinki and approved by the Research and Ethics Committees of the Instituto Nacional de Neurología y Neurocirugía (protocol codes: INNN_38/19 and INNN_95/14, and dates of approval: 19 August 2019 and 20 October 2014, respectively). Informed Consent Statement Informed consent was obtained from all subjects involved in the study. Written informed consent has been obtained from the patients to publish this paper. Data Availability Statement The data presented in this study are available on request from the corresponding author due to ethical issues. Conflicts of Interest The authors declare no conflicts of interest. References 1. Kouli A. Torsney K.M. Kuan W.L. Parkinson’s Disease: Etiology, Neuropathology, and Pathogenesis Parkinson’s Disease: Pathogenesis and Clinical Aspects Stoker T.B. Greenland J.C. Codon Publications Singapore 2018 10.15586/codonpublications.parkinsonsdisease.2018.ch1 30702842 2. Lees A.J. Hardy J. Revesz T. Parkinson’s disease Lancet 2009 373 2055 2066 10.1016/S0140-6736(09)60492-X 19524782 3. Pajares M. IRojo A. Manda G. Boscá L. Cuadrado A. Inflammation in Parkinson’s Disease: Mechanisms and Therapeutic Implications Cells 2020 9 1687 10.3390/cells9071687 32674367 PMC7408280 4. Tansey M.G. Wallings R.L. Houser M.C. Herrick M.K. Keating C.E. Joers V. Inflammation and immune dysfunction in Parkinson disease Nat. Rev. Immunol. 2022 22 657 673 10.1038/s41577-022-00684-6 35246670 PMC8895080 5. Li C. Ke B. Chen J. Xiao Y. Wang S. Jiang R. Zheng X. Lin J. Huang J. Shang H. Systemic inflammation and risk of Parkinson’s disease: A prospective cohort study and genetic analysis Brain Behav. Immun. 2024 117 447 455 10.1016/j.bbi.2024.02.013 38336023 6. Liu T.W. Chen C.M. Chang K.H. Biomarker of Neuroinflammation in Parkinson’s Disease Int. J. Mol. Sci. 2022 23 4148 10.3390/ijms23084148 35456966 PMC9028544 7. Sommer A. Marxreiter F. Krach F. Fadler T. Grosch J. Maroni M. Graef D. Eberhardt E. Riemenschneider M.J. Yeo G.W. Th17 Lymphocytes Induce Neuronal Cell Death in a Human iPSC-Based Model of Parkinson’s Disease Cell Stem Cell 2019 24 1006 10.1016/j.stem.2019.04.019 31173705 8. Chen Y. Qi B. Xu W. Ma B. Li L. Chen Q. Qian W. Liu X. Qu H. Clinical correlation of peripheral CD4 + Mol. Med. Rep. 2015 12 6105 6111 10.3892/mmr.2015.4136 26239429 9. Kustrimovic N. Comi C. Magistrelli L. Rasini E. Legnaro M. Bombelli R. Aleksic I. Blandini F. Minafra B. Riboldazzi G. Parkinson’s disease patients have a complex phenotypic and functional Th1 bias: Cross-sectional studies of CD4 + J. Neuroinflamm. 2018 15 205 10.1186/s12974-018-1248-8 PMC6044047 30001736 10. Qin X.Y. Zhang S.P. Cao C. Loh Y.P. Cheng Y. Aberrations in Peripheral Inflammatory Cytokine Levels in Parkinson Disease: A Systematic Review and Meta-analysis JAMA Neurol. 2016 73 1316 1324 10.1001/jamaneurol.2016.2742 27668667 11. Koziorowski D. Tomasiuk R. Szlufik S. Friedman A. Inflammatory cytokines and NT-proCNP in Parkinson’s disease patients Cytokine 2012 60 762 766 10.1016/j.cyto.2012.07.030 22910321 12. Rota E. Bellone G. Rocca P. Bergamasco B. Emanuelli G. Ferrero P. Increased intrathecal TGF-beta1, but not IL-12, IFN-gamma and IL-10 levels in Alzheimer’s disease patients Neurol. Sci. Off. J. Ital. Neurol. Soc. Ital. Soc. Clin. Neurophysiol. 2006 27 33 39 10.1007/s10072-006-0562-6 16688597 13. Bialecka M. Klodowska-Duda G. Kurzawski M. Slawek J. Opala G. Bialecki P. Safranow K. Droździk M. Interleukin-10 gene polymorphism in Parkinson’s disease patients Arch. Med. Res. 2007 38 858 863 10.1016/j.arcmed.2007.06.006 17923267 14. Bialecka M. Klodowska-Duda G. Kurzawski M. Slawek J. Gorzkowska A. Opala G. Bialecki P. Sagan L. Droździk M. Interleukin-10 (IL10) and tumor necrosis factor alpha (TNF) gene polymorphisms in Parkinson’s disease patients Park. Relat. Disord. 2008 14 636 640 10.1016/j.parkreldis.2008.02.001 18362084 15. Li D. He Q. Li R. Xu X. Chen B. Xie A. Interleukin-10 promoter polymorphisms in Chinese patients with Parkinson’s disease Neurosci. Lett. 2012 513 183 186 10.1016/j.neulet.2012.02.033 22387064 16. Shu L. Liang D. Pan H. Xu Q. Yan X. Tang B. Sun Q. Gastrointestinal Dysfunctions Are Associated with IL-10 Park. Dis. 2018 2018 5908359 10.1155/2018/5908359 PMC6304865 30631418 17. Pascale E. Passarelli E. Purcaro C. Vestri A.R. Fakeri A. Guglielmi R. Passarelli F. Meco G. Lack of association between IL-1β, TNF-α, and IL-10 gene polymorphisms and sporadic Parkinson’s disease in an Italian cohort Acta Neurol. Scand. 2011 124 176 181 10.1111/j.1600-0404.2010.01441.x 20880267 18. Jin J. Wu P. Li W. Shi J. Chen J. Li R. Tan S. Interleukin-10-1082A/G and -592C/A polymorphisms with risk of Parkinson’s disease: A meta-analysis Int. J. Neurosci. 2014 124 852 858 10.3109/00207454.2014.880910 24397502 19. Liu Z. Guo J. Wang Y. Li K. Kang J. Wei Y. Sun Q. Xu Q. Xu C. Yan X. Lack of association between IL-10 and IL-18 gene promoter polymorphisms and Parkinson’s disease with cognitive impairment in a Chinese population Sci. Rep. 2016 6 19021 10.1038/srep19021 26830320 PMC4735643 20. Tong Y. Jiang S. Cai L. Guan X. Hou S. Wang Z. Lu Q. Liu J. Identification of Functional Genetic Polymorphisms at IL-10 Promoter Region and their Association with Risk of Ischemic Stroke in Chinese Han Population J. Nutr. Health Aging 2018 22 779 784 10.1007/s12603-018-1012-x 30080219 21. Sun X. Gu R. Bai J. Differentiation and regulation of CD4 + Cell. Mol. Life Sci. CMLS 2024 81 352 10.1007/s00018-024-05402-0 39153043 PMC11335276 22. Mori S. Maher P. Conti B. Neuroimmunology of the Interleukins 13 and 4 Brain Sci. 2016 6 18 10.3390/brainsci6020018 27304970 PMC4931495 23. Liu Z. Huang Y. Cao B.B. Qiu Y.H. Peng Y.P. Th17 Cells Induce Dopaminergic Neuronal Death via LFA-1/ICAM-1 Interaction in a Mouse Model of Parkinson’s Disease Mol. Neurobiol. 2017 54 7762 7776 10.1007/s12035-016-0249-9 27844285 24. Liu Z. Qiu A.W. Huang Y. Yang Y. Chen J.N. Gu T.T. Cao B.B. Qiu Y.H. Peng Y.P. IL-17A exacerbates neuroinflammation and neurodegeneration by activating microglia in rodent models of Parkinson’s disease Brain Behav. Immun. 2019 81 630 645 10.1016/j.bbi.2019.07.026 31351185 25. Chen J. Liu X. Zhong Y. Interleukin-17A: The Key Cytokine in Neurodegenerative Diseases Front. Aging Neurosci. 2020 12 566922 10.3389/fnagi.2020.566922 33132897 PMC7550684 26. Álvarez-Luquín D.D. Arce-Sillas A. Leyva-Hernández J. Sevilla-Reyes E. Boll M.C. Montes-Moratilla E. Vivas-Almazán V. Pérez-Correa C. Rodríguez-Ortiz U. Espinoza-Cárdenas R. Regulatory impairment in untreated Parkinson’s disease is not restricted to Tregs: Other regulatory populations are also involved J. Neuroinflamm. 2019 16 212 10.1186/s12974-019-1606-1 PMC6849192 31711508 27. Rocha N.P. Assis F. Scalzo P.L. Vieira É.L.M. Barbosa I.G. de Souza M.S. Christo P.P. Reis H.J. Teixeira A.L. Reduced Activated T Lymphocytes (CD4 + + Mol. Neurobiol. 2018 55 1488 1497 10.1007/s12035-017-0404-y 28176275 28. Wang W. Deng G. Zhang G. Yu Z. Yang F. Chen J. Cai Y. Werz O. Chen X. Genetic polymorphism rs8193036 of IL17A is associated with increased susceptibility to pulmonary tuberculosis in Chinese Han population Cytokine 2020 127 154956 10.1016/j.cyto.2019.154956 31864094 29. Cui H. Wang N. Li H. Bian Y. Wen W. Kong X. Wang F. The dynamic shifts of IL-10-producing Th17 and IL-17-producing Treg in health and disease: A crosstalk between ancient “Yin-Yang” theory and modern immunology Cell Commun. Signal. CCS 2024 22 99 10.1186/s12964-024-01505-0 38317142 PMC10845554 30. Newcomb D.C. Boswell M.G. Huckabee M.M. Goleniewska K. Dulek D.E. Reiss S. Lukacs N.W. Kolls J.K. Peebles R.S. Jr. IL-13 regulates Th17 secretion of IL-17A in an IL-10-dependent manner J. Immunol. 2012 188 1027 1035 10.4049/jimmunol.1102216 22210911 PMC3262924 31. Álvarez-Luquín D.D. Guevara-Salinas A. Arce-Sillas A. Espinosa-Cárdenas R. Leyva-Hernández J. Montes-Moratilla E.U. Adalid-Peralta L. Increased Tc17 cell levels and imbalance of naïve/effector immune response in Parkinson’s disease patients in a two-year follow-up: A case control study J. Transl. Med. 2021 19 378 10.1186/s12967-021-03055-2 34488776 PMC8422782 32. Zhao Y. Zhang X. Guo N. Tian D. Zhang C. Mu C. Han C. Zhu R. Zhang J. Liu X. Genetically Predicted Levels of Circulating Inflammatory Cytokines and the Risk and Age at Onset of Parkinson’s Disease: A Two-Sample Mendelian Randomization Study Front. Aging Neurosci. 2022 14 811059 10.3389/fnagi.2022.811059 35299944 PMC8923644 33. Vargas-Alarcon G. Ramírez-Bello J. Juárez-Cedillo T. Ramírez-Fuentes S. Carrillo-Sánchez S. Fragoso J.M. Distribution of the IL-1RN, IL-6, IL-10, INF-γ, and TNF-α Gene Polymorphisms in the Mexican Population Genet. Test. Mol. Biomark. 2012 16 1246 1253 10.1089/gtmb.2012.0100 PMC3468120 22971140 34. Villarreal-Martínez A. Gallardo-Blanco H. Cerda-Flores R. Torres-Muñoz I. Gómez-Flores M. Salas-Alanís J. Ocampo-Candiani J. Martínez-Garza L. Candidate gene polymorphisms and risk of psoriasis: A pilot study Exp. Ther. Med. 2016 11 1217 1222 10.3892/etm.2016.3066 27073425 PMC4812537 35. Ambrocio-Ortiz E. Galicia-Negrete G. Pérez-Rubio G. Escobar-Morales A.J. Abarca-Rojano E. Del Angel-Pablo A.D. Castillejos-López M.D.J. Falfán-Valencia R. Single Nucleotide and Copy-Number Variants in IL4 and IL13 Are Not Associated with Asthma Susceptibility or Inflammatory Markers: A Case-Control Study in a Mexican-Mestizo Population Diagnostics 2020 10 273 10.3390/diagnostics10050273 32366038 PMC7277638 36. Vargas-Alarcón G. Angeles-Martínez J. Villarreal-Molina T. Alvarez-León E. Posadas-Sánchez R. Cardoso-Saldaña G. Ramírez-Bello J. Pérez-Hernández N. Juárez-Rojas J.G. Rodríguez-Pérez J.M. Interleukin-17A gene haplotypes are associated with risk of premature coronary artery disease in Mexican patients from the Genetics of Atherosclerotic Disease (GEA) study PLoS ONE 2015 10 e0114943 10.1371/journal.pone.0114943 25615631 PMC4304820 37. Ponce-Gallegos M.A. Pérez-Rubio G. Ambrocio-Ortiz E. Partida-Zavala N. Hernández-Zenteno R. Flores-Trujillo F. García-Gómez L. Hernández-Pérez A. Ramírez-Venegas A. Falfán-Valencia R. Genetic variants in IL17A and serum levels of IL-17A are associated with COPD related to tobacco smoking and biomass burning Sci. Rep. 2020 10 784 10.1038/s41598-020-57606-6 31964947 PMC6972744 38. Chavarria-Buenrostro L.E. Hernandez-Bello J. Muñoz-Valle J.F. Macias-Barragan J. Hernandez-Carrillo L.B. Topete-Reyes J.F. Parra-Michel R. Ramirez-Dueñas M.G. Sanchez-Hernandez P.E. Pereira-Suarez A.L. IL10 haplotypes are associated with diabetic nephropathy susceptibility in patients from western Mexico J. Clin. Lab. Anal. 2019 33 e22691 10.1002/jcla.22691 30345559 PMC6818616 39. Postuma R.B. Berg D. Stern M. Poewe W. Olanow C.W. Oertel W. Obeso J. Marek K. Litvan I. Lang A.E. MDS clinical diagnostic criteria for Parkinson’s disease Mov. Disord. Off. J. Mov. Disord. Soc. 2015 30 1591 1601 10.1002/mds.26424 26474316 40. Barrett J.C. Fry B. Maller J. Daly M.J. Haploview: Analysis and visualization of LD and haplotype maps Bioinformatics 2005 21 263 265 10.1093/bioinformatics/bth457 15297300 41. Ortega-Vázquez A. Sánchez-Badajos S. Ramírez-García M.Á. Alvarez-Luquín D. López-López M. Adalid-Peralta L.V. Monroy-Jaramillo N. Longitudinal Changes in Mitochondrial DNA Copy Number and Telomere Length in Patients with Parkinson’s Disease Genes 2023 14 1913 10.3390/genes14101913 37895262 PMC10606744 42. Wickham H. Chang W. Henry L. Pedersen T.L. Takahashi K. Wilke C. Woo K. Yutani H. Dunnington D. van den Brand T. ggplot2: Create Elegant Data Visualisations Using the Grammar of Graphics [Internet] 2024 Available online: https://cran.r-project.org/web/packages/ggplot2/index.html (accessed on 19 November 2024) 43. Guevara-Salinas A. Netzahualcoyotzi C. Álvarez-Luquín D.D. Pérez-Figueroa E. Sevilla-Reyes E.E. Castellanos-Barba C. Vega-Ángeles V.T. Terán-Dávila E. Estudillo E. Velasco I. Treating activated regulatory T cells with pramipexole protects human dopaminergic neurons from 6-OHDA-induced degeneration CNS Neurosci. Ther. 2024 30 e14883 10.1111/cns.14883 39097919 PMC11298200 44. Suárez A. Castro P. Alonso R. Mozo L. Gutiérrez C. Interindividual variations in constitutive interleukin-10 messenger RNA and protein levels and their association with genetic polymorphisms Transplantation 2003 75 711 717 10.1097/01.TP.0000055216.19866.9A 12640314 45. Pavón-Romero G.F. Pérez-Rubio G. Ramírez-Jiménez F. Ambrocio-Ortiz E. Merino-Camacho C.R. Falfán-Valencia R. Teran L.M. IL10 Biomolecules 2020 10 104 10.3390/biom10010104 31936183 PMC7023146 46. Pasvenskaite A. Liutkeviciene R. Gedvilaite G. Vilkeviciute A. Liutkevicius V. Uloza V. Impact of IL-10 Cancer Genom. Proteom. 2021 18 53 65 10.21873/cgp.20241 PMC7796822 33419896 47. Martínez-Gómez L.E. Oropeza-Vélez C.I. Almonte-Becerril M. Chavez-Galan L. Martinez-Armenta C. Vidal-Vázquez R.P. Ramírez-Hinojosa J.P. Vázquez-Cárdenas P. Gómez-Martín D. Vargas-Alarcón G. Association of pro-inflammatory and anti-inflammatory cytokine polymorphisms with COVID-19 severity in unvaccinated patients Front. Immunol. 2025 16 1641285 10.3389/fimmu.2025.1641285 40881695 PMC12380819 48. Dzamko N. Cytokine activity in Parkinson’s disease Neuronal Signal. 2023 7 NS20220063 10.1042/NS20220063 38059210 PMC10695743 49. Liu N. Lu H. Tao F. Guo T. Liu C. Cui B. Ning G. An association of interleukin-10 gene polymorphisms with Graves’ disease in two Chinese populations Endocrine 2011 40 90 94 10.1007/s12020-011-9444-7 21424183 50. Posadas-Sánchez R. Angeles-Martínez J. Pérez-Hernández N. Rodríguez-Pérez J.M. López-Bautista F. Flores-Dominguez C. Fragoso J.M. Posadas-Romero C. Vargas-Alarcón G. The IL-10-1082 (rs1800896) G allele is associated with a decreased risk of developing premature coronary artery disease and some IL-10 polymorphisms were associated with clinical and metabolic parameters. The GEA study Cytokine 2018 106 12 18 10.1016/j.cyto.2018.02.028 29525679 51. Garcia-Garduño T.C. Padilla-Gutiérrez J.R. Aceves-Ramírez M. Parra-Reyna B. Flores-Salinas H.E. Valdes-Alvarado E. Becerra-Loaiza D.S. Quintero-Ramos A. Roa-Bruzón I.Y. de la Cruz A. IL10 promoter variants are associated with gene expression but they are not markers of susceptibility to acute coronary syndrome Sci. Rep. 2024 14 13196 10.1038/s41598-024-64097-2 38851847 PMC11162414 52. Chu K. Zhou X. Luo B.Y. Cytokine gene polymorphisms and Parkinson’s disease: A meta-analysis Can. J. Neurol. Sci. 2012 39 58 64 10.1017/s0317167100012695 22384497 53. Porro C. Cianciulli A. Panaro M.A. The Regulatory Role of IL-10 in Neurodegenerative Diseases Biomolecules 2020 10 1017 10.3390/biom10071017 32659950 PMC7407888 54. Ruddy M.J. Wong G.C. Liu X.K. Yamamoto H. Kasayama S. Kirkwood K.L. Gaffen S.L. Functional cooperation between interleukin-17 and tumor necrosis factor-alpha is mediated by CCAAT/enhancer-binding protein family members J. Biol. Chem. 2004 279 2559 2567 10.1074/jbc.M308809200 14600152 55. Huang H.T. Lu Y.L. Wang R. Qin H.M. Wang C.F. Wang J.L. Xiang Y. Guo J. Lan Y. Wei Y.S. The association of IL-17A polymorphisms with IL-17A serum levels and risk of ischemic stroke Oncotarget 2017 8 103499 103508 10.18632/oncotarget.21498 29262579 PMC5732745 56. Tang H. Pei H. Xia Q. Tang Y. Huang J. Huang J. Pei F. Role of gene polymorphisms/haplotypes and serum levels of interleukin-17A in susceptibility to viral myocarditis Exp. Mol. Pathol. 2018 104 140 145 10.1016/j.yexmp.2018.03.002 29530464 57. Lang X. Liu W. Hou Y. Zhao W. Yang X. Chen L. Yan Q. Cheng W. IL-17A polymorphism (rs2275913) and levels are associated with preeclampsia pathogenesis in Chinese patients BMC Med. Genom. 2021 14 5 10.1186/s12920-020-00840-8 PMC7789345 33407460 58. Aguirre C.A. Concetta Morale M. Peng Q. Sanchez-Alavez M. Cintrón-Colón R. Feng K. Fazelpour S. Maher P. Conti B. Two single nucleotide polymorphisms in IL13 and IL13RA1 from individuals with idiopathic Parkinson’s disease increase cellular susceptibility to oxidative stress Brain Behav. Immun. 2020 88 920 924 10.1016/j.bbi.2020.04.007 32276028 PMC9012133 59. Alvarez-Rodríguez L. López-Hoyos M. Carrasco-Marín E. Mata C. Calvo-Alén J. Aurrecoechea E. Blanco R. Ruiz T. Muñoz Cacho P. Villa I. Analysis of the rs20541 (R130Q) polymorphism in the IL-13 gene in patients with elderly-associated chronic inflammatory diseases Reumatol. Clin. 2012 8 321 327 10.1016/j.reumae.2012.07.003 22749024 60. Di Lazzaro G. Picca A. Boldrini S. Bove F. Marzetti E. Petracca M. Piano C. Bentivoglio A.R. Calabresi P. Differential profiles of serum cytokines in Parkinson’s disease according to disease duration Neurobiol. Dis. 2024 190 106371 10.1016/j.nbd.2023.106371 38061398 61. Kouli A. Williams-Gray C.H. Timing Is Everything: The T-Cell Response to α-Synuclein Is Maximal in Early Parkinson’s Mov. Disord. Off. J. Mov. Disord. Soc. 2020 35 1137 10.1002/mds.28122 32557803 62. Lindestam Arlehamn C.S. Dhanwani R. Pham J. Kuan R. Frazier A. Rezende Dutra J. Phillips E. Mallal S. Roederer M. Marder K.S. α-Synuclein-specific T cell reactivity is associated with preclinical and early Parkinson’s disease Nat. Commun. 2020 11 1875 10.1038/s41467-020-15626-w 32313102 PMC7171193 63. Wang Q. Liu Y. Zhou J. Neuroinflammation in Parkinson’s disease and its potential as therapeutic target Transl. Neurodegener. 2015 4 19 10.1186/s40035-015-0042-0 26464797 PMC4603346 64. Kim D.J. Rodriguez-Salgado A.M. Llibre-Rodriguez J.J. Acosta I. Sosa A.L. Acosta D. Jimenez-Velasquez I.Z. Guerra M. Salas A. Jeyachandran C. Burden of Parkinsonism and Parkinson’s Disease on Health Service Use and Outcomes in Latin America J. Park. Dis. 2023 13 1199 1211 10.3233/JPD-230114 37742660 PMC10657702 65. Juárez-Cedillo T. Zuñiga J. Acuña-Alonzo V. Pérez-Hernández N. Rodríguez-Pérez J.M. Barquera R. Gallardo G.J. Sánchez-Arenas R. García-Peña M.d.e.l.C. Granados J. Genetic admixture and diversity estimations in the Mexican Mestizo population from Mexico City using 15 STR polymorphic markers Forensic Sci. Int. Genet. 2008 2 e37 e39 10.1016/j.fsigen.2007.08.017 19083813 66. Iyer S.S. Cheng G. Role of interleukin 10 transcriptional regulation in inflammation and autoimmune disease Crit. Rev. Immunol. 2012 32 23 63 10.1615/CritRevImmunol.v32.i1.30 22428854 PMC3410706 67. Abdalla M.A. Hamdan H.Z. IL13 Mol. Biol. Res. Commun. 2025 14 27 30 10.22099/mbrc.2024.50865.2017 39744511 PMC11624611 68. Grunwald C. Adamska-Patruno E. Wawrusiewicz-Kurylonek N. Czarnowska A. Snarska K. Dardzińska-Głębocka A. Kapica-Topczewska K. Mirończuk A. Bazylewicz M. Kochanowicz J. Multiple sclerosis susceptibility may be associated with the coding rs20541 (R130Q) IL-13 gene polymorphism in the Polish population Sci. Rep. 2023 13 22083 10.1038/s41598-023-49615-y 38086930 PMC10716410 69. Xie Z. Ding X. Wang Y. Zhang M. The rs2275913 polymorphism of the interleukin-17A gene is associated with the risk of ovarian endometriosis J. Obstet. Gynaecol. 2023 43 2199852 10.1080/01443615.2023.2199852 37066601 70. Espinoza J.L. Takami A. Nakata K. Onizuka M. Kawase T. Akiyama H. Miyamura K. Morishima Y. Fukuda T. Kodera Y. A genetic variant in the IL-17 promoter is functionally associated with acute graft-versus-host disease after unrelated bone marrow transplantation PLoS ONE 2011 6 e26229 10.1371/journal.pone.0026229 22028838 PMC3197629 71. Borilova Linhartova P. Kastovsky J. Lucanova S. Bartova J. Poskerova H. Vokurka J. Fassmann A. Kankova K. Izakovicova Holla L. Interleukin-17A Gene Variability in Patients with Type 1 Diabetes Mellitus and Chronic Periodontitis: Its Correlation with IL-17 Levels and the Occurrence of Periodontopathic Bacteria Mediat. Inflamm. 2016 2016 2979846 10.1155/2016/2979846 26924897 PMC4748108 72. Nie K. Zhang Y. Gan R. Wang L. Zhao J. Huang Z. Tang H. Wang L. Polymorphisms in immune/inflammatory cytokine genes are related to Parkinson’s disease with cognitive impairment in the Han Chinese population Neurosci. Lett. 2013 541 111 115 10.1016/j.neulet.2013.02.024 23485736 73. Liu T. Yang L. Lv X. Zuo C. Jia C. Yang Z. Fan C. Chen H. Cumulative evidence for associations between genetic variants in interleukin 17 family gene and risk of human diseases Front. Immunol. 2022 13 1008184 10.3389/fimmu.2022.1008184 36300118 PMC9589504 Figure 1 Haplotype block structure of IL-10 Figure 2 Box plots showing the plasma IL-10 levels according to its haplotypes, H1, H2, and H3 (see text), in ( A B p Figure 3 Multivariate correlation analysis between inflammatory indexes (NLI, SII) at the baseline, and plasma IL-10 levels at the baseline (t0) and one year after DRT (t1) in the PD patients of the clinical group ( A B p p p p life-15-01480-t001_Table 1 Table 1 Demographic, biochemical, and clinical characteristics of patients with Parkinson’s disease and healthy volunteers. Characteristics Treated PD Patients (n = 239) Controls (n = 84)  Total Male Female Total Male Female Sex (%) 100 53.16 46.84 100 45.45 54.54 Age in years, mean ± SD 59.15 ± 12.63 58.4 ± 12.24 60.05 ± 13.05 47.87 ± 18.54 45.21 ± 17.91 44.68 ± 18.79  Untreated PD Patients in the Clinical Group Controls in the Clinical Group  Total Male Female Total Male Female Sex (%) 100 61 39 100 52 48 Age in years, mean ± SD 60.93 ± 10.60 59.56 ± 10.53 63.00 ± 10.82 55.73 ± 10.20 54.58 ± 8.39 57.00 ± 12.38 Weight (Kg), mean ± SD 70.71 ± 13.13 75.82 ± 12.07 62.36 ± 10.55 69.21 ± 8.96 70.62 ± 7.17 67.52 ± 10.90 Height (cm), mean ± SD 160.07 ± 11.29 166.11 ± 7.53 150.18 ± 9.36 159.77 ± 8.60 165.08 ± 6.17 153.4 ± 6.58 BMI, mean ± SD 27.55 ± 4.74 27.26 ± 13.02 28.02 ± 6.36 26.85± 3.89 26.13 ± 3.21 27.72 ± 4.60 Cholesterol (mg/dL), mean ± SD 189.24 ± 34.35 176.36 ± 32.75 209.87 ± 26.88 217.35 ± 55.95 213.07 ± 49.05 222.49 ± 65.65 Triglycerides (mg/dL), mean ± SD 140.23 ± 55.02 (47.35–293.4) 127.17 ± 46.25 162.42 ± 63.83 162.17 ± 63.02 166.11 ± 73.31 157.45 ± 51.51 Smokers, n (%) 3 (10) 3 (16.7) 0 9 (40.9) 8 (66.7) 1 (10) Alcohol consumers, n (%) 10 (33.3) 9 (50) 1 (8.3) 10 (45.5) 8 (66.7) 2 (20) Uric acid (mg/dL), mean ± SD 5.77 ± 1.37 6.40 ± 1.30 4.70 ± 0.60 6.13 ± 1.50 6.69 ± 1.46 5.47 ± 1.31 IL-10 (pg/mL), mean ± SD 2.95 ± 2.02 2.44 ± 1.79 3.71 ± 2.18 2.68 ± 2.54 3.12 ± 3.27 2.17 ± 1.20 IL-13 (pg/mL), mean ± SD 4.38 ± 7.34 3.74 ± 5.30 5.86 ± 8.99 0 0 0 IL-17A (pg/mL), mean ± SD 1341.87 ± 1365.9 (73.4–3904.4) 1363.9 ± 1424.55 (73.4–3904.4) 1308.81 ± 1334.30 2250.71 ± 1365.93 2354.57 ± 1370.27 2126.1 ± 1423.70 NLI, mean ± SD 1.68 ± 0.46 1.71 ± 0.50 1.63 ± 0.41 1.99 ± 1.56 1.81 ± 0.58 2.26 ± 2.22 SII, mean ± SD 399.31 ± 176.35 387.82 ± 154.33 418.11 ± 214.38 492.84 ± 454.88 415.91 ± 186.73 554.47 ± 688.78 Clinical Scales for the Staging of the Functional Disability of Patients HOEN and YAHR scale, median 2 2 2 NA NA NA MDS-UPDRS I, mode 4 4 4 NA NA NA MDS-UPDRS II, mode 10 10 15 NA NA NA MDS-UPDRS III, mode 38 38 13 NA NA NA MDS-UPDRS IV 0 0 0 NA NA NA MDS-UPDRS Total, mode 52 47 52 NA NA NA Schwab and England scale, mode 90 90 90 100 100 100 Beck’s Depression Inventory, mode 10 10 10 2.5 1.5 7 BMI, body mass index, was calculated using a participant’s height and weight. NA: not applicable. NLI: neutrophil/lymphocyte inflammation index. SII = systemic inflammatory index. MDS-UPDRS I: Non-Motor Experiences of Daily Living. MDS-UPDRS II: Motor Experiences of Daily Living. MDS-UPDRS III: Motor Examination. MDS-UPDRS IV: Motor Complications. Schwab and England (Activities of Daily Living) scale. Categorical characteristics include percentages; continuous variables are presented as means with standard deviations and ranges. Significant comparisons ( p life-15-01480-t002_Table 2 Table 2 Allele and genotype frequency distribution for genetic variants in patients with Parkinson’s disease and healthy volunteers. Genetic Characteristic Total Group of PD Patients Total Group of Controls p Gene Variant ID Genotype/Allele n Frequency CI 95% n Frequency CI 95% p 1 p 2 p 3  IL-10 rs1800896 TT 118 0.54 0.43–0.56 42 0.50 0.39–0.61 1.00 0.22 0.18 TC 93 0.39 0.33–0.45 34 0.40 0.30–0.52 0.79 0.83 0.65 CC 18 0.08 0.05–0.12 8 0.10 0.04–0.18 0.64 0.24 0.19 T 349 0.73 0.69–0.77 118 0.70 0.63–0.77 0.48 0.18 0.14 C 129 0.27 0.23–0.31 50 0.30 0.23–0.37 rs1800872 TT 45 0.19 0.14–0.24 13 0.15 0.09–0.25 0.62  <0.01  <0.01 TG 103 0.43 0.37–0.50 46 0.55 0.44–0.66 0.07  <0.01  <0.01 GG 91 0.38 0.32–0.45 25 0.30 0.20–0.41 0.18 0.29 1.00 T 193 0.40 0.36–0.45 72 0.43 0.35–0.51 0.58  <0.01  <0.01 G 285 0.60 0.55–0.64 96 0.57 0.49–0.65  IL-13 rs20541 AA 82 0.34 0.28–0.41 24 0.29 0.19–0.39 0.35 0.13 0.06 AG 110 0.46 0.40–0.53 42 0.50 0.39–0.61 0.61 0.84 0.51 GG 47 0.20 0.15–0.25 18 0.21 0.13–0.32 0.75 0.18 0.15 A 278 0.58 0.54–0.63 90 0.54 0.46–0.61 0.32  0.05  0.03 G 210 0.42 0.39–0.49 78 0.46 0.39–0.54  IL-17A rs2275913 GG 162 0.68 0.61–0.74 58 0.69 0.58–0.79 0.89 0.83 0.81 GA 66 0.28 0.22–0.34 23 0.27 0.18–0.38 1.00 0.82 0.80 AA 11 0.04 0.02–0.08 3 0.04 0.01–0.10 1.00 1.00 1.00 G 390 0.82 0.78–0.85 139 0.83 0.76–0.88 0.82 0.85 0.84 A 88 0.18 0.15–0.22 29 0.17 0.12–0.24 rs8193036 CC 33 0.14 0.10–0.19 3 0.04 0.01–0.10  <0.01 1.00 0.16 CT 70 0.29 0.24–0.36 23 0.27 0.18–0.38 0.78 0.65 0.47 TT 136 0.57 0.50–0.63 58 0.69 0.58–0.79 0.05 0.87 0.36 C 136 0.28 0.24–0.33 29 0.17 0.12–0.24  <0.01 1.00 0.08 T 342 0.72 0.67–0.76 139 0.83 0.76–0.88 Variant ID, from the dbSNP database. These identifiers are assigned to unique variations within a reference genome. PD: Parkinson’s disease. n: number. CI: confidence interval. Untreated patients (n = 26) and controls (n = 21) in the clinical group. Significant p p 1 p 2 p 3 p life-15-01480-t003_Table 3 Table 3 Analysis of genotypes, inflammation indexes, and plasma levels of cytokines between untreated PD patients and controls in the clinical group. Genetic Characteristic Untreated PD Patients in the Clinical Group (n = 26) Controls in the Clinical Group (n = 21) Gene Variant ID Genotype n NLI SII † ‡ n NLI SII † ‡  IL-10 rs1800896 TT 17  2.26 (0.96) 479.57 2.79 2.87 8 2.2 538.62 2.55 2.41 TC 9 1.56 409.23 3.72 3.51 8 2.08 540.96 3.31 4.39 CC 0 --- --- --- — 5 1.2 349.33 1.98 2.24 rs1800872 TT 15 2.12  491.62 (216.80) 2.84 2.99 5 2.79 743.09 2.86 2.46 TG 4 1.79 337.34 7.913 5.47 10 1.93 449.77 1.96 4.52 GG 7 2.07 437.23 3.64 2.64 6 1.27 361.71 3.82 2.06 Diplotype TT-TT 12 2.22 500.32 2.88 3.02 4 3.10  273.89 (20.34)  3.55 (0.66) 3.19 TT-TG 2 1.79 337.34 4.79 4.027 4 1.38 259.99 1.55 2.03 TT-GG 3 2.9 518.08 1.13 1.58 0 NA NA NA NA TC-TT 3 1.62 448.10 2.68 2.81 1 1.54 446.45 0.08 1.74 TC-TG 2 ND ND 1.66 ND 6 2.29  576.28 (110.71) 2.22 3.87 TC-GG 4  1.52 (0.12) 383.32 5.52 4.22 1 1.37 423.61 13.02 10.78 CC-GG 0 NA NA NA NA 5 1.25 349.33 1.978 2.24  IL-13 rs20541 AA 13 1.76 356.92  5.13 (5.16)  0 8 2.43 667.99 0 10.42 AG 11 2.19 465.45 0 3.556 8 1.60 385.54 0 15.54 GG 2 0.98 320.59 0 0 5 1.73 391.03 0 0  IL-17A rs2275913 GG 17 2.08 516.03 1218.34 1741.95 2 1.41 323.90 3472.9 ND GA 8 2.12 446.78 1932.28 1446.14 6 1.71 444.97 1494.23 ND AA 1 1.61 233.36 383.4 585.40 13 2.14 543.52 2412.55 ND rs8193036 CC 3 2.75 516.51 1267.07 2294.73 2 1.77 439.43 2269.4 ND CT 9 2.39 523.60 1456.29 1706.57 5 1.53 382.43 1066.8 ND TT 14  1.68 (0.46) 406.91 1381.11 1274.62 14 2.12 542.3 2671.54 ND Variant ID, from the dbSNP database. These identifiers are assigned to unique variations within a reference genome. PD: Parkinson’s disease. n: number. CI: confidence interval. NLI: neutrophil–lymphocyte index, and SII: systemic immune-inflammation index; both were used to evaluate inflammation. Untreated patients (n = 26) and controls (n = 21) in the clinical group. DRT: dopaminergic replacement therapy. NA: not applicable. ND: not determined. Values in bold showed association (see details in Supplementary Table S3 † ‡ p t ",
  "metadata": {
    "Title of this paper": "Cumulative evidence for associations between genetic variants in interleukin 17 family gene and risk of human diseases",
    "Journal it was published in:": "Life",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12471379/"
  }
}