{
  "title": "Paper_542",
  "abstract": "pmc NPJ Biofilms Microbiomes NPJ Biofilms Microbiomes 3133 npjbiofilms NPJ Biofilms and Microbiomes 2055-5008 Nature Publishing Group PMC12475161 PMC12475161.1 12475161 12475161 41006325 10.1038/s41522-025-00827-2 827 1 Article Intestinal fungal signatures and their impact on immune checkpoint inhibitor efficacy: a multi-cohort meta-analysis Zhang Lei 1 2 3 4 Zhou Ding-Ding 1 2 3 4 Feng Jia 1 2 3 4 Liao Zhi-Jun 1 2 3 4 Shu Xian-Long 1 2 3 4 Yang Rui-Meng 1 2 3 4 Gao Yong-Chao 1 2 3 4 Zhou Hong-Hao 1 2 3 4 Zhang Wei 1 2 3 4 Zou You zouyou@csu.edu.cn 5 Liu Rong liuronghyw@csu.edu.cn 1 2 3 4 1 https://ror.org/00f1zfq44 grid.216417.7 0000 0001 0379 7164 Department of Clinical Pharmacology, Xiangya Hospital, Central South University, 2 https://ror.org/00f1zfq44 grid.216417.7 0000 0001 0379 7164 Institute of Clinical Pharmacology, Central South University, Hunan Key Laboratory of Pharmacogenetics, 3 4 5 https://ror.org/00f1zfq44 grid.216417.7 0000 0001 0379 7164 Information and Network center, Central South University, 26 9 2025 2025 11 478289 188 1 4 2025 1 9 2025 26 09 2025 28 09 2025 28 09 2025 © The Author(s) 2025 2025 https://creativecommons.org/licenses/by-nc-nd/4.0/ Open Access http://creativecommons.org/licenses/by-nc-nd/4.0/ Gut microbiota influence on the effectiveness of immune checkpoint inhibitors (ICIs), but research on fungi—an essential component of the microbiome—has been limited. This multi-cohort meta-analysis of 976 fecal metagenomes across 8 cohorts, representing melanoma, non-small cell lung cancer (NSCLC), and renal cell carcinoma (RCC), identified fungal species associated with ICI efficacy. In melanoma, Rhizophagus irregularis Debaryomyces hansenii Aspergillus avenaceus Aspergillus pseudonomiae Aspergillus Saccharomyces Debaryomyces hansenii Subject terms Metagenomics Microbiota Clinical microbiology the National Key Research and Development Program 2021YFA1301200 the National Scientific Foundation of China No. 82474022, 31801121, 82373961 the Hunan Provincial Science and Technology Innovation Plan Project 2022RC1022 pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement yes pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes issue-copyright-statement © Springer Nature Limited 2025 Introduction Immune checkpoint inhibitors (ICIs), particularly those targeting programmed cell death 1 (PD-1) and programmed cell death ligand 1 (PD-L1), have significantly improved clinical outcomes for cancer patients 1 2 3 4 5 7 8 9 The current landscape of intestinal fungal bioinformatics is limited due to the lack of a comprehensive database for fungal taxonomic sequences 10 11 12 14 15 16 Here, we collected and analyzed fecal shotgun metagenomic data from 8 cohorts prior to treatment with ICIs. After performing quality control and filtering, a total of 976 samples were retained in the subsequent analysis. Logistic regression and Cox regression models were used to identify microbiological species associated with ICI efficacy in different cohorts and cancer types, and meta-analysis was then conducted to pinpoint microbial signatures relevant to cross-cohort comparisons. Recognizing that microorganisms may function as communities, we identified three fungal enterotypes, with the Aspergillus- Saccharomyces Debaryomyces hansenii Results Clinical features and microbiological characteristics The study framework is illustrated in Fig. 1a 2.8 −3.61 1b 17 r 1a 1b, c 2a, b 2c, d 1c 1 2 1d 2 Fig. 1 Sample pre-processing and fungal profiles in responders and non-responders. a b n c d 2 e The relative abundance of the two major fungal phyla, Ascomycota Basidiomycota 1e 3a P 3b 3c–e PERMANOVA P PERMANOVA P PERMANOVA P 4 Microbial signatures associated with ICI efficacy were identified To identify microbial signatures associated with ICI efficacy, logistic regression was performed. Using the criteria of a meta p p 2a 4 5 2a Rhizophagus irregularis 2b P P Aspergillus avenaceus 2c P P 2d 7 Hericium alpestre P P 2e Tilletiopsis washingtonensis P P 2f 6 8 3 5a 6 8 Fig. 2 Fungal signatures associated with response to ICIs in melanoma. a P P b Rhizophagus irregularis c Aspergillus avenaceus d e Hericium alpestre P f Tilletiopsis washingtonensis P In NSCLC, 23 fungi and 38 bacteria (Supplementary Data 9 10 3a 11 12 13 p 3b Aspergillus pseudonomiae P 3c P P P P P 3d Saccharomyces cerevisiae P Fusarium flagelliforme P 3e Schizosaccharomyces japonicus P P Malassezia globosa P P 3f 5b 9 13 Fig. 3 Fungal signatures associated with response to ICIs in NSCLC. a P P b c Aspergillus pseudonomiae d Aspergillus pseudonomiae P e Saccharomyces cerevisiae Fusarium flagelliforme f Schizosaccharomyces japonicus Malassezia globosa P In RCC, the association analysis results may be biased due to the small sample size and low percentage of responders. The associations between microbial abundance, PFS6, and response are detailed in Supplementary Data 14 The correlation of microbial pairs varied among groups of response The presence of microbial interactions is a common phenomenon, so we explore the role of correlations between the bacterial and fungal kingdoms during ICI therapy. Overall, we found that in melanoma, the ecological network was more complex in responders (90 species, 2995 associations) compared to non-responders (90 species, 2149 associations) (Fig. 4a 4b 4a, b 4c 4d Vanrija humicola Tilletiopsis washingtonensis Phanerodontia chrysosporium Pyrenophora seminiperda Faecalibacterium Faecalibacterium prausnitzii Faecalibacterium duncaniae Faecalibaculum rodentium Fig. 4 Coabundance correlations among multi-kingdom species in responders and non-responders. a P b P c P d P We identified significant differences in microbial pairs among responders and non-responders, with 524 pairs in melanoma and 33 pairs in NSCLC (Supplementary Data 15 17 6a 6b P −5 6c, d Colletotrichum asianum Klebsiella oxytoca Fungal enterotypes are associated with the response to ICI therapy Microbes may function as classes or groups, whereas the enterotype is a stable microbial community that remains unaffected by covariates 18 PERMANOVA P 5a Asper_high Sacc_type Asper_low 5b Aspergillus Saccharomyces 5c Asper_low 5d Fig. 5 Association between fungal enterotypes and ICI efficacy. a b c Aspergillus; Saccharomyces d e 2 f g P P P P There were differences in the proportions of responders among the three fungal enterotypes (Fig. 5e Asper_high P Sacc_type P 7a Sacc_type P 7b 7c Asper_low P 6f P 6g 7d, e Bacteroides Bac_high Bac_low 8a–c 8d 8e Sacc_type Asper_low 8f Fig. 6 Functional validation of Debaryomyces hansenii a Debaryomyces hansenii b Debaryomyces hansenii c Debaryomyces hansenii ; P d 3 2 e f g n P P P Debaryomyces hansenii Debaryomyces hansenii P 6a Debaryomyces hansenii 6b Debaryomyces hansenii P 6c Debaryomyces hansenii P 6d 6e Subsequently, we performed CD8 immunohistochemistry on mouse tumor tissues, revealing that a high abundance of Debaryomyces hansenii P 6f P P P Debaryomyces hansenii 6g Discussion A large number of studies have recently highlighted the significant role of gut bacteria and other host factors in the effectiveness of ICIs 19 16 20 12 14 Herein, we identified 27 fungi in melanoma and 23 fungi in NSCLC associated with immunotherapy across a multi-cohort. Notably, most of them are plant pathogenic or involved in food fermentation fungi, and their role in mice or humans has been infrequently documented. Numerous investigations have demonstrated that intestinal fungi can significantly influence the host’s physiological and pathological conditions 8 21 Aspergillus avenaceus Staphylococcus aureus 22 23 Aspergillus avenaceus 24 Aspergillus sydowii 25 Malassezia globosa 26 27 Malassezia globosa Candida albicans 28 Saccharomyces cerevisiae 29 Candida auris 30 The dynamics and resilience of the entire community are regulated by the gut microbiome, an ecosystem made up of intricate microbial interactions 10 31 32 33 34 35 14 Bifidobacterium bifidum 10 Saccharomyces boulardii 36 It has been suggested that enterotypes can efficiently stratify populations, summarize the traits of the human gut microbiome, and give a general picture of the variations in gut microbiome composition among individuals 18 37 Asper_high Sacc_type Asper_low 38 Candida Saccharomyces Penicillium Candida 38 Asper_high Sacc_type 39 40 41 Bacteroides 42 Considering the culturability and safety of fungi in the laboratory, we selected the top 10 associated Debaryomyces hansenii Debaryomyces hansenii 43 12 14 44 Debaryomyces hansenii 45 46 The study had some limitations. First, the small number of cohorts for NSCLC and RCC and the fact that most of the samples were sourced from France or Canada limited the assessment of the impact of geographic differences on gut microbiota and affected the accuracy of the results, with some heterogeneity present. The microbial signatures in various tumors fluctuate greatly, and there are comparatively few common microbial signatures because of the imbalance in cohort numbers, as well as variations in sequencing platforms and depths. Additionally, this causes some discrepancies in the findings of enterotypes and microbial interaction analyses between melanoma and NSCLC. It is impossible to rule out that the fraction of responders, sequencing depth, and cohort size had an impact on this. Second, because fungal DNA is difficult to extract and its abundance in the gut is low, more precise sequencing methods and sequencing depth are required. The sequencing depth of some cohorts in this study was low, resulting in sparse fungal abundance, and the obtained association results were biased to a certain extent. Third, some of the fungi associated with the efficacy of ICIs are difficult to culture or have a certain risk, and it cannot even be determined whether they are contaminated strains. Therefore, its role cannot be verified. Next, it is impossible to tell whether the low-abundance fungi are actual biological signals in the intestinal fungus or just technical noise because this study does not have blank control or negative control samples. Finally, it is currently unknown how exactly intestinal fungi, such as Debaryomyces hansenii Overall, we conducted a meta-analysis to identify microbial signatures that influence the effectiveness of ICIs across various cancers using fecal metagenomic sequencing data. We also validated the role of Debaryomyces hansenii Methods Collection of metagenomic files and metadata from patients treated with ICIs The National Center for Biotechnology Information (NCBI) was searched for studies on human fecal shotgun metagenomic sequencing related to ICIs. Our analysis included data from 1161 patients across eight cohorts, comprising 489 patients with melanoma, 571 patients with NSCLC, and 101 patients with RCC. Metagenomic sequencing data were downloaded from the European Nucleotide Archive (ENA) for the following projects: PRJEB22863 for RoutyB_2018 47 5 48 49 50 6 51 52 Given the clinical tumor radiological data and the Response Evaluation Criteria in Solid Tumors (RECIST) v1.1, the following classifications of response to ICIs are made in clinical practice.: complete response (CR), partial response (PR), stable disease (SD), and progressing disease (PD). In our study, responders (R) were classified as either PR or CR, while non-responders (NR) included all other categories. We also defined additional metrics, including PFS, OS, PFS6, and PFS12, which align with the original published studies. These metrics have been thoroughly verified for consistency. Sequence preprocessing and taxonomic profiling The KneadData v.0.6.1 tool ( http://huttenhower.sph.harvard.edu/kneaddata 53 For taxonomic classification of bacteria, archaea, fungi, and viruses, we employed Kraken2 v.2.1.2 54 http://fungidb.org http://fungi.ensembl.org 55 Sample filtration To ensure data consistency and quality, we conduct a sample filter process based on the data features of this study and the guidelines established by Lin et al. 12 44 56 2 Microbial diversity analysis The metrics of α-diversity of each sample, specifically the Shannon index, were calculated using the R package “otusummary”. The Wilcoxon test was utilized to assess differences in alpha diversity between responders and non-responders, taking into account stratification variables such as cohort, gender, age, and BMI. Age and BMI were initially continuous variables, but for the convenience of analysis and the completeness of clinical information collection, we divided age into the old (≥60 years old) and the young (<60 years old). BMI was classified as lean (<25), overweight (25–30), and obese (>30) according to conventional cut-offs for obesity. Likewise, β-diversity was evaluated using the Bray–Curtis distance. A permutational multivariate analysis of variance (PERMANOVA) was conducted with 999 permutations to examine the differences in the microbial community between responders and non-responders, adjusted by cohort, age, and gender. Identification of microbial features associated with efficacy of ICIs To standardize the study, batch effect correction of microbial relative abundance was carried out using the MMUPHin approach 57 p het P P Construction of bacteria-fungus interaction network Given that some marginal significantly correlated signatures may be involved in the interaction between bacteria and fungi, we chose to the species with Meta P p p 58 Identification of microbial enterotype The samples were organized into enterotypes with partitioning around medoid (PAM) based on the Bray–Curtis distance estimated at the genus level. This analysis focused on genera with an abundance greater than 0.1% in at least 40% of the samples. The optimal number of enterotypes was determined using Silhouette scores, with the maximum average relative abundance representing the defining characteristic of each enterotype. To test the association between enterotypes and response to ICIs, we employed the χ 2 Validation of characteristic fungi in mice Debaryomyces hansenii Six-week-old female conventional C57BL/6 mice were housed in an air-filtered and pathogen-free condition. After one week of acclimation, mice were randomly divided into four groups based on body weight with 6 mice in each group. Murine melanoma B16F10 cells were resuspended in phosphate-buffered saline (PBS; 5 ×10 5 Debaryomyces hansenii 8 Debaryomyces hansenii Immunohistochemistry For IHC, tissue sections were incubated overnight at 4 °C with primary antibodies overnight (CD8, Abcam, code #ab209775). Following this, they were treated with a secondary antibody (Abcam, code #ab205718) conjugated to horseradish peroxidase (HRP) at room temperature for 45 min. The sections were then counterstained with hematoxylin. Statistical analysis of the results was performed using ImageJ. RNA isolation and real-time quantitative PCR Total RNA was extracted from tumor tissues using Trizol (Taraka, code #9109), and the quality and concentration of RNA were measured using the Nanodrop 2000 (ThermoFisher Scientific, Massachusetts, USA). 1 μg of total RNA was reverse transcribed to determine relative mRNA expression with PrimeScript TM β-actin CCL5 CXCL10 PDL1 For quantification of immune-related genes in tumor tissue, relative abundance was calculated by the ΔΔCt method and normalized to the amount of β-actin Statistical analysis Multivariate logistic regression was used to examine the association between binary categorical variables (response to ICIs, PFS6, and PFS12) and microbial abundance. Multivariate Cox regression models were used to determine the association between outcomes (OS, PFS) and microbial abundance. Survival curves were estimated using the Kaplan-Meier method, and the log-rank test was applied for comparisons. The relationship between enterotypes and response to ICIs was determined by the χ 2 t p p Supplementary information  Supplementary Information Author Checklist_E10. Supplementary Data 2 Publisher’s note Supplementary information The online version contains supplementary material available at 10.1038/s41522-025-00827-2. Acknowledgements This study was partly supported by the National Key Research and Development Program 2021YFA1301200, the National Scientific Foundation of China (No. 82474022, 31801121, 82373961) and the Hunan Provincial Science and Technology Innovation Plan Project (2022RC1022). The authors acknowledge the authors from published studies to share their metagenomics sequencing data of immunotherapy trials and are grateful for resources from the High-Performance Computing Center of Central South University and The Bioinformatics Center, Xiangya Hospital, Central South University. Author contributions R.L. conceived and supervised the study and contributed to the study design, Y.Z. contributed to the data collection and provided assistance for parallel computing. L.Z. performed statistical analysis, conducted the in-vivo experiments, interpreted and drafted the manuscript. D.D.Z. assisted mouse experiment design and tumor cell culture. J.F., Z.J.L., X.L.S., and R.M.Y. participated in mouse experiments. W.Z. and Y.C.G. offered suggestions for the experimental design. H.H.Z provided the experimental platform and equipment. All authors contributed to critical revision of the final manuscript. R.L. and Y.Z. approved the final version of the manuscript. Data availability The raw metagenomic data are available in the SRA ( https://www.ncbi.nlm.nih.gov/sra https://www.ebi.ac.uk/ena/ Code availability R scripts demonstrating how to reproduce all findings shown in the main figures are available via https://github.com/liuronghyw/ICI_fungi Competing interests The authors declare no competing interests. References 1. Carlino MS Larkin J Long GV Immune checkpoint inhibitors in melanoma Lancet 2021 398 1002 1014 10.1016/S0140-6736(21)01206-X 34509219 Carlino, M. S., Larkin, J. & Long, G. V. Immune checkpoint inhibitors in melanoma. Lancet 398 34509219 10.1016/S0140-6736(21)01206-X 2. Dall’Olio FG Tumour burden and efficacy of immune-checkpoint inhibitors Nat. Rev. Clin. Oncol. 2022 19 75 90 10.1038/s41571-021-00564-3 34642484 Dall’Olio, F. G. et al. Tumour burden and efficacy of immune-checkpoint inhibitors. Nat. Rev. Clin. Oncol. 19 34642484 10.1038/s41571-021-00564-3 3. Morad G Helmink BA Sharma P Wargo JA Hallmarks of response, resistance, and toxicity to immune checkpoint blockade Cell 2021 184 5309 5337 10.1016/j.cell.2021.09.020 34624224 PMC8767569 Morad, G., Helmink, B. A., Sharma, P. & Wargo, J. A. Hallmarks of response, resistance, and toxicity to immune checkpoint blockade. Cell 184 34624224 10.1016/j.cell.2021.09.020 PMC8767569 4. Lu Y Gut microbiota influence immunotherapy responses: mechanisms and therapeutic strategies J. Hematol. Oncol. 2022 15 47 10.1186/s13045-022-01273-9 35488243 PMC9052532 Lu, Y. et al. Gut microbiota influence immunotherapy responses: mechanisms and therapeutic strategies. J. Hematol. Oncol. 15 35488243 10.1186/s13045-022-01273-9 PMC9052532 5. Lee KA Cross-cohort gut microbiome associations with immune checkpoint inhibitor response in advanced melanoma Nat. Med. 2022 28 535 544 10.1038/s41591-022-01695-5 35228751 PMC8938272 Lee, K. A. et al. Cross-cohort gut microbiome associations with immune checkpoint inhibitor response in advanced melanoma. Nat. Med. 28 35228751 10.1038/s41591-022-01695-5 PMC8938272 6. Derosa, L. et al. Custom scoring based on ecological topology of gut microbiota associated with cancer immunotherapy outcome. Cell 187 10.1016/j.cell.2024.05.029 38906102 7. Wu, X. Q. et al. Intestinal Akkermansia muciniphila complements the efficacy of PD1 therapy in MAFLD-related hepatocellular carcinoma. Cell Rep. Med. 10.1016/j.xcrm.2024.101900 PMC11866522 39798567 8. Saftien A Puschhof J Elinav E Fungi and cancer Gut 2023 72 1410 1425 10.1136/gutjnl-2022-327952 37147013 Saftien, A., Puschhof, J. & Elinav, E. Fungi and cancer. Gut 72 37147013 10.1136/gutjnl-2022-327952 9. Alam, A. et al. Fungal mycobiome drives IL-33 secretion and type 2 immunity in pancreatic cancer. Cancer Cell 40 10.1016/j.ccell.2022.01.003 PMC8847236 35120601 10. Zhang F Aschenbrenner D Yoo JY Zuo T The gut mycobiome in health, disease, and clinical applications in association with the gut bacterial microbiome assembly Lancet Microbe 2022 3 e969 e983 10.1016/S2666-5247(22)00203-8 36182668 Zhang, F., Aschenbrenner, D., Yoo, J. Y. & Zuo, T. The gut mycobiome in health, disease, and clinical applications in association with the gut bacterial microbiome assembly. Lancet Microbe 3 36182668 10.1016/S2666-5247(22)00203-8 11. Huang X Li L Chen H Protocol to identify fungal profile from fecal metagenomes in cancer patients prior to immunotherapy STAR Protoc. 2024 5 102847 10.1016/j.xpro.2024.102847 38277270 PMC10837094 Huang, X., Li, L. & Chen, H. Protocol to identify fungal profile from fecal metagenomes in cancer patients prior to immunotherapy. STAR Protoc. 5 38277270 10.1016/j.xpro.2024.102847 PMC10837094 12. Lin Y Altered mycobiota signatures and enriched pathogenic Aspergillus rambellii are associated with colorectal cancer based on multicohort fecal metagenomic analyses Gastroenterology 2022 163 908 921 10.1053/j.gastro.2022.06.038 35724733 Lin, Y. et al. Altered mycobiota signatures and enriched pathogenic Aspergillus rambellii are associated with colorectal cancer based on multicohort fecal metagenomic analyses. Gastroenterology 163 35724733 10.1053/j.gastro.2022.06.038 13. Liu N-N Multi-kingdom microbiota analyses identify bacterial-fungal interactions and biomarkers of colorectal cancer across cohorts Nat. Microbiol 2022 7 238 250 10.1038/s41564-021-01030-7 35087227 PMC8813618 Liu, N.-N. et al. Multi-kingdom microbiota analyses identify bacterial-fungal interactions and biomarkers of colorectal cancer across cohorts. Nat. Microbiol 7 35087227 10.1038/s41564-021-01030-7 PMC8813618 14. Huang, X. et al. Multi-kingdom gut microbiota analyses define bacterial-fungal interplay and microbial markers of pan-cancer immunotherapy across cohorts. Cell Host Microbe 31 10.1016/j.chom.2023.10.005 37944495 15. Ross MG Characterizing and measuring bias in sequence data Genome Biol. 2013 14 R51 10.1186/gb-2013-14-5-r51 23718773 PMC4053816 Ross, M. G. et al. Characterizing and measuring bias in sequence data. Genome Biol. 14 23718773 10.1186/gb-2013-14-5-r51 PMC4053816 16. Rothschild D Environment dominates over host genetics in shaping human gut microbiota Nature 2018 555 210 215 10.1038/nature25973 29489753 Rothschild, D. et al. Environment dominates over host genetics in shaping human gut microbiota. Nature 555 29489753 10.1038/nature25973 17. Chin VK Mycobiome in the gut: a multiperspective review Mediators Inflamm. 2020 2020 9560684 10.1155/2020/9560684 32322167 PMC7160717 Chin, V. K. et al. Mycobiome in the gut: a multiperspective review. Mediators Inflamm. 2020 32322167 10.1155/2020/9560684 PMC7160717 18. Arumugam M Enterotypes of the human gut microbiome Nature 2011 473 174 180 10.1038/nature09944 21508958 PMC3728647 Arumugam, M. et al. Enterotypes of the human gut microbiome. Nature 473 21508958 10.1038/nature09944 PMC3728647 19. Hayase E Jenq RR Role of the intestinal microbiome and microbial-derived metabolites in immune checkpoint blockade immunotherapy of cancer Genome Med. 2021 13 107 10.1186/s13073-021-00923-w 34162429 PMC8220726 Hayase, E. & Jenq, R. R. Role of the intestinal microbiome and microbial-derived metabolites in immune checkpoint blockade immunotherapy of cancer. Genome Med. 13 34162429 10.1186/s13073-021-00923-w PMC8220726 20. Limeta, A., Ji, B., Levin, M., Gatto, F. & Nielsen, J. Meta-analysis of the gut microbiota in predicting response to cancer immunotherapy in metastatic melanoma. JCI Insight 5 10.1172/jci.insight.140940 PMC7714408 33268597 21. Wheeler ML Limon JJ Underhill DM Immunity to commensal fungi: detente and disease Annu. Rev. Pathol. 2017 12 359 385 10.1146/annurev-pathol-052016-100342 28068483 PMC6573037 Wheeler, M. L., Limon, J. J. & Underhill, D. M. Immunity to commensal fungi: detente and disease. Annu. Rev. Pathol. 12 28068483 10.1146/annurev-pathol-052016-100342 PMC6573037 22. Chang C-M Avenaciolides: potential MurA-targeted inhibitors against peptidoglycan biosynthesis in methicillin-resistant Staphylococcus aureus (MRSA) J. Am. Chem. Soc. 2015 137 267 275 10.1021/ja510375f 25521652 Chang, C.-M. et al. Avenaciolides: potential MurA-targeted inhibitors against peptidoglycan biosynthesis in methicillin-resistant Staphylococcus aureus (MRSA). J. Am. Chem. Soc. 137 25521652 10.1021/ja510375f 23. Castelo-Branco PA Synthesis, characterization, absolute structural determination and antifungal activity of a new chlorinated aromatic avenaciolide analogue Pest Manag. Sci. 2009 65 34 40 10.1002/ps.1640 18785221 Castelo-Branco, P. A. et al. Synthesis, characterization, absolute structural determination and antifungal activity of a new chlorinated aromatic avenaciolide analogue. Pest Manag. Sci. 65 18785221 10.1002/ps.1640 24. Underhill DM Pearlman E Immune interactions with pathogenic and commensal fungi: a two-way street Immunity 2015 43 845 858 10.1016/j.immuni.2015.10.023 26588778 PMC4865256 Underhill, D. M. & Pearlman, E. Immune interactions with pathogenic and commensal fungi: a two-way street. Immunity 43 26588778 10.1016/j.immuni.2015.10.023 PMC4865256 25. Liu, N.-N. et al. The intratumor mycobiome promotes lung cancer progression via myeloid-derived suppressor cells. Cancer Cell 41 10.1016/j.ccell.2023.08.012 37738973 26. Zhang Z Identification of Malassezia globosa as a gastric fungus associated with PD-L1 expression and overall survival of patients with gastric cancer J. Immunol. Res. 2022 2022 2430759 10.1155/2022/2430759 36405009 PMC9669766 Zhang, Z. et al. Identification of Malassezia globosa as a gastric fungus associated with PD-L1 expression and overall survival of patients with gastric cancer. J. Immunol. Res. 2022 36405009 10.1155/2022/2430759 PMC9669766 27. Aykut B The fungal mycobiome promotes pancreatic oncogenesis via activation of MBL Nature 2019 574 264 267 10.1038/s41586-019-1608-2 31578522 PMC6858566 Aykut, B. et al. The fungal mycobiome promotes pancreatic oncogenesis via activation of MBL. Nature 574 31578522 10.1038/s41586-019-1608-2 PMC6858566 28. Charpak-Amikam Y Candida albicans evades NK cell elimination via binding of Agglutinin-Like Sequence proteins to the checkpoint receptor TIGIT Nat. Commun. 2022 13 2463 10.1038/s41467-022-30087-z 35513379 PMC9072312 Charpak-Amikam, Y. et al. Candida albicans evades NK cell elimination via binding of Agglutinin-Like Sequence proteins to the checkpoint receptor TIGIT. Nat. Commun. 13 35513379 10.1038/s41467-022-30087-z PMC9072312 29. Li K Profiling phagosome proteins identifies PD-L1 as a fungal-binding receptor Nature 2024 630 736 743 10.1038/s41586-024-07499-6 38839956 Li, K. et al. Profiling phagosome proteins identifies PD-L1 as a fungal-binding receptor. Nature 630 38839956 10.1038/s41586-024-07499-6 30. Wurster S Albert ND Kontoyiannis DP Candida auris bloodstream infection induces upregulation of the PD-1/PD-L1 immune checkpoint pathway in an immunocompetent mouse model mSphere 2022 7 e0081721 10.1128/msphere.00817-21 35224979 PMC9044930 Wurster, S., Albert, N. D. & Kontoyiannis, D. P. Candida auris bloodstream infection induces upregulation of the PD-1/PD-L1 immune checkpoint pathway in an immunocompetent mouse model. mSphere 7 35224979 10.1128/msphere.00817-21 PMC9044930 31. Krüger, W., Vielreicher, S., Kapitan, M., Jacobsen, I. D. & Niemiec, M. J. Fungal-bacterial interactions in health and disease. Pathogens 8 10.3390/pathogens8020070 PMC6630686 31117285 32. Kombrink A Induction of antibacterial proteins and peptides in the coprophilous mushroom Coprinopsis cinerea in response to bacteria ISME J. 2019 13 588 602 10.1038/s41396-018-0293-8 30301946 PMC6461984 Kombrink, A. et al. Induction of antibacterial proteins and peptides in the coprophilous mushroom Coprinopsis cinerea in response to bacteria. ISME J. 13 30301946 10.1038/s41396-018-0293-8 PMC6461984 33. García, C. et al. The human gut microbial metabolome modulates fungal growth via the TOR signaling pathway. mSphere 2 10.1128/mSphere.00555-17 PMC5729221 29242837 34. Hoarau, G. et al. Bacteriome and mycobiome interactions underscore microbial dysbiosis in familial Crohn’s disease. mBio 7 10.1128/mBio.01250-16 PMC5030358 27651359 35. Shiao, S. L. et al. Commensal bacteria and fungi differentially regulate tumor responses to radiation therapy. Cancer Cell 39 10.1016/j.ccell.2021.07.002 PMC8830498 34329585 36. Sen S Mansell TJ Yeasts as probiotics: mechanisms, outcomes, and future potential Fungal Genet Biol. 2020 137 103333 10.1016/j.fgb.2020.103333 31923554 Sen, S. & Mansell, T. J. Yeasts as probiotics: mechanisms, outcomes, and future potential. Fungal Genet Biol. 137 31923554 10.1016/j.fgb.2020.103333 37. Costea, P. I. et al. Enterotypes in the landscape of gut microbial community composition. Nat. Microbiol 3 10.1038/s41564-017-0072-8 PMC5832044 29255284 38. Lai S Enterotypes of the human gut mycobiome Microbiome 2023 11 179 10.1186/s40168-023-01586-y 37563687 PMC10416509 Lai, S. et al. Enterotypes of the human gut mycobiome. Microbiome 11 37563687 10.1186/s40168-023-01586-y PMC10416509 39. Vallet, N. et al. Circulating T cell profiles associate with enterotype signatures underlying hematological malignancy relapses. Cell Host Microbe 31 10.1016/j.chom.2023.06.009 37463582 40. Frioux, C. et al. Enterosignatures define common bacterial guilds in the human gut microbiome. Cell Host Microbe 31 10.1016/j.chom.2023.05.024 37339626 41. Davar D Fecal microbiota transplant overcomes resistance to anti-PD-1 therapy in melanoma patients Science 2021 371 595 602 10.1126/science.abf3363 33542131 PMC8097968 Davar, D. et al. Fecal microbiota transplant overcomes resistance to anti-PD-1 therapy in melanoma patients. Science 371 33542131 10.1126/science.abf3363 PMC8097968 42. Zhu, X. et al. A specific enterotype derived from gut microbiome of older individuals enables favorable responses to immune checkpoint blockade therapy. Cell Host Microbe 32 10.1016/j.chom.2024.03.002 38513657 43. Breuer U Harms H Debaryomyces hansenii-an extremophilic yeast with biotechnological potential Yeast 2006 23 415 437 10.1002/yea.1374 16652409 Breuer, U. & Harms, H. Debaryomyces hansenii-an extremophilic yeast with biotechnological potential. Yeast 23 16652409 10.1002/yea.1374 44. Nash AK The gut mycobiome of the Human Microbiome Project healthy cohort Microbiome 2017 5 153 10.1186/s40168-017-0373-4 29178920 PMC5702186 Nash, A. K. et al. The gut mycobiome of the Human Microbiome Project healthy cohort. Microbiome 5 29178920 10.1186/s40168-017-0373-4 PMC5702186 45. Jain U Debaryomyces is enriched in Crohn’s disease intestinal tissue and impairs healing in mice Science 2021 371 1154 1159 10.1126/science.abd0919 33707263 PMC10114606 Jain, U. et al. Debaryomyces is enriched in Crohn’s disease intestinal tissue and impairs healing in mice. Science 371 33707263 10.1126/science.abd0919 PMC10114606 46. Szóstak N Host factors associated with gut mycobiome structure mSystems 2023 8 e0098622 10.1128/msystems.00986-22 36786595 PMC10134842 Szóstak, N. et al. Host factors associated with gut mycobiome structure. mSystems 8 36786595 10.1128/msystems.00986-22 PMC10134842 47. Routy B Gut microbiome influences efficacy of PD-1-based immunotherapy against epithelial tumors Science 2018 359 91 97 10.1126/science.aan3706 29097494 Routy, B. et al. Gut microbiome influences efficacy of PD-1-based immunotherapy against epithelial tumors. Science 359 29097494 10.1126/science.aan3706 48. Frankel AE Metagenomic shotgun sequencing and unbiased metabolomic profiling identify specific human gut microbiota and metabolites associated with immune checkpoint therapy efficacy in melanoma patients Neoplasia 2017 19 848 855 10.1016/j.neo.2017.08.004 28923537 PMC5602478 Frankel, A. E. et al. Metagenomic shotgun sequencing and unbiased metabolomic profiling identify specific human gut microbiota and metabolites associated with immune checkpoint therapy efficacy in melanoma patients. Neoplasia 19 28923537 10.1016/j.neo.2017.08.004 PMC5602478 49. Matson V The commensal microbiome is associated with anti-PD-1 efficacy in metastatic melanoma patients Science 2018 359 104 108 10.1126/science.aao3290 29302014 PMC6707353 Matson, V. et al. The commensal microbiome is associated with anti-PD-1 efficacy in metastatic melanoma patients. Science 359 29302014 10.1126/science.aao3290 PMC6707353 50. Peters BA Relating the gut metagenome and metatranscriptome to immunotherapy responses in melanoma patients Genome Med. 2019 11 61 10.1186/s13073-019-0672-4 31597568 PMC6785875 Peters, B. A. et al. Relating the gut metagenome and metatranscriptome to immunotherapy responses in melanoma patients. Genome Med. 11 31597568 10.1186/s13073-019-0672-4 PMC6785875 51. McCulloch JA Intestinal microbiota signatures of clinical response and immune-related adverse events in melanoma patients treated with anti-PD-1 Nat. Med. 2022 28 545 556 10.1038/s41591-022-01698-2 35228752 PMC10246505 McCulloch, J. A. et al. Intestinal microbiota signatures of clinical response and immune-related adverse events in melanoma patients treated with anti-PD-1. Nat. Med. 28 35228752 10.1038/s41591-022-01698-2 PMC10246505 52. Spencer CN Dietary fiber and probiotics influence the gut microbiome and melanoma immunotherapy response Science 2021 374 1632 1640 10.1126/science.aaz7015 34941392 PMC8970537 Spencer, C. N. et al. Dietary fiber and probiotics influence the gut microbiome and melanoma immunotherapy response. Science 374 34941392 10.1126/science.aaz7015 PMC8970537 53. Langmead B Salzberg SL Fast gapped-read alignment with Bowtie 2 Nat. Methods 2012 9 357 359 10.1038/nmeth.1923 22388286 PMC3322381 Langmead, B. & Salzberg, S. L. Fast gapped-read alignment with Bowtie 2. Nat. Methods 9 22388286 10.1038/nmeth.1923 PMC3322381 54. Wood DE Lu J Langmead B Improved metagenomic analysis with Kraken 2 Genome Biol. 2019 20 257 10.1186/s13059-019-1891-0 31779668 PMC6883579 Wood, D. E., Lu, J. & Langmead, B. Improved metagenomic analysis with Kraken 2. Genome Biol. 20 31779668 10.1186/s13059-019-1891-0 PMC6883579 55. Lu J Salzberg SL Ultrafast and accurate 16S rRNA microbial community analysis using Kraken 2 Microbiome 2020 8 124 10.1186/s40168-020-00900-2 32859275 PMC7455996 Lu, J. & Salzberg, S. L. Ultrafast and accurate 16S rRNA microbial community analysis using Kraken 2. Microbiome 8 32859275 10.1186/s40168-020-00900-2 PMC7455996 56. Iliev ID Cadwell K Effects of intestinal fungi and viruses on immune responses and inflammatory bowel diseases Gastroenterology 2021 160 1050 1066 10.1053/j.gastro.2020.06.100 33347881 PMC7956156 Iliev, I. D. & Cadwell, K. Effects of intestinal fungi and viruses on immune responses and inflammatory bowel diseases. Gastroenterology 160 33347881 10.1053/j.gastro.2020.06.100 PMC7956156 57. Ma S Population structure discovery in meta-analyzed microbial communities and inflammatory bowel disease using MMUPHin Genome Biol. 2022 23 208 10.1186/s13059-022-02753-4 36192803 PMC9531436 Ma, S. et al. Population structure discovery in meta-analyzed microbial communities and inflammatory bowel disease using MMUPHin. Genome Biol. 23 36192803 10.1186/s13059-022-02753-4 PMC9531436 58. McKenzie AT Katsyv I Song W-M Wang M Zhang B DGCA: a comprehensive R package for differential gene correlation analysis BMC Syst. Biol. 2016 10 106 10.1186/s12918-016-0349-1 27846853 PMC5111277 McKenzie, A. T., Katsyv, I., Song, W.-M., Wang, M. & Zhang, B. DGCA: a comprehensive R package for differential gene correlation analysis. BMC Syst. Biol. 10 27846853 10.1186/s12918-016-0349-1 PMC5111277 ",
  "metadata": {
    "Title of this paper": "DGCA: a comprehensive R package for differential gene correlation analysis",
    "Journal it was published in:": "NPJ Biofilms and Microbiomes",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12475161/"
  }
}