{
  "title": "Paper_912",
  "abstract": "pmc BMC Cancer BMC Cancer 16 bmccanc BMC Cancer 1471-2407 BMC PMC12486970 PMC12486970.1 12486970 12486970 41034744 10.1186/s12885-025-14934-y 14934 1 Research POLD3 knockdown effects on low-grade glioma: insights from bioinformatics and experimental validation Yang Zhihui 1 Dou Zhonghao 2 Wang Hao 3 Hu Zhaojiang 1 Gao Yanbo 1 Bai Yilei 3 Liu Junfeng 2 Qian RongJun doctorqianrongjun@163.com 4 1 https://ror.org/03f72zw41 grid.414011.1 0000 0004 1808 090X People’s Hospital of Henan University, Henan Provincial People’s Hospital, 2 https://ror.org/03f72zw41 grid.414011.1 0000 0004 1808 090X Zhengzhou University People’s Hospital, Henan Provincial People’s Hospital, 3 https://ror.org/01tsmvz08 grid.412098.6 0000 0000 9277 8602 Department of Neurosurgery, Henan University of Traditional Chinese Medicine, 4 https://ror.org/03f72zw41 grid.414011.1 0000 0004 1808 090X Department of Neurosurgery, Henan Provincial People’s Hospital, People’s Hospital of Henan University, People’s Hospital of Zhengzhou University, 1 10 2025 2025 25 478185 1489 9 7 2025 25 8 2025 01 10 2025 02 10 2025 03 10 2025 © The Author(s) 2025 2025 https://creativecommons.org/licenses/by-nc-nd/4.0/ Open Access http://creativecommons.org/licenses/by-nc-nd/4.0/ Background Lower-grade glioma (LGG) is a common primary brain tumor with potential progression to glioblastoma. Its development is closely linked to DNA damage repair. DNA polymerase delta subunit 3 (POLD3), a subunit of the DNA polymerase δ complex, participates in DNA replication and repair. POLD3 may act as a therapeutic target and prognostic biomarker in LGG. Methods We collected primary data from The Cancer Genome Atlas (TCGA), the Chinese Glioma Genome Atlas (CGGA), the Tumor Immune Estimation Resource (TIMER), and Gene Set Enrichment Analysis (GSEA). The CGGA dataset included messenger RNA (mRNA) sequencing and clinical data from 403 LGG cases; its microarray subset contained 142 additional cases. The TCGA dataset provided clinical data for 503 LGG cases. Employing bioinformatics tools, we investigated the correlation of POLD3 expression with the clinical characteristics, pathological features, survival outcomes, and tumor immune microenvironment in LGG. Subsequent functional validation of POLD3’s impact in LGG was performed using both cellular and animal models. Results Integrative analysis combining bioinformatics and experimental approaches revealed significant POLD3 overexpression in LGG. Elevated POLD3 levels exhibited significant associations with distinct clinicopathological features, altered immune cell infiltration profiles, and adverse clinical outcomes. Functionally, POLD3 was demonstrated to drive LGG cell proliferation, invasion, and modulate the tumor microenvironment. Conclusion This study establishes POLD3 as a critical molecular determinant in LGG pathogenesis. Our findings position POLD3 as a promising multifaceted target, with significant implications for advancing LGG diagnostics, therapeutic development, immune modulation strategies, and prognostic assessment, thereby providing a fresh conceptual framework for understanding and managing this tumor. Supplementary Information The online version contains supplementary material available at 10.1186/s12885-025-14934-y. Keywords Low-Grade glioma (LGG) POLD3 (DNA polymerase delta subunit 3) Immunology bioinformatics analysis Biomarker pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement yes pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes issue-copyright-statement © BioMed Central Ltd., part of Springer Nature 2025 Introduction LGG is a slow-growing, less malignant tumor of the central nervous system, characterized by mild cellular heterogeneity and relatively slow proliferation. Over time, some LGG may undergo malignant transformation into high-grade glioma, significantly worsening patient prognosis [ 1 2 3 4 5 6 7 8 In recent years, numerous studies have demonstrated that the diagnosis, treatment, and prognosis of LGG are closely associated with various molecular markers. For example, mutations in isocitrate dehydrogenase (IDH), a well-known biomarker in glioma, alter enzyme activity and lead to the accumulation of the oncometabolite 2-hydroxyglutarate (2-HG). This metabolite induces profound epigenetic dysregulation and aberrant gene expression, thereby promoting tumorigenesis [ 9 10 The O6-methylguanine-DNA methyltransferase (MGMT) gene is among the most common molecular markers in glioma. It encodes a DNA repair enzyme that counteracts alkylating agent-induced DNA damage, thereby preventing gene mutations, tumor initiation, and cell death [ 11 12 13 DNA damage response (DDR) is a hallmark of tumor cells, enabling them to maintain genomic stability [ 14 15 16 17 18 19 20 The study of LGG remains a challenge in neurosurgery. In this work, we investigated the association between POLD3 and LGG for the first time. Thousands of tissue samples were obtained from multiple public databases for comprehensive data analysis, through the integration of bioinformatics analysis and experimental data, We intensively investigated the influence of POLD3 on the clinicopathological characteristics, prognostic value, treatment, and immune microenvironment of LGG. Materials and methods Data collection The Chinese Glioma Genome Atlas (CGGA) database provides messenger RNA (mRNA) sequencing data and corresponding clinical information for 403 glioblastoma cases, while its microarray (chip) dataset contains similar data for an additional 142 cases. The Cancer Genome Atlas (TCGA) database serves as a comprehensive resource for clinical and genomic information on 503 LGG samples, with clinical data accessible through the TCGA portal. In addition, Gene Expression Profiling Interactive Analysis (GEPIA) was employed to compare POLD3 mRNA expression levels between normal brain tissue and LGG samples. Timer The Tumor Immune Estimation Resource (TIMER) database is a widely used platform for investigating the tumor immune microenvironment. In this study, the TIMER algorithm was applied to assess the correlation between POLD3 expression in LGG and the infiltration levels of multiple immune cell types, including B cells, CD8⁺ T cells, CD4⁺ T cells, mast cells, and stromal cells. Furthermore, we examined the relationship between POLD3 copy number alterations and immune infiltration patterns. The analysis revealed that high POLD3 copy number was significantly associated with altered immune cell infiltration, as well as with the expression of several immune-related genes, including CD1C, CD4, CD19, CD163, and key immune checkpoint molecules such as HLA-DPA1, HLA-DPB1, HLA-DQB1, HLA-DRA, MS4A4A, and NRP1. GSEA analysis of POLD3 Gene Set Enrichment Analysis (GSEA) is a publicly available computational approach designed to identify statistically significant differences in predefined gene sets between biological states. In this study, mRNA sequencing data from the CGGA database were preprocessed and stratified into high- and low-expression groups based on POLD3 expression levels. Enrichment analysis was then conducted using GSEA software, with the Kyoto Encyclopedia of Genes and Genomes (KEGG) cell signaling pathway gene set selected as the reference database. Meta-analysis A comprehensive search of PubMed, Web of Science, and Embase yielded no studies investigating the association between POLD3 and LGG. To our knowledge, this is the first study to evaluate the prognostic role of POLD3 in glioma, and no relevant clinical data have been reported in existing literature. To address this gap, we performed a meta-analysis using datasets from the CGGA. Combined analyses of CGGA and TCGA data consistently demonstrated the significant prognostic relevance of POLD3 in the overall LGG patient population. Cell line and culture and shRNA interference Human normal astrocytes (HA1800) and glioblastoma (GBM) cell lines (SHG44, U87MG, and U251MG) were obtained from the American Type Culture Collection (ATCC). All cell lines were cultured, passaged, and stored under standardized conditions. Cells were maintained in Dulbecco’s Modified Eagle Medium (DMEM) or DMEM/F12 supplemented with 10% fetal bovine serum (FBS) at 37 °C in a humidified incubator containing 5% CO₂. Routine mycoplasma testing confirmed the absence of contamination. For gene knockdown experiments, short hairpin RNA (shRNA) interference assays were performed. Lentiviral particles carrying POLD3-targeted shRNA constructs or non-targeting control shRNAs were transduced into cells, and knockdown efficiency was validated using Western blotting and reverse transcription quantitative PCR (RT-qPCR). Low-grade glioma tissue samples All tissue samples in this study were obtained from Henan Provincial People’s Hospital and were immediately cryopreserved in liquid nitrogen following surgical resection to preserve biological activity. The cohort included eight tumor samples from LGG patients, eight tumor samples from GBM patients, and corresponding paracancerous tissues. All procedures were conducted in strict accordance with ethical guidelines. Written informed consent was obtained from all patients prior to surgery, and the study protocol was approved by the Ethics Committee of Henan Provincial People’s Hospital (Ethics No. 2020107). Immunoblotting For protein immunoblotting, cells were harvested and lysed on ice using radioimmunoprecipitation assay (RIPA) buffer supplemented with 1mM phenylmethylsulfonyl fluoride (PMSF). Protein concentrations were determined using a bicinchoninic acid (BCA) assay kit (Vazyme, 7E0381B4). Equal amounts of whole-cell lysates were resolved by sodium dodecyl sulfate-polyacrylamide gel electrophoresis (SDS–PAGE) and subsequently transferred onto polyvinylidene difluoride (PVDF) membranes. Membranes were blocked with 5% skim milk prepared in Tris-buffered saline with 0.1% Tween−20 (TBST) and incubated overnight at 4 °C with the appropriate primary antibodies. The following day, membranes were washed three times with TBST, incubated with horseradish peroxidase (HRP)-conjugated secondary antibodies for 1 h at room temperature, and washed again three times with TBST. Protein bands were visualized using enhanced chemiluminescence (ECL) detection reagents and captured with a gel imaging system. RT-qPCR Total RNA was extracted from experimental samples using an RNA extraction kit (Vazyme, 7E1780A5). Complementary DNA (cDNA) was synthesized using a reverse transcription reagent kit (Vazyme, 7E0702F4). Quantitative PCR (qPCR) was performed using SYBR Green chemistry (Vazyme, Q311−0). Relative gene expression levels were calculated using the 2−ΔΔCT method, with 18 S rRNA serving as the reference gene. Primer sequences were as follows:  POLD3 forward, GAGTTCGTCACGGACCAAAAC. POLD3 reverse, GCCAGACACCAAGTAGGTAAC. 18S forward, GTAACCCGTTGAACCCCATT 18S reverse, CCATCCAATCGGTAGTAGCG Immunohistochemistry and HE Tissue samples were sequentially dehydrated, paraffin-embedded, sectioned, and deparaffinized. Sections were incubated with the primary antibody, followed by visualization using DAB chromogenic solution and microscopic observation. For H&E staining, sections were baked at 66 °C for 20–30 min, cleared in xylene (three changes, 5 min each), rehydrated in graded ethanol (100%, 95%, 80%; 3 min each), and rinsed under running water. Hematoxylin staining was performed for 2–5 min, followed by differentiation in 1% acid alcohol for several seconds, bluing in saturated lithium carbonate solution, and rinsing with water. Sections were counterstained with eosin for a few seconds, dehydrated through graded ethanol, cleared in xylene, and mounted with neutral gum for microscopic evaluation. CCK−8 assay The CCK−8 assay was used to evaluate the effect of POLD3 on cell proliferation. Cell viability was assessed with a CCK−8 assay kit (UElandy, C6005M) according to the manufacturer’s protocol. Cells were seeded in 96-well plates at a density of 2,000 cells/well and incubated at 37 °C with 5%CO₂. At each time point, the culture medium was replaced with 100µL complete medium containing 10µL CCK−8 reagent. Absorbance was measured using a multifunctional microplate reader. The assay was performed daily for five consecutive days. Cell clone formation assay Cells were seeded in 6-well plates at a density of 1,000 cells/well and cultured for approximately one week at 37 °C. Colonies were fixed with 4% paraformaldehyde for 30 min, stained with crystal violet for 30 min, washed with deionized water, air-dried, and counted under a microscope. Xenograft mouse model Female BALB/c nude mice (6–8 weeks old) were housed in cages with strictly controlled temperature and humidity. These mice were purchased from Sipeifu Biotechnology (Beijing, China). Prior to the experiment, the animals were randomly grouped according to body weight. We used U87-luc cells with shRNA encoding POLD3 knockdown (shPOLD3−1 and shPOLD3−2) and non-targeted control shRNA (shNC). The left striatum of mice should be stereotaxically injected with 1 × 105 U87-luc cells for the xenograft mouse model. The injection coordinates were 2.2 mm to the left of the midline, 0.2 mm posterior to the bregma, and at a depth of 3.5 mm. Starting on the 7th day after cell injection, tumor size and mouse body weight were monitored every 2 days using bioluminescence imaging (PerkinElmer, USA). When 20% weight loss or severe neurological symptoms were observed, the mice were euthanized by cervical dislocation. Their brains were then immediately collected, fixed in 4% paraformaldehyde at 4 °C for 24 h, and processed for immunohistochemistry and hematoxylin and eosin (H&E) staining. Fluorescence intensity, survival rate, and mouse body Weight were analyzed using GraphPad Prism 9 software (San Diego, California, USA). Cell cycle analysis Cells were collected, washed twice with ice-cold PBS, and fixed in 70% ethanol at 4 °C overnight. Fixed cells were stained with cell cycle staining solution (Biyuntian, C1052) and incubated at 37 °C in 5% CO₂ for 30 min. DNA content was measured using a BD LSR Fortessa flow cytometer, and data were analyzed with FlowJo software. Migration and wound-healing assays For the Transwell migration assay, 100 µL of cell suspension containing 1 × 10⁵ cells was added to the upper chamber with serum-free medium, and 600 µL of complete medium containing 20% FBS was added to the lower chamber. After incubation at 37 °C with 5%CO₂ for 36–48 h, migrated cells were fixed with 4% paraformaldehyde for 30 min, stained with crystal violet for 30 min, washed, air-dried, and imaged under a microscope. For the wound-healing assay, a scratch was created when cell confluence in 6-well plates reached 100%. Images were taken immediately after scratching and again after 24–48 h to assess wound closure. Statistical analysis All experiments were repeated three times for accuracy. The results of Statistical analysis were calculated by unpaired t-tests on GraphPad Prism 9 (San Diego, CA, USA) software. All quantitative data are presented as mean ± standarderror (SE). Statistical significance was determined using two-sample two-tailed *t*-tests. The chi-squared test was used to compare POLD3 expression between normal brain and LGG tissue, as well as to analyze the relationship between the expression of POLD3 and several clinical features. Kaplan–Meier analysis was used to document the correlation between POLD3 expression and the OS of patients with LGG. Receiver operating characteristic (ROC) curves were used to calculate the diagnostic value of POLD3 in patients with LGG. Cox regression analysis was used to determine whether the high expression of POLD3 was a risk factor for patients with LGG. Pearson analysis was used to search for the co-expressed genes of POLD3. All results were derived by R software (version 4.0.3), Significance levels are denoted as follows: * P P P P Results POLD3 is highly expressed in LGG The GEPIA database analysis revealed that POLD3 expression levels were significantly higher in the study group compared with the control group (Fig. 1 1 1 1 POLD3 correlates with malignant clinical characteristics in patients with LGG Integrating transcriptomic profiles from the TCGA and CGGA cohorts, we evaluated the prognostic relevance of POLD3 expression patterns in LGG patients. Clinicopathological variables included WHO grade, patient age, histological type, radiotherapy status, chemotherapy status, 1p/19q codeletion status, and IDH mutation status. WHO grade showed a positive correlation with POLD3 expression, with significantly higher expression observed in grade III tumors compared with grade II tumors (Fig. 2 2 2 2 2  Fig. 1 POLD3 is highly expressed in LGG A-B C D E F p p p p Moreover, POLD3 expression was associated with 1p/19q codeletion and IDH mutation status (Fig. 2  Fig. 2 POLD3 correlates with malignant clinical characteristics in patients with LGG A-E F-H I A p B p C D P E P F G P H P I P POLD3 overexpression is an independent risk indicator for poor survival in LGG Using transcriptomic and clinical data from the CGGA and TCGA cohorts, we evaluated the impact of POLD3 expression on patient survival. Patients were stratified into high- and low-expression groups based on median POLD3 expression levels, and Kaplan–Meier survival curves were generated to assess overall survival (OS). Across both datasets, OS was markedly shorter in the high-expression group compared with the low-expression group (Fig. 3 GSE43378 GSE4412 GSE50025 3 3  Fig. 3 POLD3 overexpression is an independent risk indicator for poor survival in LGG. A-C P P E-G D GSE43378 GSE4412 GSE50025 These findings underscore the high diagnostic and prognostic value of POLD3 in LGG. Finally, univariate and multivariate Cox regression analyses were conducted across multiple datasets to determine whether POLD3 expression serves as an independent prognostic factor (Fig. 4  Fig. 4 POLD3 overexpression is an independent risk indicator for poor survival in LGG. A C E B D F POLD3 expression is associated with Immune microenvironment in LGG The association between POLD3 expression and immune cell infiltration in LGG was evaluated using the TIMER database. The analysis revealed that POLD3 expression was positively correlated with the infiltration levels of B cells, CD8⁺T cells, CD4⁺T cells, neutrophils, macrophages, and stromal cells (Fig. 5 5 5 5  Fig. 5 POLD3 expression is associated with immunity in LGG. A p p p B C-E F G Correlation analysis revealed that POLD3 expression was positively associated with eosinophils, M0 macrophages, and M2 macrophages, with correlation coefficients of 0.23 ( p p R p 5 6 7  Fig. 6 POLD3 expression correlates with immune cell infiltration and immune checkpoint molecule in LGG. A-L P P P P P P P P P P P Among these markers, proliferating cell nuclear antigen (PCNA) serves as a key indicator of cell proliferation and is involved in DNA replication, DNA damage repair, and cell cycle regulation [ 21 22  Fig. 7 POLD3 expression correlates with immune cell infiltration and immune checkpoint molecule in LGG. A B p p p Subsequently, the expression levels of CD163, CD4, PCNA, and PD-L1 were compared across the three POLD3 expression groups using t-tests. As anticipated, the expression of all four markers increased progressively from the low- to the high-POLD3 expression group, further supporting the positive association between POLD3 expression and both tumor cell proliferation and the immune microenvironment in LGG (Fig. 7 Gene set enrichment analysis (GSEA) of POLD3 in LGG reveals critical functional associations Pearson correlation analysis identified ten genes significantly associated with POLD3 expression. Among them, five genes—FAM111B, CDK2, STIL, CENPL, and ASF1B showed a positive correlation, whereas MAPK3, ITPK1, SPOCK2, IGIP, and ALDH2 exhibited a negative correlation (Fig. 8 8 8  Fig. 8 Gene Set Enrichment Analysis (GSEA) of POLD3 in LGG reveals critical functional associations. A-B C D p p p shPOLD3 suppresses biological behaviors of LGG in vitro We investigated the functional role of POLD3 in regulating the malignant phenotype of LGG.POLD3 gene knockdown was performed in SHG44 and U251 cell lines by constructing stable cell lines expressing shNC, shPOLD3−1, and shPOLD3−2. The efficiency of knockdown was confirmed by RT-qPCR and Western blot analysis (Fig. 9 9 9 9  Fig. 9 shPOLD3 suppresses biological behaviors of LGG in vitro. A-B C D E F p p p POLD3 promotes glioma proliferation and is associated with the immune microenvironment in vivo To investigate the role of POLD3 in LGG tumorigenesis in vivo, we established an intracranial xenograft model in BALB/c nude mice. Stable U87-luc cell lines expressing shNC, shPOLD3−1, or shPOLD3−2 were generated and subsequently implanted intracranially for tumor formation assays (Fig. 10 10 10 10 10 10  Fig. 10 POLD3 promotes glioma proliferation in vivo and is associated with the immune microenvironment. A B N C D E F G p p p Discussion The main feature of tumor cells is their enhanced DNA repair capacity [ 23 24 We confidently predicted the high expression of POLD3 in LGG and subsequently collected tumor and adjacent non-tumor tissue samples from patients for immunohistochemistry. We compared POLD3 expression in LGG tissues with that in HA1800, SHG44, U251, and U87 cell lines, finding markedly higher expression in SHG44 and U251 cells. Western blot and RT-qPCR confirmed the efficiency of POLD3 knockdown, after which CCK8 assays were performed to assess its effect on LGG cell proliferation. Clonogenic assays showed that POLD3 knockdown reduced the colony-forming capacity of SHG44 and U251 cells. Scratch wound and Transwell assays further demonstrated that silencing POLD3 significantly impaired the migratory potential of both cell lines. Flow cytometric cell cycle analysis revealed a reduction in the proportion of cells in the S phase, underscoring the role of POLD3 in cell cycle regulation. To validate these in vitro findings, we established an in vivo mouse glioblastoma model, dividing animals into experimental and control groups, and compared survival time, tumor volume, body weight changes, and immune cell profiles. These results collectively support the inhibitory effect of POLD3 downregulation on LGG in vivo. In this study, we first confirmed that POLD3 overexpression is linked to poor prognosis in LGG patients. However, its role in regulating cell signaling pathways requires further clarification. GSEA analysis indicated that POLD3 expression enhances the activity of cancer- related signaling pathways. DNA repair mechanisms—such as nucleotide excision repair (NER), base excision repair (BER), non-homologous end joining (NHEJ), and DNA-PKcs-NHEJ are crucial in tumor cells [ 25 26 27 28 GSEA further revealed that POLD3 may promote LGG progression via the cell cycle pathway, which is fundamental to tumor cell proliferation and therapeutic resistance [ 29 30 31 There is compelling evidence that FAM111B participates in DNA repair and cell cycle regulation during tumor cell proliferation [ 32 32 33 34 CD4⁺T cells, CD8⁺T cells, B cells, and natural killer cells are integral components of the tumor immune microenvironment, playing crucial roles in immune evasion and tumor progression [ 35 r p 36 37 38 39 The findings of our study advance the understanding of the relationship between POLD3 and LGG. However, certain limitations must be acknowledged. First, elucidating the precise role of POLD3 in LGG pathogenesis requires consideration of diverse clinical factors, including diagnosis and treatment modalities. Second, although validation using multiple public databases strengthens our conclusions, differences in data sources and the lack of standardized exclusion criteria introduce challenges in comparability. Conclusion We predict that POLD3 is closely associated with the molecular and clinical characteristics of LGG. Through comprehensive in vitro and in vivo experiments, we validated its functional role in LGG progression. These findings suggest that POLD3 may serve as a prognostic biomarker and potential therapeutic target, providing new avenues for precision treatment of LGG. Supplementary Information  Supplementary Material 1. Abbreviations POLD3 DNA polymerase delta subunit 3 LGG Low-Grade Glioma TCGA The Cancer Genome Atlas CGGA Chinese Glioma Genome Atlas TIMER The Tumor Immune Estimation Resource GSEA Gene Set Enrichment Analysis GBM Glioblastoma IDH Isocitrate dehydrogenase MGMT The O6-methylguanine-DNA methyltransferase DDR DNA damage response GEPIA Gene Expression Profiling Interactive Analysis KEGG Kyoto Encyclopedia of Genes and Genomes OS Overall survival PFS Progression-free survival PPS Post-progression survival ROC Receiver Operating Characteristic A Astrocytoma AA Mesenchymal astrocytoma MG Mixed glioma O Oligodendroglioma OA Mesenchymal oligodendroglioma RT-qPCR Reverse Transcription Quantitative Polymerase Chain Reaction RNAseq RNA Sequencing BCA Bicinchoninic acid SDS-PAGE Sodium Dodecyl Sulphate Polyacrylamide GelElectrophoresis PMSF Phenylmethylsulfonyl fluoride PVDF Polyvinylidene fluoride TBST Tris-buffered saline with 0.1% Tween-20 ECL Enhanced chemiluminescence cDNA Complementary DNA RNA Ribonucleic Acid GAPDH Glyceraldehyde-3-phosphate dehydrogenase FBS Foetal Bovine Serum CCK8 Cell Counting Kit-8 shRNA Short hairpin RNA FAM111B FAM111 Trypsin Like Peptidase B CDK2 Cyclin Dependent Kinase 2 STIL Standard Test Interface Language CENPL Centromere Protein L ASF1B Anti-Silencing Function 1B Histone Chaperone MAPK3 Mitogen-Activated Protein Kinase 3 ITPK1 Inositol-Tetrakisphosphate 1-Kinase SPOCK2 SPARC (osteonectin),cwcv and kazal like domains proteoglycan 2 IGIP IgA-Inducing Protein Homolog ALDH2 Acetaldehyde dehydrogenase 2 NER Nucleotide excision repair BER Base excision repair NHEJ Non-homologous end joining HRD Homologous recombination-deficient Publisher’s Note Springer Nature remains neutral with regard to jurisdictional claims in published maps and institutional affiliations. Acknowledgements We thank all members of the JCBI group for their help. Especially, Meijun Wang.We apologize to those authors whose relevant work could not be included in this article due to space limitations. Authors’ contributions Z.Y. performed the experimental validation, analyzed the data and wrote the manuscript.Z.D.,andZ.H.Collection of clinical samples H.W.,Y.G.,Y.B. and J.L.contributed to the review and amendment of the manuscript. R.Q. Design and supervised the project. Funding Not applicable. Data availability The TCGA cohort data are publicly available and can be obtained from the accessible link of NCI’s Genomic Data Commons portal. The CGGA database is also publicly available. Three independent GEO datasets ( GSE43378 GSE4412 GSE50025 Declarations Ethics approval and consent to participate The experimental principles of this study follow the Declaration of Helsinki.All tissue samples in this study were obtained from Henan Provincial People’s Hospital the study protocol was approved by the Ethics Committee of Henan Provincial People’s Hospital (Ethics No. 2020107). The animal experiment was approved by the Ethics Committee of Henan University Medical College. (Approval No.:HUSOM2025−704) Consent for publication Not applicable. Competing interests The authors declare no competing interests. References 1. Xu S Tang L Li X Fan F Liu Z Immunotherapy for glioma: current management and future application Cancer Lett 2020 476 1 12 10.1016/j.canlet.2020.02.002 32044356 Xu S, Tang L, Li X, Fan F, Liu Z. Immunotherapy for glioma: current management and future application. Cancer Lett. 2020;476:1–12. 32044356 10.1016/j.canlet.2020.02.002 2. Tian W Yan G Chen K Han X Zhang W Sun L Zhang Q Zhang Y Li Y Liu M Zhang Q Development and validation of a novel prognostic model for lower-grade glioma based on enhancer RNA-regulated prognostic genes Front Oncol 2022 12 714338 10.3389/fonc.2022.714338 35299740 PMC8921558 Tian W, Yan G, Chen K, Han X, Zhang W, Sun L, et al. Development and validation of a novel prognostic model for lower-grade glioma based on enhancer RNA-regulated prognostic genes. Front Oncol. 2022;12:714338. 35299740 10.3389/fonc.2022.714338 PMC8921558 3. Louis DN Perry A Wesseling P Brat DJ Cree IA Figarella-Branger D Hawkins C Ng HK Pfister SM Reifenberger G The 2021 WHO classification of tumors of the central nervous system: a summary Neuro Oncol 2021 23 8 1231 51 10.1093/neuonc/noab106 34185076 PMC8328013 Louis DN, Perry A, Wesseling P, Brat DJ, Cree IA, Figarella-Branger D, Hawkins C, Ng HK, Pfister SM, Reifenberger G, et al. The 2021 WHO classification of tumors of the central nervous system: a summary. Neuro Oncol. 2021;23(8):1231–51. 34185076 10.1093/neuonc/noab106 PMC8328013 4. Gusyatiner O Hegi ME Glioma epigenetics: from subclassification to novel treatment options Semin Cancer Biol 2018 51 50 8 10.1016/j.semcancer.2017.11.010 29170066 Gusyatiner O, Hegi ME. Glioma epigenetics: from subclassification to novel treatment options. Semin Cancer Biol. 2018;51:50–8. 29170066 10.1016/j.semcancer.2017.11.010 5. Schaff LR Mellinghoff IK Glioblastoma and other primary brain malignancies in adults: A review JAMA 2023 329 7 574 87 10.1001/jama.2023.0023 36809318 PMC11445779 Schaff LR, Mellinghoff IK. Glioblastoma and other primary brain malignancies in adults: A review. JAMA. 2023;329(7):574–87. 36809318 10.1001/jama.2023.0023 PMC11445779 6. Sait SF Giantini-Larsen AM Tringale KR Souweidane MM Karajannis MA Treatment of pediatric low-grade gliomas Curr Neurol Neurosci Rep 2023 23 4 185 99 10.1007/s11910-023-01257-3 36881254 PMC10121885 Sait SF, Giantini-Larsen AM, Tringale KR, Souweidane MM, Karajannis MA. Treatment of pediatric low-grade gliomas. Curr Neurol Neurosci Rep. 2023;23(4):185–99. 36881254 10.1007/s11910-023-01257-3 PMC10121885 7. Schaff LR Ioannou M Geurts M van den Bent MJ Mellinghoff IK Schreck KC State of the Art in Low-Grade glioma management: insights from isocitrate dehydrogenase and beyond Am Soc Clin Oncol Educ Book 2024 44 3 e431450 10.1200/EDBK_431450 38723228 PMC11651235 Schaff LR, Ioannou M, Geurts M, van den Bent MJ, Mellinghoff IK, Schreck KC. State of the Art in Low-Grade glioma management: insights from isocitrate dehydrogenase and beyond. Am Soc Clin Oncol Educ Book. 2024;44(3):e431450. 38723228 10.1200/EDBK_431450 PMC11651235 8. Kazerooni AF, Kraya A, Rathi KS, Kim MC, Kesherwani V, Corbett R, Vossough A, Khalili N, Gandhi D, Familiar N, et al. Imaging clusters of pediatric Low-Grade glioma are associated with distinct molecular characteristics. AJNR Am J Neuroradiol. 2025;46(8):1716–25. 10.3174/ajnr.A8699 PMC12453517 39952665 9. Horbinski C Berger T Packer RJ Wen PY Clinical implications of the 2021 edition of the WHO classification of central nervous system tumours Nat Rev Neurol 2022 18 9 515 29 10.1038/s41582-022-00679-w 35729337 Horbinski C, Berger T, Packer RJ, Wen PY. Clinical implications of the 2021 edition of the WHO classification of central nervous system tumours. Nat Rev Neurol. 2022;18(9):515–29. 35729337 10.1038/s41582-022-00679-w 10. Malik H Hudaib M Rehman A Vorasidenib- a paradigm shift in IDH1- or IDH2-mutant low-grade glioma treatment J Pak Med Assoc 2024 74 10 1912 3 10.47391/JPMA.20428 39407401 Malik H, Hudaib M, Rehman A. Vorasidenib- a paradigm shift in IDH1- or IDH2-mutant low-grade glioma treatment. J Pak Med Assoc. 2024;74(10):1912–3. 39407401 10.47391/JPMA.20428 11. Wu S Li X Gao F de Groot JF Koul D Yung WKA PARP-mediated parylation of MGMT is critical to promote repair of temozolomide-induced O6-methylguanine DNA damage in glioblastoma Neuro Oncol 2021 23 6 920 31 10.1093/neuonc/noab003 33433610 PMC8168825 Wu S, Li X, Gao F, de Groot JF, Koul D, Yung WKA. PARP-mediated parylation of MGMT is critical to promote repair of temozolomide-induced O6-methylguanine DNA damage in glioblastoma. Neuro Oncol. 2021;23(6):920–31. 33433610 10.1093/neuonc/noab003 PMC8168825 12. Ozair A Bhat V Alisch RS Khosla AA Kotecha RR Odia Y McDermott MW Ahluwalia MS DNA methylation and histone modification in low-grade gliomas: current understanding and potential clinical targets Cancers (Basel) 2023 10.3390/cancers15041342 36831683 PMC9954183 Ozair A, Bhat V, Alisch RS, Khosla AA, Kotecha RR, Odia Y, et al. DNA methylation and histone modification in low-grade gliomas: current understanding and potential clinical targets. Cancers (Basel). 2023. 10.3390/cancers15041342. 36831683 10.3390/cancers15041342 PMC9954183 13. Shaw R Basu M Karmakar S Ghosh MK MGMT in TMZ-based glioma therapy: multifaceted insights and clinical trial perspectives Biochim Biophys Acta Mol Cell Res 2024 1871 3 119673 10.1016/j.bbamcr.2024.119673 38242327 Shaw R, Basu M, Karmakar S, Ghosh MK. MGMT in TMZ-based glioma therapy: multifaceted insights and clinical trial perspectives. Biochim Biophys Acta Mol Cell Res. 2024;1871(3):119673. 38242327 10.1016/j.bbamcr.2024.119673 14. Li Q Qian W Zhang Y Hu L Chen S Xia Y A new wave of innovations within the DNA damage response Signal Transduct Target Ther 2023 8 1 338 10.1038/s41392-023-01548-8 37679326 PMC10485079 Li Q, Qian W, Zhang Y, Hu L, Chen S, Xia Y. A new wave of innovations within the DNA damage response. Signal Transduct Target Ther. 2023;8(1):338. 37679326 10.1038/s41392-023-01548-8 PMC10485079 15. Tian C Zhang Q Jia J Zhou J Zhang Z Karri S Jiang J Dickinson Q Yao Y Tang X DNA polymerase delta governs parental histone transfer to DNA replication lagging strand Proc Natl Acad Sci U S A 2024 121 20 e2400610121 10.1073/pnas.2400610121 38713623 PMC11098083 Tian C, Zhang Q, Jia J, Zhou J, Zhang Z, Karri S, et al. DNA polymerase delta governs parental histone transfer to DNA replication lagging strand. Proc Natl Acad Sci U S A. 2024;121(20):e2400610121. 38713623 10.1073/pnas.2400610121 PMC11098083 16. Shen X Su Z Dou Y Song X A novel investigation into an E2F transcription factor-related prognostic model with seven signatures for colon cancer patients IET Syst Biol 2023 17 4 187 97 10.1049/syb2.12069 37431829 PMC10439494 Shen X, Su Z, Dou Y, Song X. A novel investigation into an E2F transcription factor-related prognostic model with seven signatures for colon cancer patients. IET Syst Biol. 2023;17(4):187–97. 37431829 10.1049/syb2.12069 PMC10439494 17. Garcia-Del Rio DF Derhourhi M Bonnefond A Leblanc S Guilloy N Roucou X Eyckerman S Gevaert K Salzet M Cardon T Deciphering the ghost proteome in ovarian cancer cells by deep proteogenomic characterization Cell Death Dis 2024 15 9 712 10.1038/s41419-024-07046-1 39349928 PMC11442847 Garcia-Del Rio DF, Derhourhi M, Bonnefond A, Leblanc S, Guilloy N, Roucou X, Eyckerman S, Gevaert K, Salzet M, Cardon T. Deciphering the ghost proteome in ovarian cancer cells by deep proteogenomic characterization. Cell Death Dis. 2024;15(9):712. 39349928 10.1038/s41419-024-07046-1 PMC11442847 18. Zong C Zhu T He J Huang R Jia R Shen J PARP mediated DNA damage response, genomic stability and immune responses Int J Cancer 2022 150 11 1745 59 10.1002/ijc.33918 34952967 Zong C, Zhu T, He J, Huang R, Jia R, Shen J. PARP mediated DNA damage response, genomic stability and immune responses. Int J Cancer. 2022;150(11):1745–59. 34952967 10.1002/ijc.33918 19. Wang T Liu W Shen Q Tao R Li C Shen Q Lin Y Huang Y Yang L Xie G Combination of PARP inhibitor and CDK4/6 inhibitor modulates cGAS/STING-dependent therapy-induced senescence and provides one-two punch opportunity with anti-PD-L1 therapy in colorectal cancer Cancer Sci 2023 114 11 4184 201 10.1111/cas.15961 37702298 PMC10637067 Wang T, Liu W, Shen Q, Tao R, Li C, Shen Q, et al. Combination of PARP inhibitor and CDK4/6 inhibitor modulates cGAS/STING-dependent therapy-induced senescence and provides one-two punch opportunity with anti-PD-L1 therapy in colorectal cancer. Cancer Sci. 2023;114(11):4184–201. 37702298 10.1111/cas.15961 PMC10637067 20. Harter P Trillsch F Okamoto A Reuss A Kim J-W Rubio-Pérez MJ Vardar MA Scambia G Tredan O Nyvang G-B Durvalumab with paclitaxel/carboplatin (PC) and bevacizumab (bev), followed by maintenance durvalumab, bev, and Olaparib in patients (pts) with newly diagnosed advanced ovarian cancer (AOC) without a tumor BRCA1/2 mutation (non-tBRCAm): results from the randomized, placebo (pbo)-controlled phase III DUO-O trial J Clin Oncol 2023 41 17suppl LBA5506 5506 10.1200/JCO.2023.41.17_suppl.LBA5506 Harter P, Trillsch F, Okamoto A, Reuss A, Kim J-W, Rubio-Pérez MJ, Vardar MA, Scambia G, Tredan O, Nyvang G-B, et al. Durvalumab with paclitaxel/carboplatin (PC) and bevacizumab (bev), followed by maintenance durvalumab, bev, and Olaparib in patients (pts) with newly diagnosed advanced ovarian cancer (AOC) without a tumor BRCA1/2 mutation (non-tBRCAm): results from the randomized, placebo (pbo)-controlled phase III DUO-O trial. J Clin Oncol. 2023;41(17suppl):LBA5506–5506. 21. Fielden J Siegner SM Gallagher DN Schröder MS Dello Stritto MR Lam S Kobel L Schlapansky MF Jackson SP Cejka P Comprehensive interrogation of synthetic lethality in the DNA damage response Nature 2025 640 8060 1093 102 10.1038/s41586-025-08815-4 40205037 PMC12018271 Fielden J, Siegner SM, Gallagher DN, Schröder MS, Dello Stritto MR, Lam S, Kobel L, Schlapansky MF, Jackson SP, Cejka P, et al. Comprehensive interrogation of synthetic lethality in the DNA damage response. Nature. 2025;640(8060):1093–102. 40205037 10.1038/s41586-025-08815-4 PMC12018271 22. Mondol T Stodola JL Galletto R Burgers PM PCNA accelerates the nucleotide incorporation rate by DNA polymerase δ Nucleic Acids Res 2019 47 4 1977 86 10.1093/nar/gky1321 30605530 PMC6393303 Mondol T, Stodola JL, Galletto R, Burgers PM. PCNA accelerates the nucleotide incorporation rate by DNA polymerase δ. Nucleic Acids Res. 2019;47(4):1977–86. 30605530 10.1093/nar/gky1321 PMC6393303 23. Hopkins JL Lan L Zou L DNA repair defects in cancer and therapeutic opportunities Genes Dev 2022 36 5–6 278 93 10.1101/gad.349431.122 35318271 PMC8973847 Hopkins JL, Lan L, Zou L. DNA repair defects in cancer and therapeutic opportunities. Genes Dev. 2022;36(5–6):278–93. 35318271 10.1101/gad.349431.122 PMC8973847 24. Wen F Huang J Lu X Huang W Wang Y Bai Y Ruan S Gu S Chen X Shu P Identification and prognostic value of metabolism-related genes in gastric cancer Aging 2020 12 17 17647 61 10.18632/aging.103838 32920549 PMC7521523 Wen F, Huang J, Lu X, Huang W, Wang Y, Bai Y, et al. Identification and prognostic value of metabolism-related genes in gastric cancer. Aging. 2020;12(17):17647–61. 32920549 10.18632/aging.103838 PMC7521523 25. Zhao L Bao C Shang Y He X Ma C Lei X Mi D Sun Y The determinant of DNA repair pathway choices in ionising Radiation-Induced DNA Double-Strand breaks Biomed Res Int 2020 2020 4834965 10.1155/2020/4834965 32908893 PMC7468606 Zhao L, Bao C, Shang Y, He X, Ma C, Lei X, Mi D, Sun Y. The determinant of DNA repair pathway choices in ionising Radiation-Induced DNA Double-Strand breaks. Biomed Res Int. 2020;2020:4834965. 32908893 10.1155/2020/4834965 PMC7468606 26. Huang R Zhou PK DNA damage repair: historical perspectives, mechanistic pathways and clinical translation for targeted cancer therapy Signal Transduct Target Ther 2021 6 1 254 10.1038/s41392-021-00648-7 34238917 PMC8266832 Huang R, Zhou PK. DNA damage repair: historical perspectives, mechanistic pathways and clinical translation for targeted cancer therapy. Signal Transduct Target Ther. 2021;6(1):254. 34238917 10.1038/s41392-021-00648-7 PMC8266832 27. Engel JL Zhang X Wu M Wang Y Espejo Valle-Inclán J Hu Q Woldehawariat KS Sanders MA Smogorzewska A Chen J The Fanconi anemia pathway induces chromothripsis and ecDNA-driven cancer drug resistance Cell 2024 187 21 6055 e60706022 10.1016/j.cell.2024.08.001 39181133 PMC11490392 Engel JL, Zhang X, Wu M, Wang Y, Espejo Valle-Inclán J, Hu Q, Woldehawariat KS, Sanders MA, Smogorzewska A, Chen J, et al. The Fanconi anemia pathway induces chromothripsis and ecDNA-driven cancer drug resistance. Cell. 2024;187(21):6055–e60706022. 39181133 10.1016/j.cell.2024.08.001 PMC11490392 28. Peng X Zhang S Wang Y Zhou Z Yu Z Zhong Z Zhang L Chen ZS Claret FX Elkabets M Stellettin B sensitizes glioblastoma to DNA-Damaging treatments by suppressing PI3K-Mediated homologous recombination repair Adv Sci (Weinh) 2023 10 3 e2205529 10.1002/advs.202205529 36453577 PMC9875605 Peng X, Zhang S, Wang Y, Zhou Z, Yu Z, Zhong Z, Zhang L, Chen ZS, Claret FX, Elkabets M, et al. Stellettin B sensitizes glioblastoma to DNA-Damaging treatments by suppressing PI3K-Mediated homologous recombination repair. Adv Sci (Weinh). 2023;10(3):e2205529. 36453577 10.1002/advs.202205529 PMC9875605 29. Jamasbi E Hamelian M Hossain MA Varmira K The cell cycle, cancer development and therapy Mol Biol Rep 2022 49 11 10875 83 10.1007/s11033-022-07788-1 35931874 Jamasbi E, Hamelian M, Hossain MA, Varmira K. The cell cycle, cancer development and therapy. Mol Biol Rep. 2022;49(11):10875–83. 35931874 10.1007/s11033-022-07788-1 30. Riestra MR Pillay BA Willemsen M Kienapfel V Ehlers L Delafontaine S Pinton A Wouters M Hombrouck A Sauer K Human autosomal recessive DNA polymerase delta 3 deficiency presenting as omenn syndrome J Clin Immunol 2023 44 1 2 10.1007/s10875-023-01627-z 38099988 PMC11252662 Riestra MR, Pillay BA, Willemsen M, Kienapfel V, Ehlers L, Delafontaine S, Pinton A, Wouters M, Hombrouck A, Sauer K, et al. Human autosomal recessive DNA polymerase delta 3 deficiency presenting as omenn syndrome. J Clin Immunol. 2023;44(1):2. 38099988 10.1007/s10875-023-01627-z PMC11252662 31. Liu Y Su Z Tavana O Gu W Understanding the complexity of p53 in a new era of tumor suppression Cancer Cell 2024 42 6 946 67 10.1016/j.ccell.2024.04.009 38729160 PMC11190820 Liu Y, Su Z, Tavana O, Gu W. Understanding the complexity of p53 in a new era of tumor suppression. Cancer Cell. 2024;42(6):946–67. 38729160 10.1016/j.ccell.2024.04.009 PMC11190820 32. Wei F Li W Zhou T Yuan X Zhang L Unveiling FAM111B: a pan-cancer biomarker for DNA repair and immune infiltration Int J Mol Sci 2025 10.3390/ijms26073151 40243892 PMC11989846 Wei F, Li W, Zhou T, Yuan X, Zhang L. Unveiling FAM111B: a pan-cancer biomarker for DNA repair and immune infiltration. Int J Mol Sci. 2025. 10.3390/ijms26073151. 40243892 10.3390/ijms26073151 PMC11989846 33. Larriba E de Juan Romero C García-Martínez A Quintanar T Rodríguez-Lescure Á Soto JL Saceda M Martín-Nieto J Barberá VM Identification of new targets for glioblastoma therapy based on a DNA expression microarray Comput Biol Med 2024 179 108833 10.1016/j.compbiomed.2024.108833 38981212 Larriba E, de Juan Romero C, García-Martínez A, Quintanar T, Rodríguez-Lescure Á, Soto JL, et al. Identification of new targets for glioblastoma therapy based on a DNA expression microarray. Comput Biol Med. 2024;179:108833. 38981212 10.1016/j.compbiomed.2024.108833 34. Liu G Ren F Song Y Upregulation of SPOCK2 inhibits the invasion and migration of prostate cancer cells by regulating the MT1-MMP/MMP2 pathway PeerJ 2019 7 e7163 10.7717/peerj.7163 31338255 PMC6628882 Liu G, Ren F, Song Y. Upregulation of SPOCK2 inhibits the invasion and migration of prostate cancer cells by regulating the MT1-MMP/MMP2 pathway. PeerJ. 2019;7:e7163. 31338255 10.7717/peerj.7163 PMC6628882 35. Xiao Y Yu D Tumor microenvironment as a therapeutic target in cancer Pharmacol Ther 2021 221 107753 10.1016/j.pharmthera.2020.107753 33259885 PMC8084948 Xiao Y, Yu D. Tumor microenvironment as a therapeutic target in cancer. Pharmacol Ther. 2021;221:107753. 33259885 10.1016/j.pharmthera.2020.107753 PMC8084948 36. Haddad AF Young JS Oh JY Okada H Aghi MK The immunology of low-grade gliomas Neurosurg Focus 2022 52 2 E2 10.3171/2021.11.FOCUS21587 35104791 PMC9283531 Haddad AF, Young JS, Oh JY, Okada H, Aghi MK. The immunology of low-grade gliomas. Neurosurg Focus. 2022;52(2):E2. 35104791 10.3171/2021.11.FOCUS21587 PMC9283531 37. Guo X Pan Y Xiong M Sanapala S Anastasaki C Cobb O Dahiya S Gutmann DH Midkine activation of CD8(+) T cells establishes a neuron-immune-cancer axis responsible for low-grade glioma growth Nat Commun 2020 11 1 2177 10.1038/s41467-020-15770-3 32358581 PMC7195398 Guo X, Pan Y, Xiong M, Sanapala S, Anastasaki C, Cobb O, et al. Midkine activation of CD8(+) T cells establishes a neuron-immune-cancer axis responsible for low-grade glioma growth. Nat Commun. 2020;11(1):2177. 32358581 10.1038/s41467-020-15770-3 PMC7195398 38. Wen J Huang Q Yao J Wei W Li Z Zhang H Chang S Pei H Cao Y Li H Focusing on scRNA-seq-Derived T Cell-Associated genes to identify prognostic signature and immune microenvironment status in Low-Grade glioma Mediators Inflamm 2023 2023 3648946 10.1155/2023/3648946 37292257 PMC10247320 Wen J, Huang Q, Yao J, Wei W, Li Z, Zhang H, Chang S, Pei H, Cao Y, Li H. Focusing on scRNA-seq-Derived T Cell-Associated genes to identify prognostic signature and immune microenvironment status in Low-Grade glioma. Mediators Inflamm. 2023;2023:3648946. 37292257 10.1155/2023/3648946 PMC10247320 39. Barakat R Chatterjee J Mu R Qi X Gu X Smirnov I Cobb O Gao K Barnes A Kipnis J Gutmann DH Human single cell RNA-sequencing reveals a targetable CD8(+) exhausted T cell population that maintains mouse low-grade glioma growth Nat Commun 2024 15 1 10312 10.1038/s41467-024-54569-4 39609412 PMC11605098 Barakat R, Chatterjee J, Mu R, Qi X, Gu X, Smirnov I, et al. Human single cell RNA-sequencing reveals a targetable CD8(+) exhausted T cell population that maintains mouse low-grade glioma growth. Nat Commun. 2024;15(1):10312. 39609412 10.1038/s41467-024-54569-4 PMC11605098 ",
  "metadata": {
    "Title of this paper": "Human single cell RNA-sequencing reveals a targetable CD8(+) exhausted T cell population that maintains mouse low-grade glioma growth",
    "Journal it was published in:": "BMC Cancer",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12486970/"
  }
}