{
  "title": "Paper_561",
  "abstract": "pmc Viruses Viruses 1559 viruses viruses Viruses 1999-4915 Multidisciplinary Digital Publishing Institute  (MDPI) PMC12474433 PMC12474433.1 12474433 12474433 41012578 10.3390/v17091150 viruses-17-01150 1 Perspective Viral Infections in Type 2 Diabetes: A Dangerous Liaison https://orcid.org/0000-0002-3772-9773 Haque Azizul 1 * Pant Anudeep B. 2 Zeichner Steven L. Academic Editor 1 2 anudeep.pant1@gmail.com * azizul.haque@dartmouth.edu 22 8 2025 9 2025 17 9 497677 1150 14 7 2025 13 8 2025 18 8 2025 22 08 2025 28 09 2025 29 09 2025 © 2025 by the authors. 2025 https://creativecommons.org/licenses/by/4.0/ Licensee MDPI, Basel, Switzerland. This article is an open access article distributed under the terms and conditions of the Creative Commons Attribution (CC BY) license ( https://creativecommons.org/licenses/by/4.0/ Type 2 diabetes mellitus (T2DM) is increasing in incidence in many parts of the world and is becoming an important global health threat. T2DM results from a disturbance in glucose metabolism and is triggered by a combination of genetic and environmental factors. In regions where diabetes is prevalent, viral infections are also common; both conditions can contribute to increased blood sugar levels. We hypothesize that under these conditions, viral infections could accelerate many of the complications of T2DM in predisposed individuals. The high glucose levels may negatively impact blood vessel structure, white blood cell function, and infection-fighting proteins, which may weaken the immune response and, in turn, increase the frequency of viral infections in diabetic patients. Furthermore, viruses can stimulate an immune response, which induces inflammation and cytokine secretion. This perspective article postulates the existence of an axis between T2DM and viral infections and highlights the mechanistic aspects underlying their connection. A better understanding of the mechanisms between viral infections and blood sugar is likely to reveal new therapeutic avenues for the treatment and management of these diseases. type 2 diabetes viral infections glucose homeostasis viral proteins immune dysregulation inflammation cytokines gut microbiome This research received no external funding. pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement no pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes 1. Introduction It is estimated that about 830 million people worldwide have diabetes, and cases are on the rise globally [ 1 2 There are two predominant subtypes of diabetes mellitus (DM): type 1 diabetes mellitus (T1DM) and type 2 (T2DM). Both types of DM are generally considered to be prompted by the combined effect of genetic and environmental factors. T1DM results from autoimmune destruction of insulin-producing β-cells [ 3 4 5 This perspective paper focuses on T2DM, which accounts for approximately 95% of cases globally [ 6 7 8 2. Viral Infections in the Context of Type 2 Diabetes Among the reported viral infections associated with diabetes in humans are coronavirus 2, hepatitis C virus, cytomegalovirus, human immunodeficiency virus, human papillomavirus, herpes simplex virus, and hepatitis B virus ( Figure 1 2.1. The Role of Inflammatory Mediators in Virus-Induced Diabetes In response to viral infections, the immune system produces inflammatory mediators such as cytokines and chemokines to facilitate viral clearance ( Table 1 9 10 11 Inflammation is also closely linked to hypoxia, especially in the context of viral infections and metabolic disorders [ 12 Figure 1 13 14 15 Viral infections can also trigger physiological changes in metabolism. In diabetes, the dysregulation of metabolic processes has been highlighted as an underlying cause for the increased susceptibility to viruses [ 16 17 Figure 1 2.2. SARS-CoV-2 The presence of diabetes increases the likelihood of developing complications from COVID-19; conversely, the virus may also promote the development of diabetes [ 18 19 Table 1 2 19 20 21 The inflammatory stress caused by COVID-19 infection is likely to be a leading contributor to newly diagnosed diabetes. Cytokines generated during SARS-CoV-2 infection, particularly interleukin (IL)-6 and IL-1β, may hasten the onset of metabolic changes by affecting glucose homeostasis [ 22 Table 1 23 24 25 There are also several overlapping mechanisms in the pathophysiology of diabetes and COVID-19 infection [ 26 27 28 29 30 31 Figure 1 23 32 33 In addition to the overlap in immune mechanisms, Golgi protein 73 (GP73) may also contribute to the reciprocal nature of DM and COVID-19. GP73 is a stress-induced secreted factor that activates gluconeogenesis, and recent studies demonstrate that this mechanism is pertinent to elevated blood glucose levels during SARS-CoV-2 infection [ 34 Table 1 35 36 37 38 Table 1 Taken together, these observations underline the diabetogenic potential of SARS-CoV-2; however, further studies are warranted to confirm whether SARS-CoV-2 indeed causes T2DM and, if so, whether it is due to viral persistence or other immune-mediated responses [ 23 2.3. Hepatitis C Virus (HCV) HCV and diabetes have also been demonstrated to have a complex and bidirectional relationship. HCV modulates glucose metabolism, promoting a nutrient-rich environment that assists viral persistence [ 39 40 32 41 Table 1 42 43 44 45 Table 1 46 47 HCV has been shown to cause mitochondrial dysfunction, which increases cellular glucose uptake and can then stimulate lipid synthesis and lipid droplet storage in infected cells [ 48 23 49 2.4. Cytomegalovirus (CMV) CMV is a prevalent pathogen among the general population [ 50 51 52 53 Figure 1 54 Emerging evidence adds a new layer of complexity. One study found that in women of normal weight, CMV infection is associated with a higher risk of metabolic syndrome; conversely, women with extreme obesity exhibited a more metabolically benign profile [ 55 While the diabetogenic mechanisms of CMV have been broadly investigated in T1DM, the viral mechanisms causing T2DM remain elusive [ 23 56 2 2.5. Human Immunodeficiency Virus (HIV) Individuals with HIV are living longer as a result of antiretroviral therapy (ART), which has made them at risk of aging-associated comorbidities such as diabetes [ 57 58 59 60 Direct effects of HIV infection, such as chronic inflammation, may also raise the risk of diabetes. Augmented levels of inflammatory molecules, such as TNFa and C-reactive protein, can impact insulin resistance [ 11 61 62 63 Table 1 64 65 Table 1 66 67 67 Co-infections are frequently seen in HIV individuals because of immunosuppression, which can further increase the risk of diabetes [ 68 2.6. Human Papillomavirus (HPV) According to the WHO, cervical cancer is the fourth leading cause of cancer in women globally, and persistent HPV is the etiological cause [ 69 70 71 72 Figure 1 73 2.7. Herpes Simplex Virus (HSV) Herpesviruses are one of the most widespread viruses in humans. At least five of the nine HSVs are widespread in human populations, and among them, HSV-1 and HSV-2 (also known as HHV-1 and HHV-2) are known to cause diseases. The HSV variants cause lifelong latent infections in their hosts [ 74 74 75 Figure 1 74 2.8. Hepatitis B Virus (HBV) HBV and T2DM are both major public health concerns that most reports suggest are closely linked; however, the exact mechanisms remain unclear [ 76 77 78 Figure 1 79 80 81 82 2.9. Changes to Gut Microbiota by Viral Infections That May Influence Cell Metabolism Recent studies implicate gut microbiome composition as a risk factor for T2DM [ 2 83 84 Figure 1 85 86 87 88 89 90 91 92 93 3. Conclusions Genetics, lifestyle, and the environment are major factors impacting the incidence of T2DM. Clearly, viruses may also contribute to the triggering or acceleration of diabetes in people with underlying predisposing factors. There are likely other underlying factors that can act in combination with viral infections to trigger virus-induced diabetes (2). Whether viral infections can directly initiate/elicit the onset of T2DM remains unknown, but the evidence demonstrates that viral infections can act as an accelerator, upregulating the metabolic process for the development of diabetes. In many tropical countries, we are seeing an increase in the incidence of diabetes. Viral infections prevalent in those countries may enhance the incidence of T2DM where they overlap with T2DM. The complex and reciprocal interplay between diabetes and viral infections was observed during the COVID-19 pandemic, where SARS-CoV-2 infection increased the risk of T2DM in susceptible prediabetic individuals. Immune-mediated changes, such as cytokine secretion in response to viral infections, appear to be an important underlying cause of insulin resistance in patients with metabolic disease. Despite mounting evidence that supports the direct and indirect associations of viruses in causing diabetes, the molecular mechanisms and specific predisposing factors of virus-induced diabetes remain an open question. The systematization and summary of data would facilitate correct comprehension of the relationship between seemingly different and unrelated disease states. A better understanding of the underlying molecular pathways of their bidirectional interactions would offer important new targets for future anti-diabetic therapies and pave the way for assessing targeted public health and preventative measures. Disclaimer/Publisher’s Note: Author Contributions A.H. conceived the concept and design of the paper and wrote the original draft. A.B.P. participated in the revision and editing process and contributed to the preparation of the figures. All authors have read and agreed to the published version of the manuscript. Conflicts of Interest The authors do not have any conflicts of interest to declare. References 1. World Health Organization Diabetes Available online: https://www.who.int/health-topics/diabetes#tab=tab_1 (accessed on 30 June 2025) 2. Haque A. Pant A.B. Climate Change and Type 2 Diabetes in Senegal, a Sub-Saharan Country: Interconnected Threats to Health and Development Brit. J. Healthc. Care. Med. Res. 2025 12 445 464 10.14738/bjhr.1203.19032 3. Roy S. Pokharel P. Piganelli J.D. Decoding the Immune Dance: Unraveling the Interplay between Beta Cells and Type 1 Diabetes Mol. Metab. 2024 88 101998 10.1016/j.molmet.2024.101998 39069156 PMC11342121 4. Roden M. Shulman G.I. The Integrative Biology of Type 2 Diabetes Nature 2019 576 51 60 10.1038/s41586-019-1797-8 31802013 5. Rahman M.S. Hossain K.S. Das S. Kundu S. Adegoke E.O. Rahman M.A. Hannan M.A. Uddin M.J. Pang M.-G. Role of Insulin in Health and Disease: An Update Int. J. Mol. Sci. 2021 22 6403 10.3390/ijms22126403 34203830 PMC8232639 6. Scully C. Endocrinology Scully’s Medical Problems in Dentistry Elsevier Amsterdam, The Netherlands 2014 171 198 9780702054013 7. Muniangi-Muhitu H. Akalestou E. Salem V. Misra S. Oliver N.S. Rutter G.A. COVID-19 and Diabetes: A Complex Bidirectional Relationship Front. Endocrinol. 2020 11 582936 10.3389/fendo.2020.582936 PMC7578412 33133024 8. Rajsfus B.F. Mohana-Borges R. Allonso D. Diabetogenic Viruses: Linking Viruses to Diabetes Mellitus Heliyon 2023 9 e15021 10.1016/j.heliyon.2023.e15021 37064445 PMC10102442 9. Shoelson S. Lee J. Goldfine A. Inflammation and Insulin Resistance J. Clin. Investig. 2006 116 1793 1801 10.1172/JCI29069 16823477 PMC1483173 10. Kumari A. Exploring the Function of Inflammatory Routes in Insulin Resistance: Interpreting the Inflammatory Veil of Medusa Hypoglycemia—New Insights IntechOpen London, UK 2024 11. Mohallem R. Aryal U.K. Regulators of TNFα Mediated Insulin Resistance Elucidated by Quantitative Proteomics Sci. Rep. 2020 10 20878 10.1038/s41598-020-77914-1 33257747 PMC7705713 12. Norouzirad R. González-Muniesa P. Ghasemi A. Hypoxia in Obesity and Diabetes: Potential Therapeutic Effects of Hyperoxia and Nitrate Oxid. Med. Cell. Longev. 2017 2017 5350267 10.1155/2017/5350267 28607631 PMC5457776 13. Caturano A. D’Angelo M. Mormone A. Russo V. Mollica M.P. Salvatore T. Galiero R. Rinaldi L. Vetrano E. Marfella R. Oxidative Stress in Type 2 Diabetes: Impacts from Pathogenesis to Lifestyle Modifications Curr. Issues Mol. Biol. 2023 45 6651 6666 10.3390/cimb45080420 37623239 PMC10453126 14. Darenskaya M.A. Kolesnikova L.I. Kolesnikov S.I. Oxidative Stress: Pathogenetic Role in Diabetes Mellitus and Its Complications and Therapeutic Approaches to Correction Bull. Exp. Biol. Med. 2021 171 179 189 10.1007/s10517-021-05191-7 34173093 PMC8233182 15. Tangvarasittichai S. Oxidative Stress, Insulin Resistance, Dyslipidemia and Type 2 Diabetes Mellitus World J. Diabetes 2015 6 456 480 10.4239/wjd.v6.i3.456 25897356 PMC4398902 16. Wensveen F.M. Šestan M. Turk Wensveen T. Polić B. “Beauty and the Beast” in Infection: How Immune-Endocrine Interactions Regulate Systemic Metabolism in the Context of Infection Eur. J. Immunol. 2019 49 982 995 10.1002/eji.201847895 31106860 17. Turk Wensveen T. Gašparini D. Rahelić D. Wensveen F.M. Type 2 Diabetes and Viral Infection; Cause and Effect of Disease Diabetes Res. Clin. Pract. 2021 172 108637 10.1016/j.diabres.2020.108637 33352263 PMC8050380 18. Guo W. Li M. Dong Y. Zhou H. Zhang Z. Tian C. Qin R. Wang H. Shen Y. Du K. Diabetes Is a Risk Factor for the Progression and Prognosis of COVID-19 Diabetes Metab. Res. Rev. 2020 36 e3319 10.1002/dmrr.3319 32233013 PMC7228407 19. Reiterer M. Rajan M. Gómez-Banoy N. Lau J.D. Gomez-Escobar L.G. Ma L. Gilani A. Alvarez-Mulett S. Sholle E.T. Chandar V. Hyperglycemia in Acute COVID-19 Is Characterized by Insulin Resistance and Adipose Tissue Infectivity by SARS-CoV-2 Cell Metab. 2021 33 2174 2188.e5 10.1016/j.cmet.2021.09.009 34599884 PMC8443335 20. Vargas-Vázquez A. Bello-Chavolla O.Y. Ortiz-Brizuela E. Campos-Muñoz A. Mehta R. Villanueva-Reza M. Bahena-López J.P. Antonio-Villa N.E. González-Lara M.F. Ponce de León A. Impact of Undiagnosed Type 2 Diabetes and Pre-Diabetes on Severity and Mortality for SARS-CoV-2 Infection BMJ Open Diabetes Res. Care 2021 9 e002026 10.1136/bmjdrc-2020-002026 PMC7887863 33593750 21. Yuan S. Li H. Chen C. Wang F. Wang D.W. Association of Glycosylated Haemoglobin HbA1c Levels with Outcome in Patients with COVID-19: A Retrospective Study J. Cell. Mol. Med. 2021 25 3484 3497 10.1111/jcmm.16431 33694276 PMC8034481 22. Montefusco L. Ben Nasr M. D’Addio F. Loretelli C. Rossi A. Pastore I. Daniele G. Abdelsalam A. Maestroni A. Dell’Acqua M. Acute and Long-Term Disruption of Glycometabolic Control after SARS-CoV-2 Infection Nat. Metab. 2021 3 774 785 10.1038/s42255-021-00407-6 34035524 PMC9931026 23. Jeremiah S.S. Moin A.S.M. Butler A.E. Virus-Induced Diabetes Mellitus: Revisiting Infection Etiology in Light of SARS-CoV-2 Metabolism 2024 156 155917 10.1016/j.metabol.2024.155917 38642828 24. Acosta-Martinez M. Maria Z.C. The PI3K/Akt Pathway in Meta-Inflammation Int. J. Mol. Sci. 2022 23 15330 10.3390/ijms232315330 36499659 PMC9740745 25. Jager J. Grémeaux T. Cormont M. Marchand-Brustel Y.L. Tanti J.-F. Interleukin-1beta-Induced Insulin Resistance in Adipocytes through down-Regulation of Insulin Receptor Substrate-1 Expression Endocrinology 2007 148 241 251 10.1210/en.2006-0692 17038556 PMC1971114 26. Haque A. Pant A.B. The Coevolution of COVID-19 and Host Immunity Explor. Med. 2024 5 167 184 10.37349/emed.2024.00214 27. Shoukat M. Khan H. Nazish M. Rehman A. Raashid S. Ahmed S. Munir W. Alrefaei A.F. Umair M. Bin Abid M.O. Comparative Analysis of C-Reactive Protein Levels among Non-Comorbid, Comorbid, and Multimorbid Hospitalized COVID-19 Patients BMC Infect. Dis. 2025 25 59 10.1186/s12879-024-10314-2 39810122 PMC11730823 28. Zhou Y. Chi J. Lv W. Wang Y. Obesity and Diabetes as High-Risk Factors for Severe Coronavirus Disease 2019 (COVID-19) Diabetes Metab. Res. Rev. 2021 37 e3377 10.1002/dmrr.3377 32588943 PMC7361201 29. Drucker D.J. Diabetes, Obesity, Metabolism, and SARS-CoV-2 Infection: The End of the Beginning Cell Metab. 2021 33 479 498 10.1016/j.cmet.2021.01.016 33529600 PMC7825982 30. Abu-Farha M. Al-Mulla F. Thanaraj T.A. Kavalakatt S. Ali H. Abdul Ghani M. Abubaker J. Impact of Diabetes in Patients Diagnosed with COVID-19 Front. Immunol. 2020 11 576818 10.3389/fimmu.2020.576818 33335527 PMC7736089 31. Sosale A. Sosale B. Kesavadev J. Chawla M. Reddy S. Saboo B. Misra A. Steroid Use during COVID-19 Infection and Hyperglycemia—What a Physician Should Know Diabetes Metab. Syndr. 2021 15 102167 10.1016/j.dsx.2021.06.004 34186344 PMC8189750 32. Ueki K. Kondo T. Kahn C.R. Suppressor of Cytokine Signaling 1 (SOCS-1) and SOCS-3 Cause Insulin Resistance through Inhibition of Tyrosine Phosphorylation of Insulin Receptor Substrate Proteins by Discrete Mechanisms Mol. Cell. Biol. 2004 24 5434 5446 10.1128/MCB.24.12.5434-5446.2004 15169905 PMC419873 33. Zhang L. Badgwell D.B. Bevers J.J. III Schlessinger K. Murray P.J. Levy D.E. Watowich S.S. IL-6 Signaling via the STAT3/SOCS3 Pathway: Functional Analysis of the Conserved STAT3 N-Domain Mol. Cell. Biochem. 2006 288 179 189 10.1007/s11010-006-9137-3 16718380 PMC2441693 34. Wan L. Gao Q. Deng Y. Ke Y. Ma E. Yang H. Lin H. Li H. Yang Y. Gong J. GP73 Is a Glucogenic Hormone Contributing to SARS-CoV-2-Induced Hyperglycemia Nat. Metab. 2022 4 29 43 10.1038/s42255-021-00508-2 34992299 35. Haque A. Pant A.B. Mitigating COVID-19 in the Face of Emerging Virus Variants, Breakthrough Infections and Vaccine Hesitancy J. Autoimmun. 2022 127 102792 10.1016/j.jaut.2021.102792 34995958 PMC8719928 36. Li M.-Y. Li L. Zhang Y. Wang X.-S. Expression of the SARS-CoV-2 Cell Receptor Gene ACE2 in a Wide Variety of Human Tissues Infect. Dis. Poverty 2020 9 45 10.1186/s40249-020-00662-x 32345362 PMC7186534 37. Roca-Ho H. Riera M. Palau V. Pascual J. Soler M.J. Characterization of ACE and ACE2 Expression within Different Organs of the NOD Mouse Int. J. Mol. Sci. 2017 18 563 10.3390/ijms18030563 28273875 PMC5372579 38. Shin J. Toyoda S. Nishitani S. Onodera T. Fukuda S. Kita S. Fukuhara A. Shimomura I. SARS-CoV-2 Infection Impairs the insulin/IGF Signaling Pathway in the Lung, Liver, Adipose Tissue, and Pancreatic Cells via IRF1 Metabolism 2022 133 155236 10.1016/j.metabol.2022.155236 35688210 PMC9173833 39. Darweesh M. Mohammadi S. Rahmati M. Al-Hamadani M. Al-Harrasi A. Metabolic Reprogramming in Viral Infections: The Interplay of Glucose Metabolism and Immune Responses Front. Immunol. 2025 16 1578202 10.3389/fimmu.2025.1578202 40453076 PMC12122472 40. Banerjee S. Saito K. Ait-Goughoulte M. Meyer K. Ray R.B. Ray R. Hepatitis C Virus Core Protein Upregulates Serine Phosphorylation of Insulin Receptor Substrate-1 and Impairs the Downstream Akt/protein Kinase B Signaling Pathway for Insulin Resistance J. Virol. 2008 82 2606 2612 10.1128/JVI.01672-07 18160431 PMC2258989 41. Banks A.S. Li J. McKeag L. Hribal M.L. Kashiwada M. Accili D. Rothman P.B. Deletion of SOCS7 Leads to Enhanced Insulin Action and Enlarged Islets of Langerhans J. Clin. Investig. 2005 115 2462 2471 10.1172/JCI23853 16127460 PMC1190369 42. Parvaiz F. Manzoor S. Iqbal J. Sarkar-Dutta M. Imran M. Waris G. Hepatitis C Virus NS5A Promotes Insulin Resistance through IRS-1 Serine Phosphorylation and Increased Gluconeogenesis World J. Gastroenterol. 2015 21 12361 12369 10.3748/wjg.v21.i43.12361 26604643 PMC4649119 43. Aytug S. Impaired IRS-1/PI3-Kinase Signaling in Patients with HCV: A Mechanism for Increased Prevalence of Type 2 Diabetes Hepatology 2003 38 1384 1392 14647049 10.1016/j.hep.2003.09.012 44. Hsieh M.-J. Lan K.-P. Liu H.-Y. Zhang X.-Z. Lin Y.-F. Chen T.-Y. Chiou H.-L. Hepatitis C Virus E2 Protein Involve in Insulin Resistance through an Impairment of Akt/PKB and GSK3β Signaling in Hepatocytes BMC Gastroenterol. 2012 12 74 10.1186/1471-230X-12-74 22721429 PMC3464126 45. Nawaz R. Zahid S. Idrees M. Rafique S. Shahid M. Ahad A. Amin I. Almas I. Afzal S. HCV-Induced Regulatory Alterations of IL-1β, IL-6, TNF-α, and IFN-ϒ Operative, Leading Liver En-Route to Non-Alcoholic Steatohepatitis Inflamm. Res. 2017 66 477 486 10.1007/s00011-017-1029-3 28285394 46. Liu Y. Wang W. Zou Z. Fan Q. Hu Z. Feng Z. Zhu B. Xiong J. Monocyte Chemoattractant Protein 1 Released from Macrophages Induced by Hepatitis C Virus Promotes Monocytes Migration Virus Res. 2017 240 190 196 10.1016/j.virusres.2017.08.013 28860098 47. Sartipy P. Loskutoff D.J. Monocyte Chemoattractant Protein 1 in Obesity and Insulin Resistance Proc. Natl. Acad. Sci. USA 2003 100 7265 7270 10.1073/pnas.1133870100 12756299 PMC165864 48. Brault C. Levy P.L. Bartosch B. Hepatitis C Virus-Induced Mitochondrial Dysfunctions Viruses 2013 5 954 980 10.3390/v5030954 23518579 PMC3705306 49. Chen J. Wang F. Zhou Y. Jiang J. Ksimu S. Zhang X. Li J.Z. Niu J. Wang Q. Chronic Hepatitis C Virus Infection Impairs Insulin Secretion by Regulation of p38δ MAPK-Dependent Exocytosis in Pancreatic β-Cells Clin. Sci. 2020 134 529 542 10.1042/CS20190900 32100852 50. de Jong M.D. Galasso G.J. Gazzard B. Griffiths P.D. Jabs D.A. Kern E.R. Spector S.A. Summary of the II International Symposium on Cytomegalovirus Antivir. Res. 1998 39 141 162 10.1016/S0166-3542(98)00044-8 9833956 51. Yoo S.G. Han K.D. Lee K.H. La Y. Kwon D.E. Han S.H. Impact of Cytomegalovirus Disease on New-Onset Type 2 Diabetes Mellitus: Population-Based Matched Case-Control Cohort Study Diabetes Metab. J. 2019 43 815 829 10.4093/dmj.2018.0167 30688050 PMC6943276 52. Pak C.Y. Eun H.M. McArthur R.G. Yoon J.W. Association of Cytomegalovirus Infection with Autoimmune Type 1 Diabetes Lancet 1988 2 1 4 10.1016/S0140-6736(88)92941-8 2898620 53. Löhr J.M. Oldstone M.B. Detection of Cytomegalovirus Nucleic Acid Sequences in Pancreas in Type 2 Diabetes Lancet 1990 336 644 648 10.1016/0140-6736(90)92145-8 1975850 54. Wang X. Chen J. Cao Z. Yu X. Associations between Human Cytomegalovirus Infection and Type 2 Diabetes Mellitus: A Systematic Review and Meta-Analysis BMJ Open 2023 13 e071934 10.1136/bmjopen-2023-071934 37620256 PMC10450059 55. Fleck-Derderian S. McClellan W. Wojcicki J.M. The Association between Cytomegalovirus Infection, Obesity, and Metabolic Syndrome in U.S. Adult Females Obesity 2017 25 626 633 10.1002/oby.21764 28229547 56. Al Mana H. Yassine H.M. Younes N.N. Al-Mohannadi A. Al-Sadeq D.W. Alhababi D. Nasser E.A. Nasrallah G.K. The Current Status of Cytomegalovirus (CMV) Prevalence in the MENA Region: A Systematic Review Pathogens 2019 8 213 10.3390/pathogens8040213 31683687 PMC6963600 57. Sarkar S. Brown T.T. Diabetes in People with HIV Curr. Diab. Rep. 2021 21 13 10.1007/s11892-021-01382-8 33730223 PMC8208107 58. Hernandez-Romieu A.C. Garg S. Rosenberg E.S. Thompson-Paul A.M. Skarbinski J. Is Diabetes Prevalence Higher among HIV-Infected Individuals Compared with the General Population? Evidence from MMP and NHANES 2009–2010 BMJ Open Diabetes Res. Care 2017 5 e000304 10.1136/bmjdrc-2016-000304 PMC5293823 28191320 59. Chireshe R. Manyangadze T. Naidoo K. Diabetes Mellitus and Associated Factors among HIV-Positive Patients at Primary Health Care Facilities in Harare, Zimbabwe: A Descriptive Cross-Sectional Study BMC Prim. Care 2024 25 28 10.1186/s12875-024-02261-3 38221613 PMC10789024 60. Gkrania-Klotsas E. Klotsas A.-E. HIV and HIV Treatment: Effects on Fats, Glucose and Lipids Br. Med. Bull. 2007 84 49 68 10.1093/bmb/ldm030 17981955 61. Li K. Hu L. Li X. Yuan Z. He J. Liu D. Yang G. Yuan L. Effect of C-Reactive Protein Deficiency on Insulin Resistance Reversal in Rats with Polycystic Ovary Syndrome through Augmented Leptin Action Diabetol. Metab. Syndr. 2023 15 180 10.1186/s13098-023-01155-1 37660067 PMC10474659 62. Rochira V. Guaraldi G. Growth Hormone Deficiency and Human Immunodeficiency Virus Best Pract. Res. Clin. Endocrinol. Metab. 2017 31 91 111 10.1016/j.beem.2017.02.006 28477736 63. Nijenhuis-Noort E.C. Berk K.A. Neggers S.J.C.M.M. van der Lely A.J. The Fascinating Interplay between Growth Hormone, Insulin-like Growth Factor-1, and Insulin Endocrinol. Metab. 2024 39 83 89 10.3803/EnM.2024.101 PMC10901670 38192102 64. Willig A.L. Overton E.T. Metabolic Complications and Glucose Metabolism in HIV Infection: A Review of the Evidence Curr. HIV/AIDS Rep. 2016 13 289 296 10.1007/s11904-016-0330-z 27541600 PMC5425100 65. Kemnic T.R. Gulick P.G. HIV Antiretroviral Therapy StatPearls Publishing Treasure Island, FL, USA 2018 30020680 66. Koster J.C. Remedi M.S. Qiu H. Nichols C.G. Hruz P.W. HIV Protease Inhibitors Acutely Impair Glucose-Stimulated Insulin Release Diabetes 2003 52 1695 1700 10.2337/diabetes.52.7.1695 12829635 PMC1403824 67. Lee G.A. Seneviratne T. Noor M.A. Lo J.C. Schwarz J.-M. Aweeka F.T. Mulligan K. Schambelan M. Grunfeld C. The Metabolic Effects of Lopinavir/ritonavir in HIV-Negative Men AIDS 2004 18 641 649 10.1097/00002030-200403050-00008 15090769 PMC3166345 68. Di Gennaro F. Vergori A. Bavaro D.F. HIV and Co-Infections: Updates and Insights Viruses 2023 15 1097 10.3390/v15051097 37243183 PMC10222884 69. Bosch F.X. Lorincz A. Muñoz N. Meijer C.J.L.M. Shah K.V. The Causal Relation between Human Papillomavirus and Cervical Cancer J. Clin. Pathol. 2002 55 244 265 10.1136/jcp.55.4.244 11919208 PMC1769629 70. Haque A. Kouriba B. Aïssatou N. Pant A. Eliminating Cervical Cancer in Mali and Senegal, Two Sub-Saharan Countries: Insights and Optimizing Solutions Vaccines 2020 8 181 10.3390/vaccines8020181 32295116 PMC7349839 71. Turhan Cakir A. Sel G. Balci S. Harma M. Harma M.I. Evaluation of HPV, Smear and Colposcopy Results in Patients with Diabetes Diabetes Metab. Syndr. 2022 16 102335 10.1016/j.dsx.2021.102335 34920202 72. Yue C. Zhang C. Ying C. Jiang H. Diabetes Associated with HPV Infection in Women Aged over 50 Years: A Cross-Sectional Study from China’s Largest Academic Woman’s Hospital Front. Endocrinol. 2022 13 972963 10.3389/fendo.2022.972963 36452321 PMC9701707 73. Zhou J. Wei X.C. Xu H.Y. Hu H.B. Li F.X. Zhou W.J. Chen Y. Liu Z. Blood Glucose Levels and the Risk of HPV Multiple Infections in High-Grade Squamous Intraepithelial Lesions: A Retrospective Cross-Sectional Study of Chinese Patients Medicine 2022 101 e30494 10.1097/MD.0000000000030494 36123844 PMC9478326 74. Woelfle T. Linkohr B. Waterboer T. Thorand B. Seissler J. Chadeau-Hyam M. Peters A. Health Impact of Seven Herpesviruses on (pre)diabetes Incidence and HbA1c: Results from the KORA Cohort Diabetologia 2022 65 1328 1338 10.1007/s00125-022-05704-7 35538159 PMC9090457 75. Zameer U. Saqib E. Munshi M.S. Rohail S. Connecting the Dots: How Herpes Viruses Influence Type 2 Diabetes: Insights from Experimental Researches Clin. Med. Insights Endocrinol. Diabetes 2024 17 11795514241249013 10.1177/11795514241249013 38689700 PMC11060029 76. Kareem R.A. Sameer H.N. Athab Z.H. Adil M. Yaseen A. Allela O.Q.B. A Review of the Relationship between Type 2 Diabetes Mellitus and Different Stages of Hepatitis B Infection (HCC, CHB, OBI) Microb. Pathog. 2025 206 107748 10.1016/j.micpath.2025.107748 40419198 77. Loria P. Lonardo A. Anania F. Liver and Diabetes. A Vicious Circle: Liver and T2D Hepatol. Res. 2013 43 51 64 10.1111/j.1872-034X.2012.01031.x 23332087 PMC3733501 78. Zhang X. Zhu X. Ji Y. Li H. Hou F. Xiao C. Yuan P. Increased Risk of Hepatitis B Virus Infection amongst Individuals with Diabetes Mellitus Biosci. Rep. 2019 39 BSR20181715 10.1042/BSR20181715 30858308 PMC6438870 79. Younossi Z. Kochems K. de Ridder M. Curran D. Bunge E.M. de Moerlooze L. Should Adults with Diabetes Mellitus Be Vaccinated against Hepatitis B Virus? A Systematic Review of Diabetes Mellitus and the Progression of Hepatitis B Disease Hum. Vaccin. Immunother. 2017 13 2695 2706 10.1080/21645515.2017.1353850 28742983 PMC5703367 80. Xie J. Lin X. Fan X. Wang X. Pan D. Li J. Hao Y. Jie Y. Zhang L. Gu J. Global Burden and Trends of Primary Liver Cancer Attributable to Comorbid Type 2 Diabetes Mellitus among People Living with Hepatitis B: An Observational Trend Study from 1990 to 2019 J. Epidemiol. Glob. Health 2024 14 398 410 10.1007/s44197-024-00237-1 38713342 PMC11176116 81. Paradis V. Perlemuter G. Bonvoust F. Dargere D. Parfait B. Vidaud M. Conti M. Huet S. Ba N. Buffet C. High Glucose and Hyperinsulinemia Stimulate Connective Tissue Growth Factor Expression: A Potential Mechanism Involved in Progression to Fibrosis in Nonalcoholic Steatohepatitis Hepatology 2001 34 738 744 10.1053/jhep.2001.28055 11584370 82. Xie J. Wang X. Wang X. Li J. Jie Y. Hao Y. Gu J. Assessing the Impact of Comorbid Type 2 Diabetes Mellitus on the Disease Burden of Chronic Hepatitis B Virus Infection and Its Complications in China from 2006 to 2030: A Modeling Study Glob. Health Res. Policy 2024 9 5 10.1186/s41256-024-00345-2 38246986 PMC10801935 83. Mei Z. Wang F. Bhosle A. Dong D. Mehta R. Ghazi A. Zhang Y. Liu Y. Rinott E. Ma S. Strain-Specific Gut Microbial Signatures in Type 2 Diabetes Identified in a Cross-Cohort Analysis of 8,117 Metagenomes Nat. Med. 2024 30 2265 2276 10.1038/s41591-024-03067-7 38918632 PMC11620793 84. Yoo J.Y. Groer M. Dutra S.V.O. Sarkar A. McSkimming D.I. Gut Microbiota and Immune System Interactions Microorganisms 2020 8 1587 10.3390/microorganisms8101587 33076307 PMC7602490 85. Li Z. Chen J. Li Y. Li L. Zhan Y. Yang J. Wu H. Li S. Mo X. Wang X. Impact of SARS-CoV-2 Infection on Respiratory and Gut Microbiome Stability: A Metagenomic Investigation in Long-Term-Hospitalized COVID-19 Patients NPJ Biofilms Microbiomes 2024 10 126 10.1038/s41522-024-00596-4 39537661 PMC11561083 86. Xiao Z. Pan M. Li X. Zhao C. Impact of SARS-CoV2 Infection on Gut Microbiota Dysbiosis Microbiome Res. Rep. 2024 3 7 10.20517/mrr.2023.48 38455085 PMC10917619 87. Hur K.Y. Lee M.-S. Gut Microbiota and Metabolic Disorders Diabetes Metab. J. 2015 39 198 203 10.4093/dmj.2015.39.3.198 26124989 PMC4483604 88. Wiertsema S.P. van Bergenhenegouwen J. Garssen J. Knippels L.M.J. The Interplay between the Gut Microbiome and the Immune System in the Context of Infectious Diseases throughout Life and the Role of Nutrition in Optimizing Treatment Strategies Nutrients 2021 13 886 10.3390/nu13030886 33803407 PMC8001875 89. Kim H.S. Do an Altered Gut Microbiota and an Associated Leaky Gut Affect COVID-19 Severity? mBio 2021 12 e03022 e03120 10.1128/mBio.03022-20 33436436 PMC7845625 90. Xu E. Xie Y. Al-Aly Z. Long-Term Gastrointestinal Outcomes of COVID-19 Nat. Commun. 2023 14 983 10.1038/s41467-023-36223-7 36882400 PMC9992516 91. Inoue T. Nakayama J. Moriya K. Kawaratani H. Momoda R. Ito K. Iio E. Nojiri S. Fujiwara K. Yoneda M. Gut Dysbiosis Associated with Hepatitis C Virus Infection Clin. Infect. Dis. 2018 67 869 877 10.1093/cid/ciy205 29718124 92. Pan Z. Wu N. Jin C. Intestinal Microbiota Dysbiosis Promotes Mucosal Barrier Damage and Immune Injury in HIV-Infected Patients Can. J. Infect. Dis. Med. Microbiol. 2023 2023 3080969 10.1155/2023/3080969 37927531 PMC10625490 93. Li R. Yi X. Yang J. Zhu Z. Wang Y. Liu X. Huang X. Wan Y. Fu X. Shu W. Gut Microbiome Signatures in the Progression of Hepatitis B Virus-Induced Liver Disease Front. Microbiol. 2022 13 916061 10.3389/fmicb.2022.916061 35733959 PMC9208012 Figure 1 Bidirectional interactions of type 2 diabetes and viral infection. This figure illustrates the reciprocal relationship between diabetes and viral infections. Viruses can promote diabetes through chronic inflammation, gut microbiome disruption, and oxidative stress. Conversely, metabolic disruption characteristic of diabetes, such as insulin resistance or impaired β-cell function, can drive the pathogenesis of viral infections. viruses-17-01150-t001_Table 1 Table 1 Viral infections involved in impairment of insulin signaling pathways and glucose homeostasis. Virus Targets Impacts of Treatment Metabolic Response Immune Response SARS-CoV-2 ● ACE-2 virus receptor expression in the pancreas ● Steroids used in the treatment of severe or critical COVID-19 increase blood sugar ● Disrupts adiponectin hormone production ● Secretion of IL-6 and IL-1β cytokines, which are well known for inducing insulin resistance HCV ● Direct infection of pancreatic β-cells results in reduced insulin secretion ● Successful treatment could lead to improved glycemic control ● Increases blood sugar ● Stimulates the production of IL-1β and IL-6 cytokines, which are well known for inducing insulin resistance HIV ● Direct infection of the GI tract, including gut-associated lymphoid tissue and lymphocytes in the gut ● ARTs are implicated in the development of insulin resistance ● Dysregulates glucose ● Augmented levels of inflammatory molecules like TNFα and C-reactive protein can impact insulin resistance ",
  "metadata": {
    "Title of this paper": "Gut Microbiome Signatures in the Progression of Hepatitis B Virus-Induced Liver Disease",
    "Journal it was published in:": "Viruses",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12474433/"
  }
}