{
  "title": "Paper_819",
  "abstract": "pmc Oxid Med Cell Longev Oxid Med Cell Longev 931 oximed OMCL Oxidative Medicine and Cellular Longevity 1942-0900 1942-0994 Wiley PMC12463520 PMC12463520.1 12463520 12463520 41018278 10.1155/omcl/7786043 1 Research Article Purple Corn Extract Prevents Doxo-Induced Cardiotoxicity by Counteracting AMPK Activation and p53 Acetylation in HL-1 and Primary Cardiomyocytes https://orcid.org/0000-0002-9472-424X Cappellini Francesca https://orcid.org/0000-0003-1220-2403 Zorzan Debora https://orcid.org/0000-0001-7396-6496 Tomay Federica https://orcid.org/0000-0002-5897-1673 Toccaceli Marta https://orcid.org/0000-0002-6501-5364 Marinelli Alessandra Mancini Marina https://orcid.org/0000-0002-5303-4242 Bucchi Annalisa https://orcid.org/0000-0002-9505-3118 Tonelli Chiara https://orcid.org/0000-0003-3318-0442 Petroni Katia katia.petroni@unimi.it Dipartimento di Bioscienze, Università degli Studi di Milano, Milan, Italy Academic Editor: Priya Gusain 2025 18 9 2025 2025 482141 7786043 2 11 2024 11 7 2025 19 8 2025 18 09 2025 26 09 2025 29 09 2025 Copyright © 2025 Francesca Cappellini et al. Oxidative Medicine and Cellular Longevity published by John Wiley & Sons Ltd. 2025 https://creativecommons.org/licenses/by/4.0/ This is an open access article under the terms of the Creative Commons Attribution License, which permits use, distribution and reproduction in any medium, provided the original work is properly cited. Doxorubicin (Doxo) is an anthracycline widely used as a chemotherapeutic agent for many solid and hematological cancers. Its clinical use is limited due to a cumulative dose-dependent and irreversible cardiotoxicity that can cause progressive cardiomyopathy and congestive heart failure. A cardioprotective therapy that can decrease heart damage without reducing the anticancer efficacy during Doxo therapy is of utmost importance. Anthocyanins (ACNs) are renowned cardioprotective agents thanks to their antioxidant and anti-inflammatory properties. An ACN-rich diet from purple corn, which mainly contains cyanidin 3-glucoside (C3G) and its acetylated derivatives, has been previously shown to be effective in reducing Doxo-induced cardiotoxicity in mice. Aiming at unveiling the molecular mechanisms involved in ACN protection, we considered the fibroblast growth factor 21/AMP-activated protein kinase/SIRTUIN1 (FGF21/AMPK/SIRT1)/p53 pathway in murine HL-1 cardiomyocytes treated with Doxo in the presence or absence of purple corn extract (RED). Our work shows that Doxo-induced AMPK activation is restored to control levels by the RED extract. p53 acetylation was increased by the RED extract and upon Sirt1 silencing, indicating that p53 acetylation is SIRT1-dependent and suggesting that the RED extract may affect SIRT1 activity through AMPK. Notably, increased p53 acetylation led to decreased levels of cleaved-caspase 3 and Puma and p21 transcript levels, indicating a reduced level of apoptosis. The RED-induced cardioprotection and p53 acetylation were confirmed in mouse primary cardiomyocytes. In conclusion, the RED extract may prevent cardiomyocytes apoptosis through the modulation of AMPK and acetylation of p53. Keywords AMPK anthocyanins cardioprotection doxorubicin p53 acetylation Fondazione Umberto Veronesi MIND FoodS HUB (Milano Innovation District Food System Hub) Regione Lombardia This study was funded by the Fondazione Umberto Veronesi (Grant 2014 to Katia Petroni and Grant Fellowships to Francesca Cappellini, Alessandra Marinelli and Federica Tomay) and the project MIND FoodS HUB (Milano Innovation District Food System Hub): Innovative concept for the eco-intensification of agricultural production and for the promotion of dietary patterns for human health and longevity through the creation in MIND of a digital Food System Hub, cofunded by POR FESR 2014–2020_BANDO Call HUB Ricerca e Innovazione, Regione Lombardia to Katia Petroni and Chiara Tonelli. pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement yes pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes 1. Introduction Doxorubicin (Doxo) is one of the most used anticancer drugs, but one of its major side effects is cardiotoxicity, which can occur in an acute form or as a progressive heart failure with irreversible cardiac dysfunction [ 1 2 4 Sirtuins are a class of deacetylases that have been proposed to play a role in Doxo-induced progressive heart failure. In particular, SIRTUIN1 (SIRT1) plays a major role in cardiac development, since Sirt1 −/− Sirt1 5 Recently, fibroblast growth factor 21 (FGF21), a target of SIRT1, has been demonstrated to be a key player in cardiac remodeling. Although FGF21 is considered a hepatic hormone, it is also produced in the heart, where it exerts a protective role. In cardiomyocytes, FGF21 also acts through an autocrine mechanism: secreted cardiac FGF21 activates SIRT1, which in turn promotes FGF21 synthesis [ 6 7 8 9 Anthocyanins (ACNs) are polyphenols belonging to flavonoids and have been highlighted for their beneficial effects on a multitude of diseases. In particular, ACNs can prevent or reduce cardiovascular diseases and the risk of myocardial infarction in humans [ 10 11 12 14 2. Material and Methods 2.1. Purple Corn Extract Purple corn extract (RED) was produced by SVEBA Srl (Como, Italy) from B1 Pl1 15 16 2 v v 14 15 2.2. HL-1 Cell Culture and MTT Assay HL-1 cardiomyocytes were cultured in Claycomb medium supplemented with 10% FBS, 100 µg/mL of penicillin/streptomycin, 0.1 mM norepinephrine, and 2 mM L-glutamine (Sigma). The flasks were precoated with gelatin/fibronectin (0.02% of gelatin; 5 μg/mL fibronectin, Sigma). Cells were maintained in a humidified incubator at 37°C containing 5% CO 2 14 2.3. Isolation of Murine Primary Cardiomyocytes Adult ventricular cardiomyocytes were isolated from 2 to 3 month-old male WT mice (C57Bl/6J, Charles River), following the protocol described by Ackers-Johnson and Foo [ 17 2 2 2 4 2 LS004176 2 2 4 2 2 2.4. Flow Cytometry HL-1 cells were plated at a density of 50,000 cells/well in 96-well plates with 0.5 μM Doxo for 24 h and treated for 48 h with or without 125 μM RED. After treatment, HL-1 cells were trypsinized, four wells for each treatment were pooled and resuspended in PBS at a concentration of 1,000,000 cells/mL, and labeled with 5 μL Annexin V-AF488 (Molecular Probes) for 15 min. After the addition of 1 μL propidium iodide, samples were analyzed by flow cytometry. To determine Δψm 2.5. Mini-Gel Comet Assay HL-1 cells were seeded in 24-well plates (30,000 cells/well) 24 h before exposure to 0.25 and 0.5 µM Doxo with or without 125 µM RED for 3 and 24 h in complete medium. Cells were washed twice with PBS and 50 µL of 0.05% trypsin/EDTA (T3924, Sigma) were added for 3 min at 37°C. Then, 50 µL of trypsin inhibitor (Soybean trypsin inhibitor, T6522, Sigma) and 150 µL of wash medium (Claycomb medium with 5% FBS e 1% penicillin/streptomycin) were added. A 30 μL of the cell suspension was mixed with 300 µL of 1% low-melting-point agarose (A9414, Sigma) at 37°C. A15-μL aliquots were dropped onto two different slides precoated with 0.5% agarose (A9539, Sigma). Each slide contained eight drops. Lysis, unwinding, electrophoresis, and staining steps were performed as previously described [ 18 n n n n n n 2.6. Silencing Silencing of HL-1 cells was performed using Lipofectamine RNAiMAX reagent (Thermo Fisher Scientific) following the manufacturer's instructions. HL-1 cells were seeded in a gelatin/fibronectin precoated 12-well plate at a density of 400,000 cells/well in 800 µL of complete medium. Cells were immediately silenced by adding 200 µL of a mixture of Lipofectamine RNAiMAX/siRNA solution in Opti-MEM medium (Thermo Fisher) containing 20 pmol of siRNA (QIAGEN) and 7.5 µl Lipofectamine RNAiMAX. After 24 h, cells were treated with 0.5 or 1 µM of Doxo with or without 125 µM RED for 48 h. The supernatant was centrifuged at 10,000 × g 1 S1 2.7. RNA Extraction and Real-Time RT-PCR Cells were lysed using QIAzol (QIAGEN) and total RNA was extracted using the Direct-zol RNA MiniPrep kit (Zymo Research), following the manufacturer's protocol. For each sample, 1 μg of total RNA was reverse transcribed using a patented mixture of oligodT and random primers with the iScript cDNA Synthesis kit (Bio-Rad). The cDNA samples were diluted at 1:10 and amplified with Sso Fast EvaGreen Supermix through the Cfx96-360 Bio-Rad Real-Time system (Bio-Rad). Genes and primers used are reported in Supporting Information 1 S2 Gapdh ΔΔ 2.8. Western Blot Analysis Cells were plated in 100 mm petri dishes at a density of 4,000,000 cells/dish, allowed to acclimate for 24 h, and treated with Doxo (0.5 μM and 1 μM) with or without 125 µM RED for 48 h. For total protein extraction, cells were lysed with RIPA buffer (50 mM Tris-HCl pH 8, 150 mM NaCl, 1% IGEPAL, 0.5% sodium deoxycholate, 0.1% SDS, 2 mM EDTA, 0.5 M NaF, 200 mM PMSF, 100 mM sodium orthovanadate, and 10% glycerol) supplemented with proteases inhibitors (Protease Inhibitor Cocktail, PIC, Sigma). For nuclear and cytoplasmic protein extraction, cells were lysed with Lysis Buffer A (10 mM Tris-HCl pH 8, 150 mM NaCl, 1 mM EDTA, 1% IGEPAL, 10% Glycerol, and 0.5% PIC) for 5 min on ice and centrifuged for 10 min at 9300 × g g g For each sample, at least 20 μg of proteins underwent SDS-PAGE, followed by transfer onto nitrocellulose membranes. Primary and secondary antibodies used are listed in Supporting Information 1 S3 2.9. Enzyme-Linked Immunosorbent Assay (ELISA) To quantify the amount of secreted FGF21, cells were seeded in a 48-well plate at a concentration of 150,000 cells/well for 24 h and treated with different concentrations of Doxo (0.5 μM and 1 μM) with or without 125 µM RED for 48 h. Supernatant samples were analyzed using the FGF21 Duo-Set ELISA kit (R&D Systems) following the supplier's instructions. For each well, total proteins were also extracted and quantified using the Bio-Rad Protein Assay. The optical density was analyzed at a wavelength of 450 nm using a microplate reader (Tecan Infinite F200PRO). The pg/mL obtained from the ELISA assay were normalized on the µg of total protein in each well. 2.10. Topoisomerase 2β (Top2β) Decatenation Assay The activity of Top2β was evaluated using the kinetoplast DNA (kDNA) as substrate (Topo II beta decatenation assay kit, Inspiralis) following the supplier's instruction. Samples were loaded onto a 1% agarose gel stained with 0.5 µg/mL ethidium bromide and documented using a UV system combined with a camera (GBC). 2.11. Rapid Approach to DNA Adducts Recovery (RADAR) Assay for Detection of Top2β Covalent Complexes To detect Top2β-DNA covalent complex in cells treated with Doxo and/or RED, we performed the RADAR assay following the protocol described by Kiianitsa and Maizels [ 19 g g 4 20 2.12. NAD + Cells were plated in 100 mm petri dishes at a density of 8,000,000 cells/dish, allowed to acclimate for 24 h, and treated with Doxo (0.5 μM and 1 μM) with or without 125 µM RED for 48 h. Extraction was performed using NAD + + 2.13. Statistical Analysis Data are presented as mean ± SEM and were analyzed using GraphPad Prism 6 by two-way ANOVA followed by Tukey's or Sidak's multiple comparisons test, as reported in the figure legends. The number of independent biological experiments, technical replicates and animals/samples is also reported in the figure legends. p ⁣ ∗ p ⁣ ∗∗ p ⁣ ∗∗∗ p ⁣ ∗∗∗∗ p 3. Results 3.1. RED Protected Cardiomyocytes Against Doxo-Induced Cell Death Despite being an effective chemotherapeutic drug, Doxo causes cumulative and dose-dependent cardiotoxicity and death of cardiomyocytes through several mechanisms that ultimately lead to apoptosis [ 21 Figure 1 Figure 1 Figure 1 Mitochondrial transmembrane potential is a key parameter of mitochondrial function. Its loss follows the opening of the mitochondrial permeability transition pores, resulting in the release of cytochrome C and activation of the apoptotic cascade [ 22 23 Figure 1 p53 Puma Figure 1 p21 Figure 1 Figure 1 NRF2 HO-1 Figure 1 3.2. RED Prevented Doxo-Induced Increase of AMPK Activity Despite being weakly expressed in the heart, FGF21 contributes to several physiological processes, mainly via its action as metabolic regulator and cardioprotective agent [ 24 6 Fgf21 Klb Figure 2 Figure 2 Figure 2 Compelling evidence showed that endocrine FGF21 signaling activates the AMPK pathway, either directly through FGFR1/β-Klotho or indirectly through adiponectin and corticosteroids [ 24 25 Figure 2 3.3. Doxo and RED Effects on SIRT1 and p53 Once activated, AMPK activates in turn SIRT1 through phosphorylation and detachment from its inhibitor DBC1 [ 26 27 Sirt1 Figure 3 Figure 3 Figure 3 Since SIRT1 is a NAD-dependent deacetylase activated by a high NAD + 28 + Figure 4 p21 Puma 9 Figure 4 Figure 4 Figure 4 Figure 4 3.4. Fgf21 and Sirt1 Silencing To further analyze the role of FGF21 and SIRT1 in Doxo-mediated cardiotoxicity, we silenced Fgf21 Sirt1 2 S1 Fgf21 Fgf21 2 S1 2 S1 Sirt1 Sirt1 2 S1 2 S1 Sirt1 Fgf21 Fgf21 Figure 5 p21 Puma Figure 5 Figure 5 Sirt1 Figure 5 Figure 5 Sirt1 Puma p21 Figure 5 3.5. C3G Prevented ROS Accumulation and Cytotoxicity in Primary Cardiomyocytes To confirm that the RED-induced cardioprotective activity may be mediated by C3G, the main ACN present in purple corn [ 14 Figure 6 Figure 6 Figure 6 Figure 6 3.6. Doxo and RED Effects on Top2β It is known that Doxo inactivates Top2β by trapping it on the DNA in a ternary complex [ 29 Figure 7 Figure 7 The result was confirmed by the Top2β decatenation assay ( Figure 7 Crithidia fasciculata Figure 7 The silencing of Top2 Figure 7 Top2 p53 Puma p21 Figure 7 Top2 Sirt1 Figure 7 Fgf21 Figure 7 4. Discussion The aim of this study was to investigate the protective effect of RED extract against Doxo toxicity in HL-1 cardiomyocytes focusing on the AMPK/SIRT1/p53 pathway. Our previous studies demonstrated that dietary ACNs from purple corn can protect the heart against Doxo-induced cardiotoxicity in vivo and promote HL-1 cell viability, without reducing the antitumoral activity of Doxo in vitro [ 14 Puma p21 30 31 p53 Puma p21 Recent studies reported that FGF21 exerts its protective role in cardiomyocytes by activating the AMPK/SIRT1/p53 pathway, and it can induce AMPK activation through phosphorylation [ 7 32 33 36 37 Fgf21 Klb Ffg21 Fgf21 SIRT1 is a NAD-dependent deacetylase involved in many cellular processes, including ROS scavenging, cell death/survival signaling, and aging. It has recently been pointed out that it may play a role in cardioprotection, since its absence causes severe damages in developing hearts [ 5 Sirt1 Sirt1 Top2 Sirt1 38 39 40 27 It has been shown that SIRT1 activity on p53 is AMPK-mediated: the binding between SIRT1 and one of its regulators, DBC1, depends on AMPK, which promotes SIRT1-DBC1 dissociation and SIRT1 activation by direct phosphorylation [ 9 + 41 + p21 Puma p21 Puma 8 38 42 43 Puma p21 Puma 43 p21 Puma p21 Puma In agreement with previous results, Sirt1 Sirt1 Sirt1 Fgf1 p21 Puma Fgf21 Our previous studies, together with these findings, suggest the potential use of dietary ACNs from purple corn in the prevention of cardiotoxicity in patients undergoing anthracycline chemotherapy. In fact, we previously demonstrated that in mice fed an ACN-rich diet from purple corn (red diet [RD]), which provided about 36 mg/kg body weight/day of C3G, the typical Doxo-induced cardiac alterations (i.e., disorganized myofibrils, mitochondrial fragmentation and degradation, and defects in sarcolemma junctions) were prevented compared to mice fed an ACN-free diet (yellow diet [YD]). In addition, this ACN dose resulted in a significant reduction in short and mid-term Doxo-induced mortality in mice [ 14 44 45 46 Other studies have demonstrated that dietary ACNs at comparable doses also improve hemodynamic function or ejection fraction in animal models. In fact, the administration of a blueberry extract (i.e., 20–80 mg/kg body weight) to rats treated with cyclophosphamide, another cardiotoxic chemotherapeutic drug, significantly attenuated increases in mean arterial blood pressure, decreases of left ventricular (LV) ejection fraction as well as LV hypertrophy and fibrosis [ 47 13 5. Conclusions Our study highlights the beneficial effects of the RED extract in counteracting the cardiotoxicity induced by Doxo. Our results suggest that in HL-1 cardiomyocytes Doxo induces AMPK activation, leading to an increase in NAD + Puma p21 + Puma p21 Acknowledgments We received HL-1 cells as a gift from Dr. William Claycomb (Louisiana State University Health Science Center, New Orleans, LA, USA), who first established and characterized this cell line. Data Availability Statement The data used to support the findings are available from the corresponding author upon request. Conflicts of Interest The authors declare no conflicts of interest. Author Contributions Francesca Cappellini and Debora Zorzan designed and performed all the experiments. Federica Tomay performed the flow cytometry experiments. Debora Zorzan, Annalisa Bucchi, Marta Toccaceli, and Alessandra Marinelli performed and analyzed the experiments on primary cardiomyocytes. Alessandra Marinelli performed the experiments on antioxidant response. Marina Mancini performed the decatenation and RADAR assays with the assistance of Francesca Cappellini. Katia Petroni supervised the work together with Chiara Tonelli. Francesca Cappellini wrote the paper together with Debora Zorzan, Federica Tomay, and Katia Petroni. All authors discussed the results and commented on the manuscript. Francesca Cappellini and Debora Zorzan contributed equally to this work. Supporting Information Additional supporting information can be found online in the Supporting Information section. Supporting Information 1 Table S1. Target RNA sequences and siRNAs used for gene silencing. Table S2. List of primers. Table S3. List of primary and secondary antibodies. Supporting Information 2 Figure S1. Effect of Fgf21 Sirt1 Fgf21 Sirt1 Fgf21 Sirt1 Fgf21 Sirt1 Fgf21 Sirt1 ⁣ ∗ p ⁣ ∗∗ p ⁣ ∗∗∗ p ⁣ ∗∗∗∗ p 1 Chatterjee K. Zhang J. Honbo N. Karliner J. S. Doxorubicin Cardiomyopathy Cardiology 2010 115 2 155 162 10.1159/000265166 2-s2.0-72049093531 20016174 PMC2848530 2 Octavia Y. Tocchetti C. G. Gabrielson K. L. Janssens S. Crijns H. J. Moens A. L. Doxorubicin-Induced Cardiomyopathy: From Molecular Mechanisms to Therapeutic Strategies Journal of Molecular and Cellular Cardiology 2012 52 6 1213 1225 10.1016/j.yjmcc.2012.03.006 2-s2.0-84860523994 22465037 3 Zhang S. Liu X. Bawa-Khalfe T. Identification of the Molecular Basis of Doxorubicin-Induced Cardiotoxicity Nature Medicine 2012 18 11 1639 1642 10.1038/nm.2919 2-s2.0-84869209094 23104132 4 Dirks-Naylor A. J. The Role of Autophagy in Doxorubicin-Induced Cardiotoxicity Life Sciences 2013 93 24 913 916 10.1016/j.lfs.2013.10.013 2-s2.0-84888291618 24404586 5 Dolinsky V. W. The Role of Sirtuins in Mitochondrial Function and Doxorubicin-Induced Cardiac Dysfunction Biological Chemistry 2017 398 9 955 974 10.1515/hsz-2016-0316 2-s2.0-85027351524 28253192 6 Planavila A. Redondo-Angulo I. Villarroya F. FGF21 and Cardiac Physiopathology Frontiers in Endocrinology 2015 6 1 7 10.3389/fendo.2015.00133 26379627 PMC4553397 7 Wang S. Wang Y. Zhang Z. Liu Q. Gu J. Cardioprotective Effects of Fibroblast Growth Factor 21 Against Doxorubicin-Induced Toxicity via the SIRT1/LKB1/AMPK Pathway Cell Death & Disease 2017 8 8 10.1038/cddis.2017.410 2-s2.0-85044138118 e3018 PMC5596591 28837153 8 Brooks C. L. Gu W. The Impact of Acetylation and Deacetylation on the p53 Pathway Protein & Cell 2011 2 6 456 462 10.1007/s13238-011-1063-9 2-s2.0-80053064491 21748595 PMC3690542 9 Lau A. W. Liu P. Inuzuka H. Gao D. SIRT1 Phosphorylation by AMP-Activated Protein Kinase Regulates p53 Acetylation American Journal of Cancer Research 2014 4 3 245 255 24959379 PMC4065405 10 Cassidy A. Mukamal K. J. Liu L. Franz M. Eliassen A. H. Rimm E. B. High Anthocyanin Intake Is Associated With a Reduced Risk of Myocardial Infarction in Young and Middle-Aged Women Circulation 2013 127 2 188 196 10.1161/CIRCULATIONAHA.112.122408 2-s2.0-84872338139 23319811 PMC3762447 11 Reis J. F. Monteiro V. V. S. Souza Gomes R. Action Mechanism and Cardiovascular Effect of Anthocyanins: A Systematic Review of Animal and Human Studies Journal of Translational Medicine 2016 14 1 1 16 10.1186/s12967-016-1076-5 2-s2.0-84995581975 27846846 PMC5111351 12 Choi E. H. Park J. H. Kim M. K. Chun H. S. Alleviation of Doxorubicin-Induced Toxicities by Anthocyanin-Rich Bilberry ( Vaccinium myrtillus L BioFactors 2010 36 4 319 327 10.1002/biof.106 2-s2.0-78149481647 20623509 13 Ashour O. M. Elberry A. A. Alahdal A. M. Protective Effect of Bilberry ( Vaccinium myrtillus Medical Science Monitor 2011 17 4 BR110 BR115 10.12659/MSM.881711 21455099 PMC3539517 14 Petroni K. Trinei M. Fornari M. Dietary Cyanidin 3-Glucoside From Purple Corn Ameliorates Doxorubicin-Induced Cardiotoxicity in Mice Nutrition, Metabolism and Cardiovascular Diseases 2017 27 5 462 469 10.1016/j.numecd.2017.02.002 2-s2.0-85017454656 28428026 15 Tomay F. Marinelli A. Leoni V. Purple Corn Extract Induces Long-Lasting Reprogramming and M2 Phenotypic Switch of Adipose Tissue Macrophages in Obese Mice Journal of Translational Medicine 2019 17 1 1 14 10.1186/s12967-019-1972-6 2-s2.0-85069769953 31337415 PMC6651915 16 Magni G. Marinelli A. Riccio D. Purple Corn Extract as Anti-Allodynic Treatment for Trigeminal Pain: Role of Microglia Frontiers in Cellular Neuroscience 2018 12 10.3389/fncel.2018.00378 2-s2.0-85056893734 378 PMC6230559 30455630 17 Ackers-Johnson M. Foo R. S. Bertoncello I. Langendorff-Free Isolation and Propagation of Adult Mouse Cardiomyocytes Mouse Cell Culture 2019 New York Springer Nature 193 204 10.1007/978-1-4939-9086-3_14 2-s2.0-85061961303 30788827 18 Di Bucchianico S. Cappellini F. Le Bihanic F. Zhang Y. Dreij K. Karlsson H. L. Genotoxicity of TiO2 Nanoparticles Assessed by Mini-Gel Comet Assay and Micronucleus Scoring With Flow Cytometry Mutagenesis 2016 32 1 127 137 10.1093/mutage/gew030 2-s2.0-85007438928 27382040 PMC5180169 19 Kiianitsa K. Maizels N. A Rapid and Sensitive Assay for DNA-Protein Covalent Complexes in Living Cells Nucleic Acids Research 2013 41 9 10.1093/nar/gkt171 2-s2.0-84877268906 PMC3643584 23519618 20 Anand J. Sun Y. Zhao Y. Nitiss K. C. Nitiss J. L. Drolet M. Detection of Topoisomerase Covalent Complexes in Eukaryotic Cells DNA Topoisomerases Methods in Molecular Biology 2018 1703 Humana Press 283 299 10.1007/978-1-4939-7459-7_20 29177749 21 Maillet A. Tan K. Chai X. Modeling Doxorubicin-Induced Cardiotoxicity in Human Pluripotent Stem Cell Derived-Cardiomyocytes Scientific Reports 2016 6 1 1 13 10.1038/srep25333 2-s2.0-84965116136 27142468 PMC4855185 22 Zamzami N. Marchetti P. Castedo M. Reduction in Mitochondrial Potential Constitutes an Early Irreversible Step of Programmed Lymphocyte Death in Vivo The Journal of Experimental Medicine 1995 181 5 1661 1672 10.1084/jem.181.5.1661 2-s2.0-0028903933 7722446 PMC2192017 23 Chen L. B. Mitochondrial Membrane Potential in Living Cells Annual Review of Cell Biology 1988 4 1 155 181 10.1146/annurev.cb.04.110188.001103 2-s2.0-0024148694 3058159 24 Tan H. Yue T. Chen Z. Wu W. Xu S. Weng J. Targeting FGF21 in Cardiovascular and Metabolic Diseases: From Mechanism to Medicine International Journal of Biological Sciences 2023 19 1 66 88 10.7150/ijbs.73936 36594101 PMC9760446 25 Salminen A. Kauppinen A. Kaarniranta K. FGF21 Activates AMPK Signaling: Impact on Metabolic Regulation and the Aging Process Journal of Molecular Medicine 2017 95 2 123 131 10.1007/s00109-016-1477-1 2-s2.0-84988699008 27678528 26 Nin V. Escande C. Chini C. C. Role of Deleted in Breast Cancer 1 (DBC1) Protein in SIRT1 Deacetylase Activation Induced by Protein Kinase A and AMP-Activated Protein Kinase Journal of Biological Chemistry 2012 287 28 23489 23501 10.1074/jbc.M112.365874 2-s2.0-84863622561 22553202 PMC3390625 27 Tanno M. Sakamoto J. Miura T. Shimamoto K. Horio Y. Nucleocytoplasmic Shuttling of the NAD+-Dependent Histone Deacetylase SIRT1 Journal of Biological Chemistry 2007 282 9 6823 6832 10.1074/jbc.M609554200 2-s2.0-34250365395 17197703 28 Tanno M. Kuno A. Horio Y. Miura T. Emerging Beneficial Roles of Sirtuins in Heart Failure Basic Research in Cardiology 2012 107 4 10.1007/s00395-012-0273-5 2-s2.0-84861338375 PMC3390697 22622703 29 Tewey K. M. Rowe T. C. Yang L. Halligan B. D. Liu L. F. Adriamycin-Induced DNA Damage Mediated by Mammalian DNA Topoisomerase II Science 1984 226 4673 466 468 10.1126/science.6093249 2-s2.0-0021151237 6093249 30 Zhang D.-X. Ma D.-Y. Yao Z.-Q. ERK1/2/p53 and NF-κB Dependent-PUMA Activation Involves in Doxorubicin-Induced Cardiomyocyte Apoptosis. European Review for Medical & Pharmacological Sciences 2016 20 11 2435 2442 27338072 31 Georgakilas A. G. Martin O. A. Bonner W. M. p21: A Two-Faced Genome Guardian Trends in Molecular Medicine 2017 23 4 310 319 10.1016/j.molmed.2017.02.001 2-s2.0-85014571086 28279624 32 Sunaga H. Koitabashi N. Iso T. Activation of Cardiac AMPK-FGF21 Feed-Forward Loop in Acute Myocardial Infarction: Role of Adrenergic Overdrive and Lipolysis Byproducts Scientific Reports 2019 9 1 1 13 10.1038/s41598-019-48356-1 2-s2.0-85070763692 31413360 PMC6694166 33 Timm K. N. Tyler D. J. The Role of AMPK Activation for Cardioprotection in Doxorubicin-Induced Cardiotoxicity Cardiovascular Drugs and Therapy 2020 34 2 255 269 32034646 10.1007/s10557-020-06941-x PMC7125062 34 Chen M.-B. Wu X.-Y. Gu J.-H. Guo Q.-T. Shen W.-X. Lu P.-H. Activation of AMP-Activated Protein Kinase Contributes to Doxorubicin-Induced Cell Death and Apoptosis in Cultured Myocardial H9c2 Cells Cell Biochemistry and Biophysics 2011 60 3 311 322 10.1007/s12013-011-9153-0 2-s2.0-79958244812 21274754 35 Yang W. Park I. J. Yun H. AMP-Activated Protein Kinase α2 and E2F1 Transcription Factor Mediate Doxorubicin-Induced Cytotoxicity by Forming a Positive Signal Loop in Mouse Embryonic Fibroblasts and Non-Carcinoma Cells The Journal of Biological Chemistry 2014 289 8 4839 4852 10.1074/jbc.M113.496315 2-s2.0-84896718398 24398673 PMC3931046 36 Pointon A. V. Walker T. M. Phillips K. M. Doxorubicin In Vivo Rapidly Alters Expression and Translation of Myocardial Electron Transport Chain Genes, Leads to ATP Loss and Caspase 3 Activation PLoS ONE 2010 5 9 1 17 10.1371/journal.pone.0012733 2-s2.0-77958601786 PMC2939875 20856801 37 Koleini N. Kardami E. Autophagy and Mitophagy in the Context of Doxorubicin-Induced Cardiotoxicity Oncotarget 2017 8 28 46663 46680 10.18632/oncotarget.16944 2-s2.0-85022210767 28445146 PMC5542301 38 Vaziri H. Dessain S. K. Eaton E. N. hSIR2 SIRT1 Cell 2001 107 149 159 11672523 10.1016/s0092-8674(01)00527-x 39 Sundaresan N. R. Pillai V. B. Gupta M. P. Emerging Roles of SIRT1 Deacetylase in Regulating Cardiomyocyte Survival and Hypertrophy Journal of Molecular and Cellular Cardiology 2011 51 4 614 618 10.1016/j.yjmcc.2011.01.008 2-s2.0-80052799903 21276800 PMC3442925 40 Tanno M. Kuno A. Yano T. Induction of Manganese Superoxide Dismutase by Nuclear Translocation and Activation of SIRT1 Promotes Cell Survival in Chronic Heart Failure Journal of Biological Chemistry 2010 285 11 8375 8382 10.1074/jbc.M109.090266 2-s2.0-77950901103 20089851 PMC2832987 41 Cantó C. Gerhart-Hines Z. Feige J. N. AMPK Regulates Energy Expenditure by Modulating NAD+ Metabolism and SIRT1 Activity Nature 2009 458 7241 1056 1060 10.1038/nature07813 2-s2.0-67349276169 19262508 PMC3616311 42 Reed S. M. Quelle D. E. p53 Acetylation: Regulation and Consequences Cancers 2015 7 1 30 69 10.3390/cancers7010030 2-s2.0-84920875263 PMC4381250 25545885 43 Brochier C. Dennis G. Rivieccio M. A. Specific Acetylation of p53 by HDAC Inhibition Prevents DNA Damage-Induced Apoptosis in Neurons The Journal of Neuroscience 2013 33 20 8621 8632 10.1523/JNEUROSCI.5214-12.2013 2-s2.0-84877773314 23678107 PMC6618832 44 Nair A. B. Jacob S. A Simple Practice Guide for Dose Conversion Between Animals and Human Journal of Basic and Clinical Pharmacy 2016 7 2 10.4103/0976-0105.177703 27 PMC4804402 27057123 45 Liso M. Sila A. Verna G. Nutritional Regimes Enriched With Antioxidants as an Efficient Adjuvant for IBD Patients Under Infliximab Administration, a Pilot Study Antioxidants 2022 11 1 10.3390/antiox11010138 138 PMC8773281 35052642 46 Vacca M. Sommella E. M. Liso M. Anthocyanins From Purple Corn Affect Gut Microbiota and Metabolome in IBD Patients Under Infliximab Infusion: The SiCURA Pilot Study Food Science and Human Wellness 2024 13 1 15 47 Liu Y. Tan D. Shi L. Blueberry Anthocyanins-Enriched Extracts Attenuate Cyclophosphamide-Induced Cardiac Injury PLoS ONE 2015 10 7 10.1371/journal.pone.0127813 2-s2.0-84940094759 e0127813 PMC4489910 26133371 Figure 1 RED prevented Doxo-induced cardiotoxicity by inhibiting apoptosis, cell cycle arrest, and DNA damage. (a) MTT assay on HL-1 cells treated with increasing concentrations of Doxo with or without 125 µM RED. Data are presented as mean ± SEM of three technical replicates per condition, from three independent biological experiments and were analysed using two-way ANOVA followed by Sidak's multiple comparisons test. (b) Western blot analysis of cleaved-caspase 3 on HL-1 cells treated with 0.5 or 1 µM Doxo with or without 125 µM RED. Results from one of three independent biological experiments are shown. (c) Flow cytometry analysis of Annexin V and propidium iodide (PI) staining of apoptotic cells following 24 h treatment with 0.5 μM Doxo treatment with or without 48 h 125 µM RED. (d) Flow cytometry analysis of mitochondria membrane potential using tetramethylrhodamine ethyl ester (TMRE). Histograms show untreated cells (red), 0.5 µM Doxo-treated cells (blue), and 0.5 µM Doxo + 125 µM RED (green). Representative data from two independent experiments are shown. (e) qPCR analysis of p53 Puma p21 NRF2 HO-1 ⁣ ∗ p ⁣ ∗∗ p ⁣ ∗∗∗ p ⁣ ∗∗∗∗ p Figure 2 RED prevented Doxo-induced increase of AMPK activity. (a, b) qPCR analysis of Fgf21 Klb ⁣ ∗ p ⁣ ∗∗ p ⁣ ∗∗∗ p ⁣ ∗∗∗∗ p Figure 3  Sirt1 Sirt1 ⁣ ∗ p ⁣ ∗∗ p ⁣ ∗∗∗ p Figure 4 RED increased the p53 acetylation at Lys379. (a) NAD + ⁣ ∗ p ⁣ ∗∗ p ⁣ ∗∗∗ p Figure 5 Effect of Fgf21 Sirt1 Sirt1 Fgf21 Sirt1 Fgf21 Puma p21 ⁣ ∗ p ⁣ ∗∗ p ⁣ ∗∗∗ p ⁣ ∗∗∗∗ p Figure 6 Effect of cyanidin 3-glucoside on ROS accumulation and cytotoxicity in primary cardiomyocytes. (a) Viability of primary cardiomyocytes at 24 h of treatment. Results presented as the percentage of living cells at 24 h divided by the number of living cells at 0 h, based on cell shape. Data are expressed as mean ± SEM ( n n ⁣ ∗∗ p ⁣ ∗∗∗ p n n ⁣ ∗ p ⁣ ∗∗ p Figure 7 Doxo and RED effects on Topoisomerase 2β. (a) RADAR assay on HL-1 cells treated for 48 h with 0.5 μM Doxo with or without 125 µM RED. (b) Decatenation assay performed on cell extracts from HL-1 cells treated for 48 h with 0.25, 0.5, or 1 µM Doxo with or without 125 µM RED. One representative blot from three independent biological experiments is shown in Subparts (a, b). (c) Effect of Top2 Top2 p53 Puma p21 Fgf21 Sirt1 ⁣ ∗ p ⁣ ∗∗ p ⁣ ∗∗∗ p ⁣ ∗∗∗∗ p ",
  "metadata": {
    "Title of this paper": "Blueberry Anthocyanins-Enriched Extracts Attenuate Cyclophosphamide-Induced Cardiac Injury",
    "Journal it was published in:": "Oxidative Medicine and Cellular Longevity",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12463520/"
  }
}