{
  "title": "Paper_1065",
  "abstract": "pmc Int J Hyperthermia Int J Hyperthermia 319 nihpa International journal of hyperthermia : the official journal of European Society for Hyperthermic Oncology, North American Hyperthermia Group 0265-6736 1464-5157 pmc-is-collection-domain yes pmc-collection-title NIHPA Author Manuscripts PMC12479143 PMC12479143.1 12479143 12479143 NIHMS2111641 40922671 10.1080/02656736.2025.2554860 NIHMS2111641 NIHPA2111641 1 Article Automatic specific absorption rate (SAR) prediction for hyperthermia treatment planning using deep learning method http://orcid.org/0000-0001-9823-3264 Lang Yankun http://orcid.org/0000-0001-6805-5989 Rodrigues Dario B. Ren Lei Department of Radiation Oncology Physics, University of Maryland, Baltimore, MD, USA CONTACT lren@som.umaryland.edu 12 2025 09 9 2025 42 1 497744 2554860 2554860 24 09 2025 29 09 2025 30 09 2025 30 09 2025 https://creativecommons.org/licenses/by/4.0/ This is an Open Access article distributed under the terms of the Creative Commons Attribution License ( http://creativecommons.org/licenses/by/4.0/ Objective: To develop a deep learning method for fast and accurate prediction of Specific Absorption Rate (SAR) distributions in the human head to support real-time hyperthermia treatment planning (HTP) of brain cancer patients. Approach: We propose an encoder-decoder neural network with cross-attention blocks to predict SAR maps from brain electrical properties, tumor 3D isocenter coordinates and microwave antenna phase settings. A dataset of 201 simulations was generated using finite-element modeling by varying tissue properties, tumor positions, and antenna phases within a human head model equipped with a three-ring phased-array applicator. The model was trained and evaluated on this dataset using standard error metrics and structural similarity analysis. Main results: On a held-out test set of 20 samples, the model achieved a mean root-mean-squared error (RMSE) of 3.3 W/kg and a mean absolute error (MAE) of 1.6 W/kg across the whole brain. In target regions, RMSE and MAE were 4.8 and 2.5 W/kg, respectively. The structural similarity index (SSIM) reached a mean value of 0.90, and the computation time was reduced from 10 min (simulation-based) to 4 s using our deep learning approach. The proposed method enables accurate, efficient SAR prediction for HTP in the brain, potentially supporting real-time HTP to optimize tumor temperature and improve clinical outcomes. Significance: This work introduces a novel deep learning-based approach that significantly accelerates SAR calculation in HTP, enabling adaptive therapy strategies to improve treatment outcomes in hyperthermia. Hyperthermia therapy brain cancer specific absorption rate treatment planning supervised deep learning pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript yes pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement no pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes 1. Introduction Hyperthermia therapy (HT) is a potent adjuvant treatment used to enhance the efficacy of conventional cancer therapies, including radiation therapy and chemotherapy [ 1 3 4 8 9 13 14 15 16 17 18 19 20 Three-dimensional (3D) hyperthermia treatment planning (HTP) has significantly evolved in recent years and is now a powerful tool to optimize patient-specific treatment quality [ 21 23 24 25 26 24 27 28 25 29 Current SAR calculations for HTP are based on complex models that simulate electromagnetic field interactions with biological tissues. Many software platforms such as COMSOL Multiphysics (COMSOL, Palo Alto, CA) employ numerical solvers based on the finite element method (FEM) to compute SAR distributions by combining tissue properties - namely, relative permittivity, electrical conductivity and density-with the normalized electric field. The numerical model solves the vector-Helmholtz equation everywhere in the domain for a given frequency to calculate the electric field through wave propagation. However, as opposed to finite difference (FD) based algorithms FEM-based numerical algorithms are computationally demanding and time-consuming, especially when applied to complex, 3D patient-specific models. Consequently, when using general-purpose FEM-based tools like COMSOL, the iterative process of adjusting antenna phase and amplitude settings to optimize therapeutic heating while ensuring safety is too slow to support real-time or adaptive HTP. Deep learning-based approaches hold significant potential to overcome the computational limitations of FEM-based SAR simulations. In recent years, deep learning-based methods have been increasingly developed by various groups, including ours, for image reconstruction and enhancement to improve the efficiency and accuracy of dose verification in several medical applications [ 30 34 30 31 32 33 34 However, while these deep learning methods have been primarily developed for 2D or 3D image-based inputs, SAR distribution is fundamentally computed on 3D geometric meshes or point clouds [ 25 35 39 40 In this study, we propose a deep learning-based model that integrates antenna parameters with patient-specific anatomical data using a cross-attention transformer architecture for SAR prediction. The model is applied to the brain HT applicator described by Rodrigues et al. [ 26 2. Methods 2.1. Overview Figure 1 2.2. Data generation An overview of SAR prediction using a deep learning method is illustrated in Figure 1 Figure 2 41 2 ( ψ e ) Table 1 42 The SAR parameter is calculated from the electrical field calculated in COMSOL to solve the Maxwell equations [ 43 (1) E SAR = σ E 2 2 ρ σ ρ ( ψ ) 26 (2) θ n = 2 ( n − 1 ) π N , n = 1 , … , 24 (3) R in = a cos θ n − x 0 2 + a sin θ n − y 0 2 (4) R en = a cos θ n − x 0 2 + a sin θ n − y 0 2 + g 2 (5) ψ in = 2 π λ brain R in − min R in (6) ψ en = 2 π λ brain R en − min R in θ Figure 2 n g R in R en x 0 , y 0 λ brain Table 1 26 44 A total of 201 simulation datasets (or samples) were generated for SAR normalized to 100 W, incorporating variations in tissue properties ( Table 1 x 0 , y 0 z z = 0 cm z = − 2 cm z = + 2 cm 2.3. Functional goal To formalize the SAR prediction task, we define the mapping learned by our model as: (7) SAR ^ = ℱ ℬ , ψ , SAR ^ ∈ R N N ℬ ∈ R N × 6 ε r ( σ ) ( ρ ) ψ ∈ R 48 ℱ ( ⋅ ) ℬ ψ 2.4. Cross-attention-based network The overview of the proposed SAR prediction network (SARpNet) is shown in Figure 3(a) N × 6 N N × 128 The core innovation of SARpNet lies in the use of cross-attention modules within the encoder to dynamically model the interaction between antenna inputs and tissue properties. Conceptually, the attention mechanism operates by projecting these two input modalities into a shared latent space using learnable transformations, and computing context-aware feature representations through a similarity-based weighting scheme. The architecture of the cross-attention block is shown in Figure 3(b) (8) Q = F a W Q , K = F p W K , V = F p W V , W Q , W K W v F a F p ( Q ) ( K ) ( V ) The attention map Att (9) Att = Softmax Q K T / d k , d k Att Att V (10) Z = AttV , Z (11) H = MLP ( Norm ( Z ) ) + F p , Norm MLP The first cross-attention block processes these embedded features, outputting a feature map of size N × 128 Figure 3(d) N × 128 The SARpNet model during the prediction stage is trained using a combined loss function that includes the Structural Similarity Index Measure (SSIM) loss and L2 loss, defined as: (12) L l = α 1 L ssim P SAR , P SAR * + β 1 L 2 P SAR , P SAR * , P SAR P SAR * α 1 = 1.0 β 1 = 1.0 2.5. Enhancement network To further improve prediction accuracy, we applied a 1D U-Net architecture during the enhancement-stage, as shown in Figure 3(c) Since high-intensity points (SAR values) in the target region only occupy a small portion of the total data, directly applying L2 loss can be challenging for refining these points since L2 Loss focuses on minimizing the global differences. To address this challenge, we introduce a threshold (30 W/Kg) during the training of the enhancement network. For points with intensities below this threshold, we use L1 loss to focus on fine-grained intensity refinement, while for points with intensities above the threshold, L2 loss is applied to handle larger intensity differences more effectively. This combination helps the model better handle both low and high-intensity regions, improving the overall training process and prediction accuracy. 2.6. Training implementation For training, we used the Adam optimizer with an initial learning rate of 0.0001, which was reduced by a factor of 0.2 every 100 epochs, for a total of 500 training epochs. Here, one epoch refers to a complete pass through the entire training dataset during model optimization. Before training, the mesh coordinates are normalized to the range [0, 1] to ensure consistent input scaling across all training samples. The total training time was approximately 6 h. The network was implemented using the machine learning library PyTorch and run on a server equipped with a 40 GB Nvidia A100 GPU and 64 GB of RAM. We evaluated the SAR prediction results, in terms of Root Mean Squared Error (RMSE), SSIM and Peak Signal-to-Noise Ratio (PSNR). Since the SAR distribution affects the thermal dose, we also evaluated the results by gamma index (GI), given by: (13) γ ( S ) = min S ′ Δ d S , S ′ Δ d crit 2 + Δ D S , S ′ Δ D crit 2 S S ′ Δ Δ D Δ d crit Δ D crit 3. Results The quantitative results of the prediction stage are presented in Table 2 Four examples of SAR prediction results are presented in Figure 4 45 Compared to the prediction stage, SAR values in both the target and peripheral regions became significantly more accurate, indicating improved precision in clinically critical areas. In non-target regions without SAR peaks, the initially low SAR values left limited room for further improvement, resulting in a less noticeable enhancement effect. The quantitative results of the enhancement stage are also presented in Table 2 Our approach predicts the SAR distribution for a single case in 4 s—a substantial improvement over FEM-based SAR calculations, which require an average of 10 min on a high-performance workstation with 192 GB RAM machine with a 20-core CPU (2.2–3.0 GHz). 4. Discussion The findings of this study underscore the potential of deep learning-based approaches to significantly advance HTP. By leveraging a diverse and robust dataset with significant variability in tumor positions, antenna parameters, and tissue properties, our model demonstrated promising predictive capabilities for SAR distribution. The main contributions of this work are multi-fold: (1) We introduce a novel cross-attention mechanism that dynamically explores and emphasizes the interplay between antenna settings and patient-specific tissue properties and anatomy, significantly enhancing prediction accuracy. (2) By incorporating advanced deep learning techniques, our method streamlines the HTP workflow, drastically reducing the time required for FEM-based SAR estimation while minimally compromising quality, making real-time or near real-time planning feasible. To the best of our knowledge, this is the first study to develop deep learning techniques for SAR prediction, establishing a new paradigm for hyperthermia simulations. The clinical application of this method could offer several key advantages over non-AI approaches. Most notably, the substantial reduction in computation time—from approximately 10 min to just 4 s per simulation—enables near real-time re-planning, substantially benefiting clinical decision-making. While current adaptive planning techniques that use precomputed SAR libraries per antenna [ 22 46 22 46 47 22 46 Another advantage our model is the accuracy of the predicted SAR distribution, as evidenced by the low RMSE and high SSIM values and Gamma index, all indicating strong agreement with the simulation-based ground truth. The preservation of the SAR focal shape within the target region, as measured by SSIM, along with accurate SAR estimates in both target and non-target regions, suggests that the model effectively captures clinically relevant spatial patterns. The improvement achieved during the enhancement phase further underscores the model’s potential to refine initial predictions and enhance precision in critical regions. This is particularly important in hyperthermia therapy, where precise control over thermal dose is essential to maximize tumor radio-sensitization while minimizing hotspots in healthy tissue [ 48 49 Despite these promising results, further investigations are warranted to fully evaluate the efficacy of the techniques here developed before implementing them for clinical use. In particular, defining clinically relevant thresholds for technical metrics such as SSIM, RMSE, and Gamma Index remains an open question, as these do not yet have established standards in HTP. Another important limitation of this study is that all simulations were performed on a single patient anatomy. Although different tissue electrical properties, tumor positions, and antenna configurations were considered, the underlying anatomy remained unchanged. This restricts the ability of the model to capture inter-patient variability, such as differences in head size, skull thickness, brain morphology, and overall tissue composition. Consequently, further validation is required using a larger number of imaging-based patient datasets that reflect a broader spectrum of patient anatomies and pathologies. In particular, explicit separation of white and gray matter, inclusion of cerebrospinal fluid, and a wider range of tumor sizes, shapes, and locations will be critical to more comprehensively assess the robustness and clinical value of this deep learning approach for 3D SAR-based HTP. Currently, our model uses a simplified approach for phase calculation based on path-length differences. In future work, we plan to expand the model to support both phase and amplitude optimization, which is necessary to improve its flexibility and enable broader applicability across different applicator configurations and treatment scenarios. While the current work represents a significant methodological advance, its clinical translation will require substantial further development, integration, and testing within established clinical workflows. Nonetheless, this study demonstrates the feasibility and potential of our deep learning-based model as an effective approach to substantially reduce computation time in SAR prediction, addressing a key limitation of FEM-based simulations in HTP. 5. Conclusion In this work, we propose a two-stage deep learning method for predicting SAR patterns as part of the HTP workflow for brain cancer treatment. The first stage, known as the Prediction stage, employs a cross-attention-based network to effectively incorporate anatomy, tissue properties, and antenna settings. The second stage known as Enhancement uses a U-net architecture to further improve prediction accuracy. Using a brain hyperthermia applicator as a case study, our method demonstrated encouraging results, achieving accurate SAR predictions with significantly reduced computation time, facilitating both pretreatment planning and near real-time HTP in anatomically complex regions. While additional validation is required, this work lays a foundation for the integration of AI-based methods into next-generation treatment planning systems for hyperthermia. Funding This work was sponsored in part by National Institutes of Health grants R01 EB032680, R01 EB028324 and R01 CA279013. Disclosure statement No potential conflict of interest was reported by the author(s). Data availability statement The data that support the findings of this study are available from the corresponding author upon reasonable request. Appendix. AI glossary Neural network: A layered computational model inspired by the brain that learns patterns from data by adjusting connections between nodes. Convolutional neural network (CNN): A neural network architecture specialized for processing grid-like data, such as images, using convolutional layers to extract spatial features. Encoder: The part of a network that compresses input data into meaningful lower-dimensional features. Decoder: The component of a neural network that reconstructs the output (e.g., SAR distribution) from the encoded representation. Cross-attention: A mechanism that enables the model to use one input (e.g., antenna settings) to guide the interpretation of another input (e.g., tissue properties), improving contextual relevance. Query, key, and value vectors: Components of attention mechanisms where the query seeks information, the key identifies matching content, and the value provides the relevant data used in the output. Transformer: A neural architecture that uses attention mechanisms to model relationships between inputs, originally for language processing but now widely used in vision and 3D tasks. Feature: An automatically learned data representation that captures relevant patterns or structures from the input to support the prediction task Perceptron: A basic unit in a neural network that computes a weighted sum of inputs followed by an activation function. Embedded map (or embedding): A learned representation that transforms raw input data into a higher-dimensional space suitable for neural network processing. U-Net: A convolutional neural network architecture with an encoder-decoder structure and skip connections, commonly used for biomedical image segmentation. Residual block: A neural network component that adds shortcut connections to preserve information and enable training of deeper models. Ground truth: The reference standard or correct output used to evaluate model performance, typically derived from simulations or measurements. References [1] Paulides MM Dobsicek Trefna H Curto S Recent technological advancements in radiofrequency-andmicrowave-mediated hyperthermia for enhancing drug delivery Adv Drug Deliv Rev 2020 163 164 3 18 10.1016/j.addr.2020.03.004 32229271 [2] Peeken JC Vaupel P Combs SE Integrating hyperthermia into modern radiation oncology: What evidence is necessary? Front Oncol 2017 7 132 10.3389/fonc.2017.00132 28713771 PMC5492395 [3] Dewhirst MW Gibbs FA Jr Roemer RB Samulski TV: hyperthermia Gunderson LL Tepper JE Clinical radiation oncology 1st ed. New York (NY) Churchill Livingstone 2000 256 282 [4] Oei AL Vriend LE Crezee J Effects of hyperthermia on DNA repair pathways: one treatment to inhibit them all Radiat Oncol 2015 10 1 165 10.1186/s13014-015-0462-0 26245485 PMC4554295 [5] Overgaard J Horsman MR Hyperthermia Steel GG Basic clinical radiobiology 2nd ed. London Edward Arnold 1997 212 221 [6] Wust P Hildebrandt B Sreenivasa G Hyperthermia in combined treatment of cancer Lancet Oncol 2002 3 8 487 497 10.1016/s1470-2045(02)00818-5 12147435 [7] Sneed PK Stauffer PR Li GC Stege GJJ: hyperthermia Leibel SA Phillips TL Textbook of radiation oncology 2nd ed. Philadelphia (PA) W. B. Saunders 2004 1569 1596 [8] Falk MH Issels RD Hyperthermia in oncology Int J Hyperthermia 2001 17 1 1 18 10.1080/02656730150201552 11212876 [9] Chang M Hou Z Wang M Recent advances in hyperthermia therapy-based synergistic immunotherapy Adv Mater 2021 33 4 e2004788 10.1002/adma.202004788 33289219 [10] Hurwitz M Stauffer P Hyperthermia, radiation and chemotherapy: the role of heat in multidisciplinary cancer care Semin Oncol 2014 41 6 714 729 10.1053/j.seminoncol.2014.09.014 25499632 [11] van der Zee J Heating the patient: A promising approach? Ann Oncol 2002 13 8 1173 1184 10.1093/annonc/mdf280 12181239 [12] Jones EL Samulski TV Vujaskovic Z Hyperthermia Perez CA Brady LW Halperin EC Schmidt-Ullrich Principles and practice of radiation oncology 4th ed. New York Lippincott Williams & Wilkins 2004 699 735 [13] Kapp DS Hahn GM Carlson RW Principles of hyperthermia Bast RC Jr Kufe DW Pollock RE Cancer Medicine e.5 5th ed. Hamilton, Ontario B.C. Decker Inc. 2000 [14] Vernon CC Radiotherapy with or without hyperthermia in the treatment of superfi cial localizes breast cancer: results from fi ve randomizes controlled trials Int J Radiat Oncol Biol Phys 1996 35 731 744 8690639 10.1016/0360-3016(96)00154-x [15] Overgaard J Gonzalez Gonzalez D Hulshof MC Randomised trial of hyperthermia as adjuvant to radiotherapy for recurrent or metastatic malignant melanoma Lancet 1995 345 8949 540 543 10.1016/s0140-6736(95)90463-8 7776772 [16] Sneed PK Stauffer PR McDermott MW Survival benefi t of hyperthermia in prospective randomized trial of brachytherapy boost (hyperthermia for glioblastoma multiforme) Int J Radiat Oncol Biol Phys 1998 40 2 287 295 10.1016/s0360-3016(97)00731-1 9457811 [17] Datta NR Bose AK Kapoor HK Head and neck cancers: results of thermoradiotherapy versus radiotherapy Int J Hyperthermia 1990 6 3 479 486 10.3109/02656739009140944 2198311 [18] Valdagni R Amichetti M Report of long-term follow-up in a randomized trial comparing radiation therapy and radiation therapy plus hyperthermia to metastatic lymphnodes in stage IV head and neck patients Int J Radiat Oncol Biol Phys 1994 28 1 163 169 10.1016/0360-3016(94)90154-6 8270437 [19] Datta NR Rogers S Klingbiel D Hyperthermia and radiotherapy with or without chemotherapy in locally advanced cervical cancer: a systematic review with conventional and network meta-analyses Int J Hyperthermia 2016 32 7 809 821 10.1080/02656736.2016.1195924 27411568 [20] van der Zee J Gonzalez Gonzalez D van Rhoon GC Comparison of radiotherapy alone with radiotherapy plus hyperthermia in locally advanced pelvic tumours: a prospective, randomised, multicentre trial. Dutch Deep Hyperthermia Group Lancet 2000 355 9210 1119 1125 10.1016/s0140-6736(00)02059-6 10791373 [21] Kok HP van der Zee J Guirado FN Treatment planning facilitates clinical decision making for hyperthermia treatments Int J Hyperthermia 2021 38 1 532 551 10.1080/02656736.2021.1903583 33784914 [22] Rijnen Z Bakker JF Canters RAM Clinical integration of software tool VEDO for adaptive and quantitative application of phased array hyperthermia in the head and neck Int J Hyperthermia 2013 29 3 181 193 10.3109/02656736.2013.783934 23590361 [23] Yuan Y Cheng KS Craciunescu OI Utility of treatment planning for thermochemotherapy treatment of nonmuscle invasive bladder carcinoma Med Phys 2012 39 3 1170 1181 10.1118/1.3679839 22380348 PMC3292595 [24] Kok HP Ciampa S de Kroon-Oldenhof R Toward online adaptive hyperthermia treatment planning: correlation between measured and simulated specific absorption rate changes caused by phase steering in patients Int J Radiat Oncol Biol Phys 2014 90 2 438 445 10.1016/j.ijrobp.2014.05.1307 25052560 [25] Paulides MM Rodrigues DB Bellizzi GG ESHO benchmarks for computational modeling and optimization in hyperthermia therapy Int J Hyperthermia 2021 38 1 1425 1442 2021/09/29 10.1080/02656736.2021.1979254 34581246 [26] Rodrigues DB Ellsworth J Turner P Feasibility of heating brain tumors using a 915 MHz annular phased-array Antennas Wirel Propag Lett 2021 20 4 423 427 10.1109/LAWP.2021.3050142 [27] Kroesen M van Holthe N Sumser K Feasibility, SAR distribution, and clinical outcome upon reirradiation and deep hyperthermia using the Hypercollar3D in head and neck cancer patients Cancers 2021 13 23 6149 10.3390/cancers13236149 34885258 PMC8656471 [28] Rodrigues DB Pereira PJS Limão-Vieira P Study of the one dimensional and transient bioheat transfer equation: multi-layer solution development and applications Int J Heat Mass Transf 2013 62 153 162 10.1016/j.jjheatmasstransfer.2012.11.082 24511152 PMC3913296 [29] Canters RAM Wust P Bakker JF A literature survey on indicators for characterisation and optimisation of SAR distributions in deep hyperthermia, a plea for standardisation Int J Hyperthermia 2009 25 7 593 608 10.3109/02656730903110539 19848621 [30] Schwab J Antholzer S Nuster R Real-time photoacoustic projection imaging using deep learning arXiv 2018 [31] Antholzer S Haltmeier M Nuster R Photoacoustic image reconstruction via deep learning Photons plus ultrasound: imaging and sensing 2018 10494 Bellingham (WA) SPIE 2018 433 442 10.1117/12.2290676 [32] Jiang Z Sun L Yao W 3D in vivo dose verification in prostate proton therapy with deep learning-based proton-acoustic imaging Phys Med Biol 2022 67 21 215012 10.1088/1361-6560/ac9881 PMC9647484 36206745 [33] Lang Y Jiang Z Sun L Hybrid-supervised deep learning for domain transfer 3D protoacoustic Image reconstruction Phys Med Biol 2024 69 8 e085007 10.1088/1361-6560/ad3327 PMC11076107 38471184 [34] Lang Y Jiang Z Sun L Patient-specific deep learning for 3D protoacoustic image reconstruction and dose verification in proton therapy Med Phys 2024 51 10 7425 7438 10.1002/mp.17294 38980065 PMC11479840 [35] Qi CR Yi L Su H PointNet++: deep hierarchical feature learning on point sets in a metric space Advances in neural information processing systems 30 (NeurIPS 2017) Red Hook (NY) Curran Associates, Inc. 2017 5099 5108 [36] Wu W Qi Z Fuxin L PointConv: deep convolutional networks on 3D point clouds Proceedings of the IEEE/CVF conference on computer vision and pattern recognition (CVPR 2019) Piscataway (NJ) IEEE 2019 9621 9630 [37] Lian C Wang L Wu T-H Deep multi-scale mesh feature learning for automated labeling of raw dental surfaces from 3D intraoral scanners IEEE Trans Med Imag 2020 39 7 2440 2450 10.1109/TMI.2020.2971730 32031933 [38] Lang Y DLLNet: an attention-based deep learning method for dental Landmark Localization on high-resolution 3D digital dental models Proceedings of the International Conference on Medical Image Computing Assisted Intervention 2021 478 487 10.1007/978-3-030-87202-1_46 PMC8675275 34927177 [39] Lang Y DentalPointNet: landmark localization on high-resolution 3D digital dental models International Conference on Medical Image Computing and Computer-Assisted Intervention Cham Springer Nature Switzerland 2022 10.1007/978-3-030-87202-1_46 PMC8675275 34927177 [40] Chen C-FR Fan Q Panda R Crossvit: cross-attention multi-scale vision transformer for image classification Proceedings of the IEEE/CVF international conference on computer vision 2021 [41] Turner PF Ellsworth J inventorsApparatus and method for creating small focus deep hyperthermia in tissues of the brain United States 2020 [42] Turner PF Regional hyperthermia with an annular phased array IEEE Trans Biomed Eng 1984 31 1 106 114 10.1109/tbme.1984.325376 6724597 [43] Paulides MM Stauffer PR Neufeld E Simulation techniques in hyperthermia treatment planning Int J Hyperthermia 2013 29 4 346 357 10.3109/02656736.2013.790092 23672453 PMC3711016 [44] Makarov SN Noetscher GM Yanamadala J Virtual human models for electromagnetic studies and their applications IEEE Rev Biomed Eng 2017 10 95 121 10.1109/RBME.2017.2722420 28682265 PMC10502908 [45] Schooneveldt G Dobšíček Trefná H Persson M Hyperthermia treatment planning including convective flow in cerebrospinal fluid for brain tumour hyperthermia treatment using a novel dedicated paediatric brain applicator Cancers 2019 11 8 1183 10.3390/cancers11081183 31443246 PMC6721488 [46] Kok HP Korshuize-van Straten L Bakker A Online adaptive hyperthermia treatment planning during locoregional heating to suppress treatment-limiting hot spots Int J Radiat Oncol Biol Phys 2017 99 4 1039 1047 10.1016/j.jjrobp.2017.07.011 28870786 [47] Kok HP Wust P Stauffer PR Current state of the art of regional hyperthermia treatment planning: a review Radiat Oncol 2015 10 1 196 10.1186/s13014-015-0503-8 26383087 PMC4574087 [48] Carrapiço-Seabra C Curto S Franckena M Avoiding pitfalls in thermal dose effect relationship studies: a review and guide forward Cancers 2022 14 19 4795 10.3390/cancers14194795 36230717 PMC9562191 [49] Bakker A van der Zee J van Tienhoven G Temperature and thermal dose during radiotherapy and hyperthermia for recurrent breast cancer are related to clinical outcome and thermal toxicity: a systematic review Int J Hyperthermia 2019 36 1 1024 1039 10.1080/02656736.2019.1665718 31621437 Figure 1. The workflow of our approach for SAR simulation and prediction with a prediction-enhancement strategy. Figure 2. Antenna configuration of the phased-array brain applicator comprised of three rings, with each ring housing 24 antennas. The two external rings shares the same phases, leading to a total of 48 unique phases. Figure 3. The architecture of the proposed networks in both prediction-stage and Enhance-stage. (a) Prediction network architecture. (b) Cross-attention block. (c) Enhancement network architecture (d) residual block. MLP, multi-layer perceptron; CA, cross-attention; N, sample number. Figure 4. Normalized SAR prediction results of 4 example simulations out of the testing set (20 simulations). For each simulation, from top to bottom show 3 different views. From left to right shows the results from the prediction-stage, enhance-stage and the ground truth, respectively. The intensity of all images have been normalized to the maximum SAR value in the target region. Table 1. Tissue properties at 915 MHz used in the numerical SAR simulations of a five-layer human head with fat, bone, muscle, intranasal air and brain tissues obtained from the IT’IS tissue properties database v4.015. Tissue   ρ kg / m 3   ϵ r ( − )   σ ( S / m )   λ ( cm ) Air 1 1 0 32.8 DI water 1000 78.2 0.18 3.6 Fat 911 11.3 0.11 9.7 Bone 1908 12.4 0.15 9.2 Muscle 1090 55.0 0.95 4.4 White matter (W) 1041 38.8 0.60 5.2 Average of G & W 1043 45.8 0.77 4.8 Gray matter (G) 1045 52.7 0.95 4.4 The deionized (DI) water is part of the brain hyperthermia applicator. ρ ϵ r σ λ Table 2. Quantitative analysis of the prediction (P) and enhancement (E) stages for the whole brain (WB) and target region (TR) using a testing speed of 2 s. Stage Absolute RMSE PSNR (dB) SSIM GI (2%2mm) GI (3%3mm) GI (3%5mm) MAE (W/Kg) (W/Kg) Relative RMSE P (WB) 4.9 ± 0.4 5.7 ± 0.3 0.08 ± 0.02 24.9 ± 0.4 0.84 ± 0.06 83.5 ± 1.2% 85.7 ± 1.1% 88.4 ± 1.2% P (TR) 8.1 ± 0.4 9.2 ± 0.2 0.18 ± 0.03 20.7 ± 0.6 0.75 ± 0.05 78.5 ± 1.1% 80.3 ± 1.2% 82.6 ± 1.4% E (WB) 1.6 ± 0.2 3.3 ± 0.4 0.04 ± 0.02 29.7 ± 0.4 0.90 ± 0.05 87.1 ± 1.1% 90.0 ± 1.0% 91.7 ± 1.1% E (TR) 2.5 ± 0.2 4.8 ± 0.3 0.05 ± 0.01 26.5 ± 0.2 0.88 ± 0.04 85.6 ± 1.3% 87.2 ± 1.1% 90.1 ± 1.1% MAE, Mean absolute Error; RMSE, Root Mean Squared Error; PSNR, Peak signal-to-noise Ratio; SSIM, Structural Similarity Index Measure; GI, gamma Index. ",
  "metadata": {
    "Title of this paper": "Temperature and thermal dose during radiotherapy and hyperthermia for recurrent breast cancer are related to clinical outcome and thermal toxicity: a systematic review",
    "Journal it was published in:": "International journal of hyperthermia : the official journal of European Society for Hyperthermic Oncology, North American Hyperthermia Group",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12479143/"
  }
}