{
  "title": "Paper_1206",
  "abstract": "pmc Nutrients Nutrients 1692 nutrients nutrients Nutrients 2072-6643 Multidisciplinary Digital Publishing Institute  (MDPI) PMC12472814 PMC12472814.1 12472814 12472814 41010503 10.3390/nu17182977 nutrients-17-02977 1 Article No Significant Association Between Vitamin C Supplements and Frailty in Korean Older Adults: A Cross-Sectional Analysis of the 2018–2019 Korea National Health and Nutrition Examination Survey Park Seung Guk Kim Hyoeun * Capurso Cristiano Academic Editor Department of Family Medicine, Inje University Haeundae Paik Hospital, Busan 48108, Republic of Korea; sgpark@paik.ac.kr * h00392@paik.ac.kr 17 9 2025 9 2025 17 18 497660 2977 04 8 2025 06 9 2025 15 9 2025 17 09 2025 27 09 2025 29 09 2025 © 2025 by the authors. 2025 https://creativecommons.org/licenses/by/4.0/ Licensee MDPI, Basel, Switzerland. This article is an open access article distributed under the terms and conditions of the Creative Commons Attribution (CC BY) license ( https://creativecommons.org/licenses/by/4.0/ Background/Objectives Methods n n n Results p Conclusions frailty older adults vitamin C dietary supplements Korean This research received no external funding. pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement yes pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes 1. Introduction By 2025, Korea is expected to comprise a super-aged society, in which more than 20% of the total population will be over 65 years of age [ 1 2 3 2 4 5 6 4 2 3 4 7 Nutritional and physical interventions are therefore considered key to preventing or delaying frailty. Ageing is often accompanied by physiological changes, such as reduced taste and smell, dry mouth, and decreased gastric acid production, that affect the gastrointestinal system. Moreover, reduced food intake due to masticatory disorders, appetite loss, dysphagia, or constipation may further impair absorption of macro- and micronutrients, leading to nutritional imbalance and vitamin deficiency [ 8 4 9 10 11 Inflammation and oxidative stress have also been implicated in frailty pathogenesis. In a large cohort study, Saum et al. demonstrated that markers of oxidative stress were associated with higher frailty risk [ 12 12 13 14 15 However, evidence on vitamin C and frailty remains inconsistent [ 5 16 17 18 19 20 21 2. Materials and Methods 2.1. Data Source and Study Population This study analysed data from the Korean National Health and Nutrition Examination Survey (KNHANES) conducted in 2018–2019. The KNHANES provides nationally representative health and nutritional information data of Koreans. It consists of a personal health interview and a health and nutrition examination survey. Our study analysed sociodemographic data from a health interview survey, body measurement and hand grip strength data from a health examination survey, food intake through the 24 h recall method, and dietary supplement (DS) data from a nutrition survey. We selected individuals aged 65 years or older who participated in the KNHANES 2018–2019. Of the 16,109 participants, 3395 were 65 years or older. Among the 3395 participants, 315 who had missing values in the variable to determine current DS intake and 140 who had missing values in the corresponding variables (frailty component, sociodemographic, and nutritional intake-related variables) were excluded. In addition, 18 individuals with extreme values, such as total metabolic equivalent of the task (MET) for 1 week > 10,000 kcal, were excluded. Using this process, 2922 participants were selected. Of these, 1517 participants did not take any dietary supplements (non-DS), while 1405 reported the use of DSs. Among supplement users, 1227 took supplements other than vitamin C (other DS), and 178 were vitamin C users. The vitamin C user group was further subdivided into those who concurrently used other supplements in addition to vitamin C ( n n n n n Figure 1 Supplementary Table S2 2.2. Definition of Frailty We used a modified definition of the frailty phenotype developed by Fried et al. [ 4 7 9 22 Table 1 Participants were classified as frail if they met ≥3 criteria, pre-frail having 1–2 criteria, and robust having none of the five criteria. This study divided frailty into non-frail (Robust and Pre-frail) and frail (Frail). In supplementary analyses, each frailty component was modelled as a separate dependent variable ( Supplementary Table S1 2.3. Definition of Vitamin C Supplements The DS data obtained through nutritional surveys were classified into 12 types: multivitamins and mineral supplements, vitamins A, C, and D, omega-3 fatty acids, probiotics, red ginseng, calcium, lutein, propolis, iron, and others. To evaluate the association between vitamin C supplementation and frailty, we defined the vitamin C group as participants who used vitamin C supplements exclusively, thereby excluding individuals who concurrently used other supplements. Furthermore, because individuals who are in better health are generally more likely to take DSs, participants using supplements other than vitamin C were included as an additional comparator group to reduce potential selection bias. Information on DS use, including vitamin C, was collected via self-reported questionnaires. Because supplement use was assessed by self-report rather than objective verification (e.g., pill counts, prescription records, or biomarkers), potential recall bias and misclassification cannot be ruled out. In secondary analyses, frailty status was additionally evaluated according to total daily vitamin C intake from both dietary sources and supplements. While the primary exposure of interest in this study was the use of vitamin C supplements, this exploratory analysis was performed to investigate a potential dose–response relationship between overall vitamin C intake and frailty. To further assess the relationship between the amount of vitamin C intake and frailty, total vitamin C intake (from food or food plus DSs) was categorised into four groups: <100 mg (below the recommended daily amount in Korea), 100–999 mg (reflecting the upper limit [UL] of 1000 mg suggested by the WHO), 1000–1999 mg, and ≥2000 mg (the suggested UL of daily vitamin C intake in Korea) [ 25 2.4. Sociodemographic Factors Sociodemographic factors included age, sex, education, household income level, living arrangements, smoking and drinking status, body mass index (BMI), and medical history of chronic diseases or cancer. The total population aged 65 years or older was subdivided into those aged 65 to 74 years and those over 75 years. Educational level was divided into below 9 years of school (below middle school education) or over 9 years of school (high school education or above). Household income was divided into the lowest quartile (Q1) and other income levels (Q2, Q3, and Q4). Living arrangement was defined as living together or alone (unmarried, divorced, or separated). Smoking status was divided into non-smoker, former smoker, or current smoker. Drinking habit was categorised into drinking once a week or less and frequent drinking more than two times a week. Based on BMI, which was calculated by dividing weight (kg) by the square of height (m 2 2 2 2 2 26 2.5. Statistical Analyses The KNHANES employs a multistage, stratified, cluster sampling design to generate nationally representative estimates of the Korean population. Accordingly, all analyses incorporated stratification variables (strata: kstrata), cluster variables (primary sampling unit, PSU), and sampling weights. Continuous variables were compared across groups using survey-weighted general linear models, and categorical variables using χ 2 Survey-weighted logistic regression models were fitted to estimate crude and multivariable-adjusted odds ratios (ORs) with 95% confidence intervals (CIs) for the association between vitamin C supplement use and frailty. Multivariable models were adjusted for age, sex, education, income, living arrangements, body mass index, smoking status, drinking frequency, presence of chronic disease, total energy intake, and protein intake. Physical activity, being a component of the frailty phenotype, was not additionally included as a covariate to avoid construct overlap and potential over-adjustment. Adjusted predicted probabilities of frailty for each group were calculated from fitted models using post-estimation predictive margins. Absolute risk differences (ARDs) with 95% CIs were derived from these margins, and pairwise group comparisons were conducted using post-estimation contrast procedures. All analyses were performed using Stata version 15.0 SE (Stata Corp, College Station, TX, USA). A two-tailed p 3. Results 3.1. Baseline Characteristics A total of 2819 participants aged ≥65 years were included in the analysis (non-DS: n n n Table 2 p p p p p 3.2. Association Between Vitamin C Supplementation and Frailty Results of survey-weighted logistic regression are shown in Table 3 p p 3.3. Frailty According to Total Vitamin C Intake Frailty status according to daily vitamin C intake is shown in Table 4 p p 3.4. Frailty Components As shown in Supplementary Table S1 4. Discussion In light of inconsistent findings from previous studies, our analysis of nationally representative Korean adults aged ≥65 years found no significant association between vitamin C supplementation and frailty prevalence. Although crude prevalence of frailty was lower among vitamin C users compared with non-users (9.0% vs. 17.3%), this difference was not statistically significant after multivariable adjustment. Our findings are consistent with several previous studies that reported no significant associations between vitamin C and frailty. In the Framingham Offspring Study ( n 19 n 20 By contrast, other studies have reported positive associations. The InCHIANTI study ( n 11 27 These discrepancies across studies likely reflect heterogeneity in design (cross-sectional vs. longitudinal), baseline nutritional adequacy, frailty definitions, and exposure assessment methods (dietary recall vs. plasma concentrations), as well as differences in covariate adjustment. Some prior studies showing protective associations may have been affected by reverse causation, since frailer individuals might have been more motivated to take supplements. This could partly explain inconsistencies across cohorts. In our population, non-users consumed on average ~52 mg/day of vitamin C, below the Korean RNI of 100 mg/day, whereas supplement users consumed much higher amounts (mean ~1447 mg/day). This striking contrast reflects the Korean supplement market, where standalone vitamin C products are most commonly sold as 1000 mg tablets—the conventional form taken by consumers. Because most participants clustered at either very low or very high intake levels, we could not evaluate subtle dose–response relationships around the RNI threshold. However, if vitamin C exerted a strong linear protective effect, such an extreme contrast should have yielded clearer differences in frailty risk. The absence of significant associations even across this polarized intake gradient suggests that vitamin C supplementation alone is unlikely to substantially influence frailty risk in this population. Biological plausibility remains. Vitamin C plays essential roles in collagen and carnitine synthesis and in antioxidant defence, all of which are relevant to muscle mass and physical function [ 14 28 29 This study has several strengths. We used a large, nationally representative dataset with standardised protocols and directly evaluated vitamin C supplementation in an Asian population where both frailty and vitamin C insufficiency are common. To minimise selection and healthy-user bias, we classified participants into three comparator groups—non-users, other DS users, and vitamin C—only users. By separating vitamin C—only users from other DS users without vitamin C (other-DS), who share similar underlying health-seeking characteristics but differ in vitamin C intake, we were able to better isolate potential vitamin C—specific associations while reducing confounding from general supplement-related healthy-user behaviours. Several limitations should also be acknowledged. First, the cross-sectional design precludes causal inference. Second, supplement use and dietary intake were self-reported, introducing potential recall error, though standardized interviews and cross-checking with 24 h recalls improved reliability. Third, dietary intake was assessed using a single 24 h recall, which may not capture habitual consumption and could bias associations toward the null. Fourth, the use of modified frailty proxies (EQ-5D mobility for slowness, perceived stress for exhaustion, AWGS thresholds for weakness) may limit comparability with cohorts using direct measures, even though validated in prior Korean datasets. Fifth, the number of vitamin C–only users were relatively small in unweighted counts ( n Despite these limitations, our findings provide meaningful evidence. They indicate that while many older Koreans fail to achieve the RNI of 100 mg/day through diet alone, vitamin C supplementation was not significantly associated with reduced frailty prevalence. These results add to the heterogeneous international literature and suggest that vitamin C supplementation alone is unlikely to be a major determinant of frailty risk. From a public health perspective, improving overall dietary quality and ensuring adequate intake of multiple nutrients may be more effective strategies for preventing frailty than relying on single-nutrient supplementation. 5. Conclusions This study found no significant association between vitamin C supplement use and frailty in a nationally representative sample of Korean older adults. While the results do not support vitamin C supplementation as an independent strategy for frailty prevention, they provide important evidence addressing inconsistent findings in the literature. Adequate nutrition and multifactorial strategies remain essential for promoting healthy ageing, with further longitudinal and interventional studies needed to clarify the role of vitamin C in this context. Disclaimer/Publisher’s Note: Supplementary Materials The following supporting information can be downloaded at: https://www.mdpi.com/article/10.3390/nu17182977/s1 Author Contributions Conceptualization, H.K. and S.G.P.; methodology, H.K. and S.G.P.; formal analysis, S.G.P.; writing—original draft preparation, H.K. and S.G.P.; data curation, S.G.P.; writing—review and editing, H.K. and S.G.P. All authors have read and agreed to the published version of the manuscript. Institutional Review Board Statement The KNHANES 2018–2019 data were approved by the Institutional Review Board of the Korea Center for Disease Control and Prevention (IRB Approval Number: 2018-01-03-P-A, 2018-01-03-C-A). Informed Consent Statement Not applicable. Data Availability Statement The original dataset used in this study can be found in the Korea National Health and Nutrition Examination Survey repository ( https://knhanes.kdca.go.kr/ Conflicts of Interest The authors declare no conflicts of interest. Abbreviations The following abbreviations are used in this manuscript: BMI body mass index CI confidence interval DS dietary supplement KNHANES Korean National Health and Nutritional Examination Survey MET metabolic equivalent of task OR odds ratio RNI recommended daily nutritional intake References 1. Statistics Korea Estimate the Total Population and the Elderly Population; Statistics Korea, 2020 Available online: https://kostat.go.kr/boardDownload.es?bid=10820&list_no=385322&seq=2 (accessed on 28 September 2020) 2. Won C.W. Lee S. Kim J. Chon D. Kim S. Kim C.-O. Kim M.K. Cho B. Choi K.M. Roh E. Korean frailty and aging cohort study (KFACS): Cohort profile BMJ Open 2020 10 e035573 10.1136/bmjopen-2019-035573 PMC7204935 32327477 3. Kim K.J. Shin J. Choi J. Won C.W. Discrepancies in the prevalence of known frailty scales: Korean Frailty and Aging Cohort Study Ann. Geriatr. Med. Res. 2018 22 137 10.4235/agmr.2018.22.3.137 32743263 PMC7387589 4. Fried L.P. Tangen C.M. Walston J. Newman A.B. Hirsch C. Gottdiener J. Seeman T. Tracy R. Kop W.J. Burke G. Frailty in older adults: Evidence for a phenotype J. Gerontol. Ser. A 2001 56 M146 M157 10.1093/gerona/56.3.M146 11253156 5. Balboa-Castillo T. Struijk E.A. Lopez-Garcia E. Banegas J.R. Rodríguez-Artalejo F. Guallar-Castillon P. Low vitamin intake is associated with risk of frailty in older adults Age Ageing 2018 47 872 879 10.1093/ageing/afy105 30052701 6. Chen X. Mao G. Leng S.X. Frailty syndrome: An overview Clin. Interv. Aging 2014 9 433 441 10.2147/cia.s45300 24672230 PMC3964027 7. Park S.K. Frailty in Korean patients with chronic obstructive pulmonary disease, using data from the Korea National Health and Nutrition Examination Survey, 2015 and 2016 Appl. Nurs. Res. 2021 59 151417 10.1016/j.apnr.2021.151417 33947511 8. Cederholm T. Barazzoni R. Austin P. Ballmer P. Biolo G. Bischoff S.C. Compher C. Correia I. Higashiguchi T. Holst M. ESPEN guidelines on definitions and terminology of clinical nutrition Clin. Nutr. 2017 36 49 64 10.1016/j.clnu.2016.09.004 27642056 9. Jang W. Choi Y.-J. Cho J.H. Lee D.-L. Kim Y.-H. Association between seafood intake and frailty according to gender in Korean elderly: Data procured from the Seventh (2016–2018) Korea National Health and Nutrition Examination Survey J. Nutr. Health 2023 56 155 167 10.4163/jnh.2023.56.2.155 10. Yan L.-C. Yu F. Wang X.-Y. Yuan P. Xiao G. Cheng Q.-Q. Niu F.-X. Lu H.-Y. The effect of dietary supplements on frailty in older persons: A meta-analysis and systematic review of randomized controlled trials Food Sci. Technol. 2022 42 e65222 10.1590/fst.65222 11. Ferrucci L. Bandinelli S. Benvenuti E. Di Iorio A. Macchi C. Harris T.B. Guralnik J.M. Subsystems contributing to the decline in ability to walk: Bridging the gap between epidemiology and geriatric practice in the InCHIANTI study J. Am. Geriatr. Soc. 2000 48 1618 1625 10.1111/j.1532-5415.2000.tb03873.x 11129752 12. Saum K.-U. Dieffenbach A.K. Jansen E.H. Schöttker B. Holleczek B. Hauer K. Brenner H. Association between oxidative stress and frailty in an elderly German population: Results from the ESTHER cohort study Gerontology 2015 61 407 415 10.1159/000380881 25924722 13. Welch A. Jennings A. Kelaiditi E. Skinner J. Steves C. Cross-sectional associations between dietary antioxidant vitamins C, E and carotenoid intakes and sarcopenic indices in women aged 18–79 years Calcif. Tissue Int. 2020 106 331 342 10.1007/s00223-019-00641-x 31813016 PMC7072069 14. Lewis L.N. Hayhoe R.P. Mulligan A.A. Luben R.N. Khaw K.-T. Welch A.A. Lower dietary and circulating vitamin C in middle-and older-aged men and women are associated with lower estimated skeletal muscle mass J. Nutr. 2020 150 2789 2798 10.1093/jn/nxaa221 32851397 PMC7549302 15. Kim H. Park S.G. Effect of a Single Multi-Vitamin and Mineral Supplement on Nutritional Intake in Korean Elderly: Korean National Health and Nutrition Examination Survey 2018–2020 Nutrients 2023 15 1561 10.3390/nu15071561 37049402 PMC10097026 16. Bartali B. Frongillo E.A. Bandinelli S. Lauretani F. Semba R.D. Fried L.P. Ferrucci L. Low nutrient intake is an essential component of frailty in older persons J. Gerontol. Ser. A 2006 61 589 593 10.1093/gerona/61.6.589 PMC2645617 16799141 17. Shokry M.M. Hamza S. Fouad N. Mohammed M. Aly W. The relationship between vitamin C and frailty among elderly patients with type 2 diabetes mellitus Aging Med. Health 2021 12 12 19 10.33879/AMH.121.2020.07026 18. Tamaki K. Kusunoki H. Tsuji S. Wada Y. Nagai K. Itoh M. Sano K. Amano M. Maeda H. Hasegawa Y. The relationship between dietary habits and frailty in rural Japanese community-dwelling older adults: Cross-sectional observation study using a brief self-administered dietary history questionnaire Nutrients 2018 10 1982 10.3390/nu10121982 30558211 PMC6316041 19. Millar C.L. Costa E. Jacques P.F. Dufour A.B. Kiel D.P. Hannan M.T. Sahni S. Adherence to the Mediterranean-style diet and high intake of total carotenoids reduces the odds of frailty over 11 years in older adults: Results from the Framingham Offspring Study Am. J. Clin. Nutr. 2022 116 630 639 10.1093/ajcn/nqac130 35551593 PMC9437990 20. Fingeret M. Vollenweider P. Marques-Vidal P. No association between vitamin C and E supplementation and grip strength over 5 years: The Colaus study Eur. J. Nutr. 2019 58 609 617 10.1007/s00394-018-1646-9 29484474 21. Park S.-G. Kim H. Lack of Association between Insufficient Intake of Multiple Vitamins and Frailty in Older Adults Who Consume Sufficient Energy and Protein: A Nationwide Cross-Sectional Study Nutrients 2024 16 2586 10.3390/nu16162586 39203722 PMC11357227 22. Kim H. Lee E. Lee S.-W. Association between oral health and frailty: Results from the Korea National Health and Nutrition Examination Survey BMC Geriatr. 2022 22 369 10.1186/s12877-022-02968-x 35477396 PMC9044774 23. Chen L.K. Woo J. Assantachai P. Auyeung T.W. Chou M.Y. Iijima K. Jang H.C. Kang L. Kim M. Kim S. Asian Working Group for Sarcopenia: 2019 Consensus Update on Sarcopenia Diagnosis and Treatment J. Am. Med. Dir. Assoc. 2020 21 300 307.e302 10.1016/j.jamda.2019.12.012 32033882 24. Lee J. Lee C. Min J. Kang D.W. Kim J.Y. Yang H.I. Park J. Lee M.K. Lee M.Y. Park I. Development of the Korean Global Physical Activity Questionnaire: Reliability and validity study Glob. Health Promot. 2020 27 44 55 10.1177/1757975919854301 31375056 25. Ministry of Health and Welfare The Korean Nutrition Society. Diet Ref Intakes Koreans 2020, 2021 Available online: https://www.mohw.go.kr/board.es?mid=a10411010100&bid=0019 (accessed on 28 January 2021) 26. World Health Organization Western Pacific Region The Asia-Pacific Perspective: Redefining Obesity and Its Treatment International Obesity Task Force Sydney, Australia 2020 15 21 27. Lorenzo-López L. Maseda A. de Labra C. Regueiro-Folgueira L. Rodríguez-Villamil J.L. Millán-Calenti J.C. Nutritional determinants of frailty in older adults: A systematic review BMC Geriatr. 2017 17 108 10.1186/s12877-017-0496-2 28506216 PMC5433026 28. Takisawa S. Funakoshi T. Yatsu T. Nagata K. Aigaki T. Machida S. Ishigami A. Vitamin C deficiency causes muscle atrophy and a deterioration in physical performance Sci. Rep. 2019 9 4702 10.1038/s41598-019-41229-7 30894591 PMC6426981 29. Park C.Y. Shin S. Low dietary vitamin C intake is associated with low muscle strength among elderly Korean women Nutr. Res. 2024 127 75 83 10.1016/j.nutres.2024.05.006 38889453 Figure 1 Flowchart of the participant selection and classification according to vitamin C supplement use in KNHANES 2018−2019. Abbreviation: KNHANES, Korean National Health and Nutrition Examination Survey; DS, dietary supplements; n nutrients-17-02977-t001_Table 1 Table 1 A slightly modified definition of the frailty index using the KNHANES dataset. Frailty Components Indicator (Proxy in KNHANES) Measurement/Cutoff Reference(s) Weight loss Self-reported unintentional weight loss Self-reported unintentional weight loss ≥ 3 kg in the past year [ 7 9 22 Exhaustion Self-reported level of perceived stress Response of “extreme stress” in daily life (KNHANES stress questionnaire) [ 9 Weakness Hand grip strength Digital dynamometer (T.K.K. 5401, Japan); maximum of three trials from dominant hand (six trials if ambidextrous); Asian working group for sarcopenia (AWGS) 2019 cutoffs: <28 kg (men), <18 kg (women) [ 7 9 22 23 Slowness EQ-5D; Mobility limitation I have some problems in walking, or I am confined to bed. [ 7 9 22 Low energy expenditure The Global Physical Activity Questionnaire The lowest 20% of physical activity evaluated by METs for each gender based on data from the National Survey of Older Koreans [ 22 24 Abbreviation: KNHANES, Korean National Health and Nutrition Examination Survey; MET, metabolic equivalent task; EQ-5D, Euro Quality of Life-5 Dimension Standard Frail: if ≥3 criteria are fulfilled, Pre-frail: 1 or 2 criteria are fulfilled, Robust: none of the criteria are fulfilled. nutrients-17-02977-t002_Table 2 Table 2 Baseline characteristics of participants in the Non-DS, Other DS, and Vitamin C supplements group. Characteristics Non-DS n N Other DS n N Vitamin C n N p p Age, years 73.43 (0.18) 72.61 (0.18) 72.83 (0.60) 0.3268 0.7207 65–74 years, % 54.8 (1.8) 62.4 (1.9) 64.8 (6.7) 0.1587 0.7279 ≥75 years, % 45.2 (1.8) 37.6 (1.9) 35.2 (6.7)   Sex, women, % 51.4 (1.5) 60.6 (1.5) 40.5 (6.1) 0.0885 0.0017 Education level ≤ 9 years, % 74.4 (1.6) 64.3 (2.0) 53.8 (7.2) 0.0015 0.1256 The lowest 25% quartile of income, % 50.0 (1.9) 41.3 (2.0) 38.6 (6.7) 0.1025 0.6916 Living alone, % 19.7 (1.1) 19.2 (1.4) 23.3 (5.4) 0.4859 0.4474 Current smoker, % 10.7 (1.0) 7.3 (0.9) 8.9 (3.5) 0.6248 0.6526 Frequent alcohol drinking, % 18.5 (1.1) 14.8 (1.1) 16.9 (6.0) 0.8045 0.7226 Total MET, kcal/week 399.13 (25.90) 530.14 (31.46) 672.32 (153.25) 0.0717 0.3526 Body mass index, kg/m 2 24.13 (0.09) 24.00 (0.10) 24.06 (1.35) 0.8689 0.8590 Underweight (BMI < 18.5) 2.7 (0.5) 2.2 (0.4) 0.5 (0.5) 0.5548 0.6742 Normal (18.5 ≤ BMI < 23) 33.1 (1.4) 36.5 (1.6) 34.2 (6.6)   Overweight (23 ≤ BMI < 25) 26.1 (1.3) 26.8 (1.5) 30.2 (6.3)   Obesity (25 ≥ BMI) 38.1 (1.4) 34.4 (1.6) 35.1 (6.0)   Number of comorbidities ≥ 3, % 20.4 (1.3) 16.3 (1.2) 16.7 (5.0) 0.5127 0.9402 Nutritional intake      Total energy, kcal 1567.05 (21.10) 1627.05 (21.61) 1678.22 (87.69) 0.2234 0.5661 Carbohydrate, g 269.54 (3.37) 270.96 (3.53) 287.12 (15.97) 0.2815 0.3167 Protein, g 51.89 (0.87) 57.23 (0.98) 57.33 (3.27) 0.1110 0.9786 Fat, g 25.18 (0.68) 30.00 (0.76) 25.95 (1.89) 0.6975 0.0470 Vitamin C, mg      Food 52.70 (2.24) 57.25 (1.87) 56.38 (5.63) 0.5297 0.8797 Food + Supplements 52.70 (2.24) 102.52 (4.10) 1447.34 (177.95) <0.0001 <0.0001 Frailty      Robust, % 16.6 (1.3) 20.8 (1.4) 30.4 (5.6) 0.0109 0.1915 Pre-frail, % 66.1 (1.4) 66.6 (1.6) 60.6 (6.3)   Frail, % 17.3 (1.2) 12.6 (1.1) 9.0 (3.8)   Abbreviation: DS, dietary supplements; n N nutrients-17-02977-t003_Table 3 Table 3 Association between intake of vitamin C supplements and frailty.  Crude Adjusted Adjusted Probability Absolute Risk Difference p Non-DS vs. Vitamin C 0.46 0.65 16.2 (14.1–18.3) vs. −4.6 (−13.6 to +4.3) 0.308 Other DS vs. Vitamin C 0.68 0.81 13.6 (11.5–15.8) vs. −2.1 (−11.2 to +7.1) 0.656 Non-DS are participants who did not consume any type of dietary supplements (DS). Values are presented as odds ratios (ORs) with 95% confidence intervals (CIs), adjusted predicted probabilities, and absolute risk differences derived from survey-weighted logistic regression models. Multivariable models were adjusted for age, sex, education level, income level, living alone, body mass index, alcohol consumption, smoking status, number of chronic diseases, total energy intake, and protein intake. nutrients-17-02977-t004_Table 4 Table 4 Frailty according to of daily vitamin C intake (food and supplements combined). Daily Intake of Vitamin C <100 mg n N 100–999 mg n N 1000–1999 mg n N ≥2000 mg n N p Mean vitamin C intake, mg Food 27.31 84.00 41.84 25.88 <0.001 Food+ 28.70 175.73 (1.02) 1066.89 2974.05 <0.001 Frailty status, % Robust 16.1 (1.1) 26.7 (2.1) 26.7 (6.4) 30.7 (10.7) <0.001 Pre-frail 67.1 (1.2) 63.4 (2.3) 63.0 (7.2) 62.9 (11.3)  Frail 16.8 (1.1) 9.9 (1.2) 10.3 (4.1) 6.4 (6.2)  OR 1 (ref) 0.79 (0.57–1.08) 0.79 (0.31–2.02) 0.46 (0.05–3.68) 0.120 Abbreviation: n N ",
  "metadata": {
    "Title of this paper": "Low dietary vitamin C intake is associated with low muscle strength among elderly Korean women",
    "Journal it was published in:": "Nutrients",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12472814/"
  }
}