{
  "title": "Paper_55",
  "abstract": "pmc J Transl Med J Transl Med 214 transmed Journal of Translational Medicine 1479-5876 BMC PMC12492677 PMC12492677.1 12492677 12492677 41039497 10.1186/s12967-025-07078-x 7078 1 Review The molecular mechanisms of mitochondrial dynamics and mitophagy and their complex association with cancer drug resistance Zhao Zhuo Ren Yuru Yuan Meijie Liu Guobin 15800885533@163.com Sun Jian yamaca@163.com https://ror.org/00z27jk27 grid.412540.6 0000 0001 2372 7462 Department of Peripheral Vascular Disease, Shuguang Hospital, Shanghai University of Traditional Chinese Medicine, 2 10 2025 2025 23 478331 1047 27 4 2025 29 8 2025 02 10 2025 04 10 2025 04 10 2025 © The Author(s) 2025 2025 https://creativecommons.org/licenses/by-nc-nd/4.0/ Open Access http://creativecommons.org/licenses/by-nc-nd/4.0/ The development of drug resistance by cancer cells is among the main reasons for cancer treatment failure, greatly limiting the efficacy of chemotherapy, targeted therapy, and immunotherapy. Mitochondria, as the core organelles of cellular energy metabolism, play a key role in the cellular stress response. The dynamic changes in mitochondria, including fusion, fission, and mitophagy, not only regulate cellular energy metabolism and biosynthesis but also affect cell survival and death. Through mitochondrial fusion, fission, and mitophagy, a sufficient number of effective mitochondria are ensured to supply cellular energy, thereby increasing the tolerance of tumor cells to chemotherapeutic drugs and generating drug resistance. Recently, the role of mitochondrial dynamics and mitophagy in cancer drug resistance has gradually gained attention, but their complex structure and function and multiple roles in tumor biology pose challenges for the clinical application of cancer treatment strategies based on it. Therefore, targeting mitochondrial dynamics and mitophagy for cancer drug resistance has attracted increasing attention for various cancer types. In this study, we provide insights into the molecular mechanisms of mitochondrial fusion, fission, and mitophagy and summarize their complex associations with cancer drug resistance through a systematic review of the latest literature. Keywords Cancer drug resistance Mitochondrial fusion Mitochondrial fission Mitophagy http://dx.doi.org/10.13039/501100001809 National Natural Science Foundation of China 82074185 Sun Jian pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement no pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes issue-copyright-statement © BioMed Central Ltd., part of Springer Nature 2025 Introduction Cancer is among the major public health challenges globally, and the issue of its therapeutic resistance has become a key constraint on achieving optimal efficacy of cancer treatment [ 1 2 3 4 5 6 Mitochondria play an important role in cell physiology and pathology as the cell’s energy factories. They are mainly involved in key biological processes, including cell metabolism, apoptosis, oxidative stress, and cell signaling [ 7 10 11 12 13 14 15 The mitochondria are dynamic organelles undergoing constant fusion and fission [ 16 17 18 19 20 21 22 23 24 Overview of the molecular mechanisms of mitochondrial fusion, fission and mitophagy Mitochondrial fusion Mitochondrial fusion is the process of merging two mitochondria into a single unit through a series of steps (Fig. 1 25 26 27 28 29 Fig. 1 Molecular Mechanism of Mitochondrial Fusion. A B MFN1 and MFN2 are both homologs of Drosophila Fzo in mammals [ 30 28 31 32 33 34 35 OPA1 has 30% homology with yeast mgm1p, and in the absence of MFN1, OPA1 could not promote mitochondrial fusion; moreover, MFN1 and OPA1 were functionally interdependent [ 29 36 37 36 38 39 40 41 Mitochondrial fusion is mainly categorized into OMM and IMM fusion, which have different mechanisms; OMM fusion reportedly precedes IMM fusion [ 42 28 43 39 44 41 45 46 Mitochondrial fission Mitochondrial fission, which is the process by which a mitochondrion splits into two smaller mitochondria (Fig. 2 47 48 50 51 52 Fig. 2 Molecular mechanism of mitochondrial fission. ER tubules wrap around mitochondria and define the fission site. Recruitment: Cytosolic DRP1 monomers are recruited to the mitochondrial outer membrane (OMM) via receptors (e.g., Mff, MID49/51) and cardiolipin translocated from the inner membrane (IMM). Assembly: DRP1 oligomerizes into a helical ring structure encircling the mitochondrion. Constriction: GTP hydrolysis by DRP1 drives conformational changes, tightening the helical ring. Actin filaments provide mechanical force to enhance membrane constriction. Fission: Extreme constriction leads to membrane fission, generating two independent mitochondria. By Figdraw DRP1, belonging to the GTPase dynamin superfamily [ 53 54 51 53 55 56 57 58 57 59 60 61 62 63 64 52 63 65 66 67 68 Mitochondrial fission is a multistep process. Currently, DRP1-dependent mitochondrial fission is mainly divided into the following steps. It starts with the translocation of DRP1 to the OMM. Since DRP1 is normally located in the cytoplasm [ 51 69 60 70 71 52 72 73 74 75 76 75 77 78 Mitophagy Autophagy is a process in which a cell wraps the material to be degraded in the autophagosome, forming a double-membrane structure, and then delivers it to the lysosome for degradation through different pathways. Autophagy was first observed by Keith R. Porter and Thomas Ashford in human hepatocytes in 1962 [ 79 80 82 83 3 84 Fig. 3 Molecular Mechanism of Mitophagy. A B The mechanism of mitophagy, which was first discovered in yeast, depends on the molecular mechanism of the macroautophagic process, but it does not depend on a considerable decrease in the cellular ATP levels [ 85 86 87 86 88 In mammals, the regulatory mechanism of mitophagy is more complex as compared to that in yeast. Based on the current studies, the mechanisms of mitophagy can be categorized as follows: Ub-dependent and Ub-independent pathways. The UB-dependent pathway mainly refers to the mitophagy mediated by PINK1/Parkin, a PTEN-mediated serine/threonine kinase encoded by the PARK6 gene, whose N-terminus comprises a MTS. In the healthy mitochondria, with the assistance of mitochondrial outer membrane translocases 22 (TOM22) and 70 (TOM70), TOM20 recognizes the MTS sequence of PINK1 and guides PINK1 through the translocation pore formed by TOM40 to enter the TIM23 complex of the IMM, completing its mitochondrial import process [ 89 90 92 93 94 95 89 96 97 98 Parkin is an E3 Ub ligase encoded by the PARK2 gene. It comprises the ubiquitin-like (Ubl), RING0 (very interesting new gene 0), RING1, IBR (intermediate RING), REP (Parkin’s repressor element), and RING2 structural domains [ 84 99 103 104 105 106 107 108 109 A series of autophagy junction proteins (P62/SQSTM1 [ 110 111 112 113 114 115 111 116 117 118 113 119 120 121 122 The UB-independent pathways do not depend on the function of PINK1 or Parkin to initiate mitophagy. On the OMM, there are various proteins containing LIR, a signaling region that can interact with the autophagosome membrane (LC3). The LIR region of these proteins acts as a receptor for autophagy and can directly bind to LC3 and initiate mitophagy without the need for ubiquitination. In mammals, these receptors mainly include BCL2-interacting protein 3 (BNIP3), Nip3-like protein X (NIX)/BCL2-interacting protein 3 like (BNIP3L), and FUN14 domain containing 1 (FUNDC1). These receptors mediate the mitophagy process through a direct interaction with LC3. BNIP3 belongs to the Bcl-2 protein family [ 123 124 125 126 NIX is a homolog of BNIP3 encoded by the BNIP3L gene, which also belongs to the Bcl-2 protein family [ 127 128 129 130 131 132 133 FUNDC1 is a protein localized to the OMM, and, similar to BNIP3 and NIX, FUNDC1 has a typical LIR motif that mediates mitophagy through its LIR motif interacting with LC3 [ 134 134 135 134 135 Association of mitochondrial dynamics and mitophagy with cancer drug resistance The mitochondrial dynamics consist mainly of the processes of mitochondrial fusion and fission, which are capable of forming networks or fragments in response to the cellular metabolic needs. Mitophagy is coordinated with fission and helps to remove excess mitochondria that are functionally impaired. Through the concerted action of mitochondrial dynamics and mitophagy, cancer cells ensure a sufficient supply of functional mitochondria for energy production, thereby increasing their tolerance to chemotherapeutic drugs and contributing to the development of drug resistance [ 20 1 2 3 Table 1 Mitochondrial fusion and cancer drug resistance Interacting molecule Type of cancer Drugs Experimental model Intervention method Resistance type Molecular mechanism References MFN1/MFN2 Osteosarcoma Cisplatin/Doxorubicin Cell lines CRISPR/Cas9 knockout of DRP1 Congenital Osteosarcoma stem cells promote mitochondrial fusion and enhance chemotherapy resistance by maintaining stable expression of mitochondrial fusion-related proteins [ 144 MFN1 Lymphoma Tamoxifen Cell lines/Animal Knockdown of MFN1/Overexpression of MFN1 Acquired MFN1 overexpression attenuates tamoxifen-induced mitochondrial apoptosis and promotes tamoxifen resistance [ 142 OPA1 Non-small cell lung cancer Cisplatin Cell lines Knockdown of p32 OPA1/Overexpression of OPA1/metformin inhibitor/p32 activator Acquired Knockdown of OPA1 sensitizes cisplatin-resistant cells of non-small cell lung cancer to cisplatin [ 141 MFN1/MFN2 Cervical cancer Cisplatin Cell lines Knockdown of EPHA2 Congenital Knockdown of EPHA2 promotes mitochondrial fusion by up-regulating the protein levels of MFN1 and MFN2, which in turn enhances the sensitivity of cervical cancer cells to cisplatin [ 147 MFN1 Acute myeloid leukemia Cytarabine/Daunorubicin Cell lines/Clinical samples/Animal Knockout of STAT3/Knockdown of MFN1/Overexpression of MFN1 Acquired Interleukin 6 upregulates MFN1-mediated mitochondrial fusion in acute myeloid leukemia, thereby promoting chemoresistance [ 145 OPA1 Lung adenocarcinoma Gefitinib Cell lines/Animal Knockdown of MFN1/OPA1 inhibitor MYLS22 Acquired Opa1 mediates gefitinib resistance in lung adenocarcinoma cells by maintaining mitochondrial cristae structure integrity and inhibiting cytochrome c release [ 140 MCL1/MFN1 Gallbladder cancer Gemcitabine Cell lines/Clinical samples/Animal Knockdown of CEBPD MCL1 MFN1/STAT3 inhibitor S3I-201/MCL1 inhibitor MIM1 Acquired Knockout of MCL1 or mitochondrial fusion marker MFN1 increases the sensitivity of gallbladder cancer cells treated with leptin to gemcitabine [ 139 MFN1 Cervical cancer Cisplatin Cell lines VDAC1 inhibitor DIDS/mPTP inhibitor CsA Congenital Cisplatin kills human cervical cancer cells by interfering with mitochondrial VDAC1 and promoting mitochondrial fusion [ 146 MFN2 Adenocarcinoma of the lungs Cisplatin Cell lines/Clinical samples Not used Acquired Combination of SMI and cisplatin induces apoptosis by up-regulating MFN2-dependent mitochondrial fusion in cisplatin-resistant A549 cells from lung adenocarcinoma [ 138 MFN2 Ovarian cancer Cisplatin Cell lines Knockdown of DRP1 MFN2/Overexpression of MFN2 Acquired Overexpression of MFN2 promotes cisplatin resistance in ovarian cancer cells SKOV3 [ 143 MFN2 T-lymphocytic leukemia Adriamycin Cell lines CRISPR/Cas9 knockout of MFN-2 Congenital Knockdown of MFN2 significantly increases the sensitivity of human T-lymphoblastic leukemia cells to the anthracycline adriamycin [ 136 OPA1 Acute myeloid leukemia Venetoclax Cell lines/Animal Knockouts of CLPB TP53 BAX/BAK/BCL-2 inhibitor Venetoclax Acquired Human acute myeloid leukemia (AML) cells resistant to venetoclax exhibit tighter mitochondrial cristae and higher OPA1 protein expression [ 149 MFN1 Neuroblastoma Cisplatin Cell lines Knockdown of MFN1/Overexpression of N-Myc/Glycolysis inhibitor 2-DG Congenital The reduction of MFN1 renders N-Myc-overexpressing neuroblastoma cells sensitive to cisplatin-induced apoptosis [ 137 OPA1/PHB2 Prostate/Breast Cancer EGFR Tyrosine Kinase Inhibitors Cell lines/Clinical samples Overexpression of EGF/EGFR tyrosine kinase inhibitor AEE788/EGF activates pmEGFR Congenital Inhibiting fatty acid synthase can block EGF-induced mitochondrial fusion and increase the sensitivity of prostate cancer cells to EGFR tyrosine kinase inhibitors [ 148 OPA1 Lung cancer Cisplatin Cell lines/Clinical samples Knockdown of OPA1/PKC inhibitor Calphostin C/Agonists nicotine Congenital Silencing the expression of OPA1 can reduce the resistance of lung cancer cells to cisplatin [ 150 Table 2 Mitochondrial fission and cancer drug resistance Interacting molecule Type of cancer Drugs Experimental model Intervention method Resistance type Molecular mechanism References DRP1 Osteosarcoma Cisplatin/Doxorubicin Cell lines CRISPR/Cas9 knockout of DRP1 Congenital Knockdown of DRP1 alters the mitochondrial morphology of osteosarcoma and reduces its resistance to chemotherapy [ 144 DRP1/Fis1/MIEF1 Cervical cancer Cisplatin Cell lines Knockdown of EPHA2 Congenital knockdown of EPHA2 reduced the expression levels of DRP1, Fis1, and MIEF1, which in turn inhibited mitochondrial fission, thereby enhancing cell sensitivity to cisplatin [ 147 DRP1 Breast cancer Paclitaxel Cell lines/Animal DRP1 Knockdown/DRP1 inhibitor Mdivi-1 Acquired Inhibition of DRP1 significantly enhanced the sensitivity of breast cancer cells to paclitaxel [ 171 DRP1 Ovarian cancer Cisplatin Cell lines/Clinical samples/Animal Knockdown of CUL4A, DDB1, and ATG5/Overexpression of CRL4/autophagy inhibitor/AMPK activators Acquired Knockdown of CRL4 resulted in a significant decrease in DRP1 phosphorylation at the Ser637 site, which enhanced mitochondrial fission [ 172 DRP1 Breast cancer Cisplatin Cell lines/Clinical samples/Animal DRP1, ROCK/MLCK inhibitor/Knockdown of NRF2, DRP1, MIEF1/2, and KEAP1 Congenital By inhibiting DRP1 or NRF2, the sensitivity of breast cancer cells to cisplatin can be restored [ 167 Mff Hepatocellular carcinoma Cisplatin Cell lines/Clinical samples/Animal Knockdown of Mff Acquired Mff knockdown inhibits mitochondrial fission and sensitizes human cisplatin-resistant hepatocellular carcinoma cells to cisplatin [ 154 DRP1 Bladder cancer Cisplatin Cell lines/Clinical samples Knockdown of MLKL/Overexpression of RIPK1/MLKL and apoptosis inhibitors Acquired Piperlongumine (PL)increases the sensitivity of bladder cancer to cisplatin by mitochondrial ROS [ 158 Cell cycle protein C Gastric cancer Cisplatin Cell lines/Clinical samples/Animal CRISPR/Cas9 knockout of HACE1 or CCNC/Transfection of exogenous HACE1 plasmid/caspase-3 inhibitor Acquired Cyclin C ubiquitination deficiency inhibits mitochondrial fission, reduces ROS accumulation and apoptosis, leading to drug resistance [ 166 PHB1 Gynecologic malignancy Cisplatin Cell lines/Clinical samples Knockdown of Phb1 Acquired In chemosensitive gynecological cancer cells, PHB1 promotes cisplatin-induced mitochondrial fission [ 160 DRP1 Ovarian and colon cancer Stem characteristics of tumor cells Cell lines/Clinical samples/Animal Knockdown of DRP1/DRP1 inhibitor Mdivi-1/Glutaminease inhibitor L-DON Acquired Glutamine deficiency promotes tumor cell stemness and chemoresistance through DRP1-induced mitochondrial fission [ 153 DRP1 Nasopharyngeal Carcinoma Cisplatin Cell lines/Clinical samples/Animal Knockdown of LMP1/DRP1/Cdk1/Overexpression of LMP1/DRP1 inhibitor Mdivi-1/AMPK agonist metformin Congenital Inhibition of DRP1, metformin or cucurbitacin E increases cisplatin sensitivity of nasopharyngeal carcinoma in vivo and in vitro [ 152 DRP1 Non-small cell lung cancer Docetaxel/Cisplatin Cell lines/Animal Knockdown of DRP1/DRP1 inhibitor Mdivi-1 Congenital PIM1 overexpression reduces total DRP1 levels in cells and confers significant resistance to docetaxel and cisplatin [ 159 DRP1 Non-small cell lung cancer Tumor Necrosis Factor Related Apoptosis Inducing Ligand (TRAIL) Cell lines Knockdown of DR4 DR5 DRP1/DRP1 inhibitor Mdivi-1/JNK inhibitor SP600125 Congenital Lignans enhance TRAIL sensitivity in NSCLC cells through c-Jun N-terminal kinase (JNK) signaling by increasing DR5 expression and DRP1-mediated mitochondrial fission [ 163 DRP1 Kidney cancer Cisplatin Cell lines Knockdown of DRP1/c-FLIP plasmid overexpression/DRP1 inhibitor Mdivi-1 Not specified Mdivi-1, a mitochondrial fission inhibitor, sensitizes cancer cells to cisplatin-induced apoptosis by down-regulating c-FLIP [ 165 DRP1 Ovarian cancer Cisplatin Cell lines/Clinical samples Knockdown of DRP1/DRP1 inhibitor Mdivi-1 Acquired Inhibition of DRP1 expression increases cisplatin sensitivity in hypoxic ovarian cancer cells [ 156 DRP1 Ovarian cancer Cisplatin Cell lines Knockdown of Sirt3/Overexpression of Sirt3/Bcl-2 inhibitor Acquired Sirt3 activation induced by the Bcl-2 inhibitor ABT737 promoted mitochondrial fission process and increased the sensitivity of ovarian cancer cells to cisplatin [ 161 DRP1 Breast cancer Tamoxifen Cell lines/Animal Glycolysis inhibitor 2-deoxyglucose Acquired Breast cancer tamoxifen-resistant cells exhibit more pronounced mitochondrial fragmentation, as reflected by increased phosphorylation of DRP1 at the Ser637 site [ 151 DRP1 Colorectal cancer Oxaliplatin/Capecitabine/Irinotecan Cell lines/Clinical samples/Animal Knockdown of DRP1 HMGB1 RAGE/HMGB1 RAGE DRP1 MEK/ERK inhibitor Acquired HMGB1 promotes ERK-mediated mitochondrial DRP1 phosphorylation via RAGE leading to cancer drug resistance [ 169 CerS6 Oral squamous cell carcinoma Cisplatin Cell lines/Animal Overexpression of pGC-CerS6/Autophagy inhibitor 3-MA Acquired CerS6 regulates cisplatin resistance in oral squamous cell carcinoma by altering mitochondrial fission [ 164 DRP1/Fis1 Bladder cancer Cisplatin/Doxorubicin Cell lines/Clinical samples Knockdown of LASS2/Overexpression of LASS2/miR-98 inhibitor Congenital miR-98 promotes mitochondrial fragmentation and enhances the resistance of bladder cancer cells to chemotherapeutic drugs by up-regulating p-DRP1 and Fis1 [ 155 DRP1 Ovarian cancer Cisplatin Cell lines DRP1 inhibitor Mdivi-1/BCL2/BCL-XL inhibitor ABT737 Acquired ABT737 promotes apoptosis in cisplatin-resistant ovarian cancer cells by inducing DRP1-dependent mitochondrial fission [ 162 miR-148a-3p Gastric cancer Cisplatin Cell lines/Clinical samples/Animal Knockdown of AKAP1 RAB12/Overexpression of AKAP1 RAB12/autophagy inhibitor Acquired miR-148a-3p sensitizes gastric cancer cells to cisplatin by increasing mitochondrial fission-induced apoptosis [ 170 DRP1 T-cell acute lymphoblastic leukemia Cytarabine/Methotrexate Cell lines Overexpression of DRP1/ERK inhibitor PD325901 Acquired BM-MSCs enhance T-ALL chemoresistance via ERK-DRP1 axis, promoting mitochondrial fission and reprogramming metabolism [ 168 DRP1 Neuroblastoma Etoposide/Doxorubicin Cell lines Knockdown of DRP1 FOXO3 Survivin/Overexpression of Survivin BclxL FOXO3/DRP1 inhibitor Mdivi-1 Congenital Survivin overexpression induces mitochondrial fragmentation and enhances aerobic glycolysis and drug resistance [ 157 DRP1 Ovarian cancer Cisplatin Cell lines/Animal Knockdown of p53/DRP1 inhibitor Mdivi-1/Pan-caspase inhibitor zVAD-fmk Congenital Piceatannol significantly enhances the sensitivity of ovarian cancer cells to cisplatin by promoting DRP1-dependent mitochondrial fragmentation [ 173 Table 3 Mitophagy and cancer drug resistance Interacting molecule Type of cancer Drugs Experimental model Intervention method Resistance type Molecular mechanism References Decreased mitochondrial membrane potential Triple-negative breast cancer Doxorubicin Cell lines/Clinical samples Not used Congenital Enhanced mitophagy leads to increased drug resistance in MDA-MB-231 cells after doxorubicin treatment [ 174 PINK1/Parkin/BNIP3 Cervical cancer Cisplatin Cell lines Knockdown of EPHA2 Congenital Knockdown of EPHA2 decreased the protein levels of PINK1, Parkin and BNIP3, thereby inhibiting mitophagy. This inhibition led to an increase in the sensitivity of the cells to cisplatin [ 147 PINK1/Parkin Non-small cell lung cancer Paclitaxel Cell lines/Animal Knockdown of STOML2/Overexpression of STOML2/miR-671-5p mimics and inhibitors Acquired Resveratrol, via miR-671-5p/STOML2/PINK1/Parkin axis, inhibits mitophagy and enhances paclitaxel sensitivity in paclitaxel-resistant non-small cell lung cancer cells [ 187 PINK1/Parkin/BNIP3 Endometrial cancer Progesterone Cell lines/Animal Knockdown of SIRT1 FOXO3/Overexpression of/deacetylase inhibitor DIC/autophagy inhibitor chloroquine CQ Acquired Overexpression of SIRT1 promotes BNIP3 transcription and PINK1/Parkin-mediated mitophagy through deacetylation of FOXO3, leading to tumour resistance to hormone therapy [ 180 BNIP3 Osteosarcoma Cisplatin Cell lines/Clinical samples/Animal Knockdown of BNIP3/Overexpression of FoxG1 Acquired FoxG1 overexpression promotes BNIP3 expression, enhances mitophagy in drug-resistant osteosarcoma cells, and re-sensitizes drug-resistant cells to cisplatin in vitro and in vivo [ 192 PRAL Gastric cancer Cisplatin Cell lines/Animal Knockdown of NPR1/overexpression of NPR1/Mitophagy inhibitor Mdivi-1 Acquired NPR1 promotes cisplatin resistance by inhibiting PARL-mediated mitophagy in gastric cancer [ 198 DRP1/PINK1/Parkin Multiple myeloma Bortezomib Cell lines/Clinical samples/Animal CRISPR/Cas9 knockout of DRP1/DRP1 inhibitor Mdivi-1 Acquired Lomitapide inhibits drug resistance in multiple myeloma cells by inducing DRP1-mediated mitophagy, leading to mitochondrial dysfunction and damage [ 179 PINK1/Parkin Lymphoma Adriamycin Cell lines Knockdown of Parkin/Overexpression of miR-218-5p/Mitophagy inhibitor NH₄Cl Congenital miRNA-218-5p, targeting Parkin mRNA, inhibits Adriamycin mediated mitophagy in MCF7 and MDA-MB-231 cells, increasing their sensitivity to adriamycin [ 186 BNIP3 Hepatocellular carcinoma Lenvatinib Cell lines/Animal Knockdown of BNIP3/Overexpression of BNIP3/BNIP3 inhibitor olomoucine/AMPK activator AMPK-activator-2 Acquired BNIP3-mediated excessive activation of mitophagy maintains the competitive advantage of drug-resistant HCC cells over sensitive HCC cells by regulating the AMPK-ENO2 axis [ 175 PINK1/Parkin Clear cell renal cell carcinoma Pazopanib Cell lines/Clinical samples/Animal Knockdown of SLC27A3/Overexpression of SLC27A3/Mitophagy inhibitor 3-MA Acquired STAT2/SLC27A3/PINK1-mediated mitophagy remodels lipid metabolism and leads to pazopanib resistance in clear cell renal cell carcinoma [ 177 PINK1/Parkin Ovarian cancer Cisplatin Cell lines Knockdown of CLPP/overexpression of CLPP/Proteasome inhibitor MG132 Acquired HSPA8-mediated CLPP increases cisplatin resistance in ovarian cancer by inhibiting mitophagy and promoting cellular stress [ 184 PINK1/Parkin Lymphoma Doxorubicin Cell lines/Animal Transferrin receptor inhibitor ferristatin II Acquired HTf@DOX/Qu NPs effectively reversed the resistance of doxorubicin-resistant cells in breast cancer by down-regulating COX-2 and activating the PINK1/Parkin axis [ 191 PINK1/Parkin Ovarian cancer PARPi Cell lines Overexpression of PINK1 Congenital Astragalus polysaccharide inhibits mitophagy via PINK1/Parkin signaling pathway and enhances the sensitivity of ovarian cancer stem cells to PARPi [ 199 PINK1/Parkin Small cell lung cancer Adriamycin/cisplatin Cell lines/Clinical samples/Animal Knockdown of METTL3/overexpression of METTL3/METTL3 inhibitor STM2457 Acquired METTL3 modifies DCP2 mRNA through m6A methylation, leading to DCP2 degradation, which in turn regulates the PINK1/Parkin pathway, increases mitophagy, and ultimately promotes chemoresistance [ 194 MFN2 Acute myeloid leukemia (AML) BH3 analog Cell lines/Clinical samples/Animal Knockout of MFN2/overexpression of MFN2/autophagy inhibitor chloroquine CQ Acquired Up-regulation of MFN2 clears damaged mitochondria by enhancing mitophagy and is a key mechanism of resistance to BH3 mimics in acute myeloid leukemia cells [ 200 Parkin/VDAC1 Non-small cell lung cancer EGFR-TKIs Cell lines/Clinical samples/Animal Knockdown of cIGF1R/overexpression of cIGF1R/EGFR-TKIs IGF1R inhibitor linsitinib/ Acquired By inhibiting mitophagy, the efficacy of EGFR-TKIs could be significantly enhanced to overcome drug resistance in DTP cells [ 201 PINK1/Parkin Hepatocellular carcinoma Lenvatinib Cell lines/Clinical samples/Animal Knockdown of LINC0167 p62 Nrf2/overexpression of/LINC0167 p62 Nrf2 miR-892b Inhibitor Acquired LINC01607 reduces ROS-related oxidative stress and promotes lenvatinib resistance by increasing mitophagy [ 178 BNIP3/BNIP3L Hepatocellular carcinoma Sorafenib Cell lines/Animal Knockdown of BNIP3 BNIP3L TET2/overexpression of BNIP3 BNIP3L/autophagy inhibitor 3-MA Acquired Stem cells derived from menstrual blood reversed the resistance of drug-resistant cells to sorafenib by upregulating the expression of BNIP3 and BNIP3L and overactivating mitophagy [ 196 PINK1/Parkin Ovarian cancer Cisplatin Cell lines/Clinical samples/Animal Knockdown of CUL4A, DDB1, and ATG5/overexpression of CRL4/autophagy inhibitor/AMPK activators Acquired CRL4 is significantly upregulated in cisplatin-resistant OCC. Knockdown of CRL4 significantly enhances mitophagy by activating the Parkin-PINK1 pathway [ 172 PINK1/Parkin Squamous cell carcinoma of the head and neck Cisplatin Cell lines Melatonin and vitiligo drug inhibitors Congenital Melatonin (Mel) and verteporfin (VP) effectively reduce stemness and drug resistance in head and neck squamous cell carcinoma cells by inhibiting mitophagy [ 190 BNIP3 Ovarian cancer/osteosarcoma Cisplatin Cell lines/Clinical samples Knockdown of BNIP3/autophagy inhibitor PIK-III Acquired High expression of BNIP3 in cisplatin-resistant cells was associated with enhanced mitophagy, and inhibition of BNIP3 restored cellular sensitivity to cisplatin [ 193 PINK1/Parkin Multiple myeloma Bortezomib/dexamethasone/adriamycin Cell lines/Clinical samples/Animal Knockdown of PIWIL1/overexpression of PIWIL1/mitophagy inhibitor CsA Acquired PIWIL1 mediates resistance to chemotherapeutic drugs by activating the AKT-mTOR and Parkin-dependent mitophagy pathway [ 185 HIF-1α Breast cancer Adriamycin Cell lines Mitochondrial antioxidant mitoTEMPO Acquired Activation of mitophagy was closely associated with elevated mitochondrial ROS levels and increased expression of HIF-1α, which together contributed to the development of drug resistance [ 202 PINK1/Parkin Hepatocellular carcinoma Sorafenib Cell lines/Clinical samples/Animal Knockdown of ATAD3A PINK1/overexpression of ATAD3A/mitophagy inhibitor 3-MA Acquired Down-regulation of ATAD3A activates mitophagy via the PINK1/Parkin axis, thereby protecting HCC cells from the killing effects of sorafenib [ 188 Parkin Lung cancer Cisplatin Cell lines Knockdown of Cav-1/ROCK1 inhibitor Y27632 Acquired Caveolin-1 silencing inhibits Parkin-associated mitophagy and increases the therapeutic sensitivity of lung cancer to cisplatin-induced apoptosis [ 189 LC3 Ovarian cancer Cisplatin Cell lines/Animal Mitophagy/autophagy inhibitor bafilomycin A1 Acquired The use of bafilomycin A1 to inhibit mitophagy significantly suppressed the proliferation and clonogenicity of drug-resistant cells [ 176 PINK1/Parkin Liver/breast cancer B5G1 Cell lines/Animal Knockdown of PINK1 parkin/mitophagy inhibitor Mdivi-1 Acquired B5G1 induces mitophagy mediated by the PINK1/Parkin pathway.The combination of B5G1 and mitophagy inhibitors can increase the sensitivity of multidrug-resistant cancer cells to B5G1 [ 195 PINK1 Esophageal squamous cell carcinoma Cisplatin/5-fluorouracil/adriamycin/docetaxel Cell lines/Clinical samples Knockdown of PINK1/autophagy inhibitor chloroquine Acquired Inhibition of mitophagy using siPINK1 restored the sensitivity of ESCC cells to chemotherapeutic agents in in vitro experiments [ 181 BNIP3L Colorectal cancer Adriamycin Cell lines Knockdown of ATG7 BNIP3L Congenital Silencing of BNIP3L significantly stops mitophagy and improves the sensitivity of cancer stem cell CSCs to adriamycin [ 183 FUNDC1 Cervical cancer Cisplatin Cell lines/Clinical samples Knockdown of FUNDC1 Congenital Inhibition of FUNDC1-mediated mitophagy can increase the sensitivity of cancer cells to cisplatin [ 182 LC3 Acute myeloid leukemia (AML) FLT3-ITD inhibitor crenolanib Cell lines/Clinical samples/Animal Knockdown of FLT3 CerS1 LC3B DRP1/overexpression of LC3B DRP1/DRP1 inhibitor Mdivi-1/PKA activator bromo-cAMP Acquired LCL-461 effectively attenuates crenolanib resistance by inducing lethal mitophagy in FLT3-ITD acute myeloid leukemia primary cells in vitro and in vivo [ 197 Mitochondrial fusion and cancer drug resistance Mitochondrial fusion dynamically modulates drug resistance through tripartite regulation of energy metabolism, apoptotic evasion, and ROS homeostasis—with functional outcomes dictated by cancer lineage specificity, molecular drivers, and drug mechanisms. We synthesize these complex interactions below, resolving apparent contradictions and proposing actionable therapeutic strategies. Metabolic reprogramming: bioenergetic plasticity Fusion adaptively rewires energy metabolism to sustain survival under therapeutic stress. While MFN2-mediated fusion enhances OXPHOS respiratory efficiency in doxorubicin-resistant leukemia [ 136 137 138 139 Apoptotic suppression: structural and molecular barriers Mitochondrial fusion can protect cancer cells from apoptosis through at least two complementary mechanisms. First, fusion preserves the structural integrity of mitochondrial cristae, which prevents the release of pro-apoptotic factors like cytochrome c. The inner mitochondrial membrane fusion protein OPA1 plays a critical role in maintaining cristae morphology; in gefitinib-resistant lung adenocarcinoma cells, for example, heightened OPA1 activity keeps the cristae junctions tight, thereby blocking cytochrome c efflux and subsequent caspase activation [ 140 141 142 143 ROS signaling: dualistic roles in survival Mitochondrial fusion exerts dualistic control over reactive oxygen species (ROS) signaling in cancer cells, conferring either cytoprotective suppression of ROS or paradoxically promoting pro-survival ROS generation, depending on the context. For instance, osteosarcoma stem cells resist chemotherapy by sustaining mitochondrial fusion via DRP1 inhibition, which reduces ROS accumulation and enables resistance to cisplatin and doxorubicin [ 144 145 146 Resolving therapeutic paradoxes: lineage and drug mechanism dependencies The impact of mitochondrial fusion on drug resistance exhibits striking context dependency, exemplified by cisplatin—a frontline chemotherapeutic that elicits opposing resistance outcomes across cancers despite consistently promoting fusion: In cervical cancer, cisplatin-induced upregulation of MFN1/MFNE2 correlates with reduced resistance (IC₅₀ decrease from 20 to 10.34 μM), where EPHA2 knockdown or sesamol treatment reverses innate cisplatin tolerance by enhancing fusion [ 147 143 138 144 Molecular drivers resolve this divergence: Pro-survival pathways like “EGFR/FASN-driven OPA1 fusion” in lung cancer [ 148 139 Drug mechanisms dictate fusion outcomes: Direct triggers (e.g., cisplatin → VDAC1 oligomerization → pathological fusion [ 146 145 Therapeutic targeting To counteract fusion-driven drug resistance, several therapeutic approaches are proposed. Direct inhibition of fusion proteins has shown efficacy—for instance, using an OPA1 inhibitor (MYLS22) re-sensitizes gefitinib-resistant lung cancer cells to therapy [ 140 136 146 148 147 138 144 Mitochondrial fusion bolsters drug resistance through interconnected effects on apoptosis, metabolism, and ROS, but its pro-survival role is not universal. Cell-type specificity, drug actions, and fusion protein identities dictate functional outcomes, explaining seemingly contradictory results (Table 1 136 139 145 Mitochondrial fission and cancer drug resistance Mitochondrial fission, primarily regulated by DRP1 and its adaptors (e.g., Mff, Fis1, MIEFs), plays a context-dependent role in cancer drug resistance. This complexity arises from its intricate crosstalk with metabolic reprogramming, apoptosis evasion, reactive oxygen species (ROS) homeostasis, stemness maintenance, and autophagy regulation. The effect of fission on resistance hinges on cell type, genomic background, drug mechanism, and microenvironmental cues. Fission as a resistance mechanism: metabolic, apoptotic, and stemness crosstalk Metabolic Adaptation and Stemness: Fission frequently accompanies glycolytic switching and suppressed oxidative phosphorylation (OXPHOS), promoting survival under stress. In tamoxifen-resistant breast cancer, fission (via DRP1-Ser637 phosphorylation) drives respiratory supercomplex disassembly, OXPHOS impairment, and LDH isoform switching, enabling metabolic escape [ 151 152 153 144 Apoptosis Suppression: Fission can inhibit cytochrome c release and caspase activation. In hepatocellular carcinoma, Mff-mediated fission directly impedes apoptosis to confer cisplatin resistance [ 154 155 156 157 Fission as a sensitizing mechanism: ROS, apoptosis, and autophagy synergy ROS Threshold Effects and Necroptosis: Moderate fission can elevate ROS beyond pro-survival thresholds. Piperlongumine reverses bladder cancer cisplatin resistance by inducing extreme fission/ROS, activating RIPK1/RIPK3/MLKL-dependent necroptosis [ 158 159 Pro-Apoptotic Fission and Autophagy Modulation: In apoptosis-competent tumors, fission enables cell death execution. Phb1 promotes fission via Oma1-mediated L-Opa1 cleavage, activating p53-Bak-driven apoptosis and sensitizing gynecological cancers to cisplatin [ 160 161 162 163 164 165 Resolving contextual disparities: cell type, drugs, and microenvironment The paradoxical effects of mitochondrial fission on drug resistance can be explained by differences in the therapeutic context, including the type of drug applied, the tumor microenvironment, and the cancer’s genetic/epigenetic landscape. Drug mechanism is a key determinant. For instance, DNA-damaging chemotherapeutics like cisplatin elicit opposite fission responses in different cancers. In cervical cancer and certain liver cancer models, DRP1-dependent mitochondrial fission is activated and actually promotes resistance to cisplatin (in cervical cancer this occurs via an EPHA2–DRP1 signaling axis [ 147 154 166 162 Microenvironmental factors also critically modulate fission’s role in resistance. Extracellular conditions such as matrix stiffness and stromal support can tilt fission toward pro-survival or pro-death outcomes. For example, a softer extracellular matrix was shown to promote DRP1-mediated fission through the actin nucleator Spire1C and the Arp2/3 complex, which in turn activates NRF2-dependent antioxidant pathways and helps cancer cells survive cisplatin treatment [ 167 168 169 Genetic and epigenetic drivers further account for fission’s context-dependent effects. The p53 status of tumor cells is one prominent example: fission tends to induce apoptosis in cancers with wild-type TP53, whereas p53-mutant cells often fail to respond to fission-driven apoptotic cues. In p53^WT gynecologic cancer models, for instance, overexpression of prohibitin 1 (PHB1) enhances mitochondrial fission (via OMA1-mediated OPA1 cleavage) and strongly activates p53-dependent Bax/Bak apoptosis, thereby sensitizing cells to cisplatin; but in isogenic p53^mutant cells, this pro-apoptotic fission pathway is ineffective [ 160 170 Therapeutic implications: targeting fission in resistance Effectively targeting mitochondrial fission for therapeutic benefit requires context-tailored strategies. Depending on whether fission is helping tumor cells evade drugs or, conversely, making them vulnerable, one can either inhibit the fission machinery or artificially drive fission to push cells past a viability threshold. Harnessing fission inhibitors: In cases where excessive fission is identified as a driver of chemoresistance, inhibiting fission can restore sensitivity to treatment. A prime example is the use of the DRP1 inhibitor Mdivi-1 in drug-resistant breast cancer cells: Mdivi-1 effectively blocks mitochondrial fission, which in turn was shown to downregulate the MDR1 drug-efflux pump and reactivate caspase-dependent apoptosis, thereby resensitizing breast cancer cells to paclitaxel [ 171 147 Exploiting fission induction: Paradoxically, the opposite strategy can be beneficial in tumors where baseline fission is low and mitochondria are overly fused to evade cell death. For these, forcing mitochondrial fission to an extreme degree can trigger cell death programs such as oxidative damage or even necroptosis. One illustrative agent is piperlongumine, a natural compound that drives robust DRP1-mediated fission and a surge of ROS in bladder cancer cells; in models of cisplatin-resistant bladder carcinoma, piperlongumine-induced hyper-fission raised ROS levels above a lethal threshold and triggered necroptotic cell death, effectively killing cells that were previously drug-resistant [ 158 172 Finally, it is important to recognize that mitochondrial fission’s role in drug resistance is not universally “good” or “bad”—it entirely depends on how fission intersects with a cell’s broader signaling network. Fission outcomes are defined by their integration with metabolic fitness, redox balance, the cell’s apoptotic threshold, cancer stemness, and autophagy capacity. Therefore, therapies targeting fission must be personalized to each tumor context. In designing treatments, one should evaluate coexisting molecular drivers (for example, p53 mutation status, Akt activation levels, or dysregulated microRNAs like miR-98 and miR-148a) and also consider microenvironmental conditions (such as glutamine availability, hypoxia, or matrix stiffness) that could influence how fission impacts the cell. By identifying these context cues, clinicians can decide whether to inhibit fission’s pro-survival effects or conversely to push fission to induce cell death. This nuanced, context-aware approach to targeting mitochondrial fission is likely to yield the best outcomes in combating drug-resistant cancers (see Table 2 Mitophagy and cancer drug resistance Mitophagy, the selective autophagy of mitochondria, plays a context-dependent role in cancer drug resistance. Its activation or suppression can either promote survival or enhance therapy sensitivity, depending on cancer type, drug mechanism, and interactions with core mitochondrial functions: energy metabolism, reactive oxygen species (ROS) dynamics, and apoptosis regulation. This complexity arises from mitophagy's ability to modulate mitochondrial quality, quantity, and functional outputs. Mitophagy interfaces with mitochondrial metabolism and ROS to drive resistance Mitophagy frequently reprograms energy metabolism to sustain resistant cells. In TNBC, DRP1-mediated fission and PINK1/Parkin-dependent mitophagy sustain OXPHOS and ROS homeostasis, enabling doxorubicin resistance [ 174 175 176 177 178 141 179 180 Mitophagy suppresses apoptosis to confer resistance A key resistance mechanism is mitophagy-mediated inhibition of mitochondrial apoptosis. In esophageal squamous carcinoma, PINK1-dependent mitophagy blocks cytochrome c release and apoptosis [ 181 182 183 184 185 Contextual dependencies: cell line, drug mechanism, and combination therapy Mitophagy’s role is highly context-specific. Drug mechanisms dictate outcomes: doxorubicin activates PINK1/Parkin mitophagy to inhibit apoptosis in breast cancer [ 186 187 188 189 190 191 Therapeutic strategies to overcome resistance Targeting mitophagy regulators offers promising avenues to overcome drug resistance. One approach is to inhibit pro-survival mitophagy pathways: silencing of key mitophagy effectors such as BNIP3 [ 192 193 194 186 187 195 172 177 178 196 Mitophagy’s dual role in resistance hinges on its integration with mitochondrial functions (Table 3 190 191 175 177 172 174 175 192 193 197 Summary The mitochondrion, which is the center of cellular energy metabolism and core of apoptosis regulation, plays a complex role in tumorigenesis and development. The mitochondria constitute a key defense for tumor cells against chemotherapeutic drugs through a multilevel regulatory network established by dynamic remodeling (fusion and fission) and quality control (mitophagy) [ 203 168 161 142 183 Although the roles of mitochondrial dynamics and mitophagy in cancer drug resistance have been partially revealed, their complex structure and function, as well as their multiple roles in tumor biology, lead to challenges for the clinical application of mitochondria-based cancer therapeutic strategies. For example, tumor cells can respond to cellular damage by activating mitophagy, reducing the effectiveness of mitochondrial damage therapy [ 204 18 19 20 Abbreviations MBD2c Methyl-CpG binding domain 2c SIRT3 Sirtuin 3 MFN1 Mitofusin-1 MFN2 Mitofusin 2 DRP1 Dynamin-related protein 1 Fzo Fuzzy onion OMM Outer mitochondrial membrane IMM Inner mitochondrial membrane Mgm1 Mitochondrial genome maintenance 1 OPA1 Optic atrophy 1 HR1 Heptad repeat 1 HR2 Heptad repeat 2 PINK1 PTEN-induced putative kinase 1 Parkin Parkin RBR E3 ubiquitin protein ligase ER Endoplasmic reticulum MTS Mitochondrial targeting sequence TMD Transmembrane structural domain GED GTPase effector domain MPP Mitochondrial processing peptidase PD Paddle domain Mdv1p Mitochondrial fission 1 protein Caf4p Caf4 protein Fis1 Mitochondrial fission 1 protein Mff Mitochondrial fission factor MiD49 Mitochondrial dynamics protein of 49 kDa MiD51 Mitochondrial dynamics protein of 51 kDa Vps1P Vacuolar protein sorting 1 protein MD Middle domain VD Variable domain BSE Bundle signaling element CMA Chaperone-mediated autophagy Atg32 Autophagy-related protein 32 TMD Transmembrane structural domain Atg11 Autophagy-related protein 11 Atg8 Autophagy-related protein 8 UB Ubiquitin PTEN Phosphatase and tensin homolog PARK6 PTEN-induced kinase 1 TOM22 Translocase of outer mitochondrial membrane 22 TOM70 Translocase of outer mitochondrial membrane 70 TOM40 Translocase of outer mitochondrial membrane 40 TIM23 Translocase of inner mitochondrial membrane 23 PARL Presenilin-associated rhomboid-like UBR1 Ubiquitin protein ligase E3 component N-recognin 1 UBR2 Ubiquitin protein ligase E3 component N-recognin 2 UBR4 Ubiquitin protein ligase E3 component N-recognin 4 TOM7 Translocase of outer mitochondrial membrane 7 TIM17 Translocase of inner mitochondrial membrane 17 PARK2 Parkin RBR E3 ubiquitin protein ligase UBL Ubiquitin-like RING0 Really interesting new gene 0 RING1 Really interesting new gene 1 IBR In-between ring REP Repressor element RING2 Really interesting new gene 2 UPD Unique parkin domain Miro1 Mitochondrial Rho-GTPase 1 VDAC1 Voltage-dependent anion channel 1 P62/SQSTM1 Sequestosome 1 NBR1 NBR1 autophagy cargo receptor NDP52/CALCOCO2 Nuclear dot protein 52/Calcium binding and coiled-coil domain containing 2 TAX1BP1 Tax1 binding protein 1 OPTN Optineurin UBA Ubiquitin-binding domain SKICH SKIP carboxyl homology domain ZF Zinc finger domain LIR LC3-interacting region CCD Coiled-coil domain LZD Leucine zipper domain ZFD Zinc finger domain TBK1 Tank-binding kinase 1 UBAN Ubiquitin binding domain in ABINs and NEMO ATG9A Autophagy related 9A BNIP3 BCL2-interacting protein 3 NIX Nip3-like protein X BNIP3L BCL2-interacting protein 3 like FUNDC1 FUN14 domain containing 1 JNK1/2 C-Jun N-terminal kinase 1/2 PP1/2A Protein phosphatase 1/2A MER Minimal essential region WIPI2 WD repeat domain, phosphoinositide interacting 2 PGAM5 Phosphoglycerate mutase 5 DXR Anthracycline drug adriamycin AML Human acute myeloid leukemia N-Myc Neuroblastoma Myc STAT3 Signal transducer and activator of transcription 3 CEBPD CCAAT/enhancer binding protein delta MCL1 Myeloid cell leukemia sequence 1 MSCs Mesenchymal stem cells T-ALL T-cell acute lymphoblastic leukemia HMGB1 High-mobility group box 1 RAGE Receptor for advanced glycation end-products ERK Extracellular signal-regulated kinase ABT737 Apoptosis-inducing Bcl-2 family inhibitor ABT737 Sirt3 Sirtuin 3 ESCC Esophageal squamous cell carcinoma B5G1 Betulinic acid derivative B5G1 CSCs Cancer stem cells HCC Hepatocellular carcinoma PL Piperlongumine TRAIL Tumor necrosis factor related apoptosis inducing ligand Publisher's Note Springer Nature remains neutral with regard to jurisdictional claims in published maps and institutional affiliations. Acknowledgements Not applicable. Author contributions ZZ collected literatures, prepared figures and tables, and drafted the manuscript. YR and MY edited the manuscript. GL and JS conceived the idea and reviewed the manuscript. All authors read and approved the final manuscript. Funding The present study was supported by the National Natural Science Foundation of China (Grant No. 82074185). Data availability Not applicable. Declarations Competing interests The authors declare that they have no competing interests. References 1. Vasan N Baselga J Hyman DM A view on drug resistance in cancer Nature 2019 575 7782 299 309 10.1038/s41586-019-1730-1 31723286 PMC8008476 Vasan N, Baselga J, Hyman DM. A view on drug resistance in cancer. Nature. 2019;575(7782):299–309. 31723286 10.1038/s41586-019-1730-1 PMC8008476 2. Kaur R Bhardwaj A Gupta S Cancer treatment therapies: traditional to modern approaches to combat cancers Mol Biol Rep 2023 50 11 9663 9676 10.1007/s11033-023-08809-3 37828275 Kaur R, Bhardwaj A, Gupta S. Cancer treatment therapies: traditional to modern approaches to combat cancers. Mol Biol Rep. 2023;50(11):9663–76. 37828275 10.1007/s11033-023-08809-3 3. Holohan C Cancer drug resistance: an evolving paradigm Nat Rev Cancer 2013 13 10 714 726 10.1038/nrc3599 24060863 Holohan C, et al. Cancer drug resistance: an evolving paradigm. Nat Rev Cancer. 2013;13(10):714–26. 24060863 10.1038/nrc3599 4. Gottesman MM Mechanisms of cancer drug resistance Annu Rev Med 2002 53 615 627 10.1146/annurev.med.53.082901.103929 11818492 Gottesman MM. Mechanisms of cancer drug resistance. Annu Rev Med. 2002;53:615–27. 11818492 10.1146/annurev.med.53.082901.103929 5. Shi ZD Tumor cell plasticity in targeted therapy-induced resistance: mechanisms and new strategies Signal Transduct Target Ther 2023 8 1 113 10.1038/s41392-023-01383-x 36906600 PMC10008648 Shi ZD, et al. Tumor cell plasticity in targeted therapy-induced resistance: mechanisms and new strategies. Signal Transduct Target Ther. 2023;8(1):113. 36906600 10.1038/s41392-023-01383-x PMC10008648 6. Zhou Y Na C Li Z Novel insights into immune cells modulation of tumor resistance Crit Rev Oncol Hematol 2024 202 104457 10.1016/j.critrevonc.2024.104457 39038527 Zhou Y, Na C, Li Z. Novel insights into immune cells modulation of tumor resistance. Crit Rev Oncol Hematol. 2024;202:104457. 39038527 10.1016/j.critrevonc.2024.104457 7. Spinelli JB Haigis MC The multifaceted contributions of mitochondria to cellular metabolism Nat Cell Biol 2018 20 7 745 754 10.1038/s41556-018-0124-1 29950572 PMC6541229 Spinelli JB, Haigis MC. The multifaceted contributions of mitochondria to cellular metabolism. Nat Cell Biol. 2018;20(7):745–54. 29950572 10.1038/s41556-018-0124-1 PMC6541229 8. Riley, J.S., et al. Mitochondrial inner membrane permeabilisation enables mtDNA release during apoptosis. Embo J. 2018;37(17). 10.15252/embj.201899238 PMC6120664 30049712 9. Sinha K Oxidative stress: the mitochondria-dependent and mitochondria-independent pathways of apoptosis Arch Toxicol 2013 87 7 1157 1180 10.1007/s00204-013-1034-4 23543009 Sinha K, et al. Oxidative stress: the mitochondria-dependent and mitochondria-independent pathways of apoptosis. Arch Toxicol. 2013;87(7):1157–80. 23543009 10.1007/s00204-013-1034-4 10. Tan JX Finkel T Mitochondria as intracellular signaling platforms in health and disease J Cell Biol 2020 10.1083/jcb.202002179 32320464 PMC7199861 Tan JX, Finkel T. Mitochondria as intracellular signaling platforms in health and disease. J Cell Biol. 2020. 10.1083/jcb.202002179. 32320464 10.1083/jcb.202002179 PMC7199861 11. Warburg O On the origin of cancer cells Science 1956 123 3191 309 314 10.1126/science.123.3191.309 13298683 Warburg O. On the origin of cancer cells. Science. 1956;123(3191):309–14. 13298683 10.1126/science.123.3191.309 12. Ward PS Thompson CB Metabolic reprogramming: a cancer hallmark even Warburg did not anticipate Cancer Cell 2012 21 3 297 308 10.1016/j.ccr.2012.02.014 22439925 PMC3311998 Ward PS, Thompson CB. Metabolic reprogramming: a cancer hallmark even Warburg did not anticipate. Cancer Cell. 2012;21(3):297–308. 22439925 10.1016/j.ccr.2012.02.014 PMC3311998 13. Zhang, L., et al. Targeting mitochondrial metabolic reprogramming as a potential approach for cancer therapy. Int J Mol Sci. 2023;24(5). 10.3390/ijms24054954 PMC10003438 36902385 14. Hao Y Mitochondria-localized MBD2c facilitates mtDNA transcription and drug resistance Nat Chem Biol 2024 10.1038/s41589-024-01776-1 39609546 Hao Y, et al. Mitochondria-localized MBD2c facilitates mtDNA transcription and drug resistance. Nat Chem Biol. 2024. 10.1038/s41589-024-01776-1. 39609546 10.1038/s41589-024-01776-1 15. Gu YR Mitochondrial metabolic reprogramming by SIRT3 regulation ameliorates drug resistance in renal cell carcinoma PLoS ONE 2022 17 6 e0269432 10.1371/journal.pone.0269432 35671305 PMC9173632 Gu YR, et al. Mitochondrial metabolic reprogramming by SIRT3 regulation ameliorates drug resistance in renal cell carcinoma. PLoS ONE. 2022;17(6):e0269432. 35671305 10.1371/journal.pone.0269432 PMC9173632 16. Bereiter-Hahn J Vöth M Dynamics of mitochondria in living cells: shape changes, dislocations, fusion, and fission of mitochondria Microsc Res Tech 1994 27 3 198 219 10.1002/jemt.1070270303 8204911 Bereiter-Hahn J, Vöth M. Dynamics of mitochondria in living cells: shape changes, dislocations, fusion, and fission of mitochondria. Microsc Res Tech. 1994;27(3):198–219. 8204911 10.1002/jemt.1070270303 17. Nunnari J Mitochondrial transmission during mating in Saccharomyces cerevisiae is determined by mitochondrial fusion and fission and the intramitochondrial segregation of mitochondrial DNA Mol Biol Cell 1997 8 7 1233 1242 10.1091/mbc.8.7.1233 9243504 PMC276149 Nunnari J, et al. Mitochondrial transmission during mating in Saccharomyces cerevisiae is determined by mitochondrial fusion and fission and the intramitochondrial segregation of mitochondrial DNA. Mol Biol Cell. 1997;8(7):1233–42. 9243504 10.1091/mbc.8.7.1233 PMC276149 18. Youle RJ van der Bliek AM Mitochondrial fission, fusion, and stress Science 2012 337 6098 1062 1065 10.1126/science.1219855 22936770 PMC4762028 Youle RJ, van der Bliek AM. Mitochondrial fission, fusion, and stress. Science. 2012;337(6098):1062–5. 22936770 10.1126/science.1219855 PMC4762028 19. Lu Y Cellular mitophagy: mechanism, roles in diseases and small molecule pharmacological regulation Theranostics 2023 13 2 736 766 10.7150/thno.79876 36632220 PMC9830443 Lu Y, et al. Cellular mitophagy: mechanism, roles in diseases and small molecule pharmacological regulation. Theranostics. 2023;13(2):736–66. 36632220 10.7150/thno.79876 PMC9830443 20. Jin P Mitochondrial adaptation in cancer drug resistance: prevalence, mechanisms, and management J Hematol Oncol 2022 15 1 97 10.1186/s13045-022-01313-4 35851420 PMC9290242 Jin P, et al. Mitochondrial adaptation in cancer drug resistance: prevalence, mechanisms, and management. J Hematol Oncol. 2022;15(1):97. 35851420 10.1186/s13045-022-01313-4 PMC9290242 21. Srinivasan S Mitochondrial dysfunction and mitochondrial dynamics-the cancer connection Biochim Biophys Acta Bioenerg 2017 1858 8 602 614 10.1016/j.bbabio.2017.01.004 28104365 PMC5487289 Srinivasan S, et al. Mitochondrial dysfunction and mitochondrial dynamics-the cancer connection. Biochim Biophys Acta Bioenerg. 2017;1858(8):602–14. 28104365 10.1016/j.bbabio.2017.01.004 PMC5487289 22. Sharma A Mitochondrial signaling pathways and their role in cancer drug resistance Cell Signal 2024 122 111329 10.1016/j.cellsig.2024.111329 39098704 Sharma A, et al. Mitochondrial signaling pathways and their role in cancer drug resistance. Cell Signal. 2024;122:111329. 39098704 10.1016/j.cellsig.2024.111329 23. Poole LP Macleod KF Mitophagy in tumorigenesis and metastasis Cell Mol Life Sci 2021 78 8 3817 3851 10.1007/s00018-021-03774-1 33580835 PMC8259496 Poole LP, Macleod KF. Mitophagy in tumorigenesis and metastasis. Cell Mol Life Sci. 2021;78(8):3817–51. 33580835 10.1007/s00018-021-03774-1 PMC8259496 24. Guan Y Mitophagy in carcinogenesis, drug resistance and anticancer therapeutics Cancer Cell Int 2021 21 1 350 10.1186/s12935-021-02065-w 34225732 PMC8256582 Guan Y, et al. Mitophagy in carcinogenesis, drug resistance and anticancer therapeutics. Cancer Cell Int. 2021;21(1):350. 34225732 10.1186/s12935-021-02065-w PMC8256582 25. Hales KG Fuller MT Developmentally regulated mitochondrial fusion mediated by a conserved, novel, predicted GTPase Cell 1997 90 1 121 129 10.1016/S0092-8674(00)80319-0 9230308 Hales KG, Fuller MT. Developmentally regulated mitochondrial fusion mediated by a conserved, novel, predicted GTPase. Cell. 1997;90(1):121–9. 9230308 10.1016/s0092-8674(00)80319-0 26. Hermann GJ Mitochondrial fusion in yeast requires the transmembrane GTPase Fzo1p J Cell Biol 1998 143 2 359 373 10.1083/jcb.143.2.359 9786948 PMC2132826 Hermann GJ, et al. Mitochondrial fusion in yeast requires the transmembrane GTPase Fzo1p. J Cell Biol. 1998;143(2):359–73. 9786948 10.1083/jcb.143.2.359 PMC2132826 27. Wong ED The dynamin-related GTPase, Mgm1p, is an intermembrane space protein required for maintenance of fusion competent mitochondria J Cell Biol 2000 151 2 341 352 10.1083/jcb.151.2.341 11038181 PMC2192650 Wong ED, et al. The dynamin-related GTPase, Mgm1p, is an intermembrane space protein required for maintenance of fusion competent mitochondria. J Cell Biol. 2000;151(2):341–52. 11038181 10.1083/jcb.151.2.341 PMC2192650 28. Chen H Mitofusins Mfn1 and Mfn2 coordinately regulate mitochondrial fusion and are essential for embryonic development J Cell Biol 2003 160 2 189 200 10.1083/jcb.200211046 12527753 PMC2172648 Chen H, et al. Mitofusins Mfn1 and Mfn2 coordinately regulate mitochondrial fusion and are essential for embryonic development. J Cell Biol. 2003;160(2):189–200. 12527753 10.1083/jcb.200211046 PMC2172648 29. Cipolat S OPA1 requires mitofusin 1 to promote mitochondrial fusion Proc Natl Acad Sci U S A 2004 101 45 15927 15932 10.1073/pnas.0407043101 15509649 PMC528769 Cipolat S, et al. OPA1 requires mitofusin 1 to promote mitochondrial fusion. Proc Natl Acad Sci U S A. 2004;101(45):15927–32. 15509649 10.1073/pnas.0407043101 PMC528769 30. Rojo M Membrane topology and mitochondrial targeting of mitofusins, ubiquitous mammalian homologs of the transmembrane GTPase Fzo J Cell Sci 2002 115 Pt 8 1663 1674 10.1242/jcs.115.8.1663 11950885 Rojo M, et al. Membrane topology and mitochondrial targeting of mitofusins, ubiquitous mammalian homologs of the transmembrane GTPase Fzo. J Cell Sci. 2002;115(Pt 8):1663–74. 11950885 10.1242/jcs.115.8.1663 31. Mattie S A new mitofusin topology places the redox-regulated C terminus in the mitochondrial intermembrane space J Cell Biol 2018 217 2 507 515 10.1083/jcb.201611194 29212658 PMC5800796 Mattie S, et al. A new mitofusin topology places the redox-regulated C terminus in the mitochondrial intermembrane space. J Cell Biol. 2018;217(2):507–15. 29212658 10.1083/jcb.201611194 PMC5800796 32. Cao YL MFN1 structures reveal nucleotide-triggered dimerization critical for mitochondrial fusion Nature 2017 542 7641 372 376 10.1038/nature21077 28114303 PMC5319402 Cao YL, et al. MFN1 structures reveal nucleotide-triggered dimerization critical for mitochondrial fusion. Nature. 2017;542(7641):372–6. 28114303 10.1038/nature21077 PMC5319402 33. Ishihara N Eura Y Mihara K Mitofusin 1 and 2 play distinct roles in mitochondrial fusion reactions via GTPase activity J Cell Sci 2004 117 Pt 26 6535 6546 10.1242/jcs.01565 15572413 Ishihara N, Eura Y, Mihara K. Mitofusin 1 and 2 play distinct roles in mitochondrial fusion reactions via GTPase activity. J Cell Sci. 2004;117(Pt 26):6535–46. 15572413 10.1242/jcs.01565 34. Eura Y Two mitofusin proteins, mammalian homologues of FZO, with distinct functions are both required for mitochondrial fusion J Biochem 2003 134 3 333 344 10.1093/jb/mvg150 14561718 Eura Y. Two mitofusin proteins, mammalian homologues of FZO, with distinct functions are both required for mitochondrial fusion. J Biochem. 2003;134(3):333–44. 14561718 10.1093/jb/mvg150 35. de Brito OM Scorrano L Mitofusin 2 tethers endoplasmic reticulum to mitochondria Nature 2008 456 7222 605 610 10.1038/nature07534 19052620 de Brito OM, Scorrano L. Mitofusin 2 tethers endoplasmic reticulum to mitochondria. Nature. 2008;456(7222):605–10. 19052620 10.1038/nature07534 36. Li D Structural and evolutionary characteristics of dynamin-related GTPase OPA1 PeerJ 2019 7 e7285 10.7717/peerj.7285 31328044 PMC6622160 Li D, et al. Structural and evolutionary characteristics of dynamin-related GTPase OPA1. PeerJ. 2019;7:e7285. 31328044 10.7717/peerj.7285 PMC6622160 37. Delettre C Mutation spectrum and splicing variants in the OPA1 gene Hum Genet 2001 109 6 584 591 10.1007/s00439-001-0633-y 11810270 Delettre C, et al. Mutation spectrum and splicing variants in the OPA1 gene. Hum Genet. 2001;109(6):584–91. 11810270 10.1007/s00439-001-0633-y 38. Song Z OPA1 processing controls mitochondrial fusion and is regulated by mRNA splicing, membrane potential, and Yme1L J Cell Biol 2007 178 5 749 755 10.1083/jcb.200704110 17709429 PMC2064540 Song Z, et al. OPA1 processing controls mitochondrial fusion and is regulated by mRNA splicing, membrane potential, and Yme1L. J Cell Biol. 2007;178(5):749–55. 17709429 10.1083/jcb.200704110 PMC2064540 39. Ban T Molecular basis of selective mitochondrial fusion by heterotypic action between OPA1 and cardiolipin Nat Cell Biol 2017 19 7 856 863 10.1038/ncb3560 28628083 Ban T, et al. Molecular basis of selective mitochondrial fusion by heterotypic action between OPA1 and cardiolipin. Nat Cell Biol. 2017;19(7):856–63. 28628083 10.1038/ncb3560 40. Zhang, D., et al. Cryo-EM structures of S-OPA1 reveal its interactions with membrane and changes upon nucleotide binding. Elife 2020;9. 10.7554/eLife.50294 PMC7156267 32228866 41. Ge, Y., et al. Two forms of Opa1 cooperate to complete fusion of the mitochondrial inner-membrane. Elife. 2020;9. 10.7554/eLife.50973 PMC7299343 31922487 42. Meeusen S McCaffery JM Nunnari J Mitochondrial fusion intermediates revealed in vitro Science 2004 305 5691 1747 1752 10.1126/science.1100612 15297626 Meeusen S, McCaffery JM, Nunnari J. Mitochondrial fusion intermediates revealed in vitro. Science. 2004;305(5691):1747–52. 15297626 10.1126/science.1100612 43. Koshiba T Structural basis of mitochondrial tethering by mitofusin complexes Science 2004 305 5685 858 862 10.1126/science.1099793 15297672 Koshiba T, et al. Structural basis of mitochondrial tethering by mitofusin complexes. Science. 2004;305(5685):858–62. 15297672 10.1126/science.1099793 44. Ban T Relationship between OPA1 and cardiolipin in mitochondrial inner-membrane fusion Biochim Biophys Acta Bioenerg 2018 1859 9 951 957 10.1016/j.bbabio.2018.05.016 29852142 Ban T, et al. Relationship between OPA1 and cardiolipin in mitochondrial inner-membrane fusion. Biochim Biophys Acta Bioenerg. 2018;1859(9):951–7. 29852142 10.1016/j.bbabio.2018.05.016 45. von der Malsburg A Structural mechanism of mitochondrial membrane remodelling by human OPA1 Nature 2023 620 7976 1101 1108 10.1038/s41586-023-06441-6 37612504 PMC10875962 von der Malsburg A, et al. Structural mechanism of mitochondrial membrane remodelling by human OPA1. Nature. 2023;620(7976):1101–8. 37612504 10.1038/s41586-023-06441-6 PMC10875962 46. Nyenhuis SB OPA1 helical structures give perspective to mitochondrial dysfunction Nature 2023 620 7976 1109 1116 10.1038/s41586-023-06462-1 37612506 PMC12410014 Nyenhuis SB, et al. OPA1 helical structures give perspective to mitochondrial dysfunction. Nature. 2023;620(7976):1109–16. 37612506 10.1038/s41586-023-06462-1 PMC12410014 47. Otsuga D The dynamin-related GTPase, Dnm1p, controls mitochondrial morphology in yeast J Cell Biol 1998 143 2 333 349 10.1083/jcb.143.2.333 9786946 PMC2132834 Otsuga D, et al. The dynamin-related GTPase, Dnm1p, controls mitochondrial morphology in yeast. J Cell Biol. 1998;143(2):333–49. 9786946 10.1083/jcb.143.2.333 PMC2132834 48. Tieu Q Nunnari J Mdv1p is a WD repeat protein that interacts with the dynamin-related GTPase, Dnm1p, to trigger mitochondrial division J Cell Biol 2000 151 2 353 366 10.1083/jcb.151.2.353 11038182 PMC2192646 Tieu Q, Nunnari J. Mdv1p is a WD repeat protein that interacts with the dynamin-related GTPase, Dnm1p, to trigger mitochondrial division. J Cell Biol. 2000;151(2):353–66. 11038182 10.1083/jcb.151.2.353 PMC2192646 49. Mozdy AD McCaffery JM Shaw JM Dnm1p GTPase-mediated mitochondrial fission is a multi-step process requiring the novel integral membrane component Fis1p J Cell Biol 2000 151 2 367 380 10.1083/jcb.151.2.367 11038183 PMC2192649 Mozdy AD, McCaffery JM, Shaw JM. Dnm1p GTPase-mediated mitochondrial fission is a multi-step process requiring the novel integral membrane component Fis1p. J Cell Biol. 2000;151(2):367–80. 11038183 10.1083/jcb.151.2.367 PMC2192649 50. Griffin EE Graumann J Chan DC The WD40 protein Caf4p is a component of the mitochondrial fission machinery and recruits Dnm1p to mitochondria J Cell Biol 2005 170 2 237 248 10.1083/jcb.200503148 16009724 PMC2171414 Griffin EE, Graumann J, Chan DC. The WD40 protein Caf4p is a component of the mitochondrial fission machinery and recruits Dnm1p to mitochondria. J Cell Biol. 2005;170(2):237–48. 16009724 10.1083/jcb.200503148 PMC2171414 51. Smirnova E Dynamin-related protein Drp1 is required for mitochondrial division in mammalian cells Mol Biol Cell 2001 12 8 2245 2256 10.1091/mbc.12.8.2245 11514614 PMC58592 Smirnova E, et al. Dynamin-related protein Drp1 is required for mitochondrial division in mammalian cells. Mol Biol Cell. 2001;12(8):2245–56. 11514614 10.1091/mbc.12.8.2245 PMC58592 52. Losón OC Fis1, Mff, MiD49, and MiD51 mediate Drp1 recruitment in mitochondrial fission Mol Biol Cell 2013 24 5 659 667 10.1091/mbc.e12-10-0721 23283981 PMC3583668 Losón OC, et al. Fis1, Mff, MiD49, and MiD51 mediate Drp1 recruitment in mitochondrial fission. Mol Biol Cell. 2013;24(5):659–67. 23283981 10.1091/mbc.E12-10-0721 PMC3583668 53. Koch A Dynamin-like protein 1 is involved in peroxisomal fission J Biol Chem 2003 278 10 8597 8605 10.1074/jbc.M211761200 12499366 Koch A, et al. Dynamin-like protein 1 is involved in peroxisomal fission. J Biol Chem. 2003;278(10):8597–605. 12499366 10.1074/jbc.M211761200 54. Shin HW Identification and subcellular localization of a novel mammalian dynamin-related protein homologous to yeast Vps1p and Dnm1p J Biochem 1997 122 3 525 530 10.1093/oxfordjournals.jbchem.a021784 9348079 Shin HW, et al. Identification and subcellular localization of a novel mammalian dynamin-related protein homologous to yeast Vps1p and Dnm1p. J Biochem. 1997;122(3):525–30. 9348079 10.1093/oxfordjournals.jbchem.a021784 55. Waterham HR A lethal defect of mitochondrial and peroxisomal fission N Engl J Med 2007 356 17 1736 1741 10.1056/NEJMoa064436 17460227 Waterham HR, et al. A lethal defect of mitochondrial and peroxisomal fission. N Engl J Med. 2007;356(17):1736–41. 17460227 10.1056/NEJMoa064436 56. Taguchi N Mitotic phosphorylation of dynamin-related GTPase Drp1 participates in mitochondrial fission J Biol Chem 2007 282 15 11521 11529 10.1074/jbc.M607279200 17301055 Taguchi N, et al. Mitotic phosphorylation of dynamin-related GTPase Drp1 participates in mitochondrial fission. J Biol Chem. 2007;282(15):11521–9. 17301055 10.1074/jbc.M607279200 57. Fröhlich C Structural insights into oligomerization and mitochondrial remodelling of dynamin 1-like protein EMBO J 2013 32 9 1280 1292 10.1038/emboj.2013.74 23584531 PMC3642683 Fröhlich C, et al. Structural insights into oligomerization and mitochondrial remodelling of dynamin 1-like protein. EMBO J. 2013;32(9):1280–92. 23584531 10.1038/emboj.2013.74 PMC3642683 58. Rochon K Structural basis for regulated assembly of the mitochondrial fission GTPase Drp1 Nat Commun 2024 15 1 1328 10.1038/s41467-024-45524-4 38351080 PMC10864337 Rochon K, et al. Structural basis for regulated assembly of the mitochondrial fission GTPase Drp1. Nat Commun. 2024;15(1):1328. 38351080 10.1038/s41467-024-45524-4 PMC10864337 59. Kwapiszewska K Determination of oligomerization state of Drp1 protein in living cells at nanomolar concentrations Sci Rep 2019 9 1 5906 10.1038/s41598-019-42418-0 30976093 PMC6459820 Kwapiszewska K, et al. Determination of oligomerization state of Drp1 protein in living cells at nanomolar concentrations. Sci Rep. 2019;9(1):5906. 30976093 10.1038/s41598-019-42418-0 PMC6459820 60. Macdonald PJ A dimeric equilibrium intermediate nucleates Drp1 reassembly on mitochondrial membranes for fission Mol Biol Cell 2014 25 12 1905 1915 10.1091/mbc.e14-02-0728 24790094 PMC4055269 Macdonald PJ, et al. A dimeric equilibrium intermediate nucleates Drp1 reassembly on mitochondrial membranes for fission. Mol Biol Cell. 2014;25(12):1905–15. 24790094 10.1091/mbc.E14-02-0728 PMC4055269 61. Yoon Y The mitochondrial protein hFis1 regulates mitochondrial fission in mammalian cells through an interaction with the dynamin-like protein DLP1 Mol Cell Biol 2003 23 15 5409 5420 10.1128/MCB.23.15.5409-5420.2003 12861026 PMC165727 Yoon Y, et al. The mitochondrial protein hFis1 regulates mitochondrial fission in mammalian cells through an interaction with the dynamin-like protein DLP1. Mol Cell Biol. 2003;23(15):5409–20. 12861026 10.1128/MCB.23.15.5409-5420.2003 PMC165727 62. Yu T Regulation of mitochondrial fission and apoptosis by the mitochondrial outer membrane protein hFis1 J Cell Sci 2005 118 Pt 18 4141 4151 10.1242/jcs.02537 16118244 Yu T, et al. Regulation of mitochondrial fission and apoptosis by the mitochondrial outer membrane protein hFis1. J Cell Sci. 2005;118(Pt 18):4141–51. 16118244 10.1242/jcs.02537 63. Otera H Mff is an essential factor for mitochondrial recruitment of Drp1 during mitochondrial fission in mammalian cells J Cell Biol 2010 191 6 1141 1158 10.1083/jcb.201007152 21149567 PMC3002033 Otera H, et al. Mff is an essential factor for mitochondrial recruitment of Drp1 during mitochondrial fission in mammalian cells. J Cell Biol. 2010;191(6):1141–58. 21149567 10.1083/jcb.201007152 PMC3002033 64. Koirala S Interchangeable adaptors regulate mitochondrial dynamin assembly for membrane scission Proc Natl Acad Sci U S A 2013 110 15 E1342 E1351 10.1073/pnas.1300855110 23530241 PMC3625255 Koirala S, et al. Interchangeable adaptors regulate mitochondrial dynamin assembly for membrane scission. Proc Natl Acad Sci U S A. 2013;110(15):E1342–51. 23530241 10.1073/pnas.1300855110 PMC3625255 65. Gandre-Babbe S van der Bliek AM The novel tail-anchored membrane protein Mff controls mitochondrial and peroxisomal fission in mammalian cells Mol Biol Cell 2008 19 6 2402 2412 10.1091/mbc.e07-12-1287 18353969 PMC2397315 Gandre-Babbe S, van der Bliek AM. The novel tail-anchored membrane protein Mff controls mitochondrial and peroxisomal fission in mammalian cells. Mol Biol Cell. 2008;19(6):2402–12. 18353969 10.1091/mbc.E07-12-1287 PMC2397315 66. Palmer CS MiD49 and MiD51, new components of the mitochondrial fission machinery EMBO Rep 2011 12 6 565 573 10.1038/embor.2011.54 21508961 PMC3128275 Palmer CS, et al. MiD49 and MiD51, new components of the mitochondrial fission machinery. EMBO Rep. 2011;12(6):565–73. 21508961 10.1038/embor.2011.54 PMC3128275 67. Palmer CS Adaptor proteins MiD49 and MiD51 can act independently of Mff and Fis1 in Drp1 recruitment and are specific for mitochondrial fission J Biol Chem 2013 288 38 27584 27593 10.1074/jbc.M113.479873 23921378 PMC3779755 Palmer CS, et al. Adaptor proteins MiD49 and MiD51 can act independently of Mff and Fis1 in Drp1 recruitment and are specific for mitochondrial fission. J Biol Chem. 2013;288(38):27584–93. 23921378 10.1074/jbc.M113.479873 PMC3779755 68. Zhao J Human MIEF1 recruits Drp1 to mitochondrial outer membranes and promotes mitochondrial fusion rather than fission EMBO J 2011 30 14 2762 2778 10.1038/emboj.2011.198 21701560 PMC3160255 Zhao J, et al. Human MIEF1 recruits Drp1 to mitochondrial outer membranes and promotes mitochondrial fusion rather than fission. EMBO J. 2011;30(14):2762–78. 21701560 10.1038/emboj.2011.198 PMC3160255 69. Frank S The role of dynamin-related protein 1, a mediator of mitochondrial fission, in apoptosis Dev Cell 2001 1 4 515 525 10.1016/S1534-5807(01)00055-7 11703942 Frank S, et al. The role of dynamin-related protein 1, a mediator of mitochondrial fission, in apoptosis. Dev Cell. 2001;1(4):515–25. 11703942 10.1016/s1534-5807(01)00055-7 70. Stepanyants N Cardiolipin's propensity for phase transition and its reorganization by dynamin-related protein 1 form a basis for mitochondrial membrane fission Mol Biol Cell 2015 26 17 3104 3116 10.1091/mbc.E15-06-0330 26157169 PMC4551322 Stepanyants N, et al. Cardiolipin’s propensity for phase transition and its reorganization by dynamin-related protein 1 form a basis for mitochondrial membrane fission. Mol Biol Cell. 2015;26(17):3104–16. 26157169 10.1091/mbc.E15-06-0330 PMC4551322 71. Bustillo-Zabalbeitia I Specific interaction with cardiolipin triggers functional activation of dynamin-related protein 1 PLoS ONE 2014 9 7 e102738 10.1371/journal.pone.0102738 25036098 PMC4103857 Bustillo-Zabalbeitia I, et al. Specific interaction with cardiolipin triggers functional activation of dynamin-related protein 1. PLoS ONE. 2014;9(7):e102738. 25036098 10.1371/journal.pone.0102738 PMC4103857 72. Mears JA Conformational changes in Dnm1 support a contractile mechanism for mitochondrial fission Nat Struct Mol Biol 2011 18 1 20 26 10.1038/nsmb.1949 21170049 PMC3059246 Mears JA, et al. Conformational changes in Dnm1 support a contractile mechanism for mitochondrial fission. Nat Struct Mol Biol. 2011;18(1):20–6. 21170049 10.1038/nsmb.1949 PMC3059246 73. Francy CA The mechanoenzymatic core of dynamin-related protein 1 comprises the minimal machinery required for membrane constriction J Biol Chem 2015 290 18 11692 11703 10.1074/jbc.M114.610881 25770210 PMC4416870 Francy CA, et al. The mechanoenzymatic core of dynamin-related protein 1 comprises the minimal machinery required for membrane constriction. J Biol Chem. 2015;290(18):11692–703. 25770210 10.1074/jbc.M114.610881 PMC4416870 74. Fonseca TB Mitochondrial fission requires DRP1 but not dynamins Nature 2019 570 7761 E34 e42 10.1038/s41586-019-1296-y 31217603 Fonseca TB, et al. Mitochondrial fission requires DRP1 but not dynamins. Nature. 2019;570(7761):E34-e42. 31217603 10.1038/s41586-019-1296-y 75. Ji WK Actin filaments target the oligomeric maturation of the dynamin GTPase Drp1 to mitochondrial fission sites Elife 2015 4 e11553 10.7554/eLife.11553 26609810 PMC4755738 Ji WK, et al. Actin filaments target the oligomeric maturation of the dynamin GTPase Drp1 to mitochondrial fission sites. Elife. 2015;4:e11553. 26609810 10.7554/eLife.11553 PMC4755738 76. Friedman JR ER tubules mark sites of mitochondrial division Science 2011 334 6054 358 362 10.1126/science.1207385 21885730 PMC3366560 Friedman JR, et al. ER tubules mark sites of mitochondrial division. Science. 2011;334(6054):358–62. 21885730 10.1126/science.1207385 PMC3366560 77. Hatch AL Actin filaments as dynamic reservoirs for Drp1 recruitment Mol Biol Cell 2016 27 20 3109 3121 10.1091/mbc.e16-03-0193 27559132 PMC5063618 Hatch AL, et al. Actin filaments as dynamic reservoirs for Drp1 recruitment. Mol Biol Cell. 2016;27(20):3109–21. 27559132 10.1091/mbc.E16-03-0193 PMC5063618 78. Han H PINK1 phosphorylates Drp 1(S616) to regulate mitophagy-independent mitochondrial dynamics EMBO Rep 2020 21 8 e48686 10.15252/embr.201948686 32484300 PMC7403662 Han H, et al. PINK1 phosphorylates Drp 1(S616) to regulate mitophagy-independent mitochondrial dynamics. EMBO Rep. 2020;21(8):e48686. 32484300 10.15252/embr.201948686 PMC7403662 79. Ashford TP Porter KR Cytoplasmic components in hepatic cell lysosomes J Cell Biol 1962 12 1 198 202 10.1083/jcb.12.1.198 13862833 PMC2106008 Ashford TP, Porter KR. Cytoplasmic components in hepatic cell lysosomes. J Cell Biol. 1962;12(1):198–202. 13862833 10.1083/jcb.12.1.198 PMC2106008 80. Feng Y The machinery of macroautophagy Cell Res 2014 24 1 24 41 10.1038/cr.2013.168 24366339 PMC3879710 Feng Y, et al. The machinery of macroautophagy. Cell Res. 2014;24(1):24–41. 24366339 10.1038/cr.2013.168 PMC3879710 81. Li WW Li J Bao JK Microautophagy: lesser-known self-eating Cell Mol Life Sci 2012 69 7 1125 1136 10.1007/s00018-011-0865-5 22080117 PMC11114512 Li WW, Li J, Bao JK. Microautophagy: lesser-known self-eating. Cell Mol Life Sci. 2012;69(7):1125–36. 22080117 10.1007/s00018-011-0865-5 PMC11114512 82. Cuervo AM Wong E Chaperone-mediated autophagy: roles in disease and aging Cell Res 2014 24 1 92 104 10.1038/cr.2013.153 24281265 PMC3879702 Cuervo AM, Wong E. Chaperone-mediated autophagy: roles in disease and aging. Cell Res. 2014;24(1):92–104. 24281265 10.1038/cr.2013.153 PMC3879702 83. Lemasters JJ Selective mitochondrial autophagy, or mitophagy, as a targeted defense against oxidative stress, mitochondrial dysfunction, and aging Rejuvenation Res 2005 8 1 3 5 10.1089/rej.2005.8.3 15798367 Lemasters JJ. Selective mitochondrial autophagy, or mitophagy, as a targeted defense against oxidative stress, mitochondrial dysfunction, and aging. Rejuvenation Res. 2005;8(1):3–5. 15798367 10.1089/rej.2005.8.3 84. Onishi M Molecular mechanisms and physiological functions of mitophagy EMBO J 2021 40 3 e104705 10.15252/embj.2020104705 33438778 PMC7849173 Onishi M, et al. Molecular mechanisms and physiological functions of mitophagy. EMBO J. 2021;40(3):e104705. 33438778 10.15252/embj.2020104705 PMC7849173 85. Priault M Impairing the bioenergetic status and the biogenesis of mitochondria triggers mitophagy in yeast Cell Death Differ 2005 12 12 1613 1621 10.1038/sj.cdd.4401697 15947785 Priault M, et al. Impairing the bioenergetic status and the biogenesis of mitochondria triggers mitophagy in yeast. Cell Death Differ. 2005;12(12):1613–21. 15947785 10.1038/sj.cdd.4401697 86. Okamoto K Kondo-Okamoto N Ohsumi Y Mitochondria-anchored receptor Atg32 mediates degradation of mitochondria via selective autophagy Dev Cell 2009 17 1 87 97 10.1016/j.devcel.2009.06.013 19619494 Okamoto K, Kondo-Okamoto N, Ohsumi Y. Mitochondria-anchored receptor Atg32 mediates degradation of mitochondria via selective autophagy. Dev Cell. 2009;17(1):87–97. 19619494 10.1016/j.devcel.2009.06.013 87. Kanki T Atg32 is a mitochondrial protein that confers selectivity during mitophagy Dev Cell 2009 17 1 98 109 10.1016/j.devcel.2009.06.014 19619495 PMC2746076 Kanki T, et al. Atg32 is a mitochondrial protein that confers selectivity during mitophagy. Dev Cell. 2009;17(1):98–109. 19619495 10.1016/j.devcel.2009.06.014 PMC2746076 88. Aoki Y Phosphorylation of serine 114 on Atg32 mediates mitophagy Mol Biol Cell 2011 22 17 3206 3217 10.1091/mbc.e11-02-0145 21757540 PMC3164466 Aoki Y, et al. Phosphorylation of serine 114 on Atg32 mediates mitophagy. Mol Biol Cell. 2011;22(17):3206–17. 21757540 10.1091/mbc.E11-02-0145 PMC3164466 89. Rasool S Mechanism of PINK1 activation by autophosphorylation and insights into assembly on the TOM complex Mol Cell 2022 82 1 44 59 10.1016/j.molcel.2021.11.012 34875213 Rasool S, et al. Mechanism of PINK1 activation by autophosphorylation and insights into assembly on the TOM complex. Mol Cell. 2022;82(1):44–59. 34875213 10.1016/j.molcel.2021.11.012 90. Greene AW Mitochondrial processing peptidase regulates PINK1 processing, import and Parkin recruitment EMBO Rep 2012 13 4 378 385 10.1038/embor.2012.14 22354088 PMC3321149 Greene AW, et al. Mitochondrial processing peptidase regulates PINK1 processing, import and Parkin recruitment. EMBO Rep. 2012;13(4):378–85. 22354088 10.1038/embor.2012.14 PMC3321149 91. Deas E PINK1 cleavage at position A103 by the mitochondrial protease PARL Hum Mol Genet 2011 20 5 867 879 10.1093/hmg/ddq526 21138942 PMC3033179 Deas E, et al. PINK1 cleavage at position A103 by the mitochondrial protease PARL. Hum Mol Genet. 2011;20(5):867–79. 21138942 10.1093/hmg/ddq526 PMC3033179 92. Jin SM Mitochondrial membrane potential regulates PINK1 import and proteolytic destabilization by PARL J Cell Biol 2010 191 5 933 942 10.1083/jcb.201008084 21115803 PMC2995166 Jin SM, et al. Mitochondrial membrane potential regulates PINK1 import and proteolytic destabilization by PARL. J Cell Biol. 2010;191(5):933–42. 21115803 10.1083/jcb.201008084 PMC2995166 93. Yamano K Youle RJ PINK1 is degraded through the N-end rule pathway Autophagy 2013 9 11 1758 1769 10.4161/auto.24633 24121706 PMC4028335 Yamano K, Youle RJ. PINK1 is degraded through the N-end rule pathway. Autophagy. 2013;9(11):1758–69. 24121706 10.4161/auto.24633 PMC4028335 94. Eldeeb MA Tom20 gates PINK1 activity and mediates its tethering of the TOM and TIM23 translocases upon mitochondrial stress Proc Natl Acad Sci U S A 2024 121 10 e2313540121 10.1073/pnas.2313540121 38416681 PMC10927582 Eldeeb MA, et al. Tom20 gates PINK1 activity and mediates its tethering of the TOM and TIM23 translocases upon mitochondrial stress. Proc Natl Acad Sci U S A. 2024;121(10):e2313540121. 38416681 10.1073/pnas.2313540121 PMC10927582 95. Akabane S TIM23 facilitates PINK1 activation by safeguarding against OMA1-mediated degradation in damaged mitochondria Cell Rep 2023 42 5 112454 10.1016/j.celrep.2023.112454 37160114 Akabane S, et al. TIM23 facilitates PINK1 activation by safeguarding against OMA1-mediated degradation in damaged mitochondria. Cell Rep. 2023;42(5):112454. 37160114 10.1016/j.celrep.2023.112454 96. Kondapalli C PINK1 is activated by mitochondrial membrane potential depolarization and stimulates Parkin E3 ligase activity by phosphorylating serine 65 Open Biol 2012 2 5 120080 10.1098/rsob.120080 22724072 PMC3376738 Kondapalli C, et al. PINK1 is activated by mitochondrial membrane potential depolarization and stimulates Parkin E3 ligase activity by phosphorylating serine 65. Open Biol. 2012;2(5):120080. 22724072 10.1098/rsob.120080 PMC3376738 97. Kane LA PINK1 phosphorylates ubiquitin to activate Parkin E3 ubiquitin ligase activity J Cell Biol 2014 205 2 143 153 10.1083/jcb.201402104 24751536 PMC4003245 Kane LA, et al. PINK1 phosphorylates ubiquitin to activate Parkin E3 ubiquitin ligase activity. J Cell Biol. 2014;205(2):143–53. 24751536 10.1083/jcb.201402104 PMC4003245 98. Ordureau A Defining roles of PARKIN and ubiquitin phosphorylation by PINK1 in mitochondrial quality control using a ubiquitin replacement strategy Proc Natl Acad Sci U S A 2015 112 21 6637 6642 10.1073/pnas.1506593112 25969509 PMC4450373 Ordureau A, et al. Defining roles of PARKIN and ubiquitin phosphorylation by PINK1 in mitochondrial quality control using a ubiquitin replacement strategy. Proc Natl Acad Sci U S A. 2015;112(21):6637–42. 25969509 10.1073/pnas.1506593112 PMC4450373 99. Wauer T Mechanism of phospho-ubiquitin-induced PARKIN activation Nature 2015 524 7565 370 374 10.1038/nature14879 26161729 PMC4984986 Wauer T, et al. Mechanism of phospho-ubiquitin-induced PARKIN activation. Nature. 2015;524(7565):370–4. 26161729 10.1038/nature14879 PMC4984986 100. Kazlauskaite A Binding to serine 65-phosphorylated ubiquitin primes Parkin for optimal PINK1-dependent phosphorylation and activation EMBO Rep 2015 16 8 939 954 10.15252/embr.201540352 26116755 PMC4552487 Kazlauskaite A, et al. Binding to serine 65-phosphorylated ubiquitin primes Parkin for optimal PINK1-dependent phosphorylation and activation. EMBO Rep. 2015;16(8):939–54. 26116755 10.15252/embr.201540352 PMC4552487 101. Kumar A Disruption of the autoinhibited state primes the E3 ligase parkin for activation and catalysis EMBO J 2015 34 20 2506 2521 10.15252/embj.201592337 26254304 PMC4609183 Kumar A, et al. Disruption of the autoinhibited state primes the E3 ligase parkin for activation and catalysis. EMBO J. 2015;34(20):2506–21. 26254304 10.15252/embj.201592337 PMC4609183 102. Sauvé V A Ubl/ubiquitin switch in the activation of Parkin EMBO J 2015 34 20 2492 2505 10.15252/embj.201592237 26254305 PMC4609182 Sauvé V, et al. A Ubl/ubiquitin switch in the activation of Parkin. EMBO J. 2015;34(20):2492–505. 26254305 10.15252/embj.201592237 PMC4609182 103. Yamano K Site-specific interaction mapping of phosphorylated ubiquitin to uncover Parkin activation J Biol Chem 2015 290 42 25199 25211 10.1074/jbc.M115.671446 26260794 PMC4646171 Yamano K, et al. Site-specific interaction mapping of phosphorylated ubiquitin to uncover Parkin activation. J Biol Chem. 2015;290(42):25199–211. 26260794 10.1074/jbc.M115.671446 PMC4646171 104. Gladkova C Mechanism of parkin activation by PINK1 Nature 2018 559 7714 410 414 10.1038/s41586-018-0224-x 29995846 PMC6071873 Gladkova C, et al. Mechanism of parkin activation by PINK1. Nature. 2018;559(7714):410–4. 29995846 10.1038/s41586-018-0224-x PMC6071873 105. Sauvé V Mechanism of parkin activation by phosphorylation Nat Struct Mol Biol 2018 25 7 623 630 10.1038/s41594-018-0088-7 29967542 Sauvé V, et al. Mechanism of parkin activation by phosphorylation. Nat Struct Mol Biol. 2018;25(7):623–30. 29967542 10.1038/s41594-018-0088-7 106. Tanaka A Proteasome and p97 mediate mitophagy and degradation of mitofusins induced by Parkin J Cell Biol 2010 191 7 1367 1380 10.1083/jcb.201007013 21173115 PMC3010068 Tanaka A, et al. Proteasome and p97 mediate mitophagy and degradation of mitofusins induced by Parkin. J Cell Biol. 2010;191(7):1367–80. 21173115 10.1083/jcb.201007013 PMC3010068 107. Birsa N Lysine 27 ubiquitination of the mitochondrial transport protein Miro is dependent on serine 65 of the Parkin ubiquitin ligase J Biol Chem 2014 289 21 14569 14582 10.1074/jbc.M114.563031 24671417 PMC4031514 Birsa N, et al. Lysine 27 ubiquitination of the mitochondrial transport protein Miro is dependent on serine 65 of the Parkin ubiquitin ligase. J Biol Chem. 2014;289(21):14569–82. 24671417 10.1074/jbc.M114.563031 PMC4031514 108. Geisler S PINK1/Parkin-mediated mitophagy is dependent on VDAC1 and p62/SQSTM1 Nat Cell Biol 2010 12 2 119 131 10.1038/ncb2012 20098416 Geisler S, et al. PINK1/Parkin-mediated mitophagy is dependent on VDAC1 and p62/SQSTM1. Nat Cell Biol. 2010;12(2):119–31. 20098416 10.1038/ncb2012 109. Harper JW Ordureau A Heo JM Building and decoding ubiquitin chains for mitophagy Nat Rev Mol Cell Biol 2018 19 2 93 108 10.1038/nrm.2017.129 29358684 Harper JW, Ordureau A, Heo JM. Building and decoding ubiquitin chains for mitophagy. Nat Rev Mol Cell Biol. 2018;19(2):93–108. 29358684 10.1038/nrm.2017.129 110. Matsumoto G Serine 403 phosphorylation of p62/SQSTM1 regulates selective autophagic clearance of ubiquitinated proteins Mol Cell 2011 44 2 279 289 10.1016/j.molcel.2011.07.039 22017874 Matsumoto G, et al. Serine 403 phosphorylation of p62/SQSTM1 regulates selective autophagic clearance of ubiquitinated proteins. Mol Cell. 2011;44(2):279–89. 22017874 10.1016/j.molcel.2011.07.039 111. Kirkin V A role for NBR1 in autophagosomal degradation of ubiquitinated substrates Mol Cell 2009 33 4 505 516 10.1016/j.molcel.2009.01.020 19250911 Kirkin V, et al. A role for NBR1 in autophagosomal degradation of ubiquitinated substrates. Mol Cell. 2009;33(4):505–16. 19250911 10.1016/j.molcel.2009.01.020 112. Thurston TL The TBK1 adaptor and autophagy receptor NDP52 restricts the proliferation of ubiquitin-coated bacteria Nat Immunol 2009 10 11 1215 1221 10.1038/ni.1800 19820708 Thurston TL, et al. The TBK1 adaptor and autophagy receptor NDP52 restricts the proliferation of ubiquitin-coated bacteria. Nat Immunol. 2009;10(11):1215–21. 19820708 10.1038/ni.1800 113. Turco E Reconstitution defines the roles of p62, NBR1 and TAX1BP1 in ubiquitin condensate formation and autophagy initiation Nat Commun 2021 12 1 5212 10.1038/s41467-021-25572-w 34471133 PMC8410870 Turco E, et al. Reconstitution defines the roles of p62, NBR1 and TAX1BP1 in ubiquitin condensate formation and autophagy initiation. Nat Commun. 2021;12(1):5212. 34471133 10.1038/s41467-021-25572-w PMC8410870 114. Wong YC Holzbaur EL Temporal dynamics of PARK2/parkin and OPTN/optineurin recruitment during the mitophagy of damaged mitochondria Autophagy 2015 11 2 422 424 10.1080/15548627.2015.1009792 25801386 PMC4502688 Wong YC, Holzbaur EL. Temporal dynamics of PARK2/parkin and OPTN/optineurin recruitment during the mitophagy of damaged mitochondria. Autophagy. 2015;11(2):422–4. 25801386 10.1080/15548627.2015.1009792 PMC4502688 115. Narendra D p62/SQSTM1 is required for Parkin-induced mitochondrial clustering but not mitophagy; VDAC1 is dispensable for both Autophagy 2010 6 8 1090 1106 10.4161/auto.6.8.13426 20890124 PMC3359490 Narendra D, et al. p62/SQSTM1 is required for Parkin-induced mitochondrial clustering but not mitophagy; VDAC1 is dispensable for both. Autophagy. 2010;6(8):1090–106. 20890124 10.4161/auto.6.8.13426 PMC3359490 116. Kirkin V NBR1 cooperates with p62 in selective autophagy of ubiquitinated targets Autophagy 2009 5 5 732 733 10.4161/auto.5.5.8566 19398892 Kirkin V, et al. NBR1 cooperates with p62 in selective autophagy of ubiquitinated targets. Autophagy. 2009;5(5):732–3. 19398892 10.4161/auto.5.5.8566 117. Morriswood B T6BP and NDP52 are myosin VI binding partners with potential roles in cytokine signalling and cell adhesion J Cell Sci 2007 120 Pt 15 2574 2585 10.1242/jcs.007005 17635994 PMC2621013 Morriswood B, et al. T6BP and NDP52 are myosin VI binding partners with potential roles in cytokine signalling and cell adhesion. J Cell Sci. 2007;120(Pt 15):2574–85. 17635994 10.1242/jcs.007005 PMC2621013 118. von Muhlinen N Lc3c, bound selectively by a noncanonical LIR motif in NDP52, is required for antibacterial autophagy Mol Cell 2012 48 3 329 342 10.1016/j.molcel.2012.08.024 23022382 PMC3510444 von Muhlinen N, et al. Lc3c, bound selectively by a noncanonical LIR motif in NDP52, is required for antibacterial autophagy. Mol Cell. 2012;48(3):329–42. 23022382 10.1016/j.molcel.2012.08.024 PMC3510444 119. Yamano K Kojima W Molecular functions of autophagy adaptors upon ubiquitin-driven mitophagy Biochim Biophys Acta Gen Subj 2021 1865 10 129972 10.1016/j.bbagen.2021.129972 34332032 Yamano K, Kojima W. Molecular functions of autophagy adaptors upon ubiquitin-driven mitophagy. Biochim Biophys Acta Gen Subj. 2021;1865(10):129972. 34332032 10.1016/j.bbagen.2021.129972 120. Richter B Phosphorylation of OPTN by TBK1 enhances its binding to Ub chains and promotes selective autophagy of damaged mitochondria Proc Natl Acad Sci U S A 2016 113 15 4039 4044 10.1073/pnas.1523926113 27035970 PMC4839414 Richter B, et al. Phosphorylation of OPTN by TBK1 enhances its binding to Ub chains and promotes selective autophagy of damaged mitochondria. Proc Natl Acad Sci U S A. 2016;113(15):4039–44. 27035970 10.1073/pnas.1523926113 PMC4839414 121. Yamano K Critical role of mitochondrial ubiquitination and the OPTN-ATG9A axis in mitophagy J Cell Biol 2020 10.1083/jcb.201912144 32556086 PMC7480101 Yamano K, et al. Critical role of mitochondrial ubiquitination and the OPTN-ATG9A axis in mitophagy. J Cell Biol. 2020. 10.1083/jcb.201912144. 32556086 10.1083/jcb.201912144 PMC7480101 122. Padman BS LC3/GABARAPs drive ubiquitin-independent recruitment of optineurin and NDP52 to amplify mitophagy Nat Commun 2019 10 1 408 10.1038/s41467-019-08335-6 30679426 PMC6345886 Padman BS, et al. LC3/GABARAPs drive ubiquitin-independent recruitment of optineurin and NDP52 to amplify mitophagy. Nat Commun. 2019;10(1):408. 30679426 10.1038/s41467-019-08335-6 PMC6345886 123. Chen G The E1B 19K/Bcl-2-binding protein Nip3 is a dimeric mitochondrial protein that activates apoptosis J Exp Med 1997 186 12 1975 1983 10.1084/jem.186.12.1975 9396766 PMC2199165 Chen G, et al. The E1B 19K/Bcl-2-binding protein Nip3 is a dimeric mitochondrial protein that activates apoptosis. J Exp Med. 1997;186(12):1975–83. 9396766 10.1084/jem.186.12.1975 PMC2199165 124. Yasuda M Adenovirus E1B–19K/BCL-2 interacting protein BNIP3 contains a BH3 domain and a mitochondrial targeting sequence J Biol Chem 1998 273 20 12415 12421 10.1074/jbc.273.20.12415 9575197 Yasuda M, et al. Adenovirus E1B–19K/BCL-2 interacting protein BNIP3 contains a BH3 domain and a mitochondrial targeting sequence. J Biol Chem. 1998;273(20):12415–21. 9575197 10.1074/jbc.273.20.12415 125. Hanna RA Microtubule-associated protein 1 light chain 3 (LC3) interacts with Bnip3 protein to selectively remove endoplasmic reticulum and mitochondria via autophagy J Biol Chem 2012 287 23 19094 19104 10.1074/jbc.M111.322933 22505714 PMC3365942 Hanna RA, et al. Microtubule-associated protein 1 light chain 3 (LC3) interacts with Bnip3 protein to selectively remove endoplasmic reticulum and mitochondria via autophagy. J Biol Chem. 2012;287(23):19094–104. 22505714 10.1074/jbc.M111.322933 PMC3365942 126. Zhu Y Modulation of serines 17 and 24 in the LC3-interacting region of Bnip3 determines pro-survival mitophagy versus apoptosis J Biol Chem 2013 288 2 1099 1113 10.1074/jbc.M112.399345 23209295 PMC3542995 Zhu Y, et al. Modulation of serines 17 and 24 in the LC3-interacting region of Bnip3 determines pro-survival mitophagy versus apoptosis. J Biol Chem. 2013;288(2):1099–113. 23209295 10.1074/jbc.M112.399345 PMC3542995 127. Chen G Nix and Nip3 form a subfamily of pro-apoptotic mitochondrial proteins J Biol Chem 1999 274 1 7 10 10.1074/jbc.274.1.7 9867803 Chen G, et al. Nix and Nip3 form a subfamily of pro-apoptotic mitochondrial proteins. J Biol Chem. 1999;274(1):7–10. 9867803 10.1074/jbc.274.1.7 128. Schweers RL NIX is required for programmed mitochondrial clearance during reticulocyte maturation Proc Natl Acad Sci U S A 2007 104 49 19500 19505 10.1073/pnas.0708818104 18048346 PMC2148318 Schweers RL, et al. NIX is required for programmed mitochondrial clearance during reticulocyte maturation. Proc Natl Acad Sci U S A. 2007;104(49):19500–5. 18048346 10.1073/pnas.0708818104 PMC2148318 129. Sandoval H Essential role for Nix in autophagic maturation of erythroid cells Nature 2008 454 7201 232 235 10.1038/nature07006 18454133 PMC2570948 Sandoval H, et al. Essential role for Nix in autophagic maturation of erythroid cells. Nature. 2008;454(7201):232–5. 18454133 10.1038/nature07006 PMC2570948 130. Novak I Nix is a selective autophagy receptor for mitochondrial clearance EMBO Rep 2010 11 1 45 51 10.1038/embor.2009.256 20010802 PMC2816619 Novak I, et al. Nix is a selective autophagy receptor for mitochondrial clearance. EMBO Rep. 2010;11(1):45–51. 20010802 10.1038/embor.2009.256 PMC2816619 131. Rogov VV Phosphorylation of the mitochondrial autophagy receptor Nix enhances its interaction with LC3 proteins Sci Rep 2017 7 1 1131 10.1038/s41598-017-01258-6 28442745 PMC5430633 Rogov VV, et al. Phosphorylation of the mitochondrial autophagy receptor Nix enhances its interaction with LC3 proteins. Sci Rep. 2017;7(1):1131. 28442745 10.1038/s41598-017-01258-6 PMC5430633 132. Marinković M Šprung M Novak I Dimerization of mitophagy receptor BNIP3L/NIX is essential for recruitment of autophagic machinery Autophagy 2021 17 5 1232 1243 10.1080/15548627.2020.1755120 32286918 PMC8143235 Marinković M, Šprung M, Novak I. Dimerization of mitophagy receptor BNIP3L/NIX is essential for recruitment of autophagic machinery. Autophagy. 2021;17(5):1232–43. 32286918 10.1080/15548627.2020.1755120 PMC8143235 133. Bunker EN Nix interacts with WIPI2 to induce mitophagy EMBO J 2023 42 22 e113491 10.15252/embj.2023113491 37621214 PMC10646555 Bunker EN, et al. Nix interacts with WIPI2 to induce mitophagy. EMBO J. 2023;42(22):e113491. 37621214 10.15252/embj.2023113491 PMC10646555 134. Liu L Mitochondrial outer-membrane protein FUNDC1 mediates hypoxia-induced mitophagy in mammalian cells Nat Cell Biol 2012 14 2 177 185 10.1038/ncb2422 22267086 Liu L, et al. Mitochondrial outer-membrane protein FUNDC1 mediates hypoxia-induced mitophagy in mammalian cells. Nat Cell Biol. 2012;14(2):177–85. 22267086 10.1038/ncb2422 135. Chen G A regulatory signaling loop comprising the PGAM5 phosphatase and CK2 controls receptor-mediated mitophagy Mol Cell 2014 54 3 362 377 10.1016/j.molcel.2014.02.034 24746696 Chen G, et al. A regulatory signaling loop comprising the PGAM5 phosphatase and CK2 controls receptor-mediated mitophagy. Mol Cell. 2014;54(3):362–77. 24746696 10.1016/j.molcel.2014.02.034 136. Decker CW Mitofusin-2 mediates doxorubicin sensitivity and acute resistance in Jurkat leukemia cells Biochem Biophys Rep 2020 24 100824 33204855 10.1016/j.bbrep.2020.100824 PMC7648112 Decker CW, et al. Mitofusin-2 mediates doxorubicin sensitivity and acute resistance in Jurkat leukemia cells. Biochem Biophys Rep. 2020;24:100824. 33204855 10.1016/j.bbrep.2020.100824 PMC7648112 137. Casinelli G N-myc overexpression increases cisplatin resistance in neuroblastoma via deregulation of mitochondrial dynamics Cell Death Discov 2016 2 16082 10.1038/cddiscovery.2016.82 28028439 PMC5149579 Casinelli G, et al. N-myc overexpression increases cisplatin resistance in neuroblastoma via deregulation of mitochondrial dynamics. Cell Death Discov. 2016;2:16082. 28028439 10.1038/cddiscovery.2016.82 PMC5149579 138. Chen Y Shenmai injection enhances cisplatin-induced apoptosis through regulation of Mfn2-dependent mitochondrial dynamics in lung adenocarcinoma A549/DDP cells Cancer Drug Resist 2021 4 4 1047 1060 35582383 10.20517/cdr.2021.94 PMC8992451 Chen Y, et al. Shenmai injection enhances cisplatin-induced apoptosis through regulation of Mfn2-dependent mitochondrial dynamics in lung adenocarcinoma A549/DDP cells. Cancer Drug Resist. 2021;4(4):1047–60. 35582383 10.20517/cdr.2021.94 PMC8992451 139. Wang, W.J., et al. MCL1 participates in leptin-promoted mitochondrial fusion and contributes to drug resistance in gallbladder cancer. JCI Insight, 2021;6(15). 10.1172/jci.insight.135438 PMC8410075 34156978 140. Noguchi M Inhibition of the mitochondria-shaping protein Opa1 restores sensitivity to Gefitinib in a lung adenocarcinomaresistant cell line Cell Death Dis 2023 14 4 241 10.1038/s41419-023-05768-2 37019897 PMC10076284 Noguchi M, et al. Inhibition of the mitochondria-shaping protein Opa1 restores sensitivity to Gefitinib in a lung adenocarcinomaresistant cell line. Cell Death Dis. 2023;14(4):241. 37019897 10.1038/s41419-023-05768-2 PMC10076284 141. Yu CX p32/OPA1 axis-mediated mitochondrial dynamics contributes to cisplatin resistance in non-small cell lung cancer Acta Biochim Biophys Sin 2024 56 1 34 43 38151998 10.3724/abbs.2023247 PMC10875347 Yu CX, et al. p32/OPA1 axis-mediated mitochondrial dynamics contributes to cisplatin resistance in non-small cell lung cancer. Acta Biochim Biophys Sin. 2024;56(1):34–43. 38151998 10.3724/abbs.2023247 PMC10875347 142. Song Y Inhibition of MFN1 restores tamoxifen-induced apoptosis in resistant cells by disrupting aberrant mitochondrial fusion dynamics Cancer Lett 2024 590 216847 10.1016/j.canlet.2024.216847 38583647 Song Y, et al. Inhibition of MFN1 restores tamoxifen-induced apoptosis in resistant cells by disrupting aberrant mitochondrial fusion dynamics. Cancer Lett. 2024;590:216847. 38583647 10.1016/j.canlet.2024.216847 143. Zou GP Mitochondrial dynamics mediated by DRP1 and MFN2 contributes to cisplatin chemoresistance in human ovarian cancer SKOV3 cells J Cancer 2021 12 24 7358 7373 10.7150/jca.61379 35003356 PMC8734405 Zou GP, et al. Mitochondrial dynamics mediated by DRP1 and MFN2 contributes to cisplatin chemoresistance in human ovarian cancer SKOV3 cells. J Cancer. 2021;12(24):7358–73. 35003356 10.7150/jca.61379 PMC8734405 144. Tian, B., et al. Osteosarcoma stem cells resist chemotherapy by maintaining mitochondrial dynamic stability via DRP1. Int J Mol Med. 2025;55(1). 10.3892/ijmm.2024.5451 PMC11554380 39513621 145. Hou D Interleukin-6 facilitates acute myeloid leukemia chemoresistance via mitofusin 1-mediated mitochondrial fusion Mol Cancer Res 2023 21 12 1366 1378 10.1158/1541-7786.MCR-23-0382 37698549 Hou D, et al. Interleukin-6 facilitates acute myeloid leukemia chemoresistance via mitofusin 1-mediated mitochondrial fusion. Mol Cancer Res. 2023;21(12):1366–78. 37698549 10.1158/1541-7786.MCR-23-0382 146. Luo L VDAC1 as a target in cisplatin anti-tumor activity through promoting mitochondria fusion Biochem Biophys Res Commun 2021 560 52 58 10.1016/j.bbrc.2021.04.104 33971568 Luo L, et al. VDAC1 as a target in cisplatin anti-tumor activity through promoting mitochondria fusion. Biochem Biophys Res Commun. 2021;560:52–8. 33971568 10.1016/j.bbrc.2021.04.104 147. Mubthasima PP Singh SA Kannan A Sesamol-mediated targeting of EPHA2 sensitises cervical cancer for cisplatin treatment by regulating mitochondrial dynamics, autophagy, and mitophagy Mol Biol Rep 2024 51 1 949 10.1007/s11033-024-09875-x 39222165 Mubthasima PP, Singh SA, Kannan A. Sesamol-mediated targeting of EPHA2 sensitises cervical cancer for cisplatin treatment by regulating mitochondrial dynamics, autophagy, and mitophagy. Mol Biol Rep. 2024;51(1):949. 39222165 10.1007/s11033-024-09875-x 148. Bollu LR Involvement of de novo synthesized palmitate and mitochondrial EGFR in EGF induced mitochondrial fusion of cancer cells Cell Cycle 2014 13 15 2415 2430 10.4161/cc.29338 25483192 PMC4128886 Bollu LR, et al. Involvement of de novo synthesized palmitate and mitochondrial EGFR in EGF induced mitochondrial fusion of cancer cells. Cell Cycle. 2014;13(15):2415–30. 25483192 10.4161/cc.29338 PMC4128886 149. Chen X Targeting mitochondrial structure sensitizes acute myeloid leukemia to venetoclax treatment Cancer Discov 2019 9 7 890 909 10.1158/2159-8290.CD-19-0117 31048321 PMC6606342 Chen X, et al. Targeting mitochondrial structure sensitizes acute myeloid leukemia to venetoclax treatment. Cancer Discov. 2019;9(7):890–909. 31048321 10.1158/2159-8290.CD-19-0117 PMC6606342 150. Fang HY Overexpression of optic atrophy 1 protein increases cisplatin resistance via inactivation of caspase-dependent apoptosis in lung adenocarcinoma cells Hum Pathol 2012 43 1 105 114 10.1016/j.humpath.2011.04.012 21798574 Fang HY, et al. Overexpression of optic atrophy 1 protein increases cisplatin resistance via inactivation of caspase-dependent apoptosis in lung adenocarcinoma cells. Hum Pathol. 2012;43(1):105–14. 21798574 10.1016/j.humpath.2011.04.012 151. Tomková V Mitochondrial fragmentation, elevated mitochondrial superoxide and respiratory supercomplexes disassembly is connected with the tamoxifen-resistant phenotype of breast cancer cells Free Radic Biol Med 2019 143 510 521 10.1016/j.freeradbiomed.2019.09.004 31494243 Tomková V, et al. Mitochondrial fragmentation, elevated mitochondrial superoxide and respiratory supercomplexes disassembly is connected with the tamoxifen-resistant phenotype of breast cancer cells. Free Radic Biol Med. 2019;143:510–21. 31494243 10.1016/j.freeradbiomed.2019.09.004 152. Xie L Drp1-dependent remodeling of mitochondrial morphology triggered by EBV-LMP1 increases cisplatin resistance Signal Transduct Target Ther 2020 5 1 56 10.1038/s41392-020-0151-9 32433544 PMC7237430 Xie L, et al. Drp1-dependent remodeling of mitochondrial morphology triggered by EBV-LMP1 increases cisplatin resistance. Signal Transduct Target Ther. 2020;5(1):56. 32433544 10.1038/s41392-020-0151-9 PMC7237430 153. Prasad P Ghosh S Roy SS Glutamine deficiency promotes stemness and chemoresistance in tumor cells through DRP1-induced mitochondrial fragmentation Cell Mol Life Sci 2021 78 10 4821 4845 10.1007/s00018-021-03818-6 33895866 PMC11073067 Prasad P, Ghosh S, Roy SS. Glutamine deficiency promotes stemness and chemoresistance in tumor cells through DRP1-induced mitochondrial fragmentation. Cell Mol Life Sci. 2021;78(10):4821–45. 33895866 10.1007/s00018-021-03818-6 PMC11073067 154. Li X Mitochondrial fission factor promotes cisplatin resistancein hepatocellular carcinoma Acta Biochim Biophys Sin 2022 54 3 301 310 10.3724/abbs.2022007 35538029 PMC9828151 Li X, et al. Mitochondrial fission factor promotes cisplatin resistancein hepatocellular carcinoma. Acta Biochim Biophys Sin. 2022;54(3):301–10. 35538029 10.3724/abbs.2022007 PMC9828151 155. Luan T Microrna-98 promotes drug resistance and regulates mitochondrial dynamics by targeting LASS2 in bladder cancer cells Exp Cell Res 2018 373 1–2 188 197 10.1016/j.yexcr.2018.10.013 30463687 Luan T, et al. Microrna-98 promotes drug resistance and regulates mitochondrial dynamics by targeting LASS2 in bladder cancer cells. Exp Cell Res. 2018;373(1–2):188–97. 30463687 10.1016/j.yexcr.2018.10.013 156. Han Y Mitochondrial fission causes cisplatin resistance under hypoxic conditions via ROS in ovarian cancer cells Oncogene 2019 38 45 7089 7105 10.1038/s41388-019-0949-5 31409904 Han Y, et al. Mitochondrial fission causes cisplatin resistance under hypoxic conditions via ROS in ovarian cancer cells. Oncogene. 2019;38(45):7089–105. 31409904 10.1038/s41388-019-0949-5 157. Hagenbuchner J BIRC5/Survivin enhances aerobic glycolysis and drug resistance by altered regulation of the mitochondrial fusion/fission machinery Oncogene 2013 32 40 4748 4757 10.1038/onc.2012.500 23146905 Hagenbuchner J, et al. BIRC5/Survivin enhances aerobic glycolysis and drug resistance by altered regulation of the mitochondrial fusion/fission machinery. Oncogene. 2013;32(40):4748–57. 23146905 10.1038/onc.2012.500 158. Pan X Chen G Hu W Piperlongumine increases the sensitivity of bladder cancer to cisplatin by mitochondrial ROS J Clin Lab Anal 2022 36 6 e24452 10.1002/jcla.24452 35466450 PMC9169161 Pan X, Chen G, Hu W. Piperlongumine increases the sensitivity of bladder cancer to cisplatin by mitochondrial ROS. J Clin Lab Anal. 2022;36(6):e24452. 35466450 10.1002/jcla.24452 PMC9169161 159. Chauhan SS PIM kinases alter mitochondrial dynamics and chemosensitivity in lung cancer Oncogene 2020 39 12 2597 2611 10.1038/s41388-020-1168-9 31992853 PMC7545584 Chauhan SS, et al. PIM kinases alter mitochondrial dynamics and chemosensitivity in lung cancer. Oncogene. 2020;39(12):2597–611. 31992853 10.1038/s41388-020-1168-9 PMC7545584 160. Kong B Prohibitin 1 interacts with p53 in the regulation of mitochondrial dynamics and chemoresistance in gynecologic cancers J Ovarian Res 2022 15 1 70 10.1186/s13048-022-00999-x 35668443 PMC9172162 Kong B, et al. Prohibitin 1 interacts with p53 in the regulation of mitochondrial dynamics and chemoresistance in gynecologic cancers. J Ovarian Res. 2022;15(1):70. 35668443 10.1186/s13048-022-00999-x PMC9172162 161. Hou L ABT737 enhances ovarian cancer cells sensitivity to cisplatin through regulation of mitochondrial fission via Sirt3 activation Life Sci 2019 232 116561 10.1016/j.lfs.2019.116561 31247208 Hou L, et al. ABT737 enhances ovarian cancer cells sensitivity to cisplatin through regulation of mitochondrial fission via Sirt3 activation. Life Sci. 2019;232:116561. 31247208 10.1016/j.lfs.2019.116561 162. Yu Y ABT737 induces mitochondrial pathway apoptosis and mitophagy by regulating DRP1-dependent mitochondrial fission in human ovarian cancer cells Biomed Pharmacother 2017 96 22 29 10.1016/j.biopha.2017.09.111 28963947 Yu Y, et al. ABT737 induces mitochondrial pathway apoptosis and mitophagy by regulating DRP1-dependent mitochondrial fission in human ovarian cancer cells. Biomed Pharmacother. 2017;96:22–9. 28963947 10.1016/j.biopha.2017.09.111 163. Wu B Luteolin enhances TRAIL sensitivity in non-small cell lung cancer cells through increasing DR5 expression and Drp1-mediated mitochondrial fission Arch Biochem Biophys 2020 692 108539 10.1016/j.abb.2020.108539 32777260 Wu B, et al. Luteolin enhances TRAIL sensitivity in non-small cell lung cancer cells through increasing DR5 expression and Drp1-mediated mitochondrial fission. Arch Biochem Biophys. 2020;692:108539. 32777260 10.1016/j.abb.2020.108539 164. Li S CerS6 regulates cisplatin resistance in oral squamous cell carcinoma by altering mitochondrial fission and autophagy J Cell Physiol 2018 233 12 9416 9425 10.1002/jcp.26815 30054909 Li S, et al. CerS6 regulates cisplatin resistance in oral squamous cell carcinoma by altering mitochondrial fission and autophagy. J Cell Physiol. 2018;233(12):9416–25. 30054909 10.1002/jcp.26815 165. Woo SM Min KJ Kwon TK Inhibition of Drp1 sensitizes cancer cells to Cisplatin-induced apoptosis through transcriptional inhibition of c-FLIP expression Molecules 2020 10.3390/molecules25245793 33302576 PMC7764428 Woo SM, Min KJ, Kwon TK. Inhibition of Drp1 sensitizes cancer cells to Cisplatin-induced apoptosis through transcriptional inhibition of c-FLIP expression. Molecules. 2020. 10.3390/molecules25245793. 33302576 10.3390/molecules25245793 PMC7764428 166. Jiang HY Ubiquitylation of cyclin C by HACE1 regulates cisplatin-associated sensitivity in gastric cancer Clin Transl Med 2022 12 3 e770 10.1002/ctm2.770 35343092 PMC8958351 Jiang HY, et al. Ubiquitylation of cyclin C by HACE1 regulates cisplatin-associated sensitivity in gastric cancer. Clin Transl Med. 2022;12(3):e770. 35343092 10.1002/ctm2.770 PMC8958351 167. Romani P Mitochondrial fission links ECM mechanotransduction to metabolic redox homeostasis and metastatic chemotherapy resistance Nat Cell Biol 2022 24 2 168 180 10.1038/s41556-022-00843-w 35165418 PMC7615745 Romani P, et al. Mitochondrial fission links ECM mechanotransduction to metabolic redox homeostasis and metastatic chemotherapy resistance. Nat Cell Biol. 2022;24(2):168–80. 35165418 10.1038/s41556-022-00843-w PMC7615745 168. Cai J ERK/Drp1-dependent mitochondrial fission is involved in the MSC-induced drug resistance of T-cell acute lymphoblastic leukemia cells Cell Death Dis 2016 7 11 e2459 10.1038/cddis.2016.370 27831567 PMC5260898 Cai J, et al. ERK/Drp1-dependent mitochondrial fission is involved in the MSC-induced drug resistance of T-cell acute lymphoblastic leukemia cells. Cell Death Dis. 2016;7(11):e2459. 27831567 10.1038/cddis.2016.370 PMC5260898 169. Huang CY HMGB1 promotes ERK-mediated mitochondrial Drp1 phosphorylation for chemoresistance through RAGE in colorectal cancer Cell Death Dis 2018 9 10 1004 10.1038/s41419-018-1019-6 30258050 PMC6158296 Huang CY, et al. HMGB1 promotes ERK-mediated mitochondrial Drp1 phosphorylation for chemoresistance through RAGE in colorectal cancer. Cell Death Dis. 2018;9(10):1004. 30258050 10.1038/s41419-018-1019-6 PMC6158296 170. Li B Microrna-148a-3p enhances cisplatin cytotoxicity in gastric cancer through mitochondrial fission induction and cyto-protective autophagy suppression Cancer Lett 2017 410 212 227 10.1016/j.canlet.2017.09.035 28965855 PMC5675767 Li B, et al. Microrna-148a-3p enhances cisplatin cytotoxicity in gastric cancer through mitochondrial fission induction and cyto-protective autophagy suppression. Cancer Lett. 2017;410:212–27. 28965855 10.1016/j.canlet.2017.09.035 PMC5675767 171. Alalawy AI Inhibition of Drp1 orchestrates the responsiveness of breast cancer cells to paclitaxel but insignificantly relieves paclitaxel-related ovarian damage in mice Sci Rep 2023 13 1 22782 10.1038/s41598-023-49578-0 38129495 PMC10739747 Alalawy AI, et al. Inhibition of Drp1 orchestrates the responsiveness of breast cancer cells to paclitaxel but insignificantly relieves paclitaxel-related ovarian damage in mice. Sci Rep. 2023;13(1):22782. 38129495 10.1038/s41598-023-49578-0 PMC10739747 172. Meng Y Targeting CRL4 suppresses chemoresistant ovarian cancer growth by inducing mitophagy Signal Transduct Target Ther 2022 7 1 388 10.1038/s41392-022-01253-y 36481655 PMC9731993 Meng Y, et al. Targeting CRL4 suppresses chemoresistant ovarian cancer growth by inducing mitophagy. Signal Transduct Target Ther. 2022;7(1):388. 36481655 10.1038/s41392-022-01253-y PMC9731993 173. Farrand L Piceatannol enhances cisplatin sensitivity in ovarian cancer via modulation of p53, X-linked inhibitor of apoptosis protein (XIAP), and mitochondrial fission J Biol Chem 2013 288 33 23740 23750 10.1074/jbc.M113.487686 23833193 PMC3745321 Farrand L, et al. Piceatannol enhances cisplatin sensitivity in ovarian cancer via modulation of p53, X-linked inhibitor of apoptosis protein (XIAP), and mitochondrial fission. J Biol Chem. 2013;288(33):23740–50. 23833193 10.1074/jbc.M113.487686 PMC3745321 174. Wang Y Mitochondrial dynamics as a novel treatment strategy for triple-negative breast cancer Cancer Med 2024 13 2 e6987 10.1002/cam4.6987 38334464 PMC10854452 Wang Y, et al. Mitochondrial dynamics as a novel treatment strategy for triple-negative breast cancer. Cancer Med. 2024;13(2):e6987. 38334464 10.1002/cam4.6987 PMC10854452 175. Wang S BNIP3-mediated mitophagy boosts the competitive growth of Lenvatinib-resistant cells via energy metabolism reprogramming in HCC Cell Death Dis 2024 15 7 484 10.1038/s41419-024-06870-9 38969639 PMC11226677 Wang S, et al. BNIP3-mediated mitophagy boosts the competitive growth of Lenvatinib-resistant cells via energy metabolism reprogramming in HCC. Cell Death Dis. 2024;15(7):484. 38969639 10.1038/s41419-024-06870-9 PMC11226677 176. Zampieri LX Mitochondria participate in chemoresistance to cisplatin in human ovarian cancer cells Mol Cancer Res 2020 18 9 1379 1391 10.1158/1541-7786.MCR-19-1145 32471883 Zampieri LX, et al. Mitochondria participate in chemoresistance to cisplatin in human ovarian cancer cells. Mol Cancer Res. 2020;18(9):1379–91. 32471883 10.1158/1541-7786.MCR-19-1145 177. Lu D STAT2/SLC27A3/PINK1-mediated mitophagy remodeling lipid metabolism contributes to Pazopanib resistance in clear cell renal cell carcinoma Research 2024 7 0539 10.34133/research.0539 39600540 PMC11588985 Lu D, et al. STAT2/SLC27A3/PINK1-mediated mitophagy remodeling lipid metabolism contributes to Pazopanib resistance in clear cell renal cell carcinoma. Research. 2024;7:0539. 39600540 10.34133/research.0539 PMC11588985 178. Zhang Y Targeting LINC01607 sensitizes hepatocellular carcinoma to Lenvatinib via suppressing mitophagy Cancer Lett 2023 576 216405 10.1016/j.canlet.2023.216405 37783391 Zhang Y, et al. Targeting LINC01607 sensitizes hepatocellular carcinoma to Lenvatinib via suppressing mitophagy. Cancer Lett. 2023;576:216405. 37783391 10.1016/j.canlet.2023.216405 179. Zhang H Targeting PARP14 with lomitapide suppresses drug resistance through the activation of DRP1-induced mitophagy in multiple myeloma Cancer Lett 2024 588 216802 10.1016/j.canlet.2024.216802 38467180 Zhang H, et al. Targeting PARP14 with lomitapide suppresses drug resistance through the activation of DRP1-induced mitophagy in multiple myeloma. Cancer Lett. 2024;588:216802. 38467180 10.1016/j.canlet.2024.216802 180. Wei X SIRT1-mediated deacetylation of FOXO3 enhances mitophagy and drives hormone resistance in endometrial cancer Mol Med 2024 30 1 147 10.1186/s10020-024-00915-7 39266959 PMC11391609 Wei X, et al. SIRT1-mediated deacetylation of FOXO3 enhances mitophagy and drives hormone resistance in endometrial cancer. Mol Med. 2024;30(1):147. 39266959 10.1186/s10020-024-00915-7 PMC11391609 181. Yamashita K High expression of the mitophagy-related protein Pink1 is associated with a poor response to chemotherapy and a poor prognosis for patients treated with neoadjuvant chemotherapy for esophageal squamous cell carcinoma Ann Surg Oncol 2017 24 13 4025 4032 10.1245/s10434-017-6096-8 29022200 Yamashita K, et al. High expression of the mitophagy-related protein Pink1 is associated with a poor response to chemotherapy and a poor prognosis for patients treated with neoadjuvant chemotherapy for esophageal squamous cell carcinoma. Ann Surg Oncol. 2017;24(13):4025–32. 29022200 10.1245/s10434-017-6096-8 182. Hou H High expression of FUNDC1 predicts poor prognostic outcomes and is a promising target to improve chemoradiotherapy effects in patients with cervical cancer Cancer Med 2017 6 8 1871 1881 10.1002/cam4.1112 28719148 PMC5548885 Hou H, et al. High expression of FUNDC1 predicts poor prognostic outcomes and is a promising target to improve chemoradiotherapy effects in patients with cervical cancer. Cancer Med. 2017;6(8):1871–81. 28719148 10.1002/cam4.1112 PMC5548885 183. Yan C Doxorubicin-induced mitophagy contributes to drug resistance in cancer stem cells from HCT8 human colorectal cancer cells Cancer Lett 2017 388 34 42 10.1016/j.canlet.2016.11.018 27913197 Yan C, et al. Doxorubicin-induced mitophagy contributes to drug resistance in cancer stem cells from HCT8 human colorectal cancer cells. Cancer Lett. 2017;388:34–42. 27913197 10.1016/j.canlet.2016.11.018 184. Kou X HSPA8-mediated stability of the CLPP protein regulates mitochondrial autophagy in cisplatin-resistant ovarian cancer cells Acta Biochim Biophys Sin 2024 56 3 356 365 38419499 10.3724/abbs.2023246 PMC10984867 Kou X, et al. HSPA8-mediated stability of the CLPP protein regulates mitochondrial autophagy in cisplatin-resistant ovarian cancer cells. Acta Biochim Biophys Sin. 2024;56(3):356–65. 38419499 10.3724/abbs.2023246 PMC10984867 185. Wang Y Piwil1 drives chemoresistance in multiple myeloma by modulating mitophagy and the myeloma stem cell population Front Oncol 2021 11 783583 10.3389/fonc.2021.783583 35083142 PMC8784391 Wang Y, et al. Piwil1 drives chemoresistance in multiple myeloma by modulating mitophagy and the myeloma stem cell population. Front Oncol. 2021;11:783583. 35083142 10.3389/fonc.2021.783583 PMC8784391 186. Naso FD MiR-218-5p and doxorubicin combination enhances anticancer activity in breast cancer cells through Parkin-dependent mitophagy inhibition Cell Death Discov 2024 10 1 149 10.1038/s41420-024-01914-7 38514650 PMC10957887 Naso FD, et al. MiR-218-5p and doxorubicin combination enhances anticancer activity in breast cancer cells through Parkin-dependent mitophagy inhibition. Cell Death Discov. 2024;10(1):149. 38514650 10.1038/s41420-024-01914-7 PMC10957887 187. Kong F Resveratrol augments paclitaxel sensitivity by modulating miR-671-5p/STOML2/PINK1/Parkin-mediated autophagy signaling in A549 cell J Biochem Mol Toxicol 2024 38 1 e23557 10.1002/jbt.23557 37840424 Kong F, et al. Resveratrol augments paclitaxel sensitivity by modulating miR-671-5p/STOML2/PINK1/Parkin-mediated autophagy signaling in A549 cell. J Biochem Mol Toxicol. 2024;38(1):e23557. 37840424 10.1002/jbt.23557 188. Wu H Mitophagy promotes sorafenib resistance through hypoxia-inducible ATAD3A dependent axis J Exp Clin Cancer Res 2020 39 1 274 10.1186/s13046-020-01768-8 33280610 PMC7720487 Wu H, et al. Mitophagy promotes sorafenib resistance through hypoxia-inducible ATAD3A dependent axis. J Exp Clin Cancer Res. 2020;39(1):274. 33280610 10.1186/s13046-020-01768-8 PMC7720487 189. Liu Y Caveolin-1 knockdown increases the therapeutic sensitivity of lung cancer to cisplatin-induced apoptosis by repressing Parkin-related mitophagy and activating the ROCK1 pathway J Cell Physiol 2020 235 2 1197 1208 10.1002/jcp.29033 31270811 Liu Y, et al. Caveolin-1 knockdown increases the therapeutic sensitivity of lung cancer to cisplatin-induced apoptosis by repressing Parkin-related mitophagy and activating the ROCK1 pathway. J Cell Physiol. 2020;235(2):1197–208. 31270811 10.1002/jcp.29033 190. Shin YY Melatonin and verteporfin synergistically suppress the growth and stemness of head and neck squamous cell carcinoma through the regulation of mitochondrial dynamics J Pineal Res 2022 72 1 e12779 10.1111/jpi.12779 34826168 Shin YY, et al. Melatonin and verteporfin synergistically suppress the growth and stemness of head and neck squamous cell carcinoma through the regulation of mitochondrial dynamics. J Pineal Res. 2022;72(1):e12779. 34826168 10.1111/jpi.12779 191. Yu Y Fighting against drug-resistant tumor by the induction of excessive mitophagy with transferrin nanomedicine Macromol Biosci 2024 24 2 e2300116 10.1002/mabi.202300116 37677756 Yu Y, et al. Fighting against drug-resistant tumor by the induction of excessive mitophagy with transferrin nanomedicine. Macromol Biosci. 2024;24(2):e2300116. 37677756 10.1002/mabi.202300116 192. Pan B FoxG1/BNIP3 axis promotes mitophagy and blunts cisplatin resistance in osteosarcoma Cancer Sci 2024 115 8 2565 2577 10.1111/cas.16242 38932521 PMC11309937 Pan B, et al. FoxG1/BNIP3 axis promotes mitophagy and blunts cisplatin resistance in osteosarcoma. Cancer Sci. 2024;115(8):2565–77. 38932521 10.1111/cas.16242 PMC11309937 193. Vianello C Cisplatin resistance can be curtailed by blunting Bnip3-mediated mitochondrial autophagy Cell Death Dis 2022 13 4 398 10.1038/s41419-022-04741-9 35459212 PMC9033831 Vianello C, et al. Cisplatin resistance can be curtailed by blunting Bnip3-mediated mitochondrial autophagy. Cell Death Dis. 2022;13(4):398. 35459212 10.1038/s41419-022-04741-9 PMC9033831 194. Sun Y Mettl3 promotes chemoresistance in small cell lung cancer by inducing mitophagy J Exp Clin Cancer Res 2023 42 1 65 10.1186/s13046-023-02638-9 36932427 PMC10022264 Sun Y, et al. Mettl3 promotes chemoresistance in small cell lung cancer by inducing mitophagy. J Exp Clin Cancer Res. 2023;42(1):65. 36932427 10.1186/s13046-023-02638-9 PMC10022264 195. Yao N Inhibition of PINK1/Parkin-dependent mitophagy sensitizes multidrug-resistant cancer cells to B5G1, a new betulinic acid analog Cell Death Dis 2019 10 3 232 10.1038/s41419-019-1470-z 30850585 PMC6408511 Yao N, et al. Inhibition of PINK1/Parkin-dependent mitophagy sensitizes multidrug-resistant cancer cells to B5G1, a new betulinic acid analog. Cell Death Dis. 2019;10(3):232. 30850585 10.1038/s41419-019-1470-z PMC6408511 196. Zhou S Human menstrual blood-derived stem cells reverse sorafenib resistance in hepatocellular carcinoma cells through the hyperactivation of mitophagy Stem Cell Res Ther 2023 14 1 58 10.1186/s13287-023-03278-8 37005657 PMC10068152 Zhou S, et al. Human menstrual blood-derived stem cells reverse sorafenib resistance in hepatocellular carcinoma cells through the hyperactivation of mitophagy. Stem Cell Res Ther. 2023;14(1):58. 37005657 10.1186/s13287-023-03278-8 PMC10068152 197. Dany M Targeting FLT3-ITD signaling mediates ceramide-dependent mitophagy and attenuates drug resistance in AML Blood 2016 128 15 1944 1958 10.1182/blood-2016-04-708750 27540013 PMC5064718 Dany M, et al. Targeting FLT3-ITD signaling mediates ceramide-dependent mitophagy and attenuates drug resistance in AML. Blood. 2016;128(15):1944–58. 27540013 10.1182/blood-2016-04-708750 PMC5064718 198. Wu C NPR1 promotes cisplatin resistance by inhibiting PARL-mediated mitophagy-dependent ferroptosis in gastric cancer Cell Biol Toxicol 2024 40 1 93 10.1007/s10565-024-09931-z 39476297 PMC11525271 Wu C, et al. NPR1 promotes cisplatin resistance by inhibiting PARL-mediated mitophagy-dependent ferroptosis in gastric cancer. Cell Biol Toxicol. 2024;40(1):93. 39476297 10.1007/s10565-024-09931-z PMC11525271 199. Peng Q Astragalus polysaccharides sensitize ovarian cancer stem cells to PARPi by inhibiting mitophagy via PINK1/Parkin signaling iScience 2024 27 8 110376 10.1016/j.isci.2024.110376 39108732 PMC11301338 Peng Q, et al. Astragalus polysaccharides sensitize ovarian cancer stem cells to PARPi by inhibiting mitophagy via PINK1/Parkin signaling. iScience. 2024;27(8):110376. 39108732 10.1016/j.isci.2024.110376 PMC11301338 200. Glytsou C Mitophagy promotes resistance to BH3 mimetics in acute myeloid leukemia Cancer Discov 2023 13 7 1656 1677 10.1158/2159-8290.CD-22-0601 37088914 PMC10330144 Glytsou C, et al. Mitophagy promotes resistance to BH3 mimetics in acute myeloid leukemia. Cancer Discov. 2023;13(7):1656–77. 37088914 10.1158/2159-8290.CD-22-0601 PMC10330144 201. Wang H C-IGF1R encoded by cIGF1R acts as a molecular switch to restrict mitophagy of drug-tolerant persister tumour cells in non-small cell lung cancer Cell Death Differ 2023 30 11 2365 2381 10.1038/s41418-023-01222-0 37689814 PMC10657401 Wang H, et al. C-IGF1R encoded by cIGF1R acts as a molecular switch to restrict mitophagy of drug-tolerant persister tumour cells in non-small cell lung cancer. Cell Death Differ. 2023;30(11):2365–81. 37689814 10.1038/s41418-023-01222-0 PMC10657401 202. Ahmadpour ST Doxorubicin-induced autophagolysosome formation is partly prevented by mitochondrial ROS elimination in DOX-resistant breast cancer cells Int J Mol Sci 2021 10.3390/ijms22179283 34502189 PMC8431121 Ahmadpour ST, et al. Doxorubicin-induced autophagolysosome formation is partly prevented by mitochondrial ROS elimination in DOX-resistant breast cancer cells. Int J Mol Sci. 2021. 10.3390/ijms22179283. 34502189 10.3390/ijms22179283 PMC8431121 203. Vyas S Zaganjor E Haigis MC Mitochondria and cancer Cell 2016 166 3 555 566 10.1016/j.cell.2016.07.002 27471965 PMC5036969 Vyas S, Zaganjor E, Haigis MC. Mitochondria and cancer. Cell. 2016;166(3):555–66. 27471965 10.1016/j.cell.2016.07.002 PMC5036969 204. Lv Y In situ transformable nanoparticle effectively suppresses bladder cancer by damaging mitochondria and blocking mitochondrial autophagy flux Adv Sci 2024 10.1002/advs.202409425 PMC11791963 39651805 Lv Y, et al. In situ transformable nanoparticle effectively suppresses bladder cancer by damaging mitochondria and blocking mitochondrial autophagy flux. Adv Sci. 2024. 10.1002/advs.202409425. 10.1002/advs.202409425 PMC11791963 39651805 ",
  "metadata": {
    "Title of this paper": "In situ transformable nanoparticle effectively suppresses bladder cancer by damaging mitochondria and blocking mitochondrial autophagy flux",
    "Journal it was published in:": "Journal of Translational Medicine",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12492677/"
  }
}