{
  "title": "Paper_1202",
  "abstract": "pmc Pharmaceuticals (Basel) Pharmaceuticals (Basel) 2102 pharmaceuticals pharmaceuticals Pharmaceuticals 1424-8247 Multidisciplinary Digital Publishing Institute  (MDPI) PMC12473030 PMC12473030.1 12473030 12473030 41011202 10.3390/ph18091331 pharmaceuticals-18-01331 1 Review Exploring the Therapeutic Potential of Bupleurum Tian Yu 1 2 3 4 Guo Jiageng 1 2 3 4 Jiang Xinya 1 2 3 4 Lu Hongyu 1 2 3 4 Xie Jinling 1 2 3 4 Zhang Fan 1 2 3 4 Du Zhengcai 1 2 3 4 5 * https://orcid.org/0000-0001-7394-6022 Hao Erwei 1 2 3 4 5 * Alonso-Castro Angel Josabad Academic Editor 1 2 3 4 5 * duzhengcai8@163.com ewhao@163.com 05 9 2025 9 2025 18 9 497460 1331 20 6 2025 29 8 2025 03 9 2025 05 09 2025 27 09 2025 29 09 2025 © 2025 by the authors. 2025 https://creativecommons.org/licenses/by/4.0/ Licensee MDPI, Basel, Switzerland. This article is an open access article distributed under the terms and conditions of the Creative Commons Attribution (CC BY) license ( https://creativecommons.org/licenses/by/4.0/ Bupleurum Bupleurum chinense Bupleurum scorzonerifolium Bupleurum Bupleurum Bupleurum Chinese medicine Bupleurum pharmacological effects mechanism of action research progress Guangxi’s 7th Batch of Bagui Scholars Pmject GUIRENCAIBAN2025No. 31 National Administration of Traditional Chinese Medicine Youth Qihuang Scholars Support Prject 2022256 Guangxi Youth Qihuang Scholars Support Prject 202213 Guangxi University of Chinese Medicine Guipai Xinglin Top Talent Funding Pmject 2022C013 Central Guide Local Development Prject of Guangxi ZY22096003 Guangxi’s 7th Batch of Bagui Scholars Pmject (NO.GUIRENCAIBAN2025No. 31); the National Administration of Traditional Chinese Medicine Youth Qihuang Scholars Support Prject (No. 2022256); the Guangxi Youth Qihuang Scholars Support Prject (No. 202213); the Guangxi University of Chinese Medicine Guipai Xinglin Top Talent Funding Pmject (No. 2022C013); and the Central Guide Local Development Prject of Guangxi (No. ZY22096003). pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement no pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes 1. Introduction Bupleurum Bupleurum chinense Bupleurum scorzonerifolium 1 Bupleurum 2 Bupleurum chinense Bupleurum scorzonerifolium Figure 1 Bupleurum B. chinense B. scorzonerifolium Bupleurum Bupleurum Bupleurum 3 4 5 6 7 8 Bupleurum Bupleurum Bupleurum 9 10 11 12 13 This review targets researchers in traditional Chinese medicine, pharmacologists, and developers of natural medicines, systematically integrating multidisciplinary research findings on Bupleurum Bupleurum Figure 1 Diagnostic comparison of Bupleurum A B. chinense B. scorzonerifolium B B. chinense B. scorzonerifolium 2. Review Methods To comprehensively review the pharmacological effects of various Bupleurum Bupleurum Bupleurum Bupleurum chinense Bupleurum scorzonerifolium Bupleurum Bupleurum Bupleurum Bupleurum Bupleurum Bupleurum Bupleurum 3. Chemical Composition Bupleurum Bupleurum Table 1 Bupleurum pharmaceuticals-18-01331-t001_Table 1 Table 1 Representative constituents of Bupleurum Category Chemical Name Structural Formula References Saponins Saikosaponin A  [ 14 Saikosaponin B1  [ 14 Saikosaponin B2  [ 14 Polysaccharides Type I rhamnogalacturonan  [ 15 Coumarins Scopoletin  [ 16 Polyacetylenes Bupleurynol  [ 17 Bupleurum Bupleurum 18 19 20 Bupleurum Bupleurum Bupleurum Bupleurum Bupleurum Bupleurum Bupleurum Bupleurum Bupleurum Bupleurum Bupleurum 15 21 Bupleurum Bupleurum Bupleurum 22 Bupleurum 14 23 Bupleurum Bupleurum Bupleurum By isolating and identifying the volatile oils in Bupleurum 24 25 26 Bupleurum Coumarins isolated from Bupleurum 16 15 Bupleurum Bupleurum 17 Bupleurum The interaction of these chemical components has enabled Bupleurum 4. Pharmacological Effect As a widely used medicinal plant, Bupleurum Bupleurum Bupleurum Figure 2 4.1. Anti-Tumor Cancer is the leading cause of death worldwide [ 27 28 29 30 Figure 3 Bupleurum 31 32 33 34 35 36 37 38 39 40 41 42 Bupleurum Bupleurum 4.1.1. Anti-Liver Cancer Liver cancer has a high incidence rate and is closely associated with chronic infections of the hepatitis B virus (HBV) or hepatitis C virus (HCV) [ 43 44 Chanhao Lei et al. [ 36 The incidence of liver cancer is closely associated with the expression of STK4 in immune cells [ 45 46 47 Bupleurum Bupleurum 38 In the past few decades, the medicinal value of natural polysaccharides has received widespread attention from academics and related researchers. Shuyuan Shi et al. [ 40 Bupleurum p In summary, the treatment of liver cancer requires reasonable planning based on the different stages of the disease. For patients with early-stage liver cancer, surgical resection is the preferred treatment method; for patients with advanced stages, chemotherapy is the optimal treatment choice. The above research not only expands the potential application of Bupleurum 4.1.2. Anti-Gastric Cancer Gastric cancer (GC) is one of the leading causes of cancer-related deaths worldwide [ 48 49 50 To investigate the inhibitory effects of Bupleurum 31 p Tae Woo Kim et al. [ 32 Bupleurum 51 2+ p In summary, Bupleurum Bupleurum 4.1.3. Anti-Colon Cancer Colon cancer, as one of the most common malignant tumors in the digestive tract, is primarily treated with surgical intervention [ 52 To investigate the inhibitory effect of Bupleurum 42 p Su Jin Kang et al. [ 33 Bupleurum To sum up, Bupleurum Bupleurum 4.1.4. Anti-Breast Cancer Breast cancer is the most common malignant tumor in women [ 53 To investigate the impact of Bupleurum 37 p Dan Wang et al. [ 35 Bupleurum Bupleurum The current treatment for breast cancer primarily involves surgical resection, supplemented by medical therapies such as radiotherapy, chemotherapy, endocrine therapy, and targeted therapy [ 54 Bupleurum 4.1.5. Anti-Lung Cancer Lung cancer is one of the most prevalent cancers worldwide and remains the leading cause of cancer-related mortality [ 55 56 To investigate whether Bupleurum 39 p p p p In summary, SS-d induces apoptosis in lung cancer cells by promoting the accumulation of ROS and activates the NF-κB/NLRP3/caspase-1/GSDMD pathway, thereby exhibiting an anti-non-small cell lung cancer effect. This finding provides valuable evidence and support for the development of new therapeutic drugs. 4.1.6. Anti-Cervical Cancer Cervical cancer is the most prevalent malignant tumor responsible for illness and fatalities among women in clinical practice, ranking seventh overall among all types of malignant tumors [ 57 34 p In summary, SS-a induces apoptosis in HeLa cells by activating both the mitochondrial pathway and the endoplasmic reticulum stress pathway, thereby exerting an anti-cervical cancer effect. Consequently, SS-a is anticipated to serve as an adjunctive drug in the treatment of cervical cancer. 4.1.7. Anti-Melanoma Melanoma is a common form of cancer that can occur in multiple sites, including the skin, iris, and rectum [ 58 59 Extracellular matrix (ECM) adhesion plays a crucial role in tumor metastasis, with fibronectin serving as the most prevalent integrin ligand within the ECM [ 60 41 Bupleurum Bupleurum 61 Bupleurum Table 2 Bupleurum Bupleurum Bupleurum Bupleurum Figure 4 pharmaceuticals-18-01331-t002_Table 2 Table 2 Anti-tumor effects of Bupleurum Effect and Disease Adopted Model Main Mechanisms Main Targets References HCC 1. PLC mice treated with SS-b2 or doxorubicin2. SMMC-7721 and HepG2 cells exposed to SS-d3. H22 hepatoma-bearing mice given BCP SS-b2 raises STK4 expression, which in turn lowers IRAK1 and phosphorylated NF-κB p65, diminishes IL-1β/IL-6/TNF-α production and restrains tumor growth. SS-d blocks the p-STAT3/C-EBPβ axis, decreases COX-2 and reverses the Bax/Bcl-2 ratio, thereby activating caspase-3/9-mediated apoptosis. BCP arrests the cell cycle in the S phase and triggers apoptosis in tumors. STK4, IRAK1, NF-κB p65, STAT3, COX-2, Bax, Bcl-2, caspase-3/9 [ 36 38 40 Gastric cancer 1. HGC-27, AGS, MKN-28 cells treated with SS-a 2. AGS xenografts (including radio-resistant AGS-R and MKN-74-R) SS-a blocks the PI3K–Akt–mTOR cascade, elevates Bax and lowers Bcl-2, leading to S-phase arrest and apoptosis. It simultaneously provokes ER stress (GRP78–PERK–eIF2α–ATF4–CHOP), activates caspase-3/8/9 and enhances radiosensitivity in resistant GC cells. PI3K, Akt, mTOR, Bax, Bcl-2, GRP78, PERK, CHOP, caspase-3/8/9 [ 31 51 Colorectal cancer 1. SW480 and SW620 cells exposed to TBSE 2. LoVo and SW480 cells and xenograft mice treated with SS-a TBSE suppresses PI3K–Akt–mTOR signaling, shifts the Bax/Bcl-2 balance and activates caspase-9/3, culminating in apoptosis. SS-a sequentially activates caspase-4, then caspase-2/8/3, thereby inducing apoptosis and reducing tumor volume in vivo. PI3K, Akt, mTOR, Bax, Bcl-2, caspase-4/2/8/3/9 [ 33 42 Breast cancer 1. MCF-7 cells (SS-b2) 2. Adriamycin-resistant MCF-7/ADR cells (SS-a, SS-b) SS-b2 inhibits STAT3 phosphorylation, down-regulates VASP and MMP-2/9, and thus curbs proliferation and migration. SS-a and SS-b repress MDR1 mRNA and P-gp, lowering the IC 50 STAT3, VASP, MMP-2/9, MDR1, P-gp [ 35 37 NSCLC A549 and HCC827 cells treated with SS-d SS-d accumulates ROS, acetylates NF-κB, and activates the NLRP3–caspase-1–GSDMD axis, leading to pyroptotic cell death. ROS, NF-κB, NLRP3, caspase-1, GSDMD [ 39 Cervical cancer HeLa cells treated with SS-a SS-a decreases mitochondrial membrane potential, elevates ROS, and up-regulates Bax, caspase-3, and ER stress proteins (GRP78, CHOP, caspase-12), while suppressing PI3K/Akt, thereby inducing apoptosis. Bax, Bcl-2, caspase-3/12, GRP78, CHOP, PI3K/Akt [ 34 Melanoma A375 cells exposed to BCP BCP disrupts β1-integrin binding to fibronectin, reduces phosphorylation of FAK and paxillin, and inhibits ECM-mediated adhesion, thereby impeding metastasis. β1-integrin, FAK, paxillin [ 41 Figure 4 Anti-inflammatory effects of Bupleurum Bupleurum 4.2. Anti-Inflammatory Inflammation is a complex immune response and serves as a defense mechanism employed by the body to combat pathogens, toxic compounds, and various environmental stress factors [ 62 63 64 Bupleurum Bupleurum Figure 5 65 66 67 68 69 Bupleurum 70 4.2.1. Anti-Rhinitis Allergic rhinitis (AR) is an allergic inflammation of the nasal airway and is among the most prevalent chronic respiratory diseases worldwide [ 71 72 73 74 75 Chun Hua Piao et al. [ 65 Bupleurum Thi Tho Bui et al. [ 70 Bupleurum p p In summary, Bupleurum 4.2.2. Anti-Colitis Colitis is an inflammatory disease of the intestinal tract, with ulcerative colitis (UC) [ 76 77 78 79 80 This study investigates the therapeutic effects of Bupleurum Bupleurum 69 81 Puze Li et al. [ 66 Bupleurum p p p p To summarize, Bupleurum Bupleurum 4.2.3. Anti-Osteoarthritis Osteoarthritis (OA) is a common form of arthritis characterized by the degradation and destruction of the cartilage matrix, alongside an inflammatory response from the chondrocytes [ 82 83 To investigate the anti-inflammatory effect of Bupleurum 67 In summary, Bupleurum 4.2.4. Anti-Mastitis Mastitis is a breast disease caused by infection with Staphylococcus aureus [ 84 68 2+ Bupleurum Table 3 Bupleurum Bupleurum Bupleurum pharmaceuticals-18-01331-t003_Table 3 Table 3 Anti-Inflammatory Effects of Bupleurum Condition Adopted Model Main Mechanisms Main Targets References Allergic rhinitis 1. OVA-sensitized mice given SS-d 2. OVA-sensitized mice given BCE SS-d and BCE both reduce sneezing and nasal rubbing, dampen eosinophil and mast-cell infiltration, lower IgE/IgG1 and Th2 cytokines, raise IgG2a and IL-10, and inhibit NF-κB signaling, improving nasal mucosal integrity. NF-κB, IL-4/5/13, IgE, IgG1/2a, IL-10 [ 65 70 Ulcerative colitis 1. DSS-induced zebrafish colitis (SS-b1, SS-d) 2. DSS-induced mouse colitis (SS-d) SS-b1 and SS-d activate NRF2/HO-1, diminish lipid peroxidation and iron loading, and inhibit ferroptosis. SS-d also suppresses NF-κB, decreases TNF-α/IL-6/IL-1β, elevates IL-10, and recovers barrier proteins ZO-1, Claudin-1, Muc1/2. NRF2, HO-1, TNF-α, IL-6/1β/10, ZO-1, Claudin-1, Muc1/2 [ 66 69 Osteoarthritis IL-1β-stimulated human chondrocytes treated with SS-a SS-a up-regulates LXRα, blocks NF-κB activation, and reduces NO, PGE 2 LXRα, NF-κB, MMP-1/3/13, NO, PGE 2 [ 67 Mastitis S. aureus SS-a activates SIRT1/Nrf2, raises HO-1, enhances tight-junction proteins, decreases Fe 2+ SIRT1, Nrf2, HO-1, ZO-1, Occludin, Claudin-3 [ 68 4.3. Anti-Depression As a common and severe mental illness, depression is characterized by persistent low mood, slowed thinking, loss of interest, reduced self-evaluation, and sleep problems, and has become a public health issue that threatens public mental health and imposes a significant socioeconomic burden [ 85 86 87 88 Natural products have garnered widespread attention due to their potential antidepressant activity, providing new perspectives and resources for the development of antidepressant drugs [ 89 Bupleurum Bupleurum 90 91 92 93 94 Alterations in neurotransmitter levels and inflammatory markers are critical indicators of depression [ 95 96 Bupleurum 90 Bupleurum Bupleurum Bupleurum Tiantian Gao et al. [ 92 p Yue Tong et al. [ 94 To investigate the antidepressant effects of Bupleurum 91 p p p p As a crucial component of the neuroendocrine system, the hypothalamus–pituitary–adrenal axis (HPA) is considered to be a major contributor to depression [ 97 98 93 p p In the realm of neuropsychiatry, Bupleurum Bupleurum Table 4 Bupleurum Bupleurum Bupleurum pharmaceuticals-18-01331-t004_Table 4 Table 4 Antidepressant effects of Bupleurum Effect Adopted Model Main Mechanisms Main Targets References Antidepressant 1. CUMS rats ( Bupleurum Bupleurum cAMP, PKA, CREB, NLRP3, NF-κB, BDNF, mTOR, AMPAR [ 90 91 92 94 4.4. Anti-Aging Aging is a complex natural phenomenon [ 99 100 101 2 2 2− 102 In research into natural medicines, polysaccharides and their derivatives extracted from Bupleurum 103 104 Haibin Tong et al. [ 103 Bupleurum 2 2 2 2 2 2 INK4a INK4a Bupleurum Macrophages play a vital role in both innate and acquired immunity, as well as in the process of inflammatory aging [ 105 104 Bupleurum Bupleurum Table 5 Bupleurum Bupleurum Bupleurum pharmaceuticals-18-01331-t005_Table 5 Table 5 Anti-ageing and antioxidant effects of Bupleurum Effect Adopted Model Main Mechanisms Main Targets References Anti-ageing/antioxidant 1. H 2 2 Sulfated BCP derivatives prevent G 0 1 p53, p21, p16, NF-κB p65, ROS, SA-β-gal, SAHF [ 103 104 4.5. Anti-Epileptic Epilepsy ranks as the second most common neurological disorder, impacting approximately 0.5–1% of the global population. It is characterized by higher drug resistance and poorer clinical outcomes compared to other neurological conditions [ 106 Traditional Chinese medicine demonstrates unique advantages in the treatment of epilepsy through its multi-component, multi-pathway, and multi-target approach. Compared with chemical drugs, traditional Chinese medicine demonstrates unique efficacy, fewer side effects, and a wealth of resources, garnering widespread attention both domestically and internationally. Research indicates that the flavonoids BCE-20 and BCE-70 [ 107 Bupleurum 108 Xiaomao Li et al. [ 107 Bupleurum Bupleurum To investigate the anti-epileptic properties of Bupleurum 108 p 109 110 111 This study revealed that following the administration of BAO, there was a decrease in the expression of Bcl-2, while the levels of Bax and caspase-3 were increased and the expression of GAD65, GAD67, GIRK1, and GFAP was inhibited. In summary, BAO mitigates KA-induced epilepsy-like behaviors by modulating the Bcl2/Bax/caspase-3 signaling pathway and the Notch1/GABA/GAD/GIRK signaling pathway, thereby playing a therapeutic role in epilepsy. Studies have begun to explore Bupleurum Table 6 Bupleurum Bupleurum Bupleurum pharmaceuticals-18-01331-t006_Table 6 Table 6 Anti-Epileptic Effects of Bupleurum Effect Adopted Model Main Mechanisms Main Targets References Antiepileptic 1. KA-induced rat epilepsy (BCE-20, BCE-70) and LPS-BV-2 cells BCE-20/70 enhance TREM2, suppress NF-κB/IκB signaling and pro-inflammatory cytokines, reducing seizures. BAO modulates Bcl-2/Bax/caspase-3 and GABAergic pathways (GAD65/67, GIRK1), protecting hippocampal neurons. TREM2, NF-κB, IL-1β/6, TNF-α, Bcl-2, Bax, caspase-3, GAD65/67, GIRK1 [ 107 108 4.6. Antipyretic Effect Fever is part of the body’s immune system, serving as an important response to disease and infection. Bupleurum Bupleurum Yuan Kang et al. [ 112 Bupleurum Table 7 Bupleurum Bupleurum Bupleurum Bupleurum pharmaceuticals-18-01331-t007_Table 7 Table 7 Antipyretic effects of Bupleurum Effect Adopted Model Main Mechanisms Main Targets References Antipyretic LPS-induced fever rats and endotoxemic mice treated with BCE BCE inhibits TNF-α release from peripheral monocytes, thereby lowering core body temperature in febrile animals. TNF-α [ 112 4.7. Anti-Hepatitis C Virus Hepatitis C virus (HCV) is classified as a positive-strand RNA virus belonging to the hepacivirus genus within the flaviviridae family [ 113 114 115 116 Wei-Ping Lee et al. [ 117 Bupleurum Table 8 Bupleurum Bupleurum Bupleurum Bupleurum pharmaceuticals-18-01331-t008_Table 8 Table 8 Antiviral effects of Bupleurum Effect Adopted Model Main Mechanisms Main Targets References HCV Huh-7.5.1 cells infected with HCV and treated with SS-b2 SS-b2 blocks HCV RNA translation and replication and suppresses Daclatasvir-resistant mutants, providing a potential combination therapy. HCV RNA, NS5A pathway [ 117 4.8. Other Pharmacological Effects 4.8.1. Anti-Alzheimer’s Disease Alzheimer’s disease (AD) is a degenerative disorder of the central nervous system characterized by progressive dementia, which is accompanied by memory loss, cognitive impairment, and psychological deterioration [ 118 119 120 Bupleurum 121 Bupleurum 4.8.2. Anti-Cerebral Ischemic Injury Cerebral ischemic injury is a common refractory disease that can result in significant and enduring disabilities [ 122 123 Bupleurum 4.8.3. Anti-Allergic Asthma Allergic asthma is an important global health problem and is a chronic disease characterized by symptoms such as wheezing, dyspnea, chest tightness, and cough [ 124 125 126 127 Bupleurum 128 Bupleurum 4.8.4. Anti-Cardiovascular Disease Cardiovascular disease is one of the leading causes of death worldwide [ 129 130 131 Bupleurum 4.8.5. Liver Protection Bupleurum 132 Bupleurum 133 134 Bupleurum 135 4.8.6. Antidiabetics Diabetes is a chronic condition resulting from inadequate insulin secretion or insulin resistance in peripheral blood tissues, characterized by hyperglycemia, lipid damage, and disorders in protein metabolism [ 136 137 138 139 140 141 Bupleurum 5. VOSviewer In this study, we utilized VOSviewer (version 1.6.20), a software package specifically designed for bibliometric analysis and the creation of scientific knowledge maps, to generate a visual network diagram. This tool systematically presents research topics, academic activities, and literature sources related to Bupleurum Node: Each node represents a keyword extracted from the literature, with its size visually indicating the frequency or importance of the keyword in academic publications. The larger the node, the more extensively the keyword is discussed in Bupleurum Edges: The lines between nodes represent the co-occurrence relationship of keywords, indicating the frequency at which two keywords appear together in the same document. The thicker or denser the line, the stronger the association of these keywords in the research. Cluster colors: Through algorithmic analysis, VOSviewer automatically groups closely related keywords into the same cluster and labels them with the same color. For example, all red nodes may represent studies on the “pharmacological activity” of Bupleurum Through this visual analysis, we are able to quickly identify the core themes, emerging trends, and interdisciplinary intersections in the field of Bupleurum Figure 5 Figure 5 VOSviewer of Bupleurum Bupleurum Bupleurum 6. Conclusions Bupleurum Bupleurum Bupleurum Bupleurum Moreover, Bupleurum Bupleurum Bupleurum 7. Challenges and Breakthrough Directions In recent years, with the sustained development of the national economy, people’s demands for quality of life and medical treatment have been continuously increasing. A large number of studies have confirmed that Bupleurum 142 Bupleurum Bupleurum Bupleurum Scutellaria baicalensis Paeonia lactiflora Bupleurum In summary, future research should focus on in-depth analysis of the pharmacokinetic properties of Bupleurum Bupleurum Acknowledgments This is a short text to acknowledge the contributions of specific colleagues, institutions, or agencies that aided the efforts of the authors. Disclaimer/Publisher’s Note: Author Contributions Y.T.: writing—original draft, including substantive translation; J.G. and X.J.: writing—review and editing; H.L.: visualization; J.X. and F.Z.: literature curation and search; Z.D.: conceptualization; E.H.: project administration. All authors contributed to the article and approved the submitted version. All authors have read and agreed to the published version of the manuscript. Data Availability Statement No new data were created or analyzed in this study. Conflicts of Interest The authors declare that the research was conducted in the absence of any commercial or financial relationships that could be construed as a potential conflict of interest. References 1. Nešić M.D. Nešić M.S. Dimitrijević M. Radulović N.S. Essential Oil Composition of Bupleurum praealtum and Bupleurum affine: New Natural Constituents Plants 2024 13 2076 10.3390/plants13152076 39124193 PMC11314282 2. Teng L. Guo X. Ma Y. Xu L. Wei J. Xiao P. A comprehensive review on traditional and modern research of the genus Bupleurum Bupleurum J. Ethnopharmacol. 2023 306 116129 10.1016/j.jep.2022.116129 36638855 3. Zhu G. Jiang Z. Zhu N. Wang D. Guo T. Meng Y. Zhu Y. Tan K. Hu M. Tang H. Exploring the multi-targeted mechanism of Saikosaponin A in prostate cancer treatment: A network pharmacology and molecular docking approach Front. Pharmacol. 2025 16 1530715 10.3389/fphar.2025.1530715 39995416 PMC11847854 4. Zheng P. Ma R. Liu X. Song L. Ma B. Zou G. Saikosaponin-d Attenuates Irinotecan-Induced Intestinal Toxicity via TAK1/NF-κB Pathway and Enhances Antitumor Efficacy J. Inflamm. Res. 2025 18 7973 7988 10.2147/JIR.S504696 40546408 PMC12182735 5. Zhao M. Xiao L. Chen Q. Shen L. Zhao G. Linghu K. Ma Q. Dar P. Yu H. Bioactive Equivalent Combinatorial Compounds contributing to the holistic effect of traditional Chinese medicine Bupleuri chinense DC J. Ethnopharmacol. 2025 350 120003 10.1016/j.jep.2025.120003 40436123 6. Chen Z. Wang X. Huang W. Exploring the mechanism of Radix Bupleuri in the treatment of depression combined with SARS-CoV-2 infection through bioinformatics, network pharmacology, molecular docking, and molecular dynamic simulation Metab. Brain Dis. 2025 40 105 10.1007/s11011-025-01536-7 39832077 7. Bi Y. Li M. Wang Y. Yao J. Wang Y. Wang S. Zhuang L. Liu S. Li Z. Hao Z. Saikosaponins from Bupleurum scorzonerifolium Willd. alleviates microglial pyroptosis in depression by binding and inhibiting P2X7 expression Phytomedicine 2025 136 156240 10.1016/j.phymed.2024.156240 39637473 8. Gu S. Zheng Y. Chen C. Liu J. Wang Y. Wang J. Li Y. Research progress on the molecular mechanisms of Saikosaponin D in various diseases (Review) Int. J. Mol. Med. 2025 55 37 10.3892/ijmm.2024.5478 39717942 PMC11722148 9. Zou X. Sui Y. Tang X.Y. Zhang R. Shu Q. Gong T. Wu S. Sun Z.W. Li W.L. Qu Z.Y. Mechanism of Bupleurum scorzonerifolium and Paeonia lactiflora herbal pair against liver cancer: An exploration based on UPLC-Q-TOF-MS combined with network pharmacology Zhongguo Zhongyao Zazhi/China J. Chin. Mater. Medica 2022 47 3597 3608 10.19540/j.cnki.cjcmm.20220110.402 35850814 10. Zhou P. Shi W. He X.Y. Du Q.Y. Wang F. Guo J. Saikosaponin D: Review on the antitumour effects, toxicity and pharmacokinetics Pharm. Biol. 2021 59 1480 1489 10.1080/13880209.2021.1992448 34714209 PMC8567945 11. Shen X. Zhao Z. Wang H. Guo Z. Hu B. Zhang G. Elucidation of the Anti-Inflammatory Mechanisms of Bupleuri and Scutellariae Radix Using System Pharmacological Analyses Mediat. Inflamm. 2017 2017 3709874 10.1155/2017/3709874 PMC5278517 28190938 12. Cholet J. Decombat C. Vareille-Delarbre M. Gainche M. Berry A. Senejoux F. Ripoche I. Delort L. Vermerie M. Fraisse D. In Vitro Anti-Inflammatory and Immunomodulatory Activities of an Extract from the Roots of Bupleurum rotundifolium Medicines 2019 6 101 10.3390/medicines6040101 31614667 PMC6963863 13. Chen R. Wang X. Xu H. Zhao R. Hu Q. Comparative Study on Volatile Oils among Bupleuri radix Species and Habitats: Yields, Chemical Characterization and Antipyretic Activities Chem. Biodivers. 2022 19 e202200549 10.1002/cbdv.202200549 36382416 14. Wang N. Study on the Bioactive Components of the Above-Ground Parts of Bupleurum Chinensis Master’s Thesis Shenyang Pharmaceutical University Shenyang, China 2005 15. Xia Z. Liu X. Research Progress on Chemical Composition and Quality Control Methods of Bupleurum chinense Mod. Chin. Med. 2021 23 940 949 10.13313/j.issn.1673-4890.20200315001 16. Xu H.Y. Zhang Y.Q. Liu Z.M. Chen T. Lv C.Y. Tang S.H. Zhang X.B. Zhang W. Li Z.Y. Zhou R.R. ETCM: An encyclopaedia of traditional Chinese medicine Nucleic Acids Res. 2019 47 D976 D982 10.1093/nar/gky987 30365030 PMC6323948 17. Fang Y. Zhang F. Liu J. Zhou Y. Tian J. Qin X. Gao X. Isolation and quantitative determination of polyacetylenes in Bupleuri Radix Zhongcaoyao 2015 46 2365 2370 18. Sui C. Han W.J. Zhu C.R. Wei J.H. Recent Progress in Saikosaponin Biosynthesis in Bupleurum Curr. Pharm. Biotechnol. 2021 22 329 340 10.2174/1389201021999200918101248 32957882 19. Wang N. Li Q. Simultaneous Extraction and Analysis of Seven Major Saikosaponins from Bupleuri Radix and the Exploration of Antioxidant Activity and Its Mechanism Molecules 2023 28 5872 10.3390/molecules28155872 37570843 PMC10420870 20. Liu Y. Zhang Z. Xiao Z. Jin H. Kuang H. Yang B. Chemical Constituents from the Aerial Parts of Bupleurum chinense Zhongyaocai 2021 44 1620 1625 10.13863/j.issn1001-4454.2021.07.014 21. Zhao Y. Wan P. Wang J. Li P. Hu Q. Zhao R. Polysaccharide from vinegar baked radix bupleuri as efficient solubilizer for water-insoluble drugs of Chinese medicine Carbohydr. Polym. 2020 229 115473 10.1016/j.carbpol.2019.115473 31826443 22. Yang F. Dong X. Yin X. Wang W. You L. Ni J. Radix Bupleuri: A Review of Traditional Uses, Botany, Phytochemistry, Pharmacology, and Toxicology Biomed. Res. Int. 2017 2017 7597596 10.1155/2017/7597596 28593176 PMC5448051 23. Wo Y. Yao L. Sun S. Progress of Chemical Constituents of Bupleurum Chinese Heilongjiang Med. J. 2011 24 215 217 10.14035/j.cnki.hljyy.2011.02.030 24. Zuzarte M. Correia P.M.P. Alves-Silva J.M. Gonçalves M.J. Cavaleiro C. Cruz T. Salgueiro L. Antifungal and Anti-Inflammatory Potential of Bupleurum rigidum subsp. paniculatum (Brot.) H.Wolff Essential Oil Antibiotics 2021 10 592 10.3390/antibiotics10050592 34067555 PMC8156192 25. Meng J. Chen X. Yang W. Song J. Zhang Y. Li Z. Yang X. Yang Z. Gas chromatography-mass spectrometry analysis of essential oils from five parts of Chaihu (Radix Bupleuri Chinensis) J. Tradit. Chin. Med./Chung I Tsa Chih Ying Wen Pan 2014 34 741 748 10.1016/S0254-6272(15)30090-X 25618980 26. Sun P. Li Y. Wei S. Zhao T. Wang Y. Song C. Xue L. Wang F. Xiao L. Wu J. Pharmacological Effects and Chemical Constituents of Bupleurum Mini Rev. Med. Chem. 2019 19 34 55 10.2174/1871520618666180628155931 29956627 27. Bray F. Laversanne M. Weiderpass E. Soerjomataram I. The ever-increasing importance of cancer as a leading cause of premature death worldwide Cancer 2021 127 3029 3030 10.1002/cncr.33587 34086348 28. Coussens N.P. Braisted J.C. Peryea T. Sittampalam G.S. Simeonov A. Hall M.D. Small-Molecule Screens: A Gateway to Cancer Therapeutic Agents with Case Studies of Food and Drug Administration-Approved Drugs Pharmacol. Rev. 2017 69 479 496 10.1124/pr.117.013755 28931623 PMC5612261 29. Guo Q. Cao H. Qi X. Li H. Ye P. Wang Z. Wang D. Sun M. Research Progress in Reversal of Tumor Multi-drug Resistance via Natural Products Anti Cancer Agents Med. Chem. 2017 17 1466 1476 10.2174/1871520617666171016105704 29034843 30. Zhang C.C. Liu S.Y. Liu J. Yang P.Y. Lin H.S. Zhang Y. Lung Cancer Treatment in Traditional Chinese Medicine: History, Current Status, and Development World J. Tradit. Chin. Med. 2023 9 297 306 10.4103/2311-8571.382025 31. Wang C. Zhang R. Chen X. Yuan M. Wu J. Sun Q. Miao C. Jing Y. The potential effect and mechanism of Saikosaponin A against gastric cancer BMC Complement. Med. Ther. 2023 23 295 10.1186/s12906-023-04108-3 37608281 PMC10463516 32. Kim T.W. Targeting ER Stress with Saikosaponin A to Overcome Resistance under Radiation in Gastric Cancer Cells Int. J. Mol. Sci. 2023 24 5661 10.3390/ijms24065661 36982736 PMC10052548 33. Kang S.J. Lee Y.J. Kang S.G. Cho S. Yoon W. Lim J.H. Min S.H. Lee T.H. Kim B.M. Caspase-4 is essential for saikosaponin a-induced apoptosis acting upstream of caspase-2 and γ-H2AX in colon cancer cells Oncotarget 2017 8 100433 100448 10.18632/oncotarget.22247 29245990 PMC5725032 34. Du J. Song D. Cao T. Li Y. Liu J. Li B. Li L. Saikosaponin-A induces apoptosis of cervical cancer through mitochondria- and endoplasmic reticulum stress-dependent pathway in vitro and in vivo: Involvement of PI3K/AKT signaling pathway Cell Cycle 2021 20 2221 2232 10.1080/15384101.2021.1974791 34520332 PMC8794532 35. Wang D. Ji D.-C. Wu D. Wang L. Yu C. Li C.H. Gai X. Reversal Effect of Saikosaponin A and Saikosaponin B on Doxorubicin-resistant Breast Cancer Cells and its Mechanism Pharmacogn. Mag. 2023 19 700 708 10.1177/09731296231171217 36. Lei C. Gao Z. Lv X. Zhu Y. Li R. Li S. Saikosaponin-b2 Inhibits Primary Liver Cancer by Regulating the STK4/IRAK1/NF-κB Pathway Biomedicines 2023 11 2859 10.3390/biomedicines11102859 37893233 PMC10604266 37. Ma Q. Gao F.F. He X. Li K. Gao Y. Xu X.L. Jiang N.H. Ding L. Song W.J. He Y.Q. Antitumor effects of saikosaponin b2 on breast cancer cell proliferation and migration Mol. Med. Rep. 2019 20 1943 1951 10.3892/mmr.2019.10385 31257464 38. Ren M. McGowan E. Li Y. Zhu X. Lu X. Zhu Z. Lin Y. He S. Saikosaponin-d Suppresses COX2 Through p-STAT3/C/EBPβ Signaling Pathway in Liver Cancer: A Novel Mechanism of Action Front. Pharmacol. 2019 10 623 10.3389/fphar.2019.00623 31191326 PMC6549044 39. Chen M. Hu C. Yang L. Guo Q. Liang Y. Wang W. Saikosaponin-D induces the pyroptosis of lung cancer by increasing ROS and activating the NF-κB/NLRP3/caspase-1/GSDMD pathway J. Biochem. Mol. Toxicol. 2023 37 e23444 10.1002/jbt.23444 37393521 40. Shi S. Chang M. Liu H. Ding S. Yan Z. Si K. Gong T. The Structural Characteristics of an Acidic Water-Soluble Polysaccharide from Bupleurum chinense DC and Its In Vivo Anti-Tumor Activity on H22 Tumor-Bearing Mice Polymers 2022 14 1119 10.3390/polym14061119 35335457 PMC8952506 41. Tong H. Jiang G. Qi D. Bi J. Tian D. Guan X. Zheng S. Sun X. Bupleurum chinense polysaccharide inhibit adhesion of human melanoma cells via blocking β1 integrin function Carbohydr. Polym. 2017 156 244 252 10.1016/j.carbpol.2016.09.034 27842819 42. Zhang X. Liu Z. Chen S. Li H. Dong L. Fu X. A new discovery: Total Bupleurum saponin extracts can inhibit the proliferation and induce apoptosis of colon cancer cells by regulating the PI3K/Akt/mTOR pathway J. Ethnopharmacol. 2022 283 114742 10.1016/j.jep.2021.114742 34655668 43. El-Serag H.B. Epidemiology of viral hepatitis and hepatocellular carcinoma Gastroenterology 2012 142 1264 1273.e1 10.1053/j.gastro.2011.12.061 22537432 PMC3338949 44. Torres H.A. Shigle T.L. Hammoudi N. Link J.T. Samaniego F. Kaseb A. Mallet V. The oncologic burden of hepatitis C virus infection: A clinical perspective CA A Cancer J. Clin. 2017 67 411 431 10.3322/caac.21403 28683174 PMC5591069 45. Nadolny C. Zhang X. Chen Q. Hashmi S.F. Ali W. Hemme C. Ahsan N. Chen Y. Deng R. Dysregulation and activities of ubiquitin specific peptidase 2b in the pathogenesis of hepatocellular carcinoma Am. J. Cancer Res. 2021 11 4746 4767 34765291 PMC8569343 46. Zhou Y. Qian M. Li J. Ruan L. Wang Y. Cai C. Gu S. Zhao X. The role of tumor-associated macrophages in lung cancer: From mechanism to small molecule therapy Biomed. Pharmacother. 2024 170 116014 10.1016/j.biopha.2023.116014 38134634 47. Franklin R.A. Li M.O. Ontogeny of Tumor-associated Macrophages and Its Implication in Cancer Regulation Trends Cancer 2016 2 20 34 10.1016/j.trecan.2015.11.004 26949745 PMC4772875 48. Guardiario D.L.P. Dy C. 128P Survival outcome of gastric cancer patients in a tertiary care center: A 10-year single center retrospective study Ann. Oncol. 2022 33 S1482 10.1016/j.annonc.2022.10.164 49. Smyth E.C. Nilsson M. Grabsch H.I. van Grieken N.C. Lordick F. Gastric cancer Lancet 2020 396 635 648 10.1016/S0140-6736(20)31288-5 32861308 50. Wang F.H. Zhang X.T. Tang L. Wu Q. Cai M.Y. Li Y.F. Qu X.J. Qiu H. Zhang Y.J. Ying J.E. The Chinese Society of Clinical Oncology (CSCO): Clinical guidelines for the diagnosis and treatment of gastric cancer, 2023 Cancer Commun. 2024 44 127 172 10.1002/cac2.12516 38160327 PMC10794017 51. Kim T.W. Paeoniflorin Induces ER Stress-Mediated Apoptotic Cell Death by Generating Nox4-Derived ROS under Radiation in Gastric Cancer Nutrients 2023 15 5092 10.3390/nu15245092 38140352 PMC10745742 52. Morii Y. Tsubaki M. Takeda T. Otubo R. Seki S. Yamatomo Y. Imano M. Satou T. Shimomura K. Nishida S. Perifosine enhances the potential antitumor effect of 5-fluorourasil and oxaliplatin in colon cancer cells harboring the PIK3CA mutation Eur. J. Pharmacol. 2021 898 173957 10.1016/j.ejphar.2021.173957 33662352 53. Lavoro A. Scalisi A. Candido S. Zanghì G.N. Rizzo R. Gattuso G. Caruso G. Libra M. Falzone L. Identification of the most common BRCA alterations through analysis of germline mutation databases: Is droplet digital PCR an additional strategy for the assessment of such alterations in breast and ovarian cancer families? Int. J. Oncol. 2022 60 58 10.3892/ijo.2022.5349 35383859 PMC8997337 54. Harbeck N. Gnant M. Breast cancer Lancet 2017 389 1134 1150 10.1016/S0140-6736(16)31891-8 27865536 55. Nasim F. Sabath B.F. Eapen G.A. Lung Cancer Med. Clin. N. Am. 2019 103 463 473 10.1016/j.mcna.2018.12.006 30955514 56. Yang F. Yuan W.Q. Li J. Luo Y.Q. Knockdown of METTL14 suppresses the malignant progression of non-small cell lung cancer by reducing Twist expression Oncol. Lett. 2021 22 847 10.3892/ol.2021.13108 34733365 PMC8561617 57. del Carmen M.G. Rice L.W. Schmeler K.M. Global health perspective on gynecologic oncology Gynecol. Oncol. 2015 137 329 334 10.1016/j.ygyno.2015.03.009 25782635 58. Schadendorf D. Hauschild A. Melanoma in 2013: Melanoma--the run of success continues Nat. Rev. Clin. Oncol. 2014 11 75 76 10.1038/nrclinonc.2013.246 24419300 59. Damsky W.E. Theodosakis N. Bosenberg M. Melanoma metastasis: New concepts and evolving paradigms Oncogene 2014 33 2413 2422 10.1038/onc.2013.194 23728340 60. Iwamoto D.V. Calderwood D.A. Regulation of integrin-mediated adhesions Curr. Opin. Cell Biol. 2015 36 41 47 10.1016/j.ceb.2015.06.009 26189062 PMC4639423 61. Giraulo C. Turiello R. Orlando L. Leonardelli S. Landsberg J. Belvedere R. Rolshoven G. Müller C.E. Hölzel M. Morello S. The CD73 is induced by TGF-β1 triggered by nutrient deprivation and highly expressed in dedifferentiated human melanoma Biomed. Pharmacother. 2023 165 115225 10.1016/j.biopha.2023.115225 37517292 62. Borges R.S. Ortiz B.L.S. Pereira A.C.M. Keita H. Carvalho J.C.T. Rosmarinus officinalis essential oil: A review of its phytochemistry, anti-inflammatory activity, and mechanisms of action involved J. Ethnopharmacol. 2019 229 29 45 10.1016/j.jep.2018.09.038 30287195 63. Salehi B. Sharopov F. Boyunegmez Tumer T. Ozleyen A. Rodríguez-Pérez C. Ezzat S.M. Azzini E. Hosseinabadi T. Butnariu M. Sarac I. Symphytum Species: A Comprehensive Review on Chemical Composition, Food Applications and Phytopharmacology Molecules 2019 24 2272 10.3390/molecules24122272 31216776 PMC6631335 64. Fraenkel L. Buta E. Suter L. Dubreuil M. Levy C. Najem C. Brennan M. Corn B. Kerns R. Goulet J. Nonsteroidal Anti-inflammatory Drugs vs Cognitive Behavioral Therapy for Arthritis Pain: A Randomized Withdrawal Trial JAMA Intern. Med. 2020 180 1194 1202 10.1001/jamainternmed.2020.2821 32702101 PMC7372512 65. Piaoa C.H. Zou S.C. Bui T.T. Song C.H. Chai O.H. Saikosaponin D inhibits nasal inflammation by regulating the transcription factors T-box protein expressed in T cells/GATA-3 and retinoic acid-related orphan nuclear receptor γt in a murine model of allergic rhinitis Heliyon 2023 9 e17319 10.1016/j.heliyon.2023.e17319 37484363 PMC10361371 66. Li P. Wu M. Xiong W. Li J. An Y. Ren J. Xie Y. Xue H. Yan D. Li M. Saikosaponin-d ameliorates dextran sulfate sodium-induced colitis by suppressing NF-κB activation and modulating the gut microbiota in mice Int. Immunopharmacol. 2020 81 106288 10.1016/j.intimp.2020.106288 32062075 67. Gao H. Song Y. Li D. Feng W. Liu J. Saikosaponin A inhibits IL-1β-induced inflammatory mediators in human osteoarthritis chondrocytes by activating LXRα Oncotarget 2017 8 88941 88950 10.18632/oncotarget.21495 29179489 PMC5687659 68. Zhao L. Jin L. Yang B. Saikosaponin A alleviates Staphylococcus aureus-induced mastitis in mice by inhibiting ferroptosis via SIRT1/Nrf2 pathway J. Cell. Mol. Med. 2023 27 3443 3450 10.1111/jcmm.17914 37644785 PMC10660613 69. Huimei H. Kangdi Z. Xiaoying X. Boyi L. Qiuxiong Y. Haizhou Z. Yupeng J. Zhao Z. Shengsuo M. Tao C. Saikosaponin B1/D alleviate dextran sulfate sodium- induced colitis via regulating the NRF2/HO-1 pathway to inhibit the ferroptosis in zebrafish Res. Sq. 2023 10.21203/rs.3.rs-3462559/v1 70. Bui T.T. Piao C.H. Hyeon E. Fan Y. Choi D.W. Jung S.Y. Jang B.H. Shin H.S. Song C.H. Chai O.H. Preventive Effect of Bupleurum chinense on Nasal Inflammation via Suppressing T Helper Type 2, Eosinophil and Mast Cell Activation Am. J. Chin. Med. 2019 47 405 421 10.1142/S0192415X19500204 30845812 71. Zou W. Zhang J. Li Z. Zhou Y. Zhou S. Liu G. A novel therapeutic approach for allergic rhinitis by exosome-mimetic nanovesicles derived from mesenchymal stem cells to restore nasal mucosal epithelial barrier Med. Hypotheses 2023 173 111046 10.1016/j.mehy.2023.111046 72. Yu J.I. Kim J.H. Nam K.E. Lee W. Rhee D.K. Pneumococcal Δpep27 Immunization Attenuates TLRs and NLRP3 Expression and Relieves Murine Ovalbumin-Induced Allergic Rhinitis J. Microbiol. Biotechnol. 2022 32 709 717 10.4014/jmb.2203.03006 35484967 PMC9628895 73. Zhang S. Fu Q. Wang S. Jin X. Tan J. Ding K. Zhang Q. Li X. Association between air pollution and the prevalence of allergic rhinitis in Chinese children: A systematic review and meta-analysis Allergy Asthma Proc. 2022 43 e47 e57 10.2500/aap.2022.43.220044 36065105 74. Wang H. Ji Q. Liao C. Tian L. A systematic review and meta-analysis of loratadine combined with montelukast for the treatment of allergic rhinitis Front. Pharmacol. 2023 14 1287320 10.3389/fphar.2023.1287320 37915414 PMC10616259 75. Upasana K. Sunil S. Meenakshi B. Levo Cetirizine—the Drug with Numerous Plus to Cure Allergic Syndrome Compared to other Treatment Systems Europe 2022 16 32 10.18579/jopcr/v21i4.MS221204 76. Le Berre C. Honap S. Peyrin-Biroulet L. Ulcerative colitis Lancet 2023 402 571 584 10.1016/S0140-6736(23)00966-2 37573077 77. Eom T. Kim Y.S. Choi C.H. Sadowsky M.J. Unno T. Current understanding of microbiota- and dietary-therapies for treating inflammatory bowel disease J. Microbiol. 2018 56 189 198 10.1007/s12275-018-8049-8 29492876 78. Levine J. McKibbin J. Ham R. Cohen-Mekelburg S. Bishu S. Tang K. Higgins P.D.R. Berinstein J.A. Use of Upadacitinib in 16 Tofacitinib-refractory Ulcerative Colitis Patients: A Single-center Case 2Series Inflamm. Bowel Dis. 2024 30 2232 2235 10.1093/ibd/izad279 38142124 PMC12102464 79. de Oliveira N.M.T. Schneider V.S. Bueno L.R. de Mello Braga L.L.V. da Silva K.S. Malaquias da Silva L.C. Souza M.L. da Luz B.B. Lima C.D. Bastos R.S. CPW partially attenuates DSS-induced ulcerative colitis in mice Food Res. Int. 2023 173 113334 10.1016/j.foodres.2023.113334 37803644 80. Li C. Tang Y. Ye Y. Zuo M. Lu Q. Potential of natural flavonols and flavanones in the treatment of ulcerative colitis Front. Pharmacol. 2023 14 1120616 10.3389/fphar.2023.1120616 36937890 PMC10020211 81. Stockwell B.R. Jiang X. The Chemistry and Biology of Ferroptosis Cell Chem. Biol. 2020 27 365 375 10.1016/j.chembiol.2020.03.013 32294465 PMC7204503 82. Hu Y. Lyu C. Teng L. Wu A. Zhu Z. He Y. Lu J. Glycopolypeptide hydrogels with adjustable enzyme-triggered degradation: A novel proteoglycans analogue to repair articular-cartilage defects Mater. Today Bio 2023 20 100659 10.1016/j.mtbio.2023.100659 37229212 PMC10205498 83. Tee C.A. Han J. Hui J.H.P. Lee E.H. Yang Z. Perspective in Achieving Stratified Articular Cartilage Repair Using Zonal Chondrocytes Tissue Eng. Part B Rev. 2023 29 310 330 10.1089/ten.teb.2022.0142 36416231 84. Ashraf A. Imran M. Causes, types, etiological agents, prevalence, diagnosis, treatment, prevention, effects on human health and future aspects of bovine mastitis Anim. Health Res. Rev. 2020 21 36 49 10.1017/S1466252319000094 32051050 85. Dean J. Keshavan M. The neurobiology of depression: An integrated view Asian J. Psychiatr. 2017 27 101 111 10.1016/j.ajp.2017.01.025 28558878 86. Dong T. Yu C. Mao Q. Han F. Yang Z. Yang Z. Pires N. Wei X. Jing W. Lin Q. Advances in biosensors for major depressive disorder diagnostic biomarkers Biosens. Bioelectron. 2024 258 116291 10.1016/j.bios.2024.116291 38735080 87. Bschor T. Kilarski L.L. Are antidepressants effective? A debate on their efficacy for the treatment of major depression in adults Expert Rev. Neurother. 2016 16 367 374 10.1586/14737175.2016.1155985 26891111 88. Fagiolini A. Florea I. Loft H. Christensen M.C. Effectiveness of Vortioxetine on Emotional Blunting in Patients with Major Depressive Disorder with inadequate response to SSRI/SNRI treatment J. Affect. Disord. 2021 283 472 479 10.1016/j.jad.2020.11.106 33516560 89. Fajemiroye J.O. da Silva D.M. de Oliveira D.R. Costa E.A. Treatment of anxiety and depression: Medicinal plants in retrospect Fundam. Clin. Pharmacol. 2016 30 198 215 10.1111/fcp.12186 26851117 90. Chang B. Liu Y. Hu J. Tang Z. Qiu Z. Song Z. Jia A. Zhang Y. Bupleurum chinense DC improves CUMS-induced depressive symptoms in rats through upregulation of the cAMP/PKA/CREB signalling pathway J. Ethnopharmacol. 2022 289 115034 10.1016/j.jep.2022.115034 35092825 91. Sun X. Li X. Pan R. Xu Y. Wang Q. Song M. Total Saikosaponins of Bupleurum yinchowense BMC Complement. Altern. Med. 2018 18 117 10.1186/s12906-018-2186-9 29609584 PMC5879550 92. Gao T. Wang T. Wu L. Tong Y. Tian J. Zhao K. Wang H. Saikosaponin-d alleviates depression by promoting NLRP3 ubiquitination and inhibiting inflammasome activation Int. Immunopharmacol. 2024 127 111324 10.1016/j.intimp.2023.111324 38070467 93. Li H.Y. Zhao Y.H. Zeng M.J. Fang F. Li M. Qin T.T. Ye L.Y. Li H.W. Qu R. Ma S.P. Saikosaponin D relieves unpredictable chronic mild stress induced depressive-like behavior in rats: Involvement of HPA axis and hippocampal neurogenesis Psychopharmacology 2017 234 3385 3394 10.1007/s00213-017-4720-8 28875366 94. Tong Y. Zhao G. Shuang R. Wang H. Zeng N. Saikosaponin a activates tet1/dll3/notch1 signalling and promotes hippocampal neurogenesis to improve depression-like behavior in mice J. Ethnopharmacol. 2024 319 117289 10.1016/j.jep.2023.117289 37844745 95. Halaris A. Inflammation and depression but where does the inflammation come from? Curr. Opin. Psychiatry 2019 32 422 428 10.1097/YCO.0000000000000531 31192815 96. Gałecka M. Bliźniewska-Kowalska K. Orzechowska A. Szemraj J. Maes M. Berk M. Su K.P. Gałecki P. Inflammatory versus Anti-inflammatory Profiles in Major Depressive Disorders-The Role of IL-17, IL-21, IL-23, IL-35 and Foxp3 J. Pers. Med. 2021 11 66 10.3390/jpm11020066 33498653 PMC7911855 97. Bauer A.E. Wouk K. Grewen K. Gottfredson N.C. Meltzer-Brody S. Propper C. Mills-Koonce R. Pearson B. Whitley J. Stuebe A.M. 70: Prenatal depression and anxiety is associated with Hypothalamic Pituitary Adrenal (HPA) axis dysregulation—ScienceDirect Am. J. Obstet. Gynecol. 2020 222 S59 S60 10.1016/j.ajog.2019.11.086 98. Kanes S.J. Dennie L. Perera P. Targeting the Arginine Vasopressin V(1b) Receptor System and Stress Response in Depression and Other Neuropsychiatric Disorders Neuropsychiatr. Dis. Treat. 2023 19 811 828 10.2147/NDT.S402831 37077711 PMC10106826 99. Santiago E. Moreno D.F. Acar M. Modeling aging and its impact on cellular function and organismal behavior Exp. Gerontol. 2021 155 111577 10.1016/j.exger.2021.111577 34582969 PMC8560568 100. Li X. Li C. Zhang W. Wang Y. Qian P. Huang H. Inflammation and aging: Signaling pathways and intervention therapies Signal Transduct. Target. Ther. 2023 8 239 10.1038/s41392-023-01502-8 37291105 PMC10248351 101. Rodrigues L.P. Teixeira V.R. Alencar-Silva T. Simonassi-Paiva B. Pereira R.W. Pogue R. Carvalho J.L. Hallmarks of aging and immunosenescence: Connecting the dots Cytokine Growth Factor Rev. 2021 59 9 21 10.1016/j.cytogfr.2021.01.006 33551332 102. Kwon N. Kim D. Swamy K.M.K. Yoon J. Metal-coordinated fluorescent and luminescent probes for reactive oxygen species (ROS) and reactive nitrogen species (RNS) Coord. Chem. Rev. 2021 427 213581 10.1016/j.ccr.2020.213581 103. Tong H. Zheng X. Song J. Liu J. Ren T. Zhang X. Huang L. Wu M. Radical scavenging activity of sulfated Bupleurum chinense polysaccharides and their effects against oxidative stress-induced senescence Carbohydr. Polym. 2018 192 143 149 10.1016/j.carbpol.2018.03.061 29691006 104. Xu M. Sun S. Ge J. Shen Y. Li T. Sun X. Bupleurum chinense Polysaccharide Improves LPS-Induced Senescence of RAW264.7 Cells by Regulating the NF-κB Signaling Pathway Evid. Based Complement. Altern. Med. Ecam 2020 2020 7060812 10.1155/2020/7060812 PMC7787758 33456488 105. Desai A.J.B. 15-Pgdh Inhibition Alternatively Activates Macrophages to Promote Hematopoietic Function during Aging Blood 2023 142 5610 10.1182/blood-2023-174704 106. Kundap U.P. Paudel Y.N. Shaikh M.F. Animal Models of Metabolic Epilepsy and Epilepsy Associated Metabolic Dysfunction: A Systematic Review Pharmaceuticals 2020 13 106 10.3390/ph13060106 32466498 PMC7345684 107. Li X. Liu Y. Wang S. Guan W. Pan J. Kuang H. Yang B. Identification and potential mechanism of different components from the aerial part of Bupleurum chinense DC. for epileptic treatment Nat. Prod. Res. 2022 36 6137 6142 10.1080/14786419.2022.2055557 35337224 108. Li X. Liu Y. Wang S. Jiang Y. Algradi A.M. Zhou Y. Pan J. Guan W. Kuang H. Yang B. The Aerial Parts of Bupleurum Chinense DC. Aromatic Oil Attenuate Kainic Acid-Induced Epilepsy-Like Behavior and Its Potential Mechanisms Biomed. Res. Int. 2022 2022 1234612 10.1155/2022/1234612 35445130 PMC9015862 109. Feng Y. Wei Z.H. Liu C. Li G.Y. Qiao X.Z. Gan Y.J. Zhang C.C. Deng Y.C. Genetic variations in GABA metabolism and epilepsy Seizure 2022 101 22 29 10.1016/j.seizure.2022.07.007 35850019 110. Choo B.K.M. Shaikh M.F. The Role of Neurotransmitters in Epileptogenesis: Focus on GABA and Glutamate Handbook of Neurodegenerative Disorders Springer Singapore 2023 111. Czapski G.A. Strosznajder J.B. Glutamate and GABA in Microglia-Neuron Cross-Talk in Alzheimer’s Disease Int. J. Mol. Sci. 2021 22 11677 10.3390/ijms222111677 34769106 PMC8584169 112. Kang Y. Gao Y. Li X. Guo X. Liu Z. Li W. Wei J. Qi Y. Bupleurum chinense exerts a mild antipyretic effect on LPS-induced pyrexia rats involving inhibition of peripheral TNF-α production J. Ethnopharmacol. 2023 310 116375 10.1016/j.jep.2023.116375 36934787 113. Neufeldt C.J. Cortese M. Acosta E.G. Bartenschlager R. Rewiring cellular networks by members of the Flaviviridae family Nat. Rev. Microbiol. 2018 16 125 142 10.1038/nrmicro.2017.170 29430005 PMC7097628 114. Torrents de la Peña A. Sliepen K. Eshun-Wilson L. Newby M.L. Allen J.D. Zon I. Koekkoek S. Chumbe A. Crispin M. Schinkel J. Structure of the hepatitis C virus E1E2 glycoprotein complex Science 2022 378 263 269 10.1126/science.abn9884 36264808 PMC10512783 115. Applegate T.L. Fajardo E. Sacks J.A. Hepatitis C Virus Diagnosis and the Holy Grail Infect. Dis. Clin. N. Am. 2018 32 425 445 10.1016/j.idc.2018.02.010 29778264 116. Heffernan A. Cooke G.S. Nayagam S. Thursz M. Hallett T.B. Scaling up prevention and treatment towards the elimination of hepatitis C: A global mathematical model Lancet 2019 393 1319 1329 10.1016/S0140-6736(18)32277-3 30704789 PMC6484702 117. Lee W.P. Lan K.L. Liao S.X. Huang Y.H. Hou M.C. Lan K.H. Antiviral effect of saikosaponin B2 in combination with daclatasvir on NS5A resistance-associated substitutions of hepatitis C virus J. Chin. Med. Assoc. 2019 82 368 374 10.1097/JCMA.0000000000000095 30920421 118. Jinwen X. Minglu L. Jintao W. Xingyu Z. Wei C. Guoping P. Hua H. Huayan L. Junping L. Sheng L. 2023 China Alzheimer’s disease: Facts and figures Hum. Brain 2023 2 1598 1695 10.37819/hb.3.1771 119. Kim E. Kim H. Jedrychowski M.P. Bakiasi G. Park J. Kruskop J. Choi Y. Kwak S.S. Quinti L. Kim D.Y. Irisin reduces amyloid-β by inducing the release of neprilysin from astrocytes following downregulation of ERK-STAT3 signaling Neuron 2023 111 3619 3633.e8 10.1016/j.neuron.2023.08.012 37689059 PMC10840702 120. Chen Z.H. Li J. Zhao X.X. Yang X.H. Li J. Zou B. Zang W.B. Ma R.X. Wang Y.F. Yao Y. Saikogenin F From Bupleurum smithii Ameliorates Learning and Memory Impairment via Antiinflammation Effect in an Alzheimer’s Disease Mouse Model Nat. Prod. Commun. 2022 17 1934578X221111029 10.1177/1934578X221111029 121. Huang Z.-H. Fang Y. Yu Q. Wang T. Network Pharmacology and Molecular Docking Analysis of the Mechanisms of Combined Radix Bupleuri (Chai-Hu) and Radix Paeoniae Alba (Bai-Shao) Treatment in the Prevention and Treatment of Alzheimer’s Disease World J. Tradit. Chin. Med. 2024 10 254 262 10.4103/2311-8571.372730 122. Chen Q. Zhou T. Yuan J.J. Xiong X.Y. Liu X.H. Qiu Z.M. Hu L.L. Lu H. He Q. Liu C. Metabolomics profiling to characterize cerebral ischemia-reperfusion injury in mice Front. Pharmacol. 2023 14 1091616 10.3389/fphar.2023.1091616 36814490 PMC9939521 123. Wang X. Yang G. Saikosaponin A attenuates neural injury caused by ischemia/reperfusion Transl. Neurosci. 2020 11 227 235 10.1515/tnsci-2020-0129 33335763 PMC7712316 124. Humaidy R.S. Subkhan M. Yuliyanasari N. Ambar N.S. Analysis of eosinophil and lymphocyte concentrations on the incidence of mild and severe acute asthma exacerbations Gac. Méd. Caracas 2021 129 10.47307/GMC.2021.129.s2.6 125. Inniss L.J. Independent prescribing for a child with a first diagnosis of asthma: A case study Emerg. Nurse 2023 31 10.7748/en.2022.e2148 36519393 126. Iordache A. Balica N.C. Horhat I.D. Morar R. Tischer A.A. Milcu A.I. Salavat M.C. Borugă V.M. A Review Regarding the Connections between Allergic Rhinitis and Asthma—Epidemiology, Diagnosis and Treatment Curr. Health Sci. J. 2023 49 5 18 10.12865/CHSJ.49.01.5 37780190 PMC10541080 127. Yin Y. Ruan G. Su Q. Li L. Zheng N. Hong Y. Therapeutic effect of saikosaponin-d on airway allergy in asthma Mater. Express 2024 14 370 375 10.1166/mex.2024.2679 128. Bui T.T. Piao C.H. Song C.H. Shin H.S. Chai O.H. Bupleurum chinense extract ameliorates an OVA-induced murine allergic asthma through the reduction of the Th2 and Th17 cytokines production by inactivation of NFκB pathway Biomed. Pharmacother. 2017 91 1085 1095 10.1016/j.biopha.2017.04.133 28531919 129. Bergmark B.A. Mathenge N. Merlini P.A. Lawrence-Wright M.B. Giugliano R.P. Acute coronary syndromes Lancet 2022 399 1347 1358 10.1016/S0140-6736(21)02391-6 35367005 PMC8970581 130. Șoșdean R. Dănilă M.D. Ionică L.N. Pescariu A.S. Mircea M. Ionac A. Mornoș C. Luca C.T. Feier H.B. Muntean D.M. Monoamine Oxidase Contributes to Valvular Oxidative Stress: A Prospective Observational Pilot Study in Patients with Severe Mitral Regurgitation Int. J. Mol. Sci. 2024 25 10307 10.3390/ijms251910307 39408637 PMC11477003 131. Gong J. Liu X. Ouyang W. Zhu H. Ding X.-J. Tang J. Zhao J. Zhang Y.M. Effect of polysaccharide from the root of Bupleurum Chinese DC and Bupleurum scorzonerifolium Willd on hydrogen peroxide-induced myocardial apoptosis Trop. J. Pharm. Res. 2020 19 291 297 10.4314/tjpr.v19i2.11 132. Zhao Y. Wang Y.J. Zhao R.Z. Xiang F.J. Vinegar amount in the process affected the components of vinegar-baked Radix Bupleuri and its hepatoprotective effect BMC Complement. Altern. Med. 2016 16 346 10.1186/s12906-016-1333-4 27599678 PMC5011866 133. Wang Y. Li L. Cheng Y.M. Zhu S.L.J. Xiao Chai Hu Tang for Liver Diseases: A Literature Review World J. Tradit. Chin. Med. 2017 3 46 50 10.15806/j.issn.2311-8571.2016.0041 134. Gevrenova R. Kondeva-Burdina M. Denkov N. Zheleva-Dimitrova D. Flavonoid profiles of three Bupleurum species and in vitro hepatoprotective of activity Bupleurum flavum Forsk Pharmacogn. Mag. 2015 11 14 23 10.4103/0973-1296.149680 25709205 PMC4329614 135. Zhang K. Lin L. Zhu Y. Zhang N. Zhou M. Li Y. Saikosaponin d Alleviates Liver Fibrosis by Negatively Regulating the ROS/NLRP3 Inflammasome Through Activating the ERβ Pathway Front. Pharmacol. 2022 13 894981 10.3389/fphar.2022.894981 35694250 PMC9174603 136. Jeyanthi K.A. Determining the Effect of Cassia fistula (L) Flower Extract on Antioxidant Defense in Streptozotocin Induced Diabetic Rats Chall. Adv. Pharm. Res. 2022 8 71 78 10.9734/bpi/capr/v8/3528C 137. Deshpande J. Jadhao P.R. Ultrasound Guided Femorosciatic Block for Diabetic Foot Ulcer in a Psychiatric Patient with Sepsis, Anaemia and Coagulation Defect Arch. Anesth. Crit. Care 2022 8 10.18502/aacc.v8i4.10184 138. Yan D. Song Y. Zhang B. Cao G. Zhou H. Li H. Sun H. Deng M. Qiu Y. Yi W. Progress and application of adipose-derived stem cells in the treatment of diabetes and its complications Stem Cell Res. Ther. 2024 15 3 10.1186/s13287-023-03620-0 38167106 PMC10763319 139. Jakhar K. Vaishnavi S. Kaur P. Singh P. Munshi A. Pharmacogenomics of GLP-1 receptor agonists: Focus on pharmacological profile Eur. J. Pharmacol. 2022 936 175356 10.1016/j.ejphar.2022.175356 36330902 140. Kaur P. Behera B.S. Singh S. Munshi A. “The pharmacological profile of SGLT2 inhibitors: Focus on mechanistic aspects and pharmacogenomics” Eur. J. Pharmacol. 2021 904 174169 10.1016/j.ejphar.2021.174169 33984301 141. Pan L. Weng H. Li H. Liu Z. Xu Y. Zhou C. Lu X. Su X. Zhang Y. Chen D. Therapeutic Effects of Bupleurum Polysaccharides in Streptozotocin Induced Diabetic Mice PLoS ONE 2015 10 e0133212 10.1371/journal.pone.0133212 26176625 PMC4503743 142. Yu X. Pan J. Shen N. Zhang H. Zou L. Miao H. Xing L. Development of Saikosaponin D Liposome Nanocarrier with Increased Hepatoprotective Effect Against Alcoholic Hepatitis Mice J. Biomed. Nanotechnol. 2021 17 627 639 10.1166/jbn.2021.3054 35057889 Figure 2 Pharmacological Effects of Bupleurum Bupleurum Figure 3 Anti-tumor Effects of Bupleurum Bupleurum ",
  "metadata": {
    "Title of this paper": "Development of Saikosaponin D Liposome Nanocarrier with Increased Hepatoprotective Effect Against Alcoholic Hepatitis Mice",
    "Journal it was published in:": "Pharmaceuticals",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12473030/"
  }
}