{
  "title": "Paper_277",
  "abstract": "pmc Adv Nutr Adv Nutr 1420 advannut Advances in Nutrition 2161-8313 2156-5376 American Society for Nutrition PMC12489516 PMC12489516.1 12489516 12489516 40706958 10.1016/j.advnut.2025.100485 S2161-8313(25)00121-8 100485 1 Review Nutrition Interventions in the Treatment of Gastrointestinal Symptoms during Cancer Therapy: A Systematic Review and Meta-analysis Alzoubi Zainab 1 Loman Brett R bloman2@illinois.edu 1 2 3 4 ⁎ 1 2 3 4 ⁎ bloman2@illinois.edu 9 2025 22 7 2025 16 9 494983 100485 26 3 2025 26 6 2025 14 7 2025 22 07 2025 03 10 2025 03 10 2025 © 2025 The Authors 2025 https://creativecommons.org/licenses/by/4.0/ This is an open access article under the CC BY license (http://creativecommons.org/licenses/by/4.0/). Modern cancer therapy is effective at reducing tumor burden and extending lifespan. However, cancer therapy also induces various gastrointestinal (GI) side-effects that are dose-limiting, reduce quality of life, and potentially lead to treatment failure. Standard medical nutrition therapy for patients undergoing cancer treatment focuses on preventing weight loss and malnutrition but not reducing GI symptoms. Therefore, the objective of this study was to assess efficacy of nutrition therapy to reduce GI side-effects during cancer treatment via systematic review and meta-analysis. A systematic search was conducted in Scopus and PubMed databases. A meta-analysis was performed on articles meeting inclusion criteria to estimate the pooled effect size on GI symptoms, separated by nutrition intervention type (nutrient supplementation, oral nutrition supplement, or dietary counseling). Further subgroup analyses were conducted based on cancer type, cancer therapy, and nutrient intervention. All statistical analyses were performed in Stata/MP version 17.0 using 2-sided tests with P P P This study was register at PROSPERO as 549116. Keywords chemotherapy radiation surgery dietary counseling diarrhea pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement yes pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes Abbreviations CI confidence interval DC dietary counseling FODMAP fermentable, oligosaccharide, disaccharides, monosaccharides and polyols GI gastrointestinal MNT medical nutrition therapy No. number ONS oral nutrition supplementation PICOS Population, Intervention, Comparator, Outcome, Study design ORR odds risk ratio  Statement of significance Gastrointestinal (GI) symptoms are extremely prevalent and burdensome for patients undergoing cancer treatment. Although the main concern of cancer therapy is to diminish cancer progression and recurrence, GI symptoms are often overlooked. Nutrition recommendations to patients undergoing cancer treatment generally target malnutrition without consideration for GI responses that can undermine these goals. This review encompasses oral nutrition interventions and their effect on specific GI symptoms that decrease patient quality of life and can serve as a basis for development of advanced medical nutrition therapy guidelines for clinicians providing cancer therapy. Introduction Cancer treatment induces multiple gastrointestinal (GI) side-effects, with ∼81% of patients experiencing symptoms at some point during their treatment [ 1 2 [1] [2] [3] 3 4 [5] [6] [7] 8 By comparison, medical nutrition therapy (MNT) can be a more affordable and personalized solution [ 7 9 10 11 Several MNT strategies can be implemented to reduce incidence of GI symptoms; common approaches include direct nutrient supplementation, provision of oral nutrition supplements (ONS), and dietary counseling. Supplementation of specific nutrients is the most common approach, which entails directing the patient to consume specific foods or supplements to modulate nutrient-related metabolic pathways and GI motility. This approach can be tailored to a patient’s symptoms and preferences without drastically changing their overall diet [ 12 13 13 14 15 Previous systematic reviews have explored very specific intersections of MNT, cancer treatments, and aspects surrounding GI symptoms. Systematic reviews by Allenby et al. [ 16 14 17 18 19 20 21 Methods The PRISMA guidelines were used to ensure transparent reporting of the scientific evidence related to nutritional therapies investigated for relieving GI symptoms during cancer therapy [ 22 Study selection criteria The selection of an adequate search algorithm was adapted according to the medical subject heading (MeSH) terms implemented in PubMed on 1 January, 2024. A keyword search was performed in PubMed and Scopus through all years <2024 ( Supplemental Tables 1 and 2 1 2 3 23 Full-text screening evaluated articles against the study selection criteria. Studies that met all of the following criteria were included in the review—study design: randomized, controlled clinical trial, study participants: patients receiving cancer treatment with concurrent nutrition intervention; main outcome: GI symptom incidence or severity; article type: peer-reviewed publication; and language: English. Population, Intervention, Comparator, Outcome, Study design criteria were used to define the research question for the systematic review ( Table 1 Table 2 [24] [25] [26] [27] [28] [29] [30] [31] [32] [33] [34] [35] [36] [37] [38] [39] [40] [41] [42] [43] [44] [45] [46] [47] [48] [49] [50] [51] [52] [53] [54] [55] [56] [57] [58] [59] [60] [61] [62] [63] [64] [65] [66] [67] [68] [69] [70] [71] [72] [73] [74] [75] [76] [77] [78] [79] [80] [81] [82] [83] [84] [85] [86] [87] [88] [89] [90] [91] [92] [93] [94] [95] [96] [97] [98] [99] [100] [101] [102] [103] [104] [105] [106] [107] [108] [109] [110] [111] [112] [113] [114] [115] [116] [117] [118] [119] [120] [121] [122] [123] [124] [125] [126] [127] [128] [129] [130] [131] [132] [133] [134] [135] [136] [137] [138] [139] [140] [141] [142] [143] [144] [145] [146] [147] [148] [149] [150] [151] [152] [153] [154] [155] [156] [157] [158] [159] [160] [161] [162] TABLE 1 PICOS criteria for inclusion and exclusion of studies. TABLE 1 Criteria Inclusion criteria Exclusion criteria Population Male and female patients of any age with cancer receiving ≥1 of the following cancer treatments: chemotherapy, radiation, immunotherapy, surgical resection, transplant, hormone therapy, stem cell transplant, or a combination Patients in cancer remission, patients not receiving cancer therapy Intervention Oral nutrition or nutrition education Pharmacological treatment, acupuncture, exercise, physical therapy, psychological therapy, complex combinations of Chinese herbs Comparison Compared with independent control group: placebo, isocaloric nutrition, standard of care, no treatment Crossover design, comparison to own baseline values, no control group Outcome Changes to GI symptoms after intervention No reported values for GI symptoms Study design Any randomized, controlled, clinical trial Nonoriginal study or case report, crossover, non–peer reviewed article, nonrandomized trial Abbreviation: GI, gastrointestinal. TABLE 2 Basic characteristics of studies included in the review in chronological order split by treatment type. TABLE 2 References Cancer Type Cancer Treatment Treatment Type Age, y; Sex distribution Study Design Country Nutrition Dose, Frequency, Duration Gastrointestinal Symptom/Measurement/Effect Sample Size Smit et al. [ 31 Malignant Melanoma Chemotherapy ONS 43.6±12.1; M:47.1% F:52.9% Controlled Trial Netherlands 4000kcal Pepti-2000 Diarrhea incidence WHO (NE) Int=9 (N=17) Daily 3 weeks Ravasco et al. [ 25 Colorectal Cancer Radiotherapy ONS 59 ± 15; M: 59.5% F: 40.5% Prospective, Randomized, Controlled Trial Portugal 2 cans of 20g protein total of 200kcal Anorexia incidence PG-SGA (-); Diarrhea incidence PG-SGA (-) Int=37 (N=74) Daily 3 months Ravasco et al. [ 24 Head And Neck Cancer Radiotherapy ONS 60 ± 11; M: 80.0% F:20.0% Prospective, Randomized, Controlled Trial Portugal 2 cans of 20g protein total of 200kcal Anorexia incidence (-) Int = 25 (N=50) Daily 3 months Giger-Pabst et al. [ 27 Gastrointestinal Cancer Surgery: Abdomen ONS (64.1 ± 12.7); M: 61.1% F:38.9% Prospective, Randomized, Double-Blind, Placebo-Controlled Study Switzerland 750mL IEF ONS Diarrhea Incidence (NE) Int=55 (N=108) Daily 3 Days Jiang et al. [ 29 Nasopharyngeal Cance Chemotherapy: Docetaxel And Cisplatin Radiation ONS 47.44±11.0; M:69.0% F: 31.0% Single-Center, Prospective, Randomized China 100g EnterNutr Nausea Incidence CTCAE (NE), Mucositis Incidence CTCAE (NE) Int=50 (N=100) Daily 6 weeks Harada et al. [ 28 Oral Cancer Chemotherapy ONS 40-92; M: 70% F:30% Prospective Study Japan 1 bottle ELental Mucositis Incidence (-) Int=25 (N=50) Daily 7 weeks Toyomasu et al. [ 32 Gastric Cancer Chemotherapy ONS 67.8; M:77.3% F:22.7% Prospective Pilot Study Japan 1 bottle Elental Mucositis incidence CTCAE (-); Nause incidence/severity CTCAE (NE); Anorexia severity CTCAE (NE); Diarrhea incidence/severity CTCAE (NE) Int=11 (N=22) Daily 28 Days Filipp et al. [ 26 Myeloma And Lymphoma Chemotherapy And Stem Cell Transplant ONS (25-77); M: 74.7% F:25.3% Prospective, Double Blinded, 2-Arm Randomized Multi-Center Study USA 8oz Enterade Diarrhea incidence/severity CTCAE (NE); Nausea incidence/severity CTCAE (NE) Int=58 (N=114) 2x/Day 2 weeks Katada et al. [ 30 Esophageal Cancer Chemotherapy: Cisplatin, 5-Fluorouracil, Docetaxel ONS 67.22±4.91 ; M:83.1% F:16.9% Randomized Study Japan 160g ELENTAL diet Mucositis, vomiting, and constipation Incidence CTCAE (NE) Anorexia, diarrhea, nausea incidence/severity CTCAE (NE) Int=36 (N=71) Daily 9 weeks Sittitrai et al. [ 162 Head And Neck Cancer Surgery DC 56.2±9.3; M:65.5% F: 34.5% A Randomized Controlled Trial Thailand Immune enhanced diet Vomiting incidence (NE); Nausea incidence (NE) Int=60(N=116) 7 weeks Bye et al. [ 34 Gynecological Malignancies Radiation DC 53.12±12.24; F:100.0% Prospective Clinical Trial Norway 40g fat Nausea, Diarrhea, and Anorexia incidence (NE) Int=71(N=141) 15g Lactose Daily 6 weeks Ravasco et al. [ 25 Colorectal Cancer Radiotherapy DC 58 ± 15; M: 59.5% F: 40.5% Prospective, Randomized, Controlled Trial Portugal Counseling Anorexia and Diarrhea incidence PG-SGA (-) Int=37 (N=74) Ravasco et al. [ 24 Head And Neck Cancer Radiotherapy DC 60 ± 11; M: 80.0% F:20.0% Prospective, Randomized, Controlled Trial Portugal Counseling Anorexia incidence (-) Int = 25 (N=50) Soto-Lugo et al. [ 35 Gynecological Cancer Surgery: Hysterectomy DC 44.5; F: 100.0% Single-Center, Randomized, Prospective Trial Mexico Low-FODMAP until end of radiation Diarrhea, Constipation, Nausea, and Vomiting EORTC QLQ C-30 (NE) Int=46 (N=89) Chemotherapy: Cisplatin Radiotherapy: External Beam Abdollahi et al. [ 33 Breast Cancer Chemotherapy DC 46.44 ± 10.71; F: 100.0% Single-Center, Single-Controlled, And Randomized Trial Iran Diet modification: Diarrhea, Constipation, Nausea, Vomiting, and Anorexia incidence ROM-III (-) Int=73 (N=150) 12–15% protein 30–35% fat 55–60% carbohydrates and nutrition education 1x/week 10 weeks Souza et al. [ 36 Breast Cancer Chemotherapy DC 44.94±8.95; F: 100.0% A Randomized Clinical Trial Brazil 30 kcal/kg/day total + 1.5 g/kg/day of protein Constipation, Diarrhea, Nausea, and Vomiting frequency EORTC QLQ (NE) Int=19 (N=34) - for 42 days Constipation, Diarrhea, Nausea, and Vomiting frequency EORTC QLQ (NE) - for 63 days Constipation, Diarrhea, Nausea, and Vomiting frequency EORTC QLQ (NE) - for 21 days Salminen et al. [ 139 Gynecological Cancer Radiotherapy NS 40-75; F: 100.0% Pilot Clinical Trial Finland 2 × 109 Lactobacillus Acidophilus Diarrhea, Incidence (-); Anorexia Incidence (NE); Int=11 (N=21) Daily 15 days Bozzetti et al. [ 48 Breast Cancer Chemotherapy: Leucovorin NS 73.5; F: 100% DoubleBlinded Randomized Study Italy 10g Glutamine Diarrhea, Incidence NCI (NE) Int=33 (N=65) 3x/Day 2 months Mahajan and Singh [ 114 Cancer: Variable Radiotherapy NS 5-90; M:30.8% F: 69.2% Randomized Prospective Study India 100mg Vitamin B6 Anorexia, Vomiting, and Nausea Incidence (NE) Int=52 (N=104) Daily 7 days Coghlin Dickson et al. [ 57 Leukemia And Lymphoma Transplant: Bone Marrow NS 42.88±11.4; M:55.2% F: 44.8% Prospective, Randomized, Double-Blinded Study USA 30g Glutamine Daily Mucositis incidence (NE) Int=29(N=58) 28 days Huang et al. [ 85 Head And Neck Cancer Radiation NS 51.2 ± 10.4; M: 76.5% F: 23.5% Pilot Randomized Trial Taiwan 16g L-glutamine in saline (30mL) gargled for 3 min/day until 25th fraction of radiotherapy Mucositis incidence/severity WHO (NE) Int=8 (N=17) Daniele et al. [ 59 Colon Cancer Chemotherapy NS 35-76; M:58.1% F: 41.9% A Double Blind, Two Arm, Parallel, Randomized Controlled Trial Italy 6g Glutamine 3x/day Diarrhea Incidence (NE) Int=29 (N=62) 15 days Asao et al. [ 43 Colorectal Cancer Surgery: Colon NS 59.6 ± 7.7; M: 68.4% F: 31.6% Randomized Controlled Trial Japan 1x Gum Flatus Latency (h) (–); Defecation Latency (h) (–) Int= 10 (N=19) 3x/day Passage of first flatus Kokkonen et al. [ 100 Cancer: Variable Chemotherapy NS 8.2±4.8; M: 50.0% F:50.0% Prospective And Randomized Study Finland Vitamin A Diarrhea, Constipation, Nausea, and Abdominal pain, incidence (NE) Int=10 (N=20) -10mg/kg 3 weeks -5mg/kg 3 weeks Ferreira et al. [ 72 Oral Cavity And Oropharynx Cancer Irradiation NS 55.38±12.08; M: 88.9% F: 11.1% Double-Blind Randomized Trial Brazil 400mg ɑ-tocopherol Mucositis incidence (-); Nausea and Vomiting Incidence (NE) Int=28 (N=54) Daily 7 weeks Sieja and Talerczyk [ 144 Ovarian Cancer Chemotherapy NS 51.05±12.75; F: 100.0% Randomized And Double-Blind Poland 100ug Selenium Nausea, Vomiting, Abdominal Pain, Anorexia, Flatulence, and Mucositis Severity (-); Diarrhea Severity (NE) Int=31 (N=62) 4x/day 3 months Hirayama et al. [ 82 Colorectal Cancer Surgery: Colon NS 58.5 ± 13.9; M: 54.2% F: 45.8% Randomized Controlled Trial Japan 30 min gum chewing sessions Defecation Latency (h) (–); Flatus Latency (h) (–) Int=10 (N=24) 3x/day Until passage of first flatus Li et al. [ 108 Breast Cancer Chemotherapy NS 51.35±6.58; F: 100.0% A Prospective Randomized trial China 30g Glutamine Mucositis and diarrhea Incidence, NCI (NE) Int=30 (N=60) Daily 12 days Lin et al. [ 109 Head And Neck Cancer Radiotherapy NS 50.5±11; M: 85.6% F:14.4% Double Blind Randomized Study Taiwan 25mg Zinc 3x/day Mucositis Severity RTOG (-) Int=50 (N=100) 2 months Mücke et al. [ 124 Gynecological Cancer Radiation NS 30-84; F: 100.0% Prospective Randomized Observational Study Germany Sodium selenite: Diarrhea incidence CTC (-) Int=37 (N=77) -500ug day during radiation -300ug day without radiation Daily 5 weeks Quah et al. [ 130 Colon And Rectal Cancer Surgery: Colectomy NS 67.5 ± 9.78; M: 65.8% F: 34.2% Prospective Randomized Trial United Kingdom 5min gum chewing Flatus Latency (h) (NE); Defecation Latency (h) (NE) Int= 19 (N=38) 3x/day Resumed solid diet Choi et al. [ 56 Cancer: Variable Chemotherapy: 5-Fluorouracil And Leucovorin NS 25-67 M: 65.0% F: 35.0% Open Label Study Korea 10g glutamine 3x/day Mucositits incidence (-) Int=22 (N=51) 15 days de Luis et al. [ 62 Oral And Laryngeal Cancer Surgery: Head And Neck NS 61.8±13.3; M: 90.3% F:9.7% Prospective Randomized Trial Spain 17g Arginine Diarrhea, incidence (NE) Int=35 (N=75) Daily 16 days Delia et al. [ 63 Sigmoid, Rectal, Cervical Cancer Postoperative Radiation Therapy NS - Double-Blind, Placebo-Controlled Trial Italy 450 billion/g lyophilized bacteria Diarrhea incidence (-) Defecation Frequency (-) Int=243 (N=482) Daily Unit end of radiation Gandemer et al. [ 74 Cancer: Variable Chemotherapy NS (5.2-18.7); M:64.0% F:36.0% Multicenter Randomized Trial France 20 min gum chewing Mucositis incidence with intensive chemotherapy (-), non-intensive chemotherapy (NE) Int=70(N=140) 5x/day 3 weeks Giralt et al. [ 78 Gynecological Cancer Radiation: Pelvis NS 60.15 ±12.33; F:100.0% Multicenter, Randomized, Placebo-Controlled Nutritional Trial Spain 96 mL liquid yogurt of 108 CFU/g probiotic administered for 5 min 3x/Day Diarrhea incidence (NE) Int=44(N=85) 6 weeks Strasser et al. [ 148 Cancer: Variable Chemotherapy NS 40-83; F: 68.3% M: 31.7% Single-Center, Randomized, Double-Blind, Placebo Controlled, Two-Arm, Parallel Study Switzerland 39g Glutamine Nausea incidence (+); Anorexia, Vomiting, and Diarrhea Incidence CTCAE NCI (NE) Int=21 (N=41) Daily 4 weeks Rashad et al. [ 132 Head And Neck Cancer Radio Chemotherapy NS 48.2 ± 15.64; M: 77.5% F: 22.5% Randomized Controlled Trial Egypt 20mL honey 3x/day Mucositis WHO (-) Int=20 (N=40) 5 weeks You et al. [ 156 Head And Neck Cancer Radiotherapy NS 57.098 ±11.4765; M:90.0% F: 10.0% Randomized Placebo Controlled Clinical Trial Taiwan 0.5g Indirubin Mucositis and Anorexia Incidence and Severity CTCAE NCI (-) Int=11 (N=20) Daily 7 weeks Chitapanarux et al. [ 54 Cervical Cancer Radiotherapy [Pelvis] + Chemotherapy: Cisplatin (40mg/M2) NS (18-65); F: 100.0% Double Blind Study Thailand 250mg Lactobacillus Diarrhea Incidence NCI CTC (-) Int=32 (N=63) 2x/day 7 weeks Li et al. [ 106 Seminoma, Lymphoma Radiotherapy, Abdomen, NS 47.6; M: 66.7% F: 33.3% Randomized Clinical Trial China 300mg berberine 3x/Day Vomiting and Diarrhea Incidence (-) Int= 18 (N=36) 1 week Li et al. [ 106 Cervical Cancer Radiotherapy, Abdomen, NS 54.5; M: 0% F: 100% Randomized Clinical Trial China 300mg Berberine Vomiting and Diarrhea Incidence (-) Int=21 (N=42) 3x/Day 2 weeks Mokhtar et al. [ 122 Hematological Malignancies Chemotherapy: Vincristine NS 7.10±4.03; M: 71.3% F:28.7% Pilot Study Egypt 1.5g Glutamic acid Constipation Incidence (NE) Int= 54 (N=94) Daily 4 weeks Ikeguchi et al. [ 87 Colorectal Cancer Chemotherapy Variable NS 70.45±8.17; M: 65.0% F: 35.0% - Japan 4.05g Fucoidan Nausea, Diarrhea, and Mucositis incidence (NE) Int=10 (N=20) Daily 6 months Liu et al. [ 112 Colorectal Cancer Surgery: Colectomy NS 65.5± 10.45; M: 59.0% F: 41.0% A Double-Blind Study China 2g of 2.6 x 1014 CFU Probiotics Defecation Latency (h) (-); Diarrhea incidence (-) Int=50 (N=100) Daily 16 days Pillai et al. [ 129 Bone Sarcoma Chemotherapy NS 8-21; M: 66.7% F:33.3% Randomized Controlled Study India 1,000-2,000mg depending on patient weight of ginger Nausea and vomiting incidence/ severity (-) Int=30 (N=60) Daily 10 Days Mansouri et al. [ 117 Unknown High Dose Chemotherapy; Hematopoietic Stem Cell Transplant NS 29; M:66.7% F:33.3% Double Blind Randomized Study Iran 220 mg Zinc Sulfate Mucositis Incidence / Severity WHO (NE) Int=30 (N=60) 2x/day 3 weeks Panahi et al. [ 127 Breast Cancer Chemotherapy NS 51.83 ± 9.18; F: 100.0% Pilot, Randomized, Open-Labeled, Clinical Trial Iran 0.5g Ginger 3x/day Nausea Incidence (NE) Int=37 (N=78) 4 days Rohr et al. [ 136 Cancer: Variable Radiation Therapy NS 52.36±13.66; M:70.6% F:29.4% Randomized, Double-Blind, Placebo-Controlled, Early-Phase Trial. Germany 700 mg of soy isoflavones Anorexia and Diarrhea Incidence (-) Int=104 (N=168) Daily 3 months Sharma et al. [ 143 Head And Neck Cancer Chemotherapy NS 51.23±9.78; M:92.5% F:7.5% Randomized, Double-Blind, Single Center, Placebo-Controlled Study India 2x109 of Lactobacillus Brevis Mucositis Incidence and Severity, FACT-HN (-) Int=86 (N=153) 6x/Day 7 weeks Babaee et al. [ 45 Head And Neck Cancer Radiation NS 52.5; M: 50.0% F:50.0% Randomized Controlled Clinical Study Iran 20g Calendula Officinalis Mucositis Severity OMAS (-) Int=20 (N=40) Daily 7 weeks Ertas et al. [ 69 Gynecological Malignancies Surgery NS 54.05±10.69; F:100.0% Randomized Intervention Turkey 30 min gum sessions 3x/day Ileus Incidence (-); Flatus Latency (h) and Defecation Latency (h) (-) Int=74 (N=149) Until the use of antiemetic Hershman et al. [ 81 Breast Cancer Chemotherapy NS (26-80) F:100.0% Randomized Double-Blind Placebo-Controlled Trial USA 500mg Acetyl-L-Carnitine Nausea, and Vomiting Incidence/Severity (NE) Int=202 (n=396) 6x/day 24 months Jahangard-Rafsanjani et al. [ 91 Leukemia High Dose Chemotherapy And Hematopoietic Stem Cell Transplant NS 33.7; M: 77.8% F: 22.2% Randomized Clinical Trial Iran 20mcg Selenium 2x/day Mucositis Incidence/ Severity WHO (NE) Int=37 (N=54) Until 1 week post-transplant Kucuktulu et al. [ 102 Cancer: Variable Radiotherapy: Pelvis And Chemotherapy: 5-FU NS 65.5; M: 69.4% F:30.6% Intervention Study Turkey 15g Glutamine 3x/day Diarrhea Incidence (NE) Int=23 (N=36) 2 weeks Mahdavi et al. [ 115 Rectal Cancer Chemoradiotherapy NS 60.25 ± 15.99; M: 58.1% F: 41.9% Randomized Clinical Trial Iran 3g Linoleic Acid 4x/day Anorexia, Constipation, Nausea, and Vomiting Incidence EORTC QLQ-C30 (NE); Diarrhea Incidence EORTC QLQ-C30 (-) Int=15 (N=31) 6 weeks Sangthawan et al. [ 141 Head And Neck Cancer Radiation NS 61±12.5; M: 86.8% F: 13.2% Randomized, Double Blind, Placebo-Controlled Trial Thailand 500mg Zinc Mucositis Incidence (NE) Int=72 (N=144) 3x/day 5 weeks Valadares et al. [ 151 Breast Cancer Chemotherapy NS 51.1; F:100.0% A Randomized, Placebo-Controlled, Double-Blind Clinical Trial India 2.1g of Agaricus Sylvaticus NO P-values in publication Int=23 (N=46) Daily 6 months Chattopadhyay et al. [ 52 Head And Neck Cancer Chemoradiotherapy NS (57.8±14.6); M: 71.4% Prospective Randomized Study India 10g Glutamine Mucositis severity and Incidence (NE) Int= 35 (N=70) F: 28.6% Daily End of Treatment Choi et al. [ 55 Prostate Cancer Surgery: Prostatectomy NS 65.8 ± 7.01; M:100.0% Prospective Randomized Study Korea 30 min gum chewing sessions Ileus Incidence (NE) Int=18 (N=37) 3x/day Until the passage of flatus Demers et al. [ 64 Pelvic Cancer Radiation NS 61; M:74.7% F: 25.3% Prospective, Double Blinded Randomized Multi-Center Study USA 1.3 billion CFU probiotics Diarrhea Incidence WHO (NE) Int=58 (N=114) 2x/day Until End of Treatment Elkerm and Tawashi [ 68 Head And Neck Cancer Radiation Or Chemoradiotherapy NS 45.5; M: 55% F:45% Pilot Study Canada 2 g date palm pollen powder Daily Oral Pain Severity VAS (-); Mucositis Severity OMAS (-) Int=10 (N=200) 29 Days Law et al. [ 105 Breast Cancer Chemotherapy NS 50.2 ± 13.5 F: 100.0% Prospective Study Malaysia 10mL Virgin coconut oil 2x/Day Diarrhea, Constipation, and Anorexia Severity EORTC QLQ-C30 (NE) Int=30 (N=60) 5 cycles of chemo Sanchez-Lara et al. [ 140 Lung Cancer Chemotherapy NS 59.9±13.2; M: 46.7% F: 53.3% Randomized Trial Mexico 590 kcal EPA Anorexia Severity EORTC-QLQC30 (-); Diarrhea Severity EORTC-QLQC30 (NE) Int=46 (N=92) 2x/day -14 day -21 day Arslan and Ozdemir [ 42 Breast Cancer Chemotherapy NS (49-58) F: 100% Randomized, Controlled Trial Turkey 500mg Ginger Nausea, severity (-) Int=30 (N=60) 2x/day 3 days Dulskas et al. [ 159 Colorectal Cancer Surgery: Colon NS 65.3±9.20; M: 53.3% F: 46.7% Prospective, Single Center, Randomized Controlled Study Lithuania 8g Coffee Flatus Latency (h) (–), Defecation Latency (h) (+) Int=30 (N=90) 3x/day Until first passage of bowel movement Islambulchilar et al. [ 88 Leukemia Chemotherapy NS 19.2 ± 2.0; M: 56.3% F: 43.8% Double-Blind, Placebo-Controlled Trial Study Iran 1,000mg taurine twice 2x/day Anorexia Incidence (NE) Int=16 (N=32) 6 months Itoh et al. [ 89 Cervical Cancer Chemoradiotherapy NS (30-72); F:100.0% A Randomized, Double-Blind Pilot Trial Japan 1g Hydrolyzed Rice Bran Diarrhea and Nausea severity (NE) Int=7 (N=14) 3x/day 6 weeks Kobayashi et al. [ 99 Colorectal Cancer Surgery: Colon NS 67.22 ± 11.78; M: 60.4% F: 39.6% Randomized Clinical Trial Japan 5 min gum chewing 3x/day until passage of first flatus Flatus Latency (h) (NE); Defecation Latency (h) (NE) Int=21 (N=43) Liu et al. [ 111 Colon Cancer Surgery : Colectomy NS 62.86±17.19; M:52.2% vs 47.8% A Double-Center And Double-Blind Randomized Clinical Trial China 2g/day of 2.6 × 1014 CFU Probiotics for 16 days Defecation Latency (h) (-); Diarrhea incidence (-) Int=66 (N=134) Mego et al. [ 119 Colorectal Cancer Irinotecan NS 42-81; M:56.5% F: 43.5% A Randomized Double Blind, Placebo-Controlled Pilot Study Slovakia 3 capsules of 10 × 109 CFU probiotics Diarrhea and Bloating Incidence CTCAE (NE) Int=23 (N=46) Daily 12 weeks Eghbali et al. [ 67 Leukemia Chemotherapy NS 8.5 ± 2.5; M: 50.7% F:49.2% Single Center, Randomized, Controlled Trial Italy 30 min sessions of gum chewing Mucositis Incidence WHO (-) Int=65 (N=130) 6x/day 15 days Garcia-Peris et al. [ 75 Gynecological Cancer Radiation: Abdominal The Total Prescribed Dose Was 52.2 Gy. NS 60.3±11.8; F:100.0% A Randomized, Double-Blind, Placebo-Controlled Trial Spain 6g Fiber Defecation Frequency (NE) Int=20(N=38) Daily 4 weeks Jayalekshmi et al. [ 92 Head And Neck Cancer Radiotherapy NS Randomized Controlled Trial India 15mL topical honey Mucositis Incidence RTOG (-) Int=14 (N=28) Daily 6 weeks Mansouri-Tehrani et al. [ 118 Cancer: Variable Radiation NS (62 ± 14.8); M:67.4% F:32.6% A Randomized, Placebo-Controlled Study Iran 2 capsules LactoCareO Diarrhea Severity (-); Defecation frequency (-); Bloating Incidence (-) Int=22 (N=46) Daily for 4 weeks Mutluay Yayla et al. [ 125 Cancer: Variable Chemotherapy NS NA; M: 36.7% F: 63.3% Randomized Controlled Trial Turkey 30 s rinse of 15mL sage-tea-thyme hydrosol 4 times/day for 2 wk. Mucositis WHO (-) Int=30 (N=60) Tsuchiya et al. [ 150 Gastrointestinal Cancer Chemotherapy NS 63.3±8.6; M:60.3% F: 39.7% Prospective Randomized Trial Japan 700mg cystine + 280mg theanine Mucositis, Anorexia, Abdominal Pain, and Nausea incidence CTCAE (NE) Diarrhea Incidence CTCAE (-) Int=32 (N=63) Daily 35 Days Zou et al. [ 158 Leukemia Chemotherapy NS 45.8 ± 11.7; M: 55.0% F: 45.0% Randomized, Controlled Trial Taiwan 100g Sweet Potato Constipation incidence ROM III (-); Defecation Latency (h) (–) Int=57 (N=120) 2x/day Until 5-day post-chemo Bossi et al. [ 47 Lung, Head, And Neck Cancer Chemotherapy: Cisplatin (Single Dose >50 Mg/M2) NS 59.15 ±10.18 M: 65.6%, F:34.4% Randomized, Double-Blind, Placebo-Controlled, Multicenter Study Italy 160mg Ginger Nausea Incidence VAS (NE) Int=121 (N=244) Daily 673 days Faramarzi et al. [ 70 Rectal Cancer Chemoradiotherapy NS 60.2± 15.9; M: 58.1% F: 41.9% Randomized Clinical Trial Iran 1000mg capsules of 3g Conjugated Linoleic Acid Anorexia and Constipation Severity QLQ C-30 (NE); Diarrhea Severity QLQ C-30 (-) Int=16 (N=33) 4x/ day 6 weeks Ge et al. [ 76 Gastric Cancer Laparoscopic Surgery NS 63.1 ± 12.3; M: 60% F:40% Randomized Controlled Trial China 15 min gum chewing sessions Flatus Latency (h) (NE); Defecation Latency (h) (NE) Int =38 (N=75) 3 x/day 1 week Gholizadeh et al. [ 77 Leukemia Chemotherapy NS (31 ± 38.3); M: 61.4% F: 38.6% Double-Blind, Randomized, Placebo Controlled Iran 220mg Zinc Mucositis Incidence WHO (-) Int=70 (N=140) 3x/day 4 weeks Gungordük et al. [ 79 Gynecological Cancer Surgery: Hysterectomy NS 35.65 ± 8.45; F: 100.0% A Randomized Controlled Trial turkey 100g of coffee 3x/day Flatus Latency (h) (–); Defecation Latency (h) (–); Ileus Incidence (-) Int=58 (N=114) until time to first defecation Hashemipour et al. [ 80 Leukemia Or Breast Cancer Chemotherapy NS 37.8 ±3.5 vs 38.4±2.7; M: 38.3% F: 61.7% Double-Blind Randomized Clinical Trial Iran 2600mg Omega-3 Mucositis Incidence WHO (-); Oral Pain Severity (-) Int=30 (N=60) 2/day 3 weeks Kim et al. [ 97 Ovarian Cancer Chemotherapy NS 54.4±11.1; F:100.0% A Randomized, Double Blind, Placebo-Controlled Trial Korea 1000mg red ginseng Nausea Incidence CTCAE (NE) Int=15 (N=30) 2x/day 3 months Kooshyar et al. [ 101 Leukemia Chemotherapy NS 33±15.9; M: 60% F: 40% Double Blind Placebo-Controlled Trial Iran 250mg Quercetin 2x/day Mucositis Severity WHO (NE) Int=10 (N=20) Start to End of Chemotherapy Mocellin et al. [ 120 Gastrointestinal Cancer Chemotherapy NS 54; M:55.6% F: 44.4% A Triple Blind, Randomized Clinical Trial Brazil 1.55g DHA+EPA Anorexia and Constipation Severity EORTC-QLQ C-30 SD (-); Diarrhea Severity EORTC-QLQ C-30 SD (NE) Int=28 (N=56) 2x/day 9 weeks Motoori et al. [ 123 Esophageal Cancer Chemotherapy NS (63.9 ± 7.6); M: 91.8% F:8.2% Open-Labeled Randomized Prospective Clinical Trial In A Single Center Japan 1x 108 Diarrhea Incidence (-); Mucositis Incidence (NE) Int=30 (N=61) living Bifidobacterium breve strain Yakult (B. breve strain Yakult) and 1x 108 living Lactobacillus casei strain Shirota (L. casei strain Shirota)/g, and galacto-oligosaccharides Daily 6 weeks Zhao et al. [ 157 Gastric Cancer Surgery NS 64.54±10.9; M:51.7% F:48.3% Prospective Randomized-Controlled Trial. China 30g fiber Flatus Latency (h) (-); Abdominal pain Incidence (NE); Diarrhea incidence (-) Int=40 (N=80) Daily 4 Days Aghamohammadi et al. [ 37 Head And Neck Cancer Radiotherapy And Chemotherapy NS 61.02 ± 15.49; M: 71.2% F: 28.8% A Randomized Double-Blind Clinical Trial Iran 136mg zatarial multiflora 3x/day Mucositis Severity WHO (-); Oral Pain Severity VAS (-) Int=25 (N=52) 6 weeks Charalambous et al. [ 51 Head And Neck Cancer Radiation NS 61.53; M: 72.2% vs F: 27.8% Randomized Controlled Trial Cyprus 20mL thyme honey mixed in 100 mL water rinses for 15 min three times a day for 7 wk. Mucositis Severity RTOG (-) Int= 32 (N=64) de Loera-Rodríguez et al. [ 61 Cervical Cancer Chemotherapy And Radiotherapy NS 50.9±14.7; F:100.0% Randomized, Double-Blind, Controlled Trial Mexico 60g Symbiotics Diarrhea and Constipation Incidence Bristol stool form scale (NE); Nausea and Vomiting Incidence NIC (-) Int=35 (N=70) Daily - 4 weeks - 7 weeks Du et al. [ 65 Central Nervous System Cancer Craniospinal Irradiation NS (1.3-15.5); M:67.5% F:32.5% Intervention China 1 capsule Bacillus Licheniformis by ZSC Diarrhea, Nausea, Vomiting, and Abdominal Pain Incidence CTCAE (-) Int=80(N=160) 3x/Day End of Radiation Lages et al. [ 104 Head And Neck Cancer Surgery NS 60.5 ± 11.12; M: 80.6% F:19.4% Double-Blind, Randomized Trial Brazil 1×109 CFU, 6 g fructooligosaccharides Abdominal Pain Incidence (NE) Int=18 (N=36) 2x/Day 1 week Li et al. [ 107 Lung Cancer Cisplatin (Chemotherapy) NS 57.49±7.53; M: 71.4% F: 28.6% Randomized, Double-Blind, Placebo-Controlled Clinical Trial, China 0.5g Ginger Root Nausea and Vomiting Incidence (NE) Int=71 (N=140) 2x/day 5 days Lustberg et al. [ 113 Breast Cancer Aromatase Inhibitor NS 59.5 ± 8.1; F: 100.0% Randomized PlaceboControlled Pilot Trial USA 4.3g of omega 3 Bloating and Diarrhea Incidence (NE); Abdominal Pain, Flatulence, Nausea, and Vomiting Severity FACT-ES (NE) Int=22 (N=44) Daily 24 weeks Rambod et al. [ 131 Leukemia Chemotherapy NS 36.73 ± 15.66; M: 56.6% F:43.4% Randomized Controlled Trial Iran 50mg zinc sulfate Mucositis Severity (-) Int=36 (N=72) Daily 2 weeks Solís-Martínez et al. [ 146 Head And Neck Cancer Surgery NS 59±13.9; M:54.7% F: 45.3% Randomized Single-Blind Placebo-Controlled Clinical Trial Mexico 2g EPA Diarrhea and Anorexia Severity QLQ-C30 (NE) Int=32 (N=64) Radiotherapy Daily Chemotherapy 4 weeks Combined Xie et al. [ 155 Gastric Cancer Surgery NS 67.795±9.873; M: 47.9% F:52.1% Prospective Randomized Controlled Trial China Probiotics Diarrhea, incidence (-); Vomiting incidence (NE) Int=70 (N=140) 3x/day 1 wk post-treatement Aredes et al. [ 41 Cervical Cancer Chemotherapy NS 44.53 ± 8.73 F: 100.0% A Randomized, Triple-Blind, Clinical Trial Brazil 2.5 g ѡ-3 Anorexia and Nausea Incidence PGSGA (-), Vomiting, Diarrhea, and Constipation Incidence PGSGA (NE) Int=20 (N=40) Daily 45 days Camargo et al. [ 49 Gastrointestinal Cancer Chemotherapy NS (41-63); M: 52.9% F:47.1% Randomized, Triple-Blind, Placebo-Controlled Clinical Trial Brazil 1.55g ѡ-3 Constipation, Diarrhea, Nausea, Mucositis, and Anorexia Incidence CTCAE (NE), Int=26(N=51) 2x/day 9 weeks de la Rosa Oliva et al. [ 60 Breast Cancer Chemotherapy NS 50.1 ± 2.17; F: 100% Randomized, Controlled, Double-Blind Clinical Trial Mexico 2.4g omega-3 Nausea, Diarrhea, Vomiting, ad Mucositis Incidence (NE) Int=26 (N=52) Daily 6 months Huang et al. [ 84 Head And Neck Cancer Radiation NS 52.4 ± 9.8 ; M: 92.2% F: 7.81% Randomized, Double-Blind, And Controlled Clinical Trial. Taiwan 10g L-glutamine Mucositis severity CTCAE (-) Int=31 (N=64) Daily 2 weeks Jiang et al. [ 93 Nose And Pharynx Cancer Chemoradiotherapy NS 50.89 ± 10.05; M: 62.4% F: 37.6% Randomized, Double-Blind, Placebo, Controlled Trial Spain 3 capsules of probiotics Bifidobacterium longum, Lactobacillus lactis, and Enterococcus faecium from Shanghai Since Pharmaceutical Mucositis Incidence/Severity CTCAE (-) Int=58 (N=93) Daily 7 weeks Phutsisen et al. [ 128 Gynecological Cancer Surgery NS 54.6 ± 13.9; F: 100.0% Randomized Controlled Trial Thailand 3g Cassia Alata Ileus Incidence (NE) Int= 45 (N=90) Daily Until passage of first flatus Reyna-Figueroa et al. [ 134 Leukemia Chemotherapy NS 10.75; M:63.3% F:36.7% Randomized Pilot Study Mexico 5×109 CFU of lactobacillus rhamnosus Diarrhea Incidence (NE); Nausea and Constipation Incidence (-) Int=30(N=60) 2x/day for 1 week Tian et al. [ 160 Lung Cancer Chemotherapy NS 55.5± 8.6; M: 58.8% F: 41.2% Prospective Randomized Double Blind China 420 mg C. butyricum Nausea and Vomiting incidence CTCAE (NE); Diarrhea incidence CTCAE (-) Int=25 (N=51) 3x/day 3 weeks Anandhi et al. [ 40 Oral Cancer Radiotherapy And Chemotherapy: Cisplatin NS 56.75 ± 6.5; M: 16.7% F: 83.3% DoubleBlinded Randomized Controlled Study India 150mg zinc sulfate Mucositis Incidence Radiotherapy Oncology Group scoring criteria for acute radiation toxicity (-) Int=60 (N=120) Daily 6 weeks Jafarimanesh et al. [ 90 Breast Cancer Chemotherapy NS 10.65± 50.47; F: 100.0% Randomized Controlled Trial Iran 40 drops of peppermint in 20cc distilled water Nausea, Vomiting, and Anorexia Severity VAS (-) Int=42 (N=84) 8 hours Until Post-chemotherapy Kobayashi et al. [ 98 Colorectal Cancer Chemotherapy: Mfol-FOX6 NS 62.8 ± 2.2; M: 39.3% F:60.7% Prospective Randomized Trial Japan 700mg Cystine and 280mg Theanine Constipation, Diarrhea, and Nausea, Incidence CTCAE (NE); Flatus Latency (h) (NE) Int=14 (N=28) Daily 12 weeks Laali et al. [ 103 Head And Neck Cancer Radiotherapy NS 53.44; M:70.4% F: 29.6% Double Blind Placebo-Controlled Trial Iran 200mcg selenium Mucositis Incidence / Severity WHO (NE) Int=33 (N=67) 2x/Day Until end of radiotherapy Rathe et al. [ 133 Leukemia Chemotherapy NS 1-15; M: 51.6% F: 48.4% Randomized, Double-Blind, Placebo-Controlled Trial Denmark Bovine Colostrum g for body weight: Diarrhea Incidence/severity, Abdominal pain Incidence, and Mucositis Severity NCI-CTCAE (NE) Int=30 (N=62) -7.5g for 0-15kg -15g for 15.1-30kg -22.5g for 30.1-45kg -30g for >45kg Daily 29 days Soltani et al. [ 147 Head And Neck Cancer Radiation NS 56.47 ± 15.91; M: 68.2% F: 31.8% Randomized, Double Blind, Placebo Controlled Clinical Trial Iran 7.5 cc Plantago major Mucositis Severity WHO (-); Oral Pain Severity VAS (-) Int=22 (N=44) Daily 7 weeks Widjaja et al. [ 154 Leukemia Chemotherapy NS 6.09 ± 3.70; M: 64.6% F:35.4% Randomized Control Trial Indonesia 400mg/kg Glutamine Mucositis Severity WHO (-) Int=24 (N=48) Daily 14 Days Al-Taie and Koseoglu [ 39 Colon Cancer Chemotherapy: 5 Fluorouracil NS 50.57 ± 9.73; M: 51.7% F: 48.3% Prospective Randomized Controlled Study Turkey 10g glutamine suspension Mucositis Incidence WHO (-) Int=30 (N=60) 3x/Day 3 months Aziz et al. [ 44 Gastric Carcinoma Chemotherapy: FLOT NS Variable, M:52.4% F:47.6% Intervention Study Egypt 2 g ѡ-3 Diarrhea, Nausea, and Vomiting Incidence CTCAE (-) Int=21 (N=42) Daily 1 year Fukaya et al. [ 73 Esophageal Cancer Chemotherapy: Cisplatin, 5-Fluorouracil NS (44-77); M: 88.1% F: 11.9% Randomized Controlled Trial Japan 80mL Yakult + 100mL MILMIL-S + 15g Oligomate Daily Anorexia Incidence (-); Nausea, Vomiting, Diarrhea, Constipation, and Mucositis Incidence (NE) Int= 20 (N=42) 7 days post 2nd cycle chemotherapy Kia et al. [ 96 Head And Neck Cancer Chemotherapy NS NA; M: 56% F: 44% Randomized Clinical Trial Iran 80mg Curcumin 2x/Day Mucositis Severity WHO (-) Int=25 (N=50) 7 weeks Liu et al. [ 110 Gastric Cancer Surgery: Gastrectomy NS 58.70 ± 8.65; M: 71.4% F: 28.5% Randomized Controlled Trial China 5g green tea Flatus Latency (h) (–); Defecation Latency (h) (–) Int=38 (N=77) Daily Until Hospital discharge Oshvandi et al. [ 126 Cancer: Variable Chemotherapy NS 46.22±2.36; M: 53.2% F: 46.8% Randomized Controlled Trial Iran 2 min gargline of 7.5mL zinc chloride Mucositis Severity (-) Int=48 (N=96) 2x/Day 3 weeks Rodríguez-Padilla et al. [ 135 Colorectal Cancer Surgery: Ileostomy NS 41-81; M: 69.6% F: 30.4% Conducted A Prospective, Randomized, Multicenter, Double-Blind Experimental Study Spain 4.5 × 1011 probiotics Ileus incidence (NE) Int=34 (N=69) Daily 3 days Rosli et al. [ 137 Pelvic Cancer Radiation Therapy NS 56.2 ± 10.93; M:26.7% F: 73.3% Randomized Controlled Trial Malaysia 10g PHGG Diarrhea frequency (days) (+); Diarrhea NCI-CTC grade (NE); Diarrhea Bristol stool chart grade (NE) Int=11 (N=23) Daily 28 Days Carr et al. [ 50 Hematopoietic Malignancies Chemotherapy + Stem Cell Transplant [No Dose Description] NS (41-64); M:60.0% F:40.0% Double-Blind Randomized, Placebo-Controlled Feasibility And Pilot Study New Zealand 1g Vitamin C Diarrhea 4-point Likert Scale (NE), Appetite loss 4-point Likert Scale (NE), Constipation 4-point Likert Scale (NE), Nausea/Vomiting EORTC QLQ-C30(NE) Int=10 (N=20) 2x/day 28 days Fernandes et al. [ 71 Head And Neck Cancer Radiation NS 58.7 ±(9.9); M: 75% F: 25% Randomized, Double-Blind, And Controlled Clinical Trial. Brazil 30mL of 0.8% BOP Oral mucositis WHO (-); Dysgeusia WHO (-); Dysphagia WHO (-) Int= 32 (N=60) 6 x/day 6 weeks Hsu and Szu [ 83 Colorectal Cancer Surgery: Abdomen NS 58.85 ±9.46; M: 58.3% F: 41.7% Randomized Clinical Trial Taiwan 15 min gum chewing sessions Time to first defecation (NE); Time to first flatus (-) Int=30 (N=60) 3x/day Until passage of first flatus Karabey et al. [ 94 Cancer: Variable Chemotherapy: Methotrexate NS NA; M: 50.0% F:50.0% Pilot Study turkey 60 sec gargling of 5 mL of black mulberry extract with 9% fruit sugar Mucositis RTOG (-) Int=20 (N=40) Daily 15 days Manifar et al. [ 116 Oral Cancer Radiotherapy NS 50.58±7.04 ; M:71.9% F: 28.1% Double Blind Randomized Study Iran 2x1010 CFUs Bifdobacterium breve, 7× 109 Mucositis WHO (-) Int=32 (N=64) CFU Bifdobacterium longum, 2 × 109 CFU Lactobacillus acidophilus, 7 × 109 CFU Lactobacillus casei, 2 × 108 CFU Lactobacillus bulgaricus, 1.5 × 109 CFU Lactobacillus rhamnosus, 1.5× 1010 CFU Streptococcus salivarius subspthermophiles) and 40 mg fructooligosaccharide as a prebiotic, lactose, magnesium stearate, and talc as carrier substances 3x/day 6 weeks Mohammadi et al. [ 121 Cancer: Variable Chemotherapy NS 46.43 ± 2.42; M: 58.3% F: 41.7% Randomized Controlled Trial Iran 2 min gargling of 7.5mL zinc chloride Mucositis WHO (-) Int=48 (N=96) 2x/Day 2 weeks Sim et al. [ 145 Gastrointestinal Cancer Chemotherapy NS 64.58 ± 2.11; M: 80% F:20% Randomized Controlled Trial Korea 200mL omega 3 Anorexia, Constipation and Diarrhea Severity EORTC-QLQ (NE) Int=22 (N=40) 2x/day 8 weeks Werida et al. [ 153 Breast Cancer Chemotherapy NS 48.875±8.49; F: 100.0% A Randomized Controlled Trial Egypt 600mg alpha-lipoid acid Abdominal pain and Nausea Incidence NCI-CTCAE (NE) Int=32 (N=64) Daily 6 months Al-Kharabsheh et al. [ 38 Colorectal Cancer Surgery: Colon NS 52.43; M: 52.7% F: 47.3% Randomized Controlled Trial Jordan 1 hr Gum chewing Flatus Latency (h) (–) Int= 60 (N=129) Every 8 hours Until passage of first flatus Badr et al. [ 46 Leukemia Chemotherapy: Intensive [High Dose] NS 10.0 ± 4.06 M: 50% F: 50% Single Blind Randomized Controlled Trial Lebanon 1 min gargling of 2.5 cc honey gargling followed by swallowing. Mucositis Severity WHO (-); Oral Pain Severity VAS (-) Int= 17 Daily Int=13 1 week (N=42) Badr et al. [ 46 Leukemia Chemotherapy: Intensive [High Dose] NS 10.0 ± 4.06 M: 50% F: 50% Single Blind Randomized Controlled Trial Lebanon 1 min gargling 2.5 cc olive oil gargling followed by swallowing. Mucositis Severity WHO (-); Oral Pain Severity VAS (-) Int= 17 Daily Int=13 1 week (N=42) Chen et al. [ 53 Lung Cancer Chemotherapy NS (61.1 ± 9.02); M: 91.7% F: 8.3% Randomized Controlled Trial China 2.5g JK5G postbiotics Anorexia, Constipation, and Diarrhea Severity EORCT QLQ-C30 (NE). Int= 30 (N=60) 3x/day 12 weeks Crichton et al. [ 58 Cancer: Variable Chemotherapy NS 59± 8; M: 32% F:68% Multicenter, Double-Blind, Placebo-Controlled Randomized Trial Australia 1.2g ginger root Nausea Incidence/ Severity (-); Vomiting Incidence (-) Int=51 (N=103) 4x/day 1 Week Eghbali et al. [ 66 Leukemia Chemotherapy NS 8.15± 2.13; M: 55.7% F: 44.3% Double-Blind Randomized Clinical Trial Iran 5×109 CFU of LactoCare 2x/day Diarrhea Incidence (-); Constipation, Vomiting, and Nausea Incidence (NE) Int=54 (N=106) 1 week Hussein et al. [ 86 Liver Cancer Chemotherapy NS >30 Double-Blind Clinical Experiment Iraq 3 g omega 3 Nausea Incidence (-); Vomiting and Diarrhea incidence (NE) Int=28 (N=56) Daily 6 weeks Khazaei et al. [ 95 Breast Cancer Chemotherapy NS 52.3 ± 11.9; F: 100% Randomized, Placebo-Controlled Double-Blind Clinical Trial Iran 1×109 CFU, Lactobacillus rhamnosus, Lactobacillus casei, Lactobacillus Anorexia Severity (NE) Int=34 (N=67) acidophilus, Lactobacillus bulgaricus, Bifidobacterium breve, Bifidobacterium longum, Lactobacillus helveticus, Lactobacillus lactis, Lactobacillus paraplantarum, Bifidobacterium bifidum, Streptococcus thermophilus and Lactobacillus gasseri and 21 g fructooligosaccharides 2x/day 8 weeks Sahebnasagh et al. [ 138 Head And Neck Cancer Radiotherapy NS 66.33 ± 10.53; M: 54.5% F; 45.5% Double Blind Randomized Clinical Trial Iran 60 s rinse of 5mL 1% zinc sulfate solution Mucositis Severity WHO (-) Int=17 (N=33) 3x/Day 7 weeks Shah et al. [ 142 Leukemia And Lymphoma Intensified Chemotherapy NS 7.5; NA Randomized Double-Blind Placebo-Controlled Trial India 1mg/kg Zinc Mucositis Incidence / Severity WHO (NE) Int=44 (N=90) Daily 2 weeks Thomas et al. [ 149 Head And Neck Cancer Radiation NS 57.62 ± 11.62; M; 75% F: 25% Randomized Controlled Trial India 10mL rinse of turmeric Mucositis Incidence WHO (-) Int=46 (N=92) 3x/day 7 weeks Wei et al. [ 152 Lung Cancer Chemotherapy NS 59.5 ± 8.04; M: 69.2% F:30.8% Randomized Placebo Controlled China 2g Yiga Bio-technology probiotics Anorexia, Constipation, and Diarrhea Incidence (-) Int=42 (N=91) 2x/day 2 chemo cycles Yanagimoto et al. [ 161 Pancreatic Cancer Chemotherapy NS 67.0±9.61; M: 53.1% F: 46.9% Randomized, Double Blind, Placebo Controlled Clinical Trial Japan 6g Lentinula edodes mycelia extract Diarrhea Incidence (NE) Int=45 (N=84) Daily 9 weeks For effect on measurable outcomes, a positive or increased effect is denoted by (+), a negative or decreased effect is denoted by (-), and no effect is denoted by (NE). Abbreviations: CFU, colony-forming unit; DC, dietary counseling; EORTC-QLQ; GI, gastrointestinal; NS, nutrient supplementation; ONS, oral nutrition supplements; PG-SGA, Patient-Generated Subjective Global Assessment; RTOG, Radiation Therapy Oncology Group; FACT-HN, Functional Assessment of Cancer Therapy – Head & Neck; FACT-ES, Functional Assessment of Cancer Therapy – Esophagitis. Any articles containing the following were excluded: inappropriate control group, retrospective study, only data reported exceeded 2 wk after completion of cancer therapy or intervention, language other than English, not enough studies reporting this symptom to conduct a meta-analysis, no reporting of scaling system used, and dose of intervention not reported. Data extraction A standardized data extraction form was used to collect the following methodological and outcome variables from each included study: author(s), publication year, study design, treatment type (chemotherapy, radiation therapy, surgical therapy, bone marrow transplant, and hormone therapy) sample size, participant characteristics (i.e., sex, age, and country), GI symptoms, and treatment effect (i.e., increase, decrease, or neutral change on physiological parameters). GI symptoms were assessed through the parameters identified during the data extraction process, including presence or severity of nausea, diarrhea, vomiting, constipation, ileus, flatulence, mucositis, abdominal pain, anorexia, and bloating, as well as flatus latency, defecation latency, or defecation frequency. Data were reported as either mean and standard deviation for continuous symptom data, or presence and absence for symptom incidence. Emails were sent out to authors of articles to request missing or unreported data. Articles with unresponsive authors were excluded from the analysis if no replies were received before manuscript submission. Quantitative data synthesis A meta-analysis was performed to estimate the pooled effect size on GI symptoms, assessed by incidence and severity report. A priori subgroup analyses by treatment type (nutrient supplementation, ONS, or counseling) and GI side-effects were performed for all included studies where data from ≥3 studies were available. Study heterogeneity was assessed using the I2 index. The level of heterogeneity represented by I2 was interpreted as modest (I2 < 25%), moderate (25% < I2 < 50%), substantial (50% < I2 < 75%), or considerable (I2 > 75%). A fixed-effect model was estimated when modest to moderate heterogeneity was present, and a random-effect model was estimated when substantial to considerable heterogeneity was present. For meta-analyses that included 10 or fewer studies, a fixed-effect model was used by default, as the estimation of between-study variance in random-effect models is considered unreliable with a limited number of studies [ 163 164 165 166 167 P G 168 Risk-of-bias assessment Publication bias was assessed on meta-analyses conducted with 10 or more studies [ 166 P 167 Results Study selection Figure 1 n n n FIGURE 2 FIGURE 3 FIGURE 4 FIGURE 5 FIGURE 6 FIGURE 7 FIGURE 8 FIGURE 1 Study selection flow chart. ∗Two studies investigated both ONS and dietary counseling. ONS, oral nutrition supplementation. FIGURE 1 FIGURE 2 Effect of ONS on GI symptom incidence and severity. (A) ONS effects on GI symptom incidence. (B) ONS effects on GI symptom severity. Summary graph of meta-analysis results of the incidence (ORR) or severity (Hedge’s G) of GI symptoms. The dashed line indicates no effect. Bars represent the mean ORR or Hedge’s G P FIGURE 2 FIGURE 3 Dietary counseling on GI symptom incidence. Counseling effects on GI symptom incidence. Summary graph of meta-analysis results of the incidence (ORR). The dashed line indicates no effect. Bars represent the mean ORR with a 95% CI. Number of studies and participants are listed on the right for each symptom. CI, confidence interval; GI, gastrointestinal; ORR, odds risk ratio. ∗ P FIGURE 3 FIGURE 4 Nutrient supplementation on GI symptom incidence, GI symptom severity, and bowel timing (h). (A) Nutrient supplementation effects on symptom incidence. (B) Nutrient supplementation effects on symptom severity. (C) Nutrient supplementation effects on bowel timing (h). Summary graph of meta-analysis results of incidence (ORR), severity (Hedge’s G) and timing (h) (Hedge’s G). The dashed line indicates no effect. Bars represent the mean ORR and Hedge’s G P FIGURE 4 FIGURE 5 Effects of individual nutrient supplementation on GI symptom incidence and severity. (A) Abdominal pain incidence. (B) Anorexia incidence. (C) Anorexia severity. (D) Bloating incidence. (E) Constipation incidence. (F) Constipation severity. (G) Defecation latency (h). (H) Diarrhea incidence. (I) Diarrhea severity. (J) Mucositis incidence. (K) Mucositis severity. (L) Nausea incidence. (M) Vomiting incidence. Summary graph of meta-analysis results of the incidence (ORR) or severity (Hedge’s G) of GI symptoms. The dashed line indicates no effect. Bars represent the mean ORR or Hedge’s G P FIGURE 5 FIGURE 6 Effects of individual nutrient supplementation on GI symptom incidence and severity during variable cancer diagnoses. (A) Diarrhea incidence during colorectal cancer, (B) diarrhea incidence during GI cancers, and (C) mucositis severity during head and neck cancers. (D) Mucositis severity during leukemia. Summary graph of meta-analysis results of incidence (ORR) or severity (Hedge’s G) of GI symptoms during different cancer types. The dashed line indicates no effect. Bars represent the mean ORR or Hedge’s G P FIGURE 6 FIGURE 7 Effects of individual nutrient supplementation on GI symptom incidence and severity during variable cancer treatments. (A) Anorexia incidence during chemotherapy. (B) Anorexia severity during chemotherapy. (C) Constipation incidence during chemotherapy. (D) Constipation severity during chemotherapy. (E) Defecation latency (h) during surgical therapy. (F) Diarrhea incidence during chemotherapy. (G) Diarrhea severity during chemotherapy. (H) Diarrhea incidence during radiation therapy. (I) Diarrhea severity during radiation therapy. (J) Flatus latency (h) during surgical therapy. (K) Mucositis incidence during chemotherapy. (L) Mucositis severity during chemotherapy. (M) Mucositis incidence during radiation therapy. (N) Mucositis severity during radiation therapy. (O) Nausea incidence during chemotherapy. (P) Nausea severity during chemotherapy. (Q) Vomiting incidence during chemotherapy. Summary graph of meta-analysis results of the incidence (ORR) or severity (Hedge’s G) of GI symptoms during different treatments. The dashed line indicates no effect. Bars represent the mean ORR or Hedge’s G P FIGURE 7 FIGURE 8 Effects of individual NS on GI symptom incidence and severity during variable cancer diagnoses and treatments. (A) Anorexia severity during GI cancers treated with chemotherapy. (B) Constipation severity during GI cancers treated with chemotherapy. (C) Defecation latency (h) during colorectal cancers treated with surgical therapy. (D) Diarrhea incidence during GI cancers treated with chemotherapy. (E) Diarrhea severity during GI cancers treated with chemotherapy. (F) Diarrhea incidence during gynecological cancers treated with radiation therapy, (G) diarrhea incidence during GI cancers treated with surgical therapy. (H) Flatus latency (h) during colorectal cancer treated with surgical therapy. (I) Mucositis severity during head and neck cancers treated with chemotherapy. (J) Mucositis severity during leukemia treated with chemotherapy. (K) Mucositis incidence during head and neck cancers treated with radiation therapy. (L) Mucositis severity during head and neck cancers treated with radiation therapy. (M) Nausea incidence during GI cancers treated with chemotherapy. (N) Oral pain during head and neck cancers treated with radiation therapy. (O) Vomiting incidence during head and neck cancers treated with chemotherapy. Summary graph of meta-analysis results of the incidence (ORR) or severity (Hedge’s G) of GI symptoms during different cancers and cancer treatments. The dashed line indicates no effect. Bars represent the mean ORR or Hedge’s G P FIGURE 8 Basic characteristics of the selected studies Table 2 24 25 169 Supplemental Figure 1 Effects of ONS on GI symptom severity and incidence The results of the meta-analysis of ONS on GI symptom incidence and severity are displayed in Figure 2 24 25 [26] [27] [28] [29] [30] [31] [32] 162 P P P P 28 30 32 P ONS did not reduce the severity of the following symptoms: diarrhea: (95% CI: –0.42, 0.05; P P P Effects of nutrition counseling on GI symptom incidence The results of meta-analysis for counseling on GI symptom incidence are displayed in Figure 3 24 25 [33] [34] [35] [36] P P P P P Not enough studies captured the efficacy of counseling on GI symptom severity. Effects of nutrient supplementation on symptom incidence, severity, and latency (h) The results of the meta-analysis for nutrient supplementation on GI symptom incidence, severity, and latency (h) are displayed in Figure 4 [37] [38] [39] [40] [41] [42] [43] [44] [45] [46] [47] [48] [49] [50] [51] [52] [53] [54] [55] [56] [57] [58] [59] [60] [61] [62] [63] [64] [65] [66] [67] [68] [69] [70] [71] [72] [73] [74] [75] [76] [77] [78] [79] [80] [81] [82] [83] [84] [85] [86] [87] [88] [89] [90] [91] [92] [93] [94] [95] [96] [97] [98] [99] [100] [101] [102] [103] [104] [105] [106] [107] [108] [109] [110] [111] [112] [113] [114] [115] [116] [117] [118] [119] [120] [121] [122] [123] [124] [125] [126] [127] [128] [129] [130] [131] [132] [133] [134] [135] [136] [137] [138] [139] [140] [141] [142] [143] [144] [145] [146] [147] [148] [149] [150] [151] [152] [153] [154] [155] [156] [157] [158] [159] [160] 161 P P P P P P P P P Nutrient supplementation reduced the severity of the following symptoms: oral pain: Hedge’s G P G P G P G P G P G P G P P P Nutrient supplementation reduced the latency (h) of the following symptoms: flatus latency (h): Hedge’s G P G P G P Effects of specific nutrient supplementations on symptom incidence and severity Abdominal pain The results of the meta-analysis for specific nutrient supplementation on abdominal pain incidence are displayed in Figure 5 65 [111] [112] [113] 135 153 P P Not enough studies captured abdominal pain severity. Anorexia The results of the meta-analysis for specific nutrient supplementation on anorexia incidence and severity are displayed in Figure 5 41 49 88 115 122 136 148 150 49 70 120 140 145 146 P P The following nutrients reduced anorexia severity: fatty acids: Hedge’s G P G P Bloating The results of the meta-analysis for specific nutrient supplementation on bloating are displayed in Figure 5 111 112 118 119 P Not enough studies captured bloating severity. Constipation The results of the meta-analysis for specific nutrient supplementation on constipation incidence and severity are displayed in Figure 5 41 49 61 66 73 98 115 122 136 49 70 105 120 145 P P P The following nutrients did not reduce constipation severity: fatty acids: (95% CI: –0.22, 0.36; P Defecation latency (h) The results of the meta-analysis for specific nutrient supplementation on defecation latency (h) are displayed in Figure 5 44 63 67 76 79 82 83 99 111 112 118 130 159 G P G P Diarrhea The results of the meta-analysis for specific nutrient supplementation on diarrhea incidence and severity are displayed in Figure 5 44 48 49 54 [59] [60] [61] [62] [63] [64] [65] [66] 73 78 86 87 98 102 106 108 [110] [111] [112] [113] 115 119 123 133 134 136 137 139 148 [150] [151] [152] 155 157 160 161 49 64 65 70 105 113 [118] [119] [120] 140 145 146 152 160 P P P P P P The following nutrients reduced diarrhea severity: probiotics: Hedge’s G P P 49 113 120 140 145 146 P Mucositis The results of the meta-analysis for nutrient supplementation on mucositis incidence and severity are depicted in Figure 5 39 40 49 52 56 57 60 65 67 [71] [72] [73] [74] 77 80 84 85 87 [91] [92] [93] 101 103 108 116 117 121 123 125 126 132 133 136 138 [141] [142] [143] 149 150 154 156 37 45 46 49 51 52 56 65 67 68 71 77 80 84 85 [91] [92] [93] [94] 103 109 116 117 121 122 125 126 [131] [132] [133] 136 138 [142] [143] [144] 147 149 154 156 P P P P 39 52 56 57 84 85 108 154 P P 40 117 138 141 P P P The following nutrients reduced mucositis severity: prebiotics: Hedge’s G P 46 92 132 G P G P G P G P 52 56 84 85 154 G P G P 77 109 142 G P 117 131 138 G P P 91 103 144 P Nausea The results of the meta-analysis for nutrient supplementation on nausea incidence are depicted in Figure 5 41 44 47 49 58 60 61 66 73 81 86 97 98 107 110 113 115 122 129 134 148 149 151 153 160 P 41 44 49 60 86 113 P P P P 47 58 107 127 129 P Not enough studies captured nausea severity. Vomiting The results of the meta-analysis for nutrient supplementation on vomiting incidence are depicted in Figure 5 41 44 49 58 60 61 66 73 81 86 106 107 110 113 125 122 129 134 148 151 155 160 P P P 41 44 49 60 86 113 P P Not enough studies captured vomiting severity. Symptom incidence and severity by cancer type Effects of nutrient supplementation on diarrhea during GI cancers The results of the meta-analysis for nutrient supplementation on diarrhea incidence during GI cancers are depicted in Figure 6 63 87 111 112 119 155 157 161 P P Not enough studies captured diarrhea severity during GI cancers. Effects of nutrient supplementation on diarrhea during colorectal cancer The results of the meta-analysis for nutrient supplementation on diarrhea incidence during colorectal cancers are depicted in Figure 6 111 112 119 P Not enough studies captured diarrhea severity during colorectal cancers. Effects of nutrient supplementation on mucositis during head and neck cancers The results of the meta-analysis for nutrient supplementation on mucositis severity during head and neck cancers are depicted in Figure 6 37 45 52 68 71 84 85 93 96 116 143 147 149 156 G P G P G P Not enough studies captured mucositis incidence and head and neck cancers. Effects of nutrient supplementation on mucositis during leukemia The results of the meta-analysis for nutrient supplementation on mucositis severity during leukemia are depicted in Figure 6 77 131 142 G P Not enough studies captured mucositis incidence and leukemia. Symptom incidence and severity by treatment type Effects of nutrient supplementation on anorexia during chemotherapy The results of the meta-analysis for nutrient supplementation on anorexia incidence and severity during chemotherapy therapy are depicted in Figure 7 41 49 115 49 120 140 145 P The following nutrients reduced anorexia severity during chemotherapy: fatty acids specifically, omega–3: Hedge’s G P Effects of nutrient supplementation on constipation during chemotherapy The results of the meta-analysis for nutrient supplementation on constipation incidence and severity during chemotherapy are depicted in Figure 7 41 49 61 66 73 115 49 70 105 120 145 P P Similarly, the following nutrients did not reduce constipation severity during chemotherapy: fatty acids: (95% CI: –0.22, 0.36; P Effects of nutrient supplementation on defecation latency (h) during surgical therapy The results of the meta-analysis for nutrient supplementation on defecation latency (h) during surgical therapy are depicted in Figure 7 43 69 76 79 82 83 99 130 159 G P G P Effects of nutrient supplementation on diarrhea during chemotherapy The results of the meta-analysis for nutrient supplementation on diarrhea incidence and severity during chemotherapy are depicted in Figure 7 33 40 44 48 49 [59] [60] [61] 66 73 86 87 98 108 116 119 123 133 134 148 [150] [151] [152] 160 161 49 105 119 120 140 145 152 160 P P 41 44 49 60 86 P P P 48 59 108 148 P P The following nutrients reduced diarrhea severity during chemotherapy: probiotics: Hedge’s G P P Effects of nutrient supplementation on diarrhea during radiation therapy The results of the meta-analysis for nutrient supplementation on diarrhea incidence and severity during radiation therapy are depicted in Figure 7 54 [63] [64] [65] 78 139 64 65 118 P The following nutrients reduced diarrhea severity during radiation therapy: probiotics: Hedge’s G P Effects of nutrient supplementation on flatus latency (h) during surgical therapy The results of the meta-analysis for nutrient supplementation on flatus latency (h) during surgical therapy are depicted in Figure 7 38 43 69 76 79 82 83 99 110 130 159 G P G P Effects of nutrient supplementation on mucositis during chemotherapy The results of the meta-analysis for nutrient supplementation on mucositis incidence and severity during chemotherapy are depicted in Figure 7 39 49 60 67 74 77 80 91 108 117 121 126 133 142 150 154 37 45 68 77 96 103 121 126 131 142 144 P P P P The following nutrients reduced mucositis severity during chemotherapy: herbs: Hedge’s G P P Effects of nutrient supplementation on mucositis during radiation The results of the meta-analysis for nutrient supplementation on mucositis incidence and severity during radiation therapy are depicted in Figure 7 40 51 84 85 92 103 132 136 138 141 71 84 85 125 133 136 147 149 156 P P P 40 138 141 P The following nutrients reduced mucositis severity during radiation therapy: herbs: Hedge’s G P G P Effects of nutrient supplementation on nausea during chemotherapy The results of the meta-analysis for nutrient supplementation on nausea incidence and severity during chemotherapy are depicted in Figure 7 40 44 49 58 60 61 73 81 86 97 98 107 115 122 127 129 134 148 150 151 153 160 42 58 89 90 129 P 41 44 49 60 86 P P P 58 107 127 129 P P The following nutrients reduced nausea severity during chemotherapy: herbs: Hedge’s G P 42 58 129 G P Effects of nutrient supplementation on vomiting during chemotherapy The results of the meta-analysis for nutrient supplementation on vomiting incidence during chemotherapy are depicted in Figure 7 41 44 49 58 60 61 73 81 86 107 105 122 129 134 148 151 160 P P 41 44 52 61 86 P P P Not enough studies captured vomiting severity and chemotherapy. Symptom incidence and severity depending on nutrient, cancer type, and cancer treatment Effects of nutrient supplementation on anorexia during GI cancers treated with chemotherapy The results of the meta-analysis for nutrient supplementation on anorexia severity during GI cancers treated with chemotherapy are depicted in Figure 8 49 120 145 G P Not enough studies captured anorexia incidence during GI cancers treated with chemotherapy. Effects of nutrient supplementation on constipation during GI cancers treated with chemotherapy The results of the meta-analysis for nutrient supplementation on constipation severity during GI cancers chemotherapy is depicted in Figure 8 49 70 120 145 P 49 120 145 P Not enough studies captured constipation incidence during GI cancers treated with chemotherapy. Effects of nutrient supplementation on defecation latency (h) during colorectal cancer and surgical therapy The results of the meta-analysis for nutrient supplementation on defecation latency (h) during colorectal cancer and surgical therapy are depicted in Figure 8 43 82 99 130 G P Effects of nutrient supplementation on diarrhea during GI cancers treated with chemotherapy The results of the meta-analysis for nutrient supplementation on diarrhea incidence and severity during GI cancers treated with chemotherapy are depicted in Figure 8 44 49 59 86 98 115 150 49 70 120 145 P 44 49 86 P P Similarly, the following nutrients reduced diarrhea severity during GI cancers treated with chemotherapy: fatty acids: Hedge’s G P 49 120 145 G P Effects of nutrient supplementation on diarrhea during gynecological cancers treated with radiation therapy The results of the meta-analysis for nutrient supplementation on diarrhea incidence during gynecological cancers during radiation therapy are depicted in Figure 8 54 64 78 139 P Not enough studies captured diarrhea severity during gynecological cancers treated with radiation therapy. Effects of nutrient supplementation on diarrhea during GI cancers with surgical therapy The results of the meta-analysis for nutrient supplementation on diarrhea incidence during GI cancers and surgical therapy are depicted in Figure 8 111 112 155 P Not enough studies captured diarrhea severity during GI cancers treated with surgical therapy. Effects of nutrient supplementation on flatus latency (h) during colorectal cancers during surgical therapy The results of the meta-analysis for nutrient supplementation on flatus latency (h) during colorectal cancers during surgical therapy are depicted in Figure 8 38 43 82 83 99 130 G P Effects of nutrient supplementation on mucositis during head and neck cancers and chemotherapy The results of the meta-analysis for nutrient supplementation on mucositis severity during head and neck cancers and chemotherapy are depicted in Figure 8 37 45 68 96 G P Not enough studies captured mucositis incidence during head and neck cancers treated with chemotherapy. Effects of nutrient supplementation on mucositis during leukemia and chemotherapy The results of the meta-analysis for nutrient supplementation on mucositis severity during leukemia and chemotherapy are depicted in Figure 8 77 131 142 G P Not enough studies captured mucositis incidence during leukemia treated with chemotherapy. Effects of nutrient supplementation on mucositis during head and neck cancers treated with radiation therapy The results of the meta-analysis for nutrient supplementation on mucositis incidence and severity during head and neck cancers treated with radiation therapy are depicted in Figure 8 40 103 138 141 71 147 149 156 P 45 143 146 P The following nutrients reduced mucositis severity during head and neck cancers treated with radiation therapy: herbs: Hedge’s G P Effects of nutrient supplementation on nausea during GI cancers and chemotherapy The results of the meta-analysis for nutrient supplementation on nausea incidence during GI cancers and chemotherapy are depicted in Figure 8 44 49 86 115 P 44 49 86 P Not enough studies captured nausea severity during GI cancers treated with chemotherapy. Effects of nutrient supplementation on oral pain during head and neck cancers and radiation therapy The results of the meta-analysis for nutrient supplementation on oral pain severity during head and neck cancers and radiation therapy are depicted in Figure 8 37 68 71 147 149 G P Not enough studies captured oral pain incidence during head and neck cancers and radiation therapy. Effects of nutrient supplementation on vomiting during GI cancers and chemotherapy The results of the meta-analysis for nutrient supplementation on vomiting incidence during GI cancers and chemotherapy are depicted in Figure 8 44 49 86 115 P 44 49 86 P Not enough studies captured vomiting severity during GI cancers treated with chemotherapy. Risk-of-bias assessment The Cochrane bias assessment tool was used to evaluate overall bias and within-study bias of the included studies. The general and within-study risks of bias are shown in Supplemental Figure 2 Supplemental Table 3 Discussion This study systematically reviewed and quantitatively synthesized scientific evidence regarding nutritional therapies (nutrient supplementation, ONS, and nutrition counseling) in treating GI symptoms during cancer treatment. A total of 10,832 patients from 139 studies were included in the 151 total meta-analyses. A summary of all the statistical measures used for the meta-analyses, corresponding to FIGURE 2 FIGURE 3 FIGURE 4 FIGURE 5 FIGURE 6 FIGURE 7 FIGURE 8 Table 3 Figure 9 TABLE 3 Summary of meta-analyses statistics. TABLE 3 Meta-analyses Symptom Nutrition intervention Effect size Lower CI Upper CI No. of studies No. of participants Statistical model P All ONS Anorexia ONS 0.72 0.34 1.52 4 207 Fixed effect 0.39 All ONS Diarrhea ONS 0.87 0.53 1.42 7 522 Fixed effect 0.58 All ONS Mucositis ONS 0.95 0.57 1.58 6 336 Fixed effect 0.85 All ONS Nausea ONS 0.97 0.60 1.57 5 415 Fixed effect 0.91 All ONS Diarrhea ONS –0.19 –0.42 0.05 4 281 Fixed effect 0.12 All ONS Nausea ONS –0.06 –0.33 0.21 3 207 Fixed effect 0.68 All ONS Anorexia ONS –0.04 –0.31 0.22 4 217 Fixed effect 0.74 All counseling Constipation Counseling 0.15 0.08 0.29 3 273 Fixed effect <0.001 All counseling Nausea Counseling 0.27 0.15 0.47 5 530 Fixed effect <0.001 All counseling Diarrhea Counseling 0.30 0.18 0.52 5 488 Fixed effect <0.001 All counseling Anorexia Counseling 0.37 0.23 0.58 4 415 Fixed effect <0.001 All counseling Vomiting Counseling 0.49 0.29 0.83 4 389 Fixed effect 0.01 All nutrients Ileus Nutrient supplementation 0.32 0.18 0.55 5 459 Fixed effect <0.001 All nutrients Diarrhea Nutrient supplementation 0.37 0.25 0.55 45 3422 Random effect <0.001 All nutrients Abdominal pain Nutrient supplementation 0.41 0.29 0.58 11 832 Fixed effect <0.001 All nutrients Constipation Nutrient supplementation 0.28 0.12 0.63 15 1102 Random effect <0.001 All nutrients Anorexia Nutrient supplementation 0.34 0.17 0.69 15 858 Random effect <0.001 All nutrients Nausea Nutrient supplementation 0.49 0.34 0.71 32 2371 Random effect <0.001 All nutrients Vomiting Nutrient supplementation 0.55 0.41 0.73 26 2013 Fixed effect <0.001 All nutrients Mucositis Nutrient supplementation 0.63 0.52 0.78 43 3249 Fixed effect <0.001 All nutrients Bloating Nutrient supplementation 0.69 0.30 1.79 7 473 Fixed effect 0.1 All nutrients Oral Pain Nutrient supplementation –1.42 –1.68 –1.18 9 415 Fixed effect <0.001 All nutrients Mucositis Nutrient supplementation –0.88 –1.23 –0.54 42 2841 Random effect <0.001 All nutrients Anorexia Nutrient supplementation –0.68 –1.09 –0.26 14 935 Random effect <0.001 All nutrients Diarrhea Nutrient supplementation –0.58 –1.06 –0.11 20 1410 Random effect 0.02 All nutrients Flatulence Nutrient supplementation –0.49 –0.83 –0.15 3 143 Fixed effect <0.001 All nutrients Abdominal pain Nutrient supplementation –0.37 –0.58 –0.16 5 363 Fixed effect <0.001 All nutrients Constipation Nutrient supplementation –0.38 –0.57 –0.20 7 476 Fixed effect <0.001 All nutrients Nausea Nutrient supplementation –0.35 –0.74 0.05 12 1109 Random effect 0.09 All nutrients Vomiting Nutrient supplementation –0.01 –0.14 0.11 8 910 Fixed effect 0.83 All nutrients Flatus latency (h) Nutrient supplementation –1.16 –1.84 –0.49 13 954 Random effect <0.001 All nutrients Defecation latency (h) Nutrient supplementation –1.07 –1.86 –0.31 15 1159 Random effect 0.01 All nutrients Defecation frequency Nutrient supplementation 1.58 1.38 1.78 3 566 Fixed effect <0.001 Abdominal pain incidence Abdominal pain Probiotic 0.32 0.21 0.49 3 394 Fixed effect <0.001 Abdominal pain incidence Abdominal pain Fatty acid 1.20 0.44 3.25 3 177 Fixed effect 0.73 Anorexia incidence Anorexia Amino acid 0.25 0.16 0.39 5 398 Fixed effect <0.001 Anorexia incidence Anorexia Fatty acid 0.49 0.23 1.03 3 122 Fixed effect 0.06 Anorexia severity Anorexia Fatty acid –0.44 –0.66 –0.22 6 313 Fixed effect <0.001 Bloating incidence Bloating Probiotic 0.68 0.46 1.16 4 324 Fixed effect 0.19 Constipation incidence Constipation Amino acid 0.28 0.16 0.49 3 448 Fixed effect <0.001 Constipation incidence Constipation Synbiotic 0.47 0.14 1.58 3 211 Fixed effect 0.22 Constipation incidence Constipation Fatty acid 1.28 0.51 3.25 3 106 Fixed effect 0.6 Constipation severity Constipation Fatty acid 0.07 –0.22 0.36 5 217 Fixed effect 0.63 Defecation latency (h) Defecation latency (h) Caffeine –0.61 –0.88 –0.33 3 251 Fixed effect <0.001 Defecation latency (h) Defecation latency (h) Chewing gum –0.52 –0.72 –0.33 7 408 Fixed effect <0.001 Diarrhea incidence Diarrhea Herb 0.08 0.01 0.47 3 149 Fixed effect <0.001 Diarrhea incidence Diarrhea Probiotic 0.30 0.15 0.61 13 1629 Random effect <0.001 Diarrhea incidence Diarrhea Fatty acid 0.39 0.23 0.66 7 300 Fixed effect <0.001 Diarrhea incidence Diarrhea Synbiotic 0.48 0.23 0.96 4 273 Fixed effect 0.04 Diarrhea incidence Diarrhea Amino acid 0.51 0.35 0.97 10 701 Fixed effect <0.001 Diarrhea incidence Diarrhea Prebiotic 0.68 0.37 1.25 5 253 Fixed effect 0.19 Diarrhea severity Diarrhea Probiotic –0.65 –0.83 –0.48 6 551 Fixed effect <0.001 Diarrhea severity Diarrhea Fatty acid –0.12 –0.31 0.08 8 417 Fixed effect 0.24 Mucositis incidence Mucositis Fatty Acid 0.24 0.10 0.58 3 163 Fixed effect <0.001 Mucositis incidence Mucositis Prebiotic 0.23 0.09 0.56 4 150 Fixed effect <0.001 Mucositis incidence Mucositis Probiotic 0.30 0.21 0.62 4 442 Fixed effect <0.001 Mucositis incidence Mucositis Amino acid 0.44 0.20 0.98 11 732 Fixed effect 0.04 Mucositis incidence Mucositis Mineral 0.62 0.42 0.99 10 920 Fixed effect 0.01 Mucositis incidence Mucositis Chewing gum 1.23 0.81 1.88 3 410 Fixed effect 0.33 Mucositis incidence Mucositis Herb 0.66 0.31 1.42 3 172 Fixed effect 0.29 Mucositis severity Mucositis Prebiotic –1.15 –1.46 –0.84 5 197 Fixed effect <0.001 Mucositis severity Mucositis Fatty acid –0.86 –1.23 –0.42 3 131 Fixed effect <0.001 Mucositis severity Mucositis Herb –0.87 –1.08 –0.67 9 459 Fixed effect <0.001 Mucositis severity Mucositis Amino acid –0.82 –1.01 –0.64 7 478 Fixed effect <0.001 Mucositis severity Mucositis Probiotic –0.73 –0.92 –0.55 4 509 Fixed effect <0.001 Mucositis severity Mucositis Mineral –0.19 –0.54 0.16 11 856 Random effect 0.29 Nausea incidence Nausea Fatty acid 0.22 0.13 0.37 8 368 Fixed effect <0.001 Nausea incidence Nausea Probiotic 0.27 0.17 0.44 6 413 Fixed effect <0.001 Nausea incidence Nausea Herb 0.70 0.50 0.98 7 640 Fixed effect 0.04 Nausea incidence Nausea Amino acid 1.12 0.70 1.75 5 622 Fixed effect 0.63 Vomiting incidence Vomiting Herb 0.22 0.10 0.50 6 361 Fixed effect <0.001 Vomiting incidence Vomiting Probiotic 0.39 0.25 0.60 7 553 Fixed effect <0.001 Vomiting incidence Vomiting Fatty acid 0.69 0.32 1.48 7 304 Fixed effect 0.34 Vomiting incidence Vomiting Amino acid 1.25 0.65 2.39 3 531 Fixed effect 0.5 Diarrhea incidence gastrointestinal cancer Diarrhea Probiotic 0.15 0.11 0.22 5 916 Fixed effect <0.001 Diarrhea incidence gastrointestinal cancer Diarrhea Prebiotic 0.50 0.25 1.02 3 184 Fixed effect 0.06 Diarrhea incidence colorectal cancer Diarrhea Probiotic 0.39 0.23 0.64 3 249 Fixed effect <0.001 Mucositis severity head and neck cancer Mucositis Herb –1.10 –1.32 –0.87 8 399 Fixed effect <0.001 Mucositis severity head and neck cancer Mucositis Amino acid –0.84 –1.17 –0.51 3 151 Fixed effect <0.001 Mucositis severity head and neck cancer Mucositis Probiotic –0.85 –1.07 –0.63 3 349 Fixed effect <0.001 Mucositis severity leukemia Mucositis Mineral –0.37 –0.60 –0.14 3 302 Fixed effect <0.001 Anorexia incidence chemotherapy Anorexia Fatty acid 0.49 0.23 1.03 3 122 Fixed effect 0.06 Anorexia severity chemotherapy Anorexia Fatty acid –0.49 –0.79 –0.22 4 216 Fixed effect <0.001 Constipation incidence chemotherapy Constipation Synbiotic 0.47 0.14 1.58 3 211 Fixed effect 0.22 Constipation incidence chemotherapy Constipation Fatty acid 1.28 0.51 3.25 3 106 Fixed effect 0.68 Constipation severity chemotherapy Constipation Fatty acid 0.07 –0.22 0.36 5 217 Fixed effect 0.63 Defecation latency (h) surgical therapy Defecation latency (h) Caffeine –0.61 –0.88 –0.33 3 251 Fixed effect <0.001 Defecation latency (h) surgical therapy Defecation latency (h) Chewing gum –0.52 –0.72 –0.33 7 408 Fixed effect <0.001 Diarrhea incidence chemotherapy Diarrhea Probiotic 0.24 0.12 0.49 4 238 Fixed effect <0.001 Diarrhea incidence chemotherapy Diarrhea Fatty acid 0.31 0.17 0.56 6 256 Fixed effect <0.001 Diarrhea incidence chemotherapy Diarrhea Synbiotic 0.48 0.23 0.96 4 273 Fixed effect 0.04 Diarrhea incidence chemotherapy Diarrhea Amino acid 0.66 0.41 1.03 7 379 Fixed effect 0.07 Diarrhea incidence chemotherapy Diarrhea Prebiotic 0.84 0.26 2.72 3 150 Fixed effect 0.78 Diarrhea severity chemotherapy Diarrhea Probiotic –0.78 –1.08 –0.48 3 178 Fixed effect <0.001 Diarrhea severity chemotherapy Diarrhea Fatty acid –0.06 –0.29 0.18 5 291 Fixed effect 0.63 Diarrhea incidence radiation therapy Diarrhea Probiotic 0.25 0.19 0.34 6 1003 Fixed effect <0.001 Diarrhea severity radiation therapy Diarrhea Probiotic –0.59 –0.80 –0.37 3 373 Fixed effect <0.001 Flatus latency (h) surgical therapy Flatus latency (h) Caffeine –1.19 –1.46 –0.92 3 247 Fixed effect <0.001 Flatus latency (h) surgical therapy Flatus latency (h) Chewing gum –0.72 –0.90 –0.55 8 537 Fixed effect <0.001 Mucositis incidence chemotherapy Mucositis Fatty acid 0.24 0.10 0.58 3 163 Fixed effect <0.001 Mucositis incidence chemotherapy Mucositis Amino acid 0.48 0.28 0.84 11 731 Fixed effect 0.01 Mucositis incidence chemotherapy Mucositis Mineral 0.64 0.41 1.00 6 556 Fixed effect 0.05 Mucositis incidence chemotherapy Mucositis Chewing gum 1.23 0.81 1.88 3 410 Fixed effect 0.33 Mucositis severity chemotherapy Mucositis Herb –0.78 –1.08 –0.48 4 183 Fixed effect <0.001 Mucositis severity chemotherapy Mucositis Mineral –0.14 –0.30 0.03 7 613 Fixed effect 0.1 Mucositis incidence radiation therapy Mucositis Amino Acid 0.07 0.01 0.32 3 249 Fixed effect <0.001 Mucositis incidence radiation therapy Mucositis Prebiotic 0.16 0.05 0.53 3 132 Fixed effect <0.001 Mucositis incidence radiation therapy Mucositis Mineral 0.66 0.32 1.34 4 364 Fixed effect 0.25 Mucositis severity radiation therapy Mucositis Herb –0.96 –1.25 –0.68 5 276 Fixed effect <0.001 Mucositis severity radiation therapy Mucositis Amino acid –0.73 –0.96 –0.49 4 309 Fixed effect <0.001 Nausea incidence chemotherapy Nausea Fatty acid 0.17 0.10 0.31 7 324 Fixed effect <0.001 Nausea incidence chemotherapy Nausea Probiotic 0.19 0.10 0.38 5 253 Fixed effect <0.001 Nausea incidence chemotherapy Nausea Herb 0.52 0.32 0.85 5 319 Fixed effect 0.01 Nausea incidence chemotherapy Nausea Amino acid 1.12 0.70 1.75 5 622 Fixed effect 0.63 Nausea severity chemotherapy Nausea Herb –0.27 –0.50 –0.04 5 318 Fixed effect 0.02 Vomiting incidence chemotherapy Vomiting Probiotic 0.20 0.10 0.40 5 253 Fixed effect <0.001 Vomiting incidence chemotherapy Vomiting Herb 0.30 0.11 0.81 3 206 Fixed effect 0.02 Vomiting incidence chemotherapy Vomiting Fatty acid 0.51 0.21 1.21 6 260 Fixed effect 0.13 Vomiting incidence chemotherapy Vomiting Amino acid 1.25 0.65 2.39 3 531 Fixed effect 0.5 Anorexia severity Anorexia Fatty acid –0.56 –0.92 –0.20 3 124 Fixed effect <0.001 Constipation severity Constipation Fatty acid 0.12 –0.23 0.47 4 157 Fixed effect 0.51 Defecation latency (h) colorectal cancer Defecation latency (h) Chewing gum –0.46 –0.57 –0.17 5 184 Fixed effect <0.001 Diarrhea incidence Diarrhea Fatty acid 0.28 0.14 0.55 4 176 Fixed effect <0.001 Diarrhea incidence Diarrhea Amino acid 0.32 0.15 0.72 3 153 Fixed effect 0.01 Diarrhea severity Diarrhea Fatty acid –0.78 –1.12 –0.45 4 157 Fixed effect <0.001 Diarrhea incidence gynecological cancer Diarrhea Probiotic 0.90 0.57 1.39 4 361 Fixed effect 0.62 Diarrhea incidence Diarrhea Probiotic 0.38 0.23 0.61 3 388 Fixed effect <0.001 Flatus latency (h) colorectal cancer Flatus latency (h) Chewing gum –0.87 –1.10 –0.63 6 383 Fixed effect <0.001 Mucositis severity head and neck cancer chemotherapy Mucositis Herb –0.78 –1.08 –0.48 4 183 Fixed effect <0.001 Mucositis severity leukemia Mucositis Mineral –0.37 –0.60 –0.14 3 302 Fixed effect <0.001 Mucositis incidence head and neck cancer Mucositis Mineral 0.66 0.32 1.34 4 364 Fixed effect 0.14 Mucositis severity head and neck cancer Mucositis Herb –0.96 –1.25 –0.68 4 183 Fixed effect <0.001 Nausea incidence Nausea Fatty acid 0.07 0.05 0.35 4 180 Fixed effect <0.001 Oral pain head and neck cancer Oral Pain Herb –1.21 –1.51 –0.91 5 268 Fixed effect <0.001 Vomiting incidence GI cancer chemotherapy Vomiting Fatty acid 0.37 0.17 0.83 4 180 Fixed effect <0.001 Table including the quantitative data underlying the custom summary graphs shown in FIGURE 2 FIGURE 3 FIGURE 4 FIGURE 5 FIGURE 6 FIGURE 7 FIGURE 8 P Abbreviations: CI, confidence interval; GI, gastrointestinal; No., number; ONS, oral nutrition supplements. FIGURE 9 Overview—therapies in alleviating cancer-induced GI symptoms. The intestinal effects of ginger, omega-3 fatty acids, and prebiotics were attributed to reduced proinflammatory cytokine production. Zinc reduced ROS production, whereas both zinc and glutamine enhanced ion channel expression. Additionally, glutamine supported neuronal modulation. Glutamine, probiotics, and synbiotics enhanced tight junction expression, whereas probiotics and synbiotics also stimulated mucin production. Probiotics, synbiotics, and prebiotics acted through the gut microbiota, leading to increased production of short-chain fatty acids, secondary bile acids, and amino acid derivatives. GI, gastrointestinal; ROS, reactive oxygen species. Green arrows indicate processes that are enhanced, red arrows denote processes which are diminished. FIGURE 9 ONS was not effective at reducing any GI symptoms included in these analyses. However, the low number of qualifying studies evaluated ( n n Dietary counseling was effective at reducing diarrhea, constipation, nausea, anorexia, and vomiting incidence. No sub-meta-analyses could be conducted for dietary counseling due to the highly variable dietary recommendations: low fermentable oligosaccharides, disaccharides, monosaccharides, and polyols are short-chain carbohydrates, low-lactose, immunomodulatory, and individualized recommendations with variable number of counseling sessions and intervention durations. As counseling is the most personalized nutrition intervention type, future studies could leverage the positive results of the nutrient supplementation meta-analyses to produce more effective outcomes in counseling settings. In contrast to other approaches, specific nutrient supplementation was often effective at reducing cancer therapy-induced GI symptoms. In subanalyzes conducted according to type of nutrient, cancer, and cancer treatment—amino acid, fatty acid, probiotic, synbiotic, prebiotic, herbal, and mineral supplementations were found effective at treating a variety of GI symptoms. Amino acid supplementation reduced mucositis, anorexia, constipation, and diarrhea. These results are widely supported by the broader scientific literature, in which amino acids are demonstrated to support gut health via several mechanisms. Amino acids such as glutamine play an important role in maintaining intestinal structure and function by serving as a primary energy source for enterocytes and enhancing cell proliferation and differentiation [ 170 170 171 Therapies designed to modulate the gut microbiota—specifically prebiotics, probiotics, and synbiotics—reduced mucositis, diarrhea, nausea, and vomiting. However, it is difficult to attribute any of these benefits to 1 specific mechanism, given that no 2 studies implemented the same probiotic, prebiotic, or synbiotic combination. Microbial therapies elicit positive effects on the GI tract via microbial synthesis of small molecules including short-chain fatty acids, secondary bile acids, amino acid metabolites, and others in a continually growing list [ 172 173 173 Lactobacillus spp. Bifidobacterium spp Herbal supplementation reduced vomiting, diarrhea, mucositis, and nausea whereas mineral supplementation reduced mucositis. Ginger was the most studied herb representing about one-fourth of all herbal intervention studies (6 out of 21). Ginger consumption is recognized to modulate enteric nervous system signaling through stimulation of cholinergic and –5HT3 receptors, increasing gastric emptying (thereby reducing vomiting) [ 174 174 175 176 177 Essential fatty acids, such as omega-3 fatty acids, were demonstrated to reduce anorexia and nausea. This is unsurprising, as they are recognized to regulate immune responses via decreased synthesis of proinflammatory cytokines such as TNF, IL-1β, and IL-6 [ 178 Bifidobacterium 179 179 Overall, this systematic review highlights the efficacy of MNT to relieve GI symptoms during cancer treatment and highlights the potential of implementing these therapies more-widely. Dietitians should prescribe dietary modifications that target the underlying physiology of these GI symptoms in combination with weight-sustaining approaches. Other symptoms including proctitis, enteritis, and dysgeusia lacked the necessary 3 or more studies to evaluate via meta-analysis, indicating the need for further research in these areas. A continuing challenge in implementing these strategies is highlighted by the large variability within patients across studies. Personal differences between participants, including genetics, gut microbial composition, and lifestyle factors, likely influence individual responses to these interventions. This indicates that continued patient monitoring and personalized nutrition strategies are likely needed in the context of cancer treatment, where both systemic and demographic disadvantages are recognized to influence treatment outcomes [ 11 Author contributions The authors’ responsibilities were as follows – ZA: analyzed data and performed statistical analysis, drafted first manuscript; and all authors: designed research, conducted research, approved the final version of manuscript, edited and revised the manuscript. Funding ZA was supported by a Jonathan Baldwin Turner Graduate Fellowship through the University of Illinois at Urbana-Champaign Division of Nutritional Sciences Conflict of interest ZA reports financial support was provided by College of ACES University of Illinois at Urbana-Champaign References 1 Abernethy A.P. Wheeler J.L. Zafar S.Y. Management of gastrointestinal symptoms in advanced cancer patients: the rapid learning cancer clinic model Curr. Opin. Support Palliat. Care. 4 1 2010 36 45 19952928 10.1097/SPC.0b013e32833575fd PMC2871247 2 Han C.J. Reding K.W. Kalady M.F. Yung R. Greenlee H. Paskett E.D. Factors associated with long-term gastrointestinal symptoms in colorectal cancer survivors in the women's health initiatives (WHI study) PLOS ONE 18 5 2023 e0286058 10.1371/journal.pone.0286058 PMC10198480 37205667 3 Pulito C. Cristaudo A. Porta C. Zapperi S. Blandino G. Morrone A. Oral mucositis: the hidden side of cancer therapy J. Exp. Clin. Cancer Res. 39 1 2020 210 33028357 10.1186/s13046-020-01715-7 PMC7542970 4 Bossi P. De Luca R. Ciani O. D'Angelo E. Caccialanza R. Malnutrition management in oncology: an expert view on controversial issues and future perspectives Front. Oncol. 12 2022 910770 10.3389/fonc.2022.910770 PMC9579941 36276153 5 Wickham R. Evolving treatment paradigms for chemotherapy-induced nausea and vomiting Cancer Control 19 2 Suppl 2012 3 9 22488022 10.1177/107327481201902s02 6 Ippoliti C. Antidiarrheal agents for the management of treatment-related diarrhea in cancer patients Am. J. Health Syst. Pharm. 55 15 1998 1573 1580 9706182 10.1093/ajhp/55.15.1573 7 Toulson Davisson Correia M.I. Castro M. De Oliveira Toledo D. Farah D. Sansone D. De Morais Andrade T.R. Nutrition therapy cost-effectiveness model indicating how nutrition may contribute to the efficiency and financial sustainability of the health systems J. Parenter. Enteral Nutr. 45 7 2021 1542 1550 10.1002/jpen.2052 PMC8697995 33241592 8 Iragorri N. de Oliveira C. Fitzgerald N. Essue B. The out-of-pocket cost burden of cancer care—a systematic literature review Curr. Oncol. 28 2 2021 1216 1248 33804288 10.3390/curroncol28020117 PMC8025828 9 Xia H. Wang L. Wang H. Current research trends, hotspots, and frontiers of medical nutrition therapy on cancer: a bibliometric analysis Front. Oncol. 13 2023 1170198 10.3389/fonc.2023.1170198 PMC10196469 37213299 10 Holma R. Laatikainen R. Orell H. Joensuu H. Peuhkuri K. Poussa T. Consumption of lactose, other FODMAPs and diarrhoea during adjuvant 5-fluorouracil chemotherapy for colorectal cancer Nutrients 12 2 2020 407 32033152 10.3390/nu12020407 PMC7071323 11 Corsello A. Pugliese D. Gasbarrini A. Armuzzi A. Diet and nutrients in gastrointestinal chronic diseases Nutrients 12 9 2020 2693 32899273 10.3390/nu12092693 PMC7551310 12 Byrd D Wolf P. The microbiome as a determinant of racial and ethnic cancer disparities Nat. Rev. Cancer. 24 2 2024 89 90 37872443 10.1038/s41568-023-00638-7 13 Loman B.R. Luo M. Baggs G.E. Mitchell D.C. Nelson J.L. Ziegler T.R. Specialized high-protein oral nutrition supplement improves home nutrient intake of malnourished older adults without decreasing usual food intake, J. Parenter Enteral Nutr. 43 6 2019 794 802 10.1002/jpen.1467 PMC6924274 30565718 14 Andreou L. Burrows T. Surjan Y. The effect of nutritional interventions involving dietary counselling on gastrointestinal toxicities in adults receiving pelvic radiotherapy—a systematic review J. Med. Radiat. Sci. 68 4 2021 453 464 34288532 10.1002/jmrs.531 PMC8655625 15 Cereda E. Cappello S. Colombo S. Klersy C. Imarisio I. Turri A. Nutritional counseling with or without systematic use of oral nutritional supplements in head and neck cancer patients undergoing radiotherapy Radiother. Oncol. 126 1 2018 81 88 29111172 10.1016/j.radonc.2017.10.015 16 Allenby T.H. Crenshaw M.L. Mathis K. Champ C.E. Simone N.L. Schmitz K.H. A systematic review of home-based dietary interventions during radiation therapy for cancer Tech. Innov. Patient Support Radiat. Oncol. 16 2020 10 16 32995577 10.1016/j.tipsro.2020.08.001 PMC7501444 17 Wedlake L.J. Shaw C. Whelan K. Andreyev H.J. Systematic review: the efficacy of nutritional interventions to counteract acute gastrointestinal toxicity during therapeutic pelvic radiotherapy Aliment. Pharmacol. Ther. 37 11 2013 1046 1056 23611411 10.1111/apt.12316 18 Baldwin C. Spiro A. Ahern R. Emery P.W. Oral nutritional interventions in malnourished patients with cancer: a systematic review and meta-analysis J. Natl Cancer Inst. 104 5 2012 371 385 22345712 10.1093/jnci/djr556 19 de van der Schueren M.A.E. Laviano A. Blanchard H. Jourdan M. Arends J. Baracos V.E. Systematic review and meta-analysis of the evidence for oral nutritional intervention on nutritional and clinical outcomes during chemo(radio)therapy: current evidence and guidance for design of future trials Ann. Oncol. 29 5 2018 1141 1153 29788170 10.1093/annonc/mdy114 PMC5961292 20 Croisier E. Brown T. Bauer J. The efficacy of dietary fiber in managing gastrointestinal toxicity symptoms in patients with gynecologic cancers undergoing pelvic radiotherapy: a systematic review J. Acad. Nutr. Diet. 121 2 2021 261 277.e2 33127328 10.1016/j.jand.2020.08.077 21 Baguley B.J. Skinner T.L. Wright O.R.L. Nutrition therapy for the management of cancer-related fatigue and quality of life: a systematic review and meta-analysis Br. J. Nutr. 122 5 2019 527 541 30526701 10.1017/S000711451800363X 22 Moher D. Shamseer L. Clarke M. Ghersi D. Liberati A. Petticrew M. Preferred reporting items for systematic review and meta-analysis protocols (PRISMA-P) 2015 statement Syst. Rev. 4 1 2015 1 25554246 10.1186/2046-4053-4-1 PMC4320440 23 Moon Y. Sung J. An R. Hernandez M.E. Sosnoff J.J. Gait variability in people with neurological disorders: a systematic review and meta-analysis Hum. Mov. Sci. 47 2016 197 208 27023045 10.1016/j.humov.2016.03.010 24 Ravasco P. Monteiro-Grillo I. Marques Vidal P. Camilo M.E. Impact of nutrition on outcome: a prospective randomized controlled trial in patients with head and neck cancer undergoing radiotherapy Head Neck 27 8 2005 659 668 15920748 10.1002/hed.20221 25 Ravasco P. Monteiro-Grillo I. Vidal P.M. Camilo M.E. Dietary counseling improves patient outcomes: a prospective, randomized, controlled trial in colorectal cancer patients undergoing radiotherapy J. Clin. Oncol. 23 7 2005 1431 1438 15684319 10.1200/JCO.2005.02.054 26 De Filipp Z. Glotzbecker B. Luque L. Kim H.T. Mitchell K.M. Cheuvront S.N. Randomized study of enterade(R) to reduce diarrhea in patients receiving high-dose chemotherapy and autologous hematopoietic stem cell transplantation Asian Pac. J. Cancer Prev. 22 1 2021 301 304 33507712 10.31557/APJCP.2021.22.1.301 PMC8184175 27 Giger-Pabst U. Lange J. Maurer C. Bucher C. Schreiber V. Schlumpf R. Short-term preoperative supplementation of an immunoenriched diet does not improve clinical outcome in well-nourished patients undergoing abdominal cancer surgery Nutrition 25 5 2013 724 729 10.1016/j.nut.2012.10.007 23352174 28 Harada K. Minami H. Ferdous T. Kato Y. Umeda H. Horinaga D. The Elental((R)) elemental diet for chemoradiotherapy-induced oral mucositis: a prospective study in patients with oral squamous cell carcinoma Mol. Clin. Oncol. 10 1 2019 159 167 30655992 10.3892/mco.2018.1769 PMC6313952 29 Jiang W. Ding H. Li W. Ling Y. Hu C. Shen C. Benefits of oral nutritional supplements in patients with locally advanced nasopharyngeal cancer during concurrent chemoradiotherapy: an exploratory prospective randomized trial Nutr. Cancer. 70 8 2018 1299 1307 30633580 10.1080/01635581.2018.1557222 30 Katada C. Fukazawa S. Sugawara M. Sakamoto Y. Takahashi K. Takahashi A. Randomized study of prevention of gastrointestinal toxicities by nutritional support using an amino acid-rich elemental diet during chemotherapy in patients with esophageal cancer (KDOG 1101) Esophagus 18 2 2021 296 305 33009977 10.1007/s10388-020-00787-w 31 Smit J.M. Mulder N.H. Sleijfer D.T. Bouman J.G. Koudstaal J. Elema J.D. Gastrointestinal toxicity of chemotherapy and the influence of hyperalimentation Cancer 58 9 1986 1990 1994 3093054 10.1002/1097-0142(19861101)58:9<1990::aid-cncr2820580906>3.0.co;2-j 32 Toyomasu Y. Mochiki E. Yanai M. Suzuki M. Yanoma T. Kimura A. A prospective pilot study of an elemental nutritional supplement for prevention of oral mucositis during S-1 adjuvant chemotherapy for gastric cancer Surg. Oncol. 29 2019 97 101 31196501 10.1016/j.suronc.2019.04.003 33 Abdollahi R. Najafi S. Razmpoosh E. Shoormasti R.S. Haghighat S. Raji Lahiji M. The effect of dietary intervention along with nutritional education on reducing the gastrointestinal side effects caused by chemotherapy among women with breast cancer Nutr. Cancer. 71 6 2019 922 930 30945949 10.1080/01635581.2019.1590608 34 Bye A. Kaasa S. Ose T. Sundfor K. Trope C. The influence of low fat, low lactose diet on diarrhoea during pelvic radiotherapy Clin. Nutr. 11 3 1992 147 153 16839990 10.1016/0261-5614(92)90075-2 35 Soto-Lugo J.H. Souto-Del Bosque M.Á. Vázquez-Martínez C.A. Effectiveness of nutritional intervention in reduction of gastrointestinal toxicity during external beam radiotherapy in women with gynecological tumors Gac. Mex. Oncol. 16 2 2022 36 Souza A.P.S. Silva L.C.D. Fayh A.P.T. Nutritional intervention contributes to the improvement of symptoms related to quality of life in breast cancer patients undergoing neoadjuvant chemotherapy: a randomized clinical trial Nutrients 13 2 2021 589 33579050 10.3390/nu13020589 PMC7916763 37 Aghamohammadi A. Moslemi D. Akbari J. Ghasemi A. Azadbakht M. Asgharpour A. The effectiveness of Zataria extract mouthwash for the management of radiation-induced oral mucositis in patients: a randomized placebo-controlled double-blind study Clin. Oral Investig. 22 6 2018 2263 2272 10.1007/s00784-017-2324-7 29313134 38 Al-Kharabsheh M. Alwahedi H. Elhamshary J. Younis L. Al Masri M. The effect of chewing sugar-free gum to improve bowel movement after colorectal surgeries in patients with colorectal cancer SAGE Open Nurs 9 2023 23779608231170725 10.1177/23779608231170725 PMC10134175 37124376 39 Al-Taie A. Koseoglu A. Potential therapeutic effects of different mouthwashes for alleviation and treatment of oral complications of 5-fluorouracil-based chemotherapy in patients with colon cancer Eur. J. Hosp. Pharm. 30 4 2023 202 207 34285108 10.1136/ejhpharm-2021-002827 PMC10359790 40 Anandhi P. Sharief R.M. Rahila C. The benefit of zinc sulfate in oropharyngeal mucositis during hyperfractionated accelerated concomitant boost radiotherapy with concurrent cisplatin for advanced-stage oropharyngeal and hypopharyngeal cancers Indian J. Palliat. Care 26 4 2020 437 443 33623304 10.4103/IJPC.IJPC_20_20 PMC7888420 41 Aredes M.A. da Camara A.O. de Paula N.S. Fraga K.Y.D. do Carmo M. Chaves G.V. Efficacy of omega-3 supplementation on nutritional status, skeletal muscle, and chemoradiotherapy toxicity in cervical cancer patients: a randomized, triple-blind, clinical trial conducted in a middle-income country Nutrition 67–68 2019 110528 10.1016/j.nut.2019.06.009 31445316 42 Arslan M. Ozdemir L Oral intake of ginger for chemotherapy-induced nausea and vomiting among women with breast cancer Clin. J. Oncol. Nurs. 19 5 2015 E92 E97 26414587 10.1188/15.CJON.E92-E97 43 Asao T. Kuwano H. Nakamura J. Morinaga N. Hirayama I. Ide M. Gum chewing enhances early recovery from postoperative ileus after laparoscopic colectomy J. Am. Coll. Surg. 195 1 2002 30 32 12113542 10.1016/s1072-7515(02)01179-1 44 Aziz L.M.A. Salah T. Gharib F. The role of neoadjuvant FLOT chemotherapy with and without omega 3 in locally advanced gastric carcinoma J. BUON. 25 6 2021 2672 2677 33455112 45 Babaee N. Moslemi D. Khalilpour M. Vejdani F. Moghadamnia Y. Bijani A. Antioxidant capacity of calendula officinalis flowers extract and prevention of radiation induced oropharyngeal mucositis in patients with head and neck cancers: a randomized controlled clinical study Daru 21 1 2013 18 23497687 10.1186/2008-2231-21-18 PMC3623793 46 Badr L.K. El Asmar R. Hakim S. Saad R. Merhi R. Zahreddine A. The efficacy of honey or olive oil on the severity of oral mucositis and pain compared to placebo (standard care) in children with leukemia receiving intensive chemotherapy: a randomized controlled trial (RCT) J. Pediatr. Nurs. 70 2023 e48 e53 36792398 10.1016/j.pedn.2022.12.003 47 Bossi P. Cortinovis D. Fatigoni S. Cossu Rocca M. Fabi A. Seminara P. A randomized, double-blind, placebo-controlled, multicenter study of a ginger extract in the management of chemotherapy-induced nausea and vomiting (CINV) in patients receiving high-dose cisplatin Ann. Oncol. 28 10 2017 2547 2551 28666335 10.1093/annonc/mdx315 48 Bozzetti F. Biganzoli L. Gavazzi C. Cappuzzo F. Carnaghi C. Buzzoni R. Glutamine supplementation in cancer patients receiving chemotherapy: a double-blind randomized study Nutrition 13 7–8 1997 748 751 9263281 10.1016/s0899-9007(97)83038-9 49 Camargo C.Q. Mocellin M.C. Brunetta H.S. Chagas T.R. Fabre M.E.S. Trindade E. Fish oil decreases the severity of treatment-related adverse events in gastrointestinal cancer patients undergoing chemotherapy: a randomized, placebo-controlled, triple-blind clinical trial Clin. Nutr. ESPEN 31 2019 61 70 31060836 10.1016/j.clnesp.2019.02.015 50 Carr A.C. Vlasiuk E. Zawari M. Meijer N. Lauren C. MacPherson S. Supplementation with oral vitamin C prior to and during myeloablative chemotherapy and autologous haematopoietic stem cell transplantation: a pilot study Antioxidants (Basel) 11 10 2022 1949 36290671 10.3390/antiox11101949 PMC9598083 51 Charalambous M. Raftopoulos V. Paikousis L. Katodritis N. Lambrinou E. Vomvas D. The effect of the use of thyme honey in minimizing radiation—induced oral mucositis in head and neck cancer patients: a randomized controlled trial Eur. J. Oncol. Nurs. 34 2018 89 97 29784145 10.1016/j.ejon.2018.04.003 52 Chattopadhyay S. Saha A. Azam M. Mukherjee A. Sur P.K. Role of oral glutamine in alleviation and prevention of radiation-induced oral mucositis: a prospective randomized study South Asian J. Cancer. 3 1 2014 8 12 24665438 10.4103/2278-330X.126501 PMC3961877 53 Chen M. Ma L. Yu H. Huang S. Zhang J. Gong J. JK5G postbiotics attenuate immune-related adverse events in NSCLC patients by regulating gut microbiota: a randomized controlled trial in China Front. Oncol. 13 2023 1155592 10.3389/fonc.2023.1155592 PMC10436471 37601658 54 Chitapanarux I. Chitapanarux T. Traisathit P. Kudumpee S. Tharavichitkul E. Lorvidhaya V. Randomized controlled trial of live lactobacillus acidophilus plus bifidobacterium bifidum in prophylaxis of diarrhea during radiotherapy in cervical cancer patients Radiat. Oncol. 5 2010 31 20444243 10.1186/1748-717X-5-31 PMC2874795 55 Choi H. Kim J.H. Park J.Y. Ham B.K. Shim J. Bae J.H. Gum chewing promotes bowel motility after a radical retropubic prostatectomy, Asia Pac. J. Clin. Oncol. 10 1 2014 53 59 10.1111/ajco.12113 23937408 56 Choi K. Lee S.S. Oh S.J. Lim S.Y. Lim S.Y. Jeon W.K. The effect of oral glutamine on 5-fluorouracil/leucovorin-induced mucositis/stomatitis assessed by intestinal permeability test Clin. Nutr. 26 1 2007 57 62 16949180 10.1016/j.clnu.2006.07.003 57 Coghlin Dickson T.M. Wong R.M. Offrin R.S. Shizuru J.A. Johnston L.J. Hu W.W. Effect of oral glutamine supplementation during bone marrow transplantation JPEN J. Parenter. Enteral. Nutr. 24 2 2000 61 66 10772184 10.1177/014860710002400261 58 Crichton M. Marshall S. Isenring E. Lohning A. McCarthy A.L. Molassiotis A. Effect of a standardized ginger root powder regimen on chemotherapy-induced nausea and vomiting: a multicenter, double-blind, placebo-controlled randomized trial J. Acad. Nutr. Diet. 124 3 2024 313 330.e6 37699474 10.1016/j.jand.2023.09.003 59 Daniele B. Perrone F. Gallo C. Pignata S. De Martino S. De Vivo R. Oral glutamine in the prevention of fluorouracil induced intestinal toxicity: a double blind, placebo controlled, randomised trial Gut 48 1 2001 28 33 11115819 10.1136/gut.48.1.28 PMC1728161 60 de la Rosa Oliva F. Meneses Garcia A. Ruiz Calzada H. Astudillo de la Vega H. Bargallo Rocha E. Lara-Medina F. Effects of omega-3 fatty acids supplementation on neoadjuvant chemotherapy-induced toxicity in patients with locally advanced breast cancer: a randomized, controlled, double-blinded clinical trial, Nutr Hosp 36 4 2019 769 776 10.20960/nh.2338 31192682 61 De Loera Rodriguez L.H. Ortiz G.G. Rivero Moragrega P. Velazquez Brizuela I.E. Santoscoy Gutierrez J.F. Rincon Sanchez A.R. Effect of symbiotic supplementation on fecal calprotectin levels and lactic acid bacteria, Bifidobacteria, Escherichia coli and Salmonella DNA in patients with cervical cancer Nutr. Hosp. 35 6 2018 1394 1400 30525855 10.20960/nh.1762 62 de Luis D.A. Izaola O. Cuellar L. Terroba M.C. Martin T. Aller R. Clinical and biochemical outcomes after a randomized trial with a high dose of enteral arginine formula in postsurgical head and neck cancer patients Eur. J. Clin. Nutr. 61 2 2007 200 204 16929239 10.1038/sj.ejcn.1602515 63 Delia P. Sansotta G. Donato V. Frosina P. Messina G. De Renzis C. Use of probiotics for prevention of radiation-induced diarrhea World J. Gastroenterol. 13 6 2007 912 915 17352022 10.3748/wjg.v13.i6.912 PMC4065928 64 Demers M. Dagnault A. Desjardins J. A randomized double-blind controlled trial: impact of probiotics on diarrhea in patients treated with pelvic radiation Clin. Nutr. 33 5 2014 761 767 24200199 10.1016/j.clnu.2013.10.015 65 Du S.X. Jia Y.R. Ren S.Q. Gong X.J. Tang H. Wan-Shui W. The protective effects of Bacillus licheniformis preparation on gastrointestinal disorders and inflammation induced by radiotherapy in pediatric patients with central nervous system tumor Adv. Med. Sci. 63 1 2018 134 139 29120854 10.1016/j.advms.2017.09.005 66 Eghbali A. Ghaffari K. Khalilpour A. Afzal R.R. Eghbali A. Ghasemi A. The effects of LactoCare synbiotic administration on chemotherapy-induced nausea, vomiting, diarrhea, and constipation in children with ALL: a double-blind randomized clinical trial Pediatr. Blood Cancer 70 6 2023 e30328 10.1002/pbc.30328 36975174 67 Eghbali A. Taherkhanchi B. Bagheri B. Sadeghi Sedeh B. Effect of chewing gum on oral mucositis in children undergoing chemotherapy: a randomized controlled study Iran J. Ped. Hematol. Oncol. 6 1 2016 9 14 27222697 PMC4867166 68 Elkerm Y. Tawashi R. Date palm pollen as a preventative intervention in radiation- and chemotherapy-induced oral mucositis: a pilot study, Integr Cancer Ther. 13 6 2014 468 472 10.1177/1534735414547110 25148841 69 Ertas I.E. Gungorduk K. Ozdemir A. Solmaz U. Dogan A. Yildirim Y. Influence of gum chewing on postoperative bowel activity after complete staging surgery for gynecological malignancies: a randomized controlled trial Gynecol. Oncol. 131 1 2013 118 122 23906657 10.1016/j.ygyno.2013.07.098 70 Faramarzi E. Mahdavi R. Mohammad-Zadeh M. Nasirimotlagh B. Sanaie S. Effect of conjugated linoleic acid supplementation on quality of life in rectal cancer patients undergoing preoperative chemoradiotherapy Pak. J. Med. Sci. 33 2 2017 383 388 28523042 10.12669/pjms.332.11925 PMC5432709 71 Fernandes P.M. Rosalen P.L. Fernandes D.T. Dias-Neto E. Alencar S.M. Bueno-Silva B. Brazilian organic propolis for prevention and treatment of radiation-related oral acute toxicities in head and neck cancer patients: a double-blind randomized clinical trial Front. Pharmacol. 13 2022 973255 10.3389/fphar.2022.973255 PMC9585325 36278178 72 Ferreira P.R. Fleck J.F. Diehl A. Barletta D. Braga-Filho A. Barletta A. Protective effect of alpha-tocopherol in head and neck cancer radiation-induced mucositis: a double-blind randomized trial Head Neck 26 4 2004 313 321 15054734 10.1002/hed.10382 73 Fukaya M. Yokoyama Y. Usui H. Fujieda H. Sakatoku Y. Takahashi T. Impact of synbiotics treatment on bacteremia induced during neoadjuvant chemotherapy for esophageal cancer: a randomised controlled trial Clin. Nutr. 40 12 2021 5781 5791 34775221 10.1016/j.clnu.2021.10.004 74 Gandemer V. Le Deley M.C. Dollfus C. Auvrignon A. Bonnaure-Mallet M. Duval M. Multicenter randomized trial of chewing gum for preventing oral mucositis in children receiving chemotherapy J. Pediatr. Hematol. Oncol. 29 2 2007 86 94 17279004 10.1097/MPH.0b013e318030a3e4 75 Garcia-Peris P. Velasco C. Hernandez M. Lozano M.A. Paron L. de la Cuerda C. Effect of inulin and fructo-oligosaccharide on the prevention of acute radiation enteritis in patients with gynecological cancer and impact on quality-of-life: a randomized, double-blind, placebo-controlled trial Eur. J. Clin. Nutr. 70 2 2016 170 174 26603881 10.1038/ejcn.2015.192 76 Ge B. Zhao H. Lin R. Wang J. Chen Q. Liu L. Influence of gum-chewing on postoperative bowel activity after laparoscopic surgery for gastric cancer: a randomized controlled trial Medicine (Baltimore) 96 13 2017 e6501 10.1097/MD.0000000000006501 PMC5380284 28353600 77 Gholizadeh N. Mehdipour M. Chavoshi S.H. Kahani S. Sadrzadeh-Afshar M.-S. The effect of orally-administered zinc in the prevention of chemotherapy-induced oral mucositis in patients with acute myeloid leukemia Int. J. Cancer Manag. 10 8 2017 e9252 78 Giralt J. Regadera J.P. Verges R. Romero J. de la Fuente I. Biete A. Effects of probiotic Lactobacillus casei DN-114 001 in prevention of radiation-induced diarrhea: results from multicenter, randomized, placebo-controlled nutritional trial Int. J. Radiat. Oncol. Biol. Phys. 71 4 2008 1213 1219 18243569 10.1016/j.ijrobp.2007.11.009 79 Gungördük K. Ozdemir I.A. Gungorduk O. Gulseren V. Gokcu M. Sanci M. Effects of coffee consumption on gut recovery after surgery of gynecological cancer patients: a randomized controlled trial Am. J. Obstet. Gynecol. 216 2 2017 145 e1 7 10.1016/j.ajog.2016.10.019 27780709 80 Hashemipour M.A. Barzegari S. Kakoie S. Aghahi R.H. Effects of omega-3 fatty acids against chemotherapy-induced mucositis: a double-blind randomized clinical trial Wounds 29 12 2017 360 366 29324423 81 Hershman D.L. Unger J.M. Crew K.D. Minasian L.M. Awad D. Moinpour C.M. Randomized double-blind placebo-controlled trial of acetyl-L-carnitine for the prevention of taxane-induced neuropathy in women undergoing adjuvant breast cancer therapy J. Clin. Oncol. 31 20 2013 2627 2633 23733756 10.1200/JCO.2012.44.8738 PMC3699727 82 Hirayama I. Suzuki M. Ide M. Asao T. Kuwano H. Gum-chewing stimulates bowel motility after surgery for colorectal cancer Hepatogastroenterology 53 68 2006 206 208 16608025 83 Hsu Y.C. Szu S.Y. Effects of gum chewing on recovery from postoperative ileus: a randomized clinical trail J. Nurs. Res. 30 5 2022 e233 10.1097/jnr.0000000000000510 35951432 84 Huang C.J. Huang M.Y. Fang P.T. Chen F. Wang Y.T. Chen C.H. Randomized double-blind, placebo-controlled trial evaluating oral glutamine on radiation-induced oral mucositis and dermatitis in head and neck cancer patients Am. J. Clin. Nutr. 109 3 2019 606 614 30753262 10.1093/ajcn/nqy329 PMC6408208 85 Huang E.Y. Leung S.W. Wang C.J. Chen H.C. Sun L.M. Fang F.M. Oral glutamine to alleviate radiation-induced oral mucositis: a pilot randomized trial Int. J. Radiat. Oncol. Biol. Phys. 46 3 2000 535 539 10701731 10.1016/s0360-3016(99)00402-2 86 Hussein R.M. The influence of fish oil supplementation on the adverse effects of chemotherapy in patients with hepatocellular carcinoma J. Chem. Health Risks 13 1 2023 125 133 87 Ikeguchi M. Yamamoto M. Arai Y. Maeta Y. Ashida K. Katano K. Fucoidan reduces the toxicities of chemotherapy for patients with unresectable advanced or recurrent colorectal cancer, Oncol Lett 2 2 2011 319 322 10.3892/ol.2011.254 PMC3410608 22866084 88 Islambulchilar M. Asvadi I. Sanaat Z. Esfahani A. Sattari M. Taurine attenuates chemotherapy-induced nausea and vomiting in acute lymphoblastic leukemia Amino Acids 47 1 2015 101 109 25323734 10.1007/s00726-014-1840-x 89 Itoh Y. Mizuno M. Ikeda M. Nakahara R. Kubota S. Ito J. A Randomized, double-blind pilot trial of hydrolyzed rice bran versus placebo for radioprotective effect on acute gastroenteritis secondary to chemoradiotherapy in patients with cervical cancer Evid. Based Complement. Alternat. Med. 2015 2015 974390 10.1155/2015/974390 PMC4674603 26693248 90 Jafarimanesh H. Akbari M. Hoseinian R. Zarei M. Harorani M. The effect of peppermint (Mentha piperita) extract on the severity of nausea, vomiting and anorexia in patients with breast cancer undergoing chemotherapy: a randomized controlled trial Integr. Cancer Ther. 19 2020 1534735420967084 10.1177/1534735420967084 PMC7605047 33118401 91 Jahangard-Rafsanjani Z. Gholami K. Hadjibabaie M. Shamshiri A.R. Alimoghadam K. Sarayani A. The efficacy of selenium in prevention of oral mucositis in patients undergoing hematopoietic SCT: a randomized clinical trial Bone Marrow Transplant 48 6 2013 832 836 23292233 10.1038/bmt.2012.250 92 Jayalekshmi J.L. Lakshmi R. Mukerji A. Honey on oral mucositis: a randomized controlled trial Gulf J. Oncolog. 1 20 2016 30 37 27050177 93 Jiang C. Wang H. Xia C. Dong Q. Chen E. Qiu Y. A randomized, double-blind, placebo-controlled trial of probiotics to reduce the severity of oral mucositis induced by chemoradiotherapy for patients with nasopharyngeal carcinoma Cancer 125 7 2019 1081 1090 30521105 10.1002/cncr.31907 94 Karabey T. Karagozogli S. Aygun N. Sumer Z. The effect of oral care with black mulberry extract on oral mucositis, dry mouth, and weight gain in patients with cancer Clin. J. Oncol. Nurs. 26 6 2022 636 642 36413721 10.1188/22.CJON.636-642 95 Khazaei Y. Basi A. Fernandez M.L. Foudazi H. Bagherzadeh R. Shidfar F. The effects of synbiotics supplementation on reducing chemotherapy-induced side effects in women with breast cancer: a randomized placebo-controlled double-blind clinical trial BMC Complement. Med. Ther. 23 1 2023 339 37752516 10.1186/s12906-023-04165-8 PMC10521476 96 Kia S.J. Basirat M. Saedi H.S. Arab S.A. Effects of nanomicelle curcumin capsules on prevention and treatment of oral mucosits in patients under chemotherapy with or without head and neck radiotherapy: a randomized clinical trial BMC Complement. Med. Ther. 21 1 2021 232 34521398 10.1186/s12906-021-03400-4 PMC8442420 97 Kim H.S. Kim M.K. Lee M. Kwon B.S. Suh D.H. Song Y.S. Effect of red ginseng on genotoxicity and health-related quality of life after adjuvant chemotherapy in patients with epithelial ovarian cancer: a randomized, double blind, placebo-controlled trial Nutrients 9 7 2017 772 28753932 10.3390/nu9070772 PMC5537886 98 Kobayashi M. Sato R. Komura T. Ichikawa H. Hirashima T. Otake S. Protective effect of the oral administration of cystine and theanine on oxaliplatin-induced peripheral neuropathy: a pilot randomized trial Int. J. Clin. Oncol. 25 10 2020 1814 1821 32594273 10.1007/s10147-020-01728-4 PMC7498479 99 Kobayashi T. Masaki T. Kogawa K. Matsuoka H. Sugiyama M. Efficacy of gum chewing on bowel movement after open colectomy for left-sided colorectal cancer: a randomized clinical trial Dis. Colon. Rectum. 58 11 2015 1058 1063 26445178 10.1097/DCR.0000000000000452 100 Kokkonen J. Möttönen M. Karttunen T.J. Lanning M. Mucosal pathology of the upper gastrointestinal tract associated with intensive chemotherapy in children: vitamin A supplements do not prevent lesions Pediatr. Hematol. Oncol. 19 3 2002 181 192 11936731 10.1080/088800102753541332 101 Kooshyar M.M. Mozafari P.M. Amirchaghmaghi M. Pakfetrat A. Karoos P. Mohasel M.R. A randomized placebo- controlled double blind clinical trial of quercetin in the prevention and treatment of chemotherapy-induced oral mucositis J. Clin. Diagn. Res. 11 3 2017 ZC46 ZC50 10.7860/JCDR/2017/23975.9571 PMC5427434 28511508 102 Kucuktulu E. Guner A. Kahraman I. Topbas M. Kucuktulu U. The protective effects of glutamine on radiation-induced diarrhea Support Care Cancer 21 4 2013 1071 1075 23064902 10.1007/s00520-012-1627-0 103 Laali E. Manifar S. Kazemian A. Jahangard-Rafsanjani Z. Gholami K. Effect of selenium on incidence and severity of mucositis during radiotherapy in patients with head and neck cancer Oral Health Prev. Dent. 18 4 2020 765 771 32895660 10.3290/j.ohpd.a45080 PMC11654496 104 Lages P.C. Generoso S.V. Correia M. Postoperative symbiotic in patients with head and neck cancer: a double-blind randomised trial Br. J. Nutr. 119 2 2018 190 195 29277158 10.1017/S0007114517003403 105 Law K.S. Azman N. Omar E.A. Musa M.Y. Yusoff N.M. Sulaiman S.A. The effects of virgin coconut oil (VCO) as supplementation on quality of life (QOL) among breast cancer patients Lipids Health Dis 13 1 2014 139 25163649 10.1186/1476-511X-13-139 PMC4176590 106 Li G.H. Wang D.L. Hu Y.D. Pu P. Li D.Z. Wang W.D. Berberine inhibits acute radiation intestinal syndrome in human with abdomen radiotherapy Med. Oncol. 27 3 2010 919 925 19757213 10.1007/s12032-009-9307-8 107 Li X. Qin Y. Liu W. Zhou X.-Y. Li Y.-N. Wang L.-Y. Efficacy of ginger in ameliorating acute and delayed chemotherapy-induced nausea and vomiting among patients with lung cancer receiving cisplatin-based regimens: a randomized controlled trial Integr. Cancer Ther. 17 3 2018 747 754 29417850 10.1177/1534735417753541 PMC6142108 108 Li Y. Yu Z. Liu F. Tan L. Wu B. Li J. Oral glutamine ameliorates chemotherapy-induced changes of intestinal permeability and does not interfere with the antitumor effect of chemotherapy in patients with breast cancer: a prospective randomized trial Tumori 92 5 2006 396 401 17168431 109 Lin L.C. Que J. Lin L.K. Lin F.C. Zinc supplementation to improve mucositis and dermatitis in patients after radiotherapy for head-and-neck cancers: a double-blind, randomized study Int. J. Radiat. Oncol. Biol. Phys. 65 3 2006 745 750 16751063 10.1016/j.ijrobp.2006.01.015 110 Liu D. Jing X. Cao S. Liu X. Tan X. Jiang H. Impact of drinking Chinese green tea on postoperative short outcomes for gastric cancer: a randomized controlled trial Eur. J. Clin. Nutr. 75 11 2021 1568 1577 33742159 10.1038/s41430-021-00868-8 PMC8563416 111 Liu Z. Li C. Huang M. Tong C. Zhang X. Wang L. Positive regulatory effects of perioperative probiotic treatment on postoperative liver complications after colorectal liver metastases surgery: a double-center and double-blind randomized clinical trial BMC Gastroenterol 15 2015 34 25881090 10.1186/s12876-015-0260-z PMC4374379 112 Liu Z. Qin H. Yang Z. Xia Y. Liu W. Yang J. Randomised clinical trial: the effects of perioperative probiotic treatment on barrier function and post-operative infectious complications in colorectal cancer surgery—a double-blind study Aliment Pharmacol. Ther. 33 1 2011 50 63 21083585 10.1111/j.1365-2036.2010.04492.x 113 Lustberg M.B. Orchard T.S. Reinbolt R. Andridge R. Pan X. Belury M. Randomized placebo-controlled pilot trial of omega 3 fatty acids for prevention of aromatase inhibitor-induced musculoskeletal pain Breast Cancer Res. Treat. 167 3 2018 709 718 29101597 10.1007/s10549-017-4559-z PMC5809189 114 Mahajan M.K. Singh V. Assessment of efficacy of pyridoxine in control of radiation induced sickness J. Indian Med. Assoc. 96 3 1998 82 83 9828551 115 Mahdavi R. Faramarzi E. Mohammad-Zadeh M. Nasirimotlagh B. Ghaemmaghami S.J. Effects of conjugated linoleic acid supplementation on nutritional status, symptoms of eating problems and dietary intake in rectal cancer patients undergoing chemoradiotherapy Curr. Topics Nutraceutical Res. 11 1–2 2013 15 20 116 Manifar S. Koopaie M. Jahromi Z.M. Kolahdooz S. Effect of synbiotic mouthwash on oral mucositis induced by radiotherapy in oral cancer patients: a double-blind randomized clinical trial Support Care Cancer 31 1 2022 31 36517616 10.1007/s00520-022-07521-5 117 Mansouri A. Hadjibabaie M. Iravani M. Shamshiri A.R. Hayatshahi A. Javadi M.R. The effect of zinc sulfate in the prevention of high-dose chemotherapy-induced mucositis: a double-blind, randomized, placebo-controlled study Hematol. Oncol 30 1 2012 22 26 21692101 10.1002/hon.999 118 Mansouri-Tehrani H.S. Khorasgan M.R. Roayaei M. Effects of probiotics with or without honey on radiation-induced diarrhea Int. J. Radiat. Res. 14 3 2016 205 213 119 Mego M. Chovanec J. Vochyanova-Andrezalova I. Konkolovsky P. Mikulova M. Reckova M. Prevention of irinotecan induced diarrhea by probiotics: a randomized double blind, placebo controlled pilot study Complement. Ther. Med. 23 3 2015 356 362 26051570 10.1016/j.ctim.2015.03.008 120 Mocellin M.C. Camargo C.Q. Fabre M.E.S. Trindade E.B.S.M. Fish oil effects on quality of life, body weight and free fat mass change in gastrointestinal cancer patients undergoing chemotherapy: a triple blind, randomized clinical trial J. Funct. Foods. 31 2017 113 122 121 Mohammadi F. Oshvandi K. Kamallan S.R. Khazaei S. Ranjbar H. Ahmadi-Motamayel F. Effectiveness of sodium bicarbonate and zinc chloride mouthwashes in the treatment of oral mucositis and quality of life in patients with cancer under chemotherapy Nurs. Open. 9 3 2022 1602 1611 35170247 10.1002/nop2.1168 PMC8994952 122 Mokhtar G.M. Shaaban S.Y. Elbarbary N.S. Fayed W.A. A trial to assess the efficacy of glutamic acid in prevention of vincristine-induced neurotoxicity in pediatric malignancies: a pilot study J. Pediatr. Hematol. Oncol. 32 8 2010 594 600 20921909 10.1097/MPH.0b013e3181e9038d 123 Motoori M. Yano M. Miyata H. Sugimura K. Saito T. Omori T. Randomized study of the effect of synbiotics during neoadjuvant chemotherapy on adverse events in esophageal cancer patients Clin. Nutr. 36 1 2017 93 99 26644166 10.1016/j.clnu.2015.11.008 124 Muecke R. Reichl B. Glatzel M. Baaske D. Berndt-Skorka R. Buentzel J. Sodium selenite in gynecologic radiation oncology-final results of a prospective randomized observation study Int. J. Radiat. Oncol. Biol. Phys. 69 3 2007 S393 125 Mutluay Yayla E. Izgu N. Ozdemir L. Aslan Erdem S. Kartal M. Sage tea-thyme-peppermint hydrosol oral rinse reduces chemotherapy-induced oral mucositis: a randomized controlled pilot study Complement. Ther. Med. 27 2016 58 64 27515877 10.1016/j.ctim.2016.05.010 126 Oshvandi K. Vafaei S.Y. Kamallan S.R. Khazaei S. Ranjbar H. Mohammadi F. Effectiveness of zinc chloride mouthwashes on oral mucositis and weight of patients with cancer undergoing chemotherapy BMC Oral Health 21 1 2021 364 34294072 10.1186/s12903-021-01706-w PMC8296564 127 Panahi Y. Saadat A. Sahebkar A. Hashemian F. Taghikhani M. Abolhasani E. Effect of ginger on acute and delayed chemotherapy-induced nausea and vomiting: a pilot, randomized, open-label clinical trial Integr. Cancer Ther. 11 3 2012 204 211 22313739 10.1177/1534735411433201 128 Phutsisen J. Kietpeerakool C. Jampathong N. Chumworathayi B. Temtanakitpaisan A. Aue-Aungkul A. Effects of Cassia alata Linn on bowel function recovery following surgery for gynecological cancer: a randomized controlled trial Complement. Ther. Med. 47 2019 102222 10.1016/j.ctim.2019.102222 31779993 129 Pillai A.K. Sharma K.K. Gupta Y.K. Bakhshi Antietpeerakool S.C. Jampathong N. Chumworathayi B. Effeciving high emetogenic chemotherapy Pediatr. Blood Cancer 56 2 2011 234 238 20842754 10.1002/pbc.22778 130 Quah H.M. Samad A. Neathey A.J. Hay D.J. Maw A. Does gum chewing reduce postoperative ileus following open colectomy for left-sided colon and rectal cancer? A prospective randomized controlled trial Colorectal Dis 8 1 2006 64 70 16519641 10.1111/j.1463-1318.2005.00884.x 131 Rambod M. Pasyar N. Ramzi M. The effect of zinc sulfate on prevention, incidence, and severity of mucositis in leukemia patients undergoing chemotherapy Eur. J. Oncol. Nurs. 33 2018 14 21 29551172 10.1016/j.ejon.2018.01.007 132 Rashad U.M. Al-Gezawy S.M. El-Gezawy E. Azzaz A.N. Honey as topical prophylaxis against radiochemotherapy-induced mucositis in head and neck cancer J. Laryngol. Otol. 123 2 2009 223 228 18485252 10.1017/S0022215108002478 133 Rathe M. De Pietri S. Wehner P.S. Frandsen T.L. Grell K. Schmiegelow K. Bovine colostrum against chemotherapy-induced gastrointestinal toxicity in children with acute lymphoblastic leukemia: a randomized, double-blind, placebo-controlled trial JPEN J. Parenter. Enteral. Nutr. 44 2 2020 337 347 30861163 10.1002/jpen.1528 134 Reyna-Figueroa J. Barron-Calvillo E. Garcia-Parra C. Galindo-Delgado P. Contreras-Ochoa C. Lagunas-Martinez A. Probiotic supplementation decreases chemotherapy-induced gastrointestinal side effects in patients with acute leukemia J. Pediatr. Hematol. Oncol. 41 6 2019 468 472 31033786 10.1097/MPH.0000000000001497 135 Rodríguez-Padilla Á. Morales-Martín G. Pérez-Quintero R. Gómez-Salgado J. Balongo-García R. Ruiz-Frutos C. Postoperative ileus after stimulation with probiotics before ileostomy closure Nutrients 13 2 2021 626 33671968 10.3390/nu13020626 PMC7919021 136 Rohr U.D. Li W.W. Ziqiang H. Wainright W. Schindler A.E. The effect of fermented soy (FSWW08) on blood hematology and cachexia in cancer patients, Horm Mol. Biol. Clin. Investig. 12 3 2012 407 418 10.1515/hmbci-2012-0028 25436700 137 Rosli D. Shahar S. Manaf Z.A. Lau H.J. Yusof N.Y.M. Haron M.R. Randomized controlled trial on the effect of partially hydrolyzed guar gum supplementation on diarrhea frequency and gut microbiome count among pelvic radiation patients J. Parenter. Enteral. Nutr. 45 2 2021 277 286 10.1002/jpen.1987 32740950 138 Sahebnasagh M. Aksi V. Eslami F. Lashkardoost H. Kasaian J. Golmohammadzadeh S. Prevention of radiotherapy-related oral mucositis with zinc and polyherbal mouthwash: a double-blind, randomized clinical trial Eur. J. Med. Res. 28 1 2023 109 36864527 10.1186/s40001-023-01015-8 PMC9979417 139 Salminen E. Elomaa I. Minkkinen J. Vapaatalo H. Salminen S. Preservation of intestinal integrity during radiotherapy using live Lactobacillus acidophilus cultures Clin. Radiol. 39 4 1988 435 437 3141101 10.1016/s0009-9260(88)80296-4 140 Sánchez-Lara K. Turcott J.G. Juarez-Hernandez E. Nunez-Valencia C. Villanueva G. Guevara P. Effects of an oral nutritional supplement containing eicosapentaenoic acid on nutritional and clinical outcomes in patients with advanced non-small cell lung cancer: randomised trial Clin. Nutr. 33 6 2014 1017 1023 24746976 10.1016/j.clnu.2014.03.006 141 Sangthawan D. Phungrassami T. Sinkitjarurnchai W. A randomized double-blind, placebo-controlled trial of zinc sulfate supplementation for alleviation of radiation-induced oral mucositis and pharyngitis in head and neck cancer patients J. Med. Assoc. Thai. 96 1 2013 69 76 23720981 142 Shah D. Gupta A. Meena J.P. Kumar Gupta A. Velpandian T. Pandey R.M. Efficacy and safety of zinc in the prevention of oral mucositis in children with cancer receiving intensified chemotherapy: a randomized double-blind placebo-controlled trial Pediatr. Blood Cancer 70 7 2023 e30309 10.1002/pbc.30309 37057824 143 Sharma A. Rath G.K. Chaudhary S.P. Thakar A. Mohanti B.K. Bahadur S. Lactobacillus brevis CD2 lozenges reduce radiation- and chemotherapy-induced mucositis in patients with head and neck cancer: a randomized double-blind placebo-controlled study Eur. J. Cancer. 48 6 2012 875 881 21741230 10.1016/j.ejca.2011.06.010 144 Sieja K. Talerczyk M. Selenium as an element in the treatment of ovarian cancer in women receiving chemotherapy Gynecol. Oncol. 93 2 2004 320 327 15099940 10.1016/j.ygyno.2003.12.013 145 Sim E. Kim J.M. Lee S.M. Chung M.J. Song S.Y. Kim E.S. The effect of omega-3 enriched oral nutrition supplement on nutritional indices and quality of life in gastrointestinal cancer patients: a randomized clinical trial Asian Pac. J. Cancer Prev. 23 2 2022 485 494 35225460 10.31557/APJCP.2022.23.2.485 PMC9272633 146 Solís-Martínez O. Plasa-Carvalho V. Phillips-Sixtos G. Trujillo-Cabrera Y. Hernandez-Cuellar A. Queipo-Garcia G.E. Effect of eicosapentaenoic acid on body composition and inflammation markers in patients with head and neck squamous cell cancer from a public hospital in Mexico Nutr. Cancer. 70 4 2018 663 670 29697274 10.1080/01635581.2018.1460678 147 Soltani G.M. Hemati S. Sarvizadeh M. Kamalinejad M. Tafazoli V. Latifi S.A. Efficacy of the plantago major L. syrup on radiation induced oral mucositis in head and neck cancer patients: a randomized, double blind, placebo-controlled clinical trial Complement. Ther. Med. 51 2020 102397 10.1016/j.ctim.2020.102397 32507421 148 Strasser F. Demmer R. Bohme C. Schmitz S.F. Thuerlimann B. Cerny T. Prevention of docetaxel- or paclitaxel-associated taste alterations in cancer patients with oral glutamine: a randomized, placebo-controlled, double-blind study Oncologist 13 3 2008 337 346 18378545 10.1634/theoncologist.2007-0217 149 Thomas P.L. Kang H.K. Rishi K.S. Randomized control study of the effects of turmeric mouthwash on oral health status, treatment-induced mucositis, and associated oral dysfunctions among patients with head and neck cancer Cancer Nurs 46 1 2023 36 44 36066336 10.1097/NCC.0000000000001149 150 Tsuchiya T. Honda H. Oikawa M. Kakita T. Oyama A. Oishi H. Oral administration of the amino acids cystine and theanine attenuates the adverse events of S-1 adjuvant chemotherapy in gastrointestinal cancer patients Int. J. Clin. Oncol. 21 6 2016 1085 1090 27306219 10.1007/s10147-016-0996-7 PMC5124434 151 Valadares F. Garbi Novaes M.R. Canete R. Effect of Agaricus sylvaticus supplementation on nutritional status and adverse events of chemotherapy of breast cancer: a randomized, placebo-controlled, double-blind clinical trial Indian J. Pharmacol. 45 3 2013 217 222 23833361 10.4103/0253-7613.111894 PMC3696289 152 Wei H. Yue Z. Han J. Chen P. Xie K. Sun Y. Oral compound probiotic supplements can improve the quality of life for patients with lung cancer during chemotherapy: a randomized placebo-controlled study, Thorac Cancer. 15 2 2024 182 191 10.1111/1759-7714.15177 PMC10788472 38018652 153 Werida R.H. Elshafiey R.A. Ghoneim A. Elzawawy S. Mostafa T.M. Role of alpha-lipoic acid in counteracting paclitaxel- and doxorubicin-induced toxicities: a randomized controlled trial in breast cancer patients Support Care Cancer 30 9 2022 7281 7292 35596774 10.1007/s00520-022-07124-0 PMC9385783 154 Widjaja N.A. Pratama A. Prihaningtyas R. Irawan R. Ugrasena I. Efficacy oral glutamine to prevent oral mucositis and reduce hospital costs during chemotherapy in children with acute lymphoblastic leukemia Asian Pac. J. Cancer Prev. 21 7 2020 2117 2121 32711440 10.31557/APJCP.2020.21.7.2117 PMC7573404 155 Xie H. Lu Q. Wang H. Zhu X. Guan Z. Effects of probiotics combined with enteral nutrition on immune function and inflammatory response in postoperative patients with gastric cancer J. BUON. 23 3 2018 678 683 30003737 156 You W.C. Hsieh C.C. Huang J.T. Effect of extracts from indigowood root (isatis indigotica fort.) on immune responses in radiation-induced mucositis, J. Altern. Complement Med. 15 2009 771 778 10.1089/acm.2008.0322 19534614 157 Zhao R. Wang Y. Huang Y. Cui Y. Xia L. Rao Z. Effects of fiber and probiotics on diarrhea associated with enteral nutrition in gastric cancer patients: a prospective randomized and controlled trial Medicine (Baltimore) 96 43 2017 e8418 10.1097/MD.0000000000008418 PMC5671874 29069041 158 Zou J.Y. Xu Y. Wang X.H. Jiang Q. Zhu X.M. Improvement of constipation in leukemia patients undergoing chemotherapy using sweet potato Cancer Nurs 39 3 2016 181 186 25881813 10.1097/NCC.0000000000000257 159 Dulskas A. Klimovskij M. Vitkauskiene M. Samalavicius N.E. Effect of coffee on the length of postoperative ileus after elective laparoscopic left-sided colectomy: a randomized, prospective single-center study Dis. Colon Rectum 58 11 2015 1064 1069 26445179 10.1097/DCR.0000000000000449 160 Tian Y. Li M. Song W. Jiang R. Li Y.Q. Effects of probiotics on chemotherapy in patients with lung cancer Oncol. Lett. 17 3 2019 2836 2848 30854059 10.3892/ol.2019.9906 PMC6365978 161 Yanagimoto H. Hirooka S. Yamamoto T. Yamaki S. Sekimoto M. Efficacy of Lentinula edodes Mycelia Nutr. Cancer. 75 1 2023 236 246 35950537 10.1080/01635581.2022.2107226 162 Sittitrai P. Ruenmarkkaew D. Booyaprapa S. Kasempitakpong B. Effect of a perioperative immune-enhancing diet in clean-contaminated head and neck cancer surgery: a randomized controlled trial Int J Surg 93 2021 106051 34371175 10.1016/j.ijsu.2021.106051 163 Schulz A. Schürmann C. Skipka G. Bender R. Performing Meta-analyses with Very Few Studies 2022 Springer US 91 102 10.1007/978-1-0716-1566-9_5 34550585 164 Dettori J.R. Norvell D.C. Chapman J.R. Fixed-effect vs random-effects models for meta-analysis: 3 points to consider Glob. Spine J 12 7 2022 1624 1626 10.1177/21925682221110527 PMC9393987 35723546 165 von Hippel P.T. The heterogeneity statistic I(2) can be biased in small meta-analyses BMC Med. Res. Methodol. 15 2015 35 25880989 10.1186/s12874-015-0024-z PMC4410499 166 Dalton J.E. Bolen S.D. Mascha E.J. Publication bias: the elephant in the review Anesth. Analg. 123 4 2016 812 813 27636569 10.1213/ANE.0000000000001596 PMC5482177 167 Higgins J.P. Altman D.G. Gotzsche P.C. Juni P. Moher D. Oxman A.D. The Cochrane Collaboration's tool for assessing risk of bias in randomised trials BMJ 343 2011 d5928 10.1136/bmj.d5928 PMC3196245 22008217 168 Brydges C.R. Effect size guidelines, sample size calculations, and statistical power in gerontology Innov. Aging. 3 4 2019 igz036 31528719 10.1093/geroni/igz036 PMC6736231 169 Arnold M. Abnet C.C. Neale R.E. Vignat J. Giovannucci E.L. McGlynn K.A. Global burden of 5 major types of gastrointestinal cancer Gastroenterology 159 1 2020 335 349.e15 32247694 10.1053/j.gastro.2020.02.068 PMC8630546 170 Kim M.H. Kim H. The roles of glutamine in the intestine and its implication in intestinal diseases Int. J. Mol. Sci. 18 5 2017 1051 28498331 10.3390/ijms18051051 PMC5454963 171 He F. Wu C. Li P. Li N. Zhang D. Zhu Q. Functions and signaling pathways of amino acids in intestinal inflammation Biomed. Res. Int. 2018 2018 9171905 10.1155/2018/9171905 PMC5846438 29682569 172 Desai M.S. Seekatz A.M. Koropatkin N.M. Kamada N. Hickey C.A. Wolter M. A dietary fiber-deprived gut microbiota degrades the colonic mucus barrier and enhances pathogen susceptibility Cell 167 5 2016 1339 1353.e21 27863247 10.1016/j.cell.2016.10.043 PMC5131798 173 Zhao X. Zhou J. Liang W. Sheng Q. Lu L. Chen T. Probiotics mixture reinforces barrier function to ameliorate necrotizing enterocolitis by regulating PXR-JNK pathway Cell. Biosci. 11 1 2021 20 33482929 10.1186/s13578-021-00530-7 PMC7824920 174 Hu M.L. Rayner C.K. Wu K.L. Chuah S.K. Tai W.C. Chou Y.P. Effect of ginger on gastric motility and symptoms of functional dyspepsia World J. Gastroenterol. 17 1 2011 105 110 21218090 10.3748/wjg.v17.i1.105 PMC3016669 175 Chen H. Fu J. Chen H. Hu Y. Soroka D.N. Prigge J.R. Ginger compound [6]-shogaol and its cysteine-conjugated metabolite (M2) activate Nrf2 in colon epithelial cells in vitro and in vivo Chem. Res. Toxicol. 27 9 2014 1575 1585 25148906 10.1021/tx500211x PMC4176387 176 Skrovanek S. DiGuilio K. Bailey R. Huntington W. Urbas R. Mayilvaganan B. Zinc and gastrointestinal disease World J. Gastrointest. Pathophysiol. 5 4 2014 496 513 25400994 10.4291/wjgp.v5.i4.496 PMC4231515 177 Eide D.J. Transcription factors and transporters in zinc homeostasis: lessons learned from fungi Crit. Rev. Biochem. Mol. Biol. 55 1 2020 88 110 32192376 10.1080/10409238.2020.1742092 PMC7770983 178 Calder P.C. Omega-3 polyunsaturated fatty acids and inflammatory processes: nutrition or pharmacology? Br. J. Clin. Pharmacol. 75 3 2013 645 662 22765297 10.1111/j.1365-2125.2012.04374.x PMC3575932 179 Costantini L. Molinari R. Farinon B. Merendino N. Impact of omega-3 fatty acids on the gut microbiota Int. J. Mol. Sci. 18 12 2017 2645 29215589 10.3390/ijms18122645 PMC5751248 Appendix A Supplementary data The following is the Supplementary data to this article: Multimedia component 1 Multimedia component 1 Appendix A Supplementary data to this article can be found online at https://doi.org/10.1016/j.advnut.2025.100485 ",
  "metadata": {
    "Title of this paper": "Impact of omega-3 fatty acids on the gut microbiota",
    "Journal it was published in:": "Advances in Nutrition",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12489516/"
  }
}