{
  "title": "Paper_50",
  "abstract": "pmc Brain Brain 719 brain brainj Brain 0006-8950 1460-2156 Oxford University Press PMC12493066 PMC12493066.1 12493066 12493066 40455873 10.1093/brain/awaf204 awaf204 1 Review Article AcademicSubjects/MED00310 AcademicSubjects/SCI01870 The parasagittal dural space of the human brain Donahue Manus J  Department of Neurology, Vanderbilt University Medical Center Nashville, TN 37212 USA  Department of Psychiatry, Vanderbilt University Medical Center Nashville, TN 37212 USA  Biosight LLC, Franklin TN 37069 USA McKnight Colin D  Department of Radiology and Radiological Sciences, Vanderbilt University Medical Center Nashville, TN 37212 USA Claassen Daniel O  Department of Neurology, Vanderbilt University Medical Center Nashville, TN 37212 USA Hett Kilian  Department of Neurology, Vanderbilt University Medical Center Nashville, TN 37212 USA Correspondence to: Manus J. Donahue, MBA, PhD Neurology, Cognitive and Behavioral Neurology 1500 21st Avenue South, Suite 2600, Nashville, TN 37212, USA E-mail: mj.donahue@vumc.org 10 2025 02 6 2025 148 10 498255 3481 3495 16 1 2025 15 4 2025 15 5 2025 18 8 2025 02 06 2025 04 10 2025 04 10 2025 © The Author(s) 2025. Published by Oxford University Press on behalf of the Guarantors of Brain. 2025 https://creativecommons.org/licenses/by-nc/4.0/ This is an Open Access article distributed under the terms of the Creative Commons Attribution-NonCommercial License ( https://creativecommons.org/licenses/by-nc/4.0/ Abstract The historical understanding of CSF production and flow comprises CSF production primarily in the choroid plexus of the first to third ventricles, flow through the aqueduct of Sylvius en route Since the discovery of a perivascular CSF clearance system in 2012 and in 2015 of lymphatic vessels localized to the dura mater of mice, there has been a growing interest in characterizing the structure and function of the tissues surrounding the dural sinuses, or the parasagittal dural (PSD) space. This work is now being pursued with increasing frequency to understand how the PSD space might relate to impaired neurofluid egress or neuroimmune function, with the intent of further informing our understanding of neurodegenerative proteinopathies and associated therapeutic avenues in disease. This review summarizes our current understanding of neurofluid (composed of CSF and interstitial fluid) circulation within the brain, in addition to the anatomy and function of the PSD space in the context of neurofluid circulation and neuroimmune surveillance. With this context in place, we report on recent abilities to quantify the PSD volume and function in humans, large-scale studies of PSD evolution across the human lifespan, and evidence for PSD structural variation in the setting of neurodegenerative disease. Donahue et al. parasagittal dural space cerebrospinal fluid glymphatic arachnoid granulation magnetic resonance imaging neurodegeneration National Institutes of Health 10.13039/100000002 National Institute on Aging 10.13039/100000049 5R01AG062574 5R01AG083159 pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement yes pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes Introduction Since the identification of a glial–lymphatic (glymphatic) clearance system in 2012, 1 2 3 Historically, CSF has been recognized as a primary conduit for cerebral metabolite and peptide removal. CSF is produced from plasma filtration at the level of the choroid plexus complexes 4 5 Fig. 1 6 4 4 Figure 1  Components of the bulk CSF flow pathway are shown on orthogonal representations of a 3D T 2 2 A B C In addition to the above bulk CSF flow pathway, since approximately 2012 the understanding of CSF flow has been expanded to include a glymphatic pathway, composed primarily of perivascular and interstitial neurofluid movement. 1 en route In terms of cerebral egress, CSF is resorbed into the bloodstream through arachnoid granulations or cleared from the cerebrum along proposed perivenous pathways and through multiple hypothesized pathways, 7 8 9 10 11 8 12 12-15 16 17 Here, we review recent work articulating both the anatomy and function of the PSD space, specifically in the context of its potential relevance to neurofluid clearance and, more recently, immune surveillance. Given that our understanding of this space remains incomplete, we also outline emerging imaging and computational approaches for quantifying this space in vivo Anatomy of the parasagittal dural space The PSD space is frequently used as a general term to describe the tissue located adjacent to the superior sagittal sinus and bounded by dural leaflets ( Fig. 2 2 2 Fig. 3 2 2 2 Figure 2  Illustration depicting the anatomy of the peri-sinus space, including the parasagittal dural (PSD) space. Fig. 3 https://BioRender.com/ip56c5b Figure 3  The parasagittal dural (PSD) space on anatomical MRI scans. 2 A 2 B Regarding the spatial extent of the PSD space, using 3D anatomical imaging applied in humans, PSD volumes have been observed to increase with age in cross-sectional studies across the lifespan. 18 19 19 et al 19 At a smaller scale, the PSD space contains multiple structures, including networks of small channels and arachnoid granulations. Fox et al 20 et al 21 21 Additionally, arachnoid granulations can exist both within the superior sinus proper and within the adjacent PSD spaces. Arachnoid granulations are herniations of the arachnoid membrane that penetrate the dural sinuses and lateral lacunae veins. 22 22 23 24 25 26 In summary, the PSD space extends heterogeneously along the aspects of frontal, parietal and occipital segments of the superior sagittal sinus, with the majority of PSD tissue commonly localized to parietal segments. This structure is visible on T 2 Function of the parasagittal dural space CSF egress occurs at multiple sites along the margin of the CNS, including the spinal nerves and cranial nerves. Evidence of transarachnoid passage of intrathecally injected gadolinium (gadobutrol) contrast from the subarachnoid space to the PSD space, peaking at ∼24 h post-injection, 12 13 13 The discovery of the glymphatic system has prompted intense investigation into the role of CSF-mediated CNS waste product clearance. One of the more central and incompletely characterized questions related to this system pertains to how waste products are passed from the efferent end of this glymphatic system to their final destination outside of the CNS, frequently hypothesized to be cervical lymph nodes. The PSD space, as discussed above, contains a network of channels and arachnoid granulations that demonstrate structural features seemingly appropriate for fluid and waste processing. The recent discovery of dural lymphatic vessels in mouse brain, 2 3 ex vivo 3 in vivo 15 Additionally, studies have provided strong evidence that the dura surrounding the superior sagittal sinus is a locus of intense immunological activity. Antigens derived from the CSF accumulate around the dural sinuses, are taken up by antigen-presenting cells and are presented to patrolling T cells within the dura surrounding the superior sagittal sinus. 27 27 Lymphatic vessels have been shown to represent an important drainage route for CNS/CSF-derived soluble molecules and for meningeal immune cells. Furthermore, the lymphatic endothelial transcriptome is distinct from other tissues, implying a function different from the peripheral lymphatics. 17 28 Addressing these questions and the potential relevance of PSD space function to health and disease will require approaches for assessing the structure and function of the PSD space routinely in humans. These approaches are summarized in the subsequent sections, with a subset of relevant studies highlighted in the Supplementary material Visualizing the parasagittal dural space in humans Given the spatial extent of the PSD space and soft tissue composition, in vivo Early PSD space imaging work in humans, published in 2020 by Ringstad and Eide, 12 ® 1 1 1 et al 13 In addition to intrathecally administered MRI contrast studies, work using intravenous gadolinium contrast injections is also useful for assessing PSD space structure and, potentially, function, and the development of these protocols is ongoing. Prior to the publication of intrathecally administered gadolinium and PSD space enhancement by Ringstad and Eide in 2020, 12 et al 15 1 2 19 29 The above contrast-based approaches use relatively standard anatomical scans for assessing PSD space structure; however, it is important to note that newer and more complex methods are also under development. A dynamic dual-spin-echo perfusion (DDSEP) MRI approach has been proposed by Cao et al 30 1 2 Regarding widespread generalizability, dysfunction of neurofluid circulation might manifest as morphological changes in the PSD space and surrounding structures (e.g. arachnoid granulations); however, automated quantification of these structures has been difficult historically, and characterization often requires exogenous intrathecal contrast agents, manual delineation or post-mortem analyses, with the obvious caveats that intrathecal exogenous contrast is contra-indicated at most centres, manual tracings are impractical for large-scale studies, and ex vivo 19 31 Fig. 4 n n 32 2 19 Figure 4  Visualization and segmentation of the parasagittal dural (PSD) space. 2 top row middle row bottom row et al 18 The details of the software for PSD space and arachnoid granulation segmentation have been described in the literature, both in its initial implementation in 2022, 18 19 2 2 Pre-frontal PSD space: this region is located ventrally (below) a plane that passes through the pituitary gland and the rostrum of the corpus callosum. Frontal PSD space: this region is situated dorsally (above) the same plane that separates it from the pre-frontal PSD space. Parietal PSD space: this region is separated from the frontal PSD space by the central sulcus and extends back to the parietal–occipital fissure. Occipital PSD space: this region extends from the parietal–occipital fissure to the most posterior part of the PSD space. This software offers a precise and comprehensive tool for analysing the PSD and surrounding structures, and these algorithms are provided free for academic use ( https://github.com/hettk/spesis https://github.com/hettk/chp_seg Healthy variation in parasagittal dural space across the lifespan As a prerequisite to studies of PSD space variation, it is necessary to understand normative ranges of PSD volume across the lifespan. It has been reported that total PSD volume increases with age and also varies with sex ( Fig. 5 3 3 P 3 P 19 Figure 5  Evolution of the parasagittal dural (PSD) space across the lifespan. et al 19 As suggested by previous linear modelling of age and sex, 13 18 33 34 35 34 Regarding the PSD assessments, a faster increase in males compared with females in the first half of life was observed. However, male participants were reported to have an average similar PSD space volume in early life compared with female participants. The findings suggest that differentiation of PSD volume between males and females might occur during childhood and adolescence, which could be related to distinct developmental processes. This highlights the need to evaluate CSF dynamics in youth to understand how structures related to CSF production and egress evolve during brain development. 36 In terms of arachnoid granulations, the same trends have been shown in human lifespan analysis, with an increase of arachnoid granulation volume and number being more pronounced in the first three decades of life, with an average of one new arachnoid granulation detected each decade of life. These findings follow a previous study investigating changes in arachnoid granulation volume and number, 25 The above work demonstrates that, unlike grey and white matter tissue volumes, which decrease with increasing age, PSD space volume and CSF egress structures, such as the arachnoid granulations, hypertrophy with age. The location of these structures and hypertrophy appears to vary with age, which might suggest functional differences to the CSF flow circuit with increasing age. Parasagittal dural space in neurodegeneration The function of the PSD space has gained increased attention in the last decade; however, until the function of this structure is shown to have importance to disease processes, its relevance will remain localized to an interesting scientific question only. The majority of neurofluid circulation studies involving the PSD space or emerging neurofluid pathways have been performed in genetically modified mice or in animals following the procedural injection of disease pathogens or peptides, such as amyloid-β. These studies must be interpreted with the caveat that in the natural setting these animals do not develop neurodegeneration, amyloid-β is generally injected into the blood or CSF directly yet in vivo in vivo The decrease of average arachnoid granulation metrics along with increased confidence interval after 60 years of life is noteworthy. Several factors might contribute and warrant future investigation. Prior lifespan studies might exclude participants with neurodegenerative disease, and, as such, findings in older adults in these control studies might represent a survival bias, because increasing rates of exclusionary neurological conditions reduce the available asymptomatic control sample in later decades. Cross-sectional application of the same analyses in well-established neurodegenerative disease populations would lend further confidence to delineating potentially normal age-related changes across different decades of adulthood in these metrics from those related to neuropathologies with progressively later age of onset (i.e. Huntington's disease, Parkinson's disease and Alzheimer's disease). Longitudinal application in those at risk of developing these conditions could then evaluate arachnoid granulation and PSD space metrics as a novel early structural biomarker of neurodegeneration. Given the difficulties of performing longitudinal neuroimaging assessments following intrathecal gadolinium injections, PSD space studies of intrathecally administered gadolinium have generally focused on hospitalized patients with CSF flow disorders (idiopathic intracranial hypertension, arachnoid or pineal cysts, intracranial hypotension or hydrocephalus); however, a very small number ( n 13 The deep learning segmentation of the PSD space in a larger cohort of 23 older adults with cognitive complaints was applied in sequence with the amyloid-β tracer 11 29 P P P Fig. 6 37 38 39 40 41 42 Figure 6  Preliminary evidence of parasagittal dural (PSD) space hypertrophy and cerebral amyloid beta (Αβ) retention. 11 11 ND et al 29 Many of the most common adult neurodegenerative proteinopathies, including Parkinson's disease and Alzheimer's disease, occur in late life and in the presence of other comorbidities, and as such, it is difficult to assess whether functional changes are a cause or a consequence of disease. In contrast, Huntington's disease is a neurogenerative disorder caused by a polyglutamine encoding an abnormal CAG repeat expansion in the huntingtin gene, leading to mutant huntingtin (mHTT) protein transcription. 43 44 Fig. 7 P P P P Figure 7  Parasagittal dural (PSD) space and Huntington's disease. A B A B C D E D E To our knowledge, definite examples of PSD space hypertrophy or functional changes have not been reported in the setting of Parkinson's disease or multiple sclerosis. However, reduction in CSF flow in the suprasellar cistern 45 46 The overarching explanations underlying the mechanism of PSD space hypertrophy in the setting of neurodogenerative proteinopathy relates to a possibility that protein egress (potentially including amyloid-β in Alzheimer's disease, α-synuclein in Parkinson's disease and huntingtin in Huntington's disease) is impaired, and as such, protein is retained within the brain at abnormal levels. Although speculative, the hypertrophy of the PSD space could be attributable to an impaired ability to process waste clearance at some level within the bulk of the glymphatic pathway, hence the space enlarges as a compensatory phenomenon. In upper and lower extremities, limb swelling and lymphatic collector engorgement is seen in the setting of lymphoedema, whereby lymphatic processing abilities are reduced relative to lymphatic load, and secondary lymphoedema is one of the most common comorbidities of lymph node removal and cancer therapies. 47 48 13 et al 49 Fig. 8 Figure 8  Case examples of parasagittal dural (PSD) space variation. A D 2 A B C D E F E F Potential relevance of the parasagittal dural space to neurotherapeutics and imaging The functional significance of the PSD space can also be used to envision new possibilities in the field of neurotherapeutics, both in terms of potential new opportunities for more informed diagnostic imaging and to expand the routes and pharmacokinetics of drug delivery. More specifically, in the absence of cell endogenous transport systems (i.e. receptor-mediated transport), the BBB generally prohibits entry of molecules, at the level of the cerebral capillaries, with diameters of >200 nm, 50 51 52 53 Interestingly, in the setting of many CNS disorders outside of neuro-oncology, there is limited BBB breakdown and rather the locus of brain injury is largely in the extravascular and interstitial spaces. One alternative to intravenous administration is intrathecal administration, whereby agents are injected directly into the space that holds the CSF, such as the spinal canal or subarachnoid space. Antisense oligonucleotides, 54 55 56 57 58 56 59 60 61 In the setting of neuro-oncology, intrathecal delivery of therapeutic agents might prove complementary to, or even more effective than, intravenous drug delivery. BBB breakdown is commonly recognized on clinical MRI as abnormal brain parenchymal enhancement. Brain tumours commonly enhance, and this is recognized as regions of BBB breakdown. Drugs delivered intravenously are more likely to reach tumours that are enhancing because of this BBB breakdown. Although many tumors enhance, many tumour types are often heterogeneous, exhibiting areas of variable or non-enhancement. Other tumours, such as low-grade astrocytomas, do not classically demonstrate enhancement. In these settings, intravenous delivery of therapeutic agents might reach only some or no portions of these tumors, precluding efficacy. Intrathecal delivery obviates the dependance on BBB breakdown and might be a promising candidate route for more effective therapeutic delivery strategies, although side-effect profiles might differ. Additionally, the physiological role of the PSD space remains to be elucidated fully. As investigation further defines the role of this structure in terms of both metabolic waste product clearance and, perhaps more importantly, immune surveillance, it might prove highly advantageous to manipulate immunological activity in this region. Intrathecal administration of therapeutic agents might prove to be the more relevant route of delivery to achieve these ends. Diagnostic imaging of the parasagittal dural space It is also useful to consider the most appropriate diagnostic imaging approaches for visualizing the PSD space. Given the proximity to venous blood, sequences that provide maximal contrast between venous blood and the PSD tissue itself, generally at a submillimetre spatial resolution, are desired. 3D T 2 2 62 2 2 2 2 2 Fig. 3 However, these methods provide no information on the function of the PSD space. Such methods are under development and approaches in terms of both technical optimization and understanding the importance of the contrast they provide. Promising avenues include 3D T 1 63 2 2 64 Finally, knowledge of CSF circulation might expand diagnostic imaging approaches. In the setting of MRI, exogenous susceptibility-weighted agents, such as gadolinium, are injected intravenously, and subsequent changes in contrast are generally attributable to retention of contrast in regions with increased perfusion or inflammation, or in the extravascular space following extravasation across BBB of increased permeability. 65-67 68 Conclusions and future directions The PSD space of the human brain, which comprises the space surrounding the superior sagittal sinus and bounded by dural leaflets, has gained much recent attention in light of the emerging field of neurofluid circulation as a major contributor to brain health and peptide clearance. This space can be assessed in vivo With the foundations of the functional relevance of this space recently established, new opportunities for clinical relevance can be considered. As described here, recent work in animals using exogenous contrast agents, often in conjunction with manipulation of neurofluid flow profiles or behavioural states, has focused on the mechanistic relevance of the PSD space and associated pathways. 69-71 19 29 in vivo 19 Assessing the relevance of the PSD space and perivascular neurofluid flow generally is limited by abilities to modulate this flow easily and in a controlled manner in humans, which, in turn, reduces many studies to correlative assessments. However, with recent observations that neurofluid flow is modulated by behavioural state (e.g. sleep versus wakefulness), 71 38 72 73 74 Despite an incomplete understanding of the function of the PSD space, hypertrophy of this space, primarily in the larger parietal segments, has been shown to be correlated with age and PET markers of amyloid-β peptide retention, and also to present in even pre-manifest stages of genetically well-characterized neurodegenerative conditions, such as Huntington's disease. Such findings could be attributable to impaired peptide clearance or neuroimmune behaviours. More sensitive neuroimaging approaches are now being proposed, which will allow for the function of the PSD space to be better defined, and generalizable analysis procedures are now available for assessing the structure of the PSD space from standard non-contrast neuroimaging scans acquired in most clinical neuroimaging protocols. Application of these methods, in conjunction with neurotherapeutics that might alter inflammatory behaviour or protein retention, should provide new insights on the relevance of this emerging structure as a potential contributor to CNS disease and as a treatment target. Supplementary Material awaf204_Supplementary_Data Funding Funding provided by the National Institutes of Health/National Institute on Aging: 5R01AG062574 and 5R01AG083159. Competing interests M.J.D. receives research related support from the National Institutes of Health (NINDS, NCI, NIA, NCCIH, NINR and NHLBI), Philips Healthcare and is a paid consultant for Graphite Bio, Pfizer Inc., Global Blood Therapeutics and LymphaTouch. He is a paid advisory board member for Novartis and bluebird bio and receives research funding from the National Institutes of Health and Pfizer Inc. M.J.D. is also the CEO of Biosight Inc., which operates as a clinical research organization and provides healthcare technology vendor services. D.O.C. has received research support from the NIH (NINDS, NIA, NICHD, NCCIH), Department of Defense, Griffin Family Foundation and Huntington Disease Society of America; he has received pharmaceutical grant support from AbbVie, Alterity, Acadia, Biogen, BMS, Cerecour, Eli Lilly, Genentech-Roche, Lundbeck, Jazz Pharmaceuticals, Neurocrine, Teva Neuroscience, Wave Life Sciences, UniQure and Vaccinex. He has received personal fees for consulting from Acadia, Alterity, Adamas, Anexon, Ceruvel, Lundbeck, Neurocrine, Spark, Uniqure and Teva Neuroscience. Supplementary material  Supplementary material Brain References 1 Iliff JJ Wang M Liao Y et al A paravascular pathway facilitates CSF flow through the brain parenchyma and the clearance of interstitial solutes, including amyloid beta Sci Transl Med 2012 4 147ra111 10.1126/scitranslmed.3003748 PMC3551275 22896675 2 Aspelund A Antila S Proulx ST et al A dural lymphatic vascular system that drains brain interstitial fluid and macromolecules J Exp Med 2015 212 991 999 26077718 10.1084/jem.20142290 PMC4493418 3 Louveau A Smirnov I Keyes TJ et al Structural and functional features of central nervous system lymphatic vessels Nature 2015 523 337 341 26030524 10.1038/nature14432 PMC4506234 4 Telano LN Baker S Physiology, cerebral spinal fluid StatPearls Publishing 2024 30085549 5 Sakka L Coll G Chazal J Anatomy and physiology of cerebrospinal fluid Eur Ann Otorhinolaryngol Head Neck Dis 2011 128 309 316 22100360 10.1016/j.anorl.2011.03.002 6 Said G Krarup C Peripheral nerve disorders Handbook of clinical neurology Elsevier 2013 7 41 10.1016/B978-0-444-52902-2.00006-0 23931776 7 Proulx ST Cerebrospinal fluid outflow: A review of the historical and contemporary evidence for arachnoid villi, perineural routes, and dural lymphatics Cell Mol Life Sci 2021 78 2429 2457 33427948 10.1007/s00018-020-03706-5 PMC8004496 8 McKnight CD Rouleau RM Donahue MJ Claassen DO The regulation of cerebral spinal fluid flow and its relevance to the glymphatic system Curr Neurol Neurosci Rep 2020 20 58 33074399 10.1007/s11910-020-01077-9 PMC7864223 9 Brady M Rahman A Combs A et al Cerebrospinal fluid drainage kinetics across the cribriform plate are reduced with aging Fluids Barriers CNS 2020 17 71 33256800 10.1186/s12987-020-00233-0 PMC7706057 10 Norwood JN Zhang Q Card D Craine A Ryan TM Drew PJ Anatomical basis and physiological role of cerebrospinal fluid transport through the murine cribriform plate Elife 2019 8 e44278 31063132 10.7554/eLife.44278 PMC6524970 11 Lüdemann W Berens von Rautenfeld D Samii M Brinker T Ultrastructure of the cerebrospinal fluid outflow along the optic nerve into the lymphatic system Childs Nerv Syst 2005 21 96 103 15338179 10.1007/s00381-004-1040-1 12 Ringstad G Eide PK Cerebrospinal fluid tracer efflux to parasagittal dura in humans Nat Commun 2020 11 354 31953399 10.1038/s41467-019-14195-x PMC6969040 13 Melin E Ringstad G Valnes LM Eide PK Human parasagittal dura is a potential neuroimmune interface Commun Biol 2023 6 260 36906686 10.1038/s42003-023-04634-3 PMC10008553 14 Ringstad G Eide PK Molecular trans-dural efflux to skull bone marrow in humans with CSF disorders Brain 2022 145 1464 1472 34849609 10.1093/brain/awab388 PMC9128823 15 Absinta M Ha SK Nair G et al Human and nonhuman primate meninges harbor lymphatic vessels that can be visualized noninvasively by MRI Elife 2017 6 e29738 28971799 10.7554/eLife.29738 PMC5626482 16 Rustenhoven J Kipnis J Bypassing the blood-brain barrier Science 2019 366 1448 1449 31857468 10.1126/science.aay0479 PMC12065005 17 Louveau A Herz J Alme MN et al CNS lymphatic drainage and neuroinflammation are regulated by meningeal lymphatic vasculature Nat Neurosci 2018 21 1380 1391 30224810 10.1038/s41593-018-0227-9 PMC6214619 18 Hett K McKnight CD Eisma JJ et al Parasagittal dural space and cerebrospinal fluid (CSF) flow across the lifespan in healthy adults Fluids Barriers CNS 2022 19 24 35313906 10.1186/s12987-022-00320-4 PMC8935696 19 Hett K McKnight CD Leguizamon M et al Deep learning segmentation of peri-sinus structures from structural magnetic resonance imaging: Validation and normative ranges across the adult lifespan Fluids Barriers CNS 2024 21 15 38350930 10.1186/s12987-024-00516-w PMC10865560 20 Fox RJ Walji AH Mielke B Petruk KC Aronyk KE Anatomic details of intradural channels in the parasagittal dura: A possible pathway for flow of cerebrospinal fluid Neurosurgery 1996 39 84 90 discussion 90–91 8805143 10.1097/00006123-199607000-00017 21 Park M Park JP Kim SH Cha YJ Evaluation of dural channels in the human parasagittal dural space and dura mater Ann Anat 2022 244 151974 35777533 10.1016/j.aanat.2022.151974 22 Wolpow ER Schaumburg HH Structure of the human arachnoid granulation J Neurosurg 1972 37 724 727 4631925 10.3171/jns.1972.37.6.0724 23 Adeeb N Deep A Griessenauer CJ et al The intracranial arachnoid mater: A comprehensive review of its history, anatomy, imaging, and pathology Childs Nerv Syst 2013 29 17 33 22961357 10.1007/s00381-012-1910-x 24 Yagmurlu K Sokolowski J Soldozy S et al A subset of arachnoid granulations in humans drain to the venous circulation via intradural lymphatic vascular channels J Neurosurg 2022 136 917 926 34416722 10.3171/2021.2.JNS204455 25 Rados M Zivko M Perisa A Oreskovic D Klarica M No arachnoid granulations—no problems: Number, size, and distribution of arachnoid granulations from birth to 80 years of age Front Aging Neurosci 2021 13 698865 34276348 10.3389/fnagi.2021.698865 PMC8280770 26 Chin SC Chen CY Lee CC et al Giant arachnoid granulation mimicking dural sinus thrombosis in a boy with headache: MRI Neuroradiology 1998 40 181 183 9561525 10.1007/s002340050564 27 Rustenhoven J Drieu A Mamuladze T et al Functional characterization of the dural sinuses as a neuroimmune interface Cells 2021 184 1000 1016.e27 10.1016/j.cell.2020.12.040 PMC8487654 33508229 28 Johnson MD Evaluation of fluid channels in the human dura and superior sagittal sinus in older patients Neurosci Lett 2021 746 135649 33484739 10.1016/j.neulet.2021.135649 29 Song AK Hett K Eisma JJ et al Parasagittal dural space hypertrophy and amyloid-β deposition in Alzheimer’s disease Brain Commun 2023 5 fcad128 37143860 10.1093/braincomms/fcad128 PMC10152899 30 Cao D Sun Y Li Y et al Concurrent measurement of perfusion parameters related to small blood vessels and cerebrospinal fluid circulation in the human brain using dynamic dual-spin-echo perfusion MRI NMR Biomed 2023 36 e4984 37308297 10.1002/nbm.4984 PMC10808973 31 Eisma JJ McKnight CD Hett K et al Deep learning segmentation of the choroid plexus from structural magnetic resonance imaging (MRI): Validation and normative ranges across the adult lifespan Fluids Barriers CNS 2024 21 21 38424598 10.1186/s12987-024-00525-9 PMC10903155 32 Harms MP Somerville LH Ances BM et al Extending the human connectome project across ages: Imaging protocols for the lifespan development and aging projects Neuroimage 2018 183 972 984 30261308 10.1016/j.neuroimage.2018.09.060 PMC6484842 33 Park M Kim JW Ahn SJ Cha YJ Suh SH Aging is positively associated with peri-sinus lymphatic space volume: Assessment using 3T black-blood MRI J Clin Med 2020 9 3353 33086702 10.3390/jcm9103353 PMC7590154 34 Fujita S Mori S Onda K et al Characterization of brain volume changes in aging individuals with normal cognition using serial magnetic resonance imaging JAMA Netw Open 2023 6 e2318153 37378985 10.1001/jamanetworkopen.2023.18153 PMC10308250 35 Mokri B The Monro–Kellie hypothesis: Applications in CSF volume depletion Neurology 2001 56 1746 1748 11425944 10.1212/wnl.56.12.1746 36 Huisman T Unraveling the mystery of the perivascular spaces and glymphatic system of the neonatal central nervous system Radiology 2023 307 e223009 36648349 10.1148/radiol.223009 37 Swanson CJ Zhang Y Dhadda S et al A randomized, double-blind, phase 2b proof-of-concept clinical trial in early Alzheimer’s disease with lecanemab, an anti-Aβ protofibril antibody Alzheimers Res Ther 2021 13 80 33865446 10.1186/s13195-021-00813-8 PMC8053280 38 van Dyck CH Swanson CJ Aisen P et al Lecanemab in early Alzheimer’s disease N Engl J Med 2023 388 9 21 36449413 10.1056/NEJMoa2212948 39 Pomara N Imbimbo BP Use of donanemab in early symptomatic Alzheimer disease JAMA 2023 330 2304 10.1001/jama.2023.21106 38112820 40 Sims JR Zimmer JA Evans CD et al Donanemab in early symptomatic Alzheimer disease: The TRAILBLAZER-ALZ 2 randomized clinical trial JAMA 2023 330 512 527 37459141 10.1001/jama.2023.13239 PMC10352931 41 Solopova E Romero-Fernandez W Harmsen H et al Fatal iatrogenic cerebral β-amyloid-related arteritis in a woman treated with lecanemab for Alzheimer’s disease Nat Commun 2023 14 8220 38086820 10.1038/s41467-023-43933-5 PMC10716177 42 Sperling RA Jack CR Jr. Black SE et al Amyloid-related imaging abnormalities in amyloid-modifying therapeutic trials: Recommendations from the Alzheimer’s Association Research Roundtable Workgroup Alzheimers Dement 2011 7 367 385 21784348 10.1016/j.jalz.2011.05.2351 PMC3693547 43 Caron NS Dorsey ER Hayden MR Therapeutic approaches to Huntington disease: From the bench to the clinic Nat Rev Drug Discov 2018 17 729 750 30237454 10.1038/nrd.2018.133 44 Hett K McKnight CD Elenberger J et al Large-scale quantification of peri-sinus structure volumes across the human lifespan supports evidence of peri-sinus hypertrophy in prodromal stages of neurodegenerative disease. In: Lund Glymphatic Symposium 45 Pierobon Mays G Hett K Eisma J et al Reduced cerebrospinal fluid motion in patients with Parkinson’s disease revealed by magnetic resonance imaging with low b-value diffusion weighted imaging Fluids Barriers CNS 2024 21 40 38725029 10.1186/s12987-024-00542-8 PMC11080257 46 McKnight CD Trujillo P Lopez AM et al Diffusion along perivascular spaces reveals evidence supportive of glymphatic function impairment in Parkinson disease Parkinsonism Relat Disord 2021 89 98 104 34271425 10.1016/j.parkreldis.2021.06.004 PMC8429254 47 Crescenzi R Donahue PMC Hartley KG et al Lymphedema evaluation using noninvasive 3T MR lymphangiography J Magn Reson Imaging 2017 46 1349 1360 28245075 10.1002/jmri.25670 PMC5573666 48 DiSipio T Rye S Newman B Hayes S Incidence of unilateral arm lymphoedema after breast cancer: A systematic review and meta-analysis Lancet Oncol 2013 14 500 515 23540561 10.1016/S1470-2045(13)70076-7 49 Zhang W Xiao D Mao Q Xia H Role of neuroinflammation in neurodegeneration development Signal Transduct Target Ther 2023 8 267 37433768 10.1038/s41392-023-01486-5 PMC10336149 50 Kulkarni SA Feng SS Effects of particle size and surface modification on cellular uptake and biodistribution of polymeric nanoparticles for drug delivery Pharm Res 2013 30 2512 2522 23314933 10.1007/s11095-012-0958-3 51 Saraiva C Praca C Ferreira R Santos T Ferreira L Bernardino L Nanoparticle-mediated brain drug delivery: Overcoming blood–brain barrier to treat neurodegenerative diseases J Control Release 2016 235 34 47 27208862 10.1016/j.jconrel.2016.05.044 52 Ribovski L Hamelmann NM Paulusse JMJ Polymeric nanoparticles properties and brain delivery Pharmaceutics 2021 13 2045 34959326 10.3390/pharmaceutics13122045 PMC8705716 53 Pardridge WM Alzheimer’s disease drug development and the problem of the blood-brain barrier Alzheimers Dement 2009 5 427 432 19751922 10.1016/j.jalz.2009.06.003 PMC2756824 54 Rinaldi C Wood MJA Antisense oligonucleotides: The next frontier for treatment of neurological disorders Nat Rev Neurol 2018 14 9 21 29192260 10.1038/nrneurol.2017.148 55 Silva AC Lobo DD Martins IM et al Antisense oligonucleotide therapeutics in neurodegenerative diseases: The case of polyglutamine disorders Brain 2020 143 407 429 31738395 10.1093/brain/awz328 56 Tabrizi SJ Estevez-Fraga C van Roon-Mom WMC et al Potential disease-modifying therapies for Huntington’s disease: Lessons learned and future opportunities Lancet Neurol 2022 21 645 658 35716694 10.1016/S1474-4422(22)00121-1 PMC7613206 57 Hardiman O van den Berg LH The beginning of genomic therapies for ALS N Engl J Med 2020 383 180 181 32640137 10.1056/NEJMe2012930 58 Miller T Cudkowicz M Shaw PJ et al Phase 1–2 trial of antisense oligonucleotide tofersen for SOD1 N Engl J Med 2020 383 109 119 32640130 10.1056/NEJMoa2003715 59 Kingwell K Double setback for ASO trials in Huntington disease Nat Rev Drug Discov 2021 20 412 413 34012000 10.1038/d41573-021-00088-6 60 Eide PK Mariussen E Uggerud H et al Clinical application of intrathecal gadobutrol for assessment of cerebrospinal fluid tracer clearance to blood JCI Insight 2021 6 e147063 33822769 10.1172/jci.insight.147063 PMC8262318 61 Ringstad G Valnes LM Dale AM et al Brain-wide glymphatic enhancement and clearance in humans assessed with MRI JCI Insight 2018 3 e121537 29997300 10.1172/jci.insight.121537 PMC6124518 62 Zhao JM Clingman CS Narvainen MJ Kauppinen RA van Zijl PC Oxygenation and hematocrit dependence of transverse relaxation rates of blood at 3T Magn Reson Med 2007 58 592 597 17763354 10.1002/mrm.21342 63 Melin E Pripp AH Eide PK Ringstad G In vivo distribution of cerebrospinal fluid tracer in human upper spinal cord and brain stem JCI Insight 2023 8 e173276 38063195 10.1172/jci.insight.173276 PMC10795833 64 Hett K Leguizamon M McKnight CD et al 3-Tesla parasagittal dural space (PSD) T2 relates to PSD volume and correlates with diurnal circadian oscillation during wakefulness. In: 2025 ISMRM & ISMRT Annual Meeting & Exhibition. 65 Prasuhn J Xu J Hua J van Zijl P Knutsson L Exploring neurodegenerative disorders using advanced magnetic resonance imaging of the glymphatic system Front Psychiatry 2024 15 1368489 38651012 10.3389/fpsyt.2024.1368489 PMC11033437 66 Verheggen ICM Freeze WM de Jong JJA et al Application of contrast-enhanced magnetic resonance imaging in the assessment of blood-cerebrospinal fluid barrier integrity Neurosci Biobehav Rev 2021 127 171 183 33930471 10.1016/j.neubiorev.2021.04.025 67 Endrikat J Gutberlet M Hoffmann KT et al Clinical safety of gadobutrol: Review of over 25 years of use exceeding 100 million administrations Invest Radiol 2024 59 605 613 38426761 10.1097/RLI.0000000000001072 68 Ringstad G Eide PK Safety of intrathecal gadolinium-based contrast agents and benefit versus risk Radiology 2021 299 E223 E224 33591893 10.1148/radiol.2021203351 69 Lundgaard I Lu ML Yang E et al Glymphatic clearance controls state-dependent changes in brain lactate concentration J Cereb Blood Flow Metab 2017 37 2112 2124 27481936 10.1177/0271678X16661202 PMC5464705 70 Liu DX He X Wu D et al Continuous theta burst stimulation facilitates the clearance efficiency of the glymphatic pathway in a mouse model of sleep deprivation Neurosci Lett 2017 653 189 194 28576566 10.1016/j.neulet.2017.05.064 71 Hablitz LM Pla V Giannetto M et al Circadian control of brain glymphatic and lymphatic fluid flow Nat Commun 2020 11 4411 32879313 10.1038/s41467-020-18115-2 PMC7468152 72 Mintun MA Lo AC Duggan Evans C et al Donanemab in early Alzheimer’s disease N Engl J Med 2021 384 1691 1704 33720637 10.1056/NEJMoa2100708 73 Schartz D Finkelstein A Hoang N Bender MT Schifitto G Zhong J Diffusion-weighted imaging reveals impaired glymphatic clearance in idiopathic intracranial hypertension AJNR Am J Neuroradiol 2024 45 149 154 38238097 10.3174/ajnr.A8088 PMC11285988 74 Schartz D Finkelstein A Zhong J Brinjikji W Bender MT Improved cerebral glymphatic flow after transvenous embolization of CSF-venous fistula AJNR Am J Neuroradiol 2024 45 961 964 38697791 10.3174/ajnr.A8229 PMC11286014 ",
  "metadata": {
    "Title of this paper": "Improved cerebral glymphatic flow after transvenous embolization of CSF-venous fistula",
    "Journal it was published in:": "Brain",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12493066/"
  }
}