{
  "title": "Paper_1096",
  "abstract": "pmc Arch Pharm (Weinheim) Arch Pharm (Weinheim) 379 blackwellopen ARDP Archiv Der Pharmazie 0365-6233 1521-4184 pmc-is-collection-domain yes pmc-collection-title Wiley Open Access Collection PMC12477462 PMC12477462.1 12477462 12477462 41017227 10.1002/ardp.70105 ARDP70105 1 Full Paper Full Paper Targeting JNK1/2 and P38 Mitogen‐Activated Protein Kinases With Pazopanib Mitigates Bleomycin‐Induced Lung Fibrosis Abdelhady Rasha https://orcid.org/0000-0003-1963-8525  1  2 ram14@fayoum.edu.eg rasha.abdelhadymohamed@ecu.edu.eg Sayed Rabab H. https://orcid.org/0000-0002-5337-3658  3  4 Younis Nancy S. https://orcid.org/0000-0003-4309-7095  5  6 Ali Omaima https://orcid.org/0000-0002-1015-1035  7  8 Elhemely Mai Abdallah  9  10 mai.ali@manchester.ac.uk Ashour Ahmed M. https://orcid.org/0000-0002-2118-0499  11 Alsufyani Shuruq E.  12 Arab Hany H. https://orcid.org/0000-0002-4195-6901  12 Abdel‐Hamid Mohammed S.  1   1 Department of Pharmacology and Toxicology Faculty of Pharmacy, Fayoum University Fayoum Egypt   2 Department of Pharmacology and Toxicology Faculty of Pharmacy and Drug Technology, Egyptian Chinese University Cairo Egypt   3 Department of Pharmacology and Toxicology Faculty of Pharmacy, Cairo University Cairo Egypt   4 School of Pharmacy Newgiza University Giza Egypt   5 Department of Pharmaceutical Sciences Faculty of Clinical Pharmacy, King Faisal University Al Hofuf Saudi Arabia   6 Zagazig University Hospitals Zagazig University Zagazig Egypt   7 Department of Biochemistry Faculty of Pharmacy, Sinai University‐Kantara Branch Ismailia Egypt   8 General Division for Biological Control and Research Egyptian Drug Authority Cairo Egypt   9 School of Medical Sciences, Faculty of Biology, Medicine and Health The University of Manchester Manchester UK   10 Department of Pharmacology and Toxicology Faculty of Pharmacy, Beni‐suef University Beni‐Suef Egypt   11 Department of Pharmacology and Toxicology College of Pharmacy, Umm Al Qura University Makkah Saudi Arabia   12 Department of Pharmacology and Toxicology College of Pharmacy, Taif University Taif Saudi Arabia * Correspondence: ram14@fayoum.edu.eg rasha.abdelhadymohamed@ecu.edu.eg mai.ali@manchester.ac.uk 28 9 2025 9 2025 358 9 497748 10.1002/ardp.v358.9 e70105 20 8 2025 03 3 2025 04 9 2025 29 09 2025 30 09 2025 30 09 2025 © 2025 The Author(s). Archiv der Pharmazie https://creativecommons.org/licenses/by-nc-nd/4.0/ This is an open access article under the terms of the http://creativecommons.org/licenses/by-nc-nd/4.0/ ABSTRACT Idiopathic pulmonary fibrosis is considered the most common type of interstitial lung disease. The principal aim of our research was to investigate the potential role of pazopanib treatment in alleviating bleomycin‐elicited pulmonary fibrosis and elucidate the underlying molecular mechanisms. Twenty‐four male mice were allocated into four groups ( n Initial in vivo evidence shows that pazopanib exerted anti‐fibrotic and anti‐inflammatory effects, potentially through the inhibition of JNK and P38 signaling cascades. Pazopanib modulated TFG‐β and α‐SMA levels after bleomycin exposure and consequently corrected the levels of IL‐1β, IL‐13, IL‐33, TNF‐α, and NF‐κB P65. Thus, pazopanib may serve as pharmacological treatment for pulmonary fibrosis. bleomycin JNK1/2 P38 pazopanib pulmonary fibrosis The study was supported by the Taif University, Saudi Arabia (TU‐DSPP‐2024‐116). pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement no pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes source-schema-version-number 2.0 cover-date September 2025 details-of-publishers-convertor Converter:WILEY_ML3GV2_TO_JATSPMC version:6.6.4 mode:remove_FC converted:29.09.2025 1 Introduction Idiopathic pulmonary fibrosis (IPF) is a devastating lung disorder, and it's the most common type of interstitial lung disease with an increasing global burden (3–9 cases per 100 ,000 per year) with a median survival range between 2 and 4 years [ 1 2 The proposed pathological mechanism in IPF involves repetitive alveolar epithelium microinjury that triggers the faulty healing process [ 3 4 5 6 Antifibrotic therapies (such as nintedanib and pirfenidone) are currently used for treating IPF; however, none of them can achieve a complete cure for the disease [ 7 8 Molecular mechanisms underlying bleomycin‐induced lung fibrosis were mediated through overexpression of the novel fibrogenic mediator IL‐33 in both pulmonary macrophages and airway epithelia [ 9 10 11 Furthermore, TGF‐β superfamily signaling pathways have a pleiotropic function regulating cellular processes, including cellular proliferation in addition to wound repair [ 12 13 MAPKs are Ser/Thr kinases, widely distributed in mammalian cells, which are responsible for the transduction of extracellular signals triggered by growth signals or cytokines into various cellular responses [ 14 15 MEKK2 plus MEKK3 belong to the MEKK subgroup, which are critical for JNK and P38 pathways activation, correspondingly [ 16 17 18 19 20 Pazopanib, a multi‐targeted receptor tyrosine kinase inhibitor, is reported to repress both MEKK2 and MEKK3. Moreover, pazopanib's beneficial role in ameliorating acute lung injury has been demonstrated by a recent study highlighting its potential to abate acute lung injury both in mice and in human [ 21 22 2 Results It is worth mentioning that the administration of pazopanib alone to mice didn't produce any significant changes for all the assessed parameters. 2.1 Influence of Pazopanib Treatment on Body Weight and Lung Index In bleomycin‐induced pulmonary fibrosis models, body weight loss and lung index (lung weight/body weight ratio) are well‐established indicators of systemic toxicity, pulmonary inflammation, and edema. These parameters provide an early and quantitative assessment of the severity of the disease and the effectiveness of treatment. As shown in Figure 1A p p p p 1B p p Figure 1 Influence of pazopanib treatment on body weight (A) and lung index (B) of mice after bleomycin exposure. Values represent means ± SD ( n p p p p 2.2 Influence of Pazopanib Treatment on Lung Histopathological Picture In bleomycin‐induced lung injury, histopathological examination using H&E staining reveals cellular infiltration, septal thickening, and structural disruption. The assessment of these features is critical for determining whether pazopanib can mitigate lung fibrosis and preserve normal tissue structure. The control and pazopanib groups revealed regular histological features of well‐arranged lung parenchyma, normal vasculatures, intact alveolar luminal spaces, and thin‐walled interalveolar septa. In addition, results showed uninjured bronchiolar epithelium with minimal mononuclear inflammatory cell infiltrates as well as nominal fibroblastic activity in peribronchiolar tissue (Figure 2A–D 2E,F 2E,F Figure 2 Influence of pazopanib administration on pulmonary histopathological pattern following bleomycin exposure. H&E‐stained lung specimens from different experimental groups: (A and B) the control group in addition to (C and D) pazopanib treated animals demonstrated normal histopathological features of the pulmonary tissues with normal vasculature and thin intra‐alveolar septa (arrow) plus minimal mononuclear inflammatory cell infiltration and insignificant fibroblastic activity in peribronchiolar tissue (star); (E and F) bleomycin exposed animals showed moderate evidence of interstitial pneumonia including thickening of interalveolar septa with severe congestion and dilatation of lung vasculatures (red star) as well as a significant rise in peribronchiolar inflammatory cells infiltration (red arrow) alongside remarkably higher fibroblastic activity with substantially increased collagen fibers density (yellow arrow); and (G and H) bleomycin + pazopanib‐treated mice exhibited significant amelioration of the abnormal histopathological features with nearly undisturbed interalveolar septa with minimal inflammatory cells infiltrations (black arrow) plus slight fibroblastic activity as well as minimal records of collagen fibers density (yellow arrow). Bleo., bleomycin; H&E, hematoxylin and eosin; Pazo., pazopanib. Co‐treatment with pazopanib reduced these changes, as evidenced by almost intact interalveolar septa with mild inflammatory cell infiltrates. Additionally, the pazopanib group showed minimal collagen fiber density as well as fibroblastic activity besides sporadic insignificant records of peribronchiolar inflammatory cell infiltration (Figure 2C,D 2.3 Assessment of Collagen Deposition and Fibrotic Remodeling in Lungs A defining characteristic of pulmonary fibrosis is the deposition of excessive collagen in the interalveolar septa. The Masson's trichrome staining and quantification of collagen area% provide a direct indication of fibrotic burden and treatment response. The control and pazopanib groups displayed negligible lung fibrotic reactions, evidenced by the reported minimal trichrome staining pattern showing limited collagen deposition within the inter‐alveolar septa (Figure 3A–D p p 3G,H Figure 3 Effect of pazopanib administration on the area% of collagen by Masson's trichrome staining in different mice groups. (A and B) control mice, (C and D) pazopanib‐administered mice, (E and F) bleomycin‐injected mice, (G and H) bleomycin + pazopanib‐treated mice, and (I) area % of collagen expression. Statistical analysis was performed by one‐way ANOVA followed by Tukey's multiple comparison test. Values represent means ± SD ( n p 2.4 Influence of Pazopanib Administration on the Immunohistochemical Expression of α‐SMA and TGF‐β1 Following Bleomycin Exposure TGF‐β1 is a crucial profibrotic cytokine that regulates myofibroblast differentiation, marked by the expression of α‐SMA. An immunohistochemical analysis of these markers is used to quantify the activation of myofibroblasts and the progression of fibrosis [ 12 4A,B 5A,B 4C 5C p 4D,E, 5D,E Figure 4 Effect of pazopanib treatment on TGF‐β1 immunoexpress in different animal groups. (A) Control group, (B) pazopanib group, (C) bleomycin‐treated mice, and (D) bleomycin + pazopanib‐treated mice. (E) Quantification of TGF‐β1 immunostaining as area %. Values represent means ± SD ( n p Figure 5 Effect of pazopanib treatment on α‐SMA immunoexpression in different animal groups. (A) Control group, (B) pazopanib group, (C) bleomycin‐treated mice, and (D) bleomycin + pazopanib‐treated mice. (E) Quantification of α‐SMA immunostaining as area %. Values represent means ± SD ( n p p p 2.5 Influence of Pazopanib on p‐JNK1/2 and p‐P38MAPK Protein Expression as Well as MEKK2 and MEKK3 mRNA Expression in Mice In lung fibroblasts, the MEKK2/3–JNK/P38 axis mediates profibrotic signaling. The quantification of the levels of phosphorylated JNK1/2 and p‐P38 MAPK proteins as well as MEKK2/3 mRNA provides a mechanistic understanding of how Pazopanib modulates fibrogenic pathways [ 21 6 p p p Figure 6 Effect of pazopanib on the protein expression of p‐JNK1/2 (B) and p‐P38 MAPK (C), as well as mRNA expression levels of MEKK2 (D) and MEKK3 (E) in lung tissue. (A) An immunoblot showing the protein expression of p‐JNK1/2 and p‐P38 MAPK in lung tissues. Equal protein loading is proven by β‐actin protein expression. Values represent means ± SD ( n p 2.6 Influence of Pazopanib Administration on the Levels of Pro‐Fibrotic and Inflammatory Cytokines in Lung Tissue Inflammation is mediated by cytokines such as TNF‐α, IL‐1β, IL‐13, and IL‐33 that play a central role in the progression of fibrosis [ 11 p 7 p Figure 7 Effect of pazopanib on the levels of TNF‐ α β n p p p β α 3 Discussion The current work provides the first evidence for the beneficial role of pazopanib in deterring lung fibrosis triggered by exposure to the anticancer chemotherapeutic drug bleomycin in mice. This notion is supported by (a) the remarkable improvement of body weight loss and the pulmonary histopathological features; (b) the suppression of MEKK2 and MEKK3 mRNA expression; (c) the repression of p‐JNK1/2 and p‐P38 protein expression; (d) the adjustment of the bleomycin‐mediated dysregulation of the levels of examined cytokines including IL‐1β, IL‐13, IL‐33, TNF‐α, and NF‐κB P65; and (e) the reversal of bleomycin‐induced elevation in TGF‐β1 and α‐SMA levels. Bleomycin‐elicited lung fibrosis is a well‐characterized and universally accepted animal model for pulmonary fibrosis. Primarily, in the current study, bleomycin caused a marked decline in body weight, which might be related to severe inflammation occurring early following bleomycin administration, as stated previously by Moeller et al. [ 23 24 Immunohistochemistry for α‐SMA plus TGF‐β1 was performed on lung sections to determine the impact of pazopanib treatment on α‐SMA and TGF‐β1 levels in bleomycin‐exposed mice. Results revealed that α‐SMA expression was increased in the bleomycin alone group. In contrast, pazopanib lowered α‐SMA expression, signifying that pazopanib could deter the myofibroblast escalation in bleomycin‐triggered pulmonary fibrosis since α‐SMA is the hallmark of myofibroblast activation. Results of the present work accord well with earlier research and demonstrated that the fibroblast differentiation suppression could mitigate pulmonary fibrosis [ 25 26 4 27 Fibroblasts have a primary role in fibrogenesis and tissue repair mechanisms. During pulmonary fibrosis, numerous pro‐fibrogenic mediators (e.g., IL‐1β and TNF‐α) trigger fibroblast activation and trans‐differentiation to myofibroblasts featured with abnormally extensive ECM production and deposition that constitutes an imperative part in the establishment and development of fibrosis [ 28 29 30 31 Notably, TGF‐β1 is an essential pro‐fibrotic cytokine, exhibits a fundamental role in numerous fibrotic disorders [ 32 32 33 34 35 36 27 Additionally, the stress‐activated protein kinase group of MAPKs, Ser/Thr kinases, which comprises JNK, ERK, and P38 MAPK subclasses, were reported to be dysregulated and hyperactivated in various stressful conditions such as inflammation, oxidative stress, and exposure to chemotherapeutic drugs [ 37 38 39 40 17 36 41 Moreover, outcomes of existing research showed that the mRNA expression of MEKK2 & MEKK3, as well as the protein expression of p‐JNK1/2 & p‐P38, were upregulated after bleomycin administration. Conversely, pazopanib administration with bleomycin attenuated the gene expression of MEKK2 and MEKK3 and the protein expression of p‐JNK1/2 & p‐P38. Our findings are in line with earlier studies that demonstrated that mitigation of the MAPK pathway was effective in alleviating pulmonary fibrosis [ 42 43 44 Besides, our findings align with an earlier study highlighting the promising role of pazopanib in deterring lung injury [ 21 21 Significantly, inflammation is a crucial factor in IPF development since the aberrant repair mechanisms underlying disease initiation and progression occur in response to chronic inflammation [ 22 45 In addition, findings of the current research accord well with a previous study suggested that pazopanib reduced liver fibrosis by 27 46 47 48 49 47 50 9 51 52 Consistently, TNF‐α is a pleiotropic mediator and exhibits both inflammatory and fibrogenic actions [ 53 54 34 46 55 Conspicuously, pazopanib is a multi‐targeted tyrosine kinase inhibitor that targets c‐Kit receptor, PDGF receptor‐alpha, PDGF receptor‐beta alongside vascular endothelial growth factor receptor‐1, ‐2, and ‐3 [ 56 57 In the existing investigation, the outcomes disclosed that pazopanib exerted anti‐fibrotic and anti‐inflammatory actions on bleomycin‐elicited lung fibrosis by modulating MEKK2 and MEKK3 activity followed by repressing JNK and P38 MAPK cascades, offering pazopanib as a hopeful choice for deterring lung fibrosis progression. 4 Conclusion We performed a detailed assessment of the potential pharmacological treatment of bleomycin‐elicited lung fibrosis using the multi‐tyrosine inhibitor pazopanib. Outcomes of the existing study demonstrated the potential anti‐fibrotic plus anti‐inflammatory actions of pazopanib reflected by the demonstrated amelioration of the abnormal histopathological features and reduced collagen deposition in lung tissues in conjunction with the reported decrease in both TGF‐β1 and α‐SMA levels. Moreover, the anti‐inflammatory action of pazopanib treatment was confirmed by the observed adjustment of inflammatory cytokines levels, including IL‐1β, IL‐13, IL‐33, TNF‐α as well as NF‐κB, following concomitant pazopanib and bleomycin treatment. Further mechanistic examination was conducted and revealed that the previous observations were potentially owing to pazopanib‐induced suppression of MEKK2 and MEKK3 expressions that led to downregulation of both JNK and P38 MAPK protein expressions, then subsequently mitigated pulmonary inflammation and fibrosis. Therefore, our findings suggested that pazopanib could be a promising novel therapeutic option for IPF treatment. Although our findings suggest potential clinical application, toxicity and safety profiles must be carefully evaluated before translation. 5 Experimental 5.1 Animals The study was conducted on 24 male adult Swiss albino mice (25–30 g) purchased from the animal facility, Faculty of Medicine, Al‐Azhar University, Egypt. Animals were housed under constant environmental conditions (25 ± 2°C, 60% ±10 humidity), as well as 12 h light/dark cycles. Experimental animals were permitted free access to both standard feed plus water throughout our study. Mice were adapted 1 week before the study. The animal study was conducted according to ARRIVE guidelines 2.0. for reporting animal research. The study protocol was approved by the Research Ethics Committee of the Faculty of Pharmacy, Cairo University (Permission number: PT 3193). 5.2 Drugs and Chemicals All chemicals used in the current work were purchased from Sigma Aldrich (Sigma, St. Louis, MO., USA) unless otherwise stated. Pazopanib was procured from Novartis Pharmaceuticals (Cairo, Egypt). Bleomycin was obtained from Crinova Healthcare Pvt Ltd (Sarkhej, Ahmedabad, India). 5.3 Experimental Design As shown in Figure 8 n ◦ Group 1 (Control): mice received normal saline (NaCl 0.9%) intraperitoneally (i.p.) for 28 days. ◦ Group 2 (Pazo): mice received pazopanib (10 mg/kg/day, i.p.) from Day 15 to Day 28 [ 58 59 60 ◦ Group 3 (Bleo): mice received bleomcyin (40 U/Kg i.p.) diluted in normal saline on Days 0, 3, 7, 10, and 14 [ 61 62 ◦ Group 4 (Bleo + Pazo): mice received bleomycin as in Group 3 and pazopanib as in Group 2. Figure 8 Timeline of the experiment. At the end of the experiment, all animals were anesthetized with thiopental (50 mg/kg, i.p.) and then euthanized by cervical dislocation. The lungs were then excised and weighed. The left lungs were preserved in formalin (10% v/v) to be used in the histopathological examination, while the right lungs were frozen at ‐80°C for further biochemical analyses. 5.4 Determination of Body Weight and Lung Index The body weight of animals was assessed on the first and the last days of the experiment, and the body weight change was calculated. The lung index was calculated using the following equation: Lung index = weight of the two lungs (mg)/the whole‐body weight (g). 5.5 Histopathological Examination After 24 h fixation in neutral buffered formalin, lungs were dehydrated in ethanol (serial grades) and cleared with xylene. Afterward, the lungs were subjected to Paraplast tissue embedding and then sliced into 4‐μm thick lung tissue sections. The histopathological changes in lung tissue were studied either with hematoxylin and eosin (H&E) or Masson's trichrome staining. H&E staining was employed to evaluate general lung architecture and inflammatory changes, while Masson's trichrome staining was used to assess collagen deposition and the extent of pulmonary fibrosis. Slides were then examined using the light electric microscope. 5.5.1 Immunohistochemical Staining Lung tissues were deparaffinized and sliced into 4‐μm thick tissue sections, then incubated in 3% H 2 2 5.5.2 Microscopic Analysis Microscopic analysis was conducted according to the adopted method from Mohammed et al. [ 63 5.6 Western Blot Analysis Lung tissue sections were mechanically homogenized on ice, in RIPA lysis buffer using glass homogenizer. The tissue homogenate was centrifuged (12,000 g 5.7 Quantitative Real‐Time Polymerase Chain Reaction (qRT‐PCR) The total RNA was extracted from the lung tissues using the SV Total RNA Isolation system (Promega, Madison, WI, USA). RNA samples were reverse‐transcribed to cDNA utilizing an RT‐PCR kit (Thermo Fisher Scientific, MA, USA). qRT‐PCR was accomplished using SYBR Green JumpStart Taq ReadyMix (Sigma–Aldrich, St. Louis, MO, USA). The sequences of primers for MEKK2, MEKK3, and β‐Actin are listed in Table 1 Table 1 Sequence of the primers used in RT‐PCR. Gene Primer sequence (5′–3′) MEKK2 F: CCCAGAGTATGACGACAGTCGA R: GGTAGACCCTACCAAAAGCTCC MEKK3 F: GACTTCAGGACTCGCAGGC R: TGTTCATCCATGGTGGCGAT β‐Actin F: CGTTGACATCCGTAAAGAC R: TAGGAGCCAGGGCAGTA John Wiley & Sons, Ltd. 5.8 Enzyme‐Linked Immunosorbent Assay (ELISA) The levels of IL‐1ß (RayBiotech, Norcross, GA, USA, Cat. No. ELM‐IL1b‐1), IL‐13 (MyBioSource, San Diego, CA, USA, Cat. No. MBS355405), IL‐33 (Cusabio Biotech Co., LTD, Whuan, China, Cat. No. CSB‐E14393m), and NF‐κB P65 (Elabscience, Biotechnology, Houston, TX, USA, Cat. No. E‐EL‐M0838) were assessed by using mice ELISA kits in accordance with the manufacturer's protocol. 5.9 Statistical Analysis Data were expressed as means ± standard deviation (SD). One‐way analysis of variance (ANOVA) followed by Tukey's multiple comparison test was used to compare the differences between groups using GraphPad Prism software (V 9.5.1, USA). The significance level was set to p Conflicts of Interest The authors declare no conflicts of interest. Acknowledgments This current work was funded by Taif University, Saudi Arabia, Project number (TU‐DSPP‐2024‐116). Author Hany H. Arab has received the specified research support from Taif University, Saudi Arabia. The authors extend their appreciation to Taif University, Saudi Arabia, for supporting this study. Data Availability Statement The data that support the findings of this study are available from the corresponding author upon reasonable request. References 1 J. Hutchinson A. Fogarty R. Hubbard T. McKeever Global Incidence and Mortality of Idiopathic Pulmonary Fibrosis: A Systematic Review European Respiratory Journal 46 3 2015 795 806 10.1183/09031936.00185114 25976683 2 H. Strongman I. Kausar T. M. Maher Incidence, Prevalence, and Survival of Patients With Idiopathic Pulmonary Fibrosis in the UK Advances in Therapy 35 5 2018 724 736 10.1007/s12325-018-0693-1 29644539 PMC5960490 3 G. Sgalla B. Iovene M. Calvello M. Ori F. Varone L. Richeldi Idiopathic Pulmonary Fibrosis: Pathogenesis and Management Respiratory Research 19 1 2018 32 10.1186/s12931-018-0730-2 29471816 PMC5824456 4 T. A. Wynn Integrating Mechanisms of Pulmonary Fibrosis Journal of Experimental Medicine 208 7 2011 1339 1350 10.1084/jem.20110551 21727191 PMC3136685 5 G. Raghu B. Rochwerg Y. Zhang An Official ATS/ERS/JRS/ALAT Clinical Practice Guideline: Treatment of Idiopathic Pulmonary Fibrosis. An Update of the 2011 Clinical Practice Guideline American Journal of Respiratory and Critical Care Medicine 192 2 2015 e3 e19 10.1164/rccm.201506-1063ST 26177183 6 A. Pardo S. Cabrera M. Maldonado M. Selman Role of Matrix Metalloproteinases In the Pathogenesis of Idiopathic Pulmonary Fibrosis Respiratory Research 17 1 2016 23 10.1186/s12931-016-0343-6 26944412 PMC4779202 7 A. Aimo E. Cerbai G. Bartolucci Pirfenidone Is a Cardioprotective Drug: Mechanisms of Action and Preclinical Evidence Pharmacological Research 155 2020 104694 10.1016/j.phrs.2020.104694 32061664 8 B. Crestani J. T. Huggins M. Kaye Long‐Term Safety and Tolerability of Nintedanib in Patients With Idiopathic Pulmonary Fibrosis: Results From the Open‐Label Extension Study, INPULSIS‐ON Lancet Respiratory Medicine 7 1 2019 60 68 10.1016/S2213-2600(18)30339-4 30224318 9 D. Li R. Guabiraba A.‐G. Besnard IL‐33 Promotes ST2‐dependent Lung Fibrosis by the Induction of Alternatively Activated Macrophages and Innate Lymphoid Cells in Mice Journal of Allergy and Clinical Immunology 134 6 2014 1422 1432.e11 10.1016/j.jaci.2014.05.011 24985397 PMC4258609 10 S.‐H. Yang J.‐C. Lin S.‐Y. Wu Membrane Translocation of IL‐33 Receptor in Ventilator Induced Lung Injury PLoS One 10 3 2015 e0121391 10.1371/journal.pone.0121391 25815839 PMC4376768 11 C. Helbig F. Weber N. Andreas The IL‐33‐induced p38‐/JNK1/2‐TNFα Axis Is Antagonized by Activation of β‐Adrenergic‐Receptors in Dendritic Cells Scientific Reports 10 1 2020 8152 10.1038/s41598-020-65072-3 32424229 PMC7235212 12 C. H. Ong C. L. Tham H. H. Harith N. Firdaus D. A. Israf TGF‐β‐induced Fibrosis: A Review on the Underlying Mechanism and Potential Therapeutic Strategies European Journal of Pharmacology 911 2021 174510 10.1016/j.ejphar.2021.174510 34560077 13 A. V. Samarelli R. Tonelli A. Marchioni Fibrotic Idiopathic Interstitial Lung Disease: The Molecular and Cellular Key Players International Journal of Molecular Sciences 22 16 2021 8952 10.3390/ijms22168952 34445658 PMC8396471 14 M. Cargnello P. P. Roux Activation and Function of the MAPKs and Their Substrates, the MAPK‐Activated Protein Kinases Microbiology and Molecular Biology Reviews 75 1 2011 50 83 10.1128/mmbr.00031-10 21372320 PMC3063353 15 C. R. Weston D. G. Lambright R. J. Davis Signal Transduction. MAP Kinase Signaling Specificity Science 296 5577 2002 2345 2347 10.1126/science.1073344 12089430 16 X. Chang F. Liu X. Wang A. Lin H. Zhao B. Su The Kinases MEKK2 and MEKK3 Regulate Transforming Growth Factor‐β‐Mediated Helper T Cell Differentiation Immunity 34 2 2011 201 212 10.1016/j.immuni.2011.01.017 21333552 PMC3073014 17 J. F. Alcorn J. van der Velden A. L. Brown B. McElhinney C. G. Irvin Y. M. W. Janssen‐Heininger c‐Jun N‐Terminal Kinase 1 Is Required for the Development of Pulmonary Fibrosis American Journal of Respiratory Cell and Molecular Biology 40 4 2009 422 432 10.1165/rcmb.2008-0174OC 18836136 PMC2660560 18 J. Yang Y. Lin Z. Guo The Essential Role of MEKK3 in TNF‐Induced NF‐κB Activation Nature Immunology 2 7 2001 620 624 10.1038/89769 11429546 19 X. Wang F. Zhang F. Chen MEKK3 Regulates IFN‐γ Production in T Cells Through the Rac1/2‐Dependent MAPK Cascades Journal of Immunology 186 10 2011 5791 5800 10.4049/jimmunol.1002127 PMC3833674 21471448 20 D. Zhang V. Facchinetti X. Wang Q. Huang J. Qin B. Su Identification of MEKK2/3 Serine Phosphorylation Site Targeted by the Toll‐Like Receptor and Stress Pathways EMBO Journal 25 1 2006 97 107 10.1038/sj.emboj.7600913 16362041 PMC1356356 21 Q. Yuan A. Basit W. Liang Pazopanib Ameliorates Acute Lung Injuries via Inhibition of MAP3K2 and MAP3K3 Science Translational Medicine 13 591 2021 eabc2499 10.1126/scitranslmed.abc2499 33910977 PMC8466683 22 S. Ahmad M. A. Hughes G. L. Johnson J. E. Scott Development and Validation of a High‐Throughput Intrinsic ATPase Activity Assay for the Discovery of MEKK2 Inhibitors SLAS Discovery 18 4 2013 388 399 10.1177/1087057112466430 PMC3723327 23134735 23 A. Moeller K. Ask D. Warburton J. Gauldie M. Kolb The Bleomycin Animal Model: A Useful Tool to Investigate Treatment Options for Idiopathic Pulmonary Fibrosis? International Journal of Biochemistry & Cell Biology 40 3 2008 362 382 10.1016/j.biocel.2007.08.011 17936056 PMC2323681 24 M. Aubin Vega C. Chupin C. Massé A. Dagenais Y. Berthiaume E. Brochiero Impact of ENaC Downregulation in Transgenic Mice on the Outcomes of Acute Lung Injury Induced by Bleomycin Experimental Physiology 106 4 2021 1110 1119 10.1113/EP089060 33502034 25 S. Bindu V. B. Pillai A. Kanwal SIRT3 Blocks Myofibroblast Differentiation and Pulmonary Fibrosis by Preventing Mitochondrial DNA Damage American Journal of Physiology‐Lung Cellular and Molecular Physiology 312 1 2017 L68 L78 10.1152/ajplung.00188.2016 27815257 PMC5283928 26 M. H. Zohny S. Cavalu M. E. Youssef Coomassie Brilliant Blue G‐250 Dye Attenuates Bleomycin‐Induced Lung Fibrosis by Regulating the NF‐κB and NLRP3 Crosstalk: A Novel Approach for Filling An Unmet Medical Need Biomedicine & Pharmacotherapy 148 2022 112723 10.1016/j.biopha.2022.112723 35202914 27 M. Elshal N. Abu‐Elsaad A. El‐Karef T. M. Ibrahim The Multi‐Kinase Inhibitor Pazopanib Targets Hepatic Stellate Cell Activation and Apoptosis Alleviating Progression of Liver Fibrosis Naunyn‐Schmiedeberg's Archives of Pharmacology 388 12 2015 1293 1304 10.1007/s00210-015-1157-7 26269412 28 J. J. Tomasek G. Gabbiani B. Hinz C. Chaponnier R. A. Brown Myofibroblasts and Mechano‐Regulation of Connective Tissue Remodelling Nature Reviews Molecular Cell Biology 3 5 2002 349 363 10.1038/nrm809 11988769 29 R. T. Kendall C. A. Feghali‐Bostwick Fibroblasts in Fibrosis: Novel Roles and Mediators Frontiers in Pharmacology 1 2014 1 13 10.3389/fphar.2014.00123 PMC4034148 24904424 30 S. Holm Nielsen N. Willumsen D. J. Leeming Serological Assessment of Activated Fibroblasts by Alpha‐Smooth Muscle Actin (α‐SMA): A Noninvasive Biomarker of Activated Fibroblasts in Lung Disorders Translational Oncology 12 2 2019 368 374 10.1016/j.tranon.2018.11.004 30504086 PMC6277250 31 B. Hinz Formation and Function of the Myofibroblast During Tissue Repair Journal of Investigative Dermatology 127 3 2007 526 537 10.1038/sj.jid.5700613 17299435 32 Z. Ye Y. Hu TGF‐β1: Gentlemanly Orchestrator in Idiopathic Pulmonary Fibrosis (Review) International Journal of Molecular Medicine 48 1 2021 132 10.3892/ijmm.2021.4965 34013369 PMC8136122 33 A. Loboda M. Sobczak A. Jozkowicz J. Dulak TGF‐β1/Smads and miR‐21 in Renal Fibrosis and Inflammation Mediators of Inflammation 2016 2016 1 12 10.1155/2016/8319283 PMC5005604 27610006 34 A. Biernacka M. Dobaczewski N. G. Frangogiannis TGF‐Beta Signaling in Fibrosis Libertarian Papers 6 5 2014 57 10.3109/08977194.2011.595714.TGF- PMC4408550 21740331 35 W. Qian X. Cai Q. Qian W. Zhang D. Wang Astragaloside IV Modulates TGF‐β1‐dependent Epithelial‐Mesenchymal Transition In Bleomycin‐Induced Pulmonary Fibrosis Journal of Cellular and Molecular Medicine 22 9 2018 4354 4365 10.1111/jcmm.13725 29971947 PMC6111865 36 B. A. Hocevar TGF‐Beta Induces Fibronectin Synthesis Through a c‐Jun N‐Terminal Kinase‐Dependent, Smad4‐independent Pathway EMBO Journal 18 5 1999 1345 1356 10064600 10.1093/emboj/18.5.1345 PMC1171224 37 I. Nikolic M. Leiva G. Sabio The Role of Stress Kinases In Metabolic Disease Nature Reviews Endocrinology 16 12 2020 697 716 10.1038/s41574-020-00418-5 33067545 38 J. Yue J. M. López Understanding MAPK Signaling Pathways in Apoptosis International Journal of Molecular Sciences 21 7 2020 2346 10.3390/ijms21072346 32231094 PMC7177758 39 H. Matsuoka T. Arai M. Mori A p38 MAPK Inhibitor, FR‐167653, Ameliorates Murine Bleomycin‐Induced Pulmonary Fibrosis American Journal of Physiology‐Lung Cellular and Molecular Physiology 283 1 27–1 2002 L103 L112 10.1152/ajplung.00187.2001 12060566 40 K. Yoshida K. Kuwano N. Hagimoto MAP Kinase Activation and Apoptosis in Lung Tissues From Patients With Idiopathic Pulmonary Fibrosis Journal of Pathology 198 3 2002 388 396 10.1002/path.1208 12375272 41 H. Ihn K. Yamane K. Tamaki Increased Phosphorylation and Activation of Mitogen‐Activated Protein Kinase p38 in Scleroderma Fibroblasts Journal of Investigative Dermatology 125 2 2005 247 255 10.1111/j.0022-202X.2005.23766.x 16098034 42 Q. Wu L. Han W. Gui F. Wang W. Yan H. Jiang MiR‐503 Suppresses Fibroblast Activation and Myofibroblast Differentiation by Targeting VEGFA and FGFR1 in Silica‐Induced Pulmonary Fibrosis Journal of Cellular and Molecular Medicine 24 24 2020 14339 14348 10.1111/jcmm.16051 33135394 PMC7754009 43 W. Cheng L. Mi J. Tang W. Yu Expression of TRB3 Promotes Epithelial‐Mesenchymal Transition of MLE‐12 Murine Alveolar Type II Epithelial Cells Through the TGF‐β1/Smad3 Signaling Pathway Molecular Medicine Reports 19 4 2019 2869 2875 10.3892/mmr.2019.9900 30720074 44 J. L. J. van der Velden Y. Ye J. D. Nolin JNK Inhibition Reduces Lung Remodeling and Pulmonary Fibrotic Systemic Markers Clinical and Translational Medicine 5 1 2016 36 10.1186/s40169-016-0117-2 27590145 PMC5010551 45 A. K. Yadav B. C. Jang Inhibition of Lipid Accumulation and cyclooxygenase‐2 Expression in Differentiating 3t3‐l1 Preadipocytes by Pazopanib, a Multikinase Inhibitor International Journal of Molecular Sciences 22 9 2021 4884 10.3390/ijms22094884 34063048 PMC8125232 46 G. Epstein Shochet E. Brook L. Israeli‐Shani E. Edelstein D. Shitrit Fibroblast Paracrine TNF‐α Signaling Elevates Integrin A5 Expression in Idiopathic Pulmonary Fibrosis (IPF) Respiratory Research 18 1 2017 122 10.1186/s12931-017-0606-x 28629363 PMC5477311 47 M. J. Park S. J. Moon E. J. Lee IL‐1‐IL‐17 Signaling Axis Contributes to Fibrosis and Inflammation in Two Different Murine Models of Systemic Sclerosis Frontiers in Immunology 9 JUL 2018 1 12 10.3389/fimmu.2018.01611 30042768 PMC6048384 48 M. Zhang Y. Guo H. Fu Chop Deficiency Prevents UUO‐Induced Renal Fibrosis by Attenuating Fibrotic Signals Originated From Hmgb1/TLR4/NFκB/IL‐1β Signaling Cell Death & Disease 6 8 2015 e1847 10.1038/cddis.2015.206 26247732 PMC4558499 49 W.‐J. Zhang S.‐J. Chen S.‐C. Zhou S.‐Z. Wu H. Wang Inflammasomes and Fibrosis Frontiers in Immunology 12 2021 643149 10.3389/fimmu.2021.643149 34177893 PMC8226128 50 G. Palmer C. Gabay Interleukin‐33 Biology With Potential Insights Into Human Diseases Nature Reviews Rheumatology 7 6 2011 321 329 10.1038/nrrheum.2011.53 21519352 51 M. Fanny M. Nascimento L. Baron The IL‐33 Receptor ST2 Regulates Pulmonary Inflammation and Fibrosis to Bleomycin Frontiers in Immunology 9 JUN 2018 1476 10.3389/fimmu.2018.01476 29988569 PMC6026799 52 L. Roussel M. Erard C. Cayrol J. P. Girard Molecular Mimicry Between IL‐33 and KSHV for Attachment to Chromatin Through the H2A‐H2B Acidic Pocket EMBO Reports 9 10 2008 1006 1012 10.1038/embor.2008.145 18688256 PMC2572127 53 V. della Latta A. Cecchettini S. del Ry M. A. Morales Bleomycin in the Setting of Lung Fibrosis Induction: From Biological Mechanisms to Counteractions Pharmacological Research 97 2015 122 130 10.1016/j.phrs.2015.04.012 25959210 54 P. Krzyszczyk R. Schloss A. Palmer F. Berthiaume The Role of Macrophages in Acute and Chronic Wound Healing and Interventions to Promote Pro‐Wound Healing Phenotypes Frontiers in Physiology 9 MAY 2018 1 22 10.3389/fphys.2018.00419 29765329 PMC5938667 55 A. Datta C. J. Scotton R. C. Chambers Novel Therapeutic Approaches for Pulmonary Fibrosis British Journal of Pharmacology 163 1 2011 141 172 10.1111/j.1476-5381.2011.01247.x 21265830 PMC3085875 56 G. Sonpavde T. E. Hutson Pazopanib: A Novel Multitargeted Tyrosine Kinase Inhibitor Current Oncology Reports 9 2 2007 115 119 10.1007/s11912-007-0007-2 17288876 57 A. Fauster M. Rebsamen K. V. M. Huber A Cellular Screen Identifies Ponatinib and Pazopanib as Inhibitors of Necroptosis Cell Death & Disease 6 5 2015 e1767 10.1038/cddis.2015.130 25996294 PMC4669708 58 H. Sun J. Wu R. Wang Pazopanib Alleviates Neuroinflammation and Protects Dopaminergic Neurons in Lps‐Stimulated Mouse Model by Inhibiting MEK4‐JNK‐AP‐1 Pathway Acta Pharmacologica Sinica 44 6 2023 1135 1148 10.1038/s41401-022-01030-1 36536076 PMC10203146 59 A. Nair S. Jacob A Simple Practice Guide for Dose Conversion Between Animals and Human Journal of Basic and Clinical Pharmacy 7 2 2016 27 31 10.4103/0976-0105.177703 27057123 PMC4804402 60 H. I. Hurwitz A. Dowlati S. Saini Phase I Trial of Pazopanib in Patients With Advanced Cancer Clinical Cancer Research 15 12 2009 4220 4227 10.1158/1078-0432.CCR-08-2740 19509175 61 R. C. Savani Z. Zhou E. Arguiri Bleomycin‐Induced Pulmonary Injury in Mice Deficient in SPARC American Journal of Physiology‐Lung Cellular and Molecular Physiology 279 4 2000 L743 L750 10.1152/ajplung.2000.279.4.L743 11000135 62 O. A. Ahmedy M. W. Kamel D. M. Abouelfadl M. E. Shabana R. H. Sayed Berberine Attenuates Epithelial Mesenchymal Transition in Bleomycin‐Induced Pulmonary Fibrosis in Mice via Activating A2aR and Mitigating the SDF‐1/CXCR4 Signaling Life Sciences 322 2023 121665 10.1016/j.lfs.2023.121665 37028546 63 M. Z. Mohamed M. F. Abed El Baky M. E. Ali H. M. Hafez Aprepitant Exerts Anti‐Fibrotic Effect via Inhibition of TGF‐β/Smad3 Pathway in Bleomycin‐Induced Pulmonary Fibrosis in Rats Environmental Toxicology and Pharmacology 95 2022 103940 10.1016/j.etap.2022.103940 35931359 ",
  "metadata": {
    "Title of this paper": "Aprepitant Exerts Anti‐Fibrotic Effect via Inhibition of TGF‐β/Smad3 Pathway in Bleomycin‐Induced Pulmonary Fibrosis in Rats",
    "Journal it was published in:": "Archiv Der Pharmazie",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12477462/"
  }
}