{
  "title": "Paper_527",
  "abstract": "pmc World J Clin Oncol 1494 wjco WJCO World Journal of Clinical Oncology 2218-4333 Baishideng Publishing Group Inc PMC12476584 PMC12476584.1 12476584 12476584 41024829 10.5306/wjco.v16.i9.110087 jWJCO.v16.i9.eid110087 1 Retrospective Cohort Study Anatomical distribution of bone metastases in stage IV breast cancer: According to histological subtype Zari DS et al Zari David Shaked Department of Orthopedic Surgery, Rambam Medical Center, Haifa 3501115, Israel Technion Israel Institute of Technology, The Ruth and Bruce Rappaport Faculty of Medicine, Haifa 3501115, Israel. shaked.zaki1009@gmail.com Novak Rostislav Department of Orthopedic Surgery, Rambam Medical Center, Haifa 3501115, Israel Technion Israel Institute of Technology, The Ruth and Bruce Rappaport Faculty of Medicine, Haifa 3501115, Israel Haviv Or Department of Orthopedic Surgery, Rambam Medical Center, Haifa 3501115, Israel Technion Israel Institute of Technology, The Ruth and Bruce Rappaport Faculty of Medicine, Haifa 3501115, Israel Ron Itay Department of Orthopedic Surgery, Rambam Medical Center, Haifa 3501115, Israel Technion Israel Institute of Technology, The Ruth and Bruce Rappaport Faculty of Medicine, Haifa 3501115, Israel Kaplan Ben Department of Orthopedic Surgery, Rambam Medical Center, Haifa 3501115, Israel Technion Israel Institute of Technology, The Ruth and Bruce Rappaport Faculty of Medicine, Haifa 3501115, Israel Awad Bana Department of Orthopedic Surgery, Rambam Medical Center, Haifa 3501115, Israel Technion Israel Institute of Technology, The Ruth and Bruce Rappaport Faculty of Medicine, Haifa 3501115, Israel Norman Doron Department of Orthopedic Surgery, Rambam Medical Center, Haifa 3501115, Israel Technion Israel Institute of Technology, The Ruth and Bruce Rappaport Faculty of Medicine, Haifa 3501115, Israel Nikomarov David Department of Orthopedic Surgery, Rambam Medical Center, Haifa 3501115, Israel Technion Israel Institute of Technology, The Ruth and Bruce Rappaport Faculty of Medicine, Haifa 3501115, Israel Author contributions: Zari DS designed the research, curated the data, performed formal analysis, and wrote the original draft; Novak R performed the investigation, curated the data, and contributed to writing; Haviv O developed the software, performed validation and visualization, and contributed to writing and editing; Ron I contributed to methodology, project administration, and statistical analysis; Kaplan B curated the data, performed investigation, and contributed to writing and editing; Awad B collected the data, performed formal analysis, and contributed to writing and editing; Norman D contributed to methodology and provided supervision; Nikomarov D performed statistical analysis, validation, supervision, and contributed to writing. Corresponding author: David Shaked Zari, MD, Department of Orthopedic Surgery, Rambam Medical Center, Hallya Hashniya, Haifa 3501115, Israel. shaked.zaki1009@gmail.com 24 9 2025 24 9 2025 16 9 497728 110087 29 5 2025 24 6 2025 5 8 2025 24 09 2025 29 09 2025 30 09 2025 ©The Author(s) 2025. Published by Baishideng Publishing Group Inc. All rights reserved. 2025 https://creativecommons.org/licenses/by-nc/4.0/ This article is an open-access article that was selected by an in-house editor and fully peer-reviewed by external reviewers. It is distributed in accordance with the Creative Commons Attribution NonCommercial (CC BY-NC 4.0) license, which permits others to distribute, remix, adapt, build upon this work non-commercially, and license their derivative works on different terms, provided the original work is properly cited and the use is non-commercial. See: https://creativecommons.org/Licenses/by-nc/4.0/ BACKGROUND Bone is the most common site of metastasis in breast cancer, yet limited data exist regarding the precise anatomical distribution of bone metastases by tumor subtype. AIM To examine the anatomical distribution of the first bone metastases in stage IV breast cancer, stratified by histological subtype. Secondary objectives include analyzing the anatomical distribution of subsequent bone metastases, Metastasis-Free Survival (MFI), Progression-Free Interval (PFI), and overall survival (OS). METHODS A retrospective cohort study was conducted on 107 adult females with stage IV breast cancer and bone metastases between 2013 and 2023. Patients were classified by histological subtype (Luminal A/B, HER2-enriched, and Triple-Negative). First and subsequent bone metastasis locations were identified via RESULTS Rib metastases were significantly more common in HER2-enriched tumors (80%, P P P CONCLUSION Breast cancer subtypes are associated with suggestive bone metastasis patterns—specifically, rib involvement in HER2-enriched and scapula/clavicle in Triple-Negative cases. While anatomical variations exist, they did not translate into differential survival or fracture risk in this cohort. Luminal A Luminal B HER2-enriched Triple-negative Bone metastasis Breast cancer pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement no pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes  Core Tip: INTRODUCTION Breast cancer remains the most prevalent cancer among women globally, with approximately 2 million new cases diagnosed annually. Among breast cancer patients, bone is the predominant site of metastasis, followed by lungs, liver, and brain. The metastatic spread significantly impacts patient survival and recurrence rates, underscoring the critical need to understand the relationship between tumor subtypes and metastatic patterns. Breast cancer is categorized into four main subtypes based on immunohistochemistry (IHC) of hormone receptors (HR)-estrogen receptor (ER), progesterone receptor (PR), and HER2. These subtypes-luminal A, luminal B, HER2-enriched, and Triple-Negative-exhibit suggestive metastatic behaviors. Notably, luminal subtypes show a higher propensity for bone metastasis, with up to 71.4% of luminal B tumors primarily metastasizing to bone. While the general metastatic patterns of these subtypes are known, there is a significant gap in our understanding of the specific anatomical distribution of bone metastases. This knowledge is crucial for developing targeted screening and treatment strategies. The primary aim of this study is to examine the anatomical distribution of the first bone metastases in stage IV breast cancer, stratified by histological subtype. Secondary objectives include analyzing the anatomical distribution of subsequent bone metastases, Metastasis-Free Survival (MFI), Progression-Free Interval (PFI), and overall survival (OS). MATERIALS AND METHODS Study design and population This retrospective cohort study analyzed medical records of 107 adult females with stage IV breast cancer who presented with bone metastasis at initial diagnosis or during follow-up between January 1, 2013, and December 31, 2023. The study included adult patients diagnosed with breast cancer who either presented with bone metastases at initial diagnosis or subsequently developed bone metastases during follow-up. Patients under 18 years of age or with a history of other cancers were excluded. HR status for ER and PR was assessed according to CAP/ASCO guidelines, with ≥ 1% nuclear staining classified as positive. HER2 status was determined by IHC, scored as negative (0, +1) or positive (+3). Breast cancer subtypes were defined as Luminal A (ER/PR-positive, HER2-negative, low proliferation-Ki-67 index), Luminal B (ER/PR-positive, HER2-positive, higher proliferation-Ki-67 index), HER2-enriched (ER/PR-negative, HER2-positive, aggressive), and Triple-Negative (ER/PR/HER2-negative, aggressive). Bone metastases were confirmed using standard imaging modalities: Computed tomography (CT) scan (lytic/sclerotic lesions on axial imaging), 18F-FDG positron emission tomography (PET)/CT (hypermetabolic skeletal lesions with SUV max Then, the anatomic location of the bone metastasis was classified as skull, pectoral girdle (clavicle/scapula), humerus, sternum, cervical/thoracic/Lumbar/sacral vertebrae, pelvis, femoral head/neck, or femoral shaft. The following parameters were also examined: The anatomical distribution of subsequent bone metastases. MFI: Time interval from initial breast cancer diagnosis to first bone metastasis; PFI: Time interval from first to second bone metastasis, confirmed by imaging; OS: Time interval from diagnosis to death from any cause or last follow-up. Statistical analysis Descriptive statistics on terms of mean, standard deviation, median, percentages, and ranges were calculated to the whole parameters in the study. Normal distribution of continuous parameters was tested by the Kolmogorov-Smirnov test. As a result of these tests, we used ANOVA or Kruskal-Wallis tests for differences between groups with adjustment for multiple comparisons. For categorical parameters, we used the Pearson χ 2 P RESULTS The final cohort comprised 107 adult female patients who were diagnosed with stage IV breast cancer and bone metastasis. Among them, 82 (76.6%) were luminal A, 12 (11.2%) were luminal B, 8 (7.4%) were Triple-Negative, and 5 (4.6%) were HER2-enriched. The patient's demographics are reported in Table 1 Table 1 Patients demographics   Luminal A ( n  Luminal B ( n  Triple neg ( n  HER 2 enrich ( n   P Age at diagnosis 59.8 ± 12.4 58.7 ± 11.65 62.2 ± 15.8 56.21 ± 11.0 0.85 Metastasis-free survival (median, years) 2.55 (0.05-7.39) 2.75 (0.65-7.12) 1.14 (0.09-5.98) 0.37 (0.05-8.89) 0.98 BMI 26.8 ± 5.9 24.4 ± 5.7 26.3 ± 4.8 25.4 ± 8.3 0.58 Death 59 (72.8%) 9 (75%) 8 (100%) 3 (60%) 0.33 BMI: Body mass index. The distribution of the first bone metastasis varied among breast cancer subtypes. Patients with HER2-enriched tumors exhibited a higher prevalence of rib metastases (80%) compared to other subtypes ( P P 1 2 Figure 1 Anatomical distribution of first bone metastasis according to histological subtypes. Table 2 Anatomical distribution of first bone metastasis according to histological subtypes, n  First bone metastasis  Luminal A ( n  Luminal B ( n  Triple neg ( n  HER 2 enrich ( n   P Skull bones 3/82 (3.7) 0 1/8 (12.5) 0 0.5 Scapula and clavicle 3/82 (3.7) 1/12 (8.3) 3/8 (37.5) 0 0.003 Sternum 7/82 (8.5) 2/12 (17) 1/8 (12.5) 2/5 (40) 0.16 Humerus 14/82 (17) 2/12 (17) 1/8 (12.5) 0 0.77 Ribs 24/82 (30) 2/12 (17) 1/8 (12.5) 4/5 (80) 0.041 Cervical vertebra 12/82 (15) 3/12 (25) 1/8 (12.5) 0 0.60 Thoracic vertebra 36/82 (44) 5/12 (45.5) 2/8 (25) 3/5 (60) 0.64 Lumbar vertebra 38/82 (46) 7/12 (58) 3/8 (37.5) 2/5 (40) 0.79 Sacrum 18/82 (22) 1/12 (8) 1/8 (12.5) 1/5 (20) 0.68 Pelvic bones (ilium, ischium, pubis) 43/82 (52) 5/12 (42) 5/8 (62.5) 3/5 (60) 0.80 Femoral head and neck 21/82 (26) 4/12 (33) 2/8 (25) 3/5 (60) 0.39 Femoral shaft and distal femur 20/82 (25) 3/12 (25) 2/8 (25) 3/5 (60) 0.38 The pattern of subsequent bone metastases followed a similar distribution, with pelvic bone involvement being more common in HER2-enriched (60%) and luminal B (58%) groups compared to luminal A (38%) (Table 3 Table 3 Anatomical distribution of second bone metastasis according to histological subtypes, n  Second bone metastasis  Luminal A ( n  Luminal B ( n  Triple neg ( n  HER 2 enrich ( n   P Without bone progression 16/82 (19.5) 3/12 (25) 3/8 (37.5) 1/5 (20) 0.68 Skull bones 7/82 (9) 0 0 0 0.50 Scapula and clavicle 6/82 (7) 1/12 (8) 1/8 (12.5) 0 0.36 Sternum 7/82 (9) 0 0 0 0.50 Humerus 10/82 (12.5) 2/12 (17) 2/8 (25) 0 0.60 Ribs 28/82 (35) 2/12 (17) 0 1/5 (20) 0.13 Cervical vertebra 19/82 (24) 3/12 (25) 1/8 (12.5) 1/5 (20) 0.90 Thoracic vertebra 35/82 (44) 3/12 (25) 2/8 (25) 2/5 (40) 0.50 Lumbar vertebra 28/82 (35) 6/12 (50) 2/8 (25) 0 0.24 Sacrum 17/82 (21) 3/12 (25) 0 1/5 (20) 0.53 Pelvic bones (ilium, ischium, pubis) 31/82 (38) 7/12 (58) 0 3/5 (60) 0.046 Femoral head and neck 25/82 (31) 2/12 (17) 3/8 (37.5) 1/5 (20) 0.68 Femoral shaft and distal femur 24/82 (30) 2/12 (17) 2/8 (25) 1/5 (20) 0.77 The median MFI time was lowest in the HER2-enriched group (4.0 months), while luminal B patients exhibited the longest period (median 34 months), though differences were not statistically significant ( P P 1 The PFI, defined as the time between the first and second bone metastases, is illustrated by the Kaplan-Meier curve in Figure 2 vs P P Figure 2 Kaplan-Meier curve describing progression-free interval according to histological subtypes. Regarding pathologic fracture/impending fracture in the common anatomical sites, there was no significant difference among the different groups (Table 4 Table 4 Pathologic and impending fractures according to histological subtypes, n  Pathological fracture  Luminal A ( n  Luminal B ( n  Triple neg ( n  HER 2 enrich ( n   P Femoral head and neck 16 (20) 4 (33) 2 (25) 1 (20) 0.75 Spinal vertebrae 12 (15) 1 (8) 0 1 (20) 0.77 Humerus 5 (6) 1 (8) 1 (12.5) 0 0.78 Other 1 8 (10) 0 1 (12.5) 0 0.63 Impending hip fracture 29 (35) 6 (50) 3 (37.5) 0 0.28 1 Other includes: Ribs, Tibia, Fibula and Pelvic bones. Receptor-based analysis A receptor-based analysis revealed no significant differences in bone metastasis locations between HER2-positive, PR-positive, and ER-positive groups (Table 5 Table 5 Anatomical distribution of first bone metastasis according to hormone receptor, n  First bone metastasis  ER ( n  PR ( n  HER 2 ( n   P Skull bones 3/94 (3.2) 1/59 (1.7) 0 1.00 Scapula and clavicle 4/94 (4.2) 3/59 (5) 1/16 (6.2) 0.93 Sternum 9/94 (9.6) 5/59 (8.5) 4/16 (25) 0.14 Humerus 16/94 (17.0) 10/59 (16.9) 2/16 (12.5) 0.89 Ribs 26/94 (28.0) 14/59 (24.1) 6/16 (37.5) 0.56 Cervical vertebra 15/94 (16.0) 10/59 (16.9) 3/16 (18.8) 0.96 Thoracic vertebra 41/94 (43.6) 23/59 (38.9) 8/16 (50) 0.62 Lumbar vertebra 45/94 (47.9) 25/59 (42.4) 8/16 (50) 0.76 Sacrum 19/94 (20.2) 10/59 (16.9) 2/16 (12.5) 0.72 Pelvic bones (ilium, ischium, pubis) 48/94 (51.1) 27/59 (45.8) 8/16 (50) 0.81 Femoral head and neck 25/94 (26.6) 18/59 (30.5) 7/16 (43.8) 0.37 Femoral shaft and distal femur 23/94 (24.7) 16/59 (27.6) 6/16 (37.5) 0.56 DISCUSSION This study investigated the anatomical distribution of bone metastases in stage IV breast cancer patients. Rib metastases were significantly more common in HER2-enriched tumors, while scapula/clavicle metastases were more prevalent in Triple-Negative cases. Subsequent bone metastases mirrored initial patterns, with pelvic involvement notably higher in HER2-enriched and luminal B patients. Nevertheless, there was no significant difference regarding pathologic fractures or impending fractures in the common anatomical sites. Furthermore, receptor-based analysis showed no significant variation in bone metastasis locations, and no significant differences were found in MFI, PFI, or OS among subtypes. According to the American Cancer Society, luminal A accounts for 73% of breast cancer cases in the United States, luminal B for 11%, Triple-Negative for 12%, and HER2-enriched for 4%[ 1 7 8 12 Pareek et al 12 et al 6 et al 6 et al 12 P P 11 13 The spine is the most common site of bone metastasis in breast cancer patients[ 14 Tables 1 2 13 14 via 14 15 The ribs are richly vascularized via 15 Current literature suggests that patients suffering from pathological fractures (PF) are at increased risk of death[ 16 19 et al 17 Limitations Despite the strengths of our study-including its well-defined cohort and precise anatomical classification of bone metastases-several limitations merit discussion. The retrospective design introduces inherent biases, notably potential variability in imaging modalities and interpretation. Furthermore, the sample size-especially in the HER2-enriched and TNBC subgroups, is small, which may limit statistical power and generalizability. We also could not fully account for confounding factors such as systemic treatment history, genetic predisposition, or tumor microenvironment influences. Although we observed subtype-specific metastatic patterns ( e.g. Lastly Routine bone scans may not adequately cover scapular and clavicular regions, potentially reducing detection sensitivity in TNBC patients. Advanced imaging modalities, such as SPECT/CT or PETCT, may improve detection in these anatomical sites. CONCLUSION In conclusion, breast cancer histological subtypes are associated with suggestive patterns of bone metastasis, specifically rib involvement in HER2-enriched and the scapula/clavicle in Triple-Negative cases. Despite these differences, survival outcomes and fracture rates were not significantly impacted by subtype. These findings support a more nuanced approach to surveillance while reinforcing the validity of current preventive strategies. Future research should explore underlying biological mechanisms and larger cohorts to validate these observations. ACKNOWLEDGEMENTS Thanks to Romy Schindler for editing assistance. Thanks to Ronit Leiba for statistical analysis assistance.  Institutional review board statement:  Informed consent statement:  Conflict-of-interest statement:  STROBE statement:  Provenance and peer review:  Peer-review model:  Specialty type:  Country of origin:  Peer-review report’s classification  Scientific Quality:  Novelty:  Creativity or Innovation:  Scientific Significance:  P-Reviewer: S-Editor: L-Editor: P-Editor: 1 Pang L Gan C Xu J Jia Y Chai J Huang R Li A Ge H Yu S Cheng H Bone Metastasis of Breast Cancer: Molecular Mechanisms and Therapeutic Strategies Cancers (Basel) 2022 14 5727 36497209 10.3390/cancers14235727 PMC9738274 2 Jiang X Chen G Sun L Liu C Zhang Y Liu M Liu C Characteristics and survival in bone metastatic breast cancer patients with different hormone receptor status: A population-based cohort study Front Oncol 2022 12 977226 36091103 10.3389/fonc.2022.977226 PMC9459168 3 Wu Q Li J Zhu S Wu J Chen C Liu Q Wei W Zhang Y Sun S Breast cancer subtypes predict the preferential site of distant metastases: a SEER based study Oncotarget 2017 8 27990 27996 28427196 10.18632/oncotarget.15856 PMC5438624 4 Pulido C Vendrell I Ferreira AR Casimiro S Mansinho A Alho I Costa L Bone metastasis risk factors in breast cancer Ecancermedicalscience 2017 11 715 28194227 10.3332/ecancer.2017.715 PMC5295847 5 Marie L Braik D Abdel-Razeq N Abu-Fares H Al-Thunaibat A Abdel-Razeq H Clinical Characteristics, Prognostic Factors and Treatment Outcomes of Patients with Bone-Only Metastatic Breast Cancer Cancer Manag Res 2022 14 2519 2531 36039341 10.2147/CMAR.S369910 PMC9419893 6 Siregar KB Al Anas M Unveiling bone metastasis: Exploring histological subtypes of breast cancer in Indonesia's tertiary referral hospital Cancer Treat Res Commun 2023 37 100764 37769530 10.1016/j.ctarc.2023.100764 7 Howlader N Cronin KA Kurian AW Andridge R Differences in Breast Cancer Survival by Molecular Subtypes in the United States Cancer Epidemiol Biomarkers Prev 2018 27 619 626 29593010 10.1158/1055-9965.EPI-17-0627 8 Xiao W Zheng S Yang A Zhang X Zou Y Tang H Xie X Breast cancer subtypes and the risk of distant metastasis at initial diagnosis: a population-based study Cancer Manag Res 2018 10 5329 5338 30464629 10.2147/CMAR.S176763 PMC6225920 9 Arciero CA Guo Y Jiang R Behera M O'Regan R Peng L Li X ER(+)/HER2(+) Breast Cancer Has Different Metastatic Patterns and Better Survival Than ER(-)/HER2(+) Breast Cancer Clin Breast Cancer 2019 19 236 245 30846407 10.1016/j.clbc.2019.02.001 10 Ahn SG Lee HM Cho SH Lee SA Hwang SH Jeong J Lee HD Prognostic factors for patients with bone-only metastasis in breast cancer Yonsei Med J 2013 54 1168 1177 23918566 10.3349/ymj.2013.54.5.1168 PMC3743183 11 Liede A Jerzak KJ Hernandez RK Wade SW Sun P Narod SA The incidence of bone metastasis after early-stage breast cancer in Canada Breast Cancer Res Treat 2016 156 587 595 27083181 10.1007/s10549-016-3782-3 12 Pareek A Singh OP Yogi V Ghori HU Tiwari V Redhu P Bone metastases incidence and its correlation with hormonal and human epidermal growth factor receptor 2 neu receptors in breast cancer J Cancer Res Ther 2019 15 971 975 31603096 10.4103/jcrt.JCRT_235_18 13 Briasoulis E Karavasilis V Kostadima L Ignatiadis M Fountzilas G Pavlidis N Metastatic breast carcinoma confined to bone: portrait of a clinical entity Cancer 2004 101 1524 1528 15316943 10.1002/cncr.20545 14 Peterson KA Zehri AH Lee KE Kittel CA Evans JK Wilson JL Hsu W Current trends in incidence, characteristics, and surgical management of metastatic breast cancer to the spine: A National Inpatient Sample analysis from 2005 to 2014 J Clin Neurosci 2021 91 99 104 34373068 10.1016/j.jocn.2021.06.043 15 Kumar R Yarmand-Bagheri R The role of HER2 in angiogenesis Semin Oncol 2001 28 27 32 10.1016/s0093-7754(01)90279-9 11706393 16 Saad F Lipton A Cook R Chen YM Smith M Coleman R Pathologic fractures correlate with reduced survival in patients with malignant bone disease Cancer 2007 110 1860 1867 17763372 10.1002/cncr.22991 17 Lamo-Espinosa JM Mariscal G Gómez-Álvarez J Khalil I San-Julián M Survival impact of pathological fractures in metastatic cancer: a comprehensive meta-analysis Arch Orthop Trauma Surg 2025 145 253 40244368 10.1007/s00402-025-05852-6 18 Mendes D Alves C Afonso N Cardoso F Passos-Coelho JL Costa L Andrade S Batel-Marques F The benefit of HER2-targeted therapies on overall survival of patients with metastatic HER2-positive breast cancer--a systematic review Breast Cancer Res 2015 17 140 26578067 10.1186/s13058-015-0648-2 PMC4650834 19 Gampenrieder SP Rinnerthaler G Greil R Bone-targeted therapy in metastatic breast cancer - all well-established knowledge? Breast Care (Basel) 2014 9 323 330 25759612 10.1159/000368710 PMC4322685 Data sharing statement This manuscript is original, has not been published, and is not under consideration elsewhere. ",
  "metadata": {
    "Title of this paper": "Bone-targeted therapy in metastatic breast cancer - all well-established knowledge?",
    "Journal it was published in:": "World Journal of Clinical Oncology",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12476584/"
  }
}