{
  "title": "Paper_511",
  "abstract": "pmc Front Genet Front Genet 1681 frontgene Front. Genet. Frontiers in Genetics 1664-8021 Frontiers Media SA PMC12477005 PMC12477005.1 12477005 12477005 41031085 10.3389/fgene.2025.1615259 1615259 1 Genetics Original Research Characterization of the phenotype and function of PRELP + Dai et al. 10.3389/fgene.2025.1615259 Dai Yuting  1 Huang Xingying  2 Sun Min  3 Zhang Shiyu  4 Yu Weiqiang  5 Hu Kongwang  3 Wu Qiang  3 Wu Qingfa  1  2 *  1 Center for Advanced Interdisciplinary Science and Biomedicine of IHM, Division of Life Sciences and Medicine, University of Science and Technology of China Hefei Anhui China  2 Department of Pharmacy, The First Affiliated Hospital of USTC, Division of Life Sciences and Medicine, University of Science and Technology of China Hefei Anhui China  3 The First Affiliated Hospital of Anhui Medical University Hefei Anhui China  4 Department of Computer Science, University of Liverpool Liverpool United Kingdom  5 HIM-BGI Omics Center, Zhejiang Cancer Hospital, Hangzhou Institute of Medicine (HIM), Chinese Academy of Sciences (CAS) Hangzhou China  Edited by: Rui Qi Gao  Reviewed by: David Joel Agorku  Hui Zhao  Haikun Zhou  Ziyi Li *Correspondence: Qingfa Wu, wuqf@ustc.edu.cn 15 9 2025 2025 16 481198 1615259 21 4 2025 29 8 2025 15 09 2025 30 09 2025 02 10 2025 Copyright © 2025 Dai, Huang, Sun, Zhang, Yu, Hu, Wu and Wu. 2025 Dai, Huang, Sun, Zhang, Yu, Hu, Wu and Wu https://creativecommons.org/licenses/by/4.0/ This is an open-access article distributed under the terms of the Creative Commons Attribution License (CC BY). The use, distribution or reproduction in other forums is permitted, provided the original author(s) and the copyright owner(s) are credited and that the original publication in this journal is cited, in accordance with accepted academic practice. No use, distribution or reproduction is permitted which does not comply with these terms. Introduction Fibroblasts are critical mediators of tumor progression and metastasis; however, their heterogeneity and specific functions in the context of colorectal cancer (CRC) liver metastases remain incompletely understood. Methods We performed single-cell RNA sequencing (scRNA-seq) analysis on relevant tissue samples. Subsequently, we validated our findings using immunofluorescence assays on histological slides from primary CRC with liver metastasis (mCC) and liver metastatic tumors (mLC). Further investigations included transcriptomic profiling, pseudotime trajectory analysis, multiplex immunofluorescence staining, and cell-cell communication analysis. Results Our scRNA-seq analysis identified a distinct PRELP-positive cancer-associated fibroblast (CAF) subtype that is associated with liver metastasis and tumor progression. These PRELP+ CAFs were predominantly enriched in mLC, less abundant in mCC, and rare in non-metastatic CRC (nCC). This distribution was confirmed by immunofluorescence. Transcriptomically, PRELP+ CAFs exhibit a unique signature defined by extracellular matrix components (e.g., PRELP, COLEC11, ITGBL1) and the activation of pro-tumor pathways such as TGF-β and Wnt signaling. Pseudotime analysis indicated they represent a terminal fibroblast differentiation state. Spatially, they colocalize with immune cells (T cells, B cells, plasma cells), and communication analysis suggests they foster an immunosuppressive microenvironment via APP-CD74 and collagen-CD44 signaling, thereby promoting immune evasion. The transcription factors NR2F2, JUN, and JUND were identified as key regulators of this CAF subtype. Discussion These findings provide crucial new insights into fibroblast heterogeneity within CRC liver metastases. We characterize PRELP+ CAFs as a specialized, terminally differentiated fibroblast population that contributes to immunosuppression and tumor progression, highlighting them as a potential therapeutic target for inhibiting metastatic advancement. colorectal cancer liver metastasis single-cell RNA-seq cancer-associated fibroblasts PRELP + immunosuppressive TME The author(s) declare that financial support was received for the research and/or publication of this article. This research was funded by the Research Funds of Center for Advanced Interdisciplinary Science and Biomedicine of IHM (Grant No. HFDJK-202212-15). pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement yes pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes section-at-acceptance Cancer Genetics and Oncogenomics 1 Introduction Fibroblasts are a crucial component of the tumor microenvironment (TME), playing a significant role in cancer progression. Tumor-derived stimuli, including transforming growth factor β (TGF-β), fibroblast growth factor (FGF), platelet-derived growth factor (PDGF), and interleukins, drive the differentiation of normal fibroblasts into cancer-associated fibroblasts (CAFs) ( Park et al., 2020 Chen and Song, 2019 Sahai et al., 2020 Li et al., 2021 Qin et al., 2018 Wei et al., 2018 Landskron et al., 2019 Tan et al., 2020 Song et al., 2021 Kobayashi et al., 2019 Liu et al., 2019 Menezes et al., 2022 Chen et al., 2021 Colorectal cancer (CRC) is the second most common malignant tumor worldwide, with liver metastasis being the most common and lethal form of distant spread ( Hackl et al., 2014 Bray et al., 2024 Manfredi et al., 2006 Zhang et al., 2020 Che et al., 2021 Guo et al., 2022 Li et al., 2023 Liu et al., 2017 Che et al., 2021 + Wang et al., 2023 In this study, we performed a comprehensive scRNA-seq analysis and identified the population of PRELP + + + + + + 2 Materials and methods 2.1 Data sources Six publicly available single-cell transcriptomics datasets of colorectal cancer were obtained from Gene Expression Omnibus (GEO, https://www.ncbi.nlm.nih.gov/geo/ GSE205506 Li et al., 2023 GSE178318 Che et al., 2021 GSE188711 Guo et al., 2022 GSE225857 Wang et al., 2023 GSE144735 Lee et al., 2020 GSE158692 Giguelay et al., 2022 GPL24676 Homo sapiens Supplementary Table S1 GSE197177 GSE156337 2.2 scRNA-seq data quality control and cell-type annotation A comprehensive analysis and visualization of single-cell transcriptomics data were conducted using the R package Seurat (version 4.4.0) ( Hao et al., 2021 Korsunsky et al., 2019 Germain et al., 2022 CD30 NKG7 CD79A MS4A1 CD79A JCHAIN LYZ PECAM1 COL1A1 EPCAM KRT8 MKI67 TPSB2 To further resolve fibroblast-related subpopulations, a second round of UMAP clustering was conducted. The fibroblast cells were clustered in the 0.5 resolution. Subclusters were identified based on differentially expressed genes using the FindAllMarkers function in Seurat, with cell type annotations assigned according to the most highly expressed genes in each cluster. Among fibroblast-related subpopulations, some clusters encompassed other stromal cell types in addition to fibroblasts. Fibroblasts were distinguished using the markers DCN LUM RGS5 RERGL MYH11 GPM6B STMN1 Du et al., 2024 Gao et al., 2024 2.3 Identification and functional annotation of differentially expressed genes The FindMarkers function was employed to identify differentially expressed genes (DEGs), and the top 10 DEGs ranked by log 2 Yu et al., 2012 Hänzelmann et al., 2013 2.4 Tissue distribution of fibroblast subclusters The distribution of fibroblast subsets across various tissues was analyzed using the ratio of observed to expected cell numbers (Ro/e) ( Zhang et al., 2018 2.5 Pseudotime analysis Monocle2 (v2.28.0) ( Qiu et al., 2017 −4 2.6 Cell cycle scoring Cell cycle phase assignment was performed using the CellCycleScoring function in Seurat (v4.3.0) with the updated human cell cycle gene sets (cc.genes.updated.2019). For each cell, S phase scores were calculated as the average normalized expression of the corresponding gene sets, subtracted by the average expression of the remaining genes. 2.7 Cell-cell communication analysis Cell-cell communication analysis was conducted using the CellChat (v1.6.0) software to model the intercellular pathway network in colorectal cancer. Standardized single-cell data were used as input, incorporating prior knowledge of interacting ligands, receptors, and auxiliary factors for modeling. The interactions between fibroblast subgroups and other cell populations, such as immune cells and epithelial cells, were focused on, with specific emphasis on the expression patterns of ligand-receptor combinations across these cell types. The significance of interactions was calculated using permutation tests. The CellChatDB.human database was employed by loading the “Secreted Signaling Pathways” to infer the cell-cell communication network. The analysis followed the procedures outlined on the CellChat official website ( Jin et al., 2021 2.8 Survival analysis The public gene expression data and detailed clinical information were obtained from USUC Xena ( https://xena.ucsc.edu/ 2.9 Transcription factor prediction The single-cell regulatory network inference and clustering (SCENIC) package (v1.1.2.1) ( Aibar et al., 2017 https://bio.liclab.net/KnockTFv2/index.php + 2.10 Immunofluorescence assays The formalin-fixed paraffin-embedded (FFPE) tissue sections of colorectal cancer and its liver metastasis sites were collected from the Pathology Department of the First Affiliated Hospital of Anhui Medical University. The PRELP + 3 Results 3.1 Identification of the PRELP + To investigate fibroblast heterogeneity in primary CRC and liver metastases, we retrieved all relevant single-cell RNA sequencing (scRNA-seq) data from public databases ( Lee et al., 2020 Che et al., 2021 Giguelay et al., 2022 Guo et al., 2022 Li et al., 2023 Wang et al., 2023 Figure 1a Supplementary Table S1 Supplementary Table S1 Figure 1a Supplementary Figure S1a FIGURE 1 Characterization of cells types in metastatic and non-metastatic colorectal cancer. (a) (b) (c) (d) Panel a shows a table listing datasets with cell counts for different cell types and references. Panel b includes a UMAP plot displaying clusters of various cell types, such as TNK, B, and plasma cells, with color coding and cell counts. Panel c contains two UMAP plots comparing fibroblast and other cell populations in normal versus tumor samples. Panel d features a heatmap representing the expression levels of different fibroblast types across colon normal, colon tumor, and liver tumor samples, with varying intensities indicating expression levels. After quality control and batch effect correction, a total of 440,592 cells were retained for clustering, identifying nine major clusters. The cell types included 75.1% immune cells (47.9% TNK cells, 6.7% B cells, 10.8% plasma cells, and 9.7% myeloid cells), 11.6% epithelial cells, and 7.2% fibroblasts ( Figure 1b Supplementary Figure S1c Supplementary Table S2 Supplementary Figure S1b To further investigate the heterogeneity of fibroblasts, we retrieved 31,904 cells from the fibroblast clusters expressing the COL1A1 marker gene and subjected them to additional clustering, resulting in 12 subgroups. Based on marker gene expression, three subgroups were identified as non-fibroblast cells, including glial cells, pericytes (PCs), and smooth muscle cells (SMCs), while the remaining nine subgroups were classified as distinct fibroblast populations ( Figure 1c Supplementary Figure S1d Supplementary Table S3 + + + + + + + Figure 1c MYH11 RERGL MYH11 Grout et al., 2022 Lin et al., 2025 + ADAMDEC1 ADAM28 Jasso et al., 2022 Figure 1d + Figure 1d Supplementary Figure S1e,f Supplementary Table S4 Supplementary Figure S1f Supplementary Table S8 3.2 Distinct molecular characteristics and metastasis-promoting role of PRELP + The top 10 upregulated genes from each fibroblast subtype were considered marker genes, and these marker genes exhibited subtype-specific expression patterns ( Figure 2a + Jasso et al., 2022 + Du et al., 2024 + Peng et al., 2022 Peng et al., 2023 + Du et al., 2024 + + FIGURE 2 Molecular characteristics and metastasis-promoting role of PRELP + (a) (b) + (a) (c) + + (d) + (e) + Heatmaps and box plots display gene expression patterns and marker genes for various fibroblast types. The first heatmap (a) groups marker genes by expression patterns. The second heatmap (b) shows gene set variation analysis (GSVA) scores for pathways. Box plots (c) compare proportions of fibroblast subtypes across cancer types. Panels (d) contain immunofluorescence images of DNA, COL1A1, and PRELP at colon and liver tumor sites. The Kaplan-Meier curve (e) shows survival probabilities for patients with high and low PRELP+ CAFs expression, with a significance value of p = 0.0095. Prolargin (proline/arginine-rich terminal-rich leucine repeat protein), encoded by PRELP Lewis, 2003 Chen et al., 2015 Hong et al., 2020 Dozen et al., 2022 Gui et al., 2024 + Figure 2a Figure 2b Supplementary Figure S2a + + Figure 2a Supplementary Figure S2b + Figure 2b + + Supplementary Figure S3 Distinct fibroblast distributions were observed across tumor sites. ADAMDEC1 + + Figure 2c Supplementary Figure S2c + Figure 2c + + Figure 2d + + + Figure 2e + To further investigate whether CAFs resembling PRELP + Sharma et al., 2020 Zhang et al., 2023 + GSE197177 GSE156337 + COLEC11 PRELP COL10A1 Supplementary Figure S4a,b,e + Supplementary Figure S4c + Supplementary Figure S4g + + Supplementary Figure S4d,f + 3.3 PRELP + To investigate the phylogenetic relationships among fibroblast subtypes, we performed pseudotime trajectory analysis using Monocle2, revealing their developmental trajectories. The analysis results for all sample groups indicated a complex differentiation pathway, where fibroblasts transition from initial progenitor-like stages into three distinct terminal states: nCC state, mCC state, and mLC state, as determined by the proportional distribution of fibroblast subtypes across sample groups ( Figure 3a Supplementary Figure S5a-c + + + Figure 3a + + + + Figure 3a Supplementary Figure S5a,b FIGURE 3 PRELP + (a) (b) Two visualizations are shown. (a) Two t-SNE plots displaying cellular states of fibroblasts: mCC, nCC, and mLC, with cells colored by fibroblast subtype and pseudotime. (b) A heatmap and KEGG enrichment analysis showing gene expression patterns across different fibroblast states: mCC, pre-branch, and mLC, highlighting gene names and enriched pathways. Additionally, we examined the expression of proliferative genes across all subpopulations and conducted cell cycle analysis, which further corroborated the pseudotime trajectory results. With the exception of Proliferating Fibro, none of the other subpopulations exhibited high expression of proliferative genes ( Supplementary Figure S6a + + + Supplementary Figure S6b + Supplementary Figure S6c To elucidate the molecular mechanisms underlying these transitions, we identified DEGs along the pseudotime trajectory. These DEGs were clustered into three distinct expression patterns corresponding to the initial developmental stage (pre-branch), mCC state, and mLC state ( Figure 3b Figure 3b Figure 3b Leiphrakpam and Are, 2024 Efe et al., 2024 + 3.4 PRELP + CAFs contribute to tumor progression by interacting with immune cells through cytokines, chemokines, metabolites, and exosomes ( Li et al., 2021 + + Figure 4a + + Supplementary Figure S7a Supplementary Tables S5–S7 FIGURE 4 PRELP + (a) (b) (c) + (d) + (e) (f) Composite figure with multiple panels. Panel (a) shows immunofluorescence images of liver tumor sites with DNA in blue, αSMA, CD3, CD20, or CD138 in red, and PRELP in green. Merged images highlight cell types in proximity to PRELP.Panel (b) is a scatter plot showing interaction strength of various cell types, using color coding for different cell groups.Panel (c) is a dot plot displaying expression interactions between PRELP+ CAFs and various immune cells, with dot sizes indicating significance.Panel (d) shows expression interactions of LGALS9 and NECTIN2 with immune cell markers.Panel (e) presents network diagrams indicating SEMA7A interaction paths between different cell types.Panel (f) highlights SEMA4 signaling pathways interactions. Cellular communication analysis showed that PRELP + Figure 4b Pandey et al., 2016 Chen et al., 2024 Yang et al., 2025 + Chen et al., 2024 Cheung et al., 2025 Figure 4c Among the 12 TNK cell subsets, PRELP + + + + Supplementary Figure S7b + + Peng et al., 2024 Figure 4d Supplementary Figure S7c + Ho et al., 2021 + + Figure 4d Supplementary Figure S7c Riquelme et al., 2018 Agorku et al., 2024 Stary et al., 2024 + + + Gharibi et al., 2017 Figure 4e + + Figure 4f Supplementary Figure S7d + 3.5 Identification of transcription factors driving molecular identity and functional specialization of PRELP + As PRELP + + Figure 5a Supplementary Figure S7e + Figure 5b Wang et al., 2015 Wang et al., 2017 + + PRELP COLEC11 ITGBL1 LTBP2 Figure 5C + Supplementary Figure S7f + FIGURE 5 The transcription factors active in PRELP + (a) + (b) + (c) + Diagram showing three panels. Panel a displays a line chart ranking gene sets in PRELP+ CAFs, with NR2F2_extended having the highest RSS value. Panel b consists of three scatter plots illustrating the expression levels of NR2F2, JUN, and JUND targets, scaled from minimum to maximum. The final plot shows cell type distributions, including Myo Fibro, Proliferating Fibro, and various CAFs identified by colors. Panel c presents a network diagram with NR2F2 as the central node, linked to eight genes: PRELP, COL3A1, LTBP2, COLEC11, ITGB1L, COL6A3, CYP1B1, and COL10A1. In addition to NR2F2, the transcription factors JUN (encoding c-JUN) and JUND, members of the AP-1 transcription factor complex, exhibited significant transcriptional activity in PRELP + Figure 5b Eferl and Wagner, 2003 + APP APP Davis, 2015 NECTIN2 Lui et al., 2006 Selnø et al., 2020 Together, these findings highlight the intrinsic regulatory mechanisms underlying the diverse functions of PRELP + 4 Discussion In this study, we conducted a comprehensive scRNA-seq analysis to explore the fibroblast populations within the TME of CRCLM. We identified a specific population of PRELP + + + + CAF subpopulations identified in our study exhibit both conserved and distinct features when compared to previously defined subtypes. ADAMDEC1 + Jasso et al., 2022 + + Du et al., 2024 + + + Peng et al., 2022 Du et al., 2024 + + Roumenina et al., 2019 Yang et al., 2024 + Consistent with their role in remodeling the TME, PRELP + PRELP COLEC11 COL10A1 ITGBL1 Syed, 2016 Zhan et al., 2017 + Kalluri, 2016 Yang et al., 2023 The terminally differentiated and functionally specialized state of PRELP + Baglieri et al., 2019 Ramachandran et al., 2019 Giguelay et al., 2022 + + Irrespective of their origin, PRELP + + + Li et al., 2021 Pei et al., 2023 + + Faassen et al., 1992 Ishii et al., 1993 Knutson et al., 1996 Matsuda et al., 2009 Ma et al., 2024 Chen et al., 2018 Yuan et al., 2023 Fuller et al., 2024 Yang et al., 2025 The immunosuppressive function of PRELP + CAFs may be driven by members of the JUN family of transcription factors, including JUN and JUND, by regulating the expression of key immune-related molecules. Given their pivotal role in promoting metastasis and immune evasion, targeting PRELP + + At the same time, it should be acknowledged that our study is based on retrospective analyses of public datasets and a limited set of tissue samples. Although immunofluorescence staining provided preliminary validation of key results, several limitations remain. First, while the association between PRELP + + Data availability statement Publicly available datasets were analyzed in this study. The datasets can be found in Gene Expression Omnibus (GEO, https://www.ncbi.nlm.nih.gov/geo/ GSE205506 Li et al., 2023 GSE178318 Che et al., 2021 GSE188711 Guo et al., 2022 GSE225857 Wang et al., 2023 GSE144735 Lee et al., 2020 GSE158692 Giguelay et al., 2022 Ethics statement The studies involving humans were approved by The Institutional Review Board (or Ethics Committee) of the First Affiliated Hospital of Anhui Medical University (number: KY2023054). The studies were conducted in accordance with the local legislation and institutional requirements. The human samples used in this study were acquired from primarily isolated as part of your previous study for which ethical approval was obtained. Written informed consent for participation was not required from the participants or the participants; legal guardians/next of kin in accordance with the national legislation and institutional requirements. Written informed consent was obtained from the individual(s) for the publication of any potentially identifiable images or data included in this article. Author contributions YD: Writing – original draft, Formal Analysis, Visualization, Methodology, Data curation, Validation, Investigation, Software, Resources, Conceptualization. XH: Methodology, Validation, Investigation, Writing – review and editing. MS: Resources, Validation, Writing – review and editing, Methodology. SZ: Methodology, Writing – review and editing. WY: Writing – review and editing, Investigation, Methodology. KH: Writing – review and editing, Resources, Methodology. QaW: Writing – review and editing, Methodology, Resources. QnW: Project administration, Conceptualization, Methodology, Writing – review and editing, Supervision, Funding acquisition. Conflict of interest The authors declare that the research was conducted in the absence of any commercial or financial relationships that could be construed as a potential conflict of interest. Generative AI statement The author(s) declare that no Generative AI was used in the creation of this manuscript. Any alternative text (alt text) provided alongside figures in this article has been generated by Frontiers with the support of artificial intelligence and reasonable efforts have been made to ensure accuracy, including review by the authors wherever possible. If you identify any issues, please contact us. Publisher’s note All claims expressed in this article are solely those of the authors and do not necessarily represent those of their affiliated organizations, or those of the publisher, the editors and the reviewers. Any product that may be evaluated in this article, or claim that may be made by its manufacturer, is not guaranteed or endorsed by the publisher. Supplementary material The Supplementary Material for this article can be found online at: https://www.frontiersin.org/articles/10.3389/fgene.2025.1615259/full#supplementary-material References Agorku D. J. Bosio A. Alves F. Ströbel P. Hardt O. 2024 Colorectal cancer-associated fibroblasts inhibit effector T cells via NECTIN2 signaling Cancer Lett. 595 216985 10.1016/j.canlet.2024.216985 38821255 Aibar S. González-Blas C. B. Moerman T. Huynh-Thu V. A. Imrichova H. Hulselmans G. 2017 SCENIC: single-cell regulatory network inference and clustering Nat. Methods 14 11 1083 1086 10.1038/nmeth.4463 28991892 PMC5937676 Baglieri J. Brenner D. A. Kisseleva T. 2019 The role of fibrosis and liver-associated fibroblasts in the pathogenesis of hepatocellular carcinoma Int. J. Mol. Sci. 20 7 1723 10.3390/ijms20071723 30959975 PMC6479943 Bray F. Laversanne M. Sung H. Ferlay J. Siegel R. L. Soerjomataram I. 2024 Global cancer statistics 2022: GLOBOCAN estimates of incidence and mortality worldwide for 36 cancers in 185 countries CA Cancer J. Clin. 74 3 229 263 10.3322/caac.21834 38572751 Che L. Liu J.-W. Huo J.-P. Luo R. Xu R.-M. He C. 2021 A single-cell atlas of liver metastases of colorectal cancer reveals reprogramming of the tumor microenvironment in response to preoperative chemotherapy Cell Discov. 7 1 80 NA 10.1038/s41421-021-00312-y 34489408 PMC8421363 Chen X. Song E. 2019 Turning foes to friends: targeting cancer-associated fibroblasts Nat. Rev. Drug Discov. 18 2 99 115 10.1038/s41573-018-0004-1 30470818 Chen R. Dawson D. W. Pan S. Ottenhof N. A. de Wilde R. F. Wolfgang C. L. 2015 Proteins associated with pancreatic cancer survival in patients with resectable pancreatic ductal adenocarcinoma Lab. Invest 95 1 43 55 10.1038/labinvest.2014.128 25347153 PMC4281293 Chen C. Zhao S. Karnad A. Freeman J. W. 2018 The biology and role of CD44 in cancer progression: therapeutic implications J. Hematol. and Oncol. 11 1 64 10.1186/s13045-018-0605-5 29747682 PMC5946470 Chen Y. McAndrews K. M. Kalluri R. 2021 Clinical and therapeutic relevance of cancer-associated fibroblasts Nat. Rev. Clin. Oncol. 18 12 792 804 10.1038/s41571-021-00546-5 34489603 PMC8791784 Chen G. Wang W. Wei X. Chen Y. Peng L. Qu R. 2024 Single-cell transcriptomic analysis reveals that the APP-CD74 axis promotes immunosuppression and progression of testicular tumors J. Pathol. 264 3 250 269 10.1002/path.6343 39161125 Cheung B. C. H. Chen X. Davis H. J. Nordmann C. S. Toth J. Hodgson L. 2025 Identification of CD44 as a key engager to hyaluronic acid-rich extracellular matrices for cell traction force generation and tumor invasion in 3D Matrix Biol. 135 1 11 10.1016/j.matbio.2024.11.004 39528207 PMC11729355 Davis W. Jr. 2015 The ATP-binding Cassette transporter-2 (ABCA2) Overexpression modulates Sphingosine levels and transcription of the amyloid precursor protein (APP) gene Curr. Alzheimer Res. 12 9 847 859 10.2174/156720501209151019105834 26510981 PMC4630823 Dozen A. Shozu K. Shinkai N. Ikawa N. Aoyama R. Machino H. 2022 Tumor suppressive role of the PRELP gene in Ovarian clear cell carcinoma J. Pers. Med. 12 12 1999 10.3390/jpm12121999 36556220 PMC9785654 Du Y. Shi J. Wang J. Xun Z. Yu Z. Sun H. 2024 Integration of pan-cancer single-cell and spatial transcriptomics reveals stromal cell features and therapeutic targets in tumor microenvironment Cancer Res. 84 2 192 210 10.1158/0008-5472.CAN-23-1418 38225927 Efe G. Rustgi A. K. Prives C. 2024 p53 at the crossroads of tumor immunity Nat. Cancer 5 7 983 995 10.1038/s43018-024-00796-z 39009816 Eferl R. Wagner E. F. 2003 AP-1: a double-edged sword in tumorigenesis Nat. Rev. Cancer 3 11 859 868 10.1038/nrc1209 14668816 Faassen A. E. Schrager J. A. Klein D. J. Oegema T. R. Couchman J. R. McCarthy J. B. 1992 A cell surface chondroitin sulfate proteoglycan, immunologically related to CD44, is involved in type I collagen-mediated melanoma cell motility and invasion J. Cell Biol. 116 2 521 531 10.1083/jcb.116.2.521 1730766 PMC2289300 Fuller A. M. Pruitt H. C. Liu Y. Irizarry-Negron V. M. Pan H. Song H. 2024 Oncogene-induced matrix reorganization controls CD8+ T cell function in the soft-tissue sarcoma microenvironment J. Clin. Invest 134 11 e167826 10.1172/JCI167826 38652549 PMC11142734 Gao Y. Li J. Cheng W. Diao T. Liu H. Bo Y. 2024 Cross-tissue human fibroblast atlas reveals myofibroblast subtypes with distinct roles in immune modulation Cancer Cell 42 10 1764 1783.e10 10.1016/j.ccell.2024.08.020 39303725 Germain P. Lun A. Garcia Meixide C. Macnair W. Robinson M. 2022 Doublet identification in single-cell sequencing data using scDblFinder [version 2; peer review: 2 approved] F1000Research 10 979 979 10.12688/f1000research.73600.2 35814628 PMC9204188 Gharibi A. La Kim S. Molnar J. Brambilla D. Adamian Y. Hoover M. 2017 ITGA1 is a pre-malignant biomarker that promotes therapy resistance and metastatic potential in pancreatic cancer Sci. Rep. 7 1 10060 10.1038/s41598-017-09946-z 28855593 PMC5577248 Giguelay A. Turtoi E. Khelaf L. Tosato G. Dadi I. Chastel T. 2022 The landscape of cancer-associated fibroblasts in colorectal cancer liver metastases Theranostics 12 17 7624 7639 10.7150/thno.72853 36438498 PMC9691344 Grout J. A. Sirven P. Leader A. M. Maskey S. Hector E. Puisieux I. 2022 Spatial positioning and matrix programs of cancer-associated fibroblasts promote T-cell exclusion in human Lung tumors Cancer Discov. 12 11 2606 2625 10.1158/2159-8290.CD-21-1714 36027053 PMC9633420 Gui Y. Deng X. Li N. Zhao L. 2024 PRELP reduce cell stiffness and adhesion to promote the growth and metastasis of colorectal cancer cells by binding to integrin α5 Exp. Cell Res. 441 1 114151 10.1016/j.yexcr.2024.114151 38992455 Guo W. Zhang C. Wang X. Dou D. Chen D. Li J. 2022 Resolving the difference between left-sided and right-sided colorectal cancer by single-cell sequencing JCI Insight 7 1 e152616 10.1172/jci.insight.152616 34793335 PMC8765049 Hackl C. Neumann P. Gerken M. Loss M. Klinkhammer-Schalke M. Schlitt H. J. 2014 Treatment of colorectal liver metastases in Germany: a ten-year population-based analysis of 5772 cases of primary colorectal adenocarcinoma BMC Cancer 14 810 10.1186/1471-2407-14-810 25369977 PMC4230526 Hänzelmann S. Castelo R. Guinney J. 2013 GSVA: gene set variation analysis for microarray and RNA-seq data BMC Bioinforma. 14 7 10.1186/1471-2105-14-7 23323831 PMC3618321 Hao Y. Hao S. Andersen-Nissen E. Mauck W. M. 3rd Zheng S. Butler A. 2021 Integrated analysis of multimodal single-cell data Cell 184 13 3573 3587.e29 10.1016/j.cell.2021.04.048 34062119 PMC8238499 Ho D. W.-H. Tsui Y.-M. Chan L.-K. Sze K. M.-F. Zhang X. Cheu J. W.-S. 2021 Single-cell RNA sequencing shows the immunosuppressive landscape and tumor heterogeneity of HBV-associated hepatocellular carcinoma Nat. Commun. 12 1 3684 10.1038/s41467-021-24010-1 34140495 PMC8211687 Hong R. Gu J. Niu G. Hu Z. Zhang X. Song T. 2020 PRELP has prognostic value and regulates cell proliferation and migration in hepatocellular carcinoma J. Cancer 11 21 6376 6389 10.7150/jca.46309 33033521 PMC7532499 Ishii S. Ford R. Thomas P. Nachman A. Steele G. Jr. Jessup J. M. 1993 CD44 participates in the adhesion of human colorectal carcinoma cells to laminin and type IV collagen Surg. Oncol. 2 4 255 264 10.1016/0960-7404(93)90015-q 7504563 Jasso G. J. Jaiswal A. Varma M. Laszewski T. Grauel A. Omar A. 2022 Colon stroma mediates an inflammation-driven fibroblastic response controlling matrix remodeling and healing PLoS Biol. 20 1 e3001532 10.1371/journal.pbio.3001532 35085231 PMC8824371 Jin S. Guerrero-Juarez C. F. Zhang L. Chang I. Ramos R. Kuan C. H. 2021 Inference and analysis of cell-cell communication using CellChat Nat. Commun. 12 1 1088 10.1038/s41467-021-21246-9 33597522 PMC7889871 Kalluri R. 2016 The biology and function of fibroblasts in cancer Nat. Rev. Cancer 16 9 582 598 10.1038/nrc.2016.73 27550820 Knutson J. R. Iida J. Fields G. B. McCarthy J. B. 1996 CD44/chondroitin sulfate proteoglycan and alpha 2 beta 1 integrin mediate human melanoma cell migration on type IV collagen and invasion of basement membranes Mol. Biol. Cell 7 3 383 396 10.1091/mbc.7.3.383 8868467 PMC275891 Kobayashi H. Enomoto A. Woods S. L. Burt A. D. Takahashi M. Worthley D. L. 2019 Cancer-associated fibroblasts in gastrointestinal cancer Nat. Rev. Gastroenterol. Hepatol. 16 5 282 295 10.1038/s41575-019-0115-0 30778141 Korsunsky I. Millard N. Fan J. Slowikowski K. Zhang F. Wei K. 2019 Fast, sensitive and accurate integration of single-cell data with Harmony Nat. Methods 16 12 1289 1296 10.1038/s41592-019-0619-0 31740819 PMC6884693 Landskron G. De la Fuente Lopez M. Dubois-Camacho K. Diaz-Jimenez D. Orellana-Serradell O. Romero D. 2019 Interleukin 33/ST2 Axis components are associated to Desmoplasia, a metastasis-related factor in colorectal cancer Front. Immunol. 10 1394 10.3389/fimmu.2019.01394 31281317 PMC6598075 Lee H.-O. Hong Y. Etlioglu H. E. Cho Y. B. Pomella V. Van den Bosch B. 2020 Lineage-dependent gene expression programs influence the immune landscape of colorectal cancer Nat. Genet. 52 6 594 603 10.1038/s41588-020-0636-z 32451460 Leiphrakpam P. D. Are C. 2024 PI3K/Akt/mTOR signaling pathway as a target for colorectal cancer treatment Int. J. Mol. Sci. 25 6 3178 10.3390/ijms25063178 38542151 PMC10970097 Lewis M. 2003 PRELP, collagen, and a theory of Hutchinson-Gilford progeria Ageing Res. Rev. 2 1 95 105 10.1016/s1568-1637(02)00044-2 12437997 Li C. Teixeira A. F. Zhu H.-J. ten Dijke P. 2021 Cancer associated-fibroblast-derived exosomes in cancer progression Mol. Cancer 20 1 154 10.1186/s12943-021-01463-y 34852849 PMC8638446 Li J. Wu C. Hu H. Qin G. Wu X. Bai F. 2023 Remodeling of the immune and stromal cell compartment by PD-1 blockade in mismatch repair-deficient colorectal cancer Cancer Cell 41 6 1152 1169.e7 10.1016/j.ccell.2023.04.011 37172580 Lin Z. Zhou Y. Liu Z. Nie W. Cao H. Li S. 2025 Deciphering the tumor immune microenvironment: single-cell and spatial transcriptomic insights into cervical cancer fibroblasts J. Exp. and Clin. Cancer Res. 44 1 194 10.1186/s13046-025-03432-5 40616092 PMC12228347 Liu Q. Zhang H. Jiang X. Qian C. Liu Z. Luo D. 2017 Factors involved in cancer metastasis: a better understanding to seed and soil hypothesis Mol. Cancer 16 1 176 10.1186/s12943-017-0742-4 29197379 PMC5712107 Liu T. Han C. Wang S. Fang P. Ma Z. Xu L. 2019 Cancer-associated fibroblasts: an emerging target of anti-cancer immunotherapy J. Hematol. Oncol. 12 1 86 10.1186/s13045-019-0770-1 31462327 PMC6714445 Lui W.-Y. Sze K.-L. Lee W. M. 2006 Nectin-2 expression in testicular cells is controlled via the functional cooperation between transcription factors of the Sp1, CREB, and AP-1 families J. Cell. Physiology 207 1 144 157 10.1002/jcp.20545 16250013 Ma C. Chen J. Ji J. Zheng Y. Liu Y. Wang J. 2024 Therapeutic modulation of APP-CD74 axis can activate phagocytosis of TAMs in GBM Biochim. Biophys. Acta Mol. Basis Dis. 1870 8 167449 10.1016/j.bbadis.2024.167449 39111632 Manfredi S. Lepage C. Hatem C. Coatmeur O. Faivre J. Bouvier A. M. 2006 Epidemiology and management of liver metastases from colorectal cancer Ann. Surg. 244 2 254 259 10.1097/01.sla.0000217629.94941.cf 16858188 PMC1602156 Matsuda S. Matsuda Y. D'Adamio L. 2009 CD74 interacts with APP and suppresses the production of Abeta Mol. Neurodegener. 4 41 10.1186/1750-1326-4-41 19849849 PMC2770512 Menezes S. Okail M. H. Jalil S. M. A. Kocher H. M. Cameron A. J. M. 2022 Cancer-associated fibroblasts in pancreatic cancer: new subtypes, new markers, new targets J. Pathol. 257 4 526 544 10.1002/path.5926 35533046 PMC9327514 Pandey P. Sliker B. Peters H. L. Tuli A. Herskovitz J. Smits K. 2016 Amyloid precursor protein and amyloid precursor-like protein 2 in cancer Oncotarget 7 15 19430 19444 10.18632/oncotarget.7103 26840089 PMC4991393 Park D. Sahai E. Rullan A. 2020 SnapShot: cancer-associated fibroblasts Cell 181 2 486 486 e481 10.1016/j.cell.2020.03.013 32302576 Pei L. Liu Y. Liu L. Gao S. Gao X. Feng Y. 2023 Roles of cancer-associated fibroblasts (CAFs) in anti- PD-1/PD-L1 immunotherapy for solid cancers Mol. Cancer 22 1 29 10.1186/s12943-023-01731-z 36759842 PMC9912573 Peng Z. Ye M. Ding H. Feng Z. Hu K. 2022 Spatial transcriptomics atlas reveals the crosstalk between cancer-associated fibroblasts and tumor microenvironment components in colorectal cancer J. Transl. Med. 20 1 302 10.1186/s12967-022-03510-8 35794563 PMC9258101 Peng Z. Ren Z. Tong Z. Zhu Y. Zhu Y. Hu K. 2023 Interactions between MFAP5 + fibroblasts and tumor-infiltrating myeloid cells shape the malignant microenvironment of colorectal cancer J. Transl. Med. 21 1 405 10.1186/s12967-023-04281-6 37344903 PMC10286363 Peng H. Jiang L. Yuan J. Wu X. Chen N. Liu D. 2024 Single-cell characterization of differentiation trajectories and drug resistance features in gastric cancer with peritoneal metastasis Clin. Transl. Med. 14 10 e70054 10.1002/ctm2.70054 39422697 PMC11488346 Qin X. Yan M. Wang X. Xu Q. Wang X. Zhu X. 2018 Cancer-associated fibroblast-derived IL-6 promotes Head and Neck cancer progression via the Osteopontin-NF-kappa B signaling pathway Theranostics 8 4 921 940 10.7150/thno.22182 29463991 PMC5817102 Qiu X. Mao Q. Tang Y. Wang L. Chawla R. Pliner H. A. 2017 Reversed graph embedding resolves complex single-cell trajectories Nat. Methods 14 10 979 982 10.1038/nmeth.4402 28825705 PMC5764547 Ramachandran P. Dobie R. Wilson-Kanamori J. R. Dora E. F. Henderson B. E. P. Luu N. T. 2019 Resolving the fibrotic niche of human liver cirrhosis at single-cell level Nature 575 7783 512 518 10.1038/s41586-019-1631-3 31597160 PMC6876711 Riquelme P. Haarer J. Kammler A. Walter L. Tomiuk S. Ahrens N. 2018 TIGIT+ iTregs elicited by human regulatory macrophages control T cell immunity Nat. Commun. 9 1 2858 10.1038/s41467-018-05167-8 30030423 PMC6054648 Roumenina L. T. Daugan M. V. Petitprez F. Sautès-Fridman C. Fridman W. H. 2019 Context-dependent roles of complement in cancer Nat. Rev. Cancer 19 12 698 715 10.1038/s41568-019-0210-0 31666715 Sahai E. Astsaturov I. Cukierman E. DeNardo D. G. Egeblad M. Evans R. M. 2020 A framework for advancing our understanding of cancer-associated fibroblasts Nat. Rev. Cancer 20 3 174 186 10.1038/s41568-019-0238-1 31980749 PMC7046529 Selnø A. T. H. Schlichtner S. Yasinska I. M. Sakhnevych S. S. Fiedler W. Wellbrock J. 2020 Transforming growth factor beta type 1 (TGF-β) and hypoxia-inducible factor 1 (HIF-1) transcription complex as master regulators of the immunosuppressive protein galectin-9 expression in human cancer and embryonic cells Aging (Albany NY) 12 23 23478 23496 10.18632/aging.202343 33295886 PMC7762483 Sharma A. Seow J. J. W. Dutertre C. A. Pai R. Blériot C. Mishra A. 2020 Onco-fetal reprogramming of endothelial cells drives immunosuppressive macrophages in hepatocellular carcinoma Cell 183 2 377 394 10.1016/j.cell.2020.08.040 32976798 Song M. He J. Pan Q. Z. Yang J. Zhao J. Zhang Y. J. 2021 Cancer-associated fibroblast-mediated cellular crosstalk supports hepatocellular carcinoma progression Hepatology 73 5 1717 1735 10.1002/hep.31792 33682185 Stary V. Pandey R. V. List J. Kleissl L. Deckert F. Kabiljo J. 2024 Dysfunctional tumor-infiltrating Vδ1 + T lymphocytes in microsatellite-stable colorectal cancer Nat. Commun. 15 1 6949 10.1038/s41467-024-51025-1 39138181 PMC11322529 Syed V. 2016 TGF-Β signaling in cancer J. Cell Biochem. 117 6 1279 1287 10.1002/jcb.25496 26774024 Tan H. X. Gong W. Z. Zhou K. Xiao Z. G. Hou F. T. Huang T. 2020 CXCR4/TGF-β1 mediated hepatic stellate cells differentiation into carcinoma-associated fibroblasts and promoted liver metastasis of colon cancer Cancer Biol. Ther. 21 3 258 268 10.1080/15384047.2019.1685157 31825725 PMC7012097 Wang C. Zhou Y. Ruan R. Zheng M. Han W. Liao L. 2015 High expression of COUP-TF II cooperated with negative Smad4 expression predicts poor prognosis in patients with colorectal cancer Int. J. Clin. Exp. Pathol. 8 6 7112 7121 26261604 PMC4525938 Wang H. Nie L. Wu L. Liu Q. Guo X. 2017 NR2F2 inhibits Smad7 expression and promotes TGF-β-dependent epithelial-mesenchymal transition of CRC via transactivation of miR-21 Biochem. Biophysical Res. Commun. 485 1 181 188 10.1016/j.bbrc.2017.02.049 28192117 Wang F. Long J. Li L. Wu Z.-X. Da T.-T. Wang X.-Q. 2023 Single-cell and spatial transcriptome analysis reveals the cellular heterogeneity of liver metastatic colorectal cancer Sci. Adv. 9 24 eadf5464 10.1126/sciadv.adf5464 37327339 PMC10275599 Wei L. Ye H. Li G. Lu Y. Zhou Q. Zheng S. 2018 Cancer-associated fibroblasts promote progression and gemcitabine resistance via the SDF-1/SATB-1 pathway in pancreatic cancer Cell Death Dis. 9 11 1065 10.1038/s41419-018-1104-x 30337520 PMC6194073 Yang D. Liu J. Qian H. Zhuang Q. 2023 Cancer-associated fibroblasts: from basic science to anticancer therapy Exp. and Mol. Med. 55 7 1322 1332 10.1038/s12276-023-01013-0 37394578 PMC10394065 Yang R. Yang C. Su D. Song Y. Min J. Qian Z. 2024 METTL3-mediated RanGAP1 promotes colorectal cancer progression through the MAPK pathway by recruiting YTHDF1 Cancer Gene Ther. 31 4 562 573 10.1038/s41417-024-00731-5 38267624 PMC11016466 Yang Y. Sun H. Yu H. Wang L. Gao C. Mei H. 2025 Tumor-associated-fibrosis and active collagen-CD44 axis characterize a poor-prognosis subtype of gastric cancer and contribute to tumor immunosuppression J. Transl. Med. 23 1 123 10.1186/s12967-025-06070-9 39871345 PMC11773867 Yu G. Wang L.-G. Han Y. He Q.-Y. 2012 clusterProfiler: an R Package for comparing biological Themes among gene clusters OMICS A J. Integr. Biol. 16 5 284 287 10.1089/omi.2011.0118 22455463 PMC3339379 Yuan Z. Li Y. Zhang S. Wang X. Dou H. Yu X. 2023 Extracellular matrix remodeling in tumor progression and immune escape: from mechanisms to treatments Mol. Cancer 22 1 48 10.1186/s12943-023-01744-8 36906534 PMC10007858 Zhan T. Rindtorff N. Boutros M. 2017 Wnt signaling in cancer Oncogene 36 11 1461 1473 10.1038/onc.2016.304 27617575 PMC5357762 Zhang L. Yu X. Zheng L. Zhang Y. Li Y. Fang Q. 2018 Lineage tracking reveals dynamic relationships of T cells in colorectal cancer Nature 564 7735 268 272 10.1038/s41586-018-0694-x 30479382 Zhang L. Li Z. Skrzypczynska K. M. Fang Q. Zhang W. O’Brien S. A. 2020 Single-cell analyses Inform mechanisms of myeloid-targeted therapies in colon cancer Cell 181 2 442 459 10.1016/j.cell.2020.03.048 32302573 Zhang S. Fang W. Zhou S. Zhu D. Chen R. Gao X. 2023 Single cell transcriptomic analyses implicate an immunosuppressive tumor microenvironment in pancreatic cancer liver metastasis Nat. Commun. 14 1 5123 10.1038/s41467-023-40727-7 37612267 PMC10447466 ",
  "metadata": {
    "Title of this paper": "Single cell transcriptomic analyses implicate an immunosuppressive tumor microenvironment in pancreatic cancer liver metastasis",
    "Journal it was published in:": "Frontiers in Genetics",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12477005/"
  }
}