{
  "title": "Paper_851",
  "abstract": "pmc ACS Omega ACS Omega 3686 acsomega ao ACS Omega 2470-1343 American Chemical Society http://pubs.acs.org/journal/acsodf PMC12461432 PMC12461432.1 12461432 12461432 41018601 10.1021/acsomega.5c06335 1 Article Mitigating Methotrexate-Induced\nKidney Damage in Mice\nby the Phragmanthera austroarabica 6677041 https://orcid.org/0009-0002-1456-1362 Hal Dina M. 4851041 Mehanna Eman T. 7033138 Hazem Reem M. 7252855 Swidan Shady 7033140 Elrayess Ranwa A. 7629064 Nashawi Asma Ahmad 7341164 https://orcid.org/0000-0002-9370-4546 Murshid Samar S. A. 6573135 Lashkar Manar O. 4329759 https://orcid.org/0000-0003-3799-0581 Elhady Sameh S. 6677048 Badr Jihan M. 7252863 Fattah Shaimaa A.  1 Department\nof Pharmacognosy, Faculty of Pharmacy 68831 Suez\nCanal University Ismailia 41522 Egypt  2 Department\nof Biochemistry, Faculty of Pharmacy 68831 Suez\nCanal University Ismailia 41522 Egypt  3 Department\nof Pharmacology and Toxicology, Faculty of Pharmacy 68831 Suez Canal University Ismailia 41522 Egypt  4 Department\nof Pharmaceutics and Pharmaceutical Technology, Faculty of Pharmacy 120633 The British University in Egypt El-Sherouk City, Cairo 11837 Egypt  5 Department\nof Zoology, Faculty of Science 68831 Suez Canal\nUniversity Ismailia 41522 Egypt  6 Department\nof Pharmaceutical Chemistry, Faculty of Pharmacy 37848 King Abdulaziz University Jeddah 21589 Saudi Arabia  7 Department\nof Natural Products and Alternative Medicine, Faculty of Pharmacy 37848 King Abdulaziz University Jeddah 21589 Saudi Arabia  8 Department\nof Pharmacy Practice, Faculty of Pharmacy 37848 King Abdulaziz University Jeddah 21589 Saudi Arabia  9 Department\nof Biological Sciences, Faculty of Science 37848 King Abdulaziz University Jeddah 21589 Saudi Arabia * eman.taha@pharm.suez.edu.eg * gehan_ibrahim@pharm.suez.edu.eg 08 9 2025 23 9 2025 10 37 497498 43101 43119 01 7 2025 29 8 2025 04 8 2025 08 9 2025 08 09 2025 26 09 2025 29 09 2025 © 2025 The Authors. Published by American Chemical Society 2025 The Authors https://creativecommons.org/licenses/by-nc-nd/4.0/ This article is licensed under CC-BY-NC-ND 4.0  Phragmanthera austroarabica P.\naustroarabica P. austroarabica P. austroarabica King Abdulaziz University 10.13039/501100004054 GPIP-1616-249-2024 pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement yes pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes document-id-old-9 ao5c06335 document-id-new-14 ao5c06335 production-flag-MathML-config-version 3 production-flag-journal-citation-display-style acs-titles production-flag-journal-date-display-style dates-used-rcd-rvd-acc production-flag-si-avail yes document-id-alt-64 48b1a5ff19854dff8eb3d0ef0ba36c984019645891ce0aeea782167ae1d2ef86 1 Introduction Loranthaceae is one of\nthe famous families, with roughly 70 genera\nand 1000 species. Gallic acid, a low-molecular-weight phenolic compound\nfound as a major constituent in P. austroarabica One of the\ncurrent trends to protect and improve the activity of\nplant extracts and plant-derived active molecules is their encapsulation\ninto nanoparticles. In this form, the drug is entrapped in a nanoparticle\nmade of biodegradable and biocompatible polymers. This technique is\nreported to increase the physical stability and the photostability\nof drugs, control their release, and improve their efficacy both in\nvitro and in vivo. Anticancer drugs often cause nephrotoxicity as a\nside effect. Excessive\nintake of xenobiotics damages the tubules and glomeruli and leads\nto renal damage and failure. Methotrexate-induced accumulation of reactive oxygen species\n(ROS)\nin the kidney leads to renal failure and increased expression of toll-like\nreceptor (TLR4) by tubular cells. Nuclear factor (erythroid-derived\n2)-like 2 (Nrf2) is a transcription\nfactor that stimulates the production of antioxidant enzymes such\nas heme oxygenase 1 (HO-1). Upregulated HO-1 induces antioxidant and\nantiapoptotic effects and can scavenge free radicals to a considerable\nextent. Since oxidative stress,\ninflammation, damage, and repair abnormalities\nin renal diseases are closely intertwined with the pathological process\nof acute kidney injury (AKI), targeting such mechanisms might provide\neffective therapies for AKI. P. austroarabica 2 Results 2.1 LC-ESI-TOF-MS/MS Analysis of P. austroarabica  P. austroarabica P. austroarabica m z Figures S1–S4 P. austroarabica Table Figure P. austroarabica O P. austroarabica  O O O P. austroarabica P. austroarabica P. austroarabica D Table Figure 1 Metabolites Identified in the Phragmanthera austroarabica  no.  polarity\nmode  ret.\ntime (min)  measured m z  calculated m z  mass\nerror (ppm)  adduct  molecular\nformula  MS/MS\nspectrum  ref.  deduced\nname 1 negative 1.09 191.0559 191.0556 1.57 [M – H] − C 7 12 6 111, 85   d 2 positive 1.17 104.1072 104.1070 1.92 [M + H] + C 5 14 104, 60   choline 3 negative 1.18 503.1623 503.1612 2.19 [M – H] − C 18 32 16 71, 85, 101, 113, 143, 161,\n179, 221, 341   maltotriose 4 negative 1.19 169.0141 169.0137 2.37 [M – H] − C 7 6 5 169, 125   gallic acid 5 negative 1.23 175.0604 175.0606 –1.14 [M – H] − C 7 12 5 73, 85,\n113, 115  2-isopropylmalic acid 6 positive 1.77 130.0504 130.0504 0 [M + H] + C 5 7 3 70   l 7 negative 4.29 289.0718 289.0712 2.08 [M – H] − C 15 14 6 289, 125,137, 161  (−)-epicatechin 8 positive 4.66 195.0876 195.0882 –3.08 [M + H] + C 8 10 4 2 195, 138, 68   caffeine 9 negative 4.91 183.0289 183.0293 –2.19 [M – H] − C 8 8 5 183, 168, 140, 124   methyl gallate 10 positive 5.28 291.0876 291.0869 2.40 [M + H] + C 15 14 6 290, 179   catechin 11 positive 5.75 579.1481 579.1503 –3.79 [M + H] + C 30 26 12 123, 151, 159, 161, 163,\n179, 189   procyanidin B1 12 negative 5.96 609.1819 609.1819 0 [M – H] − C 28 34 15 300, 609,\n163   hesperidin 13 negative 6.16 303.0510 303.0505 1.65 [M – H] − C 15 12 7 303, 177,\n125   taxifolin 14 negative 6.58 441.0799 441.0822 –5.21 [M – H] − C 22 18 10 245, 169, 179, 125   catechin-4′-  O -gallate 15 positive 6.74 465.1019 465.1033 –3.01 [M + H] + C 21 20 12 83, 300   hyperoside 16 negative 6.86 447.0932 447.0927 1.12 [M – H] − C 21 20 11 447, 284   quercitrin 17 negative 6.91 477.1037 477.1033 0.84 [M – H] − C 22 22 12 477, 151, 227, 229   isorhamnetin-3-  O -glucoside 18 positive 7.56 435.1281 435.1291 –2.29 [M + H] + C 21 22 10 151, 271   naringenin-7- O 19 negative 7.67 431.0979 431.0978 0.23 [M – H] − C 21 20 10 269, 225    apigenin-7- O 20 positive 7.75 289.0695 289.0712 –5.88 [M + H] + C 15 12 6 145, 153, 163, 179  3′,4 ′, 21 negative 8.59 285.0396 285.0399 –1.05 [M – H] − C 15 10 6 133, 285   luteolin 22 negative 9.07 301.0356 301.0348 2.66 [M – H] − C 15 9 7 301, 151   quercetin 23 negative 9.87 301.0707 301.0712 –1.66 [M – H] − C 16 14 6 301, 143   hesperetin 24 negative 10.07 269.0455 269.0450 1.86 [M – H] − C 15 10 5 269, 151   apigenin 25 positive 11.02 301.0714 301.0712 0.66 [M + H] + C 16 12 6 107, 151  3,5,7-trihydroxy-4′-methoxyflavone 26 negative 11.16 283.0612 283.0606 2.11 [M – H] − C 16 12 5 282.8, 268   acacetin 27 positive 13.65 271.0613 271.0606 2.58 [M + H] + C 15 10 5 241   emodin 28 negative 21.85 455.3531 455.3525 1.32 [M – H] − C 30 48 3 455, 425   ursolic acid 1 Metabolites identified in the P. austroarabica 2.2 Preparation of the P. austroarabica The P. austroarabica The prepared nanoparticles have a polymer/surfactant ratio\nof 1:1, which was found to be a suitable ratio for the formation of\nsmall-sized NPs with uniform size distribution. Allotey-Babington\nand colleagues prepared four different ratios containing three types\nof poloxamer surfactant and found that formulations containing PCL/Poloxamer\n188 ratios of 1:1 and 1:2 produced smaller and more uniform PCL NPs. 2.2.1 Particle Size, Zeta Potential, Entrapment\nEfficiency, and Drug Loading The particle size (PS) and polydispersity\nindex are important characteristics of the prepared NP. The PS of\nthe prepared gallic acid NPs is 192.1 nm, while for the P. austroarabica One of the most important factors that affects the\nstability of the nanoparticle is the zeta potential (ZP), which is\nan indication of the surface charge. ZP can prominently influence\nthe nanoparticle stability in suspension through electrostatic repulsion.\nThe repulsive forces between the nanoparticles are larger when the\nZP increases, forming a more stable colloidal dispersion with a more\nuniform size distribution. For gallic acid, the encapsulation efficiency (EE%) and drug loading\n(DL%) were determined as they reflect the ability of the formulated\nnanoparticles to encapsulate the drug and their capacity to load the\ndrug. The EE% and DL% for gallic acid nanoparticles were 80.14 ±\n3.52% and 3.82 ± 0.17% respectively. 2.2.2 TEM The morphology of the prepared\ngallic acid NPs and extract NPs was studied by transmission electron\nmicroscopy. In Figure 2 TEM images of the prepared\nnanoparticles: (A) P.\naustroarabica 2.3 In Vivo Study of the Renoprotective Effects\nof P. austroarabica 2.3.1 Impact on Kidney Function and Kidney Injury\nBiomarkers Injection of MTX significantly increased creatinine\nand urea compared with the NC group ( p P. austroarabica p p Figure Table S1 3 Effects of P. austroarabica n p P. austroarabica P. austroarabica Additionally, the MTX group presented a significant\nincrease in\nKIM-1 levels in the renal tissue compared to the NC group ( p P. austroarabica p P. austroarabica p Figure Table S1 2.3.2 Impact on Histopathological Findings Examination of the kidney H&E-stained sections showed that the\nNC group exhibited normal configuration of the renal cortical and\nmedullary regions ( Figure Figure S5A Figure Figure S5B P. austroarabica Figure Figure S5C Figure Figure S5E P. austroarabica Figure Figure S5D Figure Figure S5F 4 Microscopic images of the H&E renal cortical region of all\nexperimental groups showing the following: (A) The normal control\ngroup had a regular renal structure. (B) The MTX group showed atrophy\n(at) and hypercellularity (hy) of glomerulus, congestion and hemorrhage\n(*), infiltration of inflammatory cells (ly), hydropic degeneration\n(red arrow), necrosis of some renal tubules’ nuclei (black\narrow), and tubular casts (black arrowhead). (C) The P. austroarabica P. austroarabica n p P. austroarabica P. austroarabica The kidney damage score was significantly increased\n( p P. austroarabica P. austroarabica p Figure 2.3.3 Effect on Oxidative Stress and Inflammatory\nBiomarkers The MTX insult significantly increased MDA content,\nindicative of lipid peroxidation, in kidneys compared to NC ( p P. austroarabica p p P. austroarabica Figure 5 Effect\nof P. austroarabica n p P. austroarabica P. austroarabica On the other hand, renal injury induced by MTX\ndisplayed a significant\ndecrease in the levels of the antioxidants GSH, SOD, and CAT in the\nkidneys compared with the NC group ( p Figure P. austroarabica p p Figure P. austroarabica Figure Injection of MTX apparently triggered an inflammatory\nresponse\nin the kidney tissue as evidenced by the remarkable increase in TNF-α,\nIL-1β, and IL-6 levels and decrease in PPARγ compared\nwith the NC group ( p Figure Table S1 P. austroarabica P. austroarabica p Figure 6 Effect of P. austroarabica n p P. austroarabica P. austroarabica Treatment with P. austroarabica P. austroarabica P. austroarabica p Figure 2.3.4 Effect on Nrf2, HO-1, and Inflammasome Components The expression of Nrf2 and the levels of HO-1 were significantly\nsuppressed by injection of MTX. Interestingly, treatment with P. austroarabica p Figure 7 Effect of P. austroarabica n p P. austroarabica P. austroarabica Injection of MTX stimulated inflammasome activation,\nas shown by\nthe significant induction of TLR4, NF-κB, and NLRP3 compared\nwith the NC group ( p Figure P. austroarabica p P. austroarabica Figure Immunohistochemical examination\nrevealed increased expression of\ncaspase-1 by administration of MTX compared with the NC group, while\nits expression was significantly suppressed in all treated groups,\nparticularly in the groups treated with P. austroarabica p Figure 8 Representative figures\nof caspase-1 immunohistochemical expression\nin the different experimental groups. (A) Normal control group, (B)\nMTX group, (C) P. austroarabica P. austroarabica n p P. austroarabica P. austroarabica 2.3.5 Impact on Apoptotic Markers The\nMTX-treated group revealed a significant increase in caspase-3 ( Figure Figure p p p P. austroarabica Figure 9 Representative figures of caspase-3 immunohistochemical\nexpression\nin the different experimental groups. (A) Normal control group, (B)\nMTX group, (C) P. austroarabica P. austroarabica n p P. austroarabica P. austroarabica 10 Representative figures of Bax immunohistochemical expression\nin\nthe different experimental groups. (A) Normal control group, (B) MTX\ngroup, (C) P. austroarabica P. austroarabica n p P. austroarabica P. austroarabica 11 Representative figures of Bcl-2 immunohistochemical expression\nin the different experimental groups. (A) Normal control group, (B)\nMTX group, (C) P. austroarabica P. austroarabica n p P. austroarabica P. austroarabica 3 Discussion Methotrexate, one of the\nmost used anticancer drugs, is largely\nexcreted by the kidneys, and its induced nephrotoxicity represents\na great challenge. The accumulation of MTX and its metabolites in\nrenal tubules may lead to kidney damage along with its direct noxious\neffect on renal tubules. KIM-1 is a sensitive and specific\nurinary biomarker for renal injury.  Treatment with MTX leads to an imbalance of renal antioxidants,\nwhich in turn results in lipid peroxidation, decreased tissue antioxidant\ncapacity, and depletion of renal glutathione reserves. To further\ninvestigate the effect of MTX on the disruption of antioxidant\nbalance, the current results showed the downregulation of Nrf2 expression\nalong with diminished HO-1 levels in MTX control mice compared to\nthe normal group. Nrf2 plays a vital role in regulating the production\nof various cytoprotective genes besides cellular defense against oxidants. Toxic insults and oxidative stress can cause massive tubular\ncell\ndeath. In this initial stage, tubular cell death triggers an innate\nimmune response.  The ROS, NF-κB, pathogen-associated\nmolecular pattern molecules\n(PAMPs), and DAMPs are the major known triggering signals of the NLRP3\ninflammasome. Apoptosis can be induced by IL-1β\nreleased in response to\ninflammasome activation. Our study also showed a significant decrease\nin PPARγ levels\nin the MTX control mice relative to those of the NC group. PPAR reduces\nthe inflammatory response by inhibiting the expression of TLR4, NF-κB,\nNLRP3, and IL-1β. Natural compounds, including flavonoids,\npolyphenols, and terpenoids,\nwere reported to have beneficial effects against AKI. P. austroarabica P. austroarabica P.\naustroarabica P. austroarabica In this\nstudy, LC-ESI-TOF-MS/MS analysis of the P. austroarabica  Certain\npotential drugs have limited availability due to their\nhigh hydrophobicity, low bioavailability, poor in vivo stability,\nand probable side effects. In addition, few drugs are kidney-targeted\nand small molecules are excreted too quickly to reach therapeutic\nconcentrations that are useful in damaged kidneys. These problems\nhinder the further development of pharmacological treatment of AKI.\nAn innovative and interesting treatment option for AKI that has the\npotential to solve the pharmacological treatment dilemma is nanotherapeutics\nbased on nanotechnology. The nanosize of natural compounds may offer\nseveral advantages over conventional formulations, including increasing\ntheir solubility and bioavailability as well as improving their efficacy. P. austroarabica P. austroarabica  .  PCL nanoparticles\nalso proved to be biodegradable, biocompatible,\nand of low toxicity. PCL-based materials, including nanoparticles,\nhave demonstrated excellent cytocompatibility, maintaining high cell\nviability, and supporting cell proliferation and differentiation.\nBulcão et al. showed that formulated PCL lipid nanocapsules\nshowed no signs of clinical toxicity, indicating a high safety profile. Suppression of excessive ROS production\nhas been shown to have\na nephroprotective effect via suppression of NF-κB and inflammasome\nactivation. P. austroarabica P. austroarabica In the current study,\nthe crude extract of P. austroarabica  P. austroarabica P. austroarabica An increase in PPARγ levels following the administration\nof P. austroarabica P. austroarabica Despite the usefulness of mouse models for preclinical\nresearchsuch\nas our present study on the nephroprotective effect of P. austroarabica  4 Materials and Methods 4.1 Plant Material The plant sample was\nair-dried and ground. The extract was produced by macerating 1.5 kg\nof each plant with MeOH (3 L, twice) at room temperature. The extracts\nwere then refrigerated after being condensed at a lower pressure. 4.2 Metabolomic Profiling by LC/MS/MS High-resolution LC-ESI-TOF-tandem mass spectrometric analysis was\nexecuted as previously mentioned. P. austroarabica 4.3 Preparation of PCL Nanoparticles PCL (molecular weight, 14,000) was purchased from Sigma-Aldrich,\nSt. Louis, USA. Poloxamer 188 was purchased from Alfa Aesar (Lancashire,\nUnited Kingdom). The P. austroarabica P. austroarabica 4.4 Determination of PS and ZP, EE%, and DL% of\nthe Prepared NPs The mean particle diameter of the prepared\nNPs was characterized by a dynamic light scattering technique using\na Zetasizer (Malvern Instruments, Malvern, UK). In brief, the NP dispersions\nwere diluted in a 1:10 ratio with double distilled water and placed\nin a chamber with a light scattering angle of 90° and at room\ntemperature (25 °C). The ZP was measured by the same instrument\nusing laser Doppler velocimetry at the same temperature. The gallic\nacid loading % and entrapment efficiency % in the nanoparticles were\ndetermined using an indirect method to separate the unbound gallic\nacid. In brief, the obtained NP dispersions were centrifuged using\ncooling centrifuge (Centurion Ltd. PRO-Research K241R-UK) at 14,000\nrpm and 4 °C for 1 h, and the free drug in the supernatant was\nquantified using a UV–visible spectrophotometer (Jasco v-630,\nproduced by Jasco, Tokyo, Japan) at 267 nm. A calibration curve of\ngallic acid was plotted with concentrations ranging from 5 to 30 μg/mL\nin double distilled water ( R 2 EE % = total gallic acid − free gallic acid in supernatant total gallic acid × 100 DL % = total gallic acid − free gallic acid in supernatant total weight of nanoparticles × 100 4.5 Transmission Electron Microscopy The morphology and shape of the prepared P. autroarabica 4.6 In Vivo Evaluation of the Protective Effects\nof P. austroarabica P. autroarabica 4.6.1 Animals Forty-eight adult male\nSwiss albino mice weighing 20–30 g were used. Animals were\npurchased from the Egyptian Biological Products and Vaccines Organization\n(Vacsera, Giza, Egypt). Animals were housed in aluminum cages with\ndirect sunlight at controlled room temperature (25 ± 3 °C)\nwith a regular 12:12 h light/dark cycle, normal food, and unlimited\naccess to water and natural ventilation. The treatment of the experimental\nanimals was carried out according to the established criteria for\nthe care and use of laboratory animals and was approved by the Ethics\nCommittee of the Faculty of Pharmacy, Suez Canal University, Egypt\n(code: 202307RA1). 4.6.2 Study Design Following a 2 week\naccommodation period, the animals were randomly divided into six groups.\nGroup 1, which served as the NC group, received an oral vehicle combination\nof distilled water and DMSO (2:1) for 10 days. The remaining five\ngroups received a single i.p. dose of 20 mg/kg MTX to induce renal\ndamage. P. austroarabica P. austroarabica Figure 12 Summary schematic workflow of the study of\nthe study methodology.\nMDA: malondialdehyde, GSH; glutathione, SOD: superoxide dismutase,\nCAT: catalase, TNF-α: tumor necrosis factor-α, IL: interleukin,\nPPARγ: peroxisome proliferator-activated receptors gamma, Nrf2:\nnuclear factor (erythroid-derived 2)-like 2, HO-1: heme oxygenase\n1, KIM-1: kidney injury molecule-1, TLR4: toll-like receptor 4, NF-κB:\nnuclear factor-κB, and NLRP3: NLR family pyrin domain containing\n3. The statistics show that the blank formulation had no significant\neffect on the measured parameters compared to the control group. 4.6.3 Renal Function Markers Mice sera\nwere analyzed for renal function tests using a colorimetric assay\nwith urea and creatinine detection kits from Bio-Diagnostic UR2110\nand CR1250 (Biodiagnostic, Giza, Egypt), respectively. 4.6.4 Histopathological Evaluation Kidney\ntissues were fixed in 4% formaldehyde, dehydrated, embedded in paraffin,\nsliced at 5 μm, stained with hematoxylin and eosin (H&E), 4.6.5 Oxidative Stress Markers The kidney\nhomogenates were used to determine the levels of catalase (CAT), superoxide\ndismutase (SOD), the nonenzymatic antioxidant glutathione (GSH), and\nmalondialdehyde (MDA) using ELISA kits (MyBioSource, San Diego, CA,\nUSA; cat. nos. MBS160589, MBS034842, MBS267424, and MBS741034, respectively). 4.6.6 ELISA Assay of Kidney Injury Molecule-1\n(KIM-1), Heme Oxygenase 1 (HO-1), Peroxisome Proliferator-Activated\nReceptor Gamma (PPARγ), Tumor Necrosis Factor-α (TNF-α),\nInterleukin-1β (IL-1β), and Interleukin-6 (IL-6) The concentrations of KIM-1, HO-1, PPARγ, TNF-α, IL-1β,\nand IL-6 were determined in the homogenate samples of kidney tissue\nusing ELISA kits according to the manufacturer’s instructions\n(MyBioSource, San Diego, CA, USA; cat. nos. MBS355399, MBS760394,\nMBS2501353, MBS825075, MBS175967, and MBS824703, respectively). 4.6.7 Gene Expression Analysis of Nuclear Factor\n(Erythroid-Derived 2)-Like 2 (Nrf2), Nuclear Factor Kappa B (NF-κB),\nToll-like Receptor 4 (TLR4), and NLR Family Pyrin Domain Containing\n3 (NLRP3) by Real-Time Quantitative Reverse Transcription Polymerase\nChain Reaction (RT-qPCR) The Qiagen miRNeasy Mini Kit (catalog\nno. 217004) (Qiagen, Hilden, Germany) was used to extract the total\nRNA from the frozen kidney tissue. The concentration and purity of\nextracted RNA were measured using a NanoDrop spectrophotometer (Thermo\nFisher Scientific, Waltham, MA, USA) at 260/280 nm. The expression\nof Nrf2, NF-κB, TLR4, and NLRP3 was examined in kidney tissue\nusing the GoTaq 1-Step RT-qPCR technology (Promega, Madison, WI, USA).\nThe expression of β-actin (endogenous control gene) was also\nassessed. The primers are listed in Table 2 Primer Sequences Used in Quantitative\nReal-Time PCR   primer\nsequences  annealing\ntemp.  accession\nno. Nrf2 forward: 5′-CTCTCTGGAGACGGCCATGACT-3′ 58 °C NM_010902.5 reverse: 5-CTGGGCTGGGGACAGTGGTAGT-3′ NF-κβ forward: 5′-CAATGGCTACACAGGACCA-3′ 51 °C NM_001402548.1 reverse: 5-CACTGTCACCTGGAACCAGA-3′ TLR4 forward: 5′-TTTATTCAGAGCCGTTGGTG-3′ 49 °C NM_021297.3 reverse: 5′-CAGAGGATTGTCCTCCCATT-3′ NLRP3 forward: 5-AGCCTTCCAGGATCCTCTTC-\n3′ 51 °C NM_145827.4 reverse: 5′-CTTGGGCAGCAGTTTCTTTC-\n3′ β-actin forward: 5′-ACGGCCAGGTCATCACTATTG-3′ 51 °C NM_007393.5 reverse: 5′-CAAGAAGGAAGGCTGGAAAAGA-3′ 4.6.8 Protein Expression Analysis of Caspase-1,\nCaspase-3, Bax, and Bcl-2 by Immunohistochemistry Kidney\nsections were dewaxed and rehydrated. After antigen retrieval, sections\nwere kept in 3% H 2 2 4.7 Statistical analysis The Statistical\nPackage for Social Sciences (SPSS) software, version 17 (Chicago,\nIL, USA), was used to analyze the data. Results were expressed as\nthe mean ± standard deviation (SD). One-way analysis of variance\n(ANOVA) and the Bonferroni post hoc multiple comparison test were\nused to determine significant differences between treatment effects,\nwith the statistical significance level set at p 5 Conclusions Metabolomic profiling of\nthe bioactive extract indicated the existence\nof various secondary metabolites, mainly flavonoids and phenolic compounds,\nin addition to terpenes. The current research revealed for the first\ntime that P. austroarabica P. austroarabica P. austroarabica P. austroarabica Supplementary Material This project was funded by\nthe Deanship of Scientific\nResearch (DSR) at King Abdulaziz University (KAU), Jeddah, Saudi Arabia,\nunder grant number (GPIP-1616-249-2024). The authors, therefore, acknowledge\nwith thanks DSR for technical and financial support. The simulations\nin this work were performed at King Abdulaziz University’s\nHigh Performance Computing Center (Aziz Supercomputer) ( https://hpc.kau.edu.sa The original\ncontributions presented in this study are included in the article/Supporting\nInformation. Further inquiries can be directed to the corresponding\nauthor(s). The Supporting Information\nis\navailable free of charge at https://pubs.acs.org/doi/10.1021/acsomega.5c06335 Negative-mode TIC of Phragmanthera austroarabica Phragmanthera\naustroarabica Phragmanthera austroarabica Phragmanthera austroarabica P. austroarabica PDF Conceptualization:\nE.T.M., R.M.H., and J.M.B.; methodology: D.M.H., E.T.M., R.M.H., S.S.,\nand R.A.E.; software: D.M.H., A.A.N., S.S.A.M., M.O.L., S.S.E., and\nS.A.F.; validation: D.M.H., E.T.M., S.S., A.A.N., S.S.A.M., S.S.E.,\nand J.M.B.; formal analysis: A.A.N., S.S.A.M., M.O.L., S.S.E., D.M.H.,\nE.T.M., R.M.H., R.A.E., and S.A.F.; investigation: D.M.H., E.T.M.,\nR.M.H., and R.A.E.; data curation: D.M.H., R.M.H., S.S., M.O.L., J.M.B.,\nA.A.N., S.S.A.M., S.S.E., and S.A.F.; writing–original draft:\nD.M.H., S.S., R.A.E., and S.A.F.; writing–review and editing:\nE.T.M., R.M.H., J.M.B., A.A.N., S.S.A.M., M.O.L., S.S.E., and S.A.F.;\nvisualization: D.M.H., E.T.M., A.A.N., S.S.A.M., S.S.E., R.M.H., S.S.,\nM.O.L., and S.A.F.; supervision: J.M.B.; project administration: J.M.B. This\nproject\nwas funded by the Deanship of Scientific Research (DSR) at King Abdulaziz\nUniversity (KAU), Jeddah, Saudi Arabia, under grant number (GPIP-1616–249–2024).\nThe authors, therefore, acknowledge with thanks DSR for technical\nand financial support. The treatment of the\nexperimental animals was approved by the Ethics Committee of the Faculty\nof Pharmacy, Suez Canal University, Egypt (code: 202307RA1). The authors\ndeclare no competing financial interest. Abbreviations AKI acute\nkidney injury Bcl-2 B-cell lymphoma 2 BPC base peak chromatogram CAT catalase DAMPs damage-associated molecular pattern\nmolecules GSH reduced\nglutathione H&E hematoxylin and eosin HO-1 heme oxygenase 1 UHPLC ultra-high-performance liquid\nchromatography IL-1β interleukin-1 beta IL-6 interleukin-6 KIM-1 kidney injury molecule 1 LC-ESI-TOF-MS/MS liquid chromatography-electrospray\nionization-time-of-flight-mass spectrometry/mass spectrometry MDA malondialdehyde MTX methotrexate NC normal control NF-κB nuclear factor\nkappa B NLRs NOD\n-like receptors NLRP3 NLR family pyrin domain-containing\n3 NPs nanoparticles Nrf2 nuclear factor\n(erythroid-derived\n2)-like 2 PAMPs pathogen-associated molecular\npattern molecules PCL poly­(ε-caprolactone) PPARγ peroxisome proliferator-activated\nreceptor gamma PRRs pattern recognition receptors ROS reactive oxygen species SOD superoxide dismutase TEM transmission electron\nmicroscopy TIC total\nion chromatogram TLR toll-like receptor TNF tumor necrosis factor ZP zeta potential Geetha T. Malhotra V. Chopra K. Kaur I. P. Antimutagenic and\nantioxidant/prooxidant activity of quercetin J. Exp. Biol. 2005 43 61 67 15691067 Frank L. A. Gazzi R. P. de Andrade Mello P. Buffon A. Pohlmann A. R. Guterres S. S. Imiquimod-loaded nanocapsules improve cytotoxicity\nin cervical cancer cell line Eur. J. Pharm.\nBiopharm. 2019 136 9 17 10.1016/j.ejpb.2019.01.001 30630060 Forim M. R. Costa E. S. Da Silva M. F. D. G.\nF. Fernandes J. B. Mondego J. M. Boiça Junior A.\nL. Development of a new\nmethod to prepare nano-/microparticles loaded with extracts of Azadirachta\nindica, their characterization and use in controlling Plutella xylostella J. Agric. Food Chem. 2013 61 38 9131 9139 10.1021/jf403187y 23991702 Abd-Elhamid T. H. Elgamal D. A. Ali S. S. Ali F. E. M. Hassanein E. H. M. El-Shoura E. A. M. Hemeida R. A. M. Reno-protective\neffects of ursodeoxycholic acid against gentamicin-induced nephrotoxicity\nthrough modulation of NF-κB, eNOS and caspase-3 expressions Cell Tissue Res. 2018 374 367 387 10.1007/s00441-018-2886-y 30078101 Abd\nEl-Twab S. M. Hussein O. E. Hozayen W. G. Bin-Jumah M. Mahmoud A. M. Chicoric acid prevents methotrexate-induced kidney\ninjury by suppressing NF-κB/NLRP3 inflammasome activation and\nup-regulating Nrf2/ARE/HO-1 signaling Inflammation\nRes. 2019 68 511 523 10.1007/s00011-019-01241-z 31037316 Behranvand N. Nasri F. Zolfaghari Emameh R. Khani P. Hosseini A. Garssen J. Falak R. Chemotherapy: a double-edged sword\nin cancer treatment Cancer immunology, immunotherapy 2022 71 3 507 526 10.1007/s00262-021-03013-3 34355266 PMC10992618 Wang R. Wu G. Dai T. Lang Y. Chi Z. Yang S. Dong D. Naringin attenuates\nrenal interstitial fibrosis by regulating the\nTGF-β/Smad signaling pathway and inflammation Exp. Ther. Med. 2020 21 1 66 10.3892/etm.2020.9498 33365066 PMC7716641 Place D. E. Kanneganti T.-D. Recent\nadvances in inflammasome biology Current opinion\nin immunology 2018 50 32 38 10.1016/j.coi.2017.10.011 29128729 PMC5857399 Yu Y. Wu Y. Wen G. Yang W. Effect of pioglitazone on the expression\nof TLR4 in renal tissue of diabetic rats Chin.\nJ. Cell. Mol. Immunol. 2014 30 8 793 797 25108428 Ryter S. W. Heme oxygenase-1:\nan anti-inflammatory effector in cardiovascular, lung, and related\nmetabolic disorders Antioxidants 2022 11 3 555 10.3390/antiox11030555 35326205 PMC8944973 Li H. D. Meng X. M. Huang C. Zhang L. Lv X. W. Li J. Application of herbal\ntraditional Chinese medicine in the treatment\nof acute kidney injury Front. Pharmacol 2019 10 376 10.3389/fphar.2019.00376 31057404 PMC6482429 Badr J. M. Chemical\nconstituents of Phragmanthera austroarabica Pharmacognosy Research 2015 7 4 335 10.4103/0974-8490.158436 PMC4660512 26692747 Muhammad K. J. a. Chemical\nConstituents of Loranthaceae (Mistletoes): A Review Journal of Science and Mathematics Letters 2024 12 2 1 24 10.37134/jsml.vol12.2.1.2024 Karar M. G. E. Kuhnert N. UPLC-ESI-Q-TOF-MS/MS\ncharacterization of phenolics\nfrom Crataegus monogyna Crataegus laevigata J. Chem. Biol. Ther 2015 1 102 2572 0406 Bruce S. J. Guy P. A. Rezzi S. Ross A. B. Quantitative measurement\nof betaine and free choline in plasma, cereals and cereal products\nby isotope dilution LC-MS/MS J. Agric. Food\nChem. 2010 58 4 2055 2061 10.1021/jf903930k 20102202 Castillo J. J. Galermo A. G. Amicucci M. J. Nandita E. Couture G. Bacalzo N. Chen Y. Lebrilla C. B. A multidimensional\nmass spectrometry-based workflow for de novo structural elucidation\nof oligosaccharides from polysaccharides J.\nAm. Soc. Mass Spectrom. 2021 32 8 2175 2185 10.1021/jasms.1c00133 34261322 PMC8344699 Wang L. Halquist M. S. Sweet D. H. Simultaneous\ndetermination of gallic\nacid and gentisic acid in organic anion transporter expressing cells\nby liquid chromatography–tandem mass spectrometry Journal of Chromatography B 2013 937 91 96 10.1016/j.jchromb.2013.08.024 24022056 Ricciutelli M. Moretti S. Galarini R. Sagratini G. Mari M. Lucarini S. Vittori S. Caprioli G. Identification\nand quantification of new isomers of isopropyl-malic acid in wine\nby LC-IT and LC-Q-Orbitrap Food chemistry 2019 294 390 396 10.1016/j.foodchem.2019.05.068 31126479 Sanwald C. Robciuc A. Ruokonen S.-K. Wiedmer S. K. Lämmerhofer M. A combined\ntargeted/untargeted LC-MS/MS-based screening approach for mammalian\ncell lines treated with ionic liquids: Toxicity correlates with metabolic\nprofile Talanta 2019 197 472 481 10.1016/j.talanta.2019.01.054 30771964 Cai R. J. Yin X. L. Liu J. Qin D. X. Zhao G. Z. Characterization\nand identification of in vitro metabolites of (−)-epicatechin\nusing ultra-high performance liquid chromatography-mass spectrometry Tropical Journal of pharmaceutical research 2018 16 12 2985 2990 10.4314/tjpr.v16i12.24 Mendes V. M. Coelho M. Tomé A. R. Cunha R. A. Manadas B. Validation\nof an LC-MS/MS method for the quantification of caffeine and theobromine\nusing non-matched matrix calibration curve Molecules 2019 24 16 2863 10.3390/molecules24162863 31394755 PMC6720522 Jiamboonsri P. Pithayanukul P. Bavovada R. Gao S. Hu M. A validated\nliquid chromatography–tandem mass spectrometry method for the\ndetermination of methyl gallate and pentagalloyl glucopyranose: Application\nto pharmacokinetic studies Journal of Chromatography\nB 2015 986 12 17 10.1016/j.jchromb.2015.02.006 25703947 Stöggl W. M. Huck C. W. Bonn G. K. Structural\nelucidation of catechin\nand epicatechin in sorrel leaf extracts using liquid-chromatography\ncoupled to diode array-, fluorescence-, and mass spectrometric detection J. Sep. Sci. 2004 27 7–8 524 528 10.1002/jssc.200301694 15335034 Yuzuak S. Ballington J. Xie D.-Y. HPLC-qTOF-MS/MS-based profiling of\nflavan-3-ols and dimeric proanthocyanidins in berries of two muscadine\ngrape hybrids FLH 13–11 and FLH 17–66 Metabolites 2018 8 4 57 10.3390/metabo8040057 30261603 PMC6316709 Li X. Xiao H. Liang X. Shi D. Liu J. LC–MS/MS\ndetermination of naringin, hesperidin and neohesperidin in rat serum\nafter orally administrating the decoction of Bulpleurum falcatum Fractus aurantii J. Pharm. Biomed. Anal. 2004 34 1 159 166 10.1016/j.japna.2003.08.002 14738930 Yang C.-J. Wang Z.-B. Mi Y.-Y. Gao M.-J. Lv J.-N. Meng Y.-H. Yang B.-Y. Kuang H.-X. UHPLC-MS/MS determination,\npharmacokinetic, and bioavailability study of taxifolin in rat plasma\nafter oral administration of its nanodispersion Molecules 2016 21 4 494 10.3390/molecules21040494 27089318 PMC6273324 Yao M. Li A. Yang Y. Xu Z. Yuan M. Ouyang H. He M. Feng Y. Yang S. Li J. Comprehensive identification\nstrategy for rapid profiling of chemical constituents using ultra-high\nperformance liquid chromatography-quadrupole time-of-flight mass spectrometry\nwith Rhubarb as an example Journal of Chromatography\nA 2024 1730 465094 10.1016/j.chroma.2024.465094 38889584 Zhou C. Liu Y. Su D. Gao G. Zhou X. Sun L. Ba X. Chen X. Bi K. A sensitive LC–MS–MS\nmethod for simultaneous quantification of two structural isomers,\nhyperoside and isoquercitrin: application to pharmacokinetic studies Chromatographia 2011 73 353 359 10.1007/s10337-010-1879-0 El\nSayed A. M. Basam S. M. El-Naggar E. M. b. A. Marzouk H. S. El-Hawary S. LC–MS/MS and GC–MS\nprofiling as well as the antimicrobial effect of leaves of selected\nYucca species introduced to Egypt Sci. Rep. 2020 10 1 17778 10.1038/s41598-020-74440-y 33082381 PMC7575531 Du L.-y. Zhao M. Tao J.-h. Qian D.-w. Jiang S. Shang E.-x. Guo J.-m. Liu P. Su S.-l. Duan J.-A. The metabolic profiling of isorhamnetin-3-O-neohesperidoside\nproduced by human intestinal flora employing UPLC-Q-TOF/MS Journal of chromatographic science 2017 55 3 243 250 10.1093/chromsci/bmw176 27881493 Draz A. Kawashty S. Shamso E. Hosni H. Hussein S. Chemical profiling\nof Oxalis species growing wild in Egypt using HRLC/MS Spectrometry International Journal of Secondary Metabolite 2022 9 4 426 439 10.21448/ijsm.1110807 Wang Y. Xu Z. Huang Y. Wen X. Wu Y. Zhao Y. Ni Y. Extraction, purification,\nand hydrolysis behavior of apigenin-7-O-Glucoside\nfrom Chrysanthemum morifolium Molecules 2018 23 11 2933 10.3390/molecules23112933 30424020 PMC6278536 Borges G. Fong R. Y. Ensunsa J. L. Kimball J. Medici V. Ottaviani J. I. Crozier A. Absorption, distribution,\nmetabolism\nand excretion of apigenin and its glycosides in healthy male adults Free Radical Biol. Med. 2022 185 90 96 10.1016/j.freeradbiomed.2022.04.007 35452808 Es-Safi N.-E. Kerhoas L. Einhorn J. Ducrot P.-H. Application of ESI/MS,\nCID/MS and tandem MS/MS to the fragmentation study of eriodictyol\n7-O-glucosyl-(1→ 2)-glucoside and luteolin 7-O-glucosyl-(1→\n2)-glucoside Int. J. Mass Spectrom. 2005 247 1–3 93 100 10.1016/j.ijms.2005.10.002 Shi F. Pan H. Lu Y. Ding L. An HPLC–MS/MS\nmethod for the\nsimultaneous determination of luteolin and its major metabolites in\nrat plasma and its application to a pharmacokinetic study J. Sep. Sci. 2018 41 20 3830 3839 10.1002/jssc.201800585 30101558 Abdelhameed R. F. A. Ali A. I. Elhady S. S. Abo Mansour H. E. Mehanna E. T. Mosaad S. M. Ibrahim S. A. Hareeri R. H. Badr J. M. Eltahawy N. A. Marrubium alysson\nL. ameliorated\nmethotrexate-induced testicular damage in mice through regulation\nof apoptosis and miRNA-29a expression: LC-MS/MS metabolic profiling Plants 2022 11 17 2309 10.3390/plants11172309 36079691 PMC9460399 Sun J. Liang F. Bin Y. Li P. Duan C. Screening\nnon-colored phenolics in red wines using liquid chromatography/ultraviolet\nand mass spectrometry/mass spectrometry libraries Molecules 2007 12 3 679 693 10.3390/12030679 17851421 PMC6149347 Lin Y. Xu W. Huang M. Xu W. Li H. Ye M. Zhang X. Chu K. Qualitative and quantitative analysis\nof phenolic acids, flavonoids and iridoid glycosides in Yinhua\nKanggan Molecules 2015 20 7 12209 12228 10.3390/molecules200712209 26151117 PMC6331852 Justesen U. Collision-induced\nfragmentation of deprotonated methoxylated flavonoids, obtained by\nelectrospray ionization mass spectrometry Journal\nof Mass Spectrometry 2001 36 2 169 178 10.1002/jms.118 11288199 Zhang Z. Jia P. Zhang X. Zhang Q. Yang H. Shi H. Zhang L. LC–MS/MS determination and pharmacokinetic study of seven\nflavonoids in rat plasma after oral administration of Cirsium japonicum\nDC. extract Journal of ethnopharmacology 2014 158 66 75 10.1016/j.jep.2014.10.022 25456423 Koyama J. Takeuchi A. Morita I. Nishino Y. Shimizu M. Inoue M. Kobayashi N. Characterization\nof emodin metabolites\nin Raji cells by LC–APCI-MS/MS Bioorganic\n& medicinal chemistry 2009 17 21 7493 7499 10.1016/j.bmc.2009.09.024 19800244 Tan Z.-R. Chen Y. Zhou G. Cao S. Peng X.-D. Wang Y.-C. Peng X.-J. Zhang W. Zhou H.-H. LC–MS–MS\nquantitative determination of ursolic acid in human plasma and its\napplication to pharmacokinetic studies Chromatographia 2010 72 1107 1113 10.1365/s10337-010-1797-1 Martínez\nRivas C. J. Tarhini M. Badri W. Miladi K. Greige-Gerges H. Nazari Q. A. Galindo Rodríguez S. A. Román R. Á. Fessi H. Elaissari A. Nanoprecipitation\nprocess: From encapsulation to drug delivery Int. J. Pharm. 2017 532 1 66 81 10.1016/j.ijpharm.2017.08.064 28801107 Allotey-Babington G. L. Nettey H. D’Sa S. Braz Gomes K. D'Souza M. J. Cancer chemotherapy: Effect of poloxamer modified nanoparticles\non cellular function J. Drug Delivery Sci.\nTechnol. 2018 47 181 192 10.1016/j.jddst.2018.06.012 Mahmoud k. Y. Elhesaisy N. A. Rashed A. R. Mikhael E. S. Fadl M. I. Elsadek M. S. Mohamed M. A. Mostafa M. A. Hassan M. A. Halema O. M. Exploring the potential of intranasally administered\nnaturally occurring quercetin loaded into polymeric nanocapsules as\na novel platform for the treatment of anxiety Sci. Rep. 2023 8 510 10.1038/s41598-023-27665-6 PMC9831377 36627363 Frozza R. L. Bernardi A. Paese K. Hoppe J. B. Silva T. D. Battastini A. M. Pohlmann A. R. Guterres S. S. Salbego C. Characterization\nof trans-resveratrol-loaded lipid-core nanocapsules and tissue distribution\nstudies in rats Journal of Biomedical Nanotechnology 2010 6 694 703 10.1166/jbn.2010.1161 21361135 Seremeta K. P. Chiappetta D. A. Sosnik A. Poly (ε-caprolactone), Eudragit®\nRS 100 and poly (ε-caprolactone)/Eudragit® RS 100 blend\nsubmicron particles for the sustained release of the antiretroviral\nefavirenz Colloids Surf., B 2013 102 441 449 10.1016/j.colsurfb.2012.06.038 23010128 Hamed K. M. Dighriri I. M. Baomar A. F. Alharthy B. T. Alenazi F. E. Alali G. H. Alenazy R. H. Alhumaidi N. T. Alhulayfi D. H. Alotaibi Y. B. Alhumaidan S. S. Alhaddad Z. A. Humadi A. A. Alzahrani S. A. Alobaid R. H. Overview of methotrexate toxicity: a comprehensive\nliterature review Cureus 2022 14 9 e29518 10.7759/cureus.29518 36312688 PMC9595261 Brilland B. Boud'hors C. Wacrenier S. Blanchard S. Cayon J. Blanchet O. Piccoli G. B. Henry N. Djema A. Coindre J. P. Jeannin P. Delneste Y. Copin M. C. Augusto J. F. Kidney injury molecule\n1 (KIM-1):\nA potential biomarker of acute kidney injury and tubulointerstitial\ninjury in patients with ANCA-glomerulonephritis Clin. Kidney J. 2023 16 9 1521 1533 10.1093/ckj/sfad071 37664565 PMC10468750 Arab H. H. Salama S. A. Maghrabi I. A. Camel milk attenuates methotrexate-induced\nkidney injury via activation of PI3K/Akt/eNOS signaling and intervention\nwith oxidative aberrations Food & function 2018 9 5 2661 2672 10.1039/C8FO00131F 29667662 Mahmoud A.\nM. Germoush M. O. Al-Anazi K. M. Mahmoud A. H. Farah M. A. Allam A. A. Commiphora\nmolmol protects against methotrexate-induced\nnephrotoxicity by up-regulating Nrf2/ARE/HO-1 signaling Biomedicine & Pharmacotherapy 2018 106 499 509 10.1016/j.biopha.2018.06.171 29990838 Aldossary S. A. Chohan M. S. Rasool S. T. Capsaicin ameliorate\nthe nephrotoxicity induced by methotrexate Pakistan J. Pharm. Sci. 2021 34 6 35034880 Satta S. Mahmoud A. M. Wilkinson F. L. Yvonne Alexander M. White S. J. Hrelia S. The role of Nrf2 in\ncardiovascular\nfunction and disease Oxid. Med. Cell. Longevity 2017 2017 1 9237263 10.1155/2017/9237263 PMC5618775 29104732 Liu M. Grigoryev D. N. Crow M. T. Haas M. Yamamoto M. Reddy S. P. Rabb H. Transcription factor Nrf2 is protective\nduring ischemic and nephrotoxic acute kidney injury in mice Kidney international 2009 76 3 277 285 10.1038/ki.2009.157 19436334 Mahmoud A. M. Hussein O. E. Abd El-Twab S. M. Hozayen W. G. Ferulic acid protects\nagainst methotrexate nephrotoxicity via activation of Nrf2/ARE/HO-1\nsignaling and PPARγ, and suppression of NF-κB/NLRP3 inflammasome\naxis Food & Function 2019 10 8 4593 4607 10.1039/C9FO00114J 31289794 Leaf I. A. Nakagawa S. Johnson B. G. Cha J. J. Mittelsteadt K. Guckian K. M. Gomez I. G. Altemeier W. A. Duffield J. S. Pericyte MyD88 and IRAK4 control\ninflammatory and fibrotic\nresponses to tissue injury J. Clin. Invest. 2017 127 1 321 334 10.1172/JCI87532 27869651 PMC5199713 Creagh E.\nM. O’Neill L. A. J. TLRs,\nNLRs and RLRs: a trinity of pathogen sensors\nthat co-operate in innate immunity Trends in\nimmunology 2006 27 8 352 357 10.1016/j.it.2006.06.003 16807108 Zhang J. Liu H. Song C. Zhang J. Wang Y. Lv C. Song X. Astilbin ameliorates\npulmonary fibrosis via blockade of Hedgehog\nsignaling pathway Pulmonary pharmacology &\ntherapeutics 2018 50 19 27 10.1016/j.pupt.2018.03.006 29621624 Wu H. Chen G. Wyburn K. R. Yin J. Bertolino P. Eris J. M. Alexander S. I. Sharland A. F. Chadban S. J. TLR4 activation\nmediates kidney ischemia/reperfusion injury J. Clin. Invest. 2007 117 10 2847 2859 10.1172/JCI31008 17853945 PMC1974864 Latz E. Xiao T. S. Stutz A. Activation\nand regulation of the\ninflammasomes Nature Reviews Immunology 2013 13 6 397 411 10.1038/nri3452 PMC3807999 23702978 Fink S. L. Cookson B. T. Apoptosis, pyroptosis,\nand necrosis: mechanistic description\nof dead and dying eukaryotic cells Infection\nand immunity 2005 73 4 1907 1916 10.1128/IAI.73.4.1907-1916.2005 15784530 PMC1087413 Mahmoud A. M. Ahmed O. M. Galaly S. R. Thymoquinone\nand curcumin attenuate\ngentamicin-induced renal oxidative stress, inflammation and apoptosis\nin rats EXCLI J. 2014 13 98 26417245 PMC4464512 Mahmoud A. M. Abdella E. M. El-Derby A. M. Abdella E. M. Protective Effects\nof Turbinaria ornata and Padina pavonia against Azoxymethane-Induced\nColon Carcinogenesis through Modulation of PPAR Gamma, NF-κB\nand Oxidative Stress Phytotherapy Research 2015 29 5 737 748 10.1002/ptr.5310 25676613 Kang H. G. Lee H. K. Cho K. B. Park S. I. A review of natural\nproducts for prevention of acute kidney injury Medicina 2021 57 11 1266 10.3390/medicina57111266 34833485 PMC8623373 Platzer M. Kiese S. Tybussek T. Herfellner T. Schneider F. Schweiggert-Weisz U. Eisner P. Radical scavenging\nmechanisms of phenolic compounds: A quantitative structure-property\nrelationship (QSPR) study Frontiers in nutrition 2022 9 882458 10.3389/fnut.2022.882458 35445057 PMC9013829 Ahmadvand H. Yalameha B. Adibhesami G. Nasri M. Naderi N. Babaeenezhad E. Nouryazdan N. The protective role of gallic acid\npretreatment on renal ischemia-reperfusion injury in rats Rep. Biochem. Mol. Biol. 2019 8 1 42 31334287 PMC6590945 Seo D. Y. Lee S. R. Heo J.-W. No M.-H. Rhee B. D. Ko K. S. Kwak H.-B. Han J. Ursolic acid in health\nand disease Korean journal of physiology &\npharmacology: official journal of the Korean Physiological Society\nand the Korean Society of Pharmacology 2018 22 3 235 10.4196/kjpp.2018.22.3.235 PMC5928337 29719446 Yang A. Y. Choi H. J. Kim K. Leem J. Antioxidant,\nantiapoptotic,\nand anti-inflammatory effects of hesperetin in a mouse model of lipopolysaccharide-induced\nacute kidney injury Molecules 2023 28 6 2759 10.3390/molecules28062759 36985731 PMC10057564 Hashemzaei M. Far A. D. Yari A. Heravi R. E. Tabrizian K. Taghdisi S. M. Sadegh S. E. Tsarouhas K. Kouretas D. Tzanakakis G. Nikitovic D. Anisimov N. Y. Spandidos D. A. Tsatsakis A. M. Rezaee R. Anticancer and apoptosis-inducing\neffects of quercetin\nin vitro and in vivo Oncology reports 2017 38 2 819 828 10.3892/or.2017.5766 28677813 PMC5561933 Alam M. M. Abdullah K. M. Singh B. R. Naqvi A. H. Naseem I. Ameliorative\neffect of quercetin nanorods on diabetic mice: mechanistic and therapeutic\nstrategies RSC Adv. 2016 6 60 55092 55103 10.1039/C6RA04821H Yu H. Lin T. Chen W. Cao W. Zhang C. Wang T. Ding M. Zhao S. Wei H. Guo H. Zhao X. Size and temporal-dependent efficacy\nof oltipraz-loaded PLGA nanoparticles\nfor treatment of acute kidney injury and fibrosis Biomaterials 2019 219 119368 10.1016/j.biomaterials.2019.119368 31349200 Liu G. W. Pippin J. W. Eng D. G. Lv S. Shankland S. J. Pun S. H. Nanoparticles exhibit greater accumulation\nin kidney\nglomeruli during experimental glomerular kidney disease Physiol. Rep. 2020 8 15 e14545 10.14814/phy2.14545 32786069 PMC7422806 Isoda K. Tanaka A. Fuzimori C. Echigoya M. Taira Y. Taira I. Shimizu Y. Akimoto Y. Kawakami H. Ishida I. Toxicity of gold nanoparticles in mice due to nanoparticle/drug\ninteraction induces acute kidney damage Nanoscale\nRes. Lett. 2020 15 1 141 10.1186/s11671-020-03371-4 32617798 PMC7332653 Aldawsari M. F. Alkholifi F. K. Foudah A. I. Alqarni M. H. Alam A. Salkini M. A. Sweilam S. H. Gallic-acid-loaded PLGA nanoparticles:\na promising transdermal drug delivery system with antioxidant and\nantimicrobial agents Pharmaceuticals 2023 16 8 1090 10.3390/ph16081090 37631005 PMC10459217 Mahboob T. Nawaz M. de Lourdes\nPereira M. Tian-Chye T. Samudi C. Sekaran S. D. Wiart C. Nissapatorn V. PLGA nanoparticles\nloaded with Gallic acid-a constituent of Leea indica against Acanthamoeba\ntriangularis Sci. Rep. 2020 10 1 8954 10.1038/s41598-020-65728-0 32488154 PMC7265533 Nassar T. Rom A. Nyska A. Benita S. Novel double\ncoated nanocapsules\nfor intestinal delivery and enhanced oral bioavailability of tacrolimus,\na P-gp substrate drug Journal of controlled\nrelease 2009 133 1 77 84 10.1016/j.jconrel.2008.08.021 18822327 Bulcão R. P. de Freitas F. A. Dallegrave E. Venturini C. G. Baierle M. Durgante J. Sauer E. Cassini C. Cerski C. T. Zielinsky P. Salvador M. Pohlmann A. R. Guterres S. S. Garcia S. C. In vivo\ntoxicological evaluation\nof polymeric nanocapsules after intradermal administration Eur. J. Pharm. Biopharm. 2014 86 2 167 177 10.1016/j.ejpb.2013.04.001 23643792 Hu Q.-H. Zhang X. Pan Y. Li Y.-C. Kong L.-D. Allopurinol,\nquercetin and rutin ameliorate renal NLRP3 inflammasome activation\nand lipid accumulation in fructose-fed rats Biochemical pharmacology 2012 84 1 113 125 10.1016/j.bcp.2012.03.005 22426011 Zhang Z. Zhang H. Chen R. Wang Z. Oral supplementation\nwith ursolic acid ameliorates sepsis-induced acute kidney injury in\na mouse model by inhibiting oxidative stress and inflammatory responses Mol. Med. Rep. 2018 17 5 7142 7148 10.3892/mmr.2018.8767 29568928 PMC5928665 Zhu C. Dong Y. Liu H. Ren H. Cui Z. Hesperetin\nprotects against H2O2-triggered oxidative damage via upregulation\nof the Keap1-Nrf2/HO-1 signal pathway in ARPE-19 cells Biomedicine & Pharmacotherapy 2017 88 124 133 10.1016/j.biopha.2016.11.089 28103505 Tschopp J. Schroder K. NLRP3 inflammasome\nactivation: the convergence of multiple\nsignalling pathways on ROS production? Nature\nreviews immunology 2010 10 3 210 215 10.1038/nri2725 20168318 Hou Y. Wang Y. He Q. Li L. Xie H. Zhao Y. Zhao J. Nrf2 inhibits NLRP3 inflammasome\nactivation through regulating Trx1/TXNIP complex in cerebral ischemia\nreperfusion injury Behavioural brain research 2018 336 32 39 10.1016/j.bbr.2017.06.027 28851669 Mestas J. Hughes C. C. W. Of mice and not\nmen: differences between mouse and\nhuman immunology J. Immunol. 2004 172 5 2731 2738 10.4049/jimmunol.172.5.2731 14978070 Seok J. Warren H. S. Cuenca A. G. Mindrinos M. N. Baker H. V. Xu W. Richards D. R. McDonald-Smith G. P. Gao H. Hennessy L. Genomic responses in mouse models poorly mimic human\ninflammatory diseases Proc. Natl. Acad. Sci.\nU. S. A. 2013 110 9 3507 3512 10.1073/pnas.1222878110 23401516 PMC3587220 van\nder Worp H. B. Howells D. W. Sena E. S. Porritt M. J. Rewell S. O’Collins V. Macleod M. R. Can animal models\nof disease reliably inform human studies? PLoS\nmedicine 2010 7 3 e1000245 10.1371/journal.pmed.1000245 20361020 PMC2846855 Abdel-Hamed A. R. Mehanna E. T. Hazem R. M. Badr J. M. Abo-Elmatty D. M. Abdel-Kader M. S. Goda M. S. Plicosepalus acacia\nextract and its\nmajor constituents, methyl gallate and quercetin, potentiate therapeutic\nangiogenesis in diabetic hind limb ischemia: HPTLC quantification\nand LC-MS/MS metabolic profiling Antioxidants 2021 10 11 1701 10.3390/antiox10111701 34829572 PMC8614836 Miladi K. Sfar S. Fessi H. Elaissari A. Encapsulation\nof alendronate sodium by nanoprecipitation and double emulsion: From\npreparation to in vitro studies Industrial\ncrops and products 2015 72 24 33 10.1016/j.indcrop.2015.01.079 Mahmoud K. Y. Ezzeldeen Y. N. Nasr A. A. Ghonim M. O. Ibrahim M. W. Ali M. G. Helmi M. A. Mostafa N. A. Abdelaziz N. T. Elmohandes N. N. Mahmoud Y. H. Swidan S. A. Silibinin-loaded\ncubosomes: a gateway to enhanced hepatoprotective activity Future J. Pharm. Sci. 2025 11 1 79 10.1186/s43094-025-00828-0 Najafi G. Atashfaraz E. Farokhi F. Attenuation of methotrexate-induced\nembryotoxicity and oxidative stress by ethyl pyruvate Int. J. Fertility Sterility 2016 10 2 232 10.22074/ijfs.2016.4914 PMC4948076 27441057 Khodeer D. M. Nasr A. M. Swidan S. A. Shabayek S. Khinkar R. M. Aldurdunji M. M. Ramadan M. A. Badr J. M. Characterization,\nantibacterial, antioxidant, antidiabetic, and anti-inflammatory activities\nof green synthesized silver nanoparticles using Phragmanthera\naustroarabica Front. Microbiol. 2023 13 1078061 10.3389/fmicb.2022.1078061 36687608 PMC9849905 Dehghani M. A. Shakiba Maram N. Moghimipour E. Khorsandi L. Atefi khah M. Mahdavinia M. Protective effect of gallic acid\nand gallic acid-loaded Eudragit-RS 100 nanoparticles on cisplatin-induced\nmitochondrial dysfunction and inflammation in rat kidney Biochim. Biophys. Acta, Mol. Basis Dis. 2020 1866 12 165911 10.1016/j.bbadis.2020.165911 32768679 Cardiff R. D. Miller C. H. Munn R. J. Manual\nhematoxylin and eosin staining\nof mouse tissue sections Cold Spring Harbor\nProtocols 2014 2014 6 pdb-prot073411 10.1101/pdb.prot073411 24890205 Medeiros P. J. d. Villarim Neto A. Lima F. P. Azevedo Í. M. Leão L. R. d. S. Medeiros A. C. Effect of sildenafil\nin renal ischemia/reperfusion injury in rats Acta cirurgica brasileira 2010 25 490 495 10.1590/S0102-86502010000600006 21120279 ",
  "metadata": {
    "Title of this paper": "Effect of sildenafil\nin renal ischemia/reperfusion injury in rats",
    "Journal it was published in:": "ACS Omega",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12461432/"
  }
}