{
  "title": "Paper_1249",
  "abstract": "pmc Life (Basel) Life (Basel) 2582 life life Life 2075-1729 Multidisciplinary Digital Publishing Institute  (MDPI) PMC12471328 PMC12471328.1 12471328 12471328 41010347 10.3390/life15091404 life-15-01404 1 Review Ultrasound-Guided Interventions for Neuropathic Pain: A Narrative Pictorial Review Lin Ting-Yu 1 2 https://orcid.org/0000-0002-7558-5651 Chang Ke-Vin 3 4 5 * https://orcid.org/0000-0001-7511-9629 Wu Wei-Ting 3 4 https://orcid.org/0000-0002-7203-3325 Mezian Kamal 6 https://orcid.org/0000-0003-2576-2039 Ricci Vincenzo 7 https://orcid.org/0000-0002-2713-4071 Özçakar Levent 8 Valeriani Massimiliano Academic Editor Zanghi Antonino Academic Editor 1 t840326@icloud.com 2 3 wwtaustin@yahoo.com.tw 4 5 6 kamal.mezian@gmail.com 7 vincenzo.ricci58@gmail.com 8 lozcakar@yahoo.com * kvchang011@gmail.com 05 9 2025 9 2025 15 9 497651 1404 12 8 2025 27 8 2025 02 9 2025 05 09 2025 27 09 2025 29 09 2025 © 2025 by the authors. 2025 https://creativecommons.org/licenses/by/4.0/ Licensee MDPI, Basel, Switzerland. This article is an open access article distributed under the terms and conditions of the Creative Commons Attribution (CC BY) license ( https://creativecommons.org/licenses/by/4.0/ Neuropathic pain presents a persistent therapeutic challenge, arising from diverse etiologies such as trigeminal neuralgia, postherpetic neuralgia, post-amputation pain, painful polyneuropathy, peripheral nerve injury pain, and painful radiculopathy. Given the limitations and side effects associated with pharmacologic treatments, interest in interventional therapies has surged. Herein, ultrasound guidance provides real-time, radiation-free visualization that enhances procedural accuracy and safety. This narrative review synthesizes current evidence on ultrasound-guided techniques—including nerve blocks, pulsed radiofrequency, hydrodissection, and peripheral nerve stimulation—in the management of neuropathic pain. These minimally invasive approaches demonstrate potential in providing significant and durable pain relief, enhancing functional outcomes, and reducing reliance on systemic medications. Notably, much of the existing literature comprises small-scale or observational studies and larger randomized controlled trials are therefore essential to confirm efficacy, define optimal treatment parameters, and inform clinical guidelines for broader adoption. ultrasound sonography injection chronic pain nerve block National Taiwan University Hospital, Bei-Hu Branch the Ministry of Science and Technology, Taiwan MOST 106-2314-B-002-180-MY3 MOST 109-2314-B-002-114-MY3 National Science and Technology, Taiwan NSTC 112-2314-B-002-134 NSTC 113-2314-B-002-208-MY2 NSTC 113-2314-B-002-209-MY2 NSTC 114-2923-B-002-002-MY3 This study was funded by the National Taiwan University Hospital, Bei-Hu Branch; the Ministry of Science and Technology, Taiwan (MOST 106-2314-B-002-180-MY3 and MOST 109-2314-B-002-114-MY3); and National Science and Technology, Taiwan (NSTC 112-2314-B-002-134, NSTC 113-2314-B-002-208-MY2, NSTC 113-2314-B-002-209-MY2 and NSTC 114-2923-B-002-002-MY3). pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement no pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes 1. Introduction Neuropathic pain is pain resulting from a lesion or dysfunction within the somatosensory nervous system which extends from peripheral receptors located in the skin, muscles, and joints, to central pathways involving the spinal cord and higher cortical processing centers in the brain [ 1 2 3 4 3 5 5 6 7 3 2 8 9 10 Pain control remains the primary goal of treatment for neuropathic pain, as the original culprit is usually difficult to eliminate. First-line pharmacologic therapies include pregabalin, gabapentin, duloxetine, and tricyclic antidepressants [ 11 1 Ultrasound is a widely utilized therapeutic and diagnostic tool. Therapeutic ultrasound has been shown to reduce neuropathic pain by modulating neurotransmission and inflammatory pathways, and it may even facilitate nerve regeneration [ 12 13 14 15 16 17 2. Literature Search A systematic literature search was performed across four electronic databases—PubMed, Web of Science, Embase, and the Cochrane Library—from their inception to 26 July 2025. The search strategy incorporated the following keywords: “ultrasound-guided”, “ultrasound”, “sonography”, “nerve”, “neuropathic pain”, “neuropathy”, and “neuralgia”. Studies were eligible for inclusion if they (1) involved human subjects and (2) evaluated or introduced the use of ultrasound-guided interventions for the treatment of neuropathic pain. Studies were excluded if they focused solely on diagnostic ultrasound applications or used animal models. Previous reviews have classified neuropathic pain into central and peripheral types; with the latter category further divided into trigeminal neuralgia, postherpetic neuralgia, post-amputation pain, painful polyneuropathy, peripheral nerve injury pain, and painful radiculopathy [ 1 18 3. Trigeminal Neuralgia Trigeminal neuralgia presents as unilateral, paroxysmal facial pain in one or more divisions of the trigeminal nerve, often triggered by innocuous stimuli [ 19 20 21 22 Injection techniques to the various branches of the trigeminal nerve have been described [ 23 Figure 1 Figure 1 Figure 1 For maxillary nerve blockade, the patient is placed in the lateral decubitus position with the affected side facing up. A curvilinear transducer is placed parallel to the zygomatic arch to visualize the lateral pterygoid muscle and the lateral pterygoid plate of the sphenoid bone ( Figure 2 Figure 2 4. Postherpetic Neuralgia Postherpetic neuralgia is a chronic complication of herpes zoster. It occurs in up to one-third of patients, with the incidence increasing markedly with age [ 24 25 26 Several studies have found that epidural corticosteroid injections combined with local anesthetics significantly reduced visual analog scale (VAS) scores in both acute and chronic herpes zoster [ 27 28 29 Figure 3 30 Paravertebral injections appear to carry a higher risk of complications, with reported adverse events including dizziness, drowsiness, and localized pain at the injection site. Deng et al. [ 31 Figure 4 Figure 4 A case report illustrated selective cervical nerve root block at the C5 ( Figure 5 Figure 5 32 33 Figure 6 34 35 Some investigations have employed ultrasound- or fluoroscopy-guided pulsed radiofrequency (PRF) of the dorsal root ganglion for postherpetic neuralgia, demonstrating superior analgesic outcomes compared to pharmacologic therapy alone [ 36 37 38 39 PRF could also be applied for facial postherpetic neuralgia. In the case report by Lim et al. [ 40 41 42 In a case report, a man with refractory left facial postherpetic neuralgia received supraorbital peripheral nerve stimulation via an electrode implanted under combined ultrasound and fluoroscopy guidance [ 43 5. Post-Amputation/Mastectomy Pain Pain among amputees is both prevalent and multifactorial. Contributing factors include poor circulation, skin breakdown, surgical wounds, and poorly fitted prosthetics. Neuropathic pain is also a major concern in this population and may manifest as neuroma-related pain or phantom limb pain. Neuromas are formed due to abnormal nerve regeneration after a peripheral nerve is transected or by repetitive irritation. Clinically, they present as small, tender, palpable masses associated with numbness, tingling, or localized sharp pain. Ultrasound enables their identification, and by rotating the transducer, the proximal trajectory of the parent nerve can often be traced, aiding in accurate localization. Ultrasound is also helpful in arranging perineural injections. In one study, ultrasound-guided corticosteroid injections were given to neuromas in 14 lower limb amputees, and 50% of them had successful results (>50% reduction in pain) [ 44 45 46 47 46 Phantom limb pain refers to painful sensations perceived in the missing body part. Its pathophysiology is believed to arise from maladaptive central and peripheral neural plasticity, including cortical reorganization and spinal sensitization [ 48 49 50 In a randomized, double-blind, placebo-controlled trial, peripheral nerve stimulation was compared with sham stimulation in 28 lower-extremity amputees with chronic neuropathic pain [ 51 Likewise, patients undergoing mastectomy may experience neuropathic pain due to intercostobrachial nerve injury, intercostal cutaneous branch neuromas, or phantom breast pain [ 52 Figure 7 53 54 55 6. Painful Polyneuropathy and Peripheral Nerve Injury Pain There are many causes of painful neuropathy, e.g., diabetes, infections, alcoholism, renal disease, connective tissue disorders, inherited neuropathies, toxic exposures, nerve injuries, etc. As of now, ultrasound-guided intervention is infrequently reported as an adjuvant/alternative treatment option in these scenarios. Diabetes is the leading cause of peripheral neuropathy, with most patients developing this complication over time. The most prevalent form is distal symmetrical polyneuropathy, characterized by progressive sensory loss starting from the distal lower extremities, although other patterns may also occur [ 56 Figure 8 33 57 58 Figure 9 Figure 9 Figure 9 Ultrasound plays a valuable role in both diagnosing the origin and guiding the treatment of peripheral neuropathic pain by enabling precise assessment of the injury’s location, extent, and severity. Wang et al. [ 59 Figure 10 60 61 62 63 7. Painful Radiculopathy Radiculopathy presents as pain, tingling, clumsiness, and even weakness in the distribution of the affected nerve root. Conservative management includes patient education, manual therapy, exercise, medications such as paracetamol, non-steroidal anti-inflammatory drugs, short-term opioids, and cervical traction [ 64 65 66 67 68 Pararadicular spinal blocks target a single nerve root at a time—hence the term “selective nerve root block”—and are less invasive than epidural injections. Some studies suggest that it may offer similar efficacy to transforaminal epidural injection in relieving pain and improving function in patients with cervical radiculopathy [ 69 70 71 Wang et al. [ 72 73 74 Figure 11 75 76 77 77 8. Discussion This narrative review compiles ultrasound-guided interventions for neuropathic pain and presents high-resolution sonographic figures to highlight key procedural techniques ( Table 1 The majority of current guidelines for neuropathic pain place emphasis on stepwise pharmacological therapy [ 78 79 80 81 82 83 84 82 81 81 Ultrasound guidance may offer certain several benefits over fluoroscopy, though both techniques have distinct roles. First, fluoroscopy-guided procedures require repeated use of X-ray imaging and contrast dye injections to confirm instrument placement. The mean radiation exposure was calculated as 5.6 mGy for cervical transforaminal injections and 10.4 mGy for lumbar transforaminal injections [ 85 86 87 88 85 89 90 91 92 51 93 94 Neuropathic pain is a challenging clinical conundrum, due in part to its complicated pathophysiology and in part to the frequent overlap with non-neuropathic pain syndromes. Translational research is further hindered by the limited applicability of animal models to effective human treatment. Only 30–40% of patients achieved adequate response compared with placebo [ 95 11 96 97 98 99 99 100 The precise mechanism by which PRF alleviates pain is still incompletely understood. Typical regimens use a frequency of 2 to 5 Hz and a pulse width of 5 to 20 ms, delivered for 240 to 360 s, with the electrode tip temperature kept below 42 °C. PRF could enhance noradrenergic and serotonergic descending pain inhibitory pathways, down-regulate excitatory C-fiber activity, and suppress pro-inflammatory cytokines like tumor necrosis factor-α and interleukin-6 [ 101 102 103 104 104 105 This review is not free from limitations. First, the included studies showed substantial heterogeneity in patient selection, procedural techniques, and injectate formulations. Second, follow-up was generally limited to 3–6 months, and data on long-term outcomes are lacking. Third, many studies were retrospective in design or consisted of case reports and small series. Even among randomized controlled trials, the absence of double-blinding often introduced a huge risk of bias. Furthermore, few studies documented the use of optimal pharmacologic therapy in enrolled participants, and no head-to-head comparisons were conducted. Lastly, due to the inherent nature of narrative reviews, formal quality assessments of included studies were not performed, rendering the synthesis susceptible to subjective interpretation. Future progress will depend on the development of standardized protocols, informed by multicenter studies, expert recommendations, and robust trial design, to ensure stronger evidence and broader clinical uptake. 9. Conclusions Ultrasound-guided, minimally invasive interventions have demonstrated potential in alleviating various forms of neuropathic pain. With advancing technology and growing knowledge of the field, these techniques may play an increasingly important role in pain management. However, current evidence remains insufficient to establish standardized algorithms, and further research is needed to validate their efficacy and compare them with conventional treatments. Disclaimer/Publisher’s Note: Author Contributions Conceptualization, T.-Y.L. and K.-V.C.; methodology, K.-V.C.; software, K.M. and V.R.; validation, K.M. and T.-Y.L.; writing—original draft preparation, T.-Y.L. and W.-T.W.; writing—review and editing, K.-V.C. and L.Ö.; funding acquisition, K.-V.C. All authors have read and agreed to the published version of the manuscript. Institutional Review Board Statement Not applicable. Informed Consent Statement Not applicable. Data Availability Statement No new data were created or analyzed in this study. Data sharing is not applicable to this article. Conflicts of Interest Author Ting-Yu Lin was employed by the company “Department of Physical Medicine and Rehabilitation, Lo-Hsu Medical Foundation, Inc., Lotung Poh-Ai Hospital”. The remaining authors declare that the research was conducted in the absence of any commercial or financial relationships that could be construed as a potential conflict of interest. References 1. Colloca L. Ludman T. Bouhassira D. Baron R. Dickenson A.H. Yarnitsky D. Freeman R. Truini A. Attal N. Finnerup N.B. Neuropathic pain Nat. Rev. Dis. Primers 2017 3 1 19 10.1038/nrdp.2017.2 28205574 PMC5371025 2. Finnerup N.B. Kuner R. Jensen T.S. Neuropathic pain: From mechanisms to treatment Physiol. Rev. 2021 101 259 301 10.1152/physrev.00045.2019 32584191 3. Gierthmühlen J. Baron R. Neuropathic pain Semin. Neurol. 2016 36 462 468 27704502 10.1055/s-0036-1584950 4. Cohen S.P. Mao J. Neuropathic pain: Mechanisms and their clinical implications BMJ 2014 348 f7656 10.1136/bmj.f7656 24500412 5. Meacham K. Shepherd A. Mohapatra D.P. Haroutounian S. Neuropathic pain: Central vs. peripheral mechanisms Curr. Pain Headache Rep. 2017 21 28 10.1007/s11916-017-0629-5 28432601 6. Ossipov M.H. Dussor G.O. Porreca F. Central modulation of pain J. Clin. Investig. 2010 120 3779 3787 10.1172/JCI43766 21041960 PMC2964993 7. Rosner J. de Andrade D.C. Davis K.D. Gustin S.M. Kramer J.L.K. Seal R.P. Finnerup N.B. Central neuropathic pain Nat. Rev. Dis. Primers 2023 9 73 10.1038/s41572-023-00484-9 38129427 PMC11329872 8. Attal N. Bouhassira D. Baron R. Diagnosis and assessment of neuropathic pain through questionnaires Lancet Neurol. 2018 17 456 466 10.1016/S1474-4422(18)30071-1 29598922 9. Bouhassira D. Lantéri-Minet M. Attal N. Laurent B. Touboul C. Prevalence of chronic pain with neuropathic characteristics in the general population Pain 2008 136 380 387 10.1016/j.pain.2007.08.013 17888574 10. Freynhagen R. Baron R. Tölle T. Stemmler E. Gockel U. Stevens M. Maier C. Screening of neuropathic pain components in patients with chronic back pain associated with nerve root compression: A prospective observational pilot study (MIPORT) Curr. Med. Res. Opin. 2006 22 529 537 10.1185/030079906X89874 16574036 11. Attal N. Bouhassira D. Colvin L. Advances and challenges in neuropathic pain: A narrative review and future directions Br. J. Anaesth. 2023 131 79 92 10.1016/j.bja.2023.04.021 37210279 12. Pérez-Neri I. González-Aguilar A. Sandoval H. Pineda C. Ríos C. Therapeutic potential of ultrasound neuromodulation in decreasing neuropathic pain: Clinical and experimental evidence Curr. Neuropharmacol. 2021 19 334 348 10.2174/1570159X18666200720175253 32691714 PMC8033967 13. Haffey P.R. Bansal N. Kaye E. Ottestad E. Aiyer R. Noori S. Gulati A. The regenerative potential of therapeutic ultrasound on neural tissue: A pragmatic review Pain Med. 2020 21 1494 1506 10.1093/pm/pnaa090 32626904 14. Chang K.-V. Lin C.-P. Lin C.-S. Wu W.-T. Karmakar M.K. Özçakar L. Sonographic tracking of trunk nerves: Essential for ultrasound-guided pain management and research J. Pain Res. 2017 10 79 88 10.2147/JPR.S123828 28115867 PMC5222601 15. Wu C.H. Chang K.V. Özçakar L. Hsiao M.Y. Hung C.Y. Shyu S.G. Wang T.G. Chen W.S. Sonographic tracking of the upper limb peripheral nerves: A pictorial essay and video demonstration Am. J. Phys. Med. Rehabil. 2015 94 740 747 10.1097/PHM.0000000000000344 26135374 16. Hung C.-Y. Hsiao M.-Y. Özçakar L. Chang K.-V. Wu C.-H. Wang T.-G. Chen W.-S. Sonographic tracking of the lower limb peripheral nerves: A pictorial essay and video demonstration Am. J. Phys. Med. Rehabil. 2016 95 698 708 10.1097/PHM.0000000000000463 26945217 17. Shen P.-C. Lin T.-Y. Wu W.-T. Özçakar L. Chang K.-V. Comparison of Ultrasound-vs Landmark-Guided Injections For Musculoskeletal Pain: An Umbrella Review J. Rehabil. Med. 2024 56 40769 10.2340/jrm.v56.40769 39185547 PMC11367678 18. Scholz J. Finnerup N.B. Attal N. Aziz Q. Baron R. Bennett M.I. Benoliel R. Cohen M. Cruccu G. Davis K.D. The IASP classification of chronic pain for ICD-11: Chronic neuropathic pain Pain 2019 160 53 59 10.1097/j.pain.0000000000001365 30586071 PMC6310153 19. Maarbjerg S. Di Stefano G. Bendtsen L. Cruccu G. Trigeminal neuralgia—Diagnosis and treatment Cephalalgia 2017 37 648 657 10.1177/0333102416687280 28076964 20. Maarbjerg S. Wolfram F. Gozalov A. Olesen J. Bendtsen L. Significance of neurovascular contact in classical trigeminal neuralgia Brain 2014 138 311 319 10.1093/brain/awu349 25541189 21. Lambru G. Zakrzewska J. Matharu M. Trigeminal neuralgia: A practical guide Pract. Neurol. 2021 21 392 402 10.1136/practneurol-2020-002782 34108244 PMC8461413 22. Nader A. Kendall M.C. DeOliveria G.S. Chen J.Q. Vanderby B. Rosenow J.M. Bendok B.R. Ultrasound-guided trigeminal nerve block via the pterygopalatine fossa: An effective treatment for trigeminal neuralgia and atypical facial pain Pain Physician 2013 16 E537 10.36076/ppj.2013/16/e537 24077204 23. Allam A.E. Khalil A.A.F. Eltawab B.A. Wu W.T. Chang K.V. Ultrasound-Guided Intervention for Treatment of Trigeminal Neuralgia: An Updated Review of Anatomy and Techniques Pain Res. Manag. 2018 2018 5480728 10.1155/2018/5480728 29808105 PMC5902000 24. Johnson R.W. Rice A.S.C. Postherpetic Neuralgia N. Engl. J. Med. 2014 371 1526 1533 10.1056/NEJMcp1403062 25317872 25. Forbes H.J. Thomas S.L. Smeeth L. Clayton T. Farmer R. Bhaskaran K. Langan S.M. A systematic review and meta-analysis of risk factors for postherpetic neuralgia Pain 2016 157 30 54 10.1097/j.pain.0000000000000307 26218719 PMC4685754 26. Kim H.J. Ahn H.S. Lee J.Y. Choi S.S. Cheong Y.S. Kwon K. Yoon S.H. Leem J.G. Effects of applying nerve blocks to prevent postherpetic neuralgia in patients with acute herpes zoster: A systematic review and meta-analysis Korean J. Pain 2017 30 3 17 10.3344/kjp.2017.30.1.3 28119767 PMC5256258 27. Kikuchi A. Kotani N. Sato T. Takamura K. Sakai I. Matsuki A. Comparative therapeutic evaluation of intrathecal versus epidural methylprednisolone for long-term analgesia in patients with intractable postherpetic neuralgia Reg. Anesth. Pain Med. 1999 24 287 293 10.1136/rapm-00115550-199924040-00003 10445766 28. Kotani N. Kushikata T. Hashimoto H. Kimura F. Muraoka M. Yodono M. Asai M. Matsuki A. Intrathecal methylprednisolone for intractable postherpetic neuralgia N. Engl. J. Med. 2000 343 1514 1519 10.1056/NEJM200011233432102 11087880 29. Kim E.D. Lee Y.I. Park H.J. Comparison of efficacy of continuous epidural block and pulsed radiofrequency to the dorsal root ganglion for management of pain persisting beyond the acute phase of herpes zoster PLoS ONE 2017 12 e0183559 10.1371/journal.pone.0183559 28827823 PMC5565119 30. Chuang C.M. Lin C.R. Hsieh Y.L. Nerve Block Efficacy and Safety for Acute Thoracic Herpes Zoster: A Systematic Review and Meta-analysis Pain Physician 2025 28 83 96 10.36076/ppj.2025.28.83 40168557 31. Deng A. Chen Z. Lin S. Zhou Y. He L. Ultrasound-guided thoracic paravertebral block using paraventricular oblique sagittal (POS) approach for the treatment of acute herpes zoster: A two-blind randomized controlled trial Pain Ther. 2023 12 797 809 10.1007/s40122-023-00504-2 37043111 PMC10199997 32. Chang K.-V. Lin C.-P. Wu W.-T. Özçakar L. Ultrasound-Guided Selective Cervical Root Injection for Postherpetic Neuralgia Am. J. Phys. Med. Rehabil. 2017 96 e189 e190 10.1097/PHM.0000000000000731 28346307 33. Moon Y.E. Choi J.H. Park H.J. Park J.H. Kim J.H. Ultrasound-Guided Nerve Block with Botulinum Toxin Type A for Intractable Neuropathic Pain Toxins 2016 8 18 10.3390/toxins8010018 26761032 PMC4728540 34. Zheng C. Xie Y. Li H. Zhang B. Chen S. Han W. Liu J. Geng Y. Zhang Y. Wang Z. Effectiveness and safety of stellate ganglion block with trioxygen autologous blood retransfusion therapy for facial postherpetic neuralgia in elderly patients Sci. Rep. 2025 15 8025 10.1038/s41598-025-91847-7 40055398 PMC11889258 35. Wang C. Yuan F. Cai L. Lu H. Chen G. Zhou J. Ultrasound-guided stellate ganglion block combined with extracorporeal shock wave therapy on postherpetic neuralgia J. Healthc. Eng. 2022 2022 9808994 10.1155/2022/9808994 35035867 PMC8759896 36. Ma K. Fan Y. Jin Y. Huang X. Liu X. Cheng Z. Huang C. Wang Y. Efficacy of pulsed radiofrequency in the treatment of thoracic postherpetic neuralgia from the angulus costae: A randomized, double-blinded, controlled trial Pain Physician 2013 16 15 25 10.36076/ppj.2013/16/15 23340530 37. Wang D. Zhang K. Han S. Yu L. PainVision ® BioMed Res. Int. 2017 2017 5670219 10.1155/2017/5670219 28357404 PMC5357555 38. Wang R. Zhu T. Han Y. Ultrasound-versus computed tomography-guided cervical dorsal root ganglia pulsed radiofrequencies via intervertebral foramen for the treatment of postherpetic neuralgia: A retrospective cohort study Pain Physician 2023 26 E171 37192240 39. Pi Z.B. Lin H. He G.D. Cai Z. Xu X.Z. Randomized and controlled prospective trials of Ultrasound-guided spinal nerve posterior ramus pulsed radiofrequency treatment for lower back post-herpetic neuralgia Clin. Ter. 2015 166 e301 e305 10.7417/t.2015.1882 26550813 40. Lim S.M. Park H.L. Moon H.Y. Kang K.H. Kang H. Baek C.H. Jung Y.H. Kim J.Y. Koo G.H. Shin H.Y. Ultrasound-guided infraorbital nerve pulsed radiofrequency treatment for intractable postherpetic neuralgia-a case report Korean J. Pain 2013 26 84 10.3344/kjp.2013.26.1.84 23342215 PMC3546218 41. Li Y. Zeng X. Zhou L. Ultrasound-guided peripheral nerve radiofrequency ablation for craniofacial postherpetic neuralgia: Efficacy and safety in a retrospective cohort J. Clin. Neurosci. 2025 138 111408 10.1016/j.jocn.2025.111408 40543266 42. Li F. Gong G. Zhang Y. Ou C. Efficacy and safety of ultrasound-guided pulsed radiofrequency in the treatment of the ophthalmic branch of postherpetic trigeminal neuralgia Front. Neurol. 2024 15 1398696 10.3389/fneur.2024.1453598 38863510 PMC11165018 43. Lerman I.R. Chen J.L. Hiller D. Souzdalnitski D. Sheean G. Wallace M. Barba D. Novel high-frequency peripheral nerve stimulator treatment of refractory postherpetic neuralgia: A brief technical note Neuromodul. Technol. Neural Interface 2015 18 487 493 10.1111/ner.12281 25832898 44. Kesikburun S. Yaşar E. Dede İ. Göktepe S. Tan A.K. Ultrasound-guided steroid injection in the treatment of stump neuroma: Pilot study J. Back Musculoskelet. Rehabil. 2014 27 275 279 10.3233/BMR-130444 24284273 45. Hung Y.-H. Wu C.-H. Özçakar L. Wang T.-G. Ultrasound-Guided Steroid Injections for Two Painful Neuromas in the Stump of a Below-Elbow Amputee Am. J. Phys. Med. Rehabil. 2016 95 e73 e74 10.1097/PHM.0000000000000456 26945215 46. Pu S. Wu J. Han Q. Zhang X. Lv Y. Xu Y. Li C. Du D. Ultrasonography-guided radiofrequency ablation for painful stump neuromas to relieve postamputation pain: A pilot study J. Pain Res. 2020 13 3437 3445 10.2147/JPR.S283986 33376389 PMC7755346 47. Guo S. Mansour R. Slater D.H. Ultrasound-guided continuous radiofrequency ablation of painful residual limb neuroma in individuals with limb amputation—A retrospective case series Can. Prosthet. Orthot. J. 2019 2 33061 10.33137/cpoj.v2i1.33061 37614805 PMC10443475 48. Culp C.J. Abdi S. Current understanding of phantom pain and its treatment Pain Physician 2022 25 E941 36288580 49. Birbaumer N. Lutzenberger W. Montoya P. Larbig W. Unertl K. Töpfner S. Grodd W. Taub E. Flor H. Effects of regional anesthesia on phantom limb pain are mirrored in changes in cortical reorganization J. Neurosci. 1997 17 5503 5508 10.1523/JNEUROSCI.17-14-05503.1997 9204932 PMC6793813 50. Ilfeld B.M. Smith C.R. Turan A. Mariano E.R. Miller M.E. Fisher R.L. Trescot A.M. Cohen S.P. Eisenach J.C. Sessler D.I. Ultrasound-guided Percutaneous Cryoneurolysis to Treat Chronic Postamputation Phantom Limb Pain: A Multicenter Randomized Controlled Trial Anesthesiology 2023 138 82 97 10.1097/ALN.0000000000004429 36512721 PMC10374196 51. Gilmore C. Ilfeld B. Rosenow J. Li S. Desai M. Hunter C. Rauck R. Kapural L. Nader A. Mak J. Percutaneous peripheral nerve stimulation for the treatment of chronic neuropathic postamputation pain: A multicenter, randomized, placebo-controlled trial Reg. Anesth. Pain Med. 2019 44 637 645 10.1136/rapm-2018-100109 30954936 52. Chang P.J. Asher A. Smith S.R. A targeted approach to post-mastectomy pain and persistent pain following breast cancer treatment Cancers 2021 13 5191 10.3390/cancers13205191 34680339 PMC8534110 53. Rahimzadeh P. Imani F. Faiz S.H.R. Boroujeni B.V. Impact of the ultrasound-guided serratus anterior plane block on post-mastectomy pain: A randomised clinical study Turk. J. Anaesthesiol. Reanim. 2018 46 388 10.5152/TJAR.2018.86719 30263863 PMC6157977 54. Liu Q. Khanna A. Stubblefield M.D. Yue G.H. Allexandre D. Ultrasound-guided superficial serratus plane block for persistent post-mastectomy pain: Four case reports Support. Care Cancer 2022 30 2787 2792 10.1007/s00520-021-06696-7 34837540 55. Abdel Dayem O.T. Saeid M.M. Ismail O.M. El Badrawy A.M. Abdel Ghaffar N.A. Ultrasound guided stellate ganglion block in postmastectomy pain syndrome: A comparison of ketamine versus morphine as adjuvant to bupivacaine J. Anesthesiol. 2014 2014 792569 10.1155/2014/792569 56. Feldman E.L. Callaghan B.C. Pop-Busui R. Zochodne D.W. Wright D.E. Bennett D.L. Bril V. Russell J.W. Viswanathan V. Diabetic neuropathy Nat. Rev. Dis. Primers 2019 5 41 10.1038/s41572-019-0092-1 31197153 57. Wang J. Xu W. Wang Q. Yang P. Kan Y. Huang C. Lin F. Efficacy and Safety of Ultrasound-Guided Pulsed Radiofrequency Therapy of Stellate Ganglion on Refractory Painful Diabetic Peripheral Neuropathy J. Pain Res. 2024 17 4521 4531 10.2147/JPR.S497061 39737247 PMC11683198 58. Hu H.Q. Huang H. Huang J. Leng J.C. Li M. Tang C. Li Y. Wu S. Case Report: Successful Outcome for Refractory Diabetic Peripheral Neuropathy in Patients With Ultrasound-Guided Injection Treatment Front. Endocrinol. 2021 12 735132 10.3389/fendo.2021.735132 PMC8581352 34777245 59. Wang J.-C. Chiou H.-J. Lu J.-H. Hsu Y.-C. Chan R.-C. Yang T.-F. Ultrasound-guided perineural steroid injection to treat intractable pain due to sciatic nerve injury Can. J. Anesth. 2013 60 902 10.1007/s12630-013-9987-6 23807495 60. Kim J.H. Shin S.H. Lee Y.R. Lee H.S. Chon J.Y. Sung C.H. Hong S.J. Lee J.Y. Moon H.S. Ultrasound-guided peripheral nerve stimulation for neuropathic pain after brachial plexus injury: Two case reports J. Anesth. 2017 31 453 457 10.1007/s00540-017-2315-5 28190124 61. Narouze S.N. Zakari A. Vydyanathan A. Ultrasound-guided placement of a permanent percutaneous femoral nerve stimulator leads for the treatment of intractable femoral neuropathy Pain Physician 2009 12 E305 10.36076/ppj.2009/12/E305 19668289 62. Lin C.-P. Chang K.-V. Wu W.-T. Özçakar L. Ultrasound-Guided Peripheral Nerve Stimulation for Knee Pain: A Mini-Review of the Neuroanatomy and the Evidence from Clinical Studies Pain Med. 2020 21 S56 S63 10.1093/pm/pnz318 32804233 63. Chen C.-H. Huang Y.-K. Jaw F.-S. Ultrasound-guided perineural vitamin B12 injection for peripheral neuropathy J. Med. Ultrasound 2015 23 104 106 10.1016/j.jmu.2015.02.001 64. Thoomes E.J. Scholten-Peeters W. Koes B. Falla D. Verhagen A.P. The effectiveness of conservative treatment for patients with cervical radiculopathy: A systematic review Clin. J. Pain 2013 29 1073 1086 10.1097/AJP.0b013e31828441fb 23446070 65. Zhang X. Shi H. Zhou J. Xu Y. Pu S. Lv Y. Wu J. Cheng Y. Du D. The effectiveness of ultrasound-guided cervical transforaminal epidural steroid injections in cervical radiculopathy: A prospective pilot study J. Pain Res. 2018 12 171 177 10.2147/JPR.S181915 30643449 PMC6318715 66. Manchikanti L. Knezevic N.N. Boswell M.V. Kaye A.D. Hirsch J.A. Epidural injections for lumbar radiculopathy and spinal stenosis: A comparative systematic review and meta-analysis Pain Physician 2016 19 E365 10.36076/ppj/2016.19.E365 27008296 67. Chou R. Hashimoto R. Friedly J. Fu R. Bougatsos C. Dana T. Sullivan S.D. Jarvik J. Epidural corticosteroid injections for radiculopathy and spinal stenosis: A systematic review and meta-analysis Ann. Intern. Med. 2015 163 373 381 10.7326/M15-0934 26302454 68. Ahmed M. Ahmad A. Arshad M. Naseer H. Zamarud A. Ultrasound-guided versus conventional fluoroscopy-guided epidural injection for radiculopathy. A meta-analysis of randomized controlled trials World Neurosurg. 2023 180 203 212.e204 10.1016/j.wneu.2023.09.088 37774791 69. Cui X. Zhang D. Zhao Y. Song Y. He L. Zhang J. An open-label non-inferiority randomized trail comparing the effectiveness and safety of ultrasound-guided selective cervical nerve root block and fluoroscopy-guided cervical transforaminal epidural block for cervical radiculopathy Ann. Med. 2022 54 2669 2679 10.1080/07853890.2022.2124445 PMC9553110 36164681 70. Joo H.J. Choi S. Kim B.H. Kim M.-S. Shim G.Y. Chung S.J. Chon J. Yoo M.C. Soh Y. Therapeutic Efficacy of Ultrasound-Guided Selective Nerve Block on Chronic Cervical Radiculopathy Medicina 2024 60 1002 10.3390/medicina60061002 38929619 PMC11205526 71. Lee S.H. Choi H.H. Roh E.Y. Chang M.C. Effectiveness of ultrasound-guided pulsed radiofrequency treatment in patients with refractory chronic cervical radicular pain Pain Physician 2020 23 E265 10.36076/ppj.2020/23/e265 32517402 72. Wang B. Sun Y. Zhang J. Meng H. Zhang H. Shan L. Ultrasound-guided versus fluoroscopy-guided lumbar selective nerve root block: A retrospective comparative study Sci. Rep. 2024 14 3235 10.1038/s41598-024-53809-3 38331978 PMC10853516 73. Kim Y.H. Park H.J. Moon D.E. Ultrasound-guided pararadicular injection in the lumbar spine: A comparative study of the paramedian sagittal and paramedian sagittal oblique approaches Pain Pract. 2015 15 693 700 10.1111/papr.12249 25313534 74. Ortega-Romero A. Domingo-Rufes T. del-Olmo C. Ismael M.-F. Mayoral V. Ultrasound-guided interventional procedures for lumbar pain Tech. Reg. Anesth. Pain Manag. 2013 17 96 106 10.1053/j.trap.2014.01.013 75. Park Y. Lee J.-H. Park K.D. Ahn J.K. Park J. Jee H. Ultrasound-guided vs. fluoroscopy-guided caudal epidural steroid injection for the treatment of unilateral lower lumbar radicular pain: A prospective, randomized, single-blind clinical study Am. J. Phys. Med. Rehabil. 2013 92 575 586 10.1097/PHM.0b013e318292356b 23636087 76. Hazra A.K. Bhattacharya D. Mukherjee S. Ghosh S. Mitra M. Mandal M. Ultrasound versus fluoroscopy-guided caudal epidural steroid injection for the treatment of chronic low back pain with radiculopathy: A randomised, controlled clinical trial Indian J. Anaesth. 2016 60 388 392 10.4103/0019-5049.183391 27330199 PMC4910477 77. Elashmawy M.A. Shaat R.M. Abdelkhalek A. El Boghdady E. Caudal epidural steroid injection ultrasound-guided versus fluoroscopy-guided in treatment of refractory lumbar disc prolapse with radiculopathy Egypt. J. Radiol. Nucl. Med. 2020 51 259 10.1186/s43055-020-00388-8 78. Tan T. Barry P. Reken S. Baker M. Pharmacological management of neuropathic pain in non-specialist settings: Summary of NICE guidance BMJ 2010 340 c1079 10.1136/bmj.c1079 20335333 79. Finnerup N.B. Attal N. Haroutounian S. McNicol E. Baron R. Dworkin R.H. Gilron I. Haanpää M. Hansson P. Jensen T.S. Pharmacotherapy for neuropathic pain in adults: A systematic review and meta-analysis Lancet Neurol. 2015 14 162 173 10.1016/S1474-4422(14)70251-0 25575710 PMC4493167 80. Deng Y. Luo L. Hu Y. Fang K. Liu J. Clinical practice guidelines for the management of neuropathic pain: A systematic review BMC Anesth. 2016 16 12 10.1186/s12871-015-0150-5 26892406 PMC4759966 81. Moisset X. Bouhassira D. Avez Couturier J. Alchaar H. Conradi S. Delmotte M.H. Lanteri-Minet M. Lefaucheur J.P. Mick G. Piano V. Pharmacological and non-pharmacological treatments for neuropathic pain: Systematic review and French recommendations Rev. Neurol. 2020 176 325 352 10.1016/j.neurol.2020.01.361 32276788 82. Dworkin R.H. O’Connor A.B. Kent J. Mackey S.C. Raja S.N. Stacey B.R. Levy R.M. Backonja M. Baron R. Harke H. Interventional management of neuropathic pain: NeuPSIG recommendations Pain 2013 154 2249 2261 10.1016/j.pain.2013.06.004 23748119 PMC4484720 83. Wang X. Martin G. Sadeghirad B. Chang Y. Florez I.D. Couban R.J. Mehrabi F. Crandon H.N. Esfahani M.A. Sivananthan L. Common interventional procedures for chronic non-cancer spine pain: A systematic review and network meta-analysis of randomised trials BMJ 2025 388 e079971 10.1136/bmj-2024-079971 39971346 84. Smith C.C. McCormick Z.L. Mattie R. MacVicar J. Duszynski B. Stojanovic M.P. The Effectiveness of Lumbar Transforaminal Injection of Steroid for the Treatment of Radicular Pain: A Comprehensive Review of the Published Data Pain Med. 2019 21 472 487 10.1093/pm/pnz160 31343693 85. Karasek M. Bogduk N. Temporary neurologic deficit after cervical transforaminal injection of local anesthetic Pain Med. 2004 5 202 205 10.1111/j.1526-4637.2004.04028.x 15209975 86. Cucinotta F.A. Radiation risk acceptability and limitations Space Radiation Program Element NASA Publications NASA Johnson Space Center Houston, TX, USA 2010 87. Connolly T.M. Nadav D. Gungor S. Ultrasound-guided caudal epidural steroid injection for successful treatment of radiculopathy during pregnancy Pain Manag. 2020 10 67 71 10.2217/pmt-2019-0044 32162584 88. Wallace M.A. Fukui M.B. Williams R.L. Ku A. Baghai P. Complications of Cervical Selective Nerve Root Blocks Performed with Fluoroscopic Guidance Am. J. Roentgenol. 2007 188 1218 1221 10.2214/AJR.04.1541 17449763 89. Tiso R.L. Cutler T. Catania J.A. Whalen K. Adverse central nervous system sequelae after selective transforaminal block: The role of corticosteroids Spine J. 2004 4 468 474 10.1016/j.spinee.2003.10.007 15246308 90. Wang D. Image guidance technologies for interventional pain procedures: Ultrasound, fluoroscopy, and CT Curr. Pain Headache Rep. 2018 22 6 10.1007/s11916-018-0660-1 29374352 91. Viderman D. Aubakirova M. Aryngazin A. Yessimova D. Kaldybayev D. Tankacheyev R. Abdildin Y.G. Ultrasound-Guided vs. Fluoroscopy-Guided Interventions for Back Pain Management: A Systematic Review and Meta-Analysis of Randomized Controlled Trials Diagnostics 2023 13 3474 10.3390/diagnostics13223474 37998610 PMC10670286 92. Kimura R. Yamamoto N. Watanabe J. Ono Y. Hongo M. Miyakoshi N. Comparative efficacy of ultrasound guidance and fluoroscopy or computed tomography guidance in spinal nerve injections: A systematic review and meta-analysis Eur. Spine J. 2023 32 4101 4110 10.1007/s00586-023-07968-y 37798592 93. Lee D.Y. Park Y. Song J.H. Ahn J. Cho K.H. Kim S. Combined ultrasound and fluoroscopy versus ultrasound versus fluoroscopy-guided caudal epidural steroid injection for the treatment of unilateral lower lumbar radicular pain: A retrospective comparative study Medicina 2024 60 809 10.3390/medicina60050809 38792992 PMC11123251 94. Martiszus B. Hua S. Christiansen S. Ramsey K. Zusmer E. A Novel Piriformis Injection Technique Utilizing Combined Fluoroscopy and Ultrasound–A Pilot Study Pain Physician 2022 25 E365 35322992 95. Finnerup N.B. Haroutounian S. Baron R. Dworkin R.H. Gilron I. Haanpaa M. Jensen T.S. Kamerman P.R. McNicol E. Moore A. Neuropathic pain clinical trials: Factors associated with decreases in estimated drug efficacy Pain 2018 159 2339 2346 10.1097/j.pain.0000000000001340 30015707 PMC6193835 96. Lagueny A. Burbaud P. Mechanism of action, clinical indication and results of treatment of botulinum toxin Neurophysiol. Clin. 1996 26 216 226 10.1016/S0987-7053(96)85003-9 8975111 97. Ranoux D. Attal N. Morain F. Bouhassira D. Botulinum toxin type A induces direct analgesic effects in chronic neuropathic pain Ann. Neurol. 2008 64 274 283 10.1002/ana.21427 18546285 98. Hong B. Yao L. Ni L. Wang L. Hu X. Antinociceptive effect of botulinum toxin A involves alterations in AMPA receptor expression and glutamate release in spinal dorsal horn neurons Neuroscience 2017 357 197 207 10.1016/j.neuroscience.2017.06.004 28606856 99. Buesing S. Costa M. Schilling J.M. Moeller-Bertram T. Vitamin B12 as a treatment for pain Pain Physician 2019 22 E45 10.36076/ppj/2019.22.E45 30700078 100. Julian T. Syeed R. Glascow N. Angelopoulou E. Zis P. B12 as a Treatment for Peripheral Neuropathic Pain: A Systematic Review Nutrients 2020 12 2221 10.3390/nu12082221 32722436 PMC7468922 101. Vallejo R. Tilley D.M. Williams J. Labak S. Aliaga L. Benyamin R.M. Pulsed radiofrequency modulates pain regulatory gene expression along the nociceptive pathway Pain Physician 2013 16 E601 E613 10.36076/ppj.2013/16/E601 24077210 102. Hagiwara S. Iwasaka H. Takeshima N. Noguchi T. Mechanisms of analgesic action of pulsed radiofrequency on adjuvant-induced pain in the rat: Roles of descending adrenergic and serotonergic systems Eur. J. Pain 2009 13 249 252 10.1016/j.ejpain.2008.04.013 18539061 103. Cho I.T. Cho Y.W. Kwak S.G. Chang M.C. Comparison between ultrasound-guided interfascial pulsed radiofrequency and ultrasound-guided interfascial block with local anesthetic in myofascial pain syndrome of trapezius muscle Medicine 2017 96 e6019 10.1097/MD.0000000000006019 28151904 PMC5293467 104. Sir E. Eksert S. Comparison of block and pulsed radiofrequency of the ganglion impar in coccygodynia Turk. J. Med. Sci. 2019 49 1555 1559 10.3906/sag-1906-51 31652036 PMC7018354 105. Zhu D. Fan Z. Cheng F. Li Y. Huo X. Cui J. The efficacy of an ultrasound-guided improved puncture path technique of nerve block/pulsed radiofrequency for pudendal neuralgia: A retrospective study Brain Sci. 2022 12 510 10.3390/brainsci12040510 35448041 PMC9031648 Figure 1 Cadaveric bony model reconstruction illustrating the supraorbital foramen (SF), infraorbital foramen (IF), and mental foramen (MF) ( A B C D ® Figure 2 Cadaveric bony model reconstruction ( A B ® Figure 3 Cadaveric sagittal cross-sectional image ( A B ® Figure 4 Cadaveric bony model reconstruction ( A B C ® Figure 5 Cadaveric axial-sectional image ( A B C D Figure 6 Cadaveric axial-sectional image ( A B Figure 7 Cadaveric axial-sectional image ( A B ® Figure 8 Cadaveric axial-sectional image ( A B ® Figure 9 Cadaveric bony model reconstruction illustrating the sciatic nerve of the lower extremity ( A B C D L ® Figure 10 Cadaveric axial-sectional image ( A B ® Figure 11 Cadaveric sagittal section ( A B ® life-15-01404-t001_Table 1 Table 1 Summary of review findings. N, nerve; VZV, varicella-zoster virus; SNRB, selective nerve root block; SGB, satellite ganglion block; TPVB, thoracic paravertebral block; ESPB, erector spinae plane block; PRF, pulsed radiofrequency; RCT, randomized controlled trial; PNS, peripheral nerve stimulation; DPN, diabetic polyneuropathy; ESI, epidural steroid injection.  Pain Characteristic Cause Patient Positioning Ultrasound Probe and Technique Effectiveness of Ultrasound-Guided Procedures Additional Notes  Trigeminal neuralgia Paroxysmal facial pain in one or more divisions of the trigeminal nerve Neurovascular compression at root entry zone Head neutral Linear probe, in-plane V1: supraorbital notch V2: infraorbital foramen V3: mental foramen Sustained pain relief by nerve block (case study) Use Doppler imaging to avoid vascular puncture Lateral, with affected side up Curvilinear probe, out-of-plane Maxillary N.: pterygopalatine fossa Mandibular N.: between pterygoid muscles  Acute herpes pain Burning, stabbing, or itching pain in the affected dermatomal distribution Reactivation of VZV leading to viral nerve damage and inflammation Cervical: supine, head turned to contralateral side Cervical: SNRB brachial plexus block SGB TPVB ESPB Reduce pain and lower postherpetic neuralgia incidence by TPVB/ESPB (meta-analysis), PRF/SNRB/SGB (RCT)  Caution near large vessels (cervical) and lungs (thoracic) Prefer non-particulate steroids  Post-herpetic neuralgia Persistent pain after rash resolution Central and peripheral sensitization Effective pain control by PRF (RCT), TPVB/SNRB/brachial plexus block/SGB/PNS (case study)  Post-amputation pain Stump pain and phantom limb pain Multifactorial, including neuromas, nerve damage, sensitization  Variable depending on the target nerve Neuroma identified as a hypoechoic, swollen mass adjacent to the parent nerve Significant pain reduction by PNS (RCT), nerve block/PRF (case study) Avoid direct injection into the nerve  Painful polyneuropathy Numbness, tingling sensations, dysesthesia, weakness, balance impairment Metabolic, infections, connective tissue disorders, hereditary, toxins, nerve injuries, etc.  Variable depending on the target nerve Commonly distal sensory nerves in lower extremities  Improvement of painful DPN by SGB (prospective cohort), lumbar plexus block/hydrodissection (case study) Peripheral nerve injury pain decreased by nerve blocks/PNS (case study) Ultrasound facilitates targeting small distal nerves  Painful radiculopathy Pain, numbness, clumsiness and even weakness in the distribution of the affected nerve root Mechanical compression and inflammatory irritation of the nerve root, often due to disc herniation or spondylosis Cervical: supine, head turned to contralateral side Cervical: linear, in-plane Transforaminal ESI SNRB Transforaminal ESI SNRB Caudal block Improvement of pain by ESI (meta-analysis), SNRB/caudal block (RCT)  Caution in cervical region with large vessels Prefer non-particulate steroids ",
  "metadata": {
    "Title of this paper": "The efficacy of an ultrasound-guided improved puncture path technique of nerve block/pulsed radiofrequency for pudendal neuralgia: A retrospective study",
    "Journal it was published in:": "Life",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12471328/"
  }
}