{
  "title": "Paper_1114",
  "abstract": "pmc Korean J Community Nutr Korean J Community Nutr 4771 kjcn KJCN Korean Journal of Community Nutrition 2951-3146 Korean Society of Community Nutrition and the Korean Nutrition Society PMC12382330 PMC12382330.1 12382330 12382330 41030865 10.5720/kjcn.2024.00009 kjcn-2024-00009 1 Research Article 장애인 식생활 지원제도 필요 및 지원방안에 관한 탐색적 조사연구 The needs and prioritization of nutrition and dietary support for individuals with disabilities: an exploratory study http://orcid.org/0000-0002-4981-4238 Park Jong Eun 박 종은  1 http://orcid.org/0000-0002-8104-6865 Kim Yu Jin 김 유진  2 http://orcid.org/0000-0003-2258-7490 Kim So Young 김 소영  1  3  4 http://orcid.org/0000-0003-3247-0827 Park Jong Hyock 박 종혁  1  3  4  † 1 Korea 1 2 Korea 2 3 Korea 3 4 Korea 4 † jonghyock @gmail.com 10 2024 31 10 2024 29 5 493159 431 443 24 7 2024 22 8 2024 5 9 2024 01 10 2024 30 09 2025 01 10 2025 © 2024 The Korean Society of Community Nutrition 2024 https://creativecommons.org/licenses/by-nc/4.0/ This is an Open-Access article distributed under the terms of the Creative Commons Attribution Non-Commercial License ( http://creativecommons.org/licenses/by-nc/4.0 Objectives Based on a survey of officers, social workers, and dietitians involved in managing nutrition and welfare policies or projects for vulnerable groups in local governments or private welfare institutions, this study aimed to assess the need for nutritional and dietary support policies and programs for persons with disabilities (PWD), as well as to identify appropriate support measures. Methods An online survey was conducted from March 2 to 15, 2021. The survey included 20 questions exploring perspectives on the nutritional status of PWD, their need for nutritional and dietary support policies and programs, and the prioritization of appropriate support measures. A total of 132 responses were analyzed. Results Approximately 68.9% of the respondents rated the nutritional status of PWD as “bad” or “very bad.” A substantial number identified “difficulty in purchasing ingredients, cooking, and preparing meals independently due to disability,” and “limited knowledge about nutrition and recipes necessary for maintaining a healthy and balanced diet” as the primary challenges in the dietary and nutritional management of this population. Additionally, 97.0% of the respondents deemed that the introduction of nutritional and dietary support policies and programs for PWD was “needed” or “very much needed.” Priority strategies to implement and strengthen these policies and systems included the “development of customized programs and services tailored to the needs and demands of the target population” and the “establishment of a dedicated department with specialized personnel.” Conclusion Comprehensive nutritional and dietary support policies and programs should be actively implemented to ensure a healthy and stable diet for PWD, tailored to meet their actual needs and demands. disability disabled persons food assistance nutrition policy pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement no pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes INTRODUCTION 우리나라의 등록장애인 수는 2023년 말 기준 약 264만 명으로 전체 인구 대비 5.1%의 분포를 유지하고 있다[ 1 2 3 4 장애인은 비장애인보다 상대적으로 건강행태가 좋지 못하고 건강상태도 취약하여 만성질환의 유병률이 높고 이로 인한 사망률도 더 높은 것으로 알려져 있어[ 5 9 10 하지만 장애인은 장애로 인해 불가피하게 지출하는 보조기기 구입·유지비, 의료비, 보호·간병비, 교통비 등의 장애 추가비용 부담으로 인해 식품 불안정성(food insecurity)의 위험이 높다[ 11 12 13 14 이처럼 장애인은 대표적인 영양취약집단 중 하나이지만 영양정책 및 식생활관리사업의 제도적 사각지대에 놓여 있는 소외계층으로 그동안 국민건강증진종합계획이나 국민영양관리기본계획 등의 국가보건정책 수립 시 장애인의 영양지원 및 식생활 관리에 대한 고려는 거의 배제되어 있거나 극히 제한적인 논의만 언급되어 왔을 뿐이다[ 15 18 METHODS  Ethics statement Informed written consent was obtained from each participant. The study protocol was approved by the Institutional Review Board of Chungbuk National University (approval number: CBNU-202010-HRHR-0171). 1. 연구 설계 본 연구는 탐색적 조사연구로 설계되었으며, 장애인 식생활 지원제도 도입에 대한 필요성과 지원방안에 대한 방향성을 파악하기 위하여 2021년 3월 2일부터 3월 15일까지 설문조사를 실시한 횡단면 조사 기반 연구이다. 따라서 단면연구의 STROBE (Strengthening the Reporting of Observational Studies in Epidemiology) 보고 지침을 참고하여 기술하였다( https://www.strobe-statement.org/ 2. 조사 대상 설문조사 대상에는 전국 시•군•구청 및 보건소의 영양관리사업 담당자, 시•군•구청의 취약계층 지원 및 복지사업 담당자(장애인복지과, 노인복지과, 주민복지과 등), 찾아가는 동주민센터의 복지플래너, 장애인, 노인, 저소득층 대상 복지서비스기관(장애인복지관, 노인복지관, 종합복지관, 장애인지원센터 등)의 사회복지사 및 영양사가 포함되었고, 자발적 표본추출에 의해 조사가 이루어졌다. 연구목적, 설문조사 대상, 설문조사 내용 등에 관한 정보가 담긴 설문조사 안내문과 설문조사지 샘플을 조사 시작 전에 해당 기관에 우편, 팩스, 이메일 등을 통해 사전 발송하였고, 관련 담당자들이 직접 웹 링크(web link)를 이용해 온라인 설문조사에 참여하도록 요청하였다. 모든 설문조사는 무기명으로 진행되었으며, 총 140명이 자발적으로 설문조사에 참여하였다. 이 중 8명은 설문조사 대상자가 아니거나 설문조사에 끝까지 참여하지 않은 중간 종결자로 최종 분석에서는 모두 제외하였다. 총 132명의 설문조사 응답자가 분석대상에 포함되었고 담당업무에 따라 ‘① 지자체의 장애인 및 기타 취약계층 지원 및 복지사업 담당자(찾아가는 동주민센터의 복지플래너 포함)’, ‘② 지자체의 영양관리사업 담당자(보건소 포함)’, ‘③ 장애인 및 기타 취약계층 대상 사회복지서비스 기관의 사회복지사 및 영양사’ 3개 그룹으로 분류하였다. 3. 설문조사 내용 설문조사는 타당도와 신뢰도가 이미 검증되었거나 신뢰할 만한 공공기관의 조사를 활용하여 응답자들의 일반적 특성, 장애인의 식생활 및 영양 상태에 대한 주관적 인식, 장애인 지원제도 및 정책별 필요도, 장애인 식생활 지원제도 도입의 필요성 및 지원방안에 대한 방향성 등을 묻는 총 20개의 폐쇄형•개방형 설문문항으로 구성하였다. 구체적으로 장애인의 생활실태과 복지욕구를 파악하기 위한 국가단위 조사인 보건복지부 장애인 실태조사[ 19 20 21 1) 일반적 특성 조사대상자의 연령대, 성별, 현재 담당업무[동주민센터 복지플래너, 보건소 영양관리사업 담당자, 사회복지서비스 기관(복지관, 복지센터, 지원센터 등)의 영양사, 지방자치단체의 영양관리사업 담당자, 지방자치단체의 취약계층 지원 및 복지사업 담당자, 사회복지서비스 기관의 취약계층 지원 및 복지사업 담당자], 해당 업무의 대상 취약계층(복수 응답: 저소득층, 고령자, 장애인, 한부모가정, 북한이탈주민, 결혼이민자, 기타), 해당 업무가 취약계층을 직접 방문·대면하는 업무에 해당하는지 여부, 해당 업무에서의 총 근무경력, 현재 소속기관의 행정구역 등에 대해 조사하였다. 2) 장애인의 식생활 및 영양 상태에 대한 인식 조사대상자의 장애인의 식생활 및 영양 상태에 대한 인식을 알아보기 위해 장애인의 식생활 및 영양 상태를 어떻게 평가하고 있는지(매우 좋다, 좋은 편이다, 나쁜 편이다, 매우 나쁘다), 식생활 및 영양 관리에서 장애인의 가장 큰 어려움 및 문제점은 무엇이라고 생각하는지(경제적 어려움으로 충분한 양의 양질의 식사를 하지 못한다, 건강하고 균형잡힌 식생활을 실천하기 위한 영양정보 및 조리법에 대해 잘 알지 못한다, 장애로 인하여 식재료 구입에 어려움이 있다, 장애로 인하여 누군가의 도움 없이는 조리 및 취사, 식사 준비가 힘들다, 음식을 씹거나 삼키는 등 음식 섭취에 어려움이 있다, 기타)에 대해 조사하였다. 이어서 15가지의 장애유형(지체, 뇌병변, 시각, 청각, 언어, 안면, 신장, 심장, 간, 호흡기, 장루·요루, 뇌전증, 지적, 자폐성, 정신) 중 식생활 및 영양 관리에서 가장 어려움이 크거나 도움을 필요로 하는 장애유형은 무엇이라고 생각하는지(복수 응답)에 대해서도 응답하도록 하였다. 3) 장애인 지원제도 및 정책별 필요도, 식생활 지원제도 도입의 필요성 및 지원방안 기본소득 보장, 주거 보장, 식생활 보장, 의료 보장, 보육 및 교육 보장, 직업교육 및 고용 보장, 이동권 보장, 장애인 건강관리, 의사소통과 정보접근 참여 보장, 장애인 인권보장 및 차별금지와 같이 선행연구에서 우선순위가 높았던 10가지 지원제도 및 정책별 필요도는 0점부터 10점으로 구성된 리커트 척도(Likert scale)를 이용하여 조사하였다. 이어서 향후 장애인을 위한 식생활 지원제도의 도입이 필요하다고 생각하는지(매우 필요하다, 필요한 편이다, 필요하지 않은 편이다, 전혀 필요하지 않다), 장애인을 위한 식품 및 식생활 지원 프로그램이 도입된다면 우선적으로 어떤 방식으로 지원되어야 한다고 생각하는지[복수 응답: 식품 및 음식을 직접 구매할 수 있는 바우처 제공, 필수식품 및 식재료 지원, 밀키트/쿠킹박스 배달, 밑반찬 및 도시락 배달, 지정 장소에서 무료급식 제공(복지관, 복지센터, 공공기관 급식소 등), 식사 준비 및 식사 보조 서비스, 맞춤형 식생활교육 및 영양관리 프로그램 운영, 기타], 장애인 식생활 지원 정책 및 제도의 활성화를 위한 전략적 우선순위 및 접근방안은 무엇이라고 생각하는지[지원을 위한 법적•제도적 근거 마련, 전담부서 설치 및 전담인력의 배치, 지원제도 창구의 통합 및 일원화, 전달체계의 개선, 대상자의 수요와 요구를 고려한 맞춤형 프로그램 및 서비스 개발, 지원대상자 및 지원범위(지원물량 및 품목 등)의 확대, 기타]에 대해서도 응답하도록 하였다. 추가적으로 장애인의 식생활 지원 및 영양 관리를 위한 정책 및 제도에 대한 추가적인 제언을 개방형으로 자유롭게 기술하도록 하였다. 4. 자료 분석 방법 조사대상자의 일반적 특성은 기술통계를 사용하여 빈도와 백분율로 제시하였고, 카이제곱 검정(chi-square test) 또는 피셔의 정확 검정(Fisher’s exact test)을 실시하여 담당업무에 따른 3개 하위그룹별 분포의 차이에 대한 유의성을 검증하였다. 장애인의 식생활 및 영양 상태에 대한 인식, 장애인 식생활 지원제도 도입의 필요성 및 지원방안과 같은 객관식 조사문항의 경우도 빈도분석 및 카이제곱 검정을 통해 범주형 변수들의 분포 특성을 파악하였다. 0–10점 리커트 척도로 조사된 장애인 지원제도 및 정책별 필요도는 평균과 표준편차로 제시하였고, 담당업무에 따른 3개의 하위그룹에 대해서는 일원배치 분산분석(one-way analysis of variance)을 수행하여 그룹 간의 평균에 차이가 있는지 검정하였다. 모든 통계분석은 SAS ver 9.4 (SAS Institute)를 이용하였고, 통계적 유의성은 유의수준 5% ( P RESULTS 1. 응답자의 일반적 특성 설문조사에 참여한 132명의 응답자 중 지자체의 취약계층 지원 및 복지사업 담당자는 33.3% (n = 44), 지자체 및 보건소의 영양관리사업 담당자는 25.8% (n = 34), 장애인 및 기타 취약계층 대상 사회복지서비스기관의 사회복지사 및 영양사는 40.9% (n = 54)의 분포를 보였다( Table 1 P 전체 응답자의 72.0%는 취약계층을 직접 방문하거나 대면하는 업무를 맡고 있는 것으로 조사되었고, 현재 담당하고 있는 주 대상 취약계층으로 장애인(64.4%), 저소득층(40.9%), 노인(14.4%) 순으로 높게 나타났다. 지자체의 취약계층 지원 및 복지사업 담당자 그룹과 사회복지서비스 기관의 사회복지사 및 영양사 그룹의 경우 현재 담당하고 있는 주 대상 취약계층으로 장애인의 비율이 상대적으로 더 높은 반면( P P P 2. 장애인의 식생활 및 영양 상태에 대한 인식 장애인의 식생활 및 영양 상태에 대해 전체 응답자의 68.9%가 “나쁜 편이다” 또는 “매우 나쁘다”라고 평가하였으며, 특히 지자체의 영양관리사업 담당자 그룹에서 장애인의 식생활 및 영양 상태에 대한 부정적인 평가 비율이 상대적으로 더 높게 나타났다(85.3%, P Table 2 장애유형 중 식생활 및 영양 관리에서 가장 어려움이 크거나 도움을 가장 필요로 하는 장애유형(복수 응답)으로는 뇌병변(63.6%), 지체(55.3%), 지적(54.5%), 자폐성(34.8%), 시각(29.5%), 정신장애(17.4%) 순으로 높은 응답률을 보였다. 특히, 지자체의 취약계층 지원 및 복지사업 담당자 그룹의 경우 뇌병변장애를( P P P P 3. 장애인을 위한 지원제도 및 정책별 필요도 리커트 척도(0–10점)로 조사된 10가지의 장애인 지원제도 및 정책별 필요도는 ‘1순위: 의료비 보장’ (7.76 ± 2.51)이 가장 높았고, 이어서 ‘2순위: 장애인 인권보장 및 차별금지’ (7.74 ± 2.62), ‘3순위: 장애인 건강관리’ (7.60 ± 2.52), ‘4순위: 이동권 보장’ (7.45 ± 2.44), ‘5순위: 식생활 보장’ (7.44 ± 2.52) 순으로 필요도가 높은 것으로 조사되었다( Table 3 4. 장애인 식생활 지원제도 도입의 필요성과 지원 방식의 우선순위 장애인을 위한 식생활 지원제도 도입의 필요성에 대해서는 전체 참여자의 97.0%가 “매우 필요하다” (44.7%) 또는 “필요한 편이다” (52.3%)라고 응답했으며 특히, 사회복지서비스 기관의 사회복지사 및 영양사 그룹의 경우 61.1%가 “매우 필요하다”라고 응답하였다( P Table 4 장애인을 대상으로 한 식품지원제도 및 식생활 지원 프로그램 도입 시 가장 필요한 지원 방식으로는 전체 응답자의 52.3%가 ‘밑반찬 및 도시락 배달’이라고 응답하였고, 이어서 ‘식사 준비 및 식사 보조 서비스’ (41.7%), ‘맞춤형 식생활 교육 및 영양관리 프로그램 운영’ (25.8%), ‘필수식품 및 식재료 지원’ (24.2%) 순으로 높은 응답률을 보였다. ‘밀키트(meal kit)·쿠킹박스(cooking box) 배달’ (18.9%)이나, ‘지정 장소에서 무료급식 제공’ (18.2%), ‘식품 및 음식을 직접 구매할 수 있는 바우처 제공’ (17.4%)에 대해서는 상대적으로 낮은 선호도를 보였다. 담당업무에 따른 3개 하위그룹별 분석에서도 그룹 간의 유의한 차이는 나타나지 않았으며, 모든 그룹에서 ‘밑반찬 및 도시락 배달’과 ‘식사 준비 및 식사 보조 서비스’의 필요성을 더 높게 인식하고 있는 것으로 나타났다. 5. 장애인 식생활 지원 정책 및 제도의 활성화를 위한 우선순위 전략 장애인 식생활 지원 정책 및 제도의 활성화를 위한 우선순위 전략 및 접근 방법으로는 ‘대상자의 수요와 요구를 고려한 맞춤형 프로그램 및 서비스 개발’ (37.1%)과 ‘전담부서 설치 및 전담인력의 배치’ (23.5%), ‘지원제도 창구의 통합 및 일원화’ (11.4%), ‘지원을 위한 법적•제도적 근거 마련’ (11.4%), ‘지원대상자 및 지원범위의 확대’ (8.3%), ‘전달체계의 개선’ (8.3%) 순으로 높은 응답률을 보였다( Table 5 6. 실효성 있는 장애인의 식생활 지원 및 관리를 위한 정책 및 제도에 대한 제언 장애인의 식생활 지원 및 영양 관리를 위한 정책 및 제도의 실효성을 높이기 위한 추가적인 제언(개방형 문항)에는 총 132명 중 63명이 응답하였다. 대부분의 응답자들은 정책 및 제도의 활성화를 위한 우선순위 전략으로 앞서 언급된 주요 의견들을 재차 강조하였으며, 다음과 같은 세 가지의 핵심 의견이 도출되었다. •장애인의 생애주기 및 장애특성을 고려한 다양한 지원방식의 필요성 “ 식생활과 관련된 행동과 습관은 어릴 때부터 형성되고 성장 후 쉽게 변화하기 어렵기 때문에 장애아동부터 이러한 상담과 교육 및 지원이 필요할 것으로 보입니다. “ 보건소에서 진행하고 있는 영양플러스 사업을 모티브로 하여 장애인의 생애주기에 따른 식생활 지원이 필요합니다. “ 지적, 자폐성 장애는 교육 및 사업 진행 시 장애특성을 반영하여 전달 교육보다는 지원인력을 파견하고 직접 체험하고 실습할 수 있도록 하는 교육방식이 필요합니다. “ 장애유형별 맞춤형 서비스 개발이 이루어져야 합니다. “ 장애유형 및 정도에 따라 식품의 구매와 조리, 음식 섭취능력에 차이가 있을 수 있습니다. 각 그룹의 특성에 맞게 식품 구매 바우처, 간편식 배달, 섭취 보조인력 투입, 식생활 교육 등 현실성 있게 사업이 만들어져야 하며, 일률적인 하나의 방식보단 장애특성에 맞춘 여러가지 방식들로 지원이 이루어지면 좋겠습니다. •적극적인 장애인 식생활 지원 및 사업추진을 위한 법적 근거 및 추진체계 마련의 필요성 “ 장애인의 식생활 관리는 생계, 치료, 삶과 생활유지를 위한 필수적 요소이므로 복지수준의 장애인 식생활 지원법 제정이 필요합니다. •체계적인 식생활 지원 및 관리를 위한 전담기관 및 전문인력 구성의 필요성 “ 장애인의 자립능력 향상을 위해서는 식생활 관리가 필수적입니다. 이러한 필수적인 식생활의 개선 및 체계적인 지원을 위한 관리체계가 필요합니다. “ 식사준비에서부터 영양관리까지 전문인력과 전담기관의 신설이 필요합니다. 기존 복지업무와 병행하는 경우 전문성 및 효율성이 떨어질 수 있습니다. “ 현장에서는 사회복지사들이 대부분 장애인의 식생활 업무를 지원하고 있는 것이 현실입니다. 장애인의 식생활 지원은 학교급식이 정착되는 과정처럼 전문적인 지식을 갖춘 영양사들의 책임 하에 진행되어야 할 것으로 생각합니다. “ 장애인 시설에 전문적인 영양관리 전담인력의 배치가 필요합니다. 첫 번째 의견으로는 총 13명(지자체의 취약계층 지원 및 복지사업 담당자 2명, 지자체의 영양관리사업 담당자 5명, 장애인 및 기타 취약계층 대상 사회복지서비스 기관의 사회복지사 및 영양사 6명)이 일괄적인 지원방식보다는 장애인의 생애주기, 장애유형 및 장애정도 등을 고려한 다양한 맞춤형 지원방식을 발굴해야 한다고 제시하였다. 두 번째 의견으로는 총 11명(지자체의 취약계층 지원 및 복지사업 담당자 4명, 지자체의 영양관리사업 담당자 1명, 장애인 및 기타 취약계층 대상 사회복지서비스 기관의 사회복지사 및 영양사 6명)이 장애인 식생활 지원 및 사업추진을 위하여 별도의 법적 근거 및 체계적인 추진체계가 필요하다고 언급하였다. 세 번째로, 총 8명(지자체의 취약계층 지원 및 복지사업 담당자 4명, 지자체의 영양관리사업 담당자 2명, 장애인 및 기타 취약계층 대상 사회복지서비스 기관의 사회복지사 및 영양사 2명)의 대상자가 체계적이고 실효성 있는 식생활 지원 및 관리를 위한 전담기관과 전문 인력의 구성과 배치가 필요하다는 의견을 제시하였다. DISCUSSION 본 연구는 국내 영양정책 및 식생활관리사업에서 제도적 사각지대에 놓여 있는 주요 영양취약집단인 장애인의 식생활 지원 필요성과 적절한 지원 방안을 모색하기 위해 전국 지자체 및 사회복지서비스 기관에서 장애인, 노인, 저소득층 등의 취약계층을 대상으로 영양관리 및 복지 사업을 담당하고 공무원 및 실무자들을 대상으로 설문조사를 실시하였다. 본 연구의 설문조사 결과와 그간의 도출된 주요 연구 결과를 중심으로 논의를 해보면 다음과 같다. 첫째, 설문조사 참여자들의 3분의 2 이상이 장애인의 식생활 및 영양 상태에 대해 전반적으로 부정적인 인식을 가지고 있었다. 특히, 장애인을 대상으로 한 업무 경험이 상대적으로 더 많은 두 그룹에 비해, 지자체 및 보건소의 영양관리사업 담당자 그룹에서 장애인의 식생활 및 영양상태에 대한 부정적인 인식이 더 높게 나타났다. 해당 그룹은 실질적으로 식품영양학 전공자, 영양사, 간호사 등의 비율이 높을 것으로 추정되며, 응답자의 전문 분야와 업무 특성상 장애로 인한 식생활 관리의 어려움과 문제를 더욱 심각하게 인식하는 경향이 반영된 것으로 보인다. 설문조사 참여자들이 인식한 장애인의 식생활 및 영양 관리에서의 주요 어려움으로는 장애로 인해 식재료 구입, 조리 및 식사 준비가 타인의 도움 없이는 어려울 수 있다는 점과 건강한 식생활을 위한 영양 정보 및 조리법에 대한 지식 부족이 가장 두드러지게 나타났다. 또한, 가장 취약한 장애유형으로는 거동이 불편하거나 일상생활에 제한이 있는 신체적 장애(예: 지체, 뇌병변, 시각장애 등)와 지적, 자폐성장애와 같이 비교적 장애정도가 심각한 정신적 장애가 식생활 관리에 더 큰 취약성을 지닌 유형으로 인식되었다. 선행연구에 의하면 장애인의 식생활 및 영양학적 문제는 신체적, 정신적 장애로 인한 장보기와 식사준비와 같은 일상생활에서의 사회적·물리적 제약과 장애(질환)로 인한 음식섭취의 제한, 영양 및 식생활관리에 관한 교육 및 정보의 부족, 그리고 소득감소 및 장애로 인한 추가비용 지출과 같은 경제적 이중부담 등의 복합적인 취약상태와 관련되어 있는 것으로 보고되었다[ 22 24 25 11 또한, 식사의 질적 특성을 평가한 연구에 따르면, 주요 영양소별 적정 섭취 비율(nutrient adequacy ratio, NAR)과 평균 영양소 적정 섭취 비율(mean adequacy ratio, MAR)을 이용하여 장애인과 비장애인의 식사의 질을 비교 결과, 장애인의 식사는 에너지, 단백질, 리보플라빈, 나이아신, 칼슘, 인 등 개별 영양소의 적정 섭취 비율뿐만 아니라 평균 적정 섭취 비율 측면에서도 전반적으로 식사의 질이 비장애인보다 더 낮은 것으로 나타났다[ 14 13 장애인의 취약한 식생활 문제는 장애인의 생활실태 및 건강상태, 복지욕구 등을 파악하기 위해 전국 17개 시·도의 재가 등록장애인 7,000여 명을 대상으로 3년마다 실시하고 있는 장애인실태조사 결과에서도 부분적으로 확인할 수 있다. 해당 조사결과(2020)에 의하면 ‘지난 일주일 동안 영양을 고려하여 식품을 골고루 섭취하였는지’에 대한 설문문항에 대해 ‘예’라고 응답한 장애인은 40.2%에 불과하였다[ 19 26 27 두번째 논의는 설문조사에 참여한 응답자의 97.0%에 이르는 대부분이 장애인을 위한 식생활 지원에 대한 필요성을 강하게 인식하고 있다는 것이다. 현재 우리나라의 취약계층 식품지원제도 및 관련사업으로는 농림축산식품부에서 시행하고 있는 저소득가구 학생 대상의 우유 무상급식 지원과 아침식사 결식률이 높은 대학생에게 양질의 아침식사를 천원에 제공하여 청년층의 건강한 식습관 형성을 지원하기 위한 천원의 아침밥 사업, 경제적 취약계층의 영양보충적 지원 정책의 일환으로 국내산 농축산물 구매를 지원하는 농식품바우처(또는 꾸러미 배송) 시범사업 등이 있다. 또한, 보건복지부의 관련 사업으로는 저소득층에 대한 최저 생활비 보장을 위한 국민기초생활보장제도 생계급여가 있고, 영양위험요인(빈혈, 저체중, 성장부진, 영양섭취상태 불량 중 1가지)을 가진 기준 중위소득 80% 이하의 임신부, 출산부, 수유부 및 영유아 대상자에게 영양교육 및 상담, 보충식품패키지를 제공하는 영양플러스 사업과 기초생활보장 수급권자 및 차상위계층 등의 저소득층에게 할인된 가격으로 정부양곡을 지원하는 정부양곡할인지원 등도 있다. 아동급식지원의 경우 경제적 빈곤이나 부모의 질병, 사망, 가출 등 가족기능의 결손으로 결식 우려나 급식지원이 필요한 취학·미취학 아동에게 식사를 제공하거나 식사를 할 수 있도록 급식카드 등을 지원하고 있다. 노인급식지원 사업은 크게 복지관 내 경로식당 운영을 통한 직접적인 무료급식 지원과 도시락 및 밑반찬 배달을 통해 거동이 불편한 재가노인에 대한 식사를 제공하는 두 가지 형태로 구분할 수 있다. 대부분 지방정부가 자체적으로 사업을 추진하고 있으며 사회복지기관 및 시설 위탁 등을 통해 민간영역에서 직접 식사를 제공하는 형태로 많이 운영되고 있다[ 20 21 28 하지만 이러한 식품지원제도 및 보충영양관리사업들이 시행되고 있음에도 현장의 다양한 관계자들이 장애인 식생활 지원제도의 필요성을 공통되게 인식하고 있다는 연구결과는 현재 추진되고 있는 제도 및 사업들이 장애인과 같은 특수한 영양취약계층을 충분히 고려하지 못하고 있음을 시사한다고 할 수 있다. 그동안 추진된 식품지원제도 및 보충영양관리사업의 지원 대상으로는 사실상 소득수준을 최우선 필요조건으로 고려해 왔고, 상당수의 제도에서 국민기초생활보장제도의 선정 기준에 준하여 지원 대상을 선정함에 따라 중복 수혜 문제뿐만 아니라 이로 인한 제도의 광범위한 사각지대가 발생하기도 하였다[ 20 물론, 현재 제도 하에서 일부 저소득 장애인은 기존 식품지원제도의 수혜대상에 포함될 수 있다. 그러나 일반적인 선정기준을 적용해 비장애인과 동일한 기준으로 장애인을 식생활 지원 대상으로 선정하는 데는 여러 한계가 존재한다. 장애인 가구의 높은 식품불안정성은 주로 재정 자원의 감소, 가계 지출 증가, 가계 예산 관리 능력의 저하와 밀접하게 관련되며 특히, 장애로 인한 추가적인 의료비, 보조기기 구입 및 유지비, 활동 지원 서비스 비용, 특수 식단 비용 등의 경제적 부담으로 인해 장애인은 비장애인에 비해 식품불안정을 피하기 위해 2–3배의 더 많은 소득이 필요하다는 연구결과가 있다[ 29 25 30 그동안 한국에서는 ｢노인•장애인 등 사회복지시설의 급식안전 지원에 관한 법률」에 따라 2022년부터 영양사가 없는 소규모 노인•장애인 사회복지시설의 급식 위생 및 영양관리를 지원하기 위해 사회복지급식관리지원센터를 설치•운영하고 있으며, 2026년까지 전국 모든 시•군•구에 이를 확대하려는 고무적인 진전도 있었다[ 31 세번째는 장애인을 대상으로 하는 식품 및 식생활 지원제도의 지원(제공)방식에 대한 논의이다. 본 연구의 참여자들은 ‘밑반찬 및 도시락 배달’이나 ‘식사 준비 및 식사 보조 서비스’에 대한 필요성을 최우선적으로 꼽았으며, 이는 스스로 식사 준비가 어려울 수 있는 장애인 수혜자의 경우 식재료 전처리나 별도의 조리과정 없이 섭취가 바로 가능한 음식 형태의 지원이나, 직접적으로 식사 준비 및 식사 보조 서비스를 제공할 수 있는 인력 지원이 현실적으로 가장 필요하다고 인식하고 있기 때문으로 보여 진다. 취약계층을 대상으로 식생활을 지원하기 위한 적절한 지원방식에 대해 설문조사를 수행한 이전 연구에서도 노인과 장애인의 경우는 조리된 반찬이나 도시락을 해당가구에 배달하거나, 식품조리 등의 식사준비 서비스 형태로 지원받는 것을 더 선호하는 것으로 조사되었다. 특히, 신체적인 여건상 거동이 불편하고 조리능력이 없는 경우는 도시락 또는 밑반찬 배달 형태의 지원이 적합하며, 신체적인 불편이 없고 조리능력이 있으며 식품 공급처에 대한 접근성이 용이한 도시나 중심지역에 거주하는 경우는 식품구매권(바우처 등) 형태의 지원이 적합할 수 있다고 제안하였다[ 20 마지막으로 장애인 식생활 지원 정책 및 제도의 활성화를 위한 전략 및 방법으로는 대상자의 수요와 요구를 고려한 맞춤형 프로그램 및 서비스 개발에 대한 우선순위가 가장 높은 것으로 나타났다. 장애의 원인과 유형이 복잡•다양하고 장애로 인한 각기 다른 건강상태와 이차장애 문제를 가질 수 있으므로 장애인의 건강 및 식생활 요구는 특수하고 개별적인 다양성을 조건으로 할 수밖에 없다. 따라서 장애인의 건강한 식생활을 지원하기 위한 정책 및 제도는 장애유형의 다양성과 고령화, 복합만성질환 이환과 같이 다각화된 장애인의 건강수요와 요구를 반영한 맞춤형 프로그램 및 서비스로 발굴•제공되어야 한다. 여기에는 장애인의 건강한 식생활 및 영양 관리를 위한 식생활지침의 개발, 영양상태 취약 장애인 및 그 가족에 대한 밀착전담 관리, 개별화된 건강상태 평가 및 영양요구 평가를 기반으로 하는 보충영양 지원 프로그램, 건강상태 및 섭취기능 등을 고려한 맞춤형·특수 식단의 개발 및 보급, 장애인과 그 가족, 활동보조사 등을 모두 포괄하는 적절한 영양 및 식생활 관리 방법에 대한 체계적인 교육, 지역사회 돌봄 자원과 연계한 통합적인 식생활 지원 및 모니터링 등이 포함될 수 있다. 또한, 장애인의 식생활 및 영양 실태에 관한 체계화된 조사 및 통계 구축, 정책적 활용을 위하여 국민건강영양조사나 국민식생활실태조사에 준하는 국가단위의 실태조사도 함께 추진되어야 한다[ 26 28 Limitations 본 연구는 다음과 같은 제한점을 가지고 있다. 첫째, 본 연구에서 수집한 설문자료는 자발적 표본추출 방법에 의해 전국 지자체 및 사회복지서비스 기관에서 취약계층 대상으로 영양관리사업 및 복지사업을 담당하고 있는 공무원 및 실무자 132명을 대상으로 하였기 때문에 표본 선정에 있어서 대표성을 가진다고 할 수 없으며, 본 연구 결과를 일반화하는데 어느 정도 제한이 있을 수 있다. 특히, 설문조사 참여자를 장애인 식생활 전문가로 제한하지 않았기 때문에 응답자들이 객관적이고 전문적인 지식을 바탕으로 장애인의 식생활에 대한 의견을 제시했다고 단언할 수 없다. 또한, 설문조사 당시에는 사회복지급식관리지원센터가 설치되기 이전인 관계로 장애인 사회복지시설 급식 분야의 전문가 및 실무자 의견을 충분하게 수렴하지 못했을 가능성이 있다. 둘째, 자기기입식 온라인 설문조사를 통해 직접적인 면대면 조사가 갖는 시공간적 한계와 부정적인 심리적 영향을 최소화할 수 있었지만, 전문가 의견수렴을 위한 조사방법으로 많이 활용되는 델파이 조사방법(Delphi method)이나 표적집단면접(focus group interview) 등에 비해서는 해당 내용에 대한 보다 심도 있는 논의를 하는 데 있어서 한계가 있었음을 부인할 수 없다. 마지막으로 연구의 주요 도구가 설문지법으로 제한되었기 때문에 응답자의 일반적 특성 및 외향성, 친화성, 성실성, 정서적 안정성, 경험에 대한 개방성 등의 성격 특성에 의한 응답 편향(response bias)의 가능성을 배제할 수 없다. conclusion 장애인 사회복지시설의 급식 영양관리를 체계적으로 지원하기 위해 사회복지급식관리지원센터가 설치되는 등의 발전적인 진전이 이루어졌고, 이러한 기반 위에 장애인의 식생활 지원과 관리의 중요성이 널리 인식된 만큼 이제는 더 나아가 시설에 거주하는 장애인뿐만 아니라 지역사회에 거주•자립 중인 장애인까지 모두 포괄할 수 있는 식생활 안전망의 구축이 필요하다. 수요자 중심의 실제적 필요와 요구를 충족시킬 수 있는 통합적인 식생활 지원 정책 및 제도가 적극적으로 추진되어야 할 것이다.  CONFLICT OF INTEREST There are no financial or other issues that might lead to conflict of interest.  FUNDING This work was supported by Basic Science Research Program through the National Research Foundation of Korea (NRF) funded by the Ministry of Education (No. 2019R1I1A1A01063639 and 2022R1I1A3070074) and the Korea government (MSIT) (No. 2021R1C1C2008683).  DATA AVAILABILITY The data that support the findings of this study are available from the authors upon reasonable request. REFERENCES 1 Ministry of Health and Welfare Status of registration of persons with disabilities (as of the end of December 2023) [Internet] Ministry of Health and Welfare 2024 [updated 2024 Apr 19; cited 2024 May 15]. Available from: https://www.mohw.go.kr/board.es?mid=a10412000000&bid=0020&act=view&list_no=1481131&tag=&nPage=1 2 Park JH Comprehensive plan for the right to health for persons with disabilities [Internet] The Human Rights Forum of Persons with Disabilities in Korea 2010 [cited 2024 April 16]. Available from: http://report.ableforum.com/webzine-prism/webzine?it_Seq=27&it_SubSeq=410 3 Kim HJ Lee SY Kim YJ Kim TY LEE HS 2020 disability statistics yearbook Korea Disabled People’s Development Institute 2020 Sep Report No. 정책 20-02 4 Park JH How to approach the health problem of people with disabilities? [Internet] PHI Issue Paper 2017 [cited 2024 Apr 16]. Available from: http://health.re.kr/?p=3844 5 National Rehabilitation Center 2018 Health care project for person with disabilities Ministry of Health and Welfare 2019 Apr Report No. 11-1352297-000271-10 6 Kim JY Kang MW Seo WY Lee JW Chronic diseases, health behaviors, and mortality in persons with disabilities: an analysis of the National Health Insurance Service-Health Screening (NHIS-HEALS) database Health Soc Welfare Rev 2020 40 2 121 150 7 Havercamp SM Scandlin D Roth M Health disparities among adults with developmental disabilities, adults with other disabilities, and adults not reporting disability in North Carolina Public Health Rep 2004 119 4 418 426 15219799 10.1016/j.phr.2004.05.006 PMC1497651 8 Lee DH Kim SY Park JE Jeon HJ Park JH Kawachi I Nationwide trends in prevalence of underweight, overweight, and obesity among people with disabilities in South Korea from 2008 to 2017 Int J Obes (Lond) 2022 46 3 613 622 34862471 10.1038/s41366-021-01030-x PMC8872979 9 Choi JY Yeob KE Hong SH Kim SY Jeong EH Shin DW Disparities in the diagnosis, treatment, and survival rate of cervical cancer among women with and without disabilities Cancer Control 2021 28 10732748211055268 35042390 10.1177/10732748211055268 PMC8771753 10 GBD 2017 Diet Collaborators Health effects of dietary risks in 195 countries, 1990-2017: a systematic analysis for the Global Burden of Disease Study 2017. Lancet 2019; 393(10184):1958-1972 Erratum in: Lancet 2021 397 10293 2466 10.1016/S0140-6736(19)30041-8 PMC6899507 30954305 11 Park JE Kim SY Kim SH Jeoung EJ Park JH Household food insecurity: comparison between families with and without members with disabilities Int J Environ Res Public Health 2020 17 17 6149 32847093 10.3390/ijerph17176149 PMC7504574 12 Choi SL Carr D Namkung EH Physical disability and older adults’ perceived food and economic insecurity during the COVID-19 pandemic J Gerontol B Psychol Sci Soc Sci 2022 77 7 e123 e133 34491329 10.1093/geronb/gbab162 PMC8522401 13 Gast DAA de Wit GLC van Hoof A de Vries JHM van Hemert B Didden R Diet quality among people with intellectual disabilities and borderline intellectual functioning J Appl Res Intellect Disabil 2022 35 2 488 494 34704323 10.1111/jar.12958 PMC9298221 14 Park JE Kim SY Park JH Inadequate nutrient intake in people with disabilities: national representative sample in Korea Eur J Public Health 2023 33 Suppl 2 ckad160.767 15 Park IS Kim SK Lee MS Lee JM Kang CI Park MW Bill for partial revision of the act on guarantee of right to health and access to medical services for persons with disabilitiess [Internet] Bill Information 2018 [cited 2023 Dec 23]. Available from: http://likms.assembly.go.kr/bill/billDetail.do?billId=PRC_R1I8A0I4E2M0A1G0O3I1K4Y4J5Q1R7 16 Lee C There are no persons with disabilities in the basic plan for national nutrition care/management in Korea [Internet] Ablenews 2017 [cited 2023 Dec 29]. Available from: https://www.ablenews.co.kr/news/articleView.html?idxno=71507 17 Ministry of Health and Welfare Korea Health Promotion Institute The 5th National Health Plan (Health Plan 2030, 2021-2030) Korea Health Promotion Institute 2022 Apr Report No. 정책-04-2022-008-01 18 Ministry of Health and Welfare The 3rd National Nutrition Management Basic Plan [Internet] Ministry of Health and Welfare 2022 [updated 2022 Jul 27; cited 2024 Apr 16]. Available from: https://www.mohw.go.kr/board.es?mid=a10107010100&bid=0046&act=view&list_no=372341&tag=&cg_code=&list_depth=1 19 Ministry of Health and Welfare Korea Institute for Health and Social Affairs 2020 Survey on the Status of Persons with Disabilities Ministry of Health and Welfare 2020 Dec Report No. 11-1352000-000568-12 20 Lee KI Hwang YJ Lee DS Kim GY Lee YN Kim KR Research on activating food support system Korea Rural Economic Institute 2012 Dec Report No. R680 21 Lee KI Kim S Kim B A study on enhancing the national agri-food assistance system for low-income households Korea Rural Economic Institute 2017 Report No. R818 22 Park JE Nutritional assessment and development of dietary behavior index for people with disabilities Ministry of Education 2021 [cited 2024 May 10]. Available from: https://scienceon.kisti.re.kr/srch/selectPORSrchReport.do?cn=TRKO202100012114&SITE=CLICK 23 Sim S KoDDISSUE: Policy Trends of People with Disabilities, 2nd half of 2019. Nutritional information such as dietary therapy and diet for prevention/management of obesity (chronic disease) and health promotion for disabled people [Internet] Korea Disabled People's Development Institute 2019 [cited 2024 May 15]. Available from: https://www.koddi.or.kr/bbs/ebook_koddiShoo.jsp 24 Huang J Guo B Kim Y Food insecurity and disability: do economic resources matter? Soc Sci Res 2010 39 1 111 124 25 Coleman-Jensen A U.S food insecurity and population trends with a focus on adults with disabilities Physiol Behav 2020 220 112865 32173340 10.1016/j.physbeh.2020.112865 26 Korea Disabled People’s Development Institute Disability and Life Dynamics Panel, 2022 Korea Disabled People’s Development Institute 2023 Dec Report No. 정책 22-27 27 Mayes SD Zickgraf H Atypical eating behaviors in children and adolescents with autism, ADHD, other disorders, and typical development Res Autism Spectr Disord 2019 64 76 83 28 Kim CI Development of national nutrition measures and strategies across the life span [Internet] Korea Health Industry Development Institute 2010 [cited 2024 May 10]. Available from: https://www.khepi.or.kr/kps/rsrhBusnRept/view?menuId=MENU00894&rsrh_idx=700 29 She P Livermore GA Material hardship, poverty, and disability among working-age adults Soc Sci Q 2007 88 4 970 989 30 Schwartz N Buliung R Wilson K Disability and food access and insecurity: a scoping review of the literature Health Place 2019 57 107 121 31026771 10.1016/j.healthplace.2019.03.011 31 Ministry of Food and Drug Safety of the Republic of Korea Act on assistance in ensuring meal service safety in social welfare facilities for senior citizens and persons with disabilities [Internet] Korean Law Information Center 2022 [cited 2024 May 10]. Available from: https://www.law.go.kr/%EB%B2%95%EB%A0%B9/%EB%85%B8%EC%9D%B8%E3%86%8D%EC%9E%A5%EC%95%A0%EC%9D%B8%EB%93%B1%EC%82%AC%ED%9A%8C%EB%B3%B5%EC%A7%80%EC%8B%9C%EC%84%A4%EC%9D%98%EA%B8%89%EC%8B%9D%EC%95%88%EC%A0%84%EC%A7%80%EC%9B%90%EC%97%90%EA%B4%80%ED%95%9C%EB%B2%95%EB%A5%A0 Table 1. General characteristics of the survey participants Variable All (n = 132) Responsibilities P Local government officials in charge of support and welfare services for PWD and other vulnerable groups (n = 44) Local government and public health center officials in charge of nutrition management projects (n = 34) Social workers and dietitians in private welfare institutions for PWD or other vulnerable groups (n = 54) Age (year) 0.139 20–29 28 (21.2) 13 (29.5) 7 (20.6) 8 (14.8) 30–39 54 (40.9) 19 (43.2) 16 (47.1) 19 (35.2) 40–49 34 (25.8) 7 (15.9) 6 (17.6) 21 (38.9) ≥ 50 16 (12.1) 5 (11.4) 5 (14.7) 6 (11.1) Sex 0.003 Male 33 (25.0) 14 (31.8) 1 (2.9) 18 (33.3) Female 99 (75.0) 30 (68.2) 33 (97.1) 36 (66.7) Responsible for face-to-face contact with vulnerable groups 0.532 Yes 95 (72.0) 29 (65.9) 25 (73.5) 41 (75.9) No 37 (28.0) 15 (34.1) 9 (26.5) 13 (24.1) Target group in charge (multiple responses) PWD < 0.001 Yes 85 (64.4) 32 (72.7) 4 (11.8) 49 (90.7) No 47 (35.6) 12 (27.3) 30 (88.2) 5 (9.3) Low-income earners < 0.001 Yes 54 (40.9) 18 (40.9) 26 (76.5) 10 (18.5) No 78 (59.1) 26 (59.1) 8 (23.5) 44 (81.5) Older adults 0.154 Yes 19 (14.4) 9 (20.5) 6 (17.6) 4 (7.4) No 113 (85.6) 35 (79.5) 28 (82.4) 50 (92.6) Other groups 1) < 0.001 Yes 31 (23.5) 9 (20.5) 18 (52.9) 4 (7.4) No 101 (76.5) 35 (79.5) 16 (47.1) 50 (92.6) Total work experience in the field (year) 0.004 < 1 22 (16.7) 11 (25.0) 7 (20.6) 4 (7.4) 1–2 27 (20.5) 14 (31.8) 7 (20.6) 6 (11.1) 3–5 31 (23.5) 9 (20.5) 7 (20.6) 15 (27.8) 6–9 22 (16.7) 7 (15.9) 7 (20.6) 8 (14.8) ≥10 30 (22.7) 3 (6.8) 6 (17.6) 21 (38.9) Administrative division of the affiliated institution 0.076 Seoul 40 (30.3) 15 (34.1) 4 (11.8) 21 (38.9) Six metropolitan cities 23 (17.4) 7 (15.9) 9 (26.5) 7 (13.0) Nine provinces 69 (52.3) 22 (50.0) 21 (61.8) 26 (48.1) n (%). PWD, persons with disabilities. 1) Includes single-parent families, North Korean defectors, and marriage immigrants. Table 2. Perception of the nutritional status of persons with disabilities Variable All (n = 132) Responsibilities P Local government officials in charge of support and welfare services for PWD and other vulnerable groups (n = 44) Local government and public health center officials in charge of nutrition management projects (n = 34) Social workers and dietitians in private welfare institutions for PWD and other vulnerable groups (n = 54) Perception of the nutritional status of PWD 0.026 Good or very good 41 (31.1) 19 (43.2) 5 (14.7) 17 (31.5) Bad or very bad 91 (68.9) 25 (56.8) 29 (85.3) 37 (68.5) Principal challenges of PWD in dietary and nutritional management 0.825 Inability to afford a good quality or satisfactory meal because of financial difficulties 22 (16.7) 8 (18.2) 7 (20.6) 7 (13.0) Insufficient information about nutrition and recipes to practice a healthy and balanced diet 31 (23.5) 9 (20.5) 8 (23.5) 14 (25.9) Difficulty in purchasing ingredients, cooking, and preparing meals without assistance because of their disability 71 (53.8) 25 (56.8) 18 (52.9) 28 (51.9) Other difficulties (e.g., difficulty in eating food, such as with chewing or swallowing) 8 (6.1) 2 (4.5) 1 (2.9) 5 (9.3) Major disability types that require the most assistance with dietary and nutritional management (multiple responses) Brain lesion 0.003 Yes 84 (63.6) 36 (81.8) 22 (64.7) 26 (48.1) No 48 (36.4) 8 (18.2) 12 (35.3) 28 (51.9) Physical disability 0.012 Yes 73 (55.3) 23 (52.3) 26 (76.5) 24 (44.4) No 59 (44.7) 21 (47.7) 8 (23.5) 30 (55.6) Intellectual disorder 0.007 Yes 72 (54.5) 21 (47.7) 13 (38.2) 38 (70.4) No 60 (45.5) 23 (52.3) 21 (61.8) 16 (29.6) Autistic disorder < 0.001 Yes 46 (34.8) 7 (15.9) 6 (17.6) 33 (61.1) No 86 (65.2) 37 (84.1) 28 (82.4) 21 (38.9) Visual disability 0.511 Yes 39 (29.5) 15 (34.1) 11 (32.4) 13 (24.1) No 93 (70.5) 29 (65.9) 23 (67.6) 41 (75.9) Mental disorder 0.582 Yes 23 (17.4) 9 (20.5) 4 (11.8) 10 (18.5) No 109 (82.6) 35 (79.5) 30 (88.2) 44 (81.5) Renal disease 0.535 Yes 17 (12.9) 4 (9.1) 6 (17.6) 7 (13.0) No 115 (87.1) 40 (90.9) 28 (82.4) 47 (87.0) Other disability types 0.200 Yes 35 (26.5) 15 (34.1) 10 (29.4) 10 (18.5) No 97 (73.5) 29 (65.9) 24 (70.6) 44 (81.5) n (%). PWD, persons with disabilities. Table 3. Need for support policies and systems for persons with disabilities Variable All (n = 132) Responsibilities P Local government officials in charge of support and welfare services for PWD and other vulnerable groups (n = 44) Local government and public health center officials in charge of nutrition management projects (n = 34) Social workers and dietitians in private welfare institutions for PWD and other vulnerable groups (n = 54) Needs for 10 types of basic support policies and systems for PWD (0–10 points) Guarantee of medical expenses 7.76 ± 2.51 (1st) 6.64 ± 2.89 (1st) 8.88 ± 1.63 (2nd) 7.96 ± 2.31 (2nd) < 0.001 Guarantee of human rights and prohibition of discrimination against PWD 7.74 ± 2.62 (2nd) 6.39 ± 3.00 (2nd) 8.94 ± 1.74 (1st) 8.09 ± 2.28 (1st) < 0.001 Health care for PWD 7.60 ± 2.52 (3rd) 6.34 ± 2.82 (3rd) 8.79 ± 1.68 (3rd) 7.87 ± 2.28 (3rd) < 0.001 Mobility rights guarantee 7.45 ± 2.44 (4th) 6.23 ± 2.68 (4th) 8.53 ± 1.69 (6th) 7.78 ± 2.25 (5th) < 0.001 Food and dietary security 7.44 ± 2.52 (5th) 6.05 ± 2.94 (5th) 8.59 ± 1.65 (4th) 7.85 ± 2.08 (4th) < 0.001 Guarantee of communication, access to information, and participation 7.31 ± 2.42 (6th) 5.91 ± 2.69 (6th) 8.44 ± 1.64 (7th) 7.74 ± 2.07 (6th) < 0.001 Vocational education and job guarantee 7.25 ± 2.53 (7th) 5.77 ± 2.62 (9th) 8.59 ± 1.73 (4th) 7.61 ± 2.29 (8th) < 0.001 Guarantee of childcare and education 7.17 ± 2.51 (8th) 5.89 ± 2.69 (7th) 8.24 ± 1.86 (8th) 7.56 ± 2.31 (9th) < 0.001 Basic income guarantee 7.14 ± 2.71 (9th) 5.73 ± 3.05 (10th) 8.18 ± 2.08 (9th) 7.63 ± 2.31 (7th) < 0.001 Housing guarantee 7.07 ± 2.68 (10th) 5.80 ± 3.07 (8th) 8.03 ± 2.11 (10th) 7.50 ± 2.28 (10th) < 0.001 Mean ± SD. PWD, persons with disabilities. Table 4. Needs and priorities for nutritional and dietary support policies and programs for persons with disabilities Variable All (n = 132) Responsibilities P Local government officials in charge of support and welfare services for PWD and other vulnerable groups (n = 44) Local government and public health center officials in charge of nutrition management projects (n = 34) Social workers and dietitians in private welfare institutions for PWD and other vulnerable groups (n = 54) Need for nutritional and dietary support policies and programs for PWD < 0.001 Very much needed 59 (44.7) 10 (22.7) 16 (47.1) 33 (61.1) Needed 69 (52.3) 30 (68.2) 18 (52.9) 21 (38.9) Not needed or not very much needed 4 (3.0) 4 (9.1) 0 (0.0) 0 (0.0) Priorities for support measures when introducing nutrition and food assistance programs for PWD 1) Delivery service of pre-cooked side dishes or lunch boxes 69 (52.3) 26 (59.1) 20 (58.8) 23 (42.6) 0.180 Providing meal preparation support services (e.g., preparing meals, cooking and serving, and grocery shopping) 55 (41.7) 17 (38.6) 16 (47.1) 22 (40.7) 0.744 Providing customized dietary education and nutrition management programs for PWD 34 (25.8) 8 (18.2) 9 (26.5) 17 (31.5) 0.324 Providing essential food assistance 32 (24.2) 12 (27.3) 6 (17.6) 14 (25.9) 0.575 Ready-to-cook meal kit or cooking box delivery services 25 (18.9) 9 (20.5) 7 (20.6) 9 (16.7) 0.857 Providing free meals at designated locations 24 (18.2) 6 (13.6) 4 (11.8) 14 (25.9) 0.155 Providing vouchers to purchase food or meals 23 (17.4) 10 (22.7) 6 (17.6) 7 (13.0) 0.448 n (%). PWD, persons with disabilities. 1) Multiple responses; The values indicate the proportion of responses corresponding to \"yes\" in a \"yes/no\" format. Table 5. Priority strategies for implementing and strengthening nutritional and dietary support policies and systems for persons with disabilities Variable All (n = 132) Responsibilities P Local government officials in charge of support and welfare services for PWD and other vulnerable groups (n = 44) Local government and public health center officials in charge of nutrition management projects (n = 34) Social workers and dietitians in private welfare institutions for PWD and other vulnerable groups (n = 54) Priority strategies for implementing and strengthening nutritional and dietary support policies and systems for PWD 0.099 Development of customized programs and services considering the needs of beneficiaries 49 (37.1) 11 (25.0) 11 (32.4) 27 (50.0) Establishment of a dedicated department and placement of dedicated personnel 31 (23.5) 12 (27.3) 9 (26.5) 10 (18.5) Integration of support systems for PWD 15 (11.4) 7 (15.9) 3 (8.8) 5 (9.3) Establishment of legal and institutional frameworks for support 15 (11.4) 5 (11.4) 7 (20.6) 3 (5.6) Expanding beneficiaries and the scope of support 11 (8.3) 2 (4.5) 3 (8.8) 6 (11.1) Well-designed support delivery systems 11 (8.3) 7 (15.9) 1 (2.9) 3 (5.6) n (%). PWD, persons with disabilities. ",
  "metadata": {
    "Title of this paper": "Act on assistance in ensuring meal service safety in social welfare facilities for senior citizens and persons with disabilities [Internet]",
    "Journal it was published in:": "Korean Journal of Community Nutrition",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12382330/"
  }
}