{
  "title": "Paper_149",
  "abstract": "pmc Mob DNA Mob DNA 1199 mdna Mobile DNA 1759-8753 BMC PMC12495673 PMC12495673.1 12495673 12495673 41044661 10.1186/s13100-025-00376-7 376 1 Research Strict retroelement regulation is frequently lost following cancer transformation and generates a promising reservoir of cancer biomarkers Russ Eric 1 2 3 4 6 http://orcid.org/0000-0002-9279-8755 Iordanskiy Sergey sergey.iordanskiy@usuhs.edu 1 5 1 https://ror.org/04r3kq386 grid.265436.0 0000 0001 0421 5525 Department of Pharmacology & Molecular Therapeutics, Uniformed Services University of the Health Sciences, 2 https://ror.org/04q9tew83 grid.201075.1 0000 0004 0614 9826 The Henry M. Jackson Foundation for the Advancement of Military Medicine, 3 https://ror.org/04r3kq386 grid.265436.0 0000 0001 0421 5525 The American Genome Center (TAGC), Collaborative Health Initiative Research Program, Uniformed Services University of the Health Sciences, 4 https://ror.org/04r3kq386 grid.265436.0 0000 0001 0421 5525 Graduate Program of Cellular and Molecular Biology, Uniformed Services University of the Health Sciences, 5 https://ror.org/04r3kq386 grid.265436.0 0000 0001 0421 5525 Armed Forces Radiobiology Research Institute, Uniformed Services University of the Health Sciences, 6 https://ror.org/00f54p054 grid.168010.e 0000 0004 1936 8956 Department of Pediatrics, Stanford University, 3 10 2025 2025 16 478513 37 14 4 2025 8 9 2025 03 10 2025 05 10 2025 05 10 2025 © This is a U.S. Government work and not under copyright protection in the US; foreign copyright protection may apply 2025 2025 https://creativecommons.org/licenses/by/4.0/ Open Access http://creativecommons.org/licenses/by/4.0/ Background Retroelements are repetitive sequences that comprise 42% of the human genome and are strictly regulated through various epigenetic mechanisms. Examining retroelement expression on a locus-specific level in relation to cancer can uncover distinct disease signatures. Results Using over 5000 RNA-sequencing samples, we assessed retroelement transcription across 23 tissue systems, 159 cell types, 1019 cancer cell lines, and cells isolated from various stages of embryogenesis using the specialized software tool, Telescope. In healthy individuals, 11,388 retroelements were found to be actively transcribed and dynamically regulated in a tissue- and cell type-dependent manner. Using the adult human body as a reference, we observed that 94% of cancer cell lines displayed elevated transcription of at least one cancer-specific retroelement, providing a three-fold larger reservoir of cancer biomarkers (1182) than our comparable analysis of annotated protein-coding genes (338). The precise retroelements that were transcribed following tumorigenesis were influenced by the originating location, with cancers of the blood, lungs, and soft tissue displaying the highest origin-specific activation. Moreover, nearly half of the cancer-specific retroelement loci, mostly from the HERV-H family, were found to be expressed during early embryonic development. Conclusions Our data demonstrate that elevated transcription of certain tissue-specific and embryonic retroelements can be considered as a hallmark of tumorigenesis. Supplementary Information The online version contains supplementary material available at 10.1186/s13100-025-00376-7. Keywords Retroelements HERV HML-2 LINE1 Tumorigenesis Embryonic development HERV-H Cancer biomarkers https://doi.org/10.13039/100000090 Congressionally Directed Medical Research Programs JPC-7 2018 BA1-1 https://doi.org/10.13039/100012414 Armed Forces Radiobiology Research Institute, Uniformed Services University AFR-11611 https://doi.org/10.13039/100000002 National Institutes of Health R21 AI173847 pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement yes pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes issue-copyright-statement © BioMed Central Ltd., part of Springer Nature 2025 Background Retroelements represent a substantial portion of the human genome (42.2%) and are divided into two broad groups based on the presence of a long-terminal repeat (LTR) region [ 1 2 3 7 8 10 Due to the sequence homology of closely related retroelements, traditional techniques such as RT-qPCR and immunochemistry methods cannot efficiently distinguish between individual loci on the same scale as they can with annotated protein-coding genes. Despite exceptions for some distinct loci, investigations of retroelement expression have generally been restricted to the family or subfamily level. Initially, there were several meaningful attempts to overcome this limitation and study retroelements on a locus-specific level, with mixed results [ 11 14 11 12 14 In light of the read length limits of early RNA-sequencing (RNA-seq) technology (25-36 bp), multi-mapped reads (reads that map to more than one genomic coordinate) were discarded due to the added complexity compared to uniquely mapped reads (reads that map to a single genomic coordinate) [ 15 16 17 17 18 As retroelements transition into a standard component of the RNA-seq pipeline, a dedicated retroelement database is required for researchers to access, probe, and compare data throughout a broad spectrum of contexts. Herein, we present a comprehensive exploration of the retro-transcriptome, starting with an analysis of the RNA Atlas, a collection of paired PolyA RNA-seq and Total RNA-seq samples for non-diseased cell types and tissues across the human body. Previous studies relied on the Genotype-Tissue Expression (GTEx) RNA-seq dataset, which was designed to detect protein-coding genes and therefore only includes polyadenylated transcripts [ 19 20 Methods Publicly available datasets All of the RNA-sequencing samples are accessible on the GEO website with the access numbers: GSE138724 GSE36552 GSE63570 21 RNA-sequencing data acquisition and preparation for pipelines The data acquisition and analyses were conducted using the Ubuntu 23.10 operating system. Publicly available raw FASTQ files were downloaded from the NCBI Gene Expression Omnibus repository using the ‘prefetch’ command from the NCBI SRA Toolkit (version 3.0.10) as .sra GDC pipeline The GDC mRNA pipeline analyses gene level expression with STAR (version 2.7.10b in our case) as both the aligner and the quantifier. The current pipeline is referred to as Data Release 32 (Dr32) and can be found on their website or our database. The current reference genome used by the GDC mRNA pipeline is GRCh38.d1.vd1.fa and the current GTF file is gencode.v36.annotation.gtf. The output of the GDC pipeline is a count table with four columns: a gene ID column, followed by three count columns. The three count columns represent the counts for unstranded, forward-stranded, and reverse-stranded RNA-sequencing data. Depending on the type of sequencing, the appropriate count column was extracted from each sample and combined into a single count table, containing all of the samples for the entire dataset. Since the GDC pipeline quantifies noncoding RNAs (albeit, in a relatively inefficient manner since it only keeps uniquely mapped reads), which are not assessed in this study, we specifically extracted annotated protein-coding genes from this count table. To do so, we generated an index of protein-coding genes, as identified by the “gene_types” annotation within the gencode.v36.annotation.gtf file. This was conducted in R, with the code presented in our database. Telescope pipeline The Telescope pipeline analyses retroelement expression on a locus-specific level from BAM files generated by the aligner, bowtie2 (version 2.5.0–3; other alignment packages may suffice, but we did not deviate from the authors’ published pipeline, which uses bowtie2). The reference genome hg38 from the UCSC Genome Browser website was used to build the reference index with the bowtie2-build command. To generate BAM files, we followed the settings suggested by the authors of Telescope. Then we used Telescope to quantify retroelement expression. Similarly, to the GDC pipeline, the count column was extracted from each sample and combined into a single count table, containing all of the samples for the entire dataset. Analysis of gene or retroelement expression This study analyses two sources of RNA: annotated protein-coding genes and retroelements (specifically, HERVs and L1s). To normalize both sources of RNA together, the table generated from the GDC pipeline was combined with the table from the Telescope pipeline (GDC pipeline on top, Telescope pipeline on bottom) to produce a single count table. Read counts were then imported into R and analyzed with edgeR to normalize the raw data into TPM values and to determine the fold-changes and p-values (when applicable). A limitation of this process is that exonic reads from the GDC pipeline, which overlap with retroelements detected by the Telescope pipeline, are double-counted and may influence the detection of genes or retroelements that fall near our defined TPM cutoff. Detectable expression was defined as > 1 TPM in at least one sample. This value implies that a transcript is present at least once out of one million transcripts present in the cell (single-cell RNA-seq) or cell population (bulk RNA-seq). While we chose a TPM cutoff of > 1, the value may be increased or decreased, depending on the purpose of the analysis and the quality of the expression data. To perform your own analysis, we offer the raw count tables and the non-filtered TPM count tables in our database. Determination of PolyA:Total TPM ratio To compare the relative rate of polyadenylation between retroelements and annotated protein-coding genes, we calculated the PolyA:Total TPM ratio by dividing the TPM value obtained from PolyA RNA-seq by the corresponding TPM value from Total RNA-seq for the same sample, as shown below: \\documentclass[12pt]{minimal}\n\t\t\t\t\\usepackage{amsmath}\n\t\t\t\t\\usepackage{wasysym} \n\t\t\t\t\\usepackage{amsfonts} \n\t\t\t\t\\usepackage{amssymb} \n\t\t\t\t\\usepackage{amsbsy}\n\t\t\t\t\\usepackage{mathrsfs}\n\t\t\t\t\\usepackage{upgreek}\n\t\t\t\t\\setlength{\\oddsidemargin}{-69pt}\n\t\t\t\t\\begin{document}$$\\text{PolyA}/\\text{Total ratio}=\\frac{{\\text{TPM}}_{\\text{PolyA RNA}-\\text{seq}}}{{\\text{TPM}}_{\\text{Total RNA}-\\text{seq}}}$$\\end{document} PolyA / Total ratio = TPM PolyA RNA - seq TPM Total RNA - seq For analyses across the human body, only retroelements detectable by PolyA RNA-seq (TPM > 1) in at least one sample were included. In these cases, the average TPM value across the entire sequencing platform (e.g., PolyA RNA-seq) was used to calculate the ratio. For analyses of a specific cell type, only the paired PolyA RNA-seq and Total RNA-seq TPM values for that individual cell type were included. Results Building a retro-transcriptome database across the human body, cancer cell lines, and embryonic development As outlined in Fig. 1 22 17 Fig. 1 Building a retro-transcriptome database across the human body, cancer cell lines, and embryonic development. A B C 21 The datasets used in this study to assess the retro-transcriptome across the human body, cancer, and embryogenesis are publicly available on the Gene Expression Omnibus (GEO) website (Fig. 1 C GSE138734 23 GSE36552 GSE63570 The data generated from this study can be accessed from our newly generated database, Retroelementdb.com 21 Total RNA-seq is essential for capturing the retro-transcriptomic landscape We first sought to build a reference list of retroelements expressed in non-diseased conditions. For the purposes of this study, our analysis does not distinguish between independent and dependent (the retroelement is a part of a parent transcript) retroelement expression, as the retroelement sequence is transcribed and present within the cell in either case. Across the human body, transcription of 18,556 annotated protein-coding genes and 11,388 retroelements were detected in at least one cell type or tissue (Fig. 2 19 20 24 Fig. 2 Total RNA-seq is essential for capturing the retro-transcriptomic landscape. A B C D Among the retroelement loci that are detected via PolyA RNA-sequencing, an important question is whether they experience similar or dissimilar rates of polyadenylation compared to annotated protein-coding genes. To estimate if a retroelement is efficiently polyadenylated or consistently preserved within a polyadenylated transcript (presumably, mRNA(s) derived from their host gene), we calculated the ratio of the transcript per million (TPM) values obtained from PolyA RNA-seq and Total RNA-seq (detailed further in Methods). To provide context, annotated protein-coding genes generally have a PolyA:Total TPM ratio of one in our analysis (or a log 2 2 23 25 Retroelements can exist as independent genomic elements, known as intergenic loci, or they can reside within annotated genes. Based on the retroelement’s genomic coordinates in relation to annotated genes, Telescope assigns each retroelement as either intergenic, intronic or exonic. All types of retroelements were inefficiently captured by PolyA RNA-seq, but with a bias in favor of exon-residing retroelements compared to intronic or intergenic loci (Fig. 2 26 Among the sixty HERV families, with each HERV-K subfamily counted as an independent family for simplicity, the highest number of expressed HERV loci were from the ERVLE (937 loci), ERV316A3 (836 loci), ERVLB4 (510 loci), HERVL (485 loci), and HERVH (338 loci) families (Fig. 2 Retroelement expression is tissue- and cell lineage-dependent Retroelement expression is known to be tightly regulated, with the expression patterns of individual loci shaped by both the tissue system (e.g., kidney versus heart) and alterations to the physiological context (e.g., resting versus activated states) [ 20 27 28 Using a TPM cutoff of > 1, we identified 265 retroelements that were detected in at least one cell type or bulk tissue sample from each of the 23 defined tissue systems (Fig. 3 3 Fig. 3 Cell type-specific and non-specific retroelements. A B C D E F By comparing the retro-transcriptome of each tissue system, we identified 4343 retroelement loci with apparent tissue-specific expression (Fig. 3 1 B In the 159 cell types examined, we identified 2334 retroelements with cell type-specific expression (Fig. 3 3 D Given that the HML-2 subfamily is suggested to have a high degree of biological activity [ 6 8 29 30 3 28 20 A total of 11 HML-2 proviruses were cell type-specific, including HML2_11p15.4b, HML2_5p12, HML2_11q12.1, HML2_4p16.1b, HML2_19q13.41a, HML2_22q11.23, HML2_1q43, HML2_4p16.3b, HML2_10q24.2, HML2_3p25.3, HML2_17p13.1 (Fig. 3 Retroelements are mostly non-polyadenylated and are retained within the nucleus RNA localization can influence its function and targetability [ 31 34 GSE30567 35 4 Fig. 4 Retroelements are mostly retained within the nucleus. A B C D F Despite most retroelements being non-polyadenylated and retained within the nucleus, four main patterns of polyadenylation and nuclear export can be observed, with members of the HML-2 subfamily serving as examples (Fig. 4 4 C 36 37 38 39 Retroelements such as HML2_3q12.3 are inefficiently polyadenylated but still undergo nuclear export (Fig. 4 4 4 Retroelements constitute the major ratio of cancer-specific transcripts To identify retroelements that are specifically expressed in cancer cells, we analyzed PolyA RNA-seq data for all 1019 cancer cell lines included in the CCLE dataset. Despite the limitation that PolyA RNA-seq cannot capture the majority of transcribed retroelements, the CCLE contains the largest collection of cancer cell lines by a considerable degree. As a reference for a non-diseased adult human body, we used the RNA Atlas dataset illustrated in Fig. 1 From this comparison, we found that 338 annotated protein-coding genes were cancer-specific, in contrast to 1182 retroelements (Fig. 5 5 40 Fig. 5 Retroelements constitute the major ratio of cancer-specific transcripts. A B C D E The cell lines from the CCLE are classified as originating from one of twenty-five lineages (for simplicity, we will refer to them as tissues; refer to Supplemental Table S10 for each tissue and associated cell line). The tissues, as defined by the CCLE, are not entirely congruent with the tissues defined by the RNA Atlas and should not be viewed as inherently cross-compatible. We found that cancers from every tissue (using the CCLE’s classifications for tissues) expressed cancer-specific retroelements (Fig. 5 5 5 Eleven HML-2 proviruses were found to be cancer-specific (Fig. 5 41 To verify our findings, we compared these eleven HML-2 proviruses with an analysis of the GTEx dataset that focused solely on the HML-2 subfamily [ 20 Embryogenesis is a significant source of stemness-associated cancer-specific retroelements ESCs are pluripotent cells that constitute the inner cell mass of the blastocyst during embryogenesis. Their self-renewal properties (the ability to proliferate indefinitely, in vitro) are reminiscent of those seen in cancer stem cells (CSCs), with many shared markers between them [ 42 43 44 44 GSE36552 6 45 46 6 46 47 Fig. 6 Embryogenesis is an important source of stemness-associated cancer-specific retroelements. A B C D E F P P To determine if embryonic-specific retroelements are reactivated during tumorigenesis, we performed a comparison with the cancer-specific retroelements identified from the CCLE dataset (Fig. 6 6 48 49 Among the 35 potential protein-coding retroelements that are dual embryonic- and cancer-specific, three loci comprise greater than 94% of the sum for these transcripts during embryogenesis (HERVE_16q23.1, HML2_22q11.21, and HML4_10p15.1) (Supplemental Fig. S4A). Interestingly, HERVE_16q23.1 and HML4_10p15.1 are highly expressed during the oocyte to 4-cell or morulae cell stages, respectively, but repressed at the blastocyst stage (Supplemental Fig. S4B). Conversely, HML2_22q11.21 is repressed until the 8-cell stage and experiences a boost in mean expression as the blastocyst develops ESCs (Fig. 6 6 GSE63570 6 Discussion Repositories of expression data are readily available for annotated genes, allowing researchers to easily assess the relationship between transcripts and pathological conditions, but a comparable resource for retroelements is notably absent [ 24 41 50 51 Our analysis of non-diseased tissues corroborates previous evidence that retroelements are actively transcribed and dynamically regulated in human adults [ 19 20 52 54 55 Our survey of 1019 cancer cell Lines from the CCLE suggests that retroelements provide a three-fold larger reservoir of cancer-specific RNA markers compared to same analysis for annotated host protein-coding genes. Considering that the CCLE dataset is based on PolyA RNA-seq and does not incorporate Total RNA-seq, our identified 1182 cancer-specific retroelements is Likely a significant underestimation that only accounts for the contribution of polyadenylated transcripts. Applying the same sequencing methodology as the RNA Atlas on a sample size as large as the CCLE would undoubtedly uncover an even larger and more diverse repertoire of cancer-specific retroelements. Even so, we found that retroelement activation during or following tumorigenesis is a nearly universal phenomenon. Over 94% of cancer cell lines were observed to express at least one cancer-specific retroelement, a substantial fraction (~ 37%) of which are predicted to be protein-coding, providing a source of potential targets for immunotherapy [ 56 57 7 58 Fig. 7 Selective retroelement activation during tumorigenesis. Tissue-related and embryogenesis-associated cancer-specific retroelements in different types of cancer: the number of retroelements for each tissue that are cancer-specific, cancer- and embryonic-specific or cancer- and tissue-specific. The most commonly expressed cancer-specific retroelement in each tissue origin is highlighted, with its frequency in the cancer cell line population represented as a percent The observation that approximately 41% of the cancer-specific retroelements reflect reactivation events of embryonically expressed retroelements that undergo silencing prior to adulthood is particularly interesting. Although information on these individual loci is limited, previous evidence suggests that disruption of either HERV or LINE expression during embryogenesis negatively impacts ESC pluripotency and embryo development [ 48 49 59 60 61 62 A limitation of this study is that we primarily focused on the uniqueness of a retroelement’s expression to a specific context, without assessing the relative expression or rate of polyadenylation between contexts. For instance, the intronic provirus HML2_5q33.3, located in an antisense direction within the sarcoglycan delta (SGCD) gene, was detected with Total RNA-seq in several tissues but lost during polyA enrichment (Supplemental Table S18). Based on the level of SGCD expression, it is likely that HML2_5q33.3 is spliced-out during RNA maturation and rapidly degraded in normal tissues. Conversely, this retroelement was highly expressed as a polyadenylated transcript in passage 0 of ESCs while its host gene was unexpressed (Supplemental Table S19). This suggests that HML2_5q33.3 can drive its own expression depending on the context and may mediate an embryonic-associated function, which could potentially be recapitulated in certain types of cancers. Similarly, cancer-enriched retroelements, even if they are expressed in a portion of non-diseased tissues, may still act as useful biomarkers or targets. Another context not considered in this study, but deserving of exploration in a future project, is the impact of epigenetic regulation on retroelement expression and its relevance to different pathological conditions. A technical limitation of this study is our use of Telescope, which does not distinguish between independent and dependent transcription. Conclusions The findings presented herein corroborate previous evidence that retroelements are active and dynamically regulated in normal cells, often exhibiting cell type- or tissue-dependent expression patterns. Based on our reference dataset of normal retroelements, we demonstrated that general retroelement activation during tumorigenesis is a universal phenomenon. Retroelements provide a three-fold larger reservoir of cancer-specific transcripts in comparison to annotated protein-coding genes, highlighting their importance in cancer studies. The activation of specific retroelements during tumorigenesis appears to be influenced by the tissue of origin, possibly due to differences in the epigenetic states of normal cells across tissue systems. Furthermore, analysis of retroelement expression in cancer cells compared to that during embryonic development revealed that two thirds of retroelements reactivated in tumorigenesis are active in early embryonic development, suggesting that tumorigenesis results in the reawakening of pluripotency-associated retroelements whose functions are largely unknown. The results of this study provide a practical resource for future analyses into the functional roles or translational impacts of retroelements in both normal and diseased conditions. To facilitate these studies, we established a catalog containing the retro-transcriptome of 1019 cancer cell lines. Depending on the goal, the retroelements or cell lines can be sorted to identify the optimal retroelement-to-cancer cell line pairing. In addition, we provide a database with all of our raw and processed RNA-sequencing files, Retroelementdb.com 21 Supplementary Information  Supplementary Material 1: Supplemental figures: Figures S1, S2, S3 and S4  Supplementary Material 2: Supplemental tables: Excel file containing additional information too large to fit in a PDF, Supplemental Tables S1-S19 Publisher's Note Springer Nature remains neutral with regard to jurisdictional claims in published maps and institutional affiliations. Acknowledgements We thank the members of the Department of Pharmacology USUHS and Scientific Research Department AFRRI for being productive discussions and helping with material resources. We are grateful to Clifton Dalgard from the Department of Anatomy, Physiology and Genetics USUHS for his valuable comments. Code availability All code used in this study can be found on Retroelementdb.com under the “Sample Code” tab [ 21 Disclaimer The opinions or assertions contained herein are the private views of the authors and are not necessarily those of the Uniformed Services University of the Health Sciences or the Department of Defense, USA. Authors' contributions ER conducted this study, performed data analysis, and wrote the original draft of the manuscript. SI supervised the project, acquired funding and contributed to writing the final version of the manuscript. All authors contributed to the article and approved the submitted version. Funding This work was supported by the National Institute of Health (NIH) grant R21 AI173847 (to SI), the grant from the Congressionally Directed Medical Research Program (JPC-7 2018 BA1-1 to S.I.), and DoD research grants for Armed Forces Radiobiology Research Institute (AFR-11611 to SI and AFR-12878 to SI). E.R. is a recipient of The Center for Military Precision Health (CMPH) fellowship. Data availability The retroelement expression data generated in this study can be downloaded from our database, Retroelementdb.com [ 21 Declarations Ethics approval and consent to participate The manuscript does not report studies involving human participants, personal human data or human tissues and animals. Consent for publication Not applicable. Competing interests The authors declare no competing interests. References 1. Sukapan P Promnarate P Avihingsanon Y Mutirangura A Hirankarn N Types of DNA J Hum Genet 2014 59 4 178 188 10.1038/jhg.2013.140 24430577 Sukapan P, Promnarate P, Avihingsanon Y, Mutirangura A, Hirankarn N. Types of DNA 24430577 10.1038/jhg.2013.140 2. Grandi N Tramontano E Human endogenous retroviruses are ancient acquired elements still shaping innate immune responses Front Immunol 2018 9 2039 10.3389/fimmu.2018.02039 30250470 PMC6139349 Grandi N, Tramontano E. Human endogenous retroviruses are ancient acquired elements still shaping innate immune responses. Front Immunol. 2018;9:2039. 30250470 10.3389/fimmu.2018.02039 PMC6139349 3. Dupressoir A Lavialle C Heidmann T From ancestral infectious retroviruses to bona fide cellular genes: role of the captured syncytins in placentation Placenta 2012 33 9 663 671 10.1016/j.placenta.2012.05.005 22695103 Dupressoir A, Lavialle C, Heidmann T. From ancestral infectious retroviruses to bona fide cellular genes: role of the captured syncytins in placentation. Placenta. 2012;33(9):663–71. 22695103 10.1016/j.placenta.2012.05.005 4. Kremer D Schichel T Forster M Tzekova N Bernard C van der Valk P Human endogenous retrovirus type W envelope protein inhibits oligodendroglial precursor cell differentiation Ann Neurol 2013 74 5 721 32 10.1002/ana.23970 23836485 Kremer D, Schichel T, Forster M, Tzekova N, Bernard C, van der Valk P, et al. Human endogenous retrovirus type W envelope protein inhibits oligodendroglial precursor cell differentiation. Ann Neurol. 2013;74(5):721–32. 23836485 10.1002/ana.23970 5. Li W Lee MH Henderson L Tyagi R Bachani M Steiner J Human endogenous retrovirus-k contributes to motor neuron disease Sci Transl Med 2015 7 307 307ra153 10.1126/scitranslmed.aac8201 26424568 PMC6344353 Li W, Lee MH, Henderson L, Tyagi R, Bachani M, Steiner J, et al. Human endogenous retrovirus-k contributes to motor neuron disease. Sci Transl Med. 2015;7(307):307ra153. 26424568 10.1126/scitranslmed.aac8201 PMC6344353 6. Garcia-Montojo M Doucet-O’Hare T Henderson L Nath A Human endogenous retrovirus-K (HML-2): a comprehensive review Crit Rev Microbiol 2018 44 6 715 38 10.1080/1040841X.2018.1501345 30318978 PMC6342650 Garcia-Montojo M, Doucet-O’Hare T, Henderson L, Nath A. Human endogenous retrovirus-K (HML-2): a comprehensive review. Crit Rev Microbiol. 2018;44(6):715–38. 30318978 10.1080/1040841X.2018.1501345 PMC6342650 7. Steiner JP Bachani M Malik N DeMarino C Li W Sampson K Human endogenous retrovirus k envelope in spinal fluid of amyotrophic lateral sclerosis is toxic Ann Neurol 2022 92 4 545 61 10.1002/ana.26452 35801347 PMC9489628 Steiner JP, Bachani M, Malik N, DeMarino C, Li W, Sampson K, et al. Human endogenous retrovirus k envelope in spinal fluid of amyotrophic lateral sclerosis is toxic. Ann Neurol. 2022;92(4):545–61. 35801347 10.1002/ana.26452 PMC9489628 8. Russ E Iordanskiy S Endogenous retroviruses as modulators of innate immunity Pathogens 2023 10.3390/pathogens12020162 36839434 PMC9963469 Russ E, Iordanskiy S. Endogenous retroviruses as modulators of innate immunity. Pathogens. 2023. 10.3390/pathogens12020162. 36839434 10.3390/pathogens12020162 PMC9963469 9. Chiappinelli KB Strissel PL Desrichard A Li H Henke C Akman B Inhibiting DNA methylation causes an interferon response in cancer via dsRNA including endogenous retroviruses Cell 2015 162 5 974 986 10.1016/j.cell.2015.07.011 26317466 PMC4556003 Chiappinelli KB, Strissel PL, Desrichard A, Li H, Henke C, Akman B, et al. Inhibiting DNA methylation causes an interferon response in cancer via dsRNA including endogenous retroviruses. Cell. 2015;162(5):974–86. 26317466 10.1016/j.cell.2015.07.011 PMC4556003 10. Di Giorgio E Ranzino L Tolotto V Dalla E Burelli M Gualandi N Transcription of endogenous retroviruses in senescent cells contributes to the accumulation of double-stranded RNAs that trigger an anti-viral response that reinforces senescence Cell Death Dis 2024 15 2 157 10.1038/s41419-024-06548-2 38383514 PMC10882003 Di Giorgio E, Ranzino L, Tolotto V, Dalla E, Burelli M, Gualandi N, et al. Transcription of endogenous retroviruses in senescent cells contributes to the accumulation of double-stranded RNAs that trigger an anti-viral response that reinforces senescence. Cell Death Dis. 2024;15(2):157. 38383514 10.1038/s41419-024-06548-2 PMC10882003 11. Flockerzi A Ruggieri A Frank O Sauter M Maldener E Kopper B Expression patterns of transcribed human endogenous retrovirus HERV-K(HML-2) loci in human tissues and the need for a HERV transcriptome project BMC Genomics 2008 9 354 10.1186/1471-2164-9-354 18664271 PMC2525661 Flockerzi A, Ruggieri A, Frank O, Sauter M, Maldener E, Kopper B, et al. Expression patterns of transcribed human endogenous retrovirus HERV-K(HML-2) loci in human tissues and the need for a HERV transcriptome project. BMC Genomics. 2008;9:354. 18664271 10.1186/1471-2164-9-354 PMC2525661 12. Schmitt K Reichrath J Roesch A Meese E Mayer J Transcriptional profiling of human endogenous retrovirus group HERV-K(HML-2) loci in melanoma Genome Biol Evol 2013 5 2 307 328 10.1093/gbe/evt010 23338945 PMC3590776 Schmitt K, Reichrath J, Roesch A, Meese E, Mayer J. Transcriptional profiling of human endogenous retrovirus group HERV-K(HML-2) loci in melanoma. Genome Biol Evol. 2013;5(2):307–28. 23338945 10.1093/gbe/evt010 PMC3590776 13. Bhardwaj N Montesion M Roy F Coffin JM Differential expression of HERV-K (HML-2) proviruses in cells and virions of the teratocarcinoma cell line Tera-1 Viruses 2015 7 3 939 968 10.3390/v7030939 25746218 PMC4379556 Bhardwaj N, Montesion M, Roy F, Coffin JM. Differential expression of HERV-K (HML-2) proviruses in cells and virions of the teratocarcinoma cell line Tera-1. Viruses. 2015;7(3):939–68. 25746218 10.3390/v7030939 PMC4379556 14. Douville R Liu J Rothstein J Nath A Identification of active loci of a human endogenous retrovirus in neurons of patients with amyotrophic lateral sclerosis Ann Neurol 2011 69 1 141 151 10.1002/ana.22149 21280084 PMC3052883 Douville R, Liu J, Rothstein J, Nath A. Identification of active loci of a human endogenous retrovirus in neurons of patients with amyotrophic lateral sclerosis. Ann Neurol. 2011;69(1):141–51. 21280084 10.1002/ana.22149 PMC3052883 15. Chhangawala S Rudy G Mason CE Rosenfeld JA The impact of read length on quantification of differentially expressed genes and splice junction detection Genome Biol 2015 16 1 131 10.1186/s13059-015-0697-y 26100517 PMC4531809 Chhangawala S, Rudy G, Mason CE, Rosenfeld JA. The impact of read length on quantification of differentially expressed genes and splice junction detection. Genome Biol. 2015;16(1):131. 26100517 10.1186/s13059-015-0697-y PMC4531809 16. Tokuyama M Kong Y Song E Jayewickreme T Kang I Iwasaki A ERVmap analysis reveals genome-wide transcription of human endogenous retroviruses Proc Natl Acad Sci U S A 2018 115 50 12565 12572 10.1073/pnas.1814589115 30455304 PMC6294949 Tokuyama M, Kong Y, Song E, Jayewickreme T, Kang I, Iwasaki A. ERVmap analysis reveals genome-wide transcription of human endogenous retroviruses. Proc Natl Acad Sci U S A. 2018;115(50):12565–72. 30455304 10.1073/pnas.1814589115 PMC6294949 17. Bendall ML de Mulder M Iniguez LP Lecanda-Sanchez A Perez-Losada M Ostrowski MA Telescope: Characterization of the retrotranscriptome by accurate estimation of transposable element expression PLoS Comput Biol 2019 15 9 e1006453 10.1371/journal.pcbi.1006453 31568525 PMC6786656 Bendall ML, de Mulder M, Iniguez LP, Lecanda-Sanchez A, Perez-Losada M, Ostrowski MA, et al. Telescope: Characterization of the retrotranscriptome by accurate estimation of transposable element expression. PLoS Comput Biol. 2019;15(9):e1006453. 31568525 10.1371/journal.pcbi.1006453 PMC6786656 18. Duarte RRR Pain O Bendall ML de Mulder RM Marston JL Selvackadunco S Integrating human endogenous retroviruses into transcriptome-wide association studies highlights novel risk factors for major psychiatric conditions Nat Commun 2024 15 1 3803 10.1038/s41467-024-48153-z 38778015 PMC11111684 Duarte RRR, Pain O, Bendall ML, de Mulder RM, Marston JL, Selvackadunco S, et al. Integrating human endogenous retroviruses into transcriptome-wide association studies highlights novel risk factors for major psychiatric conditions. Nat Commun. 2024;15(1):3803. 38778015 10.1038/s41467-024-48153-z PMC11111684 19. Larouche JD Trofimov A Hesnard L Ehx G Zhao Q Vincent K Widespread and tissue-specific expression of endogenous retroelements in human somatic tissues Genome Med 2020 12 1 40 10.1186/s13073-020-00740-7 32345368 PMC7189544 Larouche JD, Trofimov A, Hesnard L, Ehx G, Zhao Q, Vincent K, et al. Widespread and tissue-specific expression of endogenous retroelements in human somatic tissues. Genome Med. 2020;12(1):40. 32345368 10.1186/s13073-020-00740-7 PMC7189544 20. Burn A Roy F Freeman M Coffin JM Widespread expression of the ancient HERV-K (HML-2) provirus group in normal human tissues PLoS Biol 2022 20 10 e3001826 10.1371/journal.pbio.3001826 36256614 PMC9578601 Burn A, Roy F, Freeman M, Coffin JM. Widespread expression of the ancient HERV-K (HML-2) provirus group in normal human tissues. PLoS Biol. 2022;20(10):e3001826. 36256614 10.1371/journal.pbio.3001826 PMC9578601 21. Retroelementdb. https://Retroelementdb.com 22. GDC. National Cancer Institute Expression mRNA pipeline. https://docs.gdc.cancer.gov/Data/Bioinformatics_Pipelines/Expression_mRNA_Pipeline/ 23. Lorenzi L Chiu HS Avila Cobos F Gross S Volders PJ Cannoodt R The RNA atlas expands the catalog of human non-coding RNAs Nat Biotechnol 2021 39 11 1453 1465 10.1038/s41587-021-00936-1 34140680 Lorenzi L, Chiu HS, Avila Cobos F, Gross S, Volders PJ, Cannoodt R, et al. The RNA atlas expands the catalog of human non-coding RNAs. Nat Biotechnol. 2021;39(11):1453–65. 34140680 10.1038/s41587-021-00936-1 24. Ardlie KG, Deluca DS, Segre AV, Sullivan TJ, Young TR, Gelfand ET, et al. Human genomics. The Genotype-Tissue Expression (GTEx) pilot analysis: multitissue gene regulation in humans. Science. 2015;348(6235):648–60. 10.1126/science.1262110 PMC4547484 25954001 25. Gualandi N Iperi C Esposito M Ansaloni F Gustincich S Sanges R Meta-analysis suggests that intron retention can affect quantification of transposable elements from RNA-seq data Biology 2022 10.3390/biology11060826 35741347 PMC9220773 Gualandi N, Iperi C, Esposito M, Ansaloni F, Gustincich S, Sanges R. Meta-analysis suggests that intron retention can affect quantification of transposable elements from RNA-seq data. Biology. 2022. 10.3390/biology11060826. 35741347 10.3390/biology11060826 PMC9220773 26. Guo Y Zhao S Sheng Q Guo M Lehmann B Pietenpol J RNAseq by Total RNA Library Identifies Additional RNAs Compared to Poly(A) RNA Library Biomed Res Int 2015 2015 862130 10.1155/2015/862130 26543871 PMC4620295 Guo Y, Zhao S, Sheng Q, Guo M, Lehmann B, Pietenpol J, et al. RNAseq by Total RNA Library Identifies Additional RNAs Compared to Poly(A) RNA Library. Biomed Res Int. 2015;2015:862130. 26543871 10.1155/2015/862130 PMC4620295 27. She J Du M Xu Z Jin Y Li Y Zhang D The landscape of hervRNAs transcribed from human endogenous retroviruses across human body sites Genome Biol 2022 23 1 231 10.1186/s13059-022-02804-w 36329469 PMC9632151 She J, Du M, Xu Z, Jin Y, Li Y, Zhang D, et al. The landscape of hervRNAs transcribed from human endogenous retroviruses across human body sites. Genome Biol. 2022;23(1):231. 36329469 10.1186/s13059-022-02804-w PMC9632151 28. Russ E Mikhalkevich N Iordanskiy S Expression of human endogenous retrovirus group K (HERV-K) HML-2 correlates with immune activation of macrophages and type i interferon response Microbiol Spectr 2023 11 2 e0443822 10.1128/spectrum.04438-22 36861980 PMC10100713 Russ E, Mikhalkevich N, Iordanskiy S. Expression of human endogenous retrovirus group K (HERV-K) HML-2 correlates with immune activation of macrophages and type i interferon response. Microbiol Spectr. 2023;11(2):e0443822. 36861980 10.1128/spectrum.04438-22 PMC10100713 29. Xue B Sechi LA Kelvin DJ Human endogenous retrovirus k (HML-2) in health and disease Front Microbiol 2020 11 1690 10.3389/fmicb.2020.01690 32765477 PMC7380069 Xue B, Sechi LA, Kelvin DJ. Human endogenous retrovirus k (HML-2) in health and disease. Front Microbiol. 2020;11:1690. 32765477 10.3389/fmicb.2020.01690 PMC7380069 30. Rivas SR Valdez MJM Govindarajan V Seetharam D Doucet-O’Hare TT Heiss JD The role of HERV-K in cancer stemness Viruses 2022 10.3390/v14092019 36146825 PMC9504571 Rivas SR, Valdez MJM, Govindarajan V, Seetharam D, Doucet-O’Hare TT, Heiss JD, et al. The role of HERV-K in cancer stemness. Viruses. 2022. 10.3390/v14092019. 36146825 10.3390/v14092019 PMC9504571 31. Ryder PV Lerit DA RNA localization regulates diverse and dynamic cellular processes Traffic 2018 19 7 496 502 10.1111/tra.12571 29653028 PMC6003861 Ryder PV, Lerit DA. RNA localization regulates diverse and dynamic cellular processes. Traffic. 2018;19(7):496–502. 29653028 10.1111/tra.12571 PMC6003861 32. Ferguson CM Echeverria D Hassler M Ly S Khvorova A Cell type impacts accessibility of mRNA to silencing by RNA interference Mol Ther Nucleic Acids 2020 21 384 393 10.1016/j.omtn.2020.06.006 32650236 PMC7340969 Ferguson CM, Echeverria D, Hassler M, Ly S, Khvorova A. Cell type impacts accessibility of mRNA to silencing by RNA interference. Mol Ther Nucleic Acids. 2020;21:384–93. 32650236 10.1016/j.omtn.2020.06.006 PMC7340969 33. Kawamura Y Sanchez Calle A Yamamoto Y Sato TA Ochiya T Extracellular vesicles mediate the horizontal transfer of an active LINE-1 retrotransposon J Extracell Vesicles 2019 8 1 1643214 10.1080/20013078.2019.1643214 31448067 PMC6691892 Kawamura Y, Sanchez Calle A, Yamamoto Y, Sato TA, Ochiya T. Extracellular vesicles mediate the horizontal transfer of an active LINE-1 retrotransposon. J Extracell Vesicles. 2019;8(1):1643214. 31448067 10.1080/20013078.2019.1643214 PMC6691892 34. DeMarino C Nath A Zhuang Z Doucet-O’Hare TT Does the interplay between human endogenous retrovirus K and extracellular vesicles contribute to aging? Extracell Vesicles Circ Nucleic Acids 2023 4 4 548 56 10.20517/evcna.2023.45 PMC11007738 38606283 DeMarino C, Nath A, Zhuang Z, Doucet-O’Hare TT. Does the interplay between human endogenous retrovirus K and extracellular vesicles contribute to aging? Extracell Vesicles Circ Nucleic Acids. 2023;4(4):548–56. 10.20517/evcna.2023.45 PMC11007738 38606283 35. Fuke H Ohno M Role of poly (A) tail as an identity element for mRNA nuclear export Nucleic Acids Res 2008 36 3 1037 1049 10.1093/nar/gkm1120 18096623 PMC2241894 Fuke H, Ohno M. Role of poly (A) tail as an identity element for mRNA nuclear export. Nucleic Acids Res. 2008;36(3):1037–49. 18096623 10.1093/nar/gkm1120 PMC2241894 36. Heslin DJ Murcia P Arnaud F Van Doorslaer K Palmarini M Lenz J A single amino acid substitution in a segment of the CA protein within Gag that has similarity to human immunodeficiency virus type 1 blocks infectivity of a human endogenous retrovirus K provirus in the human genome J Virol 2009 83 2 1105 1114 10.1128/JVI.01439-08 19004950 PMC2612375 Heslin DJ, Murcia P, Arnaud F, Van Doorslaer K, Palmarini M, Lenz J. A single amino acid substitution in a segment of the CA protein within Gag that has similarity to human immunodeficiency virus type 1 blocks infectivity of a human endogenous retrovirus K provirus in the human genome. J Virol. 2009;83(2):1105–14. 19004950 10.1128/JVI.01439-08 PMC2612375 37. Ruprecht K Ferreira H Flockerzi A Wahl S Sauter M Mayer J Human endogenous retrovirus family HERV-K(HML-2) RNA transcripts are selectively packaged into retroviral particles produced by the human germ cell tumor line Tera-1 and originate mainly from a provirus on chromosome 22q11.21 J Virol 2008 82 20 10008 10016 10.1128/JVI.01016-08 18684837 PMC2566279 Ruprecht K, Ferreira H, Flockerzi A, Wahl S, Sauter M, Mayer J, et al. Human endogenous retrovirus family HERV-K(HML-2) RNA transcripts are selectively packaged into retroviral particles produced by the human germ cell tumor line Tera-1 and originate mainly from a provirus on chromosome 22q11.21. J Virol. 2008;82(20):10008–16. 18684837 10.1128/JVI.01016-08 PMC2566279 38. Suntsova M Gogvadze EV Salozhin S Gaifullin N Eroshkin F Dmitriev SE Human-specific endogenous retroviral insert serves as an enhancer for the schizophrenia-linked gene PRODH Proc Natl Acad Sci U S A 2013 110 48 19472 7 10.1073/pnas.1318172110 24218577 PMC3845128 Suntsova M, Gogvadze EV, Salozhin S, Gaifullin N, Eroshkin F, Dmitriev SE, et al. Human-specific endogenous retroviral insert serves as an enhancer for the schizophrenia-linked gene PRODH. Proc Natl Acad Sci U S A. 2013;110(48):19472–7. 24218577 10.1073/pnas.1318172110 PMC3845128 39. Liu K Lin B Zhao M Yang X Chen M Gao A The multiple roles for Sox2 in stem cell maintenance and tumorigenesis Cell Signal 2013 25 5 1264 71 10.1016/j.cellsig.2013.02.013 23416461 PMC3871517 Liu K, Lin B, Zhao M, Yang X, Chen M, Gao A, et al. The multiple roles for Sox2 in stem cell maintenance and tumorigenesis. Cell Signal. 2013;25(5):1264–71. 23416461 10.1016/j.cellsig.2013.02.013 PMC3871517 40. Guo JC Fang SS Wu Y Zhang JH Chen Y Liu J CNIT: a fast and accurate web tool for identifying protein-coding and long non-coding transcripts based on intrinsic sequence composition Nucleic Acids Res 2019 47 W1 W516 W522 10.1093/nar/gkz400 31147700 PMC6602462 Guo JC, Fang SS, Wu Y, Zhang JH, Chen Y, Liu J, et al. CNIT: a fast and accurate web tool for identifying protein-coding and long non-coding transcripts based on intrinsic sequence composition. Nucleic Acids Res. 2019;47(W1):W516–22. 31147700 10.1093/nar/gkz400 PMC6602462 41. Uhlen M Fagerberg L Hallstrom BM Lindskog C Oksvold P Mardinoglu A Proteomics. Tissue-based map of the human proteome Science. 2015 347 6220 1260419 10.1126/science.1260419 25613900 Uhlen M, Fagerberg L, Hallstrom BM, Lindskog C, Oksvold P, Mardinoglu A, et al. Proteomics. Tissue-based map of the human proteome. Science. 2015;347(6220):1260419. 25613900 10.1126/science.1260419 42. Kim WT Ryu CJ Cancer stem cell surface markers on normal stem cells BMB Rep 2017 50 6 285 298 10.5483/BMBRep.2017.50.6.039 28270302 PMC5498139 Kim WT, Ryu CJ. Cancer stem cell surface markers on normal stem cells. BMB Rep. 2017;50(6):285–98. 28270302 10.5483/BMBRep.2017.50.6.039 PMC5498139 43. Gaggianesi M Di Franco S Pantina VD Porcelli G D'Accardo C Verona F Messing up the cancer stem cell chemoresistance mechanisms supported by tumor microenvironment Front Oncol 2021 11 702642 10.3389/fonc.2021.702642 34354950 PMC8330815 Gaggianesi M, Di Franco S, Pantina VD, Porcelli G, D’Accardo C, Verona F, et al. Messing up the cancer stem cell chemoresistance mechanisms supported by tumor microenvironment. Front Oncol. 2021;11:702642. 34354950 10.3389/fonc.2021.702642 PMC8330815 44. Li Y Rogoff HA Keates S Gao Y Murikipudi S Mikule K Suppression of cancer relapse and metastasis by inhibiting cancer stemness Proc Natl Acad Sci U S A 2015 112 6 1839 44 10.1073/pnas.1424171112 25605917 PMC4330785 Li Y, Rogoff HA, Keates S, Gao Y, Murikipudi S, Mikule K, et al. Suppression of cancer relapse and metastasis by inhibiting cancer stemness. Proc Natl Acad Sci U S A. 2015;112(6):1839–44. 25605917 10.1073/pnas.1424171112 PMC4330785 45. Carter TA, Singh M, Dumbovic G, Chobirko JD, Rinn JL, Feschotte C. Mosaic cis-regulatory evolution drives transcriptional partitioning of HERVH endogenous retrovirus in the human embryo. eLife. 2022;11:e76257. 10.7554/eLife.76257 PMC8912925 35179489 46. Santoni FA Guerra J Luban J Herv-H RNA is abundant in human embryonic stem cells and a precise marker for pluripotency Retrovirology 2012 9 111 10.1186/1742-4690-9-111 23253934 PMC3558390 Santoni FA, Guerra J, Luban J. Herv-H RNA is abundant in human embryonic stem cells and a precise marker for pluripotency. Retrovirology. 2012;9:111. 23253934 10.1186/1742-4690-9-111 PMC3558390 47. Zhang Y Li T Preissl S Amaral ML Grinstein JD Farah EN Transcriptionally active HERV-H retrotransposons demarcate topologically associating domains in human pluripotent stem cells Nat Genet 2019 51 9 1380 1388 10.1038/s41588-019-0479-7 31427791 PMC6722002 Zhang Y, Li T, Preissl S, Amaral ML, Grinstein JD, Farah EN, et al. Transcriptionally active HERV-H retrotransposons demarcate topologically associating domains in human pluripotent stem cells. Nat Genet. 2019;51(9):1380–8. 31427791 10.1038/s41588-019-0479-7 PMC6722002 48. Ohnuki M Tanabe K Sutou K Teramoto I Sawamura Y Narita M Dynamic regulation of human endogenous retroviruses mediates factor-induced reprogramming and differentiation potential Proc Natl Acad Sci U S A 2014 111 34 12426 31 10.1073/pnas.1413299111 25097266 PMC4151758 Ohnuki M, Tanabe K, Sutou K, Teramoto I, Sawamura Y, Narita M, et al. Dynamic regulation of human endogenous retroviruses mediates factor-induced reprogramming and differentiation potential. Proc Natl Acad Sci U S A. 2014;111(34):12426–31. 25097266 10.1073/pnas.1413299111 PMC4151758 49. Lu X Sachs F Ramsay L Jacques PE Goke J Bourque G The retrovirus HERVH is a long noncoding RNA required for human embryonic stem cell identity Nat Struct Mol Biol 2014 21 4 423 5 10.1038/nsmb.2799 24681886 Lu X, Sachs F, Ramsay L, Jacques PE, Goke J, Bourque G, et al. The retrovirus HERVH is a long noncoding RNA required for human embryonic stem cell identity. Nat Struct Mol Biol. 2014;21(4):423–5. 24681886 10.1038/nsmb.2799 50. Cancer Genome Atlas Research N Weinstein JN Collisson EA Mills GB Shaw KR Ozenberger BA The cancer genome atlas pan-cancer analysis project Nat Genet 2013 45 10 1113 20 10.1038/ng.2764 24071849 PMC3919969 Cancer Genome Atlas Research N, Weinstein JN, Collisson EA, Mills GB, Shaw KR, Ozenberger BA, et al. The cancer genome atlas pan-cancer analysis project. Nat Genet. 2013;45(10):1113–20. 24071849 10.1038/ng.2764 PMC3919969 51. Kitsou K Lagiou P Magiorkinis G Human endogenous retroviruses in cancer: oncogenesis mechanisms and clinical implications J Med Virol 2023 95 1 e28350 10.1002/jmv.28350 36428242 PMC10108094 Kitsou K, Lagiou P, Magiorkinis G. Human endogenous retroviruses in cancer: oncogenesis mechanisms and clinical implications. J Med Virol. 2023;95(1):e28350. 36428242 10.1002/jmv.28350 PMC10108094 52. Wang J Han GZ Frequent retroviral gene co-option during the evolution of vertebrates Mol Biol Evol 2020 37 11 3232 3242 10.1093/molbev/msaa180 32667990 Wang J, Han GZ. Frequent retroviral gene co-option during the evolution of vertebrates. Mol Biol Evol. 2020;37(11):3232–42. 32667990 10.1093/molbev/msaa180 53. Esnault C Priet S Ribet D Vernochet C Bruls T Lavialle C A placenta-specific receptor for the fusogenic, endogenous retrovirus-derived, human syncytin-2 Proc Natl Acad Sci U S A 2008 105 45 17532 7 10.1073/pnas.0807413105 18988732 PMC2582322 Esnault C, Priet S, Ribet D, Vernochet C, Bruls T, Lavialle C, et al. A placenta-specific receptor for the fusogenic, endogenous retrovirus-derived, human syncytin-2. Proc Natl Acad Sci U S A. 2008;105(45):17532–7. 18988732 10.1073/pnas.0807413105 PMC2582322 54. Blanco-Melo D, Gifford RJ, Bieniasz PD. Co-option of an endogenous retrovirus envelope for host defense in hominid ancestors. eLife. 2017;6:e22519. 10.7554/eLife.22519 PMC5388530 28397686 55. Statello L Guo CJ Chen LL Huarte M Gene regulation by long non-coding RNAs and its biological functions Nat Rev Mol Cell Biol 2021 22 2 96 118 10.1038/s41580-020-00315-9 33353982 PMC7754182 Statello L, Guo CJ, Chen LL, Huarte M. Gene regulation by long non-coding RNAs and its biological functions. Nat Rev Mol Cell Biol. 2021;22(2):96–118. 33353982 10.1038/s41580-020-00315-9 PMC7754182 56. Logotheti S Stiewe T Georgakilas AG The role of human endogenous retroviruses in cancer immunotherapy of the post-COVID-19 world Cancers (Basel) 2023 10.3390/cancers15225321 38001581 PMC10669663 Logotheti S, Stiewe T, Georgakilas AG. The role of human endogenous retroviruses in cancer immunotherapy of the post-COVID-19 world. Cancers (Basel). 2023. 10.3390/cancers15225321. 38001581 10.3390/cancers15225321 PMC10669663 57. Ng KW Boumelha J Enfield KSS Almagro J Cha H Pich O Antibodies against endogenous retroviruses promote lung cancer immunotherapy Nature 2023 616 7957 563 573 10.1038/s41586-023-05771-9 37046094 PMC10115647 Ng KW, Boumelha J, Enfield KSS, Almagro J, Cha H, Pich O, et al. Antibodies against endogenous retroviruses promote lung cancer immunotherapy. Nature. 2023;616(7957):563–73. 37046094 10.1038/s41586-023-05771-9 PMC10115647 58. Adhit KK, Wanjari A, Menon S, K S. Liquid Biopsy: An Evolving Paradigm for Non-invasive Disease Diagnosis and Monitoring in Medicine. Cureus. 2023;15(12):e50176. 10.7759/cureus.50176 PMC10772356 38192931 59. Mastora E Christodoulaki A Papageorgiou K Zikopoulos A Georgiou I Expression of retroelements in mammalian gametes and embryos In Vivo 2021 35 4 1921 1927 10.21873/invivo.12458 34182464 PMC8286539 Mastora E, Christodoulaki A, Papageorgiou K, Zikopoulos A, Georgiou I. Expression of retroelements in mammalian gametes and embryos. In Vivo. 2021;35(4):1921–7. 34182464 10.21873/invivo.12458 PMC8286539 60. Kohlrausch FB Berteli TS Wang F Navarro PA Keefe DL Control of LINE-1 expression maintains genome integrity in germline and early embryo development Reprod Sci 2022 29 2 328 40 10.1007/s43032-021-00461-1 33481218 Kohlrausch FB, Berteli TS, Wang F, Navarro PA, Keefe DL. Control of LINE-1 expression maintains genome integrity in germline and early embryo development. Reprod Sci. 2022;29(2):328–40. 33481218 10.1007/s43032-021-00461-1 61. Shah AH, Rivas SR, Doucet-O'Hare TT, Govindarajan V, DeMarino C, Wang T, et al. Human endogenous retrovirus K contributes to a stem cell niche in glioblastoma. J Clin Invest. 2023;133(13):e167929. 10.1172/JCI167929 PMC10313366 37395282 62. Reyes-Gopar H Marston JL Singh B Greenig M Lin J Ostrowski MA A single-cell transposable element atlas of human cell identity bioRxiv 2023 10.1101/2023.12.28.573568 40543500 PMC12296447 Reyes-Gopar H, Marston JL, Singh B, Greenig M, Lin J, Ostrowski MA, et al. A single-cell transposable element atlas of human cell identity. bioRxiv. 2023. 10.1101/2023.12.28.573568. 40543500 10.1016/j.crmeth.2025.101086 PMC12296447 ",
  "metadata": {
    "Title of this paper": "A single-cell transposable element atlas of human cell identity",
    "Journal it was published in:": "Mobile DNA",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12495673/"
  }
}