{
  "title": "Paper_801",
  "abstract": "pmc Exp Ther Med Exp Ther Med 1895 etm ETM Experimental and Therapeutic Medicine 1792-0981 1792-1015 Spandidos Publications PMC12464520 PMC12464520.1 12464520 12464520 41018887 10.3892/etm.2025.12976 ETM-30-6-12976 1 Case Report Bartholin's gland cyst with markedly elevated CA19-9 level: A case report Zhao Weihua 1 * Zhang Tongyan 2 * 1 2 Correspondence to: zhangtongyan610@126.com * 12 2025 18 9 2025 30 6 497559 226 26 3 2025 26 8 2025 18 09 2025 27 09 2025 29 09 2025 Copyright: © 2025 Zhao and Zhang. 2025 https://creativecommons.org/licenses/by-nc-nd/4.0/ This is an open access article distributed under the terms of the Creative Commons Attribution-NonCommercial-NoDerivs License This case report describes a 43-year-old woman who presented with a symptomatic left Bartholin's gland cyst accompanied by a markedly elevated serum CA19-9 levels (>1,000 U/ml). Despite initial concerns for malignancy, comprehensive evaluation, including contrast-enhanced CT and serial biomarker monitoring, revealed rapid CA19-9 normalization (83% reduction within 24 h post-marsupialization), reaching the normal range by day 59 post-drainage, suggesting an inflammatory etiology. This case underscores two key clinical insights: CA19-9 elevations exceeding 1,000 U/ml may occur in benign mucinous cysts and short-interval biomarker reassessment aids in differential diagnosis. These findings expand the current understanding of tumor marker dynamics in benign gynecological pathology. Bartholin's gland cyst carbohydrate antigen 19-9 tumor markers benign gynecological pathology Funding: pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement no pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes Introduction Carbohydrate antigen 19-9 (CA19-9) is a highly glycosylated mucin-type tumor biomarker identified by the monoclonal antibody 1116-NS-19-9. It serves as a key diagnostic and prognostic monitoring tool primarily for pancreaticobiliary and gastrointestinal malignancies ( 1 1-3 1-3 Bartholin's gland cysts are among the most common benign vulvar lesions, typically resulting from ductal obstruction leading to mucus retention and account for ~2% of vulvar masses in women ( 4 Notably, similarly high CA19-9 levels (>1,000 U/ml) in benign gynecological conditions are rare. Documented cases are rare and predominantly involve uterine adenomyotic/endometriotic cysts, such as, Zheng et al 5 et al 6 2 7 3 8 The present case report presents the first documented case of a Bartholin's gland cyst accompanied by a notably elevated CA19-9 level (>1,000 U/ml). This striking finding challenges the conventional clinical tenet that ‘CA19-9 >1,000 U/ml is pathognomonic for malignancy’. This finding underscores the need to reevaluate the interpretation of tumor markers within the context of benign mucin-producing cysts and highlights the risk of misdiagnosis, leading to unnecessary anxiety or aggressive interventions. Through detailed analysis of diagnostic pathway of this case, therapeutic intervention (marsupialization) and rapid biomarker dynamics, the present case report aims to provide evidence-based insights that can be used to improve differential diagnostic strategies. The aim is to equip clinicians with the ability to distinguish such benign yet biomarker-alarm presentations from true malignancies, thereby preventing unnecessary interventions. Case report Admission A 43-year-old woman was admitted to the Department of Gynecology of the Second Affiliated Hospital of Tianjin University of Traditional Chinese Medicine (Tianjin, China) in January 2025, with a chief complaint of a palpable mass in the vulva for 4 days accompanied by pain for 1 day. Medical history This patient had a regular menstrual history with a cycle of 28-30 days and moderate flow, without dysmenorrhea. The last menstrual period of the patient was 19 days before admission. The patient had undergone laparoscopic ovarian cystectomy and cesarean section in 2003, both of which yielded benign pathology results. There was no history of chronic diseases such as diabetes, hypertension or coronary heart disease, as well as infectious diseases such as hepatitis, tuberculosis, typhoid fever or malaria. There was also no other surgical history, trauma or blood transfusion, and the patient had received routine vaccinations. Physical examination On admission, the vital signs of the patient were stable, with a temperature of 36.5˚C, a pulse rate of 90 beats per min, a respiratory rate of 18 breaths per min and a blood pressure of 130/85 mmHg. Cardiopulmonary examination revealed no notable abnormalities. Abdominal examination revealed a soft abdomen without hepatosplenomegaly or lower limb edema. Gynecological examination revealed a 4-cm cystic mass in the left Bartholin's gland with tenderness and fluctuation, a patent vagina, a smooth cervix, a normal-sized anteverted uterus and no notable abnormalities in the adnexa. Laboratory and imaging Most of the laboratory tests, including the tests for coagulation profile (six items), complete blood count, hepatitis B surface antigen/antibody, hepatitis C antibody, syphilis antibody, and HIV antibody were within normal limits. However, laboratory tests revealed elevated levels of CA19-9 (>1,000 U/ml; normal range, 0-27 U/ml), which were measured via an electrochemiluminescence immunoassay on a Roche Cobas e 801 analyzer (Roche Diagnostics). Pelvic ultrasound revealed multiple uterine fibroids (the largest measuring 3.9x4.4x3.6 cm) and pelvic effusion. Abdominal and pelvic CT scans revealed a full uterus with an irregular shape and a cyst in the upper pole of the left kidney. Diagnosis and treatment Patient was diagnosed with a Bartholin's gland cyst. The clinical presentation was typical for a Bartholin's gland cyst. An abdominal examination revealed a soft abdomen without hepatosplenomegaly or lower limb edema. Gynecological examination revealed a 4-cm cystic mass in the left Bartholin's gland with tenderness and fluctuation, a patent vagina, a smooth cervix, a normal-sized anteverted uterus and no notable abnormalities in the adnexa. The attending physician proceeded with surgical drainage under local anesthesia on the day of admission. The procedure involved making a longitudinal incision over the cyst, with transparent fluid drainage and placement of Vaseline gauze for drainage. Postoperatively, the patient was managed with routine gynecological care, including daily wound dressing changes. The medication used included one subcutaneous injection of 0.1 g lidocaine and one intravenous infusion of 500 ml 0.5% glucose. Follow-up Changes in CA19-9 levels are shown in Fig. 1 Discussion As a key tumor marker, CA19-9 is secreted by various epithelial cells under normal physiological conditions and is mainly distributed in tissues such as the biliary tract, pancreatic duct epithelium, endometrium, fallopian tubes, endocervix and bronchial gland epithelium ( 9 10 et al 11 The liver, as the main organ for clearing CA19-9, carries out a key role in its metabolism. In hepatobiliary diseases, biliary obstruction (due to stones or tumor compression) can lead to impaired excretion of CA19-9, whereas secondary biliary tract inflammation or infection can stimulate the overproduction of CA19-9 by biliary epithelial cells ( 12 The level of CA19-9 in patients with cholangiocarcinoma is markedly increased compared with that in patients with benign biliary diseases. In the diagnosis of colorectal cancer with liver metastasis, the diagnostic sensitivity of CA19-9 is 72.3% ( 13 14 et al 15 16 17 18 However, elevated CA19-9 is not a specific manifestation of malignant tumors. Among the healthy population undergoing physical examinations, 97.9% of individuals with elevated CA19-9 levels have non-malignant causes of increased CA19-9 levels ( 19 et al 20 21 22-24 The present case also adds new evidence to the elevation in benign mucinous cysts: Zheng et al 5 et al 6 7 et al 2 3 8 The patient in this case was a 43-year-old woman who presented with a palpable vulvar mass. After examination, the patient was ultimately diagnosed with a Bartholin's gland cyst. The attending physician carried out surgery for the Bartholin's gland cyst following the examination. The patient received routine postoperative care and did not develop any infections or other complications. However, the CA19-9 level of the patient exceeded the normal range (peak >1,000 U/ml). A series of tests were then conducted and malignancy was ruled out. Unexpectedly, the present case report confirmed that the elevation of the CA19-9 levels of the patient was likely associated with the Bartholin's cyst. This case is the first to show that a Bartholin gland cyst may cause a considerable increase in the serum CA19-9 concentration, which may be associated with the following factors: First, active secretion by the mucinous epithelium can occur. It has been confirmed that numerous patients with benign cysts (such as hepatic, renal and ovarian cysts) have a certain probability of experiencing elevated CA19-9 levels ( 21 et al 21 25-27 et al 21 21 28 For patients with elevated CA19-9 levels, a rational differential diagnosis pathway is key. On the basis of this case and the literature ( 5 6 29 30 31 18 32 7 33 However, the present study also has certain limitations. First, the tracking of inflammatory factors such as IL-6 and TNF-α could be increased to assess their potential impact on tumor markers. In addition, the present case report has a single-case design and lacks analysis of cyst fluid biomarkers. Future studies should include immunohistochemical analysis of CA19-9 in the cyst epithelium ( 5 This case highlights the importance of a comprehensive approach for managing patients with elevated tumor marker levels and benign gynecological conditions. This underscores the need for clinicians to consider benign conditions when interpreting elevated tumor marker levels, potentially reducing unnecessary anxiety or aggressive interventions. Acknowledgements Not applicable. Availability of data and materials The data generated in the present study are included in the figures and/or tables of this article. Authors' contributions All authors contributed to the data collection and discussed the final version of the paper. WZ and TZ made substantial contributions to the conception or design of the work, acquisition, analysis and interpretation of the work, drafting the work or critically revising it for important intellectual content. All authors have read and approved the final manuscript. WZ and TZ confirm the authenticity of all the raw data. All authors agree to be accountable for all aspects of the work in ensuring that questions related to the accuracy or integrity of any part of the work are appropriately investigated and resolved. Ethics approval and consent to participate The research complied with all the relevant national regulations, institutional policies and was in accordance with the tenets of the Helsinki Declaration, ethics approval was waived by the medical ethics review board of the Second Affiliated Hospital of Tianjin University of Traditional Chinese Medicine (waiver no. EfE2024/003/01). Informed consent for participation and publication was obtained from the patient prior to the start of the study. Patient consent for publication Written informed consent for publication was obtained from the patient. Competing interests The authors declare that they have no competing interests. Use of artificial intelligence tools During the preparation of this work, artificial intelligence tools ( https://china.aje.com/cn/rubriq References 1 Lee T Teng TZJ Shelat VG Carbohydrate antigen 19-9 - tumor marker: Past, present, and future World J Gastrointest Surg 12 468 490 2020 10.4240/wjgs.v12.i12.468 33437400 PMC7769746 2 Rokhgireh S Mehdizadeh Kashi A Chaichian S Delbandi AA Allahqoli L Ahmadi-Pishkuhi M Khodaverdi S Alkatout I The diagnostic accuracy of combined Enolase/Cr, CA125, and CA19-9 in the detection of endometriosis Biomed Res Int 2020 5208279 2020 10.1155/2020/5208279 33062681 PMC7545435 3 Kim S Park BK Seo JH Choi J Choi JW Lee CK Chung JB Park Y Kim DW Carbohydrate antigen 19-9 elevation without evidence of malignant or pancreatobiliary diseases Sci Rep 10 8820 2020 10.1038/s41598-020-65720-8 32483216 PMC7264353 4 Omole F Simmons BJ Hacker Y Management of Bartholin's duct cyst and gland abscess Am Fam Physician 68 135 140 2003 12887119 5 Zheng L Shan L Cai F Uterine adenomyotic cyst with markedly elevated serum CA19-9 and CA125 levels: A case report Exp Ther Med 24 665 2022 10.3892/etm.2022.11601 36168421 PMC9475347 6 Imaoka I Kaji Y Kobashi Y Wada A Honjo G Hayashi M Yoshida M Matsuo M Cystic adenomyosis with florid glandular differentiation mimicking ovarian malignancy Br J Radiol 78 558 561 2005 10.1259/bjr/82283833 15900064 7 Takemori M Sugimura K Ovarian chocolate cyst with markedly elevated serum CA19-9 level: A case report Eur J Obstet Gynecol Reprod Biol 42 241 244 1991 10.1016/0028-2243(91)90229-e 1773881 8 Sato H Borsari R Yajima EK Ninomiya T Saito CS Kumagai CA Adenomyoma associated with high level of CA 125 and CA 19-9: Case report Eur J Gynaecol Oncol 32 455 456 2011 21941978 9 Wang L Wang D Zheng G Yang Y Du L Dong Z Zhang X Wang C Clinical evaluation and therapeutic monitoring value of serum tumor markers in lung cancer Int J Biol Markers 31 e80 e87 2016 10.5301/jbm.5000177 26560853 10 Xiang DK Xie JY Luo W Zou H Wang D Systematic Analysis of Carbohydrate Antigen (CA19-9) within Serum Multiple Tumor Markers Chip and its Clinical Significance in Cancer Diagnosis Practical Journal of Cancer 27 147 152 2012 (In Chinese) 11 Luo XZ Yang X Fu WL Evaluation of the diagnostic value of CA19-9 combined with routine blood and liver function indicators for pancreatic cancer Inter J Laborat Med 43 1434 1439 2022 (In Chinese) 12 Zhang K Zhang LF Zheng LX Clinical predictive value of different serological indexes for acute cholangitis secondary to choledocholithiasis J Region Anatomy Operat Surg 31 512 515 2022 (In Chinese) 13 Li X Yan J Meng WB Zhang L Zhou W Zhu K Zhu X He W Bai Z Department of General Surgery, the First Hospital of Lanzhou University Clinical value of serum carbohydrate antigen 19-9 in the differential diagnosis of benign and malignant biliary system diseases Chin J Hepatic Surg (Electronic Edition) 3 226 230 2014 (In Chinese) 14 Sun W Wang Q Liu J Application of serum tumor markers in the diagnosis of colorectal cancer Chin J Laborat Med 23 10 12 2000 (In Chinese) 15 Zhang XD Ge XL Liu SC Zheng WQ Shen T The prognostic and predictive value of serum CA199 and CEA in colorectal cancer metastasis Chin J Disease Control Prevent 22 57 61 2018 (In Chinese) 16 Wu AJ Zhang ZX Value of preoperative multi-slice spiral CT enhancement scanning in determining TNM stage of gastric cancer and its relationship with tumor markers and proliferation molecule expression J Hainan Med Univ 22 2928 2931 2016 (In Chinese) 17 Wang H Yin Y The expression difference of CEA, CA19-9, CA72-4 and CA125 in patients with different staging of gastric cancer and the relationship with metastasis and recurrence Biomed Res 28 9769 9772 2017 18 Yue LJ Hou XL Xue L Zhu H-C Zhang J-J Wang Y Department of Oncology, Hanzhong Central Hospital Clinical value of combined detection of multiple tumor markers in diagnosis of the recurrence of ovarian cancer Chin J Clin Oncol Rehab 27 20 22 2020 (In Chinese) 19 Han XD Ying S Chen ZY Analysis of serum CA19-9 test results in healthy physical examination population Shanghai J Prevent Med 25 109 110 2013 (In Chinese) 20 Zurli L Decker J Robles B Regimbeau JM Atypic large hepatic cyst with persistent elevated CA19.9 serum value: utility of intracystic CA72.4 dosage for a mini-invasive management Clin J Gastroenterol 14 258 262 2021 10.1007/s12328-020-01292-4 33216317 21 Yan XQ Huang QL He YH Correlation research of serum CA1 9-9 with benign cystic diseases Guizhou Med J 47 176 177 2023 (In Chinese) 22 Liu YH Liu YQ Qiu YH Expression and clinical value of vascular endothelial growth factor, carbohydrate antigen 125, and carbohydrate antigen 19-9 in cervical cancer Oncology Progress 20 712 715 2022 23 Chen YE Wu XM Wen YH Expression of serum HE4, CA125 and CA19-9 in patients with endometrial carcinoma and its relationship with clinicopathological features Chin J Gerontol 37 3787 3789 2017 (In Chinese) 24 Fan CM Luo X Wen F Clinical Value of Serum CA125 and CA19-9 Detection for the Diagnosis of Epithelial Ovarian Cancer and Endometriosis J Chin Med Univ 38 376 378 2009 (In Chinese) 25 Zhang Q Jin X Relationship of dyscrasia formation and the concentration of tumor necrosis factor-α (TNF-α) and interleukin-6 (IL-6) of patients with advanced gastrointestinal cancer Chin Modern Doctor 52 129 131 2014 (In Chinese) 26 Agca S Kir S The role of interleukin-6 family cytokines in cancer cachexia FEBS J 291 4009 4023 2024 10.1111/febs.17224 38975832 27 Hannan CJ Lewis D O'Leary C Donofrio CA Evans DG Stapleton E Freeman SR Lloyd SK Rutherford SA Hammerbeck-Ward C Beyond antoni: A surgeon's guide to the vestibular schwannoma microenvironment J Neurol Surg B Skull Base 83 1 10 2020 10.1055/s-0040-1716688 35155063 PMC8824628 28 Cho HY Kim K Jeon YT Kim YB No JH CA19-9 elevation in ovarian mature cystic teratoma: Discrimination from ovarian cancer - CA19-9 level in teratoma Med Sci Monit 19 230 235 2013 10.12659/MSM.883865 23539074 PMC3628710 29 Pontrelli G Bounous VE Scarperi S Minelli L Di Spiezio Sardo A Florio P Rare case of giant cystic adenomyoma mimicking a uterine malformation, diagnosed and treated by hysteroscopy J Obstet Gynaecol Res 41 1300 1304 2015 10.1111/jog.12698 25833279 30 Trapé J Fernández-Galán E Auge JM Carbonell-Prat M Filella X Miró-Cañís S González-Fernández C Oncology biomarkers section of the catalan association of clinical laboratory science Factors influencing blood tumor marker concentrations in the absence of neoplasia Tumour Biol 46(s1) S35 S63 2024 10.3233/TUB-220023 38517826 31 Yu L Common tumor markers and their clinical detection applications Medical Information 24 3494 3495 2011 32 Han M Ma MJ Lian J Clinical value of combined detection of serum AFP,CEA,CA199,CA125 and HE4 in diagnosis of ovarian cancer Hebei Med J 44 76 78 82 2022 (In Chinese) 33 Wu HJ He NA Xie L Application of contrast-enhanced ultrasound combined with serum CA19-9 in the differential diagnosis of cholangiocarcinoma and hepatocellular carcinoma J Practical Hepatol 24 903 906 2021 (In Chinese) Figure 1 Changes in the serum CA19-9 level. CA19-9, carbohydrate antigen 19-9. ",
  "metadata": {
    "Title of this paper": "Application of contrast-enhanced ultrasound combined with serum CA19-9 in the differential diagnosis of cholangiocarcinoma and hepatocellular carcinoma",
    "Journal it was published in:": "Experimental and Therapeutic Medicine",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12464520/"
  }
}