{
  "title": "Paper_784",
  "abstract": "pmc BMC Nephrol BMC Nephrol 47 bmcneph BMC Nephrology 1471-2369 BMC PMC12465377 PMC12465377.1 12465377 12465377 41013408 10.1186/s12882-025-04443-2 4443 1 Research INHBA knockdown inhibits renal fibrosis in mice following ischemia–reperfusion injury by suppressing activation of the TGF-β/Smad signaling pathway Wang Yifei 1 Tang Qiao 2 Sun Qian sq16160527@163.com 1 1 https://ror.org/03ekhbz91 grid.412632.0 0000 0004 1758 2270 Department of Anesthesiology, Renmin Hospital of Wuhan University, 2 https://ror.org/033vjfk17 grid.49470.3e 0000 0001 2331 6153 Department of Anesthesiology, The First Clinical College of Wuhan University, 26 9 2025 2025 26 478197 526 9 10 2024 1 9 2025 26 09 2025 27 09 2025 29 09 2025 © The Author(s) 2025 2025 https://creativecommons.org/licenses/by-nc-nd/4.0/ Open Access http://creativecommons.org/licenses/by-nc-nd/4.0/ Background Acute kidney injury (AKI) and renal fibrosis are clinical conditions associated with high morbidity and mortality. Renal ischemia–reperfusion (I/R) injury is a major cause of AKI. Objective This study aimed to investigate the role of inhibin subunit beta A (INHBA) in the pathogenesis of renal fibrosis and the underlying mechanisms during I/R-induced kidney injury using an in vivo model. Methods A mouse model of renal I/R injury was established. INHBA function was evaluated by intrarenal injection of INHBA–short hairpin RNA (INHBA-shRNA) on day 7 after I/R. Renal function, tubular damage, and interstitial fibrosis were assessed using detection kits, hematoxylin–eosin staining, and Masson’s trichrome staining. reverse transcription–quantitative polymerase chain reaction (RT-qPCR) and Western blot analyses were performed to examine the expression of fibrosis-related genes, including fibronectin (FN), collagen I (Col-I), and alpha–smooth muscle actin (α-SMA). Additionally, RT-qPCR, Western blot, and immunohistochemistry were used to determine INHBA expression in different groups. Transforming growth factor beta 1 (TGF-β1) levels in kidney tissue were measured by enzyme-linked immunosorbent assay. The effect of INHBA-shRNA on the TGF-β/Smad signaling pathway was analyzed by Western blot. Results INHBA-shRNA significantly reduced INHBA expression, serum creatinine levels, 24-hour urinary albumin, and urinary albumin-to-creatinine ratio in I/R-injured mice. It also alleviated renal tubular damage and interstitial fibrosis. Furthermore, INHBA knockdown downregulated the expression of fibrosis markers, inhibited TGF-β1 secretion, and suppressed activation of the TGF-β/Smad signaling pathway, as evidenced by reduced expression of FN, Col-I, α-SMA, phosphorylated Smad2, and phosphorylated Smad3. Conclusion Knockdown of INHBA attenuates renal fibrosis after I/R injury in mice by suppressing activation of the TGF-β/Smad signaling pathway. This pathway may represent a potential therapeutic target for renal I/R injury. Supplementary Information The online version contains supplementary material available at 10.1186/s12882-025-04443-2. Keywords INHBA Renal fibrosis Ischemia–reperfusion kidney injury TGF-β/Smad signaling pathway pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement yes pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes issue-copyright-statement © BioMed Central Ltd., part of Springer Nature 2025 Introduction Acute kidney injury (AKI) is a global clinical condition characterized by a rapid decline in renal excretory function and is associated with high morbidity and mortality [ 1 2 3 4 5 The fibrotic process is accompanied by an inflammatory response, resulting in elevated cytokine expression, infiltration of inflammatory cells, and damage to renal tubular cells [ 6 7 8 9 10 Inhibin subunit beta A (INHBA), a member of the TGF-β superfamily located on chromosome 7p14.1, has been shown to play an important role in the progression of various cancers. For example, Zhang et al. reported that silencing the INHBA gene inhibits proliferation, migration, and invasion of osteosarcoma cells by suppressing activation of the TGF-β signaling pathway [ 11 12 13 Materials and methods Animals and surgical procedures Male C57BL/6J mice (8–10 weeks old, 20–25 g) were obtained from Vital River Laboratory Animal Technology Co., Ltd. (Beijing, China) and housed in a temperature-controlled room under a 12-hour light/dark cycle with 60–65% humidity. Mice had free access to food and water. Ethical approval was obtained from the Animal Care and Use Committee of Renmin Hospital of Wuhan University (Approval number: WDRM-20210124) in accordance with the guidelines provided by the National Institutes of Health for the Care and Use of Laboratory Animals. After a 2-week adaptation period, the mice were randomly divided into six groups ( n Mice were euthanized with pentobarbital (40 mg/kg, intraperitoneal injection) and sacrificed by cervical dislocation. Death was confirmed by the absence of cardiac and respiratory activity. Evaluation of renal function Renal function was assessed by measuring Scr, urinary albumin, and ACR. Scr was measured using the QuantiChrom™ Creatinine Assay Kit (BioAssay, USA), and urinary albumin was determined using the Albumin Fluorometric Assay Kit (Biovision, USA) according to the manufacturer’s instructions. ACR was evaluated using the Urine Albumin-to-Creatinine Ratio (UACR) Assay Kit (Biovision, USA) following the manufacturer’s protocol. Renal histopathological evaluation Kidney tissues were collected from mice in each group, fixed in 10% neutral buffered formalin, embedded in paraffin, and sectioned at 4 μm. Sections were stained with H&E and Masson’s trichrome to evaluate renal tubular injury and interstitial fibrosis, in accordance with the manufacturer’s instructions. The renal tubular injury score was calculated based on the presence of tubular dilatation, hyaline cast formation, epithelial cell atrophy, and interstitial inflammatory cell infiltration. Renal fibrosis was assessed using Masson’s trichrome staining. Images of stained sections were acquired using a light microscope (CX31, Olympus, Japan) and evaluated in a blinded manner by a single pathologist. Immunohistochemistry For immunohistochemical analysis, paraffin-embedded kidney Sect. (4 μm) were deparaffinized and rehydrated through a graded ethanol series. Antigen retrieval was performed by microwaving the slides in citrate buffer, followed by incubation in hydrogen peroxide solution (10011218, Sinopharm Group Chemical Reagent Co. Ltd.) for 15 min to block endogenous peroxidase activity. The sections were then incubated overnight at 4 °C with rabbit anti-INHBA primary antibody (DF12283, Affinity; 1:100 dilution), followed by incubation with goat anti-rabbit IgG secondary antibody (AS1107, Aspen; 1:200 dilution) for 1 h at room temperature. Immunoreactivity was visualized using diaminobenzidine tetrahydrochloride (DAB; ZLI-9019, ZSbio, China), and nuclei were counterstained with hematoxylin. Stained sections were examined using a light microscope (Nikon, Japan). Enzyme-linked immunosorbent assay (ELISA) assay Kidney tissues were homogenized in HEPES buffer, and the supernatants were collected following centrifugation. Tissue homogenates were analyzed for TGF-β1 secretion using the Mouse TGF-β1 ELISA Kit (ELK1186, ELK Biotechnology, China) according to the manufacturer’s instructions. Absorbance was measured at 450 nm using a microplate reader (Cmax Plus, Molecular Devices). Western blot analysis Kidney tissues were lysed in RIPA lysis buffer (AS1004, ASPEN) supplemented with a protease inhibitor cocktail (04693159001, Roche). The lysates were centrifuged at 4 °C for 10 min, and the resulting supernatants were collected. Protein concentrations were determined using the BCA Protein Quantification Kit (AS1086, ASPEN). Equal amounts of protein were mixed with SDS sample buffer (AS1011, ASPEN), boiled for 5 min, separated by SDS–PAGE using a precast gel kit (AS1012, ASPEN), and transferred onto PVDF membranes (IPVH00010, Millipore). Membranes were blocked with 5% skimmed milk (AS1033, ASPEN) for 2 h at room temperature and incubated overnight at 4 °C with the following primary antibodies: fibronectin (FN, ab268020, Abcam; 1:1000), collagen I (Col-I, ab138492, Abcam; 1:1000), α-SMA (ab184705, Abcam; 1:1000), INHBA (ab128958, Abcam; 1:1000), TGF-β1 (ab215715, Abcam; 1:1000), phosphorylated Smad2 (p-Smad2) (ab280888, Abcam; 1:1000), Smad2 (ab40855, Abcam; 1:2000), phosphorylated Smad3 (p-Smad3) (ab52903, Abcam; 1:2000), Smad3 (ab84177, Abcam; 1:1000), and β-actin (ab6276, Abcam; 1:5000). After washing three times with TBST, membranes were incubated with HRP-conjugated goat anti-rabbit IgG (H + L) secondary antibody (S0001, Affinity Biosciences; 1:5000) for 2 h at room temperature. Protein bands were visualized using enhanced chemiluminescence (ECL) detection reagents (AS1059, ASPEN) and quantified using AlphaEaseFC software. qRT-PCR assay Total RNA was extracted from kidney tissues using TRIzol reagent (EP013, ELK Biotechnology) according to the manufacturer’s instructions. Complementary DNA (cDNA) was synthesized from the extracted RNA using the EntiLink™ First Strand cDNA Synthesis Super Mix (ELK Biotechnology) following the recommended protocol. Quantitative real-time PCR (qRT-PCR) was performed using SYBR Green-based reagents and the StepOnePlus Real-Time PCR System (Applied Biosystems, USA). The mRNA expression levels of FN, Col-I, α-smooth muscle actin (α-SMA), and INHBA were quantified using the following primer sequences: GAPDH: Forward: 5ʹ-AGGTCGGTGTGAACGGATTTG-3ʹ. Reverse: 5ʹ-TGTAGACCATGTAGTTGAGGTCA-3ʹ. α-SMA: Forward: 5ʹ-CTTCCAGCCATCTTTCATTGG-3ʹ. Reverse: 5ʹ-GTTCTGGAGGGGCAATGAT-3ʹ. FN: Forward: 5ʹ-ATGTGGACCCCTCCTGATAGT-3ʹ. Reserve: 5ʹ-GCCCAGTGATTTCAGCAAAGG-3ʹ. Col-I: Forward: Forward: 5ʹ-CCTCAGGGTATTGCTGGACAAC-3ʹ. Reverse: 5ʹ-CAGAAGGACCTTGTTTGCCAGG-3ʹ. INHBA: Forward: 5ʹ-AAGAAGGGCGGAGGTGAAGG-3ʹ. Reverse: 5ʹ-GGCGATGAGGGTGGTCTTCA-3ʹ. Relative gene expression was calculated using the 2 ‑ΔΔCt Statistical analyses All data are presented as mean ± standard deviation from three independent experiments. Statistical analyses were performed using SPSS software (version 17.0; IBM Corp., Armonk, NY, USA). Differences among groups were evaluated by one-way analysis of variance followed by least significant difference post hoc tests. A p-value < 0.05 was considered statistically significant. Results Establishment of the renal ischemia–reperfusion injury model I/R injury model was successfully established. Mice subjected to unilateral I/R were used to evaluate histopathological alterations. Scr, 24-hour urinary albumin, and urinary ACR were measured to assess renal function. As shown in Fig. 1 1  Fig. 1 Establishment of renal ischemia-reperfusion (I/R) injury model. ( A B C D P Expression of fibrosis-related proteins was increased in renal I/R injury model mice Fibrosis-related proteins were found to be upregulated in mice with renal I/R injury. To assess the extent of interstitial fibrosis, we examined the expression of fibrosis-associated proteins using Western blot and RT-qPCR analyses. Our results showed that the expression levels of FN, Col-I, and α-SMA were significantly increased in the I/R model group compared with the sham group (Fig. 2  Fig. 2 Fibrosis-related proteins levels were increased in kidney tissues of Model mice. ( A B B P INHBA was upregulated in renal tissues of I/R-injured mice INHBA, a ligand of the TGF-β superfamily, has been reported to be upregulated in fibrotic kidneys induced by unilateral ureteral obstruction (UUO) or aristolochic acid I [ 13 3 3 3  Fig. 3 INHBA were up-regulated in kidney tissues of Model mice. ( A B C D E P INHBA expression is associated with renal deterioration following I/R injury To investigate the role of INHBA in renal I/R injury, an INHBA-targeting shRNA (INHBA-shRNA) and a control shRNA were delivered to mice by intrarenal injection on day 7 after I/R. INHBA expression was examined by RT-qPCR in different groups. Our data revealed that INHBA expression was significantly reduced following INHBA-shRNA administration. Additionally, compared with the Sham + control-shRNA group, INHBA expression was increased in the Model + control-shRNA group (Fig. 4  Fig. 4 INHBA-shRNA administration attenuates I/R-induced renal injury and renal interstitial fibrosis. Control-shRNA or INHBA-shRNA was delivered to mice through intrarenal injection. Mice were divided into four groups: Sham + control-shRNA, Sham + INHBA-shRNA;, Model + control-shRNA and Model + INHBA-shRNA group. ( A B C D E F G H P Knockdown of INHBA alleviates I/R-induced renal injury and interstitial fibrosis To investigate the effect of INHBA knockdown on renal function after I/R injury, Scr concentrations and urinary ACR were measured. As shown in Fig. 4 4 4 4 Knockdown of INHBA mitigates I/R-induced renal fibrosis by inhibiting activation of the TGF-β/Smad signaling pathway TGF-β is a well-established profibrotic mediator in various fibrotic diseases. To investigate its involvement in renal I/R injury [ 14 5 5 5  Fig. 5 Effects of INHBA-shRNA on the I/R-mediated regulation of TGF-β/Smad signal pathway. Mice were divided into four groups: Sham + control-shRNA, Sham + INHBA-shRNA;, Model + control-shRNA and Model + INHBA-shRNA group. ( A B C D E P Discussion AKI has been recognized as a major contributor to the development of renal fibrosis, and the incidence of I/R-induced AKI continues to rise in clinical settings [ 15 16 In this study, a renal injury model was established by clamping the renal pedicle for 45 min to induce I/R injury. Elevated Scr, 24-hour urinary albumin, and ACR confirmed kidney dysfunction. In addition, H&E and Masson’s trichrome staining revealed tubular dilation, inflammatory cell infiltration, and renal fibrosis in the metanephric tissues following I/R injury. These findings confirmed the successful induction of renal I/R injury in vivo. Furthermore, RT-qPCR and Western blot analyses showed upregulated expression of fibrosis markers, including FN, Col-I, and α-SMA, compared with the sham group. INHBA, a ligand of the TGF-β superfamily, has been implicated in the pathogenesis of various diseases [ 17 18 19 20 21 To further investigate the regulatory role of INHBA in renal fibrosis following I/R injury, INHBA-shRNA and control-shRNA were delivered via intrarenal injection after I/R. Knockdown of INHBA significantly reduced INHBA expression compared with the control-shRNA group. Furthermore, INHBA expression was elevated in the Model + control-shRNA group compared with the Sham + control-shRNA group. These findings highlight the critical role of INHBA in renal deterioration. Activation of interstitial fibroblasts plays a central role in the development of renal fibrosis. Under pathological conditions, renal tubular epithelial cells are the primary source of TGF-β [ 9 22 11 23 Activation of interstitial fibroblasts has been recognized as a critical driver of renal fibrosis. Renal tubular epithelial cells are the primary source of TGF-β under pathological conditions. Increased expression and secretion of TGF-β by these cells may serve as the mechanism for activating interstitial fibroblasts and promoting renal fibrosis [ 24 25 26 Based on the above findings, to our knowledge, this is the first study to report the role of INHBA in I/R-induced kidney injury in mice. Therefore, INHBA may represent a promising therapeutic target for the treatment of renal fibrosis. Supplementary Information Below is the link to the electronic supplementary material.  Supplementary Material 1 Publisher’s note Springer Nature remains neutral with regard to jurisdictional claims in published maps and institutional affiliations. Author contributions Yifei Wang: Conceptualization, Formal analysis, Project administration, Supervision, Visualization, Writing-original draft, and Writing-review & editing. Qiao Tang: Data collection and Methodology. Qian Sun: Project administration and Writing-review & editing. All authors have read and approved the final manuscript. Funding No funding was received. Data availability No datasets were generated or analysed during the current study. Declarations Ethics approval and consent to participate This study abides by the ARRIVE guideline. Ethical approval was obtained from the Animal Care and Use Committee of the Renmin Hospital of Wuhan University (Approval number: WDRM-20210124) in accordance with the guidelines provided by the National Institutes of Health for the Care and Use of Laboratory Animals. Consent for publication Not applicable. Competing interests The authors declare no competing interests. References 1. Lazarovits G, Ofek SN, Kheir R, Bdolah AT, Eventov FS, Volovelsky O. Acute kidney injury in very low birth weight infants: a major morbidity and mortality risk factor. Child (Basel). 2023;10. 10.3390/children10020242 PMC9955621 36832371 2. Matuszkiewicz-Rowinska J Malyszko J Acute kidney injury, its definition, and treatment in adults: guidelines and reality Pol Arch Intern Med 2020 130 1074 80 32426960 10.20452/pamw.15373 Matuszkiewicz-Rowinska J, Malyszko J. Acute kidney injury, its definition, and treatment in adults: guidelines and reality. Pol Arch Intern Med. 2020;130:1074–80. 32426960 10.20452/pamw.15373 3. Li Y Xiong Y Li H Augmenter of liver regeneration (ALR) protects kidney from ischemia/reperfusion (I/R) injury via regulation of TLR4/MAPK signaling pathway J Immunol Res 2022 2022 6869730 10.1155/2022/6869730 35983075 PMC9381282 Li Y, Xiong Y, Li H, et al. Augmenter of liver regeneration (ALR) protects kidney from ischemia/reperfusion (I/R) injury via regulation of TLR4/MAPK signaling pathway. J Immunol Res. 2022;2022:6869730. 35983075 10.1155/2022/6869730 PMC9381282 4. Feng ZJ Wang LS Ma X Catapol attenuates the aseptic inflammatory response to hepatic I/R injury in vivo and in vitro by inhibiting the HMGB1/TLR-4/NF-kappaB signaling pathway via the microRNA-410-3p Mol Immunol 2023 164 66 78 10.1016/j.molimm.2023.11.004 37979473 Feng ZJ, Wang LS, Ma X, et al. Catapol attenuates the aseptic inflammatory response to hepatic I/R injury in vivo and in vitro by inhibiting the HMGB1/TLR-4/NF-kappaB signaling pathway via the microRNA-410-3p. Mol Immunol. 2023;164:66–78. 37979473 10.1016/j.molimm.2023.11.004 5. Eleftheriadis T Pissas G Golfinopoulos S Liakopoulos V Stefanidis I Indoleamine 2,3-dioxygenase controls purinergic receptor-mediated ischemia-reperfusion injury in renal tubular epithelial cells J Basic Clin Physiol Pharmacol 2023 34 745 54 10.1515/jbcpp-2022-0128 35918786 Eleftheriadis T, Pissas G, Golfinopoulos S, Liakopoulos V, Stefanidis I. Indoleamine 2,3-dioxygenase controls purinergic receptor-mediated ischemia-reperfusion injury in renal tubular epithelial cells. J Basic Clin Physiol Pharmacol. 2023;34:745–54. 35918786 10.1515/jbcpp-2022-0128 6. Bouffette S Botez I De Ceuninck F Targeting galectin-3 in inflammatory and fibrotic diseases Trends Pharmacol Sci 2023 44 519 31 10.1016/j.tips.2023.06.001 37391294 Bouffette S, Botez I, De Ceuninck F. Targeting galectin-3 in inflammatory and fibrotic diseases. Trends Pharmacol Sci. 2023;44:519–31. 37391294 10.1016/j.tips.2023.06.001 7. Kim J Ha S Son M TLR7 activation by miR-21 promotes renal fibrosis by activating the pro-inflammatory signaling pathway in tubule epithelial cells Cell Commun Signal 2023 21 215 10.1186/s12964-023-01234-w 37596656 PMC10439664 Kim J, Ha S, Son M, et al. TLR7 activation by miR-21 promotes renal fibrosis by activating the pro-inflammatory signaling pathway in tubule epithelial cells. Cell Commun Signal. 2023;21:215. 37596656 10.1186/s12964-023-01234-w PMC10439664 8. Wang Y, Liu P, Ma G et al. Mechanism of Dioscin ameliorating renal fibrosis through NF-kappaB signaling pathway-mediated inflammatory response. Mol Med Rep. 2023;27. 10.3892/mmr.2023.12980 PMC10073814 36960871 9. Qiu D Song S Chen N NQO1 alleviates renal fibrosis by inhibiting the TLR4/NF-kappaB and TGF-beta/Smad signaling pathways in diabetic nephropathy Cell Signal 2023 108 110712 10.1016/j.cellsig.2023.110712 37196773 Qiu D, Song S, Chen N, et al. NQO1 alleviates renal fibrosis by inhibiting the TLR4/NF-kappaB and TGF-beta/Smad signaling pathways in diabetic nephropathy. Cell Signal. 2023;108:110712. 37196773 10.1016/j.cellsig.2023.110712 10. Xiang D Zou J Zhu X Physalin D attenuates hepatic stellate cell activation and liver fibrosis by blocking TGF-beta/Smad and YAP signaling Phytomedicine 2020 78 153294 10.1016/j.phymed.2020.153294 32771890 Xiang D, Zou J, Zhu X, et al. Physalin D attenuates hepatic stellate cell activation and liver fibrosis by blocking TGF-beta/Smad and YAP signaling. Phytomedicine. 2020;78:153294. 32771890 10.1016/j.phymed.2020.153294 11. Zhang H Huang Y Wen Q Li Y Guo L Ge N INHBA gene Silencing inhibits proliferation, migration, and invasion of osteosarcoma cells by repressing TGF-beta signaling pathway activation J Orthop Surg Res 2023 18 848 10.1186/s13018-023-04330-2 37940978 PMC10634167 Zhang H, Huang Y, Wen Q, Li Y, Guo L, Ge N. INHBA gene silencing inhibits proliferation, migration, and invasion of osteosarcoma cells by repressing TGF-beta signaling pathway activation. J Orthop Surg Res. 2023;18:848. 37940978 10.1186/s13018-023-04330-2 PMC10634167 12. Lyu S Jiang C Xu R Huang Y Yan S INHBA upregulation correlates with poorer prognosis in patients with esophageal squamous cell carcinoma Cancer Manag Res 2018 10 1585 96 10.2147/CMAR.S160186 29950896 PMC6014728 Lyu S, Jiang C, Xu R, Huang Y, Yan S. INHBA upregulation correlates with poorer prognosis in patients with esophageal squamous cell carcinoma. Cancer Manag Res. 2018;10:1585–96. 29950896 10.2147/CMAR.S160186 PMC6014728 13. Wu M Yang F Huang D Ye C Tanshinone I attenuates fibrosis in fibrotic kidneys through down-regulation of inhibin beta-A BMC Complement Med Ther 2022 22 110 10.1186/s12906-022-03592-3 35439976 PMC9020026 Wu M, Yang F, Huang D, Ye C. Tanshinone I attenuates fibrosis in fibrotic kidneys through down-regulation of inhibin beta-A. BMC Complement Med Ther. 2022;22:110. 35439976 10.1186/s12906-022-03592-3 PMC9020026 14. Murphy-Ullrich JE Suto MJ Thrombospondin-1 regulation of latent TGF-beta activation: A therapeutic target for fibrotic disease Matrix Biol 2018 68–69 28 43 10.1016/j.matbio.2017.12.009 29288716 PMC6015530 Murphy-Ullrich JE, Suto MJ. Thrombospondin-1 regulation of latent TGF-beta activation: A therapeutic target for fibrotic disease. Matrix Biol. 2018;68–69:28–43. 29288716 10.1016/j.matbio.2017.12.009 PMC6015530 15. Menshikh A Scarfe L Delgado R Capillary rarefaction is more closely associated with CKD progression after cisplatin, rhabdomyolysis, and ischemia-reperfusion-induced AKI than renal fibrosis Am J Physiol Ren Physiol 2019 317 F1383 97 10.1152/ajprenal.00366.2019 PMC6879932 31509009 Menshikh A, Scarfe L, Delgado R, et al. Capillary rarefaction is more closely associated with CKD progression after cisplatin, rhabdomyolysis, and ischemia-reperfusion-induced AKI than renal fibrosis. Am J Physiol Ren Physiol. 2019;317:F1383–97. 10.1152/ajprenal.00366.2019 PMC6879932 31509009 16. Zhuang Y, Ortega-Ribera M, Thevkar NP et al. Bile acid-induced IRF3 phosphorylation mediates cell death, inflammatory responses and fibrosis in cholestasis-induced liver and kidney injury via regulation of ZBP1. Hepatology. 2023. 10.1097/HEP.0000000000000611 PMC10948324 37725754 17. Abdel MM Pauklin S TGFB1/INHBA Homodimer/Nodal-SMAD2/3 signaling network: A pivotal molecular target in PDAC treatment Mol Ther 2021 29 920 36 10.1016/j.ymthe.2021.01.002 33429081 PMC7934636 Abdel MM, Pauklin S. TGFB1/INHBA Homodimer/Nodal-SMAD2/3 signaling network: A pivotal molecular target in PDAC treatment. Mol Ther. 2021;29:920–36. 33429081 10.1016/j.ymthe.2021.01.002 PMC7934636 18. Zeng L, Sun X. Correlation of INHBA overexpression with pathological features, antitumor immune response and clinical prognosis in cervical cancer. Med (Kaunas). 2023;59. 10.3390/medicina59030495 PMC10051788 36984496 19. Peng S Wang J Hu P Zhang W Li H Xu L INHBA knockdown inhibits proliferation and invasion of nasopharyngeal carcinoma SUNE1 cells in vitro Int J Clin Exp Pathol 2020 13 854 68 32509056 PMC7270653 Peng S, Wang J, Hu P, Zhang W, Li H, Xu L. INHBA knockdown inhibits proliferation and invasion of nasopharyngeal carcinoma SUNE1 cells in vitro. Int J Clin Exp Pathol. 2020;13:854–68. 32509056 PMC7270653 20. Liu F Liu J Shi X Identification of INHBA as a potential biomarker for gastric cancer through a comprehensive analysis Sci Rep 2023 13 12494 10.1038/s41598-023-39784-1 37528145 PMC10394090 Liu F, Liu J, Shi X, et al. Identification of INHBA as a potential biomarker for gastric cancer through a comprehensive analysis. Sci Rep. 2023;13:12494. 37528145 10.1038/s41598-023-39784-1 PMC10394090 21. Guo J Liu Y INHBA promotes the proliferation, migration and invasion of colon cancer cells through the upregulation of VCAN J Int Med Res 2021 49 3000605211014998 10.1177/03000605211014998 34130530 PMC8212385 Guo J, Liu Y. INHBA promotes the proliferation, migration and invasion of colon cancer cells through the upregulation of VCAN. J Int Med Res. 2021;49:3000605211014998. 34130530 10.1177/03000605211014998 PMC8212385 22. Kim KK, Sheppard D, Chapman HA. TGF-beta1 signaling and tissue fibrosis. Cold Spring Harb Perspect Biol. 2018;10. 10.1101/cshperspect.a022293 PMC5880172 28432134 23. Chen ZL Qin L Peng XB Hu Y Liu B INHBA gene Silencing inhibits gastric cancer cell migration and invasion by impeding activation of the TGF-beta signaling pathway J Cell Physiol 2019 234 18065 74 10.1002/jcp.28439 30963572 Chen ZL, Qin L, Peng XB, Hu Y, Liu B. INHBA gene Silencing inhibits gastric cancer cell migration and invasion by impeding activation of the TGF-beta signaling pathway. J Cell Physiol. 2019;234:18065–74. 30963572 10.1002/jcp.28439 24. Chen YT, Jhao PY, Hung CT et al. Endoplasmic reticulum protein TXNDC5 promotes renal fibrosis by enforcing TGF-beta signaling in kidney fibroblasts. J Clin Invest. 2021;131. 10.1172/JCI143645 PMC7919722 33465051 25. Pan Z Yang K Wang H MFAP4 deficiency alleviates renal fibrosis through Inhibition of NF-kappaB and TGF-beta/Smad signaling pathways FASEB J 2020 34 14250 63 10.1096/fj.202001026R 32905637 Pan Z, Yang K, Wang H, et al. MFAP4 deficiency alleviates renal fibrosis through Inhibition of NF-kappaB and TGF-beta/Smad signaling pathways. FASEB J. 2020;34:14250–63. 32905637 10.1096/fj.202001026R 26. Yang G Wu Y Tang S TRPM7 elicits proliferation and differentiation of human lens epithelial cells through the TGF-beta/Smad pathways Folia Biol (Praha) 2022 68 72 7 10.14712/fb2022068020072 36384264 Yang G, Wu Y, Tang S. TRPM7 elicits proliferation and differentiation of human lens epithelial cells through the TGF-beta/Smad pathways. Folia Biol (Praha). 2022;68:72–7. 36384264 10.14712/fb2022068020072 ",
  "metadata": {
    "Title of this paper": "TRPM7 elicits proliferation and differentiation of human lens epithelial cells through the TGF-beta/Smad pathways",
    "Journal it was published in:": "BMC Nephrology",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12465377/"
  }
}