{
  "title": "Paper_1238",
  "abstract": "pmc Medicina (Kaunas) Medicina (Kaunas) 3494 medicina medicina Medicina 1010-660X 1648-9144 Multidisciplinary Digital Publishing Institute  (MDPI) PMC12471730 PMC12471730.1 12471730 12471730 41011012 10.3390/medicina61091621 medicina-61-01621 1 Article Incidence of Uterine Cesarean Scar Niche After Cesarean Delivery and Assessment of Its Risk Factors Khalifa Ahmed Khedr 1 Abdel Moteleb Ahmed Adel Yasseen 1 https://orcid.org/0000-0002-5466-0552 Elgendy Marwa O. Formal analysis Resources Data curation Writing – review & editing 2 3 * Taha Ahmed Abdel Khalek 1 https://orcid.org/0000-0002-9671-8513 Salem Eman A. 4 * Ibrahim Ahmed R. N. Methodology Resources Data curation Writing – review & editing 5 Salem Sara Abdallah Mohamed Resources Data curation Writing – review & editing Funding acquisition 1 Farid Eman Zein Elabein 1 Khaled Waleed Mohammed Elamin Conceptualization Writing – review & editing 1 Sorrentino Felice Academic Editor 1 ahmedkhedrkh@gmail.com ahmed.adel@med.bsu.edu.eg ahmedabdulkhaliq@med.bsu.edu.eg sara.abdalla@med.bsu.edu.eg eman.zain@gmail.com waliedelamin123@gmail.com 2 3 4 5 aribrahim@kku.edu.sa * marwaosamaelgendy@yahoo.com marwa.elgendy@nub.edu.eg dr_emanaeldeeb@hotmail.com 08 9 2025 9 2025 61 9 497654 1621 20 6 2025 08 8 2025 19 8 2025 08 09 2025 27 09 2025 29 09 2025 © 2025 by the authors. 2025 https://creativecommons.org/licenses/by/4.0/ Published by MDPI on behalf of the Lithuanian University of Health Sciences. Licensee MDPI, Basel, Switzerland. This article is an open access article distributed under the terms and conditions of the Creative Commons Attribution (CC BY) license ( https://creativecommons.org/licenses/by/4.0/ Background and Objectives Materials and Methods Results Conclusions cesarean scar defect niche isthmocele risk factors complications King Khalid University RGP1/59/46 The authors extend their appreciation to the Deanship of Research and Graduate Studies at King Khalid University for funding this work through the Small Research Project under grant number RGP1/59/46. pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement no pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes 1. Introduction A cesarean section (CS) is a surgical intervention typically performed when a vaginal delivery poses potential risks to the mother, the fetus, or both [ 1 2 One increasingly recognized complication is the development of a cesarean scar niche (CSN), also known as a cesarean scar defect (CSD) or isthmocele. A cesarean scar niche refers to a defect resulting from poor healing of the myometrium at the site of a cesarean incision. The precise cause of niche formation remains unclear, but is believed to be multifactorial. Contributing factors may include the site of the uterine incision, uterine retroflexion [ 3 4 5 6 CSNs can be identified in non-pregnant women using various imaging techniques such as transvaginal sonography (TVS), saline infusion sonohysterography (SHG), a 3D ultrasound, magnetic resonance imaging (MRI), or a hysteroscopy [ 7 However, there is currently no universal diagnostic criterion, and the prevalence rates vary depending on the diagnostic method used [ 8 3 Although many CSNs are asymptomatic, symptomatic women may present with postmenstrual spotting, dysmenorrhea, dyspareunia, chronic pelvic pain, or infertility. These symptoms are thought to result from retained menstrual blood within the niche, fibrotic tissue formation, and poor myometrial remodeling. Though rare, serious complications such as uterine rupture or a cesarean scar ectopic pregnancy can arise from niche formation and carry significant risks [ 9 10 11 The risk factors for CSN formation include multiple cesarean deliveries, uterine retroflexion, low post-operative hemoglobin or platelets, an infection (e.g., postpartum fever), a suboptimal surgical technique (e.g., single-layer uterine closure), or labor before the cesarean section. Additionally, maternal anemia and impaired wound healing can exacerbate the defect [ 12 Management strategies for symptomatic CSNs include hormonal therapy, a hysteroscopic or laparoscopic correction, and in rare cases, surgical excision. Nonetheless, prevention remains the most effective approach, emphasizing the importance of optimized surgical techniques and the early identification of at-risk patients. Given the high rate of CSs in Egypt and the potential reproductive consequences of CSNs, this study aimed to investigate the presence of cesarean scar niches and identify associated risk factors in a prospective cohort of Egyptian women following their first, second, or more than two cesarean sections. The findings are intended to enhance the understanding of CSN pathogenesis and support the development of preventive and management strategies to reduce its occurrence and related complications. 2. Materials and Methods 2.1. Study Population This prospective cohort observational study was performed at the Department of Obstetrics and Gynecology, Beni-Suef University Hospital, Beni-Suef, Egypt, after obtaining ethical approval from the medical ethical committee. The recruited women provided signed informed consent before enrollment after the purpose and procedures of the study were explained. The inclusion criteria included the following: Women who had undergone a cesarean section at least six months prior to the study. Availability for a transvaginal ultrasound (TVUS) evaluation. The exclusion criteria included the following: A single-layer uterine closure technique (due to potential confounding in niche healing). Uterine anomalies. Women with diagnosed chorioamnionitis or a postpartum pelvic infection. Accordingly, a total of 420 women were enrolled from February 2022 to January 2024, and they were categorized as follows: Group A (n = 140) women had undergone their first caesarean section (1 CS), Group B (n = 140) women group had undergone a second CS (2 CSs), and Group C (n = 140) women had undergone more than two CSs. Data were collected for all the participants from their medical records, including the incidence, complications, and risk factors (the maternal age, the prenatal BMI, medical comorbidities, PROM, PTL, a history of a previous vaginal delivery, a VBAC or hysterotomy, the gestational age, EFW, twins, labor duration, the indication for a CS, the cervical dilatation at the time of the cesarean section, the post-cesarean hemoglobin, the platelet count or WBC count, a postpartum fever, wound infections, breastfeeding, postpartum contraceptive methods, and the uterine position). The primary outcome of the current study was to assess the incidence of a CS niche among cesarean deliveries, and the secondary outcome was to assess the complications and risk factors that affect the development of a niche. 2.2. Sample Size Calculation The primary endpoint of this study was to assess the incidence of a niche 6 months after a CS and the association of possible symptoms, with the determination of possible risk factors representing the secondary outcome of the study. Under the assumption that 30% of women present with myometrial defects after a CS [ 13 2.3. Ultrasound Assessment Women who fulfilled the inclusion criteria within 6 months after their cesarean delivery were examined using a 2D ultrasound (trans-abdominal and transvaginal) and saline infusion sonography (SIS) to detect the presence of a niche. Also, the women were examined in the lithotomy position with an empty bladder; the uterus was examined in a standardized way, with transvaginal ultrasonography (TVUS) performed first. All the ultrasound examinations were conducted by a single experienced gynecologist using the same ultrasound machine to reduce inter-observer and inter-device variability. For the diagnosis of a CS niche (defined as an anechoic defect in the anterior wall of the lower uterine segment, communicating with the endometrial cavity), the authors used a predetermined definition of a defect at least 2.0 mm deep [ 14 15 2.4. Statistical Analysis The data were statistically described in terms of the mean ± standard deviation (mean ± SD), frequencies (number of cases), and relative frequencies (percentages) when appropriate. A normal distribution of continuous variables of the demographic data was evaluated with the use of the Kolmogrov–Smirnov test. Comparisons of numerical variables between the study groups were facilitated using an independent-samples t X 2 p A logistic regression model was applied to identify independent predictors of a CSN, reporting odds ratios (ORs) with 95% confidence intervals (CIs). ** Statistical significance was set at p 3. Results 3.1. Incidence of Cesarean Scar Niche A total of 420 eligible women were recruited; however, **37 participants (8.8%) were excluded from the final analysis** due to a pregnancy before 6 months (n = 2) or loss to follow-up/withdrawal (n = 35). The dropout rate varied significantly among Group A (3.6%), Group B (12.1%), and Group C (10.7%) (** p Consequently, The analysis demonstratedcases fulfilling inclusion criteria and complied to follow up for 6 months. As shown in Table 1 X 2 p 3.2. Risk Factors of Cesarean Scar Niche The levels of risk factors were compared among the three enrolled groups, as shown in Table 2 p p p p Regarding laboratory risk factors, the post-cesarean hemoglobin concentration dropped more in patients with a CS niche after their first delivery, with a statistically significant difference based on a chi-square test ( p p p Figure 1 The post-cesarean platelet count was lower among women who developed a CS niche (50% for those with one previous CS, 23.3% in those with two previous CSs, and 30.8% in those with more than two CSs). These women had platelet counts less than 150 × 10 9 Figure 2 A postpartum fever and breastfeeding showed significant statistical differences among the three CS groups, at ( X 2 p X 2 p Table 3 Patients who were documented with a wound infection or who used postpartum contraceptive methods reported no statistical differences among the three CS groups. The uterine position according to a transvaginal ultrasound showed significant statistical differences among the three CS groups ( p Table 4 3.3. Complications From 91 women with a CS niche, only 23 patients had symptoms (25.27%). The frequencies of symptoms in symptomatic patients with a CS niche are shown in Figure 3 3.4. Correlation Between Factors Associated with CSs A logistic regression model was used to investigate the factors associated with a cesarean scar niche. The model included a [CS niche] as the binary outcome and [maternal anemia, post-operative platelet count, postpartum fever, uterine position, and breastfeeding] as predictors. The overall model was statistically significant ( p Among the significant predictors, [maternal anemia] showed an OR of 1.66, a 95% CI of 0.668–4.125, and p p p p p Table 5 4. Discussion A cesarean scar defect (CSD), also known as a niche or isthmocele, is frequently identified incidentally during transvaginal sonography (TVS) and is often asymptomatic [ 16 17 18 19 Among the 393 women assessed, TVS detected niches in 91 cases (23.8%). The highest incidence was observed in women with more than two prior cesarean deliveries (31.2%, 39/125), followed by those with two previous CSs (24.4%, 30/123), and the lowest incidence was observed in women with one prior CS (16.3%, 22/135). These results are consistent with earlier studies [ 20 21 Maternal age was not significantly associated with niche formation among symptomatic versus asymptomatic women, aligning with the findings of Antila et al. (2020) [ 22 23 Obesity is associated with poor labor outcomes [ 24 25 26 27 Regarding comorbidities, only anemia showed a significant association with a CSD, consistent with previous studies [ 28 29 30 31 32 33 34 35 36 37 4 Recent evidence also suggests that women intending to exclusively breastfeed for six months are less likely to undergo non-medically indicated cesarean deliveries [ 38 Interestingly, uterine retroflexion was significantly more common among women with one prior CS and a diagnosed niche ( p 39 40 41 42 34 43 44 Most of the women with a CSD in this study were asymptomatic; only 23 of 91 (25.27%) reported symptoms such as postmenstrual spotting, dyspareunia, scar pain, prolonged menstruation, persistent brown discharge, or dysmenorrhea. The link between a CSD and abnormal uterine bleeding may be attributed to retained menstrual blood in the defect, a fibrotic obstruction, or vascular changes at the scar site [ 21 15 22 45 4.1. Clinical Implications This study emphasizes the importance of routine CSN screening, especially in women with multiple CSs or risk factors such as uterine retroflexion or low platelet counts. Symptom-based detection underestimates the prevalence, delaying potential interventions for subfertility or abnormal uterine bleeding. 4.2. Preventive Considerations The adoption of double-layer closure techniques. The optimization of the maternal hematological status pre-operatively. The early detection of a postpartum fever or infection. Postpartum follow-up using TVUS or SHG at 6 months for high-risk patients. 4.3. Limitations Data on the suture technique and intra-operative variables were not collected. We did not assess hormonal profiles or breastfeeding intensity. Ultrasound measurements, though standardized, were not confirmed by MRI. Confounding variables may have influenced the platelet and breastfeeding associations. 5. Conclusions The current study found that multiple cesarean deliveries, the uterine position as assessed by a transvaginal ultrasound (TVUS), a postpartum fever, breastfeeding, the post-operative platelet levels, and maternal anemia are contributing factors to the development of cesarean scar defects (CSDs). These defects are detectable through a TVUS, with postmenstrual spotting or bleeding being the most commonly reported symptom. However, further research is needed to better understand the factors that influence the clinical presentation, management preferences, and treatment success. Standardized definitions and measurement criteria are essential to accurately identify the risk factors, assess the clinical significance, and evaluate the treatment outcomes. Acknowledgments The authors extend their appreciation to the Deanship of Research and Graduate Studies at King Khalid University for funding this work through Small Research Project under grant number RGP1/59/46. Disclaimer/Publisher’s Note: Author Contributions Conceptualization, E.Z.E.F. and W.M.E.K.; data curation, M.O.E. and A.K.K.; formal analysis, M.O.E. and A.A.K.T.; investigation, M.O.E. and E.A.S.; methodology, M.O.E.; writing—original draft preparation; M.O.E.; writing—review and editing, A.R.N.I. and S.A.M.S.; supervision, M.O.E. and A.A.Y.A.M. All authors have read and agreed to the published version of the manuscript. Institutional Review Board Statement This research was conducted after obtaining approval from the Institutional Review Board Ethics Committee, Faculty of Medicine, Beni-Suef University. The approval number for this study is FMBSUREC/06072021/Habib, date of approval: 1 February 2022. Informed Consent Statement Informed consent was obtained from all the subjects involved in this study. Data Availability Statement The raw data were generated at the [Obstetrics and Gynecology Department, Faculty of Medicine, Beni-Suef University]. The data supporting the findings of this study are available from the corresponding author upon request. Conflicts of Interest The authors declare no conflicts of interest. References 1. Rahman M. Khan N. Rahman A. Alam M. Khan A. Long-term effects of caesarean delivery on health and behavioural outcomes of the mother and child in Bangladesh J. Health Popul. Nutr. 2022 41 45 10.1186/s41043-022-00326-6 36195965 PMC9531390 2. Zakherah M. Mohamed A.A. Rageh A.M. Abdel-aleem M. Navigating uterine niche 360 degree: A narrative review Middle East Fertil. Soc. J. 2024 29 29 10.1186/s43043-024-00185-7 3. Armstrong F. Mulligan K. Dermott R.M. Bartels H.C. Carroll S. Robson M. Corcoran S. Parland P.M. Brien D.O. Brophy D. Cesarean scar niche: An evolving concern in clinical practice Int. J. Gynecol. Obstet. 2023 161 356 366 10.1002/ijgo.14509 36317541 4. Wang J. He Y. Zhang M. Huang F. Wu Y. Hu M. Yang Y. Wei W. Pang Q. Wei Z. The degree of risk factor and accumulation effect for large niche in individuals after cesarean section BMC Pregnancy Childbirth 2024 24 38 10.1186/s12884-023-06228-7 38183004 PMC10768304 5. Ahmed E. El-Gendy A.O. Moniem Radi N.A. Mohamed T. The bactericidal efficacy of femtosecond laser-based therapy on the most common infectious bacterial pathogens in chronic wounds: An in vitro study Lasers Med. Sci. 2021 36 641 647 10.1007/s10103-020-03104-0 32725427 6. Mahmoud Farhan S. Mahmoud Abd El-Baky R. Abdalla M. Osama El-Gendy A. Farag Azmy A. Efficacy of Amikacin and Imipenem Against Multi-Drug Resistant Gram-Negative Bacteria Isolated from Wound Infections, Egypt Iran. J. Med. Microbiol. 2023 17 218 229 10.30699/ijmm.17.2.218 7. Taha A.A. Salem S.A.M. Faried E.Z.E.A. Habib E.H. Al-Fakharany R.S. Elgendy M.O. Abdelkader H. Al Fatease A. Elkady M.S.E. Diagnostic Performance of Gynecologic Imaging Reporting and Data System (GI-RADS) in Preoperative Evaluation of Adnexal Masses Medicina 2025 61 679 10.3390/medicina61040679 40282970 PMC12028664 8. Vervoort A. Van der Voet L. Hehenkamp W. Thurkow A. van Kesteren P. Quartero H. Kuchenbecker W. Bongers M. Geomini P. de Vleeschouwer L. Hysteroscopic resection of a uterine caesarean scar defect (niche) in women with postmenstrual spotting: A randomised controlled trial BJOG Int. J. Obstet. Gynaecol. 2018 125 326 334 10.1111/1471-0528.14733 28504857 PMC5811899 9. Pędraszewski P. Wlaźlak E. Panek W. Surkont G. Cesarean scar pregnancy—A new challenge for obstetricians J. Ultrason. 2018 18 56 10.15557/JoU.2018.0009 29844942 PMC5911720 10. Ahmed E. El-Gendy A.O. Mohamed T. Antibacterial Effects of Laser in Treating Contaminated Wounds Laser Innov. Res. Appl. 2024 1 37 69 10.21608/lira.2024.352883 11. Patounakis G. Ozcan M.C. Chason R.J. Norian J.M. Payson M. DeCherney A.H. Yauger B.J. Impact of a prior cesarean delivery on embryo transfer: A prospective study Fertil. Steril. 2016 106 311 316 10.1016/j.fertnstert.2016.03.045 27087400 PMC4975618 12. Elgendy M.O. Khalaf A.M. El-Gendy A.O. Abdelrahman M. El Gendy S.O. Hamied A.M.A. Essam O. Al Amir K. Yousry E.M. Abdelrahim M. An observational study on the management of COVID-19 patients in limited-resource hospitals J. Clin. Nurs. Res. 2022 6 43 53 10.26689/jcnr.v6i3.3852 13. Bamberg C. Hinkson L. Dudenhausen J.W. Bujak V. Kalache K.D. Henrich W. Longitudinal transvaginal ultrasound evaluation of cesarean scar niche incidence and depth in the first two years after single-or double-layer uterotomy closure: A randomized controlled trial Acta Obstet. Gynecol. Scand. 2017 96 1484 1489 10.1111/aogs.13213 28832909 14. van der Voet L. Bij de Vaate A. Veersema S. Brölmann H. Huirne J. Long-term complications of caesarean section. The niche in the scar: A prospective cohort study on niche prevalence and its relation to abnormal uterine bleeding BJOG Int. J. Obstet. Gynaecol. 2014 121 236 244 10.1111/1471-0528.12542 24373597 15. Bij de Vaate A. Brölmann H. Van Der Voet L. Van Der Slikke J. Veersema S. Huirne J. Ultrasound evaluation of the Cesarean scar: Relation between a niche and postmenstrual spotting Ultrasound Obstet. Gynecol. 2011 37 93 99 10.1002/uog.8864 21031351 16. Rosa F. Perugin G. Schettini D. Romano N. Romeo S. Podestà R. Guastavino A. Casaleggio A. Gandolfo N. Imaging findings of cesarean delivery complications: Cesarean scar disease and much more Insights Imaging 2019 10 98 10.1186/s13244-019-0780-0 31549248 PMC6757074 17. Elgendy M.O. El-Gendy A.O. Elgendy S.O. Abdelaty L.N. Abdelrahim M.E. Abdelrahman M.A. Perceptions, Knowledge, and Experiences of Using Face Masks among Egyptian Healthcare Workers during the COVID-19 Pandemic: A Cross-Sectional Study Healthcare 2023 11 838 10.3390/healthcare11060838 36981495 PMC10048152 18. Martynov S.A. Cesarean scar defects: Diagnosis and treatment in non-pregnant women Gynecology 2020 22 6 10 10.26442/20795696.2020.3.200189 19. El Agwany A.S. Gynecological and postpartum ultrasonography of cesarean uterine scar defects: A pictorial essay J. Ultrasound 2020 23 613 619 10.1007/s40477-019-00403-3 31482293 PMC7588582 20. Tulandi T. Cohen A. Emerging manifestations of cesarean scar defect in reproductive-aged women J. Minim. Invasive Gynecol. 2016 23 893 902 10.1016/j.jmig.2016.06.020 27393285 21. Tanos V. Toney Z.A. Uterine scar rupture-Prediction, prevention, diagnosis, and management Best Pract. Res. Clin. Obstet. Gynaecol. 2019 59 115 131 10.1016/j.bpobgyn.2019.01.009 30837118 22. Antila R.M. Mäenpää J.U. Huhtala H.S. Tomás E.I. Staff S.M. Association of cesarean scar defect with abnormal uterine bleeding: The results of a prospective study Eur. J. Obstet. Gynecol. Reprod. Biol. 2020 244 134 140 10.1016/j.ejogrb.2019.11.021 31785470 23. Rydahl E. Declercq E. Juhl M. Maimburg R.D. Cesarean section on a rise—Does advanced maternal age explain the increase? A population register-based study PLoS ONE 2019 14 e0210655 10.1371/journal.pone.0210655 30677047 PMC6345458 24. Khalil E.M. Madney Y.M. Hassan M. Fahmy A.M. Alshammari S.O. Alshammari Q.A. Abou-Taleb H.A. Taha A.A. Elgendy M.O. Ali H.A. Maternal and Fetal Outcome of COVID-19 Infection among Pregnant Women Medicina 2024 60 1676 10.3390/medicina60101676 39459463 PMC11509149 25. Abdelgawad M.A. Bakr R.B. El-Gendy A.O. Kamel G.M. Azouz A.A. Bukhari S.N.A. Discovery of a COX-2 selective inhibitor hit with anti-inflammatory activity and gastric ulcer protective effect Future Med. Chem. 2017 9 1899 1912 10.4155/fmc-2017-0115 29076755 26. Dodd J.M. Turnbull D. McPhee A.J. Deussen A.R. Grivell R.M. Yelland L.N. Crowther C.A. Wittert G. Owens J.A. Robinson J.S. Antenatal lifestyle advice for women who are overweight or obese: LIMIT randomised trial BMJ 2014 348 g1285 10.1136/bmj.g1285 24513442 PMC3919179 27. Fouad S.G. El-Beshry G.M. El-Kholy A.-L.G. Abbas A.M. The association between body mass index and intra-abdominal adhesions in women undergoing previous cesarean sections Ain Shams Med. J. 2022 73 327 337 10.21608/asmj.2022.252408 28. Dennis A.T. Ferguson M. Jackson S. The prevalence of perioperative iron deficiency anaemia in women undergoing caesarean section—A retrospective cohort study Perioper. Med. 2022 11 36 10.1186/s13741-022-00268-x PMC9351116 35922876 29. Adam I. Salih Y. Hamdan H.Z. Association of maternal anemia and cesarean delivery: A systematic review and meta-analysis J. Clin. Med. 2023 12 490 10.3390/jcm12020490 36675421 PMC9867340 30. Xu X. Yan J.-Y. Chen L.-C. Risk factors and maternal-fetal outcomes of pregnancies complicated by pre-eclampsia, following cesarean section after a trial vaginal birth Chin. Med. J. 2021 134 2249 2251 10.1097/CM9.0000000000001452 34238850 PMC8478398 31. Zaki A. Elgendy M.O. Abdelrahman M.A. Ali H. Khalil E.M. Hassan M. Fahmy A.M. Gad R.A. Salem H.F. The efficacy of using different antibiotics to prevent maternal surgical site infections in COVID-19-infected cases Eur. Chem. Bull. 2023 6 1342 1348 32. Abdelrahman M.A. Zaki A. Salem S.A. Salem H.F. Ibrahim A.R. Hassan A. Elgendy M.O. The Impact of Cefepime and Ampicillin/Sulbactam on Preventing Post-Cesarean Surgical Site Infections, Randomized Controlled Trail Antibiotics 2023 12 1666 10.3390/antibiotics12121666 38136700 PMC10740998 33. Hassan Abd El-Ghany S.S. Azmy A.F. Osama EL-Gendy A. Abd El-Baky R.M. Mustafa A. Abourehab M.A. El-Beeh M.E. Ibrahem R.A. Antimicrobial and Antibiofilm Activity of Monolaurin against Methicillin-Resistant Staphylococcus aureus Isolated from Wound Infections Int. J. Microbiol. 2024 2024 7518368 10.1155/2024/7518368 39129910 PMC11315973 34. Antila-Långsjö R.M. Mäenpää J.U. Huhtala H.S. Tomás E.I. Staff S.M. Cesarean scar defect: A prospective study on risk factors Am. J. Obstet. Gynecol. 2018 219 458.e1 458.e8 10.1016/j.ajog.2018.09.004 30240650 35. Tita A.T. Szychowski J.M. Boggess K. Saade G. Longo S. Clark E. Esplin S. Cleary K. Wapner R. Letson K. Adjunctive azithromycin prophylaxis for cesarean delivery N. Engl. J. Med. 2016 375 1231 1241 10.1056/NEJMoa1602044 27682034 PMC5131636 36. Essa N.M. Salem H.F. Elgendy M.O. Gabr A. Omran M.M. Hassan N.A. Tashkandi H.M. Harakeh S. Boshra M.S. Efficacy of metformin as adjuvant therapy in metastatic breast cancer treatment J. Clin. Med. 2022 11 5505 10.3390/jcm11195505 36233373 PMC9572354 37. Taha S. Mohamed W.R. Elhemely M.A. El-Gendy A.O. Mohamed T. Breast cancer and laser therapy Laser Innov. Res. Appl. 2024 2 43 66 10.21608/lira.2024.357509 38. Duong D.T.T. Binns C. Lee A. Zhao Y. Pham N.M. Hoa D.T.P. Ha B.T.T. Intention to exclusively breastfeed is associated with lower rates of cesarean section for nonmedical reasons in a cohort of mothers in Vietnam Int. J. Environ. Res. Public Health 2022 19 884 10.3390/ijerph19020884 35055705 PMC8776101 39. Rodrigues M. Kosaric N. Bonham C.A. Gurtner G.C. Wound healing: A cellular perspective Physiol. Rev. 2018 99 665 706 10.1152/physrev.00067.2017 PMC6442927 30475656 40. Essa N. Elgendy M. Gabr A. Alharbi A. Tashkandi H. Salem H. Harakeh S. Boshra M. The efficacy of metformin as adjuvant to chemotherapy on IGF levels in non-diabetic female patients with progressive and non-progressive metastatic breast cancer Eur. Rev. Med. Pharmacol. Sci. 2023 27 5200 5210 37318494 10.26355/eurrev_202306_32638 41. Chen Y. Han P. Wang Y.-J. Li Y.-X. Risk factors for incomplete healing of the uterine incision after cesarean section Arch. Gynecol. Obstet. 2017 296 355 361 10.1007/s00404-017-4417-6 28589479 42. Pan H. Zeng M. Xu T. Li D. Mol B.W. Sun J. Zhang J. The prevalence and risk predictors of cesarean scar defect at 6 weeks postpartum in Shanghai, China: A prospective cohort study Acta Obstet. Gynecol. Scand. 2019 98 413 422 10.1111/aogs.13505 30444954 43. Yazicioglu F. Gökdogan A. Kelekci S. Aygün M. Savan K. Incomplete healing of the uterine incision after caesarean section: Is it preventable? Eur. J. Obstet. Gynecol. Reprod. Biol. 2006 124 32 36 10.1016/j.ejogrb.2005.03.023 16023780 44. Siraj S.H.M. Lional K.M. Tan K.H. Wright A. Repair of the myometrial scar defect at repeat caesarean section: A modified surgical technique BMC Pregnancy Childbirth 2021 21 559 10.1186/s12884-021-04040-9 34404382 PMC8369636 45. Bij de Vaate A. Van der Voet L. Naji O. Witmer M. Veersema S. Brölmann H. Bourne T. Huirne J. Prevalence, potential risk factors for development and symptoms related to the presence of uterine niches following Cesarean section: Systematic review Ultrasound Obstet. Gynecol. 2014 43 372 382 10.1002/uog.13199 23996650 Figure 1 Post-cesarean hemoglobin concentration. Figure 2 Post-cesarean platelet count. No significance was reported among the three CS groups regarding the WBC count. Figure 3 Frequencies of symptoms in symptomatic patients with a CS niche. medicina-61-01621-t001_Table 1 Table 1 The incidence of CS defects in relation to number of previous cesarean section. CS Groups (n = 383) CS Niche, n (%) Statistic Positive Negative  One Previous CS 22 (16.3%) 113 (83.7%) X 2 p  Two Previous CSs 30 (24.4%) 93 (75.6%)  More than Two CSs 39 (31.2%) 86 (68.8%) medicina-61-01621-t002_Table 2 Table 2 Mean levels (mean ± SD) and percentages (n, %) of maternal age, prenatal BMI, and medical comorbidities among the three CS groups. Risk Factors 1 CS 2 CSs More Than 2 CSs Statistics Positive Negative Positive Negative Positive Negative  Maternal age 25.77 ± 3.77 26.65 ± 3.92 29.2 ± 3.53 29.2 ± 3.89 33.76 ± 3.12 32.74 ± 3.95  p  Prenatal BMI 32.45 ± 3.23 32.14 ± 3.1 32.4 ± 3.28 33.16 ± 3.13 34.36 ± 2.65 32.72 ± 3.11  p  Medical comorbidities         DM 0 (0%) 0 (0%) 0 (0%) 1(1.1%) 1(2.6%) 1(1.2%) p  Gastrointestinal DM 2 (0.1%) 1(0.9%) 0 (0%) 0 (0%) 0 (0%) 1(1.2%) p  Preeclampsia 3 (13.6%) 4 (3.5%) 0 (0%) 2 (2.2%) 1 (2.6%) 2 (2.3%) p  Anemia 10 (45.5) 23 (20.4%) 8 (26.7%) 20 (21.5%) 12 (30.8%) 15 (17.4%)  p medicina-61-01621-t005_Table 5 Table 5 Logistic regression correlation between factors associated with CSs. Predictors p Odds Ratio 95% CI Lower Upper  Maternal Anemia  0.276 1.66 0.668 4.125  Post-CS Platelets (Less than 150 × 10 9 ≤0.0001 4.946 2.305 10.61  Post-Operative Fever 0.082 2.072 0.912 4.708  Uterus Position ≤0.001     Retroflexion ≤0.001 3.125 1.832 5.332  Midline Position 0.218 1.393 0.53 3.664  Breastfeeding ≤0.0001 8.8 2.803 27.623 medicina-61-01621-t003_Table 3 Table 3 Percentages (n, %) of postpartum risk factors among the three CS groups. Groups Postpartum Fever Breastfeeding No Yes No Yes  One Previous CS  Positive 15 (68.2%) 7 (31.8%) 6 (27.3%) 16 (72.7%)  Negative 99 (87.6%) 14 (12.4%) 3 (2.7%) 110 (97.3%)   X 2 p X 2 p  Two Previous CSs  Positive 23 (76.7%) 7 (23.3%) 7 (23.3%) 23(76.7%)  Negative 87 (93.5%) 6 (6.5%) 3 (3.2%) 90 (96.8%)   X 2 p X 2 p  More than Two CSs  Positive 31 (79.5%) 8 (20.5%) 8 (20.5%) 31 (79.5%)  Negative 80 (93.0%) 6 (7%) 2 (2.3%) 84 (97.7%) X 2 p X 2 p medicina-61-01621-t004_Table 4 Table 4 Percentages (n, %) of uterus position among the three CS groups. Groups Uterus Position p Anteflexion Retroflexion Midline  One CS  Positive 10 (45.5%) 10 (45.5%) 2 (9.1%) 0.043  Negative 82 (72.6%) 25 (22.1%) 6 (5.3%)  Two CSs  Positive 17 (56.7%) 12 (40%) 1 (3.3%) 0.013  Negative 72 (77.4%) 14 (15.1%) 7 (7.5%)  More than Two CSs  Positive 24 (61.5%) 12 (30.8%) 3 (7.7%) 0.017  Negative 71 (82.6%) 9 (10.5%) 6 (7.0%) ",
  "metadata": {
    "Title of this paper": "Prevalence, potential risk factors for development and symptoms related to the presence of uterine niches following Cesarean section: Systematic review",
    "Journal it was published in:": "Medicina",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12471730/"
  }
}