{
  "title": "Paper_257",
  "abstract": "pmc Plast Reconstr Surg Glob Open Plast Reconstr Surg Glob Open 2522 prsgo GOX Plastic and Reconstructive Surgery Global Open 2169-7574 Wolters Kluwer Health PMC12490644 PMC12490644.1 12490644 12490644 10.1097/GOX.0000000000007082 GOX-D-25-00181 1 3 Reconstructive Case Report Modified Dynamic Lymphaticovenular Anastomosis for Surgical Management of Alzheimer Disease Zhou Zhegang MD * Chen Xuhui MD † Kou Wei MD ‡ Meng Fanbin MD * Yu Longbiao MD * Wen Jingjing MD * Boey Johnson MD § Shah Vitrag MD ¶ Malagón Paloma MD ∥ From the * † ‡ § ¶ ∥ Zhegang Zhou, Department of Hand and Microsurgery, Peking University Shenzhen Hospital, Lianhua Road 1120, Shenzhen 518036, China, E-mail: sumszzg@163.com 10 2025 02 10 2025 13 10 498115 e7082 16 2 2025 15 7 2025 02 10 2025 03 10 2025 03 10 2025 Copyright © 2025 The Authors. Published by Wolters Kluwer Health, Inc. on behalf of The American Society of Plastic Surgeons. 2025 https://creativecommons.org/licenses/by-nc-nd/4.0/ This is an open-access article distributed under the terms of the Creative Commons Attribution-Non Commercial-No Derivatives License 4.0 (CCBY-NC-ND) Summary: Alzheimer disease (AD) is a neurodegenerative disorder that frequently results in progressive cognitive decline. Despite the extensive research conducted on AD, there is presently no solution available due to its increasing prevalence. Recent research has suggested cervical lymphaticovenular anastomosis (LVA) as a therapeutic strategy to improve lymphatic outflow and potentially reduce AD symptoms. We established an amended LVA protocol to mitigate the risk of venous reflux, a prevalent issue associated with the original LVA methodology. A 64-year-old man of Chinese descent exhibited the typical signs and symptoms of AD. The absence of substantial progress with standard medical treatment led to the consideration of LVA. We used a lower limb vein graft for the LVA, anastomosing it to the cervical lymphatic vessels and external jugular vein. The cognitive function of the patient got better after LVA, as shown by higher Mini Mental State Examination and Montreal Cognitive Assessment scores. Fewer β-amyloid and tau protein deposits were observed on positron emission tomography/computed tomography scans. No adverse occurrences or issues were observed. The success in this case demonstrated the potential role of LVA in the management of AD. However, further thorough research is required to evaluate the efficacy of our technique. pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement yes pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes OPEN-ACCESS TRUE COUNTRY CHINA SDC T Alzheimer disease (AD) progresses over a continuum, beginning with a preclinical stage, advancing to mild cognitive impairment, and ultimately culminating in dementia. Biomarker derangement can manifest years before the emergence of clinical symptoms. 1 2 3 3 Preliminary animal studies suggest that improving the glymphatic system in the central nervous system can facilitate the removal of plaques and neurofibrillary tangles, hence reducing cognitive decline. 4 4 5 CASE PRESENTATION A 64-year-old Chinese man presented at the neurology department with worsening amnesia that had developed over the previous year. He had comorbid type 2 diabetes mellitus and hypertension. The patient scored 14 points on the Mini Mental State Examination (MMSE) and 11 points on the Montreal Cognitive Assessment (MoCA). The cerebrospinal fluid examination revealed that red blood cells (3 × 10 6 See figure, Supplementary Digital Content 1 https://links.lww.com/PRSGO/E287 Supplementary Digital Content 1, https://links.lww.com/PRSGO/E287 SURGICAL PROTOCOL The procedure was performed under general anesthesia with the patient in a supine position and the neck hyperextended. We injected 4 mL of 0.5% indocyanine green (ICG) solution (Dandong Yichuang Pharmaceutical, Co., Ltd., China) at 2 sites using an 18G needle: the anterior border of the sternocleidomastoid (SCM) muscle at the mandibular angle and the posterior border of the SCM muscle at the lower edge of the mastoid process. We performed ICG lymphography 30 minutes after ICG administration to identify enlarged lymphatics vessels measuring between 0.3 and 0.7 mm. At the same time, a vein finder device was used to identify a superficial vein measuring 1 mm in diameter and 10 cm in length, after which the vein graft was cut into 2 segments, each measuring about 3–5 cm in length (Fig. 1 Fig. 1. A 10-cm superficial vein with 3 tributary branches was harvested from the medial calf. A 4-cm transverse incision was made along the midline of the neck, over the SCM muscle. The EJV that lay superior over the SCM muscle was identified and carefully dissected under the surgical microscope Kinevo 900 (Carl Zeiss Meditec, Oberkochen, Germany) (Fig. 2 Fig. 2. A transverse incision is made over the SCM, and the location of the EJV is approximated using ICG lymphography. C, clavicle; T, trapezius. We placed the vein graft superomedially through the SCM muscle. The proximal aspect of the vein graft was anastomosed with the EJV in an end-to-side manner, whereas its distal part connected to deep LVs in an end-to-end anastomosis (Fig. 3 See Video [online] Fig. 3. End-to-side anastomosis of the proximal part of the vein graft to the EJV and end-to-end anastomosis of the distal aspect of the vein graft to 3 adjacent LVs.  Video 1. The video illustrates the process of selecting a donor and dissecting the EJV in our modified LVA technique. GOX.0000000000007082video1.mp4 Kaltura DISCUSSION The principle of lymphatic reconstruction has been established as an effective treatment for lymphedema. 6 7 5 7 8 6 8 The choice of a small-caliber, superficial calf vein graft diminishes the danger of reflux, resulting from a pressure differential between lymphatic and venous veins. Valves facilitate unidirectional flow into lymphatics, whereas smaller conduit tubes improve dynamic blood flow through the Venturi effect. Second, we selected the EJV over IJV due to its decreased intraluminal pressure and diminished risk of trauma or stress to the underlying deep tissue structures. Third, the presence of tributaries facilitates additional connections for lymphatics, hence enhancing the overall efficacy of LVA, as demonstrated by Yamamoto et al. 9 10 7 8 The underlying mechanism by which the LVA influences the pathophysiology of AD remains uncertain. The observation presented in this case report is inconclusive and will require longer follow-up and larger sample size to draw any relationship between lymphatic reconstruction and symptomatic improvement of AD. Nonetheless, the clinical findings serve as a foundation for investigating promising surgical intervention for AD. DISCLOSURE The authors have no financial interest to declare in relation to the content of this article. PATIENT CONSENT Written informed consent was obtained from the patient for the publication of this case report and the use of their images. ACKNOWLEDGMENT The authors appreciate the team efforts in the management of the patients presented in this case report. ETHICAL APPROVAL This study received approval from the ethics committee of the Peking University Shenzhen Hospital. Supplementary Material Published online 2 October 2025.  Disclosure statements are at the end of this article, following the correspondence information. Related Digital Media are available in the full-text version of the article on www.PRSGlobalOpen.com REFERENCES 1. Breijyeh Z Karaman R Comprehensive review on Alzheimer’s disease: causes and treatment. Molecules 2020 25 5789 33302541 10.3390/molecules25245789 PMC7764106 2. Knopman DS Amieva H Petersen RC Alzheimer disease. Nat Rev Dis Primers 2021 7 1 21 33986301 10.1038/s41572-021-00269-y PMC8574196 3. Jack CR Jr Andrews JS Beach TG Revised criteria for diagnosis and staging of Alzheimer’s disease: Alzheimer’s Association Workgroup. Alzheimers Dement 2024 20 5143 5169 38934362 10.1002/alz.13859 PMC11350039 4. Rasmussen MK Mestre H Nedergaard M The glymphatic pathway in neurological disorders. Lancet Neurol 2018 17 1016 1024 30353860 10.1016/S1474-4422(18)30318-1 PMC6261373 5. Hong JP Chen WF Nguyen DH A proposed role for lymphatic supermicrosurgery in the management of Alzheimer’s disease: a primer for reconstructive microsurgeons. Arch Plast Surg 2025 52 96 103 40083619 10.1055/a-2513-4313 PMC11896717 6. Scaglioni MF Fontein DB Arvanitakis M Systematic review of lymphovenous anastomosis (LVA) for the treatment of lymphedema. Microsurgery 2017 37 947 953 28972280 10.1002/micr.30246 7. Lu H Tan Y Xie Q Preliminary observation of deep cervical lymphatic-venous anastomosis under off-eyepiece 3D microscope to treat an elderly patient with cognitive impairment. Chin J Microsurg 2002 45 570 574 8. Li X Zhang C Fang Y Promising outcomes 5 weeks after a surgical cervical shunting procedure to unclog cerebral lymphatic systems in a patient with Alzheimer’s disease. Gen Psychiatr 2024 37 e101641 39816183 10.1136/gpsych-2024-101641 PMC11733982 9. Yamamoto T Yoshimatsu H Yamamoto N Multi-site lymphaticovenular anastomosis using vein graft for uterine cancer-related lymphedema after pelvic lymphadenectomy. Vasc Endovascular Surg 2015 49 195 200 26516190 10.1177/1538574415614402 10. Seki Y Kajikawa A Asai R Functional lymphaticovenular anastomosis for peripheral lymphedema: incision selection methods with muscle pumping. Plast Aesthet Res 2021 8 58 ",
  "metadata": {
    "Title of this paper": "Functional lymphaticovenular anastomosis for peripheral lymphedema: incision selection methods with muscle pumping.",
    "Journal it was published in:": "Plastic and Reconstructive Surgery Global Open",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12490644/"
  }
}