{
  "title": "Paper_33",
  "abstract": "pmc J Glob Infect Dis J Glob Infect Dis 1193 jginfectdis JGID J Global Infect Dis Journal of Global Infectious Diseases 0974-777X 0974-8245 Wolters Kluwer -- Medknow Publications PMC12494321 PMC12494321.1 12494321 12494321 10.4103/jgid.jgid_3_25 JGID-17-144 1 Original Article Human Papillomavirus Prevalence and Genotype Distribution in Dongguan, China Rao Minla 1 2 Chen Jianjun 1 2 Lai Wenbin 1 2 Yang Daogui 1 2 Wang Lisheng 1 2 Ouyang Hao 1 2 Yin Zhenggang 1 2 Wu Zhihuang 1 2 Chen Yanqing 1 2 Zheng Qingru 1 2 Chen Shayan 1 2 1 2 Address for correspondence: chenshayan@126.com Jul-Sep 2025 22 9 2025 17 3 498281 144 149 07 1 2025 24 4 2025 28 4 2025 22 09 2025 04 10 2025 04 10 2025 Copyright: © 2025 Journal of Global Infectious Diseases 2025 https://creativecommons.org/licenses/by-nc-sa/4.0/ This is an open access journal, and articles are distributed under the terms of the Creative Commons Attribution-NonCommercial-ShareAlike 4.0 License, which allows others to remix, tweak, and build upon the work non-commercially, as long as appropriate credit is given and the new creations are licensed under the identical terms. Introduction: Cervical cancer is strongly associated with human papillomavirus (HPV) infection. In this retrospective study, we analyzed the data of individuals who were tested for HPV at Binhaiwan Central Hospital in Dongguan. Methods: We retrospectively analyzed the data of 73,149 participants who underwent HPV examination at Binhaiwan Central Hospital in Dongguan. All participants were tested for HPV genotypes. We subsequently analyzed the infection rate and evaluated the distribution of HPV using the Chi-square test. Results: The results suggest that the five most common HPV infection genotypes for men in the Dongguan area are different from those for women. The five most common high-risk HPV infections in women were the HPV52, 16, 58, 53, and 68 genotypes, whereas the five most common genotypes in men were HPV52, 16, 51, 58, and 39. The highest HPV infection positivity rate for female patients (31.68%) was in the 31–40 year age group, whereas the highest HPV infection positivity rate for male patients (40.47%) was in the 21–30 year age group. Conclusions: These findings provide a theoretical basis for epidemiological investigations, clinical prevention, and treatment of HPV infection and HPV vaccination in the region. The results could provide valuable information for healthcare professionals and policymakers to develop targeted prevention and screening strategies for reducing the burden of HPV-related diseases in this population. Cervical cancer distribution genotype human papillomavirus prevalence This work was supported by grants Dongguan Science and Technology of Social Development. Program 20231800940062 (Shayan Chen was the recipient) and grant BS2023001 (Shayan Chen was its recipient) from the Doctoral Research Foundation of Binhaiwan Central Hospital in Dongguan. pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement no pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes I NTRODUCTION Human papillomavirus (HPV) infection is a common genital tract infection that can cause a series of lesions on the skin/mucous membranes of the genital tract and is closely related to cervical cancer.[ 1 2 3 4 5 6 Cervical cancer is a common gynecological tumor and has become the second-most common malignant tumor in the world after breast cancer among all early-stage tumors in older women worldwide.[ 7 8 9 10 The objective of this study was to identify more targeted strategies for the prevention, treatment, and elimination of cervical cancer and HPV-related diseases. In this study, we conducted a comprehensive and in-depth exploration of the patterns of HPV infection using data from 73,149 participants. The content of this study is thorough and has significant implications for guiding clinical practice. Data sources In this study, data from 73,149 patients from the Binhaiwan Central Hospital in Dongguan City between July 2015 and July 2022 were retrospectively analyzed. The local ethics committees approved each of the studies, and the patients were divided into two groups: men and women. HPV testing was used as a routine examination for suspected gynecologic conditions in higher-income families. HPV positivity was identified by polymerase chain reaction (PCR), and 17 HPV genotypes were tested, including 15 HR-HPV genotypes (HPV 16, 18, 31, 33, 35, 39, 45, 51, 52, 53, 56, 58, 59, 66, and 68) and 2 LR-HPV genotypes (HPV 6 and 11). The test kit was purchased from SANSURE BIOTECH INC for the High-risk HPV Nucleic Acid (Typing) Diagnostic Kit (PCR-Fluorescent Probing) and HPV (Type 6 and 11) DNA Fluorescence Diagnostic Kit (PCR-Fluorescent Probing). Owing to changes in the test kits, specific genotypes 6 and 11 can be differentiated from 2015 to 2017, but 6 and 11 cannot be differentiated from 2017 to 2022; thus, all LR-HPVs are denoted as 6/11, and the other genotypes are as described. Statistical analysis The prevalence of HPV infection, the presence of single or multiple HPV infections, and HPV genotypes were estimated through binomial distribution analysis. A Chi-square test was performed to compare the differences in the infection rates (the number of positive individuals among the corresponding whole population) of HPV or HR-HPV and the ratio of positive individuals (the number of positive individuals among the corresponding population) of HR-HPV or LR-HPV among the various patients. The Bonferroni method was used to adjust the P P P M ETHODS Study subjects: The study population included patients who underwent routine cervical exams at Binhaiwan Central Hospital between 2015 and 2022 in Dongguan, China. All patients underwent genotyping for HPV and cervical cytological evaluation combined with colposcopy. The exclusion criteria were pregnancy, total hysterectomy, systemic infection or autoimmune diseases, surgery for uterine diseases within 3 days, or other cancers. Specimen collection: Patients were asked not to urinate for 2 h before sampling. (1) The attending physician used a speculum and a cervical sampler to collect a sample of exfoliated cervical cells or male urethral secretions, which were preserved in a cytochemical preservation solution for examination. The standardized collection method for women is as follows: before sampling, excess secretions from the cervix were removed, the cervical brush was held firmly against the mucosa of the cervix, the cervical brush was gently rubbed to rotate the swab clockwise 3–4 times to obtain secretions and exfoliated cells, and the sample was placed in a sterile sample tube containing cytoplasmic preservation solution. The excess brush handle was removed at the mouth of the tube and the tube was sealed. For men, male urethral secretions were collected, and the excess secretions from the urethra were gently wiped clean with a cotton swab before sampling. The cotton swab was replaced with a saline-moistened cotton swab that was tightly applied to the mucous membrane of the urethra, and the samples were rotated with slight force for 2 weeks before the collected swabs were placed in sterile sample collection tubes and sent for testing in a closed container. (2) Sample processing: In the sample processing room, nucleic acid extraction reagents were used for nucleic acid release from exfoliated cervical cell samples. (3) PCR reagent preparation and PCR amplification: The PCR mixture was prepared according to the instructions of the kit (purchased from SANSURE BIOTECH INC); 25 µL of the treated sample was added to each of the PCR tubes, and the mixture was mixed with 25 µL of nucleic acid release reagent. The samples were subsequently added, after which PCR amplification was started. The PCR program was as follows: initial denaturation step at 95°C for 9 min; followed by 40 cycles of 95°C for 20 s, 55°C for 30 s, 72°C for 30 s, and a final extension at 72°C for 5 min. The PCR results were automatically saved after the reaction; the start value, end value, and threshold value of the baseline were adjusted according to the analyzed image; a click analysis was performed; and then the Ct value was recorded. Genotyping was performed through hybridization of the PCR products to a gene chip containing 15 h-HPV and 2 LR-HPV genotype-specific oligonucleotides, and the genotype was analyzed using SANSURE BIOTECH INC. This kit did not require the DNA in the sample to be extracted separately during the entire experimental process; instead, the sample was mixed directly with the nucleic acid-releasing agent, which can be used as the template for PCR amplification, avoiding environmental contamination in the process of conventional nucleic acid extraction. This detection system involved uracil DNA glycosylase + dUTP anticontamination measures, which fully degrade the possible contamination products, avoiding false-positive results. The chip can identify 15 h-HPV genotypes and 2 LR-HPV genotypes. The final results were detected by colorimetric changes on the chip under direct visualization, and blue – purple spots were recognized as positive for HPV. For quality control, PCR amplification of the samples was performed in strict accordance with the manufacturer’s instructions; hybridization, color development, and other treatments were performed in strict accordance with the operating procedures of the manual. The results were interpreted on the premise that the CC point (coloring quality control point; positive means the hybridization process is normal) and PC point (internal reference point; positive means the sampling, DNA extraction, and PCR process is normal) all presented blue colouration. R ESULTS Human papillomavirus prevalence among 73,149 patients Among the 73,149 patients, 13,367 (18.3%) were positive for HPV infection, among whom 9171 (68.6%) were positive for a single-genotype infection and 4196 (31.4%) for multiple infections [ Figure 1 Figure 1 Human papillomavirus prevalence among 73,149 people Human papillomavirus infection and genotype distribution A total of 73,149 patients were investigated, of whom 9171 were positive, resulting in a total infection rate of 12.54%. The five most common high-risk genotypes were HPV52, 16, 58, 53, and 68, with infection rates of 4.68%, 2.95%, 2.45%, 1.75%, and 1.70%, respectively. The LR-HPV infection rate was 4.45% (4334/48,573) [ Figure 2c Figure 2a Figure 2b Figure 2 Human papillomavirus (HPV) Infection and genotype distribution in Dongguan from 2015 to 2022. (a) HPV infection and genotype distribution in females, (b) HPV infection and genotype distribution in males, (c) total HPV infection and genotype distribution. The first 15 were high-risk HPV genotypes, and the last was a low-risk genotype Age distribution profile of patients with human papillomavirus infection When the patients were divided according to age into six groups and analyzed within the overall patient population, the 31–40 year age group had the greatest rate of HPV infection positivity, at 31.96%. The 21–30 year age group had the second highest percentage, at 31.62%. This distribution pattern was the same as that of the female patient group. The HPV infection positivity rates of female patients were 31.68% and 30.03% in the 31–40 and 21–30 years age groups, respectively; however, in the male patient group, the 21–30 year age group had the highest HPV infection positivity rate, at 40.47%. The 31–40 year age group was the second largest at 33.51% [ Figure 3 Figure 3 Age distribution profile of human papillomavirus (HPV) infection in Dongguan in 2015–2022. (a) Age distribution profile of HPV infection in women, (b) Age distribution profile of HPV infection in men, (c) Overall age distribution profile of HPV infection Genotype distribution in the human papillomavirus-positive population in the female group Because of the large gap between the male and female samples in this study, with the female samples being much more numerous than the male samples, the HPV genotype infections in the different age groups in the table below are represented by the female group. As presented in Table 1 Table 1 Distribution of different types of human papillomavirus in each age group (women) Age groups ≤20 21–30 31–40 41–50 51–60 ≥61 Total HPV16 118 557 551 451 172 53 1902 HPV18 47 184 202 133 44 8 618 HPV31 30 100 118 82 38 7 375 HPV33 37 139 153 152 66 20 567 HPV35 14 62 76 54 21 6 233 HPV39 65 335 273 207 106 11 997 HPV 45 12 50 36 37 11 5 151 HPV51 78 392 300 173 80 10 1033 HPV52 162 998 934 726 284 60 3164 HPV56 52 169 204 149 58 13 645 HPV58 85 449 516 397 146 39 1632 HPV59 39 124 91 74 27 2 357 HPV68 59 336 354 247 83 21 1100 HPV53 55 303 358 299 111 30 1156 HPV66 54 186 189 131 49 5 614 HPV6 or 11 203 616 464 258 89 12 1642 HPV 1110 5000 4819 3570 1385 302 16,186 HPV: Human papillomavirus Human papillomavirus positivity rates from 2015 to 2022 Among the 73,149 patients, the positive rate of HPV infection decreased annually from 2015 to 2022, with the rate of infection in female patients ranging from 22.87% to 13.17% [ Figure 4 Figure 4 Human papillomavirus positivity rates from 2015 to 2022. HPV: Human papillomavirus D ISCUSSION The prevalence of HPV infection and its genotype distribution have been reported in different countries and regions around the world,[ 11 12 13 14 15 16 17 18 19 20 21 Some studies have shown a bimodal pattern of age trends in HPV infection, and the second peak around menopause has been hypothesized to be associated with age effects (i.e. impaired immune response, changes in sexual behavior, or reactivation of latent infections) or birth cohort effects (i.e. particular sexual behavior, and attitudes or contraceptive usage).[ 22 23 24 Because of the limitations of the test kits we used, we only detected a total of 15 HR-HPV genotypes instead of the 23 types of HPV test kits that are commonly available on the market today, which may not be as comprehensive for HPV typing in the Dongguan area. The number of male patients is considerably lower than the number of female patients, so HPV infection in Dongguan should be discussed and analyzed in terms of males and females. In recent years, the cervical cancer vaccine has also been a major social hotspot. Currently, there are bivalent, quadrivalent, and 9-valent HPV vaccines on the market; the bivalent vaccine targets HPV types 16 and 18; the quadrivalent vaccine targets HPV types 6, 11, 16, and 18; and the 9-valent vaccine adds five genotypes–31, 33, 45, 52 and 58–on the basis of the quadrivalent vaccine.[ 25 26 27 28 29 30 31 C ONCLUSIONS This study describes the baseline type and age-specific HPV prevalence among females and males in Dongguan, which may provide a baseline HPV prevalence. The highest rate of positivity was found in the 30–50 year age group. This may be related to women’s awareness of health care and financial independence in this age group; the highest number of tests are also performed in this age group. While postmenopausal women are more susceptible to HPV infection due to lower immunity, the rate of postmenopausal HPV infection is not high in Dongguan due to economic, religious, personal, and family factors. Therefore, there is a need for increased attention and targeted interventions in this age range. We need to better classify patients infected with HPV to provide useful information for prognosis and tailor the most appropriate treatment regimen for these patients. Research quality and ethics statement The present study obtained ethical approval (no. Z2025001) from the Ethical Committee of Binhaiwan Central Hospital of Dongguan, in accordance with the Helsinki Declaration. Due to its retrospective design, a waiver of participant informed consent was granted by the Ethical Committee of Binhaiwan Central Hospital of Dongguan. Conflicts of interest There are no conflicts of interest. Acknowledgment We appreciate the help of technical support from Department of Laboratory Science, Binhaiwan Central Hospital of Dongguan, Guangdong Province, 523905, China. Thank you to all participants involved in the study. R EFERENCES 1. Rahangdale L Mungo C O’Connor S Chibwesha CJ Brewer NT Human papillomavirus vaccination and cervical cancer risk BMJ 2022 379 e070115 36521855 10.1136/bmj-2022-070115 2. Buttà M Serra N Panzarella V Fasciana TM Campisi G Capra G Orogenital human papillomavirus infection and vaccines: A survey of high- and low-risk genotypes not included in vaccines Vaccines (Basel) 2023 11 1466 37766142 10.3390/vaccines11091466 PMC10535452 3. Perkins RB Wentzensen N Guido RS Schiffman M Cervical cancer screening: A review JAMA 2023 330 547 58 37552298 10.1001/jama.2023.13174 4. Capra G Notari T Buttà M Serra N Rizzo G Bosco L Human papillomavirus (HPV) infection and its impact on male infertility Life (Basel) 2022 12 1919 36431054 10.3390/life12111919 PMC9697777 5. Bai A Xue P Li Q Jiang Y Qiao Y Diagnostic value of high-risk HPV other than type 16/18 in high-grade cervical neoplasia among cytology-negative women: A multicenter retrospective study Cancer Med 2023 12 14794 805 37199394 10.1002/cam4.6109 PMC10358197 6. Wieland U Kreuter A HPV-induced anal lesions Hautarzt 2015 66 439 45 25859930 10.1007/s00105-015-3630-0 7. Podwika SE Duska LR Top advances of the year: Cervical cancer Cancer 2023 129 657 63 36609769 10.1002/cncr.34617 PMC10107116 8. Yang X Li Y Tang Y Li Z Wang S Luo X Cervical HPV infection in Guangzhou, China: An epidemiological study of 198,111 women from 2015 to 2021 Emerg Microbes Infect 2023 12 e2176009 36744409 10.1080/22221751.2023.2176009 PMC9936994 9. Jing L Zhong X Huang W Liu Y Wang M Miao Z HPV genotypes and associated cervical cytological abnormalities in women from the Pearl River Delta region of Guangdong province, China: A cross-sectional study BMC Infect Dis 2014 14 388 25016305 10.1186/1471-2334-14-388 PMC4226991 10. Pan C Pan H Liang D Liu Y Yin S Zhong J A cross-sectional survey on mother-to-child transmission of HIV among the migrant population in Dongguan, China Front Glob Womens Health, 2023 4 1 8 10.3389/fgwh.2023.1106959 PMC10587463 37867931 11. Shen Y Huang Y Wang W Zhang J Chen X Zhang L Prevalence and genotype distribution of HPV infection among women in Xiamen, China Front Microbiol, 2023 14 21 9 10.3389/fmicb.2023.1130226 PMC10265632 37323886 12. Kombe Kombe AJ Li B Zahid A Mengist HM Bounda GA Zhou Y Epidemiology and burden of human papillomavirus and related diseases, molecular pathogenesis, and vaccine evaluation Front Public Health 2020 8 552028 33553082 10.3389/fpubh.2020.552028 PMC7855977 13. Li S Zhang K Yang L Wu J Bhargava N Li Y Distribution patterns of human papillomavirus genotypes among women in Guangzhou, China Infect Agent Cancer 2023 18 67 37907979 10.1186/s13027-023-00541-8 PMC10617049 14. Chow EP Danielewski JA Fehler G Tabrizi SN Law MG Bradshaw CS Human papillomavirus in young women with chlamydia trachomatis infection 7 years after the Australian human papillomavirus vaccination programme: A cross-sectional study Lancet Infect Dis 2015 15 1314 23 26201300 10.1016/S1473-3099(15)00055-9 15. Rahmat F Kuan JY Hajiman Z Mohamed Shakrin NN Che Roos NA Mustapa M Human papillomavirus (HPV) prevalence and type distribution in urban areas of Malaysia Asian Pac J Cancer Prev 2021 22 2969 76 34582669 10.31557/APJCP.2021.22.9.2969 PMC8850893 16. Jordá GB Ramos JM Mosmann J Lopez ML Wegert A Cuffini C Prevalence of human papillomavirus and associated risk factors in women affiliated with state health insurance in Posadas, Misiones (Argentina) Rev Chilena Infectol 2020 37 111 6 32730475 10.4067/s0716-10182020000200111 17. Alarcón-Romero LD Organista-Nava J Gómez-Gómez Y Ortiz-Ortiz J Hernández-Sotelo D Del Moral-Hernández O Prevalence and Distribution of Human Papillomavirus Genotypes (1997-2019) and Their Association With Cervical Cancer and Precursor Lesions in Women From Southern Mexico Cancer Control, 2022 29 1 21 10.1177/10732748221103331 PMC9136461 35608056 18. Bitarafan F Hekmat MR Khodaeian M Razmara E Ashrafganjoei T Modares Gilani M Prevalence and genotype distribution of human papillomavirus infection among 12 076 Iranian women Int J Infect Dis 2021 111 295 302 34343706 10.1016/j.ijid.2021.07.071 19. Chen Y Li S Zheng J Xue H Chen J Zheng X Prevalence of multiple human papillomavirus infections and association with cervical lesions among outpatients in Fujian, China: A cross-sectional study J Med Virol 2022 94 6028 36 35945897 10.1002/jmv.28062 20. Sundström K Ploner A Arnheim-Dahlström L Eloranta S Palmgren J Adami HO Interactions between high- and low-risk HPV types reduce the risk of squamous cervical cancer J Natl Cancer Inst 2015 107 djv185 26160881 10.1093/jnci/djv185 PMC5964715 21. Ye Z Zhao Y Chen M Lu Q Wang J Cui X Distribution and diagnostic value of single and multiple high-risk HPV infections in detection of cervical intraepithelial neoplasia: A retrospective multicenter study in China J Med Virol 2024 96 e29835 39087721 10.1002/jmv.29835 22. Bao HL Jin C Wang S Song Y Xu ZY Yan XJ Prevalence of cervicovaginal human papillomavirus infection and genotypes in the pre-vaccine era in China: A nationwide population-based study J Infect 2021 82 75 83 33610682 10.1016/j.jinf.2021.02.017 23. Zhao F Lang J Qiao Y Zhu L How can China achieve WHO’s 2030 targets for eliminating cervical cancer? BMJ 2024 386 e078641 39214542 10.1136/bmj-2023-078641 PMC11359838 24. Ramet J van Esso D Meszner Z European Academy of Paediatrics Scientific Working Group on Vaccination Position paper – HPV and the primary prevention of cancer; improving vaccine uptake by paediatricians Eur J Pediatr 2011 170 309 21 20686784 10.1007/s00431-010-1265-9 25. Pathak P Pajai S Kesharwani H A review on the use of the HPV vaccine in the prevention of cervical cancer Cureus 2022 14 e28710 36211088 10.7759/cureus.28710 PMC9529156 26. Skolnik JM Morrow MP Vaccines for HPV-associated diseases Mol Aspects Med 2023 94 101224 37931422 10.1016/j.mam.2023.101224 27. Ma MJ Wang YN Zhu JF Wang XY Jin YB Liu XN Characterization of HPV subtypes not covered by the nine-valent vaccine in patients with CIN 2-3 and cervical squamous cell carcinoma Curr Probl Cancer 2021 45 100761 34154817 10.1016/j.currproblcancer.2021.100761 28. Schurink-van ‘t Klooster TM Siebers AG Hoes J van Kemenade FJ Berkhof J Bogaards JA Early effect of bivalent human papillomavirus vaccination on cytology outcomes in cervical samples among young women in the Netherlands Cancer Med 2023 12 11786 94 36965085 10.1002/cam4.5842 PMC10242855 29. Di Donato V Caruso G Bogani G Cavallari EN Palaia G Perniola G HPV vaccination after primary treatment of HPV-related disease across different organ sites: A multidisciplinary comprehensive review and meta-analysis Vaccines (Basel) 2022 10 239 35214697 10.3390/vaccines10020239 PMC8879645 30. Shapiro GK HPV vaccination: An underused strategy for the prevention of cancer Curr Oncol 2022 29 3780 92 35621693 10.3390/curroncol29050303 PMC9140027 31. Zhao C Zhao Y Li J Li M Shi Y Wei L Opportunities and challenges for human papillomavirus vaccination in China Hum Vaccin Immunother, 2024 20 23 34 10.1080/21645515.2024.2329450 PMC10996835 38575524 ",
  "metadata": {
    "Title of this paper": "Opportunities and challenges for human papillomavirus vaccination in China",
    "Journal it was published in:": "Journal of Global Infectious Diseases",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12494321/"
  }
}