{
  "title": "Paper_1103",
  "abstract": "pmc J Multidiscip Healthc J Multidiscip Healthc 1406 jmulthealth jmdh Journal of Multidisciplinary Healthcare 1178-2390 Dove Press PMC12477277 PMC12477277.1 12477277 12477277 41030906 10.2147/JMDH.S536880 536880 1 Review Multimodal Magnetic Resonance Imaging and Radiomics in Brucella Spondylitis: Diagnostic Applications and Differential Diagnosis Wu and Wang Wu and Wang Wu Xiaopeng 1 Wang Ruijun 1 1 The Affliated Hospital of Inner Mongolia Medical University Hohhot Inner Mongolia People’s Republic of China Correspondence: Ruijun Wang, Email 602507851@qq.com 24 9 2025 2025 18 479228 6091 6101 26 4 2025 13 9 2025 24 09 2025 30 09 2025 01 10 2025 © 2025 Wu and Wang. 2025 Wu and Wang. https://creativecommons.org/licenses/by-nc/4.0/ This work is published and licensed by Dove Medical Press Limited. The full terms of this license are available at https://www.dovepress.com/terms.php http://creativecommons.org/licenses/by-nc/4.0/ https://www.dovepress.com/terms.php Abstract Brucella spondylitis (BS) is one of the most common and serious complications of brucellosis, with insidious clinical manifestations and lack of specificity, which often delay the disease and cause a series of adverse consequences such as multi-organ involvement and dysfunction in severe cases. Due to the lag of laboratory-related laboratory tests and pathological examinations and the many factors that interfere with the confirmed results, the diagnosis and treatment of BS are affected. Magnetic resonance imaging (MRI) is particularly important in the diagnosis of BS and in the assessment of disease progression, treatment efficacy, and prognosis through a refined response to the structure and function of diseased tissues due to its multiparametric imaging and good tissue resolution. Radiomics, as an emerging means to quantitatively analyze image information and provide disease diagnosis and treatment assistance, is gradually showing its important value, by screening the omics features of the imaging affected vertebral bodies, constructing a diagnostic model based on machine learning, and conducting research on the diagnosis and differential diagnosis of BS. Keywords brucella spondylitis conventional magnetic resonance functional magnetic resonance radiomics machine learning disease staging Inner Mongolia Medical University Affiliated Hospital Inner Mongolia Autonomous Region Clinical Medicine Research Center of Nervous System Diseases Hohhot Region High-quality Developmental and Advantageous Key Clinical Project of Neurological System Disease This work is funded by the research project of Inner Mongolia Medical University Affiliated Hospital, funded by National Natural Science Foundation of China (82060906), 2024 Central-Guided Local Science and Technology Development Funding Project (2024ZY0086), Inner Mongolia Autonomous Region Clinical Medicine Research Center of Nervous System Diseases, Hohhot Region High-quality Developmental and Advantageous Key Clinical Project of Neurological System Disease (2023NYFY LHQN003). pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement no pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes Introduction Brucellosis is the world’s most common zoonotic infectious disease caused by Brucella (Brucella.spp) infection. There are about 500,000 new cases in the world every year, 1 2 3 4 5 6 7 8 9 5 10 11 12 According to the latest expert consensus on the diagnosis of BS imaging, DR combined with MRI is recommended for the diagnosis and follow-up of patients with BS. 13 Conventional Magnetic Resonance Plain X-rays and CT scans have limited diagnostic capabilities for brucella spondylitis, and conventional MRI has become an important imaging tool for early clinical detection and differential diagnosis. Bai et al 14 15 16 17 18 Functional Magnetic Resonance Functional magnetic resonance imaging can non-invasively quantitatively analyze a series of characteristics such as water molecule diffusion, tissue microcirculation and blood perfusion at the lesion site, providing multiple options for the display of disease tissue structure changes and pathophysiological characteristics, and providing important research and clinical application value for the diagnosis and treatment of BS, especially treatment evaluation and prognosis. Incoherent Movement within Voxels Intravoxel incoherent motion (IVIM) is a double-exponential, multi-b-value model based on a derivative technique based on DWI first proposed by Bihan et al 19 20 Diffusion-Weighted Imaging of a Double Exponential Model The IVIM parameters can be separated from diffusion by biexponential model analysis, enabling the measurement of diffusion-related parameters D (reflecting tissue diffusion) and perfusion-related parameters, including D* (reflecting pseudo-diffusion coefficients), f (reflecting perfusion fractions). The D value (ADC slow) is the simple diffusion coefficient, which represents the pure diffusion motion of water molecules, the D* value (ADC fast) is the pseudo-diffusion coefficient, which reflects the diffusion motion or rapid diffusion motion of simple water molecules related to the perfusion of blood flow in the tissue, and the f-value is the perfusion fraction, which reflects the volume ratio of the perfusion-related effect in the local microcirculation to the overall diffusion effect of the blood volume in the region of interest, between 0 and 1. Wu et al 21 22 23 24 25 26 23 27 28 29 30 31 The parameters of the IVIM biexponential model can reflect the true spread within the lesion without being affected by perfusion-related diffusion, but the application of high b value in the IVIM model will significantly prolong the scanning time and increase the motion and sensitivity artifacts, so the search for standard and stable scanning parameters is an urgent need to be solved in future research. Diffusion-Weighted Imaging of the Stretch Index Model The biexponical model sometimes does not fully reflect the diffuse motion of the human body, and Bennett et al 32 33 34 27 Quantitative Dynamic Contrast-Enhanced Magnetic Resonance Imaging Quantitative Dynamic Contrast-Enhanced Magnetic Resonance Imaging (DCE-MRI) is an imaging method that can semi-quantitatively or quantitatively assess tissue perfusion and microenvironment changes. Due to the introduction of pharmacokinetic models, quantitative analysis not only reflects the contrast agent transport in the form of perfusion maps, but also analyzes the contrast agent exchange between blood vessels and tissues mainly in the form of osmotic maps, which is more sensitive to changes in the microstructure and microcirculation of tissues. 35 36 37 38 39 40 41 42 Magnetic Resonance Diffusion Tensor Imaging (DTI) Due to the differences in the microstructure of tissues in vivo, the direction and rate of free dispersion of water molecules in three-dimensional space are different, and this difference is the basis of DTI imaging. The non-invasive and quantitative analysis of the diffusion characteristics of water molecules in tissues can not only show the structural integrity of nerve and muscle tissues, but also have certain advantages in showing articular surface cartilage and spinal cord injuries, and find pathological changes that cannot be shown by conventional MRI, providing important information for the treatment and prognosis of clinical diseases. 43 44 45 T2 Mapping T2 mapping is a T2 quantitative measurement imaging method developed based on T2-weighted sequences. It is particularly sensitive to intracartilage water molecules, collagen fibers, and tissue anisotropy, and can detect abnormal signal changes before morphological changes are detected by the lateral magnetization attenuation of tissues. 46 47–49 50 51 52 Radiomics Radiomics is an emerging quantitative analysis method for extracting a large number of imaging features from image images at high throughput, and can be used as a non-invasive image research strategy. 53 54 55–57 The application of radiomics in spinal diseases has developed rapidly, including the identification and segmentation of spinal anatomy, the differential diagnosis of spinal infectious diseases, the differential diagnosis of spinal tumors, and the prediction of benign and malignant compression fractures of the vertebral body. 58 59 Supplementary Table 1 60 61 62 62 Supplementary Figure 1 Summary and Outlook Conventional MRI provides clear visualization of anatomical structures and signal characteristics in the vertebral body, intervertebral discs, muscles, ligaments, and spinal cord. However, its reliance on morphological features often lags behind underlying pathophysiological changes, limiting its utility in early lesion detection and disease evaluation. In contrast, functional MRI techniques such as DCE-MRI enable quantitative monitoring of tissue perfusion and microcirculation, offering advantages in longitudinal assessment of treatment efficacy, though current evidence lacks validation against long-term clinical outcomes. IVIM complements DCE-MRI by quantitatively analyzing water molecule diffusion and microvascular perfusion in living tissues without contrast agents. Meanwhile, DTI and T2 mapping provide multi-angular quantitative insights into water molecule diffusion, reflecting inflammatory damage and repair processes in BS. Radiomics based on magnetic resonance imaging extracts high-dimensional features to deliver detailed, personalized information for managing infectious diseases like BS, with reported models demonstrating high performance (eg, AUC up to 0.998); nevertheless, these results are susceptible to overfitting due to small cohort sizes and require robust validation to ensure generalizability. Overall, conventional and functional MRI, alongside radiomics, enhance the understanding of spinal injury and repair mechanisms in BS, facilitating improved efficacy and prognostic assessments. Key findings from the reviewed literature underscore the diagnostic superiority of multimodal MRI over conventional imaging alone, particularly in differentiating BS from tuberculous spondylitis (TS) and pyogenic spondylitis (PS), where radiomics models achieve high accuracy in identifying subtle microstructural differences. For instance, interpretable radiomics nomograms based on MRI features have shown promise in clinical settings by providing non-invasive, quantitative biomarkers for early detection and staging. However, the reviewed findings logically align with existing evidence but tend to overstate clinical readiness, as most studies are retrospective, limited by methodological heterogeneity (eg, variable b-values in IVIM or scanner field strengths), and reliant on small, predominantly Chinese cohorts, which may introduce regional biases. Furthermore, BS-specific challenges, such as resource limitations in endemic regions (eg, pastoral areas in northern China or the Middle East with restricted access to advanced MRI scanners), have not been adequately contextualized. Cost-feasibility trade-offs among techniques must also be considered: for instance, DTI’s prolonged scan times and susceptibility to motion artifacts may hinder routine use in resource-constrained settings, whereas IVIM’s non-invasive, contrast-free nature offers greater practicality, albeit with lower reproducibility in perfusion metrics. Radiomics, while promising, faces interpretive challenges due to its “black-box” algorithms and preprocessing demands, potentially exacerbating adoption barriers in low-resource environments. In clinical practice, we recommend integrating multimodal MRI into the management of BS to optimize diagnostic accuracy and treatment monitoring. For patients presenting with non-specific symptoms in endemic areas, initial evaluation should combine conventional MRI with functional sequences (eg, IVIM or DCE-MRI) to assess microstructural and perfusion changes, followed by radiomics analysis for differential diagnosis against TS or PS. This approach can guide antibiotic therapy selection and surgical interventions, such as in cases of cervical BS where real-time PCR and biopsy confirmation are complemented by MRI-based classification. Additionally, in resource-limited settings, prioritizing cost-effective protocols—like abbreviated MRI scans with radiomics triage—could enhance accessibility while maintaining diagnostic efficacy. Although this narrative review synthesizes timely advancements, its contributions are incremental, building upon prior knowledge rather than introducing transformative innovations. Looking ahead, future research should prioritize expanding sample sizes through multi-center, international collaborations to mitigate overfitting and enhance reproducibility, as evidenced by recent two-center studies on interpretable radiomics for differentiating BS from tuberculous spondylitis. Integrating deep learning with multimodal MRI—such as developing nomogram models for early versus advanced BS staging, as explored in 2025 investigations—could enable horizontal multi-parameter diagnostics and differential diagnoses. Longitudinal studies combining functional MRI parameters with prognostic indicators (eg, serological titers, pain scores, and neurological outcomes) are essential for establishing correlations, predicting disease progression, and identifying independent predictive biomarkers. Additionally, incorporating hybrid imaging (eg, MRI with PET-CT) and cost-effectiveness analyses will address feasibility in endemic areas, proposing pragmatic strategies like portable MRI protocols or AI-driven triage tools. 63 64 Disclosure The authors report no conflicts of interest in this work. References 1. Yang S Wu J Ding C Epidemiological features of and changes in incidence of infectious diseases in China in the first decade after the SARS outbreak: an observational trend study Lancet Infect Dis 2017 17 7 716 725 10.1016/S1473-3099(17)30227-X 28412150 PMC7164789 2. Yang H Chen Q Li Y Epidemic characteristics, high-risk areas and space-time clusters of human brucellosis - China, 2020-2021 China CDC Wkly 2023 5 1 17 22 10.46234/ccdcw2023.004 36777468 PMC9902746 3. Zhu L Zhang C Liang C Molecular epidemiological characteristics of osteoarthritis-associated Brucella melitensis in China: evidence from whole-genome sequencing-based analysis Ann Clin Microbiol Antimicrob 2024 23 1 18 10.1186/s12941-024-00671-w 38402187 PMC10893595 4. Yang H Chen Q Li Y Epidemic characteristics, high- risk areas and space-time clusters of human brucellosis: China, 2020-2021 China CDC Wkly 2023 5 1 17 22 36777468 10.46234/ccdcw2023.004 PMC9902746 5. Sargsyan L Davtyan K Hann K Acute and chronic brucellosis eleven-year audit from a tertiary hospital in Armenia J Infect Dev Ctries 2019 13 5 42S 50S 10.3855/jidc.10934 32049665 6. Pellegrini JM Gorvel JP Mémet S Immunosuppressive mechanisms in brucellosis in light of chronic bacterial diseases Microorganisms 2022 10 7 1260 10.3390/microorganisms10071260 35888979 PMC9324529 7. Spernovasilis N Karantanas A Markaki I Brucella spondylitis: currentknowledge and recent advances J Clin Med 2024 13 2 595 10.3390/jcm13020595 38276100 PMC10816169 8. Jin M Fan Z Gao R Research progress on complications of brucellosis Front Cell Infect Microbiol 2023 13 1136674 10.3389/fcimb.2023.1136674 37065189 PMC10102637 9. Dasari SP Patel M Saravanan V A Case of Diffuse Brucellar Spondylodiscitis Cureus 2021 13 9 e1787 10.7759/cureus.17874 PMC8432429 34527504 10. Editorial Board of Chinese Journal of Infectious Diseases Expert consensus on the diagnosis and treatment of brucellosis Chin J Infect Dis 2017 12 35 705 710 11. Lan S Yl H Tiheiran M The Angiopoietin-like protein 4: a promising biomarker to distinguish Brucella spondylitis from tuberculous spondylitis Clin Rheumatol 2021 40 10 4289 4294 10.1007/s10067-021-05752-1 33959835 PMC8463333 12. Unuvar G Ulu KA Doganay M Current therapeutic strategy in osteoarticular brucellosis North Clin Istanb 2019 6 4 415 420 10.14744/nci.2019.05658 31909392 PMC6936947 13. Infectious Disease Group of the Radiology Branch of the Chinese Medical Association, Infection and Inflammation Radiology Committee of the Chinese Research Hospital Association, AIDS Radiology Committee of the Chinese Association for the Prevention and Treatment of AIDS and STDs, etc Expert consensus on imaging diagnosis of Brucella spondylitis Chin J Med Imaging Technol 2023 39 7 961 965 14. Bai Y Qiao P Gao Y MRI characteristics of brucellar spondylodiscitis in cervical or thoracic segments Biomed Res 2017 28 18 970 983 15. Esmaeilnejad SM Esmaeilnejad SMR Osteoarticular manifestations of human brucellosis:a review World J Orthop 2019 10 2 54 62 10.5312/wjo.v10.i2.54 30788222 PMC6379739 16. Pengfei Z Yang G Guangming N Research progress on magnetic resonance imaging of brucella spondylitis Magnetic Resonance Imaging 2016 7 8 625 629 17. Liu X Hua L Jin C Differentiation between brucellar and tuberculous spondylodiscitis in the acute and subacute stages by MRI: a retrospective observational study Acad Radiol 2018 25 9 1183 1189 10.1016/j.acra.2018.01.028 29609954 18. Peng W Yujiao Z Fang Q Diagnostic value and efficacy evaluation of diffusion tensor imaging in intervertebral disc lesions in brucella spondylitis Chin Med Sci J 2018 40 4 519 527 10.3881/j.issn.1000-503X.10114 30193606 19. Bihan D Breton E Lallemand D MR imaging of intravoxel incoherent motions:application to diffusion and perfusion in neurologic disorders Radiology 1986 16 1 401 407 10.1148/radiology.161.2.3763909 3763909 20. Bihan D What can we see with IVIM MRI Neuroimage 2019 18 7 56 67 10.1016/j.neuroimage.2017.12.062 29277647 21. Wu X Gao Y Wu H The value of IVIM in the differential diagnosis of brucella spondylitis, spinal tuberculosis and spinal metastases J Clin Radiol 2018 37 828 832 22. Zhao PF Qiao PF Niu H Application of quantitative parameters of DCE-MRI combined with IVIM in the treatment evaluation of brucella spondylitis MJMRI 2023 14 12 72 77 23. Wu W Gong T Niu J Study of bone marrow microstructure in healthy young adults using intravoxel incoherent motion diffusion-weighted MRI Front Endocrinol 2022 13 958151 10.3389/fendo.2022.958151 PMC9691993 36440214 24. Magnani DM Lyons ET Forde TS Osteoarticular tissue infection and development of skeletal pathology in murine brucellosis Dis Model Mech 2013 6 3 811 818 10.1242/dmm.011056 23519029 PMC3634663 25. Ogon I Takebayashi T Takashima H Intravoxel Incoherent motion factors affecting collapse and nonunion of osteoporotic vertebral fracture Global Spine J 2023 14 21925682231167788 10.1177/21925682231167788 PMC11418743 37001146 26. Guo C Zheng K Ye Q Intravoxel incoherent motion imaging on sacroiliitis in patients with axial spondyloarthritis: correlation with perfusion characteristics based on dynamic contrast-enhanced magnetic resonance imaging Front Med 2022 8 798845 10.3389/fmed.2021.798845 PMC8826054 35155474 27. Hui W Yang G Xishi L The value of single-double index and stretch index models in the identification of brucella spondylitis and spinal tuberculosis MJ MRI 2019 10 11 835 839 28. Park S Yoon JK Chung NS Correlations between intravoxel incoherent motion diffusion-weighted MR imaging parameters and F-FDG PET/CT metabolic parameters in patients with vertebral bone metastases: initial experience Br J Radiol 2018 91 1086 20170889 10.1259/bjr.20170889 29509489 PMC6223291 29. Lang N Su MY Yu HJ Differentiation of tuberculosisand metastatic cancer in the spine using dynamiccontrast-enhanced MRI Eur Spine J 2015 24 8 1729 1737 10.1007/s00586-015-3851-z 25749725 PMC4765923 30. Wu H Ren JJ Niu GM Value of IVIM in differential diagnosis of prostate cancer, glandular and stromal hyperplasia J Inner Mongolia Med University 2017 39 2 107 111 31. Haohua W Value of IVIM and DCE-MRI in early diagnosis and clinical efficacy evaluation of brucella spondylitis Inner Mongolia Medical University 2024 32. Bennett KM Schmainda KM Bennett RT Characterization of continuously distributed cortical water diffusion rates with a stretched-exponential model Magn Reson Med 2003 50 4 727 734 10.1002/mrm.10581 14523958 33. Kwee TC Galbán CJ Tsien C Comparison of apparent diffusion coefficients and distributed diffusion coefficients in high-grade gliomas J Magn Reson Imaging 2010 31 3 531 537 10.1002/jmri.22070 20187193 PMC2918396 34. Bai Y Lin Y Tian J Grading of gliomas by using monoexponential, biexponential, and stretched exponential diffusion-weighted MR imaging and diffusion kurtosis MR imaging Radiology 2016 278 2 496 504 10.1148/radiol.2015142173 26230975 PMC4734159 35. Petralia G Summers PE Agostini A Dynamic contrast-enhanced MRI in oncology:how we do it Radiol Med 2020 125 12 1288 1300 10.1007/s11547-020-01220-z 32415476 36. Zhao PF Qiao PF Niu H Value of quantitative dynamic enhancement MRI in the diagnosis and early diagnosis of brucella spondylitis J Radiol 2017 51 437 440 37. Pengfei Z Yang G Pengfei Q Value of dynamic contrast-enhanced MRI quantitative analysis in the differential diagnosis of brucella spondylitis, spinal tuberculosis and spinal metastases Chin J Radiol 2017 51 197 201 38. Zhao PF Qiao PF Niu H The value of dynamic enhanced magnetic resonance quantitative analysis for the staging of brucella spondylitis MJMRI 8 12 908 911 39. Liangqiang M Jianguo Z Haige L Comparative study of quantitative parameters of IVIM-DWI combined with DCE-MRI and MRE activity grading to assess the activity of Crohn’s disease Chin J CT MRI 2023 21 3 155 158 40. Liqing K Suyin G Meng Z The value of IVIM-DWI combined with DCE-MRI in the diagnosis of pelvic lymph node metastasis in rectal cancer MJMRI Imaging 2019 10 8 583 588 41. Jiao HW Zhou ZX Li BW The mechanism of facultative intracellular parasitism of brucella Int J Mol Sci 2021 22 7 3673 10.3390/ijms22073673 33916050 PMC8036852 42. Qin J Li J Yang H Values of intravoxel incoherent motion diffusion weighted imaging and dynamic contrastenhanced MRI in evaluating the activity of sacroiliitis in ankylosing spondylitis of rat model Magn Reson Imaging 2020 68 7 30 35 10.1016/j.mri.2020.01.007 31978516 43. Zaninovich OA Avila MJ Kay M The role of diffusion tensor imaging in the diagnosis, prognosis, and assessment of recovery and treatment of spinal cord injury:a systematic review Neurosurg Focus 2019 46 3 e7 10.3171/2019.1.FOCUS18591 30835681 44. Wu P Zhang Y Guo H Study on the diagnosis and prognosis assessment of 3.0T diffusion-weighted imaging and diffusion tensor imaging for the diagnosis and prognosis of Brucella spondylitis J Clin Radiol 2018 37 10 1698 1703 45. Zhang Y Wu P Zhu Y Diagnostic value of DTI in brucella spondylitis and correlation between its related parameters and serum agglutination test titer Radiol Practice 2018 33 9 944 949 46. Liu X Pu R Liang J Value of 3.0 T MRI T2 mapping texture features in the classification of cartilage injury in knee osteoarthritis Magnetic Resonance Imaging 2021 12 7 34 38 47. Kim HK Laor T Horn PS T2 mapping in duchenne muscular dystrophy: distribution of disease activity and correlation with clinical assessments Radiology 2010 255 3 899 908 10.1148/radiol.10091547 20501727 48. Kim HK Serai S Lindquist D Quantitative skeletal muscle MRI: part 2, MR spectroscopy and T2 relaxation time mapping-comparison between boys with duchenne muscular dystrophy and healthy boys AJR 2015 10.2214/AJR.14.13755 26204310 49. Matsuki K Watanabe A Ochiai S Quantitative evaluation of fatty degeneration of the supraspinatus and infraspinatus muscles using T2 mapping J Shoulder Elbow Surg 2014 23 5 636 641 10.1016/j.jse.2014.01.019 24745313 50. Guo H Lan S He Y Differentiating brucellaspondylitis from tuberculous spondylitis by the conventional MRI and MR T2 mapping:a prospective study Eur J Med Res 2021 26 1 125 10.1186/s40001-021-00598-4 34711265 PMC8555138 51. Lagerstrand K Hebelka H Brisby H Low back pain patients and controls display functional differences in endplates and vertebrae measured with T2-mapping Eur Spine J 2019 28 2 234 240 10.1007/s00586-018-5824-5 30448986 52. Chunyu M Hongyan Y Chen Xiaofei, et al.MR internal voxel incoherent motion diffusion-weighted imaging and T2 mapping to evaluate lumbar intervertebral disc degeneration J Med Imag Technol 2022 38 07 1056 1061 53. Liu Z Wang S Dong D The applications of radiomics in precision diagnosis and treatment of oncology: opportunities and challenge Theranostics 2019 9 5 1303 1322 10.7150/thno.30309 30867832 PMC6401507 54. Henderson S Purdie C Michie C Interim heterogeneity changes measured using entropy texture features on T2-weighted MRI at 3.0T are associated with pathological response to neoadjuvant chemotherapy in primary breast cancer Eur Radiol 2017 27 11 4602 4611 10.1007/s00330-017-4850-8 28523352 PMC5635097 55. Zhou L Siwei Z Zekai W Preoperative prediction of peripheral nerve invasion in gastric cancer based on intratumoral and peritumoral radiomics features combined with clinical features and spectral CT quantitative parameters J Clin Radiol 2025 44 03 472 478 56. Qiang J Junping G Wang H The value of CT radiomics in the differential diagnosis of peripheral small cell lung cancer and non-small cell lung cancer J CT MRI 2025 23 01 47 49 57. Xiaohua L Lishun X Huashuo Z Study on prediction model of acute ischemic stroke recurrence based on machine learning MRI radiomics J Clin Radiol 2024 43 07 1066 1072 58. Jiajia L Lingling L Jiawei Z CT and MRI findings of brucella spondylitis J Radiol Pract 2020 35 02 223 227 59. Zhichang F A Preliminary Study on MRI-Based Radiomics Evaluation of Tuberculosis and Brucella Spondylitis Shanxi Medical University 2022 60. Tuxunjan P Application of MRI-Based Radiomics in Differential Diagnosis of Tuberculous Spondylitis and Brucellosis Xinjiang Medical University 2023 61. Xiong H Differential diagnosis of brucellillosis spondylitis and tuberculous spondylitis in patients with brucellillus spondylitis based on machine learning CT radiomics Xinjiang Med University 2024 62. Yanni Z A preliminary study on the identification of brucella spondylitis and spinal tuberculosis based on CT radiomics Inner Mongolia Medical University 2024 63. Ji C Jiang T Liu L Zhang J You L Continuous glucose monitoring combined with artificial intelligence: redefining the pathway for prediabetes management Front Endocrinol 2025 16 10.3389/fendo.2025.1571362 PMC12146165 40491592 64. Lambert RG Baraliakos X Bernard SA Development of international consensus on a standardised image acquisition protocol for diagnostic evaluation of the sacroiliac joints by MRI: an ASAS–SPARTAN collaboration Ann Rheum Dis 2024 83 12 1628 1635 10.1136/ard-2024-225882 39107080 PMC11671998 ",
  "metadata": {
    "Title of this paper": "Development of international consensus on a standardised image acquisition protocol for diagnostic evaluation of the sacroiliac joints by MRI: an ASAS–SPARTAN collaboration",
    "Journal it was published in:": "Journal of Multidisciplinary Healthcare",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12477277/"
  }
}