{
  "title": "Paper_949",
  "abstract": "pmc Lab Anim (NY) Lab Anim (NY) 981 npgopen Lab Animal 0093-7355 1548-4475 pmc-is-collection-domain yes pmc-collection-title Nature Portfolio PMC12484078 PMC12484078.1 12484078 12484078 40968194 10.1038/s41684-025-01614-4 1614 1 Article Impact of prolonged isoflurane or ketamine–xylazine anesthesia with or without buprenorphine and oxygen on mouse vitals and immune responses http://orcid.org/0000-0002-9326-8828 Virgilio Tommaso 1 Latino Irene 1 Pizzichetti Chiara 1 2 Chahine Kamil 1 2 Capucetti Arianna 1 Detotto Carlotta 3 Bergadano Alessandra alessandra.bergadano@unibe.ch 3 http://orcid.org/0000-0003-4166-7664 F.Gonzalez Santiago santiago.gonzalez@irb.usi.ch 1 1 https://ror.org/03c4atk17 grid.29078.34 0000 0001 2203 2861 Institute for Research in Biomedicine, Università della Svizzera italiana, 2 https://ror.org/02k7v4d05 grid.5734.5 0000 0001 0726 5157 Graduate School for Cellular and Biomedical Sciences, University of Bern, 3 https://ror.org/02k7v4d05 grid.5734.5 0000 0001 0726 5157 Experimental Animal Center, University of Bern, 18 9 2025 2025 54 10 498040 270 277 3 4 2024 14 8 2025 18 09 2025 02 10 2025 03 10 2025 © The Author(s) 2025 2025 https://creativecommons.org/licenses/by/4.0/ Open Access http://creativecommons.org/licenses/by/4.0/ Anesthesia is indispensable for minimizing stress during invasive procedures. However, anesthesia can induce undesired effects on the organism and its physiological homeostasis. In experiments involving animals, these consequences may reduce animal welfare and alter experimental outcomes. Moreover, most of the studies characterizing the effects of murine anesthetic protocols on animal welfare do not explore the impact of prolonged anesthesia for procedures lasting more than 2 h. Here we investigated the effect of prolonged anesthesia on vital parameters and immune responses to vaccination, comparing isoflurane (Iso), ketamine–xylazine (KX), and KX with oxygen supplementation (KXO 2 2 2 The study reveals that long-term anesthesia with ketamine–xylazine can induce hypoxia and mortality in mice, whereas oxygen supplementation mitigates these effects. As an alternative, isoflurane showed superior safety and fewer effects on the immune system. Subject terms Immunology Imaging the immune system https://doi.org/10.13039/501100001711 Breast Cancer Now (BCN) SNSF 176124 F.Gonzalez Santiago pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement yes pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes issue-copyright-statement © Springer Nature America, Inc. 2025 Main Anesthesia, implemented with analgesia, is essential for inducing unconsciousness and antinociception during invasive procedures in humans and animals to minimize stress. In addition, anesthesia is critical for enhancing procedural efficacy and promoting optimal outcomes in clinical and research settings. However, despite its pivotal role, anesthesia might induce undesired effects on physiological systems. Inhaled anesthetics are commonly used and considered safe for humans 1 2 2 2 3 4 3 Moreover, mouse anesthetics have been observed to alter the immune system, with a potential impact not only on animal welfare but also on experimental readouts. For example, ketamine has been associated with an anti-inflammatory response, blocking the release of cytokines 5 6 7 8 9 10 11 12 13 14 Despite the relevance of cellular dynamics in the lymphoid organs, the effect of Iso and KX on the motility of immune cells has not been extensively explored. This is of relevance because the dynamic behavior (that is, motility patterns and their biological meaning) of immune cells is a key element for understanding the mechanisms of action of immunity 15 16 17 18 19 In this study, we compared the effect of commonly used murine anesthetic protocols, namely Iso and KX, on mouse vital parameters and immunity. We studied the murine immune functionality by measuring the numbers of all the major immune cell types, their release of inflammatory proteins and their dynamic behavior in the lymph node upon stimulation with an influenza vaccine. In addition, we investigated how oxygenation (quantified by pulse oxymetry) and opioid analgesia (buprenorphine, BPP) modulate the effects of KX and Iso. Results Efficacy and safety of anesthetic protocols We evaluated the efficacy and safety of three commonly used anesthetic protocols in mice, namely Iso, KX and KX combined with additional oxygen (KXO 2 1a 2 1a 1b 4 1b 1c P 2 P 2 P 1d 2 2 2 20 1d P P 2 P 1e Fig. 1 Effect of the anesthetic protocols on mouse vital parameters. a b c b c d e f b c f d e n d P P P We hypothesized that cardiac depression induced death in the KX group. We verified this hypothesis by observing that the respiratory rate (RR) (Supplementary Fig. 1c 1d 2 1d P 2 1f P Effect of BPP on Iso, KX and KXO 2 Considering that the cardiovascular arrest in the KX group occurred in the last minutes of the procedure, following the injection of BPP, which might induce cardiovascular depression, we hypothesized a correlation between BPP administration and KX mortality. To support this hypothesis, we observed that only 30% of the KX-related mortality occurred before BPP injection (Fig. 2a 2 2b Fig. 2 Impact of BPP on Iso, KX and KXO 2 a b a b c d e f a b f n d e To study in more detail the effects of BPP on the protocols under investigation, we measured vital parameters in animals anesthetized with Iso, KX or KXO 2 2c 2 2d 2e P 2 2 P 2f 2a P 2b 2c Effect of the anesthetic protocols on the immune cell dynamics on the lymph node To study the effect of anesthesia on the immune cell dynamics in the lymph node, we evaluated the immune responses following a model of vaccination with an ultraviolet (UV)-inactivated influenza A/Puerto Rico/8/34 virus (UV-PR8). We quantified by flow cytometry the total number of live cells in the pLN of mice that where anesthetized 2 h after vaccination. In this experiment, mice were not subjected to surgery, and BPP was not implemented in any protocol to avoid unnecessary biases (Fig. 3a 3b P 2 3a P Fig. 3 Anesthesia alters the number of immune cells in the lymph node of vaccinated mice. a 2c b e b c d e To characterize the effect of the anesthetic protocols on the individual immune cell types, we quantified the number of immune cells divided by population using flow cytometry. First, we observed that T cells, the most abundant cell type in the pLN, were significantly reduced in the KX ( P 2 P 3c 3b 3c P 2 P 3d P 2 3e P 3d + 3e − 3f Influence of the anesthetic protocol on the local inflammation Considering the involvement of inflammatory cytokines and chemokines in the recruitment of leukocytes, we hypothesized that the previously observed differences in the numbers of immune cells might be associated with an altered profile of secretion of these molecules. To investigate this hypothesis, we measured the concentrations of 13 chemokines in the pLN supernatant of vaccinated and anesthetized mice in comparison with not anesthetized controls, following the same experimental design described for flow cytometry in Fig. 3a 4a 4b 4c 4d 4a 4b 4c 4d 4e 4f 4g 4h 4i 2 P P 4e 2 P P 4f 4j 4k 4l 4m 4n 4o 4p 4q 4r 4s Fig. 4 Influence of anesthetic protocols on the release of inflammatory cytokines. a f a b c d e f Dynamic behavior of neutrophils, T cells and B cells during anesthesia To study if the anesthetic protocols under investigation also altered the motility of the major immune cells, we analyzed by two-photon intravital microscopy (2P-IVM) the dynamic behavior (that is, the motility patterns in time) of fluorescently labeled T cells, B cells and neutrophils in the pLN of vaccinated and anesthetized mice (Fig. 5a 1 2 3 P 2 5b P 2 P 5c P 5d 5e 5f 2 P P 2 P 5f P 2 Fig. 5 Dynamic behavior of neutrophils, T cells and B cells after anesthesia. a b d b c d e g e f g P Considering that preemptive BPP was necessary for 2P-IVM in the Iso group due to surgery, we wondered if analgesia affected the results of Iso. However, it is not possible to perform surgery without analgesia. Therefore, we could not quantify the motility of cells without BPP in this group. Nevertheless, to examine if BPP determines any generic effect on immunity in the Iso group, we investigated the immune cell numbers by flow cytometry in Iso + BPP in comparison with controls (Iso without BPP) and the hypothetical alternative analgesic drug lidocaine (Lido) (Iso + Lido) (Supplementary Fig. 5a 5b 5c 5d 5e 5f + 5g P P P P P + P − 5h 5i P 5j P Discussion In this study, we investigated the effects of prolonged (2.5 h) KX and Iso anesthesia on mouse vital parameters and immune response. Our first results highlighted a concerning 100% mortality rate in animals repeatedly dosed with KX for long-term maintenance, primarily attributed to hypoxia associated with severe bradycardia, leading to a decrease in tissue oxygen delivery (DO 2 21 22 23 4 24 Furthermore, our results suggest that BPP contributes to this morbidity. In fact, BPP analgesia in the KX group probably amplified cardiovascular depression. Moreover, the reduction of the mortality rate from 16% to 0% in KXO 2 2 25 26 27 4 4 28 2 Beyond the consequences of the anesthetic protocols on the animal’s vital parameters and survival, we observed notable effects also on the immune response. Interestingly, the reduction in immune cell numbers was accompanied, but not completely explained, by an increase in dead cell numbers. This increase suggests that other mechanisms might cooperate with hypoxia and cell death in reducing immune cell numbers. One of them might be a reduction in cell proliferation. To support this speculation, Cai and colleagues previously demonstrated that Iso could suppress the proliferation of colorectal cancer cells 29 22 22 30 33 Despite stable chemokine levels, significant increases in the inflammatory proteins, interleukin-6 (IL-6) and IFNγ, were noted under KX anesthesia compared to unanesthetized controls and the Iso group. In the case of IFNγ, this modification was prevented by oxygen administration, consistently with previous results highlighting hypoxia as a main inducer of IFNγ release by T cells 34 35 36 2 37 38 39 40 41 Cellular motility and dynamic behavior also differed significantly between anesthetic groups. We speculate that these results are the consequence of a combination of the elevated concentrations of inflammatory proteins and the hypoxic or toxic effects of the drugs. In fact, neutrophils showed a different straightness in the KX group in comparison with KXO 2 42 2 43 44 2 2 2 45 46 47 In conclusion, our findings suggest that KX induces significant alterations in mouse vital parameters and artifacts in the immune responses to vaccination, which can, in some instances, be prevented by oxygen administration. Thus, oxygen administration is a critical refinement, which should always be considered in injectable KX. However, Iso generally presented a safer profile, demonstrated by the fast induction and recovery times and the absence of mortality. Moreover, Iso also showed the lowest number of artifacts in immune cell activation and motility. These observations have clear implications for animal welfare and the refinement of immune studies, particularly for those involving intravital microscopy examinations, which require long-term anesthesia. This study type is essential in different fields, as cellular motility is a powerful indication of cellular activation 46 Methods Mice Charles River Laboratories provided 6–8-week-old C57BL/6J mice, used in all the experiments. To evaluate immune cell motility, we used 6–12-week-old C57BL/6-Tg(UBC-GFP)30Scha/J (UBC-GFP) and Tg(CAG- ECFP)CK6Nagy/J (CK6-ECFP) mice, originally acquired from Jackson Laboratory (stock numbers 004353 and 003773, respectively) and bred in-house. The Institute for Research in Biomedicine (IRB) hosted animal experiments in facilities defined as specific pathogen-free, according to the FELASA guidelines. Mice were housed in individually ventilated cages under a controlled 12-h light/dark cycle, room temperature of 20–24 °C and relative humidity of 30–70%. Water and food were provided ad libitum. Animal caretakers, researchers and veterinarians checked the health of the animals daily. Euthanasia was always performed by cervical dislocation under deep anesthesia (Iso 5% for 5 min), followed by immediate organ collection. Equal numbers of males and females were assigned to experimental groups through a statistical randomization process. This was ensured through a blinded process, assigning each animal an ID and randomly sorting the IDs into experimental groups using dedicated software (R: A Language and Environment for Statistical Computing, R Core Team, R Foundation for Statistical Computing) or by an external blinded operator. Power calculation per groups size determination, performed using R software, was estimated to obtain >80% statistical power, starting from preliminary data previously collected in our laboratory in an independent experiment using similar techniques and setting the effect size (eta squared) at 15%. Each experiment was designed to extract more than a single outcome and minimize the number of repetitions of experiments. Therefore, for each group of outcomes, we set the group size according to the outcome requiring the highest number of replicates. Following this approach, the group sizes were n 1 4 1c,d 4 5 n 2 5 1a,b 2 n n 3 3 3 4 n 1b 1b,c 2 2 1f 2 n 1e Anesthetic protocols The anesthetic protocols under investigation are shown in Fig. 1a 1 1 2 1 5 5 2 2 2 Anesthesia monitoring For the evaluation of the mouse vital parameters, we induced anesthesia, and when mice reached surgical tolerance, they underwent surgery using the model of the exposure of the pLN for 2P-IVM, detailed below. At the end of the surgery, instead of performing microscopy, anesthesia was maintained to record vital parameters every 5 min for 2 h using a rodent monitor (Rodent Surgical Monitor+, Indus Instruments). For the duration of the experiments, we measured the following parameters: (1) induction time, defined as the time interval between drug administration (intraperitoneal injection of KX or exposure to 5% Iso) and the loss of righting reflex; (2) nonsurgical tolerance, defined as the time interval between the loss of righting reflex and the loss of fore and hind limb pedal reflex; (3) recovery time, as the interval between the regain of pedal reflex and the first forward movement; (4) mortality, as the percentage of mice that died during anesthesia or did not regain pedal reflex within 120 min after anesthesia discontinuation in relation to the total number of mice under study; (5) peripheral capillary SpO 2 Flow cytometry of immune cells and inflammatory proteins To evaluate the effect of different anesthetics on the inflammatory response, mice received influenza vaccination by injection of UV-inactivated influenza A/PR/8/34 (UV-PR8) virus strain. Virus production and UV inactivation were performed as described before 38 7 For flow cytometry of the immune cells, we processed the pLN as previously described 48 To evaluate the concentration of cytokines and chemokines, we applied two LEGENDPlex assays (Mouse Proinflammatory Chemokine Panel and Mouse Inflammation Panel, BioLegend) according to the instructions of the manufacturer. In brief, we carefully disrupted the pLN in cold PBS, minimizing cell rupture. After centrifugation at 1,500 rpm for 5 min we collected the supernatant and used it for the assay. For the acquisition of the number of immune cell and the inflammatory protein concentrations, we used an LSRFortessa (BD Bisociences). Data were then analyzed using the FlowJo software (BD Biosciences) or the LEGENDPlex software (BioLegend). Surgical preparation for intravital microscopy For 2P-IVM of the immune cells, we adoptively transferred fluorescently labeled B cells, T cells and neutrophils from donor mice. B and T cells were isolated from the spleens of donor C57BL/6J and UBC-GFP mice, respectively. After mechanical tweezer and scissor disaggregation in a solution of 2 mM EDTA (Sigma-Aldrich) and 2% heat-inactivated filter-sterilized fetal bovine serum (Thermo Fisher Scientific) in PBS, we filtered the samples in a 40 µm nylon cell strainer (Cornig) and removed red blood cells using the ACK Lysing Buffer (Thermo Fisher Scientific). Then, we applied the CD19 MicroBeads for Mouse (Miltenyi) and the Pan T Cells Isolation Kit II for Mouse (Miltenyi) to isolate B and T cells, respectively. B cells were then labeled using the CellTracker Orange CMTMR dye (Thermo Fisher Scientific), following the manufacturer’s protocol. A mixture of 10 million B cells and 7 million T cells per mouse were injected intravenously (i.v.) in the tail vein of recipient C57BL/6J mice 12–18 h before imaging. Neutrophils were then isolated from the bone marrow of CK6-ECFP mice by collection and flushing of the femurs and tibias with cold, sterile PBS. Then, neutrophils were purified using the Neutrophils Isolation Kit for Mouse (Miltenyi) and injected (5 million) i.v. in the tail vein of recipient mice 2 h before imaging. At the same time, we injected s.c. in the footpad the influenza vaccine and the αCD169 – Alexa Fluor 647 (3D6.112) antibody to stain macrophages. For intravenous and subcutaneous injections, animals were briefly (<1 min) anesthetized with Iso 5%. After 2 h, we performed 2P-IVM by surgical exposure of the pLN as previously described 49 2P-IVM data generation and analysis For deep in vivo tissue imaging, we used a customized two-photon platform (TrimScope, LaVision BioTec), with a set of two tunable Ti:Sa lasers (Chamaleon Ultra I,Chamaleon Ultra II, Coherent) and an optical parametric oscillator (OPO) that emits in the range of 1,010–1,340 nm (Chamaleon CompactOPO, Coherent), with output wavelengths in the range of 690–1,080 nm. Two-photon micrographs were acquired with 800 Hz scanning frequency, 520 × 520 pixels, a field of view of 278 × 278 µm 2 Z Statistical analyses All raw data were analyzed, processed and presented using GraphPad Prism 10.2.0 (GraphPad Software). First, we applied the Shapiro–Wilk normality test to analyze the distribution of data. Then, we compared means among groups using one-way analysis of variance or unpaired t 1c,d 1c,d 3c 4c,d,g,i,k,r 5b–d,f,h–j 1b,f 2d,e 2a–c 3a–f 4a–f,h,j,l–q,s 5b–g P P P P P Reporting summary Further information on research design is available in the Nature Portfolio Reporting Summary Online content Any methods, additional references, Nature Portfolio reporting summaries, source data, extended data, supplementary information, acknowledgements, peer review information; details of author contributions and competing interests; and statements of data and code availability are available at 10.1038/s41684-025-01614-4. Supplementary information  Supplementary Information Supplementary Figs. 1–5. Reporting Summary Supplementary Movie 1 Neutrophils. Supplementary Movie 2 T cells. Supplementary Movie 3 B cells. Publisher’s note Supplementary information The online version contains supplementary material available at 10.1038/s41684-025-01614-4. Acknowledgements We thank D. Morone, D. Jarossay and the Comparative Biology Facility at IRB for supporting microscopy, flow cytometry and animal experiments, respectively. We also thank M. Thelen, D. Legler and G. Samson for the supporting scientific discussions. Finally, we thank the Swiss National Science Foundation for funding the present research under the project code SNSF 176124. Author contributions T.V., I.L., C.P., K.C., A.C., C.D. and A.B. performed all the experiments. T.V. conceptualized the project, designed the experiments, analyzed data and prepared the manuscript. A.B. and S.F.G. supervised the project and corrected the manuscript. S.F.G. provided funding, spaces and materials, with the exception of the instruments for monitoring vital parameters, supplied by A.B. Peer review Peer review information Lab Animal Funding Open access funding provided by Università della Svizzera italiana. Data availability The data that support the findings of this study are available from the corresponding author upon request. Intravital microscopy datasets are available via Immunemap at https://www.immunemap.org/ Competing interests The authors declare no competing interests. References 1. Stachnik J Bonk ME Inhaled anesthetic agents Am. J. Health Syst. Pharm. 2006 63 623 634 16554286 10.2146/ajhp050460 Stachnik, J. & Bonk, M. E. Inhaled anesthetic agents. Am. J. Health Syst. Pharm. 63 16554286 10.2146/ajhp050460 2. Navarro KL Mouse anesthesia: the art and science ILAR J. 2021 62 238 273 34180990 10.1093/ilar/ilab016 PMC9236661 Navarro, K. L. et al. Mouse anesthesia: the art and science. ILAR J. 62 34180990 10.1093/ilar/ilab016 PMC9236661 3. Blevins CE Celeste NA Marx JO Effects of oxygen supplementation on injectable and inhalant anesthesia in C57BL/6 mice J. Am. Assoc. Lab. Anim. Sci. 2021 60 289 33972009 10.30802/AALAS-JAALAS-20-000143 PMC8145119 Blevins, C. E., Celeste, N. A. & Marx, J. O. Effects of oxygen supplementation on injectable and inhalant anesthesia in C57BL/6 mice. J. Am. Assoc. Lab. Anim. Sci. 60 33972009 10.30802/AALAS-JAALAS-20-000143 PMC8145119 4. Jaber SM Dose regimens, variability, and complications associated with using repeat-bolus dosing to extend a surgical plane of anesthesia in laboratory mice J. Am. Assoc. Lab. Anim. Sci. 2014 53 684 691 25650976 PMC4253583 Jaber, S. M. et al. Dose regimens, variability, and complications associated with using repeat-bolus dosing to extend a surgical plane of anesthesia in laboratory mice. J. Am. Assoc. Lab. Anim. Sci. 53 25650976 PMC4253583 5. Sun J Wang XD Liu H Xu JG Ketamine suppresses endotoxin-induced NF-κB activation and cytokines production in the intestine Acta Anaesthesiol. Scand. 2004 48 317 321 14982564 10.1111/j.0001-5172.2004.0312.x Sun, J., Wang, X. D., Liu, H. & Xu, J. G. Ketamine suppresses endotoxin-induced NF-κB activation and cytokines production in the intestine. Acta Anaesthesiol. Scand. 48 14982564 10.1111/j.0001-5172.2004.0312.x 6. Mazar J Involvement of adenosine in the antiinflammatory action of ketamine Anesthesiology 2005 102 1174 1181 15915030 10.1097/00000542-200506000-00017 Mazar, J. et al. Involvement of adenosine in the antiinflammatory action of ketamine. Anesthesiology 102 15915030 10.1097/00000542-200506000-00017 7. Lee JE Inhibition of autoimmune Th17 cell responses by pain killer ketamine Oncotarget 2017 8 89475 89485 29163764 10.18632/oncotarget.18324 PMC5685685 Lee, J. E. et al. Inhibition of autoimmune Th17 cell responses by pain killer ketamine. Oncotarget 8 29163764 10.18632/oncotarget.18324 PMC5685685 8. Markovic SN Murasko DM Anesthesia inhibits poly I:C induced stimulation of natural killer cell cytotoxicity in mice Clin. Immunol. Immunopathol. 1990 56 202 209 2116248 10.1016/0090-1229(90)90141-c Markovic, S. N. & Murasko, D. M. Anesthesia inhibits poly I:C induced stimulation of natural killer cell cytotoxicity in mice. Clin. Immunol. Immunopathol. 56 2116248 10.1016/0090-1229(90)90141-c 9. Meng C Ketamine promotes inflammation through increasing TLR4 expression in RAW264.7 cells J. Huazhong Univ. Sci. Technol. Med. Sci. 2015 35 419 425 10.1007/s11596-015-1447-9 26072083 Meng, C. et al. Ketamine promotes inflammation through increasing TLR4 expression in RAW264.7 cells. J. Huazhong Univ. Sci. Technol. Med. Sci. 35 10.1007/s11596-015-1447-9 26072083 10. Takahashi T The effect of ketamine anesthesia on the immune function of mice with postoperative septicemia Anesth. Analg. 2010 111 1051 1058 20705789 10.1213/ANE.0b013e3181ed12fc Takahashi, T. et al. The effect of ketamine anesthesia on the immune function of mice with postoperative septicemia. Anesth. Analg. 111 20705789 10.1213/ANE.0b013e3181ed12fc 11. Altay O Effects of isoflurane on brain inflammation after subarachnoid hemorrhage in mice Neurobiol. Dis. 2014 62 365 371 24084689 10.1016/j.nbd.2013.09.016 PMC3919516 Altay, O. et al. Effects of isoflurane on brain inflammation after subarachnoid hemorrhage in mice. Neurobiol. Dis. 62 24084689 10.1016/j.nbd.2013.09.016 PMC3919516 12. Friese MB Nathan M Culley DJ Crosby G Isoflurane anesthesia impairs the expression of immune neuromodulators in the hippocampus of aged mice PLoS ONE 2018 13 e0209283 30571762 10.1371/journal.pone.0209283 PMC6301699 Friese, M. B., Nathan, M., Culley, D. J. & Crosby, G. Isoflurane anesthesia impairs the expression of immune neuromodulators in the hippocampus of aged mice. PLoS ONE 13 30571762 10.1371/journal.pone.0209283 PMC6301699 13. Koutsogiannaki S Bernier R Tazawa K Yuki K Volatile anesthetic attenuates phagocyte function and worsens bacterial loads in wounds J. Surg. Res. 2019 233 323 330 30502266 10.1016/j.jss.2018.07.075 PMC6949532 Koutsogiannaki, S., Bernier, R., Tazawa, K. & Yuki, K. Volatile anesthetic attenuates phagocyte function and worsens bacterial loads in wounds. J. Surg. Res. 233 30502266 10.1016/j.jss.2018.07.075 PMC6949532 14. Kádár B Effects of isoflurane on Nfκb p65, Gadd45a and Jnk1 expression in the vital organs of CBA/CA mice In Vivo 2011 25 241 244 21471541 Kádár, B. et al. Effects of isoflurane on Nfκb p65, Gadd45a and Jnk1 expression in the vital organs of CBA/CA mice. In Vivo 25 21471541 15. Stein, J. V. & Gonzalez, S. F. Dynamic intravital imaging of cell–cell interactions in the lymph node. J. Allergy Clin. Immunol. 10.1016/j.jaci.2016.11.008 28065277 16. Sun Y Li QF Yan J Hu R Jiang H Isoflurane preconditioning promotes the survival and migration of bone marrow stromal cells Cell. Physiol. Biochem. 2015 36 1331 1345 26159215 10.1159/000430300 Sun, Y., Li, Q. F., Yan, J., Hu, R. & Jiang, H. Isoflurane preconditioning promotes the survival and migration of bone marrow stromal cells. Cell. Physiol. Biochem. 36 26159215 10.1159/000430300 17. Sun W In vivo two-photon imaging of anesthesia-specific alterations in microglial surveillance and photodamage-directed motility in mouse cortex Front. Neurosci. 2019 13 421 31133777 10.3389/fnins.2019.00421 PMC6513965 Sun, W. et al. In vivo two-photon imaging of anesthesia-specific alterations in microglial surveillance and photodamage-directed motility in mouse cortex. Front. Neurosci. 13 31133777 10.3389/fnins.2019.00421 PMC6513965 18. Yahara, D., Yoshida, T., Enokida, Y. & Takahashi, E. Directional migration of MDA-MB-231 cells under oxygen concentration gradients. Adv. Exp. Med. Biol 10.1007/978-3-319-38810-6_17 27526134 19. Russel, W. M. S. & Burch, R. The Principles of Humane Experimental Technique by W.M.S. Russell and R.L. Burch https://caat.jhsph.edu/principles/the-principles-of-humane-experimental-technique 20. Loeven AM Receno CN Cunningham CM DeRuisseau LR Arterial blood sampling in male CD-1 and C57BL/6J mice with 1% isoflurane is similar to awake mice J. Appl. Physiol. 2018 125 1749 1759 30284518 10.1152/japplphysiol.00640.2018 PMC6737457 Loeven, A. M., Receno, C. N., Cunningham, C. M. & DeRuisseau, L. R. Arterial blood sampling in male CD-1 and C57BL/6J mice with 1% isoflurane is similar to awake mice. J. Appl. Physiol. 125 30284518 10.1152/japplphysiol.00640.2018 PMC6737457 21. Arras M Autenried P Rettich A Spaeni D Rülicke T Optimization of intraperitoneal injection anesthesia in mice: drugs, dosages, adverse effects, and anesthesia depth Comp. Med. 2001 51 443 456 11924805 Arras, M., Autenried, P., Rettich, A., Spaeni, D. & Rülicke, T. Optimization of intraperitoneal injection anesthesia in mice: drugs, dosages, adverse effects, and anesthesia depth. Comp. Med. 51 11924805 22. Bachmann SB Proulx ST He Y Ries M Detmar M Differential effects of anaesthesia on the contractility of lymphatic vessels in vivo J. Physiol. 2019 597 2841 2852 30829392 10.1113/JP277254 Bachmann, S. B., Proulx, S. T., He, Y., Ries, M. & Detmar, M. Differential effects of anaesthesia on the contractility of lymphatic vessels in vivo. J. Physiol. 597 30829392 10.1113/JP277254 23. Schuetze S Manig A Ribes S Nau R Aged mice show an increased mortality after anesthesia with a standard dose of ketamine/xylazine Lab. Anim. Res. 2019 35 1 7 32257896 10.1186/s42826-019-0008-y PMC7081538 Schuetze, S., Manig, A., Ribes, S. & Nau, R. Aged mice show an increased mortality after anesthesia with a standard dose of ketamine/xylazine. Lab. Anim. Res. 35 32257896 10.1186/s42826-019-0008-y PMC7081538 24. Hohlbaum K Impact of repeated anesthesia with ketamine and xylazine on the well-being of C57BL/6JRj mice PLoS ONE 2018 13 1 24 10.1371/journal.pone.0203559 PMC6145541 30231081 Hohlbaum, K. et al. Impact of repeated anesthesia with ketamine and xylazine on the well-being of C57BL/6JRj mice. PLoS ONE 13 10.1371/journal.pone.0203559 PMC6145541 30231081 25. Choi S Irwin MR Kiyatkin EA Xylazine effects on opioid-induced brain hypoxia Psychopharmacology 2023 240 1561 1571 37340247 10.1007/s00213-023-06390-y PMC10775769 Choi, S., Irwin, M. R. & Kiyatkin, E. A. Xylazine effects on opioid-induced brain hypoxia. Psychopharmacology 240 37340247 10.1007/s00213-023-06390-y PMC10775769 26. Mechelinck M Oxygen inhalation improves postoperative survival in ketamine-xylazine anaesthetised rats: an observational study PLoS ONE 2019 14 e0226430 31834913 10.1371/journal.pone.0226430 PMC6910690 Mechelinck, M. et al. Oxygen inhalation improves postoperative survival in ketamine-xylazine anaesthetised rats: an observational study. PLoS ONE 14 31834913 10.1371/journal.pone.0226430 PMC6910690 27. Flecknell, P. Laboratory Animal Anaesthesia: Fourth Edition http://www.sciencedirect.com:5070/book/9780128000366/laboratory-animal-anaesthesia 28. Fox, J. G., Anderson, L. C., Otto, G. M., Pritchett-Corning, K. R. & Whary, M. T. (eds) Laboratory Animal Medicine 29. Cai Z Suo L Huang Z Isoflurane suppresses proliferation, migration, and invasion and facilitates apoptosis in colorectal cancer cells through targeting miR-216 Front. Med. 2021 8 658926 10.3389/fmed.2021.658926 PMC8385302 34458282 Cai, Z., Suo, L. & Huang, Z. Isoflurane suppresses proliferation, migration, and invasion and facilitates apoptosis in colorectal cancer cells through targeting miR-216. Front. Med. 8 10.3389/fmed.2021.658926 PMC8385302 34458282 30. Sinclair MD A review of the physiological effects of α2-agonists related to the clinical use of medetomidine in small animal practice Can. Vet. J. 2003 44 885 897 14664351 PMC385445 Sinclair, M. D. A review of the physiological effects of α2-agonists related to the clinical use of medetomidine in small animal practice. Can. Vet. J. 44 14664351 PMC385445 31. Lemke KA Perioperative use of selective alpha-2 agonists and antagonists in small animals Can. Vet. J. 2004 45 475 480 15283516 PMC548630 Lemke, K. A. Perioperative use of selective alpha-2 agonists and antagonists in small animals. Can. Vet. J. 45 15283516 PMC548630 32. Schwartz DD Affinity of detomidine, medetomidine and xylazine for alpha-2 adrenergic receptor subtypes J. Vet. Pharmacol. Ther. 1998 21 107 111 9597647 10.1046/j.1365-2885.1998.00113.x Schwartz, D. D. Affinity of detomidine, medetomidine and xylazine for alpha-2 adrenergic receptor subtypes. J. Vet. Pharmacol. Ther. 21 9597647 10.1046/j.1365-2885.1998.00113.x 33. Virtanen R Nyman L Evaluation of the α1- and α2-adrenoceptor effects of detomidine, a novel veterinary sedative analgesic Eur. J. Pharmacol. 1985 108 163 169 2984021 10.1016/0014-2999(85)90721-6 Virtanen, R. & Nyman, L. Evaluation of the α1- and α2-adrenoceptor effects of detomidine, a novel veterinary sedative analgesic. Eur. J. Pharmacol. 108 2984021 10.1016/0014-2999(85)90721-6 34. Roman J T-cell activation under hypoxic conditions enhances IFN-γ secretion Am. J. Respir. Cell Mol. Biol. 2010 42 123 128 19372249 10.1165/rcmb.2008-0139OC PMC2809218 Roman, J. et al. T-cell activation under hypoxic conditions enhances IFN-γ secretion. Am. J. Respir. Cell Mol. Biol. 42 19372249 10.1165/rcmb.2008-0139OC PMC2809218 35. Tendler DS Intersection of interferon and hypoxia signal transduction pathways in nitric oxide-induced tumor apoptosis Cancer Res. 2001 61 3682 3688 11325839 Tendler, D. S. et al. Intersection of interferon and hypoxia signal transduction pathways in nitric oxide-induced tumor apoptosis. Cancer Res. 61 11325839 36. Inada T Kubo K Shingu K Promotion of interferon-gamma production by natural killer cells via suppression of murine peritoneal macrophage prostaglandin E2 production using intravenous anesthetic propofol Int. Immunopharmacol. 2010 10 1200 1208 20633531 10.1016/j.intimp.2010.06.027 Inada, T., Kubo, K. & Shingu, K. Promotion of interferon-gamma production by natural killer cells via suppression of murine peritoneal macrophage prostaglandin E2 production using intravenous anesthetic propofol. Int. Immunopharmacol. 10 20633531 10.1016/j.intimp.2010.06.027 37. Al-Mousawi AM Impact of anesthesia, analgesia, and euthanasia technique on the inflammatory cytokine profile in a rodent model of severe burn injury Shock 2010 34 261 268 20803788 10.1097/shk.0b013e3181d8e2a6 PMC3827633 Al-Mousawi, A. M. et al. Impact of anesthesia, analgesia, and euthanasia technique on the inflammatory cytokine profile in a rodent model of severe burn injury. Shock 34 20803788 10.1097/shk.0b013e3181d8e2a6 PMC3827633 38. Farsakoglu Y Influenza vaccination induces NK-cell-mediated type-II IFN response that regulates humoral immunity in an IL-6-dependent manner Cell Rep. 2019 26 2307 2315.e5 30811982 10.1016/j.celrep.2019.01.104 Farsakoglu, Y. et al. Influenza vaccination induces NK-cell-mediated type-II IFN response that regulates humoral immunity in an IL-6-dependent manner. Cell Rep. 26 30811982 10.1016/j.celrep.2019.01.104 39. Velazquez-Salinas L Verdugo-Rodriguez A Rodriguez LL Borca MV The role of interleukin 6 during viral infections Front. Microbiol. 2019 10 445678 10.3389/fmicb.2019.01057 PMC6524401 31134045 Velazquez-Salinas, L., Verdugo-Rodriguez, A., Rodriguez, L. L. & Borca, M. V. The role of interleukin 6 during viral infections. Front. Microbiol. 10 10.3389/fmicb.2019.01057 PMC6524401 31134045 40. Ivashkiv LB IFNγ: signalling, epigenetics and roles in immunity, metabolism, disease and cancer immunotherapy Nat. Rev. Immunol. 2018 18 545 558 29921905 10.1038/s41577-018-0029-z PMC6340644 Ivashkiv, L. B. IFNγ: signalling, epigenetics and roles in immunity, metabolism, disease and cancer immunotherapy. Nat. Rev. Immunol. 18 29921905 10.1038/s41577-018-0029-z PMC6340644 41. Johnson DE O’Keefe RA Grandis JR Targeting the IL-6/JAK/STAT3 signalling axis in cancer Nat. Rev. Clin. Oncol. 2018 15 234 248 29405201 10.1038/nrclinonc.2018.8 PMC5858971 Johnson, D. E., O’Keefe, R. A. & Grandis, J. R. Targeting the IL-6/JAK/STAT3 signalling axis in cancer. Nat. Rev. Clin. Oncol. 15 29405201 10.1038/nrclinonc.2018.8 PMC5858971 42. Lodge KM Cowburn AS Li W Condliffe AM The impact of hypoxia on neutrophil degranulation and consequences for the host Int. J. Mol. Sci. 2020 21 1183 32053993 10.3390/ijms21041183 PMC7072819 Lodge, K. M., Cowburn, A. S., Li, W. & Condliffe, A. M. The impact of hypoxia on neutrophil degranulation and consequences for the host. Int. J. Mol. Sci. 21 32053993 10.3390/ijms21041183 PMC7072819 43. Valença-Pereira F IL-6 enhances CD4 cell motility by sustaining mitochondrial Ca 2+ Proc. Natl Acad. Sci. USA 2021 118 e2103444118 34507993 10.1073/pnas.2103444118 PMC8449403 Valença-Pereira, F. et al. IL-6 enhances CD4 cell motility by sustaining mitochondrial Ca 2+ Proc. Natl Acad. Sci. USA 118 34507993 10.1073/pnas.2103444118 PMC8449403 44. Bhat P Leggatt G Waterhouse N Frazer IH Interferon-γ derived from cytotoxic lymphocytes directly enhances their motility and cytotoxicity Cell Death Dis. 2017 8 e2836 28569770 10.1038/cddis.2017.67 PMC5520949 Bhat, P., Leggatt, G., Waterhouse, N. & Frazer, I. H. Interferon-γ derived from cytotoxic lymphocytes directly enhances their motility and cytotoxicity. Cell Death Dis. 8 28569770 10.1038/cddis.2017.67 PMC5520949 45. Maeda K Mehta H Drevets DA Coggeshall KM IL-6 increases B-cell IgG production in a feed-forward proinflammatory mechanism to skew hematopoiesis and elevate myeloid production Blood 2010 115 4699 20351305 10.1182/blood-2009-07-230631 PMC3790945 Maeda, K., Mehta, H., Drevets, D. A. & Coggeshall, K. M. IL-6 increases B-cell IgG production in a feed-forward proinflammatory mechanism to skew hematopoiesis and elevate myeloid production. Blood 115 20351305 10.1182/blood-2009-07-230631 PMC3790945 46. Pizzagalli DU Pulfer A Thelen M Krause R Gonzalez SF In vivo motility patterns displayed by immune cells under inflammatory conditions Front. Immunol. 2022 12 804159 35046959 10.3389/fimmu.2021.804159 PMC8762290 Pizzagalli, D. U., Pulfer, A., Thelen, M., Krause, R. & Gonzalez, S. F. In vivo motility patterns displayed by immune cells under inflammatory conditions. Front. Immunol. 12 35046959 10.3389/fimmu.2021.804159 PMC8762290 47. D’Agostino G Lidocaine inhibits cytoskeletal remodelling and human breast cancer cell migration Br. J. Anaesth. 2018 121 962 968 30236259 10.1016/j.bja.2018.07.015 D’Agostino, G. et al. Lidocaine inhibits cytoskeletal remodelling and human breast cancer cell migration. Br. J. Anaesth. 121 30236259 10.1016/j.bja.2018.07.015 48. Chatziandreou N Macrophage death following influenza vaccination initiates the inflammatory response that promotes dendritic cell function in the draining lymph node Cell Rep. 2017 18 2427 2440 28273457 10.1016/j.celrep.2017.02.026 Chatziandreou, N. et al. Macrophage death following influenza vaccination initiates the inflammatory response that promotes dendritic cell function in the draining lymph node. Cell Rep. 18 28273457 10.1016/j.celrep.2017.02.026 49. Mempel, T. R., Henrickson, S. E. & Von Andrian, U. H. T-cell priming by dendritic cells in lymph nodes occurs in three distinct phases. Nature 10.1038/nature02238 14712275 ",
  "metadata": {
    "Title of this paper": "Macrophage death following influenza vaccination initiates the inflammatory response that promotes dendritic cell function in the draining lymph node",
    "Journal it was published in:": "Lab Animal",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12484078/"
  }
}