{
  "title": "Paper_447",
  "abstract": "pmc Nat Immunol Nat Immunol 981 npgopen Nature Immunology 1529-2908 1529-2916 pmc-is-collection-domain yes pmc-collection-title Nature Portfolio PMC12479350 PMC12479350.1 12479350 12479350 40897896 10.1038/s41590-025-02259-8 2259 1 Article Simultaneous STING and lymphotoxin-β receptor activation induces B cell responses in tertiary lymphoid structures to potentiate antitumor immunity http://orcid.org/0000-0001-9100-7037 Sawada Junko 1 http://orcid.org/0009-0007-7210-3825 Kikuchi Yasuhiro 1 Duah Maxwell 1 Herrera Jose Luis 1 Kanamori Fumiaki 1 http://orcid.org/0000-0002-9266-1089 Csomos Krisztian 2 5 Stansel Tomoko 1 http://orcid.org/0000-0003-4215-4385 Hiraoka Nobuyoshi 3 Yoshida Masayuki 3 http://orcid.org/0000-0002-6192-0703 Walter Jolan 2 http://orcid.org/0000-0002-5006-418X Ware Carl F. 4 http://orcid.org/0000-0001-7548-137X Komatsu Masanobu mkomats1@jhmi.edu 1 1 https://ror.org/00za53h95 grid.21107.35 0000 0001 2171 9311 Cancer and Blood Disorders Institute, Institute for Fundamental Biomedical Research, and Department of Surgery, Johns Hopkins All Children’s Hospital, and Department of Orthopaedic Surgery, Johns Hopkins University School of Medicine, 2 https://ror.org/013x5cp73 grid.413611.0 0000 0004 0467 2330 Division of Pediatric Allergy/Immunology, University of South Florida at Johns Hopkins All Children’s Hospital, 3 https://ror.org/03rm3gk43 grid.497282.2 Division of Pathology and Clinical Laboratories, National Cancer Center Hospital; Division of Molecular Pathology, Analytical Pathology, National Cancer Center Research Institute, 4 https://ror.org/03m1g2s55 grid.479509.6 0000 0001 0163 8573 Laboratory of Molecular Immunology, Infectious and Inflammatory Diseases Center, Sanford Burnham Prebys Medical Discovery Institute, 5 https://ror.org/01cwqze88 grid.94365.3d 0000 0001 2297 5165 Present Address: Translational Genetics and Genomics Section, National Institute of Arthritis and Musculoskeletal and Skin Diseases (NIAMS), National Institutes of Health (NIH), 2 9 2025 2025 26 10 497825 1766 1780 19 8 2024 29 7 2025 02 09 2025 01 10 2025 01 10 2025 © The Author(s) 2025 2025 https://creativecommons.org/licenses/by/4.0/ Open Access http://creativecommons.org/licenses/by/4.0/ B cell-rich tertiary lymphoid structures (TLS) are associated with favorable prognosis and positive response to immunotherapy in cancer. Here we show that simultaneous activation of innate immune effectors, STING and lymphotoxin-β receptor (LTβR), results in CD8 + + + H H Sawada et al. show simultaneous activation of the STING and lymphotoxin beta receptor signaling induces B cell-activating germinal center responses within tumor environment and enhances antitumor responses. Subject terms Tumour immunology Cancer immunotherapy https://doi.org/10.13039/100000005 U.S. Department of Defense (United States Department of Defense) W81XWH2211051 Komatsu Masanobu https://doi.org/10.13039/100006827 Florida Department of Health 20B01 Komatsu Masanobu pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement yes pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes issue-copyright-statement © Springer Nature America, Inc. 2025 Main The tumor microenvironment has a profound influence on the response to cancer therapy. TLS are often observed in lymphocyte-infiltrated ‘immune hot’ tumors. TLS are formed at the sites of chronic inflammation and resemble the secondary follicles of lymph nodes. These structures are composed of dense clusters of B cells containing follicular helper T (T FH + + 1 3 4 6 4 6 5 7 10 11 5 7 10 8 10 5 7 8 10 The normal development of lymphoid organs such as lymph nodes and Peyer’s patches requires LTβR signaling 12 16 17 21 22 23 28 29 30 31 32 + 33 33 Results Microenvironmental cues associated with TLS Previously, we conducted a transcriptome analysis of tumor vasculature in human breast cancer, which identified several genes differentially expressed between the endothelium of tumors rich in TLS and those tumors lacking TLS 34 1 FH 1 CXCL13 12 16 23 28 Drug induction of tumor-associated TLS Based on these findings, we administered STING agonist ADU-S100 (cGAMP analog) and LTβR agonistic antibody (4H8) to tumor-bearing mice to examine whether activation of STING and LTβR pathways will induce TLS formation in TLS-free tumors by reproducing the microenvironment of TLS-rich tumors. For this study, we treated C57BL/6 mice bearing subcutaneous syngeneic tumors derived from Kras LSL.G12D/+ Trp53 LSL.R172H/+ Pdx1 35 3 2a + 1a–c 2a,b 1d 1e 1f 2c–e + + FH 1d 4 8 1g + + 3a,b + + + + 1h,i + + + 1g–i 1h,i 3c 1h,i Fig. 1 Drug induction of TLS and HEVs in subcutaneous tumors. a b c 2 N P P P d z FH FH FH e f g h + + 3a a i 2 N P d f In wild-type mice, TLS and HEV formation was also observed in orthotopic KPC tumors grown in the pancreas (Fig. 2a 2b 2c 1c 2b 2c Fig. 2 Drug induction of TLS and HEVs in orthotopic tumors. a b 2 N P c We next analyzed how tumors respond to the STING agonist treatment. KPC tumors were collected at different time points after agonist treatment, and STING signaling was analyzed by western blot. Intratumoral ADU-S100 induced IRF3 phosphorylation and IFNβ expression within 4 h, indicating the rapid activation of the STING pathway in the tumor microenvironment (Extended Data Fig. 4a 4b 4c 4d Neoadjuvant combination therapy inhibits tumor growth and recurrence The growth of different types of tumors was monitored for 2 weeks from the day of treatment (day 0). The LTβR monotherapy had little or no significant effect, and only a moderate effect of STING monotherapy was observed in the KPC tumors and Py230 mammary tumors at this dose (2 μg intratumoral; Fig. 3a 3a 3b + + + + 3c + 3c + + 36 + 3b + 3c + 3d + Fig. 3 Therapeutic effects of neoadjuvant agonist combination on tumor growth and survival. a N N N P P P P b N c + + 3a N d N e f N g a g a d Source data The role of B cells in TLS is thought to be the local development of humoral immunity involving antibody productions and differentiation of memory B cells; hence, contributions of TLS-B cells cannot be fully examined in a short-term, 2-week tumor study. To investigate the importance of TLS and humoral immunity, we used a tumor recurrence model. In this model, we surgically resected the subcutaneous KPC tumors and sentinel lymph nodes after monotherapy or combination therapy on day 14 and reinoculated KPC cells subcutaneously 2–3 weeks later to mimic tumor relapses (Fig. 3e 3f,g 3f,g Accumulation of activated B cells in tumors To explore the mechanism by which this neoadjuvant therapy confers resistance to future tumor development, we further examined tumor-infiltrating lymphocytes and TLS in the primary tumors on the day of tumor resection. Our flow cytometry analysis showed that tumors of the combination therapy group had a significant increase in B cells, consistent with the presence of TLS in these tumors (Fig. 4a 5a–c 4a 4a 5c + + + 4a 5c 4b 4a 5d + 5 Fig. 4 Drug-induced TLS harbor antigen-primed class-switched plasma and memory B cells. a P P b c + d + + b d Fig. 5 Germinal centers of tumor-draining lymph nodes. Tumor-draining lymph nodes were collected on day 14 and frozen sections examined by immunofluorescence of lymphoid follicles. a b c + + N P P Our results suggest that one advantage of combination therapy over LTβR monotherapy is the activation and maturation of tumor-infiltrating B cells. The extensive accumulation of B cells in TLS suggests germinal center-like B cell responses. Immunofluorescence analysis of tumor sections demonstrated considerable accumulation of IgG + + 4c + 4d + + 6 7 Changes in tumor transcriptome upon agonist therapies We next conducted sequencing of total tumor RNA to characterize the immune landscape of the tumors on the day of tumor resection (day 14). This analysis showed an altered tumor transcriptome in the combination therapy group compared with other groups (Fig. 6a Tnf Lta Ltb Light Tlr7 6b 8 Fasl Gzmb Ccl21 6b Il10 H H Tbx21 Il12rb2 Stat4 6b H 37 Ifng 6b Il21 Il21r FH 6b 38 Cxcr5 FH Cd40 Cd40lg Mzb1 Cd27 6 8 Tnfsf13b Tnfsf13 Tnfrsf17 Tnfrsf13c Tnfrsf13b 8 Fig. 6 Tumors exhibit a gene expression signature of enhanced immune responses upon agonist combination therapy. Bulk RNA-seq was conducted using total RNA isolated from KPC tumors on the day of tumor resection (day 14), and the data were processed by DEseq2. a b N c d e N f N These findings are consistent with the presence of T FH 1 4 4 5 6b 6c We also found increased expression of class-switched IgG immunoglobulin heavy chains in LTβR monotherapy and combination therapy groups (Fig. 6d 4c 6e,f Intratumoral B cell and T cell subsets in combination therapy The tumor immune environment was further investigated by single-cell RNA-sequencing (RNA-seq) analyses of fluorescence-activated cell sorting (FACS)-sorted tumor-infiltrating CD45 + 7a 9a 7a 39 7b,c 9b 40 + + + + 7c 7c 40 + 7c Fig. 7 Single-cell RNA-seq analyses of tumor-infiltrating leukocytes. Tumor-infiltrating CD45 + a + 9 + b c d f + H H H t- d e + + f Unlike the prominent effects on B cell expansion, the agonist treatments did not appear to affect the abundance of total CD4 + + 10a + + Ccr7 Cd4 + Ccr7 hi Sell hi 7d–f + + 7d–f H 7d–f H 7e 41 H H 7d–f H H H 42 A subcluster analysis of CD8 + + 43 46 10b,c + 10b,d + + H H B cell humoral immunity is essential to neoadjuvant therapy We showed that both LTβR monotherapy and STING–LTβR combination therapy induced TLS in primary KPC tumors; however, only combination therapy significantly increased activated B cells and memory B cells in the tumors, and combination therapy provided much stronger protection against the second tumor challenge than LTβR monotherapy. These results may reflect qualitative differences between TLS (or ‘fitness’ of TLS) of the two treatment groups and suggest the importance of TLS-driven humoral immunity enhanced by the combination therapy. Therefore, we measured antibodies in the blood of these mice with specificity for tumor cells. Blood plasma was collected from the agonist-treated or untreated mice 2 weeks after the tumor resection (Fig. 8a 8b–d 47 8a + + + + 8e Fig. 8 Therapeutic effects of neoadjuvant combination therapy are elicited by cellular and humoral immunity. a b c d P e N P P P f N N P g 3e N P h 3e + N P P d e g h f Source data A serum transfer experiment further demonstrated the importance of humoral immunity. We collected serum from mice 2 weeks after the neoadjuvant agonist combination therapy and tumor resection surgery (Fig. 8a 8f 8f 8g Cell-mediated immunity is required for neoadjuvant therapy We next examined the role of cell-mediated immunity in the therapeutic effect of the neoadjuvant agonists. KPC tumor-bearing mice were treated with or without neoadjuvant STING–LTβR combination therapy followed by tumor resection surgery. Two weeks later, starting from one day before reinoculation of KPC cells, these mice received intraperitoneal injection of anti-CD8, NK1.1 or Ly6G antibodies to deplete CD8 + + 8h + Discussion In this study, we demonstrated that simultaneous activation of innate immune effectors, STING and LTβR, induces strong B cell-mediated and T cell-mediated immunity against tumors. The immediate-early response to this treatment was mediated mainly by CD8 + + + We demonstrated that mature functional TLS with germinal center reactions can be therapeutically induced in TLS-free tumors. T FH 25 28 48 TLS formation is a prominent outcome of this treatment. However, we cannot rule out the possibility that tumor-draining lymph nodes are mainly responsible for the observed immune responses against tumors. We observed a trend of a moderate increase in total lymphocyte counts in draining lymph nodes indicating that these lymph nodes are affected by the treatment. However, the fractions of activated B cells and T cells in these lymph nodes were not significantly different between the three different treatment groups, raising the question of how lymphocytes in lymph nodes contributed to the response to the combination therapy. Instead, our findings suggest that the fitness of TLS greatly influenced the development of long-term antitumor immunity. There was a robust increase in B cell activation and differentiation in TLS, but not in the draining lymph nodes, upon combination therapy compared with monotherapies, and this increase was associated with a marked accumulation of Blimp1 + 39 49 50 Our study showed that B cells and T cells are both essential for the development of TLS and HEVs. Interestingly, CD4 + + 6 8 + 51 52 + 26 27 Unlike other reported strategies of TLS induction, TLS induction by this method does not require viral antigens, viral infection or artificial genetic manipulations to boost immune response, thus making it feasible for clinical applications in cancer treatment. Using this approach, functional TLS can be induced without any preconditioning, in different tumor types and anatomical sites, not restricted to certain organs such as the immune environment of the lung 50 53 54 5 7 10 40 55 56 Methods Clinical cancer specimens Informed written consent was obtained from all participants involved in the study, and all clinical investigations were conducted in line with the principles of the Declaration of Helsinki. Formalin-fixed paraffin-embedded tissue samples of pancreatic or breast cancer were collected at the National Cancer Center Hospital, Japan. The use of the cancer specimens was approved by the Institutional Review Board (protocol 2005-077). Specimens were from individuals who underwent macroscopic curative resection. None of the individuals had received any therapy before surgery. All cases of pancreatic cancer were conventional pancreatic ductal carcinomas; cases of adenocarcinomas originating in intraductal papillary mucinous neoplasms or mucinous cystic neoplasms were excluded, as were secondary tumors and post-neoadjuvant cases. Cases with autoimmune pancreatitis-associated cancers were excluded. Breast cancer specimens (stage I–III, invasive ductal adenocarcinoma) were described previously 34 Mice The procedures involving animals used in this study were approved by the Institutional Animal Care and Use Committee of Johns Hopkins University. C57BL/6NHsd mice were purchased from Inotiv (Envigo) and used at 8–10 weeks old for the study. Female mice were used for the orthotopic mammary tumor and rhabdomyosarcoma models, and male mice were used for the subcutaneous and orthotopic pancreatic tumor models. Nude mice on the C57BL/6 background (B6.Cg- Foxn1 nu Cd79a tm1(cre)Reth Cell lines The MMTV-PyMT mouse mammary tumor-derived Py230 cells were purchased from the American Type Culture Collection and cultured in F-12K medium with 5% fetal bovine serum, penicillin–streptomycin and 0.1% MITO+ serum extender. The Kras LSL.G12D/+ Trp53 LSL.R172H/+ Pdx1 35 −1 −1 Mouse tumor models KPC tumor cells were subcutaneously injected into the flanks of syngeneic male mice at 3 × 10 6 3 24 6 3 5 3 Immunostaining KPC tumors were dissected, embedded in OCT compound and rapidly frozen in liquid nitrogen. Cryosections of 7 µm or 10 µm in thickness were obtained using a cryostat and subjected to immunostaining. First, sections were fixed with 4% formaldehyde for 10 min at 24 °C. Permeabilization was performed using 0.1% Triton X-100 in PBS for 10 min, followed by blocking with a 1% BSA–PBS solution to reduce nonspecific binding. For colorimetric immunohistochemistry, BloxAll (Vector Laboratories) was used to block endogenous peroxidase and alkaline phosphatase. After blocking, sections were washed twice with PBS and incubated with primary antibodies overnight at 4 °C, as follows: (1) B cell and T cell markers: rat anti-mouse CD19 Alexa 647 conjugate, clone 1D3, BD Pharmingen, 557684; rat anti-mouse CD4 Alexa 488, clone GK1.5, BioLegend, 100424; (2) immune and endothelial cell markers: rat anti-mouse CD73, clone TY/11.8, BioLegend, 127202; PE-conjugated rat anti-mouse CD138 (Syndecan-1), clone 281.2, BioLegend, 142504; Armenian hamster anti-mouse CD69, clone H1.2F3, BioLegend, 104516; Rat anti-mouse F4/80 Alexa 488, clone BM8, eBioscience, 53-4801-82; rat anti-mouse interferon-β monoclonal antibody, clone RMMB-1, PBL Assay Science, 22400-1; rat anti-HEV marker monoclonal antibody Alexa 488, clone MECA-79, eBioscience, 53-6036-82; Rabbit anti-CD31, Abcam, ab28364; and (3) rabbit anti-CD23, Invitrogen, PA5-79242; goat anti-mouse IgG-Alexa 488, Invitrogen, A11001; rabbit anti-Bcl6, Abcam, ab272859 and Rabbit anti-Ki-67, GeneTex, GTX16667. The following day, sections were washed three times with PBS, and when necessary, incubated with appropriate secondary antibodies for 1 h at 24 °C. Alexa-conjugated secondary antibodies were purchased from Invitrogen. Then sections were washed three times with PBS, and nuclei were counterstained with DAPI for 10 min. Finally, sections were washed twice with PBS and mounted for imaging. Stained slides were scanned by Aperio Versa (Leica) for Halo image analyses (Indica Labs) using the Cytonuclear module. The tumor area (mm 2 In vivo time-course study of STING activation in KPC tumors To assess the activation of the STING pathway in the tumor microenvironment, three time points were established: 2 h, 4 h and 48 h. Mice bearing KPC tumors were intratumorally injected with 2 µg of a STING agonist ADU-S100, with injections staggered at 10-min intervals between mice to ensure precise timing for endpoint collection. At each time point, mice were euthanized via CO 2 Western blot analysis of tumor samples Tumor samples were dissected and immediately snap-frozen in liquid nitrogen. The frozen tumors were thoroughly homogenized on ice in a lysis buffer containing 1× protease and 1× phosphatase inhibitors (Sigma-Aldrich), 10 nM okadaic acid and 0.5 mM phenylmethylsulfonyl fluoride, using a mechanical homogenizer to ensure complete cell lysis. To further disrupt cells and solubilize proteins, the homogenates were sonicated. The samples were then incubated at 4 °C for 1 h with gentle agitation to enhance maceration. Following incubation, the homogenates were centrifuged at 10,000 g In vitro time-course study of STING activation in KPC and HUVEC cells To evaluate the activation of the STING pathway in tumor cells (KPC) or endothelial cells (human umbilical vein endothelial cells (HUVECs)) in vitro, seven time points were established: 0, 30, 60, 90, 120, 180 and 300 min. KPC cells were cultured to confluence in 3.5-cm dishes using RPMI GlutaMAX medium (61870-036, Gibco). HUVEC cells were cultured to confluence in endothelial cell growth media (CCM027, R&D Systems). Before treatment, cells were washed twice with 1× PBS to remove residual media. Fresh medium containing either 10 μM STING agonist ADU-S100 or PBS (vehicle control) was then added to the cells. At each endpoint, cells were washed twice with 1× PBS and immediately preserved at −80 °C for subsequent analysis. Western blot analysis of KPC and HUVEC cells Cells were harvested using a RIPA buffer supplemented with 0.3% SDS, 1× protease and 1× phosphatase inhibitors (Sigma-Aldrich) on ice. The cell homogenates were vortexed three times for 30 s each and sonicated twice at 10% amplitude, with 30-s intervals on ice between each sonication. Then, samples were centrifuged at 10,000 g Flow cytometry Tumor-infiltrating lymphocytes and lymphocytes of the draining lymph nodes were analyzed by FACS on day 14, on the day of tumor resection. Tumors were excised and cut into small fragments with sterilized scissors in 0.5–1.0 ml of RPMI containing Liberase (300 µg ml −1 Analysis of STING activation in leukocytes was conducted by flow cytometry as follows: Leukocytes were isolated from the peripheral blood, peritoneum, spleen or lymph nodes of normal mice and incubated in vitro with 7.2 μg ml −1 Mouse tumor RNA-seq Subcutaneous KPC tumors were collected 14 days after agonist treatment started and homogenized using Precellys lysing kits CK28 in Precellys Evolution Touch homogenizer with Cryolys Evolution (Bertin Technologies SAS). The total RNA was isolated from tumors using TRIzol (Thermo Fisher Scientific), and a poly(A) RNA-seq library was prepared following Illumina’s TruSeq-stranded-mRNA sample preparation protocol. RNA integrity was verified with Agilent Technologies 2100 Bioanalyzer. Poly(A) tail-containing mRNAs were purified using oligo-(dT) magnetic beads with two rounds of purification. After purification, poly(A) RNA was fragmented using divalent cation buffer at an elevated temperature. Quality-control analysis and quantification of the sequencing library were performed using Agilent Technologies 2100 Bioanalyzer High Sensitivity DNA Chip. Paired-ended sequencing was performed on Illumina’s NovaSeq 6000 sequencing system. After the removal of the reads that contained adaptor contamination, low-quality bases and undetermined bases by Cutadapt, sequence quality was verified using FastQC. HISAT2 was used to map reads to the genome of ftp://ftp.ensembl.org/pub/release-101/fasta/mus_musculus/dna/ z Single-cell RNA-seq Single-cell RNA-seq was performed in two independent mouse experiments. KPC tumors were harvested from mice on day 14. In each experiment, ten tumors were pooled for each treatment group and dissociated as described above for flow cytometry using Liberase and GentleMACS Octo dissociator. After dead/live cell staining and blocking nonspecific binding using anti-FcRII or anti-FcRIII (BioLegend) for 10 min, cells were stained with anti-CD45 for 1 h at 4 °C. Live CD45 + http://www.R-project.org/ RNA-seq of clinical cancer specimens Five to ten 7-µm-thick formalin-fixed paraffin-embedded tissue sections were used for RNA isolation from each sample. RNA-seq was carried out by Azenta. For pancreatic cancer specimens, a clinical pathologist removed sentinel lymph nodes and intestinal tissues from each section by scraping under a dissection microscope using a H&E-stained serial section to guide tissue removal. PertekFlow was used for trimming, quality control, alignment by STAR (2.7.8a), annotation with hg38_ensembl_release91_v2 and differential analysis with DESeq2. Detection of plasma immunoglobin binding to tumor cells Cultured KPC cells were dissociated by 0.05% Trypsin-EDTA for 3 min and neutralized with 10% FBS in PBS. Cells were stained with LIVE/DEAD Cell staining kit (Themo Fisher Scientific) for 10 min at 4 °C and washed and treated with 10% goat serum/PBS for 10 min at 4 °C. The total of 2 × 10 5 Serum transfer Mouse blood serum was collected from 19 mice 2 weeks after neoadjuvant agonist therapy and tumor resection surgery. The serum was pooled, and heat inactivation to abolish complement activity was carried out at 56 °C for 10 min. The serum was aliquoted, and 100 μl was intraperitoneally given to treatment-naive recipient mice on the day of KPC tumor injection to these mice. The mice continued to receive serum transfer two times per week, and the tumor growth was monitored. Immune cell depletion For T cell depletion experiments, mice were injected intraperitoneally with 200 μg of anti-mouse CD4 (clone GK1.5, BioXCell BE0003-1) and/or CD8 (clone 2.43, BioXCell BE0061) monoclonal antibodies or of isotype-matched control antibody (clone LTF-2, BioXCell, BE0090) on the indicated days. Specific depletion of CD4 + + 6 + 50 Statistics Data are presented as the mean ± s.e.m. One-way or two-way ANOVA was performed followed by Tukey’s post hoc test to compare mouse treatment groups, and the statistical significance was determined between pairs of individual groups. For all analyses, P 27 33 Reporting summary Further information on research design is available in the Nature Portfolio Reporting Summary Online content Any methods, additional references, Nature Portfolio reporting summaries, source data, extended data, supplementary information, acknowledgements, peer review information; details of author contributions and competing interests; and statements of data and code availability are available at 10.1038/s41590-025-02259-8. Supplementary information  Reporting Summary Source data  Source Data Fig. 3 Statistical source data for Fig. 3a–d. Source Data Fig. 8 Statistical source data for Fig. 8f. Source Data Extended Data Fig. 4 Unprocessed western blots for Fig. 4a. Source Data Extended Data Fig. 4 Unprocessed western blots for Fig. 4c. Extended data  Extended Data Fig. 1 Pathway analysis based on the differential transcriptome of tumor vascular endothelium in TLS-rich tumors. A previous transcriptome analysis of human breast adenocarcinoma vasculature identified differentially expressed genes between non-HEV endothelium of TLS-rich vs. TLS-free tumors 34 a b  Extended Data Fig. 2 Formation of tumor-associated TLS upon agonist treatment. a b c d e  Extended Data Fig. 3 Agonist treatment study in T cell-depleted mice and B cell-deficient mice. a + + b + + c +  Extended Data Fig. 4 Induction of STING signaling by intratumoral ADU-S100. a b + c d in vitro + + + + +  Source data  Extended Data Fig. 5 Flow cytometry analyses of tumor-infiltrating B cells. a b c + 4a d  Extended Data Fig. 6 Analysis of tumor-infiltrating T cells. a + + + + + + + 4a b +  Extended Data Fig. 7 Analysis of T cells in tumor-draining lymph node. a + + + + b + + + +  Extended Data Fig. 8 Gene expression signature of enhanced immune responses upon combination therapy. Bulk RNAseq was conducted using total RNA isolated from KPC tumors on the day of tumor resection (Day 14), and the data was processed by DEseq2. The graphs show the expression of different genes related to inflammation, innate immunity, and adaptive immunity in tumors of different treatment groups. One experiment. N = 8 tumors were examined representing biological replicates for each group. Data are presented as the mean ± s.e.m.  Extended Data Fig. 9 Gene expression patterns used to identify immune cell types in single-cell analysis. a 7 b +  Extended Data Fig. 10 Single-cell RNAseq analysis of tumor infiltrating T cells. a + + b + + c + mem + ex_prog + ex_term + d + + + Publisher’s note These authors contributed equally: Junko Sawada, Yasuhiro Kikuchi. Extended data is available for this paper at 10.1038/s41590-025-02259-8. Supplementary information The online version contains supplementary material available at 10.1038/s41590-025-02259-8. Acknowledgements Histological and fluorescence imaging and flow cytometry analyses were conducted at the High-Resolution Imaging Core and FACS Core of Johns Hopkins All Children’s Research Center Shared Resources. Histological preparations were carried out at the Histology Core. We thank B. Ujhazi of the University of South Florida for assistance with bioinformatic analysis. This work was supported by the National Cancer Institute, National Institutes of Health (CA251192, CA125255), Department of Defense (W81XWH2211051), Florida Department of Health (20B01) and Johns Hopkins All Children’s Foundation. Author contributions Conceptualization: J.S., Y.K. and M.K. Study design: J.S., Y.K., M.D., J.L.H., F.K. and M.K. Investigation: J.S., Y.K., M.D., J.L.H., F.K., K.C., T.S., J.W., N.H., M.Y. and M.K. Formal analysis: J.S., Y.K., M.D., J.L.H., F.K., K.C., J.W. and M.K. Visualization: J.S., Y.K., M.D., J.L.H., F.K. and M.K. Resources: N.H., M.Y. and C.F.W. Writing original draft: J.S., Y.K., M.D., J.L.H., F.K., K.C., C.F.W. and M.K. Writing final paper: M.K. Supervision: M.K. Project administration: M.K. Funding acquisition: M.K. Peer review Peer review information Nature Immunology Nature Immunology Data availability The single-cell and bulk RNA-seq data reported in this study are publicly available at the Gene Expression Omnibus (GEO) repository. Single-cell RNA-seq data are available at the GEO under accession numbers GSE275840 GSE275876 GSE275840 GSE275876 GSE275836 GSE275836 GSE275766 GSE275955 GSE275766 GSE275955 Source data Competing interests C.F.W. is a co-inventor on patents related to this research (patent no. US 8,974,787). The other authors declare no competing interests. References 1. Martinet L Human solid tumors contain high endothelial venules: association with T- and B-lymphocyte infiltration and favorable prognosis in breast cancer Cancer Res. 2011 71 5678 5687 21846823 10.1158/0008-5472.CAN-11-0431 Martinet, L. et al. Human solid tumors contain high endothelial venules: association with T- and B-lymphocyte infiltration and favorable prognosis in breast cancer. Cancer Res. 71 21846823 10.1158/0008-5472.CAN-11-0431 2. Martinet L Garrido I Girard JP Tumor high endothelial venules (HEVs) predict lymphocyte infiltration and favorable prognosis in breast cancer Oncoimmunology 2012 1 789 790 22934284 10.4161/onci.19787 PMC3429596 Martinet, L., Garrido, I. & Girard, J. P. Tumor high endothelial venules (HEVs) predict lymphocyte infiltration and favorable prognosis in breast cancer. Oncoimmunology 1 22934284 10.4161/onci.19787 PMC3429596 3. Martinet L High endothelial venules (HEVs) in human melanoma lesions: major gateways for tumor-infiltrating lymphocytes Oncoimmunology 2012 1 829 839 23162750 10.4161/onci.20492 PMC3489738 Martinet, L. et al. High endothelial venules (HEVs) in human melanoma lesions: major gateways for tumor-infiltrating lymphocytes. Oncoimmunology 1 23162750 10.4161/onci.20492 PMC3489738 4. Schumacher TN Thommen DS Tertiary lymphoid structures in cancer Science 2022 375 eabf9419 34990248 10.1126/science.abf9419 Schumacher, T. N. & Thommen, D. S. Tertiary lymphoid structures in cancer. Science 375 34990248 10.1126/science.abf9419 5. Hiraoka N Intratumoral tertiary lymphoid organ is a favourable prognosticator in patients with pancreatic cancer Br. J. Cancer 2015 112 1782 1790 25942397 10.1038/bjc.2015.145 PMC4647237 Hiraoka, N. et al. Intratumoral tertiary lymphoid organ is a favourable prognosticator in patients with pancreatic cancer. Br. J. Cancer 112 25942397 10.1038/bjc.2015.145 PMC4647237 6. Sautes-Fridman C Petitprez F Calderaro J Fridman WH Tertiary lymphoid structures in the era of cancer immunotherapy Nat. Rev. Cancer 2019 19 307 325 31092904 10.1038/s41568-019-0144-6 Sautes-Fridman, C., Petitprez, F., Calderaro, J. & Fridman, W. H. Tertiary lymphoid structures in the era of cancer immunotherapy. Nat. Rev. Cancer 19 31092904 10.1038/s41568-019-0144-6 7. Hiraoka N Ino Y Yamazaki-Itoh R Tertiary lymphoid organs in cancer tissues Front Immunol. 2016 7 244 27446075 10.3389/fimmu.2016.00244 PMC4916185 Hiraoka, N., Ino, Y. & Yamazaki-Itoh, R. Tertiary lymphoid organs in cancer tissues. Front Immunol. 7 27446075 10.3389/fimmu.2016.00244 PMC4916185 8. Helmink BA B cells and tertiary lymphoid structures promote immunotherapy response Nature 2020 577 549 555 31942075 10.1038/s41586-019-1922-8 PMC8762581 Helmink, B. A. et al. B cells and tertiary lymphoid structures promote immunotherapy response. Nature 577 31942075 10.1038/s41586-019-1922-8 PMC8762581 9. Petitprez F B cells are associated with survival and immunotherapy response in sarcoma Nature 2020 577 556 560 31942077 10.1038/s41586-019-1906-8 Petitprez, F. et al. B cells are associated with survival and immunotherapy response in sarcoma. Nature 577 31942077 10.1038/s41586-019-1906-8 10. Cabrita R Tertiary lymphoid structures improve immunotherapy and survival in melanoma Nature 2020 577 561 565 31942071 10.1038/s41586-019-1914-8 Cabrita, R. et al. Tertiary lymphoid structures improve immunotherapy and survival in melanoma. Nature 577 31942071 10.1038/s41586-019-1914-8 11. Chen L The immunosuppressive niche of soft-tissue sarcomas is sustained by tumor-associated macrophages and characterized by intratumoral tertiary lymphoid structures Clin. Cancer Res. 2020 26 4018 4030 32332015 10.1158/1078-0432.CCR-19-3416 PMC8772618 Chen, L. et al. The immunosuppressive niche of soft-tissue sarcomas is sustained by tumor-associated macrophages and characterized by intratumoral tertiary lymphoid structures. Clin. Cancer Res. 26 32332015 10.1158/1078-0432.CCR-19-3416 PMC8772618 12. De Togni P Abnormal development of peripheral lymphoid organs in mice deficient in lymphotoxin Science 1994 264 703 707 24563504 De Togni, P. et al. Abnormal development of peripheral lymphoid organs in mice deficient in lymphotoxin. Science 264 24563504 13. Cuff CA Lymphotoxin alpha3 induces chemokines and adhesion molecules: insight into the role of LT alpha in inflammation and lymphoid organ development J. Immunol. 1998 161 6853 6860 9862717 Cuff, C. A. et al. Lymphotoxin alpha3 induces chemokines and adhesion molecules: insight into the role of LT alpha in inflammation and lymphoid organ development. J. Immunol. 161 9862717 14. Cuff CA Sacca R Ruddle NH Differential induction of adhesion molecule and chemokine expression by LTalpha3 and LTalphabeta in inflammation elucidates potential mechanisms of mesenteric and peripheral lymph node development J. Immunol. 1999 162 5965 5972 10229834 Cuff, C. A., Sacca, R. & Ruddle, N. H. Differential induction of adhesion molecule and chemokine expression by LTalpha3 and LTalphabeta in inflammation elucidates potential mechanisms of mesenteric and peripheral lymph node development. J. Immunol. 162 10229834 15. Koni PA Distinct roles in lymphoid organogenesis for lymphotoxins alpha and beta revealed in lymphotoxin beta-deficient mice Immunity 1997 6 491 500 9133428 10.1016/s1074-7613(00)80292-7 Koni, P. A. et al. Distinct roles in lymphoid organogenesis for lymphotoxins alpha and beta revealed in lymphotoxin beta-deficient mice. Immunity 6 9133428 10.1016/s1074-7613(00)80292-7 16. Rennert PD Browning JL Mebius R Mackay F Hochman PS Surface lymphotoxin alpha/beta complex is required for the development of peripheral lymphoid organs J. Exp. Med. 1996 184 1999 2006 8920886 10.1084/jem.184.5.1999 PMC2192901 Rennert, P. D., Browning, J. L., Mebius, R., Mackay, F. & Hochman, P. S. Surface lymphotoxin alpha/beta complex is required for the development of peripheral lymphoid organs. J. Exp. Med. 184 8920886 10.1084/jem.184.5.1999 PMC2192901 17. Dejardin E The lymphotoxin-beta receptor induces different patterns of gene expression via two NF-κB pathways Immunity 2002 17 525 535 12387745 10.1016/s1074-7613(02)00423-5 Dejardin, E. et al. The lymphotoxin-beta receptor induces different patterns of gene expression via two NF-κB pathways. Immunity 17 12387745 10.1016/s1074-7613(02)00423-5 18. Gommerman JL Browning JL Ware CF The Lymphotoxin Network: orchestrating a type I interferon response to optimize adaptive immunity Cytokine Growth Factor Rev. 2014 25 139 145 24698108 10.1016/j.cytogfr.2014.02.002 PMC4081445 Gommerman, J. L., Browning, J. L. & Ware, C. F. The Lymphotoxin Network: orchestrating a type I interferon response to optimize adaptive immunity. Cytokine Growth Factor Rev. 25 24698108 10.1016/j.cytogfr.2014.02.002 PMC4081445 19. Bjordahl RL Steidl C Gascoyne RD Ware CF Lymphotoxin network pathways shape the tumor microenvironment Curr. Opin. Immunol. 2013 25 222 229 23339845 10.1016/j.coi.2013.01.001 PMC3646954 Bjordahl, R. L., Steidl, C., Gascoyne, R. D. & Ware, C. F. Lymphotoxin network pathways shape the tumor microenvironment. Curr. Opin. Immunol. 25 23339845 10.1016/j.coi.2013.01.001 PMC3646954 20. Sedy J Bekiaris V Ware CF Tumor necrosis factor superfamily in innate immunity and inflammation Cold Spring Harb. Perspect. Biol. 2014 7 a016279 25524549 10.1101/cshperspect.a016279 PMC4382740 Sedy, J., Bekiaris, V. & Ware, C. F. Tumor necrosis factor superfamily in innate immunity and inflammation. Cold Spring Harb. Perspect. Biol. 7 25524549 10.1101/cshperspect.a016279 PMC4382740 21. Sacca R Cuff CA Lesslauer W Ruddle NH Differential activities of secreted lymphotoxin-alpha3 and membrane lymphotoxin-alpha1beta2 in lymphotoxin-induced inflammation: critical role of TNF receptor 1 signaling J. Immunol. 1998 160 485 491 9552007 Sacca, R., Cuff, C. A., Lesslauer, W. & Ruddle, N. H. Differential activities of secreted lymphotoxin-alpha3 and membrane lymphotoxin-alpha1beta2 in lymphotoxin-induced inflammation: critical role of TNF receptor 1 signaling. J. Immunol. 160 9552007 22. Moussion C Girard JP Dendritic cells control lymphocyte entry to lymph nodes through high endothelial venules Nature 2011 479 542 546 22080953 10.1038/nature10540 Moussion, C. & Girard, J. P. Dendritic cells control lymphocyte entry to lymph nodes through high endothelial venules. Nature 479 22080953 10.1038/nature10540 23. Tang H Facilitating T cell infiltration in tumor microenvironment overcomes resistance to PD-L1 blockade Cancer Cell 2016 30 500 27622338 10.1016/j.ccell.2016.08.011 Tang, H. et al. Facilitating T cell infiltration in tumor microenvironment overcomes resistance to PD-L1 blockade. Cancer Cell 30 27622338 10.1016/j.ccell.2016.08.011 24. Allen, E. et al. Combined antiangiogenic and anti-PD-L1 therapy stimulates tumor immunity through HEV formation. Sci. Transl. Med. 10.1126/scitranslmed.aak9679 PMC5554432 28404866 25. Johansson-Percival A De novo induction of intratumoral lymphoid structures and vessel normalization enhances immunotherapy in resistant tumors Nat. Immunol. 2017 18 1207 1217 28892469 10.1038/ni.3836 Johansson-Percival, A. et al. De novo induction of intratumoral lymphoid structures and vessel normalization enhances immunotherapy in resistant tumors. Nat. Immunol. 18 28892469 10.1038/ni.3836 26. Asrir A Tumor-associated high endothelial venules mediate lymphocyte entry into tumors and predict response to PD-1 plus CTLA-4 combination immunotherapy Cancer Cell 2022 40 318 334 35120598 10.1016/j.ccell.2022.01.002 Asrir, A. et al. Tumor-associated high endothelial venules mediate lymphocyte entry into tumors and predict response to PD-1 plus CTLA-4 combination immunotherapy. Cancer Cell 40 35120598 10.1016/j.ccell.2022.01.002 27. Hua Y Cancer immunotherapies transition endothelial cells into HEVs that generate TCF1 + Cancer Cell 2022 40 1600 1618 36423635 10.1016/j.ccell.2022.11.002 PMC9899876 Hua, Y. et al. Cancer immunotherapies transition endothelial cells into HEVs that generate TCF1 + Cancer Cell 40 36423635 10.1016/j.ccell.2022.11.002 PMC9899876 28. Ramachandran M Tailoring vascular phenotype through AAV therapy promotes anti-tumor immunity in glioma Cancer Cell 2023 41 1134 1151 37172581 10.1016/j.ccell.2023.04.010 Ramachandran, M. et al. Tailoring vascular phenotype through AAV therapy promotes anti-tumor immunity in glioma. Cancer Cell 41 37172581 10.1016/j.ccell.2023.04.010 29. Li T Chen ZJ The cGAS-cGAMP-STING pathway connects DNA damage to inflammation, senescence, and cancer J. Exp. Med. 2018 215 1287 1299 29622565 10.1084/jem.20180139 PMC5940270 Li, T. & Chen, Z. J. The cGAS-cGAMP-STING pathway connects DNA damage to inflammation, senescence, and cancer. J. Exp. Med. 215 29622565 10.1084/jem.20180139 PMC5940270 30. Khoo, L. T. & Chen, L. Y. Role of the cGAS-STING pathway in cancer development and oncotherapeutic approaches. EMBO Rep. 10.15252/embr.201846935 PMC6280650 30446584 31. Marcus A Tumor-derived cGAMP triggers a STING-mediated interferon response in non-tumor cells to activate the NK cell response Immunity 2018 49 754 763 30332631 10.1016/j.immuni.2018.09.016 PMC6488306 Marcus, A. et al. Tumor-derived cGAMP triggers a STING-mediated interferon response in non-tumor cells to activate the NK cell response. Immunity 49 30332631 10.1016/j.immuni.2018.09.016 PMC6488306 32. Yum, S., Li, M., Fang, Y. & Chen, Z. J. TBK1 recruitment to STING activates both IRF3 and NF-kappaB that mediate immune defense against tumors and viral infections. Proc. Natl Acad. Sci. USA 10.1073/pnas.2100225118 PMC8040795 33785602 33. Chelvanambi, M., Fecek, R. J., Taylor, J. L. & Storkus, W. J. STING agonist-based treatment promotes vascular normalization and tertiary lymphoid structure formation in the therapeutic melanoma microenvironment. J. Immunother. Cancer 10.1136/jitc-2020-001906 PMC7852948 33526609 34. Sawada J Molecular signature of tumor-associated high endothelial venules that can predict breast cancer survival Cancer Immunol. Res. 2022 10 468 481 35201289 10.1158/2326-6066.CIR-21-0369 PMC8976767 Sawada, J. et al. Molecular signature of tumor-associated high endothelial venules that can predict breast cancer survival. Cancer Immunol. Res. 10 35201289 10.1158/2326-6066.CIR-21-0369 PMC8976767 35. Michaelis KA The TLR7/8 agonist R848 remodels tumor and host responses to promote survival in pancreatic cancer Nat. Commun. 2019 10 4682 31615993 10.1038/s41467-019-12657-w PMC6794326 Michaelis, K. A. et al. The TLR7/8 agonist R848 remodels tumor and host responses to promote survival in pancreatic cancer. Nat. Commun. 10 31615993 10.1038/s41467-019-12657-w PMC6794326 36. Shimizu J Yamazaki S Sakaguchi S Induction of tumor immunity by removing CD25 + + J. Immunol. 1999 163 5211 5218 10553041 Shimizu, J., Yamazaki, S. & Sakaguchi, S. Induction of tumor immunity by removing CD25 + + J. Immunol. 163 10553041 37. Koch MA T-bet + reg H Immunity 2012 37 501 510 22960221 10.1016/j.immuni.2012.05.031 PMC3501343 Koch, M. A. et al. T-bet + reg H Immunity 37 22960221 10.1016/j.immuni.2012.05.031 PMC3501343 38. Leonard, W. J. & Wan, C. K. IL-21 signaling in immunity. F1000Research 10.12688/f1000research.7634.1 PMC4770986 26966515 39. Hao D The single-cell immunogenomic landscape of B and plasma cells in early-stage lung adenocarcinoma Cancer Discov. 2022 12 2626 2645 36098652 10.1158/2159-8290.CD-21-1658 PMC9633381 Hao, D. et al. The single-cell immunogenomic landscape of B and plasma cells in early-stage lung adenocarcinoma. Cancer Discov. 12 36098652 10.1158/2159-8290.CD-21-1658 PMC9633381 40. Fooksman DR Jing Z Park R New insights into the ontogeny, diversity, maturation and survival of long-lived plasma cells Nat. Rev. Immunol. 2024 24 461 470 38332373 10.1038/s41577-024-00991-0 Fooksman, D. R., Jing, Z. & Park, R. New insights into the ontogeny, diversity, maturation and survival of long-lived plasma cells. Nat. Rev. Immunol. 24 38332373 10.1038/s41577-024-00991-0 41. Junttila IS Tuning the cytokine responses: an update on interleukin (IL)-4 and IL-13 receptor complexes Front. Immunol. 2018 9 888 29930549 10.3389/fimmu.2018.00888 PMC6001902 Junttila, I. S. Tuning the cytokine responses: an update on interleukin (IL)-4 and IL-13 receptor complexes. Front. Immunol. 9 29930549 10.3389/fimmu.2018.00888 PMC6001902 42. Spellberg B Edwards JE Jr. Type 1/type 2 immunity in infectious diseases Clin. Infect. Dis. 2001 32 76 102 11118387 10.1086/317537 Spellberg, B. & Edwards, J. E. Jr. Type 1/type 2 immunity in infectious diseases. Clin. Infect. Dis. 32 11118387 10.1086/317537 43. Zehn D Thimme R Lugli E de Almeida GP Oxenius A Stem-like’ precursors are the fount to sustain persistent CD8 + Nat. Immunol. 2022 23 836 847 35624209 10.1038/s41590-022-01219-w Zehn, D., Thimme, R., Lugli, E., de Almeida, G. P. & Oxenius, A. Stem-like’ precursors are the fount to sustain persistent CD8 + Nat. Immunol. 23 35624209 10.1038/s41590-022-01219-w 44. Zhou X Differentiation and persistence of memory CD8 + Immunity 2010 33 229 240 20727791 10.1016/j.immuni.2010.08.002 PMC2928475 Zhou, X. et al. Differentiation and persistence of memory CD8 + Immunity 33 20727791 10.1016/j.immuni.2010.08.002 PMC2928475 45. Kok L Masopust D Schumacher TN The precursors of CD8 + Nat. Rev. Immunol. 2022 22 283 293 34480118 10.1038/s41577-021-00590-3 PMC8415193 Kok, L., Masopust, D. & Schumacher, T. N. The precursors of CD8 + Nat. Rev. Immunol. 22 34480118 10.1038/s41577-021-00590-3 PMC8415193 46. Beltra JC Developmental relationships of four exhausted CD8 + Immunity 2020 52 825 841 32396847 10.1016/j.immuni.2020.04.014 PMC8360766 Beltra, J. C. et al. Developmental relationships of four exhausted CD8 + Immunity 52 32396847 10.1016/j.immuni.2020.04.014 PMC8360766 47. Meylan M Tertiary lymphoid structures generate and propagate anti-tumor antibody-producing plasma cells in renal cell cancer Immunity 2022 55 527 541 35231421 10.1016/j.immuni.2022.02.001 Meylan, M. et al. Tertiary lymphoid structures generate and propagate anti-tumor antibody-producing plasma cells in renal cell cancer. Immunity 55 35231421 10.1016/j.immuni.2022.02.001 48. Delvecchio FR Pancreatic cancer chemotherapy is potentiated by induction of tertiary lymphoid structures in mice Cell Mol. Gastroenterol. Hepatol. 2021 12 1543 1565 34252585 10.1016/j.jcmgh.2021.06.023 PMC8529396 Delvecchio, F. R. et al. Pancreatic cancer chemotherapy is potentiated by induction of tertiary lymphoid structures in mice. Cell Mol. Gastroenterol. Hepatol. 12 34252585 10.1016/j.jcmgh.2021.06.023 PMC8529396 49. Stavnezer J Kang J The surprising discovery that TGF beta specifically induces the IgA class switch J. Immunol. 2009 182 5 7 19109126 10.4049/jimmunol.182.1.5 Stavnezer, J. & Kang, J. The surprising discovery that TGF beta specifically induces the IgA class switch. J. Immunol. 182 19109126 10.4049/jimmunol.182.1.5 50. Ng KW Antibodies against endogenous retroviruses promote lung cancer immunotherapy Nature 2023 616 563 573 37046094 10.1038/s41586-023-05771-9 PMC10115647 Ng, K. W. et al. Antibodies against endogenous retroviruses promote lung cancer immunotherapy. Nature 616 37046094 10.1038/s41586-023-05771-9 PMC10115647 51. Im SJ Characteristics and anatomic location of PD-1 + + Proc. Natl Acad. Sci. USA 2023 120 e2221985120 37782797 10.1073/pnas.2221985120 PMC10576122 Im, S. J. et al. Characteristics and anatomic location of PD-1 + + Proc. Natl Acad. Sci. USA 120 37782797 10.1073/pnas.2221985120 PMC10576122 52. Steiner C Denlinger N Huang X Yang Y Stem-like CD8 + Front Immunol. 2024 15 1426418 39211052 10.3389/fimmu.2024.1426418 PMC11357971 Steiner, C., Denlinger, N., Huang, X. & Yang, Y. Stem-like CD8 + Front Immunol. 15 39211052 10.3389/fimmu.2024.1426418 PMC11357971 53. Denton AE Type I interferon induces CXCL13 to support ectopic germinal center formation J. Exp. Med. 2019 216 621 637 30723095 10.1084/jem.20181216 PMC6400543 Denton, A. E. et al. Type I interferon induces CXCL13 to support ectopic germinal center formation. J. Exp. Med. 216 30723095 10.1084/jem.20181216 PMC6400543 54. Rangel-Moreno J Moyron-Quiroz JE Hartson L Kusser K Randall TD Pulmonary expression of CXC chemokine ligand 13, CC chemokine ligand 19, and CC chemokine ligand 21 is essential for local immunity to influenza Proc. Natl Acad. Sci. USA 2007 104 10577 10582 17563386 10.1073/pnas.0700591104 PMC1965555 Rangel-Moreno, J., Moyron-Quiroz, J. E., Hartson, L., Kusser, K. & Randall, T. D. Pulmonary expression of CXC chemokine ligand 13, CC chemokine ligand 19, and CC chemokine ligand 21 is essential for local immunity to influenza. Proc. Natl Acad. Sci. USA 104 17563386 10.1073/pnas.0700591104 PMC1965555 55. Amouzegar, A., Chelvanambi, M., Filderman, J. N., Storkus, W. J. & Luke, J. J. STING agonists as cancer therapeutics. Cancers 10.3390/cancers13112695 PMC8198217 34070756 56. Chin EN Sulpizio A Lairson LL Targeting STING to promote antitumor immunity Trends Cell Biol. 2023 33 189 203 35931610 10.1016/j.tcb.2022.06.010 Chin, E. N., Sulpizio, A. & Lairson, L. L. Targeting STING to promote antitumor immunity. Trends Cell Biol. 33 35931610 10.1016/j.tcb.2022.06.010 ",
  "metadata": {
    "Title of this paper": "Targeting STING to promote antitumor immunity",
    "Journal it was published in:": "Nature Immunology",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12479350/"
  }
}