{
  "title": "Paper_747",
  "abstract": "pmc Biomolecules Biomolecules 2397 biomol biomolecules Biomolecules 2218-273X Multidisciplinary Digital Publishing Institute  (MDPI) PMC12467234 PMC12467234.1 12467234 12467234 41008582 10.3390/biom15091275 biomolecules-15-01275 1 Article Label-Free and Ultrasensitive APE1 Detection Based on Hybridization Chain Reaction Combined with G-Quadruplex Zhang Yarong Conceptualization Software Investigation Writing – original draft 1 † Ma Hongyan Conceptualization Software Investigation Writing – original draft Supervision 1 † Gao Zhenyao Software Validation Formal analysis 2 Li Miao Software Validation Formal analysis 1 Yang Fan Software Validation Formal analysis 1 https://orcid.org/0000-0002-0991-9342 Sun Lingbo Resources Supervision 2 https://orcid.org/0000-0003-4717-0341 Zhang Yuecheng Resources Data curation Writing – review & editing Supervision 1 * Qi Yalin Academic Editor 1 2 * yuechengzhang@yau.edu.cn † These authors contributed equally to this work. 03 9 2025 9 2025 15 9 497615 1275 25 7 2025 28 8 2025 01 9 2025 03 09 2025 27 09 2025 29 09 2025 © 2025 by the authors. 2025 https://creativecommons.org/licenses/by/4.0/ Licensee MDPI, Basel, Switzerland. This article is an open access article distributed under the terms and conditions of the Creative Commons Attribution (CC BY) license ( https://creativecommons.org/licenses/by/4.0/ Apurinic/apyrimidinic endonuclease 1 (APE1) selectively cleaves the apurinic/apyrimidinic site (AP site) in DNA, playing a critical role in base excision repair and genomic stability maintenance. Aberrant APE1 expression has been linked to numerous diseases, including cardiovascular disorders, neurological conditions, and various cancers. However, existing methods for detecting trace levels of APE1 remain suboptimal for certain applications. To address this limitation, we developed an innovative biosensing platform for ultrasensitive APE1 detection by integrating APE1-specific site recognition with hybridization chain reaction (HCR)-based signal amplification, enabling enzyme- and label-free bioassays. In this system, APE1 recognizes and cleaves the AP site-containing hairpin (HP) probe, releasing a single-stranded HCR initiator that triggers cascaded HCR amplification. Owing to the high efficiency of HCR, this method achieves ultrahigh sensitivity, with a calculated detection limit of 1.0 × 10 −8 apurinic/apyrimidinic endonuclease 1 (APE1) hybridization chain reaction (HCR) G-quadruplex fluorescence National Natural Science Foundation of China 22264023 Natural Science Foundation of Shaanxi Province 2024JC-YBQN-0150 PhD start-up fund of Yan’an University YDBK2022-15 Health Research Project of Shaanxi Province 2022E019 This work was supported by the National Natural Science Foundation of China (22264023); Natural Science Foundation of Shaanxi Province (2024JC-YBQN-0150); PhD start-up fund of Yan’an University (YDBK2022-15) and Health Research Project of Shaanxi Province (2022E019). pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement yes pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes 1. Introduction Apurinic/apyrimidinic endonuclease 1 (APE1) is a multifunctional protein that plays a pivotal role in DNA repair and transcriptional regulation in humans [ 1 2 3 4 5 6 7 8 9 10 Conventional methods for APE1 detection, including polyacrylamide gel electrophoresis (PAGE) [ 11 12 13 14 −4 15 16 The hybridization chain reaction (HCR) is an enzyme-free, catalytic DNA circuit that operates through toehold-mediated strand displacement [ 17 18 Thioflavin T (ThT) is a fluorescent probe initially developed for detecting misfolded proteins [ 19 20 21 In this work, we developed a novel fluorescent assay for ultrasensitive APE1 detection. By synergistically combining the cascade signal amplification of HCR with the strong fluorescence enhancement from ThT-G-quadruplex conjugation, this method achieves exceptional sensitivity, surpassing most existing APE1 assays by at least two orders of magnitude. Such superior performance enables precise determination of APE1 activity at the single-cell level, underscoring its potential for advanced biomedical research and clinical diagnostics. 2. Experimental 2.1. Cell Lines Human breast cancer cell line MCF-7, lung cancer cell line A549, gastric cancer cell line AGS, embryonic kidney cells line 293T and gastric epithelium cell line GES-1 were obtained from the cell bank of Yan’an university medical experimental research center. MCF-7 cells were cultured in DMEM medium supplemented with 10% fetal bovine serum (FBS), 1% glutamine and 1% penicillin streptomycin (PEST). AGS, 293T and GES-1 cells were cultured in DMEM medium supplemented with 10% FBS and 1% PEST. A549 cells were cultured in RPMI-1640 medium supplemented with 10% FBS and 1% PEST. All the cell lines were cultured at 37 °C with 5% CO 2 2.2. Materials and Reagents APE1 and 10× NEBuffer 4 (20 mM Tris-acetic acid, 50 mM potassium acetate, 10 mM magnesium acetate, 1 mM dithiothreitol (PH = 7.9)) were purchased from New England Biolabs (Ipswich, MA, USA). The ThT and sodium cefotaxime were obtained from Shanghai Aladdin Biochemical Technology Co., Ltd. (Shanghai, China). Various enzymes including (Bgl II, Not I, Hind III, Sac I, EcoR I) were purchased from Takara Biotechnology. Exonuclease III (Exo III) and Endonuclease IV (Endo IV) were obtained from Beyotime Biotechnology. Water was purified by Milli-Q filtration system, and all reagents were analytical grade and used as received. The DNA oligonucleotides used in this experiment were synthesized and purified by Sangon Biotech (Shanghai, China), and the details of the DNA oligonucleotide sequences are shown in ( Table 1 Table 1 2.3. Standard Procedure for APE1 Determination First, the synthesized H1, H2, and HP probe were incubated at 95 °C for 5 min, and then slowly cooled to room temperature to form a stable hairpin structure. For standard APE1 determination, a 20 µL mixture containing HP (2 µL, 1 µM), H1 (2 µL, 2.5 µM), H2 (2 µL, 2.5 µM), 10× NEBuffer 4 (2 µL), ThT (2 µL, 50 µM) and varying concentrations of APE1 were incubated at 37 °C for 30 min. The samples without APE1 treatment were used as the control sample. After incubation, the reaction system was diluted with 50 µL of water, and the fluorescence intensity was immediately measured using a photoluminescence spectrometer (FLSP920, Edinburgh Instruments, Livingston, UK). Under excitation at 445 nm, the emission spectrum was acquired over the wavelength range of 455–580 nm, and the fluorescence intensity recorded at 485 nm was used for subsequent quantitative analysis. 2.4. Specificity of the Proposed APE1 Assay In specificity evaluation, 1.0 × 10 −5 −5 −5 2.5. Inhibition of the APE1 Detection Assay In the APE1 inhibitor assay, two model compounds, 7-nitroindole-2-carboxylic acid (NCA) and cefotaxime sodium, were used in this work to investigate the effects of inhibitors on the APE1-catalyzed DNA cleavage. The inhibition studies were carried out with similar procedures to those used for the standard APE1 determination assay stated above except that the inhibitor with varied concentrations were introduced into the reaction system. 2.6. Polyacrylamide Gel Electrophoresis (PAGE) Analysis Different DNA solutions (10 µL per tube) mixed with 2 µL 6× loading buffer, which were then injected into 24% polyacrylamide hydrogel in 1× Tris-Borate-EDTA (TBE) buffer. Electrophoresis was performed at a constant voltage of 180 V for 90 min. Subsequently, the gel was stained with 4S Red Plus and visualized using a Syngene GBox imaging system (Syngene, Cambridge, UK). 2.7. Statistical Analysis All quantitative experiments were performed in at least three independent replicates ( n t p p p p p 3. Results and Discussions 3.1. The Principle of Proposed Method for APE1 Activity Detection The working principle of the proposed APE1 activity analysis assay is shown in Scheme 1 17 3.2. Feasibility of the Proposed APE1 Assay To verify the feasibility of this proposed method, the fluorescence emission spectrums of different samples were first recorded. As observed in Figure 1 Figure 1 3.3. Optimization of Experimental Parameters To achieve the optimal analytical performance, related experimental parameters were systematically optimized. Since the structure and position of the AP site in HP significantly influence APE1’s hydrolysis activity, we first investigated how different AP site configurations affect enzymatic incision efficiency and detection sensitivity. Firstly, by keeping the sequence of AP site, the complementary sequence with four different base combinations (A A T C G Figure 2 A Figure 2 Figures S1–S3 3.4. Analytical Performance of the Proposed APE1 Assay Under optimal conditions, the detection performance of the proposed assay for APE1 was evaluated. Different concentration of APE1 was added into the proposed system and tested using a fluorescence spectrophotometer. As shown in Figure 3 −4 Figure 3 −8 −6 I 485 C APE1 R 2 −8 σ k Table 2 −6 −4 Figure S4 −5 −8 3.5. Specificity, Repeatability, and Stability of the Proposed APE1 Assay Specificity represents a crucial performance metric for analytical methods. To evaluate the specificity of our assay, we challenged the system with various potential interferents, including Exo III, Endo IV, BgI II, Not I, Hind III, Sac I, EcoR I and inactivated APE1. As demonstrated in Figure 4 In addition to sensitivity and specificity, we rigorously evaluated the repeatability and stability of this bioassay. For repeatability testing, intraday measurements of APE1 at three concentrations (1.0 × 10 −7 −6 −5 Figure S5 −5 Figure S6 3.6. Application of the Proposed Assay in Actual Samples Furthermore, a practical bioassay should be applicable for target analysis in complex biological samples. To evaluate the robustness of the proposed method, we further investigate its analytical performance for APE1 determination in cell lysates. Initial validation employed gastric cancer (AGS) cell lysates with cell counts ranging from 0 to 20,000. As shown in Figure 5 Figure S7 Figure 5 Figure S8 To validate the assay’s accuracy, we performed standard addition recovery tests using cell lysate from two prototypical cell lines: GES-1 (10,000 cells, representing a normal cell line) and AGS (500 cells, representing a cancer cell line). The endogenous APE1 activities were determined to be 2.00 × 10 −7 −7 Table 3 −7 −7 −7 −7 −7 −7 −8 −7 −7 3.7. APE1 Inhibition Assay It is well-established that APE1 serves as a promising therapeutic target in oncology. As the indispensable endonuclease in the base BER pathway, APE1 overexpression is frequently associated with enhanced DNA repair capacity, tumor progression, and acquired resistance to DNA-damaging chemotherapeutic agents such as temozolomide and cisplatin. Consequently, the development of effective APE1 inhibitors represents a compelling strategy for sensitizing cancer cells to conventional treatments by disrupting this critical repair mechanism and tipping the cellular balance toward apoptosis. [ 16 −5 Figure 6 Figure S9 50 3.8. Evolution Towards Point-of-Care Diagnostics While the current homogeneous format of the assay lends itself well to high-throughput screening applications, its dependence on fluorescence readout limits its utility in point-of-care settings. To broaden its diagnostic applicability, future work could focus on integrating a colorimetric readout strategy. For instance, engineering the HCR products to form G-quadruplex structures would allow subsequent binding with hemin to create DNAzyme mimics with peroxidase-like activity. These DNAzymes can catalyze the oxidation of substrates such as TMB (3,3′,5,5′-Tetramethylbenzidine), producing a visible color change detectable by the naked eye or simple portable devices. This modification would enable instrument-free visual detection, significantly enhancing the platform’s suitability for resource-limited environments. Furthermore, the inherent stability of synthetic DNA components ensures long-term viability, providing excellent prospects for practical deployment. 4. Conclusions In summary, we have developed an ultra-sensitive and selective biosensor for APE1 activity detection based on a structurally optimized HP probe combined with HCR and ThT-assisted signal amplification. This assay offers multiple advantages. Firstly, strategic optimization of the HP probe’s AP site structure and localization markedly improved APE1 enzymatic activity, resulting in optimal signal amplification efficiency. Secondly, the highly efficient APE1-mediated cleavage coupled with subsequent HCR creates a robust signal augmentation effect. Thirdly, leveraging the pronounced fluorescence enhancement from ThT-G-quadruplex interactions enabled the development of a highly reliable, sensitive, and selective APE1 detection platform. This biosensor has been successfully applied to measure APE1 activity in complex biological samples and screen potential APE1 inhibitors, demonstrating significant promise for cancer diagnosis and APE1-targeted drug development. Disclaimer/Publisher’s Note: Supplementary Materials The following supporting information can be downloaded at: https://www.mdpi.com/article/10.3390/biom15091275/s1 Author Contributions Y.Z. (Yarong Zhang): Writing—original draft, Software, Investigation, Conceptualization. H.M.: Writing—original draft, Software, Investigation, Conceptualization, Supervision. Z.G.: Validation, Software, Formal analysis. M.L.: Validation, Software, Formal analysis. F.Y.: Validation, Software, Formal analysis. L.S.: Supervision, Resources. Y.Z. (Yuecheng Zhang): Writing —review and editing, Supervision, Resources, Data curation. All authors have read and agreed to the published version of the manuscript. Institutional Review Board Statement Not applicable. Informed Consent Statement Not applicable. Data Availability Statement The original contributions presented in this study are included in the article. Further inquiries can be directed to the corresponding author. Conflicts of Interest The authors declare no conflicts of interest. References 1. Chou K.M. Cheng Y.C. An exonucleolytic activity of human apurinic/apyrimidinic endonuclease on 3' mispaired DNA Nature 2002 415 655 659 10.1038/415655a 11832948 2. Lindahl T. Wood R.D. Quality control by DNA repair Science 1999 286 1897 1905 10.1126/science.286.5446.1897 10583946 3. Robson C.N. Hickson I.D. Isolation of cDNA clones encoding a human apurinic/apyrimidinic endonuclease that corrects DNA repair and mutagenesis defects in E.coli xth (exonuclease III) mutants Nucleic Acids Res. 1991 19 5519 5523 10.1093/nar/19.20.5519 1719477 PMC328951 4. Demple B. Herman T. Chen D.S. Cloning and expression of APE, the cDNA encoding the major human apurinic endonuclease: Definition of a family of DNA repair enzymes Proc. Natl. Acad. Sci. USA 1991 88 11450 11454 10.1073/pnas.88.24.11450 1722334 PMC53153 5. Chen D.S. Herman T. Demple B. Two distinct human DNA diesterases that hydrolyze 30-blocking deoxyribose fragments from oxidized DNA Nucleic Acids Res. 1991 19 5907 5914 10.1093/nar/19.21.5907 1719484 PMC329046 6. Robson C.N. Hochhauser D. Craig R. Rack K. Buckle V.J. Hickson I.D. Structure of the human DNA repair gene HAP1 and its localisation to chromosome 14q 11.2–12 Nucleic Acids Res. 1992 20 4417 4421 10.1093/nar/20.17.4417 1383925 PMC334166 7. Barzilay G. Hickson I.D. Structure and function of apurinic/apyrimidinic endonucleases BioEssays 1995 17 713 719 10.1002/bies.950170808 7661852 8. Abdel-Fatah T.M. Perry C. Moseley P. Johnson K. Arora A. Chan S. Ellis I.O. Madhusudan S. Clinicopathological significance of human apurinic/apyrimidinic endonuclease 1 (APE1) expression in oestrogen-receptor-positive breast cancer Breast Cancer Res. Treat. 2014 143 411 421 10.1007/s10549-013-2820-7 24381055 9. Zhou X.M. Zhuo Y. Tu T.T. Yuan R. Chai Y.Q. Construction of fast-walking tetrahedral DNA walker with four arms for sensitive detection and intracellular imaging of apurinic/apyrimidinic endonuclease 1 Anal. Chem. 2022 94 8732 8739 10.1021/acs.analchem.2c01171 35678832 10. Fan X. Wen L. Li Y. Lou L. Liu W. Zhang J. The expression profile and prognostic value of APE/Ref-1 and NPM1 in high-grade serous ovarian adenocarcinoma APMIS 2017 125 857 862 10.1111/apm.12733 28766835 11. Kumari B. Banerjee S.S. Singh V. Das P. Bhowmick A.K. Processing of abasic site damaged lesions by APE1 enzyme on DNA adsorbed over normal and organomodified clay Chemosphere 2014 112 503 510 10.1016/j.chemosphere.2014.05.022 25048946 12. Dai N. Cao X.J. Li M.X. Qing Y. Liao L. Lu X.F. Zhang S.H. Li Z. Yang Y.X. Wang D. Serum APE1 autoantibodies: A novel potential tumor marker and predictor of chemotherapeutic efficacy in non-small cell lung cancer PLoS ONE 2013 8 e58001 10.1371/journal.pone.0058001 23472128 PMC3589448 13. Coskun E. Jaruga P. Reddy P.T. Dizdaroglu M. Extreme Expression of DNA Repair Protein Apurinic/Apyrimidinic Endonuclease 1 (APE1) in Human Breast Cancer As Measured by Liquid Chromatography and Isotope Dilution Tandem Mass Spectrometry Biochemistry 2015 54 5787 5790 10.1021/acs.biochem.5b00928 26359670 14. Zhuo Y. Liao N. Chai Y.Q. Gui G.F. Zhao M. Han J. Xiang Y. Yuan R. Ultrasensitive Apurinic/Apyrimidinic Endonuclease 1 Immunosensing Based on Self-Enhanced Electrochemiluminescence of a Ru(II) Complex Anal. Chem. 2013 86 1053 1060 10.1021/ac403019e 24328308 15. Kang Q. Yang X.Y. Du Y.M. He Z.Q. Xiang H. A molecular gated HRCA quick sensing system intelligently controlled by APE1 Microchem. J. 2023 191 108880 10.1016/j.microc.2023.108880 16. Hu Y.Q. Zhang Z. Ye W.C. Zhang W. Hu M.H. Yuan W.Q. Wang H.B. Xiao X.J. Wu T.B. A DNA structure-mediated fluorescent biosensor for apurinic/apyrimidinic endonuclease 1 activity detection with ultra-high sensitivity and selectivity Sens. Actuators B Chem. 2021 330 129332 10.1016/j.snb.2020.129332 17. Qi H.J. Li H.Y. Li F. N-heterocyclic Ir(III) complex targeting G-quadruplex structure to boost label-free and immobilization-free electrochemiluminescent sensing Biosens. Bioelectron. 2023 220 114839 10.1016/j.bios.2022.114839 36327903 18. Dirks R.M. Pierce N.A. Triggered amplification by hybridization chain reaction Proc. Natl. Acad. Sci. USA 2004 101 15275 15278 10.1073/pnas.0407024101 15492210 PMC524468 19. Levine H. Thioflavine T interaction with synthetic Alzheimer’s disease bamyloid peptides: Detection of amyloid aggregation in solution Protein Sci. 1993 2 404 410 10.1002/pro.5560020312 8453378 PMC2142377 20. Haidekker M.A. Theodorakis E.A. Molecular rotors-fluorescent biosensors for viscosity and flow Org. Biomol. Chem. 2007 5 1669 1678 10.1039/B618415D 17520133 21. Mohanty J. Barooah N. Dhamodharan V. Harikrisshna S. Pradeepkumar P.L. Bhasikuttan A.C. Thioflavin T as an efficient inducer and selective fluorescent sensor for the human telomeric G-quadruplex DNA J. Am. Chem. Soc. 2013 135 367 376 10.1021/ja309588h 23215453 22. Zhou S.Y. Li X.R. Shu X.J. Cai X.Y. Wu H.P. Ding S.J. Yan Y.R. An all-in-one enzymatic DNA network based on catalytic hairpin assembly for label-free and highly sensitive detection of APE1 Anal. Chim. Acta 2023 1278 341678 10.1016/j.aca.2023.341678 37709426 23. Huang X.D. He Z.N. Zhou K.J. Zhi H.Z. Yang J.F. Fabrication of bifunctional G-quadruplex-hemin DNAzymes for colorimetric detection of apurinic/apyrimidinic endonuclease 1 and microRNA-21 Analyst 2021 146 7379 7385 10.1039/D1AN01603B 34816841 24. Li J.Y. Heng H. Lv J.L. Jiang T.T. Wang Z.Y. Dai Z.H. Graphene oxide-assisted and DNA-modulated SERS of AuCu alloy for the fabrication of apurinic/apyrimidinic endonuclease 1 biosensor Small 2019 15 1901506 10.1002/smll.201901506 31062520 25. Wang X.C. Meng J.T. Zhang H.P. Mou J.Y. Xiong J.P. Wang H. Su X. Zhang Y.W. Electrochemical biosensor based on bipedal DNA walker for highly sensitive amplification detection of apurinic/apyrimidinic endonuclease 1 Sens. Actuators B Chem. 2023 381 133425 10.1016/j.snb.2023.133425 26. Zhou M.R. Feng C. Mao D.S. Yang S.Q. Ren L.J. Chen G.F. Zhu X.L. An electrochemical biosensor integrating immunoassay and enzyme activity analysis for accurate detection of active human apurinic/apyrimidinic endonuclease 1 Biosens. Bioelectron. 2019 142 111558 10.1016/j.bios.2019.111558 31387027 27. Chen X.L. Cao G.H. Zhang J.J. Deng Y.Y. Luo X.G. Yang M. Huo D.Q. Hou C.J. An ultrasensitive and point-of-care strategy for enzyme activity detection based on enzyme extends activators to unlock the ssDNase activity of CRISPR/Cas12a (EdU-CRISPR/Cas12a) Sens. Actuators B Chem. 2021 333 129553 10.1016/j.snb.2021.129553 28. Han J. Zhuo Y. Chai Y.Q. Xiang Y. Yuan R. Yuan Y.L. Liao N. Ultrasensitive electrochemical strategy for trace detection of APE-1 via triple signal amplification strategy Biosens. Bioelectron. 2013 41 116 122 10.1016/j.bios.2012.07.082 22981009 29. Song Y. Long J. Wang H. Tang W.Y. Yang W. Zheng Y. Yuan R. Zhang D.C. Gu B. Nian W.Q. High-efficiency detection of APE1 using a defective PAM-driven CRISPR-Cas12a self-catalytic biosensor Biosens. Bioelectron. 2025 279 117410 10.1016/j.bios.2025.117410 40157150 30. Chai Q.L. Chen J.Y. Zeng S.S. Zhu T. Chen J.T. Qi C.J. Mao G.B. Liu Y.C. Closed Cyclic DNA Machine for Sensitive Logic Operation and APE1 Detection Small 2023 19 e2207736 10.1002/smll.202207736 36916696 31. Liu B.R. Yang Z.Z. Huang T. Li M.M. Duan W.J. Xie B.P. Chen J.X. Dai Z. Chen J. Label-free and highly sensitive APE1 detection based on rolling circle amplification combined with G-quadruplex Talanta 2022 244 123404 10.1016/j.talanta.2022.123404 35349840 Figures, Scheme and Tables Figure 1 The feasibility of the proposed method. ( A B Figure 2 Optimization of experimental conditions. ( A A T C G B C D n Figure 3 Detection performance analysis. ( A −8 −7 −7 −7 −7 −6 −6 −6 −5 −5 −4 B n Figure 4 Specific analysis. ( A B n Figure 5 APE1 activity in biological samples. ( A B C D n Figure 6 Inhibitor analysis. ( A B n t p biomolecules-15-01275-sch001_Scheme 1 Scheme 1 Schematic illustration of the ultrasensitive fluorescence biosensing platform for APE1 activity detection based on HCR and G-quadruplex amplification. The mechanism involves the following steps: (1) HP Cleavage: The HP contains AP site, which is specifically recognized and cleaved by the target enzyme APE1. This cleavage event releases a single-stranded HCR initiator sequence (green). (2) HCR Amplification: The liberated initiator (green) sequentially opens two stable hairpin probes, H1 and H2, via toehold-mediated strand displacement. This triggers a cascade of hybridization events, self-assembling long nicked double-stranded DNA polymers with numerous protruding G-quadruplex sequences (yellow). (3) Fluorescence signal enhancement: The fluorescent dye, ThT (green star), binds to the assembled G-quadruplex structures, resulting in a significant enhancement of fluorescence intensity. This light-up signal is directly proportional to the concentration of APE1 activity. biomolecules-15-01275-t001_Table 1 Table 1 Sequences of oligonucleotides used in the present work a Name Sequence (5′-3′) H1 TGGGTTTAATCT CCTGACACTCA TGAGTGTCAGG H2 AGGGCGGGTG GGTTGAGTGTCA TGACACTCAACC HCR initiator TGAGTGTCAGGAGATTAATCACTCAATAGCA HP TGCTA X TGAGTG CACTCA A HP-T TGCTA X CACTCA T HP-C TGCTA X CACTCA C HP-G TGCTA X CACTCA G A-2 TA X CACTCA A A-3 CTA X CACTCA A A-7 ATTGCTA X CACTCA A A-9 AGATTGCTA X CACTCA A a biomolecules-15-01275-t002_Table 2 Table 2 Comparison of the analytical performance of various methods for APE1 detection. Strategy Detection Mode Linear Range (U/mL) LOD (U/mL) Ref. HRCA Fluorescence 0.0001–0.2 1.0 × 10 −4 [ 15 TdT/Endo IV Fluorescence 2.0 × 10 −6 1.7 × 10 −6 [ 16 CHA Fluorescence 5.0 × 10 −6 4.78 × 10 −6 [ 22 DNAzymes Colorimetry 2.5–22.5 1.8 [ 23 AuCu/GO SERS 0.002–20 0.001 [ 24 CHA-HCR Electrochemical 0.001–1 0.001 [ 25 CHA Electrochemistry 0.01–4 0.005 [ 26 CRISPR/Cas12a Fluorescence 0.0025–25.0 2.5 × 10 −4 [ 27 Ni-AuNCs Electrochemical 8.6 × 10 −6 −2 3.34 × 10 −6 [ 28 DEP-Cas-APE Fluorescence 0.0001–1.0 7.66 × 10 −5 [ 29 HCR/CHA Fluorescence 0.0001–1.0 7.80 × 10 −5 [ 30 RCA/G-quadruplex Fluorescence 2.0 × 10 −6 1.52 × 10 −6 [ 31 DNA Walker/AuNPs Fluorescence 0.01–100 5.54 × 10 −3 [ 9 HCR Fluorescence 6.0 × 10 −8 −6 1.0 × 10 −8 This work biomolecules-15-01275-t003_Table 3 Table 3 Recovery results of the determination of APE1 in cell lysates ( n Sample Content/U/mL Added/U/mL Measured/U/mL Found/U/mL Recovery/% RSD/% GES-1 2.00 × 10 −7 1.00 × 10 −7 3.00 × 10 −7 1.00 × 10 −7 100.76 3.56 3.00 × 10 −7 4.91 × 10 −7 2.91 × 10 −7 97.29 2.32 5.00 × 10 −7 7.02 × 10 −7 5.02 × 10 −7 99.57 3.03 AGS 1.80 × 10 −7 1.00 × 10 −7 2.79 × 10 −7 9.89 × 10 −8 98.88 2.94 3.00 × 10 −7 4.82 × 10 −7 3.02 × 10 −7 100.89 3.04 5.00 × 10 −7 6.78 × 10 −7 4.98 × 10 −7 99.64 3.23 ",
  "metadata": {
    "Title of this paper": "Label-free and highly sensitive APE1 detection based on rolling circle amplification combined with G-quadruplex",
    "Journal it was published in:": "Biomolecules",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12467234/"
  }
}