{
  "title": "Paper_1250",
  "abstract": "pmc Int J Mol Sci Int J Mol Sci 808 ijms ijms International Journal of Molecular Sciences 1422-0067 Multidisciplinary Digital Publishing Institute  (MDPI) PMC12471192 PMC12471192.1 12471192 12471192 41009781 10.3390/ijms26189219 ijms-26-09219 1 Article Multiplexed Quantitation of Plasma Proteins by Targeted Mass Spectrometry for Early Diagnosis of Pancreatic Ductal Adenocarcinoma Korobkov Dmitry N. Conceptualization Investigation Writing – original draft Writing – review & editing 1 † Molodtsov Ivan A. Formal analysis Data curation Writing – original draft Writing – review & editing 2 † https://orcid.org/0000-0002-2238-3458 Kononikhin Alexey S. Methodology Formal analysis Investigation Writing – original draft Writing – review & editing 3 https://orcid.org/0000-0003-1515-9447 Bugrova Anna E. Methodology Data curation 3 4 https://orcid.org/0000-0002-8177-7449 Indeykina Maria I. Methodology Formal analysis Data curation 3 4 Brzhozovskiy Alexander G. Methodology Formal analysis Data curation 3 Kanner Dmitry Yu. Conceptualization Resources Writing – review & editing 1 Nikolaev Evgeny N. Conceptualization Resources Writing – review & editing Funding acquisition 3 * https://orcid.org/0000-0003-4111-0874 Vasilieva Elena Conceptualization Resources Writing – review & editing Funding acquisition 2 5 https://orcid.org/0000-0003-1018-5195 Komissarov Alexey A. Conceptualization Formal analysis Resources Writing – original draft Writing – review & editing Funding acquisition 2 5 * Yang Dongki Academic Editor 1 2 3 4 5 * ennikolaev@gmail.com komissarovlexa@yandex.ru † These authors contributed equally to this work. 21 9 2025 9 2025 26 18 497349 9219 29 8 2025 15 9 2025 19 9 2025 21 09 2025 27 09 2025 29 09 2025 © 2025 by the authors. 2025 https://creativecommons.org/licenses/by/4.0/ Licensee MDPI, Basel, Switzerland. This article is an open access article distributed under the terms and conditions of the Creative Commons Attribution (CC BY) license ( https://creativecommons.org/licenses/by/4.0/ Pancreatic cancer (PC) is the sixth leading cause of cancer-related deaths worldwide. Patients with pancreatic ductal adenocarcinoma (PDAC), the most common type of PC, have a 5-year survival rate of approximately 10%. This low survival rate is mainly attributed to late-stage diagnoses and the lack of robust screening methods. Several serum proteins have been proposed as potential PDAC biomarkers, but they have not been introduced into clinical practice due to their low sensitivity and specificity. Therefore, the identification of new PDAC biomarkers remains highly important, and multiple reaction monitoring (MRM), a highly accurate mass spectrometry (MS) technique, can be used for this purpose. Using MRM MS analysis, we estimated the concentrations of 103 proteins in peripheral blood plasma from 132 participants: patients with newly diagnosed PDAC at different stages and healthy individuals. We identified six proteins that were differentially presented between healthy controls and patients with PDAC at all stages (adjusted p pancreatic cancer pancreatic ductal adenocarcinoma (PDAC) diagnosis biomarkers proteomics mass spectrometry ANO “Moscow Center for Innovative Healthcare Technologies” 0103-9/23 This study was sponsored by a grant from ANO “Moscow Center for Innovative Healthcare Technologies” (research project No. 0103-9/23). pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement yes pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes 1. Introduction According to world-wide statistics, pancreatic cancer (PC) is one of the most aggressive cancers, as it is associated with a high annual number of deaths [ 1 2 3 4 1 2 3 4 To date, several serum proteins have been suggested as PDAC biomarkers, including serum carbohydrate antigen 19–9 (CA 19-9) [ 5 6 7 8 9 Multiple reaction monitoring (MRM) is a highly precise mass spectrometry (MS) technique used in proteomics to perform comprehensive quantitative analyses and validation of potential disease biomarkers [ 10 11 12 13 14 15 16 17 18 Here, using MRM MS analysis, we estimated the concentrations of 103 proteins in the peripheral blood plasma from patients with newly diagnosed PDAC at different stages and healthy individuals. We identified six proteins that are differentially presented between healthy controls and patients with stage I PDAC, and which are also associated with survival rates at 23 months post diagnosis. These proteins could potentially serve as early diagnostic and prognostic biomarkers for PDAC. 2. Results 2.1. Patients’ Characteristics and Follow-Up Survival In total, 132 participants have been enrolled in the study. Among them, there were 113 patients with newly diagnosed PDAC at different stages and 19 healthy controls. The tumor was localized mainly in the head (n = 76, 67.3%) and body (n = 29, 25.7%), and rarely in the tail (n = 8, 7.1%) of the pancreas. The majority of clinical parameters, including common confounders like age, sex, body mass index, etc., showed no statistically significant difference between the groups, while those that differed fell within the normal range ( Table 1 After the enrollment, patients with PDAC were followed up with for 23 months to monitor all-cause mortality. Among 101 (89.4%) patients with known outcomes, we registered 58 (57.4%) lethal cases ( Table 1 Figure 1 Figure 1 2.2. Potential Protein Biomarkers of PDAC Among Plasma Proteins Multiplexed quantitative proteomic analysis of 103 plasma proteins was performed for all participants using the MRM MS approach. A comparison of the protein profiles between healthy controls and stage I PDAC patients identified 30 differentially expressed proteins as potential early biomarkers of the disease ( Supplementary Table S1 19 Table 2 Next, the HRs of mortality in relation to concentrations of these 21 proteins were estimated within the PDAC group using the Cox model. Six proteins were found to be significantly associated with the survival rates: higher concentrations of alpha-1-acid glycoprotein 1, beta-2-microglobulin, plasma protease C1 inhibitor, and leucine-rich alpha-2-glycoprotein were associated with the increased risk of lethal outcomes, while high fibronectin and cholinesterase concentrations, in contrast, lowered the risk ( Figure 2 Figure 2 A Kaplan–Meier analysis confirmed these results. All PDAC patients were divided into two equally represented groups by the median value of plasma concentration of the identified proteins. The survival rates significantly differed between the groups in accordance with the calculated HRs for each protein ( Figure 2 2.3. A Panel for Early-Stage PDAC Diagnosis Based on the Plasma Protein Biomarkers A model that takes into account the levels of these six proteins in blood plasma to distinguish between stage I PDAC patients and healthy donors was developed. The proposed cross-validated model discriminates early-stage PDAC patients with an accuracy of 0.90 ± 0.09, precision of 0.82 ± 0.17, recall of 1.00 ± 0.00, specificity of 0.85 ± 0.14, and an AUC of 0.933 ± 0.063 ( Figure 3 Taken together, the results of the current study demonstrate that alpha-1-acid glycoprotein 1, beta-2-microglobulin, plasma protease C1 inhibitor, leucine-rich alpha-2-glycoprotein, fibronectin, and cholinesterase are potential biomarkers for early diagnosis of PDAC. 3. Discussion According to the project GLOBOCAN 2018 data, pancreatic cancer (PC) was ranked the 11th most common cancer, causing 4.5% of all cancer deaths in 2018 [ 20 1 2 3 4 21 22 23 The screening of the general population for early detection of PDAC is currently not feasible, primarily due to the lack of reliable and robust biomarkers. However, the studies aimed at the screening of targeted groups, specifically with family history, demonstrated that several molecules in blood and pancreatic juice have the potential to serve as markers for PDAC (discussed in [ 24 25 26 27 28 29 26 30 The objective of the current research was to discover novel potential early-stage markers of PDAC among the proteins presented in the peripheral blood plasma. To achieve this, we employed a multiple reaction monitoring (MRM) mass spectrometry approach. This technique offers several advantages, including high accuracy and specificity in quantitative analysis. Additionally, ready-to-use commercial kits for MRM MS enable the processing of thousands of samples per week, with the use of appropriate instrumentation and automation, including faster liquid chromatography gradients and accelerated protein digestion within 5–10 min, implementing automated liquid handlers and simplified protocols to reduce hands-on time. All these features make MRM MS an effective tool for validating potential PDAC biomarkers and translating them into clinical diagnostics. Here, we used MRM MS to compare the protein profiles of healthy donors and PDAC patients at stages I-IV. We identified proteins that are differentially presented in blood already at stage I and whose levels are associated with survival rates. Moreover, these proteins exhibit a high degree of precision and accuracy in distinguishing between healthy individuals and those with early-stage PDAC. The proteins are alpha-1-acid glycoprotein 1, beta-2-microglobulin, plasma protease C1 inhibitor, leucine-rich alpha-2-glycoprotein, fibronectin, and cholinesterase. Among these proteins, alpha-1-acid glycoprotein 1 has already been proposed as a potential biomarker for PDAC [ 31 30 32 33 34 35 36 37 38 In contrast to proteins discussed above, fibronectin and cholinesterase were found to be inversely correlated with the survival rates in patients with PDAC in our study. In agreement with this finding, low levels of cholinesterase in serum have already been reported to be associated with the poor prognosis of pancreatic cancer [ 39 40 41 42 43 Taken together, the proteins we have identified in our study as potential biomarkers for early-stage PDAC have been previously associated with PDAC and other tumors. However, our study is the first to combine these proteins in a single panel and investigate them simultaneously. As a result, the developed panel demonstrates a high performance for distinguishing early-stage PDAC from healthy controls, with an average accuracy of 90% and an average AUC = 0.933. As discussed above, currently the highest performance among blood protein-based approaches for the detection of early-stage PDAC in humans has been demonstrated for the 29-protein panel [ 30 Nevertheless, the panel needs further validation due to the limitations of the current study. The study was conducted with a relatively small number of participants, so the applicability of individual proteins and their combined panel for early-stage PDAC diagnosis should be confirmed using an expanded cohort of PDAC patients and healthy controls. However, within the study, we controlled the false discovery rate, and the significance levels were found to be rather high (adjusted p −3 4. Materials and Methods 4.1. Participants’ Enrollment and Peripheral Blood Plasma Isolation Patients with newly diagnosed and histologically confirmed PDAC were enrolled in the study in Moscow City Cancer Hospital No. 62. The exclusion criteria were disease origin due to metastases in the pancreas from another tumor, and the patient’s refusal to sign the informed consent. Healthy individuals (those without active inflammatory processes, any infectious diseases, and any oncological diseases that have been diagnosed at the time of enrollment or in the anamnesis) were enrolled in I.V. Davydovsky Moscow City Clinical Hospital among individuals who underwent a routine health check-up. All participants underwent physical examination, as well as standard laboratory tests, including complete blood count and biochemical blood test, using automatic analyzers according to the manufacturers’ standard protocols. Venous blood samples were obtained upon hospitalization. Peripheral blood was collected into S-Monovette 2.7 mL K3E tubes (Sarstedt, Nümbrecht, Germany) through venipuncture. Plasma was obtained by centrifugation of the tubes at 4000× g 4.2. Sample Preparation for Proteomic Analysis Plasma samples (10 μL) were processed for proteomic analysis according to a standard protocol [ 44 A quantitative assay was developed to target 103 plasma proteins. For this, a set of 103 stable isotope-labeled (SIS) and the corresponding natural (NAT) proteotypic peptides were used as internal standards, which were synthesized and validated by the Omics lab at Skoltech, as reported previously [ 13 11 14 To ensure analytical quality, an eight-point calibration curve (levels A–H) and three levels of quality control (QC-A, -B, -C) samples were prepared in accordance with established guidelines [ 14 45 4.3. Targeted Proteomic Analysis by MRM MS A targeted LC-MS/MS approach based on multiple reaction monitoring (MRM) was employed for the quantitative analysis of 103 plasma proteins. All samples were analyzed in duplicate using an ExionLC™ UHPLC system (AB Sciex, Framingham, MA, USA) coupled with a SCIEX QTRAP 6500+ mass spectrometer (SCIEX, Redwood City, CA, USA). LC separation occurred on a Zorbax Eclipse Plus RRHD (Agilent Technologies, Santa Clara, CA, USA) C18 column (2.1 × 150 mm, 1.8 µm) with a 30 min linear gradient (solvent B from 2% to 45%) at a flow rate of 0.4 mL/min. All other basic parameters for the LC-MS method were adapted from previously published research [ 13 14 44 Supplementary Table S2 Quantitative processing of the MRM data was performed with Skyline software (v20.2.0.343; University of Washington, Washington, DC, USA). Peptide concentrations in the plasma samples (reported in fmol/μL) were determined from calibration curves constructed using a 1/(x·x) weighting factor for linear regression. To ensure data quality, all protein and peptide measurements were validated according to ICH Bioanalytical Method Validation guidelines [ 45 4.4. Statistical Analysis Statistical analysis was performed with the Python3 programming language with numpy, scipy, pandas, statsmodels, scikit-learn, and lifelines packages. To compare qualitative parameters between independent groups of individuals, the Fisher exact test (two-tailed) was used with the significance level α for p The Kaplan–Meier estimator was used to analyze overall survival; groups were compared with the log-rank test. Cox proportional hazards models (penalizer = 0.1) were used to quantify associations with mortality (hazard ratios, HR) for clinical stage and for protein concentration strata. For single-protein Healthy vs. Stage I summaries, ROC AUC was computed on raw abundances; the F1-maximizing threshold from the precision–recall curve was used to report precision, recall, and F1 (apparent performance). Association between six preselected plasma proteins and binary clinical status was assessed using a binomial generalized linear model with logit link, fitted under an L2 (ridge) penalty. Protein abundances were standardized to zero mean and unit variance, and an intercept term was included. We applied nested stratified cross-validation (outer = 5 folds for unbiased testing; inner = 5 folds for tuning λ and estimating operating thresholds). Across an inner grid from 0.05 to 1.50, inner-CV sensitivity analyses showed a broad performance plateau for λ ≥ 0.3; consequently, λ = 0.9 was selected as an a priori default value. On the held-out outer test folds, the ridge-penalized regression achieved AUC = 0.933 ± 0.063 (mean ± SD), essentially invariant to the λ-selection strategy due to the plateau. For an operating point, we also examined the Youden index (J = sensitivity + specificity − 1). When the Youden threshold was tuned on each outer fold, performance was Accuracy = 0.90 ± 0.09, Precision = 0.82 ± 0.17, Recall = 1.00 ± 0.00, and Specificity = 0.85 ± 0.14, with thresholds ranging 0.23–1.00 across folds. As expected, apparent (full-set) metrics were higher than outer-test estimates: at λ = 0.90, AUC = 0.965, Accuracy = 0.94, Precision = 0.92, Recall = 0.92, and Specificity = 0.95 at Youden threshold = 0.49, consistent with optimism when evaluating on the training set. Regression coefficients were exponentiated to odds ratios; coefficient uncertainty was quantified via nonparametric bootstrapping (B = 300) with standardization inside each resample, yielding percentile 95% confidence intervals for odds ratios. 5. Conclusions In this study, we have shown that alpha-1-acid glycoprotein 1, beta-2-microglobulin, plasma protease C1 inhibitor, leucine-rich alpha-2-glycoprotein, fibronectin, and cholinesterase may serve as potential biomarkers for the early diagnosis of PDAC. We propose a model that considers the levels of these proteins in blood plasma to distinguish between stage I PDAC patients and healthy donors with high accuracy and sensitivity. However, further research is needed to implement this model in clinical practice as a diagnostic tool for PDAC screening. Acknowledgments The authors acknowledge the support of the Omics Laboratory at Skolkovo Institute of Science and Technology for MRM MS analysis and synthesis of peptide standards. Disclaimer/Publisher’s Note: Supplementary Materials The following supporting information can be downloaded at: https://www.mdpi.com/article/10.3390/ijms26189219/s1 Author Contributions Conceptualization, D.N.K., D.Y.K., E.N.N., E.V. and A.A.K.; formal analysis, I.A.M., A.S.K., M.I.I., A.G.B. and A.A.K.; data curation, I.A.M., A.E.B., M.I.I. and A.G.B.; methodology, A.S.K., A.E.B., M.I.I. and A.G.B.; investigation, D.N.K., A.S.K. and A.E.B.; resources, D.Y.K., E.N.N., E.V. and A.A.K.; writing—original draft preparation, D.N.K., I.A.M., A.S.K. and A.A.K.; writing—review and editing, D.N.K., I.A.M., A.S.K., D.Y.K., E.N.N., E.V. and A.A.K.; funding acquisition, E.N.N., E.V. and A.A.K. All authors have read and agreed to the published version of the manuscript. Institutional Review Board Statement This study was conducted in accordance with the principles of the Declaration of Helsinki, and the study protocol was approved by the Moscow City Independent Ethics Committee (protocol No. 124, 16 May 2023). Informed Consent Statement Informed consent was obtained from all subjects involved in the study. Data Availability Statement The data presented in this study are available in the article and Supplementary Materials Conflicts of Interest The authors declare no conflicts of interest. Abbreviations The following abbreviations are used in this manuscript: ALT Alanine aminotransferase AST Aspartate aminotransferase AUC Area under the ROC curve BH Benjamini–Hochberg procedure BMI Body mass index CA 19-9 Carbohydrate antigen 19–9 HPLC-MS High-performance liquid chromatography mass spectrometry HR Hazard ratio LC-MS/MS Liquid chromatography–tandem mass spectrometry MRM Multiple reaction monitoring MS Mass spectrometry PC Pancreatic cancer PDAC Pancreatic ductal adenocarcinoma RBC Red blood cells ROC Receiver operating characteristic WBC White blood cells References 1. Siegel R.L. Giaquinto A.N. Jemal A. Cancer statistics, 2024 CA Cancer J. Clin. 2024 74 12 49 10.3322/caac.21820 38230766 2. Shakhzadova A.O. Starinsky V.V. Lisichnikova I.V. Cancer care to the population of Russia in 2022 Sib. J. Oncol. 2023 22 5 13 10.21294/1814-4861-2023-22-5-5-13 3. Zhan Z. Zheng X. Xu S. Zheng H. Zheng L. Wang J. Lin H. Yu J. Guo Z. Chen B. Rising burden of pancreatic cancer in China: Trends, drivers, and future projections PLoS ONE 2025 20 e0327009 10.1371/journal.pone.0327009 40591568 PMC12212494 4. Park W. Chawla A. O’Reilly E.M. Pancreatic Cancer: A Review JAMA 2021 326 851 862 Erratum in JAMA 2021 326 10.1001/jama.2021.19984 34547082 PMC9363152 5. Tzeng C.W. Balachandran A. Ahmad M. Lee J.E. Krishnan S. Wang H. Crane C.H. Wolff R.A. Varadhachary G.R. Pisters P.W. Serum carbohydrate antigen 19-9 represents a marker of response to neoadjuvant therapy in patients with borderline resectable pancreatic cancer HPB Off. J. Int. Hepato Pancreato Biliary Assoc. 2014 16 430 438 10.1111/hpb.12154 PMC4008161 23991810 6. Xiong F. Guo T. Wang X. Wu G. Liu W. Wang Q. Wang B. Chen Y. Keratin 8 Is an Inflammation-Induced and Prognosis-Related Marker for Pancreatic Adenocarcinoma Dis. Markers 2022 2022 8159537 10.1155/2022/8159537 35958278 PMC9359862 7. Tartaglione S. Mancini P. Viggiani V. Chirletti P. Angeloni A. Anastasi E. PIVKA-II: A biomarker for diagnosing and monitoring patients with pancreatic adenocarcinoma PLoS ONE 2021 16 e0251656 10.1371/journal.pone.0251656 34015010 PMC8136623 8. Yang S. Zhang Y. Hua Y. Cui M. Wang M. Gao J. Liu Q. Liao Q. GREM1 is a novel serum diagnostic marker and potential therapeutic target for pancreatic ductal adenocarcinoma Front. Oncol. 2022 12 968610 10.3389/fonc.2022.968610 36091126 PMC9458890 9. Coppola A. La Vaccara V. Farolfi T. Fiore M. Cammarata R. Ramella S. Coppola R. Caputo D. Role of CA 19.9 in the Management of Resectable Pancreatic Cancer: State of the Art and Future Perspectives Biomedicines 2022 10 2091 10.3390/biomedicines10092091 36140192 PMC9495897 10. Kitteringham N.R. Jenkins R.E. Lane C.S. Elliott V.L. Park B.K. Multiple reaction monitoring for quantitative biomarker analysis in proteomics and metabolomics J. Chromatogr. B Anal. Technol. Biomed. Life Sci. 2009 877 1229 1239 10.1016/j.jchromb.2008.11.013 19041286 11. Bhardwaj M. Weigl K. Tikk K. Holland-Letz T. Schrotz-King P. Borchers C.H. Brenner H. Multiplex quantitation of 270 plasma protein markers to identify a signature for early detection of colorectal cancer Eur. J. Cancer 2020 127 30 40 10.1016/j.ejca.2019.11.021 31972396 12. Anwar M.A. Keshteli A.H. Yang H. Wang W. Li X. Messier H.M. Cullis P.R. Borchers C.H. Fraser R. Wishart D.S. Blood-Based Multiomics-Guided Detection of a Precancerous Pancreatic Tumor Omics J. Integr. Biol. 2024 28 182 192 10.1089/omi.2023.0278 38634790 13. Bugrova A.E. Strelnikova P.A. Kononikhin A.S. Zakharova N.V. Diyachkova E.O. Brzhozovskiy A.G. Indeykina M.I. Kurochkin I.N. Averyanov A.V. Nikolaev E.N. Targeted MRM-analysis of plasma proteins in frozen whole blood samples from patients with COVID-19: A retrospective study Clin. Chem. Lab. Med. 2024 10.1515/cclm-2024-0800 39321553 14. Gaither C. Popp R. Mohammed Y. Borchers C.H. Determination of the concentration range for 267 proteins from 21 lots of commercial human plasma using highly multiplexed multiple reaction monitoring mass spectrometry Analyst 2020 145 3634 3644 10.1039/C9AN01893J 32255452 15. Gaither C. Popp R. Gajadhar A.S. Borchers C.H. Reproducible protein quantitation of 270 human proteins at increased depth using nanoparticle-based fractionation and multiple reaction monitoring mass spectrometry with stable isotope-labelled internal standards Analyst 2025 150 353 361 10.1039/D4AN00967C 39670628 16. Anderson N.L. The clinical plasma proteome: A survey of clinical assays for proteins in plasma and serum Clin. Chem. 2010 56 177 185 10.1373/clinchem.2009.126706 19884488 17. Kim J. Bamlet W.R. Oberg A.L. Chaffee K.G. Donahue G. Cao X.J. Chari S. Garcia B.A. Petersen G.M. Zaret K.S. Detection of early pancreatic ductal adenocarcinoma with thrombospondin-2 and CA19-9 blood markers Sci. Transl. Med. 2017 9 eaah5583 10.1126/scitranslmed.aah5583 28701476 PMC5727893 18. Liu X. Zheng W. Wang W. Shen H. Liu L. Lou W. Wang X. Yang P. A new panel of pancreatic cancer biomarkers discovered using a mass spectrometry-based pipeline Br. J. Cancer 2018 118 e15 10.1038/bjc.2018.5 29438371 PMC5908675 19. Gartner S. Kruger J. Aghdassi A.A. Steveling A. Simon P. Lerch M.M. Mayerle J. Nutrition in Pancreatic Cancer: A Review Gastrointest. Tumors 2016 2 195 202 10.1159/000442873 27403414 PMC4924449 20. Bray F. Ferlay J. Soerjomataram I. Siegel R.L. Torre L.A. Jemal A. Global cancer statistics 2018: GLOBOCAN estimates of incidence and mortality worldwide for 36 cancers in 185 countries CA Cancer J. Clin. 2018 68 394 424 10.3322/caac.21492 30207593 21. De La Cruz M.S. Young A.P. Ruffin M.T. Diagnosis and management of pancreatic cancer Am. Fam. Physician 2014 89 626 632 24784121 22. Kitano M. Yoshida T. Itonaga M. Tamura T. Hatamaru K. Yamashita Y. Impact of endoscopic ultrasonography on diagnosis of pancreatic cancer J. Gastroenterol. 2019 54 19 32 10.1007/s00535-018-1519-2 30406288 PMC6314985 23. Hayat U. Croce P.S. Saadeh A. Desai K. Appiah J. Khan S. Khan Y.I. Kumar K. Hanif A. Current and Emerging Treatment Options for Pancreatic Cancer: A Comprehensive Review J. Clin. Med. 2025 14 1129 10.3390/jcm14041129 40004658 PMC11856716 24. Shin E.J. Canto M.I. Pancreatic cancer screening Gastroenterol. Clin. N. Am. 2012 41 143 157 10.1016/j.gtc.2011.12.001 PMC3670598 22341255 25. Greenhalf W. Grocock C. Harcus M. Neoptolemos J. Screening of high-risk families for pancreatic cancer Pancreatol. Off. J. Int. Assoc. Pancreatol. 2009 9 215 222 10.1159/000210262 19349734 26. Kriz D. Ansari D. Andersson R. Potential biomarkers for early detection of pancreatic ductal adenocarcinoma Clin. Transl. Oncol. Off. Publ. Fed. Span. Oncol. Soc. Natl. Cancer-Stitute Mex. 2020 22 2170 2174 10.1007/s12094-020-02372-0 PMC7578134 32447642 27. Lianidou E. Pantel K. Liquid biopsies Genes Chromosomes Cancer 2019 58 219 232 10.1002/gcc.22695 30382599 28. Heidrich I. Ackar L. Mossahebi Mohammadi P. Pantel K. Liquid biopsies: Potential and challenges Int. J. Cancer 2021 148 528 545 10.1002/ijc.33217 32683679 29. Luo G. Jin K. Deng S. Cheng H. Fan Z. Gong Y. Qian Y. Huang Q. Ni Q. Liu C. Roles of CA19-9 in pancreatic cancer: Biomarker, predictor and promoter Biochim. Biophys. Acta Rev. Cancer 2021 1875 188409 10.1016/j.bbcan.2020.188409 32827580 30. Mellby L.D. Nyberg A.P. Johansen J.S. Wingren C. Nordestgaard B.G. Bojesen S.E. Mitchell B.L. Sheppard B.C. Sears R.C. Borrebaeck C.A.K. Serum Biomarker Signature-Based Liquid Biopsy for Diagnosis of Early-Stage Pancreatic Cancer J. Clin. Oncol. Off. J. Am. Soc. Clin. Oncol. 2018 36 2887 2894 10.1200/JCO.2017.77.6658 PMC6161836 30106639 31. Zhou Q. Andersson R. Hu D. Bauden M. Sasor A. Bygott T. PawLowski K. Pla I. Marko-Varga G. Ansari D. Alpha-1-acid glycoprotein 1 is upregulated in pancreatic ductal adenocarcinoma and confers a poor prognosis Transl. Res. J. Lab. Clin. Med. 2019 212 67 79 10.1016/j.trsl.2019.06.003 31295437 32. Chiam J.T. Dobson R.J. Kiddle S.J. Sattlecker M. Are blood-based protein biomarkers for Alzheimer’s disease also involved in other brain disorders? A systematic review J. Alzheimer’s Dis. JAD 2015 43 303 314 10.3233/JAD-140816 25096613 33. Hallqvist J. Bartl M. Dakna M. Schade S. Garagnani P. Bacalini M.G. Pirazzini C. Bhatia K. Schreglmann S. Xylaki M. Plasma proteomics identify biomarkers predicting Parkinson’s disease up to 7 years before symptom onset Nat. Commun. 2024 15 4759 10.1038/s41467-024-48961-3 38890280 PMC11189460 34. Fahrmann J.F. Bantis L.E. Capello M. Scelo G. Dennison J.B. Patel N. Murage E. Vykoukal J. Kundnani D.L. Foretova L. A Plasma-Derived Protein-Metabolite Multiplexed Panel for Early-Stage Pancreatic Cancer J. Natl. Cancer Inst. 2019 111 372 379 10.1093/jnci/djy126 30137376 PMC6449169 35. Fahrmann J.F. Schmidt C.M. Mao X. Irajizad E. Loftus M. Zhang J. Patel N. Vykoukal J. Dennison J.B. Long J.P. Lead-Time Trajectory of CA19-9 as an Anchor Marker for Pancreatic Cancer Early Detection Gastroenterology 2021 160 1373 1383.e6 10.1053/j.gastro.2020.11.052 33333055 PMC8783758 36. Zou Y. Xu Y. Chen X. Wu Y. Fu L. Lv Y. Research Progress on Leucine-Rich Alpha-2 Glycoprotein 1: A Review Front. Pharmacol. 2021 12 809225 10.3389/fphar.2021.809225 35095520 PMC8797156 37. Sliker B.H. Goetz B.T. Peters H.L. Poelaert B.J. Borgstahl G.E.O. Solheim J.C. Beta 2-microglobulin regulates amyloid precursor-like protein 2 expression and the migration of pancreatic cancer cells Cancer Biol. Ther. 2019 20 931 940 10.1080/15384047.2019.1580414 30810435 PMC6606018 38. Argyropoulos C.P. Chen S.S. Ng Y.H. Roumelioti M.E. Shaffi K. Singh P.P. Tzamaloukas A.H. Rediscovering Beta-2 Microglobulin as a Biomarker across the Spectrum of Kidney Diseases Front. Med. 2017 4 73 10.3389/fmed.2017.00073 28664159 PMC5471312 39. Mitsunaga S. Kinoshita T. Hasebe T. Nakagohri T. Konishi M. Takahashi S. Gotohda N. Ochiai A. Low serum level of cholinesterase at recurrence of pancreatic cancer is a poor prognostic factor and relates to systemic disorder and nerve plexus invasion Pancreas 2008 36 241 248 10.1097/MPA.0b013e31815b6b2b 18362836 40. Battisti V. Bagatini M.D. Maders L.D. Chiesa J. Santos K.F. Goncalves J.F. Abdalla F.H. Battisti I.E. Schetinger M.R. Morsch V.M. Cholinesterase activities and biochemical determinations in patients with prostate cancer: Influence of Gleason score, treatment and bone metastasis Biomed. Pharmacother. Biomed. Pharmacother. 2012 66 249 255 10.1016/j.biopha.2011.11.005 22560633 41. Bradamante V. Smigovec E. Bukovic D. Geber J. Matanic D. Plasma cholinesterase activity in patients with uterine cervical cancer during radiotherapy Coll. Antropol. 2000 24 373 380 11216405 42. Ran H. Ma J. Cai L. Zhou H. Yuan Z. Chen Y. Chang W. Huang Y. Xiao Y. Serum cholinesterase may independently predict prognosis in non-small-cell lung cancer BMC Cancer 2022 22 93 10.1186/s12885-022-09212-0 35062903 PMC8783506 43. Lin T.C. Yang C.H. Cheng L.H. Chang W.T. Lin Y.R. Cheng H.C. Fibronectin in Cancer: Friend or Foe Cells 2019 9 27 10.3390/cells9010027 31861892 PMC7016990 44. Kononikhin A.S. Starodubtseva N.L. Brzhozovskiy A.G. Tokareva A.O. Kashirina D.N. Zakharova N.V. Bugrova A.E. Indeykina M.I. Pastushkova L.K. Larina I.M. Absolute Quantitative Targeted Monitoring of Potential Plasma Protein Biomarkers: A Pilot Study on Healthy Individuals Biomedicines 2024 12 2403 10.3390/biomedicines12102403 39457715 PMC11504031 45. European Medicines Agency ICH Guideline M10 on Bioanalytical Method Validation and Study Sample Analysis ICH Harmonised Guideline ICH Geneva, Switzerland 2022 Volume 44 Available online: https://database.ich.org/sites/default/files/M10_Guideline_Step4_2022_0524.pdf (accessed on 14 September 2025) Figure 1 Association between PDAC stage and patients’ survival. ( A B p Figure 2 Six plasma proteins are significantly associated with the survival rates of PDAC patients. ( A B C p p Figure 3 Regression model using six proteins to discriminate healthy controls vs. stage I PDAC. The model has been generated as described in Materials and Methods. ( A B ijms-26-09219-t001_Table 1 Table 1 Clinical parameters of the experimental groups. Parameter Healthy Controls PDAC Patients p Stage I (n = 11) Stage II (n = 35) Stage III (n = 24) Stage IV (n = 42)  Sex, % of males 42.1 45.5 48.6 41.7 50.0 n.a.  Age, years 59 [57.5–67.5] 67.9 [65.6–74.8] 67.3 [59.7–70.8] 63.4 [57.7–71.8] 66.4 [61.9–72.0] 0.4290  BMI, kg/m 2 28.4 [26.4–31.5] 26 [24.2–30.7] 25.2 [22.9–27.7] 23.7 [22.2–28.9] 25.6 [22.6–29.6] 0.0723  WBC, 10 9 6.5 [6.4–8.1] 5.7 [4.7–6.9] 7.1 [5.8–9.0] 7.4 [5.8–9.0] 8 [6.4–10.3] 0.2084  RBC, 10 12 4.7 [4.6–5.0] 4.5 [4.3–4.8] 4.2 [3.9–4.5] 4.3 [4.0–4.7] 4.2 [3.9–4.4] 0.0020  Platelets, 10 9 206 [187.5–249.0] 228 [205.0–285.5] 228 [178.5–372.5] 216.5 [173.0–327.3] 246 [201.3–298.0] 0.8768  Hemoglobin, g/L 140 [136.0–146.0] 134 [123.0–139.5] 129 [118.0–134.5] 126 [109.5–136.0] 127.5 [111.8–135.0] 0.0025  Total protein, g/L 71 [69.0–74.0] 69.6 [66.3–73.9] 67.2 [61.6–71.5] 71.3 [68.5–73.4] 68.9 [64.5–73.3] 0.1030  Creatinine, µmol/L 84 [68.5–100.5] 82.3 [74.5–101.4] 73.1 [60.5–84.3] 78 [70.3–93.0] 85.8 [72.9–101.6] 0.0489  Total bilirubin, µmol/L 10.1 [7.9–12.4] 19.7 [14.4–38.0] 19.8 [11.2–29.9] 16.5 [13.9–28.6] 12.1 [10.2–20.5] 0.0020  ALT, U/L 22 [19.0–30.0] 38 [20.5–50.5] 31.7 [15.2–58.4] 28.1 [21.6–43.9] 21.9 [16.9–49.4] 0.5790  AST, U/L 31 [21.0–32.5] 29.3 [26.1–41.7] 28.2 [21.2–54.9] 24.4 [20.2–44.2] 31.3 [20.4–51.0] 0.7065  Known outcomes, n 19 11 33 20 37 n.a  Lethal outcomes, n (%) 0 (0.0) 3 (27.3) 19 (57.6) 11 (55.0) 25 (67.6) n.a * p ijms-26-09219-t002_Table 2 Table 2 Potential early biomarkers of PDAC among plasma proteins. Protein Concentration in Plasma, fmol/µL # Threshold Value, # Adjusted p ROC AUC Precision Recall Healthy Controls Stage I PDAC Patients Insulin-like growth factor-binding protein 3 153.95 [148.4–174.0] 76.895 [60.8–112.3] 125.02 0.00468 0.923 0.900 0.818 Beta-2-microglobulin 93.922 [82.2–99.8] 148.83 [127.3–175.2] 125.29 0.00468 0.919 0.900 0.818 Complement C1q subcomponent subunit C 217.6 [198.0–225.3] 346.35 [276.6–382.2] 263.96 0.00468 0.914 0.818 0.818 Fibronectin 1096.7 [851.9–1275.2] 544.09 [470.8–638.4] 828.81 0.00468 0.904 0.733 1.000 Complement component C9 350.28 [321.9–445.9] 613.81 [489.2–715.0] 458.12 0.00468 0.895 0.688 1.000 Sex hormone-binding globulin 25.669 [17.5–41.0] 75.003 [43.0–82.5] 35.551 0.00468 0.895 0.688 1.000 Plasma protease C1 inhibitor 849.39 [790.7–881.0] 1636.4 [1003.3–1829.6] 1144.5 0.00468 0.895 0.714 0.909 Leucine-rich alpha-2-glycoprotein 207.79 [164.5–275.7] 442.98 [347.2–730.9] 345.63 0.00468 0.895 0.714 0.909 Lysozyme C 45.724 [39.9–58.9] 70.473 [62.0–104.0] 55.461 0.00495 0.890 0.688 1.000 Carboxypeptidase N catalytic chain 83.899 [75.6–95.8] 127.83 [102.3–164.1] 98.346 0.00528 0.885 0.647 1.000 Alpha-1-acid glycoprotein 1 4505.4 [3865.7–5494.1] 7303.8 [6086.6–11,986.5] 5119 0.00715 0.871 0.647 1.000 Alpha-1-antitrypsin 18,071 [16,772.0–21,351.5] 23,871 [22,170.5–33,500.5] 20310 0.00715 0.871 0.647 1.000 Cholinesterase 53.523 [43.2–62.0] 37.244 [29.5–42.7] 47.82 0.00774 0.866 0.800 0.727 Vasorin 8.2042 [6.5–9.0] 11.324 [9.2–16.1] 11.279 0.00976 0.856 1.000 0.636 Fibrinogen alpha chain 15,715 [14,400.5–18,832.0] 21,671 [19,314.0–27,096.0] 19839 0.01227 0.847 0.875 0.636 Fibrinogen gamma chain 11,700 [10,938.5–13,812.5] 14,727 [13,575.0–19,831.5] 12833 0.01586 0.833 0.889 0.727 Thyroxine-binding globulin 162.4 [146.4–181.0] 220.23 [182.2–252.9] 217.62 0.01586 0.833 0.889 0.727 Complement C5 382.31 [338.1–461.0] 546.9 [448.2–595.8] 503.44 0.01649 0.828 0.588 0.909 Complement C1r subcomponent-like protein 53.314 [49.8–58.9] 66.84 [57.5–75.7] 54.662 0.01979 0.818 0.625 0.909 Complement factor B 1523.9 [1344.5–2004.6] 2602.5 [1849.4–2997.6] 2602.5 0.01979 0.818 0.625 0.909 * p # ",
  "metadata": {
    "Title of this paper": "ICH Guideline M10 on Bioanalytical Method Validation and Study Sample Analysis",
    "Journal it was published in:": "International Journal of Molecular Sciences",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12471192/"
  }
}