{
  "title": "Paper_815",
  "abstract": "pmc Front Oncol Front Oncol 1755 frontonco Front. Oncol. Frontiers in Oncology 2234-943X Frontiers Media SA PMC12463647 PMC12463647.1 12463647 12463647 41018112 10.3389/fonc.2025.1547771 1 Oncology Original Research 6-gingerol promotes apoptosis of ovarian cancer cells through miR-506/Gli3 signaling pathway activation Xiong Jun  1  † Wu Hong-Hu  2  *  † Jiang Hui  3 Li Huan  3 Tan Xiao-Qing  3 He Xiao-Ju  1  * Cheng Xue-Xin  1  4  *  1 Department of Obstetrics and Gynecology, The Second Affiliated Hospital of Nanchang University Nanchang, Jiangxi China  2 Biological Resource Center, The Second Affiliated Hospital of Nanchang University Nanchang, Jiangxi China  3 Nanchang University Nanchang China  4 Jiangxi Provincial Key Laboratory of Preventive Medicine, School of Public Health, Nanchang University Nanchang China Edited by: Paolo Andreini Reviewed by: Subramanyam Dasari  Hariprasath Lakshmanan *Correspondence: Hong-Hu Wu, whhvirgil@126.com 80248385@qq.com cxxncu@163.com †These authors have contributed equally to this work 12 9 2025 2025 15 480898 1547771 18 12 2024 25 8 2025 12 09 2025 27 09 2025 29 09 2025 Copyright © 2025 Xiong, Wu, Jiang, Li, Tan, He and Cheng. 2025 Xiong, Wu, Jiang, Li, Tan, He and Cheng https://creativecommons.org/licenses/by/4.0/ This is an open-access article distributed under the terms of the Creative Commons Attribution License (CC BY). The use, distribution or reproduction in other forums is permitted, provided the original author(s) and the copyright owner(s) are credited and that the original publication in this journal is cited, in accordance with accepted academic practice. No use, distribution or reproduction is permitted which does not comply with these terms. Purpose Ginger rhizomes have shown potential for promoting human health, including the prevention and treatment of cancer. Here, we investigated the anticancer activities of 6-gingerol and explored its mechanisms of action in ovarian cancer cells. Methods SKOV3 ovarian cancer cells were treated with different concentrations of 6-gingerol. Clonogenic assays, Flow cytometry, and Western blotting were used to evaluate cell survival and apoptosis. RT-qPCR and transfection experiments were performed to assess the role of miR-506, and bioinformatics tools were used to identify Gli3 as a target gene. Results  In vitro Conclusions Our results indicate that gingerol promoted the upregulation of miR-506, leading to the induction of apoptosis in ovarian cancer cells. This study supports the potential of 6-gingerol-based therapy for ovarian malignancies. ovarian cancer 6-gingerol apoptosis miR-506 Gli3 The author(s) declare financial support was received for the research and/or publication of this article. This work was supported by Research Project of Traditional Chinese Medicine in Jiangxi Province (2019B028), Jiangxi Province Science and Technology Infrastructure Platform Construction Project (20203CCD46007), the Science and Technology Plan Fund of Jiangxi Provincial Health and Family Planning Commission (No. 202210036), Science and technology plan project of Jiangxi Administration of Traditional Chinese Medicine (2021B672), Science and Technology Research Project of Education Department of Jiangxi Province (190141), National Natural Science Foundation of China (#81760504), Jiangxi Provincial Natural Science Foundation Senior Project (No. 20242BAB25485), and General Project of Science and Technology Plan of Jiangxi Provincial Administration of Traditional Chinese Medicine (No. 2024B0268). We hereby declare that: All funders (including the Jiangxi Provincial Natural Science Foundation and Jiangxi Provincial Administration of Traditional Chinese Medicine) had no involvement in the study design, data collection/analysis, manuscript preparation, or publication decision. pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement no pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes section-in-acceptance Gynecological Oncology Introduction Ovarian cancer is the seventh most prevalent cancer in women and has the highest mortality rate among gynecological cancers ( 1 2 3 4 7 8 9 Natural compounds with anticancer properties have shown effectiveness against various cancer types, often with minimal side effects ( 10 11 Zingiber officinale 12 14 15 This study aimed to determine whether 6-gingerol exerts anticancer effects on human ovarian cancer cells. We focused on the molecular mechanisms via which 6-gingerol suppresses cell growth and progression through the induction of apoptosis. Our findings revealed a strong correlation between Gli3 downregulation and 6-gingerol-induced apoptosis. Additionally, we confirmed that miR-506 is expressed at low levels in ovarian cancer tissues. By inhibiting Gli3 expression, miR-506 promotes apoptosis in human ovarian cancer cells. Furthermore, treatment with an miR-506-specific inhibitor reversed the cytotoxic effects of 6-gingerol. In conclusion, we investigated the effects of 6-gingerol on ovarian cancer cell proliferation and explored the underlying molecular mechanisms. Our study identified the miR-506/Gli3 signaling axis as a key pathway through which 6-gingerol induces apoptosis in ovarian cancer cells. Methods and materials Cell culture The SKOV3 human ovarian carcinoma cell line was obtained and authenticated by the American Type Culture Collection (Manassas, VA, USA). The cells were cultured in Dulbecco’s modified Eagle medium (Invitrogen, USA) supplemented with 10% fetal bovine serum (Invitrogen), 1% streptomycin, and 1% ampicillin. Cells were maintained at 37°C in a humidified incubator with 5% CO 2 Cell transfection Transfection was performed using Lipofectamine 3000 (Invitrogen) following the manufacturer’s protocol. Specifically, 2 µg of plasmids were transfected into cells that had been seeded on a six-well plate in the log phase 24 h prior. The transfection was performed using Lipofectamine 2000, and GFP transfection was used in parallel to estimate transfection efficiency. The pcDNA3.1-miR-506 plasmid and its scrambled negative control were obtained from GenePharma (Shanghai, China). Clonogenic survival assay Cells (1000 per dish) were seeded in triplicate in 100 mm Petri dishes and cultured in RPMI-1640 medium for 9 consecutive days. The medium was completely replaced on the day of seeding. Cells were fixed in 100% cold methanol for 15 min and stained with 0.25% crystal violet for another 15 min at room temperature. Colonies were washed with PBS and counted in three random fields. PCR analysis Total RNA was extracted using a HiPure Universal miRNA kit (Magen, Guangzhou, China) according to the manufacturer’s instructions. RNA quality and quantity were verified using a BioAnalyzer 2100 (Agilent, Santa Clara, CA, USA). cDNA was synthesized using a miScript Reverse Transcription Kit (Qiagen, Valencia, CA, USA). Real-time PCR was performed using a CFX Connect™ Real-Time System (Bio-Rad, Inc., Hercules, CA, USA) and a miScript PCR Kit (Qiagen) according to the manufacturers’ instructions. Relative miR-506 expression was normalized to that of U6 rRNA and calculated using the 2 -ΔΔCt Western blotting Total protein was extracted using a radioimmunoprecipitation assay, and concentrations were determined using a Pierce BCA Protein Assay kit (Thermo Fisher Scientific, Inc.), according to the manufacturer’s instructions. Proteins (30 µg/lane) were separated using 10% sodium dodecyl sulfate-polyacrylamide gel electrophoresis (SDS-PAGE) and transferred to polyvinylidene difluoride membranes (EMD Millipore, Billerica, MA, USA). Membranes were blocked with 5% non-fat milk in PBS with 0.05% Tween-20 (PBST) and incubated overnight with primary antibodies at 4°C. Detection was performed using enhanced chemiluminescence (ECL, Millipore) after incubation with the secondary antibodies and a wash with Tris-buffered saline. The antibodies used were anti-rabbit (ab6721, 1:2500) and anti-mouse (ab6789, 1:2500) (both from Abcam). Cell apoptosis analysis Apoptosis was analyzed using annexin V/propidium iodide (PI) staining and flow cytometry (BD Biosciences, Franklin Lakes, NJ, USA). Cells in a single-cell suspension were incubated in the dark for 15 min in HEPES buffer and analyzed using ModFit software (BD Biosciences). Caspase inhibition assay To determine whether apoptosis induced by 6-gingerol is caspase-dependent, SKOV3 cells were pre-treated with 20 µM Z-VAD-FMK (Selleck Chemicals) for 2 hours, followed by treatment with 20 µM 6-gingerol. Apoptosis was then assessed using Annexin V-FITC/PI staining. Statistical analysis Unless otherwise stated, all experiments were performed at least three times independently. Data are presented as mean ± standard deviation (SD). Statistical analyses were performed using SPSS 11.5 (SPSS Inc., Chicago, IL, USA). One-way ANOVA and multiple t-tests were used to assess significance, with P Results 6-gingerol induced apoptosis in SKOV3 cells We conducted an in vitro  Figure 1a nd th th th nd th th nd th th th  Figure 1b  Figures 1c, d  Figures 1e, f Figure 1 6-gingerol induces apoptosis in SKOV3 cells. (a) st nd th th (b) (c) (d) (c) P P (e) (f) (e) P P (a) Line graph showing survival fractions of SKOV3 cells over 7 days with varying concentrations of 6-gingerol. (b) Western blot illustrating effects of 6-gingerol on cleaved caspase-3, cleaved PARP, and tubulin. (c) Scatter plots of Annexin V/PI assays for control and 6-gingerol treatments, showing apoptosis and necrosis. (d) Bar graph indicating percentage of apoptotic cells with control and 6-gingerol treatments. (e) Scatter plots of Annexin V/PI assays with control, Z-VAD-FMK, and 6-gingerol showing apoptosis and necrosis. (f) Bar graph comparing apoptotic percentages for control, Z-VAD-FMK, and 6-gingerol. 6-gingerol reduces Gli3 expression Given that GL13 knockdown inhibits the growth and migration of ovarian cancer cells ( 16  Figures 2a, b Figure 2 6-gingerol inhibits SKOV3 cells by reducing Gli3 expression. (a) (b) Western blot analysis shows the effect of varying concentrations of 6-Gingerol (0, 10, 20 micromolar) on SKOV3 cells. Panel (a) displays Gli3 and Tubulin bands. Panel (b) shows bands for Bcl-2, Bcl-xl, Bax, and Tubulin. 6-gingerol upregulates miR-506 Evidence suggests that miRNAs are key regulators involved in cancer cell proliferation, differentiation, metastasis, and apoptosis. Therefore, we hypothesized that miRNAs might mediate the regulation of Gli3 expression by 6-gingerol. Using bioinformatics algorithms, including TargetScan, miRWalk, and miRDB, we identified seven candidate miRNAs that could potentially regulate Gli3 expression in response to 6-gingerol treatment. The relative expression of these miRNAs was determined using PCR and normalized to that of endogenous 5s rRNA. As shown in  Figure 3 Figure 3 6-gingerol increases microRNA (miR)-506 expression in SKOV3 cells. RT-PCR analysis showing the expression levels of candidate microRNAs predicted to target Gli3 in SKOV3 cells treated with 6-gingerol. Data are normalized to the levels of 5s rRNA. Bar graph showing the relative expression of seven miRNAs with and without 6-Gingerol treatment. miR-506 expression dramatically increases with 6-Gingerol, while other miRNAs show varied responses. Error bars indicate variability. miR-506 directly inhibits Gli3 and induces apoptosis in SKOV3 cells To verify the effect of miR-506 on Gli3 expression and apoptosis, we transfected SKOV3 cells with miR-506. As shown in  Figure 4a  Figure 4b  Figure 4c Figure 4 miR-506 suppresses Gli3 and induces apoptosis in SKOV3 cells. (a) (b) (a) P (c) (a) Two scatter plots showing Annexin V versus PI staining. Control plot has most cells in Q1-LL (84.08%), while miR-506 treatment shifts cells to Q1-UR (53.23%). (b) Bar graph showing increased apoptosis percentage in miR-506 group compared to control. (c) Western blot showing reduced Gli3 protein levels in miR-506 treatment compared to control, with Tubulin as a loading control. 6-gingerol induces apoptosis in SKOV3 cells via miR-506 We found that both 6-gingerol and miR-506 induced apoptosis in ovarian cancer cells. To investigate whether miR-506 mediates the apoptosis effects of 6-gingerol, we used an miR-506-specific antagonist (antago-miR-506). As shown in  Figure 5a P  Figures 5b, c  Figure 5d Figure 5 6-gingerol induces apoptosis in SKOV3 cells via miR-506. (a) (b) (c) (b) (d) (a) Line graph showing SKOV3 cell survival over days with three conditions: 6-Gingerol, 6-Gingerol plus antago-miR-506, and control. Survival decreases notably with 6-Gingerol. (b) Scatter plots display Annexin V/PI staining for apoptosis. Control shows fewer apoptotic cells, 6-Gingerol shows increased apoptosis, and combination treatment shows intermediate results. (c) Bar graph indicates percentage of apoptotic cells: significant increase with 6-Gingerol compared to control and combination. (d) Western blot shows Gli3 and Tubulin expression under control, 6-Gingerol, and combination treatments, highlighting changes in protein levels. Discussion Conventional anticancer therapies often lack specificity, targeting not only cancer cells but also healthy cells, leading to severe side effects. For example, platinum-based chemotherapy for ovarian cancer frequently causes gastrointestinal distress, bone marrow suppression, and liver and kidney damage ( 17 18 19 20 Throughout history, plant-based remedies have been widely used to treat various diseases, a practice that remains relevant today. Currently, herbal drugs account for over 50% of therapies in clinical trials ( 21 Zingiber officinale 22 The ability of 6-gingerol to arrest the cell cycle and induce apoptosis has been shown in human cervical and oral cancer cells ( 23 24 25 We identified Gli3, a zinc-finger transcription factor, as a key player in this process. Gli3 has been implicated in the growth and metastasis of several cancer types. Knockdown of Gli3 suppresses the proliferation and migration of androgen receptor-positive breast and ovarian cancer cells, which does not occur for androgen receptor-negative cells ( 16 26 27 28 The role of miR-506 in cancer is context-dependent. In some cancer types, miR-506 acts as a tumor suppressor, whereas in others, it may function as an oncogene ( 29 30 31 32 33 This study has several limitations. First, although SKOV3 cells are representative of high-grade serous ovarian cancer, validation in additional cell lines (e.g., CAOV3, OVCAR3) would strengthen the findings. Second, the functional role of Gli3 in migration/invasion was not examined, which should be addressed in future studies given its known metastatic functions. These limitations do not affect the core mechanistic conclusions but highlight directions for further research. In summary, Our findings demonstrate that 6-gingerol induces ovarian cancer cell apoptosis through miR-506-mediated Gli3 suppression, providing an alternative to conventional Bax/Bcl-2-targeting approaches. Interestingly, while 6-gingerol has shown promise in combination with cisplatin ( 34 Data availability statement The datasets presented in this study can be found in online repositories. The names of the repository/repositories and accession number(s) can be found in the article/supplementary material. Author contributions JX: Conceptualization, Writing – original draft. H-HW: Conceptualization, Writing – original draft. HJ: Visualization, Writing – review & editing. HL: Visualization, Writing – review & editing. X-QT: Visualization, Writing – review & editing. X-JH: Funding acquisition, Supervision, Writing – review & editing. X-XC: Funding acquisition, Supervision, Writing – review & editing. Conflict of interest The authors declare that the research was conducted in the absence of any commercial or financial relationships that could be construed as a potential conflict of interest. Generative AI statement The author(s) declare that no Generative AI was used in the creation of this manuscript. Any alternative text (alt text) provided alongside figures in this article has been generated by Frontiers with the support of artificial intelligence and reasonable efforts have been made to ensure accuracy, including review by the authors wherever possible. If you identify any issues, please contact us. Publisher’s note All claims expressed in this article are solely those of the authors and do not necessarily represent those of their affiliated organizations, or those of the publisher, the editors and the reviewers. Any product that may be evaluated in this article, or claim that may be made by its manufacturer, is not guaranteed or endorsed by the publisher. References 1 Boyd J Specific keynote: hereditary ovarian cancer: what we know Gynecologic Oncol 2003 88 S8 S10 10.1006/gyno.2002.6674 12586076 2 Moufarrij S Dandapani M Arthofer E Gomez S Srivastava A Lopez-Acevedo M Epigenetic therapy for ovarian cancer: promise and progress Clin Epigenetics 2019 11 7 10.1186/s13148-018-0602-0 30646939 PMC6334391 3 Lheureux S Braunstein M Oza AM Epithelial ovarian cancer: Evolution of management in the era of precision medicine CA Cancer J Clin 2019 69 280 304 10.3322/caac.21559 31099893 4 Stewart C Ralyea C Lockwood S Ovarian cancer: an integrated review Semin Oncol Nurs 2019 35 151–6 10.1016/j.soncn.2019.02.001 30867104 5 Bonifácio VDB Ovarian cancer biomarkers: moving forward in early detection Adv Exp Med Biol 2020 1219 355–63 10.1007/978-3-030-34025-4_18 32130708 6 Sun Y Meng C Liu G MicroRNA-506-3p inhibits ovarian cancer metastasis by down-regulating the expression of EZH2 J Cancer 2022 13 943–50 10.7150/jca.66959 35154460 PMC8824902 7 Kuroki L Guntupalli SR Treatment of epithelial ovarian cancer BMJ 2020 371 m3773 10.1136/bmj.m3773 33168565 8 Yang C Xia BR Zhang ZC Zhang YJ Lou G Jin WL Immunotherapy for ovarian cancer: adjuvant, combination, and neoadjuvant Front Immunol 2020 11 577869 10.3389/fimmu.2020.577869 33123161 PMC7572849 9 O’Malley DM New therapies for ovarian cancer J Natl Compr Canc Netw 2019 17 619–21 10.6004/jnccn.2019.5018 31117037 10 Kang DY Sp N Kim DH Joung YH Lee HG Park YM Salidroside inhibits migration, invasion and angiogenesis of MDA-MB 231 TNBC cells by regulating EGFR/Jak2/STAT3 signaling via MMP2 Int J Oncol 2018 53 877–85 10.3892/ijo.2018.4430 29901185 11 Sp N Kang DY Jo ES Rugamba A Kim WS Park YM Tannic acid promotes TRAIL-induced extrinsic apoptosis by regulating mitochondrial ROS in human embryonic carcinoma cells Cells 2020 9 282 10.3390/cells9020282 31979292 PMC7072125 12 Wen J Wang J Li P Wang R Wang J Zhou X Protective effects of higenamine combined with [6]-gingerol against doxorubicin-induced mitochondrial dysfunction and toxicity in H9c2 cells and potential mechanisms BioMed Pharmacother 2019 115 108881 10.1016/j.biopha.2019.108881 31028997 13 Kubra IR Rao LJ An impression on current developments in the technology, chemistry, and biological activities of ginger (Zingiber officinale Roscoe) Crit Rev Food Sci Nutr 2012 52 651–88 10.1080/10408398.2010.505689 22591340 14 Hong MK Hu LL Zhang YX Xu YL Liu XY He PK 6-Gingerol ameliorates sepsis-induced liver injury through the Nrf2 pathway Int Immunopharmacol 2020 80 106196 10.1016/j.intimp.2020.106196 31978803 15 de Lima RMT Dos Reis AC de Menezes APM Santos JVO Filho JWGO Ferreira JRO Protective and therapeutic potential of ginger (Zingiber officinale) extract and [6]-gingerol in cancer: A comprehensive review Phytother Res 2018 32 1885–907 10.1002/ptr.6134 30009484 16 Lin M Zhu H Shen Q Sun LZ Zhu X Gli3 and androgen receptor are mutually dependent for their Malignancy-promoting activity in ovarian and breast cancer cells Cell Signal 2022 92 110278 10.1016/j.cellsig.2022.110278 35134468 17 Yang L Xie H-J Li Y-Y Wang X Liu X-X Mai J Molecular mechanisms of platinum-based chemotherapy resistance in ovarian cancer Oncol Rep 2022 47 82 10.3892/or.2022.8293 35211759 PMC8908330 18 Garrido MP Fredes AN Lobos-González L Valenzuela-Valderrama M Vera DB Romero C Current treatments and new possible complementary therapies for epithelial ovarian cancer Biomedicines 2022 10 77 10.3390/biomedicines10010077 35052757 PMC8772950 19 Naus PJ Henson R Bleeker G Wehbe H Meng F Patel T Tannic acid synergizes the cytotoxicity of chemotherapeutic drugs in human cholangiocarcinoma by modulating drug efflux pathways J Hepatol 2007 46 222–9 10.1016/j.jhep.2006.08.012 17069924 PMC2705659 20 Joung YH Na YM Yoo YB Darvin P Sp N Kang DY Combination of AG490, a Jak2 inhibitor, and methylsulfonylmethane synergistically suppresses bladder tumor growth via the Jak2/STAT3 pathway Int J Oncol 2014 44 883–95 10.3892/ijo.2014.2250 24402583 21 Sekiwa Y Kubota K Kobayashi A Isolation of novel glucosides related to gingerdiol from ginger and their antioxidative activities J Agric Food Chem 2000 48 373–7 10.1021/jf990674x 10691642 22 Wala K Szlasa W Sauer N Kasperkiewicz-Wasilewska P Szewczyk A Saczko J Anticancer efficacy of 6-gingerol with paclitaxel against wild type of human breast adenocarcinoma Molecules 2022 27 2693 10.3390/molecules27092693 35566044 PMC9104006 23 Kapoor V Aggarwal S Das SN 6-Gingerol Mediates its Anti Tumor Activities in Human Oral and Cervical Cancer Cell Lines through Apoptosis and Cell Cycle Arrest Phytother. Res 2016 30 588–95 10.1002/ptr.5561 26749462 24 Rastogi N Duggal S Singh SK Porwal K Srivastava VK Maurya R Proteasome inhibition mediates p53 reactivation and anti-cancer activity of 6-Gingerol in cervical cancer cells Oncotarget 2015 6 43310 10.18632/oncotarget.6383 26621832 PMC4791234 25 Han X Liu P Zheng B Zhang M Zhang Y Xue Y 6-Gingerol exerts a protective effect against hypoxic injury through the p38/Nrf2/HO-1 and p38/NF-κB pathway in H9c2 cells J Nutr Biochem 2022 104 108975 10.1016/j.jnutbio.2022.108975 35245652 26 Scales MK Velez-Delgado A Steele NG Schrader HE Stabnick AM Yan W Combinatorial Gli activity directs immune infiltration and tumor growth in pancreatic cancer PloS Genet 2022 18 e1010315 10.1371/journal.pgen.1010315 35867772 PMC9348714 27 Shen M Zhang Z Wang P Gli3 promotes invasion and predicts poor prognosis in colorectal cancer BioMed Res Int 2021 2021 8889986 10.1155/2021/8889986 33506047 PMC7814942 28 Iwasaki H Nakano K Shinkai K Kunisawa Y Hirahashi M Oda Y Hedgehog Gli3 activator signal augments tumorigenicity of colorectal cancer via upregulation of adherence-related genes Cancer Sci 2013 104 328–36 10.1111/cas.12073 23176625 PMC7657255 29 Li J Ju J Ni B Wang H The emerging role of miR-506 in cancer Oncotarget 2016 7 62778–88 10.18632/oncotarget.11294 27542202 PMC5308765 30 Tong JL Zhang CP Nie F Xu XT Zhu MM Xiao SD MicroRNA 506 regulates expression of PPAR alpha in hydroxycamptothecin-resistant human colon cancer cells FEBS Lett 2011 585 3560–8 10.1016/j.febslet.2011.10.021 22036718 31 Streicher KL Zhu W Lehmann KP Georgantas RW Morehouse CA Brohawn P A novel oncogenic role for the miRNA-506–514 cluster in initiating melanocyte transformation and promoting melanoma growth Oncogene 2012 31 1558–70 10.1038/onc.2011.345 21860416 32 Luo Y Sun R Zhang J Sun T Liu X Yang B miR-506 inhibits the proliferation and invasion by targeting IGF2BP1 in glioblastoma Am J Transl Res 2015 7 2007–14 26692944 PMC4656777 33 Zhang Y Lin C Liao G Liu S Ding J Tang F MicroRNA-506 suppresses tumor proliferation and metastasis in colon cancer by directly targeting the oncogene EZH2 Oncotarget 2015 6 32586–601 10.18632/oncotarget.5309 26452129 PMC4741714 34 Salari Z Khosravi A Pourkhandani E Molaakbari E Salarkia E Keyhani A The inhibitory effect of 6-gingerol and cisplatin on ovarian cancer and antitumor activity: In silico, in vitro in vivo Front Oncol 2023 13 1098429 10.3389/fonc.2023.1098429 36937441 PMC10020515 ",
  "metadata": {
    "Title of this paper": "The inhibitory effect of 6-gingerol and cisplatin on ovarian cancer and antitumor activity: In silico, ",
    "Journal it was published in:": "Frontiers in Oncology",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12463647/"
  }
}