{
  "title": "Paper_1153",
  "abstract": "pmc Laryngoscope Laryngoscope 379 blackwellopen LARY The Laryngoscope 0023-852X 1531-4995 pmc-is-collection-domain yes pmc-collection-title Wiley Open Access Collection PMC12475552 PMC12475552.1 12475552 12475552 40481740 10.1002/lary.32325 LARY32325 1 Original Report Laryngology Original Report  HPV6 Matsumoto Naoyuki https://orcid.org/0000-0002-7115-3229  1  2 Ueha Satoshi  2 Ueha Rumi https://orcid.org/0000-0002-0608-7237  1  3 ruu1025@yahoo.co.jp uehar-oto@h.u-tokyo.ac.jp Koyama Misaki  1 Yamakawa Kaoru https://orcid.org/0000-0002-0283-6130  1  4 Sato Taku https://orcid.org/0000-0002-5871-1425  1  3 Goto Takao  1  3 Kono Takeyuki https://orcid.org/0009-0008-5792-3072  5 Shichino Shigeyuki  2 Matsushima Kouji  2 Kondo Kenji https://orcid.org/0000-0002-0496-5067  1   1 Department of Otolaryngology and Head and Neck Surgery Graduate School of Medicine, The University of Tokyo Tokyo Japan   2 Division of Molecular Regulation of Inflammation and Immune Diseases Research Institute for Biomedical Sciences, Tokyo University of Science Chiba Japan   3 Swallowing Center The University of Tokyo Hospital Tokyo Japan   4 Department of Otolaryngology and Head and Neck Surgery Tokyo Metropolitan Bokutoh Hospital Tokyo Japan   5 Department of Otolaryngology and Head and Neck Surgery Keio University School of Medicine Tokyo Japan * Correspondence: ruu1025@yahoo.co.jp uehar-oto@h.u-tokyo.ac.jp 07 6 2025 10 2025 135 10 497679 10.1002/lary.v135.10 3732 3739 09 5 2025 01 4 2025 23 5 2025 27 09 2025 28 09 2025 28 09 2025 © 2025 The Author(s). The Laryngoscope https://creativecommons.org/licenses/by-nc-nd/4.0/ This is an open access article under the terms of the http://creativecommons.org/licenses/by-nc-nd/4.0/ ABSTRACT Objectives Recurrent respiratory papillomatosis (RRP) is caused by human papillomavirus (HPV) types 6 and 11. However, the cellular and molecular mechanisms underlying its pathogenesis remain to be elucidated. Recently, the conditional reprogramming (CR) method, which reprograms epithelial cells to an undifferentiated stem cell state, has been shown to be effective for studying RRP. Here, we investigated the relationship between viral and host gene expression in CR cells and explored the molecular pathogenesis of RRP. Methods We evaluated the passage capacity and growth rate of CR cells from fresh RRP tissues and adjacent normal tissues from patients with RRP. Furthermore, we performed RNA‐seq analysis of CR cells across multiple passages to characterize the gene expression profiles associated with RRP. Results RRP‐derived CR cells exhibited greater passage capacity and proliferation rates than adjacent normal tissue‐derived CR cells. HPV6 gene was expressed in all RRP‐derived CR cells and its expression decreased with each passage. We identified three categories of genes correlated with HPV6: inflammatory genes (e.g., CTSS, CFB CEACAM5, CEACAM6 ST6GALNAC1, FUT2 Conclusion HPV6‐induced gene expression signature in infected epithelial cells may play a role in RRP pathogenesis. Further molecular investigations are necessary to determine whether controlling these genes and related factors can control the progression of RRP. Level of Evidence N/A. Using the conditional reprogramming method, we established a cell culture model of recurrent respiratory papillomatosis and analyzed gene expression. Genes related to human papillomavirus 6 expression were identified, including inflammatory genes (e.g., CTSS, CFB CEACAM5, CEACAM6 ST6GALNAC1, FUT2 conditional reprogramming gene expression signature human papillomavirus recurrent respiratory papillomatosis Academic Grant 2024 by Japan Society of Logopedics and Phoniatrics Japan Agency for Medical Research and Development 10.13039/100009619 JP22fk0310509 Japan Society for the Promotion of Science 10.13039/501100001691 23H02706 25K12805 pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement yes pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes source-schema-version-number 2.0 cover-date October 2025 details-of-publishers-convertor Converter:WILEY_ML3GV2_TO_JATSPMC version:6.6.4 mode:remove_FC converted:27.09.2025  N. Matsumoto S. Ueha R. Ueha  HPV6 The Laryngoscope 135 10 2025 3732 3739 10.1002/lary.32325 PMC12475552 40481740  Funding: The contents of this paper were presented at the Combined Otolaryngology Spring Meetings 2025 (New Orleans, Louisiana). Naoyuki Matsumoto, Satoshi Ueha, and Rumi Ueha contributed equally to this work. 1 Introduction Recurrent respiratory papillomatosis (RRP) is a rare disease caused by human papillomavirus (HPV), mainly HPV types 6 and 11. This leads to the growth of benign tumors in the respiratory tract, particularly in the upper airway. It primarily affects laryngeal tissues, with a propensity for high recurrence rates and rarely malignant transformation [ 1 1 2 The virus infects the basal epithelial cells through microabrasions and persists as episomal DNA without genomic integration [ 3 3 4 5 6 1 5 4 7 8 Despite these findings, the precise molecular mechanisms that regulate HPV latency, immune evasion, and epithelial proliferation in RRP remain poorly understood. In particular, the mechanism by which HPV infection alters gene expression in epithelial cells and contributes to disease progression has not yet been fully elucidated. Understanding these transcriptional changes could provide key insights into the mechanisms driving RRP and identify potential therapeutic targets. Previous studies have reported gene expression analyses of RRP tissues. However, these data reflect the influence of the surrounding tissue microenvironment, making it difficult to directly assess the impact of HPV infection on the epithelial cells. To overcome this limitation, an experimental system that allows the isolation and stable culture of HPV‐infected epithelial cells is essential. The conditional reprogramming (CR) method is a cell culture technique that enables the efficient expansion of primary epithelial cells while preserving their normal phenotype, differentiation potential, and genomic characteristics [ 9 10 11 10 To overcome RRP, it is indispensable to elucidate the molecular mechanisms of RRP, such as the regulation of HPV latency, immune evasion, and epithelial proliferation. In this study, to identify sets of related genes, we conducted gene expression analysis of CR cells derived from both RRP and adjacent normal tissues. 2 Methods 2.1 Patient Characteristics Five patients (median age, 61 years; range, 29–77) with a history of RRP were recruited for this prospective study at the University of Tokyo Hospital with the approval of the Ethics Committee (2020120G). Biopsy samples of RRP lesions and adjacent normal tissue (non‐papilloma, NP) were obtained from patients undergoing surgery, immediately placed in saline on ice, and processed. Tissue samples were collected from various laryngeal regions, including true vocal folds, false vocal folds, and arytenoid areas. Papillomas were defined as exophytic, cauliflower‐like lesions exhibiting a central vascular core in each papilla or a symmetrical distribution of intraepithelial papillary capillary loops on laryngoscopy with narrow‐band imaging (NBI) [ 1 12 13 1 TABLE 1 Characteristics of patients analyzed in this study. ID Age (years) Sex Surgery Derkay score HPV type 1 61 M 2nd 7 6a 2 77 F 6th 12 6vc 3 29 M 7th 9 6vc 4 29 M 2nd 8 6a 5 63 M 4th 8 6a Abbreviation: HPV, human papillomavirus. 2.2 Tissue Processing and Cell Culture Using the Conditional Reprogramming Epithelial cells derived from RRP and NP tissues were cultured using the CR method [ 10 14 S1 5 S1 2.3  RNA RNA‐seq libraries were prepared by on‐bead reverse transcription with template switching. PolyA RNA was captured on oligo‐dT‐conjugated magnetic beads, followed by reverse transcription with SuperScript IV (Thermo Fisher Scientific, Waltham, MA, USA) and a template‐switching oligo. After washing, cDNA was amplified through two rounds of PCR using the KAPA HiFi HotStart ReadyMix (KAPA Biosystems, Basel, Switzerland) and purified. Barcoded libraries were pooled, fragmented, adapter‐ligated, and indexed using the NEBNext Ultra II FS Kit (New England Biolabs, Ipswich, MA, USA). The final libraries were selected and sequenced on an Illumina NovaSeq 6000 (47 bp read 1 and 175 bp read 2). 2.4 Transcriptome Data Analysis Transcriptome data analysis was performed according to a previous report [ 15 16 17 https://cran.r‐project.org/ p p q p 2.5 Statistical Analyses All statistical analyses were performed using a two‐tailed paired Student's t p 3 Results 3.1 Proliferation Characteristics of CR RRP NP We established CR cells from RRP tissue in all five cases (ID1‐5) and from NP tissue in three of the five patients (ID 1, 4, and 5) who provided informed consent. CR cells were serially passaged and cultured for up to 30 days or until cell proliferation plateaued. In RRP‐derived CR cells, approximately 10 mg of tissue produced more than 1 × 10 8 7 1A 1B FIGURE 1 Cell proliferation of cultured cells using the conditional reprogramming method. (A) Primary culture derived from RRP and NP tissues was collected when the cells reached 80%–90% confluency and designated as P0. Approximately 1 × 10 5 p t www.laryngoscope.com 3.2  HPV CR RRP NP To elucidate the molecular mechanisms underlying the high proliferative potential of RRP‐derived CR cells, we performed RNA sequencing analysis of RRP‐derived and NP‐derived CR cells at P0, P1, and P4. We assumed that the proliferation from P0 to P1 and P1 to P2 was primarily influenced by gene expression profiles at P0 and P1, respectively. Therefore, we analyzed gene expression at both time points. As references for HPV, we used subtypes a, b, and vc of HPV6 as well as HPV11. The subtype with the highest number of matching transcripts was assigned to the HPV type in each case (Table 1 2A r p 2B,C FIGURE 2 HPV6 gene expression in cultured cells using the conditional reprogramming method. RNA sequencing analysis was performed on the RRP‐derived CR cells at P0, P1, and P4. (A) Number of HPV6‐derived transcripts per million transcripts. (B) Spearman correlation between HPV6‐derived transcripts at P0 and the proliferation rate (number of cell divisions per day) from P0 to P1. (C) Spearman correlation between HPV6‐derived transcripts at P1 and the proliferation rate (number of cell divisions per day) from P0 to P1. HPV6, Human papillomavirus 6; RRP, Recurrent respiratory papillomatosis; TPM, Transcripts per million transcripts. [Color figure can be viewed in the online issue, which is available at www.laryngoscope.com 3.3 Transcriptomic Characteristics of RRP CR To identify the transcriptomic characteristics of RRP‐derived CR cells, we first performed clustering analysis on the gene expression data from P0, P1, and P4 of RRP‐derived and NP‐derived CR cells from ID 1, 4, and 5. However, no gene groups specific to either RRP or NP have been identified. Therefore, we proceeded with DEG analysis of RRP‐derived and NP‐derived CR cells at P0 (Figure 3A,B S2 S3 CTSS CFB CEACAM5 CEACAM6 ST6GALNAC1 FUT2 KRT16 KRT6C 3C S4 S5 FIGURE 3 Analysis of differentially expressed genes in cultured cells from RRP and NP tissues. (A) A volcano plot illustrates transcriptome data from P0 cultured cells derived from RRP and NP, excluding HPV6 gene. Differentially expressed genes were defined as those with an adjusted p www.laryngoscope.com 3.4 Host Genes Correlated With HPV6 RRP CR Finally, we analyzed the correlation between HPV6 and host gene expression in RRP‐derived CR cells at P0, P1, and P4 from all cases to investigate how HPV infection alters gene expression in these cells. To control for gene expression changes associated with passage number rather than HPV infection, we performed the same analysis in NP‐derived CR cells and excluded genes that exhibited passage‐dependent expression. We identified 145 host genes significantly correlated with HPV6 (correlation coefficient ≥ 0.6 and p S6 4A 2 4B FIGURE 4 Analysis of host genes correlated with HPV6 gene expression in cultured cells from RRP tissues. Correlation analysis between host gene expression and HPV6 gene expression was conducted in cultured cells from RRP tissues at P0, P1, and P4. Genes with a correlation coefficient of ≥ 0.6 and p www.laryngoscope.com TABLE 2 HPV/RRP associated genes list. Gene Log2 fold change Adjusted p Correlation coefficient 35 common genes  TCN1 2.60 1.8.E−07 0.87  ST6GALNAC1 1.48 1.0.E−02 0.86  CEACAM7 3.23 2.0.E−06 0.82  FER1L6 2.95 7.9.E−05 0.82  CTSS 2.66 3.8.E−09 0.79  BCAS1 2.70 3.4.E−06 0.78  ACKR3 2.04 8.4.E−04 0.76  PSCA 2.52 3.5.E−13 0.76  SAA2‐SAA4 1.66 1.4.E−02 0.76  ALG1L 5.13 1.3.E−06 0.75  SAA1 1.47 4.7.E−02 0.75  HSD17B11 1.86 8.9.E−04 0.71  STRA6 2.57 1.4.E−04 0.71  CFB 3.13 7.9.E−10 0.69  PLAC8 2.14 9.7.E−05 0.68  GCNT3 1.33 3.2.E−02 0.68  FUT2 1.92 3.1.E−04 0.68  WFDC2 3.38 1.0.E−09 0.68  IRAG2 2.07 4.0.E−02 0.67  B3GNT6 4.78 1.9.E−12 0.66  LOXL4 3.63 1.8.E−04 0.66  RARB 3.12 1.6.E−08 0.66  CEACAM5 2.02 2.4.E−06 0.66  ALDH5A1 2.09 1.3.E−02 0.65  EPHB2 2.79 7.6.E−07 0.64  GLUL 1.30 4.9.E−02 0.64  MDK 2.51 5.3.E−05 0.64  BCL2A1 5.24 3.1.E−10 0.63  SMIM22 2.49 3.2.E−04 0.63  CDH6 5.74 1.7.E−12 0.62  C4orf19 3.62 6.7.E−05 0.62  WDR72 4.49 2.1.E−15 0.61  CEACAM6 1.67 9.8.E−03 0.61  MYEOV 2.00 7.1.E−03 0.61  LYPD2 3.83 1.9.E−10 0.60 Abbreviations: HPV, human papillomavirus; RRP, recurrent respiratory papillomatosis. 4 Discussion The CR method enables the in vitro establishment of primary epithelial cells from healthy human tissues and human tumor samples. In this study, we used the CR method to investigate host gene alterations in HPV6‐infected epithelial cells. Although tissue‐based gene expression analysis is direct and feasible, it reflects gene expression from the non‐epithelial components of papillomas, such as infiltrating leukocytes, fibroblasts, and endothelial cells. To elucidate HPV6‐induced transcriptional changes specifically in epithelial cells, we utilized CR cultures to obtain purified epithelial populations and performed a correlation analysis between HPV6 and host gene expression. We successfully established CR cells from RRP and NP tissues. These cells were capable of multiple passages. Although RRP cells exhibited superior proliferation and serial passaging abilities compared with NP‐derived CR cells, notable variability was observed between individual cases. These results suggest that CR cells retain some of the characteristics of their original tissues. HPV6 gene expression was detected in all RRP‐derived CR cells, but the expression levels varied significantly across different cases. Several genes were highly expressed in RRP‐derived CR cells, and some were correlated with HPV6 gene expression. These findings suggest that the observed variability in RRP‐derived CR cells is likely driven by differences in HPV6 gene expression and the host gene expression associated with it. Based on these observations, the CR method could be a valuable tool for investigating HPV6‐induced epithelial transformation and the cellular and molecular mechanisms underlying RRP pathogenesis. HPV6 gene expression in RRP‐derived CR cells decreased with each passage in our CR cultures, consistent with previous reports [ 18 Analysis of genes highly expressed in RRP‐derived CR cells and those showing a strong correlation with HPV6 expression identified gene groups implicated in cell inflammation, proliferation, and glycosylation. Among the inflammatory genes identified in this study, Cathepsin S (CTSS) is an enzyme that regulates the maturation of neutrophil serine proteases essential for neutrophil activation [ 19 20 21 22 23 23 24 25 26 27 GO analysis revealed a strong correlation between HPV6 and the glycosylation‐related genes. The upregulation of these genes in virus‐infected epithelial cells may have significant implications for viral entry and immune evasion, particularly through antigen epitope masking. For instance, glycosylation of viral surface proteins, such as the SARS‐CoV‐2 spike protein and Epstein–Barr virus (EBV) glycoproteins, enhances the viral ability to bind host cell receptors [ 28 29 30 31 This study has several limitations. First, the small sample size and the diverse disease states of the patients limited the generalizability of the findings. Moreover, all patients had recurrent papillomatosis, and none were HPV11‐positive. Future comparative studies with a larger number of cases, including non‐recurrent cases and HPV11‐positive papillomatosis, would be valuable. Second, the higher proliferative capacity of RRP‐derived CR cells compared with NP‐derived CR cells may reflect fewer cell divisions at P0. This could be due to a higher proportion of cells with proliferative capacity in RRP tissues, requiring fewer divisions to achieve the same final cell count, even when starting from equivalent cell numbers or tissue amount. Third, clustering analysis of gene expression data from RRP‐derived and NP‐derived CR cells revealed no distinct separation into RRP and NP clusters. As a result, we were unable to identify the gene sets characteristic of each CR cell type, which may reflect potential influences from patient backgrounds and other confounding factors. Finally, the functional relevance of genes correlated with HPV6 remains unclear. To address this, future single‐cell RNA sequencing is essential to better understand the cellular heterogeneity of HPV6‐infected epithelium and to explore the potential functional roles of these correlated genes. 5 Conclusion In this study, we highlighted the potential link between HPV6‐induced gene expression changes in epithelial cells and the pathogenesis of RRP through gene expression analysis of CR cells. The CR method served as an effective tool to investigate the cellular and molecular mechanisms involved in RRP pathogenesis. Further investigations are needed to fully elucidate the roles of these gene expression changes in RRP progression and to explore potential therapeutic strategies targeting these pathways. Ethics Statement The study protocol was approved by the Human Ethics Committee of the University of Tokyo (No. 2020120G) and Tokyo University of Science (No. 20011) and complied with the tenets of the amended Declaration of Helsinki. Conflicts of Interest The authors declare no conflicts of interest. Supporting information  Table S1.  Table S2.  Table S3.  Table S4.  Table S5.  Table S6. References 1 N. N. Venkatesan H. S. Pine M. P. Underbrink Recurrent Respiratory Papillomatosis Otolaryngologic Clinics of North America 45 3 2012 671 694 22588043 10.1016/j.otc.2012.03.006 PMC3682415 2 K. A. Krause D. Neelon S. L. Butler Koilocytosis StatPearls StatPearls Publishing 2025 30422553 3 A. A. McBride Mechanisms and Strategies of Papillomavirus Replication Biological Chemistry 398 8 2017 919 927 28315855 10.1515/hsz-2017-0113 4 S. R. Georgescu C. I. Mitran M. I. Mitran New Insights in the Pathogenesis of HPV Infection and the Associated Carcinogenic Processes: The Role of Chronic Inflammation and Oxidative Stress Journal of Immunology Research 2018 2018 5315816 30225270 10.1155/2018/5315816 PMC6129847 5 A. Venuti F. Paolini L. Nasir Papillomavirus E5: The Smallest Oncoprotein With Many Functions Molecular Cancer 10 1 2011 140 22078316 10.1186/1476-4598-10-140 PMC3248866 6 S. Gazzini R. Cerullo D. Soloperto VEGF as a Key Actor in Recurrent Respiratory Papillomatosis: A Narrative Review Current Issues in Molecular Biology 46 7 2024 6757 6768 39057045 10.3390/cimb46070403 PMC11275356 7 G. A. Maglennon J. Doorbar The Biology of Papillomavirus Latency Open Virology Journal 6 1 2012 190 197 23341854 10.2174/1874357901206010190 PMC3547330 8 D. Song H. Li H. Li J. Dai Effect of Human Papillomavirus Infection on the Immune System and Its Role in the Course of Cervical Cancer Oncology Letters 10 2 2015 600 606 26622540 10.3892/ol.2015.3295 PMC4509451 9 F. A. Suprynowicz G. Upadhyay E. Krawczyk Conditionally Reprogrammed Cells Represent a Stem‐Like State of Adult Epithelial Cells Proceedings of the National Academy of Sciences of the United States of America 109 49 2012 20035 20040 23169653 10.1073/pnas.1213241109 PMC3523865 10 X. Liu E. Krawczyk F. A. Suprynowicz Conditional Reprogramming and Long‐Term Expansion of Normal and Tumor Cells From Human Biospecimens Nature Protocols 12 2 2017 439 451 28125105 10.1038/nprot.2016.174 PMC6195120 11 A. M. Alamri X. Liu J. K. Blancato Expanding Primary Cells From Mucoepidermoid and Other Salivary Gland Neoplasms for Genetic and Chemosensitivity Testing Disease Models & Mechanisms 11 1 2018 10.1242/dmm.031716 PMC5818080 29419396 12 R. E. A. Tjon Pian Gi G. B. Halmos B. M. van Hemel Narrow Band Imaging is a New Technique in Visualization of Recurrent Respiratory Papillomatosis Laryngoscope 122 8 2012 1826 1830 22566012 10.1002/lary.23344 13 C. S. Derkay D. J. Malis G. Zalzal B. J. Wiatrak H. K. Kashima M. D. Coltrera A Staging System for Assessing Severity of Disease and Response to Therapy in Recurrent Respiratory Papillomatosis Laryngoscope 108 6 1998 935 937 9628513 10.1097/00005537-199806000-00026 14 X. Liu V. Ory S. Chapman ROCK Inhibitor and Feeder Cells Induce the Conditional Reprogramming of Epithelial Cells American Journal of Pathology 180 2 2012 599 607 22189618 10.1016/j.ajpath.2011.10.036 PMC3349876 15 S. Shichino S. Ueha S. Hashimoto Transcriptome Network Analysis Identifies Protective Role of the LXR/SREBP‐1c Axis in Murine Pulmonary Fibrosis JCI Insight 4 1 2019 10.1172/jci.insight.122163 PMC6485671 30626759 16 A. Dobin C. A. Davis F. Schlesinger STAR: Ultrafast Universal RNA‐Seq Aligner Bioinformatics 29 1 2013 15 21 23104886 10.1093/bioinformatics/bts635 PMC3530905 17 Y. Liao G. K. Smyth W. Shi featureCounts: An Efficient General Purpose Program for Assigning Sequence Reads to Genomic Features Bioinformatics 30 7 2014 923 930 24227677 10.1093/bioinformatics/btt656 18 F. Alkhilaiwi S. Paul D. Zhou High‐Throughput Screening Identifies Candidate Drugs for the Treatment of Recurrent Respiratory Papillomatosis Papillomavirus Research 8 100181 2019 100181 31446060 10.1016/j.pvr.2019.100181 PMC6723410 19 Y. Nishibata S. Arai M. Taniguchi Cathepsin C Inhibition Reduces Neutrophil Serine Protease Activity and Improves Activated Neutrophil‐Mediated Disorders Nature Communications 15 1 2024 6519 10.1038/s41467-024-50747-6 PMC11341692 39174512 20 A. Sobti C. Sakellariou M. Nilsson Immune Delineation of Laryngeal Papilloma Reveals Enhanced Neutrophil Associated Gene Profile European Journal of Immunology 51 10 2021 2535 2539 34337750 10.1002/eji.202149202 21 C. M. Rice L. C. Davies J. J. Subleski Tumour‐Elicited Neutrophils Engage Mitochondrial Metabolism to Circumvent Nutrient Limitations and Maintain Immune Suppression Nature Communications 9 1 2018 5099 10.1038/s41467-018-07505-2 PMC6269473 30504842 22 Y. Wang M. Xu J. Sun Glycolytic Neutrophils Accrued in the Spleen Compromise Anti‐Tumour T Cell Immunity in Breast Cancer Nature Metabolism 5 8 2023 1408 1422 10.1038/s42255-023-00853-4 37563468 23 K. Bai P. E. Clavijo Y. Robbins S. M. Norberg C. T. Allen Quantification and Functional Studies of Neutrophilic Cells Identifies Distinct Papilloma Phenotypes Laryngoscope 134 7 2024 3238 3244 38436434 10.1002/lary.31375 PMC11182705 24 Y. Huang P. M. Krein D. A. Muruve B. W. Winston Complement Factor B Gene Regulation: Synergistic Effects of TNF‐Alpha and IFN‐Gamma in Macrophages Journal of Immunology 169 5 2002 2627 2635 10.4049/jimmunol.169.5.2627 12193734 25 C. Taube J. M. Thurman K. Takeda Factor B of the Alternative Complement Pathway Regulates Development of Airway Hyperresponsiveness and Inflammation Proceedings of the National Academy of Sciences of the United States of America 103 21 2006 8084 8089 16702544 10.1073/pnas.0602357103 PMC1472433 26 J. Thomas A. Klebanov S. John CEACAMS 1, 5, and 6 in Disease and Cancer: Interactions With Pathogens Genes & Cancer 14 2023 12 29 36741860 10.18632/genesandcancer.230 PMC9891707 27 G. Wu D. Wang F. Xiong The Emerging Roles of CEACAM6 in Human Cancer (Review) International Journal of Oncology 64 3 2024 27 38240103 10.3892/ijo.2024.5615 PMC10836497 28 X. Zhao H. Chen H. Wang Glycans of SARS‐CoV‐2 Spike Protein in Virus Infection and Antibody Production Frontiers in Molecular Biosciences 8 2021 629873 33928117 10.3389/fmolb.2021.629873 PMC8076860 29 B. S. Möhl J. Chen S. J. Park T. S. Jardetzky R. Longnecker Epstein‐Barr Virus Fusion With Epithelial Cells Triggered by gB is Restricted by a gL Glycosylation Site Journal of Virology 91 23 2017 10.1128/JVI.01255-17 PMC5686762 28956769 30 F. Zhang F. Schmidt F. Muecksch SARS‐CoV‐2 Spike Glycosylation Affects Function and Neutralization Sensitivity MBio 15 2 2024 e0167223 38193662 10.1128/mbio.01672-23 PMC10865855 31 M. L. Newby C. A. Fogarty J. D. Allen J. Butler E. Fadda M. Crispin Variations Within the Glycan Shield of SARS‐CoV‐2 Impact Viral Spike Dynamics Journal of Molecular Biology 435 4 2023 167928 36565991 10.1016/j.jmb.2022.167928 PMC9769069 ",
  "metadata": {
    "Title of this paper": "Variations Within the Glycan Shield of SARS‐CoV‐2 Impact Viral Spike Dynamics",
    "Journal it was published in:": "The Laryngoscope",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12475552/"
  }
}