{
  "title": "Paper_1115",
  "abstract": "J Bone Miner Res J Bone Miner Res 656 jbmr jbmr Journal of Bone and Mineral Research 0884-0431 1523-4681 Oxford University Press PMC11700612 PMC11700612.1 11700612 11700612 39348414 10.1093/jbmr/zjae160 zjae160 1 Research Article AcademicSubjects/MED00010 AcademicSubjects/MED00160 AcademicSubjects/MED00250 24-hour activity composition is associated with lower fall and fracture risk in older men https://orcid.org/0000-0003-3557-5042 Roe Lauren S  Department of Epidemiology, University of Pittsburgh School of Public Health United States https://orcid.org/0000-0002-4093-6036 Strotmeyer Elsa S  Department of Epidemiology, University of Pittsburgh School of Public Health United States https://orcid.org/0000-0003-4938-9478 Cawthon Peggy M  California Pacific Medical Center, Research Institute United States  Department of Epidemiology and Biostatistics, University of California, San Francisco United States Glynn Nancy W  Department of Epidemiology, University of Pittsburgh School of Public Health United States Ma Yan  Department of Biostatistics, University of Pittsburgh School of Public Health United States Ancoli-Israel Sonia  Department of Psychiatry, University of California San Diego School of Medicine United States Ensrud Kristine  Division of Epidemiology and Community Health and Department of Medicine, University of Minnesota United States  Center for Care Delivery and Outcomes Research, Minneapolis VA Health Care System 55417 United States Redline Susan  Brigham and Women’s Hospital Harvard Medical School United States Stone Katie L  California Pacific Medical Center, Research Institute United States  Department of Epidemiology and Biostatistics, University of California, San Francisco United States Gabriel Kelley Pettee  Department of Epidemiology, University of Alabama at Birmingham United States Cauley Jane A  Department of Epidemiology, University of Pittsburgh School of Public Health United States Corresponding author: Lauren S. Roe, School of Public Health, University of Pittsburgh, 130 N. Bellefield Ave., Room 317, Pittsburgh, PA 15213, United States ( Lauren.S.Roe@pitt.edu 1 2025 30 9 2024 40 1 478568 27 37 06 3 2024 11 9 2024 21 9 2024 24 10 2024 30 09 2025 30 09 2025 06 01 2025 30 09 2025 © The Author(s) 2024. Published by Oxford University Press on behalf of the American Society for Bone and Mineral Research. All rights reserved. For permissions, please e-mail: journals.permissions@oup.com 2024 https://academic.oup.com/pages/standard-publication-reuse-rights This article is published and distributed under the terms of the Oxford University Press, Standard Journals Publication Model ( https://academic.oup.com/pages/standard-publication-reuse-rights Abstract Physical activity (PA), sedentary behavior (SB), and sleep are each individually associated with falls and fractures, but often are not examined simultaneously. Compositional data analysis examined the combined prospective associations between the proportion of time in PA, SB, and sleep relative to the remaining behaviors with recurrent falls (2+ falls in any yr), any fractures, and major osteoporotic fracture (MOF) from tri-annual questionnaires, with adjudication for fractures, in 2918 older men aged 78.9 ± 5.1 yr in the Osteoporotic Fractures in Men (MrOS) Study. Accelerometers were worn on the right tricep for seven consecutive 24-h periods and measured PA (>1.5 METs), SB (≤1.5 METs), and sleep. Generalized estimating equations evaluated associations with recurrent falls. Cox proportional hazards regression estimated any incident fracture and MOF risk separately. Over 4 yr of follow-up, 1025 (35.2%) experienced recurrent falls; over 10 ± 4 yr of follow-up, 669 (22.9%) experienced incident fractures, and 370 (12.7%) experienced a MOF. Higher proportions of PA relative to SB and sleep were associated with lower odds of recurrent falls [odds ratio (OR): 0.87, 95% CI: 0.76-0.99]. Higher proportions of SB relative to PA and sleep were associated with a higher odds of recurrent falls (OR: 1.38, 95% CI: 1.06-1.81) and a higher risk of any fracture [hazard ratio (HR): 1.42, 95% CI: 1.05-1.92]. Higher proportions of sleep relative to PA and SB were associated with a lower risk of fracture (HR: 0.74, 95% CI: 0.54-0.99). No associations of activity composition with MOF were observed. When accounting for the co-dependence of daily activities, higher proportions of SB relative to the proportion of PA and sleep were associated with higher odds of recurrent falls and fracture risk. Results suggest reducing SB (and increasing PA) may lower fall and fracture risk in older men, which could inform future interventions. aging epidemiology exercise fracture prevention statistical methods National Institute on Aging 10.13039/100000049 T32 AG000181-28 National Institute of Arthritis and Musculoskeletal and Skin Diseases 10.13039/100000069 National Center for Advancing Translational Sciences 10.13039/100006108 U01 AG027810 U01 AG042124 U01 AG042139 U01 AG042140 U01 AG042143 U01 AG042145 U01 AG042168 U01 AR066160 R01 AG066671 UL1 TR002369 pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access no pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement yes pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes ",
  "metadata": {
    "Title of this paper": "24-hour activity composition is associated with lower fall and fracture risk in older men",
    "Journal it was published in:": "Journal of Bone and Mineral Research",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC11700612/"
  }
}