{
  "title": "Paper_1118",
  "abstract": "pmc Surg Case Rep Surg Case Rep 2806 surgcaserep Surgical Case Reports 2198-7793 Japan Surgical Society PMC12476914 PMC12476914.1 12476914 12476914 41024978 10.70352/scrj.cr.25-0271 scrj.cr.25-0271 1 version-of-record Case Report Successful Complete Laparoscopic Resection of Benign Peritoneal Multicystic Mesothelioma Adherent to the Ascending Colon: A Case Report Kitamura Yoshihito 1 Miguchi Masashi 1 Nagao Ryo 1 Shinohara Makoto 1 Nakashima Keigo 1 Hamaoka Michinori 1 Hashimoto Masakazu 1 Misumi Toshihiro 1 Fujikuni Nobuaki 1 Ikeda Satoshi 1 Matsugu Yasuhiro 1 Mori Keiichi 2 Nishisaka Takashi 2 Nakahara Hideki 1 1 Department of Gastroenterological Surgery, Hiroshima Prefectural Hospital Hiroshima, Hiroshima Japan 2 Department of Pathology and Laboratory Medicine, Hiroshima Prefectural Hospital Hiroshima, Hiroshima Japan Corresponding author: Masashi Miguchi. Department of Gastroenterological Surgery, Hiroshima Prefectural Hospital, 1-5-54 Ujina Kanda, Minami-Ku, Hiroshima, Hiroshima 734-8530, Japan. E-mail: miguchima0815@gmail.com 25 9 2025 2025 11 1 481267 25-0271 07 5 2025 08 9 2025 25 09 2025 29 09 2025 30 09 2025 © 2025 The Author(s). Published by Japan Surgical Society 2025 The Author(s) https://creativecommons.org/licenses/by/4.0/ This article is licensed under a Creative Commons Attribution 4.0 International License ABSTRACT INTRODUCTION Benign peritoneal multicystic mesothelioma (BPMM) is a rare mesothelial tumor with a high local recurrence rate and potential for malignant transformation. It predominantly affects women of reproductive age and is often associated with prior abdominal surgery or inflammation. Complete surgical resection is the standard treatment; however, tumor recurrence remains a concern. BPMM occurring outside the pelvis is extremely rare, and lesions requiring colectomy because of adherence to the gastrointestinal tract are infrequent. CASE PRESENTATION A 63-year-old woman presented with right lower abdominal pain. She had undergone cervical cancer surgery 20 years ago. Contrast-enhanced CT and MRI revealed multiple well-defined cystic lesions adjacent to the ascending colon. Colonoscopy revealed extrinsic compression, and 18 18 18 en bloc CONCLUSIONS A laparoscopic approach may be a feasible and safe option for complete resection of BPMM as it allows for magnified visualization and careful handling of cystic lesions, avoiding their intraoperative rupture. Given the high recurrence rate of BPMM, close postoperative surveillance is essential. This case illustrates the feasibility of laparoscopic resection for BPMM. KEYWORDS benign peritoneal multicystic mesothelioma colon laparoscopic surgery pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement no pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes Abbreviations BPMM benign peritoneal multicystic mesothelioma CD cluster of differentiation CK cytokeratin CRS cytoreduction surgery  18 18 HIPEC hyperthermic intraperitoneal chemotherapy INTRODUCTION Benign peritoneal multicystic mesothelioma (BPMM) is a rare primary tumor arising from the mesothelial layer of the visceral peritoneum. 1 2 3 4 5 CASE PRESENTATION A 63-year-old woman was admitted to our surgical department with the chief complaint of lower right abdominal pain. The patient had undergone surgery for cervical cancer 20 years ago. Physical examination revealed a soft, slightly tender mass in the right lower abdomen. Laboratory test results did not reveal any abnormalities. Contrast-enhanced CT revealed multiple nonspecific cystic lesions with a maximum diameter of 113 mm located adjacent to the ascending colon. No enhancement was noted after intravenous administration of contrast agents ( Fig. 1 Fig. 2 18 18 18 Fig. 3 en bloc Fig. 4 Fig. 5 Fig. 1 Contrast-enhanced CT findings. The CT images show multicystic lesions located adjacent to the ascending colon. The yellow arrow indicates the tumor. Fig. 2 MRI findings. ( A B Fig. 3 Intraoperative findings. Multicystic lesions adherent to the appendix, cecum, and ascending colon are seen. Fig. 4 The resected tumor tissue. ( A B Fig. 5 Immunohistochemical staining of the tumor. The tumor tissue shows positive staining for CK5/6 ( A B C D E F DISCUSSION BPMM is a particularly rare disease, with fewer than 200 cases reported. 4 4 7 7 8 7 9 4 7 7 en bloc 4 7 10 10 11 12 13 14 en bloc 15 4 7 8 16 18 19 20 21 CONCLUSIONS For complete resection of BPMM adherent to the colon, the tumor and adherent colon should be resected en bloc ACKNOWLEDGMENTS The authors thank all parties who assisted in the preparation of this paper. DECLARATIONS Funding The authors declare that they have not received any funding for this study. Authors’ contributions YK and MM wrote the manuscript. YK, RN, and MM were involved in the clinical management of patients. YK and MM revised the manuscript. All authors have reviewed and approved the final manuscript, and each author agrees to be held accountable for all aspects of the case report. Availability of data and materials Not applicable. Ethics approval and consent to participate This work does not require ethical considerations or approval. Informed consent to participate in this study was obtained from the patient. Consent for publication Informed consent for publication of this case report was obtained from the patient. Competing interests The authors declare that they have no competing interests. REFERENCES 1) Mennemeyer R Smith M Multicystic, peritoneal mesothelioma: a report with electron microscopy of a case mimicking intra-abdominal cystic hygroma (lymphangioma) Cancer 1979 44 692 8 476578 10.1002/1097-0142(197908)44:2<692::aid-cncr2820440242>3.0.co;2-6 2) Pitta X Andreadis E Ekonomou A et al. Benign multicystic peritoneal mesothelioma: a case report J Med Case Rep 2010 4 385 21114811 10.1186/1752-1947-4-385 PMC2999614 3) Weiss SW Tavassoli FA Multicystic mesothelioma. An analysis of pathologic findings and biologic behavior in 37 cases Am J Surg Pathol 1988 12 737 46 3421410 4) Noiret B Renaud F Piessen G et al. Multicystic peritoneal mesothelioma: a systematic review of the literature Pleura Peritoneum 2019 4 20190024 31667333 10.1515/pp-2019-0024 PMC6812218 5) Khurram MS Shaikh H Khan U et al. Benign Multicystic Peritoneal Mesothelioma: a Rare Condition in an Uncommon Gender Case Rep Pathol 2017 2017 9752908 28607791 10.1155/2017/9752908 PMC5451755 6) Pierre K Gomez NF Bing S et al. Benign multicystic peritoneal mesothelioma presenting as a colonic mass Cureus 2021 13 e15540 34277166 10.7759/cureus.15540 PMC8269996 7) Chand MT Edens J Lin T et al. Benign multicystic peritoneal mesothelioma: literature review and update Autops Case Rep 2020 10 e2020159 33344293 10.4322/acr.2020.159 PMC7703464 8) Rapisarda AMC Cianci A Caruso S et al. Benign multicystic mesothelioma and peritoneal inclusion cysts: are they the same clinical and histopathological entities? A systematic review to find an evidence-based management Arch Gynecol Obstet 2018 297 1353 75 29511797 10.1007/s00404-018-4728-2 9) Bhavsar T Saeed-Vafa D Harbison S et al. Retroperitoneal cystic lymphangioma in an adult: a case report and review of the literature World J Gastrointest Pathophysiol 2010 1 171 6 21607159 10.4291/wjgp.v1.i5.171 PMC3097960 10) Murphy B Ismaeil M Winter DC Thinking outside the pelvis: benign peritoneal multicystic mesothelioma of the ascending colon J Surg Case Rep 2019 2023 rjz328 37711845 10.1093/jscr/rjz328 PMC10497441 11) Wang TB Dai WG Liu DW et al. Diagnosis and treatment of benign multicystic peritoneal mesothelioma World J Gastroenterol 2013 19 6689 92 24151400 10.3748/wjg.v19.i39.6689 PMC3801387 12) Kitano S Inomata M Mizusawa J et al. Survival outcomes following laparoscopic versus open D3 dissection for stage II or III colon cancer (JCOG0404): a phase 3, randomised controlled trial Lancet Gastroenterol Hepatol 2017 2 261 8 28404155 10.1016/S2468-1253(16)30207-2 13) Colon Cancer Laparoscopic or Open Resection Study Group Buunen M Veldkamp R Hop WC et al. Survival after laparoscopic surgery versus open surgery for colon cancer: long-term outcome of a randomised clinical trial Lancet Oncol 2009 10 44 52 19071061 10.1016/S1470-2045(08)70310-3 14) Nagasaki T Akiyoshi T Fukunaga Y et al. The short- and long-term feasibility of laparoscopic surgery in colon cancer patients with bulky tumors J Gastrointest Surg 2019 23 1893 9 30706379 10.1007/s11605-019-04114-2 15) van Ruth S Bronkhorst MW van Coevorden F et al. Peritoneal benign cystic mesothelioma: a case report and review of the literature Eur J Surg Oncol 2002 28 192 5 11884057 10.1053/ejso.2000.1215 16) Assaly M Bongiovanni M Kumar N et al. Cytology of benign multicystic peritoneal mesothelioma in peritoneal washings Cytopathology 2008 19 224 8 18476992 10.1111/j.1365-2303.2007.00489.x 17) Samson P Cacala S Rare case of benign multicystic peritoneal mesothelioma ANZ J Surg 2005 75 619 20 15972062 10.1111/j.1445-2197.2005.03448.x 18) Baddoura FK Varma VA Cytologic findings in multicystic peritoneal mesothelioma Acta Cytol 1990 34 524 8 2197841 19) Sánchez Infantes S Lévano-Linares C Diaz Vico T et al. Benign multicystic peritoneal mesothelioma: use of hyperthermic intraperitoneal chemotherapy (HIPEC) Rev Esp Enferm Dig 2025 [Epub ahead of print] 10.17235/reed.2025.11416/2025 40613524 20) Charlaix Hidalgo AL Roux A Charissoux A et al. First case of abdominal and tunica vaginalis multicystic benign mesothelioma: management and review of literature Indian J Surg Oncol 2023 14 Suppl 1 92 6 37359917 10.1007/s13193-022-01693-6 PMC10284750 21) Wu CC Bassi A Onitilo A et al. Intra-operative diagnosis of benign multicystic peritoneal mesothelioma: a case report of rare entity and lessons learned Cureus 2024 16 e60664 38899248 10.7759/cureus.60664 PMC11186218 ",
  "metadata": {
    "Title of this paper": "Intra-operative diagnosis of benign multicystic peritoneal mesothelioma: a case report of rare entity and lessons learned",
    "Journal it was published in:": "Surgical Case Reports",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12476914/"
  }
}