{
  "title": "Paper_922",
  "abstract": "pmc Theranostics Theranostics 1512 theranostics thno Theranostics 1838-7640 Ivyspring International Publisher PMC12486156 PMC12486156.1 12486156 12486156 41041059 10.7150/thno.113940 thnov15p9459 1 Review Dissecting Tertiary Lymphoid Structures in Cancer: Maturation, Localization and Density Su Guang-Liang 1 Zhang Meng-Jie 1 ✉ Li Hao 1 2 ✉ Sun Zhi-Jun 1 2 ✉ 1 2 ✉ Corresponding authors: Zhi-Jun Sun, School and Hospital of Stomatology, Wuhan University, 237 Luoyu Road, Wuhan 430079, Hubei Province, China, Email: sunzj@whu.edu.cn lihaowhusos@whu.edu.cn zhangmengjie@whu.edu.cn Competing Interests: The authors have declared that no competing interest exists. 2025 30 8 2025 15 18 498071 9459 9485 18 3 2025 20 7 2025 30 08 2025 02 10 2025 03 10 2025 © The author(s) 2025 https://creativecommons.org/licenses/by/4.0/ This is an open access article distributed under the terms of the Creative Commons Attribution License ( https://creativecommons.org/licenses/by/4.0/ https://ivyspring.com/terms Tertiary lymphoid structures (TLSs) refer to ectopic lymphoid aggregates that form in non-lymphoid tissues at sites of chronic inflammation including cancers. TLSs have been recognized as significant predictors of the efficacy of immune checkpoint blockade (ICB) therapies and have the potential to elicit robust anti-tumor immune response. However, recent studies have revealed substantial heterogeneity in TLSs across different individuals and cancer types, which directly impacts the effectiveness of anti-tumor immunity. Concretely, the maturation status, localization, and density of TLSs profoundly influence the dynamic interactions among immune cells within these structures, potentially leading to adverse effects. This review provides an in-depth exploration of how the heterogeneity of TLSs influences cellular composition and immune dynamics, with the objective of influencing the efficacy of ICB therapies and modulating prognostic prediction accuracy. Additionally, the potential of combining TLSs with other biomarkers for predicting anti-tumor immunity outcomes is further investigated, alongside the introduction of advanced technologies for evaluating TLS heterogeneity. Collectively, these analyses aim to advance the understanding of TLS heterogeneity and facilitate its translation into clinical and translational medicine applications. Tertiary lymphoid structures Heterogeneity Maturation Localization Density pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement no pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes Introduction Immune checkpoint blockade (ICB) therapy has unleashed anti-tumor immune response, leading to unprecedented durable response rates in various types of cancer 1 2 3 5 6 9 TLSs are ectopic lymphoid aggregates that form within non-lymphoid tissues, capable of locally generating tumor-specific effector T cells, B cells, and antibodies, playing a crucial role in establishing an anti-tumor immune environment 10 12 13 14 15 16 17 10 11 18 19 20 This review summarizes the latest research on TLSs, focusing on immune dynamics in maturation, localization and density (Figure 1 10 11 18 20 Structural characteristics and heterogeneity of TLSs TLSs are temporary immune unit formed in chronic inflammation, featuring distinct T and B cell zones at their core 11 + 21 + 22 + e.g. 18 + 23 + 24 23 25 26 + 10 27 2 However, it is important to note that not all cancer patients possess TLSs, and not all TLSs exhibit complete structures 10 11 18 28 31 30 32 33 6 9 Formation and development of TLSs Similar to SLOs, the formation of TLSs originates from the homing of lymphoid tissue inducer (LTi) cells or their substitute cells to inflammatory sites 10 3 34 37 3 38 40 41 + 41 17 3 Maturation of TLSs TLSs have been found to exhibit two distinct maturation status: mature and immature (Figure 1 10 11 42 10 11 42 10 11 42 e.g. 9 43 44 9 43 44 Definition of TLS maturation The maturation of TLSs can be divided into several status characterized by the accumulation and development of FDCs and GCs 10 11 42 et al. 45 45 6 11 14 18 46 et al. 46 6 9 10 11 42 47 47 49 10 11 42 47 11 49 fh 10 11 42 49 10 11 22 42 49 50 CXCL13 CXCL13 AICDA. The detection and classification of TLS maturation in pathology and clinical practice constitute a significant topic in immunology. In pathological examinations, hematoxylin and eosin/hematoxylin-eosin-saffron (H&E/HES) staining combined with CD3, CD20, and CD23 immunohistochemistry (IHC) are utilized to determine the TLS status 9 30 33 42 51 53 9 53 9 53 54 - 9 53 54 53 53 et al. 9 31 53 54 9 31 53 54 31 33 51 55 Statistical analyses reveal significant inter-individual and inter-tumoral heterogeneity in TLS maturation status 30 32 33 33 30 32 e.g. e.g. 32 Factors contributing to TLS maturation The current approaches have facilitated the regulation of B cell migration and TLS development via 16 17 TDLNs are LNs that receive and process lymph fluid originating from the tumor area 56 via 56 reg 57 reg reg 57 58 et al. 54 54 54 Tumor cells adapt their metabolic pathways to meet the demands of rapid proliferation 59 59 32 22 32 32 et al. 60 fh 60 50 Role of TLS maturation in tumor immunity The effects of TLSs in tumor immunity varies significantly depending on its maturation. Mature TLSs are typically associated with robust anti-tumor immune responses in cancer. Research indicates that B cells within mature TLSs may be a critical determinant of the efficacy of anti-tumor immunity 61 22 62 63 64 66 + 64 65 67 68 + + rm + + reg 67 68 fh 66 69 + fh + + 12 Immature TLS consist of loosely aggregated T cells, B cells, and stromal cells 10 11 42 + + 52 + 52 48 70 reg reg 70 48 The prognostic and predictive value of TLS maturation Currently, a substantial number of clinical studies have found that the maturation of TLSs is associated with prognosis and treatment response in cancer patients. Mature TLSs exhibits positive prognostic and predictive value in various solid tumors, such as ESCC, clear cell renal cell carcinoma (ccRCC), urothelial carcinoma (UCC), and renal cell carcinoma (RCC) 22 30 43 51 30 51 + + + 51 30 42 51 52 70 42 42 30 51 52 70 30 52 30 52 52 Furthermore, several key points about the clinical value of TLS maturation warrant emphasis. The maturation status of TLSs may be one of the most critical predictors of patient prognosis. TLS is commonly used as a parameter for predicting tumor patient survival 6 71 73 74 74 74 55 Localization of TLSs TLSs can be observed within the TME, which includes the tumor core and stroma 10 75 i.e. 1 11 33 51 76 79 e.g. 67 77 80 81 33 51 76 77 82 Definition of TLS localization TLSs localized within intra-tumoral, peri-tumoral, and stromal areas 11 11 30 51 76 79 83 24 33 82 84 85 30 51 55 78 79 83 Quantification of TLS localization relies on the intra-tumoral (T-score) and peri-tumoral (P-score) grading systems 26 55 77 26 55 77 26 55 77 et al. 76 et al. 51 26 55 79 Existing evidence found that TLSs are more abundant in the peri-tumoral areas than in the core of tumors. Through pathological examination, in TLS-positive samples of various solid tumors ( e.g. 51 76 79 20 77 78 et al. 77 20 78 Factors contributing to TLS localization Existing evidence strongly indicates a close association between TLS localization and the state of tumor vasculature 55 76 86 88 87 88 + 87 87 55 76 86 Given the pivotal role of vascular normalization, exploring potential factors that modulate this process such as STING and LIGHT signaling 89 90 91 94 91 94 89 89 90 90 90 95 96 Role of TLS localization in tumor immunity The localization of TLSs directly correlates with their immunological efficacy in TME. When TLSs are located within the tumor, cancer patients generally exhibit enhanced immune response 26 51 76 87 26 55 76 77 83 76 26 55 78 87 h h 87 reg 26 55 78 30 33 51 55 51 30 33 55 As the tumor invasion progresses, TLSs shift to the stromal regions farther from the tumor core and may be less affected by vascular immunity 33 55 83 97 + 83 98 97 99 100 reg 55 30 101 30 + + 101 102 101 102 101 102 The prognostic and predictive value of TLS localization The therapeutic implications of TLSs in cancer are heavily influenced by their localization. The available evidence found that intra-tumoral TLSs may have better prognostic and predictive significance 26 33 76 103 67 + 67 103 103 33 76 77 103 51 76 77 82 77 77 et al. 82 82 30 33 30 33 However, the clinical value of TLS localization may demonstrate heterogeneity across tumor types and disease progression stages. For instance, in HCC, the density of intra-tumoral TLSs is correlated with lower recurrence risk in early-stage patients, yet exhibits limited prognostic value in advanced stages 33 26 55 79 87 79 87 26 55 30 33 51 55 Density of TLSs The presence and density of TLSs vary considerably across different cancer types and individual patients (Figure 1 10 11 18 51 104 106 42 73 87 55 69 107 Definition of TLS density Currently, the definition of TLS density includes absolute TLS counting and the proportional area analysis of TLS. Absolute TLS counting involves characterizing the density of TLSs within a defined region by expressing the number of TLSs per square millimeter 30 33 78 79 + 46 85 108 110 24 26 87 Multiple strategies provide feasible options for quantifying TLS density; however, determining the high and low density of TLSs remains a challenge. A widely applied strategy is the four-tier TLS scoring system 55 77 103 55 77 103 30 33 72 74 85 30 33 72 73 74 85 74 85 Studies have shown that TLSs can be detected in most types of solid tumors 10 11 18 28 31 30 33 73 10 111 62 112 Factors contributing to TLS density Several widely employed cancer therapies, including chemotherapy, radiotherapy, ICB, tumor vaccine and oncolytic virus (OV) have been shown to trigger TLS accumulation within TME 6 37 44 113 114 115 et al. + fh 44 et al. + 116 43 74 In contrast, the impact of radiotherapy on immune cells and TLSs is more complex. Local radiotherapy can stimulate the adaptive immune response crucial for TLS functionality by increasing the expression of MHC I and co-stimulatory molecules 117 118 + reg 119 et al. 113 By targeting pathways such as PD-1/PD-L1 and CTLA-4, ICB therapy reinvigorates T cell-mediated anti-tumor responses and bolsters immune memory, providing a supportive TME for the formation and accumulation of TLSs 2 6 43 120 et al. 6 6 Tumor vaccines induce adaptive immune response through the use of tumor cells or their antigens, thereby inhibiting tumor growth, spread, and recurrence 121 114 122 114 et al. 122 OV is a type of natural or genetically modified virus that can selectively infect and kill tumor cells, causing less damage to normal cells 123 + + 37 124 e.g., CXCR5, LTA, LTB Role of TLS density in tumor immunity In various cancers, such as HNSCC, GC, BC, BCa, an increase in TLS density correlates with enhanced TILs activity 44 72 86 109 110 11 30 42 74 low high 30 42 70 107 125 126 + reg 126 h reg 70 107 125 28 82 Despite the presence of immunosuppressive cells, a higher density of TLSs is generally associated with enhanced anti-tumor immunity across most cancer types 51 79 85 87 + + + + 30 46 48 51 74 127 + + via 22 + + 46 68 106 111 128 129 + 104 105 reg 106 The prognostic and predictive value of TLS density In various human cancers, higher TLS density is correlated with prolonged patient survival and improved response to ICB 6 42 74 85 87 10 11 14 18 55 69 107 et al. reg 55 reg 130 20 46 76 101 102 110 + 46 101 102 + 9 76 110 6 23 55 107 125 131 6 reg 131 1 Therefore, to establish the clinical value of TLS density in practice, it is essential to consider the heterogeneity and balance of cellular components within TLSs. Exploring the clinical significance of TLS classification based on their cellular components may represent a promising strategy 63 107 132 63 63 132 132 + fh 132 reg 132 h 107 107 h 107 Evaluation of TLS heterogeneity The efficacy heterogeneity of ICB has driven the exploration of more precise biomarkers. In recent years, TLSs, as critical hubs of anti-tumor immune responses within TME, have gradually garnered clinical attention 10 11 18 Joint evaluation of TLSs and other biomarkers Evaluating the relationship between TLS metrics and other immunotherapy biomarkers ( e.g. 71 133 134 TMB alters protein structures on a genetic level, generating neoantigenic epitopes that may potentially promote immune activation and the development of TLSs 135 136 et al. 42 7 132 133 et al. 133 133 Elevated levels of neutrophils can suppress lymphocyte and NK cell activation, potentially inhibiting the anti-tumor response mediated by TLSs 137 136 et al. 71 109 72 138 72 109 138 Pre-existing expression of immune checkpoint molecules ( e.g. 3 11 et al. 134 134 Cutting-edge technologies for TLS evaluation Currently, multi-omics technologies including histopathology, genomics, and transcriptomics offer a range of options for the detection and quantification of TLSs (Table 2 4 7 139 141 Spatial omics technologies, including spatial transcriptomics, proteomics, etc., have become key tools for elucidating the relationship between TLSs and tumor immunity 7 142 i.e. 143 et al. 7 + 7 142 142 142 143 Compared to invasive detection methods, radiomics techniques, including computed tomography (CT), positron emission tomography (PET), single-photon emission computed tomography (SPECT), and magnetic resonance imaging (MRI) emerge as a promising non-invasive approach for the detection and assessment of TLSs 16 139 144 145 146 139 et al. 144 144 e.g. 145 145 145 Although these technologies provide non-invasive and real-time alternatives for the detection of TLSs, they still face challenges in terms of accuracy and specificity. In recent years, materials for single-cell imaging have been developed to improve detection accuracy 147 148 Deep learning models can automate the analysis and quantification of complex images and data related to TLSs, and demonstrate the potential to predict patient outcomes 140 149 152 140 149 150 et al. 140 140 149 150 151 152 et al. 151 et al. 152 152 153 3D imaging technology offers a novel perspective for analyzing the spatiotemporal heterogeneity of TLSs 141 154 155 155 155 e.g. e.g. 155 154 154 154 141 141 141 Conclusions and prospects TLSs exhibit marked heterogeneity in maturation, localization and density across tumor types and individuals, profoundly impacting anti-tumor immune effects and clinical value (Table 3 10 11 6 18 26 30 33 132 30 78 79 6 30 33 42 55 77 54 89 114 71 133 134 7 139 141 Optimizing evaluation strategies for TLS heterogeneity To effectively evaluate TLS heterogeneity, unified standards and comprehensive strategies must be established. Currently, there is a lack of standardized quantification criteria for TLSs across different patients and cancer types. Future studies should aim to define standardized criteria for spatial localization (e.g., distinguishing peritumoral from stromal regions) and establish uniform thresholds for classifying TLS density as high or low. For ambiguously defined spatial localization, an alternative strategy is to quantify TLS localization. This approach can be specifically manifested through calculating the precise distances from each target TLS margin to the tumor invasive margin or the interface between the tumor core and the tumor stroma. Through rigorous statistical analysis correlating continuous localization metrics with clinically meaningful endpoints ( e.g. 42 42 30 33 51 55 42 71 134 Advancing assessment technologies for TLS heterogeneity Developing techniques suitable for assessing TLS heterogeneity represents a significant challenge. Recently, advanced technologies such as spatial omics, radiomics, deep learning models, and 3D imaging have emerged, overcoming the limitations of traditional methods and providing new options for the detection and evaluation of TLSs 6 139 141 156 Developing materials for precisely regulating TLS heterogeneity Given the role of TLSs in anti-tumor immunity, developing biomaterials capable of modulating TLS heterogeneity to enhance anti-tumor immune response is crucial. Various materials, such as cytokine-loaded nanoparticles, oncolytic virus vaccines, and bioscaffolds, have been developed to induce TLS formation, demonstrating initial feasibility 157 158 37 158 159 This work was supported by the National Natural Science Foundation of China (NFSC) 82303328 (H.L.), 82472818 (Z.J.S.), 82273202 (Z.J.S.), the Fundamental Research Funds for the Central Universities 2042023kf0141 (H.L.), and 2042022dx0003 (Z.J.S.), National Key Research and Development Program 2022YFC2504200 (Z.J.S.), the Natural Science Foundation of Wuhan 2023020201020516 (H.L.), and the Young Elite Scientist Support Program by CSA 2023PYRC001 (H.L.). Author contributions Zhi-Jun Sun, Hao Li, and Meng-Jie Zhang provided direction and guidance throughout the preparation of this manuscript. Guang-Liang Su drafted the manuscript and prepared the figures and tables. Zhi-Jun Sun, Hao Li, and Meng-Jie Zhang reviewed and revised the manuscript in great depth. All authors read and approved the final manuscript. Abbreviations 3D three-dimensional APCs antigen-presenting cells ASCs antibody-secreting cells AtM atypical memory BC breast cancer BCa bladder cancer B reg regulatory B cells CCA cholangiocarcinoma CCL CC motif chemokine ligand CIN cervical intraepithelial neoplasia COAD colon adenocarcinoma CRC colorectal cancer cSCC cutaneous squamous cell carcinoma CT computed tomography CTLA-4 cytotoxic T-lymphocyte-associated protein-4 CTLs cytotoxic T lymphocytes CXCL CXC motif chemokine ligand CXCR CXC motif chemokine receptor ccRCC clear cell renal cell carcinoma DC-LAMP dendritic cell-lysosomal-associated membrane protein DCs dendritic cells DFS disease-free survival dMMR defective mismatch repair DSS disease-specific survival E-TLSs early tertiary lymphoid structures EF extrafollicular ESCC esophageal squamous cell carcinoma FDCs follicular dendritic cells FRCs fibroblastic reticular cells GC gastric carcinoma GCs germinal centers H&E hematoxylin and eosin HCC hepatocellular carcinoma HES hematoxylin-eosin-saffron HEVs high endothelial venules HNSCC head and neck squamous cell carcinoma ICI immune checkpoint inhibitor ICB immune checkpoint blockade IDO1 indoleamine 23-dioxygenase 1 IFN-γ interferon gamma IHC immunohistochemistry IL-7/IL-7R interleukin-7/interleukin-7 receptor ILCs innate lymphoid cells iCCA intrahepatic cholangiocarcinoma irAEs immune-related adverse events LC lung carcinoma LED light-emitting diode LNs lymph nodes LSCC lung squamous cell carcinoma LT α1β2/LTβR lymphotoxin α1β2/lymphotoxin beta receptor LTi lymphoid tissue inducer LTo lymphoid tissue organizer MDSCs myeloid-derived suppressor cells MHC major histocompatibility complex MIBC muscle-invasive bladder cancer MRI magnetic resonance imaging MSI-H microsatellite instability-high mIF multiplex immunofluorescence mIHC multiplex immunohistochemistry NAC neoadjuvant chemotherapy NK natural killer NLR neutrophil-to-lymphocyte ratio NSCLC non-small cell lung cancer OC ovarian cancer OS overall survival OV oncolytic virus oHSV oncolytic herpes simplex virus-1 PCA primary cardiac angiosarcoma PC pancreatic carcinoma PCa prostate cancer PD-L1 programmed death-ligand 1 PDAC pancreatic ductal adenocarcinoma PCs plasma cells PET positron emission tomography PFL-TLSs primary follicle-like tertiary lymphoid structures PFS progression-free survival RCC renal cell carcinoma SFL-TLSs secondary follicle-like tertiary lymphoid structures SLOs secondary lymphoid organs SPECT single-photon emission computed tomography STS soft-tissue sarcomas TAMs tumor-associated macrophages TDLNs tumor-draining lymph nodes T fh T follicular helper T fr follicular regulatory T cells TGF-β transforming growth factor beta Th T follicular helper T h T helper 2 TILs tumor-infiltrating lymphocytes TLSs tertiary lymphoid structures TMB tumor mutational burden TME tumor microenvironment TNF-α tumor necrosis factor alpha T reg regulatory T cells T rm resident memory T cells uLMS uterine leiomyosarcoma UCC urothelial carcinoma VSMCs vascular smooth muscle cells 1 Ribas A Wolchok JD Cancer immunotherapy using checkpoint blockade Science 2018 359 1350 5 29567705 10.1126/science.aar4060 PMC7391259 2 Morad G Helmink BA Sharma P Wargo JA Hallmarks of response, resistance, and toxicity to immune checkpoint blockade Cell 2021 184 5309 37 34624224 10.1016/j.cell.2021.09.020 PMC8767569 3 Taube JM Klein A Brahmer JR Xu H Pan X Kim JH Association of PD-1, PD-1 ligands, and other features of the tumor immune microenvironment with response to anti-PD-1 therapy Clin Cancer Res 2014 20 5064 74 24714771 10.1158/1078-0432.CCR-13-3271 PMC4185001 4 Bhamidipati D Subbiah V Tumor-agnostic drug development in dMMR/MSI-H solid tumors Trends Cancer 2023 9 10 828 39 37517955 10.1016/j.trecan.2023.07.002 5 Sha D Jin Z Budczies J Kluck K Stenzinger A Sinicrope FA Tumor mutational burden as a predictive biomarker in solid tumors Cancer Discov 2020 10 1808 25 33139244 10.1158/2159-8290.CD-20-0522 PMC7710563 6 Helmink BA Reddy SM Gao J Zhang S Basar R Thakur R B cells and tertiary lymphoid structures promote immunotherapy response Nature 2020 577 549 55 31942075 10.1038/s41586-019-1922-8 PMC8762581 7 Cabrita R Lauss M Sanna A Donia M Skaarup Larsen M Mitra S Tertiary lymphoid structures improve immunotherapy and survival in melanoma Nature 2020 577 561 5 31942071 10.1038/s41586-019-1914-8 8 Petitprez F de Reyniès A Keung EZ Chen TW Sun CM Calderaro J B cells are associated with survival and immunotherapy response in sarcoma Nature 2020 577 556 60 31942077 10.1038/s41586-019-1906-8 9 Vanhersecke L Brunet M Guégan JP Rey C Bougoüin A Cousin S Mature tertiary lymphoid structures predict immune checkpoint inhibitor efficacy in solid tumors independently of PD-L1 expression Nat Cancer 2021 2 8 794 802 35118423 10.1038/s43018-021-00232-6 PMC8809887 10 Sautès-Fridman C Petitprez F Calderaro J Fridman WH Tertiary lymphoid structures in the era of cancer immunotherapy Nat Rev Cancer 2019 19 307 25 31092904 10.1038/s41568-019-0144-6 11 Schumacher TN Thommen DS Tertiary lymphoid structures in cancer Science 2022 375 eabf9419 34990248 10.1126/science.abf9419 12 Li H Zhang MJ Zhang B Lin WP Li SJ Xiong D Mature tertiary lymphoid structures evoke intra-tumoral T and B cell responses via progenitor exhausted CD4 + T cells in head and neck cancer Nat Commun 2025 16 4228 40335494 10.1038/s41467-025-59341-w PMC12059173 13 Pitzalis C Jones GW Bombardieri M Jones SA Ectopic lymphoid-like structures in infection, cancer and autoimmunity Nat Rev Immunol 2014 14 447 62 24948366 10.1038/nri3700 14 Zhao L Jin S Wang S Zhang Z Wang L Chen Z Tertiary lymphoid structures in diseases: immune mechanisms and therapeutic advances Signal Transduct Target Ther 2024 9 1 225 39198425 10.1038/s41392-024-01947-5 PMC11358547 15 Jones GW Hill DG Jones SA Understanding immune cells in tertiary lymphoid organ development: it is all starting to come together Front Immunol 2016 7 401 27752256 10.3389/fimmu.2016.00401 PMC5046062 16 Li H Lin WP Zhang ZN Sun ZJ Tailoring biomaterials for monitoring and evoking tertiary lymphoid structures Acta Biomater 2023 172 1 15 37739247 10.1016/j.actbio.2023.09.028 17 Li H Ding JY Zhang MJ Yu HJ Sun ZJ Tertiary lymphoid structures and cytokines interconnections: The implication in cancer immunotherapy Cancer Lett 2023 568 216293 37392991 10.1016/j.canlet.2023.216293 18 Teillaud JL Houel A Panouillot M Riffard C Dieu-Nosjean MC Tertiary lymphoid structures in anticancer immunity Nat Rev Cancer 2024 24 9 629 46 39117919 10.1038/s41568-024-00728-0 19 Zhang Y Xu M Ren Y Ba Y Liu S Zuo A Tertiary lymphoid structural heterogeneity determines tumour immunity and prospects for clinical application Mol Cancer 2024 23 1 75 38582847 10.1186/s12943-024-01980-6 PMC10998345 20 Munoz-Erazo L Rhodes JL C Marion VC Kemp RA Tertiary lymphoid structures in cancer - considerations for patient prognosis Cell Mol Immunol 2020 17 6 570 5 32415259 10.1038/s41423-020-0457-0 PMC7264315 21 Gu-Trantien C Loi S Garaud S Equeter C Libin M de Wind A CD4⁺ follicular helper T cell infiltration predicts breast cancer survival J Clin Invest 2013 123 2873 92 23778140 10.1172/JCI67428 PMC3696556 22 Meylan M Petitprez F Becht É Bougoüin A Pupier G Calvez A Tertiary lymphoid structures generate and propagate anti-tumor antibody-producing plasma cells in renal cell cancer Immunity 2022 55 3 527 41.e5 35231421 10.1016/j.immuni.2022.02.001 23 Germain C Gnjatic S Tamzalit F Knockaert S Remark R Goc J Presence of B cells in tertiary lymphoid structures is associated with a protective immunity in patients with lung cancer Am J Respir Crit Care Med 2014 189 7 832 44 24484236 10.1164/rccm.201309-1611OC 24 Di Caro G Bergomas F Grizzi F Doni A Bianchi P Malesci A Occurrence of tertiary lymphoid tissue is associated with T-cell infiltration and predicts better prognosis in early-stage colorectal cancers Clin Cancer Res 2014 20 2147 58 24523438 10.1158/1078-0432.CCR-13-2590 25 García-Hernández ML Uribe-Uribe NO Espinosa-González R Kast WM Khader SA Rangel-Moreno J A unique cellular and molecular microenvironment is present in tertiary lymphoid organs of patients with spontaneous prostate cancer regression Front Immunol 2017 8 563 28567040 10.3389/fimmu.2017.00563 PMC5434117 26 Zhang C Wang XY Zuo JL Wang XF Feng XW Zhang B Localization and density of tertiary lymphoid structures associate with molecular subtype and clinical outcome in colorectal cancer liver metastases J Immunother Cancer 2023 11 2 e006425 36759015 10.1136/jitc-2022-006425 PMC9923349 27 Barone F Gardner DH Nayar S Steinthal N Buckley CD Luther SA Stromal fibroblasts in tertiary lymphoid structures: a novel target in chronic inflammation Front Immunol 2016 7 477 27877173 10.3389/fimmu.2016.00477 PMC5100680 28 Liu X Tsang JYS Hlaing T Hu J Ni YB Chan SK Distinct tertiary lymphoid structure associations and their prognostic relevance in HER2 positive and negative breast cancers Oncologist 2017 22 1316 24 28701569 10.1634/theoncologist.2017-0029 PMC5679825 29 Figenschau SL Fismen S Fenton KA Fenton C Mortensen ES Tertiary lymphoid structures are associated with higher tumor grade in primary operable breast cancer patients BMC Cancer 2015 15 101 25884667 10.1186/s12885-015-1116-1 PMC4357183 30 Hayashi Y Makino T Sato E Ohshima K Nogi Y Kanemura T Density and maturity of peritumoral tertiary lymphoid structures in oesophageal squamous cell carcinoma predicts patient survival and response to immune checkpoint inhibitors Br J Cancer 2023 128 2175 85 37016103 10.1038/s41416-023-02235-9 PMC10241865 31 Zhang Y Liu G Zeng Q Wu W Lei K Zhang C CCL19-producing fibroblasts promote tertiary lymphoid structure formation enhancing anti-tumor IgG response in colorectal cancer liver metastasis Cancer cell 2024 42 1370 85.e9 39137726 10.1016/j.ccell.2024.07.006 32 Ma J Wu Y Ma L Yang X Zhang T Song G A blueprint for tumor-infiltrating B cells across human cancers Science 2024 384 eadj4857 38696569 10.1126/science.adj4857 33 Calderaro J Petitprez F Becht E Laurent A Hirsch TZ Rousseau B Intra-tumoral tertiary lymphoid structures are associated with a low risk of early recurrence of hepatocellular carcinoma J Hepatol 2019 70 58 65 30213589 10.1016/j.jhep.2018.09.003 34 van de Pavert SA Olivier BJ Goverse G Vondenhoff MF Greuter M Beke P Chemokine CXCL13 is essential for lymph node initiation and is induced by retinoic acid and neuronal stimulation Nat Immunol 2009 10 1193 9 19783990 10.1038/ni.1789 PMC2771164 35 Morissette MC Jobse BN Thayaparan D Nikota JK Shen P Labiris NR Persistence of pulmonary tertiary lymphoid tissues and anti-nuclear antibodies following cessation of cigarette smoke exposure Respir Res 2014 15 1 49 24754996 10.1186/1465-9921-15-49 PMC4021094 36 Genta RM Hamner HW Graham DY Gastric lymphoid follicles in Helicobacter pylori infection: frequency, distribution, and response to triple therapy Hum Pathol 1993 24 577 83 8505036 10.1016/0046-8177(93)90235-9 37 Zhang MJ Lin WP Wang Q Wang S Song A Wang YY Oncolytic herpes simplex virus propagates tertiary lymphoid structure formation via CXCL10/CXCR3 to boost antitumor immunity Cell Prolif 2024 null: e13740 10.1111/cpr.13740 PMC11693575 39219056 38 A Luther S, K. Mark A, G. Cyster J. Overlapping roles of CXCL13, interleukin 7 receptor α, and CCR7 ligands in lymph node development J Exp Med 2003 197 9 1191 8 12732660 10.1084/jem.20021294 PMC2193976 39 Rangel-Moreno J Carragher DM de la Luz García-Hernández M Hwang JY Kusser K Hartson L The development of inducible bronchus-associated lymphoid tissue depends on IL-17 Nat Immunol 2011 12 7 639 46 21666689 10.1038/ni.2053 PMC3520063 40 Vondenhoff MF Greuter M Goverse G Elewaut D Dewint P Ware CF LTβR signaling induces cytokine expression and up-regulates lymphangiogenic factors in lymph node anlagen J Immunol 2009 182 9 5439 45 19380791 10.4049/jimmunol.0801165 PMC2703443 41 Amisaki M Zebboudj A Yano H Zhang SL Payne G Chandra AK IL-33-activated ILC2s induce tertiary lymphoid structures in pancreatic cancer Nature 2025 638 1076 84 39814891 10.1038/s41586-024-08426-5 PMC11864983 42 Posch F Silina K Leibl S Mündlein A Moch H Siebenhüner A Maturation of tertiary lymphoid structures and recurrence of stage II and III colorectal cancer Oncoimmunology 2018 7 e1378844 29416939 10.1080/2162402X.2017.1378844 PMC5798199 43 van Dijk N Gil-Jimenez A Siliņa K Hendricksen K Smit LA de Feijter JM Preoperative ipilimumab plus nivolumab in locoregionally advanced urothelial cancer: the NABUCCO trial Nat Med 2020 26 12 1839 44 33046870 10.1038/s41591-020-1085-z 44 Zhang L Zhang R Jin D Zhang T Shahatiaili A Zang J Synergistic induction of tertiary lymphoid structures by chemoimmunotherapy in bladder cancer Br J Cancer 2024 130 1221 31 38332180 10.1038/s41416-024-02598-7 PMC10991273 45 Wagner UG Kurtin PJ Wahner A Brackertz M Berry DJ Goronzy JJ The role of CD8+ CD40L+ T cells in the formation of germinal centers in rheumatoid synovitis J Immunol 1998 161 6390 7 9834130 46 Dieu-Nosjean MC Antoine M Danel C Heudes D Wislez M Poulot V Long-term survival for patients with non-small-cell lung cancer with intratumoral lymphoid structures J Clin Oncol 2008 26 27 4410 7 18802153 10.1200/JCO.2007.15.0284 47 Tietscher S Wagner J Anzeneder T Langwieder C Rees M Sobottka B A comprehensive single-cell map of T cell exhaustion-associated immune environments in human breast cancer Nat Commun 2023 14 98 36609566 10.1038/s41467-022-35238-w PMC9822999 48 Meylan M Petitprez F Lacroix L Di Tommaso L Roncalli M Bougoüin A Early hepatic lesions display immature tertiary lymphoid structures and show elevated expression of immune inhibitory and immunosuppressive molecules Clin Cancer Res 2020 26 4381 9 32269054 10.1158/1078-0432.CCR-19-2929 49 Fridman WH Meylan M Pupier G Calvez A Hernandez I Sautès-Fridman C Tertiary lymphoid structures and B cells: An intratumoral immunity cycle Immunity 2023 56 2254 69 37699391 10.1016/j.immuni.2023.08.009 50 Tang Z Bai Y Fang Q Yuan Y Zeng Q Chen S Spatial transcriptomics reveals tryptophan metabolism restricting maturation of intratumoral tertiary lymphoid structures Cancer Cell 2025 43 6 1025 44.e14 40185093 10.1016/j.ccell.2025.03.011 51 Xu W Lu J Liu WR Anwaier A Wu Y Tian X Heterogeneity in tertiary lymphoid structures predicts distinct prognosis and immune microenvironment characterizations of clear cell renal cell carcinoma J Immunother Cancer 2023 11 12 e006667 38040418 10.1136/jitc-2023-006667 PMC10693897 52 J Gunderson A, Rajamanickam V, Bui C, Bernard B, Pucilowska J, Ballesteros-Merino C, et al Oncoimmunology 2021 10 1 1900635 33796412 10.1080/2162402X.2021.1900635 PMC7993148 53 Vanhersecke L Bougoüin A Crombé A Brunet M Sofeu C Parrens M Standardized pathology screening of mature tertiary lymphoid structures in cancers Lab Invest 2023 103 5 100063 36801637 10.1016/j.labinv.2023.100063 54 He M He Q Cai X Liu J Deng H Li F Intratumoral tertiary lymphoid structure (TLS) maturation is influenced by draining lymph nodes of lung cancer J Immunother Cancer 2023 11 4 e005539 37072348 10.1136/jitc-2022-005539 PMC10124324 55 Ding GY Ma JQ Yun JP Chen X Ling Y Zhang S Distribution and density of tertiary lymphoid structures predict clinical outcome in intrahepatic cholangiocarcinoma J Hepatol 2022 76 3 608 618 34793865 10.1016/j.jhep.2021.10.030 56 du Bois H Heim TA Lund AW Tumor-draining lymph nodes: At the crossroads of metastasis and immunity Sci Immunol 2021 6 eabg3551 34516744 10.1126/sciimmunol.abg3551 PMC8628268 57 Ganti SN Albershardt TC Iritani BM Ruddell A Regulatory B cells preferentially accumulate in tumor-draining lymph nodes and promote tumor growth Sci Rep 2015 5 12255 26193241 10.1038/srep12255 PMC4507466 58 Wakasu S Tagawa T Haratake N Kinoshita F Oku Y Ono Y Preventive effect of tertiary lymphoid structures on lymph node metastasis of lung adenocarcinoma Cancer Immunol Immunother 2023 72 1823 34 36688996 10.1007/s00262-022-03353-8 PMC10992259 59 Sun L Zhang H Gao P Metabolic reprogramming and epigenetic modifications on the path to cancer Protein Cell 2022 13 12 877 919 34050894 10.1007/s13238-021-00846-7 PMC9243210 60 Bessede A Peyraud F Le Moulec S Cousin S Cabart M Chomy F Upregulation of indoleamine 2,3-dioxygenase 1 in tumor cells and tertiary lymphoid structures is a hallmark of inflamed non-small cell lung cancer Clin Cancer Res 2023 29 23 4883 93 37756581 10.1158/1078-0432.CCR-23-1928 PMC10690088 61 Fridman WH Meylan M Petitprez F Sun CM Italiano A Sautès-Fridman C B cells and tertiary lymphoid structures as determinants of tumour immune contexture and clinical outcome Nat Rev Clin Oncol 2022 19 441 57 35365796 10.1038/s41571-022-00619-z 62 Cipponi A Mercier M Seremet T Baurain JF Théate I van den Oord J Neogenesis of lymphoid structures and antibody responses occur in human melanoma metastases Cancer Res 2012 72 3997 4007 22850419 10.1158/0008-5472.CAN-12-1377 63 Kroeger DR Milne K Nelson BH Tumor-infiltrating plasma cells are associated with tertiary lymphoid structures, cytolytic t-cell responses, and superior prognosis in ovarian cancer Clin Cancer Res 2016 22 3005 15 26763251 10.1158/1078-0432.CCR-15-2762 64 Wennhold K Thelen M Lehmann J Schran S Preugszat E García-Márquez M CD86+ antigen-presenting b cells are increased in cancer, localize in tertiary lymphoid structures, and induce specific T-cell responses Cancer Immunol Res 2021 9 9 1098 108 34155067 10.1158/2326-6066.CIR-20-0949 65 Kasikova L Rakova J Hensler M Lanickova T Tomankova J Pasulka J Tertiary lymphoid structures and B cells determine clinically relevant T cell phenotypes in ovarian cancer Nat Commun 2024 15 2528 38514660 10.1038/s41467-024-46873-w PMC10957872 66 Gu-Trantien C Migliori E Buisseret L de Wind A Brohée S Garaud S CXCL13-producing TFH cells link immune suppression and adaptive memory in human breast cancer JCI insight 2017 2 11 e91487 28570278 10.1172/jci.insight.91487 PMC5453706 67 Hu C Wang Y Kong D Huang Y Lü J Zhao M Tertiary lymphoid structure-associated B cells enhance CXCL13+CD103+CD8+Trm cell response to PD-1 blockade in gastric cancer Gastroenterology 2024 166 6 1069 84 39491204 10.1053/j.gastro.2023.10.022 68 Sun H Liu Y Cheng W Xiong R Gu W Zhang X The distribution and maturation of tertiary lymphoid structures can predict clinical outcomes of patients with gastric adenocarcinoma Front Immunol 2024 15 1396808 39136032 10.3389/fimmu.2024.1396808 PMC11317265 69 Noël G Fontsa ML Garaud S De Silva P de Wind A Van den Eynden GG Functional Th1-oriented T follicular helper cells that infiltrate human breast cancer promote effective adaptive immunity J Clin Invest 2021 131 10.1172/JCI139905 PMC8483751 34411002 70 Ishigami E Sakakibara M Sakakibara J Masuda T Fujimoto H Hayama S Coexistence of regulatory B cells and regulatory T cells in tumor-infiltrating lymphocyte aggregates is a prognostic factor in patients with breast cancer Breast cancer 2019 26 180 9 30244409 10.1007/s12282-018-0910-4 71 Fukuhara M Muto S Inomata S Yamaguchi H Mine H Takagi H The clinical significance of tertiary lymphoid structure and its relationship with peripheral blood characteristics in patients with surgically resected non-small cell lung cancer: a single-center, retrospective study Cancer Immunol Immunother 2022 71 1129 37 34596720 10.1007/s00262-021-03067-3 PMC10992741 72 Matsuda N Yamamoto H Habu T Iwata K Matsubara K Tanaka S Prognostic impact of tumor-infiltrating lymphocytes, tertiary lymphoid structures, and neutrophil-to-lymphocyte ratio in pulmonary metastases from uterine leiomyosarcoma Ann Surg Oncol 2023 30 8727 34 37658268 10.1245/s10434-023-14176-x PMC10625945 73 Gao J Navai N Alhalabi O Siefker-Radtke A Campbell MT Tidwell RS Neoadjuvant PD-L1 plus CTLA-4 blockade in patients with cisplatin-ineligible operable high-risk urothelial carcinoma Nat Med 2020 26 12 1845 51 33046869 10.1038/s41591-020-1086-y PMC9768836 74 Siliņa K Soltermann A Attar FM Casanova R Uckeley ZM Thut H Germinal centers determine the prognostic relevance of tertiary lymphoid structures and are impaired by corticosteroids in lung squamous cell carcinoma Cancer Res 2018 78 1308 20 29279354 10.1158/0008-5472.CAN-17-1987 75 de Visser KE Joyce JA The evolving tumor microenvironment: From cancer initiation to metastatic outgrowth Cancer cell 2023 41 374 403 36917948 10.1016/j.ccell.2023.02.016 76 Wu YH Wu F Yan GR Zeng QY Jia N Zheng Z Features and clinical significance of tertiary lymphoid structure in cutaneous squamous cell carcinoma J Eur Acad Dermatol Venereol 2022 36 2043 50 35881141 10.1111/jdv.18464 77 Shang T Jiang T Lu T Wang H Cui X Pan Y Tertiary lymphoid structures predict the prognosis and immunotherapy response of cholangiocarcinoma Front Immunol 2023 14 1166497 37234171 10.3389/fimmu.2023.1166497 PMC10206168 78 Wang Q Shen X An R Bai J Dong J Cai H Peritumoral tertiary lymphoid structure and tumor stroma percentage predict the prognosis of patients with non-metastatic colorectal cancer Front Immunol 2022 13 962056 36189233 10.3389/fimmu.2022.962056 PMC9524924 79 Li H Liu H Fu H Li J Xu L Wang G Peritumoral tertiary lymphoid structures correlate with protective immunity and improved prognosis in patients with hepatocellular carcinoma Front Immunol 2021 12 648812 34122408 10.3389/fimmu.2021.648812 PMC8187907 80 Zhang N Liu X Qin J Sun Y Xiong H Lin B LIGHT/TNFSF14 promotes CAR-T cell trafficking and cytotoxicity through reversing immunosuppressive tumor microenvironment Mol Ther 2023 31 9 2575 90 37408308 10.1016/j.ymthe.2023.06.015 PMC10491984 81 Bai X Zhou Y Yokota Y Matsumoto Y Zhai B Maarouf N Adaptive antitumor immune response stimulated by bio-nanoparticle based vaccine and checkpoint blockade J Exp Clin Cancer Res 2022 41 1 132 35392977 10.1186/s13046-022-02307-3 PMC8991500 82 Finkin S Yuan D Stein I Taniguchi K Weber A Unger K Ectopic lymphoid structures function as microniches for tumor progenitor cells in hepatocellular carcinoma Nat Immunol 2015 16 1235 44 26502405 10.1038/ni.3290 PMC4653079 83 Sofopoulos M Fortis SP Vaxevanis CK Sotiriadou NN Arnogiannaki N Ardavanis A The prognostic significance of peritumoral tertiary lymphoid structures in breast cancer Cancer Immunol Immunother 2019 68 1733 45 31598757 10.1007/s00262-019-02407-8 PMC11028375 84 Dieu-Nosjean MC Giraldo NA Kaplon H Germain C Fridman WH Sautès-Fridman C Tertiary lymphoid structures, drivers of the anti-tumor responses in human cancers Immunol Rev 2016 271 260 75 27088920 10.1111/imr.12405 85 Goc J Germain C Vo-Bourgais TK Lupo A Klein C Knockaert S Dendritic cells in tumor-associated tertiary lymphoid structures signal a Th1 cytotoxic immune contexture and license the positive prognostic value of infiltrating CD8+ T cells Cancer Res 2014 74 705 15 24366885 10.1158/0008-5472.CAN-13-1342 86 Liu Z Meng X Tang X Zou W He Y Intratumoral tertiary lymphoid structures promote patient survival and immunotherapy response in head neck squamous cell carcinoma Cancer Immunol Immunother 2023 72 6 1505 21 36481914 10.1007/s00262-022-03310-5 PMC10198854 87 Hiraoka N Ino Y Yamazaki-Itoh R Kanai Y Kosuge T Shimada K Intratumoral tertiary lymphoid organ is a favourable prognosticator in patients with pancreatic cancer Br J Cancer 2015 112 11 1782 90 25942397 10.1038/bjc.2015.145 PMC4647237 88 Hiraoka N Ino Y Yamazaki-Itoh R Tertiary lymphoid organs in cancer tissues Front Immunol 2016 7 244 27446075 10.3389/fimmu.2016.00244 PMC4916185 89 Jin XK Liang JL Zhang SM Ji P Huang QX Qin YT Engineering metal-based hydrogel-mediated tertiary lymphoid structure formation via activation of the STING pathway for enhanced immunotherapy Mater Horiz 2023 10 4365 79 37455643 10.1039/d3mh00748k 90 Huang Y Chen Y Zhou S Chen L Wang J Pei Y Dual-mechanism based CTLs infiltration enhancement initiated by Nano-sapper potentiates immunotherapy against immune-excluded tumors Nat Commun 2020 11 622 32001695 10.1038/s41467-020-14425-7 PMC6992734 91 Remouchamps C Boutaffala L Ganeff C Dejardin E Biology and signal transduction pathways of the lymphotoxin-αβ/LTβR system Cytokine Growth Factor Rev 2011 22 301 10 22152226 10.1016/j.cytogfr.2011.11.007 92 Hua Y Vella G Rambow F Allen E Martinez AA Duhamel M Cancer immunotherapies transition endothelial cells into HEVs that generate TCF1 + T lymphocyte niches through a feed-forward loop Cancer Cell 2022 40 12 1600 18.e10 36423635 10.1016/j.ccell.2022.11.002 PMC9899876 93 Chen G Zheng D Zhou Y Du S Zeng Z Olaparib enhances radiation-induced systemic anti-tumor effects via activating STING-chemokine signaling in hepatocellular carcinoma Cancer Lett 2024 582 216507 38048841 10.1016/j.canlet.2023.216507 94 Li AQ Fang JH Anti-angiogenic therapy enhances cancer immunotherapy: Mechanism and clinical application Interdiscip Med 2024 2 e20230025 95 Amos SM Duong CP Westwood JA Ritchie DS Junghans RP Darcy PK Autoimmunity associated with immunotherapy of cancer Blood 2011 118 499 509 21531979 10.1182/blood-2011-01-325266 96 Filderman JN Appleman M Chelvanambi M Taylor JL Storkus WJ STINGing the tumor microenvironment to promote therapeutic tertiary lymphoid structure development Front Immunol 2021 12 690105 34054879 10.3389/fimmu.2021.690105 PMC8155498 97 Zhang T Lei X Jia W Li J Nie Y Mao Z Peritumor tertiary lymphoid structures are associated with infiltrating neutrophils and inferior prognosis in hepatocellular carcinoma Cancer Med 2023 12 3068 78 36082777 10.1002/cam4.5227 PMC9939159 98 Cortés-Morales VA Chávez-Sanchéz L Rocha-Zavaleta L Espíndola-Garibay S Monroy-García A Castro-Manrreza ME Mesenchymal stem/stromal cells derived from cervical cancer promote M2 macrophage polarization Cells 2023 12 7 1047 37048119 10.3390/cells12071047 PMC10093665 99 Tazzyman S Lewis CE Murdoch C Neutrophils: key mediators of tumour angiogenesis Int J Exp Pathol 2009 90 3 222 31 19563607 10.1111/j.1365-2613.2009.00641.x PMC2697547 100 Li Y Qiu SJ Fan JG Zhou J Gao Q Ye X Intratumoral neutrophils: A poor prognostic factor for hepatocellular carcinoma following resection J Hepatol 2011 54 3 497 505 21112656 10.1016/j.jhep.2010.07.044 101 Bell D Chomarat P Broyles D Netto G Harb GM Lebecque S In breast carcinoma tissue, immature dendritic cells reside within the tumor, whereas mature dendritic cells are located in peritumoral areas J Exp Med 1999 190 1417 26 10562317 10.1084/jem.190.10.1417 PMC2195690 102 Ladányi A Kiss J Somlai B Gilde K Fejos Z Mohos A Density of DC-LAMP(+) mature dendritic cells in combination with activated T lymphocytes infiltrating primary cutaneous melanoma is a strong independent prognostic factor Cancer Immunol Immunother 2007 56 1459 69 17279413 10.1007/s00262-007-0286-3 PMC11030123 103 Di Modugno F Di Carlo A Spada S Palermo B D'Ambrosio L D'Andrea D Tumoral and stromal hMENA isoforms impact tertiary lymphoid structure localization in lung cancer and predict immune checkpoint blockade response in patients with cancer EBioMedicine 2024 101 105003 38340557 10.1016/j.ebiom.2024.105003 PMC10869748 104 Moussion C Girard JP Dendritic cells control lymphocyte entry to lymph nodes through high endothelial venules Nature 2011 479 542 6 22080953 10.1038/nature10540 105 He T Hao Z Lin M Xin Z Chen Y Ouyang W Oncolytic adenovirus promotes vascular normalization and nonclassical tertiary lymphoid structure formation through STING-mediated DC activation OncoImmunology 2022 11 1 2093054 35800155 10.1080/2162402X.2022.2093054 PMC9255224 106 Martinet L Filleron T Le Guellec S Rochaix P Garrido I Girard JP High endothelial venule blood vessels for tumor-infiltrating lymphocytes are associated with lymphotoxin β-producing dendritic cells in human breast cancer J Immunol 2013 191 2001 8 23825314 10.4049/jimmunol.1300872 107 Yamaguchi K Ito M Ohmura H Hanamura F Nakano M Tsuchihashi K Helper T cell-dominant tertiary lymphoid structures are associated with disease relapse of advanced colorectal cancer Oncoimmunology 2020 9 1724763 32117589 10.1080/2162402X.2020.1724763 PMC7028340 108 Sakimura C Tanaka H Okuno T Hiramatsu S Muguruma K Hirakawa K B cells in tertiary lymphoid structures are associated with favorable prognosis in gastric cancer J Surg Res 2017 215 74 82 28688665 10.1016/j.jss.2017.03.033 109 Yamakoshi Y Tanaka H Sakimura C Mori T Deguchi S Yoshii M Association between the preoperative neutrophil-to-lymphocyte ratio and tertiary lymphoid structures surrounding tumor in gastric cancer Mol Clin Oncol 2021 14 4 76 33680464 10.3892/mco.2021.2238 PMC7922788 110 Song IH Heo SH Bang WS Park HS Park IA Kim YA Predictive value of tertiary lymphoid structures assessed by high endothelial venule counts in the neoadjuvant setting of triple-negative breast cancer Cancer Res Treat 2017 49 399 407 27488875 10.4143/crt.2016.215 PMC5398384 111 Remark R Alifano M Cremer I Lupo A Dieu-Nosjean MC Riquet M Characteristics and clinical impacts of the immune environments in colorectal and renal cell carcinoma lung metastases: influence of tumor origin Clin Cancer Res 2013 19 4079 91 23785047 10.1158/1078-0432.CCR-12-3847 112 Lee M Heo SH Song IH Rajayi H Park HS Park IA Presence of tertiary lymphoid structures determines the level of tumor-infiltrating lymphocytes in primary breast cancer and metastasis Mod Pathol 2019 32 1 70 80 30154578 10.1038/s41379-018-0113-8 113 Boivin G Kalambaden P Faget J Rusakiewicz S Montay-Gruel P Meylan E Cellular composition and contribution of tertiary lymphoid structures to tumor immune infiltration and modulation by radiation therapy Front Oncol 2018 8 256 30038899 10.3389/fonc.2018.00256 PMC6046619 114 Maldonado L Teague JE Morrow MP Jotova I Wu TC Wang C Intramuscular therapeutic vaccination targeting HPV16 induces T cell responses that localize in mucosal lesions Sci Transl Med 2014 6 221ra13 10.1126/scitranslmed.3007323 PMC4086631 24477000 115 Zhu S Zhang T Zheng L Liu H Song W Liu D Combination strategies to maximize the benefits of cancer immunotherapy J Hematol Oncol 2021 14 156 34579759 10.1186/s13045-021-01164-5 PMC8475356 116 Lu Y Zhao Q Liao JY Song E Xia Q Pan J Complement signals determine opposite effects of B cells in chemotherapy-induced immunity Cell 2020 180 1081 97.e24 32142650 10.1016/j.cell.2020.02.015 117 Reits E W Hodge J Herberts C A M Groothuis T Chakraborty M K Wansley E Radiation modulates the peptide repertoire, enhances MHC class I expression, and induces successful antitumor immunotherapy J Exp Med 2006 203 5 1259 71 16636135 10.1084/jem.20052494 PMC3212727 118 Gameiro SR Jammeh ML Wattenberg MM Tsang KY Ferrone S Hodge JW Radiation-induced immunogenic modulation of tumor enhances antigen processing and calreticulin exposure, resulting in enhanced T-cell killing Oncotarget 2014 5 2 403 16 24480782 10.18632/oncotarget.1719 PMC3964216 119 De Martino M Daviaud C Diamond JM Kraynak J Alard A Formenti SC Activin A promotes regulatory T-cell-mediated immunosuppression in irradiated breast cancer Cancer Immunol Res 2021 9 89 102 33093219 10.1158/2326-6066.CIR-19-0305 PMC7785684 120 Rodriguez AB Peske JD Woods AN Leick KM Mauldin IS Meneveau MO Immune mechanisms orchestrate tertiary lymphoid structures in tumors via cancer-associated fibroblasts Cell Rep 2021 36 109422 34289373 10.1016/j.celrep.2021.109422 PMC8362934 121 Kaiser J Personalized tumor vaccines keep cancer in check Science 2017 356 122 28408552 10.1126/science.356.6334.122 122 Lutz ER Wu AA Bigelow E Sharma R Mo G Soares K Immunotherapy converts nonimmunogenic pancreatic tumors into immunogenic foci of immune regulation Cancer Immunol Res 2014 2 616 31 24942756 10.1158/2326-6066.CIR-14-0027 PMC4082460 123 Shalhout SZ Miller DM Emerick KS Kaufman HL Therapy with oncolytic viruses: progress and challenges Nat Rev Clin Oncol 2023 20 160 77 36631681 10.1038/s41571-022-00719-w 124 Clubb JHA Kudling TV Heiniö C Basnet S Pakola S Cervera Carrascón V Adenovirus encoding tumor necrosis factor alpha and interleukin 2 induces a tertiary lymphoid structure signature in immune checkpoint inhibitor refractory head and neck cancer Front Immunol 2022 13 794251 35355980 10.3389/fimmu.2022.794251 PMC8959099 125 Gunnarsdóttir FB Briem O Lindgren AY Källberg E Andersen C Grenthe R Breast cancer associated CD169+ macrophages possess broad immunosuppressive functions but enhance antibody secretion by activated B cells Front Immunol 2023 14 1180209 37404831 10.3389/fimmu.2023.1180209 PMC10315498 126 Shields JD Kourtis IC Tomei AA Roberts JM Swartz MA Induction of lymphoidlike stroma and immune escape by tumors that express the chemokine CCL21 Science 2010 328 749 52 20339029 10.1126/science.1185837 127 Giraldo NA Becht E Pagès F Skliris G Verkarre V Vano Y Orchestration and prognostic significance of immune checkpoints in the microenvironment of primary and metastatic renal cell cancer Clin Cancer Res 2015 21 3031 40 25688160 10.1158/1078-0432.CCR-14-2926 128 Suzuki A Masuda A Nagata H Kameoka S Kikawada Y Yamakawa M Mature dendritic cells make clusters with T cells in the invasive margin of colorectal carcinoma J Pathol 2002 196 1 37 43 11748640 10.1002/path.1018 129 Truxova I Kasikova L Hensler M Skapa P Laco J Pecen L Mature dendritic cells correlate with favorable immune infiltrate and improved prognosis in ovarian carcinoma patients J Immunother Cancer 2018 6 139 30526667 10.1186/s40425-018-0446-3 PMC6288908 130 De Simone M Arrigoni A Rossetti G Gruarin P Ranzani V Politano C Transcriptional landscape of human tissue lymphocytes unveils uniqueness of tumor-infiltrating T regulatory cells Immunity 2016 45 1135 47 27851914 10.1016/j.immuni.2016.10.021 PMC5119953 131 Italiano A Bessede A Pulido M Bompas E Piperno-Neumann S Chevreau C Pembrolizumab in soft-tissue sarcomas with tertiary lymphoid structures: a phase 2 PEMBROSARC trial cohort Nat Med 2022 28 6 1199 206 35618839 10.1038/s41591-022-01821-3 132 An Y Sun JX Xu MY Xu JZ Ma SY Liu CQ Tertiary lymphoid structure patterns aid in identification of tumor microenvironment infiltration and selection of therapeutic agents in bladder cancer Front Immunol 2022 13 1049884 36420257 10.3389/fimmu.2022.1049884 PMC9676505 133 Pagliarulo F Cheng PF Brugger L van Dijk N van den Heijden M Levesque MP Molecular, immunological, and clinical features associated with lymphoid neogenesis in muscle invasive bladder cancer Front Immunol 2021 12 793992 35145509 10.3389/fimmu.2021.793992 PMC8821902 134 Deng S Yang X He L Zhang Q Zhao C Meng H Radiotherapy combined with anti-PD-1 and TKI for primary cardiac angiosarcoma considering the joint assessment of TLSs and PD-L1: a case report J Cardiothorac Surg 2024 19 194 38594687 10.1186/s13019-024-02752-5 PMC11003096 135 Schumacher TN Schreiber RD Neoantigens in cancer immunotherapy Science 2015 348 69 74 25838375 10.1126/science.aaa4971 136 Valero C Lee M Hoen D Weiss K Kelly DW Adusumilli PS Pretreatment neutrophil-to-lymphocyte ratio and mutational burden as biomarkers of tumor response to immune checkpoint inhibitors Nat Commun 2021 12 729 33526794 10.1038/s41467-021-20935-9 PMC7851155 137 Shaul ME Fridlender ZG Tumour-associated neutrophils in patients with cancer Nat Rev Clin Oncol 2019 16 601 20 31160735 10.1038/s41571-019-0222-4 138 Komura K Tokushige S Ishida M Hirosuna K Yamazaki S Nishimura K Tertiary lymphoid structure and neutrophil-lymphocyte ratio coordinately predict outcome of pembrolizumab Cancer Sci 2023 114 4622 31 37752769 10.1111/cas.15976 PMC10728008 139 Xie M Gao J Ma X Wu C Zang X Wang Y Consolidation radiographic morphology can be an indicator of the pathological basis and prognosis of partially solid nodules BMC Pulm Med 2022 22 369 36171571 10.1186/s12890-022-02165-x PMC9520850 140 Wang Y Lin H Yao N Chen X Qiu B Cui Y Computerized tertiary lymphoid structures density on H&E-images is a prognostic biomarker in resectable lung adenocarcinoma iScience 2023 26 107635 37664636 10.1016/j.isci.2023.107635 PMC10474456 141 Mai H Luo J Hoeher L Al-Maskari R Horvath I Chen Y Whole-body cellular mapping in mouse using standard IgG antibodies Nat Biotechnol 2024 42 4 617 27 37430076 10.1038/s41587-023-01846-0 PMC11021200 142 Sadeghirad H Monkman J Tan Chin W Liu N Yunis J L Donovan M Spatial dynamics of tertiary lymphoid aggregates in head and neck cancer: insights into immunotherapy response J Transl Med 2024 22 1 677 39049036 10.1186/s12967-024-05409-y PMC11267849 143 Bressan D Battistoni G Hannon GJ The dawn of spatial omics Science 2023 381 eabq4964 37535749 10.1126/science.abq4964 PMC7614974 144 Dorraji ES Oteiza A Kuttner S Martin-Armas M Kanapathippillai P Garbarino S Positron emission tomography and single photon emission computed tomography imaging of tertiary lymphoid structures during the development of lupus nephritis Int J Immunopathol Pharmacol 2021 35 20587384211033683 34344200 10.1177/20587384211033683 PMC8351034 145 Long S Li M Chen J Zhong L Abudulimu A Zhou L Spatial patterns and MRI-based radiomic prediction of high peritumoral tertiary lymphoid structure density in hepatocellular carcinoma: a multicenter study J Immunother Cancer 2024 12 12 e009879 39675785 10.1136/jitc-2024-009879 PMC11647298 146 Braman NM Etesami M Prasanna P Dubchuk C Gilmore H Tiwari P Intratumoral and peritumoral radiomics for the pretreatment prediction of pathological complete response to neoadjuvant chemotherapy based on breast DCE-MRI Breast Cancer Res 2017 19 1 57 28521821 10.1186/s13058-017-0846-1 PMC5437672 147 Beckford Vera DR Smith CC Bixby LM Glatt DM Dunn SS Saito R Immuno-PET imaging of tumor-infiltrating lymphocytes using zirconium-89 radiolabeled anti-CD3 antibody in immune-competent mice bearing syngeneic tumors PloS one 2018 13 e0193832 29513764 10.1371/journal.pone.0193832 PMC5841805 148 Rashidian M Ingram JR Dougan M Dongre A Whang KA LeGall C Predicting the response to CTLA-4 blockade by longitudinal noninvasive monitoring of CD8 T cells J Exp Med 2017 214 2243 55 28666979 10.1084/jem.20161950 PMC5551571 149 van Rijthoven M Balkenhol M Siliņa K van der Laak J Ciompi F HookNet: Multi-resolution convolutional neural networks for semantic segmentation in histopathology whole-slide images Med Image Anal 2021 68 101890 33260110 10.1016/j.media.2020.101890 150 Li Z Jiang Y Li B Han Z Shen J Xia Y Development and validation of a machine learning model for detection and classification of tertiary lymphoid structures in gastrointestinal cancers JAMA network open 2023 6 e2252553 36692877 10.1001/jamanetworkopen.2022.52553 PMC10408275 151 Chen Z Wang X Jin Z Li B Jiang D Wang Y Deep learning on tertiary lymphoid structures in hematoxylin-eosin predicts cancer prognosis and immunotherapy response NPJ Precis Oncol 2024 8 1 73 38519580 10.1038/s41698-024-00579-w PMC10959936 152 Li S Wang Z Huang HD Lee TY Machine learning-based characterization and identification of tertiary lymphoid structures using spatial transcriptomics data Int J Mol Sci 2024 25 7 3887 38612697 10.3390/ijms25073887 PMC11011734 153 Wang B Zou L Chen J Cao Y Cai Z Qiu Y A weakly supervised segmentation network embedding cross-scale attention guidance and noise-sensitive constraint for detecting tertiary lymphoid structures of pancreatic tumors IEEE J Biomed Health Inform 2024 28 2 988 99 38064334 10.1109/JBHI.2023.3340686 154 Randolph GJ Bala S Rahier JF Johnson MW Wang PL Nalbantoglu I Lymphoid aggregates remodel lymphatic collecting vessels that serve mesenteric lymph nodes in Crohn disease Am J Pathol 2016 186 12 3066 73 27746181 10.1016/j.ajpath.2016.07.026 PMC5225286 155 Lin JR Wang S Coy S Yuan C Yapp C Tyler M Multiplexed 3D atlas of state transitions and immune interaction in colorectal cancer Cell 2023 186 2 363 81.e19 36669472 10.1016/j.cell.2022.12.028 PMC10019067 156 Jiang Y Zhou K Sun Z Wang H Xie J Zhang T Non-invasive tumor microenvironment evaluation and treatment response prediction in gastric cancer using deep learning radiomics Cell Rep Med 2023 4 8 101146 37557177 10.1016/j.xcrm.2023.101146 PMC10439253 157 Johansson-Percival A He B Li ZJ Kjellén A Russell K Li J De novo Nat Immunol 2017 18 1207 17 28892469 10.1038/ni.3836 158 Zhang Y Xu J Fei Z Dai H Fan Q Yang Q 3D printing scaffold vaccine for antitumor immunity Adv Mater 2021 33 e2106768 34601760 10.1002/adma.202106768 159 Chelvanambi M Fecek RJ Taylor JL Storkus WJ STING agonist-based treatment promotes vascular normalization and tertiary lymphoid structure formation in the therapeutic melanoma microenvironment J Immunother Cancer 2021 9 2 e001906 33526609 10.1136/jitc-2020-001906 PMC7852948 160 Peske JD Thompson ED Gemta L Baylis RA Fu YX Engelhard VH Effector lymphocyte-induced lymph node-like vasculature enables naive T-cell entry into tumours and enhanced anti-tumour immunity Nat Commun 2015 6 7114 25968334 10.1038/ncomms8114 PMC4435831 161 Hennequin A Derangère V Boidot R Apetoh L Vincent J Orry D Tumor infiltration by Tbet+ effector T cells and CD20+ B cells is associated with survival in gastric cancer patients Oncoimmunology 2016 5 e1054598 27057426 10.1080/2162402X.2015.1054598 PMC4801425 162 Ling Y Zhong J Weng Z Lin G Liu C Pan C The prognostic value and molecular properties of tertiary lymphoid structures in oesophageal squamous cell carcinoma Clin Transl Med 2022 12 10 e1074 36245289 10.1002/ctm2.1074 PMC9574489 163 Tanoue K Ohmura H Uehara K Ito M Yamaguchi K Tsuchihashi K Spatial dynamics of CD39 + CD8 + exhausted T cell reveal tertiary lymphoid structures-mediated response to PD-1 blockade in esophageal cancer Nat Commun 2024 15 9033 39426955 10.1038/s41467-024-53262-w PMC11490492 164 Zhao H Wang H Zhao Y Sun Q Ren X Tumor-resident T cells, associated with tertiary lymphoid structure maturity, improve survival in patients with stage III lung adenocarcinoma Front Immunol 2022 13 877689 35663939 10.3389/fimmu.2022.877689 PMC9161276 165 Carrega P Loiacono F Di Carlo E Scaramuccia A Mora M Conte R NCR(+)ILC3 concentrate in human lung cancer and associate with intratumoral lymphoid structures Nat Commun 2015 6 8280 26395069 10.1038/ncomms9280 166 Yuan H Mao X Yan Y Huang R Zhang Q Zeng Y Single-cell sequencing reveals the heterogeneity of B cells and tertiary lymphoid structures in muscle-invasive bladder cancer J Transl Med 2024 22 1 48 38216927 10.1186/s12967-024-04860-1 PMC10787393 167 Astorri E Scrivo R Bombardieri M Picarelli G Pecorella I Porzia A CX3CL1 and CX3CR1 expression in tertiary lymphoid structures in salivary gland infiltrates: fractalkine contribution to lymphoid neogenesis in Sjogren's syndrome Rheumatology 2014 53 611 20 24324211 10.1093/rheumatology/ket401 168 Wang J Liang Y Xue A Xiao J Zhao X Cao S Intratumoral CXCL13 + CD160 + CD8 + T cells promote the formation of tertiary lymphoid structures to enhance the efficacy of immunotherapy in advanced gastric cancer J Immunother Cancer 2024 12 9 e009603 39244216 10.1136/jitc-2024-009603 PMC11381742 169 Koscsó B Kurapati S Rodrigues RR Nedjic J Gowda K Shin C Gut-resident CX3CR1 hi macrophages induce tertiary lymphoid structures and IgA response in situ Sci Immunol 2020 5 46 eaax0062 32276965 10.1126/sciimmunol.aax0062 PMC7296464 170 Joshi NS Akama-Garren EH Lu Y Lee DY Chang GP Li A Regulatory T cells in tumor-associated tertiary lymphoid structures suppress anti-tumor T cell responses Immunity 2015 43 579 90 26341400 10.1016/j.immuni.2015.08.006 PMC4826619 171 Nayar S Turner JD Asam S Fennell E Pugh M Colafrancesco S Molecular and spatial analysis of tertiary lymphoid structures in Sjogren's syndrome Nat Commun 2025 16 5 39747819 10.1038/s41467-024-54686-0 PMC11697438 172 Yan Y Sun D Hu J Chen Y Sun L Yu H Multi-omic profiling highlights factors associated with resistance to immuno-chemotherapy in non-small-cell lung cancer Nat Genet 2025 57 1 126 39 39658657 10.1038/s41588-024-01998-y 173 Liu Y Ye S He S Chi D Wang X Wen YF Single-cell and spatial transcriptome analyses reveal tertiary lymphoid structures linked to tumour progression and immunotherapy response in nasopharyngeal carcinoma Nat Commun 2024 15 1 7713 39231979 10.1038/s41467-024-52153-4 PMC11375053 174 Hoch T Schulz D Eling N Gómez JM Levesque MP Bodenmiller B Multiplexed imaging mass cytometry of the chemokine milieus in melanoma characterizes features of the response to immunotherapy Sci Immunol 2022 7 eabk1692 35363540 10.1126/sciimmunol.abk1692 175 Gan X Dong W You W Ding D Yang Y Sun D Spatial multimodal analysis revealed tertiary lymphoid structures as a risk stratification indicator in combined hepatocellular-cholangiocarcinoma Cancer Lett 2024 581 216513 38036041 10.1016/j.canlet.2023.216513 176 Wu C Zhang G Wang L Hu J Ju Z Tao H Spatial proteomic profiling elucidates immune determinants of neoadjuvant chemo-immunotherapy in esophageal squamous cell carcinoma Oncogene 2024 43 2751 67 39122893 10.1038/s41388-024-03123-z 177 Yolmo P Rahimi S Chenard S Conseil G Jenkins D Sachdeva K Atypical B cells promote cancer progression and poor response to bacillus Calmette-Guérin in non-muscle invasive bladder cancer Cancer Immunol Res 2024 12 1320 39 38916567 10.1158/2326-6066.CIR-23-1114 PMC11443217 178 L Shiao Stephen, Gouin Kenneth, Ing Nathan, Y. Ho Alice, Basho Reva, Shah Aagam, et al Single-cell and spatial profiling identify three response trajectories to pembrolizumab and radiation therapy in triple negative breast cancer. Cancer Cell 2024 42 1 70 84.e8 38194915 10.1016/j.ccell.2023.12.012 179 Peng X Smithy JW Yosofvand M Kostrzewa CE Bleile M Ehrich FD Decoding spatial tissue architecture: a scalable Bayesian topic model for multiplexed imaging analysis bioRxiv: the preprint server for biology 2024 null 180 Lu H Lou H Wengert G Paudel R Patel N Desai S Tumor and local lymphoid tissue interaction determines prognosis in high-grade serous ovarian cancer Cell Rep Med 2023 4 101092 37348499 10.1016/j.xcrm.2023.101092 PMC10394173 181 Li P Liang Y Zeng B Yang G Zhu C Zhao K Preoperative prediction of intra-tumoral tertiary lymphoid structures based on CT in hepatocellular cancer Eur J Radiol 2022 151 110309 35468444 10.1016/j.ejrad.2022.110309 182 Li Q Liu X Wang D Wang Y Lu H Wen S Prognostic value of tertiary lymphoid structure and tumour infiltrating lymphocytes in oral squamous cell carcinoma Int J Oral Sci 2020 12 1 24 32934197 10.1038/s41368-020-00092-3 PMC7493903 Figure 1 Definition of TLS heterogeneity. (A) Maturation status of TLSs. (B) Localization of TLSs. (C) Density of TLSs. fh reg Figure 2 Cellular composition of TLSs. et al. fh reg Figure 3 Development of TLSs. (A) Induction of TLSs. (B) Initiation of TLSs. e.g. et al. e.g. et al. (C) Maturation of TLSs. h fh reg Figure 4 Cutting-edge technologies for TLS evaluation Table 1 Immune cells in TLSs Cell types Cell subsets Markers Functions Cancer types Cases Prognostic value Predictive value to ICB Ref. Lymphoid cells Naïve T cells CD3 + + + + - + + Develop into functional T cells Melanoma, LC Mice NA NA  160 T h CD3 + + + Promote CTL differentiation MIBC 153 patients Association with longer OS Positive  44 GC 82 patients Association with longer RFS NA  161 PDC 534 patients Association with longer DFS, OS NA  87 T h CD3 + + + + Suppress T h h CRC 67 patients Association with shorter RFS NA  107 T h CD3 + + + + Promote TLS formation ESCC 650 patients Association with longer DFS, OS NA  162 PDC 534 patients Association with longer DFS, OS NA  87 T fh CD3 + + + + ++ Activate GCs development BC 70 patients Association with longer DFS NA  21 MIBC 153 patients Association with longer OS Positive  44 CRCLM 603 patients Association with longer RFS, OS NA  26 iCCA 962 patients Association with longer 5-year OS NA  55 CD3 + + + + ++ HNSCC 14 patients NA Positive  12 T fr CD3 + + + + ++ + Decrease GC B cells and CD8 + BC 179 patients Association with shorter DFS, RFS NA  69 T reg CD3 + + ++ - Block T cells reactivation; iCCA 962 patients Association with shorter 5-year OS NA  55 GC 82 patients Association with shorter RFS NA  161 STS 30 patients Association with shorter RFS, OS Negative  131 T cells CD3 + + + + + - Secrete perforin and/or granzyme ESCC 31 patients NA Positive  163 UCC 45 patients NA Positive  73 Memory T cells CD3 + - + + + Maintain immune memory NSCLC 458 patients NA NA  85 T rm CD3 + + + - - Maintain immune memory; GC 53 patients Association with longer DFS, OS Positive  67 LUAD 49 patients Association with longer DFS NA  164 Naïve B cells CD20 + + + - - Develop into functional B cells Melanoma 46 patients NA Negative  6 GC B cells CD20 + - + + + + Induce clonal expansion and somatic hypermutation; NSCLC 196 patients Association with longer OS NA  23 HGSOC 570 patients Association with longer OS NA  63 Melanoma 46 patients NA Positive  6 Memory B cells CD20 low + +/- Maintain immune memory PDAC 39 patients Association with longer OS NA  52 Melanoma 46 patients NA Positive  6 B reg CD20 + + + + Induce T reg BC 489 patients Association with shorter MFS NA  70 PCs CD20 + - ++ + Secrete anti-tumor abs HGSOC 570 patients Association with longer OS NA  63 RCC 59 patients Association with longer PFS, OS Positive  22 STS 30 patients Association with longer RFS, OS Positive  131 NK cells CD56 + + Execute ADCC HGSOC 167 patients NA NA  129 ILCs-2 CD45⁺CD127⁺CRTH2⁺ KLRG1⁺ Induce TLS initiation PDAC 328 patients Association with longer OS NA  41 ILCs-3 NCR + Induce TLS initiation NSCLC 57 patients NA NA  165 Myeloid cells DCs CD80 + + + Promote T h ccRCC 186 patients Association with longer DFS NA  127 Melanoma 82 patients Association with longer OS NA  102 NSCLC 74 patients Association with longer DSS, DFS, and OS NA  46 CD11c + STS 30 patients Association with longer RFS, OS NA  131 FDCs CD21 + +/- - Support follicular B cells and GCs in TLSs HGSOC 570 patients NA NA  63 NSCLC 196 patients NA NA  23 Neutrophils MPO + + Mediate inflammation; induce tumor angiogenesis PC 17 patients NA NA  25 Macrophages CD64 + + + + Downregulate the GC reaction; recruit regulator cells CRC 67 patients Association with shorter RFS NA  107 Other cells FRCs PDPN + + Direct PCs dissemination; provide structural support RCC 59 patients NA NA  22 CAFs PDPN + - + Orchestrate TLS formation Melanoma Mice NA NA  120 CRC Mice Association with longer OS NA  31 hMENAΔv6 + Inhibit TLS formation NSCLC 2006 patients Association with shorter OS Negative  103 HEVs PECAM1 + + + Recruit lymphocytes TNBC 108 patients Association with pCR NA  110 LECs PECAM1 + ++ ++ + Recruit lymphocytes Melanoma, LC Mice NA NA  160 ADCC: antibody-dependent cellular cytotoxicity; B reg fh fr reg rm Table 2 Current methods to detect and quantify TLSs Methods Identified parameters Advantages Limitations Ref Histopathology H&E/HES staining Cellular morphology, tissue structure Low cost, simple operation, widely application Cannot distinguish specific cells 9 28 51 53 85 87 IHC staining Specific protein localization/expression High specificity, precise localization Limited multiplexing capability, high antibody dependency 44 72 76 82 IF staining Multiprotein colocalization (fluorescent labeling) Multi-color labeling, high resolution (200 nm) Autofluorescence interference 7 82 120 166 mIHC/mIF staining Multiple protein markers Multi-parametric (4-8 markers) Antibody cross-reactivity 26 42 44 51 54 107 Traditional protein assay methods​ Western blot Specific protein expression High specificity, semi-quantitative Low throughput 167 168 ELISA Soluble protein concentration High throughput, quantitative accuracy Single-plex detection, antibody-dependent 23 167 169 Flow cytometry Cell surface/intracellular molecular markers Multi-parametric (10 + Limited to cell suspensions, high instrument cost 6 63 120 170 CyTOF Metal-tagged proteins Multi-parametric (40 + High instrument cost, complex sample preparation 6 71 Genomics MSI/MSS analysis Microsatellite stability Simple and cost-effective compared to whole-genome sequencing. Low sensitivity 24 42 78 CGH analysis Genome copy number variation Genome-wide coverage, high resolution Cannot detect balanced translocations or point mutations  82 Transcriptomics mRNA microarray analysis Whole transcriptome expression profile High throughput, moderate cost Limited to known transcripts, narrow dynamic range 6 7 21 26 RNA-seq Whole transcriptome expression profile Discovery of novel transcripts High cost, complex data analysis 6 48 52 76 scRNA-seq Single cell RNA expression profile Single-cell resolution Extremely high cost, technically demanding 6 7 44 47 171 Spatial transcriptomics GeoMx DSP Spatial multi-omics (RNA/ protein) Preserves spatial context, multi-target analysis Limited resolution (10-100 μm) 103 142 162 172 10x Visium Whole transcriptome spatial localization Moderate resolution (55 μm, 2μm (HD version)), compatible with FFPE/fresh-frozen tissues High sample preparation requirements 172 173 Stereo-seq​ Subcellular spatial transcriptome Ultra-high resolution (0.5 μm) Massive data storage/computational demands  173 Spatial proteomics IMC Metal-tagged proteins Multi-parametric (40 + High instrument cost, complex metal-labeled antibody preparation 47 174 176 GeoMx DSP Spatial multi-omics (RNA/ protein) Preserves spatial context, multi-target analysis Limited resolution (10-100 μm) 7 142 171 177 CyCIF Fluorescently labeled proteins High throughput (4-5 cycles, 30 + Photobleaching, time-consuming cycles  155 CODEX DNA-barcoded proteins Ultra-high-parametric (50 + Complex decoding workflow, antibody validation challenges 178 179 Radiomics CT Anatomical structure, density difference Rapid, widely application Radiation exposure, low soft-tissue contrast 139 180 181 SPECT Blood flow/metabolic distribution Multi-target imaging Low resolution, time-consuming  144 MRI Soft tissue contrast No radiation, high resolution Long scan times, high cost  145 Deep learning model Automatic image/data feature extraction Handles complex data, high predictive power Requires large annotated datasets 140 149 152 3D imaging technique 3D structure reconstruction Enables 3D visualization High equipment cost, complex data processing 141 154 155 3D: three-dimensional; CGH: comparative genomic hybridization; CODEX: co-detection by indexing; CT: computed tomography; CyCIF: cyclic immunofluorescence; CyTOF: cytometry by time-of-flight; ELISA: enzyme-linked immunosorbent assay; FFPE: formalin fixed paraffin embedded; GeoMx DSP: GeoMx digital spatial profiler; H&E: hematoxylin and eosin; HES: hematoxylin-eosin-saffron; IHC: immunohistochemistry; IF: immunofluorescence; IMC: imaging mass cytometry; mIHC: multiplex immunohistochemistry; mIF: multiplex immunofluorescence; MRI: magnetic resonance imaging; MSI/MSS: microsatellite instability or stability; PET: positron emission tomography; RNA-seq: RNA sequencing; scRNA-seq: single-cell RNA sequencing; SPECT: single-photon emission computed tomography. Table 3 The prognostic and predictive value of different TLS characteristics in different cancer types TLS parameters Cancer types Cases Received treatments Prognostic value Predictive value to ICB Ref. Maturation Immature TLSs E-TLSs CRC 109 patients Surgical resection; chemotherapy Association with higher risk of recurrence NA  42 LSCC 138 patients Surgical resection; NAC Association with shorter PFS, DFS, and OS NA  74 PDAC 63 patients Surgical resection Association with longer PFS, OS NA  52 BC 489 patients Surgical resection Association with shorter FS NA  70 ESCC 34 patients ICB (αPD-1); surgical resection No clinical association No clinical association  30 MIBC 153 patients ICB (αPD-1); NAC Association with shorter OS Negative  44 ccRCC 395 patients Surgical resection Association with shorter PFS, OS NA  51 UCC 24 patients ICB (αPD-1 + αCTLA-4); surgical resection NA Negative  43 6 tumor types and others 328 patients ICB (αPD-1); surgical resection Association with shorter PFS, OS Negative  9 Mature TLSs PFL-TLSs HCC 273 patients Surgical resection Association with lower risk of recurrence NA  33 LSCC 138 patients Surgical resection; NAC Association with shorter PFS, DFS, and OS NA  74 CRC 109 patients Surgical resection; chemotherapy Association with lower risk of recurrence NA  42 ESCC 34 patients ICB (αPD-1); surgical resection Association with longer PFS Positive  30 MIBC 153 patients ICB (αPD-1); NAC Association with shorter OS Negative  44 UCC 24 patients ICB (αPD-1 + αCTLA-4); surgical resection NA Positive  43 ccRCC 395 patients Surgical resection Association with shorter PFS, OS NA  51 6 tumor types and others 328 patients ICB (αPD-1); surgical resection Association with shorter PFS, OS Negative  9 SFL-TLSs HCC 273 patients Surgical resection Association with lower risk of recurrence NA  33 LSCC 138 patients Surgical resection; NAC Association with longer PFS, DFS, and OS NA  74 CRC 109 patients Surgical resection; chemotherapy Association with lower risk of recurrence NA  42 PDAC 63 patients Surgical resection Association with longer DFS NA  52 RCC 59 patients ICB (αPD-1 + αCTLA-4); surgical resection Association with longer PFS, OS Positive  22 MIBC 153 patients ICB (αPD-1); NAC Association with longer OS Positive  44 ccRCC 395 patients Surgical resection Association with longer PFS, OS NA  51 BCa 408 patients ICB (αPD-1/αCTLA-4/αPD-1 + αCTLA-4); chemotherapy Association with longer OS Positive  132 ESCC 34 patients ICB (αPD-1); surgical resection Association with longer PFS Positive  30 UCC 24 patients ICB (αPD-1 + αCTLA-4); surgical resection NA Positive  43 6 tumor types and others 328 patients ICB (αPD-1); surgical resection Association with longer PFS, OS Positive  9 Localization Intra-tumoral TLSs NSCLC 74 patients Surgical resection Association with longer DSS, DFS, and OS NA  46 PDC 534 patients Surgical resection; chemotherapy; radiotherapy Association with longer DFS, OS NA  87 HCC 273 patients Surgical resection Association with lower risk of recurrence NA  33 HCC 360 patients Surgical resection Association with lower risk of recurrence NA  79 CCA 471 patients ICB (αPD-1); surgical resection; chemotherapy Association with longer OS Positive  77 CRCLM 603 patients Surgical resection; NAC Association with longer RFS, OS NA  26 GC 53 patients ICB (αPD-1); surgical resection Association with longer OS Positive  67 ccRCC 395 patients Surgical resection Association with longer PFS, OS NA  51 Peri-tumoral TLSs HCC 360 patients Surgical resection Association with longer RFS, OS NA  79 iCCA 962 patients Surgical resection Association with shorter 5-year OS NA  55 CCA 471 patients ICB (αPD-1); surgical resection; chemotherapy Association with shorter OS Negative  77 CRC 174 patients Surgical resection Association with longer RFS, OS NA  78 CRCLM 603 patients Surgical resection; NAC Association with shorter RFS, OS NA  26 Cutaneous melanoma 82 patients Surgical resection; chemotherapy; radiotherapy Association with longer OS NA  102 ccRCC 186 patients Surgical resection Association with longer DFS NA  127 ccRCC 395 patients Surgical resection Association with shorter PFS, OS NA  51 GC 53 patients ICB (αPD-1); surgical resection Association with longer OS Positive  67 ESCC 34 patients ICB (αPD-1); surgical resection Association with longer PFS Positive  30 Stromal TLSs HCC 273 patients Surgical resection No clinical association NA  33 HCC 82 patients Surgical resection Association with higher risk of recurrence NA  82 GC 53 patients ICB (αPD-1); surgical resection Association with shorter OS Negative  67 ccRCC 395 patients Surgical resection Association with shorter PFS, OS NA  51 Density CRC 109 patients Surgical resection; chemotherapy Association with lower risk of recurrence NA  42 NSCLC 458 patients Surgical resection Association with reduced risk of death NA  85 NSCLC 147 patients Surgical resection Association with longer DFS NA  71 LSCC 138 patients Surgical resection; NAC Association with longer PFS, DFS, and OS NA  74 OSCC 168 patients NA Association with longer RFS, 5-year OS NA  182 Melanoma 46 patients ICB (αPD-1/αPD-1 + αCTLA-4); surgical resection NA Positive  6 Melanoma Mice ICB (αPD-1/αPD-1 + αCTLA-4) Association with longer OS Positive  120 MIBC 153 patients ICB (αPD-1); NAC Association with longer OS Positive  44 uLMS 102 patients Surgical resection Association with longer OS NA  72 ESCC 34 patients ICB (αPD-1); surgical resection Association with longer PFS Positive  30 PDC 534 patients Surgical resection; chemotherapy; radiotherapy Association with longer DFS, OS NA  87 UCC 45 patients ICB (αPD-1 + αCTLA-4); surgical resection Association with longer RFS, OS Positive  73 ccRCC 395 patients Surgical resection No clinical association NA  51 BC: breast carcinoma; BCa: bladder cancer; CRC: colorectal carcinoma; CRCLM: colorectal cancer liver metastases; CTLA-4: cytotoxic T-lymphocyte-associated protein-4; ccRCC: clear cell renal cell carcinoma; DFS: disease-free survival; DSS: disease-specific survival; E-TLSs: early tertiary lymphoid structures; ESCC: esophageal squamous cell carcinoma; GC: gastric carcinoma; HCC: hepatocellular carcinoma; ICB: immune checkpoint blockade; iCCA: intrahepatic cholangiocarcinoma; LSCC: lung squamous cell carcinoma; MIBC: muscle invasive bladder carcinoma; NAC: neoadjuvant chemotherapy; NSCLC: non-small cell lung carcinoma; OS: overall survival; OSCC: oral squamous cell carcinoma; PD-1:programmed cell death protein 1; PDAC: pancreatic ductal adenocarcinoma; PDC: pancreatic ductal carcinoma; PFL-TLSs: primary follicle-like tertiary lymphoid structures; PFS: progression-free survival; RCC: renal cell carcinoma; RFS: relapse-free survival; SFL-TLSs: secondary follicle-like tertiary lymphoid structures; TNBC: triple-negative breast carcinoma; uLMS: uterine leiomyosarcoma; UCC: urothelial carcinoma. ",
  "metadata": {
    "Title of this paper": "Prognostic value of tertiary lymphoid structure and tumour infiltrating lymphocytes in oral squamous cell carcinoma",
    "Journal it was published in:": "Theranostics",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12486156/"
  }
}