{
  "title": "Paper_802",
  "abstract": "pmc Biomed Rep Biomed Rep 2309 br BR Biomedical Reports 2049-9434 2049-9442 Spandidos Publications PMC12464470 PMC12464470.1 12464470 12464470 41020260 10.3892/br.2025.2055 BR-23-5-02055 1 Articles Hsa_circ_0122913 suppresses the proliferation and osteogenic differentiation of bone marrow mesenchymal stem cells and is involved in the effects of icariin treatment via sponging miR-501-5p Wang Yeqing 1 Liu Minbo 2 Liu Changhua 2 Hong Huafeng 1 1 2 Correspondence to: honghuafeng1981@163.com 11 2025 16 9 2025 23 5 496452 177 02 4 2024 29 7 2025 16 09 2025 27 09 2025 29 09 2025 Copyright: © 2025 Wang et al. 2025 https://creativecommons.org/licenses/by-nc-nd/4.0/ This is an open access article distributed under the terms of the Creative Commons Attribution-NonCommercial-NoDerivs License Circular RNAs (circRNAs) play significant roles in several biological events. It has been revealed that hsa_circ_0122913 was upregulated in peripheral blood samples from patients with senile osteoporotic vertebral compression fracture. Therefore, the present study aimed to investigate the role of hsa_circ_0122913 in osteoporosis and more particularly its effect on the proliferation and osteogenic differentiation of bone marrow mesenchymal stem cells (BMSCs). In addition, the involvement of hsa_circ_0122913 in the effectiveness of icariin treatment in BMSCs was also explored. For functional experiments, BMSCs were transfected with short hairpin RNAs targeting hsa_circ_0122913 and defective in cullin neddylation 1 domain containing 1 (DCUN1D1). To determine BMSCs viability and apoptosis, Cell Counting Kit 8 (CCK-8) and Annexin V-APC/7-AAD assays were carried out, respectively. Furthermore, the expression levels of hsa_circ_0122913, osteopontin (OPN), runt-related transcription factor 2 (RUNX2), osterix (OSX) and DCUN1D1 were measured by reverse transcription-quantitative PCR (RT-qPCR) and western blot analysis. The CircBank database was used to predict the potential binding sites of microRNA (miR)-501-5p οn hsa_circ_0122913. The binding capacity of miR-501-5p on hsa_circ_0122913 was then verified by dual-luciferase assay. Finally, alizarin red staining was used to observe the degree of osteogenic differentiation. The CCK-8 and Annexin V-APC/7-AAD assay results demonstrated that hsa_circ_0122913 knockdown in BMSCs improved cell viability and attenuated cell apoptosis. Additionally, the RT-qPCR and western blot analysis results revealed that hsa_circ_0122913 silencing could enhance the mRNA and protein expression levels of OSX, RUNX2 and OPN. Furthermore, the results indicated that hsa_circ_0122913 could sponge miR-501-5p, while the hsa_circ_0122913/DCUN1D1 axis could be involved in the beneficial effects of icariin on BMSCs and more particularly on promoting cell viability and osteogenic differentiation. Overall, the current study suggested that hsa_circ_0122913 could be a novel biomarker for identifying individuals at high risk of osteoporosis, thus being involved in the prevention and treatment of the disease. hsa_circ_0122913 osteogenic differentiation osteoporosis icariin Funding: pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement yes pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes Introduction Osteoporosis, which is characterized by low bone mass and microarchitectural deterioration of the bone tissue, is a significant public health issue ( 1-3 1 2 4 3 5 Human bone metabolism is a complex process that involves bone absorption mediated by osteoclasts and osteoblast-mediated bone formation ( 6 7 Bone marrow mesenchymal stem cells (BMSCs), which were first isolated from bone marrow and named by Friedenstein et al 8 9 10 11 11 12 13 14 15 16 Although circular RNAs (circRNAs/circ) are classified as non-coding RNAs, several of them exert protein-coding potential ( 17 18 4 19 19-21 22 23 21 23 24 in vitro 25 Materials and methods Cell culture and treatment The human BMSC cell line (cat. no. HUXMA-01001, passage 2 upon receipt) was obtained from Cyagen Biosciences Inc. and cultured in BMSCs growth medium (Cyagen Biosciences, Inc.) at 37˚C in an incubator with 5% CO 2 -6 Reverse transcription-quantitative PCR (RT-qPCR) Following culture and treatment with the indicated compounds, BMSCs were collected, and total RNA was then isolated using the Total RNA Rapid Extraction Kit (cat. no. GK3016; Generay Biotech Co., Ltd.). Subsequently, total RNA was reverse transcribed into cDNA using the HiScript II Q RT SuperMix (cat. no. R222-01; Vazyme Biotech Co., Ltd.) strictly according to the manufacturer's protocols. qPCR was performed using the ChamQ SYBR Color qPCR Master Mix Kit (cat. no. Q411-02; Vazyme Biotech Co., Ltd.) on the CFX Connect Real-Time PCR System (Bio-Rad Laboratories, Inc.). The thermocycling protocol included an initial denaturation step at 95.0˚C for 30 sec followed by 40 cycles consisting of 95.0˚C for 10 sec and 60.0˚C for 30 sec, with a final melt curve analysis performed from 70˚C to 95˚C using 0.5˚C increments and 5-sec holds at each temperature step. The expression levels of target genes were normalized to β-actin as the housekeeping gene, and relative gene expression was calculated using the 2 -ΔΔCq 26 Table I Alizarin red staining BMSCs at a density of 6x10 4 Osteogenic differentiation assay The differentiation potential of osteocytes was verified using a differentiation assay. Briefly, BMSCs at a density of 6x10 4 Western blot analysis Total proteins were extracted from BMSCs using a Cell Lysis Buffer for Western and IP (Beyotime Institute of Biotechnology) supplemented with 1 mM phenyl-methyl-sulfonyl fluoride (Beyotime Institute of Biotechnology). Subsequently, the protein concentration was determined using a bicinchoninic protein assay kit (Beyotime Institute of Biotechnology). The protein extracts were then separated by 10% sodium dodecyl sulfate-polyacrylamide gel electrophoresis, with 30 µg of protein loaded per lane, followed by transferring onto polyvinylidene fluoride membranes (MilliporeSigma). Following blocking with 5% fat-free milk at room temperature for 1 h, the membranes were incubated with primary antibodies at 4˚C overnight, followed by washing with Tris-buffer saline containing 0.05% Tween-20 (TBST) for three times for 10 min each. Subsequently, the membranes were incubated with the corresponding secondary antibodies at room temperature for 1 h and washed again with TBST. The protein bands were visualized using an enhanced chemiluminescence kit (Beyotime Institute of Biotechnology) and images were captured using an automatic chemiluminescence imaging analysis system (Bio-Rad Laboratories, Inc.). The densitometric analysis of the protein bands was performed using ImageJ software (version 1.4.3.67; National Institutes of Health). The primary antibodies used against defective in cullin neddylation 1 domain containing 1 (DCUN1D1; cat. no. ab181233; 1:5,000), osterix (OSX; cat. no. ab209484; 1:1,000), runt-related transcription factor 2 (Runx2; cat. no. ab236639; 1:1,000) and osteopontin (OPN; cat. no. ab214050; 1:1,000) were all purchased from Abcam. The anti-β-actin primary antibody (cat. no. ab008; 1:5,000) was obtained from Hangzhou MultiSciences (Lianke) Biotech Co., Ltd. The corresponding peroxidase-conjugated secondary antibodies, including goat anti-mouse IgG (cat. no. GAM007, 1:5,000) and goat anti-rabbit IgG (cat. no. GAR0072, 1:5,000), were also obtained from Hangzhou MultiSciences (Lianke) Biotech Co., Ltd. Annexin V-APC/7-AAD assay Cell apoptosis was assessed using an Annexin V-APC/7-AAD apoptosis kit [Hangzhou MultiSciences (Lianke) Biotech Co., Ltd.]. Briefly, cells were collected after trypsinization without EDTA at 48 and 72 h, and 7 days of cell proliferation, followed by washing twice with PBS. The cells were resuspended in binding buffer with Annexin V-APC (5 µl/tube) and 7-AAD (10 µl/tube) and incubated in the dark at 4˚C for 5 min. Finally, cells were analyzed using a BD Accuri ™ Cell transfection For silencing experiments, viral particles encompassing short hairpin (sh)RNAs targeting hsa_circ_0122913 and DCUN1D1, and their corresponding negative control (NC) shRNAs were purchased from Hanbio Biotechnology Co., Ltd. For transfection, BMSCs at a density of 4x10 4 8 2 Table II Cell counting kit 8 (CCK-8) assay The cultured BMSCs were reaped and seeded into 96-well plates (density, 8x10 3 2 Dual-luciferase reporter assay Bioinformatics analysis using the CircBank database ( http://www.circbank.cn/ Renilla Statistical analysis All quantitative data were obtained from at least three biological replicates and are expressed as the mean ± standard deviation. All analyses were performed using GraphPad Prism 9.0 (GraphPad Software, Inc.; Dotmatics). For comparisons between two groups, independent unpaired t-tests were used. For multiple group comparisons, one-way ANOVA was performed, followed by Tukey's post-hoc test for pairwise comparisons. P<0.05 was considered to indicate a statistically significant difference. Results Hsa_circ_0122913 suppresses the proliferation and osteogenic differentiation of BMSCs in vitro To investigate the effect of hsa_circ_0122913 on the proliferation and osteogenic differentiation of BMSCs, hsa_circ_0122913 was silenced in BMSCs using the corresponding shRNAs. Therefore, the RT-qPCR results showed that sh-circ_0122913-1 significantly decreased the expression levels of hsa_circ_0122913 in BMSCs. Therefore, hsa_circ_0122913-sh1 was used in the subsequent experiments ( Fig. 1A Fig. 1B Figs. 1C S1 Fig. 1D Fig. 1E F Hsa_circ_0122913 acts a ceRNA for miR-501-5p The aforementioned results suggested that hsa_circ_0122913 could play a key role in the occurrence and development of osteoporosis. Therefore, it was hypothesized that hsa_circ_0122913 could regulate the expression levels of miRNAs via a ceRNA network. Bioinformatics analysis predicted that hsa_circ_0122913 encompassed a binding site for miR-501-5p ( Fig. 2A Fig. 2B Icariin treatment and DCUN1D1 knockdown can promote the proliferation and osteogenic differentiation of BMSCs in vitro Bioinformatics analysis using the CircBank database predicted that DCUN1D1 could be a host gene of hsa_circ_0122913. Therefore, shRNAs were used to knockdown DCUN1D1 in BMSCs and the RT-qPCR results showed that DCUN1D1 expression was most significantly decreased in BMSCs transfected with DCUN1D1-sh1 ( Fig. 3A Fig. 3B Fig. 3C Hsa_circ_0122913/DCUN1D1 axis is involved in the effects of icariin treatment on BMSCs The aforementioned results suggested that the effects of icariin on the proliferation and differentiation ability of BMSCs were similar to those observed in circ_0122913- or DCUN1D1-depleted BMSCs. However, no association between icariin and the hsa_circ_0122913/DCUN1D1 pathway was obtained. Therefore, RT-qPCR and western blot analyses were performed to verify that icariin could suppress the mRNA expression levels of hsa_circ_0122913 ( Fig. 4A Fig. 4B C Fig. 4B C Fig. 4A Discussion CircRNAs are a relatively new class of non-coding RNAs that play significant roles in several biological processes. Therefore, circRNAs are considered as potential therapeutic biomarkers in various diseases ( 27 28 29 30 31 32 24 in vitro CeRNA networks, where competitive non-coding RNAs and miRNAs regulate target gene expression, are considered as a typical mechanism of action of non-coding RNAs ( 28 24 33 34 The regulation of circRNA expression and its interplay with host genes is complex and depending on context. Indeed, emerging evidence suggests that circRNAs can regulate the expression of host genes ( 35 36 37 38 39 Furthermore, DCUN1D1 knockdown and icariin treatment were found to enhance the viability and osteogenic differentiation potential of BMSCs. Additionally, the RT-qPCR and western blot analysis results showed that icariin treatment could regulate the expression of hsa_circ_0122913 and DCUN1D1, thus indicating that the hsa_circ_0122913/DCUN1D1 axis could be involved in the effect of icariin treatment on BMSCs. Previous studies demonstrated that DCUN1D1 could serve a key role in tumor progression ( 40 41 42 + 43 et al 44 Although the results of the present study could be helpful in the investigation of the molecular mechanisms associated with osteoporosis, the present study has some limitations. Firstly, while the experimental design used in previous studies was referenced ( 45 46 In conclusion, the results of the current study showed that hsa_circ_0122913 could suppress the proliferation and osteogenic differentiation of BMSCs via sponging miR-501-5p. Furthermore, hsa_circ_0122913 and DCUN1D1 could be involved in icariin-regulated biological events in BMSCs. Overall, the aforementioned results could provide novel insights into the development of new therapies for osteoporosis. Supplementary Material Flow cytometric analysis of apoptosis in the hsa_circ_0122913-knockdown BMSC group at 48, 72 h and 7 days. BMSC, bone marrow mesenchymal stem cell. Acknowledgements Not applicable. Availability of data and materials The data generated in the present study may be requested from the corresponding author. Authors' contributions HH designed the study. YW, ML and CL performed the experiments and analyzed the results. YW and ML confirm the authenticity of all the raw data. YW and HH wrote the manuscript. All authors read and approved the final version of the manuscript. Ethics approval and consent to participate Not applicable. Patient consent for publication Not applicable. Competing interests The authors declare that they have no competing interests. References 1 Lane NE Epidemiology, etiology, and diagnosis of osteoporosis Am J Obstet Gynecol 194 (Suppl 2) S3 S11 2006 10.1016/j.ajog.2005.08.047 16448873 2 Wang Y Tao Y Hyman ME Li J Chen Y Osteoporosis in China Osteoporos Int 20 1651 1662 2009 10.1007/s00198-009-0925-y 19415374 3 Johnston CB Dagar M Osteoporosis in older adults Med Clin North Am 104 873 884 2020 10.1016/j.mcna.2020.06.004 32773051 4 Ji H Cui X Yang Y Zhou X CircRNA hsa_circ_0006215 promotes osteogenic differentiation of BMSCs and enhances osteogenesis-angiogenesis coupling by competitively binding to miR-942-5p and regulating RUNX2 and VEGF Aging (Albany NY) 13 10275 10288 2021 10.18632/aging.202791 33819188 PMC8064180 5 Anthamatten A Parish A Clinical update on osteoporosis J Midwifery Womens Health 64 265 275 2019 10.1111/jmwh.12954 30869832 6 Yang Y Yujiao W Fang W Linhui Y Ziqi G Zhichen W Zirui W Shengwang W The roles of miRNA, lncRNA and circRNA in the development of osteoporosis Biol Res 53 40 2020 10.1186/s40659-020-00309-z 32938500 PMC7493179 7 Xiao L Zhong M Huang Y Zhu J Tang W Li D Shi J Lu A Yang H Geng D Puerarin alleviates osteoporosis in the ovariectomy-induced mice by suppressing osteoclastogenesis via inhibition of TRAF6/ROS-dependent MAPK/NF-κB signaling pathways Aging (Albany NY) 12 21706 21729 2020 10.18632/aging.103976 33176281 PMC7695364 8 Friedenstein AJ Gorskaja JF Kulagina NN . Fibroblast precursors in normal and irradiated mouse hematopoietic organs Exp Hematol 4 267 274 1976 976387 9 Hu L Yin C Zhao F Ali A Ma J Qian A Mesenchymal stem cells: cell fate decision to osteoblast or adipocyte and application in osteoporosis treatment Int J Mol Sci 19 360 2018 10.3390/ijms19020360 29370110 PMC5855582 10 Wang C Meng H Wang X Zhao C Peng J Wang Y Differentiation of bone marrow mesenchymal stem cells in osteoblasts and adipocytes and its role in treatment of osteoporosis Med Sci Monit 22 226 233 2016 10.12659/msm.897044 26795027 PMC4727494 11 Qadir A Liang S Wu Z Chen Z Hu L Qian A Senile osteoporosis: The involvement of differentiation and senescence of bone marrow stromal cells Int J Mol Sci 21 349 2020 10.3390/ijms21010349 31948061 PMC6981793 12 Infante A Rodríguez CI Osteogenesis and aging: Lessons from mesenchymal stem cells Stem Cell Res Ther 9 244 2018 10.1186/s13287-018-0995-x 30257716 PMC6158877 13 Mattiucci D Maurizi G Leoni P Poloni A Aging- and senescence-associated changes of mesenchymal stromal cells in myelodysplastic syndromes Cell Transplant 27 754 764 2018 10.1177/0963689717745890 29682980 PMC6047275 14 Fathi E Charoudeh HN Sanaat Z Farahzadi R Telomere shortening as a hallmark of stem cell senescence Stem Cell Investig 6 7 2019 10.21037/sci.2019.02.04 31019963 PMC6458335 15 Guo Y Jia X Cui Y Song Y Wang S Geng Y Li R Gao W Fu D Sirt3-mediated mitophagy regulates AGEs-induced BMSCs senescence and senile osteoporosis Redox Biol 41 101915 2021 10.1016/j.redox.2021.101915 33662874 PMC7930642 16 Zhang P Zhang H Lin J Xiao T Xu R Fu Y Zhang Y Du Y Cheng J Jiang H Insulin impedes osteogenesis of BMSCs by inhibiting autophagy and promoting premature senescence via the TGF-β1 pathway Aging (Albany NY) 12 2084 2100 2020 10.18632/aging.102723 32017705 PMC7041775 17 Chen L Wang C Sun H Wang J Liang Y Wang Y Wong G The bioinformatics toolbox for circRNA discovery and analysis Brief Bioinform 22 1706 1728 2021 10.1093/bib/bbaa001 32103237 PMC7986655 18 Li R Jiang J Shi H Qian H Zhang X Xu W CircRNA: A rising star in gastric cancer Cell Mol Life Sci 77 1661 1680 2020 10.1007/s00018-019-03345-5 31659415 PMC11104848 19 Shafabakhsh R Mirhosseini N Chaichian S Moazzami B Mahdizadeh Z Asemi Z Could circRNA be a new biomarker for pre-eclampsia? Mol Reprod Dev 86 1773 1780 2019 10.1002/mrd.23262 31475762 20 Zang J Lu D Xu A The interaction of circRNAs and RNA binding proteins: An important part of circRNA maintenance and function J Neurosci Res 98 87 97 2020 10.1002/jnr.24356 30575990 21 Gao M Zhang Z Sun J Li B Li Y The roles of circRNA-miRNA-mRNA networks in the development and treatment of osteoporosis Front Endocrinol (Lausanne) 13 945310 2022 10.3389/fendo.2022.945310 35992137 PMC9388761 22 Liu N Lu W Qu X Zhu C LLLI promotes BMSC proliferation through circRNA_0001052/miR-124-3p Lasers Med Sci 37 849 856 2022 10.1007/s10103-021-03322-0 33884524 23 Qiao L Li CG Liu D CircRNA_0048211 protects postmenopausal osteoporosis through targeting miRNA-93-5p to regulate BMP2 Eur Rev Med Pharmacol Sci 24 3459 3466 2020 10.26355/eurrev_202004_20804 32329818 24 Yao X Liu M Jin F Zhu Z Comprehensive analysis of differentially expressed circular RNAs in patients with senile osteoporotic vertebral compression fracture Biomed Res Int 2020 4951251 2020 10.1155/2020/4951251 33083467 PMC7556071 25 Wu Y Xia L Zhou Y Xu Y Jiang X Icariin induces osteogenic differentiation of bone mesenchymal stem cells in a MAPK-dependent manner Cell Prolif 48 375 384 2015 10.1111/cpr.12185 25867119 PMC6496185 26 Livak KJ Schmittgen TD . Analysis of relative gene expression data using real-time quantitative PCR and the 2(-Delta Delta C(T)) method Methods 25 402 408 2001 10.1006/meth.2001.1262 11846609 27 Yu L Liu Y circRNA_0016624 could sponge miR-98 to regulate BMP2 expression in postmenopausal osteoporosis Biochem Biophys Res Commun 516 546 550 2019 10.1016/j.bbrc.2019.06.087 31235259 28 Chia W Liu J Huang YG Zhang C A circular RNA derived from DAB1 promotes cell proliferation and osteogenic differentiation of BMSCs via RBPJ/DAB1 axis Cell Death Dis 11 372 2020 10.1038/s41419-020-2572-3 32415085 PMC7229165 29 Gao Y Shang S Guo S Li X Zhou H Liu H Sun Y Wang J Wang P Zhi H Lnc2Cancer 3.0: An updated resource for experimentally supported lncRNA/circRNA cancer associations and web tools based on RNA-seq and scRNA-seq data Nucleic Acids Res 49 D1251 D1258 2021 10.1093/nar/gkaa1006 33219685 PMC7779028 30 Ye Y Zhang L Hu T Yin J Xu L Pang Z Chen W CircRNA_103765 acts as a proinflammatory factor via sponging miR-30 family in Crohn's disease Sci Rep 11 565 2021 10.1038/s41598-020-80663-w 33436852 PMC7804428 31 Ju J Song YN Chen XZ Wang T Liu CY Wang K circRNA is a potential target for cardiovascular diseases treatment Mol Cell Biochem 477 417 430 2022 10.1007/s11010-021-04286-z 34780000 32 Jin J Sun H Shi C Yang H Wu Y Li W Dong YH Cai L Meng XM Circular RNA in renal diseases J Cell Mol Med 24 6523 6533 2020 10.1111/jcmm.15295 32333642 PMC7299708 33 Giordano L Porta GD Peretti GM Maffulli N Therapeutic potential of microRNA in tendon injuries Br Med Bull 133 79 94 2020 10.1093/bmb/ldaa002 32219416 34 Huang DH Wang GY Zhang JW Li Y Zeng XC Jiang N MiR-501-5p regulates CYLD expression and promotes cell proliferation in human hepatocellular carcinoma Jpn J Clin Oncol 45 738 744 2015 10.1093/jjco/hyv063 25917358 35 Liu D Kang H Gao M Jin L Zhang F Chen D Li M Xiao L Exosome-transmitted circ_MMP2 promotes hepatocellular carcinoma metastasis by upregulating MMP2 Mol Oncol 14 1365 1380 2020 10.1002/1878-0261.12637 31944556 PMC7266270 36 Ou R Lv J Zhang Q Lin F Zhu L Huang F Li X Li T Zhao L Ren Y Xu Y circAMOTL1 motivates AMOTL1 expression to facilitate cervical cancer growth Mol Ther Nucleic Acids 19 50 60 2020 10.1016/j.omtn.2019.09.022 31812104 PMC6906701 37 Zhou J Zhang S Chen Z He Z Xu Y Li Z CircRNA-ENO1 promoted glycolysis and tumor progression in lung adenocarcinoma through upregulating its host gene ENO1 Cell Death Dis 10 885 2019 10.1038/s41419-019-2127-7 31767835 PMC6877563 38 Ebbesen KK Hansen TB Kjems J Insights into circular RNA biology RNA Biol 14 1035 1045 2017 10.1080/15476286.2016.1271524 27982727 PMC5680708 39 Siede D Rapti K Gorska AA Katus HA Altmüller J Boeckel JN Meder B Maack C Völkers M Müller OJ Identification of circular RNAs with host gene-independent expression in human model systems for cardiac differentiation and disease J Mol Cell Cardiol 109 48 56 2017 10.1016/j.yjmcc.2017.06.015 28676412 40 Li J Yu T Yan M Zhang X Liao L Zhu M Lin H Pan H Yao M DCUN1D1 facilitates tumor metastasis by activating FAK signaling and up-regulates PD-L1 in non-small-cell lung cancer Exp Cell Res 374 304 314 2019 10.1016/j.yexcr.2018.12.001 30528265 41 Huang S Liu Z Jiang F He H Zhong W DCUN1D1 promotes tumour progress in prostate cancer and its effect on DU145 in vitro J Pak Med Assoc 71 473 478 2021 10.47391/JPMA.285 33819231 42 O-charoenrat P Sarkaria I Talbot SG Reddy P Dao S Ngai I Shaha A Kraus D Shah J Rusch V SCCRO (DCUN1D1) induces extracellular matrix invasion by activating matrix metalloproteinase 2 Clin Cancer Res 14 6780 6789 2008 10.1158/1078-0432.CCR-08-0719 18980971 43 Zhao Y Hu Y Shen Q Xiong R Song X Guan C DCUN1D1, a new molecule involved in depigmentation via upregulating CXCL10 Exp Dermatol 32 457 468 2023 10.1111/exd.14732 36541112 44 Shao JL Li H Zhang XR Zhang X Li ZZ Jiao GL Sun GD Identification of serum exosomal MicroRNA expression profiling in menopausal females with osteoporosis by high-throughput sequencing Curr Med Sci 40 1161 1169 2020 10.1007/s11596-020-2306-x 33428145 45 Chen SC Jiang T Liu QY Liu ZT Su YF Su HT Hsa_circ_0001485 promoted osteogenic differentiation by targeting BMPR2 to activate the TGFβ-BMP pathway Stem Cell Res Ther 13 453 2022 10.1186/s13287-022-03150-1 36064455 PMC9446709 46 Fan L Yang K Yu R Hui H Wu W circ-Iqsec1 induces bone marrow-derived mesenchymal stem cell (BMSC) osteogenic differentiation through the miR-187-3p/Satb2 signaling pathway Arthritis Res Ther 24 273 2022 10.1186/s13075-022-02964-x 36517907 PMC9749292 Figure 1 Hsa_circ_0122913 suppresses the proliferation and osteogenic differentiation of BMSCs in vitro * ** *** Figure 2 Hsa_circ_0122913 is a competing endogenous RNA for miR-501-5p. (A) The binding sites between hsa_circ_0122913 and miR-501-5p analyzed by circBANK database. (B) The target relationship of hsa_circ_0122913 and miR-501-5p indicated by dual-luciferase reporter assay. ** Figure 3 Icariin treatment and DCUN1D1 knockdown could also promote the proliferation and osteogenic differentiation of BMSCs in vitro * ** **** # #### Figure 4 Hsa_circ_0122913/DCUN1D1 axis might participate in the effect of icariin treatment on bone marrow mesenchymal stem cells. (A) The mRNA level of hsa_circ_0122913 after knockdown of hsa_circ_0122913 and DCUN1D1 and treated with icariin. (B) The mRNA level of DCUN1D1 after knockdown of hsa_circ_0122913 and DCUN1D1 and treated with icariin. (C) The protein level of DCUN1D1 after knockdown of hsa_circ_0122913 and DCUN1D1 and treated with icariin. *** **** ## ### #### Table I Sequences of primers used for reverse transcription-quantitative PCR. Gene name Primer sequence (5'-3') Actin F: TGACGTGGACATCCGCAAAG  R: CTGGAAGGTGGACAGCGAG Osteopontin F: GAAGTTTCGCAGACCTGACAT  R: GTATGCACCATTCAACTCCTCG Osterix F: GTGGAACAGGAGTGGAGCTG  R: AGGCAGATGGAGAGAGCTGG Runt-related transcription factor 2 F: CGCCTCACAAACAACCACAG  R: ACTGCTTGCAGCCTTAAATGAC Defective in cullin neddylation 1 domain containing 1 F: TGCCTACTGGAACTTAGTGCT  R: CTGCAATCATCGTACTGAAGTCT F, forward; R, reverse. Table II Sequences of shRNAs. Name of shRNA Strand (5'-3') DCUN1D1 Sense: GATCC GTACGATGATTGCAGATGA GTCATCTGCAATCATCGTAC  Antisense: AATTCAAAAAA GTACGATGATTGCAGATGA TCATCTGCAATCATC GTAC hsa_circ-0122913 Sense: GATCC GATGAAGAAGAACAAGTTG CAACTTGTTCTTCTTCATC  Antisense: AATTCAAAAAA GATGAAGAAGAACAAGTTG CAACTTGTTCTTCTTCATC Negative control Sense: GATCCG TTCTCCGAACGTGTCACGTAA TTACGTGACACGTTCGGAGAA  Antisense: AATTGAAAAAA TTCTCCGAACGTGTCACGTAA TACGTGACACGTTCGGAGAA shRNA, short hairpin RNA; DCUN1D1, defective in cullin neddylation 1 domain containing 1. ",
  "metadata": {
    "Title of this paper": "circ-Iqsec1 induces bone marrow-derived mesenchymal stem cell (BMSC) osteogenic differentiation through the miR-187-3p/Satb2 signaling pathway",
    "Journal it was published in:": "Biomedical Reports",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12464470/"
  }
}