{
  "title": "Paper_1037",
  "abstract": "J Nucl Med J Nucl Med 3060 jnucmed jnm Journal of Nuclear Medicine 0161-5505 1535-5667 Society of Nuclear Medicine and Molecular Imaging PMC11960613 PMC11960613.1 11960613 11960613 39978817 10.2967/jnumed.124.268762 268762 1 Featured Article of the Month IL13Rα2-Targeting Antibodies for Immuno-PET in Solid Malignancies Gajecki Leah  1 Lebedeva Irina V.  2 Liao Yu-Rou  2 Ambriz Daisy  2 Carter Lukas M.  1 Kumpf Melina  1 Lovibond Samantha  1 Hachey Justin S.  1  3 Graham Maya S.  4  5 Postow Michael  6 Lewis Jason S.  1  7  8  9 Andrew David P.  2 Baca Manuel  2 Schöder Heiko  1  9 Larson Steven M.  1  8  9 Veach Darren R.  1  9 Krebs Simone  1  9  10  11 1 2 3 4 5 6 7 8 9 10 11 For correspondence or reprints, contact Simone Krebs ( sskrebs@mdanderson.org Published online Feb. 20, 2025. 4 2025 66 4 485728 605 611 07 9 2024 15 1 2025 01 10 2025 01 10 2025 02 04 2025 01 10 2025 © 2025 by the Society of Nuclear Medicine and Molecular Imaging. 2025 Visual Abstract  Interleukin-13 receptor α-2 (IL13Rα2) is a cell surface receptor frequently expressed in solid malignancies, such as glioblastoma and melanoma, with limited expression in healthy tissue, rendering it an ideal target for noninvasive and specific tumor delineation. In this study, we report the development of 5 novel IL13Rα2-targeted human monoclonal antibodies (mAbs) KLG-1–5; in subsequent in vitro and in vivo studies after radiolabeling with 89 Methods: 89 177 Results: 177 Conclusion: 177 IL13Rα2 immuno-PET glioblastoma melanoma antibodies pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access no pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement no pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes ",
  "metadata": {
    "Title of this paper": "IL13Rα2-Targeting Antibodies for Immuno-PET in Solid Malignancies",
    "Journal it was published in:": "Journal of Nuclear Medicine",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC11960613/"
  }
}