{
  "title": "Paper_230",
  "abstract": "pmc Acta Pharm Sin B Acta Pharm Sin B 2814 apsb Acta Pharmaceutica Sinica. B 2211-3835 2211-3843 Elsevier PMC12491680 PMC12491680.1 12491680 12491680 10.1016/j.apsb.2025.07.016 S2211-3835(25)00491-5 1 Original Article The toxic components, toxicological mechanism and effective antidote for Gelsemium elegans Li Niping a b † Yang Yaorong a b † Zhang Shengyuan b e † Jiang Bin c Zhang Wei a b Wang Haibo d Chen Lixin d Wang Liwei d Li Yiyi a b Shi Lei t_shilei@jnu.edu.cn a b ⁎ Ye Wencai chywc@aliyun.com a b ⁎ Wang Lei cpuwanglei@126.com a b ⁎ a b c d e ⁎ t_shilei@jnu.edu.cn chywc@aliyun.com cpuwanglei@126.com † These authors made equal contributions to this work. 9 2025 11 7 2025 15 9 498229 4872 4885 30 12 2024 14 5 2025 3 6 2025 11 07 2025 04 10 2025 04 10 2025 © 2025 The Authors 2025 https://creativecommons.org/licenses/by-nc-nd/4.0/ This is an open access article under the CC BY-NC-ND license (http://creativecommons.org/licenses/by-nc-nd/4.0/). Gelsemium elegans G. elegans G. elegans G. elegans Gelsemium 1 1 A A 1 A G. elegans G. elegans Graphical abstract The toxic components responsible for Gelsemium elegans poisoning Image 1 KEY WORDS Gelsemium elegans Toxic components Alkaloids Structure–toxicity relationship Toxicological mechanism GABA A Antidote Respiratory failure pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement yes pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes 1 Introduction Ingestion of the highly toxic plant Gelsemium elegans G. elegans 1 G. elegans 2 G. elegans 3 Lonicera japonica Ficus hirta 4 , 5 1 , 6 7 8 G. elegans Table S1 G. elegans Previous studies suggest that Gelsemium G. elegans 3 G. elegans 9 G. elegans 3 , 10 11 12 13 G. elegans G. elegans 14 , 15 G. elegans 16 Studies show that the toxic effects of Gelsemium A 17 G. elegans Gelsemium 17 11 18 Gelsemium 19 20 21 Gelsemium In the present study, we performed phytochemical investigation of all parts (roots, leaves and stems, flowers, and fruits) of the plant G. elegans 50 Gelsemium G. elegans 1 2 17 18 G. elegans 1 1 A 1 A A 2 Results 2.1 Chemical investigation of the toxic fraction of G. elegans All parts of G. elegans 3 , 11 G. elegans 3 G. elegans 9 Table S2 G. elegans Fig. 1 22 1 120 Figs. S1–S43 Tables S3–S11 Fig. 1 23 24 25 26 27 Figure 1 Chemical investigation of G. elegans Gelsemium Figure 1 2.2 Structure–toxicity relationship of Gelsemium alkaloids To investigate the toxicity of Gelsemium in vitro 3 Figs. S44 and S45 Fig. 1 Gelsemium 1 2 3 4 5 6 7 8 16 17 18 50 Table 1 Table S12 Gelsemium 3 , 11 , 12 , 28 Table 1 Fig. 1 N 1 20 N 19 9 10 11 22 12 N 1 20 Fig. 1 Table 1 The acute toxicity of Gelsemium Table 1 Structural types Compounds LD 50 a 95% CI (mg/kg) b Structural types Compounds LD 50 a 95% CI (mg/kg) b Gelsedine 1 0.14 0.13–0.16 Humantenine 16 0.21 0.19–0.23 2 0.46 0.45–0.47 17 7.11 6.45–7.88 3 0.56 0.51–0.63 18 0.15 0.14–0.17 4 0.41 0.36–0.47 19 22 >30 ND 5 3.59 3.17–4.07 Gelsemine 23 31 >30 ND 6 0.17 0.13–0.22 Koumine 32 39 >30 ND 7 0.17 0.14–0.21 Sarpagine 40 44 >30 ND 8 0.54 0.47–0.61 Yohimbane 45 46 >30 ND 9 15 >30 ND Bisindole 47 50 >30 ND Other 51 54 >30 ND ND: not detected. a LD 50 b CI: confidence interval. 2.3 Analysis of toxic alkaloids responsible for G. elegans poisoning With an aim to identify which toxin is the arch-criminal of G. elegans G. elegans 1 2 17 18 24 25 32 Fig. 2 Fig. S46 1 2 17 18 G. elegans 1 2 17 18 Fig. S47 Figure 2 The qualitative and quantitative analysis of toxins. (A) HPLC profiling (recorded at 254 nm) of the total alkaloid fraction of G. elegans 2 1 1 2 1 2 n Figure 2 Unfortunately, two 6-year-olds died of accidental ingestion of the stems of G. elegans Gelsemium 1 2 17 18 Supporting Information Fig. S48 Fig. 2B and Supporting Information Table S13 24 25 32 Fig. S48 2 1 Fig. 2 1 2 in vivo in vitro in vivo 1 2 1 1 Fig. 2 1 2 17 18 G. elegans 1 2.4 The toxicological mechanism of gelsenicine To directly evaluate the effect of gelsenicine ( 1 29 1 1 Fig. 3 1 Fig. 3 1 Figure 3 Gelsenicine ( 1 1 t P Figure 3 To investigate whether gelsenicine ( 1 1 1 1 1 Supporting Information Fig. S49 We then measured activity of VRG neurons using whole-cell electrophysiological recordings. For comparison, we also examined activity changes in CA1 pyramidal neurons in the hippocampus as a representative neuronal population involved in higher-order brain functions such as cognition. Various concentrations of gelsenicine ( 1 Fig. 4 1 1 Fig. 4 1 1 Fig. 4 1 1 Fig. 4 1 Supporting Information Fig. S50 1 1 Figure 4 The inhibitory effects of gelsenicine ( 1 1 1 n n 1 n n 1 n n 1 n n 1 t P P P Figure 4 Neuronal activity is balanced by excitatory input and inhibitory input. It has been suggested that gelsenicine ( 1 A 11 1 A A A 1 A Fig. 5 1 1 Fig. 5 1 A Figure 5 The inhibitory effect of gelsenicine ( 1 A 1 1 n 1 1 n t P P Figure 5 We then tested whether the inhibition of VRG neurons by gelsenicine ( 1 A 1 A 1 Fig. 5 A 1 2.5 Drugs for treating G. elegans We have shown that Gelsemium A G. elegans A 1 1 A 30 11 1 Fig. 6 31 32 1 A G. elegans Figure 6 Survival rate curves of mice with different treatments ( n Figure 6 3 Discussion G. elegans G. elegans G. elegans Gelsemium G. elegans 1 2 17 18 G. elegans Recent studies show that gelsedine-type alkaloids can influence GABA A 17 , 33 in vitro in vivo 1 1 A A 1 1 G. elegans 1 50 1 A The differential effects of gelsenicine ( 1 A A α α β β γ γ ρ ρ δ ε π θ 34 A α β γ α α A 35 α 36 A A 1 A Hippocampus is a brain region associated with higher functions including cognition, emotion, and social function. On the other hand, the medulla is part of the brainstem which regulates autonomic, involuntary functions essential for survival, including respiration, cardiovascular activities such as heart rate and blood pressure, and reflexes such as vomiting and swallowing. The hippocampus and medulla play distinct physiological roles, and they also express different compositions of GABA A A α α α β γ α α β 37 , 38 A α β α Supporting Information Fig. S51 δ ε 39 , 40 δ ε 39 1 1 A 41 1 Our results showed that securinine and flumazenil increased the survival rate of poisoned animals from 0% to 50%, and bemegride to 30%. We believe that all of these three drugs exhibit protective effects in the poisoned animals. Suramin only increased the survival rate to 10%, suggesting poor antidote potential. The varied effects may depend on the different pharmacological pharmacokinetic properties of these drugs. The GABA binding sites are located at the interfaces between the principal face (+) of β α A α γ α β γ β 34 , 42 A 50 A 43 44 , 45 A 50 46 47 50 A 48 , 49 50 A A 51 , 52 The clinical approaches to G. elegans 1 A G. elegans 1 G. elegans 4 Conclusions In summary, we performed a systematic phytochemical investigation of G. elegans Gelsemium 1 A A G. elegans 5 Experimental 5.1 Materials Pure alkaloids (purity >95%), 95% ethanolic extract, non-alkaloidal extract and total alkaloid extract of G. elegans 3 2 4 2 2 2 2 3 5.1.1 Plant material The leaves and stems (40.0 kg) and fruits (26.5 kg) of G. elegans G. elegans 5.1.2 Clinical blood specimens The blood sample of a 6-year-old G. elegans 5.2 Animals Adult Sprague–Dawley (SD) rats (male, 7–8 weeks of age, 180–220 g) and Kunming mice (male and female, 3 weeks of age, 16–22 g) were purchased from Beijing Vital River Laboratory Animal Technology Co., Ltd. (Beijing, China). C57BL/6J mice (male and female, 3 weeks of age, 20–25 g) were purchased from SPF Biotechnology Co., Ltd. (Beijing, China). All animals were maintained in animal rooms at standardized temperature (25–28 °C), under a 12/12-h light/dark cycle, with free access to standard rodent diet and water. The animals were allowed to adapt to the environment for 1 week before the experiments. Prior to treatment, the animals were fasted for 12 h, and free access to water and standard diet was given thereafter. The animal experiments were approved by the Laboratory Animal Ethics Committee of Jinan University (approval numbers: 20220607-09 and 20220708-01). 5.3 Extraction, isolation, and structural characterization A systematic chemical investigation on the total alkaloid fractions of roots, leaves and stems, flowers and fruits of G. elegans 5.4 Acute toxicity study The Kunming mice were randomly assigned to groups of 10 mice each (five males and five females). The extracts were dissolved in DMSO, PEG400 and sterile water to the required concentration, and then administered by oral gavage. The pure alkaloids were dissolved in DMSO, PEG400 and sterile water, and administered by intraperitoneal injection at a dose of 30 mg/kg body weight. After treatment, the mice were allowed free access to food and water, and behavioral changes were assessed for 7 days. Furthermore, symptoms, including time of onset and severity, were monitored, and time of death was recorded. Compounds causing death at 30 mg/kg body weight were selected to determine the dose causing 50% lethality (LD 50 ad libitum 50 53 5.5 Detection and identification of toxic alkaloids in plasma Adult male Kunming mice were administered the 95% ethanolic extract of G. elegans g g 2 g UPLC–MS/MS analysis was performed using a Q-Exactive Plus MS instrument coupled to a Dionex Ultimate 3000 UPLC system (Thermo Fisher Scientific, Bremen, Germany) 54 18 m z 5.6 Detection and quantitative analysis of toxic alkaloids in G. elegans The whole blood of the G. elegans g g g For quantitative analysis, the samples were processed as described above after addition of internal standard (carbamazepine). The prepared samples were analyzed on a Thermo Ultimate LC 3000 (Thermo Fisher Scientific, San Jose, CA, USA) coupled with an AB Sciex Triple Quad 4500 MS instrument (AB SCIEX, MA, USA). The liquid chromatography conditions were as described above. The analytes were analyzed using MRM mode, and the detailed MRM conditions for each compound are given in Supporting Information Table S14 1 2 17 18 Table S15 Table S16 55 , 56 5.7 In vitro 1 The incubation mixture consisted of 50 mmol/L Tris–HCl buffer solution (pH 7.4), MgCl 2 1 57 , 58 1 g 2 5.8 In vivo 1 Twenty-four SD rats were randomly divided into the following four groups: control group ( n n 1 59 5.9 Evaluation of respiratory function Twenty C57BL/6J mice were randomly divided into two groups, the treatment group and the control group, each consisting of ten mice. Mice were first placed in the plethysmography chambers of a whole-body plethysmograph (WBP-8WR, TOW) for 30 min to acclimate the environment. The mice were then received intraperitoneal injection of 0.22 mg/kg gelsenicine ( 1 29 5.10 In vitro HT22 cells (Jennio Biotech, Guangzhou, China) and Vero cells (National Collection of Authenticated Cell Cultures, Shanghai, China) were seeded into 384-well plates (Corning, Cat#15140163, USA) at densities of 800 and 1000 cells per well, respectively. Additionally, different Gelsemium 2 B34306 (1) (1) A compound A blank A control A blank A 5.11 Western blot analysis After sacrifice, hippocampus and medulla were quickly dissected out. Tissue samples were homogenized in cold RIPA lysis buffer (1% NP-40, 0.5% sodium deoxycholate, and 0.1% SDS) containing protease inhibitors (TargetMol, USA, C0001), and phosphatase inhibitors (TargetMol, USA, C0002/C0003), and lysed for 30 min. Lysates were cleared by centrifugation at 12,000 rpm (15,294× g A α A α A β 5.12 Electrophysiology Whole-cell recordings were performed as described before 41 , 60 , 61 2 4 2 2 3 2 2 2 4 2 2 3 2 2 2 4 2 2 3 2 2 62 The excitability of CA1 and VRG neurons was measured by whole-cell recordings in current-clamp mode at a voltage range of −48 to −55 mV using a B700 amplifier (Axon Instruments). Patch pipettes (4–6 mΩ) were filled with internal solution consisting of the following components (in mmol/L): 130 K-gluconate, 10 KCl, 10 HEPES, 0.5 Na 3 1 A 1 A 1 1 A 1 5.13 Quantitative analysis of gelsenicine ( 1 Twelve C57BL/6J mice were randomly divided into two groups ( n 1 via 5.14 Screening of effective antidotes for G. elegans Fifty male Kunming mice were randomly divided into five groups ( n 1 1 A 11 , 47 , 63 5.15 Statistical analysis All statistical analyses were performed using GraphPad Prism 8.0 (GraphPad Software, La Jolla, USA) and Igor Pro (WaveMetrics, Portland, OR, USA). Data for clinical samples and metabolic experiments were expressed as mean ± standard deviation (SD), and those for electrophysiological data were expressed as mean ± standard error of mean (SEM). Differences between the firing rates were analyzed using two-tailed paired t P Author contributions Niping Li: Validation, Methodology, Investigation, Funding acquisition, Data curation, Conceptualization, Writing – original draft. Yaorong Yang: Writing – original draft, Validation, Methodology, Investigation, Formal analysis, Data curation. Shengyuan Zhang: Validation, Methodology, Formal analysis, Data curation. Bin Jiang: Supervision, Methodology, Conceptualization. Wei Zhang: Methodology, Investigation, Data curation. Haibo Wang: Data curation, Methodology, Investigation. Lixin Chen: Supervision, Methodology, Conceptualization. Liwei Wang: Supervision, Methodology, Conceptualization. Yiyi Li: Visualization, Investigation, Data curation. Lei Shi: Funding acquisition, Conceptualization, Writing – review & editing, Supervision. Wencai Ye: Writing – review & editing, Supervision, Project administration, Funding acquisition, Conceptualization. Lei Wang: Conflicts of interest The authors declare no conflicts of interest. References 1 Cheung W.L. Law C.Y. Lee H.C.H. Tang C.O. Lam Y.H. Ng S.W. Gelsemium Cassytha filiformis Gelsemium elegans Toxicon 154 2018 42 49 30273705 10.1016/j.toxicon.2018.09.009 2 Shen N. Materia medica 1982 Medicine publishing house 274 275 3 Jin G.L. Su Y.P. Liu M. Xu Y. Yang J. Liao K.J. Medicinal plants of the genus Gelsemium J Ethnopharmacol 152 2014 33 52 24434844 10.1016/j.jep.2014.01.003 4 Zhang H. Li Z. Chen T. Liu J.J. Detection of poisonous herbs by terahertz time-domain spectroscopy J Appl Spectrosc 85 2018 197 202 5 Zheng X. An W. Yao H. Xu J. Chen S. Rapid authentication of the poisonous plant Gelsemium elegans Engineering 7 2021 14 16 6 Qu D. Qiao D.F. Chen X.C. Feng C.Q. Luo Q.Z. Tan X.H. Fatal poisoning by accidental ingestion of the “heartbreak grass” ( Gelsemium elegans Forensic Sci Int 321 2021 110745 10.1016/j.forsciint.2021.110745 33676237 7 Wen H.Z. Zhu H.C. Gao S.P. Li Z.M. Incident of gelsemine poisoning caused by migrant workers drinking self-made medicinal wine Shanghai J Prev Med 30 2018 484 486 8 Chen C. He J. Wei J. Chen Y. Qin N. He J. Literature analysis of 1034 cases of poisoning events induced by Gelsemium J Wuzhou Univ 30 2020 11 19 9 Lin H. Qiu H. Cheng Y. Liu M. Chen M. Que Y. Gelsemium elegans Molecules 26 2021 7145 34885727 10.3390/molecules26237145 PMC8659130 10 Liu M. Shen J. Liu H. Xu Y. Su Y.P. Yang J. Gelsenicine from Gelsemium elegans Biol Pharm Bull 34 2011 1877 1880 22130245 10.1248/bpb.34.1877 11 Yang S. Liu Y. Sun F. Zhang J. Jin Y. Li Y. Gelsedine-type alkaloids: discovery of natural neurotoxins presented in toxic honey J Hazard Mater 381 2020 120999 10.1016/j.jhazmat.2019.120999 31430640 12 Li Y.J. Yang K. Long X.M. Xiao G. Huang S.J. Zeng Z.Y. Toxicity assessment of gelsenicine and the search for effective antidotes Hum Exp Toxicol 41 2022 1 13 10.1177/09603271211062857 35018838 13 Qi X.J. Huang C.Y. Zuo M.T. Gong M.D. Huang S.J. Tang M.H. Network pharmacology and experimental verification to unveil the mechanism of N d Metabolites 13 2023 195 36837814 10.3390/metabo13020195 PMC9966887 14 Yang H. Xiang P. Yu M. Zou D. Fan X. Wang X. Confirmation of Gelsemium elegans J Pharm Biomed Anal 210 2022 114546 10.1016/j.jpba.2021.114546 34972069 15 Xiang H. Zhou Y.J. Huang P.L. Yu C.N. Liu J. Liu L.Y. Lethal poisoning with Gelsemium elegans Public health 136 2016 185 187 27026250 10.1016/j.puhe.2016.02.031 16 Zhou Z. Wu L. Zhong Y. Fang X. Liu Y. Chen H. Gelsemium elegans Front Neurol 8 2017 204 28567028 10.3389/fneur.2017.00204 PMC5434100 17 Sun M.X. Gao H.H. Zhao J. Zhang L. Xiao K. New oxindole alkaloids from Gelsemium elegans Tetrahedron Lett 56 2015 6194 6197 18 Huang S.J. Zuo M.T. Qi X.J. Huang C.Y. Liu Z.Y. Phosphoproteomics reveals NMDA receptor-mediated excitotoxicity as a key signaling pathway in the toxicity of gelsenicine Food Chem Toxicol 156 2021 112507 10.1016/j.fct.2021.112507 34389372 19 Neubauer J.A. NEUROPHYSIOLOGY|Neuroanatomy Laurent G.J. Shapiro S.D. Encyclopedia of respiratory medicine 2006 Academic Press Oxford 145 149 20 Powell F.L. VENTILATION|Control Laurent G.J. Shapiro S.D. Encyclopedia of respiratory medicine 2006 Academic Press Oxford 438 446 21 Ikeda K. Kawakami K. Onimaru H. Okada Y. Yokota S. Koshiya N. The respiratory control mechanisms in the brainstem and spinal cord: integrative views of the neuroanatomy and neurophysiology J Physiol Sci 67 2017 45 62 27535569 10.1007/s12576-016-0475-y PMC5368202 22 He Q.F. Wu Z.L. Li L. Sun W.Y. Wang G.Y. Jiang R.W. Discovery of neuritogenic securinega alkaloids from flueggea suffruticosa Angew Chem Int Ed 60 2021 19609 19613 10.1002/anie.202103878 34196083 23 Gu J.H. Zhang W. Cai W.Y. Fu X.X. Zhou H.L. Li N.P. Gelserancines A-E, monoterpenoid indole alkaloids with unusual skeletons from Gelsemium elegans Org Chem Front 8 2021 1918 1925 24 Li N.P. Liu J.S. Liu J.W. Tian H.Y. Zhou H.L. Zheng Y.R. Monoterpenoid indole alkaloids from the fruits of Gelsemium elegans Bioorg Chem 107 2021 104624 10.1016/j.bioorg.2020.104624 33465669 25 Li N.P. Liu M. Huang X.J. Gong X.Y. Zhang W. Cheng M.J. Gelsecorydines A–E, five gelsedine-corynanthe-type bisindole alkaloids from the fruits of Gelsemium elegans J Org Chem 83 2018 5707 5714 29719959 10.1021/acs.joc.8b00736 26 Zhang W. Xu W. Wang G.Y. Gong X.Y. Li N.P. Wang L. Gelsekoumidines A and B: two pairs of atropisomeric bisindole alkaloids from the roots of Gelsemium elegans Org Lett 19 2017 5194 5197 28898085 10.1021/acs.orglett.7b02463 27 Zhang W. Huang X.J. Zhang S.Y. Zhang D.M. Jiang R.W. Hu J.Y. Geleganidines A-C, unusual monoterpenoid indole alkaloids from Gelsemium elegans J Nat Prod 78 2015 2036 2044 26222693 10.1021/acs.jnatprod.5b00351 28 Rujjanawate C. Kanjanapothi D. Panthong A. Pharmacological effect and toxicity of alkaloids from Gelsemium elegans J Ethnopharmacol 89 2003 91 95 14522437 10.1016/s0378-8741(03)00267-8 29 Xiong J. Zhuang T. Ma Y. Xu J. Ye J. Ma R. Optimization of bifunctional piperidinamide derivatives as σ Eur J Med Chem 226 2021 113879 10.1016/j.ejmech.2021.113879 34628236 30 Luo H. Wood K. Shi F.D. Gao F. Chang Y. Suramin is a novel competitive antagonist selective to α1β2γ A ρ C Neuropharmacology 141 2018 148 157 30172846 10.1016/j.neuropharm.2018.08.036 31 Klochkov S. Neganova M. Unique indolizidine alkaloid securinine is a promising scaffold for the development of neuroprotective and antitumor drugs RSC Adv 11 2021 19185 19195 35478659 10.1039/d1ra02558a PMC9033663 32 Gershon S. Shaw F.H. Effects of bemegride on barbiturate overdosage in humans Br Med J 2 1957 1509 1514 13489272 10.1136/bmj.2.5060.1509 PMC1963270 33 Zuo M.T. Wu Y. Wang Z.Y. Wang N. Huang S.J. Yu H. A comprehensive toxicity evaluation in rats after long-term oral Gelsemium elegans Biomed Pharmacother 137 2021 111284 10.1016/j.biopha.2021.111284 33561641 34 Ghit A. Assal D. Al-Shami A.S. Hussein D.E.E. GABA A J Genet Eng Biotechnol 19 2021 123 34417930 10.1186/s43141-021-00224-0 PMC8380214 35 Masneuf S. Buetler J. Koester C. Crestani F. Role of α α A Br J Pharmacol 166 2012 339 348 22044283 10.1111/j.1476-5381.2011.01763.x PMC3415658 36 Zhang S. Guan D.W. Wang L. Wang H.X. Zhang G.H. Zhao R. The expression of GABA A B J Forensic Med 27 2011 401 404 22393585 37 Speigel I. Bichler E.K. García P.S. The influence of regional distribution and pharmacologic specificity of GABA A Front Syst Neurosci 11 2017 58 28878632 10.3389/fnsys.2017.00058 PMC5572268 38 Waldvogel H.J. Baer K. Eady E. Allen K.L. Gilbert R.T. Mohler H. Differential localization of γ J Comp Neurol 518 2010 305 328 19950251 10.1002/cne.22212 39 Hengen K.B. Gomez T.M. Stang K.M. Johnson S.M. Behan M. Changes in ventral respiratory column GABAaR ε δ Am J Physiol Regul Integr Comp Physiol 300 2011 R272 R283 21084677 10.1152/ajpregu.00607.2010 PMC3043800 40 Hengen K.B. Nelson N.R. Stang K.M. Johnson S.M. Crader S.M. Watters J.J. Increased GABA A ε PLoS One 7 2012 e30608 10.1371/journal.pone.0030608 PMC3269439 22303446 41 Guo D. Peng Y. Wang L. Sun X. Wang X. Liang C. Autism-like social deficit generated by Dock4 deficiency is rescued by restoration of Rac1 activity and NMDA receptor function Mol Psychiatr 26 2021 1505 1519 10.1038/s41380-019-0472-7 PMC8159750 31388105 42 Zhu S. Noviello C.M. Teng J. Walsh R.M. Jr. Kim J.J. Hibbs R.E. Structure of a human synaptic GABA A Nature 559 2018 67 72 29950725 10.1038/s41586-018-0255-3 PMC6220708 43 Möhler H. Burkard W.P. Keller H.H. Richards J.G. Haefely W. Benzodiazepine antagonist Ro 15-1788: binding characteristics and interaction with drug-induced changes in dopamine turnover and cerebellar cGMP levels J Neurochem 37 1981 714 722 6268754 10.1111/j.1471-4159.1982.tb12546.x 44 Mandema J.W. Gubbens-Stibbe J.M. Danhof M. Stability and pharmacokinetics of flumazenil in the rat Psychopharmacology (Berl) 103 1991 384 387 2057540 10.1007/BF02244294 45 Klotz U. Kanto J. Pharmacokinetics and clinical use of flumazenil (Ro 15-1788) Clin Pharmacokinet 14 1988 1 12 3127102 10.2165/00003088-198814010-00001 46 Beutler J.A. Karbon E.W. Brubaker A.N. Malik R. Curtis D.R. Enna S.J. Securinine alkaloids: a new class of GABA receptor antagonist Brain Res 330 1985 135 140 2985189 10.1016/0006-8993(85)90014-9 47 Xiao H. Zhang Q. Zhong P. Tang G. Tao L. Huang Z. Securinine promotes neuronal development and exhibits antidepressant-like effects via ACS Chem Neurosci 12 2021 3650 3661 34541857 10.1021/acschemneuro.1c00381 48 Gonzalez L.A. Gatch M.B. Taylor C.M. Bell-Horner C.L. Forster M.J. Dillon G.H. Carisoprodol-mediated modulation of GABA A in vitro in vivo J Pharmacol Exp Therapeut 329 2009 827 837 10.1124/jpet.109.151142 PMC2672873 19244096 49 Ramanjaneyulu R. Ticku M.K. Interactions of pentamethylenetetrazole and tetrazole analogues with the picrotoxinin site of the benzodiazepine-GABA receptor-ionophore complex Eur J Pharmacol 98 1984 337 345 6327331 10.1016/0014-2999(84)90282-6 50 Soto Otero R. Mendez Alvarez E. Sierra Paredes G. Galan Valiente J. Aguilar Veiga E. Sierra Marcuño G. Reversed-phase high-performance liquid chromatography method for the determination of bemegride in serum and brain tissue: pharmacokinetics and brain distribution of an intraperitoneal subconvulsive dose in rats J Pharm Biomed Anal 9 1991 177 182 1873309 10.1016/0731-7085(91)80141-u 51 Wu G. Zhou H. Lv D. Zheng R. Wu L. Yu S. Phase I, single-dose study to assess the pharmacokinetics and safety of suramin in healthy Chinese volunteers Drug Des Dev Ther 17 2023 2051 2061 10.2147/DDDT.S416325 PMC10349579 37457890 52 Naviaux J.C. Schuchbauer M.A. Li K. Wang L. Risbrough V.B. Powell S.B. Reversal of autism-like behaviors and metabolism in adult mice with single-dose antipurinergic therapy Transl Psychiatry 4 2014 e400 10.1038/tp.2014.33 PMC4080315 24937094 53 Zhang L. Li T. Wang R. Xu J. Zhou L. Yan L. Evaluation of long-time decoction-detoxicated Hei-shun-pian Aconitum carmichaeli Front Pharmacol 11 2020 1053 32848727 10.3389/fphar.2020.01053 PMC7396609 54 Xu H. Li S. Liu J. Cheng J. Kang L. Li W. Bioactive compounds from Huashi Baidu decoction possess both antiviral and anti-inflammatory effects against COVID-19 Proc Natl Acad Sci U S A 120 2023 e2301775120 10.1073/pnas.2301775120 PMC10160982 37094153 55 Geng Y. Chen S. Yang Y. Miao H. Li X. Li G. Long-term exposure to genistein inhibits the proliferation of gallbladder cancer by downregulating the MCM complex Sci Bull 67 2022 813 824 10.1016/j.scib.2022.01.011 36546234 56 Hartung H.P. Steinman L. Goodin D.S. Comi G. Cook S. Filippi M. Interleukin 17F level and interferon beta response in patients with multiple sclerosis JAMA Neurol 70 2013 1017 1021 23732754 10.1001/jamaneurol.2013.192 PMC4290836 57 Zhang Y. Yan T. Wang T. Liu X. Hamada K. Sun D. Crosstalk between CYP2E1 and PPAR α Acta Pharm Sin B 12 2022 2224 2238 35646522 10.1016/j.apsb.2022.02.004 PMC9136617 58 Garnar Wortzel L. Bishop T.R. Kitamura S. Milosevich N. Asiaban J.N. Zhang X. Chemical inhibition of ENL/AF9 YEATS domains in acute leukemia ACS Cent Sci 7 2021 815 830 34079898 10.1021/acscentsci.0c01550 PMC8161486 59 Sun D. Gao X. Wang Q. Krausz K.W. Fang Z. Zhang Y. Metabolic map of the antiviral drug podophyllotoxin provides insights into hepatotoxicity Xenobiotica 51 2021 1047 1059 34319859 10.1080/00498254.2021.1961920 PMC9491014 60 Ma X. Li L. Li Z. Huang Z. Yang Y. Liu P. eEF2 in the prefrontal cortex promotes excitatory synaptic transmission and social novelty behavior EMBO Rep 23 2022 e54543 10.15252/embr.202154543 PMC9535807 35993189 61 Li S. Wang L. Tie X. Sohya K. Lin X. Kirkwood A. Brief novel visual experience fundamentally changes synaptic plasticity in the mouse visual cortex J Neurosci 37 2017 9353 9360 28821676 10.1523/JNEUROSCI.0334-17.2017 PMC5618258 62 Dani V.S. Chang Q. Maffei A. Turrigiano G.G. Jaenisch R. Nelson S.B. Reduced cortical activity due to a shift in the balance between excitation and inhibition in a mouse model of Rett syndrome Proc Natl Acad Sci U S A 102 2005 12560 12565 16116096 10.1073/pnas.0506071102 PMC1194957 63 Chyła G. Sałaga Zaleska K. Dąbkowski K. Kuchta A. Jankowski M. Suramin enhances the urinary excretion of VEGF-A in normoglycemic and streptozotocin-induced diabetic rats Pharmacol Rep 73 2021 841 846 33635529 10.1007/s43440-021-00236-0 PMC8180480 Appendix A Supporting Information The following is the Supporting Information to this article. Multimedia component 1 Multimedia component 1 Acknowledgments This work was supported by the Guangdong Basic and Applied Basic Research Foundation 2024B1515040014 2022B1515130007 2023B1515040015 2023A1515030012 National Natural Science Foundation of China 82373750 82293681 82293680 82204236 82371175 Science and Technology Key Project of Guangdong Province 2020B1111110004 2023A0505050121 Science and Technology Project in Guangzhou 2024B03J1286 202102070001 Peer review under the responsibility of Chinese Pharmaceutical Association and Institute of Materia Medica, Chinese Academy of Medical Sciences. Appendix A Supporting information to this article can be found online at https://doi.org/10.1016/j.apsb.2025.07.016 ",
  "metadata": {
    "Title of this paper": "Suramin enhances the urinary excretion of VEGF-A in normoglycemic and streptozotocin-induced diabetic rats",
    "Journal it was published in:": "Acta Pharmaceutica Sinica. B",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12491680/"
  }
}