{
  "title": "Paper_718",
  "abstract": "pmc Curr Issues Mol Biol Curr Issues Mol Biol 4181 cimb cimb Current Issues in Molecular Biology 1467-3037 1467-3045 Multidisciplinary Digital Publishing Institute  (MDPI) PMC12468340 PMC12468340.1 12468340 12468340 41020847 10.3390/cimb47090725 cimb-47-00725 1 Article The Regulation of Catecholamine Biosynthesis by the Gas Transmitters Carbon Monoxide and Hydrogen Sulfide Dingley Robert 1 2 Hourtovenko Cameron 1 2 Lee James 1 2 Tharmalingam Sujeenthar 1 2 3 Tai T. C. 1 2 3 * Kobayashi Jun Academic Editor 1 rdingley@laurentian.ca chourtovenko1@laurentian.ca jlee9@laurentian.ca sutharmalingam@nosm.ca 2 3 * tc.tai@nosm.ca 05 9 2025 9 2025 47 9 497442 725 15 8 2025 02 9 2025 03 9 2025 05 09 2025 27 09 2025 01 10 2025 © 2025 by the authors. 2025 https://creativecommons.org/licenses/by/4.0/ Licensee MDPI, Basel, Switzerland. This article is an open access article distributed under the terms and conditions of the Creative Commons Attribution (CC BY) license ( https://creativecommons.org/licenses/by/4.0/ The gas transmitters nitric oxide (NO), carbon monoxide (CO), and hydrogen sulfide (H 2 2 2 Th Dbh Pnmt Th Dbh 2 gas transmitter catecholamine carbon monoxide hydrogen sulfide epinephrine phenylethanolamine N-methyltranserase hypertension transcriptional regulation Natural Sciences and Engineering Research Council (NSERC) RGPIN-2018-06833 This research was funded by the Natural Sciences and Engineering Research Council (NSERC) Discovery Grant (RGPIN-2018-06833). RD was supported by an NSERC USRA Award. pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement no pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes 1. Introduction Catecholamines are organic molecules that function as hormones and neurotransmitters and are vital to the physiological stress response, particularly the ‘fight or flight’ reaction, which is partly mediated through the hypothalamic–pituitary–adrenal (HPA) axis [ 1 2 3 4 5 6 The catecholamines dopamine, norepinephrine, and epinephrine are all produced in the same sequential enzymatic pathway [ 7 8 9 10 Pnmt 11 12 13 Pnmt 14 Gas transmitters, also known as gasotransmitters, are a class of gases that act as cellular transmitters [ 15 2 15 16 17 18 19 20 21 22 23 2 24 2 2 25 2 2 26 2 + 2+ 25 All three of these gases have been shown to participate in regulating the HPA axis [ 27 28 2 29 30 31 2 32 2 33 2 2+ 34 2 In this study, the role of CO and H 2 2 Th Dbh Pnmt 2. Materials and Methods 2.1. Cell Culture PC12 cells (Dr. Sushil Mahata, Department of Medicine, University of California, San Diego, CA USA) were maintained in Dulbecco’s modified Eagle’s medium (DMEM (Medi-Res Corp., Sudbury, ON, Canada) with 5% bovine calf serum (BCS; Hyclone Laboratories, Logan, UT, USA), 5% equine serum (ES; Hyclone), and 0.5 mL gentamycin sulfate supplements (50 mg/mL; EMD Chemicals, Gibbstown, NJ, USA). Cells were cultured at 37 °C with 5% CO 2 6 5 2.2. Experimental Design To determine the effect of CO on the expression of genes associated with catecholamine biosynthesis, PC12 cells were treated with the CO donor CORM-2 at concentrations of 10, 20, 50, 80 or 100 μM for 6 h. To determine the effect of H 2 2 2 To determine the effect of CO and H 2 2 2.3. RT-qPCR RNA was isolated using the TRIzol reagent (Sigma-Aldrich Corp., MO, USA); 6 h after drug treatment, total RNA was extracted following the manufacturer’s protocols. Cell culture media was aspirated, 500 μL TRIzol was added to each well; plates were frozen at −80 °C for 24 h. RNA was separated from the total cell extract using centrifugation after the addition of chloroform (Thermo-Fisher Scientific). The aqueous phase was separated, and RNA was precipitated using isopropanol. After washing with 70% ethanol, the RNA pellet was resuspended in 20 μL DEPC-treated water. RNA concentrations were determined using the Nanodrop ND-1000 spectrophotometer (Nanodrop Technologies, Inc., Wilmington, DE, USA), RNA concentrations were measured in duplicate using 1 μL of resuspended RNA. RNA was then treated with DNase1 per the manufacturer’s instructions (Sigma-Aldrich) to a final concentration of 2 μg of RNA/22 μL H 2 2 ® −∆∆Ct 35 Gapdh Rpl32 Th Dbh Pnmt Table 1 2.4. Catecholamine ELISA To determine the catecholamine content produced and released by PC12 cells, culture media was collected after treatments. To prevent catecholamine degradation, EDTA (final concentration 10 mM) and sodium metabisulfite (final concentration 4 mM) were added to the media and frozen at −80 °C until analysis. Catecholamine content was measured via a 3-Catecholamine ELISA kit (Labor Diagnostika Nord (LDN), Nordhorn, Germany) following the manufacturer’s protocol. In brief, dopamine, norepinephrine, and epinephrine were extracted using a cis-diol-specific affinity gel, which was acylated and enzymatically converted. The solution was then aliquoted to individual microtiter strips for each catecholamine, and a competitive enzyme-linked immunosorbent assay (ELISA) was performed as per manufacturer’s instructions; absorbance at 450 nm was measured in Synergy HTX Multi-Mode Microplate Reader (Agilent Technologies, Inc., Santa Clara, CA, USA). 2.5. Data Analysis qPCR data were generated from at least three independent experiments per assay, while ELISA data were generated from at least two independent experiments per assay. For both, technical replicates were averaged to obtain one value per biological replicate, and results are presented as mean ± SEM. Statistical analyses were performed using Jamovi software (version 2.3.28). Group differences were assessed using one-way ANOVA, and when significant effects were detected, post hoc Tukey’s multiple comparisons test was applied. Data were inspected for normal distribution and homogeneity of variance prior to analysis. 3. Results 3.1. Effects of CO on the Expression of Catecholamine Biosynthesis Genes To confirm that the results observed were due to CO, treatment with inactive CORM-2 (iCORM-2) was performed (data not shown). Higher concentrations of CORM-2 induced moderate downregulation of Th p p p Figure 1 Dbh p p p Figure 2 Pnmt p p Figure 3 3.2. Effects of H 2 To confirm that the results observed were due to H 2 Th Dbh Pnmt Figure 4 Figure 5 Figure 6 3.3. Effects of CO and H 2 Six hours after treatment with CORM-2 or NaHS there was no significant change in dopamine or norepinephrine content compared to control (data not shown). After 24 h, NaHS treatment resulted in no change in catecholamine content while CORM-2 treatment resulted in a 2.2-fold ( p Figure 7 3.4. Effects of CO and H 2 Treatment with DEX alone increased the expression of Th p Figure 8 Dbh p Figure 9 Pnmt p Figure 10 Th p Dbh p Pnmt p Dbh Pnmt 3.5. Effects of CO and H 2 There was no change in catecholamine content after 6 h (data not shown). After 24 h, DEX treatment significantly increased norepinephrine levels 3.9-fold ( p Figure 11 p p Figure 11 p p p Figure 11 Figure 11 4. Discussion This study aimed to investigate the role of CO and H 2 36 2 2 33 34 2 37 2 2 2 32 6 38 2 2 A significant but moderate decrease in Th Dbh Pnmt Pnmt 39 Th Dbh Pnmt Th Dbh 40 41 Pnmt 42 Interestingly, both the Th Dbh 41 43 44 Dbh 43 Dbh 43 41 Th 41 45 41 46 Th Dbh PC12 cells were initially described as a noradrenergic cell line [ 47 Pnmt 48 46 49 49 50 51 Th Dbh Pnmt Dbh 41 52 Th, Dbh Pnmt The response of Th Dbh Pnmt Th Dbh Pnmt 28 53 53 54 28 55 It is, therefore, interesting that CORM-2 treatment did not induce a similar cGMP-dependent increase in catecholamine biosynthesis gene expression. CO induction of cGMP and downstream signalling is less understood than that of NO and is a contentious area of research [ 56 57 53 57 57 56 Some evidence suggests that CO may stimulate the activity of sGC and increase cGMP levels in PC12 cells. When PC12 cells are exposed to nerve growth factor (NGF), they extend neurites, and this neurite growth can be further improved by guanosine treatment [ 58 59 59 59 59 We theorize three possible explanations for why exogenous CO did not increase the expression of catecholamine biosynthetic genes. (1) CO alone does not induce sGC activity in PC12 cells. It is possible that PC12 does not produce an unknown YC-1-like or other molecule required for high-affinity binding and complete activation. Alternatively, treatment with NGF, as performed previously [ 57 58 28 Glucocorticoids significantly influence catecholamine biosynthesis, as the promoter regions of Th Dbh Pnmt 60 61 62 Dbh Dbh 60 63 In the absence of glucocorticoids, GR resides in the cytosol in complex with several chaperones, including heat shock protein 90 (Hsp90) and heat shock protein 70 (Hsp70) [ 64 64 65 66 Th Dbh Pnmt 67 68 69 70 Pnmt 71 Cytochrome P450 3A4 (CYP3A4) is an enzyme that inactivates several pharmacological substances, including DEX [ 72 73 74 75 76 75 Th Dbh Pnmt 28 Circadian rhythm signalling is another pathway that may mediate the interactions between glucocorticoids, blood pressure, catecholamines and carbon monoxide. Whole transcriptome analysis of DEX programmed Wistar–Kyoto rats and SHR has highlighted circadian signalling as a potential mechanism of the development of hypertension [ 77 78 77 79 80 80 Th Dbh Pnmt The DEX-mediated increase in norepinephrine levels was attenuated when cells were pretreated with CORM-2. This result aligns with the similar attenuation of the DEX-mediated increase in the mRNA expression of Dbh 81 82 83 84 85 Th 85 Th 86 TH differs from DBH as, in addition to being transcriptionally activated by DEX, it is also enzymatically activated by DEX [ 87 88 89 90 91 92 93 94 Th Th 5. Conclusions In summary, this study demonstrates that exogenous CO, but not H 2 Th Dbh 2 Disclaimer/Publisher’s Note: Author Contributions Conceptualization, R.D., S.T. and T.C.T.; methodology, R.D., C.H., J.L., S.T. and T.C.T.; validation, R.D.; formal analysis, R.D.; investigation, R.D.; resources, S.T. and T.C.T.; writing—original draft preparation, R.D.; writing—review and editing, R.D., C.H., J.L., S.T. and T.C.T.; visualization, R.D.; supervision, S.T. and T.C.T.; project administration, S.T. and T.C.T.; funding acquisition, T.C.T. All authors have read and agreed to the published version of the manuscript. Data Availability Statement The original contributions presented in this study are included in the article. Data inquiries can be directed to the corresponding author. PC12 cells were obtained from the University of California, San Diego (UCSD, San Diego, CA, USA). Conflicts of Interest The authors declare no conflicts of interest. Abbreviations The following abbreviations are used in this manuscript: 3MST 3-Mercaptopyruvate Sulfurtransferase AP-1 Activating protein-1 CRE cAMP response element CO Carbon monoxide CBS Cystathionine β-synthase CSE Cystathionine γ-lyase CYP3A4 Cytochrome P450 3A4 DEX Dexamethasone DBH Dopamine β-hydroxylase Egr1 Early growth factor ELISA Enzyme-linked immunosorbent assay ERK Extracellular signal-regulated kinase GR Glucocorticoid receptor GRE Glucocorticoid response element GCs Glucocorticoids GAPDH Glyceraldehyde 3-phosphate dehydrogenase Hsp70 Heat shock protein 70 Hsp90 Heat shock protein 90 HO Heme oxygenase HD Homeodomain core recognition H 2 Hydrogen sulfide HPA Hypothalamic–pituitary–adrenal HIF-1α Hypoxia-inducible transcription factor-1α IL-1β Interleukin-1 beta mRNA Messenger RNA MAPK Mitogen-activated protein kinase NGF Nerve growth factor NO Nitric oxide NPAS2 Neuronal PAS domain protein 2 PNMT Phenylethanolamine N-methyltransferase PKA Protein kinase A PKC Protein kinase C RT-qPCR Real-time quantitative polymerase chain reaction Rpl32 Ribosomal Protein L32 NaHS Sodium hydrosulfide SNP Sodium nitroprusside sGC Soluble guanylyl cyclase SHR Spontaneously hypertensive rat TH Tyrosine 3-hydroxylase References 1. Pocock G. Richards C.D. Richards D.A. Human Physiology Oxford University Press England, UK 2018 2. Tank A.W. Lee Wong D. Peripheral and Central Effects of Circulating Catecholamines Compr. Physiol. 2015 5 1 15 10.1002/j.2040-4603.2015.tb00599.x 25589262 3. Kvetnansky R. Sabban E.L. Palkovits M. Catecholaminergic Systems in Stress: Structural and Molecular Genetic Approaches Physiol. Rev. 2009 89 535 606 10.1152/physrev.00042.2006 19342614 4. Wurtman R.J. Stress and the Adrenocortical Control of Epinephrine Synthesis Metab. Clin. Exp. 2002 51 11 14 10.1053/meta.2002.33185 12040535 5. Sharara-Chami R.I. Joachim M. Pacak K. Majzoub J.A. GLUCOCORTICOID TREATMENT-EFFECT ON ADRENAL MEDULLARY CATECHOLAMINE PRODUCTION Shock 2010 33 213 217 10.1097/SHK.0b013e3181af0633 19503019 PMC4713031 6. Kim K.-T. Park D.H. Joh T.H. Parallel Up-Regulation of Catecholamine Biosynthetic Enzymes by Dexamethasone in PC12 Cells J. Neurochem. 1993 60 946 951 10.1111/j.1471-4159.1993.tb03241.x 8436980 7. Nagatsu T. Stjärnet L. Catecholamine Synthesis and Release Advances in Pharmacology Goldstein D.S. Eisenhofer G. McCarty R. Academic Press Cambridge, MA, USA 1997 1 14 8. Goldstein D.S. Plasma Catecholamines and Essential Hypertension. An Analytical Review Hypertension 1983 5 86 99 10.1161/01.HYP.5.1.86 6336721 9. Axelrod J. Catecholamines and Hypertension Clin. Sci. Mol. Med. 1976 51 415s 421s 10.1042/cs051415s 192517 10. Reja V. Goodchild A.K. Pilowsky P.M. Catecholamine-Related Gene Expression Correlates with Blood Pressures in SHR Hypertension 2002 40 342 347 10.1161/01.HYP.0000027684.06638.63 12215477 11. Hoehe M.R. Plaetke R. Otterud B. Stauffer D. Holik J. Byerley W.F. Baetge E.E. Gershon E.S. Lalouel J.-M. Leppert M. Genetic Linkage of the Human Gene for Phenylethanol-Amine N-Methyltransferase ( Pnmt Hum. Mol. Genet. 1992 1 175 178 10.1093/hmg/1.3.175 1303174 12. Kaneda N. Ichinose H. Kobayashi K. Oka K. Kishi F. Nakazawa A. Kurosawa Y. Fujita K. Nagatsu T. Molecular Cloning of cDNA and Chromosomal Assignment of the Gene for Human Phenylethanolamine N-Methyltransferase, the Enzyme for Epinephrine Biosynthesis J. Biol. Chem. 1988 263 7672 7677 10.1016/S0021-9258(18)68551-5 3372503 13. Koike G. Jacob H.J. Krieger J.E. Szpirer C. Hoehe M.R. Horiuchi M. Dzau V.J. Investigation of the Phenylethanolamine N-Methyltransferase Gene as a Candidate Gene for Hypertension Hypertension 1995 26 595 601 10.1161/01.HYP.26.4.595 7558218 14. Nguyen P. Peltsch H. de Wit J. Crispo J. Ubriaco G. Eibl J. Tai T.C. Regulation of the Phenylethanolamine N-Methyltransferase Gene in the Adrenal Gland of the Spontaneous Hypertensive Rat Neurosci. Lett. 2009 461 280 284 10.1016/j.neulet.2009.06.022 19539715 15. Mustafa A.K. Gadalla M.M. Snyder S.H. Signaling by Gasotransmitters Sci. Signal. 2009 2 re2 10.1126/scisignal.268re2 19401594 PMC2744355 16. Feelisch M. te Poel M. Zamora R. Deussen A. Moncada S. Understanding the Controversy over the Identity of EDRF Nature 1994 368 62 65 10.1038/368062a0 8107883 17. Furchgott R.F. Zawadzki J.V. The Obligatory Role of Endothelial Cells in the Relaxation of Arterial Smooth Muscle by Acetylcholine Nature 1980 288 373 376 10.1038/288373a0 6253831 18. Hermann M. Flammer A. Lüscher T.F. Nitric Oxide in Hypertension J. Clin. Hypertens. 2006 8 17 29 10.1111/j.1524-6175.2006.06032.x 17170603 PMC8109558 19. Shi J. Liu S. Guo Y. Liu S. Xu J. Pan L. Hu Y. Liu Y. Cheng Y. Association between eNOS Rs1799983 Polymorphism and Hypertension: A Meta-Analysis Involving 14,185 Cases and 13,407 Controls BMC Cardiovasc. Disord. 2021 21 385 10.1186/s12872-021-02192-2 34372765 PMC8351409 20. Taha H. Skrzypek K. Guevara I. Nigisch A. Mustafa S. Grochot-Przeczek A. Ferdek P. Was H. Kotlinowski J. Kozakowska M. Role of Heme Oxygenase-1 in Human Endothelial Cells Arterioscler. Thromb. Vasc. Biol. 2010 30 1634 1641 Correction in Arterioscler Thromb Vasc Biol. 2010 30 10.1161/ATVBAHA.110.207316 20508205 PMC2906705 21. Martasek P. Schwartzman M.L. Goodman A.I. Solangi K.B. Levere R.D. Abraham N.G. Hemin and L-Arginine Regulation of Blood Pressure in Spontaneous Hypertensive Rats J. Am. Soc. Nephrol. 1991 2 1078 10.1681/ASN.V261078 1777588 22. Sabaawy H.E. Zhang F. Nguyen X. ElHosseiny A. Nasjletti A. Schwartzman M. Dennery P. Kappas A. Abraham N.G. Human Heme Oxygenase-1 Gene Transfer Lowers Blood Pressure and Promotes Growth in Spontaneously Hypertensive Rats Hypertension 2001 38 210 215 10.1161/01.HYP.38.2.210 11509478 23. Kobayashi A. Ishikawa K. Matsumoto H. Kimura S. Kamiyama Y. Maruyama Y. Synergetic Antioxidant and Vasodilatory Action of Carbon Monoxide in Angiotensin II–Induced Cardiac Hypertrophy Hypertension 2007 50 1040 1048 10.1161/HYPERTENSIONAHA.107.097006 17923586 24. Huang C.W. Moore P.K. H 2 Chemistry, Biochemistry and Pharmacology of Hydrogen Sulfide Moore P.K. Whiteman M. Springer International Publishing Cham, Switzerland 2015 3 25 10.1007/978-3-319-18144-8_1 26162827 25. Gheibi S. Jeddi S. Kashfi K. Ghasemi A. Regulation of Vascular Tone Homeostasis by NO and H 2 Biochem. Pharmacol. 2018 149 42 59 10.1016/j.bcp.2018.01.017 29330066 PMC5866223 26. Yan H. Du J. Tang C. The Possible Role of Hydrogen Sulfide on the Pathogenesis of Spontaneous Hypertension in Rats Biochem. Biophys. Res. Commun. 2004 313 22 27 10.1016/j.bbrc.2003.11.081 14672692 27. Mancuso C. Navarra P. Preziosi P. Roles of Nitric Oxide, Carbon Monoxide, and Hydrogen Sulfide in the Regulation of the Hypothalamic-Pituitary-Adrenal Axis J. Neurochem. 2010 113 563 575 10.1111/j.1471-4159.2010.06606.x 20089135 28. Ansell D. Grandbois J. Tai T.C. Gene Regulation of Catecholamine Biosynthetic Enzymes by Nitric Oxide in PC12 Cells Open J. Endocr. Metab. Dis. 2014 4 77 84 10.4236/ojemd.2014.44009 29. Grion N. Repetto E.M. Pomeraniec Y. Calejman C.M. Astort F. Sanchez R. Pignataro O.P. Arias P. Cymeryng C.B. Induction of Nitric Oxide Synthase and Heme Oxygenase Activities by Endotoxin in the Rat Adrenal Cortex: Involvement of Both Signaling Systems in the Modulation of ACTH-Dependent Steroid Production J. Endocrinol. 2007 194 11 20 10.1677/JOE-06-0199 17592016 30. Buerk D.G. Chugh D.K. Osanai S. Mokashi A. Lahiri S. Dopamine Increases in Cat Carotid Body during Excitation by Carbon Monoxide: Implications for a Chromophore Theory of Chemoreception J. Auton. Nerv. Syst. 1997 67 130 136 10.1016/S0165-1838(97)00098-2 9479664 31. Lahiri S. Penney D.G. Mokashi A. Albertine K.H. Chronic CO Inhalation and Carotid Body Catecholamines: Testing of Hypotheses J. Appl. Physiol. 1989 67 239 242 10.1152/jappl.1989.67.1.239 2759947 32. Wang C.-N. Liu Y.-J. Duan G.-L. Zhao W. Li X.-H. Zhu X.-Y. Ni X. CBS and CSE Are Critical for Maintenance of Mitochondrial Function and Glucocorticoid Production in Adrenal Cortex Antioxid. Redox Signal. 2014 21 2192 2207 10.1089/ars.2013.5682 24702258 33. Zhu D. Yu X. Sun J. Li J. Ma X. Yao W. H 2 Toxicology 2012 302 40 43 10.1016/j.tox.2012.07.008 22841986 34. de Pascual R. Baraibar A.M. Méndez-López I. Pérez-Ciria M. Polo-Vaquero I. Gandía L. Ohia S.E. García A.G. de Diego A.M.G. Hydrogen Sulphide Facilitates Exocytosis by Regulating the Handling of Intracellular Calcium by Chromaffin Cells Eur. J. Physiol. 2018 470 1255 1270 10.1007/s00424-018-2147-7 29721607 35. Tian X. Guan T. Guo Y. Zhang G. Kong J. Selective Susceptibility of Oligodendrocytes to Carbon Monoxide Poisoning: Implication for Delayed Neurologic Sequelae (DNS) Front. Psychiatry 2020 11 815 10.3389/fpsyt.2020.00815 32903698 PMC7438756 36. DeLeon E.R. Stoy G.F. Olson K.R. Passive Loss of Hydrogen Sulfide in Biological Experiments Anal. Biochem. 2012 421 203 207 10.1016/j.ab.2011.10.016 22056407 37. Nguyen P. Khurana S. Peltsch H. Grandbois J. Eibl J. Crispo J. Ansell D. Tai T.C. Prenatal Glucocorticoid Exposure Programs Adrenal Pnmt J. Endocrinol. 2015 227 117 127 10.1530/JOE-15-0244 26475702 38. Sabban E.L. Kvetňanský R. Stress-Triggered Activation of Gene Expression in Catecholaminergic Systems: Dynamics of Transcriptional Events Trends Neurosci. 2001 24 91 98 10.1016/S0166-2236(00)01687-8 11164939 39. Lewis E.J. Harrington C.A. Chikaraishi D.M. Transcriptional Regulation of the Tyrosine Hydroxylase Gene by Glucocorticoid and Cyclic AMP Proc. Natl. Acad. Sci. USA 1987 84 3550 3554 10.1073/pnas.84.11.3550 2884660 PMC304912 40. Swanson D.J. Zellmer E. Lewis E.J. AP1 Proteins Mediate the cAMP Response of the Dopamine β-Hydroxylase Gene * J. Biol. Chem. 1998 273 24065 24074 10.1074/jbc.273.37.24065 9727025 41. Tai T.C. Morita K. Wong D.L. Role of Egr-1 in cAMP-Dependent Protein Kinase Regulation of the Phenylethanolamine N-Methyltransferase Gene J. Neurochem. 2001 76 1851 1859 10.1046/j.1471-4159.2001.00189.x 11259503 42. Swanson D.J. Adachi M. Lewis E.J. The Homeodomain Protein Arix Promotes Protein Kinase A-Dependent Activation of the Dopamine β-Hydroxylase Promoter through Multiple Elements and Interaction with the Coactivator cAMP-Response Element-Binding Protein-Binding Protein J. Biol. Chem. 2000 275 2911 2923 10.1074/jbc.275.4.2911 10644760 43. Pattyn A. Morin X. Cremer H. Goridis C. Brunet J.F. The Homeobox Gene Phox2b Is Essential for the Development of Autonomic Neural Crest Derivatives Nature 1999 399 366 370 10.1038/20700 10360575 44. Zellmer E. Zhang Z. Greco D. Rhodes J. Cassel S. Lewis E.J. A Homeodomain Protein Selectively Expressed in Noradrenergic Tissue Regulates Transcription of Neurotransmitter Biosynthetic Genes J. Neurosci. 1995 15 8109 8120 10.1523/JNEUROSCI.15-12-08109.1995 8613746 PMC6577961 45. Swanson D.J. Zellmer E. Lewis E.J. The Homeodomain Protein Arix Interacts Synergistically with Cyclic AMP to Regulate Expression of Neurotransmitter Biosynthetic Genes* J. Biol. Chem. 1997 272 27382 27392 10.1074/jbc.272.43.27382 9341190 46. Greene L.A. Tischler A.S. Establishment of a Noradrenergic Clonal Line of Rat Adrenal Pheochromocytoma Cells Which Respond to Nerve Growth Factor Proc. Natl. Acad. Sci. USA 1976 73 2424 2428 10.1073/pnas.73.7.2424 1065897 PMC430592 47. Fan Y. Huang J. Duffourc M. Kao R.L. Ordway G.A. Huang R. Zhu M.-Y. Transcription Factor Phox Neuroscience 2011 192 37 53 10.1016/j.neuroscience.2011.07.005 21763404 PMC3166407 48. Ryter S.W. Morse D. Choi A.M.K. Carbon Monoxide: To Boldly Go Where NO Has Gone Before Sci. STKE 2004 2004 re6 10.1126/stke.2302004re6 15114002 49. Lian S. Xia Y. Ung T.T. Khoi P.N. Yoon H.J. Kim N.H. Kim K.K. Jung Y.D. Carbon Monoxide Releasing Molecule-2 Ameliorates IL-1β-Induced IL-8 in Human Gastric Cancer Cells Toxicology 2016 361–362 24 38 10.1016/j.tox.2016.07.003 27393034 50. Li M.H. Jang J.H. Na H.K. Cha Y.N. Surh Y.J. Carbon Monoxide Produced by Heme Oxygenase-1 in Response to Nitrosative Stress Induces Expression of Glutamate-Cysteine Ligase in PC12 Cells via Activation of Phosphatidylinositol 3-Kinase and Nrf2 Signaling J. Biol. Chem. 2007 282 28577 28586 10.1074/jbc.M701916200 17681938 51. Schultess J. Danielewski O. Smolenski A.P. Rap1GAP2 Is a New GTPase-Activating Protein of Rap1 Expressed in Human Platelets Blood 2005 105 3185 3192 10.1182/blood-2004-09-3605 15632203 52. Hartsfield C.L. Cross Talk Between Carbon Monoxide and Nitric Oxide Antioxid. Redox Signal. 2002 4 301 307 10.1089/152308602753666352 12006181 53. Roskoski R. Roskoski L.M. Activation of Tyrosine Hydroxylase in PC12 Cells by the Cyclic GMP and Cyclic AMP Second Messenger Systems J. Neurochem. 1987 48 236 242 10.1111/j.1471-4159.1987.tb13153.x 2878973 54. Kim D. Choi H.J. Kim S.W. Cho S.-W. Hwang O. Upregulation of Catecholamine Biosynthetic Enzymes by Nitric Oxide J. Neurosci. Res. 2003 72 98 104 10.1002/jnr.10557 12645083 55. Lu W. Yang X. Wang B. Carbon Monoxide Signaling and Soluble Guanylyl Cyclase: Facts, Myths, and Intriguing Possibilities Biochem. Pharmacol. 2022 200 115041 10.1016/j.bcp.2022.115041 35447132 PMC10257856 56. Friebe A. Schultz G. Koesling D. Sensitizing Soluble Guanylyl Cyclase to Become a Highly CO-Sensitive Enzyme EMBO J. 1996 15 6863 6868 10.1002/j.1460-2075.1996.tb01078.x 9003762 PMC452512 57. Gysbers J.W. Rathbone M.P. Guanosine Enhances NGF-Stimulated Neurite Outgrowth in PC12 Cells Neuroreport 1992 3 997 1000 10.1097/00001756-199211000-00013 1482771 58. Bau C. Middlemiss P.J. Hindley S. Jiang S. Ciccarelli R. Caciagli F. DiIorio P. Werstiuk E.S. Rathbone M.P. Guanosine Stimulates Neurite Outgrowth in PC12 Cells via Activation of Heme Oxygenase and Cyclic GMP Purinergic Signal. 2005 1 161 172 10.1007/s11302-005-6214-0 18404501 PMC2096532 59. McMahon A. Sabban E.L. Regulation of Expression of Dopamine β-Hydroxylase in PC12 Cells by Glucocorticoids and Cyclic AMP Analogues J. Neurochem. 1992 59 2040 2047 10.1111/j.1471-4159.1992.tb10092.x 1359011 60. Rani C.S.S. Elango N. Wang S. Kobayashi K. Strong R. Identification of an Activator Protein-1-Like Sequence as the Glucocorticoid Response Element in the Rat Tyrosine Hydroxylase Gene Mol. Pharmacol. 2009 75 589 598 10.1124/mol.108.051219 19060113 PMC2645927 61. Tai T.C. Claycomb R. Her S. Bloom A.K. Wong D.L. Glucocorticoid Responsiveness of the Rat PhenylethanolamineN-Methyltransferase Gene Mol. Pharmacol. 2002 61 1385 1392 10.1016/S0026-895X(24)12098-6 12021400 62. Leonardi D.B. Anselmino N. Brandani J.N. Jaworski F.M. Páez A.V. Mazaira G. Meiss R.P. Nuñez M. Nemirovsky S.I. Giudice J. Heme Oxygenase 1 Impairs Glucocorticoid Receptor Activity in Prostate Cancer Int. J. Mol. Sci. 2019 20 1006 10.3390/ijms20051006 30813528 PMC6429053 63. Baker J.D. Ozsan I. Rodriguez Ospina S. Gulick D. Blair L.J. Hsp90 Heterocomplexes Regulate Steroid Hormone Receptors: From Stress Response to Psychiatric Disease Int. J. Mol. Sci. 2019 20 79 10.3390/ijms20010079 PMC6337637 30585227 64. Agyeman A.S. Jun W.J. Proia D.A. Kim C.R. Skor M.N. Kocherginsky M. Conzen S.D. Hsp90 Inhibition Results in Glucocorticoid Receptor Degradation in Association with Increased Sensitivity to Paclitaxel in Triple-Negative Breast Cancer Horm. Cancer 2016 7 114 126 10.1007/s12672-016-0251-8 26858237 PMC4789079 65. Lee W.-Y. Chen Y.-C. Shih C.-M. Lin C.-M. Cheng C.-H. Chen K.-C. Lin C.-W. The Induction of Heme Oxygenase-1 Suppresses Heat Shock Protein 90 and the Proliferation of Human Breast Cancer Cells through Its Byproduct Carbon Monoxide Toxicol. Appl. Pharmacol. 2014 274 55 62 10.1016/j.taap.2013.10.027 24211270 66. Choi Y.K. Kim C.K. Lee H. Jeoung D. Ha K.S. Kwon Y.G. Kim K.W. Kim Y.M. Carbon Monoxide Promotes VEGF Expression by Increasing HIF-1α Protein Level via Two Distinct Mechanisms, Translational Activation and Stabilization of HIF-1α Protein J. Biol. Chem. 2010 285 32116 32125 10.1074/jbc.M110.131284 20724477 PMC2952213 67. Tai T.C. Wong-Faull D.C. Claycomb R. Wong D.L. Hypoxic Stress-Induced Changes in Adrenergic Function: Role of HIF1α J. Neurochem. 2009 109 513 524 10.1111/j.1471-4159.2009.05978.x 19220706 68. Brown S.T. Kelly K.F. Daniel J.M. Nurse C.A. Hypoxia Inducible Factor (HIF)-2α Is Required for the Development of the Catecholaminergic Phenotype of Sympathoadrenal Cells J. Neurochem. 2009 110 622 630 10.1111/j.1471-4159.2009.06153.x 19457096 69. Richter S. Qin N. Pacak K. Eisenhofer G. Role of Hypoxia and HIF2α in Development of the Sympathoadrenal Cell Lineage and Chromaffin Cell Tumours with Distinct Catecholamine Phenotypic Features Adv. Pharmacol. 2013 68 285 317 10.1016/B978-0-12-411512-5.00014-2 24054150 PMC3785008 70. Watts D. Bechmann N. Meneses A. Poutakidou I.K. Kaden D. Conrad C. Krüger A. Stein J. El-Armouche A. Chavakis T. HIF2α Regulates the Synthesis and Release of Epinephrine in the Adrenal Medulla J. Mol. Med. 2021 99 1655 1666 10.1007/s00109-021-02121-y 34480587 PMC8542008 71. Hashimoto H. Toide K. Kitamura R. Fujita M. Tagawa S. Itoh S. Kamataki T. Gene Structure of CYP3A4, an Adult-Specific Form of Cytochrome P450 in Human Livers, and Its Transcriptional Control Eur. J. Biochem. 1993 218 585 595 10.1111/j.1432-1033.1993.tb18412.x 8269949 72. Kitzmiller J.P. Groen D.K. Phelps M.A. Sadee W. Pharmacogenomic Testing: Relevance in Medical Practice: Why Drugs Work in Some Patients but Not in Others Cleve. Clin. J. Med. 2011 78 243 10.3949/ccjm.78a.10145 21460130 PMC3351041 73. Hara H. Inhibitory Effect of Nitric Oxide on the Induction of Cytochrome P450 3A4 mRNA by 1,25-Dihydroxyvitamin D3 in Caco-2 Cells Free Radic. Res. 2000 33 279 285 10.1080/10715760000301441 10993481 74. Kawahara B. Faull K.F. Janzen C. Mascharak P.K. Carbon Monoxide Inhibits Cytochrome P450 Enzymes CYP3A4/2C8 in Human Breast Cancer Cells, Increasing Sensitivity to Paclitaxel J. Med. Chem. 2021 64 8437 8446 10.1021/acs.jmedchem.1c00404 34097831 75. Kroiss M. Quinkler M. Lutz W.K. Allolio B. Fassnacht M. Drug Interactions with Mitotane by Induction of CYP3A4 Metabolism in the Clinical Management of Adrenocortical Carcinoma Clin. Endocrinol. 2011 75 585 591 10.1111/j.1365-2265.2011.04214.x 21883349 76. Tharmalingam S. Khurana S. Murray A. Lamothe J. Tai T.C. Whole Transcriptome Analysis of Adrenal Glands from Prenatal Glucocorticoid Programmed Hypertensive Rodents Sci. Rep. 2020 10 18755 10.1038/s41598-020-75652-y 33127986 PMC7603342 77. Albrecht U. Molecular Mechanisms in Mood Regulation Involving the Circadian Clock Front. Neurol. 2017 8 30 10.3389/fneur.2017.00030 28223962 PMC5293817 78. Dioum E.M. Rutter J. Tuckerman J.R. Gonzalez G. Gilles-Gonzalez M.-A. McKnight S.L. NPAS2: A Gas-Responsive Transcription Factor Science 2002 298 2385 2387 10.1126/science.1078456 12446832 79. Murgo E. Colangelo T. Bellet M.M. Malatesta F. Mazzoccoli G. Role of the Circadian Gas-Responsive Hemeprotein NPAS2 in Physiology and Pathology Biology 2023 12 1354 10.3390/biology12101354 37887064 PMC10603908 80. Molinoff P.B. Axelrod J. Biochemistry of Catecholamines Annu. Rev. Biochem. 1971 40 465 500 10.1146/annurev.bi.40.070171.002341 4399447 81. Bauer N. Liu D. Nguyen T. Wang B. Unraveling the Interplay of Dopamine, Carbon Monoxide, and Heme Oxygenase in Neuromodulation and Cognition ACS Chem. Neurosci. 2024 15 400 407 10.1021/acschemneuro.3c00742 38214656 PMC10853931 82. Hiramatsu M. Yokoyama S. Nabeshima T. Kameyama T. Changes in Concentrations of Dopamine, Serotonin, and Their Metabolites Induced by Carbon Monoxide (CO) in the Rat Striatum as Determined by in Vivo Microdialysis Pharmacol. Biochem. Behav. 1994 48 9 15 10.1016/0091-3057(94)90490-1 8029308 83. Taskiran D. Kutay F.Z. Pogun S. Effect of Carbon Monoxide on Dopamine and Glutamate Uptake and cGMP Levels in Rat Brain Neuropsychopharmacology 2003 28 1176 1181 10.1038/sj.npp.1300132 12700708 84. Dreyer-Andersen N. Almeida A.S. Jensen P. Kamand M. Okarmus J. Rosenberg T. Friis S.D. Serrano A.M. Blaabjerg M. Kristensen B.W. Intermittent, Low Dose Carbon Monoxide Exposure Enhances Survival and Dopaminergic Differentiation of Human Neural Stem Cells PLoS ONE 2018 13 e0191207 10.1371/journal.pone.0191207 29338033 PMC5770048 85. Faizan M. Muhammad N. Niazi K.U.K. Hu Y. Wang Y. Wu Y. Sun H. Liu R. Dong W. Zhang W. CO-Releasing Materials: An Emphasis on Therapeutic Implications, as Release and Subsequent Cytotoxicity Are the Part of Therapy Materials 2019 12 1643 10.3390/ma12101643 31137526 PMC6566563 86. Sze P.Y. Hedrick B.J. Effects of Dexamethasone and Other Glucocorticoid Steroids on Tyrosine Hydroxylase Activity in the Superior Cervical Ganglion Brain Res. 1983 265 81 86 10.1016/0006-8993(83)91336-7 6133588 87. Williams L.R. Sandquist D. Black AC J.R. Williams T.H. Glucocorticoids Increase Tyrosine Hydroxylase Activity in Cultured Murine Neuroblastoma J. Neurochem. 1981 36 2057 2062 10.1111/j.1471-4159.1981.tb10834.x 6113272 88. Núñez C. Földes A. Pérez-Flores D. García-Borrón J.C. Laorden M.L. Kovács K.J. Milanés M.V. Elevated Glucocorticoid Levels Are Responsible for Induction of Tyrosine Hydroxylase mRNA Expression, Phosphorylation, and Enzyme Activity in the Nucleus of the Solitary Tract during Morphine Withdrawal Endocrinology 2009 150 3118 3127 10.1210/en.2008-1732 19179436 PMC2703550 89. Dunkley P.R. Bobrovskaya L. Graham M.E. Von Nagy-Felsobuki E.I. Dickson P.W. Tyrosine Hydroxylase Phosphorylation: Regulation and Consequences J. Neurochem. 2004 91 1025 1043 10.1111/j.1471-4159.2004.02797.x 15569247 90. Al-Wadei H.A.N. Takahasi T. Schuller H.M. PKA-Dependent Growth Stimulation of Cells Derived from Human Pulmonary Adenocarcinoma and Small Airway Epithelium by Dexamethasone Eur. J. Cancer 2005 41 2745 2753 10.1016/j.ejca.2005.09.001 16239108 91. Dwivedi Y. Pandey G.N. Adrenal Glucocorticoids Modulate [3H]Cyclic AMP Binding to Protein Kinase A (PKA), Cyclic AMP-Dependent PKA Activity, and Protein Levels of Selective Regulatory and Catalytic Subunit Isoforms of PKA in Rat Brain J. Pharmacol. Exp. Ther. 2000 294 103 116 10.1016/S0022-3565(24)39045-7 10871301 92. Zhang R.G. Yip C.Y. Ko W.H. Carbon Monoxide Inhibits Cytokine and Chloride Secretion in Human Bronchial Epithelia Cell Physiol. Biochem. 2018 49 626 637 10.1159/000493026 30165347 93. Schwer C.I. Stoll P. Rospert S. Schallner N. Bürkle H. Schmidt R. Humar M. Carbon Monoxide Releasing Molecule-2 CORM-2 Represses Global Protein Synthesis by Inhibition of Eukaryotic Elongation Factor eEF2 Int. J. Biochem. Cell Biol. 2013 45 201 212 10.1016/j.biocel.2012.09.020 23041477 94. Livak K.J. Schmittgen T.D. Analysis of Relative Gene Expression Data Using Real-Time Quantitative PCR and the 2(-Delta Delta C(T)) Method Methods 2001 25 402 408 10.1006/meth.2001.1262 11846609 Figure 1 Th n Th Gapdh Rpl32 p p Figure 2 Dbh n Dbh Gapdh Rpl32 p p Figure 3 Pnmt n Pnmt Gapdh Rpl32 p Figure 4 Th n Th Gapdh Rpl32 Figure 5 Dbh n Dbh Gapdh Rpl32 Figure 6 Pnmt n Pnmt Gapdh Rpl32 Figure 7 Changes in production and release of dopamine and norepinephrine in response to 24 h CORM-2 or NaHS treatment. PC12 cells were treated with 100 μM CORM-2 or 300 μM NaHS ( n p Figure 8 Th n Th Gapdh Rpl32 p p p Figure 9 Dbh n Dbh Gapdh Rpl32 p p Figure 10 Pnmt n Pnmt Gapdh Rpl32 p Figure 11 Changes in the 24 h glucocorticoid-mediated catecholamine content in culture media of dopamine and norepinephrine in response to CORM-2 or NaHS pretreatment. PC12 cells were pretreated with either 100 μM CORM-2 or 300 μM NaHS, followed by a DEX treatment for 24 h. Data are presented as the average concentration ±SEM of dopamine ( n n p p p cimb-47-00725-t001_Table 1 Table 1 Primers Utilized for qPCR. Gene  Sequence (5′–3′) Annealing Temperature (°C) Gapdh NM_017008.4 Forward GTCATCCCAGAGCTGAACGG 60 Reverse ATACTTGGCAGGTTTCTCCAGG Rpl32 NM_013226.3 Forward GGTGGCTGCCATCTGTTTTG 60 Reverse GTTTCCGCCAGTTTCGCTTAAT Th NM_012740.4 Forward GCGACAGAGTCTCATCGAGGAT 58 Reverse AAGAGCAGGTTGAGAACAGCATT Dbh NM_013158.3 Forward CGGTTTCTCCGACTGGAAGT 60 Reverse ATCAAGGGCGTGTACACCAG Pnmt NM_031526.2 Forward CGAGGACAAGGGAGAGTCCT 60 Reverse GGGCTTGTGCACATCAATGG ",
  "metadata": {
    "Title of this paper": "Analysis of Relative Gene Expression Data Using Real-Time Quantitative PCR and the 2(-Delta Delta C(T)) Method",
    "Journal it was published in:": "Current Issues in Molecular Biology",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12468340/"
  }
}