{
  "title": "Paper_1152",
  "abstract": "pmc iScience iScience 3532 isci iScience 2589-0042 Elsevier PMC12475572 PMC12475572.1 12475572 12475572 41019378 10.1016/j.isci.2025.113477 S2589-0042(25)01738-9 113477 1 Article Multi-epitope transplantation enables cross-type neutralization of phylogenetically distant HPV11/6/53 in mice Qian Ciying 1 2 3 Xu Yujie 1 2 3 Huang Yang 1 2 3 Chen Jie 1 2 Jiang Yanan 1 2 Shen Jingjia 1 2 Gao Fei 1 2 Ren Tianyu 1 2 Lu Yihan 1 2 Zhang Shuyue 1 2 Zhang Chengzong 1 2 Wang Daning 1 2 Zhou Lizhi 1 2 Li Tingting 1 2 Kong Zhibo 1 2 Zheng Qingbing 1 2 Yu Hai 1 2 Gu Ying guying@xmu.edu.cn 1 2 ∗ Xia Ningshao nsxia@xmu.edu.cn 1 2 ∗∗ Li Shaowei shaowei@xmu.edu.cn 1 2 4 ∗∗∗ 1 2 ∗ guying@xmu.edu.cn ∗∗ nsxia@xmu.edu.cn ∗∗∗ shaowei@xmu.edu.cn 3 These authors contributed equally 4 Lead contact 17 10 2025 02 9 2025 28 10 497597 113477 4 3 2025 29 6 2025 28 8 2025 02 09 2025 28 09 2025 29 09 2025 © 2025 The Author(s) 2025 https://creativecommons.org/licenses/by-nc-nd/4.0/ This is an open access article under the CC BY-NC-ND license (http://creativecommons.org/licenses/by-nc-nd/4.0/). Summary In the post-vaccine era, non-vaccine human papillomavirus (HPV) types necessitate broader-spectrum HPV vaccines. This study explores epitope transplantation to bridge the phylogenetic gaps between distant related types. Using the H11-6HI molecule, originally designed to cross-neutralize HPV11 and HPV6, we replaced its DE and FG loops with critical neutralizing epitopes from HPV53, generating the chimeric virus-like particle H11-6HI-53DE-FG. Cryo-electron microscopy confirmed a well-assembled T=7 virus-like structure. Pseudovirus-based neutralization assays revealed balanced neutralizing antibody titers against HPV11, HPV6, and HPV53, with ED 50 Graphical abstract Highlights • Bridging phylogenetic gaps for cross-neutralization of HR-HPV53 and LR-HPV11/6 • Designing H11-6HI-53DE-FG VLP with HPV53 loops, inducing balanced cross-neutralization • Establishing multi-epitope transplantation for broad HPV vaccine development Natural sciences; Biological sciences; Immunology; Microbiology; Virology Subject areas Natural sciences Biological sciences Immunology Microbiology Virology pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement yes pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes Published: September 2, 2025 Introduction Human papillomavirus (HPV) is a non-enveloped, double-stranded DNA virus comprising over 230 identified genotypes, classified into low-risk (LR-HPV) and high-risk (HR-HPV) categories based on their oncogenic potential. 1 , 2 , 3 , 4 , 5 6 , 7 8 , 9 , 10 , 11 12 13 , 14 15 , 16 , 17 18 16 , 19 20 , 21 , 22 The phylogenetic diversity and structural variability among the HPV types present significant challenges to vaccine development. L1, the major structural protein of HPV, forms the primary immunogenic component of VLP-based vaccines. 23 24 , 25 , 26 27 Recent advances in structural vaccinology and epitope transplantation have highlighted promising approaches for addressing these challenges. By transplanting neutralizing epitopes from one HPV type into the L1 scaffold of another, researchers have demonstrated the potential to induce cross-neutralizing immune responses, particularly within closely related HPV types. 27 , 28 29 27 , 30 A critical gap in current HPV vaccine research lies in the limited exploration of cross-type strategies that bridge LR and oncogenic or potentially oncogenic types. To address this, we selected HPV6 and HPV11—well-characterized LR types within the α10 species that are widely known for causing benign diseases such as genital warts and recurrent respiratory papillomatosis—as the structural scaffolds for chimeric VLP design. In contrast, we engineered epitopes from HPV53, a less widely recognized but epidemiologically significant type, to test cross-type epitope transplantation and neutralization potential. Although HPV53 is classified by the International Agency for Research on Cancer (IARC) as a possibly carcinogenic type (Group 2B), its clinical and epidemiological significance should not be overlooked, particularly in East Asian populations. 31 , 32 , 33 34 35 36 37 2 In this study, we address the critical challenge of bridging the phylogenetic gap between possibly carcinogenic type and LR HPV types by designing a chimeric VLP, H11-6HI-53DE-FG. Building on the original design of H11-6HI, which incorporates the immunodominant HI loop of HPV6 onto the L1 scaffold of HPV11, we strategically introduced two key neutralizing epitopes from HPV53 (DE and FG loops) into this established framework. This multi-epitope transplantation approach resulted in a chimeric VLP capable of inducing robust cross-neutralization across HPV6, HPV11, and HPV53. This study not only demonstrates the feasibility of using multi-epitope transplantation to overcome phylogenetic barriers but also establishes a framework for developing next-generation HPV vaccines with expanded coverage. By addressing the unmet need for protection against both LR and possibly carcinogenic types, our findings lay the groundwork for inclusive and broad-spectrum HPV prevention strategies. Results Phylogenetic analysis of HPV L1 sequences According to the IARC carcinogenic classification, 25 HPV types have been identified as potentially oncogenic. Among them, HPV6 and HPV11 are classified as LR types, whereas several other HPV types have uncertain carcinogenic potential. 3 , 4 Figure S1 Figure S2 Expression and purification of H11-6HI and HPV53 single- and double-loop swapped chimeric molecules in E. coli We engineered a series of chimeric molecules by replacing the loop sequences encoding HPV53 BC, DE, EF, and FG with the homologous loop regions of the H11-6HI molecule. These modifications included both single-loop and double-loop exchanges, yielding a total of 10 HPV11/6/53 chimeric molecules. The coding sequences of these chimeras were subsequently cloned into the pTO-T7 vector for expression in Escherichia coli Figure 1 Figure 1 Figure 1 Figure 1 Figure 1 Expression, purification, protein purity analysis, and in vitro (A) Schematic overview illustrating the key steps in the manufacturing process to produce high quantities of HPV WT and chimeric VLPs using Escherichia coli (B) SDS-PAGE analysis of purified HPV11-6HI-53 chimeric L1 protein obtained from SP Sepharose chromatography. (C) SDS-PAGE analysis of purified H11-6HI-53 chimeric VLPs obtained from Superdex 200 Sepharose chromatography. (D) Western blot analysis of purified chimeric VLP proteins separated by reducing SDS-PAGE, detected using a broad-spectrum linear monoclonal antibody 4B3. Characterization of the in vitro To comprehensively characterize the physical and chemical properties of the chimeric VLPs, we employed a variety of analytical techniques, including transmission electron microscopy, high-performance size exclusion chromatography (HPSEC), and dynamic light scattering (DLS). The H11-6HI and HPV53 VLPs served as controls for these analyses. As depicted in Figure 2 in vitro Figure 2 Morphological, size, and homogeneity characterization of H11-6HI-53 chimeric VLPs (A) Characterization of H11-6HI and HPV53 chimeric VLPs with a single homologous loop replacement: TEM images depict the particle morphology with a 100-nm scale bar (top). HPSEC elution profiles illustrate particle size and purity (middle). DLS provides the particle size distribution data (bottom). (B) Characterization of H11-6HI and HPV53 chimeric VLPs with two homologous loop replacements: TEM images show the morphology of particles with a 100-nm scale bar (top). HPSEC elution profiles reveal particle size and purity (middle). DLS particle size distribution analysis is presented (bottom). Building upon the single-loop exchanges, we introduced additional loop regions from HPV53 to produce double-loop swap constructs. Refer to Figure 2 27 Our findings suggest that homologous loop region exchanges between the phylogenetically distant HPV11 and HPV53 types exert minimal influence on VLP assembly. This preservation of structural integrity and particle uniformity highlights the robustness of the VLP scaffold despite significant genomic alterations. These insights are critical for optimizing the design and development of VLP-based vaccines, where cross-type chimeric constructs can be beneficial. Immunogenicity analysis of H11-6HI and HPV53 chimeric VLPs in mice To investigate the immunogenic properties of the well-assembled H11-6HI-53 chimeric VLPs—including their ability to maintain neutralizing antibody titers against HPV11 and 6, as well as to induce neutralizing antibodies against HPV53—we conducted a series of immunizations in 6-week-old SPF BALB/c female mice. The mice were randomly divided into groups ( n As illustrated in Figure 3 Figure 3 Induction of type-specific and cross-type neutralizing antibodies by H11-6HI-53 chimeric VLP vaccination BALB/c mice ( n p p (A) Dose-dependent immunogenicity of the H11-6HI-53 chimeric VLPs. (B) Type-specific and cross-neutralizing antibody titers induced by H11-6HI-53 chimeric VLPs 2 weeks after three immunizations. Detailed characterization of sera collected 2 weeks post the third immunization was conducted. This included evaluations of type-specific antibody levels, cross-type neutralizing antibody levels, and the dose dependency of neutralizing antibody titers ( Figure 3 29 2 To further evaluate the immunogenic performance of the chimeric molecules H11-6HI-53BC-EF and H11-6HI-53DE-FG, we assessed both type-specific and cross-type binding antibody titers. The results, presented in Figure 4 4 p p p Figure 4 Induction of type-specific and cross-type IgG titers by HPV11/6/53 chimeric candidate vaccine BALB/c mice ( n p p p p Evaluation of ED 50 The half-maximal effective dose (ED 50 50 50 Table 1 50 50 50 38 Table 1 Half-maximal effective dosage (ED 50 Antigen (VLP) Dose (μg) PsV11 PsV6 PsV53 Seroconversion no./inoculated no. ED 50 Seroconversion no./inoculated no. ED 50 Seroconversion no./inoculated no. ED 50 HPV11 0.300 8/8 0.066 1/8 >0.300 0/8 >0.300 0.100 5/8 3/8 0/8 0.033 1/8 1/8 0/8 0.011 1/8 0/8 0/8 HPV6 0.300 0/8 >0.300 8/8 0.031 0/8 >0.300 0.100 0/8 3/8 0/8 0.033 0/8 7/8 0/8 0.011 0/8 0/8 0/8 HPV53 0.300 0/8 >0.300 0/8 >0.300 7/8 0.025 0.100 0/8 0/8 8/8 0.033 0/8 0/8 6/8 0.011 0/8 0/8 0/8 HPV11&6&53 0.300 8/8 0.144 8/8 0.144 8/8 0.019 0.100 2/8 2/8 8/8 0.033 0/8 0/8 8/8 0.011 0/8 0/8 0/8 H11-6HI-53BC-EF 0.900 7/8 0.380 1/8 >0.900 0/8 >0.900 0.300 1/8 0/8 0/8 0.100 4/8 2/8 1/8 0.033 0/8 0/8 0/8 0.011 0/8 0/8 0/8 H11-6HI-53DE-FG 0.900 6/8 0.528 5/8 0.544 5/8 0.374 0.300 1/8 1/8 3/8 0.100 1/8 2/8 0/8 0.033 0/8 0/8 0/8 0.011 0/8 0/8 3/8 Thermal stability and structural integrity of the chimeric vaccine candidate H11-6HI-53DE-FG Thermal stability is a critical attribute for vaccines, significantly influencing their shelf life, distribution logistics, accessibility, cost-effectiveness, and overall public health impact. Utilizing a MicroCal VP-Capillary DSC system, we determined the melting temperatures (Tm values) of WT HPV11, HPV6, the scaffold molecules H11-6HI, and the chimeric H11-6HI-53. As illustrated in Figure 5 Figure 5 Thermal stability and cryo-electron microscopic (cryo-EM) characterization of HPV11-6HI-53 chimeric candidate vaccine (A) Thermal stability comparison of WT, double-type chimeric VLP, and triple-type chimeric VLP of HPV11, HPV6, and HPV53. (B) Cryo-EM structural visualization of H11-6HI-53DE-FG chimeric VLPs, illustrated with radial color grading from 260 to 290 Å, detailing the complex conformational nuances. Resolution validation of the icosahedral architecture of H11-6HI-53DE-FG chimeric VLPs was performed using gold-standard Fourier shell correlation (FSC) curves, achieving a resolution of 19.48 Å, with an FSC cutoff at 0.143. Further evaluation via cryo-electron microscopy provided insights into the structural integrity of the H11-6HI-53DE-FG VLP (EMDB: EMD-63835), attaining a resolution of 19.48 Å as assessed by the Fourier shell correlation criterion at 0.143 ( Figure 5 29 Discussion Over the past few decades, the rational design of HPV vaccines has made substantial progress, with current strategies focusing on broadening antigenic coverage, enhancing immune responses, and addressing the limitations of type-specific immunity. Although prophylactic HPV vaccines have significantly reduced the global burden of HPV-related diseases, the continued circulation of non-vaccine HPV types and the phylogenetic divergence between possibly carcinogenic types and LR types underscore the need for innovative vaccine designs. Current mainstream approaches to broaden vaccine protection include increasing the number of VLP types in multivalent formulations and exploring L2-based vaccines. The former strategy has yielded successive advances, from bivalent to quadrivalent and currently nonavalent HPV vaccines, with even more extensive formulations (e.g., 11-valent [CTR20201029] and 15-valent [CTR20241041]) undergoing clinical evaluation. Although these multivalent formulations effectively expand type coverage, they inevitably increase the total protein dose (e.g., the nonavalent vaccine contains 270 μg per dose) and require the establishment of additional type-specific production lines to manufacture each distinct VLP component. Moreover, further increases in antigenic components may exacerbate immune interference, necessitating dose adjustments that could raise the risk of adverse events and elevate production costs. 39 40 In contrast, our L1 epitope transplantation strategy represents a pragmatic and scalable design framework. By targeting immunodominant surface loops from epidemiologically relevant genotypes and integrating them into established L1 scaffolds, we created chimeric VLPs capable of cross-neutralizing multiple HPV types. In this study, the H11-6HI-53DE-FG construct achieved cross-neutralization against HPV11, HPV6, and HPV53 using a single immunogen. The required protein dose was only approximately one-third of the WT VLP mixtures necessary for the same type coverage. Our approach has been successfully extended to multiple clusters of genotypes (e.g., HPV16/35/31, 18/45/59, 58/33/52, and others), supporting the feasibility of designing 7–8 chimeric constructs to collectively cover 20–21 clinically significant HPV types. 27 From a production standpoint, all our chimeric VLPs are expressed in E. coli de novo In prior studies, single-loop transplantation strategies showed limited success in inducing cross-neutralization between phylogenetically distant HPV types. 27 However, inducing cross-neutralization between phylogenetically distant HPV types remains a significant challenge. Although the H11-6HI-53DE-FG chimeric VLP elicited neutralizing antibody titers against HPV53 in the range of 2–3 log units, the overall potency remained moderate, suggesting that the immunogenicity of the transplanted epitopes is still limited. Moreover, when multiple key loop regions—especially the two major neutralizing loops of HPV11—were replaced within the H11-6HI scaffold, we observed a noticeable reduction in neutralization titers against both HPV11 and HPV6, with performance inferior to that of the WT HPV11/6 VLPs. Notably, H11-6HI-53DE-FG exhibited a greater reduction in HPV11 and HPV6 neutralization titers at the 5 μg dose compared with other dual-loop chimeras. Nonetheless, this construct showed a more balanced neutralizing response across all three target types at low antigen doses, comparable to or even exceeding that of single- or dual-loop replacements, suggesting that although multi-epitope transplantation can broaden type coverage, it may also compromise the immunogenicity of the original scaffold type. Further insights were revealed when we constructed a chimeric VLP containing only the DE loop of HPV53 on the H11-6HI scaffold. This construct completely lost neutralizing activity against all three target types, indicating that the DE loop is likely a critical neutralization epitope for HPV11. The partial recovery of neutralization observed in the dual-loop chimeras may stem from structural remodeling of the functional epitopes on the VLP surface induced by multiple epitope substitutions. This hypothesis, however, requires validation through high-resolution structural analysis to determine the precise conformational changes caused by heterologous epitope grafting. Future vaccine optimization should focus on the accurate identification of neutralizing epitopes for each HPV type and ensuring their faithful conformational presentation on heterologous scaffolds to maximize immunogenic efficacy. Interestingly, despite limited neutralizing activity, some chimeric VLPs induced markedly high binding antibody titers. For example, H11-6HI-53BC-EF elicited binding titers against HPV53 exceeding 10 6 3 E. coli Therefore, in the practical development of third-generation HPV vaccines based on chimeric VLPs (e.g., eight constructs covering 21 HPV types), we prioritize homologous epitope transplantation between phylogenetically related genotypes to maximize cross-type immunogenicity. However, when this approach fails to preserve or transfer immunogenicity effectively, our findings demonstrate that multi-epitope transplantation across more distantly related types provides a viable alternative, offering a complementary strategy to broaden vaccine coverage. For vaccine efficacy evaluation, we employed a PBNA instead of an in vivo 41 , 42 43 , 44 E. coli E. coli 45 in vivo in vivo in vivo in vivo In summary, this study demonstrates the potential of multi-epitope transplantation to overcome the phylogenetic barriers between HR and LR HPV types. By strategically introducing two immunodominant epitopes from HPV53 into the H11-6HI scaffold, we successfully designed a chimeric VLP, H11-6HI-53DE-FG, capable of inducing balanced cross-neutralization across HPV11, HPV6, and HPV53. These findings highlight the feasibility of leveraging epitope transplantation to design broad-spectrum HPV vaccines, offering an alternative pathway for addressing gaps in current vaccine strategies. Although challenges remain in optimizing immunogenicity and maintaining scaffold stability, this approach provides a promising framework for the rational design of next-generation HPV vaccines. Future efforts should focus on further refining epitope selection, scaffold engineering, and evaluating these constructs in clinically relevant models to advance their development as effective and inclusive HPV vaccines. Limitations of the study This study identified promising multivalent vaccine antigens capable of cross-neutralizing HPV11, HPV6, and HPV53. To ensure clinical translatability, these chimeric VLP constructs require detailed evaluation of their immunogenicity and protective efficacy in preclinical models like rabbits and cynomolgus macaques, which better mimic human immune responses. Assessing these candidates across diverse models will provide critical insights into their broad-spectrum protective potential and capacity to prevent HPV-related diseases. Additionally, advancing these vaccine formulations toward human application necessitates thorough examination of their safety, production scalability, and long-term stability under various storage conditions. Addressing these gaps through rigorous preclinical and translational research will enhance the feasibility of implementing this vaccine design, offering a pathway for developing more inclusive and effective strategies for HPV prevention. Resource availability Lead contact Further information and requests for resources and reagents should be addressed to and will be fulfilled by the lead contact Shaowei Li ( shaowei@xmu.edu.cn Materials availability This study did not generate unique reagents. Data and code availability  • All data supporting the findings of this study are included in the main article and supplementary materials. • The cryo-EM density map generated during the study has been deposited in the Electron Microscopy Data Bank (EMDB) under accession number EMD-63835, which is also listed in the key resources table • No original or custom code was generated or used in this study, and no additional datasets or resources were deposited in external repositories. • Any additional information required to reanalyze the data reported in this paper is available from the lead contact Acknowledgments This work was supported by the 10.13039/501100012166 National Key Research and Development Program of China 2024YFC2310601 10.13039/501100001809 National Natural Science Foundation of China 82271873 82471864 82302062 Xiamen Industry-University-Research Collaboration Program 2024CXY0113 Xiang'an Innovation Laboratory Technology Program 2023XAKJ0101019 10.13039/501100012226 Fundamental Research Funds for the Central Universities 20720220004 20720220006 https://app.biorender.com/ Author contributions S.L., N.X., and Y.G. designed the study. C.Q., Y.X., Y.H., J.C., Y.J., J.S., F.G., T.R., Y.L., S.Z., C.Z., D.W., L.Z., T.L., and Z.K. performed the experiments. C.Q., Q.Z., H.Y., and S.L. analyzed the data. C.Q. wrote the original draft. C.Q. and S.L. participated in discussion and interpretation of the results. S.L., N.X., Y.G., and L.Z. acquired funding. All authors contributed to experimental design. Declaration of interests The authors declare no competing interests. STAR★Methods Key resources table  REAGENT or RESOURCE SOURCE IDENTIFIER Antibodies 4B3 Li et al. 27 N/A Goat anti-mouse IgG-HRP This paper N/A Bacterial and virus strains E.coli This paper N/A DH5α Chemically Competent Cell Invitrogen Cat # 12034013 Biological samples Serum samples from BALB/c mice This paper N/A Chemicals, peptides, and recombinant proteins All HPV L1 This paper N/A Critical commercial assays Plasmid Small Extraction Kit Tiangen Cat# DP103 EndoFree Maxi Plasmid Kit TianGen Cat# DP117 Trypsin Thermo Fisher Lot # TG269188 DMEM Thermo Fisher Cat #11965092 1x PBS, pH 7.4 Thermo Fisher Cat # 10010031 Fetal bovine serum (FBS) Thermo Fisher Cat # 10099 Polyethylenimine Linear (PEI) MW40000 (rapid lysis) Yeasen Cat # 40816ES03 SurePAGEᵀᴹ, Bis-Tris, 10x8, 4-12%, 10 wells GenScript Cat# M00652 Deposited data H11-6HI-53DE-FG VLP This paper EMDB: EMD-63835 Experimental models: Cell lines HEK293FT ATCC RRID: CVCL_6911 Experimental models: Organisms/strains BALB/c mice Slac Laboratiry Animal Co.,shanghai, China N/A Recombinant DNA HPV11/6/53 chimeric L1 This paper N/A Software and algorithms PyMOL PyMOL https://pymol.org/ GraphPad Prism (version 8.0.1) Graphpad https://www.graphpad.com/ ChimeraX software Goddard et al. 46 https://www.cgl.ucsf.edu/chimerax/ EPU Thermo Fisher Scientific N/A SPSS Statistics software IBM https://www.ibm.com/products/spss-statistics Clustal Omega software EMBL-EBI https://www.ebi.ac.uk/Tools/msa/clustalo/ MicroCal Origin 8.0 software OriginLab Corporation https://www.originlab.com/ cisTEM software Grant Lab https://cistem.org/ Experimental model and study participant details Mice All experiments were conducted using age-matched (6-8 weeks) female BALB/c mice, purchased from SLAC Laboratory Animal Co., Shanghai, China, and maintained under specific-pathogen-free conditions. The sex of the mice was female only; no comparison of sex/gender effects was performed, which is acknowledged as a limitation of this study. The experimental protocols were approved by the Xiamen University Laboratory Animal Management Ethics Committee (Protocol No. XMULA20220301), and all procedures were performed in strict compliance with animal ethics guidelines and approved protocols. Cell lines HEK293FT cell line was purchased from Thermo Fisher (Cat# R70007 Method details Phylogenetic relationships analysis of the HPV L1 sequences L1 DNA sequences of 46 HPV types were retrieved from the International Human Papillomavirus Reference Center. 32 47 48 49 HPV virus-like particle preparation The construction and assembly validation of H11-6HI and HPV53 VLPs were carried out as previously described. 29 , 38 E. coli E. coli 600 SDS-PAGE and western blotting SDS-PAGE was performed according to the modified method of Laemmli. 50 Negative-stain electron microscopy Purified WT and chimeric VLPs were diluted to 0.2 mg/mL with phosphate buffer (pH 6.5, containing 0.5 M NaCl) and adsorbed onto 200-mesh carbon-coated copper grids (Quantifoil Micro Tools) at room temperature for 2 min. Following adsorption, the grids were stained with 2% phosphotungstic acid (pH 6.4) for 1 min. Specimens were examined and imaged using an FEI Tecnai T12 transmission electron microscope (TEM) operating at 120 kV and a magnification of 15,000×. High-performance size exclusion chromatography (HPSEC) The homogeneity analysis of WT and chimeric VLPs was conducted using a high-performance size exclusion chromatography (HPSEC) system (Waters Corporation) equipped with a TSK G5000 PWXL column (7.5 mm × 300 mm; TOSOH, Tokyo, Japan). The mobile phase consisted of a phosphate buffer containing 0.5 M NaCl at pH 6.5, with a flow rate maintained at 0.5 mL/min. Detection was performed at a wavelength of 280 nm. Dynamic light scattering (DLS) For DLS experiments, VLPs samples with a final concentration of 0.5 mg/mL were centrifuged at 13,000 rpm for 10 min to remove large particulate matter. The clarified samples were then carefully transferred into clean, plastic cuvettes with a 10-mm path length, ensuring overfilling of the 50-μL sample cells. Measurements were conducted using a NanoBrook Omni DLS system (Brookhaven Instruments). Data collection and analysis followed the standard procedures provided by the instrument manufacturer. The hydrodynamic radius (Rh) of the particles was calculated using the Stokes-Einstein equation. The mean hydrodynamic particle size distribution of WT and chimeric VLPs was determined from the average of three separate acquisitions. Differential scanning calorimetry (DSC) The thermal stability of the WT and chimeric VLPs was evaluated using a MicroCal VP-Capillary DSC system (GE Healthcare, MicroCal Products Group, Northampton, MA). Samples were diluted to a concentration of 0.5 mg/mL in a phosphate buffer (pH 6.5, containing 0.5 M NaCl). DSC was performed across a temperature range of 10°C to 90°C at a scanning rate of 100°C per hour. Data, including DSC curves and melting temperatures (Tm), were analyzed using MicroCal Origin 8.0 software (OriginLab Corp., Northampton, MA). Cryo-electron microscopy (Cryo-EM) Aliquots of 3 μL of purified H11-6HI-53DE-FG virus-like particles (VLPs) (2.0 mg/mL) were applied to glow-discharged Quantifoil grids (R1.2/1.3, 200 mesh; Quantifoil Micro Tools) using a Vitrobot Mark IV (Thermo Fisher Scientific) at 100% humidity and 4°C. Cryo-electron microscopy (cryo-EM) images were captured on a FEI Tecnai F30 transmission electron microscope (Thermo Fisher Scientific) at 300 kV, equipped with a Falcon III direct electron detector. The electron acceleration voltage was set to 300 kV with 93,000× magnification, resulting in a pixel size of 1.120 Å. Data were automatically collected with Thermo Fisher EPU software. Icosahedral 3D reconstructions were performed using AUTO3DEM 51 52 53 46 Enzyme-linked immunosorbent assay (ELISA) Purified WT or chimeric VLPs were coated onto 96-well microplates at a concentration of 300 ng per well and incubated for 2 hours at 37°C. Following a single wash with PBST buffer (20 mmol/L PBS [pH 7.4], 150 mmol/L NaCl, and 0.05% Tween-20), the plates were blocked with 200 μL of enzyme dilution buffer (PBS containing 0.25% casein, 1% gelatin, and 0.05% proclin-300), supplemented with 10% sucrose. Subsequently, the wells were incubated with 100 μL of 3-fold serially diluted vaccinated mouse serum, starting at a dilution of 1:2000, for 45 min at 37°C. Wells were then washed five times with PBST buffer and incubated with HRP-conjugated anti-mouse IgG for 45 min at 37°C, followed by another five washes. Finally, 100 μL of substrate solution (WANTAI BioPharm) was added to each well and incubated for 15 min at 37°C. The reaction was then quenched with the addition of 50 μL of 2 mol/L H 2 4 HPV pseudovirus preparation The pvitro-L1-L2 co-expression vectors and pcDNA3.1-EGFP used in the experiment were kindly provided by Dr. J. T. Schiller. Plasmids carrying codon-optimized HPV L1 and L2 genes were co-transfected into 293FT cells (Thermo Fisher, Cat# R70007 50 54 28 5 50 Pseudovirus-based neutralization assay (PBNA) To detect serum neutralizing antibody titers, mouse sera were initially diluted in ES serum-containing DMEM to various starting concentrations (ranging from 2.5 to 1000). These initial dilutions were then subjected to 2-fold serial dilutions, maintaining a total volume of 60 μL for each dilution. The diluted sera (60 μL) were subsequently mixed with an equal volume (60 μL) of HPV PsV diluent, which contained a PsV concentration of 3 × 10 5 50 4 Vaccine immunogenicity evaluation Female BALB/c mice (n = 5), aged 6-8 weeks, were immunized intraperitoneally with 1 mL of vaccine following a prime-boost-boost regimen on days 0, 14, and 28. Each immunization consisted of either chimeric or WT VLPs formulated with aluminum adjuvant at doses of 5.0, 1.0, or 0.2 μg per dose. The final endotoxin concentration of all antigen preparations was validated by the Limulus Amebocyte Lysate (LAL) assay (Lonza), <1 EU/μg. 55 ED 50 Female BALB/c mice (n = 8) were administered a single intraperitoneal vaccination with varying doses (0.011, 0.033, 0.100, 0.300, or 0.900 μg) of either WT or chimeric VLPs mixed with aluminum adjuvant. Serum samples were collected five weeks post-immunization. Neutralizing antibody responses were assessed using pseudovirus-based cell models for HPV11, HPV6, and HPV53. The results were analyzed using the Reed and Muench method. 54 Quantification and statistical analysis Statistical analyses were performed using SPSS Statistics software (IBM Corp., Armonk, NY, USA). Data were subjected to one-way or two-way analysis of variance (ANOVA) and are presented as mean ± standard deviation (SD). Statistical significance was denoted as follows: ∗ p p p p References 1 McBride A.A. Human papillomaviruses: diversity, infection and host interactions Nat. Rev. Microbiol. 20 2022 95 108 10.1038/s41579-021-00617-5 34522050 2 Organization W.H. Human papillomavirus and related diseases report https://hpvcentre.net/statistics/reports/XWX.pdf?t=1730354620807 2023 3 Brianti P. De Flammineis E. Mercuri S.R. Review of HPV-related diseases and cancers New Microbiol. 40 2017 80 85 28368072 4 IARC Working Group on the Evaluation of Carcinogenic Risks to Humans Personal habits and indoor combustions IARC Monogr. Eval. Carcinog. Risks Hum. 100 2012 1 538 PMC4781577 23193840 5 de Villiers E.-M. Fauquet C. Broker T.R. Bernard H.-U. zur Hausen H. Classification of papillomaviruses Virology 324 2004 17 27 10.1016/j.virol.2004.03.033 15183049 6 Zhang P. Monteiro da Silva G. Deatherage C. Burd C. DiMaio D. Cell-penetrating peptide mediates intracellular membrane passage of human papillomavirus L2 protein to trigger retrograde trafficking Cell 174 2018 1465 1476.e3 10.1016/j.cell.2018.07.031 30122350 PMC6128760 7 Chen J. Wang D. Wang Z. Wu K. Wei S. Chi X. Qian C. Xu Y. Zhou L. Li Y. Critical residues involved in the coassembly of L1 and L2 capsid proteins of human papillomavirus 16 J. Virol. 97 2023 e0181922 10.1128/jvi.01819-22 PMC10062154 36815785 8 Tommy R. Buchanan W.,S.,G. Young J. Morbidity and mortality of vulvar and vaginal cancers: Impact of 2-4-and 9-valent HPV vaccines Hum. Vaccin. Immunother. 12 2016 1352 1356 26901390 10.1080/21645515.2016.1147634 PMC4964646 9 Lawson J.S. Glenn W.K. Evidence for a causal role by human papillomaviruses in prostate cancer – a systematic review Infect. Agent Cancer 15 2020 41 32684946 10.1186/s13027-020-00305-8 PMC7359253 10 Freddie B. Jacques F. Isabelle S. Rebecca S. Global cancer statistics 2018: GLOBOCAN estimates of incidence and mortality worldwide for 36 cancers in 185 countries CA Cancer J. Clin. 68 2018 394 424 30207593 10.3322/caac.21492 11 Leconte B.A. Peter S. Fennewald S.M. Lou D.I. Suimin Q. Nai-Wei C. Lee J.H. Resto V.A. Lina T.M. Differences in the viral genome between HPV-positive cervical and oropharyngeal cancer PLoS One 13 2018 e0203403 10.1371/journal.pone.0203403 PMC6117069 30161236 12 Gluvajić D. Hošnjak L. Zorec T.M. Gale N. Boltežar I.H. Poljak M. Long-term infection with a particular human papillomavirus (HPV) genotype, HPV Subtype, or HPV genomic variant does not significantly influence the clinical course of recurrent respiratory papillomatosis J. Med. Virol. 96 2024 e70060 10.1002/jmv.70060 PMC11600516 39540396 13 Cancer I.A.f.R.o. Absolute numbers of cervical cancer incidence and mortality in 2022 https://gco.iarc.fr/today/en/dataviz/bars?types=0&mode=cancer&group_populations=1&sort_by=value0&key=total&sexes=2 2024 14 Kombe Kombe A.J. Li B. Zahid A. Mengist H.M. Bounda G.A. Zhou Y. Jin T. Epidemiology and burden of human papillomavirus and related diseases, molecular pathogenesis, and vaccine evaluation Front. Public Health 8 2020 552028 10.3389/fpubh.2020.552028 PMC7855977 33553082 15 Ntanasis-Stathopoulos I. Kyriazoglou A. Liontos M. A Dimopoulos M. Gavriatopoulou M. Current trends in the management and prevention of human papillomavirus (HPV) infection J. Balkan Union Oncol. 25 2020 1281 1285 32862567 16 Vesikari T. Brodszki N. van Damme P. Diez-Domingo J. Icardi G. Petersen L.K. Tran C. Thomas S. Luxembourg A. Baudin M. A randomized, double-blind, phase III study of the immunogenicity and safety of a 9-valent human papillomavirus L1 virus-like particle vaccine (V503) versus Gardasil® in 9–15-year-old girls Pediatr. Infect. Dis. J. 34 2015 992 998 26090572 10.1097/INF.0000000000000773 17 Garland S.M. Hernandez-Avila M. Wheeler C.M. Perez G. Harper D.M. Leodolter S. Tang G.W.K. Ferris D.G. Steben M. Bryan J. Quadrivalent vaccine against human papillomavirus to prevent anogenital diseases N. Engl. J. Med. 356 2007 1928 1943 10.1056/NEJMoa061760 17494926 18 Kirnbauer R. Booy F. Cheng N. Lowy D.R. Schiller J.T. Papillomavirus L1 major capsid protein self-assembles into virus-like particles that are highly immunogenic Proc. Natl. Acad. Sci. USA 89 1992 12180 12184 10.1073/pnas.89.24.12180 1334560 PMC50722 19 Organization W.H. Human papillomavirus vaccines (HPV) https://www.who.int/teams/immunization-vaccines-and-biologicals/diseases/human-papillomavirus-vaccines-(HPV) 2024 20 Mesher D. Soldan K. Lehtinen M. Beddows S. Brisson M. Brotherton J.M.L. Chow E.P.F. Cummings T. Drolet M. Fairley C.K. Population-level effects of human papillomavirus vaccination programs on infections with nonvaccine genotypes Emerg. Infect. Dis. 22 2016 1732 1740 10.3201/eid2210.160675 27648688 PMC5038419 21 Wang H. Cheng X. Ye J. Xu X. Hong Y. Sui L. You Z. Xie X. Distribution of human papilloma virus genotype prevalence in invasive cervical carcinomas and precancerous lesions in the Yangtze River Delta area, China BMC Cancer 18 2018 487 10.1186/s12885-018-4330-9 29703167 PMC5924433 22 Ährlund-Richter A. Cheng L. Hu Y.O.O. Svensson M. Pennhag A.A.L. Ursu R.G. Haeggblom L. Grün N. Ramqvist T. Engstrand L. Changes in cervical human papillomavirus (HPV) prevalence at a youth clinic in Stockholm, Sweden, a decade after the introduction of the HPV vaccine Front. Cell. Infect. Microbiol. 9 2019 59 10.3389/fcimb.2019.00059 30949454 PMC6435486 23 Qian C. Liu X. Xu Q. Wang Z. Chen J. Li T. Zheng Q. Yu H. Gu Y. Li S. Xia N. Recent progress on the versatility of virus-like particles Vaccines (Basel) 8 2020 139 10.3390/vaccines8010139 PMC7157238 32244935 24 Christensen N.D. Kreider J.W. Cladel N.M. Patrick S.D. Welsh P.A. Monoclonal antibody-mediated neutralization of infectious human papillomavirus type 11 J. Virol. 64 1990 5678 5681 10.1128/jvi.64.11.5678-5681.1990 2170694 PMC248629 25 Christensen N.D. Kirnbauer R. Schiller J.T. Ghim S.J. Schlegel R. Jenson A.B. Kreider J.W. Human papillomavirus types 6 and 11 have antigenically distinct strongly immunogenic conformationally dependent neutralizing epitopes Virology 205 1994 329 335 10.1006/viro.1994.1649 7526536 26 White W.I. Wilson S.D. Bonnez W. Rose R.C. Koenig S. Suzich J.A. In vitro infection and type-restricted antibody-mediated neutralization of authentic human papillomavirus type 16 J. Virol. 72 1998 959 964 10.1128/jvi.72.2.959-964.1998 9444988 PMC124566 27 Li Z. Song S. He M. Wang D. Shi J. Liu X. Li Y. Chi X. Wei S. Yang Y. Rational design of a triple-type human papillomavirus vaccine by compromising viral-type specificity Nat. Commun. 9 2018 5360 10.1038/s41467-018-07199-6 30560935 PMC6299097 28 Qian C. Yang Y. Xu Q. Wang Z. Chen J. Chi X. Yu M. Gao F. Xu Y. Lu Y. Characterization of an Escherichia coli-derived triple-type chimeric vaccine against human papillomavirus types 39, 68 and 70 NPJ Vaccines 7 2022 134 10.1038/s41541-022-00557-y 36316367 PMC9622684 29 Wang Z. Wang D. Chen J. Gao F. Jiang Y. Yang C. Qian C. Chi X. Zhang S. Xu Y. Rational design of a cross-type HPV vaccine through immunodominance shift guided by a cross-neutralizing antibody Sci. Bull. 69 2024 512 525 10.1016/j.scib.2023.12.021 38160175 30 Bishop B. Dasgupta J. Klein M. Garcea R.L. Christensen N.D. Zhao R. Chen X.S. Crystal structures of four types of human papillomavirus L1 capsid proteins: understanding the specificity of neutralizing monoclonal antibodies J. Biol. Chem. 282 2007 31803 31811 10.1074/jbc.M706380200 17804402 31 Muñoz N. Bosch F.X. de Sanjosé S. Herrero R. Castellsagué X. Shah K.V. Snijders P.J.F. Meijer C.J.L.M. International Agency for Research on Cancer Multicenter Cervical Cancer Study Group Epidemiologic classification of human papillomavirus types associated with cervical cancer N. Engl. J. Med. 348 2003 518 527 10.1056/NEJMoa021641 12571259 32 Center I.H.P.R. HPV reference clones: Officially established HPV types https://www.hpvcenter.se/human_reference_clones/ 2024 33 Han C. Huang W. Ye M. Zou R. Lan J. Chen J. Jiang J. Wang H. Xia L. Luo J. HPV prevalence and genotype distribution in 2,306 patients with cervical squamous cell carcinoma in central and eastern China Front. Public Health 11 2023 1225652 10.3389/fpubh.2023.1225652 PMC10493278 37701907 34 Guo W. Hu Z. Yan J. Shen X. Meng Q. Wu H. Xiang Y. Yao C. Du K. Epidemiological study of human papillomavirus infection in 105,679 women in Wuhan, China BMC Infect. Dis. 24 2024 1111 10.1186/s12879-024-10011-0 39375610 PMC11457396 35 Zheng L.-l. Chen S.-f. Yang F. Wang W.-h. Xu C. Zheng L.-y. High-risk HPV prevalence and genotype distribution among women in Liaocheng, Shandong Province, China from 2016 to 2022 Front. Public Health 11 2023 1145396 10.3389/fpubh.2023.1145396 37064671 PMC10098111 36 Hao S. Wang C. Liu S. He J. Jiang Y. HPV genotypic spectrum in Jilin province, China, where non-vaccine-covered HPV53 and 51 are prevalent, exhibits a bimodal age-specific pattern PLoS One 15 2020 e0230640 10.1371/journal.pone.0230640 PMC7313545 32208459 37 Ouh Y.T. Min K.J. Cho H.W. Ki M. Oh J.K. Shin S.Y. Hong J.H. Lee J.K. Prevalence of human papillomavirus genotypes and precancerous cervical lesions in a screening population in the Republic of Korea, 2014-2016 J. Gynecol. Oncol. 29 2018 e14 10.3802/jgo.2018.29.e14 PMC5709524 29185272 38 Qian C. Chen J. Yang Y. Lu Y. Ren T. Jiang Y. Huang Y. Chi X. Zhang S. Zhang C. Rational design of a triple-type HPV53/56/66 vaccine with one preferable base particle incorporating two identified immunodominant sites J. Nanobiotechnol. 23 2025 28 10.1186/s12951-024-03080-5 PMC11744962 39828682 39 Luxembourg A. Brown D. Bouchard C. Giuliano A.R. Iversen O.E. Joura E.A. Penny M.E. Restrepo J.A. Romaguera J. Maansson R. Phase II studies to select the formulation of a multivalent HPV L1 virus-like particle (VLP) vaccine Hum. Vaccin. Immunother. 11 2015 1313 1322 10.1080/21645515.2015.1012010 25912208 PMC4514333 40 Huber B. Wang J.W. Roden R.B.S. Kirnbauer R. RG1-VLP and Other L2-Based, broad-spectrum HPV vaccine candidates J. Clin. Med. 10 2021 1044 10.3390/jcm10051044 PMC7959455 33802456 41 Longet S. Schiller J.T. Bobst M. Jichlinski P. Nardelli-Haefliger D. A murine genital-challenge model is a sensitive measure of protective antibodies against human papillomavirus infection J. Virol. 85 2011 13253 13259 10.1128/jvi.06093-11 21976653 PMC3233130 42 Day P.M. Pang Y.Y.S. Kines R.C. Thompson C.D. Lowy D.R. Schiller J.T. A human papillomavirus (HPV) in vitro neutralization assay that recapitulates the in vitro process of infection provides a sensitive measure of HPV L2 infection-inhibiting antibodies Clin. Vaccine Immunol. 19 2012 1075 1082 10.1128/cvi.00139-12 22593236 PMC3393370 43 Dessy F.J. Giannini S.L. Bougelet C.A. Kemp T.J. David M.P.M. Poncelet S.M. Pinto L.A. Wettendorff M.A. Correlation between direct ELISA, single epitope-based inhibition ELISA and pseudovirion-based neutralization assay for measuring anti-HPV-16 and anti-HPV-18 antibody response after vaccination with the AS04-adjuvanted HPV-16/18 cervical cancer vaccine Hum. Vaccin. 4 2008 425 434 10.4161/hv.4.6.6912 18948732 44 World Health Organization WHO Expert Committee on Biological Standardization World Health Organization Technical Report Series 2016 1 267 29144075 45 Xie F. Du K. Li J. Zhong S. Fan C. Bi Z. Zhang Q. Chen J. Ma S. Zhang D. Head-to-head immunogenicity comparison of one-dose Cecolin and Gardasil in Chinese girls aged 9-14 years: A randomized and open-label clinical trial Vaccine 55 2025 127015 10.1016/j.vaccine.2025.127015 40120437 46 Goddard T.D. Huang C.C. Meng E.C. Pettersen E.F. Couch G.S. Morris J.H. Ferrin T.E. UCSF ChimeraX: Meeting modern challenges in visualization and analysis Protein Sci. 27 2018 14 25 10.1002/pro.3235 28710774 PMC5734306 47 Madeira F. Park Y.M. Lee J. Buso N. Gur T. Madhusoodanan N. Basutkar P. Tivey A.R.N. Potter S.C. Finn R.D. Lopez R. The EMBL-EBI search and sequence analysis tools APIs in 2019 Nucleic Acids Res. 47 2019 W636 W641 10.1093/nar/gkz268 30976793 PMC6602479 48 Stecher G. Tamura K. Kumar S. Molecular evolutionary genetics analysis (MEGA) for macOS Mol. Biol. Evol. 37 2020 1237 1239 10.1093/molbev/msz312 31904846 PMC7086165 49 Letunic I. Bork P. Interactive Tree Of Life (iTOL) v4: recent updates and new developments Nucleic Acids Res. 47 2019 W256 W259 10.1093/nar/gkz239 30931475 PMC6602468 50 Laemmli U.K. Beguin F. Gujer-Kellenberger G. A factor preventing the major head protein of bacteriophage T4 from random aggregation J. Mol. Biol. 47 1970 69 85 10.1016/0022-2836(70)90402-X 5413343 51 Yan X. Sinkovits R.S. Baker T.S. AUTO3DEM--an automated and high throughput program for image reconstruction of icosahedral particles J. Struct. Biol. 157 2007 73 82 17029842 10.1016/j.jsb.2006.08.007 PMC1847775 52 Grant T. Rohou A. Grigorieff N. cisTEM, user-friendly software for single-particle image processing eLife 7 2018 e35383 10.7554/eLife.35383 PMC5854467 29513216 53 Scheres S.H.W. Chen S. Prevention of overfitting in cryo-EM structure determination Nat. Methods 9 2012 853 854 10.1038/nmeth.2115 22842542 PMC4912033 54 Reed L. Muench H. A Simple Method for Estimating Fifty Percent Endpoints Am. J. Hyg. 27 1938 493 497 55 Schwarz H. Schmittner M. Duschl A. Horejs-Hoeck J. Residual endotoxin contaminations in recombinant proteins are sufficient to activate human CD1c+ dendritic cells PLoS One 9 2014 e113840 10.1371/journal.pone.0113840 PMC4257590 25478795 Supplemental information  Document S1. Figures S1 and S2 Supplemental information can be found online at https://doi.org/10.1016/j.isci.2025.113477 ",
  "metadata": {
    "Title of this paper": "Residual endotoxin contaminations in recombinant proteins are sufficient to activate human CD1c+ dendritic cells",
    "Journal it was published in:": "iScience",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12475572/"
  }
}