{
  "title": "Paper_777",
  "abstract": "pmc Stem Cell Res Ther Stem Cell Res Ther 1238 stemcellres Stem Cell Research & Therapy 1757-6512 BMC PMC12465784 PMC12465784.1 12465784 12465784 40999529 10.1186/s13287-025-04648-0 4648 1 Research NCAPH-YAP1 interaction promotes breast cancer stemness and tumor progression Qiu Caixin 1 2 Wei Yansha 3 Li Jiehua YFY002848@sr.gxmu.edu.cn 1 2 1 https://ror.org/030sc3x20 grid.412594.f 0000 0004 1757 2961 Department of Gastroenterology and Gland Surgery, The First Affiliated Hospital of Guangxi Medical University, 2 https://ror.org/03dveyr97 grid.256607.0 0000 0004 1798 2653 Guangxi Medical University, 3 https://ror.org/02aa8kj12 grid.410652.4 0000 0004 6003 7358 Department of Radiology, The People’s Hospital of Guangxi Zhuang Autonomous Region, 25 9 2025 2025 16 478640 494 31 3 2025 28 8 2025 25 09 2025 27 09 2025 27 09 2025 © The Author(s) 2025 2025 https://creativecommons.org/licenses/by-nc-nd/4.0/ Open Access http://creativecommons.org/licenses/by-nc-nd/4.0/ Rationale Breast cancer (BC) is the most prevalent malignant tumor in women globally. Despite improved cure rates and survival for early- to mid-stage patients, around 30% still progress to metastatic BC due to cancer stem cells (CSCs), which drive tumor recurrence, progression, metastasis, and drug resistance. Methods This study used bioinformatics to analyze BC datasets from gene expression omnibus (GEO), cBioportal, and The Cancer Genome Atlas (TCGA), identifying NCAPH as a gene associated with breast cancer stem cells (BCSCs) characteristics. The mRNA stemness index algorithm was used to calculate tumor stemness scores. WGCNA, Lasso regression, and Kaplan–Meier analyses validated the link between NCAPH and BC prognosis. In vitro and in vivo experiments explored NCAPH's effects on BC cells. Transcriptomic sequencing and Gene set enrichment analysis (GSEA) analysis revealed Hippo-YAP1 pathways regulated by NCAPH. Co-immunoprecipitation and immunofluorescence co-localization experiments confirmed the interaction between NCAPH and YAP1, with functional rescue experiments using the YAP1 inhibitor Verteporfin. Results Results showed NCAPH was overexpressed in BC, linked to advanced tumor stages and poor prognosis. It enhanced CSCs properties, accelerated cell cycle progression, and promoted proliferation, migration, and invasion in vitro and in vivo. GSEA analysis suggested NCAPH regulates YAP1 in the Hippo signaling pathway. NCAPH promotes LATS1 and YAP1 expression, dephosphorylation, and nuclear translocation, enhancing BCSC traits and malignant phenotypes. Notably, Verteporfin reversed NCAPH-driven BCSC traits and malignant phenotypes. Conclusion This study identifies NCAPH as a novel oncogenic factor in BC. NCAPH interacts with YAP1, promoting its nuclear translocation and enhancing BCSC traits and malignancy. Critically, YAP1 inhibition reverses NCAPH-driven effects, validating the NCAPH as a promising therapeutic target. Supplementary Information The online version contains supplementary material available at 10.1186/s13287-025-04648-0. Keywords NCAPH YAP1 Breast cancer Cancer stem cell http://dx.doi.org/10.13039/100012547 Natural Science Foundation of Guangxi Zhuang Autonomous Region NO.2023GXNSFAA026037 Li Jiehua pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement yes pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes issue-copyright-statement © BioMed Central Ltd., part of Springer Nature 2025 Introduction Breast cancer (BC) is the most prevalent malignant tumor among women worldwide [ 1 2 3 4 5 6 8 9 Given the pivotal role of CSCs in BC pathogenesis and treatment resistance, targeting genes associated with CSCs phenotypes has emerged as a critical strategy in BC treatment. The Non-SMC Condensin I Complex Subunit H (NCAPH), a vital component of the condensin complex, is involved in chromosomal stability, morphology, DNA damage repair, and mitotic dynamics in normal cells [ 10 11 12 13 14 The Hippo signaling pathway and its downstream effector YAP1 reveal critical insights into the interplay between stem cells, development, regeneration, and organ size regulation [ 15 17 15 17 18 19 18 20 21 Through integrated bioinformatics analysis and experimental validation, this study identifies NCAPH as a critical oncogenic regulator of BCSCs and a significant prognostic biomarker in BC. We demonstrate that NCAPH expression levels correlate with malignant progression and drive tumorigenic phenotypes. Crucially, our findings establish a novel mechanism wherein NCAPH physically interacts with YAP1 to promote BCSC properties and tumor progression. This NCAPH-YAP1 axis represents a promising therapeutic target to overcome CSC-mediated resistance and recurrence in BC. Methods The methodological workflow of this study is schematically depicted in Fig. 1 Fig. 1 Schematic workflow of the experimental methodology Bioinformatics analysis  Data Acquisition and Cohort Selection: Gene expression datasets GSE21653 GSE58812 GSE76124 GSE21653 GSE58812 GSE76124 CSC Scoring: The mRNA stemness index (mRNAsi) algorithm [ 22 Identification of mRNAsi-Associated Genes: Weighted Gene Co-expression Network Analysis (WGCNA) [ 23 Prognostic Gene Screening: The Metabric-TNBC dataset (n = 276) was obtained. Genes identified as associated with mRNAsi in the GEO-TNBC cohort were subjected to analysis within this independent cohort. Lasso regression analysis was employed to select genes predictive of survival outcomes. Subsequently, Kaplan–Meier survival analysis was performed to evaluate the association between the expression levels of these candidate genes and overall survival (OS)/disease-free survival (DFS). Expression and Clinical Correlation Analysis (TCGA-BRCA): The TCGA-BRCA dataset (n = 1231; comprising 1086 breast cancer tissues and 99 adjacent normal tissues) was utilized to assess NCAPH expression levels across breast cancer subtypes and normal tissue. Univariate logistic regression analysis was conducted to determine correlations between NCAPH expression and key clinical-pathological parameters. Results were visualized using forest plots. Supplementary Database Interrogation: Publicly available online databases were leveraged to further validate NCAPH expression patterns, assess its clinical relevance across broader BC populations, and confirm its prognostic significance. Clinical samples Tumor tissues from 32 BC patients and 21 paired non-tumor tissues were collected at the First Affiliated Hospital of Guangxi Medical University between April 1 and May 31, 2023. All patients were preoperatively diagnosed with BC via needle biopsy and underwent modified radical mastectomy or breast-conserving surgery. Postoperative pathology confirmed invasive breast carcinoma. Tumor tissues were immediately collected during surgery, and normal breast tissues were sampled at least 5 cm from the tumor margin. Samples were stored on ice and transferred to a − 80 °C freezer. All patients provided informed consent. This study and its protocols were approved by the Ethics Committee of the First Affiliated Hospital of Guangxi Medical University (Approval No.: 2025-E0145). Inclusion criteria: (1) No prior chemotherapy or radiotherapy before surgery; (2) Complete clinical data for newly diagnosed BC patients; (3) Willingness to participate and sign informed consent; (4) Absence of other malignancies or immune system disorders; (5) No severe dysfunction of vital organs (heart, liver, kidneys); and (6) No preoperative radiotherapy or chemotherapy. Exclusion criteria: (1) Occult BC, male BC, or metastatic disease at initial diagnosis; (2) Patients who underwent prior tumor excision with no residual cancer tissue; and (3) Patients who withdrew consent during the study period. RNA extraction and quantitative RT-PCR Total RNA was isolated from tissues or cells using RNA Extraction Solution (Solarbio, China) following chloroform phase separation, isopropanol precipitation, and ethanol washing. Reverse transcription was performed with 5 × PrimeScript RT Master Mix (Takara Bio, Japan) using up to 500 ng total RNA in 10 μl reactions (37 °C for 15 min; 85 °C for 5 s). Quantitative real-time PCR (qPCR) was conducted using TB Green Premix Ex Taq II (Takara Bio) in 20 μl reactions containing 0.8 μM of each primer (Genesys, China) and 2 μl cDNA template. Reactions were run in triplicate under the following conditions: 95 °C for 30 s; 40 cycles of 95 °C for 5 s and 60 °C for 34 s; melt curve analysis (95 °C → 60 °C → 95 °C). The relative expression of target genes was calculated using the 2 (−ΔΔCT) Primer sequences:NCAPH: F 5′-CTGATGGAAGTGCTACTGAAATGG-3′, R 5′-TCTGAAACATGGGATCAATCTCAC-3′; ACTB: F 5′-TCACCATGGATGATGATATCGC-3′, R 5′-CCACATAGGAATCCTTCTGACC-3′. Cell culture and culture conditions The human normal mammary epithelial cell line MCF-10A and BC cell lines (MCF7, MDA-MB-231, SK-BR-3, HCC1143, MDA-MB-468) were purchased from Wuhan Procell Life Technology Co., Ltd. (China). BC cell lines were cultured in DMEM medium supplemented with 10% fetal bovine serum (FBS) and 1% penicillin/streptomycin. MCF-10A cells were maintained in DMEM/F12 medium containing 20 ng/mL epidermal growth factor (EGF), hydrocortisone, insulin, non-essential amino acids (NEAA), 5% horse serum (HS), and 1% penicillin/streptomycin. All cells were incubated at 37 °C in a humidified atmosphere with 5% CO 2 Western blotting (WB) analysis Cell lysates were prepared with RIPA buffer (Beyotime, China) containing protease and phosphatase inhibitors. After the addition of RIPA buffer, the protein samples were lysed for 15 min. Subsequently, ultrasonication was applied to further lyse the proteins. Following protein lysis, the BCA method was used to determine protein concentration. After quantification, an appropriate amount of loading buffer was added to the protein samples, which were then mixed thoroughly. The protein mixtures were heated at 100 ℃ for 5 min. After heating, the proteins could be stored at – 80 ℃ for later use or immediately subjected to SDS-PAGE for protein electrophoresis. Equal amounts of protein were separated by SDS-PAGE and transferred to PVDF membranes. The membranes were incubated with primary antibodies overnight at 4℃. The next day, the PVDF membranes were taken out and washed three times with TBST, each time for 10 min. Then, the membranes were incubated with fluorescent secondary antibodies in the dark at room temperature for 1 h. After that, the PVDF membranes were removed and washed three times with TBST in the dark at room temperature, each time for 10 min. Finally, the membranes were imaged using an Amersham Typhoon™ laser scanner. The fluorescent secondary antibodies used were Multi-rAb™ CoraLite ® ® Plasmid extraction, lentiviral packaging, and stable cell line construction The process of packaging lentiviruses encoding YAP1-Flag (pLV3-CMV-YAP1(human)-3 × FLAG-NEO), NCAPH-Flag (pLV3-CMV-NCAPH(human)-3 × FLAG-CopGFP-Puro), shNCAPH (pLV3-U6-NCAPH(human)-shRNA1-CopGFP-Puro), empty vector control (pLV3-CMV-MCS-3 × FLAG-CopGFP-Puro), and control shRNA (pLV3-U6-MCS-shRNA-CopGFP-Puro) began with plasmid extraction. The packaging plasmids (psPAX2 and PMD2.G), along with the target plasmids (YAP1-Flag, NCAPH-Flag, shNCAPH, empty vector, and control shRNA), were designed and synthesized by Miaoling Biotechnology (China). Glycerol stocks of plasmid-containing E. coli were streaked onto LB agar plates. Single colonies were then picked and cultured overnight in LB liquid medium at 37 °C with shaking. Subsequently, plasmids were purified using standard extraction protocols. Lentiviral packaging was carried out by transfecting HEK293T cells with a plasmid mixture at a ratio of 4:3:1 (target plasmid: psPAX2: PMD2.G) using Lipo293 (Beyotime, China). Viral supernatants were collected at 48 h and 72 h post-transfection, concentrated through ultracentrifugation, and used to transduce target cells (SK-BR-3 and MDA-MB-231) seeded in 6-well plates. Stable cell lines were generated by transducing SK-BR-3 and MDA-MB-231 cells with NCAPH/YAP1 overexpression lentivirus, empty vector control, NCAPH shRNA, or control shRNA. At 24 h post-transduction, cells were selected with 4 μg/mL puromycin (Meilun Bio, China) or 850 μg/mL G418 (Meilun Bio, China) for 2 weeks. Stable clones were maintained in medium containing 0.2 μg/mL puromycin or 8 μg/mL G418. Successful overexpression or knockdown of NCAPH/YAP1 was confirmed by WB. Tumor sphere formation assay Investigation into the impact of NCAPH overexpression or knockdown on the stemness of BC cells was conducted via a tumor sphere formation assay. Tumor stem cell culture medium was prepared by supplementing DMEM with 1 × B27, 20 ng/mL EGF, and 20 ng/mL bFGF. SK-BR-3 and MDA-MB-231 cells were seeded in ultra-low attachment 6-well plates at densities of 5000 and 10,000 cells per well, respectively. Each well was filled with 4 mL of the tumor stem cell medium. Tumor sphere formation was monitored under a microscope every 2–3 days. Once spheres reached approximately 50 μm in diameter, images of five randomly selected fields per well were captured for quantification. The number of spheres in each field was counted to evaluate stem cell-like properties. Cell cycle analysis by flow cytometry The effects of NCAPH overexpression or knockdown on BC cell cycle progression were analyzed using flow cytometry. Cells from the NCAPH overexpression group (NCAPH), empty vector control group (EV), NCAPH knockdown group (shNCAPH), and negative control group (NC) were collected and fixed in 75% ethanol at 4 °C for at least 1 h. Following fixation, cells were stained with PI/RNase staining buffer (Meilun, China) at 37 °C for 30 min in the dark. Cell cycle distribution (G0/G1, S, and G2/M phases) was analyzed using a BD FACSArray™ flow cytometer (BD Biosciences, USA). The Cell Cycle Detection Kit was obtained from Meilun Biotechnology (Dalian, China). Cell proliferation assay (CCK-8) The effects of NCAPH on cell proliferation were evaluated using a CCK-8 assay. MDA-MB-231 and SK-BR-3 cell lines with stably NCAPH overexpression or knockdown were seeded into 96-well plates at densities of 5000 and 2000 cells per well, respectively. Following a 12-h adhesion period, cell proliferation was measured at 24-h intervals over a 96-h timeframe using a CCK-8 kit (Meilun Biotechnology, China) according to the manufacturer’s protocol. Absorbance at 450 nm was recorded using a microplate reader (Tecan, Swiss) to quantify viable cells. Colony formation assay The effects of NCAPH on cell growth were evaluated using a colony formation assay. Briefly, stably NCAPH-overexpression or knockdown BC cells were plated into 6-well plates at a density of 1,000 cells per well. After culturing for 14 days, colonies were fixed with 4% paraformaldehyde for 10 min and stained with 0.1% crystal violet (Beyotime Biotechnology, Shanghai, China) for 15 min. Visible colonies were counted manually under a light microscope. Wound healing, transwell migration, and invasion assays In the wound healing assay, 4 × 10 5 For the transwell migration assay, the upper chambers of 24-well Transwell inserts (8 μm pore size; JET BIOFIL, China) were seeded with 2 × 10 4 The transwell invasion assay was performed following the same protocol as the migration assay, with the exception that the upper chambers were pre-coated with 50 μL Matrigel (Corning, USA; diluted 1:8 in serum-free medium) and allowed to polymerize at 37 °C for 4 h. Invaded cells were quantified in the same manner as described above. RNA sequencing and gene set enrichment analysis (GSEA) Total RNA was isolated from NCAPH-overexpression and control MDA-MB-231 cells using TRIzol. Three biological replicates per group were sequenced (Illumina NovaSeq 6000, 150 bp paired-end) after quality verification (RIN > 7.0, NanoDrop and Agilent Bioanalyzer). Libraries were prepared with the NEBNext Ultra RNA Library Prep Kit.Raw reads were processed with Trimmomatic (adapter/low-quality removal) and aligned to GRCh38 using STAR. Differentially expressed genes (DEGs, p < 0.05, DESeq2) were functionally annotated via Kyoto Encyclopedia of Genes and Genomes (KEGG) and GSEA. Immunofluorescence (IF) staining Cells were seeded onto coverslips the day before the experiment. The next day, the coverslips were removed from the incubator and rinsed quickly three times with PBS. Then, the cells were fixed with 4% paraformaldehyde for 15 min at room temperature (RT). After fixation, the cells were washed three times with PBS, each for 3 min. Then, they were permeabilized with 0.2% Triton X-100 for 10 min and washed again three times with PBS, each for 3 min. Subsequently, the cells were blocked with 5% bovine serum albumin (BSA) in PBS for 1 h and then washed three times with PBS, each for 3 min. Next, the cells were incubated with primary antibodies against NCAPH (1:100 dilution; Cat# 67,655–1-Ig, Proteintech, USA) and YAP1 (1:100 dilution; Cat# 13,584–1-AP, Proteintech) at 4 °C overnight. The next day, the cells were taken out and washed three times with 1 × TBST, each for 3 min. Then, they were incubated with Alexa Fluor 488- or 594-conjugated secondary antibodies (1:500 dilution; Beyotime, China) for 1 h at RT in the dark. After that, the cells were washed three times with TBST, each for 3 min. Then, the cell nuclei were stained with DAPI (1 μg/mL; Beyotime, China) for 10 min, followed by three more washes with TBST, each for 3 min. Finally, the coverslips were mounted onto slides using an anti-fade mounting medium. Fluorescence images were captured using a Zeiss confocal microscope (Carl Zeiss, Germany) and analyzed with ZEN 3.0 software. Co-immunoprecipitation (Co-IP) The interaction between NCAPH and YAP1 was verified by Co-IP using Flag-tagged stable NCAPH or YAP1 overexpression BC cell lines. Cell lysis: BC cells (grown to 90% confluency in 10-cm dishes) were washed with PBS, lysed in 1 mL NP-40 lysis buffer containing 20 μL protease inhibitor cocktail, and then lysed on ice for 30 min. After lysis, the cell lysates were centrifuged at 12,000 rpm (4 ℃, 5 min) to collect the supernatants. Beads preparation: Flag magnetic beads were pre-washed with PBST two times. Immunoprecipitation: For the IP group, 400 μL of supernatant was incubated with 20 μL of Flag beads. For the IgG control group, 400 μL of supernatant was incubated with mouse or rabbit IgG. Both mixtures were rotated overnight at 4 °C. Washing: Beads were washed 5 times with PBST. Elution: Beads were resuspended in 50 μL of 1 × loading buffer, boiled at 100 °C for 10 min, and stored at − 80 °C for subsequent WB analysis. Nuclear and cytoplasmic fractionation Cells were washed twice with pre-cooled PBS (4 °C) and harvested using a cell scraper. The cell suspension was transferred to a 1.5 mL microcentrifuge tube and centrifuged at 8000 × g g Animal studies The NCAPH overexpression and empty vector control SK-BR-3 cells were harvested, counted, and resuspended in PBS. The cells (5 × 10⁶ cells/100 μl) were transplanted into the right axilla of 5-week-old male BALB/c nude mice (16–18 g, Experimental Animal Center of Guangxi Medical University). Mice were randomly assigned to NCAPH or control groups (4 mice/group) using a lottery method: each mouse was labeled with a unique number (1–8), and group allocation was determined by drawing labeled lots from a sealed container to eliminate selection bias. Two cages (4 mice/cage) were used in this experiment. Mice were housed under specific pathogen-free (SPF) conditions with controlled temperature (22 ± 1 °C), humidity (50 ± 10%), and a 12 h light/dark cycle. Tumor growth was monitored every 3 days. The experiment was terminated when tumors reached a maximum diameter of 1.5 cm to comply with humane endpoints. At the experimental endpoint, mice were anesthetized via intraperitoneal injection of pentobarbital sodium (40 mg/kg, 1% solution dissolved in sterile physiological saline). Anesthesia depth was confirmed by loss of corneal reflex and absence of pedal withdrawal response to toe pinch. Surgical procedures commenced within 5 min post-injection. Tumors were surgically excised using sterile scissors and forceps, immediately weighed on an analytical balance (0.1 mg precision), and measured with a vernier caliper. Tumor length (L) and width (W) were recorded. Tumor volume = (L × W 2 All procedures were approved by the Medical Ethics Committee of the First Affiliated Hospital of Guangxi Medical University (Approval No. 2024-D179-01) and conducted in accordance with the ARRIVE 2.0 guidelines. Statistical analysis Each experiment included at least three biological replicates. All data were represented as mean ± standard deviation (SD). Statistical analyses were performed using GraphPad Prism version 9.0 and R version 4.4.3. Differences in mRNA expression between breast cancer tissues and adjacent breast tissue were determined by Mann–Whitney U test. Comparisons between two independent groups were performed using an unpaired two-tailed Student’s t-test. Comparisons among multiple groups were performed using one-way analysis of variance (ANOVA). P-values were calculated using the built-in statistical functions of the software. A P value < 0.05 was considered statistically significant. Results NCAPH is identified as a BCSC-associated gene influencing BC prognosis and is aberrantly overexpressed in BC Through mRNAsi-based stemness scoring of 392 TNBC samples from GEO datasets, WGCNA revealed that the turquoise module (MEturquoise) exhibited the highest correlation with tumor stemness (r = 0.86; Fig. 2 2 2 1 2 2 i 2 Fig. 2 NCAPH was identified through bioinformatics screening and experimentally validated as a differentially expressed gene. A E F G H I J K L M N O P Q Table 1 LASSO regression analysis identified genes contributing to OS Gene Coef. NCAPH 0.553966455034336 CDCA8 0.0992384210802551 TPX2 0.319379231877878 STIL 0.0477559135973922 NEK2 − 0.128994116282922 RAD51AP1 − 0.054591990122920 PTTG1 − 0.007781865281420 CCNA2 − 0.223134290364381 EZH2 − 0.297720348965471 CDC20 0.100655338549239 FOXM1 − 0.067757866008100 Table 2 LASSO regression analysis identified genes contributing to DFS Gene Coef. NCAPH 0.177936210317881 TPX2 0.0640759005993625 Univariate logistic regression using TCGA-BRCA data (n = 1,231) demonstrated that elevated NCAPH expression was significantly associated with TNBC subtype, higher pT stage, patients < 40 years old, advanced pathological stage (pStage), and invasive ductal carcinoma (Fig. 2 2 2 2 2 Experimental validation by qPCR in 32 breast tumors and 21 adjacent tissues showed that NCAPH mRNA levels were 2.046-fold higher in tumors (Fig. 2 2 NCAPH promotes cancer stem cell properties in BC cells Stable overexpression and knockdown of NCAPH in SK-BR-3 and MDA-MB-231 cell lines were validated by WB and elevated NCAPH expression in tumor spheres was confirmed (Fig. 3 3 3 Fig. 3 Validation of stable NCAPH knockdown/overexpression in BC cell lines and its effects on CSC properties. A B C NCAPH promotes the acceleration of the BC cell cycle Single-gene GSEA of NCAPH in TCGA-BRCA revealed significant enrichment in cell cycle-related pathways (Fig. 4 4 4 4 E Fig. 4 Effects of NCAPH on the cell cycle in BC cell lines. A B C D E NCAPH promotes BC proliferation in vitro and in vivo CCK-8 assays demonstrated that NCAPH overexpression significantly accelerated the proliferation of SK-BR-3 and MDA-MB-231 cells, whereas NCAPH knockdown suppressed cell growth (Fig. 5 Fig. 5 Effects of NCAPH on BC cell proliferation in vivo and in vitro. A B C Colony formation assays confirmed that NCAPH knockdown markedly impaired clonogenicity, while NCAPH overexpression enhanced colony-forming capacity (Fig. 5 In Vivo xenograft studies validated NCAPH's oncogenic role. Tumors derived from NCAPH-overexpressing cells exhibited significantly larger volumes and heavier weights compared to the negative control group (Fig. 5 NCAPH enhances migration and invasion capacities of BC cells Wound healing assays demonstrated that NCAPH knockdown significantly impaired migration in SK-BR-3 and MDA-MB-231 cells, while overexpression enhanced migration (Fig. 6 Fig. 6 Effects of NCAPH on migration and invasion in BC cell lines. A B Furthermore, Transwell migration and invasion assays revealed that NCAPH knockdown reduced both migration and invasion capabilities in SK-BR-3 and MDA-MB-231 cells. Conversely, NCAPH overexpression promoted increases in migration and invasion (Fig. 6 Transcriptome sequencing identifies YAP1 as a downstream pathway of NCAPH Transcriptome sequencing was performed on MDA-MB-231 cells overexpressing NCAPH (NCAPH group) and empty vector controls (EV group). A heatmap of the top 50 differentially expressed genes (DEGs) between the two groups is shown in Fig. 7 7 7 Fig. 7 Transcriptome sequencing analysis of BC cell lines after NCAPH overexpression. A B C D Using the HitPredict database, we identified YAP1—a core effector of the Hippo pathway—as a predicted interaction partner of NCAPH (Table 3 7 Table 3 HitPredict database-predicted proteins interacting with NCAPH Name Method score Annotation score interaction score Confidence CND3 0.95 1 0.972 High SMC2 0.91 1 0.952 High CND1 0.87 1 0.934 High SMC4 0.86 1 0.927 High ARC1A 0.74 0.6 0.667 High G137B 0.74 0.55 0.638 High STAU1 0.62 0.6 0.611 High DPEP1 0.66 0.55 0.602 High FZD10 0.66 0.55 0.602 High TERA 0.62 0.55 0.585 High EID3 0.62 0.55 0.585 High YAP1 0.57 0.6 0.584 High NCAPH promotes YAP1 expression and interacts with YAP1 to facilitate its nuclear translocation and pro-tumorigenic functions WB analysis validated NCAPH-mediated regulation of LATS1 and YAP1 protein levels. In breast cancer cells, NCAPH overexpression significantly increased LATS1 and total YAP1 while reducing phosphorylated YAP1. Conversely, NCAPH knockdown decreased both LATS1 and total YAP1 as well as p-YAP1 (Fig. 8 Fig. 8 NCAPH interacts with YAP1 and promotes YAP1 expression and nuclear translocation. A B C D Nuclear-cytoplasmic fractionation demonstrated NCAPH overexpression enhanced nuclear accumulation of YAP1, with concomitant reduction in cytoplasmic YAP1 (Fig. 8 Based on HitPredict’s predicted interaction, immunofluorescence revealed strong nuclear co-localization of NCAPH and YAP1 (Fig. 8 8 NCAPH promotes YAP1-mediated oncogenesis through a multi-step regulatory cascade: upregulating YAP1 expression, facilitating its dephosphorylation and enhancing nuclear translocation. The pro-tumorigenic effects of NCAPH are reversed by the YAP1 inhibitor verteporfin We assessed YAP1's functional contribution to NCAPH-mediated malignancy by treating NCAPH-overexpressing SK-BR-3 cells with the YAP1 inhibitor Verteporfin (VP). Comparative analyses were performed across three groups: empty vector control (EV), NCAPH overexpression (NCAPH), and NCAPH overexpression + VP (NCAPH + VP). Results demonstrated that VP inhibited YAP1 expression and reversed NCAPH-induced tumorsphere formation (Fig. 9 9 9 9 9 Fig. 9 The YAP1 inhibitor Verteporfin reverses NCAPH overexpression-induced enhancement of CSC properties, proliferation, migration, and invasion in BC cells. A B C D E Discussion The findings of this study reveal the mechanism by which NCAPH influences BCSC phenotypes. Specifically, NCAPH upregulates LATS1 expression and interacts with YAP1, which collectively promotes YAP1 overexpression and nuclear translocation, thereby driving BCSC properties and BC progression. CSCs play a central role in tumor heterogeneity and malignant progression. Through bioinformatics analysis, we identified NCAPH as a BCSC regulator, a role previously unreported in BC. Existing studies have shown that NCAPH is aberrantly overexpressed in multiple malignancies [ 11 24 12 13 25 26 Drug resistance is a hallmark phenotype of CSCs. Shimomura et al. [ 27 28 CSCs additionally exhibit characteristics of EMT. During EMT, epithelial cells lose key epithelial markers, transform into cells expressing mesenchymal markers, and acquire enhanced migratory and invasive capacities, anti-apoptotic ability, and extracellular matrix degradation properties [ 29 30 31 32 As a subunit of the condensin complex, NCAPH directly participates in chromosomal condensation during the cell cycle. Studies indicate that NCAPH promotes tumor cell mitosis, thereby accelerating tumor proliferation. In pancreatic cancer, NCAPH knockdown leads to significant upregulation of cyclin A and phosphorylated histone H3 (Ser10), resulting in failure of mature chromosome condensation, cell cycle arrest in the S and G2/M phases, and marked suppression of pancreatic cancer cell proliferation [ 33 31 12 12 34 36 13 37 39 40 In order to explore the mechanism underlying NCAPH’s oncogenic role, transcriptome sequencing and pathway analyses (KEGG, GSEA) revealed enrichment of Hippo signaling-related genes. HitPredict database analysis predicted an interaction between NCAPH and YAP1, a core Hippo pathway effector. YAP1 integrates mechanical, metabolic, and signaling cues to regulate development, tissue homeostasis, fibrosis, inflammation, and tumorigenesis [ 15 41 42 43 44 45 46 47 Due to the pivotal role of YAP1 in the pathogenesis and progression of breast cancer, YAP1-targeted therapy has emerged as a promising approach. However, YAP1 is also essential for normal tissue development and regeneration. Consequently, therapies solely targeting YAP1 may incur significant toxic side effects [ 41 48 49 50 Verteporfin, an FDA-approved compound for treating macular degeneration, was the first drug identified to block the interaction between YAP1 and TEAD. It inhibits the growth and metastasis of breast cancer in vitro and in vivo [ 51 Like Verteporfin, numerous other compounds—such as CA3 and CPD3.1 [ 52 54 55 56 57 58 59 60 NCT04665206 NCT06566079 NCT06251310 NCT05228015 61 Numerous studies highlight the involvement of the Hippo-YAP1 pathway in regulating breast cancer progression. Concurrently, a growing number of upstream regulators of this pathway are being identified. Targeting these upstream regulators to suppress YAP1 activity therefore constitutes a promising therapeutic approach [ 48 49 These findings position NCAPH as a promising therapeutic target for disrupting CSC dynamics in BC, offering potential clinical benefits for patients. Our study elucidates the molecular mechanisms through which NCAPH functions as a tumor promoter in BC, revealing its previously unrecognized role in regulating CSC properties, cell cycle progression, and Hippo-YAP1 signaling. This work establishes a foundational framework for developing NCAPH-targeted therapies to combat BC aggressiveness and therapeutic resistance. Conclusion Our integrated findings demonstrate that NCAPH levels strongly correlate with the CSCs phenotype, proliferative capacity, and metastatic potential of BC cells. This association coincides with NCAPH’s interaction with YAP1 and increased nuclear translocation of YAP1, suggesting that the NCAPH-YAP1 axis may play a key role in sustaining oncogenic activity. These insights identify NCAPH as a novel and promising oncogenic factor in BC pathogenesis, meriting investigation as a therapeutic target. While our study delineates this association and proposes a YAP1-dependent pathway, direct causal links and the precise molecular mechanisms require further validation. Moreover, the broader functional landscape of NCAPH—including its potential involvement in metabolic reprogramming, immune evasion, or therapy-induced senescence—remains to be fully elucidated. Future investigations aimed at causally validating this pathway and exploring the pan-cancer regulatory networks orchestrated by NCAPH will be crucial for informing comprehensive therapeutic strategies. Supplementary Information  Additional file 1. Additional file 2. Additional file 3. Additional file 4. Additional file 5. Additional file 6. Additional file 7. Additional file 8. Publisher's Note Springer Nature remains neutral with regard to jurisdictional claims in published maps and institutional affiliations. Caixin Qiu and Yansha Wei have contributed equally to this work. Acknowledgements The authors gratefully acknowledge TCY, ZZX, ZP, LJF and HRZ for their valuable assistance during the experimental process. Author contributions Caixin Qiu played a pivotal role in the development of this manuscript, contributing significantly through the conception and design of the study, the acquisition and assembly of data, and the initial drafting of the article. Yansha Wei was instrumental in the creation of this article, participating actively in the study's design, data collection, and manuscript preparation. Jiehua Li contributed extensively to this paper, engaging in the initial design of the research, gathering and analyzing the data, and contributing to the drafting process. Funding This study was supported by Guangxi Natural Science Foundation (NO.2023GXNSFAA026037). Data availability The raw sequence data reported in this paper have been deposited in the Genome Sequence Archive in National Genomics Data Center, China National Center for Bioinformation / Beijing Institute of Genomics, Chinese Academy of Sciences (GSA-Human: HRA010836) that are publicly accessible at https://ngdc.cncb.ac.cn/gsa-human Declarations Ethics approval and consent to participate This study was conducted in accordance with the Declaration of Helsinki and received ethical approval from the Medical Ethics Committee of First Affiliated Hospital of Guangxi Medical University (Approval No. 2025-E0145). Written informed consent was obtained from all individual participants prior to their inclusion in the study. (1) Title of the approved project: NCAPH-YAP1 Interaction Promotes Breast Cancer Stemness and Tumor Progression; (2) Name of the institutional approval committee: Medical Ethics Committee of First Affiliated Hospital of Guangxi Medical University; (3) Approval number: 2025-E0145; (4) Date of approval: February 28, 2025. The animal experiments conducted under the protocol titled ​​\"NCAPH-YAP1 Interaction Promotes Breast Cancer Stemness and Tumor Progression\"​​ were approved by ​the Medical Ethics Committee of the First Affiliated Hospital of Guangxi Medical University​ (Approval No. 2024-D179-01; Date: June 1, 2024). All procedures adhered to the ​AVMA Guidelines for the Euthanasia of Animals (2020)​​ and complied with institutional and national standards for animal welfare. We had institutional approval for performing experiments using human cells. MCF10A, MCF7, MDA-MB-231, SK-BR-3, HCC1143 and MDA-MB-468 were obtained from Procell Life Science&Tech (Wuhan, China). Procell Life Science&Tech Company has confirmed that there was initial ethical approval for collection of human cells, and that the donors had signed informed consent. Artificial intelligence (AI) The authors declare that they have not use AI-generated work in this manuscript. Consent to publication Not applicable. Competing interests The authors declare that they have no competing interests. References 1. Giaquinto AN Sung H Newman LA Freedman RA Smith RA Star J Breast cancer statistics 2024 CA Cancer J Clin 2024 74 477 495 39352042 10.3322/caac.21863 Giaquinto AN, Sung H, Newman LA, Freedman RA, Smith RA, Star J, et al. Breast cancer statistics 2024. CA Cancer J Clin. 2024;74:477–95. 39352042 10.3322/caac.21863 2. Han B Zheng R Zeng H Wang S Sun K Chen R Cancer incidence and mortality in China, 2022 J Natl Cancer Cent 2024 4 47 53 39036382 10.1016/j.jncc.2024.01.006 PMC11256708 Han B, Zheng R, Zeng H, Wang S, Sun K, Chen R, et al. Cancer incidence and mortality in China, 2022. J Natl Cancer Cent. 2024;4:47–53. 39036382 10.1016/j.jncc.2024.01.006 PMC11256708 3. Riggio AI Varley KE Welm AL The lingering mysteries of metastatic recurrence in breast cancer Br J Cancer 2021 124 13 26 10.1038/s41416-020-01161-4 33239679 PMC7782773 Riggio AI, Varley KE, Welm AL. The lingering mysteries of metastatic recurrence in breast cancer. Br J Cancer. 2021;124:13–26. 33239679 10.1038/s41416-020-01161-4 PMC7782773 4. Wang R Zhu Y Liu X Liao X He J Niu L The clinicopathological features and survival outcomes of patients with different metastatic sites in stage IV breast cancer BMC Cancer 2019 19 1091 10.1186/s12885-019-6311-z 31718602 PMC6852913 Wang R, Zhu Y, Liu X, Liao X, He J, Niu L. The clinicopathological features and survival outcomes of patients with different metastatic sites in stage IV breast cancer. BMC Cancer. 2019;19:1091. 31718602 10.1186/s12885-019-6311-z PMC6852913 5. Lee KL Kuo YC Ho YS Huang YH Triple-negative breast cancer: current understanding and future therapeutic breakthrough targeting cancer stemness Cancers (Basel) 2019 10.3390/cancers11091334 31505803 PMC6769912 Lee KL, Kuo YC, Ho YS, Huang YH. Triple-negative breast cancer: current understanding and future therapeutic breakthrough targeting cancer stemness. Cancers (Basel). 2019. 10.3390/cancers11091334. 31505803 10.3390/cancers11091334 PMC6769912 6. Ricardo S Vieira AF Gerhard R Leitão D Pinto R Cameselle-Teijeiro JF Breast cancer stem cell markers CD44, CD24 and ALDH1: expression distribution within intrinsic molecular subtype J Clin Pathol 2011 64 937 946 10.1136/jcp.2011.090456 21680574 Ricardo S, Vieira AF, Gerhard R, Leitão D, Pinto R, Cameselle-Teijeiro JF, et al. Breast cancer stem cell markers CD44, CD24 and ALDH1: expression distribution within intrinsic molecular subtype. J Clin Pathol. 2011;64:937–46. 21680574 10.1136/jcp.2011.090456 7. Rabinovich I Sebastião APM Lima RS Urban CA Junior ES Anselmi KF Cancer stem cell markers ALDH1 and CD44+/CD24- phenotype and their prognosis impact in invasive ductal carcinoma Eur J Histochem 2018 62 2943 30362671 10.4081/ejh.2018.2943 PMC6240790 Rabinovich I, Sebastião APM, Lima RS, Urban CA, Junior ES, Anselmi KF, et al. Cancer stem cell markers ALDH1 and CD44+/CD24- phenotype and their prognosis impact in invasive ductal carcinoma. Eur J Histochem. 2018;62:2943. 30362671 10.4081/ejh.2018.2943 PMC6240790 8. Albini A Bruno A Gallo C Pajardi G Noonan DM Dallaglio K Cancer stem cells and the tumor microenvironment: interplay in tumor heterogeneity Connect Tissue Res 2015 56 414 425 10.3109/03008207.2015.1066780 26291921 PMC4673538 Albini A, Bruno A, Gallo C, Pajardi G, Noonan DM, Dallaglio K. Cancer stem cells and the tumor microenvironment: interplay in tumor heterogeneity. Connect Tissue Res. 2015;56:414–25. 26291921 10.3109/03008207.2015.1066780 PMC4673538 9. Al-Hajj M Wicha MS Benito-Hernandez A Morrison SJ Clarke MF Prospective identification of tumorigenic breast cancer cells Proc Natl Acad Sci USA 2003 100 3983 3988 10.1073/pnas.0530291100 12629218 PMC153034 Al-Hajj M, Wicha MS, Benito-Hernandez A, Morrison SJ, Clarke MF. Prospective identification of tumorigenic breast cancer cells. Proc Natl Acad Sci USA. 2003;100:3983–8. 12629218 10.1073/pnas.0530291100 PMC153034 10. Watrin E Legagneux V Contribution of hCAP-D2, a non-SMC subunit of condensin I, to chromosome and chromosomal protein dynamics during mitosis Mol Cell Biol 2005 25 740 750 10.1128/MCB.25.2.740-750.2005 15632074 PMC543417 Watrin E, Legagneux V. Contribution of hCAP-D2, a non-SMC subunit of condensin I, to chromosome and chromosomal protein dynamics during mitosis. Mol Cell Biol. 2005;25:740–50. 15632074 10.1128/MCB.25.2.740-750.2005 PMC543417 11. Liu C Han X Zhang S Huang M Guo B Zhao Z The role of NCAPH in cancer treatment Cell Signal 2024 121 111262 10.1016/j.cellsig.2024.111262 38901722 Liu C, Han X, Zhang S, Huang M, Guo B, Zhao Z, et al. The role of NCAPH in cancer treatment. Cell Signal. 2024;121:111262. 38901722 10.1016/j.cellsig.2024.111262 12. Xiong Q Jiang L Liu K Jiang X Liu B Shi Y MiR-133b targets NCAPH to promote β-catenin degradation and reduce cancer stem cell maintenance in non-small cell lung cancer Signal Transduct Target Ther 2021 6 252 10.1038/s41392-021-00555-x 34230450 PMC8260594 Xiong Q, Jiang L, Liu K, Jiang X, Liu B, Shi Y, et al. MiR-133b targets NCAPH to promote β-catenin degradation and reduce cancer stem cell maintenance in non-small cell lung cancer. Signal Transduct Target Ther. 2021;6:252. 34230450 10.1038/s41392-021-00555-x PMC8260594 13. Lei Y Wang D Chen W Tian X Wei J FOXM1/NCAPH activates glycolysis to promote colon adenocarcinoma stemness and 5-FU resistance Anticancer Drugs 2023 34 929 938 10.1097/CAD.0000000000001526 37260271 Lei Y, Wang D, Chen W, Tian X, Wei J. FOXM1/NCAPH activates glycolysis to promote colon adenocarcinoma stemness and 5-FU resistance. Anticancer Drugs. 2023;34:929–38. 37260271 10.1097/CAD.0000000000001526 14. Mendiburu-Eliçabe M García-Sancha N Corchado-Cobos R Martínez-López A Chang H Hua Mao J NCAPH drives breast cancer progression and identifies a gene signature that predicts luminal a tumour recurrence Clin Transl Med 2024 14 e1554 10.1002/ctm2.1554 38344872 PMC10859882 Mendiburu-Eliçabe M, García-Sancha N, Corchado-Cobos R, Martínez-López A, Chang H, Hua Mao J, et al. NCAPH drives breast cancer progression and identifies a gene signature that predicts luminal a tumour recurrence. Clin Transl Med. 2024;14:e1554. 38344872 10.1002/ctm2.1554 PMC10859882 15. Zheng Y Pan D The hippo signaling pathway in development and disease Dev Cell 2019 50 264 282 10.1016/j.devcel.2019.06.003 31386861 PMC6748048 Zheng Y, Pan D. The hippo signaling pathway in development and disease. Dev Cell. 2019;50:264–82. 31386861 10.1016/j.devcel.2019.06.003 PMC6748048 16. Totaro A Panciera T Piccolo S YAP/TAZ upstream signals and downstream responses Nat Cell Biol 2018 20 888 899 10.1038/s41556-018-0142-z 30050119 PMC6186418 Totaro A, Panciera T, Piccolo S. YAP/TAZ upstream signals and downstream responses. Nat Cell Biol. 2018;20:888–99. 30050119 10.1038/s41556-018-0142-z PMC6186418 17. Ma S Meng Z Chen R Guan KL The hippo pathway: biology and pathophysiology Annu Rev Biochem 2019 88 577 604 10.1146/annurev-biochem-013118-111829 30566373 Ma S, Meng Z, Chen R, Guan KL. The hippo pathway: biology and pathophysiology. Annu Rev Biochem. 2019;88:577–604. 30566373 10.1146/annurev-biochem-013118-111829 18. Dong J Feldmann G Huang J Wu S Zhang N Comerford SA Elucidation of a universal size-control mechanism in Drosophila Cell 2007 130 1120 1133 10.1016/j.cell.2007.07.019 17889654 PMC2666353 Dong J, Feldmann G, Huang J, Wu S, Zhang N, Comerford SA, et al. Elucidation of a universal size-control mechanism in Drosophila 17889654 10.1016/j.cell.2007.07.019 PMC2666353 19. Zhao B Li L Tumaneng K Wang CY Guan KL A coordinated phosphorylation by Lats and CK1 regulates YAP stability through SCF(beta-TRCP) Genes Dev 2010 24 72 85 10.1101/gad.1843810 20048001 PMC2802193 Zhao B, Li L, Tumaneng K, Wang CY, Guan KL. A coordinated phosphorylation by Lats and CK1 regulates YAP stability through SCF(beta-TRCP). Genes Dev. 2010;24:72–85. 20048001 10.1101/gad.1843810 PMC2802193 20. Sun HL Men JR Liu HY Liu MY Zhang HS FOXM1 facilitates breast cancer cell stemness and migration in YAP1-dependent manner Arch Biochem Biophys 2020 685 108349 10.1016/j.abb.2020.108349 32209309 Sun HL, Men JR, Liu HY, Liu MY, Zhang HS. FOXM1 facilitates breast cancer cell stemness and migration in YAP1-dependent manner. Arch Biochem Biophys. 2020;685:108349. 32209309 10.1016/j.abb.2020.108349 21. Kulkarni M Tan TZ Syed Sulaiman NB Lamar JM Bansal P Cui J RUNX1 and RUNX3 protect against YAP-mediated EMT, stem-ness and shorter survival outcomes in breast cancer Oncotarget 2018 9 14175 14192 10.18632/oncotarget.24419 29581836 PMC5865662 Kulkarni M, Tan TZ, Syed Sulaiman NB, Lamar JM, Bansal P, Cui J, et al. RUNX1 and RUNX3 protect against YAP-mediated EMT, stem-ness and shorter survival outcomes in breast cancer. Oncotarget. 2018;9:14175–92. 29581836 10.18632/oncotarget.24419 PMC5865662 22. Malta TM Sokolov A Gentles AJ Burzykowski T Poisson L Weinstein JN Machine learning identifies stemness features associated with oncogenic dedifferentiation Cell 2018 173 338 54.e15 10.1016/j.cell.2018.03.034 29625051 PMC5902191 Malta TM, Sokolov A, Gentles AJ, Burzykowski T, Poisson L, Weinstein JN, et al. Machine learning identifies stemness features associated with oncogenic dedifferentiation. Cell. 2018;173:338-54.e15. 29625051 10.1016/j.cell.2018.03.034 PMC5902191 23. Langfelder P Horvath S WGCNA: an R package for weighted correlation network analysis BMC Bioinformatics 2008 9 559 10.1186/1471-2105-9-559 19114008 PMC2631488 Langfelder P, Horvath S. WGCNA: an R package for weighted correlation network analysis. BMC Bioinformatics. 2008;9:559. 19114008 10.1186/1471-2105-9-559 PMC2631488 24. Liu Y Ma X Feng L Lin Z Zhou X An integrative pan-cancer analysis reveals the carcinogenic effects of NCAPH in human cancer Math Biosci Eng 2023 20 76 92 10.3934/mbe.2023005 36650758 Liu Y, Ma X, Feng L, Lin Z, Zhou X. An integrative pan-cancer analysis reveals the carcinogenic effects of NCAPH in human cancer. Math Biosci Eng. 2023;20:76–92. 36650758 10.3934/mbe.2023005 25. Xia X Li Y Comprehensive analysis of transcriptome data stemness indices identifies key genes for controlling cancer stem cell characteristics in gastric cancer Transl Cancer Res 2020 9 6050 6061 10.21037/tcr-20-704 35117216 PMC8797465 Xia X, Li Y. Comprehensive analysis of transcriptome data stemness indices identifies key genes for controlling cancer stem cell characteristics in gastric cancer. Transl Cancer Res. 2020;9:6050–61. 35117216 10.21037/tcr-20-704 PMC8797465 26. Huang C Hu CG Ning ZK Huang J Zhu ZM Identification of key genes controlling cancer stem cell characteristics in gastric cancer World J Gastrointest Surg 2020 12 442 459 10.4240/wjgs.v12.i11.442 33304447 PMC7701879 Huang C, Hu CG, Ning ZK, Huang J, Zhu ZM. Identification of key genes controlling cancer stem cell characteristics in gastric cancer. World J Gastrointest Surg. 2020;12:442–59. 33304447 10.4240/wjgs.v12.i11.442 PMC7701879 27. Shimomura H Sasahira T Nakashima C Kurihara-Shimomura M Kirita T Non-SMC condensin I complex subunit H (NCAPH) is associated with lymphangiogenesis and drug resistance in oral squamous cell carcinoma J Clin Med 2019 9 72 10.3390/jcm9010072 31892156 PMC7019401 Shimomura H, Sasahira T, Nakashima C, Kurihara-Shimomura M, Kirita T. Non-SMC condensin I complex subunit H (NCAPH) is associated with lymphangiogenesis and drug resistance in oral squamous cell carcinoma. J Clin Med. 2019;9:72. 31892156 10.3390/jcm9010072 PMC7019401 28. Chen Z Ruan W Guo C Chen K Li L Tian J Non-SMC condensin I complex subunit H participates in anti-programmed cell death-1 resistance of clear cell renal cell carcinomas Cell Prolif 2023 56 e13400 10.1111/cpr.13400 36642844 PMC10334267 Chen Z, Ruan W, Guo C, Chen K, Li L, Tian J, et al. Non-SMC condensin I complex subunit H participates in anti-programmed cell death-1 resistance of clear cell renal cell carcinomas. Cell Prolif. 2023;56:e13400. 36642844 10.1111/cpr.13400 PMC10334267 29. Dongre A Weinberg RA New insights into the mechanisms of epithelial-mesenchymal transition and implications for cancer Nat Rev Mol Cell Biol 2019 20 69 84 10.1038/s41580-018-0080-4 30459476 Dongre A, Weinberg RA. New insights into the mechanisms of epithelial-mesenchymal transition and implications for cancer. Nat Rev Mol Cell Biol. 2019;20:69–84. 30459476 10.1038/s41580-018-0080-4 30. Sun C Huang S Wang H Xie R Zhang L Zhou Q Non-SMC condensin i complex subunit h enhances proliferation, migration, and invasion of hepatocellular carcinoma Mol Carcinog 2019 58 2266 2275 10.1002/mc.23114 31523845 PMC6899668 Sun C, Huang S, Wang H, Xie R, Zhang L, Zhou Q, et al. Non-SMC condensin i complex subunit h enhances proliferation, migration, and invasion of hepatocellular carcinoma. Mol Carcinog. 2019;58:2266–75. 31523845 10.1002/mc.23114 PMC6899668 31. Wang M Qiao X Cooper T Pan W Liu L Hayball J HPV E7-mediated NCAPH ectopic expression regulates the carcinogenesis of cervical carcinoma via PI3K/AKT/SGK pathway Cell Death Dis 2020 11 1049 10.1038/s41419-020-03244-9 33311486 PMC7732835 Wang M, Qiao X, Cooper T, Pan W, Liu L, Hayball J, et al. HPV E7-mediated NCAPH ectopic expression regulates the carcinogenesis of cervical carcinoma via PI3K/AKT/SGK pathway. Cell Death Dis. 2020;11:1049. 33311486 10.1038/s41419-020-03244-9 PMC7732835 32. Qi Y Mo K Zhang T A transcription factor that promotes proliferation, migration, invasion, and epithelial-mesenchymal transition of ovarian cancer cells and its possible mechanisms Biomed Eng Online 2021 20 83 10.1186/s12938-021-00919-y 34399777 PMC8366031 Qi Y, Mo K, Zhang T. A transcription factor that promotes proliferation, migration, invasion, and epithelial-mesenchymal transition of ovarian cancer cells and its possible mechanisms. Biomed Eng Online. 2021;20:83. 34399777 10.1186/s12938-021-00919-y PMC8366031 33. Kim JH Youn Y Kim KT Jang G Hwang JH Non-SMC condensin I complex subunit H mediates mature chromosome condensation and DNA damage in pancreatic cancer cells Sci Rep 2019 9 17889 10.1038/s41598-019-54478-3 31784646 PMC6884527 Kim JH, Youn Y, Kim KT, Jang G, Hwang JH. Non-SMC condensin I complex subunit H mediates mature chromosome condensation and DNA damage in pancreatic cancer cells. Sci Rep. 2019;9:17889. 31784646 10.1038/s41598-019-54478-3 PMC6884527 34. Huang P Zhao H Sun R Liu C Wu L Wang Y MiR-1976/NCAPH/P65 axis inhibits the malignant phenotypes of lung adenocarcinoma Sci Rep 2024 14 11211 10.1038/s41598-024-61261-6 38755247 PMC11099075 Huang P, Zhao H, Sun R, Liu C, Wu L, Wang Y, et al. MiR-1976/NCAPH/P65 axis inhibits the malignant phenotypes of lung adenocarcinoma. Sci Rep. 2024;14:11211. 38755247 10.1038/s41598-024-61261-6 PMC11099075 35. Liang J Yun D Jin W Fan J Wang X Wang X Ncaph serves as a prognostic factor and promotes the tumor progression in glioma through PI3K/AKT signaling pathway Mol Cell Biochem 2024 10.1007/s11010-024-04976-4 38587786 PMC11695388 Liang J, Yun D, Jin W, Fan J, Wang X, Wang X, et al. Ncaph serves as a prognostic factor and promotes the tumor progression in glioma through PI3K/AKT signaling pathway. Mol Cell Biochem. 2024. 10.1007/s11010-024-04976-4. 38587786 10.1007/s11010-024-04976-4 PMC11695388 36. Zhang T Li P Guo W Liu Q Qiao W Deng M NCAPH promotes proliferation as well as motility of breast cancer cells by activating the PI3K/AKT pathway Physiol Int. 2022 10.1556/2060.2022.00028 36067021 Zhang T, Li P, Guo W, Liu Q, Qiao W, Deng M. NCAPH promotes proliferation as well as motility of breast cancer cells by activating the PI3K/AKT pathway. Physiol Int. 2022. 10.1556/2060.2022.00028. 36067021 10.1556/2060.2022.00028 37. Fujimoto A Ikeda K Takeiwa T Osaki A Horie K Inoue S ZCCHC3 and Efp coordinately contribute to the pathophysiology of triple-negative breast cancer by modulating NCAPH Biochem Biophys Res Commun 2024 735 150663 10.1016/j.bbrc.2024.150663 39276521 Fujimoto A, Ikeda K, Takeiwa T, Osaki A, Horie K, Inoue S. ZCCHC3 and Efp coordinately contribute to the pathophysiology of triple-negative breast cancer by modulating NCAPH. Biochem Biophys Res Commun. 2024;735:150663. 39276521 10.1016/j.bbrc.2024.150663 38. Wang S Qiao X Cui Y Liu L Cooper T Hu Y Ncaph, ubiquitinated by TRIM21, promotes cell proliferation by inhibiting autophagy of cervical cancer through AKT/mTOR dependent signaling Cell Death Dis 2024 15 565 10.1038/s41419-024-06932-y 39103348 PMC11300717 Wang S, Qiao X, Cui Y, Liu L, Cooper T, Hu Y, et al. Ncaph, ubiquitinated by TRIM21, promotes cell proliferation by inhibiting autophagy of cervical cancer through AKT/mTOR dependent signaling. Cell Death Dis. 2024;15:565. 39103348 10.1038/s41419-024-06932-y PMC11300717 39. Ogura T Azuma K Sato J Kinowaki K Takayama KI Takeiwa T OCT1 is a poor prognostic factor for breast cancer patients and promotes cell proliferation via inducing NCAPH Int J Mol Sci 2021 10.3390/ijms222111505 34768935 PMC8584020 Ogura T, Azuma K, Sato J, Kinowaki K, Takayama KI, Takeiwa T, et al. OCT1 is a poor prognostic factor for breast cancer patients and promotes cell proliferation via inducing NCAPH. Int J Mol Sci. 2021. 10.3390/ijms222111505. 34768935 10.3390/ijms222111505 PMC8584020 40. Coulonval K Bockstaele L Paternot S Roger PP Phosphorylations of cyclin-dependent kinase 2 revisited using two-dimensional gel electrophoresis* J Biol Chem 2003 278 52052 52060 10.1074/jbc.M307012200 14551212 Coulonval K, Bockstaele L, Paternot S, Roger PP. Phosphorylations of cyclin-dependent kinase 2 revisited using two-dimensional gel electrophoresis*. J Biol Chem. 2003;278:52052–60. 14551212 10.1074/jbc.M307012200 41. Dey A Varelas X Guan KL Targeting the Hippo pathway in cancer, fibrosis, wound healing and regenerative medicine Nat Rev Drug Discov 2020 19 480 494 10.1038/s41573-020-0070-z 32555376 PMC7880238 Dey A, Varelas X, Guan KL. Targeting the Hippo pathway in cancer, fibrosis, wound healing and regenerative medicine. Nat Rev Drug Discov. 2020;19:480–94. 32555376 10.1038/s41573-020-0070-z PMC7880238 42. Zanconato F Cordenonsi M Piccolo S YAP/TAZ at the roots of cancer Cancer Cell 2016 29 783 803 10.1016/j.ccell.2016.05.005 27300434 PMC6186419 Zanconato F, Cordenonsi M, Piccolo S. YAP/TAZ at the roots of cancer. Cancer Cell. 2016;29:783–803. 27300434 10.1016/j.ccell.2016.05.005 PMC6186419 43. Lin CH Pelissier FA Zhang H Lakins J Weaver VM Park C Microenvironment rigidity modulates responses to the HER2 receptor tyrosine kinase inhibitor lapatinib via YAP and TAZ transcription factors Mol Biol Cell 2015 26 3946 3953 10.1091/mbc.E15-07-0456 26337386 PMC4710228 Lin CH, Pelissier FA, Zhang H, Lakins J, Weaver VM, Park C, et al. Microenvironment rigidity modulates responses to the HER2 receptor tyrosine kinase inhibitor lapatinib via YAP and TAZ transcription factors. Mol Biol Cell. 2015;26:3946–53. 26337386 10.1091/mbc.E15-07-0456 PMC4710228 44. Yuan JQ Ding NH Xiao Z The hippo transducer YAP/TAZ as a biomarker of therapeutic response and prognosis in Trastuzumab-based neoadjuvant therapy treated HER2-positive breast cancer patients Front Pharmacol 2020 11 537265 10.3389/fphar.2020.537265 32973536 PMC7481481 Yuan JQ, Ding NH, Xiao Z. The hippo transducer YAP/TAZ as a biomarker of therapeutic response and prognosis in Trastuzumab-based neoadjuvant therapy treated HER2-positive breast cancer patients. Front Pharmacol. 2020;11:537265. 32973536 10.3389/fphar.2020.537265 PMC7481481 45. Vlahov N Scrace S Soto MS Grawenda AM Bradley L Pankova D Alternate RASSF1 transcripts control SRC activity, E-cadherin contacts, and YAP-mediated invasion Curr Biol 2015 25 3019 3034 10.1016/j.cub.2015.09.072 26549256 PMC4683097 Vlahov N, Scrace S, Soto MS, Grawenda AM, Bradley L, Pankova D, et al. Alternate RASSF1 transcripts control SRC activity, E-cadherin contacts, and YAP-mediated invasion. Curr Biol. 2015;25:3019–34. 26549256 10.1016/j.cub.2015.09.072 PMC4683097 46. Elaimy AL Amante JJ Zhu LJ Wang M Walmsley CS FitzGerald TJ The VEGF receptor neuropilin 2 promotes homologous recombination by stimulating YAP/TAZ-mediated Rad51 expression Proc Natl Acad Sci U S A 2019 116 14174 14180 10.1073/pnas.1821194116 31235595 PMC6628806 Elaimy AL, Amante JJ, Zhu LJ, Wang M, Walmsley CS, FitzGerald TJ, et al. The VEGF receptor neuropilin 2 promotes homologous recombination by stimulating YAP/TAZ-mediated Rad51 expression. Proc Natl Acad Sci U S A. 2019;116:14174–80. 31235595 10.1073/pnas.1821194116 PMC6628806 47. Zhang S Zhang H Ghia EM Huang J Wu L Zhang J Inhibition of chemotherapy resistant breast cancer stem cells by a ROR1 specific antibody Proc Natl Acad Sci USA 2019 116 1370 1377 10.1073/pnas.1816262116 30622177 PMC6347692 Zhang S, Zhang H, Ghia EM, Huang J, Wu L, Zhang J, et al. Inhibition of chemotherapy resistant breast cancer stem cells by a ROR1 specific antibody. Proc Natl Acad Sci USA. 2019;116:1370–7. 30622177 10.1073/pnas.1816262116 PMC6347692 48. Luo J Li P Context-dependent transcriptional regulations of YAP/TAZ in stem cell and differentiation Stem Cell Res Ther 2022 13 10 10.1186/s13287-021-02686-y 35012640 PMC8751096 Luo J, Li P. Context-dependent transcriptional regulations of YAP/TAZ in stem cell and differentiation. Stem Cell Res Ther. 2022;13:10. 35012640 10.1186/s13287-021-02686-y PMC8751096 49. Guo Y Luo J Zou H Liu C Deng L Li P Context-dependent transcriptional regulations of YAP/TAZ in cancer Cancer Lett 2022 527 164 173 10.1016/j.canlet.2021.12.019 34952145 Guo Y, Luo J, Zou H, Liu C, Deng L, Li P. Context-dependent transcriptional regulations of YAP/TAZ in cancer. Cancer Lett. 2022;527:164–73. 34952145 10.1016/j.canlet.2021.12.019 50. Zhao B Ye X Yu J Li L Li W Li S Tead mediates YAP-dependent gene induction and growth control Genes Dev 2008 22 1962 1971 10.1101/gad.1664408 18579750 PMC2492741 Zhao B, Ye X, Yu J, Li L, Li W, Li S, et al. Tead mediates YAP-dependent gene induction and growth control. Genes Dev. 2008;22:1962–71. 18579750 10.1101/gad.1664408 PMC2492741 51. Liu-Chittenden Y Huang B Shim JS Chen Q Lee SJ Anders RA Genetic and pharmacological disruption of the TEAD-YAP complex suppresses the oncogenic activity of YAP Genes Dev 2012 26 1300 1305 10.1101/gad.192856.112 22677547 PMC3387657 Liu-Chittenden Y, Huang B, Shim JS, Chen Q, Lee SJ, Anders RA, et al. Genetic and pharmacological disruption of the TEAD-YAP complex suppresses the oncogenic activity of YAP. Genes Dev. 2012;26:1300–5. 22677547 10.1101/gad.192856.112 PMC3387657 52. Song S Xie M Scott AW Jin J Ma L Dong X A novel YAP1 inhibitor targets CSC-enriched radiation-resistant cells and exerts strong antitumor activity in esophageal adenocarcinoma Mol Cancer Ther 2018 17 443 454 10.1158/1535-7163.MCT-17-0560 29167315 PMC5805581 Song S, Xie M, Scott AW, Jin J, Ma L, Dong X, et al. A novel YAP1 inhibitor targets CSC-enriched radiation-resistant cells and exerts strong antitumor activity in esophageal adenocarcinoma. Mol Cancer Ther. 2018;17:443–54. 29167315 10.1158/1535-7163.MCT-17-0560 PMC5805581 53. Smith SA Sessions RB Shoemark DK Williams C Ebrahimighaei R McNeill MC Antiproliferative and antimigratory effects of a novel YAP-TEAD interaction inhibitor identified using in silico molecular docking J Med Chem 2019 62 1291 1305 10.1021/acs.jmedchem.8b01402 30640473 PMC6701825 Smith SA, Sessions RB, Shoemark DK, Williams C, Ebrahimighaei R, McNeill MC, et al. Antiproliferative and antimigratory effects of a novel YAP-TEAD interaction inhibitor identified using in silico molecular docking. J Med Chem. 2019;62:1291–305. 30640473 10.1021/acs.jmedchem.8b01402 PMC6701825 54. Oku Y Nishiya N Shito T Yamamoto R Yamamoto Y Oyama C Small molecules inhibiting the nuclear localization of YAP/TAZ for chemotherapeutics and chemosensitizers against breast cancers FEBS Open Bio 2015 5 542 549 10.1016/j.fob.2015.06.007 26199863 PMC4506957 Oku Y, Nishiya N, Shito T, Yamamoto R, Yamamoto Y, Oyama C, et al. Small molecules inhibiting the nuclear localization of YAP/TAZ for chemotherapeutics and chemosensitizers against breast cancers. FEBS Open Bio. 2015;5:542–9. 26199863 10.1016/j.fob.2015.06.007 PMC4506957 55. Jiao S Wang H Shi Z Dong A Zhang W Song X A peptide mimicking VGLL4 function acts as a YAP antagonist therapy against gastric cancer Cancer Cell 2014 25 166 180 10.1016/j.ccr.2014.01.010 24525233 Jiao S, Wang H, Shi Z, Dong A, Zhang W, Song X, et al. A peptide mimicking VGLL4 function acts as a YAP antagonist therapy against gastric cancer. Cancer Cell. 2014;25:166–80. 24525233 10.1016/j.ccr.2014.01.010 56. Zhang Y Shen H Withers HG Yang N Denson KE Mussell AL VGLL4 selectively represses YAP-dependent gene induction and tumorigenic phenotypes in breast cancer Sci Rep 2017 7 6190 10.1038/s41598-017-06227-7 28733631 PMC5522454 Zhang Y, Shen H, Withers HG, Yang N, Denson KE, Mussell AL, et al. VGLL4 selectively represses YAP-dependent gene induction and tumorigenic phenotypes in breast cancer. Sci Rep. 2017;7:6190. 28733631 10.1038/s41598-017-06227-7 PMC5522454 57. Noland CL Gierke S Schnier PD Murray J Sandoval WN Sagolla M Palmitoylation of TEAD transcription factors is required for their stability and function in Hippo pathway signaling Structure 2016 24 179 186 10.1016/j.str.2015.11.005 26724994 Noland CL, Gierke S, Schnier PD, Murray J, Sandoval WN, Sagolla M, et al. Palmitoylation of TEAD transcription factors is required for their stability and function in Hippo pathway signaling. Structure. 2016;24:179–86. 26724994 10.1016/j.str.2015.11.005 58. Chan P Han X Zheng B DeRan M Yu J Jarugumilli GK Autopalmitoylation of TEAD proteins regulates transcriptional output of the Hippo pathway Nat Chem Biol 2016 12 282 289 10.1038/nchembio.2036 26900866 PMC4798901 Chan P, Han X, Zheng B, DeRan M, Yu J, Jarugumilli GK, et al. Autopalmitoylation of TEAD proteins regulates transcriptional output of the Hippo pathway. Nat Chem Biol. 2016;12:282–9. 26900866 10.1038/nchembio.2036 PMC4798901 59. Bum-Erdene K Zhou D Gonzalez-Gutierrez G Ghozayel MK Si Y Xu D Small-molecule covalent modification of conserved cysteine leads to allosteric inhibition of the TEAD⋅Yap protein–protein interaction Cell Chem Biol 2019 26 378 89.e13 10.1016/j.chembiol.2018.11.010 30581134 Bum-Erdene K, Zhou D, Gonzalez-Gutierrez G, Ghozayel MK, Si Y, Xu D, et al. Small-molecule covalent modification of conserved cysteine leads to allosteric inhibition of the TEAD⋅Yap protein–protein interaction. Cell Chem Biol. 2019;26:378-89.e13. 30581134 10.1016/j.chembiol.2018.11.010 60. Li Q Sun Y Jarugumilli GK Liu S Dang K Cotton JL Lats1/2 Sustain intestinal stem cells and Wnt activation through TEAD-dependent and independent transcription Cell Stem Cell 2020 26 675 92.e8 10.1016/j.stem.2020.03.002 32259481 PMC7310193 Li Q, Sun Y, Jarugumilli GK, Liu S, Dang K, Cotton JL, et al. Lats1/2 Sustain intestinal stem cells and Wnt activation through TEAD-dependent and independent transcription. Cell Stem Cell. 2020;26:675-92.e8. 32259481 10.1016/j.stem.2020.03.002 PMC7310193 61. Xu D Zhong J Zeng Y Zhang X Wang C Luo C An updated patent review of TEAD modulators (2022-present) Expert Opin Ther Pat 2025 10.1080/13543776.2025.2522747 40536362 Xu D, Zhong J, Zeng Y, Zhang X, Wang C, Luo C, et al. An updated patent review of TEAD modulators (2022-present). Expert Opin Ther Pat. 2025. 10.1080/13543776.2025.2522747. 40536362 10.1080/13543776.2025.2522747 ",
  "metadata": {
    "Title of this paper": "An updated patent review of TEAD modulators (2022-present)",
    "Journal it was published in:": "Stem Cell Research & Therapy",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12465784/"
  }
}