{
  "title": "Paper_143",
  "abstract": "pmc BMC Health Serv Res BMC Health Serv Res 34 bmchsr BMC Health Services Research 1472-6963 BMC PMC12495857 PMC12495857.1 12495857 12495857 41044580 10.1186/s12913-025-13467-1 13467 1 Research Acceptability of home-based HPV self-sampling for cervical cancer screening among users and providers in the West region of Cameroon: a cross-sectional study Moukam Alida Manoëla Datchoua Alida.Datchoua@etu.unige.ch 1 2 Salah Nasteha 1 2 Tankeu Happi Gilles W. 3 5 Metchehe Loïc D. Djommo 4 5 Makajio Sophie Lemoupa 1 2 Wisniak Ania 1 2 Sormani Jessica 2 6 Kenfack Bruno 7 8 Vassilakos Pierre 2 9 Socpa Antoine 10 Petignat Patrick 2 11 Schmidt Nicole C. 11 12 1 https://ror.org/01swzsf04 grid.8591.5 0000 0001 2175 2154 Institute of Global Health, Faculty of Medicine, University of Geneva, 2 https://ror.org/01m1pv723 grid.150338.c 0000 0001 0721 9812 Gynaecology Unit, Department of Women, Children and Adolescent, University Hospitals of Geneva, 3 4 5 6 https://ror.org/01xkakk17 grid.5681.a 0000 0001 0943 1999 Geneva School of Health Sciences, HES-SO University of Applied Sciences and Arts Western Switzerland, 7 8 https://ror.org/0566t4z20 grid.8201.b 0000 0001 0657 2358 Department of Obstetrics and Gynaecology, Faculty of Medicine and Pharmaceutical Sciences, University of Dschang, 9 10 https://ror.org/022zbs961 grid.412661.6 0000 0001 2173 8504 Faculty of Arts, Letters and Social Sciences, Department of Anthropology, University of Yaounde I – Lab. CASS-RT, 11 https://ror.org/01swzsf04 grid.8591.5 0000 0001 2175 2154 Department of Paediatrics, Gynaecology and Obstetrics, Faculty of Medicine, University of Geneva, 12 https://ror.org/01j2dwr66 grid.466275.4 0000 0001 0532 1477 Faculty of Social Science, Catholic University of Applied Science, 3 10 2025 2025 25 478160 1303 10 2 2025 3 9 2025 03 10 2025 05 10 2025 05 10 2025 © The Author(s) 2025 2025 https://creativecommons.org/licenses/by/4.0/ Open Access http://creativecommons.org/licenses/by/4.0/ Background The World Health Organization’s 90-70-90 goal aims to eliminate cervical cancer (CC) as a public health issue, with a target of up to 70% of women screened by 2030. However, many countries, including Cameroon, are far from achieving this goal. Home-based human papillomavirus (HPV) self-sampling is a promising approach to improve participation rates. The main objective of this study was to explore the acceptability and feasibility of home-based HPV self-sampling in the West region of Cameroon. Methods A quantitative, descriptive, cross-sectional study conducted between January 11 and February 05, 2024, was embedded in a cluster-randomised controlled trial comparing home- vs. hospital-based CC screening. Women eligible for CC screening, male partners or close relatives, community leaders, and healthcare professionals (HCPs) living in Dschang health district responded to a structured questionnaire. Simple and multivariate analyses were performed to assess the association between acceptability of home-based HPV self-sampling, CC screening practices, and sociodemographic factors such as education, professional status, residence, and income. Preferences for implementation (e.g., seasonal timing) were also explored. Results A total of 556 participants (300 women, 70 male partners, 153 HCPs, and 33 community leaders) were recruited. Overall, 77.5% of participants expressed favourable attitudes toward home-based HPV self-sampling, with acceptability rates of 73.7% for women, 65.7% for men, 90% for community leaders, and 87.6% for HCPs. Previous CC screening was reported by 33% of women, and was significantly associated with being over 40 years old (aOR = 2.1, p p p Conclusion Home-based HPV self-sampling was highly accepted across all study groups and was unaffected by sociodemographic factors. Previous screening practices were associated with age, income, and knowledge. Home-based HPV self-sampling screening can address access disparities to CC screening. Community involvement in planning and implementing these programs is essential to ensure their success. Trial registration Ethical Cantonal Board of Geneva, Switzerland (CCER, N°202100085), (ClinicalTrials.govID NCT06166420 Supplementary Information The online version contains supplementary material available at 10.1186/s12913-025-13467-1. Keywords Acceptability Cervical cancer screening Home-based HPV self-sampling Quantitative study, sub-Saharan Africa University of Geneva Open access funding provided by University of Geneva pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement yes pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes issue-copyright-statement © BioMed Central Ltd., part of Springer Nature 2025 Background Cervical cancer (CC) ranks fourth among all cancers in incidence and mortality worldwide. It is currently the leading cause of cancer deaths for women in 38 countries [ 1 2 1 3 The World Health Organisation’s global strategy defines elimination as reducing the number of annual new cases to 4 per 100 000 women or less; and sets three goals to be achieved by 2030 in order to take all countries on the pathway to elimination in the coming decades: 90% of girls vaccinated against human papillomavirus (HPV) by age 15, 70% of women by age 30–49, screened with a high-quality and high-performance test; and 90% of women with cervical disease receiving treatment [ 1 4 In Cameroon, a lower-middle-income country, CC is the second leading cause of cancer-related deaths among women after breast cancer [ 5 4 6 7 8 7 8 To reduce the burden of this disease, a 5-year CC screening program was introduced in 2018 at Dschang District Hospital in Cameroon [ 9 10 11 14 10 15 16 17 18 Therefore, we hypothesized that home-based HPV self-sampling may improve the acceptance of CC screening in Cameroon, where distance, cost, and lack of time are important barriers to CC screening [ 10 12 Methods Study design This study (referred to as study B; Fig. 2 NCT06166420 Setting This study was conducted in Dschang Health District (DHD) (Fig. 2 19 1  Fig. 1 Accessibility to the health areas of Dschang Health District, in terms of travel time from Fiala Foreke, considered as “central health area” (map adapted from the Ministry of Public Health – Cameroon) The figure illustrates the geographical layout of DHD and its health areas. Accessibility is expressed in terms of time. The most accessible health area (Siteu, Fometa) is 10 min from the district office, while the least accessible areas, including Fondonera, Mekouale, and Fomopea, are approximately 3 h away. Participants Data were collected between January and February 2024, from nine health areas within the Dschang Health District, including one urban, two semi-urban, and six rural areas. The study included four groups of stakeholders: women eligible for CC screening aged 30–49 years who were potential beneficiaries; and stakeholders who might influence women’s decision processes, such as husbands or close relatives and community leaders (see Fig. 2 20 1  Table 1 Participants’ characteristics Criteria Women Men / Relatives Community leaders Health care professionals Inclusion criteria Having lived in Dschang Health District (DHD) for ≥ 12 months Working in a health facility in DHD as an accredited HCP Aged 30–49 years Partner or close relative living in the same house Exclusion criteria Previous HPV-home self-sampling test Works in a “red zone” (insecure border area with the South-western region of Cameroon) Staff of the 3T research program Residing in a health area in study A Existing mental/cognitive limitation (either medically diagnosed or witnessed by family/friends) Unavailability after three appointments  Fig. 2 Flow chart of study B (Acceptability study) Variables In accordance with the study objectives, the main outcomes were the acceptability of home-based HPV self-sampling, practice of CC screening, and preferences for the implementation of home-based HPV self-sampling. The predictors were sociodemographic parameters (such as age, instruction level, place of residence, monthly income, and matrimonial status), knowledge of CC, and previous CC screening. The data comprise both quantitative and qualitative variables. Age, originally quantitative, was later categorized as 30–40 years and 40–49 years for the women; <30 years, [30–40] years and ≥ 40 years for health professionals. Monthly income for women and households was recoded for predictive analysis into < 50,000 Central African XAF franc (FCFA)/≥50,000 XAF and ≤ 100,000 XAF/>100,000 XAF respectively, for the purpose of predictive analysis. The minimum wage in Cameroon is 41,875 XAF (approximately 65 euros) [ 21 22 Data collection Data were collected by a team of trained data collectors through a pretested questionnaire (additional file 1) for each target group. The questionnaire comprised four sections: sociodemographic information, knowledge about CC, acceptability of home-based HPV self-sampling, and feasibility of its implementation. Data were digitized using a mobile data collection tool (KoboToolbox). And constantly monitored and supervised by the data manager. Participants did not receive any incentives for their involvement in the study. Bias Before conducting the study, potential sources of bias were carefully addressed. A pretested questionnaire was used. Selection bias was minimized by recruiting participants exclusively from areas not involved in the randomized controlled trial (Study A). Health areas with diverse accessibility levels were included. To reduce information bias, data collectors underwent a three-day training session to ensure that the questions were phrased neutrally, so as to minimize unintentional influence and missing data. Data collectors, were provided with a “Data Collector’s Guide”, specifically created for the study. They were closely supervised by a data manager. Study size Sample sizes for women and HCPs were calculated using the OpenEpi platform, based on various parameters. These include population size, assumed frequency of acceptance of home-based HPV self-sampling, a 95% confidence interval, and a 5% margin of error. This resulted in an estimated sample size of 287 women and 141 HCPs. Assuming a 1:1 ratio between women and their partners or close relatives (i.e., one partner per woman surveyed). The estimated sample size for partners/close relatives was set at 287. Due to the absence of preliminary data on community leaders (traditional, social, and religious), we relied on contextual knowledge and applied a quota sampling approach for this group. Assuming that, three community leaders (traditional, social, and religious 1 Statistical methods Qualitative variables were summarized as absolute counts and percentages. Quantitative variables were presented as means and standard deviations. Simple and multivariate logistic regression analyses were performed to assess the association between outcomes and exposure. Multivariate models included variables with a p-value < 15% from univariate analysis, as suggested by a simulation by Bursac et al. 23 Results Sociodemographic characteristics of participants A total of 556 participants (300 women, 70 male partners, 153 HCPs, and 33 community leaders) were recruited from the nine health areas (Table 2 The mean age (± standard deviation) was 37.9 (± 5.9) years for women, 51.8 (± 14.3) years for men, 33.6 (± 8.7) years for HCPs, and 54.1 (± 14.9) years for community leaders. Participants had been living in their respective communities for less than 3 years (24.5%) and more than 10 years (33.1%). Women, their partners/close relatives, and HCPs mostly lived in Fiala Foreke urban health area, while community leaders were mostly found in rural areas. The majority of participants (≥ 61% among all groups) were in a relationship. Furthermore, monotheism was the main practiced religion by women (80.4%), men (84.1%), HCPs (91.5%). Whereas community leaders identified themselves mostly as animists (36.4%) or monotheists (36.4%). Secondary education was the predominant level of instruction for women and men. While, higher education (defined as having started at least one school term of tertiary education or pursuing professional training after secondary education) was more common among community leaders (42%) and HCPs (70%). Regarding employment, women predominantly worked in the informal sector (73.0%), while men were mainly employed in the formal sector (78.3%). Monthly income levels were significantly associated with formal or informal sector of activity ( p  Table 2 Sociodemographic characteristics Sociodemographic characteristics Women Men Healthcare professionals Community leaders  n (%)  n (%)  n (%)  n (%)  Place of residence Urban 140 (46.7) 29 (41.4) 92 (60.1) 9 (27.3) Semi-urban 29 (9.7) 25 (35.7) 21 (13.7) 6 (18.2) Rural 131 (43.6) 16 (22.9) 40 (26.2) 18 (54.6)  Age Mean ± SD 37.9 ± 5.9 51.8 ± 14.3 33.6 ± 8.7 54.1 ± 14.9  Civil status Single 47 (15.7) 9 (12.8) 60 (39.2) 4 (12.2) In a relationship 253 (84.3) 61 (87.2) 93 (60.8) 29 (87.9)  Duration of residence in the health area < 3 years 63 (28.5) 8 (11.4) 58 (37.9) 7 (21.2) 3–10 years 86 (38.9) 10 (14.3) 55 (36.0) 6 (18.2) > 10 years 72 (32.6) 52 (74.3) 40 (26.1) 20 (60.6)  Level of instruction Never been to school/primary 94 (31.3) 27 (38.6) 1 (0.7) 8 (24.2) Secondary 153 (51.0) 34 (48.6) 44 (28.8) 11 (33.4) Higher 53 (17.7) 9 (12.9) 108 (70.6) 14 (42.4)  Religion Animism 36 (12.0) 7 (10.1) 09 (5.9) 12 (36.4) Atheist/others** 23 (7.7) 4 (5.8) 04 (2.6) 1 (3.0) Monotheism* 241 (80.4) 58 (84.1) 140 (91.5) 12 (36.4) Missing - - 1 - - - 8 -  Monthly income (XAF) ≤ 50 000 254 (84.7) 46 (65.7) 68 (44.4) N/I > 50 000 46 (15.3) 24 (34.3) 85 (55.6) Not declared 0 (0.0) 4 (5.7) 0 (0.0)  Monthly income of the household (XAF) ≤ 100 000 177 (59.1) 46 (65.7) 93 (60.8) N/I > 100 000 123 (41.0) 15 (21.5) 60 (39.2) N/I Not declared 0 (0.0) 9 (12.9) 0 (0.0) N/I  Employment Formal sector 68 (22.6) 18 (78.3) N/I N/I Informal sector 219 (73.0) 1 (4.3) N/I N/I No income/joblessness 13 (4.4) 4 (17.3) Missing - - 47 -  Number of children living with the woman ≤ 4 children 173 (57.7) N/I N/I N/I > 4 children 127 (42.3) N/I N/I N/I  Sex Female N/I N/I 108 (70.6) 27 (81.8) Male N/I N/I 45 (29.4) 6 (18.2)  Level of study of partner Never been to school/primary 59 (23.0) N/I 6 (5.6) N/I Secondary 133 (60.0) N/I 31 (29.3) N/I Higher 64 (25.0) N/I 69 (65.1) N/I Missing 44 - 47 -  Occupation of partner Formal sector 86 (33.6) N/I 70 (66.0) N/I Informal sector 157 (61.3) N/I 27 (25.5) N/I No income/joblessness 13 (5.1) N/I 09 (8.5) N/I  Qualification Assistant nurse, Laboratory Technician, Others N/I N/I 72 (40.1) N/I Nurse N/I N/I 57 (37.2) N/I Medical doctor N/I N/I 11 (7.2) N/I Midwife N/I N/I 13 (8.5) N/I  Years of experience ≤ 5 years N/I N/I 81 (53.0) N/I > 5 years N/I N/I 72 (47.1) N/I  Community leaders’ role Traditional leader N/I N/I N/I 20 (60.6) Religious leader N/I N/I N/I 7 (21.2) Others*** N/I N/I N/I 6 (18.2) N/I: the question was not asked in the target group XAF: Francs CFA; SD: standard deviation *all Christians apart from two Muslims among women **: includes Kamite (01) ***: includes leaders of community associations and traditional healers Acceptability of home-based HPV self-sampling The overall acceptability of home-based HPV self-sampling was 77.5% (95% CI: 74.0–81.0%) across all participant groups. Specifically, acceptability rates were 73.7% (95% CI: 68.7–78.6%) among women, 65.7% (95% CI: 54.6–76.8%) among men or close relatives, 87.6% (95% CI: 82.3–92.8%) among HCPs, and 90.9% (95% CI: 81.1–100%) among community leaders. In eight of the nine health areas, acceptability exceeded 81.0%, except for Fontsa Touala, where it was 75% (Fig. 3  Fig. 3 Overall acceptability of home-based HPV self-sampling in Dschang Health District (women, men, community leaders, and healthcare professionals) Factors associated with acceptability of home-based HPV self-sampling None of the sociodemographic factors analyzed significantly influenced home-based HPV self-sampling acceptability (additional file 3). Therefore, additional analyses were conducted to explore the factors influencing whether participants underwent CC screening—either at home or at hospital—referred to here as the “practice of CC screening.” Prior practice of CC screening and related knowledge Among the studied female participants, one woman out of three ( n 3 Knowledge of CC was also evaluated. A total of 65% participants had adequate knowledge related to CC. While HCPs showed the highest levels of knowledge (94.1% with adequate knowledge). The proportion of women and male partners or close relatives with adequate knowledge was 62.7% and 64.3%, respectively. Univariate analysis revealed that women over 40 years (cOR = 1.7 (1.0; 2.8), p p p p p p  Table 3 Factors associated with CC screening among women in Dschang health district Undergone CC screening Univariate regression Multivariate regression  Variables  N Yes No cOR 95%CI p aOR 95%CI p n (%) n (%)  Place of residence Rural 131 38 (29.0) 93 (71.0) 1 Semi-urban 29 12 (41.4) 17 (58.6) 0.8 (0.4;1.3) 0.292 Urban 140 49 (35.0) 91 (65.0) 1.3 (0.6;3.0) 0.516  Age [30–40[ years 183 52 (28.4) 131 (71.6) 1 1 [40–50[ years 117 47 (40.2) 70 (59.8) 1.7 (1.0;2.8)  0.035 2.1 (1.2;3.7)  0.007  Matrimonial status Single 47 13 (27.7) 34 (72.3) 1 In a relationship 253 86 (34.0) 167 (66.0) 1.3 (0.7;2.7) 0.398  Level of instruction No school/primary 94 29 (30.9) 65 (69.1) 1 Secondary 153 52 (34.0) 101 (66.0) 1.1 (0.6;2.0) 0.610 Higher 53 18 (34.0) 35 (66.0) 1.1 (0.6;2.4) 0.698  Religion Monotheism 241 80 (33.2) 161 (66.8) 1 Animist 36 12 (33.3) 24 (66.7) 1.0 (0.5;2.1) 0.987 Atheist/others 23 7 (30.4) 16 (69.6) 0.9 (0.3;2.2) 0.788  Women’s monthly income ≤ 50 000 XAF 251 74 (29.5) 177 (70.5) 1 1 > 50.000 XAF 46 22 (47.8) 24 (52.2) 2.2 (1.2;4.1)  0.016 2.2 (1.0;5.0)  0.049  Household’s monthly income ≤ 100,000 213 63 (29.6) 150 (70.4) 1 1 > 100,000 67 27 (40.3) 40 (59.7) 1.6 (0.9;2.8) 0.103 1.2 (0.6;2.5) 0.579  CC knowledge level Insufficient 112 25 (22.3) 87 (77.7) 1 1 Adequate 188 74 (39.4) 114 (60.6) 2.2 (1.3;3.8)  0.003 2.6 (1.4;4.7)  0.001 CC: cervical cancer, cOR: crude odds ratio, 95%CI: 95% confidence interval, p: probability value, aOR: adjusted odds ratio Implementation preferences of home-based HPV self-sampling Given their relevance in the implementation of home-based HPV self-sampling, the perspectives of all four stakeholder groups were consulted to identify their preferred timing (season and time of day) and communication strategies (Fig. 4 More than average of the women, men, and HCPs had no seasonal preference (59.3%, 61.4%, and 64.7%, respectively). In contrast, a majority of community leaders (69%) preferred that home-based HPV self-sampling be conducted during the rainy season. Among all stakeholder groups, morning periods were the preferred time for HPV self-sampling. A good number of community leaders (62.5%) emphasized on the importance of aligning the approach with culturally designated “sacred days” which are weekly rest days during which no farming or outdoor labour is carried out in the community. When participants were asked about their preferred means of sensitization about home-based HPV self-sampling, women (70.0%), men (64.3%), and community leaders (60.6%), favoured the use of megaphones over radio or written announcements. HCPs were more inclined toward communication via the media (42.5%). Furthermore, participants clearly insisted that communication should not be made by community health workers alone. Women strongly adhered to this view, with 74.7% expressing disagreement with relying exclusively on community health workers. Concerning the disclosure of HPV test results, a strong preference for face-to-face communication was observed among women (74.0%), men (72.9%), HCPs (92.8%), and community leaders (84.8%). Furthermore, the preferred location for receiving test results was the Dschang Regional Annex Hospital, as indicated by women (63.0%), men (50.0%), and HCPs (65.4%). But some community leaders preferred that results be disclosed at home (46.9%).  Fig. 4 Implementation preferences of home-based HPV self-sampling Discussion This study confirms the high acceptability of home-based HPV self-sampling in the West Region of Cameroon. While hospital-based screening is often limited by time, distance, and costs [ 9 14 Socio demographic characteristics Our study included 300 women, 70 men, 33 community leaders, and 153 healthcare professionals. Many lived in urban areas, were married, and worked in the informal sector. Only one quarter of women’s partners participated, mainly due to daily occupations, family responsibilities, or single status. Similar challenges in involving men have been observed in other African settings, often linked to economic pressures and limited availability [ 24 26 Although home-based HPV self-sampling was well accepted, socioeconomic constraints continued to influence screening behaviours in all settings. Association between age, monthly income and practice of the screening Most participants’ revenues are below 50,000 XAF (~ 80 euros), just slightly above the estimated minimum wage in Cameroon (41,875 XAF) [ 27 28 29 31 32 34 Association between level of knowledge and practice of cervical cancer screening Our study found a significant association between the knowledge of CC screening and its practice, highlighting knowledge as a crucial determinant of health behaviour [ 14 15 28 35 36 37 39 Male partners and community leaders’ roles in cervical cancer screening Men were included in this study because of their key role in family decision-making. Particularly in West African contexts where they act as heads of household [ 40 13 41 44 42 43 45 Community leaders also emerged as essential allies, with 90% expressing supportive views. Their influence on health behaviours is well documented in sub-Saharan Africa [ 46 49 Acceptability of home-based HPV self-sampling Home-based HPV self-sampling was well accepted by women in our study (73.7%). Therefore, supporting its potential to improve screening uptake and advance WHO’s elimination goals. Additionally, our study found that one out of three women had participated in CC screening 5 years ago, what aligns with national statistics (4%) [ 28 10 50 51 52 53 17 18 Notably, in eight of the nine health areas included in the study, the acceptance of home-based HPV self-sampling was very high (Fig. 3 2 10 13 15 54 55 2 Implementation perspectives of home-based HPV self-sampling Effective communication between communities and HCPs is essential for successful CC screening programs, especially in low and middle income countries such as Cameroon. Community health workers play a key role in raising awareness, particularly in rural areas [ 56 57 58 4 59 In order to improve participation, screening activities should be in harmony with local routines. Participants favoured morning visits and HPV self-sampling on “sacred days”—culturally significant days when people remain at home. These community rest days provide strategic opportunities to reach more individuals while respecting local customs, similar to designated public holidays [ 60 Although the HPV self-sampling was conducted at home, most participants preferred receiving their results at health facilities to avoid stigmatisation, especially in case of positive results [ 10 61 Strengths and limitations To our knowledge, this is the pioneer quantitative study in sub-Saharan Africa to explore the acceptability and preferences for implementing home-based HPV self-sampling. However, the study presents several limitations. Firstly, it was carried out before the actual rollout of home-based HPV self-sampling, as part of a pre-implementation phase. This means we could not assess how people behave in real conditions, but the findings provide useful guidance for planning future programs. Secondly, the cross-sectional design does not allow the establishment of causal relationships. Finally, fewer men and close relatives were recruited than expected. Which reflects common difficulties in involving male partners in previous African studies [ 24 25 Despite these limitations, the study has several strengths. It includes an extensive and diverse set of participants across four different groups, all without prior experience of home-based self-sampling. The high number of women involved, as well as the inclusion of healthcare professionals and community leaders, helped capture a wide range of perspectives. We also reached participants from various health areas, with different levels of accessibility, including urban, semi-urban, and rural communities. These aspects increase the relevance and potential use of our findings in similar contexts. The upcoming CASAHO A study which will compare home and hospital-based screening, will further explore key operational aspects such as kit delivery, results communication, and follow-up. Conclusion In our context, home-based HPV self-sampling was largely supported by stakeholders. This approach provides an important opportunity to reach women who have never participated in health facility-based CC screening. As was the case for 73.1% of women in our setting. However, community involvement, prior to the implementation of CC screening is crucial to ensure the acceptance of new screening programs with respect to awareness campaigns, timing of screening, and means of results disclosure. Supplementary Information Below is the link to the electronic supplementary material.  Supplementary Material 1  Supplementary Material 2  Supplementary Material 3  Supplementary Material 4 1 A religious leader guides spiritual and moral practices; his authority is based on religious beliefs. He influences individual and family values. A traditional leader preserves local customs and maintains social order. He often holds his powers from ancestors or family lineage. A social leader mobilises for societal causes and acts for change in the community. His influence derives from his charisma or public commitment. Publisher’s note Springer Nature remains neutral with regard to jurisdictional claims in published maps and institutional affiliations. Acknowledgements The authors are thankful to the communities that gave their consent to participate and opened their doors to provide the needed information toward successful research. The author is a recipient of the Swiss Government Excellence Scholarship (No: 2023.0553). Author contributions A.D.M contributed to all phases of the research and wrote the initial draft of the manuscript. S. L. managed the approval process with the Geneva Cantonal Research Ethics Commission and registered the CASAHO study on ClinicalTrials.gov. P.P. and N.C.S. conceptualized and designed the study and all authors were able to contribute to the study protocol and questionnaires. G.T. and L.D. were responsible for the data collection, interpretation, and analysis. B.K. supervised the study on-site. N.S., A.W., and P.P. critically revised the manuscript. N.C.S. provided support throughout all phases of the research. All the authors have read and approved the final version of the manuscript. Funding Open access funding provided by University of Geneva. This study was funded by the Fondation Privée des Hôpitaux Universitaires de Genève, the Foundation Dragon Bleu, and the Foundation Ernst and Lucie Schmidheiny. Data availability The datasets used and/or analysed during the current study are available from the corresponding author upon reasonable request. Due to privacy and ethical considerations, access to the data may be restricted to ensure confidentiality and compliance with institutional regulations. Declarations Ethics approval and consent to participate Our study was conducted in accordance with the principles of the Declaration of Helsinki. This study was approved by the Geneva Canton Ethics Council, Switzerland (CCER, N°2021-00085) and the National Ethics Committee for Human Health Research in Cameroon (N°2023/09/1579/CE/CNERSH/SP). Informed consent to participate was obtained from all the participants in the study. Each participant signed a consent form before the survey began and all data collection forms were anonymized. Consent for publication Not applicable. Competing interests The authors declare no competing interests. Abbreviations CC Cervical Cancer DHD Dschang Health District HCPs Healthcare professionals HPV Human papillomavirus LMIC Low-and-middle income country WHO World Health Organization References 1. Cervical cancer elimination | UICC [Internet]. [Accessed 11 sept 2024]. Available on: https://www.uicc.org/what-we-do/thematic-areas/cervical-cancer-elimination 2. WHO | Regional Office for Africa [Internet]. 2024 [Accessed 23 july 2024]. Cervical cancer. Available on: https://www.afro.who.int/health-topics/cervical-cancer 3. Garland SM Bhatla N Ngan HYS Cervical cancer burden and prevention strategies: Asia Oceania perspective Cancer Epidemiol Biomarkers Prev Sept 2012 21 9 1414 22 10.1158/1055-9965.EPI-12-0164 22956727 Garland SM, Bhatla N, Ngan HYS. Cervical cancer burden and prevention strategies: Asia Oceania perspective. Cancer Epidemiol Biomarkers Prev Sept. 2012;21(9):1414–22. 10.1158/1055-9965.EPI-12-0164 22956727 4. WHO | Regional Office for Africa [Internet]. 2024 [Accessed 12 sept 2024]. Cervical cancer. Available on: https://www.afro.who.int/health-topics/cervical-cancer 5. Sung H Ferlay J Siegel RL Laversanne M Soerjomataram I Jemal A Global cancer statistics 2020: GLOBOCAN estimates of incidence and mortality worldwide for 36 cancers in 185 countries CA Cancer J Clin May 2021 71 3 209 49 10.3322/caac.21660 33538338 Sung H, Ferlay J, Siegel RL, Laversanne M, Soerjomataram I, Jemal A, et al. Global cancer statistics 2020: GLOBOCAN estimates of incidence and mortality worldwide for 36 cancers in 185 countries. CA Cancer J Clin May. 2021;71(3):209–49. 10.3322/caac.21660 33538338 6. Woks NIE Anwi MM Kefiye TB Sama DJ Phuti A Disparities in cervical cancer screening programs in cameroon: a scoping review of facilitators and barriers to implementation and uptake of screening Int J Equity Health 17 Aug 2023 22 156 10.1186/s12939-023-01942-2 PMC10433640 37592286 Woks NIE, Anwi MM, Kefiye TB, Sama DJ, Phuti A. Disparities in cervical cancer screening programs in Cameroon: a scoping review of facilitators and barriers to implementation and uptake of screening. Int J Equity Health 17 Aug. 2023;22:156. 10.1186/s12939-023-01942-2 PMC10433640 37592286 7. Cameroon. Human papillomavirus and related cancers, fact sheet 2023 8. Morgan J, Grace TA. Women and cervical cancer screening in yaoundé, Cameroon. 4 march 2023. 9. Levy J de Preux M Kenfack B Sormani J Catarino R Tincho EF Implementing the 3T-approach for cervical cancer screening in cameroon: preliminary results on program performance Cancer Med Oct 2020 9 19 7293 300 10.1002/cam4.3355 PMC7541141 32757469 Levy J, de Preux M, Kenfack B, Sormani J, Catarino R, Tincho EF, et al. Implementing the 3T-approach for cervical cancer screening in Cameroon: preliminary results on program performance. Cancer Med Oct. 2020;9(19):7293–300. 10.1002/cam4.3355 PMC7541141 32757469 10. Datchoua Moukam AM Embolo Owono MS Kenfack B Vassilakos P Petignat P Sormani J Cervical cancer screening: awareness is not enough. Understanding barriers to screening among women in West Cameroon—a qualitative study using focus groups Reprod Health 9 July 2021 18 147 10.1186/s12978-021-01186-9 PMC8268254 34243778 Datchoua Moukam AM, Embolo Owono MS, Kenfack B, Vassilakos P, Petignat P, Sormani J, et al. Cervical cancer screening: awareness is not enough. Understanding barriers to screening among women in West Cameroon—a qualitative study using focus groups. Reprod Health 9 July. 2021;18:147. 10.1186/s12978-021-01186-9 PMC8268254 34243778 11. Bateman LB Blakemore S Koneru A Mtesigwa T McCree R Lisovicz NF Barriers and facilitators to cervical cancer screening, diagnosis, follow-up care and treatment: perspectives of human immunodeficiency Virus-Positive women and health care practitioners in Tanzania Oncologist Jan 2019 24 1 69 75 10.1634/theoncologist.2017-0444 PMC6324638 29934410 Bateman LB, Blakemore S, Koneru A, Mtesigwa T, McCree R, Lisovicz NF, et al. Barriers and facilitators to cervical cancer screening, diagnosis, follow-up care and treatment: perspectives of human immunodeficiency Virus-Positive women and health care practitioners in Tanzania. Oncologist Jan. 2019;24(1):69–75. 10.1634/theoncologist.2017-0444 PMC6324638 29934410 12. Roux AN Kenfack B Ndjalla A Sormani J Wisniak A Tatrai K Barriers to cervical cancer prevention in rural cameroon: a qualitative study on healthcare providers’ perspective BMJ Open 17 June 2021 11 6 e043637 10.1136/bmjopen-2020-043637 PMC8212185 34140340 Roux AN, Kenfack B, Ndjalla A, Sormani J, Wisniak A, Tatrai K, et al. Barriers to cervical cancer prevention in rural Cameroon: a qualitative study on healthcare providers’ perspective. BMJ Open 17 June. 2021;11(6):e043637. 10.1136/bmjopen-2020-043637 PMC8212185 34140340 13. Chapola J Lee F Bula A Mapanje C Phiri BR Kamtuwange N Barriers to follow-up after an abnormal cervical cancer screening result and the role of male partners: a qualitative study BMJ Open 14 Sept 2021 11 9 e049901 10.1136/bmjopen-2021-049901 PMC8442050 34521669 Chapola J, Lee F, Bula A, Mapanje C, Phiri BR, Kamtuwange N, et al. Barriers to follow-up after an abnormal cervical cancer screening result and the role of male partners: a qualitative study. BMJ Open 14 Sept. 2021;11(9):e049901. 10.1136/bmjopen-2021-049901 PMC8442050 34521669 14. Niyonsenga G Gishoma D Sego R Uwayezu MG Nikuze B Fitch M Knowledge, utilization and barriers of cervical cancer screening among women attending selected district hospitals in Kigali - Rwanda Can Oncol Nurs J 2021 31 3 266 74 10.5737/23688076313266274 34395829 PMC8320790 Niyonsenga G, Gishoma D, Sego R, Uwayezu MG, Nikuze B, Fitch M, et al. Knowledge, utilization and barriers of cervical cancer screening among women attending selected district hospitals in Kigali - Rwanda. Can Oncol Nurs J. 2021;31(3):266–74. 34395829 10.5737/23688076313266274 PMC8320790 15. Darj E Chalise P Shakya S Barriers and facilitators to cervical cancer screening in nepal: A qualitative study Sex Reprod Healthc June 2019 20 20 6 10.1016/j.srhc.2019.02.001 31084813 Darj E, Chalise P, Shakya S. Barriers and facilitators to cervical cancer screening in Nepal: a qualitative study. Sex Reprod Healthc June. 2019;20:20–6. 10.1016/j.srhc.2019.02.001 31084813 16. Gizaw M Teka B Ruddies F Kassahun K Worku D Worku A Reasons for not attending cervical cancer screening and associated factors in rural EthiopiaNot attending cervical cancer screening in Ethiopia Cancer Prev Res (Phila) 1 July 2020 13 7 593 600 10.1158/1940-6207.CAPR-19-0485 32371553 Gizaw M, Teka B, Ruddies F, Kassahun K, Worku D, Worku A, et al. Reasons for not attending cervical cancer screening and associated factors in rural Ethiopia Not attending cervical cancer screening in Ethiopia. Cancer Prev Res (Phila) 1 July. 2020;13(7):593–600. 10.1158/1940-6207.CAPR-19-0485 32371553 17. Arrossi S Thouyaret L Herrero R Campanera A Magdaleno A Cuberli M Effect of self-collection of HPV DNA offered by community health workers at home visits on uptake of screening for cervical cancer (the EMA study): a population-based cluster-randomised trial Lancet Global Health 1 Feb 2015 3 2 e85 94 10.1016/S2214-109X(14)70354-7 25617202 Arrossi S, Thouyaret L, Herrero R, Campanera A, Magdaleno A, Cuberli M, et al. Effect of self-collection of HPV DNA offered by community health workers at home visits on uptake of screening for cervical cancer (the EMA study): a population-based cluster-randomised trial. Lancet Global Health 1 Feb. 2015;3(2):e85–94. 10.1016/S2214-109X(14)70354-7 25617202 18. Brandt T, Wubneh SB, Handebo S, Debalkie G, Ayanaw Y, Alemu K, et al. Genital self-sampling for HPV-based cervical cancer screening: a qualitative study of preferences and barriers in rural Ethiopia. BMC Public Health. july 2019;31(1):1026. 10.1186/s12889-019-7354-4 PMC6669971 31366402 19. Institut National de la Statistique du Cameroun. – Des statistiques de qualité pour un meilleur accompagnement du Cameroun vers son émergence [Internet]. [Accessed 12 sept 2024]. Available on: https://ins-cameroun.cm/ 20. Concannon TW Meissner P Grunbaum JA McElwee N Guise JM Santa J A new taxonomy for stakeholder engagement in patient-centered outcomes research J Gen Intern Med Aug 2012 27 8 985 91 10.1007/s11606-012-2037-1 PMC3403141 22528615 Concannon TW, Meissner P, Grunbaum JA, McElwee N, Guise JM, Santa J, et al. A new taxonomy for stakeholder engagement in patient-centered outcomes research. J Gen Intern Med Aug. 2012;27(8):985–91. 10.1007/s11606-012-2037-1 PMC3403141 22528615 21. Cameroon | Paul Hastings LLP [Internet]. [Accessed 3 nov 2024]. Available on: https://www.paulhastings.com/insights/practice-area-articles/cameroon 22. Informal Sector -. an overview | ScienceDirect Topics [Internet]. [Accessed 3 nov 2024]. Available on: https://www.sciencedirect.com/topics/social-sciences/informal-sector 23. Bursac Z, Gauss CH, Williams DK, Hosmer DW. Purposeful selection of variables in logistic regression. Source Code Biol Med. dec 2008;16:3:17. 10.1186/1751-0473-3-17 PMC2633005 19087314 24. Kululanga LI Sundby J Malata A Chirwa E Male involvement in maternity health care in Malawi Afr J Reproductive Health / La Revue Africaine De La Santé Reproductive 2012 16 1 145 57 22783678 Kululanga LI, Sundby J, Malata A, Chirwa E. Male involvement in maternity health care in Malawi. Afr J Reproductive Health / La Revue Africaine De La Santé Reproductive. 2012;16(1):145–57. 22783678 25. Matenga TFL Zulu JM Nkwemu S Shankalala P Hampanda K Men’s perceptions of sexual and reproductive health education within the context of pregnancy and HIV in zambia: a descriptive qualitative analysis BMC Public Health 8 July 2021 21 1354 10.1186/s12889-021-11430-3 PMC8268604 34238272 Matenga TFL, Zulu JM, Nkwemu S, Shankalala P, Hampanda K. Men’s perceptions of sexual and reproductive health education within the context of pregnancy and HIV in zambia: a descriptive qualitative analysis. BMC Public Health 8 July. 2021;21:1354. 10.1186/s12889-021-11430-3 PMC8268604 34238272 26. Teutsong S. Rôle du conjoint en Afrique: « c’est la femme qui fait tout ! » Une analyse qualitative du maintien d’une fécondité élevée, le cas du Cameroun. In. 2015. 27. Le Rédaction Gabon possède le Smig le plus élevé en 2023 en Afrique Subsaharienne [Internet]., Business, Finance International. &. 2024 [Accessed 29 sept 2024]. Available on: https://businessfinanceint.com/le-gabon-possede-le-smig-le-plus-eleve-en-2023-en-afrique-subsaharienne/ 28. eds18.pdf [Internet]. [Accessed 14 oct 2024]. Available on: http://cdnss.minsante.cm/sites/default/files/eds18.pdf 29. Worku EB Woldesenbet SA Poverty and inequality - but of what - as social determinants of health in africa?? Afr Health Sci Dec 2015 15 4 1330 8 10.4314/ahs.v15i4.36 PMC4765411 26958038 Worku EB, Woldesenbet SA. Poverty and inequality - but of what - as social determinants of health in Africa? Afr Health Sci Dec. 2015;15(4):1330–8. 10.4314/ahs.v15i4.36 PMC4765411 26958038 30. Chung C Lee KN Shin DW Lee SW Han K Low household income increases risks for chronic obstructive pulmonary disease in young population: a nationwide retrospective cohort study in South Korea BMJ Open Respir Res 29 July 2024 11 1 e002444 10.1136/bmjresp-2024-002444 PMC11288150 39074962 Chung C, Lee KN, Shin DW, Lee SW, Han K. Low household income increases risks for chronic obstructive pulmonary disease in young population: a nationwide retrospective cohort study in South Korea. BMJ Open Respir Res 29 July. 2024;11(1):e002444. 10.1136/bmjresp-2024-002444 PMC11288150 39074962 31. Cui X, Chang CT. How income influences health: decomposition based on absolute income and relative income effects. Int J Environ Res Public Health. oct 2021;13(20):10738. 10.3390/ijerph182010738 PMC8535401 34682479 32. Srinath A, van Merode F, Rao SV, Pavlova M. Barriers to cervical cancer and breast cancer screening uptake in low- and middle-income countries: a systematic review. Health Policy Plann. dec 2022;16(4):509. 10.1093/heapol/czac104 PMC10089064 36525529 33. Advancing health equity by addressing the social determinants of health in family medicine. (Position Paper) [Internet]. [cité 21 oct 2024]. Available on: https://www.aafp.org/about/policies/all/social-determinants-health-family-medicine-position-paper.html 34. Berkman LF, Kawachi I, Theorell T. Working Conditions and Health. In: Berkman LF, Kawachi I, Glymour MM, éditeurs. Social Epidemiology [Internet]. Oxford University Press; 2014 [Accessed 21 oct 2024]. p. 0. Available on: 10.1093/med/9780195377903.003.0005 35. Omoyeni O Tsoka-Gwegweni J Knowledge, attitudes and practices of cervical cancer screening among rural women in KwaZulu-Natal, South Africa Pan Afr Med J 2022 42 188 36212930 10.11604/pamj.2022.42.188.26172 PMC9508371 Omoyeni O, Tsoka-Gwegweni J. Knowledge, attitudes and practices of cervical cancer screening among rural women in KwaZulu-Natal, South Africa. Pan Afr Med J. 2022;42:188. 36212930 10.11604/pamj.2022.42.188.26172 PMC9508371 36. Ibrahim HA Nahari MH Alshahrani MA Al-Thubaity DD Elgzar WT El Sayed HA Cervical cancer perceived risks and associated factors among women in Saudi arabia: A cross-sectional study Afr J Reprod Health July 2022 26 7s 13 22 10.29063/ajrh2022/v26i7s.2 37585006 Ibrahim HA, Nahari MH, Alshahrani MA, Al-Thubaity DD, Elgzar WT, El Sayed HA, et al. Cervical cancer perceived risks and associated factors among women in Saudi Arabia: a cross-sectional study. Afr J Reprod Health July. 2022;26(7s):13–22. 10.29063/ajrh2022/v26i7s.2 37585006 37. Mbachu C Dim C Ezeoke U Effects of peer health education on perception and practice of screening for cervical cancer among urban residential women in south-east nigeria: a before and after study BMC Womens Health 9 June 2017 17 1 41 10.1186/s12905-017-0399-6 PMC5466744 28599635 Mbachu C, Dim C, Ezeoke U. Effects of peer health education on perception and practice of screening for cervical cancer among urban residential women in south-east nigeria: a before and after study. BMC Womens Health 9 June. 2017;17(1):41. 10.1186/s12905-017-0399-6 PMC5466744 28599635 38. Crofts V Flahault E Tebeu PM Untiet S Fosso GK Boulvain M Education efforts May contribute to wider acceptance of human papillomavirus self-sampling Int J Women’s Health 2 Feb 2015 7 149 10.2147/IJWH.S56307 PMC4321569 25674016 Crofts V, Flahault E, Tebeu PM, Untiet S, Fosso GK, Boulvain M, et al. Education efforts May contribute to wider acceptance of human papillomavirus self-sampling. Int J Women’s Health 2 Feb. 2015;7:149. 10.2147/IJWH.S56307 PMC4321569 25674016 39. Abiodun OA, Olu-Abiodun OO, Sotunsa JO, Oluwole FA. Impact of health education intervention on knowledge and perception of cervical cancer and cervical screening uptake among adult women in rural communities in Nigeria. BMC Public Health 7. aug 2014;14(1):814. 10.1186/1471-2458-14-814 PMC4133628 25103189 40. Koné-Mariko A, Mestre C. La paternalité à l’épreuve de La migration. Spirale 25. may 2018;85(1):115–27. 41. Adewumi K Oketch SY Choi Y Huchko MJ Female perspectives on male involvement in a human-papillomavirus-based cervical cancer-screening program in Western Kenya BMC Womens Health 8 Aug 2019 19 1 107 10.1186/s12905-019-0804-4 PMC6688365 31395060 Adewumi K, Oketch SY, Choi Y, Huchko MJ. Female perspectives on male involvement in a human-papillomavirus-based cervical cancer-screening program in Western Kenya. BMC Womens Health 8 Aug. 2019;19(1):107. 10.1186/s12905-019-0804-4 PMC6688365 31395060 42. de Fouw M, Stroeken Y, Niwagaba B, Musheshe M, Tusiime J, Sadayo I, et al. Involving men in cervical cancer prevention; a qualitative enquiry into male perspectives on screening and HPV vaccination in Mid-Western Uganda. PLoS ONE. jan 2023;27(1):e0280052. 10.1371/journal.pone.0280052 PMC9882699 36706114 43. Rosser JI Zakaras JM Hamisi S Huchko MJ Men’s knowledge and attitudes about cervical cancer screening in Kenya BMC Womens Health 22 Nov 2014 14 138 10.1186/s12905-014-0138-1 PMC4254217 25416335 Rosser JI, Zakaras JM, Hamisi S, Huchko MJ. Men’s knowledge and attitudes about cervical cancer screening in Kenya. BMC Womens Health 22 Nov. 2014;14:138. 10.1186/s12905-014-0138-1 PMC4254217 25416335 44. Megersa BS Bussmann H Bärnighausen T Muche AA Alemu K Deckert A Community cervical cancer screening: barriers to successful home-based HPV self-sampling in Dabat district, North gondar, Ethiopia. A qualitative study PLoS ONE 2020 15 12 e0243036 10.1371/journal.pone.0243036 33306681 PMC7732077 Megersa BS, Bussmann H, Bärnighausen T, Muche AA, Alemu K, Deckert A. Community cervical cancer screening: barriers to successful home-based HPV self-sampling in Dabat district, North gondar, Ethiopia. A qualitative study. PLoS ONE. 2020;15(12):e0243036. 33306681 10.1371/journal.pone.0243036 PMC7732077 45. Moses E Pedersen HN Wagner EC Sekikubo M Money DM Ogilvie GS Understanding men’s perceptions of human papillomavirus and cervical cancer screening in kampala, Uganda J Glob Oncol Sept 2018 4 1 9 10.1200/JGO.17.00106 PMC6223419 30241236 Moses E, Pedersen HN, Wagner EC, Sekikubo M, Money DM, Ogilvie GS, et al. Understanding men’s perceptions of human papillomavirus and cervical cancer screening in kampala, Uganda. J Glob Oncol Sept. 2018;4:1–9. 10.1200/JGO.17.00106 PMC6223419 30241236 46. Steven VJ Deitch J Dumas EF Gallagher MC Nzau J Paluku A « provide care for everyone please »: engaging community leaders as sexual and reproductive health advocates in North and South kivu, Democratic Republic of the congo Reprod Health 8 July 2019 16 1 98 10.1186/s12978-019-0764-z PMC6615084 31286984 Steven VJ, Deitch J, Dumas EF, Gallagher MC, Nzau J, Paluku A, et al. « provide care for everyone please »: engaging community leaders as sexual and reproductive health advocates in North and South Kivu, Democratic Republic of the congo. Reprod Health 8 July. 2019;16(1):98. 10.1186/s12978-019-0764-z PMC6615084 31286984 47. Chimatiro CS Hajison P Muula AS The role of community leaders on adolescent’s HIV and sexual reproductive health and rights in mulanje, Malawi Reproductive Health 14 May 2020 17 66 10.1186/s12978-020-00917-8 PMC7226947 32408906 Chimatiro CS, Hajison P, Muula AS. The role of community leaders on adolescent’s HIV and sexual reproductive health and rights in mulanje, Malawi. Reproductive Health 14 May. 2020;17:66. 10.1186/s12978-020-00917-8 PMC7226947 32408906 48. Osafo J Akotia CS Quarshie ENB Andoh-Arthur J Boakye KE Community leaders’ attitudes towards and perceptions of suicide and suicide prevention in Ghana Transcult Psychiatry June 2019 56 3 529 51 10.1177/1363461518824434 30907246 Osafo J, Akotia CS, Quarshie ENB, Andoh-Arthur J, Boakye KE. Community leaders’ attitudes towards and perceptions of suicide and suicide prevention in Ghana. Transcult Psychiatry June. 2019;56(3):529–51. 10.1177/1363461518824434 30907246 49. Kenny L Bhatia A Lokot M Hassan R Hussein Aden A Muriuki A Improving provision of family planning among pastoralists in kenya: perspectives from health care providers, community and religious leaders Glob Public Health Aug 2022 17 8 1594 610 10.1080/17441692.2021.1944263 34182886 Kenny L, Bhatia A, Lokot M, Hassan R, Hussein Aden A, Muriuki A, et al. Improving provision of family planning among pastoralists in kenya: perspectives from health care providers, community and religious leaders. Glob Public Health Aug. 2022;17(8):1594–610. 10.1080/17441692.2021.1944263 34182886 50. Sultana F Mullins R English DR Simpson JA Drennan KT Heley S Women’s experience with home-based self-sampling for human papillomavirus testing BMC Cancer 4 Nov 2015 15 849 10.1186/s12885-015-1804-x PMC4634718 26536865 Sultana F, Mullins R, English DR, Simpson JA, Drennan KT, Heley S, et al. Women’s experience with home-based self-sampling for human papillomavirus testing. BMC Cancer 4 Nov. 2015;15:849. 10.1186/s12885-015-1804-x PMC4634718 26536865 51. Ibáñez R Roura E Acera A Andújar M Pavón MÀ Bruni L HPV self-sampling among cervical cancer screening users in spain: A randomized clinical trial of on-site training to increase the acceptability Prev Med Aug 2023 173 107571 10.1016/j.ypmed.2023.107571 37308042 Ibáñez R, Roura E, Acera A, Andújar M, Pavón MÀ, Bruni L, et al. HPV self-sampling among cervical cancer screening users in Spain: a randomized clinical trial of on-site training to increase the acceptability. Prev Med Aug. 2023;173:107571. 10.1016/j.ypmed.2023.107571 37308042 52. Dzobo M, Dzinamarira T, Jaya Z, Kgarosi K, Mashamba-Thompson T. Experiences and perspectives regarding human papillomavirus self-sampling in sub-Saharan Africa: a systematic review of qualitative evidence. Heliyon [Internet]. 18 june 2024 [Accessed 6 dec 2024];10(12). Available on: https://pubmed.ncbi.nlm.nih.gov/39021965/ 10.1016/j.heliyon.2024.e32926 PMC11253232 39021965 53. Mapping evidence on the acceptability of. human papillomavirus self-sampling for cervical cancer screening among women in sub-Saharan Africa: a scoping review | BMJ Open [Internet]. [cité 6 dec 2024]. Available on: https://bmjopen.bmj.com/content/13/4/e062090 10.1136/bmjopen-2022-062090 PMC10124230 37085299 54. Evina Bolo S Kenfack B Wisniak A Tankeu G Yakam V Moukam A Factors influencing cervical cancer re-screening in a semi-rural health district of cameroon: a cohort study BMC Women’s Health 28 Jan 2024 24 1 76 10.1186/s12905-024-02917-3 PMC10822157 38281960 Evina Bolo S, Kenfack B, Wisniak A, Tankeu G, Yakam V, Moukam A, et al. Factors influencing cervical cancer re-screening in a semi-rural health district of Cameroon: a cohort study. BMC Women’s Health 28 Jan. 2024;24(1):76. 10.1186/s12905-024-02917-3 PMC10822157 38281960 55. Ubah C Nwaneri AC Anarado AN Iheanacho PN Odikpo LC Perceived barriers to cervical cancer screening uptake among women of an urban community in South-Eastern Nigeria Asian Pac J Cancer Prev 1 June 2022 23 6 1959 65 10.31557/APJCP.2022.23.6.1959 PMC9587839 35763637 Ubah C, Nwaneri AC, Anarado AN, Iheanacho PN, Odikpo LC. Perceived barriers to cervical cancer screening uptake among women of an urban community in South-Eastern Nigeria. Asian Pac J Cancer Prev 1 June. 2022;23(6):1959–65. 10.31557/APJCP.2022.23.6.1959 PMC9587839 35763637 56. Pham MA Benkortbi K Kenfack B Tincho Foguem E Sormani J Wisniak A Recruitment strategies to promote uptake of cervical cancer screening in the West region of Cameroon BMC Public Health 19 March 2022 22 1 548 10.1186/s12889-022-12951-1 PMC8933918 35305588 Pham MA, Benkortbi K, Kenfack B, Tincho Foguem E, Sormani J, Wisniak A, et al. Recruitment strategies to promote uptake of cervical cancer screening in the West region of Cameroon. BMC Public Health 19 March. 2022;22(1):548. 10.1186/s12889-022-12951-1 PMC8933918 35305588 57. Hämmerli P, Moukam AD, Wisniak A, Sormani J, Vassilakos P, Kenfack B, et al. My motivation was to save: a qualitative study exploring factors influencing motivation of community healthcare workers in a cervical cancer screening program in dschang, Cameroon. Reproductive Health. june 2022;6(1):133. 10.1186/s12978-022-01420-y PMC9167909 35668427 58. Olubodun T, Balogun MR, Odeyemi AK, Odukoya OO, Ogunyemi AO, Kanma-Okafor OJ, et al. Barriers and recommendations for a cervical cancer screening program among women in low-resource settings in Lagos nigeria: a qualitative study. BMC Public Health. oct 2022;12(1):1906. 10.1186/s12889-022-14314-2 PMC9560022 36224656 59. Thoma B Personal reflections on exploring social media in medicine Int Rev Psychiatry Apr 2015 27 2 161 6 10.3109/09540261.2015.1005058 25750994 Thoma B. Personal reflections on exploring social media in medicine. Int Rev Psychiatry Apr. 2015;27(2):161–6. 10.3109/09540261.2015.1005058 25750994 60. actiPLANS [Internet]. 2023 [cité 28 sept 2024]. Understanding public holidays: types, rules, and benefits. Disponible sur: https://www.actiplans.com/types-of-leave-glossary/public-holidays 61. Diallo BA Usuf E Ceesay O D’Alessandro U Roca A Martinez-Alvarez M Clinical research on COVID-19: perceptions and barriers to participation in the Gambia BMJ Glob Health Feb 2022 7 2 e007533 10.1136/bmjgh-2021-007533 PMC8861886 35190459 Diallo BA, Usuf E, Ceesay O, D’Alessandro U, Roca A, Martinez-Alvarez M. Clinical research on COVID-19: perceptions and barriers to participation in the Gambia. BMJ Glob Health Feb. 2022;7(2):e007533. 10.1136/bmjgh-2021-007533 PMC8861886 35190459 ",
  "metadata": {
    "Title of this paper": "Clinical research on COVID-19: perceptions and barriers to participation in the Gambia",
    "Journal it was published in:": "BMC Health Services Research",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12495857/"
  }
}