{
  "title": "Paper_1072",
  "abstract": "pmc PLoS One PLoS One 440 plosone plos PLOS One 1932-6203 PLOS PMC12478943 PMC12478943.1 12478943 12478943 41021622 10.1371/journal.pone.0332703 PONE-D-24-53463 1 Research Article Medicine and Health Sciences Oncology Cancer Treatment Medicine and Health Sciences Oncology Cancers and Neoplasms Breast Tumors Breast Cancer Medicine and Health Sciences Oncology Cancers and Neoplasms Lung and Intrathoracic Tumors Medicine and Health Sciences Oncology Cancers and Neoplasms Colorectal Cancer Medicine and Health Sciences Gastroenterology and Hepatology Gastrointestinal Cancers Medicine and Health Sciences Oncology Cancers and Neoplasms Head and Neck Cancers Medicine and Health Sciences Oncology Cancers and Neoplasms Genitourinary Tract Tumors Prostate Cancer Medicine and Health Sciences Urology Prostate Diseases Prostate Cancer Medicine and Health Sciences Oncology Cancers and Neoplasms Carcinoma Hepatocellular Carcinoma Medicine and Health Sciences Oncology Cancers and Neoplasms Gastrointestinal Tumors Hepatocellular Carcinoma Medicine and Health Sciences Gastroenterology and Hepatology Liver Diseases Hepatocellular Carcinoma New estimates of the costs of adverse events in patients with cancer New estimates of the costs of adverse events in patients with cancer https://orcid.org/0009-0006-4803-3540 Patel Achal Data curation Formal analysis Project administration Software Validation Visualization Writing – review & editing * https://orcid.org/0000-0002-4416-4897 Schuldt Robert Data curation Formal analysis Project administration Software Validation Visualization Writing – review & editing Sussell Jesse Conceptualization Project administration Supervision Visualization Writing – review & editing  Public Affairs and Access, Genentech, South San Francisco, California, United States of America Marchetti Monia Editor  Azienda Ospedaliera Universitaria SS Antonio e Biagio e Cesare Arrigo, Alessandria, University of Eastern Pedemont, ITALY * E-mail: patel.achal@gene.com Competing Interests: 29 9 2025 2025 20 9 496058 e0332703 3 12 2024 3 9 2025 29 09 2025 30 09 2025 01 10 2025 © 2025 Patel et al 2025 Patel et al https://creativecommons.org/licenses/by/4.0/ This is an open access article distributed under the terms of the Creative Commons Attribution License New estimates of the costs of adverse events in patients with cancer. 20 9 29 9 2025 e0332703 e0332703 PLoS One 10.1371/journal.pone.0332703 41021622 New estimates of the costs of adverse events in patients with cancer. 20 9 29 9 2025 e0332703 e0332703 PLoS One 10.1371/journal.pone.0332703 41021622 The cost of adverse events (AEs) is a critical component of healthcare economic models for cancer treatment; however, few comprehensive estimates of these costs exist. Previous studies focused on costs related to specific AEs, cancer types, or treatment regimens. This study assesses the incremental costs of AEs across 13 cancer types by applying the most current diagnosis schema (International Statistical Classification of Diseases and Related Health Problems [ICD-10]) to patients diagnosed between 2016 and 2022. Data were acquired from US insurance claims and included adult patients who were diagnosed and treated for breast, pancreatic, bladder, lung, prostate, colorectal, skin, liver, head and neck, non-Hodgkin lymphoma, follicular lymphoma, multiple myeloma, or chronic lymphocytic leukemia cancer. We selected 54 AEs for analysis based on their frequency of occurrence, relevance based on severity, and availability of ICD-10 diagnostic codes. We matched patient treatment episodes (the period from initiation of a distinct treatment regimen until discontinuation, change of treatment, or end of data availability) for patients experiencing a specific AE to treatment episodes of similar patients not experiencing that same AE in a 1:1 ratio. We generated estimates for AEs of any severity, severe AEs, and individual tumor types. Our analyses evaluate 392,566 treatment episodes from 110,791 patients. In pooled analyses across tumor types, incremental costs for AEs of any severity (with ≥ 100 treatment episodes) ranged from - $488 for photosensitivity to $29,331 for allergic reaction. Incremental costs for severe AEs (with ≥ 50 treatment episodes) ranged from $16 for dizziness to $18,841 for gastrointestinal bleeding. This study provides a comprehensive assessment of the economic burden of AEs in cancer care and generates a range of estimates to be used as inputs in future economic models. http://dx.doi.org/10.13039/100004328 Genentech https://orcid.org/0009-0006-4803-3540 Patel Achal This study was funded by Genentech, Inc. The sponsor participated in the design, analysis, and interpretation of the study. pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement yes pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes Data Availability This analysis was conducted using commercially licensed medical and pharmacy US insurance claims data. The specific data asset is Pharmetrics Plus, which is licensed by IQVIA. The study team did not receive any special access beyond that granted to other researchers with licensed access to the data. Interested parties may contact IQVIA for access to Pharmetrics Plus: +1 866 267 4479 or https://www.iqvia.com/contact Data Availability This analysis was conducted using commercially licensed medical and pharmacy US insurance claims data. The specific data asset is Pharmetrics Plus, which is licensed by IQVIA. The study team did not receive any special access beyond that granted to other researchers with licensed access to the data. Interested parties may contact IQVIA for access to Pharmetrics Plus: +1 866 267 4479 or https://www.iqvia.com/contact 1. Introduction To improve our understanding of healthcare and health policy, economic models provide insight on the tradeoff between costs and benefits of different therapeutic interventions. In many countries, sophisticated health economic models are required for regulatory approval, along with a demonstration of clinical efficacy. In general, this takes the form of a cost-effectiveness or cost-utility analysis, in which the estimated costs (e.g., cost of additional health screening or preventative medications) and benefits (e.g., overall survival or quality-adjusted life years) of a novel therapeutic approach are weighed against each other. These costs and benefits are usually estimated relative to some comparator, typically the current standard-of-care therapy. For example, in oncology, the costs and benefits of targeted therapy have frequently been modeled relative to chemotherapy or older generations of targeted therapy. In cost-benefit analyses, it is important to measure all costs of a therapeutic approach in addition to the cost of medications [ 1 In oncology, the primary driver of cost differences is the relative price of the therapeutic regimens. However, adverse events (AEs) represent an important ancillary source of cost differences. For example, an economic study on metastatic melanoma found that the incremental costs associated with specific treatment-related AEs (TRAEs) were high, especially so for AEs related to metabolic and nutritional disorders ($9,135 per 30-day period) [ 2 3 4 Conceptually, the expected value cost of an AE is the product of the event rate over time and the average payer cost of treating the event when it occurs. However, there is frequently a paucity of information related to the estimated average cost of treating any individual AE. Parameterization of an economic model with accurate AE cost data can be difficult for a number of reasons: studies that evaluate the costs of AEs frequently only consider AEs experienced by patients with a single tumor type (reducing external validity) and are often conducted using a variety of methodologies (limiting comparability) or use a micro-costing approach, which is known to underestimate total associated costs [ 5 7 8 10 5 This study fills several gaps currently present in the literature. The timeframe of our dataset (2016−2022) is the most recent among studies considering multiple tumor types. We have also applied a modern diagnosis schema (International Statistical Classification of Diseases and Related Health Problems [ICD]-10). We generate estimates for more AEs (54 vs 36), stratified across a larger number of distinct tumor types (13 vs 8) relative to the study by Wong et al [ 5 2. Materials and methods 2.1 Data source This study was conducted using the IQVIA PharMetrics ® 2.2 Overview of study design In this study, we sought to estimate the incremental cost impact of experiencing different AEs on the total cost of care as measured in healthcare claims data. We considered three different levels of analysis. Our primary analysis was to estimate the cost of individual AEs (e.g., nausea) on healthcare costs in patients with cancer, pooled across different tumor types. In a secondary analysis and consistent with Wong et al. [ 5 2.3 Patient selection 2.3.1 Treatment group selection. Data were de-identified according to Health Insurance Portability and Accountability Act patient confidentiality requirements, and institutional review board approval was not required. Adult patients were selected for inclusion in the treatment group if they were initially diagnosed with one of the 13 cancer types included in this study between 2016 and 2022 and if they were subsequently diagnosed with one of the 54 AEs of interest within a given treatment episode (see below for treatment episode definitions) ( Fig 1 10.1371/journal.pone.0332703.g001 Fig 1 Attrition table. a 2.3.2 Control group selection. The inclusion criteria for the matching control group were the same as the treatment group, except patients in the control group were required to not nausea, 2.4 Outcomes The study outcome is the average incremental difference in total medical spending between the matched pairs of patients, each of which is defined by either experiencing (treatment group) or not experiencing (matched controls group) the AE of interest during the treatment episode being considered. 2.5 Treatment episode definitions Following Wong et al., each patient was allowed to complete multiple treatment episodes for the analysis [ 5 2.6 Classification and matching of treatment episodes The matching procedure we use is similar to that described in Wong et al [ 5 The set of AEs included in this study was selected first by examining clinical practice guidelines for the types of treatments used for the cancers included in this study. From the list of 361 AEs mentioned in the product inserts of these treatments, AEs were selected/combined for this study based on the frequency of mention, their relevance based on severity, and the availability of respective diagnostic codes from ICD-10-CM. A total of 54 AEs associated with these treatments were included in this study. Following the literature [ 5 11 12 Treatment episodes for an AE were matched to similar treatment episodes without that same AE in a 1:1 ratio. A risk to the validity of comparing healthcare costs within treatment episodes is that the duration of treatment episodes will vary from patient to patient; as a result, the time at risk for cost accrual will differ between patients. To control for this potential bias, the duration of the treatment episodes for patients in the matched control group was truncated to be equal to the duration of the treatment episode for patients experiencing the AE of interest ( Fig 2 10.1371/journal.pone.0332703.g002 Fig 2 Adverse event (AE) occurrence in the context of distinct treatment episodes [ 5 a b 2.7 Statistical considerations In the main analysis (assessment of AE costs in a pooled population of patients with cancer), we applied three complementary bias reduction techniques. First, patients were exact matched by tumor type. For a patient with tumor type i, i. S1 Fig The standard assumptions of propensity matching and regression adjustment apply to this analysis. A potential source of bias will remain when there are factors correlated with both the outcome (cost differences) and the treatment (occurrence vs. non-occurrence of AEs of interest), and when those factors are not included in either the propensity model or the outcomes model. For the secondary analysis (cost estimates for patients experiencing severe AEs), two covariate factors were included: the count of potential co-occurring severe AEs and the count of potential co-occurring AEs, regardless of severity. For example, severe dyspnea and severe pain were correlated in patients with breast cancer ( S2 Fig For the tertiary analysis (within-tumor stratified cost estimation), exact matching based on tumor type is implied by design. To perform the propensity score match in the AE analysis, a minimum N value of 100 treatment episodes was required. For the subsequent outcomes model, only AEs with ≥ 50 matched pairs (≥ 100 treatment episodes) were reported. Finally, we conducted standard regression diagnostics on the outcomes models, including plotting residuals against fitted values to identify instances of nonlinearity. The volume of distinct regression models conducted within this study (1,404) precludes summary reporting of the results of these diagnostic tests. 3. Results 3.1 Characteristics across matched treatment episodes The selected 110,791 patients had a total of 392,566 treatment episodes across 54 AEs ( Table 1 10.1371/journal.pone.0332703.t001 Table 1 Treatment episodes characteristics. Treatment episodes a 392,566  Age, median (IQR) 60 (53, 64)  Female, n (%) 228,790 (58.3)  US Region, n (%) East 69,160 (17.6) Midwest 108,657 (27.7) South 159,097 (40.5) West 55,641 (14.2) Other 11 (<0.1)  Product type, n (%) Consumer directed 9,099 (2.3) HMO 72,162 (18.4) POS 23,463 (6.0) PPO 281,922 (71.8) Unknown 5,920 (1.5)  Payer type, n (%) Commercial 225,149 (57.4) Medicare Advantage 36,525 (9.3) Medicare Supplemental 17,086 (4.4) Self-pay 111,409 (28.4) Unknown 2,397 (0.6)  Treatment type, n (%) Metastatic pre-treatment 220,748 (56.2) Adjuvant therapy pre-treatment 114,051 (29.1)  No. of episodes, n (%) 1 172,176 (43.9) 2 115,546 (29.4) 3 104,844 (26.7)  LOT index year, n (%) 2016 6,955 (1.8) 2017 72,665 (18.5) 2018 82,780 (21.1) 2019 88,387 (22.5) 2020 83,708 (21.3) 2021 57,587 (14.7) 2022 484 (0.1)  LOT number, n (%) 1 287,210 (73.2) 2 78,246 (19.9) 3 27,110 (6.9)  Type of studied cancer, n (%) Breast 117,322 (29.9) Lung 55,834 (14.2) Colorectal 45,051 (11.5) Skin 42,804 (10.9) Non-Hodgkin lymphoma 26,610 (6.8) Head and neck 20,947 (5.3) Pancreatic 20,149 (5.1) Prostate 18,357 (4.7) Liver 15,070 (3.8) Multiple myeloma 13,976 (3.6) Bladder 10,058 (2.6) CLL 3,518 (0.9) Follicular lymphoma 2,870 (0.7) CLL, chronic lymphocytic leukemia; HMO, health maintenance program; LOT, line of therapy; POS, point of service; PPO, preferred provider organization. a The number of treatment episodes matched across AEs ranged from 241,487 (pain) to 135 (encephalopathy) ( Table 2 Table 2 10.1371/journal.pone.0332703.t002 Table 2 Prevalence and characteristics of matched treatment episodes by AE. Adverse event Proportion of episodes with AE of any severity (among all episodes), % Matched episodes, n Acute kidney failure 16.1 63,387 Agranulocytosis (neutropenia/leukopenia) 18.3 71,704 Allergic reaction and application/administration site reaction 0.4 1,392 Anemia 12.3 48,432 Arrhythmia 14.9 58,548 Chest pain/angina 26.4 103,722 CNS hemorrhage 4.9 19,283 Colitis 28.8 113,022 Constipation 3.6 14,125 Cystitis/urinary tract infection 12.4 48,804 Dehydration 23.0 90,246 Diarrhea 4.9 19,367 Dizziness 7.6 29,794 Dyspnea 23.2 91,194 Electrolyte imbalance 27.0 105,870 Elevated liver transaminase levels 0.8 3,307 Encephalopathy <0.1 135 Extravasation <0.1 187 Fatigue/generalized weakness/asthenia 28.7 112,659 Generalized edema 1.0 3,771 GI/anal fistula 0.4 1,534 GI bleeding 2.3 8,970 GI perforation 0.6 2,496 Headache/migraine 53.8 211,192 Hearing loss 0.1 546 Heart failure 1.7 6,486 Hematuria 13.8 54,076 Hyperglycemia 3.8 15,072 Hyperlipidemia 27.6 108,210 Hypertension 0.2 758 Hypotension 0.3 1,330 Hypothyroidism/hyperthyroidism 1.3 5,252 Hypoxemia 4.7 18,466 Ketoacidosis 0.3 1,222 Lymphocytopenia 0.5 1,942 Nausea 22.3 87,653 Pain 61.5 241,487 Pancreatitis 0.9 3,457 Pancytopenia 7.8 30,551 Photosensitivity 0.1 508 Pneumonitis/pneumonia 10.8 42,277 Polyneuropathy 6.6 25,990 Proteinuria 5.2 20,291 Pruritus/erythema/dermatitis 13.8 54,164 Psychiatric disorders 36.1 141,628 Retinal/corneal/sclera problems 5.8 22,931 Sepsis 11.7 45,821 Stomatitis 2.8 10,849 Thrombocytopenia 13.1 51,453 Thromboembolic event 23.5 92,270 Upper respiratory infections 9.0 35,289 Vomiting 36.3 142,541 Weight gain 0.8 2,961 Weight loss 7.4 28,873 AE, adverse event; GI, gastrointestinal; CNS, central nervous system. 3.2 Healthcare costs The pooled incremental healthcare costs related to AEs of any severity ranged from -$488 for photosensitivity to $29,331 for allergic reaction and application/administration site reaction ( Fig 3 Fig 3 10.1371/journal.pone.0332703.g003 Fig 3 Incremental costs per matched treatment episode a Incremental costs reported as means (95% confidence interval) in US dollars. AE, adverse event; GI, gastrointestinal; CNS, central nervous system. a The pooled incremental healthcare costs associated with severe AEs ranged from $16 for dizziness to $18,841 for GI bleeding ( Fig 4 Fig 4 10.1371/journal.pone.0332703.g004 Fig 4 Incremental costs per matched treatment episode a Incremental costs reported as means (95% confidence interval) in US dollars. AEs, adverse events; CNS, central nervous system; GI, gastrointestinal. a For common cancer types that represented greater than or equal to 6% of the selected patient population (breast [29.9%], lung [14.2%], colorectal [11.5%], skin [10.9%], non-Hodgkin lymphoma [6.8%]), GI perforation and generalized edema were commonly the most costly AEs of any severity ( Table 3 Table 3 Table 4 Table 4 10.1371/journal.pone.0332703.t003 Table 3 Mean incremental costs (in US dollars) per treatment episode—AEs of any severity, stratified by common tumor type (≥6% of selected patients). Each n indicates the number of treatment episodes. Adverse event, $ Breast (n = 117,322) Lung (n = 55,834) Colorectal (n = 45,051) Skin (n = 42,804) Non-Hodgkin lymphoma (n = 26,610) Acute kidney failure 8,895.76 4,259.68 7,190.18 3,505.82 12,433.98 Agranulocytosis (neutropenia/leukopenia) 5,413.75 2,065.66 10,902.74 3,943.75 9,962.04 Allergic reaction and application/administration site reaction 12,903.34 – – 65,814.34 26,601.09 Anemia 5,687.90 4,027.30 3,132.44 6,613.15 7,298.97 Arrhythmia 8,537.93 11,627.40 5,582.48 7,951.48 11,222.62 CNS hemorrhage 10,954.08 6,763.96 5,402.52 7,108.33 17,604.06 Chest pain/angina 10,480.51 6,162.70 −1,637.54 6,566.36 7,866.06 Colitis 7,346.59 4,351.42 −1,145.71 7,756.32 12,742.22 Constipation 10,345.46 7,193.30 6,716.07 5,784.16 4,683.02 Cystitis/urinary tract infection 5,557.54 4,835.92 −633.38 6,106.31 10,242.15 Dehydration 1,574.27 1,661.09 −1,671.00 381.44 3,684.12 Diarrhea −1,562.81 1,272.80 −116.61 8,675.80 2,178.41 Dizziness 7,754.53 5,216.65 399.32 6,432.51 9,490.52 Dyspnea 6,805.41 3,450.07 985.94 4,033.81 5,892.07 Electrolyte imbalance 7,309.92 4,941.51 4,458.96 5,950.57 9,953.76 Elevated liver transaminase levels 6,408.31 4,476.71 1,708.77 11,086.15 20,852.48 Encephalopathy −11,849.00 – – – – Extravasation 415.85 – – – Fatigue/generalized weakness/asthenia 6,777.15 4,260.47 504.77 5,846.86 7,129.52 GI/anal fistula 3,311.63 – 12,135.65 364.85 – GI bleeding 14,728.61 8,803.66 2,796.57 1,800.80 12,235.31 GI perforation 18,223.13 23,428.75 16,836.23 12,803.07 – Generalized edema 9,290.14 12,217.72 22,572.37 14,982.55 11,667.39 Headache/migraine 6,859.83 4,670.86 −553.62 6,661.58 4,508.23 Hearing loss 5,035.74 – – – – Heart failure −300.52 5,717.86 −2,199.89 5,378.08 10,881.46 Hematuria 8,024.32 5,627.13 1,794.61 4,679.72 9,027.99 Hyperglycemia 9,496.42 8,207.57 9,444.42 10,125.02 18,396.79 Hyperlipidemia 5,033.31 9,329.02 4,900.21 3,195.61 5,061.72 Hypertension 9,191.68 – – – – Hypotension 8,312.95 10,615.24 – – – Hypothyroidism/hyperthyroidism 10,124.33 5,152.00 3,178.06 10,073.85 7,646.64 Hypoxemia 11,299.67 7,080.79 1,253.62 10,523.62 4,819.06 Ketoacidosis 12,064.15 5,794.78 – 22,940.21 27,767.77 Lymphocytopenia 9,698.70 16,253.98 – 7,485.89 16,060.83 Nausea 5,807.81 8.31 1,748.84 3,861.25 4,711.33 Pain 5,166.13 8,324.04 3,027.68 3,680.63 5,203.78 Pancreatitis 12,436.07 12,205.91 3,941.58 11,718.00 23,656.66 Pancytopenia 6,684.39 2,968.81 6,398.27 1,544.49 14,010.04 Photosensitivity 3,595.23 – – −6,354.68 – Pneumonitis/pneumonia 7,716.51 5,753.29 8,207.10 5,997.89 10,221.94 Polyneuropathy 3,050.80 6,388.98 −340.71 5,150.75 12,031.50 Proteinuria 6,974.85 4,195.63 3,538.41 7,872.77 15,813.17 Pruritus/erythema/dermatitis 8,849.81 3,167.64 4,370.41 3,178.01 10,620.25 Psychiatric disorders 9,152.85 7,845.05 2,988.72 6,262.40 9,130.57 Retinal/corneal/sclera problems 7,352.14 7,294.46 −4,091.36 8,117.46 2,502.73 Sepsis 10,804.36 7,742.44 7,114.58 9,818.53 9,326.05 Stomatitis 10,272.86 19,490.92 −2,504.60 −540.01 17,778.12 Thrombocytopenia 5,459.66 5,849.81 4,362.03 7,658.69 11,675.61 Thromboembolic event a 10,912.36 6,965.93 4,876.70 6,787.82 11,853.90 Upper respiratory infections 10,405.34 8,386.01 5,023.67 6,138.23 11,370.00 Vomiting 4,912.39 2,439.63 1,322.40 5,293.66 6,774.34 Weight gain 8,071.26 9,288.42 6,418.35 8,568.07 4,209.63 Weight loss 7,339.50 6,129.05 4,742.37 6,693.16 3,788.98 AEs, adverse events; CNS, central nervous system; GI, gastrointestinal. Cell shading is white for those with >1,500 matched treatment episodes, light gray for those with 1,000–1,500, light peach for those with 500 to <1,000, and light rose for those with <500. En dash indicates insufficient sample size for robust statistical model. a 10.1371/journal.pone.0332703.t004 Table 4 Mean incremental costs (in US dollars) per treatment episode—AEs of any severity in rarer tumor types (<6% of selected patients). Each n indicates the number of episodes. Adverse event, $ Head and neck (n = 20,947) Pancreatic (n = 20,149) Prostate (n = 18,357) Liver (n = 15,070) Multiple myeloma (n = 13,976) Bladder (n = 10,058) CLL (n = 3,518) Follicular lymphoma (n = 2,870) Acute kidney failure 678.49 6,883.87 1,210.45 4,428.24 12,012.33 6,039.26 9,211.67 13,251.53 Agranulocytosis (neutropenia/leukopenia) 2,052.63 2,437.22 4,678.35 3,640.87 12,688.41 6,948.50 7,827.08 13,488.18 Allergic reaction and application/administration site reaction – – – – – – – – Anemia −395.09 −46.90 6,418.10 1,858.70 14,836.66 −121.45 10,667.45 11,109.01 Arrhythmia 1,662.11 −1,667.05 235.53 8,459.45 13,599.63 −1,838.25 20,823.13 11,552.96 CNS hemorrhage −2,702.64 7,729.83 −1,337.06 −2,155.70 8,737.45 4,908.49 6,017.08 −1,709.87 Chest pain/angina −75.61 −2,186.78 81.32 4,494.16 13,171.00 −647.41 8,498.40 3,625.22 Colitis 1,978.59 −1,553.93 5,023.69 3,925.66 12,192.12 1,547.04 22,144.12 18,022.34 Constipation 2,492.98 2,713.88 13,158.46 6,677.76 20,098.56 3,111.88 – – Cystitis/urinary tract infection 2,218.37 726.30 3,137.97 −5,895.79 15,162.37 1,868.52 10,887.99 5,199.02 Dehydration −2,228.98 −6,338.62 −2,120.52 2,845.45 11,201.98 251.59 1,139.02 3,205.72 Diarrhea 1,043.96 2,231.18 −3,666.53 −888.56 15,454.21 3,628.27 – – Dizziness −3,027.12 1,840.65 −729.63 3,697.33 2,359.80 3,885.10 707.24 9,204.90 Dyspnea 6,300.00 1,548.80 3,860.89 −158.99 7,871.06 5,002.49 14,907.25 10,750.11 Electrolyte imbalance 3,087.46 −2,517.13 3,995.85 2,157.05 13,501.56 5,532.40 6,153.71 2,488.03 Elevated liver transaminase levels – −9,577.26 – 4,881.07 – −11,537.68 – – Encephalopathy – – – – – – – – Extravasation – – – – – – – – Fatigue/generalized weakness/asthenia 1,470.46 −2,296.83 978.87 −3,857.79 13,241.22 2,114.03 3,562.73 8,568.11 GI/anal fistula – – – – – – – – GI bleeding 11,625.43 16,987.34 16,437.49 24,431.48 23,881.17 2,500.15 – – GI perforation – – – – – – – – Generalized edema – 11,587.49 – −8,544.59 10,518.36 – – – Headache/migraine 1,272.83 −7,457.95 −889.37 8,100.25 14,962.34 2,552.60 29,364.80 14,790.12 Hearing loss – – – – – – – – Heart failure – 6,908.40 6,076.97 −4,730.66 15,347.91 9,917.53 – – Hematuria 5,828.59 1,275.69 2,488.99 3,860.10 9,233.85 918.41 10,320.10 4,499.17 Hyperglycemia 3,108.07 18,951.73 189.36 358.67 7,352.43 6,763.57 25,927.74 – Hyperlipidemia 6,362.37 683.16 −1,116.52 7,592.66 8,340.68 −3,004.71 3,354.53 −615.37 Hypertension – – – – – – – – Hypotension – – – – – – – – Hypothyroidism/hyperthyroidism 7,557.83 17,196.44 −1,790.38 20,609.68 – 1,999.52 – – Hypoxemia 6,968.12 −2,623.40 13,826.46 6,908.56 8,629.45 18,892.76 29,790.45 – Ketoacidosis – – – – – – – – Lymphocytopenia – – – – 15,826.08 – – – Nausea −478.13 1,216.42 −4,869.59 710.11 9,985.26 6,187.28 7,565.52 6,092.35 Pain 2,793.31 −22,271.41 1,226.33 3,871.79 13,623.97 −1,505.53 10,337.42 12,468.58 Pancreatitis 8,065.38 −2,829.69 – 31,783.93 – – – – Pancytopenia 4,967.65 7,104.68 −4,023.21 −5,661.94 15,510.33 8,256.02 30,018.10 32,941.12 Photosensitivity – – – – – – – – Pneumonitis/pneumonia 2,520.85 1,730.15 1,045.37 4,579.83 9,480.81 6,649.61 9,594.75 14,818.13 Polyneuropathy −3,072.51 7,749.74 19,991.99 −5,746.63 9,296.09 11,443.68 – – Proteinuria −215.76 2,429.79 −1,343.95 629.81 13,556.10 2,933.77 19,191.10 −6,547.13 Pruritus/erythema/dermatitis −314.22 −1,635.45 3,236.88 1,807.42 14,473.58 −90.81 2,410.03 −831.99 Psychiatric disorders 17.88 4,448.07 2,051.09 1,193.81 14,206.25 4,373.72 7,866.47 1,889.69 Retinal/corneal/sclera problems 6,295.02 −3,755.37 1,784.14 10,873.38 15,515.72 5,011.53 −5,080.06 −1,918.59 Sepsis 7,728.41 493.50 6,979.59 5,963.05 11,377.64 −3,625.34 10,764.94 14,398.21 Stomatitis 2,263.37 1,646.20 – −8,126.02 −952.72 – – – Thrombocytopenia −401.60 4,091.59 2,168.72 6,345.95 15,270.12 4,552.65 15,001.07 8,307.35 Thromboembolic event 10,108.10 −616.23 4,434.61 2,298.96 14,140.23 2,884.20 12,914.84 7,378.80 Upper respiratory infections 186.27 −138.33 1,416.36 7,686.29 11,690.38 3,230.78 11,032.60 1,697.06 Vomiting 184.94 −319.14 3,674.85 3,851.54 11,910.52 2,945.53 6,926.00 2,203.55 Weight gain – – 2,829.18 – – – – – Weight loss 1,911.26 112.46 5,555.58 −2,964.51 13,484.73 1,907.65 8,598.13 −19,596.61 AEs, adverse events; CLL, chronic lymphocytic leukemia; CNS, central nervous system; GI, gastrointestinal. Cell shading is white for those with >1,500 matched treatment episodes, light gray for those with 1,000–1,500, light peach for those with 500 to <1,000, and light rose for those with <500. En dash indicates insufficient sample size for robust statistical model. a 4. Discussion Following guidance by the Professional Society for Health Economics and Outcomes Research, it is critical to evaluate the incremental cost differences of all types (e.g. AEs) in addition to treatment costs [ 1 5 7 5 It is useful to consider the methodology of this study in the context of the existing literature. The ideal measurement of the cost of the occurrence of a given AE in a patient with cancer would be as follows. First, the average total healthcare costs incurred by a group of patients with that AE would be calculated. Second, average total healthcare costs would be calculated for a group of control patients not experiencing the AE but otherwise identical to the first group in every way. Finally, the cost of the AE would be calculated as the difference between the two quantities. Because randomization of patients to experience or not experience AEs is not possible, real-world designs such as ours are the only feasible way to perform such analyses. While there are many such analyses in the extant literature, most of those focus on AEs costs for patients with a specific tumor type, [ 13 15 16 18 19 20 Ours is not the first study of AE costs to recognize the importance of co-occurring AEs; Wong et al. described it as a potential explanation for negative point estimates [ 5 S2 Fig The results of this study demonstrated that AE-related healthcare costs were considerable for both common and rare cancer types. Although there were commonalities in higher-cost AEs across common cancer types, the actual cost estimates can have a wide range depending on the cancer type. For example, generalized edema is noted as a costly AE in common cancers, with a range from $9,290 in breast cancer to $22,572 in colorectal cancer. Greater variation of AE costs was seen among rare cancer types. For example, the incremental cost per treatment episode of pancytopenia ranged from –$5,662 in liver cancer to $32,941 in follicular lymphoma. These results could be due in part to the inherently smaller patient numbers available for these cancers, making outlier values more influential on the reported means. Larger sample sizes will be needed to better stratify high- and low-cost AEs for rare cancer types. In general, for economic models involving rare cancers, it may be preferable to use estimates from the pooled models (i.e., estimates pooled across all tumor types, as the benefit of reduced variance may outweigh potential introduced bias). Finally, estimates from this study that are negative should not be interpreted as evidence that the AE in question is cost-saving, but rather as a reflection of the large, estimated error due to the relatively small number of matched pairs. For example, in general, negative sample estimates are more likely to occur when the true population mean difference is closer to zero. As such, negative point estimates here should be interpreted with caution. Another potential explanation is that, in order to boost sample size, our study allowed AEs to occur in any diagnosis position. Negative point estimates could be partially explained by matching in which control patients who have the AE in question also have another, more expensive condition in a higher diagnosis line. A final possible explanation for negative point estimates is the occurrence of AEs not included in our study design. For example, across all cancers, we estimated the incremental cost of the AE photosensitivity to be -$488. If photosensitivity has a strong negative correlation with an AE not included in our design, and if the cost of treating that AE is large, then our estimates of the cost of treating photosensitivity in these patients would be biased downwards. This suggests that the co-occurrence of AEs is an important area for future research. Severe AEs tend to cost more than less severe AEs due to the associated hospital stay inherent in the definition of a severe AE. This holds true in this analysis where the mean cost of any AE is $6,697 vs $9,305 for a severe AE. However, the costliest AE of any severity was $29,331 for allergic reaction which was higher than the highest-cost severe AE (GI bleeding, $18,841). This difference is in part due to the lack of an estimate for severe allergic reaction, so no direct comparison is possible in this analysis. Additionally, severe AE estimates were generated from a much smaller set of treatment episodes than that for AEs of any severity, leading to greater variability of estimates. A fully comprehensive comparison of our results with the existing literature is not feasible because we generate several hundred distinct point estimates (for example, the incremental cost of heart failure in lung cancer versus the incremental cost of severe pain in multiple myeloma). In general, and as would be expected, there is variability in both population and design in the existing literature. For example, Engel-Nitz et al. (2020) estimated the costs of several common AEs in first-line non-small cell lung cancer (NSCLC) [ 19 14 There are several limitations in this study. The validity of the results of propensity score matching and regression analysis are conditional on the assumption that, after matching and modeling, there remain no factors that correlate to both the outcome (healthcare costs) and the treatment variable (the occurrence of the AE of interest). If this assumption is violated, that produces a source of bias in these results. Another limitation is that claims data contain limited information on the underlying cause of a diagnosis; therefore, AEs could not be directly linked to a treatment or underlying disease. Additionally, claims data do not provide information on the severity of disease (cancer stage) or course of disease. Furthermore, the population that was analyzed here was a pooled population of patients with either commercial insurance or Medicare Advantage. As a result, the external validity of this analysis is limited to that population. Costs for patients with other types of insurance, or with no insurance, are likely to differ from the estimates presented here. Finally, there was a limited sample of severe AEs and a limited number of many of the specific tumor types selected for analysis; as a result, there is greater uncertainty in our estimates of the cost of AEs in these populations. 5. Conclusions This study applied the design of Wong et al. to an updated patient data set with more tumor types and AEs and improved upon its methodology by applying the more up-to-date and more accurate ICD-10 diagnosis schema. These results are not intended to directly inform decision-making by payers, providers, or government actors. Rather, by providing detailed estimates of the cost of common, cancer-related AEs, this study improves the ability of health economists to accurately characterize incremental cost differences between different regimens for the treatment of cancer. It is our hope that the results generated here will be utilized as inputs into comparative models (e.g., cost-effectiveness models, treatment impact models) by the larger health economics community. Supporting information S1 Fig Correlation matrix for AEs of any severity in breast cancer cohort. AE, adverse event; CNS, central nervous system; GI, gastrointestinal. a b c d (TIF) S2 Fig Correlation matrix for severe AEs a AE, adverse event. a b c d (TIF) The authors are grateful to Justin Nedzesky for early contributions he made to the design of this study. We are also grateful to Will Wong for his feedback on the study protocol and on early versions of this manuscript. Medical writing support provided by Lidija Garan, PhD, of Nucleus Global, an Inizio company. References 1 Garrison LP Jr Neumann PJ Willke RJ Basu A Danzon PM Doshi JA et al A Health Economics Approach to US Value Assessment Frameworks-Summary and Recommendations of the ISPOR Special Task Force Report [7] Value Health 2018 21 2 161 5 doi: 10.1016/j.jval.2017.12.009 29477394 2 Arondekar B Curkendall S Monberg M Mirakhur B Oglesby AK Lenhart GM et al Economic burden associated with adverse events in patients with metastatic melanoma J Manag Care Spec Pharm 2015 21 2 158 64 doi: 10.18553/jmcp.2015.21.2.158 25615005 PMC10397691 3 Copley-Merriman C Stevinson K Liu FX Wang J Mauskopf J Zimovetz EA et al Direct costs associated with adverse events of systemic therapies for advanced melanoma: Systematic literature review Medicine (Baltimore) 2018 97 31 doi: 10.1097/MD.0000000000011736 30075584 PMC6081130 4 McGregor B Geynisman DM Burotto M Porta C Suarez C Bourlon MT et al Grade 3/4 Adverse Event Costs of Immuno-oncology Combination Therapies for Previously Untreated Advanced Renal Cell Carcinoma Oncologist 2023 28 1 72 9 doi: 10.1093/oncolo/oyac186 36124890 PMC9847521 5 Wong W Yim YM Kim A Cloutier M Gauthier-Loiselle M Gagnon-Sanschagrin P et al Assessment of costs associated with adverse events in patients with cancer PLoS One 2018 13 4 doi: 10.1371/journal.pone.0196007 29652926 PMC5898735 6 Abu SF Shafie AA Chandriah H Cost estimations of managing adverse drug reactions in hospitalized patients: a systematic review of study methods and their influences Pharmacoepidemiology 2023 2 2 120 39 7 Durand M Castelli C Roux-Marson C Kinowski J-M Leguelinel-Blache G Evaluating the costs of adverse drug events in hospitalized patients: a systematic review Health Econ Rev 2024 14 1 11 doi: 10.1186/s13561-024-00481-y 38329561 PMC10851489 8 Shepard CW Ortega-Sanchez IR Scott RD 2nd Rosenstein NE ABCs Team Cost-effectiveness of conjugate meningococcal vaccination strategies in the United States Pediatrics 2005 115 5 1220 32 doi: 10.1542/peds.2004-2514 15867028 9 Jewell EL Kulasingam S Myers ER Alvarez Secord A Havrilesky LJ Primary surgery versus chemoradiation in the treatment of IB2 cervical carcinoma: a cost effectiveness analysis Gynecol Oncol 2007 107 3 532 40 doi: 10.1016/j.ygyno.2007.08.056 17900674 10 Richard P Walker R Alexandre P The burden of out of pocket costs and medical debt faced by households with chronic health conditions in the United States PLoS One 2018 13 6 doi: 10.1371/journal.pone.0199598 29940025 PMC6016939 11 Borghaei H Yim YM Guerin A Pivneva I Shi S Gandhi M et al Severe adverse events impact overall survival and costs in elderly patients with advanced non-small cell lung cancer on second-line therapy Lung Cancer 2018 119 112 9 doi: 10.1016/j.lungcan.2018.02.011 29656745 12 Yim YM Gandhi M Guerin A Ionescu-Ittu R Pivneva I Shi S et al Impact of severe adverse events during second-line therapy on healthcare costs in patients with advanced non-small cell lung cancer (aNSCLC) Ann Oncol 2016 27 10.1016/j.lungcan.2018.02.011 29656745 13 Irwin DE Masaquel A Johnston S Barnett B Adverse event-related costs for systemic metastatic breast cancer treatment among female Medicaid beneficiaries J Med Econ 2016 19 11 1027 33 doi: 10.1080/13696998.2016.1192548 27206801 14 Lal LS Aly A Le LB Packous S Seal B Teitelbaum A Healthcare costs related to adverse events in hepatocellular carcinoma treatment: a retrospective observational claims study Cancer Reports 2022 5 5 10.1002/cnr2.1504 PMC9124510 34494389 15 Grivas P DerSarkissian M Shenolikar R Laliberté F Doleh Y Duh MS Healthcare resource utilization and costs of adverse events among patients with metastatic urothelial cancer in USA Future Oncol 2019 15 33 3809 18 31596144 10.2217/fon-2019-0434 16 Hansen RN Ramsey SD Lalla D Masaquel A Kamath T Brammer M et al Identification and cost of adverse events in metastatic breast cancer in taxane and capecitabine based regimens Springerplus 2014 3 259 doi: 10.1186/2193-1801-3-259 24926422 PMC4047276 17 Latremouille-Viau D Chang J Guerin A The economic burden of common adverse events associated with metastatic colorectal cancer treatment in the United States J Med Econ 2017 20 1 54 62 27603498 10.1080/13696998.2016.1225577 18 George S Bell EJ Zheng Y Kim R White J Devgan G et al The Impact of Adverse Events on Health Care Resource Utilization, Costs, and Mortality Among Patients Treated with Immune Checkpoint Inhibitors Oncologist 2021 26 7 15 doi: 10.1002/onco.13812 33955118 PMC8265346 19 Engel-Nitz NM Johnson MP Bunner SH Ryan KJ Real-World Costs of Adverse Events in First-Line Treatment of Metastatic Non-Small Cell Lung Cancer J Manag Care Spec Pharm 2020 26 6 729 40 doi: 10.18553/jmcp.2020.26.6.729 32463768 PMC10391087 20 Arunachalam A Li H Bittoni MA Camacho R Cao X Zhong Y et al Real-World Treatment Patterns, Overall Survival, and Occurrence and Costs of Adverse Events Associated With Second-Line Therapies for Medicare Patients With Advanced Non-Small-Cell Lung Cancer Clin Lung Cancer 2018 19 5 99 doi: 10.1016/j.cllc.2018.05.016 29983370 10.1371/journal.pone.0332703.r001 Decision Letter 0 Essouma Mickael Academic Editor © 2025 Mickael Essouma 2025 Mickael Essouma https://creativecommons.org/licenses/by/4.0/ This is an open access article distributed under the terms of the Creative Commons Attribution License Submission Version 0  7 Jan 2025 Dear Dr. Patel, Please submit your revised manuscript by Feb 21 2025 11:59PM. If you will need more time than this to complete your revisions, please reply to this message or contact the journal office at plosone@plos.org https://www.editorialmanager.com/pone/ A rebuttal letter that responds to each point raised by the academic editor and reviewer(s). You should upload this letter as a separate file labeled 'Response to Reviewers'. A marked-up copy of your manuscript that highlights changes made to the original version. You should upload this as a separate file labeled 'Revised Manuscript with Track Changes'. An unmarked version of your revised paper without tracked changes. You should upload this as a separate file labeled 'Manuscript'. If you would like to make changes to your financial disclosure, please include your updated statement in your cover letter. Guidelines for resubmitting your figure files are available below the reviewer comments at the end of this letter. If applicable, we recommend that you deposit your laboratory protocols in protocols.io to enhance the reproducibility of your results. Protocols.io assigns your protocol its own identifier (DOI) so that it can be cited independently in the future. For instructions see: https://journals.plos.org/plosone/s/submission-guidelines#loc-laboratory-protocols https://plos.org/protocols?utm_medium=editorial-email&utm_source=authorletters&utm_campaign=protocols We look forward to receiving your revised manuscript. Kind regards, Mickael Essouma, M. D. Academic Editor PLOS ONE Journal Requirements: When submitting your revision, we need you to address these additional requirements. 1. Please ensure that your manuscript meets PLOS ONE's style requirements, including those for file naming. The PLOS ONE style templates can be found at https://journals.plos.org/plosone/s/file?id=wjVg/PLOSOne_formatting_sample_main_body.pdf  https://journals.plos.org/plosone/s/file?id=ba62/PLOSOne_formatting_sample_title_authors_affiliations.pdf 2.  Thank you for stating the following financial disclosure: “This study was funded by Genentech, Inc.” Please state what role the funders took in the study. If the funders had no role, please state: \"The funders had no role in study design, data collection and analysis, decision to publish, or preparation of the manuscript.\" If this statement is not correct you must amend it as needed. Please include this amended Role of Funder statement in your cover letter; we will change the online submission form on your behalf. 3. Thank you for stating the following in the Competing Interests/Financial Disclosure * (delete as necessary) section: “I have read the journal's policy and the authors of this manuscript have the following competing interests: Stock or stock options- Genentech; All support for the present manuscript (e.g., funding, provision of study materials, medical writing, article processing charges, etc.) - Genentech; current employer- Genentech” We note that you received funding from a commercial source: Genentech Please provide an amended Competing Interests Statement that explicitly states this commercial funder, along with any other relevant declarations relating to employment, consultancy, patents, products in development, marketed products, etc. Within this Competing Interests Statement, please confirm that this does not alter your adherence to all PLOS ONE policies on sharing data and materials by including the following statement: \"This does not alter our adherence to PLOS ONE policies on sharing data and materials.” (as detailed online in our guide for authors http://journals.plos.org/plosone/s/competing-interests Please include your amended Competing Interests Statement within your cover letter. We will change the online submission form on your behalf. [Note: HTML markup is below. Please do not edit.] Reviewers' comments: Reviewer's Responses to Questions  Comments to the Author 1. Is the manuscript technically sound, and do the data support the conclusions? Reviewer #1: Partly Reviewer #2: Yes Reviewer #3: Yes ********** 2. Has the statistical analysis been performed appropriately and rigorously? -->?> Reviewer #1: I Don't Know Reviewer #2: Yes Reviewer #3: Yes ********** 3. Have the authors made all data underlying the findings in their manuscript fully available??> The PLOS Data policy Reviewer #1: No Reviewer #2: Yes Reviewer #3: Yes ********** 4. Is the manuscript presented in an intelligible fashion and written in standard English??> Reviewer #1: Yes Reviewer #2: Yes Reviewer #3: Yes ********** Reviewer #1: Thank you for the opportunity to review this paper. I have the following comments. 1. First, more information on methodology should be provided. Just indicating to read another paper throughout is not sufficient. 2. How are the AEs identified ? Is it in any claims line? Or just in position 1 or 2?. If it is in any claim line, such as claim line 6, then the cost difference less likely due to this event and also maybe a chronic condition. The difference in costs then maybe negative due to the fact the control patient has some other more expensive condition occurring at the same time. 3. How are patients who died handled? 4. Were diagnostic claims included in selection of patients? 5. How were maintenance lines of treatment considered? Their rates of AEs and costs are difference than during active treatment regimens. 6. Are these paid costs? What year were they adjusted to? Are these cost per episode? Are the episodes in similar length? Should have calculated PPPMs or used a fixed time period of follow-up or even a fixed line of therapy( eg.first line). 7. There are patients who are censored and have unaccounted time period for AE occurrences and AE costs. Would need to conduct sensitivity analysis with patients with completed episodes. 8. It may be good to have a figure to explain baseline, episode start and episode end in active and control patient. 9.For Severe AE's which involve hospitalization, what line did the AE have to be in? If the person came in for a car accident and only had the AE in line 6, then the impact on costs would be different. It would be better to have the AE in the first or second position in the claims record to say the AE is the main reason for the hospitalization. 10. Not sure truncation is a good way to set the time period of the control, especially when patients could be on different treatments (drugs) of different lengths and there is no matching on the exact regimen, as I read the matching section. I would think this is a major limitation, especially since we seem to be front loading the regimen period and some adverse events take place later in the line or even after the end of the line. Sometimes, AEs can occur up to 180 days after the end of a regimen. These are limitations to be added to the discussion. 11. What is regimen line of therapy number in line 195? Since progression is not captured in claims, any regimen change is a line of therapy change. Regimen was not matched on, so episodes can be very different types of drugs and lengths and just truncating time period does not overcome this limitation. 12. Assume a GLM was conducted for the multivariable analysis. It is not stated. 13.These negative values are problematic. It may make sense from a model perspective, but not from a clinical and economic perspective. 14. The conclusion of negative values does not quite make sense. If the control have other conditions which were more expensive, that maybe driving the negative values. There is no matching on comorbidities conducted. 15. Line 201 - 47? Wouldn’t this be 53, since there were a total of 54? Or were some correlated ones taken out? Reviewer #2: The article is well-written, and the paper's statistical analysis is well done. However, the authors use some statistical models/methods (mainly bias reduction techniques). As the authors partially state in lines 326-329, all these statistical methods are based on underlying assumptions. The authors should first express these assumptions and then conveniently validate them based on the available data. Model validation (i.e., evaluating whether a chosen statistical model is appropriate) is as essential as model fitting in a good statistical analysis. Reviewer #3: The article, \"New Estimates of the Costs of Adverse Events in Patients with Cancer\", is a commendable contribution and a strong candidate for publication in this journal. It aligns well with the journal's standards for original research by employing a detailed methodology, rigorous statistical analysis, and a comprehensive discussion of the findings. The study addresses a significant gap in the literature by evaluating the incremental costs of adverse events (AEs) in cancer treatment across multiple tumour types, using the updated ICD-10 schema and recent data. The authors' sophisticated approach to bias control and their detailed stratification enhance the study’s credibility and relevance, making it a valuable resource for the field. Abstract The abstract effectively summarises the study’s objectives, methodology, and key findings, and successfully conveys its significance in understanding the economic burden of AEs in cancer care. However, it lacks balance, as it does not mention the study’s limitations, which would provide a more rounded perspective. Furthermore, the abstract does not explore the broader implications of the findings, such as their potential applications in healthcare policy or economic modelling. A brief acknowledgement of the study's limitations and practical applications would significantly enhance its comprehensiveness and appeal to readers. Introduction The introduction establishes a strong foundation by justifying the need to quantify AE costs and contextualising the research within the broader field of healthcare economics. It effectively underscores the relevance of these costs for guiding payer decisions and enhancing economic models. However, it misses the opportunity to clearly articulate the unique contributions of this study compared to prior research, particularly the work of Wong et al. Explicitly identifying the research gaps being addressed—such as the broader range of tumour types, updated datasets, and advanced methodologies—would further strengthen this section. Materials and Methods This section demonstrates strong scientific rigour, employing techniques such as propensity score matching and exact tumour-type matching to minimise bias. The use of updated ICD-10 codes and recent datasets ensures the relevance and applicability of the findings. However, the exclusion of treatment-related costs, such as surgery and pharmaceutical expenses, is insufficiently justified, potentially limiting the scope of the analysis. Additionally, the assumptions underlying the matching process and the inherent biases of claims data are not critically evaluated. A more thorough discussion of these methodological decisions and their implications would enhance the robustness of this section. Results The results section is well-organised and provides detailed insights into AE-related costs across different cancer types and severity levels. The stratification by tumour type and severity makes the findings highly applicable to diverse clinical and economic contexts. However, the meaning of negative cost estimates is not adequately clarified, which may confuse readers. Furthermore, the broader significance of the findings for healthcare planning and policy remains underexplored. Adding a clear interpretation of negative cost estimates and summarising the key findings with practical implications would improve the impact of this section. Discussion The discussion effectively links the findings to the study’s objectives and prior literature, highlighting the advancements in methodology and the importance of AE cost estimates. It also acknowledges important limitations, such as reliance on claims data and small sample sizes for rare cancers. However, the section falls short in exploring the practical applications of the findings, such as guiding cost management strategies or informing healthcare policies. Additionally, while variability in AE costs for rare cancers is noted, it is not explored in sufficient depth. Addressing these gaps would provide a more comprehensive understanding of the study’s implications. Conclusion The conclusion succinctly underscores the study’s contributions to health economic modelling and the value of detailed AE cost estimates for decision-making. However, it does not provide actionable recommendations for policymakers, healthcare providers, or researchers, nor does it fully address the broader significance of the findings in improving resource allocation or optimising treatment planning. Including specific recommendations for clinical and policy applications, as well as suggestions for future research directions, would make the conclusion more impactful and forward-looking. References The references section is thorough and draws upon relevant and recent literature to substantiate the study’s findings. Broadening the range of cited works to include more diverse research approaches would enrich the study’s contextual foundation and demonstrate a more comprehensive engagement with the field. Overall The article is well-structured, scientifically robust, and addresses a critical gap in health economic modelling for cancer care. However, its conclusions in each section could better emphasise actionable outcomes, reflect on methodological limitations, and explore broader implications for healthcare policy and practice. By incorporating more explicit recommendations and transparently addressing the study’s limitations, the article could significantly enhance its relevance and impact within the field. ********** what does this mean? If you choose “no”, your identity will remain anonymous but your review may still be made public. Do you want your identity to be public for this peer review? Privacy Policy Reviewer #1: No Reviewer #2: No Reviewer #3: No ********** [NOTE: If reviewer comments were submitted as an attachment file, they will be attached to this email and accessible via the submission site. Please log into your account, locate the manuscript record, and check for the action link \"View Attachments\". If this link does not appear, there are no attachment files.] While revising your submission, please upload your figure files to the Preflight Analysis and Conversion Engine (PACE) digital diagnostic tool, https://pacev2.apexcovantage.com/ figures@plos.org Attachment Submitted filename: PONE-D-24-53463_Academic editor comments.pdf 10.1371/journal.pone.0332703.r002 Author response to Decision Letter 1 Submission Version 1  15 Apr 2025 Mickael Essouma, MD Academic Editor, PLOS One April 2025 Dear Dr. Essouma: On behalf of the authors, we are pleased to resubmit our revised manuscript, “New estimates of the costs of adverse events in patients with cancer” to PLOS One. We appreciate the constructive comments from the reviewers and have addressed each one in the following detailed responses along with tracked changes marked in the revised manuscript. As requested, following please find the amended Role of the Funder and Competing Interests statements: Role of the Funder This study was funded by Genentech, Inc. The sponsor participated in the design, analysis, and interpretation of the study. Competing Interests All authors have read the Journal's policy and the authors of this manuscript have the following competing interests: Employment and stock or stock options in Genentech, Inc. All support for the present manuscript (e.g., funding, provision of study materials, medical writing, article processing charges, etc.) was provided by Genentech, Inc. This does not alter our adherence to PLOS ONE policies on sharing data and materials. Thank you for your consideration, we look forward to hearing from you. Sincerely, Achal Patel, PhD, on behalf of the authors patel.achal@gene.com Journal Requirements When submitting your revision, we need you to address these additional requirements. 1. Please ensure that your manuscript meets PLOS ONE's style requirements, including those for file naming. The PLOS ONE style templates can be found at https://journaIs.plos.org/ https://journaIs.plos.org/plosone/s/file?id=ba62/PLOSOne_formatting_sample_title_authors_affiIiations.pdf Authors’ response: Thank you, we have confirmed and made minor adjustments where needed to align with the published style. 2. Thank you for stating the following financial disclosure: \"This study was funded by Genentech, Inc.\" Please state what role the funders took in the study. If the funders had no role, please state: \"The funders had no role in study design, data collection and analysis, decision to publish, or preparation of the manuscript.\" If this statement is not correct you must amend it as needed. Please include this amended Role of Funder statement in your cover letter; we will change the online submission form on your behalf. Authors’ response: We have amended the Role of the Funder statement and included it in the cover letter. 3. Thank you for stating the following in the Competing Interests/Financial Disclosure* (delete as necessary) section: \"I have read the journal's policy and the authors of this manuscript have the following competing interests: Stock or stock options- Genentech; All support for the present manuscript (e.g., funding, provision of study materials, medical writing, article processing charges, etc.) - Genentech; current employer- Genentech\" We note that you received funding from a commercial source: Genentech Please provide an amended Competing Interests Statement that explicitly states this commercial funder, along with any other relevant declarations relating to employment, consultancy, patents, products in development, marketed products, etc. Within this Competing Interests Statement, please confirm that this does not alter your adherence to all PLOS ONE policies on sharing data and materials by including the following statement: \"This does not alter our adherence to PLOS ONE policies on sharing data and materials.\" (as detailed online in our guide for authors http://journals.plos.org/plosone/s/competing-interests Please include your amended Competing Interests Statement within your cover letter. We will change the online submission form on your behalf. Authors’ response: We have amended the Competing Interests statement and included it in the cover letter. Reviewer #1 Thank you for the opportunity to review this paper. I have the following comments. 1. First, more information on methodology should be provided. Just indicating to read another paper throughout is not sufficient. Authors’ response: Thank you for this feedback. We have revised our methods section to provide more complete information on our analytical approach. We do make several references throughout the paper to the Wong study, which we believe is appropriate, as our study applies a similar design to a new dataset. On review of the paper, we have identified one instance where we suggested the reader refer to the Wong paper for more methodological detail (section 2.6, methods). We have changed the presentation to clarify that while the methods are similar, (A) we summarize those methods in detail here, and (B) there are several notable differences, which are described. 2. How are the AEs identified? Is it in any claims line? Or just in position 1 or 27. If it is in any claim line, such as claim line 6, then the cost difference less likely due to this event and also maybe a chronic condition. The difference in costs then maybe negative due to the fact the control patient has some other more expensive condition occurring at the same time. Authors’ response: AEs are identified based on ICD-10-CM codes recorded on a health insurance claim in any medical setting (e.g., inpatient stay, emergency room visits, outpatient visits) and any diagnosis position (In P+ indicated by diag1-diag12). We have added the diagnosis position randomness as a potential explanation for the observed negative point estimates. 3. How are patients who died handled? Authors’ response: Patient death is not well measured in claims data. In the cohort selection process, the end of all treatment episodes is defined as the occurrence of either initiation of a new antineoplastic regimen, administrative censoring (end of continuous enrollment), or end of data availability. Death is an event which triggers the end of enrollment; thus in the context of this study death is best understood (correctly) as an event which precipitates the end of cost measurement for any given treatment episode. We have updated the manuscript to reflect this. 4. Were diagnostic claims included in selection of patients? Authors’ response: Yes, as we describe in the methods section, the treatment group cohort is essentially defined by the presence of diagnosis codes for adverse events of interest. Additionally (as described), because the control group is defined by the absence of diagnosis codes for AEs of interest, and because we required exact matching on tumor type, diagnosis codes are a critical component of control group selection. 5. How were maintenance lines of treatment considered? Their rates of AEs and costs are difference than during active treatment regimens. Authors’ response: Thank you for this comment. We believe that the existing design controls for the potential bias you describe. This is because our design requires matching on regimen (see response to comment #10, below). Thus any differences that arise in adverse event costs due to differences in regimen (including maintenance vs. active treatment) are theoretically controlled for. 6. Are these paid costs? What year were they adjusted to? Are these cost per episode? Are the episodes in similar length? Should have calculated PPPMs or used a fixed time period of follow-up or even a fixed line of therapy (e.g., first line). Authors’ response: The estimates presented in this paper describe the average cost for a given instance of an adverse event of interest. The quantity being averaged is the total incremental difference in \"allowed\" claims, not paid claims. So it is not an average of the amount the insurers paid out, but rather an average of the contractually agreed upon amounts that insurers will pay. We believe when the reviewer refers to episodes, the reviewer is describing episodes of adverse events, rather than episodes of treatment (described in detail in the paper). If this is correct, then it is not known whether adverse event episodes are similar in length, because this is not a quantity that is measured in the data (unlike, for example, hospital stays or duration on antineoplastic therapy). We believe this is the best way to present the results. PPPMs can readily be calculated by any payer interested in that quantity. Selection of a specific duration for a fixed time period analysis would jeopardize external validity either by omitting relevant costs (if the time period is too short) or by running afoul of the treatment episode construction (if the time period is too long). We agree that stratification of results by line of therapy could be interesting and would certainly be a valid research question. Although we controlled for line of therapy in our propensity matching analysis, we felt that the existing stratification factors (tumor type, all AEs vs severe AEs) were more important to focus on, and that adding an additional level of stratification would make the overall volume of results presented unwieldy. This would be an interesting question for a future study. 7. There are patients who are censored and have unaccounted time period for AE occurrences and AE costs. Would need to conduct sensitivity analysis with patients with completed episodes. Authors’ response: The objective of the present analysis is to estimate the incremental cost of the occurrence of a given adverse event in patients with cancer, not to estimate the total cost of cancer care. While the latter construct clearly may differ between censored and uncensored patients, there are no a priori reasons to think that the former does. Additionally, many treatments for metastatic cancer are \"treat to progression;\" because neither metastatic (versus early) stage disease status nor the occurrence of progression are well measured in claims data, it is not possible to define \"completed\" treatment regimens in claims data in a consistent way spanning the thousands of different tumor / regimen combinations assessed in this study. 8. It may be good to have a figure to explain baseline, episode start and episode end in active and control patient. Authors’ response: This information is provided graphically in Figure 2 with detailed definitions provided in the footnote. We would be happy to revise the figure if the reviewer will clarify what aspects are unclear. 9. For Severe AE's which involve hospitalization, what line did the AE have to be in? If the person came in for a car accident and only had the AE in line 6, then the impact on costs would be different. It would be better to have the AE in the first or second position in the claims record to say the AE is the main reason for the hospitalization. Authors’ response: Thank you for this comment. We confirm that for the analysis of Severe AEs, the AE of interest must be the reason for admission, operationalized as position one or two. We have clarified this in the manuscript. 10. Not sure truncation is a good way to set the time period of the control, especially when patients could be on different treatments (drugs) of different lengths and there is no matching on the exact regimen, as I read the matching section. I would think this is a major limitation, especially since we seem to be front loading the regimen period and some adverse events take place later in the line or even after the end of the line. Sometimes, AEs can occur up to 180 days after the end of a regimen. These are limitations to be added to the discussion. Authors’ response: Thank you, we see that we inadvertently omitted the word \"regimen\" out of the list of factors included in the PSM. We have corrected this omission. With matching on regimen, we believe the concern about truncation is removed. In particular, it is desirable to have the duration of the control episode set to be equal to the duration of the matched treatment episode. In general, accrued costs increase as a function of the length of the treatment episode. If control group episodes are longer than treatment group episodes, they will include costs unrelated to AEs of interest, and our estimates will be biased negative; if control group episodes are shorter than treatment group episodes, the reverse will be true. 11. What is regimen line of therapy number in line 195? Since progression is not captured in claims, any regimen change is a line of therapy change. Regimen was not matched on, so episodes can be very different types of drugs and lengths and just truncating time period does not overcome this limitation. Authors’ response: This is related to our response to comment 10 above, regarding whether the regimen was controlled for. \"Regimen line of therapy\" was the variable name in our analytic dataset for the construct 'regimen' - specifically \"regimen_lot\". This variable consists of a categorical variable which is constructed by alpha sorting the agents within a given treatment episode, such that, for example, (pertuzumab, trastuzumab) will be correctly matched to (trastuzumab, pertuzumab). The manuscript had erroneously included the text \"line of therapy\" as part of the descriptor for this variable, which we have corrected. So to clarify, both “regimen” and “line of therapy” were matched on. We apologize for the confusion around this. 12. Assume a GLM was conducted for the multivariable analysis. It is not stated. Authors’ response: Thank you for pointing out this omission. In fact, we used OLS rather than GLM. In early analysis we considered GLM, but encountered significant model convergence issues, particularly when attempting to generate point estimates for tumor types with smaller sample sizes. We have revised the manuscript to make this clear. 13. These negative values are problematic. It may make sense from a model perspective, but not from a clinical and economic perspective. Authors’ response: We agree with the reviewer’s point and have added further comments in the Discussion indicating that the negative values should be interpreted with caution. We have also added significant additional text providing potential explanations for why these results are observed. 14. The conclusion of negative values does not quite make sense. If the control have other conditions which were more expensive, that maybe driving the negative values. There is no matching on comorbidities conducted. Authors’ response: Thank you for this valuable suggestion. We agree that comorbidities are a potential source of confounding. We have added the Charlson Comorbidity Index as a control variable to the outcomes model and revised the entire presentation of results to reflect that. Even after controlling for co-morbidities in our revised models, there are rare instances where there is a negative incremental cost associated with experiencing an AE (e.g., across all cancers, photosensitivity is associated with $-488 incremental cost relative to the control group). One possible explanation is differential co-occurrence of other AEs (including AEs not directly measured in this analysis) for the AE vs. control group, where more expensive AEs (measured or unmeasured) are more common among the control group. In their analysis, Wong et al. noted this as a potential explanation for rare negative AE incremental cost values. While we attempt to reduce the impact of other co-occurring AEs on the incremental cost of any given AE via our outcomes model, the impact of potential unmeasured co-occurring AEs is a limitation of the study that we acknowledge. Another potential explanation is that negative incremental cost values are more likely with reduced sample sizes, due to the higher sample variance involved in estimation. Because of this high variance, the sample means (and the incremental cost difference computed based on the sample means) may differ from the true, population mean differences. We’ve also described this potential limitation in detail in the conclusions section of the manuscript. 15. Line 201 - 47? Wouldn't this be 53, since there were a total of 54? Or were some correlated ones taken out? Authors’ response: Thank you, yes, we have Attachment Submitted filename: PLos_CostofAE_Patel_Reviewer Response_04Apr2025.docx 10.1371/journal.pone.0332703.r003 Decision Letter 1 Marchetti Monia Academic Editor © 2025 Monia Marchetti 2025 Monia Marchetti https://creativecommons.org/licenses/by/4.0/ This is an open access article distributed under the terms of the Creative Commons Attribution License Submission Version 1  4 Jun 2025 New estimates of the costs of adverse events in patients with cancer PLOS ONE Dear Dr. Patel, Thank you for submitting your manuscript to PLOS ONE. After careful consideration, we feel that it has merit but does not fully meet PLOS ONE’s publication criteria as it currently stands. Therefore, we invite you to submit a revised version of the manuscript that addresses the points raised during the review process. Please submit your revised manuscript by Jul 19 2025 11:59PM. If you will need more time than this to complete your revisions, please reply to this message or contact the journal office at plosone@plos.org https://www.editorialmanager.com/pone/ Please include the following items when submitting your revised manuscript: A rebuttal letter that responds to each point raised by the academic editor and reviewer(s). You should upload this letter as a separate file labeled 'Response to Reviewers'. A marked-up copy of your manuscript that highlights changes made to the original version. You should upload this as a separate file labeled 'Revised Manuscript with Track Changes'. An unmarked version of your revised paper without tracked changes. You should upload this as a separate file labeled 'Manuscript'. If you would like to make changes to your financial disclosure, please include your updated statement in your cover letter. Guidelines for resubmitting your figure files are available below the reviewer comments at the end of this letter. If applicable, we recommend that you deposit your laboratory protocols in protocols.io to enhance the reproducibility of your results. Protocols.io assigns your protocol its own identifier (DOI) so that it can be cited independently in the future. For instructions see: https://journals.plos.org/plosone/s/submission-guidelines#loc-laboratory-protocols https://plos.org/protocols?utm_medium=editorial-email&utm_source=authorletters&utm_campaign=protocols We look forward to receiving your revised manuscript. Kind regards, Monia Marchetti Academic Editor PLOS ONE [Note: HTML markup is below. Please do not edit.] Reviewers' comments: Reviewer's Responses to Questions  Comments to the Author Reviewer #1: (No Response) Reviewer #2: All comments have been addressed ********** 2. Is the manuscript technically sound, and do the data support the conclusions??> Reviewer #1: Yes Reviewer #2: Yes ********** 3. Has the statistical analysis been performed appropriately and rigorously? -->?> Reviewer #1: Yes Reviewer #2: Yes ********** 4. Have the authors made all data underlying the findings in their manuscript fully available??> The PLOS Data policy Reviewer #1: Yes Reviewer #2: Yes ********** 5. Is the manuscript presented in an intelligible fashion and written in standard English??> Reviewer #1: Yes Reviewer #2: Yes ********** Reviewer #1: Thank you for the opportunity to re-review the manuscript. I believe most of my comments have been addressed. Two issues remain: 1. Diagnostic claims are claims associated with determining the diagnosis and include the initial imaging, biopsy, pathology tests and associated codes. Were these included in determine patient selection? 2. There is a summary of a paper by Lal et al in the discussion, which is not summarized appropriately. The study population is not just Medicare Advantage; it also includes commercial patients. Reviewer #2: (No Response) ********** what does this mean? If you choose “no”, your identity will remain anonymous but your review may still be made public. Do you want your identity to be public for this peer review? Privacy Policy Reviewer #1: No Reviewer #2: No ********** [NOTE: If reviewer comments were submitted as an attachment file, they will be attached to this email and accessible via the submission site. Please log into your account, locate the manuscript record, and check for the action link \"View Attachments\". If this link does not appear, there are no attachment files.] While revising your submission, please upload your figure files to the Preflight Analysis and Conversion Engine (PACE) digital diagnostic tool, https://pacev2.apexcovantage.com/ figures@plos.org 10.1371/journal.pone.0332703.r004 Author response to Decision Letter 2 Submission Version 2  19 Jul 2025 Reviewer #1: Thank you for the opportunity to re-review the manuscript. I believe most of my comments have been addressed. Two issues remain: 1. Diagnostic claims are claims associated with determining the diagnosis and include the initial imaging, biopsy, pathology tests and associated codes. Were these included in determine patient selection? Response: Thank you for this question. To clarify, patient selection was determined through the ICD10 diagnosis classification associated with the medical and pharmacy claims themselves. So for example, the patients in our lung cancer cohort had pharmacy/medical claims with the C34.x ICD10 codes listed in the diagnosis position. It is true that many of these patients had diagnostic procedures associated with their conditions, and that these procedures were used to determine the actual diagnosis of lung cancer. For example, a patient with lung cancer may have had an MRI during the course of diagnosis. But a patient with COPD might also have an MRI. If this had been an analysis of Electronic Medical Record (EMR) data, this information could be utilized to inform patient selection / classification. But the nature of claims data is that at the time the MRI (or biopsy, or panel blood test) occurs, the actual diagnosis is not yet known: Someone who has a chest MRI may have lung cancer, or COPD, or any of several other conditions. To summarize, we did not use the presence of specific diagnostic tests to determine patient cohort classification, because in claims data (at least at the beginning of the treatment journey) the information associated with those claims does not typically convey information about the patient's actual diagnosis. 2. There is a summary of a paper by Lal et al in the discussion, which is not summarized appropriately. The study population is not just Medicare Advantage; it also includes commercial patients. Response: Thank you for bringing this error to our attention. We have revised the manuscript text as follows: A second study examined the costs of adverse events in patients with hepatocellular carcinoma, the most common type of liver cancer, in a pooled Medicare Advantage population. Their design differs from ours in that our study considers all types of liver cancer, including but not limited to HCC, thus precluding direct comparison of estimates. Attachment Submitted filename: PLoS_One_ResponseToReviewers_03July2025.docx 10.1371/journal.pone.0332703.r005 Decision Letter 2 Marchetti Monia Academic Editor © 2025 Monia Marchetti 2025 Monia Marchetti https://creativecommons.org/licenses/by/4.0/ This is an open access article distributed under the terms of the Creative Commons Attribution License Submission Version 2  4 Sep 2025 New estimates of the costs of adverse events in patients with cancer PONE-D-24-53463R2 Dear Dr. Patel, We’re pleased to inform you that your manuscript has been judged scientifically suitable for publication and will be formally accepted for publication once it meets all outstanding technical requirements. Within one week, you’ll receive an e-mail detailing the required amendments. When these have been addressed, you’ll receive a formal acceptance letter and your manuscript will be scheduled for publication. An invoice will be generated when your article is formally accepted. Please note, if your institution has a publishing partnership with PLOS and your article meets the relevant criteria, all or part of your publication costs will be covered. Please make sure your user information is up-to-date by logging into Editorial Manager at Editorial Manager® billing support If your institution or institutions have a press office, please notify them about your upcoming paper to help maximize its impact. If they’ll be preparing press materials, please inform our press team as soon as possible -- no later than 48 hours after receiving the formal acceptance. Your manuscript will remain under strict press embargo until 2 pm Eastern Time on the date of publication. For more information, please contact onepress@plos.org. Kind regards, Monia Marchetti Academic Editor PLOS ONE Additional Editor Comments (optional): Reviewers' comments: 10.1371/journal.pone.0332703.r006 Acceptance letter Marchetti Monia Academic Editor © 2025 Monia Marchetti 2025 Monia Marchetti https://creativecommons.org/licenses/by/4.0/ This is an open access article distributed under the terms of the Creative Commons Attribution License PONE-D-24-53463R2 PLOS ONE Dear Dr. Patel, I'm pleased to inform you that your manuscript has been deemed suitable for publication in PLOS ONE. Congratulations! Your manuscript is now being handed over to our production team. At this stage, our production department will prepare your paper for publication. This includes ensuring the following: * All references, tables, and figures are properly cited * All relevant supporting information is included in the manuscript submission, * There are no issues that prevent the paper from being properly typeset You will receive further instructions from the production team, including instructions on how to review your proof when it is ready. Please keep in mind that we are working through a large volume of accepted articles, so please give us a few days to review your paper and let you know the next and final steps. Lastly, if your institution or institutions have a press office, please let them know about your upcoming paper now to help maximize its impact. If they'll be preparing press materials, please inform our press team within the next 48 hours. Your manuscript will remain under strict press embargo until 2 pm Eastern Time on the date of publication. For more information, please contact onepress@plos.org. You will receive an invoice from PLOS for your publication fee after your manuscript has reached the completed accept phase. If you receive an email requesting payment before acceptance or for any other service, this may be a phishing scheme. Learn how to identify phishing emails and protect your accounts at https://explore.plos.org/phishing If we can help with anything else, please email us at customercare@plos.org. Thank you for submitting your work to PLOS ONE and supporting open access. Kind regards, PLOS ONE Editorial Office Staff on behalf of Dr. Monia Marchetti Academic Editor PLOS ONE ",
  "metadata": {
    "Title of this paper": "Acceptance letter",
    "Journal it was published in:": "PLOS One",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12478943/"
  }
}