{
  "title": "Paper_984",
  "abstract": "pmc Hereditas Hereditas 2986 hereditas Hereditas 0018-0661 1601-5223 BMC PMC12482284 PMC12482284.1 12482284 12482284 41023726 10.1186/s41065-025-00549-7 549 1 Research HOXB13 affects the cancer stem cell characteristics of nasopharyngeal carcinoma by regulating the Wnt/β-catenin/SOX2 pathway Xu Ying Li Xia xia_li0331@163.com https://ror.org/016k98t76 grid.461870.c 0000 0004 1757 7826 Department of Otolaryngology, The Second People’s Hospital of Changzhou, the Third Affiliated Hospital of Nanjing Medical University, 29 9 2025 2025 162 478403 192 18 6 2025 20 8 2025 29 09 2025 01 10 2025 01 10 2025 © The Author(s) 2025 2025 https://creativecommons.org/licenses/by/4.0/ Open Access http://creativecommons.org/licenses/by/4.0/ http://creativecommons.org/publicdomain/zero/1.0/ Purpose HOXB13 has been shown to act as a tumor promoter in various malignancies; however, its role in nasopharyngeal carcinoma (NPC) remains unexplored. This study aimed to investigate the function of HOXB13 in NPC and elucidate its underlying mechanism to identify novel targets for NPC diagnosis and therapy. Methods HOXB13 expression in NPC was examined through bioinformatic analyses of the TCGA and GEO databases, and the findings were validated using molecular biology techniques. After the transfection of NPC cell lines with siRNA targeting HOXB13 (si-HOXB13), the effects of HOXB13 knockdown on cell proliferation, migration, invasion, and stemness were evaluated. Expression levels of Wnt/β-catenin/SOX2 pathway-related proteins were assessed. In vivo, NPC cells transfected with sh-HOXB13 were injected into nude mice, after which tumor volume and mass were measured, and lung metastases were analyzed using hematoxylin and eosin (H&E) staining. Results HOXB13 knockdown significantly reduced NPC cell viability, suppressed clonogenicity and invasiveness, increased scratch width in wound healing assays, and decreased sphere formation and the proportion of CD133 + Conclusion This study demonstrates that HOXB13 facilitates the malignant progression of NPC by regulating the Wnt/β-catenin/SOX2 signaling pathway, suggesting HOXB13 as a potential therapeutic and diagnostic target for NPC, thereby offering a new strategy to improve patient prognosis. Supplementary Information The online version contains supplementary material available at 10.1186/s41065-025-00549-7. Keywords HOXB13 NPC Wnt/β-catenin/SOX2 pathway Stem cell Migration and invasion pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement yes pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes issue-copyright-statement © Mendelian Society of Lund and BioMed Central Ltd. 2025 Introduction Nasopharyngeal carcinoma (NPC) is a malignant epithelial tumor arising from the nasopharyngeal mucosa [ 1 2 3 Homeobox (HOX) genes encode a conserved family of transcription factors defined by the presence of a homeodomain organized into four clusters, namely HOXA, HOXB, HOXC and HOXD, within the human genome. HOXB13, a member of the HOXB cluster, has been implicated in the pathogenesis and progression of various cancers [ 4 5 6 7 The Wnt/β-catenin signaling pathway plays an important role in tumor biology, and its aberrant activation has been linked to enhanced proliferation, migration, and maintenance of cancer stem cell properties in various malignancies [ 8 9 In this study, we demonstrate for the first time that HOXB13 is significantly overexpressed in NPC tissues, and that its elevated expression is associated with poor clinical prognosis. Functional experiments revealed that HOXB13 knockdown markedly suppresses NPC cell proliferation, migration, invasion, and stemness. Further mechanistic analyses indicated that HOXB13 promotes the malignant phenotype of NPC by regulating the Wnt/β-catenin signaling pathway. These findings suggest that HOXB13 may serve as a novel diagnostic and therapeutic target in NPC. Methods Biological analysis The expression level of the HOXB13 gene in head and neck cancer tissues was examined using the UALCAN database. To evaluate the prognostic relevance of HOXB13 expression, survival analysis was performed using the Kaplan-Meier database. Additionally, the expression of HOXB13 in NPC tissues was validated using the GSE53819 Tissue collection A total of 30 pairs of NPC tissues and matched adjacent non-tumorous tissues were obtained from patients treated at the Second People’s Hospital of Changzhou. All specimens underwent thorough histopathological review and clinical verification. The study protocol was approved by the hospital’s ethics committee (Approval No. 2025[KY002-01]), and written informed consent was obtained from all participants. After surgical excision, the tissue samples were immediately snap-frozen in liquid nitrogen and stored at -80 °C for further molecular analysis. Quantitative PCR (qPCR) Total RNA was isolated using TRIzol ® ® 2 −ΔΔCt Immunohistochemistry (IHC) Formalin-fixed, paraffin-embedded NPC tissue Sect. (4 μm thick) were mounted on anti-stripping glass slides, and the sections were dewaxed in xylene (twice, 10 min each) and rehydrated through a graded ethanol series. To block nonspecific binding, they were incubated with 5% bovine serum albumin (BSA) at room temperature for 30 min and incubated overnight at 4 °C with primary antibody against HOXB13. The next day, an HRP-conjugated secondary antibody was applied and incubated at room temperature for 60 min. Hematoxylin was used for nuclear counterstaining, followed by dehydration with graded ethanol, clearing with xylene, and mounting with neutral gum. Cell culture and transfection The NPC cell line C666-1 was maintained in RPMI-1640 medium supplemented with 10% fetal bovine serum (FBS) and 1% penicillin-streptomycin. The 5–8 F cell line was cultured in Dulbecco’s Modified Eagle Medium (DMEM) containing 10% FBS and 1% penicillin–streptomycin. Following enzymatic digestion and cell counting, the cell density was adjusted to 2 × 10⁵ cells/mL. Cells were seeded into 6-well plates and allowed to adhere and grow for 24 h until approximately 70% confluence was reached. Transfection was performed using Lipofectamine™ 3000 reagent, with two small interfering RNAs targeting HOXB13 (si-HOXB13#1: GCCTCATATTTTCTATCTAGAGC; si-HOXB13#2: ATGATCGTTAGCCTCATATTTTC). Cell viability assay (CCK-8) Cells in the logarithmic growth phase were seeded into 96-well plates at a density of 5 × 10 4 2 Colony formation assay The cells were seeded into 6-well plates at a density of 1,000–2,000 cells per well in 2 mL of complete culture medium, and the plates were incubated at 37 °C with 5% CO 2 Wound healing assay Cells were seeded into 6-well plates at a density of 1 × 10 6 2 Transwell The upper surface of the Transwell membrane (8 μm pore size) was uniformly coated with 50 µL of diluted Matrigel and allowed to solidify at 37 °C. Subsequently, 5 × 10 4 2 Spheroid formation assay Cells in the logarithmic growth phase were enzymatically digested and resuspended in complete medium to terminate digestion. After centrifugation, the supernatant was discarded, and cells were washed once with PBS. The pellet was then resuspended in stem cell culture medium consisting of DMEM/F12 supplemented with 20 ng/mL EGF, 20 ng/mL bFGF, B27 supplement, and 1% penicillin–streptomycin. Cell density was adjusted to 5,000 cells/mL. A total of 1000 cells per well were seeded into ultra-low attachment 6-well plates and incubated at 37 °C in a humidified incubator for 7–14 days. Fresh stem cell medium was added every three days, and spheroid formation was monitored every two days using an inverted microscope. Spheres with diameters exceeding 50 μm were considered valid. Flow cytometry Cells were digested with 0.25% trypsin (without EDTA) for two minutes, followed by gentle tapping to detach cells. The digestion was neutralized with serum-containing medium, and the cells were centrifuged at 1000 rpm for five minutes. The supernatant was discarded, and the cells were resuspended in PBS containing 1% bovine serum albumin (BSA) to a final density of 1 × 10 6 5 Western-blot Cells or tissues were lysed on ice using RIPA lysis buffer, and total protein concentration was determined by the BCA assay. Equal amounts of protein were subjected to SDS-PAGE, then transferred to a PVDF membrane. The membranes were blocked with 5% skim milk at room temperature for 1 h and incubated overnight at 4 °C with primary antibodies. After washing three times with TBST (10 min each), membranes were incubated with HRP-conjugated secondary antibodies at room temperature for 1 h. Following another three TBST washes, immunoreactive bands were visualized using a chemiluminescent imaging system. Band intensities were quantified using appropriate imaging software. The primary antibodies used were as follows: HOXB13 (Abcam, ab201682, 1:5000), β-catenin (Affinity, AF6266, 1:1000), SOX2 (Affinity, AF5140, 1:1000), and c-Myc (Affinity, AF6054, 1:1000). Xenograft tumor experiments Male BALB/c nude mice (18–20 g, aged 4–6 weeks) were maintained under specific pathogen-free (SPF) conditions. A total of 12 mice were randomly divided into two groups ( n 6 2 Hematoxylin and Eosin (H&E) staining NPC tumor tissues fixed in formalin and embedded in paraffin were sectioned into 4 μm slices using a rotary microtome. The staining procedure followed the same initial steps as immunohistochemistry. The tissue sections were then counterstained with hematoxylin, dehydrated through a graded ethanol series, cleared with xylene, and mounted with neutral resin. Five microscopic fields were randomly selected from each section to evaluate and count the number of metastatic foci. All animal procedures were reviewed and approved by the Animal Ethics Committee of the Third Affiliated Hospital of Nanjing Medical University (Approval No. 2025[KY002-01]). Statistical analysis All statistical analyses were performed using SPSS software. Each experiment was repeated independently at least three times. Data are presented as mean ± standard deviation (SD). Comparisons between two groups were conducted using the two-tailed Student’s t-test, while differences among multiple groups were assessed using one-way analysis of variance (ANOVA). A P Results High expression of HOXB13 in NPC and its correlation with prognosis Given that NPC is classified under head and neck cancers, the expression level of HOXB13 in head and neck cancer was initially examined using the TCGA database, which revealed significantly higher HOXB13 expression in tumor tissues compared to normal tissues (Fig. 1 1 GSE53819 1 1 1 1 1 1  Fig. 1 High levels of HOXB13 are observed in NPC. ( A B C GSE53819 D GSE53819 E F G H *** P < 0.001 vs. Normal HOXB13 knockdown inhibits the proliferation of NPC cells Western blot analysis was performed to evaluate the transfection efficiency of si-HOXB13 in NPC cell lines 5–8 F and C666-1. Among the two constructs, si-HOXB13#1 demonstrated stronger silencing efficiency compared to si-HOXB13 #2 (Fig. 2 2 2  Fig. 2 HOXB13 knockdown suppresses NPC cell proliferation. ( A B C *** P < 0.001 vs. control HOXB13 knockdown inhibits the migration and invasion of NPC cells To assess the effects of HOXB13 knockdown on cellular motility, wound healing and Transwell assays were performed. The scratch assay demonstrated that HOXB13 knockdown markedly reduced the migratory capacity of NPC cells (Fig. 3 3  Fig. 3 HOXB13 knockdown reduces NPC cell migration and invasion. ( A B ** P *** P < 0.001 vs. control HOXB13 knockdown inhibits the stemness of NPC cells To investigate the impact of HOXB13 on the stem-like properties of NPC cells, spheroid formation and flow cytometry analyses were conducted and revealed that HOXB13 knockdown significantly reduced the number of tumor spheres generated (Fig. 4 + 4  Fig. 4 HOXB13 knockdown diminishes the stemness of NPC cells. ( A B + *** P < 0.001 vs. control The Wnt/β-catenin/SOX2 pathway is inhibited by HOXB13 knockdown Westernblot analysis showed that HOXB13 knockdown significantly decreased the expression of of β-catenin, c-Myc, and SOX2, with si-HOXB13#1 producing a greater suppressive effect (Fig. 5 10 5  Fig. 5 HOXB13 knockdown inhibits the Wnt/β-catenin/SOX2 signaling pathway. ( A B *** P < 0.001 vs. control Knockdown of HOXB13 inhibits tumor growth and metastasis in vivo To evaluate the effects of HOXB13 knockdown on tumor growth and metastasis in vivo, NPC cells transfected with either sh-NC or sh-HOXB13 were subcutaneously injected into nude mice. Tumor development was monitored, and the results showed that both tumor volume and tumor weight were significantly reduced in the sh-HOXB13 group compared to the sh-NC group (Fig. 6 6  Fig. 6 HOXB13 knockdown suppresses tumor growth and metastasis in vivo. ( A B ** P < 0.01 vs. sh-NC Discussion Despite significant advances in multimodal comprehensive treatment that have markedly improved the local control rate of NPC, local recurrence and distant metastasis remain the primary causes of treatment failure and mortality. This persistent clinical challenge underscores the importance of in-depth investigation into the molecular mechanisms underlying NPC metastasis, which is essential for establishing a theoretical framework to support the development of new therapeutic strategies [ 11 Cancer stem cells (CSCs), a distinct subpopulation of tumor cells characterized by self-renewal capacity and the potential for multidirectional differentiation, play a pivotal role in the metastatic progression of tumors. Also referred to as tumor-initiating cells, CSCs have garnered substantial research interest due to their unique biological properties. Notably, CSCs exhibit pronounced resistance to conventional chemotherapy and radiotherapy, contributing to suboptimal clinical outcomes and serving as a major source of tumor recurrence and distant spread [ 12 Tumor cell proliferation is an important process tumor growth and progression. Previous studies have demonstrated that HOXB13 promotes proliferation in several types of malignancies by modulating genes associated with the cell cycle [ 13 Tumor cell migration and invasion are key processes in the metastatic cascade of malignancies [ 14 15 The initiation and progression of NPC are closely regulated by the Wnt/β-catenin signaling pathway, whose dysregulation is known to enhance tumor cell proliferation, migration, and malignant transformation. Beyond its role in promoting invasion and metastasis, aberrant activation of Wnt/β-catenin also facilitates tumor initiation and sustains cancer stem cell properties in NPC [ 16 17 18 19 20 Several limitations of the current study should be acknowledged. First, rescue experiments were not performed to confirm the specific role of HOXB13 in regulating the Wnt/β-catenin/SOX2 pathway. Second, further experimental validation is required to clarify whether the anti-tumor effects of si-HOXB13 are indeed mediated through this signaling cascade. Third, considering the established link between tumor cell stemness and therapeutic resistance, future investigations are warranted to explore whether targeting HOXB13 could modulate resistance mechanisms in NPC. Despite these limitations, our findings highlight HOXB13 as a potential molecular target for therapeutic strategies to impair stemness and metastasis in NPC. Supplementary Information Below is the link to the electronic supplementary material.  Supplementary Material 1 Publisher’s note Springer Nature remains neutral with regard to jurisdictional claims in published maps and institutional affiliations. Acknowledgements Not applicable. Author contributions All authors contributed to the study conception and design. Material preparation and the experiments were performed by Ying Xu. Data collection and analysis were performed by Xia Li. The first draft of the manuscript was written by [full name] and all authors commented on previous versions of the manuscript. All authors read and approved the final manuscript. Funding Not applicable. Data availability No datasets were generated or analysed during the current study. Declarations Ethics approval and consent to participate All procedures performed in studies involving human participants were in accordance with the standards upheld by the Ethics Committee of the Second People’s Hospital of Changzhou and with those of the 1964 Helsinki Declaration and its later amendments for ethical research involving human subjects (Approval No. 2025[KY002-01]). All animal experiments were approved by the Ethics Committee of The Second People’s Hospital of Changzhou for the use of animals and conducted in accordance with the National Institutes of Health Laboratory Animal Care and Use Guidelines (Approval No. 2025[KY002-01]). The animal experiment complies with the ARRIVE guidelines and in accordance with the National Institutes of Health guide for the care and use of Laboratory animals. Statement of informed consent Written informed consent was obtained from a legally authorized representative(s) for anonymized patient information to be published in this article. Competing interests The authors declare no competing interests. References 1. Wang R Wang F CircCENPM serves as a CeRNA to aggravate nasopharyngeal carcinoma metastasis and stemness via enhancing BMI1 Hereditas 2025 162 1 39 10.1186/s41065-025-00406-7 40087716 PMC11907939 Wang R, Wang F. CircCENPM serves as a CeRNA to aggravate nasopharyngeal carcinoma metastasis and stemness via enhancing BMI1. Hereditas. 2025;162(1):39. 10.1186/s41065-025-00406-7. Epub 2025/03/16. 40087716 10.1186/s41065-025-00406-7 PMC11907939 2. Hu L Gong P Zhou N Wang S He C Zhou Y NPM1 promotes nasopharyngeal carcinoma metastasis and stemness by recruiting Mdm2 to induce the ubiquitination-mediated degradation of p53 Am J Cancer Res 2023 13 5 1766 85 37293161 PMC10244087 Hu L, Gong P, Zhou N, Wang S, He C, Zhou Y, et al. NPM1 promotes nasopharyngeal carcinoma metastasis and stemness by recruiting Mdm2 to induce the ubiquitination-mediated degradation of p53. Am J Cancer Res. 2023;13(5):1766–85. Epub 2023/06/09. PubMed PMID: 37293161; PubMed Central PMCID: PMCPMC10244087. 37293161 PMC10244087 3. Ma A Yang Y Lu L Zhang Y Zhang X Zheng J Emerging roles of circular RNAs in nasopharyngeal carcinoma: functions and implications Cell Death Discovery 2024 10 1 192 10.1038/s41420-024-01964-x 38664370 PMC11045839 Ma A, Yang Y, Lu L, Zhang Y, Zhang X, Zheng J, et al. Emerging roles of circular RNAs in nasopharyngeal carcinoma: functions and implications. Cell Death Discovery. 2024;10(1):192. 10.1038/s41420-024-01964-x. Epub 2024/04/26. 38664370 10.1038/s41420-024-01964-x PMC11045839 4. Zhang J, Li YJ, Peng B, Yang X, Chen M, Li Y et al. HOXB13 in cancer development: molecular mechanisms and clinical implications. Frontiers of medicine. 2025. Epub 2025/03/12. 10.1007/s11684-024-1119-x. PubMed PMID: 40067581. 10.1007/s11684-024-1119-x 40067581 5. Li Q Zhao N Ding X Zhao J METTL14-mediated m6A modification upregulates HOXB13 expression to activate NF-κB and exacerbate cervical cancer progression Mol Cell Oncol 2024 11 1 2423986 10.1080/23723556.2024.2423986 39534063 PMC11556271 Li Q, Zhao N, Ding X, Zhao J. METTL14-mediated m6A modification upregulates HOXB13 expression to activate NF-κB and exacerbate cervical cancer progression. Mol Cell Oncol. 2024;11(1):2423986. PubMed PMID: 39534063; PubMed Central PMCID: PMCPMC11556271. 39534063 10.1080/23723556.2024.2423986 PMC11556271 6. Li M Tan T Geng Y Tao Y Pan J Zhang J HOXB13 facilitates hepatocellular carcinoma progression by activating akt/mtor signaling pathway Ann Hepatol 2023 28 1 100759 10.1016/j.aohep.2022.100759 36179794 Li M, Tan T, Geng Y, Tao Y, Pan J, Zhang J, et al. HOXB13 facilitates hepatocellular carcinoma progression by activating akt/mtor signaling pathway. Ann Hepatol. 2023;28(1):100759. 10.1016/j.aohep.2022.100759. Epub 2022/10/01. 36179794 10.1016/j.aohep.2022.100759 7. Zhan J Wang P Li S Song J He H Wang Y HOXB13 networking with ABCG1/EZH2/Slug mediates metastasis and confers resistance to cisplatin in lung adenocarcinoma patients Theranostics 2019 9 7 2084 99 10.7150/thno.29463 31037158 PMC6485289 Zhan J, Wang P, Li S, Song J, He H, Wang Y, et al. HOXB13 networking with ABCG1/EZH2/Slug mediates metastasis and confers resistance to cisplatin in lung adenocarcinoma patients. Theranostics. 2019;9(7):2084–99. 10.7150/thno.29463. Epub 2019/05/01. 31037158 10.7150/thno.29463 PMC6485289 8. Yu F Yu C Li F Zuo Y Wang Y Yao L Wnt/beta-catenin signaling in cancers and targeted therapies Signal Transduct Target Ther 2021 6 1 307 10.1038/s41392-021-00701-5 34456337 PMC8403677 Yu F, Yu C, Li F, Zuo Y, Wang Y, Yao L, et al. Wnt/beta-catenin signaling in cancers and targeted therapies. Signal Transduct Target Ther. 2021;6(1):307. 10.1038/s41392-021-00701-5. Epub 2021/08/31. 34456337 10.1038/s41392-021-00701-5 PMC8403677 9. Zhang L Wan Y Zhang Z Jiang Y Lang J Cheng W FTO demethylates m6A modifications in HOXB13 mRNA and promotes endometrial cancer metastasis by activating the WNT signalling pathway RNA Biol 2021 18 9 1265 78 10.1080/15476286.2020.1841458 33103587 PMC8354663 Zhang L, Wan Y, Zhang Z, Jiang Y, Lang J, Cheng W, et al. FTO demethylates m6A modifications in HOXB13 mRNA and promotes endometrial cancer metastasis by activating the WNT signalling pathway. RNA Biol. 2021;18(9):1265–78. PubMed PMID: 33103587; PubMed Central PMCID: PMCPMC8354663. 33103587 10.1080/15476286.2020.1841458 PMC8354663 10. Liu YM Wu AD Chen Y Ma TF Dong BZ She ZG Gastrodin inhibits prostate cancer proliferation by targeting canonical Wnt/beta-catenin signaling pathway Med Oncol 2023 41 1 32 10.1007/s12032-023-02254-9 38150063 Liu YM, Wu AD, Chen Y, Ma TF, Dong BZ, She ZG, et al. Gastrodin inhibits prostate cancer proliferation by targeting canonical Wnt/beta-catenin signaling pathway. Med Oncol. 2023;41(1):32. 10.1007/s12032-023-02254-9. Epub 2023/12/27. 38150063 10.1007/s12032-023-02254-9 11. Yu C Chen F Wang X Cai Z Yang M Zhong Q Pin2 telomeric repeat factor 1-interacting telomerase inhibitor 1 (PinX1) inhibits nasopharyngeal cancer cell stemness: implication for cancer progression and therapeutic targeting J Experimental Clin Cancer Research: CR 2020 39 1 31 10.1186/s13046-020-1530-3 PMC7006127 32028978 Yu C, Chen F, Wang X, Cai Z, Yang M, Zhong Q, et al. Pin2 telomeric repeat factor 1-interacting telomerase inhibitor 1 (PinX1) inhibits nasopharyngeal cancer cell stemness: implication for cancer progression and therapeutic targeting. J Experimental Clin Cancer Research: CR. 2020;39(1):31. 10.1186/s13046-020-1530-3. Epub 2020/02/08. 10.1186/s13046-020-1530-3 PMC7006127 32028978 12. Xu L Liu S Yang Y Shu L Sun Y LINC00313 suppresses autophagy and promotes stemness of nasopharyngeal carcinoma cells through PTBP1/STIM1 axis Radiotherapy Oncology: J Eur Soc Therapeutic Radiol Oncol 2024 196 110310 10.1016/j.radonc.2024.110310 38677328 Xu L, Liu S, Yang Y, Shu L, Sun Y. LINC00313 suppresses autophagy and promotes stemness of nasopharyngeal carcinoma cells through PTBP1/STIM1 axis. Radiotherapy Oncology: J Eur Soc Therapeutic Radiol Oncol. 2024;196:110310. 10.1016/j.radonc.2024.110310. Epub 2024/04/28. 10.1016/j.radonc.2024.110310 38677328 13. Johng D Torga G Ewing CM Jin K Norris JD McDonnell DP HOXB13 interaction with MEIS1 modifies proliferation and gene expression in prostate cancer Prostate 2019 79 4 414 24 10.1002/pros.23747 30560549 Johng D, Torga G, Ewing CM, Jin K, Norris JD, McDonnell DP, et al. HOXB13 interaction with MEIS1 modifies proliferation and gene expression in prostate cancer. Prostate. 2019;79(4):414–24. 10.1002/pros.23747. Epub 2018/12/19. 30560549 10.1002/pros.23747 14. Chen L Lin G Chen K Liang R Wan F Zhang C VEGF promotes migration and invasion by regulating EMT and MMPs in nasopharyngeal carcinoma J Cancer 2020 11 24 7291 301 10.7150/jca.46429 33193893 PMC7646165 Chen L, Lin G, Chen K, Liang R, Wan F, Zhang C, et al. VEGF promotes migration and invasion by regulating EMT and MMPs in nasopharyngeal carcinoma. J Cancer. 2020;11(24):7291–301. 10.7150/jca.46429. Epub 2020/11/17. 33193893 10.7150/jca.46429 PMC7646165 15. Yuan H Kajiyama H Ito S Chen D Shibata K Hamaguchi M HOXB13 and ALX4 induce SLUG expression for the promotion of EMT and cell invasion in ovarian cancer cells Oncotarget 2015 6 15 13359 70 10.18632/oncotarget.3673 25944620 PMC4537020 Yuan H, Kajiyama H, Ito S, Chen D, Shibata K, Hamaguchi M, et al. HOXB13 and ALX4 induce SLUG expression for the promotion of EMT and cell invasion in ovarian cancer cells. Oncotarget. 2015;6(15):13359–70. 10.18632/oncotarget.3673. Epub 2015/05/07. 25944620 10.18632/oncotarget.3673 PMC4537020 16. Li F Song X Li X Zhang X Feng X Wang L Lgr5 maintains stemness and regulates cell property in nasopharyngeal carcinoma through Wnt/β-catenin signaling pathway Stem Cell Res 2020 47 101916 10.1016/j.scr.2020.101916 32721896 Li F, Song X, Li X, Zhang X, Feng X, Wang L, et al. Lgr5 maintains stemness and regulates cell property in nasopharyngeal carcinoma through Wnt/β-catenin signaling pathway. Stem Cell Res. 2020;47:101916. 10.1016/j.scr.2020.101916. Epub 2020/07/30. 32721896 10.1016/j.scr.2020.101916 17. Tang Q Chen J Di Z Yuan W Zhou Z Liu Z TM4SF1 promotes EMT and cancer stemness via the Wnt/β-catenin/SOX2 pathway in colorectal cancer J Experimental Clin Cancer Research: CR 2020 39 1 232 10.1186/s13046-020-01690-z PMC7643364 33153498 Tang Q, Chen J, Di Z, Yuan W, Zhou Z, Liu Z, et al. TM4SF1 promotes EMT and cancer stemness via the Wnt/β-catenin/SOX2 pathway in colorectal cancer. J Experimental Clin Cancer Research: CR. 2020;39(1):232. 10.1186/s13046-020-01690-z. Epub 2020/11/07. 10.1186/s13046-020-01690-z PMC7643364 33153498 18. Hao Z, Zhao B, An F, Zhang W, Zhu X, Meng S et al. Knockdown of BAP31 Suppresses Tumorigenesis and Stemness in Breast Cancer Cells via the Hippo Pathway. International journal of molecular sciences. 2025;26(8). Epub 2025/05/07. 10.3390/ijms26083576. PubMed PMID: 40332113; PubMed Central PMCID: PMCPMC12026861. 10.3390/ijms26083576 PMC12026861 40332113 19. Li T Zhang G Li W Xiao J Zhou Z Tan G MicroRNA-101-3p inhibits nasopharyngeal carcinoma cell proliferation and cisplatin resistance through ZIC5 down-regulation by targeting SOX2 Biol Chem 2023 404 10 961 75 10.1515/hsz-2022-0329 36752150 Li T, Zhang G, Li W, Xiao J, Zhou Z, Tan G, et al. MicroRNA-101-3p inhibits nasopharyngeal carcinoma cell proliferation and cisplatin resistance through ZIC5 down-regulation by targeting SOX2. Biol Chem. 2023;404(10):961–75. 10.1515/hsz-2022-0329. Epub 2023/02/09. 36752150 10.1515/hsz-2022-0329 20. Jin W Yao Y Fu Y Lei X Fu W Lu Q WTAP/IGF2BP3-mediated GBE1 expression accelerates the proliferation and enhances stemness in pancreatic cancer cells via upregulating c-Myc Cell Mol Biol Lett 2024 29 1 97 10.1186/s11658-024-00611-8 38961325 PMC11223412 Jin W, Yao Y, Fu Y, Lei X, Fu W, Lu Q, et al. WTAP/IGF2BP3-mediated GBE1 expression accelerates the proliferation and enhances stemness in pancreatic cancer cells via upregulating c-Myc. Cell Mol Biol Lett. 2024;29(1):97. 10.1186/s11658-024-00611-8. Epub 2024/07/04. 38961325 10.1186/s11658-024-00611-8 PMC11223412 ",
  "metadata": {
    "Title of this paper": "WTAP/IGF2BP3-mediated GBE1 expression accelerates the proliferation and enhances stemness in pancreatic cancer cells via upregulating c-Myc",
    "Journal it was published in:": "Hereditas",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12482284/"
  }
}