{
  "title": "Paper_723",
  "abstract": "pmc Diagnostics (Basel) Diagnostics (Basel) 2841 diagno diagnostics Diagnostics 2075-4418 Multidisciplinary Digital Publishing Institute  (MDPI) PMC12468137 PMC12468137.1 12468137 12468137 41008704 10.3390/diagnostics15182332 diagnostics-15-02332 1 Systematic Review Endometriosis and Myalgic Encephalomyelitis/Chronic Fatigue Syndrome: A Systematic Review and Meta-Analysis Compton Sabrina Alkabalan Rodolf https://orcid.org/0009-0004-7583-7179 Cadet Judd Mastali Azin https://orcid.org/0000-0002-2786-0671 Ramdass Prakash V. A. K. * Ding Dah Ching Academic Editor Authier Francois Jerome Academic Editor Department of Public Health and Preventive Medicine, School of Medicine, St. George’s University, St. George P.O. Box 7, Grenada ralkabal@sgu.edu * prakash.ramdass@gmail.com 15 9 2025 9 2025 15 18 497628 2332 13 6 2025 29 8 2025 05 9 2025 15 09 2025 27 09 2025 29 09 2025 © 2025 by the authors. 2025 https://creativecommons.org/licenses/by/4.0/ Licensee MDPI, Basel, Switzerland. This article is an open access article distributed under the terms and conditions of the Creative Commons Attribution (CC BY) license ( https://creativecommons.org/licenses/by/4.0/ Background/Objectives Methods 2 Results n p 2 p Conclusions Myalgic encephalomyelitis/chronic fatigue syndrome ME/CFS endometriosis chronic inflammation diagnostic testing meta-analysis PRISMA St. George’s University School of Medicine, St. George, Grenada This research received no external funding. The APC was funded by St. George’s University School of Medicine, St. George, Grenada. pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement no pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes 1. Introduction Myalgic encephalomyelitis/chronic fatigue syndrome (ME/CFS) is a complex, multisystem disorder characterized by profound fatigue, cognitive dysfunction (often referred to as “brain fog”), post-exertional malaise (PEM), and autonomic disturbances, with an estimated global prevalence of 71 million individuals [ 1 2 3 4 5 6 Endometriosis, a chronic, estrogen-dependent inflammatory disorder defined by the presence of endometrial-like tissue outside the uterus, affects approximately 5–10% of reproductive-aged women worldwide, with prevalence rising to 30–50% among those with infertility or chronic pelvic pain [ 7 8 9 10 11 12 13 14 Concurrently, the unrelenting pain signals from endometriosis lesions promote central sensitization, a pathophysiological process where the central nervous system becomes hyper-reactive, amplifying pain signals and contributing to the widespread hyperalgesia and fatigue common to both conditions [ 15 16 Despite these potential connections, the relationship between endometriosis and ME/CFS remains underexplored. Emerging clinical observations indicate that women with endometriosis frequently report disproportionate fatigue, sleep disturbances, and cognitive impairment—symptoms that align with ME/CFS diagnostic criteria [ 17 Thus, this systematic review and meta-analysis aims to (1) synthesize existing epidemiological evidence on the co-occurrence of endometriosis and ME/CFS and (2) evaluate methodological differences in diagnostic criteria across studies. By elucidating this relationship, we hope to inform future research, enhance diagnostic precision, and guide targeted therapeutic strategies for affected individuals. 2. Materials and Methods 2.1. Protocol Registration and Reporting Guidelines To rigorously evaluate the association between endometriosis and ME/CFS, we conducted a systematic review and meta-analysis in accordance with the Preferred Reporting Items for Systematic Reviews and Meta-Analyses (PRISMA) 2020 guidelines [ 18 https://www.crd.york.ac.uk/PROSPERO/view/CRD420251006119 2.2. Data Sources and Search Strategy We performed a comprehensive literature search across multiple databases—Embase, PubMed, Scopus, Google Scholar, Open Access Theses and Dissertations ( https://oatd.org/ https://www.medrxiv.org/ 2.3. Study Selection and Eligibility Criteria We employed the PECOS (Population, Exposure, Comparator, Outcomes, Study Design) framework to define study eligibility. Population: Studies involving human participants diagnosed with endometriosis (either surgically or clinically confirmed or from self-reports) and ME/CFS (based on recognized criteria such as Fukuda 1994 [ 19 20 21 Exposure: The presence of endometriosis (for studies assessing ME/CFS risk) or ME/CFS (for studies assessing endometriosis comorbidity). Comparator: Non-endometriosis controls (for ME/CFS risk studies) or non-ME/CFS controls (for endometriosis studies). Outcomes: Primary outcomes included (1) the prevalence of ME/CFS in endometriosis populations (or vice versa), and (2) odd ratios (ORs) quantifying association strength. Study Designs: We included observational studies (cohort, case–control, cross-sectional) and clinical trials reporting primary data. Case reports, conference abstracts, letters, review articles, opinion pieces, editorials, and non-peer-reviewed articles were excluded. After importing citation files from Embase, PubMed, Scopus, and Google Scholar into Zotero, duplicates were eliminated. Two reviewers (S.C. and R.A.) independently screened titles and abstracts within Zotero. Articles meeting preliminary criteria underwent full-text review by the same reviewers. 2.4. Study Outcomes and Data Extraction The primary objective of our analytical approach was to quantitatively assess the co-occurrence of ME/CFS in endometriosis populations through systematic data extraction and synthesis. Three independent investigators (S.C., R.A., and P.R.) performed blinded data collection using a standardized protocol to minimize extraction errors and ensure inter-rater reliability. For each eligible study, investigators extracted the following key elements using a structured form—Study Identification and Methodology: first author surname and publication year, study design classification (prospective/retrospective cohort, case–control, cross-sectional), geographic location; Participant Characteristics: total sample size and subgroup numbers, endometriosis diagnostic method (visualization at surgery/histopathology vs. clinical diagnosis), ME/CFS diagnostic criteria applied; Outcome Measures: primary ME/CFS prevalence data, reported effect measures (odds ratios). All data were compiled and cross-checked using a structured Excel template. 2.5. Statistical Analysis The primary analysis focused on calculating pooled odds ratios (ORs) to quantify the strength of association between endometriosis and ME/CFS diagnosis. The primary analysis focused on calculating pooled odds ratios (ORs) to quantify the bidirectional strength of association between endometriosis and ME/CFS diagnosis, the pooled prevalence of ME/CFS in patients with endometriosis, and the pooled prevalence of endometriosis in patients with ME/CFS. All statistical analyses were performed using R statistical software (version 4.4.3; R Foundation for Statistical Computing, Vienna, Austria). For the meta-analysis of odds ratios, we employed the meta package (version 6.5-0) using a fixed-effects model with the Hartung–Knapp adjustment to provide confidence intervals for the pooled effect estimates. The inverse variance method was used to weight individual studies in both the odds ratio and prevalence analyses. For the prevalence estimates, we utilized a logit transformation with the inverse variance method to stabilize variances and account for the bounded nature of proportional data. Between-study heterogeneity was assessed using the I 2 p Publication Bias Evaluation: While conventional publication bias assessments using Begg’s rank correlation or Egger’s regression tests were not feasible due to the limited number of included studies ( n 2.6. Risk of Bias (Quality) Assessment Two independent reviewers (S.C. and R.A.) evaluated study quality using the critical appraisal tools from the Joanna Briggs Institute (JBI) Manual for Evidence Synthesis, a validated instrument for assessing risk of bias in different observational studies [ 22 3. Results 3.1. Study Characteristics Our comprehensive systematic search was conducted across four major electronic databases (PubMed, Embase, Google Scholar, and Scopus), yielding an initial pool of 384 citations published between 2002 and 2024. After removing 148 duplicate records using automated deduplication tools followed by manual verification, we screened the remaining 236 unique records based on title and abstract. This preliminary screening excluded 219 citations that did not meet our predefined eligibility criteria, primarily due to irrelevance to the research question or inappropriate study designs. Following title/abstract screening, 17 full-text articles were assessed for eligibility. Four studies were excluded at this stage. Ultimately, 13 studies fulfilled all inclusion criteria and were incorporated into the qualitative synthesis and meta-analysis. The screening and inclusion process is shown in the PRISMA flow diagram in Figure 1 The included studies comprised a mix of cross-sectional surveys ( n n n n n 19 Table 1 3.2. Prevalence of ME/CFS in Patients with Endometriosis Our analysis identified nine studies that specifically examined the co-occurrence of ME/CFS among individuals diagnosed with endometriosis. The reported prevalence estimates demonstrated substantial variability across studies, ranging from 4% [ 26 29 Figure 2 2 p 3.3. Association of Endometriosis and ME/CFS Our systematic review identified five studies that specifically investigated the association between endometriosis and ME/CFS through comparative analyses. These studies collectively included 817 endometriosis cases and 1444 controls, providing a robust dataset for examining this relationship. The individual study findings demonstrated remarkably consistent effect sizes, with reported odds ratios (ORs) ranging from 2.48 (95% CI: 1.52–4.05) in the study by Tietjen et al. [ 24 31 p 2 p Figure 3 3.4. Prevalence of Endometriosis in Patients with ME/CFS We identified four studies that specifically examined the prevalence of endometriosis among individuals diagnosed with ME/CFS. These studies collectively included a sample of 2712 ME/CFS patients, among whom 9221 cases of endometriosis were reported. The reported prevalence estimates demonstrated considerable variability across studies, ranging from 6% (95% CI: 4–9%) in the study by Castro-Marrero et al. [ 33 34 Figure 4 2 p 3.5. Association of ME/CFS and Endometriosis Two large-scale studies were identified that specifically investigated the association between ME/CFS and endometriosis, encompassing a sample size of 27,556 ME/CFS cases and 108,172 controls. The findings from these studies revealed extraordinary variation in reported effect sizes that warrants careful interpretation. The study by Fall et al. [ 36 p 34 p p 2 p Figure 5 3.6. Sensitivity Analysis The sensitivity analysis demonstrates the robustness of the pooled prevalence estimate (0.172, 95% CI: 0.059–0.408) for ME/CFS in endometriosis patients, shown in Figure 6 29 31 The sensitivity analysis, depicted in Figure 7 29 31 31 3.7. Publication Bias The funnel plot asymmetry observed in our prevalence analysis prompted further investigation using the trim-and-fill method, as illustrated in Figure 8 The funnel plot and trim-and-fill analysis of studies examining the association of endometriosis and ME/CFS association, illustrated in Figure 9 3.8. Risk of Bias Assessment Among the 13 included studies, quality assessment with the JBI (Joanna Briggs Institute) Risk of Bias (ROB) assessment across the included studies reveals variability in methodological quality, categorized as low (L), medium (M), or high (H) risk [ 22 33 23 30 31 35 28 24 29 25 36 26 32 34 Figure 10 4. Discussion This systematic review and meta-analysis reveal a significant association between endometriosis and ME/CFS, despite differences in diagnostic criteria used for these conditions. Our findings demonstrate that patients with endometriosis were 2.79 times more likely to have ME/CFS compared to controls, while the prevalence of ME/CFS among endometriosis patients was 17%. Conversely, the estimated prevalence of endometriosis in ME/CFS populations was 13%, and the association between ME/CFS and endometriosis was 2.52, suggesting a potential bidirectional relationship between these conditions based on current data. These findings highlight the need for accuracy in diagnostic testing and warrant further investigation into the potential pathophysiological links and clinical implications of these comorbidities. The lack of standardized diagnostic criteria for ME/CFS represents a fundamental challenge in studying its association with endometriosis. Our analysis revealed striking variability across studies, with only 23% employing established criteria (e.g., Fukuda [ 19 21 19 20 38 21 39 38 21 40 The overlapping cytokine profiles of endometriosis and ME/CFS provide compelling evidence for shared inflammatory pathways [ 41 42 43 44 45 46 47 48 48 Another critical mechanistic link that may explain the overlapping symptomatology observed in both endometriosis and ME/CFS is dysfunction of the HPA axis4 [ 49 50 51 52 53 54 55 While there are various mechanisms that could explain the increased association of ME/CFS in patients with endometriosis, our analysis substantiates these findings. Notably, the 17% prevalence of ME/CFS in patients with endometriosis substantially exceeds general population estimates, reinforcing clinical observations of disproportionate fatigue in this population. Notably, we found a bidirectional association between ME/CFS and endometriosis. However, these findings advocate for heightened clinical vigilance using standard diagnostic criteria and testing; fatigue in patients with endometriosis should prompt ME/CFS screening, while patients with ME/CFS reporting pelvic pain may warrant gynecologic evaluation. Therapeutically, interventions targeting shared pathways—such as anti-inflammatory diets or stress-reduction therapies—may benefit both conditions. However, the high heterogeneity in prevalence estimates underscores the need for standardized diagnostic approaches in future studies. This review’s strengths include rigorous PRISMA adherence, triple-reviewer screening, and quantitative synthesis of associations between endometriosis and ME/CFS. The trim-and-fill method assumes funnel plot asymmetry and thus suggests publication bias, but other factors (clinical heterogeneity, methodological differences) may contribute. However, the adjusted estimate remains within the original confidence interval, supporting the robustness of our primary findings. The funnel plot asymmetry may reflect selective publication of statistically significant results, underreporting of null or negative findings, or language bias (exclusion of non-English studies). While the trim-and-fill analysis suggests possible publication bias, the clinical significance of this adjustment appears limited, given that both original and adjusted estimates indicate a substantially higher prevalence of ME/CFS in patients with endometriosis compared to general population estimates (typically 0.2–0.7%) [ 1 Nevertheless, the limitations of this meta-analysis include (1) a predominance of cross-sectional designs precluding causal inference, (2) potential confounding by unmeasured variables (e.g., anxiety, depression, chronic pain syndrome, autoimmune comorbidities), and (3) overrepresentation of U.S.-based studies, limiting generalizability. In addition, the extreme heterogeneity in some analyses (I 2 20 38 21 19 27 37 56 Thus, we recommend that longitudinal studies, especially prospective cohort or case–control studies using gold standard diagnostic testing (e.g., laparoscopy with biopsy for endometriosis, and the ICC [ 40 21 5. Conclusions This systematic review and meta-analysis demonstrates a significant bidirectional association between endometriosis and ME/CFS, with endometriosis patients exhibiting 2.79-fold higher odds of ME/CFS compared to controls, and ME/CFS patients having 2.52-fold odds of having endometriosis compared to controls. The pooled prevalence of ME/CFS in endometriosis patients was 17%, while the pooled prevalence of endometriosis in ME/CFS cohorts was 13%, though with substantial heterogeneity (I 2 Disclaimer/Publisher’s Note: Author Contributions Conceptualization, P.V.A.K.R. and S.C.; methods, S.C., J.C. and P.V.A.K.R.; software, P.V.A.K.R.; validation, P.V.A.K.R.; formal analysis, P.V.A.K.R.; investigation, S.C., J.C., A.M. and R.A.; resources, P.V.A.K.R.; data extraction, S.C., P.V.A.K.R., J.C. and R.A.; writing—original draft preparation, S.C., P.V.A.K.R., J.C. and R.A.; writing, review and editing, S.C., P.V.A.K.R., J.C. and R.A.; visualization, S.C., P.V.A.K.R. and J.C.; supervision, P.V.A.K.R.; project administration, S.C., J.C., R.A., P.V.A.K.R. and A.M. All authors have read and agreed to the published version of the manuscript. Institutional Review Board Statement Not applicable. Informed Consent Statement Not applicable. Data Availability Statement This study used data from previously published studies. Data can be shared upon request. Conflicts of Interest The authors declare no conflicts of interest. Abbreviations The following abbreviations are used in this manuscript: ME/CFS Myalgic Encephalomyelitis/Chronic Fatigue Syndrome JBI Joanna Briggs Institute PRISMA Preferred Reporting Items for Systematic Reviews and Meta-Analyses HPA Hypothalamic–Pituitary–Adrenal IL Interleukin TNF Tumor Necrosis Factor ICD-9-CM International Classification of Diseases, 9th Revision, Clinical Modification CDC-SI Centers for Disease Control and Prevention Symptom Inventory References 1. Lim E.-J. Son C.-G. Review of case definitions for myalgic encephalomyelitis/chronic fatigue syndrome (ME/CFS) J. Transl. Med. 2020 18 289 10.1186/s12967-020-02455-0 32727489 PMC7391812 2. Vardaman M. Gilmour S. Letter: Time to correct the record on the global burden of myalgic encephalomyelitis/chronic fatigue syndrome (ME/CFS) J. Transl. Med. 2025 23 331 10.1186/s12967-025-06281-0 40087760 PMC11907965 3. Jason L.A. Mirin A.A. Updating the National Academy of Medicine ME/CFS prevalence and economic impact figures to account for population growth and inflation Fatigue Biomed. Health Behav. 2021 9 9 13 10.1080/21641846.2021.1878716 4. Hanson M.R. The viral origin of myalgic encephalomyelitis/chronic fatigue syndrome PLoS Pathog. 2023 19 e1011523 10.1371/journal.ppat.1011523 37590180 PMC10434940 5. Rohrhofer J. Hauser L. Lettenmaier L. Lutz L. Koidl L. Gentile S.A. Ret D. Stingl M. Untersmayr E. Immunological Patient Stratification in Myalgic Encephalomyelitis/Chronic Fatigue Syndrome J. Clin. Med. 2024 13 275 10.3390/jcm13010275 38202282 PMC10779792 6. Kemp J. Sunnquist M. Jason L.A. Newton J.L. Autonomic dysfunction in myalgic encephalomyelitis and chronic fatigue syndrome: Comparing self-report and objective measures Clin. Auton. Res. 2019 29 475 477 10.1007/s10286-019-00615-x 31115729 PMC6697554 7. Taylor H.S. Kotlyar A.M. Flores V.A. Endometriosis is a chronic systemic disease: Clinical challenges and novel innovations Lancet 2021 397 839 852 10.1016/S0140-6736(21)00389-5 33640070 8. Taylor H.S. Adamson G.D. Diamond M.P. Goldstein S.R. Horne A.W. Missmer S.A. Snabes M.C. Surrey E. Taylor R.N. An evidence-based approach to assessing surgical versus clinical diagnosis of symptomatic endometriosis Int. J. Gynecol. Obstet. 2018 142 131 142 10.1002/ijgo.12521 29729099 9. Tang W.-Z. Cai Q.-Y. Huang K.-J. Xu W.-Z. Li J.-Z. Pan Y.-R. Xu H.-Y. Zhao Y.-F. Sheng T.-H. Li Z.-M. The global burden of polycystic ovary syndrome, endometriosis, uterine fibroids, cervical cancer, uterine cancer, and ovarian cancer from 1990 to 2021 BMC Public Health 2025 25 1774 10.1186/s12889-025-22881-3 40369458 PMC12077057 10. Kuan K.K.W. Heinzl F. Horne A.W. Whitaker L.H.R. Heine J. Bekos C. Perceived effectiveness of endometriosis therapies on fatigue: An international survey Reprod. Fertil. 2025 6 e250010 10.1530/RAF-25-0010 40372805 PMC12084798 11. Mokhtari T. Irandoost E. Sheikhbahaei F. Stress, pain, anxiety, and depression in endometriosis–Targeting glial activation and inflammation Int. Immunopharmacol. 2024 132 111942 10.1016/j.intimp.2024.111942 38565045 12. Xu X. Mei J. Zhang B. Jiang X. Wang L. Zhang A. Li J. Chen S. He Y. Fang Y. Association Between Circulating Cytokines and Endometriosis: A Mendelian Randomization Study J. Cell Mol. Med. 2025 29 e70532 10.1111/jcmm.70532 40208252 PMC11984317 13. Corbitt M. Eaton-Fitch N. Staines D. Cabanas H. Marshall-Gradisnik S. A systematic review of cytokines in chronic fatigue syndrome/myalgic encephalomyelitis/systemic exertion intolerance disease (CFS/ME/SEID) BMC Neurol. 2019 19 207 10.1186/s12883-019-1433-0 31445522 PMC6708220 14. Raison C.L. Miller A.H. Malaise, melancholia and madness: The evolutionary legacy of an inflammatory bias Brain Behav. Immun. 2013 31 1 8 10.1016/j.bbi.2013.04.009 23639523 PMC3678371 15. Zheng P. Zhang W. Leng J. Lang J. Research on central sensitization of endometriosis-associated pain: A systematic review of the literature J. Pain Res. 2019 12 1447 1456 10.2147/jpr.s197667 31190954 PMC6514255 16. Wirth K.J. Löhn M. Myalgic Encephalomyelitis/Chronic Fatigue Syndrome (ME/CFS) and Comorbidities: Linked by Vascular Pathomechanisms and Vasoactive Mediators? Medicina 2023 59 978 10.3390/medicina59050978 37241210 PMC10224216 17. Álvarez-Salvago F. Lara-Ramos A. Cantarero-Villanueva I. Mazheika M. Mundo-López A. Galiano-Castillo N. Fernández-Lao C. Arroyo-Morales M. Ocón-Hernández O. Artacho-Cordón F. Chronic fatigue, physical impairments and quality of life in women with endometriosis: A case-control study Int. J. Environ. Res. Public Health 2020 17 3610 10.3390/ijerph17103610 32455618 PMC7277433 18. Page M.J. McKenzie J.E. Bossuyt P.M. Boutron I. Hoffmann T.C. Mulrow C.D. Shamseer L. Tetzlaff J.M. Akl E.A. Brennan S.E. The PRISMA 2020 statement: An updated guideline for reporting systematic reviews BMJ 2021 372 n71 10.1136/bmj.n71 33782057 PMC8005924 19. Fukuda K. Straus S.E. Hickie I. Sharpe M.C. Dobbins J.G. Komaroff A. The chronic fatigue syndrome: A comprehensive approach to its definition and study Ann. Intern. Med. 1994 121 953 959 10.7326/0003-4819-121-12-199412150-00009 7978722 20. Carruthers B.M. Jain A.K. De Meirleir K.L. Peterson D.L. Klimas N.G. Lerner A.M. Bested A.C. Flor-Henry P. Joshi P. Powles A.C.P. Myalgic Encephalomyelitis/Chronic Fatigue Syndrome J. Chronic Fatigue Syndr. 2003 11 7 115 10.1300/j092v11n01_02 21. Board on the Health of Select Populations and Committee on the Diagnostic Criteria for Myalgic Encephalomyelitis/Chronic Fatigue Syndrome Beyond Myalgic Encephalomyelitis/Chronic Fatigue Syndrome: Redefining an Illness National Academies Press Washington, DC, USA 2015 0-309-31689-8 22. Aromataris E. Lockwood C. Porritt K. Pilla B. Jordan Z. JBI Manual for Evidence Synthesis JBI Kingston, Jamaica 2024 23. Sinaii N. Cleary S.D. Ballweg M.L. Nieman L.K. Stratton P. High rates of autoimmune and endocrine disorders, fibromyalgia, chronic fatigue syndrome and atopic diseases among women with endometriosis: A survey analysis Hum. Reprod. 2002 17 2715 2724 10.1093/humrep/17.10.2715 12351553 24. Tietjen G.E. Bushnell C.D. Herial N.A. Utley C. White L. Hafeez F. Endometriosis is associated with prevalence of comorbid conditions in migraine: CME Headache 2007 47 1069 1078 10.1111/j.1526-4610.2007.00784.x 17635599 25. Boneva R.S. Maloney E.M. Lin J.-M. Jones J.F. Wieser F. Nater U.M. Heim C.M. Reeves W.C. Gynecological history in chronic fatigue syndrome: A population-based case-control study J. Women’s Health 2011 20 21 28 10.1089/jwh.2009.1900 21091051 PMC3017420 26. Smorgick N. Marsh C.A. As-Sanie S. Smith Y.R. Quint E.H. Prevalence of Pain Syndromes, Mood Conditions, and Asthma in Adolescents and Young Women with Endometriosis J. Pediatr. Adolesc. Gynecol. 2013 26 171 175 10.1016/j.jpag.2012.12.006 23507008 27. Irwin M.N. Smith M.A. Validation of ICD-9 Codes for Identification of Chronic Overlapping Pain Conditions J. Pain Palliat. Care Pharmacother. 2022 36 166 177 10.1080/15360288.2022.2089437 35900230 28. Bateman L. Darakjy S. Klimas N. Peterson D. Levine S.M. Allen A. Carlson S.A. Balbin E. Gottschalk G. March D. Chronic fatigue syndrome and co-morbid and consequent conditions: Evidence from a multi-site clinical epidemiology study Fatigue Biomed. Health Behav. 2015 3 1 15 10.1080/21641846.2014.978109 29. Boneva R.S. Lin J.-M.S. Unger E.R. Early menopause and other gynecologic risk indicators for chronic fatigue syndrome in women Menopause 2015 22 826 834 10.1097/GME.0000000000000411 25647777 PMC5745581 30. Fourquet J. Sinaii N. Stratton P. Khayel F. Alvarez-Garriga C. Bayona M. Ballweg M.L. Flores I. Characteristics of women with endometriosis from the USA and Puerto Rico J. Endometr. 2015 7 129 135 10.5301/je.5000224 PMC4910689 27331050 31. Shafrir A.L. Palmor M.C. Fourquet J. DiVasta A.D. Farland L.V. Vitonis A.F. Harris H.R. Laufer M.R. Cramer D.W. Terry K.L. Co-occurrence of immune-mediated conditions and endometriosis among adolescents and adult women Am. J. Reprod. Immunol. 2021 86 e13404 10.1111/aji.13404 33583078 PMC8243788 32. Signorile P.G. Cassano M. Viceconte R. Marcattilj V. Baldi A. Endometriosis: A Retrospective Analysis of Clinical Data from a Cohort of 4,083 Patients, with Focus on Symptoms Vivo 2022 36 874 883 10.21873/invivo.12776 PMC8931881 35241545 33. Castro-Marrero J. Faro M. Aliste L. Sáez-Francàs N. Calvo N. Martínez-Martínez A. de Sevilla T.F. Alegre J. Comorbidity in Chronic Fatigue Syndrome/Myalgic Encephalomyelitis: A Nationwide Population-Based Cohort Study Psychosomatics 2017 58 533 543 10.1016/j.psym.2017.04.010 28596045 34. Surrey E.S. Soliman A.M. Johnson S.J. Davis M. Castelli-Haley J. Snabes M.C. Risk of Developing Comorbidities Among Women with Endometriosis: A Retrospective Matched Cohort Study J. Women’s Health 2018 27 1114 1123 10.1089/jwh.2017.6432 30070938 35. Bartley E.J. Alappattu M.J. Manko K. Lewis H. Vasilopoulos T. Lamvu G. Presence of endometriosis and chronic overlapping pain conditions negatively impacts the pain experience in women with chronic pelvic–abdominal pain: A cross-sectional survey Women’s Health 2024 20 17455057241248017 10.1177/17455057241248017 PMC11057341 38682290 36. Fall E.A. Chen Y. Lin J.-M.S. Issa A. Brimmer D.J. Bateman L. Lapp C.W. Podell R.N. Natelson B.H. Kogelnik A.M. Chronic Overlapping Pain Conditions in people with Myalgic Encephalomyelitis/Chronic Fatigue Syndrome (ME/CFS): A sample from the Multi-site Clinical Assessment of ME/CFS (MCAM) study BMC Neurol. 2024 24 399 10.1186/s12883-024-03872-0 39425035 PMC11488184 37. Strauss B. Löschau M. Seidel T. Stallmach A. Thomas A. Are fatigue symptoms and chronic fatigue syndrome following Q fever infection related to psychosocial variables? J. Psychosom. Res. 2012 72 300 304 10.1016/j.jpsychores.2012.01.010 22405225 38. Murovska M.L. Stevens S. Myalgic encephalomyelitis: International Consensus Criteria J. Intern. Med. 2017 282 353 10.1111/joim.12658 28929634 PMC6885980 39. Son C.-G. Differential diagnosis between “chronic fatigue” and “chronic fatigue syndrome” Integr. Med. Res. 2019 8 89 91 10.1016/j.imr.2019.04.005 31193269 PMC6522773 40. Carruthers B.M. van de Sande M.I. De Meirleir K.L. Klimas N.G. Broderick G. Mitchell T. Staines D. Powles A.C.P. Speight N. Vallings R. Myalgic encephalomyelitis: International Consensus Criteria J. Intern. Med. 2011 270 327 338 10.1111/j.1365-2796.2011.02428.x 21777306 PMC3427890 41. DiBenedetti D. Soliman A.M. Gupta C. Surrey E.S. Patients’ perspectives of endometriosis-related fatigue: Qualitative interviews J. Patient-Rep. Outcomes 2020 4 33 10.1186/s41687-020-00200-1 32377820 PMC7203274 42. Jason L.A. Gaglio C.L. Furst J. Islam M. Sorenson M. Conroy K.E. Katz B.Z. Cytokine network analysis in a community-based pediatric sample of patients with myalgic encephalomyelitis/chronic fatigue syndrome Chronic Illn. 2023 19 571 580 10.1177/17423953221101606 35570777 PMC9666669 43. Miller J.E. Ahn S.H. Marks R.M. Monsanto S.P. Fazleabas A.T. Koti M. Tayade C. IL-17A Modulates Peritoneal Macrophage Recruitment and M2 Polarization in Endometriosis Front. Immunol. 2020 11 108 10.3389/fimmu.2020.00108 32117261 PMC7034338 44. Shi J.-L. Zheng Z.-M. Chen M. Shen H.-H. Li M.-Q. Shao J. IL-17: An important pathogenic factor in endometriosis Int. J. Med. Sci. 2022 19 769 778 10.7150/ijms.71972 35582411 PMC9108413 45. Akoum A. Al-Akoum M. Lemay A. Maheux R. Leboeuf M. Imbalance in the peritoneal levels of interleukin 1 and its decoy inhibitory receptor type II in endometriosis women with infertility and pelvic pain Fertil. Steril. 2008 89 1618 1624 10.1016/j.fertnstert.2007.06.019 17919610 46. Hornig M. Montoya J.G. Klimas N.G. Levine S. Felsenstein D. Bateman L. Peterson D.L. Gottschalk C.G. Schultz A.F. Che X. Distinct plasma immune signatures in ME/CFS are present early in the course of illness Sci. Adv. 2015 1 e1400121 10.1126/sciadv.1400121 26079000 PMC4465185 47. Wang X.-M. Ma Z.-Y. Song N. Inflammatory cytokines IL-6, IL-10, IL-13, TNF-α and peritoneal fluid flora were associated with infertility in patients with endometriosis Eur. Rev. Med. Pharmacol. Sci. 2018 22 2513 2518 10.26355/eurrev_201805_14899 29771400 48. Bashir S.T. Redden C.R. Raj K. Arcanjo R.B. Stasiak S. Li Q. Steelman A.J. Nowak R.A. Endometriosis leads to central nervous system-wide glial activation in a mouse model of endometriosis J. Neuroinflammat. 2023 20 59 10.1186/s12974-023-02713-0 PMC9987089 36879305 49. Bansal A.S. Seton K.A. Brooks J.C.W. Carding S.R. Cognitive Dysfunction in Myalgic Encephalomyelitis/Chronic Fatigue Syndrome-Aetiology and Potential Treatments Int. J. Mol. Sci. 2025 26 1896 10.3390/ijms26051896 40076522 PMC11899462 50. Ortiz R. Gemmill J.A.L. Sinaii N. Stegmann B. Khachikyan I. Chrousos G. Segars J. Stratton P. Hypothalamic-Pituitary-Adrenal Axis Responses in Women with Endometriosis-Related Chronic Pelvic Pain Reprod. Sci. Thousand Oaks Calif. 2020 27 1839 1847 10.1007/s43032-020-00201-x PMC12452883 32572832 51. Lee J.-S. Kang J.-Y. Park S.-Y. Hwang S.-J. Bae S.-J. Son C.-G. Central 5-HTergic hyperactivity induces myalgic encephalomyelitis/chronic fatigue syndrome (ME/CFS)-like pathophysiology J. Transl. Med. 2024 22 34 10.1186/s12967-023-04808-x 38191373 PMC10773012 52. Sabbadin C. Saccardi C. Andrisani A. Vitagliano A. Marin L. Ragazzi E. Bordin L. Ambrosini G. Armanini D. Role of Renin-Angiotensin-Aldosterone System and Cortisol in Endometriosis: A Preliminary Report Int. J. Mol. Sci. 2022 24 310 10.3390/ijms24010310 36613755 PMC9820500 53. Taccori A. Maksoud R. Eaton-Fitch N. Patel M. Marshall-Gradisnik S. A systematic review and meta-analysis of urinary biomarkers in myalgic encephalomyelitis/chronic fatigue syndrome (ME/CFS) J. Transl. Med. 2023 21 440 10.1186/s12967-023-04295-0 37408028 PMC10320942 54. Greygoose E. Metharom P. Kula H. Seckin T.K. Seckin T.A. Ayhan A. Yu Y. The Estrogen–Immune Interface in Endometriosis Cells 2025 14 58 10.3390/cells14010058 39791759 PMC11720315 55. McNamara H.C. Frawley H.C. Donoghue J.F. Readman E. Healey M. Ellett L. Reddington C. Hicks L.J. Harlow K. Rogers P.A.W. Peripheral, Central, and Cross Sensitization in Endometriosis-Associated Pain and Comorbid Pain Syndromes Front. Reprod. Health 2021 3 729642 10.3389/frph.2021.729642 36303969 PMC9580702 56. Nacul L. Authier F.J. Scheibenbogen C. Lorusso L. Helland I.B. Martin J.A. Sirbu C.A. Mengshoel A.M. Polo O. Behrends U. European Network on Myalgic Encephalomyelitis/Chronic Fatigue Syndrome (EUROMENE): Expert Consensus on the Diagnosis, Service Provision, and Care of People with ME/CFS in Europe Medicina 2021 57 510 10.3390/medicina57050510 34069603 PMC8161074 Figure 1 PRISMA flow chart. Figure 2 Prevalence of ME/CFS in patients with endometriosis [ 23 24 25 26 29 30 31 32 35 Figure 3 Association of endometriosis and ME/CFS [ 24 25 29 31 35 Figure 4 Prevalence of endometriosis in patients with ME/CFS [ 28 33 34 36 Figure 5 Association of ME/CFS and endometriosis [ 34 36 Figure 6 Sensitivity analysis: prevalence of ME/CFS in patients with endometriosis [ 23 24 25 26 29 30 31 32 35 Figure 7 Sensitivity analysis: prevalence of endometriosis in patients with ME/CFS [ 24 25 29 31 35 Figure 8 Funnel plot for prevalence of ME/CFS in patients with endometriosis. Figure 9 Funnel plot for the association of endometriosis and ME/CFS. Figure 10 Risk of bias assessment (JBI critical appraisal tool) [ 23 24 25 26 28 29 30 31 32 33 34 35 36 diagnostics-15-02332-t001_Table 1 Table 1 Characteristics of included studies. Study Country Study Design Criteria for Endometriosis Criteria for ME/CFS Sample Size ME/CFS in Patients with Endometriosis Sinaii, 2002 [ 23 USA Cross-sectional Surgical diagnosis Physician diagnosis 3680 Tietjen 2007 [ 24 USA Cross-sectional Self-reported Self-reported 275 Boneva, 2011 [ 25 USA Case–control Self-reported Fukuda 1994 [ 19 84 Smorgick, 2013 [ 26 USA Retrospective cohort Surgical diagnosis ICD-9-CM [ 27 138 Bateman, 2015 [ 28 USA Cross-sectional Self-reported Fukuda 1994 [ 19 960 Boneva, 2015 [ 29 USA Case–control Self-reported Fukuda 1994 [ 19 157 Fourquet, 2015 [ 30 USA/PR Cross-sectional Self-reported Self-reported 4358 Shafrir, 2021 [ 31 USA Cross-sectional Surgical diagnosis Self-reported 1203 Signorile, 2022 [ 32 Italy Retrospective cohort Self-reported Physical exam, MRI 4083 Endometriosis in Patients with ME/CFS Castro-Marrero, 2017 [ 33 Spain Cross-sectional Surgical Fukuda 1994 [ 19 320 Surrey, 2018 [ 34 USA Retrospective cohort Clinically diagnosed Clinical diagnosis 134,805 Bartley, 2024 [ 35 USA Cross-sectional Self-reported Self-reported 525 Fall, 2024 [ 36 USA Cross-sectional Self-reported CDC-SI [ 37 923 ME/CFS—Myalgic encephalomyelitis/chronic fatigue syndrome; ICD-9-CM—International Classification of Diseases, 9th Revision, Clinical Modification; CDC-SI—Centers for Disease Control and Prevention Symptom Inventory; USA—United States of America; PR—Puerto Rico. ",
  "metadata": {
    "Title of this paper": "European Network on Myalgic Encephalomyelitis/Chronic Fatigue Syndrome (EUROMENE): Expert Consensus on the Diagnosis, Service Provision, and Care of People with ME/CFS in Europe",
    "Journal it was published in:": "Diagnostics",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12468137/"
  }
}