{
  "title": "Paper_742",
  "abstract": "pmc Biomedicines Biomedicines 3168 biomedicines biomedicines Biomedicines 2227-9059 Multidisciplinary Digital Publishing Institute  (MDPI) PMC12467399 PMC12467399.1 12467399 12467399 41007705 10.3390/biomedicines13092143 biomedicines-13-02143 1 Article Diagnostic Use of Selected Metalloproteinases in Endometrioid Ovarian Cancer Gacuta Ewa Conceptualization Methodology Formal analysis 1 * Kicman Aleksandra Conceptualization Methodology Writing – original draft Writing – review & editing Visualization 2 https://orcid.org/0000-0003-4377-085X Ławicki Paweł Writing – original draft Writing – review & editing 3 Ławicki Michał Writing – original draft Writing – review & editing 3 https://orcid.org/0000-0002-5852-3723 Kulesza Monika Methodology Writing – original draft Writing – review & editing 3 Malinowski Paweł Writing – original draft Writing – review & editing 4 https://orcid.org/0000-0001-9327-4577 Chlabicz Marcin Writing – original draft Writing – review & editing 5 https://orcid.org/0000-0002-5179-0722 Zajkowska Monika Writing – original draft Writing – review & editing 6 Ławicki Sławomir Conceptualization Software Writing – original draft Writing – review & editing Supervision Project administration Funding acquisition 3 Yang Zhenshan Academic Editor 1 2 olakicman@gmail.com 3 pawellawicki04@gmail.com mlawicki@icloud.com monika.kulesza@sd.umb.edu.pl slawomir.lawicki@umb.edu.pl 4 pawelmalinowski1981@gmail.com 5 chlabicz@outlook.com 6 monika.zajkowska@umb.edu.pl * sunnyeve@wp.pl 02 9 2025 9 2025 13 9 497614 2143 29 7 2025 28 8 2025 01 9 2025 02 09 2025 27 09 2025 29 09 2025 © 2025 by the authors. 2025 https://creativecommons.org/licenses/by/4.0/ Licensee MDPI, Basel, Switzerland. This article is an open access article distributed under the terms and conditions of the Creative Commons Attribution (CC BY) license ( https://creativecommons.org/licenses/by/4.0/ Background/Objectives: Methods Results: Conclusions: EnOC cancer prevention early diagnosis MMP-3 MMP-7 MMP-10 MMP-11 MMP-26 This research received no external funding. pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement no pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes 1. Introduction Ovarian cancer (OC) is one of the most common gynecological cancers. According to global estimates, in 2022 alone, 324,398 new cases and 206,839 deaths were reported worldwide [ 1 2 3 1 2 3 4 5 6 7 1 2 High-grade serous carcinoma is the most common type of ovarian cancer, accounting for approximately 75% of epithelial ovarian cancers. In contrast, endometrioid ovarian carcinoma (EnOC) constitutes about 10% of epithelial ovarian cancer diagnoses. This is currently a poorly studied type of cancer, and it has been postulated that the precursor lesion for this type of malignant change is endometriosis, suggesting a different etiological pathway compared to other ovarian cancer subtypes [ 8 9 8 10 1 11 12 13 14 1 2 MMPs belong to a group of proteolytic enzymes whose activity depends on zinc ions. Their increased activity is mostly associated with the initiation and progression of many diseases, but a special role is attributed to them in the process of carcinogenesis. At the initiation stage, they are associated with the induction of genomic instability, whereas at subsequent stages, their activity is associated with an increase in the frequency of the proliferation, invasion, and migration of tumor cells and the induction of angiogenesis [ 2 1 2 15 1 2 16 17 2. Materials and Methods Table 1 The study included 50 patients with endometrioid ovarian cancer, classified according to the FIGO staging system into one of two groups—stage I–II (early stages) and stage III–IV (late, advanced stages). At the in-hospital diagnostic stage, histopathological evaluation has been carried out, which was the basis for the study group inclusion. Clinical, blood, X-ray, and ultrasound examinations were performed before any treatment was initiated. All patients underwent computed tomography (CT) and magnetic resonance imaging (MRI) of the pelvic organs in accordance with international clinical guidelines. Patients who were eligible for the study had not previously received radiotherapy nor chemotherapy. Due to the high levels of HE4 observed in patients with renal failure, women with this condition were excluded from the study. The control group consisted of 25 patients with endometrial cysts, 25 with serous cysts, and 50 healthy women. Patients with ovarian endometrioid cysts were treated at the Department of Gynecology of the University Clinical Hospital in Bialystok and at the University Oncology Center of the University Clinical Hospital in Bialystok from 2021 to 2025. Histopathological examination was performed in patients during the in-hospital treatment stage. Healthy female volunteers were selected based on their consultations with both a family physician and gynecologist at the University Clinical Hospital in Bialystok. Volunteers who qualified for the study underwent annual preventive examinations: laboratory tests, cervical cytology, and abdominal ultrasounds. Patients with a positive history of benign and malignant gynecological disease were not eligible for this study. Before submitting to blood tests, female volunteers underwent gynecological as well as ultrasound examinations. The study was conducted in accordance with the Declaration of Helsinki. The protocol was approved by the local Ethics Committee of the Medical University of Bialystok (committee approval number: APK.002.420.2021 (approval date 21 October 2021 and 12 December 2024)). All patients gave their informed consent to participate in the study. A medical history was also obtained from all study participants. The course of the experiment is represented by the flowchart in Figure 1 2.1. Biochemical Assays The blood samples were collected into tubes containing lithium heparin as an anticoagulant. Within one hour after collection, the blood was centrifuged at a speed of 1810× g KTE61590 2.2. Statistical Analysis Statistical analysis was performed using PQStat Software (v.1.8.4.162, Poznan, Po-land). Graphical processing was performed using GraphPad Prism Software (v. 9.1.1 (225), San Diego, CA, USA). The normality of the distribution was assessed using the Shapiro–Wilk test with Lilliefors correction—the tests showed significant deviations from the normal distribution. That is why a statistical analysis was performed using non-parametric tests. To evaluate statistical differences between the independent groups, the Kruskall–Wallis test and the Mann–Whitney U test were used, while when comparing multiple groups, the Mann–Whitney U test with Holm–Bonferroni correction for multiple queries or the Dwass–Steele–Critchlow–Fligner post hoc test were used. Medcalc statistical calculators were used to evaluate the diagnostic properties of parameters such as sensitivity (SE), specificity (SP), positive predictive value (PPV), negative predictive value (NPV), and accuracy (ACC). The analysis was based on the area under the ROC curve (AUC) and optimal cut-off points were determined with maximization of the Youden index value for the cancer–control differential test, which were as follows: 2.197 ng/mL (MMP-7), 7550 pg/mL (MMP-26), 8803.23 pg/mL (MMP-3), 59.58 pg/mL (MMP-10), 920.56 pg/mL (MMP-11), 30.185 U/mL for CA 125 and HE4 (67.11 U/mL) 3. Results 3.1. Concentrations of Selected Matrilysins and Stromelysins in Patients with Ovarian Endometrioid Carcinoma, Patients with Ovarian Cysts, and Healthy Women The concentrations of the tested parameters—MMP-7, MMP-26, MMP-3, MMP-10 and MMP-11—obtained in blood plasma from patients with ovarian endometrioid carcinoma ovarian cysts, Table 2 Table 3 Figure 2 Figure 3 Figure 4 Figure 5 Figure 6 MMP-7 concentrations were highest in the EnOC group (median: 5.64 ng/mL) compared to the BL group (2.78 ng/mL; p p p p p p Figure 2 MMP-26 concentrations were statistically lower in the EnOC group (medtian: 9425 pg/mL) than in the BL group (median: 10,985 pg/mL) ( p p p p p Figure 3 Unfortunately, there were no statistically significant differences between the tested groups in MMP-3 concentrations (EnOC median: 12,106.47 pg/mL; BL: 10,298 pg/mL; HWL: 8359 pg/mL; EC: 10,235 pg/mL; SC: 10,683 pg/mL) ( Figure 4 The highest MMP-10 concentrations (similarly to MMP-26) were found in the BL group (median: 208.80 pg/mL). This result was significantly higher compared to the EnOC group (160.35 pg/mL; p p p Figure 5 For MMP-11, the highest concentration was found in the EnOC group (median: 2733.13 pg/mL) compared to the BL group (2940 pg/mL; p p p p p Figure 6 Concentrations of both HE4 and CA125 were highest in the EnOC group (CA125 median: 396.61 U/mL; HE4 median: 338.01 U/mL) compared to the BL group (23.38 U/mL; 52.55 U/mL; p p p p p Figure 7 3.2. Evaluation of Correlation Using Spearman’s Method Spearman’s method was used to analyze potential correlations. No significant correlations were shown in the group of patients with endometrioid ovarian cancer and the healthy women group. However, in the BL total, EC, and SC groups, statistically significant positive and negative correlations were found and are presented in Table 4 3.3. Diagnostic Criteria of Tested MMPs, CA 125, and HE4 Table 5 The highest value of diagnostic sensitivity (SE) was obtained for MMP-7 (98.55%), which exceeded the SE values obtained for the routine markers CA125 (96.00%) and HE4 (80%). Equally high SE values were also obtained for MMP-26 (94%) and MMP-10 (92%). In the case of diagnostic specificity (SP), again, the highest value from among the MMPs tested was obtained for MMP-7 (86%); similar values were also obtained for MMP-11 (82%). The SP values obtained for routine markers were significantly lower (CA125: 47.95%; HE4: 52.05%) than for all MMPs tested. The highest value of positive predictive value (PPV) from all tested MMPs was obtained for MMP-7 (87.72%); comparable values were found for MMP-26 (70.15%) and MMP-10 (70.77%). However, those values were lower in comparison with those obtained for CA125 and HE4. The next parameter determined was the negative predictive value (NPV) in which MMP-7 acquired the highest value from tested MMPs (95.41%). Also, a high value was obtained for MMP-26 (90.91%) and CA125 (96.08%). The last of the parameters tested was accuracy (ACC). In this case, the best value for this parameter was obtained by MMP-10 (77.00%) and MMP-26 (77.00%). 3.4. Evaluation of the Diagnostic Power of Tests by ROC Function The diagnostic power of the tests was determined by evaluating the area under the ROC curve (AUC), which made it possible to determine whether a given test can completely distinguish between a healthy individual and a person with cancer. A diagnostically ideal test allows the complete differentiation of a healthy person from a sick person, with a sensitivity value of 100% and specificity of 100%. In such a case, the Receiver Operating Characteristic (ROC) curve would align entirely along the Y X Table 6 The highest AUC value among the tested MMPs was obtained for MMP-7 (0.9658) and MMP-11 (0.7926). The AUC value obtained for MMP-7 exceeded that of HE4 (0.9247) and was comparable to the AUC for CA125 (0.9758). All tested parameters had AUCs of more than 0.5, indicating their diagnostic usefulness. The graphical presentation of the ROC curve for the studied parameters is presented in Figure 8 4. Discussion Endometrioid ovarian cancer (EnOC) represents a distinct subtype of epithelial ovarian cancer, both in terms of its molecular profile and clinical behavior. It is notably associated with endometriosis and demonstrates unique pathophysiological features compared to high-grade serous ovarian carcinoma. Despite growing interest in ovarian cancer research, most studies have predominantly focused on the more prevalent subtypes, particularly high-grade serous carcinoma. In contrast, EnOC, which accounts for only approximately 10% of epithelial ovarian cancer cases, remains relatively understudied, and its optimal management is still not well defined. In this context, we aimed to investigate the role of selected matrix metalloproteinases (MMPs) in the pathogenesis of ENOC, with a particular focus on their diagnostic relevance. We also sought to evaluate how the behavior and potential utility of these MMPs in detecting EnOC compares to their established roles in other, more common ovarian cancer subtypes through comparison of our results with those of other authors in the available literature. This approach may provide insight into whether MMPs have higher or lower diagnostic value specifically in the context of EnOC and help identify molecular features that could inform future targeted diagnostic or therapeutic strategies. Currently, the diagnosis of this type of cancer is based on non-specific methods, including transvaginal ultrasound and serum biomarker determinations, such as HE4 and CA125, either alone or combined in the ROMA algorithm. In the case of classical markers, their concentration is affected by a number of factors related to the physiology and pathology of the female reproductive system [ 1 2 1 2 The presence of MMP-7, MMP-26, MMP-3, MMP-10, and MMP-11 expression has been previously confirmed in biopsy material from ovarian cancer patients [ 18 18 19 20 In our research, we showed that patients with EnOC have higher levels of MMP-7 (5.64 ng/mL) compared to healthy patients (0.95 ng/mL) and those with benign lesions (2.78 ng/mL). Our results agree with the work of Będkowska et al. [ 17 21 Interestingly, both Zhai et al. [ 22 23 24 25 26 Our working laboratory group’s study also showed that patients with EnOC (2733.13 pg/mL) had higher levels of MMP-11 compared to healthy women (233.13 pg/mL). This agrees with the study of Kicman et al. [ 1 27 1 28 24 29 30 In our study, we found the highest concentrations of MMP-10 in patients with benign lesions (208.80 pg/mL) compared to cancer patients (160.35 pg/mL) and healthy women (59.51 pg/mL). Importantly, higher levels of MMP-10 were found in patients with serous cysts compared to patients with endometrioid cysts. These results indicate that MMP-10 shows preliminary potential both in differentiating benign from malignant lesions as a negative marker and as a marker for differentiating histologically different subtypes of ovarian cysts, however, this requires further research. Clinically, elevated MMP-10 levels in patients with benign lesions, particularly serous cysts, may reflect activation of processes related to tissue remodeling and local inflammation rather than necessarily indicating the presence of neoplastic lesions. This suggests that MMP-10 may act as a marker of degenerative and inflammatory processes rather than a specific cancer biomarker. We are currently the first research laboratory group to demonstrate the diagnostic utility of MMP-10 in endometrioid ovarian cancer. However, in the work of Wei et al. [ 31 32 33 34 In the case of MMP-26, similarly to MMP-10, higher levels of this enzyme were found in patients with ovarian cysts (10,985 pg/mL) compared to patients with endometrioid ovarian cancer (9425 pg/mL) and healthy women (7163 pg/mL). For MMP-26, no significant differences were found between endometrioid and serous cysts. This indicates that it does not show potential in the differential diagnosis of histological subtypes of ovarian cysts; however, it can be considered as a negative marker to differentiate benign from malignant lesions. Clinically elevated MMP-26 levels in patients with ovarian cysts may indicate the enzyme’s involvement in extracellular matrix remodeling and the local inflammatory response associated with benign lesions. The results obtained by our working laboratory group are in agreement with those of Kicman et al. [ 1 1 35 36 37 Due to the fact that we did not obtain statistical significance for MMP-3, it was omitted in the Discussion section; however, there are works available that describe statistically significant differences for this parameter obtained for patients in the mixed OC group [ 1 CA125 and HE4 concentrations were higher in the EnOC group compared to the EC and the HW groups. This is consistent with the results of other researchers and indicates the proper standardization of the applied methodology of our studies, compliance with GLP (Good Laboratory Practice), and proper selection of patients for the study group and control groups by maintaining appropriate exclusion criteria [ 1 2 18 To determine potential correlations between the MMPs studied, we performed Spearman analysis. In the group of healthy women and EnOC patients, we showed no statistically significant correlations. In the group of women with benign lesions, we showed a number of statistically significant negative and positive correlations—between MMP-3, MMP-10, MMP-11, and routine markers. This indicates the dynamics of the interrelation of these markers in OC. We found only two studies that described correlations between the tested MMPs in a similar way. In the first one, the authors revealed a significant but weak positive correlation between MMP-11 and HE4 and the ROMA algorithm in women with OC [ 1 17 Sensitivity, diagnostic specificity, diagnostic accuracy, and negative and positive predictive value were calculated to determine diagnostic utility. The MMPs tested exceeded the diagnostic parameter values obtained for routine markers. The highest values of diagnostic parameters were obtained for MMP-7 (SE: 98.55%; SP: 86% NPV: 87.72%; PPV: 95.41%; ACC: 57.58%); these results are comparable and even higher than the values of diagnostic parameters obtained by Będkowska et al. [ 17 1 17 17 A final analysis to determine the power of the test was performed using ROC-AUC curves. In our study, the highest AUC values were obtained for MMP-7 (0.9658) from all tested parameters, which indicates the strong potential of MMP-7 in the diagnosis of EnOC, but it was slightly lower that established for CA125. Next were MMP-11 (0.7926), MMP-10 (0.7763), and MMP-26 (0.7708). Similar results were obtained by Będkowska et al. [ 17 1 We would like to emphasize that this is the first study involving selected matrilysin and stromelysin family members as novel diagnostic biomarkers in a rare histological type of ovarian cancer, i.e., endometrioid ovarian cancer. It should be noted that MMP-7, MMP-10, MMP-11, and MMP-26 demonstrated favorable diagnostic utility values and show preliminary potential both as differentiation markers and as candidates for early diagnosis. The clinical utility of individual MMPs, such as MMP-7 and MMP-10, should be considered in the context of established markers like CA125. Although these MMPs show high sensitivity and specificity, their overall accuracy does not surpass that of CA125. Given the small patient cohort, definitive conclusions cannot be drawn, and further studies in larger populations are needed. These markers may serve as complementary tools to enhance diagnostic precision rather than as standalone clinical markers. An additional limitation lies in the fact that all patients were recruited from a single clinical center, which may limit the generalizability of the findings. Therefore, independent studies conducted in diverse populations and clinical settings are warranted to validate our preliminary results and to further assess the diagnostic performance of the most promising biomarkers identified in this study. Despite these constraints, our findings suggest that this research holds considerable promise for advancing the biochemical diagnosis of ovarian cancer. What is worth mentioning is that matrix metalloproteinases can be present not only in the circulation in a soluble form but also on the surface of extracellular vesicles. In this vesicle-associated form, they are believed to be more resistant to self-degradation in the bloodstream, which may prolong their biological activity. Previous studies have also indicated that vesicle-bound metalloproteinases may reflect important aspects of tumor biology, and their presence has been linked to clinical and morphological parameters in serous ovarian cancer. For example, Yunusova et al. [ 38 5. Conclusions Although CA125 and HE4 remain the gold-standard serologic markers in ovarian cancer diagnostics, their limitations (particularly the low specificity of CA125) justify the search for novel biomarkers. In this context, MMP-7, MMP-10, MMP-11, and MMP-26 demonstrated promising diagnostic profiles in our cohort, suggesting that, rather than replacing established markers, they may serve as valuable complementary tools to improve diagnostic precision, especially in endometrioid ovarian cancer, and as markers in the differentiation of benign from malignant lesions. Disclaimer/Publisher’s Note: Author Contributions Conceptualization, E.G., A.K. and S.Ł.; methodology, E.G., A.K. and M.K.; software, E.G. and A.K.; validation, A.K.; formal analysis, A.K.; investigation, E.G., A.K. and M.K.; resources, S.Ł.; data curation, S.Ł.; writing—original draft preparation, E.G., A.K. and M.Z.; writing—review and editing, E.G., A.K., P.Ł., M.Ł., M.K., P.M., M.C., M.Z. and S.Ł.; visualization, A.K.; supervision, S.Ł.; project administration, E.G. and S.Ł.; funding acquisition, S.Ł. All authors have read and agreed to the published version of the manuscript. Institutional Review Board Statement The study was conducted in accordance with the Declaration of Helsinki and approved by the Ethical Committee of the Medical University of Bialystok (APK.002.420.2021 [approval date 21 October 2021]). Informed Consent Statement Informed consent was obtained from all subjects involved in the study. Conflicts of Interest The authors declare no conflicts of interest. References 1. Kicman A. Gacuta E. Kulesza M. Będkowska E.G. Marecki R. Klank-Sokołowska E. Knapp P. Niczyporuk M. Ławicki S. Diagnostic Utility of Selected Matrix Metalloproteinases (MMP-2, MMP-3, MMP-11, MMP-26), HE4, CA125 and ROMA Algorithm in Diagnosis of Ovarian Cancer Int. J. Mol. Sci. 2024 25 6265 10.3390/ijms25116265 38892452 PMC11173327 2. Kicman A. Gacuta E. Marecki R. Kicman M.S. Kulesza M. Klank-Sokołowska E. Knapp P. Niczyporuk M. Szmitkowski M. Ławicki S. Diagnostic Utility of Metalloproteinases from Collagenase Group (MMP-1, MMP-8 and MMP-13) in Biochemical Diagnosis of Ovarian Carcinoma Cancers 2024 16 3969 10.3390/cancers16233969 39682156 PMC11640008 3. Bray F. Laversanne M. Sung H. Ferlay J. Siegel R.L. Soerjomataram I. Jemal A. Global cancer statistics 2022: GLOBOCAN estimates of incidence and mortality worldwide for 36 cancers in 185 countries CA Cancer J. Clin. 2024 74 229 263 10.3322/caac.21834 38572751 4. Gęca K. Litwiński J. Ostrowski T. Świetlicka I. Polkowski W.P. Skórzewska M. Exploring the Survival Determinants in Recurrent Ovarian Cancer: The Role of Cytoreductive Surgery and Hyperthermic Intraperitoneal Chemotherapy Cancers 2024 16 2150 10.3390/cancers16112150 38893269 PMC11172164 5. Dochez V. Caillon H. Vaucel E. Dimet J. Winer N. Ducarme G. Biomarkers and Algorithms for Diagnosis of Ovarian Cancer: CA125, HE4, RMI and ROMA, a Review J. Ovarian Res. 2019 12 28 10.1186/s13048-019-0503-7 30917847 PMC6436208 6. Ortiz-Muñoz B. Aznar-Oroval E. García A.G. Peris A.C. Ballestero P.P. Yepes M.S. Lozano T.G. Ballester C.I. Garcia E.G. HE4, Ca125 and ROMA Algorithm for Differential Diagnosis between Benign Gynaecological Diseases and Ovarian Cancer Tumor Biol. 2014 35 7249 7258 10.1007/s13277-014-1945-6 24771264 7. Karlsen M.A. Sandhu N. Høgdall C. Christensen I.J. Nedergaard L. Lundvall L. Engelholm S.A. Pedersen A.T. Hartwell D. Lydolph M. Evaluation of HE4, CA125, Risk of Ovarian Malignancy Algorithm (ROMA) and Risk of Malignancy Index (RMI) as Diagnostic Tools of Epithelial Ovarian Cancer in Patients with a Pelvic Mass Gynecol. Oncol. 2012 127 379 383 10.1016/j.ygyno.2012.07.106 22835718 8. Brilhante A. Augusto K. Portela M. Sucupira L.C. Oliveira L.A. Pouchaim A.J. Mesquita Nóbrega L.R. de Magalhães T.F. Sobreira L.R. Endometriosis and Ovarian Cancer: An Integrative Review (Endometriosis and Ovarian Cancer) Asian Pac. J. Cancer Prev. 2017 18 11 16 28240000 10.22034/APJCP.2017.18.1.11 PMC5563086 9. Nakamura K. Banno K. Yanokura M. Iida M. Adachi M. Masuda K. Ueki A. Kobayashi Y. Nomura H. Hirasawa A. Features of Ovarian Cancer in Lynch Syndrome (Review) Mol. Clin. Oncol. 2014 2 909 916 10.3892/mco.2014.397 25279173 PMC4179837 10. Murakami K. Kotani Y. Nakai H. Matsumura N. Endometriosis-Associated Ovarian Cancer: The Origin and Targeted Therapy Cancers 2020 12 1676 10.3390/cancers12061676 32599890 PMC7352633 11. Giordano G. Ferioli E. Tafuni A. The Role of Mesothelin Expression in Serous Ovarian Carcinoma: Impacts on Diagnosis, Prognosis, and Therapeutic Targets Cancers 2022 14 2283 10.3390/cancers14092283 35565412 PMC9103848 12. Charkhchi P. Cybulski C. Gronwald J. Wong F.O. Narod S.A. Akbari M.R. CA125 and Ovarian Cancer: A Comprehensive Review Cancers 2020 12 3730 10.3390/cancers12123730 33322519 PMC7763876 13. Chudecka-Głaz A. Strojna A. Michalczyk K. Wieder-Huszla S. Safranow K. Skwirczyńska E. Jurczak A. Evaluation of He4 Use in the Diagnosis of Ovarian Cancer: First and Second Recurrence, and an Analysis of HE4 Concentration during Second- and Third-Line Chemotherapy Diagnostics 2023 13 452 10.3390/diagnostics13030452 36766556 PMC9913987 14. Ma B. Ran R. Liao H.Y. Zhang H.H. The paradoxical role of matrix metalloproteinase-11 in cancer Biomed. Pharmacother. 2021 141 111899 10.1016/j.biopha.2021.111899 34346316 15. Mustafa S. Koran S. AlOmair L. Insights Into the Role of Matrix Metalloproteinases in Cancer and Its Various Therapeutic Aspects: A Review Front. Mol. Biosci. 2022 9 896099 10.3389/fmolb.2022.896099 36250005 PMC9557123 16. Będkowska G.E. Piskór B. Gacuta E. Zajkowska M. Osada J. Szmitkowski M. Dąbrowska M. Ławicki S. Diagnostic Power of Selected Cytokines, MMPs and TIMPs in Ovarian Cancer Patients—ROC Analysis Anticancer Res. 2019 39 2575 2582 10.21873/anticanres.13380 31092455 17. Będkowska G.E. Gacuta E. Zajkowska M. Głażewska E.K. Osada J. Szmitkowski M. Chrostek L. Dąbrowska M. Ławicki S. Plasma Levels of MMP-7 and TIMP-1 in Laboratory Diagnostics and Differentiation of Selected Histological Types of Epithelial Ovarian Cancers J. Ovarian Res. 2017 10 39 10.1186/s13048-017-0338-z 28662671 PMC5492921 18. Kicman A. Niczyporuk M. Kulesza M. Motyka J. Ławicki S. Utility of Matrix Metalloproteinases in the Diagnosis, Monitoring and Prognosis of Ovarian Cancer Patients Cancer Manag. Res. 2022 14 3359 3382 10.2147/CMAR.S385658 36474934 PMC9719685 19. Roy R. Yang J. Moses M.A. Matrix Metalloproteinases As Novel Biomarker s and Potential Therapeutic Targets in Human Cancer J. Clin. Oncol. 2009 27 5287 5297 10.1200/JCO.2009.23.5556 19738110 PMC2773480 20. Al-Alem L. Curry T.E. Ovarian Cancer: Involvement of the Matrix Metalloproteinases Reproduction 2015 150 R55 R64 10.1530/REP-14-0546 25918438 PMC4955511 21. Acar A. Onan A. Coskun U. Uner A. Bagriacik U. Atalay F. Unsal D.K. Guner H. Clinical Significance of Serum MMP-2 and MMP-7 in Patients with Ovarian Cancer Med. Oncol. 2008 25 279 283 10.1007/s12032-007-9031-1 18071928 22. Zhai Y. Wu R. Schwartz D.R. Darrah D. Reed H. Kolligs F.T. Nieman M.T. Fearon E.R. Cho K.R. Role of beta-catenin/T-cell factor-regulated genes in ovarian endometrioid adenocarcinomas Am. J. Pathol. 2002 160 1229 1238 10.1016/S0002-9440(10)62550-3 11943708 PMC1867221 23. Sillanpää S.M. Anttila M.A. Voutilainen K.A. Ropponen K.M. Sironen R.K. Saarikoski S.V. Kosma V.M. Prognostic significance of matrix metalloproteinase-7 in epithelial ovarian cancer and its relation to beta-catenin expression Int. J. Cancer 2006 119 1792 1799 10.1002/ijc.22067 16804904 24. Zeng L. Qian J. Zhu F. Wu F. Zhao H. Zhu H. The prognostic values of matrix metalloproteinases in ovarian cancer J. Int. Med. Res. 2020 48 300060519825983 10.1177/0300060519825983 31099295 PMC7140190 25. Piskór B.M. Przylipiak A. Dąbrowska E. Sidorkiewicz I. Niczyporuk M. Szmitkowski M. Ławicki S. Plasma Concentrations of Matrilysins MMP-7 and MMP-26 as Diagnostic Biomarkers in Breast Cancer J. Clin. Med. 2021 10 1436 10.3390/jcm10071436 33916127 PMC8036770 26. Dimitrova I. Tacheva T. Mindov I. Petrov B. Aleksandrova E. Valkanov S. Gulubova M. Serum levels of MMP-7 in primary brain cancers and brain metastases Biotechnol. Biotechnol. Equip. 2019 33 881 885 10.1080/13102818.2019.1626282 27. Rasool M. Malik A. Basit Ashraf M.A. Parveen G. Iqbal S. Ali I. Qazi M.H. Asif M. Kamran K. Iqbal A. Evaluation of Matrix Metalloproteinases, Cytokines and Their Potential Role in the Development of Ovarian Cancer PLoS ONE 2016 11 e0167149 10.1371/journal.pone.0167149 27902750 PMC5130238 28. Périgny M. Bairati I. Harvey I. Beauchemin M. Harel F. Plante M. Têtu B. Role of immunohistochemical overexpression of matrix metalloproteinases MMP-2 and MMP-11 in the prognosis of death by ovarian cancer Am. J. Clin. Pathol. 2008 129 226 231 10.1309/49LA9XCBGWJ8F2KM 18208802 29. Pang L. Wang D.W. Zhang N. Xu D.H. Meng X.W. Elevated serum levels of MMP-11 correlate with poor prognosis in colon cancer patients Cancer Biomark. 2016 16 599 607 10.3233/CBM-160601 27002762 30. Zhang Y. Wang J. Fan Y. Lang F. Fu F. Liu Q. MMP11 and MMP17 are potential biomarkers for uterine corpus endometrial carcinoma prognosis Clin. Transl. Oncol. 2024 26 653 663 10.1007/s12094-023-03284-5 37523078 31. Wei J. Zhang L. Li J. Zhu S. Tai M. Mason C.W. Chapman J.A. Reynolds E.A. Weiner C.P. Zhou H.H. MicroRNA-205 promotes cell invasion by repressing TCF21 in human ovarian cancer J. Ovarian Res. 2017 10 33 10.1186/s13048-017-0328-1 28476165 PMC5420089 32. Mariya T. Hirohashi Y. Torigoe T. Tabuchi Y. Asano T. Saijo H. Kuroda T. Yasuda K. Mizuuchi M. Saito T. Matrix metalloproteinase-10 regulates stemness of ovarian cancer stem-like cells by activation of canonical Wnt signaling and can be a target of chemotherapy-resistant ovarian cancer Oncotarget 2016 7 26806 26822 10.18632/oncotarget.8645 27072580 PMC5042016 33. Ke X. Zhang S. Wu M. Lou J. Zhang J. Xu T. Huang L. Huang P. Wang F. Pan S. Tumor-associated macrophages promote invasion via Toll-like receptors signaling in patients with ovarian cancer Int. Immunopharmacol. 2016 40 184 195 10.1016/j.intimp.2016.08.029 27608303 34. Piskór B.M. Przylipiak A. Dąbrowska E. Sidorkiewicz I. Niczyporuk M. Szmitkowski M. Ławicki S. Plasma Level of MMP-10 May Be a Prognostic Marker in Early Stages of Breast Cancer J. Clin. Med. 2020 9 4122 10.3390/jcm9124122 33371324 PMC7767367 35. Ripley D. Tunuguntla R. Susi L. Chegini N. Expression of matrix metalloproteinase-26 and tissue inhibitors of metalloproteinase-3 and -4 in normal ovary and ovarian carcinoma Int. J. Gynecol. Cancer 2006 16 1794 1800 10.1136/ijgc-00009577-200609000-00012 17009974 36. Zhao Y.G. Xiao A.Z. Ni J. Man Y.G. Sang Q.X. Expression of matrix metalloproteinase-26 in multiple human cancer tissues and smooth muscle cells Ai Zheng. 2009 28 1168 1175 10.5732/cjc.008.10768 19895737 37. Tunuguntla R. Ripley D. Sang Q.X. Chegini N. Expression of matrix metalloproteinase-26 and tissue inhibitors of metalloproteinases TIMP-3 and -4 in benign endometrium and endometrial cancer Gynecol. Oncol. 2003 89 453 459 10.1016/S0090-8258(03)00077-5 12798711 38. Yunusova N.V. Patysheva M.R. Molchanov S.V. Zambalova E.A. Grigor’eva A.E. Kolomiets L.A. Ochirov M.O. Tamkovich S.N. Kondakova I.V. Metalloproteinases at the surface of small extrcellular vesicles in advanced ovarian cancer: Relationships with ascites volume and peritoneal canceromatosis index Clin. Chim. Acta 2019 494 116 122 10.1016/j.cca.2019.03.1621 30904547 Figure 1 Flowchart of the experiment. Figure 2 MMP-7 concentrations in the study groups— Endometrioid Ovarian carcinoma Figure 3 MMP-26 concentrations in the study groups— Endometrioid Ovarian carcinoma Figure 4 MMP-3 concentrations in the study groups— Endometrioid Ovarian carcinoma Figure 5 MMP-10 concentrations in the study groups— Endometrioid Ovarian carcinoma Figure 6 MMP-11 concentrations in the study groups— Endometrioid Ovarian carcinoma Figure 7 CA125 and HE4 concentrations in the study groups— Endometrioid Ovarian carcinoma Figure 8 ROC curve for tested parameters. biomedicines-13-02143-t001_Table 1 Table 1 Characteristics of examined groups: ovarian endometrioid carcinoma, (endometrial cysts serous cysts), Ovarian Endometrioid Carcinoma (EnOC) Number of patients—50 (100%) Ovarian Benign Lesions (BL)  Endometrial Cysts (EC)  Serous Cysts (SC) Number of patients—25 (50%) Number of patients—25 (50%) Healthy Women (HW) Number of patients—50 (100%) biomedicines-13-02143-t002_Table 2 Table 2 Plasma concentrations of the studied parameters in the tested groups (EnOC and HW). Endometrioid Ovarian Carcinoma (EnOC) Parameter MMP-7 MMP-26 MMP-3 MMP-10 MMP-11 CA125 HE4 Median 5.64 9425.00 12,106.47 160.35 2733.13 149.10 338.01 Standard deviation 5.93 7332.16 8519.96 190.39 3138.24 496.78 410.71 Minimum 2.20 3578.00 3468.52 38.90 40.00 19.60 35.57 Quartile 1 3.77 8625.00 6705.05 65.32 766.75 64.87 90.52 Quartile 3 9.64 13,310.00 14,768.24 177.36 3900.00 609.55 430.30 Maximum 27.40 42,070.00 40,000.00 954.50 15,180.00 2100.00 1944.00 Healthy Women (HW) Parameter MMP-7 MMP-26 MMP-3 MMP-10 MMP-11 CA125 HE4 Median 0.95 7163.00 10,719.41 59.51 762.00 16.90 39.51 Standard deviation 1.08 7903.60 7605.36 41.96 807.22 7.45 14.68 Minimum 0.04 3037.55 3178.22 12.30 20.00 4.24 23.52 Quartile 1 0.66 3920.00 6329.89 28.37 260.00 11.38 31.07 Quartile 3 1.87 7162.50 11,880.69 77.06 895.00 22.27 44.53 Maximum 5.23 9128.75 36,528.70 249.54 4400.00 39.94 1944.20 biomedicines-13-02143-t003_Table 3 Table 3 Plasma concentrations of the studied parameters in the tested groups (endometrial cysts and serous cysts). Benign Lesions Total Group (BL) Parameter MMP-7 MMP-26 MMP-3 MMP-10 MMP-11 CA125 HE4 Median 2.78 10,985.00 10,298.00 208.80 190.00 23.38 52.55 Standard deviation 1.28 4342.00 10,298.00 170.50 1610.00 57.43 18.61 Minimum 1.50 5140.00 1054.00 30.98 20.00 8.900 28.20 Quartile 1 2.27 9591.00 8211.00 149.70 55.00 13.13 43.65 Quartile 3 3.50 12,539.00 16,332.00 353.90 440.00 43.98 62.91 Maximum 7.52 27,235.00 37,648.00 898.10 7640.00 410.30 112.30 Ovarian Endometrioid Cyst (EC) Parameter MMP-7 MMP-26 MMP-3 MMP-10 MMP-11 CA125 HE4 Median 2.80 10,825.00 10,235.00 160.35 233.13 24.98 53.20 Standard deviation 3.17 11,265.58 12,604.60 190.39 1338.24 496.78 410.71 Minimum 1.31 4122.06 7245.47 38.90 40.00 19.60 35.57 Quartile 1 1.84 5140.00 1054.22 65.32 76.75 64.87 90.52 Quartile 3 2.79 10,825.00 9968.57 177.36 390.00 609.55 430.30 Maximum 3.51 12,538.75 16,615.94 954.48 7518.00 2100.00 1944.20 Ovarian Serous Cyst (SC) Parameter MMP-7 MMP-26 MMP-3 MMP-10 MMP-11 CA125 HE4 Median 2.94 12,169.00 10,683.00 113.80 200.00 19.00 51.47 Standard deviation 1.25 4519.00 3774.00 187.10 1160.00 13.54 22.46 Minimum 1.50 5975.00 4972.00 30.98 20.00 9.00 35.15 Quartile 1 2.07 9660.00 8079.00 150.50 90.00 12.58 40.86 Quartile 3 3.39 13,593.00 14,959.00 335.30 430.00 37.10 62.95 Maximum 7.52 27,235.00 17,599.00 898.10 7640.00 47.30 112.30 biomedicines-13-02143-t004_Table 4 Table 4 Spearman correlation in the BL total group and SC group (only significant results).  MMP-7 MMP-26 MMP-3 MMP-10 MMP-11 CA125 HE4  BL Total Group MMP-3 N/S N/S - N/S p p p MMP-10 N/S N/S N/S - p N/S N/S MMP-11 p N/S p p - p p  SC Group MMP-26 N/S - N/S p p p p MMP-3 p p - p p p p MMP-10 N/S N/S p - p p p MMP-11 p N/S p p N/S p p Abbreviations: N/S—non significant. biomedicines-13-02143-t005_Table 5 Table 5 Diagnostic criteria for MMPs, CA125, and HE4. Parameter SE [%] SP [%] PPV [%] NPV [%] ACC [%] MMP-7 98.55% 86.00% 87.72% 95.41% 57.58% MMP-26 94.00% 60.00% 70.15% 90.91% 77.00% MMP-3 58.00% 60.00% 59.18% 58.82% 59.00% MMP-10 92.00% 62.00% 70.77% 88.57% 77.00% MMP-11 32.00% 82.00% 64.00% 54.67% 57.00% CA125 96.00% 47.95% 97.96% 96.08% 97.00% HE4 80.00% 52.05% 93.02% 82.46% 87.00% biomedicines-13-02143-t006_Table 6 Table 6 Diagnostic power of tests by ROC function of the tested parameters and tumor markers. Parameters MMP-7 MMP-26 MMP-3 MMP-10 MMP-11 CA125 HE4 AUC 0.9658 0.7708 0.5679 0.7763 0.7926 0.9758 0.9247 SE AUC 0.0165 0.0520 0.0616 0.0485 0.0509 0.0101 0.0306 95% CI 0.9335–0.9981 0.6688–0.8727 0.4471–0.6886 0.6812–0.8714 0.6928–0.8925 0.9660–1.006 0.8647–0.9848 p <0.0001 <0.0001 0.2772 <0.0001 <0.0001 <0.0001 <0.0001 ",
  "metadata": {
    "Title of this paper": "Metalloproteinases at the surface of small extrcellular vesicles in advanced ovarian cancer: Relationships with ascites volume and peritoneal canceromatosis index",
    "Journal it was published in:": "Biomedicines",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12467399/"
  }
}