{
  "title": "Paper_839",
  "abstract": "pmc BMC Cancer BMC Cancer 16 bmccanc BMC Cancer 1471-2407 BMC PMC12462318 PMC12462318.1 12462318 12462318 40993589 10.1186/s12885-025-14477-2 14477 1 Research Combination of hydralazine and all-trans retinoic acid targeting breast cancer cells Yahyapour Amirhesan http://orcid.org/0000-0002-9462-1144 Askari Nahid n.askari@kgut.ac.ir Yaghoobi Mohammad Mehdi https://ror.org/0451xdy64 grid.448905.4 0000 0004 4910 146X Department of Biotechnology, Institute of Science and High Technology and Environmental Sciences, Graduate University of Advanced Technology, 24 9 2025 2025 25 478185 1427 1 3 2025 10 6 2025 24 09 2025 26 09 2025 26 09 2025 © The Author(s) 2025 2025 https://creativecommons.org/licenses/by-nc-nd/4.0/ Open Access http://creativecommons.org/licenses/by-nc-nd/4.0/ Background Breast cancer is one of the most common malignancies and causes of mortality in women. Combination therapies are one of the treatment approaches that contribute to better performance, reduced dosage, and drug resistance. Hydralazine is an antihypertensive drug, but it can induce epigenetic changes such as DNA methylation reversal in cancer cells. ATRA is a type of vitamin A, and its deficiency is associated with the progression of various diseases. It can bind to receptors and regulate genes to inhibit multiple types of cancers. Methods According to bioinformatics studies, combining these two drugs can inhibit breast cancer cells. This study investigates various biological pathways, such as HIF-1, VEGF, and WNT, with the key genes of CCND1 VEGFA VEGFA2 HIF1A HIF1A-AS 50 Results Results showed that hydralazine alone stimulated cancer cell growth, potentially inducing breast cancer. ATRA reduced cell survival in both normal and cancer cells. However, the combination treatment exhibited differential effects, causing a significant reduction in survival in cancer cells while the impact on normal cells was not significant. Conclusions Hydralazine/ATRA combination inhibits cancer cell proliferation and their adaptation to hypoxia. These findings suggest a potential for new treatment targeting breast cancer cells with minimized side effects. Clinical trial registration Clinical trial number: “not applicable”. Supplementary Information The online version contains supplementary material available at 10.1186/s12885-025-14477-2. Keywords Breast cancer Hydralazine All-trans retinoic acid (ATRA) Drug synergy Cell proliferation pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement yes pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes issue-copyright-statement © BioMed Central Ltd., part of Springer Nature 2025 Introduction Cancer is one of the leading causes of death worldwide and a complex disease caused by genetic mutations in cells during tumor growth. Conventional cancer treatments, such as chemotherapy, radiotherapy, or immunotherapy, although often effective, have significant drawbacks, including tumor resistance and considerable side effects, such as decreased appetite, nausea, weakness, and hair loss. To address these limitations and reduce the necessary drug dosage, targeted therapies are being explored, focusing on discovering innovative compounds. Dual drug compounds offer a promising strategy to overcome these negative aspects of current treatment options [ 1 Cancer drugs prevent tumor growth and metastasis by inhibiting cell proliferation, differentiation, and angiogenesis, as well as inducing programmed cell death. By targeting angiogenesis, they deprive tumors of the nutrients and oxygen necessary for their growth and spread. Despite their effectiveness, resistance to anti-angiogenic therapies can develop over time. It necessitated the development of complementary approaches to overcome this resistance and improve treatment outcomes [ 2 3 4 5 Breast cancer is one of the most commonly diagnosed cancers worldwide. It originates from breast tissue and is the most common cause of cancer-related death in women. Nearly 660,000 people die from this cancer annually [ 6 This study explores the effects of hydralazine and ATRA, both individually and in combination, on human breast cells through bioinformatics and in vitro methods. The goal is to introduce a promising combined approach for breast cancer treatment. Additionally, the study examines cell survival, invasion, and the expression of key genes in breast cancer signaling pathways. Notably, there have been no previous reports on the combined anticancer activity of these two drugs on cancer cells. Methods and materials The steps of the study are shown in Fig. 1  Fig. 1 Schematic representation of the methods used in the present study Drugs and biological pathways The https://go.drugbank.com/ 7 https://www.kegg.jp/ Targets https://www.way2drug.com/passonline/ http://www.swisstargetprediction.ch/ 8 9 Gene expression analysis The https://gtexportal.org HIF1A VEGFA CCND1 https://tnmplot.com 10 https://kmplot.com/ 11 Gene enrichment pathways Enrichment analyses are basic molecular pathways and functional categories of genes, such as Gene Ontology. ShinyGO is a graphical web-based software at http://bioinformatics.sdstate.edu/go/ 12 Cell culture The MDA-MB-231 and MCF10 were obtained from Tehran Pasteur Cell Bank and Stem Cell Technology Research Center (STRC), respectively. They were cultured in Dulbecco’s Modified Eagle Medium (DMEM) (Manufactured by Gibco, USA) supplemented with 10% fetal bovine serum (Gibco, USA), 100 µg/ml of amphotericin B (CIPLA LTD, India), penicillin (Jaber Ebne Hayyan Pharmaceutical, Iran), and streptomycin (Nitin Lifescience, India). They were maintained in an incubator with 5% CO 2 MTT and isoblogram test MTT test can measure cell viability and IC 50 50 For the isoblogram test, 10,000 cells were placed in 100 µL of medium in each well. After 24 h of incubation, variable concentrations of 25, 50, and 100 µM of hydralazine combined with a constant concentration of 100 µM of ATRA, and variable concentrations of 50, 100, and 200 µM of ATRA combined with a constant concentration of 100 µM of hydralazine, were added in 150 µL of the new medium. Doxorubicin treatment was used as a positive control. After 24 h of incubation, the drugs (except for doxorubicin) were recharged, and the plate was incubated for an additional 24 h. Finally, as mentioned in the MTT test, the color intensity of each well was read using an ELISA reader. Wound healing test This test can simulate the cellular migration in the body using cell-cell connections to heal the wound. Initially, 100,000 cells were added to each well of a 24-well plate using TRED and symmetrically spread. After 24 h of incubation and observing a cell density of about 80%, a direct scratch was made in each well’s middle using the yellow pipette tip. Next, the fresh culture medium with selected concentrations of each drug (100 µM of hydralazine and 100 µM of ATRA) and their combination was treated with the cells. Photos were taken of the wound area at 0, 24, and 48 h of incubation. Finally, the image analysis was performed using the ImageJ software (wound healing plugin), and the statistical analysis was performed using Prism software (version 8.0). Gene expression analysis using Real-time PCR Several primers were designed for five key genes of CCND1 VEGFA VEGFA2 HIF1A HIF1A-AS VEGFA https://www.ncbi.nlm.nih.gov/nucleotide 1  Table 1 Primers used in the Real-Time PCR reaction, along with their sequences Genes Accession numbers Sequences Products  VEGF 165b isoform  (long form isoform g) NM_001033756 CGCAGACGTGTAAATGTTCCTG (F) 97 bp (R) TTCCTGGTGAGAGATCTGCAAG  VEGF Isoform 20  (long form isoform b) NM_003376.6 TCCTGGAGCGTTCCCTGT(F) 160 bp (R) GCCTCGGCTTGTCACATCT  HIF1-α NM_001530.4 GCAGCAACGACACAGAAAC (F) 166 bp (R) GCAGGGTCAGCACTACTTC  HIF1α -AS1 NR_047116.1 CACACGCGGAGAAGAGAAG (F) 177 bp (R) GGTTGGGGTACTGGAAGCA  GAPDH NM_0012 GAGTCAACGGATTTGGTCG (F) 149 bp (R) GAATTTGCCATGGGTGGA  CCND1 NM_053056.3 CGCTTTGTCTGTCGTGAT (F) 197 bp (R) TACATGTTGGTGCTGGGAA A 6-well plate, TRED, and specific solutions in the ParsTous kit (Iran) were used to extract the total RNA (rRNA, tRNA, and mRNA) of the designed treatments (ATRA, hydralazine, and their combinations) in both cell lines. Next, the DNase enzyme was used to remove potential genomic DNA, and then, it was inactivated by EDTA (manufactured by ASD, Iran). The amount of extracted RNA was measured using a Nanodrop device (Montreal Biotech, Canada) at wavelengths of 260 to 280 nm. A value in the range of 2 to 2.2 is acceptable. Then, electrophoresis on an agarose gel was done to ensure the quality of the RNA. Extracted RNA was used to synthesize cDNA using the reverse transcriptase enzyme in the ParsTous kit (Iran). Using the Rotor-Gene 3000 (Corbett, Australia), expression levels of HIF1A HIF1A-AS VEGFA VEGFA2 CCND1 GAPDH Results Biological pathways of hydralazine The bioinformatics analysis showed the effects of hydralazine on both healthy and cancerous cells through the HIF-1 and VEGF pathways (Fig. 2 13 VEGF  Fig. 2 The HIF-1 pathway in the KEGG database responses to cellular oxygen levels. In normoxic conditions, PHD enzymes use 2-oxoglutarate, ascorbate, iron, and oxygen to hydroxylate Pro402 and Pro564 residues in the oxygen-dependent degradation domain of the HIF-1α subunit. In hypoxic conditions, deficiency in co-factors or an increase in nitric oxide and reactive oxygen species leads to a reduction in the hydroxylation and degradation of HIF-1α. So, it will be stabilized and translocated to the nucleus, where it dimerizes with HIF-1β. This complex binds to hypoxia response elements in the promoter of the VEGF Biological pathways of ATRA The results of KEGG and Drugbank databases showed that ATRA can affect both healthy and cancerous cells through the regulation of the cell cycle, VEGF, and Wnt/β-catenin pathways. In the ATRA-RAR signaling pathway, ATRA binds to retinoic acid receptors (RARs) and retinoid X receptors (RXRs) in the cell nucleus, activating them. These activated complexes reduce VEGF levels, leading to less blood vessel formation, tumor growth, and cell proliferation. Additionally, ATRA lowers the expression of CCND1 3  Fig. 3 Functional pathways of ATRA in the human body. ( A B C CCND1 as ATRA halts the cell cycle in breast cancer cells by increasing the expression of cyclin-dependent kinase (CDK) inhibitors such as p21 and p27, which reduce CDK activity and prevent cell cycle progression in breast cancer [ 14 3 In the ATRA-RAR signaling pathway, ATRA binds to RARs and RXRs in the cell nuclei, activating them. These activated complexes decrease VEGF expression, leading to reduced angiogenesis, tumor growth, and proliferation [ 15 3 Besides, ATRA suppresses the expression of CCND1 16 3 Drug targets Molecular targets of the drug obtained from the way2drug database are listed in Table 2 4  Fig. 4 Target categorization of hydralazine and ATRA  Table 2 Direct and indirect targets of hydralazine and ATRA, along with the probability of binding for each drug Drugs Interaction Target names Confidence Hydralazine Direct Tyrosine-protein kinase receptor FLT3 0.8759 Cell division cycle 2-like protein kinase 6 0.6967 Mediated Cytochrome P450 3A4 0.6882 Nuclear receptor subfamily 0 group B member 1 0.4936 ATRA Direct Retinoic acid receptor 0.7789 Cytochrome P450 2C9 0.5903 Mediated Solute carrier organic anion transporter family member 1B3 0.5228 Nuclear receptor subfamily 0 group B member 1 0.5204 Gene expression analysis The results of gene expression analysis obtained from the GTEX and TNMplot databases show that these genes are suitable for the study (Fig. 5  Fig. 5 Gene expression analysis in healthy and cancerous conditions. ( A B Patients survival The survival rate of patients using the Kaplan-Meier plotter database showed that the aberrant expression of HIF1A VEGFA CCND1 6  Fig. 6 Kaplan-Meier plots showing patients’ survival differences with gene expression changes due to mutations, including statistical analysis for survival time Enrichment pathways ShinyGO enrichment pathways analysis for the genes of interest is listed in Table 3  Table 3 Biological pathways of HIF1A VEGFA CCND1 Pathways Enrichment FDR nGenes Genes in the Pathway Bladder cancer 2.0E-04 2 41 Pathways in cancer 2.0E-04 3 530 Kaposi sarcoma-associated herpesvirus infection 2.2E-05 3 194 Proteoglycans in cancer 2.2E-05 3 202 Renal cell carcinoma 3.4E-04 2 68 Pancreatic cancer 3.6E-04 2 76 AGE-RAGE signaling pathway in diabetic complications 5.3E-04 2 100 HIF-1 signaling pathway 5.5E-04 2 109 Thyroid hormone signaling pathway 6.1E-04 2 121 MicroRNAs in cancer 9.7E-04 2 161 MTT method After the cell culture steps (Fig. 7 8 50 50  Fig. 7 Morphology of breast cell lines. ( A B  Fig. 8 MTT test results show the cytotoxicity of ATRA and the growth stimulation of hydralazine in both cell lines with concentration increase. ( A B Isobologram test The results obtained from the reduction of formazan crystals after 48 h are shown in Fig. 9  Fig. 9 The results of the isobologram test in both cell lines show cell viability in treatments with selected constant concentration of 100 µM for hydralazine, and a variable concentration close to the IC 50 A B Wound healing test Statistical analysis graphs for both cell lines are shown in Fig. 10 11  Fig. 10 Wound healing graphs show a decrease in migration rate in the combined drug treatment (P-values < 0.05 are significant). ( A B  Fig. 11 Results of the wound healing test in MDA-MB-231 cells, showing the effectiveness of the ATRA/hydralazine combination on the cells’ migration MCF10 control cells were not treated with any drug, and after 48 h, the gap was almost closed. Doxorubicin Treatment showed complete inhibition of cell migration, apoptosis, and morphological changes in these non-tumor cells in a way that analysis with ImageJ software was not possible in the images taken 48 h later. The treatment with hydralazine alone showed cell migration as the control cells. Treatment with ATRA indicated complete inhibition of cell migration, degradation, destruction, and morphological changes in this cell line. The hydralazine and ATRA combination did not show significant effects on cell migration compared to the individual drugs, indicating the non-cytotoxicity and lack of inhibition of this combination on these healthy breast tissue cells (Fig. 12  Fig. 12 Results of the wound healing test in MCF10 cells show the combination’s lesser impact compared to doxorubicin Gene expression analysis by real-time PCR According to Fig. 13  Fig. 13 Comparative analysis of RT-PCR. The combination of ATRA and hydralazine can be selected as the most effective treatment with the greatest effect on MDA-MB-231 cells and the least effect on the MCF10 cells. This effect appears on key genes related to cell cycle regulation ( CCND1 VEGFA VEGFA2 HIF1A HIF1A-AS In the MDA-MB-231 cell line, all three treatments (Hydralazine, ATRA, and hydralazine/ATRA) significantly reduce the expression of CCND1 CCND1 Hydralazine significantly increased the expression of VEGFA The VEGFA2 In MDA-MB-231 cells, HIF1A HIF1A In MDA-MB-231 cells, ATRA and hydralazine significantly reduced the expression of HIF1A-AS HIF1A-AS Discussion Breast cancer is a highly complex and heterogeneous disease, characterized by diverse molecular subtypes and intricate signaling networks that drive tumor progression and therapeutic resistance. While significant advancements have been made with single-agent targeted therapies and chemotherapy, the development of acquired resistance and the presence of intrinsic resistance mechanisms often limit their long-term efficacy. Consequently, combination therapy, which aims to simultaneously target multiple pathways or overcome resistance mechanisms, represents a crucial strategy to improve treatment outcomes and enhance durable responses in breast cancer patients. Previous studies have shown that combining hydralazine and valproic acid can synergistically cause significant DNA damage, cell cycle arrest, and apoptosis in breast cancer cell lines [ 17 18 19 A combination of ATRA and vorinostat (a histone deacetylase inhibitor) showed synergistic effects in inducing cellular differentiation and apoptosis in breast cancer cells [ 20 21 22 This present study is in line with previous research and uses bioinformatics studies, MDA-MB-231, and MCF10 cell culture to analyze the in vitro behavior of these cells, so it provides a much up-to-date and valid analysis of breast cancer. MDA-MB-231 cells are considered cancer cells, while MCF10 cells are considered normal body cells. While specialized media are often recommended for normal breast epithelial cells, our use of DMEM supplemented with 10% FBS is supported by previous work demonstrating successful maintenance of normal breast epithelial morphology and function in this medium, particularly for short-term experiments [ 23 Based on the bioinformatics results, hydralazine and ATRA have a high potential for combination therapy due to their multiple molecular targets. Also, HIF1A VEGFA CCND1 Hypoxia in solid tumors leads to increased angiogenesis, metastasis, and death. Hydralazine induces HIF-1 and VEGF signaling by inhibiting PHD activity, stabilizing HIF-1α, and activating VEGF, which promotes tumor angiogenesis and cancer progression [ 24 The MTT test shows ATRA has a high cytotoxic effect on tumor cells (IC 50 50 In wound healing results, hydralazine and ATRA alone cannot reduce cell migration in MDA-MB-231 cells, and even hydralazine increases cancer cell numbers on the plate and closes the scratch. While the hydralazine/ATRA combination reduces cell migration significantly, the reduction is the same as with doxorubicin. In MCF10 cells, ATRA and doxorubicin not only inhibited cell migration but also had significant cytotoxic effects. However, the combination did not show cytotoxicity and only stopped migration. So, the hydralazine/ATRA combination can inhibit the cancer cells’ metastasis without damaging normal cells. Gene expression findings show that ATRA and the combination inhibit cancer cell proliferation by regulating CCND1 HIF1A While this study demonstrates the therapeutic potential of hydralazine and ATRA co-administration in breast cancer models, some limitations warrant acknowledgment. First, our findings rely exclusively on in vitro analyses using MCF-7 and MDA-MB-231 cell lines, which may not fully recapitulate the complexity of human tumor microenvironments or interpatient heterogeneity. Second, the effective concentrations of hydralazine (5–20 µM) and ATRA (10–40 µM) in cellular assays require rigorous pharmacokinetic validation to assess translational feasibility in vivo. Third, comprehensive multi-omics profiling (e.g., single-cell RNA-seq) would better resolve subtype-specific drug responses. Finally, combination efficacy was benchmarked against monotherapies but not compared to standard clinical regimens (e.g., paclitaxel or doxorubicin), necessitating future comparative studies. Conclusion The combination of hydralazine and ATRA effectively reduces cancer cell migration and metastasis without affecting normal cells. This treatment also inhibits cancer cell proliferation by regulating CCND1 HIF1A Electronic supplementary material Below is the link to the electronic supplementary material.  Supplementary Material 1 Publisher’s note Springer Nature remains neutral with regard to jurisdictional claims in published maps and institutional affiliations. Acknowledgements This research was supported by the Graduate University of Advanced Technology, Kerman, Iran. Author contributions Mohammad mehdi Yaghoobi contributed to design and implementation of the research; Amirhesan Yahyapour and Nahid Askari participated in the collection of data and contributed substantially to the drafting, writing and revising of the manuscript; all authors have approved the final version of the manuscript. Funding This study was not funded by any specific grants from public, commercial, or non-profit funding organizations. Data availability All data essential to replicate this study are included in this article and its supplementary material. Additional raw data are available from the corresponding author upon request. Declarations Ethics approval and consent to participate Ethical approval (Code: 02.83760; Date: 12 January 2024) was granted by the Ethics Committee of KGUT’s Institute of Sciences and High Technology and Environmental Sciences, confirming adherence to institutional ethical standards for research. Consent for publication Not applicable. Competing interests The authors declare no competing interests. Abbreviations DOXO Doxorubicin ATRA All-trans retinoic acid STRC Stem Cell Technology Research Center DMEM Dulbecco's Modified Eagle Medium PHD Prolyl hydroxylase domain RARs Retinoic acid receptors RXRs retinoid X receptors CDK Cyclin-dependent kinase References 1. Victoir B Croix C Gouilleux F Prié G Targeted therapeutic strategies for the treatment of Cancer Cancers 2024 16 2 461 10.3390/cancers16020461 38275901 PMC10814619 Victoir B, Croix C, Gouilleux F, Prié G. Targeted therapeutic strategies for the treatment of Cancer. Cancers. 2024;16(2):461. 38275901 10.3390/cancers16020461 PMC10814619 2. Vafopoulou P Kourti M Anti-angiogenic drugs in cancer therapeutics: A review of the latest preclinical and clinical studies of anti-angiogenic agents with anticancer potential J Cancer Metastasis Treat 2022 8 18 10.20517/2394-4722.2022.08 Vafopoulou P, Kourti M. Anti-angiogenic drugs in cancer therapeutics: A review of the latest preclinical and clinical studies of anti-angiogenic agents with anticancer potential. J Cancer Metastasis Treat. 2022;8:18. 3. Mohammad N Vikram Singh S Malvi P Chaube B Athavale D Vanuopadath M Strategy to enhance efficacy of doxorubicin in solid tumor cells by methyl-β-cyclodextrin: involvement of p53 and Fas receptor ligand complex Sci Rep 2015 5 1 11853 10.1038/srep11853 26149967 PMC4493576 Mohammad N, Vikram Singh S, Malvi P, Chaube B, Athavale D, Vanuopadath M, et al. Strategy to enhance efficacy of doxorubicin in solid tumor cells by methyl-β-cyclodextrin: involvement of p53 and Fas receptor ligand complex. Sci Rep. 2015;5(1):11853. 26149967 10.1038/srep11853 PMC4493576 4. Romão IC, Siqueira SMC, Silva Abreu, FOMd. Santos hsd. Hydralazine and hydrazine derivatives: properties, applications, and repositioning potential. Chemistry & Biodiversity; 2024. n/a(n/a):e202401561. 10.1002/cbdv.202401561 39429053 5. Jin Y Teh SS Lau HLN Xiao J Mah SH Retinoids as anti-cancer agents and their mechanisms of action Am J Cancer Res 2022 12 3 938 35411232 PMC8984900 Jin Y, Teh SS, Lau HLN, Xiao J, Mah SH. Retinoids as anti-cancer agents and their mechanisms of action. Am J Cancer Res. 2022;12(3):938. 35411232 PMC8984900 6. Bray F Laversanne M Sung H Ferlay J Siegel RL Soerjomataram I Global cancer statistics 2022: GLOBOCAN estimates of incidence and mortality worldwide for 36 cancers in 185 countries Cancer J Clin 2024 74 3 229 63 10.3322/caac.21834 38572751 Bray F, Laversanne M, Sung H, Ferlay J, Siegel RL, Soerjomataram I, et al. Global cancer statistics 2022: GLOBOCAN estimates of incidence and mortality worldwide for 36 cancers in 185 countries. Cancer J Clin. 2024;74(3):229–63. 10.3322/caac.21834 38572751 7. Knox C Wilson M Klinger CM Franklin M Oler E Wilson A DrugBank 6.0: the drugbank knowledgebase for 2024 Nucleic Acids Res 2024 52 D1 D1265 75 10.1093/nar/gkad976 37953279 PMC10767804 Knox C, Wilson M, Klinger CM, Franklin M, Oler E, Wilson A, et al. DrugBank 6.0: the drugbank knowledgebase for 2024. Nucleic Acids Res. 2024;52(D1):D1265–75. 37953279 10.1093/nar/gkad976 PMC10767804 8. Daina A Michielin O Zoete V SwissTargetPrediction: updated data and new features for efficient prediction of protein targets of small molecules Nucleic Acids Res 2019 47 W1 W357 64 10.1093/nar/gkz382 31106366 PMC6602486 Daina A, Michielin O, Zoete V. SwissTargetPrediction: updated data and new features for efficient prediction of protein targets of small molecules. Nucleic Acids Res. 2019;47(W1):W357–64. 31106366 10.1093/nar/gkz382 PMC6602486 9. Filimonov DA Lagunin AA Gloriozova TA Rudik AV Druzhilovskii DS Pogodin PV Prediction of the biological activity spectra of organic compounds using the pass online web resource Chem Heterocycl Compd 2014 50 3 444 57 10.1007/s10593-014-1496-1 Filimonov DA, Lagunin AA, Gloriozova TA, Rudik AV, Druzhilovskii DS, Pogodin PV, et al. Prediction of the biological activity spectra of organic compounds using the pass online web resource. Chem Heterocycl Compd. 2014;50(3):444–57. 10. Bartha Á Győrffy B TNMplot.com: A web tool for the comparison of gene expression in normal, tumor and metastatic tissues Int J Mol Sci 2021 22 5 2622 10.3390/ijms22052622 33807717 PMC7961455 Bartha Á, Győrffy B. TNMplot.com: A web tool for the comparison of gene expression in normal, tumor and metastatic tissues. Int J Mol Sci. 2021;22(5):2622. 33807717 10.3390/ijms22052622 PMC7961455 11. Győrffy B. Integrated analysis of public datasets for the discovery and validation of survival-associated genes in solid tumors. Innov. 2024;5(3). 10.1016/j.xinn.2024.100625 PMC11066458 38706955 12. Ge SX Jung D Yao R ShinyGO: a graphical gene-set enrichment tool for animals and plants Bioinformatics 2019 36 8 2628 9 10.1093/bioinformatics/btz931 PMC7178415 31882993 Ge SX, Jung D, Yao R. ShinyGO: a graphical gene-set enrichment tool for animals and plants. Bioinformatics. 2019;36(8):2628–9. 10.1093/bioinformatics/btz931 PMC7178415 31882993 13. Qannita RA Alalami AI Harb AA Aleidi SM Taneera J Abu-Gharbieh E Targeting hypoxia-inducible Factor-1 (HIF-1) in cancer: emerging therapeutic strategies and pathway regulation Pharmaceuticals 2024 17 2 195 10.3390/ph17020195 38399410 PMC10892333 Qannita RA, Alalami AI, Harb AA, Aleidi SM, Taneera J, Abu-Gharbieh E, et al. Targeting hypoxia-inducible Factor-1 (HIF-1) in cancer: emerging therapeutic strategies and pathway regulation. Pharmaceuticals. 2024;17(2):195. 38399410 10.3390/ph17020195 PMC10892333 14. Álvarez-Fernández M Malumbres M Mechanisms of sensitivity and resistance to CDK4/6 Inhibition Cancer Cell 2020 37 4 514 29 10.1016/j.ccell.2020.03.010 32289274 Álvarez-Fernández M, Malumbres M. Mechanisms of sensitivity and resistance to CDK4/6 Inhibition. Cancer Cell. 2020;37(4):514–29. 32289274 10.1016/j.ccell.2020.03.010 15. Hamad M Mehana RA Abd-Al haseeb MM Houssen M Potential antitumour effect of all-trans retinoic acid on regorafenib-treated human colon cancer cell lines Contemp Oncology/Współczesna Onkologia 2023 27 3 198 210 10.5114/wo.2023.133742 PMC10793621 38239861 Hamad M, Mehana RA, Abd-Al haseeb MM, Houssen M. Potential antitumour effect of all-trans retinoic acid on regorafenib-treated human colon cancer cell lines. Contemp Oncology/Współczesna Onkologia. 2023;27(3):198–210. 10.5114/wo.2023.133742 PMC10793621 38239861 16. Xi H-M, Lu H, Weng X-Q, Sheng Y, Wu J, Li L et al. Combined application of salinomycin and ATRA induces apoptosis and differentiation of acute myeloid leukemia cells by inhibiting WNT/β-Catenin pathway. Anti-Cancer agents in medicinal chemistry (Formerly current medicinal chemistry-Anti-Cancer agents). 2023;23(9):1074–84. 10.2174/1871520623666230110121629 36627782 17. Arce C Perez-Plasencia C Gonzalez-Fierro A de la Cruz-Hernandez E Revilla-Vazquez A Chavez-Blanco A A proof-of-principle study of epigenetic therapy with hydralazine and magnesium valproate plus doxorubicin cyclophosphamide as neoadjuvant therapy for locally advanced breast cancer BMC Cancer 2007 7 1 A23 10.1186/1471-2407-7-S1-A23 Arce C, Perez-Plasencia C, Gonzalez-Fierro A, de la Cruz-Hernandez E, Revilla-Vazquez A, Chavez-Blanco A, et al. A proof-of-principle study of epigenetic therapy with hydralazine and magnesium valproate plus doxorubicin cyclophosphamide as neoadjuvant therapy for locally advanced breast cancer. BMC Cancer. 2007;7(1):A23. 18. Coronel J Cetina L Pacheco I Trejo-Becerril C González-Fierro A de la Cruz-Hernandez E A double-blind, placebo-controlled, randomized phase III trial of chemotherapy plus epigenetic therapy with hydralazine valproate for advanced cervical cancer. Preliminary results Med Oncol 2011 28 1 540 6 10.1007/s12032-010-9700-3 20931299 Coronel J, Cetina L, Pacheco I, Trejo-Becerril C, González-Fierro A, de la Cruz-Hernandez E, et al. A double-blind, placebo-controlled, randomized phase III trial of chemotherapy plus epigenetic therapy with hydralazine valproate for advanced cervical cancer. Preliminary results. Med Oncol. 2011;28(1):540–6. 10.1007/s12032-010-9700-3 20931299 19. Zambrano P Segura-Pacheco B Perez-Cardenas E Cetina L Revilla-Vazquez A Taja-Chayeb L A phase I study of hydralazine to demethylate and reactivate the expression of tumor suppressor genes BMC Cancer 2005 5 1 44 10.1186/1471-2407-5-44 15862127 PMC1131894 Zambrano P, Segura-Pacheco B, Perez-Cardenas E, Cetina L, Revilla-Vazquez A, Taja-Chayeb L, et al. A phase I study of hydralazine to demethylate and reactivate the expression of tumor suppressor genes. BMC Cancer. 2005;5(1):44. 15862127 10.1186/1471-2407-5-44 PMC1131894 20. Munster PN Troso-Sandoval T Rosen N Rifkind R Marks PA Richon VM The histone deacetylase inhibitor suberoylanilide hydroxamic acid induces differentiation of human breast cancer cells Cancer Res 2001 61 23 8492 7 11731433 Munster PN, Troso-Sandoval T, Rosen N, Rifkind R, Marks PA, Richon VM. The histone deacetylase inhibitor suberoylanilide hydroxamic acid induces differentiation of human breast cancer cells. Cancer Res. 2001;61(23):8492–7. 11731433 21. Lo-Coco F Avvisati G Vignetti M Thiede C Orlando SM Iacobelli S Retinoic acid and arsenic trioxide for acute promyelocytic leukemia N Engl J Med 2013 369 2 111 21 10.1056/NEJMoa1300874 23841729 Lo-Coco F, Avvisati G, Vignetti M, Thiede C, Orlando SM, Iacobelli S, et al. Retinoic acid and arsenic trioxide for acute promyelocytic leukemia. N Engl J Med. 2013;369(2):111–21. 23841729 10.1056/NEJMoa1300874 22. Arrieta O González-De la Rosa CH Aréchaga-Ocampo E Villanueva-Rodríguez G Cerón-Lizárraga TL Martínez-Barrera L Randomized phase II trial of all-trans-retinoic acid with chemotherapy based on Paclitaxel and cisplatin as first-line treatment in patients with advanced non–small-cell lung cancer J Clin Oncol 2010 28 21 3463 71 10.1200/JCO.2009.26.6452 20547984 Arrieta O, González-De la Rosa CH, Aréchaga-Ocampo E, Villanueva-Rodríguez G, Cerón-Lizárraga TL, Martínez-Barrera L, et al. Randomized phase II trial of all-trans-retinoic acid with chemotherapy based on Paclitaxel and cisplatin as first-line treatment in patients with advanced non–small-cell lung cancer. J Clin Oncol. 2010;28(21):3463–71. 20547984 10.1200/JCO.2009.26.6452 23. Petersen OW, Rønnov-Jessen L, Howlett AR, Bissell MJ. Interaction with basement membrane serves to rapidly distinguish growth and differentiation pattern of normal and malignant human breast epithelial cells. Proceedings of the National Academy of Sciences. 1992;89(19):9064-8. 10.1073/pnas.89.19.9064 PMC50065 1384042 24. Mehrabani M Nematollahi MH Tarzi ME Juybari KB Abolhassani M Sharifi AM Protective effect of hydralazine on a cellular model of parkinson’s disease: a possible role of hypoxia-inducible factor (HIF)-1α Biochem Cell Biol 2020 98 3 405 14 10.1139/bcb-2019-0117 31940231 Mehrabani M, Nematollahi MH, Tarzi ME, Juybari KB, Abolhassani M, Sharifi AM, et al. Protective effect of hydralazine on a cellular model of parkinson’s disease: a possible role of hypoxia-inducible factor (HIF)-1α. Biochem Cell Biol. 2020;98(3):405–14. 31940231 10.1139/bcb-2019-0117 ",
  "metadata": {
    "Title of this paper": "Protective effect of hydralazine on a cellular model of parkinson’s disease: a possible role of hypoxia-inducible factor (HIF)-1α",
    "Journal it was published in:": "BMC Cancer",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12462318/"
  }
}