{
  "title": "Paper_794",
  "abstract": "pmc J Extracell Vesicles J Extracell Vesicles 2180 jev JEV2 Journal of Extracellular Vesicles 2001-3078 Wiley PMC12465009 PMC12465009.1 12465009 12465009 41002137 10.1002/jev2.70170 JEV270170 1 Research Article Research Article TMTP1‐Modified Small Extracellular Vesicles Target BRAF Mutation in Anaplastic Thyroid Cancer Reversing Vemurafenib Resistance With CRISPR/Cas9 Delivery Zhang Shuo  1 Ji Zhenrong  1 Cheng Xiaoyu  2 Ma Yue  3 Feng Mingliang https://orcid.org/0000-0001-6624-9624  4 cmu1hfml@163.com Cai Dasheng https://orcid.org/0000-0003-0773-1247  1 cds1225@sina.com Bai Tao https://orcid.org/0000-0002-6692-2599  1 baitaomzk@126.com   1 Department of Anesthesiology the First Hospital of China Medical University Shenyang China   2 Department of Anesthesiology General Hospital of Northern Theater Command Shenyang China   3 Department of Pulmonary and Critical Care Medicine Shengjing Hospital of China Medical University Shenyang China   4 Department of Endoscopy the First Hospital of China Medical University Shenyang China 26 9 2025 9 2025 14 9 495917 10.1002/jev2.v14.9 e70170 25 8 2025 14 12 2024 26 8 2025 26 09 2025 27 09 2025 27 09 2025 © 2025 The Author(s). Journal of Extracellular Vesicles https://creativecommons.org/licenses/by-nc/4.0/ This is an open access article under the terms of the http://creativecommons.org/licenses/by-nc/4.0/ ABSTRACT This study investigates a novel approach to overcome Vemurafenib resistance in BRAF‐mutant Anaplastic thyroid carcinoma (ATC) using CRISPR/Cas9 gene editing and TMTP1‐modified extracellular vesicles (TMTP1‐sgBRAF‐EVs). By knocking out the BRAF gene, the study elucidates Vemurafenib‐induced ferroptosis mechanisms involving lipid peroxidation and reactive oxygen species (ROS) generation in ATC cells. The developed TMTP1‐sgBRAF‐EVs system demonstrates superior tumour‐targeting and drug delivery capabilities, significantly enhancing Vemurafenib efficacy in both in vitro and in vivo models. This innovative combination of gene editing technology with a nanoparticle delivery system shows promising potential as a therapeutic strategy for treating aggressive BRAF‐mutant ATC. anaplastic thyroid carcinoma BRAF mutation CRISPR/Cas9 gene editing extracellular vesicles ferroptosis Vemurafenib resistance pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement yes pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes source-schema-version-number 2.0 cover-date September 2025 details-of-publishers-convertor Converter:WILEY_ML3GV2_TO_JATSPMC version:6.6.4 mode:remove_FC converted:26.09.2025  Zhang S. Z. Ji X. Cheng 2025 TMTP1‐Modified Small Extracellular Vesicles Target BRAF Mutation in Anaplastic Thyroid Cancer Reversing Vemurafenib Resistance With CRISPR/Cas9 Delivery Journal of Extracellular Vesicles 14 9 e70170 10.1002/jev2.70170 Shuo Zhang and Zhenrong Ji are co‐first authors.  Funding Abbreviations AFM atomic force microscopy ATC anaplastic thyroid carcinoma CHX cycloheximide DEGs differentially expressed genes EVs extracellular vesicles FBS fetal bovine serum KEGG Kyoto encyclopaedia of genes and genomes MDA malondialdehyde NEB new England biolabs NTA nanoparticle tracking analysis PFA paraformaldehyde PI propidium Iodide PS Penicillin‐Streptomycin PVDF polyvinylidene fluoride RNA‐Seq RNA sequencing ROS reactive oxygen species TEM transmission electron microscopy TFRC transferrin receptor TMTP1 tumour metastasis targeting peptide 1 TMTP1‐sgBRAF‐EVs CRISPR/Cas9 gene editing and tumour metastasis targeting Peptide 1‐modified Extracellular Vesicle 1 Introduction Anaplastic thyroid carcinoma (ATC) is a rare but highly aggressive type of thyroid cancer. Despite its low incidence among all thyroid cancer cases, the prognosis for ATC is extremely poor, with a typical survival period of less than 6 months (Baloch et al. 2022 2024 2021 2022 2023 2024 2022c 2023 2023 ATC is the most aggressive and lethal type of thyroid cancer. BRAF mutations, particularly the V600E variant, occur frequently in ATC and are closely associated with tumour invasiveness, metastatic potential, and poor prognosis (Vladimirova et al. 2021 2021 2022 2022 V600E 2022 2024 2022 2024 2022 2023b 2024 2021 2021 2022 Ferroptosis is a form of iron‐ and lipid peroxidation‐dependent cell death that has recently emerged as a promising mechanism in cancer suppression (Zou et al. 2022 2023 2021 2021 2022 2022 2021 2022b 2025 2024 CRISPR/Cas9 gene editing technology has been widely applied in cancer research in recent years, enabling precise targeting and knockout of specific genes to investigate their roles in tumour development and progression (Wang et al. 2022c 2021 2022 2022c 2021 2022 2023 2023 2021c 2023 2023 2021c 2022 2022c 2022 The primary objective of this study is to explore the mechanisms of reversing Vemurafenib resistance in BRAF‐mutant ATC using a CRISPR/Cas9 gene editing and TMTP1‐modified EV (TMTP1‐sgBRAF‐EVs) delivery system. First, we utilised CRISPR/Cas9 technology to generate stable BRAF knockout subclones in BRAF‐mutant ATC cell lines and analysed their sensitivity to Vemurafenib. Next, we performed the Kyoto Encyclopaedia of Genes and Genomes (KEGG) enrichment analysis to investigate the impact of BRAF knockout on ferroptosis‐related gene expression and conducted a series of experiments to validate its role in ferroptosis. Finally, we developed the TMTP1‐sgBRAF‐EVs delivery system, assessed its tumour‐targeting and delivery capabilities, and evaluated its effect on Vemurafenib efficacy through both in vitro and in vivo experiments. The results of this study have the potential to offer new therapeutic hope for patients with BRAF‐mutant ATC, improving their survival rates and quality of life, and providing new theoretical foundations and strategies for cancer treatment. 2 Materials and Methods 2.1 Ethical Statement BALB/c nude mice (4–6 weeks old) were purchased from Hunan SJA Laboratory Animal Co., Ltd. (Hunan, China). All animals were housed in rooms with controlled temperature, humidity, and lighting, and were provided with water ad libitum. Animal welfare and experimental procedures were conducted in accordance with the Ethical Guidelines for the Care and Use of Laboratory Animals of Anhui Medical University and were approved by the University's Animal Experimentation Ethics Committee. 2.2 Cell Culture Human normal thyroid cells Nthy‐ori3‐1 (BNCC340487, Beina Chuanglian Biotechnology Co., Ltd., China) and ATC cell lines 8505c (BRAF V600E V600E WT WT 2 2.3 In Vitro Cell Proliferation and Drug Resistance Assay Cells were seeded at a density of 1 × 10 4 2 2.4 Generation of BRAF Knockout Cells BRAF‐deficient cells (sgBRAF) were generated using CRISPR/Cas9 technology. The sgRNAs used were as follows: BRAF‐sgRNA1: 5'‐TAGCACTGAAAGGCTAGAAG‐3'; BRAF‐sgRNA2: 5'‐TGTCCCCGTTGAACAGAGCC‐3'; BRAF‐sgRNA3: 5'‐TTGGAGTGCATCTAGCTTGC‐3'. These sgRNAs were inserted into the Lenti‐CRISPR v2 vector (Hanbio Biotechnology Co., Ltd., Shanghai, China), which contains the Streptococcus pyogenes Cas9 nuclease gene. Cells were infected with lentivirus containing the Lenti‐CRISPR v2 vector and selected with 4 µg/ml puromycin (A1113803, Gibco, Thermo Fisher Scientific, Shanghai, China) to obtain stable BRAF knockout (sgBRAF) cells. The knockout effect was confirmed by Western blot analysis (Zeng et al. 2023b 2.5 Isolation and Purification of EVs EVs were isolated and purified from the conditioned media of cultured 8505c and BHT‐101 cells. The culture supernatant was first centrifuged at 300 × g g g g g g 2.6 Identification of EVs EVs were diluted in PBS and fixed with 1% glutaraldehyde, then applied to carbon‐coated copper grids and stained with 1% phosphotungstic acid. The specimens were examined using a JEM‐2100 transmission electron microscope (JEOL, Tokyo, Japan). Atomic force microscopy (AFM) images were recorded using the BioScope Resolve system and ScanAsyst imaging mode (Bruker, Billerica, MA, USA). EV samples at a concentration of 5 µg/mL were prepared by placing a drop on the grid and incubating until dry. The images were processed using NanoScope analysis software (Bruker). NTA was performed using the NanoSight NS300 system (Malvern Instruments, Malvern, UK). The Brownian motion of EVs suspended in PBS was recorded and tracked, and size distribution data were generated using the Stokes‐Einstein equation. The zeta potential of EVs was measured at 25°C in 0.1× PBS buffer using the Nano ZS90 instrument (Malvern). The protein concentration of EVs was determined using the BCA protein assay kit (P0010S, Beyotime). Western blot analysis was conducted to detect EV markers ALIX, TSG101, Calnexin, and CD63. 2.7 Labelling of EVs Fluorescent dyes 3,3'‐dioctadecyloxacarbocyanine perchlorate (DiO, D275) and 1,1'‐dioctadecyl‐3,3,3',3'‐tetramethylindodicarbocyanine iodide (DiR, D12731 2.8 Homology of Tumour EVs to Parental Cell Lines In Vitro 8505c or BHT‐101 cells were seeded at a density of 2 × 10 4 8 R37606 4 8 A mixture of 100 µL RPMI 1640 containing 2 × 10 6 2 11 11 2.9 Modification of EVs With Tumour‐Targeting Peptide TMTP1 To establish EVs with tumour‐targeting functionality expressing the TMTP1 peptide, we fused the targeting peptide TMTP1 to the N‐terminal of Lamp2b, a protein reported to be abundantly present in EV membranes, creating the TMTP1‐Lamp2b‐HA construct. This construct was then inserted into the lentiviral vector pLVX‐IRES‐G418 (TMTP1‐Lamp2b‐HA). The lentiviral system was used to transfect 293T cells with TMTP1‐Lamp2b‐HA. Lentiviral particles were collected and used to infect 8505c or BHT‐101 cells at a density of 2.5 × 10 5 To prepare TMTP1‐sgBRAF‐EVs, purified EVs were resuspended in pre‐chilled electroporation buffer (1.15 mM potassium phosphate, pH 7.2; 25 mM potassium chloride; 21% OptiPrep working solution), and the concentration was adjusted to ∼10 10 g g g 2.10 Encapsulation Efficiency of Electroporation To evaluate the encapsulation efficiency of electroporation, a standard curve was generated using Western blot. The Grey values were plotted on the Y X Y 2.11 Proteinase K and RNase Protection Assay TMTP1‐sgBRAF‐EVs (25 mL, 1×10 10 2024 2.12 Stability Measurement of TMTP1‐sgBRAF‐EVs To assess the stability of TMTP1‐sgBRAF‐EVs over time, they were stored in phosphate‐buffered saline (PBS, 1x, pH 7.4) at 4°C for 7 days. To simulate their eventual in vivo environment, they were placed in fresh serum at 37°C for 24 h. The stability of TMTP1‐sgBRAF‐EVs in both conditions was monitored using the NanoSight system. 2.13 Internalisation Efficiency of TMTP1‐sgBRAF‐EVs 8505c cells were seeded onto coverslips and, once adhered, were co‐cultured with TMTP1‐sgBRAF‐EVs and unmodified EVs for 24 h. After fixing the cells, the nuclei were stained with DAPI, and the cytoskeleton was stained with Phalloidin (ab176753, Abcam, UK). The internalisation of Cas9‐GFP and sgBRAF‐Cy3 was observed using a fluorescence microscope to evaluate the colocalisation of Cas9 and sgRNA. Colocalisation analysis was performed by measuring the fluorescence intensity of GFP and Cy3 using image processing software, and a colocalisation curve was plotted. For quantitative analysis of EV internalisation, treated 8505c cells were washed with PBS and collected by trypsinisation with 0.25% trypsin. The cells were resuspended in PBS and analysed by flow cytometry to assess EV internalisation efficiency by measuring the fluorescence intensity of GFP within the cells. Additionally, in vivo experiments involved preparing frozen sections of tumour tissues from each group. Cas9 was labelled with GFP, sgBRAF with Cy3, and EVs with DiR. The sections were observed under a fluorescence microscope. 2.14 Lentivirus Infection and Drug Treatment Human transferrin receptor (TFRC)‐shRNA constructs were created using the vector pLKO.1‐puro (QYV0024, Qualityard Biological Technology Co., Ltd.). The sequences used were: Sequence 1: GCTGGTCAGTTCGTGATTAAA, Sequence 2: CCCAACAGATACTGGAAGTTT, and shNC: AGACCAGACCGCACGTAAACC, all purchased from Sigma‐Aldrich. TFRC‐shRNA lentivirus (sh‐TFRC) and control lentivirus (sh‐NC) were constructed using HEK293T cells (CBP60661, Nanjing Cobioer Biotechnology Co., Ltd., Jiangsu, China). The plasmids and lentivirus packaging services were provided by Sangon Biotech. The constructed plasmid carrying the TFRC‐shRNA and a luciferase reporter gene (sh‐TFRC‐luc) was co‐transfected with helper plasmids into HEK293T cells using Lipofectamine 2000 reagent (11668030, Thermo Fisher, USA). After validation, amplification, and purification, the packaged lentivirus was obtained. For lentivirus‐mediated transfection, 5 × 10 5 6 For the drug and EV treatment, 8505c and BHT‐101 cells, with or without TFRC knockdown, were treated for 24 h with 10 nM equal amounts of DMSO, Vemurafenib, NAC (HY‐B0215, MCE, Shanghai, China), apoptosis inhibitor ZVAD‐fmk (HY‐16658B, MCE, Shanghai, China), necroptosis inhibitor necrostatin‐1 (HY‐15760, MCE, Shanghai, China), ferroptosis inhibitor ferrostatin‐1 (HY‐100579, MCE, Shanghai, China), iron chelator deferoxamine (DFO, HY‐B0988, MCE, Shanghai, China), autophagy inducer rapamycin (Rap) (HY‐10219, MCE, Shanghai, China), autophagy inhibitor chloroquine (CQ) (HY‐17589A, MCE, Shanghai, China), unloaded EVs (unmod‐EVs), and TMTP1‐sgBRAF‐EVs. Additionally, BHT‐101 and 8505c cells were continuously exposed to Erastin (HY‐15763, MCE, Shanghai, China) and RSL3 (HY‐100218A, MCE, Shanghai, China) to develop ferroptosis‐resistant cell lines. 2.15 Colony Formation and Soft Agar Assay 8505c and BHT‐101 cells (1 × 10 3 2.16 Transwell Assay For the migration assay, 600 µL of 30% FBS medium was added to 24‐well plates, and Transwell chambers (Millipore, Darmstadt, Germany) were placed on top. Then, 300 µL of a cell suspension at a concentration of 1 × 10 6 For the invasion assay, ECM gel (ECM550, Chemicon, USA) was placed at 4°C overnight. On the following day, all pipette tips and Transwell chambers were pre‐cooled on ice for 30 min before the experiment. The ECM gel was diluted with a serum‐free medium at a ratio of 1:9 to a final concentration of 1 mg/mL. Forty microliters of the diluted ECM gel were added to the polycarbonate membrane of each upper chamber in a 24‐well Transwell plate. The plates were incubated in a 37°C incubator with 5% CO 2 2.17 Cell Death Assay Cells were seeded in 20 mm confocal dishes and incubated overnight, followed by drug treatment. The live/dead detection kit (PF00007, Proteintech, China), consisting of Calcein‐AM/PI, was used according to the manufacturer's instructions. 2.18 Reactive Oxygen Species and Lipid Peroxidation Assay Cells were seeded in 6‐well plates or 20 mm glass‐bottom cell culture dishes (NEST, China) and incubated overnight, followed by drug treatment. Cells were incubated for 48 h, 72 h, or other specified times, and the C11 BODIPY 581/591 assay kit (GC40165, GLPBIO, USA) was used according to the manufacturer's instructions for detecting lipid peroxidation. The ROS detection kit (HY‐D0940, MCE, Shanghai, China) was used following the manufacturer's protocol. Lipid peroxidation levels were detected using flow cytometry (BD Accuri C6 Plus, BD Bioscience; BD LSRFortessa, USA) and a fluorescence microscope (Olympus Corporation, Japan). ROS levels were measured by flow cytometry. 2.19 Malondialdehyde Assay Cells were seeded in cell culture flasks and incubated overnight, followed by drug treatment. After 72 h of incubation, the malondialdehyde (MDA) assay kit (M496, Dojindo, Japan) was used according to the manufacturer's instructions to measure MDA levels. 2.20 Reduced Glutathione/Oxidised Glutathione Activity Assay Cells were seeded in 75 cm 2 2.21 Transmission Electron Microscopy (TEM) Observation of Cells Cells were harvested and prefixed with 2.5% glutaraldehyde (111‐30‐8, Sigma‐Aldrich, USA) in the dark, followed by fixation with formaldehyde (50‐00‐0, Sigma‐Aldrich, USA) for 1 h. The cells were then dehydrated using a graded series of acetone concentrations (48358, Sigma‐Aldrich, USA) and embedded in epoxy resin (1675‐54‐3, Sigma‐Aldrich, USA). The cells were gradually heated in an oven at 42°C for 2 h, then at 52°C overnight, and finally at 62°C for an additional night to complete polymerisation. Ultrathin sections (50–70 nm) were prepared using an ultramicrotome (EM UC6, Leica Biosystems, Germany). Sections were treated with a 1% uranyl acetate aqueous solution (XHL2375, Hubei Xinhongli Chemical Co., Ltd., Tianmen, China) for 5 min and placed in a CO 2 2.22 FerroOrange Staining Cells were fixed with 4% PFA solution for approximately 15 to 20 min. FerroOrange dye (MX4559‐48UG, Shanghai Maokang Biotechnology Co., Ltd., Shanghai, China) was diluted to the appropriate concentration and added to the cell culture dishes, following the recommended staining time according to the manufacturer's instructions. The cells were washed with PBS to remove excess dye. Staining results were observed and captured using a fluorescence microscope. FerroOrange emits fluorescence at a specific wavelength upon binding with Fe 2 2+ 2.23 Protein Degradation Assay Cells were pre‐seeded in 6‐well plates at a density of 5 × 10 5 2.24 Western Blot Proteins from cells were extracted using the Tissue Protein Rapid Extraction Kit (EX2410) and the Fixed Cell Protein Extraction Kit (EX2170) from Solarbio. Protein concentration was determined using the BCA Protein Assay Kit (Sigma, BCA1‐1KT). Equal amounts of protein (20 µg per lane) were separated by 10%–12% SDS‐PAGE and transferred to polyvinylidene fluoride (PVDF) membranes (EMD Millipore, Billerica, MA, USA). The membranes were blocked with 5% BSA for 2 h and washed with PBS. They were then incubated overnight at 4°C with primary antibodies (BRAF (ab33899, Abcam, Cambridge, UK); SLC7A11 (ab300667, Abcam, Cambridge, UK); ACSL4 (ab155282, Abcam, Cambridge, UK); GPX4 (ab125066, Abcam, Cambridge, UK); Alix (ab117600, Abcam, Cambridge, UK); TSG101 (ab30871, Abcam, Cambridge, UK); CD63 (ab271296, Abcam, Cambridge, UK); Calnexin (ab22595, Abcam, Cambridge, UK); HA (ab18181, Abcam, Cambridge, UK); Cas9 (ab189380, Abcam, Cambridge, UK); PCNA (ab29, Abcam, Cambridge, UK); Vimentin (Vim) (ab20346, Abcam, Cambridge, UK); N‐cadherin (ab18203, Abcam, Cambridge, UK); TFRC (ab84036, Abcam, Cambridge, UK); LC3B (ab51520, Abcam, Cambridge, UK); SQSTM1/p62 (ab91526, Abcam, Cambridge, UK); and β‐Actin (ab8227, Abcam, Cambridge, UK)) at dilutions recommended by the manufacturer. After washing, the membranes were incubated with goat anti‐rabbit HRP‐conjugated secondary antibody (Abcam, ab6721, 1:2000, UK) at room temperature for 2 h. Bands were visualised using the enhanced chemiluminescence system (Thermo Fisher, iBright FL1500). Band intensities were analysed using AlphaView SA software (Version 3.4.0). Relative protein expression levels were determined by normalising the target band intensity to the β 2.25 RT‐qPCR Detection of Gene Expression in Tissues and Cells Total RNA was extracted using Trizol reagent (15596026, Invitrogen, USA) according to the manufacturer's instructions. RNA was reverse transcribed into cDNA using the PrimeScript RT reagent Kit (RR047A, Takara, Japan). RT‐qPCR was performed on the synthesised cDNA using the Fast SYBR Green PCR Kit (11736059, Thermo Fisher Scientific, Shanghai, China) with triplicate for each sample. ACTB was used as the internal control. Relative gene expression levels were calculated using the 2 −ΔΔCt S1 2.26 T7 Endonuclease I (T7E1) Assay Genomic DNA was extracted using 500 µL extraction buffer (10 mM Tris, pH 8; 2 mM EDTA; 0.2% Triton X‐100; 200 µg/mL Proteinase K) and incubated at 65°C for 15 min, followed by heat inactivation at 95°C for 5 min. Target regions were amplified by PCR using EconoTaq PLUS GREEN 2X Master Mix (Lucigen) or AccuPrime Taq DNA Polymerase High Fidelity (ThermoFisher) according to the manufacturers’ instructions. PCR products were denatured at 95°C for 10 min and re‐annealed by ramping down at −2°C/sec to 85°C and then −1°C/sec to 25°C. Heteroduplexed PCR products (5 µL) were incubated with 5 U T7E1 enzyme (New England Biolabs) at 37°C for 20 min. Digested products were analysed by electrophoresis on Novex 10% TBE gels (Invitrogen), and band density was quantified using ImageJ26 software. PCR products were also subjected to Sanger sequencing. The estimated percentage of NHEJ events was calculated using the following formula: %NHEJ events = 100 × [1 − (1 − fraction cleaved)], where the fraction cleaved is defined as: (density of digested products)/(density of digested products + undigested parental band). 2.27 Tumour Imaging, Biodistribution and In Vivo Targeting 8505C cells (1 × 10 7 2022c 2.28 In Vivo Antitumour Efficacy We established a nude mouse ATC model by subcutaneously injecting 8505C cells. When the tumours grew to approximately 8 mm in diameter, the tumour‐bearing nude mice were intravenously injected with equal amounts of saline (saline control), Vemurafenib (Vemurafenib‐treated group), sgRNA (EVs loaded with sgBRAF alone), sgBRAF (EVs loaded with pre‐formed Cas9/sgBRAF ribonucleoprotein [RNP] complexes), or TMTP1‐sgBRAF‐EVs (TMTP1‐sgBRAF‐EVs‐treated group) (1 mg/mL, 200 µL per mouse; n 2 2022 2.29 Systemic Toxicity Assessment The systemic toxicity of tumour EVs was further evaluated. We recorded the body weight changes of all nude mice after tumour implantation. Major organs were subjected to H&E staining to assess the potential adverse effects of tumour EVs. Blood samples were collected to perform a complete blood panel analysis and blood biochemical examination, including measurements of serum white blood cells (WBC), red blood cells (RBC), granulocytes (Gran), hematocrit (HCT), hemoglobin (HGB), mean corpuscular volume (MCV), monocytes (Mon), platelets (PLT), mean corpuscular hemoglobin (MCH), mean corpuscular hemoglobin concentration (MCHC), aspartate aminotransferase (AST), albumin (ALB), blood urea nitrogen (BUN), urea, and creatinine (CREA) levels. The concentrations of tumour necrosis factor‐α (TNF‐α) (JN22616, Jining Bio, Shanghai, China), IFN‐γ (JN18496, Jining Bio, Shanghai, China), interleukin‐10 (IL‐10) (JN20865, Jining Bio, Shanghai, China), and interleukin‐1β (IL‐1β) (JN19669, Jining Bio, Shanghai, China) were determined using ELISA. Absorbance at 450 nm was measured using a microplate reader. 2.30 Immunofluorescence For cell samples, cells were fixed with 4% PFA at room temperature for 15 min, then blocked with 3% BSA at 37°C for 30 min to prevent nonspecific staining. Cells were incubated with primary antibodies overnight, washed three times with PBS for 3 min each, and then incubated with secondary antibodies at room temperature for 2 h. DAPI was used to counterstain the nuclei. For tumour tissue samples, tissues were fixed in 4% PFA, dehydrated, cleared, paraffin‐embedded, and sectioned. For immunofluorescence staining, sections were deparaffinised and rehydrated, followed by blocking with 2% BSA. Primary antibodies, including anti‐LAMP1 (ab278043, Abcam, Cambridge, UK) and anti‐TFRC (ab84036, Abcam, Cambridge, UK), were applied and incubated at 4°C overnight. The next day, sections were washed with PBS, incubated with appropriate secondary antibodies, and then observed under a fluorescence microscope. The next day, the sections were washed with PBS and incubated with goat anti‐mouse IgG (A10551, ThermoFisher Scientific Inc., Shanghai, China) or goat anti‐rabbit IgG (A‐11008, ThermoFisher Scientific Inc., Shanghai, China) secondary antibodies at room temperature for 1 h. After washing with PBS, the nuclei were stained with DAPI (C1002, Beyotime, China) for 5 min, followed by three washes with PBS for 5 min each to remove excess DAPI. Cells were carefully lifted from the culture plates using a fine curved needle and small tweezers and placed onto slides with an anti‐fade mounting medium (cells facing down). The slides were observed and photographed under a fluorescence microscope (FV‐1000/ES, Olympus, Japan). Quantification was performed by measuring the fluorescence coverage area in six fixed fields per group under a 40× objective lens, and the average value was calculated. 2.31 RNA Sequencing (RNA‐Seq) RNA‐Seq (Illumina HiSeq) was performed on 8505c cells treated with sgNC and sgBRAF. Sequencing libraries were generated using the NEBNext Ultra RNA Library Prep Kit for Illumina (E7530, NEB, Beverly, MA). Quality control was performed using RNA‐SeQC v1.1.8, and read counts were obtained using HTSeqcounts v0.7.2. Differentially expressed genes (DEGs) between the two groups were identified using the limma package in R, with |log 2 p 2.32 Mutation Data Analysis of Thyroid Cancer Single‐nucleotide variation data for the TCGA‐Thyroid Cancer (Rectal Adenocarcinoma) dataset were downloaded from the TCGA website. ‘Masked Somatic Mutation’ data were selected for analysis. The mutation annotation format (MAF) files were analysed and visualised using the ‘maftools’ package in R. 2.33 Statistical Analysis Data were derived from at least three independent experiments and are presented as mean ± standard deviation (Mean ± SD). Comparisons between the two groups were performed using an independent‐sample t p p p p 3 RESULTS 3.1 BRAF as a Key Mediator of ATC Resistance To investigate the gene mutation landscape in thyroid cancer, we first downloaded somatic mutation profiles of 496 thyroid cancer patients from TCGA and visualised the mutation data using the ‘maftools’ package. As shown in Figure S1A S1B S1C 2024 We detected BRAF protein levels in normal human thyroid cells (Nthy‐ori3‐1), BRAF‐mutant ATC cell lines (8505c (BRAF V600E V600E WT WT S2A V600E V600E WT WT Among these, the highest expression level was observed in 8505c (BRAF V600E V600E V600E WT WT 1A V600E V600E S2B FIGURE 1 Identification of BRAF as a key mediator of ATC resistance using CRISPR‐Cas9. (A) Cell viability of BRAF wild‐type and mutant cells treated with various concentrations of Vemurafenib, measured by CCK‐8 assay; (B) CCK‐8 assays were also used to compare viability in BHT‐101 and 8505C cells transfected with BRAF‐KO sgRNAs versus control sgRNAs; (C) Colony formation assays were performed to evaluate the clonogenic ability of BHT‐101 and 8505C cells after BRAF knockout using different sgRNAs; (D)–(E) Transwell assays assessed the migration and invasion of BHT‐101 and 8505C cells after BRAF knockout. Statistical analyses were conducted using one‐way ANOVA for comparisons among three or more groups. *** denotes p In recent years, the CRISPR/Cas genome editing system has been widely applied for its ability to produce targeted genome edits (Huang et al. 2018 V600E V600E S2C 1B–E 3.2 BRAF Deletion Contributes to the Resistance of BRAF‐Mutant ATC Cells to Drug‐Induced Ferroptosis To further investigate the mechanism by which BRAF deletion inhibits drug resistance in BRAF‐mutant ATC cells, we performed KEGG enrichment analysis on DEGs following BRAF deletion based on transcriptome sequencing. The analysis revealed enrichment of ferroptosis‐related genes after BRAF knockout (Figure S3A,B 2020 S4A,B S4C) S4D 2021c 2016 2A 2020 2021c S4E,F FIGURE 2 Regulation of Ferroptosis in BRAF‐Mutant ATC cells. (A) Western blot detection of SLC7A11, ACSL4, and GPX4 in BHT‐101 and 8505C cells treated with 5 µM Vemurafenib. Two‐group comparisons used unpaired t 2 p t p p We further investigated whether BRAF regulates the sensitivity of BRAF‐mutant ATC cells to Vemurafenib by modulating ferroptosis. We confirmed that BRAF deletion enhanced the efficacy of Vemurafenib in erastin‐ and RSL3‐resistant BRAF‐mutant ATC cells (Figure S4G,H 2B 2C 2D 2E 2F 2G 2H 2 2I To further verify the role of BRAF in ferroptosis, we used the ferroptosis inhibitor ferrostatin‐1 (fer). We found that BRAF deletion significantly increased Vemurafenib‐induced cell death (Figure S5A S5B S5C S5D S5E,F 3.3 TMTP1‐sgBRAF‐EVs as an Effective Protective Delivery Method for In Vivo Gene Editing Although CRISPR‐Cas9 represents a significant advancement in gene editing technology, effectively delivering it to tumour sites using existing delivery methods remains challenging. A critical gap in the therapeutic translation of CRISPR editing is the development of an efficient and safe tumour delivery system. To overcome the limitations of Cas9/sgRNA complex delivery, we developed a method to load Cas9/sgRNA into EVs for the treatment of various diseases. Previous studies have shown that tumour cells produce and secrete more nucleic acids, proteins, and lipids than healthy cells. Some of these molecules are transported in the blood or encapsulated in EVs, such as sEVs, and released into the extracellular environment. Once released, these sEVs become part of a communication network used by other tumour cells and organs (Sun et al. 2018 2017 2019 2023 S6A 3A,B S6B S6C,D S6E FIGURE 3 Preparation and characterisation of tumour‐derived EVs Encapsulating Cas9 Protein and sgRNA. (A) Schematic design of the in vitro study evaluating the homing ability of cancer‐derived EVs; (B) Representative microscopy images showing the uptake of DiR‐labelled 8505c‐EVs and BHT‐101‐EVs by 8505c cells, with quantitative analysis of EV uptake. Endocytosed EVs (red) are visible around the cell nucleus, scale bar = 25 µm; (C) Representative ex vivo fluorescence imaging of major organs and tumour tissues 12 h post‐EV injection, along with statistical analysis of in vivo EV biodistribution. p/s: photons/s; (D) Schematic showing the engineering of TMTP1‐conjugated EVs with tumour‐penetrating capability; (E‐F) Western blot analyses detecting EV markers and Cas9 protein loading efficiency in TMTP1‐modified EVs; (G) Proteinase K and RNase protection assay: TMTP1‐sgBRAF‐EVs treated with/without 0.25% Triton X‐100 and with or without proteinase K (0.5 µg/mL) for 30 min, followed by Western blotting to detect SpCas9 and CD9; (H) RNase A protection assay confirming the encapsulation of sgRNA within EVs. TMTP1‐sgBRAF‐EVs were treated with RNase A alone or in combination with Triton X‐100, and the relative sgRNA levels were quantified by RT‐qPCR. p n p To confirm this finding in vivo, we established an 8505c tumour model in immunodeficient nude mice and intravenously injected DiR‐labelled 8505c or BHT‐101 EVs (Figure S6F 3C Although 8505c‐EVs exhibit stronger homing abilities, more EVs accumulate in the liver than in the tumour. Therefore, we further modified 8505c‐derived tumour cells with the tumour‐targeting peptide TMTP1 (Jiang et al. 2021 2019 3D 3E S7A S7B S7C S7D S7E,F 3F 3F To determine whether the SpCas9/sgRNA complex was encapsulated within extracellular vesicles (EVs) or merely attached to their surface, we performed protease protection and RNase A assays. As shown in Figure 3G 3H These results indicate that TMTP1‐sgBRAF‐EVs may serve as a suitable protective delivery system for in vivo gene editing. 3.4 Enhanced Vemurafenib Sensitivity via TMTP1‐sgBRAF‐EVs Promoting Ferroptosis To evaluate the transport capacity of peptide‐modified EVs, we co‐cultured TMTP1‐sgBRAF‐EVs with 8505c cells. Fluorescence microscopy imaging revealed that TMTP1‐sgBRAF‐EVs exhibited the highest targeting efficiency compared to unmodified EVs (Figure 4A 4A S8A S8B S8C S8D FIGURE 4 TMTP1‐sgBRAF‐EVs induce ferroptosis in BRAF mut 2 n p Using Calcein AM/Propidium Iodide (PI) staining, we detected live and dead cells in 8505c cells. The results showed a significant increase in PI‐positive (PI + 4B 4C 4D 4E 4F 4G 4H 2+ 4I 2 In summary, TMTP1‐sgBRAF‐EVs enhance the sensitivity of BRAF‐mutant ATC cells to Vemurafenib by promoting ferroptosis. These findings provide new evidence supporting TMTP1‐sgBRAF‐EVs as a potential therapeutic approach to improve the response of BRAF‐mutant ATC cells to Vemurafenib by targeting the ferroptosis pathway. 3.5 TMTP1‐sgBRAF‐EVs Significantly Enhance Vemurafenib Efficacy by Promoting Ferroptosis We further investigated the biodistribution and tumour‐targeting capability of TMTP1‐sgBRAF‐EVs by constructing a subcutaneous xenograft model using 8505c cells in nude mice. After intravenous injection of saline or EVs (TMTP1‐sgBRAF‐EVs and unmodified EVs) followed by Vemurafenib administration, fluorescence images were captured at different time points using the IVIS spectrum system (Figure 5A 5B 5C 5D 5E 5E 5F 5G FIGURE 5 Biodistribution of TMTP1‐sgBRAF‐EVs and their impact on the efficacy of vemurafenib treatment. (A) Schematic representation of the experimental design. A subcutaneous tumour model was established in nude mice by injecting 8505C cells. Mice received tail vein injections of EVs (1 mg/mL, 200 µL TMTP1‐sgBRAF‐EVs or unmodified EVs) and 5 µM Vemurafenib. After seven treatment cycles, bioluminescence imaging was performed; (B) IVIS Spectrum system captured fluorescent images of mice at different time points following injection of EVs (1 mg/mL, 200 µL TMTP1‐sgBRAF‐EVs or unmod‐EVs) and 5 µM Vemurafenib; (C) Ex vivo imaging of organs and tumours revealed the distribution of EVs in different tissues after administration; (D) Fluorescence microscopy of frozen tumour sections showed EV localisation. Scale bars = 50 µm; (E) RT‐qPCR and Western blot analysis of BRAF mRNA and protein expression levels in each group; (F) T7E1 assay detected NHEJ events at the BRAF locus; black arrows indicate cleaved fragments; (G) Sanger sequencing results showing indel‐associated overlapping peaks at the BRAF target site in the TMTP1‐sgBRAF‐EVs treatment group; (H) tumour volume measurements of treated nude mice; (I) GSH levels measured post‐treatment; (J) MDA levels, a marker of lipid peroxidation, measured post‐treatment; (K) Immunohistochemistry revealed reduced BRAF protein and increased 4‐HNE (a lipid peroxidation biomarker) following combined treatment with Vemurafenib and TMTP1‐sgBRAF‐EVs. Scale bar = 50 µm. Animal experiments used n p p We next assessed whether TMTP1‐sgBRAF‐EVs could enhance the sensitivity of Vemurafenib in an in situ 8505c model. Cas9 protein and sgBRAF gRNA were co‐administered at precise doses. Systemic administration of TMTP1‐sgBRAF‐EVs (administered weekly via tail vein) improved the therapeutic efficacy of Vemurafenib. The combination of Vemurafenib and TMTP1‐sgBRAF‐EVs was more effective than the combination of Vemurafenib and sgBRAF alone, resulting in a statistically significant reduction in tumour volume during the combination treatment (Figure 5H 5I,J 5K To evaluate the immune response and toxicity induced by TMTP1‐sgBRAF‐EVs, healthy BALB/c nude mice were intravenously injected with TMTP1‐sgBRAF‐EVs three times every other day. Throughout the treatment, mice receiving TMTP1‐sgBRAF‐EVs exhibited blood parameters and biochemical characteristics similar to those of mice given saline (Figure S9A,B S9C S9D 3.6 BRAF Deletion Promotes Ferroptosis by Inhibiting Autophagy‐Mediated TFRC Degradation To further elucidate the specific mechanisms of ferroptosis, we analysed changes in ferroptosis‐related genes in BRAF‐deficient 8505c cells. In 8505c‐sgBRAF cells, we observed an increase in glutamate‐cysteine ligase catalytic subunit (GCLC), solute carrier family 39 member 14 (SLC39A14/Zip14), ferritin heavy chain 1 (FTH1), heme oxygenase 1 (HMOX1), and TFRC, while solute carrier family 40 member 1 (SLC40A1) and solute carrier family 11 member 2 (SLC11A2/DMT1) were decreased (Figure 6A 2020 3+ 2+ 2+ 2013 2017 2011 6B 6C 6D FIGURE 6 Impact of BRAF deletion on the expression of Ferroptosis‐related genes and proteins in 8505c and BHT‐101 cells. (A) Heatmap showing the changes in ferroptosis‐related gene expression in 8505C cells after BRAF deletion; (B) RT‐qPCR detection of mRNA levels of ferroptosis‐related genes in 8505c and BHT‐101 cells following BRAF deletion; (C) Western blot analysis of the effect of BRAF deletion on TFRC and BRAF protein expression after treatment with ferrostatin‐1 (1 µM) or DFO (200 µM) for 48 h; (D) Measurement of the half‐life of TFRC protein in sgBRAF and sgNC cells after inhibition of intracellular protein synthesis with CHX. Repeated measures ANOVA was used to compare data over time; (E) Western blot detection of LC3B and SQSTM1 protein levels; (F) Immunofluorescence analysis showing changes in colocalisation of TFRC with lysosomal marker LAMP1. Scale bar = 25 µm. (G) Western blot showing increased TFRC protein accumulation in BRAF KO cells treated with chloroquine or bafilomycin A1. All cell experiments were repeated at least three times. Two‐group comparisons used unpaired t p Research indicates that TFRC degradation can occur through autophagy (Xiong et al. 2021 2023 6E 6F 6G 3.7 TFRC Knockdown Reduces the Therapeutic Effect of TMTP1‐sgBRAF‐EVs on ATC Cells by Inhibiting Ferroptosis To verify the role of TFRC in TMTP1‐sgBRAF‐EVs‐induced ferroptosis, we knocked down TFRC (shTFRC) in 8505c cells and assessed cell death, ROS levels, lipid peroxidation, GSH levels, MDA levels, and intracellular Fe 2+ S10A S10B 7A 7B 7C 7D 7E 2+ 2+ 7F 2+ FIGURE 7 Role of TFRC in TMTP1‐sgBRAF‐EVs induced Ferroptosis. (A) Live/dead staining with Calcein‐AM and Propidium Iodide (PI) was used to assess cell viability in 8505c cells treated with TFRC knockdown, TMTP1‐sgBRAF‐EVs, or the combination of TMTP1‐sgBRAF‐EVs + shTFRC. Scale bar = 25 µm. (B) ROS levels were measured using the ROS‐Violet610 probe in 8505c cells under the same treatments. (C) Lipid peroxidation levels were evaluated using oxidised BODIPY‐FITC probes. (D) Glutathione levels were analysed by measuring the GSH/GSSG ratio. (E) Malondialdehyde (MDA) levels were assessed to detect lipid peroxidation products. (F) FerroOrange probe was used to measure intracellular ferrous iron (Fe 2 t p p Further clonogenic assays revealed that TMTP1‐sgBRAF‐EVs treatment significantly inhibited the clonogenic potential of 8505c cells, while TFRC knockdown markedly attenuated this inhibitory effect (Figure 7G 7H,I 4 Discussion ATC is a highly aggressive and lethal subtype of thyroid cancer, characterised by rapid progression and high resistance to current therapeutic strategies (Greenberg et al. 2022 2022 2023 2022 In recent years, CRISPR/Cas9 gene editing technology has been widely applied in cancer research due to its high efficiency, strong specificity, and ease of use, earning it the moniker ‘gene scissors’ (Wang et al. 2022c 2023 2023 2024 2022b 2023 2022 2023 2024 2022 2021 In this study, we utilised CRISPR/Cas9 technology to knock out the BRAF gene in BRAF‐mutant ATC cell lines and observed a significant reduction in resistance to Vemurafenib. Further mechanistic investigations revealed that BRAF knockout markedly enhanced Vemurafenib‐induced ferroptosis, primarily through increased lipid peroxidation and ROS accumulation. Notably, we demonstrated for the first time that BRAF depletion promotes ferroptosis by inhibiting autophagy‐mediated degradation of transferrin receptor (TFRC), thereby increasing intracellular iron levels. These findings offer new insights into the mechanisms underlying Vemurafenib resistance in BRAF‐mutant ATC and propose ferroptosis modulation as a promising therapeutic strategy. To achieve efficient and tumour‐specific delivery of BRAF sgRNA, we developed a novel TMTP1‐modified extracellular vesicle system (TMTP1‐sgBRAF‐EVs). The incorporation of the TMTP1 tumour‐homing peptide enabled targeted delivery and significantly improved intracellular transfection efficiency. Cas9 RNPs were loaded into EVs via electroporation, where transient membrane pores allowed efficient encapsulation, assisted by electrostatic interactions and osmotic gradients. Compared to traditional delivery systems, TMTP1‐sgBRAF‐EVs demonstrated enhanced in vivo stability, targeting specificity, and reduced off‐target effects and immunogenicity. This innovative platform not only improved Vemurafenib efficacy but also minimised its side effects, offering a new therapeutic avenue for BRAF‐mutant ATC (Montgomery and Worswick 2022 2025 2022 Interestingly, although T7E1 and sequencing analyses revealed indel frequencies of approximately 20% in the sgBRAF group and 50% in the TMTP1‐sgBRAF‐EVs group, Western blot results showed an almost complete depletion of BRAF protein. Such a discrepancy between moderate editing efficiency and near‐complete protein loss has also been observed in other CRISPR studies and can be attributed to multiple mechanisms: (i) nonsense‐mediated mRNA decay (NMD) triggered by frameshift‐inducing indels, resulting in rapid degradation of mutant transcripts (Nakagawa and Rathinam 2019 2018 2010 2024 5E By integrating CRISPR/Cas9 gene editing with a tumour‐targeted EV delivery system, our study provides a comprehensive exploration of the mechanisms by which BRAF contributes to Vemurafenib resistance in ATC. We demonstrated that TMTP1‐sgBRAF‐EVs enhanced Vemurafenib efficacy by promoting ferroptosis (Figure 8 FIGURE 8 Schematic illustration of TMTP1‐sgBRAF‐EVs reversing resistance mechanisms in BRAF‐mutant ATC (created by BioRender). Despite the significant progress made in this study, several limitations remain. First, the research was primarily conducted in vitro using cell lines and in vivo using mouse models; the safety and efficacy of these findings have yet to be validated in clinical trials. Second, while the TMTP1‐modified EV system demonstrated promising results in delivering CRISPR/Cas9 tools, its long‐term stability and potential immune responses in humans require further investigation. As safety assessment is critical for therapeutic translation, extended biodistribution studies are warranted to elucidate EV clearance rates and to confirm whether they preferentially accumulate in tumours rather than in off‐target organs such as the liver. Such data will be essential to ensure that EVs do not persist in non‐target tissues. Additionally, this study focused on BRAF‐mutant ATC, and further research is needed to explore the resistance mechanisms in other types of thyroid cancer. Therefore, future studies should expand the sample size and conduct larger‐scale clinical trials to validate the generalizability and application potential of these findings. Future research should focus on optimising the TMTP1‐modified EV delivery system to enhance its stability and delivery efficiency in vivo while minimiColocalisation potential immune responses. Larger‐scale clinical trials are essential to validate the safety and efficacy of this system in clinical applications. Additionally, applying this delivery system to other types of cancer could help explore its broad applicability and effectiveness in different tumour treatments. By further research and optimisation, TMTP1‐sgBRAF‐EVs could become a versatile tool for tumour therapy, offering new treatment hopes for patients with BRAF‐mutant ATC and paving the way for a new era in cancer treatment. Author Contributions  Shuo Zhang Zhenrong Ji Xiaoyu Cheng Yue Ma Mingliang Feng Dasheng Cai Tao Bai Ethics Statement All animal experiments were approved by the Animal Ethics Committee of the First Hospital of China Medical University. Consent The authors have nothing to report. Conflicts of Interest The authors declare no conflicts of interest. Supporting information Note: (A) Mutation landscape of 496 thyroid cancer samples from the TCGA database. Each column represents a tumour sample, and each row represents a gene. Different colours indicate various types of mutations, as shown in the legend. The bar graph at the top displays the tumour mutation burden (TMB) for each sample, while the bar graph on the right shows the number of samples with mutations in each gene; (B) mRNA expression levels of BRAF in different thyroid cancer samples from the cBioPortal database; (C) Schematic representation of the BRAF protein, showing the somatic mutation rates and positions. The V600E mutation is a known driver mutation in thyroid cancer.  Supporting figure:2 Protein Expression in BRAF‐Mutant ATC Cells Note: (A) BRAF expression levels were analysed by Western blot in Nthy‐ori3‐1 and ATC cell lines. Quantification showed significantly higher BRAF expression in BRAFV600E‐mutant ATC cells, with the highest in 8505C; (B) Treatment with 5 µM Vemurafenib reduced BRAF protein levels in BHT‐101 and 8505C cells; (C) BRAF protein levels in BHT‐101 and 8505C were examined following knockout using different sgRNAs. All experiments were repeated at least three times. One‐way ANOVA was used for multiple‐group comparisons. *** p  Supporting figure:3 Transcriptome Sequencing of ATC Cells Treated with sgBRAF Note: (A) Volcano plot of DEGs in 8505c cells treated with sgNC and sgBRAF, with upregulated genes in yellow and downregulated genes in green (n = 3); (B) KEGG analysis of DEGs.  Supporting figure:4 Vemurafenib‐Induced Ferroptosis in BRAF‐Mutant ATC Cells Note: (A) Lipid peroxidation in BHT‐101 and 8505C cells after 5 µM Vemurafenib using BODIPY‐FITC and flow cytometry; (B) Intracellular ROS levels measured with ROS probes; (C) Ferroptotic morphology under TEM; (D) Cell viability under Vemurafenib and inhibitors: NAC, ZVAD‐fmk, necrostatin‐1, ferrostatin‐1; (E‐F) Detection of live and dead cells in RSL3‐resistant and erastin‐resistant BRAF‐mutant ATC cells, scale bar = 25 µm; (G‐H) Detection of live and dead cells in sgBRAF‐treated RSL3‐resistant and erastin‐resistant BRAF‐mutant ATC cells, scale bar = 25 µm. Cell experiments were repeated at least three times. All experiments were repeated at least three times. Two‐group comparisons used unpaired t p  Supporting figure:5 Effect of BRAF Deletion on Vemurafenib‐Induced Ferroptosis Note: (A) The effect of 100 nM ferroptosis inhibitor ferrostatin‐1 on Vemurafenib‐induced cell death in BRAF‐deficient BHT‐101 and 8505C cells. Scale bar = 25 µm; (B) Measurement of GSH levels in BRAF‐deficient BHT‐101 and 8505C cells treated with 100 nM ferrostatin‐1; (C) Detection of malondialdehyde (MDA) levels in BRAF‐deficient BHT‐101 and 8505C cells following ferrostatin‐1 treatment; (D) Colony formation assay showing the effect of 100 nM ferrostatin‐1 on the clonogenic ability of BRAF‐deficient BHT‐101 and 8505C cells; (E‐F) Migration and invasion assays, respectively, in BRAF‐deficient cells after treatment with ferrostatin‐1. Scale bar = 50 µm. All cell experiments were repeated at least three times. One‐way ANOVA was used for comparisons among three or more groups. * p p p  Supporting figure:6 Cancer Cell‐Derived EVs Preferentially Fuse with Their Parental Cells Note: (A) Western blot analysis of Alix, TSG101, and Calnexin isolated from cells and EVs. The supernatant obtained from ultracentrifugation during EV isolation serves as a negative control; (B) Schematic design of the in vitro study to evaluate the ability of cancer‐derived EVs to regulate their parental cells; (C‐D) Representative microscopy images showing the uptake of DiR‐labelled BHT‐101‐EVs (red) and DiO‐labelled 8505c‐EVs (green) by BHT‐101 and 8505c cells, with quantitative analysis of EV uptake in BHT‐101 and 8505c cells, scale bar = 25 µm; (E) Representative microscopy images showing the uptake of DiO‐labelled BHT‐101‐EVs (green) and DiR‐labelled 8505c‐EVs (red) by BHT‐101 and 8505c cells, with quantitative analysis of EV uptake in BHT‐101 and 8505c cells, scale bar = 25 µm; (F) Schematic design of the in vivo study to evaluate the homing ability of 8505c tumour EVs in a subcutaneous tumour model in nude mice. Cell experiments were repeated at least three times. Experimental animals n = 3. Unpaired t p  Supporting figure:7 Preparation and characterisation of Tumour‐Derived EVs Encapsulating Cas9 Protein and sgRNA Note: (A) Loading capacity of purified EVs with Cas9 protein/sgRNA complexes using electroporation, freeze‐thaw, and sonication methods; (B) TEM images of unmodified EVs and TMTP1‐sgBRAF‐EVs, scale bar = 100 nm; (C) AFM images of unmodified EVs and TMTP1‐sgBRAF‐EVs. Unpaired t p  Supporting figure:8 Study on the Sensitivity of BRAF mut Note: (A) Colony formation assay showing the effect of BRAF deletion and treatment with TMTP1‐modified extracellular vesicles (TMTP1‐sgBRAF‐EVs) on the proliferation of 8505c cells; (B) Migration assay showing the effect of BRAF deletion and TMTP1‐sgBRAF‐EVs treatment on the migration ability of 8505c cells, scale bar = 50 µm; (C) Invasion assay showing the effect of BRAF deletion and TMTP1‐sgBRAF‐EVs treatment on the invasion ability of 8505c cells, scale bar = 50 µm; (D) Western blot analysis showing the effect of BRAF deletion and TMTP1‐sgBRAF‐EVs treatment on the expression of proliferation marker PCNA, Vim, and N‐cadherin (N‐cad) in 8505c cells. Cell experiments were repeated at least three times. One‐way ANOVA was used for multi‐group comparisons. ** p p  Supporting figure:9 Toxicity and Immune Response Evaluation of TMTP1‐sgBRAF‐EVs Note: (A) Blood parameters and biochemical characteristics of healthy BALB/c nude mice; (B) H&E staining of tissue sections from different organs, scale bar = 50 µm; (C) Monitoring of body weight changes in nude mice; (D) Measurement of cytokine levels (IL‐10, IL‐1β, TNF‐α, IFN‐γ) in plasma. Experimental animals n = 3.  Supporting figure:10 Effect of TFRC Knockdown on BRAF and TFRC Protein Expression Note: (A) Western blot analysis showing the effect of TFRC knockdown (shTFRC‐1 and shTFRC‐2) on BRAF protein expression in 8505c cells. The bar graph on the right quantifies the relative expression levels of BRAF and TFRC proteins; (B) Western blot analysis showing the effect of TFRC knockdown and BRAF deletion (sgBRAF) on BRAF and TFRC protein expression in 8505c cells. The bar graph on the right quantifies the relative expression levels of BRAF and TFRC proteins. Cell experiments were repeated at least three times. One‐way ANOVA was applied for comparisons among three or more groups. *** p  Supporting Table Acknowledgements The authors have nothing to report. Data Availability Statement The datasets used or analysed during the current study are available from the corresponding author on reasonable request. References Akyuz E. Z. Doganyigit E. Eroglu 2021 Myocardial Iron Overload in an Experimental Model of Sudden Unexpected Death in Epilepsy Frontiers in Neurology 12 609236 10.3389/fneur.2021.609236 33643194 PMC7905080 Alzahrani K. O. S. M. Alshahrani S. M. Alajel 2023 Evaluating the Effectiveness of the Ministry of Health Restriction Policy on Seasonal Antibiotic Consumption Trends in Saudi Arabia, 2016–2020 Frontiers in Pharmacology 14 1242087 10.3389/fphar.2023.1242087 38099146 PMC10720327 Baloch Z. W. S. L. Asa J. A. Barletta 2022 Overview of the 2022 WHO Classification of Thyroid Neoplasms Endocrine Pathology 33 1 27 63 10.1007/s12022-022-09707-3 35288841 Batista M. B. G. Chandra R. A. Monteiro E. M. de Souza R. Dixon 2018 Hierarchical Interactions Between Fnr Orthologs Allows Fine‐tuning of Transcription in Response to Oxygen in Herbaspirillum seropedicae Nucleic Acids Research 46 8 3953 3966 10.1093/nar/gky142 29529262 PMC5934665 Bi G. J. Liang Y. Bian 2024 Polyamine‐Mediated Ferroptosis Amplification Acts as a Targetable Vulnerability in Cancer Nature Communications 15 1 2461 10.1038/s41467-024-46776-w PMC10951362 38504107 Bible K. C. E. Kebebew J. Brierley 2021 2021 American Thyroid Association Guidelines for Management of Patients With Anaplastic Thyroid Cancer Thyroid 31 3 337 386 10.1089/thy.2020.0944 33728999 PMC8349723 Boucai L. M. Zafereo M. E. Cabanillas 2024 Thyroid Cancer JAMA 331 5 425 10.1001/jama.2023.26348 38319329 Califano I. A. Smulever F. Jerkovich F. Pitoia 2023 Advances in the Management of Anaplastic Thyroid Carcinoma: Transforming a Life‐Threatening Condition Into a Potentially Treatable Disease Reviews in Endocrine and Metabolic Disorders 25 1 123 147 10.1007/s11154-023-09833-1 37648897 Chen G.‐H. C.‐C. Song K. Pantopoulos X.‐L. Wei H. Zheng Z. Luo 2022 Mitochondrial Oxidative Stress Mediated Fe‐induced Ferroptosis via the NRF2‐ARE Pathway Free Radical Biology and Medicine 180 95 107 10.1016/j.freeradbiomed.2022.01.012 35045311 Chen L. Q. Cai R. Yang 2023 GINS4 suppresses Ferroptosis by Antagonizing p53 Acetylation With Snail Proceedings of the National Academy of Sciences 120 15 e2219585120 10.1073/pnas.2219585120 PMC10104543 37018198 Chen X. X. Chen W. Xie 2025 BRAF‐Activated ARSI Suppressed EREG‐Mediated Ferroptosis to Promote BRAFV600E (Mutant) Papillary Thyroid Carcinoma Progression and Sorafenib Resistance International Journal of Biological Sciences 21 1 128 142 10.7150/ijbs.99423 39744439 PMC11667812 Cook S. J. P. A. Lochhead 2022 ERK5 Signalling and Resistance to ERK1/2 Pathway Therapeutics: The Path Less Travelled? Frontiers in Cell and Developmental Biology 10 839997 10.3389/fcell.2022.839997 35903549 PMC9315226 Díaz‐Gago S. J. Vicente‐Gutiérrez J. M. Ruiz‐Rodríguez 2024 Autophagy Sustains Mitochondrial Respiration and Determines Resistance to BRAF V600E Autophagy 20 6 1383 1397 10.1080/15548627.2024.2312790 38436206 PMC11210916 Ding S. J. Liu X. Han M. Tang 2023 CRISPR/Cas9‐Mediated Genome Editing in Cancer Therapy International Journal of Molecular Sciences 24 22 16325 10.3390/ijms242216325 38003514 PMC10671490 Ding W. X. Gao X. Ran 2024 Progress in Diagnosing and Treating Thyroid Squamous Cell Carcinoma Under the 5th Edition of WHO Classification Frontiers in Endocrinology 14 1273472 10.3389/fendo.2023.1273472 38303977 PMC10833225 Doll S. B. Proneth Y. Y. Tyurina 2016 ACSL4 Dictates Ferroptosis Sensitivity by Shaping Cellular Lipid Composition Nature Chemical Biology 13 1 91 98 10.1038/nchembio.2239 27842070 PMC5610546 Feng H. K. Schorpp J. Jin 2020 Transferrin Receptor Is a Specific Ferroptosis Marker Cell Reports 30 10 3411 3423.e7 10.1016/j.celrep.2020.02.049 32160546 PMC7172030 Gong Y. R. G. J. Klein Wolterink J. Wang G. M. J. Bos W. T. V. Germeraad 2021 Chimeric Antigen Receptor Natural Killer (CAR‐NK) Cell Design and Engineering for Cancer Therapy Journal of Hematology & Oncology 14 1 73 10.1186/s13045-021-01083-5 33933160 PMC8088725 Goswami S. K. E. Pauken L. Wang P. Sharma 2024 Next‐Generation Combination Approaches for Immune Checkpoint Therapy Nature Immunology 25 12 2186 2199 10.1038/s41590-024-02015-4 39587347 Grabowska M. E. A. Huang Z. Wen B. Li W.‐Q. Wei 2023 Drug Repurposing for Alzheimer's Disease From 2012–2022—A 10‐Year Literature Review Frontiers in Pharmacology 14 1257700 10.3389/fphar.2023.1257700 37745051 PMC10512468 Greenberg J. A. M. D. Moore J. W. Thiesmeyer 2022 Coexisting Papillary and Anaplastic Thyroid Cancer: Elucidating the Spectrum of Aggressive Behavior Annals of Surgical Oncology 30 1 137 145 10.1245/s10434-022-12553-6 36224511 Hao R. J. Ge X. Song F. Li D. Sun‐Waterhouse D. Li 2021 Cadmium Induces Ferroptosis and Apoptosis by Modulating miR‐34a‐5p/Sirt1axis in PC12 Cells Environmental Toxicology 37 1 41 51 10.1002/tox.23376 34558789 Happi Mbakam C. G. Lamothe G. Tremblay J. P. Tremblay 2022 CRISPR‐Cas9 Gene Therapy for Duchenne Muscular Dystrophy Neurotherapeutics 19 3 931 941 10.1007/s13311-022-01197-9 35165856 PMC9294086 Hu Z. G. Chen Y. Zhao 2023 Exosome‐Derived circCCAR1 Promotes CD8 + T‐Cell Dysfunction and Anti‐PD1 Resistance in Hepatocellular Carcinoma Molecular Cancer 22 1 55 10.1186/s12943-023-01759-1 36932387 PMC10024440 Huang L.‐C. K.‐W. Tam W.‐N. Liu 2018 CRISPR/Cas9 Genome Editing of Epidermal Growth Factor Receptor Sufficiently Abolished Oncogenicity in Anaplastic Thyroid Cancer Disease Markers 2018 1 14 10.1155/2018/3835783 PMC5925145 29849821 Issagholian L. E. Tabaie A. J. Reddy M. S. Ghauri R. Patel 2023 Expression of E‐cadherin and N‐cadherin in Epithelial‐to‐Mesenchymal Transition of Osteosarcoma: a Systematic Review Cureus 15 11 10.7759/cureus.49521 PMC10752829 38156135 Jiang G. X. Wang Y. Zhou 2021 TMTP1‐Modified, Tumor Microenvironment Responsive Nanoparticles Co‐Deliver Cisplatin and Paclitaxel Prodrugs for Effective Cervical Cancer Therapy International Journal of Nanomedicine 16 4087 4104 10.2147/ijn.s298252 34163161 PMC8214535 Johnson R. M. X. Qu C.‐F. Lin 2022 ARID1A Mutations Confer Intrinsic and Acquired Resistance to Cetuximab Treatment in Colorectal Cancer Nature Communications 13 1 5478 10.1038/s41467-022-33172-5 PMC9482920 36117191 Khaddour K. H. Kurn P. M. Zito 2025 Vemurafenib StatPearls StatPearls Publishing 30571050 Kim D.‐H. H.‐I. Choi J. S. Park 2022a Farnesoid X Receptor Protects Against Cisplatin‐Induced Acute Kidney Injury by Regulating the Transcription of Ferroptosis‐Related Genes Redox Biology 54 102382 10.1016/j.redox.2022.102382 35767918 PMC9241134 Kim M.‐J. Y. Min S.‐K. Jeong 2022b USP15 Negatively Regulates Lung Cancer Progression Through the TRAF6‐BECN1 Signaling Axis for Autophagy Induction Cell Death & Disease 13 4 348 10.1038/s41419-022-04808-7 35422093 PMC9010460 Kowenz‐Leutz E. O. Pless G. Dittmar M. Knoblich A. Leutz 2010 Crosstalk Between C/EBPβ Phosphorylation, Arginine Methylation, and SWI/SNF/Mediator Implies an Indexing Transcription Factor Code EMBO Journal 29 6 1105 1115 10.1038/emboj.2010.3 20111005 PMC2845275 Lee M. B. R. Untch B. Xu 2022 Genomic and Transcriptomic Correlates of Thyroid Carcinoma Evolution After BRAF Inhibitor Therapy Molecular Cancer Research 20 1 45 55 10.1158/1541-7786.mcr-21-0442 34635506 PMC8738128 Li B. Y. Cao M. Sun H. Feng 2021a Expression, Regulation, and Function of Exosome‐Derived miRNAs in Cancer Progression and Therapy FASEB Journal 35 10 e21916 10.1096/fj.202100294rr 34510546 Li B. X. Chen W. Qiu 2022 Synchronous Disintegration of Ferroptosis Defense Axis via Engineered Exosome‐Conjugated Magnetic Nanoparticles for Glioblastoma Therapy Advanced Science 9 17 2105451 10.1002/advs.202105451 35508804 PMC9189685 Li S. Y. He K. Chen 2021b RSL3 Drives Ferroptosis Through NF‐κB Pathway Activation and GPX4 Depletion in Glioblastoma Oxidative Medicine and Cellular Longevity 2021 1 2915019 10.1155/2021/2915019 34987700 PMC8720588 Li Y.‐J. J.‐Y. Wu J. Liu 2021c Artificial Exosomes for Translational Nanomedicine Journal of Nanobiotechnology 19 1 242 10.1186/s12951-021-00986-2 34384440 PMC8359033 Liang Y. J. Zhang C. Xu 2023 Biomimetic Mineralized CRISPR/Cas RNA Nanoparticles for Efficient Tumor‐Specific Multiplex Gene Editing ACS Nano 17 15 15025 15043 10.1021/acsnano.3c04116 37481734 Liu Y. Y. Zhang Z. Tan 2022 Lysyl Oxidase Promotes Anaplastic Thyroid Carcinoma Cell Proliferation and Metastasis Mediated Via BMP1 Gland Surgery 11 1 245 257 10.21037/gs-21-908 35242686 PMC8825512 Lu M.‐D. H. Li J.‐H. Nie 2022 Dual Inhibition of BRAF‐MAPK and STAT3 Signaling Pathways in Resveratrol‐Suppressed Anaplastic Thyroid Cancer Cells With BRAF Mutations International Journal of Molecular Sciences 23 22 14385 10.3390/ijms232214385 36430869 PMC9692422 Lu Y. Y. Zhao P. Liu X. Xu 2023 Vemurafenib Activates the Sonic Hedgehog Pathway and Promotes Thyroid Cancer Stem Cell Self‐Renewal Endocrine‐Related Cancer 30 11 e220392 10.1530/erc-22-0392 37643458 Ma R. Y. Liu X. Che 2022 Nuclear PD‐L1 Promotes Cell Cycle Progression of BRAF‐mutated Colorectal Cancer by Inhibiting THRAP3 Cancer Letters 527 127 139 10.1016/j.canlet.2021.12.017 34923044 Maniakas A. M. Zafereo M. E. Cabanillas 2022 Anaplastic Thyroid Cancer Endocrinology and Metabolism Clinics of North America 51 2 391 401 10.1016/j.ecl.2021.11.020 35662448 Mirzaei H. A. Sahebkar M. R. Jaafari M. Goodarzi H. R. Mirzaei 2017 Diagnostic and Therapeutic Potential of Exosomes in Cancer: The Beginning of a New Tale? Journal of Cellular Physiology 232 12 3251 3260 10.1002/jcp.25739 27966794 Mondal J. S. Pillarisetti V. Junnuthula 2023 Hybrid Exosomes, Exosome‐Like Nanovesicles and Engineered Exosomes for Therapeutic Applications Journal of Controlled Release 353 1127 1149 10.1016/j.jconrel.2022.12.027 36528193 Montalbetti N. A. Simonin G. Kovacs M. A. Hediger 2013 Mammalian Iron Transporters: Families SLC11 and SLC40 Molecular Aspects of Medicine 34 2–3 270 287 10.1016/j.mam.2013.01.002 23506870 Montgomery S. S. Worswick 2022 Photosensitizing Drug reactions Clinics in Dermatology 40 1 57 63 10.1016/j.clindermatol.2021.08.014 35190066 Mu N. J. Li L. Zeng 2023 Plant‐Derived Exosome‐Like Nanovesicles: Current Progress and Prospects International Journal of Nanomedicine 18 4987 5009 10.2147/ijn.s420748 37693885 PMC10492547 Nakagawa M. M. C. V. Rathinam 2019 A20 Deficiency in Hematopoietic Stem Cells Causes Lymphopenia and Myeloproliferation due to Elevated Interferon‐γ Signals Scientific Reports 9 1 12658 10.1038/s41598-019-49038-8 31477755 PMC6718430 Nasimi M. A. Ghanadan K. Kamyab V. Azhari T. Yousefi 2021 Prevalence and Main Determinants of BRAF V600E Mutation in Dysplastic and Congenital Nevi Iranian Journal of Pathology 16 1 51 56 10.30699/ijp.2020.130968.2451 33391380 PMC7691709 Ou K. X. Liu X. Ma L. Yang 2024 Development and Validation of a Clinical Prognostic Model for BRAF V600E‐mutated Colorectal Cancer Patients Based on Pathological Stage, Microsatellite Status, and Primary Tumor Site Frontiers in Oncology 14 1461237 10.3389/fonc.2024.1461237 39464719 PMC11502291 Park S. H. G. Bao 2021 CRISPR/Cas9 Gene Editing for Curing Sickle Cell Disease Transfusion and Apheresis Science 60 1 103060 10.1016/j.transci.2021.103060 33455878 PMC8049447 Petroni D. C. Fabbri S. Babboni L. Menichetti G. Basta S. Del Turco 2023 Extracellular Vesicles and Intercellular Communication: Challenges for In Vivo Molecular Imaging and Tracking Pharmaceutics 15 6 1639 10.3390/pharmaceutics15061639 37376087 PMC10301899 Pinilla‐Tenas J. J. B. K. Sparkman A. Shawki 2011 Zip14 is a Complex Broad‐Scope Metal‐Ion Transporter whose Functional Properties Support Roles in the Cellular Uptake of Zinc and Nontransferrin‐Bound Iron American Journal of Physiology‐Cell Physiology 301 4 C862 C871 10.1152/ajpcell.00479.2010 21653899 PMC3191563 Qiu X. Z. Li X. Han 2019 Tumor‐Derived Nanovesicles Promote Lung Distribution of the Therapeutic Nanovector Through Repression of Kupffer Cell‐Mediated Phagocytosis Theranostics 9 9 2618 2636 10.7150/thno.32363 31131057 PMC6525995 Scheffel R. S. J. M. Dora A. L. Maia 2021 BRAF Mutations in Thyroid Cancer Current Opinion in Oncology 34 1 9 18 10.1097/cco.0000000000000797 34636352 Shan J. W. Jiang J. Chang 2023 NUF2 Drives Cholangiocarcinoma Progression and Migration Via Inhibiting Autophagic Degradation of TFR1 International Journal of Biological Sciences 19 5 1336 1351 10.7150/ijbs.80737 37056930 PMC10086752 Shen M. X. Wu M. Zhu X. Yi 2022 Recent Advances in Biological Membrane‐Based Nanomaterials for Cancer Therapy Biomaterials Science 10 20 5756 5785 10.1039/d2bm01044e 36017968 Shimoi T. K. Sunami M. Tahara 2024 Dabrafenib and Trametinib Administration in Patients With BRAF V600E/R or non‐V600 BRAF Mutated Advanced Solid Tumours (BELIEVE, NCCH1901): A Multicentre, Open‐Label, and Single‐Arm Phase II Trial eClinicalMedicine 69 102447 10.1016/j.eclinm.2024.102447 38333370 PMC10850114 Sun W. J. Luo H. Jiang D. D. Duan 2018 Tumor Exosomes: A Double‐Edged Sword in Cancer Therapy Acta Pharmacologica Sinica 39 4 534 541 10.1038/aps.2018.17 29542685 PMC5888693 Sun W.‐Y. V. A. Tyurin K. Mikulska‐Ruminska 2021 Phospholipase iPLA2β Averts Ferroptosis by Eliminating a Redox Lipid Death Signal Nature Chemical Biology 17 4 465 476 10.1038/s41589-020-00734-x 33542532 PMC8152680 Szklener K. M. Mazurek M. Wieteska M. Wacławska M. Bilski S. Mańdziuk 2022 New Directions in the Therapy of Glioblastoma Cancers 14 21 5377 10.3390/cancers14215377 36358795 PMC9655599 Tang F. S. Li D. Liu J. Chen C. Han 2020 Sorafenib Sensitizes Melanoma Cells to Vemurafenib Through Ferroptosis Translational Cancer Research 9 3 1584 1593 10.21037/tcr.2020.01.62 35117506 PMC8798636 Tang J. Y. Luo L. Xiao 2022 USP26 Promotes Anaplastic Thyroid Cancer Progression by Stabilizing TAZ Cell Death & Disease 13 4 326 10.1038/s41419-022-04781-1 35397626 PMC8994751 Vladimirova U. P. Rumiantsev M. Zolotovskaia 2021 DNA Repair Pathway Activation Features in Follicular and Papillary Thyroid Tumors, Interrogated Using 95 Experimental RNA Sequencing Profiles Heliyon 7 3 e06408 10.1016/j.heliyon.2021.e06408 33748479 PMC7970325 Wan Y. L. Li R. Chen 2024 Engineered Extracellular Vesicles Efficiently Deliver CRISPR‐Cas9 Ribonucleoprotein (RNP) to Inhibit Herpes Simplex Virus1 Infection in Vitro and in Vivo Acta Pharmaceutica Sinica B 14 3 1362 1379 10.1016/j.apsb.2023.10.004 38486996 PMC10934336 Wang C. N. Li Y. Li 2022a Engineering a HEK‐293T Exosome‐Based Delivery Platform for Efficient Tumor‐Targeting Chemotherapy/Internal Irradiation Combination Therapy Journal of Nanobiotechnology 20 1 247 10.1186/s12951-022-01462-1 35642064 PMC9153154 Wang M. T. Wei R. Gong J. Zhu Z. Li 2022b Risk Stratification in Patients With Anaplastic Thyroid Carcinoma: Role of Age Endocrine 77 2 305 318 10.1007/s12020-022-03085-w 35608773 Wang S.‐W. C. Gao Y.‐M. Zheng 2022c Current Applications and Future Perspective of CRISPR/Cas9 Gene Editing in Cancer Molecular Cancer 21 1 57 10.1186/s12943-022-01518-8 35189910 PMC8862238 Wang X. M. Zhang C. Mao 2023 Icariin Alleviates Ferroptosis‐Related Atherosclerosis by Promoting Autophagy in Xo‐LDL‐Induced Vascular Endothelial Cell Injury and Atherosclerotic Mice Phytotherapy Research 37 9 3951 3963 10.1002/ptr.7854 37344941 Wei R. G. Jiang M. Lv 2019 TMTP1‐Modified Indocyanine Green‐Loaded Polymeric Micelles for Targeted Imaging of Cervical Cancer and Metastasis Sentinel Lymph Node In Vivo Theranostics 9 24 7325 7344 10.7150/thno.35346 31695771 PMC6831285 Xie P. M. Yu B. Zhang 2024 CRKL Dictates Anti‐PD‐1 Resistance by Mediating Tumor‐Associated Neutrophil Infiltration in Hepatocellular Carcinoma Journal of Hepatology 81 1 93 107 10.1016/j.jhep.2024.02.009 38403027 Xiong Q. X. Li W. Li 2021  WDR45 Frontiers in Molecular Biosciences 8 45831 10.3389/fmolb.2021.645831 PMC8126626 34012978 Xu J. D. Xue Y. Li J. Zhou H. Chen L. Fan 2024 Mechanisms of Vemurafenib‐Induced Anti‐Tumor Effects in ATC FRO Cells Heliyon 10 6 e27629 10.1016/j.heliyon.2024.e27629 38509927 PMC10951592 Yan H. T. Zou Q. Tuo 2021 Ferroptosis: Mechanisms and Links With Diseases Signal Transduction and Targeted Therapy 6 1 49 10.1038/s41392-020-00428-9 33536413 PMC7858612 Yang X. N. K. Kawasaki J. Min T. Matsui F. Wang 2022 Ferroptosis in Heart Failure Journal of Molecular and Cellular Cardiology 173 141 153 10.1016/j.yjmcc.2022.10.004 36273661 PMC11225968 Yuan J. Y. Guo 2022 Targeted Therapy for Anaplastic Thyroid Carcinoma: Advances and Management Cancers 15 1 179 10.3390/cancers15010179 36612173 PMC9818071 Zeng C. M. Wang S. Xie 2023a Clinical Research Progress on BRAF V600E‐Mutant Advanced Colorectal Cancer Journal of Cancer Research and Clinical Oncology 149 17 16111 16121 10.1007/s00432-023-05301-0 37639010 PMC11797460 Zeng X. B. Yao J. Liu 2023b The SMARCA4 R1157W NPJ Precision Oncology 7 1 28 10.1038/s41698-023-00367-y 36922568 PMC10017700 Zhang C. X. Liu S. Jin Y. Chen R. Guo 2022 Ferroptosis in Cancer Therapy: A Novel Approach to Reversing Drug Resistance Molecular Cancer 21 1 47 10.1186/s12943-022-01530-y 35151318 PMC8840702 Zhao N. A.‐S. Zhang A. Wortham S. Jue M. Knutson C. Enns 2017 The Tumor Suppressor, P53, Decreases the Metal Transporter, ZIP14 Nutrients 9 12 1335 10.3390/nu9121335 29292794 PMC5748785 Zhao Y. Y. Li R. Zhang F. Wang T. Wang Y. Jiao 2020 The Role of Erastin in Ferroptosis and Its Prospects in Cancer Therapy OncoTargets and Therapy 13 5429 5441 10.2147/ott.s254995 32606760 PMC7295539 Zou J. W. Yang W. Cui 2023 Therapeutic Potential and Mechanisms of Mesenchymal Stem Cell‐Derived Exosomes as Bioactive Materials in Tendon–Bone Healing Journal of Nanobiotechnology 21 1 14 10.1186/s12951-023-01778-6 36642728 PMC9841717 Zou Y. S. Zheng X. Xie 2022 N6‐Methyladenosine Regulated FGFR4 Attenuates Ferroptotic Cell Death in Recalcitrant HER2‐Positive Breast Cancer Nature Communications 13 1 2672 10.1038/s41467-022-30217-7 PMC9106694 35562334 ",
  "metadata": {
    "Title of this paper": "N6‐Methyladenosine Regulated FGFR4 Attenuates Ferroptotic Cell Death in Recalcitrant HER2‐Positive Breast Cancer",
    "Journal it was published in:": "Journal of Extracellular Vesicles",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12465009/"
  }
}