{
  "title": "Paper_373",
  "abstract": "pmc Clin Transl Med Clin Transl Med 1991 clintransmed CTM2 Clinical and Translational Medicine 2001-1326 Wiley PMC12483842 PMC12483842.1 12483842 12483842 41028942 10.1002/ctm2.70481 CTM270481 1 Review Review Targeting gut microbiota and metabolites in cancer radiotherapy MA et al Ma Shuling  1 Li Xinpei  1 Shang Shijie  1  2 Zhai Zijun  1  3 Wu Meng  1 Song Qian  1 sqoxaid@163.com Chen Dawei https://orcid.org/0000-0002-6762-7997  1 dave0505@yeah.net   1 Shandong Provincial Key Laboratory of Precision Oncology Shandong Cancer Hospital and Institute Shandong First Medical University and Shandong Academy of Medical Sciences Jinan China   2 Cancer Center, Union Hospital, Tongji Medical College Huazhong University of Science and Technology Wuhan China   3 Cheeloo College of Medicine Shandong University Jinan China * Correspondence dave0505@yeah.net sqoxaid@163.com 30 9 2025 10 2025 15 10 497549 10.1002/ctm2.v15.10 e70481 01 9 2025 01 4 2025 14 9 2025 30 09 2025 02 10 2025 02 10 2025 © 2025 The Author(s). Clinical and Translational Medicine https://creativecommons.org/licenses/by/4.0/ This is an open access article under the terms of the http://creativecommons.org/licenses/by/4.0/ Abstract Radiotherapy (RT) is a cornerstone in cancer treatment, but often causes radiation‐induced injury. Accumulating evidence points to the gut microbiota in modulating immune functions and maintaining intestinal integrity to impact RT efficacy. This review examines the current understanding of intestinal flora and their metabolites within the context of RT. We outlined the current research applications in how microbiota‐targeted strategies such as probiotics, prebiotics, dietary interventions, and faecal microbiota transplantation could restore microbial balance, reduce toxicity, and improve patient prognosis. Microbial byproducts such as short‐chain fatty acids, bile acids and tryptophan exhibit protective effects against radiation damage, supporting immune modulation and enhancing tumour radiosensitivity. These microbial products underscore the potential of gut microbiota‐targeted therapies as adjunctive treatments in RT, with implications for reducing toxicity and personalizing cancer care. All these strategies targeting gut microbiota and metabolites potentially aim to develop innovative therapies that boost RT effectiveness while minimizing side effects, and finally revolutionizing personalized cancer treatment. Key points  RT alters gut microbiota composition and contributes to intestinal injury and systemic toxicity. Gut microbiota regulate mucosal integrity, immune responses and therapeutic outcomes of RT. Microbial metabolites, including SCFAs, BAs and tryptophan derivatives, protect against radiation injury and enhance tumour radiosensitivity. Microbiota‐targeted interventions (e.g. probiotics, prebiotics, dietary strategies, FMT) show promise for reducing RT‐related toxicity and improving patient prognosis. Radiotherapy (RT) efficacy and toxicity are influenced by gut microbiota and their metabolites. This review explores how probiotics, prebiotics, and microbial byproducts (e.g., short‐chain fatty acids [SCFAs]) mitigate radiation damage and enhance tumour radiosensitivity. Microbiota‐targeted strategies offer promising adjuncts to RT, potentially personalizing cancer therapy by improving outcomes and reducing side effects.(Source: Created with BioRender.com) cancer gut microbiota and metabolites radiotherapy pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement no pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes source-schema-version-number 2.0 cover-date October 2025 details-of-publishers-convertor Converter:WILEY_ML3GV2_TO_JATSPMC version:6.6.4 mode:remove_FC converted:30.09.2025  Ma S Li X Shang S Targeting gut microbiota and metabolites in cancer radiotherapy Clin Transl Med 2025 15 e70481 10.1002/ctm2.70481 41028942 1 INTRODUCTION Despite extensive research spanning decades, cancer continues to be a major global health challenge, characterized by high mortality and morbidity. As the second most common cause of mortality globally, it accounted for almost 10 million fatalities in 2022.  1  2 A variety of strategies have been developed for cancer treatment, among which RT remains one of the most commonly utilized methods. As one of the three traditional pillars of cancer therapy, Radiotherapy (RT) primarily aims to improve local disease control by maximizing the cytotoxicity to tumour cell destruction while safeguarding nearby healthy tissues from harm. Over the years, advancements in RT technology have significantly improved the precision and efficacy of RT, reducing side effects and enhancing the therapeutic index.  3  4  5  6  7 1  8  9  10 FIGURE 1 Synergistic development of microbiome‐targeted therapies and radiotherapy techniques. 2D‐RT, two‐dimensional radiotherapy; 3D‐CRT, three‐dimensional conformal radiotherapy; FDA, U.S. Food and Drug Administration; FMT, fecal microbiota transplantation; IGRT, image‐guided radiotherapy; IMRT, intensity‐modulated radiotherapy; LBP, live biotherapeutic product; PRT, proton radiotherapy; rCDI, recurrent Clostridioides difficile Source However, despite these advances, radiation injury (RI) remains a significant clinical challenge. RI is often characterized by systemic effects such as fatigue, cachexia, and gastrointestinal symptoms like diarrhoea and rectal bleeding, which severely impact patients' quality of life.  11  12  13 Recent experimental and clinical research have demonstrated the crucial activities of intestinal microbiota and their metabolic derivatives in modulating RT outcomes. The gut microbiota comprises approximately 40 trillion microorganisms inhabiting the human digestive system, predominantly represented by five dominant phyla: Bacteroidetes, Firmicutes, Proteobacteria, Actinobacteria Fusobacteria  14  15  16  17  18  19  20  21  22  23  24 Helicobacter pylori  25 Salmonella  26 Fusobacterium nucleatum Bacteroides fragilis Escherichia coli  27  28  29 Clostridium difficile  30 B. fragilis E. coli  31 Fusobacterium  32  33  34 Lactobacillus reuteri  35  36 As a frontline treatment in cancer therapy, RT has shown significant efficacy against various tumours. However, radiation‐induced systemic toxicity and immunosuppression have highlighted important challenges. Interestingly, certain bacterial properties can mitigate these adverse effects. In essence, the microbiome and its metabolites may influence host metabolism and immunity by modulating the TME.  24  37  37 In this review, we explore the critical influence of the intestinal microbiome and its byproducts on the outcomes of RT. The discussion highlights how RT alters the composition and functionality of intestinal flora, resulting in dysbiosis that worsens radiation‐related damage. We also discuss microbiota‐targeted strategies, including probiotics, prebiotics, dietary adjustments, and FMT, emphasizing their ability to rebalance microbial communities, mitigate toxicity, and enhance therapeutic efficacy in RT. Additionally, we discuss the protective and therapeutic roles of microbial metabolites, including short‐chain fatty acids (SCFAs) and bile acids (BAs), in reducing radiation‐induced side effects and improving immune responses in RT. This review synthesizes existing knowledge to offer perspectives on utilizing microbiota‐targeted approaches as non‐invasive predictive biomarkers and adjunctive therapies in RT, with a focus on improving treatment outcomes of cancer patients. 2 RADIOTHERAPY MODULATES GUT MICROBIOTA AND THEIR METABOLITES 2.1 Radiotherapy reshapes gut microbiota RT, while effectively targeting cancer cells, profoundly affects the gut microbiota by reshaping its composition and functions (Table 1  17 2 3 TABLE 1 Alterations in gut microbiota profiles after radiotherapy. Model Radiation/Dose Biospecimen Analytical techniques Alterations in gut microbiota profiles Reference Healthy Human [131I]NaI, [99mTc]NaTcO4, [223Ra]RaCl2 Feces 16S rDNA sequencing  Firmicutes Proteobacteria Bacteroidetes Actinobacteria   38 Animal model (C57BL/6 surviving mice) 8.2–9.2 Gy of TBI Feces 16S rRNA gene sequencing  Lachnospiraceae Enterococcaceae   39 Animal model (C57BL/6 mice) 18 Gy X‐irradiation Feces 16S rDNA sequencing  Bacteroidetes Firmicutes   40 Animal model (C57BL/6 mice) 0–12 Gy of TBI Feces 16S rRNA gene sequencing   Phylaproteobacteria , Bacteroides  phylum Tenericutes  genus Roseburia   41 Animal model (C57BL/6 mice)  20 Gy X‐rays Cranial‐irradiation Feces 16S RNA gene sequencing   Muribaclum  Parabacteroides  Akkermansia Helicobacter   42 Animal model (C57BL/6 mice) 8 Gy X‐ray of TBI Colon contents 16S RNA gene sequencing   Proteobacteria  Bacteroidetes Firmicutes   43 Animal model (BALB/c mice) 0.5 Gy of low‐dose Co60 irradiation Feces 16S RNA gene sequencing  Clostridium Helicobacter Bacteroides Barnesiella   44 Animal model (Chinese rhesus macaques, Macaca mulatta 7.4 Gy cobalt‐60 gamma‐radiation Feces 16S RNA gene sequencing  Actinobacillus Bacteroides Prevotell Veillonell Acinetobacter Aerococcus   44 John Wiley & Sons, Ltd. TABLE 2 Bacterial species/metabolites and mechanisms in radiotherapy. Type of cancer Microbial species/Metabolite Related mechanism Effect on radiotherapy Reference Melanoma or neuroblastoma CpG ODNs Activates DCs and B cells via TLR9, enhances antigen presentation and T cell activity Sensitization   45 Colorectal cancer Escherichia coli (with CD gene) Converts 5‐FC into 5‐FU, increasing radiation cytotoxicity Sensitization   46 Breast cancer and melanoma Commensal fungi ( Malassezia Promotes carcinogenesis and suppresses immune response via the Dectin‐1 pathway Resistance   47 Commensal bacteria( Clostridiales Lactobacillales Burkholderiales) Supports anti‐tumour CD8 + Sensitization Colorectal cancer  Roseburia intestinalis/ Enhances radiosensitivity via induction of OR51E1‐RALB‐mediated autophagy, further facilitating tumour cell elimination Sensitization   48 Lung cancer  Bifidobacterium infantis Reduces HIF‐1α expression, enhances DSBs and tumour cell death. Sensitization   49 Colorectal cancer Butyrate  Enhances radiosensitivity through HDAC inhibition–mediated FOXO3A/p21 activation. Reduces radiosensitivity by suppressing STING‐TBK1‐IRF3. Dual role   50  51 Bladder cancer Propionate NA Sensitization   52 Abbreviations: CpG ODNs, cytosine‐phosphate‐guanine oligodeoxynucleotides; DSBs, DNA double‐strand breaks; HDAC, histone deacetylase; NA, not applicable; TLR9, Toll‐like receptor 9. John Wiley & Sons, Ltd. TABLE 3 Microbiome biomarkers and potential applications. Biomarker category Specific marker Predictive direction Related cancer types Clinical application Validation status (study type) References Bacterial Taxa  Fusobacterium nucleatum Radiation sensitivity↓ Colorectal cancer Efficacy prediction and therapeutic target Preclinical→Translational research   53  Lachnospiraceae Bifidobacterium Acute diarrhoea severity↓ Rectal cancer Toxicity risk stratification Pilot clinical study   54  Akkermansia muciniphila↑ Myelosuppression risk↓ Rectal Cancer Myeloprotection prediction Pilot clinical study   55  Romboutsia↑ Post‐RT survival time↑ NA Survival prediction Mouse model validation   56 SCFA producers ( Clostridium IV Acute/chronic RE symptoms↑ Prostate cancer Inflammation regulation assessment Multicenter prospective cohort study   57 Microbial Diversity α‐diversity index (SDI)↓ Acute radiation‐induced diarrhoea risk↑ Gynaecological/Colorectal/Anal cancers High‐risk patient screening Multicenter clinical study   58 Chao index↓ Acute/chronic RE risk↑ Prostate cancer Symptom persistence prediction Single‐center study ∖   57 Metabolites Butyrate Acute RE symptoms↑ Prostate cancer Metabolic intervention target Multicenter prospective cohort study   57 Fatty acid Chronic RE symptoms↑ Prostate cancer Long‐term toxicity management Multicenter prospective cohort study   57 Abbreviations: NA, not applicable; RE, radiation enteritis; SCFA, short‐chain fatty acids; SDI, Shannon diversity index. John Wiley & Sons, Ltd. 2.1.1 Thoracic radiotherapy Research conducted on mice has demonstrated that localized chest irradiation increases the abundance of Akkermansia Desulfovibrio Parasutterella Rikenella  59  60 Bacteroidetes Campylobacteria Firmicutes Desulfovibrionaceae  61  62 Actinobacteria Acidobacteria Bacteroidetes Tenericutes  38  63  63 E. coli Cyanobacteria Streptococcus Actinobacteria Bifidobacterium Faecalibacterium Bacteroides E. coli Streptococcus Bacteroidetes Firmicutes Firmicutes Bacteroidetes  64 2.1.2 Pelvic radiotherapy In patients receiving pelvic RT, there are increased Fusobacterium Firmicutes Faecalibacterium Bifidobacterium  65 Lactobacillus Bifidobacterium  66  67 Lachnospiraceae Enterococcaceae  39 2.1.3 Total body irradiation In total body irradiation (TBI) models, gut microbiota structure correlates with the level of radiation exposure. For instance, at 4 Gy, C. innocuum Alistipes Parasutterella Parabacteroides E. coli Lachnospiraceae NKRA136 Ruminococcaceae UCG014  41 Proteobacteria Shigella Xylophilus L. murinus  41  68 Clostridium Verrucomicrobia Bacteroidaceae  42 2.1.4 FLASH radiotherapy FLASH‐RT, utilizing exceptionally high dose rates (≥40 Gy/s), has shown remarkable advantages over conventional RT (2 Gy/min). FLASH‐RT has also been reported to increase the balance of B/F Prevotella Lactobacillus  69 In conclusion, the intestinal microbiota not only influences the local environment of the gut but also plays a pivotal part in regulating the overall response to RT. By understanding how specific microbial populations and their metabolites influence radiation treatment, we can identify strategies to manipulate the microbiota for optimized RT effectiveness, reduce toxicity and enhance recovery. This evolving research domain underscores the value of microbiota‐based approaches as supportive treatments in RT. 2.2 Radiotherapy sways microbial metabolites Gut microbiota are vital for preserving bodily equilibrium and stability, primarily through the generation of metabolites such as SCFAs, BAs and tryptophan derivatives. RT impacts these microbial metabolites by altering the intestinal microbiota structure, notably reducing the number of bacteria responsible for SCFA production, like Lachnospiraceae Roseburia Bifidobacterium  70  71  72  73  74 3 GUT MICROBIOTA AND THEIR METABOLITES AFFECT THE EFFICACY OF RADIOTHERAPY 3.1 Impact of gut microbiota composition on radiotherapy outcomes The intestinal microbiota and their metabolites are crucial in influencing RT efficacy. Emerging research highlights how the structure and function of the intestinal microbial community can greatly affect radiation response. For example, in colorectal tumours, the gut symbiotic bacterium Ruminococcus intestinalis R. intestinalis  48  75  76 Bifidobacterium, Ruminococcus, Roseburia Faecalibacterium F. nucleatum, B. fragilis, E. coli, Parvimonas micra Klebsiella Streptococcus Clostridiales, Ruminococcaceae Faecalibacterium  77  78 3.2 Microbial‐derived metabolites as modulators of radiotherapy response Microbial metabolites also serve a crucial function in determining RT outcomes. SCFAs, primarily butyrate, propionate, and acetate, are key byproducts secreted by intestinal microbiota through the breakdown of insoluble dietary fibre, resistant starch, and undigested proteins.  79  80  81  50  82  50  83  84  85  86  87  88  89  90  91  92  93 B. vulgatus  93 Beyond SCFAs and nucleosides, Zhou et al.  94  94 F. ulcerans F. gastrosuis B. animalis  95  96 2  97 +  77 Bacteroides  98 FIGURE 2 Interactions between gut microbiota, metabolites and radiotherapy in colorectal cancer: modulation of tumour microenvironment and radiotherapy sensitivity. Diagram illustrating the interactions among intestinal microbiota, microbial metabolites, and RT sensitivity in CRC. The gut symbiotic bacterium Roseburia intestinalis Bacteroides vulgatus Source 3.3 Immunomodulatory role of gut microbiota in radiotherapy‐induced immunity In recent years, the immunoregulatory functions of the intestinal microbiota in cancer therapy have drawn increasing attention.  99  100 Besides its direct cytotoxic effects on tumour cells, RT can trigger immunogenic cell death, leading to the release of tumour antigens and damage‐associated molecular patterns (DAMPs).  101  102  103  104  105  106 3 FIGURE 3 Gut microbiota‐mediated regulation of essential immune cell populations. (A) Hhep Hhep Streptococcus lutetiensis LGG F. nucleatum Source Importantly, gut microbes can affect the function of these immune cells through multiple mechanisms, thereby indirectly influencing RT effectiveness. On one hand, microbial antigens and metabolites exert effects on the host immune system to modulate immune cell differentiation and activation. For instance, Overacre‐Delgoffe et al.  107 Hhep  108 On the other hand, certain bacterial species or their metabolites can influence immune cell infiltration and function by altering cytokine networks. For example, Streptococcus anginosus  109 L. rhamnosus GG LGG  43 Notably, immune cells are not limited to acting locally within tumours but are also key players in mediating the abscopal effect induced by RT. Low‐dose radiotherapy (ILDR), particularly in the range of 1–3 Gy, can enhance CD8+ T cell activation while preventing their exhaustion by modulating host metabolism and interactions with the gut microbiota.  110  111 Further research has revealed close metabolic and immunological interactions between ILDR and the gut flora.  110  112 Christensenella minuta  110  110  113 Additionally, gut microbial metabolites like SCFAs and indole derivatives serve as important molecular mediators in microbiota‐immune interactions.  87  114 Lactobacillus  115  116 Overall, intestinal microbiota orchestrates multilayered and diverse mechanisms that modulate immune cell activation, migration, and functionality. In turn, immune cells reshape the tumour microenvironment, regulate inflammation, and influence immune infiltration, collectively determining the therapeutic outcomes of RT and the occurrence of systemic (abscopal) effects. Elucidating the complex crosstalk among the microbiome, the immune system, and RT holds promise for optimizing RT strategies, improving therapeutic sensitivity and reducing side effects. 4 GUT MICROBIOTA AND THEIR METABOLITES IN RADIATION INJURY 4.1 Radiation‐induced gut injury The intestines, as the second most radiation‐sensitive organ, are especially vulnerable during RT for abdominal or pelvic malignancies. Inevitable radiation exposure damages the small intestine, colon and rectum, with nearly half of patients undergoing pelvic or abdominal RT developing gastrointestinal mucositis.  117 4.1.1 Types and mechanisms of radiation‐induced intestinal injury Radiation‐induced intestinal injury (RIII) can be classified into two types: acute and chronic. Acute RIII is typically characterized by immediate damage to the bowel's mucosal layer, leading to symptoms such as diarrhoea, which can occur anywhere from 2 to 12 weeks after exposure. In contrast, chronic RIII can emerge months or even years after exposure, with long‐term consequences such as intestinal perforation, blockage, persistent diarrhoea, and nutrient malabsorption.  118  119 The processes underlying RII damage (RIID) involve the disruption of multiple protective barriers within the intestines: the physical, chemical, and immune barriers.  120  121  121  122  123 4.1.2 Changes in gut microbiota composition during RIII An increasing number of studies underscores the shielding function of the gut's microbial community as mitigating radiation‐induced damage, largely by promoting epithelial regeneration and supporting the repair of intestinal tissues.  124 Serratia Coprococcus Bacteroides  125 Lactobacillus, Roseburia Akkermansia  126 Fusobacterium, Enterococcus, Escherichia Pseudomonas C. sporogenes, B. pseudolongum L. acidophilus  127 4.1.3 Protective interventions targeting gut microbiota in RIII Numerous studies have demonstrated the protective potential of probiotics against RIID. In irradiated mice, administering a complex probiotic blend consisting of Lactobacillus Bifidobacterium  128  41 L. plantarum, B. longum L. paracasei  129 Bacillus Lactobacillus  130  130 E. coli‐  126 B. fragilis  131 LGG  132  43  133 LGG Lactobacillus LGG  43 In addition to probiotics, certain microorganisms and their byproducts have a substantial impact on counteracting the side effects of RT. SCFAs, such as butyrate, are particularly important for mucosal repair after RT. They help reduce intestinal inflammation, maintain barrier function, and support tissue regeneration. For instance, butyrate can alleviate gastrointestinal damage induced by dietary polysorbate 80 after RT.  134  135  136  137  138  139  139 Fagopyrum tataricum F. esculentum  140  141  39  135  142  143  71 Lachnospiraceae  97 These findings underscore the intricate and interrelated role of the intestinal microbiome and its metabolites in managing RII, highlighting the significance of manipulating the intestinal flora and its metabolic processes to enhance RT results. 4.1.4 Other modulating factors in RIII The composition of gut bacteria after irradiation is also influenced by circadian rhythms, further complicating the effects of RT. Studies have shown that mice exposed to disrupted light cycles or abnormal circadian rhythms exhibit a reduction in gut bacterial diversity, which is associated with decreased resistance to radiation. This highlights the importance of maintaining a stable circadian rhythm, as any disturbances may affect the intestinal microbiota's ability to modulate radiation sensitivity, potentially impacting therapeutic outcomes and elevating the chances of radiation‐induced damage.  144  145  146  147  148  149  150  151 RE remains a multifactorial challenge, requiring a multifaceted therapeutic approach. Understanding the function of the intestinal microbial community and harnessing its metabolites, probiotics, dietary adjustments, and natural compounds provides a promising strategy to mitigate radiation‐induced toxicity, enhance the body's resilience and improve overall therapeutic outcomes. Moreover, incorporating factors such as circadian rhythms and gender differences into future research will be crucial in developing personalized RT strategies that maximize efficacy while minimizing side effects. With continued research, there is great potential to optimize radiation treatment plans and boost the living standards for individuals with cancer who are in RT treatment. 4.2 Radiation‐induced extracolonic injuries The gut–organ axis describes how the intestinal microbiome, via its metabolites, regulates the health and functionality of various organ systems in the body.  152 4.2.1 Radiation‐induced skin damage Radiation‐induced skin damage is a frequent and debilitating side effect, particularly for patients undergoing RT for breast, lung, and colorectal cancers. These conditions often lead to severe skin dryness, irritation, and even ulceration, which drastically diminishes patients’ quality of life, causing discomfort and increasing the risk of infection at the treatment site.  153  154  155  156  157 4.2.2 Radiation‐induced brain injury Radiation‐induced brain injury (RIBI) potentially leads to cognitive impairment, memory loss and neuroinflammation, which significantly augment the life conditions for cancer patients enduring RT.  158  159 Lycium barbarum  160 Clostridium Burkholderia Lactobacillus  160 Firmicutes Bacteroidetes  161 L. reuteri  162  162  163 4.2.3 Radiation‐induced oral mucositis Radiation‐induced oral mucositis (OM) is one of the most common oral side effects of head and neck RT, occurring in 80–100% of patients treated for head and neck cancer.  164  165 Streptococci  166  167 4.2.4 Radiation‐induced lung injury Radiation‐induced lung injury (RILI) represents a significant dose‐limiting toxicity that limits dosage in chest RT, particularly in lymphoma, breast cancer and lung cancer treatment. RILI can progress to chronic pulmonary fibrosis and potentially lead to respiratory failure and even death.  168  169  59  61 Enterobacter Akkermansia  170  171 4.2.5 Radiation‐induced liver injury Radiation‐induced liver injury is a common complication following RT for hepatobiliary malignancies and liver metastases, and it can severely impact liver function and overall health.  172  95  173  174  175 Burkholderiales  176  176  177 4.2.6 Radiation‐induced hematopoietic system damage Another radiation‐induced injury is in the hematopoietic system. Bone marrow (BM) exhibits high sensitivity to ionizing radiation. Radiation‐induced hematopoietic dysfunction is mainly caused by damage to hematopoietic stem cells (HSCs) in BM. As HSCs are critical for the production of blood cells, their impairment leads to severe consequences, including anaemia, thrombocytopenia, and leukopenia. Therefore, the remodelling of the BM microenvironment is the key factor for HSC regeneration, followed by RT.  178  179 Lachnospiraceae  179  180  180  181 The gut–organ axis exemplifies the intestinal microbiota's systemic influence, revealing novel insights into mitigating RT‐induced damage across various organs. By leveraging microbiota and their metabolites, future therapies could offer personalized and multi‐targeted interventions, enhancing RT's effectiveness and working to minimize its negative repercussions. Further research into this axis promises to redefine approaches to radiation damage management, bridging the gap between gut health and systemic recovery (Figure 4 FIGURE 4 Radio‐protective effects of the gut–organ axis: modulating gut microbiota and their metabolites to mitigate radiation‐induced damage across multiple organ systems. AIMD, antibiotic‐induced‐microbiota depletion; BA metabolism balance, bile acid metabolism balance; CPT, cryptotanshinone; HSCs, hematopoietic stem cells; HSPCs, hematopoietic stem/progenitor cells; I3A, Indole‐3‐acetaldehyde; LBP, Lycium barbarum Source 5 GUT MICROBIOTA AS PREDICTIVE MARKERS FOR RADIOTHERAPY EFFICACY Predicting RT efficacy and radiation‐induced injury remains a considerable challenge because of the absence of reliable tools or effective preventive strategies. Amifostine is currently the sole drug authorized by the U.S. Food and Drug Administration (FDA) to prevent radiation toxicity.  182 5 FIGURE 5 Gut microbiota as predictive biomarkers for radiotherapy outcomes: key microbial taxa and microbiome‐derived factors linked to divergent clinical responses in patients with various cancers. ARIE, acute radiation‐induced esophagitis; B. fragilis, Bacteroides fragilis Source Specific intestinal flora has a strong correlation with RT effectiveness and patient survival across various cancer types. In cervical cancer patients, TT Sims and colleagues demonstrated that gut microbiota diversity serves as an independent indicator of survival for those undergoing chemoradiotherapy (CRT).  183  183 Firmicutes  64  184 Lactobacillaceae F. nucleatum B. fragilis  185  76 F. nucleatum B. fragilis R. gnavus Bifidobacterium bifidum Faecalibacterium prausnitzii Lactobacillus Bifidobacterium  186 Specific gut microbiome profiles are strongly linked to the severity of radiation‐induced toxicities and can act as predictive biomarkers for RI. Al‐Qadami et al.  187 Eubacterium Ruminococcus Faecalibacterium Phascolarctobacterium Adlercreutzia Eggerthella lenta  187  63 Fusobacterium Klebsiella Roseburia Veillonella Bacteroides Sutterella Roseburia Faecalibacterium  188 Bacteroides Ochrobactrum Roseburia Clostridia Faecalibacterium  189 Romboutsia  56 Erysipelatoclostridium  190  77 In conclusion, specific microbiome and microbial metabolites characteristics are associated with RT sensitivity or tolerance, supporting the development of microbiome‐based predictive markers. This evidence highlights potential directions for improving therapy and reducing adverse effects in patients undergoing RT. 6 CLINICAL APPLICATIONS AND PROSPECTS In recent years, microbiota‐based therapies such as probiotics, prebiotics, and FMT have emerged as promising strategies to reduce the negative impacts of RT and enhance its effectiveness.  191  192  193  194  195  196 Beyond FMT, probiotics have also shown considerable benefits for RT patients (Table 4  197 L. acidophilus Bifidobacterium  197 Bifidobacterium  198  199 L. plantarum L. plantarum TABLE 4 Probiotics and prebiotics in radiotherapy trials. Study Disease Observation endpoint Patients ( n Intervention Study status Results NCT03870607 Anal cancer Complete clinical and radiological response after Ch‐RT to ACSCC 75  Bifidobacterium Lactobacillus Recruiting / NCT03773003 Cancer Improvement of fatigue symptoms 150  Bifidobacterium Streptococcus thermophilus Lactobacillus Recruiting / NCT01839721 Pelvic cancer The incidence of moderate or severe symptoms of diarrhoea during the period of treatment by RT 246  Lactobacillus acidophilus LAC‐361 Bifidobacterium longum BB‐536 Completed Probiotics help reduce diarrhoea rates in patients. NCT01706393 Gynecologic cancer; rectal cancer Alterations in gut microbiota in patients with malignancies undergoing pelvic or abdominal RT 26  Lactobacillus acidophilus, Streptococcus thermophilus, Bifidobacterium lactis, Lactobacillus rhamnosus, Bifidobacterium longum, and Bifidobacterium bifidum Unknown / NCT03742596 Colorectal cancer The level of Immunoglobulin (Ig) A at both baseline and end‐line of intervention 40  Lactobacillus Bifidobacteria Withdrawn / NCT06390176 Head and neck malignant tumours The incidence of severe OM (WHO grade ≥3) 132  Lactobacillus rhamnosus Recruiting / NCT03112837 Nasopharyngeal cancer The incidence of radiation therapy oncology group grade 3 mucositis 40 Live combined Bifidobacterium, Lactobacillus Enterococcus Unknown status Probiotics lowered OM and protected T cell levels. NCT01549782 Gynaecologic cancer Changes in Lactobacillus Bifidobacterium 40 Mixture of prebiotics: inulin and fructo‐oligosaccharide Completed Restore beneficial bacteria Abbreviations: ACSCC, anal canal squamous cell carcinoma; Ch‐RT, chemoradiotherapy; OM, oral mucositis; RT, radiotherapy. John Wiley & Sons, Ltd. In addition to these clinically applied therapies, several gut microbiota‐targeted technologies are emerging, offering novel clinical prospects for precision RT and comprehensive cancer treatment. Recent advancements in nanotechnology have opened new avenues for improving RT efficacy and minimizing its side effects. For instance, nanotechnology has advanced cancer treatment by improving RT efficacy and reducing side effects.  200  201 Spirulina platensis  202 Moreover, studies are exploring the synergistic effects of combining RT with engineered bacteria to enhance immune responses and overall treatment outcomes. A study by Wang et al.  203  204 Salmonella Salmonella  205 In conclusion, strategies for manipulating the gut microbiota—such as probiotics, prebiotics, postbiotics and FMT—offer effective ways to mitigate RIID and improve cancer prognosis. 7 CONCLUSION AND FUTURE DIRECTIONS The intricate interactions between gut microbiota, their metabolites, and RT influence both therapeutic efficacy and toxicity, underscoring the systemic role of the gut–organ axis across organs like the brain, liver, lungs, skin and the hematopoietic system. Key metabolites, including SCFAs, BAs and tryptophan derivatives, exhibit radioprotective properties and support tissue regeneration, while specific microbial profiles have been linked to RT responses, patient survival and toxicity risks in various cancers. Despite these advances, significant challenges remain. Clinical evidence for microbiota‐targeted interventions is still limited, constrained by variable patient responses and the lack of standardized protocols. Moreover, the complex interplay between gut microbes and RT‐induced immune and metabolic pathways requires further exploration to bridge laboratory findings with clinical practice. Future research should focus on identifying microbiota biomarkers, such as F. nucleatum B. fragilis Standardized methodologies and large‐scale clinical trials involving diverse populations are essential to validate these interventions. Simultaneously, deeper exploration of the gut–organ axis, particularly its role in shielding distant organs from RT‐induced damage, is critical for addressing conditions like radiation‐induced brain injury, liver toxicity, and pulmonary fibrosis. Incorporating artificial intelligence and multi‐omics technologies, such as metagenomics and metabolomics, can deepen our understanding of microbiota–RT interactions and help identify novel biomarkers and therapeutic targets. Long‐term monitoring of microbiota changes before, during, and after RT can provide insights into its enduring impact on gut health and systemic recovery, guiding post‐treatment strategies. In summary, targeting gut microbiota and their metabolites represents a transformative approach to optimizing RT. By integrating microbiota research with clinical applications, we can usher in an era of personalized cancer treatment that maximizes therapeutic benefits while minimizing adverse effects. Continued multidisciplinary collaboration will be key to unlocking the full potential of this promising field. AUTHOR CONTRIBUTIONS  Shuling Ma Xinpei Li Shijie Shang Zijun Zhai Meng Wu Qian Song Dawei Chen CONFLICT OF INTEREST STATEMENT The authors declare no conflict of interest. FUNDING STATEMENT This work was funded by the National Natural Science Foundation of China (82172676, 82373217, and 82403455), the Natural Science Foundation of Shandong (ZR2024QH527), the Distinguished Young Scholars of Shandong Provincial Science Fund (ZR2024JQ032), Shandong Province International Science and Technology Cooperation Project (2025KJHZ012), the China Postdoctoral Science Foundation (2024M761869 and 2025T180617). ETHICS APPROVAL STATEMENT Not applicable. PERMISSION TO REPRODUCE MATERIAL FROM OTHER SOURCES Not applicable. ACKNOWLEDGEMENTS Not applicable. DATA AVAILABILITY STATEMENT Data sharing is not applicable to this article as no new data were created or analyzed in this study. REFERENCES 1 Siegel R Giaquinto A Jemal A Cancer statistics, 2024 CA: Cancer J Clin 2024 74 12 49 38230766 10.3322/caac.21820 2 Bray F Laversanne M Sung H Global cancer statistics 2022: gLOBOCAN estimates of incidence and mortality worldwide for 36 cancers in 185 countries CA: Cancer J Clin 2024 74 3 229 263 38572751 10.3322/caac.21834 3 Singh AK Vijay A Bhushan M Dosimetric assessment of conventional and advanced algorithms in clinical stereotactic radiotherapy Precision Radiation Oncology 2025 4 Chen Z Yan X Xie S Exploring the potential benefits of multi‐field IMPT for stage I NSCLC SBRT: An in silico dosimetric comparison to IMRT and CyberKnife Precision Radiation Oncology 2025 5 Cytlak U Dyer DP Honeychurch J Williams KJ Travis MA Illidge TM Immunomodulation by radiotherapy in tumour control and normal tissue toxicity Nat Rev Immunol 2022 22 2 124 138 34211187 10.1038/s41577-021-00568-1 6 Vozenin M Bourhis J Durante M Towards clinical translation of FLASH radiotherapy Nat Rev Clin Oncol 2022 19 12 791 803 36303024 10.1038/s41571-022-00697-z 7 Byun H Kim C Seong J Carbon ion radiotherapy in the treatment of hepatocellular carcinoma Clin Mol Hepatol 2023 29 4 945 37583055 10.3350/cmh.2023.0217 PMC10577350 8 Wu Y Song Y Wang R Wang T Molecular mechanisms of tumor resistance to radiotherapy Mol Cancer 2023 22 1 96 37322433 10.1186/s12943-023-01801-2 PMC10268375 9 Wang Z Ren X Li Y Reactive oxygen species amplifier for apoptosis‐ferroptosis mediated high‐efficiency radiosensitization of tumors ACS Nano 2024 18 14 10288 10301 38556985 10.1021/acsnano.4c01625 10 Galluzzi L Aryankalayil MJ Coleman CN Formenti SC Emerging evidence for adapting radiotherapy to immunotherapy Nat Rev Clin Oncol 2023 20 8 543 557 37280366 10.1038/s41571-023-00782-x 11 Dasgupta Q Jiang A Wen AM A human lung alveolus‐on‐a‐chip model of acute radiation‐induced lung injury Nat Commun 2023 14 1 6506 37845224 10.1038/s41467-023-42171-z PMC10579267 12 Nolan E Bridgeman VL Ombrato L Radiation exposure elicits a neutrophil‐driven response in healthy lung tissue that enhances metastatic colonization Nat Cancer 2022 3 2 173 187 35221334 10.1038/s43018-022-00336-7 PMC7612918 13 Wang K Tepper J Radiation therapy‐associated toxicity: etiology, management, and prevention CA: Cancer J Clin 2021 71 5 437 454 34255347 10.3322/caac.21689 14 Anderson N Simon M The tumor microenvironment Curr Biol 2020 30 16 R921 R925 32810447 10.1016/j.cub.2020.06.081 PMC8194051 15 White M Sears C The microbial landscape of colorectal cancer Nat Rev Microbiol 2024 22 4 240 254 37794172 10.1038/s41579-023-00973-4 16 Margolis K Cryan J Mayer E The microbiota‐gut‐brain axis: from motility to mood Gastroenterology 2021 160 5 1486 1501 33493503 10.1053/j.gastro.2020.10.066 PMC8634751 17 Moraitis I Guiu J Rubert J Gut microbiota controlling radiation‐induced enteritis and intestinal regeneration Trends Endocrinol Metab 2023 34 8 489 501 37336645 10.1016/j.tem.2023.05.006 18 Takeuchi T Nakanishi Y Ohno H Microbial metabolites and gut immunology Ann Rev Immunol 2024 42 1 153 178 38941602 10.1146/annurev-immunol-090222-102035 19 Blake S Wolf Y Boursi B Lynn DJ Role of the microbiota in response to and recovery from cancer therapy Nat Rev Immunol 2024 24 5 308 325 37932511 10.1038/s41577-023-00951-0 20 Li X Mo Y Shang S Gut Escherichia coli promotes lung cancer by increasing circulating STAMBP production Discover Oncol 2025 16 1 459 10.1007/s12672-025-02206-x PMC11968627 40180620 21 Goenka A Khan F Verma B Tumor microenvironment signaling and therapeutics in cancer progression Cancer Commun 2023 43 5 525 561 10.1002/cac2.12416 PMC10174093 37005490 22 Yang Q Wang B Zheng Q A review of gut microbiota‐derived metabolites in tumor progression and cancer therapy Adv Sci 2023 10 15 e2207366 10.1002/advs.202207366 PMC10214247 36951547 23 Yang Q Wang B Zheng Q A Review of gut microbiota‐derived metabolites in tumor progression and cancer therapy Adv Sci (Weinh) 2023 10 15 e2207366 36951547 10.1002/advs.202207366 PMC10214247 24 Jassim A Rahrmann EP Simons BD Gilbertson RJ Cancers make their own luck: theories of cancer origins Nat Rev Cancer 2023 23 10 710 724 37488363 10.1038/s41568-023-00602-5 25 Stolte M Helicobacter and gastric MALT lymphoma Gut 2002 50 3 III19 24 11953328 10.1136/gut.50.suppl_3.iii19 PMC1867678 26 Shukla R Shukla P Behari A Roles of Salmonella typhi and Salmonella paratyphi in gallbladder cancer development Asian Pacific J Cancer Prevent 2021 22 2 509 10.31557/APJCP.2021.22.2.509 PMC8190372 33639667 27 Zafar H Saier Jr M Gut Bacteroides species in health and disease Gut Microbes 2021 13 1 1848158 33535896 10.1080/19490976.2020.1848158 PMC7872030 28 Zhang X Yu D Wu D Tissue‐resident Lachnospiraceae family bacteria protect against colorectal carcinogenesis by promoting tumor immune surveillance Cell Host Microbe 2023 31 3 418 36893736 10.1016/j.chom.2023.01.013 29 Wang N Fang J Fusobacterium nucleatum, a key pathogenic factor and microbial biomarker for colorectal cancer Trends Microbiol 2023 31 2 159 172 36058786 10.1016/j.tim.2022.08.010 30 Drewes J Chen J Markham NO Human Colon Cancer‐Derived Clostridioides difficile Strains Drive Colonic Tumorigenesis in Mice Cancer Discov 2022 12 8 1873 1885 35678528 10.1158/2159-8290.CD-21-1273 PMC9357196 31 Zagato E Pozzi C Bertocchi A Endogenous murine microbiota member Faecalibaculum rodentium and its human homologue protect from intestinal tumour growth Nat Microbiol 2020 5 3 511 524 31988379 10.1038/s41564-019-0649-5 PMC7048616 32 Chen S Zhang L Li M Fusobacterium nucleatum reduces METTL3‐mediated m6A modification and contributes to colorectal cancer metastasis Nat Commun 2022 13 1 1248 35273176 10.1038/s41467-022-28913-5 PMC8913623 33 Ternes D Tsenkova M Pozdeev VI The gut microbial metabolite formate exacerbates colorectal cancer progression Nat Metab 2022 4 4 458 475 35437333 10.1038/s42255-022-00558-0 PMC9046088 34 Fu A Yao B Dong T Tumor‐resident intracellular microbiota promotes metastatic colonization in breast cancer Cell 2022 185 8 1356 35395179 10.1016/j.cell.2022.02.027 35 Bell H Rebernick RJ Goyert J Reuterin in the healthy gut microbiome suppresses colorectal cancer growth through altering redox balance Cancer Cell 2022 40 2 185 34951957 10.1016/j.ccell.2021.12.001 PMC8847337 36 Han J Tao Z Wang J Microbiota‐derived tryptophan catabolites mediate the chemopreventive effects of statins on colorectal cancer Nat Microbiol 2023 8 5 919 933 37069401 10.1038/s41564-023-01363-5 37 Belkaid Y Hand T Role of the microbiota in immunity and inflammation Cell 2014 157 1 121 141 24679531 10.1016/j.cell.2014.03.011 PMC4056765 38 Fernandes A Oliveira A Guedes C Fernandes R Soares R Barata P Ionizing radiation from radiopharmaceuticals and the human gut microbiota: an ex vivo approach Int J Mol Sci 2022 23 18 10809 36142722 10.3390/ijms231810809 PMC9506506 39 Guo H Chou W Lai Y Multi‐omics analyses of radiation survivors identify radioprotective microbes and metabolites Science 2020 370 6516 eaay9097 33122357 10.1126/science.aay9097 PMC7898465 40 Ruan J Lee C Wouters S Irradiation at ultra‐high (FLASH) dose rates reduces acute normal tissue toxicity in the mouse gastrointestinal system Int J Radiat Oncol Biol Phys 2021 111 5 1250 1261 34400268 10.1016/j.ijrobp.2021.08.004 PMC7612009 41 Zhao T Xie L Cai S Dysbiosis of gut microbiota is associated with the progression of radiation‐induced intestinal injury and is alleviated by oral compound probiotics in mouse model Front Cell Infect Microbiol 2021 11 717636 34760714 10.3389/fcimb.2021.717636 PMC8573182 42 Wang X Guo L Qin T Effects of X‐ray cranial irradiation on metabolomics and intestinal flora in mice Ecotoxicol Environ Saf 2024 270 115898 38171101 10.1016/j.ecoenv.2023.115898 43 Zhang L Xu J Xing Y  Lactobacillus rhamnosus Microbiol Res 2024 286 127821 38941923 10.1016/j.micres.2024.127821 44 Kalkeri R Walters K Van Der Pol W Changes in the gut microbiome community of nonhuman primates following radiation injury BMC Microbiol 2021 21 1 10 33781201 10.1186/s12866-021-02146-w PMC8008626 45 Patel R Ye M Carlson PM Development of an in situ cancer vaccine via combinational radiation and bacterial‐membrane‐coated nanoparticles Adv Mater 2019 31 43 1902626 10.1002/adma.201902626 PMC6810793 31523868 46 Khil M Kim JH Mullen CA Kim SH Freytag SO Radiosensitization by 5‐fluorocytosine of human colorectal carcinoma cells in culture transduced with cytosine deaminase gene Clin Cancer Res 1996 2 1 53 57 9816090 47 Shiao S Kershaw KM Limon JJ Commensal bacteria and fungi differentially regulate tumor responses to radiation therapy Cancer cell 2021 39 9 1202 34329585 10.1016/j.ccell.2021.07.002 PMC8830498 48 Dong J Wang B Xiao Y Roseburia intestinalis sensitizes colorectal cancer to radiotherapy through the butyrate/OR51E1/RALB axis Cell Reports 2024 43 3 10.1016/j.celrep.2024.113846 38412097 49 Yang J Wu Z Chen Y Pre‐treatment with Bifidobacterium infantis and its specific antibodies enhance targeted radiosensitization in a murine model for lung cancer J Cancer Res Clin Oncol 2021 147 411 422 33130941 10.1007/s00432-020-03434-0 PMC11801827 50 Park M Kwon J Shin H Butyrate enhances the efficacy of radiotherapy via FOXO3A in colorectal cancer patient‐derived organoids Int J Oncol 2020 57 6 1307 1318 33173975 10.3892/ijo.2020.5132 PMC7646587 51 Yang K Hou Y Zhang Y Suppression of local type I interferon by gut microbiota–derived butyrate impairs antitumor effects of ionizing radiation Journal of Experimental Medicine 2021 218 3 e20201915 33496784 10.1084/jem.20201915 PMC7844434 52 Then C Paillas S Wang X Hampson A Kiltie AE Radiosensitisation of bladder cancer cells via short‐chain fatty acids and/or other metabolites produced by the gut microbiota Urologic oncology: seminars and original investigations Elsevier 2020 53 Dong J Li Y Xiao H Oral microbiota affects the efficacy and prognosis of radiotherapy for colorectal cancer in mouse models Cell Reports 2021 37 4 10.1016/j.celrep.2021.109886 34706245 54 Shi W Shen L Zou W The gut microbiome is associated with therapeutic responses and toxicities of neoadjuvant chemoradiotherapy in rectal cancer patients—a pilot study Front Cell Infect Microbiol 2020 10 562463 33363048 10.3389/fcimb.2020.562463 PMC7756020 55 Yi Y Shen L Xia F The gut microbiome profile predicts the severe acute toxicities in patients with locally advanced rectal cancer undergoing neoadjuvant chemoradiation Int J Radiat Oncol Biol Phys 2021 111 3 S103 S104 56 McCurry E Assessment of intestinal microbiome features as predictive biomarkers of radiation‐induced lung injury University of British Columbia 2024 57 Reis Ferreira M Andreyev HJN Mohammed K Microbiota‐and radiotherapy‐induced gastrointestinal side‐effects (MARS) study: a large pilot study of the microbiome in acute and late‐radiation enteropathy Clin Cancer Res 2019 25 21 6487 6500 31345839 10.1158/1078-0432.CCR-19-0960 58 Wang A Ling Z Yang Z Gut microbial dysbiosis may predict diarrhea and fatigue in patients undergoing pelvic cancer radiotherapy: a pilot study PloS One 2015 10 5 e0126312 25955845 10.1371/journal.pone.0126312 PMC4425680 59 Chen Z Xiao H Dong JL Gut microbiota‐derived PGF2α fights against radiation‐induced lung toxicity through the MAPK/NF‐κB pathway Antioxidants (Basel) 2021 11 1 65 35052569 10.3390/antiox11010065 PMC8773112 60 Thandar M Yang X Zhu Y Dysbiosis of gut microbiota and metabolites is associated with radiation‐induced colorectal fibrosis and is restored by adipose‐derived mesenchymal stem cell therapy Life Sci 2024 341 122502 38350495 10.1016/j.lfs.2024.122502 61 Chen Z Xiao HW Dong JL Gut Microbiota‐Derived PGF2alpha Fights against Radiation‐Induced Lung Toxicity through the MAPK/NF‐kappaB Pathway Antioxidants (Basel) 2021 11 1 65 35052569 10.3390/antiox11010065 PMC8773112 62 Li Y Sui L Zhao H Differences in the establishment of gut microbiota and metabolome characteristics between BALB/c and C57BL/6J mice after proton irradiation Front Microbiol 2022 13 874702 35663879 10.3389/fmicb.2022.874702 PMC9157390 63 Lin M Wu Y Yang J Gut microbiota characteristics are associated with severity of acute radiation‐induced esophagitis Front Microbiol 2022 13 883650 35756007 10.3389/fmicb.2022.883650 PMC9218355 64 Qiu B Xi Y Liu F Gut microbiome is associated with the response to chemoradiotherapy in patients with non‐small cell lung cancer Int J Radiat Oncol Biol. Phys 2023 115 2 407 418 35905860 10.1016/j.ijrobp.2022.07.032 65 Eaton S Kaczmarek J Mahmood D Exploiting dietary fibre and the gut microbiota in pelvic radiotherapy patients Brit J Cancer 2022 127 12 2087 2098 36175620 10.1038/s41416-022-01980-7 PMC9727022 66 Yi Y Shen L Shi W Gut microbiome components predict response to neoadjuvant chemoradiotherapy in patients with locally advanced rectal cancer: a prospective, longitudinal study Clin Cancer Res 2021 27 5 1329 1340 33298472 10.1158/1078-0432.CCR-20-3445 67 Kumagai T Rahman F Smith A The microbiome and radiation induced‐bowel injury: evidence for potential mechanistic role in disease pathogenesis Nutrients 2018 10 10 10.3390/nu10101405 PMC6213333 30279338 68 Jameus A Dougherty J Narendrula R Acute impacts of ionizing radiation exposure on the gastrointestinal tract and gut microbiome in mice Int J Mol Sci 2024 25 6 3339 38542312 10.3390/ijms25063339 PMC10970505 69 Xu M Qiu X Chen Q Changes of gut microbiome and metabolome in the AOM/DSS mouse model of colorectal cancer with FLASH radiation Radiat Med Protect 2023 4 1 1 10 70 Mann E Lam Y Uhlig H Short‐chain fatty acids: linking diet, the microbiome and immunity Nat Rev Immunol 2024 1 19 38565643 10.1038/s41577-024-01014-8 71 Guo L Da F Gao Q Irradiation‐induced intestinal injury is associated with disorders of bile acids metabolism Int J Radiat Oncol Biol Phys 2023 115 2 490 500 35948117 10.1016/j.ijrobp.2022.08.007 72 Collins S Stine JG Bisanz JE Okafor CD Patterson AD Bile acids and the gut microbiota: metabolic interactions and impacts on disease Nat Rev Microbiol 2023 21 4 236 247 36253479 10.1038/s41579-022-00805-x 73 Fuchs C Trauner M Role of bile acids and their receptors in gastrointestinal and hepatic pathophysiology Nat Rev Gastroenterol Hepatol 2022 19 7 432 450 35165436 10.1038/s41575-021-00566-7 74 Cai J Sun L Gonzalez F Gut microbiota‐derived bile acids in intestinal immunity, inflammation, and tumorigenesis Cell Host Microbe 2022 30 3 289 300 35271802 10.1016/j.chom.2022.02.004 PMC8923532 75 Chandra R Keane FK Voncken FEM Thomas CR Contemporary radiotherapy: present and future Lancet 2021 398 10295 171 184 34166607 10.1016/S0140-6736(21)00233-6 76 Sánchez‐Alcoholado L Laborda‐Illanes A Otero A Relationships of gut microbiota composition, short‐chain fatty acids and polyamines with the pathological response to neoadjuvant radiochemotherapy in colorectal cancer patients Int J Mol Sci 2021 22 17 9549 34502456 10.3390/ijms22179549 PMC8430739 77 Li Z Zhang Y Hong W Gut microbiota modulate radiotherapy‐associated antitumor immune responses against hepatocellular carcinoma Via STING signaling Gut Microbes 2022 14 1 2119055 36093568 10.1080/19490976.2022.2119055 PMC9467592 78 Xu C Chen L Liu G Tailoring an intravenously injectable oncolytic virus for augmenting radiotherapy Cell Rep Med 2025 6 5 10.1016/j.xcrm.2025.102078 PMC12147856 40233744 79 Fusco W Lorenzo MB Cintoni M Short‐chain fatty‐acid‐producing bacteria: key components of the human gut microbiota Nutrients 2023 15 9 2211 37432351 10.3390/nu15092211 PMC10180739 80 Meldrum O Yakubov G Journey of dietary fiber along the gastrointestinal tract: role of physical interactions, mucus, and biochemical transformations Crit Rev Food Sci Nutr 2024 1 29 10.1080/10408398.2024.2390556 39141568 81 Hou H Chen D Zhang K Gut microbiota‐derived short‐chain fatty acids and colorectal cancer: ready for clinical translation? Cancer Lett 2022 526 225 235 34843863 10.1016/j.canlet.2021.11.027 82 Mirzaei R Dehkhodaie E Bouzari B Dual role of microbiota‐derived short‐chain fatty acids on host and pathogen Biomed Pharmacother 2022 145 112352 34840032 10.1016/j.biopha.2021.112352 83 Zhu X Li K Liu G Microbial metabolite butyrate promotes anti‐PD‐1 antitumor efficacy by modulating T cell receptor signaling of cytotoxic CD8 T cell Gut Microbes 2023 15 2 2249143 37635362 10.1080/19490976.2023.2249143 PMC10464552 84 He Y Fu L Li Y Gut microbial metabolites facilitate anticancer therapy efficacy by modulating cytotoxic CD8(+) T cell immunity Cell Metab 2021 33 5 988 1000 33761313 10.1016/j.cmet.2021.03.002 85 Luu M Riester Z Baldrich A Microbial short‐chain fatty acids modulate CD8(+) T cell responses and improve adoptive immunotherapy for cancer Nat Commun 2021 12 1 4077 34210970 10.1038/s41467-021-24331-1 PMC8249424 86 Kang X Lau H Yu J Modulating gut microbiome in cancer immunotherapy: harnessing microbes to enhance treatment efficacy Cell Rep Med 2024 5 4 101478 38631285 10.1016/j.xcrm.2024.101478 PMC11031381 87 Kim C Complex regulatory effects of gut microbial short‐chain fatty acids on immune tolerance and autoimmunity Cell Mol Immunol 2023 20 4 341 350 36854801 10.1038/s41423-023-00987-1 PMC10066346 88 Villemin C Six A Neville BA Lawley TD Robinson MJ Bakdash G The heightened importance of the microbiome in cancer immunotherapy Trends Immunol 2023 44 1 44 59 36464584 10.1016/j.it.2022.11.002 89 Donohoe D Holley D Collins LB A gnotobiotic mouse model demonstrates that dietary fiber protects against colorectal tumorigenesis in a microbiota‐ and butyrate‐dependent manner Cancer Discov 2014 4 12 1387 1397 25266735 10.1158/2159-8290.CD-14-0501 PMC4258155 90 Yang K Hou Y Zhang Y Suppression of local type I interferon by gut microbiota‐derived butyrate impairs antitumor effects of ionizing radiation J Exp Med 2021 218 3 e20201915 33496784 10.1084/jem.20201915 PMC7844434 91 Uribe‐Herranz M Rafail S Beghi S Gut microbiota modulate dendritic cell antigen presentation and radiotherapy‐induced antitumor immune response J Clin Invest 2020 130 1 466 479 31815742 10.1172/JCI124332 PMC6934221 92 Reyes‐Hernández O Figueroa‐González G Quintas‐Granados LI 3, 3′‐Diindolylmethane and indole‐3‐carbinol: potential therapeutic molecules for cancer chemoprevention and treatment via regulating cellular signaling pathways Cancer Cell Int 2023 23 1 180 37633886 10.1186/s12935-023-03031-4 PMC10464192 93 Teng H Wang Y Sui X Gut microbiota‐mediated nucleotide synthesis attenuates the response to neoadjuvant chemoradiotherapy in rectal cancer Cancer Cell 2023 41 1 124 138 36563680 10.1016/j.ccell.2022.11.013 94 Zhou H Wang L Lin Z Methylglyoxal from gut microbes boosts radiosensitivity and radioimmunotherapy in rectal cancer by triggering endoplasmic reticulum stress and cGAS‐STING activation J Immunother Cancer 2023 11 11 10.1136/jitc-2023-007840 PMC10689421 38035726 95 Song Q Zhang X Liu W Bifidobacterium pseudolongum‐generated acetate suppresses non‐alcoholic fatty liver disease‐associated hepatocellular carcinoma J Hepatol 2023 79 6 1352 1365 37459922 10.1016/j.jhep.2023.07.005 96 Liu L Yang J Wei Q IDDF2023‐ABS‐0240 High‐fat diet promotes radiation resistance in rectal cancer through inducing gut dysbiosis and increasing bile acid metabolites BMJ Publishing Group 2023 97 Tu Y Luo L Zhou Q Ni J Tang Q Fecal microbiota transplantation repairs radiation enteritis through modulating the gut microbiota‐mediated tryptophan metabolism Radiat Res 2024 201 6 572 585 38555945 10.1667/RADE-23-00189.1 98 Then C Paillas S Moomin A Dietary fibre supplementation enhances radiotherapy tumour control and alleviates intestinal radiation toxicity Microbiome 2024 12 1 89 38745230 10.1186/s40168-024-01804-1 PMC11092108 99 Spencer C McQuade JL Gopalakrishnan V Dietary fiber and probiotics influence the gut microbiome and melanoma immunotherapy response Science 2021 374 6575 1632 1640 34941392 10.1126/science.aaz7015 PMC8970537 100 Wang L Lynch C Pitroda SP Radiotherapy and immunology J Exp Med 2024 221 7 e20232101 38771260 10.1084/jem.20232101 PMC11110906 101 Wong K Johnson D Hui EP Lam RC Ma BB Chan AT Opportunities and challenges in combining immunotherapy and radiotherapy in head and neck cancers Cancer Treat Rev 2022 105 102361 35231870 10.1016/j.ctrv.2022.102361 102 Zhang Z Liu X Chen D Yu J Radiotherapy combined with immunotherapy: the dawn of cancer treatment Signal Transduct Target Ther 2022 7 1 258 35906199 10.1038/s41392-022-01102-y PMC9338328 103 Fang J Lu Y Zheng J Exploring the crosstalk between endothelial cells, immune cells, and immune checkpoints in the tumor microenvironment: new insights and therapeutic implications Cell Death Dis 2023 14 9 586 37666809 10.1038/s41419-023-06119-x PMC10477350 104 Seo E Lee S Son Y Multifaceted functions of tissue‐resident memory T cells in tumorigenesis and cancer immunotherapy Cancer Immunol, Immunother 2025 74 6 184 40285796 10.1007/s00262-025-04035-x PMC12033165 105 Ramanan D Pratama A Zhu Y Regulatory T cells in the face of the intestinal microbiota Nat Rev Immunol 2023 23 11 749 762 37316560 10.1038/s41577-023-00890-w 106 Kang J Zappasodi R Modulating Treg stability to improve cancer immunotherapy Trends Cancer 2023 9 11 911 927 37598003 10.1016/j.trecan.2023.07.015 107 Overacre‐Delgoffe A Bumgarner HJ Cillo AR Microbiota‐specific T follicular helper cells drive tertiary lymphoid structures and anti‐tumor immunity against colorectal cancer Immunity 2021 54 12 2812 34861182 10.1016/j.immuni.2021.11.003 PMC8865366 108 Li S Chen K Sun Z Radiation drives tertiary lymphoid structures to reshape TME for synergized antitumour immunity Expert Rev Mol Med 2024 26 e30 39438247 10.1017/erm.2024.27 PMC11505612 109 Wang H You W Zhu Z  Streptococcus lutetiensis NPJ Precis Oncol 2025 9 1 43 39924593 10.1038/s41698-025-00810-2 PMC11808082 110 Chen J Levy A Tian A Low‐dose irradiation of the gut improves the efficacy of PD‐L1 blockade in metastatic cancer patients Cancer Cell 2025 43 3 361 40068595 10.1016/j.ccell.2025.02.010 PMC11907695 111 De Visser K Joyce J The evolving tumor microenvironment: from cancer initiation to metastatic outgrowth Cancer Cell 2023 41 3 374 403 36917948 10.1016/j.ccell.2023.02.016 112 Westerterp M Gautier EL Ganda A Cholesterol accumulation in dendritic cells links the inflammasome to acquired immunity Cell Metabolism 2017 25 6 1294 28479366 10.1016/j.cmet.2017.04.005 PMC5514787 113 Déjean G Tudela H Bruno L Kissi D Rawadi G Claus SP Identifying a novel bile salt hydrolase from the keystone gut bacterium Christensenella minuta Microorganisms 2021 9 6 1252 34207623 10.3390/microorganisms9061252 PMC8228234 114 Overacre‐Delgoffe A Hand T Regulation of tissue‐resident memory T cells by the microbiota Mucosal Immunol 2022 15 3 408 417 35194180 10.1038/s41385-022-00491-1 PMC9063729 115 Bender M McPherson AC Phelps CM Dietary tryptophan metabolite released by intratumoral Lactobacillus reuteri Cell 2023 186 9 1846 37028428 10.1016/j.cell.2023.03.011 PMC10148916 116 Sharma P Goswami S Raychaudhuri D Immune checkpoint therapy—current perspectives and future directions Cell 2023 186 8 1652 1669 37059068 10.1016/j.cell.2023.03.006 117 Fernandes D Andreyev J Pelvic radiation disease and the gastrointestinal tract Intestinal failure Springer 2023 269 287 118 Tirado F Bhanja P Castro‐Nallar E Olea XD Salamanca C Saha S Radiation‐induced toxicity in rectal epithelial stem cell contributes to acute radiation injury in rectum Stem Cell Res Ther 2021 12 1 63 33451351 10.1186/s13287-020-02111-w PMC7811242 119 Lam S Peppelenbosch M Fuhler G Prediction and treatment of radiation enteropathy: can intestinal bugs lead the way? Clin Cancer Res 2019 25 21 6280 6282 31492747 10.1158/1078-0432.CCR-19-2422 120 Xin J Wang J Ding Q Potential role of gut microbiota and its metabolites in radiation‐induced intestinal damage Ecotoxicol Env Safety 2022 248 114341 36442401 10.1016/j.ecoenv.2022.114341 121 Park H Yu J X‐ray radiation‐induced intestinal barrier dysfunction in human epithelial Caco‐2 cell monolayers Ecotoxicol Env Safety 2023 264 115404 37625335 10.1016/j.ecoenv.2023.115404 122 Devarakonda S Thorsell A Hedenström P Low‐grade intestinal inflammation two decades after pelvic radiotherapy EBioMedicine 2023 94 10.1016/j.ebiom.2023.104691 PMC10393618 37480626 123 Hao W Hao C Wu C Xu Y Jin C Aluminum induced intestinal dysfunction via mechanical, immune, chemical and biological barriers Chemosphere 2022 288 132556 34648793 10.1016/j.chemosphere.2021.132556 124 Xie L Lu H Tang L probiotic consortia protect the intestine against radiation injury by improving intestinal epithelial homeostasis Int J Radiat Oncol Biol Phys 2024 120 1 189 204 38485099 10.1016/j.ijrobp.2024.03.003 125 Wang Z Wang Q Wang X Gut microbial dysbiosis is associated with development and progression of radiation enteritis during pelvic radiotherapy J Cell Mol Med 2019 23 5 3747 3756 30908851 10.1111/jcmm.14289 PMC6484301 126 Epperly M Yu J van Pijkeren J Specific taxa of the intestinal microbiome mitigate the radiation‐induced gastrointestinal syndrome Int J Radiat Oncol Biol Phys 2020 108 3 S92 127 Yi Y Lu W Shen L Wu Y Zhang Z The gut microbiota as a booster for radiotherapy: novel insights into radio‐protection and radiation injury Exp Hematol Oncol 2023 12 1 48 37218007 10.1186/s40164-023-00410-5 PMC10201781 128 Song Q Li X Li Q Bifidobacterium animalis suppresses non‐small cell lung cancer progression and modulates tumor immunity through indole‐3‐acetic acid Cell Rep 2025 44 8 116132 40802513 10.1016/j.celrep.2025.116132 129 Xie L Lu H Li M Tian Y Probiotic consortia and their metabolites protect intestine against radiation injury by improving intestinal epithelial homeostasis Int J Radiat Oncol Biol Phys 2023 117 2 e269 10.1016/j.ijrobp.2024.03.003 38485099 130 Zheng C Niu M Kong Y Oral administration of probiotic spore ghosts for efficient attenuation of radiation‐induced intestinal injury J Nanobiotechnol 2024 22 1 303 10.1186/s12951-024-02572-8 PMC11140926 38822376 131 Zhou Q Shen B Huang R Bacteroides fragilis strain ZY‐312 promotes intestinal barrier integrity via upregulating the STAT3 pathway in a radiation‐induced intestinal injury mouse model Front Nutrit 2022 9 1063699 36590229 10.3389/fnut.2022.1063699 PMC9798896 132 Zhang Y Huang R Jiang Y The role of bacteria and its derived biomaterials in cancer radiotherapy Acta Pharmaceutica Sinica B 2023 13 10 4149 4171 37799393 10.1016/j.apsb.2022.10.013 PMC10547917 133 Si W Liang H Bugno J Lactobacillus rhamnosus GG induces cGAS/STING‐dependent type I interferon and improves response to immune checkpoint blockade Gut 2022 71 3 521 533 33685966 10.1136/gutjnl-2020-323426 PMC8710942 134 Li Y Xiao H Dong J Gut microbiota metabolite fights against dietary polysorbate 80‐aggravated radiation enteritis Front Microbiol 2020 11 1450 32670255 10.3389/fmicb.2020.01450 PMC7332576 135 Eaton S Kaczmarek J Mahmood D Exploiting dietary fibre and the gut microbiota in pelvic radiotherapy patients Br J Cancer 2022 127 12 2087 2098 36175620 10.1038/s41416-022-01980-7 PMC9727022 136 Ye S Shah BR Li J A critical review on interplay between dietary fibers and gut microbiota Trends Food Sci Technol 2022 124 237 249 137 Ji K Zhang M Du L Exploring the role of inulin in targeting the gut microbiota: an innovative strategy for alleviating colonic fibrosis induced by irradiation J Agr Food Chem 2024 72 11 5710 5724 38457473 10.1021/acs.jafc.3c03432 PMC10958509 138 Then C Paillas S Wang X Hampson A Kiltie AE Association of Bacteroides acidifaciens BMC Biol 2020 18 1 16 32811478 10.1186/s12915-020-00836-x PMC7437060 139 Liu D Zhuang B Wei M Oral konjac glucomannan for prevention of ionizing radiation‐induced injury by regulating gut microbiota and increasing short chain fatty acids Int J Biol Macromol 2023 240 124402 37044326 10.1016/j.ijbiomac.2023.124402 140 Yang J Chen S Wu Y Liao Y Yen G Ameliorative effect of buckwheat polysaccharides on colitis via regulation of the gut microbiota Int J Biol Macromol 2023 227 872 883 36563806 10.1016/j.ijbiomac.2022.12.155 141 Yan J Chen D Ye Z Molecular mechanisms and therapeutic significance of Tryptophan Metabolism and signaling in cancer Mol Cancer 2024 23 1 241 39472902 10.1186/s12943-024-02164-y PMC11523861 142 Xie L Cai S Lu H Microbiota‐derived I3A protects the intestine against radiation injury by activating AhR/IL‐10/Wnt signaling and enhancing the abundance of probiotics Gut Microbes 2024 16 1 2347722 38706205 10.1080/19490976.2024.2347722 PMC11086037 143 Xiao H Cui M Li Y Gut microbiota‐derived indole 3‐propionic acid protects against radiation toxicity via retaining acyl‐CoA‐binding protein Microbiome 2020 8 1 69 32434586 10.1186/s40168-020-00845-6 PMC7241002 144 Cui M Xiao H Luo D circadian rhythm shapes the gut microbiota affecting host radiosensitivity Int J Mol Sci 2016 17 11 10.3390/ijms17111786 PMC5133787 27792172 145 Li M Gu M Lang Y The vanillin derivative VND3207 protects intestine against radiation injury by modulating p53/NOXA signaling pathway and restoring the balance of gut microbiota Free Radic Biol Med 2019 145 223 236 31580946 10.1016/j.freeradbiomed.2019.09.035 146 Duan X Cai H Hu T Ginsenoside Rg3 treats acute radiation proctitis through the TLR4/MyD88/NF‐κB pathway and regulation of intestinal flora Front Cell Infect Microbiol 2023 12 1028576 36683687 10.3389/fcimb.2022.1028576 PMC9853003 147 Cosar R Ozen A Tastekin E Does gender difference effect radiation‐induced lung toxicity? An experimental study by genetic and histopathological predictors Rad Res 2022 197 3 280 288 10.1667/RADE-21-00075.1 34735567 148 Andruska N Schlaak RA Frei A Differences in radiation‐induced heart dysfunction in male versus female rats Int J Rad Biol 2023 99 7 1096 1108 36971580 10.1080/09553002.2023.2194404 PMC10431914 149 Taliaferro L Agarwal RK Coleman CN Sex differences in radiation research Taylor & Francis 2024 10.1080/09553002.2023.2283089 PMC10922591 37991728 150 Wang Z Xiao H Dong J Sexual dimorphism in gut microbiota dictates therapeutic efficacy of intravenous immunoglobulin on radiotherapy complications J Adv Res 2023 46 123 133 35700918 10.1016/j.jare.2022.06.002 PMC10105085 151 Li Y Dong J Xiao H Caloric restriction alleviates radiation injuries in a sex‐dependent fashion FASEB J 2021 35 8 e21787 34320242 10.1096/fj.202100351RR 152 Saxami G Kerezoudi E Eliopoulos C Arapoglou D Kyriacou A The gut–organ axis within the human body: gut dysbiosis and the role of prebiotics Life 2023 13 10 2023 37895405 10.3390/life13102023 PMC10608660 153 Rzepecki A Birnbaum M Ohri N Characterizing the effects of radiation dermatitis on quality of life: a prospective survey‐based study J Am Acad Dermatol 2022 86 1 161 163 30878566 10.1016/j.jaad.2019.03.011 154 Feng Z Zhang Y Yang C Bioinspired and inflammation‐modulatory glycopeptide hydrogels for radiation‐induced chronic skin injury repair Adv Healthcare Mater 2023 12 1 2201671 10.1002/adhm.202201671 36183357 155 Trompette A Pernot J Perdijk O Gut‐derived short‐chain fatty acids modulate skin barrier integrity by promoting keratinocyte metabolism and differentiation Muc Immunol 2022 15 5 908 926 10.1038/s41385-022-00524-9 PMC9385498 35672452 156 Mahmud M Akter S Tamanna SK Impact of gut microbiome on skin health: gut‐skin axis observed through the lenses of therapeutics and skin diseases Gut Microbes 2022 14 1 2096995 35866234 10.1080/19490976.2022.2096995 PMC9311318 157 Xiao X Hu X Yao J The role of short‐chain fatty acids in inflammatory skin diseases Front Microbiol 2023 13 1083432 36817115 10.3389/fmicb.2022.1083432 PMC9932284 158 Luo N Zhu W Li X Defective autophagy of pericytes enhances radiation‐induced senescence promoting radiation brain injury Neuro‐Oncology 2024 26 12 2288 2304 39110121 10.1093/neuonc/noae153 PMC11630511 159 Loh J Mak WQ Tan LKS Microbiota–gut–brain axis and its therapeutic applications in neurodegenerative diseases Signal Transduct Target Ther 2024 9 1 37 38360862 10.1038/s41392-024-01743-1 PMC10869798 160 Hu J Wang C Li Q Lycium barbarum polysaccharide ameliorates radiation‐induced brain injury by regulating gut microbiota J Trad Chinese Med Sci 2023 10 1 42 51 161 Hu J Jiao W Tang Z Quercetin inclusion complex gels ameliorate radiation‐induced brain injury by regulating gut microbiota Biomed Pharmacother 2023 158 114142 36527844 10.1016/j.biopha.2022.114142 162 Zhang Y Hu J Song X The effects of Lactobacillus reuteri microcapsules on radiation‐induced brain injury by regulating the gut microenvironment Food Funct 2023 14 22 10041 10051 37843434 10.1039/d3fo03008c 163 Venkidesh B Shankar SR Narasimhamurthy RK Rao SBS Mumbrekar KD Radioprotective potential of probiotics against gastrointestinal and neuronal toxicity: a preclinical study Clin Transl Oncol 2023 25 11 3165 3173 37071338 10.1007/s12094-023-03184-8 PMC10514165 164 Iovoli A Turecki L Qiu ML Severe oral mucositis after intensity‐modulated radiation therapy for head and neck cancer JAMA Network Open 2023 6 10 e2337265 e2337265 37819659 10.1001/jamanetworkopen.2023.37265 PMC10568356 165 Xiao X Zhang X Wang J Proton pump inhibitors alter gut microbiota by promoting oral microbiota translocation: a prospective interventional study Gut 2024 73 7 1098 1109 38267200 10.1136/gutjnl-2023-330883 166 Al‐Qadami G Verma G Van Sebille Y Antibiotic‐induced gut microbiota depletion accelerates the recovery of radiation‐induced oral mucositis in rats Int J Rad Oncol Biol Phys 2022 113 4 845 858 10.1016/j.ijrobp.2022.03.036 35398457 167 Kunath B De Rudder C Laczny CC Letellier E Wilmes P The oral–gut microbiome axis in health and disease Nat Rev Microbiol 2024 22 1 15 10.1038/s41579-024-01075-5 39039286 168 Perdijk O Azzoni R Marsland B The microbiome: an integral player in immune homeostasis and inflammation in the respiratory tract Physiol Rev 2024 104 2 835 879 38059886 10.1152/physrev.00020.2023 169 Zhou X Xue J Zhao Q Short chain fatty acids for prevention and treatment of radiation lung injury Int J Rad Oncol Biol Phys 2024 120 2 e422 170 Li Z Shen Y Xin J Cryptotanshinone alleviates radiation‐induced lung fibrosis via modulation of gut microbiota and bile acid metabolism Phytother Res 2023 37 10 4557 4571 37427974 10.1002/ptr.7926 171 Chen Z Wang B Dong J Gut microbiota‐derived l‐histidine/imidazole propionate axis fights against the radiation‐induced cardiopulmonary injury Int J Mol Sci 2021 22 21 11436 34768867 10.3390/ijms222111436 PMC8584084 172 Tsai C Cheng JC Wang K Wang AZ Tepper JE Hepatobiliary Malignancies , in Hypofractionated and stereotactic radiation therapy: a practical guide Springer 2024 375 392 173 Song Q Zhang X The role of gut–liver axis in gut microbiome dysbiosis associated NAFLD and NAFLD‐HCC Biomedicines 2022 10 3 524 35327326 10.3390/biomedicines10030524 PMC8945287 174 Tilg H Adolph T Trauner M Gut‐liver axis: pathophysiological concepts and clinical implications Cell Met 2022 34 11 1700 1718 10.1016/j.cmet.2022.09.017 36208625 175 Yan M Man S Sun B Gut liver brain axis in diseases: the implications for therapeutic interventions Signal Transduct Target Ther 2023 8 1 443 38057297 10.1038/s41392-023-01673-4 PMC10700720 176 Miousse I Ewing LE Skinner CM Methionine dietary supplementation potentiates ionizing radiation‐induced gastrointestinal syndrome Am J Physiol‐Gastrointest Liver Physiol 2020 318 3 G439 G450 31961718 10.1152/ajpgi.00351.2019 PMC7099489 177 Wang W Cui B Nie Y Sun L Zhang F Radiation injury and gut microbiota‐based treatment Protein Cell 2024 15 2 83 97 37470727 10.1093/procel/pwad044 PMC10833463 178 Zhang Y Chen X Wang X Insights into ionizing radiation‐induced bone marrow hematopoietic stem cell injury Stem Cell Res Ther 2024 15 1 222 39039566 10.1186/s13287-024-03853-7 PMC11265359 179 Zeng X Li X Li X Fecal microbiota transplantation from young mice rejuvenates aged hematopoietic stem cells by suppressing inflammation Blood 2023 141 14 1691 1707 36638348 10.1182/blood.2022017514 PMC10646769 180 Guan D Yang Y Pang M Indole‐3‐carboxaldehyde ameliorates ionizing radiation‐induced hematopoietic injury by enhancing hematopoietic stem and progenitor cell quiescence Mol Cell Biochem 2024 479 2 313 323 37067732 10.1007/s11010-023-04732-0 181 Zhang Y Wu Y Liu X Chen X Su J Targeting the gut microbiota‐related metabolites for osteoporosis: the inextricable connection of gut‐bone axis Age Res Rev 2024 102196 10.1016/j.arr.2024.102196 38218463 182 Chen Y Jin E Day P Use of drug sensitisers to improve therapeutic index in cancer Pharmaceutics 2024 16 7 928 39065625 10.3390/pharmaceutics16070928 PMC11279903 183 Sims T El Alam MB Karpinets TV Gut microbiome diversity is an independent predictor of survival in cervical cancer patients receiving chemoradiation Commun Biol 2021 4 1 237 33619320 10.1038/s42003-021-01741-x PMC7900251 184 Sasaki T Matsumoto Y Murakami K Gut microbiome can predict chemoradiotherapy efficacy in patients with esophageal squamous cell carcinoma Esophagus 2023 20 4 691 703 37086309 10.1007/s10388-023-01004-0 185 Huo R Wang Y Hou S Wang W Zhang C Wan X Gut mucosal microbiota profiles linked to colorectal cancer recurrence World J Gastroenterol 2022 28 18 1946 1964 35664963 10.3748/wjg.v28.i18.1946 PMC9150055 186 Cheng M Jin M Yang S Effect of radiotherapy exposure on fruquintinib plus sintilimab treatment in refractory microsatellite stable metastatic colorectal cancer: a prospective observation study J Immunother Cancer 2025 13 1 e009415 39755582 10.1136/jitc-2024-009415 PMC11749590 187 Al‐Qadami G Exploring the role of the gut microbiome in toxicity and response to radiotherapy for head and neck cancer University of Adelaide, School of Biomedicine 2021 188 Iacovacci J Serafini MS Avuzzi B Intestinal microbiota composition is predictive of radiotherapy‐induced acute gastrointestinal toxicity in prostate cancer patients Ebiomedicine 2024 106 105246 39029427 10.1016/j.ebiom.2024.105246 PMC11314862 189 Bai J Barandouzi ZA Rowcliffe C Meador R Tsementzi D Bruner DW Gut microbiome and its associations with acute and chronic gastrointestinal toxicities in cancer patients with pelvic radiation therapy: a systematic review Front Oncol 2021 11 745262 34938654 10.3389/fonc.2021.745262 PMC8685326 190 Cai S Yang Y Kong Y Gut bacteria Erysipelatoclostridium and its related metabolite ptilosteroid a could predict radiation‐induced intestinal injury Front Public Health 2022 10 862598 35419331 10.3389/fpubh.2022.862598 PMC8995795 191 Ciernikova S Sevcikova A Drgona L Mego M Modulating the gut microbiota by probiotics, prebiotics, postbiotics, and fecal microbiota transplantation: an emerging trend in cancer patient care Biochimica et Biophysica Acta (BBA)‐Rev Cancer 2023 188990 10.1016/j.bbcan.2023.188990 37742728 192 Geiger M Study of the effect of faecal microbiota transfer (FMT) therapy on a preclinical radiation‐induced colorectal model Sorbonne Université 2023 193 Jian Y Yang G Zhang L Lactobacillus plantarum alleviates irradiation‐induced intestinal injury by activation of FXR‐FGF15 signaling in intestinal epithelia Journal of Cellular Physiology 2022 237 3 1845 1856 34881818 10.1002/jcp.30651 194 Goel V Radiation enteritis in patients receiving abdominal radiation therapy complications of cancer therapy: best practices in prevention and management Springer 2024 25 35 195 Giridhar P Pradhan S Dokania S Venkatesulu B Sarode R Welsh JS Microbiome and abdominopelvic radiotherapy related chronic enteritis: a microbiome‐based mechanistic role of probiotics and antibiotics Am J Clin Oncol 2024 47 5 246 252 38193365 10.1097/COC.0000000000001082 196 Wang L Li Y Zhang Y Peng L Intestinal microecological transplantation for a patient with chronic radiation enteritis: a case report World J Gastroenterol 2024 30 19 2603 2611 38817661 10.3748/wjg.v30.i19.2603 PMC11135409 197 Linn Y Thu K Win N Effect of probiotics for the prevention of acute radiation‐induced diarrhoea among cervical cancer patients: a randomized double‐blind placebo‐controlled study Probiotics Antimicrob Proteins 2019 11 638 647 29550911 10.1007/s12602-018-9408-9 198 Guo J Zhang H Lu X Xia L Viable Bifidobacterium tablets for the prevention of chemotherapy‐/radiation‐induced mucositis in patients undergoing haematopoietic stem cell transplantation Supportive Care in Cancer 2023 31 5 282 37074462 10.1007/s00520-023-07755-x 199 Ahrén I Bjurberg M Steineck G Bergmark K Jeppsson B Decreasing the adverse effects in pelvic radiation therapy: a randomized controlled trial evaluating the use of probiotics Adv Radiat Oncol 2023 8 1 101089 36483069 10.1016/j.adro.2022.101089 PMC9723296 200 Zhang Q Kuang G Li W Wang J Ren H Zhao Y Stimuli‐responsive gene delivery nanocarriers for cancer therapy Nano‐Micro Lett 2023 15 1 44 10.1007/s40820-023-01018-4 PMC9908819 36752939 201 Shi L Lv H Chen C Regulation of gut microbiome with redox responsible bacterial cellulose hydrogel for precision chemo‐radiotherapy of intestinal cancer Chem Eng J 2022 446 137340 202 Zhang D Zhong D Ouyang J Microalgae‐based oral microcarriers for gut microbiota homeostasis and intestinal protection in cancer radiotherapy Nat Commun 2022 13 1 1413 35301299 10.1038/s41467-022-28744-4 PMC8931093 203 Gurbatri C Arpaia N Danino T Engineering bacteria as interactive cancer therapies Science 2022 378 6622 858 864 36423303 10.1126/science.add9667 PMC10584033 204 Wang W Xu H Ye Q Systemic immune responses to irradiated tumours via the transport of antigens to the tumour periphery by injected flagellate bacteria Nat Biomed Eng 2022 6 1 44 53 35058589 10.1038/s41551-021-00834-6 205 Zhang Y Liu Y Li T Engineered bacteria breach tumor physical barriers to enhance radio‐immunotherapy J Control Release 2024 373 867 878 39097194 10.1016/j.jconrel.2024.07.076 ",
  "metadata": {
    "Title of this paper": "Engineered bacteria breach tumor physical barriers to enhance radio‐immunotherapy",
    "Journal it was published in:": "Clinical and Translational Medicine",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12483842/"
  }
}