{
  "title": "Paper_1170",
  "abstract": "pmc Int J Nanomedicine Int J Nanomedicine 616 intjnano ijn International Journal of Nanomedicine 1176-9114 1178-2013 Dove Press PMC12474683 PMC12474683.1 12474683 12474683 41019235 10.2147/IJN.S530819 530819 1 Review Effect Analysis of Extracellular Vesicles in the Treatment of Bronchopulmonary Dysplasia via Different Drug Delivery and Administration Routes Xu et al Xu et al http://orcid.org/0000-0002-8714-5215 Xu Wanting  1  2  3 Chen Siyu  1  2  3 Liang Ting  1  2  3 Kang Lan  1  2  3 Zheng Qinxin  1  2  3 Yang Yan  1  2  3 Guo Ling  3 Liu Jing  3 Zhang Rong  1  2  3 Dong Wenbin  1  2  3 1 Division of Neonatology, Department of Pediatrics, the Affiliated Hospital of Southwest Medical University Luzhou People’s Republic of China 2 Department of Perinatology, The Affiliated Hospital of Southwest Medical University Luzhou People’s Republic of China 3 Sichuan Clinical Research Center for Birth Defects Luzhou People’s Republic of China Correspondence: Rong Zhang, Division of Neonatology, Department of Pediatrics, the Affiliated Hospital of Southwest Medical University, Luzhou, China; Department of Perinatology, The Affiliated Hospital of Southwest Medical University, Luzhou, China; Sichuan Clinical Research Center for Birth Defects Luzhou People’s Republic of China Wenbin Dong, Division of Neonatology, Department of Pediatrics, the Affiliated Hospital of Southwest Medical University, Luzhou, China; Department of Perinatology, The Affiliated Hospital of Southwest Medical University, Luzhou, China; Sichuan Clinical Research Center for Birth Defects Luzhou People’s Republic of China 22 9 2025 2025 20 478586 11617 11645 04 4 2025 26 8 2025 22 09 2025 28 09 2025 29 09 2025 © 2025 Xu et al. 2025 Xu et al. https://creativecommons.org/licenses/by-nc/4.0/ This work is published and licensed by Dove Medical Press Limited. The full terms of this license are available at https://www.dovepress.com/terms.php http://creativecommons.org/licenses/by-nc/4.0/ https://www.dovepress.com/terms.php Abstract Extracellular vesicles (EVs) are emerging as nanoscale, cell-free therapeutics for bronchopulmonary dysplasia (BPD), a chronic lung disease in premature infants characterized by underdeveloped alveoli and abnormal blood vessel formation. This review exhibits how different EV delivery methods influence therapeutic effects in BPD. Intra-tracheal administration of EVs enables localized pulmonary delivery, which may improve treatment efficiency via reducing inflammation and promoting lung development. Intravenous delivery provides systemic anti-inflammatory effects requiring higher doses because of lung’s blood vessel barriers. Intraperitoneal administration requires higher dosages to produce comparable effects and shows lower drug accumulation in the lungs. Intragastric administration often results in poor absorption due to the digestive environment. The distribution of EVs in the body is largely dependent on delivery methods. Nebulized and tracheal administrated EVs primarily concentrate in the lungs, whereas intravenous EVs tend to distribute in the liver and spleen. Mechanistically, EVs reduce oxidative stress and cell damage by influencing important biological pathways like TGF-β1/Smad3 and PTEN/PI3K/Akt. Although previous studies in neonatal animal models demonstrated that EVs are safe and promising, clinical translation of EVs requires standardized production, optimized dosage, non-invasive administration method, and long-term safety verification. Future efforts are suggested to focus on neonate targeting, biomarker-guided clinical trials of EVs in treating BPD. Plain Language Summary Premature infants with bronchopulmonary dysplasia (BPD) experience chronic lung impairment, characterized by impaired lung development and persistent inflammation. Current therapeutic options for these infants are limited and may be associated with adverse effects. Extracellular vesicles are tiny particles released by cells, which have demonstrated potential in treating BPD in preclinical studies. This review compares different methods of delivering EVs, including intratracheal inhalation, intravenous injection, intraperitoneal injection, and oral-intragastric routes. Inhalation of EVs targets the lungs of affected infants, reducing inflammation and supporting alveolar development. Intraperitoneal delivery is less effective than intravenous injection, which requires larger doses but has anti-inflammatory effects throughout the body. Oral administration of EVs poses challenges for infants due to intestinal degradation. By transporting molecules (eg proteins, miRNAs) that guard against damaging pathways and restore lung tissue. In spite of promising preclinical results, further research is required to examine EV production, dosages, and safety before clinical use in premature infants. Future researches are suggested to focus on developing EVs for non-invasive targeted delivery, pharmacokinetic modeling specific to neonates, and biomarker-driven trials to treat BPD. Keywords extracellular vesicle bronchopulmonary dysplasia drug delivery administration routes was supported by grants from projects of Wu Jieping Medical Foundation Clinical Research (No. 320.6750.2023-24-10) and National Natural Science Foundation of China This study was supported by grants from projects of Wu Jieping Medical Foundation Clinical Research (No. 320.6750.2023-24-10) and National Natural Science Foundation of China (No. 82371710). pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement no pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes Introduction Bronchopulmonary dysplasia (BPD) is a chronic lung disease primarily affecting preterm infants, historically associated with mechanical ventilation and oxygen therapy, underlying a long process of definitions. 1–10 Supplementary Figure 1 11 12–19 Figure 1 20–23 24 25 26–29 30 31–33 34 35 36 Figure 1 Overview of major risk factors, pathophysiological mechanisms, and frequent clinical consequences of BPD. Abbreviations Mesenchymal stem cells (MSCs) indicate potentiality as a therapeutic option for infants with BPD due to their intrinsic capacity for self-renewal, high efficiency in cell generation, and ability to replace terminally differentiated cells. 37 38–40 EVs are nanoscale particles secreted by all types of cells, facilitating intercellular communication through the transfer of proteins, lipids, and RNA. They have been implicated in the pathophysiology of neonatal lung disease and are increasingly recognized as a novel mechanism of cell-to-cell signaling. 41 42 43 44 45 46 47 48–50 51–53 54 55 56 57 58 59 60 Characterizations of EVs EVs are delimited by a lipid bilayer and secreted by various types of cells, that do not self-replicate. EVs typically carry transmembrane proteins such as CD63, CD81, and CD9, structures that may be co-isolated from the cytosol. It was optional to use secreted proteins with EVs or lipid-bound soluble proteins with intracellular compartments or other endosomes, without source-specific, co-isolates contaminants. Isolation, identification and mechanism analysis of EVs for BPD therapy experienced a complicated process for decades. EVs were initially isolated from fresh plasma after removal of intact platelets via ultracentrifugation by Wolf P. in 1967, extruded on platelets storage, and identified as “platelet-dust”. 61 62 63 64 65 Table 1 41 Figure 2 Table 1 Recommendations of MISEV 2023 for EVs Characterization Characterization of EVs as MISEV 2023 recommendations Definition Particles released from cells, delimited by a lipid bilayer, and cannot replicate on their own Sources and the preparations Source of EVs: All types of cell cultured, including eukaryotic cells from multi- and unicellular organisms and prokaryotic cells. Protein composition At least one positive protein of transmembrane, cytosolic and non-EV co-isolated structures, Single vesicle analysis with at least two different techniques Particle number concentration, size; total protein, lipids, and RNA quantification, morphology, fluorescent and light scatter parameters. Topology of EV components (luminal, membrane or external) Important for understanding the biology. Notes J Extracell Vesicles Journal of Extracellular Vesicles 41 Figure 2 Timeline of EVs milestone studies. Abbreviations Therapeutic Mechanisms of EVs in BPD Willis G. suggested that extracellular vesicles may protect against hyperoxia-induced neonatal BPD by delivering miRNA, or proteins that regulate the expression of target genes. These proteins can lower inflammatory factors tumor necrosis factor alpha (TNF-α) and interleukin-6 (IL-6) secretion, lower inflammation and pulmonary fibrosis (PF), enhance alveolar development, and control macrophage planning to the anti-inflammatory M2 state. 66 67 68 69 70 Sources, Isolations, Purifications, Identifications and Pathophysiology of EVs Exos, microvesicles, and apoptotic bodies are the three primary subtypes of EVs that are typically distinguished by their size, contents, transmembrane proteins, and segregation parameter. Exos, microvesicles, and apoptotic bodies were compared in detail, with each type’s benefits highlighted ( Table 2 41 71–75 76–80 81–87 88–90 91 92 93 94 95 96–99 Table 2 Comparison Characteristics of Extracellular Vesicles Such as Exosomes, Microvesicles and Apoptotic Bodies Exosomes Micro Vesicles Apoptotic Bodies Biogenesis Endosomal system, released via multivesicular body Plasma membrane, cell surface Apoptotic cells Size 30nm to 150nm 100 nm to 1000 nm 1000 nm to 5000 nm Segmentation parameter 70,000g up to 200,000g 20,000g 16,000g Contents Protein, lipid, mRNA, miRNA, lncRNA, DNA, RNA, metabolites Protein, lipid, mRNA, miRNA Protein, lipid, nucleic acids, miRNA, other biomolecules, Transmembrane protein CD81, CD63, CD9, CD82, TSG101, Rab5, annexin and Alix, MHC Matrix metalloproteinase, Integrin selectin A Tissue factor Advantages Longer drug duration, Cross-talk between cells Ease of purification, enhanced targeting specificity, large size to load more drugs References 39,60,61 60,62 63,64 Isolation and purification of EVs is essential for clinical translations in vivo. However, the small size of Exos has led to challenges in isolation and purification. An ideal approach has all the characteristics of high yield, high specificity, high purity, low costing, as well as preservation of natural biological functions. Multiple methods have been used to isolate and purify EVs from various biological samples. Studies have indicated heterogeneity based on technologies of EVs’ concentration, purification, size distribution, proteomic content, and source composition. 100 101 102 103 104 105 106–111 Identification of EVs is difficult by their varieties of heterogeneity and diversity, which can be attributed to differences in origin, size, morphology, transmembrane protein, and medicine cargo. At present, the ideal identification technology of EVs mainly based on morphology, particle size, protein contents, lipid contents, nucleic acid, biomarkers, purity and costing the least. At present, transmission electron microscopy (TEM) combined with immunogold labeling to verify double-stranded DNA presentation in the lumen has been recognized as a novel method to verify associated biomarkers of EVs. 112 113 114 Figure 3 Figure 3 Sources, isolations, purifications, identifications and pathophysiology of EVs. Abbreviations Biogenesis, Release, and Cellular Uptake of EVs Biogenesis and uptake of EVs is complicated, as a result of different cell origins, cell microenvironment homeostasis in physiological state, as well as external stimulus conditions. 115 116 117 Figure 4 118 119 + 120 + 121 Figure 4 Biogenesis, release and cellular uptake of extracellular vesicles. Registered Clinical Trials Involving EVs for Respiratory Diseases The transition of EV-based therapies from preclinical research to clinical translation necessitates rigorous evaluation through well-designed clinical trials. To compile relevant clinical trials, a systematic search was conducted using publicly available clinical trial registries, which was registered in the National Institutes of Health (NIH) database during the previous five years. 105 122–126 Table 3 NCT06279741 Figure 5 Table 3 Registered Clinical Trials Involving EVs for Respiratory Diseases NCT Number Disease Type EV Sources Mode of Administration Age Trial Phases Study Type Distribution Countries Start Date NCT06279741 BPD UCMSC-EVs EI Child Phase I and II Interventional Italy 2023 NCT05387278 COVID-19, ARDS, RDS UCMSC-Exos IV Adult Phase I Interventional United States 2025 NCT05116761 COVID-19, Dyspnea BMSC-EVs IV Adult Phase I and II Interventional United States 2024 NCT04657458 COVID-19, ARDS, Hypoxia BMSC-EVs IV Adult Phase III Expanded access United States 2024 NCT06002841 SARS, ARDS, Pneumonia MSC-EVs IV Adult Phase I and II Interventional Brazil 2024 NCT04798716 COVID-19, Novel corona virus pneumonia, ARDS MSC-Exos IV Adult Phase I and II Interventional United States 2023 NCT04657406 COVID-19, SARS, ARDS HAF-EVs IV Adult NA Expanded access United States 2023 NCT05787288 Corona virus pneumonia MSC-EVs Inhalation Adult Early Phase I Interventional China 2023 NCT05808400 Long COVID-19 Syndrome UCMSC-Exos Inhalation Adult Early Phase I Interventional China 2023 NCT05855317 ARDS Blood Diagnostic test Adult NA Observational France 2023 NCT05947747 ARDS HEKs Inhalation Adult Phase II Interventional Israel 2023 NCT05451342 ARDS, ARF Blood, BALD Diagnostic test Adult NA Observational China 2022 NCT05476029 Sepsis complicated with ARDS Blood, ALF Diagnostic test Adult NA Observational China 2022 NCT05228899 COVID-19 HAF-EVs IV Adult Phase I and II Interventional United States 2022 NCT05354141 ARDS BMSC-EVs IV Adult Phase III Interventional United States 2022 NCT05058768 ALI Urine, blood, and ALF Diagnostic test Adult NA Observational China 2022 NCT04902183 COVID-19 Genetically engineered exosomes-CD24 Inhalation Adult Phase II Interventional Greece 2021 NCT04969172 COVID-19 T-REx™-293 cells-Exos Inhalation Adult Phase II Interventional Israel 2021 NCT05216562 SARS-CoV2 Infection MSC-Exos IV Adult Phase II and III Interventional Indonesia 2021 NCT04602104 ARDS MSC-Exos Inhalation Adult Phase I and II Interventional China 2020 NCT04602442 COVID-19, SARS-CoV-2 Pneumonia MSC-Exos Inhalation Adult Phase II Interventional Russian Federation 2020 NCT04747574 SARS-CoV-2 T-REx™-293 cells-Exos Inhalation Adult Phase I Interventional Israel 2020 NCT04276987 Corona Virus MSC-Exos Inhalation Adult Phase I Interventional China 2020 NCT04384445 Corona Virus Infection, COVID-19, SARS, ARDS HAF-EVs IV Adult Phase I and II Interventional United States 2020 NCT04389385 Corona Virus Infection, Pneumonia CSTC-Exos Inhalation Adult Phase I Interventional Turkey 2020 NCT04491240 COVID-19, SARS-CoV-2 Pneumonia MSC-Exos Inhalation Adult Phase I and II Interventional Russian Federation 2020 NCT04493242 COVID-19, ARDS BMSC-Exos IV Adult Phase II Interventional United States 2020 NCT04544215 Drug-resistant haMPC-Exos Inhalation Adult Phase I and II Interventional China 2020 Note Figure 5 The whole 28 ongoing and completed clinical trials using EVs for respiratory diseases. The number of clinical trials related to each section is exhibited inside the boxes. ( A B C D D Abbreviations Mechanisms Analysis of Different Administration Methods, Dosages and Frequencies of Extracellular Vesicles in Treating BPD Models in Vivo Animal experiments have revealed that EVs in BPD treatment is strongly influenced by administration method, dosage, and frequency. EVs used in BPD treatment are derived from various sources, including hUC-MSCs, BM-MSCs, AD-MSCs, as well as iPSCs. These EVs contain bioactive molecules such as microRNAs, proteins, and lipids that play crucial roles in modulating lung inflammation, apoptosis, and vascular remodeling. EVs can be delivered through multiple routes, including intratracheal mode (IT), intravenous mode (IV), intra-amniotic mode (IA), and intra-oral mode (IO). A detailed comparison of IT, IV, IA, and IO administration route is provided, alongside an evaluation of the molecular mechanisms modulated by EV therapy in BPD ( Figure 6 115 127 69 128 129 enos xcr4 56 50 68 I3K 130 131 67 132 133 134 Figure 6 Mechanisms analysis of different administration methods, dosages and frequencies of EVs in treating BPD. Abbreviations Numerous studies have shown that the BPD therapeutic dose of EVs in vivo was influenced by a variety of factors, including animal species, frequencies, local or systemic administration mode, and sources. Therapeutic dosage of MSCs-EVs varied 400 times in animal models with BPD. These doses ranged from 0.25×10 6 10 55 59 132 135 136 Table 4 2 137 8 8 8 138 6 67 55 139 6 132 8 8 8 56 pdpn wnt5α 140 141 10 142 143 6 128 5 51 50 58 + + + + + + 144 Table 4 Studies of Therapeutic Effects of EVs in BPD Animal Models in Vivo at Different Dosages, Frequencies, and Administration Routes EVs Name EVs Source Recipient Animal EVs Administration Route Dosage Frequency Dose Difference on Lung Mechanism of EVs Therapeutic Effects Year References MSC-EVs Bone marrow-derived MSCs Newborn C57/BL6 mice Intraperitoneal (IP) 3.4×10 9 Fourteen dose (P1-P14) Multiple injection protected alveolar growth at P21 and P56 Carries VEGF leading to improve vascular growth Protects developing lungs from hyperoxygen-induced damage to alveolar and blood vessel growth, and the development of right ventricular hypertrophy. 2018 Braun RK 128 hUCMSC-EVs Human umbilical cord MSCs Newborn Sprague Dawley rats Intratracheal (IT) 8× 10 8 8 8 Three doses (P3, P7, P10) No significant dose dependence Enhances alveolarization, decreasing in mean alveolar volume Reduced lung inflammation, improved lung architecture 2019 Porzionato A 129 MSC-MEx Mesenchymal stromal cell Newborn mice (FVB strain) Intravenous (IV) 0.5 × 10 6 6 Single dose at P18, or repeated dose P18-39 No significant dose dependence Reduces pulmonary fibrosis, enhancing lung function Late MEx intervention was just as effective at restoring pulmonary blood vessel number and ameliorating RVH as the early MEx treatment. 2020 Willis GR 56 AF-EVs Amniotic fluid Newborn Sprague Dawley rats Intratracheal (IV) 1 × 10 10 Single dose (P3, or P7) No significant dose dependence Decreased MLI, vascular density, macrophage infiltration, the expression of inflammatory cytokines such as MIP-1α, IL-1β, and MCP-1 as a preventative agent. Early administration reduced pulmonary hypertension, preserving alveolar structure, reducing vascular remodeling, and lung inflammation. 2021 Bellio MA 125 HBM-Exos Human breast milk Newborn Sprague Dawley rats Intragastric (IG) 200 μg/mL Seven doses (P1-P7) No significant dose dependence Prevents AT II apoptosis, modulating IL-17 pathway, inhibiting downstream target gene FADD Protected lung tissue, and reduced apoptosis 2022 Zhou Y 130 MEx Human bone marrow MSCs Pregnant Sprague– Dawley rats Intra-amniotic (IA) 0.25× 10 6 Single dose (E20) No significant dose dependence Preserves alveolar structure, restoring vessel density, arterial wall thickness, and right ventricular hypertrophy One-time prenatal intervention sustains improvements in alveolarization, pulmonary vasculature, RVH, and lung function at P14 2022 Abele AN 122 GMP-grade EVs Wharton’s Jelly MSCs and bone marrow-derived MSCs Newborn Sprague Dawley rats Intratracheal (IT) or Intravenous (IV) 2×10 8 8 8 Single dose (P3) No significant dose dependence Reduces inflammation and pulmonary vascular remodeling Prevented BPD-PH, Reduced lung injury and pulmonary hypertension 2022 Sharma M 119 MSC-EVs Human umbilical cord MSCs Newborn Sprague Dawley rats Intraperitoneal (IP) 5 μg (low), 10 μg (medium), 15μg (high) Single dose (P4) Ameliorating hyperoxia-induced lung injury in a dose-dependent manner Decreases WNT5a expression and the transdifferentiation of primary fetal rat AT2 cells induced by hyperoxia in vitro, improving pulmonary vascular growth Restored lung structure and function 2022 Ai D 131 hAEC-EVs Human amniotic epithelial cell MSCs Newborn C57/BL6 mice Intravenous (IV) 10 µg Single dose (P4) Only term hAEC-EVs were beneficial in the BPD mice model Term hAEC-EVs ameliorates alveolar simplification, improving secondary septal crest density, reducing airway hyper-responsiveness, mitigating pulmonary hypertension Term hAEC-EVs reduced inflammation and vascular remodeling in the lung 2022 Zhu D 132 hUCMSC-MVs Human umbilical cord MSCs Newborn Sprague Dawley rats Intratracheal (IT) 20 μg Single dose (P7) No significant dose dependence Reverses protein levels of PTEN and p-AKT, promoting AT2 cell proliferation, reducing lung inflammation Restored lung structure and function 2022 Zhou O 134 hUCMSC-EVs Human umbilical cord MSCs Newborn C57/BL6 mice Intratracheal (IT) 0.005 μg/g, approximately 1×10 6 Single dose (P9, or P10) No significant dose dependence Improves lung architecture, vessel formation, and inflammatory modulation Pulmonary alterations were mitigated. 2022 Lithopoulos MA 117 UCB-Exos Umbilical cord blood Newborn FVB/NJ mice Intraperitoneal (IP) 5× 10 5 Three doses (P4,P5 and P10) No significant dose dependence Restoring CD31 and VEGFA levels, elevating miR-185-5p, inhibiting CDK6 in pulmonary endothelium and apoptosis Improved alveolar structure, reduced collagen in hyperoxic lung injury, promoting pulmonary vascular development. 2023 Zhong XQ 41 BMSC-sEVs Bone marrow-derived MSCs Preterm lambs Intravenous (IV) 2 × 10¹¹ particles Two doses (Hour 6 and hour 78 post-delivery) No significant dose dependence Promotes alveolar and vascular development Improved lung function in preterm lambs 2024 Albertine KH 47 AMSC-Exos Adipose MSCs Newborn Sprague Dawley rats Intratracheal (IT) 15 μg Single dose (P4) No significant dose dependence Inhibits NF-κB pathway, reducing inflammation, improving alveolarization and pulmonary vascularization, facilitated proliferation, reduced apoptosis in AECIIs Alleviated hyperoxia-induced lung injury 2024 Chen C 45 ASC-EVs Plasma Newborn C57/BL6 mice Intravenous (IV) 5 mg/kg Single dose (P3, or P10) No significant dose dependence Activates inflammasome cascade; inducing pyroptosis, apoptosis, and necroptosis in alveolar macrophages cells Induced hallmark BPD features: reduces alveolarization, pulmonary vascular density, infiltrates inflammatory macrophage 2024 Starke N 135 hUCMSC-Exos Human umbilical cord MSCs Premature C57/BL6 mice Intravenous (IV) 2 × 10 10 Single dose (E10.5, or E15.5) No significant dose dependence Term-Exos enrich with Wnt5a, activating Wnt5a/ROCK1 signaling axis, promoting ROCK1 phosphorylation, upregulating RhoA expression, and inducing autophagy in AT2 cells. Term-Exos facilitated lamellar body development and alveolar maturation, enhanced alveolarization, reduced BPD incidence. 2025 Li X 133 The Biodistribution, Potential Components, Efficacy Evaluations of Extracellular Vesicles of Diverse Administration Methods in Treating BPD Models in Vivo Due to their inherent capacity for self-renewal, high efficiency in producing and replacing terminally differentiated cells, and function in pulmonary vascular regeneration, MSCs were considered as viable and promising treatment options for BPD. 145 146 147 Table 5 105 Table 5 Different Administered Routes of EVs Carrying Bioactive Cargos in Treating BPD EVs Delivery Method EVs Source Major Components/Drug Upregulation/Downregulation Mechanism Insights Biodistribution Efficacy Evaluation Safety Analysis Year References IV Plasma of BPD model miR-139-3p miR-139-3p elevated in BPD MVs; ↓ 4EBP1 miR-139-3p suppresses endothelial proliferation and angiogenesis via downregulation of 4EBP1 Systemic circulation; affecting pulmonary vasculature miR-139-3p inhibitor alleviates alveolar and vascular simplification in BPD mice No safety evaluation performed 2023 Yu L 143 IV hUC-MSC CD63+ ↑ Il10, Arg1, CX3CR1; ↓ Ccr2, TNFα, IL6, IFNγ; shifts monocyte/macrophage phenotype toward MDSC-like immunosuppressive state Interacts with lung myeloid cells, restores CD45+, promotes anti-inflammatory monocytes/macrophages Detected in lung/liver Enhance lung architecture, function, and exercise capacity; effects confirmed dose-dependently No adverse effects 2021 Willis GR 57 IV BMSCs (rats origin) miR-425 ↓PTEN → ↑PI3K/Akt → ↓apoptosis, ↓oxidative stress Promotes epithelial survival, reduces Bax, increases Bcl-2, blocks ROS-mediated apoptosis Localized in alveolar epithelial cells (RLE-6TN) Improve RAC, reduces MLI and MAD, suppresses TUNEL+ cells, rescues alveolar structure No adverse effects reported in vivo 2020 Wu Y 120 IV BMSCs (mice origin) miR-30b-3p. ↓ SAA3→ ↓ NF-κB, IκB-α, ERK, MEK, JNK, and p38MAPK phosphorylation Reduces AEC apoptosis and inflammation; promotes cell proliferation; inhibits ALI via miR-30b-3p/SAA3 axis Confirmed pulmonary targeting via PKH26 fluorescence labeling Improve lung histopathology, reduces lung W/D ratio, neutrophil count, and MPO activity No safety evaluation performed 2020 Yi X 144 IV WJMSCs, BMSC, or HDF CD9, CD63, FLOT1+ ↓ M1 phenotype, ↑ M2 macrophages Reprograms macrophage response, reduces fibrosis, vascular remodeling, inflammation No adverse biodistribution; localized lung improvement Decrease in fibrosis and pulmonary vascular remodeling, and amelioration of pulmonary hypertension Safe; no toxicity or off-target effects reported; 2018 Willis GR 145 IT hUC-MSCs (clinical GMP-grade) CD9, CD63, CD81 ↓Tgfβ1, Nrf2, αSMA, Col1a1, 8-oxo-dG; ↑Sftpc, Sod2 EVs reduces ROS production, restoring ATII cell function, maintaining epithelial identity Detected in lung since 3 hrs post injection Improve survival, alveolar morphology, surfactant production, GAGs, and macrophage phenotypes No safety evaluation performed 2024 Bisaccia P 116 IT BMSCs (mice origin) miR-34c-5p ↓ OTUD3,↑ubiquitination →↓ PTEN stability Suppresses OTUD3/PTEN axis, promoting angiogenesis, proliferation, and reducing inflammation EVs confirmed internalized by lung Reverse hyperoxia-induced damage in lung tissue and vascular No safety evaluation performed 2023 He X 43 IT ADMSCs (mice origin) miR-21-5p ↑ miR-21-5p → ↓ SKP2 → ↓ ubiquitination of Nr2f2 → ↑ Nr2f2 → ↑ C/EBPα transcription → ↓ apoptosis, oxidative stress, inflammation Alleviates inflammation, apoptosis, oxidative stress via SKP2/Nr2f2/C/EBPα axis Fluorescent EV tracking confirmed uptake in lung Significant reduction in TNF-α, IL-6, MDA; enhanced SOD and miR-21-5p levels in lung tissues High-dose EVs safe; no adverse outcomes reported in vivo 2022 Wu Y 58 IT hUC-MSCs CD9, CD63, CD81+, annexin V (internal) ↑ CD163 + + Ameliorates alveolar simplification, reduces fibrosis, promotes M2 polarization Confirmed uptake; histological changes localized in lung Significant reduction in MLI, fibrosis, and vessel wall thickness; increase in alveolar count and Ki67+ cells No toxicity or weight loss; safe in neonatal administration 2021 Porzionato A 118 IT hUC-MSCs CD63+, Alix+ ↓ PTEN and cleaved caspase-3; ↑ p-Akt and VEGF-A Protects TIIAECs and PVECs, enhances proliferation (Ki-67), suppresses apoptosis (TUNEL) Confirmed lung uptake, retention for ≥72 h Ameliorates pulmonary hypertension, fibrosis, apoptosis, and promotes angiogenesis No safety evaluation performed 2020 You J 121 IP Cord blood derived monocytes or tracheal aspirates miR-23a-3p ↑ miR-23a-3p in hyperoxic macrophage-derived EVs; leads to PTEN downregulation miR-23a-3p targets PTEN, reducing EPC maintenance and angiogenesis Localized lung uptaking AntagomiR-23a-3p restores c-Kit+ EPCs, increases capillary density, reduces alveolar simplification No safety evaluation performed 2024 Wang X 59 IP HBM circDNAJB6 (hsa_circ_0083171) ↑ transcription of host gene DNAJB6 Nuclear circDNAJB6 activates DNAJB6 transcription; enhances ATII cell viability and reduces injury Delivered to lung, confirmed via Ki67-labeling and imaging Promotes alveolar epithelial proliferation and function, mitigates alveolar simplification in BPD No safety evaluation performed 2024 Li Y 148 IP HBM (preterm colostrum origin) miR-330-3p circABPD1 targeted ↓ miR-330-3p, ↑HIF1α circABPD1 functions as a ceRNA, sequestering miR-330-3p and preventing its repression of HIF1α. Functional delivery to lung Improved A549 cells viability, reduced ROS, increased GSH, SOD, SPC expression No safety evaluation performed 2023 Li H 149 IP BMSCs (human origin) Exosomes + Tempol (antioxidant) ↑ HIF-1α, VEGF, p-PI3K, p-Akt; ↓ IL-1β, IL-6, IL-17, IFN-γ Improves alveolarization, vascular remodeling, and reduces oxidative stress MSC-EXO was shown to reach lung Reverses inflammation, enhances angiogenesis, and restores lung structure and function No toxic effects observed 2022 Wang J 126 IP Early gestational hUC-MSCs (25 and 30 wks) TSG-6 ↓ IL-1β, TNF-α, IL-6 Systemic immunomodulation across lung, heart, brain; TSG-6 knockdown abrogates benefits Detected in lung, heart, brain Effective multi-organ protection; corrects lung/heart/brain histopathology Safe for neonatal mice; no toxicity observed 2018 Chaubey S 150 IP UCB from very preterm delivery of BPD miR-183, miR-328, and miR-27a, ↓ Fgf9 and Cacna2d3, ↓MAPK and PPAR pathways, ↓VEGFA and CD31 Exacerbated alveolar simplification, increased fibrosis, and impaired angiogenesis. No direct imaging data Increased histopathology score, collagen deposition, apoptosis, and impaired angiogenesis. BPD-EXO induced chronic and irreversible lung injury. 2023 Zhong XQ 151 Intratracheal Administration IT administration has been used as a widely used administrative route for EVs treatment in BPD. Previous study indicated that IT-administrated mice had the highest fluorescent signal in lung after 24h compared with in the liver and spleen, which was observed by IVIS analyses system. 152 127 53 69 129 131 Intravenous Administration IV administration remains the most widely used route for EVs in treating BPD in vivo. Through this pathway, EVs can enter the circulatory system directly, allowing for precise control over their dosage and concentration in the blood. EVs primarily build up in organs like the liver, spleen, lungs, and kidneys after IV. 153 154 155 148 Arg1, Il-10 CX3CR1 68 130 149 150 151 156 157 158 159 160 161 Intraperitoneal Administration By utilizing the vast abdominal vasculature, IP avoids the gastrointestinal tract’s first-pass metabolism and offers a large absorption area. This administration route has been the focus of a set of researches because it can also handle higher drug volumes. 162 163 miR-23A-3p 70 164 135 165 166 167 168 Intragastric Administration The preferred method of treating BPD is still IG administration because it is affordable, simple to use, and allowing for repeated dosing. Numerous studies have shown that in simulated gastric environments, natural M-EVs lose about 85% of their protein content and face major obstacles from the mucus-epithelial barrier. 169 169 170 171 172 139 Future Directions EVs have shown promise as nanoscale, cell-free treatments for BPD, that affects preterm infants and is characterized by vascular dysgenesis, persistent inflammation, and arrested alveolarization. 57 173 174 175 I3 176 NCT04313647 NCT05624203 177 178 Safe dosage of EVs in the treatment of animal models with BPD is affected by many factors, such as the source of EVs, animal species, and administration routes. EV-based preclinical studies suggest that different dosages need to be considered in both animal and cell models of BPD, and the ideal therapeutic dosage is still under exploring. 179 9 180 12 181 12 181 161 182 136 9 183 184 185 186 187 Additionally, we are still in the exploratory phase of the technology, considerably more needs to be learned about the biogenesis, uptake, administration, and mechanism of EVs in treating BPD, considering their heterogeneity. The variability of EVs yield, purity and cargo is due to the variation of cell sources, culture conditions including serum-free or serum-rich media, and isolation methods such as ultracentrifugation or size-exclusion chromatography. 188 189 190 191 192 193 194 195 196 197 8 9 121 198 199 Figure 7 Figure 7 Roadmap for clinical translation of EVs in treating BPD. Abbreviation Conclusions EVs have emerged as a potential tool for treating BPD. With their ability to transport bioactive cargos, for example, miRNAs, and proteins, EVs mitigate oxidative stress, inflammation injury, and promote pulmonary alveolarization. Intra-tracheal administration targets directly to lungs, while intravenous delivery offers systematic advantages, in spite of higher dosage requirements. Future researches are aimed to develop inhalable lyophilized EVs to address the practical and ethical limitations of invasive routes. Despite prospective preclinical outcomes, clinical translation primarily depends on resolving EVs heterogeneity, optimizing delivery methods, as well as validating safety dose in neonates. Future researches are suggested to prioritize GMP-compliant production, non-invasive delivery strategies, and clinical trials based on biomarkers to completely realize the therapeutic potential of EVs. Data Sharing Statement All the original data presented in this research are illustrated in the manuscript and supplementary materials. Further inquiries can be contacted directly to the corresponding author named Wenbin Dong. Author Contributions All authors made a significant contribution to the work reported, whether that is in the conception, study design, execution, acquisition of data, analysis and interpretation, or in all these areas; took part in drafting, revising or critically reviewing the article; gave final approval of the version to be published; have agreed on the journal to which the article has been submitted; and agree to be accountable for all aspects of the work. Disclosure All authors in this research do not have any commercial or related interest in the work submitted. References 1. Northway WH Rosan RC Porter DY Pulmonary disease following respirator therapy of hyaline-membrane disease. Bronchopulmonary dysplasia N Engl J Med 1967 276 7 357 368 10.1056/NEJM196702162760701 5334613 2. Tooley WH Epidemiology of bronchopulmonary dysplasia J Pediatr 1979 95 5 Pt 2 851 858 10.1016/s0022-3476(79)80451-5 385819 3. Shennan AT Dunn MS Ohlsson A Abnormal pulmonary outcomes in premature infants: prediction from oxygen requirement in the neonatal period Pediatrics 1988 82 4 527 532 10.1542/peds.82.4.527 3174313 4. Jobe AH Bancalari E Bronchopulmonary dysplasia Am J Respir Crit Care Med 2001 163 7 1723 1729 10.1164/ajrccm.163.7.2011060 11401896 5. Quine D Wong CM Boyle EM Non-invasive measurement of reduced ventilation: perfusion ratio and shunt in infants with bronchopulmonary dysplasia: a physiological definition of the disease Arch Dis Child Fetal Neonatal Ed 2006 91 6 F409 414 10.1136/adc.2006.095406 16798787 PMC2672753 6. Stoll BJ Hansen NI Bell EF Neonatal outcomes of extremely preterm infants from the NICHD neonatal research network Pediatrics 2010 126 3 443 456 10.1542/peds.2009-2959 20732945 PMC2982806 7. Poindexter BB Feng R Schmidt B Comparisons and limitations of current definitions of bronchopulmonary dysplasia for the prematurity and respiratory outcomes program Ann Am Thorac Soc 2015 12 12 1822 1830 10.1513/AnnalsATS.201504-218OC 26397992 PMC4722827 8. Isayama T Lee SK Yang J Revisiting the definition of bronchopulmonary dysplasia: effect of changing panoply of respiratory support for preterm neonates JAMA Pediatr 2017 171 3 271 279 10.1001/jamapediatrics.2016.4141 28114678 9. Chen Y Chen Q Zhu Q Small molecular theranostic assemblies functionalized by doxorubicin-hyaluronic acid-methotrexate prodrug for multiple tumor targeting and imaging-guided combined chemo-photothermal therapy Mol Pharm 2019 16 6 2470 2480 10.1021/acs.molpharmaceut.9b00072 30995065 10. Allen J Panitch H Bronchopulmonary dysplasia-A historical perspective Pediatr Pulmonol 2021 56 11 3478 3489 10.1002/ppul.25341 33638603 11. Moreira AG Arora T Arya S Leveraging transcriptomics to develop bronchopulmonary dysplasia endotypes: a concept paper Respir Res 2023 24 1 284 10.1186/s12931-023-02596-y 37968635 PMC10648631 12. Hwang JK Kim DH Na JY Two-stage learning-based prediction of bronchopulmonary dysplasia in very low birth weight infants: a nationwide cohort study Front Pediatr 2023 11 1155921 10.3389/fped.2023.1155921 37384307 PMC10294267 13. Duijts L van Meel ER Moschino L European respiratory society guideline on long-term management of children with bronchopulmonary dysplasia Eur Respir J 2020 55 1 1900788 10.1183/13993003.00788-2019 31558663 14. Collaco JM Eldredge LC McGrath-Morrow SA Long-term pulmonary outcomes in BPD throughout the life-course J Perinatol 2024 10.1038/s41372-024-01957-9 38570594 15. Zhang Y Ren X Zhang L Hydrogen gas inhalation ameliorates LPS-induced BPD by inhibiting inflammation via regulating the TLR4-NFkappaB-IL6/NLRP3 signaling pathway in the placenta Eur J Med Res 2024 29 1 285 10.1186/s40001-024-01874-9 38745325 PMC11092067 16. Li Z Mu X Lv X Patent ductus arteriosus and the association between lung ultrasound score and bronchopulmonary dysplasia: a secondary analysis of a prospective study Eur J Pediatr 2024 183 10 4309 4317 10.1007/s00431-024-05702-4 39073470 17. Wu TJ Jing X Teng M Role of myeloperoxidase, oxidative stress, and inflammation in bronchopulmonary dysplasia Antioxidants 2024 13 8 889 10.3390/antiox13080889 39199135 PMC11351552 18. Rumph JT Stephens VR Ameli S A paternal fish oil diet preconception reduces lung inflammation in a toxicant-driven murine model of new bronchopulmonary dysplasia Mar Drugs 2023 21 3 161 10.3390/md21030161 36976210 PMC10052688 19. Huang LY Lin TI Lin CH Comprehensive analysis of risk factors for bronchopulmonary dysplasia in preterm infants in Taiwan: a four-year study Children 2023 10 11 1822 10.3390/children10111822 38002913 PMC10670039 20. Gao J Um-Bergstrom P Pourbazargan M Large airway T cells in adults with former bronchopulmonary dysplasia Respir Res 2024 25 1 86 10.1186/s12931-024-02717-1 38336805 PMC10858477 21. Ding KL Smith C Seedorf G Nintedanib preserves lung growth and prevents pulmonary hypertension in a hyperoxia-induced lung injury model Pediatr Res 2024 97 5 1676 1683 10.1038/s41390-024-03562-0 39394424 PMC12119323 22. Darabi A Faramarzi R Boskabadi H Dataset on neonatal and maternal factors influencing neurodevelopmental outcomes in preterm infants: a study focused on the healthcare context of Mashhad, Iran Data Brief 2024 53 110058 10.1016/j.dib.2024.110058 38317732 PMC10838679 23. Bonadies L Cavicchiolo ME Priante E Prematurity and BPD: what general pediatricians should know Eur J Pediatr 2023 182 4 1505 1516 10.1007/s00431-022-04797-x 36763190 PMC10167192 24. Wang J Yang G Cai Z Point prevalence, characteristics and treatment variations for preterm infants with bronchopulmonary dysplasia in China: a ‘snapshot’ study BMJ Paediatr Open 2024 8 1 e002878 10.1136/bmjpo-2024-002878 PMC11481134 39366748 25. Enzer KG Baker CD Wisniewski BL Bronchopulmonary dysplasia Clin Chest Med 2024 45 3 639 650 10.1016/j.ccm.2024.03.007 39069327 26. Kuitunen I Rasanen K Less invasive surfactant administration compared to intubation, surfactant, rapid extubation method in preterm neonates: an umbrella review Neonatology 2024 121 4 485 493 10.1159/000537903 38503270 PMC11318579 27. van de Loo M van Kaam A Offringa M Corticosteroids for the prevention and treatment of bronchopulmonary dysplasia: an overview of systematic reviews Cochrane Database Syst Rev 2024 4 4 CD013271 10.1002/14651858.CD013271.pub2 38597338 PMC11005325 28. Cuevas Guaman M Hagan J Sabic D Volume-guarantee vs. pressure-limited ventilation in evolving bronchopulmonary dysplasia Front Pediatr 2022 10 952376 10.3389/fped.2022.952376 36619499 PMC9816376 29. Nissel J Xu J Wu L Why wearing a yellow hat is impossible: chinese and U.S. children’s possibility judgments Cognition 2024 251 105856 105856 10.1016/j.cognition.2024.105856 39053347 30. Teng M Wu TJ Jing X Temporal Dynamics of oxidative stress and inflammation in bronchopulmonary dysplasia Int J Mol Sci 2024 25 18 10145 10.3390/ijms251810145 39337630 PMC11431892 31. Durlak W Thebaud B BPD: latest strategies of prevention and treatment Neonatology 2024 121 5 596 607 10.1159/000540002 39053447 32. He Y Zhang M Tang J A retrospective cohort study on mortality, morbidity, and care practices for 1750 very low birth weight infants, 2016-2021 Chin Med J 2024 137 20 2452 2460 10.1097/CM9.0000000000002923 38404117 PMC11479399 33. Al Mandhari H Khan A Al Saadi A Prevalence, severity patterns and risk factors of bronchopulmonary dysplasia in preterm infants younger than 32 weeks of gestation in a tertiary centre in Oman Sultan Qaboos Univ Med J 2024 24 2 259 267 10.18295/squmj.3.2024.017 38828256 PMC11139367 34. Perveen S Chen CM Sobajima H Editorial: bronchopulmonary dysplasia: latest advances Front Pediatr 2023 11 1303761 10.3389/fped.2023.1303761 38027276 PMC10679731 35. Lai KC Lorch SA Healthcare costs of major morbidities associated with prematurity in US children’s hospitals J Pediatr 2023 256 53 62e54 10.1016/j.jpeds.2022.11.038 36509157 36. Dini G Ceccarelli S Celi F Strategies for the prevention of bronchopulmonary dysplasia Front Pediatr 2024 12 1439265 10.3389/fped.2024.1439265 39114855 PMC11303306 37. Zhang S Mulder C Riddle S Mesenchymal stromal/stem cells and bronchopulmonary dysplasia Front Cell Dev Biol 2023 11 1247339 10.3389/fcell.2023.1247339 37965579 PMC10642488 38. Pan W Gu L Yang H Repeat-dose toxicity study of human umbilical cord mesenchymal stem cells in cynomolgus monkeys by intravenous and subcutaneous injection Front Cell Dev Biol 2023 11 1273723 10.3389/fcell.2023.1273723 38020919 PMC10630163 39. Akabane M Imaoka Y Kawashima J Innovative strategies for liver transplantation: the role of mesenchymal stem cells and their cell-free derivatives Cells 2024 13 19 1604 10.3390/cells13191604 39404368 PMC11475694 40. Ma CY Zhai Y Li CT Translating mesenchymal stem cell and their exosome research into GMP compliant advanced therapy products: promises, problems and prospects Med Res Rev 2024 44 3 919 938 10.1002/med.22002 38095832 41. Welsh JA Goberdhan DCI O’Driscoll L Minimal information for studies of extracellular vesicles (MISEV2023): from basic to advanced approaches J Extracell Vesicles 2024 13 2 e12404 10.1002/jev2.12404 38326288 PMC10850029 42. Schiller EA Cohen K Lin X Extracellular vesicle-microRNAs as diagnostic biomarkers in preterm neonates Int J Mol Sci 2023 24 3 2622 10.3390/ijms24032622 36768944 PMC9916767 43. Zhuang H Song X Li J EMAP-II from macrophage-derived extracellular vesicles drives neutrophil extracellular traps formation via PI3K/AKT/mtROS in lung ischemia/reperfusion injury Redox Biol 2025 85 103750 10.1016/j.redox.2025.103750 40616949 PMC12271427 44. Deng W Zhu X Li H Lung tissue extracellular vesicles-mediated delivery of miR-128-3p as a novel mechanism of acute lung inflammation Int J Nanomed 2025 20 4831 4848 10.2147/IJN.S510241 PMC12009125 40255671 45. Ruan T Han J Xue C Mesenchymal stem cells protect the integrity of the alveolar epithelial barrier through extracellular vesicles by inhibiting MAPK-mediated necroptosis Stem Cell Res Ther 2025 16 1 250 10.1186/s13287-025-04388-1 40390004 PMC12090679 46. Hou L Zhu Z Jiang F Human umbilical cord mesenchymal stem cell-derived extracellular vesicles alleviated silica induced lung inflammation and fibrosis in mice via circPWWP2A/miR-223-3p/NLRP3 axis Ecotoxicol Environ Saf 2023 251 114537 10.1016/j.ecoenv.2023.114537 36646008 47. Schaubmayr W Hochreiter B Hunyadi-Gulyas E The proteome of extracellular vesicles released from pulmonary microvascular endothelium reveals impact of oxygen conditions on biotrauma Int J Mol Sci 2024 25 4 2415 10.3390/ijms25042415 38397093 PMC10889365 48. Bonadies L De Vos B Muraca M Extracellular Vesicles: a new promise for the prevention of bronchopulmonary dysplasia Am J Perinatol 2022 39 S 01 S23 S25 10.1055/s-0042-1757351 36356588 49. Zayek AJ Shivanna B Promises and challenges of stem cell cargo therapy for bronchopulmonary dysplasia Pediatr Res 2024 97 2 471 472 10.1038/s41390-024-03631-4 39390100 50. Albertine KH Rebentisch A Dawson E Mesenchymal stromal cell extracellular vesicles improve lung development in mechanically ventilated preterm lambs Am J Physiol Lung Cell Mol Physiol 2024 326 6 L770 L785 10.1152/ajplung.00349.2023 38563994 PMC11380989 51. Zhong XQ Wang D Chen S Umbilical cord blood-derived exosomes from healthy term pregnancies protect against hyperoxia-induced lung injury in mice Clin Transl Sci 2023 16 6 966 977 10.1111/cts.13502 36869608 PMC10264931 52. Tung S Delavogia E Fernandez-Gonzalez A Harnessing the therapeutic potential of the stem cell secretome in neonatal diseases Semin Perinatol 2023 47 3 151730 10.1016/j.semperi.2023.151730 36990921 PMC10133192 53. He X Kuang J Wang Y Bone marrow stromal cell-secreted extracellular vesicles containing miR-34c-5p alleviate lung injury and inflammation in bronchopulmonary dysplasia through promotion of PTEN degradation by targeting OTUD3 Immunol Invest 2023 52 6 681 702 10.1080/08820139.2023.2217854 37310728 54. Luo L Li Y Long Z Exploring research trends and hotspots on oxidative stress and bronchopulmonary dysplasia: insights from bibliometric and visualized study Pediatr Pulmonol 2024 59 12 3610 3623 10.1002/ppul.27268 39264135 55. Bellio MA Young KC Milberg J Amniotic fluid-derived extracellular vesicles: characterization and therapeutic efficacy in an experimental model of bronchopulmonary dysplasia Cytotherapy 2021 23 12 1097 1107 10.1016/j.jcyt.2021.07.011 34538718 56. Sharma M Bellio MA Benny M Mesenchymal stem cell-derived extracellular vesicles prevent experimental bronchopulmonary dysplasia complicated by pulmonary hypertension Stem Cells Transl Med 2022 11 8 828 840 10.1093/stcltm/szac041 35758326 PMC9397655 57. Sun Y Chen C Liu Y Adipose stem cells derived exosomes alleviate bronchopulmonary dysplasia and regulate autophagy in neonatal rats Curr Stem Cell Res Ther 2024 19 6 919 932 10.2174/011574888X260261230928094309 37817518 58. Chen C Jin Y Jin H Adipose mesenchymal stem cells-derived exosomes attenuated hyperoxia-induced lung injury in neonatal rats via inhibiting the NF-kappaB signaling pathway Pediatr Pulmonol 2024 59 10 2523 2534 10.1002/ppul.27057 38771197 59. Goryunov K Ivanov M Kulikov A A review of the use of extracellular vesicles in the treatment of neonatal diseases: current state and problems with translation to the clinic Int J Mol Sci 2024 25 5 2879 10.3390/ijms25052879 38474125 PMC10932115 60. Gupta V Singh S Singh TG Pervasive expostulation of p53 gene promoting the precipitation of neurogenic convulsions: a journey in therapeutic advancements Eur J Pharmacol 2024 983 176990 10.1016/j.ejphar.2024.176990 39251181 61. Wolf P The nature and significance of platelet products in human plasma Br J Haematol 1967 13 3 269 288 10.1111/j.1365-2141.1967.tb08741.x 6025241 62. Trams EG Lauter CJ Salem N Exfoliation of membrane ecto-enzymes in the form of micro-vesicles Biochim Biophys Acta 1981 645 1 63 70 10.1016/0005-2736(81)90512-5 6266476 63. Lambertsen RH Interdigitative coupling of presumptive hematopoietic stem cells to macrophages in endocloned marrow colonies Blood 1984 63 5 1225 1229 10.1182/blood.V63.5.1225.1225 6713097 64. Johnstone RM Mathew A Mason AB Exosome formation during maturation of mammalian and avian reticulocytes: evidence that exosome release is a major route for externalization of obsolete membrane proteins J Cell Physiol 1991 147 1 27 36 10.1002/jcp.1041470105 2037622 65. Sokolova V Ludwig AK Hornung S Characterisation of exosomes derived from human cells by nanoparticle tracking analysis and scanning electron microscopy Colloids Surf B Biointerfaces 2011 87 1 146 150 10.1016/j.colsurfb.2011.05.013 21640565 66. Willis GR Kourembanas S Mitsialis SA Therapeutic applications of extracellular vesicles: perspectives from newborn medicine Methods Mol Biol 2017 1660 409 432 10.1007/978-1-4939-7253-1_34 28828676 67. Willis GR Fernandez-Gonzalez A Reis M Mesenchymal stromal cell-derived small extracellular vesicles restore lung architecture and improve exercise capacity in a model of neonatal hyperoxia-induced lung injury J Extracell Vesicles 2020 9 1 1790874 10.1080/20013078.2020.1790874 32939235 PMC7480622 68. Willis GR Reis M Gheinani AH Extracellular vesicles protect the neonatal lung from hyperoxic injury through the epigenetic and transcriptomic reprogramming of myeloid cells Am J Respir Crit Care Med 2021 204 12 1418 1432 10.1164/rccm.202102-0329OC 34699335 PMC8865710 69. Wu Y Zhang Z Li J Mechanism of adipose-derived mesenchymal stem cell-derived extracellular vesicles carrying miR-21-5p in hyperoxia-induced lung injury Stem Cell Rev Rep 2022 18 3 1007 1024 10.1007/s12015-021-10311-x 34882302 70. Wang X Yao F Yang L Macrophage extracellular vesicle-packaged miR-23a-3p impairs maintenance and angiogenic capacity of human endothelial progenitor cells in neonatal hyperoxia-induced lung injury Stem Cell Res Ther 2024 15 1 295 10.1186/s13287-024-03920-z 39256862 PMC11389047 71. Sani F Shafiei F Dehghani F Unveiling exosomes: cutting-edge isolation techniques and their therapeutic potential J Cell Mol Med 2024 28 20 e70139 10.1111/jcmm.70139 39431552 PMC11492151 72. Chavda VP Luo G Bezbaruah R Unveiling the promise: exosomes as game-changers in anti-infective therapy Exploration 2024 4 5 20230139 10.1002/EXP.20230139 39439498 PMC11491308 73. Ashoub MH Salavatipour MS Kasgari FH Extracellular microvesicles: biologic properties, biogenesis, and applications in leukemia Mol Cell Biochem 2024 479 2 419 430 10.1007/s11010-023-04734-y 37084166 74. Hu Z Qian S Zhao Q Engineering strategies for apoptotic bodies Smart Med 2024 3 3 e20240005 10.1002/SMMD.20240005 39420952 PMC11425054 75. Yu G Ding J Yang N Evaluating the pro-survival potential of apoptotic bodies derived from 2D- and 3D- cultured adipose stem cells in ischaemic flaps J Nanobiotechnology 2024 22 1 333 10.1186/s12951-024-02533-1 38877492 PMC11177420 76. Ekram S Khalid S Ramzan F Mesenchymal stem cell-derived extracellular vesicles protect rat nucleus pulposus cells from oxidative stress Cartilage 2024 15 3 328 344 10.1177/19476035231172154 37139781 PMC11418459 77. Zhang Y Tang Y Chen X Therapeutic potential of miRNAs in placental extracellular vesicles in ovarian and endometrial cancer Hum Cell 2024 37 1 285 296 10.1007/s13577-023-00986-4 37801261 78. Sha Z Liu W Jiang T Astragaloside IV induces the protective effect of bone marrow mesenchymal stem cells derived exosomes in acute myocardial infarction by inducing angiogenesis and inhibiting apoptosis Biotechnol Genet Eng Rev 2024 40 3 1438 1455 10.1080/02648725.2023.2194087 36971224 79. Shao Z Xu J Xu X Exosomes derived from human adipose mesenchymal stem cells inhibits fibrosis and treats oral submucous fibrosis via the miR-181a-5p/Smad2 axis Tissue Eng Regen Med 2024 21 1 123 135 10.1007/s13770-023-00579-0 37755664 PMC10764695 80. Bobis-Wozowicz S Paw M Sarna M Hypoxic extracellular vesicles from hiPSCs protect cardiomyocytes from oxidative damage by transferring antioxidant proteins and enhancing Akt/Erk/NRF2 signaling Cell Commun Signal 2024 22 1 356 10.1186/s12964-024-01722-7 38982464 PMC11232324 81. Chanda D Del Rivero T Ghimire R Acellular human amniotic fluid-derived extracellular vesicles as novel anti-inflammatory therapeutics against SARS-CoV-2 infection Viruses 2024 16 2 273 10.3390/v16020273 38400048 PMC10892347 82. Li H Xia M Zheng S Cerebrospinal fluid exosomal microRNAs as biomarkers for diagnosing or monitoring the progression of non-small cell lung cancer with leptomeningeal metastases Biotechnol Genet Eng Rev 2024 40 1 359 380 10.1080/02648725.2023.2183613 36852928 83. Zhu L Lou Y Xiao Q Establishment and evaluation of exosomes-related gene risk model in hepatocellular carcinoma Biochem Genet 2024 62 2 698 717 10.1007/s10528-023-10441-6 37405532 PMC11031460 84. Wagner V Kern F Hahn O Characterizing expression changes in noncoding RNAs during aging and heterochronic parabiosis across mouse tissues Nat Biotechnol 2024 42 1 109 118 10.1038/s41587-023-01751-6 37106037 PMC10791587 85. Ramos-Zaldivar HM Polakovicova I Salas-Huenuleo E The cervical and meningeal lymphatic network as a pathway for retrograde nanoparticle transport to the brain Int J Nanomed 2024 19 10725 10743 10.2147/IJN.S477159 PMC11514706 39469450 86. Yu Z Teng Y Yang J The role of exosomes in adult neurogenesis: implications for neurodegenerative diseases Neural Regen Res 2024 19 2 282 288 10.4103/1673-5374.379036 37488879 PMC10503605 87. Rudraprasad D V K Nirmal J Complement Cascade 8 - Alpha and Calpain-2 in extracellular vesicles of human vitreous as biomarkers of infectious endophthalmitis Transl Vis Sci Technol 2024 13 5 14 10.1167/tvst.13.5.14 PMC11114616 38767905 88. Duan H Meng F Liu X Extracellular vesicles from Candida albicans modulate immune cells function and play a protective role in fungal keratitis Microb Pathog 2024 189 106606 10.1016/j.micpath.2024.106606 38437994 89. Joseph A Anton L Guan Y Extracellular vesicles from vaginal Gardnerella vaginalis and Mobiluncus mulieris contain distinct proteomic cargo and induce inflammatory pathways NPJ Biofilms Microbiomes 2024 10 1 28 10.1038/s41522-024-00502-y 38514622 PMC10957959 90. Eldahshoury MK Katsarou K Farley JT Isolation of small extracellular vesicles (sEVs) from the apoplastic wash fluid of nicotiana benthamiana Leaves Curr Protoc 2024 4 11 e70026 10.1002/cpz1.70026 39499037 PMC11602942 91. Raposo G Stahl PD Extracellular vesicles, genetic programmers Nat Cell Biol 2024 26 1 22 23 10.1038/s41556-023-01277-8 38228825 92. Yu D Mei Y Wang L Nano-seq analysis reveals different functional tendency between exosomes and microvesicles derived from hUMSC Stem Cell Res Ther 2023 14 1 272 10.1186/s13287-023-03491-5 37749641 PMC10521478 93. Glitscher M Spannaus IM Behr F The protease domain in HEV pORF1 mediates the replicase’s localization to multivesicular bodies and its exosomal release Cell Mol Gastroenterol Hepatol 2024 17 4 589 605 10.1016/j.jcmgh.2024.01.001 38190941 PMC10900777 94. Sheykhhasan M Heidari F Farsani ME Dual role of exosome in neurodegenerative diseases: a review study Curr Stem Cell Res Ther 2024 19 6 852 864 10.2174/1574888X18666230726161035 37496136 95. Ao M Ma H Guo M Research hotspots and emerging trends in mesenchymal stem/stromal cells in bronchopulmonary dysplasia Hum Cell 2024 37 2 381 393 10.1007/s13577-023-01018-x 38159195 96. Kan C Tan Z Liu L Phase separation of SHP2E76K promotes malignant transformation of mesenchymal stem cells by activating mitochondrial complexes JCI Insight 2024 9 8 10.1172/jci.insight.170340 PMC11141883 38451719 97. Kaviani M Soleimanian S Keshtkar S Molecular prospective on malignant transformation of mesenchymal stem cells: an issue in cell therapy Cell Reprogram 2024 26 3 96 106 10.1089/cell.2024.0026 38917438 98. Shan XQ Luo YY Chang J Immunomodulation: the next target of mesenchymal stem cell-derived exosomes in the context of ischemic stroke World J Stem Cells 2023 15 3 52 70 10.4252/wjsc.v15.i3.52 37007453 PMC10052343 99. Chen X Qian W Zhang Y Ginsenoside CK cooperates with bone mesenchymal stem cells to enhance angiogenesis post-stroke via GLUT1 and HIF-1alpha/VEGF pathway Phytother Res 2024 38 8 4321 4335 10.1002/ptr.8235 38990183 100. Fei Z Zheng J Zheng X Engineering extracellular vesicles for diagnosis and therapy Trends Pharmacol Sci 2024 45 10 931 940 10.1016/j.tips.2024.08.007 39304474 101. Dilsiz N A comprehensive review on recent advances in exosome isolation and characterization: toward clinical applications Transl Oncol 2024 50 102121 10.1016/j.tranon.2024.102121 39278189 PMC11418158 102. Zeng YB Deng X Shen LS Advances in plant-derived extracellular vesicles: isolation, composition, and biological functions Food Funct 2024 15 23 11319 11341 10.1039/d4fo04321a 39523827 103. Brezgin S Danilik O Yudaeva A Basic guide for approaching drug delivery with extracellular vesicles Int J Mol Sci 2024 25 19 10401 10.3390/ijms251910401 39408730 PMC11476574 104. Rivero-Pino F Marquez-Paradas E Montserrat-de la paz S Food-derived vesicles as immunomodulatory drivers: current knowledge, gaps, and perspectives Food Chem 2024 457 140168 10.1016/j.foodchem.2024.140168 38908244 105. Saneh H Wanczyk H Walker J Stem cell-derived extracellular vesicles: a potential intervention for bronchopulmonary dysplasia Pediatr Res 2024 97 2 497 509 10.1038/s41390-024-03471-2 39251881 PMC12014501 106. Ge K Ren Y Hong Z Microchip based isolation and drug delivery of patient-derived extracellular vesicles against their homologous tumor Adv Healthc Mater 2024 13 30 e2401990 10.1002/adhm.202401990 39221674 107. Kumar S Sinclair JA Shi T Immunojanus particles for low-volume and isolation-free unlabeled characterization of small extracellular vesicle in biofluids: characterization of disease type by surface marker profiling bioRxiv 2024 10.1101/2024.08.17.607528 108. Henriquez T Santoro F Medaglini D Analysis of the utility of a rapid vesicle isolation method for clinical strains of Pseudomonas aeruginosa Microbiol Spectr 2024 12 10 e0064924 10.1128/spectrum.00649-24 39248554 PMC11448148 109. Su N Zhang J Liu W Specific isolation and quantification of PD-L1 positive tumor derived exosomes for accurate breast cancer discrimination via aptamer-functionalized magnetic composites and SERS immunoassay Talanta 2025 281 126956 10.1016/j.talanta.2024.126956 39332044 110. Gurriaran-Rodriguez U De Repentigny Y Kothary R Isolation of small extracellular vesicles from regenerating muscle tissue using tangential flow filtration and size exclusion chromatography Skelet Muscle 2024 14 1 22 10.1186/s13395-024-00355-1 39394606 PMC11468478 111. Wang L Gong Z Wang M Rapid and unbiased enrichment of extracellular vesicles via a meticulously engineered peptide Bioact Mater 2025 43 292 304 10.1016/j.bioactmat.2024.09.023 39399836 PMC11470464 112. Tsering T Nadeau A Rak J Analyzing extracellular vesicle-associated DNA using transmission electron microscopy at the single EV-level Curr Protoc 2024 4 11 e70047 10.1002/cpz1.70047 39513551 PMC11602948 113. Jeran M Romolo A Spasovski V Small cellular particles from european spruce needle homogenate Int J Mol Sci 2023 24 5 4349 10.3390/ijms24054349 36901780 PMC10001569 114. Zhang H Xia J Wang X Recent progress of exosomes in hematological malignancies: pathogenesis, diagnosis, and therapeutic strategies Int J Nanomed 2024 19 11611 11631 10.2147/IJN.S479697 PMC11559222 39539968 115. Cheng T Mao M Liu Y The potential therapeutic effect of human umbilical cord mesenchymal stem cell-derived exosomes in bronchopulmonary dysplasia Life Sci 2024 357 123047 10.1016/j.lfs.2024.123047 39260518 116. Baruah H Sarma A Basak D Exosome: from biology to drug delivery Drug Deliv Transl Res 2024 14 6 1480 1516 10.1007/s13346-024-01515-y 38252268 117. Fang X Zhang Y Zhang Y Endothelial extracellular vesicles: their possible function and clinical significance in diabetic vascular complications J Transl Med 2024 22 1 944 10.1186/s12967-024-05760-0 39415278 PMC11481601 118. Berdiaki A Neagu M Tzanakakis P Extracellular matrix components and mechanosensing pathways in health and disease Biomolecules 2024 14 9 10.3390/biom14091186 PMC11430160 39334952 119. Luo L Wang Z Negatively charged Cu(1.33)S nanochains: endocytic pathway, photothermal therapy and toxic effect in vivo Nanoscale Adv 2023 5 6 1706 1713 10.1039/d2na00776b 36926579 PMC10012857 120. Ransom MA Bunn KE Negretti NM Developmental trajectory of extracellular vesicle characteristics from the lungs of preterm infants Am J Physiol Lung Cell Mol Physiol 2023 324 3 L385 L392 10.1152/ajplung.00389.2022 36719083 PMC10026990 121. Shapira S Ben Shimon M Hay-Levi M A novel platform for attenuating immune hyperactivity using EXO-CD24 in COVID-19 and beyond EMBO Mol Med 2022 14 9 e15997 10.15252/emmm.202215997 35776000 PMC9349550 122. Yang Y Zhu G Yang L Targeting CD24 as a novel immunotherapy for solid cancers Cell Commun Signal 2023 21 1 312 10.1186/s12964-023-01315-w 37919766 PMC10623753 123. Grigoropoulos I Tsioulos G Kastrissianakis A The safety and potential efficacy of exosomes overexpressing CD24 (EXO-CD24) in mild-moderate COVID-19 related ARDS Respir Res 2024 25 1 151 10.1186/s12931-024-02759-5 38561798 PMC10983648 124. Lotfy A AboQuella NM Wang H Mesenchymal stromal/stem cell (MSC)-derived exosomes in clinical trials Stem Cell Res Ther 2023 14 1 66 10.1186/s13287-023-03287-7 37024925 PMC10079493 125. Mazini L Rochette L Malka G Exosomes contribution in COVID-19 patients’ treatment J Transl Med 2021 19 1 234 10.1186/s12967-021-02884-5 34059065 PMC8165679 126. Zhu YG Shi MM Monsel A Nebulized exosomes derived from allogenic adipose tissue mesenchymal stromal cells in patients with severe COVID-19: a pilot study Stem Cell Res Ther 2022 13 1 220 10.1186/s13287-022-02900-5 35619189 PMC9135389 127. Bisaccia P Magarotto F D’Agostino S Extracellular vesicles from mesenchymal umbilical cord cells exert protection against oxidative stress and fibrosis in a rat model of bronchopulmonary dysplasia Stem Cells Transl Med 2024 13 1 43 59 10.1093/stcltm/szad070 37963808 PMC10785219 128. Lithopoulos MA Strueby L O’Reilly M Pulmonary and neurologic effects of mesenchymal stromal cell extracellular vesicles in a multifactorial lung injury model Am J Respir Crit Care Med 2022 205 10 1186 1201 10.1164/rccm.202012-4520OC 35286238 129. Porzionato A Zaramella P Dedja A Intratracheal administration of mesenchymal stem cell-derived extracellular vesicles reduces lung injuries in a chronic rat model of bronchopulmonary dysplasia Am J Physiol Lung Cell Mol Physiol 2021 320 5 L688 L704 10.1152/ajplung.00148.2020 33502939 130. Wu Y Li J Yuan R Bone marrow mesenchymal stem cell-derived exosomes alleviate hyperoxia-induced lung injury via the manipulation of microRNA-425 Arch Biochem Biophys 2021 697 108712 10.1016/j.abb.2020.108712 33264631 131. You J Zhou O Liu J Human umbilical cord mesenchymal stem cell-derived small extracellular vesicles alleviate lung injury in rat model of bronchopulmonary dysplasia by affecting cell survival and angiogenesis Stem Cells Dev 2020 29 23 1520 1532 10.1089/scd.2020.0156 33040709 132. Abele AN Taglauer ES Almeda M Antenatal mesenchymal stromal cell extracellular vesicle treatment preserves lung development in a model of bronchopulmonary dysplasia due to chorioamnionitis Am J Physiol Lung Cell Mol Physiol 2022 322 2 L179 L190 10.1152/ajplung.00329.2021 34878940 PMC8782653 133. Mitchell A Wanczyk H Jensen T Human induced pluripotent stem cells ameliorate hyperoxia-induced lung injury in a mouse model Am J Transl Res 2020 12 1 292 307 32051754 PMC7013222 134. Xu W Jieda X Wu Y Safety, efficacy and bio-distribution analysis of exosomes derived from human umbilical cord mesenchymal stem cells for effective treatment of bronchopulmonary dysplasia by intranasal administration in mice model Int J Nanomed 2025 20 2521 2553 10.2147/IJN.S501843 PMC11874997 40034220 135. Wang J Zhang A Huang F MSC-EXO and tempol ameliorate bronchopulmonary dysplasia in newborn rats by activating HIF-1alpha Pediatr Pulmonol 2023 58 5 1367 1379 10.1002/ppul.26317 36650825 136. Tieu A Hu K Gnyra C Mesenchymal stromal cell extracellular vesicles as therapy for acute and chronic respiratory diseases: a meta-analysis J Extracell Vesicles 2021 10 12 e12141 10.1002/jev2.12141 34596349 PMC8485337 137. Braun RK Chetty C Balasubramaniam V Intraperitoneal injection of MSC-derived exosomes prevent experimental bronchopulmonary dysplasia Biochem Biophys Res Commun 2018 503 4 2653 2658 10.1016/j.bbrc.2018.08.019 30093115 PMC6398932 138. Porzionato A Zaramella P Dedja A Intratracheal administration of clinical-grade mesenchymal stem cell-derived extracellular vesicles reduces lung injury in a rat model of bronchopulmonary dysplasia Am J Physiol Lung Cell Mol Physiol 2019 316 1 L6 L19 10.1152/ajplung.00109.2018 30284924 139. Zhou Y Liu Y Xu G Human breast milk-derived exosomes through inhibiting AT II cell apoptosis to prevent bronchopulmonary dysplasia in rat lung J Cell Mol Med 2022 26 15 4169 4182 10.1111/jcmm.17334 35833257 PMC9344832 140. Ai D Shen J Sun J Mesenchymal stem cell-derived extracellular vesicles suppress hyperoxia-induced transdifferentiation of rat alveolar type 2 epithelial cells Stem Cells Dev 2022 31 3–4 53 66 10.1089/scd.2021.0256 34913742 141. Zhu D Krause M Yawno T Assessing the impact of gestational age of donors on the efficacy of amniotic epithelial cell-derived extracellular vesicles in experimental bronchopulmonary dysplasia Stem Cell Res Ther 2022 13 1 196 10.1186/s13287-022-02874-4 35550006 PMC9102678 142. Li X Huang L Mao M HucMSCs-derived exosomes promote lung development in premature birth via Wnt5a/ROCK1 axis Stem Cell Rev Rep 2025 21 2 520 535 10.1007/s12015-024-10824-1 39565502 PMC11872993 143. Zhou O You J Xu X Microvesicles derived from human umbilical cord mesenchymal stem cells enhance alveolar type II cell proliferation and attenuate lung inflammation in a rat model of bronchopulmonary dysplasia Stem Cells Int 2022 2022 8465294 10.1155/2022/8465294 35795773 PMC9252687 144. Starke N Challa NVD Yuan H Extracellular vesicle ASC: a novel mediator for lung-brain axis in preterm brain injury Am J Respir Cell Mol Biol 2024 71 4 464 480 10.1165/rcmb.2023-0402OC 38959416 PMC11450310 145. Wu J Huang QM Liu Y Long-term hypoxic hUCMSCs-derived extracellular vesicles alleviates allergic rhinitis through triggering immunotolerance of their VEGF-mediated inhibition of dendritic cells maturation Int Immunopharmacol 2023 124 Pt B 110875 10.1016/j.intimp.2023.110875 37742368 146. Sun M Li M Hu M Fully bioactive nanodrugs: stem cell-derived exosomes engineered with biomacromolecules to treat CCl(4)- and extreme hepatectomy-induced acute liver failure ACS Nano 2024 18 50 33907 33921 10.1021/acsnano.4c07408 39626080 147. Qiu AW Wang NY Yin WJ Retinal muller cell-released exosomal MiR-92a-3p delivers Interleukin-17A signal by targeting notch-1 to promote diabetic retinopathy Invest Ophthalmol Vis Sci 2025 66 1 1 10.1167/iovs.66.1.1 PMC11702826 39745681 148. Yu L He R Liu C Circulating microvesicles miR139-3p from bronchopulmonary dysplasia aggravates pulmonary vascular simplification by targeting 4E binding protein 1 J Gene Med 2024 26 2 e3675 10.1002/jgm.3675 38388205 149. Yi X Wei X Lv H Exosomes derived from microRNA-30b-3p-overexpressing mesenchymal stem cells protect against lipopolysaccharide-induced acute lung injury by inhibiting SAA3 Exp Cell Res 2019 383 2 111454 10.1016/j.yexcr.2019.05.035 31170401 150. Willis GR Fernandez-Gonzalez A Anastas J Mesenchymal stromal cell exosomes ameliorate experimental bronchopulmonary dysplasia and restore lung function through macrophage immunomodulation Am J Respir Crit Care Med 2018 197 1 104 116 10.1164/rccm.201705-0925OC 28853608 PMC5765387 151. Li H Ma K Dou H CircABPD1 alleviates oxidative lung injury of bronchopulmonary dysplasia through regulating miR-330-3p/HIF1alpha axis Int J Biochem Cell Biol 2023 163 106464 10.1016/j.biocel.2023.106464 37660980 152. Tolomeo AM Zuccolotto G Malvicini R Biodistribution of intratracheal, intranasal, and intravenous injections of human mesenchymal stromal cell-derived extracellular vesicles in a mouse model for drug delivery studies Pharmaceutics 2023 15 2 548 10.3390/pharmaceutics15020548 36839873 PMC9964290 153. Tieu A Stewart DJ Chwastek D Biodistribution of mesenchymal stromal cell-derived extracellular vesicles administered during acute lung injury Stem Cell Res Ther 2023 14 1 250 10.1186/s13287-023-03472-8 37705086 PMC10500845 154. Royo F Cossio U Ruiz de Angulo A Modification of the glycosylation of extracellular vesicles alters their biodistribution in mice Nanoscale 2019 11 4 1531 1537 10.1039/c8nr03900c 30623961 155. Yang S Liu P Gao T Every road leads to Rome: therapeutic effect and mechanism of the extracellular vesicles of human embryonic stem cell-derived immune and matrix regulatory cells administered to mouse models of pulmonary fibrosis through different routes Stem Cell Res Ther 2022 13 1 163 10.1186/s13287-022-02839-7 35413874 PMC9006546 156. Guo Q Zhao C Gao X One-minute iodine isotope labeling technology enables noninvasive tracking and quantification of extracellular vesicles in tumor lesions and intact animals Mol Pharm 2023 20 7 3672 3682 10.1021/acs.molpharmaceut.3c00299 37212215 157. Kang M Jordan V Blenkiron C Biodistribution of extracellular vesicles following administration into animals: a systematic review J Extracell Vesicles 2021 10 8 e12085 10.1002/jev2.12085 34194679 PMC8224174 158. Zou Z Li H Xu G Current knowledge and future perspectives of exosomes as nanocarriers in diagnosis and treatment of diseases Int J Nanomed 2023 18 4751 4778 10.2147/IJN.S417422 PMC10454833 37635911 159. Du W Chen C Liu Y A combined “eat me/don’t eat me” strategy based on exosome for acute liver injury treatment Cell Rep Med 2025 102033 10.1016/j.xcrm.2025.102033 40120577 PMC12047510 160. Xi Y Ju R Wang Y Mesenchymal stem cell-derived extracellular vesicles for the treatment of bronchopulmonary dysplasia Front Pediatr 2022 10 852034 10.3389/fped.2022.852034 35444971 PMC9013803 161. Ren X Wang S Teng Y Engineered extracellular vesicles loaded in boronated cyclodextrin framework for pulmonary delivery Carbohydr Polym 2025 352 123160 10.1016/j.carbpol.2024.123160 39843065 162. Zou T Lu J Zhu Y Mesenchymal stem cell-derived exosomes improved septic lung injury by reducing excessive NETs formation and alleviating inflammatory response Allergol Immunopathol 2025 53 1 63 68 10.15586/aei.v53i1.1238 39786877 163. Lin YK Pan YF Jiang TY Blocking the SIRPalpha-CD47 axis promotes macrophage phagocytosis of exosomes derived from visceral adipose tissue and improves inflammation and metabolism in mice J Biomed Sci 2025 32 1 31 10.1186/s12929-025-01124-y 40016734 PMC11869713 164. Li Y Yu B Li H Human milk exosome-derived circDNAJB6 improves bronchopulmonary dysplasia model by promoting DNAJB6 gene transcription J Bioenerg Biomembr 2024 56 2 171 180 10.1007/s10863-024-10002-5 38244155 165. Chaubey S Thueson S Ponnalagu D Early gestational mesenchymal stem cell secretome attenuates experimental bronchopulmonary dysplasia in part via exosome-associated factor TSG-6 Stem Cell Res Ther 2018 9 1 173 10.1186/s13287-018-0903-4 29941022 PMC6019224 166. Zhong XQ Hao TF Zhu QJ Umbilical cord blood exosomes from very preterm infants with bronchopulmonary dysplasia aggravate lung injury in mice Sci Rep 2023 13 1 8648 10.1038/s41598-023-35620-8 37244977 PMC10224930 167. Fonteles CSR Enterria-Rosales J Lin Y Amniotic fluid-derived stem cells: potential factories of natural and mimetic strategies for congenital malformations Stem Cell Res Ther 2024 15 1 466 10.1186/s13287-024-04082-8 39639397 PMC11622670 168. Valiukevicius P Maciulaitis J Pangonyte D Human placental mesenchymal stem cells and derived extracellular vesicles ameliorate lung injury in acute respiratory distress syndrome murine model Cells 2023 12 23 2729 10.3390/cells12232729 38067158 PMC10706384 169. Zhang C Zhang H Millan Cotto HA Milk exosomes anchored with hydrophilic and zwitterionic motifs enhance mucus permeability for applications in oral gene delivery Biomater Sci 2024 12 3 634 649 10.1039/d3bm01089a 38047368 PMC10842862 170. Su X Wang H Li Q Extracellular vesicles: a review of their therapeutic potentials, sources, biodistribution, and administration routes Int J Nanomed 2025 20 3175 3199 10.2147/IJN.S502591 PMC11913029 40098717 171. Martin C Patel M Williams S Human breast milk-derived exosomes attenuate cell death in intestinal epithelial cells Innate Immun 2018 24 5 278 284 10.1177/1753425918785715 29991305 PMC6830917 172. Wang X Yan X Zhang L Identification and peptidomic profiling of exosomes in preterm human milk: insights into necrotizing enterocolitis prevention Mol Nutr Food Res 2019 63 13 e1801247 10.1002/mnfr.201801247 31067344 173. Wang L Xiao J Zhang B Epigenetic modifications in the development of bronchopulmonary dysplasia: a review Pediatr Res 2024 10.1038/s41390-024-03167-7 38570557 174. Zhong XQ Yan Q Chen ZG Umbilical cord blood-derived exosomes from very preterm infants with bronchopulmonary dysplasia impaired endothelial angiogenesis: roles of exosomal MicroRNAs Front Cell Dev Biol 2021 9 637248 10.3389/fcell.2021.637248 33842462 PMC8027316 175. Saneh H Wanczyk H Walker J Effectiveness of extracellular vesicles derived from hiPSCs in repairing hyperoxia-induced injury in a fetal murine lung explant model Stem Cell Res Ther 2024 15 1 80 10.1186/s13287-024-03687-3 38486338 PMC10941466 176. Wang W Guo J Wang Y MicroRNA-30b-5p promotes the proliferation and migration of human airway smooth muscle cells induced by platelet-derived growth factor by targeting phosphatase and tensin homolog deleted on chromosome ten Bioengineered 2021 12 1 3662 3673 10.1080/21655979.2021.1950401 34251961 PMC8806833 177. Shi MM Yang QY Monsel A Preclinical efficacy and clinical safety of clinical-grade nebulized allogenic adipose mesenchymal stromal cells-derived extracellular vesicles J Extracell Vesicles 2021 10 10 e12134 10.1002/jev2.12134 34429860 PMC8363910 178. Mizenko RR Feaver M Bozkurt BT A critical systematic review of extracellular vesicle clinical trials J Extracell Vesicles 2024 13 10 e12510 10.1002/jev2.12510 39330928 PMC11428870 179. Lesage F Thebaud B Mesenchymal stromal cell-derived extracellular vesicles for neonatal lung disease: tiny particles, major promise, rigorous requirements for clinical translation Cells 2022 11 7 1176 10.3390/cells11071176 35406742 PMC8997376 180. Costa-Ferro ZSM Rocha GV da Silva KN GMP-compliant extracellular vesicles derived from umbilical cord mesenchymal stromal cells: manufacturing and pre-clinical evaluation in ARDS treatment Cytotherapy 2024 26 9 1013 1025 10.1016/j.jcyt.2024.04.074 38762805 181. Hu XM Wang CC Xiao Y Non-clinical safety evaluation of exosomes derived from human umbilical cord mesenchymal stem cells in cynomolgus monkeys Int J Nanomed 2024 19 4923 4939 10.2147/IJN.S454438 PMC11143447 38828201 182. Hmadeh S Trimaille A Matsushita K Human aortic stenotic valve-derived extracellular vesicles induce endothelial dysfunction and thrombogenicity through AT1R/NADPH Oxidases/SGLT2 Pro-oxidant pathway JACC Basic Transl Sci 2024 9 7 845 864 10.1016/j.jacbts.2024.02.012 39170957 PMC11334416 183. Matei AC Antounians L Zani A Extracellular vesicles as a potential therapy for neonatal conditions: state of the art and challenges in clinical translation Pharmaceutics 2019 11 8 404 10.3390/pharmaceutics11080404 31405234 PMC6723449 184. Duran-Jara E Del Campo M Gutierrez V Lactadherin immunoblockade in small extracellular vesicles inhibits sEV-mediated increase of pro-metastatic capacities Biol Res 2024 57 1 1 10.1186/s40659-023-00477-8 38173019 PMC10763369 185. Yang Q Luo Y Ge P Emodin ameliorates severe acute pancreatitis-associated acute lung injury in rats by modulating exosome-specific miRNA expression profiles Int J Nanomed 2023 18 6743 6761 10.2147/IJN.S428924 PMC10657551 38026528 186. Yang Q Yang J Sun S Rhodojaponin III-Loaded chitosan derivatives-modified solid lipid nanoparticles for multimodal antinociceptive effects in vivo Int J Nanomed 2022 17 3633 3653 10.2147/IJN.S362443 PMC9392492 35996527 187. Revilla G Al Qtaish N Caruana P Lenvatinib-Loaded Poly(lactic-co-glycolic acid) nanoparticles with epidermal growth factor receptor antibody conjugation as a preclinical approach to therapeutically improve thyroid cancer with aggressive behavior Biomolecules 2023 13 11 1647 10.3390/biom13111647 38002329 PMC10668968 188. Xiang B Zhang S Zhao IS Microenvironmental modulation for therapeutic efficacy of extracellular vesicles Adv Sci 2025 12 18 e2503027 10.1002/advs.202503027 PMC12079496 40145773 189. Thakur A Rai D Global requirements for manufacturing and validation of clinical grade extracellular vesicles J Liq Biopsy 2024 6 100278 10.1016/j.jlb.2024.100278 40027307 PMC11863704 190. Dogan AB Marsh SR Tschetter RJ Stabilizing milk-derived extracellular vesicles (mEVs) through lyophilization: a novel trehalose and tryptophan formulation for maintaining structure and Bioactivity during long-term storage J Biol Eng 2025 19 1 4 10.1186/s13036-024-00470-z 39806456 PMC11727230 191. Mehanny M Boese A Bornamehr B Spray-dried pneumococcal membrane vesicles are promising candidates for pulmonary immunization Int J Pharm 2022 621 121794 10.1016/j.ijpharm.2022.121794 35525468 192. Jansen EM van der Koog L Elferink RAB Stabilized extracellular vesicle formulations for inhalable dry powder development Small 2025 e2411096 10.1002/smll.202411096 39945036 193. Zheng M Zhu W Gao F Novel inhalation therapy in pulmonary fibrosis: principles, applications and prospects J Nanobiotechnol 2024 22 1 136 10.1186/s12951-024-02407-6 PMC10981316 38553716 194. Gul F Gonen ZB Jones OY A pilot study for treatment of severe COVID-19 pneumonia by aerosolized formulation of convalescent human immune plasma exosomes (ChipEXO) Front Immunol 2022 13 963309 10.3389/fimmu.2022.963309 36439138 PMC9682905 195. Luo X Wang Y Mao Y Nebulization of hypoxic hUCMSC-EVs attenuates airway epithelial barrier defects in chronic asthma mice by transferring CAV-1 Int J Nanomed 2024 19 10941 10959 10.2147/IJN.S476151 PMC11531287 39493276 196. Changsan N Atipairin A Muenraya P In vitro evaluation of colistin conjugated with chitosan-capped gold nanoparticles as a possible formulation applied in a metered-dose inhaler Antibiotics 2024 13 7 630 10.3390/antibiotics13070630 39061312 PMC11274357 197. Rashidipour M Rasoulian B Maleki A Pectin/chitosan/tripolyphosphate encapsulation protects the rat lung from fibrosis and apoptosis induced by paraquat inhalation Pestic Biochem Physiol 2021 178 104919 10.1016/j.pestbp.2021.104919 34446195 198. Green O Shenberg G Baruch R Inhaled exosomes genetically manipulated to overexpress CD24 (EXO-CD24) as a compassionate use in severe ARDS patients Biomedicines 2023 11 9 2523 10.3390/biomedicines11092523 37760963 PMC10525844 199. Shapira S Schwartz R Tsiodras S Inhaled CD24-enriched exosomes (EXO-CD24) as a novel immune modulator in respiratory disease Int J Mol Sci 2023 25 1 77 10.3390/ijms25010077 38203250 PMC10779124 ",
  "metadata": {
    "Title of this paper": "Inhaled CD24-enriched exosomes (EXO-CD24) as a novel immune modulator in respiratory disease",
    "Journal it was published in:": "International Journal of Nanomedicine",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12474683/"
  }
}