{
  "title": "Paper_1233",
  "abstract": "pmc Medicina (Kaunas) Medicina (Kaunas) 3494 medicina medicina Medicina 1010-660X 1648-9144 Multidisciplinary Digital Publishing Institute  (MDPI) PMC12472027 PMC12472027.1 12472027 12472027 41011018 10.3390/medicina61091627 medicina-61-01627 1 Review Anatomical Reasons for an Impaired Internal Jugular Flow Dincă Viviana 1 Ionescu Paris 2 https://orcid.org/0009-0008-4655-4574 Tudose Răzvan Costin 1 3 Munteanu Mădălin 4 Vrapciu Alexandra Diana 1 * https://orcid.org/0000-0002-8723-0540 Rusu Mugurel Constantin 1 Reiss Allison B. Academic Editor 1 razvan-costin.tudose0721@stud.umfcd.ro mugurel.rusu@umfcd.ro 2 3 4 * alexandra.vrapciu@umfcd.ro 08 9 2025 9 2025 61 9 497654 1627 25 8 2025 31 8 2025 05 9 2025 08 09 2025 27 09 2025 29 09 2025 © 2025 by the authors. 2025 https://creativecommons.org/licenses/by/4.0/ Published by MDPI on behalf of the Lithuanian University of Health Sciences. Licensee MDPI, Basel, Switzerland. This article is an open access article distributed under the terms and conditions of the Creative Commons Attribution (CC BY) license ( https://creativecommons.org/licenses/by/4.0/ The internal jugular vein (IJV) is of utmost importance during various surgical and endovascular approaches, including central access. It descends through the parapharyngeal space, carotid triangle, and sternocleidomastoid region. The anatomical variables of the IJV are mainly related to its calibre and dominance, number of venous channels (i.e., duplications and fenestrations), and compression sites. Specific compressions of the IJV are not exclusively due to the jugular nutcracker between the styloid process (SP) of the temporal bone and the C1 transverse process, which, in turn, should not be granted the eponym of Eagle. The possible morphologies of the SP and ossified stylohyoid chain are discussed here. Additionally, the digastric and sternocleidomastoid muscles, the hyoid, and the distorted carotid arteries may compress the IJV, thereby raising intracranial pressure. Here, a case is documented with a long inferior petrosal sinus adjacent to the IJV, both compressed into the C1–styloid nutcracker, which is an absolute novelty. Multiple compression sites of the IJV are supported here with original evidence. All anatomical variables of the IJV are relevant, as they may lead to stenoses or interfere with IJV cannulation. In rare cases of IJV agenesis, multiple compression sites on the opposite side may significantly alter bilateral cerebral drainage. Different methods may be used to decompress a stenotic IJV, including styloidectomy. In conclusion, the anatomical variables of the IJV should be acknowledged by practitioners and documented on a case-by-case basis. atlas vertebra styloid process Eagle syndrome jugular vein carotid artery neck veins inferior petrosal sinus anatomical variation This research received no external funding. pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement no pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes 1. Introduction The internal jugular vein (IJV) is a major blood vessel of the neck, of utmost importance for anaesthesiologists, surgeons, and anatomists [ 1 2 3 4 Internal jugular vein stenosis is receiving increased attention from the medical research community [ 5 5 5 This review addresses an important and underexplored topic, namely, the anatomical variations and compression sites of the IJV, with potential clinical implications. They are usually approached independently; thus, the integrative anatomical picture may have been overlooked. 2. Normal Anatomy of the Internal Jugular Vein The IJV continues the sigmoid sinus in the jugular foramen, located just above the anterior surface of the transverse process of the atlas [ 6 7 8 9 10 9 11 12 13 The IJV continues in the poststyloid part of the parapharyngeal space [ 14 15 16 17 18 The IJVs constitute the primary outflow route from the head and neck in humans [ 19 19 20 21 22 19 20 21 22 An interesting study on 100 computed tomography (CT) angiograms found that as the IJV descends into the thorax, its area increases and it geometrically resembles a conical structure [ 23 15 The left IJV is smaller than the right IJV in one third of adults, this being statistically significant [ 15 23 24 25 26 The retrostyloid compartment of the upper parapharyngeal space comprises the internal carotid artery (ICA), IJV, cranial nerves IX to XII, and the superior sympathetic trunk [ 27 28 27 27 Compression of the IJV is a common and clinically significant condition, most often caused by nearby bones or muscles. It can lead to a range of neurological symptoms and, in severe cases, serious complications. Surgical and endovascular treatments are effective for symptomatic cases. Intentional IJV compression is a promising area for preventing brain injury [ 29 30 31 The most commonly identified site of outflow impairment is in the rostral IJV near the transverse process of C1 and the SP, often referred to as styloidogenic jugular stenosis [ 32 IJV compression may cause venous reflux. This can alter cerebral drainage patterns. These changes affect cerebrospinal fluid dynamics. The compression can be detected using several methods. Doppler ultrasound is one option. MRI and CT venography are also effective. Dynamic imaging during head movement may reveal positional compression. IJV compression is relevant in various medical contexts. It can explain specific headache patterns. It also helps us understand cerebral venous drainage disorders. However, some aspects remain unclear. The clinical significance of mild IJV compression in asymptomatic individuals is uncertain. Some degree of positional variation in IJV patency is normal. The field continues to evolve. Imaging techniques are improving. Our understanding of cerebral venous drainage is becoming more sophisticated. An IJV compression can lead to venous shunting to the petrosal sinuses, which drain the inner ear, and to the vertebral veins of the cervical spinal cord, resulting in symptoms referable to the areas of shunting [ 33 34 2.1. The Segments of the Internal Jugular Vein Three segments of the IJV are defined for ultrasonographic measurements. These segments are used during various examinations. The first is the inferior segment (J1). This extends from the confluence of the IJV with the subclavian vein. It reaches the inferior level of the thyroid gland. The second is the middle segment (J2). This starts from the inferior level of the thyroid gland. It continues to the jugular point where the IJV crosses the carotid bifurcation. The third is the superior segment (J3). This begins from the jugular point. It extends to the highest ultrasonographically detectable point of the IJV [ 35 36 37 38 39 We consider that these divisions should be indicated on an anatomical basis, from the base of the skull to the base of the neck. Indicating that the J1 segment is the proximal portion of the IJV and the subclavian/brachiocephalic vein, the J2 segment is the IJV’s segment at the level of the thyroid gland, and the J3 segment is at the level of the carotid bifurcation, as we found in a recent study [ 38 As the J3 segment of the IJV passes through the “tunnel” between the transverse process of the atlas and the SP, this segment is more likely to be impinged by osseous structures from cervical spondylosis [ 40 2.2. The Internal Jugular Vein’s Valves The IJV valves make a buffer zone between the large central veins and the cerebral venous system [ 41 41 41 41 42 2.3. The Dominant Internal Jugular Vein A dominant IJV refers to the vein (either right or left) that is significantly larger in cross-sectional area compared to the opposite side, often defined as at least twice the size of the contralateral vein. This dominance is significant because it typically serves as the primary pathway for venous blood drainage from the brain. Asymmetry between the IJVs is common, with one side being dominant in over 60% of individuals. The right IJV is dominant in most cases, but not exclusively so [ 43 44 45 44 2.4. The “Tunnel” of the Internal Jugular Vein at the Level of the Transverse Process of the Atlas At C1, the IJV descends through a veritable vertical tunnel bordered by different anatomical structures, each of these having the potential to compress the IJV. The tunnel of the IJV is limited: posteriorly, by the C1 transverse process, through which courses the vertebral artery, anteriorly, by the SP, medially, by the ICA, antero-medially, by the stylopharyngeus and styloglossus, laterally, by the posterior belly of the digastric muscle, the SCM, and, eventually, the mastoid process, and anterolaterally, by the deep lobe of the parotid gland and the external carotid artery (ECA) ( Figure 1 46 Figure 2 At this level, the IJV is usually crossed laterally by the occipital (OA) and posterior auricular (PAA) arteries ( Figure 2 47 48 3. Anatomical Variations of the Internal Jugular Vein Anatomical variations of the IJV are uncommonly reported, and most of the reports are from anaesthetists and are based on evaluation of imaging for central venous access [ 16 49 50 Variations in IJV anatomy are not always pathologic; however, when symptoms of intracranial hypertension are observed, further investigation is warranted [ 51 7 52 Table 1 16 50 53 52 IJV agenesis represents an extremely uncommon congenital anomaly that is usually clinically silent and identified incidentally on imaging performed for other clinical reasons [ 50 54 50 55 56 medicina-61-01627-t001_Table 1 Table 1 Jugular bulb morphological variations overview. JB: jugular bulb; IAC: internal acoustic canal; PSC: posterior semicircular canal; JBD: jugular bulb diverticulum; HJB: high jugular bulb. Jugular Bulb Variant Definition Clinical Significance Prevalence/Range References High JB JB apex abnormally high vs. otic landmarks (e.g., reaches/traverses IAC floor; above round window/basal turn/superior annulus). Morphology: “waist-like” JB (vs. finger-like diverticulum). Can narrow Trautmann’s triangle; bleeding risk in otologic/skull-base work; common cause of pulsatile tinnitus. Prevalence varies by definition/method, ranging from ~0% to 46% across studies. [ 57 58 59 60 61 62 63 Dehiscent JB JB extends into the middle ear via a dehiscent sigmoid plate; mucosa only (no complete bony cover). Injury-prone during ear surgery; haemorrhage; associations with thin carotid canal wall/dehiscence. Reported ~1–7.5%; side bias often right-dominant. [ 63 64 65 66 67 68 JB Diverticulum True outpouching from the JB dome (often finger-like) projecting superiorly/medially/posteriorly within the petrous bone. Pulsatile tinnitus; conductive/±sensorineural loss; vertigo; can complicate middle ear/skull-base routes. Reported from ~0.8% up to ~8% (method/definition dependent). [ 58 60 62 63 67 69 70 Hypoplastic JB Proposed threshold: ≤5 mm max diameter. May reflect reduced venous pathway calibre; may be consistent in measurement plane/modality. Not standardised; threshold proposed to normalise reporting. [ 71 72 73 Hyperplastic JB Proposed threshold: ≥15 mm max diameter. Consider high-flow states/bone disorders; evaluate adjacent bony walls. Not standardised; noted with achondroplasia/Paget’s disease, etc. [ 71 72 74 Topographic Variants Type 1: none; Type 2: below PSC; Type 3: between PSC and IAC; Type 4: above IAC; “A” intact bone, “B” dehiscent. Guides risk mapping near PSC/IAC; flags dehiscence (“B”) zones. Classification, no pooled prevalence. [ 69 75 76 Condylar Jugular Diverticulum Actually an enlarged condylar canal communicating with JB; best seen on posterior coronal images (maintains calibre to condylar fossa). Prevents mislabelling as JBD and unnecessary intervention. — [ 60 70 77 One of the arms of a fenestrated IJV may receive the external carotid vein of Launay ( Figure 3 78 79 The posterior tributary of the IJV is unusual and is scarcely reported in the literature—just three cases were documented by Mumtaz and Singh in 2019 [ 16 80 The causes of non-compression chronic cerebrospinal venous insufficiency include the high jugular bulb (77.27%), fenestration of the IJV (7.27%), IJV ectasia (2.73%), and tortuous IJV (0.91%) [ 81 82 82 Absence of the Internal Jugular Vein: Clinical Rarity, Causes, and Implications Non-visualisation of a right IJV on ultrasonography can be due to operator (e.g., suboptimal patient positioning, inappropriate machine setting, or excessive pressure on the probe) and patient (e.g., vascular thrombosis, congenital anomalies such as hypoplasia or agenesis) factors [ 83 The absence of the IJV is an extremely rare anatomical anomaly [ 1 84 84 Figure 4 Congenital agenesis (true absence) of the IJV is very uncommon, with an estimated prevalence in the general population between 0.05% and 0.25% [ 85 86 87 85 86 87 88 85 87 86 87 89 Patients are often asymptomatic due to compensatory enlargement of the contralateral IJV or collateral veins [ 85 86 Figure 4 85 86 87 88 85 86 90 The absence of the IJV can complicate or preclude cannulation; ultrasound guidance is strongly recommended [ 85 87 88 91 85 86 87 54 54 54 92 4. The Styloid Process and the Stylohyoid Chain The stylohyoid complex (SHC) consists of three key components, namely, the SP, the stylohyoid ligament, and the lesser horn of the hyoid bone, which derive from Reichert’s cartilage of the second pharyngeal arch [ 93 94 95 95 96 97 98 99 100 Guimaraes et al. (2006) used a modified version of Langlais et al.’s (1995) classification of an elongated SP (ESP) and/or stylohyoid ligament ossification and found elongated, pseudo-articulated, and segmented SPs; they noticed that the morphological alterations of the SP develop in a symmetrical fashion [ 101 102 103 104 99 104 The different patterns of ossification of the SHC ( Table 2 96 96 96 96 96 96 medicina-61-01627-t002_Table 2 Table 2 Main types of stylohyoid chain (SHC) variations. Type/Pattern Description Prevalence/Notes Citations normal styloid process typical length (<30 mm), no calcification most common (74.97–86.5%) [ 103 104 elongated styloid process length > 30 mm 7.1–25.03% [ 99 103 104 calcified stylohyoid ligament partial or total ossification of the ligament 2.2% (partial more common than total) [ 99 103 segmented (pseudo-articulated) type SHC appears as multiple ossified segments 3.89–4.39% [ 104 absent stylohyoid chain SHC not visible or absent 2.8% [ 103 The Length of the Styloid Process The SP is a bony projection inserted onto the petrous bone just anterior to the stylomastoid foramen [ 105 105 105 106 Jung et al. (2004) observed that the SP is often denoted as elongated when it is longer than 30 mm or 33 mm [ 107 107 107 107 Munoz-Leija et al. (2020) regarded a morphologically ESP as a continuous process of >25 mm [ 108 108 A longer SP has a greater movement capacity at its distal end, increasing the risk of adjacent neurovascular compromise [ 109 109 110 111 112 An ESP is more common in older adults, with no correlation with gender [ 99 103 113 113 93 5. The Nutcracker Syndromes The term “nutcracker” was first used in 1971 to describe the mesaortic compression of the left renal vein between the superior mesenteric artery and the aorta, this form being known as anterior nutcracker syndrome—the classic variant [ 114 115 114 115 116 According to several specialised articles, there is an association between Eagle jugular syndrome and jugular nutcracker syndrome (JNS) [ 109 109 6. Eagle’s Syndromes In 1937, Watt W. Eagle reported two cases of ESPs [ 117 117 117 118 118 118 118 119 118 118 120 100 The orientation and angle of the ESP determine which anatomical structures become compressed, resulting in various symptoms [ 98 98 Figure 5 98 98 However, vascular variants of ES are rare [ 121 121 121 ES is also referred to as “stylohyoid syndrome” [ 96 122 123 123 124 124 124 109 109 111 125 126 127 128 129 Cantin and Suazo Galdames (2011) quoted Camarda et al. (1989), who classified the cervicopharyngeal pain associated with an ESP into three distinct entities [ 130 131 131 131 131 It was observed that the juxtaposition of the SP and transverse process of the atlas can produce symptoms of cervicalgia and otalgia even in the setting of a normal-length SP [ 132 133 7. Compressions of the Internal Jugular Vein Any adjacent structure can cause direct compression of the IJV [ 134 135 15 45 136 45 137 Figure 6 When the IJV is compressed, several collateral venous routes can load and divert the flow of the IJV. In such situations, the enlarged compensatory veins are exposed to haemorrhagic risks during surgical procedures. Firstly, the contralateral IJV may enlarge and discharge the compressed vein’s dural suppliers (bilateral drainage through the IJV opposite to a compressed one). The superficial veins of the neck (external jugular, anterior jugular, and posterior external jugular) may redirect the flow from a compressed IJV via different communicating veins [ 138 139 140 Mandolesi et al. (2015), quoted in Piraino et al. (2018), classified chronic cerebrspinal venous insufficiency as three different types: (1) type 1, due to an endovascular obstacle, called hydraulic; (2) type 2, due to a muscular compression without endovascular anomalies, called mechanical; (3) type 3, presenting both endovascular and extravascular anomalies, called mixed; and (4) all three types [ 141 142 143 144 Although contralateral rotation is the most crucial factor in obstructing the vein, some degree of extension may be required [ 6 6 A dissection study found that in all specimens, the posterior wall of the IJV rested against the transverse process of the atlas as the vein descended immediately below the jugular foramen [ 6 6 6 40 The hypertrophy of the lateral mass of the atlas is a rare finding [ 145 146 Table 3 medicina-61-01627-t003_Table 3 Table 3 Common causes and outcomes of internal jugular vein compression. Cause/Intervention Main Outcome/Symptom Reference(s) Styloid process/C1 vertebra Headache, tinnitus, insomnia [ 45 128 133 147 148 Muscular/osseous structures Atypical facial pain, hypertension [ 147 149 Subcutaneous emphysema/tumour Vein narrowing, variable symptoms [ 150 151 Compression collar (protective) Reduced brain/axonal injury [ 30 31 152 153 154 On the other hand, external compression of the IJVs is an effective method for increasing intracranial blood volume and brain volume in animals and healthy humans [ 155 155 30 31 152 153 154 156 157 158 156 IJV compression raises intracranial and intraocular pressures, increasing blood volume in the brain. This can reduce the movement (“slosh”) of the brain within the skull during impacts, potentially protecting against axonal injury and microstructural brain changes [ 152 153 159 160 161 162 154 159 161 162 163 164 30 31 152 153 Jayaraman et al. (2012) investigated the causes of moderate or severe compression of the IJV, by side, in 108 cases [ 45 45 45 165 Sultan et al. (2022) reported a case with an ESP and concomitant compressions of the ICA and IJV [ 100 Jugular (deep cervical) lymph nodes, located along the IJV, may also compress the vein [ 81 134 166 167 Table 4 167 168 134 medicina-61-01627-t004_Table 4 Table 4 Table summarising cancers and mechanisms of IJV compression by lymph nodes. Condition/Cancer Type Mechanism of IJV Compression Clinical Consequence Citations Thyroid cancer Lymph node metastasis Occlusion/thrombosis [ 151 169 Lymphoma (e.g., Grey Zone Lymphoma) Mediastinal/cervical lymphadenopathy Thrombosis, SVC syndrome [ 170 Gastric/prostate carcinoma Metastatic lymphadenopathy Thrombosis, embolic events [ 171 172 The proximity of the carotid axis and IJV within the carotid sheath makes the IJV susceptible to displacement when the carotid artery becomes tortuous. The normal anatomical relationship can be significantly altered, with the IJV being pushed away from its expected position. In 26.2% of cases, the ICA may present a more or less curved course to the base of the skull [ 173 173 Cases have shown that a tortuous ICA can externally compress the IJV, resulting in IJV stenosis. Symptoms are often nonspecific and may be misattributed to other conditions, resulting in a delayed diagnosis. Although two cases of bilateral IJV stenosis by tortuous ICAs were reported previously [ 166 Figure 7 Figure 8 Figure 9 Figure 9 40 133 174 Figure 9 Figure 10 The SCM and omohyoid (OMH) muscles were not listed by Jayaraman et al. (2012) as potential extrinsic compressive structures of the IJV [ 45 33 34 175 176 176 SCM/OMH compression is typically induced with ipsilateral head turning and flexion, and is usually bilateral with concurrent compressions that include stylohyoid and thoracic outlet syndrome [ 33 33 34 142 137 When an atypical OMH compresses the IJV, partly or entirely, it may be surgically transected [ 137 143 177 178 149 Although different studies involve the SP in IJV compression, an unossified segment of the SHC, tensed between two ossified segments ( Figure 6 32 143 A Long Inferior Petrosal Sinus May Also Enter into the Nutcracker The IPS is a paired dural venous sinus in the posterior cranial fossa that drains the cavernous sinus into the jugular bulb. It receives an inflow from the auditory structures and the brainstem [ 179 180 179 181 181 181 182 183 Different reports of duplicated IJVs were previously published [ 184 185 186 187 188 189 190 187 We present here a case with bilateral long IPSs ( Figure 7 Figure 8 8. Clinical Anatomy The clinical conditions associated with IJV compression are (1) chronic cerebrospinal venous insufficiency, a controversial condition where IJV stenosis or compression is thought to impair cerebral venous drainage; it has been studied in relation to multiple sclerosis, though the connection remains debated [ 15 20 5 Different clinical manifestations may be related to a stenotic IJV, but with different prevalence: tinnitus (60.5%), tinnitus cerebri (67.4%), headache (48.8%), dizziness (32.6%), neck discomfort (39.5%), dry or puffy eyes (37.2%), anxiety or depression (39.5%), sleep disturbance (60.5%), hearing disorder (39.5%), visual disorder (39.5%), and subjective memory decline (30.2%) [ 5 191 Cerebral venous outflow from the brain is not fully understood [ 191 191 A case of IJV compression by an ESP was reported, presenting with 3 years of positional headache associated with decreased vision when reading and while turning the head to the right or left [ 126 126 126 136 192 Chronic or positional IJV compression (often from anatomical structures like the SP or muscles) can cause headaches, tinnitus, insomnia, and, in severe cases, intracranial hypertension [ 45 147 148 160 193 194 195 8.1. Cannulation of the Internal Jugular Vein Cannulation of a central vein is a widespread procedure. The IJV is commonly used for this purpose. This procedure is used for various medical reasons. It can be used for haemodynamic monitoring [ 2 2 2 2 2 23 2 196 196 Complications may occur in more than 15% of patients undergoing central venous catheterisation [ 197 197 197 54 198 Cannulation of the right IJV is preferable to the left IJV, but when the right IJV is not available for central venous access, the left IJV may be used [ 2 50 199 17 18 18 18 18 18 199 200 A right dominant IJV is presented in Figure 11 199 44 44 44 8.2. Stenosis of the Internal Jugular Vein Chronic cerebrospinal vascular insufficiency is a serious disease process, often accompanied by abnormal intracranial pressure caused by cerebral venous outflow insufficiency. IJV stenosis has been associated with chronic cerebrospinal vascular insufficiency [ 201 Previous studies have employed somewhat ambiguous criteria for defining venous stenosis; however, the generally accepted definition involves a reduction of more than 50% in the venous cross-sectional area at one point compared to the vessel’s maximum diameter anywhere along its length [ 15 15 Distinctive grades of IJV compression were used with different imaging techniques to evaluate IJV compression: (1) stenotic segment narrowing of ≥50% with respect to the proximal adjacent jugular vein segment; (2) at least one abnormal collateral vessel ≥50% of the maximal diameter of the adjacent IJV or at least two abnormal collateral vessels <50% of the maximal diameter of the adjacent IJV; (3) IJV stenosis secondary to the compression from the C1 lateral mass with or without the SP; and (4) IJV stenosis with unexplained non-focal neurological deficits or other symptoms [ 40 Moreover, venous anatomy and wall properties are known to fluctuate considerably in response to internal pressure, volume status, and flow dynamics [ 15 15 15 Figure 10 15 15 Imaging features can be used to differentiate between physiologic IJV slenderness and pathologic IJV stenosis [ 201 201 A study on patients with cerebral venous outflow disorders found that most commonly, ipsilateral rotation results in ipsilateral IJV stenosis and gradient development at C4–6 and contralateral stenosis and gradient appearance in the contralateral IJV at C1, with stenosis and gradient development in bilateral IJVs at C1–3 bilaterally during chin flexion [ 202 202 A recent study found no significant correlation between IJV stenosis in the J3 segment of the IJV and intracranial pressure [ 36 36 36 36 Multiple Stenotic Segments of the Internal Jugular Vein Multiple levels of compression or stenosis affecting the IJV may be found at different anatomical points along its course ( Figure 12 5 8.3. Thrombosis of the Internal Jugular Vein IJV thrombosis is an infrequent condition that comprises 1.5% of deep venous thromboses overall and 45.3% of upper limb deep vein thromboses [ 128 128 128 IJV thrombosis may lead to pulmonary embolism [ 203 203 Guan et al. (2021) reported a case of cerebral venous sinus thrombosis in the lateral sinus in a patient with bilateral compression of the IJVs due to an overgrown left lateral mass of the atlas, as well as arteriosclerosis and expansion of the right ICA [ 135 8.4. Solving the Decompression of the Internal Jugular Vein Scerrati et al. (2021) analysed 13 papers reporting 149 patients with extrinsic, styloidogenic IJV compression at the level of C1 [ 133 133 133 133 133 157 148 148 204 204 Stenting may be considered for focal IJV stenosis with significant pressure gradients, primarily when caused by vascular compression [ 166 111 133 133 133 205 Surgical decompression via the extreme lateral infracondylar approach has shown promising results, with significant improvement in IJV stenosis and clinical symptoms in most patients. In a recent case series, 8 out of 14 patients experienced significant symptom relief, and imaging confirmed improved venous flow in the majority of patients [ 156 206 32 156 While generally safe, surgical IJV decompression can result in complications, such as cranial nerve paresis and wound infection, though these are relatively rare [ 156 32 32 In a case with extrinsic compression of the IJV by a hypertrophic hyoid bone and thyroid cartilage, venous decompression was achieved by the resections of the posterior part of the greater hyoid horn and the superior horn of the thyroid cartilage [ 149 9. Conclusions The jugular nutcracker can also involve and compress an elongated inferior petrosal sinus (IPS), which serves as an accessory IJV. This represents a discovery of critical importance for precise preoperative anatomical assessment. The IJV may display multiple pathways, including fenestrations and duplications across different segments. Its size and bilateral symmetry vary unpredictably. Styloid process geometry differs between patients, meaning the SP may not always compress the IJV. Other nearby anatomical structures may be responsible for IJV compression instead. Therefore, thorough IJV documentation is essential before any surgical or interventional procedures. Clinicians have to distinguish carefully between proven findings and hypothetical associations. Acknowledgments Two authors (P.I.) contributed equally to this work as co-first authors (V.D.). Ilinca Maria Stăncioiu and Bogdan Vintilă are acknowledged for their participation in this study. Disclaimer/Publisher’s Note: Author Contributions Conceptualisation, M.C.R.; methodology, A.D.V.; software, V.D. and R.C.T.; validation, M.C.R., A.D.V. and P.I.; formal analysis, V.D. and M.M.; investigation, V.D. and P.I.; resources, M.C.R.; data curation, R.C.T. and A.D.V.; writing—original draft preparation, M.C.R.; writing—review and editing, M.C.R. and R.C.T.; visualisation, V.D. and A.D.V.; supervision, M.M. and P.I.; project administration, M.C.R. and A.D.V. All authors have read and agreed to the published version of the manuscript. Institutional Review Board Statement This research was conducted ethically in accordance with the World Medical Association’s Code of Ethics (Declaration of Helsinki). The responsible authorities (affiliation 3) approved this study (approval no. 737/1 November 2024). Informed Consent Statement Informed consent was obtained from all subjects involved in this study. Data Availability Statement The datasets used and analysed during the current study are available from the corresponding author upon reasonable request. Conflicts of Interest The authors declare no conflicts of interest. Abbreviations The following abbreviations are used in this manuscript: CCA common carotid artery CT computed tomography EA Eagle’s syndrome ECA external carotid artery ESP elongated styloid process HJB high jugular bulb IAC internal acoustic canal ICA internal carotid artery IJV internal jugular vein IPS inferior petrosal sinus JB jugular bulb JBD jugular bulb diverticulum JNS jugular nutcracker syndrome OA occipital artery OMH omohyoid muscle PAA posterior auricular artery PSC posterior semicircular canal SCM sternocleidomastoid muscle SHC stylohyoid complex SP styloid process References 1. Bandlamuri S. Khan A.S. Bialowas C. Surgical approach to internal and external jugular venous agenesis: Case report Surg. Radiol. Anat. 2023 45 989 993 10.1007/s00276-023-03179-8 37269413 2. Asouhidou I. Natsis K. Asteri T. Sountoulides P. Vlasis K. Tsikaras P. Anatomical variation of left internal jugular vein: Clinical significance for an anaesthesiologist Eur. J. Anaesthesiol. 2008 25 314 318 10.1017/S0265021508003700 18289445 3. Okamura K. Nomura T. Mizuno Y. Miyashita T. Goto T. Pre-anesthetic ultrasonographic assessment of the internal jugular vein for prediction of hypotension during the induction of general anesthesia J. Anesth. 2019 33 612 619 10.1007/s00540-019-02675-9 31451896 4. Helwani M. Saied N. Ikeda S. Accuracy of Anatomical Landmarks in Locating the Internal Jugular Vein Cannulation Site among Different Levels of Anesthesia Trainees J. Educ. Perioper. Med. 2008 10 E050 10.46374/volx-issue2-helwani 27175381 PMC4803400 5. Zhou D. Ding J. Asmaro K. Pan L. Ya J. Yang Q. Fan C. Ding Y. Ji X. Meng R. Clinical Characteristics and Neuroimaging Findings in Internal Jugular Venous Outflow Disturbance Thromb. Haemost. 2019 119 308 318 10.1055/s-0038-1676815 30605919 6. Seoane E. Rhoton A.L. Jr. Compression of the internal jugular vein by the transverse process of the atlas as the cause of cerebellar hemorrhage after supratentorial craniotomy Surg. Neurol. 1999 51 500 505 10.1016/S0090-3019(97)00476-X 10321879 7. Tudose R.C. Rusu M.C. Triantafyllou G. Piagkou M. Toader C. Radoi P.M. Anatomical Variations of the Jugular Bulb: A Critical and Comprehensive Review Medicina 2024 60 1408 10.3390/medicina60091408 39336448 PMC11434453 8. Matsushima K. Funaki T. Komune N. Kiyosue H. Kawashima M. Rhoton A.L. Jr. Microsurgical anatomy of the lateral condylar vein and its clinical significance Neurosurgery 2015 11 (Suppl. 2) 135 145 discussion 145–146 10.1227/NEU.0000000000000570 25255257 9. Spittau B. Millan D.S. El-Sherifi S. Hader C. Singh T.P. Motschall E. Vach W. Urbach H. Meckel S. Dural arteriovenous fistulas of the hypoglossal canal: Systematic review on imaging anatomy, clinical findings, and endovascular management J. Neurosurg. 2015 122 883 903 10.3171/2014.10.JNS14377 25415064 10. Takahashi S. Sakuma I. Omachi K. Otani T. Tomura N. Watarai J. Mizoi K. Craniocervical junction venous anatomy around the suboccipital cavernous sinus: Evaluation by MR imaging Eur. Radiol. 2005 15 1694 1700 10.1007/s00330-004-2597-5 15735974 11. Yamada H. Mizutani K. Akiyama T. Toda M. Extracranial prevertebral venous network of the craniocervical junction: CT-digital subtraction venography analysis Neuroradiology 2022 64 2227 2233 10.1007/s00234-022-02980-3 35596067 12. Takemoto K. Tateshima S. Rastogi S. Gonzalez N. Jahan R. Duckwiler G. Vinuela F. Onyx embolization of anterior condylar confluence dural arteriovenous fistula BMJ Case Rep. 2013 6 e13 10.1136/bcr-2013-010651 PMC3618699 23459160 13. Mortazavi M.M. Tubbs R.S. Riech S. Verma K. Shoja M.M. Zurada A. Benninger B. Loukas M. Cohen Gadol A.A. Anatomy and pathology of the cranial emissary veins: A review with surgical implications Neurosurgery 2012 70 1312 1318 discussion 1318–1319 10.1227/NEU.0b013e31824388f8 22127046 14. Lassalle S.L. Serrano Bernardez V.C. Cifone T. Rimoldi S. Benitez N. Diaz F.D. Garay V. Bendersky M. Compartmentalization of the human cephalic parapharyngeal space: A scoping review Surg. Radiol. Anat. 2025 47 189 10.1007/s00276-025-03698-6 40813940 15. Buch K. Groller R. Nadgir R.N. Fujita A. Qureshi M.M. Sakai O. Variability in the Cross-Sectional Area and Narrowing of the Internal Jugular Vein in Patients without Multiple Sclerosis AJR Am. J. Roentgenol. 2016 206 1082 1086 10.2214/AJR.15.14689 26958902 16. Mumtaz S. Singh M. Surgical review of the anatomical variations of the internal jugular vein: An update for head and neck surgeons Ann. R. Coll. Surg. Engl. 2019 101 2 6 10.1308/rcsann.2018.0185 30322289 PMC6303832 17. Bazaral M. Harlan S. Ultrasonographic anatomy of the internal jugular vein relevant to percutaneous cannulation Crit. Care Med. 1981 9 307 310 10.1097/00003246-198104000-00004 7214938 18. Qin X.H. Zhang H. Mi W.D. Anatomic relationship of the internal jugular vein and the common carotid artery in Chinese people Chin. Med. J. 2010 123 3226 3230 21163120 19. Simka M. Obstructive Malformations of the Internal Jugular Vein Vascular Malformations Khanna A.K. Tiwary S.K. Springer Singapore 2021 295 303 20. Mancini M. Lanzillo R. Liuzzi R. Di Donato O. Ragucci M. Monti S. Salvatore E. Morra V.B. Salvatore M. Internal jugular vein blood flow in multiple sclerosis patients and matched controls PLoS ONE 2014 9 e92730 10.1371/journal.pone.0092730 24675965 PMC3968019 21. Valdueza J.M. von Munster T. Hoffman O. Schreiber S. Einhaupl K.M. Postural dependency of the cerebral venous outflow Lancet 2000 355 200 201 10.1016/S0140-6736(99)04804-7 10675123 22. van Zandwijk J.K. Kuijer K.M. Stassen C.M. Ten Haken B. Simonis F.F.J. Internal Jugular Vein Geometry Under Multiple Inclination Angles with 3D Low-Field MRI in Healthy Volunteers J. Magn. Reson. Imaging 2022 56 1302 1308 10.1002/jmri.28182 35322920 PMC9790417 23. Giordano C.R. Murtagh K.R. Mills J. Deitte L.A. Rice M.J. Tighe P.J. Locating the optimal internal jugular target site for central venous line placement J. Clin. Anesth. 2016 33 198 202 10.1016/j.jclinane.2016.03.070 27555164 24. Ishizuka M. Nagata H. Takagi K. Kubota K. Right internal jugular vein is recommended for central venous catheterization J. Investig. Surg. 2010 23 110 114 10.3109/08941930903469342 20497014 25. Lobato E.B. Sulek C.A. Moody R.L. Morey T.E. Cross-sectional area of the right and left internal jugular veins J. Cardiothorac. Vasc. Anesth. 1999 13 136 138 10.1016/S1053-0770(99)90075-7 10230944 26. Armstrong P.J. Sutherland R. Scott D.H. The effect of position and different manoeuvres on internal jugular vein diameter size Acta Anaesthesiol. Scand. 1994 38 229 231 10.1111/j.1399-6576.1994.tb03879.x 8023661 27. Li L. Li P. London N.R. Jr. Xu H. Chen X. Carrau R.L. Relevance of the Internal Jugular Vein for Surgery in the Upper Parapharyngeal Space Ear Nose Throat J. 2023 10.1177/01455613231197730 37786236 28. Pagano S. Ricciuti V. Mancini F. Barbieri F.R. Chegai F. Marini A. Marruzzo D. Paracino R. Ricciuti R.A. Eagle syndrome: An updated review Surg. Neurol. Int. 2023 14 389 10.25259/SNI_666_2023 38053694 PMC10695462 29. Dinsmore M. Hajat Z. Brenna C.T. Fisher J. Venkatraghavan L. Effect of a neck collar on brain turgor: A potential role in preventing concussions? Br. J. Sports Med. 2022 56 605 607 10.1136/bjsports-2021-103961 34824061 30. Sindelar B. Bailes J. Sherman S. Finan J. Stone J. Lee J. Ahmadian S. Zhou Y. Patel V. Smith D. Effect of Internal Jugular Vein Compression on Intracranial Hemorrhage in a Porcine Controlled Cortical Impact Model J. Neurotrauma 2017 34 1703 1709 10.1089/neu.2016.4648 27573472 31. Sindelar B. Shinners M. Sherman S. Novak K. Erickson K. Patel V. Kubilis P. Smith D. Finan J. Bailes J.E. Internal Jugular Vein Compression: A Novel Approach to Mitigate Blast Induced Hearing Injury Otol. Neurotol. 2017 38 591 598 10.1097/MAO.0000000000001332 28079681 32. Fargen K.M. Midtlien J.P. Belanger K. Hepworth E.J. Hui F.K. The Promise, Mystery, and Perils of Stenting for Symptomatic Internal Jugular Vein Stenosis: A Case Series Neurosurgery 2024 95 400 407 10.1227/neu.0000000000002891 38477595 33. Cha Y.H. Gharib M. Chan K. Karam J. Sternocleidomastoid Omohyoid Entrapment of the Internal Jugular Vein Causing Vertigo and Headaches Clin. Otolaryngol. 2025 50 918 923 10.1111/coa.14325 40270459 PMC12319482 34. Cha Y.-H. Chan K. Gharib M. Karam J. Jugular Variant Bow-Hunter’s Syndrome from Sternocleidomastoid Entrapment of the Internal Jugular Vein (P11-10.001) Neurology 2024 102 6341 10.1212/WNL.0000000000206404 35. Kosnik N. Kowalski T. Lorenz L. Valacer M. Sakthi-Velavan S. Anatomical review of internal jugular vein cannulation Folia Morphol. 2024 83 1 19 10.5603/FM.a2023.0008 36794685 36. Li M. Gao X. Jia Y. Wang Y. Ji X. Meng R. A hemodynamic screening tool for symptomatic internal jugular vein stenosis in J3 segment Phlebology 2025 40 581 589 10.1177/02683555251326031 40068213 37. Mandolesi S. d’Alessandro A. Niglio T. Bruno A. Bernardo B. Mandolesi D. Caroli A. d’Alessandro A. Fedele F. Jugular diameter and venous reflux Ann. Ital. Chir. 2016 87 129 137 27179227 38. Scerrati A. Menegatti E. Zamboni M. Malagoni A.M. Tessari M. Galeotti R. Zamboni P. Internal Jugular Vein Thrombosis: Etiology, Symptomatology, Diagnosis and Current Treatment Diagnostics 2021 11 378 10.3390/diagnostics11020378 33672254 PMC7926529 39. Manta M.D. Rusu M.C. Hostiuc S. Tudose R.C. Manta B.A. Jianu A.M. The vertical topography of the carotid bifurcation—Original study and review Surg. Radiol. Anat. 2024 46 1253 1263 10.1007/s00276-024-03404-y 38847826 PMC11246274 40. Ding J.Y. Zhou D. Pan L.Q. Ya J.Y. Liu C. Yan F. Fan C.Q. Ding Y.C. Ji X.M. Meng R. Cervical spondylotic internal jugular venous compression syndrome CNS Neurosci. Ther. 2020 26 47 54 10.1111/cns.13148 31119898 PMC6930831 41. Zivadinov R. Chung C.P. Potential involvement of the extracranial venous system in central nervous system disorders and aging BMC Med. 2013 11 260 10.1186/1741-7015-11-260 24344742 PMC3866257 42. Franklin K.J. Valves in Veins: An Historical Survey Proc. R. Soc. Med. 1927 21 1 33 10.1177/003591572702100101 19986134 PMC2101797 43. Schell R.M. Cole D.J. Cerebral monitoring: Jugular venous oximetry Anesth. Analg. 2000 90 559 566 10.1097/00000539-200003000-00012 10702437 44. Lichtenstein D. Saifi R. Augarde R. Prin S. Schmitt J.M. Page B. Pipien I. Jardin F. The Internal jugular veins are asymmetric. Usefulness of ultrasound before catheterization Intensive Care Med. 2001 27 301 305 10.1007/s001340000792 11280654 45. Jayaraman M.V. Boxerman J.L. Davis L.M. Haas R.A. Rogg J.M. Incidence of extrinsic compression of the internal jugular vein in unselected patients undergoing CT angiography AJNR Am. J. Neuroradiol. 2012 33 1247 1250 10.3174/ajnr.A2953 22322614 PMC7965500 46. Calota R.N. Rusu M.C. Vrapciu A.D. The External Carotid Artery and the Styloid Process Curr. Health Sci. J. 2024 50 232 236 39380640 10.12865/CHSJ.50.02.08 PMC11459219 47. Rusu M.C. Dumitru C.C. Tudose R.C. Aberrant courses of the occipital artery Surg. Radiol. Anat. 2025 47 135 10.1007/s00276-025-03650-8 40307594 PMC12043729 48. Paturet G. Traite D’anatomie Humaine Masson et Cie Paris, France 1964 49. Contrera K.J. Aygun N. Ward B.K. Gooi Z. Richmon J.D. Internal jugular vein duplication and fenestration: Case series and literature review Laryngoscope 2016 126 1585 1588 10.1002/lary.25743 26498831 PMC5405004 50. Nova-Baeza P. Valenzuela-Fuenzalida J.J. Valdivia-Arroyo R. Becerra-Rodriguez E.S. Escalona-Manzo C. Castano-Gallego Y.T. Luque-Bernal R.M. Oyanedel-Amaro G. Suazo-Santibanez A. Orellana-Donoso M. Systematic Review and Meta-Analysis of Internal Jugular Vein Variants and Their Relationship to Clinical Implications in the Head and Neck Diagnostics 2024 14 2765 10.3390/diagnostics14232765 39682673 PMC11640428 51. Li M. Gao X. Rajah G.B. Liang J. Chen J. Yan F. Bao Y. Jiao L. Zhang H. Ding Y. Styloidectomy and Venous Stenting for Treatment of Styloid-Induced Internal Jugular Vein Stenosis: A Case Report and Literature Review World Neurosurg. 2019 130 129 132 10.1016/j.wneu.2019.06.100 31229748 52. Bergman R. Tubbs R.S. Shoja M.M. Loukas M. Bergman’s Comprehensive Encyclopedia of Human Anatomic Variation John Wiley & Sons Hoboken, NJ, USA 2016 53. Rusu M.C. Vrapciu A.D. Popescu S.A. High bilateral fenestration of the internal jugular vein Surg. Radiol. Anat. 2022 44 703 708 10.1007/s00276-022-02931-w 35396939 54. Majeed T.A. Deshpande R.K. Upadhaya S. Deshmukh S.A. Agenesis of internal jugular vein a cause for concern Indian J. Surg. Oncol. 2010 1 341 342 10.1007/s13193-010-0040-8 22693387 PMC3244256 55. Waltner J.G. Anatomic variations of the lateral and sigmoid sinuses Arch. Otolaryngol. 1944 39 307 312 10.1001/archotol.1944.00680010321002 56. Laff H. Unilateral absence of sigmoid sinus Arch. Otolaryngol. 1930 11 151 157 10.1001/archotol.1930.03560020025002 57. Graham M.D. The jugular bulb. Its anatomic and clinical considerations in contemporary otology Arch. Otolaryngol. 1975 101 560 564 10.1001/archotol.1975.00780380038010 1164239 58. Bilgen C. Kirazli T. Ogut F. Totan S. Jugular bulb diverticula: Clinical and radiologic aspects Otolaryngol. Head Neck Surg. 2003 128 382 386 10.1067/mhn.2003.32 12646841 59. Friedmann D.R. Eubig J. Winata L.S. Pramanik B.K. Merchant S.N. Lalwani A.K. Prevalence of jugular bulb abnormalities and resultant inner ear dehiscence: A histopathologic and radiologic study Otolaryngol. Head Neck Surg. 2012 147 750 756 10.1177/0194599812448615 22619257 60. Wadin K. Wilbrand H. The jugular bulb diverticulum. A radioanatomic investigation Acta Radiol. Diagn. 1986 27 395 401 10.1177/028418518602700405 3096082 61. Wadin K. Thomander L. Wilbrand H. Effects of a high jugular fossa and jugular bulb diverticulum on the inner ear. A clinical and radiologic investigation Acta Radiol. Diagn. 1986 27 629 636 10.1177/028418518602700603 3101406 62. Jahrsdoerfer R.A. Cail W.S. Cantrell R.W. Endolymphatic duct obstruction from a jugular bulb diverticulum Ann. Otol. Rhinol. Laryngol. 1981 90 619 623 10.1177/000348948109000623 6797339 63. Atilla S. Akpek S. Uslu S. Ilgit E.T. Isik S. Computed tomographic evaluation of surgically significant vascular variations related with the temporal bone Eur. J. Radiol. 1995 20 52 56 10.1016/0720-048X(95)00619-2 7556255 64. Ball M. Elloy M. Vaidhyanath R. Pau H. Beware the silent presentation of a high and dehiscent jugular bulb in the external ear canal J. Laryngol. Otol. 2010 124 790 792 10.1017/S0022215109992349 20025812 65. Atmaca S. Elmali M. Kucuk H. High and dehiscent jugular bulb: Clear and present danger during middle ear surgery Surg. Radiol. Anat. 2014 36 369 374 10.1007/s00276-013-1196-z 24002578 66. Sayit A.T. Gunbey H.P. Fethallah B. Gunbey E. Karabulut E. Radiological and audiometric evaluation of high jugular bulb and dehiscent high jugular bulb J. Laryngol. Otol. 2016 130 1059 1063 10.1017/S0022215116009166 27823580 67. Koesling S. Kunkel P. Schul T. Vascular anomalies, sutures and small canals of the temporal bone on axial CT Eur. J. Radiol. 2005 54 335 343 10.1016/j.ejrad.2004.09.003 15899333 68. Wang J. Feng Y. Wang H. Li C. Wu Y. Shi H. Yin S. Chen Z. Prevalence of High Jugular Bulb across Different Stages of Adulthood in A Chinese Population Aging Dis. 2020 11 770 776 10.14336/AD.2020.0215 32765944 PMC7390519 69. Manjila S. Bazil T. Kay M. Udayasankar U.K. Semaan M. Jugular bulb and skull base pathologies: Proposal for a novel classification system for jugular bulb positions and microsurgical implications Neurosurg. Focus 2018 45 E5 10.3171/2018.5.FOCUS18106 29961385 70. Parillo M. Vaccarino F. Mallio C.A. Quattrocchi C.C. Right Condylar Jugular Diverticulum: Contrast-enhanced Computed Tomography Findings of a Rare Anatomical Variant of Jugular Bulb Indian J. Otolaryngol. Head Neck Surg. 2023 75 2257 2259 10.1007/s12070-023-03554-2 37636734 PMC10447777 71. Tudose R.C. Rusu M.C. Triantafyllou G. Piagkou M. Moraru L. Dumitru C.C. Jugular bulb anatomical variations and pneumatization patterns: A comprehensive CBCT analysis Surg. Radiol. Anat. 2024 46 1001 1013 10.1007/s00276-024-03401-1 38847825 PMC11217137 72. Walsh R.M. Lannigan F.J. McGlashan J.A. Bowdler D.A. Jugular bulb phlebectasia Int. J. Pediatr. Otorhinolaryngol. 1993 25 249 254 10.1016/0165-5876(93)90060-G 8436472 73. Nager G.T. Stein S.A. Dorst J.P. Holliday M.J. Kennedy D.W. Diehn K.W. Jabs E.W. Sclerosteosis involving the temporal bone: Clinical and radiologic aspects Am. J. Otolaryngol. 1983 4 1 17 10.1016/S0196-0709(83)80002-7 6673595 74. Amroliwalla F.K. Bennett R.M. An Unusual Complication of Paget’s Disease J. R. Army Med. Corps. 1971 117 20 10.1136/jramc-117-01-05 75. Vachata P. Petrovicky P. Sames M. An anatomical and radiological study of the high jugular bulb on high-resolution CT scans and alcohol-fixed skulls of adults J. Clin. Neurosci. 2010 17 473 478 10.1016/j.jocn.2009.07.121 20167495 76. Juelke E. Butzer T. Yacoub A. Wimmer W. Caversaccio M. Anschuetz L. Assessment of jugular bulb variability based on 3D surface models: Quantitative measurements and surgical implications Surg. Radiol. Anat. 2023 45 315 319 10.1007/s00276-023-03087-x 36732380 PMC9981494 77. Raghuram K. Cure J.K. Harnsberger H.R. Condylar jugular diverticulum J. Comput. Assist. Tomogr. 2009 33 309 311 10.1097/RCT.0b013e31817f8d11 19346866 78. Rusu M.C. Tudose R.C. Vrapciu A.D. Butucescu M. Details of rare and novel anatomical variations in a case with bilateral long styloid processes Rom. J. Morphol. Embryol. 2025 66 399 403 10.47162/RJME.66.2.14 40851251 79. Manta M.D. Jianu A.M. Rusu M.C. Popescu S.A. Launay’s External Carotid Vein Medicina 2021 57 985 10.3390/medicina57090985 34577908 PMC8472331 80. Hage N. Kappagantu K.M. Singh N.K. Ramamourthy B. Anomalous Posterior Branching of the Internal Jugular Vein: A Report of Two Patients Int. J. Oral. Maxillofac. Surg. 2024 53 547 550 10.1016/j.ijom.2023.11.006 38101987 81. Wang Z. Ding J. Bai C. Ding Y. Ji X. Meng R. Clinical Classification and Collateral Circulation in Chronic Cerebrospinal Venous Insufficiency Front. Neurol. 2020 11 913 10.3389/fneur.2020.00913 33071925 PMC7538781 82. Karim N.K.A. Zain N.H.M. An Incidental Finding of Internal Jugular Vein Ectasia on Cervical Spine Magnetic Resonance Imaging Mal. J. Med. Health Sci. 2018 14 82 84 83. Kong K. Jian C. Ji R. Irwin M.G. Management of an incidental finding of right internal jugular vein agenesis Hong Kong Med. J. 2017 23 414 415 10.12809/hkmj166086 28775223 84. Essafti M. Belhadj A. Qamouss Y. Rokhsi R. Aissaoui Y. Agenesis of the left internal jugular vein: An unusual finding during an ultra-sound guided central venous catheterization J. Clin. Anesth. 2018 44 87 88 10.1016/j.jclinane.2017.11.010 29161547 85. Filograna L. Calcagni A. Rossi G. Di Stefano C. Beninati E. Collura A. Floris R. Internal jugular vein agenesis: A rare vascular abnormality and incidental finding. A case of internal jugular vein agenesis in a 52-years old male Radiol. Case Rep. 2019 14 452 455 10.1016/j.radcr.2019.01.008 30733847 PMC6354213 86. Kayiran O. Calli C. Emre A. Soy F.K. Congenital agenesis of the internal jugular vein: An extremely rare anomaly Case Rep. Surg. 2015 2015 637067 10.1155/2015/637067 25821625 PMC4363641 87. Rewari V. Chandran R. Ramachandran R. Trikha A. Absent internal jugular vein: Another case for ultrasound guided vascular access Indian J. Crit. Care Med. 2015 19 53 54 10.4103/0972-5229.148652 25624653 PMC4296414 88. Erdogan M.A. Colak Y.Z. Kacmaz O. Kolu M. Toprak H.I. Determination of Absence of Right Internal Jugular Vein During Ultrasonographic Guided Central Venous Cannulation Turk. J. Anaesthesiol. Reanim. 2017 45 179 180 10.5152/TJAR.2017.92979 28752013 PMC5512401 89. Esteban-Zubero E. García-Muro C. Alatorre-Jiménez M.A. López-García C.A. Marín-Medina A. Thrombosis of the internal jugular vein, a rare entity: A case report and brief review of the literature J. Acute Dis. 2023 12 80 82 10.4103/2221-6189.374315 90. Luis S.A.A. Garcia L. Isabel G.G.M. Tejera H.A. Loro P.J. Fernandez A.M. Right jugular vein agenesis. a challenging case for experienced endocrine surgeons Endocr. Abstr. Biosci. 2024 99 EP966 10.1530/endoabs.99.EP966 91. Miller B.R. Absence of a right internal jugular vein detected by ultrasound imaging Paediatr. Anaesth. 2011 21 91 10.1111/j.1460-9592.2010.03472.x 21155934 92. Amin M.A. Nahin S. Hawlader M.D.H. Persistent headaches sometimes concern incidental findings: A rare case of internal jugular vein agenesis in a 32-year-old man Clin. Case Rep. 2022 10 e6423 10.1002/ccr3.6423 36237945 PMC9536497 93. Kurbanova A. Polat Balkan E. Incebeyaz B. Aksoy S. Orhan K. Retrospective evaluation of ponticulus posticus prevalence, sella turcica types, and stylohyoid complex calcifications in a group of Turkish population Anat. Sci. Int. 2025 100 54 63 10.1007/s12565-024-00785-3 38922560 94. Andrei F. Motoc A.G. Didilescu A.C. Rusu M.C. A 3D cone beam computed tomography study of the styloid process of the temporal bone Folia Morphol. 2013 72 29 35 10.5603/FM.2013.0005 23749708 95. Dabrowski P. Gronkiewicz S. Solinski D. Pers A. Lachowski K. Domagala Z. A case of elongated styloid process in a modern-age skull from Puerto Cabello, Venezuela Folia Morphol. 2015 74 475 478 10.5603/FM.2015.0110 26620508 96. de Bakker B.S. de Bakker H.M. Soerdjbalie-Maikoe V. Dikkers F.G. Variants of the hyoid-larynx complex, with implications for forensic science and consequence for the diagnosis of Eagle’s syndrome Sci. Rep. 2019 9 15950 10.1038/s41598-019-52476-z 31685955 PMC6828966 97. Rusu M.C. Tudose R.C. Vrapciu A.D. Popescu Ş.A. Lowered hyoid bone overlapping the thyroid cartilage in CT angiograms Surg. Radiol. Anat. 2024 46 333 339 10.1007/s00276-024-03300-5 38315210 98. Ghosh L.M. Dubey S.P. The syndrome of elongated styloid process Auris Nasus Larynx 1999 26 169 175 10.1016/S0385-8146(98)00079-0 10214896 99. Guimaraes A.C. Pozza D.H. Guimaraes A.S. Prevalence of morphological and structural changes in the stylohyoid chain J. Clin. Exp. Dent. 2020 12 e1027 e1032 10.4317/jced.57186 33262867 PMC7680564 100. Sultan S. Acharya Y. Soliman O. Hynes N. Stylohyoid Eagle syndrome and EXTracranial INternal Carotid arTery pseudoaneurysms (EXTINCT) with internal jugular vein nutcracker syndrome: A challenging clinical scenario BMJ Case Rep. 2022 15 e249558 10.1136/bcr-2022-249558 PMC9024270 35450880 101. Guimarães S.M.R. Carvalho A.C.P. Guimarães J.P. Gomes M.B. Cardoso M.d.M.M. Reis H.N. Prevalence of morphological alterations of the styloid process in patients with temporomandibular joint disorder Radiol. Bras. 2006 39 407 411 10.1590/S0100-39842006000600007 102. Langlais R.P. Langland O.E. Nortjé C. Diagnostic Imaging of the Jaws Williams & Wilkins Baltimore, MD, USA 1995 103. Altındağ A. Eren H. Küçükkalem M. Altındağ Ö. Prevalence and pattern of stylohyoid chain complex on panoramic radiographs: A retrospective study Clin. Exp. Health Sci. 2022 12 906 912 10.33808/clinexphealthsci.980990 104. Triantafyllou G. Paschopoulos I. Duparc F. Tsakotos G. Papadopoulos-Manolarakis P. Piagkou M. The Anatomy of the Stylohyoid Chain: A Systematic Review with Meta-Analysis Diagnostics 2025 15 925 10.3390/diagnostics15070925 40218275 PMC11988981 105. Balcioglu H.A. Kilic C. Akyol M. Ozan H. Kokten G. Length of the styloid process and anatomical implications for Eagle’s syndrome Folia Morphol. 2009 68 265 270 19950078 106. Onbas O. Kantarci M. Murat Karasen R. Durur I. Cinar Basekim C. Alper F. Okur A. Angulation, length, and morphology of the styloid process of the temporal bone analyzed by multidetector computed tomography Acta Radiol. 2005 46 881 886 10.1080/02841850500335085 16392614 107. Jung T. Tschernitschek H. Hippen H. Schneider B. Borchers L. Elongated styloid process: When is it really elongated? Dentomaxillofac Radiol. 2004 33 119 124 10.1259/dmfr/13491574 15314005 108. Munoz-Leija M.A. Ordonez Rivas F.O. Barrera-Flores F.J. Trevino-Gonzalez J.L. Pinales-Razo R. Guzman-Lopez S. Elizondo-Omana R.E. Quiroga-Garza A. A proposed extension to the elongated styloid process definition: A morphological study with high-resolution tomography computer Morphologie 2020 104 117 124 10.1016/j.morpho.2020.01.005 32070640 109. Mantovani G. Zangrossi P. Flacco M.E. Di Domenico G. Nastro Siniscalchi E. De Ponte F.S. Maugeri R. De Bonis P. Cavallo M.A. Zamboni P. Styloid Jugular Nutcracker: The Possible Role of the Styloid Process Spatial Orientation-A Preliminary Morphometric Computed Study Diagnostics 2023 13 298 10.3390/diagnostics13020298 36673108 PMC9857444 110. Angelini C. Mantovani G. Cavallo M.A. Scerrati A. De Bonis P. Neurosurgical implications of the Jugular Vein Nutcracker Veins Lymphat. 2023 12 11892-1 11892-10 10.4081/vl.2023.11892 111. Dashti S.R. Nakaji P. Hu Y.C. Frei D.F. Abla A.A. Yao T. Fiorella D. Styloidogenic jugular venous compression syndrome: Diagnosis and treatment: Case report Neurosurgery 2012 70 E795 E799 10.1227/NEU.0b013e3182333859 21866063 112. Zhang F.L. Zhou H.W. Guo Z.N. Yang Y. Eagle Syndrome as a Cause of Cerebral Venous Sinus Thrombosis Can. J. Neurol. Sci. 2019 46 344 345 10.1017/cjn.2019.17 30932799 113. Alpoz E. Akar G.C. Celik S. Govsa F. Lomcali G. Prevalence and pattern of stylohyoid chain complex patterns detected by panoramic radiographs among Turkish population Surg. Radiol. Anat. 2014 36 39 46 10.1007/s00276-013-1137-x 23689822 114. Penfold D. Leslie S.W. Lotfollahzadeh S. Nutcracker Syndrome and Left Renal Vein Entrapment StatPearls Publishing Treasure Island, FL, USA 2025 32644615 115. Damen N.S. Hostiuc S. Jianu A.M. Manta B.A. Rusu M.C. Dobra M.A. Anatomical variants of the retroaortic left renal vein Ann. Anat. 2024 251 152170 10.1016/j.aanat.2023.152170 37844738 116. He Y. Wu Z. Chen S. Tian L. Li D. Li M. Jin W. Zhang H. Nutcracker syndrome—how well do we know it? Urology 2014 83 12 17 10.1016/j.urology.2013.08.033 24139744 117. Eagle W.W. Elongated styloid processes: Report of two cases Arch. Otolaryngol. 1937 25 584 587 10.1001/archotol.1937.00650010656008 118. Eagle W.W. Elongated styloid process; further observations and a new syndrome Arch. Otolaryngol. 1948 47 630 640 10.1001/archotol.1948.00690030654006 18894764 119. Badhey A. Jategaonkar A. Anglin Kovacs A.J. Kadakia S. De Deyn P.P. Ducic Y. Schantz S. Shin E. Eagle syndrome: A comprehensive review Clin. Neurol. Neurosurg. 2017 159 34 38 10.1016/j.clineuro.2017.04.021 28527976 120. Patil S. Ghosh S. Vasudeva N. Morphometric study of the styloid process of temporal bone J. Clin. Diagn. Res. 2014 8 AC04 AC06 10.7860/JCDR/2014/9419.4867 PMC4225865 25386413 121. Tadjer J. Bejot Y. Vascular variant of Eagle syndrome: A review Front. Neurol. 2024 15 1463275 10.3389/fneur.2024.1463275 39440251 PMC11493652 122. Farina R. Foti P.V. Pennisi I. Conti A. Meli G.A. Vasile T. Gozzo C. Tallamona E. Ini C. Palmucci S. Stylo-Jugular Venous Compression Syndrome: Lessons Based on a Case Report Am. J. Case Rep. 2021 22 e932035 10.12659/AJCR.932035 34428194 PMC8404167 123. Suzuki Y. Toma N. Kuroda Y. Miura Y. Shiba M. Yasuda R. Suzuki H. Dural Arteriovenous Fistula Formation as Eagle Jugular Syndrome: A Case Report and Literature Review World Neurosurg. 2020 144 154 161 10.1016/j.wneu.2020.08.214 32891845 124. Zamboni P. Scerrati A. Menegatti E. Galeotti R. Lapparelli M. Traina L. Tessari M. Ciorba A. De Bonis P. Pelucchi S. The eagle jugular syndrome BMC Neurol. 2019 19 333 10.1186/s12883-019-1572-3 31864313 PMC6925502 125. Woo H.G. Ryu J. Kim E.J. Lee K.M. Styloidogenic jugular venous compression syndrome as a source of cerebral venous sinus thrombosis Quant. Imaging Med. Surg. 2022 12 4316 4319 10.21037/qims-22-106 35919052 PMC9338375 126. Mejia-Vergara A.J. Sultan W. Kostas A. Mulholland C.B. Sadun A. Styloidogenic Jugular Venous Compression Syndrome with Papilloedema: Case Report and Review of the Literature Neuroophthalmology 2022 46 54 58 10.1080/01658107.2021.1887288 35095137 PMC8794243 127. Mooney J. Lepard J. Akbari S.H.A. Johnston J.M. Styloidogenic jugular venous compression syndrome: A case report and review of the literature Childs Nerv. Syst. 2020 36 3135 3139 10.1007/s00381-020-04622-6 32346788 128. Pokeerbux M.R. Delmaire C. Morell-Dubois S. Demondion X. Lambert M. Styloidogenic compression of the internal jugular vein, a new venous entrapment syndrome? Vasc. Med. 2020 25 378 380 10.1177/1358863X20902842 32186245 129. Zhao X. Cavallo C. Hlubek R.J. Mooney M.A. Belykh E. Gandhi S. Moreira L.B. Lei T. Albuquerque F.C. Preul M.C. Styloidogenic Jugular Venous Compression Syndrome: Clinical Features and Case Series Oper. Neurosurg. 2019 17 554 561 10.1093/ons/opz012 31329946 130. Cantin L.M. Suazo Galdames I. Eagle syndrome or stylohyoid syndrome? Neurologia 2011 26 254 10.1016/S2173-5808(11)70054-2 21163220 131. Camarda A.J. Deschamps C. Forest D. II. Stylohyoid chain ossification: A discussion of etiology Oral Surg. Oral Med. Oral Pathol. 1989 67 515 520 10.1016/0030-4220(89)90265-X 2497420 132. Ho S. Luginbuhl A. Finden S. Curry J.M. Cognetti D.M. Styloid/C1 transverse process juxtaposition as a cause of Eagle’s syndrome Head Neck 2015 37 E153 E156 10.1002/hed.24024 25726731 133. Scerrati A. Norri N. Mongardi L. Dones F. Ricciardi L. Trevisi G. Menegatti E. Zamboni P. Cavallo M.A. De Bonis P. Styloidogenic-cervical spondylotic internal jugular venous compression, a vascular disease related to several clinical neurological manifestations: Diagnosis and treatment-a comprehensive literature review Ann. Transl. Med. 2021 9 718 10.21037/atm-20-7698 33987416 PMC8106058 134. Gitomer S.A. Giannoni C.M. Canadas K.T. Pediatric lymphedema caused by diffuse cervical lymphadenopathy: A case report and review of the literature Int. J. Pediatr. Otorhinolaryngol. 2016 87 67 70 10.1016/j.ijporl.2016.05.028 27368445 135. Guan J. Song S. Wang W. Ji X. Meng R. Cerebral venous sinus thrombosis due to external compression of internal jugular vein J. Int. Med. Res. 2021 49 3000605211006609 10.1177/03000605211006609 33845597 PMC8047086 136. Xiong L. Wang Z. Intracranial hypertension due to bilateral internal jugular venous occlusion in eagle syndrome: A case report Heliyon 2023 9 e16188 10.1016/j.heliyon.2023.e16188 37234660 PMC10208828 137. Gianesini S. Menegatti E. Mascoli F. Salvi F. Bastianello S. Zamboni P. The omohyoid muscle entrapment of the internal jugular vein. A still unclear pathogenetic mechanism Phlebology 2014 29 632 635 10.1177/0268355513489549 23761870 138. Rusu M.C. Tudose R.C. Vrapciu A.D. Toader C. Popescu S.A. Anatomical Variations of the External Jugular Vein: A Pictorial and Critical Review Medicina 2023 59 622 10.3390/medicina59030622 36984623 PMC10052824 139. San Millan Ruiz D. Gailloud P. Rufenacht D.A. Delavelle J. Henry F. Fasel J.H. The craniocervical venous system in relation to cerebral venous drainage AJNR Am. J. Neuroradiol. 2002 23 1500 1508 12372739 PMC7976803 140. Reis C.V. Deshmukh V. Zabramski J.M. Crusius M. Desmukh P. Spetzler R.F. Preul M.C. Anatomy of the mastoid emissary vein and venous system of the posterior neck region: Neurosurgical implications Neurosurgery 2007 61 193 200 discussion 201 10.1227/01.neu.0000303217.53607.d9 18091233 141. Mandolesi S. d’Alessandro A. Ciccone M.M. Zito A. Manconi E. Niglio T. Orsini A. Mandolesi D. d’Alessandro A. Fedele F. Analysis of patients with chronic cerebro-spinal venous insufficiency and multiple sclerosis: Identification of parameters of clinical severity Veins Lymphat. 2015 4 4570 10.4081/vl.2015.4570 142. Piraino D. Garofalo G. Faletra A. Messina A. The omohyoid and sternocleidomastoid muscles entrapment of the internal jugular vein: Which role in Mèniére disease patients? Treatment perspective description Veins Lymphat. 2018 7 7760 10.4081/vl.2018.7760 143. Simka M. Majewski E. Fortuna M. Zaniewski M. Internal jugular vein entrapment in a multiple sclerosis patient Case Rep. Surg. 2012 2012 293568 10.1155/2012/293568 23097738 PMC3477533 144. Monnier H. Owashi K. Liu P. Metanbou S. Capel C. Baledent O. Quantification of the Dynamics of the Vascular Flows in the Cerebral Arterial and Venous Trees Biomedicines 2025 13 1106 10.3390/biomedicines13051106 40426933 PMC12109075 145. Das K.K. Mehrotra A. Sahu R.N. Srivastava A.K. Jaiswal A.K. Behari S. Unilateral lateral mass hypertrophy: An extremely rare congenital anomaly of atlas J. Craniovertebral Junction Spine 2013 4 73 75 10.4103/0974-8237.128534 PMC3980560 24744566 146. Onishi E. Sakamoto A. Murata S. Nakamura S. Matsushita M. Unilateral atlantal lateral mass hypertrophy associated with atlanto-occipital fusion Eur. Spine J. 2013 22 (Suppl. 3) S429 S433 10.1007/s00586-012-2574-7 23161418 PMC3641273 147. Ozkara B.B. Karabacak M. Aygun A.A. External musculoskeletal compression of the internal jugular vein: A systematic review Acta Phlebol. 2022 23 43 51 10.23736/S1593-232X.22.00516-1 148. Bolognese P.A. Caton M.T. Ruhoy I.S. Bloom S. Amaru J.N. Biggins J.B. Nayyar N.S. A case report on symptomatic internal jugular venous compression: Clinical and radiographic improvement with bilateral C1 tubercle resection Med. Res. Arch. 2024 12 5415 10.18103/mra.v12i5.5415 149. Oushy S. Wald J.T. Janus J. Fulgham J.R. Lanzino G. Dynamic Internal Jugular Vein Compression by Hypertrophic Hyoid Bone: Management and Outcomes Cureus 2020 12 e7445 10.7759/cureus.7445 32351824 PMC7186089 150. Ichiyama S. Nomura O. Ishizawa Y. Disruption of the internal jugular vein by subcutaneous emphysema BMJ Case Rep. 2023 16 e253066 10.1136/bcr-2022-253066 PMC10759054 38160028 151. Hartl D.M. Zafereo M.E. Kowalski L.P. Randolph G.W. Olsen K.D. Fernandez-Alvarez V. Nixon I.J. Shaha A.R. Angelos P. Shah J.P. Occlusion of the internal jugular vein in differentiated thyroid carcinoma: Causes and diagnosis Eur. J. Surg. Oncol. 2021 47 1552 1557 10.1016/j.ejso.2021.02.021 33642089 152. Smith D.W. Bailes J.E. Fisher J.A. Robles J. Turner R.C. Mills J.D. Internal jugular vein compression mitigates traumatic axonal injury in a rat model by reducing the intracranial slosh effect Neurosurgery 2012 70 740 746 10.1227/NEU.0b013e318235b991 21904255 153. Mannix R. Morriss N.J. Conley G.M. Meehan W.P. 3rd Nedder A. Qiu J. Float J. DiCesare C.A. Myer G.D. Internal Jugular Vein Compression Collar Mitigates Histopathological Alterations after Closed Head Rotational Head Impact in Swine: A Pilot Study Neuroscience 2020 437 132 144 10.1016/j.neuroscience.2020.04.009 32283181 154. Delgadillo B.E. Montz F. Ward B. Jr. Herson A.B. Toldi J.P. Current Evidence for the Use of Jugular Vein Compression Collars in Sport: A Systematic Review Curr. Sports Med. Rep. 2025 24 18 27 10.1249/JSR.0000000000001223 39749954 155. Yeoh T.Y. Venkatraghavan L. Fisher J.A. Meineri M. Internal jugular vein blood flow in the upright position during external compression and increased central venous pressure: An ultrasound study in healthy volunteers Can. J. Anaesth. 2017 64 854 859 10.1007/s12630-017-0903-3 28577164 156. Yang K. Shah K. Begley S.L. Prashant G. White T. Costantino P. Patsalides A. Lo S.L. Dehdashti A.R. Extreme lateral infracondylar approach for internal jugular vein compression syndrome: A case series with preliminary clinical outcomes Acta Neurochir. 2023 165 3445 3454 10.1007/s00701-023-05779-0 37656307 157. Fritch C. Voronovich Z. Carlson A.P. C1 Transverse Process Resection for Management of Jugular Stenosis Oper. Neurosurg. 2020 19 E209 E213 10.1093/ons/opaa032 32181484 158. Succop B. Jr. Thompson N.J. Dedmon M.M. Gelinne A. Selleck A. Reed S. Sindelar M.B.D. Noninvasive Treatment of Venous Pulsatile Tinnitus with an Internal Jugular Vein Compression Collar Laryngoscope 2024 134 3342 3348 10.1002/lary.31326 38345081 159. Myer G.D. Yuan W. Barber Foss K.D. Smith D. Altaye M. Reches A. Leach J. Kiefer A.W. Khoury J.C. Weiss M. The Effects of External Jugular Compression Applied during Head Impact Exposure on Longitudinal Changes in Brain Neuroanatomical and Neurophysiological Biomarkers: A Preliminary Investigation Front. Neurol. 2016 7 74 10.3389/fneur.2016.00074 27375546 PMC4893920 160. Hatt A. Cheng S. Tan K. Sinkus R. Bilston L.E. MR Elastography Can Be Used to Measure Brain Stiffness Changes as a Result of Altered Cranial Venous Drainage During Jugular Compression AJNR Am. J. Neuroradiol. 2015 36 1971 1977 10.3174/ajnr.A4361 26045579 PMC7965045 161. Diekfuss J.A. Yuan W. Barber Foss K.D. Dudley J.A. DiCesare C.A. Reddington D.L. Zhong W. Nissen K.S. Shafer J.L. Leach J.L. The effects of internal jugular vein compression for modulating and preserving white matter following a season of American tackle football: A prospective longitudinal evaluation of differential head impact exposure J. Neurosci. Res. 2021 99 423 445 10.1002/jnr.24727 32981154 162. Myer G.D. Barber Foss K. Thomas S. Galloway R. DiCesare C.A. Dudley J. Gadd B. Leach J. Smith D. Gubanich P. Altered brain microstructure in association with repetitive subconcussive head impacts and the potential protective effect of jugular vein compression: A longitudinal study of female soccer athletes Br. J. Sports Med. 2019 53 1539 1551 10.1136/bjsports-2018-099571 30323056 163. Brieck K.A. Brieck Z.J. Ashby J.A. Phelps O.C. Cernak I. A Narrative Review of the Effects of Internal Jugular Vein Compression on Brain Structure and Function During Periods of Head Impact Cureus 2025 17 e77625 10.7759/cureus.77625 39834663 PMC11743508 164. Yuan W. Diekfuss J.A. Barber Foss K.D. Dudley J.A. Leach J.L. Narad M.E. DiCesare C.A. Bonnette S. Epstein J.N. Logan K. High School Sports-Related Concussion and the Effect of a Jugular Vein Compression Collar: A Prospective Longitudinal Investigation of Neuroimaging and Neurofunctional Outcomes J. Neurotrauma 2021 38 2811 2821 10.1089/neu.2021.0141 34375130 165. Nonaka T. Sakata K. Abe T. Hattori G. Orito K. Miyagi N. Tokutomi T. Morioka M. The eagle jugular syndrome as the cause of delayed intracranial hemorrhage after microvascular decompression for hemifacial spasm: A case report Surg. Neurol. Int. 2021 12 584 10.25259/SNI_808_2021 34992901 PMC8720428 166. Li M. Su C. Fan C. Chan C.C. Bai C. Meng R. Internal jugular vein stenosis induced by tortuous internal carotid artery compression: Two case reports and literature review J. Int. Med. Res. 2019 47 3926 3933 10.1177/0300060519860678 31304848 PMC6726807 167. Han A.Y. Lentz J.F. Kuan E.C. Araya H.H. Kamgar M. A Case of Reactive Cervical Lymphadenopathy with Fat Necrosis Impinging on Adjacent Vascular Structures Case Rep. Otolaryngol. 2016 2016 6019501 10.1155/2016/6019501 27840758 PMC5093268 168. Bai C. Ding J. Da Z. Sun J. Liu C. Pan L. Ya J. Wang Z. Guan J. Jin K. Probable risk factors of internal jugular vein stenosis in Chinese patients-A real-world cohort study Clin. Neurol. Neurosurg. 2020 191 105678 10.1016/j.clineuro.2020.105678 31955125 169. Liu Y. Wang X.J. Wang J.L. Liu L.H. Zhao S.R. Yu S.J. Yang B.B. Xu Q.L. Li J.K. Wang S.R. Internal Jugular Vein Thrombosis After Microwave Ablation of Cervical Lymph Node Metastasis in Papillary Thyroid Microcarcinoma: A Case Report Front. Endocrinol. 2022 13 792715 10.3389/fendo.2022.792715 PMC9092279 35574012 170. Weeraddana P. Nepal N. Saleh M. Sandeep F. Weerasooriya N. Dandwani M. Ma E. Internal Jugular Venous Thrombosis with Superior Vena Cava Syndrome: A Rare First Presentation of Gray Zone Lymphoma Cureus 2023 15 e37096 10.7759/cureus.37096 37153303 PMC10158559 171. Illuminati G. Pasqua R. Nardi P. Fratini C. Minni A. Giordano C. Resection for Internal Jugular Vein Thrombosis and Cervical Lymph Nodes’ Involvement from Gastric Cancer Anticancer. Res. 2020 40 2889 2893 10.21873/anticanres.14265 32366439 172. Bandara A.R. Wimalarathna H. Kalupahana R. Gunathilake S.S. Internal jugular venous thrombosis due to Trousseau’s syndrome as the presenting feature of metastatic prostate carcinoma: A case report J. Med. Case Rep. 2016 10 104 10.1186/s13256-016-0884-9 27097872 PMC4839162 173. Paulsen F. Tillmann B. Christofides C. Richter W. Koebke J. Curving and looping of the internal carotid artery in relation to the pharynx: Frequency, embryology and clinical implications J. Anat. 2000 197 Pt 3 373 381 10.1046/j.1469-7580.2000.19730373.x 11117624 PMC1468139 174. Yang Y. Wang X. Mao W. He T. Xiong Z. Anatomical relationship between the omohyoid muscle and the internal jugular vein on ultrasound guidance BMC Anesthesiol. 2022 22 181 10.1186/s12871-022-01723-4 35698062 PMC9190082 175. De Bonis P. Menegatti E. Cavallo M.A. Sisini F. Trapella G. Scerrati A. Zamboni P. JEDI (jugular entrapment, dilated ventricles, intracranial hypertension) syndrome: A new clinical entity? A case report Acta Neurochir. 2019 161 1367 1370 10.1007/s00701-019-03908-2 31025176 176. Patra P. Gunness T.K. Robert R. Rogez J.M. Heloury Y. Le Hur P.A. Leborgne J. Laude M. Barbin J.Y. Physiologic variations of the internal jugular vein surface, role of the omohyoid muscle, a preliminary echographic study Surg. Radiol. Anat. 1988 10 107 112 10.1007/BF02307818 3135615 177. Frau G.N. Pagani R. Maronato F. Agarwal N. Contarino C. Toro E.F. The role of omohyoid muscle entrapment of the internal jugular vein and is surgical transection in Ménière’s disease and other inner ear disorders Veins Lymphat. 2019 8 35 10.4081/vl.2019.8431 178. Brinjikji W. Graffeo C.S. Perry A. Zimmerman T. Janus J.R. Morris P.P. Cascino G.D. Lanzino G. Moving target: Transient rotational stenosis precipitating jugular bow hunter’s syndrome J. Neurointerv. Surg. 2017 9 e28 10.1136/neurintsurg-2016-012827.rep 28062802 179. Mortazavi M.M. Griessenauer C.J. Krishnamurthy S. Verma K. Loukas M. Tubbs R.S. The inferior petrosal sinus: A comprehensive review with emphasis on clinical implications Childs Nerv. Syst. 2014 30 831 834 10.1007/s00381-014-2378-7 24526343 180. Mitsuhashi Y. Nishio A. Kawahara S. Ichinose T. Yamauchi S. Naruse H. Matsuoka Y. Ohata K. Hara M. Morphologic evaluation of the caudal end of the inferior petrosal sinus using 3D rotational venography AJNR Am. J. Neuroradiol. 2007 28 1179 1184 10.3174/ajnr.A0489 17569984 PMC8134147 181. Zhang W.G. Ye Y.Y. Chen J.H. Chen R. Kuang L.Q. Li X. Imaging study of the long extracranial extension of the inferior petrosal sinus with MSCT Clin. Anat. 2010 23 160 167 10.1002/ca.20907 20014396 182. Gailloud P. Fasel J.H. Muster M. Desarzens F. Ruefenacht D.A. Termination of the inferior petrosal sinus: An anatomical variant Clin. Anat. 1997 10 92 96 10.1002/(SICI)1098-2353(1997)10:2&#x0003c;92::AID-CA4&#x0003e;3.0.CO;2-V 9058015 183. Benndorf G. Campi A. Aberrant inferior petrosal sinus: Unusual transvenous approach to the cavernous sinus Neuroradiology 2002 44 158 163 10.1007/s002340100659 11942369 184. Shukla I. Agarwal A. Changanath Kader R. Internal Jugular Vein Duplication: A series of Seven Cases and Review of Literature Iran. J. Otorhinolaryngol. 2025 37 91 94 40162378 10.22038/ijorl.2024.82759.3789 PMC11949435 185. Ibrahim B. Berania I. Moubayed S.P. Christopoulos A. Ayad T. Internal Jugular Vein Duplication: Anatomic Relationship with the Spinal Accessory Nerve J. Oral. Maxillofac. Surg. 2016 74 1502.e1 1502.e4 10.1016/j.joms.2016.03.002 27055229 186. Triantafyllou G. Vassiou K. Olewnik L. Duparc F. Tsakotos G. Vlychou M. Zielinska N. Piagkou M. Internal Jugular Vein Fenestration and Duplication J. Craniofac Surg. 2024 36 1790 1792 10.1097/SCS.0000000000010991 39630963 187. Wang X. Peng L. Guo H. Hernesniemi J. Xiong X. Andrade-Barazarte H. Qian R. Internal Jugular Vein Fenestration and Duplication: Anatomical Findings, Prevalence, and Literature Review Front. Surg. 2020 7 593367 10.3389/fsurg.2020.593367 33282909 PMC7691239 188. Rossi A. Tortori-Donati P. Internal jugular vein phlebectasia and duplication: Case report with magnetic resonance angiography features Pediatr. Radiol. 2001 31 134 10.1007/s002470000350 11214685 189. Jain V. Sureka K. Satheesh G. Venugopalan V. Durairaj D. Duplication of internal jugular vein—An incidental finding Oral Oncol. Rep. 2025 13 100699 10.1016/j.oor.2024.100699 190. Prades J.M. Timoshenko A. Dumollard J.M. Durand M. Merzougui N. Martin C. High duplication of the internal jugular vein: Clinical incidence in the adult and surgical consequences, a report of three clinical cases Surg. Radiol. Anat. 2002 24 129 132 10.1007/s00276-002-0020-y 12197023 191. Greene P.F. Internal jugular vein compression: A benign entity or an underappreciated phenomenon? eNeurologicalSci 2025 40 100577 10.1016/j.ensci.2025.100577 40792078 PMC12335959 192. Motoyama Y. Sasaki H. Nakajima T. Hayami H. Matsuoka R. Fukutome K. Tei R. Shin Y. Aketa S. Eagle jugular syndrome accompanied by de novo brainstem cavernous malformation: A case-based systematic review Acta Neurochir. 2024 166 20 10.1007/s00701-024-05900-x 38231302 193. Frydrychowski A.F. Winklewski P.J. Guminski W. Influence of acute jugular vein compression on the cerebral blood flow velocity, pial artery pulsation and width of subarachnoid space in humans PLoS ONE 2012 7 e48245 10.1371/journal.pone.0048245 23110218 PMC3480498 194. Bosnjak R. Kordas M. Circulatory effects of internal jugular vein compression: A computer simulation study Med. Biol. Eng. Comput. 2002 40 423 431 10.1007/BF02345075 12227629 195. Potts D.G. Deonarine V. Effect of positional changes and jugular vein compression on the pressure gradient across the arachnoid villi and granulations of the dog J. Neurosurg. 1973 38 722 728 10.3171/jns.1973.38.6.0722 4710651 196. Yoon H.K. Lee H.K. Jeon Y.T. Hwang J.W. Lim S.M. Park H.P. Clinical significance of the cross-sectional area of the internal jugular vein J. Cardiothorac. Vasc. Anesth. 2013 27 685 689 10.1053/j.jvca.2012.10.007 23642889 197. Lorchirachoonkul T. Ti L.K. Manohara S. Lye S.T. Tan S.A. Shen L. Kang D.S. Anatomical variations of the internal jugular vein: Implications for successful cannulation and risk of carotid artery puncture Singap. Med. J. 2012 53 325 328 22584972 198. Sznajder J.I. Zveibil F.R. Bitterman H. Weiner P. Bursztein S. Central vein catheterization. Failure and complication rates by three percutaneous approaches Arch. Intern. Med. 1986 146 259 261 10.1001/archinte.1986.00360140065007 3947185 199. Lim C.L. Keshava S.N. Lea M. Anatomical variations of the internal jugular veins and their relationship to the carotid arteries: A CT evaluation Australas. Radiol. 2006 50 314 318 10.1111/j.1440-1673.2006.01589.x 16884415 200. Denys B.G. Uretsky B.F. Anatomical variations of internal jugular vein location: Impact on central venous access Crit. Care Med. 1991 19 1516 1519 10.1097/00003246-199112000-00013 1959371 201. Wang M. Wu X. Lan D. Zhou D. Ding Y. Ji X. Meng R. Differentiation between anatomical slenderness and acquired stenosis of the internal jugular veins CNS Neurosci. Ther. 2022 28 1849 1860 10.1111/cns.13924 35919952 PMC9532925 202. Fargen K.M. Midtlien J.P. Margraf C. Kiritsis N.R. Chang E. Hui F. Dynamic internal jugular vein venography: A descriptive study in 89 patients with suspected cerebral venous outflow disorders J. Neurointerv. Surg. 2025 17 646 652 10.1136/jnis-2024-021734 38782567 203. Siniscalchi E.N. Raffa G. Germanò A. De Ponte F.S. Is eagle jugular syndrome an underestimated potentially life-threatening disease? Can. J. Neurol. Sci. 2020 47 581 582 10.1017/cjn.2020.48 32127070 204. Petersingham G. Shrestha N. Elliott M. Allan R.S. Parker G. Camp L.V. Rao P.J. Invasive surgical management of cervical internal jugular venous compression: A literature review J. Clin. Neurosci. 2025 137 111304 10.1016/j.jocn.2025.111304 40347758 205. Werheim E. Sokol Z. Brown D. Oselkin M. Eagle syndrome causing cerebral sinus hypertension: Case report Radiol. Case Rep. 2023 18 2758 2762 10.1016/j.radcr.2023.05.023 37334325 PMC10275739 206. Pang S. Kolarich A.R. Brinjikji W. Nakaji P. Hepworth E. Hui F. Interventional and surgical management of internal jugular venous stenosis: A narrative review J. Neurointerv. Surg. 2022 14 503 507 10.1136/neurintsurg-2021-017937 34429346 Figure 1 Axial angioCT slice through the “tunnel” of the internal jugular vein at C1. Inferior view. Original evidence. 1. styloid process; 2. occipital artery; 3. posterior belly of the digastric muscle; 4. transverse process of the atlas; 5. vertebral artery; 6. internal jugular vein; 7. dens axis; 8. mastoid process; 9. parotid gland; 10. mandibular ramus; 11. internal carotid artery; 12. stylopharyngeus muscle; 13. styloglossus muscle. Figure 2 The retrostyloid course of the external carotid artery brings it anteriorly to the internal jugular vein. Right side. Original evidence. ( A B Figure 3 Fenestrated right internal jugular vein, with the anterior arm of the fenestration receiving the right external carotid vein (Launay’s vein). Original evidence. Three-dimensional volume rendering. Right anterolateral view. 1. internal carotid artery; 2. styloid process; 3. external carotid artery; 4. Launay’s external carotid vein; 5. facial artery; 6. lingual artery; 7. common carotid artery; 8. lingual vein; 9. fenestration of the internal jugular vein; 10. occipital artery. Figure 4 Agenesis of the left internal jugular vein, compensated via the right sigmoid sinus and internal jugular vein. Three-dimensional renderings: Original evidence. ( A B C Figure 5 Posteriorly angulated styloid processes (SPs) (vertical angles < 27°) compress the internal jugular veins bilaterally. Original evidence. ( A B C D E A B D A C E Figure 6 Correlated axial and oblique sagittal slices through the stylohyoid chain and the compressed segment of the internal jugular vein that demonstrates the tip pencil sign. 1. Medial pole of the mandibular condyle; 2. lateral pterygoid muscle; 3. maxillary artery; 4. stylohyoid ligament; 5. styloid process; 6. ossified stylohyoid ligament; 7. external carotid artery; 8. compressed internal jugular vein; 9. transverse process of the atlas; 10. internal carotid artery. Figure 7 Bilateral long inferior petrosal sinuses of different lengths. Atheromatous origins of the internal carotid arteries are imprinted on the internal jugular veins. Three-dimensional volume rendering. Anterior view. 1. Right lateral condylar vein; 2. right internal carotid artery; 3. right inferior petrosal sinus; 4. right styloid process; 5. anterior arch of the atlas; 6. right external carotid artery; 7. right internal jugular vein; 8. right vertebral artery; 9. right carotid bifurcation; 10. left hypoglossal canal; 11. left internal carotid artery; 12. left inferior petrosal sinus; 13. left styloid process; 14. transverse process of the atlas (compression site); 15. left vertebral artery; 16. left external carotid artery; 17. left internal jugular vein; 18. left carotid bifurcation. Figure 8 A long left inferior petrosal sinus and the internal jugular vein compressed on the transverse process of the atlas. Axial slice. Inferior view. Left side. 1. internal carotid artery; 2. inferior petrosal sinus; 3. styloid process; 4. external carotid artery; 5. parotid gland; 6. posterior belly of the digastric muscle; 7. occipital artery; 8. internal jugular vein; 9. transverse process of the atlas. Figure 9 Triple compression sites of the internal jugular vein (IJV). Long inferior petrosal sinus. Left side. Three-dimensional volume rendering. ( A B Figure 10 Bilateral triple compressions of the internal jugular veins (IJVs). The upper sites of compression are between the stylohyoid chain and the transverse processes of the atlas, respectively. The middle sites of compression are at C2, deep to the digastric muscle. The lower compression sites are, bilaterally, between the sternocleidomastoid muscle and the atheromatous internal carotid artery. ( A B Figure 11 Bilateral asymmetry of the jugular–carotid interrelations. ( A B Figure 12 Compressions of the internal jugular vein (IJV) at C1 and C2. Right side. ( A B C D E ",
  "metadata": {
    "Title of this paper": "Interventional and surgical management of internal jugular venous stenosis: A narrative review",
    "Journal it was published in:": "Medicina",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12472027/"
  }
}