{
  "title": "Paper_880",
  "abstract": "pmc Front Oncol Front Oncol 1755 frontonco Front. Oncol. Frontiers in Oncology 2234-943X Frontiers Media SA PMC12460084 PMC12460084.1 12460084 12460084 41018089 10.3389/fonc.2025.1668671 1 Oncology Editorial Editorial: Management of rare oncological cases Castagneto-Gissey Lidia  1  *  † Georgescu Dragos Eugen  2 Agresta Ferdinando  3  1 Department of Surgery, Sapienza University of Rome Rome Italy  2 Carol Davila University of Medicine and Pharmacy Bucharest Romania  3 ULSS2 Marca Trevigiana Treviso Italy Edited and reviewed by: Dana Kristjansson, Norwegian Institute of Public Health (NIPH), Norway *Correspondence: Lidia Castagneto-Gissey, lidia.castagnetogissey@uniroma1.it †ORCID: Lidia Castagneto-Gissey, orcid.org/0000-0002-3800-167X 11 9 2025 2025 15 480898 1668671 18 7 2025 02 9 2025 11 09 2025 26 09 2025 29 09 2025 Copyright © 2025 Castagneto-Gissey, Georgescu and Agresta. 2025 Castagneto-Gissey, Georgescu and Agresta https://creativecommons.org/licenses/by/4.0/ This is an open-access article distributed under the terms of the Creative Commons Attribution License (CC BY). The use, distribution or reproduction in other forums is permitted, provided the original author(s) and the copyright owner(s) are credited and that the original publication in this journal is cited, in accordance with accepted academic practice. No use, distribution or reproduction is permitted which does not comply with these terms. melanoma sarcoma neuroendocrine tumor gynecologic cancer molecular immunotherapy pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement no pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes section-in-acceptance Cancer Epidemiology and Prevention The rapid evolution of oncology has brought new challenges and opportunities in the diagnosis and management of rare and complex tumors. Although infrequent in occurrence, these malignancies often carry poor prognoses due to diagnostic delays, limited treatment options, and lack of robust clinical trial data. The recent surge in detailed case reports, molecular analyses, and innovative treatment strategies contributes significantly to bridging these gaps. This editorial aims to synthesize recent findings from diverse rare tumor cases—spanning from gynecologic melanomas, to sarcomas, neuroendocrine neoplasms, and atypical metastases—and explore their implications for clinical practice and future research. Rare soft tissue and mesenchymal tumors The occurrence of malignant granular cell tumors (GCTs) outside their usual head and neck locations, such as the chest wall, exemplifies diagnostic challenges posed by atypical presentations ( Flauto et al. Liu et al. Soft tissue sarcomas and stromal tumors constitute a heterogeneous group of mesenchymal neoplasms often posing diagnostic and therapeutic challenges. Bai et al. Gastrointestinal schwannomas, although generally considered benign peripheral nerve sheath tumors, occasionally present in unusual locations such as the colon. Yu et al. The recurrence of benign tumors decades after surgery is another sobering reminder of the need for long-term surveillance. Lei et al. Rare cutaneous and skin-associated malignancies Cutaneous neoplasms with mixed histopathologic features, such as the endocrine mucin-producing sweat gland carcinoma with mucinous carcinoma components reported by Sun et al.  Zhang et al. Lambert-Swainston et al.  Chen et al. The review by Pedersen et al. Pedersen et al. Gynecologic and female reproductive tumors The prognostic factors identified in uterine adenosarcoma through the SARCUT study subanalysis by Mancari et al. Intravenous leiomyomatosis (IVL), a rare vascular smooth muscle tumor with potential for significant morbidity, is highlighted by Li et al. Wang et al.  Feng et al. Zan et al.  Zhang et al.  Wu et al.  Liu et al. Qing et al. in situ In a broader effort to characterize rare ovarian tumors, Chen et al. Uncommon gynecologic malignancies with unique histologies remain a diagnostic challenge. Zhang et al.  Zeng et al. Detailed pathology, supported by immunohistochemistry and molecular techniques, provides critical diagnostic and prognostic information. Liang et al.  Dahl et al. in vitro  Zhang et al. Many rare tumors mimic benign conditions on imaging, complicating diagnosis. Li et al. Finally, fertility preservation in the treatment of rare peritoneal tumors is illustrated by Li et al. Male genitourinary tumors  Huang et al. Furthermore, the report by Bai et al. Unusual metastatic patterns The rare occurrence of metastatic deposits in unusual locations can mislead clinicians and delay appropriate management. Koh et al. Likewise, rare metastatic patterns, including renal cell carcinoma spreading to the thyroid ( Xu et al. Ding et al. Hormonal receptor status variability in metastatic breast cancer to the colon, as reported by Li et al. Rare gastrointestinal tumors Therapeutic innovations and clinical management strategies are also a central theme. Fassi et al.  Carella et al.  Dong et al. Similarly, in the context of hereditary cancer syndromes, Sun et al. Pulmonary and thoracic rare cancers  Huang et al. Immunotherapy and novel approaches Uveal melanoma is the most common primary intraocular malignancy in adults but has limited treatment options when metastatic. Tran et al. Several reports highlight the expanding role of immune checkpoint inhibitors in rare melanomas of mucosal and ocular origin. Gunenc et al. Concluding perspective The aggregation of rare tumor cases in centralized databases enables pattern recognition, prognostication, and development of evidence-based guidelines. Enhanced collaboration across institutions is essential to overcome the limitations posed by rarity. Molecular profiling and PDO models exemplify the move toward personalized oncology. Identifying actionable mutations and immune biomarkers will expand therapeutic options and improve survival in rare tumors. Many rare tumors lack standardized management protocols. Prospective trials, translational research, and integration of real-world data are crucial to define optimal care pathways. These contributions underscore the importance of case reporting, precision diagnostics, and novel therapies. The diversity and complexity in these cases drive innovation and collaborative research in rare cancer management. A unified global strategy must ensure every rare case enlightens future guidelines, clinical decisions, and research priorities. As we move forward, integrating advanced genomic profiling, immunotherapy, and real-world evidence from rare tumors is crucial. The work included in this Research Topic reminds us that every single report contributes meaningfully to the literature. These insights can inform trial design, guide biomarker discovery, and promote global collaboration. The diverse and complex spectrum of rare tumors demands vigilant diagnosis, innovative therapies, and personalized approaches. Recent advances in immunotherapy, molecular diagnostics, and preclinical modeling herald a new era in oncology, turning clinical challenges into opportunities for improved patient care. Continuous reporting and collaboration remain vital to deepen understanding and refine management of these uncommon yet impactful malignancies. Collectively, these cases illuminate the multifaceted challenges in diagnosing and treating rare tumors, from atypical presentations and rare metastatic patterns to evolving molecular diagnostics and novel therapeutic interventions. They underline the indispensable value of meticulous histopathological examination, advanced imaging modalities, and multidisciplinary management in optimizing patient outcomes. As the medical community continues to encounter rare tumors with unique clinical behaviors, these reports contribute to a growing body of knowledge that will apprise future clinical guidelines and foster more precise, individualized care. The heterogeneity and rarity of these conditions demand ongoing research and international collaboration to unravel their complexities and improve prognostication and treatment paradigms. We encourage more institutions to document, publish, and contribute to rare oncology registries. With comprehensive molecular diagnostics and multidisciplinary treatment, outcomes for patients with rare tumors can continue to improve. Each study included here contributes a valuable thread in the larger fabric of rare oncology knowledge and care. Author contributions LC-G: Writing – original draft, Conceptualization, Writing – review & editing. DG: Writing – review & editing. FA: Writing – review & editing. Conflict of interest The authors declare that the research was conducted in the absence of any commercial or financial relationships that could be construed as a potential conflict of interest. The author(s) declared that they were an editorial board member of Frontiers, at the time of submission. This had no impact on the peer review process and the final decision. Generative AI statement The author(s) declare that no Generative AI was used in the creation of this manuscript. Any alternative text (alt text) provided alongside figures in this article has been generated by Frontiers with the support of artificial intelligence and reasonable efforts have been made to ensure accuracy, including review by the authors wherever possible. If you identify any issues, please contact us. Publisher’s note All claims expressed in this article are solely those of the authors and do not necessarily represent those of their affiliated organizations, or those of the publisher, the editors and the reviewers. Any product that may be evaluated in this article, or claim that may be made by its manufacturer, is not guaranteed or endorsed by the publisher. ",
  "metadata": {
    "Title of this paper": "Editorial: Management of rare oncological cases",
    "Journal it was published in:": "Frontiers in Oncology",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12460084/"
  }
}