{
  "title": "Paper_452",
  "abstract": "J Dent Res J Dent Res 1509 jdr JDR Journal of Dental Research 0022-0345 1544-0591 International Assoc. for Dental, Oral, and Craniofacial Research/American Assoc. for Dental, Oral, and Craniofacial Research PMC11653298 PMC11653298.1 11653298 11653298 39290151 10.1177/00220345241271078 10.1177_00220345241271078 1 Research Reports Biological m 6 Song W. 1 * https://orcid.org/0000-0002-1469-5929 Liu L. 1 * Liang H. 2 Cheng H. 2 He W. 3 Yin Q. 1 Zhang Z. 1 https://orcid.org/0000-0002-8023-213X Lin W. 1 Li H. 1 Li Q. 1 4 Liu W. 1 Zhang D. 2 Chen D. 5 https://orcid.org/0000-0002-2836-1081 Yuan Q. 1 4 1 2 3 4 5 D. Chen, Otorhinolaryngology Hospital, The First Affiliated Hospital, Sun Yat-sen University, No. 58, Zhong Shan Er Lu, Guangzhou, Guangdong 510080, China. Email: chendm29@mail.sysu.edu.cn Q. Yuan, State Key Laboratory of Oral Diseases, West China Hospital of Stomatology, Sichuan University, No. 14 Third Section, Renmin Road South, Chengdu, Sichuan 610041, China. Email: yuanquan@scu.edu.cn * Authors contributing equally to this article. The authors declared no potential conflicts of interest with respect to the research, authorship, and/or publication of this article. 18 9 2024 10 2024 103 11 477307 1130 1140 01 10 2025 01 10 2025 19 12 2024 01 10 2025 © International Association for Dental, Oral, and Craniofacial Research and American Association for Dental, Oral, and Craniofacial Research 2024 2024 International & American Associations for Dental Research N6,2′-O-dimethyladenosine (m 6 6 Pcif1 6 6 periodontal disease(s)/periodontitis periodontal medicine immunity immunotherapy gene therapy/therapeutics bone biology west china school of stomatology, sichuan university https://doi.org/10.13039/100020756 RCDWJS2022-18 National Natural Science Foundation of China https://doi.org/10.13039/501100001809 82125006, 82171829 pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access no pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement yes pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes typesetter ts1 ",
  "metadata": {
    "Title of this paper": "m",
    "Journal it was published in:": "Journal of Dental Research",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC11653298/"
  }
}