{
  "title": "Paper_62",
  "abstract": "pmc J Allergy Clin Immunol Glob J Allergy Clin Immunol Glob 4505 jacig The Journal of Allergy and Clinical Immunology: Global 2772-8293 Elsevier PMC12492193 PMC12492193.1 12492193 12492193 10.1016/j.jacig.2025.100540 S2772-8293(25)00141-9 100540 1 Original article Clinical recommendations for diagnosis and management of Mendelian susceptibility to mycobacterial disease in resource-limited settings Cornelissen Helena MD helena@drcornelissen.co.za a b c ∗ Glanzmann Brigitte PhD d e van Coller Ansia PhD e f Glashoff Richard PhD b f Goda Rayan MD g h i Abdelmajeed Omaima MD j k Erwa Nahla MD g l Esser Monika MD m a b c d e f g h i j k l m ∗ helena@drcornelissen.co.za 11 2025 23 7 2025 4 4 493561 100540 26 11 2024 25 5 2025 26 5 2025 23 07 2025 04 10 2025 04 10 2025 © 2025 Published by Elsevier Inc. on behalf of the American Academy of Allergy, Asthma & Immunology. 2025 https://creativecommons.org/licenses/by-nc-nd/4.0/ This is an open access article under the CC BY-NC-ND license (http://creativecommons.org/licenses/by-nc-nd/4.0/). Graphical abstract Background Mendelian susceptibility to mycobacterial disease (MSMD) is a rare inborn error of immunity caused by defects in IL-12 or IFN-γ signaling pathways, essential for intracellular pathogen control. While classically linked to nontuberculous mycobacteria, MSMD also predisposes to bacterial, fungal, and viral infections. Objective We sought to provide a practical framework for diagnosing and managing MSMD in African settings. Recommendations integrate clinical evaluation, baseline immunologic testing, and molecular diagnostics. Methods A review of clinical presentation, diagnostic strategies, and therapeutic approaches was conducted, emphasizing applicability in resource-limited environments. Results MSMD presents across a wide clinical spectrum that includes severe disseminated early-onset infections and localized later-onset disease. While classically characterized by increased susceptibility to nontuberculous mycobacteria, MSMD also predisposes to bacterial, fungal, and viral infections. Standard immunologic screening often yields unremarkable findings, necessitating a tiered diagnostic approach that includes molecular testing for confirmation. Long-term antimicrobial therapy remains the cornerstone of management, with prophylaxis warranted in recurrent or severe cases. Early identification significantly reduces morbidity and mortality. Molecular diagnostic methods facilitate genotype-guided management, enabling precision medicine approaches in this context. Conclusion Timely recognition of MSMD, particularly in tuberculosis-endemic settings, is critical to prevent severe disease progression. A structured diagnostic algorithm, combined with molecular testing and individualized treatment strategies, enhances outcomes. MSMD underscores the significance of genotype-driven management. Key words PID primary immunodeficiency IEI inborn errors of immunity MSMD Mendelian susceptibility to mycobacterial disease Africa pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement no pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes Abbreviations used BCG Bacillus Calmette-Guérin Cas9 CRISPR-associated protein 9 CRISPR Clustered regularly interspaced short palindromic repeat HCT Hematopoietic cell transplantation HIV Human immunodeficiency virus IEI Inborn error of immunity IGRA IFN-γ release assay MSMD Mendelian susceptibility to mycobacterial disease NTM Nontuberculous mycobacteria SPUR Severe, persistent, unusual, and/or recurrent TB Tuberculosis Inborn errors of immunity (IEIs) are predominantly monogenic defects affecting innate and adaptive immunity, leading to increased susceptibility to infections and/or immune dysregulation, manifesting as autoimmunity, autoinflammation, allergies, and malignancies. 1 2 3 4 1 , 5 2 , 6 , 7 6 , 8 Phenotypic expression is heterogenous and includes severe early-onset disseminated mycobacterial infections and milder late-onset disease. 6 7 8 9 Table I 9 , 10 9 10 11 Table I Criteria for diagnosis of MSMD in Africa Essential criteria • Confirmed pathologic germline variant described in MSMD. • One or more of the clinical features outlined in Table II Desirable criteria • History of infections: predominantly mycobacterial or bacterial infections, but also fungal or viral, as outlined in Table III • Disseminated BCG vaccination. We sought to create a practical framework and treatment algorithm for the identification, diagnosis, and management of MSMD, particularly in TB-endemic areas like Africa. We aimed to address the unique diagnostic challenges posed by the socioeconomic and environmental factors prevalent in these regions. Methods We reviewed the epidemiology, pathophysiology, and clinical indications of MSMD in the context of IEIs in order to identify the relevant pathway-related genes. Epidemiology IEIs are estimated at 4 to 10 per 100,000 live births per year, and although the exact prevalence is not well known, it is estimated at 1 in 50,000. 12 13 14 15 6 6 , 7 13 IL12RB1 IFNGR1 IL12B Fig 1 16 Fig 1 Overview of MSMD. The proteins encoded by genes that have been implicated in MSMD are shown in either dark blue (isolated MSMD) or light blue (syndromic MSMD). Mutations in these genes can result in a disruption of this pathway, leading to reduced immunity against mycobacteria and severe, persistent, unusual, and/or recurrent (SPUR) disease presentations. 10 , 11 Outline of pathophysiology In the coordination of an effective host response to mycobacterial infection, the IL-12–IFN-γ cytokine pathway is essential for effective immune responses against mycobacteria ( Fig 1 17 18 19 20 21 22 23 Currently, 18 different genes related to this pathway have been associated with MSMD. Mutations in these genes disrupt antimycobacterial immunity and may predispose the carrier to mycobacterial infections. Isolated MSMD has been associated with mutations in IFNGR1, IFNGR2, IFNG, STAT1, IRF8, IL12RB1, IL12RB2, IL23R, IL12B, SPPL2A, TYK2, NEMO, CYBB, STAT1, IRF8, ZNFX1, TYK2, JAK1, ISG15, RORγ/RORγT, TBX21 STAT1 11 , 24 25 26 Certain phenocopies of IEIs where an individual produces neutralizing autoantibodies against essential antimycobacterial cytokines, such as IFN-γ, also result in increased susceptibility to mycobacterial infections. 27 28 29 30 Clinical features and criteria for diagnosis MSMD typically presents in childhood or adolescence, with a diverse phenotype ranging from localized to disseminated infections ( Table II 8 Table III 9 31 9 , 10 , 34 Fig 2 Table II Clinical features of MSMD Sign Description Age Typically childhood; however, can also present in adolescence and adulthood. General health Otherwise healthy individuals. SPUR infections Severe: Uncontrolled or complicated TB infection—eg, TB empyema, TB pericarditis, TB meningitis, TB spine, multiple osteoarticular sites of TB, disseminated (miliary) TB. BCG lymphadenitis and BCGosis (disseminated BCG infection) Systemic manifestations such as fever, anemia, weight loss, or poor weight gain. Typical infections Mycobacteria: BCG infection ( Mycobacterium bovis M chelonaie, M fortutium, M mageritense, M peregrinum, M smegmatis, M scrofulaeceum, M intracellulare, M avium M kansasii M tuberculosis. Salmonella Listeria monocytogenes, Burkholderia Candida Histoplasma capsulatum, Cryptococcus neoformans, Coccicoides Leishmania Toxoplasma gondii. Cytomegalovirus, Data from references 7 , 9 , 31 32 RSV, VZV, Table III Typical infections associated with MSMD phenotype Type of infection Underlying pathophysiology Associated MSMD mutation Comment Salmonella Candida; IFN-γ production defect IL12RB1 IL12B Viral infections uncommon. NTM, BCG; MTBC less common IFN-γ response defect IFN-γR1 (AD), STAT1 loss of function (AR/AD) Multifocal osteomyelitis. Viral infection: (CMV, RSV, VZV), BCG, NTM, Salmonella, Listeria monocytogenes Absent IFN-γ response IFN-γR1 (AR); IFN-γR2 (AR) More severe/disseminated BCG and/or environmental bacteria. Data from references 7 , 8 , 23 33 AD, AR, CMV, MTBC, Mycobacterium tuberculosis RSV, VZV, Fig 2 Approach to investigation and management of suspected MSMD. 7 , 32 , 34 , 36 Clinical features of disseminated NTM infection are nonspecific and may include fever, weight loss, diarrhea, generalized lymphadenopathy, generalized cutaneous lesions, diffuse abdominal tenderness, hepatosplenomegaly, and ascites. Symptoms and signs reflect the major sites of involvement (eg, bone marrow, lymphoreticular system, gastrointestinal tract, lungs). Partial defects, such as that caused by the autosomal-dominant partial IFN-γ receptor 1 (ADIFNGR1) Table II 7 , 8 It is important that all individuals with a clinical phenotype suggestive of MSMD undergo further molecular testing to define the disease pathophysiology. A molecular diagnosis for MSMD is important to ensure that patients receive treatment tailored to their specific immune defects. Unfortunately, it is estimated that only half of clinically diagnosed MSMD patients have received a molecular diagnosis. 35 Differential diagnosis Other IEIs and immune deficient states (hematologic malignancy, HIV) that can predispose to increased risk for mycobacterial infection and should be considered in the differential diagnosis ( Table IV Table IV Differential diagnoses to consider in suspected MSMD Differential diagnosis Typical presentation other than mycobacterial infection Important investigation Other IEIs SCID CID Hyper-IgM (HIM) Presentation typically within first year of life. Cryptosporidium CBC, differential, and peripheral blood morphology (film/smear); lymphocyte subsets including T and B lymphocytes and NK cells by fluorescence cytometry. Chronic granulomatous disease Early-onset severe and recurrent infections (including fungal infections). Above, and abnormal oxidative burst response. STAT3 Recurrent staphylococcal skin “cold” abscesses, eczema and pulmonary infections, scoliosis, joint hypermobility, and high arched palate. CBC, differential, and peripheral blood morphology (film/smear), serum levels of IgG, IgA, IgM, and IgE. Autoantibodies to IFN-γ Acquired antibodies to IFN-γ, typically presenting in adulthood. As above; IGRA testing indeterminate GATA-2 Present in adolescence and early adulthood. Bone marrow biopsy, cytogenetics, molecular investigation. ∗ Other Cystic fibrosis Abnormal viscous mucoid secretions. Mutation in CFTR Primary ciliary dyskinesia Autosomal-recessive disorder affecting ciliary function. Focused investigation and mutational analysis. Data from references 7 , 32 , 34 36 CBC, CFTR, CID, NK, SCID, ∗ Molecular investigations should use established next-generation sequencing panel or whole-exome or whole-genome sequencing. Molecular investigation should be guided by both clinical and laboratory findings. An established sequencing panel is advised, and if this fails to provide a satisfactory result, whole-genome sequencing with the use of ClinVar, gNomad, or the like is advised. Results should be discussed by a multidisciplinary panel to decide on clinical relevance. Results After gathering information about the genetic basis of MSMD and noting its possible confusion with BCG, NTM, and HIV, we constructed an algorithm to assess potential cases of MSMD in order to confirm this diagnosis. Investigations A 3-step tiered investigation approach to IEIs has been proposed and is widely applied, 9 , 12 , 15 Tier 1 First-line investigation comprises extensive physical, radiologic, and laboratory investigation to exclude an increased anatomic risk for infection or secondary immunodeficiency. HIV-negative result must be recorded. A complete blood count and leucocyte differential (neutrophils, granulocytes, lymphocytes, monocytes) will highlight any cytopenias that may require further investigation and suggest an alternative diagnosis or other underlying pathology. A peripheral blood smear morphology request should be standard to confirm normal neutrophil morphology and exclude features that may suggest bone marrow involvement. Finally, a bone marrow biopsy with TB culture should be performed to uncover any persistent cytopenias, particularly if associated teardrops and leukoerythroblastosis are noted on the peripheral blood film. Tier 2 Focused investigation comprises the following: • Enumeration of total immunoglobulin levels (IgG, IgM, IgA, IgE). • Lymphocyte subsets (total CD3 + + + • Mitogen and antigen proliferation studies (critical for helping make the diagnosis of severe combined immunodeficiency, combined immunodeficiency disease, and other partial deficiencies). • Nitroblue tetrazolium test (to screen neutrophil function) and/or dihydrorhodamine flow cytometry. • IFN-γ release assays (IGRAs). The nitroblue tetrazolium test, performed with the aid of a hematology or immunology laboratory, is a cheap and effective screening tool to exclude chronic granulomatous disease. 37 9 , 38 Table V Table V Interpretation of IFN-γ release assay Result Interpretation What to do next Positive Normal IFN-γ production in response to TB antigens and positive control (expected if patient diagnosed with current or past TB). Treat for TB (if current). not Negative Lack of IFN-γ production in response to TB antigens (expected if patient has not been diagnosed with TB). Confirm TB infection, if suspected (current and past). Indeterminate Lack of IFN-γ production in response to mitogen/positive control. Repeat test to confirm indeterminate result (to exclude processing errors). Interpretation of assays such as QuantiFERON-TB Gold Plus in the context of suspected MSMD. 9 , 10 Repeatedly indeterminate or negative results in the case of an individual with a confirmed TB infection history could be a strong indicator of an IEI associated with impaired IFN-γ production. However, it should be noted that a positive IGRA result does necessarily exclude MSMD/impaired IFN-γ responses or another IEI. 9 , 10 Very low or undetectable levels of IFN-γ production in IGRAs may also be indicative of IFN-γ autoantibodies, 7 , 38 Tier 3 In SPUR TB when secondary immunodeficiency or anatomic pathology is absent and other IEIs have been excluded, third- and fourth-line investigations are then recommended in close consultation with immunology services. A molecular diagnosis of MSMD, as with other IEIs, is important to establish a clear, definitive picture of the specific defect. This can guide defect-specific treatment strategies; it also enables accurate and informative genetic counseling for the affected individual and his or her family members, which may assist in family planning. 30 Genetic testing should ideally be done in the context of genetic counseling. It should include either targeted gene panels or preferably more expanded next-generation sequencing technologies such as diagnostic-based whole-exome sequencing or whole-genome sequencing. 9 , 14 Ancillary tests Focused immunophenotyping can be performed to assess pathway function (eg, IFNGR 7 , 10 in vitro 7 , 10 Flow cytometry is performed to broadly categorize immunodeficiency. Extensive research laboratory–based studies may be required to assess the impact of novel genes and gene variants identified by next-generation sequencing. Various methods, including flow cytometry, RNA sequencing, and Western blot analysis, can be used for investigation of immune functionality and the effects associated with novel gene mutations. 39 40 41 When MSMD is suspected, HIV, other secondary immunodeficiencies, anatomic risk for infection, and other IEIs must be excluded. Clinical features include severe, persistent, unusual, and/or recurrent infections. A stepwise approach to investigation is advised with molecular confirmation with or without functional validation. Management should be tailored to the mutation and clinical phenotype. Discussion MSMD management The management of MSMD should be multidisciplinary and involve both the clinical and scientific teams as well as the relevant axillary health care services. The patient and family should be actively involved in disease management and the patient given age-appropriate responsibility for his or her care. Pillars of management include confirmation of the mutation and, if necessary, relevant phenotypic expression and aggressive antimicrobial management with or without prophylaxis; hematopoietic cell transplantation (HCT) can be considered curative in some ( Fig 3 Table VI Fig 3 Approach to management of MSMD. Table VI Overview of treatment approaches and prognosis in common MSMD phenotypes MSMD-associated mutation Inheritance Treatment Phenotype and/or prognosis IFN-γR1 deficiency AR complete deficiency Treatment with IFN-γ not indicated because of lack of specific receptors needed. Severe phenotype; poor AR partial deficiency Treat with IFN-γ and antibiotics. Less severe phenotype AD partial deficiency Mycobacterial disease well controlled with recombinant IFN-γ treatment and prolonged antibiotic treatment. Less severe phenotype IFN-γR2 deficiency AR complete Prolonged antibiotic therapy. Poor Partial Low penetrance. Good IL-12RB1 deficiency AR complete Prolonged and aggressive antibiotic therapy against mycobacteria. Salmonella Variable, but good in most cases Complete IL-12p40 deficiency AR complete Prolonged antibiotic therapy. Good Once the molecular mutation has been confirmed, management should be tailored accordingly. In all cases, antimicrobial management should be aggressive and organism specific. At each clinic visit, patients should be screened for TB. Subtle weight loss is often an early indicator of new infection. Disseminated BCG infection When disseminated BCG infection is identified ( Tables III V 9 For ipsilateral axillary lymph nodes, at least triple anti-TB therapy (isoniazid, rifampicin, ethambutol) for 24 to 36 months should be provided, followed by long-term prophylactic treatment until complete immunologic reconstitution. If there is dissemination beyond the ipsilateral axillary lymph nodes, anti-TB treatment should include ≥4 anti-TB drugs (isoniazid, rifampicin, ethambutol, levofloxacin with or without clarithromycin) for 24 to 36 months until the patient fully recovers. 9 , 42 Tables VII VIII Table VII Prophylaxis regimen for persons weighing <25 kg Body weight (kg) Rifampicin/isoniazid fixed (daily) dose combination 75/50 tablet If dispersed in water (mL) ∗ 2 2.9 ½ tablet 5 3 3.9 ¾ tablet 7.5 4 5.9 1 tablet 10 6 7.9 1½ tablets 15 8 11.9 2 tablets 20 12 15.9 3 tablets 30 16 24.9 4 tablets 40 Data from South African TB guidelines. 42 AD, AR, ∗ One tablet in 10 mL of sterile water. Table VIII Prophylaxis regimen for persons weighing >25 kg Body weight (kg) Rifapentine (no. of 150 mg tablets provided weekly) Isoniazid (no. of 300 mg tablets provided weekly) 25 29.9 4 2 30 49.9 6 3 >50 6 3 Data from South African TB guidelines. 42 IFN-γ therapy Complete IFN-γ receptor defects and complete STAT1 defects require more aggressive management and do not respond to IFN-γ replacement. 6 , 7 8 , 23 HCT is the only curative option for patients with autosomal-recessive complete IFNGR1 IFNGR2 43 , 44 33 43 , 45 45 45 Gene therapy is an emerging treatment option that aims to correct the genetic mutations responsible for MSMD directly within the patient’s own cells, offering the potential for a definitive cure without the risks associated with HCT, such as graft-versus-host disease. 46 46 ex vivo 17 , 33 17 , 33 HCT and gene therapy offer promising curative options for patients with MSMDs, particularly in cases of severe genetic defects in the IFN-γ and IL-12 signaling pathways. While HCT is already a well-established treatment with demonstrated success, gene therapy represents an evolving frontier that could provide safer and more accessible cure. The choice between these therapies depends on the severity of the genetic defect, the availability of suitable donors, and the patient’s overall health condition. Prophylaxis Before initiating prophylaxis, an extensive investigation must exclude active mycobacterial or other infection requiring therapeutic regimens. In the context of active mycobacterial infection, it is imperative to consider other at-risk persons in the household who may require prophylaxis, in particular pregnant women, people living with HIV, and persons with previous TB. 42 There are 3 options to consider: isoniazid and rifapentine provided once weekly (3HP), daily rifampicin and isoniazid (3RH), and daily isoniazid for 6 months (6H) and 12 months (12H). 42 42 42 42 Follow-up appointments The presentation is often subtle and not typical, with fever or lymphadenopathy. Unexplained weight loss was a particular flag of recurrent mycobacterial infection in a South African cohort. 9 Conclusion MSMD is an IEI of the innate immune system conferring increased susceptibility to mycobacterial, viral, and fungal infections in otherwise healthy individuals. Particularly in TB-endemic settings, a high index of suspicion is crucial for early recognition. Management is typically individualized; however, patients often require intensive antimicrobial management as well as consideration of the role of prophylaxis. Disclosure statement Supported in part by by Crick African 10.13039/100031212 Network 10.13039/501100001321 National Research Foundation 10.13039/100006190 Research and Development 10.13039/100019242 Department of Science 10.13039/501100001322 South African Medical Research Council 10.13039/501100004513 Harry Crossley Foundation Disclosure of potential conflict of interest: The authors declare that they have no relevant conflicts of interest. References 1 Bousfiha A. Jeddane L. Picard C. Al-Herz W. Ailal F. Chatila T. Human inborn errors of immunity: 2019 update of the IUIS phenotypical classification J Clin Immunol 40 2020 66 81 32048120 10.1007/s10875-020-00758-x PMC7082388 2 Tangye S.G. Al-Herz W. Bousfiha A. Cunningham-Rundles C. Franco J.L. Holland S.M. Human inborn errors of immunity: 2022 update on the classification from the International Union of Immunological Societies expert committee J Clin Immunol 42 2022 1473 1507 35748970 10.1007/s10875-022-01289-3 PMC9244088 3 Seidel M. Autoimmune and other cytopenias in primary immunodeficiencies: pathomechanisms, novel differential diagnoses, and treatment Blood 124 2014 2337 2344 25163701 10.1182/blood-2014-06-583260 PMC4192747 4 Seidel M.G. Kindle G. Gathmann B. Quinti I. Buckland M. van Montfrans J. The European Society for Immunodeficiencies (ESID) registry working definitions for the clinical diagnosis of inborn errors of immunity J Allergy Clin Immunol Pract 7 2019 1763 1770 30776527 10.1016/j.jaip.2019.02.004 5 Casanova J.L. Abel L. Human genetics of infectious diseases: a unified theory EMBO J 26 2007 915 922 17255931 10.1038/sj.emboj.7601558 PMC1852849 6 Rosain J. Kong X.F. Martinez-Barricarte R. Oleaga-Quintas C. Ramirez-Alejo N. Markle J. Mendelian susceptibility to mycobacterial disease: 2014–2018 update Immunol Cell Biol 97 2019 360 367 30264912 10.1111/imcb.12210 PMC6438774 7 Esteve-Solé A. Sologuren I. Martínez-Saavedra M.T. Deyà-Martínez À. Oleaga-Quintas C. Martinez-Barricarte R. Martin-Nalda A. Laboratory evaluation of the IFN-γ circuit for the molecular diagnosis of Mendelian susceptibility to mycobacterial disease Crit Rev Clin Lab Sci 55 2018 184 204 29502462 10.1080/10408363.2018.1444580 PMC5880527 8 Bustamante J. Boisson-Dupuis S. Abel L. Casanova J.L. Mendelian susceptibility to mycobacterial disease: genetic, immunological, and clinical features of inborn errors of IFN-γ immunity Semin Immunol 26 2014 454 470 25453225 10.1016/j.smim.2014.09.008 PMC4357480 9 Cornelissen H.M. Glanzmann B. van Coller A. Engelbrecht C. Abraham D.R. Reddy K. Mendelian susceptibility to mycobacterial disease in tuberculosis-hyperendemic South Africa S Afr Med J 111 2021 998 1005 34949297 10.7196/SAMJ.2021.v111i10.15341 10 van Coller A. Glanzmann B. Cornelissen H. Möller M. Kinnear C. Esser M. Phenotypic and immune functional profiling of patients with suspected Mendelian susceptibility to mycobacterial disease in South Africa BMC Immunol 22 2021 62 34517836 10.1186/s12865-021-00452-6 PMC8436520 11 Noma K. Mizoguchi Y. Tsumura M. Okada S. Mendelian susceptibility to mycobacterial diseases: state of the art Clin Microbiol Infect 28 2022 1429 1434 35283318 10.1016/j.cmi.2022.03.004 12 Erjaee A. Bagherpour M. Van Rooyen C. Van den Berg S. Kinnear C.J. Green R.J. Primary immunodeficiency in Africa—a review S Afr Med J 109 2019 3 11 10.7196/SAMJ.2019.v109i8b.13820 31662142 13 Bousfiha A.A. Jeddane L. Ailal F. Benhsaien I. Mahlaoui N. Casanova J.L. Primary immunodeficiency diseases worldwide: more common than generally thought J Clin Immunol 33 2013 1 7 22847546 10.1007/s10875-012-9751-7 14 Glanzmann B. Uren C. de Villiers N. van Coller A. Glashoff R.H. Urban M. Primary immunodeficiency diseases in a tuberculosis endemic region: challenges and opportunities Genes Immun 20 2019 447 454 30185814 10.1038/s41435-018-0041-0 15 Eley B. Esser M. Investigation and management of primary immunodeficiency in South African children S Afr Med J 104 2014 7304 29183438 10.7196/samj.8946 16 Xia L. Liu X.H. Yuan Y. Lowrie D.B. Fan X.Y. Li T. An updated review on MSMD research globally and a literature review on the molecular findings, clinical manifestations, and treatment approaches in China Front Immunol 13 2022 926781 10.3389/fimmu.2022.926781 PMC9774035 36569938 17 Domingo-Gonzalez R. Prince O. Cooper A. Khader S.A. Cytokines and chemokines in Mycobacterium tuberculosis Microbiol Spectr 4 2016 10.1128/microbiolspec.TBTB2-0018-2016 PMC5205539 27763255 18 Schroder K. Hertzog P.J. Ravasi T. Hume D.A. Interferon-gamma: an overview of signals, mechanisms and functions J Leukoc Biol 75 2004 163 189 14525967 10.1189/jlb.0603252 19 Hodny Z. Reinis M. Hubackova S. Vasicova P. Bartek J. Interferon gamma/NADPH oxidase defense system in immunity and cancer Oncoimmunology 5 2016 e1080416 10.1080/2162402X.2015.1080416 PMC4801460 27057461 20 Casanova J.L. Severe infectious diseases of childhood as monogenic inborn errors of immunity Proc Natl Acad Sci U S A 112 2015 E7128 E7137 26621750 10.1073/pnas.1521651112 PMC4697435 21 Bustamante J. Picard C. Boisson-Dupuis S. Abel L. Casanova J.L. Genetic lessons learned from X-linked Mendelian susceptibility to mycobacterial diseases Ann N Y Acad Sci 1246 2011 92 101 22236433 10.1111/j.1749-6632.2011.06273.x PMC3315101 22 Al-Muhsen S. Casanova J.L. The genetic heterogeneity of Mendelian susceptibility to mycobacterial diseases J Allergy Clin Immunol 122 2008 1043 1051 19084105 10.1016/j.jaci.2008.10.037 23 Rosain J. Kong X.F. Martinez-Barricarte R. Oleaga-Quintas C. Ramirez-Alejo N. Markle J. Mendelian susceptibility to mycobacterial disease: 2014-2018 update Immunology and Cell Biology 2018 Sep 28 10.1111/imcb.12210 PMC6438774 30264912 24 Boisson-Dupuis S. The monogenic basis of human tuberculosis Hum Genet 139 2020 1001 1009 32055999 10.1007/s00439-020-02126-6 PMC7275886 25 Kerner G. Rosain J. Guérin A. Al-Khabaz A. Oleaga-Quintas C. Rapaport F. Inherited human IFN-γ deficiency underlies mycobacterial disease J Clin Invest 130 2020 3158 3171 32163377 10.1172/JCI135460 PMC7260033 26 Cheng A. Holland S.M. Anti-cytokine autoantibodies: mechanistic insights and disease associations Nat Rev Immunol 24 2024 161 177 37726402 10.1038/s41577-023-00933-2 27 Kampmann B. Hemingway C. Stephens A. Davidson R. Goodsall A. Anderson S. Acquired predisposition to mycobacterial disease due to autoantibodies to IFN-gamma J Clin Invest 115 2005 2480 2488 16127458 10.1172/JCI19316 PMC1190367 28 Lee W.I. Huang J.L. Wu T.S. Lee M.H. Chen I.J. Yu K.H. Patients with inhibitory and neutralizing auto-antibodies to interferon-γ resemble the sporadic adult-onset phenotype of Mendelian susceptibility to mycobacterial disease (MSMD) lacking bacille Calmette-Guerin (BCG)-induced diseases Immunobiology 218 2013 762 771 23083630 10.1016/j.imbio.2012.08.281 29 Ku C.L. Chi C.Y. von Bernuth H. Doffinger R. Autoantibodies against cytokines: phenocopies of primary immunodeficiencies? Hum Genet 139 2020 783 794 32419033 10.1007/s00439-020-02180-0 PMC7272486 30 Bonilla F.A. Khan D.A. Ballas Z.K. Chinen J. Frank M.M. Hsu J.T. Practice parameter for the diagnosis and management of primary immunodeficiency J Allergy Clin Immunol 136 2015 1186 1205.e78 26371839 10.1016/j.jaci.2015.04.049 31 Colditz G.A. Efficacy of BCG vaccine in the prevention of tuberculosis: meta-analysis of the published literature JAMA 271 1994 698 702 8309034 32 Wu U.I. Holland S.M. Host susceptibility to non-tuberculous mycobacterial infections Lancet Infect Dis 15 2015 968 980 26049967 10.1016/S1473-3099(15)00089-4 33 Dalvi A. Bargir U.A. Natraj G. Shah I. Madkaikar M. Diagnosis and management of infections in patients with Mendelian susceptibility to mycobacterial disease Pathogens 13 2024 203 38535546 10.3390/pathogens13030203 PMC10975294 34 Namkoong H. Holland S.M. Host susceptibility to nontuberculous mycobacterial pulmonary disease Clin Chest Med 44 2023 723 730 37890911 10.1016/j.ccm.2023.07.002 PMC10614071 35 Cottle L.E. Mendelian susceptibility to mycobacterial disease Clin Genet 79 2011 17 22 20718793 10.1111/j.1399-0004.2010.01510.x 36 Bousfiha A.A. Jeddane L. Ailal F. Al Herz W. Conley M.E. Cunningham-Rundles C. A phenotypic approach for IUIS PID classification and diagnosis: guidelines for clinicians at the bedside J Clin Immunol 33 2013 1078 1087 23657403 10.1007/s10875-013-9901-6 PMC4083684 37 O’Donovan C.J. Tan L.T. Abidin M.A.Z. Roderick M.R. Grammatikos A. Bernatoniene J. Diagnosis of chronic granulomatous disease: strengths and challenges in the genomic era JCM 13 2024 4435 39124702 10.3390/jcm13154435 PMC11313294 38 Wu U.I. Chuang Y.C. Sheng W.H. Sun H.Y. Jhong Y.T. Wang J.Y. Use of QuantiFERON-TB Gold In-tube assay in screening for neutralizing anti–interferon-γ autoantibodies in patients with disseminated nontuberculous mycobacterial infection Clin Microbiol Infect 24 2018 159 165 28694201 10.1016/j.cmi.2017.06.029 39 Losana G. Rigamonti L. Borghi I. Assenzio B. Ariotti S. Jouanguy E. Requirement for both IL-12 and IFN-γ signaling pathways in optimal IFN-γ production by human T cells Eur J Immunol 32 2002 693 700 11857344 10.1002/1521-4141(200203)32:3<693::AID-IMMU693>3.0.CO;2-Q 40 de Vor I.C. van der Meulen P.M. Bekker V. Verhard E.M. Breuning M.H. Harnisch E. Deletion of the entire interferon-γ receptor 1 gene causing complete deficiency in three related patients J Clin Immunol 36 2016 195 203 26931784 10.1007/s10875-016-0244-y PMC4792359 41 Bonilla L.E. Means G.D. Lee K.A. Patterson S.D. The evolution of tools for protein phosphorylation site analysis: from discovery to clinical application Biotechniques 44 2008 671 679 18474044 10.2144/000112800 42 Department of Health, Republic of South Africa National guidelines on the treatment of tuberculosis infection Available at: https://sahivsoc.org/Files/Health_Latent%20TB%20Infection_2023_web.pdf 2023 43 Patel S. Uppuluri R. Vellaichamy Swaminathan V. Ravichandran N. Melarcode Ramanan K. Raj R. Mendelian susceptibility to mycobacterial disease—challenges in hematopoietic stem cell transplantation Pediatr Blood Cancer 67 2020 e28187 10.1002/pbc.28187 31965686 44 Taur P.D. Gowri V. Pandrowala A.A. Iyengar V.V. Chougule A. Golwala Z. Clinical and molecular findings in Mendelian susceptibility to mycobacterial diseases: experience from India Front Immunol 12 2021 631298 10.3389/fimmu.2021.631298 PMC7959731 33732252 45 Radwan N. Nademi Z. Lum S.H. Flood T. Abinun M. Owens S. Outcome of hematopoietic stem cell transplantation in patients with Mendelian susceptibility to mycobacterial diseases J Clin Immunol 41 2021 1774 1780 34387798 10.1007/s10875-021-01116-1 PMC8604818 46 Hahn K. Pollmann L. Nowak J. Nguyen A.H.H. Haake K. Neehus A.L. Human lentiviral gene therapy restores the cellular phenotype of autosomal recessive complete IFN-γR1 deficiency Mol Ther Methods Clin Dev 17 2020 785 795 32355867 10.1016/j.omtm.2020.04.002 PMC7184269 We acknowledge the contributions of all study participants as well as expert clinicians Simon Schaaf, Helena Rabie, and Dee Abraham (departments of Paediatrics and Child Health, Medical Microbiology, and Immunology, Tygerberg Hospital). ",
  "metadata": {
    "Title of this paper": "Human lentiviral gene therapy restores the cellular phenotype of autosomal recessive complete IFN-γR1 deficiency",
    "Journal it was published in:": "The Journal of Allergy and Clinical Immunology: Global",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12492193/"
  }
}