{
  "title": "Paper_892",
  "abstract": "pmc J Glob Health J Glob Health 1902 jogh JGH Journal of Global Health 2047-2978 2047-2986 International Society for Global Health PMC12487843 PMC12487843.1 12487843 12487843 41032106 10.7189/jogh.15.01006 jogh-15-01006 1 Editorials Two decades of the CHNRI method (2006–2025): Tracking its evolution and contribution to the emerging field of ideometrics https://orcid.org/0000-0001-6993-6884 Rudan Igor  1  2  3 1 2 3 Correspondence to: Igor.Rudan@ed.ac.uk Igor.Rudan@phc.ox.ac.uk 1 10 2025 2025 15 478322 01006 01 10 2025 02 10 2025 02 10 2025 Copyright © 2025 by the Journal of Global Health. All rights reserved. 2025 https://creativecommons.org/licenses/by/4.0/ This work is licensed under a Creative Commons Attribution 4.0 International License. This paper tracks the evolution of the Child Health and Nutrition Research Initiative (CHNRI) method for setting health research priorities and situates it within a much broader, emerging field of ‘ideometrics’ – the quantitative study of how ideas can be generated, evaluated, and prioritised. First presented in 2006, the CHNRI method tackled three key barriers to research priority setting: an infinite number of possible research ideas, uncertainty about future payoffs of investing in research, and the need for a fair, transparent, legitimate, and broadly acceptable consensus. Its proposed solutions were based on the systematic nature of idea generation, explicit context framing, transparent criteria, and expert crowdsourcing, while its scores reflected ‘collective optimism’ towards many ideas that could be optionally weighted by funders and stakeholders. Early demonstrations of its usefulness were followed by the establishment of a landmark World Health Organization (WHO) programme that set priorities across the leading causes of global child mortality. The resulting publications catalysed adoption of the method by major agencies and many national governments. Within a decade, the CHNRI method became the most widely used approach to health research priority setting. The review of the first 50 exercises revealed its practical advantages: its systematic scope, transparency, inclusiveness, flexibility, simplicity, low cost, and publishable outputs. Its ‘natural evolution’ within the global health research community led most users to sensibly adapt its standard criteria to their specific contexts. Experiments on quantitative properties of human collective knowledge and opinion demonstrated accuracy within domains of expertise. They also showed that saturation of experts’ collective opinion occurs with 45–55 scorers, achieving very stable rankings. Subsequent advances introduced bootstrapped confidence intervals, an information-theory expert agreement metric, and clustering analysis to detect scorer sub-structures, strengthening the method. Consultations with funders clarified ‘funding attractiveness’ as a complementary criterion, improving the method’s policy traction. By the year 2025, the CHNRI method underpinned major exercises led by the leading international organisations in all of the world’s regions, and supported research prioritisation in many challenging national and regional settings. A pivotal recent shift is the integration of artificial intelligence (AI)-based large language models: the CHNRI method can now accommodate AI as a partner in all steps of the priority-setting process. Moreover, years of CHNRI practice motivated a broader theoretical move: viewing the brain’s ‘perception of ideas’ as an underappreciated human sense. These advances call for a more quantitative, testable, and replicable future developments in which the CHNRI method will contribute to ‘ideometrics’ – an emerging scientific field devoted to generating, evaluating and prioritising ideas that are likely to lead to human progress in health and beyond. pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement no pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes This editorial summarises the development, implementation and evaluation of the Child Health and Nutrition Research Initiative (CHNRI) method and its contribution to the emerging field of ‘ideometrics’. The CHNRI method is a structured process that can be used to systematically generate, evaluate and prioritise research ideas. It assists research priority setting at all levels – global, regional, national and local [ 1 2 3 6 i.e. i.e. e.g. i.e. i.e. The CHNRI method engages a diversity of stakeholders – funders [ 7 8 9 10 11 12 13 14 15 16 Today, twenty years after its introduction, the CHNRI method has established itself as an important innovation within the emerging field of ‘ideometrics’ – the science of generating, evaluating, and prioritising ideas. ‘Ideometrics’ includes dozens of diverse methods and approaches that have historically been used to assist those three interconnected tasks in many areas of human activity. Once exclusively a human feature, ideas can now also be generated by artificial intelligence (AI) models, with the CHNRI method being the first within the field of ideometrics to recognise and accommodate this major technological progress [ 17 18 YEARS 2006–2008 The development of the CHNRI method At the 10th Global Forum for Health Research held in Cairo, Egypt, in 2006, a new method for setting health research priorities was introduced. I led the transdisciplinary work on its development in the preceding two years (2005–06) as the consultant of the CHNRI of the Global Forum for Health Research in Geneva, Switzerland, which is why it became known as the CHNRI method [ 1 The experts provided feedback on my progress from their disciplinary perspectives at the meetings in Geneva, Switzerland; Baltimore, USA; Dubrovnik, Croatia; and Mumbai, India in 2005, and then in Cape Town, South Africa; Toronto, Canada; and finally in Cairo, Egypt, in 2006. Interestingly, the term ‘crowdsourcing’ was first coined in the magazine ‘Wired’ the very same year (2006) [ 19 After the previous approaches were reviewed [ 3 4 5 i.e. Although its development required a transdisciplinary group of experts to propose some feasible solutions to such challenging problems, the final version of the CHNRI method was simple. In the first step, it defined the existing context within a chosen field of health research and identified a small set of criteria that would recognise one research idea as being ‘better’ than another. These criteria could have been numerous, but the ‘template’ of five of them chosen for the unmodified CHNRI method included: the likelihood that the proposed research idea would be answerable; the likelihood that it would lead to an effective intervention; the likely deliverability, affordability, and sustainability of the future intervention; the likely maximum reduction of the existing disease burden; and any likely effects on equity. In the second step, the method resorted to crowdsourcing: dozens of the leading experts in the chosen field of health research would be invited to propose several of their best research ideas. Then, a ‘consolidated’ list of the research ideas could be developed after similar ones were merged and duplicates were removed. In the third step, all the experts would ‘score’ the ideas by assessing their likelihood of satisfying each criterion. They would do so by answering simply ‘yes’ or ‘no’, while occasionally being allowed to use an ‘informed maybe’ or simply leave the scoring field blank if they did not have enough knowledge to make this judgement [ 6 The final result of the CHNRI process is a simple table that measures the ‘collective optimism’ of the leading experts towards each research idea in terms of how it would satisfy each of the criteria. All the resulting numerical scores are intuitive, as they range between 0–100%. Then, the overall research priority score (RPS) can be calculated as a simple average of all criterion-specific scores. Moreover, specific weights can be placed on some criteria that are seen as more important by the funders or wider external stakeholders, allowing funders, stakeholders, patients, or even members of the public to influence the overall scores [ 6 This process is quick and cheap, as well as systematic, flexible, and easy to tailor to many different needs. Also, it is democratic, transparent, and replicable. Its outputs address the needs of the funders of health research; upon the completion of each ‘CHNRI exercise’, the funders can easily see what do many leaders within a chosen research community collectively think about many different research ideas, which they themselves nominated as the most promising. Importantly, the final rankings are influenced by everyone equally; each expert’s input independently contributes only a very small fraction to the overall result, so that no single person can have undue influence on the final ranking list. The final scores across all the criteria typically range from just above 90% to below 20%, suggesting that the CHNRI method performs well at discriminating between the many competing research ideas. The four foundational papers on the CHNRI method were published in the Croatian Medical Journal in 2007 and 2008 [ 3 6 20 21 First implementations of the CHNRI method The first publication that drew the attention of the international research community to the new method was a policy paper entitled ‘Childhood Pneumonia and Diarrhoea: Setting our Priorities Right’, published in ‘The Lancet Infectious Diseases’ in 2007 [ 22 The first country to quickly respond to this publication and the opportunity to utilise the new method was South Africa, where the first actual implementation of the CHNRI method took place. I travelled to Cape Town, trained a group of prominent local researchers in using the method, and assisted in the conduct of the exercise based on the originally proposed set of the CHNRI criteria. Led by Tomlinson and colleagues, 63 proposed research ideas were scored by a group of six leading national child health experts, resulting in a paper entitled ‘Setting Priorities in Child Health Research Investments for South Africa’, published in the journal ‘PLoS Medicine’ in 2007 [ 23 Two other groups decided to become early adopters and use the CHNRI methodology within their own fields. Chisholm and colleagues were preparing an influential piece on the challenges with health services for mental disorders. Within their paper, they conducted a CHNRI exercise to set research priorities, involving 24 expert scorers who proposed 100 research ideas, while keeping the original set of the proposed CHNRI criteria. This paper was published in ‘The Lancet’ in 2007 [ 24 Soon thereafter, Walley and colleagues were working on another influential paper, addressing challenges in global primary health care. Within their paper, they also decided to conduct a CHNRI exercise, involving 20 expert scorers and 69 proposed research ideas. This was the first innovative application of the CHNRI method, where the original set of criteria was modified according to the needs of the exercise: the criterion ‘likelihood of effectiveness’ was replaced by ‘feasibility of undertaking’, while an entirely new, sixth criterion was added: ‘likelihood to fill a critical gap in knowledge’. The paper, published in ‘The Lancet’ in 2008 [ 25 Presentation of the CHNRI method at the 9th, 10th, 11th, 12th and 13th Global Forum for Health Research One of the first meetings of the team involved in the development of the CHNRI method was held at the 9th Global Forum for Health Research in Mumbai, India, in 2005, where I outlined and presented the key challenges to the audience. Then, I first presented the CHNRI method, and distributed the first published version [ 1 3 6 YEAR 2009 The WHO sets research priorities to address global child mortality using the CHNRI method In 2009, the Department of Maternal, Newborn, Child, and Adolescent Health of the WHO decided to use the CHNRI method to conduct five separate exercises, addressing the five most important causes of global child mortality based on the CHERG’s technical work. I was again engaged as the consultant who coordinated the process. It resulted in five landmark publications that directed global funding for priority research to address the five key causes of global child mortality, which was the 4th Millennium Development Goal of the United Nations. The output included papers by Fontaine and colleagues on childhood diarrhoea [ 26 27 28 29 30 These five papers, published mainly in the journal ‘PLoS Medicine’, raised considerable international interest among funders and policymakers alike. The novelty was that all five papers largely promoted one specific domain of research called ‘health policy and systems research’. Given the urgency of prioritising research for reducing a burning problem of global child mortality, it is not surprising that the investments in this type of health research came on top. Dozens of international experts invited by the WHO to take part in these CHNRI exercises converged towards the suggestion that lot more impact could be achieved with the resources, interventions and knowledge that we already have as a research community, but they are not being used efficiently. The number of research ideas typically addressed in these exercises ranged from 61 to 156, while the number of scorers ranged from 13 to 45. In the meantime, Tomlinson, who led the first national-level exercise in South Africa, mobilised the WHO staff within his own fields of research interest, resulting in two additional high-profile publications with the WHO participation: a CHNRI exercise on disabilities, published in by ‘The Lancet’ in 2009 [ 31 32 24 25 33 The WHO convenes a meeting with funders Having completed the five CHNRI-based exercises, the WHO was keen to engage funders and share the results with them to ensure their real-world impact. I was also interested in whether it would be possible to add yet another criterion to the CHNRI exercises – ‘attractiveness to funders’ – and what would be its basis. In 2009, together with the representatives of the WHO Maternal, Newborn, Child, and Adolescent Health (MNCAH), I coordinated a meeting at the WHO in Geneva, Switzerland, which gathered 40 representatives from funding organisations, including the Bill and Melinda Gates Foundation (BMGF); the Wellcome Trust; the USA National Institutes of Health (NIH); the UK Department for International Development (DFID); Save the Children; the International Clinical Epidemiology Network (INCLEN); EPICENTRE; the UNICEF; the United States Agency for International Development (USAID); PATH; the Ministry of Science and Technology of India; the ministries of health of Zambia, Pakistan, and Brazil; the Global Forum for Health Research, Trinity Global Support Foundation, Children's Investment Fund Foundation (CIFF), and Osaka Research Institute for Maternal and Child Health. Sixteen representatives of funding agencies agreed to participate in the meeting on condition of anonymity. Their views did not represent official agency positions and implied no funding obligations [ 7 After the aims of the consultation were explained, participants were presented with the top 10 research priorities for each of the five major causes of child deaths – pneumonia, diarrhoea, birth asphyxia, neonatal infections, and preterm birth/low birth weight – identified through WHO-coordinated CHNRI exercises [ 26 30 7 The meeting reinforced the importance of involving funders early in exercises like the CHNRI to build ownership of results. The criterion of ‘attractiveness to funders’ should complement those valued by researchers and other stakeholders in the CHNRI framework; otherwise, the prioritisation outcomes may have less influence on investment decisions. The CHNRI method offers funders transparent comparisons of risks and benefits across competing research ideas, translating the research community’s collective judgment into an accessible and replicable format. However, challenges remain in ensuring funders’ systematic engagement, clear communication of results, and commitment to using CHNRI outputs. The conclusion from this meeting was that developing tools to track the CHNRI’s influence on funding decisions and detect shifts in investment priorities, especially where public funds are involved and the main goal is cost-effective health improvement, will remain an even greater challenge [ 7 YEAR 2010 The BMGF sets research priorities to accelerate emerging interventions The WHO series on priority research for reducing child mortality and the subsequent meeting with the funders attracted interest from another major funder of global health research – the BMGF – which at the time funded many large initiatives and projects to reduce global child mortality. I received two major grants from the BMGF to modify the CHNRI method to focus only on emerging interventions based on innovative technological solutions that could accelerate implementable and feasible interventions. The target diseases for these grants were any novel interventions for childhood pneumonia and diarrhoea, and new diagnostic solutions for neonatal infections. This work resulted in a series of papers published as a collection in the journal ‘BMC Public Health’. They were based on a method that had nine criteria, where ‘low development cost’, ‘sustainability of implementation’, ‘acceptability to health care providers’ and ‘acceptability to end users’ were added to the standard five criteria. The series addressed the emerging interventions against pneumococcus [ 34 35 36 37 38 39 40 41 42 YEAR 2011 Presentation of the CHNRI method at the 19th World Congress of Epidemiology in Edinburgh, UK In 2011, the 19th International Epidemiological Association’s World Congress of Epidemiology was held in Edinburgh, UK, where I was given the privilege of delivering a plenary presentation on the CHNRI method’s development and implementation over the first five years of its existence (2007–11). My presentation was later published in the journal ‘Public Health’, with the title ‘Global health research priorities: Mobilising the developing world’ [ 15 Multiple other implementations and international uptake As a result of the increasing visibility of the CHNRI-based priority setting exercises, some global health experts published notable further examples of their use in some of the most high-profile journals. Three were published in the journal ‘PLoS Medicine’: Tol and colleagues set research priorities for psychosocial support in humanitarian settings, where 74 research ideas were scored by 82 experts [ 43 44 45 46 47 YEARS 2012–2015 The following years saw the widespread use of the CHNRI method at national, regional, and global levels, as well as its first implementations outside of the field of health research, showing it to be flexible and able to universally address various challenges. Further examples of global-level implementation Notable papers from these four years that prioritised ideas in various fields of health research using the CHNRI method included those by Hindin and colleagues, who focussed on prioritising adolescent sexual and reproductive health needs [ 48 49 50 51 52 53 54 55 56 57 58 59 Further examples of regional- and national-level implementation An example of a regionally focussed exercise conducted in this period was the work by Rollins and colleagues in three African countries – Malawi, Nigeria and Zimbabwe – who mobilised 191 scorers to prioritise 90 implementation research ideas on to prevent mother-to-child transmission of HIV [ 60 The examples of national-level implementation in this period were the papers by Sekar and colleagues prioritised research to address zoonotic diseases in India [ 61 62 63 It is also worth noting that, in this period, the CHNRI method also entered the scientific literature in the Chinese language, as two exercises were performed in China [ 64 65 64 65 The first use of the CHNRI method outside health research In this period, the first papers began to appear that applied the CHNRI method outside the field of health research altogether. The first such example was the paper by Read and colleagues, who applied the approach in the remarkably important field of education in LMICs. This paper was published in the journal ‘Current Issues in Comparative Education’, with 89 proposed ideas scored by 37 scorers [ 66 YEAR 2016 The first PhD students advancing the CHNRI method The CHNRI method’s uptake and implementation attracted the first PhD students to the University of Edinburgh and the London School of Hygiene and Tropical Medicine. They were keen to further improve the aspects of this methodology. Sachiyo Yoshida from the WHO set out to develop better answers to the typical reviewers’ comments on the CHNRI-based articles. She sought whether several common criticisms hold true: that the list of research ideas is not exhaustive enough; that another group of experts would produce substantially different final rankings; and that there must be a sub-structure within the identified expert group that introduces biases to the rankings in an unpredictable way. She re-analysed the results from several previously conducted CHNRI exercises and, through a series of experiments and statistical modelling, provided several potentially novel and useful insights on quantitative properties of collective human knowledge [ 11 12 Yoshida and I, joined by her other supervisor Simon Cousens, first asked a larger group of about 200 persons with expertise in one specific area to answer questions that have a precise numerical value as a correct answer. We asked them to first answer ten questions in their own area of expertise, then ten more questions where they were likely to have some (general) knowledge, and finally, ten questions from an entirely different area of expertise where they were not expected to have any knowledge. Our experiments showed that the collective knowledge of a group with expertise in one specific area should always be very close to the true answer. In most cases, and under most assumptions, the average answers from the collective will be more accurate over the ten questions than the results of an ‘average’ individual in the group. Moreover, the accuracy of collective prediction may be enhanced by allowing the individuals with low confidence in their answer to withdraw from answering, which further improves the collective prediction. However, the average collective answers were less accurate when they concerned general knowledge questions, and entirely inaccurate when they dealt with questions in another area of highly specific expertise, which they themselves did not have [ 11 These experiments provided strong support to both ‘crowdsourcing’ as a robust approach for assessing the collective optimism of a group of experts towards the value of research ideas, and also for relying on experts only, while finding other roles for the funders and different stakeholders. They demonstrated that collective knowledge is most valuable when it is drawn from the experts in a field, while including any other group will reduce the accuracy of the collective prediction [ 11 67 Furthermore, we observed that for each new invited expert, the likelihood of contributing an idea that hasn't already been nominated would inevitably start to decrease. This implied that there must be a point of a near-saturation of proposed research ideas. This point will be reached more quickly in smaller research fields, while in large and broad fields it may take several hundreds of invited experts, each providing several new ideas. Our observation implies that although the pool of possible research ideas might indeed be infinite, in reality, it is possible to achieve a comprehensive representation of the spectrum of the feasible research ideas within a well-defined context through a large enough sample of invited experts. Furthermore, statistical simulations that used a gradually increasing sample of experts from completed exercises showed that there is also a point – usually when about 45-55 researchers are included in the process of scoring – after which it is no longer possible to get a statistically significantly different ranking of research ideas. This holds true even if hundreds of scoring experts are added to the scoring process, provided that they are all knowledgeable enough about the subject. Interestingly, this finding suggested that human collective opinion saturates and stabilises quite quickly, requiring only 45–55 experts with sufficient knowledge of the subject [ 12 68 Adding to this, Wazny and colleagues focussed on crowdsourcing as the core component of the CHNRI method. They first reviewed the applications of crowdsourcing in all fields [ 13 14 69 69 70 Journal of Global Health’s series of seven papers advancing the CHNRI method Ten years after its first presentation, in 2016, the CHNRI method had already become the most widely used for setting health research priorities in the 21st century, surpassing the Delphi technique and other approaches [ 16 7 8 9 7 9 10 11 12 71 The first review of the CHNRI-based exercises – understanding the natural evolution of the CHNRI method The first 50 CHNRI priority-setting exercises, published between 2007 and 2016, reached out to nearly 5000 researchers, policymakers, and programme officers, seeking their participation in the generation of research ideas and their scoring by the agreed criteria. The initial response rate across all exercises was above 60%, with more than 3000 experts submitting about 10 000 ideas (more than three per expert). Eventually, 4282 ideas were scored (an average of 86 per exercise), indicating that more than 50% of the initially submitted questions were duplicates/redundant and merged with other questions, or poorly framed and discarded. Eventually, 2403 invited experts participated in scoring (an average of 48 per exercise). The journals most receptive to the first 50 papers were ‘PLoS Medicine’ (n = 10), ‘BMC Public Health’ (n = 7) and ‘The Lancet’ (n = 6) [ 71 Many of the exercises addressed child morbidity or mortality and improved development (n = 23), maternal, perinatal, and sexual health (n = 4), and several major infectious diseases that are not primarily maternal, newborn, and child health issues (n = 3). The most frequent application outside of this initial focus was mental health (n = 8), and all-cause mortality, morbidity, and disability in adults (n = 4). Most exercises focussed on LMICs (n = 25), while others had a global (n = 16), national (n = 7), and sub-national (n = 1) scope. Twenty-eight papers focussed on children and/or newborns, eight on adolescents and young adults, and 14 on adults or all age groups [ 71 Most papers used a recommended CHNRI time frame of 10 years (n = 37), 10 had shorter, and three had longer time frames. The natural evolution of the originally proposed CHNRI method through its implementations is exemplified best in the modification of the criteria used for prioritisation by the users. In fact, only one-third of the exercises retained the original five CHNRI criteria, with most modifications including both the changes in the number and the choice of specific criteria. Five criteria were most frequently used (n = 28), followed by four or three (n = 6), but about a third of papers increased the number of criteria (n = 16), where one exercise used 13 of them. The five ‘standard’ CHNRI criteria were the most frequently used (from n = 43 for the ‘equity’ criterion to n = 35 for the ‘effectiveness’ criterion), but the most frequent new criteria were ‘feasibility’ (n = 11), ‘acceptability’ (n = 11), ‘low cost’ (n = 11), ‘sustainability’ (n = 11), ‘relevance’ (n = 6), and ‘applicability’ (n = 6). This showed the flexibility of the CHNRI method, where adjustments of the process to the needs of each specific exercise are encouraged [ 71 Several broad messages emerged for health research policy across these 50 CHNRI exercises. When a health issue was poorly understood – its population burden, risk factors, or potential interventions – epidemiological research was usually the top priority, reflecting the need to define the problem’s ‘architecture’. For most contemporary issues, however, where burden and risk factors are known and interventions exist but are underused, delivery research dominated – including health systems, policy, operations, and implementation research – particularly in LMICs. This emphasis was reinforced by the short timeframes (often 10 years) and urgency of reducing child mortality. In contrast, longer horizons (20–30 years) or conditions lacking effective interventions shifted priorities toward translational or discovery research. Translational questions scored highly when existing interventions required simple adaptations ( e.g. 71 The apparent advantages of the CHNRI method The first review of the conducted CHNRI exercises implied that the popularity of the method resulted from several key advances. First, the method is systematic, providing a framework to handle an unlimited range of research questions across all categories of health research. Second, it is transparent, with clearly defined context and criteria, and with all inputs documented in numerical data sets, ensuring replicability. Third, it is democratic, relying on a crowdsourcing approach for both submitting and scoring questions. This prevents any individual from exerting undue influence, as results reflect the collective judgment of a broad group of experts. Fourth, the process is inclusive, fostering ownership by engaging donors, researchers, and other stakeholders. Donors define context and criteria, researchers contribute and score questions, and stakeholders can assign weights to criteria. Fifth, it is flexible, as it can be easily adapted to diverse contexts by modifying criteria or components. Sixth, it is simple, requiring only ‘yes’/‘no’ inputs and producing intuitive 0–100% scores that reflect collective optimism. Seventh, the results are transparent, replicable, and amenable to quick and easy validation, which does not even require complex statistical methods, although they can be added. Eighth, the method is quite inexpensive to conduct, given the usefulness of its outputs. Finally, its structured and objective outputs are publishable in scientific journals and easy to disseminate globally [ 71 Further notable examples of implementation Several high-profile priority setting exercises were published in respected scientific journals in 2016. ‘The Lancet Global Health’ published the exercises by Dua and colleagues on child development [ 72 73 74 75 YEARS 2017–2019 Further notable examples of global-level implementation Sir Aziz Sheikh and the WHO set research priorities for medication safety in the context of the WHO’s Third Global Patient Safety Challenge: Medication Without Harm. The exercise included world-leading researchers in patient and medication safety and a pool of experts from the WHO Global Patient Safety Network, and it generated research priorities separately for high-income countries (HIC) and LMICs [ 76 77 Further regional- and national-level implementations of the CHNRI method A leading example of the regional implementation was the one by the NIHR Global Health Research Unit in Respiratory Health (RESPIRE), a collaboration between the University of Edinburgh, UK, and four countries in South-East Asia (Bangladesh, Pakistan, India, and Malaysia) which conducted an internal process of identifying research priorities for respiratory health issues in this region [ 78 In this period, the CHNRI method also found its implementation within Europe. The WHO European office conducted the CHNRI-based exercise to define the tuberculosis research agenda, as nine countries in the WHO EURO region were in the top 30 countries with the highest burden globally of multidrug-resistant tuberculosis [ 79 The period between 2017–2019 saw some landmark examples of national-level implementation that truly surpassed all previous efforts in their ambition, size, and scope. The two papers that described a national-level exercise in India, led by Narendra Arora and the Indian Council of Medical Research (ICMR) and the INCLEN, and assisted methodologically by Kerri Wazny, stand out as possibly the best examples to date of how the method can be applied at the national level to assist the government in setting health research priorities. In India, Arora and colleagues undertook a nationwide exercise through which they managed to engage faculty from 256 institutions to identify research priorities in the maternal, newborn, and child health and nutrition themes for 2016–25 [ 80 80 81 Another landmark example of national-level implementation can be credited to the PhD work of Parisa Mansoori, the third doctoral student who chose the CHNRI method as her topic of interest. Working within a five-member management team and the Iranian CHNRI Health Research Priority Setting Group, she led a national-level CHNRI exercise for Iran which engaged 48 prominent Iranian academic leaders, a group of research funders and policymakers, and 68 stakeholders from the wider society [ 82 82 YEARS 2020–2023 The implementation of the CHNRI method during the COVID-19 pandemic The CHNRI method has demonstrated its utility in the years 2020–2023 during the COVID-19 pandemic. This context was entirely different from the previous CHNRI-based exercises because it required urgency, while decisions often needed to be made in the context that lacked important information. However, there were several excellent examples where the CHNRI method assisted researchers, stakeholders and policymakers alike. The International Society of Global Health (ISoGH) identified research priorities to reduce the impact of COVID-19 in LMICs by considering 192 research questions that were scored by 52 experts. Among the top 10 research priorities, research questions related to vaccination were prominent, joined by the questions on effective strategies to manage COVID-19 globally and in LMICs, integrating health care for COVID-19 with other essential health services in LMICs, and assessing COVID-19 patients’ needs in rural areas. The ISoGH called on the funders of health research in LMICs to consider the urgency and priority of this research during the COVID-19 pandemic and support studies that could make a positive difference for their populations [ 83 84 Another collaboration, the ‘International COVID-19 Airways Diseases Group’, conducted a CHNRI exercise to identify research priorities to better understand long-term sequelae of COVID-19 in patients with pre-existing and new-onset airways disease. A list of 98 research topics was scored by 48 experts, while patients with pre-existing or post-COVID-19 airways disease contributed by weighing selected criteria. The highest-ranked research ideas focussed on the investigation of the relationship between prognostic scores at hospital admission and morbidity after hospital discharge in patients with and without pre-existing airways disease. High priority was also assigned to comparisons of the prevalence and severity of post-COVID-19 fatigue, sarcopenia, anxiety, depression, and risk of future cardiovascular complications in patients with and without pre-existing airways disease. Presenting their findings in ‘The Lancet Respiratory Medicine’ [ 85 Francis-Oliviero and colleagues used the CHNRI method to set research priorities to increase vaccination coverage in Europe through the European Union’s joint action on vaccination. They prioritised approaches for generating and synthesising evidence to support policies and strategies aiming at increasing vaccine coverage. They initially focussed on four pre-selected pilot vaccines – pertussis, measles-containing combination vaccines, influenza and HPV – but aim to continue and identify vaccination research priorities regarding all vaccines used in the EU, including COVID-19 vaccines [ 86 Substantial methodological improvements through the activities of the ISoGH Peige Song is the fourth among my former PhD students who contributed to the advancement of the CHNRI method. She was only introduced to the method towards the end of her studies, but made significant methodological contributions during her post-doctoral years, working with Yajie Zhu. She noticed that the originally proposed CHNRI process could use more sophisticated statistical methods to analyse the input from the scorers, thus making it more robust and statistically rigorous. As she was later also elected to the role of the vice-president of ISoGH, the majority of methodological progress on the CHNRI method during the period 2020–2023 was achieved through the activities of the ISoGH and its own priority-setting exercises. First, Song noticed that the post-hoc 17 Another need that is often present when the CHNRI papers are reviewed is demonstrating that there is no sub-structuring among the scorers that could bias the overall scores. One need is to analyse experts' scores to identify any ‘clusters’ of experts who scored very similarly. Another need is to explore how large such clusters may be, and how they affect the overall scores, because this could control for potential bias. In recent CHNRI-based exercises, Song and Zhu addressed this problem by assessing the diversity of expert scoring through hierarchical clustering on both the overall scores and those within each criterion [ 17 87 Further notable examples of global-level implementation Among the many notable examples of the global-level implementation from this period, I will reflect on the three studies. Paskins and colleagues, on behalf of the Musculoskeletal Disorders Research Advisory Group vs 88 Adeloye and colleagues conducted a CHNRI-based exercise within the NIHR RESPIRE collaboration that involved many globally recognised experts in chronic obstructive pulmonary disease (COPD). They identified research priorities that need to be addressed in the next 10 years to substantially reduce the global impact of COPD based on 230 research ideas scored by 34 experts. Of the top 20 overall research priorities, six were focussed on feasible and cost-effective pulmonary rehabilitation delivery and access, particularly in primary/community care and low-resource settings, while a further three called for research on improved screening and accurate diagnostic methods for COPD in low-resource primary care settings [ 89 Ko and colleagues applied the CHNRI methodology to prioritise research to enable the implementation of the initiative ‘Ending Cholera: A global roadmap to 2030’. A list of research questions was derived from the Working Groups of the Global Taskforce for Cholera Control and other experts, engaging 177 experts and stakeholders and prioritising 32 research questions that consider both immediate and long-term Roadmap goals [ 90 Further notable examples of regional- and national-level implementation By early 2020 and the beginning of the COVID-19 pandemic, the CHNRI method had already been implemented in several regions of the world. The first national- and regional-level examples of implementation were conducted and published for African countries (starting in 2007), then South America (starting in 2012–2013), followed by China (starting in 2014–2015), South-East Asia (starting in 2017–2018), West Asia (starting in 2018), and Europe (starting in 2019). However, in the period 2020–2023, the CHNRI method managed to make an impact in all the remaining world regions. The first example of a regionally engaged approach in the Western Mediterranean region is the study by Mandil and colleagues from the WHO Regional Office for the Eastern Mediterranean in Cairo, Egypt. They conducted a CHNRI-based exercise to develop priorities for a regional research agenda and its implementation in Jordan and Pakistan, which was published in the ‘Eastern Mediterranean Health Journal’ in 2021 [ 91 91 Two regional-level examples from Africa that were conducted in this period also deserve mention for their ambition and an impressive expansion of the CHNRI method’s implementation in challenging settings. Leopold Ouedraogo from the WHO Regional Office for Africa in Brazzaville, Congo, and his colleagues published an entire series of the CHNRI-based exercises in the journal ‘Advances in Reproductive Sciences’ in 2021. The themes chosen for health research prioritisation included reproductive, maternal health, and ageing; mHealth and innovative strategies in sexual and reproductive health and rights; cervical cancer prevalence, prevention and treatment; gender-based violence; preventing unsafe abortions; sexual and reproductive health and rights, including a separate exercise for humanitarian settings [ 92 97 Alobo and colleagues published another impressive CHNRI exercise focussed on the African region in the journal ‘AAS Open Research’ in 2021. Research priorities in maternal and neonatal health were established by engaging over 900 experts across Africa. From the 609 proposed ideas, 46 were prioritised. The leading ones focussed on improving the identification and diagnosis of high-risk mothers and newborns; also, enhancing access to treatment through incentives for attracting and retaining skilled health workers in rural areas; strengthening emergency transport; and assessing health system readiness; and increasing uptake of proven interventions such as kangaroo mother care. Emphasis was placed on expanding access to quality care at the lowest delivery levels and ensuring community participation in interventions [ 98 Finally, the CHNRI method started finding its applications even in the high-income regions such as North America and Australia, although these exercises are focussed on entirely different themes in comparison to those in LMICs. An example from Canada includes the study from Cheung and Du Mont, who built a Canadian research agenda to address gender-based violence against trans people and presented their work at the University of Toronto in 2021, publishing it later in ‘Health Research Policy and Systems’ journal [ 99 100 101 YEARS 2024–2025 Today, nearly two decades after the CHNRI method was introduced, more than 200 exercises have been published in the world literature that were based on the standard, or the modified version. The method has been widely adopted by major international organisations such as the WHO and UNICEF as their suggested approach to setting research priorities. It has been used by many international organisations, professional societies, and national governments to set health research priorities, spanning a wide spectrum of topics and publishing the results in the leading medical journals. Further notable examples of global, regional, and national-level implementation The period of 2024–25 brought about some of the best-designed and most rigorously conducted CHNRI exercises at the global level, many of them under the WHO’s coordination. Bertagnolio and colleagues published WHO’s global research priorities for the highly topical issue of antimicrobial resistance in human health in ‘The Lancet Microbe’ journal in 2024 [ 102 103 104 105 106 Wood and colleagues prepared a background paper for the UNICEF in 2025 focussed on identifying research priorities for the effective inclusion of children with disabilities in LMICs [ 107 108 Special initiatives and international collaborations are being formed in the meantime, too, which address specific priorities in global health. Recently, the Climate Change and Health Impact Research Priorities Group published a preprint of their research priority setting exercise to both understand and address the impact of climate change on the health of women and children in LMICs [ 109 17 87 110 111 112 An example of progress at the regional level is the work by Lambach and colleagues developed on behalf of the WHO SEARO region, which reports on the WHO’s Immunisation and Vaccines-Related Implementation Research Advisory Committee meeting in 2024, where the CHNRI exercise was used to set research priorities in immunisation programme strengthening for South-East Asia [ 113 There have also been some notable examples of CHNRI exercise successfully conducted during this period in very challenging settings at the national level, too. El Baz and colleagues and the Afghanistan Health Systems Research Prioritization Collaborators completed the first research priority setting exercise for Afghanistan [ 114 115 116 117 118 The rise of AI and its inclusion in the CHNRI method In 2024, a major, unforeseen change affected the development and implementation of the CHNRI method. Originally, it was envisaged as the method that assigns scores and ranks to research ideas that were generated, evaluated and prioritised by humans. However, the advent of large language models such as ChatGPT, DeepSeek, Claude, Grok, and others has changed the context entirely. AI can now also generate research ideas, evaluate them using different criteria, and propose research priorities. To the best of our knowledge, we were the first to demonstrate that ChatGPT is able not only to generate and assess research ideas, but also to write an entire research article [ 119 17 In an interesting recent viewpoint, Garry and colleagues discussed the potential role of AI in research priority setting exercises [ 120 17 87 120 Ethical considerations and reporting guidelines for research priority setting An appreciable effort was made recently by Joseph Millum in 2024 to consider the ethical aspects of priority-setting exercises in health research [ 121 121 Another progress that also deserves a mention is the proposal of a “REporting guideline for PRIority SEtting of health research” (REPRISE) [ 122 122 The first evaluation of the impact of the CHNRI method’s implementation Over the past two decades, the CHNRI method has achieved global recognition, uptake and implementation by numerous international organisations, governments and groups of prominent researchers. However, to demonstrate the value of the method, and of the emerging scientific field of ideometrics, its real-world impact will need to be scientifically evaluated against the alternative – i.e., the scenario that would evolve in the absence of the CHNRI-based or ideometrics-based prioritisation process. A rare attempt to scientifically evaluate the effect of the CHNRI method’s implementation has been published by Gupta and colleagues from the WHO’s Department of Maternal, Child, Adolescent Health and Ageing [ 123 51 123 BRAIN’S PERCEPTION OF IDEAS AS AN UNDERAPPRECIATED HUMAN SENSE I recently made further theoretical progress, based on my experience with the CHNRI method, that could give rise to a new scientific field. Namely, based on nearly two decades of implementing the CHNRI method with many groups and working through more than 20 000 research ideas, I proposed that humans may have an underappreciated sense – the ‘perception of ideas’ – with a human brain being the primary sensory organ [ 124 124 THE CONTRIBUTION OF THE CHNRI METHOD TO THE EMERGING FIELD OF IDEOMETRICS This new angle on understanding of the brain's sensory role in continuously assessing many competing ideas may suggest that prioritising ideas for health research using the CHNRI method is merely a highly specific case of a much more general process. This process could generally be called ‘ideometrics’, as it essentially attempts to ‘measure ideas’ – as we implied in the title of the first book on the CHNRI method in 2022 [ 2 As an emerging field of science, ideometrics is fundamentally based on the human brain’s ability to generate, evaluate, and prioritise ideas on how to address just about any situation. In doing so, as described in my ‘sense of ideas’ work [ 124 67 As an emerging quantitative field of science, ideometrics should not remain limited to health research. Instead, it should continue developing and applying methods to generate, evaluate and prioritise ideas for just about any purpose, and revise the ones already prioritised. Initially, it could be applied in many areas of science outside of health to set research priorities – e.g. i.e. Thoughts of a possible emerging field of ‘ideometrics’ and the position of the CHNRI method within this scientific field led me to explore other methods and approaches that perform the CHNRI method’s role in other areas of human activity, i.e. to generate, evaluate, and prioritise ideas. I made a very preliminary list, which is neither complete nor comprehensive – it is just a start. The purpose of presenting it here is to demonstrate a surprising finding: humans have been using dozens of methods and tools throughout their entire history to generate, evaluate, and prioritise ideas. The list shows about 70 such methods and contains key references describing each approach [ 125 205 Table 1 Table 1 Table 1 The landscape of approaches, methods and tools that have been historically used to generate, evaluate and prioritise ideas. Idea generation methods (approaches used to produce novel ideas, concepts, or hypotheses) Individual and cognitive techniques Stream of consciousness and freewriting (William James, 1890 [ 125 126 Theory of Inventive Problem Solving – TRIZ (Genrich Altshuller, 1946 [ 127 Morphological analysis (Fritz Zwicky, 1957 [ 128 Lateral thinking (Edward de Bono, 1967 [ 129 SCAMPER technique (Robert F. Eberle, 1971 [ 130 Mind mapping (Tony Buzan, 1974, 1993 [ 131 132 Heuristics and biases framework (Amos Tversky and Daniel Kahneman, 1974 [ 133  Six Thinking Hats (Edward de Bono, 1985 [ 134  Group-based and social approaches Brainstorming (Alex F. Osborn, 1942, 1953 [ 135 136 Focus groups and in-depth interviews (Robert K. Merton, Marjorie Fiske, Patricia L. Kendall, 1956 [ 137 Delphi technique (Norman Dalkey and Olaf Helmer, RAND Corporation, 1963 [ 138 Nominal Group Technique (Andre L. Delbecq and Andrew H. Van de Ven, 1971 [ 139 World Café (Juanita Brown and David Isaacs, 1995 [ 140 Open Space Technology (Harrison Owen, 1997 [ 141 InnoCentive (Alpheus Bingham, Aaron Schacht, and Dwayne Spradlin, 1998, 2011 [ 142 James Lind Alliance (Nick Partridge and John Scadding, 2004 [ 143 Child Health and Nutrition Research Initiative – the CHNRI method (Igor Rudan, 2006, 2008 [ 1 6  IdeaScale (Vivek Bhaskaran and Rob Hoehn, 2009 [ 144  Design and innovation frameworks Human-Centered Design (John E. Arnold, 1958 [ 145 146 147 Design Thinking (Herbert Simon, 1969 [ 148 149 Agile ideation sprints (Ken Schwaber and Jeff Sutherland, 1995 [ 150 Hackathons (John Gage and OpenBSD, 1999 [ 151  Lean Startup Methodology (Eric Ries, 2011 [ 152  Computational and AI-driven methods Genetic algorithms and evolutionary computation (John Holland, 1975 [ 153 Automated hypothesis generation (Don R. Swanson, 1986 [ 154 Generative adversarial networks for idea synthesis (Ian Goodfellow, 2014 [ 155   Large language models for ideation support (Ashish Vaswani et al., 2017 [ 156 157  Idea evaluation methods (techniques to judge the quality, feasibility, novelty, or value of proposed ideas)  Expert-based evaluation Peer review (Henry Oldenburg, 1665 [ 158 Modified Delphi for scoring (Norman Dalkey and Olaf Helmer, RAND, 1963 [ 138 Expert panels and consensus conferences (National Institutes of Health, 1977, 1990 [ 159  Analytical Hierarchy Process (Thomas L. Saaty, 1977,1980 [ 160 161  Quantitative assessment metrics Cost-effectiveness and cost-benefit analysis (Abbé de Saint-Pierre, 1708 [ 162 163 Net present value (NPV) and internal rate of return (IRR) (Irving Fisher, 1907 [ 164 165 Patent metrics (US Patent & TM Office, 1947; Adam Jaffe, Manuel Trajtenberg, Bronwyn Hall, 1993 [ 166 Bibliometric and scientometric indices (Eugene Garfield, 1955 [ 167 168 169  Technology Readiness Levels (Stanley Sadin and NASA 1970s [ 170 171  Scoring models and criteria-based frameworks Multi-criteria decision analysis (MCDA) (Harold W. Kuhn and Albert W. Tucker, 1951 [ 172 SWOT analysis - Strengths, Weaknesses, Opportunities, Threats (Albert S. Humphrey, 1960s [ 173 Weighted scoring models (Stanley Zionts, 1979 [ 174 Pugh matrix – decision-matrix method (Stuart Pugh, 1980s, 1990 [ 175  Feasibility-Desirability-Viability framework (Tim Brown, 2009 [ 149  Crowd-based assessment Wisdom of the crowd techniques (Francis Galton, 1907 [ 176 Prediction markets (Robin Hanson, 1980s, 1990 [ 177 James Lind Alliance (Nick Partridge and John Scadding, 2004 [ 143 Child Health and Nutrition Research Initiative (CHNRI) method (Igor Rudan, 2006, 2008 [ 1 6  Social media engagement metrics as proxies for idea traction (Jason Priem, 2010 [ 178  Scientific and philosophical validity tests Logical consistency and deductive reasoning (Aristotle, 4th century BC [ 179 180 Empirical testability, replicability and falsifiability (Francis Bacon, 1620 [ 181 182   Paradigm shift (Thomas Kuhn, 1962 [ 183  Idea prioritisation methods (methods to select the most promising ideas for action, investment, or further study  Structured decisionmaking frameworks Paired comparison methods (Louis L. Thurstone, 1927 [ 184 Multi-voting and Dot-voting (group facilitation practices, 1950s–1960s [ 185 186 Delphi with ranking rounds (Norman Dalkey and Olaf Helmer, RAND, 1963 [ 138 Nominal Group Technique with voting (Andre L. Delbecq and Andrew H. Van de Ven, 1971 [ 139  Analytic Hierarchy Process (Thomas L. Saaty, 1977,1980 [ 160 161  Priority-setting frameworks in health and science RAND/UCLA Appropriateness Method (RAND Corporation and UCLA clinicians, 1980s, 2001 [ 187 Essential National Health Research framework (COHRED, 1990 [ 188 GRADE methodology with EtD (Evidence to Decision) frameworks (GRADE Working Group, 2000 [ 189 James Lind Alliance Partnerships (Nick Partridge and John Scadding, 2004 [ 143 Combined Approach Matrix (Abdul Ghaffar, Andres de Francisco, Stephen Matlin, 2004; [ 190  Child Health and Nutrition Research Initiative (CHNRI) method (Igor Rudan, 2006, 2008 [ 1 6  Portfolio and pipeline management tools Real Options Analysis (Stewart C. Myers, 1947 [ 191 R&D portfolio matrices (Bruce Henderson and Boston Consulting Group, 1970 [ 192 Product roadmapping and prioritization grids (Robert Phaal and colleagues, 1970s to 2000s, 2004 [ 193  Stage-gate model (Robert G. Cooper, 1980s, 1990 [ 194  AI-driven prioritisation tools Knowledge graphs and semantic similarity clustering (Allan M. Collins and M. Ross Quillian, 1960s [ 195 Reinforcement learning-based portfolio optimization (Richard S. Sutton and Andrew G. Barto, 1998 [ 196  Automated priority setting via 17  Participatory and democratic prioritisation Cross-Cutting Philosophical and Meta-Theoretical Approaches (Paul Feyerband, 1975 [ 197 Citizen juries and deliberative democracy forums (Ned Crosby, 1974 [ 198 199 Public consultations and e-surveys with weighting (Stephen Sedley, 1985 [ 200  Participatory budgeting (Tarso Genro and Raul Pont, 1989 [ 201 203  Approaches to prioritising ideas beyond specific techniques Occam’s Razor (William of Ockham, 1323-1328 [ 204 205 Bayesian inference (Thomas Bayes, 1763 [ 206 Dialectical method (Georg Wilhelm Friedrich Hegel, 1807 [ 207 Epistemic humility and pluralism (John Stuart Mill, 1859 [ 208 This editorial marks a new collection of papers in the ‘Journal of Global Health’ which will attempt to characterise and theoretically advance the emerging field of ‘ideometrics’. The aim of this foundational collection will be to identify methodological approaches and define a roadmap that could lead to the prioritisation of better ideas. This would need to be based on information that has the most value, and on a scientific, quantitative approach to prioritising ideas. ‘Ideometrics’ may eventually find a novel path towards addressing the historic human challenge of scarcity, through increased efficiency and effectiveness that would arise from following ideas most likely to lead to better futures, but also avoiding those that are unlikely to achieve desired goals for individuals and populations. CONCLUSIONS From its simple approach in its infancy in 2006, the CHNRI method has been continuously improved by many users over the years, increasing its scientific rigour. It gradually became apparent that the method is an attempt – albeit rudimentary – to ‘measure ideas’ using expert-sourced ‘collective optimism’ towards each idea and its components [ 2 Funding: Authorship contributions: Disclosure of interest: REFERENCES 1 Rudan I, El Arifeen S, Black RE. A Systematic Methodology for Setting Priorities in Child Health Research Investments. In: Child Health and Nutrition Research Initiative (CHNRI): A New Approach for Systematic Priority Setting in Child Health Research Investment. Dhaka, Bangladesh: Dynamic Printers; 2006. 2 Rudan I, Yoshida S, Wazny K, Cousens S, editors. Measuring Ideas: The CHNRI Method. A Solution for Setting Research Priorities. Edinburgh, Scotland, UK: International Society of Global Health; 2022. 3 Rudan I Gibson J Kapiriri L Lansang MA Hyder AA Lawn J Setting priorities in global child health research investments: Assessment of principles and practice. Croat Med J 2007 48 595 604 17948946 PMC2205967 4 Kapiriri L Tomlinson M Gibson J Chopra M El Arifeen S Black RE Setting priorities in global child health research investments: Addressing the values of the stakeholders. Croat Med J 2007 48 618 27 17948948 PMC2213572 5 Rudan I Chopra M Kapiriri L Gibson J Ann Lansang M Carneiro I Setting priorities in global child health research investments: universal challenges and conceptual framework. Croat Med J 2008 49 307 17 10.3325/cmj.2008.3.307 18581609 PMC2443616 6 Rudan I Gibson JL Ameratunga S El Arifeen S Bhutta ZA Black M Setting priorities in global child health research investments: guidelines for implementation of CHNRI method. Croat Med J 2008 49 720 33 10.3325/cmj.2008.49.720 19090596 PMC2621022 7 Rudan I Yoshida S Chan KY Cousens S Sridhar D Bahl R Setting health research priorities using the CHNRI method: I. involving funders. J Glob Health 2016 6 010301 10.7189/jogh.06.010301 26401269 PMC4576461 8 Yoshida S Cousens S Wazny K Chan KY Setting health research priorities using the CHNRI method: II. Involving researchers. J Glob Health 2016 6 010302 10.7189/jogh.06.010302 27350870 PMC4920006 9 Yoshida S Wazny K Cousens S Chan KY Setting health research priorities using the CHNRI method: III. Involving stakeholders. J Glob Health 2016 6 010303 10.7189/jogh.06.010303 27303649 PMC4894379 10 Rudan I Setting health research priorities using the CHNRI method: IV. Key conceptual advances. J Glob Health 2016 6 010501 10.7189/jogh.06.010501 27418959 PMC4938380 11 Rudan I Yoshida S Wazny K Chan KY Cousens S Setting health research priorities using the CHNRI method: V. Quantitative properties of human collective knowledge. J Glob Health 2016 6 010502 10.7189/jogh.06.010502 27350873 PMC4920010 12 Yoshida S Rudan I Cousens S Setting health research priorities using the CHNRI method: VI. Quantitative properties of human collective opinion. J Glob Health 2016 6 010503 10.7189/jogh.06.010503 27350874 PMC4920008 13 Wazny K ‘Crowdsourcing’ ten years in: A review. J Glob Health 2017 7 020602 10.7189/jogh.07.020601 29302322 PMC5735781 14 Wazny K Applications of crowdsourcing in health: an overview. J Glob Health 2018 8 010502 10.7189/jogh.08.010502 29564087 PMC5840433 15 Rudan I Global health research priorities: Mobilizing the developing world. Public Health 2012 126 237 40 10.1016/j.puhe.2011.12.001 22325672 16 Yoshida S Approaches, tools and methods used for setting priorities in health research in the 21(st) century. J Glob Health 2016 6 010507 26401271 10.7189/jogh.06.010507 PMC4576459 17 Song P Adeloye D Acharya Y Bojude DA Ali S Alibudbud R Setting research priorities for global pandemic preparedness: An international consensus and comparison with ChatGPT’s output. J Glob Health 2024 14 04054 10.7189/jogh.14.04054 38386716 PMC10869134 18 Garry J Tomlinson M Lohan M AI-generated research priorities to improve the treatment of disease: assessing robustness across ChatGPT and DeepSeek for treatment of cancer, HIV, COVID-19, and Alzheimer’s disease. J Glob Health 2025 19 Howe J. The rise of crowdsourcing. Wired Magazine. 1 June 2006. Available: https://www.wired.com/2006/06/crowds/ 20 Rudan I Preventing inequity in international research. Science 2008 319 1336 7 10.1126/science.319.5868.1336a 18323433 21 10/90 gap. Wikipedia. 24 September 2025. Available: https://en.wikipedia.org/wiki/10/90_gap 22 Rudan I El Arifeen S Black RE Campbell H Childhood pneumonia and diarrhoea: setting our priorities right. Lancet Infect Dis 2007 7 56 61 10.1016/S1473-3099(06)70687-9 17182344 23 Tomlinson M Chopra M Sanders D Bradshaw D Hendricks M Greenfield D Setting Priorities in Child Health Research Investments for South Africa. PLoS Med 2007 4 e259 10.1371/journal.pmed.0040259 17760497 PMC1952202 24 Chisholm D Flisher AJ Lund C Patel V Saxena S Thornicroft G Scale up services for mental disorders: a call for action. Lancet 2007 370 1241 52 10.1016/S0140-6736(07)61242-2 17804059 25 Walley J Lawn JE Tinker A de Francisco A Chopra M Rudan I Primary health care: making Alma-Ata a reality. Lancet 2008 372 1001 7 10.1016/S0140-6736(08)61409-9 18790322 26 Fontaine O Kosek M Bhatnagar S Boschi-Pinto C Chan KY Duggan C Setting research priorities to reduce global mortality from childhood diarrhoea by 2015. PLoS Med 2009 6 e41 10.1371/journal.pmed.1000041 19278292 PMC2653551 27 Bahl R Martines J Ali N Bhan MK Carlo W Chan KY Research priorities to reduce global mortality from newborn infections by 2015. Pediatr Infect Dis J 2009 28 1 Suppl S43 8 10.1097/INF.0b013e31819588d7 19106763 28 Bahl R Martines J Bhandari N Biloglav Z Edmond K Iyengar S Setting research priorities to reduce global mortality from preterm birth and low birth weight by 2015. J Glob Health 2012 2 010403 10.7189/jogh.01.010403 23198132 PMC3484758 29 Lawn JE Bahl R Bergstrom S Bhutta ZA Darmstadt GL Ellis M Setting research priorities to reduce almost one million deaths from birth asphyxia by 2015. PLoS Med 2011 8 e1000389 10.1371/journal.pmed.1000389 21305038 PMC3019109 30 Rudan I El Arifeen S Bhutta ZA Black RE Brooks A Chan KY Setting research priorities to reduce global mortality from childhood pneumonia by 2015. PLoS Med 2011 8 e1001099 10.1371/journal.pmed.1001099 21980266 PMC3181228 31 Tomlinson M Swartz L Officer A Chan KY Rudan I Saxena S Research priorities for health of people with disabilities: an expert opinion exercise. Lancet 2009 374 1857 62 10.1016/S0140-6736(09)61910-3 19944866 32 Tomlinson M Rudan I Saxena S Swartz L Tsai AC Patel V Setting priorities for global mental health research. Bull World Health Organ 2009 87 438 46 10.2471/BLT.08.054353 19565122 PMC2686213 33 Brown KH Hess SY Boy E Gibson RS Horton S Osendarp SJ Setting priorities for zinc-related health research to reduce children’s disease burden worldwide: an application of the Child Health and Nutrition Research Initiative’s research priority-setting method. Public Health Nutr 2009 12 389 96 10.1017/S1368980008002188 18426636 34 Webster J Theodoratou E Nair H Seong AC Zgaga L Huda T An evaluation of emerging vaccines for childhood pneumococcal pneumonia. BMC Public Health 2011 11 S26 10.1186/1471-2458-11-S3-S26 21501444 PMC3231900 35 Huda T Nair H Theodoratou E Zgaga L Fattom A El Arifeen S An evaluation of the emerging vaccines and immunotherapy against staphylococcal pneumonia in children. BMC Public Health 2011 11 S27 10.1186/1471-2458-11-S3-S27 21501445 PMC3239838 36 Choudhuri D Huda T Theodoratou E Nair H Zgaga L Falconer R An evaluation of emerging vaccines for childhood meningococcal disease. BMC Public Health 2011 11 S29 10.1186/1471-2458-11-S3-S29 21501447 PMC3231902 37 Nair H Verma VR Theodoratou E Zgaga L Huda T Simões EA An evaluation of the emerging interventions against Respiratory Syncytial Virus (RSV)-associated acute lower respiratory infections in children. BMC Public Health 2011 11 S30 10.1186/1471-2458-11-S3-S30 21501449 PMC3231904 38 Higginson D Theodoratou E Nair H Huda T Zgaga L Jadhav SS An evaluation of respiratory administration of measles vaccine for prevention of acute lower respiratory infections in children. BMC Public Health 2011 11 S31 10.1186/1471-2458-11-S3-S31 21501450 PMC3231905 39 Rudan I Theodoratou E Zgaga L Nair H Chan KY Tomlinson M Setting priorities for development of emerging interventions against childhood pneumonia, meningitis and influenza. J Glob Health 2012 2 010304 10.7189/jogh.01.010304 23198129 PMC3484764 40 Catto AG Zgaga L Theodoratou E Huda T Nair H El Arifeen S An evaluation of oxygen systems for treatment of childhood pneumonia. BMC Public Health 2011 11 S28 10.1186/1471-2458-11-S3-S28 21501446 PMC3231901 41 Bhutta ZA Zipursky A Wazny K Levine MM Black RE Bassani DG Setting priorities for development of emerging interventions against childhood diarrhoea. J Glob Health 2013 3 010302 10.7189/jogh.03.010302 23826502 PMC3700035 42 Rudan I Theodoratou E Chan KY Adeloye D Polašek O Campbell H Using evidence, expert opinion and epidemiological model to understand pathways to survival and mortality: The Pathways to Survival (PATHS) Tool. J Glob Health 2021 11 15001 10.7189/jogh.11.15001 34327002 PMC8310575 43 Tol WA Patel V Tomlinson M Baingana F Galappatti A Panter-Brick C Research priorities for mental health and psychosocial support in humanitarian settings. PLoS Med 2011 8 e1001096 10.1371/journal.pmed.1001096 21949644 PMC3176752 44 George A Young M Bang A Chan KY Rudan I Victora CG Setting implementation research priorities to reduce preterm births and stillbirths at the community level. PLoS Med 2011 8 e1000380 10.1371/journal.pmed.1000380 21245907 PMC3014929 45 Lienhardt C Espinal M Pai M Maher D Raviglione MC What research is needed to stop TB? Introducing the TB Research Movement. PLoS Med 2011 8 e1001135 10.1371/journal.pmed.1001135 22140369 PMC3226454 46 Flenady V Middleton P Smith GC Duke W Erwich JJ Khong TY Stillbirths: the way forward in high-income countries. Lancet 2011 377 1703 17 10.1016/S0140-6736(11)60064-0 21496907 47 Collins PY Patel V Joestl SS March D Insel TR Daar AS Grand challenges in global mental health. Nature 2011 475 27 30 10.1038/475027a 21734685 PMC3173804 48 Hindin MJ Christiansen CS Ferguson BJ Setting research priorities for adolescent sexual and reproductive health in low- and middle-income countries. Bull World Health Organ 2013 91 10 8 10.2471/BLT.12.107565 23397346 PMC3537249 49 Dean S Rudan I Althabe F Webb Girard A Howson C Langer A Setting research priorities for preconception care in low- and middle-income countries: aiming to reduce maternal and child mortality and morbidity. PLoS Med 2013 10 e1001508 10.1371/journal.pmed.1001508 24019762 PMC3760783 50 Wazny K Zipursky A Black R Curtis V Duggan C Guerrant R Setting research priorities to reduce mortality and morbidity of childhood diarrhoeal disease in the next 15 years. PLoS Med 2013 10 e1001446 10.1371/journal.pmed.1001446 23690756 PMC3653794 51 Yoshida S Rudan I Lawn JE Wall S Souza JP Martines J Newborn health research priorities beyond 2015. Lancet 2014 384 e27 9 10.1016/S0140-6736(14)60263-4 24853596 PMC7048618 52 Souza JP Widmer M Gülmezoglu AM Lawrie TA Adejuyigbe EA Carroli G Maternal and perinatal health research priorities beyond 2015: an international survey and prioritization exercise. Reprod Health 2014 11 61 10.1186/1742-4755-11-61 25100034 PMC4132282 53 Ali M Seuc A Rahimi A Festin M Temmerman M A global research agenda for family planning: results of an exercise for setting research priorities. Bull World Health Organ 2014 92 93 8 10.2471/BLT.13.122242 24623902 PMC3949533 54 Morof DF Kerber K Tomczyk B Lawn J Blanton C Sami S Neonatal survival in complex humanitarian emergencies: setting an evidence-based research agenda. Confl Health 2014 8 8 10.1186/1752-1505-8-8 24959198 PMC4057580 55 Tomlinson M Yasamy MT Emerson E Officer A Richler D Saxena S Setting global research priorities for developmental disabilities, including intellectual disabilities and autism. J Intellect Disabil Res 2014 58 1121 30 10.1111/jir.12106 24397279 PMC4556421 56 Wazny K Sadruddin S Zipursky A Hamer DH Jacobs T Kallander K Setting global research priorities for integrated community case management (iCCM): Results from a CHNRI (Child Health and Nutrition Research Initiative) exercise. J Glob Health 2014 4 020413 10.7189/jogh.04.020413 25520803 PMC4267102 57 Campbell S, Higginbotham S, Polonsky M. 2014 research priority setting: Final report. Society of Family Planning Research Fund, Denver, USA, 2014; pp. 1–36. 58 Angood C McGrath M Mehta S Mwangome M Lung’aho M Roberfroid D Research priorities to improve the management of acute malnutrition in infants aged less than six months (MAMI). PLoS Med 2015 12 e1001812 10.1371/journal.pmed.1001812 25898252 PMC4405387 59 Velayutham B Nair D Ramalingam S Perez-Velez CM Becerra MC Swaminathan S Setting priorities for a research agenda to combat drug-resistant tuberculosis in children. Public Health Action 2015 5 222 35 10.5588/pha.15.0047 26767175 PMC4682613 60 Rollins N Chanza H Chimbwandira F Eliya M Nyasulu I Thom E Prioritizing the PMTCT implementation research agenda in 3 African countries: INtegrating and Scaling up PMTCT through Implementation REsearch (INSPIRE). J Acquir Immune Defic Syndr 2014 67 Suppl 2 S108 13 10.1097/QAI.0000000000000358 25310115 61 Sekar N Shah NK Abbas SS Kakkar M Roadmap to Combat Zoonoses in India Initiative Research options for controlling zoonotic disease in India, 2010-2015. PLoS One 2011 6 e17120 10.1371/journal.pone.0017120 21364879 PMC3045424 62 Gregório G Tomlinson M Gerolin J Kieling C Moreira HC Razzouk D Setting priorities for mental health research in Brazil. Rev Bras Psiquiatr 2012 34 434 9 10.1016/j.rbp.2012.05.006 23429814 63 Arbour M Murray KA Atwood SS Murray M Angel Cordero Vega M Choosing the best child assessment instrument for a specific context: a methodology for engaging local experts applied in Chile. J Dev Behav Pediatr 2012 33 666 75 10.1097/DBP.0b013e318267d1c1 23027141 64 Li X Kun Z Xueran Q Yue X Wudong G [riority setting for research on maternal and child health service delivery system in western China: Based on the CHNRI method]. Chinese Health Service Management 2014 310 244 7 Chinese 65 Yang M-N Zhao K Qi X-R Xue L Determining the priority issues of health policy based on CHNRI. Chinese J Hlth Policy 2015 8 74 9 66 Read R Fernandez-Hermosilla M Anderson S Mundy K Identifying research priorities for school improvement in the developing world. Curr Issues Comp Edu 2015 18 55 67 67 Rudan I Editor’s view: Value of information in the 21st century – examples from science, medicine, policy, media, and markets. J Glob Health 2025 15 01003 10.7189/jogh.15.01003 40537053 PMC12178590 68 Manyara AM Purvis A Ciani O Collins GS Taylor RS Sample size in multistakeholder Delphi surveys: at what minimum sample size do replicability of results stabilize? J Clin Epidemiol 2024 174 111485 10.1016/j.jclinepi.2024.111485 39069013 PMC7617918 69 Wazny K Chan KY Crowdsourcing CHNRI Collaborators. Identifying potential uses of crowdsourcing in global health, conflict, and humanitarian settings: an adapted CHNRI (Child Health and Nutrition Initiative) exercise. J Glob Health 2018 8 020704 10.7189/jogh.08.020704 30410741 PMC6220355 70 Wazny K Ravenscroft J Chan KY Bassani DG Anderson N Rudan I Setting weights for fifteen CHNRI criteria at the global and regional level using public stakeholders: an Amazon Mechanical Turk study. J Glob Health 2019 9 010702 10.7189/jogh.09.010702 30992986 PMC6445564 71 Rudan I Yoshida S Chan KY Sridhar D Wazny K Nair H Setting health research priorities using the CHNRI method: VII. A review of the first 50 applications of the CHNRI method. J Glob Health 2017 7 011004 10.7189/jogh.07.011004 28685049 PMC5481891 72 Dua T Tomlinson M Tablante E Britto P Yousfzai A Daelmans B Global research priorities to accelerate early child development in the sustainable development era. Lancet Glob Health 2016 4 e887 9 10.1016/S2214-109X(16)30218-2 27717631 PMC5659186 73 Kennedy HP Yoshida S Costello A Declercq E Dias MA Duff E Asking different questions: research priorities to improve the quality of care for every woman, every child. Lancet Glob Health 2016 4 e777 9 10.1016/S2214-109X(16)30183-8 27663682 74 Shah H Albanese E Duggan C Rudan I Langa KM Carrillo MC Research priorities to reduce the global burden of dementia by 2025. Lancet Neurol 2016 15 1285 94 10.1016/S1474-4422(16)30235-6 27751558 75 Nagata JM Ferguson BJ Ross DA Research Priorities for Eight Areas of Adolescent Health in Low- and Middle-Income Countries. J Adolesc Health 2016 59 50 60 10.1016/j.jadohealth.2016.03.016 27235375 PMC5357763 76 Sheikh A Rudan I Cresswell K Dhingra-Kumar N Tan ML Häkkinen ML Agreeing on global research priorities for medication safety: an international prioritisation exercise. J Glob Health 2019 9 010422 10.7189/jogh.09.010422 30842883 PMC6393844 77 National Institute for Health Research Global Health Research Unit on Global Surgery Prioritizing research for patients requiring surgery in low- and middle-income countries. Br J Surg 2019 106 e113 20 10.1002/bjs.11037 30620063 78 Rudan I Agrawal D Hussein N Cheong AT Cunningham S Dockerell D Setting research priorities for global respiratory medicine within the National Institute for Health Research (NIHR) Global Health Research Unit in Respiratory Health (RESPIRE). J Glob Health 2018 8 0201314 10.7189/jogh.08.020314 30603076 PMC6304164 79 WHO Regional Office for Europe. Defining tuberculosis the research agenda for the WHO European Region: a study report of the European TB Research Initiative. WHO Regional Office for Europe, Copenhagen, 2019. Available: https://apps.who.int/iris/bitstream/handle/10665/327085/9789289054317-eng.pdf 80 Arora NK Mohapatra A Gopalan HS Wazny K Thavaraj V Rasaily R Setting research priorities for maternal, newborn, child health and nutrition in India by engaging experts from 256 indigenous institutions contributing over 4000 research ideas: a CHNRI exercise by ICMR and INCLEN. J Glob Health 2017 7 011003 10.7189/jogh.07.011003 28686749 PMC5481897 81 Wazny K Arora NK Mohapatra A Gopalan HS Das MK Nair M Setting priorities in child health research in India for 2016-2025: a CHNRI exercise undertaken by the Indian Council for Medical Research and INCLEN Trust. J Glob Health 2019 9 020701 10.7189/jogh.09.020701 31673343 PMC6818639 82 Mansoori P Majdzadeh R Abdi Z Rudan I Chan KY Iranian CHNRI Health Research Priority Setting Group, et al Setting research priorities to achieve long-term health targets in Iran. J Glob Health 2018 8 020702 10.7189/jogh.08.020702 30356511 PMC6188089 83 Polašek O Wazny K Adeloye D Song P Chan KY Bojude DA Research priorities to reduce the impact of COVID-19 in low- and middle-income countries. J Glob Health 2022 12 09003 10.7189/jogh.12.09003 35475006 PMC9010705 84 COVID-19 Research Prioritization Group on MNCAH Global research priorities on COVID-19 for maternal, newborn, child and adolescent health. J Glob Health 2021 11 04071 10.7189/jogh.11.04071 34912548 PMC8645217 85 Adeloye D Elneima O Daines L Poinasamy K Quint JK Walker S International COVID-19 Airways Diseases Group The long-term sequelae of COVID-19: an international consensus on research priorities for patients with pre-existing and new-onset airways disease. Lancet Respir Med 2021 9 1467 78 10.1016/S2213-2600(21)00286-1 34416191 PMC8372501 86 Francis-Oliviero F Bozoki S Micsik A Kieny MP Lelièvre JD Research priorities to increase vaccination coverage in Europe (EU joint action on vaccination). Vaccine 2021 39 6539 44 10.1016/j.vaccine.2021.09.033 34598823 87 Song P Jiang D Zhou J Zhu Y Abdul Manaf R Bojude DA Setting Research Priorities for Data Science and Artificial Intelligence in Global Health: An International Consensus Exercise Lancet Glob Health 2025 88 Paskins Z Farmer CE Manning F Andersson DA Barlow T Bishop FL Research priorities to reduce the impact of musculoskeletal disorders: a priority setting exercise with the child health and nutrition research initiative method. Lancet Rheumatol 2022 4 e635 45 10.1016/S2665-9913(22)00136-9 36275038 PMC9584828 89 Adeloye D Agarwal D Barnes PJ Bonay M van Boven JF Bryant J Research priorities to address the global burden of chronic obstructive pulmonary disease (COPD) in the next decade. J Glob Health 2021 11 15003 10.7189/jogh.11.15003 34737870 PMC8542376 90 Ko M Cherian T Groves HT Klemm EJ Qazi S Application of the Child Health and Nutrition Research Initiative (CHNRI) methodology to prioritize research to enable the implementation of Ending Cholera: A global roadmap to 2030. PLoS One 2022 17 e0264952 10.1371/journal.pone.0264952 35617278 PMC9135262 91 Mandil A Motevalian SA Altaf A Obeidat R Muthu N Afzal S Research on health priorities: a regional agenda and its implementation in Jordan and Pakistan. East Mediterr Health J 2021 27 319 20 10.26719/2021.27.4.319 33955526 92 Ouedraogo L Nkurunziza T Mureithi A Asmani C Elamin H Zan S Setting Research Priorities for Cervical Cancer Prevalence, Prevention and Treatment in WHO Africa Region. Advances in Reproductive Science 2021 9 41 9 10.4236/arsci.2021.91005 93 Ouedraogo L Nkurunziza T Mureithi A Françoise B Asmani C Elamin H Research Priorities for Addressing Gender Based Violence in the WHO Africa Region. Advances in Reproductive Science 2021 9 50 9 10.4236/arsci.2021.91006 94 Ouedraogo L Nkurunziza T Mureithi A Asmani C Elamin H Zan S Research Priorities for mHealth and Innovative Strategies in Sexual and Reproductive Health and Rights in the WHO Africa Region. Advances in Reproductive Science 2021 9 33 40 10.4236/arsci.2021.91004 95 Ouedraogo L Nkurunziza T Muriithi A Asmani C Elamin H Zan S Research Priorities for Preventing Unsafe Abortions in the WHO Africa Region. Advances in Reproductive Science 2021 9 24 32 10.4236/arsci.2021.91003 96 Ouedraogo L Nkurunziza T Mureithi A John TK Asmani C Elamin H The WHO African Region: Research Priorities on Sexual and Reproductive Health and Rights. Advances in Reproductive Science 2021 9 13 23 10.4236/arsci.2021.91002 97 Ouedraogo L Nkurunziza T Mureithi A Asmani C Elamin H Françoise B Setting Regional Research Priorities for Sexual and Reproductive Health and Rights Services in Humanitarian Settings. Advances in Reproductive Science 2021 9 60 8 10.4236/arsci.2021.91007 98 Alobo M Mgone C Lawn J Adhiambo C Wazny K Ezeaka C African Academy of Sciences Maternal and Neonatal Health Working Group for Africa. Research priorities in maternal and neonatal health in Africa: results using the Child Health and Nutrition Research Initiative method involving over 900 experts across the continent. AAS Open Res 2021 4 8 10.12688/aasopenres.13189.1 34151141 PMC8204196 99 Du Mont J Cheung R Burley JF Kosa SD Kelly CE Jakubiec BAE Building a research agenda on preventing and addressing sexual assault and intimate partner violence against trans people: a two-stage priority-setting exercise. Health Res Policy Syst 2024 22 163 10.1186/s12961-024-01245-0 39696336 PMC11653913 100 Kelly MM DeMuri GP Barton HJ Nacht CL Butteris SM Katz B Priorities for Safer In-Person School for Children With Medical Complexity During COVID-19. Pediatrics 2022 149 e2021054434 10.1542/peds.2021-054434 35199167 PMC9647557 101 Beck B Thorpe A Timperio A Giles-Corti B William C de Leeuw E Active transport research priorities for Australia. J Transp Health 2022 24 101288 10.1016/j.jth.2021.101288 102 Bertagnolio S Dobreva Z Centner CM Olaru ID Donà D Burzo S WHO Research Agenda for AMR in Human Health Collaborators WHO global research priorities for antimicrobial resistance in human health. Lancet Microbe 2024 5 100902 10.1016/S2666-5247(24)00134-4 39146948 PMC11543637 103 Gottlieb SL Spielman E Abu-Raddad L Aderoba AK Bachmann LH Blondeel K WHO global research priorities for sexually transmitted infections. Lancet Glob Health 2024 12 e1544 51 10.1016/S2214-109X(24)00266-3 39043199 PMC11342064 104 Brennan-Wilson A Marques M Coates A Amin A Garry J Tomlinson M Masculinities and sexual and reproductive health and rights: a global research priority setting exercise. Lancet Glob Health 2024 12 e882 90 10.1016/S2214-109X(24)00053-6 38614636 105 Lohan M Brennan-Wilson A Bradshaw M Bastien S Banati P Garry J Global research priority-setting exercise on the sexual and reproductive health and rights of young adolescents. Lancet Child Adolesc Health 2025 9 724 34 10.1016/S2352-4642(25)00190-7 40816311 106 Williams CR Adnet G Gallos ID Coomarasamy A Gülmezoglu AM Islam MA Research agenda for ending preventable maternal deaths from postpartum haemorrhage: a WHO research prioritisation exercise. BMJ Glob Health 2024 9 e015342 10.1136/bmjgh-2024-015342 39510550 PMC11552529 107 Wood G, Ipince A, Volta BR, Nilsson J. Disability Research Prioritization Exercise: Emerging research priorities for the effective inclusion of children with disabilities in low- and middle-income countries: A multi-stakeholder agenda-setting exercise to inform the Global Research Agenda for Children with Disabilities. Background paper. Florence, Italy: United Nations Children’s Fund Innocenti – Global office of Research and Foresight; 2025. Available: https://www.unicef.org/innocenti/media/10876/file/UNICEF-Innocenti-DRPE-Report-2025.pdf 108 World Health Organization. Intersections between violence against children and violence against women: Global Research Priorities. Geneva, Switzerland: World Health Organization; 2024. Available: https://www.who.int/publications/i/item/9789240089105 109 Syal R, Alfvén T, Ashorn P, Black RE, Chersich M, Das JK, et al. Setting research priorities to understand and address the impact of climate change on the health of women and children in low- and middle-income countries using the child health and nutrition research initiative (CHNRI) methodology. SSRN:5322529 [preprint]. 1 July 2025. Available: 10.2139/ssrn.5322529 110 D’Mello-Guyett L Heylen C Rohm E Falconer J Lapegue J Dreibelbis R Research priorities for water, sanitation and hygiene (WASH) in humanitarian crises: A global prioritisation exercise. PLOS Water 2024 3 e0000217 10.1371/journal.pwat.0000217 111 Corboz J Dartnall E Brown C Fulu E Gordon S Tomlinson M Co-creating a global shared research agenda on violence against women in low- and middle-income countries. Health Res Policy Syst 2024 22 71 10.1186/s12961-024-01153-3 38914999 PMC11194916 112 Uysal J Dixit A Green C Akinola M Shaw B Lundgren R Addressing social norms for adolescent timing and spacing of pregnancy in low and middle-income countries: Developing a global research agenda. J Glob Health 2024 14 04206 10.7189/jogh.14.04206 39545342 PMC11565465 113 Lambach P Silal S Sbarra AN Koh M Aggarwal R Farooqui HH Report from the World Health Organization’s immunization and vaccines-related implementation research advisory committee (IVIR-AC) meeting, virtual gathering, 17-21 February 2025. Vaccine 2025 61 127384 10.1016/j.vaccine.2025.127384 40494225 PMC12447087 114 El Baz S Keats EC Tasic H Black R Peters DH Safi N Setting health systems research priorities for Afghanistan: an application of the child health and nutrition research initiative (CHNRI) methodology to set a roadmap to 2030. BMJ Glob Health 2025 10 Suppl 3 e018578 10.1136/bmjgh-2024-018578 40713081 PMC12306304 115 Majumdar T Keats EC Tasic H El Baz S Peters DH Safi N Setting research priorities for maternal, newborn and child health, sexual and reproductive health and nutrition in Afghanistan: an application of the Child Health and Nutrition Research Initiative methodology. BMJ Glob Health 2025 10 Suppl 3 e018579 10.1136/bmjgh-2024-018579 40897452 PMC12406864 116 Sayeed A Saha N Ameen S Akter E Hossain L Hasan MM Setting stakeholder-led research priorities for advancing Sexual and Reproductive Health and Rights in Bangladesh using CHNRI method: an icddr,b initiative. J Glob Health 2025 15 04186 10.7189/jogh.15.04186 40643139 PMC12247414 117 Motevalian SA Asghar MN Afzal S Khan EA Siddiqui AR Ali TS Health research priorities in Pakistan: A Child Health and Nutrition Research Initiative (CHNRI) exercise. J Glob Health 2024 14 04116 10.7189/jogh.14.04116 39173141 PMC11341109 118 Durão S Effa E Mbeye N Mthethwa M McCaul M Naude C Using a priority setting exercise to identify priorities for guidelines on newborn and child health in South Africa, Malawi, and Nigeria. Health Res Policy Syst 2024 22 48 10.1186/s12961-024-01133-7 38627761 PMC11020907 119 Macdonald C Adeloye D Sheikh A Rudan I Can ChatGPT draft a research article? An example of population-level vaccine effectiveness analysis. J Glob Health 2023 13 01003 10.7189/jogh.13.01003 36798998 PMC9936200 120 Garry J Tomlinson M Lohan M The potential role of AI in research priority setting exercises. J Glob Health 2025 15 03019 10.7189/jogh.15.03019 40476572 PMC12143114 121 Millum J Ethics and health research priority setting: a narrative review. Wellcome Open Res 2024 9 203 10.12688/wellcomeopenres.21182.1 38989473 PMC11234074 122 Tong A Synnot A Crowe S Hill S Matus A Scholes-Robertson N Reporting guideline for priority setting of health research (REPRISE). BMC Med Res Methodol 2019 19 243 10.1186/s12874-019-0889-3 31883517 PMC6935471 123 Gupta S Pn Rao S Yoshida S Bahl R Global newborn health research priorities identified in 2014: A review to evaluate the uptake. EClinicalMedicine 2022 52 101599 10.1016/j.eclinm.2022.101599 35958522 PMC9358417 124 Rudan I Editor’s view: Is the brain’s perception of ideas an underappreciated human sense? J Glob Health 2024 14 01002 10.7189/jogh.14.01002 39641337 PMC11622342 125 James W. The Principles of Psychology, vol. 1 and 2. New York, USA: Henry Holt and Co; 1890. 126 Elbow P. Writing without Teachers. New York, USA: Oxford University Press; 1973. 127 Altshuller GS Shapiro RV O psikhologii izobretatelskogo tvorchestva. Voprosy psikhologii 1956 6 37 49 128 Zwicky F. Morphological Astronomy. 1st edition. Heidelberg, Germany: Springer Berlin; 1957. 129 de Bono E. The Use of Lateral Thinking. London, UK: Jonathan Cape; 1967. 130 Eberle RF. SCAMPER: Games for Imagination Development. Buffalo, NY, USA: D.O.K. Publishers; 1971. 131 Buzan T. Use your head. London, UK: BBC Books; 1974. 132 Buzan T, Buzan B. The mind mapping book; radiant thinking- the major evolution in human thought. London, UK: BBC Books; 1993. 133 Tversky A Kahneman D Judgment under uncertainty: Heuristics and biases. Science 1974 185 1124 31 10.1126/science.185.4157.1124 17835457 134 de Bono E. Six Thinking Hats. London, UK: Penguin Books; 1985. 135 Osborn AF. How to Think Up. New York, NY, USA: McGraw-Hill Book Co; 1942. 136 Osborn AF. Applied imagination: Principles and procedures of creative problem solving. New York, NY, USA: Charles Scribner's Sons; 1953. 137 Merton RK, Fiske M, Kendall PL. The focused interview; a manual of problems and procedures. Glencoe, IL, USA: Free Press; 1956. 138 Dalkey N Helmer O An Experimental Application of the DELPHI Method to the Use of Experts. Manage Sci 1963 9 458 67 10.1287/mnsc.9.3.458 139 Delbecq AL Van de Ven AH A Group Process Model for Problem Identification and Program Planning. J Appl Behav Sci 1971 7 466 92 10.1177/002188637100700404 140 Brown J, Isaacs D. The World Café: Shaping Our Futures Through Conversations That Matter. San Francisco, CA, USA: Berrett-Koehler; 2005. 141 Owen H. Open Space Technology: A User's Guide. San Francisco, CA, USA: Berrett-Koehler; 1997. 142 Bingham A, Spradlin D. The Open Innovation Marketplace: Creating Value in the Challenge Driven Enterprise. Upper Saddle River, NJ, USA: FT Press; 2011. 143 Partridge N Scadding J The James Lind Alliance: patients and clinicians should jointly identify their priorities for clinical trials. Lancet 2004 364 1923 4 10.1016/S0140-6736(04)17494-1 15566996 144 About Us. Ideascale. 2025. Available: https://ideascale.com/about-ideascale/ 145 Human-centered design. Wikipedia. 24 August 2025. Available: https://en.wikipedia.org/wiki/Human-centered_design 146 Norman DA. The Psychology of Everyday Things. New York, NY, USA: Basic Books; 1988. 147 IDEO.org. The Field Guide to Human-Centered Design. 1st edition. San Francisco, CA, USA: IDEO.org / Design Kit; 2009. 148 Simon HA. The Sciences of the Artificial. Cambridge, MA, USA: MIT Press; 1969. 149 Brown T. Change by Design. New York, NY, USA: HarperBusiness; 2009. 150 Schwaber K, Sutherland J. SCRUM Development Process. In: Proceedings of the Tenth Annual Conference on Object-Oriented Programming Systems, Languages, and Applications; 15–19 October 1995; Austin, Texas. New York, NY, USA: Association for Computing Machinery; 1995. 151 Hackaton. Wikipedia. 18 August 2025. Available: https://en.wikipedia.org/wiki/Hackathon 152 Ries E. The Lean Startup: How Today's Entrepreneurs Use Continuous Innovation to Create Radically Successful Businesses. New York, NY, USA: Crown Business; 2011. 153 Holland JH. Adaptation in Natural and Artificial Systems. Ann Arbor, MI, USA: University of Michigan Press; 1975. 154 Swanson DR Fish oil, Raynaud’s syndrome, and undiscovered public knowledge. Perspect Biol Med 1986 30 7 18 10.1353/pbm.1986.0087 3797213 155 Goodfellow IJ Pouget-Abadie J Mirza M Xu B Warde-Farley D Ozair S Generative Adversarial Nets. Adv Neural Inf Process Syst 2014 27 2672 80 156 Vaswani A, Shazeer N, Parmar N, Uszkoreit J, Jones L, Gomez AN, et al. Attention Is All You Need. arXiv:1706.03762 [preprint]. 2 August 2023. Available: 10.48550/arXiv.1706.03762 157 Radford A, Wu J, Child R, Luan D, Amodei D, Sutskever I. Language Models are Unsupervised Multitask Learners. 2019. Available: https://cdn.openai.com/better-language-models/language_models_are_unsupervised_multitask_learners.pdf 158 Scholarly peer review. Wikipedia. 27 July 2025. Available: https://en.wikipedia.org/wiki/Scholarly_peer_review 159 Institute of Medicine Committee to Improve the National Institutes of Health Consensus Development Program. Consensus Development at the NIH: Improving the Program. Washington, DC, USA: National Academies Press (US); 1990. 160 Saaty TL A scaling method for priorities in hierarchical structures. J Math Psychol 1977 15 234 81 10.1016/0022-2496(77)90033-5 161 Saaty TL. The Analytic Hierarchy Process: Planning, Priority Setting, Resource Allocation. New York, NY, USA: McGraw-Hill; 1980. 162 Charles-Irénée Castel de Saint-Pierre. Wikipedia. 5 June 2025. Available: https://en.wikipedia.org/wiki/Charles-Ir%C3%A9n%C3%A9e_Castel_de_Saint-Pierre 163 Mishan EJ. Cost-Benefit Analysis: An Introduction. London, UK: George Allen & Unwin; 1971. 164 Fisher I. The Rate of Interest: Its Nature, Determination and Relation to Economic Phenomena. New York, NY, USA: Macmillan; 1907. 165 Dean J. Capital Budgeting: Top Management Policy on Plant, Equipment, and Product Development. New York, NY, USA: Columbia University Press; 1951. 166 Jaffe AB Trajtenberg M Henderson R Geographic localization of knowledge spillovers as evidenced by patent citations. Q J Econ 1993 108 577 98 10.2307/2118401 167 Garfield E Citation indexes for science; a new dimension in documentation through association of ideas. Science 1955 122 108 11 10.1126/science.122.3159.108 14385826 168 Garfield E Citation analysis as a tool in journal evaluation. Science 1972 178 471 9 10.1126/science.178.4060.471 5079701 169 Hirsch JE An index to quantify an individual’s scientific research output. Proc Natl Acad Sci U S A 2005 102 16569 72 10.1073/pnas.0507655102 16275915 PMC1283832 170 Héder M From NASA to EU: the evolution of the TRL scale in Public Sector Innovation. Innov J 2017 22 1 171 Mankins JC. Technology Readiness Levels: A White Paper. Washington, DC, USA: Advanced Concepts Office, Office of Space Access and Technology, NASA; 1995. 172 Kuhn HW, Tucker AW. Nonlinear programming. In: Neyman J, editor. Proceedings of the Second Berkeley Symposium on Mathematical Statistics and Probability; 31 July to 12 August 1950; Berkley, USA. Berkley, CA, USA: University of California Press; 1951. p. 481–492. 173 Humphrey A. SWOT Analysis for Management Consulting. December 2005. Available: https://alumni.sri.com/newsletters/2005/AlumNews-Dec-2005.pdf 174 Zionts S MCDM—If Not a Roman Numeral, Then What? Interfaces 1979 9 94 101 10.1287/inte.9.4.94 175 Pugh S. Total Design: Integrated Methods for Successful Product Engineering. Wokingham, UK: Addison-Wesley; 1990. 176 Galton F Vox Populi. Nature 1907 75 450 1 10.1038/075450a0 177 Hanson R Could gambling save science? Encouraging an honest consensus. Soc Epistemology 1990 4 227 32 178 Priem J, Taraborelli D, Groth P, Neylon C. Altmetrics: A Manifesto. 2010. Available: https://digitalcommons.unl.edu/scholcom/185/ 179 Aristotle. Prior Analytics. Jenkinson AJ, translator. Cambridge, MA, USA: Massachusetts Institute of Technology; n.p. Available: https://classics.mit.edu/Aristotle/prior.html 180 Aristotle. Metaphysics (Book IV). Ross WD, translator. Oxford, UK: Oxford University Press; 1924. Available: https://ia802806.us.archive.org/30/items/aristotlesmetaph0001aris/aristotlesmetaph0001aris.pdf 181 Bacon F. Novum Organum 1620, volume I–III. Montague B, editor and translator. Philadelphia, PA, USA: Parry and MacMillan; 1854. 182 Popper KR. Logik der Forschung. Vienna, Austria: Springer; 1934. 183 Kuhn TS. The Structure of Scientific Revolutions. Chicago, IL, USA: University of Chicago Press; 1962. 184 Thurstone LL A law of comparative judgment. Psychol Rev 1927 34 273 86 10.1037/h0070288 185 Bens I. Facilitating with Ease! Hoboken, NJ, USA: Jossey-Bass/Pfeiffer; 2000. 186 Brassard M, Ritter D. The Memory Jogger II: A Pocket Guide of Tools for Continuous Improvement and Effective Planning. Methuen, MA, USA: Goal / QPC; 1994. 187 Fitch K, Bernstein SJ, Aguilar MD, Burnand B, LaCalle JR, Lázaro P, et al. The RAND/UCLA Appropriateness Method User’s Manual. Santa Monica, CA, USA: RAND Corporation; 2001. 188 Commission on Health Research for Development. Health Research: Essential Link to Equity in Development. New York, NY, USA: Oxford University Press; 1990. 189 Atkins D Best D Briss PA Eccles M Falck-Ytter Y Flottorp S Grading quality of evidence and strength of recommendations. BMJ 2004 328 1490 4 10.1136/bmj.328.7454.1490 15205295 PMC428525 190 Global Forum for Health Research. The 10/90 Report on Health Research 2003–2004. Geneva, Switzerland: Global Forum for Health Research; 2004. 191 Myers SC Determinants of corporate borrowing. J Financ Econ 1977 5 147 75 10.1016/0304-405X(77)90015-0 192 Henderson BD. The Product Portfolio. Boston, MA, USA: Boston Consulting Group's Perspectives, No. 66; 1970. 193 Phaal R Farrukh CJP Probert DR Technology roadmapping – a planning framework for evolution and revolution. Technol Forecast Soc Change 2004 71 5 26 10.1016/S0040-1625(03)00072-6 194 Cooper RG Stage-gate systems: a new tool for managing new products. Bus Horiz 1990 33 44 54 10.1016/0007-6813(90)90040-I 195 Collins AM Quillian MR Retrieval time from semantic memory. J Verbal Learn Verbal Behav 1969 8 240 7 10.1016/S0022-5371(69)80069-1 196 Sutton RS, Barto AG. Reinforcement Learning: An Introduction. Cambridge, MA, USA: MIT Press; 1998. 197 Feyerabend P. Against Method: Outline of an Anarchistic Theory of Knowledge. London, UK: New Left Books; 1975. 198 Crosby N. Citizen juries: One solution for difficult environmental questions. In: Renn O, Webler T, Wiedemann P, editors. Fairness and Competence in Citizen Participation: Evaluating Models for Environmental Discourse. Dordrecht, The Netherlands: Kluwer Academic Publishers; 1995. p.157–171. 199 Fishkin JS. Democracy and Deliberation: New Directions for Democratic Reform. New Haven, CT, USA: Yale University Press; 1991. 200 Local Government Association. Rules: The Gunning Principles. February 2019. Available: https://www.local.gov.uk/sites/default/files/documents/The%20Gunning%20Principles.pdf 201 de Sousa Santos B Participatory budgeting in Porto Alegre: Toward a redistributive democracy. Polit Soc 1998 26 461 510 10.1177/0032329298026004003 202 Baiocchi G. Radicals in Power: The Workers’ Party and Experiments in Urban Democracy in Brazil. London, UK: Zed Books; 2003. 203 Wampler B. Participatory Budgeting in Brazil: Contestation, Cooperation, and Accountability. University Park, PA, USA: Pennsylvania State University Press; 2007. 204 Ockham W. Ockham's Theory of Terms, Part I of the Summa Logicae. Loux MJ, translator. Paris, France; University of Notre Dame Press; 1974. 205 Ockham W. Quodlibetal Questions. Freddoso AJ, Kelley FE, translators. New Haven, CT, USA: Yale University Press; 1978. 206 Bayes T An Essay towards Solving a Problem in the Doctrine of Chances. Philos Trans R Soc Lond 1763 53 370 418 1857193 207 Hegel GWF. Phänomenologie des Geistes. Bamberg, Germany: Frommann-Holzboog; 1807. 208 Mill JS. On Liberty. London, UK: Longman, Roberts, and Green Co; 1859. ",
  "metadata": {
    "Title of this paper": "An Essay towards Solving a Problem in the Doctrine of Chances.",
    "Journal it was published in:": "Journal of Global Health",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12487843/"
  }
}