{
  "title": "Paper_985",
  "abstract": "pmc Exp Hematol Oncol Exp Hematol Oncol 1955 exhemaoncol Experimental Hematology & Oncology 2162-3619 BMC PMC12482274 PMC12482274.1 12482274 12482274 41029444 10.1186/s40164-025-00711-x 711 1 Correspondence Novel tumor-infiltrating lymphocytes therapy in solid tumors: latest updates from 2025 ASCO annual meeting Ma Yanan Su Xuan Feng Huijing fenghuijing@sxbqeh.com.cn https://ror.org/04tshhm50 grid.470966.a Department of Thoracic Oncology, Cancer Center, Shanxi Bethune Hospital, Shanxi Academy of Medical Sciences, Third Hospital of Shanxi Medical University, Tongji Shanxi Hospital, 30 9 2025 2025 14 478171 121 2 8 2025 15 9 2025 30 09 2025 01 10 2025 02 10 2025 © The Author(s) 2025 2025 https://creativecommons.org/licenses/by/4.0/ Open Access http://creativecommons.org/licenses/by/4.0/ http://creativecommons.org/publicdomain/zero/1.0/ Tumor-infiltrating lymphocyte (TIL) therapy, a highly promising form of adoptive cell therapy (ACT), has demonstrated success in treating advanced melanoma. Notably, innovative TIL-based monotherapies and combination regimens have provided durable clinical responses and survival benefits for patients with various solid tumors. This article summarizes recent advances in TIL therapy for solid tumors presented at the 2025 ASCO Annual Meeting, highlighting monotherapies such as Lifileucel, LM103, OBX-115, GT101, GT300, GT201, and HS-IT101, as well as combination strategies with the oncolytic adenovirus TILT-123 or pembrolizumab. Keywords Solid tumors Adoptive cell therapy (ACT) Tumor-infiltrating lymphocytes (TIL) Clinical study https://doi.org/10.13039/501100020771 Natural Science Foundation for Young Scientists of Shanxi Province 202303021222308 Ma Yanan Natural Science Foundation of Shanxi Province 202403021221246 Feng Huijing Research and Innovation Team Project for Scientific Breakthroughs at Shanxi Bethune Hospital 2024AOXIANG04 Feng Huijing pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement no pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes issue-copyright-statement © YUMED Inc. and BioMed Central Ltd. 2025 To the editor Adoptive cell therapy with tumor-infiltrating lymphocytes (TIL-ACT) has demonstrated significant therapeutic potential across a range of solid tumors [ 1 3 4 TIL monotherapies in solid tumors Lifileucel, an individualized, one-time, tumor-derived autologous T-cell immunotherapy, represents the world’s first FDA-approved TIL therapy for melanoma and has been formally incorporated into the 2024 NCCN Guidelines [ 4 5 LM103 is a novel TIL therapy using feeder cell technology to optimize manufacturing efficiency and product quality. In a Phase I trial involving Asian patients with metastatic melanoma that progressed after conventional therapy, patients received an intravenous infusion of autologous LM103 (containing 8.24–19.47 × 10 10 6 OBX-115 is a next-generation TIL therapy engineered to express membrane-bound IL-15 (mbIL-15) regulated by the small-molecule drug acetazolamide (ACZ), thereby eliminating the need for toxic high-dose IL-2 support post-infusion. In a Phase I multicenter study of 11 patients with advanced melanoma resistant to immune checkpoint inhibitors (ICI), 6 patients received oral ACZ (500 mg/d) followed by OBX-115 infusion (1-100 × 10⁹ cells) after lymphodepletion. An ORR of 67% (4 PR) and a disease control rate (DCR) of 100% were achieved without IL-2. At a median follow-up of 22.3 weeks, the median DOR, PFS, and OS had not been reached. Most TEAEs were reversible and clinically manageable [ 7 GT101, another TIL therapy employing a novel manufacturing process to enhance product yield and quality, was initially evaluated in cervical cancer patients. In a multicenter Phase I trial for metastatic cervical cancer refractory to standard treatments, 11 patients received GT101 infusion (dose ≥ 5 × 10⁹ viable cells) after lymphodepletion, followed by high-dose IL-2. The ORR was 45.5% (5/11: 36.4% PR [4/11] and 9.1% CR [1/11]), with a DCR of 90.9% (10/11). The median PFS was 4.83 months, and median OS was not reached. GT101 demonstrated an acceptable safety profile, with the majority of TEAEs being Grade 1–2 in severity [ 8 GT300 is the first CRISPR/Cas9 dual knockout anti-exhaustion TIL product to enter pivotal clinical development for solid tumors, designed to enhance TIL function and overcome the immunosuppressive tumor microenvironment (TME). In a Phase I study focusing on advanced, treatment-refractory gynecological cancers, 5 patients received GT300 infusions (1–3 × 10⁹ viable cells) after lymphodepletion, with 4 subsequently receiving IL-2. GT300 demonstrated a favorable clinical profile with ORR 60% (3/5), including CR 40% (2/5) and PR 20% (1/5) and exhibited a favorable safety profile with no long-term safety concerns identified [ 9 GT201 is a novel TIL therapy featuring mbIL-15 expression on TILs, aiming to augment immune activation within the TME and eliminate IL-2 toxicity. In a Phase I trial, patients with advanced solid tumors refractory to standard therapies received GT201 infusions (dose ≥ 5 × 10⁹ viable cells) after lymphodepletion, followed by IL-2. Among 9 evaluable patients (with head and neck squamous cell carcinoma [HNSCC], non-small cell lung cancer [NSCLC], melanoma, cervical cancer, and ovarian cancer), the ORR was 55.6% (5/9: 11.1% CR [1/9] and 44.4% PR [4/9]), and the DCR was 77.8% (7/9). Notably, in the HNSCC subgroup, GT201 achieved an ORR of 100% (2/2: 1 PR, 1 CR). All 3 NSCLC patients achieved a DCR of 100% (SD ≥ 24 weeks or PR). No Grade ≥ 3 adverse events were observed [ 10 HS-IT101 represents the first TIL therapy developed in China to enter clinical trials for solid tumors. As a novel non-genetically modified TIL product focusing on manufacturing technology advancements, it requires only low-dose lymphodepletion and IL-2 support, significantly reducing safety risks while enhancing cell viability and clinical accessibility. In a Phase I trial for advanced solid tumors, 6 melanoma patients receiving HS-IT101 under this low-intensity regimen achieved an ORR of 50% (16.7% CR [1/6] and 33.3% PR [2/6]) and a DCR of 100%. No serious adverse events (SAEs) were reported [ 11 An ongoing Phase 1/2 study is currently evaluating the safety and efficacy of KSQ-004EX, an engineered TIL product with CRISPR/Cas9-mediated dual inactivation of SOCS1 and Regnase-1, in patients with advanced solid tumors [ 12 Collectively, these studies indicate that TIL monotherapies can yield substantial clinical efficacy with manageable safety profiles across multiple solid tumor types, establishing them as a valuable treatment option for advanced disease. TIL combination regimens in solid tumors TIL-ACT has been investigated in combination with the oncolytic adenovirus TILT-123 (encoding TNFα and IL-2) in a Phase I trial involving patients with ICI-refractory advanced melanoma. Seventeen patients received intravenous (IV) and intratumoral TILT-123 alongside IV TIL-ACT, without preconditioning chemotherapy or postconditioning IL-2. At the combination stage assessment (Day 78), the ORR was 27%, including one PR lasting 8 months and a durable CR in a case of mucosal melanoma. The DCR by PET criteria was 47%. The median OS (mOS) was 447 days. The combination of TIL-ACT and TILT-123 exhibited a favorable safety profile [ 13 In the IOV-COM-202 Phase II open-label study, the administration of Lifileucel plus pembrolizumab as maintenance therapy following standard treatment yielded promising results in anti-PD-1/PD-L1-naïve patients with EGFR wild-type advanced NSCLC, showing an ORR of 35% (7/20). At a median follow-up of 8.2 months, the 6-month PFS rate was 19.7%. No Grade ≥ 3 adverse events were observed [ 14 A current Phase Ib study is designed to assess the efficacy and safety of Lifileucel plus adjuvant pembrolizumab in immunotherapy-naïve patients with high-risk, resectable stage IIIb-d melanoma [ 15 These results have showed TIL combination regimens as promising strategies with encouraging efficacy and acceptable safety profiles in melanoma and NSCLC. Despite TIL therapy shows promising prospects, it still faces challenges such as complex manufacturing, limited persistence and immune exhaustion, insufficient clinical evidence beyond melanoma, high costs, and a lack of comparative large-scale randomized study. Conclusion The 2025 ASCO Annual Meeting showcased significant advancements in TIL therapy, as summarized in Tables 1 2  Table 1 Outcomes of clinical trials of novel TIL monotherapies in solid tumors from 2025 ASCO annual meeting Agent Expansion efficiency IL-2 dose IL-15 type Tumor type Phase Accrual Response Survival Major AEs Abstract Number References Lifileucel Standard High dose None Melanoma II 153 ORR 31.4%, CR 5.9%, PR 25.5%,mDOR 36.5 m mOS 13.9 m,5-y OS rate 19.7% Cytopenia, febrile neutropenia 9515 [ 5 LM103 Increased High dose None Melanoma I 8 ORR50%, PR 50%, mDOR not reached mPFS not reached, mOS not reached Emyelosuppression (100%), fever (100%), anemia (100%), and hypotension (100%). 9548 [ 6 OBX-115 Increased None mbIL-15 Melanoma I 6 ORR 67%, PR 67%,DCR 100% ,mDOR not reached mPFS not reached, mOS not reached Hyponatremia, hypokalemia, CRS event (G2) without IL-6 elevation 9517 [ 7 GT101 Increased High dose None Cervical cancer I 11 ORR 45.5%, PR 36.4%, CR 9.1%, DCR 90.9%, mDOR not reached mPFS 4.83 m, mOS not reached Decreased lymphocyte, neutrophil, and white blood cell counts, pyrexia, and tachycardia. 5533 [ 8 GT300 Increased Low dose None Solid tumors, focused on gynecological cancers I 5 ORR 60%, PR 20%, CR40%, mDOR not reached mPFS not reached, mOS not reached Fever, rash, dentalulcer, anemia, and decreased platelet count. 5613 [ 9 GT201 Increased Low dose mbIL-15/IL-15Ra complex Solid tumors including HNSCC and NSCLC I 9 ORR 55.6% CR 11.1%,PR 44.4%,DCR 77.8%,mDOR not reached mPFS not reached, mOS not reached Decreased lymphocyte, neutrophil, and white blood cell counts, pyrexia, and tachycardia 6038 [ 10 HS-IT101 Increased Low dose None Solid tumors I 6 ORR 50%, CR 16.7%, PR 33.3%, DCR 100% mPFS not reached, mOS not reached Fever, fatigue, mild neutropenia and thrombocytop-enia TPS2674 [ 11  AEs ORR CR PR DCR mDOR mOS mPFS mbIL-15 CRS HNSCC NSCLC  Table 2 Outcomes of clinical trials of novel TIL combination regimens in solid tumors from 2025 ASCO annual meeting Agent Tumor type Phase Accrual Response Survival Major AEs Abstract number References TIL+TILT-123 Melanoma I 17 ORR 27%,DCR 47% mOS 447 days N/A 9518 [ 13 Lifileucel + pem-brolizumab NSCLC II 20 ORR 35%,mDOR not reached mPFS not reached, mOS not reached Neutropenia (100%), thrombocytopenia (91%), anemia (84%) pneumonia (9%), colitis (6%), Grade 2 CRS(6%) TPS8659 [ 14  AEs ORR DCR mOS mDOR mPFS N/A NSCLC CRS Abbreviations ACT Adoptive cell therapy CR Complete response DCR Disease control rate DOR Duration of response HNSCC Head and neck squamous cell carcinoma ICI Immune checkpoint inhibitors NSCLC Non-small-cell lung cancer ORR Objective response rate OS Overall survival PFS Progression-free survival SAE Serious adverse events TEAEs Treatment-emergent adverse events TIL Tumor-infiltrating lymphocytes TME Tumor microenvironment Publisher’s note Springer Nature remains neutral with regard to jurisdictional claims in published maps and institutional affiliations. Acknowledgements Not applicable. Author contributions H-J.F. conceptualized the manuscript. Y-N.M. drafted manuscripts and prepared tables. X.S. collected literature. All authors have approved the final manuscript. Funding This study was supported by the Fundamental Research Program of Shanxi Province (202403021221246), the Fundamental Research Program of Shanxi Province (202303021222308) and Research and Innovation Team Project for Scientific Breakthroughs at Shanxi Bethune Hospital (Project ID: 2024AOXIANG04). Data availability No datasets were generated or analysed during the current study. Declarations Ethics approval and consent to participate Not applicable. Consent for publication Not applicable. Competing interests The authors declare no competing interests. References 1. Zhang P Challenges and new technologies in adoptive cell therapy J Hematol Oncol 2023 16 1 97 10.1186/s13045-023-01492-8 37596653 PMC10439661 Zhang P, et al. Challenges and new technologies in adoptive cell therapy. J Hematol Oncol. 2023;16(1):97. 37596653 10.1186/s13045-023-01492-8 PMC10439661 2. Meng Y Xu Enhanced cellular therapy: revolutionizing adoptive cellular therapy Exp Hematol Oncol 2024 13 1 47 10.1186/s40164-024-00506-6 38664743 PMC11046957 Meng Y, Xu, et al. Enhanced cellular therapy: revolutionizing adoptive cellular therapy. Exp Hematol Oncol. 2024;13(1):47. 38664743 10.1186/s40164-024-00506-6 PMC11046957 3. Siwei Zheng Tumor battlefield within inflamed, excluded or desert immune phenotypes: the mechanisms and strategies Exp Hematol Oncol 2024 13 1 80 10.1186/s40164-024-00543-1 39107856 PMC11301948 Siwei, Zheng, et al. Tumor battlefield within inflamed, excluded or desert immune phenotypes: the mechanisms and strategies. Exp Hematol Oncol. 2024;13(1):80. 39107856 10.1186/s40164-024-00543-1 PMC11301948 4. Susan M Swetter NCCN Guidelines ® J Natl Compr Canc Netw 2024 22 5 290 8 10.6004/jnccn.2024.0036 39019054 Susan M, Swetter, et al. NCCN Guidelines ® 39019054 10.6004/jnccn.2024.0036 5. Theresa, Medina et al. Lifileucel in patients with advanced melanoma: 5-year outcomes of the C- 144-01 study. 2025 ASCO GI. #9515. 6. Chuanliang, Cui et al. Influence of tumor infiltrating lymphocytes (TIL) monotherapy on persistent clinical and immunological responses in Asian metastatic melanoma patients with specific CD8 + TIL proportions: A phase I trial. 2025 ASCO GI. #9548. 7. Chesney JA et al. OBX-115 engineered tumor-infiltrating lymphocyte (TIL) cell therapy with regulatable membrane-bound IL15 (mbIL15) in patients (pts) with immune checkpoint inhibitor (ICI)–resistant advanced melanoma: phase 1 results of the Agni-01 multicenter study. 2025 ASCO GI. #9517. 8. Haifeng, Qin et al. GT101 autologous TIL therapy in patients with recurrent and metastatic cervical cancer: A phase 1 study. 2025 ASCO GI. #5533. 9. Pin, Wang, et al. Evaluating the safety and efficacy of CRISPR/Cas9-modified tumor infiltrating lymphocytes (GT300) as monotherapy in advanced solid tumors. ASCO GI. #5613; 2025. 10. Pin, Wang, et al. Assessing the safety and efficacy of GT201: A first-in-class autologous tumor-infiltrating lymphocyte monotherapy in advanced solid tumors. ASCO GI. #6038; 2025. 11. Li N et al. Autologous tumor-infiltrating lymphocytes (HS-IT101) with low-dose lymphodepletion and IL-2 infusion for the treatment of advanced solid tumors: A phase I clinical trial. 2025 ASCO GI. #TPS2674. 12. Rodabe N, Amaria et al. A phase 1/2 study of KSQ-004EX: autologous tumor infiltrating lymphocytes, engineered to inactivate genes encoding SOCS1 and Regnase-1, in patients with select advanced solid tumors. 2025 ASCO GI. #TPS2675. 13. Lyna, Haybout et al. Neutralizing antibodies and lymphocyte count as biomarkers in patients receiving oncolytic adenovirus TILT-123 and adoptive cell transfer of tumorinfiltrating lymphocytes for metastatic melanoma refractory to immune checkpoint inhibitors. 2025 ASCO GI. #9518. 14. Ben C, Creelan et al. Phase 2, multicenter study of frontline maintenance therapy with lifileucel plus pembrolizumab in advanced non-small cell lung cancer. 2025 ASCO GI. #TPS8659. 15. James Isaacs et al. A phase Ib study to assess the safety and efficacy of autologous tumor infiltrating lymphocytes (lifileucel) with adjuvant pembrolizumab (PEMBRO) for treatment of immunotherapy na¨ıve patients with high-risk clinical stage IIIb-d resectable melanoma (MEL). 2025 ASCO GI. #TPS9611. ",
  "metadata": {
    "Title of this paper": "NCCN Guidelines",
    "Journal it was published in:": "Experimental Hematology & Oncology",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12482274/"
  }
}