{
  "title": "Paper_761",
  "abstract": "pmc Antioxidants (Basel) Antioxidants (Basel) 2840 antiox antioxidants Antioxidants 2076-3921 Multidisciplinary Digital Publishing Institute  (MDPI) PMC12466870 PMC12466870.1 12466870 12466870 41008972 10.3390/antiox14091066 antioxidants-14-01066 1 Review The Dual Role of Nanomaterials in Ovarian Cancer and Female Fertility as Anti- and Prooxidants https://orcid.org/0000-0002-3978-2850 Aloisi Massimo Rossi Gianna Cecconi Sandra * Fiore Marco Academic Editor Department of Life, Health and Environmental Sciences, University of L’Aquila, 67100 L’Aquila, Italy; massimo.aloisi@univaq.it gianna.rossi@univaq.it * sandra.cecconi@univaq.it 29 8 2025 9 2025 14 9 497608 1066 17 7 2025 27 8 2025 29 8 2025 29 08 2025 27 09 2025 29 09 2025 © 2025 by the authors. 2025 https://creativecommons.org/licenses/by/4.0/ Licensee MDPI, Basel, Switzerland. This article is an open access article distributed under the terms and conditions of the Creative Commons Attribution (CC BY) license ( https://creativecommons.org/licenses/by/4.0/ Nanomaterials (NMs) are becoming increasingly important in biomedical applications, especially in reproductive biology and oncology. In this review, we examined the “double face” of NMs as prooxidants and antioxidants in relation to ovarian cancer and female fertility. NMs have been shown to reduce oxidative stress pathways in tumors, enhancing the effectiveness of chemotherapy and serving as carriers for drugs and compounds. They are also considered for their protective effects on female fertility by improving oocyte quality, maturation, and survival under various healthy and adverse conditions. However, certain NMs can induce oxidative stress, mitochondrial dysfunction, and ovarian tissue apoptosis when present in high concentrations or after prolonged exposure. These “double face” effects highlight the complex nature of NMs’ concentration, shape, and biocompatibility. Although NMs show promise in cancer treatment and fertility preservation, a comprehensive assessment of their prooxidant potential is necessary for successful clinical application. ovarian cancer female fertility nanomaterials oxidative stress This research received no external funding. pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement no pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes 1. Introduction 1.1. Nanomaterials Generalities Nanomaterials are defined as “ natural, incidental, or manufactured materials containing particles, in an unbound state or as an aggregate or as an agglomerate and where for 50% or more of the particles in the number size distribution one or more external dimensions is in the size range 1–100 nm 1 NMs have unique chemical, physical, and biological properties and can be classified based on shape, composition, size, and origin [ 2 3 4 5 6 7 2 8 9 10 Size is the second most important feature because it can influence NM properties. This is evident from the use of silver (Ag) NMs to color church windows, a technique used since the Middle Ages, as they reflect light at different wavelengths depending on their size [ 11 12 13 14 15 16 16 17 18 19 20 21 21 22 23 24 Particles can interact to form larger structures that alter their kinetic properties and can also react with molecules from their surroundings or biological fluids. When NMs bind metals or organic molecules, they can transport these substances, acting as carriers. This process, known as the “Trojan horse”, increases the level of pollutants that living organisms are exposed to [ 25 In biological systems, smaller NMs can cross biological barriers and reach deeper tissues, increasing toxicological risks [ 26 27 28 29 Shape directly influences NMs’ toxicity and the applications they can be used for [ 30 31 32 33 34 35 The last feature to be considered is the chemical composition of NMs, which allows for the identification of both organic and inorganic NMs. Organic NMs include liposomes, dendrimers, carbon-based particles, and various polymers; inorganic NMs consist of any chemical element, such as silver (Ag), Au, Zn, and others [ 36 37 38 39 40 40 41 42 Table 1 1.2. Oxidative Stress NMs such as fullerenes, platinum, Au, and cerium oxide NPs (CNPs or nanoceria) have antioxidant properties that make them suitable for conditions characterized by oxidative stress (OS). OS is defined as “an imbalance between oxidants and antioxidants in favor of the oxidants, leading to a disruption of redox signaling and control and/or molecular damage” [ 99 Figure 1 100 101 102 103 104 105 1.3. Female Reproductive Health and Oxidative Stress The female reproductive system is particularly sensitive to OS because of its physiology and metabolic activity [ 106 107 107 108 109 110 111 112 113 The main goal of this review is to describe the role that NMs may play in treating OS imbalances in health and disease. In particular, we will focus on two of the most common conditions: ovarian cancer (OC) and infertility. In both cases, we will describe only the pro- and antioxidant NMs and their ability to ameliorate OS and the related disease or their ability to induce OS, which can be exploited against OC or considered as a negative outcome in gamete preservation 1.4. Methodologies In the next two sections, we will discuss some recent results obtained on OC and female infertility. To do so, we reviewed the scientific literature without a specific time frame; we considered publications from any year, trying to balance historical relevance and the most recent publications. No exclusion methods were used. We apologize if we have missed some relevant work. We found references from the most important databases: Pubmed and Scopus. We used keywords such as “antioxidant nanomaterials”, “ovarian cancer”, “oxidative stress and female reproductive health”, “nanomaterials and female health” and combinations of the presented keywords. 2. NMs and Ovarian Cancer (OC) OC is characterized by delayed diagnosis because of its symptoms, which are difficult to distinguish from other conditions. Over 70% of OCs are diagnosed at stage III or IV, meaning survival rates are low [ 114 114 115 116 117 118 119 Combining chemotherapy with other treatments, like PARP inhibitors, can have a synergic effect, increasing treatment efficacy. Also, it has been proven that intraperitoneal chemotherapy improves survival rates in advanced cases by increasing concentrations at the tumor site and lowering systemic toxicity [ 120 121 121 122 123 ZnO, AgNPs, and selenium (Se) can alter the expression of genes related to OS in A2780 ovarian cancer cells, which is linked to antioxidant and anticancer properties [ 124 125 126 127 128 129 130 131 132 133 134 2 135 3+ 4+ 136 137 138 2 All these results confirm that NMs can help breast cancer chemotherapy by increasing drug and compound efficacy, although further studies and clinical trials are needed to translate the results from cells and animals to humans ( Figure 2 3. NMs and Female Fertility The presence of a small, predetermined number of oocytes in the ovary makes female fertility a delicate balance between hormones, the environment, and overall health ( Figure 3 139 140 The ability of NP’s to pass through physiological barriers (blood–testis, placenta) and accumulate in reproductive organs shows the potential risks for both males and females following exposure to NPs. The molecular mechanisms involved are not yet well understood, but they commonly trigger inflammatory responses and genotoxicity. The toxic effects of NPs in female reproduction are based on the ability of NP’s to affect oogenesis and harm fetal development. Despite this, there is a positive aspect linked to the use of NPs, as they can be used as drug carriers or in nanoimaging technologies [ 141 3.1. Antioxidant Effects Endometriosis can result from excessive angiogenesis and OS [ 142 2 143 2 144 145 2 2 El-Beltagy et al. [ 146 Also, iron NPs (synthesized with green method synthesis) or bilirubin/melatonin-conjugated glycol chitosan NPs were proven to induce a significant reduction in cytoplasmic ROS levels in oocytes matured in vitro. Both treatments improved oocyte maturation and increased the final number of embryos [ 147 148 2 2 3 2 2 149 150 3.2. Prooxidant Effects As previously mentioned, NMs can also have toxic effects on female reproductive tissues. In vitro studies have shown that many NPs can cross theca cell layers and are internalized by granulosa cells, disrupting signaling between the somatic and germinal components [ 151 2 152 2 141 153 154 2 2 155 156 157 158 4. Conclusions and Future Prospects Several studies have shown that NMs can negatively impact female fertility and tissues. However, few of them have focused on OS, mainly because it is not always the primary outcome or priority in these studies. Identifying all the molecular pathways altered after NM exposure is important, especially considering the potential protective effects of NMs and their relevant biomedical applications, as discussed earlier. Moreover, the prooxidant effects of some NMs might be useful in cancer therapy, as using toxic molecules or pathways to target cancer cells is not a new concept. Clarifying the specific pathways that each NM can alter is fundamental to understanding the balance between prooxidant and antioxidant mechanisms. When NMs are absorbed from the environment, it is likely that their effects will lead to increased OS. This information not only helps in understanding the adverse outcomes that living beings are exposed to every day but is also important for possible biomedical applications. Personalized medicine may be able to exploit toxic effects to specifically affect cancerous cells. Therefore, the role of NMs in the general oxidative balance of cells is crucial to deconvolute the possible new applications of standard or new NMs. More and more NMs are generated every day. This is thanks to green synthesis, which is unifying industrial and biomedical needs with ecological ones [ 159 160 161 162 163 164 155 165 165 Disclaimer/Publisher’s Note: Author Contributions M.A. and S.C., conceptualization and writing—original draft preparation; M.A., writing—review and editing; G.R., review and editing. All authors have read and agreed to the published version of the manuscript. Institutional Review Board Statement Not applicable. Conflicts of Interest The authors declare no conflicts of interest. References 1. Ema M. Okuda H. Gamo M. Honda K. A review of reproductive and developmental toxicity of silver nanoparticles in laboratory animals Reprod. Toxicol. 2017 67 149 164 10.1016/j.reprotox.2017.01.005 28088501 2. Jeevanandam J. Barhoum A. Chan Y.S. Dufresne A. Danquah M.K. Review on nanoparticles and nanostructured materials: History, sources, toxicity and regulations Beilstein J. Nanotechnol. 2018 9 1050 1074 10.3762/bjnano.9.98 29719757 PMC5905289 3. Boyes W.K. van Thriel C. Neurotoxicology of nanomaterials Chem. Res. Toxicol. 2020 33 1121 1144 10.1021/acs.chemrestox.0c00050 32233399 PMC8293923 4. Tepe N. Bau M. Importance of nanoparticles and colloids from volcanic ash for riverine transport of trace elements to the ocean: Evidence from glacial-fed rivers after the 2010 eruption of Eyjafjallajökull Volcano, Iceland Sci. Total Environ. 2014 488–489 243 251 10.1016/j.scitotenv.2014.04.083 24836133 5. Ermolin M.S. Fedotov P.S. Malik N.A. Karandashev V.K. Nanoparticles of volcanic ash as a carrier for toxic elements on the global scale Chemosphere 2018 200 16 22 10.1016/j.chemosphere.2018.02.089 29471164 6. Churg A. Muller N.L. Update on silicosis Surg. Pathol. Clin. 2024 17 193 202 10.1016/j.path.2023.11.005 38692804 7. Colafarina S. Di Carlo P. Zarivi O. Aloisi M. Di Serafino A. Aruffo E. Arrizza L. Limongi T. Poma A. Genotoxicity response of fibroblast cells and human epithelial adenocarcinoma in vitro model exposed to bare and ozone-treated silica microparticles Cells 2022 11 226 10.3390/cells11020226 35053344 PMC8773945 8. Katz L.M. Dewan K. Bronaugh R.L. Nanotechnology in cosmetics Food Chem. Toxicol. 2015 85 127 137 10.1016/j.fct.2015.06.020 26159063 9. Casiraghi C. Jurchescu O.D. Magdassi S. Su W. Introduction to nanomaterials for printed electronics Nanoscale 2023 15 10480 10483 10.1039/D3NR90072J 37318269 10. Hochella M.F. Jr. Mogk D.W. Ranville J. Allen I.C. Luther G.W. Marr L.C. McGrail B.P. Murayama M. Qafoku N.P. Rosso K.M. Natural, incidental, and engineered nanomaterials and their impacts on the Earth system Science 2019 363 eaau8299 10.1126/science.aau8299 30923195 11. Bayda S. Adeel M. Tuccinardi T. Cordani M. Rizzolio F. The history of nanoscience and nanotechnology: From chemical–physical applications to nanomedicine Molecules 2019 25 112 10.3390/molecules25010112 31892180 PMC6982820 12. Le N. Zhang M. Kim K. Quantum dots and their interaction with biological systems Int. J. Mol. Sci. 2022 23 10763 10.3390/ijms231810763 36142693 PMC9501347 13. Ota S. Li T. Li Y. Ye Z. Labno A. Yin X. Alam M.R. Zhang X. Brownian motion of tethered nanowires Phys. Rev. E 2014 89 053010 10.1103/PhysRevE.89.053010 25353883 14. Jiang C. Liu S. Zhang T. Liu Q. Alvarez P.J.J. Chen W. Current methods and prospects for analysis and characterization of nanomaterials in the environment Environ. Sci. Technol. 2022 56 7426 7447 10.1021/acs.est.1c08011 35584364 15. Singh A.R. Desu P.K. Nakkala R.K. Kondi V. Devi S. Alam M.S. Hamid H. Athawale R.B. Kesharwani P. Nanotechnology-based approaches applied to nutraceuticals Drug Deliv. Transl. Res. 2022 12 485 499 10.1007/s13346-021-00960-3 33738677 16. Cong Y. Baimanov D. Zhou Y. Chen C. Wang L. Penetration and translocation of functional inorganic nanomaterials into biological barriers Adv. Drug Deliv. Rev. 2022 191 114615 10.1016/j.addr.2022.114615 36356929 17. Parvez S. Karole A. Mudavath S.L. Transport mechanism of hydroxy-propyl-beta-cyclodextrin modified solid lipid nanoparticles across human epithelial cells for the oral absorption of antileishmanial drugs Biochim. Biophys. Acta Gen. Subj. 2022 1866 130157 10.1016/j.bbagen.2022.130157 35500665 18. Wang W.D. Guo Y.Y. Yang Z.L. Su G.L. Sun Z.J. Sniping Cancer Stem Cells with Nanomaterials ACS Nano 2023 17 23262 23298 10.1021/acsnano.3c07828 38010076 19. Oroojalian F. Beygi M. Baradaran B. Mokhtarzadeh A. Shahbazi M.A. Immune Cell Membrane-Coated Biomimetic Nanoparticles for Targeted Cancer Therapy Small 2021 17 e2006484 10.1002/smll.202006484 33577127 20. Deng R. Zhao R. Zhang Z. Chen Y. Yang M. Lin Y. Ye J. Li N. Qin H. Yan X. Chondrocyte membrane-coated nanoparticles promote drug retention and halt cartilage damage in rat and canine osteoarthritis Sci. Transl. Med. 2024 16 eadh9751 10.1126/scitranslmed.adh9751 38381849 21. Kopac T. Protein corona, understanding the nanoparticle-protein interactions and future perspectives: A critical review Int. J. Biol. Macromol. 2021 169 290 301 10.1016/j.ijbiomac.2020.12.108 33340622 22. Zhou F. Liao F. Chen L. Liu Y. Wang W. Feng S. The size-dependent genotoxicity and oxidative stress of silica nanoparticles on endothelial cells Environ. Sci. Pollut. Res. Int. 2019 26 1911 1920 10.1007/s11356-018-3695-2 30460651 23. Du X. Zhang M. Ma Y. Wang X. Liu Y. Huang H. Kang Z. Size-dependent antibacterial of carbon dots by selective absorption and differential oxidative stress of bacteria J. Colloid Interface Sci. 2023 634 44 53 10.1016/j.jcis.2022.12.025 36528970 24. Crecente-Campo J. Guerra-Varela J. Peleteiro M. Gutiérrez-Lovera C. Fernández-Mariño I. Diéguez-Docampo A. González-Fernández Á. Sánchez L. Alonso M.J. The size and composition of polymeric nanocapsules dictate their interaction with macrophages and biodistribution in zebrafish J. Control. Release 2019 308 98 108 10.1016/j.jconrel.2019.07.011 31306677 25. Baroli B. Penetration of nanoparticles and nanomaterials in the skin: Fiction or reality? J. Pharm. Sci. 2010 99 21 50 10.1002/jps.21817 19670463 26. Furtado D. Björnmalm M. Ayton S. Bush A.I. Kempe K. Caruso F. Overcoming the blood-brain barrier: The role of nanomaterials in treating neurological diseases Adv. Mater. 2018 30 e1801362 10.1002/adma.201801362 30066406 27. Shi C. Zhang J. Wang H. Chen C. Han M. Gao L. Tang C. Sun P. Zhao X. Guo F. Trojan horse nanocapsule enabled in situ modulation of the phenotypic conversion of Th17 cells to treg cells for the treatment of multiple sclerosis in mice Adv. Mater. 2023 35 e2210262 10.1002/adma.202210262 36575563 28. Dassonville-Klimpt A. Sonnet P. Advances in ‘Trojan horse’ strategies in antibiotic delivery systems Future Med. Chem. 2020 12 983 986 10.4155/fmc-2020-0065 32270702 29. Fu F. Crespy D. Landfester K. Jiang S. In situ characterization techniques of protein corona around nanomaterials Chem. Soc. Rev. 2024 53 10827 10851 10.1039/D4CS00507D 39291461 30. Kladko D.V. Falchevskaya A.S. Serov N.S. Prilepskii A.Y. Nanomaterial shape influence on cell behavior Int. J. Mol. Sci. 2021 22 5266 10.3390/ijms22105266 34067696 PMC8156540 31. Enea M. Pereira E. de Almeida M.P. Araújo A.M. de Lourdes Bastos M. Carmo H. Gold nanoparticles induce oxidative stress and apoptosis in human kidney cells Nanomaterials 2020 10 995 10.3390/nano10050995 32455923 PMC7279525 32. Sultana S. Djaker N. Boca-Farcau S. Salerno M. Charnaux N. Astilean S. Hlawaty H. De La Chapelle M.L. Comparative toxicity evaluation of flower-shaped and spherical gold nanoparticles on human endothelial cells Nanotechnology 2015 26 055101 10.1088/0957-4484/26/5/055101 25573907 33. Bhattacharya D. Santra C.R. Ghosh A.N. Karmakar P. Differential toxicity of rod and spherical zinc oxide nanoparticles on human peripheral blood mononuclear cells J. Biomed. Nanotechnol. 2014 10 707 716 10.1166/jbn.2014.1744 24734523 34. Niu M. Zhong H. Shao H. Hong D. Ma T. Xu K. Chen X. Han J. Sun J. Shape-dependent genotoxicity of mesoporous silica nanoparticles and cellular mechanisms J. Nanosci. Nanotechnol. 2016 16 2313 2318 10.1166/jnn.2016.10928 27455635 35. Arnida Malugin A. Ghandehari H. Cellular uptake and toxicity of gold nanoparticles in prostate cancer cells: A comparative study of rods and spheres J. Appl. Toxicol. 2010 30 212 217 10.1002/jat.1486 19902477 36. Wang X. Zhong X. Li J. Liu Z. Cheng L. Inorganic nanomaterials with rapid clearance for biomedical applications Chem. Soc. Rev. 2021 50 8669 8742 10.1039/D0CS00461H 34156040 37. Sowmiya P. Dhas T.S. Inbakandan D. Anandakumar N. Nalini S. Suganya K.S.U. Remya R.R. Karthick V. Kumar C.M.V. Optically active organic and inorganic nanomaterials for biological imaging applications: A review Micron 2023 172 103486 10.1016/j.micron.2023.103486 37262930 38. Singh P. Pandit S. Mokkapati V.R.S.S. Garg A. Ravikumar V. Mijakovic I. Gold nanoparticles in diagnostics and therapeutics for human cancer Int. J. Mol. Sci. 2018 19 1979 10.3390/ijms19071979 29986450 PMC6073740 39. Diez-Pascual A.M. Rahdar A. Functional nanomaterials in biomedicine: Current uses and potential applications Chem. Med. Chem. 2022 17 e202200142 10.1002/cmdc.202200142 35729066 PMC9544115 40. Cavallaro P.A. De Santo M. Belsito E.L. Longobucco C. Curcio M. Morelli C. Pasqua L. Leggio A. Peptides targeting HER2-positive breast cancer cells and applications in tumor imaging and delivery of chemotherapeutics Nanomaterials 2023 13 2476 10.3390/nano13172476 37686984 PMC10490457 41. Stefanick J.F. Kiziltepe T. Bilgicer B. Improved peptide-targeted liposome design through optimized peptide hydrophilicity, ethylene glycol linker length, and peptide density J. Biomed. Nanotechnol. 2015 11 1418 1430 10.1166/jbn.2015.2087 26295142 42. Landsiedel R. Fabian E. Ma-Hock L. van Ravenzwaay B. Wohlleben W. Wiench K. Oesch F. Toxico-/biokinetics of nanomaterials Arch. Toxicol. 2012 86 1021 1060 Erratum in Arch. Toxicol. 2012 86 10.1007/s00204-012-0858-7 22576463 43. Nam M. Lee J. Lee K.Y. Kim J. Sequential targeted delivery of liposomes to ischemic tissues by controlling blood vessel permeability ACS Biomater. Sci. Eng. 2018 4 532 538 10.1021/acsbiomaterials.7b00815 33418742 44. Wang N. Chen M. Wang T. Liposomes used as a vaccine adjuvant-delivery system: From basics to clinical immunization J. Control Release 2019 303 130 150 10.1016/j.jconrel.2019.04.025 31022431 PMC7111479 45. Forier K. Raemdonck K. De Smedt S.C. Demeester J. Coenye T. Braeckmans K. Lipid and polymer nanoparticles for drug delivery to bacterial biofilms J. Control. Release 2014 190 607 623 10.1016/j.jconrel.2014.03.055 24794896 46. Adler-Moore J. Lewis R.E. Brüggemann R.J.M. Rijnders B.J.A. Groll A.H. Walsh T.J. Preclinical safety, tolerability, pharmacokinetics, pharmacodynamics, and antifungal activity of liposomal amphotericin B Clin. Infect. Dis. 2019 68 S244 S259 10.1093/cid/ciz064 31222254 PMC6495008 47. Sercombe L. Veerati T. Moheimani F. Wu S.Y. Sood A.K. Hua S. Advances and challenges of liposome assisted drug delivery Front. Pharmacol. 2015 6 286 10.3389/fphar.2015.00286 26648870 PMC4664963 48. Meyers S.R. Juhn F.S. Griset A.P. Luman N.R. Grinstaff M.W. Anionic amphiphilic dendrimers as antibacterial agents J. Am. Chem. Soc. 2008 130 14444 14445 10.1021/ja806912a 18842041 PMC2673084 49. Pérez-Anes A. Spataro G. Coppel Y. Moog C. Blanzat M. Turrin C.O. Caminade A.M. Rico-Lattes I. Majoral J.P. Phosphonate terminated PPH dendrimers: Influence of pendant alkyl chains on the in vitro anti-HIV-1 properties Org. Biomol. Chem. 2009 7 3491 3498 10.1039/b908352a 19675905 50. Dhanikula R.S. Argaw A. Bouchard J.F. Hildgen P. Methotrexate loaded polyether-copolyester dendrimers for the treatment of gliomas: Enhanced efficacy and intratumoral transport capability Mol. Pharm. 2008 5 105 116 10.1021/mp700086j 18171013 51. Lee C.C. Gillies E.R. Fox M.E. Guillaudeu S.J. Fréchet J.M. Dy E.E. Szoka F.C. A single dose of doxorubicin-functionalized bow-tie dendrimer cures mice bearing C-26 colon carcinomas Proc. Natl. Acad. Sci. USA 2006 103 16649 16654 10.1073/pnas.0607705103 17075050 PMC1636509 52. Zhong S. Yung L.Y. Enhanced biological stability of collagen with incorporation of PAMAM dendrimer J. Biomed. Mater. Res. A 2009 91 114 122 10.1002/jbm.a.32188 18767056 53. Rudovský J. Botta M. Hermann P. Hardcastle K.I. Lukes I. Aime S. PAMAM dendrimeric conjugates with a Gd-DOTA phosphinate derivative and their adducts with polyaminoacids: The interplay of global motion, internal rotation, and fast water exchange Bioconjug. Chem. 2006 17 975 987 10.1021/bc060149l 16848405 54. Han X.M. Zheng K.W. Wang R.L. Yue S.F. Chen J. Zhao Z.W. Song F. Su Y. Ma Q. Functionalization and optimization-strategy of graphene oxide-based nanomaterials for gene and drug delivery Am. J. Transl. Res. 2020 12 1515 1534 32509159 PMC7270027 55. Xu J. Xu K. Han Y. Wang D. Li X. Hu T. Yi H. Ni Z. A 3D porous graphene aerogel@ GOx based microfluidic biosensor for electrochemical glucose detection Analyst 2020 145 5141 5147 10.1039/D0AN00681E 32573601 56. Sheng Z. Song L. Zheng J. Hu D. He M. Zheng M. Gao G. Gong P. Zhang P. Ma Y. Protein-assisted fabrication of nano-reduced graphene oxide for combined in vivo photoacoustic imaging and photothermal therapy Biomaterials 2013 34 5236 5243 10.1016/j.biomaterials.2013.03.090 23602365 57. Shin S.R. Zihlmann C. Akbari M. Assawes P. Cheung L. Zhang K. Manoharan V. Zhang Y.S. Yüksekkaya M. Wan K.T. Reduced graphene oxide-GelMA hybrid hydrogels as scaffolds for cardiac tissue engineering Small 2016 12 3677 3689 10.1002/smll.201600178 27254107 PMC5201005 58. Araya-Hermosilla R. Dervillé F. Cohn-Inostroza N. Picchioni F. Pescarmona P.P. Poortinga A. Pickering Emulsions and Antibubbles Stabilized by PLA/PLGA Nanoparticles Langmuir 2022 38 182 190 10.1021/acs.langmuir.1c02320 34913697 59. Yang H. Sung J. Alghoul Z. Merlin D. Preparation, Characterization, and Cell Uptake of PLGA/PLA-PEG-FA Nanoparticles Bio Protoc. 2022 12 e4373 10.21769/BioProtoc.4373 35530526 PMC9018435 60. Banappagari S. Ronald S. Satyanarayanajois S.D. A conformationally constrained peptidomimetic binds to the extracellular region of HER2 protein J. Biomol. Struct. Dyn. 2010 28 289 308 10.1080/07391102.2010.10507360 20919746 PMC3005560 61. Stefanick J.F. Ashley J.D. Bilgicer B. Enhanced cellular uptake of peptide-targeted nanoparticles through increased peptide hydrophilicity and optimized ethylene glycol peptide-linker length ACS Nano 2013 7 8115 8127 10.1021/nn4033954 24003770 62. Nakajima H. Mizuta N. Sakaguchi K. Fujiwara I. Yoshimori A. Takahashi S. Takasawa R. Tanuma S. Development of HER2-antagonistic peptides as novel anti-breast cancer drugs by in silico methods Breast Cancer 2008 15 65 72 10.1007/s12282-007-0018-8 18224397 63. Li Z. Li G. Xu J. Li C. Han S. Zhang C. Wu P. Lin Y. Wang C. Zhang J. Hydrogel Transformed from Nanoparticles for Prevention of Tissue Injury and Treatment of Inflammatory Diseases Adv. Mater. 2022 34 2109178 10.1002/adma.202109178 35195940 64. Wang X. Ma Y. Lu F. Chang Q. The diversified hydrogels for biomedical applications and their imperative roles in tissue regeneration Biomater. Sci. 2023 11 2639 2660 10.1039/D2BM01486F 36790251 65. Guo L. Fu Z. Li H. Wei R. Guo J. Wang H. Qi J. Smart hydrogel: A new platform for cancer therapy Adv. Colloid. Interface Sci. 2025 340 103470 10.1016/j.cis.2025.103470 40086017 66. Suk J.S. Xu Q. Kim N. Hanes J. Ensign L.M. PEGylation as a strategy for improving nanoparticle-based drug and gene delivery Adv. Drug Deliv. Rev. 2016 99 28 51 10.1016/j.addr.2015.09.012 26456916 PMC4798869 67. Gericke M. Schulze P. Heinze T. Nanoparticles Based on Hydrophobic Polysaccharide Derivatives-Formation Principles, Characterization Techniques, and Biomedical Applications Macromol. Biosci. 2020 20 e1900415 10.1002/mabi.201900415 32090505 68. Allawadhi P. Singh V. Govindaraj K. Khurana I. Sarode L.P. Navik U. Banothu A.K. Weiskirchen R. Bharani K.K. Khurana A. Biomedical applications of polysaccharide nanoparticles for chronic inflammatory disorders: Focus on rheumatoid arthritis, diabetes and organ fibrosis Carbohydr. Polym. 2022 281 118923 10.1016/j.carbpol.2021.118923 35074100 69. Saravanakumar G. Jo D.G. Park J.H. Polysaccharide-based nanoparticles: A versatile platform for drug delivery and biomedical imaging Curr. Med. Chem. 2012 19 3212 3229 10.2174/092986712800784658 22612705 70. Swierczewska M. Han H.S. Kim K. Park J.H. Lee S. Polysaccharide-based nanoparticles for theranostic nanomedicine Adv. Drug Deliv. Rev. 2016 99 Pt A 70 84 10.1016/j.addr.2015.11.015 26639578 PMC4798864 71. Bakshi M.S. Colloidal micelles of block copolymers as nanoreactors, templates for gold nanoparticles, and vehicles for biomedical applications Adv. Colloid Interface Sci. 2014 213 1 20 10.1016/j.cis.2014.08.001 25262452 72. Cao Z. Zuo X. Liu X. Xu G. Yong K.T. Recent progress in stimuli-responsive polymeric micelles for targeted delivery of functional nanoparticles Adv. Colloid Interface Sci. 2024 330 103206 10.1016/j.cis.2024.103206 38823215 73. Hallan S.S. Ferrara F. Sguizzato M. Cortesi R. Cyclodextrin-Based Nanotransporters as a Versatile Tool to Manage Oxidative Stress-Induced Lung Diseases Antioxidants 2025 14 1007 10.3390/antiox14081007 40867903 PMC12383091 74. Jana M. Biswas U.K. Patro C.S. Debnath B. Sharma S. Naskar S. Solid Lipid Nanoparticles: A Review of their Biomedical Applications and Preparation Pharm. Nanotechnol. 2024 13 758 774 10.2174/0122117385312175240502100018 38797906 75. Eygeris Y. Gupta M. Kim J. Sahay G. Chemistry of Lipid Nanoparticles for RNA Delivery Acc. Chem. Res. 2022 55 2 12 10.1021/acs.accounts.1c00544 34850635 76. Li L. Xing H. Zhang J. Lu Y. Functional DNA Molecules Enable Selective and Stimuli-Responsive Nanoparticles for Biomedical Applications Acc. Chem Res. 2019 52 2415 2426 10.1021/acs.accounts.9b00167 31411853 PMC7103426 77. Bhumkar D.R. Joshi H.M. Sastry M. Pokharkar V.B. Chitosan reduced gold nanoparticles as novel carriers for transmucosal delivery of insulin Pharm. Res. 2007 24 1415 1426 10.1007/s11095-007-9257-9 17380266 78. Tong L. Zhao Y. Huff T.B. Hansen M.N. Wei A. Cheng J.X. Gold nanorods mediate tumor cell death by compromising membrane integrity Adv. Mater. 2007 19 3136 3141 10.1002/adma.200701974 19020672 PMC2584614 79. Medley C.D. Smith J.E. Tang Z. Wu Y. Bamrungsap S. Tan W. Gold nanoparticle-based colorimetric assay for the direct detection of cancerous cells Anal. Chem. 2008 80 1067 1072 10.1021/ac702037y 18198894 80. Speshock J.L. Murdock R.C. Braydich-Stolle L.K. Schrand A.M. Hussain S.M. Interaction of silver nanoparticles with Tacaribe virus J. Nanobiotechnology 2010 8 19 10.1186/1477-3155-8-19 20718972 PMC2936366 81. Gopinath V. Velusamy P. Extracellular biosynthesis of silver nanoparticles using Bacillus sp. GP-23 and evaluation of their antifungal activity towards Fusarium oxysporum Spectrochim. Acta A. Mol. Biomol. Spectrosc. 2013 106 170 174 10.1016/j.saa.2012.12.087 23376272 82. Saad H.A. Soliman M.I. Azzam A.M. Mostafa B. Antiparasitic activity of silver and copper oxide nanoparticles against entamoeba histolytica and cryptosporidium parvum cysts J. Egypt Soc. Parasitol. 2015 45 593 602 26939237 10.12816/0017920 83. Zhang M. Zhang K. De Gusseme B. Verstraete W. Field R. The antibacterial and anti-biofouling performance of biogenic silver nanoparticles by Lactobacillus fermentum Biofouling 2014 30 347 357 10.1080/08927014.2013.873419 24564796 84. Miller C.N. Newall N. Kapp S.E. Lewin G. Karimi L. Carville K. Gliddon T. Santamaria N.M. A randomized-controlled trial comparing cadexomer iodine and nanocrystalline silver on the healing of leg ulcers Wound Repair Regen. 2010 18 359 367 10.1111/j.1524-475X.2010.00603.x 20636550 85. Sriram M.I. Kanth S.B. Kalishwaralal K. Gurunathan S. Antitumor activity of silver nanoparticles in Dalton’s lymphoma ascites tumor model Int. J. Nanomedicine 2010 5 753 762 21042421 10.2147/IJN.S11727 PMC2962271 86. Benyettou F. Rezgui R. Ravaux F. Jaber T. Blumer K. Jouiad M. Motte L. Olsen J.C. Platas-Iglesias C. Magzoub M. Synthesis of silver nanoparticles for the dual delivery of doxorubicin and alendronate to cancer cells J. Mater. Chem. B 2015 3 7237 7245 10.1039/C5TB00994D 32262831 87. Pérez-Díaz M.A. Boegli L. James G. Velasquillo C. Sánchez-Sánchez R. Martínez-Martínez R.E. Martínez-Castañón G.A. Martinez-Gutierrez F. Silver nanoparticles with antimicrobial activities against Streptococcus mutans and their cytotoxic effect Mater. Sci. Eng. C Mater. Biol. Appl. 2015 55 360 366 10.1016/j.msec.2015.05.036 26117766 88. Zhang H. Chen B. Jiang H. Wang C. Wang H. Wang X. A strategy for ZnO nanorod mediated multi-mode cancer treatment Biomaterials 2011 32 1906 1914 10.1016/j.biomaterials.2010.11.027 21145104 89. Guo D. Wu C. Jiang H. Li Q. Wang X. Chen B. Synergistic cytotoxic effect of different sized ZnO nanoparticles and daunorubicin against leukemia cancer cells under UV irradiation J. Photochem. Photobiol. B 2008 93 119 126 10.1016/j.jphotobiol.2008.07.009 18774727 90. Zhao J. Wu D. Zhi J. A novel tyrosinase biosensor based on biofunctional ZnO nanorod microarrays on the nanocrystalline diamond electrode for detection of phenolic compounds Bioelectrochemistry 2009 75 44 49 10.1016/j.bioelechem.2009.01.005 19230793 91. Fu S. Chen H. Yang W. Xia X. Zhao S. Xu X. Ai P. Cai Q. Li X. Wang Y. ROS-targeted depression therapy via BSA-incubated ceria nanoclusters Nano Lett. 2022 22 4519 4527 10.1021/acs.nanolett.2c01334 35583518 PMC9185743 92. Zhang B. Li Q. Xu Q. Li B. Dong H. Mou Y. Polydopamine modified ceria nanorods alleviate inflammation in colitis by scavenging ROS and regulating macrophage M2 polarization Int. J. Nanomed. 2023 18 4601 4616 10.2147/IJN.S416049 PMC10437713 37600119 93. Fox C.R. Kedarinath K. Neal C.J. Sheiber J. Kolanthai E. Kumar U. Drake C. Seal S. Parks G.D. Broad-spectrum, potent, and durable ceria nanoparticles inactivate RNA virus infectivity by targeting virion surfaces and disrupting virus-receptor interactions Molecules 2023 28 5190 10.3390/molecules28135190 37446852 PMC10343717 94. Li Y. Wang H. Tang L. Zhu H. Titanium dioxide nanoparticles enhance photocurrent generation of cyanobacteria Biochem. Biophys. Res. Commun. 2023 672 113 119 10.1016/j.bbrc.2023.06.051 37348173 95. Landsiedel R. Ma-Hock L. Van Ravenzwaay B. Schulz M. Wiench K. Champ S. Schulte S. Wohlleben W. Oesch F. Gene toxicity studies on titanium dioxide and zinc oxide nanomaterials used for UV-protection in cosmetic formulations Nanotoxicology 2010 4 364 381 10.3109/17435390.2010.506694 20925445 96. Shen Y. Zhang N. Sun Y. Zhao W.W. Ye D. Xu J.J. Chen H.Y. Activatable QD-based near-infrared fluorescence probe for sensitive detection and imaging of DNA ACS Appl. Mater. Interfaces 2017 9 25107 25113 10.1021/acsami.7b05871 28696099 97. Zhang Y. Xiu W. Sun Y. Zhu D. Zhang Q. Yuwen L. Weng L. Teng Z. Wang L. RGD-QD-MoS 2 Nanoscale 2017 9 15835 15845 10.1039/C7NR05278B 28994430 98. Li Z. Barnes J.C. Bosoy A. Stoddart J.F. Zink J.I. Mesoporous silica nanoparticles in biomedical applications Chem. Soc. Rev. 2012 41 2590 2605 10.1039/c1cs15246g 22216418 99. Sies H. Jones D.P. Oxidative stress Encyclopedia of Stress 2nd ed. Fink G. Elsevier Amsterdam, The Netherlands 2007 Volume 3 45 48 100. Teleanu D.M. Niculescu A.G. Lungu I.I. Radu C.I. Vladâcenco O. Roza E. Costăchescu B. Grumezescu A.M. Teleanu R.I. An Overview of oxidative stress, neuroinflammation, and neurodegenerative diseases Int. J. Mol. Sci. 2022 23 5938 10.3390/ijms23115938 35682615 PMC9180653 101. Ho H.J. Shirakawa H. Oxidative stress and mitochondrial dysfunction in chronic kidney disease Cells 2022 12 88 10.3390/cells12010088 36611880 PMC9818928 102. Dai X. Hu Y. Jiang L. Lei L. Fu C. Wu S. Zhang X. Zhu L. Zhang F. Chen J. Decreased oxidative stress response and oxidant detoxification of skin during aging Mech. Ageing Dev. 2023 216 111878 10.1016/j.mad.2023.111878 37827221 103. Calaf G.M. Aguayo F. Sergi C.M. Juarranz A. Roy D. Antioxidants and cancer: Theories, techniques, and trials in preventing cancer Oxid. Med. Cell. Longev. 2018 2018 5363064 10.1155/2018/5363064 29887942 PMC5985106 104. Vecchiotti G. Colafarina S. Aloisi M. Zarivi O. Di Carlo P. Poma A. Genotoxicity and oxidative stress induction by polystyrene nanoparticles in the colorectal cancer cell line HCT116 PLoS ONE 2021 16 e0255120 10.1371/journal.pone.0255120 34297768 PMC8301662 105. Forman H.J. Zhang H. Targeting oxidative stress in disease: Promise and limitations of antioxidant therapy Nat. Rev. Drug Discov. 2021 20 689 709 Erratum in Nat. Rev. Drug Discov. 2021 20 10.1038/s41573-021-00233-1 34194012 PMC8243062 106. Agarwal A. Aponte-Mellado A. Premkumar B.J. Shaman A. Gupta S. The effects of oxidative stress on female reproduction: A review Reprod. Biol. Endocrinol. 2012 10 49 10.1186/1477-7827-10-49 22748101 PMC3527168 107. Behrman H.R. Kodaman P.H. Preston S.L. Gao S. Oxidative stress and the ovary J. Soc. Gynecol. Investig. 2001 8 S40 S42 10.1016/s1071-5576(00)00106-4 11223371 108. Shkolnik K. Tadmor A. Ben-Dor S. Nevo N. Galiani D. Dekel N. Reactive oxygen species are indispensable in ovulation Proc. Natl. Acad. Sci. USA 2011 108 1462 1467 10.1073/pnas.1017213108 21220312 PMC3029775 109. Tropea A. Miceli F. Minici F. Tiberi F. Orlando M. Gangale M.F. Romani F. Catino S. Mancuso S. Navarra P. Regulation of vascular endothelial growth factor synthesis and release by human luteal cells in vitro J. Clin. Endocrinol. Metab. 2006 91 2303 2309 10.1210/jc.2005-2457 16595603 110. Hamadneh S. Hamadneh J. Active and passive maternal smoking during pregnancy and birth outcomes: A study from a developing country Ann. Glob. Health 2021 87 122 10.5334/aogh.3384 34900622 PMC8641528 111. Ujhelyi Gomez K. Goodwin L. Chisholm A. Rose A.K. Alcohol use during pregnancy and motherhood: Attitudes and experiences of pregnant women, mothers, and healthcare professionals PLoS ONE 2022 17 0275609 10.1371/journal.pone.0275609 PMC9714863 36454984 112. Hayer S. Mandelbaum A.D. Watch L. Ryan K.S. Hedges M.A. Manuzak J.A. Easley C.A. Schust D.J. Lo J.O. Cannabis and pregnancy: A Review Obstet. Gynecol. Surv. 2023 78 411 428 10.1097/OGX.0000000000001159 37480292 PMC10372687 113. Dutta S. Gorain B. Choudhury H. Roychoudhury S. Sengupta P. Environmental and occupational exposure of metals and female reproductive health Environ. Sci. Pollut. Res. Int. 2022 29 62067 62092 10.1007/s11356-021-16581-9 34558053 114. Ovarian Cancer Research Alliance Statistics Available online: https://ocrahope.org/for-patients/gynecologic-cancers/ovarian-cancer/ovarian-cancer-statistics/ (accessed on 29 August 2025) 115. Vargas A.N. Natural history of ovarian cancer Ecancermedicalscience 2014 8 465 25371706 10.3332/ecancer.2014.465 PMC4176445 116. Stewart C. Ralyea C. Lockwood S. Ovarian Cancer: An Integrated Review Semin. Oncol. Nurs. 2019 35 151 156 10.1016/j.soncn.2019.02.001 30867104 117. La Vecchia C. Ovarian cancer: Epidemiology and risk factors Eur. J. Cancer Prev. 2017 26 55 62 10.1097/CEJ.0000000000000217 26731563 118. Coelho R. Tozzi A. Disler M. Lombardo F. Fedier A. Lopez M.N. Freuler F. Jacob F. Heinzelmann-Schwarz V. Overlapping gene dependencies for PARP inhibitors and carboplatin response identified by functional CRISPR-Cas9 screening in ovarian cancer Cell Death Dis. 2022 13 909 10.1038/s41419-022-05347-x 36307400 PMC9616819 119. Muggia F. Weekly Carboplatin and Paclitaxel for Ovarian Cancer: The “Finer Points” Oncologist 2021 26 1 3 10.1002/onco.13572 33098242 PMC7794168 120. Yang L. Xie H.J. Li Y.Y. Wang X. Liu X.X. Mai J. Molecular mechanisms of platinum-based chemotherapy resistance in ovarian cancer (Review) Oncol. Rep. 2022 47 82 10.3892/or.2022.8293 35211759 PMC8908330 121. Morand S. Devanaboyina M. Staats H. Stanbery L. Nemunaitis J. Ovarian cancer immunotherapy and personalized medicine Int. J. Mol. Sci. 2021 22 6532 10.3390/ijms22126532 34207103 PMC8234871 122. Jain N.K. Tare M.S. Mishra V. Tripathi P.K. The development, characterization and in vivo anti-ovarian cancer activity of poly(propylene imine) (PPI)-antibody conjugates containing encapsulated paclitaxel Nanomedicine 2015 11 207 218 10.1016/j.nano.2014.09.006 25262579 123. Pandey S. Rai L.C. Dubey S.K. Cyanobacteria: Miniature factories for green synthesis of metallic nanomaterials: A review Biometals 2022 35 653 674 10.1007/s10534-022-00405-5 35716270 124. Irannejad F. Shahbazi S. Reiisi S. Heidari R. Study of the effect of zinc oxide, selenium, and silver nanoparticles on the expression level of oxidative stress-associated genes in ovarian cancer Med. Oncol. 2025 42 39 10.1007/s12032-024-02593-1 39760958 125. Scicchitano S. Gagliardi A. Ambrosio N. Vecchio E. Garofalo C. Battaglia A.M. Costanzo F.S. Faniello M.C. Cosco D. Exploring the effects of paclitaxel-loaded zein nanoparticles on human ovarian carcinoma cells Sci. Rep. 2025 15 10553 10.1038/s41598-025-90840-4 40148366 PMC11950396 126. Chen J. Li Y. Fang J. Cao Z. Shang Y. Alfarraj S. Ali Alharbi S. Duan X. Yang S. Li J. Green synthesis, characterization, cytotoxicity, antioxidant, and anti-human ovarian cancer activities of Curcumae kwangsiensis Arabian J. Chem. 2021 14 103000 10.1016/j.arabjc.2021.103000 127. Sindhu R.K. Verma R. Salgotra T. Rahman M.H. Shah M. Akter R. Murad W. Mubin S. Bibi P. Qusti S. Impacting the remedial potential of nano delivery-based flavonoids for breast cancer treatment Molecules 2021 26 5163 10.3390/molecules26175163 34500597 PMC8434139 128. Bahrami A. Makiabadi E. Jalali S. Heidari Z. Assadi M. Rashidkhani B. Dietary intake of polyphenols and the risk of breast cancer: A case-control study Clin. Nutr. Res. 2021 10 330 340 10.7762/cnr.2021.10.4.330 34796137 PMC8575644 129. Park M.Y. Kim Y. Ha S.E. Kim H.H. Bhosale P.B. Abusaliya A. Jeong S.H. Kim G.S. Function and application of flavonoids in the breast cancer Int. J. Mol. Sci. 2022 23 7732 10.3390/ijms23147732 35887080 PMC9323071 130. Xu P. Yin Q. Shen J. Chen L. Yu H. Zhang Z. Li Y. Synergistic inhibition of breast cancer metastasis by silibinin-loaded lipid nanoparticles containing TPGS Int. J. Pharm. 2013 454 21 30 10.1016/j.ijpharm.2013.06.053 23830941 131. Ding S.M. Zhang Z.H. Song J. Cheng X.D. Jiang J. Jia X.B. Enhanced bioavailability of apigenin via preparation of a carbon nano powder solid dispersion Int. J. Nanomed. 2014 9 2327 10.2147/IJN.S60938 24872695 PMC4026550 132. Shindikar A. Singh A. Nobre M. Kirolikar S. Curcumin and Resveratrol as Promising Natural Remedies with Nanomedicine Approach for the Effective Treatment of Triple Negative Breast Cancer J. Oncol. 2016 2016 9750785 10.1155/2016/9750785 27242900 PMC4875984 133. Niazaand F. Razizadeh M. Khorsandi L. Abbaspour M. Mansouri E. Khodadadi A. Effects of quercetin-loaded nanoparticles on MCF-7 human breast cancer cells Medicina 2019 55 114 10.3390/medicina55040114 31013662 PMC6524048 134. Liu Y. Xie X. Hou Z. Shen J. Shi J. Chen H. He Y. Wang Z. Feng N. Functional oral nanoparticles for delivering silibinin and cryptotanshinone against breast cancer lung metastasis J. Nanobiotechnol. 2020 18 83 10.1186/s12951-020-00638-x PMC7260741 32473632 135. Kim Y.G. Lee Y. Lee N. Soh M. Kim D. Hyeon T. Ceria-based therapeutic antioxidants for biomedical applications Adv. Mater. 2024 36 e2210819 10.1002/adma.202210819 36793245 136. Jiang P. Zhang L. Liu X. Ye C. Zhu P. Tan T. Wang D. Wang Y. Tuning oxidant and antioxidant activities of ceria by anchoring copper single-site for antibacterial application Nat. Commun. 2024 15 1010 10.1038/s41467-024-45255-6 38307902 PMC10837451 137. Varukattu N.B. Lin W. Vivek R. Rejeeth C. Sabarathinam S. Yao Z. Zhang H. Targeted and intrinsic activity of HA-functionalized PEI-nanoceria as a nano reactor in potential triple-negative breast cancer treatment ACS Appl. Bio Mater. 2020 3 186 196 10.1021/acsabm.9b00577 35019435 138. Adebayo O.A. Akinloye O. Adaramoye O.A. Cerium oxide nanoparticles elicit antitumourigenic effect in experimental breast cancer induced by N-methyl-N-nitrosourea and benzo(a)pyrene in female Wistar rats J. Biochem. Mol. Toxicol. 2021 35 e22687 10.1002/jbt.22687 33314526 139. Bala R. Singh V. Rajender S. Singh K. Environment, lifestyle, and female infertility Reprod. Sci. 2021 28 617 638 10.1007/s43032-020-00279-3 32748224 140. Canipari R. De Santis L. Cecconi S. Female fertility and environmental pollution Int. J. Environ. Res. Public Health 2020 17 8802 10.3390/ijerph17238802 33256215 PMC7730072 141. Aloisi M. Rossi G. Colafarina S. Guido M. Cecconi S. Poma A.M.G. The impact of metal nanoparticles on female reproductive system: Risks and opportunities Int. J. Environ. Res. Public Health 2022 19 13748 10.3390/ijerph192113748 36360633 PMC9655349 142. Dinsdale N.L. Crespi B.J. Endometriosis and polycystic ovary syndrome are diametric disorders Evol. Appl. 2021 14 1693 1715 10.1111/eva.13244 34295358 PMC8288001 143. Chaudhury K. Babu K.N. Singh A.K. Das S. Kumar A. Seal S. Mitigation of endometriosis using regenerative cerium oxide nanoparticles Nanomedicine 2013 9 439 448 10.1016/j.nano.2012.08.001 22960424 144. Spivak N.Y.A. Shepel E.A. Zholobak N.M. Shcherbakov A.B. Antonovitch G.V. Yanchiy R.I. Ivanov V.K. Tretyakov Y.D. Ceria nanoparticles boost activity of aged murine oocytes Nano Biomed. Eng. 2012 4 188 194 10.5101/nbe.v4i4.p188-194 145. Ariu F. Bogliolo L. Pinna A. Malfatti L. Innocenzi P. Falchi L. Bebbere D. Ledda S. Cerium oxide nanoparticles (CeO 2 Reprod. Fertil. Dev. 2017 29 1046 1056 10.1071/RD15521 28442051 146. El-Beltagy A.E.B.M. Bakr S.M. Mekhaimer S.S.G. Ghanem N.F. Attaallah A. Zinc nanoparticles alleviate the ovarian damage induced by bacterial lipopolysaccharide (LPS) in pregnant rats and their fetuses Histochem. Cell Biol. 2023 160 453 475 10.1007/s00418-023-02222-4 37495867 PMC10624724 147. Nejadali Chaleshtari S. Amini E. Baniasadi F. Tavana S. Ghalamboran M. Oocyte maturation, fertilization, and embryo development in vitro by green and chemical iron oxide nanoparticles: A comparative study Sci. Rep. 2024 14 14157 Erratum in Sci. Rep. 2024 14 38898126 10.1038/s41598-024-65121-1 PMC11187103 148. Xi H. Huang L. Qiu L. Li S. Yan Y. Ding Y. Zhu Y. Wu F. Shi X. Zhao J. Enhancing oocyte in vitro maturation and quality by melatonin/bilirubin cationic nanoparticles: A promising strategy for assisted reproduction techniques Int. J. Pharm. X 2024 8 100268 10.1016/j.ijpx.2024.100268 39070171 PMC11278021 149. Li W.J. Zhou X.L. Liu B.L. Dai J.J. Song P. Teng Y. Effect of nanoparticles on the survival and development of vitrified porcine GV oocytes Cryo Lett. 2017 37 401 405 28072426 150. Hai G. Bai J. Liu Y. Li J. Liu A. Wang J. Liu Q. Liu W. Wan P. Fu X. Superior performance of biocomposite nanoparticles PLGA-RES in protecting oocytes against vitrification stimuli Front. Bioeng. Biotechnol. 2024 12 1376205 10.3389/fbioe.2024.1376205 38529403 PMC10961424 151. Hou C.C. Zhu J.Q. Nanoparticles and female reproductive system: How do nanoparticles affect oogenesis and embryonic development Oncotarget 2017 8 109799 109817 10.18632/oncotarget.19087 29312650 PMC5752563 152. Preaubert L. Courbiere B. Achard V. Tassistro V. Greco F. Orsiere T. Bottero J.Y. Rose J. Auffan M. Perrin J. Cerium dioxide nanoparticles affect in vitro fertilization in mice Nanotoxicology 2016 10 111 117 26001187 10.3109/17435390.2015.1030792 153. Zhang C. Zhai S. Wu L. Bai Y. Jia J. Zhang Y. Zhang B. Yan B. Induction of size-dependent breakdown of blood-milk barrier in lactating mice by TiO 2 PLoS ONE 2015 10 e0122591 10.1371/journal.pone.0122591 25849145 PMC4388820 154. Gao G. Ze Y. Li B. Zhao X. Zhang T. Sheng L. Hu R. Gui S. Sang X. Sun Q. Ovarian dysfunction and gene-expressed characteristics of female mice caused by long-term exposure to titanium dioxide nanoparticles J. Hazard. Mater. 2012 243 19 27 10.1016/j.jhazmat.2012.08.049 23131501 155. Karimipour M. Zirak Javanmard M. Ahmadi A. Jafari A. Oral administration of titanium dioxide nanoparticle through ovarian tissue alterations impairs mice embryonic development Int. J. Reprod. Biomed. 2018 16 397 404 10.29252/ijrm.16.6.397 30123868 PMC6079309 156. Cordiano R. Di Gioacchino M. Mangifesta R. Panzera C. Gangemi S. Minciullo P.L. Malondialdehyde as a potential oxidative stress marker for allergy-oriented diseases: An update Molecules 2023 28 5979 10.3390/molecules28165979 37630231 PMC10457993 157. Liu W. Liu H. Zhang S. Hao H. Meng F. Ma W. Guo Z. Jiang S. Shang X. Silica nanoparticles cause ovarian dysfunction and fertility decrease in mice via oxidative stress-activated autophagy and apoptosis Ecotoxicol. Environ. Saf. 2024 285 117049 10.1016/j.ecoenv.2024.117049 39303637 158. Zhang M. Wang W. Zhang D. Zhang Y. Yang Z. Li Y. Fang F. Xue Y. Zhang Y. Copper oxide nanoparticles impairs oocyte meiosis maturation by inducing mitochondrial dysfunction and oxidative stress Food Chem. Toxicol. 2024 185 114441 10.1016/j.fct.2024.114441 38218586 159. Miu B.A. Dinischiotu A. New green approaches in nanoparticles synthesis: An overview Molecules 2022 27 6472 10.3390/molecules27196472 36235008 PMC9573382 160. Zhu Q. Sun J. An C. Li X. Xu S. He Y. Zhang X. Liu L. Hu K. Liang M. Mechanism of LncRNA Gm2044 in germ cell development Front. Cell Dev. Biol. 2024 12 1410914 39027044 10.3389/fcell.2024.1410914 PMC11255455 161. Han L. Xu S. Zhou D. Chen R. Ding Y. Zhang M. Bao M. He B. Li S. Unveiling the causal link between metabolic factors and ovarian cancer risk using Mendelian randomization analysis Front. Endocrinol. 2024 15 1401648 10.3389/fendo.2024.1401648 PMC11185996 38899007 162. Pang J. Ding N. Liu X. He X. Zhou W. Xie H. Feng J. Li Y. He Y. Wang S. Prognostic value of the baseline systemic immune-inflammation index in HER2-positive metastatic breast cancer: Exploratory analysis of two prospective trials Ann. Surg. Oncol. 2025 32 750 759 10.1245/s10434-024-16454-8 39565489 163. Zhou J. Guo Z. Peng X. Wu B. Meng Q. Lu X. Feng L. Guo T. Chrysotoxine regulates ferroptosis and the PI3K/AKT/mTOR pathway to prevent cervical cancer J. Ethnopharmacol. 2025 338 119126 10.1016/j.jep.2024.119126 39557107 164. Lin Q. Ma W. Xu M. Xu Z. Wang J. Liang Z. Zhu L. Wu M. Luo J. Liu H. A clinical prognostic model related to T cells based on machine learning for predicting the prognosis and immune response of ovarian cancer Heliyon 2024 10 36898 10.1016/j.heliyon.2024.e36898 39296051 PMC11409031 165. Li H. Zang W. Mi Z. Li J. Wang L. Xie D. Zhao L. Wang D. Tailoring carrier-free nanocombo of small-molecule prodrug for combinational cancer therapy J. Control Release 2022 352 256 275 10.1016/j.jconrel.2022.10.022 36272660 Figure 1 Causes and consequences of oxidative stress. Oxidative stress can be induced by endogenous and exogenous causes. Both lead to the generation of molecules containing oxygens with an unpaired electron. This characteristic makes them able to oxidize other biological molecules, leading to disruption of their function. Biological organisms have developed physiological mechanisms to control this phenomenon; these mechanisms involve enzymes such as SOD and GPx and molecules like vitamins E and C. The balance between these processes is fundamental to avoiding cellular toxicity. Glutathione peroxidase (GPX), Superoxide dismutase (SOD), Glutathione (GSH), Glutathione disulfide (GSSG) (picture designed with Pixabay). Figure 2 The main features of OC and the benefits of NMs. The use of NMs is gaining attention in treating OC. Thanks to antibodies, NMs can specifically target malignant cells, releasing anti-cancer drugs specifically in those cells. Moreover, NMs can be used as vectors for antioxidant compounds that are useful in reducing tumor progression (picture designed with Pixabay). Figure 3 Female infertility causes. The presence of pathological conditions can increase the probability of infertility. Endometriosis, cysts, infections, environmental pollution, and health conditions are just some of many relevant factors (picture designed with Pixabay). antioxidants-14-01066-t001_Table 1 Table 1 Biomedical applications of the most frequently used NMs. Nanomaterial Biomedical Applications Ref. Organic Liposomes Drug carrier, fungal and bacterial infections, vaccine formulations, ischemia treatment [ 43 44 45 46 47 Dendrimers Antimicrobial and antiviral effects, encapsulation and covalent binding of compounds, tissue engineering, imaging [ 48 49 50 51 52 53 Carbon-Based Gene therapy, biosensor, imaging, tissue engineering [ 54 55 56 57 PLGA/PLA Imaging, drug delivery [ 58 59 Protein/Peptide-Based Target therapy, cancer therapy [ 60 61 62 Hydrogels Anti-inflammatory, tissue regeneration, anti-infection [ 63 64 65 PEG Drug and Gene delivery [ 66 Polysaccharide Drug and Gene delivery, anti-inflammatory, imaging, theranostic medicine [ 67 68 69 70 Micelles Cosmetics, drug delivery [ 71 72 Cyclodextrin-Based Imaging, anti-cancer drug delivery [ 73 Solid Lipid/Nanostructured Lipid Drug loading, diagnostics, RNA delivery, cancer therapies [ 74 75 DNA Nanoparticles Imaging, drug delivery [ 76 Inorganic Gold (Au) Biosensor, phototherapy, drug delivery [ 77 78 79 Silver (Ag) Antiviral, antifungal, antiparasitic, antifouling, wound healing, cancer treatment, drug delivery, dentistry [ 80 81 82 83 84 85 86 87 Zinc (Zn) Imaging, drug delivery, diagnostics [ 88 89 90 Ceria (Ce) Antioxidant, anti-inflammatory, antiviral [ 91 92 93 Titanium (Ti) Antibacterial, cosmetics [ 94 95 Quantum Dots (QD) Imaging, drug carrier [ 96 97 Mesoporous Silica NMs Drug delivery, imaging, theranostics, tissue engineering, gene therapy [ 98 ",
  "metadata": {
    "Title of this paper": "Tailoring carrier-free nanocombo of small-molecule prodrug for combinational cancer therapy",
    "Journal it was published in:": "Antioxidants",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12466870/"
  }
}