{
  "title": "Paper_806",
  "abstract": "pmc Endocr Connect Endocr Connect 2122 endoconn EC Endocrine Connections 2049-3614 Bioscientifica Ltd. PMC12464338 PMC12464338.1 12464338 12464338 40919707 10.1530/EC-25-0411 EC-25-0411 1 Research EC-Neuroendocrinology Neuroendocrinology Long-term outcomes and survival predictors in patients with ectopic ACTH syndrome: data from a retrospective cohort study https://orcid.org/0000-0002-6674-6441 Belaya Zhanna  1 https://orcid.org/0000-0001-7041-0732 Rozhinskaya Liudmila  1 Golounina Olga  1 https://orcid.org/0000-0002-4564-2168 Solodovnikov Alexander  2 Marova Evgeniya  1 Arapova Svetlana  1 Pikunov Michail  3 Markovich Alla  4 Mamedova Elizaveta  1 Przhialkovskaya Elena  1 Pigarova Ekaterina  1 Fadeev Valentin  5 Kuznetsov Nikolay  1 Sitkin Ivan  1 Dzeranova Larisa  1 https://orcid.org/0000-0002-9314-7831 Lutsenko Alexander  1 https://orcid.org/0000-0003-2604-8347 Mokrysheva Natalia  1 Dedov Ivan  1 Melnichenko Galina  1 1 Endocrinology Research Centre Moscow Russia 2 Peoples’ Friendship University of Russia Named After Patrice Lumumba Moscow Russia 3 National Medical Research Center of Surgery Named After A. V. Vishnevsky Moscow Russia 4 National Medical Research Center of Oncology Named After N. N. Blokhin Moscow Russia 5 I.M. Sechenov First Moscow State Medical University (Sechenov University) Moscow Russia Correspondence should be addressed to Z Belaya: jannabelaya@gmail.com 22 9 2025 08 9 2025 9 2025 14 9 496342 e250411 14 7 2025 08 8 2025 05 9 2025 22 09 2025 27 09 2025 27 09 2025 © the author(s) 2025 the author(s) https://creativecommons.org/licenses/by/4.0/ Creative Commons Attribution 4.0 International License. Background Ectopic ACTH syndrome (EAS) is caused by non-pituitary neuroendocrine tumor (NET) that produces adrenocorticotropic hormone (ACTH). Objective To identify survival predictors and to analyze long-term outcomes in patients with EAS. Methods Medical records of patients with verified EAS between 1990 and 2024 were analyzed to obtain the initial clinical and biochemical data along with subsequent interventions and survival outcomes. Results The study included 173 patients (107 women and 66 men), with a median (Q25–Q75) age of 42 years (29; 55). The median follow-up period was 54 months (16; 99) with a maximum of 402 months. Over the observation period, death was registered in 50 (28.9%) cases. The overall 3- and 5-year survival rates were 77 and 70%, respectively. Multivariable analysis revealed the following negative predictive factors for survival: age at diagnosis ≥51 years (hazard ratio (HR) 3.53; 95% confidence interval (CI): 1.67–7.5; P P P P Conclusion Active hypercortisolism, high LNSC, distant metastases and older age at diagnosis are factors associated with mortality in EAS. As severity of hypercortisolism is the main targetable factors, it should be the focus of intervention and further studies aimed at improving outcomes. Keywords ectopic ACTH syndrome neuroendocrine tumor hypercortisolism survival analyses mortality Russian Science Foundation https://doi.org/10.13039/501100006769 24-15-00283 pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement yes pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes ifp:collection EC-Neuroendocrinology Introduction Ectopic ACTH syndrome (EAS) is a paraneoplastic syndrome caused by non-pituitary neuroendocrine tumors (NETs) that produce adrenocorticotropic hormone (ACTH). EAS represents 10–20% of ACTH-dependent Cushing’s syndrome (CS) with an incidence of 0.2–1.0 per million ( 1 2 3 4 3 5 6 7 8 9 10 11 In a large cohort of gastroenteropancreatic and thoracic NETs ( n 12 13 14 13 15 3 16 The purpose of our study is to identify survival predictors and to analyze long-term outcomes in a Russian cohort of patients with EAS. Materials and methods We obtained medical records between 1990 and May 2024 and made contact with patients to analyze outcomes. All patients were initially referred from different regions of Russia due to suspected EAS. First diagnostic evaluations were performed at local clinics to establish ACTH-dependent hypercortisolism and to differentiate CD and EAS using various tests, including pituitary MRI and 8 mg dexamethasone suppression test. Diagnostic evaluation was repeated in our hospital, which is the leading referral center in Russia for bilateral inferior petrosal sinus sampling (BIPSS). The diagnosis of ACTH-dependent endogenous hypercortisolism was based on the following laboratory tests: increased 24 h urinary free cortisol (24 h UFC) levels and late night salivary cortisol (LNSC) and/or increased serum cortisol levels at 23:00 and/or unsuppressed serum cortisol after 1 mg overnight dexamethasone suppression test (cut-off point 50 nmol/L) along with non-suppressed morning ACTH levels. Plasma ACTH (reference range: morning 7.2–63.3 pg/mL, late-night 2–25.5 pg/mL), late-night serum cortisol (64–327 nmol/L) and LNSC (0.5–9.6 nmol/L) levels ( 17 BIPSS with a stimulating agent (desmopressin acetate 8 μg) was used to differentiate within ACTH-dependent hypercortisolism. EAS was established when the central-to-peripheral ACTH ratio was below 2 before stimulation and below 3 after stimulation ( 18 19 20 21 22 18 23 In all cases of reported occult NET, EAS was established based on BIPSS with prolactin central-to-peripheral ratio above 2 along with ACTH central-to-peripheral ratio below 2 before and after stimulation. In some patients, metastasis was diagnosed without primary tumor localization; these cases were also classified as occult tumor. Various imaging techniques, such as cervical–thoracic–abdominal and pelvic spiral thin-slice computed tomography (CT), Octreoscan with 111 99m 68 24 25 26 Histological analyses were obtained from medical records. NET proliferative activity was determined by Ki-67 index and mitotic active areas in TEN high power fields. ACTH production was confirmed immunohistochemically as ACTH expression in the tumor cells. The causes of death were obtained from death certificates. Statistical analysis Continuous variables are reported as the mean ± standard deviation or median with interquartile range (IQR), including minimum and maximum values. Categorical variables are shown as percentages. Fischer’s exact test was employed for comparisons between categorical variables, whereas continuous variables were compared using the Mann–Whitney test. χ 2 For univariate analysis, the log rank test identified statistically significant differences between strata (deceased vs alive), while univariate Cox proportional hazard regression calculated hazard ratios (HRs) and constructed 95% confidence intervals (CIs). In multivariable analysis, variables with a P P Statistical analyses were conducted using R version 4.3.3 ( https://www.r-project.org/ Ethics statement The study was approved by the Local Ethics Committee of the Endocrinology Research Centre (approval number 12). Study was performed in accordance with the ethical standards of 1964 Declaration of Helsinki and its later amendments. All subjects signed written informed consent for depersonalized medical data usage for research purposes. For patients diagnosed in childhood, written informed consent was obtained from the participants’ parent/legal guardian and/or from them as all patients diagnosed at 17 were enrolled into study in adulthood. Results Patient characteristics One hundred and seventy-three patients (107 women and 66 men) were included in the study. The median follow-up period was 54 months (16; 99.5) with a maximum follow-up period of 402 months. Age at the time of diagnosis ranged from 12 to 76 years (median 42 years (29; 55)). Endogenous hypercortisolism diagnosis was based on the elevated 24 h UFC levels: median (Me) – 3,011 nmol/24 h (1,778–6,700) with maximum 15,820 nmol/24 h; LNSC – 87.2 nmol/L (45.5–175.6) with maximum 687 nmol/L; morning ACTH – 143 pg/mL (104–206); and late-night ACTH – 119.8 pg/mL (91–179). Fifteen patients (8.7%) had cyclic CS. The general characteristics of patients with various localizations of ACTH-producing NETs are summarized in Table 1 n n Supplementary materials Table 1 General characteristics of patients with ACTH-producing tumors of various localizations. Tumor localization Total number of cases Mean age at diagnosis, years Follow-up period, months Surgery: number of curative cases/debulking Distant metastases Number of deaths (% from total cases) Gender (male/female) Me [Q1; Q3] (min; max) Bronchial NET 107 42 ± 15 Me 61 [20; 114] (1; 402) 76/14 18 22 (20.5%) * 46/61 Thymic NET 18 31 ± 12 Me 64.5 [33; 77] (2; 144) 2/14 13 11 (61%) 7/11 Pheochromocytoma 6 47 ± 11 (24; 144) 6/0 0 0 (0%) 1/5 Pancreatic NET 10 42 ± 17 Me 17.5 [5.3; 57.5] (2; 162) 2/1 6 5 (50%) 0/10 Cecum NET 1 53 16 0/1 1 1 (100%) 0/1 Appendix NET 1 20 165 1/0 1 0 (0%) 0/1 Medullary thyroid carcinoma 1 40 12 0/1 1 1 (100%) 0/1 Renal NET 3 57, 65 and 65 5, 27, 69 3/0 0 0 (0%) 0/3 Occult tumor 26 50 ± 17 Me 38 [11; 57] (1; 134) - 4 10 (38%) 12/14 NET, neuroendocrine tumor. * 5 Cases unknown. The most common complications of active hypercortisolism were arterial hypertension ( n n n n Surgical treatment of neuroendocrine tumors and adrenalectomy The primary NET was removed in 121 patients (69.9%). Surgical treatment led to remission of hypercortisolism in 74.4% of cases. Among the most common lung NETs, typical carcinoid was diagnosed in 69 cases (Ki-67 1.6 (1.0–2.8), atypical carcinoid in 20 cases (Ki-67 9.8 (6.2–11.0) and diffuse idiopathic pulmonary neuroendocrine cell hyperplasia (DIPNECH) in one case. No other lung cancers were recorded. Bilateral adrenalectomy was performed in 47 patients (27.2%): 32 patients underwent the procedure due to life-threatening hypercortisolism, before primary tumor was localized, and in 15 cases, bilateral adrenalectomy was performed due to inoperable disease recurrence. Regional and distant metastases were found in 44 patients (25.4%). Medical treatment of EAS Seventy-five patients (43.4%) required medications to control CS and NET. Forty-three patients were treated with long-acting somatostatin analogs (SSAs): octreotide 20–80 mg ( n n In 28 cases, inhibitors of steroidogenesis were prescribed: ketoconazole 400–800 mg/day in 27 cases and osilodrostat 10 mg/day in one case. One patient received mifepristone 300 mg/day. Twelve patients received combined treatment of both somatostatin analogs and inhibitors of steroidogenesis. Six patients received everolimus. Sixteen patients required chemotherapy (EP, Tem/Cap, mGEMOX, aranosa + bevacizumab, and PRPT in one case). Eight patients underwent non-specific radiation therapy and in one case Lutetium-peptide receptor radionuclide therapy was performed. Survival predictors and outcomes Of the 173 enrolled patients, 50 (28.9%) deaths were confirmed. Five patients were lost to follow-up. Thirty-one patients died with active hypercortisolism and three died after surgery due to complications. The primary cause of death was multiple organ failure ( n n n n n n n n The mean time between diagnosis and death was 33 months (Me −16 months (4.8; 55)). The 3- and 5-year overall survival rates were 77 and 70%, respectively. A comparison of demographic and clinical data between survivors and deceased patients with EAS is presented in Table 2 Table 2 Characteristics of surviving and deceased patients with ectopic ACTH syndrome. Survived Died P Parameter n n Male/female 47/71 15/35 0.294 Age at the time of diagnosis, years 39 (27; 53) 52 (36; 60) 0.003 Body mass index 28 (24; 32) 27 (24; 31) 0.920 Ki-67 index, % 3.0 (1.5; 7.2) 10.0 (2.9; 19) 0.008 Metastases Yes 14 (11.9%) 30 (60%) <0.001 No 104 (88.1%) 20 (40%)  Complications in the active hypercortisolism Arterial hypertension Yes 99 (83.9%) 43 (86.0%) 0.819 No 19 (16.1%) 7 (14.0%) Cardiovascular disease Yes 55 (46.6%) 36 (72.0%) 0.004 No 63 (53.4%) 14 (28.0%) Diabetes mellitus Yes 63 (53.4%) 32 (64.0%) 0.236 No 55 (46.6%) 18 (36.0%) Osteoporosis No osteoporosis 51 (43.2%) 20 (40.0%) 0.668 Osteoporosis without low-energy fractures 52 (44.1%) 21 (42.0%) Osteoporosis with low-energy fractures 15 (12.7%) 9 (18.0%)  Laboratory examinations at the time of diagnosis Morning ACTH, pg/mL 133 (100; 186) 195 (137; 292) <0.001 Late-night ACTH, pg/mL 113 (79; 161) 148 (110; 258) 0.001 Late-night salivary cortisol, nmol/L 74 (42; 127) 185 (76; 456) <0.001 24 h urinary free cortisol, nmol/24 h 2,778 (1,732; 5,501) 4,639 (2,640; 7,723) 0.004 Late-night serum cortisol, nmol/L 1,106 (833; 1,390) 1,243 (1,062; 1,587) 0.012 NET, neuroendocrine tumor; ACTH, adrenocorticotropic hormone; data presented as the median and interquartile range (Q25–Q75). In a univariate analysis, the negative predictors of survival were aged above 51 at diagnosis, cardiovascular disease, presence of metastasis, active hypercortisolism and high LNSC and/or late-night serum cortisol and/or 24 h urinary free cortisol, and high ACTH levels. Positive predictors of survival in the univariate regression model were bronchial NET localization and successful surgical removal of primary tumor. The overall 3- and 5-year survival rates for bronchial NETs were 85 and 78%, respectively, and for thymic NETs – 71 and 57%, respectively. Patients with occult tumor had significantly worse overall 3- and 5-year survival rates − 58%. There were no statistically significant differences in other potential prognostic factors, such as gender, bilateral adrenalectomy, cyclic course of EAS or any typical complications of hypercortisolism – arterial hypertension, diabetes mellitus or osteoporosis with fragility fractures. The results of univariate analysis of survival predictors are presented in Table 3 Table 3 Univariable analysis of survival predictors in patients with ectopic ACTH syndrome. Variable HR (95% CI) P Gender (male) 0.653 (0.356–1.196) 0.167 Age at time of diagnosis (≥51 years) 2.749 (1.570–4.816) <0.001 NET localization (bronchial NET vs all others) 0.442 (0.234–0.838) 0.012 Presence of metastasis 4.295 (2.448–7.538) <0.001 Cyclic course of disease 0.386 (0.094–1.589) 0.187 Successful surgical removal of primary tumor 0.204 (0.115–0.362) <0.001 Bilateral adrenalectomy 1.148 (0.638–2.064) 0.645 Active hypercortisolism 7.070 (3.302–15.139) <0.001 Presence of arterial hypertension 1.239 (0.557–2.759) 0.599 Presence of cardiovascular disease 2.525 (1.362–4.684) 0.003 Presence of diabetes mellitus 1.715 (0.960–3.063) 0.068 Presence of osteoporosis with fractures 1.195 (0.543–2.627) 0.658 24 hour urinary free cortisol (≥4,564 nmol/24 h or 14-fold increase above reference range) 2.283 (1.277–4.082) 0.005 Late-night serum cortisol (≥1,150 nmol/L or 3.5-fold increase above the reference range) 1.889 (1.045–3.416) 0.035 Late-night salivary cortisol (≥130 nmol/L or 14 times above the upper limit of reference range) 5.440 (2.595–11.404) <0.001 Morning plasma ACTH (≥145 pg/mL) 3.292 (1.741–6.226) <0.001 Late-night plasma ACTH (≥128 pg/mL) 2.208 (1.217–4.005) 0.009 NET, neuroendocrine tumor; ACTH, adrenocorticotropic hormone, HR, hazard ratio; CI, confidence interval. Statistically significant predictive factors of survival were incorporated into the multivariate Cox regression analysis with a stepwise approach that showed four variables that were significantly ( P Table 4 Fig. 1 Fig. 2 P Fig. 3 Table 4 Multivariable Cox regression analysis (stepwise approach) of survival predictors among patients with EAS. Variable HR (95% CI) P Presence of metastases 2.93 (1.35–6.32) 0.006 Active hypercortisolism 5.58 (1.62–19.24) 0.006 Age at the time of diagnosis ≥51 3.53 (1.67–7.50) 0.001 Late-night salivary cortisol ≥130 nmol/L 2.81 (1.30–6.07) 0.009 HR, hazard ratio; CI, confidence interval. Figure 1 Overall survival by patient age upon diagnosis. Survival probabilities were estimated employing the Kaplan–Meier method. Survival curves were compared employing the log-rank test. Figure 2 Overall survival by the presence of metastases. Survival probabilities were estimated using the Kaplan–Meier method. Survival curves were compared employing the log-rank test. Figure 3 Overall survival by active hypercortisolism and late-night salivary cortisol levels. (A) Hypercortisolism and (B) late-night salivary cortisol. Survival probabilities were estimated employing the Kaplan–Meier method. Survival curves were compared employing the log-rank test. Discussion We report the outcomes and prognostic factors of survival in 173 Russian patients with EAS, which is, to our knowledge, the largest reported national cohort with the longest observation period. This relatively large-scale study allowed us to perform a multivariate analysis, which revealed that age older than 51 years at the time of diagnosis, presence of metastasis, active hypercortisolism and LNSC above 130 nmol/L are negative predictors of survival. A previously published multicenter study by Davi et al. 16 et al. 16 P In a Finnish cohort of 60 patients observed between 1997 and 2016, negative predictive factors for survival were higher cortisol levels and complications of hypercortisolism, such as hypokalemia, infection and diabetes ( 3 25 Several previous studies have described the relationship between the presence of distant metastases and a poor prognosis for patients with EAS ( 12 27 12 16 27 According to the literature, bronchial carcinoid is the most common cause of EAS ( 23 27 28 18 27 et al. 10 In severe hypercortisolism caused by EAS, bilateral adrenalectomy may be considered if medical control of hypercortisolism fails ( 13 29 16 Although this study evaluates, to our knowledge, the largest national cohort of patients with EAS over 34 years of observation, we acknowledge the retrospective design of the study, with all the limitations associated with these designs, including data omission, changes in patient management over time, and changes in tumor classifications, which may have influenced outcomes. In 26 cases of occult tumors, diagnosis was based on BIPSS with desmopressin stimulation. Nevertheless, BIPSS is currently reported as the most accurate test to differentiate EAS from CD ( 30 17 In conclusion, the negative factors associated with higher mortality in EAS are active hypercortisolism, high LNSC, presence of metastases and older age at diagnosis. As the severity of hypercortisolism is the main targetable factor, this should be the focus of intervention and further studies to improve patient outcomes. Supplementary materials Declaration of interest The authors declare that the work was conducted in the absence of any commercial or financial relationships that could be construed as a potential conflict of interest. Funding This work was supported by the Russian Science Foundation https://doi.org/10.13039/501100006769 References 1 Lacroix A Feelders RA Stratakis CA et al. Cushing syndrome Lancet 2015 386 913 927 10.1016/S0140-6736(14)61375-1 26004339 2 Feelders R Sharma S Nieman L Cushing syndrome: epidemiology and developments in disease management Clin Epidemiol 2015 7 281 10.2147/CLEP.S44336 25945066 PMC4407747 3 Toivanen S Leijon H Arola A et al. Characteristics and outcomes of the finnish ectopic ACTH syndrome cohort Endocrine 2021 74 387 395 10.1007/s12020-021-02768-0 34036515 4 Brown WH A case of pluriglandular syndrome: “diabetes of bearded women.” Lancet 1928 212 1022 1023 10.1016/S0140-6736(00)84800-X 5 Ma Y Aitelli C Dobson RW et al. Ectopic adrenocorticotropic hormone syndrome: a diagnostic challenge and review of the literature Baylor Univ Med Cent Proc 2010 23 426 428 10.1080/08998280.2010.11928663 PMC2943458 21240327 6 Elliott PF Berhane T Ragnarsson O et al. Ectopic ACTH- and/or CRH-producing pheochromocytomas J Clin Endocrinol Metab 2021 106 598 608 10.1210/clinem/dgaa488 32710791 7 Paleń-Tytko JE Przybylik-Mazurek EM Rzepka EJ et al. Ectopic ACTH syndrome of different origin – diagnostic approach and clinical outcome. Experience of one Clinical Centre PLoS One 2020 15 e0242679 10.1371/journal.pone.0242679 33237923 PMC7688153 8 Liddle GW Nicholson WE Island DP et al Clinical and laboratory studies of ectopic humoral syndromes Recent Prog Horm Res 1969 25 283 314 10.1016/b978-0-12-571125-8.50009-0 4310919 9 Aniszewski JP Young WF Thompson GB et al. Cushing syndrome doe to ectopic adrenocorticotropic hormone secretion World J Surg 2001 25 934 940 10.1007/s00268-001-0032-5 11572035 10 Ilias I Torpy DJ Pacak K et al. Cushing syndrome due to ectopic corticotropin secretion: twenty years’ experience at the national institutes of health J Clin Endocrinol Metab 2005 90 4955 4962 10.1210/jc.2004-2527 15914534 11 Golounina OO Belaya ZE Rozhinskaya LY et al. Clinical and laboratory characteristics and results of treatment of patients with ACTH-producing neuroendocrine tumours of various localization Ter Arkh 2021 93 1171 1178 10.26442/00403660.2021.10.201102 36286818 12 Kamp K Alwani RA Korpershoek E et al. Prevalence and clinical features of the ectopic ACTH syndrome in patients with gastroenteropancreatic and thoracic neuroendocrine tumours Eur J Endocrinol 2016 174 271 280 10.1530/EJE-15-0968 26643855 13 Young J Haissaguerre M Viera-Pinto O et al. Management of endocrine disease: Cushing syndrome due to ectopic ACTH secretion: an expert operational opinion Eur J Endocrinol 2020 182 R29 R58 10.1530/EJE-19-0877 31999619 14 Golounina OO Belaya ZE Rozhinskaya LY et al. Survival predictors in patients with ectopic acth syndrome Probl Endocrinol 2022 68 30 42 10.14341/probl13144 PMC9939959 36689709 15 Belaya ZE Rozhinskaya LY Dragunova NV et al. Metabolic complications of endogenous Cushing: patient selection for screening Obe Metab 2013 10 26 31 10.14341/2071-8713-5068 16 Davi’ MV Cosaro E Piacentini S et al. Prognostic factors in ectopic Cushing syndrome due to neuroendocrine tumours: a multicenter study Eur J Endocrinol 2017 176 453 461 10.1530/EJE-16-0809 28183788 17 Belaya ZE Iljin AV Melnichenko GA et al. Diagnostic performance of late-night salivary cortisol measured by automated electrochemiluminescence immunoassay in obese and overweight patients referred to exclude Cushing's syndrome Endocrine 2012 41 494 500 10.1007/s12020-012-9658-3 22447310 18 Dedov II Belaya ZE Sitkin II et al. [Significance of the method of selective blood collection from the inferior petrosal sinuses for differential diagnosis of ACTH-dependent hypercorticism] Probl Endokrinol 2009 55 35 40 10.14341/probl200955635-40 31569889 19 Belaya ZE Golounina OO Sitkin II et al. Diagnostic value of bilateral inferior petrosal sinus sampling in various modifications and methods of radiation and radionuclide imaging in the diagnosis and differential diagnosis of ACTH-dependent endogenous hypercortisolism Probl Endocrinol 2024 69 4 16 10.14341/probl13299 PMC10848181 38311990 20 Raff H Carroll T Cushing syndrome: from physiological principles to diagnosis and clinical care J Physiol 2015 593 493 506 10.1113/jphysiol.2014.282871 25480800 PMC4324701 21 de Almeida TS Rodrigues TDC Costenaro F et al. Enhancing Cushing disease diagnosis: exploring the impact of desmopressin on ACTH gradient during BIPSS Front Endocrinol 2023 14 1224001 10.3389/fendo.2023.1224001 PMC10436086 37600715 22 Gadelha M Wildemberg LE Alternative approach to BIPSS in the differential diagnosis of ACTH-dependent Cushing syndrome J Clin Endocrinol Metab 2024 109 e1460 e1461 10.1210/clinem/dgad676 37995302 23 Sharma ST Raff H Nieman LK Prolactin as a marker of successful catheterization during IPSS in patients with ACTH-dependent Cushing syndrome J Clin Endocrinol Metab 2011 96 3687 3694 10.1210/jc.2011-2149 22031511 PMC3232627 24 Sathyakumar S Paul TV Asha HS et al. Ectopic Cushing syndrome: a 10-year experience from a tertiary care center in Southern India Endocr Pract 2017 23 907 914 10.4158/EP161677.OR 28614007 25 Pikunov MY Pechetov AA Golounina OO et al. Features of preparation and surgical aspects of treatment of patients with ACTH-producing neuroendocrine lung tumours Endocr Surg 2022 15 4 12 10.14341/serg12721 26 Ceccato F Cecchin D Gregianin M et al. The role of 68Ga-DOTA derivatives PET-CT in patients with ectopic ACTH syndrome Endocr Connect 2020 9 337 345 10.1530/EC-20-0089 32213660 PMC7219142 27 Isidori AM Kaltsas GA Pozza C et al. The ectopic adrenocorticotropin syndrome: clinical features, diagnosis, management, and long-term follow-up J Clin Endocrinol Metab 2006 91 371 377 10.1210/jc.2005-1542 16303835 28 Lococo F Margaritora S Cardillo G et al. Bronchopulmonary carcinoids causing Cushing syndrome: results from a multicentric study suggesting a more aggressive behavior Thorac Cardiovasc Surg 2015 64 172 181 10.1055/s-0035-1555125 26220696 29 Pikunov MY Pechetov AA Golounina OO et al Features of preparation and surgical aspects of treatment of patients with ACTH-producing neuroendocrine lung tumors Endocr Surg 2021 15 2 4 12 10.14341/serg12721 30 Fleseriu M Auchus R Bancos I et al. Consensus on diagnosis and management of Cushing disease: a guideline update Lancet Diabetes Endocrinol 2021 9 847 875 10.1016/S2213-8587(21)00235-7 34687601 PMC8743006 ",
  "metadata": {
    "Title of this paper": "Consensus on diagnosis and management of Cushing disease: a guideline update",
    "Journal it was published in:": "Endocrine Connections",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12464338/"
  }
}