{
  "title": "Paper_822",
  "abstract": "pmc Obstet Gynecol Sci Obstet Gynecol Sci 2215 ogs Obstetrics & Gynecology Science 2287-8572 2287-8580 Korean Society of Obstetrics and Gynecology PMC12463482 PMC12463482.1 12463482 12463482 40760967 10.5468/ogs.25088 ogs-25088 1 Original Article Gynecologic Oncology A knowledge, attitudes, and practices study on BRCA Prasertpakdi Sopita MD http://orcid.org/0000-0002-0205-2280 Suprasert Prapaporn MD Division of Gynecologic Oncology, Department of Obstetrics and Gynecology, Faculty of Medicine, Chiang Mai University, Chiang Mai, Thailand Corresponding author: Prapaporn Suprasert, MD, Division of Gynecologic Oncology, Department of Obstetrics and Gynecology, Faculty of Medicine, Chiang Mai University, Chiang Mai 50200, Thailand, E-mail: psuprase@gmail.com 9 2025 5 8 2025 68 5 497534 390 400 12 4 2025 27 5 2025 29 6 2025 01 09 2025 26 09 2025 26 09 2025 Copyright © 2025 Korean Society of Obstetrics and Gynecology 2025 https://creativecommons.org/licenses/by-nc/3.0/ Articles published in Obstet Gynecol Sci are open-access, distributed under the terms of the Creative Commons Attribution Non-Commercial License ( http://creativecommons.org/licenses/by-nc/3.0/ Objective BReast CAncer ( BRCA BRCA Methods A cross-sectional survey was conducted between March and November 2024, involving 215 participants with a family history of epithelial ovarian or fallopian tube cancer. Data were collected through structured interviews. Results The mean age of participants was 47.3 years; 42.8% were single and 44.2% were nulliparous. Most participants (65.6%) had one affected relative, with 86.5% being first-degree relatives. Only 16.3% had heard of BRCA BRCA P P P Conclusion Substantial gaps in KAP regarding BRCA BRCA1 BRCA2 Mutation Ovarian cancer Family member pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement no pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes Introduction Epithelial ovarian and fallopian tube cancers are among the most significant gynecologic malignancies owing to their high mortality rates. Most individuals present with advanced-stage disease, which poses significant challenges to curative treatment. The global incidence of epithelial ovarian and fallopian tube cancers ranges from nine to 17 cases per 100,000 individuals, with a higher prevalence observed in high-income regions, particularly in Eastern Europe and Asia [ 1 2 Approximately 25% of epithelial ovarian and fallopian tube cancers are associated with hereditary factors, most notably, pathogenic mutations in the BReast CAncer gene ( BRCA 1 BRCA2 3 BRCA1 BRCA2 4 Given these elevated risks, clinical guidelines recommend risk-reducing salpingo-oophorectomy (RRSO) at an appropriate age, typically between 35–40 years for BRCA1 BRCA2 3 7 Recent international guidelines, such as the National Comprehensive Cancer Network (NCCN) genetic/familial high-risk assessment: breast, ovarian, and pancreatic version 3.2025 (Plymouth Meeting, PA, USA), developed by the National Comprehensive Cancer Network, Plymouth Meeting, PA, USA [ 4 5 3 6 3 6 In addition to preventive strategies, individuals with BRCA- 8 Given the hereditary nature of breast, ovarian, fallopian tube, and peritoneal cancers, genetic counseling plays a crucial role not only for affected individuals but also for their at-risk relatives. Regional studies have highlighted the significance of BRCA1/2 9 10 To inform the development of an effective and accessible genetic counseling framework, it is essential to understand the knowledge, attitudes, and practices (KAP) of family members of individuals with epithelial ovarian and fallopian tube cancers. These family members represent a key population for cascade testing, yet their awareness, informational needs, and behavioral readiness remain poorly studied. A KAP assessment provides a critical foundation for identifying knowledge gaps, perceived barriers to testing, and facilitators of risk-reducing behavior, enabling the design of culturally tailored and evidence-informed interventions to support early detection and cancer prevention in high-risk populations. Materials and methods 1. Study population After obtaining approval from the Local Research Ethics Committee (study code: OBG-2567-0046), this cross-sectional study was conducted between March and November 2024. The study included healthy female family members, aged ≥20 years, of patients with epithelial ovarian or fallopian tube cancer who were under surveillance at the Gynecologic Oncology Unit of Chiang Mai University Hospital and were proficient in the Thai language. Individuals with a history of malignancy or prior BRCA Participants who met the inclusion criteria were invited to enroll, and all provided informed consent. Each participant underwent a structured interview conducted by a well-trained medical interviewing team using the KAP questionnaire. These interviews were conducted while participants waited for their relatives to undergo medical check-ups at the outpatient unit. As no validated KAP questionnaire specifically designed for family members of patients with epithelial ovarian or fallopian tube cancer regarding BRCA 11 12 The final questionnaire consisted of five main sections. 1) Demographic data: comprising participants’ age, body mass index (BMI), highest education level, occupation, marital status, and parity; 2) family history of cancer: captured the number of relatives diagnosed with cancer, the nature of their relationship to the participant, and whether the affected relatives had undergone BRCA BRCA BRCA BRCA BRCA BRCA BRCA 2. Psychometric evaluation To assess the measurement properties of the newly developed questionnaire, we evaluated content validity, internal consistency, and structural validity. Although a formal content validity index (CVI) calculation was not performed, content validity was established through expert review. The questionnaire was developed and refined in collaboration with a gynecologic oncologist, a clinical geneticist, and a public health specialist. These experts reviewed each item for clarity, clinical relevance, and alignment with BRCA 3. Sample size calculation The objective of this study is to evaluate the KAP regarding BRCA 12 P 13 4. Statistical analysis Statistical analysis was performed using IBM SPSS Statistics version 22.0 for Windows (IBM, Armonk, NY, USA). Descriptive statistics were presented as mean±standard deviation or median with range, as appropriate. For the psychometric evaluation of the KAP questionnaire, Cronbach’s alpha was calculated to assess internal consistency reliability. EFA was conducted using principal component analysis with varimax rotation to assess structural validity. The KMO test and Bartlett’s test of sphericity were used to determine sampling adequacy and factorability. The chi-square test, Fisher’s exact test, or binary regression analysis was applied to identify factors influencing the desire for ovarian cancer BRCA Results A total of 215 family members were invited to participate in this study. The mean age of participants was 47.3 years, and the mean BMI was 23.2 kg/m 2 BRCA Table 1 Table 2 BRCA BRCA BRCA1 BRCA2 Regarding knowledge of the participants about BRCA BRCA BRCA BRCA Table 3 Assessment of the levels of KAP of the participants related to BRCA BRCA BRCA Table 4 Regarding participants’ practices in response to a relative’s BRCA BRCA BRCA BRCA BRCA We also analyzed factors influencing participants’ desire to undergo screening for ovarian cancer or BRCA BRCA Our analysis identified three independent factors significantly associated with a strong desire for screening. Participants with a KAP sum score of ≥25 (excluding the screening desire item) had an adjusted odds ratio (AOR) of 12.638. Having an affected relative for >5 years (AOR, 2.504) and having a relative who was either undergoing treatment or had no response regarding their current status (AOR, 4.303) were also significant predictors. Detailed results are presented in Table 5 Finally, to ensure the quality and interpretability of the questionnaire data, we examined the psychometric properties of the KAP instrument. The questionnaire demonstrated acceptable psychometric performance. The attitude subscale (eight items) had a Cronbach’s alpha of 0.77, indicating good internal consistency. The practice subscale (two items: P4 and P5) showed a corrected inter-item correlation of 0.622, with a Spearman-Brown-adjusted Cronbach’s alpha of 0.77. EFA supported a two-factor structure corresponding to the attitude and practice domains. The KMO measure of sampling adequacy was 0.743, and Bartlett’s test of sphericity was statistically significant (chi-square, 837.42; degrees of freedom, 45; P Discussion This study evaluated the KAP concerning BRCA The analysis revealed that most participants had limited awareness of BRCA BRCA These results align with recent studies conducted across Asia and globally, which consistently document barriers to BRCA 14 BRCA 15 16 Further international comparisons reinforce these findings. In the United States, the MAGENTA trial demonstrated the feasibility and acceptability of self-directed genetic testing without requiring pre-test counseling, suggesting a scalable strategy to improve access in underserved populations [ 17 18 19 Taken together, these studies contextualize our findings within a global framework and underscore the urgent need for culturally tailored, system-level strategies to address enduring inequities in genetic counseling and testing among diverse populations. Our study also offers a methodological contribution by developing and validating a new KAP instrument specific to family members of individuals with ovarian or fallopian tube cancer, a population frequently overlooked in hereditary cancer research despite their critical role in cascade testing. The questionnaire demonstrated satisfactory internal consistency (Cronbach’s alpha=0.77 for both attitude and practice subscales) and robust structural validity, as supported by factor analysis. Unlike previous tools such as those of Pozzar et al. [ 20 21 Our findings are also consistent with earlier evidence documenting widespread deficits in BRCA 22 23 BRCA Young et al. [ 24 BRCA BRCA Another factor contributing to the low uptake of BRCA 14 BRCA 25 Among the predictors of stronger testing intentions in our study, a higher KAP score was the most significant factor. This aligns with findings by Rose et al. [ 26 A key strength of this study lies in its focus on an underserved yet critically important population: family members of individuals with ovarian and fallopian tube cancers. These individuals are central to cascade testing efforts but are often underrepresented in hereditary cancer research. Data collection via structured interviews conducted by trained personnel enhanced the consistency and reliability of responses. Additionally, the psychometric evaluation employed during questionnaire development contributes methodological rigor to the study. However, this study has some limitations. First, although content validity was supported through expert review by a multidisciplinary panel, including specialists in gynecologic oncology, genetics, and public health, a formal CVI analysis, comprising I-CVI and S-CVI/Ave calculations, was not performed. Future research should incorporate quantitative metrics of content validity to further strengthen the psychometric robustness of the instrument. Second, the single-center design, reliance on self-reported data, and the relatively small number of participants with relatives who had undergone BRCA Finally, our findings support the integration of international guidelines into national cancer genetics frameworks. Current recommendations from NCCN (2025), ESMO (2023), ASCO (2020), and NICE (2024) advocate for cascade testing among first- and second-degree relatives, breast MRI surveillance starting at age 25, and risk-reducing surgery at appropriate ages [ 3 7 In conclusion, this study reveals substantial gaps in BRCA  Conflicts of interest The authors declare no potential conflict of interest.  Ethical approval The study was approved by the Chiang Mai University Ethics Committee: research ID: 0046 study code: OBG-2567-0046.  Patient consent All the participants gave informed consent.  Funding information This research received no external funding. References 1 Webb PM Jordan SJ Global epidemiology of epithelial ovarian cancer Nat Rev Clin Oncol 2024 21 389 400 38548868 10.1038/s41571-024-00881-3 2 Berek JS Renz M Kehoe S Kumar L Friedlander M Cancer of the ovary, fallopian tube, and peritoneum: 2021 update Int J Gynaecol Obstet 2021 155 Suppl 1 61 85 34669199 10.1002/ijgo.13878 PMC9298325 3 Bedrosian I Somerfield MR Achatz MI Boughey JC Curigliano G Friedman S Germline testing in patients with breast cancer: ASCO-Society of surgical oncology guideline J Clin Oncol 2024 42 584 604 38175972 10.1200/JCO.23.02225 4 National Comprehensive Cancer Network (NCCN) Genetic/familial high-risk assessment: breast, ovarian, pancreatic, and prostate. Version 3, 2025 [Internet] Plymouth Meeting (PA) National Comprehensive Cancer Network c2025 [cited 2025 May 25]. Available from: https://www.nccn.org/guidelines/guidelines-detail?category=2&id=1545 5 Sessa C Balmaña J Bober SL Cardoso MJ Colombo N Curigliano G Risk reduction and screening of cancer in hereditary breast-ovarian cancer syndromes: ESMO clinical practice guideline Ann Oncol 2023 34 33 47 36307055 10.1016/j.annonc.2022.10.004 6 National Institute for Health and Care Excellence (NICE) Ovarian cancer: identifying and managing familial and genetic risk [Internet] London National Institute for Health and Care Excellence c2024 [cited 2025 May 25]. Available from: https://www.nice.org.uk/guidance/ng241 7 Sekine M Nishino K Enomoto T BRCA genetic test and risk-reducing salpingo-oophorectomy for hereditary breast and ovarian cancer: state-of-the-art Cancers (Basel) 2021 13 2562 34071148 10.3390/cancers13112562 PMC8197088 8 Baradács I Teutsch B Váradi A Bilá A Vincze Á Hegyi P PARP inhibitor era in ovarian cancer treatment: a systematic review and meta-analysis of randomized controlled trials J Ovarian Res 2024 17 53 38409030 10.1186/s13048-024-01362-y PMC10895809 9 Seo JH Jeong SY Kim MS Kang JH Paik ES Lee YY Prevalence and oncologic outcomes of BRCA1/2 Obstet Gynecol Sci 2019 62 411 9 31777737 10.5468/ogs.2019.62.6.411 PMC6856481 10 Charron M Kaiser B Dauge A Gallois H Lapointe J Dorval M Integrating hereditary breast and ovarian cancer genetic counselling and testing into mainstream clinical practice: legal and ethical challenges Crit Rev Oncol Hematol 2022 178 103797 36031172 10.1016/j.critrevonc.2022.103797 11 Asmare K Birhanu Y Wako Z Knowledge, attitude, practice towards breast self-examination and associated factors among women in Gondar town, Northwest Ethiopia, 2021: a community-based study BMC Womens Health 2022 22 174 35568846 10.1186/s12905-022-01764-4 PMC9107683 12 Okunowo AA Adaramoye VO Women’s Knowledge on ovarian cancer symptoms and risk factors in Nigeria: an institutional-based study J Epidemiol Glob Health 2018 8 34 41 30859785 10.2991/j.jegh.2018.07.002 PMC7325817 13 Ngamjarus C Pattanittum P n4Studies: application for sample size calculation in health science research Version 2.3 [Internet] Nonthaburi Health Intervention and Technology Assessment Program (HITAP) c2024 [cited 2024 Jan 3]. Available from: https://apps.apple.com/th/app/n4studies/id680516901 14 Kwong A Tan DS Ryu JM Current practices and challenges in genetic testing and counseling for women with breast and ovarian cancer in Asia Asia Pac J Clin Oncol 2025 21 211 20 38776249 10.1111/ajco.14074 PMC11880987 15 Powell S Artigas M Borovova I Gadiya P Hsu A Kaur R MAGENTA: a multinational patient survey assessing the awareness, perceptions and unmet needs in genetic testing and counselling among patients with breast cancer Front Oncol 2024 14 1380349 38807767 10.3389/fonc.2024.1380349 PMC11130477 16 Yun BS Park EH Ha J Lee JY Lee KH Lee TS Incidence and survival of gynecologic cancer including cervical, uterine, ovarian, vaginal, vulvar cancer and gestational trophoblastic neoplasia in Korea, 1999–2019: Korea Central Cancer Registry Obstet Gynecol Sci 2023 66 545 61 37953552 10.5468/ogs.23208 PMC10663396 17 Swisher EM Rayes N Bowen D Peterson CB Norquist BM Coffin T Remotely delivered cancer genetic testing in the making genetic testing accessible (MAGENTA) trial: a randomized clinical trial JAMA Oncol 2023 9 1547 55 37707822 10.1001/jamaoncol.2023.3748 PMC10502696 18 Mapoko BSE Ndi KC Tabola L Mouaye V Douanla P Nsangou N Feasibility of cancer genetic counselling and screening in Cameroon: perceived benefits and barriers Ecancermedicalscience 2023 17 1588 37799957 10.3332/ecancer.2023.1588 PMC10550300 19 Reid S Cadiz S Pal T Disparities in genetic testing and care among black women with hereditary breast cancer Curr Breast Cancer Rep 2020 12 125 31 33603954 10.1007/s12609-020-00364-1 PMC7885902 20 Pozzar RA Hong F Xiong N Stopfer JE Nayak MM Underhill-Blazey M Knowledge and psychosocial impact of genetic counseling and multigene panel testing among individuals with ovarian cancer Fam Cancer 2022 21 35 47 33751319 10.1007/s10689-021-00240-6 21 Chu AT Tse DM Suen DTK Kwong A Baseline knowledge and receptiveness to genetic testing for hereditary breast and ovarian cancer syndromes in Chinese high-risk females J Community Genet 2021 12 431 8 33928521 10.1007/s12687-021-00518-3 PMC8241971 22 Borzekowski DL Guan Y Smith KC Erby LH Roter DL The Angelina effect: immediate reach, grasp, and impact of going public Genet Med 2014 16 516 21 24357847 10.1038/gim.2013.181 23 Parente DJ BRCA J Am Board Fam Med 2020 33 885 93 33219067 10.3122/jabfm.2020.06.190461 24 Young AL Butow PN Vetsch J Quinn VF Patenaude AF Tucker KM Family communication, risk perception and cancer knowledge of young adults from BRCA1/2 J Genet Couns 2017 26 1179 96 28667568 10.1007/s10897-017-0125-4 25 Meshkani Z Moradi N Aboutorabi A Jafari A Shams R Subjective valuation of Iranian women for screening for gene-related diseases: a case of breast cancer BMC Public Health 2023 23 667 37041634 10.1186/s12889-023-15568-0 PMC10088156 26 Rose A Peters N Shea JA Armstrong K The association between knowledge and attitudes about genetic testing for cancer risk in the United States J Health Commun 2005 10 309 21 16036738 10.1080/10810730590950039 Table 1 Demographic data of the participants (n=215) Participant characteristic Value Age (yr) 47.34±14.08 BMI (kg/m 2 23.22±3.69 Education Primary 21 (9.8) Junior high 15 (7.0) Senior high 20 (9.3) Diploma 22 (10.2) Bachelor 114 (53.0) Master/doctor 23 (10.7) Occupation Civil servant 49 (22.8) State enterprise 8 (3.7) Housewife 32 (14.9) Agriculturist 2 (0.9) Employee 41 (19.1) Business 61 (28.4) Medical personals 13 (6.0) Retire 8 (3.7) Research assistant 1 (0.5) Marital status Single 92 (42.8) Married 93 (43.3) Divorced 14 (6.5) Widowed 16 (7.4) Parity 0 95 (44.2) 1 56 (26.0) 2 54 (25.1) 3 10 (4.7) Total number of relatives with cancer 1 141 (65.6) 2 54 (25.1) 3 12 (5.6) 4 8 (3.7) Participants and patient relationship Mother/daughter/sisters 186 (86.5) Grandmother/aunts/nieces 20 (9.3) Cousins/great-grandmother 9 (4.2) The BRCA a Unknown 107 (49.8) Not done 93 (43.3) Done with a positive result 5 (2.2) Done with a negative result 7 (3.3) Done with unknown result 3 (1.4) Values are presented as mean±standard deviation or number (%). BMI, body mass index; BRCA a The answers from the participants. Table 2 Data on the relatives of the participants with ovarian or fallopian tube cancer (n=215) Data Value Mean age at diagnosis years 52.76±11.78 Median duration of follow-up years 3.74 (0.02–38.50) Histology Low grade serous 9 (4.2) High grade serous 77 (35.8) Mucinous cancer 36 (16.7) Endometrioid 26 (12.1) Clear cell 59 (27.4) Mixed 7 (3.3) Mesonephric-like adenocarcinoma 1 (0.5) Stage I 120 (55.8) II 15 (7.0) III 61 (28.4) IV 12 (5.6) Advanced 7 (3.2) Treatment Neoadjuvant chemotherapy → debulking surgery → chemotherapy 30 (14.0) Primary surgery → surveillance 39 (18.1) Primary surgery → chemotherapy 143 (66.5) Chemotherapy 2 (0.9) Neoadjuvant chemotherapy 1 (0.5) Current status Complete response 131 (60.9) Partial response 1 (0.5) Stable disease 1 (0.5) Progression of disease 5 (2.3) Ongoing treatment 77 (35.8) BRCA Not done 202 (94.0) No mutation 5 (2.3)  BRCA1 6 (2.8)  BRCA2 2 (0.9) Values are presented as mean±standard deviation, median (range), or number (%). BRCA Table 3 Knowledge of participants regarding the BRCA Questions and responses Value Have you ever heard about BRCA Yes 35 (16.3) No 180 (83.7) What are the causes of BRCA Genetic inheritance 53 (24.7) Sporadic 65 (30.2) Genetic inheritance and sporadic 97 (45.1) Did you know that mutations in the BRCA Yes 39 (18.1) No 176 (81.9) What are the symptoms of ovarian cancer? a General abdominal pain 104 (48.4) Pelvic pain 109 (50.7) Abdominal swelling 162 (75.3) Bloating 139 (64.7) Constant feeling of fullness 55 (25.6) Reduced appetite 59 (27.4) Frequent urination 80 (37.2) Constipation 86 (40.0) Back pain 69 (32.1) Easy fatigue and tiredness 73 (34.0) Vaginal bleeding during menopause 52 (24.2) Unexplained weight loss 73 (34.0) What are the risk factors for ovarian cancer? a Having close relatives with ovarian cancer 133 (61.9) Having a personal or family history of breast cancer 93 (43.3) Age over 50 110 (51.2) Using medication that contains estrogen 82 (38.1) Overweight or obesity 46 (21.4) Having fertility issues 36 (16.7) Childless 51 (23.7) Previously treated for infertility 16 (7.4) Use of talcum powder in the genital area 34 (15.8) Use of talcum powder in the genital area 33 (15.3) Values are presented as number (%). BRCA a The number of participants who answered “Yes” in each item. Table 4 Level of knowledge, attitudes, and practice of BRCA Questionnaire 1 2 3 4 5 Mean±SD If a BRCA 6 (2.8) 137 (63.7) 56 (26.0) 16 (7.5) 3.38±0.67 If there is a mutation in the BRCA 1 (0.5) 5 (2.3) 110 (51.2) 74 (34.3) 25 (11.7) 3.54±0.75 Regular pelvic exams should be done 2 (0.9) 55 (25.6) 62 (28.8) 96 (44.7) 4.17±0.84 You have concerns about developing ovarian cancer 0.5 (2.3) 20 (9.3) 77 (35.8) 82 (38.1) 31 (14.5) 3.53±0.93 You are concerned that you may have a BRCA 8 (3.7) 15 (7.0) 102 (47.4) 71 (33.0) 19 (8.9) 3.36±0.88 You have researched information about BRCA 25 (11.7) 30 (14.0) 94 (43.7) 54 (25.1) 12 (5.5) 2.99±1.05 You desire to undergo screening for ovarian cancer or BRCA 5 (2.3) 10 (4.7) 70 (32.6) 95 (44.2) 35 (16.2) 3.67±0.88 If you feel a lump in your abdomen, even without any symptoms, you will definitely see a doctor at the hospital 6 (2.8) 51 (23.7) 82 (38.1) 76 (35.4) 4.06±0.84 I regularly observe changes in my body, such as palpating my abdomen 10 (4.7) 12 (5.6) 47 (21.9) 101 (47.0) 45 (20.8) 3.74±1.03 I undergo regular pelvic exams 26 (12.1) 19 (8.8) 48 (22.3) 79 (36.7) 43 (20.1) 3.44±1.25 Values are presented as number (%). Scale 0=lowest, 5=highest. BRCA Table 5 Factors influencing the desire to screen for ovarian cancer or BRCA Factor Number of participants who desire screening for ovarian cancer or BRCA a Total Univariate analysis b Multivariate analysis c    Strongly desire Not strong desire OR (95% CI) P Adjusted OR (95% CI ) P The score for the question about ovarian cancer symptoms (0–12)  7–12 41 (71.9) 16 (28.1) 57 (26.5) 1.987 (2.787–3.835) 0.039 1.838 (0.805–4.196) 0.148  0–6 89 (56.3) 69 (43.7) 158 (73.5)  The score for the question about ovarian cancer attitude (16–35) d  ≥25 98 (83.8) 19 (16.2) 117 (54.4) 10.638 (5.566–20.333) <0.001 12.638 (6.252–25.543) <0.001  <25 32 (32.7) 66 (67.3) 98 (45.6)  The score for the question about ovarian cancer risk (0–10)  6–10 14 (56.0) 11 (44.0) 25 (11.6) 0.812 (0.350–1.884) 0.667 0.504 (0.147–1.724) 0.275  0–5 116 (61.1) 74 (38.9) 190 (88.4)  Total number of relatives with cancer  ≥1 49 (66.2) 25 (33.8) 74 (34.4) 1.452 (0.808–2.609) 0.242 2.231 (0.756–6.582) 0.146  1 81 (57.4) 60 (42.6) 141 (65.6)  Duration of follow-up (yr)  >5 53 (61.6) 33 (38.4) 86 (40.0) 1.085 (0.620–1.897) 0.887 2.504 (1.183–5.300) 0.016  ≤5 77 (59.7) 52 (40.3) 129 (60.0)  Age of participants (yr)  <50 80 (64.5) 44 (35.5) 124 (57.7) 1.419 (0.858–2.592) 0.162 1.184 (0.558–2.515) 0.660  >50 50 (54.9) 41 (45.1) 91 (42.3)  Parity  Nulliparous 57 (60.0) 38 (40.0) 95 (44.2) 0.966 (0.557–1.674) 1.000 0.906 (0.414–1.980) 0.804  Multiparous 73 (60.8) 47 (39.2) 120 (55.8)  The highest education  Bachelor and beyond 88 (64.2) 49 (35.8) 137 (63.7) 1.539 (0.874–2.711) 0.148 1.672 (0.827–3.382) 0.152  Below bachelor 42 (53.8) 36 (46.2) 78 (36.3)  Occupation  Medical related 9 (69.2) 4 (30.8) 13 (6.0) 1.506 (0.449–5.056) 0.572 1.611 (0.338–7.680) 0.549  Non-medical related 121 (59.9) 81 (40.1) 202 (94.0)  Marital status  Single 56 (60.9) 36 (39.1) 92 (42.8) 1.030 (0.593–1.790) 1.000 1.185 (0.430–3.262) 0.743  Married 74 (60.2) 49 (39.8) 123 (57.2)  Cancer stage of the relative  Advanced (III & IV) 54 (67.5) 26 (32.5) 80 (37.2) 1.612 (0.904–2.875) 0.114 0.928 (0.370–2.326) 0.873  Early (I & II) 76 (56.3) 59 (43.7) 135 (62.8)  The current status of the relative  No response & ongoing treatment 62 (74.7) 21 (25.3) 83 (38.6) 2.779 (1.523–5.069) 0.001 4.303 (1.982–9.346) <0.001  Response 68 (51.5) 64 (48.5) 132 (61.4)  Relationship between participants and patients  Mother/daughter/sisters 116 (62.4) 70 (37.6) 186 (86.5) 1.776 (0.809–3.898) 0.158 1.709 (0.617–4.732) 0.303  Other 14 (48.3) 15 (51.7) 29 (13.5) Values are presented as number (%) unless otherwise indicated. BRCA a The number of participants who responded to the survey issue of “You desire to undergo screening for ovarian cancer or BRCA gene mutations”, was stratified into two categories: a response of 4–5 indicated a strong desire, while a response of 0–3 indicated a low or lack of desire. b Chi-square test, Fisher exact test. c Binary regression analysis (backward). d The sum of attitude excludes the survey issue of “You desire to undergo screening for ovarian cancer or BRCA gene mutations”. ",
  "metadata": {
    "Title of this paper": "The association between knowledge and attitudes about genetic testing for cancer risk in the United States",
    "Journal it was published in:": "Obstetrics & Gynecology Science",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12463482/"
  }
}