{
  "title": "Paper_378",
  "abstract": "pmc J Clin Invest J Clin Invest 120 jcinvest J Clin Invest The Journal of Clinical Investigation 0021-9738 1558-8238 American Society for Clinical Investigation PMC12483615 PMC12483615.1 12483615 12483615 40699891 10.1172/JCI181705 181705 1 Research Article Gene-environment interactions modulate the phenotype severity in mouse models of congenital craniofacial syndromes Fitriasari Sharien SFitriasari@stowers.edu 1 Fiorino Roberta RFiorino@stowers.edu 1 Truong Thoa H.K. TTruong@stowers.edu 1 McKinney Mary C. mck@stowers.org 1 Dixon Jill jill.dixon@manchester.ac.uk 2 Dixon Michael J. mike.dixon@manchester.ac.uk 2 Trainor Paul A. pat@stowers.org 1 3 1 2 3 Address correspondence to: Paul A. Trainor, Stowers Institute for Medical Research, 1000 E. 50th Street, Kansas City, Missouri 64110, USA. Phone: 816.926.4000; Email: pat@stowers.org 22 7 2025 1 10 2025 135 19 498024 e181705 4 4 2024 16 7 2025 22 07 2025 01 10 2025 01 10 2025 © 2025 Fitriasari et al. 2025 Fitriasari et al. https://creativecommons.org/licenses/by/4.0/ This work is licensed under the Creative Commons Attribution 4.0 International License. To view a copy of this license, visit http://creativecommons.org/licenses/by/4.0/ This article is available online at https://www.jci.org/articles/view/181705 Birth defects are the leading cause of infant mortality, and most inborn errors of development are multifactorial in origin resulting from complex gene-environment interactions. Definition of specific gene-environment interactions in the etiology and pathogenesis of congenital disorders is critically needed in the absence of genotype-phenotype correlation but is challenging. This is particularly true for congenital craniofacial anomalies, which account for approximately one-third of all birth defects, as they typically exhibit considerable inter- and intrafamilial variability. A classic example of this is Treacher Collins syndrome (TCS), which, although primarily caused by mutations in treacle ribosome biogenesis factor 1 ( TCOF1 Tcof1 +/– Birth defects are the leading cause of infant mortality and this study uncovers gene-environment interactions that affect the severity of disorders of the head and face. Bone biology Development Embryonic development Genetic diseases Mouse models Stowers Institute for Medical Research https://doi.org/10.13039/100007795 1008 Research in the Trainor laboratory is generously supported by the Stowers Institute for Medical Research pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement yes pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes Introduction A birth defect can be broadly defined as any congenital structural or functional anomaly that measurably affects an individual’s physical, intellectual, or social well-being ( 1 2 2 6 7 8 9 10 11 Interactions between genetic and environmental influences, therefore, shape the nature and severity of most birth defects, but a precise genotype-phenotype correlation is rarely observed for complex morphological structures. This is especially true for craniofacial anomalies, which exhibit particularly complex genotype-phenotype relationships ( 12 13 14 15 16 Extensive inter-familial and intra-familial phenotype variation is particularly evident in Treacher Collins syndrome (TCS), a rare congenital disorder characterized by hypoplasia of bones and cartilages within the malar, mandibular, orbital, and auricular regions of the face ( 17 19 20 21 TCOF1 POLR1B POLR1C POLR1D 22 24 25 26 27 TCS and many other craniofacial anomalies stem from perturbations in the development of neural crest cells (NCCs), a multipotent, migratory population of progenitor cells that give rise to most of the craniofacial bone and cartilage, connective tissue, neurons, and glia of the peripheral nervous system, melanocytes, and other cell types and tissues throughout the body ( 26 28 29 30 26 28 29 31 32 POLR1B POLR1C POLR1D 23 24 33 34 TCOF1 22 32 35 37 Tcof1 27 38 40 Tcof1 27 41 26 In this study, we investigated the role of redox status and DNA damage in modulating the phenotype severity of craniofacial malformations, using TCS as a representative condition. To model the heterogeneity of the human TCS population, we bred Tcof1 +/– Tcof1 +/– Tcof1 Tcof1 +/– Results TCS phenotype variation can be modeled in Tcof1 +/– TCS is characterized by a high degree of inter-familial and intra-familial variability in the phenotype severity of their craniofacial malformations, and we have previously reported that mouse models of Tcof1 +/– 20 42 Tcof1 +/– Tcof1 +/– 32 Tcof1 +/– Figure 1, A–L Figure 1, M–X Supplemental Table 1 https://doi.org/10.1172/JCI181705DS1 Morphological differences between WT and Tcof1 +/– Figure 1, A–C and G–I Tcof1 +/– Figure 1, D and J Tcof1 +/– Figure 1V Supplemental Figure 1 32 Tcof1 +/– Figure 1, E, F, K, and L Figure 1, Q, R, W, and X Supplemental Figure 1 Supplemental Figure 2 Supplemental Figure 2 Supplemental Table 1 Tcof1 +/– Tcof1 +/– Figure 1, Y and Z The combination of endogenous Tcof1/treacle protein and ROS levels within each genetic background correlates with TCS phenotype severity in Tcof1 +/– A link between genotype and phenotype depends on complex and diverse mechanisms, encompassing gene transcription, splicing, epigenetic modification, protein synthesis, and protein functionality ( 43 Cis trans 44 45 Tcof1 +/– Tcof1 Tcof1 +/– Figure 2, A and B Figure 1, G and S Figure 1, L and X Figure 1, J and V Tcof1 +/– Tcof1 +/– F P Tcof1 +/– A major portion of naturally occurring DNA lesions are ROS-induced single-stranded breaks, which, if left unchecked, can be converted into deadlier dsDNA breaks that ultimately lead to cell cycle arrest and apoptosis ( 46 48 Tcof1 +/– 27 Figure 2, C–I F 5 15 P Tcof1 +/– Figure 2I Tcof1 +/– Tcof1 +/– Tcof1 +/– The interactions between a pathogenic allele and different genetic backgrounds produce varying degrees of genomic instability and cell death. Given the protective role of Tcof1 Tcof1 Tcof1 +/– Figure 3, A–F Tcof1 +/– Figure 3, B, G, and H Tcof1 +/– Tcof1 +/– Figure 3, D, F, and G Tcof1 +/– Tcof1 +/– Figure 3, D, F, and H F 2 10 P F 2 10 P Tcof1 +/– Unresolved DNA damage is known to activate the apoptotic pathway and may lead to cell death. To determine the extent of apoptosis in WT and Tcof1 +/– F 2 14 P Figure 4, A, C, E, and G Tcof1 +/– Figure 4, B, D, F, and G Tcof1 +/– Tcof1 +/– Increased ROS in utero influences craniofacial shape and exacerbates the TCS phenotype in Tcof1 +/– Our model, that the protective role of treacle in DNA damage repair balanced with ROS-induced DNA damage combines to influence phenotype severity, predicts that solely modulating the levels of ROS-induced DNA damage should be sufficient to affect the severity of the TCS craniofacial phenotype. We initially tested whether increasing the levels of ROS alone was sufficient to increase the susceptibility of mice on the DBA/1J/C57BL/6 background to genomic instability and, consequently, exacerbate or worsen the TCS phenotype. ROS can be induced both in utero and ex utero using 3-nitropropionic acid (3-NP), an electron transport chain complex II inhibitor that promotes mitochondrial superoxide formation ( 49 51 + Supplemental Figure 3 Supplemental Figure 4 Supplemental Figure 3 Supplemental Figure 3 To demonstrate the effect of chronic redox stress in utero on the severity of the TCS phenotype in Tcof1 +/– Tcof1 +/– Figure 5, A–D Tcof1 +/– Figure 5, E–H Supplemental Figure 5 F 3 39 P F 3 39 P F 3 39 P F 3 39 P Tcof1 +/– t Tcof1 +/– Figure 5I Tcof1 +/– Figure 5I Geometric morphometric analysis after Procrustes superimposition was performed using MorphoJ ( 52 Supplemental Figure 5 53 Figure 5J Supplemental Figure 6 Figure 5J Tcof1 +/– Figure 5K Figure 5, J and K The protrusion of the mandibles associated with negative PC1 and PC2 scores does not necessarily mean longer mandibles in Tcof1 +/– 53 Figure 5 Figure 6, A–D Figure 6E Figure 6F Supplemental Figure 5 Figure 6F Tcof1 +/– Figure 6G The genetic background with high endogenous levels of treacle and low levels of ROS is less sensitive to increased oxidative stress in utero. Given the protective role of treacle in DNA damage repair, we posited that Tcof1 +/– Supplemental Figure 7 Tcof1 +/– Figure 7, A–D Tcof1 +/– F 3 24 P F 3 24 P F 3 24 P F 3 24 P Figure 7, E–I Figure 7, J–N F 3 24 P Reducing ROS in utero via maternal dietary antioxidant supplementation ameliorates the TCS phenotype. Since increasing ROS alone was sufficient to exacerbate the severity of the TCS phenotype in Tcof1 +/– Tcof1 +/– N 54 55 Supplemental Figure 8 Tcof1 +/– Tcof1 +/– Figure 8, A–D Tcof1 +/– Figure 8, E–H Tcof1 +/– Tcof1 +/– Figure 5C Figure 8D Tcof1 +/– Tcof1 +/– Figure 8I Figure 8I The mandibles were then separated from the skulls ( Figure 9, A–D Supplemental Figure 5 Tcof1 +/– Tcof1 +/– Figure 9E Tcof1 +/– Tcof1 +/– Figure 9F Tcof1 +/– P Tcof1 +/– Tcof1 +/– P Tcof1 +/– Tcof1 +/– P P Tcof1 +/– F 3 38 P F 3 38 P F 3 38 P F 3 38 P Tcof1 +/– Tcof1 +/– Figure 9G Tcof1 +/– Tcof1 +/– Tcof1 +/– Tcof1 +/– 27 40 Tcof1 +/– Discussion Advances in genomics continue to elucidate the complex etiology underlying birth defects, but knowing the molecular genotype of a single locus is often insufficient for predicting the phenotype of many malformation syndromes that are considered to be inherited in simple Mendelian patterns. One reason for this is that genes exert effects that are highly context-dependent, creating epistatic interactions ( 56 Craniofacial morphogenesis is an example of a complex trait in which epistatic and gene-environment interactions likely contribute extensively to phenotype variation during normal development and in the pathogenesis of craniofacial dysmorphology. However, for many human diseases, including malformation syndromes, no clear genotype-phenotype correlation exists. While there is mounting evidence that most craniofacial variation is genetically determined, the contributions of environmental factors or genetic background in the pathogenesis of craniofacial anomalies tend to be overlooked. The lack of genotype-phenotype correlation is particularly evident in TCS, which is characterized by a high degree of inter-familial and intra-familial variability in the phenotype severity of craniofacial malformations. We previously reported that mouse models of Tcof1 20 42 Tcof1 +/– Certain exogenous factors, such as redox stress–induced DNA damage, can sensitize an embryo to the development of more severe craniofacial malformations, especially if combined with variants that perturb DNA damage repair. This combination can thereby overwhelm a cell’s DNA damage repair capacity and consequently induce apoptosis of bone and cartilage progenitor neural crest cells. Therefore, the identification of these exogenous factors and their contributions to the pathogenesis of craniofacial malformations provide potential avenues for developing preventative metabolic therapeutics without the need for direct genome modification. Indeed, we discovered that dietary antioxidant supplementation was sufficient to partially rescue the TCS phenotype in the most severely affected genetic background. Although the genetic background–specific modifiers responsible for determining the endogenous levels of treacle protein levels are yet to be identified, our results provide further evidence for the role of epistatic and gene-environment interactions in modulating craniofacial anomalies. Similar background-dependent effects have been noted by other research groups studying different pathogenic alleles in the context of other craniofacial anomalies. For example, mutations in the Lrp2 57 Sprouty Spry1 Spry2 Spry4 58 Tcof1 +/– 59 Tcof1 +/– Supplemental Table 1 Tcof1 +/– 20 In addition to the contribution of endogenous treacle protein levels to phenotype variation, the endogenous level of ROS is an equally important contributor to the robustness of genetic backgrounds in the manifestation of TCS phenotype variability. We discovered that pure DBA/1J had the lowest levels of endogenous ROS and DNA damage, whereas DBA/1J/129S6/SVeV had the highest levels of ROS and DNA damage, and that this distinction correlated with the genetic backgrounds that, respectively, manifested the mildest and most severe craniofacial phenotypes in Tcof1 +/– 60 61 62 66 67 68 71 Our data indicate that the combinatorial effects of low levels of Tcof1/treacle and high levels of ROS resulted in greater susceptibility to genome instability, which was accentuated in the presence of a pathogenic allele such as Tcof1 +/– Tcof1 +/– Tcof1 +/– Tcof1 +/– Tcof1 +/– Tcof1 +/– 27 40 Tcof1 +/– More research is still needed to identify endogenous and exogenous modifiers of Tcof1/treacle. It remains unclear whether treacle directly affects ROS levels, and the direct interactions between treacle and ROS are still poorly understood. Given the absence of the antioxidant response element (ARE) core sequence (5′-GTGACnnnGC-3′) in the 10 kb upstream–flanking region of Tcof1 ( 72 73 Tcof1 +/– 27 40 27 40 Tcof1 +/– 31 74 75 27 Tcof1 In summary, craniofacial development involves many genes of small effect ( 76 76 78 Methods Sex as a biological variable. Although, we have not observed sex as a biological variable in our previous studies of TCS ( 20 27 32 35 42 79 Mouse husbandry. Tcof1 +/– 79 Tcof1 +/– Tcof1 +/– Genotyping. Tcof1 +/– Bright-field imaging. Pregnant mice were euthanized via CO 2 Skeletal preparations (bone and cartilage staining) and linear measurement. E18.5 embryos were fixed in 95% ethanol on a rocker at room temperature overnight following the removal of skin and visceral organs. Embryos were then stained with alizarin red and Alcian blue, as previously described ( 80 Supplemental Figure 5 t Molecular, biochemical, and phenotypic analyses. Protein isolation, Western Blotting, detection of endogenous ROS, immunofluorescence staining, TUNEL apoptotic cell death assay, immunofluorescence image quantification, 3-NP treatment, antioxidant supplementation, morphometrics analysis, Supplemental Methods Statistics. All statistical analyses for length measurements were performed using GraphPad Prism 10.0.0 (GraphPad Software). One-way ANOVA was used for multiple-group comparisons, and Welch’s 2-tailed t P Study approval. All animal studies were approved by the IACUC of the Stowers Institute for Medical Research (protocol no. 2022-143). Data availability. The original data underlying this work can be accessed via the Stowers Institute Original Data Repository at https://www.stowers.org/research/publications/libpb-2533 Supporting Data Values Author contributions SF and PAT conceptualized the studies. SF, RF, and THKT performed experiments and acquired data. SF and RF analyzed the data. MCM wrote the Python code for cell segmentation. JD and MJD generated the original Tcof1 +/– Supplementary Material Supplemental data Unedited blot and gel images Supporting data values We sincerely thank Marina Thexton, Melissa Childers, Jessica McCann, Stacy Billinger, and the Stowers Institute Laboratory Animal Service facility for their dedicated care and husbandry of the mice used in this study. We appreciate Lorena Maili (Stowers Institute for Medical Research, Kansas City, Kansas, USA), Kristin Watt (University of Colorado Anschutz Medical Campus, Aurora, Colorado, USA) and Soma Dash (University at Albany, SUNY, Albany, New York, USA) for their help with morphometrics analyses and insights into this work. We also thank Bret Freudenthal (University of Kansas Medical Center, Kansas City, Kansas, USA) for his feedback on the manuscript and data herein, and we are grateful to Robb Krumlauf (Stowers Institute for Medical Research) and Paul Kulesa (Children’s Mercy Research Institute, Kansas City, Kansas, USA) for their helpful advice and discussions during this study. Research in the Trainor laboratory is supported by the Stowers Institute for Medical Research. Conflict of interest: Copyright: Reference information: J Clin Invest 1 Centers for Disease Control Recommendations for the use of folic acid to reduce the number of cases of spina bifida and other neural tube defects MMWR Recomm Rep 1992 41 rr–14 1 7 1522835 2 Aruna A et al Ebola virus disease outbreak - Democratic Republic of the Congo, August 2018-November 2019 MMWR Morb Mortal Wkly Rep 2008 68 50 1162 1165 10.15585/mmwr.mm6850a3 31856146 PMC6936163 3 Christianson A, et al. March of dimes: global report on birth defects, the hidden toll of dying and disabled children. https://www.cabidigitallibrary.org/doi/full/10.5555/20063029121 4 Dolk H The prevalence of congenital anomalies in Europe Adv Exp Med Biol 2010 686 349 364 10.1007/978-90-481-9485-8_20 20824455 5 Kim M Prevalence of birth defects in Korean livebirths, 2005-2006 J Korean Med Sci 2012 27 10 1233 1240 10.3346/jkms.2012.27.10.1233 23091323 PMC3468762 6 Wang D Global, regional and national burden of orofacial clefts from 1990 to 2019: an analysis of the global burden of disease study 2019 Ann Med 2023 55 1 2215540 10.1080/07853890.2023.2215540 37232757 PMC10228319 7 Beames T Lipinski RJ Gene-environment interactions: aligning birth defects research with complex etiology Development 2020 147 21 dev191064 10.1242/dev.191064 32680836 PMC7375468 8 Krauss R Gene-environment interactions and the etiology of birth defects Curr Top Dev Biol 2016 116 569 580 10.1016/bs.ctdb.2015.12.010 26970642 9 Feldkamp M Etiology and clinical presentation of birth defects: population based study BMJ 2017 357 j2249 10.1136/bmj.j2249 28559234 PMC5448402 10 Toufaily M Causes of congenital malformations Birth Defects Res 2018 110 2 87 91 10.1002/bdr2.1105 29377643 11 Chen R Analysis of 589,306 genomes identifies individuals resilient to severe Mendelian childhood diseases Nat Biotechnol 2016 34 5 531 538 10.1038/nbt.3514 27065010 12 Hallgrimsson B Let’s face it--complex traits are just not that simple PLoS Genet 2014 10 11 e1004724 10.1371/journal.pgen.1004724 25375250 PMC4222688 13 Gorlin RJ, et al, eds. Syndromes of the Head and Neck 14 Mossey P Global strategies to reduce the healthcare burden of craniofacial anomalies Br Dent J 2003 195 10 613 10.1038/sj.bdj.4810738 14631452 15 Roosenboom J Exploring the underlying genetics of craniofacial morphology through various sources of knowledge Biomed Res Int 2016 2016 3054578 10.1155/2016/3054578 28053980 PMC5178329 16 Trainor P Facing up to the challenges of advancing craniofacial research Am J Med Genet A 2015 167 7 1451 1454 10.1002/ajmg.a.37065 25820983 PMC4478228 17 Terrazas K et al Rare syndromes of the head and face: mandibulofacial and acrofacial dysostoses Wiley Interdiscip Rev Dev Biol 2017 6 3 10.1002/wdev.263 28186364 PMC5400673 18 Dixon M Treacher Collins syndrome: correlation between clinical and genetic linkage studies Clin Dysmorphol 1994 3 2 96 103 10.1097/00019605-199404000-00002 8055143 19 Marres H et al The Treacher Collins syndrome. A clinical, radiological, and genetic linkage study on two pedigrees Arch Otolaryngol Head Neck Surg 1995 121 5 509 514 10.1001/archotol.1995.01890050009002 7727083 20 Dixon J Genetic background has a major effect on the penetrance and severity of craniofacial defects in mice heterozygous for the gene encoding the nucleolar protein treacle Dev Dyn 2004 229 4 907 914 10.1002/dvdy.20004 15042714 21 Edwards S Prenatal diagnosis in Treacher Collins syndrome using combined linkage analysis and ultrasound imaging J Med Genet 1996 33 7 603 606 10.1136/jmg.33.7.603 8818950 PMC1050672 22 The Treacher Collins Syndrome Collaborative Group et al Positional cloning of a gene involved in the pathogenesis of Treacher Collins syndrome Nat Genet 1996 12 2 130 136 10.1038/ng0296-130 8563749 23 Sanchez E et al POLR1B and neural crest cell anomalies in Trea cher Collins syndrome type 4 Genet Med 2020 22 3 547 556 10.1038/s41436-019-0669-9 31649276 PMC7056642 24 Schaefer E Autosomal recessive POLR1D mutation with decrease of TCOF1 mRNA is responsible for Treacher Collins syndrome Genet Med 2014 16 9 720 724 10.1038/gim.2014.12 24603435 25 Altug Teber Ö et al Genotyping in 46 patients with tentative diagnosis of Treacher Collins syndrome revealed unexpected phenotypic variation Eur J Hum Genet 2004 12 11 879 890 10.1038/sj.ejhg.5201260 15340364 26 Fitriasari S Trainor PA Diabetes, oxidative stress, and DNA damage modulate cranial neural crest cell development and the phenotype variability of craniofacial disorders Front Cell Dev Biol 2021 9 644410 10.3389/fcell.2021.644410 34095113 PMC8174788 27 Sakai D Prevention of Treacher Collins syndrome craniofacial anomalies in mouse models via maternal antioxidant supplementation Nat Commun 2016 7 10328 10.1038/ncomms10328 26792133 PMC4735750 28 Fitriasari S Trainor PA Gene–environment interactions in the pathogenesis of common craniofacial anomalies Curr Top Dev Biol 2023 152 139 168 10.1016/bs.ctdb.2022.10.005 36707210 29 Watt KEN, Trainer PA. Chapter 17 - Neurocristopathies: The Etiology and Pathogenesis of Disorders Arising from Defects in Neural Crest Cell Development. In: Trainer PA, eds. Neural Crest Cells: Evolution, Development and Disease 30 Dash S The development, patterning and evolution of neural crest cell differentiation into cartilage and bone Bone 2020 137 115409 10.1016/j.bone.2020.115409 32417535 31 Trainor P Craniofacial birth defects: the role of neural crest cells in the etiology and pathogenesis of Treacher Collins syndrome and the potential for prevention Am J Med Genet A 2010 152A 12 2984 2994 10.1002/ajmg.a.33454 20734335 PMC3686507 32 Jones N Prevention of the neurocristopathy Treacher Collins syndrome through inhibition of p53 function Nat Med 2008 14 2 125 133 10.1038/nm1725 18246078 PMC3093709 33 Watt KEN et al RNA polymerases I and III in development and disease Semin Cell Dev Biol 2023 136 49 63 10.1016/j.semcdb.2022.03.027 35422389 PMC9550887 34 Ghesh L Autosomal recessive Treacher Collins syndrome due to POLR1C mutations: report of a new family and review of the literature Am J Med Genet A 2019 179 7 1390 1394 10.1002/ajmg.a.61147 30957429 35 Falcon K Dynamic regulation and requirement for ribosomal RNA transcription during mammalian development Proc Natl Acad Sci U S A 2022 119 31 e2116974119 10.1073/pnas.2116974119 35881792 PMC9351356 36 Watt KEN et al The roles of RNA polymerase I and III subunits Polr1c and Polr1d in craniofacial development and in zebrafish models of Treacher Collins syndrome PLoS Genet 2016 12 7 e1006187 10.1371/journal.pgen.1006187 27448281 PMC4957770 37 Watt K tp53-dependent and independent signaling underlies the pathogenesis and possible prevention of Acrofacial Dysostosis-Cincinnati type Hum Mol Genet 2018 27 15 2628 2643 10.1093/hmg/ddy172 29750247 PMC6927876 38 Ciccia A et al Treacher Collins syndrome TCOF1 protein cooperates with NBS1 in the DNA damage response Proc Natl Acad Sci U S A 2014 111 52 18631 18636 10.1073/pnas.1422488112 25512513 PMC4284564 39 Larsen D The NBS1-treacle complex controls ribosomal RNA transcription in response to DNA damage Nat Cell Biol 2014 16 8 792 803 10.1038/ncb3007 25064736 PMC4962910 40 Sakai D Face off against ROS: Tcof1/treacle safeguards neuroepithelial cells and progenitor neural crest cells from oxidative stress during craniofacial development Dev Growth Differ 2016 58 7 577 585 10.1111/dgd.12305 27481486 PMC5026570 41 Yamaguchi H et al Alteration of DNA damage response causes cleft palate Front Physiol 2021 12 649492 10.3389/fphys.2021.649492 33854442 PMC8039291 42 Dixon J Tcof1/treacle is required for neural crest cell formation and proliferation deficiencies that cause craniofacial abnormalities Proc Natl Acad Sci U S A 2006 103 36 13403 13408 10.1073/pnas.0603730103 16938878 PMC1557391 43 Merkuri F Developmental processes regulate craniofacial variation in disease and evolution Genesis 2019 57 1 e23249 10.1002/dvg.23249 30207415 PMC6349473 44 Wu L Variation and genetic control of protein abundance in humans Nature 2013 499 7456 79 82 10.1038/nature12223 23676674 PMC3789121 45 Parts L Heritability and genetic basis of protein level variation in an outbred population Genome Res 2014 24 8 1363 1370 10.1101/gr.170506.113 24823668 PMC4120089 46 Lindahl T Instability and decay of the primary structure of DNA Nature 1993 362 6422 709 715 10.1038/362709a0 8469282 47 Tubbs A Endogenous DNA damage as a source of genomic instability in cancer Cell 2017 168 4 644 656 10.1016/j.cell.2017.01.002 28187286 PMC6591730 48 Maynard S Base excision repair of oxidative DNA damage and association with cancer and aging Carcinogenesis 2009 30 1 2 10 10.1093/carcin/bgn250 18978338 PMC2639036 49 Indo H Evidence of ROS generation by mitochondria in cells with impaired electron transport chain and mitochondrial DNA damage Mitochondrion 2007 7 1–2 106 118 10.1016/j.mito.2006.11.026 17307400 50 Liot G Complex II inhibition by 3-NP causes mitochondrial fragmentation and neuronal cell death via an NMDA- and ROS-dependent pathway Cell Death Differ 2009 16 6 899 909 10.1038/cdd.2009.22 19300456 PMC2757037 51 Okada N Reduced mitochondrial complex II activity enhances cell death via intracellular reactive oxygen species in STHdhQ111 striatal neurons with mutant huntingtin J Pharmacol Sci 2021 147 4 367 375 10.1016/j.jphs.2021.09.001 34663519 52 Klingenberg C MorphoJ: an integrated software package for geometric morphometrics Mol Ecol Resour 2011 11 2 353 357 10.1111/j.1755-0998.2010.02924.x 21429143 53 Hallgrimsson B Morphometrics, 3D imaging, and craniofacial development Curr Top Dev Biol 2015 115 561 597 10.1016/bs.ctdb.2015.09.003 26589938 PMC5299999 54 Ezerina D et al N-acetyl cysteine functions as a fast-acting antioxidant by triggering intracellular H 2 Cell Chem Biol 2018 25 4 447 459 10.1016/j.chembiol.2018.01.011 29429900 PMC6455997 55 Whillier S Role of N-acetylcysteine and cystine in glutathione synthesis in human erythrocytes Redox Rep 2009 14 3 115 124 10.1179/135100009X392539 19490753 56 Mackay T Epistasis and quantitative traits: using model organisms to study gene-gene interactions Nat Rev Genet 2014 15 1 22 33 10.1038/nrg3627 24296533 PMC3918431 57 Mecklenburg N Identification of disease-relevant modulators of the SHH pathway in the developing brain Development 2021 148 17 dev199307 10.1242/dev.199307 34463328 58 Percival C The interaction of genetic background and mutational effects in regulation of mouse craniofacial shape G3 (Bethesda) 2017 7 5 1439 1450 10.1534/g3.117.040659 28280213 PMC5427488 59 Green R Developmental nonlinearity drives phenotypic robustness Nat Commun 2017 8 1 1970 10.1038/s41467-017-02037-7 29213092 PMC5719035 60 Dennery P Oxidative stress in development: nature or nurture? Free Radic Biol Med 2010 49 7 1147 1151 10.1016/j.freeradbiomed.2010.07.011 20656021 61 Ishibashi M Oxygen-induced embryopathy and the significance of glutathione-dependent antioxidant system in the rat embryo during early organogenesis Free Radic Biol Med 1997 22 3 447 454 10.1016/S0891-5849(96)00338-3 8981036 62 Solmonson A Compartmentalized metabolism supports midgestation mammalian development Nature 2022 604 7905 349 353 10.1038/s41586-022-04557-9 35388219 PMC9007737 63 Kamata H Reactive oxygen species promote TNFalpha-induced death and sustained JNK activation by inhibiting MAP kinase phosphatases Cell 2005 120 5 649 661 10.1016/j.cell.2004.12.041 15766528 64 Xiao Q et al Embryonic stem cell differentiation into smooth muscle cells is mediated by Nox4-produced H2O2 Am J Physiol Cell Physiol 2009 296 4 C711 C723 10.1152/ajpcell.00442.2008 19036941 65 Hurd T Redox regulation of cell migration and adhesion Trends Cell Biol 2012 22 2 107 115 10.1016/j.tcb.2011.11.002 22209517 PMC4515034 66 Timme-Laragy AR et al Redox stress and signaling during vertebrate embryonic development: regulation and responses Semin Cell DevBiol 2018 80 17 28 10.1016/j.semcdb.2017.09.019 28927759 PMC5650060 67 Ornoy A Role of reactive oxygen species (ROS) in the diabetes-induced anomalies in rat embryos in vitro: reduction in antioxidant enzymes and low-molecular-weight antioxidants (LMWA) may be the causative factor for increased anomalies Teratology 1999 60 6 376 386 10.1002/(SICI)1096-9926(199912)60:6&#x0003c;376::AID-TERA10&#x0003e;3.0.CO;2-Q 10590399 68 Schreyer S C57BL/6 mice fed high fat diets as models for diabetes-accelerated atherosclerosis Atherosclerosis 1998 136 1 17 24 10.1016/S0021-9150(97)00165-2 9544727 69 Clee S The genetic landscape of type 2 diabetes in mice Endocr Rev 2007 28 1 48 83 10.1210/er.2006-0035 17018838 70 Stylianou I Differences in DBA/1J and DBA/2J reveal lipid QTL genes J Lipid Res 2008 49 11 2402 2413 10.1194/jlr.M800244-JLR200 18503028 PMC2834962 71 Toye A A genetic and physiological study of impaired glucose homeostasis control in C57BL/6J mice Diabetologia 2005 48 4 675 686 10.1007/s00125-005-1680-z 15729571 72 Tebay L Mechanisms of activation of the transcription factor Nrf2 by redox stressors, nutrient cues, and energy status and the pathways through which it attenuates degenerative disease Free Radic Biol Med 2015 88 pt b 108 146 10.1016/j.freeradbiomed.2015.06.021 26122708 PMC4659505 73 Duan X SILAC analysis of oxidative stress-mediated proteins in human pneumocytes: new role for treacle Proteomics 2010 10 11 2165 2174 10.1002/pmic.201000020 20340163 PMC5184769 74 Akasaki Y et al FoxO transcription factors support oxidative stress resistance in human chondrocytes Arthritis Rheumatol 2014 66 12 3349 3358 10.1002/art.38868 25186470 PMC4254812 75 Kops G Forkhead transcription factor FOXO3a protects quiescent cells from oxidative stress Nature 2002 419 6904 316 321 10.1038/nature01036 12239572 76 Porto A Evolution of the genotype-to-phenotype map and the cost of pleiotropy in mammals Genetics 2016 204 4 1601 1612 10.1534/genetics.116.189431 27784721 PMC5161288 77 Fish J Developmental mechanisms underlying variation in craniofacial disease and evolution Dev Biol 2016 415 2 188 197 10.1016/j.ydbio.2015.12.019 26724698 78 Hallgrímsson B Deciphering the palimpsest: studying the relationship between morphological integration and phenotypic covariation Evol Biol 2009 36 4 355 376 10.1007/s11692-009-9076-5 23293400 PMC3537827 79 Dixon J Increased levels of apoptosis in the prefusion neural folds underlie the craniofacial disorder, Treacher Collins syndrome Hum Mol Genet 2000 9 10 1473 1480 10.1093/hmg/9.10.1473 10888597 80 Dennis J Mutations in Hedgehog acyltransferase (Hhat) perturb Hedgehog signaling, resulting in severe acrania-holoprosencephaly-agnathia craniofacial defects PLoS Genet 2012 8 10 e1002927 10.1371/journal.pgen.1002927 23055936 PMC3464201 Version 1 07/23/2025 In-Press Preview Version 2 10/01/2025 Electronic publication Figure 1 Identical Tcof1 +/– ( A F G L Tcof1 +/– M R S X Tcof1 +/– Y Z P P P t Figure 2 Endogenous levels of Tcof1/treacle protein and ROS vary depending on genetic background. ( A Tcof1 +/– B t C H Tcof1 +/– I P P t Figure 3 Identical Tcof1 +/– ( A F Tcof1 +/– A F G + H + P P t Figure 4 Identical Tcof1 +/– ( A F Tcof1 +/– G + P P t Figure 5 3-NP treatment exacerbates the TCS phenotype in embryos on a genetic background with low levels of treacle and high levels of ROS. ( A D Tcof1 +/– E H Tcof1 +/– I J Tcof1 +/– Tcof1 +/– K P P P P t Figure 6 3-NP treatment changed overall mandible shape and size in embryos on a genetic background with low levels of treacle and high levels of ROS. ( A D Tcof1 +/– E Tcof1 +/– Tcof1 +/– F G P P P t Figure 7 3-NP treatment alone is insufficient to change overall craniofacial shape and size in embryos on a genetic background with high levels of treacle and low levels of ROS. ( A D Tcof1 +/– E H Tcof1 +/– I J M Tcof1 +/– N t Figure 8 Reducing ROS via antioxidant supplementation partially rescues the TCS phenotype in embryos on the most sensitive background. ( A D Tcof1 +/– E H Tcof1 +/– I P P P t Figure 9 Antioxidant supplementation of embryos on the most sensitive background shifts mutant mandible shapes closer to WT shapes. ( A D Tcof1 +/– E Tcof1 +/– Tcof1 +/– F Tcof1 +/– Tcof1 +/– Tcof1 +/– G P P t ",
  "metadata": {
    "Title of this paper": "Mutations in Hedgehog acyltransferase (Hhat) perturb Hedgehog signaling, resulting in severe acrania-holoprosencephaly-agnathia craniofacial defects",
    "Journal it was published in:": "The Journal of Clinical Investigation",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12483615/"
  }
}