{
  "title": "Paper_72",
  "abstract": "pmc Cureus Cureus 2757 cureus Cureus 2168-8184 Cureus Inc. PMC12491602 PMC12491602.1 12491602 12491602 10.7759/cureus.91460 1 Plastic Surgery HIV/AIDS Oral Medicine Perioperative Strategies to Reduce Occupational HIV Exposure in Head and Neck Microsurgical Reconstruction: A Case Report Muacevic Alexander Adler John R Ishii Tatsuya 1 Matsuura Naoki 1 Fukuda Ryo 1 Ntege Edward H 1 Shimizu Yusuke 1  1 Yusuke Shimizu yyssprs@gmail.com 2 9 2025 9 2025 17 9 495976 e91460 2 9 2025 02 09 2025 04 10 2025 04 10 2025 Copyright © 2025, Ishii et al. 2025 Ishii et al. https://creativecommons.org/licenses/by/4.0/ This is an open access article distributed under the terms of the Creative Commons Attribution License CC-BY 4.0., which permits unrestricted use, distribution, and reproduction in any medium, provided the original author and source are credited. This article is available from https://cureus.com/articles/400972-perioperative-strategies-to-reduce-occupational-hiv-exposure-in-head-and-neck-microsurgical-reconstruction-a-case-report Complex head and neck reconstructive surgeries in patients living with human immunodeficiency virus (HIV) present unique risks of occupational bloodborne pathogen exposure. We report the case of a 63-year-old man with well-controlled, long-standing HIV infection who underwent hemiglossectomy and microvascular free flap reconstruction for advanced tongue cancer. He was receiving antiretroviral therapy and had a CD4 + free tissue flaps head and neck neoplasms hiv infections infection control microsurgery needlestick injuries occupational exposure tongue neoplasms pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement no pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes Introduction Modern antiretroviral therapy (ART) has markedly improved the prognosis of people living with human immunodeficiency virus (HIV), with contemporary cohort data from high-income settings showing near-normal life expectancy in many contexts [ 1 + 2 3 Head and neck procedures, particularly intraoral and oropharyngeal reconstruction, combine a confined, three-dimensional workspace, sharp dentition, limited visibility, and frequent instrument exchanges, all of which increase opportunities for bloodborne pathogen exposure. The average risk of HIV transmission after a percutaneous injury is commonly cited at approximately 0.2%-0.3% (about 2-3 per 1,000 exposures), with substantially lower risk from mucocutaneous splashes; timely, guideline-concordant post-exposure prophylaxis (PEP), initiated as soon as possible and no later than 72 hours, further mitigates this risk [ 4 10 6 7 8 11 The anterolateral thigh (ALT) free flap remains a workhorse for head and neck reconstruction owing to its reliable anatomy, tissue versatility, and acceptable donor site profile. Recent syntheses comparing ALT with radial forearm free flaps in oral cavity reconstruction report equivalent flap survival and oral function with generally lower donor site morbidity for ALT, and head-and-neck-focused reviews continue to support favorable donor site and aesthetic outcomes [ 12 14 11 15 16 Here, we describe the perioperative management of a patient with HIV undergoing hemiglossectomy with microvascular free flap reconstruction, emphasizing a structured, procedure-specific exposure reduction bundle spanning the intraoperative and postoperative phases. Given the extended duration of intraoral microsurgery and the frequency of needle and instrument exchanges, safeguards beyond standard precautions are warranted. By detailing practical, reproducible measures associated with a zero-exposure outcome during prolonged oral-cavity reconstruction, we address a key implementation gap for plastic and reconstructive surgery teams managing similar high-risk cases. Case presentation A 63-year-old Japanese man presented to our Plastic and Reconstructive Surgery department with a painful mass on the left lateral tongue. Nine years earlier, he was diagnosed with HIV infection and progressed to acquired immunodeficiency syndrome (AIDS) after Pneumocystis jirovecii + + From 2016 through 2025, he underwent systematic annual evaluations at our infectious disease clinic in accordance with national guidelines [ 17 + + Treponema pallidum 1 1 Table 1 Longitudinal HIV-related laboratory parameters (2016–2025) CD4 + † ART: antiretroviral therapy; PCP: Pneumocystis jirovecii Treponema pallidum Year Age (year) Clinical event/note CD4 + CD8 + HIV RNA (copies/mL) HBsAg (IU/mL) HBsAb (mIU/mL) HBcAb (S/CO) HCV Ab (S/CO) HTLV‑1 Ab (C.O.I) RPR (RU) TPLA (TU) 2016 54 AIDS diagnosis; start ART; PCP; CMV adrenal insufficiency; syphilis 47 253 138,000 Negative 41.5 6.5 0.1 Positive 162.0 4,270 2017 55 Pre-op year −8 74 246 <20 ND ND ND ND ND 45.7 1,030 2018 56 Pre-op year −7 272 932 <20 ND ND ND ND ND 27.3 619 2019 57 Pre-op year −6 232 622 Undetectable † ND ND ND ND ND 23.5 475 2020 58 Pre-op year −5 291 642 <20 ND ND ND ND ND 16.1 396 2021 59 Pre-op year −4 321 627 <20 ND ND ND ND ND 11.2 342 2022 60 Pre-op year −3 313 599 Undetectable † ND ND ND ND ND 9.8 316 2023 61 Pre-op year −2 310 245 <20 ND ND ND ND ND 8.7 254 2024 62 Pre-op year −1 (routine follow-up) 568 424 Undetectable † ND ND ND ND ND 9.0 ND 2025 63 Preoperative assessment for tongue cancer surgery 361 285 <20 Negative 24.8 5.2 0.1 Positive ND 208 Reference ranges - - 500–1,200 300–1,000 <20 <0.05 <10.0 <1.0 <1.0 <1.0 <10 <10 Figure 1 Longitudinal immune and virologic trends Black solid line (left y-axis) shows CD4 + + ART: antiretroviral therapy; AIDS: acquired immunodeficiency syndrome; HIV: human immunodeficiency virus; RNA: ribonucleic acid Presenting symptoms included oral bleeding and weight change; exposure history (tobacco, alcohol) was recorded. Intraoral examination demonstrated an ulcerated lesion on the left lateral tongue with focal erythema/leukoplakia, a firm, indurated base with surface exudate, and preserved tongue mobility; no trismus was observed. Cranial nerve (CN) examination revealed no focal deficits of CN V, VII, IX, X, or XII. Neck examination identified a solitary level IIA lymph node, approximately 20 mm in greatest dimension. Airway assessment showed adequate mouth opening and no signs of impending compromise. Magnetic resonance imaging (MRI) was obtained to delineate lingual-septum invasion and perilesional soft-tissue planes; positron emission tomography-computed tomography (PET-CT) was used for metabolic staging and nodal assessment (Figure 2 Figure 2 Radiologic evaluation of left tongue cancer (A) T2-weighted MRI demonstrating a hyperintense lesion (bright on T2; red arrow) at the left tongue margin with contrast enhancement and restricted diffusion, extending toward the lingual septum. (B) PET-CT revealing FDG uptake (increased glucose-tracer uptake indicating high metabolic activity) at the primary tumor and the ipsilateral cervical lymph node (white arrow). R/L orientation and scale bars are included where applicable. The imaging supports a metabolically active primary tongue malignancy with nodal involvement. MRI: magnetic resonance imaging; PET-CT: positron emission tomography-computed tomography; FDG: fluorodeoxyglucose Incisional biopsy confirmed infiltrative, keratinizing squamous cell carcinoma (SCC) (Figure 3A 3B 3D 10 Figure 3 Histopathology and immunohistochemistry of the tongue lesion (A) Hematoxylin and eosin staining showing infiltrative, keratinizing squamous cell carcinoma (×100). (B) Strong, diffuse cytoplasmic positivity for cytokeratin (CK) AE1/AE3 (red arrow; ×100). (C) Cytoplasmic and membranous positivity for CK5/6 (blue arrow; ×100). (D) Strong nuclear staining for p40 confirming squamous lineage (black arrow; ×100). Scale bar = 200 µm. At ×100, cellular architecture and squamous differentiation features are appreciable; the combined morphology and immunophenotype support SCC. SCC: squamous cell carcinoma Under general anesthesia, the patient underwent hemiglossectomy, ipsilateral neck dissection (levels I-IV), and tracheostomy. Reconstruction was performed using a 6.5 × 18 cm left ALT flap designed with preoperative duplex ultrasonography, which identified a musculocutaneous perforator from the descending branch of the lateral circumflex femoral artery (Figures 4A 4B Figure 4 ALT (anterolateral thigh) flap design and harvest (A) Preoperative skin markings for a 6.5 × 18 cm ALT flap on the left thigh. (B) Harvested flap with a musculocutaneous perforator identified preoperatively by duplex ultrasonography, arising from the descending branch of the lateral circumflex femoral artery. The ALT is a commonly used soft-tissue flap for tongue reconstruction due to its reliable anatomy and adequate bulk. Before incision, the team conducted a focused hazard review (“time-out plus”) to identify intraoral exposure risks-proximity to dentition, a confined three-dimensional workspace, and frequent instrument exchange. A standardized set of distance-increasing and handling measures was then applied: (i) a neck-field suturing route whenever feasible, reserving intraoral access only when required (tongue and ALT inset), (ii) mouth retractors and extended-length needle holders to enable instrument-only (“mechanical”) suturing at an increased operator-dentition distance (no finger-near-needle manipulation), and (iii) a predefined hands-free neutral zone on the Mayo stand for all needle-bearing instrument exchanges, with systematic needle parking between throws. Intraoperative debriefing indicated strong user acceptance: nurses described the workflow as “clear and safe due to the neutral zone for instrument exchange,” and surgeons noted that the long-handled needle holder reduced contact with the teeth. These measures were selected and rehearsed during the preoperative briefing and referenced during inset to maintain adherence. Donor site closure was performed with continuous nylon sutures rather than staples. See Table 2 5A 5D Table 2 Perioperative HIV exposure reduction bundle PEP: post-exposure prophylaxis; OR: operating room; ICU: intensive care unit; neutral zone: a pre-agreed, clearly visible surface for hands-free placement/pick-up of sharps; needle parking: placing the needle in the neutral zone between throws; instrument-only (mechanical) suturing: needle driving exclusively with instruments (no finger-near-needle manipulation). Measures were selected during a pre-incision hazard review and rehearsed during team briefing; adherence was reinforced intraoperatively. Nursing staff described the neutral-zone workflow as “clear and safe,” and surgeons reported reduced tooth contact with a long-handled needle holder, supporting feasibility and acceptance. Cost/feasibility: in our setting, additional resources (extended-length needle holders, neutral-zone tray or magnetic mat, and a stocked PEP starter kit) were obtained for under approximately US $100 per case. Phase Objective Specific measure Rationale Personnel Pre-op Rapid PEP access OR starter kit-bictegravir/emtricitabine/tenofovir alafenamide-and an action manual; location confirmed during team briefing. Enable rapid initiation of PEP as soon as possible and within 72 h if exposure occurs; reduce delays. Surgeon, scrub nurse, infectious diseases (ID) team Intra-op (oral cavity) Increase distance from dentition Mouth opener, oral retractors, extended-length needle holders; instrument-only (“mechanical”) suturing. Reduce hand-tooth proximity; reduce sharps risk. Primary surgeon, assistant Intra-op (instrument handling) Eliminate hand-to-hand sharps transfer Hands-free neutral-zone tray/instrument pass; needle parking between throws. Decrease needlestick injuries; avoid unplanned handoffs. Surgeon, scrub nurse, circulating (scout) nurse Intra-op (donor site) Limit sharps at closure/removal Continuous nylon sutures (vs. staples); consider tissue adhesive where tension is low. Fewer sharp removals; avoid minor wound-complication signal reported with staples. Donor site surgeon Post-op monitoring Maintain distance during flap checks 22-gauge needle mounted on a 20 mL syringe for pin-prick. Increase operator-mouth distance. ICU/ward nurses, surgeons Post-op suture removal Prevent splatter/cuts Stand contralateral; blunt scissors under gauze shielding. Minimize splash and sharps injury. Ward staff, residents Figure 5 Intraoral reconstruction and occupational HIV exposure reduction measures (A) Post-hemiglossectomy intraoral defect prior to inset. (B) Distance-increasing setup: mouth retractors and long needle holders maintain hand distance from dentition. (C) Flap inset using a hands-free neutral-zone instrument-exchange protocol (neutral-zone area indicated) with instrument-only (“mechanical”) suturing and needle parking between throws. (D) Final intraoral view after layered suturing and tracheostomy completion. The neutral zone is a pre-agreed, clearly visible surface for hands-free placement/pick-up of sharps; instrument-only suturing denotes needle driving exclusively with instruments (no finger-near-needle manipulation). The sequence illustrates a reproducible, procedure-specific bundle that increases operator-dentition distance and standardizes sharps handling. HIV: human immunodeficiency virus The total operative time was 9 hours 11 minutes with an estimated blood loss of 274 mL. The patient was monitored in the intensive care unit for 48 hours. The flap remained viable without vascular compromise or infection. No intraoperative or postoperative occupational blood-exposure events were reported. He resumed oral intake as planned and was discharged home on postoperative day 35; longer-term validated functional assessments were not yet available given the short interval since discharge. Discussion This case demonstrates that complex head and neck free flap reconstruction can be performed safely in patients with HIV when a structured, procedure-specific safety bundle is applied. The patient underwent hemiglossectomy, cervical lymphadenectomy, and ALT flap reconstruction with no intraoperative complications, no postoperative infection, and no occupational exposure despite a prior AIDS diagnosis. These findings are consistent with contemporary evidence that durable virologic suppression and adequate CD4⁺ reconstitution mitigate perioperative risk and should not preclude major oncologic surgery, in line with modern survival data and perioperative guidelines [ 1 3 Oral cavity reconstruction carries a disproportionate exposure risk due to the confined three-dimensional field, sharp dentition, and prolonged instrument manipulation. Although recent public health guidance indicates that HIV transmission via saliva is extraordinarily rare [ 18 4 6 10 8 8 Donor site closure was performed with continuous nylon sutures rather than skin staples to decrease sharps handling during removal. While a recent systematic review found no clear advantage of staples over sutures in preventing infection, it noted that staples may increase the risk of minor wound complications; in our setting, using sutures also minimized additional sharps handling during removal [ 19 4 8 10 Institutional preparedness was integral to our approach. A PEP “starter kit” (bictegravir/emtricitabine/tenofovir alafenamide) and an action manual were pre-positioned in the operating room to enable rapid initiation of therapy-as soon as possible and within 72 hours of exposure-consistent with peer-reviewed national guidance and recent international recommendations to expand PEP accessibility [ 6 9 6 10 The patient’s preoperative CD4⁺ count of 361 cells/µL with consistently undetectable HIV RNA exceeded thresholds commonly used to support elective surgery in patients with HIV (e.g., CD4 > 200 cells/µL with viral suppression), reinforcing the safety and appropriateness of proceeding with microvascular reconstruction in this context [ 2 3 1 3 Existing reports in HIV-positive head and neck cancer populations tend to emphasize oncologic or general perioperative outcomes but rarely delineate a reproducible, procedure-specific intraoperative exposure reduction bundle. Our protocol (Table 2 8 Because the bundle is anchored to site-agnostic principles-maintain distance, standardize hands-free sharps exchange via a neutral zone, and ensure rapid PEP access-it can be adapted by substituting specialty-specific instruments and positioning the neutral zone within the sterile field. For example, wound protectors or ring retractors (general/colorectal), long laparoscopic needle drivers (minimally invasive surgery), wire twisters and K-wire caps (orthopedics), weighted specula and long needle holders (vaginal surgery), long bayonet instruments (neurosurgery), and wire-management strategies (cardiothoracic) serve the same function as our oral retractors and extended-length needle holders-they increase working distance and reduce unplanned handoffs. Current perioperative guidance endorses hands-free neutral-zone passing to minimize sharps injuries, and checklist-based implementation resources support cross-specialty standardization; choosing a clearly visible, stable surface (e.g., the corner of a Mayo stand, a magnetic mat, or a tray) and using “needle parking” between suture throws help maintain reproducibility across services [ 11 20 In addition to reducing exposure risk, visible preparedness (a stocked PEP kit and action card in the operating room) and a clearly defined neutral-zone workflow may lessen staff anxiety by making the response pathway immediate and transparent. In our case debrief, frontline feedback indicated strong user acceptance-nurses described the neutral-zone workflow as “clear and safe,” and surgeons noted that long-handled needle holders reduced the chance of tooth contact. To support sustained adherence, we propose brief educational measures (a pre-incision briefing to establish the neutral zone, short micro-drills for instrument-only suturing and needle parking, and scenario-based PEP activation simulations) paired with light-touch process metrics (near-miss and adherence logs, plus brief staff confidence checks), and we will track simple process measures-for example, the proportion of needle passes via the neutral zone, documented needle parking, and use of distance-increasing instruments-during subsequent cases and iteratively refine the bundle through plan-do-study-act cycles [ 11 20 Required additional resources, including extended-length needle holders, a neutral-zone setup, and a stocked PEP kit, were inexpensive in our setting and required minimal training, making this bundle readily adaptable in both resource-rich and resource-limited environments. Given the ongoing global burden of needlestick injuries among healthcare workers, implementing such standardized measures may provide system-level benefits [ 11 This single-institution experience cannot establish causality or broad generalizability. Multicenter, prospective evaluations with pre-post implementation comparisons are warranted and should specify a priori outcomes such as exposure events per 1,000 operative hours, time-to-PEP initiation, and audited adherence. Future work should also evaluate simulation-based training, enhanced barrier devices, and digital auditing of sharps handling to further reduce exposure risk and adapt protocols for patients with high viral loads or incomplete immune reconstitution. The current report reflects a short postoperative interval; longer-term outcomes (e.g., oncologic control, late complications, and validated functional recovery at 3-12 months) were not available at the time of writing. We lacked a pre-implementation comparator, and adherence to the bundle was assessed qualitatively, introducing potential Hawthorne and self-reporting effects. Generalizability may also be constrained by local workflow and case mix. Conclusions This case demonstrates that complex head and neck free flap reconstruction can be performed safely in a patient with well-controlled HIV when a structured exposure reduction protocol is used. The patient’s hemiglossectomy and ALT flap reconstruction were completed without intraoperative complications or occupational blood exposures. Key elements included distance-increasing instrumentation (e.g., extended-length tools and instrument-only suturing), hands-free neutral-zone exchange to eliminate hand-to-hand sharps transfers, and immediate availability of PEP. These precautions align with contemporary sharps-safety practices and perioperative HIV care guidance. The protocol was low-cost, required minimal additional training, and integrated smoothly into the surgical workflow, suggesting potential applicability across teams and settings. Because this is a single case with limited follow-up, the findings are preliminary. Multicenter, pre-/post-implementation evaluations with 3-12-month clinical, functional, and staff-safety outcomes are needed to establish efficacy and refine the approach. If validated, wider adoption of procedure-specific safeguards may improve occupational safety while maintaining high-quality oncologic reconstruction for patients living with HIV. Disclosures Human subjects: Conflicts of interest: Payment/services info: Financial relationships: Other relationships: Author Contributions Concept and design: Acquisition, analysis, or interpretation of data: Drafting of the manuscript: Critical review of the manuscript for important intellectual content: Supervision: Appendices Table 3 Adaptation of the exposure reduction bundle by surgical specialty Each row lists distance-increasing instrument swaps, hands-free neutral-zone placement strategy (including needle parking), and the specific sources supporting those recommendations. “Instrument-only suturing”: needle driving exclusively with instruments (no fingers near the needle); “neutral zone”: pre-agreed, clearly visible surface used for hands-free placement/pick-up of sharps; “needle parking”: placing needle-bearing tools in the neutral zone between throws to prevent unplanned handoffs Specialty/setting Distance-increasing instrument swaps (examples) Neutral-zone placement & hands-free passing (examples) References General/colorectal (open) Wound protector or ring retractor; long needle drivers; long Metzenbaum scissors; instrument-only suturing for deep fascia when feasible; blunt-tip suture needles for fascia. Neutral zone on Mayo‑stand corner or magnetic mat; verbal call-outs (e.g., “needle to zone”); needle parking between throws. [ 9 20 21 Minimally invasive (laparoscopy/robotics) Long laparoscopic needle drivers; laparoscopic grasper for extracorporeal knot manipulation; trocar safety devices. Neutral zone on the back table/Mayo (outside the camera field); pass trocar-related sharps to the zone (not hand-to-hand); park suture needles on tray prior to retrieval. [ 9 22 23 Orthopedics Wire twister; long needle holders; K-wire caps; double-gloving (indicator under-glove optional). Neutral zone on Mayo or magnetic pad; park K-wires/needles before exchange; avoid hand-backs of wire tips. [ 9 20 23 OB/GYN (open/vaginal) Weighted speculum; ring retractors; long needle holders for deep pelvic work; blunt-tip suture needles for uterine/fascial closure. Back-table neutral zone; announced placement/pick-up; park needle drivers between throws. [ 9 21 Cardiothoracic Long needle drivers; dedicated wire twisters; wire capping/bending aids; double-gloving for prolonged wire handling. Neutral zone on Mayo; wire ends secured/parked before exchange; verbal cue prior to pick-up. [ 9 24 Neurosurgery Micro-long needle holders; tubular retractors; microscope/endoscope ports used as distance aids. Small-tray neutral zone near the scrub with clear line of sight; one-at-a-time passing; needle counters with parking. [ 9 22 25 Endoscopy/interventional radiology Bite block (upper GI); long injection/hemostasis tools; sheath- or introducer-based delivery to reduce hand proximity. Procedure-cart neutral zone; place sharps on tray (not hand-to-hand); immediate sharps container use. [ 22 23 26 Head & neck (beyond oral cavity) Mouth props/cheek retractors; splash shields; long needle holders; instrument-only suturing where feasible. Mayo-stand neutral zone with clear line of sight; park needle drivers between throws; verbal call-outs for placement/pick-up. [ 9 22 References 1 Life expectancy after 2015 of adults with HIV on long-term antiretroviral therapy in Europe and North America: a collaborative analysis of cohort studies Lancet HIV Trickey A Sabin CA Burkholder G 0 307 10 2023 10.1016/S2352-3018(23)00028-0 PMC10288029 36958365 2 New York State Department of Health AIDS Institute. Perioperative care in adults with HIV 8 2025 2024 https://www.hivguidelines.org/guideline/hiv-perioperative/ 3 Perioperative Care in Adults With HIV Shin SJ Vail RM Shah SS 2025 Baltimore (MD) Johns Hopkins University 28 2024 https://www.ncbi.nlm.nih.gov/books/NBK576018/ 34982516 4 Incidence and risks of HIV infection, medication options, and adverse effects in accidental needle stick injuries: a narrative review Cureus Abadie RB Brown EM Campbell JR 0 16 2024 10.7759/cureus.51521 PMC10831193 38304675 5 Management of occupational exposure to blood and body fluids in primary care Aust Prescr Pierce A 113 118 47 2024 39228461 10.18773/austprescr.2024.037 PMC11368531 6 World Health Organization. Guidelines for HIV Post-Exposure Prophylaxis. Published July 22 Guidelines for HIV Post-Exposure Prophylaxis 8 2025 WHO WHO Geneva World Health Organization 2024 https://www.who.int/publications/i/item/9789240095137 39259822 7 Antiretroviral postexposure prophylaxis after sexual, injection drug use, or other nonoccupational exposure to HIV-CDC recommendations, United States, 2025 MMWR Recomm Rep Tanner MR O'Shea JG Byrd KM 1 56 74 2025 10.15585/mmwr.rr7401a1 PMC12064164 40331832 8 UK guideline for the use of HIV post-exposure prophylaxis 2021 HIV Med Cresswell F Asanati K Bhagani S 494 545 23 2022 35166004 10.1111/hiv.13208 9 Sharps safety AORN J Kyle E 87 92 119 2024 38149901 10.1002/aorn.14063 10 Lip and Oral Cavity Cancer Treatment (PDQ®)-Health Professional Version PDQ Lip and Oral Cavity Cancer Treatment 8 2025 PDQ® Adult Treatment Editorial Board Bethesda, MD National Cancer Institute 2025 https://www.cancer.gov/types/head-and-neck/hp/adult/lip-mouth-treatment-pdq 26389262 11 Global, regional and national incidence and causes of needlestick injuries: a systematic review and meta-analysis East Mediterr Health J Hosseinipalangi Z Golmohammadi Z Ghashghaee A 233 241 28 2022 35394056 10.26719/emhj.22.031 12 The anterolateral thigh flap in head and neck reconstruction Oral Maxillofac Surg Clin North Am Pu JJ Atia A Yu P Su YX 451 462 36 2024 39142949 10.1016/j.coms.2024.07.001 13 Comparing outcomes of radial forearm free flaps and anterolateral thigh free flaps in oral cavity reconstruction: a systematic review and meta-analysis Oral Oncol Ranganath K Jalisi SM Naples JG Gomez ED 106214 135 2022 36302325 10.1016/j.oraloncology.2022.106214 14 Donor-site morbidity and aesthetic outcomes in patients undergoing head and neck reconstruction with anterolateral thigh or latissimus dorsi flaps: a systematic review and meta-analysis J Craniomaxillofac Surg Wang Y Liang C Lin Q Online ahead of print 2025 10.1016/j.jcms.2025.08.012 40846581 15 Glove breach occurrence during surgical procedures: the benefits of double/indicator system gloves J Hosp Infect Rippon MG Rogers AA Ousey KJ 92 113 161 2025 40320075 10.1016/j.jhin.2025.04.010 16 Double gloving for self-protection in high-risk surgeries: a systematic review and meta-analysis Syst Rev Singh KV Walia K Farooque K Mathur P 57 14 2025 40057774 10.1186/s13643-025-02760-z PMC11889913 17 Guidelines for Antiretroviral Therapy-March 2025 Version [in Japanese] March 8 2025 Study Group on HIV Infection and Hemophilia for the Development of Team-Based Care and Improvement of Healthcare Standards AIDS Policy Research Project Commissioned by the Ministry of Health Labour and Welfare Tokyo, Japan Ministry of Health, Labour and Welfare, Japan 2025 https://hiv-guidelines.jp/pdf/hiv_guideline2025.pdf 18 Centers for Disease Control and Prevention. HIV occupational transmission 8 2025 2024 https://www.cdc.gov/hiv/causes/occupational-transmission.html 19 Surgical wound closure by staples or sutures?: systematic review Medicine (Baltimore) Cochetti G Abraha I Randolph J 0 99 2020 10.1097/MD.0000000000020573 PMC7310845 32569183 20 Association of periOperative Registered Nurses (AORN). Guideline for sharps safety-evidence table Denver, CO: AORN, Inc 8 2025 2025 https://www.aorn.org/docs/default-source/guidelines-resources/evidence-rating-and-tables/evidence-table-sharps-safety-011025.pdf 21 Time to consider blunt needles for implant surgery? A systematic review and meta-analysis shows that blunt suture needles reduce glove perforation Surgeon O'Donnell O Gallagher C Chaudhary AM Iqbal A 107 115 22 2024 37951800 10.1016/j.surge.2023.10.009 22 AORN. Neutral zones: the bordered region 8 2025 AORN AORN 2025 26 2023 https://www.aorn.org/article/neutral-zones 23 NIOSH Science Blog. Bloodborne pathogen exposures continue in operating room settings Bloodborne Pathogen Exposures Continue in Operating Room Settings. NIOSH Science Blog. November 8 2025 Gomaa A Hughes S Afanuh S 2023 2026 8 2023 https://blogs.cdc.gov/niosh-science-blog/2023/11/08/sharps-or/ 24 Make a difference: implementation, quality and effectiveness of the WHO Surgical Safety Checklist-a narrative review J Thorac Dis Wyss M Kolbe M Grande B 5723 5735 15 2023 37969258 10.21037/jtd-22-1807 PMC10636476 25 World Health Organization. WHO Surgical Safety Checklist Implementation Manual 8 2025 2022 https://iris.who.int/bitstream/handle/10665/44186/9789241598590_eng_Checklist.pdf?sequence=2&isAllowed=y 26 Provision of interventional radiology services 2023 Cardiovasc Intervent Radiol Morgan R Haslam P McCafferty I 3 25 47 2024 37978066 10.1007/s00270-023-03600-0 PMC10770229 ",
  "metadata": {
    "Title of this paper": "Provision of interventional radiology services 2023",
    "Journal it was published in:": "Cureus",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12491602/"
  }
}