{
  "title": "Paper_967",
  "abstract": "JCO Glob Oncol JCO Glob Oncol 319 nihpa JCO global oncology 2687-8941 pmc-is-collection-domain yes pmc-collection-title NIHPA Author Manuscripts PMC12483179 PMC12483179.1 12483179 12483179 NIHMS2104514 41021879 10.1200/GO-25-00065 NIHMS2104514 NIHPA2104514 1 Article Adoption and implementation of affordable cancer technologies in El Salvador: identifying implementation strategies for successful cervical cancer prevention in resource-limited settings Soler Montserrat PhD, MPH 1 Alfaro Karla MD, MPH 2 Rauda Juan Carlos MD 2 Torres Elizabeth MD 2 Pérez José Roberto MD 2 Méndez Freddy MD 2 Conzuelo Rodriguez Gabriel MD, PhD 2 Chacon Marina A. MD 3 Erazo Mayra Patricia MD 3 Masch Rachel MD, MPH 2 Mumenthaler Eveline BS 2 Cremer Miriam MD, MPH 1 2 1 2 3 Corresponding Author: Montserrat Soler, PhD, MPH solerm@ccf.org 9 2025 29 9 2025 11 497820 e2500065 e2500065 16 08 2025 30 09 2025 01 10 2025 01 10 2025 As part of the Affordable Cancer Technology (ACT) program, our team developed and tested a portable thermal ablation (TA) cervical precancer treatment. This research helped support subsequent implementation of the technology in El Salvador. Here we review successful implementation strategies deployed during the process and point to challenges and implications for other low and middle-income countries (LMICs). We utilize the Exploration, Preparation, Implementation and Sustainment (EPIS) framework to guide the discussion and identify associated implementation strategies utilized during each phase. Significant strategies were the development and maintenance of multi-actor partnerships and accessing new funding to introduce innovations to the country. In this case, planning for implementation began prior to the decision to adopt TA. The case of El Salvador highlights the need for such pragmatic approaches to shorten the time between scientific research and clinical practice in LMICs. The impact of these efforts has been significant: El Salvador has gone from one of the countries with the lowest cervical cancer screening rates in the region to one that can potentially meet elimination targets in the coming decades. This experience can serve as a blueprint for cervical cancer control efforts in other LMICs. pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access no pmc-prop-olf no pmc-prop-manuscript yes pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement no pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes ",
  "metadata": {
    "Title of this paper": "Adoption and implementation of affordable cancer technologies in El Salvador: identifying implementation strategies for successful cervical cancer prevention in resource-limited settings",
    "Journal it was published in:": "JCO global oncology",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12483179/"
  }
}