{
  "title": "Paper_1128",
  "abstract": "pmc World J Gastrointest Surg 1325 worldjgastrosurg WJGS World Journal of Gastrointestinal Surgery 1948-9366 Baishideng Publishing Group Inc PMC12476712 PMC12476712.1 12476712 12476712 41024782 10.4240/wjgs.v17.i9.109631 jWJGS.v17.i9.eid109631 1 Retrospective Study Epidemiology and risk of pulmonary complications following hepatobiliary surgical procedures: A retrospective study Meng HJ et al Meng Hui-Jie Department of Pharmacy, Beijing Tsinghua Changgung Hospital, School of Clinical Medicine, Tsinghua Medicine, Tsinghua University, Beijing 102218, China Chen Zhong-Hao THiFLY Research, Tsinghua University, Beijing 102218, China Nie Guang-Meng Beijing Tsinghua Changgung Hospital, School of Clinical Medicine, Tsinghua Medicine, Tsinghua University, Beijing 102218, China Ji Zhao-Shuai Department of Pharmacy, Beijing Tsinghua Changgung Hospital, School of Clinical Medicine, Tsinghua Medicine, Tsinghua University, Beijing 102218, China Wang Yu-Jie Medical Data Science Center, Beijing Tsinghua Changgung Hospital, School of Clinical Medicine, Tsinghua Medicine, Tsinghua University, Beijing 102218, China Hu Yong-Fang Department of Clinical Pharmacy, School of Clinical Medicine, Tsinghua University, Beijing 102218, China Tang Jing Department of Pharmacy, Beijing Tsinghua Changgung Hospital, School of Clinical Medicine, Tsinghua Medicine, Tsinghua University, Beijing 102218, China. tja00149@btch.edu.cn Co-corresponding authors: Yong-Fang Hu and Jing Tang. Author contributions: Meng HJ drafted manuscript; Meng HJ and Chen ZH collected data; Nie GM and Ji ZS guide research development and revised the manuscript; Wang YJ analyzed data; Hu YF designed the study and revised the article; Tang J performed the research and revised the manuscript; Hu YF and Tang J contributed equally to this manuscript as co-corresponding authors; and all authors have reviewed and approved the final manuscript. Supported by the Beijing Tsinghua Changgung Hospital Fund, China, No. 12023C01005. Corresponding author: Jing Tang, Department of Pharmacy, Beijing Tsinghua Changgung Hospital, School of Clinical Medicine, Tsinghua Medicine, Tsinghua University, No. 168 Litang Road, Changping District, Beijing 102218, China. tja00149@btch.edu.cn 27 9 2025 27 9 2025 17 9 497733 109631 19 5 2025 6 6 2025 1 8 2025 27 09 2025 29 09 2025 30 09 2025 ©The Author(s) 2025. Published by Baishideng Publishing Group Inc. All rights reserved. 2025 https://creativecommons.org/licenses/by-nc/4.0/ This article is an open-access article that was selected by an in-house editor and fully peer-reviewed by external reviewers. It is distributed in accordance with the Creative Commons Attribution NonCommercial (CC BY-NC 4.0) license, which permits others to distribute, remix, adapt, build upon this work non-commercially, and license their derivative works on different terms, provided the original work is properly cited and the use is non-commercial. See: https://creativecommons.org/Licenses/by-nc/4.0/ BACKGROUND Postoperative pulmonary complications (PPCs) are the most common complications following major upper abdominal surgeries, particularly hepatobiliary procedures, and significantly compromise surgical outcomes and patients’ quality of life. Although the adoption of laparoscopy has lowered their incidence, PPCs remain a frequent and serious concern after hepatobiliary surgery. Existing research on risk factors specific to hepatobiliary surgeries is limited, particularly regarding the epidemiology and risk factors of PPCs in liver and gallbladder surgeries in China. Therefore, this study aimed to investigate the risk factors for PPCs in a large hepatobiliary center. AIM To identify the incidence and risk factors for PPCs following hepatobiliary surgery based on perioperative variables. METHODS Retrospective data were collected from patients who underwent liver, gallbladder, or pancreatic surgery at a hepatobiliary center in China between May 2023 and December 2023. We retrospectively reviewed comprehensive medical records to extract demographic and hospital admission information for determining PPC incidence. Statistically significant variables were initially screened through univariate analysis, followed by binary logistic regression modeling to identify independent predictors of PPCs. Hospitalization expenditures and duration of stay were further contrasted across the study cohorts. RESULTS This study included 1941 patients who underwent liver, gallbladder, or pancreatic surgery, of whom 78 developed PPCs, resulting in an incidence rate of 4.02%. Logistic regression analysis revealed two independent predictors of PPCs in hepatobiliary surgery patients: Age ≥ 75 year (odds ratio = 8.350, 95%CI: 3.521-19.798, P P P CONCLUSION Age ≥ 75 years and prolonged anesthesia emerged as independent predictors of PPCs following hepatobiliary surgery. These complications were correlated with protracted hospitalization and increased healthcare costs. Postoperative pulmonary complications Hepatobiliary surgical procedures Risk factors Retrospective study Epidemiology pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement no pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes  Core Tip: INTRODUCTION Postoperative pulmonary complications (PPCs) after hepatobiliary surgery are common and serious complications that significantly increase postoperative incidence and mortality rates. Research has shown that the incidence of PPCs is relatively high after liver and gallbladder surgeries, particularly in patients undergoing liver resection, where the incidence of PPCs can be as high as 5%-20%[ 1 3 4 5 Integrating noninvasive ventilation and early mobilization strategies may effectively reduce the risk of PPCs. Reports indicate that non-invasive positive pressure ventilation accelerates lung function recovery and prevents and treats PPCs through non-invasive positive pressure ventilation[ 6 7 8 9 10 Previous studies have done some research on high-risk factors for pulmonary complications after liver and gallbladder surgeries. Older age, comorbidities with chronic obstructive pulmonary disease (COPD), preoperative pulmonary dysfunction, longer surgery time, excessive intraoperative blood transfusion, postoperative delirium, and pleural adhesions are potential high-risk factors for PPCs[ 11 14 15 16 MATERIALS AND METHODS Patients We performed a retrospective analysis utilizing the hospital’s case system and collected data on patients admitted to the hepatobiliary and pancreatic departments of Beijing Tsinghua Changgung Hospital between May 2023 and December 2023. The inclusion criteria were: (1) Perioperative patients undergoing liver, biliary and pancreatic surgery; and (2) Age ≥ 18 years. The exclusion criteria were: (1) Diagnosis of PPCs before surgery; (2) Pregnant or lactating women; and (3) Patients with incomplete information. Study participants were stratified by PPC occurrence (non-PPC vs The demographic characteristics of the two patient groups were recorded, including age, sex, height, weight, body mass index (BMI), smoking history, and American Society of Anesthesiologists (ASA) score. Recorded comorbidities included hypertension, diabetes, COPD, hepatitis B virus (HBV) infection, cirrhosis, heart failure, and a history of stroke. Data including surgical type, anesthesia duration, intraoperative fluid administration, and blood transfusion volume were recorded. For hepatobiliary surgeries, general anesthesia was uniformly employed, and induction was achieved using intravenous anesthetics ( e.g. e.g. e.g. e.g. e.g. via Definition and data collection PPCs were defined according to the criteria established by the European Society of Anesthesiology[ 17 18 19 1 19 21 Table 1 Incidence of postoperative pulmonary complications in this study  PPCs   n  Ratio ( n Pleural effusion 41 52.56% Respiratory infection 34 43.59% Respiratory failure 10 12.82% Atelectasis 10 12.82% Pneumothorax 2 2.56% Bronchospasm 1 1.28% Aspiration pneumonia 0 0 PPCs: Postoperative pulmonary complications. Statistical analysis Statistical analyses were performed using SPSS 23.0 and R4.5.0. Continuous variables are expressed as mean ± SD or median (interquartile range), and categorical variables as frequencies (percentages). Intergroup comparisons employed Student’s t U χ P P P RESULTS Incidence of pulmonary complications after hepatobiliary surgery Between May 2023 and December 2023, a total of 1941 patients underwent hepatobiliary and pancreatic surgery. Among them, 78 experienced PPCs, with an incidence rate of 4.02%. In this study, patients in the non-PPC group were matched at a 1:3 ratio with those in the PPC group. Propensity score matching did not find any statistically significant differences between the two groups in terms of sex ( P P P P 1 1 2 Figure 1  Study flowchart for risk factor analysis. Baseline patients’ characteristics Table 2 vs P vs P vs P vs P vs P Table 2 Comparison of baseline characteristics between the non-postoperative pulmonary complication and postoperative pulmonary complication groups, n  Variable  PPC ( n  Non-PPC ( n   P Demographics Sex (male) 56 (71.2) 145(62.0) 0.116 Age (years) 59 (24-90) 56 (23-87) 0.03 Height (cm) 167 (145-185) 167 (150-185) 0.663 Weight (kg) 63 (36.5-95) 64 (37-99) 0.688 BMI (kg/m 2 22.6 (16.22, 34.67) 23.0 (14.6, 38.11) 0.279 Preoperative status Smoking 8 (10) 26 (11) 0.834 Pathogenic colonization bacteria 11 (14.1) 18 (7.7) 0.091 Hemoglobin, mean ± SD 144.49 ± 23.13 119.68 ± 24.61 0.102 Platelet, mean ± SD 180.53 ± 86.59 196.06 ± 100.36 0.222 Albumin (g/L), mean ± SD 34.30 ± 5.52 37.88 ± 6.71 < 0.001 TBIL (μmol/L) 17.75 (4.0-504.9) 13.8 (2.5-476.3) 0.038 DBIL (μmol/L) 11.4 (1.7-507) 6.6 (1.6-401.2) 0.002 AST (U/L) 43.35 (10.10-3421.10) 29 (9.4-3435.4) 0.002 ALT (U/L) 41.95 (5.6-1617.4) 24.8 (5.0-2004.9) 0.003 Comorbidities Hypertension 24 (30.8) 62 (26.5) 0.464 Diabetes mellitus 0 29 (12.4) 0.001 HBV infection 18 (23.1) 48 (20.5) 0.631 Liver cirrhosis 10 (12.8) 40 (17.1) 0.373 Heart failure 1 (1.3) 2 (0.9) 0.738 History of stroke 1 (1.3) 13 (5.5) 0.114 COPD 0 5 (2.13) 0.193 PPC: Postoperative pulmonary complication; BMI: Body mass index; TBIL: Total bilirubin; DBIL: Direct bilirubin; AST: Aspartate aminotransferase; ALT: Alanine aminotransferase; HBV: Hepatitis B virus; COPD: Chronic obstructive pulmonary disease. Patient condition during and after surgery The types of liver and gallbladder surgeries performed at our hospital during the study period mainly included interventional surgery (percutaneous arterial embolization, angiography, or catheterization), liver surgery (liver segment or partial resection), and laparoscopic surgery (gallbladder, liver, or intestine). A comparison of the patients’ intraoperative and postoperative conditions is shown in Table 3 P P P P P P P P Table 3 Intraoperative and postoperative factors in the non-postoperative pulmonary complication and postoperative pulmonary complication groups, n  Variable  PPC ( n  Non-PPC ( n   P Intraoperative factors ASA physical status III-IV 34 (43.59) 51 (21.8) < 0.001 Operation duration ≥ 2 hours 45 (57.7) 78 (33.3) < 0.001 Anesthesia duration (10 minutes) 572.18 ± 226.41 252.98 ± 222.71 < 0.001 Estimated blood loss ≥ 100 mL 38 (48.7) 38(16.2) < 0.001 Blood transfusion 19 (24.4) 11 (4.7) < 0.001 Infusion (mL) 4550.16 ± 2239.36 2320.70 ± 1957.34 < 0.001 Surgical procedure Interventional surgery (percutaneous arterial embolization/angiography/catheterization) 34 (43.6) 110 (47.0) 0.6 Liver surgery (liver segment/partial resection) 25 (32.1) 76 (32.48) 0.944 Laparoscopic surgery (gallbladder/Liver/intestine) 8 (10.25) 29 (12.39) 0.613 Other operations 7 (9.0) 15 (6.4) 0.444 Pancreatic surgery 4 (5.1) 4 (1.7) 0.098 Postoperative factors Pain (NRS score ≥ 1) 1 (1.3) 13 (5.5) 0.114 Poor drainage 1 (1.3) 0 0.083 PPC: Postoperative pulmonary complication; ASA: American Society of Anesthesiologists; NRS: Numeric Rating Scale. Risk factors analysis Univariate correlation analysis identified several variables significantly associated with the occurrence of PPCs. These included age ( P P P P P P P P P P P P P 2A P P 2B Figure 2  Risk factors analysis. Hospitalization duration and healthcare expenses We compared the hospitalization duration and medical costs between patients who developed PPCs and those who did not. Results demonstrated significantly prolonged hospitalization durations (including postoperative stays) and elevated medical expenditures (total hospitalization and medication costs) in the PPC cohort relative to the non-PPC group, with all differences reaching statistical significance ( P 4 Table 4 Hospital length of stays and healthcare cost burden among patients  Group  All patients ( n  LOS (days) [median (P25, P75)]  Postoperative hospital stays (days) [median (P25, P75)]  Total cost (10000 yuan) 1  Medication costs (10000 yuan) 1 PPCs 78 15 (8, 21) 11 (6, 17) 12.19 (5.34, 20.06) 2.25 (1.00, 4.96) Non-PPCs 234 7 (4, 12) 3 (1, 7) 3.22 (2.02, 6.81) 0.75 (0.17, 1.63)  Z - -5.957 -7.662 -7.044 -6.550  P - < 0.001 < 0.001 < 0.001 < 0.001 1 All costs are Chinese Yuan, per 10 thousand Yuan. PPCs: Postoperative pulmonary complications; LOS: Length of stays. DISCUSSION PPCs significantly impact patient prognosis following hepatobiliary surgery. Studies have reported that the incidence of PPC after hepatectomy and biliary reconstruction is 2%-12%[ 22 23 24 25 5 25 27 In patients undergoing biliary surgery, postoperative respiratory suppression due to incision pain or weakened cough, particularly in older patients, can result in sputum retention and subsequent infection[ 27 28 29 30 With aging, the elasticity of the lung tissue diminishes, alveolar surface area decreases, and respiratory muscle strength weakens-all of which contribute to a decline in pulmonary reserve[ 13 31 32 34 35 37 27 38 28 39 40 In this study, the incidence of PPCs correlated with anesthesia duration, aligning with previous findings[ 18 33 41 42 5 vs P vs P vs P vs P vs P Previous studies have demonstrated that smoking substantially increases the risk of PPCs by impairing ciliary function, increasing airway secretions, and reducing lung function, thereby hindering postoperative pulmonary recovery[ 33 43 vs P Further analyses were conducted to identify other confounding factors including BMI and preoperative pulmonary function. Our results showed that no significant difference in BMI between the two groups. This may be due to the nonlinear relationship between BMI and PPCs, which were not addressed through a subgroup stratification in this study. Studies have revealed an association between BMI and PPCs[ 44 2 13 45 2 In the realm of pharmacoeconomics, this study revealed that patients with PPCs had significantly extended hospital stays, extended postoperative stays, and higher total hospitalization and medication expenses compared to the non-PPC patients. These findings underscore the economic significance of research on effective airway management in mitigating PPCs. According to data published in the Journal of the American Medical Association 22 23 46 47 This study has some limitations. It is a single-center retrospective analysis, which may limit the promotion of the conclusion of this study. The data in this study did not include some respiratory function parameters during the perioperative period, such as respiratory rate, tidal volume, and inhaled oxygen concentration. The absence of these data may have led to the omission of relevant risk factors and an underestimation of the true incidence of PPC. The generalizability of the conclusions of this study is as follows: This study was conducted at a Hepatobiliary Center with in a major tertiary care hospital, where clinical practice strictly adheres to international guidelines, supporting the generalizability of our findings. Furthermore, baseline characteristics and outcome incidences in our cohort align with existing domestic and international studies, reinforcing the broader applicability of our study population. While immediate extrapolation requires caution, core findings-particularly age ≥ 75 years and anesthesia duration-align with multicenter studies, supporting plausibility beyond our center. CONCLUSION In conclusion, PPCs following hepatobiliary surgery significantly affect length of stays and the associated medical costs. The data summarized in this article may help improve understanding of the complications and high-risk factors associated with pulmonary disease after hepatobiliary surgery. We identified two independent risk factors for PPCs in patients after hepatobiliary surgery: Age ≥ 75 years and prolonged anesthesia duration. Scheduled patient assessment should be implemented to minimize anesthesia duration and mitigate PPC risks. Enhanced postoperative pulmonary surveillance is essential for patients aged > 75 years and those under prolonged anesthesia. Tailored surveillance strategies towards the detection of early symptoms are critical to prevent progression to severe complications such as pneumonia and respiratory failure. ACKNOWLEDGEMENTS We would like to express our gratitude to Professor Liu YW for his contribution to data analysis and to Professor Yan Y for her contribution to paper revisions.  Institutional review board statement:  Informed consent statement:  Conflict-of-interest statement:  Provenance and peer review:  Peer-review model:  Specialty type:  Country of origin:  Peer-review report’s classification  Scientific Quality:  Novelty:  Creativity or Innovation:  Scientific Significance:  P-Reviewer: S-Editor: L-Editor: P-Editor: 1 Soufi M Flick KF Ceppa DP Blackwell MM Muraru R Nguyen TK Schmidt CM Nakeeb A Zyromski N House MG Moszczynski Z Ceppa EP Investigating the incidence, impact, and severity of pulmonary complications after hepatectomy: A single institution experience Surgery 2022 171 643 649 35074169 10.1016/j.surg.2021.12.016 2 Matsuo Y Nomi T Hokuto D Yoshikawa T Kamitani N Sho M Pulmonary complications after laparoscopic liver resection Surg Endosc 2021 35 1659 1666 32285208 10.1007/s00464-020-07549-w 3 Uemura M Ashida R Sugiura T Okamura Y Ohgi K Yamada M Otsuka S Notsu A Uesaka K Risk factors for postoperative pneumonia after hepatectomy with extrahepatic bile duct resection J Hepatobiliary Pancreat Sci 2023 30 383 391 35666037 10.1002/jhbp.1191 4 Acharya R Kafle S Sedhai YR Shrestha DB Walsh K Shamsi WE Gyawali S Acharya N Loschner AL Rubio ER Bilothorax: A Case Report and Systematic Literature Review of the Rare Entity Pulm Med 2024 2024 3973056 38947176 10.1155/2024/3973056 PMC11213635 5 Wang B Liang H Zhao H Shen J An Y Feng Y Risk factors and predictive model for pulmonary complications in patients transferred to ICU after hepatectomy BMC Surg 2023 23 150 37270566 10.1186/s12893-023-02019-1 PMC10239582 6 Araújo ER Bezerra Nogueira ID E Silva Barbosa PE Silva Nogueira PAM Effects of Non-Invasive Ventilation with different modalities in patients undergoing heart surgery: Protocol for a randomized controlled clinical trial PLoS One 2024 19 e0304569 38889140 10.1371/journal.pone.0304569 PMC11185470 7 Jivraj NK Lakbar I Sadeghirad B Müller MM Sohn SY Peel JK Jaffer A Phoophiboon V Trivedi V Chaudhuri D Lu C Liu Y Giammarioli B Einav S Burns KEA Intra-operative ventilation strategies and their impact on clinical outcomes: a systematic review and network meta-analysis of randomised trials Anaesthesia 2025 80 973 987 40133080 10.1111/anae.16600 PMC12256175 8 Lockstone J Parry SM Denehy L Robertson IK Story D Boden I Non-Invasive Positive airway Pressure thErapy to Reduce Postoperative Lung complications following Upper abdominal Surgery (NIPPER PLUS): a pilot randomised control trial Physiotherapy 2022 117 25 34 36242928 10.1016/j.physio.2022.06.001 9 Palermo J Tingey S Khanna AK Segal S Evaluation and Prevention of Perioperative Respiratory Failure J Clin Med 2024 13 5083 39274295 10.3390/jcm13175083 PMC11396761 10 Silva HVC Lunardi AC Pinto ACPN Macedo JRFF Santos EDCD Is Incentive Spirometry Superior to Standard Care in Postoperative Cardiac Surgery on Clinical Outcomes and Length of Hospital and Intensive Care Unit Stay? A Systematic Review with Meta-Analysis Braz J Cardiovasc Surg 2024 39 e20220319 38629953 10.21470/1678-9741-2022-0319 PMC11020284 11 Su P Huang C Lv H Zhang Z Tian Z Prediction model using risk factors associated with anastomotic leakage after minimally invasive esophagectomy Pak J Med Sci 2023 39 1345 1349 37680807 10.12669/pjms.39.5.8050 PMC10480737 12 Oh EJ Kim J Kim BG Han S Ko JS Gwak MS Kim GS Choi EA Kang J Park HY Intraoperative Factors Modifying the Risk of Postoperative Pulmonary Complications After Living Donor Liver Transplantation Transplantation 2023 107 1748 1755 36959123 10.1097/TP.0000000000004544 13 Gebeyehu G Eshetu A Aweke S Incidence and Associated Factors of Postoperative Pulmonary Complications after Abdominal Surgery in the Public Hospital, Addis Ababa, Ethiopia Anesthesiol Res Pract 2022 2022 8223903 35844807 10.1155/2022/8223903 PMC9279106 14 Zhang B Zhu Q Ji ZP Nomogram for predicting early complications after distal gastrectomy World J Gastrointest Surg 2023 15 2500 2512 38111768 10.4240/wjgs.v15.i11.2500 PMC10725534 15 Xu LN Xu YY Li GP Yang B Individualized risk estimation for postoperative pulmonary complications after hepatectomy based on perioperative variables World J Gastrointest Surg 2022 14 685 695 36158277 10.4240/wjgs.v14.i7.685 PMC9353752 16 Jammer I Wickboldt N Sander M Smith A Schultz MJ Pelosi P Leva B Rhodes A Hoeft A Walder B Chew MS Pearse RM European Society of Anaesthesiology (ESA) and the European Society of Intensive Care Medicine (ESICM) European Society of Anaesthesiology European Society of Intensive Care Medicine Standards for definitions and use of outcome measures for clinical effectiveness research in perioperative medicine: European Perioperative Clinical Outcome (EPCO) definitions: a statement from the ESA-ESICM joint taskforce on perioperative outcome measures Eur J Anaesthesiol 2015 32 88 105 25058504 10.1097/EJA.0000000000000118 17 Tranchart H Gaillard M Chirica M Ferretti S Perlemuter G Naveau S Dagher I Multivariate analysis of risk factors for postoperative complications after laparoscopic liver resection Surg Endosc 2015 29 2538 2544 25472746 10.1007/s00464-014-3965-0 18 Wang H Xing R Li X Cai N Tan M Shen M Li M Wang Q Wang J Gao C Luan Y Zhang M Xie Y Risk factors for pulmonary complications after laparoscopic liver resection: a multicenter retrospective analysis Surg Endosc 2023 37 510 517 36002681 10.1007/s00464-022-09490-6 19 Hajibandeh S Kotb A Evans L Sams E Naguib A Hajibandeh S Satyadas T Procedural outcomes of laparoscopic caudate lobe resection: A systematic review and meta-analysis Ann Hepatobiliary Pancreat Surg 2023 27 6 19 36245071 10.14701/ahbps.22-045 PMC9947369 20 Zhao D Xie QH Fang TS Zhang KJ Tang JX Yan X Jin X Xie LJ Xie WG How to apply ex-vivo split liver transplantation safely and feasibly: A three-step approach World J Gastrointest Surg 2024 16 1691 1699 38983312 10.4240/wjgs.v16.i6.1691 PMC11229998 21 LAS VEGAS investigators Epidemiology, practice of ventilation and outcome for patients at increased risk of postoperative pulmonary complications: LAS VEGAS - an observational study in 29 countries Eur J Anaesthesiol 2017 34 492 507 28633157 10.1097/EJA.0000000000000646 PMC5502122 22 Fernandez-Bustamante A Frendl G Sprung J Kor DJ Subramaniam B Martinez Ruiz R Lee JW Henderson WG Moss A Mehdiratta N Colwell MM Bartels K Kolodzie K Giquel J Vidal Melo MF Postoperative Pulmonary Complications, Early Mortality, and Hospital Stay Following Noncardiothoracic Surgery: A Multicenter Study by the Perioperative Research Network Investigators JAMA Surg 2017 152 157 166 27829093 10.1001/jamasurg.2016.4065 PMC5334462 23 Gillies MA Harrison EM Pearse RM Garrioch S Haddow C Smyth L Parks R Walsh TS Lone NI Intensive care utilization and outcomes after high-risk surgery in Scotland: a population-based cohort study Br J Anaesth 2017 118 123 131 28039249 10.1093/bja/aew396 24 Fernandez-Bustamante A Parker RA Frendl G Lee JW Nagrebetsky A Grecu L Amar D Tanaka P Sprung J Gupta RA Subramanian B Giquel J Eikermann M Musch G Nadler JW Gama de Abreu M Bartels K Grover M Chen LL Sparling J Douin DJ Weingarten T Wagener G Thompson BT Vidal Melo MF Perioperative Research Network (PRN) Investigators Perioperative lung expansion and pulmonary outcomes after open abdominal surgery versus usual care in the USA (PRIME-AIR): a multicentre, randomised, controlled, phase 3 trial Lancet Respir Med 2025 13 447 459 40020692 10.1016/S2213-2600(25)00040-2 25 Dezan MGF Cavalcante LN Silva HRC de Moura Almeida A Dos Santos de Assis LH de Freitas TT de Araújo MAS Cotrim HP Lyra AC Hepatobiliary disease after bone marrow transplant: A cross-sectional study of 377 patients Aliment Pharmacol Ther 2024 59 71 79 37833826 10.1111/apt.17756 26 Li S Lu Y Zhang H Ma C Xiao H Liu Z Zhou S Chen C Integrating StEP-COMPAC definition and enhanced recovery after surgery status in a machine-learning-based model for postoperative pulmonary complications in laparoscopic hepatectomy Anaesth Crit Care Pain Med 2024 43 101424 39278548 10.1016/j.accpm.2024.101424 27 El-Hajj VG Singh A Fletcher-Sandersjöö A Buwaider A Gharios M Habashy KJ Blixt S Stenimahitis V Nilsson G Gerdhem P Edström E Elmi-Terander A Long-term outcomes after surgery for subaxial cervical spine injuries in octogenarians, a matched population-based cohort study Eur Spine J 2024 33 3099 3108 38773018 10.1007/s00586-024-08312-8 28 Xu L Wang W Xu Y A new risk calculation model for complications of hepatectomy in adults over 75 Perioper Med (Lond) 2024 13 10 38409071 10.1186/s13741-024-00366-y PMC10898145 29 Zhang C Sheng M Lv J Cao Y Chen D Jia L Sun Y Ren Y Li L Weng Y Yu W Single-cell analysis reveals the immune heterogeneity and interactions in lungs undergoing hepatic ischemia-reperfusion Int Immunopharmacol 2023 124 111043 37844464 10.1016/j.intimp.2023.111043 30 Xu X Zhou T Tulahong A Ruze R Shao Y Exploring the effects of hypoxia and reoxygenation time on hepatocyte apoptosis and inflammation PLoS One 2024 19 e0310535 39570857 10.1371/journal.pone.0310535 PMC11581257 31 Huang Q Rauniyar R Yang J Zhou C Cai D Chen-Yoshikawa TF Yutaka Y Orlandi R Geraci TC Lin J Hu H Jiang Z Zhao G Ye L Risk stratification of postoperative pulmonary complications in elderly patients undergoing lung cancer resection: a propensity score-matched study J Thorac Dis 2023 15 3908 3918 37559604 10.21037/jtd-23-923 PMC10407502 32 Hirons B Rhatigan K Kesavan H Turner RD Birring SS Cho PSP Cough in chronic lung disease: a state of the art review J Thorac Dis 2023 15 5823 5843 37969279 10.21037/jtd-22-1776 PMC10636467 33 Scaramuzzo G Karbing DS Ball L Vigolo F Frizziero M Scomparin F Ragazzi R Verri M Rees SE Volta CA Spadaro S Intraoperative Ventilation/Perfusion Mismatch and Postoperative Pulmonary Complications after Major Noncardiac Surgery: A Prospective Cohort Study Anesthesiology 2024 141 693 706 38768389 10.1097/ALN.0000000000005080 PMC11389881 34 Kantar A Song WJ Bush A Chatziparasidis G Cough in non-cystic fibrosis bronchiectasis ERJ Open Res 2024 10 00330 02024 39624376 10.1183/23120541.00330-2024 PMC11610066 35 Higham A Booth S Dungwa J Singh D Histopathology of the small airways: Similarities and differences between ageing and COPD Pulmonology 2025 31 2430032 39883495 10.1080/25310429.2024.2430032 36 Okada S Shimomura M Ishihara S Ikebe S Furuya T Inoue M Clinical significance of postoperative pulmonary complications in elderly patients with lung cancer Interact Cardiovasc Thorac Surg 2022 35 ivac153 35640579 10.1093/icvts/ivac153 PMC9297523 37 Owusu-Bediako K Pfaff K Tram NK Stahl DL Tobias JD Nafiu OO Mpody C Association of Severe Obesity and Chronic Obstructive Pulmonary Disease With Pneumonia Following Non-Cardiac Surgery J Clin Med Res 2022 14 237 243 35836727 10.14740/jocmr4741 PMC9275437 38 Wang Z Lin M Geng G Wu W Tao Y Application of Enhanced Recovery after Surgery in the Perioperative Period for Elderly Patients with Lung Cancer JSLS 2024 28 e2024.00037 10.4293/JSLS.2024.00037 PMC11723335 39801728 39 Norimatsu Y Ito K Takemura N Inagaki F Mihara F Kokudo N Estimation of Physiologic Ability and Surgical Stress (E-PASS) Predicts Postoperative Major Complications After Hepato-Pancreato Biliary Surgery in the Elderly World J Surg 2022 46 2788 2796 36066664 10.1007/s00268-022-06716-5 40 Riediger CE Löck S Frohneberg L Hoffmann R Kahlert C Weitz J Oncological liver resection in elderly - A retrospective comparative study Int J Surg 2022 104 106729 35760345 10.1016/j.ijsu.2022.106729 41 Zhang Y Zhu J Xi C Wang G Effect of driving pressure-guided individualized positive end-expiratory pressure (PEEP) ventilation strategy on postoperative atelectasis in patients undergoing laparoscopic surgery as assessed by ultrasonography: study protocol for a prospective randomized controlled trial Trials 2025 26 106 40140868 10.1186/s13063-025-08819-5 PMC11948704 42 Ferrando C Vallverdú J Zattera L Tusman G Suárez-Sipmann F Improving lung protective mechanical ventilation: the individualised intraoperative open-lung approach Br J Anaesth 2025 134 281 287 39880492 10.1016/j.bja.2024.10.007 43 Lee HJ Lee HW Comprehensive Strategies for Preoperative Pulmonary Risk Evaluation and Management Tuberc Respir Dis (Seoul) 2025 88 90 108 39474732 10.4046/trd.2024.0118 PMC11704732 44 Qin PP Wang ZQ Liu L Xiong QJ Liu D Min S Wei K The association between BMI and postoperative pulmonary complications in adults undergoing non-cardiac, non-obstetric surgery: a retrospective cohort study Anaesthesia 2025 10.1111/anae.16573 39967320 45 Zhang Z Fu Y Zhang N Yu J Wen Z Association of preoperative spirometry tests with postoperative pulmonary complications after mediastinal mass resection: protocol for a retrospective cohort study BMJ Open 2023 13 e069956 10.1136/bmjopen-2022-069956 PMC10152045 37116995 46 Elefterion B Cirenei C Kipnis E Cailliau E Bruandet A Tavernier B Lamer A Lebuffe G Intraoperative Mechanical Power and Postoperative Pulmonary Complications in Noncardiothoracic Elective Surgery Patients: A 10-Year Retrospective Cohort Study Anesthesiology 2024 140 399 408 38011027 10.1097/ALN.0000000000004848 47 Luo Z Zhang X Wang Y Huang W Chen M Yang M Yu P An Accessible Pre-Rehabilitation Bundle for Patients Undergoing Elective Heart Valve Surgery with Limited Resources: The TIME Randomized Clinical Trial Rev Cardiovasc Med 2023 24 308 39076434 10.31083/j.rcm2411308 PMC11272831 Data sharing statement The data to support the findings of this study are available from the corresponding author upon request. ",
  "metadata": {
    "Title of this paper": "An Accessible Pre-Rehabilitation Bundle for Patients Undergoing Elective Heart Valve Surgery with Limited Resources: The TIME Randomized Clinical Trial",
    "Journal it was published in:": "World Journal of Gastrointestinal Surgery",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12476712/"
  }
}