{
  "title": "Paper_1031",
  "abstract": "pmc Front Oncol Front Oncol 1755 frontonco Front. Oncol. Frontiers in Oncology 2234-943X Frontiers Media SA PMC12479253 PMC12479253.1 12479253 12479253 41035668 10.3389/fonc.2025.1632060 1 Oncology Review IQGAP1: cross-disease target via receptor-pathway networks Zhu Shaopeng  1  2  † Zou Yunpeng  1  2  † Guo Jie  2 Ma Wenqi  2 Lu Laitong  2 Liu Ronghan  1  2 Kang Jianning  2 Zhao Kai  3  * Zhong Jiangbo  1  3  *  1 School of Clinical Medicine, Shandong Second Medical University Weifang, Shandong China  2 Central Hospital Affiliated to Shandong First Medical University, Shandong First Medical University and Shandong Academy of Medical Sciences Jinan, Shandong China  3 Department of Spin Surgery, Central Hospital Affiliated to Shandong First Medical University Jinan, Shandong China Edited by: Fabio Luis Forti Reviewed by: Khairy Mohamed Abdallah Zoheir  Irene Sambri *Correspondence: Jiangbo Zhong, 13370587729@163.com jockey1986@163.com †These authors have contributed equally to this work 16 9 2025 2025 15 480898 1632060 21 5 2025 01 9 2025 16 09 2025 01 10 2025 02 10 2025 Copyright © 2025 Zhu, Zou, Guo, Ma, Lu, Liu, Kang, Zhao and Zhong. 2025 Zhu, Zou, Guo, Ma, Lu, Liu, Kang, Zhao and Zhong https://creativecommons.org/licenses/by/4.0/ This is an open-access article distributed under the terms of the Creative Commons Attribution License (CC BY). The use, distribution or reproduction in other forums is permitted, provided the original author(s) and the copyright owner(s) are credited and that the original publication in this journal is cited, in accordance with accepted academic practice. No use, distribution or reproduction is permitted which does not comply with these terms. IQGAP1, a versatile scaffolding protein, critically regulates cytoskeletal organization, cell motility, proliferation, and signaling cascades. Beyond coordinating these cellular functions, it is increasingly recognized as a key driver in malignancies, immune dysfunction, metabolic dysregulation, and cardiovascular pathologies. By binding receptor tyrosine kinases, small GTPases, and downstream effectors, IQGAP1 modulates oncogenesis, immune evasion, and metabolic imbalance, while contributing to chemoresistance. This review synthesizes advances in IQGAP1’s structural domains, disease-specific signaling networks, and therapeutic targeting strategies, emphasizing its translational potential in developing precision therapies for cancer, metabolic syndromes, and immune disorders. IQGAP1 scaffold protein cancer drug resistance immune modulation metabolic diseases cell signaling therapeutic target The author(s) declare financial support was received for the research and/or publication of this article. This work was supported by the National Natural Science Fund of China (82202750), Science and Technology Innovation Project of Jinan City (202328035, 202328053). pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement no pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes section-in-acceptance Molecular and Cellular Oncology 1 Introduction IQ motif containing GTPase-activating protein 1 (IQGAP1) is a multifunctional scaffold protein that plays an essential role in regulating various biological processes, including cytoskeletal dynamics, cell migration, proliferation, signal transduction, and cell-cell adhesion. Since its initial discovery, IQGAP1 has been extensively studied for its pivotal role in controlling cell morphology and motility. This protein exerts its effects through interactions with numerous signaling molecules and receptors, regulating fundamental cellular functions and influencing a variety of physiological and pathological states. The significance of IQGAP1 has expanded beyond its basic cellular roles, revealing its critical involvement in various diseases, particularly cancer, immune disorders, and metabolic diseases. As a member of the IQGAP protein family, which also includes IQGAP2 and IQGAP3, IQGAP1 was first identified in human osteosarcoma cells. IQGAP1 is a large molecular entity, with a molecular weight of approximately 190 kDa, composed of 1657 amino acids. It is widely expressed in human tissues and possesses five major functional domains: a calmodulin homology domain (CHD), a proline-rich WW domain involved in protein-protein interactions, an IQ domain, a Ras GAP-related domain (GRD), and a C-terminal Ras GAP domain (RGCT) ( 1 2 IQGAP1 has emerged as a crucial regulator in many physiological contexts. For instance, in the kidney, IQGAP1 is involved in the regulation of the glomerular filtration barrier by co-localizing with renin during the foot process of podocytes, affecting the permeability of the glomerular basement membrane ( 3 4 5 6 7 The role of IQGAP1 in cancer has garnered significant attention. It is implicated not only in tumor cell proliferation, migration, and metastasis but also in chemoresistance, making it a potential target for therapeutic intervention ( 8 EGFR CXCR4 2 8 9 Beyond cancer and immunity, IQGAP1 has shown relevance in metabolic disorders. Studies suggest that IQGAP1 plays a vital role in regulating metabolic homeostasis, fat cell function, and insulin sensitivity, with potential implications for diseases like obesity and diabetes ( 10 11 In summary, IQGAP1’s multifaceted roles in cellular regulation, cancer progression, immune modulation, and metabolic disease highlight its potential as a therapeutic target. As research progresses, understanding the precise mechanisms through which IQGAP1 influences these processes will be crucial in developing targeted therapies for a variety of diseases. The diverse biological functions of IQGAP1 and its ability to integrate cellular signals across different systems make it an exciting candidate for future therapeutic strategies. 2 Structure and function of IQGAP1 IQGAP1 is a large, multifunctional scaffold protein of approximately 190 kDa. It plays a crucial role in regulating a variety of cellular processes, including cytoskeletal dynamics, cell signaling, motility, and proliferation. Unlike classic GTPase-activating proteins (GAPs), IQGAP1 does not have intrinsic GAP activity but instead serves as an integrator of multiple signaling pathways through its interaction with various binding partners ( 8 12 2.1 Structural domains of IQGAP1 IQGAP1 consists of several structural domains that mediate its multifunctional roles in the cell. These include: Calponin Homology Domain (CHD): This domain is responsible for binding to actin filaments, which allows IQGAP1 to play a central role in regulating the cytoskeleton and cellular shape ( 13 WW Domain: A proline-rich motif that enables interaction with proteins containing SH3 domains. This domain is crucial for mediating protein-protein interactions in various signaling pathways ( 13 IQ Domain: Containing four IQ motifs, this domain binds to calmodulin, allowing IQGAP1 to mediate calcium-dependent and -independent signaling processes. The IQ domain plays a role in integrating signals from the intracellular environment ( 8 RasGAP-Related Domain (GRD): This domain interacts with small GTPases such as Cdc42 and Rac1. These GTPases regulate a variety of cellular functions, including cell polarity, migration, and adhesion. IQGAP1 helps modulate the activity of these GTPases, linking them to downstream signaling events ( 13 RasGAP C-Terminal Domain (RGCT): This domain is involved in mediating protein-protein interactions, contributing to IQGAP1’s function as a scaffold that assembles signaling complexes. The RGCT domain plays a key role in regulating cellular responses to external stimuli ( 14  Figure 1 Figure 1 Domain architecture of IQGAP1 and its interaction partners. The schematic diagram illustrates the modular structure of IQGAP1, highlighting key functional domains and their associated binding partners. From the N-terminus to the C-terminus: the CHD domain interacts with F-actin and CXCR2; the WW domain binds to ERK1 and ERK2; the IQ domain binds to various proteins, including calmodulin, S100, MEK1/2, actin, and EGFR; the GRD domain mediates interactions with Rac1, Cdc42, and LGR4; and the RGCT domain participates in binding to β-catenin, E-cadherin, and APC. Diagram showing the domain structure of a protein with schematic representations of binding partners. Sections include CHD (F-actin, CXCR2), WW (ERK1, ERK2), IQ (Calmodulin, S100, MEK1/2, Myosin, EGFR), GRD (Rac1, Cdc42, LGR4), and RGCT (β-Catenin, E-cadherin, APC). Specific binding sites are highlighted in color. 2.2 Functional roles of IQGAP1 IQGAP1 plays a critical role in regulating cellular processes by acting as a scaffold protein that integrates and coordinates various signaling pathways. It interacts with multiple signaling molecules, including receptor tyrosine kinases (e.g., EGFR, HER2, FGFR1), small GTPases (e.g., Rac1, Cdc42), and downstream effectors (e.g., B-Raf, MEK, ERK, PI3K/Akt MAPK, PI3K/Akt, Wnt/β-catenin, and Hippo In addition, IQGAP1 regulates the cytoskeleton by modulating actin dynamics and cell motility, which is important for processes like wound healing, immune response, and cancer metastasis. IQGAP1’s activity is further regulated by post-translational modifications, such as SUMOylation, which enhances its stability and signaling functions. IQGAP1’s ability to integrate multiple cellular signals makes it a crucial regulator of both normal physiology and disease progression ( 2 15 16 3 Relationship between IQGAP1 and cancer IQGAP1 is increasingly recognized as a master integrator of oncogenic signals, acting as a versatile scaffold that coordinates diverse cellular pathways fundamental to tumorigenesis, metastasis, and therapy resistance. Overexpressed in a broad spectrum of cancers, IQGAP1 facilitates tumor progression by interfacing with membrane-bound receptors and cytoplasmic signaling mediators, orchestrating a network of molecular interactions critical to cancer cell survival and dissemination. 3.1 Interaction of IQGAP1 with cancer receptors 3.1.1 Receptor tyrosine kinases and their pathways IQGAP1 interacts with a variety of receptor tyrosine kinases (RTKs), acting as a central regulator of signaling cascades that promote tumor progression. 3.1.1.1 EGFR (epidermal growth factor receptor) IQGAP1 binds to EGFR through its IQ domain, regulating EGFR phosphorylation and promoting downstream signaling via the MAPK PI3K/AKT 2 17 3.1.1.2 HER2 (human epidermal growth factor receptor 2) In breast cancer, IQGAP1 directly interacts with HER2, regulating its phosphorylation and stability. This interaction is essential for HER2-driven oncogenesis, contributing to increased cell survival and proliferation ( 18 3.1.1.3 MET (hepatocyte growth factor receptor) IQGAP1 associates with MET and is phosphorylated at Tyr 1510 19 3.1.1.4 FGFR1 (fibroblast growth factor receptor 1) IQGAP1 functions as a scaffold for FGF2-induced signaling, enhancing cytoskeletal reorganization through N-WASP and Arp2/3. This process is critical for fibroblast-like cell migration during tumor progression ( 20 3.1.2 Chemokine receptors and tumor cell migration IQGAP1 also plays an important role in modulating chemokine receptor signaling, which is vital for cancer cell migration and metastasis. 3.1.2.1 CXCR4 (chemokine receptor 4) IQGAP1 regulates CXCR4 receptor trafficking and recycling, promoting SDF-1-induced migration. It enhances downstream ERK activation, facilitating leukemia and carcinoma cell migration and invasion ( 21 3.1.2.2 CXCR2 (chemokine receptor 2) IQGAP1 interacts with CXCR2, promoting its localization at the cell front and supporting chemotactic migration in neutrophils. This interaction also plays a crucial role in tumor cell navigation within the tumor microenvironment ( 22 3.1.3 Integrins and adhesion receptors IQGAP1 influences cell adhesion and motility through its interactions with integrins and other adhesion receptors, driving cancer metastasis. 3.1.3.1 β1-integrin IQGAP1 enhances β1-integrin transcription and stability via the ERK/FAK and SRF pathways. This regulation is important for metastatic colonization, especially in lung metastases associated with breast and prostate cancers ( 23 3.1.3.2 CD44 IQGAP1 also interacts with CD44, the hyaluronan receptor, to promote actin cytoskeletal rearrangement and focal adhesion formation. This interaction is crucial for cancer cell migration and tumor progression, particularly in fibroblast-like cells ( 24 3.1.4 Downstream signaling pathways IQGAP1 serves as a scaffold for several critical intracellular signaling pathways that regulate tumor growth, survival, and metastasis. 3.1.4.1 MAPK/ERK pathway IQGAP1 facilitates the activation of the MAPK 25 3.1.4.2 PI3K/AKT pathway IQGAP1 interacts with PI3Kα and PDK1, promoting PIP3 synthesis and Akt activation. This signaling pathway is critical for promoting cell survival and resistance to apoptosis, particularly in response to growth factor stimulation ( 15 3.1.4.3 Hippo/YAP pathway IQGAP1 interacts with YAP1, inhibiting MST2 and LATS1 kinases in the Hippo pathway. This regulation prevents cell death and promotes liver tumorigenesis, emphasizing IQGAP1’s role in promoting cancer cell survival ( 26 3.1.4.4 mTOR pathway IQGAP1 modulates mTOR signaling 27 3.1.5 Small GTPases and cytoskeletal dynamics IQGAP1 regulates small GTPases and is essential for cytoskeletal dynamics, which are crucial for cancer cell motility and metastasis. 3.1.5.1 Rac1 and Cdc42 IQGAP1 acts as a scaffold for Rac1 and Cdc42, promoting actin cytoskeletal reorganization. This facilitates tumor cell migration and invasion, as seen in hepatocellular carcinoma, where IQGAP1 enhances Rac1-dependent Src/FAK signaling ( 28 3.1.5.2 ARF1 IQGAP1 interacts with ARF1, contributing to ERK reactivation in vemurafenib-resistant colorectal cancer. This interaction underscores IQGAP1’s role in overcoming therapeutic resistance by facilitating the reactivation of key signaling pathways ( 29 3.2 The role of IQGAP1 in tumor drug resistance IQGAP1 has been implicated in the regulation of tumor drug resistance across various cancer types. By modulating different molecular pathways, IQGAP1 facilitates tumor cell adaptation to chemotherapy, radiotherapy, and targeted therapies, thus contributing to the development of drug resistance. In esophageal squamous cell carcinoma (ESCC), IQGAP1 enhances resistance to paclitaxel (PTX) by upregulating the Hippo pathway downstream effector YAP. Specifically, IQGAP1 overexpression activates YAP, which in turn inhibits ferroptosis, thereby promoting resistance to PTX. This mechanism was validated through the use of ferroptosis agonists (RSL3) and inhibitors (Fer-1), which demonstrated that IQGAP1-mediated regulation of ferroptosis plays a crucial role in the development of resistance. These findings highlight the potential of targeting the IQGAP1-YAP axis as a therapeutic strategy for overcoming PTX resistance in ESCC ( 30 In hepatitis B virus (HBV)-positive hepatocellular carcinoma (HCC), IQGAP1 is upregulated by increased reactive oxygen species (ROS) levels, which promotes its binding to Rac1 and subsequently activates the Src/FAK signaling 28 Additionally, in rectal adenocarcinoma, IQGAP1 plays a pivotal role in mediating resistance after radiation and chemotherapy. Post-treatment tumor samples exhibited elevated IQGAP1 expression, particularly in patients with poor treatment responses. IQGAP1 activation of the MAPK pathway 31 Finally, IQGAP1 also contributes to resistance in targeted therapies for breast cancer. By forming a complex with ARF1, IQGAP1 activates the ERK signaling pathway 29 In conclusion, IQGAP1 mediates tumor drug resistance through multiple mechanisms, including the suppression of ferroptosis via YAP activation, ROS-induced Src/FAK signaling 3.3 IQGAP1 in cancer 3.3.1 Head and neck cancer Head and neck cancer is the sixth most common cancer globally ( 32 PI3K pathway 33 35 PI3K/AKT/mTOR signaling pathway 33 IQGAP1 regulates the phosphorylation of splicing proteins via the PI3K pathway, thereby altering splicing activity without affecting the overall protein levels. This modulation results in cancer-related splicing events ( 34 Rac1/Cdc42 pathway 36 37 Given the critical role of the IQGAP1/PI3K pathway  Figure 2 Figure 2 IQGAP1-mediated signaling in cancer progression. IQGAP1 plays a key role in cancer progression by regulating key signaling pathways associated with cell migration, proliferation, and metastasis. In head and neck cancers, IQGAP1 regulates EGFR signaling through the PI3K/mTOR/AKT pathway, promoting cell migration and altering the phosphorylation of splicing proteins. In breast cancer, IQGAP1 activates RhoA/C GTPases, enhancing cell proliferation and migration. In hepatocellular carcinoma, IQGAP1 promotes the Wnt/β-catenin pathway, leading to increased cell proliferation and metastasis. In pancreatic cancer, IQGAP1 regulates the KRAS signaling pathway, activating the MAPK/ERK pathway to support tumor survival and spread. In gastrointestinal cancer, IQGAP1 is associated with RhoC GTPases and the MAPK signaling pathway, driving cell growth and migration. Finally, in gliomas, IQGAP1 interacts with TRIM56 and CDC42, influencing actin dynamics and cell motility. This figure illustrates the multifaceted role of IQGAP1 in regulating key pathways across different cancer types, highlighting its central role in cancer progression. Diagram illustrating various cancer types and the involvement of IQGAP1 in their progression. It includes glioma, head and neck cancer, breast cancer, hepatocellular carcinoma, pancreatic cancer, and gastrointestinal cancer. Each section shows signaling pathways and molecular interactions specific to the cancer type, highlighting proteins such as TRIM56, CDC42, RhoA/C, β-catenin, KRAS, and receptor tyrosine kinase. Overall, the diagram emphasizes IQGAP1’s role in regulating cell migration, proliferation, and metastasis across different cancers. 3.3.2 Breast cancer Breast cancer is the most common malignant tumor in women, accounting for approximately one-quarter of all cases, and it poses a serious threat to the health and lives of women worldwide ( 32 An in vivo 38 18 39 40 IQGAP1 also localizes to the centrosome, where it regulates centrosome size and number by influencing BRCA1 localization, thereby modulating cell proliferation ( 41 Following treatment with the antipsychotic drug pimozide, IQGAP1 forms aggregates with TGF-β1-induced anti-apoptotic factor (TIAF1), thereby promoting apoptosis ( 42 3.3.3 Hepatocellular carcinoma According to 2022 cancer statistics, there were approximately 800,000 newly diagnosed liver cancer cases, accounting for 4.3% of all new cancer cases and ranking sixth globally. Liver cancer-related deaths totaled approximately 750,000, making it the fourth leading cause of cancer-related mortality ( 32 Studies have shown that most human HCC patients exhibit dysregulation in the typical Wnt/Frizzled signaling 43 44 Wnt/β-catenin signaling pathway 45 27 46 47 48 49 50 27 Jin et al. conducted immunostaining on 33 pairs of HCC tissues and adjacent non-cancerous tissues, revealing a significant correlation between IQGAP1 and β-catenin. IQGAP1 promotes the transcription and nuclear translocation of β-catenin and enhances the expression of β-catenin-mediated Wnt target genes, driving HCC cell migration ( 51 in vivo 52 53 Chronic HBV infection is the most critical risk factor for HCC. It was discovered that the interaction between IQGAP1 and Rho family proteins plays a vital role. In HBV-positive liver cancer cells, IQGAP1 is significantly upregulated compared to HBV-negative cells. IQGAP1 promotes HBV-mediated anti-apoptosis and metastasis through Rac1-dependent ROS accumulation and activation of the Src/FAK pathway ( 28 Sorafenib is a drug used to treat advanced HCC, but resistance to it limits its therapeutic success ( 54 PI3K/Akt signaling pathway Akt signaling 55 Notably, targeted disruption of the mouse Iqgap1 gene does not cause any defects except for late-stage gastric mucosal hyperplasia ( 56 3.3.4 Pancreatic cancer Pancreatic cancer is one of the most common gastrointestinal tumors, characterized by its high malignancy and poor overall prognosis, with a 5-year survival rate of only 9%. The current treatment approach for pancreatic cancer remains surgical resection combined with adjuvant chemotherapy. However, due to the insidious onset of pancreatic cancer, most patients are diagnosed at an advanced stage, making treatment outcomes often suboptimal ( 57 The mechanism of IQGAP1 in pancreatic cancer has been found to be strongly associated with the MAPK pathway MAPK1 and ARL4C signaling 58 MAPK signaling 59 In vitro 60 Gemcitabine is the first-line chemotherapeutic drug for pancreatic cancer, but its efficacy is limited by drug resistance. Fructose-1,6-bisphosphatase (FBP1) competes with ERK1/2 for binding to the WW domain of IQGAP1, thereby inhibiting ERK1/2 phosphorylation. A small peptide inhibitor derived from FBP1 can eliminate gemcitabine-induced ERK activation, enhancing its efficacy ( 61 59 IQGAP1 promotes pancreatic cancer progression by increasing the levels of DVL2 protein, enhancing the canonical Wnt/β-catenin pathway 62 63 Pro-inflammatory cytokines are also drivers of tumor metastasis and invasion. IL-6 signaling STAT3 pathway IL-6-dependent CDC42 signaling 64 3.3.5 Gastric cancer In 2022, there were over 968,000 new cases of gastric cancer and nearly 660,000 deaths, ranking fifth globally in both incidence and mortality ( 32 65 66 IQGAP1 also acts as a scaffold protein regulating alternative splicing (AS) of different gene subgroups in gastric cancer cells. It participates in AS regulation that significantly impacts mitochondrial respiration, altering the activity of mitochondrial respiratory chain complex I (CI), thereby conferring proliferative advantages, drug resistance, and other malignant characteristics to gastric cancer cells ( 67 Recent studies have discovered other molecular partners involved in IQGAP1-mediated migration and invasion of gastric cancer cells. One study found an interaction between pepsinogen (PGC) and IQGAP1, with a significant negative correlation between their expressions in gastric cancer cells. Overexpression of PGC markedly reduces the half-life of IQGAP1 and inhibits the Rho-GTPase regulatory network, thereby suppressing cell migration and proliferation ( 68 69 ASAP1 (Arf GTPase-activating protein 1), a marker of malignant tumors, regulates the cytoskeleton to promote tumor cell metastasis and invasion ( 70 In vivo 71 EGFR-MAPK signaling 72 Menin has been found to interact with IQGAP1, enhancing cell adhesion while reducing cell metastasis and invasion ( 73 PI3K NF-κB 74 In recent years, molecules such as Rho family proteins, PGC, ASAP1, and menin have been shown to interact with IQGAP1, either enhancing or inhibiting its activity. Further elucidating the mechanisms of IQGAP1 in gastric cancer progression and incorporating these findings into targeted therapies to enable early detection and improved prognosis for gastric cancer patients will remain a critical area of research. 3.3.6 Colorectal cancer With healthier lifestyles and the gradual lowering of the age for colorectal cancer screening via colonoscopy, the incidence of colorectal cancer has begun to decline in many high-incidence countries. However, colorectal cancer remains the third most common cancer worldwide, with its mortality rate ranking second ( 32 75 ERK pathway MAPK/ERK signaling pathway 76 77 in vivo IQGAP1/Rac1/ERK signaling pathway ( 78 The tumor microenvironment (TME) plays a crucial role in cancer development and progression, participating in immune cell activation and recruitment, angiogenesis, and extracellular matrix remodeling. It is closely associated with patient prognosis and serves as an important target for therapeutic research ( 79 ERK1/2 pathway 80 81 In terms of treatment, the primary approach for colorectal cancer remains surgery combined with chemotherapy. However, the effectiveness of chemotherapy is limited by drug resistance. For instance, CRC resistant to the chemotherapy drug Vemurafenib exhibits increased invasiveness, likely due to the reactivation of the MAPK/ERK pathway ( 82 ERK pathway signaling 29 83 The development, metastasis, and clinical drug resistance of colorectal cancer are all closely related to the IQGAP1/ERK pathway ERK pathway ERK signaling pathway 3.3.7 Glioma Gliomas are the most common primary malignant intracranial tumors, and patients generally have a poor prognosis. Gliomas are classified into pathological grades (WHO CNS5): Grade 1, typically low-grade, includes pilocytic astrocytomas; Grade 2 is low-grade but diffusely infiltrative; Grade 3 includes anaplastic astrocytomas and anaplastic ependymomas; and Grade 4 includes glioblastoma. Grades 1–2 are considered low-grade gliomas, while Grades 3–4 are high-grade gliomas. Molecular pathological classification based on tumor genetics also plays a critical role in determining clinical prognosis ( 84 The molecular targets and pathways involved in glioblastoma include the epidermal growth factor receptor (EGFR)-mediated PI3K/Akt MAPK pathways mTOR/PI3K/Akt pathway NF-Kb the JAK/STAT pathway ( 85 86 In vivo 87 The expression of IQGAP1 is positively correlated with CDC42, Ih promotes tumor malignancy ( 88 89 90 The primary treatment for gliomas Is surgical resection, combined with radiotherapy and chemotherapy. However, chemoresistance limits treatment efficacy, and the blood-brain barrier restricts the use of small-molecule drugs. Molecular markers have significant clinical value for personalized treatment and prognosis evaluation. To overcome the limitations of molecular therapies, studies have found that certain peptides (such as insulin receptor, transferrin, and EGFR peptides) can cross the blood-brain barrier through receptor-mediated endocytosis and bind to IQGAP1 ( 91 miR-124, which is abundantly expressed in normal brain tissue but significantly downregulated in glioma cells, has been shown to target IQGAP1 and regulate downstream signaling to inhibit glioma cell migration and invasion ( 92 the mTOR/Akt pathway 93 The above biomolecules Interact with IQGAP1 to regulate glioma cell proliferation. However, challenges such as the blood-brain barrier and drug resistance remain significant hurdles. Developing novel targeted therapies through IQGAP1 continues to be a formidable but promising research endeavor (  Table 1 Table 1 The specific functions of IQGAP1. Disease Related pathways/molecules Effect on disease Potential therapeutic directions Ref Head and Neck Cancer PI3K/AKT/mTOR pathway; Drives aberrant splicing events; Targeting IQGAP1/PI3K signaling axis ( 33 36 Breast Cancer RhoA/RhoC/CDC42; Activates actin reorganization; Small-molecule inhibitors (blocking IQGAP1-CDC42 interaction) ( 18 38 41 Hepatocellular Carcinoma Wnt/β-catenin pathway; Rac1/ROS/Src/FAK pathway; Promotes β-catenin transcription and nuclear translocation; CRISPR-based IQGAP1/FOXM1 delivery system ; ( 28 51 53 Pancreatic Cancer KRAS/MAPK pathway; Promoves invasive pseudopodia formation ;Enhances EMT ; FBP1-derived peptide blocking ERK activation; Targeting MIB1-IQGAP1 axis ( 58 61 63 64 Gastric Cancer RhoC/cell cycle proteins; ASAP1/CDC42; Accelerates G1/S phase transition; PGC overexpression; ( 66 68 71 72 74 Colorectal Cancer MAPK/ERK pathway; PLS1/Rac1/ERK axis; Activates ERK phosphorylation; Targeting ARF1-IQGAP1 (LY2839219); ( 77 80 Glioma CDC42/TRIM56 ubiquitination; miR-124 targeting inhibition; Drives malignant progression; miR-124 mimics ; ( 89 93 4 Role of IQGAP1 in immune regulation 4.1 Interaction of IQGAP1 with immune receptors 4.1.1 cGAS-STING pathway and NLRP3 activation IQGAP1 plays a role in immune regulation by promoting the release of mitochondrial DNA (mtDNA) into the cytoplasm, which activates the cGAS-STING pathway 94 4.1.2 CXCR4 and chemotaxis IQGAP1 is involved in immune cell migration through its interaction with CXCR4, a chemokine receptor. It is essential for the surface expression and signaling of CXCR4 in neutrophils, influencing cell migration and immune responses. IQGAP1’s scaffold function regulates CXCR4 transport and recycling, playing a key role in immune cell trafficking during inflammation ( 21 4.1.3 CD11c and neutrophil function IQGAP1 interacts directly with CD11c, an adhesion molecule critical for neutrophil function. In neutrophils, IQGAP1 modulates ROS generation, phagocytosis, and extracellular trap formation, highlighting its involvement in neutrophil activation and immune defense ( 95 4.1.4 Rap1 and immune signaling IQGAP1 binds to Rap1, a small GTPase involved in cell adhesion and migration. This interaction is crucial for regulating immune cell migration and function. By influencing Rap1 activation, IQGAP1 modulates processes such as cytokine secretion and immune cell adhesion, which are vital for proper immune responses ( 96 4.2 IQGAP1 in immune diseases 4.2.1 IQGAP1 and inflammatory diseases IQGAP1 interacts with the OX40 receptor (CD134), a co-stimulatory molecule essential for T cell immune responses, and regulates T cell proliferation and cytokine secretion. In the absence of IQGAP1, OX40-induced T cell proliferation and cytokine secretion are enhanced, indicating its role as a negative regulator of T cell activation. Moreover, IQGAP1-deficient mice exhibit exacerbated experimental autoimmune encephalomyelitis (EAE), further emphasizing its critical role in limiting T cell-mediated inflammation ( 9  Figure 3 Figure 3 IQGAP1 in immune regulation. This figure outlines the diverse roles of IQGAP1 in regulating immune cell function across different contexts. (A) (B) (C) (D) Diagram illustrating the roles of IQGAP1 in immune responses. Panel A shows IQGAP1 regulating T cell activation via OX40 and CD134. Panel B depicts IQGAP1's role in CXCR4-mediated chemotaxis, affecting SDF-1-driven migration. Panel C explains IQGAP1's control of NETosis and ROS in neutrophils. Panel D highlights IQGAP1's upregulation and anti-inflammatory effects in macrophages infected with mycobacteria. The central image displays various immune cells, including T cells, B cells, and macrophages. 4.2.2 IQGAP1 in neutrophil function IQGAP1 is crucial for neutrophil function, especially in processes like ROS generation, phagocytosis, and the formation of extracellular traps. IQGAP1 deficiency leads to impaired neutrophil maturation and functionality, underscoring its importance in neutrophil-mediated immune responses ( 95 4.2.3 IQGAP1 in leukocyte transmigration IQGAP1 plays an essential role in the transendothelial migration (TEM) of leukocytes, a critical step in the immune response to inflammation. Its absence disrupts the recruitment of leukocytes to sites of inflammation by affecting the localization and movement of the lateral border recycling compartment (LBRC) in endothelial cells ( 97 4.2.4 IQGAP1 in tuberculosis During mycobacterial infections like TB, IQGAP1 modulates the inflammatory response. It helps control MKK3 signaling 98 5 Role of IQGAP1 in metabolic diseases Recent research has shed light on the complex involvement of IQGAP1 in various metabolic diseases. Here, we explore the potential mechanisms through which IQGAP1 influences metabolic disorders, with a focus on its regulation of key metabolic pathways and its implications in diseases such as diabetes, obesity, cardiovascular disease, non-alcoholic fatty liver disease (NAFLD), and osteoporosis. 5.1 IQGAP1 and the AMPK signaling pathway One of the most well-characterized functions of IQGAP1 is its involvement in regulating the AMP-activated protein kinase (AMPK) signaling pathway AMPK AMPK AMPK 99 5.2 IQGAP1 in diabetic kidney disease In diabetic kidney disease (DKD), a complication of long-term diabetes, IQGAP1 has been implicated in the progression of renal injury. High glucose conditions induce the overexpression of IQGAP1, which interacts with the renin-angiotensin system (RAS) to modulate renal function. Specifically, IQGAP1 regulates the internalization of renin in podocytes, contributing to the pathogenesis of kidney fibrosis and glomerulosclerosis. These findings suggest that IQGAP1 may exacerbate renal damage in diabetes and could be a potential therapeutic target for preventing or slowing DKD progression ( 4 5.3 IQGAP1 and osteoporosis IQGAP1 has been implicated in the regulation of bone metabolism, particularly in bone formation. Osteoporosis, characterized by reduced bone mass and increased fracture risk, is a metabolic bone disease influenced by both genetic and environmental factors. IQGAP1 regulates osteoblast differentiation and bone mineralization through its interaction with the SMAD2/3 signaling pathway transforming growth factor-beta (TGF-β) signaling 100 5.4 Chronic pain In addition to playing a crucial role in tumor progression, IQGAP1 is involved in other biological processes. Recent studies suggest that IQGAP1 may have a role in the development of pain. A genome-wide association study reported that two loci, IQGAP1 and CRTC3, are significantly associated with chronic postoperative pain three months after surgery ( 101 + + 102 Additionally, a new study reported that IQGAP1 is involved in the addiction and cognitive side effects of opioid drugs such as morphine. In comparative experiments and luciferase assays involving morphine-dependent and non-dependent patients, researchers found that morphine-dependent patients exhibited high levels of miR-124 and low levels of IQGAP1. This suggests that miR-124-mediated downregulation of IQGAP1 could be a key factor in the cognitive deficits associated with opioid addiction. It is likely that IQGAP1 may influence synaptic plasticity and neuroinflammation, both of which play roles in addiction and cognitive function ( 103 6 Conclusion IQGAP1 is a versatile scaffold protein that plays a critical role in regulating cellular processes including cytoskeletal dynamics, signal transduction, and cellular interactions, thereby influencing fundamental cellular behaviors such as migration, proliferation, and differentiation. It serves as a key intermediary in a variety of signaling networks, interacting with small GTPases, receptor tyrosine kinases, and other regulatory proteins to control essential cellular functions. Beyond its roles in normal cellular physiology, IQGAP1 has been implicated in a range of pathological conditions, including various cancers, immune diseases, metabolic disorders, and cardiovascular conditions. Its multifaceted nature makes it an attractive target for therapeutic intervention. In cancer, IQGAP1 is involved in promoting tumor growth, metastasis, and resistance to chemotherapy and targeted therapies. As cancer therapies face the growing challenge of drug resistance, targeting IQGAP1 could offer a novel strategy for overcoming this hurdle. In addition to its role in cancer, IQGAP1 is implicated in immune system modulation, particularly in autoimmune diseases where its regulatory functions may affect the development and progression of inflammation and immune responses. Furthermore, IQGAP1’s role in cellular metabolism and energy balance suggests its potential as a target for metabolic disorders, such as obesity and diabetes, where its involvement in signaling pathways related to insulin resistance and cell survival is critical. While our understanding of IQGAP1’s biology has advanced, important questions remain. These include how it achieves signaling specificity in diverse tissues, how regulatory mechanisms such as post-translational modifications shape its context-dependent functions, and whether its pathological roles can be selectively targeted without compromising physiological ones. Recent interest in modulating scaffold proteins has opened avenues for targeting IQGAP1’s disease-specific interactions. Although it lacks intrinsic enzymatic activity, emerging tools such as interface inhibitors, molecular degraders, and peptidomimetics may offer routes to selectively disrupt pathogenic complexes. Therapeutic development in this space remains early-stage, but shows growing potential—especially if coupled with biomarker-guided patient selection and insights into disease context. Translating these findings into clinical applications will require bridging several methodological gaps. These include the generation of tissue-specific and inducible IQGAP1 knockout models, high-resolution structural analyses of its functional domains in disease states, and systematic mapping of its interactome using advanced spatial proteomics. Moreover, identifying robust biomarkers of IQGAP1 dependency will be essential for stratifying patients and optimizing therapeutic efficacy. In conclusion, IQGAP1 represents a versatile regulatory hub with broad translational potential. As mechanistic insights deepen and novel targeting strategies mature, IQGAP1-based interventions may emerge as powerful tools in addressing unmet clinical needs across cancer, metabolic disorders, immune dysregulation, and beyond. Abbreviations IQGAP1, IQ motif containing GTPase-activating protein 1; CHD, calmodulin homology domain; GRD, Ras GAP-related domain; RGCT, C-terminal Ras GAP domain; VEGF, vascular endothelial growth factor; GAPs, GTPase-activating proteins; HCC, hepatocellular carcinoma; HBV, hepatitis B virus; ASAP1, Arf GTPase-activating protein 1; DKD, diabetic kidney disease; ROS, reactive oxygen species. Author contributions SZ: Writing – original draft. YZ: Writing – original draft, Writing – review & editing. JG: Writing – review & editing. WM: Writing – review & editing. LL: Writing – review & editing. RL: Writing – original draft, Writing – review & editing. JK: Writing – original draft, Writing – review & editing. KZ: Writing – review & editing. JZ: Writing – review & editing. Conflict of interest The authors declare that the research was conducted in the absence of any commercial or financial relationships that could be construed as a potential conflict of interest. Generative AI statement The author(s) declare that no Generative AI was used in the creation of this manuscript. Any alternative text (alt text) provided alongside figures in this article has been generated by Frontiers with the support of artificial intelligence and reasonable efforts have been made to ensure accuracy, including review by the authors wherever possible. If you identify any issues, please contact us. Publisher’s note All claims expressed in this article are solely those of the authors and do not necessarily represent those of their affiliated organizations, or those of the publisher, the editors and the reviewers. Any product that may be evaluated in this article, or claim that may be made by its manufacturer, is not guaranteed or endorsed by the publisher. References 1 Brown MD Sacks DB IQGAP1 in cellular signaling: bridging the GAP Trends Cell Biol 2006 16 242–9 10.1016/j.tcb.2006.03.002 16595175 2 McNulty DE Li Z White CD Sacks DB Annan RS MAPK scaffold IQGAP1 binds the EGF receptor and modulates its activation J Biol Chem 2011 286 15010–21 10.1074/jbc.M111.227694 21349850 PMC3083173 3 Lehtonen S Ryan JJ Kudlicka K Iino N Zhou H Farquhar MG Cell junction-associated proteins IQGAP1, MAGI-2, CASK, spectrins, and alpha-actinin are components of the nephrin multiprotein complex Proc Natl Acad Sci U S A 2005 102 9814–9 10.1073/pnas.0504166102 15994232 PMC1175008 4 Liu Y Su H Ma C Ji D Zheng X Wang P IQGAP1 mediates podocyte injury in diabetic kidney disease by regulating nephrin endocytosis Cell Signal 2019 59 13 23 10.1016/j.cellsig.2019.03.009 30857827 5 Balenci L Saoudi Y Grunwald D Deloulme JC Bouron A Bernards A IQGAP1 regulates adult neural progenitors in vivo in vitro J Neurosci 2007 27 4716–24 10.1523/JNEUROSCI.0830-07.2007 17460084 PMC6672986 6 Yamaoka-Tojo M Ushio-Fukai M Hilenski L Dikalov SI Chen YE Tojo T IQGAP1, a novel vascular endothelial growth factor receptor binding protein, is involved in reactive oxygen species–dependent endothelial migration and proliferation Circ Res 2004 95 276–83 10.1161/01.RES.0000136522.58649.60 15217908 7 Sbroggiò M Carnevale D Bertero A Cifelli G De Blasio E Mascio G IQGAP1 regulates ERK1/2 and AKT signalling in the heart and sustains functional remodelling upon pressure overload Cardiovasc Res 2011 91 456–64 10.1093/cvr/cvr103 21493702 PMC3294280 8 Hedman AC Smith JM Sacks DB The biology of IQGAP proteins: beyond the cytoskeleton EMBO Rep 2015 16 427–46 10.15252/embr.201439834 25722290 PMC4388610 9 Okuyama Y Nagashima H Ushio-Fukai M Croft M Ishii N So T IQGAP1 restrains T-cell cosignaling mediated by OX40 FASEB J 2020 34 540–54 10.1096/fj.201900879RR 31914585 10 Jufvas Å Rajan MR Jönsson C Strålfors P Turkina MV Scaffolding protein IQGAP1: an insulin-dependent link between caveolae and the cytoskeleton in primary human adipocytes Biochem J 2016 473 3177–88 10.1042/BCJ20160581 27458251 11 Chawla B Hedman AC Sayedyahossein S Erdemir HH Li Z Sacks DB Absence of IQGAP1 protein leads to insulin resistance J Biol Chem 2017 292 3273–89 10.1074/jbc.M116.752642 28082684 PMC5336162 12 Zhou H Yao C Bian A Qian J Zhao X Zhao Y The Ras GTPase-activating-like protein IQGAP1 is downregulated in human diabetic nephropathy and associated with ERK1/2 pathway activation Mol Cell Biochem 2014 391 21–5 10.1007/s11010-014-1982-x 24488174 13 Smith JM Hedman AC Sacks DB IQGAPs choreograph cellular signaling from the membrane to the nucleus Trends Cell Biol 2015 25 171–84 10.1016/j.tcb.2014.12.005 25618329 PMC4344846 14 Roy M Li Z Sacks DB IQGAP1 is a scaffold for mitogen-activated protein kinase signaling Mol Cell Biol 2005 25 7940–52 10.1128/MCB.25.18.7940-7952.2005 16135787 PMC1234344 15 Choi S Hedman AC Sayedyahossein S Thapa N Sacks DB Anderson RA Agonist-stimulated phosphatidylinositol-3,4,5-trisphosphate generation by scaffolded phosphoinositide kinases Nat Cell Biol 2016 18 1324–35 10.1038/ncb3441 27870828 PMC5679705 16 Liang Z Yang Y He Y Yang P Wang X He G SUMOylation of IQGAP1 promotes the development of colorectal cancer Cancer Lett 2017 411 90–9 10.1016/j.canlet.2017.09.046 28987385 17 Chen Y Mei J Zhang P Liu J Chen L Wu L IQGAP1 is positively correlated with PD-L1 and regulates its expression via mediating STAT proteins phosphorylation Int Immunopharmacol 2022 108 108897 10.1016/j.intimp.2022.108897 35729832 18 Erdemir HH Li Z Sacks DB IQGAP1 binds to estrogen receptor-α and modulates its function J Biol Chem 2014 289 9100–12 10.1074/jbc.M114.553511 24550401 PMC3979404 19 Thines L Li Z Sacks DB IQGAP1 is a phosphotyrosine-regulated scaffold for SH2-containing proteins Cells 2023 12 14–15 10.3390/cells12030483 36766826 PMC9913818 20 Malarkannan S Awasthi A Rajasekaran K Kumar P Schuldt KM Bartoszek A IQGAP1: a regulator of intracellular spacetime relativity J Immunol 2012 188 2057–63 10.4049/jimmunol.1102439 22345702 PMC3286039 21 Bamidele AO Kremer KN Hirsova P Clift IC Gores GJ Billadeau DD IQGAP1 promotes CXCR4 chemokine receptor function and trafficking via EEA-1+ endosomes J Cell Biol 2015 210 257–72 10.1083/jcb.201411045 26195666 PMC4508899 22 White CD Erdemir HH Sacks DB IQGAP1 and its binding proteins control diverse biological functions Cell Signal 2012 24 826–34 10.1016/j.cellsig.2011.12.005 22182509 PMC3268868 23 Cerutti C Lucotti S Menendez ST Reymond N Garg R Romero IA IQGAP1 and NWASP promote human cancer cell dissemination and metastasis by regulating β1-integrin via FAK and MRTF/SRF Cell Rep 2024 43 113989 10.1016/j.celrep.2024.113989 38536816 24 Kozlova I Ruusala A Voytyuk O Skandalis SS Heldin P IQGAP1 regulates hyaluronan-mediated fibroblast motility and proliferation Cell Signal 2012 24 1856–62 10.1016/j.cellsig.2012.05.013 22634185 25 Roy M Li Z Sacks DB IQGAP1 binds ERK2 and modulates its activity J Biol Chem 2004 279 17329–37 10.1074/jbc.M308405200 14970219 26 Quinn NP García-Gutiérrez L Doherty C von Kriegsheim A Fallahi E Sacks DB IQGAP1 is a scaffold of the core proteins of the hippo pathway and negatively regulates the pro-apoptotic signal mediated by this pathway Cells 2021 10 4–13 10.3390/cells10020478 33672268 PMC7926663 27 Chen F Zhu HH Zhou LF Wu SS Wang J Chen Z IQGAP1 is overexpressed in hepatocellular carcinoma and promotes cell proliferation by Akt activation Exp Mol Med 2010 42 477–83 10.3858/emm.2010.42.7.049 20530982 PMC2912475 28 Mo CF Li J Yang SX Guo HJ Liu Y Luo XY IQGAP1 promotes anoikis resistance and metastasis through Rac1-dependent ROS accumulation and activation of Src/FAK signalling in hepatocellular carcinoma Br J Cancer 2020 123 1154–63 10.1038/s41416-020-0970-z 32632148 PMC7525663 29 Hu HF Gao GB He X Li YY Li YJ Li B Targeting ARF1-IQGAP1 interaction to suppress colorectal cancer metastasis and vemurafenib resistance J Adv Res 2023 51 135–47 10.1016/j.jare.2022.11.006 36396045 PMC10491971 30 Li X Zhao X Su X Wen J Yang S Qin Y IQGAP1 overexpression attenuates chemosensitivity through YAP-mediated ferroptosis inhibition in esophageal squamous cell cancer cells Arch Biochem Biophys 2024 758 110064 10.1016/j.abb.2024.110064 38897534 31 Holck S Nielsen HJ Hammer E Christensen IJ Larsson LI IQGAP1 in rectal adenocarcinomas: localization and protein expression before and after radiochemotherapy Cancer Lett 2015 356 556–60 10.1016/j.canlet.2014.10.005 25305455 32 Bray F Laversanne M Sung H Ferlay J Siegel RL Soerjomataram I Global cancer statistics 2022: GLOBOCAN estimates of incidence and mortality worldwide for 36 cancers in 185 countries CA Cancer J Clin 2024 74 229–63 10.3322/caac.21834 38572751 33 Wei T Choi S Buehler D Lee D Ward-Shaw E Anderson RA Role of IQGAP1 in papillomavirus-associated head and neck tumorigenesis Cancers (Basel) 2021 13 9–12 10.3390/cancers13092276 34068608 PMC8126105 34 Muehlbauer LK Wei T Shishkova E Coon JJ Lambert PF IQGAP1 and RNA splicing in the context of head and neck via phosphoproteomics J Proteome Res 2022 21 2211–23 10.1021/acs.jproteome.2c00309 35980772 PMC9833422 35 Wei T Choi S Buehler D Anderson RA Lambert PF A PI3K/AKT scaffolding protein, IQ motif-containing GTPase associating protein 1 (IQGAP1), promotes head and neck carcinogenesis Clin Cancer Res 2020 26 301–11 10.1158/1078-0432.CCR-19-1063 31597661 PMC6942630 36 Morgan EL Macdonald A Autocrine STAT3 activation in HPV positive cervical cancer through a virus-driven Rac1-NFκB-IL-6 signalling axis PloS Pathog 2019 15 e1007835 10.1371/journal.ppat.1007835 31226168 PMC6608985 37 Deshmukh J Pofahl R Pfister H Haase I Deletion of epidermal Rac1 inhibits HPV-8 induced skin papilloma formation and facilitates HPV-8- and UV-light induced skin carcinogenesis Oncotarget 2016 7 57841–50 10.18632/oncotarget.11069 27506937 PMC5295394 38 Casteel DE Turner S Schwappacher R Rangaswami H Su-Yuo J Zhuang S Rho isoform-specific interaction with IQGAP1 promotes breast cancer cell proliferation and migration J Biol Chem 2012 287 38367–78 10.1074/jbc.M112.377499 22992742 PMC3488105 39 Nobes CD Hall A Rho, rac, and cdc42 GTPases regulate the assembly of multimolecular focal complexes associated with actin stress fibers, lamellipodia, and filopodia Cell 1995 81 53 62 10.1016/0092-8674(95)90370-4 7536630 40 Sayedyahossein S Smith J Barnaeva E Li Z Choe J Ronzetti M Discovery of small molecule inhibitors that effectively disrupt IQGAP1-Cdc42 interaction in breast cancer cells Sci Rep 2022 12 17372 10.1038/s41598-022-21342-w 36253497 PMC9576799 41 Osman MA Antonisamy WJ Yakirevich E IQGAP1 control of centrosome function defines distinct variants of triple negative breast cancer Oncotarget 2020 11 2493–511 10.18632/oncotarget.v11i26 32655836 PMC7335670 42 Iyer VJ Osman MA The antipsychotic drug haldol modulates IQGAP1-signaling and inhibits cell proliferation in triple negative breast cancer cell lines MicroPubl Biol 2023 2023 1–2 10.17912/micropub.biology.000823 37215640 PMC10199339 43 Lee HC Kim M Wands JR Wnt/Frizzled signaling in hepatocellular carcinoma Front Biosci 2006 11 1901–15 10.2741/1933 16368566 44 de La Coste A Romagnolo B Billuart P Renard CA Buendia MA Soubrane O Somatic mutations of the beta-catenin gene are frequent in mouse and human hepatocellular carcinomas Proc Natl Acad Sci U S A 1998 95 8847–51 10.1073/pnas.95.15.8847 9671767 PMC21165 45 Zoheir KM Abd-Rabou AA Harisa GI Ashour AE Ahmad SF Attia SM Gene expression of IQGAPs and Ras families in an experimental mouse model for hepatocellular carcinoma: a mechanistic study of cancer progression Int J Clin Exp Pathol 2015 8 8821–31 26464624 PMC4583856 46 White CD Khurana H Gnatenko DV Li Z Odze RD Sacks DB IQGAP1 and IQGAP2 are reciprocally altered in hepatocellular carcinoma BMC Gastroenterol 2010 10 125 10.1186/1471-230X-10-125 20977743 PMC2988069 47 Schmidt VA Watch the GAP: emerging roles for IQ motif-containing GTPase-activating proteins IQGAPs in hepatocellular carcinoma Int J Hepatol 2012 2012 958673 10.1155/2012/958673 22973521 PMC3438877 48 Dai Q Song F Li X Huang F Zhao H Comprehensive analysis of the expression and prognosis for IQ motif-containing GTPase-activating proteins in hepatocellular carcinoma BMC Cancer 2022 22 1121 10.1186/s12885-022-10204-3 36320006 PMC9628040 49 Schmidt VA Chiariello CS Capilla E Miller F Bahou WF Development of hepatocellular carcinoma in Iqgap2-deficient mice is IQGAP1 dependent Mol Cell Biol 2008 28 1489–502 10.1128/MCB.01090-07 18180285 PMC2258764 50 Xia FD Wang ZL Chen HX Huang Y Li JD Wang ZM Differential expression of IQGAP1/2 in Hepatocellular carcinoma and its relationship with clinical outcomes Asian Pac J Cancer Prev 2014 15 4951–6 10.7314/APJCP.2014.15.12.4951 24998570 51 Jin X Liu Y Liu J Lu W Liang Z Zhang D The overexpression of IQGAP1 and β-catenin is associated with tumor progression in hepatocellular carcinoma in vitro in vivo PloS One 2015 10 e0133770 10.1371/journal.pone.0133770 26252773 PMC4529304 52 Delgado ER Erickson HL Tao J Monga SP Duncan AW Anakk S Scaffolding Protein IQGAP1 Is Dispensable, but Its Overexpression Promotes Hepatocellular Carcinoma via YAP1 Signaling Mol Cell Biol 2021 41 1,7,10 10.1128/MCB.00596-20 33526450 PMC8088129 53 Zoheir KMA Abd-Rabou AA Darwish AM Abdelhafez MA Mahrous KF Inhibition of induced-hepatic cancer in vivo Front Oncol 2022 12 998247 10.3389/fonc.2022.998247 36276098 PMC9581201 54 He C Jaffar Ali D Qi Y Li Y Sun B Liu R Engineered extracellular vesicles mediated CRISPR-induced deficiency of IQGAP1/FOXM1 reverses sorafenib resistance in HCC by suppressing cancer stem cells J Nanobiotechnology 2023 21 154 10.1186/s12951-023-01902-6 37202772 PMC10193671 55 Llovet JM Kelley RK Villanueva A Singal AG Pikarsky E Roayaie S Hepatocellular carcinoma Nat Rev Dis Primers 2021 7 6 10.1038/s41572-020-00240-3 33479224 56 Li S Wang Q Chakladar A Bronson RT Bernards A Gastric hyperplasia in mice lacking the putative Cdc42 effector IQGAP1 Mol Cell Biol 2000 20 697 701 10.1128/MCB.20.2.697-701.2000 10611248 PMC85173 57 Gobbi PG Bergonzi M Comelli M Villano L Pozzoli D Vanoli A The prognostic role of time to diagnosis and presenting symptoms in patients with pancreatic cancer Cancer Epidemiol 2013 37 186–90 10.1016/j.canep.2012.12.002 23369450 58 Harada A Matsumoto S Yasumizu Y Shojima K Akama T Eguchi H Localization of KRAS downstream target ARL4C to invasive pseudopods accelerates pancreatic cancer cell invasion Elife 2021 10 12–14 10.7554/eLife.66721.sa2 34590580 PMC8598236 59 Li JH McMillan RH Begum A Gocke CB Matsui W IQGAP1 maintains pancreatic ductal adenocarcinoma clonogenic growth and metastasis Pancreas 2019 48 94–8 10.1097/MPA.0000000000001198 30540680 PMC6293988 60 Song C Wang G Liu M Han S Dong M Peng M Deciphering the SOX4/MAPK1 regulatory axis: a phosphoproteomic insight into IQGAP1 phosphorylation and pancreatic Cancer progression J Transl Med 2024 22 602 10.1186/s12967-024-05377-3 38943117 PMC11212360 61 Jin X Pan Y Wang L Ma T Zhang L Tang AH Fructose-1,6-bisphosphatase inhibits ERK activation and bypasses gemcitabine resistance in pancreatic cancer by blocking IQGAP1-MAPK interaction Cancer Res 2017 77 4328–41 10.1158/0008-5472.CAN-16-3143 28720574 PMC5581962 62 Hu W Wang Z Zhang S Lu X Wu J Yu K IQGAP1 promotes pancreatic cancer progression and epithelial-mesenchymal transition (EMT) through Wnt/β-catenin signaling Sci Rep 2019 9 7539 10.1038/s41598-019-44048-y 31101875 PMC6525164 63 Zhang B Cheng X Zhan S Jin X Liu T MIB1 upregulates IQGAP1 and promotes pancreatic cancer progression by inducing ST7 degradation Mol Oncol 2021 15 3062–75 10.1002/1878-0261.12955 33793053 PMC8564634 64 Razidlo GL Burton KM McNiven MA Interleukin-6 promotes pancreatic cancer cell migration by rapidly activating the small GTPase CDC42 J Biol Chem 2018 293 11143–53 10.1074/jbc.RA118.003276 29853638 PMC6052214 65 Arnold M Park JY Camargo MC Lunet N Forman D Soerjomataram I Is gastric cancer becoming a rare disease? A global assessment of predicted incidence trends to 2035 Gut 2020 69 823–9 10.1136/gutjnl-2019-320234 32001553 PMC8520492 66 Wu Y Tao Y Chen Y Xu W RhoC regulates the proliferation of gastric cancer cells through interaction with IQGAP1 PloS One 2012 7 e48917 10.1371/journal.pone.0048917 23145020 PMC3492142 67 Papadaki V Erpapazoglou Z Kokkori M Rogalska ME Potiri M Birladeanu A IQGAP1 mediates the communication between the nucleus and the mitochondria via NDUFS4 alternative splicing NAR Cancer 2023 5 zcad046 10.1093/narcan/zcad046 37636315 PMC10448856 68 Ding H Liu Y Lu X Liu A Xu Q Yuan Y Pepsinogen C interacts with IQGAP1 to inhibit the metastasis of gastric cancer cells by suppressing rho-GTPase pathway Cancers (Basel) 2024 16 5, 11 10.3390/cancers16101796 38791874 PMC11120368 69 Cai Q Zhu C Yuan Y Feng Q Feng Y Hao Y Development and validation of a prediction rule for estimating gastric cancer risk in the Chinese high-risk population: a nationwide multicentre study Gut 2019 68 1576–87 10.1136/gutjnl-2018-317556 30926654 PMC6709770 70 Li X Wang J Mechanical tumor microenvironment and transduction: cytoskeleton mediates cancer cell invasion and metastasis Int J Biol Sci 2020 16 2014–28 10.7150/ijbs.44943 32549750 PMC7294938 71 Gorisse L Li Z Wagner CD Worthylake DK Zappacosta F Hedman AC Ubiquitination of the scaffold protein IQGAP1 diminishes its interaction with and activation of the Rho GTPase CDC42 J Biol Chem 2020 295 4822–35 10.1074/jbc.RA119.011491 32094223 PMC7152761 72 Xie W Han Z Zuo Z Xin D Chen H Huang J ASAP1 activates the IQGAP1/CDC42 pathway to promote tumor progression and chemotherapy resistance in gastric cancer Cell Death Dis 2023 14 124 10.1038/s41419-023-05648-9 36792578 PMC9932153 73 Yan J Yang Y Zhang H King C Kan HM Cai Y Menin interacts with IQGAP1 to enhance intercellular adhesion of beta-cells Oncogene 2009 28 973–82 10.1038/onc.2008.435 19079338 PMC2645484 74 Ren F Guo Q Zhou H Menin represses the proliferation of gastric cancer cells by interacting with IQGAP1 BioMed Rep 2023 18 27 10.3892/br.2023.1609 36909940 PMC9996331 75 Davidson KW Barry MJ Mangione CM Cabana M Caughey AB Davis EM Screening for colorectal cancer: US preventive services task force recommendation statement Jama 2021 325 1965–77 10.1001/jama.2021.6238 34003218 76 Ding C Luo J Li L Li S Yang L Pan H Gab2 facilitates epithelial-tomesenchymal transition via the MEK/ERK/MMP signaling in colorectal cancer J Exp Clin Cancer Res 2016 35 5 10.1186/s13046-015-0280-0 26754532 PMC4709914 77 Hu HF Xu WW Li YJ He Y Zhang WX Liao L Anti-allergic drug azelastine suppresses colon tumorigenesis by directly targeting ARF1 to inhibit IQGAP1-ERK-Drp1-mediated mitochondrial fission Theranostics 2021 11 4 1828-44 10.7150/thno.48698 33408784 PMC7778598 78 Zhang T Wang Z Liu Y Huo Y Liu H Xu C Plastin 1 drives metastasis of colorectal cancer through the IQGAP1/Rac1/ERK pathway Cancer Sci 2020 111 2861–71 10.1111/cas.v111.8 32350953 PMC7419044 79 Roma-Rodrigues C Mendes R Baptista PV Fernandes AR Targeting tumor microenvironment for cancer therapy Int J Mol Sci 2019 20 3–8 10.3390/ijms20040840 30781344 PMC6413095 80 Deng S Cheng D Wang J Gu J Xue Y Jiang Z MYL9 expressed in cancer-associated fibroblasts regulate the immune microenvironment of colorectal cancer and promotes tumor progression in an autocrine manner J Exp Clin Cancer Res 2023 42 294 10.1186/s13046-023-02863-2 37926835 PMC10626665 81 Huang YT Hsu YT Wu PY Yeh YM Lin PC Hsu KF Tight junction protein cingulin variant is associated with cancer susceptibility by overexpressed IQGAP1 and Rac1-dependent epithelial-mesenchymal transition J Exp Clin Cancer Res 2024 43 65 10.1186/s13046-024-02987-z 38424547 PMC10905802 82 Corcoran RB Ebi H Turke AB Coffee EM Nishino M Cogdill AP EGFR-mediated re-activation of MAPK signaling contributes to insensitivity of BRAF mutant colorectal cancers to RAF inhibition with vemurafenib Cancer Discov 2012 2 227–35 10.1158/2159-8290.CD-11-0341 22448344 PMC3308191 83 Zoheir K Mahmoud K Harisa GI Ashour A Abdel-Hamied HE Amara AA Novel approach using shRNA of IQGAP1 for colon cancer therapy: HCT116 as a surrogate model colorectal carcinoma Asian Pac J Cancer Prev 2022 23 2387–95 10.31557/APJCP.2022.23.7.2387 35901346 PMC9727335 84 Louis DN Perry A Wesseling P Brat DJ Cree IA Figarella-Branger D The 2021 WHO classification of tumors of the central nervous system: a summary Neuro Oncol 2021 23 1231–51 10.1093/neuonc/noab106 34185076 PMC8328013 85 Ghosh D Nandi S Bhattacharjee S Combination therapy to checkmate Glioblastoma: clinical challenges and advances Clin Transl Med 2018 7 33 10.1186/s40169-018-0211-8 30327965 PMC6191404 86 Han F Hu R Yang H Liu J Sui J Xiang X PTEN gene mutations correlate to poor prognosis in glioma patients: a meta-analysis Onco Targets Ther 2016 9 3485–92 10.2147/OTT.S99942 27366085 PMC4913532 87 Zhang F Lv M He Y Identification of a novel disulfideptosis-related gene signature for prognostic implication in lower-grade gliomas Aging (Albany NY) 2024 16 6054–67 10.18632/aging.205688 38546389 PMC11042955 88 Cui X Song L Bai Y Wang Y Wang B Wang W Elevated IQGAP1 and CDC42 levels correlate with tumor Malignancy of human glioma Oncol Rep 2017 37 768–76 10.3892/or.2016.5341 28035419 PMC5355752 89 Zhang Q Zheng J Wu W Lian H Iranzad N Wang E TRIM56 acts through the IQGAP1-CDC42 signaling axis to promote glioma cell migration and invasion Cell Death Dis 2023 14 178 10.1038/s41419-023-05702-6 36870986 PMC9985612 90 Okura H Golbourn BJ Shahzad U Agnihotri S Sabha N Krieger JR A role for activated Cdc42 in glioblastoma multiforme invasion Oncotarget 2016 7 56958–75 10.18632/oncotarget.10925 27486972 PMC5302965 91 Lalatsa A Schatzlein AG Uchegbu IF Strategies to deliver peptide drugs to the brain Mol Pharm 2014 11 1081–93 10.1021/mp400680d 24601686 92 Lu SH Jiang XJ Xiao GL Liu DY Yuan XR miR-124a restoration inhibits glioma cell proliferation and invasion by suppressing IQGAP1 and β-catenin Oncol Rep 2014 32 2104–10 10.3892/or.2014.3455 25175832 93 Gao C Liang C Nie Z Liu Y Wang J Zhang D Alkannin inhibits growth and invasion of glioma cells C6 through IQGAP/mTOR signal pathway Int J Clin Exp Med 2015 8 5287–94 26131103 PMC4483937 94 An C Sun F Liu C Huang S Xu T Zhang C IQGAP1 promotes mitochondrial damage and activation of the mtDNA sensor cGAS-STING pathway to induce endothelial cell pyroptosis leading to atherosclerosis Int Immunopharmacol 2023 123 110795 10.1016/j.intimp.2023.110795 37597406 95 Hou L Hsu A Luo H Yuki K IQGAP1 influences neutrophil maturation and its effector functions Eur J Immunol 2025 55 e202451349 10.1002/eji.202451349 39931750 PMC12418024 96 Jeong HW Li Z Brown MD Sacks DB IQGAP1 binds Rap1 and modulates its activity J Biol Chem 2007 282 20752–62 10.1074/jbc.M700487200 17517894 97 Sullivan DP Dalal PJ Jaulin F Sacks DB Kreitzer G Muller WA Endothelial IQGAP1 regulates leukocyte transmigration by directing the LBRC to the site of diapedesis J Exp Med 2019 216 2582–601 10.1084/jem.20190008 31395618 PMC6829592 98 Wen X Li D Wang H Zhang D Song J Zhou Z IQGAP1 domesticates macrophages to favor mycobacteria survival via modulating NF-κB signal and augmenting VEGF secretion Int Immunopharmacol 2024 138 112549 10.1016/j.intimp.2024.112549 38944950 99 Hedman AC Li Z Gorisse L Parvathaneni S Morgan CJ Sacks DB IQGAP1 binds AMPK and is required for maximum AMPK activation J Biol Chem 2021 296 100075 10.1074/jbc.RA120.016193 33191271 PMC7948462 100 Dong H Liu R Zou K Jin Z Kang J Zhang Y Higenamine promotes osteogenesis via IQGAP1/SMAD4 signaling pathway and prevents age- and estrogen-dependent bone loss in mice J Bone Miner Res 2023 38 775–91 10.1002/jbmr.4800 36907987 101 van Reij RRI Hoofwijk DMN Rutten BPF Weinhold L Leber M Joosten EAJ The association between genome-wide polymorphisms and chronic postoperative pain: a prospective observational study Anaesthesia 2020 75 Suppl 1 e111–e20 10.1111/anae.14832 31903573 PMC6973279 102 Khan S Patra PH Somerfield H Benya-Aphikul H Upadhya M Zhang X IQGAP1 promotes chronic pain by regulating the trafficking and sensitization of TRPA1 channels Brain 2023 146 2595–611 10.1093/brain/awac462 36477832 PMC10232262 103 Shi J Chi Y Wang X Zhang Y Tian L Chen Y MiR-124 regulates IQGAP1 and participates in the relationship between morphine dependence susceptibility and cognition Front Psychiatry 2022 13 845357 10.3389/fpsyt.2022.845357 35401251 PMC8983956 ",
  "metadata": {
    "Title of this paper": "MiR-124 regulates IQGAP1 and participates in the relationship between morphine dependence susceptibility and cognition",
    "Journal it was published in:": "Frontiers in Oncology",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12479253/"
  }
}