{
  "title": "Paper_22",
  "abstract": "pmc Mater Today Bio Mater Today Bio 3810 mtbio Materials Today Bio 2590-0064 Elsevier PMC12495234 PMC12495234.1 12495234 12495234 10.1016/j.mtbio.2025.102335 S2590-0064(25)00906-8 102335 1 Full Length Article Electroacupuncture at Huatuo-Jiaji acupoints combined with conductive hydrogel synergistically improves bladder and motor functions after spinal cord injury Zhang Qiang a b c d 1 Wei Feng a d 1 Zhang Lulu d 1 Liang Can a Zhuang Yan d Jiang Ning e Weng Wenjie b Qiu Xusheng b Wang Huiru d Chen Yixin chenyixin93@126.com b ⁎ Dai Jianwu jwdai@genetics.ac.cn a d f ⁎⁎ Shen He meggie128@pumc.edu.cn a d ⁎⁎⁎ a b c d e f ⁎ chenyixin93@126.com ⁎⁎ jwdai@genetics.ac.cn ⁎⁎⁎ meggie128@pumc.edu.cn 1 These authors contributed equally to this work. 12 2025 21 9 2025 35 497120 102335 2 7 2025 8 9 2025 20 9 2025 21 09 2025 05 10 2025 05 10 2025 © 2025 The Authors. Published by Elsevier Ltd. 2025 https://creativecommons.org/licenses/by-nc-nd/4.0/ This is an open access article under the CC BY-NC-ND license (http://creativecommons.org/licenses/by-nc-nd/4.0/). Spinal cord injury (SCI) compromises the electrophysiological properties of tissues and disrupts the electrical transmission pathways, ultimately resulting in motor dysfunction and neurogenic bladder impairment. Therefore, restoration of normal electrophysiological functions in injured spinal cord tissues is crucial for SCI rehabilitation. Electrical stimulation (ES) exhibits therapeutic potential for neurological disorders via neuronal modulation, showing enhanced efficacy in combination with traditional Chinese medicine practices, such as targeted acupuncture. Specifically, acupuncture at Huatuo-Jiaji acupoints, located bilaterally along the vertebral column, exerts neurological regulatory effects. In this study, we developed a dual-modality therapeutic approach combining implantable biomimetic conductive hydrogels for internal ES with electroacupuncture at Huatuo-Jiaji acupoints for external ES to reconstruct the neural electrical microenvironment and synergistically enhance the electrophysiological recovery post-SCI. The engineered conductive hydrogels, fabricated by incorporating carbon nanotubes into photocrosslinkable gelatin matrices, showed dual functionality by facilitating endogenous electrical signal propagation and enhancing the exogenous ES efficacy. This combination therapy significantly attenuated the inflammatory responses and glial scar formation, concurrently promoting axonal regeneration and mitigating demyelination. Functional assessments revealed substantial improvements in both locomotor recovery and neurogenic bladder control in complete spinal cord transection model rats. Mechanistic investigations revealed the downregulation of the Janus kinase–signal transducer and activator of transcription signaling pathway as a key regulator of anti-inflammatory effects of the combination treatment. Overall, our innovative internal–external ES integration strategy offers a promising translational approach for SCI repair by simultaneously enhancing neural regeneration and facilitating functional restoration. Graphical abstract Image 1 Keywords Spinal cord injury Function recovery Electrical stimulation Conductive hydrogel Jiaji acupoints pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement yes pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes 1 Introduction Electrophysiological properties of spinal cord tissues and nerve cells play vital roles in mediating neural signal transmission, thereby governing motor coordination and sensory processing [ 1 2 3 Electrical stimulation (ES) is a promising neuromodulation strategy to restore or modulate the electrical signals post-SCI, thereby creating a favorable environment for neuronal regeneration and functional recovery. Internal and external ES are classified based on their action modes. The former utilizes electroconductive biomaterials to engineer biomimetic three-dimensional scaffolds replicating the native extracellular matrix architecture and providing topographical and electrotactic guidance for neural regeneration. These engineered constructs not only amplify endogenous bioelectrical signaling but also orchestrate cellular responses via spatiotemporally controlled activation of neurons and glia, culminating in accelerated axonal regrowth and circuit formation [ 4 5 External ES improves local blood circulation and metabolic activity, regulates neurotransmitter release, and effectively suppresses inflammatory responses and glial scar formation, thereby promoting neural circuit remodeling and restoring the physiological functions. However, targeting and systematic regulation capacities of ES require improvement. Electroacupuncture (EA) stimulation, synergistic integration of millennia-old acupuncture and modern bioelectronic principles, offers anatomical precision via meridian-specific stimulation. Notably, 50 Hz EA stimulation exerts neuroprotective effects predominantly via nuclear factor erythroid 2-related factor 2-mediated oxidative stress suppression and lysosomal–autophagic flux potentiation in SCI model rats [ 6 7 [8] [9] [10] 11 12 13 To enhance the therapeutic accuracy and effectiveness of ES, we developed an internal and external combination ES strategy by combining conductive hydrogel implantation at the defect site and EA stimulation at the Jiaji acupoints to synergistically reconstruct the neural electrical microenvironments at the injured site, thereby promoting SCI repair. The T8 and T10 Huatuo-Jiaji acupoints were selected based on their neuroanatomical relationship to the T9 injury site and principles of traditional Chinese medicine (TCM). Neuroanatomically, the Jiaji acupoints are located adjacent to the intervertebral foramina, where spinal nerves emerge to innervate both motor and sensory pathways relevant to the T9 lesion level and EA on Jiaji points has been proved can stimulate the appropriate posterior ramus of the spinal nerve originating from the lower vertebrae [ 14 15 16 17 18 19 Fig. 1 Fig. 1 Electroacupuncture (EA) at the Jiaji acupoints combined with conductive hydrogel application synergistically enhances spinal cord injury (SCI) repair by promoting endogenous neural stem cell (NSC) migration and differentiation and axonal growth, regulating inflammatory responses, and suppressing scar formation. Fig. 1 2 Materials and methods 2.1 Conductive hydrogel synthesis and characterization The Gl-C hydrogels were prepared as previously described [ 5 Morphologies, conductivities, and mechanical properties of the Gl-C hydrogels were examined using a scanning electron microscope (Quanta 400 FEG; FEI Company, Oregon, USA), electrochemical workstation (CHI660D; Chenhua Instrument Co., LTD, Shanghai, China), and rheometer (AR2000 MTS; TA Instruments, New Castle, Delaware, USA), respectively. Their biodegradation properties were evaluated as previously described [ 5 2.2 NSC proliferation and differentiation assays NSCs were extracted and cultured as previously described [ 20 21 22 Wnt9a Wnt7a Ngn2 Tables S1 and S2 2.3 Surgical procedure and combined Gl-C hydrogel implantation and EA stimulation at Jiaji acupoints 140 female Sprague–Dawley rats (8–10 weeks old; 200–220 g) were purchased from Shanghai Slaughter Laboratory Animal Co. (China). All animal experiments adhered to the National Institutes of Health Guidelines for the Care and Use of Laboratory Animals and were approved by the Animal Care and Use Committee of the Suzhou Institute of Nano-Tech and Nano-Bionics, Chinese Academy of Sciences (approval number: SINANO/EC/2023-YFC2412502). Complete transection SCI model rats were established as previously described [ 23 24 Rats in the Gl + EA and Gl-C + EA groups were stimulated via EA at the Jiaji acupoints for 30 min per week from day 7 post-surgery. Two sets of acupuncture needles (0.25 mm × 40 mm; Research Taihe; Changchun Aikang Medical Equipment Co., Ltd., China) were vertically inserted into the Jiaji acupoints located adjacent to the 8th and 10th thoracic vertebrae ( Fig. 1 2.4 Electric field detection in SCI rats Neurostim-8 probe (Nanjing Changxiang Medical Technology Co., Ltd., China) was used to record the electrophysiological signals in the injured and treated spinal cord, and bladder tissues during applying EA at the Jiaji acupoints. Recordings from each SCI rat were repeated at least three times, and the waveform morphology consistency was verified in trials. 2.5 Histological analyses Ten day and eight weeks after treatment, spinal cord samples were harvested as previously described [ 25 Table S2 2.6 Evaluation of functional restoration Locomotor function recovery was evaluated using the Basso–Beattie–Bresnahan (BBB) scale [ 26 26 27 2.7 Transcriptome sequencing analysis After eight weeks of treatment, spinal cord tissue samples were collected from the injured site, spanning 8 mm rostral and caudal to the lesion site. RNA-seq was performed to elucidate the potential molecular mechanisms. Spinal cord samples of the Gl-C and Gl-C + EA groups were preserved using the TRIzol Reagent (Thermo Fisher Scientific). Transcriptome sequencing analysis was performed by OE Biotech Co., Ltd. (Shanghai, China). RNA was extracted using standard methods, and quality control was performed using the NanoDrop 2000 spectrophotometer (Thermo Scientific, USA). RNA integrity was assessed with the Agilent 2100 Bioanalyzer (Agilent Technologies, Santa Clara, CA, USA). Subsequently, libraries were constructed using the VAHTS Universal V6 RNA-seq Library Prep Kit, and sequenced on the Illumina NovaSeq 6000 platform, generating 150 bp paired-end reads. Gene expression levels were normalized to fragments per kilobase of transcript per million mapped reads (FPKM) using Cufflinks, while raw read counts were quantified with HTSeq-count. Differential expression analysis was conducted using the DESeq2 package, applying a significance threshold of p < 0.05 to identify statistically significant genes. To visualize expression profiles, hierarchical clustering was applied to the differentially expressed genes. Furthermore, functional enrichment analyses, including Gene Ontology (GO) and Kyoto Encyclopedia of Genes and Genomes (KEGG) pathways, were carried out in R using a hypergeometric distribution-based approach. 2.8 Statistical analyses Data are represented as the mean ± standard deviation. All results were statistically analyzed via independent t p p p p 3 Results 3.1 Conductive hydrogels regulate the NSC fate Physicochemical properties of the conductive Gl-based hydrogels modified with varying CNT concentrations were characterized. Scanning electron microscopy (SEM) analysis revealed that the Gl-C hydrogels exhibited an interpenetrating porous structure (pore size: 40–120 μm; Fig. 2 Fig. S1A–D Fig. 2 Fig. 2 Fig. 2 Fig. 2 Characterization of Gl-C hydrogels. p Fig. 2 Biocompatibility assays confirmed the non-cytotoxicity of the Gl-C20/40/80 scaffolds to NSCs ( Fig. S1E + Fig. 3 + Ngn2 Wnt7a Wnt9a Fig. 3 Fig. 3 Effects of Gl-C hydrogels on NSC migration and differentiation. + + + + p p p p Ngn2 Wnt7a Wnt9a p p p + + p Fig. 3 Next, we investigated the effects of Gl-C hydrogels on endogenous NSC migration and neurogenesis using complete transection SCI rat model. Nestin, an NSC marker, was used to detect the SCI-activated endogenous NSCs, which play a critical role in replacing the lost neural cells via proliferation and differentiation. Both immunofluorescence imaging and quantitative analysis revealed that the fluorescence intensity of nestin-positive cells in the lesion area was significantly higher in the hydrogel transplantation groups than in the SCI group ten days post-surgery ( Fig. 3 + Fig. 3 + Fig. 3 3.2 EA stimulation enhances the conductive hydrogel-mediated electrical conduction at the spinal cord and bladder Electrophysiological assessments were conducted to evaluate the spinal cord and bladder voltages by recording the electrical signals at both sites during EA treatment seven days post-surgery ( Fig. 4 Fig. S2 p p Fig. 4 28 p p Fig. 4 Fig. 4 Amplitude measurements in the spinal cord and bladder with EA treatment at seven days post-surgery. p p Fig. 4 3.3 EA stimulation improves conductive hydrogel-mediated neural regeneration After eight weeks of treatment with the conductive hydrogels and EA stimulation, major organs, including the heart, liver, spleen, lungs, and kidneys, were harvested from the rats, and hematoxylin and eosin (H&E) staining was performed to assess inflammation. As shown in Fig. S3–S6 Fig. S7 Conductive hydrogels were implanted into the spinal cords with complete defects, and spinal cord regeneration was evaluated eight weeks post-surgery. In the SCI, Gl, and Gl + EA groups, spinal cord defects remained clearly visible with distinct boundaries, indicating limited regeneration. In contrast, Gl-C40 group showed no obvious defects and smooth surface morphology at the injury site. Gl-C40 + EA group exhibited more extensive tissue regeneration in the defect area than the scaffold-only group with blurred boundary lines, suggesting improved tissue integration and repair ( Fig. 5 Fig. 5 EA stimulation at the Jiaji points significantly enhances the effects of the conductive hydrogels on axon regeneration and demyelination suppression eight weeks post-surgery. + p p p p p p Fig. 5 Neurofilament (NF) staining was performed to histologically evaluate axonal regeneration. As shown in Fig. 5 Fig. 5 Fig. 5 3.4 Combined EA stimulation and Gl-C40 hydrogel application suppresses inflammation and scar formation Inflammation typically induces secondary damage and impedes neural recovery following SCI. Histological analysis revealed that inflammatory cell infiltration, tissue edema, and fibrosis at the center of the spinal cord lesion were most severe in the SCI group but showed progressive attenuation in the Gl, Gl-C40, and Gl + EA groups, with no detectable pathological features observed in the Gl-C40 + EA group ( Fig. 6 Fig. S8 Fig. 6 EA enhances the anti-inflammatory and anti-scarring effects of the Gl-C40 hydrogel. + p p p Fig. 6 Formation of a chronic glial scar, a physical barrier to axonal regrowth [ 29 + + Fig. 6 p 3.5 Combination treatment synergistically improves the locomotor and bladder functions Functional motor recovery in rats was systematically evaluated via footprint analysis, BBB locomotor rating, and inclined plane testing. In the SCI group, hindlimb muscle strength was severely compromised, with a complete loss of anti-gravity function. Although rats in the Gl group demonstrated resistance movement at the distal joints, their overall muscle strength remained suboptimal. Moderate improvements were observed in the Gl-C40 and Gl + EA groups, with both the proximal and distal joints exhibiting resistance capacity. Remarkably, Gl-C40 + EA group showed intermittent weight-bearing locomotion in the hindlimbs accompanied by coordinated forelimb movement ( Fig. 7 Fig. 7 Fig. 7 Fig. 7 EA combined with Gl-C40 hydrogel synergistically promotes motor and bladder function recovery. p p p p p p Fig. 7 Normal micturition requires precise coordination between bladder detrusor contraction and urethral sphincter relaxation mediated by the supraspinal neural circuits [ 30 31 Fig. 7 Fig. 7 Fig. S9A and B Fig. 7 Fig. S9C–F 3.6 Transcriptomic characteristics of the EA and conductive hydrogel combination treatment in SCI repair To investigate the potential therapeutic SCI repair mechanisms of the combined treatment, we performed RNA-seq analysis of the injured spinal cord tissues eight weeks post-treatment. Differential gene expression analysis revealed 850 significantly altered genes in the Gl-C40 + EA group compared to those in the Gl-C40 group (log 2 Fig. 8 Fig. 8 EA combined with conductive hydrogel scaffold reduces the pro-inflammation and promotes nerve regeneration. Il13ra2 Il23a Lif p p Fig. 8 Multimodal functional analysis combining KEGG pathway enrichment and gene set enrichment analysis revealed the dual effects of the combined treatment on the neural and immune systems. KEGG analysis indicated that the downregulated genes were predominantly associated with immune response pathways (e.g., Th17 differentiation) and pathological processes, whereas the upregulated genes were clustered in neural circuit remodeling pathways, including neuroactive ligand–receptor interactions, synaptic vesicle cycling, and GABAergic/glutamatergic synapse regulation pathways ( Fig. 8B– Fig. 8 Fig. 8 In addition to promoting neuroregeneration, Gl-C40 + EA regimen significantly attenuated secondary injuries via immune–inflammatory pathway regulation. Key inflammatory mediators ( Il13ra2 Il23a Lif 2 Fig. 8 Fig. 8 Fig. S10 Fig. S11 Fig. 8 These multi-omics findings establish a mechanistic framework wherein Gl-C40 + EA combination therapy downregulates the immune–inflammatory cascades to mitigate secondary damage and upregulates neural plasticity programs via 1) synaptogenesis enhancement by neuroactive ligand–receptor systems, 2) axon regeneration potentiation via MAPK/BNDF–TrkB signaling, and 3) GABAergic circuit stabilization to prevent pathological hyperexcitability. This dual-axis regulation creates a permissive microenvironment for structural and functional neural recovery. Through comprehensive transcriptomic deconvolution, we demonstrated that combined Gl-C40 hydrogel and Jiaji-EA stimulation promoted synergistic neural recovery via immunomodulation and neural restoration. Our findings provide a rationale for the development of novel bioelectronic hydrogel therapies targeting neural repair and immune modulation for SCI management. 4 Discussion Despite concerns regarding their biocompatibility, carbon-based nanoparticles show promise for neural tissue engineering. In this study, CNTs were functionalized to improve their dispersibility and reduce cytotoxicity, as shown in our previous in vitro and in vivo tests [ 5 32 The naive spinal cord tissue exhibits electrical conductivity as endogenous bioelectrical signals are essential for maintaining the neuronal functions and facilitating axonal growth [ 33 34 2+ 35 5 36 37 38 Conductive hydrogel combined with ES promotes NSC differentiation into neurons while inhibiting astrocyte proliferation [ 39 6 40 41 42 43 44 The pro-inflammatory microenvironment post-SCI exacerbates scarring and impedes axonal regeneration. Our study demonstrated that EA at the Jiaji acupoints combined with conductive hydrogel markedly reduced neuroinflammation. Transcriptome analysis further revealed the downregulation of JAK/STAT signaling, a key macrophage/microglial polarization and inflammatory response regulator. Western blot analysis of the p-JAK2 and p-STAT3 will be carried out in future study. In addition, a recent study has proven that in a construction of rat SCI model, the electroacupuncture at Jiaji acupoints regulated JAK-STAT signaling pathway. The western blot results showed that the expression levels of p-JAK2 and p-STAT3 decreased in the Jiaji EA group compared to those in the SCI group, indicating the inhibition of the activation of the JAK2/STAT3 pathway [ 45 46 47 48 5 Conclusion In summary, a Gl-C40 hydrogel was synthesized and applied with EA stimulation at the Jiaji acupoints to facilitate tissue regeneration following SCI by establishing a continuous conductive circuit within the damaged spinal cord of rats. Combined application of the Gl-C40 hydrogel and EA treatment significantly modulated the inflammatory responses, enhanced endogenous neural regeneration, promoted axonal growth and myelination, ameliorated neurogenic bladder dysfunction by reconstructing the neural circuits, inhibited bladder fibrosis, and improved the locomotor function recovery. These effects were potentially mediated by the EA-induced upregulation of neural plasticity-related pathways and inhibition of the JAK/STAT signaling pathway. Collectively, our results suggest that maintaining a permissive biophysical microenvironment with electroactive stimulation is crucial for SCI repair. This innovative combinatorial approach integrating EA stimulation at the Jiaji acupoints with conductive hydrogel provides a novel avenue to enhance central nervous system regeneration for neural tissue engineering. CRediT authorship contribution statement Qiang Zhang: Feng Wei: Lulu Zhang: Can Liang: Yan Zhuang: Ning Jiang: Wenjie Weng: Xusheng Qiu: Huiru Wang: Yixin Chen: Jianwu Dai: He Shen: Declaration of competing interest The authors declare no competing financial interest. Declaration of competing interest The authors declare that they have no known competing financial interests or personal relationships that could have appeared to influence the work reported in this paper. References 1 Guo J. Cao J. Wu J. Gao J. Electrical stimulation and conductive materials: electrophysiology-based treatment for spinal cord injury Biomater. Sci. 12 22 2024 5704 5721 10.1039/d4bm00959b 39403758 2 Shimizu N. Saito T. Wada N. Hashimoto M. Shimizu T. Kwon J. Cho K.J. Saito M. Karnup S. de Groat W.C. Yoshimura N. Molecular mechanisms of neurogenic lower urinary tract dysfunction after spinal cord injury Int. J. Mol. Sci. 24 9 2023 10.3390/ijms24097885 PMC10177842 37175592 3 Bushnell J.Y. Cates L.N. Hyde J.E. Hofstetter C.P. Yang C.C. Khaing Z.Z. Early detrusor application of botulinum toxin A results in reduced bladder hypertrophy and fibrosis after spinal cord injury in a rodent model Toxins 14 11 2022 10.3390/toxins14110777 PMC9697114 36356027 4 Zhao G. Zhou H. Jin G. Jin B. Geng S. Luo Z. Ge Z. Xu F. Rational design of electrically conductive biomaterials toward excitable tissues regeneration Prog. Polym. Sci. 131 2022 101573 5 Zhang Q. Zhang L. Weng W. Qiu X. Zhuang Y. Wang H. Wei F. Dai J. Shen H. Chen Y. Restoration of motor and bladder functions after spinal cord injury via sustained wogonin release from carbon nanotube incorporated hydrogels ACS Mater. Lett. 6 8 2024 3443 3452 6 Hongna Y. Hongzhao T. Quan L. Delin F. Guijun L. Xiaolin L. Fulin G. Zhongren S. Jia-Ji electro-acupuncture improves locomotor function with spinal cord injury by regulation of autophagy flux and inhibition of necroptosis Front. Neurosci. 14 2020 616864 10.3389/fnins.2020.616864 PMC7862567 33551728 7 Jiang T. He Y. Recent advances in the role of nuclear factor Erythroid-2-Related factor 2 in spinal cord injury: regulatory mechanisms and therapeutic options Front. Aging Neurosci. 14 2022 851257 10.3389/fnagi.2022.851257 PMC9226435 35754957 8 Zhang T. Yu J. Huang Z. Wang G. Zhang R. Electroacupuncture improves neurogenic bladder dysfunction through activation of NGF/TrkA signaling in a rat model J. Cell. Biochem. 120 6 2019 9900 9905 10.1002/jcb.28272 30592331 9 Feng Q.F. Hou Y.H. Hou W.G. Lin Z.X. Tang K.M. Chen Y.L. The effects of acupuncture on bladder interstitial cells of cajal excitability in rats with overactive bladder Evid Based Complement Alternat Med 2013 2013 261217 10.1155/2013/261217 PMC3806234 24194780 10 Wei H.L. Ren Y.F. Zhang Z.L. Huang X.M. Li B. [Efficacy differences between electroacupuncture and moxibustion for neurogenic bladder after spinal cord injury: a randomized controlled trial] Zhongguo Zhen Jiu 43 9 2023 1036 1041 10.13703/j.0255-2930.20221027-k0005 37697879 11 Li Z.F. Zhang R. Zhao G.R. Kuang Y. Electroacupuncture inhibits PDK1/Akt/HCN4 pathway to improve neurogenic urinary retention in rats Zhen Ci Yan Jiu 48 10 2023 969 976 37879946 10.13702/j.1000-0607.20221084 12 Cabioglu M.T. Arslan G. Neurophysiologic basis of Back-Shu and Huatuo-Jiaji points Am. J. Chin. Med. 36 3 2008 473 479 18543382 10.1142/S0192415X08005916 13 Xu Q. Yang J.W. Cao Y. Zhang L.W. Zeng X.H. Li F. Du S.Q. Wang L.P. Liu C.Z. Acupuncture improves locomotor function by enhancing GABA receptor expression in transient focal cerebral ischemia rats Neurosci. Lett. 588 2015 88 94 25556683 10.1016/j.neulet.2014.12.057 14 Zhang X. Xu H. Zhu L. Huang D. Kong L. Wang Z. Tian F. Lu B. Wu W. Jiang C. Liu Y. Wang C. Jia S. Li Y. Yang M. Liu X. Hao D. Thoracic Jia-Ji electro-acupuncture mitigates low skeletal muscle atrophy and improves motor function recovery following thoracic spinal cord injury in rats Am J Transl Res 14 11 2022 8103 8116 36505337 PMC9730098 15 Liu L.-Y. Zhang J.-B. Jin C.-Y. Wu J.-H. Could Huatuo jiaji (EX-B 2) acupoint be assigned to the governor vessel? Zhen ci yan jiu= Acupuncture Research 43 11 2018 744 746 30585475 10.13702/j.1000-0607.180152 16 Xia Y.Y. Xue M. Wang Y. Huang Z.H. Huang C. Electroacupuncture alleviates spared nerve injury-induced neuropathic pain and modulates HMGB1/NF-kappaB signaling pathway in the spinal cord J. Pain Res. 12 2019 2851 2863 10.2147/JPR.S220201 31695479 PMC6805246 17 Zhao Y.X. Yao M.J. Liu Q. Xin J.J. Gao J.H. Yu X.C. Electroacupuncture treatment attenuates Paclitaxel-Induced neuropathic pain in rats via inhibiting spinal glia and the TLR4/NF-kappaB pathway J. Pain Res. 13 2020 239 250 10.2147/JPR.S241101 32099448 PMC7005725 18 Wang J. Wu J. Efficacy of combined electroacupuncture and moxibustion for treatment of neurogenic bladder after spinal cord injury: a retrospective analysis Medicine (Baltim.) 103 51 2024 e40909 10.1097/MD.0000000000040909 PMC11666164 39705425 19 Tu W.Z. Li S.S. Jiang X. Qian X.R. Yang G.H. Gu P.P. Lu B. Jiang S.H. Effect of electro-acupuncture on the BDNF-TrkB pathway in the spinal cord of CCI rats Int. J. Mol. Med. 41 6 2018 3307 3315 10.3892/ijmm.2018.3563 29568892 PMC5881805 20 Xu B. Zhao Y. Xiao Z. Wang B. Liang H. Li X. Fang Y. Han S. Fan C. Dai J. A dual functional scaffold tethered with EGFR antibody promotes neural stem cell retention and neuronal differentiation for spinal cord injury repair Adv Healthc Mater 6 9 2017 10.1002/adhm.201601279 28233428 21 Li X. Liu S. Zhao Y. Li J. Ding W. Han S. Chen B. Xiao Z. Dai J. Training neural stem cells on functional collagen scaffolds for severe spinal cord injury repair Adv. Funct. Mater. 26 32 2016 5835 5847 22 Cui Y. Yin Y. Zou Y. Zhao Y. Han J. Xu B. Chen B. Xiao Z. Song H. Shi Y. Xue W. Ma X. Dai J. The rotary cell culture system increases NTRK3 expression and promotes neuronal differentiation and migratory ability of neural stem cells cultured on collagen sponge Stem Cell Res. Ther. 12 1 2021 298 10.1186/s13287-021-02381-y 34020702 PMC8139048 23 Zou Y. Zhao Y. Xiao Z. Chen B. Ma D. Shen H. Gu R. Dai J. Comparison of regenerative effects of transplanting three-dimensional longitudinal scaffold loaded-human mesenchymal stem cells and human neural stem cells on spinal cord completely transected rats ACS Biomater. Sci. Eng. 6 3 2020 1671 1680 10.1021/acsbiomaterials.9b01790 33455365 24 Liu D. Shen H. Shen Y. Long G. He X. Zhao Y. Yang Z. Dai J. Li X. Dual-cues laden scaffold facilitates neurovascular regeneration and motor functional recovery after complete spinal cord injury Adv Healthc Mater 10 10 2021 e2100089 10.1002/adhm.202100089 33739626 25 Ma D. Zhao Y. Huang L. Xiao Z. Chen B. Shi Y. Shen H. Dai J. A novel hydrogel-based treatment for complete transection spinal cord injury repair is driven by microglia/macrophages repopulation Biomaterials 237 2020 119830 10.1016/j.biomaterials.2020.119830 32036301 26 Xin D.Q. Hu Z.M. Huo H.J. Yang X.J. Han D. Xing W.H. Zhao Y. Qiu Q.H. Schisandrin B attenuates the inflammatory response, oxidative stress and apoptosis induced by traumatic spinal cord injury via inhibition of p53 signaling in adult rats Mol. Med. Rep. 16 1 2017 533 538 10.3892/mmr.2017.6622 28560444 PMC5482126 27 Xiong T. Yang K. Zhao T. Zhao H. Gao X. You Z. Fan C. Kang X. Yang W. Zhuang Y. Chen Y. Dai J. Multifunctional integrated Nanozymes facilitate spinal cord regeneration by remodeling the extrinsic neural environment Adv. Sci. (Weinh.) 10 7 2023 e2205997 10.1002/advs.202205997 PMC9982579 36646515 28 Qin C. Qi Z. Pan S. Xia P. Kong W. Sun B. Du H. Zhang R. Zhu L. Zhou D. Yang X. Advances in conductive hydrogel for spinal cord injury repair and regeneration Int J Nanomedicine 18 2023 7305 7333 10.2147/IJN.S436111 38084124 PMC10710813 29 Yang B. Liang C. Chen D. Cheng F. Zhang Y. Wang S. Shu J. Huang X. Wang J. Xia K. Ying L. Shi K. Wang C. Wang X. Li F. Zhao Q. Chen Q. A conductive supramolecular hydrogel creates ideal endogenous niches to promote spinal cord injury repair Bioact. Mater. 15 2022 103 119 10.1016/j.bioactmat.2021.11.032 35386356 PMC8941182 30 Danziger Z.C. Grill W.M. Sensory and circuit mechanisms mediating lower urinary tract reflexes Auton. Neurosci. 200 2016 21 28 26119358 10.1016/j.autneu.2015.06.004 PMC4670817 31 Dequirez P.-L. Wachter S.D. Biardeau X. Sacral Neuromodulation for Low Urinary Tract Dysfunction: Overview and Mechanisms of Action, Autonomic Neuroscience 2025 Basic and Clinical 10.1016/j.autneu.2025.103337 40858056 32 Awasthi S. Srivastava A. Kumar D. Pandey S.K. Mubarak N.M. Dehghani M.H. Ansari K. An insight into the toxicological impacts of carbon nanotubes (CNTs) on human health: a review Environ. Adv. 18 2024 100601 33 Levin M. Stevenson C.G. Regulation of cell behavior and tissue patterning by bioelectrical signals: challenges and opportunities for biomedical engineering Annu. Rev. Biomed. Eng. 14 2012 295 323 10.1146/annurev-bioeng-071811-150114 22809139 PMC10472538 34 Xue W. Shi W. Kong Y. Kuss M. Duan B. Anisotropic scaffolds for peripheral nerve and spinal cord regeneration Bioact. Mater. 6 11 2021 4141 4160 10.1016/j.bioactmat.2021.04.019 33997498 PMC8099454 35 Madhusudhan A. Suhagia T.A. Sharma C. Jaganathan S.K. Purohit S.D. Carbon based polymeric nanocomposite hydrogel bioink: a review Polymers 16 23 2024 10.3390/polym16233318 PMC11644665 39684062 36 Xu H. Bai J. Meng J. Hao W. Cao J.M. Multi-walled carbon nanotubes suppress potassium channel activities in PC12 cells Nanotechnology 20 28 2009 285102 10.1088/0957-4484/20/28/285102 19546493 37 Chen Y.S. Hsiue G.H. Directing neural differentiation of mesenchymal stem cells by carboxylated multiwalled carbon nanotubes Biomaterials 34 21 2013 4936 4944 23578561 10.1016/j.biomaterials.2013.03.063 38 Ye L. Ji H. Liu J. Tu C.H. Kappl M. Koynov K. Vogt J. Butt H.J. Carbon nanotube-hydrogel composites facilitate neuronal differentiation while maintaining homeostasis of network activity Adv Mater 33 41 2021 e2102981 10.1002/adma.202102981 PMC11468883 34453367 39 Lai B.Q. Zeng X. Han W.T. Che M.T. Ding Y. Li G. Zeng Y.S. Stem cell-derived neuronal relay strategies and functional electrical stimulation for treatment of spinal cord injury Biomaterials 279 2021 121211 10.1016/j.biomaterials.2021.121211 34710795 40 Li G.D. Li X.X. Dong J.J. Wu Y. Han Y.S. [Effect of electroacupuncture on neurovascular unit and Wnt/beta-catenin signaling in rats with cerebral ischemia] Zhen Ci Yan Jiu 46 2 2021 87 94 10.13702/j.1000-0607.200819 33788427 41 Yao S. Yang Y. Li C. Yang K. Song X. Li C. Cao Z. Zhao H. Yu X. Wang X. Wang L.-N. Axon-like aligned conductive CNT/GelMA hydrogel fibers combined with electrical stimulation for spinal cord injury recovery Bioact. Mater. 35 2024 534 548 10.1016/j.bioactmat.2024.01.021 38414842 PMC10897856 42 Liu M. Zhang W. Han S. Zhang D. Zhou X. Guo X. Chen H. Wang H. Jin L. Feng S. Wei Z. Multifunctional conductive and electrogenic hydrogel repaired spinal cord injury via immunoregulation and enhancement of neuronal differentiation Adv Mater 36 21 2024 e2313672 10.1002/adma.202313672 38308338 43 Jung H. Kim S. Ko J. Um J.W. Intracellular signaling mechanisms that shape postsynaptic GABAergic synapses Curr. Opin. Neurobiol. 81 2023 102728 10.1016/j.conb.2023.102728 37236068 44 Petkov G.V. Role of potassium ion channels in detrusor smooth muscle function and dysfunction Nat. Rev. Urol. 9 1 2012 30 40 10.1038/nrurol.2011.194 PMC3759241 22158596 45 Jiang H.Y. Zhang D.X. Sun Z.R. Jiao X.F. Zhou M.Y. Huang F. Luo Z.R. Sun M.Q. Kai X. Yin H.N. [Exploration of the mechanism of electroacupuncture at \"Jiaji\" (EX-B2) in treating neuronal apoptosis in rats with spinal cord injury based on the JAK2/STAT3 pathway] Zhen Ci Yan Jiu 50 6 2025 633 640 40551645 10.13702/j.1000-0607.20240070 46 Boriero D. Carcereri de Prati A. Antonini L. Ragno R. Sohji K. Mariotto S. Butturini E. The anti-STAT1 polyphenol myricetin inhibits M1 microglia activation and counteracts neuronal death FEBS J. 288 7 2021 2347 2359 10.1111/febs.15577 32981207 47 Chen S. Ye J. Chen X. Shi J. Wu W. Lin W. Li Y. Fu H. Li S. Valproic acid attenuates traumatic spinal cord injury-induced inflammation via STAT1 and NF-kappaB pathway dependent of HDAC3 J. Neuroinflammation 15 1 2018 150 10.1186/s12974-018-1193-6 29776446 PMC5960086 48 Gaojian T. Dingfei Q. Linwei L. Xiaowei W. Zheng Z. Wei L. Tong Z. Benxiang N. Yanning Q. Wei Z. Jian C. Parthenolide promotes the repair of spinal cord injury by modulating M1/M2 polarization via the NF-kappaB and STAT 1/3 signaling pathway Cell Death Discov. 6 1 2020 97 10.1038/s41420-020-00333-8 33083018 PMC7538575 Appendix A Supplementary data The following is the Supplementary data to this article. Multimedia component 1 Multimedia component 1 Data availability Data will be made available on request. Acknowledgement This work was supported by grants from the 10.13039/501100001809 National Natural Science Foundation of China 10.13039/501100012166 National Key Research and Development Program of China Appendix A Supplementary data to this article can be found online at https://doi.org/10.1016/j.mtbio.2025.102335 ",
  "metadata": {
    "Title of this paper": "Parthenolide promotes the repair of spinal cord injury by modulating M1/M2 polarization via the NF-kappaB and STAT 1/3 signaling pathway",
    "Journal it was published in:": "Materials Today Bio",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12495234/"
  }
}