{
  "title": "Paper_1047",
  "abstract": "J Maxillofac Oral Surg J Maxillofac Oral Surg 1433 jmos Journal of Maxillofacial & Oral Surgery 0972-8279 0974-942X Springer PMC11455819 PMC11455819.1 11455819 11455819 39376751 10.1007/s12663-023-01925-4 1925 1 Case Report Synchronous Aberration of the Jugular and Carotid—a Case Report Kudva Adarsh 1 http://orcid.org/0000-0003-4312-8322 Dhara Vasantha dg91dan@gmail.com 1 Pandey Lakshmi 1 Lakshmikanth H. K. 2 1 grid.411639.8 0000 0001 0571 5193 Department of Oral & Maxillofacial Surgery, Manipal College of Dental Sciences, MAHE, 2 grid.411639.8 0000 0001 0571 5193 Department of Radiology, Kasturba Medical College, MAHE, 21 4 2023 10 2024 23 5 472260 1106 1108 25 2 2023 13 4 2023 01 10 2025 01 10 2025 07 10 2024 01 10 2025 © The Association of Oral and Maxillofacial Surgeons of India 2023 2023 Vascular aberrations in the head and neck region pose a grave diagnostic and a surgical challenge. Numerous reports in the literature have highlighted the incidence and the lethality associated with carotid or jugular anomalies signifying the need for awareness and preparedness by the clinicians while treating patients. Our paper reports a peculiar case showing asymptomatic double vessel aberration in relation to the internal jugular vein as an ectasia and carotid kinking in the same patient diagnosed with oral carcinoma. In addition, carotid kissing was also noted at the pharyngeal level. Keywords Ectasia Jugular vein Kinking Kissing carotid Aberration pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access no pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement no pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes issue-copyright-statement © The Association of Oral and Maxillofacial Surgeons of India 2024 ",
  "metadata": {
    "Title of this paper": "Synchronous Aberration of the Jugular and Carotid—a Case Report",
    "Journal it was published in:": "Journal of Maxillofacial & Oral Surgery",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC11455819/"
  }
}