{
  "title": "Paper_1147",
  "abstract": "pmc J Cosmet Dermatol J Cosmet Dermatol 379 blackwellopen JOCD Journal of Cosmetic Dermatology 1473-2130 1473-2165 pmc-is-collection-domain yes pmc-collection-title Wiley Open Access Collection PMC12475960 PMC12475960.1 12475960 12475960 41014051 10.1111/jocd.70474 JOCD70474 JCD-12-2024-1504 1 Original Article Original Article Impact of Vaginal Carbon Dioxide Laser Therapy Alone Versus Its Combination With Oral Bioactive Collagen Peptides, Ultra‐Low Molecular Weight Hyaluronic Acid, and Other Functional Components on the Genitourinary Syndrome of Menopause: A Cohort Pilot Study in Italy Tafuri Alessandro  1 tafuri.alessandro@gmail.com Panunzio Andrea  1 Mazzarella Claudia Rita  2 Tricarico Michela  3 Tricarico Ezio Michele  3   1 Department of Urology “Vito Fazzi” Hospital Lecce Italy   2 Department of Obstetrics and Gynecology “Giuseppe Tatarella” Hospital Cerignola Italy   3 Department of Gynecology “Amalthea” Diagnostic Center Lecce Italy * Correspondence: tafuri.alessandro@gmail.com 27 9 2025 10 2025 24 10 497679 10.1111/jocd.v24.10 e70474 16 7 2025 14 12 2024 17 9 2025 27 09 2025 28 09 2025 28 09 2025 © 2025 The Author(s). Journal of Cosmetic Dermatology https://creativecommons.org/licenses/by/4.0/ This is an open access article under the terms of the http://creativecommons.org/licenses/by/4.0/ ABSTRACT Background Genitourinary syndrome of menopause (GSM) includes clinical manifestations attributed to estrogen deficiency affecting the genitourinary tract of postmenopausal women. Treatment may require a multifaceted approach, including patient education, lifestyle modifications, physical, as well as hormonal and non‐hormonal therapies. Aims To evaluate the efficacy and tolerability of vaginal CO 2 Patients/Methods Twenty postmenopausal women with GSM were divided into two groups. Group 1 ( n 2 n Results Both groups showed improvements in VHI, pain scores, and FSFI, with Group 2 displaying more significant gains. Compared to Group 1, Group 2 had greater median differences in VHI (Δ = 11.00 vs. Δ = 8.50, p p p p p Conclusions The addition of oral supplementation with BCP and other functional components to vaginal CO 2 bioactive collagen peptides CO 2 genitourinary syndrome of menopause menopause MonaLIsa vaginal atrophy Erbozeta (S.p.A.) ‐ Chiesanuova (RSM). 10.13039/501100000828 pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement no pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes source-schema-version-number 2.0 cover-date October 2025 details-of-publishers-convertor Converter:WILEY_ML3GV2_TO_JATSPMC version:6.6.4 mode:remove_FC converted:27.09.2025  A. Tafuri A. Panunzio C. R. Mazzarella M. Tricarico E. M. Tricarico Impact of Vaginal Carbon Dioxide Laser Therapy Alone Versus Its Combination With Oral Bioactive Collagen Peptides, Ultra‐Low Molecular Weight Hyaluronic Acid, and Other Functional Components on the Genitourinary Syndrome of Menopause: A Cohort Pilot Study in Italy Journal of Cosmetic Dermatology 24 10 2025 e70474 10.1111/jocd.70474 41014051 PMC12475960  Funding: Alessandro Tafuri and Andrea Panunzio contributed equally to this article. 1 Introduction Genitourinary syndrome of menopause (GSM), previously known as vulvovaginal atrophy (VVA), is characterized by clinical manifestations attributed to estrogen deficiency impacting the genitourinary tract of postmenopausal women [ 1 1 2 3 GSM treatment requires a multifaceted approach, involving the collaboration of patients and different specialized professionals, including gynecologists, urologists, physiotherapists, and psychologists: indeed, treatment options may include patient education, lifestyle modifications, physical treatments, non‐hormonal therapies, and, in some cases, hormonal treatments and hormonal receptor modulators [ 3 4 5 6 Treatments aimed at restoring metabolism and function of connective tissue, the most important of which is bio‐stimulation activating fibroblast anabolic functions, and particularly enhancing type III collagen, elastin, and hyaluronic acid (HA) production from their precursors, are considered to be an innovative approach according to the principles of antiaging medicine [ 7 Intravaginal energy‐based methods, such as laser and radiofrequency, have been proposed as non‐pharmacological therapeutic options for managing GSM and have demonstrated promising results in alleviating symptoms, improving quality of life, and restoring sexual function without severe systemic adverse events [ 4 2 2 8 9 Lactobacillus 10 In the evolving landscape of menopausal health management, the quest for effective treatments that address a broad spectrum of symptoms without the risk associated with the use of hormones has become increasingly important. Within the non‐hormonal therapies, vaginal moisturizers and lubricants are usually employed, although they do not reverse the epithelium atrophy, may cause disruption of the vaginal ecosystem, and are often not well received by patients [ 11 12 Recently, a new food supplement aiming at restoring vulvo‐vaginal eutrophism has been marketed. It consists of specific bioactive collagen peptides (BCP, 2.5 g) combined with ultra‐low molecular weight HA (ULMW‐HA, 3–10 kDa, 75 mg) and other functional components such as a nucleotide blend. The present study aimed to evaluate and compare the efficacy and tolerability of vaginal CO 2 2 Materials and Methods 2.1 Study Design and Population The cohort study was conducted on 20 volunteer menopausal women aged > 50 years diagnosed with GSM. Before the study began, every patient gave informed consent for enrollment, data collection, and analysis. All patients had a cervical‐vaginal cytologic screening performed within the year and a negative urine culture; those who suffered from vulvovaginal infections, bladder infections, or presented with abnormal uterine bleeding were excluded from the study. Women were then sequentially allocated (1:1) in two treatment groups: Group 1, consisting of 10 patients, underwent three sessions of vaginal CO 2 2 2.2 Outcomes Measurements and Timepoints For all patients, the following data were prospectively collected in an electronic database: age (years), body mass index (BMI; kg/m 2 2 The evaluation considered GSM signs, pain perception related to vaginal atrophy, and sexual function. GSM signs were assessed using the Vaginal Health Index (VHI) before each vaginal CO 2 2 As a secondary measure, we evaluated patient adherence in both groups using a dedicated satisfaction survey administered at the end of the study (V4), where scores ranged between 0 (totally unsatisfied, no perceived benefit) and 20 (totally satisfied). Additionally, for patients receiving oral supplementation with BCP and other functional components, the following aspects were investigated: flavor, modality of administration, gastrointestinal tolerability, and duration of the therapy, assigning scores ranging from 0 (totally unsatisfied) to 10 (totally satisfied) for each aspect. Furthermore, we documented any adverse events reported throughout the study. 2.3 Interventions The vaginal CO 2 2 Astragalus membranaceus  Centella Asiatica 2.4 Statistical Analysis The sample size for the present study was determined based on the exploratory nature of the study itself, which aimed to collect preliminary data on the efficacy and tolerability of the combined treatment protocol. As a pilot study, the primary focus was on feasibility and effect estimation rather than achieving statistical power, with findings intended to guide the design of larger, confirmatory trials. Descriptive statistics included frequencies and proportions for categorical variables; medians and interquartile range (IQRs) were reported for continuously coded variables. Wilcoxon rank sum test and Fisher's exact test examined the statistical significance of differences in medians and proportions, respectively, between groups. All tests were two‐sided, with a level of significance set at p R software environment for statistical computing and graphics (version 4.1.2, R Foundation for Statistical Computing, Vienna, Austria) was used for all analyses. 3 Results 3.1 Participant Baseline Characteristics Participant characteristics are detailed in Table 1 2 TABLE 1 Descriptive characteristics of the study population. Characteristic Overall Group 1 Group 2  p  b  n  a  n  a  n  a Age (years) 54 (52, 59) 55 (48, 60) 54 (52, 57) 0.9 BMI (kg/m 2 23.5 (22.1, 25.7) 23.1 (21.4, 24.2) 25.2 (22.7, 25.8) 0.3 Educational level 0.9 Middle‐school diploma 2 (10.0%) 1 (10.0%) 1 (10.0%) High‐school diploma 6 (30.0%) 3 (30.0%) 3 (30.0%) University degree 12 (60.0%) 6 (60.0%) 6 (60.0%) Number of pregnancies 1 (1, 2) 2 (0, 2) 1 (1, 2) 0.9 Duration of menopause (years) 5 (3, 9) 7 (5, 10) 5 (3, 8) 0.4 Marital status 0.4 Unmarried 6 (30.0%) 4 (40.0%) 2 (20.0%) Married 12 (60.0%) 6 (60.0%) 6 (60.0%) Separated/divorced 10 (10.0%) 0 (0%) 2 (20.0%) Previous surgery 5 (25.0%) 2 (20.0%) 3 (30.0%) 0.9  Note: 2 2 Abbreviation: BMI, body mass index.  a Median (IQR); n  b Wilcoxon rank sum test; Wilcoxon rank sum exact test; Fisher's exact test. 3.2 Outcome Measurements Adherence to the treatment protocol was 100%. All 20 participants attended all scheduled laser sessions, participants in Group 2 completed their oral supplementation as instructed, and everyone returned for the final evaluation (V4). No adverse events were reported by any participants during the study. 3.2.1 Vaginal Health Index At baseline (V1), median VHI was 9.00 for Group 1 and 10.00 for Group 2 ( p 2 1A 2 p TABLE 2 Subjective symptoms, objective signs, and treatment satisfaction scores (median and interquartile range) at each specified time point in patients treated with vaginal carbon dioxide (CO 2 2 Group 1 Group 2 Vaginal carbon CO 2 Vaginal carbon CO 2 V1 V2 V3 V4 V1 V2 V3 V4 VHI 9.00 (7.00–11.00) 10.50 (10.00–15.75) 14.00 (11.00–19.00) 16.5 (13.5–20.0) 10.00 (8.25–11.75) 13.50 (12.25–15.00) 18.00 (16.25–19.00) 21.50 (20.20–22.80) VAS 9.00 (8.25–9.00) 7.00 (5.25–8.00) 6.00 (4.00–6.00) 3.00 (2.00–4.75) 8.00 (8.00–9.00) 5.50 (5.00–6.00) 3.50 (3.00–4.00) 1.00 (1.00–2.00) FSFI 51.50 (41.25–63.75) — — 60.50 (48.25–72.00) 53.50 (46.50–59.75) — — 67.50 (61.00–75.00) Treatment satisfaction — — — 11.50 (8.75–18.00) — — — 18.00 (18.00–18.00) FIGURE 1 Line plots depicting (A) median (IQR) Vaginal Health Index (VHI), and (B) median (IQR) VAS score for pain in patients treated with vaginal carbon dioxide (CO 2 2 3.2.2 Pain Measurement Baseline (V1) median VAS for pain was 9.00 in patients from Group 1 and 8.00 in those from Group 2 ( p 2 1B 2 p 3.2.3 Sexual Function Median FSFI improved from 51.50 at baseline to 60.50 at the end of the study in Group 1 ( p p p 2 3.2.4 Satisfaction and Safety Profile Treatment satisfaction levels were higher in Group 2, with a median score of 18.00 (IQR: 18.00–18.00) compared to 11.50 (IQR: 8.75–18.00) in Group 1 ( p 2 3 TABLE 3 Patient satisfaction scores (median and interquartile range) with treatment using the food supplement containing BCP and other functional components. Taste satisfaction 9.00 (8.25–9.75) Administration method 9.00 (9.00–9.75) Gastrointestinal tolerability 10.00 (9.00–10.00) Duration of intake 9.00 (9.00–9.75) 4 Discussion Intravaginal energy‐based methods, such as the vaginal fractional CO 2 13 14 15 2 16 17 2 8 18 2 19 20 Among oral and non‐hormonal therapeutic options, a new oral food supplement stands out for its unique composition made of BCP (Gelita AG, Eberbach, Germany), ULMW‐HA (TS‐Biotech Co. LTD, China) and other functional components, offering a unique approach to vulvovaginal health. The specific BCP are obtained from a highly purified form of collagen protein derived from bovine skin. They are characterized by a unique stimulatory effect, which is independent of the native collagen types I, II, or III, and it is achieved through a complex multistep process that requires a specific enzymatic hydrolytic step and denaturation of the original collagen. This process results in a distinctive mass peak fingerprint, as identified by matrix‐assisted laser desorption ionization mass spectrometry (MALDI‐MS). The final BCP composition is characterized by a specific amino acid profile where the average molecular weight is 2.0 kDa. These BCP, when administered orally, have been shown to reach the bloodstream in the form of small collagen peptides and free amino acids (Figure 2 21 21 22 23 24 25 26 FIGURE 2 The BCPs contained in the food supplement stimulate connective tissue cells through receptor interaction. The amino acids resulting from their digestion are also important as they provide the substrate for the synthesis of new connective tissue proteins once the target cells have been directly stimulated by the BCP. This is possible thanks to the unique molecular profile of the BCP contained in the food supplement, that have an average molecular weight of 2 kDa, and greater efficacy in stimulating the synthesis of the extracellular matrix compared to other collagen peptides with similar specifications. Women's life expectations are increasing all over the world, and in developed countries, women expect to survive more than 30 years following natural menopause [ 3 1 This cohort pilot study, by exploring the effectiveness of the food supplement alongside vaginal CO 2 In conclusion, this pilot study provides insights into the enhancement of vaginal CO 2 Author Contributions  Claudia Rita Mazzarella: Michela Tricarico: Ezio Michele Tricarico: Andrea Panunzio: Alessandro Tafuri: Disclosure Patents: The present investigation allows the registration of the patent‐pending invention “Pinkcare” (ITALY‐PATENT OF INVENTION Question N. 102024000014935 of 28 June 2024—Pharmaceutical or nutraceutical composition for prevention and/or treatment of uro‐gynecological disorders—Erbozeta S.p.a.). Chiara Pastorelli and Roberto Zavaglia are co‐inventors of the patent‐pending invention “Pinkcare”. Ethics Statement This study was conducted in line with the principles of the Declaration of Helsinki in a clinical setting, where patients provided informed consent for the anonymous use of their data; given that the study reflects standard medical practice and all data were anonymized to protect patient privacy, we determined that formal ethical committee approval was not required. Conflicts of Interest The authors declare no conflicts of interest. Data Availability Statement The data that support the findings of this study are available on request from the corresponding author. The data are not publicly available due to privacy or ethical restrictions. References 1 D. J. Portman M. L. S. Gass Vulvovaginal Atrophy Terminology Consensus Conference Panel Genitourinary Syndrome of Menopause: New Terminology for Vulvovaginal Atrophy From the International Society for the Study of Women's Sexual Health and The North American Menopause Society Climacteric 17 2014 557 563 10.3109/13697137.2014.946279 25153131 2 P. Monteleone G. Mascagni A. Giannini A. R. Genazzani T. Simoncini Symptoms of Menopause—Global Prevalence, Physiology and Implications Nature Reviews. Endocrinology 14 2018 199 215 10.1038/nrendo.2017.180 29393299 3 R. E. Nappi E. Martini L. Cucinella Addressing Vulvovaginal Atrophy (VVA)/Genitourinary Syndrome of Menopause (GSM) for Healthy Aging in Women Frontiers in Endocrinology (Lausanne) 10 2019 561 10.3389/fendo.2019.00561 PMC6712495 31496993 4 S. Alvisi G. Gava I. Orsili Vaginal Health in Menopausal Women Medicina (Kaunas, Lithuania) 55 2019 615 10.3390/medicina55100615 31547180 PMC6843679 5 V. Prestia E. Bertozzi M. Radice Low‐Molecular Weight Hyaluronic Acid for the Treatment of Vulvovaginal Atrophy: An Innovative Clinical Practice IJMDAT 3 2020 e260 6 S. Palacios R. E. Nappi M. J. Cancelo S. Sánchez T. Simoncini Expert Opinion on the Treatment of Vulvovaginal Atrophy With Ospemifene Based on New Evidence Climacteric 26 2023 388 391 10.1080/13697137.2023.2190881 37017751 7 I. P. González G. Leibaschoff C. Esposito Genitourinary Syndrome of Menopause and the Role of Biostimulation With Non‐Cross‐Linked Injectable Hyaluronic Acid Plus Calcium Hydroxyapatite Journal of Biological Regulators and Homeostatic Agents 33 2019 1961 1966 10.23812/19-251-L 31782291 8 T. L. B. Bretas M. C. A. Issa S. C. A. V. Fialho E. A. G. Villar L. G. C. Velarde F. R. Pérez‐López Vaginal Collagen I and III Changes After Carbon Dioxide Laser Application in Postmenopausal Women With the Genitourinary Syndrome: A Pilot Study Climacteric 25 2022 186 194 10.1080/13697137.2021.1941850 34291703 9 S. S. Faubion R. Sood E. Kapoor Genitourinary Syndrome of Menopause: Management Strategies for the Clinician Mayo Clinic Proceedings 92 2017 1842 1849 10.1016/j.mayocp.2017.08.019 29202940 10 R. Kagan S. Kellogg‐Spadt S. J. Parish Practical Treatment Considerations in the Management of Genitourinary Syndrome of Menopause Drugs & Aging 36 2019 897 908 10.1007/s40266-019-00700-w 31452067 PMC6764929 11 A. Sinha A. A. A. Ewies Non‐Hormonal Topical Treatment of Vulvovaginal Atrophy: An Up‐to‐Date Overview Climacteric 16 2013 305 312 10.3109/13697137.2012.756466 23215675 12 L. Quaranta J. Ottolina M. Parma An Alternative Approach for the Treatment of Vaginal Atrophy Minerva Ginecologica 66 2014 377 381 25020056 13 E. R. Sokol M. M. Karram Use of a Novel Fractional CO2 Laser for the Treatment of Genitourinary Syndrome of Menopause: 1‐Year Outcomes Menopause 24 2017 810 814 10.1097/GME.0000000000000839 28169913 14 T. C. Hillard Lasers in the Era of Evidence‐Based Medicine Climacteric 23 2020 S6 S10 10.1080/13697137.2020.1774536 33124459 15 V. Di Donato O. D'Oria M. Scudo Safety Evaluation of Fractional CO2 Laser Treatment in Post‐Menopausal Women With Vaginal Atrophy: A Prospective Observational Study Maturitas 135 2020 34 39 10.1016/j.maturitas.2020.02.009 32252962 16 A. Gaspar G. Addamo H. Brandi Vaginal Fractional CO 2 American Journal of Cosmetic Surgery 28 2011 156 162 10.1177/074880681102800309 17 S. Salvatore R. E. Nappi N. Zerbinati A 12‐Week Treatment With Fractional CO2 Laser for Vulvovaginal Atrophy: A Pilot Study Climacteric 17 2014 363 369 10.3109/13697137.2014.899347 24605832 18 M. F. R. Paraiso C. A. Ferrando E. R. Sokol A Randomized Clinical Trial Comparing Vaginal Laser Therapy to Vaginal Estrogen Therapy in Women With Genitourinary Syndrome of Menopause: The VeLVET Trial Menopause 27 2020 50 56 10.1097/GME.0000000000001416 31574047 19 O. D'Oria A. Giannini G. Buzzaccarini Fractional Co2 Laser for Vulvo‐Vaginal Atrophy in Gynecologic Cancer Patients: A Valid Therapeutic Choice? A Systematic Review European Journal of Obstetrics, Gynecology, and Reproductive Biology 277 2022 84 89 10.1016/j.ejogrb.2022.08.012 36037664 20 E. Proksch D. Segger J. Degwert M. Schunck V. Zague S. Oesser Oral Supplementation of Specific Collagen Peptides Has Beneficial Effects on Human Skin Physiology: A Double‐Blind, Placebo‐Controlled Study Skin Pharmacology and Physiology 27 2014 47 55 10.1159/000351376 23949208 21 E. Proksch M. Schunck V. Zague D. Segger J. Degwert S. Oesser Oral Intake of Specific Bioactive Collagen Peptides Reduces Skin Wrinkles and Increases Dermal Matrix Synthesis Skin Pharmacology and Physiology 27 2014 113 119 10.1159/000355523 24401291 22 H. C. Knefeli B. Durani Improved Wound Healing After Oral Application of Specific Bioactive Collagen Peptides Nutrafoods 16 2017 9 12 23 D. Hexsel V. Zague M. Schunck C. Siega F. O. Camozzato S. Oesser Oral Supplementation With Specific Bioactive Collagen Peptides Improves Nail Growth and Reduces Symptoms of Brittle Nails Journal of Cosmetic Dermatology 16 2017 520 526 10.1111/jocd.12393 28786550 24 S. Oesser The Oral Intake of Specific Bioactive Collagen Peptides Has a Positive Effect on Hair Thickness Nutrafoods 1 2020 134 138 25 M. Schunck V. Zague S. Oesser E. Proksch Dietary Supplementation With Specific Collagen Peptides Has a Body Mass Index‐Dependent Beneficial Effect on Cellulite Morphology Journal of Medicinal Food 18 2015 1340 1348 10.1089/jmf.2015.0022 26561784 PMC4685482 26 N. Hisada H. Satsu A. Mori Low‐Molecular‐Weight Hyaluronan Permeates Through Human Intestinal Caco‐2 Cell Monolayers via the Paracellular Pathway Bioscience, Biotechnology, and Biochemistry 72 2008 1111 1114 10.1271/bbb.70748 18391466 ",
  "metadata": {
    "Title of this paper": "Low‐Molecular‐Weight Hyaluronan Permeates Through Human Intestinal Caco‐2 Cell Monolayers via the Paracellular Pathway",
    "Journal it was published in:": "Journal of Cosmetic Dermatology",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12475960/"
  }
}