{
  "title": "Paper_187",
  "abstract": "pmc Oncol Res Oncol Res 3914 oncres OR Oncology Research 0965-0407 1555-3906 Tech Science Press PMC12494119 PMC12494119.1 12494119 12494119 10.32604/or.2025.066805 66805 1 Review Igniting Cold Tumors: Multi-Omics-Driven Strategies to Overcome Immune Evasion and Restore Immune Surveillance Igniting Cold Tumors: Multi-Omics-Driven Strategies to Overcome Immune Evasion and Restore Immune Surveillance Igniting Cold Tumors: Multi-Omics-Driven Strategies to Overcome Immune Evasion and Restore Immune Surveillance Huang Xinyao 1 # Gu Renjun 2 3 # Li Ziyun 4 liziyun0412@126.com Wang Fangyu 3 wangf65@nju.edu.cn 1 The First Clinical Medical College, Nanjing University of Chinese Medicine Nanjing, 210023 China 2 School of Chinese Medicine, Nanjing University of Chinese Medicine Nanjing, 210023 China 3 Department of Gastroenterology and Hepatology, Jinling Hospital, Affiliated Hospital of Medical School, Nanjing University Nanjing, 210016 China 4 School of Acupuncture and Tuina, School of Regimen and Rehabilitation, Nanjing University of Chinese Medicine Nanjing, 210023 China * liziyun0412@126.com wangf65@nju.edu.cn # 2025 26 9 2025 33 10 498269 2857 2902 17 4 2025 08 7 2025 26 09 2025 04 10 2025 04 10 2025 © 2025 The Authors. 2025 Published by Tech Science Press. https://creativecommons.org/licenses/by/4.0/ This work is licensed under a Creative Commons Attribution 4.0 International License Cold tumors, defined by insufficient immune cell infiltration and a highly immunosuppressive tumor microenvironment (TME), exhibit limited responsiveness to conventional immunotherapies. This review systematically summarizes the mechanisms of immune evasion and the therapeutic strategies for cold tumors as revealed by multi-omics technologies. By integrating genomic, transcriptomic, proteomic, metabolomic, and spatial multi-omics data, the review elucidates key immune evasion mechanisms, including activation of the WNT/β-catenin pathway, transforming growth factor-β (TGF-β)–mediated immunosuppression, metabolic reprogramming (e.g., lactate accumulation), and aberrant expression of immune checkpoint molecules. Furthermore, this review proposes multi-dimensional therapeutic strategies, such as targeting immunosuppressive pathways (e.g., programmed death-1 (PD-1)/programmed death-ligand 1 (PD-L1) inhibitors combined with TGF-β blockade), reshaping the TME through chemokine-based therapies, oncolytic viruses, and vascular normalization, and metabolic interventions (e.g., inhibition of lactate dehydrogenase A (LDHA) or glutaminase (GLS)). In addition, personalized neoantigen vaccines and engineered cell therapies (e.g., T cell receptor-engineered T (TCR-T) and natural killer (NK) cells) show promising potential. Emerging evidence also highlights the role of epigenetic regulation (e.g., histone deacetylase (HDAC) inhibitors) and N6-Methyladenosine (m6A) RNA modifications in reversing immune evasion. Despite the promising insights offered by multi-omics integration in guiding precision immunotherapy, challenges remain in clinical translation, including data heterogeneity, target-specific toxicity, and limitations in preclinical models. Future efforts should focus on coupling dynamic multi-omics technologies with intelligent therapeutic design to convert cold tumors into immunologically active (“hot”) microenvironments, ultimately facilitating breakthroughs in personalized immunotherapy. Cold tumors multi-omics immune evasion tumor microenvironment immune checkpoint inhibitors China Postdoctoral Science Foundation 2024M754279 Natural Science Foundation of Jiangsu Province BK20240738 Universities of Jiangsu Province 24KJB360004 Jiangsu Province Chinese Medicine Science QN202206 Nanjing University LLX202310 pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement no pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes 1 Introduction 1.1 Immune Microenvironment of Cold Tumors Cold tumors exhibit an immune-desert phenotype, characterized by a scarcity of tumor-infiltrating lymphocytes (TILs) and an accumulation of immunosuppressive cells, such as regulatory T cells (Tregs), which collectively impair antitumor immune responses [ 1 + 2 1.2 Core Mechanisms of Immune Evasion in Cold Tumors Cold tumors evade immune surveillance and clearance through multiple interrelated mechanisms. First, they reduce antigen presentation by either lacking tumor-specific antigens or neoantigens and by downregulating or losing the expression of major histocompatibility complex class I (MHC-I) molecules, thereby impairing T cell recognition and activation. Second, cold tumors upregulate immune evasion molecules, such as the “don’t eat me” signal cluster of differentiation 47 (CD47) and the immunosuppressive ligand programmed death-ligand 1 (PD-L1), which inhibit both innate and adaptive immune responses. In addition, cold tumors suppress chemokine production, remodel the tumor vasculature and extracellular matrix (ECM), and physically restrict T cell migration and infiltration into the TME. Concurrently, immunosuppressive cells—including Tregs, myeloid-derived suppressor cells (MDSCs), and tumor-associated macrophages (TAMs)—accumulate within the TME. These cells secrete inhibitory cytokines (e.g., Transforming Growth Factor-beta (TGF-β)) and upregulate immune checkpoint molecules, further dampening T cell activation and function. Moreover, cold tumors induce T cell dysfunction through chronic antigen exposure and sustained TGF-β signaling, ultimately leading to T cell exhaustion, apoptosis, or ferroptosis. Metabolic alterations—such as lactate accumulation and tumor hypoxia—also contribute by impairing effector T cell activity and promoting the differentiation and expansion of immunosuppressive Tregs [ 1 3 Fig. 1 Figure 1 Core mechanisms of immune evasion in cold tumors. This figure was drawn using Adobe Illustrator 2024 1.3 Necessity of Multi-Omics Technologies Traditional single-dimensional approaches are insufficient to resolve the spatial and temporal complexity of the tumor immune microenvironment (TIME). Although single-cell technologies have revealed immune heterogeneity, they fall short in capturing cell–cell interactions and the spatial context. Computational deconvolution tools such as Estimating Relative Subsets Of RNA Transcripts (CIBERSORT) and Microenvironment Cell Populations-counter (MCP-counter) can estimate immune infiltration but fail to reflect the dynamic behavior of immune cells [ 4 6 4 6 7 This review provides a comprehensive analysis of immune evasion mechanisms in cold tumors and highlights multi-omics-driven strategies aimed at enhancing the efficacy of immunotherapy. 2 Multi-Omics Dissection of Immune Evasion 2.1 Genomics Genomic technologies have significantly advanced our understanding of the immune evasion mechanisms underlying cold tumors, particularly in relation to tumor mutational burden (TMB) and the absence of neoantigens. Tumors with a high TMB typically harbor more neoantigens that can be recognized by the immune system, thereby triggering T cell activation and enhancing immune-mediated tumor elimination [ 8 9 9 10 11 12 13 More importantly, in-depth analyses based on genomic technologies have revealed that immune evasion in cold tumors is closely associated with key driver mutations, particularly the aberrant activation of the WNT/β-catenin signaling pathway. Data from large-scale genomic databases such as The Cancer Genome Atlas (TCGA) indicate that activation of this pathway suppresses chemokine expression and limits immune cell infiltration through intrinsic resistance mechanisms, thereby contributing to the formation of a “cold tumor” phenotype. Among 31 tumor types analyzed, approximately 90% of cases exhibited activation of the β-catenin pathway through gene mutations, somatic copy number alterations (SCNAs), or elevated protein expression levels [ 14 15 16 17 18 19 20 21 23 24 25 26 27 28 29 In addition, Clustered Regularly Interspaced Short Palindromic Repeats (CRISPR)/Cas9 technology has recently demonstrated immense potential in elucidating the immune evasion mechanisms of cold tumors. Through genome-wide CRISPR knockout screening, numerous key genes involved in tumor immune escape have been identified. For instance, in the context of cancer cell resistance to Chimeric Antigen Receptor T-Cell (CAR-T) cell-mediated cytotoxicity, autophagy-related genes such as ATG3, BECN1, and RB1CC1 were found to be enriched in tumor cells, facilitating immune evasion. Knockout of these genes significantly increased tumor cell susceptibility to CAR-T cells and improved therapeutic efficacy. Notably, elevated expression of these genes in tumor tissues was strongly associated with relapse and poor prognosis following Cluster of Differentiation 19 (CD19) CAR-T therapy [ 30 ( ) ( ) 31 + 32 33 2.2 Transcriptomics Through transcriptomic approaches, particularly single-cell RNA sequencing (scRNA-seq), the immune evasion mechanisms of cold tumors have been extensively elucidated, with a special focus on the TGF-β gene module associated with immunosuppression. In gastric cancer (GC) liver metastasis models, scRNA-seq revealed significant enrichment of immunosuppressive populations including cancer-associated fibroblasts (CAFs), MDSC-like macrophages, TAM-like macrophages, and naïve T cells, alongside marked reductions in conventional dendritic cells (cDCs) and effector CD8 + 34 34 35 36 37 Transcriptomic analyses have also highlighted the critical role of Vascular Endothelial Growth Factor (VEGF) in mediating immune evasion in both ovarian clear cell carcinoma (OCCC) and breast cancer (BC). In OCCC, VEGF promotes tumor progression primarily through angiogenesis and creation of an immunosuppressive microenvironment [ 38 38 38 39 40 Transcriptomic analyses have revealed critical defects in interferon (IFN) signaling pathways that contribute to immune evasion in cold tumors. Studies combining Perturb-Cellular Indexing of Transcriptomes and Epitopes by Sequencing (CITE) with CRISPR-Cas9 perturbation demonstrated that impaired interferon-γ (IFN-γ) signaling in melanoma-tumor-infiltrating lymphocyte (TIL) co-cultures compromises antigen presentation, facilitating immune escape [ 41 42 The Cyclic GMP-AMP Synthase-Stimulator of Interferon Genes (cGAS-STING) pathway, a key mediator of IFN responses, is frequently suppressed in cold tumors. While this pathway normally detects cytoplasmic DNA to trigger IFN production and immune activation [ 43 44 45 46 47 48 49 50 51 + 52 53 Transcriptomic studies have elucidated the critical role of CD8 + + + + 54 55 57 58 61 62 63 + 54 + 64 65 66 67 68 + In addition to T cell dysfunction, the failure of antigen-presenting cell (APC) activation, particularly dendritic cells (DCs), also represents a critical mechanism of immune evasion in cold tumors. The absence of cross-presenting competent Conventional Dendritic Cell 1 (cDC1) subsets (e.g., CD103 + + 69 70 71 72 73 + 74 2.3 Proteomics Proteomic studies have revealed the pivotal role of immune checkpoint proteins in facilitating immune evasion in cold tumors. In bladder cancer, loss of the Y chromosome (LOY) has been shown to intrinsically impair CD8 + 75 76 Recent studies have also highlighted the critical role of intercellular communication in driving immune evasion in cold tumors. Proteomic analyses have revealed that the extracellular matrix (ECM), as a central hub of soluble and structural signals, orchestrates bidirectional interactions between tumor cells and immune cells, particularly T lymphocytes. Mass spectrometry–based characterization of ECM components has identified key proteins and remodeling enzymes that regulate T cell infiltration, cytokine secretion, and immune suppression [ 77 78 Moreover, proteomic studies have unveiled the critical role of kinase activity regulation in mediating immune evasion in cold tumors, particularly in Human Papillomavirus-associated malignancies. The ErbB2 receptor tyrosine kinase (HER2) has been shown to regulate the activity of the HPV16 long control region (LCR), thereby promoting the activation of the viral promoter and enhancing the expression of the HPV oncogenes E6 and E7 [ 79 79 80 81 2.4 Metabolomics Recent studies have extensively investigated the relationship between metabolic reprogramming and immune evasion across various tumor types. Utilizing liquid chromatography-mass spectrometry (LC-MS/Q-TOF and LC-MS/QQQ), significant alterations in metabolites such as tryptophan, methionine, and kynurenine were identified in glioblastoma (GBM) cells and tissues compared to normal human astrocytes (NHA). Notably, GBM cells exhibit a strong dependence on dietary methionine to sustain proliferation, colony formation, and a modified methylation profile, reflected by an altered S-adenosylmethionine/S-adenosylhomocysteine (SAM/SAH) ratio [ 82 82 83 de novo + 84 85 2.5 Temporal Dynamics Temporal kinetic analyses have revealed that tumor immune escape is a dynamic and evolving process, primarily driven by therapy-induced immunoediting and adaptive resistance. The central mechanism involves the progressive loss of immunogenic mutations or high-quality neoantigens due to therapeutic pressure or epigenetic silencing. Concurrently, tumors suppress antigen presentation by inhibiting IFN-γ signaling and activating immunosuppressive pathways, thereby establishing a selective immune escape advantage [ 86 + + 87 88 89 90 91 2.6 Spatial Multi-Omics Spatial transcriptomics enables high-resolution mapping of immune cell–tumor cell interactions, thereby elucidating the mechanisms of immune evasion and informing the optimization of immunotherapeutic strategies. For instance, in hepatocellular carcinoma (HCC), intrinsic upregulation of high mobility group box 2 (HMGB2) is associated with T cell exhaustion within an extrinsically immunosuppressive microenvironment [ 92 93 94 95 96 97 + 98 5 99 Despite its capacity to depict the heterogeneity of the TME, spatial transcriptomics lacks the resolution necessary to determine functional suppression between specific cell types. For instance, in primary colorectal cancer, although the technique can identify the spatial co-localization of CD4 + + + + 100 101 102 96 97 + 98 99 Fig. 2 Table 1 Figure 2 Multi-omics dissection of immune evasion. This figure was drawn using Adobe Illustrator 2024 Table 1 Multi-omics dissection of immune evasion Omics technology Core findings Molecular mechanism/pathway Functional impact Relevant cancer types Clinical significance References Genomics High TMB correlates with neoantigen load. ITH and HLA-I LOH promote immune escape WNT/β-catenin pathway activation; Autophagy-related genes Intrinsic resistance via neoantigen loss; Extrinsic suppression via immune exclusion Melanoma, CRC, HCC, Glioma Prognostic IEVSig model; CRISPR-edited targets improve CAR-T efficacy [ 8 10 14 18 23 30 Transcriptomics TGF-β/VEGF modules drive immunosuppression; IFN/cGAS-STING defects impair immunity TGF-β-NK cell inhibition; VEGF-angiogenesis CAF/TAM-mediated T-cell exclusion; ISG downregulation OCCC, BC, LUAD, MM Bevacizumab restores T-cell function. IFN-γ pathway targeting reverses immune evasion [ 34 37 41 44 49 Proteomics Immune checkpoint (PD-L1) upregulation; ERK1/2-PD-L1 axis; HPV oncogene regulation CD8 + Bladder cancer, NKTCL, HPV + LOY mutations predict PD-1 response; PLA2G2A as a BRAF-mutant CRC biomarker [ 75 76 78 Metabolomics Tryptophan /kynurenine and sphingolipid dysregulation Kynurenine-T cell suppression; SAM/SAH imbalance Metabolic competition with T cells; Stemness maintenance GBM, HCC Methionine restriction sensitizes to immunotherapy [ 82 85 Temporal dynamics Immunoediting depletes neoantigens; IFN-γ signaling loss; Epigenetic silencing Dynamic immune desert formation Pan-cancer YTHDF1 deficiency enhances ICB response [ 86 87 90 Spatial multi- HMGB2/CXCR4-CCL5 axis recruits Tregs; p38-MAX-Treg recruitment; HK3-creatine-M2 polarization Spatial immune exclusion; Altered antigen presentation HCC, ESCC, GC, NSCLC Metabolic modulation restores TLS function; PRAME-targeted therapy prevents recurrence [ 92 95 97 Note: TMB, Tumor mutational burden; ITH, Intratumoral heterogeneity; HLA-I, Human Leukocyte Antigen Class I; LOH, Loss of heterozygosity; WNT, Wingless; CRC, Colorectal Cancer; HCC, Hepatocellular carcinoma; IEVSig, Immune evasion signature; CAR-T, Chimeric Antigen Receptor T-Cell; TGF-β, Transforming Growth Factor-beta; VEGF, Vascular Endothelial Growth Factor; IFN, Interferon; cGAS-STING, Cyclic GMP-AMP Synthase-Stimulator of Interferon Genes; NK, Natural Killer cells; CAF, Cancer-associated fibroblasts; TAM, Tumor-associated macrophage; ISG, Interferon-stimulated genes; OCCC, Ovarian clear cell carcinoma; BC, Breast cancer; LUAD, Lung adenocarcinoma; MM, Multiple myeloma; IFN-γ, Interferon-γ; PD-L1, Programmed cell death ligand 1; HER2, The ErbB2 receptor tyrosine kinase; LRP/LR, Laminin receptor precursor/laminin receptor; ERK1/2, Extracellular Signal-Regulated Kinase 1/2; NKTCL, NK/T cell lymphoma; LOY, Y chromosome loss; SAM/SAH, S-adenosylmethionine/S-adenosylhomocysteine; GBM, Glioblastoma; YTHDF1, YTH N6-methyladenosine RNA binding protein 1; HMGB2, High mobility group box 2; CXCR4, C-X-C motif chemokine receptor 4; CCL5, Chemokine (C-C Motif) Ligand 5; ESCC, Esophageal squamous cell carcinoma; GC, Gastric Cancer; NSCLC, Non-small cell lung cancer; TLS, Tertiary lymphoid structures; PRAME, Preferentially Expressed Antigen in Melanoma. 3 Therapeutic Intervention Strategies To convert cold tumors into hot tumors, key strategies include targeting immune suppression signaling, remodeling immune cell infiltration, metabolic reprogramming to improve immune function, deploying personalized neoantigen vaccines and cell therapies, and applying epigenetic regulation to modulate immune responses. These interventions aim to transform immunologically inert tumors into inflamed, therapy-responsive hot tumors ( Fig. 3 Figure 3 “Cold-to-hot” transition map. This figure was drawn using Adobe Illustrator 2024 3.1 Targeting Immune Suppression Signaling Cold tumors exhibit limited responsiveness to immunotherapy, primarily due to their immunosuppressive TME. Consequently, targeting key immunosuppressive signaling pathways has emerged as a critical therapeutic strategy. The combination of ICIs with other targeted therapies has shown promise in enhancing antitumor immune responses by disrupting extrinsic immune evasion mechanisms mediated by the TME. In addition, intrinsic metabolic pathways within tumor cells, such as ferroptosis and tryptophan metabolism, play pivotal roles in shaping the immune microenvironment. Therapeutically targeting these metabolic pathways can effectively modulate immune responses and improve the efficacy of immunotherapy. Moreover, the adenosine signaling pathway, an important extrinsic contributor to immune suppression in the TME, plays a vital role in tumor immune escape. Inhibition of adenosine production and blockade of its receptors can relieve immunosuppression and further augment the therapeutic benefits of immunotherapy. 3.1.1 Combination with Immune Checkpoint Inhibitors To better understand intervention strategies for cold tumor treatment, this section focuses on the application of ICIs. Cold tumors are characterized by an immunosuppressive tumor microenvironment, which limits the effectiveness of immunotherapeutic approaches. Therefore, identifying strategies to “warm up” cold tumors is essential for enhancing treatment outcomes. Several studies have highlighted potential targets for overcoming intrinsic and extrinsic immune resistance mechanisms. For instance, aberrant expression of glutamate decarboxylase 1 (GAD1) in tumor cells has been shown to mediate intrinsic resistance by promoting tumor cell proliferation via β-catenin activation. Concurrently, GAD1 contributes to extrinsic immune suppression by reducing CD8 + 103 + 104 + 105 106 107 108 109 ′ 110 Recent studies have identified increasingly precise strategies targeting immune evasion mechanisms within the tumor immune microenvironment. The PD-1/PD-L1 signaling pathway plays a pivotal immunosuppressive role in the tumor microenvironment, with exosomal PD-L1 (exoPD-L1) facilitating immune escape by inhibiting antitumor immune responses. Targeting exoPD-L1 has been demonstrated to enhance immunotherapy efficacy [ 111 112 113 114 115 116 + 117 Current ICIs combined with other targeted therapies still face significant limitations. For example, DKK1 blockade encounters challenges related to targeting precision and therapeutic resistance, due to the complex origin of DKK1, its reliance on PI3K-AKT signaling, and the existence of immunocompensatory mechanisms [ 104 106 108 113 Fig. 4 Figure 4 Intrinsic resistance mechanisms: Tumor cells aberrantly express GAD1, promoting GABA synthesis, which inhibits GSK-3β and activates β-catenin signaling. This drives tumor cell proliferation and reduces CD8 + + Extrinsic immune suppression mechanisms: DKK1 shapes the immunosuppressive phenotype of tumor-associated macrophages (TAMs), limiting CD8 + 3.1.2 Ferroptosis and Tryptophan Metabolism The immune escape mechanisms of cold tumors significantly restrict the efficacy of immunotherapy, particularly in chemotherapy-resistant cancers such as breast cancer. Recent studies have highlighted the pivotal roles of ferroptosis and tryptophan metabolism pathways within the tumor immune microenvironment. Ferroptosis occurring in tumor-infiltrating neutrophils—an extrinsic microenvironmental factor—suppresses CD8 + + + + + + + 118 119 119 120 121 Additionally, tryptophan metabolism facilitates immune escape through tumor-intrinsic upregulation of IDO and tryptophan 2,3-dioxygenase (TDO) enzymes. As an extrinsic immunosuppressive mechanism, L-kynurenine activates the aryl hydrocarbon receptor (AHR) pathway, promoting the generation of Tregs and tolerogenic myeloid cells that inhibit CD8 + 122 3.1.3 Adenosine Pathway Adenosine, produced by Cluster of Differentiation 39 (CD39) and Cluster of Differentiation (CD73) in the tumor microenvironment as an extrinsic immunosuppressive mechanism, binds to the Adenosine A1 Receptor, Adenosine A2A Receptor, Adenosine A2B Receptor and Adenosine A3 Receptor receptors, thereby inhibiting T cell activity and promoting Treg accumulation. Consequently, targeting the adenosine signaling pathway has emerged as a promising immunotherapy strategy, particularly for cold tumors. CD39/CD73 inhibitors and adenosine receptor antagonists are currently under clinical evaluation to reverse immunosuppression in these tumors. Studies have shown that anti-CD39 antibodies restore immune cell function by blocking the extracellular conversion of ATP to adenosine, thereby enhancing anti-tumor responses. When combined with immune checkpoint inhibitors (e.g., PD-1 blockade), anti-CD39 therapy further improves anti-tumor efficacy [ 123 124 125 125 + 126 126 123 3.2 Remodeling Immune Cell Infiltration Cold tumor treatment is challenged by insufficient immune cell infiltration, primarily due to extrinsic microenvironmental factors such as abnormal vasculature and decreased chemokine expression. Therefore, remodeling the tumor immune microenvironment has become a critical therapeutic strategy. Chemokine therapy effectively promotes the infiltration of immune cells—particularly CD8 + 3.2.1 Chemokine Therapy The senescence-associated secretory phenotype (SASP) directly regulates the recruitment and function of immune cells within the TME by releasing various soluble mediators, including chemokines, cytokines, and growth factors, thus serving as a critical link between cellular senescence and anti-tumor immunity [ 127 + 127 128 129 130 + + 131 132 133 + 134 135 136 137 138 3.2.2 Oncolytic Virotherapy Oncolytic virotherapy has demonstrated significant potential in overcoming extrinsic microenvironmental suppression in cold tumors, particularly in non-small cell lung cancer, by inducing inflammation and enhancing infiltration of cytotoxic immune cells. Low-pathogenicity influenza A virus (IAV) promotes M1 macrophage polarization through tumor cell lysis and modulation of TAM function, thereby augmenting cytotoxic immune cell infiltration. When combined with novel B7-H3 ICIs, this approach significantly enhances immune cell infiltration and anti-tumor efficacy, outperforming traditional α-PD-1 antibody monotherapy [ 139 140 141 3+ 142 143 144 145 144 145 3.2.3 Vascular Normalization The combination of anti-VEGF therapy and immunotherapy has emerged as an effective strategy for remodeling the TME and enhancing immune responses. Studies have shown that low ATM scores are closely associated with plasma cell activation pathways. The ATM model not only predicts the efficacy of immune checkpoint blockade therapies but also correlates with increased sensitivity to anti-VEGF treatments [ 146 147 147 148 + 149 149 150 151 152 3.3 Metabolic Reprogramming Interventions Metabolic reprogramming within the tumor microenvironment profoundly influences immune cell function by dynamically altering their metabolic phenotypes. Tumor cells increase exogenous fatty acid uptake via elevated expression of low-density lipoprotein receptors, fatty acid translocases, and fatty acid-binding proteins, which not only suppress immune cell activity but also promote tumor proliferation and epithelial-mesenchymal transition [ 153 de novo 153 154 155 156 157 158 159 160 161 162 Metabolic reprogramming strategies targeting LDHA and GLS have emerged as crucial approaches in treating cold tumors. Lactate accumulation within the tumor microenvironment impairs CD8 + 158 + 158 159 159 3.4 Personalized Neoantigen Vaccines and Cell Therapy Antigen vaccines and cell therapies hold promising potential for treating cold tumors. Neoantigen vaccines activate T cells and, when combined with modalities such as photodynamic therapy or viral vectors, effectively improve the tumor immune microenvironment. Dendritic cell vaccines, particularly when paired with adoptive cell transfer, enhance T-cell infiltration into tumors, helping to overcome extrinsic barriers to immune activation. Notably, the combination of T-cell receptor-engineered T cells (TCR-T) and NK cells represents a novel, personalized therapeutic strategy for cold tumors. 3.4.1 Neoantigen Vaccine Design Recent advances demonstrate that viral vector-based platforms, such as those utilizing lymphocytic choriomeningitis virus (LCMV), can effectively break immune tolerance and activate CD8 + 163 164 + + 165 + 166 + 167 168 169 170 3.4.2 Multi-Omics Optimization Strategies for Cell Therapy Cellular therapies have demonstrated diverse potentials and challenges in tumor treatment, particularly for cold tumors. TCR-T therapies are emerging as promising approaches, especially γδ T cells, which recognize lipid antigens and exhibit robust immune responses due to their antigen-processing-independent and HLA-unrestricted properties. Although γδ T cells have not yet entered clinical trials, they hold great potential in cold tumor therapy [ 171 171 172 173 172 174 175 176 177 178 3.5 Epigenetic Regulation Epigenetic modifications play a crucial role in regulating immune evasion across various cancer types through mechanisms such as DNA methylation and histone modifications. In recurrent lung adenocarcinoma, hypomethylation of the TEAD1 binding site leads to aberrant activation of the PRAME gene, which in turn promotes the upregulation of epithelial-mesenchymal transition (EMT)-related genes and enhances metastatic potential [ 98 179 + 180 181 182 183 184 + 185 More importantly, epigenetic regulation offers promising new strategies for the treatment of cold tumors. Histone deacetylase (HDAC) inhibitors have been shown to enhance interferon signaling and promote immune cell infiltration, thereby reversing the extrinsic immunosuppressive conditions within the tumor microenvironment and improving responsiveness in tumors that are resistant to immunotherapy. Beyond histone modifications, RNA methylation—particularly m6A modifications—also plays a critical role in shaping antitumor immune responses. m6A modifications influence immunotherapy outcomes by modulating the expression of immune checkpoint genes within tumor cells and altering patterns of immune cell infiltration, thereby affecting both intrinsic resistance mechanisms and extrinsic immune suppression. The dynamic regulation of m6A by writer (e.g., METTL3) and eraser (e.g., FTO, ALKBH5) enzymes further fine-tunes the expression of immune-related genes, ultimately improving the effectiveness of immune responses. These findings underscore the therapeutic potential of epigenetic interventions to reprogram cold tumor microenvironments and sensitize them to immunotherapeutic strategies. 3.5.1 HDAC Inhibitors Activate Interferon Signals HDAC inhibitors play a pivotal role in tumor immunotherapy by modulating the interferon (IFN) signaling pathway, exerting multi-level effects on both intrinsic and extrinsic immune resistance. For instance, the combination of the class I HDAC inhibitor entinostat with the immunocytokine NHS-IL12 effectively restores MHC class I expression and IFN-γ signaling in tumor cells, thereby targeting intrinsic immune resistance. This combination also reprograms the immunosuppressive tumor microenvironment by activating the JAK/STAT and IFN-γ pathways, stimulating M1 macrophages and antigen-presenting cells, and promoting CD8 + 186 + 186 187 3.5.2 m6A Modification Regulates Immunotherapeutic Response N6-methyladenosine (m6A) modification plays a crucial regulatory role within the TME, profoundly influencing immune responses and the efficacy of immunotherapy in cold tumors. Emerging evidence suggests that m6A regulators modulate immune infiltration through extrinsic mechanisms and govern immune evasion via intrinsic alterations in tumor gene expression, thereby shaping tumor immunogenicity and therapeutic responsiveness. For example, the m6A writer METTL3 enhances anti-tumor immunity by promoting infiltration of CD8 + 188 188 189 190 191 192 3.6 Clinical Translation Efforts The clinical translation of tumor treatment strategies increasingly relies on diverse and innovative preclinical models to optimize precision medicine and improve immunotherapy outcomes. Among these, patient-derived organoids (PDOs) have demonstrated significant value. In esophageal squamous cell carcinoma, PDOs recapitulate tumor characteristics with a 61.8% establishment rate, and their chemotherapy sensitivity profiles closely correlate with clinical outcomes. Notably, patients in the therapy-sensitive group exhibit significantly prolonged progression-free survival, underscoring the potential of PDOs to guide individualized treatment [ 193 194 195 196 197 198 199 200 201 + + 202 203 204 Table 2 Table 2 Therapeutic intervention strategies Intervention category Target/Strategy Mechanism of action References Targeted immunosuppressive signals Immune checkpoint combination therapy GAD1/GABA signaling pathway Inhibit GABA-mediated β-catenin pathway activation, promote CD8 + [ 103 DKK1 Regulate TAM phenotype, enhance PD-1 blockade effect [ 104 MMP9 Restore T cell function in CTNNB1 mutant HCC [ 105 WNT2-CAFs Restore DC differentiation, enhance immune response [ 106 LRP1/NOTCH Reverse M2 macrophage polarization, overcome ICI resistance [ 107 YAP1-CAFs Convert CAF phenotype, enhance immune response [ 108 PABPC1L/IDO1 Reduce Treg infiltration, improve T cell function [ 109 FTSJ3 Activate the type I interferon pathway [ 110 exoPD-L1 Block exosome-mediated immune evasion [ 111 Ferroptosis and metabolism IL1β/IL1R1/NF-κB Target neutrophil ferroptosis, reverse immune resistance [ 118 IDO/TDO-AHR pathway Inhibit Kyn-AHR pathway, restore CD8 + [ 122 Adenosine pathway CD39/CD73 inhibitors Blocks ATP-to-adenosine conversion, restoring T-cell function [ 123 AB680 (CD73 inhibitor) Inhibits adenosine receptor signaling, enhances anti-PD-1 efficacy by inhibiting adenosine production [ 125 A1 receptor antagonists Reduces pDC-mediated CD8 + [ 126 Immune cell remodeling Chemokine therapy EZH2 inhibitors Upregulates CXCL9/10 to recruit CD8 + [ 127 Sin3B deletion Activates CXCL9/10-CXCR3 axis to enhance PD-1 sensitivity [ 128 129 HIF-1α/BIRC2 inhibition Restores CXCL9/10 expression under hypoxia [ 130 HDAC inhibitors Promotes CXCR3 + + [ 131 Oncolytic virus therapy IAV + B7-H3 ICIs Polarizes M1 macrophages and enhances cytotoxic T-cell infiltration [ 139 OAd.TNFa-IL2 Induces DAMPs/PAMPs to activate AIM2 inflammasomes [ 140 Vascular normalization Anti-VEGF + ICIs Improves T-cell infiltration via vascular remodeling [ 146 Anlotinib Reverses osimertinib resistance by increasing cytotoxic T cells [ 147 ZBTB46 overexpression Promotes vascular normalization and synergizes with anti-PD-1 [ 152 Metabolic reprogramming LDHA inhibitors Reduces lactate accumulation, restoring CD8 + [ 158 CB-839 (GLS inhibitor) Disrupts glutamine metabolism to enhance CAR-T efficacy [ 159 Personalized therapy Neoantigen vaccine LCMV-based vaccines Breaks immune tolerance via CD8 + [ 163 DC nanovaccines + photodynamic therapy Enhances antigen release and T-cell infiltration [ 164 Cell therapy γδ TCR-T cells Recognizes lipid antigens independent of HLA [ 171 NY-ESO-1 TCR-T Targets MHC-presented neoantigens in synoviocyte sarcoma [ 172 Epigenetic regulation HDAC inhibitors Entinostat/NHS-IL12 Activate IFN-γ signaling, enhance CD8 + [ 186 m6A modification METTL3/FTO targeting Regulate immune checkpoint expression, enhance ICB efficacy [ 188 192 Clinical translation efforts Organoid models PDA organoids + ITF2357/I-BET151 Identifies epigenetic inhibitors to enhance anti-PD-1 efficacy [ 194 Humanized PDX models MISTRG6 mice Simulates tumor-immune interactions with matched TME [ 200 Note: GAD1, Glutamate Decarboxylase 1; GABA, γ-aminobutyric acid; DKK1, Dickkopf-1; TAM, Tumor-associated macrophage; PD-1, Programmed Death-1; MMP9, Matrix Metallopeptidase 9; HCC, Hepatocellular carcinoma; WNT2, Wingless-Type MMTV Integration Site Family Member 2; CAFs, Cancer-associated fibroblasts; DC, Dendritic cell; LRP1, Low-Density Lipoprotein Receptor-Related Protein 1; NOTCH, Notch Homolog; ICI, Immune checkpoint inhibitor; YAP1, Yes-associated protein1; PABPC1L, Poly(A) Binding Protein Cytoplasmic 1 Like; IDO1, Indoleamine 2,3-Dioxygenase 1; FTSJ3, FtsJ RNA 2 ′ β 4 Discussion 4.1 The Value and Limitations of Multi-Omics Integration Multi-omics integration—enabled by the convergence of advanced technological platforms—offers a comprehensive framework for dissecting the tumor immune microenvironment, thereby uncovering critical biological insights and advancing the precision of immunotherapy. The synergistic application of next-generation sequencing (NGS) with immune cell profiling techniques enhances the clinical translation of tumor immunology by providing high-resolution molecular and cellular data [ 6 205 4.2 Consensus and Controversies on Immune Escape Mechanisms in Cold Tumors Genomics reveals that immune escape in cold tumors is largely driven by intrinsic tumor resistance, including gene mutations, epigenetic modifications, and dysregulated expression of immune escape–related genes within tumor cells. Tumor cells often evade immune surveillance through alterations in genes involved in immune checkpoint regulation and antigen presentation. However, the impact of gene mutations varies across tumor types, and how to accurately predict immune escape based on genomic data remains an area requiring further exploration. Moreover, whether the relationship between gene mutations and immune escape is universally applicable remains controversial [ 8 10 34 35 80 81 83 85 89 94 4.3 Translational Barriers of Treatment Strategies Many therapeutic targets—such as GAD1, DAD1, and MMP9—are also expressed in normal tissues, raising concerns about off-tumor toxicity. For example, adenosine pathway inhibitors (e.g., anti-CD39/CD73) may disrupt adenosine homeostasis in the cardiovascular and nervous systems; similarly, targeting GABA signaling could impair neuronal function. In addition, tumor heterogeneity, a hallmark of intrinsic tumor resistance, leads to substantial variability in target expression across patients and even within different regions of the same tumor. For instance, CTNNB1 mutations are only present in a subset of hepatocellular carcinoma, limiting the generalizability of corresponding targeted therapies [ 103 105 123 125 118 139 140 158 139 141 206 186 187 4.4 Challenges and Future Directions Immunotherapy for cold tumors is undergoing a pivotal transition from basic research to clinical translation. The integration of multi-omics technologies offers a transformative framework for elucidating the intricate mechanisms of immune escape; however, the precise modulation of the tumor immune microenvironment—from “cold” to “hot”—still faces numerous unresolved challenges. The pronounced spatial and temporal heterogeneity of cold tumors limits the effectiveness of traditional single-sample and single-cell sequencing approaches in capturing their dynamic immune landscapes. This necessitates the development of more advanced time-resolved multi-omics techniques and biomimetic tumor microenvironment models. A central challenge in cross-platform and cross-scale data integration lies in discrepancies in spatial resolution and cellular coverage, which directly impact our ability to accurately delineate immunosuppressive mechanisms. In response, cutting-edge computational frameworks, such as digital twin (DT) models for cancer patients, are leveraging high-performance computing and multimodal databases to shift the research paradigm from population-level inference to individualized simulation [ 207 208 209 210 211 To achieve effective clinical translation for cold tumors, it is essential to adopt a dual-track strategy that integrates dynamic monitoring with precision intervention. Multi-omics-based molecular typing technologies are crucial for real-time tracking of treatment responses and regimen optimization, while smart therapeutic platforms must combine synthetic biology and nanotechnology to sense and respond to cues within the tumor microenvironment. Synthetic biology tools, such as chimeric antigen receptors (CARs), have demonstrated remarkable efficacy in hematologic malignancies; however, their application in solid tumors remains hindered by multiple immunosuppressive mechanisms and challenges in tumor infiltration and persistence [ 212 213 in vivo 214 215 216 217 Breakthroughs in spatial multi-omics have offered novel insights into intratumoral heterogeneity. For example, digital spatial analysis has demonstrated that proteomic signaling within the stromal region holds superior predictive value for response to bispecific antibody therapy [ 218 219 5 Conclusion This review systematically delineates the immune evasion mechanisms underlying cold tumors and highlights multi-omics technologies as transformative tools for decoding tumor–immune interactions. By integrating genomics, transcriptomics, proteomics, metabolomics, and spatial omics, both intrinsic tumor resistance and extrinsic microenvironmental suppression are revealed as cooperative factors shaping immune escape. Key pathways such as WNT/β-catenin and TGF-β signaling consistently emerge as immunosuppressive axes, while metabolic and spatial reprogramming further reinforce immune exclusion. Multi-omics–based interventions—including immune checkpoint blockade combinations, metabolic targeting, and personalized neoantigen therapies—offer rational strategies to reprogram the tumor immune microenvironment. Nonetheless, challenges remain in cross-platform data integration, mechanistic causality, and clinical translation. Moving forward, the integration of dynamic multi-omics profiling with functionally validated models and intelligent therapeutic design is essential to overcome immune resistance and facilitate the transformation of cold tumors into immunologically active states. Not applicable. Funding Statement The 75th Batch of China Postdoctoral Science Foundation projects (No. 2024M754279); Natural Science Foundation of Jiangsu Province (No. BK20240738); Basic Science (Natural Science) Research Project in Universities of Jiangsu Province (No. 24KJB360004); Jiangsu Province Chinese Medicine Science and Technology Development Plan Youth Talent Project (No. QN202206); Nanjing University of Chinese Medicine Luo Linxiu Teacher Development Fund Project (No. LLX202310). Author Contributions Xinyao Huang: Writing—review & editing, Writing—original draft, Visualization, Investigation. Renjun Gu: Writing—review & editing, Visualization, Supervision, Project administration, Investigation, Funding acquisition, Conceptualization. Ziyun Li: Writing—review & editing, Visualization, Supervision, Project administration, Investigation, Conceptualization. Fangyu Wang: Writing—review & editing, Visualization, Supervision, Project administration, Investigation, Conceptualization. All authors reviewed the results and approved the final version of the manuscript. Availability of Data and Materials Not applicable. Ethics Approval Not applicable. Conflicts of Interest The authors declare no conflicts of interest to report regarding the present study. Highlights  Multi-omics reveals immune evasion mechanisms in cold tumors Targeting WNT/β-catenin and TGF-β restores immune surveillance Combination therapies boost immune checkpoint inhibitor efficacy Personalized neoantigen vaccines and cell therapies advance treatment Clinical translation faces data heterogeneity and toxicity hurdles Abbreviations AHR Aryl hydrocarbon receptor AIM2 Absent in Melanoma 2 Akt Protein Kinase B APC Adenomatous Polyposis Coli protein ATF3 Activating transcription factor 3 ATP Adenosine Triphosphate BC Breast cancer Bim Bcl-2 interacting mediator of cell death BIRC2 Baculoviral IAP Repeat-Containing Protein 2 Blimp1 B lymphocyte-induced maturation protein 1 BTLA B and T Lymphocyte Attenuator CAF Cancer-associated fibroblasts CAFs Cancer-associated fibroblasts CAR Chimeric antigen receptor CAR-T Chimeric Antigen Receptor T-Cell CBX2 Chromobox 2 CCAR1 Cell Division Cycle and Apoptosis Regulator 1 CCL Chemokine (C-C Motif) Ligand CCL4 Chemokine (C-C Motif) Ligand 4 ccRCC Clear cell renal cell carcinoma CD Cluster of Differentiation CD8 + Cytotoxic T lymphocytes cDC1 Conventional Dendritic Cell 1 cDCs Conventional dendritic cells CH25H Cholesterol 25-hydroxylase CIBERSORT Cell-type Identification By Estimating Relative Subsets Of RNA Transcripts CITE Cellular Indexing of Transcriptomes and Epitopes by Sequencing CNVs Copy number variations COPD Chronic obstructive pulmonary disease CRC Colorectal cancer CRISPR Clustered Regularly Interspaced Short Palindromic Repeats CRISPRi CRISPR interference CSC Cancer stem cell CSF1R Colony Stimulating Factor 1 Receptor CTCs Circulating tumor cells CyTOF Cytometry by Time-Of-Flight cGAS-STING Cyclic GMP-AMP Synthase-Stimulator of Interferon Genes DAMPs Damage-Associated Molecular Patterns DC Dendritic cell DCs Dendritic cells DKK1 Dickkopf-1 EMT Epithelial-mesenchymal transition ERK1/2 Extracellular Signal-Regulated Kinase 1/2; ESCC, Esophageal squamous cell carcinoma ETV4 Ets Variant 4 exoPD-L1 exosomal PD-L1 EZH2 Enhancer of Zeste Homolog 2 FTO Fat mass and obesity-associated protein FTSJ3 FtsJ RNA 2 ′ GABA γ-aminobutyric acid GAD1 Glutamate decarboxylase 1 GBC Gallbladder cancer GBM Glioblastoma GC Gastric Cancer GLS Glutaminase GSK3β Glycogen Synthase Kinase 3 Beta HCC Hepatocellular carcinoma HDAC Histone Deacetylase HER2 The ErbB2 receptor tyrosine kinase HGSOC High-grade serous ovarian cancer HIF-1α Hypoxia-Inducible Factor 1 Alpha HLA Human Leukocyte Antigen HLA-I Human Leukocyte Antigen Class IAV Influenza A virus I-BET151 Inhibitor of BET Protein ICIs Immune checkpoint inhibitors ICB Immune checkpoint blockade ICC Intrahepatic cholangiocarcinoma IDO1 Indoleamine 2,3-dioxygenase 1 IFN Interferon IFN-γ Interferon-γ IEV Immune evasion IEVSig Immune evasion signature IL Interleukin IL-10R Interleukin-10 receptor IL-6R Interleukin-6 receptor ISG Interferon-stimulated genes ITF2357 Inhibitor of Histone Deacetylase ITH Intratumoral heterogeneity LAG-3 Lymphocyte Activation Gene 3 LCR Long control region LEC Lymphatic endothelial cell LC-MV Lymphocytic Choriomeningitis Virus LGALS9 Galectin-9 LM Liver metastasis LOH Loss of heterozygosity LOY Y chromosome loss LRP1 Low-Density Lipoprotein Receptor-Related Protein 1 LSCC Lung squamous cell carcinoma LUAD Lung adenocarcinoma MC Mucinous adenocarcinoma MCF-7-CM MCF-7 breast cancer cell secretome MCP-counter Microenvironment Cell Populations-counte MDSCs Myeloid-derived suppressor cells METTL3 Methyltransferase Like 3 Mfge8 Milk Fat Globule-EGF Factor 8 MHC Major histocompatibility complex MHC-I Major histocompatibility complex class I MIF Migration inhibitory factor MISTRG6 Mouse model with human M-CSF, IL-3, GM-CSF, SIRPα, ThPO, and IL-6 genes MMP9 Matrix Metallopeptidase 9 MM Multiple myeloma mregDC Mature regulatory dendritic cells NFAT Nuclear factor of activated T cells NFATC2 Nuclear Factor of Activated T-cells, Cytoplasmic 2 NF-κB Nuclear Factor kappa-light-chain-enhancer of activated B cells NHS-IL12 NHS76 Antibody-Human IL-12 Fusion Protein NHA Normal human astrocytes NK Natural killer cells NKGS NK gene signature NKTCL NK/T cell lymphoma NOTCH Notch Homolog NR4A1 Nuclear Receptor Subfamily 4 Group A Member 1 NTRK1 Neurotrophic Receptor Tyrosine Kinase 1 NSCLC Non-small cell lung cancer NY-ESO-1 New York Esophageal Squamous Cell Carcinoma-1 OCCC Ovarian clear cell carcinoma ONECUT2 One Cut Homeobox 2 PABPC1L Poly(A) Binding Protein Cytoplasmic 1 Like PAMPs Pathogen-Associated Molecular Patterns PBAF Polybromo-associated BRG1-associated factor complex PDA Pancreatic Ductal Adenocarcinoma PD-1/PD-L1 Programmed Death-1/Programmed Death-Ligand 1 PD-L1 Programmed cell death ligand 1 PDAC Pancreatic ductal adenocarcinoma PDXs Patient-derived xenografts PI3K Phosphoinositide 3-Kinase PTPN1 Protein tyrosine phosphatase non-receptor type 1 RPS3 Ribosomal protein S3 R/R Relapsed/refractory RTKN2 Rhotekin 2 SASP Senescence-associated secretory phenotype scRNA-seq Single-cell RNA sequencing SCNA Somatic copy number alterations SCD1 Stearoyl-CoA Desaturase 1 sCNV Somatic copy number variation SMARCAL1 SWI/SNF Related, Matrix Associated, Actin Dependent Regulator of Chromatin, Subfamily a, Member 1 SOCS3 Suppressor of cytokine signaling 3 SOX2 SRY-Box transcription factor 2 STAT1 Signal transducer and activator of transcription 1 STING Stimulator of interferon genes TAM Tumor-associated macrophage TAMs Tumor-associated macrophages TBK1 TANK-binding kinase 1 TCGA The Cancer Genome Atlas Tcf1 T cell factor 1 TCR-T T-cell receptor engineered T cells TDO Tryptophan 2,3-Dioxygenase Tfh T follicular helper TFHL T follicular helper lymphoma TGF-β Transforming Growth Factor-beta TILs Tumor-infiltrating lymphocytes TIME Tumor immune microenvironment TLS tertiary lymphoid structures TLR Toll-like receptor TMB Tumor mutational burden TME Tumor microenvironment Tregs Regulatory T cells VEGF Vascular Endothelial Growth Factor VEGF-A Vascular Endothelial Growth Factor-A WNT Wingless WNT2 Wingless-Type MMTV Integration Site Family Member 2 YAP1 Yes-associated protein 1 ZBTB46 Zinc Finger and BTB Domain-Containing Protein 46 References 1. Khosravi G-R Mostafavi S Bastan S Ebrahimi N Gharibvand RS Eskandari N Immunologic tumor microenvironment modulators for turning cold tumors hot Cancer Commun 2024 44 5 521 53 10.1002/cac2.12539 38551889 PMC11110955 2. Ren X Guo S Guan X Kang Y Liu J Yang X Immunological classification of tumor types and advances in precision combination immunotherapy Front Immunol 2022 13 790113 10.3389/fimmu.2022.790113 35296094 PMC8918549 3. Zhang J Huang D Saw PE Song E Turning cold tumors hot: from molecular mechanisms to clinical applications Trends Immunol 2022 43 7 523 45 10.1016/j.it.2022.04.010 35624021 4. Hsieh W-C Budiarto BR Wang Y-F Lin C-Y Gwo M-C So DK et al Spatial multi-omics analyses of the tumor immune microenvironment J Biomed Sci 2022 29 1 96 10.1186/s12929-022-00879-y 36376874 PMC9661775 5. Sun C Wang A Zhou Y Chen P Wang X Huang J et al Spatially resolved multi-omics highlights cell-specific metabolic remodeling and interactions in gastric cancer Nat Commun 2023 14 1 2692 10.1038/s41467-023-38360-5 37164975 PMC10172194 6. Xu Y Su G-H Ma D Xiao Y Shao Z-M Jiang Y-Z Technological advances in cancer immunity: from immunogenomics to single-cell analysis and artificial intelligence Signal Transduct Target Ther 2021 6 1 312 10.1038/s41392-021-00729-7 34417437 PMC8377461 7. Chen D Xu L Xuan M Chu Q Xue C Unveiling the functional roles of patient-derived tumour organoids in assessing the tumour microenvironment and immunotherapy Clin Transl Med 2024 14 9 e1802 10.1002/ctm2.1802 39245957 PMC11381553 8. Litchfield K Reading JL Puttick C Thakkar K Abbosh C Bentham R et al Meta-analysis of tumor- and T cell-intrinsic mechanisms of sensitization to checkpoint inhibition Cell 2021 184 3 596 614.e14 10.1016/j.cell.2021.01.002 33508232 PMC7933824 9. Ziogas DC Theocharopoulos C Koutouratsas T Haanen J Gogas H Mechanisms of resistance to immune checkpoint inhibitors in melanoma: what we have to overcome? Cancer Treat Rev 2023 113 397–404 102499 10.1016/j.ctrv.2022.102499 36542945 10. Montesion M Murugesan K Jin DX Sharaf R Sanchez N Guria A et al Somatic HLA class I loss is a widespread mechanism of immune evasion which refines the use of tumor mutational burden as a biomarker of checkpoint inhibitor response Cancer Discov 2021 11 2 282 92 10.1158/2159-8290.CD-20-0672 33127846 11. Zhang H Hong Z Li P Jiang H Wu P Chen J Identification and validation of an immune evasion molecular subgroup of patients with colon cancer for implications of immunotherapy Front Genet 2022 13 811660 10.3389/fgene.2022.811660 35991554 PMC9389216 12. Luo L Wang Z Hu T Feng Z Zeng Q Shu X et al Multiomics characteristics and immunotherapeutic potential of EZH2 in pan-cancer Biosci Rep 2023 43 1 BSR20222230 10.1042/BSR20222230 36545914 PMC9842950 13. Luengo-Gil G Conesa-Zamora P Potential utility of induced translocation of engineered bacteria as a therapeutic agent for mounting a personalized neoantigen-based tumor immune response Glob Chall 2022 6 3 2100051 10.1002/gch2.202100051 35284089 PMC8902290 14. Luke JJ Bao R Sweis RF Spranger S Gajewski TF WNT/β-catenin pathway activation correlates with immune exclusion across human cancers Clin Cancer Res 2019 25 10 3074 83 10.1158/1078-0432.CCR-18-1942 30635339 PMC6522301 15. Spranger S Bao R Gajewski TF Melanoma-intrinsic β-catenin signalling prevents anti-tumour immunity Nature 2015 523 7559 231 5 10.1038/nature14404 25970248 16. Grasso CS Giannakis M Wells DK Hamada T Mu XJ Quist M et al Genetic mechanisms of immune evasion in colorectal cancer Cancer Discov 2018 8 6 730 49 10.1158/2159-8290.CD-17-1327 29510987 PMC5984687 17. Akasu M Shimada S Kabashima A Akiyama Y Shimokawa M Akahoshi K et al Intrinsic activation of β-catenin signaling by CRISPR/Cas9-mediated exon skipping contributes to immune evasion in hepatocellular carcinoma Sci Rep 2021 11 1 16732 10.1038/s41598-021-96167-0 34429454 PMC8384852 18. Li D Hu W Lin X Zhang J He Z Zhong S et al CARD-associated risk score features the immune landscape and predicts the responsiveness to anti-PD-1 therapy in IDH wild-type gliomas Front Cell Dev Biol 2021 9 653240 10.3389/fcell.2021.653240 33796538 PMC8009185 19. Peng Y Xu Y Zhang X Deng S Yuan Y Luo X et al A novel protein AXIN1-295aa encoded by circAXIN1 activates the Wnt/β-catenin signaling pathway to promote gastric cancer progression Mol Cancer 2021 20 1 158 10.1186/s12943-021-01457-w 34863211 PMC8642992 20. Bi L Zhang C Yao Y He Z Circ-HIPK3 regulates YAP1 expression by sponging miR-381-3p to promote oral squamous cell carcinoma development J Biosci 2021 46 1 20 10.1007/s12038-021-00142-w 33737493 21. Huang G Liang M Liu H Huang J Li P Wang C et al CircRNA hsa_circRNA_104348 promotes hepatocellular carcinoma progression through modulating miR-187-3p/RTKN2 axis and activating Wnt/β-catenin pathway Cell Death Dis 2020 11 12 1065 10.1038/s41419-020-03276-1 33311442 PMC7734058 22. Xu J Wan Z Tang M Lin Z Jiang S Ji L et al N6-methyladenosine-modified CircRNA-SORE sustains sorafenib resistance in hepatocellular carcinoma by regulating β-catenin signaling Mol Cancer 2020 19 1 163 10.1186/s12943-020-01281-8 33222692 PMC7681956 23. Zhu P Liang H Huang X Zeng Q Liu Y Lv J et al Circular RNA Hsa_circ_0004018 Inhibits Wnt/β-catenin signaling pathway by targeting microRNA-626/DKK3 in hepatocellular carcinoma Onco Targets Ther 2020 13 9351 64 10.2147/OTT.S254997 33061423 PMC7519839 24. Huang C Xu R Zhu X Jiang H m6A-modified circABCC4 promotes stemness and metastasis of prostate cancer by recruiting IGF2BP2 to increase stability of CCAR1 Cancer Gene Ther 2023 30 10 1426 40 10.1038/s41417-023-00650-x 37563361 25. Ding L Lin Y Chen X Wang R Lu H Wang H et al. circPHF16 suppresses prostate cancer metastasis via modulating miR-581/RNF128/Wnt/β-catenin pathway Cell Signal 2023 102 9 110557 10.1016/j.cellsig.2022.110557 36503162 26. Dou Y Kawaler EA Cui Zhou D Gritsenko MA Huang C Blumenberg L et al Proteogenomic characterization of endometrial carcinoma Cell 2020 180 4 729 48.e26 10.1016/j.cell.2020.01.026 32059776 PMC7233456 27. Wang ST Liu LB Li XM Wang YF Xie PJ Li Q et al Circ-ITCH regulates triple-negative breast cancer progression through the Wnt/β-catenin pathway Neoplasma 2019 66 2 232 9 10.4149/neo_2018_180710N460 30509108 28. Wu M Qiu Q Zhou Q Li J Yang J Zheng C et al CircFBXO7/miR-96-5p/MTSS1 axis is an important regulator in the Wnt signaling pathway in ovarian cancer Mol Cancer 2022 21 1 137 10.1186/s12943-022-01611-y 35768865 PMC9241180 29. Dholakia J Scalise CB Katre AA Goldsberry WN Meza-Perez S Randall TD et al Sequential modulation of the Wnt/β-catenin signaling pathway enhances tumor-intrinsic MHC I expression and tumor clearance Gynecol Oncol 2022 164 1 170 80 10.1016/j.ygyno.2021.09.026 34844776 PMC9105159 30. Tang L Zhang H Zhou F Wei Q Du M Wu J et al Targeting autophagy overcomes cancer-intrinsic resistance to CAR-T immunotherapy in B-cell malignancies Cancer Commun 2024 44 3 408 32 10.1002/cac2.12525 38407943 PMC10958674 31. Gu Y Zhang Z Camps MGM Ossendorp F Wijdeven RH Ten Dijke P Genome-wide CRISPR screens define determinants of epithelial-mesenchymal transition mediated immune evasion by pancreatic cancer cells Sci Adv 2023 9 28 eadf9915 10.1126/sciadv.adf9915 37450593 PMC10348683 32. Feng X Li Z Liu Y Chen D Zhou Z CRISPR/Cas9 technology for advancements in cancer immunotherapy: from uncovering regulatory mechanisms to therapeutic applications Exp Hematol Oncol 2024 13 1 102 10.1186/s40164-024-00570-y 39427211 PMC11490091 33. Martinez R Finocchiaro C Delhaye L Gysens F Anckaert J Trypsteen W et al A co-culture model to study modulators of tumor immune evasion through scalable arrayed CRISPR-interference screens Front Immunol 2024 15 1444886 10.3389/fimmu.2024.1444886 39497819 PMC11532180 34. Tang X Gao L Jiang X Hou Z Wang Y Hou S et al Single-cell profiling reveals altered immune landscape and impaired NK cell function in gastric cancer liver metastasis Oncogene 2024 43 35 2635 46 10.1038/s41388-024-03114-0 39060439 35. Britton WR Cioffi I Stonebraker C Spence M Okolo O Martin C et al Advancements in TGF-β targeting therapies for head and neck squamous cell carcinoma Cancers 2024 16 17 3047 10.3390/cancers16173047 39272905 PMC11394608 36. Wang J Hu Y Hamidi H Dos Santos C Zhang J Punnoose E et al Immune microenvironment characteristics in multiple myeloma progression from transcriptome profiling Front Oncol 2022 12 948548 10.3389/fonc.2022.948548 36033464 PMC9413314 37. Zhu Y Wu X Zhang Y Gu J Zhou R Guo Z Single cell transcriptomic analysis reveals tumor immune infiltration by NK cells gene signature in lung adenocarcinoma Heliyon 2024 10 13 e33928 10.1016/j.heliyon.2024.e33928 39071697 PMC11283104 38. Xia S Chen L Yu M Li J Chen J Xu F et al Genetic and therapeutic heterogeneity shape the baseline and longitudinal immune ecosystem of ovarian clear cell carcinoma J Immunother Cancer 2024 12 11 e010069 10.1136/jitc-2024-010069 39608974 PMC11603735 39. Azzarito G Visentin M Leeners B Dubey RK Transcriptomic and functional evidence for differential effects of MCF-7 breast cancer cell-secretome on vascular and lymphatic endothelial cell growth Int J Mol Sci 2022 23 13 7192 10.3390/ijms23137192 35806196 PMC9266834 40. Anderson KG Voillet V Bates BM Chiu EY Burnett MG Garcia NM et al Engineered adoptive T-cell therapy prolongs survival in a preclinical model of advanced-stage ovarian cancer Cancer Immunol Res 2019 7 9 1412 25 10.1158/2326-6066.CIR-19-0258 31337659 PMC6726582 41. Frangieh CJ Melms JC Thakore PI Geiger-Schuller KR Ho P Luoma AM et al Multimodal pooled Perturb-CITE-seq screens in patient models define mechanisms of cancer immune evasion Nat Genet 2021 53 3 332 41 10.1038/s41588-021-00779-1 33649592 PMC8376399 42. Kim HK Joung J-G Choi Y-L Lee S-H Park BJ Choi YS et al Earlier-phased cancer immunity cycle strongly influences cancer immunity in operable never-smoker lung adenocarcinoma iScience 2020 23 8 101386 10.1016/j.isci.2020.101386 32795913 PMC7426575 43. Yue B Gao W Lovell JF Jin H Huang J The cGAS-STING pathway in cancer immunity: dual roles, therapeutic strategies, and clinical challenges Essays Biochem 2025 69 2 EBC20253006 10.1042/EBC20253006 40052963 PMC12204001 44. Leuzzi G Vasciaveo A Taglialatela A Chen X Firestone TM Hickman AR et al SMARCAL1 is a dual regulator of innate immune signaling and PD-L1 expression that promotes tumor immune evasion Cell 2024 187 4 861 81.e32 10.1016/j.cell.2024.01.008 38301646 PMC10980358 45. Zhu WD Rao J Zhang LH Xue KM Li L Li JJ et al. OMA1 competitively binds to HSPA9 to promote mitophagy and activate the cGAS-STING pathway to mediate GBM immune escape J Immunother Cancer 2024 12 4 e008718 10.1136/jitc-2023-008718 38604814 PMC11015223 46. Zhou Z Li T Zhang Y Zhou X Song X Ji S et al PCBP2 promotes immune evasion via cGAS-STING pathway in biochemical recurrence of prostate cancer APL Bioeng 2025 9 1 016112 10.1063/5.0250173 40051782 PMC11884866 47. Godsk SH Jensen CMS Larsen TV Ahrenfeldt J Gammelgaard KR Jakobsen MR IFNλ1 is a STING-dependent mediator of DNA damage and induces immune activation in lung cancer Front Immunol 2024 15 1525083 10.3389/fimmu.2024.1525083 40012911 PMC11862833 48. Lin Y Jin H She Y Zhang Y Cui L Xie C et al CBX2 suppresses interferon signaling to diminish tumor immunogenicity via a noncanonical corepressor complex Proc Natl Acad Sci U S A 2025 122 5 e2417529122 10.1073/pnas.2417529122 39883845 PMC11804501 49. Wu R Wang C Li Z Xiao J Li C Wang X et al SOX2 promotes resistance of melanoma with PD-L1 high expression to T-cell-mediated cytotoxicity that can be reversed by SAHA J Immunother Cancer 2020 8 2 e001037 10.1136/jitc-2020-001037 33158915 PMC7651737 50. Yi J Wang L Du J Wang M Shen H Liu Z et al ER-localized JmjC domain-containing protein JMJD8 targets STING to promote immune evasion and tumor growth in breast cancer Dev Cell 2023 58 9 760 78.e6 10.1016/j.devcel.2023.03.015 37054705 51. Goodman ML Trinca GM Walter KR Papachristou EK D’Santos CS Li T et al Progesterone receptor attenuates STAT1-mediated IFN signaling in breast cancer J Immunol 2019 202 10 3076 86 10.4049/jimmunol.1801152 30936295 PMC6504603 52. Yang L Dong X Liu Z Tan J Huang X Wen T et al VPS9D1-AS1 overexpression amplifies intratumoral TGF-β signaling and promotes tumor cell escape from CD8+ T cell killing in colorectal cancer elife 2022 11 e79811 10.7554/eLife.79811 36458816 PMC9744440 53. Brodeur MN Dopeso H Zhu Y Longhini ALF Gazzo A Sun S et al Interferon response and epigenetic modulation by SMARCA4 mutations drive ovarian tumor immunogenicity Sci Adv 2024 10 49 eadk4851 10.1126/sciadv.adk4851 39630912 PMC11616711 54. Li J Jiang Y Ma M Wang L Jing M Yang Z et al Epithelial cell diversity and immune remodeling in bladder cancer progression: insights from single-cell transcriptomics J Transl Med 2025 23 1 135 10.1186/s12967-025-06138-6 39885578 PMC11783851 55. Sade-Feldman M Yizhak K Bjorgaard SL Ray JP de Boer CG Jenkins RW et al Defining T cell states associated with response to checkpoint immunotherapy in melanoma Cell 2018 175 4 998 1013.e20 10.1016/j.cell.2018.10.038 30388456 PMC6641984 56. Chen J López-Moyado IF Seo H Lio C-WJ Hempleman LJ Sekiya T et al NR4A transcription factors limit CAR T cell function in solid tumours Nature 2019 567 7749 530 4 10.1038/s41586-019-0985-x 30814732 PMC6546093 57. Fraietta JA Lacey SF Orlando EJ Pruteanu-Malinici I Gohil M Lundh S et al Determinants of response and resistance to CD19 chimeric antigen receptor (CAR) T cell therapy of chronic lymphocytic leukemia Nat Med 2018 24 5 563 71 10.1038/s41591-018-0010-1 29713085 PMC6117613 58. Kharel A Shen J Brown R Chen Y Nguyen C Alson D et al Loss of PBAF promotes expansion and effector differentiation of CD8+ T cells during chronic viral infection and cancer Cell Rep 2023 42 6 112649 10.1016/j.celrep.2023.112649 37330910 PMC10592487 59. You M Gao Y Fu J Xie R Zhu Z Hong Z et al Epigenetic regulation of HBV-specific tumor-infiltrating T cells in HBV-related HCC Hepatology 2023 78 3 943 58 10.1097/HEP.0000000000000369 36999652 PMC10442105 60. Zhao Y Zhang Q Tu K Chen Y Peng Y Ni Y et al Single-cell transcriptomics of immune cells reveal diversity and exhaustion signatures in non-small-cell lung cancer Front Immunol 2022 13 854724 10.3389/fimmu.2022.854724 35874785 PMC9299430 61. Cao C Xu M Wei Y Peng T Lin S Liu X et al CXCR4 orchestrates the TOX-programmed exhausted phenotype of CD8+ T cells via JAK2/STAT3 pathway Cell Genom 2024 4 10 100659 10.1016/j.xgen.2024.100659 39317187 PMC11602566 62. Busselaar J Tian S van Eenennaam H Borst J Helpless priming sends CD8+ T cells on the road to exhaustion Front Immunol 2020 11 592569 10.3389/fimmu.2020.592569 33123174 PMC7573232 63. Shan Q Hu S Chen X Danahy DB Badovinac VP Zang C et al Ectopic Tcf1 expression instills a stem-like program in exhausted CD8+ T cells to enhance viral and tumor immunity Cell Mol Immunol 2021 18 5 1262 77 10.1038/s41423-020-0436-5 32341523 PMC8093427 64. Wang D Li S Yang Z Yu C Wu P Yang Y et al Single-cell transcriptome analysis deciphers the CD74-mediated immune evasion and tumour growth in lung squamous cell carcinoma with chronic obstructive pulmonary disease Clin Transl Med 2024 14 8 e1786 10.1002/ctm2.1786 39113235 PMC11306293 65. DePasquale EAK Ssozi D Ainciburu M Good J Noel J Villanueva MA et al Single-cell multiomics reveals clonal t-cell expansions and exhaustion in blastic plasmacytoid dendritic cell neoplasm Front Immunol 2022 13 809414 10.3389/fimmu.2022.809414 35359938 PMC8960171 66. He H Chen S Yu Y Fan Z Qian Y Dong Y et al Comprehensive single-cell analysis deciphered microenvironmental dynamics and immune regulator olfactomedin 4 in pathogenesis of gallbladder cancer Gut 2024 73 9 1529 42 10.1136/gutjnl-2023-331773 38719336 PMC11347255 67. Suma S Suehara Y Fujisawa M Abe Y Hattori K Makishima K et al Tumor heterogeneity and immune-evasive T follicular cell lymphoma phenotypes at single-cell resolution Leukemia 2024 38 2 340 50 10.1038/s41375-023-02093-7 38012392 PMC10844096 68. Wang Y Wang Y Liu B Gao X Li Y Li F et al Mapping the tumor microenvironment in clear cell renal carcinoma by single-cell transcriptome analysis Front Genet 2023 14 1207233 10.3389/fgene.2023.1207233 37533434 PMC10392130 69. Salmon H Idoyaga J Rahman A Leboeuf M Remark R Jordan S et al Expansion and activation of CD103 + Immunity 2016 44 4 924 38 10.1016/j.immuni.2016.03.012 27096321 PMC4980762 70. Liu W Hu H Shao Z Lv X Zhang Z Deng X et al Characterizing the tumor microenvironment at the single-cell level reveals a novel immune evasion mechanism in osteosarcoma Bone Res 2023 11 1 4 10.1038/s41413-022-00237-6 36596773 PMC9810605 71. Tucci M Passarelli A Mannavola F Felici C Stucci LS Cives M et al Immune system evasion as hallmark of melanoma progression: the role of dendritic cells Front Oncol 2019 9 1148 10.3389/fonc.2019.01148 31750245 PMC6848379 72. Lu Z Chen J Yu P Atherton MJ Gui J Tomar VS et al Tumor factors stimulate lysosomal degradation of tumor antigens and undermine their cross-presentation in lung cancer Nat Commun 2022 13 1 6623 10.1038/s41467-022-34428-w 36333297 PMC9636202 73. Ou Z Lin S Qiu J Ding W Ren P Chen D et al Single-nucleus RNA sequencing and spatial transcriptomics reveal the immunological microenvironment of cervical squamous cell carcinoma Adv Sci 2022 9 29 e2203040 10.1002/advs.202203040 35986392 PMC9561780 74. Zuyin L Zhao L Qian C Changkun Z Delin M Jialing H et al Single-cell and spatial transcriptomics delineate the microstructure and immune landscape of intrahepatic cholangiocarcinoma in the leading-edge area Adv Sci 2025 12 7 e2412740 10.1002/advs.202412740 39716897 PMC11831447 75. Abdel-Hafiz HA Schafer JM Chen X Xiao T Gauntner TD Li Z et al Y chromosome loss in cancer drives growth by evasion of adaptive immunity Nature 2023 619 7970 624 31 10.1038/s41586-023-06234-x 37344596 PMC10975863 76. Zhou Z Chen X Li Z Wang X Zhang M Overexpression of S100A9 in tumor stroma contribute to immune evasion of NK/T cell lymphoma and predict poor response rate Sci Rep 2021 11 1 11220 10.1038/s41598-021-90794-3 34045609 PMC8160340 77. Lv D Fei Y Chen H Wang J Han W Cui B et al Crosstalk between T lymphocyte and extracellular matrix in tumor microenvironment Front Immunol 2024 15 1340702 10.3389/fimmu.2024.1340702 38690275 PMC11058664 78. Vahabi M Comandatore A Franczak MA Smolenski RT Peters GJ Morelli L et al Role of exosomes in transferring chemoresistance through modulation of cancer glycolytic cell metabolism Cytokine Growth Factor Rev 2023 73 2 163 72 10.1016/j.cytogfr.2023.07.004 37541790 79. Mikuličić S Shamun M Massenberg A Franke A-L Freitag K Döring T et al ErbB2/HER2 receptor tyrosine kinase regulates human papillomavirus promoter activity Front Immunol 2024 15 1335302 10.3389/fimmu.2024.1335302 38370412 PMC10869470 80. Deng C Zhong M-E Chen Y Pan M Xu L Xiao Y et al Proteomic profiling and functional characterization of serum-derived extracellular vesicles in the mucinous and non-mucinous colon adenocarcinoma J Cancer Res Clin Oncol 2023 149 11 9285 300 10.1007/s00432-023-04851-7 37204515 PMC11797523 81. Bignoux MJ Otgaar TC Bernert M Weiss SFT Ferreira E Downregulation of LRP/LR with siRNA inhibits several cancer hallmarks in lung cancer cells FEBS Open Bio 2023 13 2 323 40 10.1002/2211-5463.13544 36579897 PMC9900088 82. Palanichamy K Thirumoorthy K Kanji S Gordon N Singh R Jacob JR et al Methionine and kynurenine activate oncogenic kinases in glioblastoma, and methionine deprivation compromises proliferation Clin Cancer Res 2016 22 14 3513 23 10.1158/1078-0432.CCR-15-2308 26936918 PMC4947420 83. Lo Re O Mazza T Giallongo S Sanna P Rappa F Vinh Luong T et al Loss of histone macroH2A1 in hepatocellular carcinoma cells promotes paracrine-mediated chemoresistance and CD4 + + + Theranostics 2020 10 2 910 24 10.7150/thno.35045 31903159 PMC6929991 84. Soula M Unlu G Welch R Chudnovskiy A Uygur B Shah V et al Glycosphingolipid synthesis mediates immune evasion in KRAS-driven cancer Nature 2024 633 8029 451 8 10.1038/s41586-024-07787-1 39112706 PMC11892728 85. Renauer P Park JJ Bai M Acosta A Lee W-H Lin GH et al Immunogenetic metabolomics reveals key enzymes that modulate CAR T-cell metabolism and function Cancer Immunol Res 2023 11 8 1068 84 10.1158/2326-6066.CIR-22-0565 37253111 PMC10527769 86. Gubin MM Vesely MD Cancer immunoediting in the era of immuno-oncology Clin Cancer Res 2022 28 18 3917 28 10.1158/1078-0432.CCR-21-1804 35594163 PMC9481657 87. Lin W Chen L Zhang H Qiu X Huang Q Wan F et al Tumor-intrinsic YTHDF1 drives immune evasion and resistance to immune checkpoint inhibitors via promoting MHC-I degradation Nat Commun 2023 14 1 265 10.1038/s41467-022-35710-7 36650153 PMC9845301 88. George JT Levine H Optimal cancer evasion in a dynamic immune microenvironment generates diverse post-escape tumor antigenicity profiles Elife 2023 12 e82786 10.7554/eLife.82786 37096883 PMC10129331 89. Chu X Tian Y Lv C Decoding the spatiotemporal heterogeneity of tumor-associated macrophages Mol Cancer 2024 23 1 150 10.1186/s12943-024-02064-1 39068459 PMC11282869 90. Li Z Liu S Gao Z Ji L Jiao J Zheng N et al Dynamic proteomic changes in tumor and immune organs reveal systemic immune response to tumor development Mol Cell Proteomics 2024 23 5 100756 10.1016/j.mcpro.2024.100756 38554776 PMC11060955 91. Sundar R Huang K-K Kumar V Ramnarayanan K Demircioglu D Her Z et al Epigenetic promoter alterations in GI tumour immune-editing and resistance to immune checkpoint inhibition Gut 2022 71 7 1277 88 10.1136/gutjnl-2021-324420 34433583 PMC9185816 92. Chen Y-Z Meng Z-S Xiang Z-L HMGB2 drives tumor progression and shapes the immunosuppressive microenvironment in hepatocellular carcinoma: insights from multi-omics analysis Front Immunol 2024 15 1415435 10.3389/fimmu.2024.1415435 39247201 PMC11380137 93. Zhou Y Mo S Cui H Sun R Zhang W Zhuang X et al Immune-tumor interaction dictates spatially directed evolution of esophageal squamous cell carcinoma Natl Sci Rev 2024 11 5 nwae150 10.1093/nsr/nwae150 38803565 PMC11129594 94. Tang J Wei W Xu Y Chen K Miao Y Fan W et al CXC chemokine receptor 4-mediated immune modulation and tumor microenvironment heterogeneity in gastric cancer: utilizing multi-omics approaches to identify potential therapeutic targets Biofactors 2025 51 1 e2130 10.1002/biof.2130 39431668 95. Sun Y-F Wu L Liu S-P Jiang M-M Hu B Zhou K-Q et al Dissecting spatial heterogeneity and the immune-evasion mechanism of CTCs by single-cell RNA-seq in hepatocellular carcinoma Nat Commun 2021 12 1 4091 10.1038/s41467-021-24386-0 34215748 PMC8253833 96. Tang Z Bai Y Fang Q Yuan Y Zeng Q Chen S et al Spatial transcriptomics reveals tryptophan metabolism restricting maturation of intratumoral tertiary lymphoid structures Cancer Cell 2025 43 6 S1535 6108(25)00112-6 10.1016/j.ccell.2025.03.011 40185093 97. Gao Y He S Meng X Zheng K Cui H Cheng Y et al Multi-omics analysis reveals immunosuppression in oesophageal squamous cell carcinoma induced by creatine accumulation and HK3 deficiency Genome Med 2025 17 1 44 10.1186/s13073-025-01465-1 40329370 PMC12057037 98. Wang C Li J Chen J Wang Z Zhu G Song L et al Multi-omics analyses reveal biological and clinical insights in recurrent stage I non-small cell lung cancer Nat Commun 2025 16 1 1477 10.1038/s41467-024-55068-2 39929832 PMC11811181 99. Liu Z Zhang Z Zhang Y Zhou W Zhang X Peng C et al Spatial transcriptomics reveals that metabolic characteristics define the tumor immunosuppression microenvironment via iCAF transformation in oral squamous cell carcinoma Int J Oral Sci 2024 16 1 9 10.1038/s41368-023-00267-8 38287007 PMC10824761 100. Ge H Pei Z Zhou Z Pei Q Güngör C Zheng L et al Spatial transcriptomics deciphers the immunosuppressive microenvironment in colorectal cancer with tumour thrombus Clin Transl Med 2024 14 12 e70112 10.1002/ctm2.70112 39617739 PMC11608866 101. Enfield KSS Colliver E Lee C Magness A Moore DA Sivakumar M et al Spatial architecture of myeloid and T cells orchestrates immune evasion and clinical outcome in lung cancer Cancer Discov 2024 14 6 1018 47 10.1158/2159-8290.CD-23-1380 38581685 PMC11145179 102. Larroquette M Guegan J-P Besse B Cousin S Brunet M Le Moulec S et al Spatial transcriptomics of macrophage infiltration in non-small cell lung cancer reveals determinants of sensitivity and resistance to anti-PD1/PD-L1 antibodies J Immunother Cancer 2022 10 5 e003890 10.1136/jitc-2021-003890 35618288 PMC9125754 103. Huang D Wang Y Thompson JW Yin T Alexander PB Qin D et al Cancer-cell-derived GABA promotes β-catenin-mediated tumour growth and immunosuppression Nat Cell Biol 2022 24 2 230 41 10.1038/s41556-021-00820-9 35145222 PMC8852304 104. Shi T Zhang Y Wang Y Song X Wang H Zhou X et al DKK1 promotes tumor immune evasion and impedes anti-PD-1 treatment by inducing immunosuppressive macrophages in gastric cancer Cancer Immunol Res 2022 10 12 1506 24 10.1158/2326-6066.CIR-22-0218 36206576 105. Cai N Cheng K Ma Y Liu S Tao R Li Y et al Targeting MMP9 in CTNNB1 mutant hepatocellular carcinoma restores CD8+ T cell-mediated antitumour immunity and improves anti-PD-1 efficacy Gut 2024 73 6 985 99 10.1136/gutjnl-2023-331342 38123979 PMC11103337 106. Huang T-X Tan X-Y Huang H-S Li Y-T Liu B-L Liu K-S et al Targeting cancer-associated fibroblast-secreted WNT2 restores dendritic cell-mediated antitumour immunity Gut 2022 71 2 333 44 10.1136/gutjnl-2020-322924 33692094 PMC8762012 107. Lin H Fu L Zhou X Yu A Chen Y Liao W et al LRP1 induces anti-PD-1 resistance by modulating the DLL4-NOTCH2-CCL2 axis and redirecting M2-like macrophage polarisation in bladder cancer Cancer Lett 2024 593 1 216807 10.1016/j.canlet.2024.216807 38462037 108. Song H Lu T Han D Zhang J Gan L Xu C et al YAP1 inhibition induces phenotype switching of cancer-associated fibroblasts to tumor suppressive in prostate cancer Cancer Res 2024 84 22 3728 42 10.1158/0008-5472.CAN-24-0932 39137404 PMC11565174 109. Shu G Chen M Liao W Fu L Lin M Gui C et al PABPC1L induces IDO1 to promote tryptophan metabolism and immune suppression in renal cell carcinoma Cancer Res 2024 84 10 1659 79 10.1158/0008-5472.CAN-23-2521 38382068 PMC11094425 110. Zhuang Q Dai Z Xu X Bai S Zhang Y Zheng Y et al RNA methyltransferase FTSJ3 regulates the type I interferon pathway to promote hepatocellular carcinoma immune evasion Cancer Res 2024 84 3 405 18 10.1158/0008-5472.CAN-23-2049 37963197 111. Lu M-M Yang Y Exosomal PD-L1 in cancer and other fields: recent advances and perspectives Front Immunol 2024 15 1395332 10.3389/fimmu.2024.1395332 38726017 PMC11079227 112. Smith MR Dixon CB Wang Y Liu Y D’Agostino R Ruiz J et al Targeting NTRK1 enhances immune checkpoint inhibitor efficacy in NTRK1 wild-type non-small cell lung cancer Cancer Res 2024 84 23 4002 16 10.1158/0008-5472.CAN-24-0658 39250241 PMC11611666 113. Song F Hu B Liang X-L Cheng J-W Wang C-G Wang P-X et al Anlotinib potentiates anti-PD1 immunotherapy via transferrin receptor-dependent CD8+ T-cell infiltration in hepatocellular carcinoma Clin Transl Med 2024 14 8 e1738 10.1002/ctm2.1738 39095323 PMC11296886 114. Wang X Tan B Liu J Wang J Chen M Yang Q et al Echinacoside inhibits tumor immune evasion by downregulating inducible PD-L1 and reshaping tumor immune landscape in breast and colorectal cancer Phytomedicine 2024 135 4 156188 10.1016/j.phymed.2024.156188 39488102 115. Cheng Y Han X Lai X Wei X Liposomal honokiol inhibits non-small cell lung cancer progression and enhances PD-1 blockade via suppressing M2 macrophages polarization Phytomedicine 2024 135 156093 10.1016/j.phymed.2024.156093 39531934 116. Masuda S Onishi H Iwamoto N Imaizumi A Koga S Nagao S et al Inhibition of PTPN3 expressed in activated lymphocytes enhances the antitumor effects of anti-PD-1 therapy in head and neck cancer, especially in hypoxic environments J Immunother 2024 47 3 89 97 10.1097/CJI.0000000000000503 38297883 117. Attias M Alvarez F Al-Aubodah T-A Istomine R McCallum P Huang F et al Anti-PD-1 amplifies costimulation in melanoma-infiltrating Th1-like Foxp3+ regulatory T cells to alleviate local immunosuppression J Immunother Cancer 2025 13 1 e009435 10.1136/jitc-2024-009435 39762077 PMC11748786 118. Zeng W Zhang R Huang P Chen M Chen H Zeng X et al Ferroptotic neutrophils induce immunosuppression and chemoresistance in breast cancer Cancer Res 2025 85 3 477 96 10.1158/0008-5472.CAN-24-1941 39531510 PMC11786957 119. Huang Y Li X Zhang Z Xiong L Wang Y Wen Y Photodynamic therapy combined with ferroptosis is a synergistic antitumor therapy strategy Cancers 2023 15 20 5043 10.3390/cancers15205043 37894410 PMC10604985 120. Cai H Ren Y Chen S Wang Y Chu L Ferroptosis and tumor immunotherapy: a promising combination therapy for tumors Front Oncol 2023 13 1119369 10.3389/fonc.2023.1119369 36845720 PMC9945274 121. Zhu W Liu X Yang L He Q Huang D Tan X Ferroptosis and tumor immunity: in perspective of the major cell components in the tumor microenvironment Eur J Pharmacol 2023 961 Suppl. 1 176124 10.1016/j.ejphar.2023.176124 37925133 122. Campesato LF Budhu S Tchaicha J Weng C-H Gigoux M Cohen IJ et al Blockade of the AHR restricts a Treg-macrophage suppressive axis induced by L-Kynurenine Nat Commun 2020 11 1 4011 10.1038/s41467-020-17750-z 32782249 PMC7419300 123. Yang L Zhang Y Yang L Adenosine signaling in tumor-associated macrophages and targeting adenosine signaling for cancer therapy Cancer Biol Med 2024 21 995 1011 10.20892/j.issn.2095-3941.2024.0228 39629670 PMC11667779 124. Bao X Xie L Targeting purinergic pathway to enhance radiotherapy-induced immunogenic cancer cell death J Exp Clin Cancer Res 2022 41 1 222 10.1186/s13046-022-02430-1 35836249 PMC9284706 125. Piovesan D Tan JBL Becker A Banuelos J Narasappa N DiRenzo D et al Targeting CD73 with AB680 (Quemliclustat), a novel and potent small-molecule CD73 inhibitor, restores immune functionality and facilitates antitumor immunity Mol Cancer Ther 2022 21 6 948 59 10.1158/1535-7163.MCT-21-0802 35405741 PMC9381133 126. Pang L Ng KT-P Liu J Yeung W-HO Zhu J Chiu T-LS et al Plasmacytoid dendritic cells recruited by HIF-1α/eADO/ADORA1 signaling induce immunosuppression in hepatocellular carcinoma Cancer Lett 2021 522 2 80 92 10.1016/j.canlet.2021.09.022 34536555 127. Chibaya L Murphy KC DeMarco KD Gopalan S Liu H Parikh CN et al EZH2 inhibition remodels the inflammatory senescence-associated secretory phenotype to potentiate pancreatic cancer immune surveillance Nat Cancer 2023 4 6 872 92 10.1038/s43018-023-00553-8 37142692 PMC10516132 128. Reschke R Enk AH Hassel JC Chemokines and cytokines in immunotherapy of melanoma and other tumors: from biomarkers to therapeutic targets Int J Mol Sci 2024 25 12 6532 10.3390/ijms25126532 38928238 PMC11203481 129. Zhang Z Tang Y Wang Y Xu J Yang X Liu M et al SIN3B loss heats up cold tumor microenvironment to boost immunotherapy in pancreatic cancer Adv Sci 2024 11 43 e2402244 10.1002/advs.202402244 39316363 PMC11578377 130. Su Y Liu J Tian Y Dong H Shi M Zhang J et al HIF-1α mediates immunosuppression and chemoresistance in colorectal cancer by inhibiting CXCL9, -10 and -11 Biomed Pharmacother 2024 173 7092 116427 10.1016/j.biopha.2024.116427 38484558 131. Chen C Lim D Cai Z Zhang F Liu G Dong C et al HDAC inhibitor HPTA initiates anti-tumor response by CXCL9/10-recruited CXCR3+CD4+T cells against PAHs carcinogenicity Food Chem Toxicol 2023 176 Suppl. l 113783 10.1016/j.fct.2023.113783 37059382 132. Wang J Saung MT Li K Fu J Fujiwara K Niu N et al CCR2/CCR5 inhibitor permits the radiation-induced effector T cell infiltration in pancreatic adenocarcinoma J Exp Med 2022 219 5 e20211631 10.1084/jem.20211631 35404390 PMC9006312 133. Sadhukhan P Feng M Illingworth E Sloma I Ooki A Matoso A et al YAP1 induces bladder cancer progression and promotes immune evasion through IL-6/STAT3 pathway and CXCL deregulation J Clin Invest 2024 135 2 e171164 10.1172/JCI171164 39630608 PMC11735109 134. Weber R Riester Z Hüser L Sticht C Siebenmorgen A Groth C et al IL-6 regulates CCR5 expression and immunosuppressive capacity of MDSC in murine melanoma J Immunother Cancer 2020 8 2 e000949 10.1136/jitc-2020-000949 32788238 PMC7422659 135. Yang F Yuan C Chen F Qin ZS Schmitt NC Lesinski GB et al Combined IL6 and CCR2 blockade potentiates antitumor activity of NK cells in HPV-negative head and neck cancer J Exp Clin Cancer Res 2024 43 1 76 10.1186/s13046-024-03002-1 38468260 PMC10929116 136. Li J Feng J Li Z Ni Y Liu L Lei X et al B cell lymphoma 6 promotes hepatocellular carcinoma progression by inhibiting tumor infiltrating CD4 + npj Precis Oncol 2024 8 1 139 10.1038/s41698-024-00625-7 38956432 PMC11220024 137. Kang S Mansurov A Kurtanich T Chun HR Slezak AJ Volpatti LR et al Engineered GM-CSF polarizes protumorigenic tumor-associated macrophages to an antitumorigenic phenotype and potently synergizes with IL-12 immunotherapy J Immunother Cancer 2024 12 12 e009541 10.1136/jitc-2024-009541 39794939 PMC11667343 138. Bauer D Redmon N Mazzio E Soliman KF Apigenin inhibits TNFα/IL-1α-induced CCL2 release through IKBK-epsilon signaling in MDA-MB-231 human breast cancer cells PLoS One 2017 12 4 e0175558 10.1371/journal.pone.0175558 28441391 PMC5404872 139. Masemann D Meissner R Schied T Lichty BD Rapp UR Wixler V et al Synergistic anti-tumor efficacy of oncolytic influenza viruses and B7-H3 immune-checkpoint inhibitors against IC-resistant lung cancers Oncoimmunology 2021 10 1 1885778 10.1080/2162402X.2021.1885778 33643696 PMC7894418 140. Heiniö C Havunen R Santos J de Lint K Cervera-Carrascon V Kanerva A et al TNFa and IL2 encoding oncolytic adenovirus activates pathogen and danger-associated immunological signaling Cells 2020 9 4 798 10.3390/cells9040798 32225009 PMC7225950 141. Houel A Foloppe J Dieu-Nosjean M-C Harnessing the power of oncolytic virotherapy and tertiary lymphoid structures to amplify antitumor immune responses in cancer patients Semin Immunol 2023 69 2002 101796 10.1016/j.smim.2023.101796 37356421 142. Wang G Mu M Zhang Z Chen Y Yang N Zhong K et al Systemic delivery of tannic acid-ferric-masked oncolytic adenovirus reprograms tumor microenvironment for improved therapeutic efficacy in glioblastoma Cancer Gene Ther 2024 31 12 1804 17 10.1038/s41417-024-00839-8 39385009 143. Li Y Shen Y Tang T Tang Z Song W Yang Z et al Oncolytic virus combined with traditional treatment versus traditional treatment alone in patients with cancer: a meta-analysis Int J Clin Oncol 2020 25 11 1901 13 10.1007/s10147-020-01760-4 32757116 144. Jin K-T Du W-L Liu Y-Y Lan H-R Si J-X Mou X-Z Oncolytic virotherapy in solid tumors: the challenges and achievements Cancers 2021 13 4 588 10.3390/cancers13040588 33546172 PMC7913179 145. Li K Zhao Y Hu X Jiao J Wang W Yao H Advances in the clinical development of oncolytic viruses Am J Transl Res 2022 14 4192 206 35836877 PMC9274612 146. Ye J Wei B Zhou G Xu Y He Y Hu X et al Multi-dimensional characterization of apoptosis in the tumor microenvironment and therapeutic relevance in melanoma Cell Oncol 2024 47 4 1333 53 10.1007/s13402-024-00930-0 38502270 PMC11322377 147. Han R Guo H Shi J Zhao S Jia Y Liu X et al Osimertinib in combination with anti-angiogenesis therapy presents a promising option for osimertinib-resistant non-small cell lung cancer BMC Med 2024 22 1 174 10.1186/s12916-024-03389-w 38658988 PMC11040894 148. Yang G Li H Yin J Yao L Yang J Tang J et al Alleviating tumor hypoxia and immunosuppression via sononeoperfusion: a new Ally for potentiating anti-PD-L1 blockade of solid tumor Ultrason Sonochem 2025 112 8 107115 10.1016/j.ultsonch.2024.107115 39482116 PMC11635779 149. Ghadrdoost Nakhchi B Kosuru R Chrzanowska M Towards targeting endothelial rap1B to overcome vascular immunosuppression in cancer Int J Mol Sci 2024 25 18 9853 10.3390/ijms25189853 39337337 PMC11432579 150. Lan J Zeng R Li Z Yang X Liu L Chen L et al Biomimetic nanomodulators with synergism of photothermal therapy and vessel normalization for boosting potent anticancer immunity Adv Mater Weinheim 2024 36 40 2408511 10.1002/adma.202408511 39180264 151. Kim N-H Lee J Kim S-H Kang S-H Bae S Yu C-H et al ALK5/VEGFR2 dual inhibitor TU2218 alone or in combination with immune checkpoint inhibitors enhances immune-mediated antitumor effects Cancer Immunol Immunother 2024 73 10 190 10.1007/s00262-024-03777-4 39105882 PMC11303640 152. Kabir AU Zeng C Subramanian M Wu J Kim M Krchma K et al ZBTB46 coordinates angiogenesis and immunity to control tumor outcome Nat Immunol 2024 25 9 1546 54 10.1038/s41590-024-01936-4 39134750 153. Wang D Ye Q Gu H Chen Z The role of lipid metabolism in tumor immune microenvironment and potential therapeutic strategies Front Oncol 2022 12 984560 10.3389/fonc.2022.984560 36172157 PMC9510836 154. Cheng H Zheng Y Advances in macrophage and T cell metabolic reprogramming and immunotherapy in the tumor microenvironment PeerJ 2024 12 13 e16825 10.7717/peerj.16825 38239299 PMC10795528 155. Xiao B Li G Gulizeba H Liu H Sima X Zhou T et al Choline metabolism reprogramming mediates an immunosuppressive microenvironment in non-small cell lung cancer (NSCLC) by promoting tumor-associated macrophage functional polarization and endothelial cell proliferation J Transl Med 2024 22 1 442 10.1186/s12967-024-05242-3 38730286 PMC11084143 156. Patsoukis N Bardhan K Chatterjee P Sari D Liu B Bell LN et al PD-1 alters T-cell metabolic reprogramming by inhibiting glycolysis and promoting lipolysis and fatty acid oxidation Nat Commun 2015 6 1 6692 10.1038/ncomms7692 25809635 PMC4389235 157. Miska J Lee-Chang C Rashidi A Muroski ME Chang AL Lopez-Rosas A et al HIF-1α is a metabolic switch between glycolytic-driven migration and oxidative phosphorylation-driven immunosuppression of tregs in glioblastoma Cell Rep 2019 27 1 226 37.e4 10.1016/j.celrep.2019.03.029 30943404 PMC6461402 158. Yan J Li W Tian H Li B Yu X Wang G et al Metal-phenolic nanomedicines regulate T-cell antitumor function for sono-metabolic cancer therapy ACS Nano 2023 17 15 14667 77 10.1021/acsnano.3c02428 37486249 159. Dong C Zhao Y Han Y Li M Wang G Targeting glutamine metabolism crosstalk with tumor immune response Biochim Biophys Acta Rev Cancer 2025 1880 1 189257 10.1016/j.bbcan.2024.189257 39746457 160. Jabbarzadeh Kaboli P Roozitalab G Farghadani R Eskandarian Z Zerrouqi A c-MET and the immunological landscape of cancer: novel therapeutic strategies for enhanced anti-tumor immunity Front Immunol 2024 15 1498391 10.3389/fimmu.2024.1498391 39664377 PMC11632105 161. Zhang Y Gu Z Wan J Lou X Liu S Wang Y et al Stearoyl-CoA desaturase-1 dependent lipid droplets accumulation in cancer-associated fibroblasts facilitates the progression of lung cancer Int J Biol Sci 2022 18 16 6114 28 10.7150/ijbs.74924 36439884 PMC9682541 162. Yao Y Chen C Li B Gao W Targeting HVEM-GPT2 axis: a novel approach to T cell activation and metabolic reprogramming in non-small cell lung cancer therapy Cancer Immunol Immunother 2025 74 3 101 10.1007/s00262-025-03949-w 39904774 PMC11794847 163. Wang Y Zhao Q Zhao B Zheng Y Zhuang Q Liao N et al Remodeling tumor-associated neutrophils to enhance dendritic cell-based HCC neoantigen nano-vaccine efficiency Adv Sci 2022 9 11 e2105631 10.1002/advs.202105631 35142445 PMC9009112 164. Li Q Zeng H Liu T Wang P Zhang R Zhao B et al A dendritic cell vaccine for both vaccination and neoantigen-reactive T cell preparation for cancer immunotherapy in mice Nat Commun 2024 15 1 10419 10.1038/s41467-024-54650-y 39613742 PMC11607313 165. Bekri S Rodney-Sandy R Gruenstein D Mei A Bogen B Castle J et al Neoantigen vaccine-induced CD4 T cells confer protective immunity in a mouse model of multiple myeloma through activation of CD8 T cells against non-vaccine, tumor-associated antigens J Immunother Cancer 2022 10 2 e003572 10.1136/jitc-2021-003572 35190376 PMC8862454 166. Zhang W Shi X Huang S Yu Q Wu Z Xie W et al NitraTh epitope-based neoantigen vaccines for effective tumor immunotherapy Cancer Immunol Immunother 2024 73 12 245 10.1007/s00262-024-03830-2 39358493 PMC11447171 167. Lin Z Jiang C Wang P Chen Q Wang B Fu X et al Caveolin-mediated cytosolic delivery of spike nanoparticle enhances antitumor immunity of neoantigen vaccine for hepatocellular carcinoma Theranostics 2023 13 12 4166 81 10.7150/thno.85843 37554274 PMC10405843 168. Rappaport AR Kyi C Lane M Hart MG Johnson ML Henick BS et al A shared neoantigen vaccine combined with immune checkpoint blockade for advanced metastatic solid tumors: phase 1 trial interim results Nat Med 2024 30 4 1013 22 10.1038/s41591-024-02851-9 38538867 169. Li F Deng L Jackson KR Talukder AH Katailiha AS Bradley SD et al Neoantigen vaccination induces clinical and immunologic responses in non-small cell lung cancer patients harboring EGFR mutations J Immunother Cancer 2021 9 7 e002531 10.1136/jitc-2021-002531 34244308 PMC8268925 170. Liao J-Y Zhang S Safety and efficacy of personalized cancer vaccines in combination with immune checkpoint inhibitors in cancer treatment Front Oncol 2021 11 663264 10.3389/fonc.2021.663264 34123821 PMC8193725 171. Liu Q Li J Zheng H Yang S Hua Y Huang N et al Adoptive cellular immunotherapy for solid neoplasms beyond CAR-T Mol Cancer 2023 22 1 28 10.1186/s12943-023-01735-9 36750830 PMC9903509 172. Zappa E Vitali A Anders K Molenaar JJ Wienke J Künkele A Adoptive cell therapy in paediatric extracranial solid tumours: current approaches and future challenges Eur J Cancer 2023 194 1 113347 10.1016/j.ejca.2023.113347 37832507 PMC10695178 173. Qayoom H Sofi S Mir MA Targeting tumor microenvironment using tumor-infiltrating lymphocytes as therapeutics against tumorigenesis Immunol Res 2023 71 4 588 99 10.1007/s12026-023-09376-2 37004645 174. Lv L Wu Y Shi H Sun X Deng Z Huo H et al Efficacy and safety of chimeric antigen receptor T-cells treatment in central nervous system lymphoma: a PRISMA-compliant single-arm meta-analysis Cancer Immunol Immunother 2023 72 1 211 21 10.1007/s00262-022-03246-w 35796863 PMC10991213 175. Bastin DJ Montroy J Kennedy MA Martel AB Shorr R Ghiasi M et al Safety and efficacy of autologous cell vaccines in solid tumors: a systematic review and meta-analysis of randomized control trials Sci Rep 2023 13 1 3347 10.1038/s41598-023-29630-9 36849805 PMC9971202 176. Saeidpour Masouleh S Nasiri K Ostovar Ravari A Saligheh Rad M Kiani K Sharifi Sultani A et al Advances and challenges in CAR-T cell therapy for head and neck squamous cell carcinoma Biomark Res 2025 13 1 69 10.1186/s40364-025-00783-1 40312353 PMC12044960 177. He W Cui K Farooq MA Huang N Zhu S Jiang D et al TCR-T cell therapy for solid tumors: challenges and emerging solutions Front Pharmacol 2025 16 1493346 10.3389/fphar.2025.1493346 40129944 PMC11931055 178. Park H Kim G Kim N Ha S Yim H Efficacy and safety of natural killer cell therapy in patients with solid tumors: a systematic review and meta-analysis Front Immunol 2024 15 1454427 10.3389/fimmu.2024.1454427 39478866 PMC11522797 179. Jung H Kim HS Kim JY Sun J-M Ahn JS Ahn M-J et al DNA methylation loss promotes immune evasion of tumours with high mutation and copy number load Nat Commun 2019 10 1 4278 10.1038/s41467-019-12159-9 31537801 PMC6753140 180. Tovar Perez JE Zhang S Hodgeman W Kapoor S Rajendran P Kobayashi KS et al Epigenetic regulation of major histocompatibility complexes in gastrointestinal malignancies and the potential for clinical interception Clin Epigenetics 2024 16 1 83 10.1186/s13148-024-01698-8 38915093 PMC11197381 181. Sim W Lim W-M Hii L-W Leong C-O Mai C-W Targeting pancreatic cancer immune evasion by inhibiting histone deacetylases World J Gastroenterol 2022 28 18 1934 45 10.3748/wjg.v28.i18.1934 35664961 PMC9150054 182. Darvin P Sasidharan Nair V Elkord E PD-L1 expression in human breast cancer stem cells is epigenetically regulated through posttranslational histone modifications J Oncol 2019 2019 3958908 10.1155/2019/3958908 30915120 PMC6409026 183. Sasidharan Nair V El Salhat H Taha RZ John A Ali BR Elkord E DNA methylation and repressive H3K9 and H3K27 trimethylation in the promoter regions of PD-1, CTLA-4, TIM-3, LAG-3, TIGIT, and PD-L1 genes in human primary breast cancer Clin Epigenetics 2018 10 1 78 10.1186/s13148-018-0512-1 29983831 PMC6003083 184. Yasunaga J-I Viral, genetic, and immune factors in the oncogenesis of adult T-cell leukemia/lymphoma Int J Hematol 2023 117 4 504 11 10.1007/s12185-023-03547-5 36705848 185. He Y Fang Y Zhang M Zhao Y Tu B Shi M et al Remodeling cold tumor immune microenvironment via epigenetic-based therapy using targeted liposomes with in situ Acta Pharm Sin B 2022 12 4 2057 73 10.1016/j.apsb.2021.09.022 35847495 PMC9279642 186. Minnar CM Chariou PL Horn LA Hicks KC Palena C Schlom J et al Tumor-targeted interleukin-12 synergizes with entinostat to overcome PD-1/PD-L1 blockade-resistant tumors harboring MHC-I and APM deficiencies J Immunother Cancer 2022 10 6 e004561 10.1136/jitc-2022-004561 35764364 PMC9240938 187. Moufarrij S Srivastava A Gomez S Hadley M Palmer E Austin PT et al Combining DNMT and HDAC6 inhibitors increases anti-tumor immune signaling and decreases tumor burden in ovarian cancer Sci Rep 2020 10 1 3470 10.1038/s41598-020-60409-4 32103105 PMC7044433 188. Li X Ma S Deng Y Yi P Yu J Targeting the RNA m6A modification for cancer immunotherapy Mol Cancer 2022 21 1 76 10.1186/s12943-022-01558-0 35296338 PMC8924732 189. Wu H Chen S Hu Z Ge R Ma L You C et al Exploring the prognostic potential of m6A methylation regulators in low-grade glioma: implications for tumor microenvironment modulation Eur J Med Res 2024 29 1 19 10.1186/s40001-023-01621-6 38173044 PMC10763210 190. Jiang F Hu Y Liu X Wang M Wu C Methylation pattern mediated by m6A regulator and tumor microenvironment invasion in lung adenocarcinoma Oxid Med Cell Longev 2022 2022 1 2930310 10.1155/2022/2930310 35035657 PMC8756160 191. Gan L Zhao Y Fu Y Chen Q The potential role of m6A modifications on immune cells and immunotherapy Biomed Pharmacother 2023 160 35 114343 10.1016/j.biopha.2023.114343 36758318 192. Jiang T-Q Wang H Cheng W-X Xie C Modulation of host N6-methyladenosine modification by gut microbiota in colorectal cancer World J Gastroenterol 2024 30 38 4175 93 10.3748/wjg.v30.i38.4175 39493326 PMC11525875 193. Shen S Liu B Guan W Liu Z Han Y Hu Y et al Advancing precision medicine in esophageal squamous cell carcinoma using patient-derived organoids J Transl Med 2024 22 1 1168 10.1186/s12967-024-05967-1 39741269 PMC11686971 194. Zhou Z Van der Jeught K Li Y Sharma S Yu T Moulana I et al A T cell-engaging tumor organoid platform for pancreatic cancer immunotherapy Adv Sci 2023 10 23 e2300548 10.1002/advs.202300548 37271874 PMC10427404 195. Capasso A Lang J Pitts TM Jordan KR Lieu CH Davis SL et al Characterization of immune responses to anti-PD-1 mono and combination immunotherapy in hematopoietic humanized mice implanted with tumor xenografts J Immunother Cancer 2019 7 1 37 10.1186/s40425-019-0518-z 30736857 PMC6368764 196. Lê H Deforges J Hua G Idoux-Gillet Y Ponté C Lindner V et al In vitro iScience 2023 26 10 108094 10.1016/j.isci.2023.108094 37860774 PMC10582498 197. An Y He Y Ge N Guo J Yang F Sun S Organoids to remodel SARS-CoV-2 research: updates, limitations and perspectives Aging Dis 2023 14 5 1677 99 10.14336/AD.2023.0209 37196111 PMC10529756 198. Qu S Xu R Yi G Li Z Zhang H Qi S et al Patient-derived organoids in human cancer: a platform for fundamental research and precision medicine Mol Biomed 2024 5 1 6 10.1186/s43556-023-00165-9 38342791 PMC10859360 199. Yuan Z Zhou H Cao D Yang J Liu Q Humanized patient-derived xenograft mouse model bearing ovarian clear cell carcinoma J Gynecol Oncol 2024 36 3 605 10.3802/jgo.2025.36.e40 39453393 PMC12099037 200. Chiorazzi M Martinek J Krasnick B Zheng Y Robbins KJ Qu R et al Autologous humanized PDX modeling for immuno-oncology recapitulates features of the human tumor microenvironment J Immunother Cancer 2023 11 7 e006921 10.1136/jitc-2023-006921 37487666 PMC10373695 201. Oswald E Bug D Grote A Lashuk K Bouteldja N Lenhard D et al Immune cell infiltration pattern in non-small cell lung cancer PDX models is a model immanent feature and correlates with a distinct molecular and phenotypic make-up J Immunother Cancer 2022 10 4 e004412 10.1136/jitc-2021-004412 35483746 PMC9052060 202. Yan C Nebhan CA Saleh N Shattuck-Brandt R Chen S-C Ayers GD et al Generation of orthotopic patient-derived xenografts in humanized mice for evaluation of emerging targeted therapies and immunotherapy combinations for melanoma Cancers 2023 15 14 3695 10.3390/cancers15143695 37509357 PMC10377652 203. Chuprin J Buettner H Seedhom MO Greiner DL Keck JG Ishikawa F et al Humanized mouse models for immuno-oncology research Nat Rev Clin Oncol 2023 20 3 192 206 10.1038/s41571-022-00721-2 36635480 PMC10593256 204. Jin J Yoshimura K Sewastjanow-Silva M Song S Ajani JA Challenges and prospects of patient-derived xenografts for cancer research Cancers 2023 15 17 4352 10.3390/cancers15174352 37686627 PMC10486659 205. Li L Sun M Wang J Wan S Multi-omics based artificial intelligence for cancer research Adv Cancer Res 2024 163 6 303 56 10.1016/bs.acr.2024.06.005 39271266 206. Purde M-T Cupovic J Palmowski YA Makky A Schmidt S Rochwarger A et al A replicating LCMV-based vaccine for the treatment of solid tumors Mol Ther 2024 32 2 426 39 10.1016/j.ymthe.2023.11.026 38058126 PMC10861942 207. Stahlberg EA Abdel-Rahman M Aguilar B Asadpoure A Beckman RA Borkon LL et al Exploring approaches for predictive cancer patient digital twins: opportunities for collaboration and innovation Front Digit Health 2022 4 1007784 10.3389/fdgth.2022.1007784 36274654 PMC9586248 208. D’Orsi L Capasso B Lamacchia G Pizzichini P Ferranti S Liverani A et al Recent advances in artificial intelligence to improve immunotherapy and the use of digital twins to identify prognosis of patients with solid tumors Int J Mol Sci 2024 25 21 11588 10.3390/ijms252111588 39519142 PMC11546512 209. Wang H Arulraj T Ippolito A Popel AS From virtual patients to digital twins in immuno-oncology: lessons learned from mechanistic quantitative systems pharmacology modeling npj Digit Med 2024 7 1 189 10.1038/s41746-024-01188-4 39014005 PMC11252162 210. Padoan A Plebani M Dynamic mirroring: unveiling the role of digital twins, artificial intelligence and synthetic data for personalized medicine in laboratory medicine Clin Chem Lab Med 2024 62 11 2156 61 10.1515/cclm-2024-0517 38726708 211. Bera K Schalper KA Rimm DL Velcheti V Madabhushi A Artificial intelligence in digital pathology—new tools for diagnosis and precision oncology Nat Rev Clin Oncol 2019 16 11 703 15 10.1038/s41571-019-0252-y 31399699 PMC6880861 212. Zhu B Yin H Zhang D Zhang M Chao X Scimeca L et al Synthetic biology approaches for improving the specificity and efficacy of cancer immunotherapy Cell Mol Immunol 2024 21 5 436 47 10.1038/s41423-024-01153-x 38605087 PMC11061174 213. Garcia JM Burnett CE Roybal KT Toward the clinical development of synthetic immunity to cancer Immunol Rev 2023 320 1 83 99 10.1111/imr.13245 37491719 214. Su F-Y Mac QD Sivakumar A Kwong GA Interfacing biomaterials with synthetic T Cell immunity Adv Healthc Mater 2021 10 15 e2100157 10.1002/adhm.202100157 33887123 PMC8349871 215. Zhao S Li Z Liu K Wang G Wang Q Yu H et al Combining multi-omics analysis with machine learning to uncover novel molecular subtypes, prognostic markers, and insights into immunotherapy for melanoma BMC Cancer 2025 25 1 630 10.1186/s12885-025-14012-3 40200221 PMC11978174 216. Liu Z Han L Ji X Wang X Jian J Zhai Y et al Multi-omics analysis and experiments uncover the function of cancer stemness in ovarian cancer and establish a machine learning-based model for predicting immunotherapy responses Front Immunol 2024 15 1486652 10.3389/fimmu.2024.1486652 39726597 PMC11670203 217. Tian J Zhang L Shi K Yang L The role of mitophagy-related genes in prognosis and immunotherapy of cutaneous melanoma: a comprehensive analysis based on single-cell RNA sequencing and machine learning Immunol Res 2025 73 1 30 10.1007/s12026-025-09593-x 39799269 218. Song X Xiong A Wu F Li X Wang J Jiang T et al Spatial multi-omics revealed the impact of tumor ecosystem heterogeneity on immunotherapy efficacy in patients with advanced non-small cell lung cancer treated with bispecific antibody J Immunother Cancer 2023 11 2 e006234 10.1136/jitc-2022-006234 36854570 PMC9980352 219. Ye G Wu G Zhang C Wang M Liu H Song E et al CT-based quantification of intratumoral heterogeneity for predicting pathologic complete response to neoadjuvant immunochemotherapy in non-small cell lung cancer Front Immunol 2024 15 1414954 10.3389/fimmu.2024.1414954 38933281 PMC11199789 ",
  "metadata": {
    "Title of this paper": "CT-based quantification of intratumoral heterogeneity for predicting pathologic complete response to neoadjuvant immunochemotherapy in non-small cell lung cancer",
    "Journal it was published in:": "Oncology Research",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12494119/"
  }
}