{
  "title": "Paper_1179",
  "abstract": "pmc Vaccines (Basel) Vaccines (Basel) 2764 vaccines vaccines Vaccines 2076-393X Multidisciplinary Digital Publishing Institute  (MDPI) PMC12474329 PMC12474329.1 12474329 12474329 41012100 10.3390/vaccines13090894 vaccines-13-00894 1 Review Review of Human Papillomavirus Vaccination Programs in United States Schools Duran Cassandra 1 2 * Gupta Aditi 1 2 Aririguzo Lynda 1 2 Castillo Norma 1 2 https://orcid.org/0000-0001-5192-5095 Misra Sanghamitra M. 1 2 Plans-Rubió Pedro Academic Editor 1 aditi.gupta@bcm.edu lynda.aririguzo@bcm.edu norma.castillo@bcm.edu smisra@bcm.edu 2 * cassandg@bcm.edu 23 8 2025 9 2025 13 9 497676 894 01 7 2025 14 8 2025 21 8 2025 23 08 2025 28 09 2025 29 09 2025 © 2025 by the authors. 2025 https://creativecommons.org/licenses/by/4.0/ Licensee MDPI, Basel, Switzerland. This article is an open access article distributed under the terms and conditions of the Creative Commons Attribution (CC BY) license ( https://creativecommons.org/licenses/by/4.0/ Background: School vaccination programs (school-based and school-located) that include the human papillomavirus (HPV) vaccine have been implemented throughout the United States since 2009. Methods: We conducted a review of school HPV vaccination programs in PUBMED, Google Scholar, Web of Science, Ovid, Medline, and Embase and included peer-reviewed studies originating in the United States that focused on any aspect of HPV school vaccination programs. Results: Our review yielded 47 articles that fell into several categories: (1) parent and child perceptions, (2) school nurse perceptions, (3) development, (4) implementation, (5) outcomes, and (6) barriers and facilitators of HPV vaccination programs in schools. Conclusions: School vaccination programs including the HPV vaccine have been implemented successfully all over the United States. Overall, nurse, parent, and student perceptions are positive, but there are various barriers to program success. Successes and failures of school HPV vaccination programs should be examined to develop best practices to sustain and expand these impactful programs. Human Papillomavirus (HPV) HPV vaccine adolescent vaccines school-based vaccination programs This research received no external funding. pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement no pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes 1. Introduction Human papillomavirus (HPV) is one of the most common sexually transmitted infections (STIs) worldwide and the most common STI in the United States [ 1 2 3 4 It is important to distinguish between various models of delivering vaccinations in or around school settings. School-based vaccination programs SBVPs school-located vaccination programs SLVPs Extramural clinics mass vaccination clinics 4 school vaccination programs The implementation of school vaccination programs that include the HPV vaccine has faced varied perceptions and challenges. Public attitudes toward HPV vaccination are influenced by factors such as cultural beliefs, a perceived link between the HPV vaccine and sexual activity, and parental concerns about safety and side effects [ 5 6 In this review, we examine the existing literature on perceptions of HPV vaccination in schools, as well as the design and effectiveness of school vaccination programs that include the HPV vaccine. We highlight strategies that have been successful in overcoming barriers to vaccination and identify areas where further improvements and advocacy are needed. 2. Methods A thorough literature review of published articles on HPV school vaccination programs was completed in PUBMED, Google Scholar, Web of Science, Ovid, Medline, and Embase. We included peer-reviewed articles originating in the United States that focused on any aspect of HPV school vaccination programs. Search terms were “HPV vaccine school-based uptake programs” AND “school-based HPV vaccination programs.” The reference list for each peer-reviewed article was thoroughly reviewed in order to include all of the HPV school vaccination programs in the United States. We included studies involving children ages 9–18, in English language, no editorials, no letters, and no abstracts. We excluded articles on school vaccination programs that did not offer the HPV vaccine, did not take place in the US, or included college students. 3. Relevant Sections Our review yielded 47 relevant articles that we categorized into groups: (1) parent and child perceptions, (2) school nurse perceptions, (3) development, (4) implementation, (5) outcomes, and (6) barriers and facilitators of HPV vaccination programs in schools. 3.1. Perceptions of HPV Vaccination Among Parents and Children Parent and child comfort with vaccination programs in schools as a place to receive the HPV vaccination is generally high (50–81%) [ 7 8 9 10 11 12 13 14 15 16 11 17 18 7 19 12 19 20 16 21 7 13 14 20 20 7 7 9 18 21 21 Parents who support their child getting vaccinated in school mention indirect benefits, such as increased adolescent responsibility, giving the adolescent time to learn about the vaccine themselves, and reinforcing the importance of the HPV vaccination [ 18 10 9 Both parents and adolescents have noted concerns with getting vaccinated at school. One of the most commonly discussed concerns was record keeping, specifically having all of the adolescent’s vaccination records in one place [ 10 13 18 19 21 8 9 18 11 13 18 19 Some adolescent perceptions of receiving vaccinations in school vary from those of their parents. Although adolescents, like their parents, associate HPV vaccination at school with increased responsibility and allowing them an opportunity to take care of their own health, they are concerned about fragmented medical care and would prefer to receive all of their medical care in one place [ 18 18 7 7 8 8 14 17 The HPV vaccine is not mandatory for school entry in the US. There are mixed perceptions of whether it should be required. Lower income parents or those whose children are uninsured or have Medicaid are more likely to agree that HPV vaccination should be required for school [ 22 22 15 9 15 9 9 Comfort with receiving HPV vaccination in schools as compared to comfort with receiving other adolescent vaccinations including TdaP, MCV4, and Influenza varies. Willingness to consent for HPV vaccination ranges from 27 to 53%, which is lower than the willingness to consent for other adolescent vaccinations (57–67% for Influenza, 41–72% for TdaP, 35–71% for Meningitis) [ 12 19 23 12 3.2. Perception of HPV Vaccination Among School Nurses School nurses are ideal partners for promoting HPV vaccination since they monitor student immunization compliance, specifically in underserved areas [ 24 25 8 3.3. Development of HPV Vaccination Program in Schools The development of targeted and successful vaccination programs in schools is determined by several factors, such as the age range of patients, cost (time and resources), and long-term impact of preventing and reducing HPV-related cancer rates [ 26 27 27 28 29 30 31 27 31 30 31 Program developers should consider existing laws, potential legal barriers, and specific school needs when developing their intervention [ 32 32 29 One important way to increase parent trust and program participation is to appropriately tailor the literacy level of educational materials about the HPV vaccine and its importance [ 32 29 33 33 31 29 33 Setting realistic expectations and considering challenges are important quality improvement strategies for program development. Challenges include billing procedures, insurance verification, eligibility for services, and often time-consuming grant writing [ 34 3.4. Implementation of HPV Vaccination Programs in Schools HPV vaccination in schools is generally implemented through a school-based health center (SBHC)/school-based vaccination program, school-located vaccination program, or extramural program [ 30 35 36 30 30 35 SBHCs, operating in approximately 6% of schools in the US, generally bill public and private third-party payers for vaccines [ 35 37 35 37 38 37 38 School-located vaccination clinics and extramural programs require coordination among partners [ 27 30 31 34 35 36 27 30 35 27 30 36 27 30 34 36 30 31 31 36 All school vaccination programs must obtain parental consent prior to vaccination. Printed consent forms can be sent home with students, and students can then return consent forms to teachers, school nurses, or other school representatives, or the program can provide stamped envelopes for parents to mail back the consent forms [ 27 30 34 30 34 30 31 34 36 30 Consent packets commonly include a consent form, health insurance information, health questionnaires, and student immunization records [ 30 34 34 Programs must coordinate with schools to determine the preferred time of the school day for vaccinations. They may choose to vaccinate before, during, or after school or at other school events where parents may be present [ 30 36 30 36 34 34 30 34 35 36 30 30 34 35 3.5. Outcomes of HPV Vaccination Programs in Schools A variety of studies have been published analyzing the effectiveness and impact of HPV vaccination in schools. Although studies focus on different outcome measures, all the data is useful in understanding the effect of these programs. Table 1 There are important points to note from these studies. Parents in lower income settings are willing to utilize HPV vaccination programs in schools to protect their adolescent children from HPV [ 43 47 47 47 42 p 42 42 One study reviewed HPV vaccine doses in the immunization registry for adolescents born during 1995–2000 in Seattle, Washington, to record how many used school-based health centers for any of the HPV vaccine doses. Of the 12,676 females who received the HPV vaccine, 1186 (9.4%) received one or more doses from an M-SBHC, and 511 (4%) received one or more doses from an M-SBHC [ 44 46 46 4. Discussions Implementing HPV vaccination programs in schools often results in a variety of logistical challenges, and many of the challenges are uniquely different for each program. Various factors affect success, such as the school leadership buy-in, consent procedure difficulties (parents not receiving the consent forms and children not returning the forms or returning incomplete forms), the high cost for private-stock vaccines for those ineligible for Vaccines for Children vaccines, billing/collection complications (if applicable), the appropriate transport of vaccines, coordination with school nurses, difficulty accessing statewide immunization registry data, and student schedules allowing vaccination during the school day [ 4 39 47 48 Possible strategies to increase HPV vaccine uptake include student incentives, parent reminders, and obtaining consent from parents when at the school [ 48 p p 38 5. Conclusions There is significant evidence to support HPV vaccination programs in schools. In general, HPV vaccination programs in schools improve HPV vaccination rates. An increase in HPV knowledge and awareness was also noted with the use of HPV vaccination programs in schools. The convenience of these programs is noted by parents and children, and school leadership is generally appreciative of the collaboration to protect their students from HPV disease and potential cancers. Despite the overall effectiveness of these programs, the success of HPV vaccination programs in schools varies widely by program. 6. Future Directions Strategically focusing on barriers and facilitators of HPV vaccination programs can greatly affect the outcomes of these programs. To continue improving HPV vaccination rates across the country, vaccination programs in schools should be promoted and expanded. Disclaimer/Publisher’s Note: Author Contributions Conceptualization, S.M.M. and C.D.; methodology, C.D.; software, S.M.M.; validation, S.M.M., C.D., A.G., L.A. and N.C.; formal analysis, C.D.; investigation, S.M.M., C.D., A.G., L.A. and N.C.; resources, C.D.; data curation, S.M.M., C.D., A.G., L.A. and N.C.; writing—original draft preparation, S.M.M., C.D., A.G., L.A. and N.C.; writing—review and editing, S.M.M., C.D., A.G., L.A. and N.C.; visualization, S.M.M.; supervision, C.D.; project administration, C.D. All authors have read and agreed to the published version of the manuscript. Institutional Review Board Statement Not applicable. Informed Consent Statement Not applicable. Data Availability Statement The original contributions presented in this study are included in the article. Further inquiries can be directed to the corresponding author(s). Conflicts of Interest The authors declare no conflicts of interest. Abbreviations The following abbreviations are used in this manuscript: HPV Human papillomavirus SBVP School-based vaccination program SLVP School-located vaccination program STI Sexually transmitted infection References 1. Lewis R.M. Laprise J.-F. Gargano J.W. Unger E.R. Querec T.D. Chesson H.W. Brisson M. Markowitz L.E. Estimated Prevalence and Incidence of Disease-Associated Human Papillomavirus Types Among 15- to 59-Year-Olds in the United States Sex. Transm. Dis. 2021 48 273 277 10.1097/OLQ.0000000000001356 33492097 PMC10037549 2. Centers for Disease Control and Prevention Cancers Associated with Human Papillomavirus. Centers for Disease Control and Prevention Department of Health and Human Services 2024 Available online: https://www.cdc.gov/united-states-cancer-statistics/publications/hpv-associated-cancers.html#:~:text=It%20is%20estmated%20that%20about,adults%20through%20age%2026%20years (accessed on 13 April 2025) 3. Devadasan J.D.C. Nithyanandhan K. Fletcher G.J. Kannangai R. Abraham P. HPV vaccines—A game changer for preventing HPV-related cancers Indian J. Med. Microbiol. 2025 55 100847 10.1016/j.ijmmb.2025.100847 40221095 4. Kempe A. Allison M.A. Daley M.F. Can School-Located Vaccination Have a Major Impact on Human Papillomavirus Vaccination Rates in the United States? Acad. Pediatr. 2018 18 S101 S105 10.1016/j.acap.2017.08.010 29502627 5. Radisic G. Chapman J. Flight I. Wilson C. Factors associated with parents’ attitudes to the HPV vaccination of their adolescent sons: A systematic review Prev. Med. 2016 95 26 37 10.1016/j.ypmed.2016.11.019 27932052 6. Smolarczyk K. Duszewska A. Drozd S. Majewski S. Parents’ Knowledge and Attitude towards HPV and HPV Vaccination in Poland Vaccines 2022 10 228 10.3390/vaccines10020228 35214686 PMC8876926 7. McRee A.-L. Reiter P.L. Pepper J.K. Brewer N.T. Correlates of comfort with alternative settings for HPV vaccine delivery Vaccines Immunother. 2013 9 306 313 10.4161/hv.22614 23291948 PMC3859752 8. Nodulman J.A. Starling R. Kong A.S. Buller D.B. Wheeler C.M. Woodall W.G. Investigating stakeholders attitudes and opinions on School-Based human papillomavirus vaccination programs J. Sch. Health 2015 85 289 298 10.1111/josh.12253 25846308 PMC4576450 9. Vercruysse J. Chigurupati N.L. Fung L. Apte G. Pierre-Joseph N. Perkins R.B. Parents’ and providers’ attitudes toward school-located provision and school-entry requirements for HPV vaccines Hum. Vaccines Immunother. 2016 12 1606 1614 10.1080/21645515.2016.1140289 PMC4964627 26934421 10. Shin M.B. Sloan K. Baezconde-Garbanati L. Dang E. Garcia S. Palinkas L.A. Unger J.B. Willgerodt M. Crabtree B.F. Tsui J. Multilevel perspectives on school-based opportunities to improve HPV vaccination among medically underserved adolescents: Beyond school entry mandates Hum. Vaccines Immunother. 2023 19 2251815 10.1080/21645515.2023.2251815 PMC10478734 37666253 11. Middleman A.B. Tung J.S. At what sites are parents willing to have their 11 through 14-year-old adolescents immunized? Vaccine 2010 28 2674 2678 10.1016/j.vaccine.2010.01.006 20085835 12. Venkatesh S.R. Acosta A.B. Middleman A.B. Private Middle School Parents’ Perspectives Regarding School-Located Immunization Programs (SLIPs) J. Sch. Nurs. 2013 29 315 319 10.1177/1059840513486010 23598568 13. Kadis J.A. McRee A.-L. Gottlieb S.L. Lee M.R. Reiter P.L. Dittus P.J. Brewer N.T. Mothers’ support for voluntary provision of HPV vaccine in schools Vaccine 2011 29 2542 2547 10.1016/j.vaccine.2011.01.067 21300097 PMC4018209 14. Gargano L.M. Weiss P. Underwood N.L. Seib K. Sales J.M. Vogt T.M. Rask K. Morfaw C. Murray D.L. DiClemente R.J. School-Located Vaccination Clinics for Adolescents: Correlates of Acceptance Among Parents J. Community Health 2014 40 660 669 10.1007/s10900-014-9982-z PMC11901353 25528325 15. Horn L.B. Howard C.B. Waller J. Ferris D.G. Opinions of Parents About School-Entry Mandates for the Human Papillomavirus Vaccine J. Low. Genit. Tract Dis. 2010 14 43 48 10.1097/LGT.0b013e3181b0fad4 20040835 16. Won T.L. Middleman A.B. Auslander B.A. Short M.B. Trust and a School-Located Immunization Program J. Adolesc. Health 2015 56 S33 S39 10.1016/j.jadohealth.2014.09.018 25863553 17. Pyrzanowski J. Curtis C.R. Crane L.A. Barrow J. Beaty B. Kempe A. Daley M.F. Adolescents’ Perspectives on Vaccination Outside the Traditional Medical Home Clin. Pediatr. 2013 52 329 337 10.1177/0009922813475703 23406720 18. Hansen C.E. Okoloko E. Ogunbajo A. North A. Niccolai L.M. Acceptability of School-Based Health Centers for Human Papillomavirus Vaccination Visits: A Mixed-Methods Study J. Sch. Health 2017 87 705 714 10.1111/josh.12540 28766319 PMC5657244 19. Kelminson K. Saville A. Seewald L. Stokley S. Dickinson L.M. Daley M.F. Suh C. Kempe A. Parental Views of School-Located Delivery of Adolescent Vaccines J. Adolesc. Health 2012 51 190 196 10.1016/j.jadohealth.2011.11.016 22824451 20. Rickert V.I. Auslander B.A. Cox D.S. Rosenthal S.L. Rickert J.A. Rupp R. Zimet G.D. School-based vaccination of young US males: Impact of health beliefs on intent and first dose acceptance Vaccine 2014 32 1982 1987 10.1016/j.vaccine.2014.01.049 24492015 21. Clevenger L.-M. Pyrzanowski J. Curtis C.R. Bull S. Crane L.A. Barrow J.C. Kempe A. Daley M.F. Parents’ Acceptance of Adolescent Immunizations Outside of the Traditional Medical Home J. Adolesc. Health 2011 49 133 140 10.1016/j.jadohealth.2011.04.012 21783044 22. Ferris D. Horn L. Waller J.L. Parental Acceptance of a Mandatory Human Papillomavirus (HPV) Vaccination Program J. Am. Board Fam. Med. 2010 23 220 229 10.3122/jabfm.2010.02.090091 20207933 23. Middleman A.B. Tung J.S. Urban Middle School Parent Perspectives: The Vaccines They Are Willing to Have Their Children Receive Using School-Based Immunization Programs J. Adolesc. Health 2010 47 249 253 10.1016/j.jadohealth.2010.01.009 20708563 24. Bozigar M. Faith T.D. White A.A. Drayton K.D. Fabick A. Cartmell K.B. A Cross-Sectional Survey to Evaluate Potential for Partnering With School Nurses to Promote Human Papillomavirus Vaccination Prev. Chronic Dis. 2020 17 E111 10.5888/pcd17.190451 32975509 PMC7553228 25. Mattebo M. Gottvall M. Grandahl M. School Nurses’ Perceptions and Experiences of Delivering a School-Based Intervention to Improve Primary Prevention of Human Papillomavirus Among Adolescents—A Focus Group Study Following a Randomized Controlled Trial J. Sch. Nurs. 2024 40 166 173 10.1177/10598405211046174 34632854 PMC10924545 26. Spencer J.C. Brewer N.T. Trogdon J.G. Weinberger M. Coyne-Beasley T. Wheeler S.B. Cost-effectiveness of Interventions to Increase HPV Vaccine Uptake Pediatrics 2020 146 e20200395 10.1542/peds.2020-0395 33199466 PMC7786823 27. Stubbs B.W. Panozzo C.A. Moss J.L. Reiter P.L. Whitesell D.H. Brewer N.T. Evaluation of an Intervention Providing HPV Vaccine in Schools Am. J. Health Behav. 2014 38 92 102 10.5993/AJHB.38.1.10 24034684 PMC4230705 28. Ely G.E. Fields M. Dignan M. School-Based Vaccination Programs and the HPV Vaccine in 16 Appalachian Kentucky School Districts: Results from a Pilot Study Soc. Work. Public Health 2014 29 368 379 10.1080/19371918.2013.829761 24871774 29. Cuccaro P.M. Choi J. Gabay E.K. Wilkerson J.M. Maria D.S. Misra S.M. McBride M.A. Vernon S.W. Lessons Learned from All for Them: Best Practices for a Cross-Collaboration Approach to HPV Vaccination in Public Schools Vaccines 2023 11 946 10.3390/vaccines11050946 37243050 PMC10223857 30. Hayes K.A. Entzel P. Berger W. Caskey R.N. Shlay J.C. Stubbs B.W. Smith J.S. Brewer N.T. Early Lessons Learned From Extramural School Programs That Offer HPV Vaccine J. Sch. Health 2013 83 119 126 10.1111/josh.12007 23331272 31. Vanderpool R.C. Breheny P.J. Tiller P.A. Huckelby C.A. Edwards A.D. Upchurch K.D. Phillips C.A. Weyman C.F. Implementation and Evaluation of a School-Based Human Papillomavirus Vaccination Program in Rural Kentucky Am. J. Prev. Med. 2015 49 317 323 10.1016/j.amepre.2015.05.001 26190806 32. Lindley M.C. Boyer-Chu L. Fishbein D.B. Kolasa M. Middleman A.B. Wilson T. Wolicki J. Wooley S. for the Working Group on the Role of Schools in Delivery of Adolescent Vaccinations The Role of Schools in Strengthening Delivery of New Adolescent Vaccinations Pediatrics 2008 121 S46 S54 10.1542/peds.2007-1115F 18174320 33. Reiter P.L. McRee A.-L. Pepper J.K. Brewer N.T. Default policies and parents’ consent for school-located HPV vaccination J. Behav. Med. 2012 35 651 657 10.1007/s10865-012-9397-1 22271328 PMC3392417 34. Shlay J.C. Rodgers S. Lyons J. Romero S. Vogt T.M. McCormick E.V. Implementing a School-Located Vaccination Program in Denver Public Schools J. Sch. Health 2015 85 536 543 10.1111/josh.12281 26149309 PMC11901031 35. Shah P.D. Gilkey M.B. Pepper J.K. Gottlieb S.L. Brewer N.T. Promising alternative settings for HPV vaccination of US adolescents Expert Rev. Vaccines 2014 13 235 246 10.1586/14760584.2013.871204 24405401 PMC4267674 36. Rodriguez A.M. Do T.Q.N. Eyada M.F. Chen L. Schmeler K.M. Montealegre J.R. Human Papillomavirus Vaccination Uptake in the Rio Grande Valley: Results from a Pilot Community-Based Educational and School-Based Vaccination Program and Its Expansion Vaccines 2023 11 329 10.3390/vaccines11020329 36851207 PMC9961922 37. Daley M.F. Curtis C.R. Pyrzanowski J. Barrow J. Benton K. Abrams L. Federico S. Juszczak L. Melinkovich P. Crane L.A. Adolescent Immunization Delivery in School-Based Health Centers: A National Survey J. Adolesc. Health 2009 45 445 452 10.1016/j.jadohealth.2009.04.002 19837350 38. Oliver K. McCorkell C. Pister I. Majid N. Benkel D.H. Zucker J.R. Improving HPV vaccine delivery at school-based health centers Hum. Vaccines Immunother. 2019 15 1870 1877 10.1080/21645515.2019.1578596 PMC6746517 30735468 39. Daley M.F. Kempe A. Pyrzanowski J. Vogt T.M. Dickinson L.M. Kile D. Fang H. Rinehart D.J. Shlay J.C. School-Located Vaccination of Adolescents With Insurance Billing: Cost, Reimbursement, and Vaccination Outcomes J. Adolesc. Health 2014 54 282 288 10.1016/j.jadohealth.2013.12.011 24560036 PMC11900899 40. Gold R. Naleway A.L. Jenkins L.L. Riedlinger K.K. Kurosky S.K. Nystrom R.J. Kurilo M.B. Completion and timing of the three-dose human papillomavirus vaccine series among adolescents attending school-based health centers in Oregon Prev. Med. 2011 52 456 458 10.1016/j.ypmed.2011.04.010 21539853 41. Federico S.G. Abrams L. Everhart R.M. Melinkovich P. Hambidge S.J. Addressing Adolescent Immunization Disparities: A Retrospective Analysis of School-Based Health Center Immunization Delivery Am. J. Public Health 2010 100 1630 1634 10.2105/AJPH.2009.176628 20634466 PMC2920988 42. Kaul S. Do T.Q.N. Hsu E. Schmeler K.M. Montealegre J.R. Rodriguez A.M. School-based human papillomavirus vaccination program for increasing vaccine uptake in an underserved area in Texas Papillomavirus Res. 2019 8 100189 10.1016/j.pvr.2019.100189 31654772 PMC6838925 43. Middleman A.B. Won T. Auslander B. Misra S. Short M. HPV vaccine uptake in a school-located vaccination program Hum. Vaccines Immunother. 2016 12 2872 2874 10.1080/21645515.2016.1208326 PMC5137526 27548752 44. Munn M.S. Kay M. Page L.C. Duchin J.S. Completion of the Human Papillomavirus Vaccination Series Among Adolescent Users and Nonusers of School-Based Health Centers Public Health Rep. 2019 134 559 566 10.1177/0033354919867734 31404508 PMC6852067 45. Rodriguez A.M. Do T.Q.N. Jibaja-Weiss M.L. Chen L. Schmeler K.M. Montealegre J.R. Kuo Y.-F. Human Papillomavirus Vaccinations During the COVID-19 Pandemic in Middle Schools in the Rio Grande Valley of Texas Am. J. Public Health 2022 112 1269 1272 10.2105/AJPH.2022.306970 35862887 PMC9382169 46. Rodriguez A.M. Do T.Q.N. Chen L. Schmeler K.M. Montealegre J.R. Kuo Y.-F. Human papillomavirus vaccinations at recommended ages: How a middle school-based educational and vaccination program increased uptake in the Rio Grande Valley Hum. Vaccines Immunother. 2022 18 2133315 10.1080/21645515.2022.2133315 PMC9746445 36252275 47. White M.C. Osazuwa-Peters O.L. Abouelella D.K. Barnes J.M. Cannon T.Y. Watts T.L. Boakye E.A. Osazuwa-Peters N. Trends and factors associated with receipt of human papillomavirus (HPV) vaccine in private, public, and alternative settings in the United States Vaccine 2024 42 126036 10.1016/j.vaccine.2024.06.004 38876838 48. Moss J.L. Feld A.L. O’MAlley B. Entzel P. Smith J.S. Gilkey M.B. Brewer N.T. Opportunities for Increasing Human Papillomavirus Vaccine Provision in School Health Centers J. Sch. Health 2014 84 370 378 10.1111/josh.12158 24749919 PMC4325977 vaccines-13-00894-t001_Table 1 Table 1 Outcomes of HPV vaccination programs in schools. Author (year) Study Design Sample Evaluation Focus Outcomes Daley et al. (2014) [ 39 Cluster-randomized controlled trial 6th–8th grade students at seven Denver public schools during 2010–2011 school year n Vaccine administration and purchase costs were compared in vaccination program versus reimbursement by insurers Estimated vaccine cost of USD 23.98 per vaccine in vaccination program versus USD 11.83 to USD 29.77 per vaccine reimbursement by insurance Shah et al. (2020) [ 35 Quality improvement project Two Los Angeles area school-based health centers Compared missed opportunities for HPV vaccine in school-based health centers after a multicomponent intervention Missed HPV vaccine opportunities decreased from 82.3% to 46.1% during intervention period Gold et al. (2011) [ 40 Observational study 19 school-based health centers in Oregon Evaluated completion of HPV vaccine series 51% completed HPV series by December 2008 Federico et al. (2010) [ 41 Retrospective analysis Immunization registry for patients aged 12–18 years old Compared completion rates at school-based health centers vs. community health centers School-based health centers had significantly higher immunization (Hepatitis B, Tdap, IPV, Varicella, MMR, and HPV) series completion rates compared to community health centers Kaul et al. (2019) [ 42 Quasi-experimental study 2307 Rio Grande City Consolidated Independent School District (RGCISD) middle school students from 3 schools Comparison study of community-based HPV-related education and onsite school-based vaccination versus community-based HPV education Students with on-site vaccination events and community-based education had higher HPV vaccination rates than those who only received community-based education Middleman et al. (2016) [ 43 Cluster—randomized controlled trial Large Texas school district—449 students participated in the fall and 161 students participated in the spring Evaluated HPV vaccine uptake in a school-located vaccination program 86% of students who were immunized received the HPV vaccine Munn et al. (2019) [ 44 Retrospective study Immunization registry data of adolescents in Seattle, Washington, born between 1995 and 2000 who received an HPV vaccine Identified adolescents who used a school-based health center for any HPV vaccine dose Adolescent SBHC users had higher odds of completing the HPV vaccine series—37% higher odds for females and 45% higher odds for males Rodriguez et al. (2022) [ 45 Quasi-experimental study n Assessed HPV vaccinations rates during the COVID-19 Pandemic HPV vaccine initiation and completion rates increased 1.29-fold and 1.47-fold with a school-based vaccination program Rodriguez et al. (2022) [ 46 Quasi-experimental study n Compared HPV vaccination rates by age of initiation Initiating HPV vaccine at age 11 or younger increased completion series rates with a school-based vaccination program Shaly et al. (2015) [ 34 Descriptive study 3 clinics at 7 middle school–8th grade schools Implementation of a school-located vaccination program SLV program offers an alternative approach for providing vaccinations Vanderpool et al. (2015) [ 31 Descriptive study 2 high schools during the 2012-2013 academic year n Implementation and evaluation of a school-based HPV vaccination program 88% of students initiating the vaccine series completed the series; 315 initiated the HPV vaccine series; 276 completed the entire three-dose series Stubbs et al. (2014) [ 27 Cluster – randomized controlled trials Temporary clinics in middle school in 2009–2010 n Evaluation of a school-located HPV vaccination clinic HPV initiation was higher in girls attending host school White et al. (2024) [ 47 Cross sectional analysis National Immunization Survey-Teen data from 2014 to 2020 n Described trends and factors associated with HPV vaccine uptake Odds of receiving HPV vaccine at a public facility vs. a private facility increased two times for adolescents living below poverty ",
  "metadata": {
    "Title of this paper": "Opportunities for Increasing Human Papillomavirus Vaccine Provision in School Health Centers",
    "Journal it was published in:": "Vaccines",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12474329/"
  }
}