{
  "title": "Paper_848",
  "abstract": "pmc Cureus Cureus 2757 cureus Cureus 2168-8184 Cureus Inc. PMC12461762 PMC12461762.1 12461762 12461762 41018402 10.7759/cureus.91013 1 Oncology Dentistry Oral Medicine Bibliometric Analysis of the 100 Most Cited Systematic Reviews and Meta-Analysis in Oral Pathology Muacevic Alexander Adler John R Arun Gopinathan Pillai 1 Aboalela Ali 1 UI Haq Ikram 2 Yadav Bijesh 3 Siddeeqh Salman 1 Chitumalla Rajkiran 4 Khan Sulthan Ibrahim R 4 Alyahya Abdulah Mohammed 5 Alanazi Faris Fahad 5 Khalid Alwuayl Abdulrahman 5 Sami Almedlej Abdullah 5 Mohammed Alqarni Nasser 5  1  2  3  4  5 Pillai Arun Gopinathan arunaswbds007@gmail.com 26 8 2025 8 2025 17 8 494304 e91013 25 8 2025 26 08 2025 26 09 2025 29 09 2025 Copyright © 2025, Arun Gopinathan et al. 2025 Arun Gopinathan et al. https://creativecommons.org/licenses/by/4.0/ This is an open access article distributed under the terms of the Creative Commons Attribution License CC-BY 4.0., which permits unrestricted use, distribution, and reproduction in any medium, provided the original author and source are credited. This article is available from https://cureus.com/articles/402111-bibliometric-analysis-of-the-100-most-cited-systematic-reviews-and-meta-analysis-in-oral-pathology The bibliometric study aimed to analyze the 100 most cited systematic reviews (SRs) and meta-analyses (MAs) in the field of oral pathology. This is the first research on SRs and MAs conducted on citation analysis pertaining to oral pathology. On December 24, 2024, a search was made in the Web of Science database for 3,000 articles. Out of that pool, the 100 most cited oral pathology-associated articles were selected after confirming their indexing status in the PubMed database. Standard information on the periodic growth, authors, affiliated organizations, publication year, citation metrics, and research topic domains was recorded. Statistical analysis was conducted via the Pearson Chi-square test and one-way analysis of variance (ANOVA). The VOSviewer program was employed to conduct a network analysis for co-occurring key terms. The results depicted the 100 most cited articles from subjects of oral pathology/oral medicine and associated head and neck pathology published between 1990 and 2022. The journal with the highest number of articles was Oral Surgery, Oral Medicine, Oral Pathology, and Oral Radiology Oral Oncology bibliometrics citation analysis meta-analysis oral medicine oral pathology systematic reviews pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement no pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes Introduction and background Bibliometric analysis is a scientific process that uses computer assistance to systematically analyse and identify fundamental research features by encompassing all publications pertinent to a specific topic or field. It generally quantifies research outputs such as publication frequencies, citation frequencies, and metrics by generally keeping a track of how many times the article is cited after it has been published [ 1 2 3 The evidence-based medicine pyramid indicates that systematic reviews (SRs) and meta-analyses (MAs) represent the greatest degree of evidence, as they consolidate validated information from diverse existing literature [ 4 5 Bibliometric analysis in the field of oral pathology has been conducted on topics such as odontogenic cysts and tumours [ 6 7 8 9 The objectives of the review are as follows: 1) to assess comprehensive research growth and contribution in SRs and MAs in oral pathology; 2) to ascertain the most prolific country, journal, authors, and research organisations and examine various research domains for average citations per article; and 3) to recognise the co-occurrence network among authors and common keywords using the VOSviewer software. Review Methodology Ethical Considerations The Institutional Review Board of the King Abdullah International Medical Research Centre sanctioned the study, as denoted by reference number NRR24/120/12. As it involved a retrospective analysis of data, ethical approval was exempted. Search Criteria A search was performed in the core collection of Web of Science (WoS), due to its extensive thematic coverage and the capability to quantify article citations. The WoS database was searched on December 24, 2024, to identify the top-cited SRs and MAs in oral pathology. In the first week of January 2025, two of our team members retrieved and verified these articles from PubMed. Accordingly, the data collection process spanned from December 24, 2024, to January 7, 2025. As the analysis focused exclusively on the most cited SRs and MAs, studies published in 2023 and later were not included, as their recent publication dates resulted in relatively low citation counts. The search technique was executed in the subject area (under all fields) with the following keywords: “Oral Pathology” OR “Oral and Maxillofacial Pathology” OR “Maxillofacial Pathology” OR “Oral Medicine” AND “Systematic Review*” OR “Meta Analysis” OR “Data Pooling”. Initial search revealed n = 373,208 articles. Later, filters of dentistry, oral surgery, medicine, oncology, and surgery were added, which brought down the count to n = 87,053 articles. Finally, document filters of articles, review articles, proceeding papers, and book chapters were added, giving a total count of n = 73,201. Figure 1 Figure 1 Criteria for the selection of the 100 most cited articles WoS: Web of Science A total of 3,000 top-cited articles from WoS were recruited to a Microsoft Excel sheet (Microsoft Corp., USA). Two authors (AP and SS) conducted an independent preliminary screening of papers to evaluate their relevance to the study, utilising information from the title, abstract, and, when necessary, the whole article. Any disagreement over the inclusion of a certain article was settled by consensus discussion among all authors. The 100 top-cited articles indexed in both WoS and PubMed were selected for data extraction and further analysis. The primary source for identifying SRs/MAs was the Web of Science. The indexation status was further verified in PubMed, and any SR/MA not indexed in PubMed was excluded. The top 100 most-cited SRs/MAs were selected because citation count is a widely accepted indicator of scientific impact and influence. Focusing on the top 100 provided a manageable dataset while still capturing the most impactful contributions in oral pathology. This threshold has also been commonly used in bibliometric analyses, allowing comparison with previous studies and ensuring that only the most influential literature shaping the field was included. Inclusion Criteria SR and MA articles relevant to head and neck studies (which included oral cavity), as oral pathology and oral medicine are related specialities, both were considered. The article had to be indexed in both WoS and the PubMed database. Exclusion Criteria SRs and MAs on medical-related topics and other dental systematic reviews on specialities like dental materials, periodontics, prosthodontics, restorative, endodontics, pedodontics, oral surgery, orthodontics, and dental public health were excluded. Animal studies, narrative reviews, original studies, scoping reviews, case reports, case series, non-English articles and bibliometric studies were also excluded (Figure 1 Data Analysis and Statistical Analysis The following variables, like periodic distribution of articles, total citations, journal listings, leading authors, prominent institutions, top countries, keyword analysis, prominent thematic areas, and characteristics of the 100 most cited articles, were evaluated. The bibliometric program VOSviewer (Leiden University, Leiden, Netherlands), version 1.6.10, was used. The country of publication was determined by considering the affiliations of all authors, following common practice in bibliometric studies. The dataset was downloaded into an Excel sheet, and the country and institutional affiliation for each author were included. For articles co-authored by authors from multiple countries, the publication was counted for every country and institution represented, ensuring that all contributing affiliations were included. The one-way ANOVA was used to evaluate the citation impact among countries and institutions, while the Pearson chi-square test was utilised to assess the citation impact among types of review articles, subject specialities, and journal types. R 4.4 software was used for the analysis (R Foundation for Statistical Computing, Vienna, Austria). Results Periodic Distribution of Articles Among the top 100 cited articles, the period of distribution of articles was published in a span ranging from 1990 to 2022. Figure 2 Figure 2 Year-wise distribution of the most cited articles and citations Premium Publication Sources A total of 52 articles were included in the top 10 journals, which published three and more than three articles, with most of the journals belonging to the Q1 category (Table 1 Oral Surgery, Oral Medicine, Oral Pathology, and Oral Radiology Oral Surgery, Oral Medicine, Oral Pathology, and Oral Radiology Radiotherapy and Oncology Radiotherapy and Oncology International Journal of Cancer Annals of Oncology Table 1 Distribution of the top 10 journals Serial no. Journal name JIF WoS (Quartile) CiteScore - Scopus (Quartile) SJR (H-Index) Total articles Total citations Citation impact 1 Oral Surgery, Oral Medicine, Oral Pathology, and Oral Radiology 2 (Q2) 3.8 (Q1) 0.56 (139) 9 2190 243.33 2 Oral Oncology 4 (Q1) 8.7 (Q1) 1.26 (137) 7 1178 168.29 3 British Journal of Cancer 6.4 (Q1) 15.1 (Q1) 3 (272) 6 972 162.00 4 Head and Neck - Journal for the Sciences and Specialties of the Head and Neck 2.4 (Q1) 7 (Q1) 1.03 (147) 5 1397 279.40 5 Oral Diseases 2.9 (Q1) 7.6 (Q1) 1.09 (104) 5 863 172.60 6 Radiotherapy and Oncology 4.9 (Q1) 10.3 (Q1) 1.7 (182) 5 3410 682.00 7 International Journal of Cancer 5.7 (Q1) 13.4 (Q1) 2.13 (260) 4 1134 283.50 8 Journal of Dental Research 5.7 (Q1) 15.3 (Q1) 1.91 (211) 4 603 150.75 9 Journal of Oral Pathology & Medicine 2.7 (Q1 5.9 (Q1) 0.72 (95) 4 951 237.75 10 Annals of Oncology 56.7 (Q1) 63.9 (Q1) 13.94 (294) 3 456 152.00 Most Productive Countries, Institutions, and Authors A total of 41 countries contributed to the 100 most cited articles. Authors from 13 countries produced one article each, while authors from nine countries contributed between six, three, and two articles each. The top 10 countries are shown in Figure 3a Figure 3 a) Top 10 most prolific nations illustrating the distribution of total citations and total articles. b) Top 10 institutions illustrating the distribution of total citations and total articles. c) Top authors illustrating the distribution of total citations and total articles. UPSaclay: Universite Paris Saclay, KCL: King College London, RU: Radboud University Nijmegen, UoL: University of London, CHUV: Centre Hospitalier Universitaire Vaudois, NEWC: Newcastle University – UK, UAntwerp: University of Antwerp A total of 276 institutions were identified, with 203 institutions contributing one article each, 43 institutions producing two articles each, and 16 institutions producing three articles each. The top 10 institutions are shown in Figure 3b A cumulative sum of 635 authors contributed to the 100 most cited articles, with 83.62% (n = 531) of authors contributing to a single article. Thirty-four authors contributed to two articles each, while the top eight authors contributed to more than two articles each. Figure 3c Of the total authors, only 33 authors in the VOSviewer network visualisation were connected through four clusters, as shown in Figure 4 Figure 4 Co-occurrence network of authors The citation impact of the different collaboration patterns among countries and institutions was analysed by one-way ANOVA, and it was statistically significant (P < 0.001) (Table 2 Table 2 Collaboration patterns of countries and institution *P < 0.05: statistically significant Collaboration patterns by countries Total publications Total citations Citation impact p-value Single country’s publications 60 14794 246.57 <0.001 Two countries’ publications 22 4290 195.00 Three countries' publications 11 2428 220.73 More than three countries' publications 7 1307 186.71 Collaboration patterns by institutions  Single Institutions 22 4167 189.41 <0.001 Two institutions 28 5968 213.14 Three institutions 15 5137 342.47 Four institutions 13 2629 202.23 Five institutions 7 1632 233.14 More than five institutions 15 3286 219.07 Keyword Analysis A total of 263 keywords had been used by the authors, and 80.22% (n = 211) keywords were used one time. The top 17 keywords are shown in Figure 5 Figure 5 Seventeen most occurred keywords and their cumulative link strength A keyword co-occurrence network was done with the help of Vosviewer software, as shown in Figure 6 Figure 6 Co-occurrence network of the top keywords Articles Based on Research Domains and Characteristics of the 100 Most Cited Articles Twenty-three areas were examined among the top 100 cited SRs and MAs. Figure 7 Figure 7 Allocation of publications according to the research area and number of citations BCC: basal cell carcinoma, RMS: rhabdomyosarcoma, OKC: odontogenic keratocyst, OPMD: oral potentially malignant disorders, (B, V, F): bacterial, viral, fungal, OSCC: oral squamous cell carcinoma The citation impact among subject specialities, type of review articles, and journal types was done using the Pearson Chi-square test, and it was statistically significant (P < 0.001) (Table 3 Head and Neck Pathology Table 3 Distribution of articles categorized by subject speciality, type of reviews, and type of journals *P < 0.05: statistically significant Subject speciality Total publications Total citations Citation impact p-value Oral pathology /oral med 63 11968 189.96 <0.001 Head and neck pathology 37 10851 293.27 Type of review articles  Systematic review only 16 3193 199.56 <0.001 Systematic review and meta-analysis 84 19626 233.64 Type of journals  1. Dental journals 45 8875 197.22 <0.001 2. Non-dental journals 55 13944 253.52 Discussion Bibliometric analysis assesses publication and citation trends to measure the significance, impact, and influence of research within a certain topic. It also assists academicians and organisations in determining topics for future research or collaboration [ 10 11 12 13 Since oral medicine and oral pathology are two interrelated dental specialities focused on the diagnosis and non-surgical treatment of oral problems, as well as the oral healthcare of patients with chronic, recurring, and medically associated conditions of the oral and maxillofacial area were considered. Among the top cited 100 articles in the present review, 63 articles related to oral pathology and 37 articles related to head and neck pathology were found. This study sought to delineate the scientometric landscape of SR and MA publications in the field of oral pathology from the year 1990 to 2022. The data indicate a progressive rise in annual output within the field of oral pathology overall, as well as in most of its associated research areas in the head and neck cancer field. The United States and England emerged as the most productive nations, while France distinguished itself by hosting the most prolific and influential scholars and institutions. The variations in publishing output among nations can be attributed to multiple factors, including the size of the scientific population, the vibrancy of the research community, access to online databases, funding for research-related capital projects, and proficiency in the English language. The selection of keywords utilised for data inquiries is one of the elements that may influence the substantial quantity and quality of biomedical literature [ 6 6 7 8 10 6 The body of scientific literature pertaining to oral pathology is extensive. Reports indicate that fewer than 10% of research papers attain the distinction of classic articles; also, an article that has acquired 100 or more citations is often considered a 'classic' within its study domain [ 14 15 16 Overall, the SRs and MAs had covered 23 subject domains with head and neck cancer, oral cancer, and oral potentially malignant disorders topping the list with 15,448 total citations from 60 articles. This finding is unsurprising, as it represents a core area within the field of oral pathology. It is only natural to observe a rise in the number of citations of landmark publications in a given domain, as recent advancements in any discipline demonstrate a greater knowledge gap, elicit a greater level of interest, and encourage additional research and publication [ 17 Oral Surgery, Oral Medicine, Oral Pathology, and Oral Radiology 12 The journal metrics included in the present review were the cite score, H index, and JIF. The cite score metric of Scopus is calculated by comparing the average number of citations received per document in a particular year to the total number of articles published in the previous three years [ 18 19 19 The duration since publication is a crucial element that influences the citation metrics of an article. Older papers gain more citations than the new ones, irrespective of their significance. This inclination is seen in nearly all disciplines [ 20 21 22 13 23 Keywords are essential since they yield more pertinent results during literature searches compared to sentences or phrases. Keywords serve several purposes; primarily, they encapsulate three to five essential terms inside an author's work. Secondly, to find prevalent academic themes from both historical and contemporary contexts by keyword analysis. Thirdly, a paper's likelihood of being cited increases with the presence of certain associated keywords [ 24 7 25 23 In the present review, WoS was the main citation database used. The WoS has historically established the criteria for counting citations. The WoS asserts that a key strength lies in its selective approach to selecting certain publications in its content coverage. Bradford’s Law, introduced in 1934, posits that a significant proportion of major scientific discoveries is disseminated through a limited number of journals. Consequently, the WoS prioritises the quality of its content coverage over quantity [ 26 11 12 Ultimately arriving at the key takeaway, the significance of SRs and MAs in healthcare has been escalating. Clinicians peruse such publications to remain updated in their profession; they also serve as a foundation for formulating clinical practice recommendations [ 27 5 Limitations The present bibliometric study exclusively utilised the WoS database, potentially excluding pertinent publications not indexed by WoS. Additional databases, like Scopus and Google Scholar, include bibliometric information on published publications. The content scope of Google Scholar is unclear, and the reliability of results is variable, whilst citation analysis is neglected by PubMed. Google Scholar has faced criticism, partly for using citations from sources deemed non-scholarly, such as student handbooks and administrative notes. Google Scholar utilises automatic web crawlers to collect information from internet content; however, the technique employed to connect records remains undisclosed [ 26 28 28 The present review may have overlooked articles published in non-indexed and non-English journals. The number of citations determines the impact and quality of an article; regrettably, it may be contingent upon time. A further limitation is the possible mistake introduced in bibliometric studies due to 'self-citation' and 'journal bias'. The former suggests the authors' inclination to reference their own articles to enhance their credentials and the journal's impact factor. Journal bias denotes the tendency of authors to reference articles from the same journal to which they aspire to submit their study [ 12 Conclusions This review presents the first comprehensive bibliometric analysis of SRs and MAs on oral pathology from 1990 to 2022. The 100 most cited articles were published across 67 dental journals and 33 non-dental journals, indicating a multidisciplinary interest in the field. The articles frequently featured multiple authors and encompassed collaborative efforts from various universities. The focus of the research was centred on head and neck cancer with chemotherapy and radiotherapy, oral cancer, and oral potentially malignant disorders. There has been an increasing trend in the publication of articles on this topic since 2009, underscoring the significance of the topic. This review serves as a valuable resource for researchers and clinicians in the fields of oral medicine, oral pathology, head and neck oncology, and maxillofacial surgery. Future research is necessary, as science is continually evolving, and the compilation of newly published articles requires regular updates. Disclosures Conflicts of interest: Payment/services info: Financial relationships: Other relationships: Author Contributions Concept and design: Acquisition, analysis, or interpretation of data: Drafting of the manuscript: Critical review of the manuscript for important intellectual content: Supervision: Appendices Table 4 Appendices (100 most cited articles with citation density by rank) Serial No. Details of articles Total citations Citation density by year (rank) 1. Meta-analysis of chemotherapy in head and neck cancer (MACH-NC): an update on 93 randomised trials and 17,346 patients [ 29 2228 139.25 (1) 2. A meta-analysis of the prevalence of dental agenesis of permanent teeth [ 30 643 30.62 (17) 3. Prevalence of human papillomavirus in oropharyngeal and nonoropharyngeal head and neck cancer-systematic review and meta-analysis of trends by time and region [ 31 584 48.67 (6) 4. Survival of squamous cell carcinoma of the head and neck in relation to human papillomavirus infection: review and meta-analysis [ 32 557 30.94 (16) 5. HPV DNA, E6/E7 mRNA, and p16INK4a detection in head and neck cancers: a systematic review and meta-analysis [ 33 545 49.55 (5) 6. Oral squamous cell carcinoma: review of prognostic and predictive factors [ 34 458 24.11 (32) 7. Meta-analysis of chemotherapy in head and neck cancer (MACH-NC): a comprehensive analysis by tumour site [ 35 440 31.43 (15) 8. Meta-analysis of the impact of human papillomavirus (HPV) on cancer risk and overall survival in head and neck squamous cell carcinomas (HNSCC) [ 36 370 24.67 (30) 9. The association of telomere length and cancer: a meta-analysis [ 37 366 26.14 (26) 10. Hypoxic modification of radiotherapy in squamous cell carcinoma of the head and neck--a systematic review and meta-analysis [ 38 358 25.57 (28) 11. Prevalence of temporomandibular joint disorders: a systematic review and meta-analysis [ 39 357 89.25 (2) 12. Fusion gene-negative alveolar rhabdomyosarcoma is clinically and molecularly indistinguishable from embryonal rhabdomyosarcoma [ 40 331 22.07 (34) 13. Human papillomavirus as a risk factor for oral squamous cell carcinoma: a meta-analysis, 1982-1997 [ 41 328 13.67 (63) 14. Oral epithelial dysplasia and the development of invasive squamous cell carcinoma [ 42 328 10.93 (73) 15. Human papillomavirus-related head and neck cancer survival: a systematic review and meta-analysis [ 43 315 24.23 (31) 16. Relationship between bruxism and temporomandibular disorders: a systematic review of literature from 1998 to 2008 [ 44 304 20.27 (36) 17. Adjuvant and adjunctive chemotherapy in the management of squamous cell carcinoma of the head and neck region. A meta-analysis of prospective and randomized trials [ 45 301 10.38 (75) 18. Malignant transformation of oral leukoplakia: a systematic review of observational studies [ 46 283 31.44 (14) 19. Lifelong Learning Programme. An appraisal of oral cancer and pre-cancer screening programmes in Europe: a systematic review [ 47 283 28.30 (21) 20. Predictive value of tumor thickness for cervical lymph-node involvement in squamous cell carcinoma of the oral cavity: a meta-analysis of reported studies [ 48 282 17.63 (43) 21. Treatment and follow-up of oral dysplasia - a systematic review and meta-analysis [ 49 279 17.44 (44) 22. An overview of randomised controlled trials of adjuvant chemotherapy in head and neck cancer [ 50 279 9.30 (83) 23. Potentially malignant disorders of the oral cavity and oral dysplasia: A systematic review and meta-analysis of malignant transformation rate by subtype [ 51 267 53.40 (3) 24. Socioeconomic inequalities and oral cancer risk: a systematic review and meta-analysis of case-control studies [ 52 248 14.59 (57) 25. Gender differences in temporomandibular disorders in adult populational studies: A systematic review and meta-analysis [ 53 238 34.00 (10) 26. The prognostic role of tumor infiltrating T-lymphocytes in squamous cell carcinoma of the head and neck: A systematic review and meta-analysis [ 54 235 29.38 (18) 27. Human papillomaviruses in oral carcinoma and oral potentially malignant disorders: a systematic review [ 55 235 16.79 (48) 28. Oral acyclovir therapy accelerates pain resolution in patients with herpes zoster: a meta-analysis of placebo-controlled trials [ 56 234 8.07 (88) 29. Correlation between apparent diffusion coefficient (ADC) and cellularity is different in several tumors: a meta-analysis [ 57 233 29.13 (20) 30. A meta-analysis of hyper fractionated and accelerated radiotherapy and combined chemotherapy and radiotherapy regimens in unresected locally advanced squamous cell carcinoma of the head and neck [ 58 225 11.84 (69) 31. Prevalence of oral potentially malignant disorders: A systematic review and meta-analysis [ 59 222 31.71 (12) 32. A systematic review and meta-analysis of the diagnostic accuracy of fine-needle aspiration cytology for parotid gland lesions [ 60 222 15.86 (51) 33. HPV in oral squamous cell carcinoma vs head and neck squamous cell carcinoma biopsies: a meta-analysis (1988-2007) [ 61 216 12.71 (66) 34. Taxane-cisplatin-fluorouracil as induction chemotherapy in locally advanced head and neck cancers: an individual patient data meta-analysis of the meta-analysis of chemotherapy in head and neck cancer group [ 62 215 17.92 (42) 35. Prevalence in the Dutch adult population and a meta-analysis of signs and symptoms of temporomandibular disorder [ 63 212 6.63 (94) 36. Role of radiotherapy fractionation in head and neck cancers (MARCH): an updated meta-analysis [ 64 208 26.00 (27) 37. Intensity-modulated radiation therapy for head and neck cancer: systematic review and meta-analysis [ 65 204 18.55 (41) 38. Worldwide prevalence of oral lichen planus: A systematic review and meta-analysis [ 66 201 50.25 (4) 39. Prognostic significance of vascular endothelial growth factor immunohistochemical expression in head and neck squamous cell carcinoma: a meta-analysis [ 67 196 9.80 (77) 40. Effects of preanalytical variables on the detection of proteins by immunohistochemistry in formalin-fixed, paraffin-embedded tissue [ 68 194 13.86 (61) 41. Global burden of molar incisor hypomineralization [ 69 186 26.57 (25) 42. Diagnostic accuracy of p16 INK4a 70 185 23.13 (33) 43. Meta-analysis of chemotherapy in head and neck cancer (MACH-NC): An update on 107 randomized trials and 19,805 patients, on behalf of MACH-NC Group [ 71 180 45.00 (7) 44. Risk factors for osteoradionecrosis after head and neck radiation: a systematic review [ 72 179 13.77 (62) 45. Systematic review of the treatment and prognosis of the odontogenic keratocyst [ 73 179 7.16 (92) 46. Meta- and pooled analyses of GSTM1, GSTT1, GSTP1, and CYP1A1 genotypes and risk of head and neck cancer [ 74 178 8.09 (87) 47. Prognostic value of tumor-infiltrating lymphocytes in melanoma: a systematic review and meta-analysis [ 75 176 29.33 (19) 48. Malignant transformation of oral lichen planus and oral lichenoid lesions: A meta-analysis of 20095 patient data [ 76 176 22.00 (35) 49. Clinicopathologic comparison of plasmablastic lymphoma in HIV-positive, immunocompetent, and posttransplant patients: single-center series of 25 cases and meta-analysis of 277 reported cases [ 77 176 16.00 (50) 50. Estimated prevalence of erosive tooth wear in permanent teeth of children and adolescents: an epidemiological systematic review and meta-regression analysis [ 78 173 17.30 (45) 51. A systematic review with meta-analysis of the effect of low-level laser therapy (LLLT) in cancer therapy-induced oral mucositis [ 79 173 12.36 (68) 52. Human papillomavirus expression in oral mucosa, premalignant conditions, and squamous cell carcinoma: a retrospective review of the literature [ 80 173 5.97 (98) 53. Osteopontin is a marker for cancer aggressiveness and patient survival [ 81 170 11.33 (71) 54. Detection of cervical lymph node metastasis in head and neck cancer patients with clinically N0 neck-a meta-analysis comparing different imaging modalities [ 82 163 12.54 (67) 55. The reported prevalence of oral lichen planus: a review and critique [ 83 163 9.59 (81) 56. Malignant transformation risk of oral lichen planus: A systematic review and comprehensive meta-analysis [ 84 160 26.67 (24) 57. Prevalence of hypodontia and associated factors: a systematic review and meta-analysis [ 85 158 14.36 (59) 58. Rate of malignant transformation of oral lichen planus: A systematic review [ 86 153 25.50 (29) 59. Prognostic biomarkers for oral tongue squamous cell carcinoma: a systematic review and meta-analysis [ 87 153 19.13 (40) 60. Extracapsular spread in head and neck squamous cell carcinoma: A systematic review and meta-analysis [ 88 153 17.00 (47) 61. Oral Manifestations in Patients with COVID-19: A Living Systematic Review [ 89 151 37.75 (9) 62. Significance of CD44 expression in head and neck cancer: a systemic review and meta-analysis [ 90 150 13.64 (64) 63. Betel quid chewing and the risk of oral and oropharyngeal cancers: a meta-analysis with implications for cancer control [ 91 144 13.09 (65) 64. Maternal cigarette smoking and oral clefts: a meta-analysis [ 92 144 5.14 (99) 65. Prognostic role of pretreatment plasma fibrinogen in patients with solid tumors: A systematic review and meta-analysis [ 93 142 14.20 (60) 66. Role of ultrasound-guided core-needle biopsy in the assessment of head and neck lesions: a meta-analysis and systematic review of the literature [ 94 141 10.85 (74) 67. The hierarchy of different treatments for arthrogenous temporomandibular disorders: A network meta-analysis of randomized clinical trials [ 95 140 28.00 (22) 68. Reliability of HIV rapid diagnostic tests for self-testing compared with testing by health-care workers: a systematic review and meta-analysis [ 96 140 20.00 (38) 69. Hepatitis C virus infection and lichen planus: a systematic review with meta-analysis [ 97 140 9.33 (82) 70. Risk Factors for Herpes Zoster Infection: A Meta-Analysis [ 98 137 27.40 (23) 71. Candida albicans and Early Childhood Caries: A Systematic Review and Meta-Analysis [ 99 137 19.57 (39) 72. A meta-analysis of the randomized controlled trials on elective neck dissection versus therapeutic neck dissection in oral cavity cancers with clinically node-negative neck [ 100 135 9.64 (79) 73. Malignant transformation of oral leukoplakia: Systematic review and meta-analysis of the last 5 years [ 101 134 33.50 (11) 74. Sensitivity, Specificity, and Posttest Probability of Parotid Fine-Needle Aspiration: A Systematic Review and Meta-analysis [ 102 134 14.89 (55) 75. Has hypodontia increased in Caucasians during the 20th century? A meta-analysis [ 103 133 6.33 (95) 76. Is diagnostic delay related to advanced-stage oral cancer? A meta-analysis [ 104 132 8.25 (86) 77. Quality of life in survivors of oropharyngeal cancer: A systematic review and meta-analysis of 1366 patients [ 105 131 16.38 (49) 78. Elective Neck Dissection vs Observation in Early-Stage Squamous Cell Carcinoma of the Oral Tongue With No Clinically Apparent Lymph Node Metastasis in the Neck: A Systematic Review and Meta-analysis [ 106 131 14.56 (58) 79. Adjuvant chemotherapy in head and neck cancer [ 107 131 3.74 (100) 80. What is the best surgical margin for a Basal cell carcinoma: a meta-analysis of the literature [ 108 129 8.60 (85) 81. Surrogate endpoints for overall survival in locally advanced head and neck cancer: meta-analyses of individual patient data [ 109 128 8.00 (89) 82. Post-COVID syndrome. A case series and comprehensive review [ 110 126 31.50 (13) 83. HLA and Sjögren's syndrome susceptibility. A meta-analysis of worldwide studies [ 111 126 9.69 (78) 84. Fine-needle aspiration cytology in a regional head and neck cancer center: comparison with a systematic review and meta-analysis [ 112 126 7.41 (91) 85. Oral manifestations of Diabetes Mellitus. A systematic review [ 113 125 15.63 (52) 86. Xerostomia and salivary hypofunction in vulnerable elders: prevalence and etiology [ 114 125 9.62 (80) 87. Periodontal disease, edentulism, and pancreatic cancer: a meta-analysis [ 115 124 15.50 (53) 88. Meta-analysis of dysphagia and aspiration pneumonia in frail elders [ 116 123 8.79 (84) 89. Risk of osteonecrosis of the jaw in cancer patients receiving denosumab: a meta-analysis of seven randomized controlled trials [ 117 122 11.09 (72) 90. Individual patients' data meta-analyses in head and neck cancer [ 118 122 6.78 (93) 91. Evidence-based clinical practice guideline on antibiotic use for the urgent management of pulpal- and periapical-related dental pain and intraoral swelling: A report from the American Dental Association [ 119 121 20.17 (37) 92. Sentinel node biopsy for squamous cell carcinoma of the oral cavity and oropharynx: a diagnostic meta-analysis [ 120 121 10.08 (76) 93. The impact of vitamin D pathway genetic variation and circulating 25-hydroxyvitamin D on cancer outcome: systematic review and meta-analysis [ 121 120 15.00 (54) 94. Global prevalence of cleft palate, cleft lip and cleft palate and lip: A comprehensive systematic review and meta-analysis [ 122 119 39.67 (8) 95. Tumour budding in oral squamous cell carcinoma: a meta-analysis [ 123 119 17.00 (46) 96. Weekly Low-Dose Versus Three-Weekly High-Dose Cisplatin for Concurrent Chemoradiation in Locoregionally Advanced Non-Nasopharyngeal Head and Neck Cancer: A Systematic Review and Meta-Analysis of Aggregate Data [ 124 118 14.75 (56) 97. MicroRNAs as prognostic molecular signatures in human head and neck squamous cell carcinoma: a systematic review and meta-analysis [ 125 118 11.80 (70) 98. Preventive intervention possibilities in radiotherapy- and chemotherapy-induced oral mucositis: results of meta-analyses [ 126 117 6.16 (96) 99. Effects of antioxidant supplements on cancer prevention: meta-analysis of randomized controlled trials [ 127 116 7.73 (90) 100. Drooling of saliva: a review of the etiology and management options [ 128 116 6.11 (97) References 1 Bibliometrics basics J Med Libr Assoc Cooper ID 217 218 103 2015 26512226 10.3163/1536-5050.103.4.013 PMC4613387 2 Mapping the intellectual structure of research on surgery with mixed reality: Bibliometric network analysis (2000-2019) J Biomed Inform Han J Kang HJ Kim M Kwon GH 103516 109 2020 32736125 10.1016/j.jbi.2020.103516 3 Trending topics in orthodontics research during the last three decades: a longitudinal bibliometric study on the top-cited articles Orthod Craniofac Res Adobes Martin M Lipani E Alvarado Lorenzo A Aiuto R Garcovich D 462 470 23 2020 32449978 10.1111/ocr.12396 4 Meta-analyses and orthodontic evidence-based clinical practice in the 21 century Open Dent J Papadopoulos MA 92 123 4 2010 21673839 10.2174/1874210601004010092 PMC3111736 5 Introduction to systematic review and meta-analysis Korean J Anesthesiol Ahn E Kang H 103 112 71 2018 29619782 10.4097/kjae.2018.71.2.103 PMC5903119 6 Odontogenic cyst and tumours- a mapping through bibliometric analysis of scientific literature Afr J Bio Sc Gopinathan PA Awawdeh MA Aboalela A 2429 2454 6 2024 https://www.afjbs.com/issue-content/odontogenic-cyst-and-tumours-a-mapping-through-bibliometric-analysis-of-scientific-literature-5769 7 A bibliometric analysis of most cited papers on vesiculobullous oral lesions J Int Soc Prev Community Dent Gopinathan PA Aboalela A Haq IU Iyer K Siddeeqh S Khan SR Abbiramy GK 1 9 14 2024 38559641 10.4103/jispcd.jispcd_84_23 PMC10980308 8 Bibliometric analysis of 100 most cited papers on oral proliferative verrucous leukoplakia J Oral Biol Craniofac Res Sengupta N Sarode GS Sarode SC 41 47 15 2025 39717876 10.1016/j.jobcr.2024.11.008 PMC11664394 9 Current trends and themes of oral cancer research: abibliometric analysis of publications from 2011 to 2022 in prominent oral pathology-related journals Oral Oncol Rep Singh A Singh R Sapkota D 100037 6 2023 10 Bibliometric analysis and visualization of research on nanotechnology in dentistry from 1999 to 2022 J Appl Pharm Sci Patel B Dagli N Dagli R Adnan N Ahmad R Haque M Kumar S 58 66 13 2023 11 Bibliometric study of the systematic reviews and meta-analyses in dentistry J Clin Exp Dent Tarazona-Álvarez B López-Roldán A Vidal-Infer A Alonso-Arroyo A 0 37 15 2023 10.4317/jced.60884 PMC10699765 38074164 12 A bibliometric analysis of the 100 top-cited systematic review and meta-analysis in orthodontics Dental Press J Orthod Selvaraj M Nivethitha B Varshitha P Sangeetha U Madhan B 0 29 2024 10.1590/2177-6709.29.2.e242401.oar PMC11163958 38865517 13 Top 100 cited systematic reviews and meta-analyses in the major journals of oral and maxillofacial surgery: a bibliometric analysis Oral Maxillofac Surg Alkhutari AS Al-Moraissi EA Galvão EL Christidis N Falci SG 343 356 26 2022 34491457 10.1007/s10006-021-00981-9 14 Journal impact factor in the era of expanding literature J Microbiol Immunol Infect Andersen J Belmont J Cho CT 436 443 39 2006 https://pubmed.ncbi.nlm.nih.gov/17164944/ 17164944 15 The 100 most-cited randomised controlled trials in orthodontics: a bibliometric study Int Dent J Lam XY Ren J Yeung AW Lin Y 868 875 74 2024 38242809 10.1016/j.identj.2023.12.010 PMC11287139 16 Citation bias favoring statistically significant studies was present in medical research J Clin Epidemiol Jannot AS Agoritsas T Gayet-Ageron A Perneger TV 296 301 66 2013 23347853 10.1016/j.jclinepi.2012.09.015 17 Vigorously cited: a bibliometric analysis of the 100 most cited sedentary behaviour articles J Act Sedentary Sleep Behav Memon AR Chen S To QG Vandelanotte C 13 2 2023 40217390 10.1186/s44167-023-00022-8 PMC11960230 18 Introducing CiteScore, our journal's preferred citation index: moving beyond the impact factor Jt Comm J Qual Patient Saf Baker DW 309 310 46 2020 32402761 10.1016/j.jcjq.2020.03.005 19 Measuring scholarly productivity: a primer for junior faculty. Part III: understanding publication metrics West J Emerg Med Murphy LS Kraus CK Lotfipour S Gottlieb M Langabeer JR 2nd Langdorf MI 1003 1011 19 2018 30429933 10.5811/westjem.2018.9.38213 PMC6225941 20 A bibliometric analysis of scientific production in the field of lingual orthodontics Head Face Med Tarazona-Alvarez B Lucas-Dominguez R Paredes-Gallardo V Alonso-Arroyo A Vidal-Infer A 23 15 2019 31493796 10.1186/s13005-019-0207-7 PMC6731571 21 Scientific production in cancer rehabilitation grows higher: a bibliometric analysis Support Care Cancer Ugolini D Neri M Cesario A 1629 1638 20 2012 21881910 10.1007/s00520-011-1253-2 22 Does autogenous bone graft work? A logistic regression analysis of data from 159 papers in the foot and ankle literature Foot Ankle Surg Lareau CR Deren ME Fantry A Donahue RM DiGiovanni CW 150 159 21 2015 26235852 10.1016/j.fas.2015.03.008 23 A bibliometric study of the top 100 most-cited randomized controlled trials, systematic reviews and meta-analyses published in endodontic journals Int Endod J Ahmad P Dummer PM Chaudhry A Rashid U Saif S Asif JA 1297 1316 52 2019 31009099 10.1111/iej.13131 24 Bibliometric keyword analysis across seventeen years (2000-2016) of intelligence articles J Intell Pesta B Fuerst J Kirkegaard EO 6 2018 10.3390/jintelligence6040046 PMC6480778 31162473 25 Bibliometric analysis on smart cities research Sustainability Guo YM Huang ZL Guo J Li H Guo XR Nkeli MJ 3606 11 2019 26 Comparisons of citations in Web of Science, Scopus, and Google Scholar for articles published in general medical journals JAMA Kulkarni AV Aziz B Shams I Busse JW 1092 1096 302 2009 19738094 10.1001/jama.2009.1307 27 Number of published systematic reviews and global burden of disease: database analysis BMJ Swingler GH Volmink J Ioannidis JP 1083 1084 327 2003 14604930 10.1136/bmj.327.7423.1083 PMC261743 28 Three options for citation tracking: Google Scholar, Scopus and Web of Science Biomed Digit Libr Bakkalbasi N Bauer K Glover J Wang L 7 3 2006 16805916 10.1186/1742-5581-3-7 PMC1533854 29 Meta-analysis of chemotherapy in head and neck cancer (MACH-NC): an update on 93 randomised trials and 17,346 patients Radiother Oncol Pignon JP le Maître A Maillard E Bourhis J 4 14 92 2009 19446902 10.1016/j.radonc.2009.04.014 30 A meta-analysis of the prevalence of dental agenesis of permanent teeth Community Dent Oral Epidemiol Polder BJ Van't Hof MA Van der Linden FP Kuijpers-Jagtman AM 217 226 32 2004 15151692 10.1111/j.1600-0528.2004.00158.x 31 Prevalence of human papillomavirus in oropharyngeal and nonoropharyngeal head and neck cancer--systematic review and meta-analysis of trends by time and region Head Neck Mehanna H Beech T Nicholson T El-Hariry I McConkey C Paleri V Roberts S 747 755 35 2013 22267298 10.1002/hed.22015 32 Survival of squamous cell carcinoma of the head and neck in relation to human papillomavirus infection: review and meta-analysis Int J Cancer Ragin CC Taioli E 1813 1820 121 2007 17546592 10.1002/ijc.22851 33 HPV DNA, E6/E7 mRNA, and p16INK4a detection in head and neck cancers: a systematic review and meta-analysis Lancet Oncol Ndiaye C Mena M Alemany L 262 210 16 2015 10.1016/S1470-2045(15)70270-6 26065610 34 Oral squamous cell carcinoma: review of prognostic and predictive factors Oral Surg Oral Med Oral Pathol Oral Radiol Endod Massano J Regateiro FS Januário G Ferreira A 67 76 102 2006 16831675 10.1016/j.tripleo.2005.07.038 35 Meta-analysis of chemotherapy in head and neck cancer (MACH-NC): a comprehensive analysis by tumour site Radiother Oncol Blanchard P Baujat B Holostenco V Bourredjem A Baey C Bourhis J Pignon JP 33 40 100 2011 21684027 10.1016/j.radonc.2011.05.036 36 Meta-analysis of the impact of human papillomavirus (HPV) on cancer risk and overall survival in head and neck squamous cell carcinomas (HNSCC) Head Neck Oncol Dayyani F Etzel CJ Liu M Ho CH Lippman SM Tsao AS 15 2 2010 20587061 10.1186/1758-3284-2-15 PMC2908081 37 The association of telomere length and cancer: a meta-analysis Cancer Epidemiol Biomarkers Prev Wentzensen IM Mirabello L Pfeiffer RM Savage SA 1238 1250 20 2011 21467229 10.1158/1055-9965.EPI-11-0005 PMC3111877 38 Hypoxic modification of radiotherapy in squamous cell carcinoma of the head and neck--a systematic review and meta-analysis Radiother Oncol Overgaard J 22 32 100 2011 21511351 10.1016/j.radonc.2011.03.004 39 Prevalence of temporomandibular joint disorders: a systematic review and meta-analysis Clin Oral Investig Valesan LF Da-Cas CD Réus JC 441 453 25 2021 10.1007/s00784-020-03710-w 33409693 40 Fusion gene-negative alveolar rhabdomyosarcoma is clinically and molecularly indistinguishable from embryonal rhabdomyosarcoma J Clin Oncol Williamson D Missiaglia E de Reyniès A 2151 2158 28 2010 20351326 10.1200/JCO.2009.26.3814 41 Human papillomavirus as a risk factor for oral squamous cell carcinoma: a meta-analysis, 1982-1997 Oral Surg Oral Med Oral Pathol Oral Radiol Endod Miller CS Johnstone BM 622 635 91 2001 11402272 10.1067/moe.2001.115392 42 Oral epithelial dysplasia and the development of invasive squamous cell carcinoma Oral Surg Oral Med Oral Pathol Oral Radiol Endod Lumerman H Freedman P Kerpel S 321 329 79 1995 7621010 10.1016/s1079-2104(05)80226-4 43 Human papillomavirus related head and neck cancer survival: a systematic review and meta-analysis Oral Oncol O'Rorke MA Ellison MV Murray LJ Moran M James J Anderson LA 1191 1201 48 2012 22841677 10.1016/j.oraloncology.2012.06.019 44 Relationship between bruxism and temporomandibular disorders: a systematic review of literature from 1998 to 2008 Oral Surg Oral Med Oral Pathol Oral Radiol Endod Manfredini D Lobbezoo F 0 50 109 2010 10.1016/j.tripleo.2010.02.013 20451831 45 Adjuvant and adjunctive chemotherapy in the management of squamous cell carcinoma of the head and neck region. A meta-analysis of prospective and randomized trials J Clin Oncol El-Sayed S Nelson N 838 847 14 1996 8622032 10.1200/JCO.1996.14.3.838 46 Malignant transformation of oral leukoplakia: a systematic review of observational studies J Oral Pathol Med Warnakulasuriya S Ariyawardana A 155 166 45 2016 26189354 10.1111/jop.12339 47 An appraisal of oral cancer and pre-cancer screening programmes in Europe: a systematic review J Oral Pathol Med Warnakulasuriya S Fennell N Diz P Seoane J Rapidis A 559 570 44 2015 25346441 10.1111/jop.12267 48 Predictive value of tumor thickness for cervical lymph-node involvement in squamous cell carcinoma of the oral cavity: a meta-analysis of reported studies Cancer Huang SH Hwang D Lockwood G Goldstein DP O'Sullivan B 1489 1497 115 2009 19197973 10.1002/cncr.24161 49 Treatment and follow-up of oral dysplasia - a systematic review and meta-analysis Head Neck Mehanna HM Rattay T Smith J McConkey CC 1600 1609 31 2009 19455705 10.1002/hed.21131 50 An overview of randomised controlled trials of adjuvant chemotherapy in head and neck cancer Br J Cancer Munro AJ 83 91 71 1995 7819055 10.1038/bjc.1995.17 PMC2033467 51 Potentially malignant disorders of the oral cavity and oral dysplasia: a systematic review and meta-analysis of malignant transformation rate by subtype Head Neck Iocca O Sollecito TP Alawi F 539 555 42 2020 31803979 10.1002/hed.26006 52 Socioeconomic inequalities and oral cancer risk: a systematic review and meta-analysis of case-control studies Int J Cancer Conway DI Petticrew M Marlborough H Berthiller J Hashibe M Macpherson LM 2811 2819 122 2008 18351646 10.1002/ijc.23430 53 Gender differences in temporomandibular disorders in adult populational studies: a systematic review and meta-analysis J Oral Rehabil Bueno CH Pereira DD Pattussi MP Grossi PK Grossi ML 720 729 45 2018 29851110 10.1111/joor.12661 54 The prognostic role of tumor infiltrating T-lymphocytes in squamous cell carcinoma of the head and neck: a systematic review and meta-analysis Oncoimmunology de Ruiter EJ Ooft ML Devriese LA Willems SM 0 6 2017 10.1080/2162402X.2017.1356148 PMC5674970 29147608 55 Human papillomaviruses in oral carcinoma and oral potentially malignant disorders: a systematic review Oral Dis Syrjänen S Lodi G von Bültzingslöwen I 58 72 17 Suppl 1 2011 21382139 10.1111/j.1601-0825.2011.01792.x 56 Oral acyclovir therapy accelerates pain resolution in patients with herpes zoster: a meta-analysis of placebo-controlled trials Clin Infect Dis Wood MJ Kay R Dworkin RH Soong SJ Whitley RJ 341 347 22 1996 8838194 10.1093/clinids/22.2.341 57 Correlation between apparent diffusion coefficient (ADC) and cellularity is different in several tumors: a meta-analysis Oncotarget Surov A Meyer HJ Wienke A 59492 59499 8 2017 28938652 10.18632/oncotarget.17752 PMC5601748 58 A meta-analysis of hyperfractionated and accelerated radiotherapy and combined chemotherapy and radiotherapy regimens in unresected locally advanced squamous cell carcinoma of the head and neck BMC Cancer Budach W Hehr T Budach V Belka C Dietz K 28 6 2006 16448551 10.1186/1471-2407-6-28 PMC1379652 59 Prevalence of oral potentially malignant disorders: a systematic review and meta-analysis J Oral Pathol Med Mello FW Miguel AF Dutra KL Porporatti AL Warnakulasuriya S Guerra EN Rivero ER 633 640 47 2018 29738071 10.1111/jop.12726 60 A systematic review and meta-analysis of the diagnostic accuracy of fine-needle aspiration cytology for parotid gland lesions Am J Clin Pathol Schmidt RL Hall BJ Wilson AR Layfield LJ 45 59 136 2011 21685031 10.1309/AJCPOIE0CZNAT6SQ 61 HPV in oral squamous cell carcinoma vs head and neck squamous cell carcinoma biopsies: a meta-analysis (1988-2007) Ann Oncol Termine N Panzarella V Falaschini S Russo A Matranga D Lo Muzio L Campisi G 1681 1690 19 2008 18558666 10.1093/annonc/mdn372 62 Taxane-cisplatin-fluorouracil as induction chemotherapy in locally advanced head and neck cancers: an individual patient data meta-analysis of the meta-analysis of chemotherapy in head and neck cancer group J Clin Oncol Blanchard P Bourhis J Lacas B 2854 2860 31 2013 23835714 10.1200/JCO.2012.47.7802 63 Prevalence in the Dutch adult population and a meta-analysis of signs and symptoms of temporomandibular disorder J Dent Res De Kanter RJ Truin GJ Burgersdijk RC Van 't Hof MA Battistuzzi PG Kalsbeek H Käyser AF 1509 1518 72 1993 8227702 10.1177/00220345930720110901 64 Role of radiotherapy fractionation in head and neck cancers (MARCH): an updated meta-analysis Lancet Oncol Lacas B Bourhis J Overgaard J 1221 1237 18 2017 28757375 10.1016/S1470-2045(17)30458-8 PMC5737765 65 Intensity-modulated radiation therapy for head and neck cancer: systematic review and meta-analysis Radiother Oncol Marta GN Silva V de Andrade Carvalho H 9 15 110 2014 24332675 10.1016/j.radonc.2013.11.010 66 Worldwide prevalence of oral lichen planus: a systematic review and meta-analysis Oral Dis González-Moles MÁ Warnakulasuriya S González-Ruiz I 813 828 27 2021 32144836 10.1111/odi.13323 67 Prognostic significance of vascular endothelial growth factor immunohistochemical expression in head and neck squamous cell carcinoma: a meta-analysis Clin Cancer Res Kyzas PA Cunha IW Ioannidis JP 1434 1440 11 2005 15746043 10.1158/1078-0432.CCR-04-1870 68 Effects of preanalytical variables on the detection of proteins by immunohistochemistry in formalin-fixed, paraffin-embedded tissue Arch Pathol Lab Med Engel KB Moore HM 537 543 135 2011 21526952 10.5858/2010-0702-RAIR.1 69 Global burden of molar incisor hypomineralization J Dent Schwendicke F Elhennawy K Reda S Bekes K Manton DJ Krois J 10 18 68 2018 29221956 10.1016/j.jdent.2017.12.002 70 Diagnostic accuracy of p16(INK4a) immunohistochemistry in oropharyngeal squamous cell carcinomas: a systematic review and meta-analysis Int J Cancer Prigge ES Arbyn M von Knebel Doeberitz M Reuschenbach M 1186 1198 140 2017 27859245 10.1002/ijc.30516 71 Meta-analysis of chemotherapy in head and neck cancer (MACH-NC): an update on 107 randomized trials and 19,805 patients, on behalf of MACH-NC Group Radiother Oncol Lacas B Carmel A Landais C 281 293 156 2021 33515668 10.1016/j.radonc.2021.01.013 PMC8386522 72 Risk factors for osteoradionecrosis after head and neck radiation: a systematic review Oral Surg Oral Med Oral Pathol Oral Radiol Nabil S Samman N 54 69 113 2012 22669065 10.1016/j.tripleo.2011.07.042 73 Systematic review of the treatment and prognosis of the odontogenic keratocyst Oral Surg Oral Med Oral Pathol Oral Radiol Endod Blanas N Freund B Schwartz M Furst IM 553 558 90 2000 11077375 10.1067/moe.2000.110814 74 Meta- and pooled analyses of GSTM1, GSTT1, GSTP1, and CYP1A1 genotypes and risk of head and neck cancer Cancer Epidemiol Biomarkers Prev Hashibe M Brennan P Strange RC 1509 1517 12 2003 https://pubmed.ncbi.nlm.nih.gov/14693745/ 14693745 75 Prognostic value of tumor-infiltrating lymphocytes in melanoma: a systematic review and meta-analysis Oncoimmunology Fu Q Chen N Ge C 1593806 8 2019 31143514 10.1080/2162402X.2019.1593806 PMC6527267 76 Malignant transformation of oral lichen planus and oral lichenoid lesions: a meta-analysis of 20095 patient data Oral Oncol Aghbari SM Abushouk AI Attia A 92 102 68 2017 28438300 10.1016/j.oraloncology.2017.03.012 77 Clinicopathologic comparison of plasmablastic lymphoma in HIV-positive, immunocompetent, and posttransplant patients: single-center series of 25 cases and meta-analysis of 277 reported cases Am J Surg Pathol Morscio J Dierickx D Nijs J 875 886 38 2014 24832164 10.1097/PAS.0000000000000234 78 Estimated prevalence of erosive tooth wear in permanent teeth of children and adolescents: an epidemiological systematic review and meta-regression analysis J Dent Salas MM Nascimento GG Huysmans MC Demarco FF 42 50 43 2015 25446243 10.1016/j.jdent.2014.10.012 79 A systematic review with meta-analysis of the effect of low-level laser therapy (LLLT) in cancer therapy-induced oral mucositis Support Care Cancer Bjordal JM Bensadoun RJ Tunèr J Frigo L Gjerde K Lopes-Martins RA 1069 1077 19 2011 21660670 10.1007/s00520-011-1202-0 80 Human papillomavirus expression in oral mucosa, premalignant conditions, and squamous cell carcinoma: a retrospective review of the literature Oral Surg Oral Med Oral Pathol Oral Radiol Endod Miller C White D 57 68 82 1996 8843455 10.1016/s1079-2104(96)80378-7 81 Osteopontin is a marker for cancer aggressiveness and patient survival Br J Cancer Weber GF Lett GS Haubein NC 861 869 103 2010 20823889 10.1038/sj.bjc.6605834 PMC2966627 82 Detection of cervical lymph node metastasis in head and neck cancer patients with clinically N0 neck-a meta-analysis comparing different imaging modalities BMC Cancer Liao LJ Lo WC Hsu WL Wang CT Lai MS 236 12 2012 22691269 10.1186/1471-2407-12-236 PMC3476985 83 The reported prevalence of oral lichen planus: a review and critique J Oral Pathol Med McCartan BE Healy CM 447 453 37 2008 18624932 10.1111/j.1600-0714.2008.00662.x 84 Malignant transformation risk of oral lichen planus: a systematic review and comprehensive meta-analysis Oral Oncol González-Moles MÁ Ruiz-Ávila I González-Ruiz L Ayén Á Gil-Montoya JA Ramos-García P 121 130 96 2019 31422203 10.1016/j.oraloncology.2019.07.012 85 Prevalence of hypodontia and associated factors: a systematic review and meta-analysis J Orthod Khalaf K Miskelly J Voge E Macfarlane TV 299 316 41 2014 25404667 10.1179/1465313314Y.0000000116 86 Rate of malignant transformation of oral lichen planus: A systematic review Oral Dis Giuliani M Troiano G Cordaro M 693 709 25 2019 29738106 10.1111/odi.12885 87 Prognostic biomarkers for oral tongue squamous cell carcinoma: a systematic review and meta-analysis Br J Cancer Almangush A Heikkinen I Mäkitie AA Coletta RD Läärä E Leivo I Salo T 856 866 117 2017 28751758 10.1038/bjc.2017.244 PMC5589992 88 Extracapsular spread in head and neck squamous cell carcinoma: A systematic review and meta-analysis Oral Oncol Mermod M Tolstonog G Simon C Monnier Y 60 71 62 2016 27865373 10.1016/j.oraloncology.2016.10.003 89 Oral manifestations in patients with COVID-19: a living systematic review J Dent Res Amorim Dos Santos J Normando AG Carvalho da Silva RL 141 154 100 2021 32914677 10.1177/0022034520957289 90 Significance of CD44 expression in head and neck cancer: a systemic review and meta-analysis BMC Cancer Chen J Zhou J Lu J Xiong H Shi X Gong L 15 14 2014 24410905 10.1186/1471-2407-14-15 PMC3893437 91 Betel quid chewing and the risk of oral and oropharyngeal cancers: a meta-analysis with implications for cancer control Int J Cancer Guha N Warnakulasuriya S Vlaanderen J Straif K 1433 1443 135 2014 24302487 10.1002/ijc.28643 92 Maternal cigarette smoking and oral clefts: a meta-analysis Cleft Palate Craniofac J Wyszynski DF Duffy DL Beaty TH 206 210 34 1997 9167070 10.1597/1545-1569_1997_034_0206_mcsaoc_2.3.co_2 93 Prognostic role of pretreatment plasma fibrinogen in patients with solid tumors: a systematic review and meta-analysis Cancer Treat Rev Perisanidis C Psyrri A Cohen EE 960 970 41 2015 26604093 10.1016/j.ctrv.2015.10.002 94 Role of ultrasound-guided core-needle biopsy in the assessment of head and neck lesions: a meta-analysis and systematic review of the literature Head Neck Novoa E Gürtler N Arnoux A Kraft M 1497 1503 34 2012 22127851 10.1002/hed.21821 95 The hierarchy of different treatments for arthrogenous temporomandibular disorders: A network meta-analysis of randomized clinical trials J Craniomaxillofac Surg Al-Moraissi EA Wolford LM Ellis E 3rd Neff A 9 23 48 2020 31870713 10.1016/j.jcms.2019.10.004 96 Reliability of HIV rapid diagnostic tests for self-testing compared with testing by health-care workers: a systematic review and meta-analysis Lancet HIV Figueroa C Johnson C Ford N 0 90 5 2018 10.1016/S2352-3018(18)30044-4 PMC5986793 29703707 97 Hepatitis C virus infection and lichen planus: a systematic review with meta-analysis Oral Dis Lodi G Pellicano R Carrozzo M 601 612 16 2010 20412447 10.1111/j.1601-0825.2010.01670.x 98 Risk factors for herpes zoster infection: a meta-analysis Open Forum Infect Dis Marra F Parhar K Huang B Vadlamudi N 0 7 2020 10.1093/ofid/ofaa005 PMC6984676 32010734 99 Candida albicans and early childhood caries: a systematic review and meta-analysis Caries Res Xiao J Huang X Alkhers N 102 112 52 2018 29262404 10.1159/000481833 PMC5828948 100 A meta-analysis of the randomized controlled trials on elective neck dissection versus therapeutic neck dissection in oral cavity cancers with clinically node-negative neck Oral Oncol Fasunla AJ Greene BH Timmesfeld N Wiegand S Werner JA Sesterhenn AM 320 324 47 2011 21459661 10.1016/j.oraloncology.2011.03.009 101 Malignant transformation of oral leukoplakia: systematic review and meta-analysis of the last 5 years Oral Dis Aguirre-Urizar JM Lafuente-Ibáñez de Mendoza I Warnakulasuriya S 1881 1895 27 2021 33606345 10.1111/odi.13810 102 Sensitivity, specificity, and posttest probability of parotid fine-needle aspiration: a systematic review and meta-analysis Otolaryngol Head Neck Surg Liu CC Jethwa AR Khariwala SS Johnson J Shin JJ 9 23 154 2016 26428476 10.1177/0194599815607841 PMC4896151 103 Has hypodontia increased in Caucasians during the 20th century? A meta-analysis Eur J Orthod Mattheeuws N Dermaut L Martens G 99 103 26 2004 14994889 10.1093/ejo/26.1.99 104 Is diagnostic delay related to advanced-stage oral cancer? A meta-analysis Eur J Oral Sci Gómez I Seoane J Varela-Centelles P Diz P Takkouche B 541 546 117 2009 19758250 10.1111/j.1600-0722.2009.00672.x 105 Quality of life in survivors of oropharyngeal cancer: a systematic review and meta-analysis of 1366 patients Eur J Cancer Høxbroe Michaelsen S Grønhøj C Høxbroe Michaelsen J Friborg J von Buchwald C 91 102 78 2017 28431302 10.1016/j.ejca.2017.03.006 106 Elective neck dissection vs observation in early-stage squamous cell carcinoma of the oral tongue with no clinically apparent lymph node metastasis in the neck: a systematic review and meta-analysis JAMA Otolaryngol Head Neck Surg Abu-Ghanem S Yehuda M Carmel NN Leshno M Abergel A Gutfeld O Fliss DM 857 865 142 2016 27442962 10.1001/jamaoto.2016.1281 107 Adjuvant chemotherapy in head and neck cancer Br J Cancer Stell PM Rawson NS 779 787 61 1990 2140045 10.1038/bjc.1990.175 PMC1971597 108 What is the best surgical margin for a Basal cell carcinoma: a meta-analysis of the literature Plast Reconstr Surg Gulleth Y Goldberg N Silverman RP Gastman BR 1222 1231 126 2010 20885244 10.1097/PRS.0b013e3181ea450d 109 Surrogate endpoints for overall survival in locally advanced head and neck cancer: meta-analyses of individual patient data Lancet Oncol Michiels S Le Maître A Buyse M 341 350 10 2009 19246242 10.1016/S1470-2045(09)70023-3 110 Post-COVID syndrome. A case series and comprehensive review Autoimmun Rev Anaya JM Rojas M Salinas ML 102947 20 2021 34509649 10.1016/j.autrev.2021.102947 PMC8428988 111 HLA and Sjögren's syndrome susceptibility. A meta-analysis of worldwide studies Autoimmun Rev Cruz-Tapias P Rojas-Villarraga A Maier-Moore S Anaya JM 281 287 11 2012 22001416 10.1016/j.autrev.2011.10.002 112 Fine-needle aspiration cytology in a regional head and neck cancer center: comparison with a systematic review and meta-analysis Head Neck Tandon S Shahab R Benton JI Ghosh SK Sheard J Jones TM 1246 1252 30 2008 18528906 10.1002/hed.20849 113 Oral manifestations of diabetes mellitus. A systematic review Med Oral Patol Oral Cir Bucal Mauri-Obradors E Estrugo-Devesa A Jané-Salas E Viñas M López-López J 0 94 22 2017 10.4317/medoral.21655 PMC5694181 28809366 114 Xerostomia and salivary hypofunction in vulnerable elders: prevalence and etiology Oral Surg Oral Med Oral Pathol Oral Radiol Liu B Dion MR Jurasic MM Gibson G Jones JA 52 60 114 2012 22727092 10.1016/j.oooo.2011.11.014 115 Periodontal disease, edentulism, and pancreatic cancer: a meta-analysis Ann Oncol Maisonneuve P Amar S Lowenfels AB 985 995 28 2017 28453689 10.1093/annonc/mdx019 116 Meta-analysis of dysphagia and aspiration pneumonia in frail elders J Dent Res van der Maarel-Wierink CD Vanobbergen JN Bronkhorst EM Schols JM de Baat C 1398 1404 90 2011 21940518 10.1177/0022034511422909 117 Risk of osteonecrosis of the jaw in cancer patients receiving denosumab: a meta-analysis of seven randomized controlled trials Int J Clin Oncol Qi WX Tang LN He AN Yao Y Shen Z 403 410 19 2014 23605142 10.1007/s10147-013-0561-6 118 Individual patients' data meta-analyses in head and neck cancer Curr Opin Oncol Bourhis J Le Maître A Baujat B Audry H Pignon JP 188 194 19 2007 17414635 10.1097/CCO.0b013e3280f01010 119 Evidence-based clinical practice guideline on antibiotic use for the urgent management of pulpal- and periapical-related dental pain and intraoral swelling: a report from the American Dental Association J Am Dent Assoc Lockhart PB Tampi MP Abt E 906 921 150 2019 31668170 10.1016/j.adaj.2019.08.020 PMC8270006 120 Sentinel node biopsy for squamous cell carcinoma of the oral cavity and oropharynx: a diagnostic meta-analysis Oral Oncol Govers TM Hannink G Merkx MA Takes RP Rovers MM 726 732 49 2013 23680537 10.1016/j.oraloncology.2013.04.006 121 The impact of vitamin D pathway genetic variation and circulating 25-hydroxyvitamin D on cancer outcome: systematic review and meta-analysis Br J Cancer Vaughan-Shaw PG O'Sullivan F Farrington SM Theodoratou E Campbell H Dunlop MG Zgaga L 1092 1110 116 2017 28301870 10.1038/bjc.2017.44 PMC5396104 122 Global prevalence of cleft palate, cleft lip and cleft palate and lip: a comprehensive systematic review and meta-analysis J Stomatol Oral Maxillofac Surg Salari N Darvishi N Heydari M Bokaee S Darvishi F Mohammadi M 110 120 123 2022 34033944 10.1016/j.jormas.2021.05.008 123 Tumour budding in oral squamous cell carcinoma: a meta-analysis Br J Cancer Almangush A Pirinen M Heikkinen I Mäkitie AA Salo T Leivo I 577 586 118 2018 29190636 10.1038/bjc.2017.425 PMC5830589 124 Weekly low-dose versus three-weekly high-dose cisplatin for concurrent chemoradiation in locoregionally advanced non-nasopharyngeal head and neck cancer: a systematic review and meta-analysis of aggregate data Oncologist Szturz P Wouters K Kiyota N 1056 1066 22 2017 28533474 10.1634/theoncologist.2017-0015 PMC5599190 125 MicroRNAs as prognostic molecular signatures in human head and neck squamous cell carcinoma: a systematic review and meta-analysis Oral Oncol Jamali Z Asl Aminabadi N Attaran R Pournagiazar F Ghertasi Oskouei S Ahmadpour F 321 331 51 2015 25677760 10.1016/j.oraloncology.2015.01.008 126 Preventive intervention possibilities in radiotherapy- and chemotherapy-induced oral mucositis: results of meta-analyses J Dent Res Stokman MA Spijkervet FK Boezen HM Schouten JP Roodenburg JL de Vries EG 690 700 85 2006 16861284 10.1177/154405910608500802 127 Effects of antioxidant supplements on cancer prevention: meta-analysis of randomized controlled trials Ann Oncol Myung SK Kim Y Ju W Choi HJ Bae WK 166 179 21 2010 19622597 10.1093/annonc/mdp286 128 Drooling of saliva: a review of the etiology and management options Oral Surg Oral Med Oral Pathol Oral Radiol Endod Meningaud JP Pitak-Arnnop P Chikhani L Bertrand JC 48 57 101 2006 16360607 10.1016/j.tripleo.2005.08.018 ",
  "metadata": {
    "Title of this paper": "Drooling of saliva: a review of the etiology and management options",
    "Journal it was published in:": "Cureus",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12461762/"
  }
}