{
  "title": "Paper_732",
  "abstract": "pmc Biology (Basel) Biology (Basel) 2312 biology biology Biology 2079-7737 Multidisciplinary Digital Publishing Institute  (MDPI) PMC12467821 PMC12467821.1 12467821 12467821 41007258 10.3390/biology14091112 biology-14-01112 1 Review Bone-Derived Factors: Regulating Brain and Treating Alzheimer’s Disease Guan Qiao 1 † Cao Yanting 2 † Zou Jun 1 Zhang Lingli 2 * Abe Yohei Academic Editor Lanzolla Giulia Academic Editor 1 2321518016@sus.edu.cn zoujun@sus.edu.cn 2 21100614@sus.edu.cn * zhanglingli@sus.edu.cn † These authors contributed equally to this work. 22 8 2025 9 2025 14 9 497617 1112 23 7 2025 16 8 2025 19 8 2025 22 08 2025 27 09 2025 29 09 2025 © 2025 by the authors. 2025 https://creativecommons.org/licenses/by/4.0/ Licensee MDPI, Basel, Switzerland. This article is an open access article distributed under the terms and conditions of the Creative Commons Attribution (CC BY) license ( https://creativecommons.org/licenses/by/4.0/ Simple Summary Bone and brain exhibit bidirectional regulatory interactions, a phenomenon termed the “bone-brain axis.” Bone-derived cells and their secreted factors actively participate in modulating neural plasticity and brain disorders. Furthermore, osteoporosis and Alzheimer’s disease (AD) form a vicious cycle: reduced bone mineral density exacerbates AD pathology, while AD-associated neurodegeneration accelerates bone loss. Therapeutically, anti-osteoporotic drugs demonstrate cognitive benefits, neuroactive agents influence bone metabolism, and whole-body vibration therapy presents non-pharmacological intervention potential. Future research should integrate multi-omics biomarkers to achieve precision prevention and treatment. Abstract In recent years, the bidirectional regulatory mechanism of the bone-brain axis has become a hotspot for interdisciplinary research. In this paper, we systematically review the anatomical and functional links between bone and the central nervous system, focusing on the regulation of brain function by bone-derived signals and their clinical translational potential. At the anatomical level, the blood–brain barrier permeability mechanism and the unique structure of the periventricular organs establish the anatomical basis for bone-brain information transmission. Innovative discoveries indicate that the bone cell network (bone marrow mesenchymal stem cells, osteoblasts, osteoclasts, and bone marrow monocytes) directly regulates neuroplasticity and the inflammatory microenvironment through the secretion of factors such as osteocalcin, lipid transporter protein 2, nuclear factor κB receptor-activating factor ligand, and fibroblast growth factor 23, as well as exosome-mediated remote signaling. Clinical studies have revealed a bidirectional vicious cycle between osteoporosis and Alzheimer’s disease: reduced bone density exacerbates Alzheimer’s disease pathology through pathways such as PDGF-BB, while AD-related neurodegeneration further accelerates bone loss. The breakthrough lies in the discovery that anti-osteoporotic drugs, such as bisphosphonates, improve cognitive function. In contrast, neuroactive drugs modulate bone metabolism, providing new strategies for the treatment of comorbid conditions. Additionally, whole-body vibration therapy shows potential for non-pharmacological interventions by modulating bone-brain interactions through the mechano-osteoclast signaling axis. In the future, it will be essential to integrate multiple groups of biomarkers to develop early diagnostic tools that promote precise prevention and treatment of bone-brain comorbidities. This article provides a new perspective on the mechanisms and therapeutic strategies of neuroskeletal comorbidities. bone-brain axis bone-derived signaling neuro-skeletal comorbidity bidirectional bone-brain pharmacology whole-body vibration therapy multi-omics biomarkers National Natural Science Foundation of China 82272608 Shanghai Oriental Talent Program Youth Shanghai Key Laboratory of Human Performance 11DZ2261100 The work was supported by the National Natural Science Foundation of China (82272608); Shanghai Oriental Talent Program Youth; Shanghai Key Laboratory of Human Performance (11DZ2261100). pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement no pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes 1. Introduction Bone has traditionally been viewed as the primary organ responsible for providing structural support and protection, as well as participating in calcium and phosphorus metabolism and exercise. However, as research has progressed, scientific inquiry has expanded beyond single tissues or organs. The role of bone has evolved from its original functions of movement, support, and hematopoiesis to being recognized as a secretory organ in the body. It secretes bone-derived cytokines (BDCs) that affect organs beyond the skeletal system. Bone is now regarded as a potential new endocrine organ, affecting the physiological and pathological processes of the central nervous system (CNS), cardiovascular system, digestive system, and endocrine system through various bioactive cytokines secreted by its cells and bone marrow [ 1 The brain, as the central control center of the human body, ensures its normal functioning. Brain damage can result in various dysfunctions and significantly impair health. Common brain disorders include Parkinson’s disease (PD), traumatic brain injuries (TBI), and subarachnoid hemorrhage (SAH), among others, which can have a substantial impact on physical health and quality of life. Therefore, comprehending the mechanisms that regulate brain function is essential for treating these disorders. Clinical validation supports the bone and Alzheimer’s disease (AD) connection. A 2025 Japanese screening study of 8618 elderly women aged over 65 revealed that patients with low bone mineral density (BMD) had a markedly higher risk of developing AD compared to the control group, suggesting a definite link between osteopenia and AD [ 1 2 2 3 4 This article investigates the regulation of the brain by bone, specifically examining the autotransplantation of common types of bone cells (such as BMSCs, OBs, osteocytes, and BMMs) and their secreted substances, including bone-derived factors, neurotrophins, exosomes, and extracellular vesicles. It explores brain function, regulation modes, and mechanisms. A comprehensive understanding of the functional regulation of the bone-brain axis and overall biological regulation offers a new perspective on bidirectional bone-brain regulation. It provides a framework for the targeted development of bone-derived secretory factors for treating nervous system diseases, especially AD. 2. Anatomy of Bone-Brain Communication The bone-brain axis operates through dedicated anatomical pathways. Emerging evidence demonstrates that two structural components—the BBB and periventricular organs—collectively establish the core framework for neuro-osseous communication via multi-tiered channel-barrier regulatory systems. This sophisticated architecture not only exemplifies fundamental structural-functional integration in mammalian physiology but also provides a critical morphological basis for deciphering molecular pathways underlying bone-brain interactions. 2.1. Mechanisms of Blood–Brain Barrier Penetration The BBB is a highly specialized physiological barrier in the CNS, the core structure of which consists of blood–brain barrier endothelial cells (BCEC). The BBB is a dynamic interface that regulates intracerebral homeostasis and protects the CNS. It responds to different physiological and pathological conditions, separating neurotransmitters and neuroactive substances in the CNS, peripheral tissues, and blood [ 3 4 5 6 7 8 9 10 11 2.2. Mechanism of Circumventricular Organs Penetration The periventricular organs (Circumventricular Organs (CVO)) are highly vascularised and specialized regions lacking the BBB and have secretory and sensory properties located around the third and fourth ventricles. Due to their extensive vascular system and perforated capillaries, these organs represent the only region of the brain where circulating substances that do not pass through the BBB can enter directly into CNS tissue. In addition, the projections of CVO neurons to the autonomic control center and from the autonomic control center to other deep brain regions allow blood-borne substances to act on a variety of brain regions that are mainly protected by the BBB [ 12 13 In summary, the blood–brain barrier controls the entry of molecules of skeletal origin into the brain, and the periventricular organs provide a pathway for these molecules to bypass the blood–brain barrier. Through these complex anatomical structures, the skeleton and the brain can communicate closely and work together to maintain homeostasis in the organism. The synergy of these anatomical pathways not only explains the spatiotemporal specificity of bone-brain interactions but also provides new ideas for targeted intervention in metabolic-neurological comorbidities. Subsequent chapters will delve into the specific pathways and molecular mechanisms by which the skeletal cell network regulates brain function. 3. Bone Cell Network Signaling Modulates Neurological Pathologies Bone’s regulation of the brain involves its participation in the physiological and pathophysiological processes of the brain through various types of skeletal cells, which secrete various bioactive cytokines. For instance, BMSCs, OBs, osteocytes, and BMMs secrete and express diverse trophic factors. Additionally, these cells secrete factors, exosomes, and extracellular vesicles to regulate brain functions ( Figure 1 3.1. BMSCs Regulate Brain Function BMSCs are among the most critical cells in bone, possessing self-renewal and multilineage differentiation potential [ 14 15 16 17 18 17 18 19 14 20 21 3.1.1. BMSCs-Derived Trophic Factors Regulate Brain Function BMSCs can migrate to areas of nerve injury or neurodegeneration after transplantation, promoting nerve tissue repair and recovery of central and peripheral nervous system function. In an aged mouse model induced by D-galactose, intravenous injection of BMSCs resulted in the survival and migration of transplanted BMSCs to the brain. These cells differentiated into astrocytes and neurons, including choline acetyltransferase neurons, improving the early morphology and function of the aged brain [ 22 22 15 17 23 24 25 26 Traditionally, the treatment of nervous system diseases with BMSCs involves direct stem cell replacement of damaged tissue. However, in the treatment of stroke in mice with mesenchymal stem cell (MSC) transplantation, it was observed that only a minimal number of transplanted cells could be detected in the brain, with a minimal probability of expressing neuronal markers [ 27 28 29 30 15 BMSCs-Derived BDNF Regulates Brain Function BDNF is widely distributed in the brain and regulates the apoptosis, generation, and differentiation of neurons, playing an essential role in nervous system development and maintenance [ 31 32 33 34 35 34 BMSCs-Derived NGF Regulates Brain Function NGF is a neurotrophic factor that supports the survival and growth of nerve cells [ 36 37 38 39 40 41 36 42 43 BMSCs-Derived VEGF Regulates Brain Function VEGF is an essential regulator of physiological angiogenesis in multiple systems [ 21 44 45 21 24 46 47 48 49 50 51 52 BMSCs transplantation can improve cognitive function in aging and diabetic mice, as well as the learning and memory ability of dementia mice. Additionally, BMSCs can differentiate into neurons, astrocytes, and oligodendrocytes, promoting brain function recovery. Furthermore, BMSC secretion and regulation of neurotrophic factors play an active role in brain function recovery. BDNF delivered by BMSCs can effectively alleviate brain function damage, and BMSCs can also secrete BDNF to protect neurons from glutamate toxicity. Moreover, the secretion of NGF by BMSCs can reduce inflammation and improve nerve function. BMSCs can also promote brain angiogenesis, enhance cerebral blood perfusion, and promote brain function recovery through the secretion and expression of VEGF ( Figure 2 3.1.2. BMSCs-Derived Exosomes Regulate Brain Function EXOs are small vesicles with a diameter ranging from 40 to 100 nanometers, secreted by various cells [ 53 54 55 56 57 58 59 60 61 62 63 64 65 BMSCs-EXOs Regulate Brain Function by Regulating Neurons, Microvessels, and Intracerebral Factors BMSCs-EXOs ameliorated TBI in mice by regulating angiogenesis and neurogenesis, and reducing neuroinflammation [ 16 55 57 66 67 68 56 69 70 67 71 72 73 74 BMSCs-EXOs Regulate Brain Function by Regulating Inflammatory and Oxidative Stress In addition to promoting the functional recovery of brain injuries by regulating the generation and apoptosis of neurons, the formation of microvessels in the brain, and the expression of various factors, BMSCs-EXOs can also participate in regulating brain function by modulating inflammatory responses and oxidative stress. Wen et al. [ 75 76 77 72 71 78 23 BMSCs-EXOs Regulate Brain Function by Secreting microRNA The microRNAs (miRNAs) secreted by BMSCs-EXO play an essential role in regulating brain function through various mechanisms. MiRNA-129-5p in BMSCs-EXO inhibits the anti-inflammatory and anti-apoptotic effects of the high-mobility group box one protein (HMGB1)-Toll-like receptor-4 (TLR4) pathway, reducing the levels of HMGB1 mRNA, TNF-α, HMGB1, TLR4, and pro-apoptotic factor p53, thereby alleviating early brain injury after SAH [ 69 79 80 81 65 75 57 82 56 In conclusion, BMSCs-EXOs can enhance brain repair mechanisms by regulating neuronal proliferation and apoptosis, promoting cerebral angiogenesis, and reducing inflammation. Furthermore, BMSCs-EXOs containing different miRNAs exhibit varying effects on brain function. However, exosome-based therapies face critical challenges. Rapid administration (particularly for cancer vaccines or allogeneic cell therapies) requires large-scale exosome production within a short timeframe. Nevertheless, cell culture expansion is constrained by growth kinetics and limited cell yields [ 83 In short, following BMSCs transplantation, these cells migrate to sites of nerve injury or neurodegeneration, where they facilitate nerve tissue repair and restore central and peripheral nervous system function by differentiating into astrocytes and neurons [ 22 34 48 55 72 75 70 73 Figure 3 3.1.3. The Effects and Mechanisms of BMSCs on AD Multiple studies have demonstrated that BMSCs can ameliorate AD symptoms through the following mechanisms. First, injection into the lateral ventricle of extracellular vesicles derived from BMSC–EXOs improves behavioral manifestations similar to those in AD by suppressing the overactivation of hippocampal microglia and astrocytes in AD model mice. This leads to reduced expression of IL-1β, IL-6, TNF-α, and Aβ1-42 proteins, inhibition of Tau phosphorylation, and upregulation of synaptic-associated proteins and BDNF [ 72 Second, BMSCs transplantation inhibits neuronal apoptosis, enhances hippocampal superoxide dismutase activity, and significantly increases hippocampal BDNF protein levels [ 15 80 84 Additionally, BMSCs combined with other pharmacological treatments can alleviate AD symptoms. For example, breviscapine combined with BMSC therapy activates NF-κB to promote ubiquitin carboxyl-terminal hydrolase L1 expression, reduces Aβ deposition in AD rats, and facilitates the degradation of amyloid precursor protein and β-site APP-cleaving enzyme 1 [ 85 86 In conclusion, BMSCs mitigate AD symptoms through multiple mechanisms. Furthermore, we have summarized the therapeutic applications and mechanisms of BMSCs in brain diseases ( Table 1 3.2. Osteoblasts Regulate Brain Function OBs are bone-forming cells of the bone remodeling unit that are essential for bone growth and maintenance [ 87 Figure 4 3.2.1. OBs-Derived OCN Regulates Brain Function OCN is a bone-derived endocrine hormone that plays a regulatory role in various biological processes, including those occurring in the brain and bones [ 88 89 90 Evidence indicates that ucOCN crosses the BBB and accumulates in specific regions of the brain [ 91 92 91 91 93 92 91 91 −/− 94 95 −/− −/− −/− 91 96 97 3.2.2. OBs-Derived LCN2 Regulates Brain Function LCN2 is a typical small secretory protein with a hydrophobic ligand-binding pocket [ 98 99 100 101 LCN2 knockout (KO) mice were injected with peripheral LCN2, demonstrating that LCN2 could traverse the BBB and accumulate in the brain, substantiating its role beyond peripheral tissues [ 100 102 101 103 104 105 White matter, mainly composed of myelin, is essential for cognitive function, and white matter damage contributes to cognitive decline and dementia observed in brain disease [ 106 103 107 108 109 110 111 Normal physiological levels of LCN2 also influence adult mouse neurogenesis. Firstly, the cell cycle of neural stem cells in the G0/G1 phase in LCN2-deficient mice is arrested, affecting their proliferation, differentiation, and maturation [ 112 113 114 115 116 117 116 Although LCN2 is not expressed in the hypothalamus, it has been demonstrated to regulate food intake by traversing the BBB and directly stimulating cAMP signals within the hypothalamus. OB-derived LCN2 binds to the melanocortin four receptor (MC4R) within the hypothalamus, activates MC4R-dependent anorexigenic signaling, inhibits food intake, modulates glucose tolerance and homeostasis, insulin sensitivity, and secretion [ 101 102 118 Several studies suggest that LCN2 deficiency and excess may be associated with depression [ 119 120 121 122 123 124 125 126 127 122 128 100 125 125 129 Furthermore, LCN2 contributes to elevated risk factors and the development of age-related brain disorders through a variety of mechanisms, including iron metabolism, inflammation, and cell death/survival signaling [ 100 130 130 131 117 130 132 133 112 124 134 124 132 135 136 137 112 130 137 112 129 In conclusion, LCN2 secreted by OBs can traverse the brain through the BBB and play a role in white matter, nerve growth, and neurons. It can also interact with the hypothalamus to affect appetite and contribute to the development of anxiety and depression. Furthermore, LCN2 is implicated in several CNS diseases, including stroke and AD. Its principal mechanism of action may be attributed to the regulation of iron balance, and it is also associated with the inflammatory response and oxidative stress. 3.2.3. The Effects and Mechanisms of Osteoblasts on AD The effects of osteoblasts on AD are primarily mediated through OCN and LCN2. The role of OCN in AD remains controversial. On one hand, studies have demonstrated that OCN can ameliorate AD pathology through multiple mechanisms: OCN reduces Aβ deposition in the hippocampus and cortex of AD model mice; enhances high γ-band activity in the medial prefrontal cortex; promotes glycolysis in astrocytes and microglia; and inhibits astrocyte proliferation in the hippocampal region [ 138 Additionally, suppression of LCN2 has been shown to improve AD symptoms partially [ 97 124 131 139 3.3. Osteocytes Regulate Brain Function Osteocytes constitute the predominant cell type in bone tissue, dispersed throughout the mineralized bone matrix and forming an interconnected network [ 140 141 Figure 5 3.3.1. Osteocytes-Derived RANKL Regulates Brain Function RANKL is a type II homotrimeric transmembrane protein expressed as a membrane-bound and secreted protein. It is generated from the membrane form by proteolytic cleavage or alternative splicing [ 142 143 144 145 146 147 148 RANKL exerts its effects on the hypothalamus, regulating dietary intake and the febrile response. Firstly, RANKL regulates dietary intake. Zhu et al. [ 149 150 151 152 153 154 154 155 154 156 157 158 OPG is a secreted glycoprotein synthesized by various cells, such as OBs, B lymphocytes, and articular chondrocytes [ 159 143 160 161 162 163 In conclusion, RANKL secreted by bone cells regulates brain function through RANKL/RANK and RANK-RANKL-OPG pathways, playing a specific role in regulating dietary intake, the febrile response, and brain injury repair. Additionally, using bi-directional and multivariable Mendelian randomization, researchers found that elevated blood RANKL levels were associated with reduced AD risk [ 164 3.3.2. Osteocytes-Derived FGF23 Regulates Brain Function FGF23 is an endocrine hormone secreted by osteocytes within the skeleton [ 165 166 167 167 168 FGF23 is closely linked to various central diseases. Firstly, McGrath et al. [ 169 167 170 171 172 173 172 174 Furthermore, FGF23 is involved in regulating brain tissue through its inflammatory response. Kuro et al. [ 175 In summary, the effects of FGF23 on the brain primarily manifest in various central diseases, affecting learning, memory, and cognitive function, as well as modulating inflammation in brain tissue through the KL-FGF23-VD axis. 3.3.3. Osteocytes-Derived EVs Regulate Brain Function Extracellular vesicles (EVs) play an essential role in mediating biological signals between cells [ 176 176 177 178 179 young 180 181 182 young young young 180 In conclusion, osteocytes secrete FGF23 and EVs to participate in the regulation of central diseases. 3.3.4. The Effects and Mechanisms of Osteocytes on AD OCY young 180 183 184 185 186 187 188 189 190 191 3.4. BMMs Regulate Brain Function 3.4.1. Transplanted BMMs Regulate Brain Function BMMs form a diverse cell population derived from bone marrow, comprising variously mature B cells, T cells, monocytes, and a smaller proportion of progenitor cells such as hematopoietic stem cells, mesenchymal stem cells, endothelial progenitor cells, and tiny embryonic-like cells [ 192 193 194 195 196 193 197 198 199 200 Apart from their therapeutic effects on cerebral ischemia, BMMs have also demonstrated a role in treating cerebral hemorrhage. Liem et al. [ 201 202 203 204 205 206 207 208 209 210 211 212 In conclusion, the transplantation of BMM has demonstrated promising therapeutic effects in various cerebrovascular diseases and traumatic brain injuries, improving cognition, intelligence, and restoring neurological function. 3.4.2. Preosteoclasts-Derived PDGF-BB Regulates Brain Function Platelet-derived growth factor BB (PDGF-BB) is an angiogenic factor secreted by tartrate-resistant acid phosphatase-positive (TRAP+) preosteoclasts [ 118 213 214 Selective knockout of PDGF-BB from preosteoclasts resulted in an approximately 40% decrease in serum PDGF-BB concentration in mice, indicating that preosteoclasts are a significant source of serum PDGF-BB under healthy conditions [ 215 213 215 PDGF-BB/PDGF receptor (PDGFR β) signaling mediated pericyte-endothelial crosstalk plays a critical role in embryonic development [ 216 217 218 217 219 215 220 221 Pericytes, which line the walls of brain capillaries and share the same basement membrane as capillary endothelial cells, are key cell types in maintaining the integrity of the BBB [ 222 223 218 215 215 Furthermore, BMMs can improve the symptoms of cerebral hemorrhage and ischemic diseases, and possess neurological recovery and anti-inflammatory functions. Preosteoclasts secrete PDGF-BB to regulate brain functions, including cognitive and memory functions. OCs, as one of the most common cells in bone, have functions in bone resorption and secretion. The regulation of the brain by OCs may occur through the secretion of bone morphogenetic proteins (BMPs) and sphingosine-1-phosphate (S1P) [ 224 225 226 227 228 Figure 6 3.4.3. The Effects and Mechanisms of Osteoclasts on AD Currently, there is limited research on the impact of osteoclasts on AD. Intravenous transplantation of BMMs has been shown to ameliorate symptoms in AD model mice by inhibiting neuronal loss and reducing Aβ deposition in the brain [ 206 191 4. Osteoporosis and AD: A Common Pathophysiology The interactions between bone and brain form a complex dynamic network through shared pathological mechanisms and molecular signaling pathways. This ‘brain-skeletal axis’ is particularly evident in the comorbidities of neurodegenerative diseases and skeletal metabolic abnormalities. Numerous studies have highlighted the bidirectional and early relationship between cognitive impairment, dementia, fragility fractures, and low BMD [ 229 230 231 232 4.1. The Pathogenesis Mechanisms of AD Aβ plaques and pTau NFTs represent the two most prominent molecular hallmarks of AD [ 233 234 The pathological aggregation of the tau protein constitutes one of the core pathological mechanisms in AD. Under physiological conditions, the positively charged proline-rich region (PRR) maintains stable tau-microtubule binding through charge repulsion with the positively charged microtubule-binding repeat domain (MTBR). In the disease state, hyperphosphorylation of the PRR (along with other post-translational modifications [PTMs] such as acetylation or ubiquitination) converts its net charge from positive to negative, inducing conformational changes in tau. This transformation facilitates tau detachment from microtubules, resulting in microtubule destabilization [ 235 236 237 237 238 238 239 239 240 Amyloid precursor protein (APP) is ubiquitously expressed in the brain, particularly enriched at neuronal synapses, where it participates in neuroprotection, synaptic plasticity, and neuronal development [ 241 242 243 In addition, multi-omics research has also been widely applied to the study of AD and has achieved specific results, providing new perspectives for AD research. Transcriptomic studies of AD have elucidated multi-layered pathological mechanisms. Single-nucleus RNA sequencing (snRNA-seq) analyses revealed that LINGO1, a negative regulator of myelination, is significantly upregulated in AD [ 244 244 245 245 246 247 Spatial transcriptomics (10x Visium) elucidated the spatiotemporal dynamics of pathological progression: in both sporadic AD and Down syndrome-associated AD, amyloid plaque-adjacent regions showed activation of genes related to inflammatory responses, lysosomal degradation, and endocytosis, alongside aberrant upregulation of myelination-related genes in oligodendrocytes [ 248 249 250 4.2. The Treatment Mechanisms of AD Core Molecular Mechanisms of AD Treatment encompass strategies ranging from the clearance of pathogenic protein aggregates and oligomers (Aβ and Tau), modulation of protein phosphorylation via O-GlcNAcylation, and counteracting neuroinflammation and oxidative stress, to the activation of beneficial cellular responses, such as microglial phagocytosis. These approaches collectively aim to mitigate or reverse the neurodegenerative processes associated with AD. Although Aβ-targeted therapies have not yet achieved permanent remission of AD, they remain a central focus of research. The oral small-molecule prodrug ALZ-801 functions by inhibiting Aβ oligomer formation, particularly in high-risk populations such as APOE4/4 homozygous individuals [ 243 251 252 For the tau protein, another key pathological hallmark of AD, characterized by abnormal aggregation and hyperphosphorylation (pTau), therapeutic strategies focus on disrupting its cascade. IgG1 antibodies targeting the HVPGG motif recognize microtubule-binding domains, inhibiting extracellular Tau seeding and aggregation while reducing Tau deposition in animal models [ 253 254 255 256 243 Neuroinflammation and oxidative stress pathways are also critical intervention targets. NE3107 suppresses the NF-κB/ERK signaling pathway and reduces MAPK activation, thereby decreasing pro-inflammatory cytokine release, such as TNFα, IL-1α, and alleviating neuroinflammation [ 257 258 2 2 254 259 Notably, microglial function modulation has emerged as a novel therapeutic direction. AL002c, a TREM2 receptor agonist, enhances microglial phagocytic activity and promotes the encapsulation of Aβ deposits, forming a “protective barrier” [ 260 4.3. Low Bone Density Exacerbates AD There is a significant association between low BMD and AD, which can increase the risk of brain-related diseases. Females with lower BMD have a higher risk of developing AD, especially in the femoral neck region [ 261 262 263 There is a robust association between BMD and brain diseases, with underlying mechanisms involving various signaling pathways and proteins secreted by the bone. mTOR and MAPK pathways have emerged as key molecular targets in bone metabolic disorders by finely regulating the osteogenic-osteoclast balance. In AD studies, it has been found that the MAPK signaling pathway and the mTOR signaling pathway play essential roles in the onset and development of AD. The specific functions of mTOR in the brain include axonal regeneration and ejection, myelin formation, and channel expression [ 264 92 4.4. AD Exacerbates Bone Loss AD also impairs bone health to some extent. Firstly, patients with AD have a doubled risk of fragility fractures, while their risk of hip fragility fracture reaches even 2.5 times that of patients without AD [ 265 2 Aβ aggregation may trigger AD pathology due to the loss of physiological function [ 266 267 268 269 In conclusion, low BMD and AD interact with each other. Low BMD exacerbates the incidence of AD, and MAPK and mTOR may act as signaling pathways for the two diseases to communicate with each other. Patients with AD also experience bone loss, which may be related to their limited mobility on one hand and the regulation of bone resorption by AD on the other. 5. Dual Modulation of Bone and Brain Function by Drugs 5.1. Effects of Osteoporosis Medications on Cognitive Functioning Selective estrogen receptor modulators such as raloxifene exhibit dual roles in brain function, acting as both an estrogen receptor agonist and an antagonist, thereby reducing the risk of estrogen-dependent tumors while having complex effects on cognitive function [ 270 271 272 273 274 275 276 275 277 278 279 5.2. Neuropharmacological Modulation of Bone Density On the other hand, neurological drugs can also affect bone density. Cholinesterase inhibitors in elderly AD patients not only improve cognitive function but are also associated with better hip fracture healing and increased BMD [ 280 281 282 283 6. Clinical Applications—Whole Body Vibration Therapy to Regulate Bone Brain Crosstalk Whole-body vibration (WBV) is a physical intervention delivered to the whole body by mechanical vibration, and its mechanisms of action and effects have been widely researched in both the brain and skeletal system. The modulation of brain function by WBV is primarily manifested in three aspects: firstly, WBV stimulates brain regions to enhance neurological function and synaptic plasticity through specific parameters. 27 Hz WBV activates motor networks and the prefrontal cortex in healthy adult males [ 284 285 286 287 288 286 289 WBV promotes bone formation and improves bone density. WBV directly modulates bone metabolism through mechanical stimulation: 30 Hz, 15 min/dose of WBV, 8 times/week for 8 weeks, alleviates ovariectomy-induced osteoporosis and inhibits bone resorption [ 290 291 292 WBV has a common regulatory mechanism in the brain and bone. On the one hand, WBV (2 min of vibration, 30 s of rest, 12 weeks, 3 times/week, 36 times in total) significantly up-regulated the expression of Fibronectin Type III Domain Containing 5 (FNDC5) in bone, which promoted the proliferation of osteoblasts and reduced the number of osteoclasts [ 285 285 293 294 295 296 In conclusion, WBV achieves synergistic interventions on the brain and skeletal system through shared molecular mechanisms, such as the FNDC5/BDNF pathway, and bidirectional regulation of the bone-brain axis. The effects are highly dependent on vibration parameters: high-frequency short-duration training, such as 45 Hz, intermittent, is beneficial for both brain and bone. It may achieve synergistic effects through the FNDC5/BDNF pathway. Additionally, Li et al. analyzed the skeletal improvements induced by different WBV treatment regimens in recent years. They found that the primary parameters employed were 20 to 40 Hz, 2 to 3 times per week, and 5 to 10 min of vibration [ 292 7. Future Directions and Challenges Integrating multi-omics approaches to decipher bone-brain interactions is of great significance. Mone Zaidi et al. [ 297 Given the current characteristics of various omics technologies, single-cell multi-omics (scMulti-omics) is regarded as the primary methodology for investigating bone-brain comorbidities. By integrating multi-layered molecular information—including genomic, transcriptomic, and chromatin accessibility data—at the single-cell level, this approach surmounts the limitations of conventional single-omics analyses, such as bulk profiling. It provides profound insights into cell-type-specific regulatory networks and disease mechanisms, which are critical for identifying precise biomarkers [ 298 299 299 300 301 Current studies have identified several biomarkers of bone-brain inter-regulation. NPY, a key mediator connecting the nervous and skeletal systems, regulates bone formation through osteoblast lineage differentiation while regulating energy metabolism in the central nervous system (especially in the arcuate nucleus of the hypothalamus) [ 302 303 304 305 306 307 308 309 Bone-derived hormone studies have further expanded the scope of biomarkers: As an anti-aging factor alleviating cognitive decline [ 310 311 311 312 313 97 Current evidence suggests that a multidimensional combination of biomarkers integrating bone metabolism indicators (OCN, OPN), NPY and metabolic hormones (leptin), combined with their dynamic network of interactions between central and peripheral, may provide a new strategy for the early identification of bone-brain comorbidities, but the predictive efficacy needs to be validated by longitudinal cohorts, and the specific molecular mechanisms can be explored by combining a multi-omics approach. The permeability of molecules or drugs across the BBB has long been a focal yet challenging aspect of research on brain-related disorders. Currently, there is a lack of direct studies investigating the penetration of bone-derived factors through the BBB. Based on existing research progress, several well-recognized and highly accurate detection techniques have been employed to predict the permeability of drugs or small molecules across the BBB, including the machine learning-based c-RASAR method [ 314 315 316 317 8. Conclusions Bone is not only a motor organ but also an essential endocrine organ. In this paper, we found that bone regulates brain function primarily through its secretions, with a focus on specific cell types. This regulatory function can mitigate brain damage and promote the restoration of brain function. The paper establishes a novel clinical approach by utilizing bone-associated cells as an intervention modality for the treatment of brain diseases, transcending the conventional single-organ study and offering a more comprehensive investigation of the relationship between these two significant organs. Concomitantly, this study will expand our understanding of bone and provide a valuable set of references for the interactions between bone and other organs. The research model can be applied to the study of interactions among other organs, significantly contributing to the comprehension of cell–cell interactions, cross-organ functional regulation, and overall bioregulation. Disclaimer/Publisher’s Note: Author Contributions L.Z. gave the brief introduction of this article. Q.G. and Y.C. was responsible for manuscript writing. Q.G. drew figures. L.Z. and J.Z. revised the manuscript. All authors have read and agreed to the published version of the manuscript. Institutional Review Board Statement Not applicable. Informed Consent Statement Not applicable. Data Availability Statement Not applicable. Conflicts of Interest The authors declare that they have no competing interests. Abbreviations A cluster of differentiation CD Alzheimer’s disease AD Blood–brain barrier BBB BMSCs-derived exosomes BMSCs-EXOs Bone marrow-derived mononuclear cells BMMs Bone marrow mesenchymal stem cells BMSCs Bone morphogenetic proteins BMPs Bone-derived cytokines BDCs Brain-derived neurotrophic factor BDNF Carboxylated osteocalcin cOCN Central nervous system CNS Cerebrospinal fluid CSF chemokine receptor Cx3cr1 chronic kidney disease CKD C-X-C chemokine receptor type 4 CXCR4 Cyclooxygenase 2 COX2 Early growth response protein 1 Egr1 Exosomes EXOs Experimental allergic encephalomyelitis EAE Extracellular signal-regulated kinases 1 and 2 ERK1/2 Extracellular vesicles EVs Fibroblast growth factor2 FGF2 Fibrosarcoma 1 Raf1 High-mobility group box 1 protein HMGB1 Hypoxic–ischemic brain damage HIBD Inducible nitric oxide synthase iNOS Interferon-γ IFN-γ Interleukin-1 receptor-associated kinase1 IRAK1 Interleukin-6 IL-6 Intracerebral hemorrhage ICH Ischemia/reperfusion I/R Ischemic stroke IS Klotho KL Knockout KO Lipocalin-2 LCN2 Malondialdehyde MDA Matrix metalloproteinase MMP Melanocortin 4 receptor MC4R Membrane-bound RANKL mRANKL Mesenchymal stem cell MSC Multiple sclerosis MS Nerve growth factor NGF Neuropeptide Y NPY Nuclear factor kappa B NF-κB Nuclear factor of activated T cells 5 NFAT5 Nuclear factor-κB ligand RANKL Osteoblasts Obs Osteocalcin OCN Osteoclasts Ocs Oxygen-glucose deprivation/reperfusion OGD/R Parkinson’s disease PD PDGF-BB/PDGF receptor PDGFR β Permanent middle cerebral artery occlusion pMCAO Phosphatase gene PTEN Platelet-derived growth factor BB PDGF-BB Postsynaptic density protein 95 PSD95 Soluble RANKL sRANKL Sphingosine-1-phosphate S1P Streptozotocin STZ Stromal cell-derived factor 1 SDF-1 Subarachnoid hemorrhage SAH Superoxide dismutase SOD Tartrate-resistant acid phosphatase positive TRAP+ The common carotid arteries 2VO Toll-like receptor-4 TLR4 Transient middle cerebral artery occlusion TMCAO Traumatic brain injuries TBI Tumor necrosis factor-α TNF-α Uncarboxylated osteocalcin ucOCN Vascular endothelial growth factor VEGF Vitamin D VD γ-aminobutyric acid GABA References 1. Pang Y. Jia D. Ye F. Liu F. Li J. Zhu S. Wang B. Yao M. Du L. Yang C. Bone Marrow-Derived Myeloid Cells Drive Neuroinflammation in Alzheimer’s Disease: Insights from the FAD(4T) Mouse Model J. Orthop. Transl. 2025 53 309 324 10.1016/j.jot.2025.06.014 40687552 PMC12272449 2. Loskutova N. Honea R.A. Brooks W.M. Burns J.M. Reduced Limbic and Hypothalamic Volumes Correlate with Bone Density in Early Alzheimer’s Disease J. Alzheimer’s Dis. 2010 20 313 322 10.3233/JAD-2010-1364 20164583 PMC2892930 3. Abbott N.J. Rönnbäck L. Hansson E. Astrocyte-Endothelial Interactions at the Blood-Brain Barrier Nat. Rev. Neurosci. 2006 7 41 53 10.1038/nrn1824 16371949 4. Pandit R. Chen L. Götz J. The Blood-Brain Barrier: Physiology and Strategies for Drug Delivery Adv. Drug Deliv. Rev. 2020 165–166 1 14 10.1016/j.addr.2019.11.009 31790711 5. Dong X. Current Strategies for Brain Drug Delivery Theranostics 2018 8 1481 1493 10.7150/thno.21254 29556336 PMC5858162 6. Wu D. Chen Q. Chen X. Han F. Chen Z. Wang Y. The Blood-Brain Barrier: Structure, Regulation, and Drug Delivery Signal Transduct. Target. Ther. 2023 8 217 10.1038/s41392-023-01481-w 37231000 PMC10212980 7. Johnsen K.B. Burkhart A. Thomsen L.B. Andresen T.L. Moos T. Targeting the Transferrin Receptor for Brain Drug Delivery Prog. Neurobiol. 2019 181 101665 10.1016/j.pneurobio.2019.101665 31376426 8. Xie J. Shen Z. Anraku Y. Kataoka K. Chen X. Nanomaterial-Based Blood-Brain-Barrier (BBB) Crossing Strategies Biomaterials 2019 224 119491 10.1016/j.biomaterials.2019.119491 31546096 PMC6915305 9. Matsumoto J. Stewart T. Banks W.A. Zhang J. The Transport Mechanism of Extracellular Vesicles at the Blood-Brain Barrier Curr. Pharm. Des. 2017 23 6206 6214 10.2174/1381612823666170913164738 28914201 10. Sadeghi S. Tehrani F.R. Tahmasebi S. Shafiee A. Hashemi S.M. Exosome Engineering in Cell Therapy and Drug Delivery Inflammopharmacology 2023 31 145 169 10.1007/s10787-022-01115-7 36609717 PMC9823267 11. Counil H. Silva R.O. Rabanel J.M. Zaouter C. Haddad M. Ben Khedher M.R. Brambilla D. Fülöp T. Patten S.A. Ramassamy C. Brain Penetration of Peripheral Extracellular Vesicles from Alzheimer’s Patients and Induction of Microglia Activation J. Extracell. Biol. 2025 4 e70027 10.1002/jex2.70027 39830834 PMC11740088 12. Gonçalves R.A. De Felice F.G. The Crosstalk between Brain and Periphery: Implications for Brain Health and Disease Neuropharmacology 2021 197 108728 10.1016/j.neuropharm.2021.108728 34331960 13. Balland E. Dam J. Langlet F. Caron E. Steculorum S. Messina A. Rasika S. Falluel-Morel A. Anouar Y. Dehouck B. Hypothalamic Tanycytes Are an ERK-Gated Conduit for Leptin into the Brain Cell Metab. 2014 19 293 301 10.1016/j.cmet.2013.12.015 24506870 PMC3936883 14. Pittenger M.F. Mackay A.M. Beck S.C. Jaiswal R.K. Douglas R. Mosca J.D. Moorman M.A. Simonetti D.W. Craig S. Marshak D.R. Multilineage Potential of Adult Human Mesenchymal Stem Cells Science 1999 284 143 147 10.1126/science.284.5411.143 10102814 15. Bao X. Wei J. Feng M. Lu S. Li G. Dou W. Ma W. Ma S. An Y. Qin C. Transplantation of Human Bone Marrow-Derived Mesenchymal Stem Cells Promotes Behavioral Recovery and Endogenous Neurogenesis after Cerebral Ischemia in Rats Brain Res. 2011 1367 103 113 10.1016/j.brainres.2010.10.063 20977892 16. Zhang Y. Chopp M. Zhang Z.G. Katakowski M. Xin H. Qu C. Ali M. Mahmood A. Xiong Y. Systemic Administration of Cell-Free Exosomes Generated by Human Bone Marrow Derived Mesenchymal Stem Cells Cultured under 2D and 3D Conditions Improves Functional Recovery in Rats after Traumatic Brain Injury Neurochem. Int. 2017 111 69 81 10.1016/j.neuint.2016.08.003 27539657 PMC5311054 17. Liu G.Y. Wu Y. Kong F.Y. Ma S. Fu L.Y. Geng J. BMSCs Differentiated into Neurons, Astrocytes and Oligodendrocytes Alleviated the Inflammation and Demyelination of EAE Mice Models PLoS ONE 2021 16 e0243014 10.1371/journal.pone.0243014 33983943 PMC8118321 18. Ono N. Balani D.H. Kronenberg H.M. Stem and Progenitor Cells in Skeletal Development Curr. Top. Dev. Biol. 2019 133 1 24 10.1016/bs.ctdb.2019.01.006 30902249 PMC6568007 19. Seyfried D. Ding J. Han Y. Li Y. Chen J. Chopp M. Effects of Intravenous Administration of Human Bone Marrow Stromal Cells after Intracerebral Hemorrhage in Rats J. Neurosurg. 2006 104 313 318 10.3171/jns.2006.104.2.313 16509507 20. Jo H. Jung M. Seo D.J. Park D.J. The Effect of Rat Bone Marrow Derived Mesenchymal Stem Cells Transplantation for Restoration of Olfactory Disorder Biochem. Biophys. Res. Commun. 2015 467 395 399 10.1016/j.bbrc.2015.09.142 26427869 21. Zacharek A. Chen J. Cui X. Li A. Li Y. Roberts C. Feng Y. Gao Q. Chopp M. Angiopoietin1/Tie2 and VEGF/Flk1 Induced by MSC Treatment Amplifies Angiogenesis and Vascular Stabilization after Stroke J. Cereb. Blood Flow Metab. 2007 27 1684 1691 10.1038/sj.jcbfm.9600475 17356562 PMC2796470 22. El-Akabawy G. Aabed K. Rashed L.A. Amin S.N. AlSaati I. Al-Fayez M. Preventive Effects of Bone Marrow-Derived Mesenchymal Stem Cell Transplantation in a D-Galactose-Induced Brain Aging in Rats Folia Morphol. 2022 81 632 649 10.5603/FM.a2021.0073 34355788 23. Nakano M. Nagaishi K. Konari N. Saito Y. Chikenji T. Mizue Y. Fujimiya M. Bone Marrow-Derived Mesenchymal Stem Cells Improve Diabetes-Induced Cognitive Impairment by Exosome Transfer into Damaged Neurons and Astrocytes Sci. Rep. 2016 6 24805 10.1038/srep24805 27102354 PMC4840335 24. Song M. Mohamad O. Gu X. Wei L. Yu S.P. Restoration of Intracortical and Thalamocortical Circuits after Transplantation of Bone Marrow Mesenchymal Stem Cells into the Ischemic Brain of Mice Cell Transplant. 2013 22 2001 2015 10.3727/096368912X657909 23069268 25. Chang Y.C. Shyu W.C. Lin S.Z. Li H. Regenerative Therapy for Stroke Cell Transplant. 2007 16 171 181 10.3727/000000007783464669 17474298 26. Shichinohe H. Kuroda S. Yano S. Hida K. Iwasaki Y. Role of SDF-1/CXCR4 System in Survival and Migration of Bone Marrow Stromal Cells after Transplantation into Mice Cerebral Infarct Brain Res. 2007 1183 138 147 10.1016/j.brainres.2007.08.091 17976542 27. Shen L.H. Li Y. Chen J. Cui Y. Zhang C. Kapke A. Lu M. Savant-Bhonsale S. Chopp M. One-Year Follow-up after Bone Marrow Stromal Cell Treatment in Middle-Aged Female Rats with Stroke Stroke 2007 38 2150 2156 10.1161/STROKEAHA.106.481218 17525391 28. Li Y. Chen J. Chen X.G. Wang L. Gautam S.C. Xu Y.X. Katakowski M. Zhang L.J. Lu M. Janakiraman N. Human Marrow Stromal Cell Therapy for Stroke in Rat: Neurotrophins and Functional Recovery Neurology 2002 59 514 523 10.1212/WNL.59.4.514 12196642 29. Chen J. Li Y. Katakowski M. Chen X. Wang L. Lu D. Lu M. Gautam S.C. Chopp M. Intravenous Bone Marrow Stromal Cell Therapy Reduces Apoptosis and Promotes Endogenous Cell Proliferation after Stroke in Female Rat J. Neurosci. Res. 2003 73 778 786 10.1002/jnr.10691 12949903 30. Mattson M.P. Maudsley S. Martin B. BDNF and 5-HT: A Dynamic Duo in Age-Related Neuronal Plasticity and Neurodegenerative Disorders Trends Neurosci. 2004 27 589 594 10.1016/j.tins.2004.08.001 15374669 31. Thoenen H. Neurotrophins and Neuronal Plasticity Science 1995 270 593 598 10.1126/science.270.5236.593 7570017 32. Schäbitz W.R. Sommer C. Zoder W. Kiessling M. Schwaninger M. Schwab S. Intravenous Brain-Derived Neurotrophic Factor Reduces Infarct Size and Counterregulates Bax and Bcl-2 Expression after Temporary Focal Cerebral Ischemia Stroke 2000 31 2212 2217 10.1161/01.STR.31.9.2212 10978054 33. Liu X.L. Zu Q.Q. Wang B. Lu S.S. Xu X.Q. Liu S. Shi H.B. Differentiation of Genetically Modified Canine Bone Mesenchymal Stem Cells Labeled with Superparamagnetic Iron Oxide into Neural-Like Cells Mol. Med. Rep. 2018 17 7902 7910 10.3892/mmr.2018.8847 29620288 34. Shichinohe H. Ishihara T. Takahashi K. Tanaka Y. Miyamoto M. Yamauchi T. Saito H. Takemoto H. Houkin K. Kuroda S. Bone Marrow Stromal Cells Rescue Ischemic Brain by Trophic Effects and Phenotypic Change toward Neural Cells Neurorehabilit. Neural Repair 2015 29 80 89 10.1177/1545968314525856 24633139 35. Makar T.K. Bever C.T. Singh I.S. Royal W. Sahu S.N. Sura T.P. Sultana S. Sura K.T. Patel N. Dhib-Jalbut S. Brain-Derived Neurotrophic Factor Gene Delivery in an Animal Model of Multiple Sclerosis Using Bone Marrow Stem Cells as a Vehicle J. Neuroimmunol. 2009 210 40 51 10.1016/j.jneuroim.2009.02.017 19361871 36. Ding J. Cheng Y. Gao S. Chen J. Effects of Nerve Growth Factor and Noggin-Modified Bone Marrow Stromal Cells on Stroke in Rats J. Neurosci. Res. 2011 89 222 230 10.1002/jnr.22535 21162129 37. Riccio A. Ahn S. Davenport C.M. Blendy J.A. Ginty D.D. Mediation by a CREB Family Transcription Factor of NGF-Dependent Survival of Sympathetic Neurons Science 1999 286 2358 2361 10.1126/science.286.5448.2358 10600750 38. Harrington A.W. Ginty D.D. Long-Distance Retrograde Neurotrophic Factor Signalling in Neurons Nat. Rev. Neurosci. 2013 14 177 187 10.1038/nrn3253 23422909 39. Levi-Montalcini R. Aloe L. Mugnaini E. Oesch F. Thoenen H. Nerve Growth Factor Induces Volume Increase and Enhances Tyrosine Hydroxylase Synthesis in Chemically Axotomized Sympathetic Ganglia of Newborn Rats Proc. Natl. Acad. Sci. USA 1975 72 595 599 10.1073/pnas.72.2.595 235759 PMC432360 40. Yamaguchi S. Kuroda S. Kobayashi H. Shichinohe H. Yano S. Hida K. Shinpo K. Kikuchi S. Iwasaki Y. The Effects of Neuronal Induction on Gene Expression Profile in Bone Marrow Stromal Cells (BMSC)—A Preliminary Study Using Microarray Analysis Brain Res. 2006 1087 15 27 10.1016/j.brainres.2006.02.127 16626644 41. Fang C.N. Tan H.Q. Song A.B. Jiang N. Liu Q.R. Song T. NGF/TrkA Promotes the Vitality, Migration and Adhesion of Bone Marrow Stromal Cells in Hypoxia by Regulating the Nrf2 Pathway Metab. Brain Dis. 2022 37 2017 2026 10.1007/s11011-022-00974-x 35579787 42. Park J.H. Kang S.S. Kim J.Y. Tchah H. Nerve Growth Factor Attenuates Apoptosis and Inflammation in the Diabetic Cornea Investig. Ophthalmol. Vis. Sci. 2016 57 6767 6775 10.1167/iovs.16-19747 27978558 43. Li S. Guan H. Zhang Y. Li S. Li K. Hu S. Zuo E. Zhang C. Zhang X. Gong G. Bone Marrow Mesenchymal Stem Cells Promote Remyelination in Spinal Cord by Driving Oligodendrocyte Progenitor Cell Differentiation via TNFα/RelB-Hes1 Pathway: A Rat Model Study of 2,5-Hexanedione-Induced Neurotoxicity Stem Cell Res. Ther. 2021 12 436 10.1186/s13287-021-02518-z 34348774 PMC8336089 44. Kermani P. Rafii D. Jin D.K. Whitlock P. Schaffer W. Chiang A. Vincent L. Friedrich M. Shido K. Hackett N.R. Neurotrophins Promote Revascularization by Local Recruitment of TrkB+ Endothelial Cells and Systemic Mobilization of Hematopoietic Progenitors J. Clin. Investig. 2005 115 653 663 10.1172/JCI200522655 15765148 PMC1051987 45. Schipani E. Maes C. Carmeliet G. Semenza G.L. Regulation of Osteogenesis-Angiogenesis Coupling by HIFs and VEGF J. Bone Miner. Res. 2009 24 1347 1353 10.1359/jbmr.090602 19558314 PMC3276346 46. Yang Z. Cai X. Xu A. Xu F. Liang Q. Bone Marrow Stromal Cell Transplantation through Tail Vein Injection Promotes Angiogenesis and Vascular Endothelial Growth Factor Expression in Cerebral Infarct Area in Rats Cytotherapy 2015 17 1200 1212 10.1016/j.jcyt.2015.06.005 26276003 47. Zhou L. Lin Q. Wang P. Yao L. Leong K. Tan Z. Huang Z. Enhanced Neuroprotective Efficacy of Bone Marrow Mesenchymal Stem Cells Co-Overexpressing BDNF and VEGF in a Rat Model of Cardiac Arrest-Induced Global Cerebral Ischemia Cell Death Dis. 2017 8 e2774 10.1038/cddis.2017.184 28492549 PMC5520708 48. Zong X. Wu S. Li F. Lv L. Han D. Zhao N. Yan X. Hu S. Xu T. Transplantation of VEGF-Mediated Bone Marrow Mesenchymal Stem Cells Promotes Functional Improvement in a Rat Acute Cerebral Infarction Model Brain Res. 2017 1676 9 18 10.1016/j.brainres.2017.08.006 28823954 49. Chen B. Zhang F. Li Q.Y. Gong A. Lan Q. Protective Effect of Ad-VEGF-Bone Mesenchymal Stem Cells on Cerebral Infarction Turk. Neurosurg. 2016 26 8 15 10.5137/1019-5149.JTN.11488-14.3 26768863 50. Guo S. Zhen Y. Wang A. Transplantation of Bone Mesenchymal Stem Cells Promotes Angiogenesis and Improves Neurological Function after Traumatic Brain Injury in Mouse Neuropsychiatr. Dis. Treat. 2017 13 2757 2765 10.2147/NDT.S141534 29158675 PMC5683767 51. Zhang Y. Ma L. Su Y. Su L. Lan X. Wu D. Han S. Li J. Kvederis L. Corey S. Hypoxia Conditioning Enhances Neuroprotective Effects of Aged Human Bone Marrow Mesenchymal Stem Cell-Derived Conditioned Medium against Cerebral Ischemia in Vitro Brain Res. 2019 1725 146432 10.1016/j.brainres.2019.146432 31491422 52. Yuan X. Luo Q. Shen L. Chen J. Gan D. Sun Y. Ding L. Wang G. Hypoxic Preconditioning Enhances the Differentiation of Bone Marrow Stromal Cells into Mature Oligodendrocytes via the mTOR/HIF-1α/VEGF Pathway in Traumatic Brain Injury Brain Behav. 2020 10 e01675 10.1002/brb3.1675 32475084 PMC7375110 53. Sluijter J.P. Verhage V. Deddens J.C. van den Akker F. Doevendans P.A. Microvesicles and Exosomes for Intracardiac Communication Cardiovasc. Res. 2014 102 302 311 10.1093/cvr/cvu022 24488559 54. Kowal J. Tkach M. Théry C. Biogenesis and Secretion of Exosomes Curr. Opin. Cell Biol. 2014 29 116 125 10.1016/j.ceb.2014.05.004 24959705 55. Liu X. Wu C. Zhang Y. Chen S. Ding J. Chen Z. Wu K. Wu X. Zhou T. Zeng M. Hyaluronan-Based Hydrogel Integrating Exosomes for Traumatic Brain Injury Repair by Promoting Angiogenesis and Neurogenesis Carbohydr. Polym. 2023 306 120578 10.1016/j.carbpol.2023.120578 36746568 56. Li X. Bi T. Yang S. Exosomal Microrna-150-5p from Bone Marrow Mesenchymal Stromal Cells Mitigates Cerebral Ischemia/Reperfusion Injury via Targeting Toll-Like Receptor 5 Bioengineered 2022 13 3030 3043 10.1080/21655979.2021.2012402 34898357 PMC8973841 57. Zhang Y. Zhang Y. Chopp M. Pang H. Zhang Z.G. Mahmood A. Xiong Y. MiR-17-92 Cluster-Enriched Exosomes Derived from Human Bone Marrow Mesenchymal Stromal Cells Improve Tissue and Functional Recovery in Rats after Traumatic Brain Injury J. Neurotrauma 2021 38 1535 1550 10.1089/neu.2020.7575 33787364 PMC8126425 58. Mot Y.Y. Moses E.J. Mohd Yusoff N. Ling K.H. Yong Y.K. Tan J.J. Mesenchymal Stromal Cells-Derived Exosome and the Roles in the Treatment of Traumatic Brain Injury Cell. Mol. Neurobiol. 2023 43 469 489 10.1007/s10571-022-01201-y 35103872 PMC11415182 59. Wang H. Huber C.C. Li X.P. Mesenchymal and Neural Stem Cell-Derived Exosomes in Treating Alzheimer’s Disease Bioengineering 2023 10 253 10.3390/bioengineering10020253 36829747 PMC9952071 60. Yin T. Liu Y. Ji W. Zhuang J. Chen X. Gong B. Chu J. Liang W. Gao J. Yin Y. Engineered Mesenchymal Stem Cell-Derived Extracellular Vesicles: A State-of-the-Art Multifunctional Weapon against Alzheimer’s Disease Theranostics 2023 13 1264 1285 10.7150/thno.81860 36923533 PMC10008732 61. Reza-Zaldivar E.E. Hernández-Sapiéns M.A. Minjarez B. Gutiérrez-Mercado Y.K. Márquez-Aguirre A.L. Canales-Aguirre A.A. Potential Effects of MSC-Derived Exosomes in Neuroplasticity in Alzheimer’s Disease Front. Cell. Neurosci. 2018 12 317 10.3389/fncel.2018.00317 30319358 PMC6165870 62. Fallahi S. Zangbar H.S. Farajdokht F. Rahbarghazi R. Ghiasi F. Mohaddes G. Mesenchymal Stem Cell-Derived Exosomes Improve Neurogenesis and Cognitive Function of Mice with Methamphetamine Addiction: A Novel Treatment Approach CNS Neurosci. Ther. 2024 30 e14719 10.1111/cns.14719 38783536 PMC11116483 63. Oveili E. Vafaei S. Bazavar H. Eslami Y. Mamaghanizadeh E. Yasamineh S. Gholizadeh O. The Potential Use of Mesenchymal Stem Cells-Derived Exosomes as Micrornas Delivery Systems in Different Diseases Cell Commun. Signal. 2023 21 20 10.1186/s12964-022-01017-9 36690996 PMC9869323 64. Wang H. Sui H. Zheng Y. Jiang Y. Shi Y. Liang J. Zhao L. Curcumin-Primed Exosomes Potently Ameliorate Cognitive Function in AD Mice by Inhibiting Hyperphosphorylation of the Tau Protein through the AKT/GSK-3β Pathway Nanoscale 2019 11 7481 7496 10.1039/C9NR01255A 30942233 65. Hu L.T. Wang B.Y. Fan Y.H. He Z.Y. Zheng W.X. Exosomal miR-23b from Bone Marrow Mesenchymal Stem Cells Alleviates Oxidative Stress and Pyroptosis after Intracerebral Hemorrhage Neural Regen. Res. 2023 18 560 567 10.4103/1673-5374.346551 36018178 PMC9727431 66. Zhuang Z. Liu M. Luo J. Zhang X. Dai Z. Zhang B. Chen H. Xue J. He M. Xu H. Exosomes Derived from Bone Marrow Mesenchymal Stem Cells Attenuate Neurological Damage in Traumatic Brain Injury by Alleviating Glutamate-Mediated Excitotoxicity Exp. Neurol. 2022 357 114182 10.1016/j.expneurol.2022.114182 35901975 67. Duan S. Wang F. Cao J. Wang C. Exosomes Derived from Microrna-146a-5p-Enriched Bone Marrow Mesenchymal Stem Cells Alleviate Intracerebral Hemorrhage by Inhibiting Neuronal Apoptosis and Microglial M1 Polarization Drug Des. Dev. Ther. 2020 14 3143 3158 10.2147/DDDT.S255828 PMC7425091 32821084 68. Li X.T. Zhao J. Xu D.S. Zhang Y. Zhou S.T. Bone Marrow Mesenchymal Stem Cell Exosomes Promote Brain Microvascular Endothelial Cell Proliferation and Migration in Rats J. Sichuan Univ. (Med. Sci.) 2020 51 599 604 10.12182/20200960207 32975071 69. Xiong L. Sun L. Zhang Y. Peng J. Yan J. Liu X. Exosomes from Bone Marrow Mesenchymal Stem Cells Can Alleviate Early Brain Injury after Subarachnoid Hemorrhage through miRNA129-5p-HMGB1 Pathway Stem Cells Dev. 2020 29 212 221 10.1089/scd.2019.0206 31801411 70. Han M. Cao Y. Guo X. Chu X. Li T. Xue H. Xin D. Yuan L. Ke H. Li G. Mesenchymal Stem Cell-Derived Extracellular Vesicles Promote Microglial M2 Polarization after Subarachnoid Hemorrhage in Rats and Involve the AMPK/NF-κB Signaling Pathway Biomed. Pharmacother. 2021 133 111048 10.1016/j.biopha.2020.111048 33378955 71. Li Y. Li Z. Gu J. Xu X. Chen H. Gui Y. Exosomes Isolated During Dopaminergic Neuron Differentiation Suppressed Neuronal Inflammation in a Rodent Model of Parkinson’s Disease Neurosci. Lett. 2022 771 136414 10.1016/j.neulet.2021.136414 34954117 72. Liu S. Fan M. Xu J.X. Yang L.J. Qi C.C. Xia Q.R. Ge J.F. Exosomes Derived from Bone-Marrow Mesenchymal Stem Cells Alleviate Cognitive Decline in AD-Like Mice by Improving BDNF-Related Neuropathology J. Neuroinflamm. 2022 19 35 10.1186/s12974-022-02393-2 PMC8822863 35130907 73. El-Derany M.O. Noureldein M.H. Bone Marrow Mesenchymal Stem Cells and Their Derived Exosomes Resolve Doxorubicin-Induced Chemobrain: Critical Role of Their Mirna Cargo Stem Cell Res. Ther. 2021 12 322 10.1186/s13287-021-02384-9 34090498 PMC8180158 74. Liu C. Yang T.H. Li H.D. Li G.Z. Liang J. Wang P. Exosomes from Bone Marrow Mesenchymal Stem Cells Are a Potential Treatment for Ischemic Stroke Neural Regen. Res. 2023 18 2246 2251 10.4103/1673-5374.369114 37056144 PMC10328279 75. Wen L. Wang Y.D. Shen D.F. Zheng P.D. Tu M.D. You W.D. Zhu Y.R. Wang H. Feng J.F. Yang X.F. Exosomes Derived from Bone Marrow Mesenchymal Stem Cells Inhibit Neuroinflammation after Traumatic Brain Injury Neural Regen. Res. 2022 17 2717 2724 10.4103/1673-5374.339489 35662219 PMC9165364 76. Yang H. Chen J. Bone Marrow Mesenchymal Stem Cell-Derived Exosomes Carrying Long Noncoding RNA ZFAS1 Alleviate Oxidative Stress and Inflammation in Ischemic Stroke by Inhibiting Microrna-15a-5p Metab. Brain Dis. 2022 37 2545 2557 10.1007/s11011-022-00997-4 35907132 77. Zhao F. Guo L. Wang X. Zhang Y. Correlation of Oxidative Stress-Related Biomarkers with Postmenopausal Osteoporosis: A Systematic Review and Meta-Analysis Arch. Osteoporos. 2021 16 4 10.1007/s11657-020-00854-w 33400044 78. Shu J. Jiang L. Wang M. Wang R. Wang X. Gao C. Xia Z. Human Bone Marrow Mesenchymal Stem Cells-Derived Exosomes Protect against Nerve Injury via Regulating Immune Microenvironment in Neonatal Hypoxic-Ischemic Brain Damage Model Immunobiology 2022 227 152178 10.1016/j.imbio.2022.152178 35259691 79. Deng Y. Chen D. Gao F. Lv H. Zhang G. Sun X. Liu L. Mo D. Ma N. Song L. Correction to: Exosomes Derived from Microrna-138-5poverexpressing Bone Marrow-Derived Mesenchymal Stem Cells Confer Neuroprotection to Astrocytes Following Ischemic Stroke via Inhibition of LCN2 J. Biol. Eng. 2022 16 8 10.1186/s13036-022-00285-w 35361244 PMC8973641 80. Nakano M. Kubota K. Kobayashi E. Chikenji T.S. Saito Y. Konari N. Fujimiya M. Bone Marrow-Derived Mesenchymal Stem Cells Improve Cognitive Impairment in an Alzheimer’s Disease Model by Increasing the Expression of Microrna-146a in Hippocampus Sci. Rep. 2020 10 10772 10.1038/s41598-020-67460-1 32612165 PMC7330036 81. Xiao Y. Geng F. Wang G. Li X. Zhu J. Zhu W. Bone Marrow-Derived Mesenchymal Stem Cells-Derived Exosomes Prevent Oligodendrocyte Apoptosis through Exosomal Mir-134 by Targeting Caspase-8 J. Cell. Biochem. 2019 120 2109 2118 10.1002/jcb.27519 30191592 82. Min W. Wu Y. Fang Y. Hong B. Dai D. Zhou Y. Liu J. Li Q. Bone Marrow Mesenchymal Stem Cells-Derived Exosomal microRNA-124-3p Attenuates Hypoxic-Ischemic Brain Damage through Depressing Tumor Necrosis Factor Receptor Associated Factor 6 in Newborn Rats Bioengineered 2022 13 3194 3206 10.1080/21655979.2021.2016094 35067167 PMC8973938 83. Wang J. Bonacquisti E.E. Brown A.D. Nguyen J. Boosting the Biogenesis and Secretion of Mesenchymal Stem Cell-Derived Exosomes Cells 2020 9 660 10.3390/cells9030660 32182815 PMC7140620 84. Xiong W.P. Yao W.Q. Wang B. Liu K. BMSCs-Exosomes Containing GDF-15 Alleviated SH-SY5Y Cell Injury Model of Alzheimer’s Disease via AKT/GSK-3β/β-Catenin Brain Res. Bull. 2021 177 92 102 10.1016/j.brainresbull.2021.09.008 34536520 85. Sun F. Zhang Y. Wu X. Xu X. Zhu C. Huang W. Breviscapine Combined with BMSCs Reduces Aβ Deposition in Rat with Alzheimer’s Disease by Regulating Circular RNA ciRS-7 Curr. Mol. Med. 2023 23 76 86 10.2174/1566524022666220113151044 35048805 86. Yu J. Yan Y. Gu Q. Kumar G. Yu H. Zhao Y. Liu C. Gao Y. Chai Z. Chumber J. Fasudil in Combination with Bone Marrow Stromal Cells (BMSCs) Attenuates Alzheimer’s Disease-Related Changes through the Regulation of the Peripheral Immune System Front. Aging Neurosci. 2018 10 216 10.3389/fnagi.2018.00216 30061826 PMC6054996 87. Lee W.C. Guntur A.R. Long F. Rosen C.J. Energy Metabolism of the Osteoblast: Implications for Osteoporosis Endocr. Rev. 2017 38 255 266 10.1210/er.2017-00064 28472361 PMC5460680 88. Mera P. Laue K. Ferron M. Confavreux C. Wei J. Galán-Díez M. Lacampagne A. Mitchell S.J. Mattison J.A. Chen Y. Osteocalcin Signaling in Myofibers Is Necessary and Sufficient for Optimum Adaptation to Exercise Cell Metab. 2017 25 218 10.1016/j.cmet.2016.12.003 28076763 89. Jin F. Liu M. Zhang D. Wang X. Translational Perspective on Bone-Derived Cytokines in Inter-Organ Communications Innovation 2023 4 100365 10.1016/j.xinn.2022.100365 36624884 PMC9823204 90. Lombardi G. Perego S. Luzi L. Banfi G. A Four-Season Molecule: Osteocalcin. Updates in Its Physiological Roles Endocrine 2015 48 394 404 10.1007/s12020-014-0401-0 25158976 91. Oury F. Khrimian L. Denny C.A. Gardin A. Chamouni A. Goeden N. Huang Y.Y. Lee H. Srinivas P. Gao X.B. Maternal and Offspring Pools of Osteocalcin Influence Brain Development and Functions Cell 2013 155 228 241 10.1016/j.cell.2013.08.042 24074871 PMC3864001 92. Shan C. Ghosh A. Guo X.Z. Wang S.M. Hou Y.F. Li S.T. Liu J.M. Roles for Osteocalcin in Brain Signalling: Implications in Cognition- and Motor-Related Disorders Mol. Brain 2019 12 23 10.1186/s13041-019-0444-5 30909971 PMC6434857 93. Kosmidis S. Polyzos A. Harvey L. Youssef M. Denny C.A. Dranovsky A. Kandel E.R. RbAp48 Protein Is a Critical Component of GPR158/OCN Signaling and Ameliorates Age-Related Memory Loss Cell Rep. 2018 25 959 973.e6 10.1016/j.celrep.2018.09.077 30355501 PMC7725275 94. Ducy P. Desbois C. Boyce B. Pinero G. Story B. Dunstan C. Smith E. Bonadio J. Goldstein S. Gundberg C. Increased Bone Formation in Osteocalcin-Deficient Mice Nature 1996 382 448 452 10.1038/382448a0 8684484 95. Obri A. Khrimian L. Karsenty G. Oury F. Osteocalcin in the Brain: From Embryonic Development to Age-Related Decline in Cognition Nat. Rev. Endocrinol. 2018 14 174 182 10.1038/nrendo.2017.181 29376523 PMC5958904 96. Khrimian L. Obri A. Ramos-Brossier M. Rousseaud A. Moriceau S. Nicot A.S. Mera P. Kosmidis S. Karnavas T. Saudou F. Gpr158 Mediates Osteocalcin’s Regulation of Cognition J. Exp. Med. 2017 214 2859 2873 10.1084/jem.20171320 28851741 PMC5626410 97. Bu X.L. Liu Z.T. Xin J.Y. Huang M. Bai Y.D. Zhou J. Bao Y.Y. Li J.H. Liu Z.H. Zeng G.H. Associations of Plasma and CSF Osteocalcin Levels with CSF ATN Biomarkers and Cognitive Functions in Alzheimer’s Disease MedComm 2025 6 e70255 10.1002/mco2.70255 40547941 PMC12179405 98. Kjeldsen L. Bainton D.F. Sengeløv H. Borregaard N. Identification of Neutrophil Gelatinase-Associated Lipocalin as a Novel Matrix Protein of Specific Granules in Human Neutrophils Blood 1994 83 799 807 10.1182/blood.V83.3.799.799 8298140 99. Goetz D.H. Holmes M.A. Borregaard N. Bluhm M.E. Raymond K.N. Strong R.K. The Neutrophil Lipocalin NGAL Is a Bacteriostatic Agent that Interferes with Siderophore-Mediated Iron Acquisition Mol. Cell 2002 10 1033 1043 10.1016/S1097-2765(02)00708-6 12453412 100. Ferreira A.C. Dá Mesquita S. Sousa J.C. Correia-Neves M. Sousa N. Palha J.A. Marques F. From the Periphery to the Brain: Lipocalin-2, a Friend or Foe? Prog. Neurobiol. 2015 131 120 136 10.1016/j.pneurobio.2015.06.005 26159707 101. Mosialou I. Shikhel S. Liu J.M. Maurizi A. Luo N. He Z. Huang Y. Zong H. Friedman R.A. Barasch J. MC4R-Dependent Suppression of Appetite by Bone-Derived Lipocalin 2 Nature 2017 543 385 390 10.1038/nature21697 28273060 PMC5975642 102. Petropoulou P.I. Mosialou I. Shikhel S. Hao L. Panitsas K. Bisikirska B. Luo N. Bahna F. Kim J. Carberry P. Lipocalin-2 Is an Anorexigenic Signal in Primates eLife 2020 9 e58949 10.7554/eLife.58949 33231171 PMC7685704 103. Kim J.H. Ko P.W. Lee H.W. Jeong J.Y. Lee M.G. Kim J.H. Lee W.H. Yu R. Oh W.J. Suk K. Astrocyte-Derived Lipocalin-2 Mediates Hippocampal Damage and Cognitive Deficits in Experimental Models of Vascular Dementia Glia 2017 65 1471 1490 10.1002/glia.23174 28581123 104. Wang G. Weng Y.C. Chiang I.C. Huang Y.T. Liao Y.C. Chen Y.C. Kao C.Y. Liu Y.L. Lee T.H. Chou W.H. Neutralization of Lipocalin-2 Diminishes Stroke-Reperfusion Injury Int. J. Mol. Sci. 2020 21 6253 10.3390/ijms21176253 32872405 PMC7503651 105. Shin H.J. Jeong E.A. Lee J.Y. An H.S. Jang H.M. Ahn Y.J. Lee J. Kim K.E. Roh G.S. Lipocalin-2 Deficiency Reduces Oxidative Stress and Neuroinflammation and Results in Attenuation of Kainic Acid-Induced Hippocampal Cell Death Antioxidants 2021 10 100 10.3390/antiox10010100 33445746 PMC7828212 106. Wang M. Norman J.E. Srinivasan V.J. Rutledge J.C. Metabolic, Inflammatory, and Microvascular Determinants of White Matter Disease and Cognitive Decline Am. J. Neurodegener. Dis. 2016 5 171 177 28078193 PMC5218857 107. Hametner S. Wimmer I. Haider L. Pfeifenbring S. Brück W. Lassmann H. Iron and Neurodegeneration in the Multiple Sclerosis Brain Ann. Neurol. 2013 74 848 861 10.1002/ana.23974 23868451 PMC4223935 108. Zhang X. Haaf M. Todorich B. Grosstephan E. Schieremberg H. Surguladze N. Connor J.R. Cytokine Toxicity to Oligodendrocyte Precursors Is Mediated by Iron Glia 2005 52 199 208 10.1002/glia.20235 15968631 109. Haider L. Simeonidou C. Steinberger G. Hametner S. Grigoriadis N. Deretzi G. Kovacs G.G. Kutzelnigg A. Lassmann H. Frischer J.M. Multiple Sclerosis Deep Grey Matter: The Relation between Demyelination, Neurodegeneration, Inflammation and Iron J. Neurol. Neurosurg. Psychiatry 2014 85 1386 1395 10.1136/jnnp-2014-307712 24899728 PMC4251183 110. Egashira Y. Hua Y. Keep R.F. Xi G. Acute White Matter Injury after Experimental Subarachnoid Hemorrhage: Potential Role of Lipocalin 2 Stroke 2014 45 2141 2143 10.1161/STROKEAHA.114.005307 24893611 PMC4074774 111. Al Nimer F. Elliott C. Bergman J. Khademi M. Dring A.M. Aeinehband S. Bergenheim T. Romme Christensen J. Sellebjerg F. Svenningsson A. Lipocalin-2 Is Increased in Progressive Multiple Sclerosis and Inhibits Remyelination Neuroimmunol. Neuroinflamm. 2016 3 e191 10.1212/NXI.0000000000000191 26770997 PMC4708925 112. Ferreira A.C. Santos T. Sampaio-Marques B. Novais A. Mesquita S.D. Ludovico P. Bernardino L. Correia-Neves M. Sousa N. Palha J.A. Lipocalin-2 Regulates Adult Neurogenesis and Contextual Discriminative Behaviours Mol. Psychiatry 2018 23 1031 1039 10.1038/mp.2017.95 28485407 113. Noh K. Lee H. Choi T.Y. Joo Y. Kim S.J. Kim H. Kim J.Y. Jahng J.W. Lee S. Choi S.Y. Negr1 Controls Adult Hippocampal Neurogenesis and Affective Behaviors Mol. Psychiatry 2019 24 1189 1205 10.1038/s41380-018-0347-3 30651602 114. Xing C. Wang X. Cheng C. Montaner J. Mandeville E. Leung W. van Leyen K. Lok J. Wang X. Lo E.H. Neuronal Production of Lipocalin-2 as a Help-Me Signal for Glial Activation Stroke 2014 45 2085 2092 10.1161/STROKEAHA.114.005733 24916903 PMC4122238 115. Berard J.L. Zarruk J.G. Arbour N. Prat A. Yong V.W. Jacques F.H. Akira S. David S. Lipocalin 2 Is a Novel Immune Mediator of Experimental Autoimmune Encephalomyelitis Pathogenesis and Is Modulated in Multiple Sclerosis Glia 2012 60 1145 1159 10.1002/glia.22342 22499213 116. Lee S. Lee W.H. Lee M.S. Mori K. Suk K. Regulation by lipocalin-2 of Neuronal Cell Death, Migration, and Morphology J. Neurosci. Res. 2012 90 540 550 10.1002/jnr.22779 22038922 117. Lee S. Park J.Y. Lee W.H. Kim H. Park H.C. Mori K. Suk K. Lipocalin-2 Is an Autocrine Mediator of Reactive Astrocytosis J. Neurosci. 2009 29 234 249 10.1523/JNEUROSCI.5273-08.2009 19129400 PMC6664907 118. Han Y. You X. Xing W. Zhang Z. Zou W. Paracrine and Endocrine Actions of Bone-the Functions of Secretory Proteins from Osteoblasts, Osteocytes, and Osteoclasts Bone Res. 2018 6 16 10.1038/s41413-018-0019-6 29844945 PMC5967329 119. Mike E.V. Makinde H.M. Gulinello M. Vanarsa K. Herlitz L. Gadhvi G. Winter D.R. Mohan C. Hanly J.G. Mok C.C. Lipocalin-2 Is a Pathogenic Determinant and Biomarker of Neuropsychiatric Lupus J. Autoimmun. 2019 96 59 73 10.1016/j.jaut.2018.08.005 30174216 PMC6310639 120. Dekens D.W. Naudé P.J. Engelborghs S. Vermeiren Y. Van Dam D. Oude Voshaar R.C. Eisel U.L. De Deyn P.P. Neutrophil Gelatinase-Associated Lipocalin and Its Receptors in Alzheimer’s Disease (AD) Brain Regions: Differential Findings in AD with and without Depression J. Alzheimer’s Dis. 2017 55 763 776 10.3233/JAD-160330 27716662 PMC5147520 121. Mucha M. Skrzypiec A.E. Schiavon E. Attwood B.K. Kucerova E. Pawlak R. Lipocalin-2 Controls Neuronal Excitability and Anxiety by Regulating Dendritic Spine Formation and Maturation Proc. Natl. Acad. Sci. USA 2011 108 18436 18441 10.1073/pnas.1107936108 21969573 PMC3215032 122. Ferreira A.C. Novais A. Sousa N. Sousa J.C. Marques F. Voluntary Running Rescues the Defective Hippocampal Neurogenesis and Behaviour Observed in Lipocalin 2-Null Mice Sci. Rep. 2019 9 1649 10.1038/s41598-018-38140-y 30733506 PMC6367505 123. Ferreira A.C. Pinto V. Dá Mesquita S. Novais A. Sousa J.C. Correia-Neves M. Sousa N. Palha J.A. Marques F. Lipocalin-2 Is Involved in Emotional Behaviors and Cognitive Function Front. Cell. Neurosci. 2013 7 122 10.3389/fncel.2013.00122 23908604 PMC3725407 124. Dekens D.W. Naudé P.J.W. Keijser J.N. Boerema A.S. De Deyn P.P. Eisel U.L.M. Lipocalin 2 Contributes to Brain Iron Dysregulation but Does Not Affect Cognition, Plaque Load, and Glial Activation in the J20 Alzheimer Mouse Model J. Neuroinflamm. 2018 15 330 10.1186/s12974-018-1372-5 PMC6267886 30501637 125. Choi J. Lee H.W. Suk K. Increased Plasma Levels of Lipocalin 2 in Mild Cognitive Impairment J. Neurol. Sci. 2011 305 28 33 10.1016/j.jns.2011.03.023 21463871 126. Naudé P.J. Eisel U.L. Comijs H.C. Groenewold N.A. De Deyn P.P. Bosker F.J. Luiten P.G. den Boer J.A. Oude Voshaar R.C. Neutrophil Gelatinase-Associated Lipocalin: A Novel Inflammatory Marker Associated with Late-Life Depression J. Psychosom. Res. 2013 75 444 450 10.1016/j.jpsychores.2013.08.023 24182633 127. Marques F. Mesquita S.D. Sousa J.C. Coppola G. Gao F. Geschwind D.H. Columba-Cabezas S. Aloisi F. Degn M. Cerqueira J.J. Lipocalin 2 Is Present in the EAE Brain and Is Modulated by Natalizumab Front. Cell. Neurosci. 2012 6 33 10.3389/fncel.2012.00033 22907989 PMC3414908 128. Dekens D.W. Eisel U.L.M. Gouweleeuw L. Schoemaker R.G. De Deyn P.P. Naudé P.J.W. Lipocalin 2 as a Link between Ageing, Risk Factor Conditions and Age-Related Brain Diseases Ageing Res. Rev. 2021 70 101414 10.1016/j.arr.2021.101414 34325073 129. Naudé P.J. Nyakas C. Eiden L.E. Ait-Ali D. van der Heide R. Engelborghs S. Luiten P.G. De Deyn P.P. den Boer J.A. Eisel U.L. Lipocalin 2: Novel Component of Proinflammatory Signaling in Alzheimer’s Disease FASEB J. 2012 26 2811 2823 10.1096/fj.11-202457 22441986 PMC3382095 130. Devireddy L.R. Gazin C. Zhu X. Green M.R. A Cell-Surface Receptor for Lipocalin 24p3 Selectively Mediates Apoptosis and Iron Uptake Cell 2005 123 1293 1305 10.1016/j.cell.2005.10.027 16377569 131. Belaidi A.A. Bush A.I. Iron Neurochemistry in Alzheimer’s Disease and Parkinson’s Disease: Targets for Therapeutics J. Neurochem. 2016 139 179 197 10.1111/jnc.13425 26545340 132. Ni W. Zheng M. Xi G. Keep R.F. Hua Y. Role of Lipocalin-2 in Brain Injury after Intracerebral Hemorrhage J. Cereb. Blood Flow Metab. 2015 35 1454 1461 10.1038/jcbfm.2015.52 25853903 PMC4640334 133. Xu G. Ahn J. Chang S. Eguchi M. Ogier A. Han S. Park Y. Shim C. Jang Y. Yang B. Lipocalin-2 Induces Cardiomyocyte Apoptosis by Increasing Intracellular Iron Accumulation J. Biol. Chem. 2012 287 4808 4817 10.1074/jbc.M111.275719 22117066 PMC3281654 134. Nairz M. Schroll A. Haschka D. Dichtl S. Sonnweber T. Theurl I. Theurl M. Lindner E. Demetz E. Aßhoff M. Lipocalin-2 Ensures Host Defense against Salmonella Typhimurium by Controlling Macrophage Iron Homeostasis and Immune Response Eur. J. Immunol. 2015 45 3073 3086 10.1002/eji.201545569 26332507 PMC4688458 135. Hochmeister S. Engel O. Adzemovic M.Z. Pekar T. Kendlbacher P. Zeitelhofer M. Haindl M. Meisel A. Fazekas F. Seifert-Held T. Lipocalin-2 as an Infection-Related Biomarker to Predict Clinical Outcome in Ischemic Stroke PLoS ONE 2016 11 e0154797 10.1371/journal.pone.0154797 27152948 PMC4859492 136. Khalil M. Renner A. Langkammer C. Enzinger C. Ropele S. Stojakovic T. Scharnagl H. Bachmaier G. Pichler A. Archelos J.J. Cerebrospinal Fluid Lipocalin 2 in Patients with Clinically Isolated Syndromes and Early Multiple Sclerosis Mult. Scler. 2016 22 1560 1568 10.1177/1352458515624560 26762671 137. Kim B.W. Jeong K.H. Kim J.H. Jin M. Kim J.H. Lee M.G. Choi D.K. Won S.Y. McLean C. Jeon M.T. Pathogenic Upregulation of Glial Lipocalin-2 in the Parkinsonian Dopaminergic System J. Neurosci. 2016 36 5608 5622 10.1523/JNEUROSCI.4261-15.2016 27194339 PMC6601774 138. Shan C. Zhang D. Ma D.N. Hou Y.F. Zhuang Q.Q. Gong Y.L. Sun L.H. Zhao H.Y. Tao B. Yang Y.Y. Osteocalcin Ameliorates Cognitive Dysfunctions in a Mouse Model of Alzheimer’s Disease by Reducing Amyloid β Burden and Upregulating Glycolysis in Neuroglia Cell Death Discov. 2023 9 46 10.1038/s41420-023-01343-y 36746932 PMC9902399 139. Wu B.W. Guo J.D. Wu M.S. Liu Y. Lu M. Zhou Y.H. Han H.W. Osteoblast-Derived Lipocalin-2 Regulated by Mirna-96-5p/Foxo1 Advances the Progression of Alzheimer’s Disease Epigenomics 2020 12 1501 1513 10.2217/epi-2019-0215 32901506 140. Goldring S.R. The Osteocyte: Key Player in Regulating Bone Turnover RMD Open 2015 1 e000049 10.1136/rmdopen-2015-000049 26557372 PMC4632148 141. Robling A.G. Bonewald L.F. The Osteocyte: New Insights Annu. Rev. Physiol. 2020 82 485 506 10.1146/annurev-physiol-021119-034332 32040934 PMC8274561 142. Ikeda T. Kasai M. Utsuyama M. Hirokawa K. Determination of Three Isoforms of the Receptor Activator of Nuclear Factor-Kappab Ligand and Their Differential Expression in Bone and Thymus Endocrinology 2001 142 1419 1426 10.1210/endo.142.4.8070 11250921 143. Teitelbaum S.L. Bone Resorption by Osteoclasts Science 2000 289 1504 1508 10.1126/science.289.5484.1504 10968780 144. Elango J. Bao B. Wu W. The Hidden Secrets of Soluble RANKL in Bone Biology Cytokine 2021 144 155559 10.1016/j.cyto.2021.155559 33994070 145. Kaneko K. Kawai S. Glucocorticoid and Bone. Significance of Serum Soluble RANKL Measurement in Patients under Glucocorticoid Therapy Clin. Calcium 2014 24 1361 1370 25177009 146. Ma T. Miyanishi K. Suen A. Epstein N.J. Tomita T. Smith R.L. Goodman S.B. Human Interleukin-1-Induced Murine Osteoclastogenesis Is Dependent on RANKL, but Independent of TNF-Alpha Cytokine 2004 26 138 144 10.1016/j.cyto.2004.02.001 15135808 147. Schlöndorff J. Lum L. Blobel C.P. Biochemical and Pharmacological Criteria Define Two Shedding Activities for TRANCE/OPGL that Are Distinct from the Tumor Necrosis Factor Alpha Convertase J. Biol. Chem. 2001 276 14665 14674 10.1074/jbc.M010741200 11278735 148. Yasuda H. Bone and Bone Related Biochemical Examinations. Bone and Collagen Related Metabolites. Receptor Activator of NF-Kappab Ligand (RANKL) Clin. Calcium 2006 16 964 970 16751692 149. Zhu P. Zhang Z. Huang X. Liang S. Khandekar N. Song Z. Lin S. RANKL Reduces Body Weight and Food Intake via the Modulation of Hypothalamic NPY/CART Expression Int. J. Med. Sci. 2018 15 969 977 10.7150/ijms.24373 30013437 PMC6036154 150. Enomoto T. Furuya Y. Tomimori Y. Mori K. Miyazaki J. Yasuda H. Establishment of a New Murine Model of Hypercalcemia with Anorexia by Overexpression of Soluble Receptor Activator of NF-κB Ligand Using an Adenovirus Vector J. Bone Miner. Metab. 2011 29 414 421 10.1007/s00774-010-0235-7 21063739 151. Ostrowska Z. Ziora K. Oświęcimska J. Swiętochowska E. Wołkowska-Pokrywa K. Dehydroepiandrosterone Sulfate, Osteoprotegerin and Its Soluble Ligand sRANKL and Bone Metabolism in Girls with Anorexia Nervosa Postep. Hig. Med. Dosw. 2012 66 655 662 10.5604/17322693.1009971 23001207 152. Ostrowska Z. Ziora K. Oświęcimska J. Swiętochowska E. Szapska B. Wołkowska-Pokrywa K. Dyduch A. RANKL/RANK/OPG System and Bone Status in Females with Anorexia Nervosa Bone 2012 50 156 160 10.1016/j.bone.2011.09.054 22001124 153. Wada T. Nakashima T. Hiroshi N. Penninger J.M. RANKL-RANK Signaling in Osteoclastogenesis and Bone Disease Trends Mol. Med. 2006 12 17 25 10.1016/j.molmed.2005.11.007 16356770 154. Hanada R. Leibbrandt A. Hanada T. Kitaoka S. Furuyashiki T. Fujihara H. Trichereau J. Paolino M. Qadri F. Plehm R. Central Control of Fever and Female Body Temperature by RANKL/RANK Nature 2009 462 505 509 10.1038/nature08596 19940926 155. Hanada R. Hanada T. Sigl V. Schramek D. Penninger J.M. RANKL/RANK-Beyond Bones J. Mol. Med. 2011 89 647 656 10.1007/s00109-011-0749-z 21445556 156. Kichev A. Eede P. Gressens P. Thornton C. Hagberg H. Implicating Receptor Activator of NF-κB (RANK)/RANK Ligand Signalling in Microglial Responses to Toll-Like Receptor Stimuli Dev. Neurosci. 2017 39 192 206 10.1159/000464244 28402971 PMC5569710 157. Zhao Z.M. Lu S.H. Zhang Q.J. Liu H.Y. Yang R.C. Cai Y.L. Han Z.C. The Preliminary Study on in Vitro Differentiation of Human Umbilical Cord Blood Cells into Neural Cells Chin. J. Hematol. 2003 24 484 487 14575594 158. Gutierrez H. Kisiswa L. O’Keeffe G.W. Smithen M.J. Wyatt S. Davies A.M. Regulation of Neurite Growth by Tumour Necrosis Superfamily Member RANKL Open Biol. 2013 3 120150 10.1098/rsob.120150 23303310 PMC3603457 159. Simonet W.S. Lacey D.L. Dunstan C.R. Kelley M. Chang M.S. Lüthy R. Nguyen H.Q. Wooden S. Bennett L. Boone T. Osteoprotegerin: A Novel Secreted Protein Involved in the Regulation of Bone Density Cell 1997 89 309 319 10.1016/S0092-8674(00)80209-3 9108485 160. Glasnović A. O’Mara N. Kovačić N. Grčević D. Gajović S. RANK/RANKL/OPG Signaling in the Brain: A Systematic Review of the Literature Front. Neurol. 2020 11 590480 10.3389/fneur.2020.590480 33329338 PMC7710989 161. Walsh M.C. Choi Y. Biology of the RANKL-RANK-OPG System in Immunity, Bone, and Beyond Front. Immunol. 2014 5 511 10.3389/fimmu.2014.00511 25368616 PMC4202272 162. Shimamura M. Nakagami H. Osako M.K. Kurinami H. Koriyama H. Zhengda P. Tomioka H. Tenma A. Wakayama K. Morishita R. OPG/RANKL/RANK Axis Is a Critical Inflammatory Signaling System in Ischemic Brain in Mice Proc. Natl. Acad. Sci. USA 2014 111 8191 8196 10.1073/pnas.1400544111 24847069 PMC4050556 163. Sakai S. Shichita T. Inflammation and Neural Repair after Ischemic Brain Injury Neurochem. Int. 2019 130 104316 10.1016/j.neuint.2018.10.013 30342960 164. Guo X. Shi W. Lu J. Tang P. Li R. Unraveling the Impact of Blood RANKL and OPG Levels on Alzheimer’s Disease: Independent of Bone Mineral Density and Inflammation Alzheimer’s Dement. 2025 11 e70044 10.1002/trc2.70044 PMC11746068 39839077 165. Haffner D. Leifheit-Nestler M. Extrarenal Effects of FGF23 Pediatr. Nephrol. 2017 32 753 765 10.1007/s00467-016-3505-3 27704252 166. Liu S. Zhou J. Tang W. Jiang X. Rowe D.W. Quarles L.D. Pathogenic Role of Fgf23 in Hyp Mice Am. J. Physiol. Endocrinol. Metab. 2006 291 E38 E49 10.1152/ajpendo.00008.2006 16449303 167. Drew D.A. Tighiouart H. Scott T.M. Lou K.V. Fan L. Shaffi K. Weiner D.E. Sarnak M.J. FGF-23 and Cognitive Performance in Hemodialysis Patients Hemodial. Int. 2014 18 78 86 10.1111/hdi.12100 24164913 PMC4443906 168. Ursem S.R. Diepenbroek C. Bacic V. Unmehopa U.A. Eggels L. Maya-Monteiro C.M. Heijboer A.C. la Fleur S.E. Localization of Fibroblast Growth Factor 23 Protein in the Rat Hypothalamus Eur. J. Neurosci. 2021 54 5261 5271 10.1111/ejn.15375 34184338 PMC8456796 169. McGrath E.R. Himali J.J. Levy D. Conner S.C. Pase M.P. Abraham C.R. Courchesne P. Satizabal C.L. Vasan R.S. Beiser A.S. Circulating Fibroblast Growth Factor 23 Levels and Incident Dementia: The Framingham Heart Study PLoS ONE 2019 14 e0213321 10.1371/journal.pone.0213321 30830941 PMC6398923 170. Wright C.B. Shah N.H. Mendez A.J. DeRosa J.T. Yoshita M. Elkind M.S. Sacco R.L. DeCarli C. Rundek T. Silverberg S. Fibroblast Growth Factor 23 Is Associated with Subclinical Cerebrovascular Damage: The Northern Manhattan Study Stroke 2016 47 923 928 10.1161/STROKEAHA.115.012379 26956260 PMC4811730 171. Marebwa B.K. Adams R.J. Magwood G.S. Kindy M. Wilmskoetter J. Wolf M. Bonilha L. Fibroblast Growth Factor23 Is Associated with Axonal Integrity and Neural Network Architecture in the Human Frontal Lobes PLoS ONE 2018 13 e0203460 10.1371/journal.pone.0203460 30192823 PMC6128563 172. Hensel N. Schön A. Konen T. Lübben V. Förthmann B. Baron O. Grothe C. Leifheit-Nestler M. Claus P. Haffner D. Fibroblast Growth Factor 23 Signaling in Hippocampal Cells: Impact on Neuronal Morphology and Synaptic Density J. Neurochem. 2016 137 756 769 10.1111/jnc.13585 26896818 173. Rossaint J. Oehmichen J. Van Aken H. Reuter S. Pavenstädt H.J. Meersch M. Unruh M. Zarbock A. FGF23 Signaling Impairs Neutrophil Recruitment and Host Defense During CKD J. Clin. Investig. 2016 126 962 974 10.1172/JCI83470 26878171 PMC4767336 174. Laszczyk A.M. Nettles D. Pollock T.A. Fox S. Garcia M.L. Wang J. Quarles L.D. King G.D. FGF-23 Deficiency Impairs Hippocampal-Dependent Cognitive Function eNeuro 2019 6 10.1523/ENEURO.0469-18.2019 PMC6430630 30911673 175. Kuro O.M. The FGF23 and Klotho System Beyond Mineral Metabolism Clin. Exp. Nephrol. 2017 21 64 69 10.1007/s10157-016-1357-6 27838783 176. Kalluri R. LeBleu V.S. The Biology, Function, and Biomedical Applications of Exosomes Science 2020 367 eaau6977 10.1126/science.aau6977 32029601 PMC7717626 177. Wortzel I. Dror S. Kenific C.M. Lyden D. Exosome-Mediated Metastasis: Communication from a Distance Dev. Cell 2019 49 347 360 10.1016/j.devcel.2019.04.011 31063754 178. Kita S. Maeda N. Shimomura I. Interorgan Communication by Exosomes, Adipose Tissue, and Adiponectin in Metabolic Syndrome J. Clin. Investig. 2019 129 4041 4049 10.1172/JCI129193 31483293 PMC6763291 179. Colombo M. Raposo G. Théry C. Biogenesis, Secretion, and Intercellular Interactions of Exosomes and Other Extracellular Vesicles Annu. Rev. Cell Dev. Biol. 2014 30 255 289 10.1146/annurev-cellbio-101512-122326 25288114 180. Jiang Y.L. Wang Z.X. Liu X.X. Wan M.D. Liu Y.W. Jiao B. Liao X.X. Luo Z.W. Wang Y.Y. Hong C.G. The Protective Effects of Osteocyte-Derived Extracellular Vesicles against Alzheimer’s Disease Diminished with Aging Adv. Sci. 2022 9 e2105316 10.1002/advs.202105316 35508803 PMC9189667 181. Zhong Z. Yang L. Wu X. Huang W. Yan J. Liu S. Sun X. Liu K. Lin H. Kuang S. Evidences for B6C3-Tg (APPswe/PSEN1dE9) Double-Transgenic Mice between 3 and 10 Months as an Age-Related Alzheimer’s Disease Model J. Mol. Neurosci. 2014 53 370 376 10.1007/s12031-013-0203-5 24362678 182. Howlett D.R. Bowler K. Soden P.E. Riddell D. Davis J.B. Richardson J.C. Burbidge S.A. Gonzalez M.I. Irving E.A. Lawman A. Abeta Deposition and Related Pathology in an APP X PS1 Transgenic Mouse Model of Alzheimer’s Disease Histol. Histopathol. 2008 23 67 76 10.14670/hh-23.67 17952859 183. Shi T. Shen S. Shi Y. Wang Q. Zhang G. Lin J. Chen J. Bai F. Zhang L. Wang Y. Osteocyte-Derived Sclerostin Impairs Cognitive Function During Ageing and Alzheimer’s Disease Progression Nat. Metab. 2024 6 531 549 10.1038/s42255-024-00989-x 38409606 184. Cararo-Lopes M.M. Mazucanti C.H.Y. Scavone C. Kawamoto E.M. Berwick D.C. The Relevance of α-KLOTHO to the Central Nervous System: Some Key Questions Ageing Res. Rev. 2017 36 137 148 10.1016/j.arr.2017.03.003 28323064 185. Chen C.D. Li Y. Chen A.K. Rudy M.A. Nasse J.S. Zeldich E. Polanco T.J. Abraham C.R. Identification of the Cleavage Sites Leading to the Shed Forms of Human and Mouse Anti-Aging and Cognition-Enhancing Protein Klotho PLoS ONE 2020 15 e0226382 10.1371/journal.pone.0226382 31929539 PMC6957300 186. Grøntvedt G.R. Sando S.B. Lauridsen C. Bråthen G. White L.R. Salvesen Ø. Aarsland D. Hessen E. Fladby T. Waterloo K. Association of Klotho Protein Levels and KL-VS Heterozygosity with Alzheimer Disease and Amyloid and Tau Burden JAMA Netw. Open 2022 5 e2243232 10.1001/jamanetworkopen.2022.43232 36413367 PMC9682425 187. Prud’homme G.J. Wang Q. Anti-Inflammatory Role of the Klotho Protein and Relevance to Aging Cells 2024 13 1413 10.3390/cells13171413 39272986 PMC11394293 188. Li B. Zhou M. Peng J. Yang Q. Chu J. Li R. Jiang Y. Mechanism of the Fibroblast Growth Factor 23/α-Klotho Axis in Peripheral Blood Mononuclear Cell Inflammation in Alzheimer’s Disease Immunol. Investig. 2022 51 1471 1484 10.1080/08820139.2021.1970180 34503373 189. Jia L. Piña-Crespo J. Li Y. Restoring Wnt/β-Catenin Signaling Is a Promising Therapeutic Strategy for Alzheimer’s Disease Mol. Brain 2019 12 104 10.1186/s13041-019-0525-5 31801553 PMC6894260 190. Jiang D.Q. Wei M.D. Wang K.W. Lan Y.X. Zhu N. Wang Y. Nicotine Contributes to the Neural Stem Cells Fate against Toxicity of Microglial-Derived Factors Induced by Aβ via the Wnt/β-Catenin Pathway Int. J. Neurosci. 2016 126 257 268 10.3109/00207454.2015.1008696 26001208 191. Wu B. Chen M. Meng L. Tian Q. Dong Z. Osteoclasts Link Dysregulated Peripheral Degradation Processes and Accelerated Progression in Alzheimer’s Disease J. Alzheimer’s Dis. 2024 99 773 785 10.3233/JAD-240096 38701149 192. Vahidy F.S. Rahbar M.H. Zhu H. Rowan P.J. Bambhroliya A.B. Savitz S.I. Systematic Review and Meta-Analysis of Bone Marrow-Derived Mononuclear Cells in Animal Models of Ischemic Stroke Stroke 2016 47 1632 1639 10.1161/STROKEAHA.116.012701 27165959 PMC4879076 193. Wang J. Fu X. Jiang C. Yu L. Wang M. Han W. Liu L. Wang J. Bone Marrow Mononuclear Cell Transplantation Promotes Therapeutic Angiogenesis via Upregulation of the VEGF-VEGFR2 Signaling Pathway in a Rat Model of Vascular Dementia Behav. Brain Res. 2014 265 171 180 10.1016/j.bbr.2014.02.033 24589546 PMC4000455 194. Kamiya F. Ueda M. Nito C. Kamiya N. Inaba T. Suda S. Saito T. Muraga K. Katayama Y. Effect of Repeated Allogeneic Bone Marrow Mononuclear Cell Transplantation on Brain Injury Following Transient Focal Cerebral Ischemia in Rats Life Sci. 2014 95 22 28 10.1016/j.lfs.2013.12.016 24368140 195. de Fátima Dos Santos Sampaio M. Santana Bastos Boechat M. Augusto Gusman Cunha I. Gonzaga Pereira M. Coimbra N.C. Giraldi-Guimarães A. Neurotrophin-3 Upregulation Associated with Intravenous Transplantation of Bone Marrow Mononuclear Cells Induces Axonal Sprouting and Motor Functional Recovery in the Long Term after Neocortical Ischaemia Brain Res. 2021 1758 147292 10.1016/j.brainres.2021.147292 33516814 196. Fujita Y. Ihara M. Ushiki T. Hirai H. Kizaka-Kondoh S. Hiraoka M. Ito H. Takahashi R. Early Protective Effect of Bone Marrow Mononuclear Cells against Ischemic White Matter Damage through Augmentation of Cerebral Blood Flow Stroke 2010 41 2938 2943 10.1161/STROKEAHA.110.596379 20947840 197. Wang J. Fu X. Yu L. Li N. Wang M. Liu X. Zhang D. Han W. Zhou C. Wang J. Preconditioning with VEGF Enhances Angiogenic and Neuroprotective Effects of Bone Marrow Mononuclear Cell Transplantation in a Rat Model of Chronic Cerebral Hypoperfusion Mol. Neurobiol. 2016 53 6057 6068 10.1007/s12035-015-9512-8 26530694 PMC4854818 198. Kitamura T. Terashima T. Katagi M. Ohashi N. Nozaki K. Tsuji A. Bone Marrow-Derived Mononuclear Cells Ameliorate Neurological Function in Chronic Cerebral Infarction Model Mice via Improvement of Cerebral Blood Flow Cytotherapy 2023 25 1186 1199 10.1016/j.jcyt.2023.07.003 37552144 199. Jiang C. Wang J. Yu L. Ou C. Liu X. Zhao X. Wang J. Comparison of the Therapeutic Effects of Bone Marrow Mononuclear Cells and Microglia for Permanent Cerebral Ischemia Behav. Brain Res. 2013 250 222 229 10.1016/j.bbr.2013.05.011 23685323 PMC3713626 200. Wang J. Liu X. Lu H. Jiang C. Cui X. Yu L. Fu X. Li Q. Wang J. CXCR4 + − Brain Behav. Immun. 2015 45 98 108 10.1016/j.bbi.2014.12.015 25526817 PMC4342301 201. Liem N.T. Huyen T.L. Huong L.T. Doan N.V. Anh B.V. Anh N.T.P. Tung D.T. Outcomes of Bone Marrow Mononuclear Cell Transplantation for Neurological Sequelae Due to Intracranial Hemorrhage Incidence in the Neonatal Period: Report of Four Cases Front. Pediatr. 2019 7 543 10.3389/fped.2019.00543 32039110 PMC6993568 202. Ogawa Y. Saino O. Okinaka Y. Kikuchi-Taura A. Takeuchi Y. Taguchi A. Bone Marrow Mononuclear Cells Transplantation and Training Increased Transplantation of Energy Source Transporters in Chronic Stroke J. Stroke Cerebrovasc. Dis. 2021 30 105932 10.1016/j.jstrokecerebrovasdis.2021.105932 34148020 203. Cox C.S. Jr. Baumgartner J.E. Harting M.T. Worth L.L. Walker P.A. Shah S.K. Ewing-Cobbs L. Hasan K.M. Day M.C. Lee D. Autologous Bone Marrow Mononuclear Cell Therapy for Severe Traumatic Brain Injury in Children Neurosurgery 2011 68 588 600 10.1227/NEU.0b013e318207734c 21192274 204. Sharma A.K. Sane H.M. Kulkarni P.P. Gokulchandran N. Biju H. Badhe P.B. Autologous Bone Marrow Mononuclear Cell Transplantation in Patients with Chronic Traumatic Brain Injury—A Clinical Study Cell Regen. 2020 9 3 10.1186/s13619-020-00043-7 32588151 PMC7306831 205. Cox C.S. Jr. Hetz R.A. Liao G.P. Aertker B.M. Ewing-Cobbs L. Juranek J. Savitz S.I. Jackson M.L. Romanowska-Pawliczek A.M. Triolo F. Treatment of Severe Adult Traumatic Brain Injury Using Bone Marrow Mononuclear Cells Stem Cells 2017 35 1065 1079 10.1002/stem.2538 27800660 PMC5367945 206. Kanamaru T. Kamimura N. Yokota T. Nishimaki K. Iuchi K. Lee H. Takami S. Akashiba H. Shitaka Y. Ueda M. Intravenous Transplantation of Bone Marrow-Derived Mononuclear Cells Prevents Memory Impairment in Transgenic Mouse Models of Alzheimer’s Disease Brain Res. 2015 1605 49 58 10.1016/j.brainres.2015.02.011 25698614 207. Sharma A. Sane H. Gokulchandran N. Pai S. Kulkarni P. Ganwir V. Maheshwari M. Sharma R. Raichur M. Nivins S. An Open-Label Proof-of-Concept Study of Intrathecal Autologous Bone Marrow Mononuclear Cell Transplantation in Intellectual Disability Stem Cell Res. Ther. 2018 9 19 10.1186/s13287-017-0748-2 29386049 PMC5793399 208. Zaverucha-do-Valle C. Gubert F. Bargas-Rega M. Coronel J.L. Mesentier-Louro L.A. Mencalha A. Abdelhay E. Santiago M.F. Mendez-Otero R. Bone Marrow Mononuclear Cells Increase Retinal Ganglion Cell Survival and Axon Regeneration in the Adult Rat Cell Transplant. 2011 20 391 406 10.3727/096368910X524764 20719093 209. Ribeiro-Resende V.T. Pimentel-Coelho P.M. Mesentier-Louro L.A. Mendez R.M. Mello-Silva J.P. Cabral-da-Silva M.C. de Mello F.G. de Melo Reis R.A. Mendez-Otero R. Trophic Activity Derived from Bone Marrow Mononuclear Cells Increases Peripheral Nerve Regeneration by Acting on Both Neuronal and Glial Cell Populations Neuroscience 2009 159 540 549 10.1016/j.neuroscience.2008.12.059 19174184 210. Leal M.M. Costa-Ferro Z.S. Souza B.S. Azevedo C.M. Carvalho T.M. Kaneto C.M. Carvalho R.H. Dos Santos R.R. Soares M.B. Early Transplantation of Bone Marrow Mononuclear Cells Promotes Neuroprotection and Modulation of Inflammation after Status Epilepticus in Mice by Paracrine Mechanisms Neurochem. Res. 2014 39 259 268 10.1007/s11064-013-1217-7 24343530 211. do Prado-Lima P.A.S. Onsten G.A. de Oliveira G.N. Brito G.C. Ghilardi I.M. de Souza E.V. Dos Santos P.G. Salamoni S.D. Machado D.C. Duarte M.M.F. The Antidepressant Effect of Bone Marrow Mononuclear Cell Transplantation in Chronic Stress J. Psychopharmacol. 2019 33 632 639 10.1177/0269881119841562 31018809 212. Costa-Ferro Z.S.M. do Prado-Lima P.A.S. Onsten G.A. Oliveira G.N. Brito G.C. Ghilardi I.M. Dos Santos P.G. Bertinatto R.J. da Silva D.V. Salamoni S.D. Bone Marrow Mononuclear Cell Transplant Prevents Rat Depression and Modulates Inflammatory and Neurogenic Molecules Prog. Neuro-Psychopharmacol. Biol. Psychiatry 2022 113 110455 10.1016/j.pnpbp.2021.110455 34637870 213. Santhanam L. Liu G. Jandu S. Su W. Wodu B.P. Savage W. Poe A. Liu X. Alexander L.M. Cao X. Skeleton-Secreted PDGF-BB Mediates Arterial Stiffening J. Clin. Investig. 2021 131 e147116 10.1172/JCI147116 34437300 PMC8516464 214. Su W. Liu G. Liu X. Zhou Y. Sun Q. Zhen G. Wang X. Hu Y. Gao P. Demehri S. Angiogenesis Stimulated by Elevated PDGF-BB in Subchondral Bone Contributes to Osteoarthritis Development JCI Insight 2020 5 e135446 10.1172/jci.insight.135446 32208385 PMC7205438 215. Liu G. Wang J. Wei Z. Fang C.L. Shen K. Qian C. Qi C. Li T. Gao P. Wong P.C. Elevated PDGF-BB from Bone Impairs Hippocampal Vasculature by Inducing PDGFRβ Shedding from Pericytes Adv. Sci. 2023 10 e2206938 10.1002/advs.202206938 37102631 PMC10369301 216. Yang C. Hawkins K.E. Doré S. Candelario-Jalil E. Neuroinflammatory Mechanisms of Blood-Brain Barrier Damage in Ischemic Stroke Am. J. Physiol. Cell Physiol. 2019 316 C135 C153 10.1152/ajpcell.00136.2018 30379577 PMC6397344 217. Sweeney M.D. Sagare A.P. Zlokovic B.V. Blood-Brain Barrier Breakdown in Alzheimer Disease and Other Neurodegenerative Disorders Nat. Rev. Neurol. 2018 14 133 150 10.1038/nrneurol.2017.188 29377008 PMC5829048 218. Kakaroubas N. Brennan S. Keon M. Saksena N.K. Pathomechanisms of Blood-Brain Barrier Disruption in ALS Neurosci. J. 2019 2019 2537698 10.1155/2019/2537698 31380411 PMC6652091 219. Rom S. Zuluaga-Ramirez V. Gajghate S. Seliga A. Winfield M. Heldt N.A. Kolpakov M.A. Bashkirova Y.V. Sabri A.K. Persidsky Y. Hyperglycemia-Driven Neuroinflammation Compromises BBB Leading to Memory Loss in Both Diabetes Mellitus (DM) Type 1 and Type 2 Mouse Models Mol. Neurobiol. 2019 56 1883 1896 10.1007/s12035-018-1195-5 29974394 PMC6320739 220. Watson A.N. Berthiaume A.A. Faino A.V. McDowell K.P. Bhat N.R. Hartmann D.A. Shih A.Y. Mild Pericyte Deficiency Is Associated with Aberrant Brain Microvascular Flow in Aged PDGFRβ +/− J. Cereb. Blood Flow Metab. 2020 40 2387 2400 10.1177/0271678X19900543 31987006 PMC7820684 221. Shi H. Koronyo Y. Fuchs D.T. Sheyn J. Wawrowsky K. Lahiri S. Black K.L. Koronyo-Hamaoui M. Retinal Capillary Degeneration and Blood-Retinal Barrier Disruption in Murine Models of Alzheimer’s Disease Acta Neuropathol. Commun. 2020 8 202 10.1186/s40478-020-01076-4 33228786 PMC7686701 222. Sweeney M.D. Ayyadurai S. Zlokovic B.V. Pericytes of the Neurovascular Unit: Key Functions and Signaling Pathways Nat. Neurosci. 2016 19 771 783 10.1038/nn.4288 27227366 PMC5745011 223. Liebner S. Dijkhuizen R.M. Reiss Y. Plate K.H. Agalliu D. Constantin G. Functional Morphology of the Blood-Brain Barrier in Health and Disease Acta Neuropathol. 2018 135 311 336 10.1007/s00401-018-1815-1 29411111 PMC6781630 224. Pederson L. Ruan M. Westendorf J.J. Khosla S. Oursler M.J. Regulation of Bone Formation by Osteoclasts Involves Wnt/BMP Signaling and the Chemokine Sphingosine-1-Phosphate Proc. Natl. Acad. Sci. USA 2008 105 20764 20769 10.1073/pnas.0805133106 19075223 PMC2603259 225. Garimella R. Tague S.E. Zhang J. Belibi F. Nahar N. Sun B.H. Insogna K. Wang J. Anderson H.C. Expression and Synthesis of Bone Morphogenetic Proteins by Osteoclasts: A Possible Path to Anabolic Bone Remodeling J. Histochem. Cytochem. 2008 56 569 577 10.1369/jhc.2008.950394 18319273 PMC2386763 226. Meyers E.A. Kessler J.A. TGF-β Family Signaling in Neural and Neuronal Differentiation, Development, and Function Cold Spring Harb. Perspect. Biol. 2017 9 a022244 10.1101/cshperspect.a022244 28130363 PMC5538418 227. Ji J. Wang J. Yang J. Wang X.P. Huang J.J. Xue T.F. Sun X.L. The Intra-nuclear SphK2-S1P Axis Facilitates M1-to-M2 Shift of Microglia via Suppressing HDAC1-Mediated KLF4 Deacetylation Front. Immunol. 2019 10 1241 10.3389/fimmu.2019.01241 31214192 PMC6557990 228. Takeshita S. Fumoto T. Matsuoka K. Park K.A. Aburatani H. Kato S. Ito M. Ikeda K. Osteoclast-Secreted CTHRC1 in the Coupling of Bone Resorption to Formation J. Clin. Investig. 2013 123 3914 3924 10.1172/JCI69493 23908115 PMC3754269 229. Zhang P. Zhou Y. Chen G. Li J. Wang B. Lu X. Potential Association of Bone Mineral Density Loss with Cognitive Impairment and Central and Peripheral Amyloid-β Changes: A Cross-Sectional Study BMC Musculoskelet. Disord. 2022 23 626 10.1186/s12891-022-05580-7 35773707 PMC9245236 230. Zhao Y. Chen H. Qiu F. He J. Chen J. Cognitive Impairment and Risks of Osteoporosis: A Systematic Review and Meta-Analysis Arch. Gerontol. Geriatr. 2023 106 104879 10.1016/j.archger.2022.104879 36462246 231. Liu D. Zhou H. Tao Y. Tan J. Chen L. Huang H. Chen Y. Li Y. Zhou R. Alzheimer’s Disease Is Associated with Increased Risk of Osteoporosis: The Chongqing Aging Study Curr. Alzheimer Res. 2016 13 1165 1172 10.2174/15672050113109990149 23919776 232. Li R. Miao Z. Liu Y. Chen X. Wang H. Su J. Chen J. The Brain-Gut-Bone Axis in Neurodegenerative Diseases: Insights, Challenges, and Future Prospects Adv. Sci. 2024 11 e2307971 10.1002/advs.202307971 PMC11481201 39120490 233. Hampel H. Hardy J. Blennow K. Chen C. Perry G. Kim S.H. Villemagne V.L. Aisen P. Vendruscolo M. Iwatsubo T. The Amyloid-β Pathway in Alzheimer’s Disease Mol. Psychiatry 2021 26 5481 5503 10.1038/s41380-021-01249-0 34456336 PMC8758495 234. Thal D.R. Tomé S.O. The Central Role of Tau in Alzheimer’s Disease: From Neurofibrillary Tangle Maturation to the Induction of Cell Death Brain Res. Bull. 2022 190 204 217 10.1016/j.brainresbull.2022.10.006 36244581 235. Wesseling H. Mair W. Kumar M. Schlaffner C.N. Tang S. Beerepoot P. Fatou B. Guise A.J. Cheng L. Takeda S. Tau PTM Profiles Identify Patient Heterogeneity and Stages of Alzheimer’s Disease Cell 2020 183 1699 1713.e1613 10.1016/j.cell.2020.10.029 33188775 PMC8168922 236. Schwalbe M. Kadavath H. Biernat J. Ozenne V. Blackledge M. Mandelkow E. Zweckstetter M. Structural Impact of Tau Phosphorylation at Threonine 231 Structure 2015 23 1448 1458 10.1016/j.str.2015.06.002 26165593 237. Rani L. Mittal J. Mallajosyula S.S. Effect of Phosphorylation and O-GlcNAcylation on Proline-Rich Domains of Tau J. Phys. Chem. B 2020 124 1909 1918 10.1021/acs.jpcb.9b11720 32065850 PMC7459333 238. Braak H. Mayer B. Feldengut S. Schön M. Del Tredici K. Sequence and Trajectory of Early Alzheimer’s Disease-Related Tau Inclusions in the Hippocampal Formation of Cases without Amyloid-β Deposits Acta Neuropathol. 2025 149 50 10.1007/s00401-025-02862-x 40407905 PMC12102137 239. Wegmann S. Medalsy I.D. Mandelkow E. Müller D.J. The Fuzzy Coat of Pathological Human Tau Fibrils Is a Two-Layered Polyelectrolyte Brush Proc. Natl. Acad. Sci. USA 2013 110 E313 E321 10.1073/pnas.1212100110 23269837 PMC3557036 240. Moloney C.M. Lowe V.J. Murray M.E. Visualization of Neurofibrillary Tangle Maturity in Alzheimer’s Disease: A Clinicopathologic Perspective for Biomarker Research Alzheimer’s Dement. 2021 17 1554 1574 10.1002/alz.12321 33797838 PMC8478697 241. Thinakaran G. Koo E.H. Amyloid Precursor Protein Trafficking, Processing, and Function J. Biol. Chem. 2008 283 29615 29619 10.1074/jbc.R800019200 18650430 PMC2573065 242. Braak H. Del Tredici K. Amyloid-β May Be Released from Non-Junctional Varicosities of Axons Generated from Abnormal Tau-Containing Brainstem Nuclei in Sporadic Alzheimer’s Disease: A Hypothesis Acta Neuropathol. 2013 126 303 306 10.1007/s00401-013-1153-2 23824268 243. Alrouji M. Alshammari M.S. Tasqeeruddin S. Shamsi A. Interplay between Aging and Tau Pathology in Alzheimer’s Disease: Mechanisms and Translational Perspectives Antioxidants 2025 14 774 10.3390/antiox14070774 40722878 PMC12291953 244. Mathys H. Davila-Velderrain J. Peng Z. Gao F. Mohammadi S. Young J.Z. Menon M. He L. Abdurrob F. Jiang X. Single-Cell Transcriptomic Analysis of Alzheimer’s Disease Nature 2019 570 332 337 10.1038/s41586-019-1195-2 31042697 PMC6865822 245. Grubman A. Chew G. Ouyang J.F. Sun G. Choo X.Y. McLean C. Simmons R.K. Buckberry S. Vargas-Landin D.B. Poppe D. A Single-Cell Atlas of Entorhinal Cortex from Individuals with Alzheimer’s Disease Reveals Cell-Type-Specific Gene Expression Regulation Nat. Neurosci. 2019 22 2087 2097 10.1038/s41593-019-0539-4 31768052 246. Anderson A.G. Rogers B.B. Loupe J.M. Rodriguez-Nunez I. Roberts S.C. White L.M. Brazell J.N. Bunney W.E. Bunney B.G. Watson S.J. Single Nucleus Multiomics Identifies ZEB1 and MAFB As Candidate Regulators of Alzheimer’s Disease-Specific Cis-Regulatory Elements Cell Genom. 2023 3 100263 10.1016/j.xgen.2023.100263 36950385 PMC10025452 247. Xiong X. James B.T. Boix C.A. Park Y.P. Galani K. Victor M.B. Sun N. Hou L. Ho L.L. Mantero J. Epigenomic Dissection of Alzheimer’s Disease Pinpoints Causal Variants and Reveals Epigenome Erosion Cell 2023 186 4422 4437.e21 10.1016/j.cell.2023.08.040 37774680 PMC10782612 248. Chen W.T. Lu A. Craessaerts K. Pavie B. Sala Frigerio C. Corthout N. Qian X. Laláková J. Kühnemund M. Voytyuk I. Spatial Transcriptomics and in Situ Sequencing to Study Alzheimer’s Disease Cell 2020 182 976 991.e19 10.1016/j.cell.2020.06.038 32702314 249. Zhou Y. Song W.M. Andhey P.S. Swain A. Levy T. Miller K.R. Poliani P.L. Cominelli M. Grover S. Gilfillan S. Human and Mouse Single-Nucleus Transcriptomics Reveal TREM2-Dependent and TREM2-Independent Cellular Responses in Alzheimer’s Disease Nat. Med. 2020 26 131 142 10.1038/s41591-019-0695-9 31932797 PMC6980793 250. Hansen D.V. Hanson J.E. Sheng M. Microglia in Alzheimer’s Disease J. Cell Biol. 2018 217 459 472 10.1083/jcb.201709069 29196460 PMC5800817 251. Fertan E. Lam J.Y.L. Albertini G. Dewilde M. Wu Y. Akingbade O.E.S. Böken D. English E.A. De Strooper B. Klenerman D. Lecanemab Preferentially Binds to Smaller Aggregates Present at Early Alzheimer’s Disease Alzheimer’s Dement. 2025 21 e70086 10.1002/alz.70086 40237235 PMC12001052 252. Bayer T.A. N-Truncated Aβ Starting at Position Four-Biochemical Features, Preclinical Models, and Potential as Drug Target in Alzheimer’s Disease Front. Aging Neurosci. 2021 13 710579 10.3389/fnagi.2021.710579 34489680 PMC8417877 253. Roberts M. Sevastou I. Imaizumi Y. Mistry K. Talma S. Dey M. Gartlon J. Ochiai H. Zhou Z. Akasofu S. Pre-Clinical Characterisation of E2814, a High-Affinity Antibody Targeting the Microtubule-Binding Repeat Domain of Tau for Passive Immunotherapy in Alzheimer’s Disease Acta Neuropathol. Commun. 2020 8 13 10.1186/s40478-020-0884-2 32019610 PMC7001291 254. Weinstock M. Role of Oxidative Stress and Neuroinflammation in the Etiology of Alzheimer’s Disease: Therapeutic Options Antioxidants 2025 14 769 10.3390/antiox14070769 40722873 PMC12291978 255. Akoury E. Pickhardt M. Gajda M. Biernat J. Mandelkow E. Zweckstetter M. Mechanistic Basis of Phenothiazine-Driven Inhibition of Tau Aggregation Angew. Chem. Int. Ed. 2013 52 3511 3515 10.1002/anie.201208290 23401175 256. Ma Q.L. Zuo X. Yang F. Ubeda O.J. Gant D.J. Alaverdyan M. Teng E. Hu S. Chen P.P. Maiti P. Curcumin Suppresses Soluble Tau Dimers and Corrects Molecular Chaperone, Synaptic, and Behavioral Deficits in Aged Human Tau Transgenic Mice J. Biol. Chem. 2013 288 4056 4065 10.1074/jbc.M112.393751 23264626 PMC3567657 257. Haroon J. Jordan K. Mahdavi K. Rindner E. Becerra S. Surya J.R. Zielinski M. Venkatraman V. Goodenowe D. Hofmeister K. A Phase 2, Open-Label Study of Anti-Inflammatory NE3107 in Patients with Dementias Medicine 2024 103 e39027 10.1097/MD.0000000000039027 39058809 PMC11272329 258. Reading C.L. Ahlem C.N. Murphy M.F. NM101 Phase III Study of NE3107 in Alzheimer’s Disease: Rationale, Design and Therapeutic Modulation of Neuroinflammation and Insulin Resistance Neurodegener. Dis. Manag. 2021 11 289 298 10.2217/nmt-2021-0022 34251287 259. Wang Y. Liu Y. Nham A. Sherbaf A. Quach D. Yahya E. Ranburger D. Bi X. Baudry M. Calpain-2 as a Therapeutic Target in Repeated Concussion-Induced Neuropathy and Behavioral Impairment Sci. Adv. 2020 6 eaba5547 10.1126/sciadv.aba5547 32937436 PMC7458466 260. Wang S. Mustafa M. Yuede C.M. Salazar S.V. Kong P. Long H. Ward M. Siddiqui O. Paul R. Gilfillan S. Anti-Human TREM2 Induces Microglia Proliferation and Reduces Pathology in an Alzheimer’s Disease Model J. Exp. Med. 2020 217 e20200785 10.1084/jem.20200785 32579671 PMC7478730 261. Tan Z.S. Seshadri S. Beiser A. Zhang Y. Felson D. Hannan M.T. Au R. Wolf P.A. Kiel D.P. Bone Mineral Density and the Risk of Alzheimer Disease Arch. Neurol. 2005 62 107 111 10.1001/archneur.62.1.107 15642856 262. Loskutova N. Watts A.S. Burns J.M. The Cause-Effect Relationship between Bone Loss and Alzheimer’s Disease Using Statistical Modeling Med. Hypotheses 2019 122 92 97 10.1016/j.mehy.2018.10.024 30593432 PMC6318806 263. Tsai C.H. Chuang C.S. Hung C.H. Lin C.L. Sung F.C. Tang C.H. Hsu H.C. Chung C.J. Fracture as an Independent Risk Factor of Dementia: A Nationwide Population-Based Cohort Study Medicine 2014 93 e188 10.1097/MD.0000000000000188 25474435 PMC4616393 264. Davoody S. Asgari Taei A. Khodabakhsh P. Dargahi L. Mtor Signaling and Alzheimer’s Disease: What We Know and Where We Are? CNS Neurosci. Ther. 2024 30 e14463 10.1111/cns.14463 37721413 PMC11017461 265. Liang Y. Wang L. Alzheimer’s Disease Is an Important Risk Factor of Fractures: A Meta-Analysis of Cohort Studies Mol. Neurobiol. 2017 54 3230 3235 10.1007/s12035-016-9841-2 27072352 266. Azargoonjahromi A. The Duality of Amyloid-β: Its Role in Normal and Alzheimer’s Disease States Mol. Brain 2024 17 44 10.1186/s13041-024-01118-1 39020435 PMC11256416 267. Yang B. Li S. Chen Z. Feng F. He L. Liu B. He T. Wang X. Chen R. Chen Z. Amyloid β Peptide Promotes Bone Formation by Regulating Wnt/β-Catenin Signaling and the OPG/RANKL/RANK System FASEB J. 2020 34 3583 3593 10.1096/fj.201901550R 31944393 268. Deng A.F. Wang F.X. Wang S.C. Zhang Y.Z. Bai L. Su J.C. Bone-Organ Axes: Bidirectional Crosstalk Mil. Med. Res. 2024 11 37 10.1186/s40779-024-00540-9 38867330 PMC11167910 269. Nasme F. Behera J. Tyagi P. Debnath N. Falcone J.C. Tyagi N. The Potential Link between the Development of Alzheimer’s Disease and Osteoporosis Biogerontology 2025 26 43 10.1007/s10522-024-10181-z 39832071 PMC12087362 270. Arevalo M.A. Santos-Galindo M. Lagunas N. Azcoitia I. Garcia-Segura L.M. Selective Estrogen Receptor Modulators as Brain Therapeutic Agents J. Mol. Endocrinol. 2011 46 R1 R9 10.1677/JME-10-0122 21071476 271. Jacobsen D.E. Samson M.M. Emmelot-Vonk M.H. Verhaar H.J. Raloxifene Improves Verbal Memory in Late Postmenopausal Women: A Randomized, Double-Blind, Placebo-Controlled Trial Menopause 2010 17 309 314 10.1097/gme.0b013e3181bd54df 19918203 272. Henderson V.W. Ala T. Sainani K.L. Bernstein A.L. Stephenson B.S. Rosen A.C. Farlow M.R. Raloxifene for Women with Alzheimer Disease: A Randomized Controlled Pilot Trial Neurology 2015 85 1937 1944 10.1212/WNL.0000000000002171 26537053 PMC4664126 273. Korol D.L. Pisani S.L. Estrogens and Cognition: Friends or Foes?: An Evaluation of the Opposing Effects of Estrogens on Learning and Memory Horm. Behav. 2015 74 105 115 10.1016/j.yhbeh.2015.06.017 26149525 PMC4573330 274. Cibicková L. Palicka V. Cibicek N. Cermáková E. Micuda S. Bartosová L. Jun D. Differential Effects of Statins and Alendronate on Cholinesterases in Serum and Brain of Rats Physiol. Res. 2007 56 765 770 10.33549/physiolres.931121 17087598 275. Chang K.H. Chung C.J. Lin C.L. Sung F.C. Wu T.N. Kao C.H. Increased Risk of Dementia in Patients with Osteoporosis: A Population-Based Retrospective Cohort Analysis Age 2014 36 967 975 10.1007/s11357-013-9608-x 24347180 PMC4039265 276. Safer U. Safer V.B. Demir S.O. Yanikoglu I. Effects of Bisphosphonates and Calcium Plus Vitamin-D Supplements on Cognitive Function in Postmenopausal Osteoporosis§ Endocr. Metab. Immune Disord. Drug Targets 2016 16 56 60 10.2174/1871530316666160330105952 27026340 277. Wu P.H. Lin Y.T. Chen C.S. Chiu Y.W. Tsai J.C. Kuo P.L. Hsu Y.L. Ljunggren Ö. Fellström B. Kuo M.C. Associations of Bone Turnover Markers with Cognitive Function in Patients Undergoing Hemodialysis Dis. Markers 2020 2020 8641749 10.1155/2020/8641749 32377274 PMC7196142 278. Chang B. Quan Q. Li Y. Qiu H. Peng J. Gu Y. Treatment of Osteoporosis, with a Focus on 2 Monoclonal Antibodies Med. Sci. Monit. 2018 24 8758 8766 10.12659/MSM.912309 30508820 PMC6289028 279. Citraro R. Gallelli L. Leo A. De Fazio P. Gallelli P. Russo E. De Sarro G. Effects of Chronic Sodium Alendronate on Depression and Anxiety in a Menopausal Experimental Model Pharmacol. Biochem. Behav. 2015 129 65 71 10.1016/j.pbb.2014.12.006 25542587 280. Eimar H. Alebrahim S. Manickam G. Al-Subaie A. Abu-Nada L. Murshed M. Tamimi F. Donepezil Regulates Energy Metabolism and Favors Bone Mass Accrual Bone 2016 84 131 138 10.1016/j.bone.2015.12.009 26719214 281. Isik A.T. Soysal P. Usarel C. Effects of Acetylcholinesterase Inhibitors on Balance and Gait Functions and Orthostatic Hypotension in Elderly Patients with Alzheimer Disease Am. J. Alzheimer’s Dis. Other Dement. 2016 31 580 584 10.1177/1533317516666195 PMC10852938 27585748 282. Kim D.H. Brown R.T. Ding E.L. Kiel D.P. Berry S.D. Dementia Medications and Risk of Falls, Syncope, and Related Adverse Events: Meta-Analysis of Randomized Controlled Trials J. Am. Geriatr. Soc. 2011 59 1019 1031 10.1111/j.1532-5415.2011.03450.x 21649634 PMC3260523 283. Sato T. Enoki Y. Sakamoto Y. Yokota K. Okubo M. Matsumoto M. Hayashi N. Usui M. Kokabu S. Mimura T. Donepezil Prevents RANK-Induced Bone Loss via Inhibition of Osteoclast Differentiation by Downregulating Acetylcholinesterase Heliyon 2015 1 e00013 10.1016/j.heliyon.2015.e00013 27441211 PMC4939821 284. Choi D.S. Lee H.J. Shin Y.I. Lee A. Kim H.G. Kim Y.H. Modulation of Cortical Activity by High-Frequency Whole-Body Vibration Exercise: An fNIRS Study J. Sport Rehabil. 2019 28 665 670 10.1123/jsr.2017-0012 30222484 285. Cariati I. Bonanni R. Pallone G. Romagnoli C. Rinaldi A.M. Annino G. D’Arcangelo G. Tancredi V. Whole Body Vibration Improves Brain and Musculoskeletal Health by Modulating the Expression of Tissue-Specific Markers: FNDC5 as a Key Regulator of Vibration Adaptations Int. J. Mol. Sci. 2022 23 388 10.3390/ijms231810388 PMC9498983 36142305 286. Raval A.P. Schatz M. Bhattacharya P. d’Adesky N. Rundek T. Dietrich W.D. Bramlett H.M. Whole Body Vibration Therapy after Ischemia Reduces Brain Damage in Reproductively Senescent Female Rats Int. J. Mol. Sci. 2018 19 2749 10.3390/ijms19092749 30217051 PMC6164360 287. Rodriguez-Miguelez P. Fernandez-Gonzalo R. Collado P.S. Almar M. Martinez-Florez S. de Paz J.A. González-Gallego J. Cuevas M.J. Whole-Body Vibration Improves the Anti-Inflammatory Status in Elderly Subjects through Toll-Like Receptor 2 and 4 Signaling Pathways Mech. Ageing Dev. 2015 150 12 19 10.1016/j.mad.2015.08.002 26253933 288. Chen T. Liu W.B. Ren X. Li Y.F. Li W. Hang C.H. Wang Y.H. Whole Body Vibration Attenuates Brain Damage and Neuroinflammation Following Experimental Traumatic Brain Injury Front. Cell Dev. Biol. 2022 10 847859 10.3389/fcell.2022.847859 35465331 PMC9022659 289. Yan J.G. Zhang L.L. Agresti M. LoGiudice J. Sanger J.R. Matloub H.S. Havlik R. Neural Systemic Impairment from Whole-Body Vibration J. Neurosci. Res. 2015 93 736 744 10.1002/jnr.23536 25557339 290. Wang Y. Zhang K. Gao W. Lin H. Li T. Liu T.C.Y. Weng X. Yuan Y. The Effects of Different Forms of Exercise During the Early Life on the Bone Microstructure of Ovariectomized Mice Bone 2025 192 117364 10.1016/j.bone.2024.117364 39645067 291. Minematsu A. Nishii Y. Effects of Whole-Body Vibration on Bone Properties in Type 2 Diabetes Model Rats Osteoporos. Sarcopenia 2024 10 101 107 10.1016/j.afos.2024.08.001 39403223 PMC11471131 292. Li Q. Liang L. Gao C. Zong B. Therapeutic Effects of Whole-Body Vibration on Postmenopausal Women with Osteoporosis: A Systematic Review and Meta-Analysis Braz. J. Med. Biol. Res. 2024 57 e13996 10.1590/1414-431x2024e13996 39504068 PMC11540256 293. Lourenco M.V. Frozza R.L. de Freitas G.B. Zhang H. Kincheski G.C. Ribeiro F.C. Gonçalves R.A. Clarke J.R. Beckman D. Staniszewski A. Exercise-Linked FNDC5/Irisin Rescues Synaptic Plasticity and Memory Defects in Alzheimer’s Models Nat. Med. 2019 25 165 175 10.1038/s41591-018-0275-4 30617325 PMC6327967 294. Lourenco M.V. Ribeiro F.C. Sudo F.K. Drummond C. Assunção N. Vanderborght B. Tovar-Moll F. Mattos P. De Felice F.G. Ferreira S.T. Cerebrospinal Fluid Irisin Correlates with Amyloid-β, BDNF, and Cognition in Alzheimer’s Disease Alzheimer’s Dement. 2020 12 e12034 10.1002/dad2.12034 PMC7306518 32582833 295. Wrann C.D. White J.P. Salogiannnis J. Laznik-Bogoslavski D. Wu J. Ma D. Lin J.D. Greenberg M.E. Spiegelman B.M. Exercise Induces Hippocampal BDNF through a PGC-1α/FNDC5 Pathway Cell Metab. 2013 18 649 659 10.1016/j.cmet.2013.09.008 24120943 PMC3980968 296. Jodeiri Farshbaf M. Ghaedi K. Megraw T.L. Curtiss J. Shirani Faradonbeh M. Vaziri P. Nasr-Esfahani M.H. Does PGC1α/FNDC5/BDNF Elicit the Beneficial Effects of Exercise on Neurodegenerative Disorders? Neuromol. Med. 2016 18 1 15 10.1007/s12017-015-8370-x 26611102 297. Zaidi M. Zaidi S. Yuen T. Understanding Osteokine Biology Cell Metab. 2024 36 888 890 10.1016/j.cmet.2024.04.008 38718755 PMC11705590 298. Cardillo M. Katam K. Suravajhala P. Advancements in Multi-Omics Research to Address Challenges in Alzheimer’s Disease: A Systems Biology Approach Utilizing Molecular Biomarkers and Innovative Strategies Front. Aging Neurosci. 2025 17 1591796 10.3389/fnagi.2025.1591796 40771197 PMC12325291 299. Badia I.M.P. Wessels L. Müller-Dott S. Trimbour R. Ramirez Flores R.O. Argelaguet R. Saez-Rodriguez J. Gene Regulatory Network Inference in the Era of Single-Cell Multi-Omics Nat. Rev. Genet. 2023 24 739 754 10.1038/s41576-023-00618-5 37365273 300. Batra R. Krumsiek J. Wang X. Allen M. Blach C. Kastenmüller G. Arnold M. Ertekin-Taner N. Kaddurah-Daouk R. Comparative Brain Metabolomics Reveals Shared and Distinct Metabolic Alterations in Alzheimer’s Disease and Progressive Supranuclear Palsy Alzheimer’s Dement. 2024 20 8294 8307 10.1002/alz.14249 39439201 PMC11667510 301. Rahimzadeh N. Srinivasan S.S. Zhang J. Swarup V. Gene Networks and Systems Biology in Alzheimer’s Disease: Insights from Multi-Omics Approaches Alzheimer’s Dement. 2024 20 3587 3605 10.1002/alz.13790 38534018 PMC11095483 302. Baldock P.A. Allison S.J. Lundberg P. Lee N.J. Slack K. Lin E.J. Enriquez R.F. McDonald M.M. Zhang L. During M.J. Novel Role of Y1 Receptors in the Coordinated Regulation of Bone and Energy Homeostasis J. Biol. Chem. 2007 282 19092 19102 10.1074/jbc.M700644200 17491016 303. Peng S. Zhou Y.L. Song Z.Y. Lin S. Effects of Neuropeptide Y on Stem Cells and Their Potential Applications in Disease Therapy Stem Cells Int. 2017 2017 6823917 10.1155/2017/6823917 29109742 PMC5646323 304. Farr O.M. Tsoukas M.A. Mantzoros C.S. Leptin and the Brain: Influences on Brain Development, Cognitive Functioning and Psychiatric Disorders Metabolism 2015 64 114 130 10.1016/j.metabol.2014.07.004 25092133 305. Narita K. Kosaka H. Okazawa H. Murata T. Wada Y. Relationship between Plasma Leptin Level and Brain Structure in Elderly: A Voxel-Based Morphometric Study Biol. Psychiatry 2009 65 992 994 10.1016/j.biopsych.2008.10.006 19026409 306. Zhou R. Deng J. Zhang M. Zhou H.D. Wang Y.J. Association between Bone Mineral Density and the Risk of Alzheimer’s Disease J. Alzheimer’s Dis. 2011 24 101 108 10.3233/JAD-2010-101467 21187587 307. McGregor G. Harvey J. Leptin Regulation of Synaptic Function at Hippocampal TA-CA1 and SC-CA1 Synapses: Implications for Health and Disease Neurochem. Res. 2019 44 650 660 10.1007/s11064-017-2362-1 28819795 PMC6420429 308. Lieb W. Beiser A.S. Vasan R.S. Tan Z.S. Au R. Harris T.B. Roubenoff R. Auerbach S. DeCarli C. Wolf P.A. Association of Plasma Leptin Levels with Incident Alzheimer Disease and MRI Measures of Brain Aging JAMA 2009 302 2565 2572 10.1001/jama.2009.1836 20009056 PMC2838501 309. Welt C.K. Chan J.L. Bullen J. Murphy R. Smith P. DePaoli A.M. Karalis A. Mantzoros C.S. Recombinant Human Leptin in Women with Hypothalamic Amenorrhea N. Engl. J. Med. 2004 351 987 997 10.1056/NEJMoa040388 15342807 310. Yuan J. Meloni B.P. Shi T. Bonser A. Papadimitriou J.M. Mastaglia F.L. Zhang C. Zheng M. Gao J. The Potential Influence of Bone-Derived Modulators on the Progression of Alzheimer’s Disease J. Alzheimer’s Dis. 2019 69 59 70 10.3233/JAD-181249 30932886 311. Quesnel M.J. Labonté A. Picard C. Bowie D.C. Zetterberg H. Blennow K. Brinkmalm A. Villeneuve S. Poirier J. Osteopontin: A Novel Marker of Pre-Symptomatic Sporadic Alzheimer’s Disease Alzheimer’s Dement. 2024 20 6008 6031 10.1002/alz.14065 39072932 PMC11497655 312. Fodor D. Bondor C. Albu A. Simon S.P. Craciun A. Muntean L. The Value of Osteopontin in the Assessment of Bone Mineral Density Status in Postmenopausal Women J. Investig. Med. 2013 61 15 21 10.2310/JIM.0b013e3182761264 23117696 313. Luckhaus C. Mahabadi B. Grass-Kapanke B. Jänner M. Willenberg H. Jäger M. Supprian T. Fehsel K. Blood Biomarkers of Osteoporosis in Mild Cognitive Impairment and Alzheimer’s Disease J. Neural Transm. 2009 116 905 911 10.1007/s00702-009-0241-x 19468818 314. Kumar V. Banerjee A. Roy K. Breaking the Barriers: Machine-Learning-Based c-RASAR Approach for Accurate Blood-Brain Barrier Permeability Prediction J. Chem. Inf. Model. 2024 64 4298 4309 10.1021/acs.jcim.4c00433 38700741 315. Janicka M. Sztanke M. Sztanke K. Modeling the Blood-Brain Barrier Permeability of Potential Heterocyclic Drugs via Biomimetic IAM Chromatography Technique Combined with QSAR Methodology Molecules 2024 29 287 10.3390/molecules29020287 38257200 PMC11154582 316. Kato R. Zeng W. Siramshetty V.B. Williams J. Kabir M. Hagen N. Padilha E.C. Wang A.Q. Mathé E.A. Xu X. Development and Validation of PAMPA-BBB QSAR Model to Predict Brain Penetration Potential of Novel Drug Candidates Front. Pharmacol. 2023 14 1291246 10.3389/fphar.2023.1291246 38108064 PMC10722238 317. Rejc L. Gómez-Vallejo V. Joya A. Moreno O. Egimendia A. Castellnou P. Ríos-Anglada X. Cossío U. Baz Z. Passannante R. Longitudinal Evaluation of a Novel BChE PET Tracer as an Early in Vivo Biomarker in the Brain of a Mouse Model for Alzheimer Disease Theranostics 2021 11 6542 6559 10.7150/thno.54589 33995675 PMC8120209 Figure 1 Bone cell network signaling modulates neurological pathologies. Figure 2 BMSCs participate in brain regulation through autologous transplantation, secretion of trophic factors, and inhibition of inflammatory factors. Figure 3 BMSCs-derived exosomes regulate brain function. Figure 4 Osteoblasts regulate brain function. Figure 5 Osteocytes regulate brain function. young Figure 6 BMMs regulate brain function. biology-14-01112-t001_Table 1 Table 1 Therapeutic and Mechanisms of BMSCs in Brain Diseases. Diseases Methods Effect Mechanisms AD BMSC Transplant, Amelioration of hippocampal loss and enhancement of memory function in mice [ 15 72 Inhibition of neuronal apoptosis, an increase in hippocampal superoxide dismutase activity, and a significant increase in protein levels of brain-derived neurotrophic factor in the hippocampus [ 15 72 80 Diabetic Cognitive Impairment BMSC Transplant Improvement of diabetes-induced cognitive dysfunction [ 23 Repair of damaged neurons and astrocyte degeneration [ 23 Cerebral ischaemia BMSCs-NGF Promoting brain remodeling Upregulation of neural-like cell differentiation and increased synaptophysin expression [ 36 42 MCAO BMSCs-VEGF Improvement in brain function and behavior Promotes angiogenesis and improves blood flow recovery [ 46 48 TBI BMSCs-EXO Improves cognitive function and promotes neurological recovery Reducing glutamate levels [ 67 16 75 16 SAH BMSCs-EXO Improves neurological function, reduces brain water content, and maintains BBB integrity [ 69 Inhibition of NF-κB, activation of AMPK, attenuation of post-SAH inflammation, and neuroprotection [ 70 69 PD BMSCs-EXO Reversal of rotational behavior and climbing speed in PD mice Inhibition of the P38MAPK/P65NF-κB signaling cascade and thus the transcription of inflammation-related genes remodels the nigrostriatal inflammatory microenvironment and repairs DA nerve injury [ 71 ",
  "metadata": {
    "Title of this paper": "Longitudinal Evaluation of a Novel BChE PET Tracer as an Early in Vivo Biomarker in the Brain of a Mouse Model for Alzheimer Disease",
    "Journal it was published in:": "Biology",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12467821/"
  }
}