{
  "title": "Paper_42",
  "abstract": "pmc Sci Adv Sci Adv 2850 sciadv sciadv Science Advances 2375-2548 American Association for the Advancement of Science PMC12494026 PMC12494026.1 12494026 12494026 41042874 10.1126/sciadv.adu5064 adu5064 1 Research Article Biomedicine and Life Sciences SciAdv r-articles Biochemistry Synthetic Biology Synthetic Biology Comprehensive engineering of novel glycosyltransferase for efficient, donor-promiscuous, and regioselective glycosylation of flavonoids Enhanced flavonoid glycosylation: Activity, regioselectivity, and donor diversity https://orcid.org/0009-0009-8367-3545 Lu Yang Conceptualization Data curation Formal analysis Investigation Methodology Validation Visualization Writing - original draft Writing - review & editing  1 † https://orcid.org/0009-0004-1669-4593 Xie Lianghua Data curation Formal analysis Investigation Methodology Validation Visualization Writing - original draft Writing - review & editing  1 † Xie Jiahong Data curation Investigation Methodology Validation Visualization  1 Liu Gexin Investigation Validation  1 Fu Jiaqi Investigation Validation  1 Zou Luheng Investigation Validation  1 Lin Qiu Investigation Methodology Validation  1 https://orcid.org/0000-0001-9156-0377 Wang Yong Data curation Funding acquisition Resources Software Supervision Writing - review & editing  2 https://orcid.org/0000-0002-2373-2437 Chen Wei Conceptualization Funding acquisition Methodology Project administration Resources Supervision Writing - original draft Writing - review & editing  1  3 * 1 2 3 * zjuchenwei@zju.edu.cn † These authors contributed equally to this work. 03 10 2025 03 10 2025 11 40 498113 eadu5064 09 11 2024 04 9 2025 03 10 2025 04 10 2025 04 10 2025 Copyright © 2025 The Authors, some rights reserved; exclusive licensee American Association for the Advancement of Science. No claim to original U.S. Government Works. Distributed under a Creative Commons Attribution NonCommercial License 4.0 (CC BY-NC). 2025 The Authors https://creativecommons.org/licenses/by-nc/4.0/ This is an open-access article distributed under the terms of the Creative Commons Attribution-NonCommercial license not Flavonoid O O Tailored evolution of UGT75AJ2 enhanced catalytic activity, donor promiscuity, and regioselectivity, advancing enzyme engineering. http://dx.doi.org/10.13039/501100001809 National Natural Science Foundation of China 32172192 National key R&D program of China 2022YFF1100202 pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement yes pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes INTRODUCTION Flavonoids, a diverse group of plant secondary metabolites, mainly include flavonols, flavones, flavanones, flavanols, and anthocyanins, among other subgroups ( 1 2 4 5 6 7 8 9 10 11 12 14 15 16 17 18 19 20 O O O 21 23 24 25 O Arabidopsis Camellia sinensis Glycyrrhiza uralensis 19 26 29 However, most wild-type (WT) O 30 32 33 37 Withania somnifera 38 Mangifera indica O 39 Siraitia grosvenorii 40 41 Saccharomyces cerevisiae k cat /K m 42 O O In this study, using gene mining, we found a previously unidentified plant glycosyltransferase UGT75AJ2, which was capable of catalyzing the glycosylation of flavonoids at the 3′-OH and 7-OH positions (the detailed methods for gene mining were provided in the Supplementary Materials). This distinctive enzymatic activity of UGT75AJ2 makes it a promising candidate for the biosynthesis of natural blue pigments and high-value flavonoid glycosides ( 43 44 1 RESULTS Functional characterization of UGT75AJ2 and bioactivity verification of its glycosylation products Vaccinium corymbosum V. corymbosum 45 O V. corymbosum 1 18 Fig. 1, A and B Fig. 1. Functional characterization of UGT75AJ2. ( A O 1 B 1 1a 1b O C 1a 1b D O 18 E 18 18a 18c O O F 18a 18c In particular, two glucosylated derivatives (labeled 1a 1b Fig. 1C + m z Fig. 1D O 1a 1b O O O 18a 18b O O Fig. 1, E and F The hydroxyl group in the chemical structure of flavonoids has been demonstrated to play a crucial role in their anti-inflammatory, antioxidant, and hypoglycemic activities. However, it has been observed that the hydroxyl groups at positions C-3′ and C-7 can attenuate their biological activities to some extent ( 46 O O O Despite the fact that a few glycosyltransferases have been reported to catalyze 3′- O O 33 34 47 Identifying mutational hotspots for UGT75AJ2 by in silico approach To enhance the catalytic performance of UGT75AJ2, we embarked on a tailored FRISM evolutionary strategy (fig. S6), which started with an in silico approach, using AlphaFold2, RoseTTAFold All-Atom, and homology modeling for predicting the enzyme’s atomic structure, subsequently validated through all-atom explicit solvent molecular dynamics (MD) simulations (figs. S7 to S9). Molecular docking was then applied to discern ~70 critical mutation hotspots (fig. S10), facilitating the creation of a targeted mutation library by assessing the binding energy alterations of these identified sites. As shown in Fig. 2A ΔΔ G mut ¯ t ΔΔ G mut ¯ Fig. 2B Fig. 2C Fig. 2D Fig. 2. Virtual screening of potential mutation hotspots for UGT75AJ2. ( A ΔΔ G mut ¯ ΔΔ G mut ¯ > B ΔΔ G mut ¯ ΔΔ G mut ¯ > C D ΔΔ G mut ¯ > Enhancing UGT75AJ2 catalytic activity To enhance the catalytic activity of UGT75AJ2, we targeted these 34 hotspot residues identified for mutation to alanine using site-directed mutagenesis, assessing the impact on catalytic performance toward substrate C3G ( 1 Fig. 3B 1 O 1a Fig. 3. Tailored directed evolution strategy to enhance UGT75AJ2 activity. ( A B 1 1a C 1a D 1a E 1a F G UGTs are recognized for catalyzing S N 48 17 Leveraging the mutant Mut1-1 (S367A), which showed the most significant enhancement in catalytic activity in the initial round of alanine scanning, we targeted the V274A mutant, which showed sevenfold catalytic activity improvement compared to the WT, for further ISM (fig. S17). This approach led to the construction of 19 mutants, built upon the Mut1-1 template. Among these, the double mutant Mut2-1 (S367A/V274A) showcased an impressive 2.5- and 45-fold increase in activity over Mut1-1 and WT, respectively ( Fig. 3C 49 50 82 82 Fig. 3D k cat K m In the evolutionary process, mutations that enhance protein functionality tend to be naturally selected and conserved ( 51 42 O 132 Fig. 3, E and F V. corymbosum Aralia cordata O Escherichia coli O O To further elucidate the mechanisms of improved catalytic activity of UGT75AJ2, we performed molecular docking and MD simulations. The results revealed an increase in hydrogen bonding and hydrophobic interactions within the Mut4-1 complex compared to the WT complex (figs. S28; S29, A to D; and S30 to S31), mainly due to the contributions of the mutated residues S367A, V274A, and I132T. These interactions helped stabilize the enzyme’s catalytic conformation. MD simulations further highlighted the stability of Mut4-1 in the presence of UDP-Glc and C3G, surpassing that of the WT complex (fig. S29, E and F). In addition, the active site of Mut4-1 exhibited increased flexibility, particularly in four N-terminal loops (loop2, loop5, loop7, and loop9), implying an improved capacity for substrate binding (fig. S29G). This structural flexibility was complemented by a closer proximity between C3G 3′-O atom and UDP-Glc anomeric C atom in Mut4-1 compared to WT (fig. S29H). Volume measurements confirmed that the active site pocket of Mut4-1 was larger than that of WT, thus favoring the ligand interactions (fig. S29, I and J). These collective structural adjustments significantly amplify UGT75AJ2’s catalytic activity in the Mut4-1 variant. To determine the most favorable conditions for UGT75AJ2 catalysis, we tested a variety of substrates, including C3G ( 1 O 4 O 5 O 7 O 9 O 12 2+ Broadening the substrate spectrum of UGT75AJ2 and its Mut4-1 mutant To assess the substrate versatility of UGT75AJ2 and its enhanced variant Mut4-1 in glycosylation reactions, we evaluated 36 flavonoids with pharmaceutical potential ( Fig. 4B 1 13 14 17 18 21 22 24 25 28 29 30 31 36 Fig. 4B Fig. 4A O O Fig. 4A 23 31 36 23 52 53 14 18 Fig. 4. Substrate scope of WT and Mut4-1. ( A 1 13 14 17 18 21 22 24 25 28 29 30 31 36 B Expanding sugar donor compatibility of UGT75AJ2 To further explore the sugar donor specificity of UGT75AJ2, we assessed its activity with UDP-galactose (UDP-Gal), UDP–glucuronic acid (UDP-GlcA), UDP- N 1 15 Fig. 5, D and E Fig. 5A Fig. 5B Fig. 5C 1 Fig. 5D Fig. 5E Fig. 5. Sequence-based protein engineering improvement of the sugar donor selectivity of UGT75AJ2. ( A B C D E 1 15 F G N H 1 I 1 J 15 Molecular docking of UDP-GlcNAc and UGT75AJ2 revealed that F366 was positioned near the 2- N Fig. 5, F and G Fig. 5H Fig. 5H Fig. 5, I and J 15 Fig. 5J Further MD simulations of the WT complex, incorporating sugar donors and acceptors, demonstrated that the crucial catalytic residue H17 engaged in unwanted hydrogen bonding with the glycosyl donor (figs. S75 to S80, A and G), which hindered the formation of the His-acceptor dyad intermediate, thus preventing WT from engaging with various glycosyl donors. In contrast, within the GHG mutant (S14G/F366H/S367G), not only was the substrate able to achieve a correct catalytic alignment with H17, reinforcing the protein’s structural integrity (figs. S75 to S80), but the proximity between the nucleophilic oxygen and the anomeric carbon also significantly decreased in the GHG complex relative to the WT (figs. S75 to S80, E, F, K, and L). These alterations enhanced the glycosyl donor versatility observed in the GHG mutant. Enhancing the regioselectivity of UGT75AJ2 To further assess the regioselectivity of WT UGT75AJ2 and its Mut4-1 mutant, enzyme activity assays were conducted using C3G ( 1 18 O O A thorough investigation into the active site pinpointed 18 residues suitable for an exhaustive series of saturated virtual mutations ( Fig. 6, A and C Fig. 6, D and E 54 55 Fig. 6F 1 18 Fig. 6. The regioselectivity modification of UGT75AJ2. ( A B C D E G mut F G H 1 I 18 J K The HPLC results of mutant library screening revealed that the I132E and S367F mutants exhibited highly regioselective activity, facilitating 3′- O O 1 Fig. 6, H and J O O In addition, mutants I132E and S367G showed strict selectivity for the 3′- O O- 18 Fig. 6, I and K O 1 O 18 18 O O 18 O O Subsequently, to refine mutants with superior regioselectivity and efficiency for substrate C3G ( 1 Fig. 6G O Fig. 6, H and J O 17 O 75 178 188 1 O For enhancing 7- O O 1b Fig. 6J O 17 273 367 112 O DISCUSSION Emerging research underscores the medicinal potential of flavonoid glycosides and their derivatives due to their robust biological activities and chemical stability ( 19 O 56 57 O O 30 V. corymbosum O O To address these challenges, we first designed a targeted structure-guided directed evolution strategy to optimize the UGT75AJ2 enzyme for efficient glycosylation applications ( 32 35 1 K m K m k cat K m −1 −1 et al. 58 O K m k cat K m −1 −1 −1 −1 58 et al. 59 K m k cat K m −1 −1 59 et al. 60 K m k cat K m −1 −1 −1 −1 60 Moreover, the high degree of sugar donor promiscuity is as important as the broader substrate spectrum of glycosyltransferases in natural drug discovery ( 61 59 62 O 63 O 64 O O 65 67 68 69 Despite these advances, our observations revealed that the WT UGT75AJ2 is restricted to using only UDP-Glc. Although the Mut4-1 mutant can act on other sugar donors like UDP-Gal, UDP-GlcNAc, and UDP-Xyl, its transfer rates remain suboptimal. This study represented the comprehensive structure-guided sequence analysis of the sugar donor binding region in UGT75AJ2. By comparing residues across five zones (A to E) with those of other highly promiscuous glycosyltransferases, we were able to engineer the UGT75AJ2 enzyme to construct the triple mutant S14G/F366H/S367G. This mutant showed significantly improved catalytic activities over Mut4-1, particularly with apigenin ( 15 In addition to enhancing donor promiscuity, engineering the regioselectivity of glycosyltransferase to meet the requirements for specific site glycosylation is also a major challenge in the natural drug synthesis field ( 20 25 70 35 In response, we further devised a strategy to engineer UGT75AJ2’s regioselectivity using a FRISM-based combinatorial mutagenesis approach, eliminating the need for large mutation libraries. Key active site residues identified through virtual screening were mutated to alter the pocket’s conformation and properties. In particular, residues 132 and 367 were pinpointed as crucial for regioselectivity, leading to further saturation mutagenesis. Combinatorial mutagenesis on the highest regioselectivity mutants yielded two triple mutants, Y75E/F185Y/I132T and L112F/M273E/S367D, with 99 and 85% selectivity for the 3′- O O 1 O O O 1 O O O 71 72 18 Overall, this study marks a notable leap forward in the field of O MATERIALS AND METHODS Reagents Cyanidin-3,5- O 1c 16 O 16a O 19a 21 22 O 14c O O 18a O 18c 23 O 24a O 22b 28 O 27a 15 17 19 24 25 30 14 18 20 27 d RNA sequencing analysis and annotation Total RNA was extracted from matured or unmatured blueberry ( V. corymbosum https://www.bgi.com/global/service/dr-tom Phylogenetic analysis of UGT75AJ2 The phylogenetic tree was conducted using the neighbor-joining method based on ClustalW multiple alignments using MEGA 7 software. The figure of the phylogenetic tree was embellished through the online website iTOL ( https://itol.embl.de/ Rational design of mutations in UGT75AJ2 All the selected active residues were separately mutated to alanine using primers (table S7) containing GCG codon at specified sites. ISM was conducted using degenerate primer NNK (table S11) on plasmid template from the last round of mutation. The other specific primers for site-directed or combined mutagenesis are provided in tables S8 to S10, S12, and S13. All different mutants were created by the recombinant vector pET32a-UGT75AJ2. First, the whole mutant plasmids were obtained by PCR using KOD One PCR Master Mix-Blue-polymerase and primers. Next, the PCR product was incubated with DMT enzyme (TransGen, Beijing) at 30°C for 1 hour. Electrophoresis of the incubated product was identified, and the product was purified by gel extraction kit. The mutant PCR product was sent to Tsingke Biotechnology for sequencing. Last, the pure PCR product was transformed into DMT competent cells, followed by heterologous expression as described above. The catalytic activity of mutants was measured in 200 μl of the reaction buffer, including 50 μg of purified mutants, 0.5 mM acceptor, 1.0 mM UDP-Glc, and 50 mM tris-HCl. A unit of enzyme activity was defined as the amount of enzyme required to consume 1 μmol of substrate per minute. Statistical analysis Statistical analysis was conducted using Prism 8.0 (GraphPad, USA). Data were presented as means ± standard deviation of at least three independent experiments. The normality and the homogeneity of variance were checked by Shapiro-Wilk test before applying Student’s t t P Acknowledgments We thank Y. Liu from the College of Life Sciences at Zhejiang University for technical assistance with the nuclear magnetic resonance analysis. We are also grateful for the assistance provided by L. Wang in performing the MD simulation analysis. Funding: Author contributions: Competing interests: Data and materials availability: Supplementary Materials This PDF file includes: Supplementary Methods Figs. S1 to S91 Tables S1 to S24 References REFERENCES AND NOTES 1 N. Shen T. Wang Q. Gan S. Liu L. Wang B. Jin Plant flavonoids: Classification, distribution, biosynthesis, and antioxidant activity Food Chem. 383 132531 2022 35413752 10.1016/j.foodchem.2022.132531 2 H. Vissenaekens H. Criel C. Grootaert K. Raes G. Smagghe J. V. Camp Flavonoids and cellular stress: A complex interplay affecting human health Crit. Rev. Food Sci. Nutr. 62 8535 8566 2021 34098806 10.1080/10408398.2021.1929822 3 H. Lan H. Wang C. Chen W. Hu C. Ai L. Chen H. Teng Flavonoids and gastrointestinal health: Single molecule for multiple roles Crit. Rev. Food Sci. Nutr. 64 10987 11005 2024 37409462 10.1080/10408398.2023.2230501 4 X. Fan Z. Fan Z. Yang T. Huang Y. Tong D. Yang X. Mao M. Yang Flavonoids-Natural gifts to promote health and longevity Int. J. Mol. Sci. 23 2176 2022 35216290 10.3390/ijms23042176 PMC8879655 5 S. R. Alizadeh M. A. Ebrahimzadeh Quercetin derivatives: Drug design, development, and biological activities, a review Eur. J. Med. Chem. 229 114068 2022 34971873 10.1016/j.ejmech.2021.114068 6 B. Hao Z. Yang H. Liu Y. Liu S. Wang Advances in flavonoid research: sources, biological activities, and developmental prospectives Curr. Issues Mol. Biol. 46 2884 2925 2024 38666911 10.3390/cimb46040181 PMC11049524 7 M. Serafini I. Peluso A. Raguzzini Flavonoids as anti-inflammatory agents Proc. Nutr. Soc. 69 273 278 2010 20569521 10.1017/S002966511000162X 8 Q. Li Y. Wang Y. Mai H. Li Z. Wang J. Xu X. He Health benefits of the flavonoids from onion: Constituents and their pronounced antioxidant and anti-neuroinflammatory capacities J. Agric. Food Chem. 68 799 807 2020 31893634 10.1021/acs.jafc.9b07418 9 C. Sarkar P. Chaudhary S. Jamaddar P. Janmeda M. Mondal M. S. Mubarak M. T. Islam Redox activity of flavonoids: Impact on human health, therapeutics, and chemical safety Chem. Res. Toxicol. 35 140 162 2022 35045245 10.1021/acs.chemrestox.1c00348 10 M. Thakur M. Singh S. Kumar V. P. Dwivedi T. C. Dakal V. Yadav A reappraisal of the antiviral properties of and immune regulation through dietary phytochemicals ACS Pharmacol. Transl. Sci. 6 1600 1615 2023 37974620 10.1021/acsptsci.3c00178 PMC10644413 11 M. Samec A. Mazurakova V. Lucansky L. Koklesova R. Pecova M. Pec O. Golubnitschaja R. K. Al-Ishaq M. Caprnda L. Gaspar R. Prosecky K. Gazdikova M. Adamek D. Büsselberg P. Kruzliak P. Kubatka Flavonoids attenuate cancer metabolism by modulating lipid metabolism, amino acids, ketone bodies and redox state mediated by Nrf2 Eur. J. Pharmacol. 949 175655 2023 36921709 10.1016/j.ejphar.2023.175655 12 N. Duan X. Hu R. Zhou Y. Li W. Wu N. Liu A review on dietary flavonoids as modulators of the tumor microenvironment Mol. Nutr. Food Res. 67 e2200435 2023 36698331 10.1002/mnfr.202200435 13 L. G. S. Ponte I. C. B. Pavan M. C. S. Mancini L. G. S. da Silva A. P. Morelli M. B. Severino R. M. N. Bezerra F. M. Simabuco The hallmarks of flavonoids in cancer Molecules 26 2029 2021 33918290 10.3390/molecules26072029 PMC8038160 14 H. Teng Y. Zheng H. Cao Q. Huang J. Xiao L. Chen Enhancement of bioavailability and bioactivity of diet-derived flavonoids by application of nanotechnology: A review Crit. Rev. Food Sci. Nutr. 63 378 393 2021 34278842 10.1080/10408398.2021.1947772 15 L. J. Osborn K. Schultz W. Massey B. DeLucia I. Choucair V. Varadharajan R. Banerjee K. Fung A. J. Horak D. Orabi I. Nemet L. E. Nagy Z. Wang D. S. Allende B. B. Willard N. Sangwan A. M. Hajjar C. McDonald P. P. Ahern S. L. Hazen J. M. Brown J. Claesen A gut microbial metabolite of dietary polyphenols reverses obesity-driven hepatic steatosis Proc. Natl. Acad. Sci. U.S.A. 119 e2202934119 2022 36417437 10.1073/pnas.2202934119 PMC9860326 16 J.-L. Tian X. Si Y.-H. Wang E.-S. Gong X. Xie Y. Zhang B. Li C. Shu Bioactive flavonoids from Rubus corchorifolius Food Chem. 341 128149 2021 33039745 10.1016/j.foodchem.2020.128149 17 S. Sirirungruang C. R. Barnum S. N. Tang P. M. Shih Plant glycosyltransferases for expanding bioactive glycoside diversity Nat. Prod. Rep. 40 1170 1180 2023 36853278 10.1039/d2np00077f 18 W. Zhang S. Wang J. Yang C. Kang L. Huang L. Guo Glycosylation of plant secondary metabolites: Regulating from chaos to harmony Environ. Exp. Bot. 194 104703 2022 19 S. Alseekh L. Perez de Souza M. Benina A. R. Fernie The style and substance of plant flavonoid decoration; towards defining both structure and function Phytochemistry 174 112347 2020 32203741 10.1016/j.phytochem.2020.112347 20 Y. Ji B. Li M. Qiao J. Li H. Xu L. Zhang X. Zhang Advances on the in vivo in vitro Appl. Microbiol. Biotechnol. 104 6587 6600 2020 32514754 10.1007/s00253-020-10667-z 21 T. Wei X. Ji J. Xue Y. Gao X. Zhu G. Xiao Cyanidin-3- O in vivo Food Funct. 12 387 396 2021 33326533 10.1039/d0fo02107e 22 M. A. Mirza S. Mahmood A. R. Hilles A. Ali M. Z. Khan S. A. A. Zaidi Z. Iqbal Y. Ge Quercetin as a therapeutic product: Evaluation of its pharmacological action and clinical applications-A review Pharmaceuticals 16 1631 2023 38004496 10.3390/ph16111631 PMC10674654 23 M. T. Yasuda K. Fujita T. Hosoya S. Imai K. Shimoi Absorption and metabolism of luteolin and its glycosides from the extract of Chrysanthemum morifolium J. Agric. Food Chem. 63 7693 7699 2015 25843231 10.1021/acs.jafc.5b00232 24 K. Xu X. Ren J. Wang Q. Zhang X. Fu P.-C. Zhang Clinical development and informatics analysis of natural and semi-synthetic flavonoid drugs: A critical review J. Adv. Res. 63 269 284 2024 37949300 10.1016/j.jare.2023.11.007 PMC11380023 25 J. Yao X. Xing L. Yu Y. Wang X. Zhang L. Zhang Structure function relationships in plant UDP-glycosyltransferases Ind. Crop. Prod. 189 115784 2022 26 P. Li Y.-J. Li F.-J. Zhang G.-Z. Zhang X.-Y. Jiang H.-M. Yu B.-K. Hou The Arabidopsis UDP-glycosyltransferases UGT79B2 and UGT79B3, contribute to cold, salt and drought stress tolerance via modulating anthocyanin accumulation Plant J. 89 85 103 2016 27599367 10.1111/tpj.13324 27 S. Wang S. Sun Z. Du F. Gao Y. Li W. Han R. Wu X. Yu Characterization of CsUGT73AC15 as a multifunctional glycosyltransferase impacting flavonol triglycoside biosynthesis in tea plants J. Agric. Food Chem. 72 13328 13340 2024 38805380 10.1021/acs.jafc.4c03824 28 R. Horiuchi Y. Nishizaki N. Okawa A. Ogino N. Sasaki Identification of the biosynthetic pathway for anthocyanin triglucoside, the precursor of polyacylated anthocyanin, in red cabbage J. Agric. Food Chem. 68 9750 9758 2020 32786819 10.1021/acs.jafc.0c03480 29 K. Chen Z.-M. Hu W. Song Z.-L. Wang J.-B. He X.-M. Shi Q.-H. Cui X. Qiao M. Ye Diversity of O Glycyrrhiza uralensis ACS Synth. Biol. 8 1858 1866 2019 31284719 10.1021/acssynbio.9b00171 30 X. Jian C. Li X. Feng Strategies for modulating transglycosylation activity, substrate specificity, and product polymerization degree of engineered transglycosylases Crit. Rev. Biotechnol. 43 1284 1298 2022 36154438 10.1080/07388551.2022.2105687 31 C. H. Hsu S. C. Hung C. Y. Wu C. H. Wong Toward automated oligosaccharide synthesis Angew. Chem. Int. Ed. Engl. 50 11872 11923 2011 22127846 10.1002/anie.201100125 32 X. Sun Z. Ke D. Zheng M. She Z. Wu Q. X. Li Z. Zhang Cloning, expression, and functional characterization of two highly efficient flavonoid-di- O Zea mays J. Agric. Food Chem. 72 7354 7363 2024 38511857 10.1021/acs.jafc.3c06327 33 M. Wang Q. Ji B. Lai Y. Liu K. Mei Structure-function and engineering of plant UDP-glycosyltransferase Comput. Struct. Biotechnol. J. 21 5358 5371 2023 37965058 10.1016/j.csbj.2023.10.046 PMC10641439 34 R. M. P. Siloto R. J. Weselake Site saturation mutagenesis: Methods and applications in protein engineering Biocatal. Agric. Biotechnol. 1 181 189 2012 35 Y. Bao Y. Xu X. Huang Focused rational iterative site-specific mutagenesis (FRISM): A powerful method for enzyme engineering Mol. Catal. 553 113755 2024 36 J. Xu Y. Cen W. Singh J. Fan L. Wu X. Lin J. Zhou M. Huang M. T. Reetz Q. Wu Stereodivergent protein engineering of a lipase to access all possible stereoisomers of chiral esters with two stereocenters J. Am. Chem. Soc. 141 7934 7945 2019 31023008 10.1021/jacs.9b02709 37 M. T. Reetz M. Bocola J. D. Carballeira D. Zha A. Vogel Expanding the range of substrate acceptance of enzymes: Combinatorial active-site saturation test Angew. Chem. Int. Ed. Engl. 44 4192 4196 2005 15929154 10.1002/anie.200500767 38 S. Singh K. A. Patel P. D. Sonawane R. K. Vishwakarma B. M. Khan Enhanced activity of Withania somnifera World J. Microbiol. Biotechnol. 34 150 2018 30255239 10.1007/s11274-018-2534-4 39 Z. Wen Z.-M. Zhang L. Zhong J. Fan M. Li Y. Ma Y. Zhou W. Zhang B. Guo B. Chen J.-B. Wang Directed evolution of a plant glycosyltransferase for chemo- and regioselective glycosylation of pharmaceutically significant flavonoids ACS Catal. 11 14781 14790 2021 40 J. Li J. Yang S. Mu N. Shang C. Liu Y. Zhu Y. Cai P. Liu J. Lin W. Liu Y. Sun Y. Ma Efficient O ACS Catal. 10 3629 3639 2020 41 J. Li G. Qu N. Shang P. Chen Y. Men W. Liu Z. Mei Y. Sun Z. Sun Near-perfect control of the regioselective glucosylation enabled by rational design of glycosyltransferases Green Synth. Catal. 2 45 53 2021 42 Y. Zhuang G.-Y. Yang X. Chen Q. Liu X. Zhang Z. Deng Y. Feng Biosynthesis of plant-derived ginsenoside Rh2 in yeast via repurposing a key promiscuous microbial enzyme Metab. Eng. 42 25 32 2017 28479190 10.1016/j.ymben.2017.04.009 43 P. R. Denish J.-A. Fenger R. Powers G. T. Sigurdson L. Grisanti K. G. Guggenheim S. Laporte J. Li T. Kondo A. Magistrato M. P. Moloney M. Riley M. Rusishvili N. Ahmadiani S. Baroni O. Dangles M. Giusti T. M. Collins J. Didzbalis K. Yoshida J. B. Siegel R. J. Robbins Discovery of a natural cyan blue: A unique food-sourced anthocyanin could replace synthetic brilliant blue Sci. Adv. 7 eabe7871 2021 33827818 10.1126/sciadv.abe7871 PMC8026139 44 A. Agarwal N. Thakor L. Manani P. Prajapati G. M. Elossaily B. G. Prajapati Exploring anthocyanins: Unveiling sources, analytical techniques, and biological activities Curr. Med. Chem. 32 4742 4761 2025 38910490 10.2174/0109298673310694240605074429 45 P. I. Mackenzie K. W. Bock B. Burchell C. Guillemette S. Ikushiro T. Iyanagi J. O. Miners I. S. Owens D. W. Nebert Nomenclature update for the mammalian UDP glycosyltransferase (UGT) gene superfamily Pharmacogenet. Genomics 15 677 685 2005 16141793 10.1097/01.fpc.0000173483.13689.56 46 X. Wang Y. Cao S. Chen J. Lin J. Bian D. Huang Anti-inflammation activity of flavones and their structure-activity relationship J. Agric. Food Chem. 69 7285 7302 2021 34160206 10.1021/acs.jafc.1c02015 47 X. Z. He X. Wang R. A. Dixon Mutational analysis of the Medicago glycosyltransferase UGT71G1 reveals residues that control regioselectivity for (iso)flavonoid glycosylation J. Biol. Chem. 281 34441 34447 2006 16982612 10.1074/jbc.M605767200 48 M. Y. Ali F. Liaqat M. I. Khazi S. Sethupathy D. Zhu Utilization of glycosyltransferases as a seamless tool for synthesis and modification of the oligosaccharides-A review Int. J. Biol. Macromol. 249 125916 2023 37527764 10.1016/j.ijbiomac.2023.125916 49 Z. Xu L.-L. Hong C.-S. Liu J.-Q. Kong Protein engineering of PhUGT, a donor promiscuous glycosyltransferase, for the improved enzymatic synthesis of antioxidant quercetin 3- O N J. Agric. Food Chem. 70 4076 4085 2022 35321541 10.1021/acs.jafc.2c01029 50 T. Wu Y. Wang N. Zhang D. Yin Y. Xu Y. Nie X. Mu Reshaping substrate-binding pocket of leucine dehydrogenase for bidirectionally accessing structurally diverse substrates ACS Catal. 13 158 168 2023 51 J. L. King T. H. Jukes Non-Darwinian evolution Science 164 788 798 1969 5767777 10.1126/science.164.3881.788 52 J. He M. M. Giusti Anthocyanins: Natural colorants with health-promoting properties Annu. Rev. Food Sci. Technol. 1 163 187 2010 22129334 10.1146/annurev.food.080708.100754 53 T. P. Ijinu L. F. D. Lellis S. Shanmugarama R. Pérez-Gregorio P. Sasikumar H. Ullah D. G. Buccato A. D. Minno A. Baldi M. Daglia Anthocyanins as immunomodulatory dietary supplements: A nutraceutical perspective and micro−/nano-strategies for enhanced bioavailability Nutrients 15 4152 2023 37836436 10.3390/nu15194152 PMC10574533 54 J. Zhou M. Huang Navigating the landscape of enzyme design: From molecular simulations to machine learning Chem. Soc. Rev. 53 8202 8239 2024 38990263 10.1039/d4cs00196f 55 Z. Liu X. Fu M. Yuan Q. Liang C. Zhu H. Mou Surface charged amino acid-based strategy for rational engineering of kinetic stability and specific activity of enzymes: Linking experiments with computational modeling Int. J. Biol. Macromol. 182 228 236 2021 33831449 10.1016/j.ijbiomac.2021.03.198 56 X. Zhang R. Rehman S. Wang Y. Ji J. Li S. Liu H. Wang Blue honeysuckle extracts retarded starch digestion by inhibiting glycosidases and changing the starch structure Food Funct. 13 6072 6088 2022 35550649 10.1039/d2fo00459c 57 M. Kozuka T. Yamane Y. Nakano T. Nakagaki I. Ohkubo H. Ariga Identification and characterization of a dipeptidyl peptidase IV inhibitor from aronia juice Biochem. Biophys. Res. Commun. 465 433 436 2015 26296465 10.1016/j.bbrc.2015.08.031 58 Z. Wang X. Du G. Ye H. Wang Y. Liu C. Liu F. Li H. Ågren Y. Zhou J. Li C. He D.-A. Guo M. Ye Functional characterization, structural basis, and protein engineering of a rare flavonoid 2′- O Scutellaria baicalensis Acta Pharm. Sin. B 14 3746 3759 2024 39220864 10.1016/j.apsb.2024.04.001 PMC11365401 59 W. Huang Y. He R. Jiang Z. Deng F. Long Functional and structural dissection of a plant steroid 3- O ACS Catal. 12 2927 2937 2022 60 B. Guo Z. Deng F. Meng Q. Wang Y. Zhang Z. Yuan Y. Rao Enhancement of rebaudioside M production by structure-guided engineering of glycosyltransferase UGT76G1 J. Agric. Food Chem. 70 5088 5094 2022 35417157 10.1021/acs.jafc.2c01209 61 S. Liu M. Zhang Y. Bao K. Chen L. Xu H. Su Y. Kuang Z. Wang X. Qiao M. Ye Characterization of a highly selective 2″- O Trollius chinensis Org. Lett. 23 9020 9024 2021 34558900 10.1021/acs.orglett.1c02581 62 H.-T. Wang Z.-L. Wang K. Chen M.-J. Yao M. Zhang J.-H. Zhang H. Ågren F.-D. Li J. Li X. Qiao M. Ye Insights into the missing apiosylation step in flavonoid apiosides biosynthesis of Leguminosae plants Nat. Commun. 14 6658 2023 37863881 10.1038/s41467-023-42393-1 PMC10589286 63 M.-M. Liu R.-H. Ma Z.-J. Ni K. Thakur C. L. Cespedes-Acuña L. Jiang Z.-J. Wei Apigenin 7- O Food Chem. Toxicol. 146 111843 2020 33152472 10.1016/j.fct.2020.111843 64 K. A. Shams H. M. Radwan W. A. Tawfik A. A. Habib M. M. Abdel-Mohsen L. M. Abou-Setta Chemical constituents and biological activity of lipids, proteins and flavonoids of Nerium oleander Asian J. Chem. 24 223 227 2012 65 L. Wen T. He A. Yu S. Sun X. Li J. Wei R. Song X. Yan R. Li X. Ren Y. Wang X. Liu Y. Dong X. Fu G. She Breviscapine: A review on its phytochemistry, pharmacokinetics and therapeutic effects Am. J. Chin. Med. 49 1369 1397 2021 34263720 10.1142/S0192415X21500646 66 N. H. Du R.-L. Xiong T.-T. Zhu X.-Y. Liu J.-Z. Zhang J. Fu H.-L. Wang H.-X. Lou A.-X. Cheng Efficient production of flavonoid glucuronides in Escherichia coli O Marchantia polymorpha J. Nat. Prod. 87 228 237 2024 38266493 10.1021/acs.jnatprod.3c00880 67 H. M. Motawe H. E. Wahba A. Y. Ibrahim Biological studies of flavonoids from flowers and herb of Zinnia Pauciflora World J. Pharm. Pharm. Sci. 3 1025 1282 2015 68 Q. Chen X. Liu Y. Hu Y. Wang B. Sun T. Chen Y. Luo Y. Zhang M. Li Z. Liu X. Wang H. Tang Broaden the sugar donor selectivity of blackberry glycosyltransferase UGT78H2 through residual substitutions Int. J. Biol. Macromol. 166 277 287 2021 33129904 10.1016/j.ijbiomac.2020.10.184 69 Y.-N. Liu L.-L. Hong M. Liu Q.-C. Guo J.-Q. Kong Glycodiversifying testosterone with a promiscuous glycosyltransferase OsSGT2 from Ornithogalum saundersiae ACS Synth. Biol. 10 3583 3594 2021 34846134 10.1021/acssynbio.1c00532 70 J. B. McArthur X. Chen Glycosyltransferase engineering for carbohydrate synthesis Biochem. Soc. Trans. 44 129 142 2016 26862198 10.1042/BST20150200 PMC5764748 71 T. Yamane M. Imai S. Handa K. Yamada T. Sakamoto T. Ishida H. Inui Y. Yamamoto T. Nakagaki Y. Nakano Reduction of blood glucose and HbA1c levels by cyanidin 3,5-diglucoside in KKAy mice J. Funct. Foods 58 21 26 2019 72 W. Yue F. Han Effects of monoglucoside and diglucoside anthocyanins from Yan 73 ( Vitis vinifera Vitis davidii in vitro Food Chem. X 16 100501 2022 36519088 10.1016/j.fochx.2022.100501 PMC9743158 73 L. Xie Y. Lu Y. Zhou X. Hao W. Chen Functional analysis of a methyltransferase involved in anthocyanin biosynthesis from blueberries ( Vaccinium corymbosum J. Agric. Food Chem. 70 16253 16262 2022 36519893 10.1021/acs.jafc.2c06743 74 B. Shrestha R. P. Pandey S. Darsandhari P. Parajuli J. K. Sohng Combinatorial approach for improved cyanidin 3- O Escherichia coli Microb. Cell Fact. 18 7 2019 30654816 10.1186/s12934-019-1056-6 PMC6335687 75 A. Waterhouse M. Bertoni S. Bienert G. Studer G. Tauriello R. Gumienny F. T. Heer T. A. P. de Beer C. Rempfer L. Bordoli R. Lepore T. Schwede SWISS-MODEL: Homology modelling of protein structures and complexes Nucleic Acids Res. 46 W296 W303 2018 29788355 10.1093/nar/gky427 PMC6030848 76 M. Mirdita K. Schütze Y. Moriwaki L. Heo S. Ovchinnikov M. Steinegger ColabFold: Making protein folding accessible to all Nat. Methods 19 679 682 2022 35637307 10.1038/s41592-022-01488-1 PMC9184281 77 R. Krishna J. Wang W. Ahern P. Sturmfels P. Venkatesh I. Kalvet G. R. Lee F. S. Morey-Burrows I. Anishchenko I. R. Humphreys R. McHugh D. Vafeados X. Li G. A. Sutherland A. Hitchcock C. N. Hunter A. Kang E. Brackenbrough A. K. Bera M. Baek F. DiMaio D. Baker Generalized biomolecular modeling and design with RoseTTAFold All-Atom Science 384 eadl2528 2024 38452047 10.1126/science.adl2528 78 A. L. Morris M. W. MacArthur E. G. Hutchinson J. M. Thornton Stereochemical quality of protein structure coordinates Proteins 12 345 364 1992 1579569 10.1002/prot.340120407 79 R. A. Laskowski, M. W. MacArthur, J. M. Thornton, “ PROCHECK International Tables for Crystallography 80 D. S. Goodsell M. F. Sanner A. J. Olson S. Forli The AutoDock suite at 30 Protein Sci. 30 31 43 2020 32808340 10.1002/pro.3934 PMC7737764 81 T. Hiromoto E. Honjo N. Noda T. Tamada K. Kazuma M. Suzuki M. Blaber R. Kuroki Structural basis for acceptor-substrate recognition of UDP-glucose: Anthocyanidin 3- O Clitoria ternatea Protein Sci. 24 395 407 2015 25556637 10.1002/pro.2630 PMC4353365 82 M. Wei X. Gao W. Zhang C. Li F. Lu L. Guan W. Liu J. Wang F. Wang H.-M. Qin Enhanced thermostability of an l d J. Agric. Food Chem. 71 15713 15722 2023 37823838 10.1021/acs.jafc.3c05736 83 H. Zhou F. Wang H. Niu L. Yuan J. Tian S. Cai X. Bi L. Zhou Structural studies and molecular dynamic simulations of polyphenol oxidase treated by high pressure processing Food Chem. 372 131243 2022 34655831 10.1016/j.foodchem.2021.131243 84 R. Pearce Y. Zhang Toward the solution of the protein structure prediction problem J. Biol. Chem. 297 100870 2021 34119522 10.1016/j.jbc.2021.100870 PMC8254035 85 M. J. Pietal J. M. Bujnicki L. P. Kozlowski GDFuzz3D: A method for protein 3D structure reconstruction from contact maps, based on a non-Euclidean distance function Bioinformatics 31 3499 3505 2015 26130575 10.1093/bioinformatics/btv390 86 L. Cui A. Cui Q. Li L. Yang H. Liu W. Shao Y. Feng Molecular evolution of an aminotransferase based on substrate-enzyme binding energy analysis for efficient valienamine synthesis ACS Catal. 12 13703 13714 2022 87 M. Aldeghi V. Gapsys B. L. de Groot Accurate estimation of ligand binding affinity changes upon protein mutation ACS Cent. Sci. 4 1708 1718 2018 30648154 10.1021/acscentsci.8b00717 PMC6311686 88 H. Qi T. Wang H. Li C. Li L. Guan W. Liu J. Wang F. Lu S. Mao H.-M. Qin Sequence- and structure-based mining of thermostable D-allulose 3-epimerase and computer-guided protein engineering to improve enzyme activity J. Agric. Food Chem. 71 18431 18442 2023 37970673 10.1021/acs.jafc.3c07204 89 H. Ashkenazy S. Abadi E. Martz O. Chay I. Mayrose T. Pupko N. Ben-Tal ConSurf 2016: An improved methodology to estimate and visualize evolutionary conservation in macromolecules Nucleic Acids Res. 44 W344 W350 2016 27166375 10.1093/nar/gkw408 PMC4987940 ",
  "metadata": {
    "Title of this paper": "ConSurf 2016: An improved methodology to estimate and visualize evolutionary conservation in macromolecules",
    "Journal it was published in:": "Science Advances",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12494026/"
  }
}