{
  "title": "Paper_1162",
  "abstract": "pmc Nat Commun Nat Commun 2873 ncomms Nature Communications 2041-1723 Nature Publishing Group PMC12474925 PMC12474925.1 12474925 12474925 41006289 10.1038/s41467-025-63500-4 63500 1 Article Gtf2i Sox10 Mbp http://orcid.org/0000-0001-8024-8927 Levy Gilad 1 Rokach May 1 Fischer Inbar 1 Kimchi-Feldhorn Omri 1 Shoob Shiri 2 Bar Ela 3 4 Rosenberg Tali 5 Bartman Joanna 5 Parnas Hadar 5 Grad Meitar 1 Israel-Elgali Ifat 1 2 Sfadia Galit E. 3 Trangle Sari S. 3 Vainshtein Anna 6 Eisenbach Yael Eshed 6 http://orcid.org/0000-0002-3397-8924 Jahn Olaf 7 8 Siems Sophie B. 9 http://orcid.org/0000-0002-7710-5738 Werner Hauke B. 9 10 Shomron Noam 1 2 http://orcid.org/0000-0001-6828-7595 Assaf Yaniv 1 4 http://orcid.org/0000-0002-3325-0597 Peles Elior 6 http://orcid.org/0000-0002-0700-2266 Slutsky Inna 1 2 11 http://orcid.org/0000-0003-1804-5787 Marco Asaf 5 http://orcid.org/0000-0001-9724-4578 Barak Boaz boazba@tauex.tau.ac.il 1 3 4 1 https://ror.org/04mhzgx49 grid.12136.37 0000 0004 1937 0546 Sagol School of Neuroscience, Tel-Aviv University, 2 https://ror.org/04mhzgx49 grid.12136.37 0000 0004 1937 0546 Gray Faculty of Medical and Health Sciences, Tel-Aviv University, 3 https://ror.org/04mhzgx49 grid.12136.37 0000 0004 1937 0546 Faculty of Social Sciences, School of Psychological Sciences, Tel-Aviv University, 4 https://ror.org/04mhzgx49 grid.12136.37 0000 0004 1937 0546 Faculty of Life Sciences, School of Neurobiology, Biochemistry & Biophysics, Tel-Aviv University, 5 https://ror.org/03qxff017 grid.9619.7 0000 0004 1937 0538 The Robert H. Smith Faculty of Agriculture, Food and Environment, The Hebrew University of Jerusalem, 6 https://ror.org/0316ej306 grid.13992.30 0000 0004 0604 7563 Departments of Molecular Cell Biology and Molecular Neuroscience, The Weizmann Institute of Science, 7 https://ror.org/03av75f26 Neuroproteomics Group, Department of Molecular Neurobiology, Max Planck Institute for Multidisciplinary Sciences, 8 https://ror.org/021ft0n22 grid.411984.1 0000 0001 0482 5331 Translational Neuroproteomics Group, Department of Psychiatry and Psychotherapy, University Medical Center Göttingen, Georg-August-University, 9 https://ror.org/03av75f26 Department of Neurogenetics, Max Planck Institute for Multidisciplinary Sciences, 10 https://ror.org/01y9bpm73 grid.7450.6 0000 0001 2364 4210 Faculty of Biology and Psychology, University of Göttingen, 11 https://ror.org/04mhzgx49 grid.12136.37 0000 0004 1937 0546 Sieratzki Institute for Advances in Neuroscience, Tel-Aviv University, 26 9 2025 2025 16 478256 8518 24 7 2023 19 8 2025 26 09 2025 28 09 2025 29 09 2025 © The Author(s) 2025 2025 https://creativecommons.org/licenses/by/4.0/ Open Access http://creativecommons.org/licenses/by/4.0/ The transcriptional regulatory network governing the differentiation and functionality of oligodendrocytes (OLs) is essential for the formation and maintenance of the myelin sheath, and hence for the proper function of the nervous system. Perturbations in the intricate interplay of transcriptional effectors within this network can lead to a variety of nervous system pathologies. In this study, we identify Gtf2i Gtf2i Sox10 Mbp Gtf2i The transcriptional regulation of oligodendrocytes has an essential role in myelin formation and maintenance. Here, the authors identify the transcription factor Tfii-i as a regulator of myelin genes expression in the nervous system and show that its loss enhances myelin thickness and nerve conduction. Subject terms Cellular neuroscience Glial development Glial progenitors Oligodendrocyte Proteomics https://doi.org/10.13039/501100003977 Israel Science Foundation (ISF) https://doi.org/10.13039/501100003390 Fritz Thyssen Stiftung (Fritz Thyssen Foundation) pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement yes pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes issue-copyright-statement © Springer Nature Limited 2025 Introduction The myelin sheath is an insulating multi-lamellar membrane surrounding axons that is produced by OLs 1 2 3 4 3 7 8 9 10 11 12 13 2 14 15 13 16 17 18 21 22 During late embryonic and early postnatal stages, OL progenitor cells (OPCs) appear in the ventricular zone of the neural tube 23 24 25 26 29 30 31 During development, various extracellular signals, such as growth factors and morphogens, activate specific signaling pathways, leading to the expression of lineage-specific transcription factors (TFs) that orchestrate OL differentiation and myelination 32 36 37 38 39 40 41 34 42 43 44 45 46 48 35 40 49 53 54 61 Plp1 62 Mbp 34 63 While studies have found that TFs can increase the expression of myelination-related genes 34 62 64 65 66 67 68 GTF2I 69 70 70 71 72 73 68 74 75 76 77 78 GTF2I 79 80 86 87 88 89 90 93 94 GTF2I 95 101 GTF2I 96 102 GTF2I 95 98 100 103 105 95 97 101 104 GTF2I 106 107 102 GTF2I 108 109 110 111 We recently characterized a mouse model with a conditional homozygous deletion of Gtf2i GTF2i 20 Gtf2i 112 Gtf2i Previous comprehensive genome-wide analysis conducted on brain tissues of wild-type mice embryos demonstrated that Tfii-i (the murine protein product of Gtf2i Sox10 Mbp 113 Gtf2i Cnp-Cre 114 Gtf2i 115 Gtf2i Gtf2i Gtf2i f/f Cnp-Cre -/- 1A Gtf2i Gtf2i In seeking a mechanistic explanation for the enhanced myelination properties following Gtf2i Mbp Sox10 Gtf2i Gtf2i Results Gtf2i To validate the genetic deletion of Gtf2i 1A + Gtf2i- 1B 73 116 1B 117 Gtf2i 1B-C Gtf2i- Fig. 1 Gtf2i A + Gtf2i B + Gtf2i n n Gtf2i P −6 C F Gtf2i C n Gtf2i n P P P D n n Gtf2i P E n n Gtf2i P F n n Gtf2i P G H Gtf2i (n n Gtf2i G Gtf2i H Gtf2i B D F G H P G H B F P As Tfii-i was found to be essential for neurotypical development 9 20 68 95 118 Gtf2i 1C Gtf2i 1D Gtf2i 1E Gtf2i 1F To define whether Gtf2i 119 120 121 Gtf2i 1G Gtf2i Gtf2i 1H p 1G Axonal, myelin, and conductivity properties are altered in the CC of Gtf2i The brain-wide connectivity changes observed in Gtf2i Cnp 114 2A 3 Fig. 2 Altered axonal and myelin properties with enhanced conduction characteristics in the CC of Gtf2i A Gtf2i B g P C Gtf2i P D Gtf2i P E Gtf2i n P F Gtf2i G Gtf2i n n Gtf2i P H I Gtf2i P J P K Gtf2i L-N n n Gtf2i L Gtf2i P M P N Gtf2i P B–D n n Gtf2i I J n n Gtf2i C D E G I J L M E G I J L N P P P One extrinsic cue that affects myelination is the diameter of the axon 122 126 g 127 128 g 129 130 g 127 g 131 While g g Gtf2i 2B Gtf2i g Gtf2i Gtf2i 2C Gtf2i 132 Gtf2i 2D Gtf2i 2E Gtf2i To better capture the heterogeneity of axonal and WM properties across the CC and investigate structural and myelination abnormalities in Gtf2i 2F Gtf2i 2G Gtf2i Gtf2i 1F Gtf2i 2C 2H 3 133 134 Gtf2i 2I Gtf2i Gtf2i 2J Gtf2i Axonal conductivity is largely affected by myelin thickness and axon diameter 128 132 133 Gtf2i 2K Gtf2i 2L Gtf2i 2M Gtf2i Gtf2i 2N Gtf2i Together, these data demonstrate that the deletion of Gtf2i 4 Hypermyelination of the SN in Gtf2i Since the Cnp 3A g Gtf2i 3B-C Gtf2i g Gtf2i 3D-E Gtf2i Gtf2i 3F g Gtf2i 3G Gtf2i Gtf2i 3H g 135 Gtf2i Gtf2i 3I Gtf2i Gtf2i Fig. 3 Hypermyelination of the SN of Gtf2i A Gtf2i B g C Gtf2i g P −10 D g Gtf2i P E Gtf2i F Gtf2i P −8 G Gtf2i P H Gtf2i P I Gtf2i P J Gtf2i K Gtf2i (n P P P B D F I n n Gtf2i C F H D G I K P P While this highlights the role of Gtf2i 136 3J Gtf2i Gtf2i 3K Gtf2i Gtf2i These results indicate that Gtf2i Gtf2i Motor coordination was shown to be dependent on myelin condition 137 139 140 141 142 143 144 Gtf2i To determine whether motor coordination was affected in our test mice, both Gtf2i Gtf2i 4A To determine whether the improved performance of Gtf2i Gtf2i 4B Gtf2i 4 Gtf2i Gtf2i 4C Gtf2i Fig. 4 The behavioral phenotype of Gtf2i A Gtf2i n n Gtf2i P B Gtf2i n n Gtf2i P C n n Gtf2i Gtf2i P D E n n Gtf2i D Gtf2i - P Gtf2i - P −10 , Gtf2i E P C E A E P P P https://BioRender.com/o51w712 Among the genes deleted in WS, Gtf2i 95 98 100 104 105 Gtf2i Gtf2i Gtf2i 4D 4D Gtf2i Gtf2i 4E Gtf2i Gtf2i Together, these data suggest that Gtf2i Tfii-i reduction in mOLs results in elevated expression levels of myelin-related proteins and transcripts To assess how Tfii-i reduction in mOLs alters myelin properties on a molecular level, we examined the biochemically-enriched myelin fraction 145 Gtf2i 146 5A 1 6 Gtf2i 5A 63 147 148 Gtf2i Fig. 5 The molecular myelin framework is altered in Gtf2i A Gtf2i- n Gtf2i- Gtf2i- Cnp q q q B Gtf2i n n Gtf2i P C Mbp Gtf2i n n Gtf2i P D F D Sox10 n n Gtf2i P E Mbp n n Gtf2i P F Mog n n Gtf2i P Gtf2i G H G n n Gtf2i P H n n Gtf2i P Gtf2i I–K I Sox10 n n Gtf2i P J Mbp n n Gtf2i P K Mog n n Gtf2i P −5 Gtf2i B–K Gapdh B D F K P P P P Next, to determine whether the altered physiological and behavioral properties observed in Gtf2i Mbp 149 151 Mbp Mbp 152 5B Gtf2i 5C Gtf2i Gtf2i In searching for additional altered molecular properties in Gtf2i Mbp 34 Mbp Mog Sox10 5D Gtf2i Mbp 5E Gtf2i Mog 5F Gtf2i Gtf2i Gtf2i 153 5G Gtf2i 5H Gtf2i Sox10 5I Gtf2i Mbp 5J Gtf2i Mog 5K Gtf2i Gtf2i Overall, these molecular alterations detected in Gtf2i Exogenous viral-mediated deletion of Gtf2i To assess whether the regulation of Tfii-i on Sox10 Mbp Gtf2i Gtf2i f/f -/- 115 6A Gtf2i 6B-C 6D-E 6F-G Gtf2i Gtf2i 6H Gtf2i 154 Fig. 6 In-vitro deletion of Tfii-i from mOLs results in increased expression levels of nuclear Sox10, Mbp, and promotes cell growth . A https://BioRender.com/o51w712 B C P D E P F G P H P C E G H n n C E G P P P These findings suggest that, following Tfii-i reduction in mOLs, the observed increased expression levels of Mbp and Sox10 are a result of a cell-autonomous mechanism in mOLs, unrelated to other cell types (Supplementary Fig. 8 Tfii-i binds to Mbp Sox10 In searching for a cellular mechanism to explain the altered myelination properties in Gtf2i 9 10 + + + 10 10 11 Gtf2i As such, changes in the number of mOLs cannot account for the observed myelination and axonal alterations in Gtf2i Gtf2i To achieve this, fully differentiated mOLs, derived from primary mOL-enriched cell cultures, were subjected to chromatin immunoprecipitation followed by sequencing (ChIP-seq), targeting Tfii-i. As expected, Tfii-i peaks were highly abundant in control compared to Gtf2i 7A Gtf2i 7A 2 12A-C Gtf2i 7B 155 113 156 7C 12D-F 157 7D 36 48 158 163 Fig. 7 In mOLs, Tfii-i binds RE of Mbp Sox10. A Gtf2i B C D E F Mbp Mbp G Sox10 Sox10 Micall1 Sox10 H n Sox10 Ercc3 To dissect the specific contribution of Tfii-i to the transcriptional program of mOLs, we integrated our ChIP-seq data with a cell type-specific database of post-translational histone modifications (PTMH), which includes datasets derived specifically from mOLs 164 165 166 7E 12G 12H Mbp 7F 12I Sox10 7G 12I Mbp 164 7F 12J Mbp Although we did not observe direct Tfii-i binding at the Sox10 Sox10 167 Sox10 12K Sox10 7F 168 164 Sox10 Sox10 Ercc3 169 7H Sox10 Sox10 167 Sox10 170 171 Sox10 Collectively, our findings suggest that in mOLs, Tfii-i is involved in transcriptional regulation, with prominent engagement at key loci such as Sox10 Mbp Gtf2i Discussion In the present study, we identified Tfii-i as a regulator of the broad myelin transcriptome, affecting myelin biology by modulating the transcription of key genes such as Mbp Sox10 Gtf2i Support for this hypothesis comes from mOLs-specific ChIP-seq and 3C-qPCR data showing that Tfii-i binds to regulatory regions of Mbp Sox10 Gtf2i Sox10 Mbp Gtf2i 8 Fig. 8 Graphical summary. In mOLs, Tfii-i binds REs of the key myelination genes, Sox10 Mbp Gtf2i https://BioRender.com/o51w712 While Gtf2i 172 146 Sox10 Mbp 113 Gtf2i 113 173 174 12L-M 12M Gtf2i 114 Mbp Sox10 Sox10 Mbp We previously showed that Gtf2i 20 20 Gtf2i 70 Gtf2i 70 Gtf2i Gtf2i Gtf2i 20 Gtf2i Gtf2i 20 88 89 Gtf2i 95 98 100 103 Gtf2i Gtf2i GTF2I has been implicated in the cellular response to DNA damage and in DNA repair pathways 175 177 165 166 178 179 Myelin, OLs, and axon health are tightly regulated by one another 124 180 184 Sox10 185 144 186 Sox10 Sox10 187 Sox10 185 Sox10 159 Sox10 188 Sox10 Mbp 189 Sox10 Sox10 Gtf2i Gpr37 148 190 148 Gtf2i 114 Gtf2i Gpr37 148 Gtf2i 10 148 Gtf2i Sox10 In accordance with the increased axonal diameter 122 124 126 Gtf2i 63 Mbp 152 191 192 Mbp Gtf2i Gtf2i Variations in NoRs number and length are associated with myelination dynamics and conductivity properties 133 134 193 Gtf2i Cnp 194 Gtf2i Cnp 114 194 Cnp Cnp Cnp Gtf2i In summary, we identified Gtf2i Mbp Sox10 Gtf2i Methods Mouse handling Gtf2i 115 Cnp-Cr 114 ad libitum Diffusion MRI, fiber tracking, and analysis Mice were anaesthetized with 5% isoflurane and then maintained anesthetized by continuous isoflurane (1.5%) inhalation throughout the procedure. MRI scanning was performed using a 7T MRI scanner (Bruker, Billerica, MA) with a 30 cm bore and a gradient strength of up to 400 mT/m. The MRI protocol included diffusion imaging acquisition with a diffusion-weighted spin-echo echo-planar imaging pulse sequence. Acquired volumes were 18 slices, each 0.6 mm thick, with the following parameters: resolution of 0.175 mm × 0.175 mm 2 δ 2 b 2 2 All diffusion MRI analysis was performed in ExploreDTI 195 Motion and distortion correction to correct for possible motion- and susceptibility-induced artifacts. Transformation into atlas space via non-linear registration and extraction of atlas space FA and MD per mouse brain. Whole-brain fiber tracking with 0.175 mm × 0.175 mm × 0.175 mm seed voxel resolution; minimal FA and stropping criteria for tracking: FA > 0.1; maximal 30° tracking angle allowed. Tracking step size: 0.175 mm. The reconstructed number of streamlines was taken for statistical analysis between groups and presented as the number of tracts. Myelin isolation Myelin isolation was performed as previously described 145 Purification of myelin for the assessment of transcript (mRNA) levels was performed with RNAse-free solutions. Myelin proteome analysis In-solution digestion of myelin proteins by filter-aided sample preparation (FASP) 145 146 Tryptic peptides were separated by nanoscale reversed-phase UPLC and mass spectrometrically analyzed on a quadrupole time-of-flight mass spectrometer with ion mobility option (Synapt G2-S, Waters Corporation) as recently described in detail 146 E. coli For post-identification analysis including TOP3 quantification of proteins and for the detection of significant changes in protein abundance by moderated t-statistics, the freely available software ISOQuant and the Bioconductor R packages “limma” and “q-value” were used as described 146 Western blot Cortices were dissected as described above and homogenized in solubilization buffer (50 mM HEPES, pH 7.5, 150 mM NaCl, 10% glycerol, 1% Triton X-100, 1 mM EDTA, pH 8, 1 mM EGTA, pH 8, 1.5 mM MgCl 2 3 4 Primary antibodies used included rabbit anti-TfII-I (1:1000, catalog no. CST-4562S, Cell Signaling), rat anti-Mbp (1:500, catalog no. MAB386, Merck), rabbit anti-Mog (1:500, catalog no. AB32760, Abcam), rabbit anti-tubulin (1:1000, catalog no. AB108342 AB179509 Behavioral tests Behavioral tests were conducted during the light cycle (07:00–19:00). Before each test, mice were acclimated to the test room for at least 1 h. The temperature was kept at 20–24 °C throughout all behavioral experiments. Lighting properties were verified before each test. Each mouse participated in a maximum of three behavioral tests, with at least 3 day intervals between different tests. The experimenter was blind to genotypes. Open field Mice were placed in a Plexiglas box (40 cm long × 40 cm wide × 30 cm high) and spontaneous locomotion was recorded for 1 h. Margins were set as the area between each wall and a 10 cm distance into the box. Light parameters were ~60 lux in the center of each arena and ~10 lux at the margins. The placement of the mouse within the box was detected using Ethovision XT14 tracking software. Semi-manual verification of the identity of each mouse was performed. Rotarod Mice were placed on a rod (Catalog no. 47650, Ugo Basile, Gemonio, Italy) rotating at a constant speed of 4 revolutions per minute (rpm). Following verification of correct body orientation and placement on the rod, a constant acceleration was set up to 40 rpm, with a 5-min limit. To minimize grasping of the rod which leads to mice hanging, rather than walking on the rod, we used 3D printed adapters to increase the diameter of the rod to 30 cm instead of 15 cm. Mice that either gripped the rod for 2 or more full rotations, or fell from the rod before 20 s passed from the beginning of each trial were disqualified and their performance was not included in the analysis. Each mouse participated in 3 trials on the same day, with 1 h of an inter-trial interval between trials. Mice were trained once on the machine a day before beginning the actual test. Elevated zero maze Mice were placed in the closed arm of the elevated maze (height 60 cm) and their locomotor behavior was recorded for 15 min. Light parameters at the closed arms were ~10 lux. The placement of the mouse within the maze was detected using Ethovision XT14 tracking software and the time spent in the open arms was calculated. Data are presented in time bins of 5 min and overall time spent in open arms. Three chambers social interaction test The social interaction test apparatus was made of a clear Plexiglas box (65 cm long × 44 cm wide × 30 cm high) with partitions dividing the box into left, center and right chambers. These three chambers were interconnected, with 5 cm openings between each chamber that could be opened or closed manually by the experimenter with a lever-operated door. The inverted wire cups containing the inanimate object or stranger mice were cylindrical, 10 cm high, with a bottom diameter of 10 cm and with metal bars spaced 0.8 cm apart. A weighted cup was placed on top of the inverted wire cup to prevent the test mice from climbing onto the wire cup. Each wire cup was thoroughly cleaned after each use, with water and 70% ethanol. The arena itself was cleaned after each trial, using 70% ethanol. WT male C57Bl/6J mice with similar ages and body weights were used as stimulus mice. The habituation of stimulus mice was performed in proximity to the test for 3 consecutive days, 2 sessions a day, 30 min each session, in which mice were placed inside an inverted wire cup. These mice were used as stimulus mice for a maximum of two non-consecutive trials each day, and no more than 10 trials overall. The test consisted of two distinct phases. Each phase lasted 15 min, and at the end of each phase the test mouse was gently placed in the center arena while preparation of other sections of the arena took place. For the habituation phase, the test mouse was gently introduced to the center section of the arena. Then, the experimenter opened both doors leading to the left and right sections of the arena simultaneously, and the test mouse was allowed to explore the entire arena. During the social interaction phase, an inanimate object and stranger stimulus mouse were placed on opposing sections of the arena, under an inverted wire cup. The location of the object and stranger mice changed and was randomized for each trial. The experimenter then opened both doors simultaneously and the test mouse was allowed to explore and interact with both the inanimate object and the stranger mouse. Using EthoVision XT 14.0.1326 software (Noldus Information Technology BV, Wageningen, The Netherlands), behavior and interaction time of the test mouse was assessed in the sociability phase, and was then analyzed by the same experimenter, blinded to the genotype. The social index was determined in the sociability phase, by dividing the time spent in interaction with the stranger mouse by the time spent in interaction with the inanimate object. RNA extraction, cDNA preparation, and qPCR Cortices were dissected as described above and placed in RNAlater solution (catalog no. AB-AM7020, Invitrogen) at 4 °C overnight. The next day, RNAlater was disposed of and samples were frozen at −80 °C for no longer than 1 month, until the RNA extraction step. RNA extraction, cDNA preparation, and quantitative PCR were performed as previously described 196 Quantitative PCR was performed using the Fast SYBR Green Master Mix (Thermo-Fisher Scientific) and the CFX Connect Real-Time PCR Detection System (Bio-Rad). mRNA levels were measured and calculated by the comparative cycle threshold method 197 Gapdh Gapdh: Mbp: Sox10: Mog Plp1: Immunohistochemistry A basic immunohistochemical procedure was used as described previously 198 Primary cell cultures (OPC and mOL cultures) were stained using a similar method with minor modifications. Here, permeabilization was performed as part of the blocking step, with 0.3% of Triton X-100 being added. Incubation with primary antibodies was for 1 h at room temperature. For co-localization experiments, images of the motor cortex region were collected by an experimenter blind to the genotypes at ×10 magnification (bregma 0.5 mm). Both hemispheres were separately imaged, and the average number of cells was calculated for each mouse. For co-localization experiments at the midline of the CC, images were taken at ×20 magnification from the same brain bregma. Images of OPC and mOL cultures and supplementary images of Tfii-i localization in various cell types were taken at ×60 magnification. Quantification analysis of immunohistochemical experiments was performed by an experimenter blinded to the genotypes using ImageJ (NIH). For NoR experiments, images of the midline CC were collected by an experimenter blind to the genotypes at x60 magnification (same bregma as the CC TEM experiment, Supplementary Fig. 3 CTCF analysis in mOL-enriched primary cell culture was performed by an experimenter blinded to the genotypes. The experimenter manually marked the region of interest (ROI) for analysis. For Sox10 and Tfii-i that is the nucleus, for Mbp that is either the soma or the whole cell. Following this selection of ROI, intensity of the ROI was measured using ImageJ (NIH). To calculate specific background intensity of each image, 3 random areas with identical dimensions (outside of the ROI) were selected and their intensity measured and averaged. Then, this formula was used: \\documentclass[12pt]{minimal}\n\t\t\t\t\\usepackage{amsmath}\n\t\t\t\t\\usepackage{wasysym} \n\t\t\t\t\\usepackage{amsfonts} \n\t\t\t\t\\usepackage{amssymb} \n\t\t\t\t\\usepackage{amsbsy}\n\t\t\t\t\\usepackage{mathrsfs}\n\t\t\t\t\\usepackage{upgreek}\n\t\t\t\t\\setlength{\\oddsidemargin}{-69pt}\n\t\t\t\t\\begin{document}$${CTCF}=\t \\,{Total\\; intensity\\; of\\; the\\; ROI}\\\\ \t -({Mean\\; intensity\\; of\\; the\\; background}*{ROI\\; area})$$\\end{document} C T C F = T o t a l i n t e n s i t y o f t h e R O I − ( M e a n i n t e n s i t y o f t h e b a c k g r o u n d * R O I a r e a ) Commercial primary antibodies used in this study: rabbit anti-TFII-I (1:1000, catalog no. CST-4562S, Cell signaling), mouse anti-APC (Ab-7, CC1) (1:500, catalog no. OP80, Calbiochem), rabbit anti-Olig2 (1:1000, catalog no. AB9610, Sigma-Aldrich), rat anti-Pdgfrɑ (CD140a) (1:700, catalog no. 14-1401-82, Invitrogen), mouse anti-NeuN (1:1000, catalog no. MAB-377, Sigma-Aldrich), mouse anti-Sox10 (1:500, catalog no. SC-365692, Santa Cruz), rat anti-Mbp (1:500, catalog no. MAB386, Sigma-Aldrich), chicken anti-mCherry (1:1000, catalog no. ab205402, Abcam), rabbit anti-NaV 1.6 (1:100, catalog no. ASC-009, Alomone labs), and mouse anti-Caspr (1:50, catalog no. ab252535, Abcam). Secondary antibodies used in this study: goat anti-rabbit (1:1000, catalog no. ab150077, Abcam), goat anti-mouse (1:1000, catalog no. A11001, Invitrogen), goat anti-rat (1:1000, catalog no. ab150165, Abcam) conjugated to Alexa Flour 488. Goat anti-rabbit (1:1000, catalog no. A32732, Invitrogen), goat anti-chicken (1:1000, catalog no. A32932, Invitrogen), goat anti-mouse (1:1000, catalog no. A21424, Invitrogen) conjugated to Alexa Flour 555. Goat anti-rabbit (1:1000, catalog no. A21245, Invitrogen), goat anti-rat (1:1000, catalog no. A21247, Invitrogen) conjugated to Alexa Flour 647. In-vivo fEPSP recordings in the CC Recordings were performed as previously described 20 Electron microscopy Mice were trans-cardially perfused as described above with minor alterations. The fixation solution included 2% PFA, 2.5% glutaraldehyde, and 0.1 M sodium cacodylate buffer (pH 7.4). Brains were dissected and cut at the midline in sagittal fashion. Then, ~1 mm cubes from the CC at the level of the fornix (Supplementary Fig. 3 g g Primary OPC and mOL cultures Primary mixed glia cell cultures were prepared from the cortices of P0-P2 control ( Gtf2i f/f Gtf2i ChIP-seq and ChIP-qPCR For the ChIP-seq experiment, primary OPCs were subjected to differentiation as previously described. Differentiated mOLs from 4 to 5 mice were pooled by genotype to ensure enough starting material for a ChIP-seq procedure. At DIV8–9 cells were washed gently with PBS to remove cellular debris then harvested and pooled using Trypsin A (Sigma-Aldrich, catalog no. T4049). Trypsin activity was neutralized by adding DMEM/F12 supplemented with L-glutamine and 20% FBS. Cells were then centrifuged at 100 × g g 3 3 ChIP-seq data analysis Alignment of the raw fastq reads to the GRCm39 genome was performed using Bowtie2. Differential peak calling was performed using Macs2 (version 2.2.9.1) with the command line “callpeak -t IP.bam -c Input.bam -g mm -f BAMPE -q 0.1 --nolambda --keep-dup all –B”, where immunoprecipitate (IP) over input scores were calculated. Additional manual filtration was performed to exclude peaks with; q 199 200 201 202 Chromosomal conformation capture assay followed by qPCR (3C-qPCR) 3C-qPCR was performed as previously described 155 169 3 Statistical analysis All data were collected from Gtf2i t 13 Reporting summary Further information on research design is available in the Nature Portfolio Reporting Summary Supplementary information  Supplementary Information Description of Additional Supplementary Files Supplementary Data 1 Supplementary Data 2 Supplementary Data 3 Reporting Summary Transparent Peer Review file Source data  Source Data Publisher’s note Supplementary information The online version contains supplementary material available at 10.1038/s41467-025-63500-4. Acknowledgements The authors gratefully acknowledge past and current members of the Barak laboratory and the Peles laboratory for their support and insightful comments on the manuscript. The authors would also like to thank Gonçalo Castelo-Branco for his insights and consultation during the writing of this manuscript, and Ramona Jung for technical support. AAVs used in the study were a generous gift from Prof. Inna Slutsky’s laboratory. Special thanks to Naama Harari Uzan for her assistance in preparing the figures. This work was supported by grants awarded to B.B. from the Fritz Thyssen Stiftung, the National Institute of Psychobiology in Israel, and the Israel Science Foundation (grant 2305/20). I.S. was supported by the European Research Council (grant 101097788). E.P. was supported by the Israel Science Foundation and the Sagol Center for Research on the Aging Brain. G.L. was supported by the Eshkol Fellowship from The Ministry of Science and Technology, Israel. B.B. was the recipient of The Alon Fellowship for outstanding young researchers awarded by the Israeli Council for Higher Education. Author contributions G.L., E.P., N.S., and B.B. conceptualized the study, designed the experiments and wrote the manuscript. G.L. and M.R. collected, analyzed and interpreted the results of the behavioral, developmental and immunofluorescence experiments. O.J, S.B.S., and H.B.W. analyzed and interpreted the results of the myelin proteome analysis. M.R, M.G, I.I.E., and G.L collected, analyzed and interpreted the results of the qPCR experiments. G.L., M.R., S.S.T., and G.E.S. collected, analyzed and interpreted the results of the Western blot experiments, and performed myelin isolation. I.F. and Y.A. collected, analyzed and interpreted the results from the MRI-DTI experiment. O.K.F., Y.E.E, A.V., and G.L. collected, analyzed and interpreted the results of the electron microscopy experiment. S.S. and I.S. collected, analyzed and interpreted the results from electrophysiological studies from the corpus callosum. G.L., M.R., T.R., J.B., H.P., and A.M. collected, analyzed and interpreted the results of the ChIP-seq and the 3C-qPCR experiments. G.L., M.R., Y.E.E., and E.B. collected, analyzed and interpreted the results from the mOL-enriched primary cell culture experiments. All authors have read and agreed to the published version of the manuscript. Peer review Peer review information Nature Communications Data availability The mass spectrometry proteomics data have been deposited to the ProteomeXchange Consortium via the PRIDE 203 PXD054341 GSE285541 Source data Competing interests The authors declare no competing interests. References 1. Simons M Nave KA Oligodendrocytes: myelination and axonal support Cold Spring Harb. Perspect. Biol. 2015 8 a020479 10.1101/cshperspect.a020479 26101081 PMC4691794 Simons, M. & Nave, K. A. Oligodendrocytes: myelination and axonal support. Cold Spring Harb. Perspect. Biol. 8 26101081 10.1101/cshperspect.a020479 PMC4691794 2. Nave K-A Werner HB Myelination of the nervous system: mechanisms and functions Annu. Rev. Cell Dev. Biol. 2014 30 503 533 10.1146/annurev-cellbio-100913-013101 25288117 Nave, K.-A. & Werner, H. B. Myelination of the nervous system: mechanisms and functions. Annu. Rev. Cell Dev. Biol. 30 25288117 10.1146/annurev-cellbio-100913-013101 3. Sowell ER Mapping cortical change across the human life span Nat. Neurosci. 2003 6 309 315 10.1038/nn1008 12548289 Sowell, E. R. et al. Mapping cortical change across the human life span. Nat. Neurosci. 6 12548289 10.1038/nn1008 4. Jakovcevski, I., et al., Oligodendrocyte development and the onset of myelination in the human fetal brain. Front. Neuroanat. 3 10.3389/neuro.05.005.2009 PMC2694674 19521542 5. Kuhn S Oligodendrocytes in development, myelin generation and beyond Cells 2019 8 1424 10.3390/cells8111424 31726662 PMC6912544 Kuhn, S. et al. Oligodendrocytes in development, myelin generation and beyond. Cells 8 31726662 10.3390/cells8111424 PMC6912544 6. Williamson JM Lyons DA Myelin dynamics throughout life: an ever-changing landscape? Front. Cell Neurosci. 2018 12 424 10.3389/fncel.2018.00424 30510502 PMC6252314 Williamson, J. M. & Lyons, D. A. Myelin dynamics throughout life: an ever-changing landscape?. Front. Cell Neurosci. 12 30510502 10.3389/fncel.2018.00424 PMC6252314 7. Saab AS Nave KA Myelin dynamics: protecting and shaping neuronal functions Curr. Opin. Neurobiol. 2017 47 104 112 10.1016/j.conb.2017.09.013 29065345 Saab, A. S. & Nave, K. A. Myelin dynamics: protecting and shaping neuronal functions. Curr. Opin. Neurobiol. 47 29065345 10.1016/j.conb.2017.09.013 8. Ameis SH Catani M Altered white matter connectivity as a neural substrate for social impairment in Autism Spectrum Disorder Cortex 2015 62 158 181 10.1016/j.cortex.2014.10.014 25433958 Ameis, S. H. & Catani, M. Altered white matter connectivity as a neural substrate for social impairment in Autism Spectrum Disorder. Cortex 62 25433958 10.1016/j.cortex.2014.10.014 9. Nir A Barak B White matter alterations in Williams syndrome related to behavioral and motor impairments Glia 2021 69 5 19 10.1002/glia.23868 32589817 Nir, A. & Barak, B. White matter alterations in Williams syndrome related to behavioral and motor impairments. Glia 69 32589817 10.1002/glia.23868 10. Mei L Nave KA Neuregulin-ERBB signaling in the nervous system and neuropsychiatric diseases Neuron 2014 83 27 49 10.1016/j.neuron.2014.06.007 24991953 PMC4189115 Mei, L. & Nave, K. A. Neuregulin-ERBB signaling in the nervous system and neuropsychiatric diseases. Neuron 83 24991953 10.1016/j.neuron.2014.06.007 PMC4189115 11. Nave KA Ehrenreich H Myelination and oligodendrocyte functions in psychiatric diseases JAMA Psychiatry 2014 71 582 584 10.1001/jamapsychiatry.2014.189 24671770 Nave, K. A. & Ehrenreich, H. Myelination and oligodendrocyte functions in psychiatric diseases. JAMA Psychiatry 71 24671770 10.1001/jamapsychiatry.2014.189 12. Bartzokis G Alzheimer’s disease as homeostatic responses to age-related myelin breakdown Neurobiol. Aging 2011 32 1341 1371 10.1016/j.neurobiolaging.2009.08.007 19775776 PMC3128664 Bartzokis, G. Alzheimer’s disease as homeostatic responses to age-related myelin breakdown. Neurobiol. Aging 32 19775776 10.1016/j.neurobiolaging.2009.08.007 PMC3128664 13. Dobson R Giovannoni G Multiple sclerosis—a review Eur. J. Neurol. 2019 26 27 40 10.1111/ene.13819 30300457 Dobson, R. & Giovannoni, G. Multiple sclerosis—a review. Eur. J. Neurol. 26 30300457 10.1111/ene.13819 14. Moore S A role of oligodendrocytes in information processing Nat. Commun. 2020 11 5497 10.1038/s41467-020-19152-7 33127910 PMC7599337 Moore, S. et al. A role of oligodendrocytes in information processing. Nat. Commun. 11 33127910 10.1038/s41467-020-19152-7 PMC7599337 15. Khelfaoui H Ibaceta-Gonzalez C Angulo MC Functional myelin in cognition and neurodevelopmental disorders Cell. Mol. Life Sci. 2024 81 181 10.1007/s00018-024-05222-2 38615095 PMC11016012 Khelfaoui, H., Ibaceta-Gonzalez, C. & Angulo, M. C. Functional myelin in cognition and neurodevelopmental disorders. Cell. Mol. Life Sci. 81 38615095 10.1007/s00018-024-05222-2 PMC11016012 16. Popescu BFG Lucchinetti CF Pathology of demyelinating diseases Annu. Rev. Pathol.: Mech. Dis. 2012 7 185 217 10.1146/annurev-pathol-011811-132443 22313379 Popescu, B. F. G. & Lucchinetti, C. F. Pathology of demyelinating diseases. Annu. Rev. Pathol.: Mech. Dis. 7 10.1146/annurev-pathol-011811-132443 22313379 17. Yuki N Hartung H-P Guillain–Barré Syndrome N. Engl. J. Med. 2012 366 2294 2304 10.1056/NEJMra1114525 22694000 Yuki, N. & Hartung, H.-P. Guillain–Barré Syndrome. N. Engl. J. Med. 366 22694000 10.1056/NEJMra1114525 18. Mei F Micropillar arrays as a high-throughput screening platform for therapeutics in multiple sclerosis Nat. Med. 2014 20 954 960 10.1038/nm.3618 24997607 PMC4830134 Mei, F. et al. Micropillar arrays as a high-throughput screening platform for therapeutics in multiple sclerosis. Nat. Med. 20 24997607 10.1038/nm.3618 PMC4830134 19. Liu J Clemastine enhances myelination in the prefrontal cortex and rescues behavioral changes in socially isolated mice J. Neurosci. 2016 36 957 962 10.1523/JNEUROSCI.3608-15.2016 26791223 PMC4719024 Liu, J. et al. Clemastine enhances myelination in the prefrontal cortex and rescues behavioral changes in socially isolated mice. J. Neurosci. 36 26791223 10.1523/JNEUROSCI.3608-15.2016 PMC4719024 20. Barak B Neuronal deletion of Gtf2i, associated with Williams syndrome, causes behavioral and myelin alterations rescuable by a remyelinating drug Nat. Neurosci. 2019 22 700 708 10.1038/s41593-019-0380-9 31011227 Barak, B. et al. Neuronal deletion of Gtf2i, associated with Williams syndrome, causes behavioral and myelin alterations rescuable by a remyelinating drug. Nat. Neurosci. 22 31011227 10.1038/s41593-019-0380-9 21. Green AJ Clemastine fumarate as a remyelinating therapy for multiple sclerosis (ReBUILD): a randomised, controlled, double-blind, crossover trial Lancet 2017 390 2481 2489 10.1016/S0140-6736(17)32346-2 29029896 Green, A. J. et al. Clemastine fumarate as a remyelinating therapy for multiple sclerosis (ReBUILD): a randomised, controlled, double-blind, crossover trial. Lancet 390 29029896 10.1016/S0140-6736(17)32346-2 22. Cole KLH Early JJ Lyons DA Drug discovery for remyelination and treatment of MS Glia 2017 65 1565 1589 10.1002/glia.23166 28618073 Cole, K. L. H., Early, J. J. & Lyons, D. A. Drug discovery for remyelination and treatment of MS. Glia 65 28618073 10.1002/glia.23166 23. Lu QR Common developmental requirement for olig function indicates a motor neuron/oligodendrocyte connection Cell 2002 109 75 86 10.1016/S0092-8674(02)00678-5 11955448 Lu, Q. R. et al. Common developmental requirement for olig function indicates a motor neuron/oligodendrocyte connection. Cell 109 11955448 10.1016/s0092-8674(02)00678-5 24. Kessaris N Competing waves of oligodendrocytes in the forebrain and postnatal elimination of an embryonic lineage Nat. Neurosci. 2006 9 173 179 10.1038/nn1620 16388308 PMC6328015 Kessaris, N. et al. Competing waves of oligodendrocytes in the forebrain and postnatal elimination of an embryonic lineage. Nat. Neurosci. 9 16388308 10.1038/nn1620 PMC6328015 25. Dawson MRL Levine JM Reynolds R NG2-expressing cells in the central nervous system: Are they oligodendroglial progenitors? J. Neurosci. Res. 2000 61 471 479 10.1002/1097-4547(20000901)61:5&#x0003c;471::AID-JNR1&#x0003e;3.0.CO;2-N 10956416 Dawson, M. R. L., Levine, J. M. & Reynolds, R. NG2-expressing cells in the central nervous system: Are they oligodendroglial progenitors? J. Neurosci. Res. 61 10956416 10.1002/1097-4547(20000901)61:5<471::AID-JNR1>3.0.CO;2-N 26. Kremer D The complex world of oligodendroglial differentiation inhibitors Ann. Neurol. 2011 69 602 618 10.1002/ana.22415 21520230 Kremer, D. et al. The complex world of oligodendroglial differentiation inhibitors. Ann. Neurol. 69 21520230 10.1002/ana.22415 27. Domingues HS Mechanical plasticity during oligodendrocyte differentiation and myelination Glia 2018 66 5 14 10.1002/glia.23206 28940651 PMC5743057 Domingues, H. S. et al. Mechanical plasticity during oligodendrocyte differentiation and myelination. Glia 66 28940651 10.1002/glia.23206 PMC5743057 28. Cheli VT Voltage-gated Ca++ entry promotes oligodendrocyte progenitor cell maturation and myelination in vitro Exp. Neurol. 2015 265 69 83 10.1016/j.expneurol.2014.12.012 25542980 PMC4711374 Cheli, V. T. et al. Voltage-gated Ca++ entry promotes oligodendrocyte progenitor cell maturation and myelination in vitro. Exp. Neurol. 265 25542980 10.1016/j.expneurol.2014.12.012 PMC4711374 29. Simons M Lyons DA Axonal selection and myelin sheath generation in the central nervous system Curr. Opin. Cell Biol. 2013 25 512 519 10.1016/j.ceb.2013.04.007 23707197 Simons, M. & Lyons, D. A. Axonal selection and myelin sheath generation in the central nervous system. Curr. Opin. Cell Biol. 25 23707197 10.1016/j.ceb.2013.04.007 30. Aggarwal S Myelin membrane assembly is driven by a phase transition of myelin basic proteins into a cohesive protein meshwork PLOS Biol. 2013 11 e1001577 10.1371/journal.pbio.1001577 23762018 PMC3676292 Aggarwal, S. et al. Myelin membrane assembly is driven by a phase transition of myelin basic proteins into a cohesive protein meshwork. PLOS Biol. 11 23762018 10.1371/journal.pbio.1001577 PMC3676292 31. Hartline DK What is myelin? Neuron Glia Biol. 2009 4 153 163 10.1017/S1740925X09990263 19737435 Hartline, D. K. What is myelin?. Neuron Glia Biol. 4 10.1017/S1740925X09990263 19737435 32. Sock E Wegner M Transcriptional control of myelination and remyelination Glia 2019 67 2153 2165 10.1002/glia.23636 31038810 Sock, E. & Wegner, M. Transcriptional control of myelination and remyelination. Glia 67 31038810 10.1002/glia.23636 33. Vogl MR Sox10 cooperates with the mediator subunit 12 during terminal differentiation of myelinating glia J. Neurosci. 2013 33 6679 6690 10.1523/JNEUROSCI.5178-12.2013 23575864 PMC6619079 Vogl, M. R. et al. Sox10 cooperates with the mediator subunit 12 during terminal differentiation of myelinating glia. J. Neurosci. 33 23575864 10.1523/JNEUROSCI.5178-12.2013 PMC6619079 34. Stolt CC Terminal differentiation of myelin-forming oligodendrocytes depends on the transcription factor Sox10 Genes Dev. 2002 16 165 170 10.1101/gad.215802 11799060 PMC155320 Stolt, C. C. et al. Terminal differentiation of myelin-forming oligodendrocytes depends on the transcription factor Sox10. Genes Dev. 16 11799060 10.1101/gad.215802 PMC155320 35. Elbaz B Popko B Molecular control of oligodendrocyte development Trends Neurosci. 2019 42 263 277 10.1016/j.tins.2019.01.002 30770136 PMC7397568 Elbaz, B. & Popko, B. Molecular control of oligodendrocyte development. Trends Neurosci. 42 30770136 10.1016/j.tins.2019.01.002 PMC7397568 36. Wegner M A matter of identity: transcriptional control in oligodendrocytes J. Mol. Neurosci. 2008 35 3 12 10.1007/s12031-007-9008-8 18401762 Wegner, M. A matter of identity: transcriptional control in oligodendrocytes. J. Mol. Neurosci. 35 18401762 10.1007/s12031-007-9008-8 37. Zhou Q Wang S Anderson DJ Identification of a novel family of oligodendrocyte lineage-specific basic helix–loop–helix transcription factors Neuron 2000 25 331 343 10.1016/S0896-6273(00)80898-3 10719889 Zhou, Q., Wang, S. & Anderson, D. J. Identification of a novel family of oligodendrocyte lineage-specific basic helix–loop–helix transcription factors. Neuron 25 10719889 10.1016/s0896-6273(00)80898-3 38. Emery B Myelin gene regulatory factor is a critical transcriptional regulator required for CNS myelination Cell 2009 138 172 185 10.1016/j.cell.2009.04.031 19596243 PMC2757090 Emery, B. et al. Myelin gene regulatory factor is a critical transcriptional regulator required for CNS myelination. Cell 138 19596243 10.1016/j.cell.2009.04.031 PMC2757090 39. He Y The transcription factor Yin Yang 1 is essential for oligodendrocyte progenitor differentiation Neuron 2007 55 217 230 10.1016/j.neuron.2007.06.029 17640524 PMC2034312 He, Y. et al. The transcription factor Yin Yang 1 is essential for oligodendrocyte progenitor differentiation. Neuron 55 17640524 10.1016/j.neuron.2007.06.029 PMC2034312 40. Elbaz B Phosphorylation state of ZFP24 controls oligodendrocyte differentiation Cell Rep. 2018 23 2254 2263 10.1016/j.celrep.2018.04.089 29791837 PMC6002757 Elbaz, B. et al. Phosphorylation state of ZFP24 controls oligodendrocyte differentiation. Cell Rep. 23 29791837 10.1016/j.celrep.2018.04.089 PMC6002757 41. Zhang C The transcription factor NKX2-2 regulates oligodendrocyte differentiation through domain-specific interactions with transcriptional corepressors J. Biol. Chem. 2020 295 1879 1888 10.1074/jbc.RA119.011163 31932307 PMC7029133 Zhang, C. et al. The transcription factor NKX2-2 regulates oligodendrocyte differentiation through domain-specific interactions with transcriptional corepressors. J. Biol. Chem. 295 31932307 10.1074/jbc.RA119.011163 PMC7029133 42. Finzsch M Sox10 is required for Schwann cell identity and progression beyond the immature Schwann cell stage J. Cell Biol. 2010 189 701 712 10.1083/jcb.200912142 20457761 PMC2872908 Finzsch, M. et al. Sox10 is required for Schwann cell identity and progression beyond the immature Schwann cell stage. J. Cell Biol. 189 20457761 10.1083/jcb.200912142 PMC2872908 43. Britsch S The transcription factor Sox10 is a key regulator of peripheral glial development Genes Dev. 2001 15 66 78 10.1101/gad.186601 11156606 PMC312607 Britsch, S. et al. The transcription factor Sox10 is a key regulator of peripheral glial development. Genes Dev. 15 11156606 10.1101/gad.186601 PMC312607 44. Inoue K Tanabe Y Lupski JR Myelin deficiencies in both the central and the peripheral nervous systems associated with a SOX10 mutation Ann. Neurol. 1999 46 313 318 10.1002/1531-8249(199909)46:3&#x0003c;313::AID-ANA6&#x0003e;3.0.CO;2-7 10482261 Inoue, K., Tanabe, Y. & Lupski, J. R. Myelin deficiencies in both the central and the peripheral nervous systems associated with a SOX10 mutation. Ann. Neurol. 46 10482261 10.1002/1531-8249(199909)46:3<313::aid-ana6>3.0.co;2-7 45. Inoue K Congenital hypomyelinating neuropathy, central dysmyelination, and Waardenburg–Hirschsprung disease: phenotypes linked by SOX10 mutation Ann. Neurol. 2002 52 836 842 10.1002/ana.10404 12447940 Inoue, K. et al. Congenital hypomyelinating neuropathy, central dysmyelination, and Waardenburg–Hirschsprung disease: phenotypes linked by SOX10 mutation. Ann. Neurol. 52 12447940 10.1002/ana.10404 46. Hornig J The transcription factors Sox10 and Myrf define an essential regulatory network module in differentiating oligodendrocytes PLOS Genet. 2013 9 e1003907 10.1371/journal.pgen.1003907 24204311 PMC3814293 Hornig, J. et al. The transcription factors Sox10 and Myrf define an essential regulatory network module in differentiating oligodendrocytes. PLOS Genet. 9 24204311 10.1371/journal.pgen.1003907 PMC3814293 47. Dai J Olig1 function is required for oligodendrocyte differentiation in the mouse brain J. Neurosci. 2015 35 4386 4402 10.1523/JNEUROSCI.4962-14.2015 25762682 PMC4461695 Dai, J. et al. Olig1 function is required for oligodendrocyte differentiation in the mouse brain. J. Neurosci. 35 25762682 10.1523/JNEUROSCI.4962-14.2015 PMC4461695 48. Chen X Myelin deficits caused by Olig2 deficiency lead to cognitive dysfunction and increase vulnerability to social withdrawal in adult mice Neurosci. Bull. 2020 36 419 426 10.1007/s12264-019-00449-7 31758330 PMC7142181 Chen, X. et al. Myelin deficits caused by Olig2 deficiency lead to cognitive dysfunction and increase vulnerability to social withdrawal in adult mice. Neurosci. Bull. 36 31758330 10.1007/s12264-019-00449-7 PMC7142181 49. Huang H Regulation of the timing of oligodendrocyte differentiation: mechanisms and perspectives Neurosci. Bull. 2013 29 155 164 10.1007/s12264-013-1314-2 23456566 PMC3761796 Huang, H. et al. Regulation of the timing of oligodendrocyte differentiation: mechanisms and perspectives. Neurosci. Bull. 29 23456566 10.1007/s12264-013-1314-2 PMC3761796 50. Swire M Oligodendrocyte HCN2 channels regulate myelin sheath length J. Neurosci. 2021 41 7954 7964 10.1523/JNEUROSCI.2463-20.2021 34341156 PMC8460148 Swire, M. et al. Oligodendrocyte HCN2 channels regulate myelin sheath length. J. Neurosci. 41 34341156 10.1523/JNEUROSCI.2463-20.2021 PMC8460148 51. Klingseisen A Oligodendrocyte Neurofascin Independently Regulates Both Myelin Targeting and Sheath Growth in the CNS Dev. Cell 2019 51 730 744.e6 10.1016/j.devcel.2019.10.016 31761670 PMC6912162 Klingseisen, A. et al. Oligodendrocyte Neurofascin Independently Regulates Both Myelin Targeting and Sheath Growth in the CNS. Dev. Cell 51 31761670 10.1016/j.devcel.2019.10.016 PMC6912162 52. Howng SY ZFP191 is required by oligodendrocytes for CNS myelination Genes Dev. 2010 24 301 311 10.1101/gad.1864510 20080941 PMC2811831 Howng, S. Y. et al. ZFP191 is required by oligodendrocytes for CNS myelination. Genes Dev. 24 20080941 10.1101/gad.1864510 PMC2811831 53. Xu H m(6)A mRNA methylation is essential for oligodendrocyte maturation and CNS myelination Neuron 2020 105 293 309.e5 10.1016/j.neuron.2019.12.013 31901304 PMC7137581 Xu, H. et al. m(6)A mRNA methylation is essential for oligodendrocyte maturation and CNS myelination. Neuron 105 31901304 10.1016/j.neuron.2019.12.013 PMC7137581 54. Fields RD Stevens-Graham B New insights into neuron-glia communication Science 2002 298 556 562 10.1126/science.298.5593.556 12386325 PMC1226318 Fields, R. D. & Stevens-Graham, B. New insights into neuron-glia communication. Science 298 12386325 10.1126/science.298.5593.556 PMC1226318 55. Stevens B Adenosine: a neuron-glial transmitter promoting myelination CNS response action potentials Neuron 2002 36 855 868 10.1016/S0896-6273(02)01067-X 12467589 PMC1201407 Stevens, B. et al. Adenosine: a neuron-glial transmitter promoting myelination CNS response action potentials. Neuron 36 12467589 10.1016/s0896-6273(02)01067-x PMC1201407 56. Wake H Lee PR Fields RD Control of local protein synthesis and initial events in myelination by action potentials Science 2011 333 1647 1651 10.1126/science.1206998 21817014 PMC3482340 Wake, H., Lee, P. R. & Fields, R. D. Control of local protein synthesis and initial events in myelination by action potentials. Science 333 21817014 10.1126/science.1206998 PMC3482340 57. Klingseisen A Lyons DA Axonal regulation of central nervous system myelination: structure and function Neuroscientist 2018 24 7 21 10.1177/1073858417703030 28397586 Klingseisen, A. & Lyons, D. A. Axonal regulation of central nervous system myelination: structure and function. Neuroscientist 24 28397586 10.1177/1073858417703030 58. Redmond SA Somatodendritic expression of JAM2 inhibits oligodendrocyte myelination Neuron 2016 91 824 836 10.1016/j.neuron.2016.07.021 27499083 PMC4990461 Redmond, S. A. et al. Somatodendritic expression of JAM2 inhibits oligodendrocyte myelination. Neuron 91 27499083 10.1016/j.neuron.2016.07.021 PMC4990461 59. Marshall-Phelps, K. L. H., et al. Neuronal activity disrupts myelinated axon integrity in the absence of NKCC1b. J. Cell Biol. 219 10.1083/jcb.201909022 PMC7337504 32364583 60. Almeida RG Myelination induces axonal hotspots of synaptic vesicle fusion that promote sheath growth Curr. Biol. 2021 31 3743 3754.e5 10.1016/j.cub.2021.06.036 34270947 PMC8445327 Almeida, R. G. et al. Myelination induces axonal hotspots of synaptic vesicle fusion that promote sheath growth. Curr. Biol. 31 34270947 10.1016/j.cub.2021.06.036 PMC8445327 61. Almeida R Lyons D Oligodendrocyte development in the absence of their target axons in vivo PLoS One 2016 11 e0164432 10.1371/journal.pone.0164432 27716830 PMC5055324 Almeida, R. & Lyons, D. Oligodendrocyte development in the absence of their target axons in vivo. PLoS One 11 27716830 10.1371/journal.pone.0164432 PMC5055324 62. Lee KE Identification of direct regulatory targets of the transcription factor Sox10 based on function and conservation BMC Genom. 2008 9 408 10.1186/1471-2164-9-408 PMC2556353 18786246 Lee, K. E. et al. Identification of direct regulatory targets of the transcription factor Sox10 based on function and conservation. BMC Genom. 9 10.1186/1471-2164-9-408 PMC2556353 18786246 63. Readhead C Expression of a myelin basic protein gene in transgenic shiverer mice: correction of the dysmyelinating phenotype Cell 1987 48 703 712 10.1016/0092-8674(87)90248-0 2434242 Readhead, C. et al. Expression of a myelin basic protein gene in transgenic shiverer mice: correction of the dysmyelinating phenotype. Cell 48 2434242 10.1016/0092-8674(87)90248-0 64. Wang S A role for the helix-loop-helix protein Id2 in the control of oligodendrocyte development Neuron 2001 29 603 614 10.1016/S0896-6273(01)00237-9 11301021 Wang, S. et al. A role for the helix-loop-helix protein Id2 in the control of oligodendrocyte development. Neuron 29 11301021 10.1016/s0896-6273(01)00237-9 65. Samanta J Kessler JA Interactions between ID and OLIG proteins mediate the inhibitory effects of BMP4 on oligodendroglial differentiation Development 2004 131 4131 4142 10.1242/dev.01273 15280210 Samanta, J. & Kessler, J. A. Interactions between ID and OLIG proteins mediate the inhibitory effects of BMP4 on oligodendroglial differentiation. Development 131 15280210 10.1242/dev.01273 66. Makeyev AV Bayarsaihan D Alternative splicing and promoter use in TFII-I genes Gene 2009 433 16 25 10.1016/j.gene.2008.11.027 19111598 PMC2643308 Makeyev, A. V. & Bayarsaihan, D. Alternative splicing and promoter use in TFII-I genes. Gene 433 19111598 10.1016/j.gene.2008.11.027 PMC2643308 67. Roy AL Biochemistry and biology of the inducible multifunctional transcription factor TFII-I Gene 2001 274 1 13 10.1016/S0378-1119(01)00625-4 11674993 Roy, A. L. Biochemistry and biology of the inducible multifunctional transcription factor TFII-I. Gene 274 11674993 10.1016/s0378-1119(01)00625-4 68. Enkhmandakh B Essential functions of the Williams-Beuren syndrome-associated TFII-I genes in embryonic development Proc. Natl Acad. Sci. 2009 106 181 186 10.1073/pnas.0811531106 19109438 PMC2629217 Enkhmandakh, B. et al. Essential functions of the Williams-Beuren syndrome-associated TFII-I genes in embryonic development. Proc. Natl Acad. Sci. 106 19109438 10.1073/pnas.0811531106 PMC2629217 69. Roy AL Cooperative interaction of an initiator-binding transcription initiation factor and the helix–loop–helix activator USF Nature 1991 354 245 248 10.1038/354245a0 1961251 Roy, A. L. et al. Cooperative interaction of an initiator-binding transcription initiation factor and the helix–loop–helix activator USF. Nature 354 1961251 10.1038/354245a0 70. Roy AL Biochemistry and biology of the inducible multifunctional transcription factor TFII-I: 10 years later Gene 2012 492 32 41 10.1016/j.gene.2011.10.030 22037610 PMC3246126 Roy, A. L. Biochemistry and biology of the inducible multifunctional transcription factor TFII-I: 10 years later. Gene 492 22037610 10.1016/j.gene.2011.10.030 PMC3246126 71. Crusselle-Davis VJ Recruitment of coregulator complexes to the β-globin gene locus by TFII-I and upstream stimulatory factor FEBS J. 2007 274 6065 6073 10.1111/j.1742-4658.2007.06128.x 17970752 Crusselle-Davis, V. J. et al. Recruitment of coregulator complexes to the β-globin gene locus by TFII-I and upstream stimulatory factor. FEBS J. 274 17970752 10.1111/j.1742-4658.2007.06128.x 72. Roy AL An alternative pathway for transcription initiation involving TFII-I Nature 1993 365 355 359 10.1038/365355a0 8377828 Roy, A. L. et al. An alternative pathway for transcription initiation involving TFII-I. Nature 365 8377828 10.1038/365355a0 73. Caraveo G Action of TFII-I outside the nucleus as an inhibitor of agonist-induced calcium entry Science 2006 314 122 125 10.1126/science.1127815 17023658 Caraveo, G. et al. Action of TFII-I outside the nucleus as an inhibitor of agonist-induced calcium entry. Science 314 17023658 10.1126/science.1127815 74. Blomen VA Gene essentiality and synthetic lethality in haploid human cells Science 2015 350 1092 1096 10.1126/science.aac7557 26472760 Blomen, V. A. et al. Gene essentiality and synthetic lethality in haploid human cells. Science 350 26472760 10.1126/science.aac7557 75. Singh, A., et al. Transcription factor TFII-I fine tunes innate properties of B lymphocytes. Front. Immunol. 14 10.3389/fimmu.2023.1067459 PMC9900109 36756127 76. Ren X Direct interactions of OCA-B and TFII-I regulate immunoglobulin heavy-chain gene transcription by facilitating enhancer-promoter communication Mol. Cell 2011 42 342 355 10.1016/j.molcel.2011.04.011 21549311 PMC3105350 Ren, X. et al. Direct interactions of OCA-B and TFII-I regulate immunoglobulin heavy-chain gene transcription by facilitating enhancer-promoter communication. Mol. Cell 42 21549311 10.1016/j.molcel.2011.04.011 PMC3105350 77. Sacristán C Characterization of a novel interaction between transcription factor TFII-I and the inducible tyrosine kinase in T cells Eur. J. Immunol. 2009 39 2584 2595 10.1002/eji.200839031 19701889 PMC3014647 Sacristán, C. et al. Characterization of a novel interaction between transcription factor TFII-I and the inducible tyrosine kinase in T cells. Eur. J. Immunol. 39 19701889 10.1002/eji.200839031 PMC3014647 78. Hong M Transcriptional regulation of the Grp78 promoter by endoplasmic reticulum stress: role of TFII-I and its tyrosine phosphorylation* J. Biol. Chem. 2005 280 16821 16828 10.1074/jbc.M413753200 15664986 Hong, M. et al. Transcriptional regulation of the Grp78 promoter by endoplasmic reticulum stress: role of TFII-I and its tyrosine phosphorylation*. J. Biol. Chem. 280 15664986 10.1074/jbc.M413753200 79. Osborne LR Mervis CB 7q11.23 deletion and duplication Curr. Opin. Genet. Dev. 2021 68 41 48 10.1016/j.gde.2021.01.013 33610060 Osborne, L. R. & Mervis, C. B. 7q11.23 deletion and duplication. Curr. Opin. Genet. Dev. 68 33610060 10.1016/j.gde.2021.01.013 80. Berg JS Speech delay and autism spectrum behaviors are frequently associated with duplication of the 7q11.23 Williams-Beuren syndrome region Genet. Med. 2007 9 427 441 10.1097/GIM.0b013e3180986192 17666889 Berg, J. S. et al. Speech delay and autism spectrum behaviors are frequently associated with duplication of the 7q11.23 Williams-Beuren syndrome region. Genet. Med. 9 17666889 10.1097/gim.0b013e3180986192 81. Mervis, C. B., et al. 7q11.23 Duplication Syndrome 26610320 82. Mervis CB Children with 7q11.23 duplication syndrome: psychological characteristics Am. J. Med. Genet. A 2015 167 1436 1450 10.1002/ajmg.a.37071 25900101 PMC4545595 Mervis, C. B. et al. Children with 7q11.23 duplication syndrome: psychological characteristics. Am. J. Med. Genet. A 167 25900101 10.1002/ajmg.a.37071 PMC4545595 83. Sanders StephanJ Multiple recurrent de novo CNVs, including duplications of the 7q11.23 Williams Syndrome region, are strongly associated with autism Neuron 2011 70 863 885 10.1016/j.neuron.2011.05.002 21658581 PMC3939065 Sanders, S. tephanJ. et al. Multiple recurrent de novo CNVs, including duplications of the 7q11.23 Williams Syndrome region, are strongly associated with autism. Neuron 70 21658581 10.1016/j.neuron.2011.05.002 PMC3939065 84. Van der Aa N Fourteen new cases contribute to the characterization of the 7q11.23 microduplication syndrome Eur. J. Med. Genet. 2009 52 94 100 10.1016/j.ejmg.2009.02.006 19249392 Van der Aa, N. et al. Fourteen new cases contribute to the characterization of the 7q11.23 microduplication syndrome. Eur. J. Med. Genet. 52 19249392 10.1016/j.ejmg.2009.02.006 85. Depienne C Autism, language delay and mental retardation in a patient with 7q11 duplication J. Med. Genet. 2007 44 452 458 10.1136/jmg.2006.047092 17400790 PMC1994965 Depienne, C. et al. Autism, language delay and mental retardation in a patient with 7q11 duplication. J. Med. Genet. 44 17400790 10.1136/jmg.2006.047092 PMC1994965 86. Dixit A 7q11.23 Microduplication: a recognizable phenotype Clin. Genet. 2013 83 155 161 10.1111/j.1399-0004.2012.01862.x 22369319 Dixit, A. et al. 7q11.23 Microduplication: a recognizable phenotype. Clin. Genet. 83 22369319 10.1111/j.1399-0004.2012.01862.x 87. Mulle JG Reciprocal duplication of the Williams-Beuren Syndrome deletion on chromosome 7q11.23 is associated with schizophrenia Biol. Psychiatry 2014 75 371 377 10.1016/j.biopsych.2013.05.040 23871472 PMC3838485 Mulle, J. G. et al. Reciprocal duplication of the Williams-Beuren Syndrome deletion on chromosome 7q11.23 is associated with schizophrenia. Biol. Psychiatry 75 23871472 10.1016/j.biopsych.2013.05.040 PMC3838485 88. Pober BR Williams–Beuren Syndrome N. Engl. J. Med. 2010 362 239 252 10.1056/NEJMra0903074 20089974 Pober, B. R. Williams–Beuren Syndrome. N. Engl. J. Med. 362 20089974 10.1056/NEJMra0903074 89. Kozel BA Williams syndrome Nat. Rev. Dis. Prim. 2021 7 42 10.1038/s41572-021-00276-z 34140529 PMC9437774 Kozel, B. A. et al. Williams syndrome. Nat. Rev. Dis. Prim. 7 34140529 10.1038/s41572-021-00276-z PMC9437774 90. Mervis CB The Williams Syndrome cognitive profile Brain Cogn. 2000 44 604 628 10.1006/brcg.2000.1232 11104544 Mervis, C. B. et al. The Williams Syndrome cognitive profile. Brain Cogn. 44 11104544 10.1006/brcg.2000.1232 91. Mervis CB Klein-Tasman BP Williams syndrome: Cognition, personality, and adaptive behavior Ment. Retard. Dev. Disabil. Res. Rev. 2000 6 148 158 10.1002/1098-2779(2000)6:2&#x0003c;148::AID-MRDD10&#x0003e;3.0.CO;2-T 10899809 Mervis, C. B. & Klein-Tasman, B. P. Williams syndrome: Cognition, personality, and adaptive behavior. Ment. Retard. Dev. Disabil. Res. Rev. 6 10899809 10.1002/1098-2779(2000)6:2<148::AID-MRDD10>3.0.CO;2-T 92. Meyer-Lindenberg A Mervis CB Faith Berman K Neural mechanisms in Williams syndrome: a unique window to genetic influences on cognition and behaviour Nat. Rev. Neurosci. 2006 7 380 393 10.1038/nrn1906 16760918 Meyer-Lindenberg, A., Mervis, C. B. & Faith Berman, K. Neural mechanisms in Williams syndrome: a unique window to genetic influences on cognition and behaviour. Nat. Rev. Neurosci. 7 16760918 10.1038/nrn1906 93. Morris, C. A. & Mervis, C. B. Williams Syndrome, in Cassidy and Allanson’s Management of Genetic Syndromes 94. Barak B Feng G Neurobiology of social behavior abnormalities in autism and Williams syndrome Nat. Neurosci. 2016 19 647 655 10.1038/nn.4276 29323671 PMC4896837 Barak, B. & Feng, G. Neurobiology of social behavior abnormalities in autism and Williams syndrome. Nat. Neurosci. 19 29323671 10.1038/nn.4276 PMC4896837 95. Crespi BJ Hurd PL Cognitive-behavioral phenotypes of Williams syndrome are associated with genetic variation in the GTF2I gene, in a healthy population BMC Neurosci. 2014 15 127 10.1186/s12868-014-0127-1 25429715 PMC4247780 Crespi, B. J. & Hurd, P. L. Cognitive-behavioral phenotypes of Williams syndrome are associated with genetic variation in the GTF2I gene, in a healthy population. BMC Neurosci. 15 25429715 10.1186/s12868-014-0127-1 PMC4247780 96. Mervis CB Duplication of GTF2I results in separation anxiety in mice and humans Am. J. Hum. Genet. 2012 90 1064 1070 10.1016/j.ajhg.2012.04.012 22578324 PMC3370270 Mervis, C. B. et al. Duplication of GTF2I results in separation anxiety in mice and humans. Am. J. Hum. Genet. 90 22578324 10.1016/j.ajhg.2012.04.012 PMC3370270 97. Morris CA GTF2I hemizygosity implicated in mental retardation in Williams syndrome: Genotype–phenotype analysis of five families with deletions in the Williams syndrome region Am. J. Med. Genet. Part A 2003 123A 45 59 10.1002/ajmg.a.20496 14556246 Morris, C. A. et al. GTF2I hemizygosity implicated in mental retardation in Williams syndrome: Genotype–phenotype analysis of five families with deletions in the Williams syndrome region. Am. J. Med. Genet. Part A 123A 14556246 10.1002/ajmg.a.20496 98. Sakurai T Haploinsufficiency of Gtf2i, a gene deleted in Williams Syndrome, leads to increases in social interactions Autism Res. 2011 4 28 39 10.1002/aur.169 21328569 Sakurai, T. et al. Haploinsufficiency of Gtf2i, a gene deleted in Williams Syndrome, leads to increases in social interactions. Autism Res. 4 21328569 10.1002/aur.169 99. López-Tobón A GTF2I dosage regulates neuronal differentiation and social behavior in 7q11.23 neurodevelopmental disorders Sci. Adv. 2023 9 eadh2726 10.1126/sciadv.adh2726 38019906 PMC10686562 López-Tobón, A. et al. GTF2I dosage regulates neuronal differentiation and social behavior in 7q11.23 neurodevelopmental disorders. Sci. Adv. 9 38019906 10.1126/sciadv.adh2726 PMC10686562 100. Dai, L., et al., Is it Williams syndrome? GTF2IRD1 implicated in visual-spatial construction and GTF2I in sociability revealed by high resolution arrays. Am. J. Med. Genet. A 149a 10.1002/ajmg.a.32652 PMC2650741 19205026 101. Antonell A Partial 7q11.23 deletions further implicate GTF2I and GTF2IRD1 as the main genes responsible for the Williams-Beuren syndrome neurocognitive profile J. Med. Genet. 2010 47 312 320 10.1136/jmg.2009.071712 19897463 Antonell, A. et al. Partial 7q11.23 deletions further implicate GTF2I and GTF2IRD1 as the main genes responsible for the Williams-Beuren syndrome neurocognitive profile. J. Med. Genet. 47 19897463 10.1136/jmg.2009.071712 102. Malenfant P Association of GTF2i in the Williams-Beuren syndrome critical region with autism spectrum disorders J. Autism Dev. Disord. 2012 42 1459 1469 10.1007/s10803-011-1389-4 22048961 Malenfant, P. et al. Association of GTF2i in the Williams-Beuren syndrome critical region with autism spectrum disorders. J. Autism Dev. Disord. 42 22048961 10.1007/s10803-011-1389-4 103. Tassabehji M GTF2IRD1 in craniofacial development of humans and mice Science 2005 310 1184 1187 10.1126/science.1116142 16293761 Tassabehji, M. et al. GTF2IRD1 in craniofacial development of humans and mice. Science 310 16293761 10.1126/science.1116142 104. Gagliardi C Unusual cognitive and behavioural profile in a Williams syndrome patient with atypical 7q11.23 deletion J. Med. Genet. 2003 40 526 530 10.1136/jmg.40.7.526 12843326 PMC1735517 Gagliardi, C. et al. Unusual cognitive and behavioural profile in a Williams syndrome patient with atypical 7q11.23 deletion. J. Med. Genet. 40 12843326 10.1136/jmg.40.7.526 PMC1735517 105. Karmiloff-Smith A Using case study comparisons to explore genotype-phenotype correlations in Williams-Beuren syndrome J. Med. Genet. 2003 40 136 140 10.1136/jmg.40.2.136 12566524 PMC1735363 Karmiloff-Smith, A. et al. Using case study comparisons to explore genotype-phenotype correlations in Williams-Beuren syndrome. J. Med. Genet. 40 12566524 10.1136/jmg.40.2.136 PMC1735363 106. Swartz JR A Common Polymorphism in a Williams Syndrome Gene Predicts Amygdala Reactivity and Extraversion in Healthy Adults Biol. Psychiatry 2017 81 203 210 10.1016/j.biopsych.2015.12.007 26853120 PMC4909599 Swartz, J. R. et al. A Common Polymorphism in a Williams Syndrome Gene Predicts Amygdala Reactivity and Extraversion in Healthy Adults. Biol. Psychiatry 81 26853120 10.1016/j.biopsych.2015.12.007 PMC4909599 107. Jabbi M Variation in the Williams syndrome GTF2I gene and anxiety proneness interactively affect prefrontal cortical response to aversive stimuli Transl. Psychiatry 2015 5 e622 e622 10.1038/tp.2015.98 26285132 PMC4564573 Jabbi, M. et al. Variation in the Williams syndrome GTF2I gene and anxiety proneness interactively affect prefrontal cortical response to aversive stimuli. Transl. Psychiatry 5 26285132 10.1038/tp.2015.98 PMC4564573 108. Kim K Association-heterogeneity mapping identifies an Asian-specific association of the GTF2I locus with rheumatoid arthritis Sci. Rep. 2016 6 27563 10.1038/srep27563 27272985 PMC4897688 Kim, K. et al. Association-heterogeneity mapping identifies an Asian-specific association of the GTF2I locus with rheumatoid arthritis. Sci. Rep. 6 27272985 10.1038/srep27563 PMC4897688 109. Li Y A genome-wide association study in Han Chinese identifies a susceptibility locus for primary Sjögren’s syndrome at 7q11.23 Nat. Genet. 2013 45 1361 1365 10.1038/ng.2779 24097066 Li, Y. et al. A genome-wide association study in Han Chinese identifies a susceptibility locus for primary Sjögren’s syndrome at 7q11.23. Nat. Genet. 45 24097066 10.1038/ng.2779 110. Kim I-K Mutant GTF2I induces cell transformation and metabolic alterations in thymic epithelial cells Cell Death Differ. 2020 27 2263 2279 10.1038/s41418-020-0502-7 32034314 PMC7308410 Kim, I.-K. et al. Mutant GTF2I induces cell transformation and metabolic alterations in thymic epithelial cells. Cell Death Differ. 27 32034314 10.1038/s41418-020-0502-7 PMC7308410 111. Petrini I A specific missense mutation in GTF2I occurs at high frequency in thymic epithelial tumors Nat. Genet. 2014 46 844 849 10.1038/ng.3016 24974848 PMC5705185 Petrini, I. et al. A specific missense mutation in GTF2I occurs at high frequency in thymic epithelial tumors. Nat. Genet. 46 24974848 10.1038/ng.3016 PMC5705185 112. Osso LA Chan JR A surprising role for myelin in Williams syndrome Nat. Neurosci. 2019 22 681 683 10.1038/s41593-019-0368-5 31011225 Osso, L. A. & Chan, J. R. A surprising role for myelin in Williams syndrome. Nat. Neurosci. 22 31011225 10.1038/s41593-019-0368-5 113. Kopp ND Functions of Gtf2i and Gtf2ird1 in the developing brain: transcription, DNA binding and long-term behavioral consequences Hum. Mol. Genet. 2020 29 1498 1519 10.1093/hmg/ddaa070 32313931 PMC7526791 Kopp, N. D. et al. Functions of Gtf2i and Gtf2ird1 in the developing brain: transcription, DNA binding and long-term behavioral consequences. Hum. Mol. Genet. 29 32313931 10.1093/hmg/ddaa070 PMC7526791 114. Lappe-Siefke C Disruption of Cnp1 uncouples oligodendroglial functions in axonal support and myelination Nat. Genet. 2003 33 366 374 10.1038/ng1095 12590258 Lappe-Siefke, C. et al. Disruption of Cnp1 uncouples oligodendroglial functions in axonal support and myelination. Nat. Genet. 33 12590258 10.1038/ng1095 115. Enkhmandakh B Generation of a mouse model for a conditional inactivation of Gtf2i allele genesis 2016 54 407 412 10.1002/dvg.22948 27194223 Enkhmandakh, B. et al. Generation of a mouse model for a conditional inactivation of Gtf2i allele. genesis 54 27194223 10.1002/dvg.22948 116. Roy AL Transcription factor TFII-I conducts a cytoplasmic orchestra ACS Chem. Biol. 2006 1 619 622 10.1021/cb6004323 17168565 Roy, A. L. Transcription factor TFII-I conducts a cytoplasmic orchestra. ACS Chem. Biol. 1 17168565 10.1021/cb6004323 117. Larocca, J. N. & Norton, W. T. Isolation of myelin. Curr. Protoc. Cell BIol. 33 10.1002/0471143030.cb0325s33 18228513 118. Grad M Altered white matter and microRNA expression in a murine model related to williams syndrome suggests that miR-34b/c affects brain development via Ptpru and Dcx modulation Cells 2022 11 158 10.3390/cells11010158 35011720 PMC8750756 Grad, M. et al. Altered white matter and microRNA expression in a murine model related to williams syndrome suggests that miR-34b/c affects brain development via Ptpru and Dcx modulation. Cells 11 35011720 10.3390/cells11010158 PMC8750756 119. Assaf Y Pasternak O Diffusion tensor imaging (DTI)-based white matter mapping in brain research: a review J. Mol. Neurosci. 2008 34 51 61 10.1007/s12031-007-0029-0 18157658 Assaf, Y. & Pasternak, O. Diffusion tensor imaging (DTI)-based white matter mapping in brain research: a review. J. Mol. Neurosci. 34 18157658 10.1007/s12031-007-0029-0 120. Blumenfeld-Katzir T Diffusion MRI of structural brain plasticity induced by a learning and memory task PLOS ONE 2011 6 e20678 10.1371/journal.pone.0020678 21701690 PMC3119075 Blumenfeld-Katzir, T. et al. Diffusion MRI of structural brain plasticity induced by a learning and memory task. PLOS ONE 6 21701690 10.1371/journal.pone.0020678 PMC3119075 121. Sampaio-Baptista C Motor skill learning induces changes in white matter microstructure and myelination J. Neurosci. 2013 33 19499 19503 10.1523/JNEUROSCI.3048-13.2013 24336716 PMC3858622 Sampaio-Baptista, C. et al. Motor skill learning induces changes in white matter microstructure and myelination. J. Neurosci. 33 24336716 10.1523/JNEUROSCI.3048-13.2013 PMC3858622 122. Friede RL Control of myelin formation by axon caliber (With a model of the control mechanism) J. Comp. Neurol. 1972 144 233 252 10.1002/cne.901440207 5029134 Friede, R. L. Control of myelin formation by axon caliber (With a model of the control mechanism). J. Comp. Neurol. 144 5029134 10.1002/cne.901440207 123. Yin X Myelin-associated glycoprotein is a myelin signal that modulates the caliber of myelinated axons J. Neurosci. 1998 18 1953 1962 10.1523/JNEUROSCI.18-06-01953.1998 9482781 PMC6792914 Yin, X. et al. Myelin-associated glycoprotein is a myelin signal that modulates the caliber of myelinated axons. J. Neurosci. 18 9482781 10.1523/JNEUROSCI.18-06-01953.1998 PMC6792914 124. Nave K-A Salzer JL Axonal regulation of myelination by neuregulin 1 Curr. Opin. Neurobiol. 2006 16 492 500 10.1016/j.conb.2006.08.008 16962312 Nave, K.-A. & Salzer, J. L. Axonal regulation of myelination by neuregulin 1. Curr. Opin. Neurobiol. 16 16962312 10.1016/j.conb.2006.08.008 125. Lee S A culture system to study oligodendrocyte myelination processes using engineered nanofibers Nat. Methods 2012 9 917 922 10.1038/nmeth.2105 22796663 PMC3433633 Lee, S. et al. A culture system to study oligodendrocyte myelination processes using engineered nanofibers. Nat. Methods 9 22796663 10.1038/nmeth.2105 PMC3433633 126. Mayoral SR Initiation of CNS myelination in the optic nerve is dependent on axon caliber Cell Rep. 2018 25 544 550.e3 10.1016/j.celrep.2018.09.052 30332636 PMC6258034 Mayoral, S. R. et al. Initiation of CNS myelination in the optic nerve is dependent on axon caliber. Cell Rep. 25 30332636 10.1016/j.celrep.2018.09.052 PMC6258034 127. Rushton WA A theory of the effects of fibre size in medullated nerve J. Physiol. 1951 115 101 122 10.1113/jphysiol.1951.sp004655 14889433 PMC1392008 Rushton, W. A. A theory of the effects of fibre size in medullated nerve. J. Physiol. 115 14889433 10.1113/jphysiol.1951.sp004655 PMC1392008 128. Waxman SG Determinants of conduction velocity in myelinated nerve fibers Muscle Nerve 1980 3 141 150 10.1002/mus.880030207 6245357 Waxman, S. G. Determinants of conduction velocity in myelinated nerve fibers. Muscle Nerve 3 6245357 10.1002/mus.880030207 129. Snaidero N Simons M Myelination at a glance J. Cell Sci. 2014 127 2999 3004 10.1242/jcs.151043 25024457 Snaidero, N. & Simons, M. Myelination at a glance. J. Cell Sci. 127 25024457 10.1242/jcs.151043 130. Fields RD White matter in learning, cognition and psychiatric disorders Trends Neurosci. 2008 31 361 370 10.1016/j.tins.2008.04.001 18538868 PMC2486416 Fields, R. D. White matter in learning, cognition and psychiatric disorders. Trends Neurosci. 31 18538868 10.1016/j.tins.2008.04.001 PMC2486416 131. Chomiak T Hu B What is the optimal value of the g-ratio for myelinated fibers in the rat CNS? A theoretical approach PLOS ONE 2009 4 e7754 10.1371/journal.pone.0007754 19915661 PMC2771903 Chomiak, T. & Hu, B. What is the optimal value of the g-ratio for myelinated fibers in the rat CNS? A theoretical approach. PLOS ONE 4 19915661 10.1371/journal.pone.0007754 PMC2771903 132. Pease-Raissi SE Chan JR Building a (w)rapport between neurons and oligodendroglia: Reciprocal interactions underlying adaptive myelination Neuron 2021 109 1258 1273 10.1016/j.neuron.2021.02.003 33621477 PMC8068592 Pease-Raissi, S. E. & Chan, J. R. Building a (w)rapport between neurons and oligodendroglia: Reciprocal interactions underlying adaptive myelination. Neuron 109 33621477 10.1016/j.neuron.2021.02.003 PMC8068592 133. Arancibia-Cárcamo IL Node of Ranvier length as a potential regulator of myelinated axon conduction speed eLife 2017 6 e23329 10.7554/eLife.23329 28130923 PMC5313058 Arancibia-Cárcamo, I. L. et al. Node of Ranvier length as a potential regulator of myelinated axon conduction speed. eLife 6 28130923 10.7554/eLife.23329 PMC5313058 134. Yu M Visual abnormalities associated with enhanced optic nerve myelination Brain Res. 2011 1374 36 42 10.1016/j.brainres.2010.12.043 21172315 PMC4395475 Yu, M. et al. Visual abnormalities associated with enhanced optic nerve myelination. Brain Res. 1374 21172315 10.1016/j.brainres.2010.12.043 PMC4395475 135. Fischer I Shank3 mutation impairs glutamate signaling and myelination in ASD mouse model and human iPSC-derived OPCs Sci. Adv. 2024 10 eadl4573 10.1126/sciadv.adl4573 39392881 PMC11468907 Fischer, I. et al. Shank3 mutation impairs glutamate signaling and myelination in ASD mouse model and human iPSC-derived OPCs. Sci. Adv. 10 39392881 10.1126/sciadv.adl4573 PMC11468907 136. Harty BL Monk KR Unwrapping the unappreciated: recent progress in Remak Schwann cell biology Curr. Opin. Neurobiol. 2017 47 131 137 10.1016/j.conb.2017.10.003 29096241 PMC5963510 Harty, B. L. & Monk, K. R. Unwrapping the unappreciated: recent progress in Remak Schwann cell biology. Curr. Opin. Neurobiol. 47 29096241 10.1016/j.conb.2017.10.003 PMC5963510 137. Giese KP Mouse P 0 Cell 1992 71 565 576 10.1016/0092-8674(92)90591-Y 1384988 Giese, K. P. et al. Mouse P 0 Cell 71 1384988 10.1016/0092-8674(92)90591-y 138. McKenzie IA Motor skill learning requires active central myelination Science 2014 346 318 322 10.1126/science.1254960 25324381 PMC6324726 McKenzie, I. A. et al. Motor skill learning requires active central myelination. Science 346 25324381 10.1126/science.1254960 PMC6324726 139. Xiao L Rapid production of new oligodendrocytes is required in the earliest stages of motor-skill learning Nat. Neurosci. 2016 19 1210 1217 10.1038/nn.4351 27455109 PMC5008443 Xiao, L. et al. Rapid production of new oligodendrocytes is required in the earliest stages of motor-skill learning. Nat. Neurosci. 19 27455109 10.1038/nn.4351 PMC5008443 140. De Zeeuw, C. I. & Ten Brinke, M. M. Motor learning and the cerebellum. Cold Spring Harbor Perspect Biol. 7 10.1101/cshperspect.a021683 PMC4563713 26330521 141. Lopes S Absence of Tau triggers age-dependent sciatic nerve morphofunctional deficits and motor impairment Aging Cell 2016 15 208 216 10.1111/acel.12391 26748966 PMC4783352 Lopes, S. et al. Absence of Tau triggers age-dependent sciatic nerve morphofunctional deficits and motor impairment. Aging Cell 15 26748966 10.1111/acel.12391 PMC4783352 142. Chen P Collagen VI regulates peripheral nerve myelination and function FASEB J. 2014 28 1145 1156 10.1096/fj.13-239533 24277578 Chen, P. et al. Collagen VI regulates peripheral nerve myelination and function. FASEB J. 28 24277578 10.1096/fj.13-239533 143. Xiu Y Ultrastructural abnormalities and loss of myelinated fibers in the corpus callosum of demyelinated mice induced by cuprizone J. Neurosci. Res. 2017 95 1677 1689 10.1002/jnr.23997 27935632 Xiu, Y. et al. Ultrastructural abnormalities and loss of myelinated fibers in the corpus callosum of demyelinated mice induced by cuprizone. J. Neurosci. Res. 95 27935632 10.1002/jnr.23997 144. Franco-Pons N Behavioral deficits in the cuprizone-induced murine model of demyelination/remyelination Toxicol. Lett. 2007 169 205 213 10.1016/j.toxlet.2007.01.010 17317045 Franco-Pons, N. et al. Behavioral deficits in the cuprizone-induced murine model of demyelination/remyelination. Toxicol. Lett. 169 17317045 10.1016/j.toxlet.2007.01.010 145. Erwig, M. S., et al. Myelin: methods for purification and proteome analysis, in D. A. Lyons and L. Kegel, (editors) Oligodendrocytes: Methods and Protocols 10.1007/978-1-4939-9072-6_3 30820892 146. Jahn, O., et al. The CNS myelin proteome: deep profile and persistence after post-mortem delay. Front. Cell. Neurosci. 14 10.3389/fncel.2020.00239 PMC7466725 32973451 147. Brunner C Differential ultrastructural localization of myelin basic protein, myelin/oligodendroglial glycoprotein, and 2′,3′-cyclic nucleotide 3′-phosphodiesterase in the CNS of adult rats J. Neurochem. 1989 52 296 304 10.1111/j.1471-4159.1989.tb10930.x 2462020 Brunner, C. et al. Differential ultrastructural localization of myelin basic protein, myelin/oligodendroglial glycoprotein, and 2′,3′-cyclic nucleotide 3′-phosphodiesterase in the CNS of adult rats. J. Neurochem. 52 2462020 10.1111/j.1471-4159.1989.tb10930.x 148. Yang H-J G protein-coupled receptor 37 is a negative regulator of oligodendrocyte differentiation and myelination Nat. Commun. 2016 7 10884 10.1038/ncomms10884 26961174 PMC4792952 Yang, H.-J. et al. G protein-coupled receptor 37 is a negative regulator of oligodendrocyte differentiation and myelination. Nat. Commun. 7 26961174 10.1038/ncomms10884 PMC4792952 149. Colman DR Synthesis and incorporation of myelin polypeptides into CNS myelin J. Cell Biol. 1982 95 598 608 10.1083/jcb.95.2.598 6183276 PMC2112951 Colman, D. R. et al. Synthesis and incorporation of myelin polypeptides into CNS myelin. J. Cell Biol. 95 6183276 10.1083/jcb.95.2.598 PMC2112951 150. Ainger K Transport and localization elements in myelin basic protein mRNA J. Cell Biol. 1997 138 1077 1087 10.1083/jcb.138.5.1077 9281585 PMC2136761 Ainger, K. et al. Transport and localization elements in myelin basic protein mRNA. J. Cell Biol. 138 9281585 10.1083/jcb.138.5.1077 PMC2136761 151. Carson JH Translocation of myelin basic protein mRNA in oligodendrocytes requires microtubules and kinesin Cell Motil. Cytoskeleton 1997 38 318 328 10.1002/(SICI)1097-0169(1997)38:4&#x0003c;318::AID-CM2&#x0003e;3.0.CO;2-# 9415374 Carson, J. H. et al. Translocation of myelin basic protein mRNA in oligodendrocytes requires microtubules and kinesin. Cell Motil. Cytoskeleton 38 9415374 10.1002/(SICI)1097-0169(1997)38:4<318::AID-CM2>3.0.CO;2-# 152. Bagheri H Myelin basic protein mRNA levels affect myelin sheath dimensions, architecture, plasticity, and density of resident glial cells Glia 2024 72 1893 1914 10.1002/glia.24589 39023138 PMC11426340 Bagheri, H. et al. Myelin basic protein mRNA levels affect myelin sheath dimensions, architecture, plasticity, and density of resident glial cells. Glia 72 39023138 10.1002/glia.24589 PMC11426340 153. Nir Sade A Neuronal Gtf2i deletion alters mitochondrial and autophagic properties Commun. Biol. 2023 6 1269 10.1038/s42003-023-05612-5 38097729 PMC10721858 Nir Sade, A. et al. Neuronal Gtf2i deletion alters mitochondrial and autophagic properties. Commun. Biol. 6 38097729 10.1038/s42003-023-05612-5 PMC10721858 154. Bercury KathrynK Macklin WendyB Dynamics and mechanisms of CNS myelination Dev. Cell 2015 32 447 458 10.1016/j.devcel.2015.01.016 25710531 PMC6715306 Bercury, K. athrynK. & Macklin, W. endyB. Dynamics and mechanisms of CNS myelination. Dev. Cell 32 25710531 10.1016/j.devcel.2015.01.016 PMC6715306 155. Trangle SS In individuals with Williams syndrome, dysregulation of methylation in non-coding regions of neuronal and oligodendrocyte DNA is associated with pathology and cortical development Mol. Psychiatry 2023 28 1112 1127 10.1038/s41380-022-01921-z 36577841 Trangle, S. S. et al. In individuals with Williams syndrome, dysregulation of methylation in non-coding regions of neuronal and oligodendrocyte DNA is associated with pathology and cortical development. Mol. Psychiatry 28 36577841 10.1038/s41380-022-01921-z 156. Makeyev AV Diversity and complexity in chromatin recognition by TFII-I transcription factors in pluripotent embryonic stem cells and embryonic tissues PLOS ONE 2012 7 e44443 10.1371/journal.pone.0044443 22970219 PMC3438194 Makeyev, A. V. et al. Diversity and complexity in chromatin recognition by TFII-I transcription factors in pluripotent embryonic stem cells and embryonic tissues. PLOS ONE 7 22970219 10.1371/journal.pone.0044443 PMC3438194 157. Iram T SRF transcriptionally regulates the oligodendrocyte cytoskeleton during CNS myelination Proc. Natl Acad. Sci. 2024 121 e2307250121 10.1073/pnas.2307250121 38483990 PMC10962977 Iram, T. et al. SRF transcriptionally regulates the oligodendrocyte cytoskeleton during CNS myelination. Proc. Natl Acad. Sci. 121 38483990 10.1073/pnas.2307250121 PMC10962977 158. Sock E Wegner M Using the lineage determinants Olig2 and Sox10 to explore transcriptional regulation of oligodendrocyte development Dev. Neurobiol. 2021 81 892 901 10.1002/dneu.22849 34480425 Sock, E. & Wegner, M. Using the lineage determinants Olig2 and Sox10 to explore transcriptional regulation of oligodendrocyte development. Dev. Neurobiol. 81 34480425 10.1002/dneu.22849 159. Liu Z Induction of oligodendrocyte differentiation by Olig2 and Sox10: evidence for reciprocal interactions and dosage-dependent mechanisms Dev. Biol. 2007 302 683 693 10.1016/j.ydbio.2006.10.007 17098222 Liu, Z. et al. Induction of oligodendrocyte differentiation by Olig2 and Sox10: evidence for reciprocal interactions and dosage-dependent mechanisms. Dev. Biol. 302 17098222 10.1016/j.ydbio.2006.10.007 160. Wedel M Transcription factor Tcf4 is the preferred heterodimerization partner for Olig2 in oligodendrocytes and required for differentiation Nucleic Acids Res. 2020 48 4839 4857 10.1093/nar/gkaa218 32266943 PMC7229849 Wedel, M. et al. Transcription factor Tcf4 is the preferred heterodimerization partner for Olig2 in oligodendrocytes and required for differentiation. Nucleic Acids Res. 48 32266943 10.1093/nar/gkaa218 PMC7229849 161. Wegener A Gain of Olig2 function in oligodendrocyte progenitors promotes remyelination Brain 2014 138 120 135 10.1093/brain/awu375 PMC4441088 25564492 Wegener, A. et al. Gain of Olig2 function in oligodendrocyte progenitors promotes remyelination. Brain 138 10.1093/brain/awu375 PMC4441088 25564492 162. Küspert M Olig2 regulates Sox10 expression in oligodendrocyte precursors through an evolutionary conserved distal enhancer Nucleic Acids Res. 2010 39 1280 1293 10.1093/nar/gkq951 20959288 PMC3045606 Küspert, M. et al. Olig2 regulates Sox10 expression in oligodendrocyte precursors through an evolutionary conserved distal enhancer. Nucleic Acids Res. 39 20959288 10.1093/nar/gkq951 PMC3045606 163. Li H Richardson WD The evolution of Olig genes and their roles in myelination Neuron Glia Biol. 2009 4 129 135 10.1017/S1740925X09990251 PMC6326352 19737433 Li, H. & Richardson, W. D. The evolution of Olig genes and their roles in myelination. Neuron Glia Biol. 4 10.1017/S1740925X09990251 PMC6326352 19737433 164. Bartosovic M Kabbe M Castelo-Branco G Single-cell CUT&Tag profiles histone modifications and transcription factors in complex tissues Nat. Biotechnol. 2021 39 825 835 10.1038/s41587-021-00869-9 33846645 PMC7611252 Bartosovic, M., Kabbe, M. & Castelo-Branco, G. Single-cell CUT&Tag profiles histone modifications and transcription factors in complex tissues. Nat. Biotechnol. 39 33846645 10.1038/s41587-021-00869-9 PMC7611252 165. Barski A High-resolution profiling of histone methylations in the human genome Cell 2007 129 823 837 10.1016/j.cell.2007.05.009 17512414 Barski, A. et al. High-resolution profiling of histone methylations in the human genome. Cell 129 17512414 10.1016/j.cell.2007.05.009 166. Bannister AJ Spatial distribution of di- and tri-methyl lysine 36 of histone H3 at active genes * J. Biol. Chem. 2005 280 17732 17736 10.1074/jbc.M500796200 15760899 Bannister, A. J. et al. Spatial distribution of di- and tri-methyl lysine 36 of histone H3 at active genes *. J. Biol. Chem. 280 15760899 10.1074/jbc.M500796200 167. Werner T Multiple conserved regulatory elements with overlapping functions determine Sox10 expression in mouse embryogenesis Nucleic Acids Res. 2007 35 6526 6538 10.1093/nar/gkm727 17897962 PMC2095789 Werner, T. et al. Multiple conserved regulatory elements with overlapping functions determine Sox10 expression in mouse embryogenesis. Nucleic Acids Res. 35 17897962 10.1093/nar/gkm727 PMC2095789 168. Pliner HA Cicero predicts cis-regulatory DNA interactions from single-cell chromatin accessibility data Mol. Cell 2018 71 858 871.e8 10.1016/j.molcel.2018.06.044 30078726 PMC6582963 Pliner, H. A. et al. Cicero predicts cis-regulatory DNA interactions from single-cell chromatin accessibility data. Mol. Cell 71 30078726 10.1016/j.molcel.2018.06.044 PMC6582963 169. Hagège H Quantitative analysis of chromosome conformation capture assays (3C-qPCR) Nat. Protoc. 2007 2 1722 1733 10.1038/nprot.2007.243 17641637 Hagège, H. et al. Quantitative analysis of chromosome conformation capture assays (3C-qPCR). Nat. Protoc. 2 17641637 10.1038/nprot.2007.243 170. Kim D A principled strategy for mapping enhancers to genes Sci. Rep. 2019 9 11043 10.1038/s41598-019-47521-w 31363138 PMC6667464 Kim, D. et al. A principled strategy for mapping enhancers to genes. Sci. Rep. 9 31363138 10.1038/s41598-019-47521-w PMC6667464 171. Cheng N STAG2 promotes the myelination transcriptional program in oligodendrocytes eLife 2022 11 e77848 10.7554/eLife.77848 35959892 PMC9439679 Cheng, N. et al. STAG2 promotes the myelination transcriptional program in oligodendrocytes. eLife 11 35959892 10.7554/eLife.77848 PMC9439679 172. Thakurela S The transcriptome of mouse central nervous system myelin Sci. Rep. 2016 6 25828 10.1038/srep25828 27173133 PMC4865983 Thakurela, S. et al. The transcriptome of mouse central nervous system myelin. Sci. Rep. 6 27173133 10.1038/srep25828 PMC4865983 173. Emery, B. & Lu, Q. R. Transcriptional and epigenetic regulation of oligodendrocyte development and myelination in the central nervous system. Cold Spring Harbor Perspect. Biol. 7 10.1101/cshperspect.a020461 PMC4563712 26134004 174. Ong C-T Corces VG CTCF: an architectural protein bridging genome topology and function Nat. Rev. Genet. 2014 15 234 246 10.1038/nrg3663 24614316 PMC4610363 Ong, C.-T. & Corces, V. G. CTCF: an architectural protein bridging genome topology and function. Nat. Rev. Genet. 15 24614316 10.1038/nrg3663 PMC4610363 175. Chen L Spatiotemporal 7q11.23 protein network analysis implicates the role of DNA repair pathway during human brain development Sci. Rep. 2021 11 8246 10.1038/s41598-021-87632-x 33859276 PMC8050238 Chen, L. et al. Spatiotemporal 7q11.23 protein network analysis implicates the role of DNA repair pathway during human brain development. Sci. Rep. 11 33859276 10.1038/s41598-021-87632-x PMC8050238 176. Roy AL Role of the multifunctional transcription factor TFII-I in DNA damage repair DNA Repair 2021 106 103175 10.1016/j.dnarep.2021.103175 34280590 Roy, A. L. Role of the multifunctional transcription factor TFII-I in DNA damage repair. DNA Repair 106 34280590 10.1016/j.dnarep.2021.103175 177. Tanikawa M Role of multifunctional transcription factor TFII-I and putative tumour suppressor DBC1 in cell cycle and DNA double strand damage repair Br. J. Cancer 2013 109 3042 3048 10.1038/bjc.2013.532 24231951 PMC3859932 Tanikawa, M. et al. Role of multifunctional transcription factor TFII-I and putative tumour suppressor DBC1 in cell cycle and DNA double strand damage repair. Br. J. Cancer 109 24231951 10.1038/bjc.2013.532 PMC3859932 178. Pfister SophiaX SETD2-dependent histone H3K36 trimethylation is required for homologous recombination repair and genome stability Cell Rep. 2014 7 2006 2018 10.1016/j.celrep.2014.05.026 24931610 PMC4074340 Pfister, S. ophiaX. et al. SETD2-dependent histone H3K36 trimethylation is required for homologous recombination repair and genome stability. Cell Rep. 7 24931610 10.1016/j.celrep.2014.05.026 PMC4074340 179. Li F The histone mark H3K36me3 regulates human DNA mismatch repair through its interaction with MutSα Cell 2013 153 590 600 10.1016/j.cell.2013.03.025 23622243 PMC3641580 Li, F. et al. The histone mark H3K36me3 regulates human DNA mismatch repair through its interaction with MutSα. Cell 153 23622243 10.1016/j.cell.2013.03.025 PMC3641580 180. Fruttiger M Crucial role for the myelin-associated glycoprotein in the maintenance of axon-myelin integrity Eur. J. Neurosci. 1995 7 511 515 10.1111/j.1460-9568.1995.tb00347.x 7539694 Fruttiger, M. et al. Crucial role for the myelin-associated glycoprotein in the maintenance of axon-myelin integrity. Eur. J. Neurosci. 7 7539694 10.1111/j.1460-9568.1995.tb00347.x 181. Griffiths I Axonal Swellings and degeneration in mice lacking the major proteolipid of myelin Science 1998 280 1610 1613 10.1126/science.280.5369.1610 9616125 Griffiths, I. et al. Axonal Swellings and degeneration in mice lacking the major proteolipid of myelin. Science 280 9616125 10.1126/science.280.5369.1610 182. Nave KA Myelination and support of axonal integrity by glia Nature 2010 468 244 252 10.1038/nature09614 21068833 Nave, K. A. Myelination and support of axonal integrity by glia. Nature 468 21068833 10.1038/nature09614 183. Nave KA Myelination and the trophic support of long axons Nat. Rev. Neurosci. 2010 11 275 283 10.1038/nrn2797 20216548 Nave, K. A. Myelination and the trophic support of long axons. Nat. Rev. Neurosci. 11 20216548 10.1038/nrn2797 184. Traka M Oligodendrocyte death results in immune-mediated CNS demyelination Nat. Neurosci. 2016 19 65 74 10.1038/nn.4193 26656646 PMC4837900 Traka, M. et al. Oligodendrocyte death results in immune-mediated CNS demyelination. Nat. Neurosci. 19 26656646 10.1038/nn.4193 PMC4837900 185. He J Exosome-specific loading Sox10 for the treatment of Cuprizone-induced demyelinating model Biomed. Pharmacother. 2024 171 116128 10.1016/j.biopha.2024.116128 38218078 He, J. et al. Exosome-specific loading Sox10 for the treatment of Cuprizone-induced demyelinating model. Biomed. Pharmacother. 171 38218078 10.1016/j.biopha.2024.116128 186. Matsushima GK Morell P The neurotoxicant, cuprizone, as a model to study demyelination and remyelination in the central nervous system Brain Pathol. 2001 11 107 116 10.1111/j.1750-3639.2001.tb00385.x 11145196 PMC8098267 Matsushima, G. K. & Morell, P. The neurotoxicant, cuprizone, as a model to study demyelination and remyelination in the central nervous system. Brain Pathol. 11 11145196 10.1111/j.1750-3639.2001.tb00385.x PMC8098267 187. Shao Y Effect of Sox10 on remyelination of the hippocampus in cuprizone-induced demyelinated mice Brain Behav. 2020 10 e01623 10.1002/brb3.1623 32363773 PMC7303379 Shao, Y. et al. Effect of Sox10 on remyelination of the hippocampus in cuprizone-induced demyelinated mice. Brain Behav. 10 32363773 10.1002/brb3.1623 PMC7303379 188. Fujiwara S SOX10 transactivates S100B to suppress schwann cell proliferation and to promote myelination PLOS ONE 2014 9 e115400 10.1371/journal.pone.0115400 25536222 PMC4275212 Fujiwara, S. et al. SOX10 transactivates S100B to suppress schwann cell proliferation and to promote myelination. PLOS ONE 9 25536222 10.1371/journal.pone.0115400 PMC4275212 189. He D Chd7 cooperates with Sox10 and regulates the onset of CNS myelination and remyelination Nat. Neurosci. 2016 19 678 689 10.1038/nn.4258 26928066 PMC4846514 He, D. et al. Chd7 cooperates with Sox10 and regulates the onset of CNS myelination and remyelination. Nat. Neurosci. 19 26928066 10.1038/nn.4258 PMC4846514 190. Qian Z Osteocalcin attenuates oligodendrocyte differentiation and myelination via GPR37 signaling in the mouse brain Sci. Adv. 2021 7 eabi5811 10.1126/sciadv.abi5811 34678058 PMC8535816 Qian, Z. et al. Osteocalcin attenuates oligodendrocyte differentiation and myelination via GPR37 signaling in the mouse brain. Sci. Adv. 7 34678058 10.1126/sciadv.abi5811 PMC8535816 191. Yan Z Myelin basic protein enhances axonal regeneration from neural progenitor cells Cell Biosci. 2021 11 80 10.1186/s13578-021-00584-7 33926552 PMC8082623 Yan, Z. et al. Myelin basic protein enhances axonal regeneration from neural progenitor cells. Cell Biosci. 11 33926552 10.1186/s13578-021-00584-7 PMC8082623 192. Smith GST Nucleus-localized 21.5-kDa myelin basic protein promotes oligodendrocyte proliferation and enhances neurite outgrowth in coculture, unlike the plasma membrane-associated 18.5-kDa isoform J. Neurosci. Res. 2013 91 349 362 10.1002/jnr.23166 23184356 PMC3569502 Smith, G. S. T. et al. Nucleus-localized 21.5-kDa myelin basic protein promotes oligodendrocyte proliferation and enhances neurite outgrowth in coculture, unlike the plasma membrane-associated 18.5-kDa isoform. J. Neurosci. Res. 91 23184356 10.1002/jnr.23166 PMC3569502 193. Etxeberria A Dynamic modulation of myelination in response to visual stimuli alters optic nerve conduction velocity J. Neurosci. 2016 36 6937 6948 10.1523/JNEUROSCI.0908-16.2016 27358452 PMC4926240 Etxeberria, A. et al. Dynamic modulation of myelination in response to visual stimuli alters optic nerve conduction velocity. J. Neurosci. 36 27358452 10.1523/JNEUROSCI.0908-16.2016 PMC4926240 194. Rasband MN CNP is required for maintenance of axon–glia interactions at nodes of Ranvier in the CNS Glia 2005 50 86 90 10.1002/glia.20165 15657937 Rasband, M. N. et al. CNP is required for maintenance of axon–glia interactions at nodes of Ranvier in the CNS. Glia 50 15657937 10.1002/glia.20165 195. Leemans, A., et al. ExploreDTI: a graphical toolbox for processing. Proc. Int. Soc. Mag. Reson. Med. 17 196. Fischer I Hyperbaric oxygen therapy alleviates social behavior dysfunction and neuroinflammation in a mouse model for autism spectrum disorders Int. J. Mol. Sci. 2022 23 11077 10.3390/ijms231911077 36232395 PMC9570008 Fischer, I. et al. Hyperbaric oxygen therapy alleviates social behavior dysfunction and neuroinflammation in a mouse model for autism spectrum disorders. Int. J. Mol. Sci. 23 36232395 10.3390/ijms231911077 PMC9570008 197. Schmittgen TD Livak KJ Analyzing real-time PCR data by the comparative CT method Nat. Protoc. 2008 3 1101 1108 10.1038/nprot.2008.73 18546601 Schmittgen, T. D. & Livak, K. J. Analyzing real-time PCR data by the comparative CT method. Nat. Protoc. 3 18546601 10.1038/nprot.2008.73 198. Barak B Neuron-specific expression of tomosyn1 in the mouse hippocampal dentate gyrus impairs spatial learning and memory NeuroMol. Med. 2013 15 351 363 10.1007/s12017-013-8223-4 PMC3651758 23519441 Barak, B. et al. Neuron-specific expression of tomosyn1 in the mouse hippocampal dentate gyrus impairs spatial learning and memory. NeuroMol. Med. 15 10.1007/s12017-013-8223-4 PMC3651758 23519441 199. Heinz S Simple combinations of lineage-determining transcription factors prime cis-regulatory elements required for macrophage and B cell identities Mol. Cell 2010 38 576 589 10.1016/j.molcel.2010.05.004 20513432 PMC2898526 Heinz, S. et al. Simple combinations of lineage-determining transcription factors prime cis-regulatory elements required for macrophage and B cell identities. Mol. Cell 38 20513432 10.1016/j.molcel.2010.05.004 PMC2898526 200. Robinson JT Integrative genomics viewer Nat. Biotechnol. 2011 29 24 26 10.1038/nbt.1754 21221095 PMC3346182 Robinson, J. T. et al. Integrative genomics viewer. Nat. Biotechnol. 29 21221095 10.1038/nbt.1754 PMC3346182 201. Ovcharenko I ECR Browser: a tool for visualizing and accessing data from comparisons of multiple vertebrate genomes Nucleic Acids Res. 2004 32 W280 W286 10.1093/nar/gkh355 15215395 PMC441493 Ovcharenko, I. et al. ECR Browser: a tool for visualizing and accessing data from comparisons of multiple vertebrate genomes. Nucleic Acids Res. 32 15215395 10.1093/nar/gkh355 PMC441493 202. Hinrichs AS The UCSC Genome Browser Database: update 2006 Nucleic Acids Res. 2006 34 D590 D598 10.1093/nar/gkj144 16381938 PMC1347506 Hinrichs, A. S. et al. The UCSC Genome Browser Database: update 2006. Nucleic Acids Res. 34 16381938 10.1093/nar/gkj144 PMC1347506 203. Perez-Riverol Y The PRIDE database resources in 2022: a hub for mass spectrometry-based proteomics evidences Nucleic Acids Res. 2021 50 D543 D552 10.1093/nar/gkab1038 PMC8728295 34723319 Perez-Riverol, Y. et al. The PRIDE database resources in 2022: a hub for mass spectrometry-based proteomics evidences. Nucleic Acids Res. 50 10.1093/nar/gkab1038 PMC8728295 34723319 ",
  "metadata": {
    "Title of this paper": "The PRIDE database resources in 2022: a hub for mass spectrometry-based proteomics evidences",
    "Journal it was published in:": "Nature Communications",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12474925/"
  }
}