{
  "title": "Paper_932",
  "abstract": "pmc Sci Rep Sci Rep 1579 scirep Scientific Reports 2045-2322 Nature Publishing Group PMC12485105 PMC12485105.1 12485105 12485105 41028782 10.1038/s41598-025-09882-3 9882 1 Article Hepatoprotective potential of M3F, a benzimidazole pyrazole derivative, against paracetamol induced hepatotoxicity Ilyas Zaineb 1 Rehman Ayema 1 Nadeem Humaira 2 Noman Muhammad 1 Noor Rimsha 1 Irshad Nadeem nirshad@qau.edu.pk 1 1 https://ror.org/04s9hft57 grid.412621.2 0000 0001 2215 1297 Department of Pharmacy, Faculty of Biological Sciences, Quaid-I-Azam University, 2 https://ror.org/02kdm5630 grid.414839.3 0000 0001 1703 6673 Riphah Institute of Pharmaceutical Sciences, Riphah International University, 30 9 2025 2025 15 478255 33888 10 4 2025 30 6 2025 30 09 2025 02 10 2025 02 10 2025 © The Author(s) 2025 2025 https://creativecommons.org/licenses/by-nc-nd/4.0/ Open Access http://creativecommons.org/licenses/by-nc-nd/4.0/ Hepatotoxicity, a critical liver damage often caused by drugs like paracetamol (PCM), involves oxidative stress, inflammation, and cellular injury. This study investigates the hepatoprotective potential of a benzimidazole-pyrazole derivative, 2-((1H-benzo[d]imidazol-2-yl) thio)-1-(3-(2-fluorophenyl)-5-phenyl-1H-pyrazol-1-yl) ethanone (M3F), using both in silico and in vivo approaches. Pharmacokinetic profiling was performed using SwissADME and ProTox to predict drug-likeness and toxicity. Molecular docking studies were conducted using AutoDock Vina integrated with PyRx to evaluate the binding affinity of M3F with key targets related to oxidative stress and inflammation. Subsequently, in vivo studies were conducted using a PCM-induced hepatotoxicity model in mice, wherein M3F was administered orally at doses of 100, 200, and 400 µg/kg for seven consecutive days, followed by a single dose of PCM (300 mg/kg, intraperitoneally) on the eighth day to induce liver injury. Serum markers of liver damage, lipid profiling, antioxidant assays, histopathological examinations and molecular markers analysis were performed to determine the therapeutic effects of M3F. In silico analysis revealed favorable pharmacokinetic properties and strong binding affinities of M3F to inflammatory and oxidative stress-related molecular targets. In vivo, M3F treatment led to a marked improvement in liver enzyme levels and lipid profiles, along with significant histological recovery of liver tissue. The study demonstrated a significant downregulation of IL-6, IL-1β, and TNF-α protein levels, as measured by ELISA, indicating reduced inflammatory responses following M3F treatment. Additionally, PCR analysis revealed a notable decrease in the mRNA expression levels of IL-17, NF-κB, and TLR4, alongside an increase in Nrf2 and HO-1 transcript levels. It is suggested that M3F demonstrated notable hepatoprotective effects in PCM-induced liver injury through dual modulation of inflammatory (NF-κB) and antioxidant (Nrf2) pathways. These findings support its potential as a novel hepatoprotective candidate for future studies. Keywords Benzimidazoles Hepatotoxicity Inflammation Liver Oxidative stress Paracetamol pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement yes pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes issue-copyright-statement © Springer Nature Limited 2025 Introduction The liver plays a crucial role in various physiological functions, such as metabolism, detoxification, and production of essential biomolecules, which are essential for maintaining homeostasis and overall health 1 2 3 4 PCM is primarily metabolized in the liver through glucuronidation and sulfation, which render the drug water-soluble for renal excretion. However, a minor fraction—approximately 5%—is metabolized by the cytochrome P450 enzyme CYP2E1, resulting in the formation of a highly reactive intermediate, N-acetyl-p-benzoquinone imine (NAPQI). Under normal conditions, glutathione (GSH) conjugates and detoxifies NAPQI, rendering it harmless. In cases of paracetamol overdose, the glucuronidation and sulfation pathways become saturated, and excessive NAPQI is produced. The hepatic glutathione stores are rapidly depleted, leading to the accumulation of free NAPQI. This toxic metabolite binds covalently to essential cellular proteins, including mitochondrial proteins, initiating a cascade of oxidative stress and cellular damage. A critical consequence of this process is the uncoupling of oxidative phosphorylation within mitochondria, impairing ATP synthesis. This leads to energy failure, the development of lactic acidosis, and the pathological release of ionized calcium from mitochondrial stores. These disturbances collectively contribute to mitochondrial dysfunction, activation of cell death pathways, and ultimately hepatocellular apoptosis and necrosis 5 7 8 9 10 11 12 Benzimidazole and pyrazole are two pharmacologically significant heterocycles that have garnered considerable attention due to their diverse and potent biological activities 13 14 15 16 17 18 19 20 21 22 On the other hand, pyrazole moieties have demonstrated significant pharmacological potential, contributing to antimicrobial 23 24 25 26 27 29 30 In recent decades, the incorporation of fluorine into heterocyclic scaffolds has revolutionized drug design and development. Fluorine, the most electronegative element, imparts significant electronic effects due to its high polarization potential (μ C − F = 1.41 D), enhancing drug-target interactions and metabolic stability. Fluorinated compounds now constitute roughly one-quarter of all pharmaceuticals on the market 31 32 33 Together, the fusion of benzimidazole and pyrazole moieties, with the added benefit of fluorine substitution, creates a privileged scaffold with enhanced therapeutic potential. This hybrid framework offers a multi-targeted pharmacophore system with robust anti-inflammatory and antioxidant making it an attractive candidate for further investigation in the management of oxidative liver injuries and associated pathologies. The compound investigated in this study, 2-((1H-benzo[d]imidazol-2-yl) thio)-1-(3-(2-fluorophenyl)-5-phenyl-1H-pyrazol-1-yl) ethanone (M3F) as shown in Fig. 1 24 13 21 29 34 Fig. 1 2D Structure of M3F (2-((1H-benzo[d]imidazol-2-yl) thio-1-(3-(2-fluorophenyl)-5-phenyl-1Hazol-1-yl) ethanone). Materials and methods Chemicals PCM, Silymarin (SIL) (Sigma-Aldrich), diaminobenzidine (DAB) (Sigma-Aldrich), sulfuric acid, paraformaldehyde, xylene, 1-Chloro-2,4-Dinitrobenzene (CDNB) and 5,5'-Dithio-bis-(2-Nitrobenzoic Acid) (DTNB) (Sigma-Aldrich, St. Louis, MO, USA). Other reagent used in this study adhered to high-purity specifications. Animal housing Thirty-six healthy BALB/cAnN male mice (6–8 weeks old, weighing 28–36 g), procured from the National Institute of Health, Islamabad, are housed under regulated conditions at the Department of Pharmacy, Quaid-i-Azam Universsity. The experiments were designed to minimize harm to the animals. Mice were housed in polypropylene cages under controlled conditions, including a 12-h light–dark cycle, 50–60% relative humidity and a temperature of 22 ± 3 °C, with unrestricted access to water and standard food. All methods and procedures were conducted in accordance with relevant guidelines and regulations. This study received approval from the Bioethics Committee of Quaid-i-Azam University (Reference Number # BEC-FBS-QAU2024-686). Computational studies ADME and toxicity predictions Absorption, Distribution, Metabolism, and Excretion (ADME) evaluations were performed using Swiss ADME ( http://www.swissadme.ch/ https://tox.charite.de/protox3/index.php?site=compound_input 35 36 37 Protein preparation The 3D structures of target proteins (Interleukin-6 (IL-6), Interleukin-1 beta (IL-1β), Tumor Necrosis Factor-alpha (TNF-α), Interleukin-17 (IL-17), Nuclear Factor kappa-light-chain-enhancer of activated B cells (NF-κB), Nuclear Factor Erythroid 2-Related Factor 2 (Nrf2), Heme Oxygenase-1 (HO-1), and Toll-Like Receptor 4 (TLR4) were retrieved from the Protein Data Bank (PDB), with corresponding PDB IDs: 1ALU, 9ILB, 2AZ5, 4HR9, 1VKX, 2FLU, 1IRM, 3VQ2, respectively. These protein structures were opened and prepared using BIOVIA Discovery Studio Visualizer 2020. Water molecules and non-essential ligands were removed, and the cleaned protein structures were saved in PDB format for docking 38 Ligand preparation The ligand M3F, was drawn using ChemDraw and converted into 3D format. The 3D ligand file was imported into PyRx 0.8 for energy minimization and converted into the .pdbqt format for docking. Molecular docking protocol Molecular docking was performed using AutoDock Vina integrated with PyRx 0.8. The grid center was placed in the active site pocket center. Protein and ligands were converted to pdb.qt files. Default docking algorithms were set in conformation with the standard docking protocol. Independent docking runs were carried out for each ligand–protein complex. The docking results were evaluated using AutoDock Vina’s scoring function, which considers key interactions such as hydrogen bonding, hydrophobic contacts, and binding affinity to predict the stability and strength of ligand–protein binding 38 39 Study design Following a one-week acclimatization period, mice were randomly divided into six groups (n = 6) and treated for eight consecutive days. For seven days, the vehicle control group received 0.9% normal saline +  < 0.1% DMSO i.p i.p. i.p. 40 41 42 2 Fig. 2 Schematic representation of hepatoprotective model plan created using Microsoft PowerPoint. The visual elements (such as images of mice, liver, etc.) were sourced from Google Images for illustrative purposes. Sample collection Twenty-four hours post-PCM administration, animals were deeply anesthetized using a combination of xylazine (30 mg/kg body weight; 0.15 ml/100 g) and ketamine (300 mg/kg body weight; 0.3 ml/100 g) i.p. 43 Biochemical examination Serum was used to study markers of liver damage, including Alanine aminotransferase (ALT), aspartate aminotransferase (AST), and alkaline phosphatase (ALP), total protein and bilirubin were determined as mentioned by 44 45 46 47 43 48 50 Antioxidant assay The liver homogenate supernatant was analyzed for catalase (CAT), glutathione (GSH), glutathione-S-transferase (GST), and nitric oxide (NO) levels following the method described by 51 52 Liver weight to body weight assessment To evaluate the hepatoprotective effects of the M3F, liver weight was determined and presented as a proportion of total body weight, serving as a marker for liver hypertrophy or atrophy, as reported in earlier findings 48 50 Histopathological analysis Isolated tissue samples were fixed in a 10% formalin solution, followed by dehydration and embedding in paraffin blocks. Thin sections of 5 µm were prepared and stained with hematoxylin and eosin (H&E). Histopathological alterations among the experimental groups were examined under a light microscope. Microscopic slides were examined, and images were captured using a microscope (Olympus CX41). To minimize experimenter bias during image collection and analysis, the experimenter was blinded to the treatment groups throughout all phases of the study 53 54 Pro-inflammatory cytokines ELISA was conducted in accordance with the instructions provided by the manufacturer. Standards and liver supernatants were added to pre-coated 96-well plates, followed by incubation with biotinylated antibodies and streptavidin-HRP. After adding TMB substrate, the reaction was stopped with sulfuric acid, and optical density was read at 450 nm. Cytokine levels (IL-6, IL-1β, and TNF-α) were quantified by analyzing all samples in triplicate 47 55 Real-time polymerase chain reaction RNA extraction protocol involved processing the sample with RNA Digestion Buffer and Proteinase K at 55 °C for 15 min, followed by centrifugation. The supernatant was mixed with ethanol, loaded onto a HiPure RNA Mini Column, and centrifuged to bind RNA. The column was washed with Buffer RNA Wash Concentrate (RWC), treated with DNase I for 15 min to remove DNA, and washed again with Buffer RWC. Two additional washes with Buffer RW2 were performed, and the column was dried by centrifugation. RNA was eluted by adding RNase-free water to the membrane, incubating for 2 min, and centrifuging. Extracted RNA was kept at − 80 °C, with an optional re-elution step for higher yields. Each reaction was conducted in triplicate to maintain reliability and precision. Following expression analysis, the 2 −ΔΔCT 56 1 Table 1 Primers for real-time PCR analysis. Gene name Primer sequence IL-17 F: TCCAGAAGGCCCTCAGACTACC R: AGGCTCCCTCTTCAGGACCAG NF-κB F: GCAAAGGGAACATTCCGATAT R: GCGACATCACATGGAAATCTA Nrf2 F: TCCTATGCGTGAATCCCAAT R: GCGGCTTGAATGTTTGTCTT HO-1 F: GGGCTGTGAACTCTGTCCAAT R: GGTGAGGGAACTGTGTCAGG TLR4 F: TTCATGTCGTGTTCTCATGG R: TGCGCTCGCATCATGTTC Statistical evaluation Data was analysed using SPSS version 27 for Windows (IBM Corp, Armonk, NY, USA) to compute the means. Data were presented as mean ± SEM. One-way ANOVA followed by the Least Significant Difference (LSD), a post-hoc test was used to determine statistically significant differences between group means. This test was used to assess statistical significance, with p Results In silico analysis Drug-likeness M3F exhibits a molecular weight of 428.48 g/mol, a topological polar surface area of 88.87 Å2, one hydrogen bond donor, and four hydrogen bond acceptors, as shown in Fig. 3 Fig. 3 M3F drug likeness and pharmacokinetic properties. Toxicity prediction M3F exhibits an LD₅₀ value of 1000 mg/kg (Fig. 4 Fig. 4 Evaluation of M3F toxicity by ProTox. Molecular docking Molecular docking studies revealed strong binding affinities ( − 7.1 to − 11.2 kcal/mol) of M3F to key inflammatory and oxidative stress-related targets. The binding affinity followed the order: TLR4 > HO-1 > NF-κB > TNF-α > IL-17 > IL-6 > IL-1β > Nrf2. Detailed interactions, including binding energy, hydrogen bonding, and hydrophobic interactions, are summarized in Table 2 5 Table 2 Binding affinities and interaction profiles of M3F with target proteins from docking studies. Target-compound Binding affinity (kcal/mol) H-bond Halogen-bond Hydrophobic interactions IL-6-M3F − 8.6 LEU B:57 ASN C:136 – PHE C:134, PHE C:168, ALA B:56 IL-1β-M3F − 8.1 PRO A:78 LEU A:134 GLU A:25 TRP A:120, LYS A:77, MET A:130, PRO A:131 TNF-α-M3F − 8.7 – LEU C:120 TYR C:59, Leu c:57 IL-17-M3F − 8.6 GLN A:94 GLU A:95 TRP B:67 ILE A:96, GLU A:95 VAL B:119, VAL B:117, VAL B:65, ILE B:96, ILE B:66, LEU A:97, PRO B:63 NF-кB-M3F − 9.4 SER B:363 ARG B:356, ILE B:439 VAL B:412, ASN B:436, PRO B:362, VAL B:358 Nrf2-M3F − 7.1 ARG A:84 – ARG A:84, VAL A:90, LEU A:86, LYS A:83, PRO A:36 HO-1-M3F − 10.4 THR B:168 – LEU B:141, VAL B:146, PHE B:169, ILE B:172, PRO B:175 TLR-4-M3F − 11.2 – – PHE D:104, PHE D:151, VAL D:63, VAL D:61, LEU D:94 ALA D:135, ILE D:117, LEU D:94 Fig. 5 3D interaction of M3F against selected macromolecule IL-6 ( a b c d e f g h Liver biochemistry Vehicle control group showed ALT, AST, ALP, total protein and bilirubin levels as 37 u/l, 85 u/l, 108 u/l, 4.8 g/dl and 0.24 mg/dl. PCM significantly altered levels as 1796 u/l, 2439 u/l, 438 u/l, 9.6 g/dl and 0.95 mg/dl. SIL 100 mg/kg + PCM group showed values of 828 u/l, 1676 u/l, 304 u/l, 5.06 g/dl, and 0.52 mg/dl. At a dose of 100 µg/kg + PCM the values were 1463 u/l, 1884 u/l, 285 u/l, 6.4 g/dl, and 0.64 mg/dl, respectively. At a dose of 200 µg/kg + PCM the values were recorded as 1428 u/l, 1371 u/l, 259 u/l, 5.48 g/dl, and 0.54 mg/dl, respectively. M3F 400 µg/kg + PCM) showed values of 278 u/l, 326 u/l, 118 u/l, 5.2 g/dl, 0.43 mg/dl (Fig. 6 Fig. 6 Effect of M3F on ALT ( a b c d e p p p ### p Lipid profile In the vehicle control group, TG, TC, LDL, VLDL, HDL, CRI and AIP levels are 110.12 mg/dl, 110.10 mg/dl, 33.53 mg/dl, 23.19 mg/dl, 61.42 mg/dl, 2.09 and 0.31, respectively. PCM significantly altered the lipid profile as 171.57 mg/dl, 187.44 mg/dl, 126.15 mg/dl, 34.06 mg/dl, 27.15 mg/dl, 7.46 and 0.81, respectively. SIL 100 mg/kg + PCM showed values of 129.44 mg/dl, 139.40 mg/dl, 72.20 mg/dl, 26.06 mg/dl, 41.88 mg/dl, 3.4 and 0.49, respectively. In the M3F 100 µg/kg + PCM group, the values were 139.06 mg/dl, 149.88 mg/dl, 86.0 mg/dl, 27.63 mg/dl, 36.44 mg/dl, 4.36 and 0.59, respectively. The M3F 200 µg/kg + PCM group showed values of 129.62 mg/dl, 131.42 mg/dl, 60.8 mg/dl, 27.51 mg/dl, 43.62 mg/dl, 3.10 and 0.47, respectively. The M3F 400 µg/kg + PCM group exhibited the most significant changes, with values of 119.19 mg/dl, 122.98 mg/dl, 40.8 mg/dl, 24.17 mg/dl, 58.16 mg/dl, 2.1 and 0.3, respectively, as demonstrated in Fig. 7 Fig. 7 Effect of M3F on Lipid Profile: TG ( a b c d e f g p p p ### p Hematological parameters In the vehicle control group, hematological parameters including RBC, Hb, platelet and WBC are: 10.90 ± 0.79 × 10 6 3 3 6 3 3 6 3 3 6 3 3 6 3 3 6 3 3 3 Table 3 Effect of M3F on hematological parameters in PCM-treated mice. Sample RBC (10 6 Hb (g/dl) Platelets (10 3 WBC (10 3 Vehicle control 10.90 ± 0.79 15.79 ± 0.41 901.2 ± 2s5.97 20 ± 1.30 PCM 6.82 ± 0.58 ## 11.27 ± 0.61 ### 598.2 ± 32.65 ### 29.2 ± 0.86 ### SIL + PCM 10.78 ± 0.57** 14.77 ± 0.89** 784.6 ± 40.24** 22.2 ± 1.46** M3F 100 μg/Kg + PCM 9.31 ± 0.70* 14.09 ± 0.62** 648.6 ± 27.42 NS 23.2 ± 1.56** M3F 200 μg/Kg + PCM 10.60 ± 0.55** 15.14 ± 0.84** 757.8 ± 32.88** 22 ± 2** M3F 400 μg/Kg + PCM 10.43 ± 0.91** 15.80 ± 0.64*** 796.6 ± 57.08** 21.8 ± 1.46** Each value represents mean ± S.E.M (n = 5), analyzed by One Way ANOVA using the LSD test for multiple comparisons. Level of significance is presented as * p p p ### p Serum electrolytes Serum electrolytes such as sodium, potassium and bicarbonate levels are shown in Table 4 Table 4 Effect of M3F on electrolyte profile in PCM-treated mice. Sample Sodium (mEq/L) Potassium (mEq/L) Bicarbonate (mEq/L) Vehicle control 144.4 ± 6.29 8.1 ± 1.01 25.0 ± 2.73 PCM 108.8 ± 5.10 ### 14.3 ± 1.06 ## 44.1 ± 2.44 ### SIL + PCM 137.4 ± 5.24*** 8.4 ± 1.50** 27.6 ± 3.08** M3F 100 μg/Kg + PCM 131.6 ± 5.09** 10.7 ± 1.41* 31.5 ± 2.20** M3F 200 μg/Kg + PCM 136.8 ± 4.55** 8.7 ± 0.92** 26.0 ± 3.46*** M3F 400 μg/Kg + PCM 148.6 ± 7.14*** 7.4 ± 0.78*** 23.6 ± 3.91*** Each value represents mean ± S.E.M (n = 5), analyzed by One Way ANOVA using the LSD test for multiple comparisons. Level of significance is presented as * p p p ### p Antioxidant markers Vehicle control group showed CAT, GSH, GST and NO levels as 29.56 mmol/L/min/0.1 g tissue, 61.61 mmol/L/min/0.1 g tissue, 70.71 mmol/L/min/0.1 g tissue and 93.06 nmol/g of the liver tissue, respectively. PCM group showed values as 9.49 mmol/L/min/0.1 g tissue, 17.72 mmol/L/min/0.1 g tissue, 23.20 mmol/L/min/0.1 g tissue and 145.46 nmol/g of the liver tissue, respectively. SIL 100 mg/kg + PCM group showed values of 23.27 mmol/L/min/0.1 g tissue, 60.75 mmol/L/min/0.1 g tissue, 62.93 mmol/L/min/0.1 g tissue, and 128.8 nmol/g of the liver tissue, respectively. However, M3F (100 µg/kg) + PCM group showed values as 19.60 mmol/L/min/0.1 g tissue, 45.29 mmol/L/min/0.1 g tissue, 49.41 mmol/L/min/0.1 g tissue and 133.33 nmol/g of the liver tissue, respectively. M3F (200 µg/kg) + PCM group, as 20.88 mmol/L/min/0.1 g tissue, 52.19 mmol/L/min/0.1 g tissue, 55.12 mmol/L/min/0.1 g tissue and 133.46 nmol/g of the tissue, respectively, and M3F (400 µg/kg) + PCM group, as 25.65 mmol/L/min/0.1 g tissue, 54.87 mmol/L/min/0.1 g tissue, 68.01 mmol/L/min/0.1 g tissue and 127.20 nmol/g of the liver tissue, respectively, as shown in Fig. 8 Fig. 8 Effect of M3F on Antioxidant Activity. Catalase ( a b c d p p p ### p Liver weight to body weight variation In the vehicle control group, the liver weight to body weight percentage was noted as 2.86% which is significantly increased in PCM group as 5.94%. In the SIL 100 mg/kg + PCM group, the percentage was reduced to 4.11%. Treatment with M3F (100, 200, and 400 µg/kg) showed decreased liver weight to body weight percentage as 4.63%, 4.41%, and 3.93%, respectively, as presented in Fig. 9 Fig. 9 Effect of M3F on Percent change in Liver Weight/Body Weight in PCM-treated mice. Each value represents mean ± S.E.M (n = 5), analyzed by One Way ANOVA using the LSD test for multiple comparisons. Level of significance is presented as * p p p ### p Histopathological findings Vehicle control group displayed normal liver architecture. In contrast, PCM (300 mg/kg) induced severe hepatic damage, including widespread degeneration, hepatocyte necrosis, hemorrhage, and neutrophil infiltration. Treatment with M3F (100, 200, and 400 µg/kg) reduced necrosis, restored structural integrity, and promoted hepatocyte regeneration, with the highest dose yielding the most significant improvements, as illustrated in Fig. 10 Fig. 10 Histopathological Examination: H&E Staining of Liver Tissue. ( a b c d e f ELISA assessment IL-6, IL-1β and TNF-α levels in vehicle control group were 21%, 19%, and 12% respectively. The pro‐inflammatory cytokine showed a significant increase in the PCM group, however SIL 100 mg/kg + PCM group has inflammatory cytokine levels of 74%, 68% and 62%, respectively. Treatment with M3F 100 µg/kg + PCM further lowered the levels to 80%, 78%, and 67%, respectively. The M3F 200 µg/kg + PCM group demonstrated greater reductions to 64%, 67%, and 55%, respectively. Notably, the M3F 400 µg/kg + PCM group achieved the most significant decrease, with levels dropping to 42%, 44%, and 40%, respectively, as illustrated in Fig. 11 Fig. 11 Effect of M3F on Pro-inflammatory Cytokine Analysis by ELISA. IL-6% ( a b c p p p ### p PCR analysis PCM significantly increased IL-17, NF-κB, Nrf2, HO-1 and TLR4 expression (3.08, 2.55, 0.52, 0.61, and 1.99). Treatment with M3F (M3F 400 µg/kg + PCM group) resulted in a significant reduction in IL-17, NF-κB and TLR4 expression (1.61, 1.60 and 1.49), and increase in Nrf2 and HO-1 expression (1.46 and 1.50) (Fig. 12 Fig. 12 Effect of M3F on PCR Analysis. Gene expression of IL-17 ( a b c d e p p p ### p a b Discussion PCM is a widely used non-prescription analgesic and antipyretic agent; however, excessive consumption is a major contributor to acute liver failure globally 57 58 ADME analysis of M3F revealed favorable pharmacokinetic properties, including efficient absorption, distribution, metabolism, and excretion, along with high lipophilicity, suggesting its potential for effective systemic delivery. Additionally, M3F complies with Lipinski’s rule of five and exhibits a high LD₅₀ value (1000 mg/kg), indicating good drug-likeness and low toxicity (Class 4) 59 M3F’s hepatoprotective effect was assessed in in vivo studies using biochemical, molecular, and histopathological analyses. Fasting prior to PCM administration is a well-established practice in hepatotoxicity models, as it depletes GSH reserves and enhances the susceptibility of hepatocytes to NAPQI-induced oxidative injury 41 40 42 Despite complexity of mechanism of action, it is evident from literature that PCM depletes hepatic glutathione, leading to oxidative stress, cellular damage, and hepatocyte necrosis 58 60 61 62 63 64 65 66 17 67 Hematological abnormalities, including decreased RBCs, platelets, and hemoglobin levels, along with increased WBCs, were observed in the PCM group. These findings are also reported in past literature 60 68 69 70 71 72 PCM triggers massive cellular degeneration, necrotic hepatocytes, hemorrhage, and neutrophil infiltration as evident in earlier findings 60 73 PCM induced hepatocyte necrosis which resulted in the release of intracellular components, that activates TLR4 leading to NF-κB signaling pathways, ultimately driving the upregulation of inflammatory cytokines, as noted in earlier findings 9 74 75 76 77 10 11 78 Previous studies have reported that numerous hepatoprotective compounds alleviate PCM-induced hepatotoxicity by activating Nrf2-regulated pathways 11 79 80 Notably, our current findings show M3F treatment exhibited a dose-dependent reduction in inflammatory cytokines (IL-6, IL-1β, TNF-α) compared to the PCM group (though levels remained elevated versus vehicle group), suggesting selective modulation of inflammatory pathways without complete suppression of PCM’s metabolic cascade. Future studies are warranted to conduct in vitro CYP activity assays using liver microsomes, pre-PCM GSH levels, protein adduct quantification and to analyze early-phase plasma and hepatic levels of PCM and its metabolites using HPLC or LC–MS to conclusively determine whether M3F influences, if at all, the metabolic activation cascade of PCM. Conclusion Based on the observed antioxidant and anti-inflammatory effects, M3F demonstrates preliminary hepatoprotective potential in a PCM-induced liver injury model, supporting its consideration for further pharmacological evaluation. Supplementary Information  Supplementary Information 1. Supplementary Information 2. Abbreviations AIP Atherogenic index of plasma ALP Alkaline phosphatase ALT Alanine aminotransferase AST Aspartate aminotransferase CRI Coronary risk index DTNB 5,5'-Dithio-bis-(2-Nitrobenzoic Acid) ELISA Enzyme-linked immunosorbent assay GSH Glutathione GST Glutathione S-transferase H&E Hematoxylin and eosin Hb Hemoglobin HDL High-density lipoprotein HO-1 Heme oxygenase-1 i.p. Intraperitoneal IL-1β Interleukin-1 beta IL-6 Interleukin-6 IL-17 Interleukin-17 LDL Low-density lipoprotein LD₅₀ Lethal dose, 50% M3F Test drug NAPQI N-Acetyl-p-benzoquinone imine NF-κB Nuclear factor kappa-light-chain-enhancer of activated B cells NO Nitric oxide Nrf2 Nuclear factor erythroid 2-related factor 2 PCM Paracetamol PCR Polymerase chain reaction RBC Red blood cells SIL Silymarin TC Total cholesterol TG Triglycerides Publisher’s note Springer Nature remains neutral with regard to jurisdictional claims in published maps and institutional affiliations. Supplementary Information The online version contains supplementary material available at 10.1038/s41598-025-09882-3. Acknowledgements The authors are thankful to the Department of Pharmacy, Quaid-i-Azam University Islamabad, Pakistan, for helping in this research work. Author contributions Zaineb Ilyas: Original Draft Preparation, Review & Editing, Methodology Development, Experimentation, Statistical Evaluation, Dataset Management. Ayema Rehman: Review, Editing, Methodology. Dr. Humaira Nadeem: Resources, Validation. Muhammad Noman: Methodology, Analysis Rimsha Noor: Formal Analysis. Dr. Nadeem Irshad: – Supervision, Manuscript Revision, Oversight, Resources. Data availability All relevant data generated in this study are available in the supplementary file submitted with this manuscript. Declarations Competing interests The authors declare no competing interests. Ethics approval All procedures followed the ethical guidelines set by the ARRIVE guidelines and the Laboratory Animal Resources Commission on Life Sciences University, National Research Council (1996). This study was approved by the Bio‐Ethics Committee of Quaid‐i‐Azam University (Reference Number # BEC-FBS-QAU2024-686). References 1. Chiang J. Liver physiology: MetaboLism and detoxification. pp. 1770–1782 (2014). 2. Trefts E Gannon M Wasserman DH The liver Curr Biol. 2017 27 21 R1147 R1151 10.1016/j.cub.2017.09.019 29112863 PMC5897118 Trefts, E., Gannon, M. & Wasserman, D. H. The liver. Curr Biol. 27 29112863 10.1016/j.cub.2017.09.019 PMC5897118 3. Tian L Mi N Wang L Huang C Fu W Bai M Regular use of paracetamol and risk of liver cancer: a prospective cohort study BMC Cancer 2024 24 1 33 10.1186/s12885-023-11767-5 38178090 PMC10765829 Tian, L. et al. Regular use of paracetamol and risk of liver cancer: a prospective cohort study. BMC Cancer 24 38178090 10.1186/s12885-023-11767-5 PMC10765829 4. El-Serag HB Kanwal F Feng Z Marrero JA Khaderi S Singal AG Risk factors for cirrhosis in contemporary hepatology practices-findings from the Texas hepatocellular carcinoma consortium cohort Gastroenterology 2020 159 1 376 377 10.1053/j.gastro.2020.03.049 32234536 PMC8375364 El-Serag, H. B. et al. Risk factors for cirrhosis in contemporary hepatology practices-findings from the Texas hepatocellular carcinoma consortium cohort. Gastroenterology 159 32234536 10.1053/j.gastro.2020.03.049 PMC8375364 5. Liao J Lu Q Li Z Li J Zhao Q Li J Acetaminophen-induced liver injury: Molecular mechanism and treatments from natural products Front Pharmacol 2023 14 11226323 10.3389/fphar.2023.1122632 PMC10083499 37050900 Liao, J. et al. Acetaminophen-induced liver injury: Molecular mechanism and treatments from natural products. Front Pharmacol 14 10.3389/fphar.2023.1122632 PMC10083499 37050900 6. Sharma CV Mehta V Paracetamol: Mechanisms and updates Contin Education Anaesth Crit Care Pain 2013 14 4 153 158 Sharma, C. V. & Mehta, V. Paracetamol: Mechanisms and updates. Contin Education Anaesth Crit Care Pain 14 7. Chidiac AS Buckley NA Firouzeh N Cairns R Paracetamol (acetaminophen) overdose and hepatotoxicity: mechanism, treatment, prevention measures, and estimates of burden of disease Expert Opinion Drug Metabol Toxicol 2023 19 5 297 317 10.1080/17425255.2023.2223959 37436926 Chidiac, A. S., Buckley, N. A., Firouzeh, N. & Cairns, R. Paracetamol (acetaminophen) overdose and hepatotoxicity: mechanism, treatment, prevention measures, and estimates of burden of disease. Expert Opinion Drug Metabol Toxicol 19 10.1080/17425255.2023.2223959 37436926 8. Kolios G Valatas V Kouroumalis E Role of Kupffer cells in the pathogenesis of liver disease World J Gastroenterol. 2006 12 46 7413 7420 10.3748/wjg.v12.i46.7413 17167827 PMC4087584 Kolios, G., Valatas, V. & Kouroumalis, E. Role of Kupffer cells in the pathogenesis of liver disease. World J Gastroenterol. 12 17167827 10.3748/wjg.v12.i46.7413 PMC4087584 9. Jiang W-P Deng J-S Huang S-S Wu S-H Chen C-C Liao J-C Sanghuangporus sanghuang mycelium prevents paracetamol-induced hepatotoxicity through regulating the MAPK/NF-κB, Keap1/Nrf2/HO-1, TLR4/PI3K/Akt, and CaMKKβ/LKB1/AMPK Pathways and Suppressing Oxidative Stress and Inflammation Antioxidants 2021 10 6 897 10.3390/antiox10060897 34199606 PMC8226512 Jiang, W.-P. et al. Sanghuangporus sanghuang mycelium prevents paracetamol-induced hepatotoxicity through regulating the MAPK/NF-κB, Keap1/Nrf2/HO-1, TLR4/PI3K/Akt, and CaMKKβ/LKB1/AMPK Pathways and Suppressing Oxidative Stress and Inflammation. Antioxidants 10 34199606 10.3390/antiox10060897 PMC8226512 10. Taniki N Nakamoto N Chu PS Ichikawa M Teratani T Kanai T Th17 cells in the liver: Balancing autoimmunity and pathogen defense Semin Immunopathol. 2022 44 4 509 526 10.1007/s00281-022-00917-9 35211777 Taniki, N. et al. Th17 cells in the liver: Balancing autoimmunity and pathogen defense. Semin Immunopathol. 44 35211777 10.1007/s00281-022-00917-9 11. Shen X-L Guo Y-N Lu M-H Ding K-N Liang S-S Mou R-W Acetaminophen-induced hepatotoxicity predominantly via inhibiting Nrf2 antioxidative pathway and activating TLR4-NF-κB-MAPK inflammatory response in mice Ecotoxicol. Environ. Saf. 2023 252 114590 10.1016/j.ecoenv.2023.114590 36738614 Shen, X.-L. et al. Acetaminophen-induced hepatotoxicity predominantly via inhibiting Nrf2 antioxidative pathway and activating TLR4-NF-κB-MAPK inflammatory response in mice. Ecotoxicol. Environ. Saf. 252 36738614 10.1016/j.ecoenv.2023.114590 12. Benlamkaddem S Iken I Houari N Elbouazzaoui A Boukatta B Sbai H Paracetamol self-poisoning: When oral N-acetylcysteine saves life? A case report Pan Afr Med J. 2018 29 83 10.11604/pamj.2018.29.83.10595 29875964 PMC5987070 Benlamkaddem, S. et al. Paracetamol self-poisoning: When oral N-acetylcysteine saves life? A case report. Pan Afr Med J. 29 29875964 10.11604/pamj.2018.29.83.10595 PMC5987070 13. Marinescu M Synthesis of antimicrobial benzimidazole-pyrazole compounds and their biological activities Antibiotics 2021 10 8 1002 10.3390/antibiotics10081002 34439052 PMC8389006 Marinescu, M. Synthesis of antimicrobial benzimidazole-pyrazole compounds and their biological activities. Antibiotics 10 34439052 10.3390/antibiotics10081002 PMC8389006 14. Veerasamy R Roy A Karunakaran R Rajak H Structure-activity relationship analysis of benzimidazoles as emerging anti-inflammatory agents: An overview Pharmaceuticals (Basel) 2021 14 7 663 10.3390/ph14070663 34358089 PMC8308831 Veerasamy, R., Roy, A., Karunakaran, R. & Rajak, H. Structure-activity relationship analysis of benzimidazoles as emerging anti-inflammatory agents: An overview. Pharmaceuticals (Basel) 14 34358089 10.3390/ph14070663 PMC8308831 15. Hussein EM Guesmi NE Maji TK Jassas RS Alsimaree AA Altass HM Synthesis and photophysical properties of benzimidazoles grafted pyrazole-containing pyrene or fluorene moiety: A combined spectroscopic and computational study J. Photochem. Photobiol., A 2021 419 113465 10.1016/j.jphotochem.2021.113465 Hussein, E. M. et al. Synthesis and photophysical properties of benzimidazoles grafted pyrazole-containing pyrene or fluorene moiety: A combined spectroscopic and computational study. J. Photochem. Photobiol., A 419 16. Bano S Nadeem H Zulfiqar I Shahzadi T Anwar T Bukhari A Masaud SM Synthesis and anti-inflammatory activity of benzimidazole derivatives; an in vitro, in vivo and in silico approach Heliyon 2024 10 9 e30102 10.1016/j.heliyon.2024.e30102 38726192 PMC11078874 Bano, S. et al. Synthesis and anti-inflammatory activity of benzimidazole derivatives; an in vitro, in vivo and in silico approach. Heliyon 10 38726192 10.1016/j.heliyon.2024.e30102 PMC11078874 17. Sheikha GA Bkhaitan MM Kalloush H Hamadneh L Khalaf RA Al-Qirim T Al-Hiari Y Synthesis of novel benzimidazole-2-carboxamide derivatives and in Vivo Chem. Pharm. Bull. 2018 66 4 423 426 10.1248/cpb.c17-00908 29607907 Sheikha, G. A. et al. Synthesis of novel benzimidazole-2-carboxamide derivatives and in Vivo Chem. Pharm. Bull. 66 10.1248/cpb.c17-00908 29607907 18. Iqbal H Verma AK Yadav P Alam S Shafiq M Mishra D Antihypertensive effect of a novel angiotensin ii receptor blocker fluorophenyl benzimidazole: Contribution of cGMP, voltage-dependent calcium channels, and BK(Ca) channels to vasorelaxant mechanisms Front Pharmacol. 2021 12 611109 10.3389/fphar.2021.611109 33859561 PMC8042648 Iqbal, H. et al. Antihypertensive effect of a novel angiotensin ii receptor blocker fluorophenyl benzimidazole: Contribution of cGMP, voltage-dependent calcium channels, and BK(Ca) channels to vasorelaxant mechanisms. Front Pharmacol. 12 33859561 10.3389/fphar.2021.611109 PMC8042648 19. Tahlan S Kumar S Narasimhan B Antimicrobial potential of 1H-benzo[d]imidazole scaffold: A review BMC Chemistry. 2019 13 1 18 10.1186/s13065-019-0521-y 31384767 PMC6661827 Tahlan, S., Kumar, S. & Narasimhan, B. Antimicrobial potential of 1H-benzo[d]imidazole scaffold: A review. BMC Chemistry. 13 31384767 10.1186/s13065-019-0521-y PMC6661827 20. Tonelli M Novelli F Tasso B Vazzana I Sparatore A Boido V Antiviral activity of benzimidazole derivatives III Novel anti-CVB-5, anti-RSV and anti-Sb-1 agents Bioorg Med Chem 2014 22 17 4893 4909 10.1016/j.bmc.2014.06.043 25082514 Tonelli, M. et al. Antiviral activity of benzimidazole derivatives III Novel anti-CVB-5, anti-RSV and anti-Sb-1 agents. Bioorg Med Chem 22 25082514 10.1016/j.bmc.2014.06.043 21. Lee YT Tan YJ Oon CE Benzimidazole and its derivatives as cancer therapeutics: The potential role from traditional to precision medicine Acta pharmaceutica Sinica B. 2023 13 2 478 497 10.1016/j.apsb.2022.09.010 36873180 PMC9978992 Lee, Y. T., Tan, Y. J. & Oon, C. E. Benzimidazole and its derivatives as cancer therapeutics: The potential role from traditional to precision medicine. Acta pharmaceutica Sinica B. 13 36873180 10.1016/j.apsb.2022.09.010 PMC9978992 22. Kumar R Marianesan AB Pathak S Benzimidazole as a privileged scaffold in drug design and discovery Curr Top Med Chem. 2024 24 17 1504 1528 10.2174/0115680266314704240522112439 38818908 Kumar, R., Marianesan, A. B. & Pathak, S. Benzimidazole as a privileged scaffold in drug design and discovery. Curr Top Med Chem. 24 38818908 10.2174/0115680266314704240522112439 23. Aa M Antibacterial pyrazoles: Tackling resistant bacteria Future Med Chem. 2022 14 5 343 362 10.4155/fmc-2021-0275 35050719 PMC8890142 Aa, M. Antibacterial pyrazoles: Tackling resistant bacteria. Future Med Chem. 14 35050719 10.4155/fmc-2021-0275 PMC8890142 24. Noor A Qazi NG Nadeem H Khan A Zafar R Ali F Saeed A Synthesis, characterization, anti-ulcer action and molecular docking evaluation of novel benzimidazole-pyrazole hybrids Chem. Central J. 2017 11 1 33 10.1186/s13065-017-0314-0 PMC5581743 29086868 Noor, A. et al. Synthesis, characterization, anti-ulcer action and molecular docking evaluation of novel benzimidazole-pyrazole hybrids. Chem. Central J. 11 10.1186/s13065-017-0314-0 PMC5581743 29086868 25. Bennani FE Doudach L Cherrah Y Ramli Y Karrouchi K Ansar Mh Faouzi MEA Overview of recent developments of pyrazole derivatives as an anticancer agent in different cell line Bioorg. Chem. 2020 97 103470 10.1016/j.bioorg.2019.103470 32120072 Bennani, F. E. et al. Overview of recent developments of pyrazole derivatives as an anticancer agent in different cell line. Bioorg. Chem. 97 32120072 10.1016/j.bioorg.2019.103470 26. Ali SA Awad SM Said AM Mahgoub S Taha H Ahmed NM Design, synthesis, molecular modelling and biological evaluation of novel 3-(2-naphthyl)-1-phenyl-1H-pyrazole derivatives as potent antioxidants and 15-Lipoxygenase inhibitors J. Enzyme Inhib. Med. Chem. 2020 35 1 847 863 10.1080/14756366.2020.1742116 32216479 PMC7170299 Ali, S. A. et al. Design, synthesis, molecular modelling and biological evaluation of novel 3-(2-naphthyl)-1-phenyl-1H-pyrazole derivatives as potent antioxidants and 15-Lipoxygenase inhibitors. J. Enzyme Inhib. Med. Chem. 35 32216479 10.1080/14756366.2020.1742116 PMC7170299 27. Keri RS Hiremathad A Budagumpi S Nagaraja BM Comprehensive review in current developments of benzimidazole-based medicinal chemistry Chem. Biol. Drug Des. 2015 86 1 19 65 10.1111/cbdd.12462 25352112 Keri, R. S., Hiremathad, A., Budagumpi, S. & Nagaraja, B. M. Comprehensive review in current developments of benzimidazole-based medicinal chemistry. Chem. Biol. Drug Des. 86 25352112 10.1111/cbdd.12462 28. Mahesh SV Manoj NB Sanjay KR Divya JJ Prachi TA Dhaval BP Hitesh DP Benzimidazole: A milestone in the field of medicinal chemistry Mini-Rev. Med. Chem. 2020 20 7 532 565 10.2174/1389557519666191122125453 31755386 Mahesh, S. V. et al. Benzimidazole: A milestone in the field of medicinal chemistry. Mini-Rev. Med. Chem. 20 31755386 10.2174/1389557519666191122125453 29. Zheng Y Zheng M Ling X Liu Y Xue Y An L Design, synthesis, quantum chemical studies and biological activity evaluation of pyrazole–benzimidazole derivatives as potent Aurora A/B kinase inhibitors Bioorg. Med. Chem. Lett. 2013 23 12 3523 3530 10.1016/j.bmcl.2013.04.039 23664099 Zheng, Y. et al. Design, synthesis, quantum chemical studies and biological activity evaluation of pyrazole–benzimidazole derivatives as potent Aurora A/B kinase inhibitors. Bioorg. Med. Chem. Lett. 23 23664099 10.1016/j.bmcl.2013.04.039 30. Adardour M Ait Lahcen M Oubahmane M Ettahiri W Hdoufane I Bouamama H Design, synthesis, molecular modeling and biological evaluation of novel pyrazole benzimidazolone derivatives as potent antioxidants Pharmaceuticals (Basel) 2023 16 12 1648 10.3390/ph16121648 38139775 PMC10747449 Adardour, M. et al. Design, synthesis, molecular modeling and biological evaluation of novel pyrazole benzimidazolone derivatives as potent antioxidants. Pharmaceuticals (Basel) 16 38139775 10.3390/ph16121648 PMC10747449 31. Wang J Sánchez-Roselló M Aceña JL del Pozo C Sorochinsky AE Fustero S Fluorine in pharmaceutical industry: Fluorine-containing drugs introduced to the market in the last decade (2001–2011) Chem. Rev. 2014 114 4 2432 2506 10.1021/cr4002879 24299176 Wang, J. et al. Fluorine in pharmaceutical industry: Fluorine-containing drugs introduced to the market in the last decade (2001–2011). Chem. Rev. 114 24299176 10.1021/cr4002879 32. Al-Harthy T Zoghaib W Abdel-Jalil R Importance of fluorine in benzazole compounds Molecules 2020 25 20 4677 10.3390/molecules25204677 33066333 PMC7587361 Al-Harthy, T., Zoghaib, W. & Abdel-Jalil, R. Importance of fluorine in benzazole compounds. Molecules 25 33066333 10.3390/molecules25204677 PMC7587361 33. Sanchez JP Domagala JM Hagen SE Heifetz CL Hutt MP Nichols JB Trehan AK Quinolone antibacterial agents. Synthesis and structure-activity relationships of 8-substituted quinoline-3-carboxylic acids and 1 8-naphthyridine-3-carboxylic acids J. Med. Chem. 1988 31 5 983 991 10.1021/jm00400a016 3361584 Sanchez, J. P. et al. Quinolone antibacterial agents. Synthesis and structure-activity relationships of 8-substituted quinoline-3-carboxylic acids and 1 8-naphthyridine-3-carboxylic acids. J. Med. Chem. 31 3361584 10.1021/jm00400a016 34. Noor A Qazi NG Nadeem H Khan A-u Paracha RZ Ali F Saeed A Synthesis, characterization, anti-ulcer action and molecular docking evaluation of novel benzimidazole-pyrazole hybrids Chem. Central J. 2017 11 1 85 10.1186/s13065-017-0314-0 PMC5581743 29086868 Noor, A. et al. Synthesis, characterization, anti-ulcer action and molecular docking evaluation of novel benzimidazole-pyrazole hybrids. Chem. Central J. 11 10.1186/s13065-017-0314-0 PMC5581743 29086868 35. Abdullahi SH Uzairu A Shallangwa GA Uba S Umar AB Computational modeling, ligand-based drug design, drug-likeness and ADMET properties studies of series of chromen-2-ones analogues as anti-cancer agents Bull. Nat. Res. Centre 2022 46 1 177 10.1186/s42269-022-00869-y Abdullahi, S. H., Uzairu, A., Shallangwa, G. A., Uba, S. & Umar, A. B. Computational modeling, ligand-based drug design, drug-likeness and ADMET properties studies of series of chromen-2-ones analogues as anti-cancer agents. Bull. Nat. Res. Centre 46 36. Jia C-Y Li J-Y Hao G-F Yang G-F A drug-likeness toolbox facilitates ADMET study in drug discovery Drug Discov. Today 2020 25 1 248 258 10.1016/j.drudis.2019.10.014 31705979 Jia, C.-Y., Li, J.-Y., Hao, G.-F. & Yang, G.-F. A drug-likeness toolbox facilitates ADMET study in drug discovery. Drug Discov. Today 25 31705979 10.1016/j.drudis.2019.10.014 37. Banerjee P Eckert AO Schrey AK Preissner R ProTox-II: A webserver for the prediction of toxicity of chemicals Nucleic Acids Res. 2018 46 W1 W257 W263 10.1093/nar/gky318 29718510 PMC6031011 Banerjee, P., Eckert, A. O., Schrey, A. K. & Preissner, R. ProTox-II: A webserver for the prediction of toxicity of chemicals. Nucleic Acids Res. 46 29718510 10.1093/nar/gky318 PMC6031011 38. Ahmed AH Alkali YI In silico pharmacokinetics and molecular docking studies of lead compounds derived from diospyros mespiliformis PharmaTutor 2019 7 3 31 37 10.29161/PT.v7.i3.2019.31 Ahmed, A. H. & Alkali, Y. I. In silico pharmacokinetics and molecular docking studies of lead compounds derived from diospyros mespiliformis. PharmaTutor 7 39. Ononamadu CJ Ibrahim A Molecular docking and prediction of ADME/drug-likeness properties of potentially active antidiabetic compounds isolated from aqueous-methanol extracts of Gymnema sylvestre and Combretum micranthum BioTechnologia (Pozn). 2021 102 1 85 99 10.5114/bta.2021.103765 36605715 PMC9645566 Ononamadu, C. J. & Ibrahim, A. Molecular docking and prediction of ADME/drug-likeness properties of potentially active antidiabetic compounds isolated from aqueous-methanol extracts of Gymnema sylvestre and Combretum micranthum. BioTechnologia (Pozn). 102 36605715 10.5114/bta.2021.103765 PMC9645566 40. McGill MR Sharpe MR Williams CD Taha M Curry SC Jaeschke H The mechanism underlying acetaminophen-induced hepatotoxicity in humans and mice involves mitochondrial damage and nuclear DNA fragmentation J Clin Invest. 2012 122 4 1574 1583 10.1172/JCI59755 22378043 PMC3314460 McGill, M. R. et al. The mechanism underlying acetaminophen-induced hepatotoxicity in humans and mice involves mitochondrial damage and nuclear DNA fragmentation. J Clin Invest. 122 22378043 10.1172/JCI59755 PMC3314460 41. Achterbergh R Lammers LA Kuijsten L Klümpen HJ Mathôt RA Romijn JA Effects of nutritional status on acetaminophen measurement and exposure Clin. Toxicol. 2019 57 1 42 49 10.1080/15563650.2018.1487563 29974811 Achterbergh, R. et al. Effects of nutritional status on acetaminophen measurement and exposure. Clin. Toxicol. 57 10.1080/15563650.2018.1487563 29974811 42. Lim J-Y Yun D-H Lee J-H Kwon Y-B Lee Y-M Lee D-H Kim D-K Extract of triticum aestivum sprouts suppresses acetaminophen-induced hepatotoxicity in mice by inhibiting oxidative stress Molecules 2021 26 21 6336 10.3390/molecules26216336 34770745 PMC8587876 Lim, J.-Y. et al. Extract of triticum aestivum sprouts suppresses acetaminophen-induced hepatotoxicity in mice by inhibiting oxidative stress. Molecules 26 34770745 10.3390/molecules26216336 PMC8587876 43. Boro H Usha T Babu D Chandana P Goyal AK Ekambaram H Hepatoprotective activity of the ethanolic extract of Morus indica roots from Indian Bodo tribes SN Applied Sciences. 2022 4 2 49 10.1007/s42452-021-04859-z Boro, H. et al. Hepatoprotective activity of the ethanolic extract of Morus indica roots from Indian Bodo tribes. SN Applied Sciences. 4 44. Narwal V Batra B Kalra V Jalandra R Ahlawat J Hooda R Bilirubin detection by different methods with special emphasis on biosensing: A review Sens. Bio-Sens. Res. 2021 33 100436 10.1016/j.sbsr.2021.100436 Narwal, V. et al. Bilirubin detection by different methods with special emphasis on biosensing: A review. Sens. Bio-Sens. Res. 33 45. Jo A Han S Lim S Choi C Hepatoprotective effects of aqueous extract of perilla fructescens against alcohol-induced liver injury in mice Processes 2024 12 7 1404 10.3390/pr12071404 Jo, A., Han, S., Lim, S. & Choi, C. Hepatoprotective effects of aqueous extract of perilla fructescens against alcohol-induced liver injury in mice. Processes 12 46. Kazemi T Hajihosseini M Moossavi M Hemmati M Ziaee M Cardiovascular risk factors and atherogenic indices in an iranian population: Birjand East of Iran Clin Med Insights Cardiol. 2018 12 1179546818759286 10.1177/1179546818759286 29497341 PMC5824902 Kazemi, T., Hajihosseini, M., Moossavi, M., Hemmati, M. & Ziaee, M. Cardiovascular risk factors and atherogenic indices in an iranian population: Birjand East of Iran. Clin Med Insights Cardiol. 12 29497341 10.1177/1179546818759286 PMC5824902 47. Rafique Z Aabid M Nadeem H Rehman A Khan JZ Waqas M Irshad N Nephroprotective potential of 1,3,4-oxadiazole derivative against methotrexate-induced nephrotoxicity in rats by upregulating Nrf2 and downregulating NF-κB and TNF-α signaling pathways J Biochem Mol Toxicol. 2024 38 12 e70084 10.1002/jbt.70084 39660630 Rafique, Z. et al. Nephroprotective potential of 1,3,4-oxadiazole derivative against methotrexate-induced nephrotoxicity in rats by upregulating Nrf2 and downregulating NF-κB and TNF-α signaling pathways. J Biochem Mol Toxicol. 38 39660630 10.1002/jbt.70084 48. Ullah H Khan A Baig MW Ullah N Ahmed N Tipu MK Poncirin attenuates CCL4-induced liver injury through inhibition of oxidative stress and inflammatory cytokines in mice BMC Compl. Med. nd Therap. 2020 20 1 115 10.1186/s12906-020-02906-7 PMC7168870 32307011 Ullah, H. et al. Poncirin attenuates CCL4-induced liver injury through inhibition of oxidative stress and inflammatory cytokines in mice. BMC Compl. Med. nd Therap. 20 10.1186/s12906-020-02906-7 PMC7168870 32307011 49. Lotfy M Al-Hammadi R Palakkott AR Yasin J Al-Hammadi S Ksiksi T Hepatoprotective potentials of acridocarpus orientalis in mice Clin. Phytosci. 2020 6 1 38 10.1186/s40816-020-00184-x Lotfy, M. et al. Hepatoprotective potentials of acridocarpus orientalis in mice. Clin. Phytosci. 6 50. Gong Q Wang X Liu Y Yuan H Ge Z Li Y Potential hepatoprotective effects of allicin on carbon tetrachloride-induced acute liver injury in mice by inhibiting oxidative stress, inflammation, and apoptosis Toxics 2024 12 5 328 10.3390/toxics12050328 38787107 PMC11126064 Gong, Q. et al. Potential hepatoprotective effects of allicin on carbon tetrachloride-induced acute liver injury in mice by inhibiting oxidative stress, inflammation, and apoptosis. Toxics 12 38787107 10.3390/toxics12050328 PMC11126064 51. Al Kury LT Zeb A Abidin ZU Irshad N Malik I Alvi AM Neuroprotective effects of melatonin and celecoxib against ethanol-induced neurodegeneration: A computational and pharmacological approach Drug Design Dev. Therapy 2019 13 2715 2727 10.2147/DDDT.S207310 PMC6683968 31447548 Al Kury, L. T. et al. Neuroprotective effects of melatonin and celecoxib against ethanol-induced neurodegeneration: A computational and pharmacological approach. Drug Design Dev. Therapy 13 10.2147/DDDT.S207310 PMC6683968 31447548 52. Azam J Noman M Nadeem H Ahmad N ul-Haq Z Hilal F Irshad N Pharmacological investigation of selected 1,2,4 triazole derivative against ethanol induced gastric ulcer Bioorg. Chem. 2025 154 108040 10.1016/j.bioorg.2024.108040 39693921 Azam, J. et al. Pharmacological investigation of selected 1,2,4 triazole derivative against ethanol induced gastric ulcer. Bioorg. Chem. 154 39693921 10.1016/j.bioorg.2024.108040 53. Li Y Li N Yu X Huang K Zheng T Cheng X Hematoxylin and eosin staining of intact tissues via delipidation and ultrasound Sci. Rep. 2018 8 1 12259 10.1038/s41598-018-30755-5 30115962 PMC6095898 Li, Y. et al. Hematoxylin and eosin staining of intact tissues via delipidation and ultrasound. Sci. Rep. 8 30115962 10.1038/s41598-018-30755-5 PMC6095898 54. Irshad N Khan A-U Alamgeer Khan S-U-D Iqbal MS Antihypertensive potential of selected pyrimidine derivatives: Explanation of underlying mechanistic pathways Biomed. Pharmacother. 2021 139 111567 10.1016/j.biopha.2021.111567 33848773 Irshad, N., Khan, A.-U., Alamgeer, Khan, S.-U.-D. & Iqbal, M. S. Antihypertensive potential of selected pyrimidine derivatives: Explanation of underlying mechanistic pathways. Biomed. Pharmacother. 139 33848773 10.1016/j.biopha.2021.111567 55. Coelho AM Queiroz IF Perucci LO Souza MO Lima WG Talvani A Costa DC Piperine as therapeutic agent in paracetamol-induced hepatotoxicity in mice Pharmaceutics 2022 14 9 1800 10.3390/pharmaceutics14091800 36145547 PMC9504321 Coelho, A. M. et al. Piperine as therapeutic agent in paracetamol-induced hepatotoxicity in mice. Pharmaceutics 14 36145547 10.3390/pharmaceutics14091800 PMC9504321 56. Khan JZ Zainab SR Rehman MU Abid M Shah FA Rehman NU Tipu MK Chrysophanol attenuates cognitive impairment, neuroinflammation, and oxidative stress by TLR4/NFκB-Nrf2/HO-1 and BDNF/VEGF signaling in stress-intensified PTZ induced epilepsy in mice Front. Pharmacol. 2024 15 1446304 10.3389/fphar.2024.1446304 39650161 PMC11620889 Khan, J. Z. et al. Chrysophanol attenuates cognitive impairment, neuroinflammation, and oxidative stress by TLR4/NFκB-Nrf2/HO-1 and BDNF/VEGF signaling in stress-intensified PTZ induced epilepsy in mice. Front. Pharmacol. 15 39650161 10.3389/fphar.2024.1446304 PMC11620889 57. Rotundo L Pyrsopoulos N Liver injury induced by paracetamol and challenges associated with intentional and unintentional use World J. Hepatol. 2020 12 4 125 136 10.4254/wjh.v12.i4.125 32685105 PMC7336293 Rotundo, L. & Pyrsopoulos, N. Liver injury induced by paracetamol and challenges associated with intentional and unintentional use. World J. Hepatol. 12 32685105 10.4254/wjh.v12.i4.125 PMC7336293 58. Chidiac AS Buckley NA Noghrehchi F Cairns R Paracetamol (acetaminophen) overdose and hepatotoxicity: Mechanism, treatment, prevention measures, and estimates of burden of disease Expert Opin. Drug Metab. Toxicol. 2023 19 5 297 317 10.1080/17425255.2023.2223959 37436926 Chidiac, A. S., Buckley, N. A., Noghrehchi, F. & Cairns, R. Paracetamol (acetaminophen) overdose and hepatotoxicity: Mechanism, treatment, prevention measures, and estimates of burden of disease. Expert Opin. Drug Metab. Toxicol. 19 37436926 10.1080/17425255.2023.2223959 59. Lipinski C Lipinski CA Lead- and drug-like compounds: The rule-of-five revolution Drug Discov. Today Technol 2004 1 337 341 10.1016/j.ddtec.2004.11.007 24981612 Lipinski, C. & Lipinski, C. A. Lead- and drug-like compounds: The rule-of-five revolution. Drug Discov. Today Technol 1 24981612 10.1016/j.ddtec.2004.11.007 60. Naz D Zeb A Nazir N Ullah R Rahman A Muhammad A Hepatoprotective and nephroprotective effects of Sedum adenotrichum in paracetamol-induced hepatotoxicity in rabbits 3 Biotech 2023 13 6 217 10.1007/s13205-023-03641-9 37260579 PMC10226966 Naz, D. et al. Hepatoprotective and nephroprotective effects of Sedum adenotrichum in paracetamol-induced hepatotoxicity in rabbits. 3 Biotech 13 37260579 10.1007/s13205-023-03641-9 PMC10226966 61. Thakur S Kumar V Das R Sharma V Mehta DK Biomarkers of hepatic toxicity: An overview Curr. Ther. Res. 2024 100 100737 10.1016/j.curtheres.2024.100737 38860148 PMC11163176 Thakur, S., Kumar, V., Das, R., Sharma, V. & Mehta, D. K. Biomarkers of hepatic toxicity: An overview. Curr. Ther. Res. 100 38860148 10.1016/j.curtheres.2024.100737 PMC11163176 62. Kasolo J Namaganda A Bbosa G Muwonge H Lukande R Nfambi J Reversal effects of n-acetyl cysteine on moringa oleifera leaves-induced sub-acute hepatotoxicity in Wistar Albino Rats Neurosci Med. 2019 10 385 397 10.4236/nm.2019.104028 Kasolo, J. et al. Reversal effects of n-acetyl cysteine on moringa oleifera leaves-induced sub-acute hepatotoxicity in Wistar Albino Rats. Neurosci Med. 10 63. Atakpa I, Eneji E, Hogan I. Tropical journal of natural product research effects of Carica papaya seeds on acetaminophen-induced hepatotoxicity in Male Wistar Rats. (2020). 64. David S Hamilton JP Drug-induced Liver Injury US Gastroenterol Hepatol Rev. 2010 6 73 80 21874146 PMC3160634 David, S. & Hamilton, J. P. Drug-induced Liver Injury. US Gastroenterol Hepatol Rev. 6 21874146 PMC3160634 65. Ghadir MR Riahin AA Havaspour A Nooranipour M Habibinejad AA The relationship between lipid profile and severity of liver damage in cirrhotic patients Hepat Mon. 2010 10 4 285 288 22312394 PMC3271321 Ghadir, M. R., Riahin, A. A., Havaspour, A., Nooranipour, M. & Habibinejad, A. A. The relationship between lipid profile and severity of liver damage in cirrhotic patients. Hepat Mon. 10 22312394 PMC3271321 66. Dubey S Bhardwaj S Prabhakaran P Mandal S Singh E Comparison of in-silico and in-vitro studies of benzimidazoleoxothiazolidine derivatives as m. Tubcerculosis transcriptor inhibitors German J. Pharmaceut. Biomater. 2023 2 20 29 10.5530/gjpb.2023.2.6 Dubey, S., Bhardwaj, S., Prabhakaran, P., Mandal, S. & Singh, E. Comparison of in-silico and in-vitro studies of benzimidazoleoxothiazolidine derivatives as m. Tubcerculosis transcriptor inhibitors. German J. Pharmaceut. Biomater. 2 67. Lumu W Bahendeka S Wesonga R Kibirige D Kasoma RM Ssendikwanawa E Atherogenic index of plasma and its cardiovascular risk factor correlates among patients with type 2 diabetes in Uganda Afr Health Sci. 2023 23 1 515 527 10.4314/ahs.v23i1.54 37545918 PMC10398456 Lumu, W. et al. Atherogenic index of plasma and its cardiovascular risk factor correlates among patients with type 2 diabetes in Uganda. Afr Health Sci. 23 37545918 10.4314/ahs.v23i1.54 PMC10398456 68. Jie Y Gong J Xiao C Zhu S Zhou W Luo J Low platelet to white blood cell ratio indicates poor prognosis for acute-on-chronic liver failure Biomed. Res. Int. 2018 2018 1 7394904 29854786 10.1155/2018/7394904 PMC5964479 Jie, Y. et al. Low platelet to white blood cell ratio indicates poor prognosis for acute-on-chronic liver failure. Biomed. Res. Int. 2018 29854786 10.1155/2018/7394904 PMC5964479 69. Warner ER II Aloor FZ Satapathy SK A narrative review of nutritional abnormalities, complications, and optimization in the cirrhotic patient Transl. Gastroenterol. Hepatol. 2021 7 5 10.21037/tgh-20-325 PMC8826036 35243114 Warner, E. R. II., Aloor, F. Z. & Satapathy, S. K. A narrative review of nutritional abnormalities, complications, and optimization in the cirrhotic patient. Transl. Gastroenterol. Hepatol. 7 10.21037/tgh-20-325 PMC8826036 35243114 70. Kusumoto K Igata H Ojima M Tsuboi A Imanishi M Yamaguchi F Antihypertensive, insulin-sensitising and renoprotective effects of a novel, potent and long-acting angiotensin II type 1 receptor blocker, azilsartan medoxomil, in rat and dog models Eur. J. Pharmacol. 2011 669 1 84 93 10.1016/j.ejphar.2011.07.014 21816148 Kusumoto, K. et al. Antihypertensive, insulin-sensitising and renoprotective effects of a novel, potent and long-acting angiotensin II type 1 receptor blocker, azilsartan medoxomil, in rat and dog models. Eur. J. Pharmacol. 669 21816148 10.1016/j.ejphar.2011.07.014 71. Matsuo T Ishikawa E Ohta M Shibouta Y Ishimura Y Imura Y Sugiyama Y Renal protective effect of candesartan cilexetil in spontaneously hypercholesterolemic rats Jpn. J. Pharmacol. 2002 88 3 300 306 10.1254/jjp.88.300 11949885 Matsuo, T. et al. Renal protective effect of candesartan cilexetil in spontaneously hypercholesterolemic rats. Jpn. J. Pharmacol. 88 11949885 10.1254/jjp.88.300 72. Crawford JM Bioulac-Sage P Hytiroglou P Burt AD Ferrell LD Hübscher SG The structure, function, and responses to injury Macsween’s Pathology of the Liver 2018 7 Elsevier 1 87 Crawford, J. M., Bioulac-Sage, P. & Hytiroglou, P. The structure, function, and responses to injury. In Macsween’s Pathology of the Liver 73. Ayenew KD Wasihun Y Hepatoprotective effect of methanol extract of Agave americana leaves on paracetamol induced hepatotoxicity in Wistar albino rats BMC Compl. Med. Therapies. 2023 23 1 99 10.1186/s12906-023-03931-y PMC10067186 37005601 Ayenew, K. D. & Wasihun, Y. Hepatoprotective effect of methanol extract of Agave americana leaves on paracetamol induced hepatotoxicity in Wistar albino rats. BMC Compl. Med. Therapies. 23 10.1186/s12906-023-03931-y PMC10067186 37005601 74. Woolbright BL Nguyen NT McGill MR Sharpe MR Curry SC Jaeschke H Generation of pro-and anti-inflammatory mediators after acetaminophen overdose in surviving and non-surviving patients Toxicol. Lett. 2022 367 59 66 10.1016/j.toxlet.2022.07.813 35905941 PMC9849076 Woolbright, B. L. et al. Generation of pro-and anti-inflammatory mediators after acetaminophen overdose in surviving and non-surviving patients. Toxicol. Lett. 367 35905941 10.1016/j.toxlet.2022.07.813 PMC9849076 75. Scarlata GGM Colaci C Scarcella M Dallio M Federico A Boccuto L Abenavoli L The role of cytokines in the pathogenesis and treatment of alcoholic liver disease Diseases 2024 12 4 69 10.3390/diseases12040069 38667527 PMC11048950 Scarlata, G. G. M. et al. The role of cytokines in the pathogenesis and treatment of alcoholic liver disease. Diseases 12 38667527 10.3390/diseases12040069 PMC11048950 76. Blazka ME Wilmer JL Holladay SD Wilson RE Luster MI Role of proinflammatory cytokines in acetaminophen hepatotoxicity Toxicol. Appl. Pharmacol. 1995 133 1 43 52 10.1006/taap.1995.1125 7597709 Blazka, M. E., Wilmer, J. L., Holladay, S. D., Wilson, R. E. & Luster, M. I. Role of proinflammatory cytokines in acetaminophen hepatotoxicity. Toxicol. Appl. Pharmacol. 133 7597709 10.1006/taap.1995.1125 77. Zhao Y Wu J Liu X Chen X Wang J Decoding nature: multi-target anti-inflammatory mechanisms of natural products in the TLR4/NF-κB pathway Front Pharmacol. 2024 15 1467193 10.3389/fphar.2024.1467193 39877388 PMC11772364 Zhao, Y., Wu, J., Liu, X., Chen, X. & Wang, J. Decoding nature: multi-target anti-inflammatory mechanisms of natural products in the TLR4/NF-κB pathway. Front Pharmacol. 15 39877388 10.3389/fphar.2024.1467193 PMC11772364 78. Mourtzikou A Alepaki M Stamouli M Pouliakis A Skliris A Karakitsos P Evaluation of serum levels of IL-6, TNF-α, IL-10, IL-2 and IL-4 in patients with chronic hepatitis Inmunología. 2014 33 2 41 50 10.1016/j.inmuno.2014.01.001 Mourtzikou, A. et al. Evaluation of serum levels of IL-6, TNF-α, IL-10, IL-2 and IL-4 in patients with chronic hepatitis. Inmunología. 33 79. Dkhil MA Abdel Moneim AE Hafez TA Mubaraki MA Mohamed WF Thagfan FA Al-Quraishy S Myristica fragrans kernels prevent paracetamol-induced hepatotoxicity by inducing anti-apoptotic genes and Nrf2/HO-1 pathway Int. J. Mol. Sci. 2019 20 4 993 10.3390/ijms20040993 30823534 PMC6412641 Dkhil, M. A. et al. Myristica fragrans kernels prevent paracetamol-induced hepatotoxicity by inducing anti-apoptotic genes and Nrf2/HO-1 pathway. Int. J. Mol. Sci. 20 30823534 10.3390/ijms20040993 PMC6412641 80. Alonso-Piñeiro JA Gonzalez-Rovira A Sánchez-Gomar I Moreno JA Durán-Ruiz MC Nrf2 and heme oxygenase-1 involvement in atherosclerosis related oxidative stress Antioxidants 2021 10 9 1463 10.3390/antiox10091463 34573095 PMC8466960 Alonso-Piñeiro, J. A., Gonzalez-Rovira, A., Sánchez-Gomar, I., Moreno, J. A. & Durán-Ruiz, M. C. Nrf2 and heme oxygenase-1 involvement in atherosclerosis related oxidative stress. Antioxidants 10 34573095 10.3390/antiox10091463 PMC8466960 ",
  "metadata": {
    "Title of this paper": "Nrf2 and heme oxygenase-1 involvement in atherosclerosis related oxidative stress",
    "Journal it was published in:": "Scientific Reports",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12485105/"
  }
}