{
  "title": "Paper_53",
  "abstract": "pmc Mol Cancer Mol Cancer 117 molcanc Molecular Cancer 1476-4598 BMC PMC12492935 PMC12492935.1 12492935 12492935 41039566 10.1186/s12943-025-02448-x 2448 1 Research ​​The immune microenvironment of pathogen-associated cancers and current clinical therapeutics Wei Xiao-Yu 1 Feng Hui-Jing 2 Zhu Ying-Yin 3 Guo Shi-Jing 4 Wang Hong 3 Li Ming limm2021@126.com 5 Mei Qi borismq@163.com 2 1 https://ror.org/033vnzz93 grid.452206.7 0000 0004 1758 417X The Department of Infectious Disease, The Affiliated Yongchuan Hospital of Chongqing Medical University, 2 https://ror.org/04tshhm50 grid.470966.a Cancer Center, Tongji Shanxi Hospital, Shanxi Bethune Hospital, Shanxi Academy of Medical Sciences, Third Hospital of Shanxi Medical University, 3 4 https://ror.org/05k3sdc46 grid.449525.b 0000 0004 1798 4472 The North Sichuan Medical College, 5 https://ror.org/04gz17b59 grid.452743.3 0000 0004 1788 4869 The Jiangsu Subei People’s Hospital (Affiliated Hospital of Yangzhou University), 2 10 2025 2025 24 478187 232 30 6 2025 22 8 2025 02 10 2025 04 10 2025 04 10 2025 © The Author(s) 2025 2025 https://creativecommons.org/licenses/by-nc-nd/4.0/ Open Access http://creativecommons.org/licenses/by-nc-nd/4.0/ Pathogen-associated cancers account roughly 15–20% of all malignancies worldwide and arise from chronic infections by oncogenic viruses, bacteria and parasites. Pathogens can alter the tumor microenvironment (TME) into an immune-suppressive niche using multiple mechanisms, including immune checkpoint manipulation, chronic inflammation, metabolic reprogramming, and direct epigenetic modifications. Immune dysfunctions related to infections linked to cancers can include M2-polarized macrophages, expansion of MDSCs, exhausted T/NK cells, and tolerogenic dendritic cells, all progressing immune evasion and resistance to cancer therapy. Advances in therapeutics exist in prophylactic vaccines, immune checkpoint inhibitors, and next-generation methods such as the engineered Salmonella to deliver to hypoxic tumors and the targeting the microbiome. The advancement of pathogen-, cancer-, and patient-specific therapeutics is not without its challenges, including heterogeneity of the pathogens, absence of clinically useful biomarkers, concerns about the safety of the restoring anti-pathogen immunity and challenges of scale for manifold interventions. This review will provide a synthesis of the mechanistic aspects of pathogen-mediated TME remodeling, contemporary clinical therapeutics, and ongoing investigations into using pathogen/host dynamics to enhance measurable precision immunotherapy strategies. Keywords Oncogenic pathogens ​​ Pathogen-associated cancers​​ ​​Tumor microenvironment (TME) Immunosuppressive mechanisms​​ Immunotherapy Shanxi Provincial Basic Research Program 202303021221191 Mei Qi pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement no pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes issue-copyright-statement © BioMed Central Ltd., part of Springer Nature 2025 Introduction​​ Cancer is a significant global health threat, and a large percentage of tumors are attributable to chronic infections by oncogenic pathogens, including viruses, bacteria and parasites [ 1 2 Tumor microenvironments (TMEs) in pathogen-associated cancers are defined by a reciprocal relationship between the host’s immune cells and microbial factors, causing carcinogenesis due to immune evasion that leads to genomic instability, inappropriate cytokine signaling and recruitment of immune suppressive cells [ 3 4 5 6 7 8 9 10 11 Pathogens have the ability not only to initiate tumors but modulate TME to changes in anti-tumor therapies, conventional and immunotherapy. The field of clinical therapeutics has made many exciting advances in targeting aspects of pathogen-interference with the immune system. Prophylactic vaccines, e.g. HPV, HBV have successfully prevented malignancies linked to infections [ 12 14 15 Tumor microenvironment in pathogen-associated cancers​​ The TME in pathogen-associated malignancies involves a delicate interplay of one or more microbial pathogens, immune responses of the host, and tumor cells (Fig. 1 Fig. 1 Pathogen-Mediated Remodeling of the Tumor Microenvironment (TME).​​ Pathogens such as H. pylori, HPV, EBV, and KSHV drive M2 polarization in TAMs through IL-10/TGF-β signaling or viral proteins (e.g., LMP1, vIL-6), fostering immunosuppression and angiogenesis. MDSCs, expanded by Fusobacterium nucleatum or HBV, inhibit T-cell activity via arginase-1 and ROS, contributing to PD-1 blockade resistance in HCC) Pathogen-induced N2 polarization of TANs, as seen with F. nucleatum in CRC, promotes metastasis through MMP-9 and NETs, while HCV and EBV diminish NK cell cytotoxicity by downregulating activating ligands, compromising tumor surveillance. Additionally, pathogens like EBV and H. pylori impair DC maturation, generating tolerogenic DCs that weaken Th1 responses. In the adaptive immune compartment, T-cell exhaustion—mediated by PD-1/PD-L1 upregulation (HPV, HTLV-1)—and Treg expansion further suppress antitumor immunity. (Abbreviations: H. pylori (Helicobacter pylori), HPV (human papillomavirus), EBV (Epstein-Barr virus), KSHV (Kaposi’s sarcoma-associated herpesvirus), TAMs (tumor-associated macrophages), IL-10 (interleukin-10), TGF-β (transforming growth factor-beta), LMP1 (latent membrane protein 1), vIL-6 (viral interleukin-6), MDSCs (myeloid-derived suppressor cells), F. nucleatum (Fusobacterium nucleatum), HBV (hepatitis B virus), ROS (reactive oxygen species), PD-1 (programmed cell death protein 1), HCC (hepatocellular carcinoma), TANs (tumor-associated neutrophils), CRC (colorectal cancer), MMP-9 (matrix metalloproteinase-9), NETs (neutrophil extracellular traps), DC (dendritic cell), Th1 (T helper 1 cell), PD-L1 (programmed death-ligand 1), HTLV-1 (human T-lymphotropic virus 1), Treg (regulatory T cell), HCV (hepatitis C virus), and NK (natural killer cell)) Innate immune cells​​ Tumor-Associated Macrophages (TAMs) The polarization of macrophages in the tumor microenvironment is nuanced [ 16 17 18 19 20 Pathogens can induce macrophage dysfunction, allowing persistent survival beyond host immune clearance. This process confers biological advantages by promoting a progressive shift toward M2-like polarization. Sustained pathogen activity generates a permissive microenvironment characterized by ineffective immune surveillance, which facilitates tumor progression and drives neoplastic evolution [ 18 21 21 22 23 Myeloid-Derived Suppressor Cells (MDSCs)​​ The expansion and activation of myeloid-derived suppressor cells (MDSCs) is an important immunosuppressive mechanism in pathogen-associated malignancies. For example, bacterial pathogens Fusobacterium nucleatum and Helicobacter pylori have been shown to systemically promote the recruitment and expansion of MDSCs within the tumor microenvironment [ 24 26 27 28 Tumor-Associated Neutrophils (TANs) The contribution of neutrophils in the tumor microenvironment has come to light as a key component in defining the pathogenesis of infection-associated cancers. In the case of pathogen-driven tumors, the sustained inflammatory response induced by chronic microbial infections results in persistent neutrophil recruitment and polarization toward an N2 phenotype, most extensively characterized in Fusobacterium nucleatum-mediated colorectal cancer [ 29 30 31 32 33 34 35 36 Dendritic Cells (DCs)​​ Dendritic cell (DC) dysfunction is a significant immunological defect related to pathogen-associated cancers. DCs, referred to as antigen presenting cells, are important in neoplasia, related to their role in priming and activating T cells [ 37 37 38 39 40 41 42 43 NK (natural killer) cell NK cell cytotoxicity is a crucial aspect of antitumor immunity [ 44 40 45 46 45 47 48 49 50 Adaptive immune cells​​ T cells The dysregulation of T cell responses is one of the key signatures of the tumor microenvironment in pathogen-associated cancers. Chronic infection with oncogenic viruses, such as HTLV-1, has been shown to alter the function of CD8 + T cells through persistent antigen exposure and upregulation of immune checkpoints receptors, including PD-1 (present on cytotoxic T lymphocytes) and its ligand PD-L1 (expressed on infected cells), developing an immunosuppressive axis that exhausts any antitumor T cell response [ 51 52 In addition to CD8 + T cell exhaustion, we also observe that pathogen-associated malignancies have an expansion of regulatory T cell (Treg) populations. Previous work has mechanistically linked EBV and HPV infection with additional FoxP3 + Treg infiltration of the tumor microenvironment [ 53 55 56 57 58 The pathogen-associated disruptions in T cell populations have significant clinical implications for their use in cancer immunotherapy. For example, there was an enormous overexpression of PD-1/PD-L1 by HPV and HTLV-1, representing a potential actionable weakness for immune checkpoint blockade strategies by targeting the PD-1/PD-L1 axis [ 59 60 61 Pathogen-Specific immune microenvironment remodeling​​ The immune microenvironment in pathogen-associated cancers is dynamically reshaped by microbial pathogens to foster immune evasion, chronic inflammation, and malignant progression. Viruses, bacteria, and parasites employ sophisticated strategies to subvert host immunity, creating immunosuppressive niches that support tumor survival. These pathogens modulate immune checkpoints, alter antigen presentation, recruit regulatory immune cells, and induce genotoxic stress, collectively driving oncogenesis through ​​immune exhaustion​​, ​​chronic inflammation​​, and ​​epigenetic reprogramming​​ (Figs. 2 3 Fig. 2 Viral Pathogens and Their Oncogenic Mechanisms in Tumor Microenvironment Remodeling.​​ HTLV-1 drives adult ATLL through FOXP3 + Treg expansion, MHC-I/II downregulation, and PD-L1 overexpression, while activating the GAL-9/Tim-3 axis to promote T-cell exhaustion and M2-like TAM polarization via CCL18 secretion. HPV employs E6/E7 oncoproteins to degrade p53/pRb, disrupt cell cycle control, and inhibit MHC-I expression, impairing NK cell activation and establishing a Th1/Th2 imbalance with elevated IL-4 suppressing IFN-γ. HPV-18 E7 further degrades STING to dampen innate immunity, while PD-L1 upregulation in cervical cancer and MHC-I suppression impair antigen presentation. HBV/HCV promote chronic immunosuppression, with HBV expanding Tregs and upregulating PD-1/PD-L1, and HCV degrading STAT1 via NS5A to inhibit interferon responses, synergizing with TGF-β/PD-L1 to drive CD8 + T-cell dysfunction. Both viruses induce IL-6/STAT3 signaling in hepatocellular carcinoma, metabolic reprograming by lactic acid, and dendritic cell impairment. EBV activates oncogenic PI3K/AKT and MAPK pathways through latent membrane proteins, mimics NOTCH signaling via EBNA2 in lymphomas, and mediates immune evasion through EBER non-coding RNAs. EBV further blocks antigen presentation via BGLF5/BILF1 (MHC-I/II interference), upregulates PD-L1 through LMP1/NF-κB, and induces CAR-T resistance in latency II tumors. KSHV promotes angiogenesis via vGPCR and vIL-6, sustains NF-κB signaling through vFLIP, and remodels the immune microenvironment by degrading MHC-II (RTA protein), inducing PD-L1 + monocytes, and polarizing macrophages toward an M2 phenotype. (Abbreviations: HTLV-1 (Human T-cell lymphotropic virus type 1), ATLL (Adult T-cell leukemia/lymphoma), Treg (Regulatory T cell), MHC-I/II (Major histocompatibility complex class I/II), PD-L1 (Programmed death-ligand 1), GAL-9 (Galectin-9), Tim-3 (T-cell immunoglobulin and mucin-domain containing-3), TAM (Tumor-associated macrophage), CCL18 (Chemokine ligand 18), HPV (Human papillomavirus), p53 (Tumor protein 53), pRb (Retinoblastoma protein), NK (Natural killer cell), Th1/Th2 (T helper 1/T helper 2), IL-4 (Interleukin-4), IFN-γ (Interferon-gamma), STING (Stimulator of interferon genes), HBV (Hepatitis B virus), HCV (Hepatitis C virus), PD-1 (Programmed cell death protein 1), STAT1 (Signal transducer and activator of transcription 1), NS5A (Nonstructural protein 5 A), TGF-β (Transforming growth factor beta), CD8+ (Cluster of differentiation 8-positive), IL-6 (Interleukin-6), STAT3 (Signal transducer and activator of transcription 3), HCC (Hepatocellular carcinoma), DC (Dendritic cell), EBV (Epstein-Barr virus), PI3K (Phosphoinositide 3-kinase), AKT (Protein kinase B), MAPK (Mitogen-activated protein kinase), EBNA2 (Epstein-Barr nuclear antigen 2), EBER (EBV-encoded small RNA), BGLF5/BILF1 (EBV glycoprotein/EBV-induced gene 1), NF-κB (Nuclear factor kappa-light-chain-enhancer of activated B cells), CAR-T (Chimeric antigen receptor T-cell), KSHV (Kaposi’s sarcoma-associated herpesvirus), vGPCR (Viral G protein-coupled receptor), vIL-6 (Viral interleukin-6), vFLIP (Viral FLICE-inhibitory protein), and RTA (Replication and transcription activator).) Fig. 3 Bacterial and Parasitic Pathogens in Tumorigenesis and Immune Microenvironment Remodeling.​​ Helicobacter pylori Fusobacterium nucleatum Salmonella typhimurium Schistosoma haematobium Opisthorchis viverrini (Abbreviations: H. pylori (Helicobacter pylori) CagA (cytotoxin-associated gene A) VacA (vacuolating cytotoxin A) PD-L1 (programmed death-ligand 1) MDSC (myeloid-derived suppressor cell) EMT (epithelial-mesenchymal transition) FAP (fibroblast activation protein) F. nucleatum (Fusobacterium nucleatum) FadA (Fusobacterium adhesin A) NF-κB (nuclear factor kappa-light-chain-enhancer of activated B cells) Fap2 (Fusobacterium autotransporter protein 2) TIGIT (T cell immunoreceptor with Ig and ITIM domains) NK (natural killer) TLR4 (Toll-like receptor 4) S. typhimurium (Salmonella typhimurium) TNF-α (tumor necrosis factor-alpha) IFN-γ (interferon-gamma) CXCL-10 (C-X-C motif chemokine ligand 10) ICD (immunogenic cell death) TIL (tumor-infiltrating lymphocyte) S. haematobium (Schistosoma haematobium) IL-4 (interleukin-4) Th2 (T helper 2) Treg (regulatory T cell) O. viverrini (Opisthorchis viverrini) Ov-GRN-1 (Opisthorchis viverrini granulin-1) and STAT3 (signal transducer and activator of transcription 3).) Viral pathogens and their oncogenic mechanisms within immune microenvironment Human T-cell Lymphotropic Virus-1 (HTLV-1) ​​The Human T-cell Lymphotropic Virus-1 (HTLV-1), a retrovirus, is most commonly associated with the development of adult T-cell leukemia/lymphoma (ATLL) [ 62 63 63 63 64 65 HTLV-1 infection causes tumor immune microenvironment remodeling on multiple fronts. HTLV-1 infection is associated with chronic T-cell exhaustion, which is typified by a progressive loss of effector function and proliferation [ 66 67 Human Papillomavirus (HPV) Human papillomavirus (HPV) is an important oncogenic DNA virus that is responsible for an estimated 5% of all human cancers [ 68 69 70 71 72 73 74 75 76 77 Hepatitis B/C Viruses (HBV/HCV) Hepatitis B and C viruses (HBV/HCV) are hepatotropic pathogens capable of establishing chronic infections which lead to hepatocellular carcinoma (HCC), the most common primary liver cancer accounting for around 80% of cases globally [ 78 79 80 81 82 83 84 85 86 87 88 89 Epstein-Barr Virus (EBV) The Epstein-Barr virus (EBV), a gamma herpesvirus with demonstrated potential for oncogenesis, has been linked to a variety of cancers, including Burkitt lymphoma, Hodgkin lymphoma, nasopharyngeal carcinoma, gastric adenocarcinoma, and post-transplant lymphoproliferative disorders [ 90 91 92 93 94 95 96 97 98 93 92 Kaposi’s Sarcoma Herpesvirus (KSHV) Kaposi’s Sarcoma Herpesvirus (KSHV), or human herpesvirus 8 (HHV-8), is an oncogenic gamma herpesvirus with numerous associated neoplasms, including Kaposi’s sarcoma (KS), primary effusion lymphoma (PEL), and multicentric Castleman’s disease [ 99 100 101 102 103 104 105 106 107 108 Bacterial pathogens and their oncogenic mechanisms within immune microenvironment Helicobacter pylori Helicobacter pylori is a gram-negative bacterium that chronically colonizes the gastric mucosa and has been recognized by the World Health Organization as a Class I carcinogen [ 109 110 111 112 113 114 115 26 116 117 118 Fusobacterium nucleatum Fusobacterium nucleatum is an anaerobic, gram-negative bacterium that has been identified as an emerging onco-pathogen, particularly in association with colorectal cancer (CRC) [ 29 119 120 121 122 122 122 25 123 124 29 125 126 127 Salmonella typhimurium Due to its selective tumor targeting and colonization of hypoxic regions surrounding the tumor, Salmonella typhimurium has emerged as a potential therapeutic agent in cancer immunotherapy [ 128 129 130 131 130 132 132 132 133 132 133 Parasitic pathogens and their oncogenic mechanisms within immune microenvironment Schistosoma haematobium Schistosoma haematobium, a parasitic trematode, is classified by the International Agency for Research on Cancer (IARC) as a Group 1 carcinogen as it is associated with the development of bladder squamous cell carcinoma, the predominant histological subtype across endemic regions of schistosomiasis [ 134 134 135 136 137 138 139 138 140 138 141 134 142 Opisthorchis viverrini Opisthorchis viverrini is a liver fluke that is endemic to Southeast Asia because of its correlation with cholangiocarcinoma, a malignant bile duct lesion that is particularly prevalent in Thailand, Laos, and Cambodia [ 143 144 145 146 147 148 141 Therapeutic strategies targeting the immune microenvironment​​ The immune microenvironment in pathogen-associated cancers presents unique challenges and opportunities for therapeutic intervention, as microbial pathogens actively reshape immune evasion mechanisms to promote tumor survival. These cancers driven by viruses, bacteria, and other pathogens exploit immune checkpoint pathways, alter antigen presentation, and induce chronic inflammation to create an immunosuppressive niche. Emerging strategies aim to counteract these mechanisms through ​​immune checkpoint inhibition​​, ​​cellular therapies​​, ​​microbiome modulation​​, ​​vaccine development​​, and ​​combination therapies​​, each tailored to disrupt pathogen-mediated immune suppression while enhancing antitumor responses (Table 1  Table 1 Therapeutic strategies in Pathogen-Associated cancers​​ Subcategory Pathogen Cancer Type Key Drugs/Agents Mechanism Reference ​​Immune Checkpoint Modulation​​ Approved Checkpoint Inhibitors EBV EBV + Gastric Cancer Pembrolizumab (PD-1) Blocks PD-1 to restore T-cell activity 1 HBV/HCV Hepatocellular Carcinoma (HCC) Nivolumab (PD-1) Reverses T-cell exhaustion in virus-related HCC 2, 3 KSHV Kaposi’s Sarcoma Atezolizumab (PD-L1) Inhibits PD-L1 to enhance immune response 4 HTLV-1 ATLL Ipilimumab (CTLA-4) Blocks CTLA-4 to counteract Treg suppression 5 EBV EBV + Malignancies Relatlimab (LAG-3) Emerging LAG-3 inhibitor to overcome immune evasion 6 ​​Cellular Therapy Approaches​​ EBV-Specific Therapies EBV EBV + Lymphomas EBV-CTLs Cytotoxic T lymphocytes target EBV-infected cells 7 EBV Post-transplant Disorders CAR-T (EBNA1/LMP1/LMP2) Engineered T cells target EBV antigens (challenge: Latency II tumors) 8 HTLV-1 Interventions HTLV-1 ATLL Mogamulizumab (anti-CCR4) Depletes CCR4 + malignant T cells 9 HTLV-1 ATLL OX40/OX40L modulators Suppresses Treg-phenotype ATLL cells 9 Bacterial-Mediated Therapies Salmonella Gastrointestinal Cancers Engineered T cells Targets solid tumors via bacterial tropism 10, 11 Listeria Multiple Cancers Listeria vaccines LLO secretion activates CTLs 12 ​​Microbiome-Targeted Therapies​​ Microbiome Modulation - Multiple Cancers Akkermansia muciniphila Probiotic enhances checkpoint blockade efficacy 13, 14 ​​Vaccine Development​​ Therapeutic Vaccines EBV EBV + Malignancies mRNA vaccine (gp350/gB/gH/gL) Clinical trials targeting EBV glycoproteins 15, 16 MCPyV Merkel Cell Carcinoma T-antigen vaccines Targets viral oncoprotein 17 ​​Combination Therapy Paradigms​​ ICIs + Oncolytic Viruses KSHV Kaposi’s Sarcoma HSV + anti-PD-1 Synergizes immunogenic cell death with PD-1 blockade 18 CAR-T + Immune Checkpoint Blockade EBV EBV + Lymphomas CAR-T + PD-1 inhibitor Enhances viral antigen recognition while blocking PD-1 8, 19, 20 Epigenetic Modulators + ICIs Virus-related Multiple Cancers HDAC inhibitors + anti-CTLA-4 Restores MHC expression and augments CTLA-4 blockade 21, 22 Immune checkpoint modulation strategies​​ Pathogen-associated checkpoint molecule modifications induce novel challenges and opportunities for therapeutic development. While the clinical translatability of these changes has resulted in several permissible checkpoint inhibitors with clinical efficacy in pathogen-associated malignancies, therapeutic strategies targeting PD-1 with inhibitors like pembrolizumab and nivolumab are showing clinical relevance in EBV-positive gastric cancer and HBV/HCV-related HCC respectively [ 149 151 152 63 153 Cellular therapy approaches​​ The concept of cancer therapies leveraging the cellular response to pathogens has been given a new lease of life with the advent of cellular therapy. Cellular therapies can now be used in conjunction with other novel therapeutic approaches for pathogen-associated malignancies. Theoretically, a direct example of this would be the EBV associated tumors wherein a T cell therapy developed against T lymphocytes infected with WBV has therapeutic efficacy [ 154 155 156 157 There will also be future opportunities with bacterial pathogens, in cellular modalities. As an example, targeting gastrointestinal cancers with a modified Salmonella engineered T cell was an innovative technique seeking to draw upon the natural affinity of bacteria to preferentially target solid malignancies and T cell based immunotherapy [ 133 158 159 Microbiome-targeted therapies​​ While the use of intentional microbiome targeting as a treatment strategy is a nascent approach, there is already some interesting options when it comes to treatment malignancies linked to pathogenic infections [ 160 161 162 Vaccine development strategies​​ The development of vaccines targeting oncogenic pathogens has followed two different, but complementary, pathways: preventive and therapeutic [ 163 164 165 166 167 Combination therapy paradigms​​ Pathogen-associated cancers are complex, so it is understandable that newer combination therapies targeting different aspects of the tumor microenvironment are being developed. One interesting approach is the combination of immune checkpoint inhibitors (ICIs) with oncolytic viruses, such as the demonstrated synergy of herpes simplex virus (HSV) with anti-PD-1 therapy in Kaposi sarcoma-associated herpesvirus (KSHV)-associated sarcomas [ 168 169 155 170 171 172 Future directions and clinical challenges in pathogen-associated cancer immunotherapy The clinical development of immunotherapy for pathogen-associated cancer consists of multiple vital safety issues to navigate. Potential reactivation of pathogens, especially regarding patients with chronic HBV infection undergoing PD-1/PD-L1 therapy is paramount, as the recommended guidelines for clinical practice endorse using prophylactic antivirals (tenofovir) to impede viral rebound and liver-related adverse events although fellows can become cavalier about HBV therapy in these situations. Another pressing clinical challenge is cytokine release syndrome associated with EBV specific CAR-T cell therapy. The profound activation of the immune system directed at a large number of viral antigens without specificity, likely increases the risk of cytokine release syndrome and mandates increased monitoring and therapeutic interventions for symptom management relative to the specific cytokines. Future therapeutic strategies for pathogen-associated cancers will rely on biomarker-guided personalization, nanomedicine, and synthetic biology innovations, while addressing mechanisms of hypoxia-driven resistance, and immune evasion [ 173 177 Conclusion​​ Pathogen-specific immune microenvironment remodeling represents a critical mechanism linking chronic infections to cancer development. Understanding these complex interactions provides opportunities for both cancer prevention through pathogen eradication and novel therapeutic approaches targeting the infection-associated tumor microenvironment. Publisher’s Note Springer Nature remains neutral with regard to jurisdictional claims in published maps and institutional affiliations. Acknowledgements Not applicable. Authors’ contributions The authors declare that they have no competing interests. Funding This study was supported by grants from Shanxi Provincial Basic Research Program (grant numbers: 202303021221191), Research and Innovation Team Project for Scientific Breakthroughs at Shanxi Bethune Hospital (grant numbers: 2024AOXIANG04), and National Emergency Medical Rescue Base 2023 Translational Research Projects (grant numbers: JYJD2023-03), and Key Disciplines On Public Health Construction in Chongqing. Data availability No datasets were generated or analysed during the current study. Declarations Ethics approval and consent to participate Not applicable. Consent for publication Not applicable. Competing interests The authors declare no competing interests. References 1. Hatta MNA Mohamad Hanif EA Chin S-F Neoh H -m. Pathogens and carcinogenesis: a review Biology 2021 10 6 533 10.3390/biology10060533 34203649 PMC8232153 Hatta MNA, Mohamad Hanif EA, Chin S-F, Neoh H. -m. Pathogens and carcinogenesis: a review. Biology. 2021;10(6):533. 34203649 10.3390/biology10060533 PMC8232153 2. Yasunaga JI Matsuoka M Oncogenic spiral by infectious pathogens: Cooperation of multiple factors in cancer development Cancer Sci 2018 109 1 24 32 10.1111/cas.13443 29143406 PMC5765297 Yasunaga JI, Matsuoka M. Oncogenic spiral by infectious pathogens: Cooperation of multiple factors in cancer development. Cancer Sci. 2018;109(1):24–32. 29143406 10.1111/cas.13443 PMC5765297 3. Giraldo NA Sanchez-Salas R Peske JD Vano Y Becht E Petitprez F Validire P Ingels A Cathelineau X Fridman WH The clinical role of the TME in solid cancer Br J Cancer 2019 120 1 45 53 10.1038/s41416-018-0327-z 30413828 PMC6325164 Giraldo NA, Sanchez-Salas R, Peske JD, Vano Y, Becht E, Petitprez F, Validire P, Ingels A, Cathelineau X, Fridman WH. The clinical role of the TME in solid cancer. Br J Cancer. 2019;120(1):45–53. 30413828 10.1038/s41416-018-0327-z PMC6325164 4. Wang J Ge J Wang Y Xiong F Guo J Jiang X Zhang L Deng X Gong Z Zhang S EBV MiRNAs BART11 and BART17-3p promote immune escape through the enhancer-mediated transcription of PD-L1 Nat Commun 2022 13 1 866 10.1038/s41467-022-28479-2 35165282 PMC8844414 Wang J, Ge J, Wang Y, Xiong F, Guo J, Jiang X, Zhang L, Deng X, Gong Z, Zhang S. EBV MiRNAs BART11 and BART17-3p promote immune escape through the enhancer-mediated transcription of PD-L1. Nat Commun. 2022;13(1):866. 35165282 10.1038/s41467-022-28479-2 PMC8844414 5. Lim DW-T Kao H-F Suteja L Li CH Quah HS Tan DS-W Tan S-H Tan E-H Tan W-L Lee JN Clinical efficacy and biomarker analysis of dual PD-1/CTLA-4 Blockade in recurrent/metastatic EBV-associated nasopharyngeal carcinoma Nat Commun 2023 14 1 2781 10.1038/s41467-023-38407-7 37188668 PMC10184620 Lim DW-T, Kao H-F, Suteja L, Li CH, Quah HS, Tan DS-W, Tan S-H, Tan E-H, Tan W-L, Lee JN. Clinical efficacy and biomarker analysis of dual PD-1/CTLA-4 Blockade in recurrent/metastatic EBV-associated nasopharyngeal carcinoma. Nat Commun. 2023;14(1):2781. 37188668 10.1038/s41467-023-38407-7 PMC10184620 6. Li J Chen H Bai L Tang H Identification of cd8 + t-cell exhaustion signatures for prognosis in hbv-related hepatocellular carcinoma patients by integrated analysis of single-cell and bulk rna-sequencing BMC Cancer 2024 24 1 53 10.1186/s12885-023-11804-3 38200408 PMC10777580 Li J, Chen H, Bai L, Tang H. Identification of cd8 + t-cell exhaustion signatures for prognosis in hbv-related hepatocellular carcinoma patients by integrated analysis of single-cell and bulk rna-sequencing. BMC Cancer. 2024;24(1):53. 38200408 10.1186/s12885-023-11804-3 PMC10777580 7. Ye B Liu X Li X Kong H Tian L Chen Y T-cell exhaustion in chronic hepatitis B infection: current knowledge and clinical significance Cell Death Dis 2015 6 3 e1694 1694 10.1038/cddis.2015.42 25789969 PMC4385920 Ye B, Liu X, Li X, Kong H, Tian L, Chen Y. T-cell exhaustion in chronic hepatitis B infection: current knowledge and clinical significance. Cell Death Dis. 2015;6(3):e1694–1694. 25789969 10.1038/cddis.2015.42 PMC4385920 8. Chen S, Yao C, Tian N, Zhang C, Chen Y, Wang X, Jiang Y, Zhang T, Zeng T, Song Y. The interplay between persistent pathogen infections with tumor microenvironment and immunotherapy in cancer. Cancer Med 2024;13(17):e70154. 10.1002/cam4.70154 PMC11378724 39240588 9. Milotay G, Little M, Watson RA, Muldoon D, MacKay S, Kurioka A, Tong O, Taylor CA, Nassiri I, Webb L. M. CMV serostatus is associated with improved survival and delayed toxicity onset following anti-PD-1 checkpoint Blockade. Nat Med. 2025;31(7):2350–64. 10.1038/s41591-025-03647-1 PMC12283384 40269332 10. Song D Li H Li H Dai J Effect of human papillomavirus infection on the immune system and its role in the course of cervical cancer Oncol Lett 2015 10 2 600 6 10.3892/ol.2015.3295 26622540 PMC4509451 Song D, Li H, Li H, Dai J. Effect of human papillomavirus infection on the immune system and its role in the course of cervical cancer. Oncol Lett. 2015;10(2):600–6. 26622540 10.3892/ol.2015.3295 PMC4509451 11. Cho K Lee HG Piao J-Y Kim S-J Na H-K Surh Y-J Protective effects of Silibinin on Helicobacter pylori-induced gastritis: NF-κB and STAT3 as potential targets J Cancer Prev 2021 26 2 118 10.15430/JCP.2021.26.2.118 34258250 PMC8249208 Cho K, Lee HG, Piao J-Y, Kim S-J, Na H-K, Surh Y-J. Protective effects of Silibinin on Helicobacter pylori-induced gastritis: NF-κB and STAT3 as potential targets. J Cancer Prev. 2021;26(2):118. 34258250 10.15430/JCP.2021.26.2.118 PMC8249208 12. Mo Y Ma J Zhang H Shen J Chen J Hong J Xu Y Qian C Prophylactic and therapeutic HPV vaccines: current scenario and perspectives Front Cell Infect Microbiol 2022 12 909223 10.3389/fcimb.2022.909223 35860379 PMC9289603 Mo Y, Ma J, Zhang H, Shen J, Chen J, Hong J, Xu Y, Qian C. Prophylactic and therapeutic HPV vaccines: current scenario and perspectives. Front Cell Infect Microbiol. 2022;12:909223. 35860379 10.3389/fcimb.2022.909223 PMC9289603 13. Amiri S Rasekh S Moezzi SMI Seifi N Fatemi SA Fathi S Bagheri A Negahdaripour M Prophylactic vaccines against HPV-caused cervical cancer: novel vaccines are still demanded Infect Agents Cancer 2025 20 1 16 10.1186/s13027-025-00643-5 PMC11892266 40059217 Amiri S, Rasekh S, Moezzi SMI, Seifi N, Fatemi SA, Fathi S, Bagheri A, Negahdaripour M. Prophylactic vaccines against HPV-caused cervical cancer: novel vaccines are still demanded. Infect Agents Cancer. 2025;20(1):16. 10.1186/s13027-025-00643-5 PMC11892266 40059217 14. Mahmood F Xu R Awan MUN Song Y Han Q Xia X Wei J Xu J Peng J Zhang J HBV vaccines: advances and development Vaccines 2023 11 12 1862 10.3390/vaccines11121862 38140265 PMC10747071 Mahmood F, Xu R, Awan MUN, Song Y, Han Q, Xia X, Wei J, Xu J, Peng J, Zhang J. HBV vaccines: advances and development. Vaccines. 2023;11(12):1862. 38140265 10.3390/vaccines11121862 PMC10747071 15. Kausar S Said Khan F Ishaq Mujeeb Ur Rehman M Akram M Riaz M Rasool G Hamid Khan A Saleem I Shamim S Malik A A review: mechanism of action of antiviral drugs Int J ImmunoPathol Pharmacol 2021 35 20587384211002621 10.1177/20587384211002621 33726557 PMC7975490 Kausar S, Said Khan F, Ishaq Mujeeb Ur Rehman M, Akram M, Riaz M, Rasool G, Hamid Khan A, Saleem I, Shamim S, Malik A. A review: mechanism of action of antiviral drugs. Int J ImmunoPathol Pharmacol. 2021;35:20587384211002621. 33726557 10.1177/20587384211002621 PMC7975490 16. Boutilier AJ Elsawa SF Macrophage polarization States in the tumor microenvironment Int J Mol Sci 2021 22 13 6995 10.3390/ijms22136995 34209703 PMC8268869 Boutilier AJ, Elsawa SF. Macrophage polarization States in the tumor microenvironment. Int J Mol Sci. 2021;22(13):6995. 34209703 10.3390/ijms22136995 PMC8268869 17. Che G Yin J Wang W Luo Y Chen Y Yu X Wang H Liu X Chen Z Wang X Circumventing drug resistance in gastric cancer: a Spatial multi-omics exploration of chemo and immuno-therapeutic response dynamics Drug Resist Updates 2024 74 101080 10.1016/j.drup.2024.101080 38579635 Che G, Yin J, Wang W, Luo Y, Chen Y, Yu X, Wang H, Liu X, Chen Z, Wang X. Circumventing drug resistance in gastric cancer: a Spatial multi-omics exploration of chemo and immuno-therapeutic response dynamics. Drug Resist Updates. 2024;74:101080. 10.1016/j.drup.2024.101080 38579635 18. Cerdeira CD Brigagão MR Targeting macrophage polarization in infectious diseases: M1/M2 functional profiles, immune signaling and microbial virulence factors Immunol Investig 2024 53 7 1030 91 10.1080/08820139.2024.2367682 38913937 Cerdeira CD, Brigagão MR. Targeting macrophage polarization in infectious diseases: M1/M2 functional profiles, immune signaling and microbial virulence factors. Immunol Investig. 2024;53(7):1030–91. 38913937 10.1080/08820139.2024.2367682 19. Fei X Li N Xu X Zhu Y Macrophage biology in the pathogenesis of Helicobacter pylori infection Crit Rev Microbiol 2025 51 3 399 416 10.1080/1040841X.2024.2366944 39086061 Fei X, Li N, Xu X, Zhu Y. Macrophage biology in the pathogenesis of Helicobacter pylori infection. Crit Rev Microbiol. 2025;51(3):399–416. 39086061 10.1080/1040841X.2024.2366944 20. Snietura M Brewczynski A Kopec A Rutkowski T Infiltrates of M2-like tumour-associated macrophages are adverse prognostic factor in patients with human papillomavirus-negative but not in human papillomavirus-positive oropharyngeal squamous cell carcinoma Pathobiology 2020 87 2 75 86 10.1159/000505522 32036360 Snietura M, Brewczynski A, Kopec A, Rutkowski T. Infiltrates of M2-like tumour-associated macrophages are adverse prognostic factor in patients with human papillomavirus-negative but not in human papillomavirus-positive oropharyngeal squamous cell carcinoma. Pathobiology. 2020;87(2):75–86. 32036360 10.1159/000505522 21. Zhang B Miao T Shen X Bao L Zhang C Yan C Wei W Chen J Xiao L Sun C EB virus-induced ATR activation accelerates nasopharyngeal carcinoma growth via M2-type macrophages polarization Cell Death Dis 2020 11 9 742 10.1038/s41419-020-02925-9 32917854 PMC7486933 Zhang B, Miao T, Shen X, Bao L, Zhang C, Yan C, Wei W, Chen J, Xiao L, Sun C. EB virus-induced ATR activation accelerates nasopharyngeal carcinoma growth via M2-type macrophages polarization. Cell Death Dis. 2020;11(9):742. 32917854 10.1038/s41419-020-02925-9 PMC7486933 22. Tagawa T Mahesh G Ziegelbauer JM Analysis of tumor infiltrating immune cells in Kaposi sarcoma lesions discovers shifts in macrophage populations Global Health Med 2024 6 5 310 5 10.35772/ghm.2024.01066 PMC11514630 39483448 Tagawa T, Mahesh G, Ziegelbauer JM. Analysis of tumor infiltrating immune cells in Kaposi sarcoma lesions discovers shifts in macrophage populations. Global Health Med. 2024;6(5):310–5. 10.35772/ghm.2024.01066 PMC11514630 39483448 23. Yu S Ge H Li S Qiu H-J Modulation of macrophage polarization by viruses: turning off/on host antiviral responses Front Microbiol 2022 13 839585 10.3389/fmicb.2022.839585 35222345 PMC8874017 Yu S, Ge H, Li S, Qiu H-J. Modulation of macrophage polarization by viruses: turning off/on host antiviral responses. Front Microbiol. 2022;13:839585. 35222345 10.3389/fmicb.2022.839585 PMC8874017 24. Liang M Liu Y Zhang Z Yang H Dai N Zhang N Sun W Guo Y Kong J Wang X Fusobacterium nucleatum induces MDSCs enrichment via activation the NLRP3 inflammosome in ESCC cells, leading to cisplatin resistance Ann Med 2022 54 1 989 1003 10.1080/07853890.2022.2061045 35435776 PMC9891225 Liang M, Liu Y, Zhang Z, Yang H, Dai N, Zhang N, Sun W, Guo Y, Kong J, Wang X. Fusobacterium nucleatum induces MDSCs enrichment via activation the NLRP3 inflammosome in ESCC cells, leading to cisplatin resistance. Ann Med. 2022;54(1):989–1003. 35435776 10.1080/07853890.2022.2061045 PMC9891225 25. Luo M Li Q Gu Q Zhang C Fusobacterium nucleatum: a novel regulator of antitumor immune checkpoint Blockade therapy in colorectal cancer Am J Cancer Res 2024 14 8 3962 10.62347/MYZA2640 39267665 PMC11387864 Luo M, Li Q, Gu Q, Zhang C. Fusobacterium nucleatum: a novel regulator of antitumor immune checkpoint Blockade therapy in colorectal cancer. Am J Cancer Res. 2024;14(8):3962. 39267665 10.62347/MYZA2640 PMC11387864 26. Ding L Chakrabarti J Sheriff S Li Q Hong HNT Sontz RA Mendoza ZE Schreibeis A Helmrath MA Zavros Y Toll-like receptor 9 pathway mediates Schlafen+-MDSC polarization during Helicobacter-induced gastric metaplasias Gastroenterology 2022 163 2 411 25 10.1053/j.gastro.2022.04.031 35487288 PMC9329252 Ding L, Chakrabarti J, Sheriff S, Li Q, Hong HNT, Sontz RA, Mendoza ZE, Schreibeis A, Helmrath MA, Zavros Y. Toll-like receptor 9 pathway mediates Schlafen+-MDSC polarization during Helicobacter-induced gastric metaplasias. Gastroenterology. 2022;163(2):411–25. e414. 35487288 10.1053/j.gastro.2022.04.031 PMC9329252 27. Haist M Stege H Grabbe S Bros M The functional crosstalk between myeloid-derived suppressor cells and regulatory T cells within the immunosuppressive tumor microenvironment Cancers 2021 13 2 210 10.3390/cancers13020210 33430105 PMC7827203 Haist M, Stege H, Grabbe S, Bros M. The functional crosstalk between myeloid-derived suppressor cells and regulatory T cells within the immunosuppressive tumor microenvironment. Cancers. 2021;13(2):210. 33430105 10.3390/cancers13020210 PMC7827203 28. Pal S Dey D Chakraborty BC Nandi M Khatun M Banerjee S Santra A Ghosh R Ahammed SM Chowdhury A Diverse facets of MDSC in different phases of chronic HBV infection: impact on HBV-specific T‐cell response and homing Hepatology 2022 76 3 759 74 10.1002/hep.32331 35000202 Pal S, Dey D, Chakraborty BC, Nandi M, Khatun M, Banerjee S, Santra A, Ghosh R, Ahammed SM, Chowdhury A. Diverse facets of MDSC in different phases of chronic HBV infection: impact on HBV-specific T‐cell response and homing. Hepatology. 2022;76(3):759–74. 35000202 10.1002/hep.32331 29. Wang N Fang J-Y Fusobacterium nucleatum, a key pathogenic factor and microbial biomarker for colorectal cancer Trends Microbiol 2023 31 2 159 72 10.1016/j.tim.2022.08.010 36058786 Wang N, Fang J-Y. Fusobacterium nucleatum, a key pathogenic factor and microbial biomarker for colorectal cancer. Trends Microbiol. 2023;31(2):159–72. 36058786 10.1016/j.tim.2022.08.010 30. Kong X Zhang Y Xiang L You Y Duan Y Zhao Y Li S Wu R Zhang J Zhou L Fusobacterium nucleatum-triggered neutrophil extracellular traps facilitate colorectal carcinoma progression J Experimental Clin Cancer Res 2023 42 1 236 10.1186/s13046-023-02817-8 PMC10492297 37684625 Kong X, Zhang Y, Xiang L, You Y, Duan Y, Zhao Y, Li S, Wu R, Zhang J, Zhou L. Fusobacterium nucleatum-triggered neutrophil extracellular traps facilitate colorectal carcinoma progression. J Experimental Clin Cancer Res. 2023;42(1):236. 10.1186/s13046-023-02817-8 PMC10492297 37684625 31. Muchova M Kuehne SA Grant MM Smith PP Nagi M Chapple IL Hirschfeld J Fusobacterium nucleatum elicits subspecies-specific responses in human neutrophils Front Cell Infect Microbiol 2024 14 1449539 10.3389/fcimb.2024.1449539 39450334 PMC11499235 Muchova M, Kuehne SA, Grant MM, Smith PP, Nagi M, Chapple IL, Hirschfeld J. Fusobacterium nucleatum elicits subspecies-specific responses in human neutrophils. Front Cell Infect Microbiol. 2024;14:1449539. 39450334 10.3389/fcimb.2024.1449539 PMC11499235 32. Masui H Kawada K Obama K Neutrophil and colorectal cancer Int J Mol Sci 2024 26 1 6 10.3390/ijms26010006 39795864 PMC11720084 Masui H, Kawada K, Obama K. Neutrophil and colorectal cancer. Int J Mol Sci. 2024;26(1):6. 39795864 10.3390/ijms26010006 PMC11720084 33. Lee HS Kim WJ The role of matrix metalloproteinase in inflammation with a focus on infectious diseases Int J Mol Sci 2022 23 18 10546 10.3390/ijms231810546 36142454 PMC9500641 Lee HS, Kim WJ. The role of matrix metalloproteinase in inflammation with a focus on infectious diseases. Int J Mol Sci. 2022;23(18):10546. 36142454 10.3390/ijms231810546 PMC9500641 34. Demkow U Neutrophil extracellular traps (NETs) in cancer invasion, evasion and metastasis Cancers 2021 13 17 4495 10.3390/cancers13174495 34503307 PMC8431228 Demkow U. Neutrophil extracellular traps (NETs) in cancer invasion, evasion and metastasis. Cancers. 2021;13(17):4495. 34503307 10.3390/cancers13174495 PMC8431228 35. Rivera A Siracusa MC Yap GS Gause WC Innate cell communication kick-starts pathogen-specific immunity Nat Immunol 2016 17 4 356 63 10.1038/ni.3375 27002843 PMC4949486 Rivera A, Siracusa MC, Yap GS, Gause WC. Innate cell communication kick-starts pathogen-specific immunity. Nat Immunol. 2016;17(4):356–63. 27002843 10.1038/ni.3375 PMC4949486 36. Chan L Morovati S Karimi N Alizadeh K Vanderkamp S Kakish JE Bridle BW Karimi K Neutrophil functional heterogeneity and implications for viral infections and treatments Cells 2022 11 8 1322 10.3390/cells11081322 35456003 PMC9025666 Chan L, Morovati S, Karimi N, Alizadeh K, Vanderkamp S, Kakish JE, Bridle BW, Karimi K. Neutrophil functional heterogeneity and implications for viral infections and treatments. Cells. 2022;11(8):1322. 35456003 10.3390/cells11081322 PMC9025666 37. Hilligan KL Ronchese F Antigen presentation by dendritic cells and their instruction of CD4 + T helper cell responses Cell Mol Immunol 2020 17 6 587 99 10.1038/s41423-020-0465-0 32433540 PMC7264306 Hilligan KL, Ronchese F. Antigen presentation by dendritic cells and their instruction of CD4 + T helper cell responses. Cell Mol Immunol. 2020;17(6):587–99. 32433540 10.1038/s41423-020-0465-0 PMC7264306 38. Oth T, Vanderlocht J, Van Elssen C H, Bos G M, Germeraad W T. Pathogen-associated molecular patterns induced crosstalk between dendritic cells, T helper cells, and natural killer helper cells can improve dendritic cell vaccination. Mediat Inflamm. 2016;2016(1):5740373. 10.1155/2016/5740373 PMC4766350 26980946 39. Azimi T, Nasser A, Shariati A, Shiadeh SM, Safari H, Alizade-Sani M, Taghipour A, Dehghan A. The possible role of pathogenic and non-pathogenic bacteria in initiation and exacerbation of Celiac disease; a comprehensive review. Curr Pharm Biotechnol. 2020;21(6):452–66. 10.2174/1389201021666191219160729 31858910 40. Wirtz S, Becker C, Fantini MC, Nieuwenhuis EE, Tubbe I, Galle PR, Schild H-Jr, Birkenbach M, Blumberg RS, Neurath MF. EBV-induced gene 3 transcription is induced by TLR signaling in primary dendritic cells via NF-κB activation. J Immunol. 2005;174(5):2814–24. 10.4049/jimmunol.174.5.2814 15728491 41. Neuper T, Frauenlob T, Sarajlic M, Posselt G, Wessler S, Horejs-Hoeck J. TLR2, TLR4 and TLR10 shape the cytokine and chemokine release of H. pylori-infected human DCs. Int J Mol Sci. 2020;21(11):3897. 10.3390/ijms21113897 PMC7311968 32486097 42. Owyang SY, Zhang M, El-Zaatari M, Eaton KA, Bishu S, Hou G, Grasberger H, Kao JY. Dendritic cell‐derived TGF‐β mediates the induction of mucosal regulatory T‐cell response to Helicobacter infection essential for maintenance of immune tolerance in mice. Helicobacter 2020;25(6):e12763. 10.1111/hel.12763 PMC7885176 33025641 43. Oster P, Vaillant L, Riva E, McMillan B, Begka C, Truntzer C, Richard C, Leblond MM, Messaoudene M, Machremi E. Helicobacter pylori infection has a detrimental impact on the efficacy of cancer immunotherapies. Gut. 2022;71(3):457–66. 10.1136/gutjnl-2020-323392 PMC8862014 34253574 44. Li Q Geng S Luo H Wang W Mo Y-Q Luo Q Wang L Song G-B Sheng J-P Xu B Signaling pathways involved in colorectal cancer: pathogenesis and targeted therapy Signal Transduct Target Therapy 2024 9 1 266 10.1038/s41392-024-01953-7 PMC11456611 39370455 Li Q, Geng S, Luo H, Wang W, Mo Y-Q, Luo Q, Wang L, Song G-B, Sheng J-P, Xu B. Signaling pathways involved in colorectal cancer: pathogenesis and targeted therapy. Signal Transduct Target Therapy. 2024;9(1):266. 10.1038/s41392-024-01953-7 PMC11456611 39370455 45. Björkström NK Strunz B Ljunggren H-G Natural killer cells in antiviral immunity Nat Rev Immunol 2022 22 2 112 23 10.1038/s41577-021-00558-3 34117484 PMC8194386 Björkström NK, Strunz B, Ljunggren H-G. Natural killer cells in antiviral immunity. Nat Rev Immunol. 2022;22(2):112–23. 34117484 10.1038/s41577-021-00558-3 PMC8194386 46. Oth T Habets TH Germeraad WT Zonneveld MI Bos GM Vanderlocht J Pathogen recognition by NK cells amplifies the pro-inflammatory cytokine production of monocyte-derived DC via IFN-γ BMC Immunol 2018 19 1 8 10.1186/s12865-018-0247-y 29433450 PMC5810032 Oth T, Habets TH, Germeraad WT, Zonneveld MI, Bos GM, Vanderlocht J. Pathogen recognition by NK cells amplifies the pro-inflammatory cytokine production of monocyte-derived DC via IFN-γ. BMC Immunol. 2018;19(1):8. 29433450 10.1186/s12865-018-0247-y PMC5810032 47. Peng P, Lou Y, Wang S, Wang J, Zhang Z, Du P, Zheng J, Liu P, Xu L. X. Activated NK cells reprogram MDSCs via NKG2D-NKG2DL and IFN-γ to modulate antitumor T-cell response after cryo-thermal therapy. J Immunother Cancer 2022;10(12):e005769. 10.1136/jitc-2022-005769 PMC9756281 36521929 48. Sajid M Liu L Sun C The dynamic role of NK cells in liver cancers: role in HCC and HBV associated HCC and its therapeutic implications Front Immunol 2022 13 887186 10.3389/fimmu.2022.887186 35669776 PMC9165341 Sajid M, Liu L, Sun C. The dynamic role of NK cells in liver cancers: role in HCC and HBV associated HCC and its therapeutic implications. Front Immunol. 2022;13:887186. 35669776 10.3389/fimmu.2022.887186 PMC9165341 49. Montes-Mojarro IA Fend F Quintanilla-Martinez L EBV and the pathogenesis of NK/T cell lymphoma Cancers 2021 13 6 1414 10.3390/cancers13061414 33808787 PMC8003370 Montes-Mojarro IA, Fend F, Quintanilla-Martinez L. EBV and the pathogenesis of NK/T cell lymphoma. Cancers. 2021;13(6):1414. 33808787 10.3390/cancers13061414 PMC8003370 50. Zaghi E Calvi M Marcenaro E Mavilio D Di Vito C Targeting NKG2A to elucidate natural killer cell ontogenesis and to develop novel immune-therapeutic strategies in cancer therapy J Leukoc Biol 2019 105 6 1243 51 10.1002/JLB.MR0718-300R 30645023 Zaghi E, Calvi M, Marcenaro E, Mavilio D, Di Vito C. Targeting NKG2A to elucidate natural killer cell ontogenesis and to develop novel immune-therapeutic strategies in cancer therapy. J Leukoc Biol. 2019;105(6):1243–51. 30645023 10.1002/JLB.MR0718-300R 51. Keikha M Ghazvini K Eslami M Yousefi B Casseb J Yousefi M Karbalaei M Molecular targeting of PD-1 signaling pathway as a novel therapeutic approach in HTLV-1 infection Microb Pathog 2020 144 104198 10.1016/j.micpath.2020.104198 32283259 Keikha M, Ghazvini K, Eslami M, Yousefi B, Casseb J, Yousefi M, Karbalaei M. Molecular targeting of PD-1 signaling pathway as a novel therapeutic approach in HTLV-1 infection. Microb Pathog. 2020;144:104198. 32283259 10.1016/j.micpath.2020.104198 52. Shepherd FR McLaren JE T cell immunity to bacterial pathogens: mechanisms of immune control and bacterial evasion Int J Mol Sci 2020 21 17 6144 10.3390/ijms21176144 32858901 PMC7504484 Shepherd FR, McLaren JE. T cell immunity to bacterial pathogens: mechanisms of immune control and bacterial evasion. Int J Mol Sci. 2020;21(17):6144. 32858901 10.3390/ijms21176144 PMC7504484 53. Huo S, Luo Y, Deng R, Liu X, Wang J, Wang L, Zhang B, Wang F, Lu J, Li X. EBV-EBNA1 constructs an immunosuppressive microenvironment for nasopharyngeal carcinoma by promoting the chemoattraction of Treg cells. J Immunother Cancer 2020;8(2):e001588. 10.1136/jitc-2020-001588 PMC7597532 33122398 54. Wang J Luo Y Bi P Lu J Wang F Liu X Zhang B Li X Mechanisms of Epstein-Barr virus nuclear antigen 1 favor Tregs accumulation in nasopharyngeal carcinoma Cancer Med 2020 9 15 5598 608 10.1002/cam4.3213 32573058 PMC7402843 Wang J, Luo Y, Bi P, Lu J, Wang F, Liu X, Zhang B, Li X. Mechanisms of Epstein-Barr virus nuclear antigen 1 favor Tregs accumulation in nasopharyngeal carcinoma. Cancer Med. 2020;9(15):5598–608. 32573058 10.1002/cam4.3213 PMC7402843 55. Lechien JR Descamps G Seminerio I Furgiuele S Dequanter D Mouawad F Badoual C Journe F Saussez S HPV involvement in the tumor microenvironment and immune treatment in head and neck squamous cell carcinomas Cancers 2020 12 5 1060 10.3390/cancers12051060 32344813 PMC7281394 Lechien JR, Descamps G, Seminerio I, Furgiuele S, Dequanter D, Mouawad F, Badoual C, Journe F, Saussez S. HPV involvement in the tumor microenvironment and immune treatment in head and neck squamous cell carcinomas. Cancers. 2020;12(5):1060. 32344813 10.3390/cancers12051060 PMC7281394 56. Wan Z, Zhou Z, Liu Y, Lai Y, Luo Y, Peng X, Zou W. Regulatory T cells and T helper 17 cells in viral infection. Scand J Immunol 2020;91(5):e12873. 10.1111/sji.12873 32090360 57. Ciurkiewicz M Herder V Beineke A Beneficial and detrimental effects of regulatory T cells in neurotropic virus infections Int J Mol Sci 2020 21 5 1705 10.3390/ijms21051705 32131483 PMC7084400 Ciurkiewicz M, Herder V, Beineke A. Beneficial and detrimental effects of regulatory T cells in neurotropic virus infections. Int J Mol Sci. 2020;21(5):1705. 32131483 10.3390/ijms21051705 PMC7084400 58. Zheng X Huang Y Li K Luo R Cai M Yun J Immunosuppressive tumor microenvironment and immunotherapy of epstein–barr virus-associated malignancies Viruses 2022 14 5 1017 10.3390/v14051017 35632758 PMC9146158 Zheng X, Huang Y, Li K, Luo R, Cai M, Yun J. Immunosuppressive tumor microenvironment and immunotherapy of epstein–barr virus-associated malignancies. Viruses. 2022;14(5):1017. 35632758 10.3390/v14051017 PMC9146158 59. Jubel JM Barbati ZR Burger C Wirtz DC Schildberg FA The role of PD-1 in acute and chronic infection Front Immunol 2020 11 487 10.3389/fimmu.2020.00487 32265932 PMC7105608 Jubel JM, Barbati ZR, Burger C, Wirtz DC, Schildberg FA. The role of PD-1 in acute and chronic infection. Front Immunol. 2020;11:487. 32265932 10.3389/fimmu.2020.00487 PMC7105608 60. Pauken KE Godec J Odorizzi PM Brown KE Yates KB Ngiow SF Burke KP Maleri S Grande SM Francisco LM The PD-1 pathway regulates development and function of memory CD8 + T cells following respiratory viral infection Cell Rep 2020 31 13 10.1016/j.celrep.2020.107827 PMC7377452 32610128 Pauken KE, Godec J, Odorizzi PM, Brown KE, Yates KB, Ngiow SF, Burke KP, Maleri S, Grande SM, Francisco LM. The PD-1 pathway regulates development and function of memory CD8 + T cells following respiratory viral infection. Cell Rep. 2020;31:13. 10.1016/j.celrep.2020.107827 PMC7377452 32610128 61. Muñoz-Melero M Biswas M Role of FoxP3 + regulatory T cells in modulating immune responses to adeno-associated virus gene therapy Hum Gene Ther 2024 35 13–14 439 50 10.1089/hum.2023.227 38450566 PMC11302314 Muñoz-Melero M, Biswas M. Role of FoxP3 + regulatory T cells in modulating immune responses to adeno-associated virus gene therapy. Hum Gene Ther. 2024;35(13–14):439–50. 38450566 10.1089/hum.2023.227 PMC11302314 62. Ahmadi Ghezeldasht S Blackbourn DJ Mosavat A Rezaee SA Pathogenicity and virulence of human T lymphotropic virus type-1 (HTLV-1) in oncogenesis: adult T-cell leukemia/lymphoma (ATLL) Crit Rev Clin Lab Sci 2023 60 3 189 211 10.1080/10408363.2022.2157791 36593730 Ahmadi Ghezeldasht S, Blackbourn DJ, Mosavat A, Rezaee SA. Pathogenicity and virulence of human T lymphotropic virus type-1 (HTLV-1) in oncogenesis: adult T-cell leukemia/lymphoma (ATLL). Crit Rev Clin Lab Sci. 2023;60(3):189–211. 36593730 10.1080/10408363.2022.2157791 63. O’Donnell JS Hunt SK Chappell KJ Integrated molecular and immunological features of human T-lymphotropic virus type 1 infection and disease progression to adult T-cell leukaemia or lymphoma Lancet Haematol 2023 10 7 e539 48 10.1016/S2352-3026(23)00087-X 37407143 O’Donnell JS, Hunt SK, Chappell KJ. Integrated molecular and immunological features of human T-lymphotropic virus type 1 infection and disease progression to adult T-cell leukaemia or lymphoma. Lancet Haematol. 2023;10(7):e539–48. 37407143 10.1016/S2352-3026(23)00087-X 64. Zuo X, Zhou R, Yang S, Ma G. HTLV-1 persistent infection and ATLL oncogenesis. J Med Virol 2023;95(1):e28424. 10.1002/jmv.28424 36546414 65. Wang W-H Lin C-Y Chang MR Urbina AN Assavalapsakul W Thitithanyanont A Chen Y-H Liu F-T Wang S-F The role of galectins in virus infection-A systemic literature review J Microbiol Immunol Infect 2020 53 6 925 35 10.1016/j.jmii.2019.09.005 31630962 Wang W-H, Lin C-Y, Chang MR, Urbina AN, Assavalapsakul W, Thitithanyanont A, Chen Y-H, Liu F-T, Wang S-F. The role of galectins in virus infection-A systemic literature review. J Microbiol Immunol Infect. 2020;53(6):925–35. 31630962 10.1016/j.jmii.2019.09.005 66. Tan BJ Sugata K Reda O Matsuo M Uchiyama K Miyazato P Hahaut V Yamagishi M Uchimaru K Suzuki Y HTLV-1 infection promotes excessive T cell activation and transformation into adult T cell leukemia/lymphoma J Clin Investig 2021 131 24 10.1172/JCI150472 PMC8670839 34907908 Tan BJ, Sugata K, Reda O, Matsuo M, Uchiyama K, Miyazato P, Hahaut V, Yamagishi M, Uchimaru K, Suzuki Y. HTLV-1 infection promotes excessive T cell activation and transformation into adult T cell leukemia/lymphoma. J Clin Investig. 2021;131:24. 10.1172/JCI150472 PMC8670839 34907908 67. Echevarria-Lima J Moles R Monocyte and macrophage functions in oncogenic viral infections Viruses 2024 16 10 1612 10.3390/v16101612 39459945 PMC11512331 Echevarria-Lima J, Moles R. Monocyte and macrophage functions in oncogenic viral infections. Viruses. 2024;16(10):1612. 39459945 10.3390/v16101612 PMC11512331 68. Viens LJ, Henley SJ, Watson M, Markowitz LE, Saraiya M. Human papillomavirus–associated cancers—United States, 2008–2012. MMWR Morb Mortal Wkly Rep. 2016;65(26):661. 10.15585/mmwr.mm6526a1 27387669 69. Gao G Smith DI Human papillomavirus and the development of different cancers Cytogenet Genome Res 2017 150 3–4 185 93 10.1159/000458166 28245440 Gao G, Smith DI. Human papillomavirus and the development of different cancers. Cytogenet Genome Res. 2017;150(3–4):185–93. 10.1159/000458166 28245440 70. Schiffman M Castle PE Jeronimo J Rodriguez AC Wacholder S Human papillomavirus and cervical cancer Lancet 2007 370 9590 890 907 10.1016/S0140-6736(07)61416-0 17826171 Schiffman M, Castle PE, Jeronimo J, Rodriguez AC, Wacholder S. Human papillomavirus and cervical cancer. Lancet. 2007;370(9590):890–907. 17826171 10.1016/S0140-6736(07)61416-0 71. de Freitas AC de Oliveira THA Barros MR Venuti A HrHPV E5 oncoprotein: immune evasion and related immunotherapies J Experimental Clin Cancer Res 2017 36 1 15 10.1186/s13046-017-0541-1 PMC5445378 28545552 de Freitas AC, de Oliveira THA, Barros MR, Venuti A. HrHPV E5 oncoprotein: immune evasion and related immunotherapies. J Experimental Clin Cancer Res. 2017;36:1–15. 10.1186/s13046-017-0541-1 PMC5445378 28545552 72. Pereira Santos VE de França São Marcos B Fontes PHB Silva ME d S Leão SL da Silva GRP Ribeiro DE da Gama MAT I. A. E5 oncoprotein: A key player in human Papillomavirus-Positive head and neck cancer pathogenesis and therapy resistance Viruses 2025 17 4 512 10.3390/v17040512 40284955 PMC12031384 Pereira Santos VE, de França São Marcos B, Fontes PHB, Silva ME, d. S, Leão SL, da Silva GRP, Ribeiro DE, da Gama MAT. I. A. E5 oncoprotein: A key player in human Papillomavirus-Positive head and neck cancer pathogenesis and therapy resistance. Viruses. 2025;17(4):512. de Oliveira Isídio, B. E.; de Moura,. 40284955 10.3390/v17040512 PMC12031384 73. Zhao J Yang T Zhao M Pei M Yang X Effects of endometrial cancer complicated with HPV infection on HE4 and Th1/Th2 cytokines Int J Clin Exp Med 2020 13 4495 500 Zhao J, Yang T, Zhao M, Pei M, Yang X. Effects of endometrial cancer complicated with HPV infection on HE4 and Th1/Th2 cytokines. Int J Clin Exp Med. 2020;13:4495–500. 74. Huang X Huo L Xiao B Ouyang Y Chen F Li J Zheng X Wei D Wu Y Zhang R Activating STING/TBK1 suppresses tumor growth via degrading HPV16/18 E7 oncoproteins in cervical cancer Cell Death Differ 2024 31 1 78 89 10.1038/s41418-023-01242-w 38007552 PMC10781763 Huang X, Huo L, Xiao B, Ouyang Y, Chen F, Li J, Zheng X, Wei D, Wu Y, Zhang R. Activating STING/TBK1 suppresses tumor growth via degrading HPV16/18 E7 oncoproteins in cervical cancer. Cell Death Differ. 2024;31(1):78–89. 38007552 10.1038/s41418-023-01242-w PMC10781763 75. Rotman J Otter LAd Bleeker MC Samuels SS Heeren AM Roemer MG Kenter GG Zijlmans HJ van Trommel NE de Gruijl T D. PD-L1 and PD-L2 expression in cervical cancer: regulation and biomarker potential Front Immunol 2020 11 596825 10.3389/fimmu.2020.596825 33424844 PMC7793653 Rotman J, Otter LAd, Bleeker MC, Samuels SS, Heeren AM, Roemer MG, Kenter GG, Zijlmans HJ, van Trommel NE, de Gruijl T. D. PD-L1 and PD-L2 expression in cervical cancer: regulation and biomarker potential. Front Immunol. 2020;11:596825. 33424844 10.3389/fimmu.2020.596825 PMC7793653 76. Yang W Lu YP Yang YZ Kang JR Jin YD Wang HW Expressions of programmed death (PD)-1 and PD‐1 ligand (PD‐L1) in cervical intraepithelial neoplasia and cervical squamous cell carcinomas are of prognostic value and associated with human papillomavirus status J Obstet Gynecol Res 2017 43 10 1602 12 10.1111/jog.13411 28833798 Yang W, Lu YP, Yang YZ, Kang JR, Jin YD, Wang HW. Expressions of programmed death (PD)-1 and PD‐1 ligand (PD‐L1) in cervical intraepithelial neoplasia and cervical squamous cell carcinomas are of prognostic value and associated with human papillomavirus status. J Obstet Gynecol Res. 2017;43(10):1602–12. 28833798 10.1111/jog.13411 77. Dibbern ME Bullock TN Jenkins TM Duska LR Stoler MH Mills AM Loss of MHC class I expression in HPV-associated cervical and vulvar neoplasia: a potential mechanism of resistance to checkpoint Inhibition Am J Surg Pathol 2020 44 9 1184 91 10.1097/PAS.0000000000001506 32496434 Dibbern ME, Bullock TN, Jenkins TM, Duska LR, Stoler MH, Mills AM. Loss of MHC class I expression in HPV-associated cervical and vulvar neoplasia: a potential mechanism of resistance to checkpoint Inhibition. Am J Surg Pathol. 2020;44(9):1184–91. 32496434 10.1097/PAS.0000000000001506 78. de Martel C Maucort-Boulch D Plummer M Franceschi S World‐wide relative contribution of hepatitis B and C viruses in hepatocellular carcinoma Hepatology 2015 62 4 1190 200 10.1002/hep.27969 26146815 PMC5019261 de Martel C, Maucort-Boulch D, Plummer M, Franceschi S. World‐wide relative contribution of hepatitis B and C viruses in hepatocellular carcinoma. Hepatology. 2015;62(4):1190–200. 26146815 10.1002/hep.27969 PMC5019261 79. Shouval D Shibolet O Immunosuppression and HBV reactivation. In Seminars in liver disease Thieme Med Publishers 2013 33 167 77 10.1055/s-0033-1345722 23749673 Shouval D, Shibolet O. Immunosuppression and HBV reactivation. In Seminars in liver disease 10.1055/s-0033-1345722 23749673 80. Meng C-Y Sun S Liang Y Xu H Zhang C Zhang M Wang F-S Fu Y-X Peng H Engineered anti-PDL1 with IFNα targets both Immunoinhibitory and activating signals in the liver to break HBV immune tolerance Gut 2023 72 8 1544 54 10.1136/gutjnl-2022-327059 36316098 PMC10359590 Meng C-Y, Sun S, Liang Y, Xu H, Zhang C, Zhang M, Wang F-S, Fu Y-X, Peng H. Engineered anti-PDL1 with IFNα targets both Immunoinhibitory and activating signals in the liver to break HBV immune tolerance. Gut. 2023;72(8):1544–54. 36316098 10.1136/gutjnl-2022-327059 PMC10359590 81. Li B Yan C Zhu J Chen X Fu Q Zhang H Tong Z Liu L Zheng Y Zhao P Anti–PD-1/PD-L1 Blockade immunotherapy employed in treating hepatitis B virus infection–related advanced hepatocellular carcinoma: a literature review Front Immunol 2020 11 1037 10.3389/fimmu.2020.01037 32547550 PMC7270402 Li B, Yan C, Zhu J, Chen X, Fu Q, Zhang H, Tong Z, Liu L, Zheng Y, Zhao P. Anti–PD-1/PD-L1 Blockade immunotherapy employed in treating hepatitis B virus infection–related advanced hepatocellular carcinoma: a literature review. Front Immunol. 2020;11:1037. 32547550 10.3389/fimmu.2020.01037 PMC7270402 82. Petruzziello A Epidemiology of hepatitis B virus (HBV) and hepatitis C virus (HCV) related hepatocellular carcinoma Open Virol J 2018 12 26 10.2174/1874357901812010026 29541276 PMC5842386 Petruzziello A. Epidemiology of hepatitis B virus (HBV) and hepatitis C virus (HCV) related hepatocellular carcinoma. Open Virol J. 2018;12:26. 29541276 10.2174/1874357901812010026 PMC5842386 83. Barik S Suppression of innate immunity by the hepatitis C virus (HCV): revisiting the specificity of host–virus interactive pathways Int J Mol Sci 2023 24 22 16100 10.3390/ijms242216100 38003289 PMC10671098 Barik S. Suppression of innate immunity by the hepatitis C virus (HCV): revisiting the specificity of host–virus interactive pathways. Int J Mol Sci. 2023;24(22):16100. 38003289 10.3390/ijms242216100 PMC10671098 84. Bao S Jiang X Jin S Tu P Lu J TGF-β1 induces immune escape by enhancing PD-1 and CTLA-4 expression on T lymphocytes in hepatocellular carcinoma Front Oncol 2021 11 694145 10.3389/fonc.2021.694145 34249750 PMC8270637 Bao S, Jiang X, Jin S, Tu P, Lu J. TGF-β1 induces immune escape by enhancing PD-1 and CTLA-4 expression on T lymphocytes in hepatocellular carcinoma. Front Oncol. 2021;11:694145. 34249750 10.3389/fonc.2021.694145 PMC8270637 85. Xu J Lin H Wu G Zhu M Li M IL-6/STAT3 is a promising therapeutic target for hepatocellular carcinoma Front Oncol 2021 11 760971 10.3389/fonc.2021.760971 34976809 PMC8714735 Xu J, Lin H, Wu G, Zhu M, Li M. IL-6/STAT3 is a promising therapeutic target for hepatocellular carcinoma. Front Oncol. 2021;11:760971. 34976809 10.3389/fonc.2021.760971 PMC8714735 86. Xu J Liu K Gong Z Liu J Lin H Lin B Li W Zhu M Li M IL-6/STAT3 signaling pathway induces prostate apoptosis response protein-4 (PAR-4) to stimulate malignant behaviors of hepatocellular carcinoma cells Ann Hepatol 2024 29 6 101538 10.1016/j.aohep.2024.101538 39147129 Xu J, Liu K, Gong Z, Liu J, Lin H, Lin B, Li W, Zhu M, Li M. IL-6/STAT3 signaling pathway induces prostate apoptosis response protein-4 (PAR-4) to stimulate malignant behaviors of hepatocellular carcinoma cells. Ann Hepatol. 2024;29(6):101538. 39147129 10.1016/j.aohep.2024.101538 87. Zhou L He R Fang P Li M Yu H Wang Q Yu Y Wang F Zhang Y Chen A Hepatitis B virus rigs the cellular metabolome to avoid innate immune recognition Nat Commun 2021 12 1 98 10.1038/s41467-020-20316-8 33397935 PMC7782485 Zhou L, He R, Fang P, Li M, Yu H, Wang Q, Yu Y, Wang F, Zhang Y, Chen A. Hepatitis B virus rigs the cellular metabolome to avoid innate immune recognition. Nat Commun. 2021;12(1):98. 33397935 10.1038/s41467-020-20316-8 PMC7782485 88. Ying S Liu H Zhang Y Mei Y Harnessing dendritic cell function in hepatocellular carcinoma: advances in immunotherapy and therapeutic strategies Vaccines 2025 13 5 496 10.3390/vaccines13050496 40432108 PMC12115466 Ying S, Liu H, Zhang Y, Mei Y. Harnessing dendritic cell function in hepatocellular carcinoma: advances in immunotherapy and therapeutic strategies. Vaccines. 2025;13(5):496. 40432108 10.3390/vaccines13050496 PMC12115466 89. Li W Chen G Peng H Zhang Q Nie D Guo T Zhu Y Zhang Y Lin M Research progress on dendritic cells in hepatocellular carcinoma immune microenvironments Biomolecules 2024 14 9 1161 10.3390/biom14091161 39334927 PMC11430656 Li W, Chen G, Peng H, Zhang Q, Nie D, Guo T, Zhu Y, Zhang Y, Lin M. Research progress on dendritic cells in hepatocellular carcinoma immune microenvironments. Biomolecules. 2024;14(9):1161. 39334927 10.3390/biom14091161 PMC11430656 90. Wong Y, Meehan MT, Burrows SR, Doolan DL, Miles JJ. Estimating the global burden of Epstein–Barr virus-related cancers. J Cancer Res Clin Oncol 2022;148(1):31–46. 10.1007/s00432-021-03824-y PMC8752571 34705104 91. Huang X Zhang M Zhang Z The role of LMP1 in Epstein-Barr virus-associated gastric cancer Curr Cancer Drug Targets 2024 24 2 127 41 10.2174/1568009623666230512153741 37183458 Huang X, Zhang M, Zhang Z. The role of LMP1 in Epstein-Barr virus-associated gastric cancer. Curr Cancer Drug Targets. 2024;24(2):127–41. 37183458 10.2174/1568009623666230512153741 92. Wang L Ning S New look of EBV LMP1 signaling landscape Cancers 2021 13 21 5451 10.3390/cancers13215451 34771613 PMC8582580 Wang L, Ning S. New look of EBV LMP1 signaling landscape. Cancers. 2021;13(21):5451. 34771613 10.3390/cancers13215451 PMC8582580 93. Sausen DG Basith A Muqeemuddin S EBV and lymphomagenesis Cancers 2023 15 7 2133 10.3390/cancers15072133 37046794 PMC10093459 Sausen DG, Basith A, Muqeemuddin S. EBV and lymphomagenesis. Cancers. 2023;15(7):2133. 37046794 10.3390/cancers15072133 PMC10093459 94. Beer S Wange LE Zhang X Kuklik-Roos C Enard W Hammerschmidt W Scialdone A Kempkes B EBNA2-EBF1 complexes promote MYC expression and metabolic processes driving S-phase progression of Epstein-Barr virus–infected B cells Proc Natl Acad Sci 2022 119 30 e2200512119 10.1073/pnas.2200512119 35857872 PMC9335265 Beer S, Wange LE, Zhang X, Kuklik-Roos C, Enard W, Hammerschmidt W, Scialdone A, Kempkes B. EBNA2-EBF1 complexes promote MYC expression and metabolic processes driving S-phase progression of Epstein-Barr virus–infected B cells. Proc Natl Acad Sci. 2022;119(30):e2200512119. 35857872 10.1073/pnas.2200512119 PMC9335265 95. Chen J Zhou J Cheng F Chen D Guan F Zhang E He J Cai Z Zhao Y Role of plasma EBV-DNA load and EBER status on newly diagnosed peripheral T-cell lymphoma J Cancer Res Clin Oncol 2024 150 4 181 10.1007/s00432-024-05702-9 38587664 PMC11001675 Chen J, Zhou J, Cheng F, Chen D, Guan F, Zhang E, He J, Cai Z, Zhao Y. Role of plasma EBV-DNA load and EBER status on newly diagnosed peripheral T-cell lymphoma. J Cancer Res Clin Oncol. 2024;150(4):181. 38587664 10.1007/s00432-024-05702-9 PMC11001675 96. Knerr JM Kledal TN Rosenkilde MM Molecular properties and therapeutic targeting of the EBV-encoded receptor BILF1 Cancers 2021 13 16 4079 10.3390/cancers13164079 34439235 PMC8392491 Knerr JM, Kledal TN, Rosenkilde MM. Molecular properties and therapeutic targeting of the EBV-encoded receptor BILF1. Cancers. 2021;13(16):4079. 34439235 10.3390/cancers13164079 PMC8392491 97. Todorović N Ambrosio MR Amedei A Immune modulation by Epstein–Barr virus lytic cycle: relevance and implication in oncogenesis Pathogens 2024 13 10 876 10.3390/pathogens13100876 39452747 PMC11510492 Todorović N, Ambrosio MR, Amedei A. Immune modulation by Epstein–Barr virus lytic cycle: relevance and implication in oncogenesis. Pathogens. 2024;13(10):876. 39452747 10.3390/pathogens13100876 PMC11510492 98. Luo Y Liu Y Wang C Gan R Signaling pathways of EBV-induced oncogenesis Cancer Cell Int 2021 21 1 93 10.1186/s12935-021-01793-3 33549103 PMC7868022 Luo Y, Liu Y, Wang C, Gan R. Signaling pathways of EBV-induced oncogenesis. Cancer Cell Int. 2021;21(1):93. 33549103 10.1186/s12935-021-01793-3 PMC7868022 99. Markazi A Meng W Bracci PM McGrath MS Gao S-J The role of bacteria in KSHV infection and KSHV-induced cancers Cancers 2021 13 17 4269 10.3390/cancers13174269 34503079 PMC8428360 Markazi A, Meng W, Bracci PM, McGrath MS, Gao S-J. The role of bacteria in KSHV infection and KSHV-induced cancers. Cancers. 2021;13(17):4269. 34503079 10.3390/cancers13174269 PMC8428360 100. Blumenthal MJ, Cornejo Castro EM, Whitby D, Katz AA, Schäfer G. Evidence for altered host genetic factors in KSHV infection and KSHV-related disease development. Rev Med Virol 2021;31(2):e2160. 10.1002/rmv.2160 PMC8047912 33043529 101. Charostad J Nakhaie M Dehghani A Faghihloo E The interplay between EBV and KSHV viral products and NF-κB pathway in oncogenesis Infect Agents Cancer 2020 15 1 12 10.1186/s13027-020-00317-4 PMC7559203 33072180 Charostad J, Nakhaie M, Dehghani A, Faghihloo E. The interplay between EBV and KSHV viral products and NF-κB pathway in oncogenesis. Infect Agents Cancer. 2020;15:1–12. 10.1186/s13027-020-00317-4 PMC7559203 33072180 102. Alomari N Totonchy J Cytokine-targeted therapeutics for KSHV-associated disease Viruses 2020 12 10 1097 10.3390/v12101097 32998419 PMC7600567 Alomari N, Totonchy J. Cytokine-targeted therapeutics for KSHV-associated disease. Viruses. 2020;12(10):1097. 32998419 10.3390/v12101097 PMC7600567 103. Komaki S Inagaki T Kumar A Izumiya Y The role of vIL-6 in KSHV-Mediated immune evasion and tumorigenesis Viruses 2024 16 12 1900 10.3390/v16121900 39772207 PMC11680145 Komaki S, Inagaki T, Kumar A, Izumiya Y. The role of vIL-6 in KSHV-Mediated immune evasion and tumorigenesis. Viruses. 2024;16(12):1900. 39772207 10.3390/v16121900 PMC11680145 104. Chen L Ding L Wang X Huang Y Gao S-J Activation of glucocorticoid receptor signaling inhibits KSHV-induced inflammation and tumorigenesis Mbio 2024 15 1 e03011 03023 10.1128/mbio.03011-23 38117084 PMC10790708 Chen L, Ding L, Wang X, Huang Y, Gao S-J. Activation of glucocorticoid receptor signaling inhibits KSHV-induced inflammation and tumorigenesis. Mbio. 2024;15(1):e03011–03023. 38117084 10.1128/mbio.03011-23 PMC10790708 105. Bagnéris C, Senthil Kumar SL, Baratchian M, Britt HM, Assafa TE, Thalassinos K, Collins MK, Barrett TE. Mechanistic insights into the activation of the IKK kinase complex by the Kaposi's sarcoma herpes virus oncoprotein vFLIP. J Biol Chem. 2022;298(6):102012. 10.1016/j.jbc.2022.102012 PMC9163697 35525271 106. Combs LR Combs J McKenna R Toth Z Protein degradation by gammaherpesvirus rtas: more than just viral transactivators Viruses 2023 15 3 730 10.3390/v15030730 36992439 PMC10055789 Combs LR, Combs J, McKenna R, Toth Z. Protein degradation by gammaherpesvirus rtas: more than just viral transactivators. Viruses. 2023;15(3):730. 36992439 10.3390/v15030730 PMC10055789 107. Li J, Zhang Y, Luo B. The programed death-1/programed death ligand‐1 axis and its potential as a therapeutic target for virus‐associated tumours. Rev Med Virol 2024;34(1):e2486. 10.1002/rmv.2486 37905387 108. Szymula A, Samayoa-Reyes G, Ogolla S, Liu B, Li S, George A, Van Sciver N, Rochford R, Simas JP, Kaye KM. Macrophages drive KSHV B cell latency. Cell Rep. 2023;42(7):112767. 10.1016/j.celrep.2023.112767 PMC10528218 37440412 109. Malfertheiner P Camargo MC El-Omar E Liou J-M Peek R Schulz C Smith SI Suerbaum S Helicobacter pylori infection Nat Reviews Disease Primers 2023 9 1 19 10.1038/s41572-023-00431-8 37081005 PMC11558793 Malfertheiner P, Camargo MC, El-Omar E, Liou J-M, Peek R, Schulz C, Smith SI, Suerbaum S. Helicobacter pylori infection. Nat Reviews Disease Primers. 2023;9(1):19. 37081005 10.1038/s41572-023-00431-8 PMC11558793 110. Zavros Y Merchant JL The immune microenvironment in gastric adenocarcinoma Nat Reviews Gastroenterol Hepatol 2022 19 7 451 67 10.1038/s41575-022-00591-0 PMC9809534 35288702 Zavros Y, Merchant JL. The immune microenvironment in gastric adenocarcinoma. Nat Reviews Gastroenterol Hepatol. 2022;19(7):451–67. 10.1038/s41575-022-00591-0 PMC9809534 35288702 111. Baral B Kandpal M Ray A Jana A Yadav DS Sachin K Mishra A Baig MS Jha HC Helicobacter pylori and Epstein-Barr virus infection in cell Polarity alterations Folia Microbiol 2024 69 1 41 57 10.1007/s12223-023-01091-7 37672163 Baral B, Kandpal M, Ray A, Jana A, Yadav DS, Sachin K, Mishra A, Baig MS, Jha HC. Helicobacter pylori and Epstein-Barr virus infection in cell Polarity alterations. Folia Microbiol. 2024;69(1):41–57. 37672163 10.1007/s12223-023-01091-7 112. Marzhoseyni Z Mousavi MJ Ghotloo S Helicobacter pylori antigens as immunomodulators of immune system Helicobacter 2024 29 1 e13058 10.1111/hel.13058 38380545 Marzhoseyni Z, Mousavi MJ, Ghotloo S. Helicobacter pylori antigens as immunomodulators of immune system. Helicobacter. 2024;29(1):e13058. 38380545 10.1111/hel.13058 113. XU X, Yan H, XU Z, Zhou S, Lyu W. To investigate the effect of Helicobacter pylori infection on Hedgehog and NOX/NF-κB/STAT1 signaling pathway in chronic atrophic gastritis from the perspective of Dampness-Heat induced blood stasis. World Sci Technol-Modernization Tradit Chin Med 2024;137–44. 114. Shi Y, Zheng H, Wang M, Ding S. Influence of Helicobacter pylori infection on PD-1/PD‐L1 Blockade therapy needs more attention. Helicobacter 2022;27(2):e12878. 10.1111/hel.12878 35112435 115. Jia K, Chen Y, Xie Y, Wang X, Hu Y, Sun Y, Cao Y, Zhang L, Wang Y, Wang Z. Helicobacter pylori and immunotherapy for Gastrointestinal cancer. Innovation. 2024;5(2):100561. 10.1016/j.xinn.2023.100561 PMC10878118 38379784 116. Xiang X, Wu Y, Li H, Li C, Yan L, Li Q. Plasmacytoid dendritic cell-derived type I interferon is involved in Helicobacter pylori infection-induced differentiation of Schlafen 4-expressing myeloid-derived suppressor cells. Infect Immun. 2021;89(11):e0040721. 10.1128/IAI.00407-21 PMC8519294 34370509 117. Li J Li X Zhang Z Wang S Huang X Min L Li P Helicobacter pylori promotes gastric fibroblast proliferation and migration by expulsing Exosomal miR-124-3p Microbes Infect 2024 26 1–2 105236 10.1016/j.micinf.2023.105236 37813158 Li J, Li X, Zhang Z, Wang S, Huang X, Min L, Li P. Helicobacter pylori promotes gastric fibroblast proliferation and migration by expulsing Exosomal miR-124-3p. Microbes Infect. 2024;26(1–2):105236. 37813158 10.1016/j.micinf.2023.105236 118. Baj J Korona-Głowniak I Forma A Maani A Sitarz E Rahnama-Hezavah M Radzikowska E Portincasa P Mechanisms of the epithelial–mesenchymal transition and tumor microenvironment in Helicobacter pylori-induced gastric cancer Cells 2020 9 4 1055 10.3390/cells9041055 32340207 PMC7225971 Baj J, Korona-Głowniak I, Forma A, Maani A, Sitarz E, Rahnama-Hezavah M, Radzikowska E, Portincasa P. Mechanisms of the epithelial–mesenchymal transition and tumor microenvironment in Helicobacter pylori-induced gastric cancer. Cells. 2020;9(4):1055. 32340207 10.3390/cells9041055 PMC7225971 119. Ou S Wang H Tao Y Luo K Ye J Ran S Guan Z Wang Y Hu H Huang R Fusobacterium nucleatum and colorectal cancer: from phenomenon to mechanism Front Cell Infect Microbiol 2022 12 1020583 10.3389/fcimb.2022.1020583 36523635 PMC9745098 Ou S, Wang H, Tao Y, Luo K, Ye J, Ran S, Guan Z, Wang Y, Hu H, Huang R. Fusobacterium nucleatum and colorectal cancer: from phenomenon to mechanism. Front Cell Infect Microbiol. 2022;12:1020583. 36523635 10.3389/fcimb.2022.1020583 PMC9745098 120. Yamamoto S Kinugasa H Hirai M Terasawa H Yasutomi E Oka S Ohmori M Yamasaki Y Inokuchi T Harada K Heterogeneous distribution of Fusobacterium nucleatum in the progression of colorectal cancer J Gastroenterol Hepatol 2021 36 7 1869 76 10.1111/jgh.15361 33242360 Yamamoto S, Kinugasa H, Hirai M, Terasawa H, Yasutomi E, Oka S, Ohmori M, Yamasaki Y, Inokuchi T, Harada K. Heterogeneous distribution of Fusobacterium nucleatum in the progression of colorectal cancer. J Gastroenterol Hepatol. 2021;36(7):1869–76. 33242360 10.1111/jgh.15361 121. Jiang Y Huang Y Hu Y Yang Y You F Hu Q Li X Zhao Z Banxia Xiexin Decoction delays colitis-to-cancer transition by inhibiting E-cadherin/β-catenin pathway via Fusobacterium nucleatum FadA J Ethnopharmacol 2024 328 117932 10.1016/j.jep.2024.117932 38382652 Jiang Y, Huang Y, Hu Y, Yang Y, You F, Hu Q, Li X, Zhao Z. Banxia Xiexin Decoction delays colitis-to-cancer transition by inhibiting E-cadherin/β-catenin pathway via Fusobacterium nucleatum FadA. J Ethnopharmacol. 2024;328:117932. 38382652 10.1016/j.jep.2024.117932 122. Pignatelli P Nuccio F Piattelli A Curia MC The role of Fusobacterium nucleatum in oral and colorectal carcinogenesis Microorganisms 2023 11 9 2358 10.3390/microorganisms11092358 37764202 PMC10537357 Pignatelli P, Nuccio F, Piattelli A, Curia MC. The role of Fusobacterium nucleatum in oral and colorectal carcinogenesis. Microorganisms. 2023;11(9):2358. 37764202 10.3390/microorganisms11092358 PMC10537357 123. Hu L Liu Y Kong X Wu R Peng Q Zhang Y Zhou L Duan L Fusobacterium nucleatum facilitates M2 macrophage polarization and colorectal carcinoma progression by activating TLR4/NF-κ B/S100A9 cascade Front Immunol 2021 12 658681 10.3389/fimmu.2021.658681 34093546 PMC8176789 Hu L, Liu Y, Kong X, Wu R, Peng Q, Zhang Y, Zhou L, Duan L. Fusobacterium nucleatum facilitates M2 macrophage polarization and colorectal carcinoma progression by activating TLR4/NF-κ B/S100A9 cascade. Front Immunol. 2021;12:658681. 34093546 10.3389/fimmu.2021.658681 PMC8176789 124. Xu C Fan L Lin Y Shen W Qi Y Zhang Y Chen Z Wang L Long Y Hou T Fusobacterium nucleatum promotes colorectal cancer metastasis through miR-1322/CCL20 axis and M2 polarization Gut Microbes 2021 13 1 1980347 10.1080/19490976.2021.1980347 34632963 PMC8510564 Xu C, Fan L, Lin Y, Shen W, Qi Y, Zhang Y, Chen Z, Wang L, Long Y, Hou T. Fusobacterium nucleatum promotes colorectal cancer metastasis through miR-1322/CCL20 axis and M2 polarization. Gut Microbes. 2021;13(1):1980347. 34632963 10.1080/19490976.2021.1980347 PMC8510564 125. Mima K Nishihara R Qian ZR Cao Y Sukawa Y Nowak JA Yang J Dou R Masugi Y Song M Fusobacterium nucleatum in colorectal carcinoma tissue and patient prognosis Gut 2016 65 12 1973 80 10.1136/gutjnl-2015-310101 26311717 PMC4769120 Mima K, Nishihara R, Qian ZR, Cao Y, Sukawa Y, Nowak JA, Yang J, Dou R, Masugi Y, Song M. Fusobacterium nucleatum in colorectal carcinoma tissue and patient prognosis. Gut. 2016;65(12):1973–80. 26311717 10.1136/gutjnl-2015-310101 PMC4769120 126. Kim K Lee M Shin Y Lee Y Kim T-J Optimizing cancer treatment through gut Microbiome modulation Cancers 2025 17 7 1252 10.3390/cancers17071252 40227841 PMC11988035 Kim K, Lee M, Shin Y, Lee Y, Kim T-J. Optimizing cancer treatment through gut Microbiome modulation. Cancers. 2025;17(7):1252. 40227841 10.3390/cancers17071252 PMC11988035 127. Liu L Shah K The potential of the gut Microbiome to reshape the cancer therapy paradigm: a review JAMA Oncol 2022 8 7 1059 67 10.1001/jamaoncol.2022.0494 35482355 Liu L, Shah K. The potential of the gut Microbiome to reshape the cancer therapy paradigm: a review. JAMA Oncol. 2022;8(7):1059–67. 35482355 10.1001/jamaoncol.2022.0494 128. Chen W Zhu Y Zhang Z Sun X Advances in Salmonella Typhimurium-based drug delivery system for cancer therapy Adv Drug Deliv Rev 2022 185 114295 10.1016/j.addr.2022.114295 35429576 Chen W, Zhu Y, Zhang Z, Sun X. Advances in Salmonella Typhimurium-based drug delivery system for cancer therapy. Adv Drug Deliv Rev. 2022;185:114295. 35429576 10.1016/j.addr.2022.114295 129. Zheng JH Min J-J Targeted cancer therapy using engineered Salmonella typhimurium Chonnam Med J 2016 52 3 173 84 10.4068/cmj.2016.52.3.173 27689027 PMC5040766 Zheng JH, Min J-J. Targeted cancer therapy using engineered Salmonella typhimurium. Chonnam Med J. 2016;52(3):173–84. 27689027 10.4068/cmj.2016.52.3.173 PMC5040766 130. Guo Y Chen Y Liu X Min J-J Tan W Zheng JH Targeted cancer immunotherapy with genetically engineered oncolytic Salmonella typhimurium Cancer Lett 2020 469 102 10 10.1016/j.canlet.2019.10.033 31666180 Guo Y, Chen Y, Liu X, Min J-J, Tan W, Zheng JH. Targeted cancer immunotherapy with genetically engineered oncolytic Salmonella typhimurium. Cancer Lett. 2020;469:102–10. 31666180 10.1016/j.canlet.2019.10.033 131. Chen H-Y Hsieh W-C Liu Y-C Li H-Y Liu P-Y Hsu Y-T Hsu S-C Luo A-C Kuo W-C Huang Y-J Mitochondrial injury induced by a Salmonella genotoxin triggers the Proinflammatory senescence-associated secretory phenotype Nat Commun 2024 15 1 2778 10.1038/s41467-024-47190-y 38555361 PMC10981749 Chen H-Y, Hsieh W-C, Liu Y-C, Li H-Y, Liu P-Y, Hsu Y-T, Hsu S-C, Luo A-C, Kuo W-C, Huang Y-J. Mitochondrial injury induced by a Salmonella genotoxin triggers the Proinflammatory senescence-associated secretory phenotype. Nat Commun. 2024;15(1):2778. 38555361 10.1038/s41467-024-47190-y PMC10981749 132. He X Guo J Bai Y Sun H Yang J Salmonella-based therapeutic strategies: improving tumor microenvironment and bringing new hope for cancer immunotherapy Med Oncol 2025 42 1 1 16 10.1007/s12032-024-02578-0 39666238 He X, Guo J, Bai Y, Sun H, Yang J. Salmonella-based therapeutic strategies: improving tumor microenvironment and bringing new hope for cancer immunotherapy. Med Oncol. 2025;42(1):1–16. 10.1007/s12032-024-02578-0 39666238 133. Aganja RP Sivasankar C Senevirathne A Lee JH Salmonella as a promising curative tool against cancer Pharmaceutics 2022 14 10 2100 10.3390/pharmaceutics14102100 36297535 PMC9609134 Aganja RP, Sivasankar C, Senevirathne A, Lee JH. Salmonella as a promising curative tool against cancer. Pharmaceutics. 2022;14(10):2100. 36297535 10.3390/pharmaceutics14102100 PMC9609134 134. Santos LL Santos J Gouveia MJ Bernardo C Lopes C Rinaldi G Brindley PJ Costa JM C. D. Urogenital schistosomiasis—history, pathogenesis, and bladder cancer J Clin Med 2021 10 2 205 10.3390/jcm10020205 33429985 PMC7826813 Santos LL, Santos J, Gouveia MJ, Bernardo C, Lopes C, Rinaldi G, Brindley PJ, Costa JM. C. D. Urogenital schistosomiasis—history, pathogenesis, and bladder cancer. J Clin Med. 2021;10(2):205. 33429985 10.3390/jcm10020205 PMC7826813 135. Mbanefo EC Agbo CT Zhao Y Lamanna OK Thai KH Karinshak SE Khan MA Fu C-L Odegaard JI Saltikova IV IPSE, an abundant egg-secreted protein of the carcinogenic helminth schistosoma haematobium, promotes proliferation of bladder cancer cells and angiogenesis Infect Agents Cancer 2020 15 1 10 10.1186/s13027-020-00331-6 PMC7578584 33101456 Mbanefo EC, Agbo CT, Zhao Y, Lamanna OK, Thai KH, Karinshak SE, Khan MA, Fu C-L, Odegaard JI, Saltikova IV. IPSE, an abundant egg-secreted protein of the carcinogenic helminth schistosoma haematobium, promotes proliferation of bladder cancer cells and angiogenesis. Infect Agents Cancer. 2020;15:1–10. 10.1186/s13027-020-00331-6 PMC7578584 33101456 136. Vazquez-Espinoza I. Schistosoma haematobium: A pathophysiological review from chronic infection to bladder cancer. Pathogens Assoc Dev Cancer Humans OMICs Immunol Pathophysiol Stud. 2024;269–82. 137. Mbanefo EC, Fu C-L, Ho CP, Le L, Ishida K, Hammam O, Hsieh MH. Interleukin-4 signaling plays a major role in urogenital schistosomiasis-associated bladder pathogenesis. Infect Immun. 2020;88(3):10.1128/iai.00669 – 00619. 10.1128/IAI.00669-19 PMC7035943 31843965 138. Mertelsmann AM, Bowers SF, Wright D, Maganga JK, Mazigo HD, Ndhlovu LC, Changalucha JM, Downs JA. Effects of schistosoma haematobium infection and treatment on the systemic and mucosal immune phenotype, gene expression and microbiome: A systematic review. PLoS Negl Trop Dis 2024;18(9):e0012456. 10.1371/journal.pntd.0012456 PMC11412685 39250522 139. Masamba P Kappo AP Immunological and biochemical interplay between cytokines, oxidative stress and schistosomiasis Int J Mol Sci 2021 22 13 7216 10.3390/ijms22137216 34281269 PMC8268096 Masamba P, Kappo AP. Immunological and biochemical interplay between cytokines, oxidative stress and schistosomiasis. Int J Mol Sci. 2021;22(13):7216. 34281269 10.3390/ijms22137216 PMC8268096 140. Mohammed SA, Hetta HF, Zahran AM, Tolba ME, Attia RA, Behnsawy HM, Algammal AM, Batiha GE-S, Mohammed AQ, Ahmad AA. T cell subsets, regulatory T, regulatory B cells and Proinflammatory cytokine profile in schistosoma haematobium associated bladder cancer: first report from upper Egypt. PLoS Negl Trop Dis 2023;17(4):e0011258. 10.1371/journal.pntd.0011258 PMC10109487 37068081 141. Rather SA, Wani ZA, Mustafa RA, Bharti P, Kousar R, Ashraf MV, Ahmad S, Shah A, Khan MH. Carcinogenic parasites: insights into the epidemiology and possible mechanisms of cancer. Mutagenesis. 2025;geaf007. 10.1093/mutage/geaf007 40067333 142. Afrifa J, Ofori EG, Opoku YK, Asare KK, Sorkpor RD, Naveh-Fio IW, Armah R, Ofori S, Ephraim RK. Oxidative Stress and Cancer Risk in Schistosomiasis. Oxidative Medicine and Cellular Longevity 2024;2024(1):9701021. 10.1155/omcl/9701021 PMC11668550 39720557 143. Liau MYQ Toh EQ Shelat VG Opisthorchis viverrini—current Understanding of the neglected hepatobiliary parasite Pathogens 2023 12 6 795 10.3390/pathogens12060795 37375485 PMC10301378 Liau MYQ, Toh EQ, Shelat VG. Opisthorchis viverrini—current Understanding of the neglected hepatobiliary parasite. Pathogens. 2023;12(6):795. 37375485 10.3390/pathogens12060795 PMC10301378 144. Chaiyadet S, Tangkawattana S, Smout MJ, Ittiprasert W, Mann VH, Deenonpoe R, Arunsan P, Loukas A, Brindley PJ, Laha T. Knockout of liver fluke granulin, Ov-grn-1, impedes malignant transformation during chronic infection with opisthorchis Viverrini. PLoS Pathog 2022;18(9):e1010839. 10.1371/journal.ppat.1010839 PMC9531791 36137145 145. Vale N Gouveia MJ Gärtner F Brindley PJ Oxysterols of helminth parasites and pathogenesis of foodborne hepatic trematodiasis caused by opisthorchis and fasciola species Parasitol Res 2020 119 1443 53 10.1007/s00436-020-06640-4 32206886 Vale N, Gouveia MJ, Gärtner F, Brindley PJ. Oxysterols of helminth parasites and pathogenesis of foodborne hepatic trematodiasis caused by opisthorchis and fasciola species. Parasitol Res. 2020;119:1443–53. 32206886 10.1007/s00436-020-06640-4 146. Kafle A, Suttiprapa S, Muhammad M, Tenorio JCB, Mahato RK, Sahimin N, Loong SK. Epigenetic biomarkers and the Wnt/β-Catenin pathway in opisthorchis viverrini-associated cholangiocarcinoma: A scoping review on therapeutic opportunities. PLoS Negl Trop Dis 2024;18(9):e0012477. 10.1371/journal.pntd.0012477 PMC11407677 39236081 147. Jittimanee S Wongratanacheewin S Kaewraemruaen C Jittimanee J Opisthorchis Viverrini antigens up-regulates the expression of CD80 and MHC class II in JAWSII mouse dendritic cells and promotes IL-10 and TGF-β secretions Parasitol Int 2021 84 102401 10.1016/j.parint.2021.102401 34082134 Jittimanee S, Wongratanacheewin S, Kaewraemruaen C, Jittimanee J. Opisthorchis Viverrini antigens up-regulates the expression of CD80 and MHC class II in JAWSII mouse dendritic cells and promotes IL-10 and TGF-β secretions. Parasitol Int. 2021;84:102401. 34082134 10.1016/j.parint.2021.102401 148. Loilome W Dokduang H Suksawat M Padthaisong S Therapeutic challenges at the preclinical level for targeted drug development for opisthorchis viverrini-associated cholangiocarcinoma Expert Opin Investig Drugs 2021 30 9 985 1006 10.1080/13543784.2021.1955102 34292795 Loilome W, Dokduang H, Suksawat M, Padthaisong S. Therapeutic challenges at the preclinical level for targeted drug development for opisthorchis viverrini-associated cholangiocarcinoma. Expert Opin Investig Drugs. 2021;30(9):985–1006. 34292795 10.1080/13543784.2021.1955102 149. Kim H-D, Kim S-Y, Lee H, Lee Y, Hyung J, Moon M, Shin J, Park YS, Ryu M-H. Predictive value of EBV-positivity in patients with gastric cancer treated with first-line nivolumab plus chemotherapy. Gastric Cancer. 2025;28(4):1–10. 10.1007/s10120-025-01618-6 40295365 150. Chen Y-H Tsai C-H Chen Y-Y Wang C-C Wang J-H Hung C-H Kuo Y-H Real-world comparison of pembrolizumab and nivolumab in advanced hepatocellular carcinoma BMC Cancer 2023 23 1 810 10.1186/s12885-023-11298-z 37644388 PMC10463359 Chen Y-H, Tsai C-H, Chen Y-Y, Wang C-C, Wang J-H, Hung C-H, Kuo Y-H. Real-world comparison of pembrolizumab and nivolumab in advanced hepatocellular carcinoma. BMC Cancer. 2023;23(1):810. 37644388 10.1186/s12885-023-11298-z PMC10463359 151. Pu D, Yin L, Zhou Y, Li W, Huang L, Cai L, Zhou Q. Safety and efficacy of immune checkpoint inhibitors in patients with HBV/HCV infection and advanced-stage cancer: a systematic review. Medicine. 2020;99(5):e19013. 10.1097/MD.0000000000019013 PMC7004734 32000444 152. Lurain K Ramaswami R Yarchoan R Uldrick TS Anti-PD-1 and anti-PD-L1 monoclonal antibodies in people living with HIV and cancer Curr HIV/AIDS Rep 2020 17 547 56 10.1007/s11904-020-00525-y 32827111 PMC7799392 Lurain K, Ramaswami R, Yarchoan R, Uldrick TS. Anti-PD-1 and anti-PD-L1 monoclonal antibodies in people living with HIV and cancer. Curr HIV/AIDS Rep. 2020;17:547–56. 32827111 10.1007/s11904-020-00525-y PMC7799392 153. Salnikov M Prusinkiewicz MA Lin S Ghasemi F Cecchini MJ Mymryk JS Tumor-infiltrating T cells in EBV-associated gastric carcinomas exhibit high levels of multiple markers of activation, effector gene expression, and exhaustion Viruses 2023 15 1 176 10.3390/v15010176 36680216 PMC9860965 Salnikov M, Prusinkiewicz MA, Lin S, Ghasemi F, Cecchini MJ, Mymryk JS. Tumor-infiltrating T cells in EBV-associated gastric carcinomas exhibit high levels of multiple markers of activation, effector gene expression, and exhaustion. Viruses. 2023;15(1):176. 36680216 10.3390/v15010176 PMC9860965 154. Zhang Q Xu M EBV-induced T-cell responses in EBV-specific and nonspecific cancers Front Immunol 2023 14 1250946 10.3389/fimmu.2023.1250946 37841280 PMC10576448 Zhang Q, Xu M. EBV-induced T-cell responses in EBV-specific and nonspecific cancers. Front Immunol. 2023;14:1250946. 37841280 10.3389/fimmu.2023.1250946 PMC10576448 155. Zhang S Zhou X Zhang S Wang N Zhang T Zhang D Ao Q Cao Y Huang L EBV-associated lymphoproliferative disease post-CAR-T cell therapy Front Med 2024 18 2 394 8 10.1007/s11684-023-1032-8 38329597 Zhang S, Zhou X, Zhang S, Wang N, Zhang T, Zhang D, Ao Q, Cao Y, Huang L. EBV-associated lymphoproliferative disease post-CAR-T cell therapy. Front Med. 2024;18(2):394–8. 38329597 10.1007/s11684-023-1032-8 156. Letafati A Soheili R Norouzi M Soleimani P Mozhgani S-H Therapeutic approaches for HTLV-1-associated adult T-cell leukemia/lymphoma: a comprehensive review Med Oncol 2023 40 10 295 10.1007/s12032-023-02166-8 37689806 Letafati A, Soheili R, Norouzi M, Soleimani P, Mozhgani S-H. Therapeutic approaches for HTLV-1-associated adult T-cell leukemia/lymphoma: a comprehensive review. Med Oncol. 2023;40(10):295. 37689806 10.1007/s12032-023-02166-8 157. Guglielmo A Borghi A Zengarini C Piraccini BM Corazza M Pileri A OX40–OX40L axis in cutaneous T-Cell lymphomas: pathogenic, prognostic, and potential therapeutic perspectives Biomolecules 2025 15 5 715 10.3390/biom15050715 40427608 PMC12109069 Guglielmo A, Borghi A, Zengarini C, Piraccini BM, Corazza M, Pileri A. OX40–OX40L axis in cutaneous T-Cell lymphomas: pathogenic, prognostic, and potential therapeutic perspectives. Biomolecules. 2025;15(5):715. 40427608 10.3390/biom15050715 PMC12109069 158. Pangilinan CR Lee C-H Highlights of Immunomodulation in Salmonella-based cancer therapy Biomedicines 2021 9 11 1566 10.3390/biomedicines9111566 34829795 PMC8615479 Pangilinan CR, Lee C-H. Highlights of Immunomodulation in Salmonella-based cancer therapy. Biomedicines. 2021;9(11):1566. 34829795 10.3390/biomedicines9111566 PMC8615479 159. Pérez AM. Bacteria-instructed lymphocytes as a new generation of Immuno therapies against cancer. Universidad Autónoma de Madrid; 2025. 160. Cho YS, Han K, Xu J, Moon JJ. Novel strategies for modulating the gut Microbiome for cancer therapy. Adv Drug Deliv Rev. 2024;115332. 10.1016/j.addr.2024.115332 PMC11268941 38759702 161. Ciernikova S Sevcikova A Mego M Targeting the gut and tumor Microbiome in cancer treatment resistance Am J Physiology-Cell Physiol 2024 327 6 C1433 50 10.1152/ajpcell.00201.2024 39437444 Ciernikova S, Sevcikova A, Mego M. Targeting the gut and tumor Microbiome in cancer treatment resistance. Am J Physiology-Cell Physiol. 2024;327(6):C1433–50. 10.1152/ajpcell.00201.2024 39437444 162. Khan M Shah S Shah W Khan I Ali H Ali I Ullah R Wang X Mehmood A Wang Y Gut Microbiome as a treatment in colorectal cancer Int Rev Immunol 2024 43 4 229 47 10.1080/08830185.2024.2312294 38343353 Khan M, Shah S, Shah W, Khan I, Ali H, Ali I, Ullah R, Wang X, Mehmood A, Wang Y. Gut Microbiome as a treatment in colorectal cancer. Int Rev Immunol. 2024;43(4):229–47. 38343353 10.1080/08830185.2024.2312294 163. Wang S Liang B Wang W Li L Feng N Zhao Y Wang T Yan F Yang S Xia X Viral vectored vaccines: design, development, preventive and therapeutic applications in human diseases Signal Transduct Target Therapy 2023 8 1 149 10.1038/s41392-023-01408-5 PMC10081433 37029123 Wang S, Liang B, Wang W, Li L, Feng N, Zhao Y, Wang T, Yan F, Yang S, Xia X. Viral vectored vaccines: design, development, preventive and therapeutic applications in human diseases. Signal Transduct Target Therapy. 2023;8(1):149. 10.1038/s41392-023-01408-5 PMC10081433 37029123 164. Xi H. A Frontier in EBV Vaccine Research: mRNA-Based Immunization with gp350, gp42, and gL Glycoproteins. Scholarly Rev J. 2024;(9):104–13. 165. Escalante GM Mutsvunguma LZ Muniraju M Rodriguez E Ogembo JG Four decades of prophylactic EBV vaccine research: a systematic review and historical perspective Front Immunol 2022 13 867918 10.3389/fimmu.2022.867918 35493498 PMC9047024 Escalante GM, Mutsvunguma LZ, Muniraju M, Rodriguez E, Ogembo JG. Four decades of prophylactic EBV vaccine research: a systematic review and historical perspective. Front Immunol. 2022;13:867918. 35493498 10.3389/fimmu.2022.867918 PMC9047024 166. Tabachnick-Cherny S Pulliam T Church C Koelle DM Nghiem P Polyomavirus‐driven Merkel cell carcinoma: prospects for therapeutic vaccine development Mol Carcinog 2020 59 7 807 21 10.1002/mc.23190 32219902 PMC8238237 Tabachnick-Cherny S, Pulliam T, Church C, Koelle DM, Nghiem P. Polyomavirus‐driven Merkel cell carcinoma: prospects for therapeutic vaccine development. Mol Carcinog. 2020;59(7):807–21. 32219902 10.1002/mc.23190 PMC8238237 167. Jhunjhunwala S Hammer C Delamarre L Antigen presentation in cancer: insights into tumour immunogenicity and immune evasion Nat Rev Cancer 2021 21 5 298 312 10.1038/s41568-021-00339-z 33750922 Jhunjhunwala S, Hammer C, Delamarre L. Antigen presentation in cancer: insights into tumour immunogenicity and immune evasion. Nat Rev Cancer. 2021;21(5):298–312. 33750922 10.1038/s41568-021-00339-z 168. Hwang JK Hong J Yun C-O Oncolytic viruses and immune checkpoint inhibitors: preclinical developments to clinical trials Int J Mol Sci 2020 21 22 8627 10.3390/ijms21228627 33207653 PMC7697902 Hwang JK, Hong J, Yun C-O. Oncolytic viruses and immune checkpoint inhibitors: preclinical developments to clinical trials. Int J Mol Sci. 2020;21(22):8627. 33207653 10.3390/ijms21228627 PMC7697902 169. Mardi A Shirokova AV Mohammed RN Keshavarz A Zekiy AO Thangavelu L Mohamad TAM Marofi F Shomali N Zamani A Biological causes of Immunogenic cancer cell death (ICD) and anti-tumor therapy; combination of oncolytic virus-based immunotherapy and CAR T-cell therapy for ICD induction Cancer Cell Int 2022 22 1 168 10.1186/s12935-022-02585-z 35488303 PMC9052538 Mardi A, Shirokova AV, Mohammed RN, Keshavarz A, Zekiy AO, Thangavelu L, Mohamad TAM, Marofi F, Shomali N, Zamani A. Biological causes of Immunogenic cancer cell death (ICD) and anti-tumor therapy; combination of oncolytic virus-based immunotherapy and CAR T-cell therapy for ICD induction. Cancer Cell Int. 2022;22(1):168. 35488303 10.1186/s12935-022-02585-z PMC9052538 170. Zhang F, Li W, Zheng X, Ren Y, Li L, Yin H. The novel immune landscape of immune-checkpoint Blockade in EBV‐associated malignancies. FASEB J 2024;38(21):e70139. 10.1096/fj.202301980RR 39520274 171. Moran B Davern M Reynolds JV Donlon NE Lysaght J The impact of histone deacetylase inhibitors on immune cells and implications for cancer therapy Cancer Lett 2023 559 216121 10.1016/j.canlet.2023.216121 36893893 Moran B, Davern M, Reynolds JV, Donlon NE, Lysaght J. The impact of histone deacetylase inhibitors on immune cells and implications for cancer therapy. Cancer Lett. 2023;559:216121. 36893893 10.1016/j.canlet.2023.216121 172. Wu B Sodji QH Oyelere AK Inflammation, fibrosis and cancer: mechanisms, therapeutic options and challenges Cancers 2022 14 3 552 10.3390/cancers14030552 35158821 PMC8833582 Wu B, Sodji QH, Oyelere AK. Inflammation, fibrosis and cancer: mechanisms, therapeutic options and challenges. Cancers. 2022;14(3):552. 35158821 10.3390/cancers14030552 PMC8833582 173. Li Q Zhou Z-W Lu J Luo H Wang S-N Peng Y Deng M-S Song G-B Wang J-M Wei X PD-L1P146R is prognostic and a negative predictor of response to immunotherapy in gastric cancer Mol Ther 2022 30 2 621 31 10.1016/j.ymthe.2021.09.013 34547468 PMC8821936 Li Q, Zhou Z-W, Lu J, Luo H, Wang S-N, Peng Y, Deng M-S, Song G-B, Wang J-M, Wei X. PD-L1P146R is prognostic and a negative predictor of response to immunotherapy in gastric cancer. Mol Ther. 2022;30(2):621–31. 34547468 10.1016/j.ymthe.2021.09.013 PMC8821936 174. Li Q Luo H Luo Y-Y Zhang W Hong H-M Deng M-S Wang Y Xu B Song G-B Xu C-X Plumbagin-loaded ZIF-90 nanoparticles suppress gastric cancer progression by targeting the YAP1 signaling Chem Eng J 2022 437 135369 10.1016/j.cej.2022.135369 Li Q, Luo H, Luo Y-Y, Zhang W, Hong H-M, Deng M-S, Wang Y, Xu B, Song G-B, Xu C-X. Plumbagin-loaded ZIF-90 nanoparticles suppress gastric cancer progression by targeting the YAP1 signaling. Chem Eng J. 2022;437:135369. 175. Li Q Luo H Dai FQ Wang RT Fan XQ Luo YY Deng MS Wang Y Long T Guo W SAMD9 promotes postoperative recurrence of esophageal squamous cell carcinoma by stimulating MYH9-mediated GSK3β/β‐catenin signaling Adv Sci 2023 10 11 2203573 10.1002/advs.202203573 PMC10104667 36757050 Li Q, Luo H, Dai FQ, Wang RT, Fan XQ, Luo YY, Deng MS, Wang Y, Long T, Guo W. SAMD9 promotes postoperative recurrence of esophageal squamous cell carcinoma by stimulating MYH9-mediated GSK3β/β‐catenin signaling. Adv Sci. 2023;10(11):2203573. 10.1002/advs.202203573 PMC10104667 36757050 176. Song J Zhang J Shi Y Gao Q Chen H Ding X Zhao M Zhu C Liang L Sun X Hypoxia inhibits ferritinophagy-mediated ferroptosis in esophageal squamous cell carcinoma via the USP2-NCOA4 axis Oncogene 2024 43 26 2000 14 10.1038/s41388-024-03050-z 38744953 Song J, Zhang J, Shi Y, Gao Q, Chen H, Ding X, Zhao M, Zhu C, Liang L, Sun X. Hypoxia inhibits ferritinophagy-mediated ferroptosis in esophageal squamous cell carcinoma via the USP2-NCOA4 axis. Oncogene. 2024;43(26):2000–14. 38744953 10.1038/s41388-024-03050-z 177. Luo H Hu B Gu X-R Chen J Fan X-Q Zhang W Wang R-T He X-D Guo W Dai N The miR-23a/27a/24 – 2 cluster drives immune evasion and resistance to PD-1/PD-L1 Blockade in non-small cell lung cancer Mol Cancer 2024 23 1 285 10.1186/s12943-024-02201-w 39736629 PMC11686834 Luo H, Hu B, Gu X-R, Chen J, Fan X-Q, Zhang W, Wang R-T, He X-D, Guo W, Dai N. The miR-23a/27a/24 – 2 cluster drives immune evasion and resistance to PD-1/PD-L1 Blockade in non-small cell lung cancer. Mol Cancer. 2024;23(1):285. 39736629 10.1186/s12943-024-02201-w PMC11686834 ",
  "metadata": {
    "Title of this paper": "The miR-23a/27a/24 – 2 cluster drives immune evasion and resistance to PD-1/PD-L1 Blockade in non-small cell lung cancer",
    "Journal it was published in:": "Molecular Cancer",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12492935/"
  }
}