{
  "title": "Paper_1164",
  "abstract": "pmc Nat Commun Nat Commun 2873 ncomms Nature Communications 2041-1723 Nature Publishing Group PMC12474897 PMC12474897.1 12474897 12474897 41006278 10.1038/s41467-025-63497-w 63497 1 Article Episomal and integrated hepatitis B transcriptome mapping uncovers heterogeneity with the potential for drug-resistance http://orcid.org/0000-0003-1880-3496 Harris James M. 1 http://orcid.org/0000-0001-9719-4312 Lok James 2 http://orcid.org/0000-0002-5518-4367 Wand Nadina 1 http://orcid.org/0000-0002-7143-7168 Magri Andrea 1 Tsukuda Senko 3 http://orcid.org/0009-0006-2226-5757 Wu Yanxia 4 Ng Esther 5 Jennings Daisy 1 Elshenawy Badran 1 http://orcid.org/0000-0002-6246-0876 Balfe Peter 1 http://orcid.org/0000-0002-7229-5886 McKeating Jane A. jane.mckeating@ndm.ox.ac.uk 1 3 1 https://ror.org/052gg0110 grid.4991.5 0000 0004 1936 8948 Nuffield Department of Medicine, University of Oxford, 2 https://ror.org/0220mzb33 grid.13097.3c 0000 0001 2322 6764 Institute of Liver Studies, Kings College London, 3 https://ror.org/052gg0110 grid.4991.5 0000 0004 1936 8948 Chinese Academy of Medical Sciences Oxford Institute, University of Oxford, 4 https://ror.org/052gg0110 grid.4991.5 0000 0004 1936 8948 OMICS Technology Platforms, Centre for Human Genomics, Nuffield Department of Medicine, University of Oxford, 5 https://ror.org/052gg0110 grid.4991.5 0000 0004 1936 8948 Kennedy Institute of Rheumatology, University of Oxford, 26 9 2025 2025 16 478256 8515 20 3 2025 21 8 2025 26 09 2025 28 09 2025 28 09 2025 © The Author(s) 2025 2025 https://creativecommons.org/licenses/by/4.0/ Open Access http://creativecommons.org/licenses/by/4.0/ Hepatitis B virus (HBV) is a small DNA virus that establishes chronic infection and drives progressive liver disease and cancer; presenting a global health problem with more than 250 million infections. HBV replicates via an episomal covalently-closed-circular DNA (cccDNA) and integrated viral DNA fragments are linked to carcinogenesis. Current treatments only suppress HBV replication and there is a global initiative to develop genome targeting therapies, including siRNAs, antisense oligonucleotides and epigenetic modifiers specific for HBV cccDNA. However, our knowledge of the cccDNA and integrant transcriptomes is confounded by overlapping viral RNAs. Using targeted long-read sequencing we mapped the HBV transcriptome in liver biopsies from eleven treatment naïve patients. Probe enrichment yielded robust sequencing libraries and identified cccDNA-derived genomic and sub-genomic transcripts, and a repertoire of previously uncharacterised spliced, truncated and chimeric viral RNAs. Assigning viral transcripts to their respective DNA templates revealed differential promoter activity in cccDNA and integrants, with implications for the efficacy of epigenetic modifiers. Integrant-derived transcripts showed vast diversity in the viral-host junctions, posing a challenge for current nucleotide-targeting therapies. cccDNA was a source of genetic polymorphism, with distinct viral lineages present in the surface antigen encoding region, providing an insight into hepadnavirus evolution during chronic infection. Authors used targeted long-read sequencing to facilitate the discovery of rare and novel HBV RNAs in the infected liver. They identified differential promoter activity with potential implications for drug resistance and cancer. Subject terms Hepatitis B virus Hepatitis B Infection https://doi.org/10.13039/100004440 Wellcome Trust (Wellcome) 200838/Z/16/Z 225198/Z/22/Z McKeating Jane A. Chinese Academy of Medical Sciences (CAMS) Innovation Fund for Medical Science (CIFMS), China 2024-I2M-2-001-1. pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement yes pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes issue-copyright-statement © Springer Nature Limited 2025 Introduction Hepatitis B virus (HBV) is a small DNA virus and the prototypic member of the hepadnaviridae 1 2 4 5 HBV exclusively infects hepatocytes, with tropism defined by the expression of the viral entry receptor sodium taurocholate co-transporting polypeptide (NTCP) 6 7 8 9 10 11 12 13 14 15 16 The compact viral genome gives rise to overlapping RNAs, posing a significant challenge to mapping the HBV transcriptome. Whilst RT-qPCR, digital-droplet PCR, next generation sequencing and 5’RACE technologies have all been applied to HBV, the low abundance of viral reads in clinical samples compromises their utility 17 22 23 24 24 24 25 27 28 30 31 32 33 33 34 In this study, we explored the hepatic HBV transcriptome using targeted long-read sequencing in a cohort of treatment naïve patients. Using RNA isolated from liver biopsies, we sequenced genomic and subgenomic RNAs and profiled the activity of the viral promoters in both viral templates. We characterised the heterogeneity of integrant derived transcripts, noting diversity in the viral-host junctions generated during integration, with truncated iDNA presenting a challenge for current nucleotide-targeting therapies. Importantly, we identified cccDNA as a source of genetic polymorphism, observing distinct viral lineages present in the HBs encoding region, providing an insight into hepadnavirus evolution during chronic infection. Results Defining the HBV transcriptome Liver biopsy samples from 46 CHB subjects in HBeAg positive or negative phases of disease with variable liver fibrosis and inflammatory scores, summarised in Supplementary Fig. 1A , 17 1A 7 1B ) 24 NC_003977.2 2A 35 1B NC_003977.2 2C 24 36 1C , 2B–C , 1 2D Fig. 1 Ascribing HBV transcripts to the Core promoter. A p p U p B 2 C 24 D 24 E 2 1 n n 1 2 HBV cccDNA has four promoters and two enhancer regions that direct the synthesis of six major transcripts. The Core promoter regulates the transcription of pC and pg full-length RNAs; the Sp1 and Sp2 promoters drive the preS1, preS2 and S RNAs that encode HBs and the X promoter directs HBx expression (Fig. 1B 1D 19 1D , 2E 37 27 The genesis of full-length (3.5 kb) RNA from a circular 3.2 kb DNA template requires the host transcription machinery to read through the first PAS (PAS 1 2 1B 1 2 1E 38 1E 2 39 40 Having profiled the Core promoter, we sought to evaluate the contribution of the Sp1, Sp2 and X promoters to the viral transcriptome. In all clinical samples, Sp2 driven preS2 transcripts were the most abundant, with preS1, S and X RNAs readily detectable, however 37% of viral sequences did not initiate at previously reported TSS (Fig. 2A , 1 2B 2E 3A 2B ALB FGG HP ALB FGG HP 2C Fig. 2 Identification of HBV Transcript Start (TSS) and End (TES) coordinates. A B C ALB FGG HP D 1 2 3 Given the significant number of abortive Core-associated transcripts, we were interested to study the 3’ termini of Sp1, Sp2 and X promoter associated RNAs. In the experimental infections the majority of transcripts terminated at PAS 2 2D 2 2D , 3B 3C 3C 24 Ascribing HBV transcripts to cccDNA or iDNA HBeAg negative disease is associated with reduced cccDNA levels and lower inferred transcriptional activity 26 27 27 1B 2 25 27 41 42 2 3A 3A Fig. 3 Assigning cccDNA or iDNA transcripts and relative promoter activity. A 2 n B n 4 Assigning viral RNAs to their DNA templates allowed us to compare promoter activity in episomal and integrated genomes (Fig. 3B 26 27 3 3B 4A , 1 4B 42 In-depth characterisation of integrant derived RNAs To date, the HBV integrant associated transcriptome in vivo is understudied. HBV integration disrupts the Core promoter and precludes the transcription of genomic length RNAs but maintains the Sp1, Sp2 and X promoters. As integrants lack the HBV encoded PAS 2 4A 4A 2 ) 4A NC_000020.11 4A , 2 2 4A 4A AC104024.11 4A Fig. 4 Characterisation of HBV integrant derived transcripts. A B C 2 n 5 There was a 5-log range in the length of the chimeric 3’ tails (Fig. 4B 43 4B , 1B 27 1B–C Mapping the viral regions of the chimeric RNAs showed a predominance of HBs encoding sequences as detailed in Fig. 2 4B–C , 5A 5A 4C , 5A 2 4C , 5A 2 44 4C 5B 45 5B Genetic diversity of cccDNA and iDNA derived HBV transcripts HBV DNA shows up to 5% variation within patients, reflecting the error-prone reverse transcription step of the life cycle that results in genetic polymorphisms with the potential for drug resistance and vaccine escape 46 47 48 6A 5A , 6B 49 5B , 6B 50 Fig. 5 Genetic diversity of cccDNA and iDNA derived HBV transcripts. A 6 B C D 6 7 To explore the phylogenetic relationship between cccDNA and iDNA we assessed biopsy 1031, the only sample with comparable numbers of ccc-RNA and id-RNAs. Cladistic analysis (IQ-tree) classified these sequences into eleven (1-11) and four clades (A-D), respectively (Fig. 5C 5C 5D 7 5D Discussion Targeted long-read sequencing allowed us to profile the hepatic HBV transcriptome in eleven treatment naïve subjects with HBeAg negative chronic disease. Probe enrichment yielded robust sequencing libraries allowing us to resolve canonical and spliced viral RNAs. We found that all viral promoters gave rise to transcripts initiating outside published TSS boundaries, with Sp2 and X promoters yielding the majority of reads that would be under-estimated in short-read or RACE based approaches. Assigning the transcripts to their template of origin allowed us to profile the promoter activities of cccDNA and iDNA. Up to 98% of the viral RNAs were derived from iDNA with Sp2 promoter associated transcripts predominating, consistent with earlier reports 25 27 Our study shows the scarcity of full-length genomic RNAs, representing as little as 4% of the viral transcriptome and justifies the probe-enrichment technique 24 1 40 2 51 52 53 Long-read sequencing allowed us to study the 5’ and 3’ termini of each HBV transcript, mapping reads to well characterised TSS as well as studying PAS usage, or 3’ host flanking regions. HBV TSS were previously identified by precipitating m7G-capped viral transcripts, cloning into sequencing vectors, and amplicon sequencing by Sanger methods 18 19 54 55 Analysing the 3’ flanking regions of the viral reads showed that ~90% of id-RNAs were chimeric, where the 3’ termination site of the viral RNA served as the fusion breakpoint between viral and host genomes. The introduction of HBV promoters into the human genome could result in erroneous transcription of genes that would not ordinarily be expressed. A report from Gu et al suggested that EnhII activates the Sp1 and Sp2 promoters in iDNA, consistent with our findings that Sp1 and 2 derived transcripts dominate the viral transcriptome 56 57 58 14 59 60 Probe enrichment provides the opportunity to detect low copy, novel or rare RNAs from bulk and single cell library preparations. HBx is a regulatory protein that has been ascribed a broad range of functions, including viral replication, acting as a proto-oncogene and potent antagonist of the Smc5/6 restriction factor 61 14 62 Enrichment offers the opportunity to study rare or novel viral RNAs, or to map the viral transcriptome in samples with low viral RNA abundance 23 63 64 65 54 55 66 67 35 35 68 69 27 70 The 3’ TES of id-RNAs were variable; reflecting alternative integration events where some dslDNA terminated upstream of DR1. The archetypal DR1 linearisation site is not strictly observed in vivo, with many integrations resulting from under-length dslDNA fragments. These heterogenous viral 3’ ends pose a hurdle to nucleotide-targeting therapies such as ASOs and siRNAs. Screening the HBV transcriptome showed that >99% of ccc-RNAs encoded the Bepirovirsen motif, whereas 40% of id-RNAs lacked the target motif. Whilst our analysis focussed on Bepirovirsen, several siRNAs and ASOs target this region in the 3’ DR2-DR1 locus, implying a broad mechanism for viral resistance to these new drug candidates. In summary, targeted long-read sequencing allowed us to profile the activity of the viral promoters with unprecedented detail. Our analytical pipeline assigned reads to a broad range of TSS and identified previously unreported viral RNAs. Our data show ongoing Core promoter activity in the CHB liver, giving rise to canonical cccDNA derived transcripts together with truncated, abortive and overlength RNAs. By interrogating the 3’ termini of all transcripts we were able to determine their template of origin, identifying a common pattern of viral RNAs transcribed from integrants. Assessing the TES identified a new cryptic PAS and the diverse 3’ termini of integrated HBV fragments with alternative breakpoints in all clinical samples. This heterogeneity presents a significant challenge to the identification of conserved targets for novel nucleotide-based therapies. Assessing the phylogeny of integrant and episome derived RNAs showed a relationship between ccc- and iDNA clades, identifying genetically stable integrant lineages, with cccDNA transcription driving natural evolution. Methods All the research presented complies with the ethical regulations as stipulated by King’s College Hospital Liver Research Biobank, IRAS project 332608; REC reference 23/LO/0708 and Università del Piemonte Orientale, 28100 Novara REC reference CE90/19. All patients consented for surplus tissue to be used for research purposes. Cell culture and de novo infection HepG2-NTCP cells (gift from Stephan Urban, University of Heidelberg) were maintained on collagen-coated plasticware and cultured in Dulbecco’s Modified Eagles Medium (DMEM, Thermofisher) containing Glutamax, 10% foetal bovine serum, 50 U/ml penicillin/streptomycin, and non-essential amino acids. For infection, media was supplemented with 2.5% dimethyl sulphoxide for 72 h. Cells were inoculated with heparin-column purified HBV (GtD, ayw strain) 71 2 2 Quantitative PCR Up to 1 µg of RNA was reverse transcribed using a cDNA synthesis kit (PCR Biosystems), following the manufacturer’s protocol. Gene expression was quantified using qPCR (SyGreen Blue Mix, PCR Biosystems) with primers specific for the 3’ terminus of all HBV RNAs, referred to as Total HBV RNA, (F: CGGGGCGCACCTCTCTTTA; R:GTGAAGCGAAGTGCACACGG) or specific to the 5’ locus of pC/pgRNA (F:GGGGAACTAATGACTCTAGCTACC; R:TTTAGGCCCATATTAGTGTTGACA), as reported by us and others 17 18 26 72 17 Liver biopsies, RNA extraction and antigen staining We identified a cohort of 24 patients with CHB who had previously undergone a liver biopsy at King’s College Hospital, together with an additional 22 patients from a previous study 27 27 24 73 Targeted long-read sequencing RNA from 11 CHB biopsy samples from our previous study 27 23 24 24 74 Mapping HBV transcripts HiFi libraries were demultiplexed using the PacBio SMRTLink software to assign the sequences obtained according to their sample index. Polyadenylated sequences were aligned to a HBV ayw genotype D3 genome using minimap2 75 NC_003977.2 19 2 19 35 NC_003977.2 19 76 2 19 35 77 3’ Termini mapping To discern between integrant and cccDNA derived transcripts, the 3’ terminus of each HBV read was assessed for the presence of the canonical viral PAS. Reads were interrogated for the 50 bp region that ends in the viral PAS sequence (TATAAA), with a 90% match required. If present the read was labelled as ccc-RNA, or as id-RNA if not. Reads terminating at the cPAS at ~2600 could originate from either cccDNA or iDNA. To account for minor sample-sample variation, we allowed for a 100 bp tolerance, and identified any read terminating after position 2700 and lacking the 3’ PAS motif as id-RNA. HBV transcripts were assessed for the presence of motifs of interest, for example Bepirovirsen target-sequence (5’-TGCAGAGGTGAAGCGAAGTGC-3’ at 3261–3241) 45 2 Assessing polymorphism and phylogeny Genetic polymorphism was assessed from an alignment of the S2-S region of HBV (1685–2590) that is present in both ccc- and id- RNAs, using patient specific consensus sequences. For each nucleotide position we calculated similarity scores based on the consensus sequence. Trees were built and clades identified with IQ-tree 78 79 Statistics Statistical tests were carried out in Prism 10 with all tests listed in their respective figure legends. Reporting summary Further information on research design is available in the Nature Portfolio Reporting Summary Supplementary information  Supplementary Information Peer Review file Description of Additional Supplementary Files Supplementary Data 1 Supplementary Data 2 Reporting Summary Source data  Source Data Publisher’s note Supplementary information The online version contains supplementary material available at 10.1038/s41467-025-63497-w. Acknowledgements We would like to thank Geoff Dusheiko, Ivana Carey and Kosh Agarwal (Kings College Hospital) for provision of samples and their invaluable guidance on this study; Stephan Urban (University of Heidelberg) for supplying HepG2-NTCP cells, Jochen Wettengel and Ulrike Protzer (Technical University of Munich) for purified HBV stocks; Azim Ansari (University of Oxford) for biotinylated probes. Research in the McKeating laboratory is funded by the Wellcome Trust (Investigator Award 200838/Z/16/Z and Discovery Award 225198/Z/22/Z) and the Chinese Academy of Medical Sciences (CAMS) Innovation Fund for Medical Science (CIFMS), China 2024-I2M-2-001-1. James Lok is funded by an MRC clinical research training fellowship MR/Y001168/1. Esther Ng is supported by the Centre for Human Genetics, University of Oxford. Author contributions All authors have approved the submitted version of the manuscript and agree to be accountable for the integrity and accuracy of the study. They have contributed as follows: Investigation: J.M.H., J.L., A.M. and S.T.; Data Curation: J.M.H. and P.B.; Resources: J.L., N.W., A.M., S.T., Y.W., D.J.; Software: E.N., P.B., B.E.; Analysis: J.M.H., P.B.; Conceptualisation: J.A.M.; Supervision: J.A.M.; Writing M.S.: J.M.H., J.A.M., P.B.; Review & editing M.S.: All authors. Peer review Peer review information Nature Communications Data availability All data presented in the main and Supplementary Figs. are provided as a Source Data file. The sequencing data generated in this study have been deposited in the NCBI database under accession codes PRJNA1225648 PRJNA1227884 Source data Code availability All original code is deposited on Zenodo (10.5281/zenodo.16539674). Competing interests The authors declare no competing interests. References 1. World Health Organisation. Global hepatitis report 2024: action for access in low- and middle-income countries. (2024). 2. Revill PA The evolution and clinical impact of hepatitis B virus genome diversity Nat. Rev. Gastroenterol. Hepatol. 2020 17 618 634 10.1038/s41575-020-0296-6 32467580 Revill, P. A. et al. The evolution and clinical impact of hepatitis B virus genome diversity. Nat. Rev. Gastroenterol. Hepatol. 17 32467580 10.1038/s41575-020-0296-6 3. McNaughton AL Insights from deep sequencing of the HBV genome-unique, tiny, and misunderstood Gastroenterology 2019 156 384 399 10.1053/j.gastro.2018.07.058 30268787 PMC6347571 McNaughton, A. L. et al. Insights from deep sequencing of the HBV genome-unique, tiny, and misunderstood. Gastroenterology 156 30268787 10.1053/j.gastro.2018.07.058 PMC6347571 4. Zhang M Infection courses, virological features and IFN-alpha responses of HBV genotypes in cell culture and animal models J. Hepatol. 2021 75 1335 1345 10.1016/j.jhep.2021.07.030 34363922 PMC8604785 Zhang, M. et al. Infection courses, virological features and IFN-alpha responses of HBV genotypes in cell culture and animal models. J. Hepatol. 75 34363922 10.1016/j.jhep.2021.07.030 PMC8604785 5. European Association for the Study of the Liver. Electronic address, e.e.e. & European Association for the Study of the, L EASL Clinical Practice Guidelines on the management of hepatitis B virus infection J. Hepatol. 2025 83 502 583 10.1016/j.jhep.2025.03.018 40348683 European Association for the Study of the Liver. Electronic address, e.e.e. & European Association for the Study of the, L EASL Clinical Practice Guidelines on the management of hepatitis B virus infection. J. Hepatol. 83 40348683 10.1016/j.jhep.2025.03.018 6. Yan H Sodium taurocholate cotransporting polypeptide is a functional receptor for human hepatitis B and D virus Elife 2012 1 e00049 10.7554/eLife.00049 23150796 PMC3485615 Yan, H. et al. Sodium taurocholate cotransporting polypeptide is a functional receptor for human hepatitis B and D virus. Elife 1 23150796 10.7554/eLife.00049 PMC3485615 7. Ni Y Hepatitis B and D viruses exploit sodium taurocholate co-transporting polypeptide for species-specific entry into hepatocytes Gastroenterology 2014 146 1070 1083 10.1053/j.gastro.2013.12.024 24361467 Ni, Y. et al. Hepatitis B and D viruses exploit sodium taurocholate co-transporting polypeptide for species-specific entry into hepatocytes. Gastroenterology 146 24361467 10.1053/j.gastro.2013.12.024 8. Turton, K. L., Meier-Stephenson, V., Badmalia, M. D., Coffin, C. S. & Patel, T. R. Host transcription factors in hepatitis B virus RNA synthesis. Viruses 12 10.3390/v12020160 PMC7077322 32019103 9. Hong X Kim ES Guo H Epigenetic regulation of hepatitis B virus covalently closed circular DNA: implications for epigenetic therapy against chronic hepatitis B Hepatology 2017 66 2066 2077 10.1002/hep.29479 28833361 PMC5696023 Hong, X., Kim, E. S. & Guo, H. Epigenetic regulation of hepatitis B virus covalently closed circular DNA: implications for epigenetic therapy against chronic hepatitis B. Hepatology 66 28833361 10.1002/hep.29479 PMC5696023 10. Junker-Niepmann M Bartenschlager R Schaller H A short cis-acting sequence is required for hepatitis B virus pregenome encapsidation and sufficient for packaging of foreign RNA EMBO J. 1990 9 3389 3396 10.1002/j.1460-2075.1990.tb07540.x 2209549 PMC552077 Junker-Niepmann, M., Bartenschlager, R. & Schaller, H. A short cis-acting sequence is required for hepatitis B virus pregenome encapsidation and sufficient for packaging of foreign RNA. EMBO J. 9 2209549 10.1002/j.1460-2075.1990.tb07540.x PMC552077 11. Yu Y An RNA-based system to study hepatitis B virus replication and evaluate antivirals Sci. Adv. 2023 9 eadg6265 10.1126/sciadv.adg6265 37043562 PMC10096565 Yu, Y. et al. An RNA-based system to study hepatitis B virus replication and evaluate antivirals. Sci. Adv. 9 37043562 10.1126/sciadv.adg6265 PMC10096565 12. Seeger C Mason WS Hepatitis B virus biology Microbiol. Mol. Biol. Rev. 2000 64 51 68 10.1128/MMBR.64.1.51-68.2000 10704474 PMC98986 Seeger, C. & Mason, W. S. Hepatitis B virus biology. Microbiol. Mol. Biol. Rev. 64 10704474 10.1128/mmbr.64.1.51-68.2000 PMC98986 13. Tu, T., Zhang, H. & Urban, S. Hepatitis B virus DNA integration: in vitro models for investigating viral pathogenesis and persistence. Viruses 13 10.3390/v13020180 PMC7911709 33530322 14. Zoulim, F., Chen, P. J., Dandri, M., Kennedy, P. & Seeger, C. Hepatitis B virus DNA integration: implications for diagnostics, therapy, and outcome. J. Hepatol. 81 10.1016/j.jhep.2024.06.037 38971531 15. Tu T Budzinska MA Shackel NA Urban S HBV DNA Integration: molecular Mechanisms and Clinical Implications Viruses 2017 9 75 10.3390/v9040075 28394272 PMC5408681 Tu, T., Budzinska, M. A., Shackel, N. A. & Urban, S. HBV DNA Integration: molecular Mechanisms and Clinical Implications. Viruses 9 28394272 10.3390/v9040075 PMC5408681 16. Decorsiere A Hepatitis B virus X protein identifies the Smc5/6 complex as a host restriction factor Nature 2016 531 386 389 10.1038/nature17170 26983541 Decorsiere, A. et al. Hepatitis B virus X protein identifies the Smc5/6 complex as a host restriction factor. Nature 531 26983541 10.1038/nature17170 17. D’Arienzo V A PCR assay to quantify patterns of HBV transcription J. Gen. Virol. 2021 102 001373 10.1099/jgv.0.001373 31846416 PMC7610515 D’Arienzo, V. et al. A PCR assay to quantify patterns of HBV transcription. J. Gen. Virol. 102 31846416 10.1099/jgv.0.001373 PMC7610515 18. Stadelmayer B Full-length 5’RACE identifies all major HBV transcripts in HBV-infected hepatocytes and patient serum J. Hepatol. 2020 73 40 51 10.1016/j.jhep.2020.01.028 32087349 Stadelmayer, B. et al. Full-length 5’RACE identifies all major HBV transcripts in HBV-infected hepatocytes and patient serum. J. Hepatol. 73 32087349 10.1016/j.jhep.2020.01.028 19. Altinel K Single-nucleotide resolution mapping of hepatitis B virus promoters in infected human livers and hepatocellular carcinoma J. Virol. 2016 90 10811 10822 10.1128/JVI.01625-16 27681123 PMC5110153 Altinel, K. et al. Single-nucleotide resolution mapping of hepatitis B virus promoters in infected human livers and hepatocellular carcinoma. J. Virol. 90 27681123 10.1128/JVI.01625-16 PMC5110153 20. Kim SC Efficacy of antiviral therapy and host-virus interactions visualised using serial liver sampling with fine-needle aspirates JHEP Rep. 2023 5 100817 10.1016/j.jhepr.2023.100817 37600958 PMC10432215 Kim, S. C. et al. Efficacy of antiviral therapy and host-virus interactions visualised using serial liver sampling with fine-needle aspirates. JHEP Rep. 5 37600958 10.1016/j.jhepr.2023.100817 PMC10432215 21. Harris JM Oxygen-dependent histone lysine demethylase 4 restricts hepatitis B virus replication J. Biol. Chem. 2024 300 105724 10.1016/j.jbc.2024.105724 38325742 PMC10914488 Harris, J. M. et al. Oxygen-dependent histone lysine demethylase 4 restricts hepatitis B virus replication. J. Biol. Chem. 300 38325742 10.1016/j.jbc.2024.105724 PMC10914488 22. Testoni B Evaluation of the HBV liver reservoir with fine needle aspirates JHEP Rep. 2023 5 100841 10.1016/j.jhepr.2023.100841 37675272 PMC10477677 Testoni, B. et al. Evaluation of the HBV liver reservoir with fine needle aspirates. JHEP Rep. 5 37675272 10.1016/j.jhepr.2023.100841 PMC10477677 23. Lumley, S. F. et al. Pan-genotypic probe-based enrichment to improve efficiency of Hepatitis B virus sequencing. bioRxiv 24. Ng E An enrichment protocol and analysis pipeline for long read sequencing of the hepatitis B virus transcriptome J. Gen. Virol. 2023 104 001856 10.1099/jgv.0.001856 37196057 PMC10845048 Ng, E. et al. An enrichment protocol and analysis pipeline for long read sequencing of the hepatitis B virus transcriptome. J. Gen. Virol. 104 37196057 10.1099/jgv.0.001856 PMC10845048 25. Meier MA Ubiquitous expression of HBsAg from integrated HBV DNA in patients with low viral load J. Hepatol. 2021 75 840 847 10.1016/j.jhep.2021.04.051 34004216 Meier, M. A. et al. Ubiquitous expression of HBsAg from integrated HBV DNA in patients with low viral load. J. Hepatol. 75 34004216 10.1016/j.jhep.2021.04.051 26. Suslov A Transition to HBeAg-negative chronic hepatitis B virus infection is associated with reduced cccDNA transcriptional activity J. Hepatol. 2021 74 794 800 10.1016/j.jhep.2020.11.003 33188905 Suslov, A. et al. Transition to HBeAg-negative chronic hepatitis B virus infection is associated with reduced cccDNA transcriptional activity. J. Hepatol. 74 33188905 10.1016/j.jhep.2020.11.003 27. Magri A Inflammatory gene expression associates with hepatitis B virus cccDNA- but not integrant-derived transcripts in HBeAg negative disease Viruses 2022 14 1070 10.3390/v14051070 35632812 PMC9146050 Magri, A. et al. Inflammatory gene expression associates with hepatitis B virus cccDNA- but not integrant-derived transcripts in HBeAg negative disease. Viruses 14 35632812 10.3390/v14051070 PMC9146050 28. Rossi M Phenotypic CD8 T cell profiling in chronic hepatitis B to predict HBV-specific CD8 T cell susceptibility to functional restoration in vitro Gut 2023 72 2123 2137 10.1136/gutjnl-2022-327202 36717219 PMC10579518 Rossi, M. et al. Phenotypic CD8 T cell profiling in chronic hepatitis B to predict HBV-specific CD8 T cell susceptibility to functional restoration in vitro. Gut 72 36717219 10.1136/gutjnl-2022-327202 PMC10579518 29. Le Bert N Effects of hepatitis B surface antigen on virus-specific and global T cells in patients with chronic hepatitis B virus infection Gastroenterology 2020 159 652 664 10.1053/j.gastro.2020.04.019 32302614 Le Bert, N. et al. Effects of hepatitis B surface antigen on virus-specific and global T cells in patients with chronic hepatitis B virus infection. Gastroenterology 159 32302614 10.1053/j.gastro.2020.04.019 30. Wisskirchen K Isolation and functional characterization of hepatitis B virus-specific T-cell receptors as new tools for experimental and clinical use PLoS One 2017 12 e0182936 10.1371/journal.pone.0182936 28792537 PMC5549754 Wisskirchen, K. et al. Isolation and functional characterization of hepatitis B virus-specific T-cell receptors as new tools for experimental and clinical use. PLoS One 12 28792537 10.1371/journal.pone.0182936 PMC5549754 31. Cornberg M Lok AS Terrault NA Zoulim F Faculty, E.-A.H.T.E.C Guidance for design and endpoints of clinical trials in chronic hepatitis B - Report from the 2019 EASL-AASLD HBV Treatment Endpoints Conference(double dagger) J. Hepatol. 2020 72 539 557 10.1016/j.jhep.2019.11.003 31730789 Cornberg, M., Lok, A. S., Terrault, N. A., Zoulim, F. & Faculty, E.-A.H.T.E.C Guidance for design and endpoints of clinical trials in chronic hepatitis B - Report from the 2019 EASL-AASLD HBV Treatment Endpoints Conference(double dagger). J. Hepatol. 72 31730789 10.1016/j.jhep.2019.11.003 32. Lok ASF Toward a Functional Cure for Hepatitis B Gut Liver 2024 18 593 601 10.5009/gnl240023 38533651 PMC11249939 Lok, A. S. F. Toward a Functional Cure for Hepatitis B. Gut Liver 18 38533651 10.5009/gnl240023 PMC11249939 33. Block, T. M. et al. New potent HBV replication inhibitors for the management of chronic hepatitis B are needed. Nat. Rev. Gastroenterol. Hepatol. 22 10.1038/s41575-025-01037-z 39910374 34. Ghany MG Buti M Lampertico P Lee HM Faculty, A.-E.H.-H.T.E.C Guidance on treatment endpoints and study design for clinical trials aiming to achieve cure in chronic hepatitis B and D: report from the 2022 AASLD-EASL HBV-HDV treatment endpoints conference Hepatology 2023 78 1654 1673 10.1097/HEP.0000000000000431 37326326 PMC12373085 Ghany, M. G., Buti, M., Lampertico, P., Lee, H. M. & Faculty, A.-E.H.-H.T.E.C Guidance on treatment endpoints and study design for clinical trials aiming to achieve cure in chronic hepatitis B and D: report from the 2022 AASLD-EASL HBV-HDV treatment endpoints conference. Hepatology 78 37326326 10.1097/HEP.0000000000000431 PMC12373085 35. Lim CS Quantitative analysis of the splice variants expressed by the major hepatitis B virus genotypes Micro. Genom. 2021 7 mgen000492 10.1099/mgen.0.000492 PMC8115900 33439114 Lim, C. S. et al. Quantitative analysis of the splice variants expressed by the major hepatitis B virus genotypes. Micro. Genom. 7 10.1099/mgen.0.000492 PMC8115900 33439114 36. Tu, T., Budzinska, M. A., Vondran, F. W. R., Shackel, N. A. & Urban, S. Hepatitis B virus DNA integration occurs early in the viral life cycle in an in vitro infection model via sodium taurocholate cotransporting polypeptide-dependent uptake of enveloped virus particles. J. Virol. 92 10.1128/JVI.02007-17 PMC5952132 29437961 37. Ren X Hepatitis B virus genotype and basal core promoter/precore mutations are associated with hepatitis B-related acute-on-chronic liver failure without pre-existing liver cirrhosis J. Viral Hepat. 2010 17 887 895 10.1111/j.1365-2893.2009.01254.x 20070500 PMC2998700 Ren, X. et al. Hepatitis B virus genotype and basal core promoter/precore mutations are associated with hepatitis B-related acute-on-chronic liver failure without pre-existing liver cirrhosis. J. Viral Hepat. 17 20070500 10.1111/j.1365-2893.2009.01254.x PMC2998700 38. Derti A A quantitative atlas of polyadenylation in five mammals Genome Res. 2012 22 1173 1183 10.1101/gr.132563.111 22454233 PMC3371698 Derti, A. et al. A quantitative atlas of polyadenylation in five mammals. Genome Res. 22 22454233 10.1101/gr.132563.111 PMC3371698 39. Anderson M Circulating pregenomic hepatitis B virus RNA is primarily full-length in chronic hepatitis b patients undergoing nucleos(t)ide analogue therapy Clin. Infect. Dis. 2021 72 2029 2031 10.1093/cid/ciaa1015 32687164 Anderson, M. et al. Circulating pregenomic hepatitis B virus RNA is primarily full-length in chronic hepatitis b patients undergoing nucleos(t)ide analogue therapy. Clin. Infect. Dis. 72 32687164 10.1093/cid/ciaa1015 40. Testoni B Quantification of circulating HBV RNA expressed from intrahepatic cccDNA in untreated and NUC treated patients with chronic hepatitis B Gut 2024 73 659 667 10.1136/gutjnl-2023-330644 37879886 PMC10958289 Testoni, B. et al. Quantification of circulating HBV RNA expressed from intrahepatic cccDNA in untreated and NUC treated patients with chronic hepatitis B. Gut 73 37879886 10.1136/gutjnl-2023-330644 PMC10958289 41. Wooddell CI RNAi-based treatment of chronically infected patients and chimpanzees reveals that integrated hepatitis B virus DNA is a source of HBsAg Sci. Transl. Med 2017 9 eaan0241 10.1126/scitranslmed.aan0241 28954926 PMC5830187 Wooddell, C. I. et al. RNAi-based treatment of chronically infected patients and chimpanzees reveals that integrated hepatitis B virus DNA is a source of HBsAg. Sci. Transl. Med 9 28954926 10.1126/scitranslmed.aan0241 PMC5830187 42. van Buuren N Targeted long-read sequencing reveals clonally expanded HBV-associated chromosomal translocations in patients with chronic hepatitis B JHEP Rep. 2022 4 100449 10.1016/j.jhepr.2022.100449 35295767 PMC8918852 van Buuren, N. et al. Targeted long-read sequencing reveals clonally expanded HBV-associated chromosomal translocations in patients with chronic hepatitis B. JHEP Rep. 4 35295767 10.1016/j.jhepr.2022.100449 PMC8918852 43. Chheda U Factors affecting stability of RNA - temperature, length, concentration, pH, and buffering species J. Pharm. Sci. 2024 113 377 385 10.1016/j.xphs.2023.11.023 38042343 Chheda, U. et al. Factors affecting stability of RNA - temperature, length, concentration, pH, and buffering species. J. Pharm. Sci. 113 38042343 10.1016/j.xphs.2023.11.023 44. Chapus, F. et al. Helicases DDX5 and DDX17 promote heterogeneity in HBV transcription termination in infected human hepatocytes. J. Hepatol. 81 10.1016/j.jhep.2024.05.016 38782119 45. Yuen MF Safety, tolerability and antiviral activity of the antisense oligonucleotide bepirovirsen in patients with chronic hepatitis B: a phase 2 randomized controlled trial Nat. Med. 2021 27 1725 1734 10.1038/s41591-021-01513-4 34642494 PMC8516644 Yuen, M. F. et al. Safety, tolerability and antiviral activity of the antisense oligonucleotide bepirovirsen in patients with chronic hepatitis B: a phase 2 randomized controlled trial. Nat. Med. 27 34642494 10.1038/s41591-021-01513-4 PMC8516644 46. Kramvis A Kew MC Relationship of genotypes of hepatitis B virus to mutations, disease progression and response to antiviral therapy J. Viral Hepat. 2005 12 456 464 10.1111/j.1365-2893.2005.00624.x 16108759 Kramvis, A. & Kew, M. C. Relationship of genotypes of hepatitis B virus to mutations, disease progression and response to antiviral therapy. J. Viral Hepat. 12 16108759 10.1111/j.1365-2893.2005.00624.x 47. Washizaki A Neutralization of hepatitis B virus with vaccine-escape mutations by hepatitis B vaccine with large-HBs antigen Nat. Commun. 2022 13 5207 10.1038/s41467-022-32910-z 36064848 PMC9441830 Washizaki, A. et al. Neutralization of hepatitis B virus with vaccine-escape mutations by hepatitis B vaccine with large-HBs antigen. Nat. Commun. 13 36064848 10.1038/s41467-022-32910-z PMC9441830 48. Gout JF Thomas WK Smith Z Okamoto K Lynch M Large-scale detection of in vivo transcription errors Proc. Natl. Acad. Sci. USA 2013 110 18584 18589 10.1073/pnas.1309843110 24167253 PMC3832031 Gout, J. F., Thomas, W. K., Smith, Z., Okamoto, K. & Lynch, M. Large-scale detection of in vivo transcription errors. Proc. Natl. Acad. Sci. USA 110 24167253 10.1073/pnas.1309843110 PMC3832031 49. Avellon A Echevarria JM Frequency of hepatitis B virus ‘a’ determinant variants in unselected Spanish chronic carriers J. Med Virol. 2006 78 24 36 10.1002/jmv.20516 16299725 Avellon, A. & Echevarria, J. M. Frequency of hepatitis B virus ‘a’ determinant variants in unselected Spanish chronic carriers. J. Med Virol. 78 16299725 10.1002/jmv.20516 50. Norder H Courouce AM Magnius LO Molecular basis of hepatitis B virus serotype variations within the four major subtypes J. Gen. Virol. 1992 73 3141 3145 10.1099/0022-1317-73-12-3141 1469353 Norder, H., Courouce, A. M. & Magnius, L. O. Molecular basis of hepatitis B virus serotype variations within the four major subtypes. J. Gen. Virol. 73 1469353 10.1099/0022-1317-73-12-3141 51. Scholtes C Performance of the cobas(R) HBV RNA automated investigational assay for the detection and quantification of circulating HBV RNA in chronic HBV patients J. Clin. Virol. 2022 150-151 105150 10.1016/j.jcv.2022.105150 35427860 Scholtes, C. et al. Performance of the cobas(R) HBV RNA automated investigational assay for the detection and quantification of circulating HBV RNA in chronic HBV patients. J. Clin. Virol. 150-151 35427860 10.1016/j.jcv.2022.105150 52. Butler EK Hepatitis B virus serum DNA and RNA levels in nucleos(t)ide analog-treated or untreated patients during chronic and acute infection Hepatology 2018 68 2106 2117 10.1002/hep.30082 29734472 Butler, E. K. et al. Hepatitis B virus serum DNA and RNA levels in nucleos(t)ide analog-treated or untreated patients during chronic and acute infection. Hepatology 68 29734472 10.1002/hep.30082 53. Degasperi, E. et al. Differential HBV RNA and HBcrAg patterns in untreated patients with chronic hepatitis delta. J. Hepatol. 82 10.1016/j.jhep.2024.11.051 39662705 54. Tombacz D Long-read assays shed new light on the transcriptome complexity of a viral pathogen Sci. Rep. 2020 10 13822 10.1038/s41598-020-70794-5 32796917 PMC7427789 Tombacz, D. et al. Long-read assays shed new light on the transcriptome complexity of a viral pathogen. Sci. Rep. 10 32796917 10.1038/s41598-020-70794-5 PMC7427789 55. Balazs Z long-read sequencing of human cytomegalovirus transcriptome reveals RNA isoforms carrying distinct coding potentials Sci. Rep. 2017 7 15989 10.1038/s41598-017-16262-z 29167532 PMC5700075 Balazs, Z. et al. long-read sequencing of human cytomegalovirus transcriptome reveals RNA isoforms carrying distinct coding potentials. Sci. Rep. 7 29167532 10.1038/s41598-017-16262-z PMC5700075 56. Gu Z Hepatitis B virus enhancer 1 activates preS1 and preS2 promoters of integrated HBV DNA impairing HBsAg secretion JHEP Rep. 2024 6 101144 10.1016/j.jhepr.2024.101144 39253701 PMC11381774 Gu, Z. et al. Hepatitis B virus enhancer 1 activates preS1 and preS2 promoters of integrated HBV DNA impairing HBsAg secretion. JHEP Rep. 6 39253701 10.1016/j.jhepr.2024.101144 PMC11381774 57. Qian Z HBV integrations reshaping genomic structures promote hepatocellular carcinoma Gut 2024 73 1169 1182 10.1136/gutjnl-2023-330414 38395437 PMC11187386 Qian, Z. et al. HBV integrations reshaping genomic structures promote hepatocellular carcinoma. Gut 73 38395437 10.1136/gutjnl-2023-330414 PMC11187386 58. Tu T Jilbert AR Detection of hepatocyte clones containing integrated hepatitis B virus DNA using inverse nested PCR Methods Mol. Biol. 2017 1540 97 118 10.1007/978-1-4939-6700-1_9 27975311 Tu, T. & Jilbert, A. R. Detection of hepatocyte clones containing integrated hepatitis B virus DNA using inverse nested PCR. Methods Mol. Biol. 1540 27975311 10.1007/978-1-4939-6700-1_9 59. Li CL HBV DNA integration into telomerase or MLL4 genes and TERT promoter point mutation as three independent signatures in subgrouping HBV-related HCC with distinct features Liver Cancer 2024 13 41 55 10.1159/000530699 38344447 PMC10857820 Li, C. L. et al. HBV DNA integration into telomerase or MLL4 genes and TERT promoter point mutation as three independent signatures in subgrouping HBV-related HCC with distinct features. Liver Cancer 13 38344447 10.1159/000530699 PMC10857820 60. Seydel, C. Beyond cell atlases: spatial biology reveals mechanisms behind disease. Nat. Biotechnol. 43 10.1038/s41587-025-02699-5 40399694 61. Li, D., Hamadalnil, Y. & Tu, T. Hepatitis B viral protein HBx: roles in viral replication and hepatocarcinogenesis. Viruses 16 10.3390/v16091361 PMC11437454 39339838 62. Hernandez S Canonical and divergent N-terminal HBx isoform proteins unveiled: characteristics and roles during HBV replication Biomedicines 2021 9 1701 10.3390/biomedicines9111701 34829930 PMC8616016 Hernandez, S. et al. Canonical and divergent N-terminal HBx isoform proteins unveiled: characteristics and roles during HBV replication. Biomedicines 9 34829930 10.3390/biomedicines9111701 PMC8616016 63. Iden M Multi-omics mapping of human papillomavirus integration sites illuminates novel cervical cancer target genes Br. J. Cancer 2021 125 1408 1419 10.1038/s41416-021-01545-0 34526665 PMC8575955 Iden, M. et al. Multi-omics mapping of human papillomavirus integration sites illuminates novel cervical cancer target genes. Br. J. Cancer 125 34526665 10.1038/s41416-021-01545-0 PMC8575955 64. Wang Z Long-read sequencing reveals the structural complexity of genomic integration of HPV DNA in cervical cancer cell lines BMC Genom. 2024 25 198 10.1186/s12864-024-10101-y PMC10877919 38378450 Wang, Z. et al. Long-read sequencing reveals the structural complexity of genomic integration of HPV DNA in cervical cancer cell lines. BMC Genom. 25 10.1186/s12864-024-10101-y PMC10877919 38378450 65. Santiago JC Variation within major internal repeats of KSHV in vivo Virus Evol. 2023 9 vead034 10.1093/ve/vead034 37325087 PMC10266750 Santiago, J. C. et al. Variation within major internal repeats of KSHV in vivo. Virus Evol. 9 37325087 10.1093/ve/vead034 PMC10266750 66. Fulop A Integrative profiling of Epstein-Barr virus transcriptome using a multiplatform approach Virol. J. 2022 19 7 10.1186/s12985-021-01734-6 34991630 PMC8740505 Fulop, A. et al. Integrative profiling of Epstein-Barr virus transcriptome using a multiplatform approach. Virol. J. 19 34991630 10.1186/s12985-021-01734-6 PMC8740505 67. Wright CJ Smith CWJ Jiggins CD Alternative splicing as a source of phenotypic diversity Nat. Rev. Genet 2022 23 697 710 10.1038/s41576-022-00514-4 35821097 Wright, C. J., Smith, C. W. J. & Jiggins, C. D. Alternative splicing as a source of phenotypic diversity. Nat. Rev. Genet 23 35821097 10.1038/s41576-022-00514-4 68. McCoullough LC The in vitro replication phenotype of hepatitis B virus (HBV) splice variants Sp3 and Sp9 and their impact on wild-type HBV replication J. Virol. 2024 98 e0153823 10.1128/jvi.01538-23 38501924 PMC11019940 McCoullough, L. C. et al. The in vitro replication phenotype of hepatitis B virus (HBV) splice variants Sp3 and Sp9 and their impact on wild-type HBV replication. J. Virol. 98 38501924 10.1128/jvi.01538-23 PMC11019940 69. Velkov S Ott JJ Protzer U Michler T The global hepatitis B virus genotype distribution approximated from available genotyping data Genes (Basel) 2018 9 495 10.3390/genes9100495 30326600 PMC6210291 Velkov, S., Ott, J. J., Protzer, U. & Michler, T. The global hepatitis B virus genotype distribution approximated from available genotyping data. Genes (Basel) 9 30326600 10.3390/genes9100495 PMC6210291 70. Hou J Prevalence of naturally occurring surface gene variants of hepatitis B virus in nonimmunized surface antigen-negative Chinese carriers Hepatology 2001 34 1027 1034 10.1053/jhep.2001.28708 11679975 Hou, J. et al. Prevalence of naturally occurring surface gene variants of hepatitis B virus in nonimmunized surface antigen-negative Chinese carriers. Hepatology 34 11679975 10.1053/jhep.2001.28708 71. Wettengel, J. M. et al. Rapid and robust continuous purification of high-titer hepatitis B virus for in vitro and in vivo applications. Viruses 13 10.3390/v13081503 PMC8402639 34452368 72. Belloni L Nuclear HBx binds the HBV minichromosome and modifies the epigenetic regulation of cccDNA function Proc. Natl. Acad. Sci. USA 2009 106 19975 19979 10.1073/pnas.0908365106 19906987 PMC2775998 Belloni, L. et al. Nuclear HBx binds the HBV minichromosome and modifies the epigenetic regulation of cccDNA function. Proc. Natl. Acad. Sci. USA 106 19906987 10.1073/pnas.0908365106 PMC2775998 73. Dobrica, M. O. et al. CTCF regulates hepatitis B virus cccDNA chromatin topology. J Gen Virol 105 10.1099/jgv.0.001939 38175123 74. Tsukuda S The N6-methyladenosine demethylase ALKBH5 regulates the hypoxic HBV transcriptome PLoS Pathog. 2024 20 e1011917 10.1371/journal.ppat.1011917 38227578 PMC10817175 Tsukuda, S. et al. The N6-methyladenosine demethylase ALKBH5 regulates the hypoxic HBV transcriptome. PLoS Pathog. 20 38227578 10.1371/journal.ppat.1011917 PMC10817175 75. Li H Minimap2: pairwise alignment for nucleotide sequences Bioinformatics 2018 34 3094 3100 10.1093/bioinformatics/bty191 29750242 PMC6137996 Li, H. Minimap2: pairwise alignment for nucleotide sequences. Bioinformatics 34 29750242 10.1093/bioinformatics/bty191 PMC6137996 76. Lawrence M Software for computing and annotating genomic ranges PLoS Comput Biol. 2013 9 e1003118 10.1371/journal.pcbi.1003118 23950696 PMC3738458 Lawrence, M. et al. Software for computing and annotating genomic ranges. PLoS Comput Biol. 9 23950696 10.1371/journal.pcbi.1003118 PMC3738458 77. Garrido-Martin D Palumbo E Guigo R Breschi A ggsashimi: Sashimi plot revised for browser- and annotation-independent splicing visualization PLoS Comput. Biol. 2018 14 e1006360 10.1371/journal.pcbi.1006360 30118475 PMC6114895 Garrido-Martin, D., Palumbo, E., Guigo, R. & Breschi, A. ggsashimi: Sashimi plot revised for browser- and annotation-independent splicing visualization. PLoS Comput. Biol. 14 30118475 10.1371/journal.pcbi.1006360 PMC6114895 78. Minh BQ IQ-TREE 2: new models and efficient methods for phylogenetic inference in the genomic era Mol. Biol. Evol. 2020 37 1530 1534 10.1093/molbev/msaa015 32011700 PMC7182206 Minh, B. Q. et al. IQ-TREE 2: new models and efficient methods for phylogenetic inference in the genomic era. Mol. Biol. Evol. 37 32011700 10.1093/molbev/msaa015 PMC7182206 79. Kalyaanamoorthy S Minh BQ Wong TKF von Haeseler A Jermiin LS ModelFinder: fast model selection for accurate phylogenetic estimates Nat. Methods 2017 14 587 589 10.1038/nmeth.4285 28481363 PMC5453245 Kalyaanamoorthy, S., Minh, B. Q., Wong, T. K. F., von Haeseler, A. & Jermiin, L. S. ModelFinder: fast model selection for accurate phylogenetic estimates. Nat. Methods 14 28481363 10.1038/nmeth.4285 PMC5453245 ",
  "metadata": {
    "Title of this paper": "ModelFinder: fast model selection for accurate phylogenetic estimates",
    "Journal it was published in:": "Nature Communications",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12474897/"
  }
}