{
  "title": "Paper_330",
  "abstract": "pmc Cancer Rep (Hoboken) Cancer Rep (Hoboken) 4016 canrep CNR2 Cancer Reports 2573-8348 Wiley PMC12485821 PMC12485821.1 12485821 12485821 41031562 10.1002/cnr2.70342 CNR270342 CNR2-24-0901 1 Original Article Original Article Modification of Pathological Nodal Classification for pT1b Li Jin‐bo  1  2 Zhang Li‐Hong  1  2  3 Leng Chang‐Sen https://orcid.org/0000-0001-6633-5995  1  2  4 Chen Jun‐Ying https://orcid.org/0000-0001-7732-4319  1  2  4 chenjuny@sysucc.org.cn Fu Jian‐Hua  1  2  4 fujh@sysucc.org.cn   1 Department of Thoracic Oncology Sun Yat‐sen University Cancer Center Guangzhou China   2 State Key Laboratory of Oncology in South China, Collaborative Innovation Center for Cancer Medicine, Sun Yat‐sen University Cancer Center Guangzhou China   3 Department of Pathology Sun Yat‐sen University Cancer Center Guangzhou China   4 Guangdong Esophageal Cancer Institute Guangzhou China * Correspondence: chenjuny@sysucc.org.cn fujh@sysucc.org.cn 01 10 2025 10 2025 8 10 498015 10.1002/cnr2.v8.10 e70342 05 6 2025 30 8 2024 01 9 2025 01 10 2025 02 10 2025 02 10 2025 © 2025 The Author(s). Cancer Reports https://creativecommons.org/licenses/by/4.0/ This is an open access article under the terms of the http://creativecommons.org/licenses/by/4.0/ ABSTRACT Background Lymphovascular invasion (LVI) adversely affects the survival of pT1b esophageal squamous cell carcinoma (ESCC). It is hypothesized that a modified stage classification of pT1b ESCC based on LVI may facilitate multidisciplinary therapy in LVI‐positive patients. Aims The study aims to investigate the impact of LVI on pathological nodal classification for pT1b ESCC. Methods and Results Surgically resected pT1b ESCC patients in Sun Yat‐sen University Cancer Center between 2008 and 2018 were retrospectively reviewed. Tumor sections were re‐assessed for LVI by gastrointestinal pathologists. The associations between patient survival and LVI were evaluated by the Log‐rank method. A multivariate Cox regression model was applied to identify the impact of LVI on survival. Prognostic performance was assessed by Harrell's C p p p p p p Conclusion Tumors with LVI should be defined as a separate subclassification to accurately classify the prognostic category in pT1b patients. Further studies are required to investigate multidisciplinary therapies for LVI+ pT1b patients. esophageal squamous cell carcinoma lymphovascular invasion pathological T1b prognosis pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement yes pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes source-schema-version-number 2.0 cover-date October 2025 details-of-publishers-convertor Converter:WILEY_ML3GV2_TO_JATSPMC version:6.6.4 mode:remove_FC converted:01.10.2025  J.‐b. Li L.‐H. Zhang C.‐S. Leng J.‐Y. Chen J.‐H. Fu Modification of Pathological Nodal Classification for pT1b Cancer Reports 8 10 2025 e70342 10.1002/cnr2.70342  Funding: Jin‐Bo Li and Li‐Hong Zhang contributed equally to this study and therefore share the first co‐authorship. 1 Introduction Esophageal cancer is the sixth leading cause of cancer‐related death, and about 90% are esophageal squamous cell carcinoma (ESCC) [ 1 2 3 4 5 6 Accurate tumor staging was pivotal for optimizing treatment selection. Surgery remained the mainstream for ESCC treatment; however, multidisciplinary therapies, including adjuvant chemotherapy, radiotherapy, and chemoradiotherapy, were also crucial for improving the prognosis of resectable ESCC with positive LNM. Generally, surgery alone would be adequate for early‐stage ESCC [ 7 8 9 According to NCCN guidelines for esophageal and esophageal junction cancer, endoscopic submucosal resection is not recommended for T1b patients with lymphovascular invasion (LVI) [ 10 11 2 Methods 2.1 Patient Selection Between January 2008 and January 2018, 1903 ESCC patients underwent esophagectomy, of whom 424 (35.3%) were pT1b and received two‐field lymph node dissection in the thoracic surgery department of Sun Yat‐sen University Cancer Center. The Mckeown or Ivor‐Lewis's procedure was applied for tumors located in the middle third or lower third of the thoracic esophagus. The work has been reported in line with the STROBE criteria [ 12 Routine preoperative evaluations include history and physical examinations, blood tests, pulmonary and cardiac evaluations, neck, chest, and upper abdominal contrast computed tomography (CT), and upper gastrointestinal endoscopy with biopsy. The characteristics including age, gender, BMI (Body Mass Index), comorbidities, personal second malignancy, postoperative pathological stages, margin status, tumor size, LVI states, postoperative complications, neo‐adjuvant or adjuvant treatments, and follow‐ups were collected. All tumors and positive lymph nodes were re‐staged according to the seventh edition of the American Joint Committee on Cancer (AJCC) guideline. The retrospective study was approved by the IRB (Institutional Review Board) of Sun Yat‐sen University Cancer Center. 2.2 Pathological Assessment of LVI The postoperative samples were processed by gastrointestinal pathologists according to the standardized procedures. LVI was assessed using hematoxylin and eosin (H&E) staining. Elastin Van Gieson (EVG) and D2‐40 immunostaining were not routinely performed due to institutional protocols prioritizing H&E for LVI identification, as validated in prior studies [ 13 2.3 Follow‐Up Patients were followed every 3 months in the first 2 years, every 6 months for postoperative 3 to 5 years, and then annually. The routine follow‐up evaluations include blood tests, contrast CT, and upper gastrointestinal endoscopy. Blood tests included complete blood count, liver function tests, and tumor markers (CEA, SCC‐Ag) to monitor recurrence. In addition, the bone scan, brain MRI, or PET/CT would be applied if recurrence or metastasis was suspected. 2.4 Statistical Analysis Statistical analysis was performed using R software version 3.6.3. The distributions of clinical categorical variables were compared by the Chi‐square test. The appropriate cut‐off point of tumor size was determined by the receiver operating characteristics curve (ROC). The tumor size cut‐off (2.1 cm) was selected via ROC analysis to maximize sensitivity and specificity for LVI prediction (AUC = 0.62, p C p 3 Results 3.1 Baseline Patient and LVI A total of 424 patients diagnosed as pT1b stage ESCC who underwent R0 resections were included. More LVI+ patients received adjuvant therapy (43.2% vs. 15.5%, p p p S1 p 1 TABLE 1 The distribution of clinical characteristics in pT1b ESCC patients with or without LVI. Characteristics Groups  p LVI ( N Non‐LVI ( N Age (mean ± SD) 60.5 ± 6.5 60.0 ± 8.0 0.631 Gender (M/F, %) 32 (72.7)/12 (27.3) 284 (74.7)/96 (25.3) 0.772 Smoking (yes/no, %) 25 (56.8)/19 (43.2) 172 (45.3)/208 (54.7) 0.146 Alcohol (yes/no, %) 17 (38.6)/27 (61.4) 114 (30.0)/266 (70.0) 0.241 Family tumor history (yes/no, %) 7 (15.9)/37 (84.1) 58 (15.3)/322 (84.7) 0.910 Tumor size (≤ 2.1 cm/> 2.1 cm) 24 (54.5)/20 (45.5) 267 (70.3)/113 (29.7) 0.033 Number of inspected lymph Nodes (mean ± SD) 26.7 ± 14.7 24.7 ± 15.0 0.405 pN stages (N0/N+, %) 15 (34.1)/29 (65.9) 297 (78.2)/83 (21.8) < 0.001 G stages (G1, x 1 (2.3)/24 (54.5)/19 (43.2) 21 (5.5)/228 (60.0)/131 (34.5) 0.402 Neoadjuvant therapy (yes/no, %) 2 (4.5)/42 (95.5) 22 (5.8)/358 (94.2) 0.735 Adjuvant therapy (yes/no, %) 19 (43.2)/25 (56.8) 59 (15.5)/321 (84.5) < 0.001 Abbreviations: LVI, lymphovascular invasion; N+, nodal positive; non‐LVI, non‐lymphovascular invasion; SD, standard deviation. 3.2 Survival Impact of LVI pT1b ESCC The median follow‐up time was 45.5 months, ranging from 1.1 to 143.8 months. Distant relapses were developed in 10 (22.7%) and 37 (9.7%) cases from LVI and non‐LVI groups, respectively ( p p 1 FIGURE 1 Overall survival curves of pT1b ESCC patients with or without LVI. 3.3 Multivariable Cox Regression Analysis Due to the interdependence between LVI, LNM ( p 1 p 1 S1 In multivariable Cox regression analysis, factors such as LVI status, tumor size, tumor grade, smoking history, alcohol drinking history, family malignant tumor history, neo‐adjuvant therapy, and adjuvant therapy were included. Finally, LVI (HR 2.03, 95% CI 1.12–3.69, p p 3.4 Superior Prognostic Model The number of cases in the pN0, pN1, pN2, and pN3 categories was 312 (73.6%), 81 (19.1%), 29 (6.8%), and 2 (0.5%), respectively. The survival curves of pT1b cases according to staging classifications are shown in Figure 2A p 2B FIGURE 2 Survival curve of pT1b ESCC patients separated by pN and modified pN system. Survival curves of pT1b patients separated by TNM stages (A); survival curves of pT1b patients separated by modified pN stages with LVI+ as an independent prognostic subgroup (B). The result indicated that LVI+ might be considered as a separate prognostic feature. When classifying LVI+ cases as an independent prognostic subgroup, the modified N staging showed superior prognostic performance with a higher C p 4 Discussion Our study demonstrates that LVI is an independent adverse prognostic factor for OS in pT1b ESCC, with LVI+ patients exhibiting significantly worse 5‐year OS (50.3% vs. 78.0%, p C p The mechanism for histopathological correlation between LVI and LNM remained unclear. Nonetheless, studies suggested that LVI and LNM were not mutually independent. As our results, higher pN categories were correlated with a higher incidence of LVI. Correspondently, a previous study reported that LVI might be the pathological process prior to LNM in superficial ESCC [ 14 11 In addition, LVI has been reported as a prognostic factor in ESCC [ 15 16 17 18 19 20 The tumor size records were retrospectively traced and analyzed in our cohort. But there are two major limitations in further clinical applications: some mucosal tumor lesions were not visible by eye, but could only be identified by microscope, and the tumor size was hard to measure accurately after neoadjuvant therapy. In addition, the max length of the lesion should be chosen as a measurement of tumor size to increase the accessibility in the pathological examination. The discrepancy in tumor size measurements might be the reason for different results on prognostic correlations. Although the pT1b ESCC was much less than the advanced stages at diagnosis, we included a relatively large cohort of 424 patients. It is notable that survival heterogeneity was observed in pT1b esophageal cancer [ 3 21 22 23 24 Adding LVI patients into a separate prognostic subgroup improved the accuracy of the survival prediction model. Harrell et al. introduced C 25 C C 26 C The findings have to be analyzed in light of limitations. Our study was solely focused on LVI at the primary tumor site. Further investigations are needed to clarify the clinical significance of LVI in metastatic lymph nodes and distant metastases. Additionally, the retrospective nature of this study inherently imposes certain limitations. Future trials may consider focusing on multidisciplinary treatment strategies for pT1b patients, particularly those with SM1 infiltration who undergo endoscopic submucosal resection. 5 Conclusions In conclusion, pT1b ESCC with LVI should be defined as a separate prognostic subclassification. Our findings advocate for routine LVI assessment in clinical practice to identify high‐risk patients who may benefit from adjuvant therapies, aligning with prior evidence on LVI's role in early‐stage cancers. Future prospective studies are warranted to validate this model in larger cohorts and elucidate the molecular mechanisms linking LVI to tumor aggressiveness, ultimately refining personalized treatment strategies for pT1b ESCC. Author Contributions Jin‐bo Li contributed to data curation, investigation, methodology, and software. Li‐Hong Zhang contributed to software, methodology, writing original draft, and validation. Chang‐Sen Leng contributed to validation. Jun‐Ying Chen contributed to conceptualization, and writing original draft. Jian‐Hua Fu contributed to conceptualization, visualization, and writing review and editing. Ethics Statement This study has been approved by the IRB of Sun Yat‐sen University Cancer Center (ID: B2023‐574‐01). Consent According to the IRB committee, patient consent for publication has been waived. Conflicts of Interest The authors declare no conflicts of interest. Supporting information  Figure S1:  Table S1: Acknowledgments The authors have nothing to report. Data Availability Statement The data and material would be available upon reasonable request. References 1 C. C. Abnet M. Arnold W. Q. Wei Epidemiology of Esophageal Squamous Cell Carcinoma Gastroenterology 154 2018 360 373 28823862 10.1053/j.gastro.2017.08.023 PMC5836473 2 J. A. Ajani T. A. D'Amico D. J. Bentrem Esophageal and Esophagogastric Junction Cancers, Version 2.2023, NCCN Clinical Practice Guidelines in Oncology Journal of the National Comprehensive Cancer Network 21 2023 393 422 37015332 10.6004/jnccn.2023.0019 3 D. Molena S. R. DeMeester The Dilemma of T1 Esophageal Adenocarcinoma Journal of Thoracic and Cardiovascular Surgery 153 2017 1206 1207 28314532 10.1016/j.jtcvs.2016.10.106 4 X. F. Duan P. Tang X. B. Shang The Prevalence of Lymph Node Metastasis for Pathological T1 Esophageal Cancer: A Retrospective Study of 143 Cases Surgical Oncology 27 2018 1 6 29549895 10.1016/j.suronc.2017.11.002 5 B.‐H. Min J. W. Yang Y. W. Min Nomogram for Prediction of Lymph Node Metastasis in Patients With Superficial Esophageal Squamous Cell Carcinoma Journal of Gastroenterology and Hepatology 35 2020 1009 1015 31674067 10.1111/jgh.14915 6 Y. P. Liu L. Ma S. J. Wang Prognostic Value of Lymph Node Metastases and Lymph Node Ratio in Esophageal Squamous Cell Carcinoma European Journal of Surgical Oncology 36 2010 155 159 19854606 10.1016/j.ejso.2009.09.005 7 A. S. Borggreve B. F. Kingma S. A. Domrachev Surgical Treatment of Esophageal Cancer in the Era of Multimodality Management Annals of the New York Academy of Sciences 1434 2018 192 209 29761863 10.1111/nyas.13677 8 B. Ye X. Zhang Y. Su The Possibility of Endoscopic Treatment of cN0 Submucosal Esophageal Cancer: Results From a Surgical Cohort Surgical Endoscopy 35 2021 593 601 32072277 10.1007/s00464-020-07420-y PMC7819934 9 T. Tanaka S. Matono N. Mori T1 Squamous Cell Carcinoma of the Esophagus: Long‐Term Outcomes and Prognostic Factors After Esophagectomy Annals of Surgical Oncology 21 2014 932 938 24232603 10.1245/s10434-013-3372-0 10 R. Ishihara M. Arima T. Iizuka Endoscopic Submucosal Dissection/Endoscopic Mucosal Resection Guidelines for Esophageal Cancer Digestive Endoscopy 32 2020 452 493 32072683 10.1111/den.13654 11 P. Cen W. L. Hofstetter A. M. Correa Lymphovascular Invasion as a Tool to Further Subclassify T1b Esophageal Adenocarcinoma Cancer 112 2008 1020 1027 18205187 10.1002/cncr.23265 12 E. von Elm D. G. Altman M. Egger The Strengthening the Reporting of Observational Studies in Epidemiology (STROBE) Statement: Guidelines for Reporting Observational Studies International Journal of Surgery 12 2014 1495 1499 25046131 10.1016/j.ijsu.2014.07.013 13 Q. Huang K. Luo C. Chen Identification and Validation of Lymphovascular Invasion as a Prognostic and Staging Factor in Node‐Negative Esophageal Squamous Cell Carcinoma Journal of Thoracic Oncology 11 2016 583 592 26792626 10.1016/j.jtho.2015.12.109 14 J. Yang Z. Lu L. Li Relationship of Lymphovascular Invasion With Lymph Node Metastasis and Prognosis in Superficial Esophageal Carcinoma: Systematic Review and Meta‐Analysis BMC Cancer 20 2020 176 32131772 10.1186/s12885-020-6656-3 PMC7057611 15 C. P. Hsu C. Y. Chuang P. K. Hsu Lymphovascular Invasion as the Major Prognostic Factor in Node‐Negative Esophageal Cancer After Primary Esophagectomy Journal of Gastrointestinal Surgery 24 2020 1459 1468 31273552 10.1007/s11605-019-04310-0 16 W. H. Chen Y. L. Huang Y. K. Chao Prognostic Significance of Lymphovascular Invasion in Patients With Esophageal Squamous Cell Carcinoma Treated With Neoadjuvant Chemoradiotherapy Annals of Surgical Oncology 22 2015 338 343 25023545 10.1245/s10434-014-3881-5 17 S. H. Song C. H. Ye S. Lee Association Between Lymphovascular Invasion and Oncologic Outcomes Among Upper Urinary Tract Urothelial Carcinoma Patients Who Underwent Radical Nephroureterectomy Journal of Cancer Research and Clinical Oncology 145 2019 2863 2870 31501983 10.1007/s00432-019-03020-z PMC11810388 18 W. Du Y. Wang D. Li Preoperative Prediction of Lymphovascular Space Invasion in Cervical Cancer With Radiomics‐Based Nomogram Frontiers in Oncology 11 2021 637794 34322375 10.3389/fonc.2021.637794 PMC8311659 19 D. S. Yee S. F. Shariat W. T. Lowrance Prognostic Significance of Lymphovascular Invasion in Radical Prostatectomy Specimens BJU International 108 2011 502 507 21050364 10.1111/j.1464-410X.2010.09848.x PMC4319653 20 J. A. Harounian N. Molin T. J. Galloway Effect of Sentinel Lymph Node Biopsy and LVI on Merkel Cell Carcinoma Prognosis and Treatment Laryngoscope 131 2021 E828 E835 32663337 10.1002/lary.28866 21 F. Otaki G. K. Ma A. Krigel Outcomes of Patients With Submucosal (T1b) Esophageal Adenocarcinoma: A Multicenter Cohort Study Gastrointestinal Endoscopy 92 2020 31 39.e31 31953189 10.1016/j.gie.2020.01.013 PMC7321863 22 G. Lurje J. Bednarsch Z. Czigany The Prognostic Role of Lymphovascular Invasion and Lymph Node Metastasis in Perihilar and Intrahepatic Cholangiocarcinoma European Journal of Surgical Oncology 45 2019 1468 1478 31053477 10.1016/j.ejso.2019.04.019 23 S. Zhang D. Zhang S. Yi The Relationship of Lymphatic Vessel Density, Lymphovascular Invasion, and Lymph Node Metastasis in Breast Cancer: A Systematic Review and Meta‐Analysis Oncotarget 8 2017 2863 2873 27926511 10.18632/oncotarget.13752 PMC5356848 24 A. I. Schiefer S. F. Schoppmann P. Birner Lymphovascular Invasion of Tumor Cells in Lymph Node Metastases Has a Negative Impact on Survival in Esophageal Cancer Surgery 160 2016 331 340 27085684 10.1016/j.surg.2016.02.034 25 F. E. Harrell R. M. Califf D. B. Pryor Evaluating the Yield of Medical Tests JAMA 247 1982 2543 2546 7069920 26 H. Liang G. Zou Improved AIC Selection Strategy for Survival Analysis Computational Statistics & Data Analysis 52 2008 2538 2548 19158943 10.1016/j.csda.2007.09.003 PMC2344147 ",
  "metadata": {
    "Title of this paper": "Improved AIC Selection Strategy for Survival Analysis",
    "Journal it was published in:": "Cancer Reports",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12485821/"
  }
}