{
  "title": "Paper_168",
  "abstract": "pmc Nat Commun Nat Commun 2873 ncomms Nature Communications 2041-1723 Nature Publishing Group PMC12494899 PMC12494899.1 12494899 12494899 41044090 10.1038/s41467-025-63942-w 63942 1 Article Mitotic DNA repair by TMEJ suppresses replication stress-induced nuclear envelope reassembly defect http://orcid.org/0009-0007-3471-9856 Ye Guojun 1 2 http://orcid.org/0000-0001-9158-909X He Yide 2 http://orcid.org/0009-0009-2716-966X Zhang Yihui 2 3 4 Li Dongchen 2 5 Liu Fuhai 2 Li Yi 2 Ge Qinglian 1 2 Guo Qiong 1 2 Han Shuya 1 2 Song Chunyu 1 2 Chang Weiping 2 http://orcid.org/0009-0008-9927-6723 Zhang Haoyue 2 http://orcid.org/0000-0001-8364-3885 Peng Qin 2 http://orcid.org/0000-0002-9883-1616 Sun Kun 2 http://orcid.org/0000-0003-1788-0879 Ji Weike 5 6 http://orcid.org/0000-0003-4483-1909 Deng Lin denglin@szbl.ac.cn 2 3 1 https://ror.org/013xs5b60 grid.24696.3f 0000 0004 0369 153X Department of Biochemistry and Molecular Biology, School of Basic Medical Sciences, Capital Medical University, 2 https://ror.org/00sdcjz77 grid.510951.9 0000 0004 7775 6738 Shenzhen Bay Laboratory, 3 https://ror.org/00jsay989 0000 0005 1346 0417 Shenzhen Medical Academy of Research and Translation, 4 https://ror.org/03cve4549 grid.12527.33 0000 0001 0662 3178 Institute of Biopharmaceutical and Health Engineering, Shenzhen International Graduate School, Tsinghua University, 5 https://ror.org/00p991c53 grid.33199.31 0000 0004 0368 7223 Department of Biochemistry and Molecular Biology, School of Basic Medicine, Tongji Medical College, Huazhong University of Science and Technology, 6 https://ror.org/00p991c53 grid.33199.31 0000 0004 0368 7223 Cell Architecture Research Institute, Huazhong University of Science and Technology, 3 10 2025 2025 16 478256 8836 12 10 2024 28 8 2025 03 10 2025 05 10 2025 05 10 2025 © The Author(s) 2025 2025 https://creativecommons.org/licenses/by-nc-nd/4.0/ Open Access http://creativecommons.org/licenses/by-nc-nd/4.0/ Replication stress (RS), if not effectively and timely addressed, could result in DNA damage in mitosis. However, the relationship between RS and other mitotic events, such as nuclear envelope (NE) breakdown and reassembly, remains poorly understood. Here we report that RS can lead to NE defect. Importantly, rather than de novo NE rupture, the defect per se is a result of nuclear envelope reassembly defect (NERD) during mitosis. Interestingly, NERD is associated with mitotic DNA damage, and repair of the damage by DNA polymerase theta (Polθ)-mediated end joining (TMEJ) ameliorates NERD. Genomic mapping of lamina associated domains (LADs) by cleavage under targets and tagmentation (CUT&Tag) identifies a population of replication stress-sensitive LADs (RESSLADs). Strikingly, a substantial portion of RESSLADs reside in the common fragile sites (CFSs). The loss of RESSLADs-NE interaction under RS might be attributed to the sustained phosphorylation of Lamin A/C at the sites of NERD. In addition, prominent NE defect is observed under multiple conditions of synthetic lethality. Altogether, these findings establish a link between genome instability and nuclear vulnerability under replication stress. How replication stress affects nuclear integrity is not fully understood. Here, the authors report that replication stress induces DNA damage and nuclear envelope reassembly defect during mitosis, which is suppressed by DNA polymerase theta mediated end joining. Subject terms Cell biology Chemical biology Nuclear envelope https://doi.org/10.13039/501100001809 National Natural Science Foundation of China (National Science Foundation of China) 32270779 22207131 92354304 32371343 32122025 He Yide Ji Weike Deng Lin Shenzhen Medical Research Funds (B2301007);National Key R&D Program of China (2022YFA1302800); Guangdong Special Support Plan (2023TQ07A226); Proof of Concept Fund of Shenzhen Bay Laboratory (C1022426003);Shenzhen Bay Laboratory Start-up Fund (S201100001) Spark Trial Program from Bayjayray Inc. pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement yes pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes issue-copyright-statement © Springer Nature Limited 2025 Introduction DNA replication in the S phase and chromosome segregation during mitosis are the two main events of the cell cycle. In normal cells, these two processes are highly regulated and temporally separated, making them incompatible. However, under replication stress (RS) caused by oncogene activation, exposure to DNA damaging agents, or nucleotide depletion 1 3 4 6 One outstanding question is how RS and the resulting DSBs are addressed during mitosis. During interphase, DSBs can be repaired by homologous recombination (HR) and non-homologous end-joining (NHEJ). However, these canonical pathways are largely inactive in mitosis 7 8 9 POLQ 4 10 11 14 14 In addition to chromosome segregation, another significant morphological change in mitosis is the breakdown and reassembly of the nuclear envelope (NE). Upon entry into mitosis, filamentous lamina proteins, including Lamin A/C and Lamin B1, are phosphorylated, causing them to depolymerize and release the chromatin they bind to at the lamina associated domains (LADs), which leads to NE breakdown and chromosome condensation. Shortly after chromosome separation during anaphase, lamina proteins are dephosphorylated and repolymerized for NE reassembly, allowing the NE to rebind with chromatin to form LADs 15 16 17 19 20 NE defect often causes DNA damage at the rupture sites 21 22 23 18 Results Replication stress results in nuclear envelope defect To investigate the impact of RS on NE integrity, we applied a moderate concentration (0.4 μM) of the DNA polymerase inhibitor aphidicolin (APH) 8 24 25 26 1a, b 1a 1b 1b, c 1d Fig. 1 Mild replication stress induces nuclear envelope defect. a TP53−/− n N b c n N d n N e f n N g h i n N j k n N p- t d Next, immunofluorescence assays against the lamina proteins were performed to confirm the NE defect indicated by GFP-BAF foci. The results demonstrated that Lamin B1 was absent from the GFP-BAF foci (Fig. 1b 1b In addition to GFP-BAF, other reporters including RFP-NLS, a RFP-NLS GFP-BAF dual reporter, and cGAS-mNG (mNeonGreen) were used to confirm the effect of RS on NE integrity. Cells with cytosolic RFP-NLS increased by APH treatment from 6.6% to ~20% which was unaffected by GFP-BAF (Supplementary Fig. 1e 1e 1c 1f Moreover, the structure of the NE was examined by transmission electron microscopy (TEM) at a higher resolution. The bilayer structure of NE was intact in control cells, whereas gaps were observed in cells subjected to mild RS (Fig. 1d 1e 1g, h 1i 1f 1g Further, the expression levels of lamina proteins were examined by immunoblotting. APH-treated cells showed higher expression of both GFP-BAF and endogenous BAF (Fig. 1h 1g, h 1h 1j 1k 1l Finally, in addition to APH treatment, the effects of other types of replication stress were investigated. First, treatment of pyridostatin (PDS), a stabilizer of G-quadruplex (G4) induced the formation of GFP-BAF foci in a dose-dependent manner (Fig. 1i 27 28 1j 1m 1k 1k Does DNA damage cause NE defect? To address this question, DNA-damaging agents such as Camptothecin (CPT, 5 μM for 1 h), Zeocin (50 μg/mL for 1 h) and ionizing radiation (IR, 10 Gy) were applied to induce acute DNA damage and test their effects on NE integrity. Although drastic DNA damage, as indicated by γH2AX, was observed after treatments, the cells did not show significant increase in BAF foci (Supplementary Fig. 1n, o 29 1p RS-induced NE defect is due to NE reassembly defect (NERD) in mitosis To track the dynamics of RS-induced NE defect, we first quantified the percentage of cells with GFP-BAF foci. Compared to the DMSO-treated control cells, cells treated with APH accumulated GFP-BAF foci in a time-dependent manner (Fig. 2a 2a–c 30 2b 2d 31 2c 2e, f Fig. 2 NERD in mitosis causes RS-induced NE defect. a n N b c b n N c n N d e N f g h n i n N t p p p p p To further confirm the temporal relationship between cell cycle and NE defect, an RPE-1 cell line stably expressing GFP-BAF and RFP-H2B (Histone 2B, a marker of chromatin mass) was constructed for live-cell time-lapse imaging. As expected, GFP-BAF in cells with DMSO treatment did not form foci either before or after metaphase, which was referred to as “time 0” due to its featured morphology (Fig. 2d 1 2d 2 2g 2e 2h, i 2g 2d 2f As NE reassembly is highly organized in telophase (Fig. 2g 1e 2j, k 2l–n 2h 25 2o–s 1a 2t 32 34 2u 2u 35 36 2i 2v Repair of mitotic DNA damage by TMEJ ameliorates NERD In addition to NERD, RS also triggers DNA damage and repair synthesis through MiDAS or TMEJ pathways in early mitosis (Fig. 3a MUS81 POLD3 POLQ 3a, b 3c 3b POLQ 3b 37 39 POLQ 3d POLQ−/− 3e–g POLQ−/− 3c POLQ−/− 3d 3h Fig. 3 Mitotic DNA repair by TMEJ suppresses NERD. a b N c POLQ−/− N d POLQ−/− N e POLQ−/− N f g h g POLQ−/− N h POLQ−/− N p- t n Next, we explored whether the increased NE defect in POLQ−/− POLQ−/− POLQ−/− 3e 3i 3f POLQ−/− 3g 3h 3j 3k POLQ−/− 3l 40 POLQ 3b–d POLQ 3m RS could cause loss of LADs at CFSs The meshwork-like nuclear lamina not only safeguards the NE against mechanical stress but also provides a scaffold for chromatin binding, interacting with hundreds of large genomic regions known as lamina-associated domains (LADs) 41 4a–c 4d 1 RE S S LADs 4a Fig. 4 RS-induced NERD disrupts interaction between NE and LADs. a b a b c d e f FRA1A g FRA1A h i j k l m POLQ−/− n p- t n Since RS, such as APH treatment, induces the “expression” and fragility of the common fragile sites (CFSs) in the genome, we investigated whether RESSLADs were located in CFSs. Indeed, 99 RESSLADs (~28%) in RPE-1 cells were located in CFSs and 18 RESSLADs were colocalized with rare fragile sites (RFSs) (Fig. 4e FHIT 4b WWOX 4c 42 FRA1A FRA1A 4f FRA1A 4g 4d 1 4h, i 4j Finally, we investigated the potential consequences of such reduced RESSLADs-NE interaction. To do this, we examined the expression of genes in RESSLADs. Under APH treatment, the expression of genes ACOT7 GPR153 FRA1A SLURP1 LYNX1 LY6D FRA8D 4k 4l in POLQ−/− cells compared to the cells 4m Lamin A/C phosphorylation is sustained during NERD In mitosis, lamina proteins undergo phosphorylation during NE breakdown and dephosphorylation to facilitate LADs formation during NE reassembly 15 16 43 44 5a 5b 5a 5c 5c 5b Fig. 5 Sustained Lamin A/C phosphorylation during NERD. a n t b n N t c d e d n N t To further demonstrate the role of S22-Lamin A/C phosphorylation in NERD under RS, mutations of S22 were introduced to Lamin A with N-terminal RFP tag. The mutants were examined in HCT-116 cells by transient transfection. Compared to the Lamin A-WT (wild type), phospho-dead Lamin A-S22A mutant could still localize to BAF foci under RS (Fig. 5d 5e 5d, e 29 5c, d Prominent NE defect occurs under conditions of synthetic lethality Lastly, we investigated the effect of NERD on clinical implications. RS can activate ATR (Ataxia-Telangiectasia Mutated and Rad3-related protein kinase) to maintain replication fork stability and checkpoint function 45 46 6a, b 6c Fig. 6 Prominent NE defect occurs under conditions of synthetic lethality. a b a n N t c n d BRCA2−/− BRCA2−/− e BRCA2−/− n N t p p p p f BRCA2−/− n g BRCA2−/− h BRCA2−/− n N t p p p p i BRCA2−/− n a d g Because poly(ADP-ribose) polymerase (PARP) inhibitors (PARP-i) induce death of cells deficient in homologous recombination (HR) 47 BRCA2−/− BRCA2 6a BRCA2−/− 6b, c 6d BRCA2−/− 6e, f 6g BRCA2−/− 6d BRCA2−/− 6d, e 6f Interestingly, DNA polymerase Polθ and the TMEJ pathway also show synthetic lethality with BRCA2 48 BRCA2−/− BRCA2−/− 6g, h 6i BRCA2−/− 6i Finally, we examined the consequence particularly cellular metabolisms in cells with RS-induced NE defect. The results showed that the APH-treated group showed elongated mitochondria. In the same population, cells with BAF foci had significantly longer mitochondria than those without BAF foci (Supplementary Fig. 6h 6i Discussion Studies of RS have predominantly focused on DNA damage response and genome instability, with limited exploration on its effects on cellular structures such as the nuclear envelope. Here, we establish a link between genome instability and NE defect under RS using multiple reporters of NE integrity. The baselines of NE defect varied in different reporters, reflecting their intrinsic noise and limitations. Notably, the endogenous BAF staining and RFP-NLS GFP-BAF dual reporter both show ~1% NE defect, which is consistent with the reported large datasets with endogenous BAF staining 49 29 7 Fig. 7 Model of mitotic DNA repair by TMEJ in suppressing RS-induced NERD. In WT cells, Lamin A/C phosphorylation by CDK1 in prophase triggers NE breakdown, and its dephosphorylation in telophase allows the reassembly of NE with normal LADs (top). Under replication stress, TMEJ actively repairs mitotic DNA damage, rescues NE reassembly and ameliorates NERD (middle). However, with POLQ As a result of RS, the mitotic entry of replication machinery causes the disassembly of the replisome and exposure of under-replicated DNA to nucleases, resulting in DSBs 4 8 50 51 8 52 53 MUS81 POLD3 3c 3b 14 54 During NE breakdown in prophase, inner nuclear membrane proteins, including Lamin A/C, undergo progressive phosphorylation. Phosphorylation of S22 and S392 of Lamin A/C by CDK1/Cyclin B leads to Lamin A/C depolymerization and release of chromatin binding 55 56 7 57 25 58 59 The identification of RESSLADs and their overlap with CFSs highlights the potential changes in chromatin structure and gene transcription under RS. The distribution of RESSLADs to non-CFS regions suggested that RS induces a broader effect on the whole genome, not limited to CFSs. As CFSs vary across different cell lines 42 60 16 61 62 63 64 65 7 59 66 67 68 In summary, these findings not only enhance our understanding of NE dynamics in response to RS, but also open avenues for therapeutic strategies targeting NE vulnerability in cancer and other genome instability-related diseases. Methods Cell culture All cells were cultured at 37 °C in a humidified atmosphere containing 5% CO 2 For synchronization assays, RPE-1 cells were treated with 9 μM CDK inhibitor (CDK-i) RO-3306 (Beyotime, Cat. #SC6673-10mM) for 8 or 16 h for G2 arrest. HeLa cells were treated with 2 mM thymidine for 14 h followed by 330 nM nocodazole for 10 h to arrest cells in M phase. The cell cycle was confirmed by immunoblotting of specific markers. DDK inhibitor (DDK-i) PHA-767491 (MCE, Cat. #HY-13461) was used to inhibit DNA replication initiation. DNA construction and transfection To construct RFP fusion plasmids, LEM1 MAN1 Emerin Ankle1 Ankle2 LEM2 LAPβ Lamin A To construct dual sgRNA expression vectors for CRISPR-Cas9 system, PCR fragments with sgRNA sequences flanking the dual H1 & U6 promoters were cloned into pLenti-CRISPRv2-2×Scaffold vector (modified from pLenti-CRISPRv2) through type II DNA endonuclease Esp3I sites. More details can be shared upon request. All vectors were verified by Sanger sequencing. All oligonucleotides and plasmids used in this study refer to Supplementary Data 2 3 DNA constructs were transfected into cells using Lipo8000 (Beyotime, Cat. #C0533) or Lipofectamine 2000 (Thermo Fisher Scientific, Cat. #11668019) according to the manufacturer’s instructions. Virus packaging and construction of stable cell lines HEK293FT cells were seeded in a 6-well plate at 70-80% confluence and incubated overnight to allow for cell attachment. Packaging plasmids (pMD2.G and psPAX2 for lentivirus, gag/pol and pVSV-G for retrovirus) together with a target viral vector were transfected into the HEK293FT using Lipofectamine 2000 according to the manufacturer’s instructions. After an overnight incubation, the medium was replaced with 3 mL of fresh medium. The culture media were collected twice, at 48 h and 72 h post transfection, respectively, and filtered through a 0.45 μm syringe filter. Stable cell lines were generated by transduction with lentivirus or retrovirus carrying the genes of interest. RPE-1 TP53−/− 4 Live cell imaging and time-lapse movie For live cell imaging, cells were seeded onto glass-bottomed 35-mm imaging dishes (NEST, Cat. #801001) or 24-well plates (Cellvis, Cat. #P24-1.5 P) overnight. CKX53 inverted microscope (OLYMPUS, Japan) and NHQLive TM For live cell time-lapse imaging in Fig. 2d 2 Immunofluorescence Cells were grown on coverslips, treated with indicated reagents and fixed using 4% paraformaldehyde for 20 min at room temperature. Coverslips were washed twice with PBS buffer, permeabilized with 0.5% Triton X-100 for 5 min, followed by blocking with 3% BSA in PBS buffer for 1 h. Primary antibody incubation was performed in PBS buffer with 3% BSA overnight at 4 °C. After washing 3 times with PBS buffer containing 0.05% Triton X-100, secondary antibody staining was performed for 45–60 min in dark at room temperature. The coverslips were washed 3 times with 0.05% Triton X-100 in PBS, incubated with Hoechst 33342 in PBS buffer for 10 min at room temperature, and then followed by washing 3 times with PBS. SlowFade Diamond Antifade (Thermo Fisher Scientific, Cat. # S36963 Ultra-fine bridge was detected by using anti-RPA. Cells were synchronized in late G2 (using 9 μM RO-3306) and then released into fresh medium (pre-warmed to 37 °C) for 30 min. Metaphase cells were then harvested by mitotic shake-off and centrifugation at 600 g for 5 min. Pelleted cells were re-seeded onto coverslips coated with Poly-D-lysine (Beyotime, Cat. #ST508) and incubated at 37 °C in an atmosphere of 5% CO 2 5 EdU labelling For mitotic EdU labelling, cells were pulse labelled using 20 μM EdU for 0.5 h after cells were released into mitosis. For S-phase labelling, cells were labelled with 10 μM EdU for 2 h before analysis. Simultaneous fixation and permeabilization were performed using 0.5% Triton X-100, followed by EdU detection using Click chemistry according to manufacturer’s instructions (BeyoClick™ EdU Cell Proliferation Kit, Beyotime, Cat. #C0085S). SlowFade Diamond Antifade (Thermo Fisher Scientific, Cat. # S36963 Electronic Microscopy RPE-1 cells with or without 0.4 μM APH treatment were fixed with 2.5% glutaraldehyde in 0.1 M phosphate buffer, pH 7.4 for 2 h at room temperature. After washing 3 times with 0.1 M phosphate buffer, cells were scraped and collected with 0.1 M phosphate buffer followed by centrifugation at 1000 g. The pellet was resuspended in 0.1 M phosphate buffer, and centrifuged at 1000 g for 10 min. This step was repeated three times. The samples were post-fixed with pre-cold 1% OsO 4 69 Western blot Cells were washed once with PBS buffer and lysed in RIPA buffer supplemented with PMSF. The mixture was incubated on the ice for 30 min, followed by centrifugation 15,000 g for 30 min at 4 °C. The supernatant was mixed with 4xSDS loading buffer and heated at 95 °C for 10 min. The samples were separated by SDS-PAGE gel and proteins were transferred to nitrocellulose membrane. The membrane was blocked in TBST buffer with 5% non-fat milk or 3% BSA at room temperature for 1 h before incubation with a primary antibody diluted in TBST buffer containing 3% BSA at 4 °C overnight. After washing with TBST buffer 3 times, the membrane was incubated with indicated secondary antibodies. Finally, Images were captured using LiCOR Odyssey Imaging Systems (LiCOR, USA) or ChemiDoc MP Imaging system (Bio-Rad) and quantified using ImageJ. Primary antibodies were used as follows: rabbit anti-Lamin A/C (CST, Cat. #2032, 1:1000); mouse anti-Lamin B1 (Sangon Biotech, Cat. #D190800-0100, 1:1000); rabbit anti-H2AX p-S139 (CST, Cat. #2577 L, 1:1000); rabbit anti-pS22-Lamin A/C (CST, Cat. #13448, 1:1000); rabbit anti-GAPDH (Abcam, Cat. #ab9485, 1: 5000); mouse anti-GAPDH (Abbkine, Cat. #A01020, 1: 5000); Rabbit anti-pS10-H3 (Abcam, Cat. #ab30127); Rabbit anti-BAF (Sangon Biotech, Cat. #D290148, 1:1000); Rabbit anti-POLD3 (ProteinTech, Cat. #21935-1-AP, 1:1000); Mouse anti-MUS81 (ProteinTech, Cat. #67351-1-Ig, 1:10000); Rabbit anti-Geminin (Abclonal, Cat. #A25819, 1:1000); Rabbit anti-CDT1 (Abcam, Cat. #ab202067, 1:1000); Mouse anti-alpha-tubulin (ProteinTech, Cat. #66031-1-Ig, 1:10000). Secondary antibodies were used as follows: donkey anti-rabbit IRDye 680RD (Li-COR, Cat. #926-68073, 1:10000); donkey anti-mouse IRDye 800CW (Li-COR, Cat. #926-32212, 1:10000); HRP-Goat anti-Rabbit antibody (Sangon Biotech, Cat. #D110058, 1:10000); HRP-Goat anti-mouse antibody (Sangon Biotech, Cat. #D110087, 1:10000). For quantification, GAPDH or alpha tubulin were used as internal control. For antibodies used in this study refer to Supplementary Data 5 RNA interference For RNAi knockdown experiments, cells were transfected with indicated siRNAs using Lipofectamine RNAiMAX Transfection Reagent (Thermo Fisher Scientific, Cat. #13778150) according to the manufacturer’s instructions. Samples were collected after 48–72 h post transfection. MUS81 POLD3 POLQ 2 Quantitative RT-PCR Total RNA was extracted using a FastPure Cell/Tissue total RNA isolation kit (Vazyme, Cat. #RC112-01) according to the manufacturer’s instructions. cDNA was synthesized using the first Strand cDNA Synthesis SuperMix for qPCR Kit (Yeasen, Cat. #11141ES60) following the manufacturer’s instruction. GAPDH was used as internal control. Real-time PCR was performed using a qPCR SYBR Green Master Mix (Yeasen, Cat. #11201ES08) on a CFX96 real-time system (Bio-Rad). Relative mRNA expression was calculated as 2 −∆∆Ct 2 Comet assays The comet assay was performed as previously described in ref. 70 5 −1 Mitotic DNA synthesis (MiDAS) and mitotic DNA damage The MiDAS assay was performed as previously described in ref. 8 C10638 2 C10638 Cell death analysis Flow cytometric analysis was conducted to assess the cell fate of POLQ CRISPR-Cas9-mediated gene editing To knock out genes, RPE-1 TP53 https://www.synthego.com/products/bioinformatics/crispr-analysis To generate POLQ POLQ 71 BRCA2 71 2 Cell proliferation and viability assay To detect cell proliferation, 1000 cells are seeded per well in 96-well plate and imaged using 10x (NA = 0.7) objective lens in the IncuCyte system (Sartorius, Germany). Phase contrast images were collected every 3 h in one week to calculate the confluence automatically according to the manufacturer’s instructions 72 CUT&Tag assay and sequencing CUT&Tag (cleavage under targets and tagmentation) was performed using Hieff NGS® G-Type In-Situ DNA Binding Profiling Library Prep Kit (Yeasen, Cat. #12598ES48) against Lamin A/C and Lamin B1 following the manufacture’ s instruction. Briefly, for each sample, 1 × 10 5 For library amplification, 8 μL of DNA was mixed with a uniquely barcoded i5 and a uniquely barcoded i7 primer, and amplified using 2x Ultima Amplification (Yeasen, Cat. #12598ES48). The library was then purified using DNA-selection beads and washed twice with 80% ethanol and eluted in 21 μL ultrapure water. Libraries were sequenced by Berry Genomic (Beijing, China) on an Illumina NovaSeq platform for 10 G per sample and 150-bp paired-end reads were generated. CUT&Tag data analysis Raw sequencing reads were first preprocessed using Ktrim software 73 74 75 p 76 Identification of RESSLADs We first stitched the peaks in the Lamin A/C or Lamin B1 that were less than 20 kb in distance and only kept those longer than 100 kb after stitching. For each kept peak after stitching, we extracted the read numbers in the CUT&Tag experiments, which were further normalized using the clean read count of the corresponding experiments. The normalized read counts were compared between DMSO and APH experiments using t p p Chromatin immunoprecipitation (ChIP)-qPCR Chromatin immunoprecipitation was performed using a ChIP Assay Kit (Beyotime, Cat. #P2078) following the manufacture’ s instruction. Briefly, RPE-1 p53 p53 POLQ 3 2 For detection of mitotic DNA damage signal in RESSLADs by anti-γH2AX antibody, Hieff NGS® G-Type In-Situ DNA Binding Profiling Library Prep Kit (Yeasen, Cat. #12598ES48) was used following the manufacture’s instruction. Briefly, 1 × 10 5 2 Statistical analysis All statistical analyses were performed using GraphPad Prism 6. For bar graphs, results were shown as mean ± SD and the two-tailed unpaired Student’s t p 77 Reporting summary Further information on research design is available in the Nature Portfolio Reporting Summary Supplementary information  Supplementary Information Description of Additional Supplementary Files Supplementary Data 1 Supplementary Data 2-5 Supplementary Movie 1 Supplementary Movie 2 Reporting Summary Transparent Peer Review file Source data  Source Data Publisher’s note These authors contributed equally: Guojun Ye, Yide He. Supplementary information The online version contains supplementary material available at 10.1038/s41467-025-63942-w. Acknowledgements We thank members of the Deng and Ji laboratories for helpful discussions, David Pellman and Johannes Walter for valuable supports at the early stage of this study. We thank Yisui Xia, Lingluo Chu and Shangming Tang for critical reading of the manuscript. We thank Jian Liu, Shaohong Rao, and Chunzhuo Liu and the Bio-imaging Core Facility at SZBL, particularly Zhenglong Sun, Mei Yu and Shixian Huang for technical helps. This work is supported by the National Natural Science Foundation of China (32270779), Shenzhen Medical Research Funds (B2301007), National Key R&D Program of China (2022YFA1302800), Guangdong Special Support Plan (2023TQ07A226), Proof of Concept Fund of Shenzhen Bay Laboratory (C1022426003) and Shenzhen Bay Laboratory Start-up Fund (S201100001) to L.D., National Natural Science of China (22207131) to Y.H., Spark Trial Program from Bayjayray Inc. to Y.L. and National Natural Science of China (92354304; 32371343; 32122025) to W.J. Author contributions L.D. and G.Y. conceived the project and designed the experiments. G.Y. Y.H. Y.Z. D.L. W.C. Q.L.G. Q.G. S.H. and C.S. performed the experiments. F.L. H.Z. Q.P. and K.S. provided helps on CUT&Tag analysis. W.J. helped analyze the imaging data and provided valuable suggestions. G.Y. Y.H. Y.Z. Y.L. and L.D. interpreted the results and prepared the manuscript. Peer review Peer review information Nature Communications Data availability The CUT&Tag data generated in this study have been deposited in the GEO database under access sion code GSE271990 Source data Code availability The code used for the analysis of RESSLADs is available at the GitHub ( https://github.com/hellosunking/RESS-LADs 78 Competing interests The authors declare no competing interests. References 1. Macheret M Halazonetis TD DNA replication stress as a hallmark of cancer Annu Rev. Pathol. 2015 10 425 448 10.1146/annurev-pathol-012414-040424 25621662 Macheret, M. & Halazonetis, T. D. DNA replication stress as a hallmark of cancer. Annu Rev. Pathol. 10 25621662 10.1146/annurev-pathol-012414-040424 2. Techer H Koundrioukoff S Nicolas A Debatisse M The impact of replication stress on replication dynamics and DNA damage in vertebrate cells Nat. Rev. Genet 2017 18 535 550 10.1038/nrg.2017.46 28714480 Techer, H., Koundrioukoff, S., Nicolas, A. & Debatisse, M. The impact of replication stress on replication dynamics and DNA damage in vertebrate cells. Nat. Rev. Genet 18 28714480 10.1038/nrg.2017.46 3. Cortez D Preventing replication fork collapse to maintain genome integrity DNA Repair (Amst.) 2015 32 149 157 10.1016/j.dnarep.2015.04.026 25957489 PMC4522347 Cortez, D. Preventing replication fork collapse to maintain genome integrity. DNA Repair (Amst.) 32 25957489 10.1016/j.dnarep.2015.04.026 PMC4522347 4. Deng L Mitotic CDK Promotes Replisome Disassembly, Fork Breakage, and Complex DNA Rearrangements Mol. Cell 2019 73 915 929.e916 10.1016/j.molcel.2018.12.021 30849395 PMC6410736 Deng, L. et al. Mitotic CDK Promotes Replisome Disassembly, Fork Breakage, and Complex DNA Rearrangements. Mol. Cell 73 30849395 10.1016/j.molcel.2018.12.021 PMC6410736 5. Maciejowski J Li Y Bosco N Campbell Peter J de Lange T Chromothripsis and Kataegis Induced by Telomere Crisis Cell 2015 163 1641 1654 10.1016/j.cell.2015.11.054 26687355 PMC4687025 Maciejowski, J., Li, Y., Bosco, N., Campbell Peter, J. & de Lange, T. Chromothripsis and Kataegis Induced by Telomere Crisis. Cell 163 26687355 10.1016/j.cell.2015.11.054 PMC4687025 6. Zhang C-Z Chromothripsis from DNA damage in micronuclei Nature 2015 522 179 184 10.1038/nature14493 26017310 PMC4742237 Zhang, C.-Z. et al. Chromothripsis from DNA damage in micronuclei. Nature 522 26017310 10.1038/nature14493 PMC4742237 7. Hustedt N Durocher D The control of DNA repair by the cell cycle Nat. Cell Biol. 2016 19 1 9 10.1038/ncb3452 28008184 Hustedt, N. & Durocher, D. The control of DNA repair by the cell cycle. Nat. Cell Biol. 19 28008184 10.1038/ncb3452 8. Minocherhomji S Replication stress activates DNA repair synthesis in mitosis Nature 2015 528 286 290 10.1038/nature16139 26633632 Minocherhomji, S. et al. Replication stress activates DNA repair synthesis in mitosis. Nature 528 26633632 10.1038/nature16139 9. Bhowmick R Minocherhomji S Hickson ID RAD52 Facilitates Mitotic DNA Synthesis Following Replication Stress Mol. Cell 2016 64 1117 1126 10.1016/j.molcel.2016.10.037 27984745 Bhowmick, R., Minocherhomji, S. & Hickson, I. D. RAD52 Facilitates Mitotic DNA Synthesis Following Replication Stress. Mol. Cell 64 27984745 10.1016/j.molcel.2016.10.037 10. Rogers CB Fanconi anemia-associated chromosomal radial formation is dependent on POLθ-mediated alternative end joining Cell Rep. 2023 42 112428 10.1016/j.celrep.2023.112428 37086407 PMC10321316 Rogers, C. B. et al. Fanconi anemia-associated chromosomal radial formation is dependent on POLθ-mediated alternative end joining. Cell Rep. 42 37086407 10.1016/j.celrep.2023.112428 PMC10321316 11. Heijink AM Sister chromatid exchanges induced by perturbed replication can form independently of BRCA1, BRCA2 and RAD51 Nat. Commun. 2022 13 6722 10.1038/s41467-022-34519-8 36344511 PMC9640580 Heijink, A. M. et al. Sister chromatid exchanges induced by perturbed replication can form independently of BRCA1, BRCA2 and RAD51. Nat. Commun. 13 36344511 10.1038/s41467-022-34519-8 PMC9640580 12. Brambati, A. et al. RHINO directs MMEJ to repair DNA breaks in mitosis. Science 381 10.1126/science.adh3694 PMC10561558 37440612 13. Mateos-Gomez PA Mammalian polymerase θ promotes alternative NHEJ and suppresses recombination Nature 2015 518 254 257 10.1038/nature14157 25642960 PMC4718306 Mateos-Gomez, P. A. et al. Mammalian polymerase θ promotes alternative NHEJ and suppresses recombination. Nature 518 25642960 10.1038/nature14157 PMC4718306 14. Wilson, T. E., Ahmed, S., Winningham, A. & Glover, T. W. Replication stress induces POLQ-mediated structural variant formation throughout common fragile sites after entry into mitosis. Nat. Commun. 15 10.1038/s41467-024-53917-8 PMC11541566 39505880 15. Huguet F Gokan E Foster HA Amin HA Vagnarelli P Repo-Man/protein phosphatase 1 SUMOylation mediates binding to lamin A and serine 22 dephosphorylation Open Biol. 2022 12 220017 10.1098/rsob.220017 35414260 PMC9006038 Huguet, F., Gokan, E., Foster, H. A., Amin, H. A. & Vagnarelli, P. Repo-Man/protein phosphatase 1 SUMOylation mediates binding to lamin A and serine 22 dephosphorylation. Open Biol. 12 35414260 10.1098/rsob.220017 PMC9006038 16. van Steensel B Belmont AS Lamina-Associated Domains: Links with Chromosome Architecture, Heterochromatin, and Gene Repression Cell 2017 169 780 791 10.1016/j.cell.2017.04.022 28525751 PMC5532494 van Steensel, B. & Belmont, A. S. Lamina-Associated Domains: Links with Chromosome Architecture, Heterochromatin, and Gene Repression. Cell 169 28525751 10.1016/j.cell.2017.04.022 PMC5532494 17. Liu S Nuclear envelope assembly defects link mitotic errors to chromothripsis Nature 2018 561 551 555 10.1038/s41586-018-0534-z 30232450 PMC6599625 Liu, S. et al. Nuclear envelope assembly defects link mitotic errors to chromothripsis. Nature 561 30232450 10.1038/s41586-018-0534-z PMC6599625 18. Ungricht R Kutay U Mechanisms and functions of nuclear envelope remodelling Nat. Rev. Mol. Cell Biol. 2017 18 229 245 10.1038/nrm.2016.153 28120913 Ungricht, R. & Kutay, U. Mechanisms and functions of nuclear envelope remodelling. Nat. Rev. Mol. Cell Biol. 18 28120913 10.1038/nrm.2016.153 19. Haraguchi T Live cell imaging and electron microscopy reveal dynamic processes of BAF-directed nuclear envelope assembly J. Cell Sci. 2008 121 2540 2554 10.1242/jcs.033597 18628300 Haraguchi, T. et al. Live cell imaging and electron microscopy reveal dynamic processes of BAF-directed nuclear envelope assembly. J. Cell Sci. 121 18628300 10.1242/jcs.033597 20. von Appen A LEM2 phase separation promotes ESCRT-mediated nuclear envelope reformation Nature 2020 582 115 118 10.1038/s41586-020-2232-x 32494070 PMC7321842 von Appen, A. et al. LEM2 phase separation promotes ESCRT-mediated nuclear envelope reformation. Nature 582 32494070 10.1038/s41586-020-2232-x PMC7321842 21. Cho S Mechanosensing by the Lamina Protects against Nuclear Rupture, DNA Damage, and Cell-Cycle Arrest Dev. Cell 2019 49 920 935.e925 10.1016/j.devcel.2019.04.020 31105008 PMC6581604 Cho, S. et al. Mechanosensing by the Lamina Protects against Nuclear Rupture, DNA Damage, and Cell-Cycle Arrest. Dev. Cell 49 31105008 10.1016/j.devcel.2019.04.020 PMC6581604 22. Earle AJ Mutant lamins cause nuclear envelope rupture and DNA damage in skeletal muscle cells Nat. Mater. 2020 19 464 473 10.1038/s41563-019-0563-5 31844279 PMC7102937 Earle, A. J. et al. Mutant lamins cause nuclear envelope rupture and DNA damage in skeletal muscle cells. Nat. Mater. 19 31844279 10.1038/s41563-019-0563-5 PMC7102937 23. Nader GPF Compromised nuclear envelope integrity drives TREX1-dependent DNA damage and tumor cell invasion Cell 2021 184 5230 5246.e5222 10.1016/j.cell.2021.08.035 34551315 Nader, G. P. F. et al. Compromised nuclear envelope integrity drives TREX1-dependent DNA damage and tumor cell invasion. Cell 184 34551315 10.1016/j.cell.2021.08.035 24. Sheaff R Ilsley D Kuchta R Mechanism of DNA polymerase alpha inhibition by aphidicolin Biochemistry 1991 30 8590 8597 10.1021/bi00099a014 1909569 Sheaff, R., Ilsley, D. & Kuchta, R. Mechanism of DNA polymerase alpha inhibition by aphidicolin. Biochemistry 30 1909569 10.1021/bi00099a014 25. Halfmann CT Repair of nuclear ruptures requires barrier-to-autointegration factor J. Cell Biol. 2019 218 2136 2149 10.1083/jcb.201901116 31147383 PMC6605789 Halfmann, C. T. et al. Repair of nuclear ruptures requires barrier-to-autointegration factor. J. Cell Biol. 218 31147383 10.1083/jcb.201901116 PMC6605789 26. Xu B Replication stress induces micronuclei comprising of aggregated DNA double-strand breaks PLoS One 2011 6 e18618 10.1371/journal.pone.0018618 21525980 PMC3078113 Xu, B. et al. Replication stress induces micronuclei comprising of aggregated DNA double-strand breaks. PLoS One 6 21525980 10.1371/journal.pone.0018618 PMC3078113 27. Di Micco R Oncogene-induced senescence is a DNA damage response triggered by DNA hyper-replication Nature 2006 444 638 642 10.1038/nature05327 17136094 Di Micco, R. et al. Oncogene-induced senescence is a DNA damage response triggered by DNA hyper-replication. Nature 444 17136094 10.1038/nature05327 28. Segeren HA van Liere EA Riemers FM de Bruin A Westendorp B Oncogenic RAS sensitizes cells to drug-induced replication stress via transcriptional silencing of P53 Oncogene 2022 41 2719 2733 10.1038/s41388-022-02291-0 35393546 PMC9076537 Segeren, H. A., van Liere, E. A., Riemers, F. M., de Bruin, A. & Westendorp, B. Oncogenic RAS sensitizes cells to drug-induced replication stress via transcriptional silencing of P53. Oncogene 41 35393546 10.1038/s41388-022-02291-0 PMC9076537 29. Kovacs MT DNA damage induces nuclear envelope rupture through ATR-mediated phosphorylation of lamin A/C Mol. Cell 2023 83 3659 3668.e3610 10.1016/j.molcel.2023.09.023 37832547 PMC10597398 Kovacs, M. T. et al. DNA damage induces nuclear envelope rupture through ATR-mediated phosphorylation of lamin A/C. Mol. Cell 83 37832547 10.1016/j.molcel.2023.09.023 PMC10597398 30. Vassilev LT Selective small-molecule inhibitor reveals critical mitotic functions of human CDK1 Proc. Natl Acad. Sci. USA 2006 103 10660 10665 10.1073/pnas.0600447103 16818887 PMC1502288 Vassilev, L. T. et al. Selective small-molecule inhibitor reveals critical mitotic functions of human CDK1. Proc. Natl Acad. Sci. USA 103 16818887 10.1073/pnas.0600447103 PMC1502288 31. Montagnoli A A Cdc7 kinase inhibitor restricts initiation of DNA replication and has antitumor activity Nat. Chem. Biol. 2008 4 357 365 10.1038/nchembio.90 18469809 Montagnoli, A. et al. A Cdc7 kinase inhibitor restricts initiation of DNA replication and has antitumor activity. Nat. Chem. Biol. 4 18469809 10.1038/nchembio.90 32. Wilhelm T Mild replication stress causes chromosome mis-segregation via premature centriole disengagement Nat. Commun. 2019 10 3585 10.1038/s41467-019-11584-0 31395887 PMC6687892 Wilhelm, T. et al. Mild replication stress causes chromosome mis-segregation via premature centriole disengagement. Nat. Commun. 10 31395887 10.1038/s41467-019-11584-0 PMC6687892 33. Burrell RA Replication stress links structural and numerical cancer chromosomal instability Nature 2013 494 492 496 10.1038/nature11935 23446422 PMC4636055 Burrell, R. A. et al. Replication stress links structural and numerical cancer chromosomal instability. Nature 494 23446422 10.1038/nature11935 PMC4636055 34. Somyajit K Redox-sensitive alteration of replisome architecture safeguards genome integrity Science 2017 358 797 802 10.1126/science.aao3172 29123070 Somyajit, K. et al. Redox-sensitive alteration of replisome architecture safeguards genome integrity. Science 358 29123070 10.1126/science.aao3172 35. Chu Q Oligomeric CHMP7 mediates three-way ER junctions and ER-mitochondria interactions Cell Death Differ. 2022 30 94 110 10.1038/s41418-022-01048-2 35962186 PMC9883271 Chu, Q. et al. Oligomeric CHMP7 mediates three-way ER junctions and ER-mitochondria interactions. Cell Death Differ. 30 35962186 10.1038/s41418-022-01048-2 PMC9883271 36. Gu M LEM2 recruits CHMP7 for ESCRT-mediated nuclear envelope closure in fission yeast and human cells Proc. Natl Acad. Sci. USA 2017 114 E2166 e2175 10.1073/pnas.1613916114 28242692 PMC5358359 Gu, M. et al. LEM2 recruits CHMP7 for ESCRT-mediated nuclear envelope closure in fission yeast and human cells. Proc. Natl Acad. Sci. USA 114 28242692 10.1073/pnas.1613916114 PMC5358359 37. Lai X MUS81 nuclease activity is essential for replication stress tolerance and chromosome segregation in BRCA2-deficient cells Nat. Commun. 2017 8 15983 10.1038/ncomms15983 28714477 PMC5520020 Lai, X. et al. MUS81 nuclease activity is essential for replication stress tolerance and chromosome segregation in BRCA2-deficient cells. Nat. Commun. 8 28714477 10.1038/ncomms15983 PMC5520020 38. Pepe A West Stephen C MUS81-EME2 Promotes Replication Fork Restart Cell Rep. 2014 7 1048 1055 10.1016/j.celrep.2014.04.007 24813886 PMC5092538 Pepe, A. & West Stephen, C. MUS81-EME2 Promotes Replication Fork Restart. Cell Rep. 7 24813886 10.1016/j.celrep.2014.04.007 PMC5092538 39. Tan Q Xu X MUS81 UFMylation at K400 promotes cell survival in response to camptothecin-induced replication stress Genome Instab. Dis. 2024 5 154 163 10.1007/s42764-024-00132-w Tan, Q. & Xu, X. MUS81 UFMylation at K400 promotes cell survival in response to camptothecin-induced replication stress. Genome Instab. Dis. 5 40. Xing M Replication Stress Induces ATR/CHK1-Dependent Nonrandom Segregation of Damaged Chromosomes Mol. Cell 2020 78 714 724.e715 10.1016/j.molcel.2020.04.005 32353258 Xing, M. et al. Replication Stress Induces ATR/CHK1-Dependent Nonrandom Segregation of Damaged Chromosomes. Mol. Cell 78 32353258 10.1016/j.molcel.2020.04.005 41. Berman BP Regions of focal DNA hypermethylation and long-range hypomethylation in colorectal cancer coincide with nuclear lamina-associated domains Nat. Genet 2011 44 40 46 10.1038/ng.969 22120008 PMC4309644 Berman, B. P. et al. Regions of focal DNA hypermethylation and long-range hypomethylation in colorectal cancer coincide with nuclear lamina-associated domains. Nat. Genet 44 22120008 10.1038/ng.969 PMC4309644 42. Boteva, L. et al. Common Fragile Sites Are Characterized by Faulty Condensin Loading after Replication Stress. Cell Rep. 32 10.1016/j.celrep.2020.108177 PMC7511797 32966795 43. Liu S Phosphorylation of Lamin A/C regulates the structural integrity of the nuclear envelope J. Biol. Chem. 2025 301 108033 10.1016/j.jbc.2024.108033 39615679 PMC11731451 Liu, S. et al. Phosphorylation of Lamin A/C regulates the structural integrity of the nuclear envelope. J. Biol. Chem. 301 39615679 10.1016/j.jbc.2024.108033 PMC11731451 44. Heald R McKeon F Mutations of phosphorylation sites in lamin A that prevent nuclear lamina disassembly in mitosis Cell 1990 61 579 589 10.1016/0092-8674(90)90470-Y 2344612 Heald, R. & McKeon, F. Mutations of phosphorylation sites in lamin A that prevent nuclear lamina disassembly in mitosis. Cell 61 2344612 10.1016/0092-8674(90)90470-y 45. Toledo LI ATR prohibits replication catastrophe by preventing global exhaustion of RPA Cell 2013 155 1088 1103 10.1016/j.cell.2013.10.043 24267891 Toledo, L. I. et al. ATR prohibits replication catastrophe by preventing global exhaustion of RPA. Cell 155 24267891 10.1016/j.cell.2013.10.043 46. Pang Y Synthetic lethality in personalized cancer therapy Genome Instab. Dis. 2022 4 121 135 10.1007/s42764-022-00080-3 Pang, Y. et al. Synthetic lethality in personalized cancer therapy. Genome Instab. Dis. 4 47. Zatreanu D Polθ inhibitors elicit BRCA-gene synthetic lethality and target PARP inhibitor resistance Nat. Commun. 2021 12 3636 10.1038/s41467-021-23463-8 34140467 PMC8211653 Zatreanu, D. et al. Polθ inhibitors elicit BRCA-gene synthetic lethality and target PARP inhibitor resistance. Nat. Commun. 12 34140467 10.1038/s41467-021-23463-8 PMC8211653 48. Ceccaldi R Homologous-recombination-deficient tumours are dependent on Polθ-mediated repair Nature 2015 518 258 262 10.1038/nature14184 25642963 PMC4415602 Ceccaldi, R. et al. Homologous-recombination-deficient tumours are dependent on Polθ-mediated repair. Nature 518 25642963 10.1038/nature14184 PMC4415602 49. Coy, S. et al. 2D and 3D multiplexed subcellular profiling of nuclear instability in human cancer. Preprint at bioRxiv. 10.1101/2023.11.07.566063 (2023). 50. Ying S MUS81 promotes common fragile site expression Nat. Cell Biol. 2013 15 1001 1007 10.1038/ncb2773 23811685 Ying, S. et al. MUS81 promotes common fragile site expression. Nat. Cell Biol. 15 23811685 10.1038/ncb2773 51. Terasawa M Shinohara A Shinohara M Double-strand break repair-adox: Restoration of suppressed double-strand break repair during mitosis induces genomic instability Cancer Sci. 2014 105 1519 1525 10.1111/cas.12551 25287622 PMC4317954 Terasawa, M., Shinohara, A. & Shinohara, M. Double-strand break repair-adox: Restoration of suppressed double-strand break repair during mitosis induces genomic instability. Cancer Sci. 105 25287622 10.1111/cas.12551 PMC4317954 52. Wu W Mitotic DNA synthesis in response to replication stress requires the sequential action of DNA polymerases zeta and delta in human cells Nat. Commun. 2023 14 706 10.1038/s41467-023-35992-5 36759509 PMC9911744 Wu, W. et al. Mitotic DNA synthesis in response to replication stress requires the sequential action of DNA polymerases zeta and delta in human cells. Nat. Commun. 14 36759509 10.1038/s41467-023-35992-5 PMC9911744 53. Groelly FJ Mitotic DNA synthesis is caused by transcription-replication conflicts in BRCA2-deficient cells Mol. Cell 2022 82 3382 3397.e3387 10.1016/j.molcel.2022.07.011 36002001 PMC9631240 Groelly, F. J. et al. Mitotic DNA synthesis is caused by transcription-replication conflicts in BRCA2-deficient cells. Mol. Cell 82 36002001 10.1016/j.molcel.2022.07.011 PMC9631240 54. Chandramouly G Polλ promotes microhomology-mediated end-joining Nat. Struct. Mol. Biol. 2023 30 107 114 10.1038/s41594-022-00895-4 36536104 PMC10197178 Chandramouly, G. et al. Polλ promotes microhomology-mediated end-joining. Nat. Struct. Mol. Biol. 30 36536104 10.1038/s41594-022-00895-4 PMC10197178 55. Gerace L Blobel G The nuclear envelope lamina is reversibly depolymerized during mitosis Cell 1980 19 277 287 10.1016/0092-8674(80)90409-2 7357605 Gerace, L. & Blobel, G. The nuclear envelope lamina is reversibly depolymerized during mitosis. Cell 19 7357605 10.1016/0092-8674(80)90409-2 56. Georgatos SD Pyrpasopoulou A Theodoropoulos PA Nuclear envelope breakdown in mammalian cells involves stepwise lamina disassembly and microtubule-drive deformation of the nuclear membrane J. Cell Sci. 1997 110 2129 2140 10.1242/jcs.110.17.2129 9378763 Georgatos, S. D., Pyrpasopoulou, A. & Theodoropoulos, P. A. Nuclear envelope breakdown in mammalian cells involves stepwise lamina disassembly and microtubule-drive deformation of the nuclear membrane. J. Cell Sci. 110 9378763 10.1242/jcs.110.17.2129 57. Joo YK ATR promotes clearance of damaged DNA and damaged cells by rupturing micronuclei Mol. Cell 2023 83 3642 3658.e3644 10.1016/j.molcel.2023.09.003 37788673 PMC10599252 Joo, Y. K. et al. ATR promotes clearance of damaged DNA and damaged cells by rupturing micronuclei. Mol. Cell 83 37788673 10.1016/j.molcel.2023.09.003 PMC10599252 58. Young AM Gunn AL Hatch EM BAF facilitates interphase nuclear membrane repair through recruitment of nuclear transmembrane proteins Mol. Biol. Cell 2020 31 1551 1560 10.1091/mbc.E20-01-0009 32459568 PMC7521799 Young, A. M., Gunn, A. L. & Hatch, E. M. BAF facilitates interphase nuclear membrane repair through recruitment of nuclear transmembrane proteins. Mol. Biol. Cell 31 32459568 10.1091/mbc.E20-01-0009 PMC7521799 59. Kono Y Nucleoplasmic lamin C rapidly accumulates at sites of nuclear envelope rupture with BAF and cGAS J. Cell Biol. 2022 221 e202201024 10.1083/jcb.202201024 36301259 PMC9617480 Kono, Y. et al. Nucleoplasmic lamin C rapidly accumulates at sites of nuclear envelope rupture with BAF and cGAS. J. Cell Biol. 221 36301259 10.1083/jcb.202201024 PMC9617480 60. Macheret M High-resolution mapping of mitotic DNA synthesis regions and common fragile sites in the human genome through direct sequencing Cell Res. 2020 30 997 1008 10.1038/s41422-020-0358-x 32561860 PMC7784693 Macheret, M. et al. High-resolution mapping of mitotic DNA synthesis regions and common fragile sites in the human genome through direct sequencing. Cell Res. 30 32561860 10.1038/s41422-020-0358-x PMC7784693 61. Amiad-Pavlov, D. et al. Live imaging of chromatin distribution reveals novel principles of nuclear architecture and chromatin compartmentalization. Sci Adv 7 10.1126/sciadv.abf6251 PMC8172175 34078602 62. Zheng X Lamins Organize the Global Three-Dimensional Genome from the Nuclear Periphery Mol. Cell 2018 71 802 815. e807 10.1016/j.molcel.2018.05.017 30201095 PMC6886264 Zheng, X. et al. Lamins Organize the Global Three-Dimensional Genome from the Nuclear Periphery. Mol. Cell 71 30201095 10.1016/j.molcel.2018.05.017 PMC6886264 63. Ikegami K Secchia S Almakki O Lieb JD Moskowitz IP Phosphorylated Lamin A/C in the Nuclear Interior Binds Active Enhancers Associated with Abnormal Transcription in Progeria Dev. Cell 2020 52 699 713.e611 10.1016/j.devcel.2020.02.011 32208162 PMC7201903 Ikegami, K., Secchia, S., Almakki, O., Lieb, J. D. & Moskowitz, I. P. Phosphorylated Lamin A/C in the Nuclear Interior Binds Active Enhancers Associated with Abnormal Transcription in Progeria. Dev. Cell 52 32208162 10.1016/j.devcel.2020.02.011 PMC7201903 64. Cheedipudi SM Genomic Reorganization of Lamin-Associated Domains in Cardiac Myocytes Is Associated With Differential Gene Expression and DNA Methylation in Human Dilated Cardiomyopathy Circ. Res 2019 124 1198 1213 10.1161/CIRCRESAHA.118.314177 30739589 PMC6459729 Cheedipudi, S. M. et al. Genomic Reorganization of Lamin-Associated Domains in Cardiac Myocytes Is Associated With Differential Gene Expression and DNA Methylation in Human Dilated Cardiomyopathy. Circ. Res 124 30739589 10.1161/CIRCRESAHA.118.314177 PMC6459729 65. Wang Y Lamin A/C-dependent chromatin architecture safeguards naive pluripotency to prevent aberrant cardiovascular cell fate and function Nat. Commun. 2022 13 6663 10.1038/s41467-022-34366-7 36333314 PMC9636150 Wang, Y. et al. Lamin A/C-dependent chromatin architecture safeguards naive pluripotency to prevent aberrant cardiovascular cell fate and function. Nat. Commun. 13 36333314 10.1038/s41467-022-34366-7 PMC9636150 66. Denais CM Nuclear envelope rupture and repair during cancer cell migration Science 2016 352 353 358 10.1126/science.aad7297 27013428 PMC4833568 Denais, C. M. et al. Nuclear envelope rupture and repair during cancer cell migration. Science 352 27013428 10.1126/science.aad7297 PMC4833568 67. Le Berre M Aubertin J Piel M Fine control of nuclear confinement identifies a threshold deformation leading to lamina rupture and induction of specific genes Integr. Biol. (Camb.) 2012 4 1406 1414 10.1039/c2ib20056b 23038068 Le Berre, M., Aubertin, J. & Piel, M. Fine control of nuclear confinement identifies a threshold deformation leading to lamina rupture and induction of specific genes. Integr. Biol. (Camb.) 4 23038068 10.1039/c2ib20056b 68. Kochin V Interphase phosphorylation of lamin A J. Cell Sci. 2014 127 2683 2696 24741066 10.1242/jcs.141820 PMC4058112 Kochin, V. et al. Interphase phosphorylation of lamin A. J. Cell Sci. 127 24741066 10.1242/jcs.141820 PMC4058112 69. Kumar S Ciraolo G Hinge A Filippi MD An efficient and reproducible process for transmission electron microscopy (TEM) of rare cell populations J. Immunol. Methods 2014 404 87 90 10.1016/j.jim.2013.11.025 24291346 PMC3943659 Kumar, S., Ciraolo, G., Hinge, A. & Filippi, M. D. An efficient and reproducible process for transmission electron microscopy (TEM) of rare cell populations. J. Immunol. Methods 404 24291346 10.1016/j.jim.2013.11.025 PMC3943659 70. Olive PL Banáth JP The comet assay: a method to measure DNA damage in individual cells Nat. Protoc. 2006 1 23 29 10.1038/nprot.2006.5 17406208 Olive, P. L. & Banáth, J. P. The comet assay: a method to measure DNA damage in individual cells. Nat. Protoc. 1 17406208 10.1038/nprot.2006.5 71. Zhou J A first-in-class Polymerase Theta Inhibitor selectively targets Homologous-Recombination-Deficient Tumors Nat. Cancer 2021 2 598 610 10.1038/s43018-021-00203-x 34179826 PMC8224818 Zhou, J. et al. A first-in-class Polymerase Theta Inhibitor selectively targets Homologous-Recombination-Deficient Tumors. Nat. Cancer 2 34179826 10.1038/s43018-021-00203-x PMC8224818 72. Wolfe A O’Clair B Groppi VE McEwen DP Pharmacologic Characterization of a Kinetic In Vitro Human Co-Culture Angiogenesis Model Using Clinically Relevant Compounds SLAS Discov. 2013 18 1234 1245 10.1177/1087057113502085 24019254 Wolfe, A., O’Clair, B., Groppi, V. E. & McEwen, D. P. Pharmacologic Characterization of a Kinetic In Vitro Human Co-Culture Angiogenesis Model Using Clinically Relevant Compounds. SLAS Discov. 18 10.1177/1087057113502085 24019254 73. Sun K Ktrim: an extra-fast and accurate adapter- and quality-trimmer for sequencing data Bioinformatics 2020 36 3561 3562 10.1093/bioinformatics/btaa171 32159761 Sun, K. Ktrim: an extra-fast and accurate adapter- and quality-trimmer for sequencing data. Bioinformatics 36 32159761 10.1093/bioinformatics/btaa171 74. Langmead B Salzberg SL Fast gapped-read alignment with Bowtie 2 Nat. Methods 2012 9 357 359 10.1038/nmeth.1923 22388286 PMC3322381 Langmead, B. & Salzberg, S. L. Fast gapped-read alignment with Bowtie 2. Nat. Methods 9 22388286 10.1038/nmeth.1923 PMC3322381 75. Zhang Y Model-based analysis of ChIP-Seq (MACS) Genome Biol. 2008 9 R137 10.1186/gb-2008-9-9-r137 18798982 PMC2592715 Zhang, Y. et al. Model-based analysis of ChIP-Seq (MACS). Genome Biol. 9 18798982 10.1186/gb-2008-9-9-r137 PMC2592715 76. Ramírez F Dündar F Diehl S Grüning BA Manke T deepTools: a flexible platform for exploring deep-sequencing data Nucleic Acids Res 2014 42 W187 W191 10.1093/nar/gku365 24799436 PMC4086134 Ramírez, F., Dündar, F., Diehl, S., Grüning, B. A. & Manke, T. deepTools: a flexible platform for exploring deep-sequencing data. Nucleic Acids Res 42 24799436 10.1093/nar/gku365 PMC4086134 77. Lord S. J., Velle K. B., Mullins R. D., Fritz-Laylin L. K. SuperPlots: Communicating reproducibility and variability in cell biology. Journal of Cell Biology 219 10.1083/jcb.202001064 PMC7265319 32346721 78. Sun, K. Code of identification of RESSLADs. Zenodo. 10.5281/zenodo.16881072 (2024). ",
  "metadata": {
    "Title of this paper": "deepTools: a flexible platform for exploring deep-sequencing data",
    "Journal it was published in:": "Nature Communications",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12494899/"
  }
}