{
  "title": "Paper_772",
  "abstract": "pmc Mol Ther Oncol Mol Ther Oncol 4545 mtonc Molecular Therapy Oncology 2950-3299 American Society of Gene & Cell Therapy PMC12466123 PMC12466123.1 12466123 12466123 41018974 10.1016/j.omton.2025.201044 S2950-3299(25)00113-4 201044 1 Review Targeting BCMA in multiple myeloma: A comprehensive review of immunotherapeutic strategies and clinical outcomes Chan Chi Ho 1 2 3 Yang Xin 1 2 3 4 Lyu Minchuan 1 2 3 Chen Ziqi 1 2 3 Liu Yumeng 1 2 3 Zhang Ge 1 2 3 Yu Yuanyuan yuyuanyuan@hkbu.edu.hk 1 2 3 ∗ 1 2 3 4 ∗ yuyuanyuan@hkbu.edu.hk 18 12 2025 30 8 2025 33 4 497593 201044 30 08 2025 27 09 2025 29 09 2025 © 2025 The Author(s) 2025 https://creativecommons.org/licenses/by-nc-nd/4.0/ This is an open access article under the CC BY-NC-ND license (http://creativecommons.org/licenses/by-nc-nd/4.0/). Multiple myeloma (MM) is the second most common hematologic malignancy and remains incurable, highlighting an urgent need for novel therapeutic strategies. B cell maturation antigen (BCMA), predominantly expressed on mature B lymphocytes, plays a critical role in B cell activation and maturation. Growing evidence underscores the involvement of BCMA in tumor growth, metastasis, and cancer stemness, establishing it as a promising therapeutic target. This review provides a comprehensive overview of BCMA-targeted immunotherapeutic strategies in MM, including chimeric antigen receptor (CAR) T cell therapy, bispecific antibodies, and antibody-drug conjugates (ADCs). While these therapies have shown remarkable clinical efficacy, challenges such as antigen escape, on-target/off-tumor toxicity, and treatment resistance persist. Future directions include the development of next-generation CAR T cells, combination therapies with other immunomodulatory agents, and innovative strategies to overcome resistance mechanisms. We also discuss the clinical outcomes, limitations, and transformative potential of these novel therapies in the management of MM. Graphical abstract This review elucidates the role of BCMA in B cell activation and oncogenic signaling in MM, summarizes the major BCMA-targeted immunotherapies and their clinical efficacy, discusses challenges of current therapies, and points out future directions and strategies to overcome challenges for anti-BCMA therapies. Keywords MT: Regular Issue B cell maturation antigen immunotherapy multiple myeloma CAR T cell therapy antibody-drug conjugates pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement no pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes Introduction Multiple myeloma (MM), a hematological malignancy driven by clonal proliferation of malignant plasma cells in the bone marrow, accounts for approximately 1% of all cancers and ranks as the second most prevalent hematologic malignancy globally. 1 2 3 B cell maturation antigen (BCMA), a transmembrane receptor selectively expressed on plasma cells and malignant MM cells, has emerged as a critical therapeutic target in the management of MM. 1 4 5 Therapeutic strategies targeting BCMA have revolutionized MM treatment, with three main modalities leading clinical development: chimeric antigen receptor (CAR) T cell therapy, bispecific antibodies (BsAbs), and antibody-drug conjugates (ADCs). 6 , 7 8 This review highlights the current landscape of BCMA-targeted immunotherapies, analyzing their mechanism of action, clinical efficacy, and limitation. We further explore emerging strategies to overcome resistance. By bridging preclinical insights with clinical trial data, this work aims to inform future research directions and therapeutic optimization for MM. Structure and functions of BCMA BCMA, also known as cluster of CD269 or tumor necrosis factor receptor superfamily 17, is a transmembrane glycoprotein predominantly expressed on late-stage or mature B lymphocytes and plasma cells. As a member of the tumor necrosis factor receptor superfamily, BCMA specifically recognizes and binds to two ligands: BAFF and APRIL, with APRIL exhibiting higher binding affinity due to structural specificity. 9 BCMA consists of 184 amino acids with an approximate molecular mass of 20 kDa. The structure of BCMA encompasses three domains ( Figure 1 4 14 14 , 15 16 , 17 Figure 1 Structure of BCMA (A) Schematic diagram of the primary structures of full-length BCMA. Amino acid (aa) 1–54 comprise the extracellular domain; aa 55–77 the transmembrane domain; and aa 78–184 the intracellular domain. (B) 3D structure of BCMA predicted by alphafold. 10 , 11 1OQD 1XU2 12 , 13 Membrane-bound BCMA undergoes γ-secretase-mediated ectodomain shedding, generating soluble BCMA (sBCMA) ( Figure 2 18 19 20 n 21 22 , 23 Figure 2 The APRIL/BCMA pathway APRIL binds to BCMA with significantly higher affinity than BAFF (∼about 1,000-fold). BCMA interacts with TRAF5 and TRAF6 to transmit signal to activate NF-κB. This leads to upregulation of anti-apoptotic proteins and downregulation of apoptosis regulators Bax and Bak. γ-secretase cleaves the extracellular domain of BCMA to release sBCMA as a decoy for APRIL and may also reduce the efficacy of BCMA-targeted therapy. BCMA is essential for the survival of long-lived plasma cells, facilitating immunoglobulin class switching and antibody production. During malignant transformation, BCMA overexpression drives MM pathogenesis by constitutively activating NF-κB, promoting tumor cell proliferation, drug resistance, and immune evasion. 24 Expression profile of BCMA The expression profile of BCMA reveals both tissue specificity and oncogenic versatility, offering insights into therapeutic opportunities beyond MM. In hematologic malignancies, BCMA is prominently expressed in non-Hodgkin lymphoma, particularly diffuse large B cell lymphoma (DLBCL). Analysis of primary DLBCL lymph node biopsies demonstrated consistent BCMA overexpression, corroborated by transcriptomic data from The Cancer Genome Atlas showing significantly elevated mRNA levels in DLBCL, as well as acute myeloid leukemia, compared to normal tissues ( Table 1 Figure 3 24 24 Table 1 Comparison of BCMA expression levels between tumor and normal samples in pan-cancers Abbreviation Name Normal sample Tumor sample p BLCA bladder carcinoma 28 404 0.15 BRCA breast invasive carcinoma 291 1,085 0.21 CESC cervical squamous cell carcinoma and endocervical adenocarcinoma 13 306 0.13 CHOL cholangiocarcinoma 9 36 0.17 COAD colon adenocarcinoma 349 275 0.09 DLBC diffuse large B cell lymphoma 337 47 0.002 ESCA esophageal carcinoma 286 182 0.11 GBM glioblastoma 207 163 0.35 HNSC head-neck squamous cell carcinoma 44 519 0.17 KICH kidney chromophobe 53 66 0.28 KIRC kidney renal clear cell carcinoma 100 523 0.17 KIRP kidney renal papillary cell carcinoma 60 286 0.29 LAML acute myeloid leukemia 70 173 0.005 LGG low-grade glioma 207 518 0.57 LIHC liver hepatocellular carcinoma 160 369 0.36 LUAD lung adenocarcinoma 347 483 0.009 LUSC lung squamous cell carcinoma 338 486 0.008 OV ovarian cancer 88 426 0.23 PAAD pancreatic adenocarcinoma 171 179 0.06 PRAD prostate adenocarcinoma 152 492 0.37 READ rectum adenocarcinoma 318 92 0.07 SARC sarcoma 2 262 0.46 SKCM skin cutaneous melanoma 558 461 0.16 STAD stomach adenocarcinoma 211 408 0.17 TGCT testicular germ cell tumors 165 137 0.23 THCA thyroid carcinoma 337 512 0.31 THYM thymoma 339 118 0.14 UCEC uterine corpus endometrial carcinoma 91 174 0.26 Figure 3 Differential expression of BCMA in various disease states The horizontal bars from bottom to top within the box represent the 25th percentile, median, and 75th percentile of the normalized BCMA TPM mRNA levels. The upper and lower ends of the vertical lines correspond to the maximum and minimum values of the normalized BCMA TPM mRNA levels. ∗ indicates carcinomas with significantly higher BCMA expression level compared to normal tissue ( p Notably, BCMA’s oncogenic role extends to solid tumors. In lung adenocarcinoma and lung squamous cell carcinoma, BCMA is aberrantly overexpressed alongside its ligands APRIL and transmembrane activator and CAML interactor (TACI). This triad forms an autocrine signaling axis that sustains constitutive activation of the mitogen-activated protein kinase pathway, a driver of tumor proliferation and survival in non-small cell lung cancer (NSCLC). 1 Beyond its direct pro-tumor effects, BCMA expression patterns carry critical clinical implications. For example, in plasma cell neoplasms like MM, BCMA surface density correlates with disease aggressiveness and resistance to conventional therapies. 25 24 Targeting BCMA for cancer therapy CAR T cell therapy CAR T cell therapy employs genetically engineered T cells that express CARs to specifically recognize tumor-associated antigens, enabling precise tumor targeting. 26 Idecabtagene vicleucel Approved by the Food and Drug Administration (FDA) in March 2021, idecabtagene vicleucel (ide-cel) is a second-generation CAR T cell therapy incorporating an anti-BCMA single-chain variable fragment (scFv) with 4-1BB (CD137) and CD3ζ co-stimulatory domains. In the pivotal phase 2 KarMMa trial, ide-cel achieved an overall response rate (ORR) of 73% and a median PFS of 8.8 months in heavily pretreated patients with RRMM. However, significant challenges remain, including grade ≥3 cytopenias (91% neutropenia; 70% anemia) and limited CAR T cell persistence (59% detectable at 6 months). 20 27 , 28 , 29 Ciltacabtagene autoleucel Approved in February 2022, ciltacabtagene autoleucel (cilta-cel) utilizes two BCMA-targeting single-domain antibodies to enhance avidity. In the CARTITUDE-1 trial, cilta-cel achieved a 97.9% ORR and an 82.5% stringent complete response (sCR) rate, with a 27-month PFS of 54.9%. 30 30 , 31 , 32 NCT04133636 30 ALLO-715 ALLO-715 is an allogeneic anti-BCMA CAR T cell therapy designed to minimize graft-versus-host disease and CAR T cell rejection. In a phase 1 study, ALLO-715 administered after lymphodepletion with an anti-CD52 antibody achieved a 70.8% response rate, with 45.8% patients achieving a very good partial response (VGPR) or better, including 25% complete response. The median duration of response was 8.3 months. 33 BsAb and bispecific T cell engager BsAbs represent a novel precision medicine designed to recognize two different epitopes or antigens. 34 , 35 36 37 , 38 Table 2 Table 2 Information of BCMA-targeted therapies Drug class Drug name Efficacy Safety profile Clinical trial criteria CAR T cell therapy idecabtagene vicleucel (ide-cel) ORR: ∼73%; CR: ∼33%; median PFS: ∼11.8 months common AEs: cytokine release syndrome (CRS), B cell aplasia, infections; grade 3–4 AEs: neurological events, prolonged cytopenias inclusion: adult patients with relapsed/refractory multiple myeloma, previous therapies; exclusion: prior BCMA-targeted therapy, severe comorbidities ciltacabtagene autoleucel (cilta-cel) ORR: ∼97%; CR: ∼67%; median PFS: ∼20.6 months common AEs: CRS, neurotoxicity, infections; grade 3–4 AEs: B cell aplasia, prolonged cytopenia observed inclusion: relapsed/refractory multiple myeloma, sufficient organ function; exclusion: prior BCMA therapy, active infections. ALLO-715 early efficacy data demonstrate promise; ORR and CR rates under evaluation; median PFS is not yet available common AEs: CRS, cytopenias, infections; grade 3–4 AEs: immune-related adverse events requiring close monitoring inclusion: adults with relapsed/refractory multiple myeloma, good performance status; exclusion: severe active infections, history of severe allergic reactions Bispecific T cell engager (BiTE) AMG 420 (BI 836909) ORR: ∼25%–40% reported; CR: not specified; median PFS: not specified (data from ongoing trials) common AEs: CRS (up to grade 2), fatigue, infusion-related reactions; grade 3–4 AEs: cytopenias, neurological events noted inclusion: adults with relapsed/refractory multiple myeloma, at least two prior therapies; exclusion: active uncontrolled infections, other malignancies AMG 701 ongoing clinical evaluation; ORR: ∼30%–40%; CR: not specified; median PFS: not specified (ongoing evaluations) common AEs: CRS (varied grades), hypersensitivity, neurological events; grade 3–4 AEs: neutropenia, anemia observed inclusion: relapsed/refractory multiple myeloma, prior treatment history documented; exclusion: pre-existing neuropathy, significant cardiac comorbidities AFM26 early clinical trials indicate potential; ORR: ∼40%; CR: not specified; median PFS: data pending further studies. common AEs: CRS (up to grade 2), fatigue, infusion-related reactions; grade 3–4 AEs: cytopenias requiring potential transfusions inclusion: adults with multiple myeloma, previous lines of therapy; exclusion: CNS disease, severe pulmonary or cardiac disease Bispecific antibody (BsAb) EM901 (CC-93269, BCMA-TCB2) preliminary results indicate potential efficacy; ORR: ∼50% reported; CR: not specified; median PFS: not specified (early-phase trials ongoing) common AEs: CRS (grade 1–2), cytopenias, immune-related effects; grade 3–4 AEs: typically manageable with intervention inclusion: adults with relapsed/refractory myeloma, adequate organ function; exclusion: allergies to study drugs, significant autoimmune disorders MEDI2228 phase 1 trials show potential; ORR: not specified; CR: not specified; median PFS: not yet available common AEs: CRS (up to grade 2), headache, infusion-related adverse effects; grade 3–4 AEs: cytopenias reported with management plans in place inclusion: adults with relapsed/refractory myeloma, adequate organ function, previously treated; exclusion: significant pre-existing conditions affecting safety Antibody-drug conjugate (ADC) belantamab mafodotin (GSK2857916) ORR: ∼31%; CR: ∼10%; median PFS: ∼2.9 months common AEs: keratopathy (grade 1–2), fatigue, CRS, cytopenias; grade 3–4 AEs: severe corneal events, cytopenias requiring treatment adjustments inclusion: adults with relapsed/refractory myeloma, at least 4 prior therapies; exclusion: active keratopathy, other malignancies HDP-101 early-stage trials; ORR data emerging; CR: not specified; median PFS: not specified common AEs: CRS, occasionally requiring hospitalization; infusion-related events; grade 3–4 AEs generally manageable; specifics evolving inclusion: patients with multiple myeloma, prior treatments documented; exclusion: recent other malignancies, uncontrolled infections AMG 420 (BI 836909) AMG 420 is a bispecific scFv that targets CD3 and BCMA. It induces T cell activation and cytokine release, leading to apoptosis for MM cells and T cell proliferation. In mouse xenograft studies, AMG420 reduces the tumor size and prolonged host survival. 39 40 NCT02514239 41 AMG 701 AMG 701 is a half-life-extended BiTE for once-weekly dosing, showing potent T cell-mediated lysis of MM cell, including those resistant to immunomodulatory imide drugs (IMiDs). In the preclinical NCI-H929 xenograft model, AMG 701 blocked tumor growth 5 days after the first injection and completely eradicated tumor growth after 3 injections at all dose levels (0.02, 0.2, and 2 mg/kg), supporting further investigation as monotherapy or in combination with IMiDs. A phase 1 clinical trial was proposed for evaluating the safety and tolerability of AMG 701 monotherapy ( NCT03287908 38 , 42 EM901 EM901 ( CC-93269 BCMA-TCB2 4 NCT03486067 43 AFM26 AFM26 is a first-in-class tetravalent BsAb targeting BCMA on MM cells and CD16A on NK cells. It induced NK cell-mediated cytotoxicity with reduced cytokine release compared to T cell-based approaches, even in cells with low BCMA expression. AFM26 exhibited prolonged cell retention and was less susceptible to competition from high levels of circulating IgG, due to its high-affinity bivalent binding to CD16A. In vitro 44 , 45 , 46 ADCs ADC combines monoclonal antibodies with cytotoxic chemical agents (payload) for targeted drug delivery, reducing off-target effects and providing options for patients ineligible for CAR T cell therapy. 47 , 48 Belantamab mafodotin Belantamab mafodotin (GSK2857916) is an anti-BCMA humanized IgG1 monoclonal antibody conjugated with a cytotoxic agent maleimidocaproyl monomethyl auristatin F. It has been approved by the US FDA as a monotherapy for patients with RRMM. 49 , 50 50 , 51 , 52 Subsequently, an open-label phase 2 study ( NCT03525678 53 , 54 Another ongoing phase 1/2 clinical trial ( NCT03848845 55 55 , 56 , 57 , 58 , 59 , 60 , 61 HDP-101 HDP-101 is an anti-BCMA antibody conjugated to amanitin via a non-cleavable linker. At low concentration, amanitin effectively binds to RNA polymerase II in eukaryotic cells, inhibiting RNA transcription regardless of the proliferation state of the target cells. HDP-101 shows promising preclinical results with specific targeting and internalization in BCMA-positive MM cells. 62 , 63 NCT04879043 64 MEDI2228 MEDI2228 is an ADC that consists of a fully human antibody conjugated site-specifically to a pyrrolobenzodiazepine (PBD) dimer through a protease-cleavable linker. The PBD dimer binds to the minor groove of DNA, causing crosslinking and subsequent DNA damage, leading to apoptotic cell death. MEDI2228 demonstrated its anti-tumor activity in vitro 65 , 66 NCT03489525 66 , 67 , 68 Conclusions and future perspectives BCMA-targeted therapies, including CAR T cells, BsAbs, and ADC, have redefined therapeutic paradigms for patients at the third relapse or beyond, achieving unprecedented response rates in late-line settings. 5 , 69 in vivo Table 3 Table 3 Comparisons of the BCMA-targeted therapies Aspect CAR T cell therapies Bispecific antibodies (BsAbs) Antibody-drug conjugates (ADCs) Feasibility complex manufacturing; specialized centers required off-the-shelf; ready-to-use; easy administration off-the-shelf; similar to mAb infusion Cost-effectiveness high upfront costs; possible long-term savings via durable response lower costs; can be repeated dosing moderate costs; less complex than cell therapy Scalability limited due to individualized process high; mass production feasible high; established mAb manufacturing platforms Patient eligibility restricted by age, fitness, and manufacturing time broad; suitable for frail or acutely ill patients broad; suitable for wide patient population Advantages potential for long-term remission and immune memory immediate treatment; engages endogenous T cells; flexible use targeted cytotoxicity; minimized off-target effects Limitations manufacturing delays; CRS/ICANS risk; limited access risk of CRS; requires repeated dosing resistance development; off-target toxicity risk Despite the remarkable efficacy of these novel therapies, several challenges and limitations persist that impede their widespread adoption and long-term success. The management of RRMM remains a significant challenge due to clonal evolution, immune evasion, and cumulative treatment resistance. CAR T cell therapies leverage the immune system’s cytotoxic potential, often including durable remissions with a single infusion. GC012F, a dual-targeting anti-BCMA and anti-CD19 CAR T, demonstrated durable responses with a median PFS of 38 months. 70 , 71 72 73 BsAbs and BiTEs provide immediate, off-the-shelf access to T cell-redirected cytotoxicity. However, they have high risk, with CRS (grade ≥3 in 4%–5% of patients) and hypogammaglobulinemia from BCMA + 74 ADCs offer a distinct approach by delivering cytotoxic payloads directly to tumor cells. However, ADCs face unique hurdles, such as interference from sBCMA, which reduced MEDI2228’s efficacy by 70% in high-sBCMA cohorts, ultimately leading to its discontinuation. Next-generation ADCs with non-cleavable linkers and RNA polymerase inhibitors aim to mitigate these issues while broadening therapeutic indices. Looking forward, the integration of BCMA-targeted therapies into earlier treatment lines, guided by biomarkers such as sBCMA dynamics and baseline T cell profiles, holds great promise for enhancing patient outcomes in high-risk RRMM. Combination strategies, such as pairing CAR T cell with BsAbs to eliminate antigen-low subclones or combining ADCs with GSIs to enhance target density, may deepen responses and delay resistance. In relapsed or refractory B cell lymphomas, the efficacy of CD20/CD3 BsAbs in patients previously treated with CD19 CAR T cell therapy has been investigated. Patients with prior CD19 CAR T cell therapy demonstrated increased lymphocyte counts, including both CD4 and CD8 T cells. These findings suggest a potential interaction between the two treatment modalities and support the feasibility of combination strategies involving CAR T cells and BsAbs. 75 Further, improving biomarker-based patient selection is essential. Addressing potential tumor heterogeneity, such as by evaluating multiple tumor samples or employing imaging techniques to assess BCMA expression throughout the tumor mass, may optimize patient selection. 76 77 Another limitation of BCMA-targeted immunotherapies is the development of drug resistance. Mechanisms of resistance include cellular immune responses, antigen loss or downregulation, impaired CAR T expansion, and the immunosuppressive effects of the bone marrow microenvironment. Ongoing clinical trials addressing these resistance mechanisms have shown encouraging results. For example, initial phase 1 data from ALLO-715, a CAR T cell therapy with a human scFV and a 4-1BB co-stimulatory domain, showed a promising ORR of 60%, a VGFR of 40% or higher, and no observed graft-versus-host disease. 78 In vivo 79 80 In conclusion, while BCMA-targeted immunotherapies have transformed the management of RRMM, their full potential remains unrealized. Addressing biological resistance, refining toxicity management, and expanding accessibility through technological and logistical innovations will be critical to achieving durable remissions. As these therapies evolve, a paradigm shift toward personalized, biomarker-driven treatment sequences, supported by robust clinical trial data, will be essential to extending survival and improving quality of life for patients worldwide. Acknowledgments This study was supported by the Hong Kong General Research Hong Kong Special Administrative Region 12102120 12102322 Theme-based Research Scheme from the Research T12-201/20-R Author contributions C.H.C.: writing – original draft, writing – review and editing, visualization, and conceptualization; X.Y., M.L., Z.C., and Y.L.: investigation and visualization; G.Z.: writing – review and editing; Y.Y.: writing – review and editing, supervision, project administration, funding acquisition, and conceptualization. Declaration of interests The authors declare no competing interests. References 1 Dou H. Yan Z. Zhang M. Xu X. BCMA and TACI proteins are abnormally expressed in non-small cell lung cancer Oncol. Lett. 12 2016 3351 3355 10.3892/ol.2016.5095 27900003 PMC5103951 2 Malard F. Neri P. Bahlis N.J. Terpos E. Moukalled N. Hungria V.T.M. Manier S. Mohty M. Multiple myeloma Nat. Rev. Dis. Primers 10 2024 45 10.1038/s41572-024-00529-7 38937492 3 Rajkumar S.V. Multiple myeloma: 2022 update on diagnosis, risk stratification, and management Am. J. Hematol. 97 2022 1086 1107 10.1002/ajh.26590 35560063 PMC9387011 4 Yu B. Jiang T. Liu D. BCMA-targeted immunotherapy for multiple myeloma J. Hematol. Oncol. 13 2020 125 10.1186/s13045-020-00962-7 32943087 PMC7499842 5 Cho S.F. Anderson K.C. Tai Y.T. Targeting B Cell Maturation Antigen (BCMA) in Multiple Myeloma: Potential Uses of BCMA-Based Immunotherapy Front. Immunol. 9 2018 1821 10.3389/fimmu.2018.01821 30147690 PMC6095983 6 Kegyes D. Constantinescu C. Vrancken L. Rasche L. Gregoire C. Tigu B. Gulei D. Dima D. Tanase A. Einsele H. Patient selection for CAR T or BiTE therapy in multiple myeloma: Which treatment for each patient? J. Hematol. Oncol. 15 2022 78 10.1186/s13045-022-01296-2 35672793 PMC9171942 7 Xing L. Liu Y. Liu J. Targeting BCMA in Multiple Myeloma: Advances in Antibody-Drug Conjugate Therapy Cancers (Basel) 15 2023 2240 10.3390/cancers15082240 PMC10137208 37190168 8 Krishnan S.R. Jaiswal R. Brown R.D. Luk F. Bebawy M. Multiple myeloma and persistence of drug resistance in the age of novel drugs (Review) Int. J. Oncol. 49 2016 33 50 10.3892/ijo.2016.3516 27175906 9 Novak A.J. Darce J.R. Arendt B.K. Harder B. Henderson K. Kindsvogel W. Gross J.A. Greipp P.R. Jelinek D.F. Expression of BCMA, TACI, and BAFF-R in multiple myeloma: a mechanism for growth and survival Blood 103 2004 689 694 10.1182/blood-2003-06-2043 14512299 10 Jumper J. Evans R. Pritzel A. Green T. Figurnov M. Ronneberger O. Tunyasuvunakool K. Bates R. Žídek A. Potapenko A. Highly accurate protein structure prediction with AlphaFold Nature 596 2021 583 589 10.1038/s41586-021-03819-2 34265844 PMC8371605 11 Varadi M. Anyango S. Deshpande M. Nair S. Natassia C. Yordanova G. Yuan D. Stroe O. Wood G. Laydon A. AlphaFold Protein Structure Database: massively expanding the structural coverage of protein-sequence space with high-accuracy models Nucleic Acids Res. 50 2022 D439 D444 10.1093/nar/gkab1061 34791371 PMC8728224 12 Liu Y. Hong X. Kappler J. Jiang L. Zhang R. Xu L. Pan C.-H. Martin W.E. Murphy R.C. Shu H.-B. Ligand–receptor binding revealed by the TNF family member TALL-1 Nature 423 2003 49 56 10.1038/nature01543 12721620 13 Hymowitz S.G. Patel D.R. Wallweber H.J.A. Runyon S. Yan M. Yin J. Shriver S.K. Gordon N.C. Pan B. Skelton N.J. Structures of APRIL-receptor complexes: like BCMA, TACI employs only a single cysteine-rich domain for high affinity ligand binding J. Biol. Chem. 280 2005 7218 7227 10.1074/jbc.M411714200 15542592 14 Patel D.R. Wallweber H.J.A. Yin J. Shriver S.K. Marsters S.A. Gordon N.C. Starovasnik M.A. Kelley R.F. Engineering an APRIL-specific B cell maturation antigen J. Biol. Chem. 279 2004 16727 16735 10.1074/jbc.M312316200 14764606 15 Bossen C. Schneider P. BAFF, APRIL and their receptors: Structure, function and signaling Semin. Immunol. 18 2006 263 275 10.1016/j.smim.2006.04.006 16914324 16 Hatzoglou A. Roussel J. Bourgeade M.F. Rogier E. Madry C. Inoue J. Devergne O. Tsapis A. TNF receptor family member BCMA (B cell maturation) associates with TNF receptor-associated factor (TRAF) 1, TRAF2, and TRAF3 and activates NF-kappa B, elk-1, c-Jun N-terminal kinase, and p38 mitogen-activated protein kinase J. Immunol. 165 2000 1322 1330 10.4049/jimmunol.165.3.1322 10903733 17 Shu H.B. Johnson H. B cell maturation protein is a receptor for the tumor necrosis factor family member TALL-1 Proc. Natl. Acad. Sci. USA 97 2000 9156 9161 10.1073/pnas.160213497 10908663 PMC16838 18 Laurent S.A. Hoffmann F.S. Kuhn P.H. Cheng Q. Chu Y. Schmidt-Supprian M. Hauck S.M. Schuh E. Krumbholz M. Rübsamen H. γ-Secretase directly sheds the survival receptor BCMA from plasma cells Nat. Commun. 6 2015 7333 10.1038/ncomms8333 26065893 PMC4490565 19 Chen H. Li M. Xu N. Ng N. Sanchez E. Soof C.M. Patil S. Udd K. Bujarski S. Cao J. Serum B-cell maturation antigen (BCMA) reduces binding of anti-BCMA antibody to multiple myeloma cells Leuk. Res. 81 2019 62 66 10.1016/j.leukres.2019.04.008 31035033 20 Pont M.J. Hill T. Cole G.O. Abbott J.J. Kelliher J. Salter A.I. Hudecek M. Comstock M.L. Rajan A. Patel B.K.R. γ-Secretase inhibition increases efficacy of BCMA-specific chimeric antigen receptor T cells in multiple myeloma Blood 134 2019 1585 1597 10.1182/blood.2019000050 31558469 PMC6871311 21 Ghermezi M. Li M. Vardanyan S. Harutyunyan N.M. Gottlieb J. Berenson A. Spektor T.M. Andreu-Vieyra C. Petraki S. Sanchez E. Serum B-cell maturation antigen: a novel biomarker to predict outcomes for multiple myeloma patients Haematologica 102 2017 785 795 10.3324/haematol.2016.150896 28034989 PMC5395119 22 Meinl E. Krumbholz M. Endogenous soluble receptors sBCMA and sTACI: biomarker, immunoregulator and hurdle for therapy in multiple myeloma Curr. Opin. Immunol. 71 2021 117 123 10.1016/j.coi.2021.06.015 34330018 23 Seipel K. Porret N. Wiedemann G. Jeker B. Bacher V.U. Pabst T. sBCMA Plasma Level Dynamics and Anti-BCMA CAR-T-Cell Treatment in Relapsed Multiple Myeloma Curr. Issues Mol. Biol. 44 2022 1463 1471 35723356 10.3390/cimb44040098 PMC9164019 24 Hagner P.R. Waldman M. Gray F.D. Yura R. Hersey S. Chan H. Zhang M. Boss I. Gandhi A.K. Targeting B-Cell Maturation Antigen (BCMA) with CC-93269, a 2+1 T Cell Engager, Elicits Significant Apoptosis in Diffuse Large B-Cell Lymphoma Preclinical Models Blood 134 2019 1580 10.1182/blood-2019-126115 25 Khattar P. Pichardo J. Jungbluth A. Gao Q. Smith E.L. Roshal M. Dogan A. B- Cell Maturation Antigen Is Exclusively Expressed in a Wide Range of B-Cell and Plasma Cell Neoplasm and in a Potential Therapeutic Target for Bcma Directed Therapies Blood 130 2017 2755 10.1182/blood.V130.Suppl_1.2755.2755 26 Schultz L. Chimeric Antigen Receptor T Cell Therapy for Pediatric B-ALL: Narrowing the Gap Between Early and Long-Term Outcomes Front. Immunol. 11 2020 1985 10.3389/fimmu.2020.01985 32849662 PMC7431960 27 Center, M.S.K.C. A Study of Whether Ide-cel (bb2121) Can Be Made From People With Multiple Myeloma Who Have Had a Hematopoietic Cell Transplant https://ClinicalTrials.gov/show/NCT05393804 2022 28 Celgene Safety and Efficacy of bb2121 (Ide-cel) Combinations in Multiple Myeloma https://ClinicalTrials.gov/show/NCT04855136 2021 29 Celgene Expanded Access Protocol (EAP) for Participants Receiving Idecabtagene Vicleucel That is Nonconforming for Commercial Release. https://ClinicalTrials.gov/show/NCT04771078 30 Berdeja J.G. Madduri D. Usmani S.Z. Jakubowiak A. Agha M. Cohen A.D. Stewart A.K. Hari P. Htut M. Lesokhin A. Ciltacabtagene autoleucel, a B-cell maturation antigen-directed chimeric antigen receptor T-cell therapy in patients with relapsed or refractory multiple myeloma (CARTITUDE-1): a phase 1b/2 open-label study Lancet 398 2021 314 324 10.1016/S0140-6736(21)00933-8 34175021 31 Martin T. Usmani S.Z. Berdeja J.G. Agha M. Cohen A.D. Hari P. Avigan D. Deol A. Htut M. Lesokhin A. Ciltacabtagene Autoleucel, an Anti-B-cell Maturation Antigen Chimeric Antigen Receptor T-Cell Therapy, for Relapsed/Refractory Multiple Myeloma: CARTITUDE-1 2-Year Follow-Up J. Clin. Oncol. 41 2023 1265 1274 10.1200/jco.22.00842 35658469 PMC9937098 32 Jagannath S. Martin T.G. Lin Y. Cohen A.D. Raje N. Htut M. Deol A. Agha M. Berdeja J.G. Lesokhin A.M. Liegel J.J. Long-Term (≥5-Year) Remission and Survival After Treatment With Ciltacabtagene Autoleucel in CARTITUDE-1 Patients With Relapsed/Refractory Multiple Myeloma J Clin Oncol 43 2025 2766 2771 10.1200/jco-25-00760 40459151 PMC12393059 33 Mailankody S. Matous J.V. Liedtke M. Sidana S. Malik S. Nath R. Oluwole O.O. Karski E.E. Lovelace W. Zhou X. Universal: An Allogeneic First-in-Human Study of the Anti-Bcma ALLO-715 and the Anti-CD52 ALLO-647 in Relapsed/Refractory Multiple Myeloma Blood 136 2020 24 25 10.1182/blood-2020-140641 34 Labrijn A.F. Janmaat M.L. Reichert J.M. Parren P.W.H.I. Bispecific antibodies: a mechanistic review of the pipeline Nat. Rev. Drug Discov. 18 2019 585 608 10.1038/s41573-019-0028-1 31175342 35 Zhou X. Einsele H. Danhof S. Bispecific Antibodies: A New Era of Treatment for Multiple Myeloma J. Clin. Med. 9 2020 2166 10.3390/jcm9072166 PMC7408718 32659909 36 Kontermann R.E. Brinkmann U. Bispecific antibodies Drug Discov. Today 20 2015 838 847 10.1016/j.drudis.2015.02.008 25728220 37 Saini S. Kumar Y. Chapter 9 - Bispecific antibodies: A promising entrant in cancer immunotherapy Hasija Y. Translational Biotechnology 2021 Academic Press 233 266 10.1016/B978-0-12-821972-0.00014-9 38 Lancman G. Sastow D.L. Cho H.J. Jagannath S. Madduri D. Parekh S.S. Richard S. Richter J. Sanchez L. Chari A. Bispecific Antibodies in Multiple Myeloma: Present and Future Blood Cancer Discov. 2 2021 423 433 10.1158/2643-3230.Bcd-21-0028 34661161 PMC8510808 39 Hipp S. Tai Y.T. Blanset D. Deegen P. Wahl J. Thomas O. Rattel B. Adam P.J. Anderson K.C. Friedrich M. A novel BCMA/CD3 bispecific T-cell engager for the treatment of multiple myeloma induces selective lysis in vitro in vivo Leukemia 31 2017 1743 1751 10.1038/leu.2016.388 28025583 40 Goyos A. Li C.-M. Deegen P. Bogner P. Thomas O. Matthias K. Wahl J. Goldstein R. Coxon A. Balazs M. Chapman-Arvedson T. Generation of Half-Life Extended Anti-BCMA Bite® Antibody Construct Compatible with Once-Weekly Dosing for Treatment of Multiple Myeloma (MM) Blood 130 2017 5389 10.1182/blood.V130.Suppl_1.5389.5389 41 Sanchez L. Dardac A. Madduri D. Richard S. Richter J. B-cell maturation antigen (BCMA) in multiple myeloma: the new frontier of targeted therapies Ther. Adv. Hematol. 12 2021 2040620721989585 10.1177/2040620721989585 PMC7970693 33796236 42 Cho S.-F. Lin L. Xing L. Wen K. Yu T. Wahl J. Matthes K. Munshi N. Anderson K.C. Arvedson T. Tai Y.-T. AMG 701, a half-life extended anti-BCMA BiTE®, potently induces T cell-redirected lysis of human multiple myeloma cells and can be combined with IMiDs to overcome the immunosuppressive bone marrow microenvironment Clin. Lymphoma Myeloma Leuk. 19 2019 e54 10.1016/j.clml.2019.09.082 43 Costa L.J. Wong S.W. Bermúdez A. de la Rubia J. Mateos M.-V. Ocio E.M. Rodríguez-Otero P. San-Miguel J. Li S. Sarmiento R. First Clinical Study of the B-Cell Maturation Antigen (BCMA) 2+1 T Cell Engager (TCE) CC-93269 in Patients (Pts) with Relapsed/Refractory Multiple Myeloma (RRMM): Interim Results of a Phase 1 Multicenter Trial Blood 134 2019 143 10.1182/blood-2019-122895 44 Gantke T. Reusch U. Kellner C. Klausz K. Haneke T. Knackmuss S. Müller T. Ellwanger K. Fucek I. Schniegler-Mattox U. AFM26 - Targeting B Cell Maturation Antigen (BCMA) for NK Cell-Mediated Immunotherapy of Multiple Myeloma Blood 130 2017 3082 10.1182/blood.V130.Suppl_1.3082.3082 45 Gantke T. Reusch U. Kellner C. Ellwanger K. Fucek I. Weichel M. Kerber A. Peipp M. Treder M. AFM26 is a novel, highly potent BCMA/CD16A-directed bispecific antibody for high affinity NK-cell engagement in multiple myeloma J. Clin. Oncol. 35 2017 8045 10.1200/JCO.2017.35.15_suppl.8045 46 Ross T. Reusch U. Wingert S. Haneke T. Klausz K. Otte A.-K. Schub N. Knackmuss S. Müller T. Ellwanger K. Preclinical Characterization of AFM26, a Novel B Cell Maturation Antigen (BCMA)-Directed Tetravalent Bispecific Antibody for High Affinity Retargeting of NK Cells Against Myeloma Blood 132 2018 1927 10.1182/blood-2018-99-118970 47 Khongorzul P. Ling C.J. Khan F.U. Ihsan A.U. Zhang J. Antibody-Drug Conjugates: A Comprehensive Review Mol. Cancer Res. 18 2020 3 19 10.1158/1541-7786.MCR-19-0582 31659006 48 Damelin M. Zhong W. Myers J. Sapra P. Evolving Strategies for Target Selection for Antibody-Drug Conjugates Pharm. Res. 32 2015 3494 3507 10.1007/s11095-015-1624-3 25585957 49 Tai Y.T. Mayes P.A. Acharya C. Zhong M.Y. Cea M. Cagnetta A. Craigen J. Yates J. Gliddon L. Fieles W. Novel anti-B-cell maturation antigen antibody-drug conjugate (GSK2857916) selectively induces killing of multiple myeloma Blood 123 2014 3128 3138 10.1182/blood-2013-10-535088 24569262 PMC4023420 50 Cohen A.D. Popat R. Trudel S. Richardson P.G. Libby E.N. III Lendvai N. Anderson L.D. Jr. Sutherland H.J. DeWall S. Ellis C.E. First in Human Study with GSK2857916, an Antibody Drug Conjugated to Microtubule-Disrupting Agent Directed Against B-Cell Maturation Antigen (BCMA) in Patients with Relapsed/Refractory Multiple Myeloma (MM): Results from Study BMA117159 Part 1 Dose Escalation Blood 128 2016 1148 10.1182/blood.V128.22.1148.1148 51 Trudel S. Lendvai N. Popat R. Voorhees P.M. Reeves B. Libby E.N. III Richardson P.G. Anderson L. Sutherland H. Yong K. Deep and Durable Responses in Patients (Pts) with Relapsed/Refractory Multiple Myeloma (MM) Treated with Monotherapy GSK2857916, an Antibody Drug Conjugate Against B-Cell Maturation Antigen (BCMA): Preliminary Results from Part 2 of Study BMA117159 Blood 130 2017 741 10.1182/blood.V130.Suppl_1.741.741 52 GlaxoSmithKline Dose Escalation Study to Investigate the Safety Pharmacokinetics, Pharmacodynamics, Immunogenicity and Clinical Activity of GSK2857916 2014 53 Lonial S. Lee H.C. Badros A. Trudel S. Nooka A.K. Chari A. Abdallah A.O. Callander N. Lendvai N. Sborov D. Belantamab mafodotin for relapsed or refractory multiple myeloma (DREAMM-2): a two-arm, randomised, open-label, phase 2 study Lancet Oncol. 21 2020 207 221 10.1016/s1470-2045(19)30788-0 31859245 54 GlaxoSmithKline A Study to Investigate the Efficacy and Safety of Two Doses of GSK2857916 in Participants With Multiple Myeloma Who Have Failed Prior Treatment With an Anti-CD38 Antibody https://clinicaltrials.gov/study/NCT03548207?cond=NCT03548207&rank=1 2018 55 GlaxoSmithKline, Sharp, M., and LLC, D. (2019). Study Evaluating Safety, Tolerability and Clinical Activity of GSK2857916 in Combination With Pembrolizumab in Subjects With Relapsed/Refractory Multiple Myeloma (RRMM).; https://www.clinicaltrials.gov/study/NCT03848845 56 University of Pennsylvania Study of Belantamab Mafodotin as Pre- and Post-autologous Stem Cell Transplant and Maintenance for Multiple Myeloma and GlaxoSmithKline 2021 https://clinicaltrials.gov/study/NCT04680468 57 Dimopoulos M.A. Beksac M. Pour L. Delimpasi S. Vorobyev V. Quach H. Spicka I. Radocha J. Robak P. Kim K. Cavo M. Belantamab Mafodotin, Pomalidomide, and Dexamethasone in Multiple Myeloma New England Journal of Medicine 391 2024 408 421 10.1056/NEJMoa2403407 38828951 58 Institute R.P.C. GlaxoSmithKline Belantamab Mafodotin and Lenalidomide for the Treatment of Multiple Myeloma in Patients With Minimal Residual Disease Positive After Stem Cell Transplant https://clinicaltrials.gov/study/NCT04876248 2022 59 GlaxoSmithKline A Study of Belantamab Mafodotin Monotherapy in Multiple Myeloma Participants With Normal and Varying Degree of Impaired Renal Function 2020 https://clinicaltrials.gov/study/NCT04398680 60 GlaxoSmithKline A Study of Belantamab Mafodotin to Investigate Safety, Tolerability, Pharmacokinetics, Immunogenicity and Clinical Activity in Participants With Relapsed/Refractory Multiple Myeloma 2019 RRMM https://clinicaltrials.gov/study/NCT04177823 61 GlaxoSmithKline (2019). Platform Study of Belantamab Mafodotin as Monotherapy and in Combination With Anti-cancer Treatments in Participants With Relapsed/Refractory Multiple Myeloma (RRMM) (DREAMM 5).; https://clinicaltrials.gov/study/NCT04126200 62 Pahl A. Ko J. Breunig C. Figueroa V. Lehners N. Baumann A. Pálfi A. Mueller C. Lutz C. Hechler T. HDP-101: Preclinical evaluation of a novel anti-BCMA antibody drug conjugates in multiple myeloma J. Clin. Oncol. 36 2018 e14527 10.1200/JCO.2018.36.15_suppl.e14527 63 Ko J. Breunig C. Figueroa V. Lehners N. Baumann A. Pálfi A. Müller C. Lutz C. Hechler T. Kulke M. Preclinical Evaluation of Hdp-101, a Novel Anti-BCMA Antibody-Drug Conjugate, in Multiple Myeloma Blood 130 2017 3070 10.1182/blood.V130.Suppl_1.3070.3070 64 AG H.P. Study to Assess Safety of HDP-101 in Patients With Relapsed Refractory Multiple Myeloma https://clinicaltrials.gov/study/NCT04879043 2022 65 Kinneer K. Meekin J. Varkey R. Xiao X. Zhong H. Breen S. Hurt E. Thomas S. Flynn M. Hynes P. Preclinical Evaluation of MEDI2228, a BCMA-Targeting Pyrrolobenzodiazepine-Linked Antibody Drug Conjugate for the Treatment of Multiple Myeloma Blood 130 2017 3153 10.1182/blood.V130.Suppl_1.3153.3153 66 Xing L. Li Y. Lin L. Yu T. Wen K. Cho S.-F. Hsieh P.A. Kinneer K. Munshi N.C. Anderson K.C. Tai Y.-T. MEDI2228, a Novel Bcma Antibody-PBD Conjugate, Sensitizes Human Multiple Myeloma Cells to NK Cell-Mediated Cytotoxicity and Upregulates CD38 Expression in MM Cells Blood 134 2019 3096 10.1182/blood-2019-127135 67 LLC M. MEDI2228 in Subjects With Relapsed/Refractory Multiple Myeloma 2018 https://clinicaltrials.gov/study/NCT03489525 68 Kumar S.K. Migkou M. Bhutani M. Spencer A. Ailawadhi S. Kalff A. Walcott F. Pore N. Gibson D. Wang F. Phase 1, First-in-Human Study of MEDI2228, a BCMA-Targeted ADC in Patients with Relapsed/Refractory Multiple Myeloma Blood 136 2020 26 27 10.1182/blood-2020-136375 69 Shah U.A. Mailankody S. Emerging immunotherapies in multiple myeloma Bmj 370 2020 m3176 10.1136/bmj.m3176 32958461 70 Du J. Qiang W. Lu J. Jia Y. He H. Liu J. Guo P. Yang Y. Feng Z. Jin L. Updated Results of a Phase I Open-Label Single-Arm Study of Dual Targeting BCMA and CD19 Fastcar-T Cells (GC012F) As First-Line Therapy for Transplant-Eligible Newly Diagnosed High-Risk Multiple Myeloma Blood 142 2023 1022 10.1182/blood-2023-174841 71 Jiang H. Dong B. Gao L. Liu L. Ge J. He A. Li L. Lu J. Chen X. Sersch M.A. Long-term follow-up results of a multicenter first-in-human study of the dual BCMA/CD19 Targeted FasT CAR-T GC012F for patients with relapsed/refractory multiple myeloma J. Clin. Oncol. 39 2021 8014 10.1200/JCO.2021.39.15_suppl.8014 72 Westin J.R. Oluwole O.O. Kersten M.J. Miklos D.B. Perales M.-A. Ghobadi A. Rapoport A.P. Sureda A. Jacobson C.A. Farooq U. Survival with Axicabtagene Ciloleucel in Large B-Cell Lymphoma N. Engl. J. Med. 389 2023 148 157 10.1056/NEJMoa2301665 37272527 73 Cornetta K. Bonamino M. Mahlangu J. Mingozzi F. Rangarajan S. Rao J. Gene therapy access: Global challenges, opportunities, and views from Brazil, South Africa, and India Mol. Ther. 30 2022 2122 2129 10.1016/j.ymthe.2022.04.002 35390542 PMC9171243 74 Philipp N. Kazerani M. Nicholls A. Vick B. Wulf J. Straub T. Scheurer M. Muth A. Hänel G. Nixdorf D. T-cell exhaustion induced by continuous bispecific molecule exposure is ameliorated by treatment-free intervals Blood 140 2022 1104 1118 10.1182/blood.2022015956 35878001 PMC10652962 75 Chong E.A. Penuel E. Napier E.B. Lundberg R.K. Budde L.E. Shadman M. Matasar M.J. Bartlett N.L. Flinn I.W. Bosch F. Impact of prior CAR T-cell therapy on mosunetuzumab efficacy in patients with relapsed or refractory B-cell lymphomas Blood Adv. 9 2025 696 703 10.1182/bloodadvances.2024013640 39571171 PMC11869845 76 Williams M. Spreafico A. Vashisht K. Hinrichs M.J. Patient Selection Strategies to Maximize Therapeutic Index of Antibody–Drug Conjugates: Prior Approaches and Future Directions Mol. Cancer Ther. 19 2020 1770 1783 10.1158/1535-7163.Mct-19-0993 32546659 77 Shah N. Chari A. Scott E. Mezzi K. Usmani S.Z. B-cell maturation antigen (BCMA) in multiple myeloma: rationale for targeting and current therapeutic approaches Leukemia 34 2020 985 1005 10.1038/s41375-020-0734-z 32055000 PMC7214244 78 Mailankody S. Liedtke M. Sidana S. Matous J.V. Chhabra S. Oluwole O.O. Malik S.A. Kumar S. Nath R. Anwer F. Universal Updated Phase 1 Data Validates the Feasibility of Allogeneic Anti-BCMA ALLO-715 Therapy for Relapsed/Refractory Multiple Myeloma Blood 138 2021 651 10.1182/blood-2021-145572 79 Li C. Mei H. Hu Y. Guo T. Liu L. Jiang H. Tang L. Wu Y. Ai L. Deng J. Jin D. A Bispecific CAR-T Cell Therapy Targeting Bcma and CD38 for Relapsed/Refractory Multiple Myeloma: Updated Results from a Phase 1 Dose-Climbing Trial Blood 134 2019 930 10.1182/blood-2019-130340 80 Cowan A.J. Pont M.J. Sather B.D. Turtle C.J. Till B.G. Libby E.N. 3rd Coffey D.G. Tuazon S.A. Wood B. Gooley T. γ-Secretase inhibitor in combination with BCMA chimeric antigen receptor T-cell immunotherapy for individuals with relapsed or refractory multiple myeloma: a phase 1, first-in-human trial Lancet Oncol. 24 2023 811 822 10.1016/s1470-2045(23)00246-2 37414012 PMC10783021 ",
  "metadata": {
    "Title of this paper": "γ-Secretase inhibitor in combination with BCMA chimeric antigen receptor T-cell immunotherapy for individuals with relapsed or refractory multiple myeloma: a phase 1, first-in-human trial",
    "Journal it was published in:": "Molecular Therapy Oncology",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12466123/"
  }
}