{
  "title": "Paper_672",
  "abstract": "pmc Int J Mol Sci Int J Mol Sci 808 ijms ijms International Journal of Molecular Sciences 1422-0067 Multidisciplinary Digital Publishing Institute  (MDPI) PMC12469403 PMC12469403.1 12469403 12469403 41009347 10.3390/ijms26188778 ijms-26-08778 1 Review The Roles of SHCBP1 in Cancer Hallmarks: Molecular Mechanisms and Therapeutic Implications https://orcid.org/0000-0001-8989-1951 Kim Hye-Youn 1 Park Ye-Jin 2 Ryu Soyeon 2 https://orcid.org/0000-0001-9338-5971 Hong Suntaek 1 2 * Krenacs Tibor Academic Editor 1 2 * sthong@gachon.ac.kr 09 9 2025 9 2025 26 18 497349 8778 11 8 2025 06 9 2025 08 9 2025 09 09 2025 27 09 2025 29 09 2025 © 2025 by the authors. 2025 https://creativecommons.org/licenses/by/4.0/ Licensee MDPI, Basel, Switzerland. This article is an open access article distributed under the terms and conditions of the Creative Commons Attribution (CC BY) license ( https://creativecommons.org/licenses/by/4.0/ The SHCBP1 (SHC SH2-domain-binding protein 1) is identified as an important regulator of cancer biology, participating in the modulation of multiple cancer hallmarks. Initially discovered as a component of the mitotic midbody essential for cytokinesis, SHCBP1 is now recognized for orchestrating a broad spectrum of oncogenic processes such as persistent proliferation, apoptosis resistance, epithelial–mesenchymal transition, and immune system evasion. This review comprehensively explores the molecular features of SHCBP1, its regulatory networks, and its multifaceted roles in cancer progression. SHCBP1 is commonly overexpressed in diverse cancers, with elevated expression levels strongly associated with more aggressive tumors and unfavorable patient prognosis. Mechanistically, SHCBP1 serves as a potential mediator of oncogenic signaling pathways, thereby regulating mitotic processes, transcriptional alterations, and cytoskeletal reorganization. In addition to its biological functions, SHCBP1 offers translational promise as a prognostic marker and a prospective therapeutic target. Preclinical models indicate that genetic depletion or pharmacologic disruption of SHCBP1 limits tumor growth, increases sensitivity to chemotherapy, and reduces metastatic capacity. Despite significant progress, the development of selective SHCBP1 inhibitors remain challenging areas. This review summarizes SHCBP1’s diverse roles in tumor pathogenesis and outlines future research directions to develop SHCBP1-targeted strategies. SHCBP1 cancer hallmarks therapeutic target prognostic biomarker National Research Foundation of Korea (NRF) grant funded by the Korean government (MSIT) RS-2022-NR072269 RS-2023-00246400 Basic Science Research Capacity Enhancement Project through Korea Basic Science Institute 2021R1A6C101A432 Gachon University research fund of 2023 GCU-202300650001 This work was supported by the National Research Foundation of Korea (NRF) grant funded by the Korean government (MSIT) to H.-Y.K. (RS-2022-NR072269) and the NRF grant funded by the MSIT (RS-2023-00246400), the Basic Science Research Capacity Enhancement Project through Korea Basic Science Institute (2021R1A6C101A432), and the Gachon University research fund of 2023 (GCU-202300650001) to S.H. pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement no pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes 1. Introduction Cancer constitutes a complex disease characterized by the stepwise acquisition of malignant properties that support unregulated cell growth, metastatic capacity, and resistance to anticancer therapies [ 1 2 3 4 Among various emerging regulatory proteins, SHC SH2-domain binding protein 1 (SHCBP1) has garnered increasing attention due to its diverse functions in cancer biology. Initially identified as a murine protein found in activated lymphocytes (mPAL) using yeast two-hybrid screening of T-cell and embryo libraries, SHCBP1 was recognized as a binding partner of the SHC1 SH2 domain that does not require phosphorylation [ 5 6 7 8 9 10 11 12 SHCBP1’s oncogenic properties are confirmed through clinical and laboratory studies. Increased SHCBP1 expression is detected in a wide range of tumors, including breast cancer, non-small-cell lung carcinoma (NSCLC), gastric adenocarcinoma, hepatocellular carcinoma (HCC), leukemias, gliomas, and cutaneous cancers [ 13 14 15 16 17 18 19 20 21 22 23 14 15 24 Despite recent significant advancements, there remains a lack of a comprehensive overview that delineates SHCBP1’s multifaceted roles in relation to the hallmark features of cancer. This review is designed to systematically analyze the molecular mechanisms through which SHCBP1 modulates each of the principal cancer hallmarks. We first describe the structural features and regulatory mechanisms that modulate SHCBP1 expression and function, followed by an extensive evaluation of its roles in tumorigenesis. In addition, we provide a critical assessment of SHCBP1’s prognostic biomarker value and review contemporary therapeutic strategies targeting SHCBP1-related pathways. Through the integration of these elements within the established cancer hallmarks framework, this review aims to offer new perspectives on SHCBP1’s function in tumorigenesis and to underscore its therapeutic potential. 2. Molecular Characteristics and Regulation of SHCBP1 2.1. Genomic Organization and Protein Structure The SHCBP1 gene resides on chromosome 16q11.2, comprising 13 exons that encodes a 5.2 kb mRNA translating into 672 amino acids [ 20 25 26 Figure 1 9 27 2.2. Dynamic Subcellular Localization and Cell Cycle Regulation SHCBP1 displays dynamic changes in its subcellular localization throughout the cell cycle. During interphase, the protein is primarily found in the cytoplasm; however, it relocates markedly to the midbody as cells progress through mitosis. This cell cycle-dependent distribution is stringently controlled by post-translational modifications, with phosphorylation events mediated by polo-like kinase 1 (PLK1) playing a critical role [ 6 9 28 16 29 SHCBP1’s subcellular localization is also influenced by growth factor signaling pathways. Upon epidermal growth factor (EGF) stimulation, SHCBP1 undergoes phosphorylation at Ser273, which prompts its translocation to the nucleus, where it takes part in activating downstream signaling pathways [ 21 23 2.3. Transcriptional and Post-Transcriptional Regulation of SHCBP1 Interestingly, previous study has shown that SHCBP1 exhibits cell type-specific expression. It is highly expressed in proliferative cells such as activated lymphocytes and stem cells, but almost undetectable in differentiated cells like cardiomyocytes [ 5 Figure 1 21 22 30 31 32 33 34 35 Recent findings have illuminated that SHCBP1 expression is extensively regulated post-transcriptionally by multiple noncoding RNAs ( Figure 1 36 37 38 2.4. Post-Translational Modifications of SHCBP1 SHCBP1 is also strongly regulated by a range of post-translational modifications that influence its activity, subcellular distribution, and protein stability ( Figure 1 6 23 39 The level of SHCBP1 protein within the cell is also modulated by ubiquitin-mediated proteasomal degradation. In neural progenitor cells, the E3 ubiquitin ligase mLin41 mediates SHCBP1 ubiquitination, stabilizing it in response to fibroblast growth factor (FGF) signaling and supporting neural development [ 8 40 41 The collective studies establish that SHCBP1 serves as a dynamically modulated adaptor protein performing diverse functions in oncogenic signaling, cell cycle control, and gene expression regulation. Its recurrent overexpression and activation in various human cancers emphasize its role as an important regulator in tumorigenesis. The intricate multi-level regulation of SHCBP1—spanning transcriptional, post-transcriptional, and post-translational processes—demonstrates the need for further investigation into SHCBP1–driven oncogenic mechanisms within specific cellular contexts. Elucidating these regulatory circuits could provide new therapeutic strategies by enabling targeted intervention in SHCBP1 or its downstream effectors in cancer. 3. Multifaceted Roles of SHCBP1 in the Hallmarks of Cancer As summarized in the preceding sections, SHCBP1 functions as a dynamically regulated adaptor protein integrating mitogenic signals, cytoskeletal rearrangements, and transcriptional regulation. Its elevated expression across diverse cancer types, as well as its regulation at transcriptional, post-transcriptional, and post-translational steps, positions SHCBP1 as a potential modulator of various aspects of cancer biology. Emerging evidence indicates that SHCBP1 drives several hallmark features of cancer, including sustained proliferation, apoptotic resistance, invasion, metastasis, and resistance to therapy. Here, we analyze the mechanistic functions of SHCBP1 in these processes and examine its involvement in the canonical hallmarks of cancer ( Figure 2 3.1. Sustaining Proliferative Signaling by SHCBP1 Persistent cell proliferation is a hallmark of cancer, arising from continual activation of mitogenic pathways and evasion of cell cycle checkpoints [ 3 In NSCLC, SHCBP1 augments EGF-driven nuclear β-catenin activity by associating with CREB binding protein (CBP), leading to increased transcription of genes associated with proliferation [ 21 42 15 At the mitotic level, SHCBP1 promotes cell division by interacting with midbody components MKLP1 and MgcRacGAP and activating PLK1 in a phosphorylation-dependent manner [ 9 43 16 44 3.2. Evading Growth Suppression by SHCBP1 In multicellular organisms, cell proliferation is stringently regulated by intrinsic tumor suppressor mechanisms that preserve tissue homeostasis and prevent neoplastic transformation [ 45 In breast cancer, upregulation of SHCBP1 correlates with suppression of CDKN1A (p21) and CDKN1B (p27), which are crucial inhibitors of CDK activity [ 13 46 42 47 3.3. Resisting Cell Death by SHCBP1 Apoptosis, also known as programmed cell death, is a crucial biological process that ensures tissue homeostasis by removing damaged, senescent, or potentially dangerous cells. In cancer, the ability to evade apoptosis is a key hallmark that enables cancer cells to survive in the presence of genomic instability, oncogenic stress, or therapeutic interventions [ 48 In lung cancer, SHCBP1 downregulates PTEN and inhibits caspase-3 activity, thereby suppressing intrinsic apoptosis [ 14 15 13 49 Furthermore, SHCBP1 is implicated in promoting chemoresistance by suppressing apoptosis-inducing signaling pathways. In gastric cancer, SHCBP1 facilitates cancer cell mitosis through hyperactivation of the HER2-mediated signaling pathway [ 39 50 51 52 As a recently characterized cell death mechanism, the cuproptosis pathway influences tumor growth by disrupting mitochondrial function upon copper exposure and inducing proteotoxic stress [ 53 54 3.4. Enabling Replicative Immortality by SHCBP1 Cancer stemness represents a critical hallmark of tumor progression, as it provides cancer cells with the capacity for self-renewal, differentiation plasticity, and replicative immortality, thereby promoting tumor heterogeneity and therapeutic resistance [ 55 In neural progenitor cells, SHCBP1 stability is maintained through E3 ubiquitin ligase mLin41-mediated ubiquitination in an FGF-dependent context, resulting in activation of downstream AKT/ERK signaling pathways that preserve self-renewal and proliferative potential [ 8 40 56 21 3.5. Inducing Angiogenesis by SHCBP1 Angiogenesis, the formation of new blood vessels from existing vasculature, is critical for tumor growth beyond a certain threshold and for metastatic spread. This process relies on a precisely regulated equilibrium between pro-angiogenic and anti-angiogenic mediators, with vascular endothelial growth factor (VEGF), angiopoietins, FGFs, and hypoxia-inducible factors serving as principal activators [ 57 Although SHCBP1 is not yet firmly recognized as a pro-angiogenic protein, accumulating data support its potential role in angiogenesis-related signaling pathways. In synovial sarcoma, upregulation of SHCBP1 resulted in greater VEGF secretion by cancer cells, which enhanced HUVEC tube formation and migration in vitro [ 22 19 58 59 3.6. Activating Invasion and Metastasis by SHCBP1 Metastasis, the leading cause of cancer-related death, encompasses several steps process involving EMT, local invasion, intravasation, survival within the circulatory system, and colonization of distant tissues [ 60 SHCBP1 is consistently associated with the promotion of EMT and metastatic characteristics in multiple cancer types [ 20 61 43 47 62 63 23 22 19 3.7. Deregulating Cellular Energetics by SHCBP1 Metabolic reprogramming is an essential hallmark of cancer, allowing cancer cells to maintain uncontrolled growth and survive in environments with limited nutrients or low oxygen levels [ 64 Although direct functional evidence linking SHCBP1 to metabolic reprogramming is still lacking, several indirect associations point to its potential involvement. For instance, ShcA, which interacts with SHCBP1, has been demonstrated to enhance both glycolysis and mitochondrial respiration in breast cancer cells through RTK-dependent activation and upregulation of PGC-1α, a central regulator of mitochondrial biogenesis [ 65 66 3.8. Avoiding Immune Destruction by SHCBP1 Immune evasion by cancers constitutes a great barrier to successful anti-cancer immune responses. Under physiological conditions, damaged cells are targeted and eliminated through immune surveillance mediated by cytotoxic T lymphocytes, natural killer cells, and antigen-presenting cells. Cancers, however, employ diverse mechanisms to evade immune detection, such as the upregulation of immune checkpoint molecules, increased secretion of immunosuppressive cytokines, and restructuring of the tumor microenvironment (TME) to promote regulatory and suppressive immune subsets [ 67 68 Recent pan-cancer analyses identified SHCBP1 as an important factor in immune evasion. High SHCBP1 expression is linked to greater infiltration of tumor-associated macrophage (TAM), CD4 + + 31 69 30 24 49 46 4. SHCBP1 as a Diagnostic and Prognostic Biomarker in Cancer The diverse oncogenic roles of SHCBP1, as discussed in previous sections, highlight its utility as a potential biomarker for multiple cancers. Increasing evidence from transcriptomic and proteomic analyses in various cancers indicates that elevated SHCBP1 expression is strongly linked to aggressive clinicopathological traits and poor patient prognoses ( Table 1 In breast cancer, both SHCBP1 mRNA and protein levels are significantly higher in tumor tissues when compared to normal tissue counterparts. Detailed investigation of TCGA datasets indicates that elevated SHCBP1 expression is strongly correlated with advanced clinicopathological characteristics, such as increased tumor size, higher histological grade, and lymph node metastasis [ 13 46 70 71 72 73 74 75 76 Studies in PDAC highlight the diagnostic value of SHCBP1, demonstrating that tissue expression can distinguish cancers from benign pancreatic lesions with high sensitivity and specificity [ 63 77 78 In lung cancer, including NSCLC and small cell lung cancer (SCLC), SHCBP1 is identified as a key component within gene networks implicated in brain metastasis, immune evasion, and metabolic regulation [ 66 79 80 81 82 83 In HCC, increased SHCBP1 expression, in combination with noncoding RNA levels, is associated with activation of mitotic genes and poorer survival outcomes in both TCGA and GEO cohorts [ 84 85 86 87 88 In prostate cancer, SHCBP1 expression is strongly associated with key clinical variables, such as PSA titers, Gleason score, seminal vesicle invasion, and disease stage [ 47 43 89 Beyond these major tumor types, SHCBP1 also exhibits significant prognostic potential in additional cancers. For instance, elevated SHCBP1 expression is observed in glioblastoma when compared to normal brain tissues and is linked to poorer overall survival rates in patients [ 19 36 90 91 17 22 38 50 52 54 92 According to multiple pan-cancer analyses, SHCBP1 expression is also positively associated with TMB, MSI, immune cell infiltration values, and the expression of immunosuppression-related genes, such as TGFBR1, PD-L1, and TGFB1 in various cancers [ 31 69 93 31 ijms-26-08778-t001_Table 1 Table 1 SHCBP1 expression levels and clinical relevance across various cancer types. Cancer Type Relevant Clinical Characteristics Prognostic Significance and Reference Breast cancer Tumor size ↑, Grade ↑, Lymph node metastasis ↑, TMB ↑, Stemness index ↑ OS ↓ p 13 p 72 46 73 74 p 13 Pancreatic cancer Tumor size ↑, Portal vein invasion ↑, AJCC stage ↑, CA19-9 ↑ OS ↓ p 63 77 78 p 63 77 77 Lung cancer TNM stage ↑, Metastasis ↑, OS ↓ p 66 p 79 p 80 p 81 82 HCC SHCBP1 level ↑, Immune cell infiltration ↑, TPX2 ↑ OS ↓ p 84 85 86 88 Prostate cancer PSA ↑, Gleason grade ↑, pT stage ↑, PFS ↓ p 43 p 47 Glioblastoma pT stage ↑, IDH mutation status ↑, OS ↓ p 19 p 36 p 90 Pan-cancer TMB ↑, MSI ↑, TAM ↑, OS ↓ p 31 69 93 p 69 93 p 31 93 ↑ represents an increase in the indicated phenomenon, whereas ↓ represents a decrease. Abbreviations: OS, Overall survival; HR, Hazard ratio; RFS, Relapse-free survival; TMB, Tumor mutation burden; AJCC, American joint committee on cancer; CA19-9, Cancer antigen 19-9; DFS, Disease-free survival; PFI, Progression-free interval; HCC, Hepatocellular carcinoma; TPX2, Targeting Protein for Xenopus kinesin-like protein 2; PSA, Prostate antigen; PFS, Progression-free survival; IDH, Isocitrate dehydrogenase; MSI, Microsatellite instability; TAM, Tumor-associated macrophage; IC50, half-maximum inhibitory concentration. 5. Therapeutic Targeting of SHCBP1 in Cancer Considering the diverse roles of SHCBP1 in tumor progression, therapy resistance, and modulation of the TME, it has been recognized as an attractive therapeutic target. While no SHCBP1-specific inhibitors have yet been implemented clinically, preclinical investigations utilizing genetic and pharmacological interventions have demonstrated that targeting SHCBP1 can suppress tumor growth and improve treatment outcomes. This section reviews present strategies for SHCBP1 inhibition, including RNA interference (RNAi), CRISPR-Cas9, and pharmacologic compounds, and discusses combination approaches that leverage SHCBP1’s diverse function in oncogenic networks ( Table 2 5.1. Genetic Suppression of SHCBP1 for Antitumor Therapy For several cancers, small interfering RNA (siRNA)-mediated SHCBP1 knockdown diminishes tumor cell proliferation, induces apoptosis, and suppresses metastatic capabilities. In lung cancer, SHCBP1 silencing induces caspase-3 activation through PTEN upregulation and suppresses Wnt/β-catenin-mediated survival signaling [ 14 51 46 56 15 43 50 63 Moving beyond transient gene silencing, CRISPR-Cas9-mediated genome editing produced more sustained antitumor effects. In breast and pancreatic cancer models, SHCBP1 knockout suppressed tumor progression in both 2D and 3D organoid systems and in patient-derived xenograft models [ 13 77 62 24 Overall, these findings establish SHCBP1 as a therapeutically actionable target whose genetic suppression may enhance the effectiveness of standard chemotherapy and immunotherapy strategies across a broad spectrum of cancers. Advances in nanoparticle-mediated delivery systems, including liposomes and micelles, have improved the stability and tumor-specific delivery of RNAi molecules in vivo [ 94 95 96 97 98 5.2. Pharmacological Inhibition of SHCBP1 for Anticancer Therapy Pharmacologic inhibition of SHCBP1 remains difficult due to the lack of enzymatic domains or clearly defined active sites. However, computational screening, structure-based drug design, and transcriptome-guided compound selection have led to the identification of several candidate molecules that target SHCBP1 or its related signaling pathways. Structure-based virtual screening using the AlphaFold-predicted SHCBP1 model identified AZD5582 as a potential SHCBP1-binding compound, which can suppress pancreatic cancer growth and metastasis through induction of apoptosis [ 77 81 76 85 Recently, numerous pharmaceutical companies have focused on identifying anti-tumorigenic compounds from natural products by employing enhanced analytical tools and rational strategy development [ 99 100 39 44 92 These findings indicate that SHCBP1-targeted small molecules, whether acting directly or through its downstream pathways, offer a promising therapeutic strategy, especially in cancers exhibiting high SHCBP1 expression. 5.3. SHCBP1-Targeted Combination Strategies in Cancer Therapy The important role of SHCBP1 in various oncogenic and immunomodulatory pathways highlights its value as a sensitizing target for combination cancer therapies. For example, ICG-001 substantially inhibited EGF or SHCBP1-mediated CBP/β-catenin interaction in lung cancer [ 21 52 29 24 30 Taken together, SHCBP1 emerges as a compelling, yet inherently challenging, therapeutic target across diverse cancers. Its inhibition not only disrupts cancer-intrinsic growth and survival pathways, but also enhances the efficacy of combination therapies such as chemotherapy and immunotherapy, thereby raising the possibility of its application into clinical trials. However, the lack of enzymatic or ligand-binding domains makes the direct pharmacological targeting of SHCBP1 intrinsically difficult, and most of the current therapeutic studies remain at an early preclinical stage with limited validation in clinical trials. Furthermore, the translation of these preliminary findings into practice requires a more studies for druggability, biomarker development, and long-term safety, underscoring that significant conceptual and technical hurdles remain to be addressed before SHCBP1 can be considered a realistic therapeutic option. 6. Limitations and Future Directions In this review, we summarized the roles of SHCBP1 in cancer hallmarks, exerting diverse functions in regulating mitotic dynamics, oncogenic signaling, stemness, and metastasis. However, despite these broad functional associations, limitations still remain in fully defining its mechanistic contributions. In particular, while SHCBP1 is implicated in processes such as metabolic reprogramming, stemness, angiogenesis, and immune evasion, current evidence suggests that its influence is often exerted indirectly through modulation of upstream or downstream mediators rather than by direct regulation of these pathways. This distinction raises important questions about the extent to which SHCBP1 serves as a driver versus a passenger of these hallmarks. To address this gap, future studies should aim to provide direct experimental evidence clarifying whether SHCBP1 actively orchestrates these processes in cancer pathology, or whether its role is secondary to broader signaling cascades. Resolving this uncertainty will be essential for accurately defining SHCBP1’s therapeutic relevance and for prioritizing strategies that target its most critical oncogenic functions. Although previous preclinical evidence from in vitro models, animal studies, and large-scale bioinformatic analyses supports SHCBP1 targeting, the development of potent direct SHCBP1 inhibitors remains technically difficult. As a non-enzymatic scaffold protein, SHCBP1 does not possess a catalytic domain or a well-characterized ligand binding site, limiting the applicability of standard small-molecule inhibitor design. To date, most studies exploring SHCBP1 inhibition remain at a preliminary stage and the observed therapeutic effects are often mediated indirectly through modulation of upstream regulators or downstream effectors rather than through direct targeting SHCBP1 itself [ 77 81 101 102 103 104 105 106 Another limitation in developing SHCBP1-targeted therapies lies in the incomplete understanding of its three-dimensional structure, which requires for rational drug discovery and the identification of specific inhibitors. To overcome this challenge, precise structural characterization of SHCBP1—particularly its modular domains that mediate interactions with mitogenic and oncogenic partners—is imperative. High-resolution techniques like X-ray crystallography or cryo-EM may delineate critical conformational aspects essential for designing selective and high-affinity inhibitor [ 107 108 109 110 A further important, though insufficiently investigated, avenue involves SHCBP1’s contribution to the modulation of anti-tumor immunity. Its mechanistic participation in pathways mediating immune evasion has not been clearly defined, and clarifying its role within the immune microenvironment of tumors could support the rationale for combinatorial treatments involving ICIs. Notably, SHCBP1 expression and cellular reliance are highly modulated by tumor context. Large-scale pan-cancer studies suggest associations between SHCBP1 amplification or overexpression and tumor characteristics such as mitotic stress, stemness features, or hyperactive oncogenic signaling [ 31 72 Moreover, successfully implementing SHCBP1-targeted therapies in the clinic will rely on the creation and deployment of companion diagnostics capable of robustly quantifying SHCBP1 expression or functional activity in cancer tissues [ 111 112 5 7. Conclusions SHCBP1 is recognized as a multifunctional adaptor protein of considerable importance in cancer biology. As discussed in this review, SHCBP1 is consistently overexpressed in a variety of cancers and facilitates tumorigenesis by coordinating a broad range of oncogenic activities and modulating the hallmarks of cancer. These activities encompass promoting sustained proliferative signaling, resisting apoptosis, contributing to invasion and metastasis, supporting replicative immortality, and influencing metabolic reprogramming and immune evasion. On a mechanistic level, SHCBP1 functions as an important scaffold that mediates several major oncogenic signaling pathways, such as the EGFR–MAPK, PLK1–CEP55, and PI3K–Akt axes. It undergoes regulation at the transcriptional, epigenetic, and post-transcriptional stages, allowing for context-dependent modulation of its expression and activity. This regulatory flexibility enables SHCBP1 to adapt its function within diverse TMEs and promote tumor aggressiveness. From a clinical perspective, elevated SHCBP1 expression is associated with poor prognosis, including higher tumor grade, lymphovascular invasion, and diminished overall and disease-free survival across diverse cancer types such as breast cancer, lung adenocarcinoma, HCC, glioblastoma, and gastric cancer. In some scenarios, SHCBP1 is linked to resistance to therapies, especially those involving DNA-damaging agents and immunotherapy. From a therapeutic standpoint, genetic or pharmacological inhibition of SHCBP1 through RNAi, CRISPR-mediated editing, or modulation of its upstream regulatory factors has produced strong anti-cancer effects in various preclinical models. These observations highlight SHCBP1 as a druggable target, particularly in cancers characterized by mitotic dependence, EMT features, or high proliferation. Notably, suppression of SHCBP1 also augments the anticancer efficacy of conventional chemotherapy and targeted agents, supporting its emerging role in combination therapeutic approaches. Acknowledgments We thank all members of our laboratory for kind discussion. Disclaimer/Publisher’s Note: Author Contributions Conceptualization, H.-Y.K., Y.-J.P. and S.H.; writing—original draft preparation, H.-Y.K., Y.-J.P. and S.R.; writing—review and editing, H.-Y.K., Y.-J.P., S.R. and S.H.; supervision, S.H. All authors have read and agreed to the published version of the manuscript. Conflicts of Interest The authors declare no conflicts of interest. Abbreviations The following abbreviations are used in this manuscript: SHCBP1 SHC SH2-domain binding protein 1 mPAL Murine protein of activated lymphocytes NSCLC Non-small cell lung carcinoma HCC Hepatocellular carcinoma CDK Cyclin-dependent kinase EMT Epithelial–mesenchymal transition PbH1 Parallel beta-helix PLK1 Polo-like kinase 1 EGF Epidermal growth factor TGF-β Transforming growth factor β MiRNA MicroRNA LncRNA Long noncoding RNA CeRNA Competing endogenous RNA AURKB Aurora kinase B FGF Fibroblast growth factor USP49 Ubiquitin-specific peptidase 49 CBP CREB binding protein HNSCC Head and neck squamous cell carcinoma VEGF Vascular endothelial growth factor RTK Receptor tyrosine kinase PDAC Pancreatic ductal adenocarcinoma EOGT EGF domain specific O-linked GlcNActransferase TME Tumor microenvironment TAM Tumor-associated macrophage TMB Tumor mutation burden MSI Microsatellite instability CAG Cancer–associated fibroblast ICI Immune checkpoint inhibitor PPI Protein–protein interaction SCLC Small cell lung cancer RNAi RNA interference SiRNA Small interfering RNA ShRNA Short hairpin RNA TFBG Theaflavin-3,3′-digallate References 1. Zhang S. Xiao X. Yi Y. Wang X. Zhu L. Shen Y. Lin D. Wu C. Tumor initiation and early tumorigenesis: Molecular mechanisms and interventional targets Signal Transduct. Target. Ther. 2024 9 149 10.1038/s41392-024-01848-7 38890350 PMC11189549 2. de Visser K.E. Joyce J.A. The evolving tumor microenvironment: From cancer initiation to metastatic outgrowth Cancer Cell 2023 41 374 403 10.1016/j.ccell.2023.02.016 36917948 3. Hanahan D. Hallmarks of Cancer: New Dimensions Cancer Discov. 2022 12 31 46 10.1158/2159-8290.cd-21-1059 35022204 4. Hanahan D. Weinberg R.A. Hallmarks of cancer: The next generation Cell 2011 144 646 674 10.1016/j.cell.2011.02.013 21376230 5. Schmandt R. Liu S.K. McGlade C.J. Cloning and characterization of mPAL, a novel Shc SH2 domain-binding protein expressed in proliferating cells Oncogene 1999 18 1867 1879 10086341 10.1038/sj.onc.1202507 6. Asano E. Hasegawa H. Hyodo T. Ito S. Maeda M. Takahashi M. Hamaguchi M. Senga T. The Aurora-B-mediated phosphorylation of SHCBP1 regulates cytokinetic furrow ingression J. Cell Sci. 2013 126 3263 3270 23704356 10.1242/jcs.124875 7. Zheng Y. Zhang C. Croucher D.R. Soliman M.A. St-Denis N. Pasculescu A. Taylor L. Tate S.A. Hardy W.R. Colwill K. Temporal regulation of EGF signalling networks by the scaffold protein Shc1 Nature 2013 499 166 171 10.1038/nature12308 23846654 PMC4931914 8. Chen J. Lai F. Niswander L. The ubiquitin ligase mLin41 temporally promotes neural progenitor cell maintenance through FGF signaling Genes Dev. 2012 26 803 815 10.1101/gad.187641.112 22508726 PMC3337455 9. Asano E. Hasegawa H. Hyodo T. Ito S. Maeda M. Chen D. Takahashi M. Hamaguchi M. Senga T. SHCBP1 is required for midbody organization and cytokinesis completion Cell Cycle 2014 13 2744 2751 10.4161/15384101.2015.945840 25486361 PMC4612664 10. Buckley M.W. Arandjelovic S. Trampont P.C. Kim T.S. Braciale T.J. Ravichandran K.S. Unexpected phenotype of mice lacking Shcbp1, a protein induced during T cell proliferation PLoS ONE 2014 9 e105576 25153088 10.1371/journal.pone.0105576 PMC4143286 11. Montembault E. Zhang W. Przewloka M.R. Archambault V. Sevin E.W. Laue E.D. Glover D.M. D’Avino P.P. Nessun Dorma, a novel centralspindlin partner, is required for cytokinesis in Drosophila spermatocytes J. Cell Biol. 2010 191 1351 1365 10.1083/jcb.201007060 21187330 PMC3010078 12. Ito M. Iwasaki M. Takeda M. Nakamura T. Yanagi Y. Ohno S. Measles virus nonstructural C protein modulates viral RNA polymerase activity by interacting with host protein SHCBP1 J. Virol. 2013 87 9633 9642 10.1128/jvi.00714-13 23804634 PMC3754092 13. Feng W. Li H.C. Xu K. Chen Y.F. Pan L.Y. Mei Y. Cai H. Jiang Y.M. Chen T. Feng D.X. SHCBP1 is over-expressed in breast cancer and is important in the proliferation and apoptosis of the human malignant breast cancer cell line Gene 2016 587 91 97 10.1016/j.gene.2016.04.046 27129942 14. Wang F. Li Y. Zhang Z. Wang J. Wang J. SHCBP1 regulates apoptosis in lung cancer cells through phosphatase and tensin homolog Oncol. Lett. 2019 18 1888 1894 10.3892/ol.2019.10520 31423258 PMC6614682 15. Dong Y.D. Yuan Y.L. Yu H.B. Tian G.J. Li D.Y. SHCBP1 is a novel target and exhibits tumor-promoting effects in gastric cancer Oncol. Rep. 2019 41 1649 1657 30592290 10.3892/or.2018.6952 PMC6365712 16. Tao H.C. Wang H.X. Dai M. Gu C.Y. Wang Q. Han Z.G. Cai B. Targeting SHCBP1 inhibits cell proliferation in human hepatocellular carcinoma cells Asian Pac. J. Cancer Prev. 2013 14 5645 5650 10.7314/APJCP.2013.14.10.5645 24289556 17. Ren C. Zhou Z. Wang X. Hua X. Zou M. Zhang X. SHCBP1 Promotes the Progression of Esophageal Squamous Cell Carcinoma Via the TGFβ Pathway Appl. Immunohistochem. Mol. Morphol. 2021 29 136 143 10.1097/PAI.0000000000000858 32769441 PMC7993916 18. Piccaluga P.P. Agostinelli C. Califano A. Rossi M. Basso K. Zupo S. Went P. Klein U. Zinzani P.L. Baccarani M. Gene expression analysis of peripheral T cell lymphoma, unspecified, reveals distinct profiles and new potential therapeutic targets J. Clin. Investig. 2007 117 823 834 10.1172/jci26833 17304354 PMC1794115 19. Zhou Y. Tan Z. Chen K. Wu W. Zhu J. Wu G. Cao L. Zhang X. Zeng X. Li J. Overexpression of SHCBP1 promotes migration and invasion in gliomas by activating the NF-kappaB signaling pathway Mol. Carcinog. 2018 57 1181 1190 10.1002/mc.22834 29745440 20. Lin Y. Cai H. Biological functions and therapeutic potential of SHCBP1 in human cancer Biomed. Pharmacother. 2023 160 114362 10.1016/j.biopha.2023.114362 36739763 21. Liu L. Yang Y. Liu S. Tao T. Cai J. Wu J. Guan H. Zhu X. He Z. Li J. EGF-induced nuclear localization of SHCBP1 activates β-catenin signaling and promotes cancer progression Oncogene 2019 38 747 764 30177836 10.1038/s41388-018-0473-z PMC6355651 22. Peng C. Zhao H. Song Y. Chen W. Wang X. Liu X. Zhang C. Zhao J. Li J. Cheng G. SHCBP1 promotes synovial sarcoma cell metastasis via targeting TGF-β1/Smad signaling pathway and is associated with poor prognosis J. Exp. Clin. Cancer Res. 2017 36 141 29020987 10.1186/s13046-017-0616-z PMC5637052 23. Yin H. Zhang C. Wei Z. He W. Xu N. Xu Y. Li T. Ren K. Kuang Y. Zhu X. EGF-induced nuclear translocation of SHCBP1 promotes bladder cancer progression through inhibiting RACGAP1-mediated RAC1 inactivation Cell Death Dis. 2022 13 39 35013128 10.1038/s41419-021-04479-w PMC8748695 24. Gu Q. Ma Z. Wang Q. Dai Y. Shi W. Jiao Z. Knockout of Shcbp1 sensitizes immunotherapy by regulating alpha-SMA positive cancer-associated fibroblasts Mol. Carcinog. 2024 63 601 616 10.1002/mc.23675 38169303 25. Dephoure N. Zhou C. Villen J. Beausoleil S.A. Bakalarski C.E. Elledge S.J. Gygi S.P. A quantitative atlas of mitotic phosphorylation Proc. Natl. Acad. Sci. USA 2008 105 10762 10767 18669648 10.1073/pnas.0805139105 PMC2504835 26. Olsen J.V. Vermeulen M. Santamaria A. Kumar C. Miller M.L. Jensen L.J. Gnad F. Cox J. Jensen T.S. Nigg E.A. Quantitative phosphoproteomics reveals widespread full phosphorylation site occupancy during mitosis Sci. Signal 2010 3 ra3 10.1126/scisignal.2000475 20068231 27. Pelicci G. Dente L. De Giuseppe A. Verducci-Galletti B. Giuli S. Mele S. Vetriani C. Giorgio M. Pandolfi P.P. Cesareni G. A family of Shc related proteins with conserved PTB, CH1 and SH2 regions Oncogene 1996 13 633 641 8760305 28. Hutchins J.R. Toyoda Y. Hegemann B. Poser I. Heriche J.K. Sykora M.M. Augsburg M. Hudecz O. Buschhorn B.A. Bulkescher J. Systematic analysis of human protein complexes identifies chromosome segregation proteins Science 2010 328 593 599 10.1126/science.1181348 20360068 PMC2989461 29. Zhou M. Duan L. Chen J. Li Y. Yin Z. Song S. Cao Y. Luo P. Hu F. Yang G. The dynamic role of nucleoprotein SHCBP1 in the cancer cell cycle and its potential as a synergistic target for DNA-damaging agents in cancer therapy Cell Commun. Signal. 2024 22 131 38365687 10.1186/s12964-024-01513-0 PMC10874017 30. Mo L. Deng M. Adhav R. Chan Y. Lei J.H. Su S.M. Zhang X. An T. Liu J. Li J. Oncogenic activation of SMYD3-SHCBP1 promotes breast cancer development and is coupled with resistance to immune therapy Cell Death Dis. 2025 16 220 10.1038/s41419-025-07570-8 40157910 PMC11954966 31. Huang Y. You M. Wu Q. Zhu W. Guo F. Lin W. SHCBP1 Is a Prognostic Biomarker Related to the Tumour Immune Microenvironment in Pan-Cancer Ann. Clin. Lab. Sci. 2022 52 904 917 36564070 32. Peng C. Zhao H. Chen W. Song Y. Wang X. Li J. Qiao Y. Wu D. Ma S. Wang X. Identification of SHCBP1 as a novel downstream target gene of SS18-SSX1 and its functional analysis in progression of synovial sarcoma Oncotarget 2016 7 66822 66834 10.18632/oncotarget.11651 27572315 PMC5341840 33. Ebegboni V.J. Jones T.L. Brownmiller T. Zhao P.X. Pehrsson E.C. Rajan S.S. Caplen N.J. ETS1, a target gene of the EWSR1::FLI1 fusion oncoprotein, regulates the expression of the focal adhesion protein TENSIN3 Mol. Cancer Res. 2024 22 625 641 10.1158/1541-7786.MCR-23-1090 38588446 PMC11219265 34. So C.L. Lee Y.J. Vokshi B.H. Chen W. Huang B. De Sousa E. Gao Y. Portuallo M.E. Begum S. Jagirdar K. TFE3 fusion oncoprotein condensates drive transcriptional reprogramming and cancer progression in translocation renal cell carcinoma Cell Rep. 2025 44 115539 10.1016/j.celrep.2025.115539 40222010 PMC12077596 35. Zheng Q. Wang T. Zou Z. Ma W. Dong Z. Zhong J. Liu W. Xu Y. Hu T. Sun W. Gene Fusions as Potential Therapeutic Targets in Soft Tissue Sarcomas Biomolecules 2025 15 904 10.3390/biom15060904 40563544 PMC12191211 36. Xuan C. Jin M. Wang L. Xue S. An Q. Sun Q. Wang L. Gao Y. PART1 and hsa-miR-429-Mediated SHCBP1 Expression Is an Independent Predictor of Poor Prognosis in Glioma Patients Biomed. Res. Int. 2020 2020 1767056 10.1155/2020/1767056 32351983 PMC7174919 37. Gao W. Qi C.Q. Feng M.G. Yang P. Liu L. Sun S.H. SOX 2 J. Cell Physiol. 2020 235 6684 6696 32003010 10.1002/jcp.29564 38. Wang H. Zhang Z. Zhang Y. Liu S. Li L. Long Non-Coding RNA TP53TG1 Upregulates SHCBP1 to Promote Retinoblastoma Progression by Sponging miR-33b Cell Transplant. 2021 30 9636897211025223 10.1177/09636897211025223 34247545 PMC8278459 39. Shi W. Zhang G. Ma Z. Li L. Liu M. Qin L. Yu Z. Zhao L. Liu Y. Zhang X. Hyperactivation of HER2-SHCBP1-PLK1 axis promotes tumor cell mitosis and impairs trastuzumab sensitivity to gastric cancer Nat. Commun. 2021 12 2812 10.1038/s41467-021-23053-8 33990570 PMC8121856 40. Li Y.P. Duan F.F. Zhao Y.T. Gu K.L. Liao L.Q. Su H.B. Hao J. Zhang K. Yang N. Wang Y. A TRIM71 binding long noncoding RNA Trincr1 represses FGF/ERK signaling in embryonic stem cells Nat. Commun. 2019 10 1368 10.1038/s41467-019-08911-w 30911006 PMC6433952 41. Ding Y. Liu Z. Dai X. Ruan R. Zhong H. Wu Z. Yao Y. Chen J. Deng J. Xiong J. Ubiquitin-specific peptidase 49 promotes adenocarcinoma of the esophagogastric junction malignant progression via activating SHCBP1-β-catenin-GPX4 axis Carcinogenesis 2025 46 bgae060 10.1093/carcin/bgae060 39234990 42. Lu H. Yin M. Wang L. Cheng J. Cheng W. An H. Zhang T. FGF13 interaction with SHCBP1 activates AKT-GSK3α/β signaling and promotes the proliferation of A549 cells Cancer Biol. Ther. 2020 21 1014 1024 33064958 10.1080/15384047.2020.1824512 PMC7678946 43. Tang C. Peng S. Chen Y. Cheng B. Li S. Zhou J. Wu Y. Li L. Zhong H. Guo Z. SHCBP1 is a novel regulator of PLK1 phosphorylation and promotes prostate cancer bone metastasis MedComm 2025 6 e70082 10.1002/mco2.70082 39949984 PMC11822462 44. Yu X. Sun Z. Nie S. Zhang T. Lu H. Effects of Resveratrol on Mouse B16 Melanoma Cell Proliferation through the SHCBP1-ERK1/2 Signaling Pathway Molecules 2023 28 7614 10.3390/molecules28227614 38005336 PMC10674768 45. Engeland K. Cell cycle regulation: p53-p21-RB signaling Cell Death Differ. 2022 29 946 960 10.1038/s41418-022-00988-z 35361964 PMC9090780 46. Yu X. Feng G. Nian R. Han S. Ke M. Wang L. Li W. Tian S. Lu H. SHCBP1 Promotes the Proliferation of Breast Cancer Cells by Inhibiting CXCL2 J. Cancer 2023 14 3444 3456 10.7150/jca.88072 38021148 PMC10647193 47. Xu N. Wu Y.P. Yin H.B. Chen S.H. Li X.D. Xue X.Y. Gou X. SHCBP1 promotes tumor cell proliferation, migration, and invasion, and is associated with poor prostate cancer prognosis J. Cancer Res. Clin. Oncol. 2020 146 1953 1969 10.1007/s00432-020-03247-1 32447485 PMC11804494 48. Hanahan D. Weinberg R.A. The hallmarks of cancer Cell 2000 100 57 70 10.1016/s0092-8674(00)81683-9 10647931 49. Chen G. Li W. Ge R. Guo T. Zhang Y. Zhou C. Lin M. NUSAP1 Promotes Immunity and Apoptosis by the SHCBP1/JAK2/STAT3 Phosphorylation Pathway to Induce Dendritic Cell Generation in Hepatocellular Carcinoma J. Immunother. 2025 48 46 57 38980111 10.1097/CJI.0000000000000531 PMC11753460 50. Sun Y. Pan H. He Y. Hu C. Gu Y. Functional roles of the SHCBP1 and KIF23 interaction in modulating the cell-cycle and cisplatin resistance of head and neck squamous cell carcinoma Head Neck 2022 44 591 605 34918847 10.1002/hed.26961 51. Zou A. Wu A. Luo M. Zhou C. Lu Y. Yu X. SHCBP1 promotes cisplatin induced apoptosis resistance, migration and invasion through activating Wnt pathway Life Sci. 2019 235 116798 10.1016/j.lfs.2019.116798 31472149 52. Qi G. Ma H. Teng K. Gai P. Gong Y. Chen J. Luo X. Kong B. SHCBP1 promotes cisplatin resistance of ovarian cancer through AKT/mTOR/Autophagy pathway Apoptosis 2025 30 83 98 10.1007/s10495-024-02027-3 39397124 53. Tang D. Kroemer G. Kang R. Targeting cuproplasia and cuproptosis in cancer Nat. Rev. Clin. Oncol. 2024 21 370 388 10.1038/s41571-024-00876-0 38486054 54. Lin K. Hu K. Chen Q. Wu J. The function and immune role of cuproptosis associated hub gene in Barrett’s esophagus and esophageal adenocarcinoma Biosci. Trends 2023 17 381 392 10.5582/bst.2023.01164 37866883 55. Loh J.J. Ma S. Hallmarks of cancer stemness Cell Stem Cell 2024 31 617 639 10.1016/j.stem.2024.04.004 38701757 56. Deng B. Li A. Zhu Y. Zhou Y. Fei J. Miao Y. SHCBP1 contributes to the proliferation and self-renewal of cervical cancer cells and activation of the NF-kappaB signaling pathway through EIF5A Oncol. Lett. 2023 25 246 10.3892/ol.2023.13832 37153055 PMC10161342 57. Liu Z.L. Chen H.H. Zheng L.L. Sun L.P. Shi L. Angiogenic signaling pathways and anti-angiogenic therapy for cancer Signal Transduct. Target. Ther. 2023 8 198 10.1038/s41392-023-01460-1 37169756 PMC10175505 58. Mo M. Tong S. Yin H. Jin Z. Zu X. Hu X. SHCBP1 regulates STAT3/c-Myc signaling activation to promote tumor progression in penile cancer Am. J. Cancer Res. 2020 10 3138 3156 33163262 PMC7642648 59. Saucier C. Khoury H. Lai K.M. Peschard P. Dankort D. Naujokas M.A. Holash J. Yancopoulos G.D. Muller W.J. Pawson T. The Shc adaptor protein is critical for VEGF induction by Met/HGF and ErbB2 receptors and for early onset of tumor angiogenesis Proc. Natl. Acad. Sci. USA 2004 101 2345 2350 10.1073/pnas.0308065101 14983012 PMC356953 60. Mani K. Deng D. Lin C. Wang M. Hsu M.L. Zaorsky N.G. Causes of death among people living with metastatic cancer Nat. Commun. 2024 15 1519 10.1038/s41467-024-45307-x 38374318 PMC10876661 61. Zhang G.Y. Ma Z.J. Wang L. Sun R.F. Jiang X.Y. Yang X.J. Long B. Ye H.L. Zhang S.Z. Yu Z.Y. The Role of Shcbp1 in Signaling and Disease Curr. Cancer Drug Targets 2019 19 854 862 10.2174/1568009619666190620114928 31250756 62. Shi W. Li L. Zhao H. Li Z. Ma Z. Gu Q. Ye H. Jiang X. Dong Y. Qin L. Targeting SHCBP1 Inhibits Tumor Progression by Restoring Ciliogenesis in Ductal Carcinoma Cancer Res. 2024 84 4156 4172 10.1158/0008-5472.CAN-24-1095 39312205 63. Yang C. Hu J.F. Zhan Q. Wang Z.W. Li G. Pan J.J. Huang L. Liao C.Y. Huang Y. Tian Y.F. SHCBP1 interacting with EOGT enhances O-GlcNAcylation of NOTCH1 and promotes the development of pancreatic cancer Genomics 2021 113 827 842 33515675 10.1016/j.ygeno.2021.01.010 64. Vander Heiden M.G. DeBerardinis R.J. Understanding the Intersections between Metabolism and Cancer Biology Cell 2017 168 657 669 10.1016/j.cell.2016.12.039 28187287 PMC5329766 65. Im Y.K. Najyb O. Gravel S.P. McGuirk S. Ahn R. Avizonis D.Z. Chenard V. Sabourin V. Hudson J. Pawson T. Interplay between ShcA Signaling and PGC-1alpha Triggers Targetable Metabolic Vulnerabilities in Breast Cancer Cancer Res. 2018 78 4826 4838 10.1158/0008-5472.CAN-17-3696 29930100 66. Zeng L. Wu S. Li Z. Tang Y. Tan Y. Liang R. Li Y. A novel mitochondrial quality regulation gene signature for anticipating prognosis, TME, and therapeutic response in LUAD by multi-omics analysis and experimental verification Cancer Cell Int. 2025 25 138 10.1186/s12935-025-03764-4 40211263 PMC11987467 67. Zhao H. Wu L. Yan G. Chen Y. Zhou M. Wu Y. Li Y. Inflammation and tumor progression: Signaling pathways and targeted intervention Signal Transduct. Target. Ther. 2021 6 263 10.1038/s41392-021-00658-5 34248142 PMC8273155 68. Wen Y. Zhu Y. Zhang C. Yang X. Gao Y. Li M. Yang H. Liu T. Tang H. Chronic inflammation, cancer development and immunotherapy Front. Pharmacol. 2022 13 1040163 10.3389/fphar.2022.1040163 36313280 PMC9614255 69. Jiang F. Shi Y. Wang Y. Ge C. Zhu J. Fang H. Zhang Y. Zhang Y. Jian H. Lei T. Characterization of SHCBP1 to prognosis and immunological landscape in pan-cancer: Novel insights to biomarker and therapeutic targets Aging 2023 15 2066 2081 10.18632/aging.204591 36920183 PMC10085602 70. Oshi M. Katsuta E. Yan L. Ebos J.M.L. Rashid O.M. Matsuyama R. Endo I. Takabe K. A Novel 4-Gene Score to Predict Survival, Distant Metastasis and Response to Neoadjuvant Therapy in Breast Cancer Cancers 2020 12 1148 10.3390/cancers12051148 32370309 PMC7281399 71. Wang J. Yang Z. Zhang C. Ouyang J. Zhang G. Wu C. A four-gene signature in the tumor microenvironment that significantly associates with the prognosis of patients with breast cancer Gene 2020 761 145049 10.1016/j.gene.2020.145049 32791092 72. Zhou Q. Liu X. Lv M. Sun E. Lu X. Lu C. Genes That Predict Poor Prognosis in Breast Cancer via Bioinformatical Analysis Biomed. Res. Int. 2021 2021 6649660 10.1155/2021/6649660 33959662 PMC8075678 73. Liu N. Zhang G.D. Bai P. Su L. Tian H. He M. Eight hub genes as potential biomarkers for breast cancer diagnosis and prognosis: A TCGA-based study World J. Clin. Oncol. 2022 13 675 688 10.5306/wjco.v13.i8.675 36160462 PMC9476610 74. Zhao X. Lin J. Construction and Validation of a Prognostic Model Based on mRNAsi-Related Genes in Breast Cancer Comput. Math. Methods Med. 2022 2022 6532591 10.1155/2022/6532591 36267313 PMC9578885 75. Wu M. Lu L. Dai T. Li A. Yu Y. Li Y. Xu Z. Chen Y. Construction of a lncRNA-mediated ceRNA network and a genomic-clinicopathologic nomogram to predict survival for breast cancer patients Cancer Biomark. 2023 36 83 96 10.3233/CBM-210545 36591654 PMC12412795 76. Zhao J. Li L. Wang Y. Huo J. Wang J. Xue H. Cai Y. Identification of gene signatures associated with lactation for predicting prognosis and treatment response in breast cancer patients through machine learning Sci. Rep. 2025 15 13575 10.1038/s41598-025-98255-x 40253524 PMC12009422 77. Ma Z. Gu Q. Dai Y. Wang Q. Shi W. Jiao Z. Therapeutic potential of SHCBP1 inhibitor AZD5582 in pancreatic cancer treatment Cancer Sci. 2024 115 820 835 10.1111/cas.16059 38151993 PMC10921007 78. Shi H. Xu H. Chai C. Qin Z. Zhou W. Integrated bioinformatics analysis of potential biomarkers for pancreatic cancer J. Clin. Lab. Anal. 2022 36 e24381 10.1002/jcla.24381 35403252 PMC9102654 79. Cao J. Yu C. Identification of Immune Infiltration and Prognostic Biomarkers in Small Cell Lung Cancer Based on Bioinformatic Methods from 3 Studies Comb. Chem. High. Throughput Screen. 2023 26 507 516 35400336 10.2174/1386207325666220408092925 80. Gong Z. Yu F. Li C. Zhao B. Wen M. Zhang S. Xu Z. Wu A. Zang R. Li Y. Four-gene Prognostic Signature and Risk of Brain Metastasis of Lung Adenocarcinoma Mol. Carcinog. 2025 64 1209 1221 10.1002/mc.23922 40222041 PMC12183640 81. Dai Y. Hu C. Zhou H. Liu W. Lai W. Xu R. Liao J. Wang J. Li G. Zhang R. Rucaparib inhibits lung adenocarcinoma cell proliferation and migration via the SHCBP1/CDK1 pathway FEBS J. 2023 290 5720 5743 10.1111/febs.16933 37581853 82. Li Y. Shi R. Zhu G. Chen C. Huang H. Gao M. Xu S. Cao P. Zhang Z. Wu D. Construction of a circular RNA-microRNA-messenger RNA regulatory network of hsa_circ_0043256 in lung cancer by integrated analysis Thorac. Cancer 2022 13 61 75 10.1111/1759-7714.14226 34806315 PMC8720627 83. Luo Y. Zhang S. Xie H. Su Q. He S. Lei Z. Prognosis and immunotherapy significances of a cancer-associated fibroblasts-related gene signature in lung adenocarcinoma Cell. Mol. Biol. 2023 69 51 61 38279482 10.14715/cmb/2023.69.14.9 84. Long J. Bai Y. Yang X. Lin J. Yang X. Wang D. He L. Zheng Y. Zhao H. Construction and comprehensive analysis of a ceRNA network to reveal potential prognostic biomarkers for hepatocellular carcinoma Cancer Cell Int. 2019 19 90 10.1186/s12935-019-0817-y 31007608 PMC6458652 85. Moghimi A. Bani Hosseinian N. Mahdipour M. Ahmadpour E. Miranda-Bedate A. Ghorbian S. Deciphering the Molecular Complexity of Hepatocellular Carcinoma: Unveiling Novel Biomarkers and Therapeutic Targets Through Advanced Bioinformatics Analysis Cancer Rep. 2024 7 e2152 10.1002/cnr2.2152 PMC11310554 39118438 86. Rahimi-Farsi N. Shahbazi T. Ghorbani A. Mottaghi-Dastjerdi N. Yazdani F. Mohseni P. Guzzi P.H. Esmail Nia G. Shahbazi B. Ahmadi K. Network-based analysis of candidate oncogenes and pathways in hepatocellular carcinoma Biochem. Biophys. Rep. 2025 43 102086 10.1016/j.bbrep.2025.102086 40546347 PMC12182303 87. Xie S. Jiang X. Zhang J. Xie S. Hua Y. Wang R. Yang Y. Identification of significant gene and pathways involved in HBV-related hepatocellular carcinoma by bioinformatics analysis PeerJ 2019 7 e7408 10.7717/peerj.7408 31392101 PMC6677124 88. Li G. Wang Z. Chen D. Yin J. Mo Z. Sun B. Yang T. Zhang X. Zhai Z. Li Y. Comprehensive analysis of a TPX2-related TRHDE-AS1/PKIA ceRNA network involving prognostic signatures in Hepatitis B virus-infected hepatocellular carcinoma Front. Cell. Infect. Microbiol. 2022 12 1025900 10.3389/fcimb.2022.1025900 36204642 PMC9530265 89. Balraj A.S. Muthamilselvan S. Raja R. Palaniappan A. PRADclass: Hybrid Gleason Grade-Informed Computational Strategy Identifies Consensus Biomarker Features Predictive of Aggressive Prostate Adenocarcinoma Technol. Cancer Res. Treat. 2024 23 1 20 10.1177/15330338231222389 PMC10793196 38226611 90. Li C. Pu B. Gu L. Zhang M. Shen H. Yuan Y. Liao L. Identification of key modules and hub genes in glioblastoma multiforme based on co-expression network analysis FEBS Open Bio 2021 11 833 850 10.1002/2211-5463.13078 PMC7931238 33423377 91. Qin S. Yuan Y. Liu H. Pu Y. Chen K. Wu Y. Su Z. Identification and characterization of sex-dependent gene expression profile in glioblastoma Neuropathology 2023 43 72 83 10.1111/neup.12845 35789505 92. Zhang X. Mo Y. Feng L. Ginsenoside Rh7 affects β-catenin nuclear translocation by inhibiting SHCBP1 expression, thereby inhibiting epithelial-mesenchymal transition in gastric cancer cells Int. J. Med. Sci. 2025 22 3053 3069 10.7150/ijms.112622 40657397 PMC12244034 93. Wang N. Zhu L. Wang L. Shen Z. Huang X. Identification of SHCBP1 as a potential biomarker involving diagnosis, prognosis, and tumor immune microenvironment across multiple cancers Comput. Struct. Biotechnol. J. 2022 20 3106 3119 10.1016/j.csbj.2022.06.039 35782736 PMC9233189 94. Goel A. Rastogi A. Jain M. Niveriya K. RNA-based Therapeutics: Past, Present and Future Prospects, Challenges in Cancer Treatment Curr. Pharm. Biotechnol. 2024 25 2125 2137 10.2174/0113892010291042240130171709 38347795 95. Kara G. Calin G.A. Ozpolat B. RNAi-based therapeutics and tumor targeted delivery in cancer Adv. Drug Deliv. Rev. 2022 182 114113 10.1016/j.addr.2022.114113 35063535 96. Kalaimani K. Balachandran S. Boopathy L.K. Roy A. Jayachandran B. Sankaranarayanan S. Arumugam M.K. Recent advancements in small interfering RNA based therapeutic approach on breast cancer Eur. J. Pharmacol. 2024 981 176877 10.1016/j.ejphar.2024.176877 39128807 97. Kim W. Ye Z. Simonenko V. Shahi A. Malikzay A. Long S.Z. Xu J.J. Lu A. Horng J.H. Wu C.R. Codelivery of TGFβ and Cox2 siRNA inhibits HCC by promoting T-cell penetration into the tumor and improves response to Immune Checkpoint Inhibitors NAR Cancer 2024 6 zcad059 38204925 10.1093/narcan/zcad059 PMC10776204 98. Kamerkar S. LeBleu V.S. Sugimoto H. Yang S. Ruivo C.F. Melo S.A. Lee J.J. Kalluri R. Exosomes facilitate therapeutic targeting of oncogenic KRAS in pancreatic cancer Nature 2017 546 498 503 10.1038/nature22341 28607485 PMC5538883 99. Chunarkar-Patil P. Kaleem M. Mishra R. Ray S. Ahmad A. Verma D. Bhayye S. Dubey R. Singh H.N. Kumar S. Anticancer Drug Discovery Based on Natural Products: From Computational Approaches to Clinical Studies Biomedicines 2024 12 201 10.3390/biomedicines12010201 38255306 PMC10813144 100. Atanasov A.G. Zotchev S.B. Dirsch V.M. International Natural Product Sciences Taskforce Supuran C.T. Natural products in drug discovery: Advances and opportunities Nat. Rev. Drug Discov. 2021 20 200 216 10.1038/s41573-020-00114-z 33510482 PMC7841765 101. Camps-Fajol C. Cavero D. Minguillon J. Surralles J. Targeting protein-protein interactions in drug discovery: Modulators approved or in clinical trials for cancer treatment Pharmacol. Res. 2025 211 107544 39667542 10.1016/j.phrs.2024.107544 102. Bian H. Liang X. Lu D. Lin J. Lu X. Jin J. Zhang L. Wu Y. Chen H. Zhang W. In Silico Discovery of Stapled Peptide Inhibitor Targeting the Nur77-PPARgamma Interaction and Its Anti-Breast-Cancer Efficacy Adv. Sci. 2024 11 e2308435 10.1002/advs.202308435 PMC11234460 38682467 103. Bonazzi S. d’Hennezel E. Beckwith R.E.J. Xu L. Fazal A. Magracheva A. Ramesh R. Cernijenko A. Antonakos B. Bhang H.C. Discovery and characterization of a selective IKZF2 glue degrader for cancer immunotherapy Cell Chem. Biol. 2023 30 235 247 e212 10.1016/j.chembiol.2023.02.005 36863346 104. Ryan M.B. Quade B. Schenk N. Fang Z. Zingg M. Cohen S.E. Swalm B.M. Li C. Ozen A. Ye C. The Pan-RAF-MEK Nondegrading Molecular Glue NST-628 Is a Potent and Brain-Penetrant Inhibitor of the RAS-MAPK Pathway with Activity across Diverse RAS- and RAF-Driven Cancers Cancer Discov. 2024 14 1190 1205 38588399 10.1158/2159-8290.CD-24-0139 PMC11215411 105. Chirnomas D. Hornberger K.R. Crews C.M. Protein degraders enter the clinic—A new approach to cancer therapy Nat. Rev. Clin. Oncol. 2023 20 265 278 36781982 10.1038/s41571-023-00736-3 PMC11698446 106. Hinterndorfer M. Spiteri V.A. Ciulli A. Winter G.E. Targeted protein degradation for cancer therapy Nat. Rev. Cancer 2025 25 493 516 10.1038/s41568-025-00817-8 40281114 107. Rossari F. Minutolo F. Orciuolo E. Past, present, and future of Bcr-Abl inhibitors: From chemical development to clinical efficacy J. Hematol. Oncol. 2018 11 84 10.1186/s13045-018-0624-2 29925402 PMC6011351 108. Batista-Silva J.P. Gomes D. Sousa S.F. Sousa A. Passarinha L.A. Advances in structure-based drug design targeting membrane protein markers in prostate cancer Drug Discov. Today 2024 29 104130 10.1016/j.drudis.2024.104130 39103143 109. Medvedev K.E. Schaeffer R.D. Grishin N.V. Leveraging AI to explore structural contexts of post-translational modifications in drug binding J. Cheminform. 2025 17 67 10.1186/s13321-025-01019-y 40320551 PMC12051291 110. Krokidis M.G. Koumadorakis D.E. Lazaros K. Ivantsik O. Exarchos T.P. Vrahatis A.G. Kotsiantis S. Vlamos P. AlphaFold3: An Overview of Applications and Performance Insights Int. J. Mol. Sci. 2025 26 3671 10.3390/ijms26083671 40332289 PMC12027460 111. Ferrari V. Mograbi B. Gal J. Milano G. Companion Tests and Personalized Cancer Therapy: Reaching a Glass Ceiling Int. J. Mol. Sci. 2024 25 9991 10.3390/ijms25189991 39337479 PMC11431990 112. Papadopoulos N. Kinzler K.W. Vogelstein B. The role of companion diagnostics in the development and use of mutation-targeted cancer therapies Nat. Biotechnol. 2006 24 985 995 10.1038/nbt1234 16900147 Figure 1 Molecular architecture and regulatory mechanisms of SHCBP1. ( A B C D Figure 2 Multifaceted functions of SHCBP1 in cancer hallmarks. Eight defining features of cancers are presented in the light-yellow box, and SHCBP1’s oncogenic contribution to each hallmark is outlined in the dark yellow box. The red arrow represents upregulation or activation of signaling pathways, while the blue arrow indicates inhibition of gene expression or pathways mediated by SHCBP1. (Adapted from [ 4 ijms-26-08778-t002_Table 2 Table 2 Preclinical approaches to SHCBP1 inhibition and their therapeutic outcomes. Targeting Strategy Therapeutic Agent Mode of Experimental Model Therapeutic Effect Reference Genetic siRNA/ Transient gene silencing Cancer cell lines, Inhibition of cellular proliferation, colony formation, self-renewal, and metastasis [ 14 15 43 46 50 51 56 63 CRISPR-Cas9 Genomic disruption Cancer cell lines, Decreased tumor progression, suppressed colony formation, and reduced lung metastasis [ 13 77 Genetically engineered knockout mouse Attenuated tumor growth and diminished lung metastasis [ 24 62 Low-molecular-weight compound AZD5582 SHCBP1-specific inhibitor Pancreatic cancer cell, organoid model, Suppression of cellular proliferation and metastatic potential, [ 77 Rucaparib PARP enzyme inhibitor Lung cancer cell line, Decreased cellular proliferation, inhibition of EMT progression, and suppressed metastasis [ 81 Natural TFBG Inhibitor targeting SHCBP1-PLK1 interaction Gastric cancer cell, Xenograft model Suppressed colony formation and tumor development, Enhanced drug responsiveness [ 39 Resveratrol SHCBP1 transcriptional repressor Melanoma cell Suppression of cellular proliferation, colony formation, and invasive capacity [ 44 Ginsenoside Rh7 SHCBP1 transcriptional repressor Gastric cancer cell, Diminished cellular proliferation, colony formation, EMT, and invasiveness [ 92 Combination therapy siRNA/ Inhibitor of CBP- Lung cancer cell, Xenograft model Inhibition of sphere formation, stem cell properties, tumor progression, and cell viability [ 21 siRNA/ Inhibitor of autophagy Ovarian cancer cell xenograft Decreased cellular proliferation within tumors, [ 52 shRNA/ DNA-damaging agent Lung cancer cell, Xenograft model Suppressed cell cycle progression and diminished tumor growth, [ 29 Erdafitinib/ FGFR Conditional SHCBP1 Suppression of CAF infiltration and breast cancer progression, [ 24 Trametinib/ MEK inhibitor/ Breast cancer cell, Xenograft model Decreased tumor volume [ 30 Abbreviations: siRNA, Small interfering RNA; shRNA, Short hairpin RNA; PARP, Poly ADP ribose polymerase; EMT, Epithelial–mesenchymal transition; TFBG, Theaflavin-3,3′-digallate; PLK1, Polokinase 1; CBP, CREB binding protein; ICI, Immune checkpoint inhibitor. ",
  "metadata": {
    "Title of this paper": "The role of companion diagnostics in the development and use of mutation-targeted cancer therapies",
    "Journal it was published in:": "International Journal of Molecular Sciences",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12469403/"
  }
}