{
  "title": "Paper_864",
  "abstract": "pmc Cancer Control Cancer Control 3344 ccon CCX Cancer Control: Journal of the Moffitt Cancer Center 1073-2748 1526-2359 SAGE Publications PMC12461076 PMC12461076.1 12461076 12461076 40992780 10.1177/10732748251382635 10.1177_10732748251382635 1 Research Article Is Site of Radiation Therapy Associated With Pathologic Complete Response in Patients With Locally Advanced Esophageal Cancer? Singh Pranit MD 1 * Choo Sylvia MD 1 * Adams Jacob MD 1 Adams Matthew DO 2 Lima Pereira Allan A. MD 3 Baldonado Jobelle J. A. MD 4 Fontaine Jacques P. MD 4 https://orcid.org/0009-0000-5306-0160 Sandoval Maria L. MD 3 Frakes Jessica M. MD 3 Pimiento Jose M. MD 3 Hoffe Sarah E. MD 3 https://orcid.org/0000-0001-6031-6451 Sinnamon Andrew J. MD, MS 1 3 1 33697 USF Health Morsani College of Medicine 2 3 25301 Moffitt Cancer Center Gastrointestinal Oncology 4 654314 Moffitt Cancer Center, Thoracic Oncology Andrew J. Sinnamon, MD, MS, USF Health Morsani College of Medicine, 12902 USF Magnolia Drive, CSB Building Floor 8, Tampa, FL 33612, USA. Email: Andrew.Sinnamon@moffitt.org * S Choo and P Singh contributed equally and share first authorship. 24 9 2025 Jan-Dec 2025 32 478543 10732748251382635 23 5 2025 7 8 2025 10 9 2025 24 09 2025 26 09 2025 26 09 2025 © The Author(s) 2025 2025 SAGE Publications Inc, unless otherwise noted. Manuscript content on this site is licensed under Creative Common Licences https://creativecommons.org/licenses/by-nc/4.0/ This article is distributed under the terms of the Creative Commons Attribution-NonCommercial 4.0 License ( https://creativecommons.org/licenses/by-nc/4.0/ https://us.sagepub.com/en-us/nam/open-access-at-sage Introduction Neoadjuvant chemoradiation (CRT) is commonly used for esophageal cancer (EC), with pathologic complete response (pCR) linked to improved prognosis. pCR rates range from 25%-30% for adenocarcinoma to 50% for squamous cell carcinoma (SCC). High-volume centers (HVCs) often yield favorable outcomes across various cancers. This study examines whether CRT delivery at an HVC impacts pCR and ypN0 rates in EC patients undergoing esophagectomy. Methods In this retrospective cohort analysis, we identified patients with clinical stage T2+/N+ EC who received neoadjuvant CRT and esophagectomy from a prospectively maintained database (1996-2019). CRT was delivered at the HVC or a community center (CC), while all surgeries occurred at the HVC. Primary outcomes were pCR and ypN0. Results Among 708 patients, median age was 65 years, with 83.6% male and 95.3% white. Most had adenocarcinoma (87.9%) in the distal esophagus or gastroesophageal junction. CRT was delivered at CCs in 64.8% and at HVC in 35.2%. Radiation dose was higher at the HVC (mean 5195 vs 4944 cGy, P P P P P P P P P P Conclusion There were no significant differences in pCR or ypN0 rates by CRT delivery site. pCR was higher for SCC histology at HVC, but did not reach statistical significance. Further research is warranted for SCC specifically. Plain Language Summary This study evaluates outcomes for the patients who have esophageal cancer and undergo radiation as well as chemotherapy and surgery for their cancer. The study evaluates whether there are differences in their outcomes whether they had the radiation at the same facility where they had the surgery. esophageal cancer high volume centers community centers pathologic complete response chemoradiation pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement no pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes typesetter ts10 cover-date January-December 2025 Introduction Locally advanced esophageal cancer (EC), at least clinical T2+ or cN+, has historically been managed with neoadjuvant chemotherapy and radiation based on the CROSS trial data.  1 2 3 2 4 Treatment at high volume centers (HVCs) is associated with more favorable outcomes, including overall survival (OS), for a variety of cancer types. 5 7  5  6  7  8  9 10 11 It is understood that travel distance is an important consideration for patients undergoing intensive therapy for their cancer care. 12 13  14  15 Materials and Methods Study Cohort This study was an IRB approved retrospective cohort analysis of a prospectively maintained institutional database (IRB Protocol MCC #16630). Individual consent for this retrospective analysis was waived. The study design was performed in accordance with the STROBE checklist for cohort studies.  16 Primary Exposure of Interest The primary exposure of interest was administration of CRT at a high-volume center (HVC; our institution) vs administration of CRT at a community center (CC). The cohort was split according to this exposure. While patients in the cohort received CRT at different institutions, all patients subsequently received an esophagectomy at the HVC. CRT was prescribed per physician discretion with respect to delivered dose and choice of radiosensitizing chemotherapy regimen. The CCs where CRT was administered varied in size and affiliation but were all facilities staffed by accredited radiation oncologists. It should be noted that the CC cohort includes patients who received CRT at a mix of CC facilities. Details regarding specific therapies are described in the Results. Primary Outcomes and Covariates The primary outcomes of interest in our analysis were the differences in pCR and ypN0 rates between patients who received CRT at a HVC vs at a CC. Pathological complete response (pCR) was defined as no residual cancer cells in the primary luminal tumor tissue or any lymph nodes in the surgical specimen. ypN0 was defined as no residual cancer cells detected in any surgically resected lymph node after chemoradiation. Location of the clinically suspicious lymph nodes was considered as a secondary outcome of interest. Other variables that were considered for analysis include patient characteristics (age, sex, race, smoking status), tumor characteristics (histology, anatomic location, differentiation, clinical T stage and clinical N stage), and treatment characteristics (radiotherapy modality, completion of therapy, dosage administered, chemotherapy regimen: carboplatin-taxol regimens [primarily paclitaxel], cisplatin-5-fluorouracil [5-FU], leucovorin/5-FU-oxliplatin [FOLFOX], 5-FU only, other chemotherapy regimens, and no chemotherapy at all). Lastly, treatment era was considered as a variable, designated as treatment before or after publication of CROSS trial in 2012. Statistical Methods Descriptive statistics are presented as frequency for categorical variables and median with interquartile range (IQR) for continuous variables. Univariate analyses were performed using Chi-square, Fisher’s exact, and Wilcoxon rank-sum as appropriate. To test for association with the primary outcomes of interest - pCR and ypN0 rates - multivariable logistic regression was used for multivariable analysis. Variables were considered for inclusion in multivariable analysis if associated with the outcome in univariate analysis ( P P Results During the period of study, there were 708 patients who met eligibility criteria and were included in the cohort. The median age was 65 years old. The majority of patients were male (n = 592, 83.6%) and were Caucasian (n = 675, 95%). The tumor histology was characterized as adenocarcinoma (n = 622, 87.9%) or squamous cell carcinoma (n = 86, 12.1%). The majority of tumors were located in the distal thoracic esophagus (n = 382, 54.0%), with the next major locations being the gastroesophageal junction (n = 284, 40.1%) and the mid-thoracic esophagus (n = 42, 5.9%). Initial analysis of clinical T and N stage distributions showed a statistically significant difference between the groups; however, upon excluding cases with unknown staging, this difference became negligible. See Table 1 Table 1. Characteristics for Cohort Undergoing Chemoradiation Followed by Surgery, by Site of Chemoradiation Administration COHORT (n = 708) HVC, n = 249 n (%) CC, n = 459 n (%)  P Patient and clinical factors Age (years, median [IQR]) 65 (57-70) 65 (57-72) 0.42 Male 210 (84) 382 (83) 0.70 Caucasian 240 (96) 435 (95) 0.33 Ever smoker 168 (67) 323 (70) 0.42 Treatment era pre-CROSS publication 153 (61) 282 (61) 0.99 Tumor histology Adenocarcinoma 225 (90) 397 (86) 0.13 Squamous cell carcinoma 24 (10) 62 (14) Tumor location Mid thoracic esophagus 18 (7) 24 (5) 0.54 Distal thoracic esophagus 131 (53) 251 (55) Gastroesophageal junction 100 (40) 184 (40) Tumor grade 0.69 Well-differentiated 7 (3) 14 (3) Moderately-differentiated 74 (30) 118 (26) Poorly-differentiated 53 (21) 98 (21) Unknown 115 (46) 229 (50) Clinical stage T stage 0.004  a cT1 14 (6) 12 (3) cT2 37 (15) 75 (16) cT3 160 (64) 281 (61) cT4 22 (9) 25 (5) cTx 16 (6) 66 (14) N stage 0.002  b cN0 53 (21) 113 (24) cN+ 180 (72) 280 (61) cNx 16 (6) 66 (14) Treatment information Mean radiation dosage 5195 cGy 4944 cGy <0.001 IMRT 207 (83) 363 (79%) 0.12 Completion of radiotherapy 244 (98) 450 (98) 0.8 Carboplatin-taxol 26 (11) 166 (36) <0.001 Cisplatin-5FU 167 (67) 161 (35) — FOLFOX 21 (8) 5 (1) — 5-fluoruracil only 22 (9) 14 (3) — Other chemotherapy 10 (4) 23 (5) — Unknown chemotherapy regimen 0 (0) 44 (10) — No chemotherapy 3 (1) 46 (10) — Lymph nodes removed (median, [IQR]) 15 (9-22) 14 (7-21) 0.41 Lymph nodes removed (CROSS era) 22 (16-29) 21 (16-26) 0.43 a P b P The number of patients treated at a HVC was 249 (35.2%), while the number of patients treated at a CC was 459 (64.8%). The mean radiation dosage at a HVC was 5195 cGy, while the mean radiation dosage at a CC was 4944 cGy. The difference in mean radiation dosage was statistically significant ( P P P P P Table 1 P P The overall pCR rate was 37.7% (n = 269). When split by histology, the pCR rate for patients with AC was 35.1%, and the pCR rate for patients with SCC was 57.0% ( Figure 1 P P Table 2 P P P P P P Figure 1. Rates of Pathologic Complete Response (pCR) by Histology whether Chemoradiation Administered at Community Center (CC) Versus High-Volume Center (HVC). Overall, pCR Rate was 37.7%, With pCR Rate for Adenocarcinoma (AC) 35.1%, and pCR Rate for Squamous Cell Carcinoma (SCC) 57.0% Table 2. Multivariable-Adjusted Association Between Site of Chemoradiation Administration Variable OR (95% CI)  P Community center  a 0.88 (0.60-1.28) 0.49 SCC histology 2.63 (1.58-4.39) <0.001 Site Mid thoracic Ref Lower thoracic 1.04 (0.51-2.12) 0.91 GEJ 0.69 (0.32-1.43) 0.32 Clinical T stage cT1/T2 Ref cT3/T4 0.49 (0.33-0.74) 0.001 cTx 0.37 (0.14-0.99) 0.050 Clinical N stage cN0 Ref cN+ 1.02 (0.69-1.50) 0.91 cNx 0.76 (0.29-2.02) 0.59 Post-CROSS treatment era 0.58 (0.41-0.81) 0.002 (community center, CC, vs high-volume center, HVC) and pathologic complete response (pCR), reduced multivariable logistic regression model. Squamous cell carcinoma, SCC. a After CRT, the rate of ypN0 at the HVC was 70.7% vs 68.0% at the CC ( P Table 3 P P Table 4 P P P Table 3. Multivariable-Adjusted Association Between Site of Chemoradiation Administration Variable OR (95% CI)  P Community center 0.89 (0.63-1.26) 0.51 SCC histology 2.19 (1.24-3.86) 0.007 Clinical T stage cT1/T2 Ref cT3/T4 0.39 (0.24-0.64) <0.01 cTx 0.27 (0.14-0.52) <0.01 Clinically suspicious nodes  a None Ref Adjacent regional 0.72 (0.47-1.10) 0.12 Non-adjacent 0.82 (0.54-1.25) 0.36 (community center, CC, vs high-volume center, HVC) and post-treatment negative nodes (ypN0), reduced multivariable logistic regression model. a Table 4. Location of Clinically Suspicious Lymph Nodes COHORT (n = 708) HVC (n = 249) CC (n = 459)  P Paraesophageal 98 (39.4%) 154 (33.4%) 0.14 Periaortic 9 (3.6%) 6 (1.3%) 0.043 Hilar (lung) 15 (6.0%) 20 (4.4%) 0.34 Celiac 34 (13.7%) 35 (7.7%) 0.010 Posterior mediastinal 31 (12.5%) 34 (7.4%) 0.028 Perigastric 6 (2.4%) 17 (3.7%) 0.35 Cervical 13 (5.2%) 42 (9.2%) 0.060 Supraclavicular 1 (0.6%) 2 (0.7%) 1.0 Porta hepatis 4 (2.3%) 1 (0.4%) 0.067 Other nodes 31 (18.6%) 60 (21.1%) 0.067 None seen 59 (34.5%) 128 (44.4%) 0.036 High-volume center, HVC. Community center, CC. After consideration of differences in primary tumor location by CC versus HVC, no significant differences in nodal involvement were observed. Discussion In our study, the overall pCR rate was 37.7%, which did not differ significantly between patients receiving therapy at a HVC and CCs, including with adjustment in multivariate analysis. Interestingly, the pCR rate was observed to be higher for patients with SCC receiving CRT at the HVC vs CC on univariate analysis only. This may be secondary to the smaller sample size in the SCC group than AC. Furthermore, the ypN0 rates did not differ significantly between CRT delivery sites, with a rate of ypN0 of 70.7% at the HVC vs 68.0% at the CC. There were some differences observed in nodal basins treated between HVC and community centers. However, due to known phenomenon of skip nodal metastases, it is not possible to say if this was representative of more advanced disease. 17 18 We explored whether the HVC may be treating patients with a different distribution of involved lymph nodes to account for a possibility of more advanced disease. However, when accounting for the site of the primary tumor, HVCs and CCs appeared to treat a similar rate of regional nodal disease. Despite the heterogeneity of radiation delivery sites, practitioners, and treatment years, there remained no significant difference in the extent of nodal regions treated. It is important to note that for the early cohort of patients in this study, there were no consensus society guidelines suggesting the clinical nodal target volume for radiation oncologists to include in their elective target volume. In the last decade or so, expert contouring guidelines have been developed to guide individual practice. 19 21 According to an analysis using the National Cancer Data Base, higher overall survival (OS) rates were associated with receiving trimodal therapy at HVCs, but pCR rates were not different by facility type, which is consistent with the results in this study.  19 P  22 This is a retrospective analysis which includes several limitations to discuss. First, there is only a single HVC in the analysis. Other HVCs might have different policies and guidelines on which they base their CRT or how they coordinate with CCs. This difference in operation could have affected the rates of pCR and ypN+. Future study from other investigators would be valuable to determine whether the favorable overall outcomes between coordinating HVCs and CCs is seen in other groups which collaborate in patient care. Second, there is a possibility that the patients at the HVC had more anatomically complex disease since they had a significantly higher incidence of celiac, periaortic, and mediastinal clinically suspicious lymph nodes. There is a chance that some difference in management at the HVC (eg, the significantly higher mean radiation dosage used at the HVC) could have improved outcomes for a more challenging patient population, thus masking a true difference in favorable outcomes for EC patients based on facility type. However, as noted above, skip metastases are common in esophageal cancer, and it is difficult to determine whether these differences in nodal distribution represent more advanced disease or not. 17 18 Furthermore, results of the current study may be difficult to generalize due to inherent characteristics in the study environment, again warranting future study from others to improve generalizability. Conclusions In this analysis of patients with EC undergoing multimodality therapy including surgery at a HVC and CRT at HVCs and CCs, no significant difference in pCR or ypN+ rate was observed nor were there significant differences in the rate of minimal histopathologic response (TRG3). These results support continued coordination of patient care within geographic regions to optimize patient outcomes. Author Note: Author Contributions: Funding: The authors declared the following potential conflicts of interest with respect to the research, authorship, and/or publication of this article: Dr. Sarah Hoffe is a member of the Editorial Board of Cancer Control and did not participate in the editorial handling or peer review process of the article. Categories: ORCID iDs Maria L. Sandoval https://orcid.org/0009-0000-5306-0160 Andrew J. Sinnamon https://orcid.org/0000-0001-6031-6451 Ethical Considerations This study was reviewed and approved by the Institutional Review Board at Moffitt Cancer Center. References 1 Eyck BM van Lanschot JJB Hulshof MCCM et al. Ten-year outcome of neoadjuvant chemoradiotherapy plus surgery for esophageal cancer: the randomized controlled CROSS trial J Clin Oncol 2021 39 18 1995 2004 33891478 10.1200/JCO.20.03614 2 Hipp J Kuvendjiska J Hillebrecht HC et al. Pathological complete response in multimodal treatment of esophageal cancer: a retrospective cohort study Dis Esophagus 2023 36 7 doac095 36572398 10.1093/dote/doac095 PMC10317005 3 Soror T Kho G Zhao KL Ismail M Badakhshi H Impact of pathological complete response following neoadjuvant chemoradiotherapy in esophageal cancer J Thorac Dis 2018 10 7 4069 4076 30174850 10.21037/jtd.2018.06.85 PMC6106005 4 van Hagen P Hulshof MC van Lanschot JJ et al. Preoperative chemoradiotherapy for esophageal or junctional cancer N Engl J Med 2012 366 22 2074 2084 22646630 10.1056/NEJMoa1112088 5 Welten VM Wanis KN Madenci AL et al. The effect of facility volume on survival following proctectomy for rectal cancer J Gastrointest Surg 2022 26 1 150 160 34291364 10.1007/s11605-021-05092-0 6 Joshi SS Handorf ER Sienko D et al. Treatment facility volume and survival in patients with advanced prostate cancer Eur Urol Oncol 2020 3 1 104 111 31326500 10.1016/j.euo.2019.06.016 PMC7649050 7 Stoltzfus KC Shen B Tchelebi L et al. Impact of facility surgical volume on survival in patients with cancer J Natl Compr Canc Netw 2021 19 5 495 503 33561825 10.6004/jnccn.2020.7644 8 Muslim Z Stroever S Poulikidis K Connery CP Nitzkorski JR Bhora FY Impact of facility type and volume in locally advanced esophageal cancer Asian Cardiovasc Thorac Ann 2024 32 1 19 26 37994000 10.1177/02184923231215539 9 Habbous S Yermakhanova O Forster K Holloway CMB Darling G Variation in diagnosis, treatment, and outcome of esophageal cancer in a regionalized care system in Ontario, Canada JAMA Netw Open 2021 4 9 e2126090 34546371 10.1001/jamanetworkopen.2021.26090 PMC8456383 10 Schlottmann F Herbella FAM Patti MG Volume and outcomes in esophageal cancer surgery Schlottmann F Molena D Patti M Esophageal Cancer Cham Springer 2018 11 Metzger R Bollschweiler E Vallböhmer D Maish M DeMeester TR Hölscher AH High volume centers for esophagectomy: what is the number needed to achieve low postoperative mortality? Dis Esophagus 2004 17 4 310 314 15569369 10.1111/j.1442-2050.2004.00431.x 12 Payne S Jarrett N Jeffs D The impact of travel on cancer patients’ experiences of treatment: a literature review Eur J Cancer Care 2000 9 4 197 203 10.1046/j.1365-2354.2000.00225.x 11829366 13 Shrestha P Chu QD Hsieh MC et al. Distance to radiation therapy facility influences surgery type among older women with early-stage breast cancer Cancer Med 2023 12 6 6842 6852 36495041 10.1002/cam4.5474 PMC10067088 14 Udelsman BV Ermer T Ely S et al. Assessment of a collaborative treatment model for trimodal management of esophageal cancer J Thorac Dis 2023 15 9 4668 4680 37868899 10.21037/jtd-23-346 PMC10586936 15 Longacre CF Neprash HT Shippee ND Tuttle TM Virnig BA Travel, treatment choice, and survival among breast cancer patients: a population-based analysis Womens Health Rep 2021 2 1 1 10 10.1089/whr.2020.0094 PMC7957915 33786524 16 von EE Altman DG Egger M et al. The strengthening the reporting of observational studies in epidemiology (STROBE) statement: guidelines for reporting observational studies Ann Intern Med 2007 147 573 577 17938396 10.7326/0003-4819-147-8-200710160-00010 17 Cavallin F Alfieri R Scarpa M et al. Nodal skip metastasis in thoracic esophageal squamous cell carcinoma: a cohort study BMC Surg 2017 17 1 49 28464907 10.1186/s12893-017-0247-5 PMC5414191 18 Wang F Zheng Y Wang Z Zheng Q Huang Q Liu S Nodal skip metastasis in esophageal squamous cell carcinoma patients undergoing three-field lymphadenectomy Ann Thorac Surg 2017 104 4 1187 1193 28669504 10.1016/j.athoracsur.2017.03.081 19 Yang GQ Mhaskar R Rishi A et al. Intensity-modulated radiotherapy at high-volume centers improves survival in patients with esophageal adenocarcinoma receiving trimodality therapy Dis Esophagus 2019 32 8 doy124 30597022 10.1093/dote/doy124 20 Ordu AD Nieder C Geinitz H et al. Association between radiation dose and pathological complete response after preoperative radiochemotherapy in esophageal squamous cell cancer Anticancer Res 2014 34 12 7255 7261 25503157 21 Shueng PW Huang CC Liu YM et al. Combined modality therapy for patients with esophageal squamous cell carcinoma: radiation dose and survival analyses Thorac Cancer 2023 14 2 143 148 36351568 10.1111/1759-7714.14724 PMC9834687 22 Courrech Staal EFW van Coevorden F Cats A et al. Outcome of low-volume surgery for esophageal cancer in a high-volume referral center Ann Surg Oncol 2009 16 12 3219 3226 19777184 10.1245/s10434-009-0700-5 ",
  "metadata": {
    "Title of this paper": "Outcome of low-volume surgery for esophageal cancer in a high-volume referral center",
    "Journal it was published in:": "Cancer Control: Journal of the Moffitt Cancer Center",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12461076/"
  }
}