{
  "title": "Paper_351",
  "abstract": "pmc Sci Rep Sci Rep 1579 scirep Scientific Reports 2045-2322 Nature Publishing Group PMC12484820 PMC12484820.1 12484820 12484820 41028878 10.1038/s41598-025-99935-4 99935 1 Article Comparison of intravaginal and interstitial brachytherapy in cervical cancer after inadvertent hysterectomy: a retrospective study Choudhary Sunil 1 Pandey Ankita 2 Singh Ankita 1 Mourya Ankur 3 Gupta Neha 4 Shajid Syed Mohamed 5 Venkatachalam Gogul Priean 1 Rai Sangita 6 Agarwal Sakshi 6 Venkatraman Pitchaikannu 1 Aggarwal Lalit Mohan lalitm@bhu.ac.in 1 1 https://ror.org/04cdn2797 grid.411507.6 0000 0001 2287 8816 Department of Radiotherapy and Radiation Medicine, Institute of Medical Sciences, Banaras Hindu University, 2 https://ror.org/009nfym65 grid.415131.3 0000 0004 1767 2903 Department of Radiation Oncology, Postgraduate Institute of Medical Education & Research, 3 https://ror.org/045xjv649 grid.413233.4 0000 0004 1767 2057 Department of Radiotherapy, State Cancer Institute, Cancer Hospital, Netaji Subhash Chandra Bose Medical College, 4 5 6 https://ror.org/04cdn2797 grid.411507.6 0000 0001 2287 8816 Department of Obstetrics & Gynaecology, Institute of Medical Sciences, Banaras Hindu University, 30 9 2025 2025 15 478255 33784 12 7 2024 23 4 2025 30 09 2025 02 10 2025 02 10 2025 © The Author(s) 2025 2025 https://creativecommons.org/licenses/by/4.0/ Open Access http://creativecommons.org/licenses/by/4.0/ The purpose of this study was to compare intravaginal brachytherapy (IVBT) with interstitial brachytherapy (ISBT) in patients presenting with residual or recurrent disease after inadvertent hysterectomy for cervical cancer. Records of consecutive patients with cervical cancer, registered in the Radiotherapy Outpatient Department (RTOPD) between March 2018 and March 2021, who had inadvertent hysterectomy followed by external beam radiotherapy (EBRT) and IVBT ( n n p p Supplementary Information The online version contains supplementary material available at 10.1038/s41598-025-99935-4. Keywords Cervical cancer Hysterectomy Brachytherapy Recurrence Radiotherapy MUPIT Subject terms Biophysics Gastroenterology Health care Oncology pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement yes pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes issue-copyright-statement © Springer Nature Limited 2025 Introduction Cervical cancer remains a significant global health concern, particularly in regions with limited access to screening and treatment modalities 1 2 3 2 3 4 Due to various reasons, inadvertent hysterectomy in cervical cancer is a common practice in most underdeveloped and developing countries 3 5 6 7 8 12 Brachytherapy offers several advantages, including the delivery of high doses of radiation to the target area while minimizing exposure to surrounding healthy tissues, thus enhancing therapeutic efficacy and reducing treatment-related toxicities 13 7 10 This retrospective study was aimed to compare the oncologic outcomes, treatment-related toxicities, and survival rates of patients with cervical cancer who underwent either intravaginal or interstitial brachytherapy following inadvertent hysterectomy. By analyzing data from a single tertiary care center, we sought to provide valuable insights into the optimal management of this challenging patient population and improve clinical decision-making. Hence, we conducted this study to compare the above two brachytherapy techniques concerning survival outcomes and treatment-related toxicities in patients undergoing inadvertent hysterectomy for cervical cancer. Materials and methods Patient selection Records of histologically proven cervical cancer patients registered in the Radiotherapy Out-patient Department (RTOPD) from March 2018 till March 2021 were screened for this study and those who met all  Upfront inadvertent hysterectomy. Residual or recurrent disease at the vault with or without pelvic nodes. No history of any adjuvant treatment before registering with us. Treated with adjuvant EBRT and IVBT or ISBT. Patients found to have disease outside the pelvis or any metastatic spread were excluded from this study. External beam radiotherapy Patients were simulated in the supine position on a conventional simulator or CT simulator who were to be treated with Tele-cobalt unit and 6 MV Linear Accelerator (LA) respectively. Patients on Tele-cobalt were treated with conventional two parallel opposed fields or 4-field box techniques based on anterior-posterior separation using standard portals. Patients on LA were treated with three-dimensional conformal radiotherapy (3DCRT). All the patients were treated to a dose of 45–50 Gy/ 25 fractions over 5 weeks. Routine blood tests and clinical examinations were done once a week during EBRT. Chemotherapy Cisplatin was given at 40 mg/m 2 2 Brachytherapy BT was done one week after the completion of EBRT. We practiced IVBT in these patients till December 2019 and due to the poor treatment outcome with this technique, we switched to ISBT for such patients since January 2020. Intravaginal brachytherapy A vaginal cylinder of the largest diameter that snugly fitted into the vagina was used for IVBT. Based on our earlier experience with CT and radiograph-based planning for IVBT, we developed pre-defined plans with fixed dwell positions and weightage for vaginal cylinders of various diameters and different treated lengths of the vagina. Therefore, simulation was not performed in these patients after the insertion of the vaginal cylinder applicator. This helped us in reducing the time and treatment costs for our patients. A proximal 3 cm of the vagina below the lowest extent of the residual disease at the time of BT was treated. A dose of 6 Gy x 2 fractions (one fraction/week) by High dose rate brachytherapy (HDR) was prescribed at 5 mm from the surface of the vaginal cylinder. Interstitial brachytherapy Martinez Universal Perineal Interstitial Template (MUPIT) with hollow stainless-steel (trocar cut) needles and stylets were used for ISBT. The number of needles required for a particular patient was based on the dimensions of the residual disease evaluated as per the MRI pelvis done before BT. The implant needles were inserted 2 cm beyond the vaginal surface of the vault or the proximal extent of the residual disease to account for the thickness of the vaginal apex and an offset of 1 cm of these needles. ISBT was done under general or spinal anesthesia. A plain CT scan with a 1 mm slice thickness from the level of the umbilicus till mid-thigh was done in these patients on the day of BT with the applicator in situ. The images were transferred to the Treatment Planning System (OncentraBrachy, v.4.6.0; Elekta AB, Stockholm, Sweden) for delineation of the target, OARs, and BT planning. Gross tumor volume (GTV) was defined on CT images as a residual disease at the time of BT (GTV b b HR-CTV included the vaginal vault with a 5 mm radial margin and an upper 3 cm of the vagina for those who had a complete response after EBRT. The rectum, bladder, and sigmoid colon were contoured in each axial slice as OARs 14 15 The Inverse Planning Simulated Annealing (IPSA) algorithm was used for dose optimization. The dose was prescribed to HR-CTV with the objective that the dose received by 90% of the volume should be more than 100% of the prescribed dose (D 90 Clinical evaluation and follow-up Patients were clinically examined once a month for the first six months and three months thereafter. The radiological investigations were done on clinical suspicion of disease recurrence. Statistical analysis The statistical analysis was performed using the software package SPSS version 23 (Chicago, II, USA). The chi-square method was employed to determine the statistical significance between the two treatment arms. Overall survival (OS) and Disease-free survival (DFS) were the primary endpoints. OS was calculated from the date of registration to the date of death due to any cause or date of last follow-up (LFU). DFS was calculated from the date of registration to the date of recurrence or the date of LFU. Acute and late toxicities were the secondary endpoints. The Kaplan-Meier method was used for survival analysis and the log-rank test was used to compare the survival between the two groups. A p-value of less than 0.05 was considered statistically significant. Ethics statement This study wascarried out in accordance with relevant guidelines and regulations. The experimental protocols were reviewed and approved by the Banaras Hindu University human ethical clearance committee. Informed consent was obtained from all subjects and their legal guardians before participation in the study. Results Since we started practicing ISBT in January 2020, we could treat only fifteen patients with the above technique till March 2021. To match the number, we chose the first 15 patients who were treated with IVBT from March 2018 to December 2019. The data analysis was done on 01.04.2024. Patients and tumor characteristics are shown in Table 1 1  Table 1 Patient, tumor & treatment characteristics of ISBT and IVBT. Parameters ISBT ( n IVBT ( n p Age (years) Median 50 52 0.612 Range 40–70 37–80 Histopathological type Squamous cell carcinoma 13 14 0.543 Adenocarcinoma 2 1 Margin status Positive 2 2 0.828 Negative 2 1 Unknown 11 12 Parametrial status Positive 1 0 0.595 Negative 2 2 Unknown 12 13 Lymphovascular invasion Positive 2 3 0.536 Negative 3 1 Unknown 10 11 Lymph nodal status Positive 4 5 0.068 Negative 11 9 Induction chemotherapy Given 4 5 0.232 Not given 11 10 EBRT technique 2D conventional 3 9 0.323 3D CRT 12 6 EBRT dose 45 Gy 12 7 0.124 46 Gy 2 3 50 Gy 1 5 Concurrent chemotherapy Yes 13 14 0.543 No 2 1 RT duration (days) Median 56 58 0.247 Range 43–159 45–196 ISBT, Interstitial Brachytherapy; IVBT, Intravaginal Brachytherapy; 3DCRT, 3-Dimensional Conformal Radiotherapy; EBRT, External Beam Radiotherapy. The treatment outcomes of all the patients are shown in Table 2 p 3 p 1 p 1 1  Table 2 Treatment outcome of ISBT and IVBT. Parameters ISBT ( n IVBT ( n p Follow-up duration (months) Median 32.88 24.37 0.558 Range 8.6–41.82 7.43–68.73 Last follow up status Alive without disease 12 6  0.038 Alive with disease 1 0 Lost on follow-up without disease 1 1 Dead due to disease 1 8 Overall survival (months) Median NR 36.8  0.011 Mean 39.6 40.9 Disease-free survival (months) Median NR 20.6  0.023 Mean 38.8 37 Recurrence pattern Local 1 3  0.031 Distant 0 3 None 14 9 ISBT, Interstitial Brachytherapy; IVBT, Intravaginal Brachytherapy.  Table 3 Acute and late toxicities from ISBT and IVBT. Parameters ISBT ( n IVBT ( n p Acute Gastrointestinal toxicity Grade 0 2 8 0.067 Grade 1 11 6 Grade 2 2 1 Acute Bladder toxicity Grade 0 12 7  0.052 Grade 1 2 8 Grade 2 0 0 Grade 3 1 0 Late Gastrointestinal toxicity Grade 0 9 9 0.721 Grade 1 5 4 Grade 2 0 0 Grade 3 0 0 Grade 4 1 2 Late Bladder toxicity Grade 0 9 9 0.484 Grade 1 4 6 Grade 2 1 0 Grade 3 1 0 Late Rectal toxicity Grade 0 13 14 0.541 Grade 1 0 0 Grade 2 1 0 Grade 3 1 0 Grade 4 0 1 ISBT, Interstitial Brachytherapy; IVBT, Intravaginal Brachytherapy.  Fig. 1 Kaplan-Meier graph comparing survival outcomes in IVBT and ISBT patients. ( a b c d The median gap between surgery and registration in both the arms with us was 11.9 months. About 1/3rd of our patients had presented to us within 6 months of surgery. Patients who presented within 6 months of surgery had a mean OS of 38.4 months while those with late presentation had 35.6 months of mean OS ( p Acute and late toxicities in both arms were comparable (Table 3 2 0.1cc 1 2  Fig. 2 ( a b Discussion We have compared the treatment outcomes of the two BT techniques in this study. To the best of our knowledge, this study is the first of its kind as IVBT has never been compared with ISBT in cervical cancer patients with residual/recurrent disease after inadvertent hysterectomy. Earlier we used to treat these patients with concurrent chemo-radiation (CCRT) followed by IVBT but the survival outcome was disappointing. The cumulative EQD2 dose (EBRT with BT) with our dose schedule was 60.25 Gy which seems to be inadequate for patients treated with gross disease. However, a definitive BT dose schedule remains elusive for these patients, with doses in the literature ranging from 15 Gy to 50 Gy with LDR or HDR-BT (Supplementary Appendix, Table 2 9 11 13 18 25 The dip in the isodose curve, due to self-absorption at the vaginal apex, is a known phenomenon in IVBT with a single-channel vaginal cylinder. The thickness of the vagina at the vaginal vault is about 2.5–2.9 mm 26 27 EQD2 in the ISBT arm was 76.25 Gy compared to 60.25 Gy in the IVBT arm. The increase in dose with ISBT seems to be one of the major reasons for significant improvement in local control of the disease. The dose optimization with ISBT allows better dose distribution to the target with the sparing of OARs with the potential of improved therapeutic ratio. Further increase in dose with IVBT would have increased the toxicity to the rectum and bladder. There is dose conformity and scope of dose optimization with ISBT. Therefore, we had decided to use ISBT to augment the dose so as to improve the local control and survival outcome. In the majority of the earlier studies, RT was not combined with concurrent chemotherapy (Supplementary Appendix, Table 2 9 11 13 18 25 28 29 31 Choudhary et al. retrospectively assessed the role of taxane-based induction chemotherapy followed by RT and BT in patients with inadvertent hysterectomy for invasive cervical cancer and reported that the patients treated with taxane-based induction chemotherapy had better survival outcomes than their counterparts 32 33 34 35 You et al. evaluated the effect of the interval between surgery and adjuvant therapy on the oncologic outcome for patients with early-stage cervical cancer. The authors reported that the 5-year OS and DFS were higher for the shorter interval than for the interval longer than 5 weeks 36 10 9 Mahantsthetty et al. reported acute grade 3–4 gastrointestinal (GI), and genitourinary (GU) toxicities in 11%, and 9% of patients after inadvertent surgery for cervical cancer 37 Conclusion When compared to intravaginal brachytherapy boost, there was a significant improvement in the survival outcome with increase in total dose using interstital brachytherapy for patients presenting with residual or recurrent disease after inadvertent hysterectomy. However, to fully discern the extent of ISBT’s advantages, a meticulously designed prospective randomized study becomes imperative. Electronic supplementary material Below is the link to the electronic supplementary material.  Supplementary Material 1 Publisher’s note Springer Nature remains neutral with regard to jurisdictional claims in published maps and institutional affiliations. Author contributions S.C. A.P. A.S. L.A. A.M. and P.V. wrote the main manuscript text and S.M. G.P. N.G. S.R. S.A. prepared figures. All authors reviewed the manuscript. Data availability Research data are available and will be shared upon request to the corresponding author. Declarations Competing interests The authors declare no competing interests. References 1. Yang L Regional and country-level trends in cervical cancer screening coverage in sub-Saharan Africa: A systematic analysis of population-based surveys (2000–2020) PLoS Med. 2023 20 1 e1004143 10.1371/journal.pmed.1004143 36634119 PMC9882915 Yang, L. et al. Regional and country-level trends in cervical cancer screening coverage in sub-Saharan Africa: A systematic analysis of population-based surveys (2000–2020). PLoS Med. 20 36634119 10.1371/journal.pmed.1004143 PMC9882915 2. Kathleen MS ConCerv: a prospective trial of Conservative surgery for low-risk early-stage cervical cancer Int. J. Gynecol. Cancer 2021 31 10 1317 1325 10.1136/ijgc-2021-002921 34493587 PMC11910188 Kathleen, M. S. et al. ConCerv: a prospective trial of Conservative surgery for low-risk early-stage cervical cancer. Int. J. Gynecol. Cancer 31 34493587 10.1136/ijgc-2021-002921 PMC11910188 3. Marie Plante, Janice S Simple versus radical hysterectomy in women with Low-Risk cervical Cancer N Engl. J. Med. 2024 390 819 829 10.1056/NEJMoa2308900 38416430 Marie Plante, Janice, S. et al. Simple versus radical hysterectomy in women with Low-Risk cervical Cancer. N Engl. J. Med. 390 38416430 10.1056/NEJMoa2308900 4. Panici PB Cutillo G Angioli R Modulation of surgery in early invasive cervical cancer Crit. Rev. Oncol. Hematol. 2003 48 3 263 270 10.1016/S1040-8428(03)00124-0 14693338 Panici, P. B., Cutillo, G. & Angioli, R. Modulation of surgery in early invasive cervical cancer. Crit. Rev. Oncol. Hematol. 48 14693338 10.1016/s1040-8428(03)00124-0 5. Sharma DN Postoperative radiotherapy following inadvertent simple hysterectomy versus radical hysterectomy for cervical carcinoma Asian Pac. J. Cancer Prev. 2011 12 1537 1541 22126495 Sharma, D. N. et al. Postoperative radiotherapy following inadvertent simple hysterectomy versus radical hysterectomy for cervical carcinoma. Asian Pac. J. Cancer Prev. 12 22126495 6. Barmon, D. et al. Inadvertent simple hysterectomy in carcinoma of cervix Uteri: A comparison of simple hysterectomy followed by chemoradiation and upfront chemoradiation. Indian J. Gynecol. Oncolog 18 7. Munstedt, K. et al. Consequences of inadvertent, suboptimal primary surgery in carcinoma of the uterine cervix. Gynecol. Oncol. 94 10.1016/j.ygyno.2004.05.029 15297197 8. Munstedt, K. et al. Shortcomings and deficits in the surgical treatment of gynecological cancers: a German problem only? Gynecol. Oncol. 86 10.1006/gyno.2002.6767 12217757 9. Roman LD Prognostic factors for patients undergoing simple hysterectomy in the presence of invasive cancer of the cervix Gynecol. Oncol. 1993 50 2 179 184 10.1006/gyno.1993.1189 8375732 Roman, L. D. et al. Prognostic factors for patients undergoing simple hysterectomy in the presence of invasive cancer of the cervix. Gynecol. Oncol. 50 8375732 10.1006/gyno.1993.1189 10. Andras, E. J., Fletcher, G. H. & Rutledge, F. Radiotherapy of carcinoma of the cervix following simple hysterectomy. AmJ Obstet. Gynecol. 115 10.1016/0002-9378(73)90613-3 4631678 11. Davy, M., Bentzen, H. & Jahren, R. Simple hysterectomy in the presence of invasive cervical cancer. Acta Obstet. Gynecol. Scand. 56 10.3109/00016347709158350 857590 12. Durrance, F. Y. Radiotherapy following simple hysterectomy in patients with stage I and II carcinoma of the cervix. Am. J. Roentgenol. Radium Ther. Nuclear Med. 102 10.2214/ajr.102.1.165 5634758 13. Choi DH Huh SJ Nam KH Radiation therapy results for patients undergoing inappropriate surgery in the presence of invasive cervical carcinoma Gynecol. Oncol. 1997 65 506 511 10.1006/gyno.1997.4711 9190983 Choi, D. H., Huh, S. J. & Nam, K. H. Radiation therapy results for patients undergoing inappropriate surgery in the presence of invasive cervical carcinoma. Gynecol. Oncol. 65 9190983 10.1006/gyno.1997.4711 14. Hopkins, M. P. et al. Invasive cervical cancer is treated initially by standard hysterectomy. Gyn Oncol. 36 10.1016/0090-8258(90)90100-y 2295456 15. Lee CD Recent developments and best practice in brachytherapy treatment planning Br. J. Radiol. 2014 87 1041 20140146 10.1259/bjr.20140146 24734939 PMC4453147 Lee, C. D. Recent developments and best practice in brachytherapy treatment planning. Br. J. Radiol. 87 24734939 10.1259/bjr.20140146 PMC4453147 16. Prescribing, Recording, and reporting brachytherapy for Cancer of the cervix. J. ICRU 13 10.1093/jicru/ndw027 27335496 17. Small W Jr NRG oncology/rtog consensus guidelines for delineation of clinical target volume for intensity modulated pelvic radiation therapy in postoperative treatment of endometrial and cervical cancer: an update Int. J. Radiat. Oncol. Biol. Phys. 2021 109 2 413 424 10.1016/j.ijrobp.2020.08.061 32905846 PMC7856050 Small, W. Jr et al. NRG oncology/rtog consensus guidelines for delineation of clinical target volume for intensity modulated pelvic radiation therapy in postoperative treatment of endometrial and cervical cancer: an update. Int. J. Radiat. Oncol. Biol. Phys. 109 32905846 10.1016/j.ijrobp.2020.08.061 PMC7856050 18. Cosbie, W. G. & Tor, M. B. Radiotherapy following hysterectomy performed for or in the presence of cancer of the cervix. Trans. Eighteenth Annu. Meet Soc. Obstet. Gynaecol. Can. 85 10.1016/s0002-9378(16)35442-4 14023216 19. Fang FM Radiotherapy following simple hysterectomy in patients with invasive carcinoma of the uterine cervix J. Formos. Med. Assoc. 1993 92 420 425 8104595 Fang, F. M. et al. Radiotherapy following simple hysterectomy in patients with invasive carcinoma of the uterine cervix. J. Formos. Med. Assoc. 92 8104595 20. Crane CH Schneider BF Occult carcinoma discovered after simple hysterectomy treated with postoperative radiotherapy Int. J. Radiat. Oncol. Biol. Phys. 1999 43 5 1049 1053 10.1016/S0360-3016(98)00523-9 10192354 Crane, C. H. & Schneider, B. F. Occult carcinoma discovered after simple hysterectomy treated with postoperative radiotherapy. Int. J. Radiat. Oncol. Biol. Phys. 43 10192354 10.1016/s0360-3016(98)00523-9 21. Huerta Bahena J Postoperative radiotherapy in patients with invasive uterine cervix cancer treated previously with simple hysterectomy. Results from the hospital de Oncologia,Centro medico Nacional SXXI Ginecol. Obstet. Mex 2003 71 304 311 14515661 Huerta Bahena, J. et al. Postoperative radiotherapy in patients with invasive uterine cervix cancer treated previously with simple hysterectomy. Results from the hospital de Oncologia,Centro medico Nacional SXXI. Ginecol. Obstet. Mex 71 14515661 22. Chen SW Postoperative radiotherapy for patients with invasive cervical cancer following treatment with simple hysterectomy J. Clin. Oncol. 2003 33 9 477 481 10.1093/jjco/hyg086 14594942 Chen, S. W. et al. Postoperative radiotherapy for patients with invasive cervical cancer following treatment with simple hysterectomy. J. Clin. Oncol. 33 10.1093/jjco/hyg086 14594942 23. Hsu WL Long-term treatment results of invasive cervical cancer patients undergoing inadvertent hysterectomy followed by salvage radiotherapy Int. J. Radiat. Oncol. Biol. Phys. 2004 59 521 527 10.1016/j.ijrobp.2003.11.023 15145172 Hsu, W. L. et al. Long-term treatment results of invasive cervical cancer patients undergoing inadvertent hysterectomy followed by salvage radiotherapy. Int. J. Radiat. Oncol. Biol. Phys. 59 15145172 10.1016/j.ijrobp.2003.11.023 24. Garg Sonali D Management of invasive cervical Cancer after simple hysterectomy J. Obstet. Gynaecol. India 2004 54 367 371 Garg Sonali, D. et al. Management of invasive cervical Cancer after simple hysterectomy. J. Obstet. Gynaecol. India 54 25. Saibishkumar EP Results of salvage radiotherapy after inadequate surgery in invasive cervical carcinoma patients: A retrospective analysis Int. J. Radiat. Oncol. 2005 63 828 833 10.1016/j.ijrobp.2005.04.002 15950400 Saibishkumar, E. P. et al. Results of salvage radiotherapy after inadequate surgery in invasive cervical carcinoma patients: A retrospective analysis. Int. J. Radiat. Oncol. 63 10.1016/j.ijrobp.2005.04.002 15950400 26. Small W Jr American brachytherapy society. American brachytherapy society.consensus guidelines for adjuvant vaginal cuff brachytherapy after hysterectomy Brachytherapy 2012 11 1 58 67 10.1016/j.brachy.2011.08.005 22265439 Small, W. Jr et al. American brachytherapy society. American brachytherapy society.consensus guidelines for adjuvant vaginal cuff brachytherapy after hysterectomy. Brachytherapy 11 22265439 10.1016/j.brachy.2011.08.005 27. Haylen BT Surgical anatomy of the mid-vagina Neurourol. Urodyn. 2022 41 6 1293 1304 10.1002/nau.24994 35731184 PMC9540639 Haylen, B. T. et al. Surgical anatomy of the mid-vagina. Neurourol. Urodyn. 41 35731184 10.1002/nau.24994 PMC9540639 28. Green JA Survival and recurrence after concomitant chemotherapy and radiotherapy for cancer of the uterine cervix: a systematic review and meta-analysis Lancet 2001 358 9284 781 786 10.1016/S0140-6736(01)05965-7 11564482 Green, J. A. et al. Survival and recurrence after concomitant chemotherapy and radiotherapy for cancer of the uterine cervix: a systematic review and meta-analysis. Lancet 358 11564482 10.1016/S0140-6736(01)05965-7 29. Li M Adjuvant chemoradiotherapy versus radiotherapy in cervical cancer patients with intermediate-risk factors: A systematic review and meta-analysis Eur. J. Obstet. Gynecol. Reprod. Biol. 2019 238 1 6 10.1016/j.ejogrb.2019.04.039 31082737 Li, M. et al. Adjuvant chemoradiotherapy versus radiotherapy in cervical cancer patients with intermediate-risk factors: A systematic review and meta-analysis. Eur. J. Obstet. Gynecol. Reprod. Biol. 238 31082737 10.1016/j.ejogrb.2019.04.039 30. Sun HY Cisplatin concurrent chemoradiotherapy vs adjuvant radiation in stage IB/IIA cervical cancer with intermediate risk factors, treated with radical surgery: a retrospective study Onco Targets Ther. 2018 11 1149 1155 10.2147/OTT.S158214 29563803 PMC5846308 Sun, H. Y. et al. Cisplatin concurrent chemoradiotherapy vs adjuvant radiation in stage IB/IIA cervical cancer with intermediate risk factors, treated with radical surgery: a retrospective study. Onco Targets Ther. 11 29563803 10.2147/OTT.S158214 PMC5846308 31. Peters WA 3rd Concurrent chemotherapy and pelvic radiation therapy compared with pelvic radiation therapy alone as adjuvant therapy after radical surgery in high-risk early-stage cancer of the cervix J. Clin. Oncol. 2000 18 8 1606 1613 10.1200/JCO.2000.18.8.1606 10764420 Peters, W. A. 3rd et al. Concurrent chemotherapy and pelvic radiation therapy compared with pelvic radiation therapy alone as adjuvant therapy after radical surgery in high-risk early-stage cancer of the cervix. J. Clin. Oncol. 18 10764420 10.1200/JCO.2000.18.8.1606 32. Choudhary S Impact of induction chemotherapy followed by radiotherapy in patients of invasive cervical carcinoma with inadvertent hysterectomy: A retrospective study J. Clin. Diagn. Res. 2015 9 XC01 XC04 26557599 10.7860/JCDR/2015/15739.6640 PMC4625318 Choudhary, S. Impact of induction chemotherapy followed by radiotherapy in patients of invasive cervical carcinoma with inadvertent hysterectomy: A retrospective study. J. Clin. Diagn. Res. 9 26557599 10.7860/JCDR/2015/15739.6640 PMC4625318 33. Kim HS Phase II study of consolidation chemotherapy after adjuvant or primary concurrent chemoradiation using Paclitaxel and carboplatin to treat High-Risk Early-Stage or locally advanced cervical Cancer Cancer Res. Treat. 2012 44 2 97 103 10.4143/crt.2012.44.2.97 22802747 PMC3394869 Kim, H. S. et al. Phase II study of consolidation chemotherapy after adjuvant or primary concurrent chemoradiation using Paclitaxel and carboplatin to treat High-Risk Early-Stage or locally advanced cervical Cancer. Cancer Res. Treat. 44 22802747 10.4143/crt.2012.44.2.97 PMC3394869 34. Linda R Adjuvant chemotherapy following chemoradiotherapy as primary treatment for locally advanced cervical cancer versus chemoradiotherapy alone (OUTBACK): an international, open-label, randomised, phase 3 trial Lancet Oncol. 2023 24 5 468 482 10.1016/S1470-2045(23)00147-X 37080223 PMC11075114 Linda, R. et al. Adjuvant chemotherapy following chemoradiotherapy as primary treatment for locally advanced cervical cancer versus chemoradiotherapy alone (OUTBACK): an international, open-label, randomised, phase 3 trial. Lancet Oncol. 24 37080223 10.1016/S1470-2045(23)00147-X PMC11075114 35. Nanda Horeweg, P. et al. A systematic review and meta-analysis of adjuvant chemotherapy after chemoradiation for locally advanced cervical cancer. Crit. Rev. Oncol. Hematol. 172 10.1016/j.critrevonc.2022.103638 35189325 36. You KY The selection of time interval between surgery and adjuvant therapy in Early-Stage cervical Cancer Int. J. Gynecol. Cancer 2018 28 7 1325 1332 10.1097/IGC.0000000000001307 30074519 PMC6116800 You, K. Y. et al. The selection of time interval between surgery and adjuvant therapy in Early-Stage cervical Cancer. Int. J. Gynecol. Cancer 28 30074519 10.1097/IGC.0000000000001307 PMC6116800 37. Mahantshetty U Template-based high-dose-rate interstitial brachytherapy in gynecologic cancers: a single institutional experience Brachytherapy 2014 13 4 337 342 10.1016/j.brachy.2013.09.009 24176863 Mahantshetty, U. et al. Template-based high-dose-rate interstitial brachytherapy in gynecologic cancers: a single institutional experience. Brachytherapy 13 24176863 10.1016/j.brachy.2013.09.009 ",
  "metadata": {
    "Title of this paper": "Template-based high-dose-rate interstitial brachytherapy in gynecologic cancers: a single institutional experience",
    "Journal it was published in:": "Scientific Reports",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12484820/"
  }
}