{
  "title": "Paper_247",
  "abstract": "pmc Front Oncol Front Oncol 1755 frontonco Front. Oncol. Frontiers in Oncology 2234-943X Frontiers Media SA PMC12491039 PMC12491039.1 12491039 12491039 10.3389/fonc.2025.1615285 1 Oncology Original Research Recurrence patterns and prognosis of esophageal cancer patients based on the Rbr resection status Zhang Peng  1  2  † Zhang Guoqing  1  3  † Zhang Kaishang  1  2  3 Qiao Yujin  1  2 Li Xiangnan  1  2  3  * Zhao Song  1  2  *  1 Department of Thoracic Surgery, First Affiliated Hospital of Zhengzhou University Zhengzhou, Henan China  2 Henan Medical Key Laboratory of Thoracic Oncology Zhengzhou, Henan China  3 Henan Province Engineering Research Center of Molecular Pathology and Clinical Experiment of Thoracic Diseases Zhengzhou, Henan China Edited by: Ling Kui Reviewed by: Gang Lin Felipe Carlos Parreño Manchado, University of Salamanca, Spain *Correspondence: Song Zhao, zhaosong@zzu.edu.cn lxn-2000@163.com †These authors have contributed equally to this work 19 9 2025 2025 15 480898 1615285 24 4 2025 08 9 2025 19 09 2025 04 10 2025 04 10 2025 Copyright © 2025 Zhang, Zhang, Zhang, Qiao, Li and Zhao. 2025 Zhang, Zhang, Zhang, Qiao, Li and Zhao https://creativecommons.org/licenses/by/4.0/ This is an open-access article distributed under the terms of the Creative Commons Attribution License (CC BY). The use, distribution or reproduction in other forums is permitted, provided the original author(s) and the copyright owner(s) are credited and that the original publication in this journal is cited, in accordance with accepted academic practice. No use, distribution or reproduction is permitted which does not comply with these terms. Introduction Despite achieving complete resection (R0) and pathological complete response (pCR) in esophageal squamous cell carcinoma (ESCC) patients, recurrence is still observed, resulting in poorer overall survival (OS). We introduced a resection status classification, Rbr +/- Materials and methods We retrospectively reviewed ESCC patients who underwent neoadjuvant therapy plus curative surgery in the Department of Thoracic Surgery at the First Affiliated Hospital of Zhengzhou University between April 2017 and August 2023. Overlap weighting (OW) was used to balance the baseline characteristics between Rbr + - Results In total, 443 eligible patients were included and categorized into Rbr + - + vs + + + Conclusions Rbr + Rbr esophageal squamous cell carcinoma recurrence locoregional recurrence neoadjuvant therapy The author(s) declare that no financial support was received for the research and/or publication of this article. pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement yes pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes section-in-acceptance Gastrointestinal Cancers: Gastric and Esophageal Cancers 1 Introduction Multimodal treatment, including neoadjuvant chemotherapy (NACT) with or without radiotherapy (NACRT) followed by curative surgery, has become the standard of care for locally advanced esophageal squamous cell carcinoma (ESCC). This approach can downstage tumors, increase the likelihood of complete resection, and improve survival outcomes ( 1 4 5 8 2 6 9 11 Achieving complete resection of the esophagus with negative margins (R0 resection) is essential for esophagectomy. The margins encompass the proximal, distal, and circumferential resection margins (CRMs). While a 5-cm longitudinal margin is generally considered safe, the definition and implications of a positive CRM remain uncertain and debated ( 12 13 14 16 Previously, we proposed a novel resection status, Rbr +/- 7 +/- 7 - 7 +/- + 2 Materials and methods 2.1 Study design and patient selection This single-center retrospective study was conducted in the Department of Thoracic Surgery at the First Affiliated Hospital of Zhengzhou University, where we reviewed the data of patients who underwent esophagectomy between April 2017 and August 2023. Patients were included in this study if they met the following criteria: (1) had a histologically confirmed diagnosis of ESCC; (2) received any neoadjuvant therapy, regardless of the treatment strategy used; (3) achieved R0 resection; and (4) had available postoperative follow-up data. The exclusion criteria were as follows: (1) a history of previous or concomitant malignancies; (2) lack of neoadjuvant therapy; (3) noncurative resection; (4) pathological confirmation of a cancer type other than ESCC; (5) open surgery; and (6) incomplete medical or follow-up records. The patient characteristics of interest included age, sex, history of alcohol and tobacco use, type of neoadjuvant therapy received, surgery type, clinical stage, postoperative therapy, tumor location, ypStage (pathological stage after neoadjuvant therapy), tumor regression grade (TRG), and Rbr +/- This retrospective study was reviewed and approved by the Institutional Review Board and Ethics Committee of the First Affiliated Hospital of Zhengzhou University (approval number: 2024-KY-1392-001). Since this study was retrospective, obtaining written informed consent from patients was not necessary. This study was conducted in accordance with the principles of the Declaration of Helsinki. 2.2 Neoadjuvant therapy regimen and surgical procedure In this study, all patients received a basic regimen of 2–4 cycles of NACT, primarily consisting of platinum-based agents combined with either paclitaxel or docetaxel, administered every three weeks. The typical NACT regimens included cisplatin (75 mg/m²) on day 1, followed by nab-paclitaxel (260 mg/m² on day 1 or 130 mg/m 2 Experienced thoracic surgeons conducted minimally invasive surgery via a minimum of two-field lymphadenectomies 3 to 6 weeks after NACT/NACI or 4 to 8 weeks after NACRT if the tumor was resectable. Three-field lymph nodes dissection (including cervical lymph nodes dissection) was performed when positive supraclavicular lymph nodes were detected pathologically. 2.3 Clinical and pathological assessment Every patient suspected of having esophageal carcinoma underwent esophagoscopy and pathologic examination for diagnosis. Endoscopic ultrasonography (EUS), thoracoabdominal enhanced computed tomography (CT), positron emission tomography (PET) (a small minority) and cervical ultrasonography were utilized to evaluate the clinical stage before surgery. Cervical enhanced CT scans and ultrasound/CT-guided biopsy were conducted if the cervical lymph nodes were suspected to be metastatic. Tumors were staged according to the eighth edition of the American Joint Committee on Cancer/International Union Against Cancer (AJCC/UICC) classification. TRG was assessed by pathologists specializing in gastrointestinal tumors according to the standards set forth by the American Society of Clinical Oncology and the College of American Pathologists (ASCO-CAP) guidelines (  Supplementary Table 1 2.4 Rbr +/- The content of Rbr +/- 7 + −  Supplementary Figure 1  Supplementary Figure 2 +/- +  Supplementary Figure 1 –  Supplementary Figure 2 2.5 Follow-up and endpoints A significant proportion of patients in this study were enrolled in clinical studies conducted at our center, and adjuvant therapy was initiated either following reassessment by multidisciplinary team (MDT) or in accordance with the specific clinical trial protocols to which they were assigned. The follow-up data were extracted from our prospective database. Patients were scheduled for follow-up visits every 3 to 6 months during the first two years, then every 6 to 12 months from years three to five, and annually thereafter until death or loss to follow-up. The primary endpoint was the incidence of LRR. LRR was defined as the reappearance of a tumor within the anastomotic site and/or in the mediastinum of the surgical field, esophageal bed, and/or regional lymph nodes, including the cervical and para-aortic nodes. The secondary endpoints were OS and LRR-free survival (LRRFS). LRRFS and OS were calculated from the date of surgery until LRR and death or censoring, respectively. In this study, we also reported on distant metastasis (DM), defined as recurrence occurring outside the LRR. 2.6 Statistical analysis Descriptive statistics were used to summarize the baseline characteristics. Continuous variables (age and BMI) were categorized into two groups, and thus, all measures were expressed as frequencies and percentages. A p value of <0.05 was considered to indicate statistical significance. All the statistical tests were two-tailed. Statistical analyses were performed via R software (version 4.4.1, https://www.r-project.org All samples were stratified according to Rbr status. To minimize the influence of confounding factors while maximizing the retention of a valid sample size, we initially applied the overlap weighting (OW)-adjusted statistical model to balance the baseline characteristics between the Rbr + - - + + - 3 Result 3.1 Overall patient cohort and baseline characteristics After applying the inclusion and exclusion criteria, a total of 443 eligible patients were included in the study (  Figure 1 + -  Table 1 + - vs vs vs vs vs vs vs vs + - + vs Figure 1 Flow chart of reviewing eligible patients and development of cohorts in this study. Flowchart showing selection of patients for esophageal cancer study from 2014 to 2024. From 2185 cases, 516 with squamous cell carcinoma received neoadjuvant therapy. After exclusions, 443 eligible patients were included and divided into groups: Rbr+ (141 patients) and Rbr- (302 patients). Table 1 Baseline characteristics of Rbr +/- Variables Overall (n = 443) Unweighted Weighted  a Rbr - Rbr + SMD Rbr - Rbr + SMD Age, n (%) <0.001 ≥60 350 (79.0) 243 (80.5) 107 (75.9)  0.111 24.8 24.8 <60 93 (21.0) 59 (19.5) 34 (24.1) 75.2 75.2 Sex, n (%)  0.233 <0.001 Female 125 (28.2) 95 (31.5) 30 (21.3) 23.7 23.7 Male 318 (71.8) 207 (68.5) 111 (78.7) 76.3 76.3 BMI (kg/m 2 0.014 0.001 >24.0 199 (44.9) 135 (44.7) 64 (45.4) 46.3 46.2 ≤24.0 244 (55.1) 167 (55.3) 77 (54.6) 53.7 53.8 Smoke, n (%)  0.149 Never 267 (60.3) 189 (62.6) 78 (55.3) 58.1 58.1 <0.001 Former 46 (10.4) 29 (9.6) 17 (12.1) 9.7 9.7 Current 130 (29.3) 84 (27.8) 46 (32.6) 32.1 32.1 Drink, n (%)  0.139 <0.001 Never 321 (72.5) 223 (73.8) 98 (69.5) 72.1 72.1 Former 35 (7.9) 25 (8.3) 10 (7.1) 6.5 6.5 Current 87 (19.6) 54 (17.9) 33 (23.4) 21.4 21.4 Neoadjuvant therapy, n (%)  0.316 <0.001 NACT 203 (45.8) 133 (44.0) 70 (49.6) 50.6 50.6 NACI 223 (50.3) 164 (54.3) 59 (41.8) 45.5 45.5 NACRT 17 (3.8) 5 (1.7) 12 (8.5) 3.9 3.9 Tumor location, n (%)  0.213 <0.001 Upper 33 (7.4) 21 (7.0) 12 (8.5) 7.9 7.9 Middle 271 (61.2) 177 (58.6) 94 (66.7) 64.5 64.5 Lower 139 (31.4) 104 (34.4) 35 (24.8) 27.6 27.6 Clinical stage, n (%)  0.164 <0.001 II 236 (53.3) 167 (55.3) 69 (48.9) 51.5 51.5 III 150 (33.9) 101 (33.4) 49 (34.8) 34.9 34.9 IVA 57 (12.9) 34 (11.3) 23 (16.3) 13.6 13.6 Surgery, n (%)  0.203 <0.001 McKeown 426 (96.2) 287 (95.0) 139 (98.6) 98.0 98.0 Others  b 17 (3.8) 15 (5.0) 2 (1.4) 2.0 2.0 ypStage, n (%)  0.485 <0.001 I 201 (45.4) 159 (52.6) 42 (29.8) 37.4 37.4 II 64 (14.4) 40 (13.2) 24 (17.0) 16.4 16.4 III 166 (37.5) 97 (32.1) 69 (48.9) 43.2 43.2 IV 12 (2.7) 6 (2.0) 6 (4.3) 3.0 3.0 Differentiation, n (%)  0.172 <0.001 Well 94 (21.2) 70 (23.2) 24 (17.0) 17.8 17.8 Moderate 288 (65.0) 194 (64.2) 94 (66.7) 67.6 67.6 Poor 61 (13.8) 38 (12.6) 23 (16.3) 14.7 14.7 TRG, n (%)  0.475 <0.001 0 118 (26.6) 94 (31.1) 24 (17.0) 20.2 20.2 1 72 (16.3) 56 (18.5) 16 (11.3) 13.8 13.8 2 125 (28.2) 81 (26.8) 44 (31.2) 31.2 31.2 3 128 (28.9) 71 (23.5) 57 (40.4) 34.8 34.8 Neural invasion, n (%)  0.253 <0.001 Yes 66 (14.9) 36 (11.9) 30 (21.3) 18.2 18.2 No 377 (85.1) 266 (88.1) 111 (78.7) 77.8 77.8 Lymphovascular invasion, n (%)  0.328 <0.001 Yes 80 (18.1) 42 (13.9) 38 (27.0) 22.2 22.2 No 363 (81.9) 260 (86.1) 103 (73.0) 77.8 77.8 Extent of lymph node dissection, n (%)  0.303 <0.001 Two-field 355 (80.1) 231 (76.5) 124 (87.9) 84.6 84.6 Three-field 88 (19.9) 71 (23.5) 17 (12.1) 15.4 15.4 Adjuvant chemotherapy, n (%)  0.205 <0.001 Radiotherapy included  c 27 (6.1) 15 (5.0) 12 (8.5) 7.4 7.4 Others  d 243 (54.9) 161 (53.3) 82 (58.2) 56.6 56.6 None 173 (39.1) 126 (41.7) 47 (33.3) 36.0 36.0 BMI, body mass index; NACT, neoadjuvant chemotherapy; NACRT, neoadjuvant chemoradiotherapy; NACI, neoadjuvant chemoimmunotherapy; TRG, tumor regression grade. SMD>0.1, denoting imbalance between groups, are highlighted in bold. a After overlap weighting, a single individual no longer represents a single data entity; thus, raw counts are not reported after overlap weighting. b In addition to McKeown surgery, we also performed Ivor–Lewis esophagectomy and inflatable video-assisted mediastinoscopy-assisted transhiatal esophagectomy. c Including chemoradiotherapy and immunoradiotherapy. d Without radiotherapy, adjuvant therapy typically consists of chemotherapy alone or a combination of chemotherapy and immunotherapy. After OW, for unbalanced variables (age, sex, smoking status, alcohol consumption, neoadjuvant therapy, tumor location, clinical stage, surgery type, ypStage, differentiation, TRG, neural invasion, lymphovascular invasion, extent of lymph node dissection and adjuvant therapy), the distributions of all baseline covariates were well balanced and comparable. Subsequent analyses were conducted on the basis of these balanced data. 3.2 Outcome of LRR and patterns of LRR and DM Before OW, the incidences of LRR and DM were similar, at 12.4% and 12.6%, respectively, in the total cohort (  Table 2 + vs  Table 2  Figure 2 + vs  Table 2 Table 2 Comparison of locoregional recurrence rates between the Rbr - + Variables Overall Unweighted Weighted  a Rbr - Rbr + P SMD Rbr - Rbr + P SMD Locoregional recurrence  <0.001  0.430  0.034  0.242 Yes 55 (12.4) 23 (7.6) 32 (22.7) 11.4 20.1 No 388 (87.6) 279 (92.4) 109 (77.3) 88.7 79.9 Distant metastasis Yes 56 (12.6) 32 (10.6) 24 (17.0) 0.081  0.187 14.7 15.9 0.774 0.032 No 387 (87.4) 270 (89.4) 117 (83.0) 85.3 84.1 SMD>0.1 or P<0.05, denoting imbalance between groups, are highlighted in bold. a After overlap weighting, a single individual no longer represents a single data entity; thus, raw counts are not reported after overlap weighting. SMD, standardized mean difference. Figure 2 Patterns of locoregional and distant recurrence observed in this study. All percentages in this figure have been recalculated based on the entire cohort. Created in BioRender BioRender.com/b93k052 Diagram of locoregional recurrence and distant metastasis, with a human silhouette. Locoregional areas: cervical lymph nodes (2.9%), anastomosis (3.4%), mediastinum (7.9%), combined mediastinum and anastomosis (1.8%). Distant metastasis areas: multiple (0.9%), brain (0.9%), lung (3.6%), pleura (0.9%), bone (3.2%), liver (2.0%), abdominal lymph nodes (0.9%), peritoneum (1.1%), kidney (0.5%). A color-coded bar at the top indicates total recurrence rates. Multivariate logistic regression analysis revealed that only Rbr +  Table 3 Table 3 Multivariable logistic regression analysis of factors relevant to LR. Variables OR 95% CI P value Age <60 1.00 ≥60≥ 0.89 0.42–1.88 0.749 Sex Female 1.00 Male 1.63 0.67–3.97 0.279 Rbr Rbr- 1.00 Rbr+ 2.19 1.14–4.17  0.018 Clinical stage II 1.00 III 1.82 0.83–3.99 0.132 IVA 1.82 0.68–4.85 0.232 Neoadjuvant therapy NACT 1.00 NACI 0.60 0.29–1.23 0.164 NACRT 2.13 0.52–8.62 0.290 TRG 0 1.00 1 1.46 0.44–4.84 0.535 2 0.83 0.21–3.21 0.784 3 1.15 0.31–4.27 0.839 ypStage I 1.00 II 0.55 0.15–2.01 0.367 III 1.17 0.44–3.12 0.760 IV 2.97 0.67–13.18 0.151 Extent of lymph node dissection Two-field 1.00 Three-field 0.43 0.12–1.57 0.201 Neural invasion No 1.00 Yes 1.94 0.81–4.64 0.136 Lymphovascular invasion No 1.00 Yes 2.15 0.87–5.34 0.099 Adjuvant chemotherapy None 1.00 Others 1.65 0.77–3.52 0.196 Radiotherapy included 0.72 0.17–3.07 0.661 NACT, neoadjuvant chemotherapy; NACRT, neoadjuvant chemoradiotherapy; NACI, neoadjuvant chemoimmunotherapy; TRG, tumor regression grade; OR, odds ratio; CI, confidence interval. P<0.05, denoting imbalance between groups, are highlighted in bold. We also reported the patterns of recurrence in this study (  Figure 2 3.3 The outcomes of LRRFS and OS for Rbr + The median follow-up for the entire population from the date of definitive surgery was 18 months (IQR: 9–63 months). The median time to LRR was 16 months (IQR: 8–63 months). The KM curves indicated that Rbr +  Figure 3A  Figure 3B +  Table 4  Table 4 Figure 3 Locoregional recurrence-free (LRRFS) and overall survival (OS) of Rbr+/- status in the whole cohort and adjuvant therapy (AT) in Rbr+ group. (A) (B) (C) (D) Kaplan-Meier survival curves in four panels. Panel A shows locoregional recurrence-free survival; the blue line (Rbr-) is above the red line (Rbr+) with a p-value of 0.018. Panel B illustrates overall survival with the same color coding, without significant difference (p=0.272). Panel C and D examine survival comparing groups: blue for radiotherapy included, red for others, and green for none. Panel C shows locoregional recurrence-free survival (p=0.593) and Panel D shows overall survival (p=0.183). Table 4 Multivariable Cox regression analysis of factors relevant to LR. Variables LRRFS OS HR 95% CI P value HR 95% CI P value Age <60 1.00 1.00 ≥60 0.69 0.35–1.36 0.28 1.24 0.70–2.20 0.456 Sex Female 1.00 1.00 Male 1.17 0.51–2.72 0.71 1.16 0.62–2.19 0.640 Rbr Rbr - 1.00 1.00 Rbr + 2.56 1.28–5.11  0.008 1.52 0.90–2.58 0.120 Clinical stage II 1.00 1.00 III 1.42 0.72–2.79 0.314 1.13 0.62–2.04 0.693 IVA 1.60 0.62–3.95 0.306 1.36 0.69–2.69 0.375 Neoadjuvant therapy NACT 1.00 1.00 NACI 0.86 0.41–1.84 0.707 0.81 0.41–1.59 0.537 NACRT 2.34 0.58–9.49 0.234 2.26 0.56–9.10 0.251 TRG 0 1.00 1.00 1 1.07 0.33–3.46 0.597 1.43 0.50–4.10 0.505 2 0.73 0.19–2.85 0.638 2.02 0.67–6.11 0.214 3 1.13 0.31–4.08 0.851 1.32 0.40–4.33 0.652 ypStage I 1.00 1.00 II 0.72 0.22–2.40 0.594 1.26 0.54–2.95 0.600 III 1.32 0.58–2.98 0.506 1.33 0.67–2.64 0.410 IV 5.03 1.54–16.47  0.008 5.11 1.70–15.40  0.004 Extent of lymph node dissection Two-field 1.00 1.00 Three-field 0.50 0.13–1.89 0.307 0.98 0.39–2.46 0.972 Neural invasion No 1.00 1.00 Yes 2.25 1.08–4.71  0.031 1.20 0.67–2.17 0.540 Lymphovascular invasion No 1.00 1.00 Yes 1.85 0.89–3.85 0.099 1.40 0.79–2.49 0.252 Adjuvant chemotherapy None 1.00 1.00 Others 0.99 0.47–2.12 0.987 0.74 0.28–0.93  0.028 Radiotherapy 0.40 0.09–1.83 0.239 0.51 0.32–1.69 0.471 NACT, neoadjuvant chemotherapy; NACI, neoadjuvant chemoimmunotherapy; NACRT, neoadjuvant radiotherapy; LRRFS, locoregional recurrence-free survival; OS, overall survival; HR, hazard ratio; CI, confidence interval. P<0.05, denoting imbalance between groups, are highlighted in bold. 3.4 Subgroup analysis of the role of adjuvant therapy in the Rbr + Owing to the significant association between Rbr + +  Figures 3C, D + 4 Discussion This observational study presents a resection status, Rbr +/- 7 + - 7 + vs 17 + vs + + - + + The mechanism by which Rbr + 14 16 15 15 15 14 14 14 15 16 + 7 Generally, DM is reported as the predominant recurrence type of esophageal cancer following neoadjuvant therapy ( 18 20 +  Table 2 7 21 7 + - + 7 21 vs 21 In our study, Rbr status did not influence OS. When various AT regimens were compared with regard to OS in the Rbr + 2 2 Given the relatively high recurrence rate after neoadjuvant therapy plus surgery, AT is theoretically necessary. However, optimal patient selection, timing and regimen remain unclear, and previous studies have been inconclusive ( 22 25  Table 4  Figure 3B + 26 27 +  Figure 3D 28 30 + As a supplementary indicator to standard R0 resection, Rbr + + + To maximize the utility of Rbr as a supplementary tool and mitigate its inherent reliance on operator experience and subjective interpretation, future efforts must also focus on standardizing the Rbr assessment itself. Going forward, we plan to create a weighted Rbr index based on quantifiable imaging and intraoperative metrics. For example, we will measure the two−dimensional area of residual mass or fibrosis and assign incremental points for increasing size. Likewise, intraoperative dissection difficulty will be graded on a three−level scale (easy, moderate, difficult) with corresponding score values. In a prospective, multicenter setting, these component weights and threshold cut−points will be optimized and potentially adjusted using the four established pathologic regression patterns as modifiers. Such a structured algorithm will both standardize Rbr assessment across centers and allow automated or semi−automated implementation in future trials. This study also has several limitations. Firstly, while we adjusted for several important confounders, this study lacked data on other potential variables since the characteristics of retrospective study. Secondly, information bias may be present; for example, patients who experienced recurrence or death during follow-up were more likely to be lost to follow-up or to provide inaccurate endpoint information. Thirdly, it remains uncertain whether the Rbr +/- Data availability statement The original contributions presented in the study are included in the article/  Supplementary Material Ethics statement This retrospective study was reviewed and approved by the Institutional Review Board and Ethics Committee of the First Affiliated Hospital of Zhengzhou University (approval number: 2024-KY-1392-001). Since this study was retrospective, obtaining written informed consent from patients was not necessary. Author contributions PZ: Writing – original draft, Methodology, Investigation, Software. GZ: Conceptualization, Project administration, Supervision, Writing – review & editing, Validation, Investigation, Resources. KZ: Writing – review & editing, Investigation. YQ: Investigation, Writing – review & editing. XL: Resources, Writing – review & editing, Data curation, Supervision, Project administration, Validation. SZ: Resources, Project administration, Validation, Supervision, Writing – review & editing, Data curation. Conflict of interest The authors declare that the research was conducted in the absence of any commercial or financial relationships that could be construed as a potential conflict of interest. Generative AI statement The author(s) declare that no Generative AI was used in the creation of this manuscript. Any alternative text (alt text) provided alongside figures in this article has been generated by Frontiers with the support of artificial intelligence and reasonable efforts have been made to ensure accuracy, including review by the authors wherever possible. If you identify any issues, please contact us. Publisher’s note All claims expressed in this article are solely those of the authors and do not necessarily represent those of their affiliated organizations, or those of the publisher, the editors and the reviewers. Any product that may be evaluated in this article, or claim that may be made by its manufacturer, is not guaranteed or endorsed by the publisher. Supplementary material The Supplementary Material for this article can be found online at: https://www.frontiersin.org/articles/10.3389/fonc.2025.1615285/full#supplementary-material References 1 Sjoquist KM Burmeister BH Smithers BM Zalcberg JR Simes RJ Barbour A Survival after neoadjuvant chemotherapy or chemoradiotherapy for resectable oesophageal carcinoma: an updated meta-analysis Lancet Oncol 2011 12 681–92 10.1016/s1470-2045(11)70142-5 21684205 2 Kato K Machida R Ito Y Daiko H Ozawa S Ogata T Doublet chemotherapy, triplet chemotherapy, or doublet chemotherapy combined with radiotherapy as neoadjuvant treatment for locally advanced oesophageal cancer (JCOG1109 NExT): a randomised, controlled, open-label, phase 3 trial Lancet 2024 404 55 66 10.1016/s0140-6736(24)00745-1 38876133 3 Yamasaki M Yasuda T Yano M Hirao M Kobayashi K Fujitani K Multicenter randomized phase II study of cisplatin and fluorouracil plus docetaxel (DCF) compared with cisplatin and fluorouracil plus Adriamycin (ACF) as preoperative chemotherapy for resectable esophageal squamous cell carcinoma (OGSG1003) Ann Oncol 2017 28 116–20 10.1093/annonc/mdw439 27687307 4 Shapiro J van Lanschot JJB Hulshof M van Hagen P van Berge Henegouwen MI Wijnhoven BPL Neoadjuvant chemoradiotherapy plus surgery versus surgery alone for oesophageal or junctional cancer (CROSS): long-term results of a randomised controlled trial Lancet Oncol 2015 16 1090–8 10.1016/s1470-2045(15)00040-6 26254683 5 Yu YK Meng FY Wei XF Chen XK Li HM Liu Q Neoadjuvant chemotherapy combined with immunotherapy versus neoadjuvant chemoradiotherapy in patients with locally advanced esophageal squamous cell carcinoma J Thorac Cardiovasc Surg 2024 168 417 428.e3 10.1016/j.jtcvs.2023.12.030 38246339 6 Tang H Wang H Fang Y Zhu JY Yin J Shen YX Neoadjuvant chemoradiotherapy versus neoadjuvant chemotherapy followed by minimally invasive esophagectomy for locally advanced esophageal squamous cell carcinoma: a prospective multicenter randomized clinical trial Ann Oncol 2023 34 163–72 10.1016/j.annonc.2022.10.508 36400384 7 Zhang G Mu T Zhang Y Jiao J Ding Z Yang H Preoperative camrelizumab combined with chemotherapy for borderline resectable ESCC: A single-arm, prospective, phase 2 study Med 2024 5 11 1424 32.e3 10.1016/j.medj.2024.07.015 39121854 8 Qin J Xue L Hao A Guo X Jiang T Ni Y Neoadjuvant chemotherapy with or without camrelizumab in resectable esophageal squamous cell carcinoma: the randomized phase 3 ESCORT-NEO/NCCES01 trial Nat Med 2024 30 9 2549 57 10.1038/s41591-024-03064-w 38956195 PMC11405280 9 Chao YK Yeh CJ Chuang WY Fan KH Hsieh MJ Chu Y Prognostic significance of immunohistochemically detected lymph node micrometastases in pT0N0 esophageal squamous cell carcinoma J Surg Oncol 2009 100 559–62 10.1002/jso.21362 19653242 10 Wu YY Dai L Yang YB Yan WP Cheng H Fan MY Long-term survival and recurrence patterns in locally advanced esophageal squamous cell carcinoma patients with pathologic complete response after neoadjuvant chemotherapy followed by surgery Ann Surg Oncol 2024 31 5047–54 10.1245/s10434-023-14809-1 38172446 11 Luc G Gronnier C Lebreton G Brigand C Mabrut JY Bail JP Predictive factors of recurrence in patients with pathological complete response after esophagectomy following neoadjuvant chemoradiotherapy for esophageal cancer: A multicenter study Ann Surg Oncol 2015 22 Suppl 3, S1357–64 10.1245/s10434-015-4619-8 26014152 12 Boerner T Carr R Hsu M Tan KS Sigel C Tang L Prognostic value of circumferential radial margin involvement in esophagectomy for esophageal cancer: a case series Int J Surg 2023 109 3251–61 10.1097/js9.0000000000000609 37549056 PMC10651231 13 Kemper M Izbicki JR Reeh M Is there an optimal definition for a positive circumferential resection margin in locally advanced esophageal cancer Ann Surg Oncol 2021 28 8020–1 10.1245/s10434-021-10837-x 34618248 PMC8590995 14 Chao YK Chang Y Yeh CJ Chang HK Tseng CK Chuang WY Characterization of residual tumours at the primary site in patients with a near pathological complete response after neoadjuvant chemoradiotherapy for oesophageal cancer Br J Surg 2016 103 1874–9 10.1002/bjs.10293 27620361 15 Shapiro J ten Kate FJ van Hagen P Biermann K Wijnhoven BP van Lanschot JJ Residual esophageal cancer after neoadjuvant chemoradiotherapy frequently involves the mucosa and submucosa Ann Surg 2013 258 678 88; discussion 688-9 10.1097/SLA.0b013e3182a6191d 24096766 16 Tang H Jiang D Zhang S Zeng Z Tan L Hou Y Residual tumor characteristics of esophageal squamous cell carcinoma after neoadjuvant chemoradiotherapy J Thorac Cardiovasc Surg 2021 162 1632–41 10.1016/j.jtcvs.2020.09.042 33268125 17 Aminian A Al-Kurd A Wilson R Bena J Fayazzadeh H Singh T Association of bariatric surgery with major adverse liver and cardiovascular outcomes in patients with biopsy-proven nonalcoholic steatohepatitis JAMA 2021 326 2031–42 10.1001/jama.2021.19569 34762106 PMC8587225 18 Oppedijk V van der Gaast A van Lanschot JJ van Hagen P van Os R van Rij CM Patterns of recurrence after surgery alone versus preoperative chemoradiotherapy and surgery in the CROSS trials J Clin Oncol 2014 32 385–91 10.1200/jco.2013.51.2186 24419108 19 Yang Y Liu J Liu Z Zhu L Chen H Yu B Two-year outcomes of clinical N2–3 esophageal squamous cell carcinoma after neoadjuvant chemotherapy and immunotherapy from the phase 2 NICE study J Thorac Cardiovasc Surg 2024 167 838 847.e1 10.1016/j.jtcvs.2023.08.056 37696429 20 Xi M Yang Y Zhang L Yang H Merrell KW Hallemeier CL Multi-institutional analysis of recurrence and survival after neoadjuvant chemoradiotherapy of esophageal cancer: impact of histology on recurrence patterns and outcomes Ann Surg 2019 269 663–70 10.1097/sla.0000000000002670 29334555 21 Yokota T Kato K Hamamoto Y Tsubosa Y Ogawa H Ito Y A 3-year overall survival update from a phase 2 study of chemoselection with DCF and subsequent conversion surgery for locally advanced unresectable esophageal cancer Ann Surg Oncol 2020 27 460–7 10.1245/s10434-019-07654-8 31376034 22 Xie SH Yang LT Zhang H Tang ZL Lin ZW Chen Y Adjuvant therapy provides no additional recurrence-free benefit for esophageal squamous cell carcinoma patients after neoadjuvant chemoimmunotherapy and surgery: a multi-center propensity score match study Front Immunol 2024 15 1332492 10.3389/fimmu.2024.1332492 38375480 PMC10875462 23 Lee Y Samarasinghe Y Lee MH Thiru L Shargall Y Finley C Role of adjuvant therapy in esophageal cancer patients after neoadjuvant therapy and esophagectomy: A systematic review and meta-analysis Ann Surg 2022 275 91–8 10.1097/sla.0000000000005227 34596073 24 Raja S Rice TW Lu M Semple ME Blackstone EH Murthy SC Adjuvant therapy after neoadjuvant therapy for esophageal cancer: who needs it Ann Surg 2023 278 e240–9 10.1097/sla.0000000000005679 35997269 PMC10955553 25 Burt BM Groth SS Sada YH Farjah F Cornwell L Sugarbaker DJ Utility of adjuvant chemotherapy after neoadjuvant chemoradiation and esophagectomy for esophageal cancer Ann Surg 2017 266 297 304 10.1097/sla.0000000000001954 27501170 26 Zeng Y Su X Zhou T Jia J Liu J Yu W Propensity-matched study on locally advanced esophageal cancer: surgery versus post-operative radiotherapy Radiat Oncol 2024 19 130 10.1186/s13014-024-02528-0 39334405 PMC11428459 27 Zeng Y Li J Ye J Han G Luo W Wu C Postoperative tumor bed radiation versus T-shaped field radiation in the treatment of locally advanced thoracic esophageal squamous cell carcinoma: a phase IIb multicenter randomized controlled trial BMC Med 2024 22 522 10.1186/s12916-024-03727-y 39511550 PMC11545895 28 Feng J Wang L Yang X Chen Q Adjuvant immunotherapy after neoadjuvant immunochemotherapy and esophagectomy for esophageal squamous cell carcinoma: a real-world study Front Immunol 2024 15 1456193 10.3389/fimmu.2024.1456193 39742260 PMC11685212 29 Lin Y Liang HW Liu Y Pan XB Nivolumab adjuvant therapy for esophageal cancer: a review based on subgroup analysis of CheckMate 577 trial Front Immunol 2023 14 1264912 10.3389/fimmu.2023.1264912 37860010 PMC10582756 30 Qin J Xue L Hao A Guo X Jiang T Ni Y Neoadjuvant chemotherapy with or without camrelizumab in resectable esophageal squamous cell carcinoma: the randomized phase 3 ESCORT-NEO/NCCES01 trial Nat Med 2024 30 2549–57 10.1038/s41591-024-03064-w 38956195 PMC11405280 ",
  "metadata": {
    "Title of this paper": "Neoadjuvant chemotherapy with or without camrelizumab in resectable esophageal squamous cell carcinoma: the randomized phase 3 ESCORT-NEO/NCCES01 trial",
    "Journal it was published in:": "Frontiers in Oncology",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12491039/"
  }
}