{
  "title": "Paper_906",
  "abstract": "pmc Infect Agent Cancer Infect Agent Cancer 439 infagcan Infectious Agents and Cancer 1750-9378 BMC PMC12487313 PMC12487313.1 12487313 12487313 41034992 10.1186/s13027-025-00698-4 698 1 Research Prevalence and genotype distribution of HPV infection among women in Chengdu from 2019 to 2024: a retrospective single-center study Zhou Xiaolin Ma Jian He Liping Li Hepei 1579604049@qq.com https://ror.org/001bzc417 grid.459516.a Clinical Laboratory Department, Sichuan Jinxin Xinan Women & Children Hospital, 1 10 2025 2025 20 479098 68 8 5 2025 2 9 2025 01 10 2025 02 10 2025 03 10 2025 © The Author(s) 2025 2025 https://creativecommons.org/licenses/by-nc-nd/4.0/ Open Access http://creativecommons.org/licenses/by-nc-nd/4.0/ Objective Human papillomavirus (HPV) infection is closely associated with the occurrence and development of cervical cancer. This study comprehensively investigates HPV infection and subtype distribution among women in Chengdu from 2019 to 2024, aiming to provide scientific evidence for screening, prevention, and optimization of HPV vaccination strategies against cervical cancer and related diseases. Methods Cervical exfoliated cell specimens from 65,130 female patients attended Sichuan Jinxin Xinan Women & Children Hospital from 2019 to 2024 were collected and detected 26 HPV gene subtypes using gene chip technology. Results Among the 65,130 women included in the study, 13,463 were HPV positive, with an overall detection rate of 20.67%. The single infection rate was 14.80%, and the multiple infection rate was 5.88%; the infection rates for pure HR-HPV, pure LR-HPV, and mixed infections were 13.86%, 3.90%, and 2.92%, respectively. The HPV detection rate was highest in those aged ≤ 20 years (46.01%) and among those aged > 60 years (35.37%), showing a bimodal distribution across ages. The top five HR-HPV subtypes detected were HPV52, 58, 16, 51, and 39, with infection rates of 3.71%, 2.81%, 2.56%, 1.83%, and 1.64%, respectively. The top three LR-HPV subtypes were HPV54, 42, and 40, with detection rates of 1.85%, 0.99%, and 0.93%, respectively. From 2019 to 2024, HPV detection showed a U-shaped trend, with a significant decrease in HPV16 detection rate and an increase in HPV42. Among other subtypes co-infected with the top five HR-HPV subtypes, HPV52 and HPV58 accounted for the highest proportion. After 2023, co-infections with LR-HPV increased. Conclusion During 2019–2024, the HPV infection rate among women in Chengdu was high with an increase in detection rates after 2023. The co-infection patterns of HR-HPV are complex. Infection rates are highest among women aged ≤ 20 years and > 60 years. Priority should be given to young women for vaccination. HPV screening should be strengthened for women across different age groups. Developing vaccines targeting locally prevalent HPV subtypes is crucial for reducing infection rates and preventing cervical cancer and other HPV-related diseases. Keywords Human papillomavirus Prevalence Genotype Cervical cancer Women pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement no pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes issue-copyright-statement © BioMed Central Ltd., part of Springer Nature 2025 Introduction Human papillomavirus (HPV) is a type of small non-enveloped, double-stranded DNA viruses that tend to infect epithelial cells. Currently, over 200 types of HPV have been identified [ 1 2 3 4 6 7 8 9 10 13 14 16 Materials and methods Subjects We conduct a retrospective cross-sectional study at Sichuan Jinxin Xinan Women & Children Hospital from 2019 to 2024, a total of 65,130 women who underwent HPV testing at our hospital were enrolled in this study, including both gynecological outpatients (65.86%, 42894/65130) and women undergoing routine health examinations (34.14%, 22236/65130). The subjects ranged in age from 15 to 89 years, with a mean age of 33.74 ± 8.79 years. Participants were classified into six age groups: 476 women were aged ≤ 20 years old, 27,008 women were between 21 and 30 years old, 25,887 women were aged 31–40 years old, 7,298 women were aged 41–50 years old, 3,805 women were aged 51–60 years old, and 656 women were over 60 years old. This study constituted a retrospective and anonymized analysis of patient data, which was approved by the Medical Ethics Committee of Sichuan Jinxin Xinan Women & Children Hospital. Specimen collection and processing Cervical exfoliated cell specimens were collected by clinical gynecologists. Before sampling, excess secretions at the cervical or urethral opening were wiped off. A cervical brush was inserted at the cervical opening, gently pressed against the cervix, and rotated 3 to 5 times to collect an adequate sample of cervical epithelial cells. Samples were placed into a dedicated cell preservation tube (provided by Shenzhen Yaneng Bio-Tech Co., Ltd.) and sent for testing promptly. Samples were stored at room temperature and tested within 7 days. DNA extraction, PCR amplification, and HPV genotyping The HPV genotyping test kit and nucleic acid extraction kit (Shenzhen Ganglong Bio-Tech Co., Ltd.) were used to detect 26 HPV types, including 17 high-risk types: HPV16, 18, 31, 33, 35, 39, 45, 51, 52, 53, 56, 58, 59, 66, 67, 68, 73, and 9 low-risk types: HPV6, 11, 40, 42, 43, 44, 54, 55, 57. The procedure followed the kit instructions strictly. DNA extraction, PCR amplification, DNA hybridization, and color development steps were performed on cervical exfoliated cell specimens. PCR amplification used the SLAN-96 Automatic Medical PCR Amplifier (Shanghai Hongshi Medical Technology Co., Ltd.) with parameters: (1) 2 min at 50 °C; (2) 10 min at 95 °C; (3) 40 cycles of 30 s at 95 °C, 45 s at 52 °C, and 30 s at 65 °C; (4) 5 min incubation at 65 °C. The hybridization reaction results were interpreted using the HPV-GenoCam-9600 HPV Genotyping Detection System (Shenzhen Ganglong Bio-Tech Co., Ltd.). A positive HPV genotyping result (INS) is defined as a value of 11.0 or higher, while less than 11.0 is regarded as negative. A single infection is defined as one HPV subtype, while infections of two or more HPV subtypes are defined as multiple infections. Statistical analysis Data were organized using Excel software, and statistical analyses were performed using SPSS 27.0 software. Categorical data were statistically described using frequencies and percentages (%). Group comparisons utilized the χ² test or Fisher’s exact test. In cases where the chi-square test was significant, Cochran-Armitage trend testing was further performed. P Results Overall prevalence of HPV infection Among the 65,130 female samples included in the analysis, a total of 13,463 were HPV positive, resulting in a detection rate of 20.67% (13,463/65,130). Among the HPV-positive women, there were 9636 cases of single infection, with a detection rate of 14.80%, accounting for 71.57% (9636/13,463). Multiple infections totaled 3827 cases, with a detection rate of 5.88%, making up 28.43% (3827/13,463). Multiple infections primarily consisted of dual infections, with a detection rate of 4.01% (2613/65,130), accounting for 19.41% of the positive cases (2613/13,463) and 68.28% of the multiple infections (2613/3,827). Two women were found to be infected with up to eight HPV subtypes. Among the 13,463 HPV-positive women, there were 9025 cases of pure HR-HPV infection, 2537 cases of pure LR-HPV infection, and 1,901 cases of mixed HR-HPV and LR-HPV infection, with proportions of 67.04%, 18.84%, and 14.12%, respectively. HPV infections were predominantly single infections, particularly pure HR-HPV infections, as shown in Table 1  Table 1 Distribution of HPV infection in 65,130 women Infection type Positive cases Prevalence (%) Proportion (%) Single or lctions Single 9636 14.80 71.57 Double 2613 4.01 19.41 Triple 832 1.28 6.18 Quadruple 260 0.40 1.93 Quintuple 81 0.12 0.60 Sextuple 29 0.04 0.22 Septuple 10 0.02 0.07 Octuple 2 0.00 0.01 Simple or mixed infections HR-HPV Only 9025 13.86 67.04 LR-HPV Only 2537 3.90 18.84 HR-HPV/LR-HPV Mixed 1901 2.92 14.12 Total 13,463 20.67 100 Distribution of HR-HPV and LR-HPV in single and multiple infections In cases of single infection, pure HR-HPV infections predominated, accounting for 75.65% (7290/9636), while pure LR-HPV infections constituted 24.35% (2346/9636). As the number of infection types increased, the proportions of pure HR-HPV and pure LR-HPV infections declined, while mixed infections gradually increased. In dual infections, the rate of pure HR-HPV infections decreased to 52.51%, with mixed infections representing 40.68%. Notably, in infections of three or more types, there were no cases of pure LR-HPV infections. There were only 2 cases of eightfold infections, with one case each of pure HR-HPV and mixed infections, as illustrated in Fig. 1  Fig. 1 Distribution of HR-HPV and LR-HPV in different types of HPV infections Analysis of changes in HPV prevalence from 2019 to 2024 In this study, the detection rates of HPV positivity, single infection rates, dual infection rates, triple infection rates, rates of infections with three or more types, pure LR-HPV infection rates, and mixed infection rates exhibited a U-shaped trend over time. The HPV positivity rates from 2019 to 2024 were 23.41%, 19.32%, 19.27%, 19.92%, 20.14%, and 23.48%, respectively, with the lowest detection rate occurring in 2021 and the highest in 2024. Significant differences were observed in HPV positivity rates across different years (χ²=115.219, P 2  Table 2 Overview of human papillomavirus (HPV) infection rates across various Years[n(%)] Year Total cases Positive cases Single infection Double infection Triple infection Infection of more than three HR-HPV only LR-HPV only HR-HPV/LR-HPV mixed 2019 8395 1965(23.41) 1349(16.07) 428(5.10) 136(1.62) 52(0.62) 1325(15.78) 364(4.34) 276(3.29) 2020 11,403 2203(19.32) 1585(13.90) 418(3.66) 132(1.16) 68(0.58) 1504(13.19) 387(3.39) 312(2.74) 2021 12,098 2331(19.27) 1718(14.20) 431(3.56) 117(0.97) 65(0.54) 1636(13.52) 403(3.33) 292(2.41) 2022 12,990 2587(19.92) 1920(14.78) 458(3.53) 148(1.14) 61(0.47) 1774(13.66) 489(3.76) 324(2.49) 2023 11,280 2272(20.14) 1615(14.32) 434(3.85) 157(1.39) 66(0.59) 1458(12.93) 465(4.12) 349(3.09) 2024 8964 2105(23.48) 1449(16.17) 444(4.95) 142(1.58) 70(0.78) 1328(14.82) 429(4.79) 348(3.88) Total 65,130 13,463(20.67) 9636(14.80) 2613(4.01) 832(1.28) 382(0.59) 9025(13.86) 2537(3.90) 1901(2.92) χ 2 115.219 36.831 65.004 28.170 9.533 47.006 43.435 55.117  P <0.001 <0.001 <0.001 <0.001 0.09 <0.001 <0.001 <0.001 HPV prevalence by age group In the age group of ≤ 20 years, there were 476 cases, with an HPV positivity rate soaring to 46.01% (219/476). The rate of mixed infections stood at 14.71% (70/476), accounting for 31.96% of the HPV-positive cases (70/219). Moreover, the proportion of multiple infections was notably high at 53.42% (117/219). The > 60 years age group exhibited the second-highest HPV positivity rate at 35.37%, with multiple infections comprising 39.22% (91/232). Statistical analyses indicated significant differences in various infection rates: HPV positivity (χ²=406.645, P P P P P P P 3 2  Table 3 Prevalence of human papillomavirus (HPV) infection across different age groups [n (%)] Age group (years) Total cases Positive cases HR-HPV only LR-HPV only HR-HPV/LR-HPV mixed Single infection Dual infection Triple infection Infection of more than three ≤ 20 476 219(46.01) 112(23.53) 37(7.77) 70(14.71) 102(21.43) 62(13.03) 27(5.67) 28(5.88) 21–30 27,008 5822(21.56) 3926(14.54) 1015(3.76) 881(3.26) 3993(14.78) 1209(4.48) 419(1.55) 201(0.74) 31–40 25,887 4886(18.87) 3322(12.83) 974(3.76) 590(2.28) 3701(14.30) 864(3.34) 245(0.95) 76(0.29) 41–50 7298 1345(18.43) 884(12.11) 302(4.14) 159(2.18) 1037(14.21) 231(3.17) 54(0.74) 23(0.32) 51–60 3805 959(25.20) 622(16.35) 183(4.81) 154(4.05) 662(17.40) 194(5.10) 59(1.55) 44(1.16) >60 656 232(35.37) 159(24.24) 26(3.96) 47(7.16) 141(21.49) 53(8.08) 28(4.27) 10(1.52) χ² 406.645 168.087 31.349 354.942 67.508 199.548 176.966 318.87  P <0.001 <0.001 <0.001 <0.001 <0.001 <0.001 <0.001 <0.001  Fig. 2 Infection patterns of hpv types across different age groups. A B HPV genotype distribution from 2019 to 2024 Among the high-risk HPV (HR-HPV) genotypes, the top five detected were HPV52 (3.71%), HPV58 (2.81%), HPV16 (2.56%), HPV51 (1.83%), and HPV39 (1.64%). For low-risk HPV (LR-HPV), HPV54 was the most prevalent (1.85%), followed by HPV42 (0.99%) and HPV40 (0.93%). The infection rate of HPV16 showed a significant decline from 3.26% in 2019 to 2.32% in 2024, indicating a notable downward trend, with significant differences in infection rates across years (χ²=25.466, P P The infection rates of HPV52, HPV51, and HPV33 recorded their lowest levels in 2022, 2021, and 2022, respectively, exhibiting a U-shaped distribution over time. Each of these genotypes displayed significant differences in infection rates across the years (χ²=78.474, P P P Within the LR-HPV, the detection rate of HPV42 showed a significant upward trend (χ²=180.953, P P P P 4 3 4  Table 4 Annual distribution of high-risk and low-risk HPV subtypes (2019–2024) HPV Subtypes 2019 n 2020 n 2021 n 2022 n 2023 n 2024 n Total n χ²  P  HR-HPV subtypes 52 366 (4.36%) 382 (3.35%) 379 (3.13%) 400 (3.08%) 446 (3.95%) 441 (4.92%) 2414 (3.71%) 272.62 < 0.001 58 273 (3.25%) 290 (2.54%) 345 (2.85%) 363 (2.79%) 301 (2.67%) 261 (2.91%) 1833 (2.81%) 72.34 < 0.001 16 274 (3.26%) 299 (2.62%) 315 (2.60%) 312 (2.40%) 257 (2.28%) 208 (2.32%) 1665 (2.56%) 63.21 < 0.001 51 172 (2.05%) 200 (1.75%) 184 (1.52%) 226 (1.74%) 216 (1.91%) 195 (2.18%) 1193 (1.83%) 32.45 < 0.001 39 151 (1.80%) 194 (1.70%) 175 (1.45%) 208 (1.60%) 169 (1.50%) 169 (1.89%) 1066 (1.64%) 28.76 < 0.001 68 129 (1.54%) 140 (1.23%) 152 (1.26%) 165 (1.27%) 147 (1.30%) 122 (1.36%) 855 (1.31%) 18.93 0.002 53 109 (1.30%) 129 (1.13%) 132 (1.09%) 175 (1.35%) 148 (1.31%) 149 (1.66%) 842 (1.29%) 22.11 < 0.001 59 98 (1.17%) 112 (0.98%) 127 (1.05%) 129 (0.99%) 121 (1.08%) 122 (1.36%) 709 (1.09%) 12.05 0.034 66 86 (1.02%) 110 (0.96%) 127 (1.05%) 126 (0.97%) 97 (0.86%) 107 (1.19%) 653 (1.00%) 9.87 0.079 56 93 (1.11%) 110 (0.96%) 113 (0.93%) 131 (1.01%) 94 (0.83%) 110 (1.23%) 651 (1.00%) 10.32 0.067 18 95 (1.13%) 107 (0.94%) 105 (0.87%) 103 (0.79%) 99 (0.88%) 71 (0.79%) 580 (0.89%) 7.45 0.189 33 87 (1.04%) 92 (0.81%) 81 (0.67%) 84 (0.42%) 57 (0.51%) 64 (0.71%) 465 (0.71%) 15.21 0.009 67 60 (0.71%) 62 (0.54%) 72 (0.60%) 70 (0.54%) 49 (0.43%) 48 (0.54%) 361 (0.55%) 6.32 0.276 31 40 (0.48%) 60 (0.53%) 45 (0.37%) 55 (0.42%) 52 (0.46%) 51 (0.57%) 303 (0.47%) 4.98 0.418 35 38 (0.45%) 23 (0.20%) 45 (0.37%) 47 (0.36%) 32 (0.28%) 33 (0.37%) 218 (0.33%) 8.76 0.119 45 30 (0.36%) 21 (0.18%) 21 (0.17%) 34 (0.26%) 21 (0.19%) 17 (0.19%) 144 (0.22%) 5.12 0.401 73 17 (0.20%) 9 (0.08%) 20 (0.17%) 24 (0.18%) 15 (0.13%) 32 (0.36%) 117 (0.18%) 13.45 0.019  LR-HPV subtypes 54 183 (2.18%) 190 (1.67%) 198 (1.64%) 221 (1.70%) 216 (1.91%) 197 (2.20%) 1205 (1.85%) 29.87 < 0.001 42 55 (0.66%) 65 (0.57%) 79 (0.65%) 92 (0.71%) 176 (1.56%) 177 (1.97%) 644 (0.99%) 156.32 < 0.001 40 90 (1.07%) 102 (0.89%) 89 (0.74%) 117 (0.90%) 105 (0.93%) 100 (1.12%) 603 (0.93%) 11.23 0.047 44 75 (0.89%) 90 (0.79%) 108 (0.89%) 117 (0.90%) 115 (1.02%) 85 (0.95%) 590 (0.91%) 9.56 0.089 55 94 (1.12%) 102 (0.89%) 91 (0.75%) 105 (0.81%) 83 (0.74%) 110 (1.23%) 585 (0.90%) 14.78 0.011 6 94 (1.12%) 83 (0.73%) 96 (0.79%) 120 (0.92%) 96 (0.85%) 77 (0.86%) 566 (0.87%) 8.34 0.138 43 91 (1.08%) 97 (0.85%) 77 (0.64%) 86 (0.66%) 103 (0.91%) 111 (1.24%) 565 (0.87%) 18.95 0.002 11 42 (0.50%) 45 (0.39%) 38 (0.31%) 46 (0.35%) 43 (0.38%) 19 (0.21%) 233 (0.36%) 3.21 0.667 57 1 (0.01%) 0 (0.00%) 1 (0.01%) 1 (0.01%) 0 (0.00%) 0 (0.00%) 3 (0.00%) - - The “-” indicates that there is no value for Fisher’s exact test  Fig. 3 Prevalence of HR-HPV and LR-HPV Genotypes in HPV Infections of 65,130 Women. A P B  Fig. 4 Changes in the prevalence of the top five HR-HPV genotypes and the top five LR-HPV genotypes from 2019 to 2024. A B HPV subtype infection patterns by age group Among the high-risk HPV (HR-HPV) genotypes, the following were identified: HPV52, HPV58, HPV16, HPV51, HPV39, HPV68, HPV53, HPV59, HPV56, HPV66, HPV18, HPV33, HPV67, HPV31, and HPV73, for the low-risk HPV (LR-HPV) genotypes, HPV40, HPV44, HPV55, and HPV11 showed a bimodal trend associated with age. In the ≤ 20 years age group, the most frequently detected HR-HPV genotype was HPV16, with an infection rate of 7.98% (38/476), followed by HPV58, HPV52, HPV59, and HPV51. In contrast, the primary HR-HPV subtype in the other age groups was HPV52, with HPV58 and HPV16 following closely. The LR-HPV subtype with the highest detected rate in the ≤ 20 years age group was HPV6, which had a prevalence of 5.46% (26/476), while the > 60 years age group exhibited HPV55 as the most prevalent LR-HPV genotype. Among the remaining age groups, HPV54 was identified as the predominant LR-HPV subtype (Fig. 5  Fig. 5 Distribution of HPV subtype infections across different age groups. A B Changes in co-infection combinations with the top 5 h-HPV genotypes from 2019 to 2024 Among the subtypes co-infected with the top five HR-HPV genotypes, HR-HPV represented nearly 70% of the cases. Common co-infections included HPV16, HPV52, HPV58, HPV51, and HPV39, with HPV52 and HPV58 being the most likely to co-infect with other HR-HPV subtypes. Notably, the prevalence of LR-HPV genotypes significantly increased from 2023 to 2024, primarily involving HPV54 and HPV42. Among the co-infected subtypes with HPV39, HPV51, HPV52, and HPV58, HPV54 entered the top five lists. In 2023, HPV54 became the most prevalent subtype co-infected with HPV51, and the low-risk HPV type HPV42 made its debut in the top five rankings. In 2019, HPV16 predominantly co-infected with HPV58, HPV52, HPV33, and HPV68. By 2024, there was a marked increase in co-infection cases involving HPV16 with LR-HPV types HPV42 and HPV54. Additionally, in 2024, HPV56 (a high-risk HPV) entered the fifth position among the subtypes co-infected with HPV58 for the first time (Fig. 6  Fig. 6 Genotype combinations co-infected with the top 5 HR-HPV genotypes from 2019 to 2024 Discussion Genital HPV infection is the most common sexually transmitted disease [ 17 18 10 19 20 19 21 4 22 17 23 In this study, the HPV positivity rate among 65,130 women in Chengdu was 20.67% (13,463/65,130). This rate is higher than in Suzhou (10.2%) [ 24 13 25 26 27 23 28 29 30 31 The HPV infection rate in Chengdu showed significant changes from 2019 to 2024, following a typical U-shaped fluctuation pattern. The baseline infection rate was 23.41% in 2019 and fell to 19.27% by 2021. This trend matches earlier research [ 14 16 14 16 23 In this study, HPV infections were mainly single infections (14.80%, 9636/65,130) and single high-risk (HR) HPV infections (13.86%, 9025/65,130). These accounted for 71.57% and 67.04% of the positive cases, respectively. Multiple infections were mainly double infections, making up 68.28% of multi-type infections. In single infections, HR-HPV infection predominates (accounting for 75.65%). As the number of infection types increases, mixed infections gradually become dominant. In infections involving three or more types, no pure LR-HPV infection is detected, indicating that HR-HPV demonstrates a more significant subtype advantage in infections, and LR-HPV infections are difficult to exist independently in multiple infections. There may be a potential synergistic effect between HR-HPV and LR-HPV [ 23 n 32 33 34 5 35 The HPV positivity rates and the rates of different types of HPV infections among different age groups showed statistically significant differences. In Chengdu, the HPV positivity rate, single HR-HPV infection rate, mixed infection rate, single infection rate, double infection rate, triple infection rate, and rates of infections with three or more types all follow a bimodal distribution pattern across different age groups. There was a peak positivity in the group aged ≤ 20 years. Notably, among HPV-positive females in this age group, the proportion of mixed and multiple infections was higher than in other age groups. The proportion of multiple infections reached 53.42% (117/219). The HPV positivity rate, single infection rate, double infection rate, triple infection rate, single HR-HPV infection rate, and mixed infection rate were all lowest in the 41 to 50 age group. A second peak in positivity was observed in the > 60 age group, consistent with reports from other regions [ 25 26 28 29 29 36 27 35 37 38 23 29 36 Globally, the most common high-risk (HR) HPV genotypes are HPV 16, 18, 59, 45, 31, 33, 52, 58, 35, 39, 51, 56, and 53, while the most common low-risk (LR) HPV genotypes are HPV 6 and 11 [ 17 32 27 29 39 In this study, among the 26 HPV genotypes detected, the top five HR-HPV genotypes in terms of detection rates were HPV 52 (3.71%), HPV 58 (2.81%), HPV 16 (2.56%), HPV 51 (1.83%), and HPV 39 (1.64%). The top three LR-HPV genotypes were HPV 54 (1.85%), HPV 42 (0.99%), and HPV 40 (0.93%). The detection rates of HPV genotypes in this study also differed from reports in various regions of China. HPV 52 had the highest detection rate among HR-HPV in this study, consistent with reports from Suzhou [ 24 29 13 28 25 26 23 27 30 40 25 26 28 For females aged ≤ 20, HPV 16 was the highest detected HR-HPV type at 7.98%, while HPV 52 was the predominant type in other age groups. The detection of LR-HPV types also showed variation across age groups; HPV 6 was the most common LR-HPV type among females aged ≤ 20 (5.46%), suggesting a higher prevalence of genital warts in this age group. For females > 60, HPV 55 (2.13%) dominated, while HPV 54 was the main type in other age groups. This indicates variations not only in the predominant HPV subtypes across different regions but also in the major detected subtypes among different age groups. The infection rates of different HPV subtypes in this research exhibited varying trends. For HR-HPV types, the infection rate of HPV 16 significantly decreased from 2019 to 2024 (χ²=25.466, P P P P China’s initiation of HPV vaccination has lagged behind that of developed countries. Since 2016, preventive HPV vaccines have entered the Chinese market, and currently, three bivalent vaccines, one quadrivalent vaccine, and one nonavalent vaccine have been launched [ 41 18 42 18 43 44 17 45 Increasing the coverage of the nonavalent vaccine and establishing large-scale population screening are essential, while carefully considering age stratification and regional epidemic characteristics, is crucial. It is also essential to focus on the development of preventive HPV vaccines that meet the needs of the local population [ 18 In this study, the subtypes co-infected with the top five HR-HPV genotypes were predominantly HR-HPV as well, specifically HPV 52, 58, 16, 51, and 39, which frequently co-occurred. HPV 52 and HPV 58 were identified as the subtypes most commonly co-infected with other HR-HPVs. There were significant changes in the co-infection subtypes from 2019 to 2024. In 2019, HPV 16 was primarily co-infected with HPV 58, 52, 33, and 68. By 2024, the number of co-infections with HPV 16 and LR-HPV(HPV 42 and 54) significantly increased, suggesting an increase in cases of genital warts patients co-infected with HPV 16, which may elevate the risk of precancerous lesions. Additionally, in 2024, among the subtypes co-infected with HPV 58, HPV 56 rose to the fifth position, indicating that the complexity of co-infections has increased, potentially reflecting the risk associated with new high-risk genotype combinations. Overall, the prevalence of low-risk HPV types significantly increased between 2023 and 2024, primarily involving HPV 54 and HPV 42. Notably, in 2023, HPV 54 was ranked first among the subtypes co-infected with HPV 51, and the low-risk HPV type 42 also entered the top five for the first time that year. The differences between infection patterns among various subtypes and the changes in co-infection combinations provide a more comprehensive understanding of local HPV infection characteristics. This highlights the need to consider the specific infection traits of different subtypes in HPV infection prevention and control efforts. Such insights are crucial for developing targeted prevention strategies, including vaccine development and screening program formulation. This study has certain limitations. First, it is based on a survey conducted among women who visited a single hospital’s gynecology department and those who underwent self-examinations, while our findings provide valuable reference data for HPV prevention and control in Chengdu, caution should be exercised when generalizing these results to the broader population due to the single-center design. This study was unable to further investigate the correlation between HPV genotypes and the severity of cervical lesions due to incomplete collection of cervical cell or pathological test data from HPV-positive women and not be able to perform statistical analysis. Additionally, information regarding vaccination status for all statistical subjects could not be obtained, and assessments of related potential risk factors are lacking. Moreover, due to the retrospective nature of this hospital-based study, we were unable to collect key behavioral and socioeconomic variables known to influence HPV risk, including sexual behavior patterns, socioeconomic status, and HIV co-infection status. This limitation is inherent to the study design and prevents us from examining potential drivers of the observed infection disparities. However, this study provides a comprehensive analysis of the prevalence of HPV in the region before and after the outbreak of the novel coronavirus over a six-year period. It offers scientific evidence to elucidate the HPV infection spectrum in Chengdu and is expected to play a key role in local HPV vaccination planning, optimizing cervical cancer screening programs, and adjusting public health policies, ultimately enhancing the health security level for women in Chengdu. Conclusions In summary, the study found a high HPV detection rate among women in Chengdu, with a U-shaped trend observed in HPV positivity rates and the rates of other HPV infection types (excluding pure HR-HPV infections) from 2019 to 2024, indicating a decline followed by an increase. The main types of infections were single infections and pure HR-HPV infections. The top five HR-HPV genotypes detected were HPV 52, 58, 16, 51, and 39. Aside from the pure LR-HPV infection rate, the infection rates of other HPV types displayed a U-shaped bimodal distribution pattern with age. The infection rate of HPV 16 showed a decreasing trend, while the infection rate of HPV 42 significantly increased, correlating with a marked increase in the number of LR-HPV genotypes co-infected with HR-HPV, leading to diversified co-infection patterns. Enhancing health education efforts, vigorously developing, introducing, promoting, and vaccinating HPV vaccines, as well as raising awareness of HPV screening among women, can effectively reduce HPV infection rates and prevent the occurrence of cervical cancer. Abbreviations HPV Human papillomavirus LR-HPV Low-risk human papillomavirus HR-HPV High-risk human papillomavirus Publisher’s note Springer Nature remains neutral with regard to jurisdictional claims in published maps and institutional affiliations. Acknowledgements None. Author contributions XL.Z: Conducted study design, data collection, statistical analysis, data analysis, prepared original tables, and drafted/revised the manuscript; HP.L: Performed data analysis, created tables and figures, and edited/reviewed the manuscript for submission; LP.H: Carried out experimental testing and data collection; J.M: Reviewed and supervised the entire manuscript development. Funding The authors declare that no funds, grants, or other support were received for the conduct of this study or the preparation of this manuscript. Data availability The datasets utilized and/or analyzed in this study can be obtained from the corresponding author upon reasonable request. Declarations Ethics approval and consent to participate This study followed the ethical guidelines of the Declaration of Helsinki and was approved by the Medical Ethics Committee of Sichuan Jinxin Xinan Women & Children Hospital (202521). Consent for publication Not applicable. Competing interests The authors declare no competing interests. References 1. Burd EM Human papillomavirus laboratory testing: the changing paradigm Clin Microbiol Rev 2016 29 2 291 319 10.1128/CMR.00013-15 26912568 PMC4786885 Burd EM. Human papillomavirus laboratory testing: the changing paradigm. Clin Microbiol Rev. 2016;29(2):291–319. 26912568 10.1128/CMR.00013-15 PMC4786885 2. Brianti P De Flammineis E Mercuri SR Review of HPV-related diseases and cancers New Microbiol 2017 40 2 80 5 28368072 Brianti P, De Flammineis E, Mercuri SR. Review of HPV-related diseases and cancers. New Microbiol. 2017;40(2):80–5. 28368072 3. Cogliano V Baan R Straif K Carcinogenicity of human papillomaviruses Lancet Oncol 2005 6 4 204 10.1016/S1470-2045(05)70086-3 15830458 Cogliano V, Baan R, Straif K, et al. Carcinogenicity of human papillomaviruses. Lancet Oncol. 2005;6(4):204. 15830458 10.1016/s1470-2045(05)70086-3 4. World Health Organization. WHO guideline for screening and treatment of cervical pre cancer lesions for cervical cancer prevention, second edition. 2021. https://www.who.int/publications/i/item/9789240030824 34314129 5. Wei F Georges D Man I Baussano I Clifford GM Causal attribution of human papillomavirus genotypes to invasive cervical cancer worldwide: a systematic analysis of the global literature Lancet 2024 404 10451 435 44 10.1016/S0140-6736(24)01097-3 39097395 Wei F, Georges D, Man I, Baussano I, Clifford GM. Causal attribution of human papillomavirus genotypes to invasive cervical cancer worldwide: a systematic analysis of the global literature. Lancet. 2024;404(10451):435–44. 39097395 10.1016/S0140-6736(24)01097-3 6. Williamson AL. Recent developments in human papillomavirus (HPV) vaccinology. Viruses. 2023;15(7):1440. 10.3390/v15071440 PMC10384715 37515128 7. Sung H Ferlay J Siegel RL Global cancer statistics 2020: GLOBOCAN estimates of incidence and mortality worldwide for 36 cancers in 185 countries CA Cancer J Clin 2021 71 3 209 49 33538338 10.3322/caac.21660 Sung H, Ferlay J, Siegel RL, et al. Global cancer statistics 2020: GLOBOCAN estimates of incidence and mortality worldwide for 36 cancers in 185 countries. CA Cancer J Clin. 2021;71(3):209–49. 33538338 10.3322/caac.21660 8. Cao W Chen HD Yu YW Li N Chen WQ Changing profiles of cancer burden worldwide and in china: a secondary analysis of the global cancer statistics 2020 Chin Med J (Engl) 2021 134 7 783 91 10.1097/CM9.0000000000001474 33734139 PMC8104205 Cao W, Chen HD, Yu YW, Li N, Chen WQ. Changing profiles of cancer burden worldwide and in china: a secondary analysis of the global cancer statistics 2020. Chin Med J (Engl). 2021;134(7):783–91. 33734139 10.1097/CM9.0000000000001474 PMC8104205 9. World Health Organization. Global strategy to accelerate the elimination of cervical cancer as a public health problem. 2020. https://www.who.int/publications/i/item/9789240014107 10. Human Papillomavirus and Related Diseases Report. ICO/IARC information centre on HPV and cancer (HPV information centre); 2023. https://hpvcentre.net/statistics/reports/XWX.pdf 11. Cenci M Rossi F Pisani T Detection of 14 High-risk human papillomavirus (HPV) genotypes within the Italian cervical cancer screening Vivo 2023 37 5 2161 5 10.21873/invivo.13314 PMC10500497 37652482 Cenci M, Rossi F, Pisani T. Detection of 14 High-risk human papillomavirus (HPV) genotypes within the Italian cervical cancer screening. Vivo. 2023;37(5):2161–5. 10.21873/invivo.13314 PMC10500497 37652482 12. Gupta S Purwar S Gupta P Burden and associated genotype patterns of High-Risk human papilloma virus infection and cervical cytology abnormalities among women in central India Infect Dis Obstet Gynecol 2022 2022 3932110 10.1155/2022/3932110 35634175 PMC9132658 Gupta S, Purwar S, Gupta P, et al. Burden and associated genotype patterns of High-Risk human papilloma virus infection and cervical cytology abnormalities among women in central India. Infect Dis Obstet Gynecol. 2022;2022:3932110. 35634175 10.1155/2022/3932110 PMC9132658 13. Mai Q Yang X Cheng H Wu G Wu Z Prevalence and genotype distribution of human papillomavirus among women with cervical lesions in Shenzhen city, China Hum Vaccin Immunother 2021 17 4 965 71 10.1080/21645515.2020.1805993 32961080 PMC8018457 Mai Q, Yang X, Cheng H, Wu G, Wu Z. Prevalence and genotype distribution of human papillomavirus among women with cervical lesions in Shenzhen city, China. Hum Vaccin Immunother. 2021;17(4):965–71. 32961080 10.1080/21645515.2020.1805993 PMC8018457 14. Ma Y Xia X Zheng W Dai Y Zhuang X HPV prevalence and genotype distribution among women in Eastern China during the Covid-19 pandemic Hum Vaccin Immunother 2023 19 1 2212571 10.1080/21645515.2023.2212571 37226673 PMC10294764 Ma Y, Xia X, Zheng W, Dai Y, Zhuang X. HPV prevalence and genotype distribution among women in Eastern China during the Covid-19 pandemic. Hum Vaccin Immunother. 2023;19(1):2212571. 37226673 10.1080/21645515.2023.2212571 PMC10294764 15. Tao J Napoleon SC Maynard MA Impact of the COVID-19 pandemic on sexually transmitted infection clinic visits Sex Transm Dis 2021 48 1 e5 7 10.1097/OLQ.0000000000001306 33181578 PMC7736141 Tao J, Napoleon SC, Maynard MA, et al. Impact of the COVID-19 pandemic on sexually transmitted infection clinic visits. Sex Transm Dis. 2021;48(1):e5–7. 33181578 10.1097/OLQ.0000000000001306 PMC7736141 16. Wang J Zhao K Xia J Prevalence and genotype distribution of HPV infection from Hangzhou of Zhejiang Province pre- and during COVID-19 pandemic Front Public Health 2024 12 1357311 10.3389/fpubh.2024.1357311 38873306 PMC11169856 Wang J, Zhao K, Xia J, et al. Prevalence and genotype distribution of HPV infection from Hangzhou of Zhejiang Province pre- and during COVID-19 pandemic. Front Public Health. 2024;12:1357311. 38873306 10.3389/fpubh.2024.1357311 PMC11169856 17. Kombe Kombe AJ Li B Zahid A Epidemiology and burden of human papillomavirus and related diseases, molecular pathogenesis, and vaccine evaluation Front Public Health 2020 8 552028 10.3389/fpubh.2020.552028 33553082 PMC7855977 Kombe Kombe AJ, Li B, Zahid A, et al. Epidemiology and burden of human papillomavirus and related diseases, molecular pathogenesis, and vaccine evaluation. Front Public Health. 2020;8:552028. 33553082 10.3389/fpubh.2020.552028 PMC7855977 18. Oyouni AAA Human papillomavirus in cancer: infection, disease transmission, and progress in vaccines J Infect Public Health 2023 16 4 626 31 10.1016/j.jiph.2023.02.014 36868166 Oyouni AAA. Human papillomavirus in cancer: infection, disease transmission, and progress in vaccines. J Infect Public Health. 2023;16(4):626–31. 36868166 10.1016/j.jiph.2023.02.014 19. Mlynarczyk-Bonikowska B, Rudnicka L. HPV Infections-classification, pathogenesis, and potential new therapies. Int J Mol Sci. 2024;25(14):7616. 10.3390/ijms25147616 PMC11277246 39062859 20. Markowitz LE Unger ER Human papillomavirus vaccination N Engl J Med 2023 388 19 1790 8 10.1056/NEJMcp2108502 37163625 PMC11567082 Markowitz LE, Unger ER. Human papillomavirus vaccination. N Engl J Med. 2023;388(19):1790–8. 37163625 10.1056/NEJMcp2108502 PMC11567082 21. Fontham ETH Wolf AMD Church TR Cervical cancer screening for individuals at average risk: 2020 guideline update from the American cancer society CA Cancer J Clin 2020 70 5 321 46 32729638 10.3322/caac.21628 Fontham ETH, Wolf AMD, Church TR, et al. Cervical cancer screening for individuals at average risk: 2020 guideline update from the American cancer society. CA Cancer J Clin. 2020;70(5):321–46. 32729638 10.3322/caac.21628 22. Golia D, D’Amato A, Laganà AS, D’Oria O, Bogani G, Di Donato V, Muzii L, Giannini A. State of the Art on HPV-related cervical lesions. Italian J Gynecol Obstet. 2024;36(01):135-137. 23. Ma X Wu C Wu T Yu X Song L Genotypic analysis of human papillomavirus in cervical exfoliated cells from women in Zigong Virol J 2025 22 1 40 10.1186/s12985-025-02652-7 39962540 PMC11831773 Ma X, Wu C, Wu T, Yu X, Song L. Genotypic analysis of human papillomavirus in cervical exfoliated cells from women in Zigong. Virol J. 2025;22(1):40. 39962540 10.1186/s12985-025-02652-7 PMC11831773 24. Wang T Luan L Deng J Prevalence and human papillomavirus (HPV) genotype distribution in suzhou, China Hum Vaccin Immunother 2023 19 2 2241309 10.1080/21645515.2023.2241309 37519009 PMC10392751 Wang T, Luan L, Deng J, et al. Prevalence and human papillomavirus (HPV) genotype distribution in suzhou, China. Hum Vaccin Immunother. 2023;19(2):2241309. 37519009 10.1080/21645515.2023.2241309 PMC10392751 25. Qiu B Jiang N Jiang J Mao X Wang X The prevalence and genotype distribution of high-risk human papillomaviruses among women in xianning, China Virol J 2024 21 1 140 10.1186/s12985-024-02413-y 38890675 PMC11186159 Qiu B, Jiang N, Jiang J, Mao X, Wang X. The prevalence and genotype distribution of high-risk human papillomaviruses among women in xianning, China. Virol J. 2024;21(1):140. 38890675 10.1186/s12985-024-02413-y PMC11186159 26. Wei L Ma L Qin L Huang Z The prevalence and genotype distribution of human papillomavirus among women in guangxi, Southern China Infect Agent Cancer 2022 17 1 19 10.1186/s13027-022-00431-5 35449004 PMC9022619 Wei L, Ma L, Qin L, Huang Z. The prevalence and genotype distribution of human papillomavirus among women in guangxi, Southern China. Infect Agent Cancer. 2022;17(1):19. 35449004 10.1186/s13027-022-00431-5 PMC9022619 27. Chen G Zheng P Gao L Zhao J Wang Y Qin W Prevalence and genotype distribution of human papillomavirus in women with cervical cancer or cervical intraepithelial neoplasia in Henan province, central China J Med Virol 2020 92 12 3743 9 10.1002/jmv.25670 31930525 Chen G, Zheng P, Gao L, Zhao J, Wang Y, Qin W. Prevalence and genotype distribution of human papillomavirus in women with cervical cancer or cervical intraepithelial neoplasia in Henan province, central China. J Med Virol. 2020;92(12):3743–9. 31930525 10.1002/jmv.25670 28. Yang X Li Y Tang Y Cervical HPV infection in guangzhou, china: an epidemiological study of 198,111 women from 2015 to 2021 Emerg Microbes Infect 2023 12 1 e2176009 10.1080/22221751.2023.2176009 36744409 PMC9936994 Yang X, Li Y, Tang Y, et al. Cervical HPV infection in guangzhou, china: an epidemiological study of 198,111 women from 2015 to 2021. Emerg Microbes Infect. 2023;12(1):e2176009. 36744409 10.1080/22221751.2023.2176009 PMC9936994 29. Yan X Shen L Xiao Y Wang Q Li F Qian Y Prevalence, characteristics, and distribution of HPV genotypes in women from Zhejiang province, 2016–2020 Virol J 2021 18 1 208 10.1186/s12985-021-01676-z 34670576 PMC8527678 Yan X, Shen L, Xiao Y, Wang Q, Li F, Qian Y. Prevalence, characteristics, and distribution of HPV genotypes in women from Zhejiang province, 2016–2020. Virol J. 2021;18(1):208. 34670576 10.1186/s12985-021-01676-z PMC8527678 30. Wang X Han S Li X Wang X Wang S Ma L Prevalence and distribution of human papillomavirus (HPV) in Luoyang City of Henan Province during 2015–2021 and the genetic variability of HPV16 and 52 Virol J 2022 19 1 37 10.1186/s12985-022-01759-5 35246180 PMC8896270 Wang X, Han S, Li X, Wang X, Wang S, Ma L. Prevalence and distribution of human papillomavirus (HPV) in Luoyang City of Henan Province during 2015–2021 and the genetic variability of HPV16 and 52. Virol J. 2022;19(1):37. 35246180 10.1186/s12985-022-01759-5 PMC8896270 31. Li K Li Q Song L Wang D Yin R The distribution and prevalence of human papillomavirus in women in Mainland China Cancer 2019 125 7 1030 7 10.1002/cncr.32003 30748006 Li K, Li Q, Song L, Wang D, Yin R. The distribution and prevalence of human papillomavirus in women in Mainland China. Cancer. 2019;125(7):1030–7. 30748006 10.1002/cncr.32003 32. Kim M, Park NJ, Jeong JY, Park JY. Multiple human papilloma virus (HPV) infections are associated with HSIL and persistent HPV infection status in Korean patients. Viruses. 2021;13(7):1342. 10.3390/v13071342 PMC8310096 34372548 33. Tang Y Zheng L Yang S Li B Su H Zhang LP Epidemiology and genotype distribution of human papillomavirus (HPV) in Southwest china: a cross-sectional five years study in non-vaccinated women Virol J 2017 14 1 84 10.1186/s12985-017-0751-3 28431558 PMC5401384 Tang Y, Zheng L, Yang S, Li B, Su H, Zhang LP. Epidemiology and genotype distribution of human papillomavirus (HPV) in Southwest china: a cross-sectional five years study in non-vaccinated women. Virol J. 2017;14(1):84. 28431558 10.1186/s12985-017-0751-3 PMC5401384 34. Li X Xiang F Dai J Prevalence of cervicovaginal human papillomavirus infection and genotype distribution in shanghai, China Virol J 2022 19 1 146 10.1186/s12985-022-01879-y 36096810 PMC9465878 Li X, Xiang F, Dai J, et al. Prevalence of cervicovaginal human papillomavirus infection and genotype distribution in shanghai, China. Virol J. 2022;19(1):146. 36096810 10.1186/s12985-022-01879-y PMC9465878 35. Crosbie EJ Einstein MH Franceschi S Kitchener HC Human papillomavirus and cervical cancer Lancet 2013 382 9895 889 99 10.1016/S0140-6736(13)60022-7 23618600 Crosbie EJ, Einstein MH, Franceschi S, Kitchener HC. Human papillomavirus and cervical cancer. Lancet. 2013;382(9895):889–99. 23618600 10.1016/S0140-6736(13)60022-7 36. Zhang J Zha T Wang X He W Prevalence and genotype distribution of HPV infections among women in chengdu,china Virol J 2024 21 1 52 10.1186/s12985-024-02317-x 38429823 PMC10908056 Zhang J, Zha T, Wang X, He W. Prevalence and genotype distribution of HPV infections among women in chengdu,china. Virol J. 2024;21(1):52. 38429823 10.1186/s12985-024-02317-x PMC10908056 37. Shen Y Xia J Li H Xu Y Xu S Human papillomavirus infection rate, distribution characteristics, and risk of age in pre- and postmenopausal women BMC Womens Health 2021 21 1 80 10.1186/s12905-021-01217-4 33632179 PMC7905912 Shen Y, Xia J, Li H, Xu Y, Xu S. Human papillomavirus infection rate, distribution characteristics, and risk of age in pre- and postmenopausal women. BMC Womens Health. 2021;21(1):80. 33632179 10.1186/s12905-021-01217-4 PMC7905912 38. Bhatla N Aoki D Sharma DN Sankaranarayanan R Cancer of the cervix uteri: 2021 update Int J Gynaecol Obstet 2021 155 Suppl 1Suppl 1 28 44 10.1002/ijgo.13865 34669203 PMC9298213 Bhatla N, Aoki D, Sharma DN, Sankaranarayanan R. Cancer of the cervix uteri: 2021 update. Int J Gynaecol Obstet. 2021;155(Suppl 1Suppl 1):28–44. 34669203 10.1002/ijgo.13865 PMC9298213 39. Zu Y Ou Z Wu D Genetic characteristics of human papillomavirus type 16, 18, 52 and 58 in Southern China Genomics 2021 113 6 3895 906 10.1016/j.ygeno.2021.09.006 34555497 Zu Y, Ou Z, Wu D, et al. Genetic characteristics of human papillomavirus type 16, 18, 52 and 58 in Southern China. Genomics. 2021;113(6):3895–906. 34555497 10.1016/j.ygeno.2021.09.006 40. Wang J Tang D Wang K HPV genotype prevalence and distribution during 2009–2018 in xinjiang, china: baseline surveys prior to mass HPV vaccination BMC Womens Health 2019 19 1 90 10.1186/s12905-019-0785-3 31286939 PMC6615222 Wang J, Tang D, Wang K, et al. HPV genotype prevalence and distribution during 2009–2018 in xinjiang, china: baseline surveys prior to mass HPV vaccination. BMC Womens Health. 2019;19(1):90. 31286939 10.1186/s12905-019-0785-3 PMC6615222 41. Su Y Zheng T Bi Z Pattern of multiple human papillomavirus infection and type competition: an analysis in healthy Chinese women aged 18–45 years Hum Vaccin Immunother 2024 20 1 2334474 10.1080/21645515.2024.2334474 38619081 PMC11020552 Su Y, Zheng T, Bi Z, et al. Pattern of multiple human papillomavirus infection and type competition: an analysis in healthy Chinese women aged 18–45 years. Hum Vaccin Immunother. 2024;20(1):2334474. 38619081 10.1080/21645515.2024.2334474 PMC11020552 42. Wang R Pan W Jin L Human papillomavirus vaccine against cervical cancer: opportunity and challenge Cancer Lett 2020 471 88 102 10.1016/j.canlet.2019.11.039 31812696 Wang R, Pan W, Jin L, et al. Human papillomavirus vaccine against cervical cancer: opportunity and challenge. Cancer Lett. 2020;471:88–102. 31812696 10.1016/j.canlet.2019.11.039 43. Clark M Jembere N Kupets R The impact of a universal human papilloma virus (HPV) vaccination program on lower genital tract dysplasia and genital warts Prev Med 2021 150 106641 10.1016/j.ypmed.2021.106641 34048822 Clark M, Jembere N, Kupets R. The impact of a universal human papilloma virus (HPV) vaccination program on lower genital tract dysplasia and genital warts. Prev Med. 2021;150:106641. 34048822 10.1016/j.ypmed.2021.106641 44. Zhao XL Hu SY Hu JW Tackling barriers to scale up human papillomavirus vaccination in china: progress and the way forward Infect Dis Poverty 2023 12 1 86 10.1186/s40249-023-01136-6 37735709 PMC10512493 Zhao XL, Hu SY, Hu JW, et al. Tackling barriers to scale up human papillomavirus vaccination in china: progress and the way forward. Infect Dis Poverty. 2023;12(1):86. 37735709 10.1186/s40249-023-01136-6 PMC10512493 45. Wang M Liang H Yan Y Distribution of HPV types among women with HPV-related diseases and exploration of lineages and variants of HPV 52 and 58 among HPV-infected patients in china: A systematic literature review Hum Vaccin Immunother 2024 20 1 2343192 10.1080/21645515.2024.2343192 38745409 PMC11789740 Wang M, Liang H, Yan Y, et al. Distribution of HPV types among women with HPV-related diseases and exploration of lineages and variants of HPV 52 and 58 among HPV-infected patients in china: A systematic literature review. Hum Vaccin Immunother. 2024;20(1):2343192. 38745409 10.1080/21645515.2024.2343192 PMC11789740 ",
  "metadata": {
    "Title of this paper": "Distribution of HPV types among women with HPV-related diseases and exploration of lineages and variants of HPV 52 and 58 among HPV-infected patients in china: A systematic literature review",
    "Journal it was published in:": "Infectious Agents and Cancer",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12487313/"
  }
}