{
  "title": "Paper_83",
  "abstract": "pmc Front Health Serv Front Health Serv 4400 frhs Front. Health Serv. Frontiers in Health Services 2813-0146 Frontiers Media SA PMC12491013 PMC12491013.1 12491013 12491013 10.3389/frhs.2025.1624733 1 Health Services Systematic Review An analysis of National Cancer Institute-funded scale-up research Vinson Cynthia  1 Villalobos Aubrey  1 Correa-Mendez Margarita  1  2 Neta Gila  1 * 1 Division of Cancer Control and Population Sciences, National Cancer Institute, National Institutes of Health Rockville, MD United States 2 Center for Global Health, National Cancer Institute, National Institutes of Health Rockville, MD United States Edited by: Aimee Campbell Reviewed by: Xiaoming He Samuel Cumber * Correspondence: gila.neta@nih.gov 19 9 2025 2025 5 481620 1624733 07 5 2025 25 8 2025 19 09 2025 04 10 2025 04 10 2025 © 2025 Vinson, Villalobos, Correa-Mendez and Neta. 2025 Vinson, Villalobos, Correa-Mendez and Neta https://creativecommons.org/licenses/by/4.0/ This is an open-access article distributed under the terms of the Creative Commons Attribution License (CC BY) Background The National Cancer Institute seeks to support cancer research to advance scientific knowledge that will “help all people live longer, healthier lives.” To do this, we need to understand how to effectively and efficiently scale-up evidence-based cancer control innovations (EBIs). We analyzed National Cancer Institute (NCI)-funded implementation science (IS) grants to understand gaps and opportunities for scale-up research. Methods The National Institutes of Health (NIH) Query, View, and Report (QVR) system was used to identify NCI-funded IS grants focused on scale-up since 2016. Key search terms were identified, and two coders reviewed specific aims to identify IS and scale-up grants. Eligible grants were coded for study characteristics, including administrative, cancer-related, and scale-up related features using Microsoft Excel and iSearch. Results Of the 61 grants initially identified, 17 were included. Approximately one-third of the grants were conducted abroad ( n n n n n Conclusions The NCI has funded a limited number of IS grants focused on scale-up. This analysis helps identify the current scope of the NCI portfolio and enables exploration of gaps and opportunities for future research on scale-up across the cancer continuum. scale-up cancer control research gaps evidence-based innovations implementation science National Cancer Institute (NCI) The author(s) declare that financial support was received for the research and/or publication of this article. Open access funding was provided by the National Cancer Institute (NCI). This study was conducted by NCI staff members as part of their official duties. No additional funding was used to support this research. pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement no pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes section-at-acceptance Implementation Science Background The National Cancer Institute (NCI) seeks to support cancer research to advance scientific knowledge that will “help all people live longer, healthier lives” ( 1 Research focused on scaling up EBIs is very limited to date, but an emerging priority with particular traction in low- and middle-income countries (LMICs). One review reported fourteen scale-up studies between 2003 and 2016, none of which focused on cancer, and another reported twenty-seven between 2010 and 2019 ( 2 3 4 4 5 There is a desire to scale-up EBIs toward achieving the goal of all people living longer, healthier lives, and a recognition of the potential of implementation science to advance this work, yet the extent to which cancer control implementation science has focused on scale-up is unknown. Therefore, we analyzed NCI-funded implementation science grants to understand gaps and opportunities for scale-up research. The specific objectives were to understand the types of studies that have been funded to date and to characterize grants related to their implementation and cancer control focus, and scale-up related design features. Methods Study sample identification Following established best practices in grant portfolio analyses ( 6 7 2 4 8 6 7 The search was limited to new and competing continuance applications awarded since 2005, the first year of the NIH-wide Dissemination and Implementation Research in Health funding opportunity ( 9 10 Figure 1 Figure 1 Flow diagram of the identification, screening, eligibility, and inclusion of grants for portfolio analysis. Flowchart illustrating a study selection process: Identification starts with 61 records. Screening evaluates if they concern implementation research, excluding 8. Eligibility assesses focus on scale-up, excluding 36, leaving 17 studies for analysis. Footnotes explain search criteria, quality control, and exclusion reasons. We leveraged an internal NIH portfolio analysis software, iSearch 11 Following quality control to ensure that grants were implementation science, two coders each reviewed the abstracts, specific aims, and research strategies sections of the remaining grants for eligibility to ensure that they were studying scale-up or explicit factors related to scale-up. We used ExpandNet's definition of scaling up as a guide: “deliberate efforts to increase the impact of innovations successfully tested in pilot or experimental projects to benefit more people and to foster policy and program development on a lasting basis” ( 12 Codebook development and coding process The codebook for this portfolio analysis was developed iteratively based on standard practice guidance from the NIH Office of Portfolio Analysis and an initial review of other NIH- and NCI-specific grant portfolio analysis codebooks and related publications ( 6 7 13 14 Appendix A Two grants from the analytic sample were selected, one domestic and one international, and coded by all four study team members to pilot the codebook and as a training exercise to ensure consistent understanding of code definitions across the study team. After the two grants were discussed and discrepancies were resolved, minor edits were made to clarify the codes and finalize the codebook (see Appendix A iSearch Data analysis To characterize the portfolio of grants included in this analysis, descriptive grant metadata were extracted from iSearch iSearch Results A total of 61 grants awarded by the NCI were identified through the QVR database search query criteria. After review for inclusion, 17 implementation science grants studying scale-up and awarded by the NCI were identified and coded by paired reviewers. Figure 1 Table 1 n n n Table 1 Characteristics of included grants ( N Descriptive variable Total Frequency Percent Year awarded 2023 2 11.8 2022 8 47.1 2021 2 11.8 2018 2 11.8 2017 1 5.9 2016 2 11.8 Funding mechanism a R01 10 58.8 R21 3 17.6 U01 3 17.6 UM1 1 5.9 Study Section DIRH/SIHH b 7 41.2 Other 10 58.8  a R01: NIH Research Project Grant Program; R21: NIH Exploratory/Developmental Research Grant Award; U01, UM1: Cooperative Agreements.  b In October 2020, DIRH changed to SIHH; DIRH was the Dissemination and Implementation Research in Health Study Section, SIHH is the Science of Implementation in Health and Healthcare Study Section. The characteristics of the interventions under study in the grants analyzed are shown in Table 2 n n n n n n n n Table 2 Cancer-related characteristics of the interventions under study ( N Characteristics Total Frequency Percent Cancer Control Continuum Area a Prevention 11 64.7 Screening 7 41.2 Treatment 2 11.8 Diagnosis 2 11.8 Survivorship 2 11.8 Cancer Content Area a Screening 7 41.2 Tobacco control 4 23.5 Vaccine uptake 3 17.6 Diet/Nutrition 2 11.8 Symptom management 2 11.8 Patient navigation 1 5.9 Sun safety 1 5.9 Physical activity 1 5.9 Skin self-examination 1 5.9 Quality of life 1 5.3 HIV treatment adherence 1 5.3 Cancer Type Cervical 6 40.0 Lung 3 20.0 Skin 2 13.3 Colorectal 2 13.3 HPV-related 1 6.7 Head and neck 2 6.7 HIV-related 1 6.7 Liver 1 6.7 Breast 1 6.7 Non-specified 2 13.3  a Responses not mutually exclusive. Table 3 n n n n n n n n n Table 3 Characteristics of included studies ( N Characteristics Total Frequency Percent Type of Organization, Delivery System or Setting a Healthcare 11 64.7 Health department 2 11.8 Community-based organization 2 11.8 School 2 11.8 Workplace 2 11.8 Means of Intervention Delivery a Healthcare provider 6 35.3 Peer/Lay healthcare professional 5 29.4 Public health official 4 15.8 Clinic support staff 3 17.6 Electronic health or medical record 2 10.5 Mobile device 2 10.5 Administrators/Policymakers 1 5.9 Employer 1 5.9 Other technology 1 5.9 School personnel 1 5.9 Other delivery mode 1 5.9 Not applicable 2 11.8 Low- and middle income country b No 11 64.7 Yes 6 35.3 Number of Sites Studied for Scale-up 6–10 3 17.6 11–40 7 41.2 >40 5 29.4 Not applicable 2 11.8 Study Objectives a Examine scale-up related factors (barriers/facilitators, context) 11 64.7 Assess costs and benefits of scaling 9 52.9 Evaluate an implementation strategy to scale 7 41.2 Measure scale-up of the intervention 3 17.6 Other 2 11.8 Study Design a Mixed Methods 12 70.6 Experimental 10 58.8 Observational 5 29.4 Qualitative 4 21.1 Quasi-experimental 2 10.5 Theory/Model/Framework a Consolidated Framework for Implementation Research (CFIR) 9 52.9 Practical Robust Implementation and Sustainability Model (PRISM) or Reach Effectiveness Adoption Implementation Maintenance (RE-AIM) ( 29 7 41.2 Proctor's Implementation Outcomes Framework ( 30 2 11.8 Capability, Opportunity, Motivation, Behavior (COM-B) model ( 31 32 2 11.8 Dynamic Sustainability Framework ( 21 2 11.8 CDC's Policy Analytical Framework ( 20 1 5.9 Diffusion of Innovations (DOI) ( 33 1 5.9 Exploration Preparation Implementation Sustainment (EPIS) ( 34 1 5.9 Health Promotion Research Center Dissemination and Implementation Framework ( 19 1 5.9 Model for Adaptation Design and Impact (MADI) ( 35 1 5.9 Socioecological Model ( 36 1 5.3 Terms Used a Scale-up 16 94.1 Scalability 8 47.1 Other 1 5.9  a Responses not mutually exclusive.  b Classification per Wellcome Trust: https://wellcome.org/grant-funding/guidance/low-and-middle-income-countries The scope of scale-up varied widely across grants in terms of the number of sites included, with a mean of 53 sites, ranging from six to two hundred across seventeen studies. Most studies (64.7%, n n n Most grants proposed mixed methods study designs (70.6%, n n 15 n Nine grants coded for this portfolio analysis (52.9%) were guided by the Consolidated Framework for Implementation Research (CFIR), whereas 41.2% ( n 16 17 18 19 20 21 n n Discussion Reviewing the NCI portfolio of implementation science grants focused on scale-up reveals relatively few grants in this space, but the number has been steadily increasing since 2016, peaking in 2022. There is a heavy focus on prevention and early detection in the grant portfolio, which aligns with the National Cancer Institute goals to prevent most cancers before they start and ensure the best outcomes for every person diagnosed with cancer. However, there is a gap in scaling-up EBIs following a cancer diagnosis in the treatment and survivorship phases that investigators could address to further advance national goals. Expanding the scope of implementation studies beyond small-scale, few settings to examine scaling implementation to multiple sites and settings can improve the reach of EBIs by informing scale up strategies. Some types of cancer screening, such as breast and cervical cancer screening, along with tobacco control, are among the longest standing EBIs available for the prevention and control of cancer ( 22 23 24 25 In an effort to stimulate more scale-up focused implementation science, NCIs recently published linked cooperative agreement funding opportunities (UG3/UH3) for the Scaling-Up and Maintaining Evidence-Based Interventions to Maximize Impact on Cancer (SUMMIT) initiative focused on lung cancer screening and tobacco use treatment for cancer survivors (RFA-CA-25-009 and RFA-CA-25-010) ( 26 27 Healthcare has been the primary setting for the delivery of cancer-related EBIs and implementation science and was accordingly well represented in this portfolio. However, investigators may wish to explore opportunities to expand the delivery of cancer-related EBIs to nontraditional community settings via various technologies to reduce the burden on strained health systems and providers and expand the EBI reach to populations who may not be connected with the healthcare system. Milat, Bauman, and Redman (2015) previously identified eight frameworks that could be used to help scale EBIs into practice and policy, and this portfolio analysis confirmed that a number of theories, models, and frameworks from implementation science, public health, and policy fields can be leveraged in scale-up research ( 28 In terms of scale-up related features of grants in the portfolio, there was a wide range of sites included for scale-up, from as few as six to as many as two hundred and only five studies looked at scaling an EBI to more than forty sites. If we are to achieve national cancer goals at a societal level, it will be necessary to continue to push for scaling EBIs to a greater number of sites and individuals. Additionally, while studying factors related to scale-up is critical and was included in most grants, the portfolio analysis revealed gaps in evaluating strategies for scale-up, which may differ from implementation strategies for implementation at a single site in terms of burden, cost, reach, acceptability, etc., or in different political or healthcare contexts globally. Indeed, a systematic review by Bulthuis et al. (2019) reported factors influencing the scale-up of public health EBIs in LMICs, examining “vertical scale-up for sustainability” and highlighting factors that influence changes in structure, practice, and culture ( 3 2 Limitations of this analysis include the possibility that we may have missed relevant grants. However, we tried to perform as exhaustive a search as possible, using a range of search terms based on terms used in previously published reviews. Further, the generalizability of our findings may be limited for other funding entities since we focused on NCI-funded grants only. Conclusion Although NCI has funded a limited number of grants focused on scale-up, opportunities are growing, as demonstrated by the recent issuance of SUMMIT. This analysis helps identify the current scope of the NCI portfolio and enables exploration of gaps and opportunities for future research on scale-up across the cancer continuum. Acknowledgments The views expressed in this article are those of the authors and do not necessarily represent the official position of the National Cancer Institute. Abbreviations CDC, centers for disease control and prevention; CFIR, consolidated framework for implementation research; COM-B, capability, opportunity, motivation, behavior; CT, computed tomography; DOI, diffusion of innovations; EBI, evidence-based innovation; EPIS, exploration preparation implementation sustainment; HIV, human immunodeficiency virus; HPV, human papillomavirus; IS, implementation science; LMIC, low and middle-income countries; MADI, model for adaptation design and impact; NCI, National Cancer Institute; NIH, National Institutes of Health; Pap, Papanicolaou; PAR, program announcement with special receipt, referral, and/or review considerations; PRISM, Practical Robust Implementation and Sustainability Model; PRISMA, preferred reporting items for systematic reviews and meta-analyses; QVR, query, view and report; RE-AIM, reach, effectiveness, adoption, implementation, and maintenance; TDF, theoretical domains framework. Data availability statement The datasets presented in this article are not readily available because Grant applications are confidential and accessible only to U.S. NIH staff. Requests to access the datasets that are publicly available should be directed to Gila.Neta@nih.gov Author contributions CV: Writing – review & editing, Conceptualization, Writing – original draft, Formal analysis. AV: Formal analysis, Writing – original draft, Writing – review & editing. MC-M: Formal analysis, Writing – original draft, Writing – review & editing. GN: Conceptualization, Writing – original draft, Writing – review & editing, Formal analysis. Conflict of interest The authors declare that the research was conducted in the absence of any commercial or financial relationships that could be construed as a potential conflict of interest. Generative AI statement The author(s) declare that no Generative AI was used in the creation of this manuscript. Any alternative text (alt text) provided alongside figures in this article has been generated by Frontiers with the support of artificial intelligence and reasonable efforts have been made to ensure accuracy, including review by the authors wherever possible. If you identify any issues, please contact us. Publisher's note All claims expressed in this article are solely those of the authors and do not necessarily represent those of their affiliated organizations, or those of the publisher, the editors and the reviewers. Any product that may be evaluated in this article, or claim that may be made by its manufacturer, is not guaranteed or endorsed by the publisher. References 1. National Cancer Institute National Cancer Plan. (2023) 2. Ben Charif A Zomahoun HTV LeBlanc A Langlois L Wolfenden L Yoong SL Effective strategies for scaling up evidence-based practices in primary care: a systematic review Implement Sci 2017 12 1 139 10.1186/s13012-017-0672-y 29166911 PMC5700621 3. Bulthuis SE Kok MC Raven J Dieleman MA Factors influencing the scale-up of public health interventions in low- and middle-income countries: a qualitative systematic literature review Health Policy Plan 2020 35 2 219 34 10.1093/heapol/czz140 31722382 PMC7050685 4. Greenhalgh T Papoutsi C Spreading and scaling up innovation and improvement Br Med J 2019 365 l2068 10.1136/bmj.l2068 31076440 PMC6519511 5. Cancer Moonshot Blue Ribbon Panel Cancer Moonshot Blue Ribbon Panel Report. (2016) 6. Norton WE Neta G Jacobsen PB National cancer institute funding for rapid cycle interventional research in cancer care delivery JNCI Cancer Spectr 2023 7 6 pkad089 10.1093/jncics/pkad089 37862246 PMC10674048 7. Neta G Clyne M Chambers DA Dissemination and implementation research at the national cancer institute: a review of funded studies (2006–2019) and opportunities to advance the field Cancer Epidemiol Biomarkers Prev 2021 30 2 260 7 10.1158/1055-9965.EPI-20-0795 33268488 8. Aarons GA Sklar M Mustanski B Benbow N Brown CH Scaling-out” evidence-based interventions to new populations or new health care delivery systems Implement Sci 2017 12 1 111 10.1186/s13012-017-0640-6 28877746 PMC5588712 9. Services DoHaH PAR-25-144 Dissemination and Implementation Research in Health (R01 Clinical Trial Optional). (2024) Available online at: https://grants.nih.gov/grants/guide/pa-files/PAR-25-144.html (Accessed May 07, 2025) 10. Page MJ McKenzie JE Bossuyt PM Boutron I Hoffmann TC Mulrow CD The PRISMA 2020 statement: an updated guideline for reporting systematic reviews Br Med J 2021 372 n71 10.1136/bmj.n71 33782057 PMC8005924 11. National Cancer Institute About Implementation Science. (2022) (A)cessed August 04, 2022 Available from: Available online at: https://cancercontrol.cancer.gov/is/about (Accessed May 07, 2025) 12. ExpandNet Our definition of scaling up (n.d). Available online at: https://expandnet.net/scaling-up-definition/ (Accessed May 07, 2025) 13. Mollica MA Tesauro G Tonorezos ES Jacobsen PB Smith AW Gallicchio L Current state of funded national institutes of health grants focused on individuals living with advanced and metastatic cancers: a portfolio analysis J Cancer Surviv 2021 15 3 370 4 10.1007/s11764-021-01008-8 33651327 14. Roberts MC Clyne M Kennedy AE Chambers DA Khoury MJ The current state of funded NIH grants in implementation science in genomic medicine: a portfolio analysis Genet Med 2019 21 5 1218 23 10.1038/gim.2017.180 31048814 PMC5920776 15. Curran GM Bauer M Mittman B Pyne JM Stetler C Effectiveness-implementation hybrid designs: combining elements of clinical effectiveness and implementation research to enhance public health impact Med Care 2012 50 3 217 26 10.1097/MLR.0b013e3182408812 22310560 PMC3731143 16. Feldstein AC Glasgow RE A practical, robust implementation and sustainability model (PRISM) for integrating research findings into practice Jt Comm J Qual Patient Saf 2008 34 4 228 43 10.1016/s1553-7250(08)34030-6 18468362 17. Damschroder LJ Reardon CM Widerquist MAO Lowery J The updated consolidated framework for implementation research based on user feedback Implement Sci 2022 17 1 75 10.1186/s13012-022-01245-0 36309746 PMC9617234 18. Glasgow RE Vogt TM Boles SM Evaluating the public health impact of health promotion interventions: the RE-AIM framework Am J Public Health 1999 89 9 1322 7 10.2105/AJPH.89.9.1322 10474547 PMC1508772 19. Harris JR Cheadle A Hannon PA Forehand M Lichiello P Mahoney E A framework for disseminating evidence-based health promotion practices Prev Chronic Dis 2012 9 E22 22172189 PMC3277406 20. Centers for Disease Control and Prevention CDC’s Policy Analytical Framework (2024). Available online at: https://www.cdc.gov/polaris/php/policy-resources-trainings/policy-analytical.html (Accessed May 07, 2025) 21. Chambers DA Glasgow RE Stange KC The dynamic sustainability framework: addressing the paradox of sustainment amid ongoing change Implement Sci 2013 8 117 10.1186/1748-5908-8-117 24088228 PMC3852739 22. National Cancer Institute Evidence-Based Cancer Control Programs (EBCCP) (2024). Available online at: https://ebccp.cancercontrol.cancer.gov/ (Accessed May 07, 2025) 23. World Health Organization Global Strategy to Accelerate the Elimination of Cervical Cancer as a Public Health Problem Geneva World Health Organization 2020 24. Leiter A Veluswamy RR Wisnivesky JP The global burden of lung cancer: current status and future trends Nat Rev Clin Oncol 2023 20 9 624 39 10.1038/s41571-023-00798-3 37479810 25. Pinsky PF Lung cancer screening with low-dose CT: a world-wide view Transl Lung Cancer Res 2018 7 3 234 42 10.21037/tlcr.2018.05.12 30050762 PMC6037972 26. National Cancer Institute RFA-CA-25-009 Scaling-up and Maintaining Evidence-based Interventions to Maximize Impact on Cancer (SUMMIT)- Lung Cancer Screening (UG3/UH3 Clinical Trial Required) (2024). Available online at: https://grants.nih.gov/grants/guide/rfa-files/RFA-CA-25-009.html (Accessed May 07, 2025) 27. National Cancer Institute RFA-CA-25-010 Scaling-up and Maintaining Evidence-based Interventions to Maximize Impact on Cancer (SUMMIT) - Tobacco Use Treatment for Cancer Survivors (UG3/UH3 Clinical Trial Required) (2024). Available online at: https://grants.nih.gov/grants/guide/rfa-files/RFA-CA-25-010.html (Accessed May 07, 2025) 28. Milat AJ Bauman A Redman S Narrative review of models and success factors for scaling up public health interventions Implement Sci 2015 10 113 10.1186/s13012-015-0301-6 26264351 PMC4533941 29. Glasgow RE What does it mean to be pragmatic? Pragmatic methods, measures, and models to facilitate research translation Health Educ Behav 2013 40 3 257 65 10.1177/1090198113486805 23709579 30. Proctor E Silmere H Raghavan R Hovmand P Aarons G Bunger A Outcomes for implementation research: conceptual distinctions, measurement challenges, and research agenda Adm Policy Ment Health 2011 38 2 65 76 10.1007/s10488-010-0319-7 20957426 PMC3068522 31. Michie S van Stralen MM West R The behaviour change wheel: a new method for characterising and designing behaviour change interventions Implement Sci 2011 6 42 10.1186/1748-5908-6-42 21513547 PMC3096582 32. Cane J O'Connor D Michie S Validation of the theoretical domains framework for use in behaviour change and implementation research Implement Sci 2012 7 37 10.1186/1748-5908-7-37 22530986 PMC3483008 33. Rogers EM Diffusion of Innovations 5th ed. New York, NY Free Press 2003 34. Aarons GA Hurlburt M Horwitz SM Advancing a conceptual model of evidence-based practice implementation in public service sectors Adm Policy Ment Health 2011 38 1 4 23 10.1007/s10488-010-0327-7 21197565 PMC3025110 35. Kirk MA Moore JE Wiltsey Stirman S Birken SA Towards a comprehensive model for understanding adaptations’ impact: the model for adaptation design and impact (MADI) Implement Sci 2020 15 1 56 10.1186/s13012-020-01021-y 32690104 PMC7370455 36. Bronfenbrenner U Ecological systems theory Vasta R Annals of Child Development 6. London, UK Jessica Kingsley Publishers 1989 187 249 Appendix A. Codebook variables, questions, and codes Variable Question and Codes Objectives What is/are the overall study objective(s)? Select all that apply. (Variable: Objectives) a) Examine factors (barriers/facilitators, context) related to scale-up b) Evaluate the impact of an implementation strategy on the scale-up of evidence-based intervention, program, or policy c) Measure the scale-up of EBPs, strategies, practices, or health outcomes (without testing an implementation strategy) d) Assess costs and benefits of the scaled-up delivery of the evidence-based intervention, program, or policy. e) Methodological (e.g., developing measure, testing TMF) f) Other, please specify Cancer continuum Where is the study focused along the cancer control continuum? Select all that apply. a) Prevention b) Screening c) Diagnosis d) Treatment e) Survivorship f) End of life (hospice) Cancer type(s) What cancer type is the focus of the study? Select all that apply. a) Anal cancer b) Breast cancer c) Cervical cancer d) Colorectal cancer e) Liver cancer f) Lung cancer g) Prostate cancer h) Skin cancer i) HIV related cancers j) HPV related cancers k) Other, please specify l) Not specified Content What cancer content area does the study focus on? What is the focus of the intervention? Select all that apply unless encompassed by comprehensive content area (e.g., survivorship care). a) Comorbidity disease management (e.g., cardiovascular disease; obesity) b) COVID-19 c) Diet/Nutrition d) Fertility e) Financial hardship f) Genetic services (testing, screening and counseling) g) Patient navigation h) Physical activity i) Psychological well-being (e.g., depression, anxiety, quality of life) j) Risk assessment (e.g., hereditary cancer, cervical cancer, risk-stratified screening, risk prediction models, polygenic risk scores) k) Screening l) Shared decision making m) Sun Safety n) Tobacco control o) Social determinants of health (e.g., supportive housing, social services) p) Survivorship care (e.g., treatment decision making, patient-caregiver social support) q) Symptom management (e.g., pain) r) Vaccine uptake s) Other, please specify t) Not specified Country What is the country where scale-up is being studied? Open-ended response LMIC Is the country a low- or middle-income country as classified by the Organisation for Economic Co-operation and Development (OECD)? https://www.oecd.org/dac/financing-sustainable-development/development-finance-standards/daclist.htm a) Yes b) No Setting In what type of organization, delivery system, or setting does the study take place? Where/how is the intervention delivered/will be delivered? Or through what settings? Select all that apply. Not recruitment setting, intervention delivery setting. a) Community-based organization (e.g., social service organizations, churches) b) Healthcare settings (e.g., integrated delivery system, community health centers, FQHCs academic medical center) c) Recreation area (e.g., park, pool, beach) d) School (e.g., elementary/junior/high school, college/university excluding academic medical centers) e) Health department (e.g., state, local) f) Workplace setting (e.g., businesses, corporations) g) Other, please specify h) Not specified Implementer/Deliverer By whom is the intervention being delivered? Select all that apply. a) Peer/Lay healthcare professionals (e.g., peer educators, patient navigators, community health workers) b) Healthcare Provider (e.g., nurses, physicians, specialists) c) Clinic support staff (e.g., medical assistant) d) Public health official (e.g., state or local health department staff) e) School personnel f) Not stated g) Other, please specify Design What type of study design is used? Select all that apply. a) Experimental (RCT, pragmatic RCT, cluster/group RCT) b) Mixed methods (i.e., collection and integration of qualitative and quantitative data - e.g., sequential exploratory design) c) Observational (e.g., prospective, retrospective) d) Qualitative (e.g., focus groups, semi-structured interviews) e) Quasi-experimental (e.g., regression discontinuity, interrupted time series) f) Measurement or algorithm development or validation g) Systems science (e.g., simulation modeling, social network analysis) TMFs List implementation science theories, models, or frameworks used. Select all that apply. a) CFIR b) RE-AIM/PRISM c) EPIS d) PARIHS/I-PARIHS e) Other, please specify Terms Which terms were used to describe scale-up? Select all that apply. a) Scale-up b) Scaling out c) Up-scaling d) Scalability e) Spread f) Other, please specify ",
  "metadata": {
    "Title of this paper": "Ecological systems theory",
    "Journal it was published in:": "Frontiers in Health Services",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12491013/"
  }
}