{
  "title": "Paper_1243",
  "abstract": "pmc Mar Drugs Mar Drugs 590 mardrugs marinedrugs Marine Drugs 1660-3397 Multidisciplinary Digital Publishing Institute  (MDPI) PMC12471580 PMC12471580.1 12471580 12471580 41003304 10.3390/md23090335 marinedrugs-23-00335 1 Review Postbiotics of Marine Origin and Their Therapeutic Application https://orcid.org/0000-0002-9265-3732 Cerezo Isabel M. 1 2 † https://orcid.org/0000-0002-6305-7501 Pérez-Gómez Olivia 1 † https://orcid.org/0009-0005-4782-8416 Rohra-Benítez Sonia 1 https://orcid.org/0000-0001-5605-7071 Domínguez-Maqueda Marta 1 https://orcid.org/0000-0001-8175-0409 García-Márquez Jorge 1 https://orcid.org/0000-0001-6873-1908 Arijo Salvador 1 * Kurtboke Ipek Academic Editor 1 cerezoi@uma.es olipergom@uma.es soniarb@uma.es martadm@uma.es j.garcia@uma.es 2 * sarijo@uma.es † These authors contributed equally to this work. 24 8 2025 9 2025 23 9 497656 335 31 7 2025 22 8 2025 23 8 2025 24 08 2025 27 09 2025 27 09 2025 © 2025 by the authors. 2025 https://creativecommons.org/licenses/by/4.0/ Licensee MDPI, Basel, Switzerland. This article is an open access article distributed under the terms and conditions of the Creative Commons Attribution (CC BY) license ( https://creativecommons.org/licenses/by/4.0/ The increase in antibiotic-resistant pathogens has prompted the search for alternative therapies. One such alternative is the use of probiotic microorganisms. However, growing interest is now turning toward postbiotics—non-viable microbial cells and/or their components or metabolites—that can confer health benefits without the risks associated with administering live microbes. Marine ecosystems, characterized by extreme and diverse environmental conditions, are a promising yet underexplored source of microorganisms capable of producing unique postbiotic compounds. These include bioactive peptides, polysaccharides, lipoteichoic acids, and short-chain fatty acids produced by marine bacteria. Such compounds often exhibit enhanced stability and potent biological activity, offering therapeutic potential across a wide range of applications. This review explores the current knowledge on postbiotics of marine origin, highlighting their antimicrobial, anti-inflammatory, immunomodulatory, and anticancer properties. We also examine recent in vitro and in vivo studies that demonstrate their efficacy in human and animal health. Some marine bacteria that have been studied for use as postbiotics belong to the genera Bacillus Halobacillus Halomonas Mameliella Shewanella Streptomyces Pseudoalteromonas Ruegeria Vibrio Weissella antimicrobial activity bacteria extracellular products immunomodulation microbiota probiotic This research received no external funding. pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement no pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes 1. Introduction Infectious diseases remain one of the most significant challenges to global health, affecting not only humans but also a wide range of domestic and wild animals. They are caused by diverse pathogenic agents, including bacteria, viruses, fungi, and parasites, and can lead to acute outbreaks or chronic conditions with serious economic, social, and environmental repercussions [ 1 2 In humans, diseases such as tuberculosis, influenza, malaria, and dengue continue to contribute to substantial morbidity and mortality, particularly in low- and middle-income countries [ 3 4 5 6 7 8 Vibrio Photobacterium Aeromonas 9 10 11 12 13 14 To control infectious diseases, antibiotic treatments have historically been implemented. However, widespread antibiotic use and failures in infection prevention and control strategies have contributed to the emergence and spread of antibiotic resistance, posing a significant global health threat [ 15 16 17 16 In this sense, in 2024, the World Health Organization (WHO) published the list of global priority pathogens—a catalogue of 15 groups of bacteria categorized into three priority tiers based on their antibiotic resistance levels: critical ( Acinetobacter baumannii Mycobacterium tuberculosis Salmonella typhi Shigella Enterococcus faecium Pseudomonas aeruginosa Salmonella Neisseria gonorrhoeae Staphylococcus aureus Streptococcus pneumoniae Haemophilus influenzae 18 The problem of AMR is equally important and prevalent in animals, although it is emphasized to a lesser extent [ 19 20 21 The One Health approach has been adopted internationally as a framework to address this challenge [ 22 23 24 25 26 27 2. The Use of Probiotics and Their Limitations Probiotics have been highlighted as a promising strategy to mitigate the challenges associated with antibiotic overuse by offering several health benefits. Probiotics are defined as “live microorganisms that, when administered in adequate amounts, confer a health benefit on the host” [ 28 29 Despite these advantages, the administration of live microbial cells carries potential risks [ 30 31 32 33 30 34 35 Regulatory frameworks for probiotics remain uneven and sometimes ambiguous. Although there is broad agreement on fundamental safety principles, there is little consensus on the specific studies or methodologies required to validate probiotic safety and efficacy [ 36 37 38 39 Given these challenges—viability concerns, safety risks, and regulatory variability—research has increasingly turned toward alternatives derived from probiotic cells that retain health-promoting functions. 3. Use of Postbiotics for Health Management Given the diversity of terms historically used to describe non-viable microorganisms or their derivatives with health-promoting properties, the International Scientific Association for Probiotics and Prebiotics (ISAPP) proposed a standardized definition to unify the terminology. In 2021, postbiotics were defined as “preparations of inanimate microorganisms and/or their components that confer a health benefit on the host” [ 29 Postbiotic preparations can include a wide array of bacterial derivatives, such as cell wall fragments, membrane lipids, exopolysaccharides (EPSs), short-chain fatty acids (SCFAs), peptides, proteins, and soluble bioactive metabolites—all of which are known to exhibit diverse biological activities [ 40 41 42 43 44 45 46 39 Despite the limited understanding of the complete biochemical composition of many postbiotic formulations, recent advances in proteomics and metabolomics have identified numerous bioactive molecules [ 47 48 49 Bacillus Vibrio alginolyticus Staphylococcus aureus Escherichia coli Magnaporthe grisea 50 51 52 53 44 Postbiotics offer several advantages over probiotics: (i) reduced risk of translocation and infection, (ii) improved shelf stability, and (iii) better predictability in industrial applications [ 54 55 The scope of postbiotic applications is broad ( Figure 1 56 57 58 57 3.1. Antimicrobial Activity An important function of postbiotics is their ability to control pathogenic microorganisms by inhibiting their growth, interfering with biofilm development and swarming behavior, and limiting their capacity to colonize the host [ 59 60 61 Bacteriocins are peptides produced by some bacteria to inhibit the growth of other competing bacteria. These bacterins have been used as postbiotics to control certain diseases, such as tuberculosis [ 62 Clostridioides difficile 63 Staphylococcus aureus 64 Listeria monocytogenes 65 E. coli Salmonella enterica 66 Streptococcus pneumoniae Haemophilus influenzae 67 Among microbial products with notable antibacterial effects are SCFAs, mostly acetate, propionate, and butyrate [ 68 69 70 70 3.2. Immunomodulatory Effect Postbiotics are involved in the immune response and include SCFAs, exopolysaccharides (EPSs), lipopolysaccharides, and even peptidoglycans. Among these immunomodulatory drugs, SCFAs, which include butyrate, propionate, and acetate, have shown advantageous effects in aquatic organisms like zebrafish ( Danio rerio Dicentrarchus labrax Pelteobagrus fulvidraco Sparus aurata Micropterus salmoides Exopalaemon carinicauda 71 72 73 74 75 In mammalian models, including humans and mice, SCFAs stimulate B cell and T-helper (Th) lymphocyte activity and, hence, not only support innate immune responses but also improve adaptive immunity [ 76 77 78 79 Some postbiotics, which are Gram-negative bacteria, contain lipopolysaccharides (LPSs) with mild immunomodulatory properties. These LPSs are often employed as vaccine adjuvants or to activate innate immune responses [ 80 81 82 Marinomonas vaga Pseudoalteromonas Cellulophaga pacifica Vibrio fischeri 83 84 85 86 86 87 88 Labeo rohita Danio rerio Ctenopharyngodon idella 89 90 91 92 93 94 95 3.3. Microbiota Modulation Symbiotic microorganisms associated with a host play a crucial role in the survival and overall health of animals [ 96 97 The inclusion of postbiotics in the diet has been shown to directly affect microbial populations. For instance, enzymes and supernatant cells from Lactiplantibacillus plantarum 98 Ligilactobacillus salivarius Prevotella Parabacteroides 99 100 101 In addition, certain surface proteins, exopolysaccharides, and bacteriocins produced by probiotic strains such as Lactiplantibacillus plantarum Lactobacillus gasseri 102 3.4. Digestibility of Food For humans and livestock alike, evidence is accumulating that postbiotic supplementation boosts the breakdown of dietary constituents and nutrient absorption. Mechanistically, postbiotics improve digestibility through multiple complementary pathways. First, many microbes produce exo Bacillus 103 104 Bacillus 105 106 107 In ruminants, postbiotic supplements have repeatedly improved nutrient utilization and growth. In dairy cows, providing a lactobacilli-derived postbiotic before and after calving raised the feed intake and ruminal fermentation, yielding greater total-tract digestibility of dry matter (DM), organic matter (OM), and neutral detergent fiber (NDF) [ 108 L. plantarum 109 110 111 Bacillus 112 3.5. Antitumoral Effects As previously discussed, postbiotics have demonstrated potential antitumor properties across various cancer types, acting at multiple molecular levels. Compounds associated with these effects include SCFAs, proteins, enzymes, and peptides, among others [ 113 Notably, SCFAs such as butyrate have been shown to induce cell cycle arrest and apoptosis in several cancer cell lines, including those derived from colorectal, cervical, and breast cancers [ 113 114 115 Lactobacillus Bifidobacterium 113 116 Lactobacillus fermentum 4. The Marine Environment as a Source of Postbiotics Oceans, which cover more than 70% of the planet’s surface, are characterized by their high biodiversity and ecological variability, making them a promising source for the discovery of novel bioactive compounds [ 117 118 Hypericum perforatum 119 Salinispora tropica 120 121 According to the Global Biodiversity Assessment conducted by the United Nations Environment Programme, marine species account for approximately 178,000 known organisms spanning 34 phyla [ 122 123 The utilization of postbiotics of marine origin remains an area of research that has yet to be extensively explored. A greater volume of research has been dedicated to the field of marine probiotics, with a particular focus on the individual components that comprise these organisms. 5. Postbiotics Isolated from the Aquatic Environment Although most bacteria used as probiotics and postbiotics are Gram-positive, the marine environment is characterized by a greater abundance of Gram-negative bacteria [ 124 125 126 127 Table 1 Among Gram-positive marine bacteria, the genus Bacillus Bacillus amyloliquefaciens 128 Labeo rohita 129 Lamellodysidea herbacea B. amyloliquefaciens MK135790 Alcaligenes faecalis MK135791 130 B. amyloliquefaciens MK135790 B. cereus B. subtilis S. aureus S. enterica typhimurium B. subtilis E. coli S. enterica typhimurium 129 Bacillus pumilus Vibrio 131 Vibrio −1 Vibrio vulnificus B. pumilus Sparus aurata −1 132 S. aurata 105 B. pumillus Sparus aurata Photobacterium damselae piscicida Vibrio harveyi Tenacibaculum maritimum −1 105 Bacillus subtilis L. rohita 133 128 B. subtilis −1 134 Bacillus velezensis 135 136 Halobacillus salinus N N quorum sensing Chromobacterium violaceum Vibrio harveyi E. coli 137 N N Streptomyces vinaceusdrappus 138 −1 138 The Weissella cibaria 139 Yersinia ruckeri 139 W. cibaria Aeromonas salmonicida 140 In the context of Gram-negative bacteria, certain genera traditionally associated with pathogenicity—such as Aeromonas Vibrio Aeromonas salmonicida A. sobria V. harveyi 141 V. harveyi. V. harveyi V. harveyi 139 Halomonas meridian 142 −1 143 Mameliella −1 144 Several strains of Pseudoalteromonas Pseudoalteromonas flavipulchra Vibrio 145 Pseudoalteromonas piscicida 146 Pseudoalteromonas Caulerpa racemosa Vibrio alginolyticus −1 147 16 24 2 Pseudoalteromonas haloplanktis 148 Staphylococcus epidermidis 149 The exoproteome of Ruegeria pomeroyi 47 R. pomeroyi YP_165625 YP_168868 YP_165625 YP_168868 Shewanella putrefaciens Sparus aurata 150 151 152 Photobacterium damselae piscicida 153 9 −1 154 155 156 157 48 Solea senegalensis 158 The Vibrio proteolyticus Dicologlossa cuneata 159 Chelon labrosus 9 −1 160 161 Sparus aurata 162 marinedrugs-23-00335-t001_Table 1 Table 1 Postbiotics isolated from aquatic bacterial strains, the extraction methods used for their isolation, and their antimicrobial activities. Strain Postbiotic Extraction Method Biological Activities Ref. Gram-positive bacteria     Bacillus amyloliquefaciens ECPs Centrifugation and filtration Growth, biofilm, and motility inhibition of A. hydrophyla Vibrio S. galactiae [ 128 B. amyloliquefaciens MK135790 ECPs Centrifugation and ethyl acetate extraction Inhibition of E. coli B. cereus B. subtilis L. monocytogenes S. aureus S. enterica typhimurium [ 130 Bacillus pumilus ECPs Cell lysis and sonication Inhibition of 29 different Vibrio [ 131  Bacillus pumilus UMA169 ECPs Centrifugation and filtration Growth inhibition of P. damselae piscicida [ 105  Bacillus pumilus UMA216 ECPs Centrifugation and filtration Growth inhibition of P. damselae piscicida T. maritimum [ 105 Bacillus subtilis ECPs Centrifugation and filtration Growth, biofilm, and motility inhibition of A. hydrophyla Vibrio S. galactiae [ 128  Bacillus subtilis ECPs Centrifugation and ethyl acetate extraction Inhibition of S. aureus E. coli Klebsiella Proteus typhi [ 134 Bacillus velezensis Serine metalloprotease enzyme Centrifugation, filtration, and circular dichroism analyzer Thrombolytic activity, antiplatelet effects, and ability to improve blood coagulation [ 135 136 163 Halobacillus salinus N N Centrifugation and organic solvent extraction Inhibit quorum sensing (QS) in C. violaceum Vibrio harveyi Escherichia coli [ 137 Streptomyces vinaceusdrappus EPS Centrifugation and alcohol precipitation Anti-inflammatory effects, anti-Alzheimer’s activity, anti-obesity potential, and antidiabetic properties. Antibacterial and antibiofilm activity against a broad spectrum of pathogenic bacteria [ 138 Weissella cibaria Heat-inactivated cells Heat inactivation Increased survival against pathogens of Y. ruckeri A. salmonicida [ 139 Weissella cibaria Heat-inactivated cells Heat inactivation Increased survival against pathogens of Y. ruckeri [ 139 Weissella cibaria Heat-inactivated cells Heat and centrifugation Growth inhibition of A. salmonicida [ 140 Weissella cibaria Heat-inactivated cells Heat and centrifugation Antimicrobial activity of A. salmonicida Y. ruckeri [ 140 Gram-negative bacteria     Aeromonas salmonicida A. sobria OMPs Centrifugation and sonication Cross-reacted with antibodies obtained against V. harvey [ 141 Alcaligenes faecalis MK135791 ECPs Centrifugation and ethyl acetate extraction Inhibition of B. subtilis E. coli S. entrica typhimurium [ 130 Halomonas meridian L-glutaminase enzyme Supernatant purification Inhibits tumor cell growth and promotes cancer cell death [ 142 143 Mameliella ECPs Organic solvent and centrifugation Antiviral effect against Influenza A and B [ 144  Pseudoalteromonas flavipulchra ECPs Centrifugation and alcohol precipitation Inhibition of Vibrio [ 145 146 Pseudoalteromonas piscicida Siderophore Organic solvent extraction Inhibition of Pseudomonas aeruginosa [ 146 Pseudoalteromonas Fatty acids derived from ECPs Organic solvent extraction Produces antibacterial compounds and inhibits the biofilm of V. alginolyticus [ 147 Pseudoalteromonas haloplanktis ECPS Centrifugation Inhibited biofilm formation by S. epidermidis [ 148 149 Ruegeria pomeroyi Proteins derived from ECPs Centrifugation Identification of the RTX-like protein with possible functions in interaction, nutrient uptake, toxicity, or defense [ 47 Shewanella putrefaciens ECPs Centrifugation and filtration Growth, biofilm, and motility inhibition of Vibrio harveyi Photobacterium damselae piscicida Vibrio anguillarum [ 49 157 Vibrio proteolyticus ECPs Centrifugation, filtration, and ethanol inactivation Modulate the expression of genes and improve growth performance and nutritional characteristics [ 159 161 162 ECPs: extracellular products. 6. Conclusions In conclusion, although few marine microorganisms are currently used as postbiotics, the marine environment still offers considerable potential for the isolation of new strains with postbiotic potential. Non-living derivatives of bacteria, called postbiotics, provide a hopeful way to change intestinal microbiota, improve food digestibility, and support health in both humans and animals. Additional to this traditional effect knowing, antitumoral effects have also been reported, suggesting that some postbiotic compounds, including short-chain fatty acids, may be able to slow cancer cell proliferation, thereby showing their potential as treatment with medicinal uses. Although this field is still in its nascent stages, the great genetic and biochemical diversity of marine bacteria provides the possibility of finding new bioactive compounds that could help human and animal health, and that could be used in medicines based on marine postbiotics. Improvements in DNA sequencing have led to significant progress in the understanding of marine microorganisms. This is particularly relevant given that most microorganisms inhabiting these communities are not culturable in laboratory conditions. The increase in sequencing data of proteomics and metabolomics has enabled a much more comprehensive view of the genetic and metabolic potential of the microbial species present in marine ecosystems. This, in turn, opens up new possibilities for the identification and development of new marine postbiotics with applications in health. Acknowledgments All authors are members of the Biocontrol and Disease Prevention in Aquaculture research group in the Department of Microbiology at the University of Malaga, led by Miguel Ángel Moriñigo, whom we would like to thank for his continued support. We would also like to thank the other in the group for their collaboration: Eduardo Martinez-Manzanares, M. Carmen Balebona, and Silvana T. Tapia-Paniagua. Disclaimer/Publisher’s Note: Author Contributions Conceptualization, visualization, investigation, writing—original draft preparation, and writing—review and editing: I.M.C., O.P.-G., S.R.-B., M.D.-M., J.G.-M., and S.A.; supervision: S.A. All authors have read and agreed to the published version of the manuscript. Institutional Review Board Statement Not applicable. Data Availability Statement No new data were created or analyzed in this study. Conflicts of Interest The authors declare no conflicts of interest. The funders had no role in the design of the study; in the collection, analyses, or interpretation of the data; in the writing of the manuscript; or in the decision to publish the results. Abbreviations The following abbreviations are used in this manuscript: AGP Antimicrobial growth promoter AMR Antimicrobial resistance CLPs Pumilacidin-like cyclic lipopeptides CFUs Colony-forming units ECPs Extracellular products EPSs Exopolysaccharides LPSs Lipopolysaccharides QS Quorum sensing SCFAs Short-chain fatty acids WHO World Health Organization References 1. Baker R.E. Mahmud A.S. Miller I.F. Rajeev M. Rasambainarivo F. Rice B.L. Takahashi S. Tatem A.J. Wagner C.E. Wang L.F. Infectious disease in an era of global change Nat. Rev. Microbiol. 2022 20 193 205 10.1038/s41579-021-00639-z 34646006 PMC8513385 2. Bloom D.E. Kuhn M. Prettner K. Modern infectious diseases: Macroeconomic impacts and policy responses J. Econ. Lit. 2022 60 85 131 10.1257/jel.20201642 3. Nyaruaba R. Okoye C.O. Akan O.D. Mwaliko C. Ebido C.C. Ayoola A. Ayeni E.A. Odoh C.K. Abi M.E. Adebanjo O. Socio-economic impacts of emerging infectious diseases in Africa Infect. Dis. 2022 54 315 324 10.1080/23744235.2021.2022195 35007473 4. Lindahl J.F. Grace D. Strand T. The Consequences of human actions on risks for infectious diseases: A review Infect. Ecol. Epidemiol. 2015 5 30048 10.3402/iee.v5.30048 26615822 PMC4663196 5. Klous G. Huss A. Heederik D.J.J. Coutinho R.A. Human-livestock contacts and their relationship to transmission of zoonotic pathogens, a systematic review of literature One Health 2016 2 65 76 10.1016/j.onehlt.2016.03.001 28616478 PMC5462650 6. Rahman M.T. Sobur M.A. Islam M.S. Ievy S. Hossain M.J. Zowalaty M.E.E. Rahman A.M.M.T. Ashour H.M. Zoonotic diseases: Etiology, impact, and control Microorganisms 2020 8 1405 10.3390/microorganisms8091405 32932606 PMC7563794 7. Espinosa R. Tago D. Treich N. Infectious diseases and meat production Environ. Resour. Econ. 2020 76 1019 1044 10.1007/s10640-020-00484-3 32836843 PMC7399585 8. Ducrot C. Gautret M. Pineau T. Jestin A. Scientific literature on infectious diseases affecting livestock animals, longitudinal worldwide bibliometric analysis Vet. Res. 2016 47 1 14 10.1186/s13567-015-0280-2 26975408 PMC4790044 9. Mondal H. Chandrasekaran N. Mukherjee A. Thomas J. Viral infections in cultured fish and shrimps: Current status and treatment methods Aquac. Int. 2022 30 227 262 10.1007/s10499-021-00795-2 10. Lafferty K.D. Harvell C.D. Conrad J.M. Friedman C.S. Kent M.L. Kuris A.M. Powell E.N. Rondeau D. Saksida S.M. infectious diseases affect marine fisheries and aquaculture economics Ann. Rev. Mar. Sci. 2015 7 471 496 10.1146/annurev-marine-010814-015646 25251276 11. Morand S. Emerging Diseases, Livestock expansion and biodiversity loss are positively related at global scale Biol. Conserv. 2020 248 108707 10.1016/j.biocon.2020.108707 32834060 PMC7374155 12. El-Sayed A. Kamel M. Climatic changes and their role in emergence and re-emergence of diseases Environ. Sci. Pollut. Res. 2020 27 22336 22352 10.1007/s11356-020-08896-w PMC7187803 32347486 13. Hassell J.M. Begon M. Ward M.J. Fèvre E.M. Urbanization and disease emergence: Dynamics at the wildlife–livestock–human interface Trends Ecol. Evol. 2017 32 55 67 10.1016/j.tree.2016.09.012 28029378 PMC5214842 14. Brooks-Pollock E. de Jong M.C.M. Keeling M.J. Klinkenberg D. Wood J.L.N. Eight challenges in modelling infectious livestock diseases Epidemics 2015 10 1 5 10.1016/j.epidem.2014.08.005 25843373 15. Chinemerem Nwobodo D. Ugwu M.C. Oliseloke Anie C. Al-Ouqaili M.T.S. Chinedu Ikem J. Victor Chigozie U. Saki M. Antibiotic Resistance: The challenges and some emerging strategies for tackling a global menace J. Clin. Lab. Anal. 2022 36 e24655 10.1002/jcla.24655 35949048 PMC9459344 16. Ranjbar R. Alam M. Antimicrobial Resistance Collaborators (2022). Global burden of bacterial antimicrobial resistance in 2019: A systematic analysis Evid. Based Nurs. 2024 27 16 10.1136/ebnurs-2022-103540 37500506 17. Ferri M. Ranucci E. Romagnoli P. Giaccone V. Antimicrobial resistance: A global emerging threat to public health systems Crit. Rev. Food Sci. Nutr. 2017 57 2857 2876 10.1080/10408398.2015.1077192 26464037 18. World Health Organization WHO Bacterial Priority List, 2024 Bacterial Pathogens of Public Health to Guide Research, Development and Strategies to Prevent and Control Resistance WHO Geneva, Switzerland 2024 10.1016/S1473-3099(25)00118-5 19. Sharma C. Rokana N. Chandra M. Singh B.P. Gulhane R.D. Gill J.P.S. Ray P. Puniya A.K. Panwar H. Antimicrobial resistance: Its surveillance, impact, and alternative management strategies in dairy animals Front. Vet. Sci. 2018 4 237 10.3389/fvets.2017.00237 29359135 PMC5766636 20. Woolhouse M. Ward M. Van Bunnik B. Farrar J. Antimicrobial resistance in humans, livestock and the wider environment Philos. Trans. R. Soc. B Biol. Sci. 2015 370 20140083 10.1098/rstb.2014.0083 25918441 PMC4424433 21. Brown K. Uwiera R.R.E. Kalmokoff M.L. Brooks S.P.J. Inglis G.D. Antimicrobial growth promoter use in livestock: A requirement to understand their modes of action to develop effective alternatives Int. J. Antimicrob. Agents 2017 49 12 24 10.1016/j.ijantimicag.2016.08.006 27717740 22. Adisasmito W.B. Almuhairi S. Behravesh C.B. Bilivogui P. Bukachi S.A. Casas N. Becerra N.C. Charron D.F. Chaudhary A. Ciacci Zanella J.R. One Health: A new definition for a sustainable and healthy future PLoS Pathog. 2022 18 e1010537 10.1371/journal.ppat.1010537 35737670 PMC9223325 23. Naghavi M. Vollset S.E. Ikuta K.S. Swetschinski L.R. Gray A.P. Wool E.E. Robles Aguilar G. Mestrovic T. Smith G. Han C. Global burden of bacterial antimicrobial resistance 1990–2021: A systematic analysis with forecasts to 2050 Lancet 2024 404 1199 1226 10.1016/S0140-6736(24)01867-1 39299261 PMC11718157 24. Aslam B. Khurshid M. Arshad M.I. Muzammil S. Rasool M. Yasmeen N. Shah T. Chaudhry T.H. Rasool M.H. Shahid A. Antibiotic resistance: One health one world outlook Front. Cell Infect. Microbiol. 2021 11 771510 10.3389/fcimb.2021.771510 34900756 PMC8656695 25. Hernando-Amado S. Coque T.M. Baquero F. Martínez J.L. Defining and combating antibiotic resistance from one health and global health perspectives Nat. Microbiol. 2019 4 1432 1442 10.1038/s41564-019-0503-9 31439928 26. Newman D.J. Cragg G.M. Natural products as sources of new drugs from 1981 to 2014 J. Nat. Prod. 2016 79 629 661 10.1021/acs.jnatprod.5b01055 26852623 27. Kiuru P. Valeria D’Auria M. Muller C.D. Tammela P. Vuorela H. Yli-Kauhaluoma J. Exploring marine resources for bioactive compounds Planta Med. 2014 80 1234 1246 10.1055/s-0034-1383001 25203732 28. Hill C. Guarner F. Reid G. Gibson G.R. Merenstein D.J. Pot B. Morelli L. Canani R.B. Flint H.J. Salminen S. Expert consensus document: The international scientific association for probiotics and prebiotics consensus statement on the scope and appropriate use of the term probiotic Nat. Rev. Gastroenterol. Hepatol. 2014 11 506 514 10.1038/nrgastro.2014.66 24912386 29. Salminen S. Collado M.C. Endo A. Hill C. Lebeer S. Quigley E.M.M. Sanders M.E. Shamir R. Swann J.R. Szajewska H. The International Scientific Association of Probiotics and Prebiotics (ISAPP) consensus statement on the definition and scope of postbiotics Nat. Rev. Gastroenterol. Hepatol. 2021 18 649 667 10.1038/s41575-021-00440-6 33948025 PMC8387231 30. Zucko J. Starcevic A. Diminic J. Oros D. Mortazavian A.M. Putnik P. Probiotic—Friend or Foe? Curr. Opin. Food Sci. 2020 32 45 49 10.1016/j.cofs.2020.01.007 31. Kothari D. Patel S. Kim S.K. Probiotic Supplements Might Not Be Universally-Effective and Safe: A Review Biomed. Pharmacother. 2019 111 537 547 10.1016/j.biopha.2018.12.104 30597307 32. Fenster K. Freeburg B. Hollard C. Wong C. Laursen R.R. Ouwehand A.C. The Production and delivery of probiotics: A review of a practical approach Microorganisms 2019 7 83 10.3390/microorganisms7030083 30884906 PMC6463069 33. Van den Nieuwboer M. Brummer R.J. Guarner F. Morelli L. Cabana M. Claassen E. The administration of probiotics and synbiotics in immune compromised adults: Is it safe? Benef. Microbes 2015 6 3 18 10.3920/BM2014.0079 25304690 34. Sharma N. Kang D.K. Paik H.D. Park Y.S. Beyond Probiotics: A narrative review on an era of revolution Food Sci. Biotechnol. 2023 32 413 421 10.1007/s10068-022-01212-x 36911329 PMC9992473 35. Katkowska M. Garbacz K. Kusiak A. Probiotics: Should all patients take them? Microorganisms 2021 9 2620 10.3390/microorganisms9122620 34946221 PMC8706842 36. Arora M. Baldi A. Regulatory categories of probiotics across the globe: A review representing existing and recommended categorization Indian. J. Med. Microbiol. 2015 33 S2 S10 10.4103/0255-0857.150868 25657150 37. Garg V. Velumani D. Lin Y.C. Haye A. A comprehensive review of probiotic claims regulations: Updates from Asia-Pacific, United States, and Europe PharmaNutrition 2024 30 100423 10.1016/j.phanu.2024.100423 38. Bourdichon F. Budde-Niekiel A. Dubois A. Fritz D. Hatte J.L. Laulund S. McAuliffe O. Ouwehand A.C. Yao S. Zgoda A. Inventory of Microbial Food Cultures with safety demonstration in fermented food products update of the bulletin of the IDF N°377-2002, N°455-2012 and N°495-2018 Proceedings of the Bulletin of the International Dairy Federation Brussels, Belgium 12 September 2022 Volume 2022 39. Szajewska Hania and Vinderola G. Current Regulatory Issues for the Use of Probiotics Probiotics and Child Gastrointestinal Health: Advances in Microbiology, Infectious Diseases and Public Health Volume 19 Stefano G. Indrio F. Springer International Publishing Cham, Switzerland 2024 187 193 10.1007/978-3-031-58572-2_12 978-3-031-58572-2 39060739 40. Rafique N. Jan S.Y. Dar A.H. Dash K.K. Sarkar A. Shams R. Pandey V.K. Khan S.A. Amin Q.A. Hussain S.Z. Promising bioactivities of postbiotics: A comprehensive review J. Agric. Food Res. 2023 14 100708 10.1016/j.jafr.2023.100708 41. Aghebati-Maleki L. Hasannezhad P. Abbasi A. Khani N. Antibacterial, Antiviral, Antioxidant, and Anticancer Activities of Postbiotics: A Review of mechanisms and therapeutic perspectives Biointerface Res. Appl. Chem. 2022 12 2629 2645 10.33263/BRIAC122.26292645 42. Cuevas-González P.F. Liceaga A.M. Aguilar-Toalá J.E. Postbiotics and paraprobiotics: From concepts to applications Food Res. Int. 2020 136 109502 10.1016/j.foodres.2020.109502 32846581 43. Scauro A. Rocchetti M.T. Soccio M. la Gatta B. Liberatore M.T. De Simone N. Spano G. Fiocco D. Russo P. Postbiotic potential of newly isolated riboflavin-overproducing Lactiplantibacillus plantarum Probiotics Antimicrob Proteins 2025 17 10.1007/s12602-025-10538-x 40268810 44. Noori S.M.A. Behfar A. Saadat A. Ameri A. Yazdi S.S.A. Siahpoosh A. Antimicrobial and antioxidant properties of natural postbiotics derived from five lactic acid bacteria Jundishapur J. Nat. Pharm. Prod. 2023 18 e130785 10.5812/jjnpp-130785 45. Nazari F. Jafari P. Nomanpour B. Varmira K. Raissi F. Inhibitory effects of postbiotic consisting sonication-killed Bifidobacterium bifidum Iran. J. Microbiol. 2022 14 689 697 10.18502/ijm.v14i5.10964 36531806 PMC9723431 46. Mishra B. Mishra A.K. Mohanta Y.K. Yadavalli R. Agrawal D.C. Reddy H.P. Gorrepati R. Reddy C.N. Mandal S.K. Shamim M.Z. Postbiotics: The new horizons of microbial functional bioactive compounds in food preservation and security Food Prod. Process Nutr. 2024 6 28 10.1186/s43014-023-00200-w 47. Christie-Oleza J.A. Armengaud J. In-Depth analysis of exoproteomes from marine bacteria by shotgun liquid chromatography-tandem mass spectrometry: The Ruegeria pomeroyi Mar. Drugs 2010 8 2223 2239 10.3390/md8082223 20948905 PMC2953401 48. Pérez-Gómez O. Domínguez-Maqueda M. García-Márquez J. Moriñigo M.Á. Tapia-Paniagua S.T. Metabolite-Driven modulation of biofilm formation in shewanella: Insights from Shewanella Microb. Ecol. 2025 88 e70046 10.1007/s00248-025-02552-x 40423845 PMC12116997 49. Domínguez-Maqueda M. Pérez-Gómez O. García-Márquez J. Espinosa-Ruíz C. Cuesta A. Esteban M.Á. Alarcón-López F.J. Cárdenas C. Tapia-Paniagua S.T. Balebona M.C. Microalgae and cyanobacteria as microbial substrate and their influence on the potential postbiotic capability of a bacterial probiotic Microb. Biotechnol. 2024 17 e70046 10.1111/1751-7915.70046 39573896 PMC11582085 50. Englerová K. Bedlovičová Z. Nemcová R. Király J. Mad’ar M. Hajdučková V. Styková E. Mucha R. Reiffová K. Bacillus amyloliquefaciens Staphylococcus aureus Antibiotics 2021 10 1252 10.3390/antibiotics10101252 34680832 PMC8532693 51. Xiu P. Liu R. Zhang D. Suna C. Pumilacidin-like Lipopeptides Derived from marine Bacterium bacillus Vibrio alginolyticus Appl. Environ. Microbiol. 2017 83 e00450-17 10.1128/AEM.00450-17 28389538 PMC5452807 52. Wu S. Liu G. Zhou S. Sha Z. Sun C. Characterization of antifungal lipopeptide biosurfactants produced by marine Bacterium bacillus Mar. Drugs 2019 17 199 10.3390/md17040199 30934847 PMC6520760 53. Das P. Mukherjee S. Sen R. Antimicrobial potential of a lipopeptide biosurfactant derived from a marine Bacillus circulans J. Appl. Microbiol. 2008 104 1675 1684 10.1111/j.1365-2672.2007.03701.x 18194244 54. de Almada C.N. Almada C.N. Martinez R.C.R. Sant’Ana A.S. Paraprobiotics: Evidences on their ability to modify biological responses, inactivation methods and perspectives on their application in foods Trends Food Sci. Technol. 2016 58 96 114 10.1016/j.tifs.2016.09.011 55. Sánchez B. Delgado S. Blanco-Míguez A. Lourenço A. Gueimonde M. Margolles A. Probiotics, gut microbiota, and their influence on host health and disease Mol. Nutr. Food Res. 2017 61 1600240 10.1002/mnfr.201600240 27500859 56. Ma L. Tu H. Chen T. Postbiotics in human health: A narrative review Nutrients 2023 15 291 10.3390/nu15020291 36678162 PMC9863882 57. Al-Habsi N. Al-Khalili M. Haque S.A. Elias M. Al Olqi N. Al Uraimi T. Health benefits of prebiotics, probiotics, synbiotics, and postbiotics Nutrients 2024 16 3955 10.3390/nu16223955 39599742 PMC11597603 58. Zhao X. Liu S. Li S. Jiang W. Wang J. Xiao J. Chen T. Ma J. Khan M.Z. Wang W. Unlocking the power of postbiotics: A revolutionary approach to nutrition for humans and animals Cell Metab. 2024 36 725 744 10.1016/j.cmet.2024.03.004 38569470 59. Thakur K. Singh B. Kumar S. Sharma D. Sharma A.K. Jindal R. Kumar R. Potential of probiotics and postbiotics in aquaculture: Connecting current research gaps and future perspectives Microbe 2025 8 100431 10.1016/j.microb.2025.100431 60. Prajapati N. Patel J. Singh S. Yadav V.K. Joshi C. Patani A. Prajapati D. Sahoo D.K. Patel A. Postbiotic production: Harnessing the power of microbial metabolites for health applications Front. Microbiol. 2023 14 1306192 10.3389/fmicb.2023.1306192 38169918 PMC10758465 61. Tao L.-T. Lu H. Xiong J. Zhang L. Sun W.-W. Shan X.-F. The application and potential of postbiotics as sustainable feed additives in aquaculture Aquaculture 2024 592 741237 10.1016/j.aquaculture.2024.741237 62. Palanivel J. Thangam T. Jahankir M.J.B. Parthasarathy K. Bacteriocin Postbiotics for Tuberculosis Drug Development Springer New York, NY, USA 2024 10.1007/978-1-0716-3421-9_37 63. Luenglusontigit P. Sathapondecha P. Saengsuwan P. Surachat K. Boonserm P. Singkhamanan K. Effects of postbiotic from bacteriocin-like inhibitory substance producing Enterococcus faecalis Clostridioides difficile J. Health Sci. Med. Res. 2023 41 2023918 10.31584/jhsmr.2023918 64. Piper C. Draper L.A. Cotter P.D. Ross R.P. Hill C. A comparison of the activities of lacticin 3147 and nisin against drug-resistant Staphylococcus aureus Enterococcus J. Antimicrob. Chemother. 2009 64 546 551 10.1093/jac/dkp221 19561147 65. Lynch D. Hill C. Field D. Begley M. Inhibition of Listeria monocytogenes Staphylococcus capitis Food Microbiol. 2021 94 103661 10.1016/j.fm.2020.103661 33279086 66. Naimi S. Zirah S. Ben Taher M. Theolier J. Fernandez B. Rebuffat S.F. Fliss I. Microcin J25 exhibits inhibitory activity against Salmonella newport Front. Microbiol. 2020 11 988 10.3389/fmicb.2020.00988 32528437 PMC7262971 67. Richardson J.D. Guo E. Wyllie R.M. Jensen P. Dawid S. The pneumococcal bacteriocin streptococcin b is produced as part of the early competence cascade and promotes intraspecies competition mBio 2025 16 e0299324 10.1128/mbio.02993-24 39688419 PMC11796350 68. Selvam K. Manigundan K. Rajesh Kannan V. Annamalai K.K. Manikkam R. Venugopal G. Krishnan S. Analysis and Identification of Short-Chain Fatty Acid Postbiotics by Gas Chromatography Springer New York, NY, USA 2024 10.1007/978-1-0716-3421-9_19 69. Calvigioni M. Bertolini A. Codini S. Mazzantini D. Panattoni A. Massimino M. Celandroni F. Zucchi R. Saba A. Ghelardi E. HPLC-MS-MS quantification of short-chain fatty acids actively secreted by probiotic strains Front. Microbiol. 2023 14 1124144 10.3389/fmicb.2023.1124144 36937254 PMC10020375 70. Mandaliya D.K. Patel S. Seshadri S. Postbiotic potential of SCFAs on metaflammation and gut microbiota alteration in diabetes J. Biosci. 2025 50 57 10.1007/s12038-025-00531-5 40642799 71. Albaladejo-Riad N. El Qendouci M. Cuesta A. Esteban M.Á. Ability of short-chain fatty acids to reduce inflammation and attract leucocytes to the inflamed skin of Gilthead Seabream ( Sparus aurata Sci. Rep. 2024 14 31404 10.1038/s41598-024-83033-y 39732927 PMC11682419 72. Wang S. Li X. Zhang M. Li M. Effects of dietary sodium acetate on growth, intestinal microbiota composition, and ammonia tolerance of juvenile Yellow Catfish Pelteobagrus fulvidraco Aquaculture 2024 581 740480 10.1016/j.aquaculture.2023.740480 73. Fontinha F. Martins N. Campos G. Peres H. Oliva-Teles A. The effects of short-chain fatty acids in gut immune and oxidative responses of european sea bass ( Dicentrarchus labrax Animals 2024 14 1360 10.3390/ani14091360 38731364 PMC11083385 74. Cholan P.M. Han A. Woodie B.R. Watchon M. Kurz A.R.M. Laird A.S. Britton W.J. Ye L. Holmes Z.C. McCann J.R. Conserved anti-inflammatory effects and sensing of butyrate in zebrafish Gut Microbes 2020 12 1824563 10.1080/19490976.2020.1824563 33064972 PMC7575005 75. Li S. Heng X. Guo L. Lessing D.J. Chu W. SCFAs improve disease resistance via modulate gut microbiota, enhance immune response and increase antioxidative capacity in the host Fish. Shellfish. Immunol. 2022 120 560 568 10.1016/j.fsi.2021.12.035 34958920 76. Liu X.F. Shao J.H. Liao Y.T. Wang L.N. Jia Y. Dong P.J. Liu Z.Z. He D.D. Li C. Zhang X. Regulation of short-chain fatty acids in the immune system Front. Immunol. 2023 14 1186892 10.3389/fimmu.2023.1186892 37215145 PMC10196242 77. Tan J.K. Macia L. Mackay C.R. Dietary Fiber and SCFAs in the Regulation of Mucosal Immunity J. Allergy Clin. Immunol. 2023 151 47 53 10.1016/j.jaci.2022.11.007 36543697 78. Schilderink R. Verseijden C. Seppen J. Muncan V. van den Brink G.R. Lambers T.T. van Tol E.A. de Jonge W.J. The SCFA butyrate stimulates the epithelial production of retinoic acid via inhibition of epithelial hdac Am. J. Physiol. Gastrointest. Liver Physiol. 2016 310 G1138 G1146 10.1152/ajpgi.00411.2015 27151945 79. Gisevius B. Duscha A. Poschmann G. Stühler K. Motte J. Fisse A.L. Augustyniak S. Rehm A. Renk P. Böse C. Propionic acid promotes neurite recovery in damaged multiple sclerosis neurons Brain Commun 2024 6 fcae182 10.1093/braincomms/fcae182 38894951 PMC11184351 80. Yeşilyurt N. Yılmaz B. Ağagündüz D. Capasso R. Involvement of probiotics and postbiotics in the immune system modulation Biologics 2021 1 89 110 10.3390/biologics1020006 81. Kumar R. Dharumadurai D. Dietary Supplementation and Immunomodulatory Activity of Postbiotics in Fish Springer New York, NY, USA 2024 10.1007/978-1-0716-3421-9_43 82. Farhana A. Khan Y.S. Biochemistry, Lipopolysaccharide StatPearls Petersburg, FL, USA 2020 10.1051/ocl/2020025 32119301 83. Phillips N.J. Adin D.M. Stabb E.V. McFall-Ngai M.J. Apicella M.A. Gibson B.W. The lipid a from Vibrio fischeri J. Biol. Chem. 2011 286 21203 21219 10.1074/jbc.M111.239475 21498521 PMC3122182 84. Di Lorenzo F. The Lipopolysaccharide Lipid A Structure from the marine sponge-associated bacterium Pseudoalteromonas Antonie van Leeuwenhoek Int. J. Gen. Mol. Microbiol. 2017 110 1401 1412 10.1007/s10482-017-0865-z 28364252 85. Krasikova I.N. Kapustina N.V. Isakov V.V. Dmitrenok A.S. Dmitrenok P.S. Gorshkova N.M. Solov’eva T.F. Detailed Structure of Lipid A isolated from lipopolysaccharide from the Marine Proteobacterium marinomonas vaga Eur. J. Biochem. 2004 271 2895 2904 10.1111/j.1432-1033.2004.04212.x 15233786 86. Matsuura M. Structural modifications of bacterial lipopolysaccharide that facilitate gram-negative bacteria evasion of host innate immunity Front. Immunol. 2013 4 109 10.3389/fimmu.2013.00109 23745121 PMC3662973 87. Liu J. Kang R. Tang D. Lipopolysaccharide delivery systems in innate immunity Trends Immunol. 2024 45 274 287 10.1016/j.it.2024.02.003 38494365 88. Beutler B. Endotoxin, Toll-like Receptor 4, and the afferent limb of innate immunity Curr. Opin. Microbiol. 2000 3 23 28 10.1016/S1369-5274(99)00046-6 10679425 89. Golwankar A. Pawar R. Tibile R. Sawant S. In Silico characterization, homology modelling and structure-based functional annotation of Labeo rohita Int. J. Adv. Biochem. Res. 2024 8 10 19 10.33545/26174693.2024.v8.i1a.277 90. Loes A.N. Hinman M.N. Farnsworth D.R. Miller A.C. Guillemin K. Harms M.J. Identification and Characterization of Zebrafish Tlr4 Coreceptor Md-2 J. Immunol. 2021 206 1046 1057 10.4049/jimmunol.1901288 33472906 PMC7889624 91. Huang R. Dong F. Jang S. Liao L. Zhu Z. Wang Y. Isolation and Analysis of a Novel Grass Carp Toll-like Receptor 4 (Tlr4) Gene Cluster Involved in the Response to Grass Carp Reovirus Dev. Comp. Immunol. 2012 38 383 388 10.1016/j.dci.2012.06.002 22721904 92. Nie L. Cai S.Y. Shao J.Z. Chen J. Toll-Like Receptors, associated biological roles, and signaling networks in non-mammals Front. Immunol. 2018 9 1523 10.3389/fimmu.2018.01523 30034391 PMC6043800 93. Sepulcre M.P. Alcaraz-Pérez F. López-Muñoz A. Roca F.J. Meseguer J. Cayuela M.L. Mulero V. Evolution of Lipopolysaccharide (LPS) recognition and signaling: Fish TLR4 does not recognize LPS and negatively regulates NF-ΚB activation J. Immunol. 2009 182 1836 1845 10.4049/jimmunol.0801755 19201835 94. Lu X.J. Ning Y.J. Liu H. Nie L. Chen J. A Novel lipopolysaccharide recognition mechanism mediated by internalization in teleost macrophages Front. Immunol. 2018 9 2758 10.3389/fimmu.2018.02758 30542348 PMC6277787 95. Martínez-López A. Tyrkalska S.D. Alcaraz-Pérez F. Cabas I. Candel S. Martínez Morcillo F.J. Sepulcre M.P. García-Moreno D. Cayuela M.L. Mulero V. Evolution of LPS recognition and signaling: The bony fish perspective Dev. Comp. Immunol. 2023 145 104710 10.1016/j.dci.2023.104710 37080369 96. Olvera-Rosales L.B. Cruz-Guerrero A.E. Ramírez-Moreno E. Quintero-Lira A. Contreras-López E. Jaimez-Ordaz J. Castañeda-Ovando A. Añorve-Morga J. Calderón-Ramos Z.G. Arias-Rico J. Impact of the gut microbiota balance on the health-disease relationship: The importance of consuming probiotics and prebiotics Foods 2021 10 1261 10.3390/foods10061261 34199351 PMC8230287 97. Panitsidis I. Barbe F. Chevaux E. Giannenas I. Demey V. Probiotics, Prebiotics, Paraprobiotics, Postbiotics Sustainable Use of Feed Additives in Livestock: Novel Ways for Animal Production Georgios A. Giannenas I. Springer International Publishing Cham, Switzerland 2023 173 227 10.1007/978-3-031-42855-5_8 978-3-031-42855-5 98. Danladi Y. Loh T.C. Foo H.L. Akit H. Tamrin N.A.M. Naeem A.M. Impact of feeding postbiotics and paraprobiotics produced from Lactiplantibacillus plantarum Front. Vet. Sci. 2022 9 859284 10.3389/fvets.2022.859284 35425828 PMC9001976 99. Ryu S. Kyoung H. Park K.I. Oh S. Song M. Kim Y. Postbiotic heat-killed Lactobacilli AMB Express 2022 12 83 10.1186/s13568-022-01424-8 35767074 PMC9243212 100. Wang Y. Dai A. Huang S. Kuo S. Shu M. Tapia C.P. Yu J. Two A. Zhang H. Gallo R.L. Propionic Acid and Its Esterified Derivative Suppress the Growth of Methicillin-Resistant Staphylococcus aureus Benef. Microbes 2014 5 161 168 10.3920/BM2013.0031 24686580 101. Vital M. Karch A. Pieper D.H. Colonic Butyrate-Producing Communities in Humans: An Overview Using Omics Data mSystems 2017 2 e00130-17 10.1128/mSystems.00130-17 29238752 PMC5715108 102. Scott E. De Paepe K. Van de Wiele T. Postbiotics and their health modulatory biomolecules Biomolecules 2022 12 1640 10.3390/biom12111640 36358990 PMC9688025 103. Latorre J.D. Hernandez-Velasco X. Wolfenden R.E. Vicente J.L. Wolfenden A.D. Menconi A. Bielke L.R. Hargis B.M. Tellez G. Evaluation and selection of Bacillus Front. Vet. Sci. 2016 3 95 10.3389/fvets.2016.00095 27812526 PMC5071321 104. Jeong J.S. Kim I.H. Effect of Bacillus subtilis Poult. Sci. 2014 93 3097 3103 10.3382/ps.2014-04086 25260523 105. García-Márquez J. Díaz A.G. Molina-Roque L. Domínguez-Maqueda M. de las Heras V. Simó-Mirabet P. Vizcaíno A.J. Martos-Sitcha J.A. Alarcón-López F.J. Moriñigo M.Á. Microalgal and cyanobacterial biomasses modified the activity of extracellular products from Bacillus pumilus Probiotics Antimicrob Proteins 2024 16 10.1007/s12602-024-10350-z PMC12405380 39259377 106. Rajakovich L.J. Balskus E.P. Metabolic functions of the human gut microbiota: The role of metalloenzymes Nat. Prod. Rep. 2019 36 593 625 10.1039/C8NP00074C 30452039 PMC7771511 107. Loh T.C. Thanh N.T. Foo H.L. Hair-Bejo M. Azhar B.K. feeding of different levels of metabolite combinations produced by Lactobacillus plantarum Anim. Sci. J. 2010 81 205 214 10.1111/j.1740-0929.2009.00701.x 20438502 108. Vicente F. Campo-Celada M. Menéndez-Miranda M. García-Rodríguez J. Martínez-Fernández A. Effect of postbiotic supplementation on nutrient digestibility and milk yield during the transition period in dairy cows Animals 2024 14 2359 10.3390/ani14162359 39199893 PMC11350806 109. Izuddin W.I. Loh T.C. Samsudin A.A. Foo H.L. Humam A.M. Shazali N. Effects of postbiotic supplementation on growth performance, ruminal fermentation and microbial profile, blood metabolite and GHR, IGF-1 and MCT-1 gene expression in post-weaning lambs BMC Vet. Res. 2019 15 315 10.1186/s12917-019-2064-9 31477098 PMC6719353 110. Kim S.W. Duarte M.E. Saccharomyces Anim. Biosci. 2024 37 1463 1473 10.5713/ab.23.0467 38419538 PMC11222863 111. Danladi Y. Loh T.C. Foo H.L. Akit H. Tamrin N.A.M. Azizi M.N. Effects of postbiotics and paraprobiotics as replacements for antibiotics on growth performance, carcass characteristics, small intestine histomorphology, immune status and hepatic growth gene expression in broiler chickens Animals 2022 12 917 10.3390/ani12070917 35405905 PMC8997137 112. Saeed M. Afzal Z. Afzal F. Khan R.U. Elnesr S.S. Alagawany M. Chen H. Use of postbiotic as growth promoter in poultry industry: A review of current knowledge and future prospects Food Sci. Anim. Resour. 2023 43 1111 1127 10.5851/kosfa.2023.e52 37969321 PMC10636223 113. Kvakova M. Kamlarova A. Stofilova J. Benetinova V. Bertkova I. Probiotics and postbiotics in colorectal cancer: Prevention and complementary therapy World J. Gastroenterol. 2022 28 3370 3382 10.3748/wjg.v28.i27.3370 36158273 PMC9346452 114. Chuah L.O. Foo H.L. Loh T.C. Mohammed Alitheen N.B. Yeap S.K. Abdul Mutalib N.E. Abdul Rahim R. Yusoff K. Postbiotic metabolites produced by Lactobacillus plantarum BMC Complement. Altern. Med. 2019 19 114 10.1186/s12906-019-2528-2 31159791 PMC6547513 115. King J. Patel M. Chandrasekaran S. Metabolism, HDACs, and HDAC Inhibitors: A systems biology perspective Metabolites 2021 11 792 10.3390/metabo11110792 34822450 PMC8620738 116. Asoudeh-Fard A. Beygi M.Y. Parsaei A. Mohkam M. Asoudeh-Fard M. Gholami A. Postbiotic metabolites derived from Lactobacillus fermentum BMC Complement. Med. Ther. 2024 24 420 10.1186/s12906-024-04730-9 39707317 PMC11661024 117. Banday A.H. Azha N.U. Farooq R. Sheikh S.A. Ganie M.A. Parray M.N. Mushtaq H. Hameed I. Lone M.A. Exploring the potential of marine natural products in drug development: A comprehensive review Phytochem. Lett. 2024 59 124 135 10.1016/j.phytol.2024.01.001 118. Lauritano C. Coppola D. Biodiversity, adaptation strategies, and opportunities in extreme marine environments J. Mar. Sci. Eng. 2023 11 2367 10.3390/jmse11122367 119. Qu X.B. Su Z.M. Hu D.H. Bao Y.L. Meng X.Y. Wu Y. Li Y.X. Studies on molecular structure of hypericin and its interactions with HIV-1 protease by molecular modeling Gaodeng Xuexiao Huaxue Xuebao Chem. J. Chin. Univ. 2009 30 1402 120. Oh K.K. Yoon S.J. Song S.H. Park J.H. Kim J.S. Kim M.J. Kim D.J. Suk K.T. A Scheme to underpin key mediator(s) in salinosporamide(s) against pan-tumor via systems biology concept J. Transl. Med. 2024 22 492 10.1186/s12967-024-05299-0 38789990 PMC11127429 121. Kwang S.A. Sethi G. Chao T.H. Neuteboom S.T.C. Chaturvedi M.M. Palladino M.A. Younes A. Aggarwal B.B. Salinosporamide a (NPI-0052) potentiates apoptosis, suppresses osteoclastogenesis, and inhibits invasion through down-modulation of NF-ΚB-Regulated gene products Blood 2007 110 2286 2295 10.1182/blood-2007-04-084996 17609425 PMC1988928 122. Craig R.K. Marine Biodiversity: Challenges, Trends, and a New Treaty Environ. Law 2023 53 343 381 123. Chen G. Seukep A.J. Guo M. Recent Advances in Molecular Docking for the Research and Discovery of Potential Marine Drugs Mar. Drugs 2020 18 545 10.3390/md18110545 33143025 PMC7692358 124. Rey-Velasco X. Lucena T. Belda A. Gasol J.M. Sánchez O. Arahal D.R. Pujalte M.J. Genomic and Phenotypic Characterization of 26 Novel Marine Bacterial Strains with Relevant Biogeochemical Roles and Widespread Presence across the Global Ocean Front. Microbiol. 2024 15 1407904 10.3389/fmicb.2024.1407904 38863746 PMC11165706 125. Li Y. Hablützel P.I. Liu Z. Van Acker E. Janssen C.R. Asselman J. De Rijcke M. Seasonal Dynamics of Bacterial Community Structure and Function in the Surf Zone Seawater of a Recreational Beach in Ostend, Belgium Environ. Microbiol. Rep. 2024 16 e70031 10.1111/1758-2229.70031 39513461 PMC11544449 126. Giner-Lamia J. Huerta-Cepas J. Exploring the Sediment-Associated Microbiota of the Mar Menor Coastal Lagoon Front. Mar. Sci. 2024 11 1319961 10.3389/fmars.2024.1319961 127. Kanika N.H. Liaqat N. Chen H. Ke J. Lu G. Wang J. Wang C. Fish gut microbiome and its application in aquaculture and biological conservation Front. Microbiol. 2024 15 1521048 10.3389/fmicb.2024.1521048 39839099 PMC11747440 128. Kumar M. Devi W.M. Choudhury T.G. Kamilya D. Monsang S.J. Irungbam S. Saha R.K. Unraveling the bioactivities and immunomodulatory potential of postbiotics derived from Bacillus subtilis B. amyloliquefaciens Probiotics Antimicrob Proteins 2025 17 10.1007/s12602-025-10528-z 40186049 129. Khan M.I.R. Kamilya D. Choudhury T.G. Rathore G. Dietary administration of a host-gut derived probiotic Bacillus amyloliquefaciens Labeo rohita Aeromonas hydrophila Aquaculture 2022 546 737390 10.1016/j.aquaculture.2021.737390 130. Sawhney S. Mishra J.K. bioactive potential of bacterial endosymbionts isolated from Lamellodysidea herbacea J. Appl. Pharm. Sci. 2019 9 1 8 10.7324/japs.2019.90301 131. Gao X.Y. Liu Y. Miao L.L. Li E.W. Hou T.T. Liu Z.P. Mechanism of anti-vibrio activity of marine probiotic strain Bacillus pumilus AMB Express 2017 7 23 10.1186/s13568-017-0323-3 28097594 PMC5241254 132. García-Márquez J. Domínguez-Maqueda M. Torres M. Cerezo I.M. Ramos E. Alarcón F.J. Mancera J.M. Martos-Sitcha J.A. Moriñigo M.Á. Balebona M.C. Potential Effects of microalgae-supplemented diets on the growth, blood parameters, and the activity of the intestinal microbiota in Sparus aurata Mugil cephalus Fishes 2023 8 409 10.3390/fishes8080409 133. Khan M.I.R. Choudhury T.G. Kamilya D. Monsang S.J. Parhi J. Characterization of Bacillus Labeo rohita Aquac. Res. 2021 52 822 830 10.1111/are.14937 134. Hariharan P. Naik C. Potential antimicrobial activity of Bacillus Subtilis World J. Sci. Technol. 2012 2 128 131 135. Ruiz-García C. Béjar V. Martínez-Checa F. Llamas I. Quesada E. Bacillus velezensis Int. J. Syst. Evol. Microbiol. 2005 55 191 195 10.1099/ijs.0.63310-0 15653875 136. Zhou Y. Chen H. Yu B. Chen G. Liang Z. purification and characterization of a fibrinolytic enzyme from marine Bacillus velezensis Microorganisms 2022 10 843 10.3390/microorganisms10050843 35630289 PMC9145925 137. Teasdale M.E. Liu J. Wallace J. Akhlaghi F. Rowley D.C. Secondary metabolites produced by the marine bacterium Halobacillus salinus Appl. Environ. Microbiol. 2009 75 567 572 10.1128/AEM.00632-08 19060172 PMC2632121 138. Ghareeb A. Fouda A. Kishk R.M. El Kazzaz W.M. Unlocking the therapeutic potential of bioactive exopolysaccharide produced by marine actinobacterium Streptomyces vinaceusdrappus Int. J. Biol. Macromol. 2024 276 133861 10.1016/j.ijbiomac.2024.133861 39029838 139. Quintanilla-Pineda M. Ibañez F.C. Garrote-Achou C. Marzo F. A Novel postbiotic product based on Weissella cibaria Animals 2024 14 744 10.3390/ani14050744 38473129 PMC10930836 140. Quintanilla-Pineda M. Achou C.G. Díaz J. Gutiérrez-Falcon A. Bravo M. Herrera-Muñoz J.I. Peña-Navarro N. Alvarado C. Ibañez F.C. Marzo F. In vitro evaluation of postbiotics produced from bacterial isolates obtained from rainbow trout and nile tilapia against the pathogens Yersinia ruckeri Aeromonas salmonicida Salmonicida. Foods 2023 12 861 10.3390/foods12040861 36832935 PMC9957526 141. Arijo S. Brunt J. Chabrillón M. Díaz-Rosales P. Austin B. Subcellular Components of Vibrio harveyi Oncorhynchus mykiss V. harveyi J. Fish. Dis. 2008 31 579 590 10.1111/j.1365-2761.2008.00932.x 18482381 142. Mostafa Y.S. Alamri S.A. Alfaifi M.Y. Alrumman S.A. Elbehairi S.E.I. Taha T.H. Hashem M. L-Glutaminase synthesis by marine Halomonas meridiana Molecules 2021 26 1963 10.3390/molecules26071963 33807313 PMC8037810 143. Deberardinis R.J. Cheng T. Q’s next: The diverse functions of glutamine in metabolism, cell biology and cancer Oncogene 2010 29 313 324 10.1038/onc.2009.358 19881548 PMC2809806 144. Kim H.J. Park J.G. Moon K.S. Bin Jung S. Kwon Y.M. Kang N.S. Kim J.H. Nam S.J. Choi G. Baek Y.B. Identification and characterization of a marine bacterium extract from Mameliella Influenza Arch. Virol. 2024 169 41 10.1007/s00705-024-05979-8 38326489 PMC10850258 145. Wu M.N. Xu Y.J. Shao M.M. Wang Z.Y. Cao J.Y. Xu J.L. Pseudoalteromonas flavipulchra Vibrio pathogens Front. Mar. Sci. 2024 11 1492142 10.3389/fmars.2024.1492142 146. Sonnenschein E.C. Stierhof M. Goralczyk S. Vabre F.M. Pellissier L. Hanssen K.Ø. de la Cruz M. Díaz C. de Witte P. Copmans D. Pseudochelin A, a Siderophore of Pseudoalteromonas piscicida Tetrahedron 2017 73 2633 2637 10.1016/j.tet.2017.03.051 147. Supardy N.A. Ibrahim D. Nor S.R.M. Noordin W.N.M. Bioactive Compounds of Pseudoalteromonas Vibrio alginolyticus Pol. J. Microbiol. 2019 68 21 33 10.21307/pjm-2019-003 31050250 PMC7256726 148. Cusano A. Parrilli E. Marino G. Tutino M.L. A novel genetic system for recombinant protein secretion in the antarctic Pseudoalteromonas haloplanktis Microb. Cell Fact. 2006 5 40 10.1186/1475-2859-5-40 17169153 PMC1766363 149. Casillo A. Papa R. Ricciardelli A. Sannino F. Ziaco M. Tilotta M. Selan L. Marino G. Corsaro M.M. Tutino M.L. Anti-biofilm activity of a long-chain fatty aldehyde from antarctic Pseudoalteromonas haloplanktis Front. Cell Infect. Microbiol. 2017 7 46 10.3389/fcimb.2017.00046 28280714 PMC5322152 150. Varela J.L. Ruiz-Jarabo I. Vargas-Chacoff L. Arijo S. León-Rubio J.M. García-Millán I. Martín del Río M.P. Moriñigo M.A. Mancera J.M. Dietary administration of probiotic pdp11 promotes growth and improves stress tolerance to high stocking density in Gilthead Seabream Sparus auratus Aquaculture 2010 309 265 271 10.1016/j.aquaculture.2010.09.029 151. Jurado J. Villasanta-González A. Tapia-Paniagua S.T. Balebona M.C. García de la Banda I. Moríñigo M.Á. Prieto-Álamo M.J. Dietary administration of the probiotic shewanella putrefaciens pdp11 promotes transcriptional changes of genes involved in growth and immunity in Solea senegalensis Fish. Shellfish. Immunol. 2018 77 350 363 10.1016/j.fsi.2018.04.018 29635066 152. Vidal S. Tapia-Paniagua S.T. Moriñigo J.M. Lobo C. García de la Banda I. Balebona M.d.C. Moriñigo M.Á. Effects on Intestinal Microbiota and Immune Genes of Solea senegalensis Shewanella putrefaciens Fish. Shellfish. Immunol. 2016 58 274 283 10.1016/j.fsi.2016.09.010 27623340 153. García de La Banda I. Lobo C. León-Rubio J.M. Tapia-Paniagua S. Balebona M.C. Moriñigo M.A. Moreno-Ventas X. Lucas L.M. Linares F. Arce F. Influence of two closely related probiotics on juvenile Senegalese Sole ( Solea senegalensis Photobacterium damselae Piscicida. Aquaculture 2010 306 281 288 10.1016/j.aquaculture.2010.05.008 154. Tapia-Paniagua S.T. Vidal S. Lobo C. García de la Banda I. Esteban M.A. Balebona M.C. Moriñigo M.A. Dietary administration of the probiotic SpPdp11: Effects on the intestinal microbiota and immune-related gene expression of farmed Solea senegalensis Fish. Shellfish. Immunol. 2015 46 449 458 10.1016/j.fsi.2015.07.007 26190256 155. Cerezo I.M. Pérez-Gómez O. Bautista R. Seoane P. Esteban M.Á. Balebona M.C. Moriñigo M.A. Tapia-Paniagua S.T. SpPdp11 administration in diet modified the transcriptomic response and its microbiota associated in mechanically induced wound Sparus aurata Animals 2023 13 193 10.3390/ani13020193 36670734 PMC9854838 156. Moreno P. Álvarez-Torres D. Balebona M.C. Domínguez-Maqueda M. Moriñigo M.Á. Béjar J. Alonso M.C. García-Rosado E. Inhibition of Nervous Necrosis Virus Replication by Shewanella putrefaciens Aquaculture 2023 575 739812 10.1016/j.aquaculture.2023.739812 157. Domínguez-Maqueda M. García-Márquez J. Tapia-Paniagua S.T. González-Fernández C. Cuesta A. Espinosa-Ruíz C. Esteban M.Á. Alarcón F.J. Balebona M.C. Moriñigo M.Á. Evaluation of the differential postbiotic potential of Shewanella putrefaciens Mar. Biotechnol. 2024 26 1 18 10.1007/s10126-023-10271-y 38153608 PMC10869407 158. Domínguez-Maqueda M. Cerezo I.M. Tapia-Paniagua S.T. De La Banda I.G. Moreno-Ventas X. Moriñigo M.Á. Balebona M.C. A Tentative study of the effects of heat-inactivation of the probiotic strain Shewanella putrefaciens Solea senegalensis Microorganisms 2021 9 808 10.3390/microorganisms9040808 33921253 PMC8070671 159. Medina A. García-Márquez J. Moriñigo M.Á. Arijo S. Effect of the potential probiotic Vibrio proteolyticus Solea senegalensis Photobacterium damselae Piscicida and Vibrio harveyi. Fishes 2023 8 344 10.3390/fishes8070344 160. García-Márquez J. Vizcaíno A.J. Barany A. Galafat A. Acién G. Figueroa F.L. Alarcón F.J. Mancera J.M. Martos-Sitcha J.A. Arijo S. Evaluation of the Combined Administration of Chlorella fusca Vibrio proteolyticus Chelon labrosus Animals 2023 13 589 10.3390/ani13040589 36830376 PMC9951767 161. García-Márquez J. Álvarez-Torres D. Cerezo I.M. Domínguez-Maqueda M. Figueroa F.L. Alarcón F.J. Acién G. Martínez-Manzanares E. Abdala-Díaz R.T. Béjar J. Combined Dietary Administration of Chlorella fusca Vibrio proteolyticus Chelon labrosus Animals 2023 13 3325 10.3390/ani13213325 37958080 PMC10648860 162. Pérez-Gómez O. Rohra-Benítez S. Domínguez-Maqueda M. Cerezo I.M. Galafat A. Martínez-Manzanares E. Mancera J.M. Alarcón-López F.J. García-Márquez J. Moriñigo M.Á. Dietary Administration of Postbiotics from Vibrio proteolyticus Sparus aurata Animals 2025 15 1982 10.3390/ani15131982 40646881 PMC12248857 163. Quach N.T. Vu T.H.N. Nguyen N.A. Nguyen V.T. Bui T.L. Ky S.C. Le T.L. Hoang H. Ngo C.C. Le T.T.M. Phenotypic features and analysis of genes supporting probiotic action unravel underlying perspectives of Bacillus velezensis Ann. Microbiol. 2021 71 36 10.1186/s13213-021-01646-4 Figure 1 Different types of postbiotics and their primary biological effects and mechanisms of action. Figure created by the authors using https://BioRender.com ",
  "metadata": {
    "Title of this paper": "Phenotypic features and analysis of genes supporting probiotic action unravel underlying perspectives of ",
    "Journal it was published in:": "Marine Drugs",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12471580/"
  }
}