{
  "title": "Paper_905",
  "abstract": "pmc BMC Health Serv Res BMC Health Serv Res 34 bmchsr BMC Health Services Research 1472-6963 BMC PMC12487500 PMC12487500.1 12487500 12487500 41034850 10.1186/s12913-025-13289-1 13289 1 Research Identification of the implementation influencing factors of the organized breast cancer screening in Ordos city: from caregivers’ perspectives Cai Ziting 1 Ding Hanyue 1 Wang Sumeng 2 Yan Huijiao 1 Cao Na 3 Zhang Yongdong 4 http://orcid.org/0000-0001-6380-0871 Qiao Youlin qiaoy@cicams.ac.cn 1 Wang Chen wangchen@pumc.edu.cn 1 1 https://ror.org/02drdmm93 grid.506261.6 0000 0001 0706 7839 School of Population Medicine and Public Health, Chinese Academy of Medical Sciences, Peking Union Medical College, 2 https://ror.org/02drdmm93 grid.506261.6 0000 0001 0706 7839 National Cancer Center/National Clinical Research Center for Cancer/Cancer Hospital, Chinese Academy of Medical Sciences and Peking Union Medical College, 3 4 1 10 2025 2025 25 478160 1260 4 12 2023 23 7 2025 01 10 2025 02 10 2025 03 10 2025 © The Author(s) 2025 2025 https://creativecommons.org/licenses/by-nc-nd/4.0/ Open Access http://creativecommons.org/licenses/by-nc-nd/4.0/ Background An organized breast cancer screening program has been introduced by the local government in Ordos City since 2010. Women between 35 and 64 years are eligible to be screened freely at local maternal and child healthcare hospitals. The screening coverage rate in Ordos City is relatively higher than the national average level. However, the overall breast cancer detection rate remains low. This study aims to identify contextual influencing factors of this program from local maternal and child healthcare hospitals’ perspectives and provide suggestions for screening service improvement in Ordos City. Methods We conducted a qualitative study to evaluate the implementation of the organized breast cancer screening program from maternal and child healthcare hospitals’ perspectives in Ordos City. Four domains ( outer setting inner setting individuals and process Results A total of 28 individuals participated in our study. We found that the implementation of the organized breast cancer screening in Ordos City went well. Policies & laws partnerships & connections performance-measurement pressure implementation leads teaming engaging Available resources Access to knowledge & information doing Conclusions We recommend that Ordos City further facilitates the prompt referral for imaging and biopsy, promotes the capacity building of primary health workers, and strengthens the construction of electronic systems. Future quantitative studies are necessary to comprehend the knowledge and attitudes of caregivers and target population toward breast cancer screening. Interviews with other stakeholders, such as policymakers and target population, are also needed. Supplementary Information The online version contains supplementary material available at 10.1186/s12913-025-13289-1. Keywords Breast cancer screening CFIR Low-resource settings Implementation science Facilitators and barriers Chinese Academy of Medical Sciences Medical and Health Science and Technology Innovation Project for Serving the \"Belt and Road\" Initiative 2017–I2M–B&R–03 2017–I2M–B&R–03 2017–I2M–B&R–03 2017–I2M–B&R–03 2017–I2M–B&R–03 2017–I2M–B&R–03 Cai Ziting Ding Hanyue Wang Sumeng Yan Huijiao Qiao Youlin Wang Chen Tencent Foundation pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement yes pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes issue-copyright-statement © BioMed Central Ltd., part of Springer Nature 2025 Background Breast cancer is the most common cancer and the leading cause of cancer death among women globally [ 1 2 3 4 5 6 7 8 9 11 12 13 14 16 17 Considering the feasibility of mammography application, such as cost, radiation, and breast density, China is currently implementing an ultrasound-based modality to screen breast cancer [ 18 19 Ordos, a city in the Inner Mongolia Autonomous Region, is a multiethnic region dominated by Mongols. The local government has provided women Living in this region with free two-cancer screening services since 2016 [ 20 Health outcomes from 2016 to 2020, such as screening coverage rate and breast cancer detection rate, have been calculated and analyzed [ 21 22 5 5 9 21 Methods We reported our study following the Consolidated Criteria for Reporting Qualitative Studies (COREQ) checklist (Table S 1 Selection and description of CFIR constructs The Consolidated Framework for Implementation Research (CFIR) is often used to guide investigators in identifying factors influencing implementation progress and effectiveness. In 2009, Damschroder et al. summarized 19 theories, frameworks, and models applied in health services research, and finally integrated them into a meta-theoretical framework, CFIR [ 23 24 25 26 27 28 29 30 CFIR is composed of five Major domains and 48 constructs [ 24 outer setting inner setting individuals process local conditions policies & laws partnerships & connections performance-measurement pressure available resources access to knowledge & information implementation leads teaming engaging doing 1 inner setting individuals Table 1 The description of CFIR constructs selected Domains Constructs Descriptions Outer setting Policies & laws Are there any supporting policies? Partnerships & connections What are the partnerships of MCH hospitals with external sectors? Performance-measurement pressure How does the completion status of annual screening goals affect the performance of the organized BCS? Inner setting Available resources How many personnel and equipment are available in local MCH hospitals? Access to knowledge & information How much are BCS staff accessible to BCS-related knowledge and information? Individuals Implementation leads How much do the leaders in local MCH hospitals commit to BCS program? Process Teaming How are the screening teams in local MCH hospitals organized? Engaging What has been done to facilitate the participation of target population? Doing How are the organized BCS programs executed? (execution) How are suspected cases followed up? (follow-up) How is the data managed? (data management) Is there any quality control? (supervision) CFIR MCH BCS The outer setting inner setting individuals process Study participants and sampling The basic research units were primary screening sites, local MCH hospitals. Ordos City has nine districts/banners and each district/banner owns one MCH hospital. These nine MCH hospitals undertake the organized BCS program provided by the local government. We recruited people involved in the BCS implementation in local MCH hospitals, including heads of local MCH hospitals, two-cancer screening program managers, directors of the Department of Gynecology, Ultrasound, and Radiology, and other screening-related health workers or administrative staff. Considering that the condition in each district/banner varied, such as population density and land area, each MCH hospital recruited at least one study participant. Sampling methods included purposive sampling and snowball sampling. All participants were contacted in advance, and were voluntarily participated in this study. The sample size was determined according to the information saturation principle. We stopped the recruitment when no more new information was added. As for personnel statistics, respondents in this part included medical staff who can conduct CBE/BUS/MAM examination. Anyone who were not responsible for examination was excluded, such as nurses and administrative staff. Data collection We collected data from two sources: (1) individual interviews and focus groups, and (2) records and document review. In-depth interviews We conducted semi-structured in-depth interviews that were open-ended. Interviews followed the predesigned outline (Table S2). Interview places were interviewees’ offices or private spaces. We required quiet environment to guarantee free expression and avoid interruption. All participants joined our interviews voluntarily. Interviews were carried out in person by two of our research team members (ZC and SW). They were experienced in in-depth interviews, and had conducted mock interviews. One interviewer moderated the process and another interviewer took notes. Meanwhile, we recorded the interview process under the permission of our study participants. Audio documents were transcribed into text documents on the same day of interview by two interviewers. Text documents were then cross-checked by the same interviewers. Focus groups In order to improve the efficiency and reduce the inconvenience caused by interviews, focus group discussions were organized when multiple target participants shared common free time. We organized two focus groups (a 6-person group in Junger Banner and a 4-person group in Hangjin Banner). The same interview outline guided the discussions. Discussions were open-ended and participants were free to share their views. We hoped to obtain more information about the experiences and challenges of BCS delivery from their interactions. Two of our research team members (ZC and SW) performed as moderators and note-takers. Discussions were recorded under the permission of our study participants. Audio documents and notes were then transcribed into text documents. Records and document review We obtained governmental documents, BCS work plans, and annual screening goals from the Office Department. The actual number of screened women was extracted from the annual screening reports. Information of personnel and equipment (Table S3) was collected directly from the Department of Human Resources, Finance and Equipment. We also photographed equipment for verification with purchase records. Data analysis CIFR constructs were rated in both valence and strength factors [ 31 We use content analysis to process the interview materials. Two of our research team members (ZC and HD) coded the Chinese text documents by NVivo software (version 14). Codes with similar meanings were clustered to generate themes and sub-themes. Themes and sub-themes were translated into English and matched with CFIR constructs. They were then categorized into facilitators or barriers by two coders. Discrepancies were discussed between two coders till reach agreements. Quotations were used to support the interpretation of influencing factors in the results. Partnerships, screening team structure, target population engaging strategies, and screening workflow were displayed by flowcharts or maps. Results We conducted this qualitative study from March 2nd to March 31st, 2023. A total of 28 participants were recruited until data saturation. Their information were presented by replacing the name with English letters and numbers (e.g. P1). Personally identifiable information was removed to protect privacy. The participant list is provided in Supplemental file (Table S4). Approximately 82% ( n CFIR constructs were rated and influencing factors were summarized in Table 2 policies & laws implementation leads Table 2 CFIR construct rating of organized breast cancer screening program in Ordos Domains Constructs Ratings Facilitators Barriers Outer setting Policies & laws + 2 • Political commitment to cervical cancer elimination - Partnerships & connections + 2 * • Multisectoral collaboration - Performance-measurement pressure + 1 * • Rational screening goal-setting • Migration Inner setting Available resources 0 * • Ultrasound machines generally available • Half staff with adequate work experience and educational level • Mammography not generally available • Sonographers lacking breast-related knowledge • No breast surgeons Access to knowledge & information −1 * • Regular training • Wide information coverage • Limited professional training opportunities • Lack of content depth and timely updates Individuals Implementation leads + 2 • Specialized leadership - Process Teaming + 2 * • Structured screening teams - Engaging + 1 * • Various engaging strategies • Utilization of county-township-village networks • Difficulties in preparing brochures • Low awareness of target population • Culture difference Doing −1 * • Clearly articulated work plan • Inconsistent referral • Ambiguous feedback of detected abnormalities • Untimely data entry • Non-interoperable electronic systems * Outer setting Policies & laws There was favorable policy environment for two-cancer screenings in China. In line with the Cervical Cancer Elimination Initiative launched by the World Health Organization (WHO) on November 17, 2020, the NHC issued the Action Plan for Accelerated Elimination of Cervical Cancer (2023–2030). It was proposed that by 2025, the cervical cancer screening rate would reach 50%, and by 2030, it would reach 70%. Moreover, Chinese government has launched two-cancer screenings for women aged 35–64 and introduced this program in the national Public health services since 2009. The Government’s focus and commitment to eliminating cervical cancer has contributed significantly to the introduction and extension of the BCS. Explicit guidelines, clearly defined assessment indicators, and specific funds for the BCS were granted. Therefore, political commitment to cervical cancer elimination was recognized as a strong facilitator of the BCS implementation performance. Partnerships & connections Multisectoral involvement was identified as a facilitator. Figure 1  Fig. 1 Partnership map of MCH hospitals with external health or non-health sectors   “The participation of local Women’s Federation in health education releases our work pressure a lot.” (P7)  “Our banner is vast but sparsely populated. The number of ethnic minorities and farmers/herders is large and they are difficult to engage in screening. Minorities freelancers nonoccupational women and female farmers/herders are organized by their community or local labor union. In this way we can cover most target population to receive BCS in the region.” (P14) As primary screening sites, MCH hospitals delivered screening services to target population and accommodated medical suggestions. Any suspected case was recommended to refer to higher level hospitals for diagnosis. The Municipal Health Commission or Municipal MCH hospital supervised the screening program and processed quality control annually. Academic institutions provided technical support to achieve program sustainability. MCH hospitals were also linked to Public Security Bureau, Health Insurance Bureau, and Census Bureau for data retrieval. These data were used to master the distribution of target population and calculate the screening assessment indicators.  “We closely connect with the Municipal Health Commission Health Insurance Bureau Public Security Bureau etc. to obtain statistics for the calculation of annual assessment indicators. Some data is inaccessible due to the personal identifiability. So we need to communicate with them about what we want.” (P22) Performance-measurement pressure Rational screening goal-setting facilitated the screening performance. Cervical and breast cancer screening services were typically delivered concurrently. To simplify the calculation and implementation, the two-cancer screenings shared the same annual screening goals in Ordos City. Taking into account the population of local women aged 35–64, the municipal government and the Municipal Health Commission set the annual screening goals as shown in Table 3 Table 3 Completion of annual breast cancer screening goals in Ordos Total female population * Female population aged 35–64 * Screening goal (person/year) * Year Actual screening number (person/year) Completion rate (%) Ordos City 89.4 40.5 48,600 2021 39,166 80.59 2022 41,226 84.83 2023 59,488 122.40 Kangbashi District 2.8 1.2 1440 2021 1472 102.22 2022 1633 113.40 2023 2177 151.18 Dongsheng District 18.8 8.5 10,200 2021 7633 74.83 2022 6675 65.44 2023 11,357 111.34 Dalad Banner 18.1 8.3 9960 2021 9969 100.09 2022 9506 95.44 2023 12,170 122.19 Junggar Banner 16.2 7.0 8400 2021 7031 83.70 2022 7700 91.67 2023 9354 111.36 Otog Front Banner 4.0 1.9 2280 2021 1831 80.31 2022 2286 100.26 2023 3188 139.82 Otog Banner 5.7 2.7 3240 2021 2967 91.57 2022 3147 97.13 2023 2906 89.69 Hangjin Banner 8.1 3.8 4560 2021 2031 44.54 2022 2537 55.64 2023 3670 80.48 Uxin Banner 5.8 2.6 3120 2021 2363 75.74 2022 3018 96.73 2023 4368 140.00 Ejin Horo Banner 9.9 4.5 5400 2021 3869 71.65 2022 4724 87.48 2023 10,298 190.70 *  “The annual screening goals set by the government are calculated on the basis of the household population. However there is a large number of household females moving out for work resulting in an overestimated screening target number. The goal is hard for us to accomplish.” (FG2) Inner setting Available resources Available resources in this study contained both personnel and equipment. Its overall impact on the screening performance was neutral. Qualified screening staff and generally availability of ultrasound machines were examined as facilitators. Not fully covered mammography services, limited knowledge of sonographers on breast cancer, and no breast surgeons were considered barriers. As shown in Table 4 n n n n n n Table 4 Available resources of organized breast cancer screening program in Ordos Personnel N Equipment N CBE 24 (80.00) BUS 18 BUS 21 (70.00) MAM 7 MAM 6 (20.00) BUS Manufacturer Major Samsung 2 (11.11) Clinical medicine 9 (30.00) GE healthcare 3 (16.67) Medical imaging 16 (53.33) Mindray 4 (22.22) Nursing 2 (6.67) SonoScape 1 (5.56) Others 3 (10.00) Philips 8 (4.44) Professional title MAM Manufacturer Chief physician 2 (6.67) SINO MDT 5 (71.42) Associate chief physician 13 (43.33) United Imaging 1 (14.29) Attending doctor 8 (26.67) Hologic 1 (14.29) Others 7 (23.33) Source of funding Education level Government-funded 2 (8.00) Associate degree 14 (46.67) Research projects 7 (28.00) Bachelor’s degree or higher 16 (53.33) Self-funded 16 (64.00) Work experience Year of purchase < 5 years 9 (30.00) Before 2016 7 (28.00) 5–10 years 8 (26.67) After 2016 18 (72.00) > 10 years 13 (43.33) N CBE BCS MCH CBE BUS MAM There were no breast surgeons in any of the nine MCH hospitals. Most staff participating in the organized BCS were sonographers and nurses. Many mentioned that their main business was ultrasound prenatal examination and they comprehended little breast expertise. Moreover, all mammography machines were Purchased after 2019. Radiologists were admittedly inexperienced in MAM operation and image interpretation. Access to knowledge & information The training opportunities of screening staff were limited and appeared to negatively impact the screening performance. Regular training and wide information coverage were potential facilitators. Limited professional training opportunities and lack of content depth and timely updates were potential barriers. Screening staff were trained at least one time annually. There were management training and professional training, either online or offline. Program management training was typically the interpretation of work plans provided by the Municipal Health Commission or Municipal MCH hospital. Professional training was mainly theoretical lectures, including epidemiology, clinical examination methods, Breast Imaging-reporting and Data System (BI-RADS) report standards, etc. It was delivered by higher level hospitals or academies. Several sonographers stated their lack of breast-related knowledge and clinical skills, and expressed their desire for more on-site practices.  “We do not specialize in breast diseases. When it is hard to report BI-RADS categories we have no one for advice as our hospital has no breast experts. Our radiologists are also not experienced in mammography. I am looking forwards to more training opportunities in cancer hospitals and meeting with more cancer patients.” (P2) Individuals Implementation leads Specified leadership appeared to be a facilitator. MCH hospitals in Ordos City all designated persons to manage the organized BCS program. Their familiarity with the BCS significance and their personal dedication promoted the smooth running of this program. During the interviews, all leaders demonstrated their thorough understanding of the screening work plan. Many of them had endeavored to optimize the procedure and enlarge the screening coverage.   “Our hospital has no MAM. BUS-positive women are recommended to appoint MAM as a supplement. But its recall rate is low. We therefore consulted with local People’s Hospital and obtained their permission to build referral channel. Suspected cases were referred to local People’s Hospital to supplement MAM and even biopsy there. This helped to increase our recall rate.” (P16) Process Teaming Screening teams in all MCH hospitals shared explicit structures (Fig. 2  Fig. 2 Structure of a screening working group. The screening workflow contained several steps, such as engagement, health education, registration (including informed consent), survey, examination, information entry (including follow-up information), and quality control. Engagement such as call reminders were provided before women came to screen. Nurses guided the brief health education, registration, and survey. The survey before examination collected information such as history of breast diseases, family history of cancers, maternal history, menstrual conditions, and lifestyle to roughly evaluate the exposure to breast cancer risk factors. Gynecological examination and sampling of the HPV test were performed by two gynecologists. BUS examination was conducted by two sonographers (one for examination and one for report writing). Information entry into the electronic system were performed also by nurses. At the end, team leaders or one of the nurses took the obligation in quality control of the whole process  “The current team size is reasonable neither too small to undermine service quality nor too big to waste human resources.” (P17) Engaging There were mixed comments in target population engagement. Facilitators involved various engaging methods and utilization of county-township-village networks. Barriers included difficulties in preparing brochures, low awareness of target population, and culture difference. However, engagement is extensively recognized as a positive influencing factor. Figure 3  Fig. 3 Strategies to facilitate the screening uptake of target population  “Village doctors are working on the frontline to safeguard people’s health. By fully utilizing county-township-village network we can bring BCS service to women’s side.” (P28) However, problems were also noted during interviews. Some participants mentioned their difficulties in preparing brochures due to their limited time and experience. Moreover, participants generally agreed that target population were low in health awareness, and this intensively impeded the engagement. Ordos City had a large minority population. Language and cultural differences led to communication difficulties.   “We are not experienced in preparing of two-cancer screening brochures for dissemination and it is time-consuming. Thid work has crowded out our time for other businesses. We are now under pressure.”(P15)  “Women’s health literacy needs urgent improvement. Those who want to be screened come year after year but those who do not never come no matter how hard we try to persuade them.”(P3) Doing There were also mixed opinions on the execution of the organized BCS program. Clearly articulated work plan was regarded as a facilitator. Inconsistent referral, ambiguous feedback of detected abnormalities, untimely data entry, and non-interoperable electronic database were denoted as barriers. Considering that the negative comments outweighed the positive comments, the execution of this program was suggested as a negative influencing factor. The organized BCS program has been introduced in Ordos City for more than ten years. Its workflow was complete and legible, as shown in Fig. 4  Fig. 4 Breast cancer screening workflow in Ordos. Target population voluntarily signed the informed consent form, registered, and completed a survey. They then received BUS examination as the primary screening. Detected abnormalities would supplement Mammography. Mammogram-positive cases would be recommended for pathological biopsy and treatment accordingly. Their results were obtained by follow-up. BUS- or mammogram-negative ones would be suggested to attend screening every 2–3 years. Records including personal information, results of BUS examination, mammography, biopsy, and treatment were entered into the electronic system  “The BCS system and our HIS system are independent. In addition to this BCS program we also provide with opportunistic breast cancer screening and other ultrasound examinations. Frequent switching between systems complicates our work procedures.”(FG1) Discussion This study evaluated the implementation of the organized BCS program in Ordos City and recognized its potential influencing factors from MCH hospitals’ perspectives. We conducted this research in the context of the national two-cancer screenings for women aged 35-64 [ 19 20 Outer setting The outer setting 32 33 WHO Cervical Cancer Elimination Initiative proposed that each country should meet the 90-70-90 targets by 2030, which are 90% of girls fully vaccinated with the HPV vaccine by the age of 15; 70% of women screened using a high-performance test by the age of 35, and again by the age of 45; 90% of women with pre-cancer treated and 90% of women with invasive cancer managed [ 34 Apart from WHO Cervical Cancer Elimination Initiative, WHO also established Global Breast Cancer Initiative (GBCI) in 2021, with the hope to bring together stakeholders and reduce breast cancer [ 35 The establishment of partnerships with other health and non-health sectors profoundly achieved an effective division of obligation. It is helpful to reduce MCH hospitals’ pressure. Similar publications also document that multisectoral collaboration leverages limited resources and increases the efficiency of health delivery systems [ 36 37 Migration was identified as a barrier. Ordos City has a large number of out-migrant workers. They were regarded as part of the target population, but their needs might have been overlooked. It is advisable to inform and encourage this special group to undergo local screenings in their working cities. MCH hospitals should also follow up the results. Inner setting The inner setting 38 40 41 44 45 46 Individuals The individuals 47 48 Process The process 49 50 51 52 53 The quality of care delivery highly relies on the medical team structure and health care instructions. Babiker [ 54 Inconsistent referral was a major consideration in our study to hamper the screening performance. This was reported to attenuate the adherence of target population to following imaging or biopsy, and exacerbate diagnostic delays [ 55 Ordos City is taking the lead in two-cancer screenings in China. Its 5-year screening coverage rate of women aged 35–64 from 2016 to 2020 was higher than the national level during 2018-2019 [ 21 22 56 57 9 21 GBCI identified potential causes of deficits in breast-health systems and also found that lack of training, delays in biopsy, and delays in diagnosis were unfavorable for the performance of breast screening [ 58 Lessons learned from the implementation of the organized BCS program in Ordos City include (1) advocating for policy support; (2) bringing together multiple sectors, both health and non-health ones; (3) encouraging leadership input; and (4) building structured teams and articulated work plans. The needs for improvement in Ordos City include (1) strengthening the establishment of referral systems; (2) promoting the capacity building of primary health workers; and (3) enhancing the interactivity of electronic systems and information literacy of screening staff. The main strength of this study includes (1) providing insights into the implementation of BCS program in Ordos City from caregivers’ perspectives, and (2) generating in-depth understanding of its influencing factors by using qualitative methodology. There are potential limitations. Firstly, there is a lack of views from other stakeholders, such as policy makers and care recipients (target population). Secondly, interview participants subjectively believed that target population were low in health awareness, but we did not investigate individual awareness level on BCS. Quantitative studies are necessary to investigate the knowledge and attitudes of recipients toward BCS. Lastly, this study might overlooked the implementation needs. Some of identified barriers are hard to be improved in the setting. Conclusions The implementation of the organized BCS program in Ordos City went overall well from caregivers’ perspectives. Political commitment to cervical cancer elimination, multisectoral collaboration, specialized leadership, and structured screening teams are four main positive drivers contributing to the implementation of the organized BCS in Ordos City. All facilitators contribute to the relatively high screening coverage rate. Inconsistent referrals, underqualified professional competence of primary health workers, and non-interoperable electronic systems are the main barriers. They are supposed to affect the screening quality and cause difficulties in follow-up management. We recommend that Ordos City facilitates the prompt referral for imaging and biopsy, promotes the capacity building of primary health workers, and strengthens the construction of electronic systems. Supplementary Information  Supplementary Material 1. Abbreviations NHC National Health Commission BUS Breast ultrasound CBE Clinical breast examination HPV Human papillomavirus MCH Maternal and child healthcare BCS Breast cancer screening CFIR Consolidated Framework for Implementation Research FG Focus group Publisher’s Note Springer Nature remains neutral with regard to jurisdictional claims in published maps and institutional affiliations. Acknowledgements We would like to thank all the research team members, funders, and study participants. We would like to appreciate the support from all the nine MCH hospitals in Ordos City. Authors’ contributions Z.C. designed the study. Z.C., S.W., and H.Y. generated the interview outline and conducted interviews. N.C. and Y.Z. contacted study participants and provided information. Z.C. and H.D. coded the scripts and analyzed the data. Z.C. wrote the first draft. H.D. revised the manuscript. Y.Q. and C.W. provided advice and guidance. All the authors read and approved the final manuscript. Funding This study was supported by the Chongqing Tencent Sustainable Development Foundation through the project “Comprehensive Prevention and Control Demonstration Project for Eliminating Cervical Cancer and Breast Cancer in Low Health Resource Areas of China” (Project No. SD20240904145730). Data availability No datasets were generated or analysed during the current study. Declarations Ethics approval and consent to participate This study was approved by the research ethics committee of the Chinese Academy of Medical Sciences and Peking Union Medical College (approval number CAMS&PUMC-IEC-2022-059). Participation in this study was voluntary and we received informed consent from all the participants. All methods were carried out in accordance with the Declaration of Helsinki. Consent for publication Not applicable. Competing interests The authors declare no competing interests. References 1. International Agency for Research on Cancer. Global cancer observatory. Available at: https://gco.iarc.who.int/en 2. Han B Zheng R Zeng H Wang S Sun K Chen R Cancer incidence and mortality in China, 2022 J Natl Cancer Cent 2024 4 1 47 53 39036382 10.1016/j.jncc.2024.01.006 PMC11256708 Han B, Zheng R, Zeng H, Wang S, Sun K, Chen R, et al. Cancer incidence and mortality in China, 2022. J Natl Cancer Cent. 2024;4(1):47–53. 39036382 10.1016/j.jncc.2024.01.006 PMC11256708 3. Coleman C Early detection and screening for breast cancer Semin Oncol Nurs 2017 33 2 141 55 10.1016/j.soncn.2017.02.009 28365057 Coleman C. Early detection and screening for breast cancer. Semin Oncol Nurs. 2017;33(2):141–55. 28365057 10.1016/j.soncn.2017.02.009 4. Independent UK, Panel on Breast Cancer Screening The benefits and harms of breast cancer screening: an independent review Lancet 2012 380 9855 1778 86 10.1016/S0140-6736(12)61611-0 23117178 Independent UK, Panel on Breast Cancer Screening. The benefits and harms of breast cancer screening: an independent review. Lancet. 2012;380(9855):1778–86. 23117178 10.1016/S0140-6736(12)61611-0 5. Habel LA Capra AM Oestreicher N Greendale GA Cauley JA Bromberger J Mammographic density in a multiethnic cohort Menopause 2007 14 5 891 9 10.1097/gme.0b013e318032569c 17414171 Habel LA, Capra AM, Oestreicher N, Greendale GA, Cauley JA, Bromberger J, et al. Mammographic density in a multiethnic cohort. Menopause. 2007;14(5):891–9. 17414171 10.1097/gme.0b013e318032569c 6. El-Bastawissi AY White E Mandelson MT Taplin S Variation in mammographic breast density by race Ann Epidemiol 2001 11 4 257 63 10.1016/S1047-2797(00)00225-8 11306344 El-Bastawissi AY, White E, Mandelson MT, Taplin S. Variation in mammographic breast density by race. Ann Epidemiol. 2001;11(4):257–63. 11306344 10.1016/s1047-2797(00)00225-8 7. Black E Richmond R Improving early detection of breast cancer in sub-Saharan Africa: why mammography may not be the way forward Glob Health 2019 15 1 3 10.1186/s12992-018-0446-6 PMC6325810 30621753 Black E, Richmond R. Improving early detection of breast cancer in sub-Saharan Africa: why mammography may not be the way forward. Glob Health. 2019;15(1):3. 10.1186/s12992-018-0446-6 PMC6325810 30621753 8. Dan Q Zheng T Liu L Sun D Chen Y Ultrasound for breast cancer screening in resource-limited settings: current practice and future directions Cancers (Basel) 2023 15 7 2112 10.3390/cancers15072112 37046773 PMC10093585 Dan Q, Zheng T, Liu L, Sun D, Chen Y. Ultrasound for breast cancer screening in resource-limited settings: current practice and future directions. Cancers (Basel). 2023;15(7): 2112. 37046773 10.3390/cancers15072112 PMC10093585 9. Ma L Lian ZQ Zhao YX Di JL Song B Ren WH Breast ultrasound optimization process analysis based on breast cancer screening for 1501753 rural women in China Zhonghua Zhong Liu Za Zhi 2021 43 4 497 503 33902214 10.3760/cma.j.cn112152-20190828-00549 Ma L, Lian ZQ, Zhao YX, Di JL, Song B, Ren WH, et al. Breast ultrasound optimization process analysis based on breast cancer screening for 1501753 rural women in China. Zhonghua Zhong Liu Za Zhi. 2021;43(4):497–503. 33902214 10.3760/cma.j.cn112152-20190828-00549 10. Berg WA Bandos AI Mendelson EB Lehrer D Jong RA Pisano ED Ultrasound as the primary screening test for breast cancer: analysis from ACRIN 6666 J Natl Cancer Inst 2015 108 4 djv367 10.1093/jnci/djv367 26712110 PMC5943835 Berg WA, Bandos AI, Mendelson EB, Lehrer D, Jong RA, Pisano ED. Ultrasound as the primary screening test for breast cancer: analysis from ACRIN 6666. J Natl Cancer Inst. 2015;108(4): djv367. 26712110 10.1093/jnci/djv367 PMC5943835 11. Yang L Wang S Zhang L Sheng C Song F Wang P Performance of ultrasonography screening for breast cancer: a systematic review and meta-analysis BMC Cancer 2020 20 1 499 10.1186/s12885-020-06992-1 32487106 PMC7268243 Yang L, Wang S, Zhang L, Sheng C, Song F, Wang P, et al. Performance of ultrasonography screening for breast cancer: a systematic review and meta-analysis. BMC Cancer. 2020;20(1):499. 32487106 10.1186/s12885-020-06992-1 PMC7268243 12. Magnus MC Ping M Shen MM Bourgeois J Magnus JH Effectiveness of mammography screening in reducing breast cancer mortality in women aged 39–49 years: a meta-analysis J Womens Health (Larchmt) 2011 20 6 845 52 10.1089/jwh.2010.2098 21413892 Magnus MC, Ping M, Shen MM, Bourgeois J, Magnus JH. Effectiveness of mammography screening in reducing breast cancer mortality in women aged 39–49 years: a meta-analysis. J Womens Health (Larchmt). 2011;20(6):845–52. 21413892 10.1089/jwh.2010.2098 13. Lauby-Secretan B Scoccianti C Loomis D Benbrahim-Tallaa L Bouvard V Bianchini F Breast-cancer screening—viewpoint of the IARC working group N Engl J Med 2015 372 24 2353 8 10.1056/NEJMsr1504363 26039523 Lauby-Secretan B, Scoccianti C, Loomis D, Benbrahim-Tallaa L, Bouvard V, Bianchini F, et al. Breast-cancer screening—viewpoint of the IARC working group. N Engl J Med. 2015;372(24):2353–8. 26039523 10.1056/NEJMsr1504363 14. Shen S Zhou Y Xu Y Zhang B Duan X Huang R A multi-centre randomised trial comparing ultrasound vs mammography for screening breast cancer in high-risk Chinese women Br J Cancer 2015 112 6 998 1004 10.1038/bjc.2015.33 25668012 PMC4366890 Shen S, Zhou Y, Xu Y, Zhang B, Duan X, Huang R, et al. A multi-centre randomised trial comparing ultrasound vs mammography for screening breast cancer in high-risk Chinese women. Br J Cancer. 2015;112(6):998–1004. 25668012 10.1038/bjc.2015.33 PMC4366890 15. Melnikow J Fenton JJ Whitlock EP Miglioretti DL Weyrich MS Thompson JH Supplemental screening for breast cancer in women with dense breasts: a systematic review for the U.S. preventive services task force Ann Intern Med 2016 164 4 268 78 10.7326/M15-1789 26757021 PMC5100826 Melnikow J, Fenton JJ, Whitlock EP, Miglioretti DL, Weyrich MS, Thompson JH, et al. Supplemental screening for breast cancer in women with dense breasts: a systematic review for the U.S. preventive services task force. Ann Intern Med. 2016;164(4):268–78. 26757021 10.7326/M15-1789 PMC5100826 16. Pu H Peng J Xu F Liu N Wang F Huang X Ultrasound and clinical characteristics of false-negative results in mammography screening of dense breasts Clin Breast Cancer 2020 20 4 317 25 10.1016/j.clbc.2020.02.009 32229176 Pu H, Peng J, Xu F, Liu N, Wang F, Huang X, et al. Ultrasound and clinical characteristics of false-negative results in mammography screening of dense breasts. Clin Breast Cancer. 2020;20(4):317–25. 32229176 10.1016/j.clbc.2020.02.009 17. Fan L Strasser-Weippl K Li JJ St Louis J Finkelstein DM Yu KD Breast cancer in China Lancet Oncol 2014 15 7 e279 89 10.1016/S1470-2045(13)70567-9 24872111 Fan L, Strasser-Weippl K, Li JJ, St Louis J, Finkelstein DM, Yu KD, et al. Breast cancer in China. Lancet Oncol. 2014;15(7):e279–89. 24872111 10.1016/S1470-2045(13)70567-9 18. National Health Commission of the PRC. Breast cancer screening work plan. Available at: http://www.nhc.gov.cn/fys/s3581/202201/cad44d88acca4ae49e12dab9176ae21c/files/8bb19eea375f4edf80d9d01a1030d053.pdf 19. National Health Commission of the PRC. Management plan of two-cancer screening for rural women. Available at: http://www.gov.cn/zwgk/2009-06/30/content_1353784.htm 20. Ordos Municipal Health Commission. Implementing two-cancer prevention and treatment projects to protect women’s health - Ordos City is in action. Available at: http://wjw.ordos.gov.cn/zdzt/jkeedsxd/202109/t20210922_2999270.html 21. Ren W Yan H Dang L Yang H Yue Y Zhang Y Breast cancer screening in women aged 35–64 years in Ordos in 2016–2020 Chin Prev Med 2022 23 9 698 704 Ren W, Yan H, Dang L, Yang H, Yue Y, Zhang Y, et al. Breast cancer screening in women aged 35–64 years in Ordos in 2016–2020. Chin Prev Med. 2022;23(9):698–704. 22. Zhang M Bao H Zhang X Huang Z Zhao Z Li C Breast cancer screening coverage in china, 2018–2019 China CDC Wkly 2023 5 15 321 6 10.46234/ccdcw2023.062 37193086 PMC10182912 Zhang M, Bao H, Zhang X, Huang Z, Zhao Z, Li C, et al. Breast cancer screening coverage in china, 2018–2019. China CDC Wkly. 2023;5(15):321–6. 37193086 10.46234/ccdcw2023.062 PMC10182912 23. Damschroder LJ Aron DC Keith RE Kirsh SR Alexander JA Lowery JC Fostering implementation of health services research findings into practice: a consolidated framework for advancing implementation science Implement Sci 2009 4 50 10.1186/1748-5908-4-50 19664226 PMC2736161 Damschroder LJ, Aron DC, Keith RE, Kirsh SR, Alexander JA, Lowery JC. Fostering implementation of health services research findings into practice: a consolidated framework for advancing implementation science. Implement Sci. 2009;4:50. 19664226 10.1186/1748-5908-4-50 PMC2736161 24. Damschroder LJ Reardon CM Widerquist MAO Lowery J The updated consolidated framework for implementation research based on user feedback Implement Sci 2022 17 1 75 10.1186/s13012-022-01245-0 36309746 PMC9617234 Damschroder LJ, Reardon CM, Widerquist MAO, Lowery J. The updated consolidated framework for implementation research based on user feedback. Implement Sci. 2022;17(1):75. 36309746 10.1186/s13012-022-01245-0 PMC9617234 25. VanDevanter N Vu M Nguyen A Nguyen T Van Minh H Nguyen NT A qualitative assessment of factors influencing implementation and sustainability of evidence-based tobacco use treatment in Vietnam health centers Implement Sci 2020 15 1 73 10.1186/s13012-020-01035-6 32907603 PMC7488010 VanDevanter N, Vu M, Nguyen A, Nguyen T, Van Minh H, Nguyen NT, et al. A qualitative assessment of factors influencing implementation and sustainability of evidence-based tobacco use treatment in Vietnam health centers. Implement Sci. 2020;15(1):73. 32907603 10.1186/s13012-020-01035-6 PMC7488010 26. VanDevanter N Kumar P Nguyen N Nguyen L Nguyen T Stillman F Application of the consolidated framework for implementation research to assess factors that May influence implementation of tobacco use treatment guidelines in the Viet Nam public health care delivery system Implement Sci 2017 12 1 27 10.1186/s13012-017-0558-z 28241770 PMC5330005 VanDevanter N, Kumar P, Nguyen N, Nguyen L, Nguyen T, Stillman F, et al. Application of the consolidated framework for implementation research to assess factors that May influence implementation of tobacco use treatment guidelines in the Viet Nam public health care delivery system. Implement Sci. 2017;12(1):27. 28241770 10.1186/s13012-017-0558-z PMC5330005 27. Damschroder LJ Lowery JC Evaluation of a large-scale weight management program using the consolidated framework for implementation research (CFIR) Implement Sci 2013 8 51 10.1186/1748-5908-8-51 23663819 PMC3656778 Damschroder LJ, Lowery JC. Evaluation of a large-scale weight management program using the consolidated framework for implementation research (CFIR). Implement Sci. 2013;8:51. 23663819 10.1186/1748-5908-8-51 PMC3656778 28. Vidgen HA Love PV Wutzke SE Daniels LA Rissel CE Innes-Hughes C A description of health care system factors in the implementation of universal weight management services for children with overweight or obesity: case studies from Queensland and new South wales, Australia Implement Sci 2018 13 1 109 10.1186/s13012-018-0801-2 30086782 PMC6081901 Vidgen HA, Love PV, Wutzke SE, Daniels LA, Rissel CE, Innes-Hughes C, et al. A description of health care system factors in the implementation of universal weight management services for children with overweight or obesity: case studies from Queensland and new South wales, Australia. Implement Sci. 2018;13(1):109. 30086782 10.1186/s13012-018-0801-2 PMC6081901 29. Garbutt JM Dodd S Walling E Lee AA Kulka K Lobb R Barriers and facilitators to HPV vaccination in primary care practices: a mixed methods study using the consolidated framework for implementation research BMC Fam Pract 2018 19 1 53 10.1186/s12875-018-0750-5 29734944 PMC5938801 Garbutt JM, Dodd S, Walling E, Lee AA, Kulka K, Lobb R. Barriers and facilitators to HPV vaccination in primary care practices: a mixed methods study using the consolidated framework for implementation research. BMC Fam Pract. 2018;19(1):53. 29734944 10.1186/s12875-018-0750-5 PMC5938801 30. Soi C Gimbel S Chilundo B Muchanga V Matsinhe L Sherr K Human papillomavirus vaccine delivery in mozambique: identification of implementation performance drivers using the consolidated framework for implementation research (CFIR) Implement Sci 2018 13 1 151 10.1186/s13012-018-0846-2 30545391 PMC6293623 Soi C, Gimbel S, Chilundo B, Muchanga V, Matsinhe L, Sherr K. Human papillomavirus vaccine delivery in mozambique: identification of implementation performance drivers using the consolidated framework for implementation research (CFIR). Implement Sci. 2018;13(1):151. 30545391 10.1186/s13012-018-0846-2 PMC6293623 31. Consolidated Framework for Implementation Research. CFIR rating rules. Available at: https://cfirguide.org/wp-content/uploads/2019/08/ratingrules10-29-14.pdf 32. Pinder LF Henry-Tillman R Linyama D Kusweje V Nzayisenga JB Shibemba A Leverage of an existing cervical cancer prevention service platform to initiate breast cancer control services in Zambia: experiences and early outcomes J Glob Oncol 2018 4 1 8 30241176 10.1200/JGO.17.00026 PMC6180756 Pinder LF, Henry-Tillman R, Linyama D, Kusweje V, Nzayisenga JB, Shibemba A, et al. Leverage of an existing cervical cancer prevention service platform to initiate breast cancer control services in Zambia: experiences and early outcomes. J Glob Oncol. 2018;4:1–8. 30241176 10.1200/JGO.17.00026 PMC6180756 33. Pace LE Hagenimana M Dusengimana JV Balinda JP Benewe O Rugema V Implementation research: including breast examinations in a cervical cancer screening programme, Rwanda Bull World Health Organ 2023 101 7 478 86 10.2471/BLT.22.289599 37397178 PMC10300777 Pace LE, Hagenimana M, Dusengimana JV, Balinda JP, Benewe O, Rugema V, et al. Implementation research: including breast examinations in a cervical cancer screening programme, Rwanda. Bull World Health Organ. 2023;101(7):478–86. 37397178 10.2471/BLT.22.289599 PMC10300777 34. World Health Organization. Cervical cancer elimination initiative. Available at: https://www.who.int/initiatives/cervical-cancer-elimination-initiative 35. World Health Organization. The global breast cancer initiative. Available at: https://www.who.int/initiatives/global-breast-cancer-initiative 36. Davis M Hochberg L Zetterberg R Pridmore V Can cross-sector partnerships increase breast cancer screening in hard-to-reach migrant populations? J Global Oncol 2018 4 Suppl 2 142s 10.1200/jgo.18.20500 Davis M, Hochberg L, Zetterberg R, Pridmore V. Can cross-sector partnerships increase breast cancer screening in hard-to-reach migrant populations? J Global Oncol. 2018;4(Suppl 2):142s. 37. Allen P Walsh-Bailey C Hunleth J Carothers BJ Brownson RC Facilitators of multisector collaboration for delivering cancer control interventions in rural communities: a descriptive qualitative study Prev Chronic Dis 2022 19 E48 10.5888/pcd19.210450 35951440 PMC9390795 Allen P, Walsh-Bailey C, Hunleth J, Carothers BJ, Brownson RC. Facilitators of multisector collaboration for delivering cancer control interventions in rural communities: a descriptive qualitative study. Prev Chronic Dis. 2022;19:E48. 35951440 10.5888/pcd19.210450 PMC9390795 38. Bittencourt L Scarinci IC Training community health workers to promote breast cancer screening in Brazil Health Promot Int 2019 34 1 95 101 10.1093/heapro/dax058 29036489 Bittencourt L, Scarinci IC. Training community health workers to promote breast cancer screening in Brazil. Health Promot Int. 2019;34(1):95–101. 29036489 10.1093/heapro/dax058 39. Jatho A Mugisha NM Kafeero J Holoya G Okuku F Niyonzima N Capacity Building for cancer prevention and early detection in the Ugandan primary healthcare facilities: working toward reducing the unmet needs of cancer control services Cancer Med 2021 10 2 745 56 10.1002/cam4.3659 33319508 PMC7877353 Jatho A, Mugisha NM, Kafeero J, Holoya G, Okuku F, Niyonzima N, et al. Capacity Building for cancer prevention and early detection in the Ugandan primary healthcare facilities: working toward reducing the unmet needs of cancer control services. Cancer Med. 2021;10(2):745–56. 33319508 10.1002/cam4.3659 PMC7877353 40. Prusty RK Begum S Patil A Naik DD Pimple S Mishra G Increasing breast cancer awareness and breast examination practices among women through health education and capacity building of primary healthcare providers: a pre-post intervention study in low socioeconomic area of Mumbai, India BMJ Open 2021 11 4 e045424 10.1136/bmjopen-2020-045424 33906843 PMC8088239 Prusty RK, Begum S, Patil A, Naik DD, Pimple S, Mishra G. Increasing breast cancer awareness and breast examination practices among women through health education and capacity building of primary healthcare providers: a pre-post intervention study in low socioeconomic area of Mumbai, India. BMJ Open. 2021;11(4):e045424. 33906843 10.1136/bmjopen-2020-045424 PMC8088239 41. Wu TY Raghunathan V Shi J Hua W Yu W Deng A Improving the outcomes of breast cancer in China: physicians’ beliefs, recommendations, and practices for breast cancer screening Asian Pac J Cancer Care 2020 5 4 251 8 Wu TY, Raghunathan V, Shi J, Hua W, Yu W, Deng A. Improving the outcomes of breast cancer in China: physicians’ beliefs, recommendations, and practices for breast cancer screening. Asian Pac J Cancer Care. 2020;5(4):251–8. 42. Khokhar A Effect of a training programme on knowledge of nurses from a missionary hospital in India regarding breast cancer and its screening Asian Pac J Cancer Prev 2012 13 5985 7 10.7314/APJCP.2012.13.12.5985 23464390 Khokhar A. Effect of a training programme on knowledge of nurses from a missionary hospital in India regarding breast cancer and its screening. Asian Pac J Cancer Prev. 2012;13:5985–7. 23464390 10.7314/apjcp.2012.13.12.5985 43. Rehman HT Jawaid H Tahir A Imtiaz M Zulfiqar T Aziz T Breast cancer knowledge among health professionals: a pre-post-knowledge-based intervention study J Family Med Prim Care 2022 11 9 5649 55 10.4103/jfmpc.jfmpc_1226_22 36505641 PMC9731020 Rehman HT, Jawaid H, Tahir A, Imtiaz M, Zulfiqar T, Aziz T. Breast cancer knowledge among health professionals: a pre-post-knowledge-based intervention study. J Family Med Prim Care. 2022;11(9):5649–55. 36505641 10.4103/jfmpc.jfmpc_1226_22 PMC9731020 44. Akhigbe AO Omuemu VO Knowledge, attitudes and practice of breast cancer screening among female health workers in a Nigerian urban city BMC Cancer 2009 9 203 4 9 19555506 10.1186/1471-2407-9-203 PMC2709903 Akhigbe AO, Omuemu VO. Knowledge, attitudes and practice of breast cancer screening among female health workers in a Nigerian urban city. BMC Cancer. 2009;9(203):4–9. 19555506 10.1186/1471-2407-9-203 PMC2709903 45. da Costa Vieira RA Biller G Uemura G Ruiz CA Curado MP Breast cancer screening in developing countries Clinics 2017 72 4 244 53 10.6061/clinics/2017(04)09 28492725 PMC5401614 da Costa Vieira RA, Biller G, Uemura G, Ruiz CA, Curado MP. Breast cancer screening in developing countries. Clinics. 2017;72(4):244–53. 28492725 10.6061/clinics/2017(04)09 PMC5401614 46. Mishra GA Pimple SA Mittra I Badwe RA Screening for breast cancer: cost-effective solutions for low- & middle-income countries Indian J Med Res 2021 154 2 229 36 10.4103/ijmr.IJMR_2635_20 34854430 PMC9131750 Mishra GA, Pimple SA, Mittra I, Badwe RA. Screening for breast cancer: cost-effective solutions for low- & middle-income countries. Indian J Med Res. 2021;154(2):229–36. 34854430 10.4103/ijmr.IJMR_2635_20 PMC9131750 47. Chatterjee R Suy R Yen ChhayL Literature review on leadership in healthcare management J Soc Sci Stud 2018 5 1 38 47 10.5296/jsss.v5i1.11460 Chatterjee R, Suy R, Yen Chhay L. Literature review on leadership in healthcare management. J Soc Sci Stud. 2018;5(1):38–47. 48. Muhrer JC Improving breast cancer screening in a federally qualified health center with a team of nursing leaders Nurse Pract 2017 42 1 12 6 10.1097/01.NPR.0000511004.83595.16 27941422 Muhrer JC. Improving breast cancer screening in a federally qualified health center with a team of nursing leaders. Nurse Pract. 2017;42(1):12–6. 27941422 10.1097/01.NPR.0000511004.83595.16 49. National Health Commission of the PRC. Guidance on strengthening health promotion and education. Available at: http://www.nhfpc.gov.cn/xcs/s7846/201611/05cd17fa96614ea5a9f02bd3f7b44a25.shtml 50. Li L, Jiang Q, eds. Introduction to public health in China. Springer. Beijing: People’s Medical Publishing House; 2019. 51. Li L Development of China’s health care system in the time of COVID-19: challenges, opportunities, and call for actions Health Care Sci 2022 1 1 33 40 10.1002/hcs2.4 40478050 PMC9353379 Li L. Development of China’s health care system in the time of COVID-19: challenges, opportunities, and call for actions. Health Care Sci. 2022;1(1):33–40. 40478050 10.1002/hcs2.4 PMC9353379 52. Liang W Xing Y Pang M Wang D Yan H Community health education improves child health care in rural Western China BMC Pediatr 2018 18 1 132 10.1186/s12887-018-1084-0 29636008 PMC5891978 Liang W, Xing Y, Pang M, Wang D, Yan H. Community health education improves child health care in rural Western China. BMC Pediatr. 2018;18(1):132. 29636008 10.1186/s12887-018-1084-0 PMC5891978 53. Feng XL Martinez-Alvarez M Zhong J Xu J Yuan B Meng Q Extending access to essential services against constraints: the three-tier health service delivery system in rural China (1949–1980) Int J Equity Health 2017 16 1 49 10.1186/s12939-017-0541-y 28532500 PMC5441056 Feng XL, Martinez-Alvarez M, Zhong J, Xu J, Yuan B, Meng Q, et al. Extending access to essential services against constraints: the three-tier health service delivery system in rural China (1949–1980). Int J Equity Health. 2017;16(1):49. 28532500 10.1186/s12939-017-0541-y PMC5441056 54. Babiker A El Husseini M Al Nemri A Al Frayh A Al Juryyan N Faki MO Health care professional development: working as a team to improve patient care Sudan J Paediatr 2014 14 2 9 16 27493399 PMC4949805 Babiker A, El Husseini M, Al Nemri A, Al Frayh A, Al Juryyan N, Faki MO, et al. Health care professional development: working as a team to improve patient care. Sudan J Paediatr. 2014;14(2):9–16. 27493399 PMC4949805 55. Ginsburg O Yip CH Brooks A Cabanes A Caleffi M Dunstan Yataco JA Breast cancer early detection: a phased approach to implementation Cancer 2020 126 Suppl 10 2379 93 10.1002/cncr.32887 32348566 PMC7237065 Ginsburg O, Yip CH, Brooks A, Cabanes A, Caleffi M, Dunstan Yataco JA, et al. Breast cancer early detection: a phased approach to implementation. Cancer. 2020;126(Suppl 10):2379–93. 32348566 10.1002/cncr.32887 PMC7237065 56. Gunja MZ, Tikkanen R, Seervai S, Collins SR. What is the status of women’s health and health care in the US compared to ten other countries? Available at: https://www.commonwealthfund.org/sites/default/files/2018-12/Gunja_status_womens_health_sb.pdf 57. OECD. Screening, survival and mortality for breast cancer. In: Health at a glance 2017: OECD indicators. Paris: OECD Publishing; 2017. 58. Global Breast Cancer Initiative Implementation Framework: assessing, strengthening and scaling-up of services for the early detection and management of breast cancer. Geneva: World Health Organization; 2023. Licence: CC BY-NC-SA 3.0 IGO. ",
  "metadata": {
    "Title of this paper": "Breast cancer early detection: a phased approach to implementation",
    "Journal it was published in:": "BMC Health Services Research",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12487500/"
  }
}