{
  "title": "Paper_981",
  "abstract": "pmc BMC Neurol BMC Neurol 48 bmcneul BMC Neurology 1471-2377 BMC PMC12482472 PMC12482472.1 12482472 12482472 41023907 10.1186/s12883-025-04421-z 4421 1 Research Enhanced family caregiving improves quality of life, resilience, and hope review in POST-SPINAL SURGERY patients: A Quasi-Experimental study Zamani Mohammad Reza 1 Shahabi Aida 1 Imani Behzad 2 Abdolmaleki Sajjad 3 Abdi Alireza 1 Zandi Shirdel shirdel.zandi1994@yahoo.com 2 1 https://ror.org/02ekfbp48 grid.411950.8 0000 0004 0611 9280 Department of Operating Room, School of Paramedicine, Student Research Committee, Hamadan University of Medical Sciences, 2 https://ror.org/02ekfbp48 grid.411950.8 0000 0004 0611 9280 Department of Operating Room, School of Paramedicine, Hamadan University of Medical Sciences, 3 https://ror.org/02ekfbp48 grid.411950.8 0000 0004 0611 9280 Department of Neurosurgery, School of Medicine, Hamadan University of Medical Sciences, 29 9 2025 2025 25 478179 396 7 4 2025 26 8 2025 29 09 2025 01 10 2025 01 10 2025 © The Author(s) 2025 2025 https://creativecommons.org/licenses/by-nc-nd/4.0/ Open Access http://creativecommons.org/licenses/by-nc-nd/4.0/ Background Patients undergoing spinal surgery often experience chronic pain and functional limitations. These complications frequently lead to diminished quality of life, hope, and resilience. Inadequate family knowledge regarding home-based patient care exacerbates these challenges. This study investigates the effect of family support through education and follow-up after discharge on the quality of life, resilience, and hope in patients following spinal surgery. Methods This quasi-experimental study was conducted on 50 spinal surgery patients in Hamadan from November 2023 to October 2024. Participants were selected through convenience sampling and randomly allocated to either intervention or control groups. The intervention group received two visual training sessions before discharge and one month of follow-up, while the control group received only routine care. Data were collected using SF-36 (Quality of Life), MHS (Hope), and CD-RISC (Resilience) questionnaires. Finally, the data were analyzed using Independent and Paired t-tests, Chi-square, and ANCOVA at the significance level of P Results The groups showed no significant differences in baseline characteristics ( P P P P Conclusion Family education and post-discharge follow-up improved quality of life and resilience in spinal surgery patients, though no significant effect was observed on hope. These findings underscore the importance of structured family caregiving support and systematic follow-up in enhancing patient outcomes. Keywords Family caregivers Quality of life Resilience Hope Spinal fusion pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement no pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes issue-copyright-statement © BioMed Central Ltd., part of Springer Nature 2025 Background Degenerative spinal conditions, including degenerative changes, spinal stenosis, spondylolisthesis, and intervertebral disc herniation, represent the most prevalent spinal disorders [ 1 2 3 Postoperative patients frequently experience stress and anxiety due to physical changes and temporary activity restrictions, significant factors that impair quality of life (QoL). QoL encompasses multidimensional constructs including physical, cognitive, emotional, social, and spiritual domains [ 4 5 6 MRI structural abnormalities determine surgical outcomes, yet psychosocial factors significantly impact postoperative results and complications [ 7 8 9 10 11 Hope represents a vital and dynamic force characterized by optimistic expectations for the future, which is reinforced and supported through relationships and resources [ 12 13 14 Concurrently with the rise in surgery rates, hospital stays have shortened due to healthcare cost constraints and system limitations. This transition creates a problematic disparity between clinical and home environments, leaving patients unprepared for post-discharge self-management [ 15 16 15 17 Recent work by Geeta Thapar et al. (2022) has emphasized the urgent need for comprehensive care strategies that address the complex physical, psychological, and functional challenges faced by post-spinal surgery patients [ 18 Although family education in chronic diseases has been studied, its role in post-spinal surgery outcomes remains unclear. This study aimed to investigate the effects of family support through education and post-discharge follow-up on the quality of life, resilience, and hope in post-spinal surgery patients. Methods Study design This study examined the effect of family caregiving support through education and post-discharge follow-up on the quality of life, resilience, and hope of post-spinal surgery patients. The present study is quasi-experimental because it aimed to determine the cause-and-effect relationship between independent and dependent variables. Still, due to existing limitations, simple random sampling in the population was not possible [ 19 Inclusion and exclusion criteria The inclusion criteria for the study were as follows: age between 30 and 70 years, planned spinal surgery, no previous spinal surgery, absence of concurrent chronic diseases, ability to communicate and adhere to study procedures, and availability of a caregiver who met al.l the following conditions: physical presence for home care, adequate literacy (at least a high school diploma), demonstrate adequate health literacy (score ≥ 75 on the TOFHLA) [ 20 21 Sample Size To determine the required sample size, Formula 1 was used, which is an appropriate method for hypothesis testing in comparing the means of two populations [ 22 23  \\documentclass[12pt]{minimal}\n\t\t\t\t\\usepackage{amsmath}\n\t\t\t\t\\usepackage{wasysym} \n\t\t\t\t\\usepackage{amsfonts} \n\t\t\t\t\\usepackage{amssymb} \n\t\t\t\t\\usepackage{amsbsy}\n\t\t\t\t\\usepackage{mathrsfs}\n\t\t\t\t\\usepackage{upgreek}\n\t\t\t\t\\setlength{\\oddsidemargin}{-69pt}\n\t\t\t\t\\begin{document}$$n=\\frac{\\left(z_a+z_{\\beta}\\right)^{2}\\left(s^{2}_{1}+s^{2}_{2}\\right)}{\\left(\\mu_{1}-\\mu_{2}\\right)^{2}}$$\\end{document} Formula 1: Sample size formula for comparing two independent means. The CONSORT flowchart illustrates the participant allocation process (Fig. 1  Fig. 1 Flow diagram Procedure All patients underwent surgery by a single surgeon to maintain uniformity in surgical technique. All patients’ families received training on home care; however, the primary difference between the two groups lay in the educational methods and follow-up after discharge. Two educational sessions were conducted one day before discharge for the intervention group. The morning session (75 min) focused on physical care methods. It included 30 min of video training with explanations from the researcher, 30 min of practical exercises using medical mannequins, and 15 min for questions and answers. The afternoon session (45 min) was dedicated to teaching resilience and psychological coping skills through a 30-minute PowerPoint presentation, followed by 15 min for questions and answers. To facilitate learning and review, audio recordings of both sessions were provided to participants. Participants received audio files and educational materials (videos in CD format and PowerPoint files). The educational content was designed based on recommendations from clinical experts and the needs of patients, as identified in previous studies [ 15 16 24 Table 1  Table 1 Comparison of educational methods and Follow-Up procedures between the intervention and control groups Component Intervention Group Control Group Timing of Education 1 day before discharge; 2 educational sessions (morning and evening) in the conference room Before discharge, one short session Educational Content Physical care (visual and video-based education): - How and when to change dressings, bathe, use lumbar belts, cervical collars, and compression stockings (morning sessions) - Duration of walking, suture removal, rest, and sleeping positions (morning sessions) - Psychological skills and problem-solving strategies for resilience and post-surgical challenges (evening sessions) General theoretical education: - General explanations about post-surgical care - General guidance on rest, nutrition, and daily activities - General warnings about danger signs (fever, redness, swelling, discharge) Educational Materials Pamphlets: - Step-by-step instructions for post-surgical care Educational CDs: - Use videos and clear images for a better understanding of care steps Simple pamphlets: - General instructions about post-surgical care - No CDs or video content Follow-Up Phone and online follow-up: - Reporting danger signs (fever, redness, swelling, discharge) via virtual messaging - Daily follow-up and quick responses to family questions Limited follow-up: - Phone calls only in case of problems - No regular follow-up or use of virtual messaging Outcome assessment This study investigated three primary outcomes: between-group differences in quality of life, resilience, and hope. As secondary outcomes, within-group changes for each variable were evaluated in both groups. The electronic questionnaire system automatically calculated all scores based on a predefined scoring method according to the questionnaire guidelines. This method completely blinded evaluators to the participants’ identities and allowed for group allocation and standardized scoring without human interpretation bias. Instruments The required data for this study were collected using the following four tools:  Demographic and Clinical Characteristics SF-36 Quality of Life Questionnaire 25 Connor-Davidson Resilience Scale (CD-RISC) 26 Miller Hope Scale 1 5 27 Data analysis Descriptive statistics were used to summarize the data. Mean, standard deviation, and percentages were used to report descriptive variables. Independent and paired t-tests were used to compare the quantitative variables (age, QoL, resilience, hope scores), and Chi-square tests were used to compare the qualitative variables (e.g., sex, education) between the two groups. Univariate covariance analysis (ANCOVA) was used to test the research hypotheses. Data analysis was performed using SPSS version 24. Results Table 2 P  Table 2 Demographic characteristics of the study groups Variable Control Group Intervention Group P Age (Mean ± SD) 51.88 ± 11.52 47.48 ± 9.70 0.151* Gender n (%) Female (60%) 15 (52%) 13 0.388 ** Male (40%) 10 (48%) 12 Education Level n (%) Diploma (%56) 14 (%52) 13 0.77 ** Bachelor’s (%44) 11 (%48) 12 Marital Status n (%) Single (%28) 7 10 (%40) 0.37** Married (%72) 18 (%60) 15 Type of Surgery n (%) Laminectomy 5 (%20) (%28) 7 0.341** PSF 16 (%64) 16 (%64) ACDF 4 (%16) (8%) 2 *Independent T-test **Chi-square Table 3 3 p p p Intragroup analysis indicated that control group participants showed no significant differences between baseline and post-intervention scores for any measured variables ( p p p  Table 3 Mean and standard deviation of Pre- and Post-Test scores for study variables by group Variable Control Group Intervention Group P Hope Pre-Test 68.25 ± 12.170 28.23 ± 4.169 0.918 Post-Test 08.27 ± 36.172 50.20 ± 6.173 0.856 P-value* 0.353 0.053 Resilience Pre-Test 94.19 ± 20.83 51.12 ± 64.87 0.350 Post-Test 70.16 ± 32.82 11.12 ± 76.91 0.027 P-value* 0.690 0.008 Quality of Life Pre-Test 78.16 ± 34.49 95.15 ± 49.50 0.805 Post-Test 22.15 ± 24.45 15.15 ± 12.55 0.026 P-value* 0.287 0.018 *Paired T-test ** Independent T-test The normality test results for the distribution of the resilience variable in both groups indicated that the assumption of normality was met. Specifically, the significance level of the Kolmogorov-Smirnov test for resilience in both groups was less than 0.05, confirming that the data did not follow a normal distribution. Additionally, the results of the homogeneity of regression slopes test showed that the calculated F-value was 0.969, with a significance level of 0.330 for the resilience variable. Since this value is more significant than 0.05, the assumption of homogeneity of regression slopes was also satisfied. Therefore, univariate analysis of covariance (ANCOVA) was the appropriate statistical approach for this variable. Table 4 P  Table 4 Effectiveness of the family caregiving support program on resilience Source of Variation Sum of Squares Degrees of Freedom Mean Square F-Value P Between Groups 470.894 1 470.894 7.119 0.01 Error 3108.710 47 66.143 Total 390130.000 50 Table 5  Table 5 ANCOVA-adjusted means and between-group confidence intervals of resilience Group Mean St. Error 95% Confidence Interval Cohen's d (95% CI) Lower Bound Upper Bound Intervention 90.137 1.634 86.850 93.424 0.76 (0.25-1.27) Control 83.943 1.634 80.656 87.230 The normality of the results for the distribution of the quality of life variable in both groups indicated that the normality assumption was met. Specifically, the significance level of the Kolmogorov-Smirnov test for quality of life in both groups was less than 0.05, confirming that the data did not follow a normal distribution. Additionally, the results of the homogeneity of regression slopes test showed that the calculated F-value was 2.553, with a significance level of 0.085 for the quality of life variable. Since this value is more significant than 0.05, the assumption of homogeneity of regression slopes was also satisfied. Therefore, a univariate analysis of covariance (ANCOVA) was the appropriate statistical approach for this variable. Table 6 P  Table 6 Effectiveness of the family caregiving support program on quality of life Source of Variation Sum of Squares Degrees of Freedom Mean Square F-Value P Between Groups 1074.932 1 1074.932 6.675 0.013 Error 7568.720 47 161.037 Total 138229.774 50 Table 7  Table 7 ANCOVA-adjusted means and between-group confidence intervals of quality of life Group Mean St. Error 95% Confidence Interval Cohen's d (95% CI) Lower Bound Upper Bound Intervention 54.825 2.539 49.718 59.933 0.73 (0.21-1.25) Control 45.546 2.539 40.439 50.653 The normality test results for the distribution of the hope variable in both groups indicated that the normality assumption was met. Specifically, the significance level of the Kolmogorov-Smirnov test for hope in both groups was less than 0.05, confirming that the data did not follow a normal distribution. Additionally, the results of the homogeneity of regression slopes test showed that the calculated F-value was 1.318, with a significance level of 0.257 for the hope variable. Since this value is more significant than 0.05, the assumption of homogeneity of regression slopes was also satisfied. Therefore, a univariate covariance (ANCOVA) analysis was appropriate for this variable. Table 8 P  Table 8 Effectiveness of the family caregiving support program on hope Source of Variation Sum of Squares Degrees of Freedom Mean Square F-Value P Between Groups 43.792 1 43.792 0.375 0.543 Error 5487.242 47 116.750 Total 1523825.000 50 Table 9  Table 9 ANCOVA-adjusted means and between-group confidence intervals on the dependent variable of hope Group Mean St. Error 95% Confidence Interval Upper Bound Cohen's d (95% CI) Lower Bound Intervention 173.916 2.161 169.568 178.264 0.17 (-0.18, 0.52) Control 172.044 2.161 167.696 176.392 Discussion This study examined the effect of family caregiving support through education and post-discharge follow-up on the quality of life, resilience, and hope of post-spinal surgery patients. Both groups demonstrated homogeneity in demographics and baseline measures (QoL, resilience, hope; p The present study demonstrated that educational sessions for patients’ families and daily post-discharge follow-up improved patients’ quality of life after surgery. Indu Punia et al. (2022) found that providing educational packages to relatives of patients with spinal cord injuries significantly enhanced their quality of life, which is consistent with the findings of this study. Although the education delivery format in both studies was similar, we implemented a more extended follow-up period (one month vs. seven days), allowing for a more comprehensive evaluation. Additionally, utilizing online platforms enabled more precise tracking of patients by their families [ 28 The results of this study align with Alimohammadi et al. (2021), which highlighted the positive impact of continuous care on quality of life in patients following disc surgery. Despite the shorter follow-up period in this study (one month vs. three months), the observed improvement in quality of life was nearly identical. This similarity could be attributed to integrating physical and psychological care education, whereas Alimohammadi et al. focused solely on physical care education. Consequently, this study highlights the importance of psychological care components, as they may lead to a faster recovery within a shorter timeframe. However, larger sample sizes and additional studies are needed in this field [ 4 29 30 Conversely, Davoodi et al. (2018) reported that self-care education did not significantly impact the quality of life in patients with gastric cancer following gastrectomy [ 31 Another significant finding of this study was the substantial improvement in resilience among patients following the enhancement of family education and continuous follow-up. Tayebeh Rakhshani et al. (2024) found that self-care training for patients with multiple sclerosis improved problem-solving abilities, thereby enhancing resilience [ 32 33 34 Hope was another variable examined in this study. Post-test scores showed improvements in both the intervention and control groups compared to pre-test scores; however, there was no significant difference between the post-test results. Li et al. (2014) in China found a positive correlation between hope and quality of life, demonstrating that higher levels of hope contribute to improved patient outcomes [ 35 36 37 This study had limitations, including a small sample size and a short follow-up period, which may have affected the assessment of outcomes. One of the study’s strengths was the video-based education and the daily one-month follow-up. Another limitation of the study was the Hawthorne effect, which made it impossible to blind patients due to the nature of the educational intervention and the necessity for the patient’s family to be fully aware of the research process. Future research should utilize larger samples, extended follow-up periods, and objective performance measures while ethically controlling for observer effects. Conclusion This study showed that follow-up and education for the families of spinal surgery patients help increase their resilience and quality of life, but had no significant impact on life expectancy. Effective methods included educational programs tailored to their needs and monitoring through phone calls and messaging. These measures enable families to immediately contact service providers in case of questions or new patient conditions. It is recommended that these educational sessions and follow-ups be considered as complementary measures to improve patient health. Publisher’s Note Springer Nature remains neutral with regard to jurisdictional claims in published maps and institutional affiliations. Acknowledgements The authors sincerely thank the Vice Chancellor for Research and Technology of Hamadan University of Medical Sciences for their financial support and valuable assistance in conducting this research. Authors’ contributions MZ contributed to the study design, writing, final editing of the article, and data collection. AS designed the study and data collection, and wrote and finalized the article. BI supervised the study’s execution, reviewed the article, and approved the final version. SA conducted statistical data analysis and contributed to writing the methods section. AA participated in data collection and analysis. SZ designed the study, wrote and finalized the article, participated in data analysis, and reviewed the article. Funding This study was funded by the Vice Chancellor for Research and Technology of Hamadan University of Medical Sciences (Grant No. 140204273217). Data availability The de-identified datasets analyzed during this study are available from the corresponding author upon reasonable request. The survey instruments (SF-36, CD-RISC, and MHS) are publicly available through their respective copyright holders. Declarations Ethics approval and consent to participate This study was approved by the Ethics Committee of Hamadan University of Medical Sciences (Ethics Code: IR.UMSHA.REC.1402.290). Literate participants provided written informed consent. In contrast, illiterate participants provided oral informed consent through a standardized process in which a neutral witness read the consent form aloud and signed it as confirmation of their complete understanding and voluntary participation. To ensure the rights of all participants, we adhered strictly to the Declaration of Helsinki at all stages of the study design and implementation, ensuring compliance with all ethical standards outlined in the declaration and its subsequent amendments. Consent for publication Not applicable. Competing interests The authors declare no competing interests. Clinical trial number Not applicable. References 1. Zou J Yu H Song D Niu J Yang H Advice on standardized diagnosis and treatment for spinal diseases during the coronavirus disease 2019 pandemic Asian Spine J 2020 14 2 258 63 10.31616/asj.2020.0122 32222720 PMC7113464 Zou J, Yu H, Song D, Niu J, Yang H. Advice on standardized diagnosis and treatment for spinal diseases during the coronavirus disease 2019 pandemic. Asian Spine J. 2020;14(2):258–63. 32222720 10.31616/asj.2020.0122 PMC7113464 2. Leikkola P, Helminen M, Paavilainen E, Åsted-Kurki P. Patients’ and their families’ coping resources at six weeks following back surgery. 2014;2(2):105–17. 3. Neifert SN Martini ML Yuk F McNeill IT Caridi JM Steinberger J Predicting trends in cervical spinal surgery in the united States from 2020 to 2040 World Neurosurg 2020 141 e175 81 10.1016/j.wneu.2020.05.055 32416237 Neifert SN, Martini ML, Yuk F, McNeill IT, Caridi JM, Steinberger J, et al. Predicting trends in cervical spinal surgery in the united States from 2020 to 2040. World Neurosurg. 2020;141:e175–81. 32416237 10.1016/j.wneu.2020.05.055 4. Alimohammadi N Eslami M Yousefi H Tabesh H The effect of continuing care on patient’s quality-of-life after disc surgery in neurosurgery and very important person wards J Educ Health Promot 2015 4 1 106 12 10.4103/2277-9531.171820 27462648 PMC4946271 Alimohammadi N, Eslami M, Yousefi H, Tabesh H. The effect of continuing care on patient’s quality-of-life after disc surgery in neurosurgery and very important person wards. J Educ Health Promot. 2015;4(1):106–12. 27462648 10.4103/2277-9531.171820 PMC4946271 5. Mohammed DMAA Gashy M Alnaser AAMA Mohammed FEA Assessment of early functional outcome of lumbar discectomy in Soba and future hospitals, Khartoum, Sudan 2021 Ann Med Surg 2022 84 104866 10.1016/j.amsu.2022.104866 PMC9758349 36536750 Mohammed DMAA, Gashy M, Alnaser AAMA, Mohammed FEA. Assessment of early functional outcome of lumbar discectomy in Soba and future hospitals, Khartoum, Sudan 2021. Ann Med Surg. 2022;84:104866. 10.1016/j.amsu.2022.104866 PMC9758349 36536750 6. Fayssoux R Goldfarb NI Vaccaro AR Harrop J Indirect costs associated with surgery for low back pain—a secondary analysis of clinical trial data Popul Health Manage 2010 13 1 9 13 10.1089/pop.2009.0061 20158318 Fayssoux R, Goldfarb NI, Vaccaro AR, Harrop J. Indirect costs associated with surgery for low back pain—a secondary analysis of clinical trial data. Popul Health Manage. 2010;13(1):9–13. 10.1089/pop.2009.0061 20158318 7. Shin J-W Park Y Park S-H Ha JW Jung W-S Kim H-S Association of untreated pre-surgical depression with pain and outcomes after spinal surgery Glob Spine J 2025 15 3 1725 32 10.1177/21925682241260642 PMC11571643 38861501 Shin J-W, Park Y, Park S-H, Ha JW, Jung W-S, Kim H-S, et al. Association of untreated pre-surgical depression with pain and outcomes after spinal surgery. Glob Spine J. 2025;15(3):1725–32. 10.1177/21925682241260642 PMC11571643 38861501 8. Qiu Y Huang Y Wang Y Ren L Jiang H Zhang L The role of socioeconomic status, family resilience, and social support in predicting psychological resilience among Chinese maintenance hemodialysis patients Front Psychiatry 2021 12 723344 10.3389/fpsyt.2021.723344 34658959 PMC8514615 Qiu Y, Huang Y, Wang Y, Ren L, Jiang H, Zhang L, et al. The role of socioeconomic status, family resilience, and social support in predicting psychological resilience among Chinese maintenance hemodialysis patients. Front Psychiatry. 2021;12:723344. 34658959 10.3389/fpsyt.2021.723344 PMC8514615 9. DiSilvestro KJ Bond D Alsoof D McDonald CL Hartnett DA Hogan WB Preoperative resilience and early postoperative outcomes following lumbar spinal fusion World Neurosurg 2022 163 e573 8 10.1016/j.wneu.2022.04.030 35427792 DiSilvestro KJ, Bond D, Alsoof D, McDonald CL, Hartnett DA, Hogan WB, et al. Preoperative resilience and early postoperative outcomes following lumbar spinal fusion. World Neurosurg. 2022;163:e573–8. 35427792 10.1016/j.wneu.2022.04.030 10. Meade MH Radack T Riebesell S Schultz MJ Buchan L Hilibrand AS The effect of patient resilience on postoperative scores after One-and Two-Level anterior cervical discectomy and fusion World Neurosurg 2024 189 e953 8 10.1016/j.wneu.2024.07.053 39004180 Meade MH, Radack T, Riebesell S, Schultz MJ, Buchan L, Hilibrand AS, et al. The effect of patient resilience on postoperative scores after One-and Two-Level anterior cervical discectomy and fusion. World Neurosurg. 2024;189:e953–8. 39004180 10.1016/j.wneu.2024.07.053 11. Zauszniewski JA Bekhet AK Suresky MJ Resilience in family members of persons with serious mental illness Nurs Clin North Am 2010 45 4 613 26 10.1016/j.cnur.2010.06.007 20971340 Zauszniewski JA, Bekhet AK, Suresky MJ. Resilience in family members of persons with serious mental illness. Nurs Clin North Am. 2010;45(4):613–26. 20971340 10.1016/j.cnur.2010.06.007 12. Duggleby W Lee H Nekolaichuk C Fitzpatrick-Lewis D Systematic review of factors associated with hope in family carers of persons living with chronic illness J Adv Nurs 2021 77 8 3343 60 10.1111/jan.14858 33876845 Duggleby W, Lee H, Nekolaichuk C, Fitzpatrick-Lewis D. Systematic review of factors associated with hope in family carers of persons living with chronic illness. J Adv Nurs. 2021;77(8):3343–60. 33876845 10.1111/jan.14858 13. Van Lit A Kayes N A narrative review of hope after spinal cord injury: implications for physiotherapy New Z J Physiotherapy 2014 42 1 33 41 Van Lit A, Kayes N. A narrative review of hope after spinal cord injury: implications for physiotherapy. New Z J Physiotherapy. 2014;42(1):33–41. 14. Ghajar A Esmaeili R Yazdani-Charati J Ashrafi Z Mazdarani S Heidari Gorji MA Effect of family-centered education on hope in patients with heart failure J Mazandaran Univ Med Sci 2018 28 166 71 80 Ghajar A, Esmaeili R, Yazdani-Charati J, Ashrafi Z, Mazdarani S, Heidari Gorji MA. Effect of family-centered education on hope in patients with heart failure. J Mazandaran Univ Med Sci. 2018;28(166):71–80. 15. Dossa A Bokhour B Hoenig H Care transitions from the hospital to home for patients with mobility impairments: patient and family caregiver experiences Rehabilitation Nurs J 2012 37 6 277 85 10.1002/rnj.047 23212952 Dossa A, Bokhour B, Hoenig H. Care transitions from the hospital to home for patients with mobility impairments: patient and family caregiver experiences. Rehabilitation Nurs J. 2012;37(6):277–85. 10.1002/rnj.047 23212952 16. Kim JH Shin YS Discharge transition experience for lumbar fusion patients: a qualitative study J Neurosci Nurs 2021 53 6 228 32 10.1097/JNN.0000000000000616 34620802 PMC8575165 Kim JH, Shin YS. Discharge transition experience for lumbar fusion patients: a qualitative study. J Neurosci Nurs. 2021;53(6):228–32. 34620802 10.1097/JNN.0000000000000616 PMC8575165 17. Voss CTC, editor. Hope, Empowerment, Resilience and Outcomes for Carers. Carers NSW Biennial Conference; 2011; New South Wales, Australia. 18. Thapar G Dhandapani M Singla N Dhandapani S Post-hospitalization problems and nursing care needs of patients who underwent thoracolumbar spine surgery Nursing & Midwifery Research Journal 2022 18 3 130 6 10.1177/0974150X221096266 Thapar G, Dhandapani M, Singla N, Dhandapani S. Post-hospitalization problems and nursing care needs of patients who underwent thoracolumbar spine surgery. Nursing & Midwifery Research Journal. 2022;18(3):130–6. 19. Thyer BA. Quasi-experimental research designs. Oxford University Press. 2012. 20. Javadzade SH Sharifirad G Radjati F Mostafavi F Reisi M Hasanzade A Relationship between health literacy, health status, and healthy behaviors among older adults in Isfahan, Iran J Educ Health Promot 2012 1 31 8 10.4103/2277-9531.100160 23555134 PMC3577376 Javadzade SH, Sharifirad G, Radjati F, Mostafavi F, Reisi M, Hasanzade A. Relationship between health literacy, health status, and healthy behaviors among older adults in Isfahan, Iran. J Educ Health Promot. 2012;1:31–8. 23555134 10.4103/2277-9531.100160 PMC3577376 21. Dadfar M Kalibatseva Z Lester D Reliability and validity of the Farsi version of the patient health questionnaire-9 (PHQ-9) with Iranian psychiatric outpatients Trends Psychiatry Psychother 2018 40 2 144 51 10.1590/2237-6089-2017-0116 29995159 Dadfar M, Kalibatseva Z, Lester D. Reliability and validity of the Farsi version of the patient health questionnaire-9 (PHQ-9) with Iranian psychiatric outpatients. Trends Psychiatry Psychother. 2018;40(2):144–51. 29995159 10.1590/2237-6089-2017-0116 22. Kumar A Dogra S Kaur A Modi M Thakur A Saluja S Approach to sample size calculation in medical research Curr Med Res Pract 2014 4 2 87 92 10.1016/j.cmrp.2014.04.001 Kumar A, Dogra S, Kaur A, Modi M, Thakur A, Saluja S. Approach to sample size calculation in medical research. Curr Med Res Pract. 2014;4(2):87–92. 23. Abd-El Mohsen SA Effect of applying nursing care guide on health related quality of life for patients undergoing spinal fusion surgery IOSR J Nurs Health Sci (IOSR-JNHS) 2018 7 5 11 5 Abd-El Mohsen SA. Effect of applying nursing care guide on health related quality of life for patients undergoing spinal fusion surgery. IOSR J Nurs Health Sci (IOSR-JNHS). 2018;7(5):11–5. 24. Haghighat S Yazdi K Mahmoodi-Shan GR Sabzi Z The challenges of nursing care for patients with lumbar discectomy: a qualitative study Nurs Open 2024 11 3 e2137 10.1002/nop2.2137 38488403 PMC10941564 Haghighat S, Yazdi K, Mahmoodi-Shan GR, Sabzi Z. The challenges of nursing care for patients with lumbar discectomy: a qualitative study. Nurs Open. 2024;11(3):e2137. 38488403 10.1002/nop2.2137 PMC10941564 25. Montazeri A Goshtasebi A Vahdaninia M Gandek B The short form health survey (SF-36): translation and validation study of the Iranian version Qual Life Res 2005 14 875 82 10.1007/s11136-004-1014-5 16022079 Montazeri A, Goshtasebi A, Vahdaninia M, Gandek B. The short form health survey (SF-36): translation and validation study of the Iranian version. Qual Life Res. 2005;14:875–82. 16022079 10.1007/s11136-004-1014-5 26. Tang X Huang J Wang W Su X Yu Z Predictors of activation among persons with spinal cord injury during hospitalization: a cross-sectional study Japan J Nurs Sci 2023 20 3 e125 132 10.1111/jjns.12532 36965136 Tang X, Huang J, Wang W, Su X, Yu Z. Predictors of activation among persons with spinal cord injury during hospitalization: a cross-sectional study. Japan J Nurs Sci. 2023;20(3):e125-132. 10.1111/jjns.12532 36965136 27. Khorrami M Pordelan N Vakili S Taghian F Prediction of coronavirus anxiety based on attachment styles, resilience, and life expectancy in drug users Mod Care J 2022 19 1 e121174 10.5812/modernc-121174 Khorrami M, Pordelan N, Vakili S, Taghian F. Prediction of coronavirus anxiety based on attachment styles, resilience, and life expectancy in drug users. Mod Care J. 2022;19(1):e121174. 28. Punia I Rajora MA Khakha DC Agarwal D An individualized educational package for improving knowledge and practices of caregivers of patients with spinal cord injury: a quasiexperimental study Indian J Neurotrauma 2024 21 2 156 68 10.1055/s-0044-1778732 Punia I, Rajora MA, Khakha DC, Agarwal D. An individualized educational package for improving knowledge and practices of caregivers of patients with spinal cord injury: a quasiexperimental study. Indian J Neurotrauma. 2024;21(2):156–68. 29. Chu W-T Lin E Tung H-H Clinciu DL Simulated health education measures after lumbar disk herniation surgery: a quasi-experimental study in Taiwan Clin Simul Nurs 2020 44 50 8 10.1016/j.ecns.2020.01.005 Chu W-T, Lin E, Tung H-H, Clinciu DL. Simulated health education measures after lumbar disk herniation surgery: a quasi-experimental study in Taiwan. Clin Simul Nurs. 2020;44:50–8. 30. Fu Z Xie Y Li P Gao M Chen J Ning N Assessing multidisciplinary follow-up pattern efficiency and cost in follow-up care for patients in cervical spondylosis surgery: a non-randomized controlled study Front Med 2024 11 1354483 10.3389/fmed.2024.1354483 PMC11022215 38633312 Fu Z, Xie Y, Li P, Gao M, Chen J, Ning N. Assessing multidisciplinary follow-up pattern efficiency and cost in follow-up care for patients in cervical spondylosis surgery: a non-randomized controlled study. Front Med. 2024;11:1354483. 10.3389/fmed.2024.1354483 PMC11022215 38633312 31. Davoodi A Gholizadeh L Rezazadeh H Sheikalipour Z Lakdizaji S Mirinajad K Effects of a self-care education program on quality of life of patients with gastric cancer after gastrectomy J Community Support Oncol 2015 13 9 330 6 10.12788/jcso.0158 26859753 Davoodi A, Gholizadeh L, Rezazadeh H, Sheikalipour Z, Lakdizaji S, Mirinajad K, et al. Effects of a self-care education program on quality of life of patients with gastric cancer after gastrectomy. J Community Support Oncol. 2015;13(9):330–6. 26859753 10.12788/jcso.0158 32. Rakhshani T Afroozeh S Kashfi SM Kamyab A Khani Jeihooni A The effect of education of self-care behaviors on the quality of life and resilience of multiple sclerosis patients BMC Neurol 2024 24 1 264 72 10.1186/s12883-024-03777-y 39080600 PMC11290106 Rakhshani T, Afroozeh S, Kashfi SM, Kamyab A, Khani Jeihooni A. The effect of education of self-care behaviors on the quality of life and resilience of multiple sclerosis patients. BMC Neurol. 2024;24(1):264–72. 39080600 10.1186/s12883-024-03777-y PMC11290106 33. Molazem Z Jalali F Jannati M Shaygan M Khademian MH The effect of self-care training on happiness and resilience of patients undergoing coronary artery bypass graft surgeries Int J Surg Open 2022 40 100454 10.1016/j.ijso.2022.100454 Molazem Z, Jalali F, Jannati M, Shaygan M, Khademian MH. The effect of self-care training on happiness and resilience of patients undergoing coronary artery bypass graft surgeries. Int J Surg Open. 2022;40:100454. 34. Seyedoshohadaee M Babaeeyan Kshtelee F Seyyed Fatemi N Saravi M Haghani H The effect of self-care education on the resilience of the patients with heart failure J Client-Centered Nurs Care 2018 4 3 165 72 Seyedoshohadaee M, Babaeeyan Kshtelee F, Seyyed Fatemi N, Saravi M, Haghani H. The effect of self-care education on the resilience of the patients with heart failure. J Client-Centered Nurs Care. 2018;4(3):165–72. 35. Li M-Y Yang Y-L Liu L Wang L Effects of social support, hope and resilience on quality of life among Chinese bladder cancer patients: a cross-sectional study Health Qual Life Outcomes 2016 14 1 9 10.1186/s12955-016-0481-z 27153944 PMC4859956 Li M-Y, Yang Y-L, Liu L, Wang L. Effects of social support, hope and resilience on quality of life among Chinese bladder cancer patients: a cross-sectional study. Health Qual Life Outcomes. 2016;14:1–9. 27153944 10.1186/s12955-016-0481-z PMC4859956 36. Hekmatpou D Nasiri A Mohaghegh F Investigating the effect of self-care training on life expectancy and quality of life in patients with Gastrointestinal cancer under radiotherapy Asia-Pac J Oncol Nurs 2019 6 2 198 205 10.4103/apjon.apjon_47_18 30931366 PMC6371673 Hekmatpou D, Nasiri A, Mohaghegh F. Investigating the effect of self-care training on life expectancy and quality of life in patients with Gastrointestinal cancer under radiotherapy. Asia-Pac J Oncol Nurs. 2019;6(2):198–205. 30931366 10.4103/apjon.apjon_47_18 PMC6371673 37. Baljani E Kazemi M Amanpour E Tizfahm T The relationship between religion, spiritual well-being, hope and quality of life in patients with cancer Basic Clin Cancer Res 2014 6 4 28 36 Baljani E, Kazemi M, Amanpour E, Tizfahm T. The relationship between religion, spiritual well-being, hope and quality of life in patients with cancer. Basic Clin Cancer Res. 2014;6(4):28–36. ",
  "metadata": {
    "Title of this paper": "The relationship between religion, spiritual well-being, hope and quality of life in patients with cancer",
    "Journal it was published in:": "BMC Neurology",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12482472/"
  }
}