{
  "title": "Paper_1032",
  "abstract": "pmc Korean J Radiol Korean J Radiol 659 kjr KJR Korean Journal of Radiology 1229-6929 2005-8330 Korean Society of Radiology PMC12479230 PMC12479230.1 12479230 12479230 41015861 10.3348/kjr.2025.0633 1 Oncologic Imaging Original Article Quantitative Time-Dependent Diffusion MRI for Diagnosis and Aggressiveness Assessment of Endometrial Cancer: A Prospective Study https://orcid.org/0009-0005-1104-5153 Yue Wenyi 1 2 https://orcid.org/0009-0005-0577-7286 Han Ruxue 3 https://orcid.org/0000-0001-7895-4232 Xu Junzhong 4 5 https://orcid.org/0000-0002-9749-8962 Jin Chaoyang 4 5 https://orcid.org/0000-0002-0369-6301 Jiang Xiaoyu 4 5 https://orcid.org/0000-0001-8526-0386 Zheng Dandan 6 https://orcid.org/0000-0002-8835-4545 Peng Jing 6 https://orcid.org/0000-0003-0363-7288 Lu Jun 7 https://orcid.org/0000-0002-7928-4557 Liu Qiming 1 2 https://orcid.org/0000-0002-7770-8731 Xu Ning 8 https://orcid.org/0000-0002-3231-267X Zhao Dan 9 https://orcid.org/0000-0002-1172-6750 Li Hua 3 https://orcid.org/0000-0002-5773-0456 Yang Qi 1 2 1 China 2 China 3 China 4 USA 5 USA 6 China 7 China 8 China 9 China Corresponding author: Qi Yang, MD, PhD, Department of Radiology, Beijing Chaoyang Hospital, Capital Medical University, No. 8 Gongti South Road, Chaoyang District, Beijing 100020, China. yangyangqiqi@gmail.com Corresponding author: Hua Li, MD, PhD, Department of Gynecology and Obstetrics, Beijing Chaoyang Hospital, Capital Medical University, No. 8 Gongti South Road, Chaoyang District, Beijing 100020, China. hual_gyn@163.com 10 2025 11 9 2025 26 10 497823 973 985 19 5 2025 01 7 2025 31 7 2025 01 10 2025 01 10 2025 01 10 2025 Copyright © 2025 The Korean Society of Radiology 2025 The Korean Society of Radiology https://creativecommons.org/licenses/by-nc/4.0/ This is an Open Access article distributed under the terms of the Creative Commons Attribution Non-Commercial License ( https://creativecommons.org/licenses/by-nc/4.0 Objective Preoperative differentiation of benign and malignant endometrial lesions, along with the identification of aggressive histological types of endometrial cancer (EC), is crucial for guiding treatment strategies. Time-dependent diffusion magnetic resonance imaging (TDD-MRI), which allows the characterization of tissue microstructure at the cellular level, is not currently applied for endometrial lesions. This study aimed to evaluate TDD-MRI-derived microstructural parameters for noninvasively distinguishing benign and malignant endometrial lesions and predicting aggressive histological types of EC. Materials and Methods This prospective study enrolled 177 patients with clinically suspected EC who underwent TDD-MRI between January 2024 and March 2025. The Imaging Microstructural Parameters Using Limited Spectrally Edited Diffusion method was used to extract microstructural parameters, including the cell diameter (d), intracellular volume fraction ( v in v in D ex Results A total of 130 women (mean ± standard deviation age: 56 ± 14 years) administered uterine curettage or surgery were included in the final analysis. All microstructural parameters showed significant differences between benign endometrial lesions and EC ( P P 0Hz D ex P P P v in P 0Hz D ex P v in P r P Conclusion TDD-MRI-derived microstructural parameters demonstrated high performance in differentiating benign from malignant endometrial diseases and identifying aggressive types of EC. Magnetic resonance imaging Time-dependent diffusion MRI Endometrial cancer Histological types Microstructural parameters Beijing Hospitals Authority’s Ascent Plan DFL20220303 Beijing Key Specialists in Major Epidemic Prevention and Control Beijing Science and Technology Cross-disciplinary New Star Project National Natural Science Foundation of China https://doi.org/10.13039/100014717 62476180 62176267 CAMS Innovation Fund for Medical Sciences 2024-I2M-C&T-A-003 Qinghai Provincial Science and Technology Plan Special Aid Project for Qinghai 2025-QY-220 pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement no pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes INTRODUCTION Endometrial cancer (EC) is a common gynecological malignancy with an increasing incidence and a younger demographic [ 1 2 3 Evidence suggests significant differences between the microenvironments of benign endometrium and EC [ 4 5 6 Diffusion-weighted imaging (DWI) is a noninvasive imaging technique that offers functional insights and enhances the morphological details provided by conventional magnetic resonance imaging (MRI) [ 6 7 8 9 10 11 12 11 13 14 15 16 12 13 15 16 17 Therefore, this study aimed to evaluate the diagnostic feasibility of TDD-MRI in endometrial disease, comparing it with conventional DWI measurements for differentiating benign and malignant endometrial lesions and identifying aggressive histological types of EC. MATERIALS AND METHODS Study Participants Following the Declaration of Helsinki, this prospective study was approved by the Institutional Review Board of Beijing Chaoyang hospital of Capital Medical University (IRB No. 2023-11-13-1) and registered with the Chinese Clinical Trial Registry (ChiCTR2500095674). Totally, 177 patients with clinically suspected EC were enrolled to undergo MRI between January 2024 and March 2025. The inclusion criteria were as follows: 1) scheduled conventional contrast-enhanced pelvic MRI and TDD-MRI, and 2) willingness and ability to undergo MRI and provide informed consent. As the enrolled patients progressed through the study procedure, some were excluded from the final analysis based on the following criteria: 1) lack of pathological confirmation, 2) prior treatment for endometrial disease before MRI, 3) Insufficient MRI quality, and 4) final histology showing atypical endometrial hyperplasia. The participant flowchart is shown in Figure 1 Image Acquisition The IMPULSED strategy was used for diffusion MRI by applying oscillating gradient spin-echo (OGSE) and pulsed gradient spin-echo (PGSE) sequences [ 11 2 2 2 12 14 3 Figure 2 Image Analysis The image analysis method used has been described previously [ 18 v in S in v in S ex v in S in S ex S in 18 19 D ex S ex D ex 20 3 v i n 2 π 2 3 / d 2 19 v in 12 S S 0 exp bD 2 2 2 33Hz 17Hz 0Hz Diffusion images were coregistered to the corresponding T2-weighted S (b = 0) images to correct for subject motion. Denoising employs a local principal component analysis filter [ 21 v in D ex 22 In patients with endometrial lesions, radiologist 1 (with 10 years of experience in gynecological imaging) manually delineated the regions of interest (ROIs) on each slice of the lesions using PGSE DWI images with a b-value of 1,200 s/mm 2 Histopathological Analysis Biopsy specimens and histopathological slides were reviewed under the supervision of two experienced gynecological oncology pathologists with 15 and 10 years of experience. Benign endometrial lesions included endometrial polyps and hyperplasia. The pathological states of EC were recorded. According to the 2023 FIGO guidelines, low-grade (G1–G2) endometrioid endometrial carcinoma (EEC) is considered nonaggressive, whereas high-grade tumors, including EEC G3, serous carcinoma, clear cell carcinoma, and other rare subtypes, are classified as aggressive [ 3 Histopathological Assessment and Correlation With MRI Light microscopy histology images were analyzed using a deep learning-based cell pose method for cellular segmentation [ 23 A / π * 2 A Statistical Analysis Continuous variables with normal distribution were compared using the two-sample t 2 t 24 P RESULTS Baseline Characteristics The final analysis included 130 women administered TDD-MRI followed by uterine curettage or surgery for whom complete clinical information was available. Their mean age was 56 ± 14 years, with an interquartile range of 45–66 years. Among all participants, 68 (52.3%) were pathologically diagnosed with benign endometrial lesions and 62 (47.7%) were diagnosed with EC and underwent staging surgery. Among these 62 patients, EC in 50 (80.6%) was identified as nonaggressive, whereas in 12 (19.4%), it was aggressive. The baseline characteristics of the participants are summarized in Table 1 Interobserver Agreement The ICCs for diameter, D ex v in 0Hz 17Hz 33Hz Fig. 3 Comparing TDD-MRI-Derived Microstructural Parameters Between Different Endometrial Pathologies Figure 4 D ex v in P Fig. 5A-E D ex v in P Fig. 5I-M D ex v in D ex v in 0Hz 17Hz 33Hz P Fig. 5F-H P Fig. 5N-P 0Hz 17Hz 33Hz 0Hz 17Hz 33Hz Diagnostic Performance of TDD-MRI-Derived Microstructural Parameters In distinguishing between benign endometrial lesions and EC, cellularity achieved the highest performance among all microstructural features, with an AUC of 0.86 (95% CI: 0.79, 0.93), sensitivity of 74.2% (46 of 62 participants) and specificity of 91.2% (62 of 68 participants), followed by v in Table 2 In distinguishing between nonaggressive and aggressive EC, the classification analysis revealed that, among all microstructural features, the cellularity index achieved the highest performance, with an AUC of 0.88 (95% CI: 0.78, 0.95), sensitivity of 100.0% (12 of 12 participants) and specificity of 70.0% (35 of 50 participants), followed by diameter, with an AUC of 0.84 (95% CI: 0.70, 0.93), sensitivity of 91.7% (11 of 12 participants) and specificity of 66.0% (33 of 50 participants) ( Table 3 Correlation Between TDD-MRI-Derived Microstructural Parameters and D 0Hz Figure 6 0Hz 0Hz D ex P P P v in P 0Hz D ex P v in P 0Hz D ex P v in P 0Hz D ex P P Correlation and Simulation Validation With Histopathological Findings Cell nuclei were automatically segmented from hematoxylin-eosin-stained whole-slide images ( Fig. 7A-C v in r r r P Fig. 7D-F DISCUSSION This study prospectively assessed patients with endometrial diseases to demonstrate the clinical application of microstructural parameters obtained using TDD-MRI for differentiating benign and malignant endometrial diseases and classifying aggressiveness of EC. These microstructural parameters demonstrated excellent predictive performance in differentiating endometrial diseases, with cellularity achieving the best performance, with an AUC of 0.86. For distinguishing EC aggressiveness levels, the cellularity index achieved the best performance, with an AUC of 0.88. The microstructural parameters derived from TDD-MRI showed strong correlation with pathology-determined microstructural properties ( r P Accurate, noninvasive preoperative diagnosis of endometrial lesions and assessment of aggressiveness of EC are crucial for determining appropriate clinical management. Although benign and malignant endometrial conditions often have similar symptoms, their treatment strategies differ significantly. Benign lesions may not require surgical intervention, whereas malignant lesions typically necessitate hysterectomy with bilateral salpingo-oophorectomy and lymph node assessment. Although endometrial sampling via hysteroscopy or curettage remains the standard method for histopathological confirmation, its diagnostic accuracy can be limited by the lesion location, sampling limitations, and/or operator experience. Moreover, in patients with cervical stenosis, poor surgical tolerance, or other anatomical constraints, these invasive procedures may be contraindicated or pose significant risk [ 25 Multi-parametric MRI, especially DWI and ADC, is indispensable in oncology. However, ADC only measures water diffusivity, which is determined by various microstructural features [ 26 27 28 29 30 31 32 10 33 34 35 12 13 15 14 As shown above, compared with benign endometrial diseases, EC exhibits higher cell diameters and v in D ex 36 4 v in D ex 37 D ex v in 38 19 D ex v in 0Hz D ex v in 0Hz D ex 0Hz 14 Our study has several limitations. The sample size was relatively limited, particularly in certain subgroups, such as aggressive EC, which accounts for only one-sixth of all EC cases, according to epidemiological data. Although our cohort reflects the disease distribution, the small number of aggressive cases may limit the statistical power for subgroup comparisons. To address this limitation, we plan to expand patient recruitment in future studies, focusing on the underrepresented subtypes. A larger cohort with improved control of confounding factors will enable a more comprehensive molecular-level evaluation of EC and more robust statistical analyses. Second, the microstructural parameters were based on the ROI averages. Future work will explore advanced postprocessing to visualize MRI microstructural parameters across lesions and the surrounding environment. Furthermore, combining TDD-MRI with other novel MRI technologies to develop models incorporating multiple imaging modalities and parameters can enhance our ability to noninvasively predict molecular-level information related to endometrial diseases and EC. In summary, this study demonstrated the feasibility and high diagnostic performance of TDD-MRI-derived microstructural parameters in non-invasively differentiating benign and malignant endometrial diseases, as well as in identifying the aggressiveness of EC. Further validation is warranted, with a larger sample size, multicenter collaboration, and incorporation of various pathological and molecular information. Conflicts of Interest: Author Contributions: Conceptualization: Data curation: Formal analysis: Funding acquisition: Investigation: Methodology: Project administration: Resources: Software: Supervision: Validation: Visualization: Writing—original draft: Writing—review & editing: Funding Statement: Availability of Data and Material The datasets generated or analyzed during the study are available from the corresponding author on reasonable request. 1 Lefebvre TL Ueno Y Dohan A Chatterjee A Vallières M Winter-Reinhold E Development and validation of multiparametric MRI-based radiomics models for preoperative risk stratification of endometrial cancer Radiology 2022 305 375 386 35819326 10.1148/radiol.212873 2 Clarke MA Long BJ Del Mar Morillo A Arbyn M Bakkum-Gamez JN Wentzensen N Association of endometrial cancer risk with postmenopausal bleeding in women: a systematic review and meta-analysis JAMA Intern Med 2018 178 1210 1222 30083701 10.1001/jamainternmed.2018.2820 PMC6142981 3 Berek JS Matias-Guiu X Creutzberg C Fotopoulou C Gaffney D Kehoe S FIGO staging of endometrial cancer: 2023 J Gynecol Oncol 2023 34 e85 37593813 10.3802/jgo.2023.34.e85 PMC10482588 4 Yu Z Zhang J Zhang Q Wei S Shi R Zhao R Single-cell sequencing reveals the heterogeneity and intratumoral crosstalk in human endometrial cancer Cell Prolif 2022 55 e13249 35560676 10.1111/cpr.13249 PMC9201371 5 Ren F Wang L Wang Y Wang J Wang Y Song X Single-cell transcriptome profiles the heterogeneity of tumor cells and microenvironments for different pathological endometrial cancer and identifies specific sensitive drugs Cell Death Dis 2024 15 571 39112478 10.1038/s41419-024-06960-8 PMC11306564 6 Ren X Liang J Zhang Y Jiang N Xu Y Qiu M Single-cell transcriptomic analysis highlights origin and pathological process of human endometrioid endometrial carcinoma Nat Commun 2022 13 6300 36273006 10.1038/s41467-022-33982-7 PMC9588071 7 Horn LC Meinel A Handzel R Einenkel J Histopathology of endometrial hyperplasia and endometrial carcinoma: an update Ann Diagn Pathol 2007 11 297 311 17630117 10.1016/j.anndiagpath.2007.05.002 8 Subramaniam KS Tham ST Mohamed Z Woo YL Mat Adenan NA Chung I Cancer-associated fibroblasts promote proliferation of endometrial cancer cells PLoS One 2013 8 e68923 23922669 10.1371/journal.pone.0068923 PMC3724864 9 Fujii S Gonda T Yunaga H Clinical utility of diffusion-weighted imaging in gynecological imaging: revisited Invest Radiol 2024 59 78 91 37493356 10.1097/RLI.0000000000001004 10 Gore JC Xu J Colvin DC Yankeelov TE Parsons EC Does MD Characterization of tissue structure at varying length scales using temporal diffusion spectroscopy NMR Biomed 2010 23 745 756 20677208 10.1002/nbm.1531 PMC3285511 11 Xu J Jiang X Li H Arlinghaus LR McKinley ET Devan SP Magnetic resonance imaging of mean cell size in human breast tumors Magn Reson Med 2020 83 2002 2014 31765494 10.1002/mrm.28056 PMC7047520 12 Wu D Jiang K Li H Zhang Z Ba R Zhang Y Time-dependent diffusion MRI for quantitative microstructural mapping of prostate cancer Radiology 2022 303 578 587 35258368 10.1148/radiol.211180 13 Ba R Wang X Zhang Z Li Q Sun Y Zhang J Diffusion-time dependent diffusion MRI: effect of diffusion-time on microstructural mapping and prediction of prognostic features in breast cancer Eur Radiol 2023 33 6226 6237 37071169 10.1007/s00330-023-09623-y 14 Wang X Ba R Huang Y Cao Y Chen H Xu H Time-dependent diffusion MRI helps predict molecular subtypes and treatment response to neoadjuvant chemotherapy in breast cancer Radiology 2024 313 e240288 39436292 10.1148/radiol.240288 15 Zhang H Liu K Ba R Zhang Z Zhang Y Chen Y Histological and molecular classifications of pediatric glioma with time-dependent diffusion MRI-based microstructural mapping Neuro Oncol 2023 25 1146 1156 36617263 10.1093/neuonc/noad003 PMC10237431 16 Cao Y Lu Y Shao W Zhai W Song J Zhang A Time-dependent diffusion MRI-based microstructural mapping for differentiating high-grade serous ovarian cancer from serous borderline ovarian tumor Eur J Radiol 2024 178 111622 39018648 10.1016/j.ejrad.2024.111622 17 Solomon E Lemberskiy G Baete S Hu K Malyarenko D Swanson S Time-dependent diffusivity and kurtosis in phantoms and patients with head and neck cancer Magn Reson Med 2023 89 522 535 36219464 10.1002/mrm.29457 PMC9712275 18 Jiang X Li H Xie J Zhao P Gore JC Xu J Quantification of cell size using temporal diffusion spectroscopy Magn Reson Med 2016 75 1076 1085 25845851 10.1002/mrm.25684 PMC4592783 19 Jiang X Li H Xie J McKinley ET Zhao P Gore JC In vivo imaging of cancer cell size and cellularity using temporal diffusion spectroscopy Magn Reson Med 2017 78 156 164 27495144 10.1002/mrm.26356 PMC5293685 20 Reynaud O Winters KV Hoang DM Wadghiri YZ Novikov DS Kim SG Pulsed and oscillating gradient MRI for assessment of cell size and extracellular space (POMACE) in mouse gliomas NMR Biomed 2016 29 1350 1363 27448059 10.1002/nbm.3577 PMC5035213 21 Manjón JV Coupé P Concha L Buades A Collins DL Robles M Diffusion weighted image denoising using overcomplete local PCA PLoS One 2013 8 e73021 24019889 10.1371/journal.pone.0073021 PMC3760829 22 Xu J Devan SP Shi D Pamulaparthi A Yan N Zu Z MATI: a GPU-accelerated toolbox for microstructural diffusion MRI simulation and data fitting with a graphical user interface Magn Reson Imaging 2025 122 110428 40419173 10.1016/j.mri.2025.110428 23 Stringer C Wang T Michaelos M Pachitariu M Cellpose: a generalist algorithm for cellular segmentation Nat Methods 2021 18 100 106 33318659 10.1038/s41592-020-01018-x 24 Gelman A Jakulin A Pittau MG Su YS A weakly informative default prior distribution for logistic and other regression models Ann Appl Stat 2008 2 1360 1383 25 Helpman L Kupets R Covens A Saad RS Khalifa MA Ismiil N Assessment of endometrial sampling as a predictor of final surgical pathology in endometrial cancer Br J Cancer 2014 110 609 615 24366295 10.1038/bjc.2013.766 PMC3915129 26 Chatterjee A Watson G Myint E Sved P McEntee M Bourne R Changes in epithelium, stroma, and lumen space correlate more strongly with Gleason pattern and are stronger predictors of prostate ADC changes than cellularity metrics Radiology 2015 277 751 762 26110669 10.1148/radiol.2015142414 27 Meyer HJ Wienke A Surov A ADC values of benign and high grade meningiomas and associations with tumor cellularity and proliferation - A systematic review and meta-analysis J Neurol Sci 2020 415 116975 32535250 10.1016/j.jns.2020.116975 28 Wu X Pertovaara H Dastidar P Vornanen M Paavolainen L Marjomäki V ADC measurements in diffuse large B-cell lymphoma and follicular lymphoma: a DWI and cellularity study Eur J Radiol 2013 82 e158 e164 23254159 10.1016/j.ejrad.2012.11.021 29 Novikov DS The present and the future of microstructure MRI: from a paradigm shift to normal science J Neurosci Methods 2021 351 108947 33096152 10.1016/j.jneumeth.2020.108947 PMC7987839 30 Tian S Chen A Li Y Wang N Ma C Lin L The combined application of amide proton transfer imaging and diffusion kurtosis imaging for differentiating stage Ia endometrial carcinoma and endometrial polyps Magn Reson Imaging 2023 99 67 72 36603780 10.1016/j.mri.2022.12.026 31 Ma C Tian S Song Q Chen L Meng X Wang N Amide proton transfer-weighted imaging combined with intravoxel incoherent motion for evaluating microsatellite instability in endometrial cancer J Magn Reson Imaging 2023 57 493 505 35735273 10.1002/jmri.28287 32 Yamada I Wakana K Kobayashi D Miyasaka N Oshima N Wakabayashi A Endometrial carcinoma: evaluation using diffusion-tensor imaging and its correlation with histopathologic findings J Magn Reson Imaging 2019 50 250 260 30451333 10.1002/jmri.26558 33 Xu J Li K Smith RA Waterton JC Zhao P Chen H Characterizing tumor response to chemotherapy at various length scales using temporal diffusion spectroscopy PLoS One 2012 7 e41714 22911846 10.1371/journal.pone.0041714 PMC3404000 34 Iima M Yamamoto A Kataoka M Yamada Y Omori K Feiweier T Time-dependent diffusion MRI to distinguish malignant from benign head and neck tumors J Magn Reson Imaging 2019 50 88 95 30578563 10.1002/jmri.26578 35 Maekawa T Hori M Murata K Feiweier T Kamiya K Andica C Differentiation of high-grade and low-grade intra-axial brain tumors by time-dependent diffusion MRI Magn Reson Imaging 2020 72 34 41 32599021 10.1016/j.mri.2020.06.018 36 Bollineni VR Kramer G Liu Y Melidis C deSouza NM A literature review of the association between diffusion-weighted MRI derived apparent diffusion coefficient and tumour aggressiveness in pelvic cancer Cancer Treat Rev 2015 41 496 502 25892290 10.1016/j.ctrv.2015.03.010 37 Tamai K Koyama T Saga T Umeoka S Mikami Y Fujii S Diffusion-weighted MR imaging of uterine endometrial cancer J Magn Reson Imaging 2007 26 682 687 17729360 10.1002/jmri.20997 38 Li H Jiang X Xie J Gore JC Xu J Impact of transcytolemmal water exchange on estimates of tissue microstructural properties derived from diffusion MRI Magn Reson Med 2017 77 2239 2249 27342260 10.1002/mrm.26309 PMC5183568 Fig. 1 Flowchart shows participant enrollment. EC = endometrial cancer Fig. 2 Schematic shows the pulse sequences and differentiation of benign endometrial lesions and endometrial cancer using time-dependent diffusion magnetic resonance imaging-based microstructural mapping. A: B: Fig. 3 Bland–Altman plots compare the reproducibility of time-dependent diffusion magnetic resonance imaging measurements from two independent readers. A: B: D ex 2 C: D: E: v in 2 F: 0Hz 2 G: 17Hz 2 H: 33Hz 2 D ex v in Fig. 4 Microstructural parameter maps of benign lesions and nonaggressive and aggressive endometrial cancer, including diameter, D ex v in 0Hz 17Hz 33Hz D ex v in Fig. 5 Box and whisker plots show comparisons of microstructural parameters, including (A) (B) D ex (C) (D) (E) v in (F) 0Hz (G) 17Hz (H) 33Hz (I) (J) D ex (K) (L) (M) v in (N) 0Hz (O) 17Hz (P) 33Hz * P † P ‡ P D ex v in Fig. 6 Correlations between the fitted microstructural parameters and D 0Hz (A-E) (F-J) * P † P ‡ P Fig. 7 Correlations between time-dependent diffusion MRI-derived microstructural parameters and pathology-based microstructural features (n = 16). A: B: C: D-F: (D) (E) (F) v in nuclei v in Table 1 Patient baseline characteristics Clinical parameters Benign endometrial lesions (n = 68) EC (n = 62) Non-aggressive EC (n = 50) Aggressive EC (n = 12)  P *  P † Age, yr 52.96 ± 14.60 59.15 ± 11.97 58.46 ± 11.77 62.00 ± 12.90 0.010 0.362 BMI, kg/m 2 25.16 ± 4.02 27.22 ± 5.25 27.59 ± 5.32 25.66 ± 4.82 0.013 0.256 Menopausal status, yes 32 (47.1) 43 (69.4) 35 (70.0) 8 (66.7) 0.010 0.822 Abnormal uterine bleeding, yes 29 (42.6) 48 (77.4) 38 (76.0) 10 (83.3) 0 0.585 Live birth, yes 53 (77.9) 54 (87.1) 44 (88.0) 10 (83.3) 0.172 0.665 Diabetes, yes 12 (17.6) 17 (27.4) 13 (26.0) 4 (33.3) 0.181 0.609 Data are presented as mean ± standard deviation or patient number with percentage in parentheses. * P † P EC = endometrial cancer, BMI = body mass index Table 2 Diagnostic performance of time-dependent diffusion MRI–derived microstructural parameters for distinguishing benign and cancerous endometrial lesions Characteristic AUC Cutoff Sensitivity, % Specificity, % PPV, % NPV, % Cellularity, cells × 10 -3 2 0.86 [0.79, 0.93] 0.55 74.2 (46/62) [63.3, 85.1] 91.2 (62/68) [84.4, 97.9] 88.5 (46/52) [79.8, 97.1] 79.5 (62/78) [70.5, 88.4]  V in 0.83 [0.75, 0.90] 0.38 93.5 (58/62) [89.8, 100] 66.2 (45/68) [54.9, 77.4] 71.6 (58/81) [62.2, 81.7] 91.8 (45/49) [86.9, 100] Diameter, µm 0.81 [0.74, 0.88] 0.31 96.8 (60/62) [92.4, 100] 58.8 (40/68) [47.1, 70.5] 68.2 (60/88) [58.5, 77.9] 95.2 (40/42) [88.8, 100] D ex 2 0.74 [0.65, 0.82] 0.42 85.5 (53/62) [76.7, 94.3] 60.3 (41/68) [48.7, 71.9] 66.2 (53/80) [55.9, 76.6] 82.0 (41/50) [71.4, 92.6] Diffusivity at 0 Hz, µm 2 0.71 [0.62, 0.80] 0.48 71.0 (44/62) [59.7, 82.3] 69.1 (47/68) [58.1, 80.1] 67.7 (44/65) [56.3, 79.1] 72.3 (47/65) [61.4, 83.2] Cellularity index, µm -1 0.70 [0.60, 0.79] 0.43 95.2 (59/62) [89.8, 100] 57.4 (39/68) [45.6, 69.1] 67.0 (59/88) [57.2, 76.9] 92.9 (39/42) [85.1, 100] Diffusivity at 17 Hz, µm 2 0.67 [0.58, 0.77] 0.48 67.7 (42/62) [56.1, 79.4] 69.1 (47/68) [58.1, 80.1] 66.7 (42/63) [55.0, 78.3] 70.1 (47/67) [59.2, 81.1] Diffusivity at 33 Hz, µm 2 0.62 [0.53, 0.72] 0.47 61.3 (38/62) [49.2, 73.4] 61.8 (42/68) [50.2, 73.3] 59.4 (38/64) [47.3, 71.4] 63.6 (42/66) [52.0, 75.2] The values in parentheses are numerators and denominators, and the values in brackets are 95% confidence intervals. AUC = area under the receiver operating characteristic curve, PPV = positive predictive value, NPV = negative predictive value, v in D ex Table 3 Diagnostic performance of time-dependent diffusion MRI–derived microstructural parameters in distinguishing non-aggressive and aggressive endometrial cancers Characteristic AUC (95% CI) Cutoff (95% CI) Sensitivity, % Specificity, % PPV, % NPV, % Cellularity index, µm -1 0.88 [0.78, 0.95] 0.17 100 (12/12) [76.9, 100] 70.0 (35/50) [58.0, 96.2] 44.4 (12/27) [28.6, 85.8] 100 (35/35) [94.0, 100] Diameter, µm 0.84 [0.70, 0.93] 0.11 91.7 (11/12) [60.0, 100] 66.0 (33/50) [44.6, 96.2] 39.3 (11/28) [23.1, 84.6] 97.1 (33/34) [89.1, 100] Diffusivity at 33 Hz, µm 2 0.79 [0.65, 0.90] 0.11 100 (12/12) [54.5, 100] 50.0 (25/50) [40.9, 98.1] 32.4 (12/37) [21.4, 87.6] 100 (25/25) [88.0, 100]  V in 0.79 [0.62, 0.93] 0.16 83.3 (10/12) [57.1, 100] 82.0 (41/50) [74.4, 94.4] 52.6 (10/19) [33.3, 75.0] 95.3 (41/43) [88.6, 100] Diffusivity at 0 Hz, µm 2 0.76 [0.56, 0.92] 0.18 83.3 (10/12) [38.4, 100] 62.0 (31/50) [45.3, 100] 34.5 (10/29) [21.6, 100] 93.9 (31/33) [83.0, 100] D ex 2 0.74 [0.50, 0.92] 0.15 83.3 (10/12) [44.4, 100] 56.0 (28/50) [28.5, 100] 31.2 (10/32) [19.0, 100] 93.3 (28/30) [83.0, 100] Diffusivity at 17 Hz, µm 2 0.66 [0.40, 0.85] 0.16 75.0 (9/12) [30.7, 100] 54.0 (27/50) [24.4, 100] 28.1 (9/32) [17.6, 100] 90.0 (27/30) [81.0, 100] Cellularity, cells x 10 -3 2 0.61 [0.46, 0.86] 0.36 [0.09, 0.53] 50.0 (6/12) [36.3, 83.4] 100 (50/50) [65.8, 100] 100 (6/6) [20.0, 100] 89.3 (50/56) [81.1, 96.4] All diagnostic performance metrics (AUC, sensitivity, specificity, PPV, and NPV) are estimated using posterior mean from Bayesian logistic regression model with weakly informative prior N (0, 2.52). 95% CIs were calculated using Bootstrapping with 200 resampled datasets. The values in parentheses are numerators and denominators, and the values in brackets are 95% CIs. AUC = area under the receiver operating characteristic curve, PPV = positive predictive value, NPV = negative predictive value, CI = confidence interval, v in D ex ",
  "metadata": {
    "Title of this paper": "Impact of transcytolemmal water exchange on estimates of tissue microstructural properties derived from diffusion MRI",
    "Journal it was published in:": "Korean Journal of Radiology",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12479230/"
  }
}