{
  "title": "Paper_6",
  "abstract": "pmc Int J Gen Med Int J Gen Med 1187 ijgm ijgm International Journal of General Medicine 1178-7074 Dove Press PMC12495922 PMC12495922.1 12495922 12495922 10.2147/IJGM.S537679 537679 1 Original Research Analysis of Risk Factors of Lymphedema After Surgical Treatment in Cervical Cancer: A Case-Control Retrospective Study Gu et al Gu et al Gu Xiufen  1 Luo Yu  1 Lai Cuiwei  2 Liu Yun  3 1 Department of Gynecology, Meizhou People’s Hospital Meizhou People’s Republic of China 2 Nursing Department, Meizhou People’s Hospital Meizhou People’s Republic of China 3 Department of Medical Oncology, Meizhou People’s Hospital Meizhou People’s Republic of China Correspondence: Xiufen Gu, Department of Gynecology, Meizhou People’s Hospital Meizhou People’s Republic of China 30 9 2025 2025 18 478987 5927 5938 30 4 2025 19 9 2025 30 09 2025 05 10 2025 05 10 2025 © 2025 Gu et al. 2025 Gu et al. https://creativecommons.org/licenses/by-nc/4.0/ This work is published and licensed by Dove Medical Press Limited. The full terms of this license are available at https://www.dovepress.com/terms.php http://creativecommons.org/licenses/by-nc/4.0/ https://www.dovepress.com/terms.php Objective Cervical cancer is a common malignant tumor in the female reproductive system, surgery is the main radical treatment methods. Lymphedema, as a postoperative complication of cervical cancer, affects the prognosis of patients. Identifying the risk factors for lymphedema after surgery is of great clinical significance for reducing its incidence. This study aims to systematically analyze the related risk factors for lymphedema after cervical cancer surgery. Methods Clinical medical data of 701 cervical cancer patients at Meizhou People’s Hospital from December 2018 to December 2023 were collected, including age, body mass index (BMI), hypertension, diabetes mellitus, induced abortion, menopause, clinical stage, number of dissected lymph nodes, lymph node metastasis, postoperative complications, postoperative chemotherapy, postoperative radiotherapy, postoperative living habits, and lymphedema. The relationship between lymphedema and clinical features in cervical cancer was analyzed. Results A total of 220 (31.4%) patients developed lymphedema and 481 (68.6%) did not. The cervical cancer patients with lymphedema had higher proportions of advanced age, hypertension, menopause, number of dissected lymph nodes≥30, postoperative radiotherapy, and sitting quietly> 1 hour every day than patients without lymphedema. Logistic regression analysis showed that advanced age (odds ratio (OR): 2.713, 95% confidence interval (CI): 1.560–4.717, p p p p p p Conclusion Advanced age, menopause, pelvic lymph nodes plus para-aortic lymph nodes plus inguinal lymph nodes were dissected, number of dissected lymph nodes, postoperative complications, postoperative radiotherapy, and sitting quietly every day were independently associated with lymphedema in cervical cancer patients. Keywords cervical cancer lymphedema risk factors clinical features Science and Technology Program of Meizhou This study was supported by the Science and Technology Program of Meizhou (Grant No.: 2019B0202001). pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement no pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes Introduction Cervical cancer is a malignant tumor that occurs in the cervix. 1 2 3 4 3 5 6 7 8 9 10 11 Postoperative lymphedema in cervical cancer refers to abnormal accumulation of lymph fluid in the interstitial spaces due to the obstruction of lymph fluid return caused by surgery, resulting in a series of symptoms such as swelling, pain, and skin changes. 12 13 13 14 15 16 The risk factors for lymphedema after cervical cancer treatment are complex and include patient factors (age, obesity, combined chronic diseases, and lifestyle habits), 14 16–18 14 14 17–19 20 Materials and Methods Subjects This study retrospectively analyzed the clinical medical data of 701 patients with cervical cancer who were diagnosed and treated at the Meizhou People’s Hospital from December 2018 to December 2023. Patients who underwent surgery from January 2019 to September 2023. The follow-up deadline for this study was December 31, 2024. Lymphedema was regarded as a termination event during follow-up. If the patient did not develop lymphedema, the last follow-up deadline was considered as the cut-off date. The inclusion criteria were as follows: (1) patients who met the diagnostic criteria for cervical cancer; (2) patients who underwent surgical treatment in our hospital; (3) age ≥18 years; and (4) complete medical records. Exclusion criteria were: (1) coexisting with other severe diseases, such as severe organ failure, deep vein thrombosis, peripheral neuropathy or other malignant lesions; (2) patients with other surgical treatment histories; (3) cervical cancer patients who had received preoperative chemotherapy; (4) patients with edema caused by reasons such as cardiogenic, nephrogenic, or malnutrition; and (5) patients with incomplete medical records. This study was supported by the Ethics Committee of the Meizhou People’s Hospital. Data Collection Clinical medical records of patients with cervical cancer were collected, including age, body mass index (BMI), history of hypertension, diabetes mellitus, and induced abortion, menopause, clinical stage, number of dissected lymph nodes, lymph node metastasis, postoperative complications (such as fever, diarrhea, infection, and thrombosis), postoperative chemotherapy, postoperative radiotherapy, postoperative living habits (such as exercise, sitting still), and the locations and stages of lymphedema. BMI was divided into three grades: underweight (BMI<18.5 kg/m 2 2 2 21 22 23 24 25 Sit quietly> 1 hour every day means that there is at least one instance within a 24-hour period where the duration of continuous sitting exceeds 60 minutes. If multiple instances of continuous sitting shorter than 60 minutes occur in a day but the cumulative total sitting time exceeds 1 hour, it does not fall under the category defined in this study as sit quietly> 1 hour every day. Additionally, sitting behavior includes but is not limited to sitting for long periods at work, traveling, watching TV, reading, using electronic devices, and other activities that involve a predominantly stationary position. This information was obtained through telephone follow-ups with the patients. The disease stage of cervical cancer patients were evaluated according to the 2018 International Federation of Gynecology and Obstetrics (FIGO) staging system: 26 Diagnosis and Grading of Lymphedema The diagnostic criteria for lymphedema: (1) Clinical symptoms and signs: symmetrical or asymmetrical swelling in one or both lower limbs (from the ankle to the root of the thigh), the perineum, or the lower abdomen, accompanied or not accompanied by a tight or heavy sensation of the skin, and limited mobility. (2) Measurement indicators: measurement of the circumferential diameter of both lower limbs: The “5-point marking method” was applied to measure the circumferential diameter of both lower limbs, that is, 2 cm directly above the highest point of the lateral malleolus and directly below the highest point of the patella, 10 cm directly above the upper edge of the patella and 20 cm directly above the upper edge of the patella. A difference of ≥ 2.0 cm between the two sides was considered the diagnostic standard for leptococcal edema. Body composition analysis test: A body composition analysis tester was used to detect intracellular water content, extracellular water content, total body water content, edema index, limb water content and other objective indicators related to edema. If the extracellular water content ratio of fine cells was greater than 0.39, edema was confirmed. 27 (3) Exclude lymphedema caused by factors such as cardiogenic edema, nephrogenic edema, hepatogenic edema, deep vein thrombosis of the lower extremities, hypoproteinemia, and local infection. The classification standards for lymphedema are as follows: (1) grade I: the limb edema can subside on its own, disappearing after rest at night or after raising the limb, there are no obvious skin changes; (2) grade II: the limb edema does not subside on its own, and can be alleviated by raising the limb, the skin shows mild fibrosis; (3) grade III: the limb edema is significant, and does not significantly reduce after raising the limb; the skin shows obvious fibrosis, pigmentation, verrucous hyperplasia and other changes. Statistical Analysis SPSS statistical software (version 26.0) was used for data analysis. The χ 2 p Results Clinical Features of Patients with Cervical Cancer There were 443 (63.2%) and 258 (36.8%) patients aged <50 and ≥55 years, respectively. The BMI of 373 (53.2%) patients was within the normal range, and 275 (39.2%) were overweight. A total of 145 (20.7%), 67 (9.6%), 327 (46.6%), and 347 (49.5%) patients had a history of hypertension, diabetes mellitus, induced abortion, and menopause, respectively. There were 581 (82.9%), 93 (13.3%), 22 (3.1%), and 5 (0.7%) patients with squamous cell carcinoma, adenocarcinoma, adenosquamous carcinoma, and neuroendocrine carcinoma, respectively. There were 97 (13.8%), 368 (52.5%), 100 (14.3%), 198 (28.2%), 148 (21.1%), 459 (65.5%), and 95 (13.6%) patients with clinical stage III-IV, number of dissected lymph nodes ≥30, lymph node metastasis, postoperative complications, postoperative chemotherapy, postoperative radiotherapy, and sitting quietly for more than one hour every day, respectively. And pelvic lymph nodes plus para-aortic lymph nodes plus inguinal lymph nodes in 448 (63.9%) patients were dissected ( Table 1 Table 1 The Clinical Features of Patients with Cervical Cancer Clinical Features Patients with Cervical Age (years) <55, n (%) 443 (63.2%) ≥55, n (%) 258 (36.8%) BMI (kg/m 2 <18.5, n (%) 53 (7.6%) 18.5–23.9, n (%) 373 (53.2%) ≥24.0, n (%) 275 (39.2%) History of hypertension No, n (%) 556 (79.3%) Yes, n (%) 145 (20.7%) History of diabetes mellitus No, n (%) 634 (90.4%) Yes, n (%) 67 (9.6%) History of induced abortion No, n (%) 374 (53.4%) Yes, n (%) 327 (46.6%) Menopause No, n (%) 300 (42.8%) Yes, n (%) 347 (49.5%) Unknown, n (%) 54 (7.7%) Histopathological types Squamous cell carcinoma, n (%) 581 (82.9%) Adenocarcinoma, n (%) 93 (13.3%) Adenosquamous carcinoma, n (%) 22 (3.1%) Neuroendocrine carcinoma, n (%) 5 (0.7%) Clinical stage I, n (%) 351 (50.1%) II, n (%) 253 (36.1%) III, n (%) 95 (13.6%) IV, n (%) 2 (0.3%) Positions of dissected lymph nodes Pelvic lymph nodes + para-aortic lymph nodes + inguinal lymph nodes, n (%) 448 (63.9%) Pelvic lymph nodes + inguinal lymph nodes, n (%) 227 (32.4%) Pelvic lymph nodes + para-aortic lymph nodes, n (%) 2 (0.3%) No lymph nodes were dissected, n (%) 24 (3.4%) Number of dissected lymph nodes <30, n (%) 333 (47.5%) ≥30, n (%) 368 (52.5%) Lymph node metastasis No, n (%) 601 (85.7%) Yes, n (%) 100 (14.3%) Postoperative complication No, n (%) 503 (71.8%) Yes, n (%) 198 (28.2%) Postoperative chemotherapy No, n (%) 553 (78.9%) Yes, n (%) 148 (21.1%) Postoperative radiotherapy No, n (%) 242 (34.5%) Yes, n (%) 459 (65.5%) Sit quietly for more than one hour every day No, n (%) 606 (86.4%) Yes, n (%) 95 (13.6%) Lymphedema No, n (%) 481 (68.6%) Yes, n (%) 220 (31.4%) The Distribution of the Locations and Stages of Lymphedema In this study, 220 (31.4%) patients developed lymphedema, whereas 481 (68.6%) patients did not. Among the patients with lymphedema, 92 (42%) had lower extremity lymphedema, 72 (33%) had perineum and lower extremity lymphedema, and 41 (18%) had perineum lymphedema alone. These three sites were the most common sites at which lymphedema occurs ( Figure 1A Figure 1B Figure 1 The distributions of the locations ( A B Comparison of Clinical Features in Cervical Cancer Patients with and without Lymphedema The cervical cancer patients with lymphedema had higher proportions of advanced age (≥55 years old)(58.6% vs 26.8%, χ 2 p 2 p 2 p 2 p 2 p 2 p 2 p Table 2 Table 2 Comparison of Clinical Features in Cervical Cancer Patients with and without Lymphedema Clinical Features Patients without Patients with p 2 Age (years) <55, n (%) 352 (73.2%) 91 (41.4%) <0.001 2 ≥55, n (%) 129 (26.8%) 129 (58.6%) BMI (kg/m 2 <18.5, n (%) 39 (8.1%) 14 (6.4%) 0.681 2 18.5–23.9, n (%) 256 (53.2%) 117 (53.2%) ≥24.0, n (%) 186 (38.7%) 89 (40.5%) History of hypertension No, n (%) 394 (81.9%) 162 (73.6%) 0.016 2 Yes, n (%) 87 (18.1%) 58 (26.4%) History of diabetes mellitus No, n (%) 436 (90.6%) 198 (90.0%) 0.890 2 Yes, n (%) 45 (9.4%) 22 (10.0%) History of induced abortion No, n (%) 256 (53.2%) 118 (53.6%) 0.935 2 Yes, n (%) 225 (46.8%) 102 (46.4%) Menopause No, n (%) 247 (51.4%) 53 (24.1%) <0.001 2 Yes, n (%) 196 (40.7%) 151 (68.6%) Histopathological types Squamous cell carcinoma 389 (80.9%) 192 (87.3%) 0.196 2 Adenocarcinoma 72 (15.0%) 21 (9.5%) Adenosquamous carcinoma 16 (3.3%) 6 (2.7%) Neuroendocrine carcinoma 4 (0.8%) 1 (0.5%) Clinical stage I-II, n (%) 417 (86.7%) 187 (85.0%) 0.557 2 III-IV, n (%) 64 (13.3%) 33 (15.0%) Positions of dissected lymph nodes Pelvic lymph nodes + para-aortic lymph nodes + inguinal lymph nodes 280 (58.2%) 168 (76.4%) <0.001 2 Pelvic lymph nodes + inguinal lymph nodes 176 (36.6%) 51 (23.2%) Pelvic lymph nodes + para-aortic lymph nodes 1 (0.2%) 1 (0.5%) No lymph nodes were dissected 24 (5.0%) 0 (0) Number of dissected lymph nodes <30, n (%) 251 (52.2%) 82 (37.3%) <0.001 2 ≥30, n (%) 230 (47.8%) 138 (62.7%) Lymph node metastasis No, n (%) 416 (86.5%) 185 (84.1%) 0.416 2 Yes, n (%) 65 (13.5%) 35 (15.9%) Postoperative complication No, n (%) 356 (74.0%) 147 (66.8%) 0.058 2 Yes, n (%) 125 (26.0%) 73 (33.2%) Postoperative chemotherapy No, n (%) 383 (79.6%) 170 (77.3%) 0.486 2 Yes, n (%) 98 (20.4%) 50 (22.7%) Postoperative radiotherapy No, n (%) 204 (42.4%) 38 (17.3%) <0.001 2 Yes, n (%) 277 (57.6%) 182 (82.7%) Sit quietly for more than one hour every day No, n (%) 460 (95.6%) 146 (66.4%) <0.001 2 Yes, n (%) 21 (4.4%) 74 (33.6%) Note p Logistic Regression Analysis of Risk Factors of Lymphedema in Patients with Cervical Cancer In univariate logistic regression analysis, advanced age (odds ratio (OR): 3.868, 95% confidence interval (CI): 2.765–5.411, p p p p p p p Table 3 Table 3 Logistic Regression Analysis of Risk Factors of Lymphedema in Patients with Cervical Cancer Variables Univariate Multivariate OR (95% CI) p OR (95% CI) p Age (≥55 vs <55, years old) 3.868 (2.765–5.411) <0.001 2.713 (1.560–4.717) <0.001 History of hypertension (yes vs no) 1.621 (1.110–2.369) 0.013 1.377 (0.856–2.217) 0.188 Menopause (yes vs no) 3.590 (2.493–5.171) <0.001 1.954 (1.091–3.501) 0.024 Positions of dissected lymph nodes (Pelvic lymph nodes + para-aortic lymph nodes + inguinal lymph nodes vs other) 2.319 (1.618–3.324) <0.001 2.039 (1.297–3.207) 0.002 Number of dissected lymph nodes (≥30 vs <30) 1.837 (1.325–2.546) <0.001 1.666 (1.105–2.514) 0.015 Postoperative radiotherapy (yes vs no) 3.527 (2.380–5.228) <0.001 3.775 (2.348–6.069) <0.001 Sit quietly for more than one hour every day (yes vs no) 11.102 (6.606–18.658) <0.001 14.782 (7.926–27.567) <0.001 Note p Abbreviations Multivariate analysis showed that advanced age (OR: 2.713, 95% CI: 1.560–4.717, p p p p p p Table 3 Discussion Surgical treatment is the main radical method for early and locally advanced cervical cancer. 28 15 29 30 Lee et al revealed that advanced age is a risk factor for postoperative lymphedema in patients with cervical cancer. 19 14 31 17 18 32 Few studies have examined the relationship between physical conditions such as menopause, hypertension, diabetes, and postoperative lymphedema in patients with cervical cancer. Chen et al found that hypertension was a risk factor for postoperative lymphedema in patients with cervical cancer. 16 Studies have found that lymph node dissection was a risk factor for postoperative lymphedema in patients with cervical cancer. 19 17 33 32 34 35 36 Some studies have suggested that lymphedema is more common in patients undergoing radiotherapy or chemotherapy. 37 38 33 39 40 41 18 In addition, the relationship between other postoperative complications and lymphedema has rarely been studied relatively rarely at present. Liu et al found that the occurrence of postoperative complications was a risk factor for lower limb lymphedema after cervical cancer surgery. 18 17 20 19 20 This study suggests that advanced age, menopause, number of dissected lymph nodes, postoperative complication, postoperative radiotherapy, and sitting quietly for more than one hour every day are independently associated with lymphedema in cervical cancer patients. With the development of precision medicine, the treatment of cervical cancer has gradually shifted from the traditional treatment model to personalized treatment centered on individual patient characteristics. This transformation is not only based on the clinical and pathological features of the tumor, but also incorporates multi-dimensional information such as molecular biology and genetics, aiming to improve treatment efficacy while minimizing adverse reactions to the greatest extent. Based on the identified correlation factors in this study, precision medicine can be applied to the management of lymphedema in the following aspects. Firstly, for older patients, gene testing and other methods can be used to assess the expression levels of genes related to the lymphatic system in the patient, predict the risk of postoperative lymphedema, and formulate individualized prevention plans according to the risk level. Secondly, for postmenopausal patients, hormone levels in the body can be detected, combined with the specific situation of the patient, to formulate individualized hormone regulation plans to reduce the risk of lymphedema. Additionally, for patients with a large number of lymph node resections, higher postoperative complication risks, or those who need postoperative radiotherapy, multi-omics testing can be used to evaluate individual differences and predict the risk of postoperative lymphedema, and formulate individualized treatment and care plans. In addition, some non-coding RNAs are considered to have the potential as targets for tumor treatment. 30 42 This study provides valuable reference information for predicting postoperative lymphedema in patients with cervical cancer. However, it inevitably has some limitations. First of all, postoperative lymphedema in cervical cancer is a chronic progressive disease with a long onset duration. Studies have reported that the incidence of lower extremity lymphedema is highest within one year after gynecological tumor surgery. Some patients with gynecological tumors may develop delayed lower extremity lymphedema, and some may develop it 10–20 years after treatment. 31 Postoperative lymphedema after cervical cancer surgery is an important complication that affects the quality of life of patients. Its occurrence mechanism involves multiple biological processes such as disruption of lymph circulation, tissue fibrosis, and inflammatory response. Although traditional risk assessment based on clinical and pathological features can identify some high-risk factors, it is difficult to explain the differences among individuals. The development of multi-omics technologies (genomics, transcriptomics, proteomics, metabolomics) provides a new perspective for in-depth analysis of these individual differences. 43 44 45 Conclusions Advanced age, menopause, number of dissected lymph nodes, postoperative complications, postoperative radiotherapy, and sitting quietly for more than one hour every day were independently associated with lymphedema in cervical cancer patients. In clinical practice, it is necessary to comprehensively assess the patient’s condition to predict the risk of lymphedema occurrence, and develop individualized prevention strategies for high-risk patients to reduce the incidence of lymphedema. Meanwhile, the conclusions drawn from this study required further verification through multi-center, large-sample, prospective studies. In the future, more in-depth mechanism research and intervention measures exploration can be conducted based on these risk factors, providing a more solid theoretical basis and practical guidance for the prevention and treatment of lymphedema after surgery in cervical cancer. Acknowledgments The authors thank their colleagues, who were not listed in the authorship for their helpful comments on the manuscript. Data Sharing Statement The data that support the findings of this study are available from the corresponding author upon reasonable request. Ethics Approval All participants were informed on the study procedures and goals, and all the informed consent forms of the participants had been signed. The study was performed under the guidance of the Declaration of Helsinki and approved by the Ethics Committee of Medicine, Meizhou People’s Hospital. Author Contributions All authors made a significant contribution to the work reported, whether that is in the conception, study design, execution, acquisition of data, analysis and interpretation, or in all these areas; took part in drafting, revising or critically reviewing the article; gave final approval of the version to be published; have agreed on the journal to which the article has been submitted; and agree to be accountable for all aspects of the work. Disclosure The authors declare that they have no competing interests in this work. References 1. Lizano M Carrillo-García A De La Cruz-Hernández E Castro-Muñoz LJ Contreras-Paredes A Promising predictive molecular biomarkers for cervical cancer (Review) Int J Mol Med 2024 53 6 50 10.3892/ijmm.2024.5374 38606495 PMC11090266 2. Bray F Laversanne M Sung H Global cancer statistics 2022: GLOBOCAN estimates of incidence and mortality worldwide for 36 cancers in 185 countries CA Cancer J Clin 2024 74 3 229 263 10.3322/caac.21834 38572751 3. Wu Y He S Cao M Comparative analysis of cancer statistics in China and the United States in 2024 Chin Med J 2024 137 24 3093 3100 10.1097/CM9.0000000000003442 39654104 PMC11706596 4. Wu S Jiao J Yue X Wang Y Cervical cancer incidence, mortality, and burden in China: a time-trend analysis and comparison with England and India based on the global burden of disease study 2019 Front Public Health 2024 12 1358433 10.3389/fpubh.2024.1358433 38510348 PMC10951371 5. Wang Y Yan Q Fan C Overview and countermeasures of cancer burden in China Sci China Life Sci 2023 66 11 2515 2526 10.1007/s11427-022-2240-6 37071289 PMC10111086 6. Cibula D Planchamp F Fischerova D European Society of Gynaecological Oncology quality indicators for surgical treatment of cervical cancer Int J Gynecol Cancer 2020 30 1 3 14 10.1136/ijgc-2019-000878 31900285 7. Francoeur AA Monk BJ Tewari KS Treatment advances across the cervical cancer spectrum Nat Rev Clin Oncol 2025 22 3 182 199 10.1038/s41571-024-00977-w 39753753 8. Holtzman S Chaoul J Finkelstein M Kolev V Zakashansky K Regional trends of minimally invasive radical hysterectomy for cervical cancer and exploration of perioperative outcomes Cancer Epidemiol 2022 77 102095 10.1016/j.canep.2021.102095 35078009 9. Matsuo K Shimada M Yamaguchi S Association of radical hysterectomy surgical volume and survival for early-stage cervical cancer Obstet Gynecol 2019 133 6 1086 1098 10.1097/AOG.0000000000003280 31135722 PMC9045958 10. Jing H Xiuhong W Ying Y Complications of radical hysterectomy with pelvic lymph node dissection for cervical cancer: a 10-year single-centre clinical observational study BMC Cancer 2022 22 1 1286 10.1186/s12885-022-10395-9 36476575 PMC9730609 11. van Kol KGG Ebisch RMF Piek JMJ Zusterzeel PLM Vergeldt TFM Bekkers RLM Salvage surgery for patients with residual disease after chemoradiation therapy for locally advanced cervical cancer: a systematic review on indication, complications, and survival Acta Obstet Gynecol Scand 2021 100 7 1176 1185 10.1111/aogs.14093 33469927 PMC8359234 12. Gülseren V Dolanbay M Özdemir İA Incidence of lymphedema and other complications in patients operated on for gynecological cancer including utilization of two lymph node dissection techniques Lymphat Res Biol 2025 23 2 101 106 10.1089/lrb.2024.0084 39463269 13. Carter J Huang HQ Armer J GOG 244 - The Lymphedema and Gynecologic cancer (LeG) study: the impact of lower-extremity lymphedema on quality of life, psychological adjustment, physical disability, and function Gynecol Oncol 2021 160 1 244 251 10.1016/j.ygyno.2020.10.023 33109392 PMC7779696 14. Hu H Fu M Huang X Huang J Gao J Risk factors for lower extremity lymphedema after cervical cancer treatment: a systematic review and meta-analysis Transl Cancer Res 2022 11 6 1713 1721 10.21037/tcr-22-1256 35836533 PMC9273676 15. Bona AF Ferreira KR Carvalho RBM Thuler LCS Bergmann A Incidence, prevalence, and factors associated with lymphedema after treatment for cervical cancer: a systematic review Int J Gynecol Cancer 2020 30 11 1697 1704 10.1136/ijgc-2020-001682 32863276 16. Chen X Li J Zeng Q Huang W Lei N Zeng Q Construction of a nomogram for personalized prediction of lower limb lymphedema risk after cervical cancer surgery BMC Womens Health 2024 24 1 593 10.1186/s12905-024-03422-3 39506697 PMC11539278 17. Rebegea LF Stoleriu G Manolache N Associated risk factors of lower limb lymphedema after treatment of cervical and endometrial cancer Exp Ther Med 2020 20 6 181 10.3892/etm.2020.9311 33101471 PMC7579779 18. Liu G Hu J Liu Y Yuan M Factors influencing lower limb lymphedema after cervical cancer surgery: a case-control study Lymphat Res Biol 2023 21 2 169 178 10.1089/lrb.2022.0025 35905037 19. Lee J Byun HK Risk factors for lower extremity lymphedema after surgery in cervical and endometrial cancer J Gynecol Oncol 2023 34 3 e28 10.3802/jgo.2023.34.e28 36562134 PMC10157345 20. Hareyama H Hada K Goto K Prevalence, classification, and risk factors for postoperative lower extremity lymphedema in women with gynecologic malignancies: a retrospective study Int J Gynecol Cancer 2015 25 4 751 757 10.1097/IGC.0000000000000405 25723779 21. He W Li Q Yang M Lower BMI cutoffs to define overweight and obesity in China Obesity 2015 23 3 684 691 10.1002/oby.20995 25645003 22. Tang J Zhu X Chen Y Association of maternal pre-pregnancy low or increased body mass index with adverse pregnancy outcomes Sci Rep 2021 11 1 3831 10.1038/s41598-021-82064-z 33589654 PMC7884680 23. Benhalima K Van Crombrugge P Moyson C Risk factor screening for gestational diabetes mellitus based on the 2013 WHO criteria Eur J Endocrinol 2019 180 6 353 363 10.1530/EJE-19-0117 31120231 24. Wang Z Chen Z Zhang L Status of hypertension in China: results from the China hypertension survey, 2012–2015 Circulation 2018 137 22 2344 2356 10.1161/CIRCULATIONAHA.117.032380 29449338 25. Van Trappen P De Cuypere E Claes N Roels S Robotic staging of cervical cancer with simultaneous detection of primary pelvic and secondary para-aortic sentinel lymph nodes: reproducibility in a first case series Front Surg 2022 9 905083 10.3389/fsurg.2022.905083 35784928 PMC9244622 26. Salvo G Odetto D Pareja R Frumovitz M Ramirez PT Revised 2018 International Federation of Gynecology and Obstetrics (FIGO) cervical cancer staging: a review of gaps and questions that remain Int J Gynecol Cancer 2020 30 6 873 878 10.1136/ijgc-2020-001257 32241876 27. Lyons KJ Bischoff MK Fonarow GC Horwich TB Noninvasive bioelectrical impedance for predicting clinical outcomes in outpatients with heart failure Crit Pathw Cardiol 2017 16 1 32 36 10.1097/HPC.0000000000000105 28195941 28. Poddar P Maheshwari A Surgery for cervical cancer: consensus & controversies Indian J Med Res 2021 154 2 284 292 10.4103/ijmr.IJMR_4240_20 34854431 PMC9131770 29. Schaverien MV Coroneos CJ Surgical Treatment of Lymphedema Plast Reconstr Surg 2019 144 3 738 758 10.1097/PRS.0000000000005993 31461041 30. Liu X Yuan M Xiang Q Single-cell RNA sequencing of subcutaneous adipose tissues identifies therapeutic targets for cancer-associated lymphedema Cell Discov 2022 8 1 58 10.1038/s41421-022-00402-5 35725971 PMC9209506 31. Yoshihara M Shimono R Tsuru S Risk factors for late-onset lower limb lymphedema after gynecological cancer treatment: a multi-institutional retrospective study Eur J Surg Oncol 2020 46 7 1334 1338 10.1016/j.ejso.2020.01.033 32146054 32. Kuroda K Yamamoto Y Yanagisawa M Risk factors and a prediction model for lower limb lymphedema following lymphadenectomy in gynecologic cancer: a hospital-based retrospective cohort study BMC Womens Health 2017 17 1 50 10.1186/s12905-017-0403-1 28743274 PMC5526302 33. Armbrust R Auletta V Cichon G Vercellino G Yost K Sehouli J Lymphedema after pelvic and para-aortic lymphadenectomy-results of a systematic evaluation in patients with cervical and endometrial carcinoma Arch Gynecol Obstet 2023 307 5 1557 1565 10.1007/s00404-022-06779-8 36222950 PMC10110696 34. Yusof KM Groen K Evaluation of circulating MicroRNAs and adipokines in breast cancer survivors with arm lymphedema Int J Mol Sci 2022 23 19 11359 10.3390/ijms231911359 36232660 PMC9570352 35. Glaser G Dinoi G Multinu F Reduced lymphedema after sentinel lymph node biopsy versus lymphadenectomy for endometrial cancer Int J Mol Sci 2022 23 19 11359 10.3390/ijms231911359 33243776 36. Walker AR Leite S Chen YS Huepenbecker SP Graul A Sentinel lymph node biopsy at the time of hysterectomy for early-stage cervical cancer: a cost-effectiveness analysis Gynecol Oncol 2025 195 1 5 10.1016/j.ygyno.2025.02.019 40023056 37. Nakamura K Kitahara Y Satoh T Analysis of the effect of adjuvant radiotherapy on outcomes and complications after radical hysterectomy in FIGO stage IB1 cervical cancer patients with intermediate risk factors (GOTIC Study) World J Surg Oncol 2016 14 1 173 10.1186/s12957-016-0931-4 27356862 PMC4928324 38. Pieterse QD Kenter GG Maas CP Self-reported sexual, bowel and bladder function in cervical cancer patients following different treatment modalities: longitudinal prospective cohort study Int J Gynecol Cancer 2013 23 9 1717 1725 10.1097/IGC.0b013e3182a80a65 24172106 39. Tada H Teramukai S Fukushima M Sasaki H Risk factors for lower limb lymphedema after lymph node dissection in patients with ovarian and uterine carcinoma BMC Cancer 2009 9 47 10.1186/1471-2407-9-47 19193243 PMC2660366 40. De Vrieze T Gebruers N Nevelsteen I Manual lymphatic drainage with or without fluoroscopy guidance did not substantially improve the effect of decongestive lymphatic therapy in people with breast cancer-related lymphoedema (EFforT-BCRL trial): a multicentre randomised trial J Physiother 2022 68 2 110 122 10.1016/j.jphys.2022.03.010 35428594 41. Vignes S Poizeau F Dupuy A Cellulitis risk factors for patients with primary or secondary lymphedema J Vasc Surg Venous Lymphat Disord 2022 10 1 179 185.e171 10.1016/j.jvsv.2021.04.009 33957278 42. Gulìa C Signore F Gaffi M Gigli S Votino R Y RNA: an overview of their role as potential biomarkers and molecular targets in human cancers Cancers 2020 12 5 1238 10.3390/cancers12051238 32423154 PMC7281143 43. Karaman S Lehti S Multi-omics characterization of lymphedema-induced adipose tissue resulting from breast cancer-related surgery FASEB J 2024 38 20 e70097 10.1096/fj.202400498RR 39394863 PMC11580717 44. Piergentili R Gullo G Circulating miRNAs as a tool for early diagnosis of endometrial cancer-implications for the fertility-sparing process: clinical, biological, and legal aspects Int J Mol Sci 2023 24 14 11356 10.3390/ijms241411356 37511115 PMC10379073 45. Piergentili R Basile G Nocella C Carnevale R Using ncRNAs as tools in cancer diagnosis and treatment-the way towards personalized medicine to improve patients’ health Int J Mol Sci 2022 23 16 9353 10.3390/ijms23169353 36012617 PMC9409241 ",
  "metadata": {
    "Title of this paper": "Using ncRNAs as tools in cancer diagnosis and treatment-the way towards personalized medicine to improve patients’ health",
    "Journal it was published in:": "International Journal of General Medicine",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12495922/"
  }
}