{
  "title": "Paper_791",
  "abstract": "pmc BMC Biol BMC Biol 215 bmcbiology BMC Biology 1741-7007 BMC PMC12465141 PMC12465141.1 12465141 12465141 41013440 10.1186/s12915-025-02400-x 2400 1 Research Machine learning combined with omics-based approaches reveals T-lymphocyte cellular fate imbalance in abdominal aortic aneurysm Li Demin 1 2 3 4 5 Zhang Ge 1 2 3 4 5 Du Pengchong 1 2 3 4 5 Cao Chang 1 2 3 4 5 He Xuyu 6 Lv Yan 1 2 3 4 5 Yuan Peiyu 1 2 3 4 5 Wang Yujia 1 2 3 4 5 Wu Ruhao 7 Cao Yifan 1 2 3 4 5 Yang Yu 1 2 3 4 5 Gao Jiamin 1 2 3 4 5 Lan Bo 1 2 3 4 5 Shi Guo-Ping gpshi@seu.edu.cn 6 8 Cui Xiaolin stevencui@cuhk.edu.cn 9 Zhang Jinying jyzhang@zzu.edu.cn 1 2 3 4 5 Tang Junnan fcctangjn@zzu.edu.cn 1 2 3 4 5 1 https://ror.org/056swr059 grid.412633.1 Department of Cardiology, First Affiliated Hospital of Zhengzhou University, 2 3 4 5 https://ror.org/035rzmc67 grid.506862.f State Key Laboratory of Metabolic Dysregulation and Prevention and Treatment of Esophageal Cancer, Tianjian Laboratory of Advanced Biomedical Sciences, Academy of Medical Sciences, 6 https://ror.org/04b6nzv94 grid.62560.37 0000 0004 0378 8294 Department of Medicine, Brigham and Women’s Hospital and Harvard Medical School, 7 https://ror.org/056swr059 grid.412633.1 Department of Respiratory and Critical Care Medicine, First Affiliated Hospital of Zhengzhou University, 8 https://ror.org/04ct4d772 grid.263826.b 0000 0004 1761 0489 Zhongda Hospital, Advanced Institute for Life and Health, School of Medicine, Southeast University, 9 https://ror.org/00t33hh48 grid.10784.3a 0000 0004 1937 0482 School of Medicine, The Chinese University of Hong Kong (Shenzhen), 26 9 2025 2025 23 478652 280 4 3 2025 26 8 2025 26 09 2025 27 09 2025 29 09 2025 © The Author(s) 2025 2025 https://creativecommons.org/licenses/by-nc-nd/4.0/ Open Access http://creativecommons.org/licenses/by-nc-nd/4.0/ Background Abdominal aortic aneurysm (AAA) is typically an asymptomatic disease closely associated with immune mechanisms. A deep understanding of cellular responses within AAA tissues, particularly the molecular changes in T-cell populations, is critical for disease diagnosis and treatment. However, the specific mechanisms inducing T-lymphocyte fate imbalance in AAA remain to be elucidated. Results The analysis revealed the core mechanisms driving T-lymphocyte fate imbalance in AAA. We successfully established a comprehensive regulatory map encompassing T-cell infiltration regulatory features, critical transcription factors, and dysregulated immune signaling pathways. Machine learning algorithms identified transcription factors FOSB and JUNB as key biomarkers. Validation across multiple independent datasets and clinical samples confirmed the feasibility and accuracy of FOSB and JUNB as clinical diagnostic biomarkers for AAA. Conclusions Through the analysis of single-cell and bulk data, hallmarks of human AAA cellular landscape and T-cell comprehensive developmental relationships were recapitulated. This study identified important roles of T-cell and the molecular mechanisms for the dynamic T-cell infiltrating process, which could characterize disease status and landscape of human AAA microenvironment. Using the deep learning algorithms, FOSB and JUNB were demonstrated as pivotal biomarkers of AAA, together with screening the potential pharmacologic agents targeting T-cell polarization. Taken together, this expands the current understanding of AAA pathogenesis and may provide a feasible immune-targeted therapeutic strategy. Supplementary Information The online version contains supplementary material available at 10.1186/s12915-025-02400-x. Keywords Abdominal aortic aneurysm Machine learning Single-cell RNA sequencing Immunological microenvironment T cells Regulation network Jointly Established Project of the Henan Provincial Medical Science and Technology Research Program LHGJ20240225 the National Heart, Lung, and Blood Institute HL151627, HL157073, HL166538 and HL170000 the National Institute of Neurological Disorders and Stroke AG063839 https://doi.org/10.13039/501100001516 National Heart Foundation of New Zealand 1896, 1891 New Zealand Health Research Council Explorer grant 19/779 New Zealand Ministry for Business, Employment and Innovation MWF-UOO2103 National Natural Science Foundation of China U2004203 82222007 Henan Province Medical Science and Technology Key Joint Project SBGJ202101012 Funding for Scientific Research and InnovationTeam of The First Affiliated Hospital of Zhengzhou University ZYCXTD2023008 QNCXTD2023001 https://doi.org/10.13039/501100013057 Innovation Scientists and Technicians Troop Construction Projects of Henan Province 254000510006 Henan Province Key R&D Program 241111313300 Henan Zhongyuan Medical Science and Technology Innovation and Development Foundation Project ZYYC202305ZD pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement yes pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes issue-copyright-statement © BioMed Central Ltd., part of Springer Nature 2025 Background Abdominal aortic aneurysm (AAA) is an age-associated chronic inflammatory aortic disease that is typically induced by smoking, atherosclerosis, and genetic variants. AAA grows slowly without noticeable signs and symptoms until rupture occurs. The mortality associated with ruptured AAA can be as high as 80–90% [ 1 2 3 4 5 6 7 8 + + 9 4 A few previous attempts have identified the predominant types of aortic cells using aneurysmal mouse AAA and single-cell RNA sequencing (sc-RNA seq) technology [ 10 13 Herein, we performed the first comprehensive analysis using human AAA sc-RNA seq integrated with bulk transcriptomic data to provide new insights into the heterogeneous identities, diverse functional states, and immune microenvironment landscape in human AAA aortic wall. We revealed a roadmap of the cellular fate program in T cells as well as dynamic infiltration state-related signature and regulation patterns that may provide potential targets for AAA early intervention. The transcription factors FosB proto-oncogene (FOSB) and JunB proto-oncogene (JUNB) that had been overlooked previously in aneurysm were identified as key biomarkers through multiple machine learning algorithms and validated at both single-cell and population levels. This study might provide novel targets and mechanisms for clinical intervention and therapy in AAA. Results Single-cell transcriptome profiles of human AAA As shown in the analysis process (Fig. 1 1 1 1 Fig. 1 Overview of single cells derived from AAA aortic tissue. A B n C D E F G The highest cellular population was T cells followed by monocytes/macrophages, whereas smooth muscle cell (SMC) and endothelial cell (EC) populations were present in small numbers (Fig. 1 11 12 1 1 The top markers (sorted by average Log (fold change)) for a cell type were identified relative to all other types. The identified neural cells featured the high expression of WFDC2, FXYD2, and KLK1 (Additional file 1: Fig. S1A). We demonstrated that the immune cell lineages are comprised: (i) B cell (clusters 2, 5); (ii) CD4 + T (clusters 0, 1, 3); (iii) CD8 + T (clusters 7, 10); (iv) mast cell (cluster 15); (v) NK (cluster 11); (vi) monocyte/macrophage (clusters 4, 6, 8). Moreover, non-immune cell lineages were observed, namely endothelial cell (EC) (cluster 12), smooth muscle cell (SMC) (cluster 13), and neural cell (Schwann cell) (cluster 9) (Additional file 1: Fig. S1B) expressing NGFR associated protein [ 14 15 16 T lymphocyte transcriptomes revealed phenotypic and functional heterogeneity in AAA All T lymphocyte populations were isolated and combined (Fig. 2 2 2 + + 2 2 2 17 2 + + 2 Fig. 2 Heterogeneity of T lymphocytes in human AAA. A n B C D P P P E 10 P F G Furthermore, T_3 and T_5 exhibited a high proliferating state, indicating that they played a critical role in AAA pathogenesis (Fig. 2 2 18 19 Trajectory reconstruction recapitulated T-cell fate decision and expression kinetics To fully understand the dynamics of T-cell infiltration over the disease progression, we performed a pseudotime analysis based on the transcriptional changes during the cell continuous development process using Monocle2 algorithm, with the tendency of transition among different phenotypes revealed (Fig. 3 3 3 Fig. 3 High-dimensional single-cell lineage mapping tracks T phenotype infiltration states. A n B C D E F BEAM demonstrated dynamic expression of genes governing diversification of T-cell fates and construction of the Lineage trajectories. Unsupervised clustering of these cell fate genes revealed 3 clusters with different kinetics along the pseudotime (Fig. 3 3 AAA immune microenvironment characterization We used a large number of independent RNA-seq datasets, including all genome enrichment analysis (GSEA) results, to verify scRNA-seq-derived derived hypotheses in subsequent analyses (Figs. 4 5 6 4 4 4 4 4 - P 4 4 Fig. 4 Immune microenvironment and molecular and functional characteristics for AAA. A n n B C D E F G H Fig. 5 Comprehensive analyses of T lymphocyte infiltration state-related gene set. A n n B P C D E F U P n n G P H I Fig. 6 Identification of TIRS regulatory mechanisms and key biomarkers. A R B n n t C D E n n t F G H n n t I J Aneurysmal tissue showed a higher IPS than that of control samples ( P 4 4 20 Biological implications underlying TIRS To bring further insight into the role of genes as cell fate determinants, following the significant cellular state-related differential gene set (968 genes, P t A coregulatory network was established to map TIRS to bulk-cell level. A high density of interactions was determined among TIRS ( P 5 To investigate the functional significance of TIRS, we performed the over-representation analysis (ORA) by applying all MSigDB sets. TIRS was involved in modules related to T-cell datasets, cellular activation and differentiation, autoimmunity, and inflammatory responses (Fig. 5 5 5 P 5 P P P 5 A significant connection between PTS and infiltrating degree of multiple immunocyte subpopulations, especially activated CD4 + + 5 5 5 21 22 P Detection and evaluation of key biomarkers TIRS was subjected to the machine learning-based process for feature selection. Taking the intersection of LASSO and SVM-RFE, 4 key biomarkers were identified, including FOSB, JUNB, cystatin F (CST7), and TBC1 domain family member 4 (TBC1D4) (Fig. 6 6 6 6 6 6 6 6 We also confirmed the dysregulation of key biomarkers in clinical samples from AAA patients, analyzing both abdominal aortic wall and peripheral blood (Fig. 7 7 7 7 7 7 7 7 7 Fig. 7 Verification of key biomarkers. A B n n C D E n n F G H I J L n n t Discussion AAA is an autoimmune disease where T cells infiltrate to the lesions following microenvironmental stimulation and contribute to AAA formation and progression [ 8 23 4 11 13 24 25 Our results indicated that T cells serve as the center of cellular communication network in human AAA lesion aortic wall, where the highest degree of infiltration of T cells and macrophages and the lowest level of SMCs and ECs were identified. Prior study showed that AAA formation required the presence of CD4 + 26 + + 27 A strong communication was concluded between T cells and SMCs via multiple signaling axes, such as TIMP metallopeptidase inhibitor 1 (TIMP1)-CD63, major histocompatibility complex, class I, B (HLA_B)-CD3 delta subunit of TCR complex (CD3D), CXCR4), and collagen molecules-integrin subunit beta 1 (ITGB1), indicating the profound interactions induced by autoimmunity (Fig. S1D). Indeed, T-cell cytokines contribute to SMC death [ 28 16 16 7 Eight distinct subpopulations were identified from the T lineages, characterizing the transcriptional profiles and their original and functional heterogeneities (Table 1 29 30 Table 1 Eight distinct subpopulations of T cells in AAA Subpopulations of T cells in AAA Cell type Key markers Functional features State T_1 CD4 + CCR7↑, LEF1↑, SELL↑, TCF7↑ Stem-cell and central-memory-like phenotypes, involved in Wnt-signaling and proliferation-associated pathways, V(D)J recombination Naïve state T_2 CD4 + CCR7↑, LEF1↑, SELL↑, TCF7↑ Stem-cell and central-memory-like phenotypes, involved in Wnt-signaling and proliferation-associated pathways, lymphocyte proliferation Naïve state T_3 CD8 + GZMK↑, GZMA↑, KLRK1↑, CXCR4↑ Effector-memory CD8 + T cells, cell killing and response to INFG and TNF A high proliferating state T_4 CD4 + FOXP3↑, IL2RA↑, TIGIT↑, CTLA4↑ Treg, displaying protective effects in AAA animal models Treg phenotype T_5 CD4 + CXCR3↑, CXCR4↑, CCR6↑, TNF↑, IFNG↑ Effector-memory Th1-like subcluster, the most extensive and strong interactions, upregulation of NF-κ B/TGF-β/MAPK signaling pathway, enhanced oxidative phosphorylation A high proliferating state T_6 CD8 + GZMB↑, NKG7↑, FCGR3A↑, FGFBP2↑ Terminally differentiated cytotoxic CD8 + T profile, enrichment in fluid shear stress-associated pathway Terminally differentiated cytotoxic T_7 CD4 + CCR7↑, LEF1↑, SELL↑, TCF7↑, TNF↑, Th1-related cytokine↑ Th1-like central-memory subcluster, cell recruitment and differentiation Th1-like central-memory subcluster T_8 CD8 + NKT↑ Acquired cytotoxicity and killing ability after activation Cytotoxicity The trajectory analysis further revealed the signatures of T-cell heterogeneity, which were mapped to 3 infiltration states and 2 fates (immune-potentiating: Fate_2 and immunosuppressive: Fate_1) along with disease progression. The extent of proinflammatory and cytotoxic genes was significantly upregulated in FATE_2 as compared to the regulatory genes in FATE_1. Treg-like T_4, dominating in FATE_1 end-stage, exhibited a high degree of the negative regulator and apoptosis signaling, preventing the programming of such immune-modulatory cells into the resolution of inflammation under this infiltration state [ 18 19 Developing new strategies that target cellular phenotype and function may provide novel therapeutic targets for AAA. Therefore, we assessed TIRS underlying the dynamic program of T-cell infiltration state. Subsequent comprehensive analyses at the bulk level demonstrated a strong connection between TIRS and disease status as well as immunotherapy response. We identified benfotiamine as a potential target-specific agent, a vitamin B1 analog that significantly reversed the aberrant expression pattern of molecules involved in a multicomponent coregulatory network centered on TIRS, and blocked AAA T-cell polarization to an inflammatory-potentiating state. Previous studies reported that benfotiamine modulated several immunocyte activities, including microglial cells, dendritic cells, and macrophages, and shifted these cells from proinflammatory toward quiescent cell state under immunological complication states [ 31 34 Early diagnosis of AAA before rupture will reduce the risk of patient sudden death, but remains a clinical challenge. Current detection and risk assessment rely on imaging and morphological features and lack effective pathological biomarkers. Here we utilized multiple machine learning algorithms to screen key biomarkers for AAA based on the T-cell infiltration signature. Incorporation of machine learning facilitated the recognition of the most critical biological features from high-dimensional signatures that may improve the performance of precision diagnosis and therapy. Our identified biomarkers FOSB and JUNB are highly expressed in the arterial wall, PVAT, and peripheral blood with convenient accessibility. These biomarkers are associated with various AAA immune signalings such as TCR-calcium pathway and antigen presentation. We also revealed the kinetic pattern of FOSB and JUNB over the AAA developmental timing, which induced a T-cell inflammatory state in AAA. The transcriptional activity and abundance of FOSB and JUNB were dependent on the cell type and differentiation state [ 35 36 37 38 37 4 26 Benfotiamine targets IFN and TNF by its activity to downregulate the release of master cytokines TNF and interleukins by blocking the NF-κB pathways in several inflammatory cells [ 31 34 33 39 Several limitations exist in this study. Information and procedure bias from a computational biology approach are inevitable, potentially limiting the ability to fully recapitulate the developmental trajectories and diversities of T-cell infiltration states. Inclusion of functional experiments may help understand the pathogenic role of identified infiltration state driver signature and the regulatory mechanism. The challenge in sample collection led to the limited number of standard-compliant data. Clinical variations with larger samples for key biomarkers merit future exploration. Further in vitro and in vivo experimental validation to test the viability of TIRS-specific agents will also serve as future research directions. Conclusions Through the analysis of single-cell and bulk data, hallmarks of human AAA cellular landscape and T-cell comprehensive developmental relationships were recapitulated. This study identified important roles of T-cell and the molecular mechanisms for the dynamic T-cell infiltrating process, which could characterize disease status and landscape of human AAA microenvironment. Using the deep learning algorithms, FOSB and JUNB were demonstrated as pivotal biomarkers of AAA, together with screening the potential pharmacologic agents targeting T-cell polarization. Taken together, this expands the current understanding of AAA pathogenesis and may provide a feasible immune-targeted therapeutic strategy. Methods Data collection For bulk-cell level, our study retrospectively recruited 4 independent AAA datasets from the Gene Expression Omnibus (GEO, http://www.ncbi.nlm.nih.gov/geo/ GSE98278 40 GSE57691 41 GSE7084 42 GSE119717 6 GSE57691 GSE98278 GSE7084 GSE119717 43 44 https://www.ncbi.nlm.nih.gov/geo/query/acc.cgi?acc=GSE166676 45 http://cistrome.org/ 46 https://www.gsea-msigdb.org/gsea/msigdb/index.jsp Single-cell RNA-seq data processing All single-cell samples were harvested at the time of surgical intervention. Samples were minced, digested in 0.2% collagenase II (Life Technologies) and 0.2% collagenase V (Sigma) in plain medium for 1 h at 37 °C, and strained through a 70-μM mesh. The preliminary data processing of single-cell RNA-seq data started from the Cell Ranger Single Cell Software Suite 3.3.1 ( http://10xgenomics.com/ https://satijalab.org/seurat/ 47 Differential expression analysis For single-cell data, the findAllMarkers function with “wilcox” method was performed to identify differentially expressed genes (DEGs) from top 2000 variable genes. Only genes with log2Fold Change (FC) > 1.0 or < − 1.0 and false discovery rate (FDR) < 0.05 were defined as cluster markers. The “limma” package was used for DEGs and DETFs between AAA samples and controls based on microarray data, with |Log2 FC|> 1.0 and FDR < 0.05 as the screening criteria [ 43 48 . From clustered cell mapping to corresponding cell types To identify potential AAA cell populations within unsupervised clusters, DEGs of all subclusters were used as the potential reference that was combined with canonical cell type-specific surface markers derived from CellMarker for comprehensive annotation of cell type [ 49 50 Integrated analyses for single-cell data The discrimination analysis and quantification were performed through Cell Cycle Scoring function based on previously defined cell cycle-related genes, with cells projected onto UMAP space for visualization and colored according to cycle clustering for visualization. Next, to elucidate potential cellular communication patterns and ligand-receptor pairs among various cell clusters in AAA tissues, we utilized CellChat analysis [ 51 52 53 54 q q q 55 56 Biological function analysis Biological functions and signaling pathways enrichment analyses were performed using the “cluster Profiler” R package with thresholds of P 57 http://software.broadinstitute.org/gsea/msigdb 58 59 60 61 63 Identification of immune microenvironment characterization The immune infiltration level and immune function activity in each sample were evaluated through the ssGSEA algorithm based on the expression levels of immune-specific marker genes [ 62 64 P 65 https://github.com/icbi-lab/Immunophenogram Principal component analysis (PCA) PCA was used to achieve dimension reduction of all samples for further analysis. Based on 28 types of immune cells, we performed PCA to identify the difference in immune infiltration level between AAA samples and healthy controls. To explore the molecular pathological characteristics of TIRS, we calculated the top 2 principal components of TIRS as the signature score of each sample: PCA-T-score (PTS = ∑PC1 + ∑PC2). The correlations between TIRS signature and disease status as well as immune microenvironment were further revealed. Clinical samples The present study was endorsed by the Ethics Committee of the First Affiliated Hospital of Zhengzhou University (2021-KY-1260–002). This research was conducted in accordance with the 2008 Declaration of Helsinki. All subjects signed informed consent documents . 66 Quantitative real-time PCR qRT-PCR was performed to determine the expression levels of FOSB, JUNB, CST7, and TBC1D4 in tissue and blood samples. Total RNA was isolated from human abdominal aortic wall tissues and peripheral blood samples using RNAiso Plus (Takara, Dalian, China) according to the manufacturer’s protocol. The RNA quality was assessed using a NanoDrop One C (Thermo Fisher Scientific, Waltham, USA) ultramicro UV spectrophotometer, and the RNA integrity was evaluated based on agarose gel electrophoresis. cDNA was synthesized using HiScript III RT SuperMix for qPCR (Vazyme Biotech, Nanjing, China). The product was immediately stored at − 80 °C until analyses. The qRT-PCR was performed with ChamQ Universal SYBR qPCR Master Mix (Vazyme Biotech, Nanjing, China) on a QuantStudio 3 Real-Time PCR System (Applied Biosystems, Foster City, USA). Internal reference gene GAPDH was employed. qRT-PCR assays were performed in triplicate with the following conditions: (1) 95 °C for 30 s, (2) 40 cycles of 95 °C for 10 s and 60 °C for 30 s, (3) 95 °C for 15 s, 60 °C for 60 s, 95 °C for 15 s. Human abdominal aortic wall tissues were homogenized using TissueLyser II (QIAGEN) according to the manufacture’s instruction. Total RNA was isolated using TRIzol® reagent (Cat#15,596,018, Thermo Fisher Scientific) from homogenized tissues. High-Capacity cDNA Reverse Transcription Kit (Cat#4,368,813, Thermo Fisher Scientific) was used to generate cDNA. The relative mRNA levels of target genes were quantified using the iTaq UniverSYBR Green SMX 5000 (Cat#1725125, Bio-Rad) with an ABI PRISM 7900 Sequence Detector system (Applied Biosystems Co, Foster City, CA) following the manufacturer’s instructions. The ΔCT (Ct mRNA − Ct GAPDH) method was used to calculate mRNA relative expression. The relative quantification values for mRNA were calculated by the 2 − ΔΔCt method (Table 2 Table 2 The forward and reverse primers for qRT-PCR Genes Forward (5′—to 3′) Reverse (5′—to 3′) GAPDH TGTGTCCGTGGTGGATCTGA TTGCTGTTGAAGTCGCAGGAG FOSB GCTTCTCTCTTTACACACAGTG TGAGGACAAACGAAGAAGTGTA JUNB CTTCTACCACGACGACTCATAC TTTCAGGAGTTTGTAGTCGTGT CST7 TACTTGTTCCCAGGACCTTAAC CCTTGAACAAGAACATGTCGTT TBC1D4 TGGTTCCTCACATTGTTTGCCTCTC AGTGTCTCTTGGCTGCTCAGTAGG Screening and verification of key biomarkers Least absolute shrinkage and selection operator (LASSO) logistic regression and support vector machine-recursive feature elimination (SVM-RFE) were conducted to perform feature selection to screen AAA key biomarkers from TIRS based on the Cohort1. LASSO regression has a contractile penalty function on variables that induces sparsity of predictors in the expression profile. The “glmnet” package was utilized to fulfill this purpose [ 67 69 70 71 GSE57691 GSE98278 GSE7084 GSE119717 Establishment of abdominal aortic aneurysm model Referring to the method in the previous paper [ 72 15 ELISA Serum FOSB and JUNB concentrations were quantified according to the manufacturer’s protocols for the ELISA kits (FOSB: SAB #EK11596; JUNB: BIOESN BES4857K). The assay procedure involved sequential addition of standards, test samples, primary antibodies, and HRP-conjugated streptavidin to microplate wells, followed by incubation at 37 °C. Chromogenic and stop solutions were then introduced stepwise. Optical density values were determined using a microplate reader, with protein concentrations derived from standard curve calculations. Histology and immunohistochemistry The mouse abdominal aorta was fixed with 4% PFA, dehydrated, and embedded in paraffin. Slice (5 μm), remove wax, stain with hematoxylin and eosin (H&E), or Verhoeff’s dye liquor and Van Gieson’s dye liquor (EVG) to observe the structure. The expression of FOSB and JUNB in tissue sections was evaluated by immunohistochemical staining as previous studies [ 73 74 Images were captured using a microscope (Nikon). Statistical analysis In the present work, two-tailed P U t 75 www.r-project.org Supplementary Information  Additional file 1: Fig. S1. The landscape of AAA cells revealed by scRNA-seq analysis (related to Fig. 1 n P P 2 n ORA 3 n 4 n n n n n n n n n n 5 n n n n n t Additional file 2: Table S1. The cell populations in AAA and their differences. Abbreviations AAA Abdominal aortic aneurysm AHNAK AHNAK nucleoprotein BEAM Branched expression analysis modeling CCL3 C-C motif chemokine ligand 3 CCR6 C-C motif chemokine receptor 6 CCR7 Chemokine (C–C motif) receptor 7 CD3D B (HLA_B)-CD3 delta subunit of TCR complex CIC Clinical impact curve CST7 Cystatin F CTLA4 Cytotoxic T-lymphocyte associated protein 4 CXCR3 C-X-C motif chemokine receptor 3 CXCR4 C-X-C motif chemokine receptor 4 DCA Decision curve analysis DEGs Differentially expressed genes EC Endothelial cell ECM Extracellular matrix EVG Verhoeff’s dye liquor and Van Gieson’s dye liquor FCGR3A Fc gamma receptor IIIa FDR False discovery rate FGFBP2 Fibroblast growth factor binding protein 2 FNG Interferon gamma FOSB FosB proto-oncogene FOXP3 Forkhead box P3 GSORA Gene sets over-representation analysis GZMA Granzyme A GZMB Granzyme B GZMK Granzyme K H&E Hematoxylin and eosin IFN Interferon IL2RA Interleukin 2 receptor subunit alpha INFG Interferon gamma IPS Immunophenoscore IRF1 Interferon regulatory factor 1 ITGB1 Collagen molecules-integrin subunit beta 1 JUNB JunB proto-oncogene KEGG Kyoto Encyclopedia of Genes and Genomes KLRK1 Killer cell lectin like receptor K1 KRAS KRAS proto-oncogene LASSO Least absolute shrinkage and selection operator LEF1 Lymphoid-enhancer-binding factor 1 MAPK Mitogen activated kinase-like protein MSigDB Molecular Signatures Database NKG7 Natural killer cell granule protein 7 NKT Noktochor ORA Over-representation analysis PCA Principal component analysis PRF1 Perforin 1 PTS PCA-T-score PVATs Perivascular adipose tissues ROC Receiver operating characteristic scRNA-seq Single-cell RNA-sequence SELL Recombinant human CD62L/SELL protein SMC Smooth muscle cell TBC1D4 TBC1 domain family member 4 TCF7 Transcription factor 7 TGFB Transforming growth factor beta TIGIT T cell immunoreceptor with Ig and ITIM domains TIRS T-cell infiltration regulatory signature TNF Tumor necrosis factor Tregs Regulatory T cells TSO Template switch oligo UMAP Uniform Manifold Approximation and Projection Publisher’s Note Springer Nature remains neutral with regard to jurisdictional claims in published maps and institutional affiliations. Demin Li, Ge Zhang, Pengchong Du, and Chang Cao contributed equally to the study. Acknowledgements We acknowledge assistance with the access of analytic instruments from Academy of Medical Sciences of Zhengzhou University Translational Medicine platform. Thanks for the assistance provided by the Experimental Animal Center of Zhengzhou University. Authors’ contributions G.P.S, X.C, J.Z, and J.T 'contributed' Conceptualization and Funding Acquisition; D.L, G.Z, P.D and C.C 'contributed' Writing – Original Draft and Methodology; X.H, Y.L and P.Y 'contributed' Investigation; Y.W, Y.C and Y.Y 'contributed' Writing – Review & Editing; J.G, R.W and B.L 'contributed' Supervision. All authors read and approved the final manuscript. Funding This work was supported by the National Natural Science Foundation of China (No. 82222007 and 82170281 to J.T., U2004203 to J.Z.), Henan Province Key R&D Program (No. 241111313300) to J.T., Henan Province Medical Science and Technology Key Joint Project (SBGJ202101012) to J.Z., Innovation Scientists and Technicians Troop Construction Projects of Henan Province (No. 254000510006) to J.Z., Henan Zhongyuan Medical Science and Technology Innovation and Development Foundation Project (No. ZYYC202305ZD) to J.T., Funding for Scientific Research and Innovation Team of the First Affiliated Hospital of Zhengzhou University (QNCXTD2023001 to J.T. and ZYCXTD2023008 to J.Z.), New Zealand Health Research Council (Explorer grant 19/779) to S.C., New Zealand Ministry for Business, Employment and Innovation (MBIE Science Whitinga Fellowship, MWF-UOO2103) to S.C., National Heart Foundation of New Zealand (1896, 1891) to S.C., Jointly Established Project of the Henan Provincial Medical Science and Technology Research Program (LHGJ20240225 to D.L.), the National Heart, Lung, and Blood Institute ( HL151627 HL157073 HL166538 HL170000 AG063839 Data availability The data supporting the results in this study are available within the paper and its Supplementary Information. The datasets generated and/or analysed during the current study are available in the Gene Expression Omnibus of NCBI ( https://www.ncbi.nlm.nih.gov/geo/query/acc.cgi?acc=GSE166676/GSE57691/GSE98278/GSE119717/GSE7084 Declarations Ethics approval and consent to participate The present study was endorsed by the Ethics Committee of the First Affiliated Hospital of Zhengzhou University (2021-KY-1260–002). This research was conducted in accordance with the 2008 Declaration of Helsinki. Discarded and decoded human aortas were reused according to the protocol 2010P001930 pre-proved by the Human Investigation Review Committee at the Brigham and Women’s Hospital, Boston, MA. All mice operations complied with the Institutional Animal Care and Use Committees of Zhengzhou University and followed the National Institutes of Health and US Department of Agriculture Guidelines for Care and Use of Animals in Research (ZZU-LAC20240906 [ 15 Consent for publication Not applicable. Competing interests The authors declare no competing interests. References 1. van der Vliet JA Boll AP Abdominal aortic aneurysm Lancet (London, England) 1997 349 9055 863 866 10.1016/S0140-6736(96)07282-0 9121274 van der Vliet JA, Boll AP. Abdominal aortic aneurysm. Lancet (London, England). 1997;349(9055):863–6. 9121274 10.1016/s0140-6736(96)07282-0 2. Karthikesalingam A Holt PJ Vidal-Diez A Ozdemir BA Poloniecki JD Hinchliffe RJ Thompson MM Mortality from ruptured abdominal aortic aneurysms: clinical lessons from a comparison of outcomes in England and the USA Lancet 2014 383 9921 963 969 10.1016/S0140-6736(14)60109-4 24629298 Karthikesalingam A, Holt PJ, Vidal-Diez A, Ozdemir BA, Poloniecki JD, Hinchliffe RJ, et al. Mortality from ruptured abdominal aortic aneurysms: clinical lessons from a comparison of outcomes in England and the USA. Lancet. 2014;383(9921):963–9. 24629298 10.1016/S0140-6736(14)60109-4 3. Kokje VB Hamming JF Lindeman JH Editor’s choice - pharmaceutical management of small abdominal aortic aneurysms: a systematic review of the clinical evidence Eur J Vasc Endovasc Surg 2015 50 6 702 713 10.1016/j.ejvs.2015.08.010 26482507 Kokje VB, Hamming JF, Lindeman JH. Editor’s choice - pharmaceutical management of small abdominal aortic aneurysms: a systematic review of the clinical evidence. Eur J Vasc Endovasc Surg. 2015;50(6):702–13. 26482507 10.1016/j.ejvs.2015.08.010 4. Dale MA Ruhlman MK Baxter BT Inflammatory cell phenotypes in AAAs: their role and potential as targets for therapy Arterioscler Thromb Vasc Biol 2015 35 8 1746 1755 10.1161/ATVBAHA.115.305269 26044582 PMC4514552 Dale MA, Ruhlman MK, Baxter BT. Inflammatory cell phenotypes in AAAs: their role and potential as targets for therapy. Arterioscler Thromb Vasc Biol. 2015;35(8):1746–55. 26044582 10.1161/ATVBAHA.115.305269 PMC4514552 5. Sakalihasan N Michel JB Katsargyris A Kuivaniemi H Defraigne JO Nchimi A Powell JT Yoshimura K Hultgren R Abdominal aortic aneurysms Nat Rev Dis Primers 2018 4 1 34 10.1038/s41572-018-0030-7 30337540 Sakalihasan N, Michel JB, Katsargyris A, Kuivaniemi H, Defraigne JO, Nchimi A, et al. Abdominal aortic aneurysms. Nat Rev Dis Primers. 2018;4(1):34. 30337540 10.1038/s41572-018-0030-7 6. Piacentini L Werba JP Bono E Saccu C Tremoli E Spirito R Colombo GI Genome-wide expression profiling unveils autoimmune response signatures in the perivascular adipose tissue of abdominal aortic aneurysm Arterioscler Thromb Vasc Biol 2019 39 2 237 249 10.1161/atvbaha.118.311803 30567485 Piacentini L, Werba JP, Bono E, Saccu C, Tremoli E, Spirito R, et al. Genome-wide expression profiling unveils autoimmune response signatures in the perivascular adipose tissue of abdominal aortic aneurysm. Arterioscler Thromb Vasc Biol. 2019;39(2):237–49. 10.1161/atvbaha.118.311803. 30567485 10.1161/ATVBAHA.118.311803 7. Lu S White JV Lin WL Zhang X Solomides C Evans K Ntaoula N Nwaneshiudu I Gaughan J Monos DS Aneurysmal lesions of patients with abdominal aortic aneurysm contain clonally expanded T cells J Immunol 2014 192 10 4897 4912 10.4049/jimmunol.1301009 24752442 PMC4009497 Lu S, White JV, Lin WL, Zhang X, Solomides C, Evans K, et al. Aneurysmal lesions of patients with abdominal aortic aneurysm contain clonally expanded T cells. J Immunol. 2014;192(10):4897–912. 24752442 10.4049/jimmunol.1301009 PMC4009497 8. Platsoucas CD Lu S Nwaneshiudu I Solomides C Agelan A Ntaoula N Purev E Li LP Kratsios P Mylonas E Abdominal aortic aneurysm is a specific antigen-driven T cell disease Ann N Y Acad Sci 2006 1085 224 235 10.1196/annals.1383.019 17182939 Platsoucas CD, Lu S, Nwaneshiudu I, Solomides C, Agelan A, Ntaoula N, et al. Abdominal aortic aneurysm is a specific antigen-driven T cell disease. Ann N Y Acad Sci. 2006;1085:224–35. 17182939 10.1196/annals.1383.019 9. Yuan Z Lu Y Wei J Wu J Yang J Cai Z Abdominal aortic aneurysm: roles of inflammatory cells Front Immunol 2020 11 609161 10.3389/fimmu.2020.609161 33613530 PMC7886696 Yuan Z, Lu Y, Wei J, Wu J, Yang J, Cai Z. Abdominal aortic aneurysm: roles of inflammatory cells. Front Immunol. 2020;11:609161. 33613530 10.3389/fimmu.2020.609161 PMC7886696 10. Kalluri AS Vellarikkal SK Edelman ER Nguyen L Subramanian A Ellinor PT Regev A Kathiresan S Gupta RM Single-cell analysis of the normal mouse aorta reveals functionally distinct endothelial cell populations Circulation 2019 140 2 147 163 10.1161/CIRCULATIONAHA.118.038362 31146585 PMC6693656 Kalluri AS, Vellarikkal SK, Edelman ER, Nguyen L, Subramanian A, Ellinor PT, et al. Single-cell analysis of the normal mouse aorta reveals functionally distinct endothelial cell populations. Circulation. 2019;140(2):147–63. 31146585 10.1161/CIRCULATIONAHA.118.038362 PMC6693656 11. Zhao G Lu H Chang Z Zhao Y Zhu T Chang L Guo Y Garcia-Barrio MT Chen YE Zhang J Single-cell RNA sequencing reveals the cellular heterogeneity of aneurysmal infrarenal abdominal aorta Cardiovasc Res 2021 117 5 1402 1416 10.1093/cvr/cvaa214 32678909 PMC8064434 Zhao G, Lu H, Chang Z, Zhao Y, Zhu T, Chang L, et al. Single-cell RNA sequencing reveals the cellular heterogeneity of aneurysmal infrarenal abdominal aorta. Cardiovasc Res. 2021;117(5):1402–16. 32678909 10.1093/cvr/cvaa214 PMC8064434 12. Li B Song X Guo W Hou Y Hu H Ge W Fan T Han Z Li Z Yang P Single-cell transcriptome profiles reveal fibrocytes as potential targets of cell therapies for abdominal aortic aneurysm Front Cardiovasc Med 2021 8 753711 10.3389/fcvm.2021.753711 34901214 PMC8652037 Li B, Song X, Guo W, Hou Y, Hu H, Ge W, et al. Single-cell transcriptome profiles reveal fibrocytes as potential targets of cell therapies for abdominal aortic aneurysm. Front Cardiovasc Med. 2021;8:753711. 34901214 10.3389/fcvm.2021.753711 PMC8652037 13. Yang H Zhou T Stranz A DeRoo E Liu B Single-cell RNA sequencing reveals heterogeneity of vascular cells in early stage murine abdominal aortic aneurysm-brief report Arterioscler Thromb Vasc Biol 2021 41 3 1158 1166 10.1161/ATVBAHA.120.315607 33472403 PMC7904588 Yang H, Zhou T, Stranz A, DeRoo E, Liu B. Single-cell RNA sequencing reveals heterogeneity of vascular cells in early stage murine abdominal aortic aneurysm-brief report. Arterioscler Thromb Vasc Biol. 2021;41(3):1158–66. 33472403 10.1161/ATVBAHA.120.315607 PMC7904588 14. Ratner N Williams JP Kordich JJ Kim HA Schwann cell preparation from single mouse embryos: analyses of neurofibromin function in Schwann cells Methods Enzymol 2006 407 22 33 10.1016/S0076-6879(05)07003-5 16757311 Ratner N, Williams JP, Kordich JJ, Kim HA. Schwann cell preparation from single mouse embryos: analyses of neurofibromin function in Schwann cells. Methods Enzymol. 2006;407:22–33. 16757311 10.1016/S0076-6879(05)07003-5 15. Zhang LL Gao CY Fang CQ Wang YJ Gao D Yao GE Xiang J Wang JZ Li JC PPARgamma attenuates intimal hyperplasia by inhibiting TLR4-mediated inflammation in vascular smooth muscle cells Cardiovasc Res 2011 92 3 484 493 10.1093/cvr/cvr238 21880694 Zhang LL, Gao CY, Fang CQ, Wang YJ, Gao D, Yao GE, et al. PPARgamma attenuates intimal hyperplasia by inhibiting TLR4-mediated inflammation in vascular smooth muscle cells. Cardiovasc Res. 2011;92(3):484–93. 21880694 10.1093/cvr/cvr238 16. Takawale A Zhang P Patel VB Wang X Oudit G Kassiri Z Tissue inhibitor of matrix metalloproteinase-1 promotes myocardial fibrosis by mediating CD63-integrin beta1 interaction Hypertension 2017 69 6 1092 1103 10.1161/HYPERTENSIONAHA.117.09045 28373589 Takawale A, Zhang P, Patel VB, Wang X, Oudit G, Kassiri Z. Tissue inhibitor of matrix metalloproteinase-1 promotes myocardial fibrosis by mediating CD63-integrin beta1 interaction. Hypertension. 2017;69(6):1092–103. 28373589 10.1161/HYPERTENSIONAHA.117.09045 17. Meng X Yang J Dong M Zhang K Tu E Gao Q Chen W Zhang C Zhang Y Regulatory t cells in cardiovascular diseases Nat Rev Cardiol 2016 13 3 167 179 10.1038/nrcardio.2015.169 26525543 PMC11849084 Meng X, Yang J, Dong M, Zhang K, Tu E, Gao Q, et al. Regulatory t cells in cardiovascular diseases. Nat Rev Cardiol. 2016;13(3):167–79. 26525543 10.1038/nrcardio.2015.169 PMC11849084 18. Vu MD Xiao X Gao W Degauque N Chen M Kroemer A Killeen N Ishii N Li XC OX40 costimulation turns off Foxp3+ Tregs Blood 2007 110 7 2501 2510 10.1182/blood-2007-01-070748 17575071 PMC1988917 Vu MD, Xiao X, Gao W, Degauque N, Chen M, Kroemer A, et al. OX40 costimulation turns off Foxp3+ Tregs. Blood. 2007;110(7):2501–10. 17575071 10.1182/blood-2007-01-070748 PMC1988917 19. Ruby CE Montler R Zheng R Shu S Weinberg AD IL-12 is required for anti-OX40-mediated CD4 T cell survival J Immunol 2008 180 4 2140 2148 10.4049/jimmunol.180.4.2140 18250420 Ruby CE, Montler R, Zheng R, Shu S, Weinberg AD. IL-12 is required for anti-OX40-mediated CD4 T cell survival. J Immunol. 2008;180(4):2140–8. 18250420 10.4049/jimmunol.180.4.2140 20. Kasashima S Kawashima A Kurose N Ozaki S Kasashima F Matsumoto Y Takemura H Ikeda H Harada KI Disordered balance of T-cell subsets in arterial tertiary lymphoid organs in immunoglobulin G4-related vascular disease J Am Heart Assoc 2023 12 24 e030356 10.1161/JAHA.123.030356 38063185 PMC10863754 Kasashima S, Kawashima A, Kurose N, Ozaki S, Kasashima F, Matsumoto Y, et al. Disordered balance of T-cell subsets in arterial tertiary lymphoid organs in immunoglobulin G4-related vascular disease. J Am Heart Assoc. 2023;12(24):e030356. 38063185 10.1161/JAHA.123.030356 PMC10863754 21. Okazaki T Honjo T The PD-1-PD-L pathway in immunological tolerance Trends Immunol 2006 27 4 195 201 10.1016/j.it.2006.02.001 16500147 Okazaki T, Honjo T. The PD-1-PD-L pathway in immunological tolerance. Trends Immunol. 2006;27(4):195–201. 16500147 10.1016/j.it.2006.02.001 22. Sun P Zhang L Gu Y Wei S Wang Z Li M Wang W Wang Z Bai H Immune checkpoint programmed death-1 mediates abdominal aortic aneurysm and pseudoaneurysm progression Biomed Pharmacother 2021 142 111955 10.1016/j.biopha.2021.111955 34339918 Sun P, Zhang L, Gu Y, Wei S, Wang Z, Li M, et al. Immune checkpoint programmed death-1 mediates abdominal aortic aneurysm and pseudoaneurysm progression. Biomed Pharmacother. 2021;142:111955. 34339918 10.1016/j.biopha.2021.111955 23. Sagan A Mikolajczyk TP Mrowiecki W MacRitchie N Daly K Meldrum A Migliarino S Delles C Urbanski K Filip G T cells are dominant population in human abdominal aortic aneurysms and their infiltration in the perivascular tissue correlates with disease severity Front Immunol 2019 10 1979 10.3389/fimmu.2019.01979 31552015 PMC6736986 Sagan A, Mikolajczyk TP, Mrowiecki W, MacRitchie N, Daly K, Meldrum A, et al. T cells are dominant population in human abdominal aortic aneurysms and their infiltration in the perivascular tissue correlates with disease severity. Front Immunol. 2019;10:1979. 31552015 10.3389/fimmu.2019.01979 PMC6736986 24. Li Y Ren P Dawson A Vasquez HG Ageedi W Zhang C Luo W Chen R Li Y Kim S Single-cell transcriptome analysis reveals dynamic cell populations and differential gene expression patterns in control and aneurysmal human aortic tissue Circulation 2020 142 14 1374 1388 10.1161/CIRCULATIONAHA.120.046528 33017217 PMC7539140 Li Y, Ren P, Dawson A, Vasquez HG, Ageedi W, Zhang C, et al. Single-cell transcriptome analysis reveals dynamic cell populations and differential gene expression patterns in control and aneurysmal human aortic tissue. Circulation. 2020;142(14):1374–88. 33017217 10.1161/CIRCULATIONAHA.120.046528 PMC7539140 25. Hou Y-c Li J-a Cao C Su C Qin Z Zhang G Guo J-c Tang J-n Zhang J-y Guan S-k Biodegradable Mg alloy modified with bioactive exosomes for cardiovascular stent application Journal of Magnesium and Alloys 2024 12 12 4988 5004 10.1016/j.jma.2023.05.007 Hou Y-c, Li J-a, Cao C, Su C, Qin Z, Zhang G, et al. Biodegradable Mg alloy modified with bioactive exosomes for cardiovascular stent application. Journal of Magnesium and Alloys. 2024;12(12):4988–5004. 26. Xiong W Zhao Y Prall A Greiner TC Baxter BT Key roles of CD4+ T cells and IFN-gamma in the development of abdominal aortic aneurysms in a murine model J Immunol 2004 172 4 2607 2612 10.4049/jimmunol.172.4.2607 14764734 Xiong W, Zhao Y, Prall A, Greiner TC, Baxter BT. Key roles of CD4+ T cells and IFN-gamma in the development of abdominal aortic aneurysms in a murine model. J Immunol. 2004;172(4):2607–12. 14764734 10.4049/jimmunol.172.4.2607 27. Reeps C Pelisek J Seidl S Schuster T Zimmermann A Kuehnl A Eckstein HH Inflammatory infiltrates and neovessels are relevant sources of MMPs in abdominal aortic aneurysm wall Pathobiology 2009 76 5 243 252 10.1159/000228900 19816084 Reeps C, Pelisek J, Seidl S, Schuster T, Zimmermann A, Kuehnl A, et al. Inflammatory infiltrates and neovessels are relevant sources of MMPs in abdominal aortic aneurysm wall. Pathobiology. 2009;76(5):243–52. 19816084 10.1159/000228900 28. Lindholt JS Shi GP Chronic inflammation, immune response, and infection in abdominal aortic aneurysms European Journal of Vascular and Endovascular Surgery : the Official Journal of the European Society For Vascular Surgery 2006 31 5 453 463 10.1016/j.ejvs.2005.10.030 16414293 Lindholt JS, Shi GP. Chronic inflammation, immune response, and infection in abdominal aortic aneurysms. European Journal of Vascular and Endovascular Surgery : the Official Journal of the European Society For Vascular Surgery. 2006;31(5):453–63. 16414293 10.1016/j.ejvs.2005.10.030 29. Hellenthal FAMVI Buurman WA Wodzig WKWH Schurink GWH Biomarkers of abdominal aortic aneurysm progression. Part 2: inflammation Nat Rev Cardiol 2009 6 8 543 552 10.1038/nrcardio.2009.102 19546866 Hellenthal FAMVI, Buurman WA, Wodzig WKWH, Schurink GWH. Biomarkers of abdominal aortic aneurysm progression. Part 2: inflammation. Nat Rev Cardiol. 2009;6(8):543–52. 19546866 10.1038/nrcardio.2009.102 30. Henderson EL Geng YJ Sukhova GK Whittemore AD Knox J Libby P Death of smooth muscle cells and expression of mediators of apoptosis by T lymphocytes in human abdominal aortic aneurysms Circulation 1999 99 1 96 104 10.1161/01.CIR.99.1.96 9884385 Henderson EL, Geng YJ, Sukhova GK, Whittemore AD, Knox J, Libby P. Death of smooth muscle cells and expression of mediators of apoptosis by T lymphocytes in human abdominal aortic aneurysms. Circulation. 1999;99(1):96–104. 9884385 10.1161/01.cir.99.1.96 31. Bozic I Savic D Laketa D Bjelobaba I Milenkovic I Pekovic S Nedeljkovic N Lavrnja I Benfotiamine attenuates inflammatory response in LPS stimulated BV-2 microglia PLoS ONE 2015 10 2 e0118372 10.1371/journal.pone.0118372 25695433 PMC4335016 Bozic I, Savic D, Laketa D, Bjelobaba I, Milenkovic I, Pekovic S, et al. Benfotiamine attenuates inflammatory response in LPS stimulated BV-2 microglia. PLoS ONE. 2015;10(2):e0118372. 25695433 10.1371/journal.pone.0118372 PMC4335016 32. Bozic I Savic D Stevanovic I Pekovic S Nedeljkovic N Lavrnja I Benfotiamine upregulates antioxidative system in activated BV-2 microglia cells Front Cell Neurosci 2015 9 351 10.3389/fncel.2015.00351 26388737 PMC4559599 Bozic I, Savic D, Stevanovic I, Pekovic S, Nedeljkovic N, Lavrnja I. Benfotiamine upregulates antioxidative system in activated BV-2 microglia cells. Front Cell Neurosci. 2015;9:351. 26388737 10.3389/fncel.2015.00351 PMC4559599 33. Yadav UC Kalariya NM Srivastava SK Ramana KV Protective role of benfotiamine, a fat-soluble vitamin B1 analogue, in lipopolysaccharide-induced cytotoxic signals in murine macrophages Free Radic Biol Med 2010 48 10 1423 1434 10.1016/j.freeradbiomed.2010.02.031 20219672 PMC2856750 Yadav UC, Kalariya NM, Srivastava SK, Ramana KV. Protective role of benfotiamine, a fat-soluble vitamin B1 analogue, in lipopolysaccharide-induced cytotoxic signals in murine macrophages. Free Radic Biol Med. 2010;48(10):1423–34. 20219672 10.1016/j.freeradbiomed.2010.02.031 PMC2856750 34. Djedovic N Božić I Miljković Đ Lavrnja I Benfotiamine reduces dendritic cell inflammatory potency Endocr Metab Immune Disord Drug Targets 2021 21 7 1344 1351 10.2174/1871530320999200905114135 32888286 Djedovic N, Božić I, Miljković Đ, Lavrnja I. Benfotiamine reduces dendritic cell inflammatory potency. Endocr Metab Immune Disord Drug Targets. 2021;21(7):1344–51. 32888286 10.2174/1871530320999200905114135 35. Milde-Langosch K The fos family of transcription factors and their role in tumourigenesis Eur J Cancer 2005 41 16 2449 2461 10.1016/j.ejca.2005.08.008 16199154 Milde-Langosch K. The fos family of transcription factors and their role in tumourigenesis. Eur J Cancer. 2005;41(16):2449–61. 16199154 10.1016/j.ejca.2005.08.008 36. Hernandez JM Floyd DH Weilbaecher KN Green PL Boris-Lawrie K Multiple facets of junD Oncogene 2008 27 35 4757 4767 10.1038/onc.2008.120 18427548 PMC2726657 Hernandez JM, Floyd DH, Weilbaecher KN, Green PL, Boris-Lawrie K. Multiple facets of junD 18427548 10.1038/onc.2008.120 PMC2726657 37. Gazon H Barbeau B Mesnard JM Peloponese JM Jr Hijacking of the AP-1 signaling pathway during development of ATL Front Microbiol 2017 8 2686 10.3389/fmicb.2017.02686 29379481 PMC5775265 Gazon H, Barbeau B, Mesnard JM, Peloponese JM Jr. Hijacking of the AP-1 signaling pathway during development of ATL. Front Microbiol. 2017;8:2686. 29379481 10.3389/fmicb.2017.02686 PMC5775265 38. Yoza BK Brooks JW Mizel SB Induction of AP-1 transcription factor components during T-cell activation by interleukin 1 and phorbol esters Cell Growth Differ 1992 3 10 677 684 1445798 Yoza BK, Brooks JW, Mizel SB. Induction of AP-1 transcription factor components during T-cell activation by interleukin 1 and phorbol esters. Cell Growth Differ. 1992;3(10):677–84. 1445798 39. Li H Li R Gong C Wu Z Jia Q The relationship between dietary vitamin B1 intake and severe abdominal aortic calcification among the general population in the United States Front Cardiovasc Med 2024 11 1415151 10.3389/fcvm.2024.1415151 39606188 PMC11599191 Li H, Li R, Gong C, Wu Z, Jia Q. The relationship between dietary vitamin B1 intake and severe abdominal aortic calcification among the general population in the United States. Front Cardiovasc Med. 2024;11:1415151. 39606188 10.3389/fcvm.2024.1415151 PMC11599191 40. Gäbel G, Northoff BH, Weinzierl I, Ludwig S, Hinterseher I, Wilfert W, Teupser D, Doderer SA, Bergert H, Schönleben F, et al. Molecular fingerprint for terminal abdominal aortic aneurysm disease. J Am Heart Assoc 2017, 6(12). https://www.ahajournals.org/doi/10.1161/JAHA.117.006798 https://www.ncbi.nlm.nih.gov/geo/query/acc.cgi?acc=GSE98278 10.1161/JAHA.117.006798 PMC5779007 29191809 41. Biros E, Gäbel G, Moran CS, Schreurs C, Lindeman JH, Walker PJ, Nataatmadja M, West M, Holdt LM, Hinterseher I, et al. Differential gene expression in human abdominal aortic aneurysm and aortic occlusive disease. Oncotarget. 2015;6(15):12984–96. 10.18632/oncotarget.3848. NCBI Sequence Read Archive. https://www.ncbi.nlm.nih.gov/geo/query/acc.cgi?acc=GSE57691 10.18632/oncotarget.3848 PMC4536993 25944698 42. Lenk GM Tromp G Weinsheimer S Gatalica Z Berguer R Kuivaniemi H Whole genome expression profiling reveals a significant role for immune function in human abdominal aortic aneurysms BMC Genomics 2007 8 237 10.1186/1471-2164-8-237 17634102 PMC1934369 Lenk GM, Tromp G, Weinsheimer S, Gatalica Z, Berguer R, Kuivaniemi H. Whole genome expression profiling reveals a significant role for immune function in human abdominal aortic aneurysms. BMC Genomics. 2007;8:237. 10.1186/1471-2164-8-237. 17634102 10.1186/1471-2164-8-237 PMC1934369 43. Ritchie ME Phipson B Wu D Hu Y Law CW Shi W Smyth GK Limma powers differential expression analyses for RNA-sequencing and microarray studies Nucleic Acids Res 2015 43 7 e47 10.1093/nar/gkv007 25605792 PMC4402510 Ritchie ME, Phipson B, Wu D, Hu Y, Law CW, Shi W, et al. Limma powers differential expression analyses for RNA-sequencing and microarray studies. Nucleic Acids Res. 2015;43(7):e47. 25605792 10.1093/nar/gkv007 PMC4402510 44. Leek JT Johnson WE Parker HS Jaffe AE Storey JD The sva package for removing batch effects and other unwanted variation in high-throughput experiments Bioinformatics 2012 28 6 882 883 10.1093/bioinformatics/bts034 22257669 PMC3307112 Leek JT, Johnson WE, Parker HS, Jaffe AE, Storey JD. The sva package for removing batch effects and other unwanted variation in high-throughput experiments. Bioinformatics. 2012;28(6):882–3. 22257669 10.1093/bioinformatics/bts034 PMC3307112 45. Davis FM Tsoi LC Melvin WJ denDekker A Wasikowski R Joshi AD Wolf S Obi AT Billi AC Xing X Inhibition of macrophage histone demethylase JMJD3 protects against abdominal aortic aneurysms J Exp Med 2021 10.1084/jem.20201839 33779682 PMC8008365 Davis FM, Tsoi LC, Melvin WJ, denDekker A, Wasikowski R, Joshi AD, et al. Inhibition of macrophage histone demethylase JMJD3 protects against abdominal aortic aneurysms. J Exp Med. 2021. 10.1084/jem.20201839. 33779682 10.1084/jem.20201839 PMC8008365 46. Zheng R Wan C Mei S Qin Q Wu Q Sun H Chen CH Brown M Zhang X Meyer CA Cistrome data browser: expanded datasets and new tools for gene regulatory analysis Nucleic Acids Res 2019 47 D1 D729 D735 10.1093/nar/gky1094 30462313 PMC6324081 Zheng R, Wan C, Mei S, Qin Q, Wu Q, Sun H, et al. Cistrome data browser: expanded datasets and new tools for gene regulatory analysis. Nucleic Acids Res. 2019;47(D1):D729–35. 30462313 10.1093/nar/gky1094 PMC6324081 47. Butler A Hoffman P Smibert P Papalexi E Satija R Integrating single-cell transcriptomic data across different conditions, technologies, and species Nat Biotechnol 2018 36 5 411 420 10.1038/nbt.4096 29608179 PMC6700744 Butler A, Hoffman P, Smibert P, Papalexi E, Satija R. Integrating single-cell transcriptomic data across different conditions, technologies, and species. Nat Biotechnol. 2018;36(5):411–20. 29608179 10.1038/nbt.4096 PMC6700744 48. Zhang S Zhang G Wang W Guo S-B Zhang P Wang F Zhou Q Zhou Z Wang Y Sun H An assessment system for clinical and biological interpretability in ulcerative colitis Aging (Albany NY) 2024 16 4 3856 3879 10.18632/aging.205564 38372705 PMC10929837 Zhang S, Zhang G, Wang W, Guo S-B, Zhang P, Wang F, et al. An assessment system for clinical and biological interpretability in ulcerative colitis. Aging (Albany NY). 2024;16(4):3856–79. 38372705 10.18632/aging.205564 PMC10929837 49. Zhang X Lan Y Xu J Quan F Zhao E Deng C Luo T Xu L Liao G Yan M Cell marker: a manually curated resource of cell markers in human and mouse Nucleic Acids Res 2019 47 D1 D721 D728 10.1093/nar/gky900 30289549 PMC6323899 Zhang X, Lan Y, Xu J, Quan F, Zhao E, Deng C, et al. Cell marker: a manually curated resource of cell markers in human and mouse. Nucleic Acids Res. 2019;47(D1):D721–8. 30289549 10.1093/nar/gky900 PMC6323899 50. Aran D Looney AP Liu L Wu E Fong V Hsu A Chak S Naikawadi RP Wolters PJ Abate AR Reference-based analysis of lung single-cell sequencing reveals a transitional profibrotic macrophage Nat Immunol 2019 20 2 163 172 10.1038/s41590-018-0276-y 30643263 PMC6340744 Aran D, Looney AP, Liu L, Wu E, Fong V, Hsu A, et al. Reference-based analysis of lung single-cell sequencing reveals a transitional profibrotic macrophage. Nat Immunol. 2019;20(2):163–72. 30643263 10.1038/s41590-018-0276-y PMC6340744 51. Jin S Guerrero-Juarez CF Zhang L Chang I Ramos R Kuan C-H Myung P Plikus MV Nie Q Inference and analysis of cell-cell communication using Cell Chat Nat Commun 2021 12 1 1088 10.1038/s41467-021-21246-9 33597522 PMC7889871 Jin S, Guerrero-Juarez CF, Zhang L, Chang I, Ramos R, Kuan C-H, et al. Inference and analysis of cell-cell communication using Cell Chat. Nat Commun. 2021;12(1):1088. 33597522 10.1038/s41467-021-21246-9 PMC7889871 52. Wang Y, Wang R, Zhang S, Song S, Jiang C, Han G, et al. iTALK: an R package to characterize and illustrate intercellular communication. bioRxiv [Preprint]2019:507871.Available from: 10.1101/507871. Preprint. 53. Qiu X Mao Q Tang Y Wang L Chawla R Pliner HA Trapnell C Reversed graph embedding resolves complex single-cell trajectories Nat Methods 2017 14 10 979 982 10.1038/nmeth.4402 28825705 PMC5764547 Qiu X, Mao Q, Tang Y, Wang L, Chawla R, Pliner HA, et al. Reversed graph embedding resolves complex single-cell trajectories. Nat Methods. 2017;14(10):979–82. 28825705 10.1038/nmeth.4402 PMC5764547 54. Li Z Pei S Wang Y Zhang G Lin H Dong S Advancing predictive markers in lung adenocarcinoma: a machine learning-based immunotherapy prognostic prediction signature Environ Toxicol 2024 39 10 4581 4593 10.1002/tox.24284 38591820 Li Z, Pei S, Wang Y, Zhang G, Lin H, Dong S. Advancing predictive markers in lung adenocarcinoma: a machine learning-based immunotherapy prognostic prediction signature. Environ Toxicol. 2024;39(10):4581–93. 38591820 10.1002/tox.24284 55. Maa B Sjca B Ucell: robust and scalable single-cell gene signature scoring Comput Struct Biotechnol J 2021 19 3796 3798 10.1016/j.csbj.2021.06.043 34285779 PMC8271111 Maa B, Sjca B. Ucell: robust and scalable single-cell gene signature scoring. Comput Struct Biotechnol J. 2021;19:3796–8. 34285779 10.1016/j.csbj.2021.06.043 PMC8271111 56. Zhang G Liu Z Deng J Liu L Li Y Weng S Guo C Zhou Z Zhang L Wang X Smooth muscle cell fate decisions decipher a high-resolution heterogeneity within atherosclerosis molecular subtypes J Transl Med 2022 20 1 568 10.1186/s12967-022-03795-9 36474294 PMC9724432 Zhang G, Liu Z, Deng J, Liu L, Li Y, Weng S, et al. Smooth muscle cell fate decisions decipher a high-resolution heterogeneity within atherosclerosis molecular subtypes. J Transl Med. 2022;20(1):568. 36474294 10.1186/s12967-022-03795-9 PMC9724432 57. Yu G Wang L-G Han Y He Q-Y Clusterprofiler: an R package for comparing biological themes among gene clusters OMICS 2012 16 5 284 287 10.1089/omi.2011.0118 22455463 PMC3339379 Yu G, Wang L-G, Han Y, He Q-Y. Clusterprofiler: an R package for comparing biological themes among gene clusters. OMICS. 2012;16(5):284–7. 22455463 10.1089/omi.2011.0118 PMC3339379 58. Liberzon A Birger C Thorvaldsdottir H Ghandi M Mesirov JP Tamayo P The molecular signatures database (MSigDB) hallmark gene set collection Cell Syst 2015 1 6 417 425 10.1016/j.cels.2015.12.004 26771021 PMC4707969 Liberzon A, Birger C, Thorvaldsdottir H, Ghandi M, Mesirov JP, Tamayo P. The molecular signatures database (MSigDB) hallmark gene set collection. Cell Syst. 2015;1(6):417–25. 26771021 10.1016/j.cels.2015.12.004 PMC4707969 59. Zhang G Cui X Zhang L Liu G Zhu X Shangguan J Zhang W Zheng Y Zhang H Tang J Uncovering the genetic links of SARS-CoV-2 infections on heart failure co-morbidity by a systems biology approach ESC Heart Fail 2022 9 5 2937 2954 10.1002/ehf2.14003 35727093 PMC9349450 Zhang G, Cui X, Zhang L, Liu G, Zhu X, Shangguan J, et al. Uncovering the genetic links of SARS-CoV-2 infections on heart failure co-morbidity by a systems biology approach. ESC Heart Fail. 2022;9(5):2937–54. 35727093 10.1002/ehf2.14003 PMC9349450 60. Pomyen Y Segura M Ebbels TMD Keun HC Over-representation of correlation analysis (ORCA): a method for identifying associations between variable sets Bioinformatics 2015 31 1 102 108 10.1093/bioinformatics/btu589 25183485 Pomyen Y, Segura M, Ebbels TMD, Keun HC. Over-representation of correlation analysis (ORCA): a method for identifying associations between variable sets. Bioinformatics. 2015;31(1):102–8. 25183485 10.1093/bioinformatics/btu589 61. Hanzelmann S Castelo R Guinney J GSVA: gene set variation analysis for microarray and RNA-seq data BMC Bioinformatics 2013 14 7 10.1186/1471-2105-14-7 23323831 PMC3618321 Hanzelmann S, Castelo R, Guinney J. GSVA: gene set variation analysis for microarray and RNA-seq data. BMC Bioinformatics. 2013;14:7. 23323831 10.1186/1471-2105-14-7 PMC3618321 62. Subramanian A Tamayo P Mootha VK Mukherjee S Ebert BL Gillette MA Paulovich A Pomeroy SL Golub TR Lander ES Gene set enrichment analysis: a knowledge-based approach for interpreting genome-wide expression profiles Proc Natl Acad Sci U S A 2005 102 43 15545 15550 10.1073/pnas.0506580102 16199517 PMC1239896 Subramanian A, Tamayo P, Mootha VK, Mukherjee S, Ebert BL, Gillette MA, et al. Gene set enrichment analysis: a knowledge-based approach for interpreting genome-wide expression profiles. Proc Natl Acad Sci U S A. 2005;102(43):15545–50. 16199517 10.1073/pnas.0506580102 PMC1239896 63. Zhang P Wang D Zhou G Jiang S Zhang G Zhang L Zhang Z Novel post-translational modification learning signature reveals B4GALT2 as an immune exclusion regulator in lung adenocarcinoma J Immunother Cancer 2025 10.1136/jitc-2024-010787 40010763 PMC11865799 Zhang P, Wang D, Zhou G, Jiang S, Zhang G, Zhang L, et al. Novel post-translational modification learning signature reveals B4GALT2 as an immune exclusion regulator in lung adenocarcinoma. J Immunother Cancer. 2025. 10.1136/jitc-2024-010787. 40010763 10.1136/jitc-2024-010787 PMC11865799 64. Bindea G Mlecnik B Tosolini M Kirilovsky A Waldner M Obenauf AC Angell H Fredriksen T Lafontaine L Berger A Spatiotemporal dynamics of intratumoral immune cells reveal the immune landscape in human cancer Immunity 2013 39 4 782 795 10.1016/j.immuni.2013.10.003 24138885 Bindea G, Mlecnik B, Tosolini M, Kirilovsky A, Waldner M, Obenauf AC, et al. Spatiotemporal dynamics of intratumoral immune cells reveal the immune landscape in human cancer. Immunity. 2013;39(4):782–95. 24138885 10.1016/j.immuni.2013.10.003 65. Charoentong P Finotello F Angelova M Mayer C Efremova M Rieder D Hackl H Trajanoski Z Pan-cancer immunogenomic analyses reveal genotype-immunophenotype relationships and predictors of response to checkpoint blockade Cell Rep 2017 18 1 248 262 10.1016/j.celrep.2016.12.019 28052254 Charoentong P, Finotello F, Angelova M, Mayer C, Efremova M, Rieder D, et al. Pan-cancer immunogenomic analyses reveal genotype-immunophenotype relationships and predictors of response to checkpoint blockade. Cell Rep. 2017;18(1):248–62. 28052254 10.1016/j.celrep.2016.12.019 66. Liu CL Liu X Zhang Y Liu J Yang C Luo S Liu T Wang Y Lindholt JS Diederichsen A Eosinophils protect mice from angiotensin-II perfusion-induced abdominal aortic aneurysm Circ Res 2021 128 2 188 202 10.1161/CIRCRESAHA.120.318182 33153394 PMC7855167 Liu CL, Liu X, Zhang Y, Liu J, Yang C, Luo S, et al. Eosinophils protect mice from angiotensin-II perfusion-induced abdominal aortic aneurysm. Circ Res. 2021;128(2):188–202. 33153394 10.1161/CIRCRESAHA.120.318182 PMC7855167 67. Friedman J Hastie T Tibshirani R Regularization paths for generalized linear models via coordinate descent J Stat Softw 2010 33 1 1 22 10.18637/jss.v033.i01 20808728 PMC2929880 Friedman J, Hastie T, Tibshirani R. Regularization paths for generalized linear models via coordinate descent. J Stat Softw. 2010;33(1):1–22. 20808728 PMC2929880 68. Zhang G Wang Z Tong Z Qin Z Su C Li D Xu S Li K Zhou Z Xu Y AI hybrid survival assessment for advanced heart failure patients with renal dysfunction Nat Commun 2024 15 1 6756 10.1038/s41467-024-50415-9 39117613 PMC11310499 Zhang G, Wang Z, Tong Z, Qin Z, Su C, Li D, et al. AI hybrid survival assessment for advanced heart failure patients with renal dysfunction. Nat Commun. 2024;15(1):6756. 39117613 10.1038/s41467-024-50415-9 PMC11310499 69. Zhang S Zhang G Wang M Guo S-B Wang F Li Y Kadier K Zhou Z Zhang P Chi H Artificial intelligence hybrid survival assessment system for robot-assisted proctectomy: a retrospective cohort study JCO Precis Oncol 2024 8 e2400089 10.1200/PO.24.00089 39432882 Zhang S, Zhang G, Wang M, Guo S-B, Wang F, Li Y, et al. Artificial intelligence hybrid survival assessment system for robot-assisted proctectomy: a retrospective cohort study. JCO Precis Oncol. 2024;8:e2400089. 39432882 10.1200/PO.24.00089 70. Huang ML Hung YH Lee WM Li RK Jiang BR SVM-RFE based feature selection and Taguchi parameters optimization for multiclass SVM classifier ScientificWorldJournal 2014 2014 795624 10.1155/2014/795624 25295306 PMC4175386 Huang ML, Hung YH, Lee WM, Li RK, Jiang BR. SVM-RFE based feature selection and Taguchi parameters optimization for multiclass SVM classifier. ScientificWorldJournal. 2014;2014:795624. 25295306 10.1155/2014/795624 PMC4175386 71. Zhang G Cui X Qin Z Wang Z Lu Y Xu Y Xu S Tang L Zhang L Liu G Atherosclerotic plaque vulnerability quantification system for clinical and biological interpretability iScience 2023 26 9 107587 10.1016/j.isci.2023.107587 37664595 PMC10470306 Zhang G, Cui X, Qin Z, Wang Z, Lu Y, Xu Y, et al. Atherosclerotic plaque vulnerability quantification system for clinical and biological interpretability. iScience. 2023;26(9):107587. 37664595 10.1016/j.isci.2023.107587 PMC10470306 72. Cooper HA Cicalese S Preston KJ Kawai T Okuno K Choi ET Kasahara S Uchida HA Otaka N Scalia R Targeting mitochondrial fission as a potential therapeutic for abdominal aortic aneurysm Cardiovasc Res 2021 117 3 971 982 10.1093/cvr/cvaa133 32384150 PMC7898955 Cooper HA, Cicalese S, Preston KJ, Kawai T, Okuno K, Choi ET, et al. Targeting mitochondrial fission as a potential therapeutic for abdominal aortic aneurysm. Cardiovasc Res. 2021;117(3):971–82. 32384150 10.1093/cvr/cvaa133 PMC7898955 73. Loick P Mohammad GH Cassimjee I Chandrashekar A Lapolla P Carrington A Vera-Aviles M Handa A Lee R Lakhal-Littleton S Protective role for smooth muscle cell hepcidin in abdominal aortic aneurysm Arterioscler Thromb Vasc Biol 2023 43 5 713 725 10.1161/ATVBAHA.123.319224 36951059 PMC10125116 Loick P, Mohammad GH, Cassimjee I, Chandrashekar A, Lapolla P, Carrington A, et al. Protective role for smooth muscle cell hepcidin in abdominal aortic aneurysm. Arterioscler Thromb Vasc Biol. 2023;43(5):713–25. 36951059 10.1161/ATVBAHA.123.319224 PMC10125116 74. Guo X Cai D Dong K Li C Xu Z Chen SY DOCK2 deficiency attenuates abdominal aortic aneurysm formation-brief report Arterioscler Thromb Vasc Biol 2023 43 6 e210 e217 10.1161/ATVBAHA.122.318400 37021575 PMC10212530 Guo X, Cai D, Dong K, Li C, Xu Z, Chen SY. DOCK2 deficiency attenuates abdominal aortic aneurysm formation-brief report. Arterioscler Thromb Vasc Biol. 2023;43(6):e210–7. 37021575 10.1161/ATVBAHA.122.318400 PMC10212530 75. Zhang G Gong S Pang L Hou L He W Efficacy and safety of apatinib treatment for advanced cholangiocarcinoma after failed gemcitabine-based chemotherapy: an open-label phase II prospective study Front Oncol 2021 11 659217 10.3389/fonc.2021.659217 34012920 PMC8126718 Zhang G, Gong S, Pang L, Hou L, He W. Efficacy and safety of apatinib treatment for advanced cholangiocarcinoma after failed gemcitabine-based chemotherapy: an open-label phase II prospective study. Front Oncol. 2021;11:659217. 34012920 10.3389/fonc.2021.659217 PMC8126718 ",
  "metadata": {
    "Title of this paper": "Efficacy and safety of apatinib treatment for advanced cholangiocarcinoma after failed gemcitabine-based chemotherapy: an open-label phase II prospective study",
    "Journal it was published in:": "BMC Biology",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12465141/"
  }
}