{
  "title": "Paper_913",
  "abstract": "pmc J Med Case Rep J Med Case Rep 476 jmedcasrep Journal of Medical Case Reports 1752-1947 BMC PMC12486764 PMC12486764.1 12486764 12486764 41029737 10.1186/s13256-025-05474-x 5474 1 Case Report Extraneural and extracranial metastatic astrocytoma with primitive neuroectodermal component: a case report http://orcid.org/0000-0002-8816-7061 Gomez Frayne fraynegomez@gmail.com 1 Evans Stephen 1 Foroughi Forough 2 Karanth Narayan 3 1 https://ror.org/04h7nbn38 grid.413314.0 0000 0000 9984 5644 The Canberra Hospital, 2 https://ror.org/04rdvs602 grid.508265.c 0000 0004 0500 8378 Sullivan Nicolaides Pathology, 3 https://ror.org/04jq72f57 grid.240634.7 0000 0000 8966 2764 Royal Darwin Hospital, 30 9 2025 2025 19 478511 471 5 9 2024 21 7 2025 30 09 2025 02 10 2025 02 10 2025 © Crown 2025 2025 https://creativecommons.org/licenses/by/4.0/ Open Access http://creativecommons.org/licenses/by/4.0/ Background Astrocytoma is a highly malignant tumor of the central nervous system with limited survival, despite standard multimodal therapies. While typically remains confined to the central nervous system, rare instances of extraneural and extracranial metastasis have been documented. The underlying pathophysiology remains poorly understood, with very few reported cases—particularly in tumors harboring isocitrate dehydrogenase mutations. Case presentation We describe the case of a 21-year-old female New Zealander of European descent with O 6 Conclusion This case represents an unusual presentation of extraneural and extracranial metastatic spread in a young female New Zealander of European descent with an isocitrate dehydrogenase-mutant astrocytoma. Compared with recent literature, it is notable for early systemic dissemination and the coexistence of bone and leptomeningeal disease. A multidisciplinary discussion concluded that additional biopsy of metastatic sites was unwarranted owing to clear pathological correlation, clinical decline, and poor prognosis. Molecular characteristics such as cyclin-dependent kinase inhibitor 2A/2B deletion may further refine classification. A review of current literature underscores the importance of the 2021 World Health Organization classification updates and highlights potential roles for epithelial–mesenchymal transition and glymphatic dissemination in metastasis. Targeted therapies—particularly isocitrate dehydrogenase inhibitors—are under active investigation. This case reinforces the need for ongoing research into predictive biomarkers and individualized treatment strategies. Keywords Astrocytoma Primitive neuroectodermal tumor Metastatic astrocytoma Glioblastoma Isocitrate dehydrogenase pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement no pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes issue-copyright-statement © BioMed Central Ltd., part of Springer Nature 2025 Introduction Astrocytomas almost exclusively remain confined to the central nervous system (CNS), and systemic metastases are extremely rare, with an estimated incidence well below 1% (reported in < 0.5% of cases, comprising fewer than 200 published instances) [ 1 et al 1 1 2 1 1 3 Within the spectrum of high-grade astrocytic tumors, there is a rare histopathological variant characterized by a primitive neuroectodermal tumor (PNET) component. Historically, such tumors were referred to as glioblastoma (GBM) with a PNET component. Patients with this variant tend to be younger, and some studies suggest the PNET-like component may confer an increased propensity for extracranial spread [ 4 5 6 7 In this context, we present a unique case of an IDH-1-R132H-mutant grade 4 astrocytoma with a PNET-like component that developed biopsy-proven extraneural metastases. The aim of this report is to highlight the occurrence of systemic metastasis in a diffuse astrocytoma variant and to align the discussion with current classification and management paradigms. This case has educational value for clinicians, underscoring that new systemic complaints in a patient with glioma (especially one who survives longer-term or has unusual histology) should prompt evaluation for metastasis despite its rarity. Case presentation A fully independent 21-year-old female New Zealander of European descent presented to the emergency department with headache, dizziness, and vomiting. Cranial computed tomography (CT) and magnetic resonance imaging (MRI) demonstrated a large solitary mass in the left frontal lobe, abutting the falx cerebri and crossing the midline, measuring 6.2 × 6 × 6 cm. She underwent an urgent bifrontal craniotomy to debulk the tumor. Immediate postoperative CT scans demonstrated residual tumor in the left medial frontal lobe; therefore, a left redo frontal craniotomy for further debulking was performed. MRI of the brain 1 week later showed no residual disease in the left frontal region. Histopathology from both resections showed locally invasive high-grade glioma of gemistocytic morphology with areas of small-round-blue-cell appearance consisting of cells with small, hyperchromatic, pleomorphic nuclei and minimal cytoplasm set within a fibrillary background (Fig. 1 in-situ 6 Fig. 1 Histology from craniotomy. A B C D A course of adjuvant radiotherapy (60 Gray (Gy) in 30 fractions) was delivered with dexamethasone support. The patient declined concurrent and adjuvant temozolomide (per the Stupp protocol). She was a New Zealander of European descent and had no significant past medical history; body-mass index was normal. Childhood history included bilateral tympanostomy tubes. She was a nonsmoker who consumed alcohol socially and was studying at university. Family history was notable for her mother’s colorectal cancer, now in remission. At 6 months after her original diagnosis, she represented with headache, new-onset back pain and seizures. Brain CT and MRI showed sizeable regrowth of residual tumor in the left frontal region with overlying leptomeningeal involvement. Contrast CT of the chest, abdomen, and pelvis demonstrated a patchy appearance of the thoracolumbar bone marrow. Single-photon emission computed tomography (SPECT) demonstrated high radiotracer uptake throughout the skeleton consistent with extensive metastatic bone disease, involving the skull, spine, rib cage, scapulae, clavicles, sternum, pelvis, and femora (Fig. 2 Fig. 2 Whole-body technetium-99 nuclear-medicine scan showing diffuse metastatic bone disease with a primitive neuroectodermal tumor component A full blood count showed mild normocytic anemia and thrombocytopenia with a leuco-erythroblastic picture. Lumbar puncture revealed high protein, low glucose, and lymphocytosis; no organisms or malignant cells were detected, and flow cytometry was unremarkable. Leptomeningeal biopsy was not pursued owing to the risk of spinal-cord damage and the low likelihood of altering management. Given the diffuse radiological bone and marrow involvement, a bone-marrow aspirate (dry tap) was performed (Fig. 2 3 Fig. 3 Bone-marrow biopsy. A B D With these findings, her condition was deemed terminal with a very poor prognosis. There was no role for further surgery, radiotherapy, or systemic therapy, and her Eastern Co-operative Oncology Group (ECOG) performance status was 3. She was referred to hospice care and died 8 months after the original diagnosis. Table 1 Table 1 Timeline of diagnosis and treatment for our patient Discussion Extraneural metastasis of diffuse gliomas—especially those with IDH mutations—is exceedingly rare. Systemic dissemination of glioblastoma (GBM) has an incidence of only ~0.2–0.5% [ 2 8 5 9 10 n 10 3 A 2023 case report by Sudarsan et al 11 2 et al 4 Recent literature has illuminated mechanisms by which gliomas overcome anatomic constraints: activation of EMT programmes, dissemination via cerebrospinal fluid and the glymphatic–meningeal–lymphatic pathway, and acquisition of genetic alterations conferring invasiveness (for example. PTEN loss, EGFR amplification, CDKN2A/B deletion) [ 3 9 12 3 Management of metastatic high-grade glioma remains palliative. Molecular profiling may identify actionable mutations: v-raf murine sarcoma viral oncogene homolog B1 (BRAF) V600E (for BRAF/MEK inhibitors) or fibroblast growth factor receptor–transforming acidic coiled-coil containing protein (FGFR–TACC) fusions (for FGFR inhibitors) in selected cases. In our patient, no such targets were present, but the IDH1 mutation offers a potential avenue. Mutant-IDH inhibitors (ivosidenib, olutasidenib, and vorasidenib) are under active investigation. The phase III “Investigating Non-enhancing Diffuse IDH-mutant Glioma Outcomes” (INDIGO) trial showed brain-penetrant IDH1/2 inhibition with vorasidenib prolonging progression-free survival in residual/recurrent IDH-mutant low-grade gliomas [ 13 13 In view of clear histopathological concordance between intracranial and distant lesions and rapid clinical decline, further metastatic-site biopsy was eschewed. This aligned with the patient’s goals of care and the adopted palliative focus. Conclusion This case highlights a rare presentation of extraneural, extracranial metastatic spread from an IDH-mutant astrocytoma (WHO grade 4) with PNET-like features. Despite the modern exclusion of the term “glioblastoma” for IDH-mutant tumors, aggressive behavior and widespread dissemination can still occur. Thorough molecular profiling and awareness of updated WHO criteria are essential. Clinicians should maintain vigilance for systemic metastasis when new symptoms arise, even in tumors traditionally considered nonmetastasising. Targeted therapies—particularly IDH inhibitors—show promise but require further study. Ongoing research should prioritize predictive biomarkers (for example. CDKN2A/B loss) and dissemination pathways to develop individualized treatments that improve survival and quality of life in this challenging scenario. Publisher’s Note Springer Nature remains neutral with regard to jurisdictional claims in published maps and institutional affiliations. Acknowledgements We have no acknowledgements. Author contributions This manuscript is the original work of myself where I made the most significant contribution to this article. The three other authors (that is. Dr Stephen Evan, Dr Forough Foroughi, and Dr. Narayan Karanth) assisted with intellectual support. Funding There was no funding for this report. Data availability We can provide support data if necessary, where applicable. Declarations Ethics approval and consent to participate Ethics approval was not required. Written informed consent was taken from the legal guardian prior to this submission and any accompanying images. A copy of the written consent is available for review by the Editor-in-Chief of this journal. Consent for publication Written informed consent was obtained from the patient’s next of kin for publication of this case report and any accompanying images. A copy of the written consent is available for review by the Editor-in-Chief of this journal. Competing interests The authors and I have no competing interests and no conflicts of interest. References 1. Beauchesne P Extra-neural metastases of malignant gliomas: myth or reality? Cancers 2011 3 1 461 477 10.3390/cancers3010461 24212625 PMC3756372 Beauchesne P. Extra-neural metastases of malignant gliomas: myth or reality? Cancers. 2011;3(1):461–77. 24212625 10.3390/cancers3010461 PMC3756372 2. Schwartz C Romagna A Huemer F Weiss L Gatterbauer B Woehrer A Extensive leptomeningeal and systemic metastasis in glioblastoma: a clinicopathologic study Clin Neuropathol 2022 41 5 242 248 Schwartz C, Romagna A, Huemer F, Weiss L, Gatterbauer B, Woehrer A, et al 3. Laurin J Barresi V Hölsken A Capper D Reifenberger G Genetic signatures associated with metastatic glioblastoma: a systematic review World Neurosurg 2025 174 23 31 Laurin J, Barresi V, Hölsken A, Capper D, Reifenberger G. Genetic signatures associated with metastatic glioblastoma: a systematic review. World Neurosurg. 2025;174:23–31. 4. Benson R Mallick S Purkait S Haresh KP Gupta S Sharma MC Glioblastoma with primitive neuroectodermal component treated with adjuvant radiotherapy and temozolomide: a pooled analysis of 23 patients Neurol India 2021 69 4 856 860 10.4103/0028-3886.323892 34507401 Benson R, Mallick S, Purkait S, Haresh KP, Gupta S, Sharma MC, et al 34507401 10.4103/0028-3886.323892 5. Liu J Shen L Tang G Tang S Kuang W Li H Multiple extracranial metastases from glioblastoma multiforme: a case report and literature review J Int Med Res 2020 48 6 300060520930459 10.1177/0300060520930459 32552287 PMC7303784 Liu J, Shen L, Tang G, Tang S, Kuang W, Li H, et al 32552287 10.1177/0300060520930459 PMC7303784 6. Louis DN Perry A Wesseling P Brat DJ Cree IA Figarella-Branger D The 2021 WHO classification of tumors of the central nervous system: a summary Neuro Oncol 2021 23 8 1231 1251 10.1093/neuonc/noab106 34185076 PMC8328013 Louis DN, Perry A, Wesseling P, Brat DJ, Cree IA, Figarella-Branger D, et al 34185076 10.1093/neuonc/noab106 PMC8328013 7. Reuss DE Kratz A Sahm F Capper D Schrimpf D Koelsche C CDKN2A/B deletion defines WHO grade 4 in IDH-mutant astrocytomas Acta Neuropathol 2021 141 2 291 303 Reuss DE, Kratz A, Sahm F, Capper D, Schrimpf D, Koelsche C, et al 8. Strong MJ Smith ER Gill CM D’Amico RS Cloney MB Manley PE Osseous metastasis in glioblastoma: a systematic review J Neurooncol 2022 158 1 41 52 Strong MJ, Smith ER, Gill CM, D’Amico RS, Cloney MB, Manley PE, et al 9. Bae YH Kim SM Jeon HJ Jung TY Challenges and advances in glioblastoma targeted therapy: the promise of drug repurposing and biomarker exploration Front Oncol 2024 13 1198376 10.3389/fonc.2024.1441460 PMC11493774 39439947 Bae YH, Kim SM, Jeon HJ, Jung TY. Challenges and advances in glioblastoma targeted therapy: the promise of drug repurposing and biomarker exploration. Front Oncol. 2024;13:1198376. 10.3389/fonc.2024.1441460 PMC11493774 39439947 10. Majd N Rivera-Zengotita M Ahmed S Elhammady M Extraneural metastases of glioblastoma confirmed via next-generation sequencing Oncologist 2024 29 3 212 216 Majd N, Rivera-Zengotita M, Ahmed S, Elhammady M. Extraneural metastases of glioblastoma confirmed via next-generation sequencing. Oncologist. 2024;29(3):212–6. 11. Sudarsan NM Kumar MA Lakshmi Narayanan V Velayutham P Manohar D Sunder Singh JK Skeletal metastases in an IDH1-mutant glioma: a rare presentation of WHO CNS grade 4 astrocytoma BMJ Case Rep 2023 16 7 e254267 Sudarsan NM, Kumar MA, Lakshmi Narayanan V, Velayutham P, Manohar D, Sunder Singh JK. Skeletal metastases in an IDH1-mutant glioma: a rare presentation of WHO CNS grade 4 astrocytoma. BMJ Case Rep. 2023;16(7): e254267. 12. Kurdi MA Ghalib MH Jamal S Extracranial metastasis of glioblastoma outside CNS: pathogenesis revisited Cancer Rep 2023 6 1 e1714 10.1002/cnr2.1905 PMC10728524 37814403 Kurdi MA, Ghalib MH, Jamal S. Extracranial metastasis of glioblastoma outside CNS: pathogenesis revisited. Cancer Rep. 2023;6(1): e1714. 10.1002/cnr2.1905 PMC10728524 37814403 13. Mellinghoff IK Ellingson BM Touat M Sadones J van den Bent MJ Penas-Prado M Vorasidenib in IDH1- or IDH2-mutant low-grade glioma N Engl J Med 2023 388 23 2216 2228 10.1056/NEJMoa2304194 PMC11445763 37272516 Mellinghoff IK, Ellingson BM, Touat M, Sadones J, van den Bent MJ, Penas-Prado M, et al 10.1056/NEJMoa2304194 PMC11445763 37272516 ",
  "metadata": {
    "Title of this paper": "Vorasidenib in IDH1- or IDH2-mutant low-grade glioma",
    "Journal it was published in:": "Journal of Medical Case Reports",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12486764/"
  }
}