{
  "title": "Paper_1028",
  "abstract": "pmc Front Immunol Front Immunol 1754 frontimmu Front. Immunol. Frontiers in Immunology 1664-3224 Frontiers Media SA PMC12479467 PMC12479467.1 12479467 12479467 41035647 10.3389/fimmu.2025.1644645 1 Immunology Original Research Exosomal FABP5 drives HCC progression via macrophage lipid metabolism and immune microenvironment remodeling Luo Siyi  1 Tang Rui  2 Jiang Ling  3 Luo Qichi  1 Fu Junhao  4 Wu Bo  5  * Wang Guowu  6  *  1 Department of Pathology, Suining Central Hospital Suining, Sichuan China  2 The First Affiliated Hospital of Chongqing Medical University Chongqing China  3 Centre for Lipid Research & Chongqing Key Laboratory of Metabolism on Lipid and Glucose, Key Laboratory of Molecular Biology for Infectious Diseases (Ministry of Education), Institute for Viral Hepatitis, Chongqing Medical University Chongqing China  4 Department of Central Laboratory, Affiliated Jinhua Hospital, Zhejiang University School of Medicine Jinhua, Zhejiang China  5 Department of Hepatobiliary and Pancreatic Surgery, Affiliated Jinhua Hospital, Zhejiang University School of Medicine Jinhua, Zhejiang China  6 Department of Gynecology, Suining Central Hospital Suining, Sichuan China Edited by: Dening Ma Reviewed by: Ayaka Ito  Danyang Li *Correspondence: Bo Wu, bobojinhua@163.com 1055244833@qq.com 16 9 2025 2025 16 480569 1644645 10 6 2025 22 8 2025 16 09 2025 01 10 2025 02 10 2025 Copyright © 2025 Luo, Tang, Jiang, Luo, Fu, Wu and Wang. 2025 Luo, Tang, Jiang, Luo, Fu, Wu and Wang https://creativecommons.org/licenses/by/4.0/ This is an open-access article distributed under the terms of the Creative Commons Attribution License (CC BY). The use, distribution or reproduction in other forums is permitted, provided the original author(s) and the copyright owner(s) are credited and that the original publication in this journal is cited, in accordance with accepted academic practice. No use, distribution or reproduction is permitted which does not comply with these terms. Introduction The progression of hepatocellular carcinoma (HCC) is intricately linked to complex interactions within the tumor microenvironment (TME), where the reprogramming of tumor-associated macrophages (TAMs) plays a pivotal role. However, how HCC cells regulate TAM metabolism and function via extracellular vesicles, such as exosomes, remains incompletely understood. Methods We isolated exosomes from HCC cell lines and co-cultured them with macrophages. Using proteomics, lipid analysis, flow cytometry, and animal models, we evaluated the effects of exosomal FABP5 on macrophage polarization and lipid metabolism. The role of FABP5 in tumor progression was assessed via in vivo Results This study reveals that HCC cells release fatty acid-binding protein 5 (FABP5) via exosomes, transferring it to TAMs, thereby inducing significant lipid metabolism reprogramming in macrophages. Mechanistically, exosomal FABP5 promotes lipid accumulation by activating the PPARγ signaling pathway, while potentially inhibiting the PPARα signaling pathway to reduce fatty acid oxidation, ultimately driving TAM polarization towards an M2 phenotype, characterized by increased secretion of immunosuppressive cytokines and a pro-tumor phenotype. Clinical data analysis indicates that high FABP5 expression in HCC tissues correlates with poor patient prognosis. In liver-specific FABP5 knockout mouse models and HCC xenograft models, FABP5 deletion significantly suppressed tumor growth, reduced M2-type TAM infiltration and lipid accumulation, and enhanced anti-tumor immune responses. Conclusion These findings collectively uncover exosomal FABP5 as a key mediator of metabolic and immune communication between HCC and TAMs, promoting HCC progression by remodeling the tumor immune microenvironment, and suggest FABP5 as a potential therapeutic target for HCC. hepatocellular carcinoma tumor-associated macrophages exosomes fatty acid-binding protein 5 lipid metabolism The author(s) declare that no financial support was received for the research and/or publication of this article. pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement yes pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes section-in-acceptance Cancer Immunity and Immunotherapy 1 Introduction Hepatocellular carcinoma (HCC) is the most common primary liver cancer globally, posing a significant threat to human health due to its high incidence and mortality rates ( 1 2 3 4 The tumor microenvironment (TME) plays a pivotal role in the development and progression of HCC ( 5 6 7 8 9 9 10 Intercellular communication is crucial for shaping TME characteristics and driving tumor progression. Exosomes, a type of extracellular vehicle, are important carriers of intercellular information ( 11 12 13 14 Metabolic reprogramming, particularly alterations in lipid metabolism, is a hallmark of cancer ( 15 de novo 16 Fatty acid binding protein 5 (FABP5) is a small intracellular lipid chaperone protein that plays an important role in fatty acid uptake, transport, and metabolic regulation ( 17 18 19 22 21 However, whether and how HCC cells utilize FABP5 via exosomes to specifically affect TAM lipid metabolic reprogramming, thereby shaping an immunosuppressive TME to promote HCC progression, remains an incompletely understood regulatory network. Elucidating this mechanism is crucial for a deeper understanding of HCC immune evasion and progression. This study aims to investigate the role of HCC-derived exosomal FABP5 in regulating TAM lipid metabolism and functional polarization, and its impact on HCC progression. By focusing on the specific communication axis through which HCC cells regulate TAM lipid metabolism and immune phenotype via exosomal FABP5, this research is expected to unveil a new dimension of the complex interaction network within the tumor microenvironment. This will deepen the understanding of the mechanisms by which exosomes mediate metabolic coupling and functional remodeling between tumor and immune cells. Clarifying the role of exosomal FABP5 in HCC progression may not only offer new biomarker approaches for HCC diagnosis and prognosis but could also open new avenues for developing targeted therapeutic strategies, improving immunotherapy efficacy, and ultimately benefiting patients. 2 Methods and materials 2.1 Cell culture Human hepatocellular carcinoma cell lines MHCC97 and Huh-7, as well as the normal human hepatocyte line THLE-2, were purchased from the American Type Culture Collection (ATCC, Manassas, VA, USA). Cells were cultured in Dulbecco’s Modified Eagle Medium (DMEM, Gibco, Cat. No. 11995065) supplemented with 10% fetal bovine serum (FBS, Gibco, Cat. No. 10082147) and 1% penicillin-streptomycin (Thermo Fisher Scientific, Cat. No. 15140122) at 37 °C in a humidified incubator with 5% CO 2 2.2 Isolation of exosomes Exosomes were isolated from cell culture supernatants using the ExoQuick™ Exosome Precipitation Solution (System Biosciences, Cat. No. EXOQ20A-1) following the manufacturer’s instructions. Briefly, cell culture supernatants were centrifuged at 3,000 × g for 15 minutes to remove cellular debris, followed by filtration through a 0.22-μm filter (Merck Millipore, Cat. No. SLHP002SL). Exosomes were precipitated by adding ExoQuick™ solution to the filtered supernatant and incubating at 4 °C overnight. The precipitated exosomes were collected by centrifugation at 1,500 × g for 30 minutes and resuspended in sterile phosphate-buffered saline (PBS, Thermo Fisher Scientific, Cat. No. 10010023). 2.3 Transmission electron microscopy Exosomes were fixed in 2% glutaraldehyde (Electron Microscopy Sciences, Cat. No. 16301) for 1 hour and then applied to copper grids coated with formvar. Samples were stained with 2% uranyl acetate (Electron Microscopy Sciences, Cat. No. 22400) and imaged using a JEOL JEM-1230 transmission electron microscope. 2.4 Nanoparticle tracking analysis The size distribution and concentration of exosomes were determined using a NanoSight NS300 (Malvern Panalytical, Cat. No. NANO-NS300) with a 405-nm laser. Videos were captured in triplicate, and data were analyzed using NTA software version 3.4. 2.5 Western blotting Exosome protein extracts were prepared using RIPA buffer (Thermo Fisher Scientific, Cat. No. 89900) supplemented with protease inhibitors (Roche, Cat. No. 04693132001). Protein concentration was determined using the BCA Protein Assay Kit (Thermo Fisher Scientific, Cat. No. 23225). Equal amounts of protein were separated by SDS-PAGE and transferred to PVDF membranes (Merck Millipore, Cat. No. IPVH00010). Membranes were blocked with 5% non-fat milk (Bio-Rad, Cat. No. 1706405) and incubated with primary antibodies against ALIX (Santa Cruz Biotechnology, Cat. No. sc-53727), CD63 (Santa Cruz Biotechnology, Cat. No. sc-52737), and Tsg101 (Santa Cruz Biotechnology, Cat. No. sc-365931) overnight at 4°C. After washing, membranes were incubated with secondary antibodies (Jackson ImmunoResearch, Cat. No. 111-035-003) for 1 hour at room temperature. Bands were visualized using the Pierce ECL Western Blotting Substrate (Thermo Fisher Scientific, Cat. No. 32106). 2.6 Macrophage culture and treatment Raw 264.7 macrophages were purchased from ATCC and cultured in RPMI-1640 medium (Gibco, Cat. No. 11875093) supplemented with 10% FBS and 1% penicillin-streptomycin. For treatment, macrophages were incubated with exosomes (10 μg/mL) isolated from HCC cell lines and control hepatocyte lines for 24 hours. 2.7 Exosome uptake assay Exosomes were labeled with PKH67 Green Fluorescent Cell Linker Kit [Sigma-Aldrich, MINI67] according to the manufacturer’s instructions. Briefly, isolated exosomes were incubated with PKH67 dye, and excess dye was removed by ultracentrifugation. Labeled exosomes were then co-incubated with recipient macrophages for 1 hour. Exosome uptake was visualized by fluorescence microscopy. 2.8 Flow cytometry For flow cytometry analysis, macrophages were harvested and resuspended in PBS. Cells were then surface stained with the following antibodies for 30 minutes at 4 °C:Anti-CD163 PE (BD Biosciences, Cat. No. 561524); Anti-CD206 FITC (BD Biosciences, Cat. No. 562003). After staining, cells were washed twice with PBS and analyzed using a BD FACSAria III flow cytometer (BD Biosciences). Data was analyzed using FlowJo software (Tree Star, Inc.). Gating strategies were established to exclude debris and dead cells, and compensation was performed using single-stained controls. 2.9 Lipid staining For intracellular lipid droplet visualization, cells were stained with Nile Red [Sigma-Aldrich, N3013, 1 µg/mL] or BODIPY 493/503 [Invitrogen, D3922, 1 µM]. After appropriate treatments, cells grown on coverslips were washed with PBS, fixed with 4% paraformaldehyde (PFA) for 15 minutes, and then incubated with Nile Red or BODIPY 493/503 solution for 30 minutes at room temperature in the dark. Nuclei were counterstained with DAPI [Invitrogen, D1306]. Images were captured using a fluorescent microscope. 2.10 Quantitative real-time PCR Total RNA was extracted from cells using the RNAiso Plus reagent (Takara, Cat. No. 9109). cDNA was synthesized using the PrimeScript RT Reagent Kit (Takara, Cat. No. RR047A). qPCR was performed using the TB Green Premix Ex Taq II (Takara, Cat. No. RR820A) on a QuantStudio 6 Flex Real-Time PCR System (Thermo Fisher Scientific). The following primers were used: PPARγ: Forward: 5’-GAGGAGCTGAGGAGGAGACA-3’, Reverse: 5’-GCTGCTGGTTGCTGTAGATA-3’ PPARα: Forward: 5’-GAGTGGAAAGCTGAGGAGAG-3’, Reverse: 5’-CTGCTGGTTGCTGATAGATA-3’ iNOS: Forward: 5’-GAGCTGGAAAGCTGAGGACA-3’, Reverse: 5’-GCTGCTGGTAAGGATGCTG-3’ Arg-1: Forward: 5’-GAGCTGGAAAGCTGAGGACA-3’, Reverse: 5’-GCTGCTGGTAAGGATGCTG-3’ Ym1: Forward: 5’-GAGCTGGAAAGCTGAGGACA-3’, Reverse: 5’-GCTGCTGGTAAGGATGCTG-3’ GAPDH: Forward: 5’-GAGTCAACGGATTTGGTCGT-3’, Reverse: 5’-TTGATTTTGGAGGGATCTCG-3’ 2.11 ELISA assays The concentrations of IL-10, IL-1β, TNF-α, and CCL17 in cell culture supernatants were measured using ELISA kits (R&D Systems) according to the manufacturer’s instructions: IL-10: Cat. No. D1000B; IL-1β: Cat. No. D1K00; TNF-α: Cat. No. DTA00D; CCL17: Cat. No. DC170. 2.12 Animal models For the in vivo 6 2.13 Statistical analysis Data are presented as the mean ± standard deviation (SD) from at least three independent experiments. Statistical analyses were performed using GraphPad Prism 8.0. Differences between groups were analyzed by Student’s t-test or one-way ANOVA. A P-value < 0.05 was considered statistically significant. 3 Results 3.1 Macrophages dominate the immune microenvironment of liver cancer and are modulated by HCC-derived exosomes Analysis of Cancer Genome Atlas (TCGA) data revealed that macrophages constitute the dominant infiltrating immune cell population within the immune phenotype of human hepatocellular carcinoma (HCC) tissues, highlighting their pivotal role in shaping the liver tumor microenvironment (TME) (  Figure 1A  Figures 1B–E  Figure 1F  Figure 1G Figure 1 Macrophage Dominance in HCC and Modulation by HCC-Derived Exosomes. (A) (B) (C) (D) (E) (F) (G) Panel A shows a box plot depicting cell composition across various cell types, with CD4+ T cells and neutrophils highlighted. Panel B presents electron microscope images of exosomes labeled as EXO^THLE-2, EXO^MHCC97, and EXO^Huh-7. Panel C displays a Western blot of proteins ALIX, CD63, and Tsg101 with molecular weights indicated. Panel D consists of histograms showing exosome size distributions for the three exosome types. Panel E is a bar chart comparing exosome concentrations, with significance values noted. Panel F includes bright-field and PKH67-labeled images of EXO^THLE-2 and EXO^MHCC97. Panel G is a bar graph showing relative RNA expression levels with significance values annotated. 3.2 FABP5 serves as a key cargo molecule related to lipid metabolism within exosomes Proteomic profiling of macrophages exposed to hepatocellular carcinoma (HCC) derived exosomes revealed significant enrichment of lipid metabolism pathways, which was independently supported by gene set enrichment analysis showing activation of lipid biosynthesis and transport  Figures 2A-C  Figure 2D  Figure 2E  Figure 2F  Figure 2G  Figure 2G Figure 2 The transfer of FABP5 from HCC cells to macrophages via exosomes is associated with the regulation of lipid metabolism. (A) (B) (C) (D) (E) (F) (G) (H) The image consists of multiple panels presenting data and analyses related to gene expression and lipid metabolism: A. Heatmap comparing gene expression profiles from two groups. B. Dot plot visualizing gene set enrichment analysis with various metabolic pathways. C. Three graphs showing enrichment scores for lipid biosynthetic process, cellular lipid metabolic process, and lipid transport. D. Box plot displaying the log2 fold change in FABP5 expression between two groups. E. Western blot and bar graph showing protein expression levels of FABP5 across different cell lines. F. Bar graph illustrating RNA expression levels of FABP5. G. Western blot comparing Tsg101 and FABP5 levels. H. Fluorescent microscopy images of MHCC97 cells showing the effects of oleic acid treatment with and without FABP5 knockout. Scale bar included. 3.3 Loss of FABP5 in HCC-derived exosomes attenuates macrophage lipid accumulation and M2 polarization To assess the function of FABP5 in macrophages, we treated macrophages with exosomes derived from FABP5 knockout (KO) or wild-type (WT) hepatocellular carcinoma cells. FABP5-KO exosomes significantly reduced lipid accumulation in macrophages, as evidenced by decreased lipid droplet BODIPY staining (  Figure 3A  Figure 3B  Figures 3C, D  Figures 3E, F  Figure 3G Figure 3 Loss of FABP5 in HCC-derived Exosomes Attenuates Macrophage Lipid Accumulation and M2 Polarization. (A) (B) (C) (D) (E) (F) (G) Panel A shows fluorescent microscopy images with BODIPY and DAPI staining merged, comparing EXO^WT and EXO^KO. Panel B presents scatter plots of gene expression levels (iNOS, CD163, CD206) correlated with FABP5. Panel C and D display flow cytometry histograms and bar graphs for iNOS and CD163+ cell counts, highlighting statistical significance. Panels E, F, and G show bar graphs comparing relative RNA expression levels (CD206, Arg-1, Ym1, PPARα, HIF-1) and cytokine concentrations (IL10, IL-1β, TNF-α, CCL17) between EXO^WT and EXO^FABP-KO, indicating significant differences. 3.4 FABP5 expression associates with poor prognosis and promotes tumor growth in liver cancer Analysis of clinical datasets (TCGA-LIHC) revealed significantly elevated FABP5 expression in HCC tissues compared to matched normal liver samples (  Figures 4A, B  Figure 4C in vivo  Figures 4D–F  Figures 4G–I Figure 4 FABP5 Expression Associates with Poor Prognosis and Promotes Tumor Growth in Liver Cancer. (A) (B) (C) (D) (E) (F) (G) (H) (I) Graph A shows FABP5 expression, with higher levels in tumors. Graph B compares expression between paired normal and tumor samples. Graph C displays overall survival curves, indicating poorer survival with high FABP5. Image D contrasts liver tumors between wild-type (WT) and FABP5 knockout (KO) mice. Graph E indicates fewer tumors in KO mice across sizes. Graph F shows reduced total tumor number in KO mice. Image G provides histological sections of WT and KO tumors. Image H shows FABP5 expression in WT and KO mice. Image I demonstrates CD163 and F4/80 staining, with immune cell distribution differences in WT and KO mice. 3.5 FABP5 deletion alleviates immunosuppression in the tumor microenvironment and correlates with reduced tumor growth In a murine tumor xenograft model, FABP5 knockout significantly impeded tumor growth, as reflected by reduced tumor volume and weight compared to WT controls (  Figures 5A–C  Figure 5D  Figure 5E  Figure 5F Figure 5 FABP5 deletion alleviates immunosuppression in the tumor microenvironment and correlates with reduced tumor growth. (A) (B) (C) (D) (E) (F) Image depicting experimental results comparing wild-type (WT) and FABP5 knockout (KO) tumors. Panel A shows excised tumors from both groups. Panel B presents a line graph of tumor volume over time, with WT showing larger growth. Panel C is a bar chart displaying significant differences in tumor weight. Panel D contains immunohistochemistry images for Ki67, CD206, and CD8, illustrating differing expression in WT and KO. Panel E displays BODIPY and DAPI staining, with a merged image, contrasting lipid accumulation and cell nuclei staining. Panel F presents scatter plots correlating FABP5 expression, purity, and immune infiltration levels. 3.6 FABP5 promotes macrophage lipid accumulation and immunosuppressive phenotype by regulating the PPARγ/PPARα pathway To elucidate the mechanistic role of FABP5 in macrophage lipid metabolism, we investigated the involvement of the PPARγ and PPARα signaling pathways. Treatment with exosomes derived from FABP5-knockout (FABP5-KO) HCC cells significantly downregulated the expression of key PPARγ target genes related to lipid uptake and storage, including SCD1, FASN, and SREBF1, suggesting that FABP5 promotes lipid accumulation via activation of the PPARγ pathway (  Figure 6A  Figure 6B  Figure 6C  Figure 6D  Figure 6E  Figure 6F Figure 6 FABP5 promotes macrophage lipid accumulation and immunosuppressive phenotype by regulating the PPARγ/PPARα pathway. (A) (B) (C) (D) (E) (F) (G) (H) (I) Bar graphs display various data comparisons between EXO^WT, EXO^FABP-KO, and other conditions. Panels A to I show relative RNA expression levels and concentrations of various proteins and molecules, such as PPARα, SCD1, and CPT1A, under different conditions. Significant differences are indicated with p-values. The study examines genetic and protein expression variations. To delineate the essential role of PPARγ in macrophage reprogramming induced by exosomal FABP5, we specifically silenced PPARγ expression in macrophages using siRNA prior to treatment with exosomes derived from MHCC97 cells (EXOMHCC97). Knockdown efficiency was confirmed by a reduction in PPARγ levels of 50–80% compared to control siRNA-treated cells (  Figure 6G  Supplementary Figure S1A  Figure 6H  Figure 6I  Supplementary Figure S1A 4 Discussion The complex pathogenesis of hepatocellular carcinoma (HCC) is closely related to the dynamic evolution of the tumor microenvironment (TME), in which the reprogramming of immune cells is particularly critical. This study focuses on how HCC cells utilize exosomes, an intercellular communication carrier, and fatty acid-binding protein 5 (FABP5) to precisely regulate the metabolic state and functional phenotype of tumor-associated macrophages (TAMs), thereby shaping a microenvironment conducive to tumor growth and immune evasion ( 23 24 25 26 In-depth mechanistic exploration shows that exosomal FABP5 regulates macrophage lipid metabolism via a dual-action mode. On one hand, FABP5 activates the peroxisome proliferator-activated receptor γ (PPARγ) signaling pathway, promoting the expression of key genes involved in fatty acid uptake, synthesis, and storage (such as SCD1, FASN, SREBF1), leading to lipid accumulation within macrophages ( 27 28 29 Our findings are consistent with the broad understanding of the role of tumor-associated macrophages (TAMs) in tumor progression, where M2-type TAMs promote tumor growth, angiogenesis, and immunosuppression through various mechanisms ( 30 31 32 33 34 Despite the robust evidence for tumor-derived FABP5-mediated macrophage reprogramming, it is essential to recognize that immune modulation in tumors is inherently multifactorial. The TME constitutes a dynamic and complex network of tumor-intrinsic signals and host-derived components—including cytokines, growth factors, stromal cues, and metabolic gradients—all of which can converge to influence the phenotype and function of tumor-associated macrophages (TAMs). Among these, interleukin-4 (IL-4) is a well-established immunoregulatory cytokine that promotes M2 macrophage polarization and has been reported to transcriptionally upregulate FABP5 expression in macrophages ( 35 + + Although this study has made significant progress, some aspects require further exploration. Firstly, the universality of the findings needs to be validated in a broader range of HCC cell lines, primary patient-derived cells, and exosomes. Secondly, the specific molecular mechanisms by which FABP5 regulates PPARγ/PPARα activity, and which specific downstream lipid molecules or metabolites directly mediate the functional changes in macrophages, still need in-depth analysis using techniques such as lipidomics. Furthermore, the long-term effects of targeting FABP5 or its mediated pathways on normal physiological functions, especially liver homeostasis and systemic immune status, are critical issues to be carefully evaluated before clinical translation. Lastly, the detailed mechanisms of exosomal FABP5 entry into macrophages, including its recognition receptors, endocytic pathways, and the subcellular localization and interacting protein network of FABP5 within macrophages, are also directions worthy of future investigation. This study systematically elucidates a novel mechanism by which HCC cells regulate TAM lipid metabolism and immunosuppressive phenotype via exosomal FABP5, not only deepening the understanding of HCC immune evasion and progression mechanisms but also providing an important theoretical basis and potential targets for developing new HCC therapeutic strategies. FABP5 itself and its levels in exosomes hold promise as candidate biomarkers for HCC diagnosis, prognosis assessment, and prediction of treatment response. More importantly, given that the immunosuppressive phenotype of TAMs is a key bottleneck affecting the efficacy of current immunotherapies (such as immune checkpoint inhibitors), targeting FABP5 or its mediated lipid metabolism pathways may reverse the pro-tumor function of TAMs, transforming “cold” tumors into “hot” tumors, thereby enhancing the sensitivity and efficacy of immunotherapy. Therefore, developing specific FABP5 inhibitors, or interfering with the release, transport of exosomal FABP5, or its interaction with TAMs, combined with existing immunotherapies, may offer a synergistic and more effective therapeutic approach for HCC patients, ultimately improving their clinical outcomes. 5 Conclusion This study elucidates a critical role for HCC-derived exosomal FABP5 in reprogramming macrophage lipid metabolism to drive immunosuppressive polarization and tumor progression. Through integrated proteomic, functional, and clinical analyses, we demonstrate that FABP5-enriched exosomes are internalized by macrophages, triggering lipid droplet accumulation via PPARγ-mediated activation of lipid storage pathways and suppression of PPARα-driven fatty acid oxidation. This metabolic shift promotes an M2-like phenotype characterized by elevated immunosuppressive cytokine secretion (e.g., IL-10, TGF-β) and reduced anti-tumor immunity, as evidenced by decreased cytotoxic CD8+ T-cell infiltration. Clinically, high FABP5 expression correlates with poor prognosis in HCC patients and increased intratumoral M2 macrophage abundance. Genetic ablation of FABP5 disrupts these processes, attenuating tumor growth and immunosuppression in preclinical models. These findings position FABP5 as a central mediator of metabolic-immune crosstalk in HCC, offering a promising therapeutic target to counteract tumor-associated immunosuppression by modulating lipid metabolism in macrophages. Data availability statement The original contributions presented in the study are publicly available. This data can be found here: http://www.ebi.ac.uk/pride Ethics statement The animal study was approved by Animal Care and Use Committee of Affiliated Jinhua Hospital, Zhejiang University. The study was conducted in accordance with the local legislation and institutional requirements. Author contributions SL: Software, Methodology, Supervision, Investigation, Writing – original draft, Data curation, Conceptualization, Project administration, Validation. RT: Writing – original draft, Investigation, Software, Methodology, Conceptualization. LJ: Investigation, Resources, Writing – original draft, Formal Analysis, Visualization, Validation. QL: Validation, Data curation, Writing – original draft, Software. JF: Data curation, Formal Analysis, Project administration, Writing – original draft, Investigation. BW: Conceptualization, Methodology, Writing – original draft, Formal Analysis, Visualization. GW: Writing – review & editing, Supervision, Conceptualization, Visualization, Resources, Validation. Conflict of interest The authors declare that the research was conducted in the absence of any commercial or financial relationships that could be construed as a potential conflict of interest. Generative AI statement The author(s) declare that no Generative AI was used in the creation of this manuscript. Any alternative text (alt text) provided alongside figures in this article has been generated by Frontiers with the support of artificial intelligence and reasonable efforts have been made to ensure accuracy, including review by the authors wherever possible. If you identify any issues, please contact us. Publisher’s note All claims expressed in this article are solely those of the authors and do not necessarily represent those of their affiliated organizations, or those of the publisher, the editors and the reviewers. Any product that may be evaluated in this article, or claim that may be made by its manufacturer, is not guaranteed or endorsed by the publisher. Supplementary material The Supplementary Material for this article can be found online at: https://www.frontiersin.org/articles/10.3389/fimmu.2025.1644645/full#supplementary-material References 1 Sung H Ferlay J Siegel RL Laversanne M Soerjomataram I Jemal A Global cancer statistics 2020: GLOBOCAN estimates of incidence and mortality worldwide for 36 cancers in 185 countries CA Cancer J Clin 2021 71 209–49 10.3322/caac.21660 33538338 2 Llovet JM Kelley RK Villanueva A Singal AG Pikarsky E Roayaie S Hepatocellular carcinoma Nat Rev Dis Primers 2021 7 6 10.1038/s41572-020-00240-3 33479224 3 Vogel A Meyer T Sapisochin G Salem R Saborowski A Hepatocellular carcinoma Lancet 2022 400 1345–62 10.1016/S0140-6736(22)01200-4 36084663 4 Villanueva A Hepatocellular carcinoma N Engl J Med 2019 380 1450–62 10.1056/NEJMra1713263 30970190 5 Hinshaw DC Shevde LA The tumor microenvironment innately modulates cancer progression Cancer Res 2019 79 4557–66 10.1158/0008-5472.CAN-18-3962 31350295 PMC6744958 6 Anderson NM Simon MC The tumor microenvironment Curr Biol 2020 30 R921 r925 10.1016/j.cub.2020.06.081 32810447 PMC8194051 7 Cassetta L Pollard JW Tumor-associated macrophages Curr Biol 2020 30 R246–8 10.1016/j.cub.2020.01.031 32208142 8 Cheng K Tumor-associated macrophages in liver cancer: From mechanisms to therapy Cancer Commun (Lond) 2022 42 1112–40 10.1002/cac2.12345 36069342 PMC9648394 9 Liu YC Zou XB Chai YF Yao YM Macrophage polarization in inflammatory diseases Int J Biol Sci 2014 10 520 10.7150/ijbs.8879 24910531 PMC4046879 10 Pathria P Louis TL Varner JA Targeting tumor-associated macrophages in cancer Trends Immunol 2019 40 310–27 10.1016/j.it.2019.02.003 30890304 11 Kalluri R LeBleu VS The biology, function, and biomedical applications of exosomes Science 2020 367 eaau6977 10.1126/science.aau6977 32029601 PMC7717626 12 Zhang L Yu D Exosomes in cancer development, metastasis, and immunity Biochim Biophys Acta Rev Cancer 2019 1871 455–68 10.1016/j.bbcan.2019.04.004 31047959 PMC6542596 13 Zelli V Compagnoni C Capelli R Corrente A Di Vito Nolfi M Zazzeroni F Role of exosomal microRNAs in cancer therapy and drug resistance mechanisms: focus on hepatocellular carcinoma Front Oncol 2022 12 940056 10.3389/fonc.2022.940056 35912267 PMC9334682 14 Wu Q Zhou L Lv D Zhu X Tang H Exosome-mediated communication in the tumor microenvironment contributes to hepatocellular carcinoma development and progression J Hematol Oncol 2019 12 1 53 10.1186/s13045-019-0739-0 31142326 PMC6542024 15 Hanahan D Hallmarks of cancer: new dimensions Cancer Discov 2022 12 31 46 10.1158/2159-8290.CD-21-1059 35022204 16 Van den Bossche J O’Neill LA Menon D Macrophage immunometabolism: where are we (Going) Trends Immunol 2017 38 395 406 10.1016/j.it.2017.03.001 28396078 17 Furuhashi M Hotamisligil GS Fatty acid-binding proteins: role in metabolic diseases and potential as drug targets Nat Rev Drug Discov 2008 7 489 503 10.1038/nrd2589 18511927 PMC2821027 18 Yang X Deng B Zhao W Guo Y Wan Y Wu Z FABP5+ lipid-loaded macrophages process tumour-derived unsaturated fatty acid signal to suppress T-cell antitumour immunity J Hepatol 2025 82 676–89 10.1016/j.jhep.2024.09.029 39357545 19 Vecchio E Gallo R Mimmi S Gentile D Giordano C Straface E FABP5 is a key player in metabolic modulation and NF-κB dependent inflammation driving pleural mesothelioma Commun Biol 2025 8 324 10.1038/s42003-025-07754-0 40016284 PMC11868402 20 Qian J Zhao Z Ma L Liu W Song Y USP14 targets FABP5-mediated ferroptosis to promote proliferation and cisplatin resistance of HNSCC Clin Transl Oncol 2025 27 3485–500 10.1007/s12094-025-03857-6 39928282 PMC12259754 21 Zhang C Liao Y Liu P Du Q Liang Y Ooi S FABP5 promotes lymph node metastasis in cervical cancer by reprogramming fatty acid metabolism Theranostics 2020 10 6561–80 10.7150/thno.44868 32550890 PMC7295046 22 Ye M Hu C Chen T Yu P Chen J Lu F FABP5 suppresses colorectal cancer progression via mTOR-mediated autophagy by decreasing FASN expression Int J Biol Sci 2023 19 3115–27 10.7150/ijbs.85285 37416772 PMC10321282 23 Figueroa J Phillips LM Shahar T Hossain A Gumin J Kim H Exosomes from glioma-associated mesenchymal stem cells increase the tumorigenicity of glioma stem-like cells via transfer of miR-1587 Cancer Res 2017 77 5808–19 10.1158/0008-5472.CAN-16-2524 28855213 PMC5668150 24 Zhang C Wang XY Zhang P He TC Han JH Zhang R Cancer-derived exosomal HSPC111 promotes colorectal cancer liver metastasis by reprogramming lipid metabolism in cancer-associated fibroblasts Cell Death Dis 2022 13 57 10.1038/s41419-022-04506-4 35027547 PMC8758774 25 Yang P Qin H Li Y Xiao A Zheng E Zeng H CD36-mediated metabolic crosstalk between tumor cells and macrophages affects liver metastasis Nat Commun 2022 13 5782 10.1038/s41467-022-33349-y 36184646 PMC9527239 26 Xu Z Chen Y Ma L Chen Y Liu J Guo Y Role of exosomal non-coding RNAs from tumor cells and tumor-associated macrophages in the tumor microenvironment Mol Ther 2022 30 3133–54 10.1016/j.ymthe.2022.01.046 35405312 PMC9552915 27 O’Sullivan SE Kaczocha M FABP5 as a novel molecular target in prostate cancer Drug Discov Today 2020 S1359-6446 20 30375–5 10.1016/j.drudis.2020.09.018 32966866 PMC8059105 28 Liu S Zhang H Li Y Zhang Y Bian Y Zeng Y S100A4 enhances protumor macrophage polarization by control of PPAR-γ-dependent induction of fatty acid oxidation J Immunother Cancer 2021 9 6 e002548 10.1136/jitc-2021-002548 34145030 PMC8215236 29 Cao D Khan Z Li X Saito S Bernstein EA Victor AR Macrophage angiotensin-converting enzyme reduces atherosclerosis by increasing peroxisome proliferator-activated receptor α and fundamentally changing lipid metabolism Cardiovasc Res 2023 119 1825–41 10.1093/cvr/cvad082 37225143 PMC10681664 30 Zhang R Shen Y Zhang Q Feng X Liu X Huo X TRIM21-mediated Sohlh2 ubiquitination suppresses M2 macrophage polarization and progression of triple-negative breast cancer Cell Death Dis 2023 14 850 10.1038/s41419-023-06383-x 38123542 PMC10733312 31 Lu Y Zheng J Lin P Lin Y Zheng Y Mai Z Tumor microenvironment-derived exosomes: A double-edged sword for advanced T cell-based immunotherapy ACS Nano 2024 18 27230–60 10.1021/acsnano.4c09190 39319751 32 Tian X Shen H Li Z Wang T Wang S Tumor-derived exosomes, myeloid-derived suppressor cells, and tumor microenvironment J Hematol Oncol 2019 12 84 10.1186/s13045-019-0772-z 31438991 PMC6704713 33 Liu X Hartman CL Li L Albert CJ Si F Gao A Reprogramming lipid metabolism prevents effector T cell senescence and enhances tumor immunotherapy Sci Transl Med 2021 13 587 eaaz6314 10.1126/scitranslmed.aaz6314 33790024 PMC12040281 34 Li M Yang Y Xiong L Jiang P Wang J Li C Metabolism, metabolites, and macrophages in cancer J Hematol Oncol 2023 16 80 10.1186/s13045-023-01478-6 37491279 PMC10367370 35 Hou Y Wei D Zhang Z Guo H Li S Zhang J FABP5 controls macrophage alternative activation and allergic asthma by selectively programming long-chain unsaturated fatty acid metabolism Cell Rep 2022 41 111668 10.1016/j.celrep.2022.111668 36384126 Glossary AAV8 Adeno-Associated Virus serotype 8 ACOX1 Acyl-CoA Oxidase 1 Arg1 Arginase 1 BODIPY Boron-Dipyrromethene CCL17 C-C Motif Chemokine Ligand 17 CCL2 C-C Motif Chemokine Ligand 2 CPT1A Carnitine Palmitoyltransferase 1A ELISA Enzyme-Linked Immunosorbent Assay FABP5 Fatty Acid Binding Protein 5 FASN Fatty Acid Synthase GSEA Gene Set Enrichment Analysis HCC Hepatocellular Carcinoma HIF-1α Hypoxia-Inducible Factor 1-alpha iNOS Inducible Nitric Oxide Synthase IL-10 Interleukin-10 IL-1β Interleukin-1 Beta MDSCs Myeloid-Derived Suppressor Cells NTA Nanoparticle Tracking Analysis PD-L1 Programmed Death-Ligand 1 SCD1 Stearoyl-CoA Desaturase 1 SREBF1 Sterol Regulatory Element-Binding Transcription Factor 1 TCGA-LIHC The Cancer Genome Atlas–Liver Hepatocellular Carcinoma ",
  "metadata": {
    "Title of this paper": "FABP5 controls macrophage alternative activation and allergic asthma by selectively programming long-chain unsaturated fatty acid metabolism",
    "Journal it was published in:": "Frontiers in Immunology",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12479467/"
  }
}