{
  "title": "Paper_940",
  "abstract": "pmc Discov Oncol Discov Oncol 4139 discon Discover Oncology 2730-6011 Springer PMC12484495 PMC12484495.1 12484495 12484495 41026305 10.1007/s12672-025-03597-7 3597 1 Analysis Lactylation-related gene signatures for prognosis and treatment response prediction in radiation-resistant non-small cell lung cancer Yang Xiangdi 1 2 3 Li Guanjun 2 4 Jiang Rong 2 Yang Yongqin 2 4 Zhu Huan 1 Huang Linxuan 2 Li Tingting 2 4 Zhou Jianping zhoujianping0165@smu.edu.cn 5 6 Liu Zhigang Zhigangliu1983@hotmail.com 1 2 4 1 https://ror.org/02xe5ns62 grid.258164.c 0000 0004 1790 3548 The First Clinical Medical College of Jinan University, 2 https://ror.org/022s5gm85 grid.440180.9 0000 0004 7480 2233 Cancer Center, Dongguan Key Laboratory of Precision Diagnosis and Treatment for Tumors, The Tenth Affiliated Hospital of Southern Medical University, Dongguan People’s Hospital), 3 https://ror.org/04y2bwa40 grid.459429.7 Department of Oncology, The First People’s Hospital of Chenzhou, 4 https://ror.org/01vjw4z39 grid.284723.8 0000 0000 8877 7471 Shenzhen School of Clinical Medicine, Southern Medical University, 5 https://ror.org/022s5gm85 grid.440180.9 0000 0004 7480 2233 Department of Thoracic Surgery, The Tenth Affiliated Hospital of Southern Medical University (Dongguan People’s Hospital), 6 30 9 2025 12 2025 16 478248 1787 29 5 2025 4 9 2025 30 09 2025 02 10 2025 02 10 2025 © The Author(s) 2025 2025 https://creativecommons.org/licenses/by-nc-nd/4.0/ Open Access http://creativecommons.org/licenses/by-nc-nd/4.0/ Background Lactylation, as a novel type of post-translational protein modification, is closely associated with key processes such as cellular metabolism, the tumor immune microenvironment, tumor proliferation, and metastasis. However, the specific relationship between lactylation and radiation resistance in non-small cell lung cancer (NSCLC) has not yet been fully explored. This study aims to investigate the potential relationship between lactylation and radiation resistance in lung cancer using tumor databases, providing new molecular targets for individualized radiotherapy strategies for NSCLC. Methods Using the Cancer Genome Atlas (TCGA) database and the GSE197236 Results A total of 1865 differentially expressed genes (DEGs) were identified, showing differences between radiation resistant non-small cell lung cancer (NSCLC) and normal tissues. Among these genes, 23 lactate-related differentially expressed genes (LR-DEGs) were ultimately identified through an intersection analysis of the DEGs and LARRGs. Using univariate and multivariate Cox regression analysis for further screening, three key lactate-related biomarkers were identified: RRM2B, COL4A1, and CD46. It was found that patients with high-LARRGs exhibited stronger characteristics of immune exclusion, immune exhaustion, and immunosuppression in the tumor microenvironment (TME). Additionally, in the scRNA-seq, different cell types are distinctly distributed in the reduced-dimensional space, reflecting the significant heterogeneity of the TME. Furthermore, the gene sets of fibroblasts and endothelial cells show the highest scores, suggesting that under high lactate conditions, enhanced gene expression activity in fibroblasts and endothelial cells may promote tumor radioresistance. Analysis of significantly correlated signaling pathways in the high-LARRGs indicates that metabolic reprogramming and immunosuppression may promote radioresistance through lactate-mediated inhibition of T cell function and macrophage polarization, which highlights the role of the TME in radiotherapy and suggests that targeting immune evasion mechanisms may be a key strategy to overcome radioresistance. Conclusions LARRGs are crucial in the context of radiation resistant NSCLC, as they significantly influence tumor growth, the immune microenvironment, and drug response. This signature of LARRGs has the potential to serve as a prognostic biomarker and may also represent a promising therapeutic target for patients facing radiation resistant NSCLC. Graphical abstract  Supplementary Information The online version contains supplementary material available at 10.1007/s12672-025-03597-7. Keywords Lactylation Prognostic signature Tumor microenvironment Radiation resistance Non-small cell lung cancer pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement yes pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes issue-copyright-statement © Springer Science+Business Media LLC, part of Springer Nature 2025 Introduction Non-small cell lung cancer (NSCLC) is one of the most common malignant tumors globally, accounting for approximately 85% of all lung cancer cases, and it has a high mortality rate [ 1 3 4 5 7 Lactylation, a novel post-translational modification (PTM), has attracted considerable attention in recent years. Lactylation refers to the covalent attachment of a lactyl group to the lysine residues of proteins, thereby regulating gene transcription and cellular functions [ 8 9 10 13 In NSCLC, lactate is not only an important metabolic product but may also influence gene expression through lactylation modifications, thereby regulating the biological behavior of tumors [ 14 15 17 18 Although previous research has established the link between lactylation and various biological processes in tumors [ 19 20 Materials and methods Data acquisition and preprocessing To obtain the data required for this study, we accessed the public functional genomics database Gene Expression Omnibus (GEO, https://www.ncbi.nlm.nih.gov/geo/ GSE197236 GSE182109 http://www.gsea-msigdb.org/gsea/msigdb S1 Screening of lactylation-related prognostic genes in radiation resistant NSCLC The DESeq2 package (version 1.44.0) was used to identify DEGs between the radiation resistant NSCLC cell line ( GSE197236 P GSE197236 Construction of a lactylation-radiation resistance risk scoring model Based on the expression levels of the 23 co-expressed genes identified through the aforementioned screening, we conducted univariate and multivariate Cox regression analyses (R package survival v3.8-3) with the aim of constructing a lactylation-radiation resistance risk scoring model. The calculation formula for the risk scoring model is as follows:  \\documentclass[12pt]{minimal}\n\t\t\t\t\\usepackage{amsmath}\n\t\t\t\t\\usepackage{wasysym} \n\t\t\t\t\\usepackage{amsfonts} \n\t\t\t\t\\usepackage{amssymb} \n\t\t\t\t\\usepackage{amsbsy}\n\t\t\t\t\\usepackage{mathrsfs}\n\t\t\t\t\\usepackage{upgreek}\n\t\t\t\t\\setlength{\\oddsidemargin}{-69pt}\n\t\t\t\t\\begin{document}$${\\text{Risk score}}=\\sum\\limits_{{n=1}}^{{\\text{n}}} {(coe{f_i} \\times {x_i})} $$\\end{document} Based on the calculated risk scores, we divided the patients in the TCGA cohort into high- and low-risk groups and conducted survival analysis. We used the Kaplan-Meier method to calculate the survival curves of lung cancer patients with radiation resistance and plotted these curves using the “survminer” package (version 3.6.0). To further evaluate the predictive performance of the risk scoring model, we conducted a Receiver Operating Characteristic (ROC) curve analysis (R package timeROC v0.4). By calculating the Area Under the Curve (AUC) values for 1-year, 3-year, and 5-year survival, we assessed the predictive accuracy of the risk scoring model. Validation from public databases To validate the reliability of the high-lactate metabolism-radiation resistance risk scoring model, Cohorts from multiple cancer types in the TCGA database were selected for analysis, including TCGA-BRCA (breast cancer), CESC (cervical cancer), ESCA (esophageal cancer), HNSC (head and neck squamous cell carcinoma), and COAD/READ (colon/rectal cancer). During the validation process, we extracted radiotherapy patients and selected different gene combinations to calculate risk scores. Subsequently, Kaplan-Meier survival analysis (log-rank test) was used to evaluate the prognostic differences between the two groups in independent cohorts, while time-dependent ROC curves were employed to assess the predictive performance of the risk scores. Tumor-infiltrating immune cell profiling analysis Based on the high lactate metabolism-radiation resistance risk model, TCGA-LUAD patients were divided into high-LARRGs and low-LARRGs, and the IOBR package was used to quantify the immune characteristics of the TME. The CIBERSORT algorithm (R package IOBR v0.99.0) was applied to quantify the proportions of immune cell types, while the ESTIMATE algorithm was used to calculate tumor purity, stromal scores, and immune scores. Differences in immune cell infiltration between the high-LARRGs and low-LARRGs were assessed using the Wilcoxon rank-sum test. Immune checkpoint blockade responses were predicted through the TIDE online platform( http://tide.dfci.harvard.edu Downstream analysis of single-cell RNA-seq datasets The single-cell dataset GSE207422 Following QC, data was normalized using the NormalizeData function. Cell cycle scores (“S.Score” and “G2M.Score”) were calculated for each cell using the CellCycleScoring function. We then identified 2,000 highly variable features using the FindVariableFeatures function and scaled the data with ScaleData, while regressing out variations associated with cell cycle scores (S.Score and G2M.Score) and mitochondrial percentage. Principal Component Analysis (PCA) was performed, and the optimal number of PCs was determined using an Elbow plot. We selected the first 50 PCs, which captured the majority of the biological variance, for downstream analysis. The Harmony algorithm was then applied to these 50 PCs to correct for batch effects among samples. Finally, cells were clustered using a resolution of 0.6 and visualized with Uniform Manifold Approximation and Projection (UMAP) based on the Harmony-corrected dimensions. To further investigate the expression patterns of our signature across different NSCLC histological subtypes, we also analyzed an independent single-cell RNA-seq dataset, GSE205355 Drug sensitivity assessment Drug sensitivity analysis was conducted using the oncoPredict package (v1.2) to estimate the half-maximal inhibitory concentration (IC50) of various chemotherapy agents, such as paclitaxel, cisplatin, 5-fluorouracil and lapatinib, as well as targeted therapies like erlotinib, dasatinb, niraparrib, and trametinib. The prediction model was developed based on gene expression data and drug response information sourced from the GDSC2 database (Genomics of Drug Sensitivity in Cancer). The calcPhenotype function within the oncoPredict package was employed to assess drug sensitivity in the study cohort. Following the predictions, we compared the differences in drug sensitivity between the high-lactylation and low-lactylation groups. Association with key driver gene mutations Somatic mutation data for the TCGA-LUAD cohort were acquired using the R package TCGAbiolinks. Patients were categorized into ‘Mutant’ or ‘Wild-type’ groups based on the presence of key activating mutations in KRAS (e.g., codons 12, 13, and 61) and EGFR (e.g., L858R and exon 19 deletions). Finally, the Wilcoxon rank-sum test was used to assess the difference in LARRG scores between these groups. Statistical analysis All statistical analyses were conducted using R software (version 4.3.0). Continuous variables were compared using the Wilcoxon rank-sum test, while Pearson correlation coefficients were calculated for correlation analyses. Survival analysis was performed utilizing the Kaplan-Meier method, with differences between groups assessed through the log-rank test. All tests were two-sided, and a p Results Intersection of NSCLC radiation resistance and lactylation gene sets To investigate the genes that play a key role in radiation resistance, we selected the GSE197236 GSM5911394 GSM5911399 GPL26963 21 p S2 GSE197236 1 S1 1 1 1 1 S3 Lactate-based radiation resistance risk scoring model framework Using a univariate Cox proportional hazards regression model, the correlation between these 23 differential genes and the risk of high lactylation-related radiation resistance was calculated, then we performed the 23 genes in the TCGA-LUAD radiotherapy patient cohort (Table S4 p 2 2 S5 2 p- p- p- 2 2 Verification results from the public database To validate the reliability of the high LARRGs risk score model, we analyzed different combinations of the three genes in the TCGA cohorts of BRCA, CESC, ESCA, HNSC, COAD and READ (Fig. 3 The impact of hyperlactation-radiation resistance on the TME To investigate the relationship between high LARRGs and the TME, we categorized all TCGA-LUAD patients into high- and low-risk groups based on the median of the high LARRGs risk model. We employed the IOBR package to quantify TME characteristics. The results revealed that in the high-risk group, the activity of M2 macrophages, myeloid-derived suppressor cells (MDSCs), regulatory T cells (Tregs), and cancer-associated fibroblasts (CAFs) was significantly elevated. In contrast, dendritic cell function was reduced, and CD8 + T cell activity was suppressed. These alterations contributed to the establishment of an immune-suppressive TME, suggesting that immune modulation targeting the high lactylation state may be a crucial strategy for enhancing treatment responses (Fig. 4 S1 4 S2 p 4 S3 4 S4 To investigate the tumor tolerance mechanisms in patients with high lactylation levels and radiation resistance, we analyzed the activity of tumor biomarker-related pathways (as shown in the Fig. 4 S5 4 S6 To further investigate how hyperlactatemia-radioresistant patients regulate the immunosuppressive TME in LUAD, we obtained fresh tumor samples from 3 pre-treatment patients and 12 NSCLC patients who underwent anti-PD-1 combined with chemotherapy from GSE207422 22 4 4 23 24 GSE205355 In summary, high lactylation levels may promote radiation resistance through several mechanisms: enhancing tolerance to radiation damage via genomic repair and cell proliferation, and evading radiation’s destructive effects through metabolic reprogramming and microenvironmental adaptation. The activation of cell death-related pathways may further support tumor survival under radiation stress. These findings underscore the critical role of high lactylation levels in tumor radiation resistance and suggest that targeting DNA repair, metabolic pathways, and microenvironmental regulatory mechanisms could be effective strategies for overcoming radiation resistance. Furthermore, this study provides new insights into potential strategies for the mechanism of lactate-mediated radiation resistance related to fibroblasts and endothelial cells. Sensitivity to immunotherapy were distinct between the high- and low‑risk groups Considering the significant differences in immune-related pathways between the high-risk and low-risk groups, we wanted to determine whether the immune therapy responses differed between the two groups. The expression profiles of immune checkpoint genes showed that the expression levels were significantly lower in the low-risk group, including PDCD1 (PD-1), CTLA4, LAG3, and TIGIT, while CD274, VSIR, HAVCR2, and KLRC1 shown no significance (Fig. 5 Association with key driver gene mutations To explore the relationship between the LARRG signature and key oncogenic drivers in LUAD, we analyzed the distribution of LARRG scores across different mutation statuses in the TCGA cohort. Interestingly, we found that the LARRG score was significantly higher in tumors with KRAS mutations compared to KRAS wild-type tumors ( p Prediction of anticancer treatment response in low-risk and high-risk lactate groups of patients with radiation-resistant lung cancer We evaluated the responses of the high lactylation score group and the low lactylation score group to traditional and novel anticancer drugs. The high lactylation score group exhibited greater sensitivity to paclitaxel, cisplatin, fluorouracil, and lapatinib. In contrast, the low lactylation score group showed stronger responsiveness to targeted therapy, such as erlotinib, dasatinb, niraparrib, and trametinib (Fig. 6 Discussion In recent years, an increasing body of evidence has highlighted the diverse roles of lactate in tumor biology. Lactate is not only an important nutrient source for tumor cells but also promotes tumor growth, proliferation, metastasis, drug resistance, and immune suppression. For example, lactate can create an acidic immune microenvironment and enhance the expression of proteins that confer resistance to tumors [ 25 26 8 In our study, we first utilized gene expression data from the GEO database and the GSE197236 Ultimately, we developed a DEG signature associated with lactylation and calculated a prognostic score using three prognostic genes (RRM2B, COL4A1, and CD46). This prognostic gene signatures effectively stratified lung cancer patients with radiation resistance into high-risk and low-risk groups and accurately predicted treatment responsiveness. To the best of our knowledge, this is the first study to propose a molecular subtyping method for lung cancer radiation resistance based on LARRGs. This molecular subtype can guide personalized treatment for lung cancer patients with radiation resistance. RRM2B is a subunit of ribonucleotide reductase that plays a critical role in regulating replication stress, DNA damage, and genomic stability [ 27 28 29 30 31 32 Collagen IV is the most abundant component of the ECM basement membrane [ 33 34 35 36 37 37 38 39 40 41 42 43 Another protein of interest, CD46, is a transmembrane protein that plays a critical role in various biological processes, including immune activation and the regulation of adaptive immunity [ 44 45 46 47 The strong predictive performance of our model in the BRCA cohort is an interesting observation and may be associated with the unique biological context of Homologous Recombination Deficiency (HRD) in breast cancer. Our risk model includes the key gene RRM2B, a subunit of ribonucleotide reductase, which plays a key role in supplying dNTPs for DNA synthesis and repair [ 48 30 The destruction of immune function and abnormal immune factors can impair immune surveillance, thereby promoting the occurrence and metastasis of malignant tumors [ 49 To the best of our knowledge, this is the first study to investigate radiation resistance-related genes in lung cancer as prognostic biomarkers for the disease. However, our study has certain limitations. First, further validation of the results through the analysis of clinical samples and experimental data is needed, which will provide more substantial support for the potential mechanism of lactate-mediated radiation resistance related to fibroblasts and endothelial cells. Second, the biological functions and mechanisms of the three-risk score-related genes involved in lung cancer radiation resistance require further exploration. Despite these limitations, our findings reveal potential prognostic biomarkers and therapeutic targets for lung cancer radiation resistance, pointing the way for future research.  Fig. 1 Intersection of radiation resistance and lactylation gene sets in NSCLC. A GSE197236 p B C D E  Fig. 2 Construction of a lactylation-radiation resistance risk scoring model. A B C D  Fig. 3 Verification results from the public database. A E  Fig. 4 Lactylation-associated immune processes. A B E F G H  Fig. 5 Distinct sensitivity to immunotherapy between the high-risk and low-risk groups. A H  Fig. 6 Drug sensitivity analysis of low-risk and high-risk groups based on lactate levels in patients with radiation-resistant lung cancer Conclusion In summary, our study identified three LARRGs associated with the prognosis of lung cancer patients exhibiting radiation resistance. Using these genes, we successfully classified patients into two distinct groups. Furthermore, our analysis revealed potential drug targets for high-risk patients and provided insights into the tumor immune microenvironment. Our findings suggest that incorporating LARRGs scoring into clinical practice could be a valuable tool for predicting the prognosis of lung cancer radiation resistance. However, further research is necessary to validate our results and contribute to a deeper understanding of the underlying mechanisms of lactate-mediated radiation resistance related to fibroblasts and endothelial cells. Supplementary Information Below is the link to the electronic supplementary material.  Supplementary Material 1.  Supplementary Material 2.  Supplementary Material 3.  Supplementary Material 4.  Supplementary Material 5.  Supplementary Material 6. Publisher’s note Springer Nature remains neutral with regard to jurisdictional claims in published maps and institutional affiliations. Xiangdi Yang, Guanjun Li and Rong Jiang contributed equally to this work. Author contributions Zhigang Liu and Jianping Zhou led the conceptualization and supervision of the study. Xiangdi Yang and Guanjun Li performed data analysis and prepared the visualizations. Rong Jiang, Yongqin Yang and Huan Zhu contributed to the investigation and visualization. Linxuan Huang and Tingting Li conducted the graphical visualization. Xiangdi Yang, Guanjun Li and Rong Jiang provided technical support, revised the manuscript, and participated in its evaluation. All authors reviewed and approved the final version of the manuscript. Funding No funding was received for this study. Data availability TCGA-LUAD, TCGA-BRCA, TCGA-CESC, TCGA-COAD, TCGA-READ, TCGA-HNSC and TCGA-ESCA are available in the TCGA database (tcga-data.nci.nih.gov/tcga). The GSE197236 GSE207422 Declarations Ethics approval and consent to participate Not applicable. Consent for publication All authors are fully responsible for the work and have given their approval to the final manuscript. Competing interests The authors declare no competing interests. References 1. Herbst RS Morgensztern D Boshoff C The biology and management of non-small cell lung cancer Nature 2018 553 446 54 10.1038/nature25183 29364287 Herbst RS, Morgensztern D, Boshoff C. The biology and management of non-small cell lung cancer. Nature. 2018;553:446–54. 29364287 10.1038/nature25183 2. Ullah A Razzaq A Alfaifi MY Elbehairi SEI Menaa F Ullah N Shehzadi S Nawaz T Iqbal H Sanguinarine attenuates lung cancer progression via oxidative Stress-induced cell apoptosis Curr Mol Pharmacol 2024 17 e18761429269383 10.2174/0118761429269383231119062233 38389415 Ullah A, Razzaq A, Alfaifi MY, Elbehairi SEI, Menaa F, Ullah N, Shehzadi S, Nawaz T, Iqbal H. Sanguinarine attenuates lung cancer progression via oxidative Stress-induced cell apoptosis. Curr Mol Pharmacol. 2024;17:e18761429269383. 38389415 10.2174/0118761429269383231119062233 3. Qian XJ Wang JW Liu JB Yu X The mediating role of miR-451/ETV4/MMP13 signaling axis on epithelialmesenchymal transition in promoting Non-small cell lung cancer progression Curr Mol Pharmacol 2024 17 e210723218988 10.2174/1874467217666230721123554 37489792 Qian XJ, Wang JW, Liu JB, Yu X. The mediating role of miR-451/ETV4/MMP13 signaling axis on epithelialmesenchymal transition in promoting Non-small cell lung cancer progression. Curr Mol Pharmacol. 2024;17:e210723218988. 37489792 10.2174/1874467217666230721123554 4. Wang M Herbst RS Boshoff C Toward personalized treatment approaches for non-small-cell lung cancer Nat Med 2021 27 1345 56 10.1038/s41591-021-01450-2 34385702 Wang M, Herbst RS, Boshoff C. Toward personalized treatment approaches for non-small-cell lung cancer. Nat Med. 2021;27:1345–56. 34385702 10.1038/s41591-021-01450-2 5. Krause M Dubrovska A Linge A Baumann M Cancer stem cells: radioresistance, prediction of radiotherapy outcome and specific targets for combined treatments Adv Drug Deliv Rev 2017 109 63 73 10.1016/j.addr.2016.02.002 26877102 Krause M, Dubrovska A, Linge A, Baumann M. Cancer stem cells: radioresistance, prediction of radiotherapy outcome and specific targets for combined treatments. Adv Drug Deliv Rev. 2017;109:63–73. 26877102 10.1016/j.addr.2016.02.002 6. Zhou T Zhang LY He JZ Miao ZM Li YY Zhang YM Liu ZW Zhang SZ Chen Y Zhou GC Liu YQ Review: mechanisms and perspective treatment of radioresistance in non-small cell lung cancer Front Immunol 2023 14 1133899 10.3389/fimmu.2023.1133899 36865554 PMC9971010 Zhou T, Zhang LY, He JZ, Miao ZM, Li YY, Zhang YM, Liu ZW, Zhang SZ, Chen Y, Zhou GC, Liu YQ. Review: mechanisms and perspective treatment of radioresistance in non-small cell lung cancer. Front Immunol. 2023;14:1133899. 36865554 10.3389/fimmu.2023.1133899 PMC9971010 7. Cai Y Sheng Z Dong Z Wang J EGFR inhibitor CL-387785 suppresses the progression of lung adenocarcinoma Curr Mol Pharmacol 2023 16 211 6 10.2174/1874467215666220329212300 35352671 Cai Y, Sheng Z, Dong Z, Wang J. EGFR inhibitor CL-387785 suppresses the progression of lung adenocarcinoma. Curr Mol Pharmacol. 2023;16:211–6. 35352671 10.2174/1874467215666220329212300 8. Zhang D Tang Z Huang H Zhou G Cui C Weng Y Liu W Kim S Lee S Perez-Neut M Metabolic regulation of gene expression by histone lactylation Nature 2019 574 575 80 10.1038/s41586-019-1678-1 31645732 PMC6818755 Zhang D, Tang Z, Huang H, Zhou G, Cui C, Weng Y, Liu W, Kim S, Lee S, Perez-Neut M, et al. Metabolic regulation of gene expression by histone lactylation. Nature. 2019;574:575–80. 31645732 10.1038/s41586-019-1678-1 PMC6818755 9. Izzo LT Wellen KE Histone lactylation links metabolism and gene regulation Nature 2019 574 492 3 10.1038/d41586-019-03122-1 31645737 Izzo LT, Wellen KE. Histone lactylation links metabolism and gene regulation. Nature. 2019;574:492–3. 31645737 10.1038/d41586-019-03122-1 10. Liberti MV Locasale JW The Warburg effect: how does it benefit cancer cells?? Trends Biochem Sci 2016 41 211 8 10.1016/j.tibs.2015.12.001 26778478 PMC4783224 Liberti MV, Locasale JW. The Warburg effect: how does it benefit cancer cells?? Trends Biochem Sci. 2016;41:211–8. 26778478 10.1016/j.tibs.2015.12.001 PMC4783224 11. Pucino V Cucchi D Mauro C Lactate transporters as therapeutic targets in cancer and inflammatory diseases Expert Opin Ther Targets 2018 22 735 43 10.1080/14728222.2018.1511706 30106309 Pucino V, Cucchi D, Mauro C. Lactate transporters as therapeutic targets in cancer and inflammatory diseases. Expert Opin Ther Targets. 2018;22:735–43. 30106309 10.1080/14728222.2018.1511706 12. Kroemer G Pouyssegur J Tumor cell metabolism: cancer’s achilles’ heel Cancer Cell 2008 13 472 82 10.1016/j.ccr.2008.05.005 18538731 Kroemer G, Pouyssegur J. Tumor cell metabolism: cancer’s achilles’ heel. Cancer Cell. 2008;13:472–82. 18538731 10.1016/j.ccr.2008.05.005 13. Yoshida GJ Beyond the Warburg effect: N-Myc contributes to metabolic reprogramming in cancer cells Front Oncol 2020 10 791 10.3389/fonc.2020.00791 32547946 PMC7269178 Yoshida GJ. Beyond the Warburg effect: N-Myc contributes to metabolic reprogramming in cancer cells. Front Oncol. 2020;10:791. 32547946 10.3389/fonc.2020.00791 PMC7269178 14. Jiang J Huang D Jiang Y Hou J Tian M Li J Sun L Zhang Y Zhang T Li Z Lactate modulates cellular metabolism through histone Lactylation-Mediated gene expression in Non-Small cell lung cancer Front Oncol 2021 11 647559 10.3389/fonc.2021.647559 34150616 PMC8208031 Jiang J, Huang D, Jiang Y, Hou J, Tian M, Li J, Sun L, Zhang Y, Zhang T, Li Z, et al. Lactate modulates cellular metabolism through histone Lactylation-Mediated gene expression in Non-Small cell lung cancer. Front Oncol. 2021;11:647559. 34150616 10.3389/fonc.2021.647559 PMC8208031 15. Yang Z Yan C Ma J Peng P Ren X Cai S Shen X Wu Y Zhang S Wang X Lactylome analysis suggests lactylation-dependent mechanisms of metabolic adaptation in hepatocellular carcinoma Nat Metab 2023 5 61 79 10.1038/s42255-022-00710-w 36593272 Yang Z, Yan C, Ma J, Peng P, Ren X, Cai S, Shen X, Wu Y, Zhang S, Wang X, et al. Lactylome analysis suggests lactylation-dependent mechanisms of metabolic adaptation in hepatocellular carcinoma. Nat Metab. 2023;5:61–79. 36593272 10.1038/s42255-022-00710-w 16. Yu J Chai P Xie M Ge S Ruan J Fan X Jia R Histone lactylation drives oncogenesis by facilitating m(6)A reader protein YTHDF2 expression in ocular melanoma Genome Biol 2021 22 85 10.1186/s13059-021-02308-z 33726814 PMC7962360 Yu J, Chai P, Xie M, Ge S, Ruan J, Fan X, Jia R. Histone lactylation drives oncogenesis by facilitating m(6)A reader protein YTHDF2 expression in ocular melanoma. Genome Biol. 2021;22:85. 33726814 10.1186/s13059-021-02308-z PMC7962360 17. Brand A Singer K Koehl GE Kolitzus M Schoenhammer G Thiel A Matos C Bruss C Klobuch S Peter K LDHA-Associated lactic acid production blunts tumor immunosurveillance by T and NK cells Cell Metab 2016 24 657 71 10.1016/j.cmet.2016.08.011 27641098 Brand A, Singer K, Koehl GE, Kolitzus M, Schoenhammer G, Thiel A, Matos C, Bruss C, Klobuch S, Peter K, et al. LDHA-Associated lactic acid production blunts tumor immunosurveillance by T and NK cells. Cell Metab. 2016;24:657–71. 27641098 10.1016/j.cmet.2016.08.011 18. Rai Y Tiwari AK Pandey R Dwarakanath BS Bhatt AN LDHA-Associated lactic acid production blunts tumor immunosurveillance by T and NK cellsHyper-energy metabolism of oxidative phosphorylation and enhanced glycolysis contributes to radioresistance in glioma cells Free Radic Res 2025 59 117 128 10.1080/10715762.2025.2456740 39831783 Rai Y, Tiwari AK, Pandey R, Dwarakanath BS, Bhatt AN. Hyper-energy metabolism of oxidative phosphorylation and enhanced glycolysis contributes to radioresistance in glioma cells. Free Radic Res. 2025,59:117–128. 39831783 10.1080/10715762.2025.2456740 19. Cui Z Li Y Lin Y Zheng C Luo L Hu D Chen Y Xiao Z Sun Y Lactylproteome analysis indicates histone H4K12 lactylation as a novel biomarker in triple-negative breast cancer Front Endocrinol (Lausanne) 2024 15 1328679 10.3389/fendo.2024.1328679 38779451 PMC11109423 Cui Z, Li Y, Lin Y, Zheng C, Luo L, Hu D, Chen Y, Xiao Z, Sun Y. Lactylproteome analysis indicates histone H4K12 lactylation as a novel biomarker in triple-negative breast cancer. Front Endocrinol (Lausanne). 2024;15:1328679. 38779451 10.3389/fendo.2024.1328679 PMC11109423 20. Xie Y Hu H Liu M Zhou T Cheng X Huang W Cao L The role and mechanism of histone lactylation in health and diseases Front Genet 2022 13 949252 10.3389/fgene.2022.949252 36081996 PMC9445422 Xie Y, Hu H, Liu M, Zhou T, Cheng X, Huang W, Cao L. The role and mechanism of histone lactylation in health and diseases. Front Genet. 2022;13:949252. 36081996 10.3389/fgene.2022.949252 PMC9445422 21. Li S Feng J Weng H Zhao F Cui G Fu W Lin X Hu H Identification of key genes and FUNCTIONAL pathway in radioresistance of Non-Small cell lung cancer Cancer Manag Res 2022 14 2871 84 10.2147/CMAR.S382079 36171861 PMC9512540 Li S, Feng J, Weng H, Zhao F, Cui G, Fu W, Lin X, Hu H. Identification of key genes and FUNCTIONAL pathway in radioresistance of Non-Small cell lung cancer. Cancer Manag Res. 2022;14:2871–84. 36171861 10.2147/CMAR.S382079 PMC9512540 22. Chen J Lin A Luo P Advancing pharmaceutical research: A comprehensive review of cutting-edge tools and technologies Curr Pharm Anal 2024 21 1 19 10.1016/j.cpan.2024.11.001 Chen J, Lin A, Luo P. Advancing pharmaceutical research: A comprehensive review of cutting-edge tools and technologies. Curr Pharm Anal. 2024;21:1–19. 23. Koukourakis MI Giatromanolaki A Harris AL Sivridis E Comparison of metabolic pathways between cancer cells and stromal cells in colorectal carcinomas: a metabolic survival role for tumor-associated stroma Cancer Res 2006 66 632 7 10.1158/0008-5472.CAN-05-3260 16423989 Koukourakis MI, Giatromanolaki A, Harris AL, Sivridis E. Comparison of metabolic pathways between cancer cells and stromal cells in colorectal carcinomas: a metabolic survival role for tumor-associated stroma. Cancer Res. 2006;66:632–7. 16423989 10.1158/0008-5472.CAN-05-3260 24. Fischer K Hoffmann P Voelkl S Meidenbauer N Ammer J Edinger M Gottfried E Schwarz S Rothe G Hoves S Inhibitory effect of tumor cell-derived lactic acid on human T cells Blood 2007 109 3812 9 10.1182/blood-2006-07-035972 17255361 Fischer K, Hoffmann P, Voelkl S, Meidenbauer N, Ammer J, Edinger M, Gottfried E, Schwarz S, Rothe G, Hoves S, et al. Inhibitory effect of tumor cell-derived lactic acid on human T cells. Blood. 2007;109:3812–9. 17255361 10.1182/blood-2006-07-035972 25. Rabinowitz JD Enerbäck S Lactate: the ugly duckling of energy metabolism Nat Metab 2020 2 566 71 10.1038/s42255-020-0243-4 32694798 PMC7983055 Rabinowitz JD, Enerbäck S. Lactate: the ugly duckling of energy metabolism. Nat Metab. 2020;2:566–71. 32694798 10.1038/s42255-020-0243-4 PMC7983055 26. de la Cruz-López KG Castro-Muñoz LJ Reyes-Hernández DO García-Carrancá A Manzo-Merino J Lactate in the regulation of tumor microenvironment and therapeutic approaches Front Oncol 2019 9 1143 10.3389/fonc.2019.01143 31737570 PMC6839026 de la Cruz-López KG, Castro-Muñoz LJ, Reyes-Hernández DO, García-Carrancá A, Manzo-Merino J. Lactate in the regulation of tumor microenvironment and therapeutic approaches. Front Oncol. 2019;9:1143. 31737570 10.3389/fonc.2019.01143 PMC6839026 27. Foskolou IP Jorgensen C Leszczynska KB Olcina MM Tarhonskaya H Haisma B D’Angiolella V Myers WK Domene C Flashman E Hammond EM Ribonucleotide reductase requires subunit switching in hypoxia to maintain DNA replication Mol Cell 2017 66 206 e220209 10.1016/j.molcel.2017.03.005 28416140 PMC5405111 Foskolou IP, Jorgensen C, Leszczynska KB, Olcina MM, Tarhonskaya H, Haisma B, D’Angiolella V, Myers WK, Domene C, Flashman E, Hammond EM. Ribonucleotide reductase requires subunit switching in hypoxia to maintain DNA replication. Mol Cell. 2017;66:206–e220209. 28416140 10.1016/j.molcel.2017.03.005 PMC5405111 28. Zhu Y Song B Yang Z Peng Y Cui Z Chen L Song B Integrative lactylation and tumor microenvironment signature as prognostic and therapeutic biomarkers in skin cutaneous melanoma J Cancer Res Clin Oncol 2023 149 17897 919 10.1007/s00432-023-05483-7 37955686 PMC11796655 Zhu Y, Song B, Yang Z, Peng Y, Cui Z, Chen L, Song B. Integrative lactylation and tumor microenvironment signature as prognostic and therapeutic biomarkers in skin cutaneous melanoma. J Cancer Res Clin Oncol. 2023;149:17897–919. 37955686 10.1007/s00432-023-05483-7 PMC11796655 29. Yin X Jiang K Zhou Z Yu H Yan D He X Yan S Prognostic and immunological potential of ribonucleotide reductase subunits in liver cancer Oxid Med Cell Longev 2023 2023 3878796 10.1155/2023/3878796 36713030 PMC9883104 Yin X, Jiang K, Zhou Z, Yu H, Yan D, He X, Yan S. Prognostic and immunological potential of ribonucleotide reductase subunits in liver cancer. Oxid Med Cell Longev. 2023;2023:3878796. 36713030 10.1155/2023/3878796 PMC9883104 30. Iqbal W Demidova EV Serrao S ValizadehAslani T Rosen G Arora S RRM2B is frequently amplified across multiple tumor types: implications for DNA repair, cellular survival, and cancer therapy Front Genet 2021 12 628758 10.3389/fgene.2021.628758 33868369 PMC8045241 Iqbal W, Demidova EV, Serrao S, ValizadehAslani T, Rosen G, Arora S. RRM2B is frequently amplified across multiple tumor types: implications for DNA repair, cellular survival, and cancer therapy. Front Genet. 2021;12:628758. 33868369 10.3389/fgene.2021.628758 PMC8045241 31. Chae YK Anker JF Carneiro BA Chandra S Kaplan J Kalyan A Santa-Maria CA Platanias LC Giles FJ Genomic landscape of DNA repair genes in cancer Oncotarget 2016 7 23312 21 10.18632/oncotarget.8196 27004405 PMC5029628 Chae YK, Anker JF, Carneiro BA, Chandra S, Kaplan J, Kalyan A, Santa-Maria CA, Platanias LC, Giles FJ. Genomic landscape of DNA repair genes in cancer. Oncotarget. 2016;7:23312–21. 27004405 10.18632/oncotarget.8196 PMC5029628 32. Shang J Kondowe B Zhang H Xie X Identifying ribonucleotide reductase subunit genes as potential lung adenocarcinomas biomarkers using integrated bioinformatics analysis Malawi Med J 2024 36 134 43 10.4314/mmj.v36i2.11 40191558 PMC11970203 Shang J, Kondowe B, Zhang H, Xie X. Identifying ribonucleotide reductase subunit genes as potential lung adenocarcinomas biomarkers using integrated bioinformatics analysis. Malawi Med J. 2024;36:134–43. 40191558 10.4314/mmj.v36i2.11 PMC11970203 33. Kalluri R Basement membranes: structure, assembly and role in tumour angiogenesis Nat Rev Cancer 2003 3 422 33 10.1038/nrc1094 12778132 Kalluri R. Basement membranes: structure, assembly and role in tumour angiogenesis. Nat Rev Cancer. 2003;3:422–33. 12778132 10.1038/nrc1094 34. Zhang H Zhang X Huang Z Zhang H Integrative genomics unveils basement membrane-related diagnostic markers and therapeutic targets in esophageal squamous cell carcinoma Biol Direct 2024 19 79 10.1186/s13062-024-00529-3 39256753 PMC11389425 Zhang H, Zhang X, Huang Z, Zhang H. Integrative genomics unveils basement membrane-related diagnostic markers and therapeutic targets in esophageal squamous cell carcinoma. Biol Direct. 2024;19:79. 39256753 10.1186/s13062-024-00529-3 PMC11389425 35. Wang T Jin H Hu J Li X Ruan H Xu H Wei L Dong W Teng F Gu J COL4A1 promotes the growth and metastasis of hepatocellular carcinoma cells by activating FAK-Src signaling J Exp Clin Cancer Res 2020 39 148 10.1186/s13046-020-01650-7 32746865 PMC7398077 Wang T, Jin H, Hu J, Li X, Ruan H, Xu H, Wei L, Dong W, Teng F, Gu J, et al. COL4A1 promotes the growth and metastasis of hepatocellular carcinoma cells by activating FAK-Src signaling. J Exp Clin Cancer Res. 2020;39:148. 32746865 10.1186/s13046-020-01650-7 PMC7398077 36. Jin R Shen J Zhang T Liu Q Liao C Ma H Li S Yu Z The highly expressed COL4A1 genes contributes to the proliferation and migration of the invasive ductal carcinomas Oncotarget 2017 8 58172 83 10.18632/oncotarget.17345 28938546 PMC5601642 Jin R, Shen J, Zhang T, Liu Q, Liao C, Ma H, Li S, Yu Z. The highly expressed COL4A1 genes contributes to the proliferation and migration of the invasive ductal carcinomas. Oncotarget. 2017;8:58172–83. 28938546 10.18632/oncotarget.17345 PMC5601642 37. Zeng X Wang HY Wang YP Bai SY Pu K Zheng Y Guo QH Guan QL Ji R Zhou YN COL4A family: potential prognostic biomarkers and therapeutic targets for gastric cancer Transl Cancer Res 2020 9 5218 32 10.21037/tcr-20-517 35117889 PMC8799138 Zeng X, Wang HY, Wang YP, Bai SY, Pu K, Zheng Y, Guo QH, Guan QL, Ji R, Zhou YN. COL4A family: potential prognostic biomarkers and therapeutic targets for gastric cancer. Transl Cancer Res. 2020;9:5218–32. 35117889 10.21037/tcr-20-517 PMC8799138 38. Guo J Ma X Liu D Wang F Xia J Zhang B Zhao P Zhong F Chen L Long Q A distinct subset of urothelial cells with enhanced EMT features promotes chemotherapy resistance and cancer recurrence by increasing COL4A1-ITGB1 mediated angiogenesis Drug Resist Updat 2024 76 101116 10.1016/j.drup.2024.101116 38968684 Guo J, Ma X, Liu D, Wang F, Xia J, Zhang B, Zhao P, Zhong F, Chen L, Long Q, et al. A distinct subset of urothelial cells with enhanced EMT features promotes chemotherapy resistance and cancer recurrence by increasing COL4A1-ITGB1 mediated angiogenesis. Drug Resist Updat. 2024;76:101116. 38968684 10.1016/j.drup.2024.101116 39. Ke ZB Chen JY Xue YT Lin B Huang Q Huang XY Chen DN Chen SH Ye XJ Zheng QS Mechanical signal modulates prostate cancer immune escape by USP8-mediated ubiquitination-dependent degradation of PD-L1 and MHC-1 Cell Death Dis 2025 16 413 10.1038/s41419-025-07736-4 40410130 PMC12102395 Ke ZB, Chen JY, Xue YT, Lin B, Huang Q, Huang XY, Chen DN, Chen SH, Ye XJ, Zheng QS, et al. Mechanical signal modulates prostate cancer immune escape by USP8-mediated ubiquitination-dependent degradation of PD-L1 and MHC-1. Cell Death Dis. 2025;16:413. 40410130 10.1038/s41419-025-07736-4 PMC12102395 40. Wang M Yi J Gao H Wei X Xu W Zhao M Zhao M Shen Y Wang Z Wu N Radiation-induced YAP/TEAD4 binding confers non-small cell lung cancer radioresistance via promoting NRP1 transcription Cell Death Dis 2024 15 619 10.1038/s41419-024-07017-6 39187525 PMC11347582 Wang M, Yi J, Gao H, Wei X, Xu W, Zhao M, Zhao M, Shen Y, Wang Z, Wu N, et al. Radiation-induced YAP/TEAD4 binding confers non-small cell lung cancer radioresistance via promoting NRP1 transcription. Cell Death Dis. 2024;15:619. 39187525 10.1038/s41419-024-07017-6 PMC11347582 41. Zhang Y Wang Y Zhou D Wang K Wang X Wang X Jiang Y Zhao M Yu R Zhou X Radiation-induced YAP activation confers glioma radioresistance via promoting FGF2 transcription and DNA damage repair Oncogene 2021 40 4580 91 10.1038/s41388-021-01878-3 34127812 PMC8266683 Zhang Y, Wang Y, Zhou D, Wang K, Wang X, Wang X, Jiang Y, Zhao M, Yu R, Zhou X. Radiation-induced YAP activation confers glioma radioresistance via promoting FGF2 transcription and DNA damage repair. Oncogene. 2021;40:4580–91. 34127812 10.1038/s41388-021-01878-3 PMC8266683 42. Uchihara T Miyake K Yonemura A Komohara Y Itoyama R Koiwa M Yasuda T Arima K Harada K Eto K Extracellular vesicles from Cancer-Associated fibroblasts containing Annexin A6 induces FAK-YAP activation by stabilizing β1 integrin, enhancing drug resistance Cancer Res 2020 80 3222 35 10.1158/0008-5472.CAN-19-3803 32605995 Uchihara T, Miyake K, Yonemura A, Komohara Y, Itoyama R, Koiwa M, Yasuda T, Arima K, Harada K, Eto K, et al. Extracellular vesicles from Cancer-Associated fibroblasts containing Annexin A6 induces FAK-YAP activation by stabilizing β1 integrin, enhancing drug resistance. Cancer Res. 2020;80:3222–35. 32605995 10.1158/0008-5472.CAN-19-3803 43. Wei X Zou L Huang Y Qiu C Cheng G Chen Y Rao J LDHA-mediated YAP lactylation promotes the tumor progression of hepatocellular carcinoma by inducing YAP dephosphorylation and activation Biol Direct 2025 20 64 10.1186/s13062-025-00655-6 40414964 PMC12105199 Wei X, Zou L, Huang Y, Qiu C, Cheng G, Chen Y, Rao J. LDHA-mediated YAP lactylation promotes the tumor progression of hepatocellular carcinoma by inducing YAP dephosphorylation and activation. Biol Direct. 2025;20:64. 40414964 10.1186/s13062-025-00655-6 PMC12105199 44. Yamamoto H Fara AF Dasgupta P Kemper C CD46: the ‘multitasker’ of complement proteins Int J Biochem Cell Biol 2013 45 2808 20 10.1016/j.biocel.2013.09.016 24120647 Yamamoto H, Fara AF, Dasgupta P, Kemper C. CD46: the ‘multitasker’ of complement proteins. Int J Biochem Cell Biol. 2013;45:2808–20. 24120647 10.1016/j.biocel.2013.09.016 45. Thi TN Thanh HD Nguyen VT Kwon SY Moon C Hwang EC Jung C Complement regulatory protein CD46 promotes bladder cancer metastasis through activation of MMP9 Int J Oncol 2024 35 71 10.3892/ijo.2024.5659 PMC11173367 38847230 Thi TN, Thanh HD, Nguyen VT, Kwon SY, Moon C, Hwang EC, Jung C. Complement regulatory protein CD46 promotes bladder cancer metastasis through activation of MMP9. Int J Oncol 2024,65:71. 10.3892/ijo.2024.5659 PMC11173367 38847230 46. Tang G Pan L Wang Z Zhu H Yang Y Wang Z Yue H Shi Y Wu D Jiang Z Jiang D Knockdown of membrane-bound complement regulatory proteins suppresses colon cancer growth in mice through inducing tumor cell apoptosis Int Immunopharmacol 2023 114 109450 10.1016/j.intimp.2022.109450 36446233 Tang G, Pan L, Wang Z, Zhu H, Yang Y, Wang Z, Yue H, Shi Y, Wu D, Jiang Z, Jiang D. Knockdown of membrane-bound complement regulatory proteins suppresses colon cancer growth in mice through inducing tumor cell apoptosis. Int Immunopharmacol. 2023;114:109450. 36446233 10.1016/j.intimp.2022.109450 47. Maciejczyk A Szelachowska J Szynglarewicz B Szulc R Szulc A Wysocka T Jagoda E Lage H Surowiak P CD46 expression is an unfavorable prognostic factor in breast cancer cases Appl Immunohistochem Mol Morphol 2011 19 540 6 10.1097/PAI.0b013e31821a0be9 21617523 Maciejczyk A, Szelachowska J, Szynglarewicz B, Szulc R, Szulc A, Wysocka T, Jagoda E, Lage H, Surowiak P. CD46 expression is an unfavorable prognostic factor in breast cancer cases. Appl Immunohistochem Mol Morphol. 2011;19:540–6. 21617523 10.1097/PAI.0b013e31821a0be9 48. Cho EC Kuo ML Cheng JH Cheng YC Hsieh YC Liu YR Hsieh RH Yen Y RRM2B-mediated regulation of mitochondrial activity and inflammation under oxidative stress Mediators Inflamm 2015 2015 287345 10.1155/2015/287345 26089597 PMC4451759 Cho EC, Kuo ML, Cheng JH, Cheng YC, Hsieh YC, Liu YR, Hsieh RH, Yen Y. RRM2B-mediated regulation of mitochondrial activity and inflammation under oxidative stress. Mediators Inflamm. 2015;2015:287345. 26089597 10.1155/2015/287345 PMC4451759 49. Chu PY Tzeng YT Chiu YH Lin HY Kuo CH Hou MF Li CJ Multi-Omics Reveals the immunological role and prognostic potential of mitochondrial ubiquitin ligase march5 in human breast cancer Biomedicines 2021 2021 1329 10.3390/biomedicines9101329 PMC8533422 34680446 Chu PY, Tzeng YT, Chiu YH, Lin HY, Kuo CH, Hou MF, Li CJ. Multi-Omics Reveals the immunological role and prognostic potential of mitochondrial ubiquitin ligase march5 in human breast cancer. Biomedicines 2021,9:1329. 10.3390/biomedicines9101329 PMC8533422 34680446 ",
  "metadata": {
    "Title of this paper": "Multi-Omics Reveals the immunological role and prognostic potential of mitochondrial ubiquitin ligase march5 in human breast cancer",
    "Journal it was published in:": "Discover Oncology",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12484495/"
  }
}