{
  "title": "Paper_1067",
  "abstract": "pmc Can J Surg Can J Surg 505 canjsurg 0372715 Canadian Journal of Surgery 0008-428X 1488-2310 Canadian Medical Association PMC12479119 PMC12479119.1 12479119 12479119 41005992 10.1503/cjs.001224 068E365 1 Research Trends and variations in Canadian thoracic surgical volume and perioperative practice during the COVID-19 pandemic Jones Daniel MD, MPH Simone Alexander MD Hyun Caroline MD Anstee Caitlin BSc Gingrich Molly MSc Villeneuve James MD French Daniel MD Johnston Brian MD Gowing Stephen MD Spicer Jonathan MD, PhD Ferri Lorenzo MD, PhD Seely Andrew J.E. MD, PhD From the Division of Thoracic Surgery, Department of Surgery, The Ottawa Hospital, Ottawa, Ont. (Jones, Villeneuve, Seely); Ottawa Hospital Research Institute, Ottawa, Ont. (Jones, Anstee, Gingrich, Villeneuve, Seely); Faculty of Medicine, University of Ottawa, Ottawa, Ont. (Simone); McGill University Health Centre, Montréal, Que. (Hyun, Spicer, Ferri); Dalhousie University, Halifax, NS (French); Horizon Health Network, Saint Johns, NB (Johnston); University of Saskatchewan, Saskatoon, Sask. (Gowing) Correspondence to: A. Simone University of Ottawa Faculty of Medicine, Surgery 451 Smyth Road Ottawa ON K1H 8M5 asimo056@uottawa.ca Sep-Oct 2025 25 9 2025 68 5 497179 E365 E375 06 1 2025 25 09 2025 30 09 2025 30 09 2025 © 2025 CMA Impact Inc. or its licensors 2025 https://creativecommons.org/licenses/by-nc-nd/4.0/ This is an Open Access article distributed in accordance with the terms of the Creative Commons Attribution (CC BY-NC-ND 4.0) licence, which permits use, distribution and reproduction in any medium, provided that the original publication is properly cited, the use is noncommercial (i.e., research or educational use), and no modifications or adaptations are made. See: https://creativecommons.org/licenses/by-nc-nd/4.0/ Background: Thoracic surgeons in Canada responded to the COVID-19 pandemic without existing precedence. The primary aim of this study was to understand how thoracic surgery care in Canada was affected by the pandemic in terms of volume, perioperative management, and patterns of practice. Methods: Data were obtained using 2 questionnaires (18-item surgeon-specific and 13-item institution-specific questionnaires) in addition to the Canadian Association of Thoracic Surgery (CATS) national database. Outcomes included qualitative surgeon experiences and thoracic surgery volume from March 2020 to December 2022. Centres were separated into 3 levels of COVID-19 burden based on community prevalence. Results: We received survey responses from 63 surgeons and 6 institutions. In-person consultation dropped by 57% during the pandemic. Preoperative cancer workups experienced minor (≤ 4 wk, 39%) and major (≥ 8 wk, 27%) delays. Operable lung and esophageal cancer experienced minor delays in treatment, while pure ground-glass opacities and benign esophageal pathology experienced major delays (25%) or cancellations (21%). Medical education shifted to virtual platforms, decreasing student involvement by 81%. Perceived factors affecting operating room availability included lack of staff, beds, and personal protective equipment. Conclusion: There was a pan-Canadian reduction in thoracic surgery volume, regardless of regional COVID-19 caseload. Prioritization of thoracic oncology was observed, with a delay in care for minimally invasive and benign illness. Our findings illustrate how surgeons and institutions responded to the pandemic and inform strategies for Canadian thoracic practice in the event of future analogous events. Contexte : Au Canada, la réponse des équipes de chirurgie thoracique à la pandémie de COVID-19 a été sans précédent. Le premier but de cette étude était d’analyser l’impact de la pandémie sur la prestation des soins en chirurgie thoracique aux plans du volume, de la prise en charge périopératoire et des modes de pratique. Méthodes : Les données proviennent de 2 questionnaires (l’un en 18 points pour les chirurgiennes et chirurgiens et l’autre en 13 points pour les établissements), et de la base de données nationale de l’Association canadienne de chirurgie thoracique. Les réponses incluaient l’expérience chirurgicale qualitative et le volume de chirurgies thoraciques de mars 2020 à décembre 2022. Les établissements ont été classés en 3 niveaux selon l’impact de la COVID-19 et sa prévalence locale. Résultats : Nous avons reçu des réponses aux questionnaires de 63 chirurgiennes et chirurgiens et de 6 établissements. Les consultations en personne ont diminué de 57 % pendant la pandémie. Les analyses préopératoires pour les cas de cancer ont connu des retards mineurs (≤ 4 semaines, 39 %) et majeurs (≥ 8 semaines, 27 %). Le traitement des cas de cancer opérable du poumon et de l’œsophage a connu des retards mineurs, tandis que celui des cas établis d’opacités en verre dépoli et de pathologies œsophagiennes mineures ont connu des retards importants (25 %) ou des annulations (21 %). La formation médicale est passée en mode virtuel, ce qui a réduit de 81 % la participation des étudiantes et étudiants. Les facteurs donnant l’impression de nuire à la disponibilité du bloc opératoire incluaient la pénurie de personnel, de lits et d’équipement de protection individuelle. Conclusion : Nous avons observé une réduction du volume des interventions en chirurgie thoracique partout au Canada, indépendamment du nombre de cas régionaux de COVID-19, ainsi qu’une priorisation des cas d’oncologie thoracique et un retard des soins pour les cas minimalement envahissants ou bénins. Nos observations témoignent de la façon dont les équipes de chirurgie et les établissements ont répondu à la pandémie et éclairent les stratégies à adopter en chirurgie thoracique au Canada si des situations semblables se présentent à nouveau. pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement no pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes The COVID-19 pandemic led to a global health crisis not witnessed since the 1918 influenza pandemic. Canadian provinces took steps to preserve hospital personnel and resources by reallocating resources away from usual illness-related demands and placing restrictions on nonessential hospital activities, including elective surgical procedures. Such changes affected the number of elective cancer operations performed, with predictive modelling suggesting the postponement of more than 140 000 surgeries within Ontario, Canada, since March 2020, and 38% fewer cancer surgeries occurring in the province. 1 A natural tension evolved from these disruptions, pitting the provision of semiurgent elective surgery, such as that seen with thoracic malignancy, against necessary resources to treat COVID-19-related illnesses. The potential short- and long-term health consequences of deferring elective surgical care in Canada remains unknown. Further postponement of elective surgical cases is expected, as are changes in patient referral patterns. Insights into regional and provincial variations in surgical volumes and delay in elective surgical cases may help guide post-pandemic waitlist prioritization. 2 The primary aim of our study was to understand how thoracic surgeons and institutions in Canada responded to the COVID-19 pandemic in terms of volume, perioperative management, education, and patterns of practice. The second aim was to evaluate regional variability in surgical care. Methods Data were derived from 3 sources: the Canadian Association of Thoracic Surgeons (CATS) national database, a surgeon questionnaire, and an institutional questionnaire. Surgical volume The CATS database systematically records operations performed at participating institutions along with the incidence and severity of adverse events (AE), using a standardized taxonomy (i.e., Thoracic Morbidity & Mortality) based on the Clavien–Dindo schema. From March 2020 to December 2022, prospectively collected data on elective surgical volume in Canadian thoracic centres were included. Participating sites provided The Ottawa Hospital research team with a complete list of elective procedures conducted at their institutions during the study time periods. Adult patients (≥ 18 yr) who underwent elective thoracic surgery were included. Participating centres were stratified a priori according to regional COVID-19 caseload. We defined high-caseload centres as those with 800 COVID-19 cases per 100 000 inhabitants, medium-caseload centres as those with 500 cases per 100 000, and low-caseload centres as those with 300 cases per 100 000. To identify the impact of COVID-19 on thoracic volume, we stratified time periods as follows: pre-COVID (defined as all months before March 2020), first wave (March 2020 to July 2020), second wave (September 2020 to July 2021), and post-COVID (August 2021 to December 2023). Additionally, we considered the first wave and second wave periods as “peak-COVID-19,” where increased caseloads were observed. The time periods were created by assessing regional case exposure nationwide. Given the complexity of SARS-CoV-2 spread in communities served by participating centres across Canada, we considered the nationwide monthly incidence of community-reported SARS-CoV-2 infections as the basis for distinguishing the first and second waves of the COVID-19 pandemic. Surgeon and institution surveys To complement retrospective data, 2 online surveys were distributed via SurveyMonkey: a surgeon-based questionnaire (distributed to all CATS members, n The 18-item surgeon-specific questionnaire asked about baseline surgeon demographics; perioperative management of patients before and during the pandemic, as well as anticipated perioperative management post-pandemic; intraoperative management, including the presence of learners within the operating room (OR); postoperative management, including changes or barriers to discharge and follow-up; changes in education, including morbidity and mortality rounds and multidisciplinary rounds; and overall surgeon impressions of positive and negative effects of the pandemic. Demographic data (number of years in practice, academic v. community practice, and location of practice) were also collected. In the surgeon-specific survey, the following terms were used to denote time periods: business as usual (no changes), minor delay (1–4 wk), moderate delay (4–8 wk), major delay (> 8 wk), and deferred or cancelled. The 13-item institutional questionnaire was distributed to each participating centre’s thoracic department division head, who was tasked with collecting data on local institutional thoracic surgery volume/pandemic-related practices and completing the questionnaire. The questionnaire asked about volume and changes in referral patterns; OR availability during the pandemic; pandemic-related changes to OR booking; case prioritization during the pandemic; and changes in intraoperative protocol, including personal protective equipment (PPE), preoperative patient testing, and intubation, related to the pandemic. Statistical analysis Descriptive statistics were used to describe patient and surgical data. Categorical data are expressed as frequencies and percentages, and continuous data as medians and standard deviations (SD) or medians with 95% confidence intervals (CI). We used χ 2 p Ethics approval This study received ethics approval from the Ottawa Health Science Network Research Ethics Board (#20210317–01H). Results Surgical volume We identified high, medium, and low caseloads among the participating centres. High-caseload centres (800 COVID-19 cases per 100 000 inhabitants) were located in Toronto, Vancouver, Montréal, and Edmonton; medium-caseload centres (500 cases per 100 000) were located in Ottawa, Calgary, Saskatoon, Surrey, London, Québec, and Sherbrooke; and low-caseload centres (300 cases per 100 000) were located in Halifax, Sudbury, Saint John, Victoria, and Owen Sound. Figure 1 Figure 2 Surgeon survey Sixty-three surgeons from 24 centres responded to the questionnaire, representing 51% of the CATS mailing list. The greatest number of responses were from surgeons practising at centres with high COVID-19 caseloads ( n n n n n n Perioperative management All centres reported a substantial decrease of in-person preoperative consultation during peak-COVID-19, decreasing from 89% to 16% ( Figure 3 Timeliness and availability of preoperative workup Access to preoperative imaging, staging procedures (diagnostic laparoscopy, cervical mediastinoscopy, endobronchial ultrasonography [EBUS], esophagogastroduodenoscopy, endoscopic ultrasonography [EUS], cardiopulmonary assessment [CPA], and prehabilitation) was assessed. Prior to the COVID-19 pandemic, preoperative imaging was generally timely and available (53%), with minor delays reported by 40% of respondents and major delays by only 7%. During peak-COVID-19, preoperative imaging was timely and available according to only 33% of respondents, with major delays reported by 27% ( Figure 4 Before the pandemic, a majority of respondents (51%) indicated that preoperative invasive staging was timely and available, with 45% reporting minor delays. During peak-COVID-19, only 27% of respondents indicated that invasive staging was timely and available. In addition, 31% of respondents indicated major delays in access to invasive staging. Most respondents (74%) believed that baseline level access would resume post-pandemic ( Figure 5 During peak-COVID-19, CPA was reduced, with only 12% of centres reporting timely and available access. Specifically, CPA was limited with minor (49%) and major (31%) delays. Furthermore, 8% of surgeons indicated CPA was unavailable. As the waves progressed and caseloads dropped, baseline levels returned, with most surgeons anticipating timely and available access (51%) or minor delays (41%). There was no difference between high-, medium-, or low-caseload centres; all centres experienced increases in minor or major delays during peak-COVID-19. Timeliness and availability of treatment During peak-COVID-19, respondents reported delays in surgical care for patients with ground-glass opacities (GGOs). This included minor (1 to 4 wk, 32%), moderate (4 to 8 wk, 23%), and major delays (≥ 8 wk, 25%). In addition, 21% of respondents reported a deferral or cancellation of operative management of pure GGOs. The greatest effects were seen at high-caseload centres, where 40% of respondents reported a major delay during this period. Moderate (57%) and minor (43%) delays were more commonly anticipated post-pandemic at high-caseload centres. For early-stage (stage I) lung cancer, 33% of surgeons reported minor delays in operative management, whereas 18% reported moderate delays. For locally advanced (stages II and III) cancer, 11% of surgeons reported moderate delays, 23% reported minor delays, and 66% reported no delays (business as usual) during peak-COVID-19 ( Figure 6 Most respondents (75%) reported no delays (business as usual) in the management of operable esophageal cancer, and 21% of respondents reported minor delays of 1 to 4 weeks ( Figure 6 Operable benign conditions included giant paraesophageal hernias (PEH), achalasia, and recurrent pneumothorax. All respondents reported delays for operable benign disease during peak-COVID-19. Specifically, 51% of respondents reported major delays (> 8 wk) for PEH repair, and 42% reported deferral or cancellation of PEH surgery altogether ( Figure 7 Medical education Presence of learners within the OR was assessed during peak-COVID-19. Participation of residents and fellows in the OR was similar during all waves of COVID-19, although residents experienced a minor decrease in operative involvement (12%). Medical student presence in the OR dropped from 100% pre-pandemic to 19% during peak-COVID-19. These data include medical students in all 4 years of undergraduate training. In the pre-pandemic period, morbidity and mortality rounds were very rarely administered virtually (4%); however, during peak-COVID-19 virtual delivery of rounds became the norm (84%) ( Figure 8 Figure 8 During peak-COVID, 96% of respondents indicated that a virtual platform was used to present patients at multidisciplinary cancer conferences (MCC). This was a dramatic rise from the pre-pandedmic era, where MCCs were rarely delivered virtually (92%). Most respondents (96%) reported they anticipated that virtual delivery of MCCs would continue post-pandemic ( Figure 9 Postoperative management There was no association between the regional intensity of COVID-19 caseloads and discharge criteria for thoracic patients. Overall, most respondents (64%) indicated no change in discharge criteria, whereas 21% reported delayed availability of home care and allied health care, resulting in a delay in discharge. In the pre-pandemic period, 89% of respondents indicated that follow-up appointments were conducted in person. However, during peak-COVID-19, patients were mostly seen virtually; only 24% of respondents reported seeing patients in person during this time period. When asked how respondents anticipated following up with patients in the post-pandemic period, only 31% indicated they would see patients in person often or very often, whereas 38% of respondents indicated in-person follow-up would occur rarely or very rarely. Institutional questionnaire The institutional questionnaire received responses from 6 centres: Toronto, Montréal, Ottawa, Saskatoon, Halifax, and Saint John. This provided an equal data set from all 3 stratification categories in our study (high-, medium-, and low-caseload centres). None of the centres provided a pre-pandemic prioritization plan or had one in place before March 2020. The maximum drop in referral volume during the pandemic was 60% across all sites, with an average drop of 35% across all centres sampled. Data on referral volume included a best estimate of the maximal drop in referral volume during peak-COVID-19. Operating room availability was calculated monthly from March 2020 to June 2021. Both malignant and benign cases were affected during this time period, with the greatest impact on OR availability occurring during the fall of 2020 and early January 2021 for benign disease. Responding centres indicated that by March 2021, both cancer surgeries and surgeries for benign conditions were experiencing slow-downs, and neither category experienced OR availability that was considered “business as usual.” Surgeries for benign operations, which were most heavily affected during peak-COVID-19, slowly resumed in early 2021, whereas surgery for malignancies were shut-down only between late 2020 and early 2021. Responding centres were asked to indicate the perceived variables affecting OR availability. The following variables were perceived as impacting OR availability: actual staff availability, actual intensive care unit (ICU) bed occupation levels, dedicated COVID-19 unit, staff reallocation, local or provincial government mandate, PPE availability, anticipated ICU bed occupation levels, actual ward bed occupation levels, and anticipated ward bed occupation levels ( Table 1 Only 3 of 6 centres responded to the question of whether there had been any positive changes to the organization of thoracic surgery care because of the pandemic. Their responses were, “Cancer cases received high priority during slow down,” “None,” and “There was an allowance of virtual care by medicare [billing].” Conversely, 4 of 6 centres responded to the question of whether there had been any negative changes to the organization of thoracic surgery care because of the pandemic. Their responses were “No benign cases were done. Delays or lack of follow-up resulted in patients presenting with advanced disease”; “There was a prolonged time to treatment of urgent benign disease”; “Nursing shortage has been exacerbated by COVID-19. This has led to reduced OR availability. Not sure if directly related to COVID or not”; and “Slower on all fronts with less throughput.” Discussion We have described the perioperative practices among thoracic surgeons practising in Canada during the first 2 years of the COVID-19 pandemic. In addition, our institutional questionnaire has shed light on cross-Canada hospital-level administrative practices during the pandemic. Accessibility for patients and processes of care were heavily affected, without reflecting local COVID-19 caseloads. There were marked alterations in surgical volume and patterns of prioritization. Delays in patient care, including preoperative workup, OR access for benign disease, and discharge delays, were experienced at all levels. Surgical backlogs and challenges to patient care occurred nationally, highlighting the need for effectively planned, thoughtful, and research-driven mitigation strategies to address the surgical wait times for thoracic surgery in Canada post-pandemic. Elective surgery Substantial delays and cancellations were reported for elective thoracic surgery because of the pandemic. For example, 50% of respondents to the surgeon survey reported that the operative management of giant PEH was delayed by more than 8 weeks, while 43% reported cancellations or deferrals. Such delays pose important considerations given the potential for catastrophic complications resulting from delayed operative management of symptomatic PEH, including incarceration, strangulation, and perforation. 3 Additionally, respondents indicated that major delays were observed in the care of operable pure GGOs, particularly in high-caseload centres, where 10% of such cases were deferred or cancelled. Given the slow-growing nature of pure GGOs, this approach seemed reasonable because a delay of months to even years was not expected to result in negative consequences. 4 5 Our survey results highlight that most respondents experienced only minor delays (1–4 wk) for both early (stage I) and locally advanced (stages II and III) lung cancer. Our findings were similar for operable esophageal cancer, with centres reporting minor delays (21%). Surgeons were also asked to rate the availability of perioperative medical and radiation oncology therapy, and one-third of respondents reported only minor delays. As such, the triaging of cancer patients by prioritizing those with more advanced cancer stages was largely achieved across Canada. The increased risk of postoperative pulmonary complications as well as perioperative death in patients with SARS-CoV-2 must be considered, 6 7 Virtual care Virtual consultation refers to the exchange of medical information through electronic communication 8 9 10 11 12 Medical learners The surge in COVID-19 cases throughout the first 2 waves of the pandemic triggered considerable interruptions in undergraduate medical education. Despite COVID-19 pandemic guidance for the health care sector encouraging active participation, 13 14 15 16 17 Future pandemics and mitigation strategies The number of infectious disease pandemics has increased over the past century, with future pandemics certain. 18 19 20 Surgical backlogs, as we have shown, will inevitably occur owing to a shift in focus toward the newly emerged pathogen. Recovery planning and frameworks to model surgical recovery are available and will require province-wide and national approaches. 21 Limitations Our study has several important limitations. While we attempted to provide a comprehensive evaluation of thoracic surgical care, as defined by surgical volume, patterns of practice, education, and more, we do not have any direct measurement of impact on patient experience during, before, or after the pandemic. The ill-defined “anticipated post-pandemic experience” period was left up to surgeon interpretation and not standardized. Given the unpredictable nature of the COVID-19 pandemic, it was unclear if additional waves would impact provinces, and where those future surges would take place. As such, surgeons were asked to best estimate how they anticipated changes to occur post-pandemic. In addition, the inconsistent and variable case surges across major urban centres throughout the pandemic may have limited the accuracy of our designation of high-, medium-, and low-caseload centres. Canadian regions experienced waves at different times throughout the year, making specific time points on when the first and second waves took place potentially inaccurate. As such, it was difficult to standardize the “during COVID-19” survey questions due to the variation in regional, hospital, and community-level caseloads. While our response rate of 63 surgeons, which reflects half the country’s thoracic surgeons, is likely representative of the national perspective, we cannot rule out the possibility of bias. We were encouraged to receive responses from a variety of provinces and sites, including community hospitals, where the individual experiences of thoracic surgeons are more reflective of actual patient encounters as there may be only 1 or 2 thoracic surgeons at these sites. Finally, the low response rate on the institutional questionnaire regarding positive and negative changes to organization of thoracic care may inaccurately reflect what institutions learned (or perhaps regretted) from the COVID-19 pandemic. Strengthening our pandemic preparedness will require focused, humble, and iterative discussions regarding how best to learn from past lessons and mitigate the impact of future pandemics on surgical patients. Conclusion Our study provides a comprehensive, descriptive, cross-Canadian analysis on the effects of the COVID-19 pandemic on processes and volume of care for the thoracic surgical patients in Canada. The pandemic severely impacted perioperative care practices; changed the delivery of in-hospital care to virtual, delayed, deferred, and at times cancelled elective surgical practice; and delayed perioperative care for both benign and malignant thoracic surgery. It remains unknown how the observed changes in thoracic surgery compared with changes in other surgical disciplines; there are likely similarities and differences. Thoracic surgery focuses on eminently life-threatening oncology, and institutions prioritized maintaining that care. Indeed, thoracic surgeons who responded to our survey did not believe there was a fundamental reduction in the quality of care patients received, although it is likely that their underlying assumption was that delays and cancellations were short-term and would be resolved quickly post-pandemic. Further study is required regarding the impact of those delays and cancellations on care. We found the provincial and institutional restrictions enacted to mitigate surging COVID-19 caseloads did not have a consistent pattern or impact on thoracic surgery processes of care, with few correlations between community caseloads and surgery delays, highlighting the need for improved standardization in pandemic response. Finally, the observed marked increased use of virtual perioperative care merits further investigation regarding its effect on quality of care, physician–patient relationships, and surgical adverse events. We hope this understanding of how thoracic surgery in Canada responded to the COVID-19 pandemic will help standardize and improve our ability to respond to future analogous events. Acknowledgements The authors thank Tom Waddell and Anna Fazekas for the data curation aspect of this study. Contributors: Competing interests: References 1 Wang J Vahid S Eberg M Clearing the surgical backlog caused by COVID-19 in Ontario: a time series modelling study CMAJ 2020 192 E1347 56 32873541 10.1503/cmaj.201521 PMC7647484 2 Urbach DR Martin D Confronting the COVID-19 surgery crisis: time for transformational change CMAJ 2020 192 E585 6 32376644 10.1503/cmaj.200791 PMC7259969 3 Shea B Boyan W Decker J Emergent repair of paraesophageal hernias and the argument for elective repair JSLS 2019 23 E2019.00015 10.4293/JSLS.2019.00015 PMC6600053 31285652 4 Mayne NR Elser H Lin BK The impact of extended delayed surgery for indolent lung cancer or part-solid ground glass nodules Ann Thorac Surg 2022 113 1827 34 34329603 10.1016/j.athoracsur.2021.05.099 PMC8604629 5 Teteh DK Barajas J Ferrell B The impact of the COVID-19 pandemic on care delivery and quality of life in lung cancer surgery J Surg Oncol 2022 126 407 16 35460517 10.1002/jso.26902 PMC9088468 6 Jonker PKC van der Plas WY Steinkamp PJ Dutch Surgical COVID-19 Research Collaborative Perioperative SARS-CoV-2 infections increase mortality, pulmonary complications, and thromboembolic events: a Dutch, multicenter, matched-cohort clinical study Surgery 2021 169 264 74 33158548 10.1016/j.surg.2020.09.022 PMC7513767 7 COVIDSurg Collaborative, GlobalSurg Collaborative Timing of surgery following SARS-CoV-2 infection: an international prospective cohort study Anaesthesia 2021 76 748 58 33690889 10.1111/anae.15458 PMC8206995 8 Shah BR Schulmam K Do not let a good crisis go to waste: health care’s path forward with virtual care NEJM Catalyst 2021 Available: https://catalyst.nejm.org/doi/full/10.1056/CAT.20.0693 accessed 2022 Dec. 1 9 Koonin LM Hoots B Tsang CA Trends in the use of telehealth during the emergence of the COVID-19 pandemic — United States, January–March 2020 MMWR Morb Mortal Wkly Rep 2020 69 1595 9 33119561 10.15585/mmwr.mm6943a3 PMC7641006 10 Herzer KR Pronovost PJ Ensuring quality in the era of virtual care JAMA 2021 325 429 30 33528544 10.1001/jama.2020.24955 11 Chao GF Li KY Zhu Z Use of telehealth by surgical specialties during the COVID-19 pandemic JAMA Surg 2021 156 620 6 33769434 10.1001/jamasurg.2021.0979 PMC7998347 12 COVIDSurg Collaborative Mortality and pulmonary complications in patients undergoing surgery with perioperative SARS-CoV-2 infection: an international cohort study Lancet 2020 396 27 38 32479829 10.1016/S0140-6736(20)31182-X PMC7259900 13 COVID-19 pandemic guidance for the health care sector Ottawa Government of Canada Available: https://www.canada.ca/en/public-health/services/diseases/2019-novel-coronavirus-infection/health-professionals/covid-19-pandemic-guidance-health-care-sector.html accessed 2023 Mar. 20 14 Clark J Fear of SARS thwarts medical education in Toronto BMJ 2003 326 784 10.1136/bmj.326.7393.784/c PMC1169342 12689971 15 DePietro DM Santucci SE Harrison NE Medical student education during the COVID-19 pandemic: initial experiences implementing a virtual interventional radiology elective course Acad Radiol 2021 28 128 35 33132008 10.1016/j.acra.2020.10.005 PMC7572083 16 Abi-Rafeh J Azzi AJ Emerging role of online virtual teaching resources for medical student education in plastic surgery: COVID-19 pandemic and beyond J Plast Reconstr Aesthet Surg 2020 73 1575 92 10.1016/j.bjps.2020.05.085 PMC7256619 32553546 17 Fehervari M Das B Soleimani-Nouri P Can surgical skills be taught using technological advances online? A comparative study of online and face-to-face surgical skills training Surg Endosc 2022 36 4631 7 35254521 10.1007/s00464-022-09170-5 PMC9085701 18 Jones KE Patel NG Levy MA Global trends in emerging infectious diseases Nature 2008 451 990 3 18288193 10.1038/nature06536 PMC5960580 19 Wenger NS The impact of COVID-19 on routine medical care and cancer screening J Gen Intern Med 2022 37 1450 6 35013931 10.1007/s11606-021-07254-x PMC8744580 20 Williams BA Jones CH Welch V Outlook of pandemic preparedness in a post-COVID-19 world NPJ Vaccines 2023 8 178 37985781 10.1038/s41541-023-00773-0 PMC10662147 21 Wang J Vahid S Eberg M Clearing the surgical backlog caused by COVID-19 in Ontario: a time series modelling study CMAJ 2020 1192 E1347 56 10.1503/cmaj.201521 PMC7647484 32873541 Fig. 1 Average monthly COVID-19 caseload. Fig. 2 Elective surgical volume recorded in the Canadian Association of Thoracic Surgeons (CATS) national database. Fig. 3 In-person versus virtual care pre-pandemic, during the first and second waves (peak-COVID-19), and anticipated post-pandemic. Fig. 4 Timeliness and availability of preoperative imaging pre-pandemic, during the first and second waves (peak-COVID-19), and anticipated post-pandemic. Fig. 5 Timeliness and availability of preoperative invasive staging pre-pandemic, during the first and second waves (peak-COVID-19), and anticipated post-pandemic. Fig. 6 Timeliness and availability of treatment of operable lung cancer, esophageal cancer, and benign conditions. Fig. 7 Delay in treatment for operable benign conditions pre-pandemic, during the first and second waves (peak-COVID-19), and anticipated post-pandemic. Fig. 8 Delivery of virtual morbidity and mortality rounds pre-pandemic, during the first and second waves (peak-COVID-19), and anticipated post-pandemic. Fig. 9 Delivery of virtual multidisciplinary cancer conferences pre-pandemic, during the first and second waves (peak-COVID-19), and anticipated post-pandemic. Table 1 Perceived factors affecting OR availability among responding insitutions ( n Factor Responses, % Actual staff availability 83 Actual ICU bed occupation level 83 Dedicated COVID-19 unit 67 Staff reallocation 67 Local or provincial government mandates 50 PPE availability 50 Anticipated ICU bed occupation level 50 Actual ward bed occupation level 33 Anticipated ward bed occupation level 33 ICU = intensive care unit; OR = operating room; PPE = personal protective equipment. ",
  "metadata": {
    "Title of this paper": "Clearing the surgical backlog caused by COVID-19 in Ontario: a time series modelling study",
    "Journal it was published in:": "Canadian Journal of Surgery",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12479119/"
  }
}