{
  "title": "Paper_633",
  "abstract": "pmc Int J Mol Sci Int J Mol Sci 808 ijms ijms International Journal of Molecular Sciences 1422-0067 Multidisciplinary Digital Publishing Institute  (MDPI) PMC12470876 PMC12470876.1 12470876 12470876 41009771 10.3390/ijms26189211 ijms-26-09211 1 Review An Emerging Paradigm for ABCC5/MRP5 Function in Human Physiology Chinoy Jenai 1 2 Meller Charlotte 2 3 4 https://orcid.org/0000-0002-9871-6909 de Wet Heidi 2 * Manolson Morris F. Academic Editor 1 jenaichinoy@doctors.org.uk 2 charlotte.l.meller@diamond.ac.uk 3 4 * heidi.de-wet@dpag.ox.ac.uk 20 9 2025 9 2025 26 18 497349 9211 10 7 2025 05 9 2025 17 9 2025 20 09 2025 27 09 2025 29 09 2025 © 2025 by the authors. 2025 https://creativecommons.org/licenses/by/4.0/ Licensee MDPI, Basel, Switzerland. This article is an open access article distributed under the terms and conditions of the Creative Commons Attribution (CC BY) license ( https://creativecommons.org/licenses/by/4.0/ Since the first paper published by Susan Cole in 1990 detailing multidrug resistance mediated by ABCC1/MRP1, research into the C-subfamily of ATP-binding cassette transporters has continued to uncover a wide range of functionally divergent proteins. However, several orphan transporters remain in the C-subfamily, and the physiological function and substrates of ABCC5, ABCC11, and ABCC12 remain elusive. This review explores the emerging understanding of human ABCC5. Unlike other ABC transporters with well-defined drug export functions, ABCC5’s physiological roles remain only partially understood. While it is known for its involvement in multidrug resistance in cancers, recent studies suggest broader implications in development, metabolism, neurobiology, and male fertility. ABCC5 exports various endogenous substrates, including cyclic nucleotides (cAMP and cGMP), glutamate conjugates like NAAG, and possibly haem. Knockout models in mice, zebrafish, and sea urchins reveal ABCC5’s role in gut formation, brain function, eye development, and iron metabolism. In mice, its deletion results in lower adipose tissue mass, enhanced insulin sensitivity, and neurobehavioral changes resembling schizophrenia, highlighting its role in glutamatergic signalling and circadian regulation. Functionally, ABCC5 appears to impact adipocyte differentiation and GLP-1 release, implicating it in type 2 diabetes susceptibility in humans. Structural studies using human ABCC5 revealed a novel autoinhibitory mechanism involving a peptide segment (C46–S64) that blocks substrate binding, offering new potential for selective inhibitor development. However, this review emphasises caution in targeting ABCC5 for cancer therapy due to its underappreciated physiological function(s), particularly in the brain and male reproductive system. Understanding ABCC5’s substrate specificity, regulatory mechanisms, and functional redundancy with its paralog ABCC12 remains critical for successful therapeutic strategies in humans. ABCC5 cMOAT MRP5 ABC-transporters NAAG Abcc5 −/− cAMP cGMP haem Biotechnology and Biological Sciences Research Council (BBSRC) BB/P020666/1 Wellcome Trust 218482/Z/19/Z H.d.W. was supported by the Biotechnology and Biological Sciences Research Council (BBSRC) (BB/P020666/1) and C.M. by the Wellcome Trust (218482/Z/19/Z). pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement no pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes 1. Introduction ABC transporters are a family of integral membrane ATPases that transport a large number of structurally unrelated compounds in and out of cells. Broadly, there are seven subfamilies of ABC transporters (ABCA–ABCG) found in all taxa of life, but the function and substrates of many ABC transporters remain elusive [ 1 2 3 ATP − 4 5 2 2 6 Although great progress has been made in elucidating the roles of many ABC transporters, several orphan transporters of unknown function remain, including ABCC5, also known as MRP5 or cMOAT. Human ABCC5 7 ABCC5 7 ABCC5 8 In humans, altered ABCC5 9 10 11 12 ABCC5 13 14 15 16 7 In this review, we will aim to summarise the current knowledge of ABCC5 and its physiological role in mammalian energy homeostasis and brain health, with a specific focus on knockout models used to identify endogenous ligands and investigate the physiological function of Abcc5 in both vertebrates and invertebrates, as summarised in Figure 1 ABCC5 Abcc5 2. Endogenous Ligands ABCC5 17 Table 1 2.1. Cyclic Nucleotides Abcc5 has long been established as an exporter of cyclic nucleotides [ 18 19 20 11 Abcc5 Abcc5 Furthermore, Abcc5’s function in regulating development is well documented in vertebrates, with developing zebrafish embryos exhibiting significant time-dependent Abcc5 expression in brain, eye, liver, and intestinal tissues [ 21 22 23 ijms-26-09211-t001_Table 1 Table 1 Putative physiological substrates of ABCC5. Substrate Type Substrate Identified 2D Structure References Cyclic nucleotides cAMP and cGMP 3 cGMP [ 18 19 Nucleotide analogues 6-mercaptopurine, 6-thioguanine, and PMEA PMEA [ 24 Glutamate conjugates/analogues NAAG, NAAG 2 2 NAAG [ 25 Metabolite N-lactoyl amino acids N-lactoyl-phenylalanine [ 26 Iron homeostasis Haem  [ 27 Folates Folic acid 3  [ 19 Antifolates Methotrexate and methotrexate polyglutamine metabolites 3 Methotrexate [ 19 ABCC5 expression in human amniotic epithelia [ 28 29 30 31 Abcc5 20 2.2. Glutamate Conjugates Jansen et al. (2015) identified several endogenous glutamate conjugates/analogues using untargeted metabolomics in murine Abcc5 25 Abcc5 KO In support of a possible neurological function in the brain, the de Wet laboratory demonstrated that mice genetically deficient for Abcc5 32 33 Abcc5 −/− Abcc5 −/− 34 35 36 37 38 39 40 41 Abcc5 −/− Abcc5 −/− 33 2 42 Where and when NAAG accumulates in the brain, and the molecular mechanism by which glutamate di-peptide availability is regulated by Abcc5 activity, remains unknown. If and how Abcc5-dependent regulation of NAAG/glutamate dipeptide availability is linked to its effect on glutaminergic signalling and neurobiological phenotypes remains to be elucidated. However, it is clear that Abcc5 activity does affect glutaminergic signalling in mice and has clear neurological implications. As such, development of Abcc5 inhibitors should be approached with caution, as Abcc5 inhibitors could potentially have neurological side effects in mammals. 2.3. Haem Haem has also been shown to be a possible endogenous ligand of Abcc5 in lower organisms [ 27 Caenorhabditis elegans C. elegans C. elegans C. elegans Abcc5 C. elegans Abcc5 21 27 27 25 3+ 2+ 43 44 Abcc5 3. ABC Paralogs Whilst the above experiments support a conserved role for Abcc5 in intracellular haem trafficking in higher-order vertebrates, this finding is not recapitulated in model mouse lines. Abcc5 KO 25 32 Abcc5 Abcc12 45 Abcc5 12 DKO Abcc5 12 DKO Furthermore, the presence of an additional Abcc5 paralog, ABCC11, in humans but not mice, limits the insight we have into the potential consequence of human ABCC5 loss of function from mouse studies alone. 4. Metabolism and Adipocyte Differentiation Abcc5 has also been shown to be involved in regulating metabolism and adipocyte differentiation, but, to date, the specific substrate and mechanism(s) remain elusive. Over-expression of a human ABCC5 variant in subcutaneous fat was shown to correlate with T2DM (three-fold risk increase) and related phenotypes (beta cell function, peripheral insulin sensitivity, fasting IGR, and visceral fat) in European and African populations [ 9 Abcc5 KO 32 Abcc5 KO Abcc5 KO 46 47 48 Further supporting a role of Abcc5 in adipocytes, a study using differentiated 3T3-L1 cells as an adipocyte model demonstrated that Abcc5 seems to function as a regulator of fat cell differentiation [ 11 Abcc4 Abcc5 Abcc4 Abcc5 Abcc5 −/− Abcc5 −/− Abcc4 −/− 49 Abcc5 −/− Abcc4 −/− 5. ABCC5 Structure Prior to 2024, all mechanistic work on Abcc5 was undertaken in the absence of a high-resolution structure of the protein, and the interpretation of results was, therefore, somewhat limited. However, a recent ABCC5 structure was determined at a high resolution in both its inward-facing and ATP-bound outward-open conformations to 2.9 Å and 3.5 Å, respectively, enabling side-chain assignment. Interestingly, the structural determination of the inwards-facing state revealed the presence of a peptide bound in the central substrate-binding cavity ( Figure 2 The helix is also potentially stabilised through interaction of E51 and R55. Interestingly, there is conservation of the residues involved in these interactions across ABCC5 homologs ( Figure 2 45 The authors further demonstrated that a designed peptide, M5PI, was capable of mimicking the binding of C46-S64, as demonstrated through further structural characterisation ( Figure 2 Xenopus laevis 45 Table 2 Table 2 Despite these molecular insights into ABCC5 transport gained through this study, direct structural observation of binding by a physiological ligand or the direct measurement of ligand transport by the transporter, such as purified protein in proteoliposomes, has yet to be demonstrated. Given the large size of the C46-S64 peptide in comparison with the proposed physiological substrates of ABCC5, observation of the binding of ligands would help identify key residues involved in binding to these, and comparison with the interactions of the C46-S64 peptide. These observations could aid in understanding the mechanism of C64-S64 binding and release, as well as explaining the promiscuity of transport by ABCC5. Interestingly, all the proposed substrates of ABCC5 contain two carbonyl groups in proximity to each other, perhaps suggesting these groups are involved in the specificity of substrate recognition by the transporter. Further structural insights into substrate binding by the transporter would be required to investigate this. Additionally, it would be interesting to observe the activity of purified ABCC5 reconstituted into proteoliposomes with different proposed radiolabelled ligands, to understand the ligand specificity of the system, and to investigate the suggested inhibition of ABCC5 by C46-S64. Comparison of the sequence of homologs of human ABCC5 reveals that mouse and zebrafish homologs show 95% and 73.6% identity to human ABCC5 and show good sequence conservation in features of the protein key to substrate transport ( Figure 2 C. elegans 50 Figure 2 C. elegans 6. Conclusions Abcc5 is a highly conserved and ubiquitously expressed protein, with diverse exogenous and endogenous substrates. While it has a well-established role in conferring cancer chemotherapy resistance, it also has wide-ranging physiological functions in development, iron homeostasis, male reproductive function, adipose biology, and neurobiology, which remain poorly understood, and a mechanistic understanding of the physiological role of Abcc5 is still lacking ( Figure 1 Disclaimer/Publisher’s Note: Conflicts of Interest The authors declare no conflicts of interest. Abbreviations The following abbreviations were used in this manuscript: NAAG N-acetyl-aspartyl-glutamate ABCC5 Human ABCC5 protein ABCC5 Human ABCC5 Abcc5 Abcc5 protein in non-human model systems Abcc5 Abcc5 References 1. Thomas C. Aller S.G. Beis K. Carpenter E.P. Chang G. Chen L. Dassa E. Dean M. Ekiert D. Ford R. Structural and functional diversity calls for a new classification of ABC transporters FEBS Lett. 2020 594 3767 3775 10.1002/1873-3468.13935 32978974 PMC8386196 2. Cole S.P. Patterns of cross-resistance in a multidrug-resistant small-cell lung carcinoma cell line Cancer Chemother. Pharmacol. 1990 26 250 256 10.1007/BF02897225 1973363 3. Baltira C. Aronica E. Elmquist W.F. Langer O. Loscher W. Sarkaria J.N. Wesseling P. de Gooijer M.C. van Tellingen O. The impact of ATP-binding cassette transporters in the diseased brain: Context matters Cell Rep. Med. 2024 5 101609 10.1016/j.xcrm.2024.101609 38897176 PMC11228798 4. Patton B.L. Zhu P. ElSheikh A. Driggers C.M. Shyng S.L. Dynamic duo: Kir6 and SUR in K(ATP) channel structure and function Channels 2024 18 2327708 10.1080/19336950.2024.2327708 38489043 PMC10950283 5. Bose S.J. Krainer G. Ng D.R.S. Schenkel M. Shishido H. Yoon J.S. Haggie P.M. Schlierf M. Sheppard D.N. Skach W.R. Towards next generation therapies for cystic fibrosis: Folding, function and pharmacology of CFTR J. Cyst. Fibros. 2020 19 (Suppl. S1) S25 S32 10.1016/j.jcf.2019.12.009 31902693 PMC7052731 6. Jin D. Ni T.T. Sun J. Wan H. Amack J.D. Yu G. Fleming J. Chiang C. Li W. Papierniak A. Prostaglandin signalling regulates ciliogenesis by modulating intraflagellar transport Nat. Cell Biol. 2014 16 841 851 10.1038/ncb3029 25173977 PMC4154319 7. Pan Y. Wu M. Cai H. Role of ABCC5 in cancer drug resistance and its potential as a therapeutic target Front. Cell Dev. Biol. 2024 12 1446418 10.3389/fcell.2024.1446418 39563862 PMC11573773 8. Chen H. Luo J. Chen S. Shi B. Zheng X. Ji H. Zhang X. Yin Y. Du K. Ding J. Non-drug efflux function of ABCC5 promotes enzalutamide resistance in castration-resistant prostate cancer via upregulation of P65/AR-V7 Cell Death Discov. 2022 8 241 10.1038/s41420-022-00951-4 35504877 PMC9065095 9. Direk K. Lau W. Small K.S. Maniatis N. Andrew T. ABCC5 transporter is a novel type 2 diabetes susceptibility gene in European and African American populations Ann. Hum. Genet. 2014 78 333 344 10.1111/ahg.12072 25117150 PMC4173130 10. Mirzaeicheshmeh E. Zerrweck C. Centeno-Cruz F. Baca-Peynado P. Martinez-Hernandez A. García-Ortiz H. Contreras-Cubas C. Salas-Martínez M.G. Saldaña-Alvarez Y. Mendoza-Caamal E.C. Alterations of DNA methylation during adipogenesis differentiation of mesenchymal stem cells isolated from adipose tissue of patients with obesity is associated with type 2 diabetes Adipocyte 2021 10 493 504 10.1080/21623945.2021.1978157 34699309 PMC8555535 11. Laddha A.P. Wahane A. Bahal R. Manautou J.E. Investigating the crosstalk between ABCC4 and ABCC5 in 3T3-L1 adipocyte differentiation Front. Mol. Biosci. 2024 11 1498946 10.3389/fmolb.2024.1498946 39717760 PMC11663720 12. Yu D. Li J. Wei Q. Zhu C. Zhang X. Li X. Guo D. Trichosanthis Pericarpium injection ameliorates non-alcoholic fatty liver disease via inhibiting the KLF6/ABCC5 pathway in mice Phytomedicine 2025 145 156998 10.1016/j.phymed.2025.156998 40570552 13. Chen M.B. Jiang X. Quake S.R. Sudhof T.C. Persistent transcriptional programmes are associated with remote memory Nature 2020 587 437 442 Correction in Nature 2025 644 10.1038/s41586-020-2905-5 33177708 PMC9097329 14. de Jong T.V. Kim P. Guryev V. Mulligan M.K. Williams R.W. Redei E.E. Chen H. Whole genome sequencing of nearly isogenic WMI and WLI inbred rats identifies genes potentially involved in depression and stress reactivity Sci. Rep. 2021 11 14774 10.1038/s41598-021-92993-4 34285244 PMC8292482 15. Mohammadnejad A. Nygaard M. Li S. Zhang D. Xu C. Li W. Lund J. Christiansen L. Baumbach J. Christensen K. Generalized correlation coefficient for genome-wide association analysis of cognitive ability in twins Aging 2020 12 22457 22494 10.18632/aging.104198 33232274 PMC7746382 16. Nies A.T. Jedlitschky G. Konig J. Herold-Mende C. Steiner H.H. Schmitt H.P. Keppler D. Expression and immunolocalization of the multidrug resistance proteins, MRP1-MRP6 (ABCC1-ABCC6), in human brain Neuroscience 2004 129 349 360 10.1016/j.neuroscience.2004.07.051 15501592 17. Kool M. De Haas M. Scheffer G.L. Scheper R.J. Van Eijk M.J. Juijn A.J. Baas F. Borst P. Analysis of expression of cMOAT (MRP2), MRP3, MRP4, and MRP5, homologues of the multidrug resistance-associated protein gene (MRP1), in human cancer cell lines Cancer Res. 1997 57 3537 3547 9270026 18. Jedlitschky G. Burchell B. Keppler D. The multidrug resistance protein 5 functions as an ATP-dependent export pump for cyclic nucleotides J. Biol. Chem. 2000 275 30069 30074 10.1074/jbc.M005463200 10893247 19. Wielinga P. Hooijberg J.H. Gunnarsdottir S. Kathmann I. Reid G. Zelcer N. van der Born K. de Haas M. van der Heijden I. Kaspers G. The human multidrug resistance protein MRP5 transports folates and can mediate cellular resistance against antifolates Cancer Res. 2005 65 4425 4430 10.1158/0008-5472.CAN-04-2810 15899835 20. Shipp L.E. Hill R.Z. Moy G.W. Gokirmak T. Hamdoun A. ABCC5 is required for cAMP-mediated hindgut invagination in sea urchin embryos Development 2015 142 3537 3548 10.1242/dev.126144 26395488 PMC4631766 21. Long Y. Li Q. Li J. Cui Z. Molecular analysis, developmental function and heavy metal-induced expression of ABCC5 in zebrafish Comp. Biochem. Physiol. B Biochem. Mol. Biol. 2011 158 46 55 10.1016/j.cbpb.2010.09.005 20869459 22. Long Y. Li Q. Zhong S. Wang Y. Cui Z. Molecular characterization and functions of zebrafish ABCC2 in cellular efflux of heavy metals Comp. Biochem. Physiol. C Toxicol. Pharmacol. 2011 153 381 391 10.1016/j.cbpc.2011.01.002 21266201 23. Gu M. Lynch J. Brecher P. Nitric oxide increases p21(Waf1/Cip1) expression by a cGMP-dependent pathway that includes activation of extracellular signal-regulated kinase and p70(S6k) J. Biol. Chem. 2000 275 11389 11396 10.1074/jbc.275.15.11389 10753954 24. Wijnholds J. Mol C.A.A.M. van Deemter L. de Haas M. Scheffer G.L. Baas F. Beijnen J.H. Scheper R.J. Hatse S. De Clercq E. Multidrug-resistance protein 5 is a multispecific organic anion transporter able to transport nucleotide analogs Proc. Natl. Acad. Sci. USA 2000 97 7476 7481 10.1073/pnas.120159197 10840050 PMC16570 25. Jansen R.S. Mahakena S. de Haas M. Borst P. van de Wetering K. ATP-binding Cassette Subfamily C Member 5 (ABCC5) Functions as an Efflux Transporter of Glutamate Conjugates and Analogs J. Biol. Chem. 2015 290 30429 30440 10.1074/jbc.M115.692103 26515061 PMC4683265 26. Jansen R.S. Addie R. Merkx R. Fish A. Mahakena S. Bleijerveld O.B. Altelaar M. Ijlst L. Wanders R.J. Borst P. N-lactoyl-amino acids are ubiquitous metabolites that originate from CNDP2-mediated reverse proteolysis of lactate and amino acids Proc. Natl. Acad. Sci. USA. 2015 112 6601 6606 10.1073/pnas.1424638112 25964343 PMC4450436 27. Korolnek T. Zhang J. Beardsley S. Scheffer G.L. Hamza I. Control of metazoan heme homeostasis by a conserved multidrug resistance protein Cell Metab. 2014 19 1008 1019 10.1016/j.cmet.2014.03.030 24836561 PMC4052561 28. Aye I.L. Paxton J.W. Evseenko D.A. Keelan J.A. Expression, localisation and activity of ATP binding cassette (ABC) family of drug transporters in human amnion membranes Placenta 2007 28 868 877 10.1016/j.placenta.2007.03.001 17482262 29. Manceau S. Giraud C. Decleves X. Scherrmann J.M. Artiguebieille F. Goffinet F. Chappuy H. Vinot C. Tréluyer J. ABC drug transporter and nuclear receptor expression in human cytotrophoblasts: Influence of spontaneous syncytialization and induction by glucocorticoids Placenta 2012 33 927 932 10.1016/j.placenta.2012.07.016 22922069 30. Zu Schwabedissen H.E.M. Grube M. Heydrich B. Linnemann K. Fusch C. Kroemer H.K. Jedlitschky G. Expression, localization, and function of MRP5 (ABCC5), a transporter for cyclic nucleotides, in human placenta and cultured human trophoblasts: Effects of gestational age and cellular differentiation Am. J. Pathol. 2005 166 39 48 10.1016/S0002-9440(10)62230-4 15631998 PMC1602292 31. Nongpiur M.E. Khor C.C. Jia H. Cornes B.K. Chen L.J. Qiao C. Nair K.S. Cheng C.-Y. Xu L. George R. ABCC5, a gene that influences the anterior chamber depth, is associated with primary angle closure glaucoma PLoS Genet. 2014 10 e1004089 Erratum in PLoS Genet. 2014 10 10.1371/journal.pgen.1004089 24603532 PMC3945113 32. Cyranka M. Veprik A. McKay E.J. van Loon N. Thijsse A. Cotter L. Hare N. Saibudeen A. Lingam S. Pires E. Abcc5 Knockout Mice Have Lower Fat Mass and Increased Levels of Circulating GLP-1 Obesity 2019 27 1292 1304 10.1002/oby.22521 31338999 PMC6658130 33. Banks G. Cyranka M. Vedovato N. Meller C. Rawnsley A. Mann E.O. Stewart M. de Wet H. The murine ATP-binding cassette transporter C5 (Abcc5/MRP5/cMOAT) plays a role in memory consolidation, circadian rhythm regulation and glutamatergic signalling Transl. Psychiatry 2025 15 218 10.1038/s41398-025-03438-9 40593462 PMC12214961 34. Neale J.H. Yamamoto T. N-acetylaspartylglutamate (NAAG) and glutamate carboxypeptidase II: An abundant peptide neurotransmitter-enzyme system with multiple clinical applications Prog. Neurobiol. 2020 184 101722 10.1016/j.pneurobio.2019.101722 31730793 35. Puttfarcken P.S. Handen J.S. Montgomery D.T. Coyle J.T. Werling L.L. N-acetyl-aspartylglutamate modulation of N-methyl-D-aspartate-stimulated [3H]norepinephrine release from rat hippocampal slices J. Pharmacol. Exp. Ther. 1993 266 796 803 10.1016/S0022-3565(25)38400-4 8355209 36. Sekiguchi M. Okamoto K. Sakai Y. Low-concentration N-acetylaspartylglutamate suppresses the climbing fiber response of Purkinje cells in guinea pig cerebellar slices and the responses to excitatory amino acids of Xenopus laevis oocytes injected with cerebellar mRNA Brain Res. 1989 482 87 96 10.1016/0006-8993(89)90545-3 2706484 37. Westbrook G.L. Mayer M.L. Namboodiri M.A. Neale J.H. High concentrations of N-acetylaspartylglutamate (NAAG) selectively activate NMDA receptors on mouse spinal cord neurons in cell culture J. Neurosci. 1986 6 3385 3392 10.1523/JNEUROSCI.06-11-03385.1986 3021930 PMC6568498 38. Bergeron R. Coyle J.T. NAAG, NMDA receptor and psychosis Curr. Med. Chem. 2012 19 1360 1364 10.2174/092986712799462685 22304714 PMC3424071 39. Lewis D.A. Sweet R.A. Schizophrenia from a neural circuitry perspective: Advancing toward rational pharmacological therapies J. Clin. Investig. 2009 119 706 716 10.1172/JCI37335 19339762 PMC2662560 40. Nakazawa K. Jeevakumar V. Nakao K. Spatial and temporal boundaries of NMDA receptor hypofunction leading to schizophrenia NPJ Schizophr. 2017 3 7 10.1038/s41537-016-0003-3 28560253 PMC5441533 41. Nakazawa K. Sapkota K. The origin of NMDA receptor hypofunction in schizophrenia Pharmacol. Ther. 2020 205 107426 10.1016/j.pharmthera.2019.107426 31629007 PMC6981256 42. Trubetskoy V. Pardinas A.F. Qi T. Panagiotaropoulou G. Awasthi S. Bigdeli T.B. Bryois J. Chen C.-Y. Dennison C.A. Hall L.S. Mapping genomic loci implicates genes and synaptic biology in schizophrenia Nature 2022 604 502 508 10.1038/s41586-022-04434-5 35396580 PMC9392466 43. Hamada-Kanazawa M. Kouda M. Odani A. Matsuyama K. Kanazawa K. Hasegawa T. Narahara M. Miyake M. Beta-Citryl-L-glutamate is an endogenous iron chelator that occurs naturally in the developing brain Biol. Pharm. Bull. 2010 33 729 737 10.1248/bpb.33.729 20460747 44. Hamada-Kanazawa M. Narahara M. Takano M. Min K.S. Tanaka K. Miyake M. Beta-Citryl-L-glutamate acts as an iron carrier to activate aconitase activity Biol. Pharm. Bull. 2011 34 1455 1464 10.1248/bpb.34.1455 21881233 45. Chambers I.G. Kumar P. Lichtenberg J. Wang P. Yu J. Phillips J.D. Kane M.A. Bodine D. Hamza I. MRP5 and MRP9 play a concerted role in male reproduction and mitochondrial function Proc. Natl. Acad. Sci. USA 2022 119 e2111617119 10.1073/pnas.2111617119 35121660 PMC8832985 46. Duca F.A. Waise T.M.Z. Peppler W.T. Lam T.K.T. The metabolic impact of small intestinal nutrient sensing Nat. Commun. 2021 12 903 10.1038/s41467-021-21235-y 33568676 PMC7876101 47. Cyranka M. Monfeuga T. Vedovato N. Larabee C.M. Chandran A. Toledo E.M. de Wet H. NMDA Receptor Antagonists Increase the Release of GLP-1 From Gut Endocrine Cells Front. Pharmacol. 2022 13 861311 10.3389/fphar.2022.861311 35571112 PMC9091448 48. Garbutt P. Cyranka M. Michl J. Maejima Y. Vedovato N. Shimomura K. Swietach P. de Wet H. The release of GLP-1 from gut L cells is inhibited by low extracellular pH Obesity 2024 32 1819 1824 10.1002/oby.24125 39238194 PMC11492159 49. Donepudi A.C. Lee Y. Lee J.Y. Schuetz J.D. Manautou J.E. Multidrug resistance-associated protein 4 (Mrp4) is a novel genetic factor in the pathogenesis of obesity and diabetes FASEB J. 2021 35 e21304 10.1096/fj.202001299RR 33417247 PMC8628361 50. Huang Y. Xue C. Bu R. Wu C. Li J. Zhang J. Chen J. Shi Z. Chen Y. Wang Y. Inhibition and transport mechanisms of the ABC transporter hMRP5 Nat. Commun. 2024 15 4811 10.1038/s41467-024-49204-1 38844452 PMC11156954 51. Goddard T.D. Huang C.C. Meng E.C. Pettersen E.F. Couch G.S. Morris J.H. Ferrin T.E. UCSF ChimeraX: Meeting modern challenges in visualization and analysis Protein Sci. 2018 27 14 25 10.1002/pro.3235 28710774 PMC5734306 52. Maglic J.B. Lavendomme R. MoloVol: An easy-to-use program for analyzing cavities, volumes and surface areas of chemical structures J. Appl. Crystallogr. 2022 55 Pt 4 1033 1044 10.1107/S1600576722004988 35974729 PMC9348874 53. Muraki N. Aono S. Structural Basis for Heme Recognition by HmuT Responsible for Heme Transport to the Heme Transporter in Corynebacterium glutamicum Chem. Lett. 2015 45 24 26 10.1246/cl.150894 54. Than M.E. Hof P. Huber R. Bourenkov G.P. Bartunik H.D. Buse G. Soulimane T. Thermus thermophilus cytochrome-c552: A new highly thermostable cytochrome-c structure obtained by MAD phasing J. Mol. Biol. 1997 271 629 644 10.1006/jmbi.1997.1181 9281430 55. Schmiege P. Donnelly L. Elghobashi-Meinhardt N. Lee C.H. Li X. Structure and inhibition of the human lysosomal transporter Sialin Nat. Commun. 2024 15 4386 10.1038/s41467-024-48535-3 38782953 PMC11116495 56. Klusak V. Barinka C. Plechanovova A. Mlcochova P. Konvalinka J. Rulisek L. Lubkowski J. Reaction mechanism of glutamate carboxypeptidase II revealed by mutagenesis, X-ray crystallography, and computational methods Biochemistry 2009 48 4126 4138 10.1021/bi900220s 19301871 PMC7289149 57. Chen C. Ke J. Zhou X.E. Yi W. Brunzelle J.S. Li J. Yong E.-L. Xu H.E. Melcher K. Structural basis for molecular recognition of folic acid by folate receptors Nature 2013 500 486 489 10.1038/nature12327 23851396 PMC5797940 58. Reyes V.M. Sawaya M.R. Brown K.A. Kraut J. Isomorphous crystal structures of Escherichia coli dihydrofolate reductase complexed with folate, 5-deazafolate, and 5,10-dideazatetrahydrofolate: Mechanistic implications Biochemistry 1995 34 2710 2723 10.1021/bi00008a039 7873554 59. Peng Y. Feng Q. Wilk D. Adjei A.A. Salavaggione O.E. Weinshilboum R.M. Yee V.C. Structural basis of substrate recognition in thiopurine s-methyltransferase Biochemistry 2008 47 6216 6225 10.1021/bi800102x 18484748 PMC2447621 60. Cao H. Pauff J.M. Hille R. Substrate orientation and catalytic specificity in the action of xanthine oxidase: The sequential hydroxylation of hypoxanthine to uric acid J. Biol. Chem. 2010 285 28044 28053 10.1074/jbc.M110.128561 20615869 PMC2934669 61. Chu S.Y. Tordova M. Gilliland G.L. Gorshkova I. Shi Y. Wang S. Schwarz F.P. The structure of the T127L/S128A mutant of cAMP receptor protein facilitates promoter site binding J. Biol. Chem. 2001 276 11230 11236 10.1074/jbc.M010428200 11124966 62. Kurinov I.V. Rajamohan F. Uckun F.M. High resolution X-ray structure and potent anti-HIV activity of recombinant dianthin antiviral protein Arzneimittelforschung 2004 54 692 702 10.1055/s-0031-1297024 15553110 63. Welch W. Sage C.R. Stout T.J. Klein T. Ruppert J. Stroud R.M. Jain A. Discovery of Thymidylate Synthase Inhibitors Using Flexible Docking and an Empirically Tuned Scoring Function RCSB Protein Data Bank Piscataway, NJ, USA 1997 10.2210/pdb1AXW/pdb 64. Li R. Sirawaraporn R. Chitnumsub P. Sirawaraporn W. Wooden J. Athappilly F. Turley S. Hol W.G. Three-dimensional structure of M. tuberculosis dihydrofolate reductase reveals opportunities for the design of novel tuberculosis drugs J. Mol. Biol. 2000 295 307 323 10.1006/jmbi.1999.3328 10623528 Figure 1 Physiological substrates and functions of Abcc5. ( A C. elegans B C D E Figure 2 ( A 50 B i ii iii C 51 ijms-26-09211-t002_Table 2 Table 2 Approximate volumes of putative physiological substrates of ABCC5. The volumes were calculated using MoloVol 1.2.0 [ 52 Ligand Volume (Å 3 PDB C46-S64 1559 8WI0 [ 50 Haem 661/512 5AZ3 [ 53 54 NAAG 232/230 8U3G [ 55 56 Folic acid 349/339 4LRH [ 57 58 6-mercaptopurine 118/120 3BGD [ 59 60 cAMP 230/235 1HW5 [ 61 62 Methotrexate 368/364 1AXW [ 63 64 ",
  "metadata": {
    "Title of this paper": "Three-dimensional structure of M. tuberculosis dihydrofolate reductase reveals opportunities for the design of novel tuberculosis drugs",
    "Journal it was published in:": "International Journal of Molecular Sciences",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12470876/"
  }
}