{
  "title": "Paper_85",
  "abstract": "pmc Front Endocrinol (Lausanne) Front Endocrinol (Lausanne) 1753 frontendo Front. Endocrinol. Frontiers in Endocrinology 1664-2392 Frontiers Media SA PMC12491005 PMC12491005.1 12491005 12491005 10.3389/fendo.2025.1635820 1 Endocrinology Original Research Elevated mitochondrial DNA copy number in euthyroid individuals with impaired peripheral sensitivity to thyroid hormones Qin Li  † Huang Tingting  † Zhang Danmei Li Guochao Wei Liqin Liu Juan  *  †  Division of Geriatric Endocrinology, The First Affiliated Hospital with Nanjing Medical University Nanjing China Edited by: Luna Samanta Reviewed by: Dipak Kumar Sahoo  Mostafa Vaghari-Tabari *Correspondence: Juan Liu, lioujane@njmu.edu.cn †ORCID: Li Qin, orcid.org/0009-0002-9892-1002 orcid.org/0009-0006-8649-8277 orcid.org/0000-0003-3568-0889 19 9 2025 2025 16 480647 1635820 27 5 2025 02 9 2025 19 09 2025 04 10 2025 04 10 2025 Copyright © 2025 Qin, Huang, Zhang, Li, Wei and Liu. 2025 Qin, Huang, Zhang, Li, Wei and Liu https://creativecommons.org/licenses/by/4.0/ This is an open-access article distributed under the terms of the Creative Commons Attribution License (CC BY). The use, distribution or reproduction in other forums is permitted, provided the original author(s) and the copyright owner(s) are credited and that the original publication in this journal is cited, in accordance with accepted academic practice. No use, distribution or reproduction is permitted which does not comply with these terms. Background The role of thyroid hormone sensitivity in metabolic and neoplastic diseases is well recognized, however, its association with mitochondrial DNA copy number (mtDNAcn) in euthyroid individuals remains unclear. Objective This cross-sectional study aimed to explore the relationship between thyroid hormone sensitivity and mtDNAcn in euthyroid individuals. Methods We recruited 350 hospitalized individuals with normal thyroid function between December 2020 and August 2022. Peripheral blood samples and clinical parameters were collected. Relative mtDNAcn levels were quantified by qPCR from peripheral blood samples. Peripheral thyroid hormone sensitivity was evaluated through the free triiodothyronine to free thyroxine (FT3/FT4) ratio, and central sensitivity was assessed using the thyrotrophic thyroxine resistance index (TT4RI), thyroid-stimulating hormone index (TSHI), and thyroid feedback quantile-based index (TFQI). Results Significant differences in age and sex were observed between groups with lower and higher mtDNAcn. Multivariate linear regression analysis showed a negative correlation between mtDNAcn and the FT3/FT4 ratio after adjusting for confounders such as age, sex, BMI, alcohol consumption, smoking history, hypertension, diabetes, and hyperlipidemia. This negative correlation remained significant in subgroups of younger adults, females, normal-weight individuals, drinkers, non-smokers, and those with hypertension. No significant relationships were found between mtDNAcn and TSHI, TT4RI, or TFQI after adjusting for confounding factors. Conclusion Reduced peripheral thyroid hormone sensitivity is linked to elevated mtDNAcn in euthyroid individuals, with variations based on age, sex, BMI, smoking, and hypertension. euthyroid individuals FT3/FT4 ratio mitochondrial DNA copy number (mtDNAcn) thyroid hormone sensitivity thyroid feedback quantile-based index (TFQI) thyroid-stimulating hormone index (TSHI) thyrotrophic thyroxine resistance index (TT4RI) The author(s) declare financial support was received for the research and/or publication of this article. This research was supported by the National Natural Science Foundation of China (Grant Nos. 81871106 and 82071584) and Special Fund of Jiangsu Province Hospital for Talents Development (No. YNRCZN014). pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement no pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes section-in-acceptance Thyroid Endocrinology 1 Introduction Thyroid hormones, particularly tetraiodothyronine (T4) and triiodothyronine (T3), are pivotal in regulating metabolic homeostasis in the body ( 1 2 6 7 10 11 13 14 16 5 8 17 Mitochondria, semi-autonomous organelle in most eukaryotic cells, play essential roles in cellular functions such as metabolism, energy production, growth, apoptosis, and signaling ( 18 19 20 21 22 24 25 26 27 30 31 32 Recent research has suggested that alterations in thyroid hormone sensitivity may influence disease progression by affecting mitochondrial dynamics ( 33 35 36 37 38 Several studies indicates that thyroid hormones directly regulate mitochondrial biogenesis and function through both genomic and non-genomic pathways. Chainy GBN et al. proposed that T3 binds to nuclear thyroid receptors (TRα/β), activating PGC-1α signaling, which in turn stimulates TFAM-mediated mtDNA replication and respiratory chain complex synthesis ( 39 40 2 Methods 2.1 Participants The study was conducted at Jiangsu Province Hospital from October 2020 to August 2022 (  Figure 1 Figure 1 Flow chart of participants selection. mtDNAcn, mitochondrial DNA copy number. Flowchart showing the selection process for a final population from a total population of 576. Exclusions were made for 97 individuals based on criteria like long-term bed rest and severe medical conditions. After excluding 52 outliers and applying specific thyroid hormone reference ranges, the population was reduced from 480 to 414. Finally, those without mtDNAcn were excluded, resulting in a final population of 350. 2.2 Data collection Clinical coordinators used pre-designed questionnaires to gather demographic and clinical data, including age, sex, drinking and smoking history, and a history of diabetes, hyperlipidemia, and hypertension. Trained nurses measured participants’ height and weight in a quiet setting. BMI was calculated using the formula: BMI=weight (kg)/height 2 2 41 2.3 Indices of thyroid hormone sensitivity Several indices were employed to assess thyroid hormone sensitivity, including the FT3/FT4 ratio, TT4RI, TSHI, and TFQI. The following formulas were used to calculate the indices: FT 3 / FT 4 ratio = FT 3  ( pmol / L ) / FT 4  ( pmol / L ) TSHI = Ln TSH ( mIU / L ) + 0.1345 × FT 4  ( pmol ) ( 11 TT 4 RI = FT 4  ( pmol / L ) × TSH ( mIU / L ) ( 12 TFQI = cdfFT 4 - ( 1 - cdfTSH ) ( 13 The FT3/FT4 ratio reflects peripheral thyroid sensitivity, with higher ratios indicating enhanced peripheral sensitivity. TSHI, TT4RI, and TFQI assess central thyroid sensitivity, linked to hypothalamic-pituitary feedback mechanisms. For TSHI and TT4RI, lower values suggest greater central sensitivity. TFQI ranges from -1 to +1, where negative values indicate heightened central sensitivity and positive values suggest reduced sensitivity. 2.4 Total DNA extraction from peripheral blood Blood samples were collected after a minimum of 10 hours of fasting using heparinized vacutainer tubes. A total of 200 μL of blood was used for genomic DNA extraction, employing the FastPure ® 2.5 Quantitative real-time polymerase chain reactions The mtDNAcn was quantified using qPCR with the SYBR Green method. Each reaction had a total volume of 10 μL, containing 2 μL genomic DNA and 5 μL ChamQ Universal SYBR qPCR Master Mix (Vazyme, China). The thermal cycling conditions were as follows: 1 cycle at 95°C for 30 seconds, followed by 40 cycles of 95°C for 10 seconds and 60°C for 30 seconds. The relative mtDNAcn was quantified by calculating the ratio of mitochondrial DNA (mt-ND1, mitochondrial-NADH dehydrogenase subunit 1) to nuclear DNA (β-actin). Data analysis followed the 2−ΔΔCT method. The primers used for amplification were listed below: Primer sequences used for qPCR. Gene Forward primer (5’-3’) Reverse primer (5’-3’) MT-ND-1 CACTCACATCACAGCGCTAA GGATTATGGATGCGGTTGCT β-actin ATTGGCAATGAGCGGTTCCGC CTCCTGCTTGCTGATCCACATC 2.6 Statistical analysis Data analysis was performed using SPSS (version 25.0) and R (version 4.2.1). The normality of the data was evaluated using skewness, kurtosis, the Shapiro – Wilk test, histograms, and Q-Q plots. Continuous variables were presented as mean ± standard deviation (SD), and categorical variables as percentages (%). Relative mtDNAcn levels were divided into two groups:< 0.96 and ≥ 0.96. Group comparisons were employed using appropriate statistical tests (e.g., t-test, Mann-Whitney U test, or chi-square test) based on the data distribution. Correlations between mtDNAcn and thyroid hormone sensitivity variables were analyzed within subgroups categorized by factors such as age, sex, BMI, alcohol consumption, smoking status, and the presence of diabetes, hypertension, or hyperlipidemia. Multivariate linear regression was conducted to explore the relationship between thyroid hormone sensitivity and mtDNAcn. Partial regression plots were used to examine the independent association between thyroid hormone sensitivity variables and mtDNAcn, with further subgroup analyses. Using G*Power software, the effect size (f²) was calculated from the adjusted R² of the final multiple linear regression model. With a significance level (α) of 0.05 and a model containing 9 variables (1 primary predictor and 8 adjusted covariates), the post-hoc P 3 Results 3.1 Baseline characteristic and grouping   Table 1 2 Table 1 Characteristics of study population. Characteristics Total Relative level of mtDNAcn  P < 0.96 ≥ 0.96 No. 350 175 175 Sex (%) 0.04 Male 73.40 78.30 68.60 Female 26.60 21.70 31.40 Smoking (%) 0.20 Yes 49.10 52.60 45.70 No 50.90 47.40 54.30 Drinking (%) 0.24 Yes 50.00 53.10 46.90 No 50.00 46.90 53.10 Diabetes (%) 0.10 Yes 40.30 36.00 44.60 No 59.70 64.00 55.40 Hypertension (%) 0.34 Yes 46.60 49.10 44.00 No 53.40 50.90 56.00 Hyperlipidemia (%) 0.88 Yes 14.60 14.90 14.30 No 85.40 85.10 85.70 Age (years) 62.15 ± 0.78 63.74 ± 1.15 60.57 ± 1.06 0.04 BMI (kg/m 2 24.83 ± 0.18 24.62 ± 0.26 25.05 ± 0.26 0.36 GLU (mmol/L) 5.55 ± 0.09 5.62 ± 0.15 5.48 ± 0.13 0.72 Glycohemoglobin (%) 6.35 ± 0.08 6.38 ± 0.12 6.31 ± 0.11 0.70 TC (mmol/L) 4.42 ± 0.06 4.35 ± 0.08 4.50 ± 0.08 0.20 TG (mmol/L) 1.76 ± 0.07 1.78 ± 0.12 1.74 ± 0.09 0.50 HDL (mmol/L) 1.11 ± 0.01 1.10 ± 0.02 1.13 ± 0.02 0.41 LDL (mmol/L) 2.63 ± 0.04 2.56 ± 0.05 2.70 ± 0.06 0.08 VIT-D (nmol/L) 60.47 ± 1.78 63.04 ± 2.80 58.01 ± 2.21 0.43 UA (μmol/L) 352.00 ± 5.58 355.89 ± 7.38 349.56 ± 8.38 0.58 TyG 8.74 ± 0.04 8.74 ± 0.06 8.74 ± 0.05 0.78 FT3 (pg/mL) 4.56 ± 0.03 4.57 ± 0.05 4.55 ± 0.04 0.89 FT4 (ng/dL) 16.53 ± 0.11 16.54 ± 0.16 16.52 ± 0.15 0.95 TSH (mIU/L) 2.04 ± 0.05 1.99 ± 0.07 2.09 ± 0.07 0.25 FT3/FT4 0.28 ± 0.01 0.28 ± 0.01 0.28 ± 0.01 0.73 TSHI 2.84 ± 0.03 2.81 ± 0.04 2.87 ± 0.04 0.27 TT4RI 33.54 ± 0.78 32.70 ± 1.10 34.38 ± 1.11 0.24 TFQI -0.09 ± 0.02 -0.10 ± 0.02 -0.08 ± 0.02 0.47 Relative level of mtDNAcn 1.05 ± 0.03 0.60 ± 0.02 1.50 ± 0.04 <0.0001 Categorical data were presented as percentages (%) and continuous variables were expressed as mean ± standard deviation (SD). Statistical differences between groups were assessed using Chi-square test, Student’s t-tests, or Mann–Whitney U tests, as appropriate. Statistical significance was defined at P 3.2 Association between mtDNAcn and thyroid hormone sensitivity Correlation analyses were performed within subgroups stratified by age, sex, BMI, smoking status, alcohol use, and comorbidity (  Table 2 Table 2 Associations between mtDNAcn and thyroid hormone sensitivity. Variables FT3/FT4 TSHI TT4RI TFQI  r  p  r  p  r  p  r  p Age younger adult -0.17  0.025 0.05 0.52 0.04 0.62 0.03 0.69 older adult -0.06 0.46 0.06 0.43 0.07 0.38 0.11 0.15 Sex males -0.05 0.46 0.05 0.44 0.04 0.54 0.07 0.25 females -0.11 0.32 0.11 0.29 0.09 0.37 0.14 0.22 BMI normal weight -0.08 0.35 -0.01 0.97 -0.02 0.85 0.02 0.82 overweight -0.13 0.11 0.04 0.64 0.05 0.55 0.19 0.16 obese -0.03 0.85 0.26 0.05 0.24 0.08 0.08 0.36 Smoking no -0.17  0.027 0.04 0.58 -0.0001 0.99 0.10 0.18 yes 0.05 0.56 0.08 0.30 0.11 0.15 0.07 0.47 Drinking no -0.03 0.70 0.08 0.28 0.10 0.20 0.07 0.35 yes -0.11 0.16 0.04 0.63 0.01 0.88 0.08 0.28 Diabetes no -0.13 0.06 -0.02 0.83 -0.03 0.69 0.02 0.80 yes -0.05 0.52 0.15 0.07 0.16 0.06 0.14 0.09 Hypertension no 0.01 0.89 0.04 0.63 0.05 0.48 0.03 0.70 yes -0.21  0.008 0.09 0.28 0.06 0.47 0.12 0.14 Hyperlipidemia no -0.06 0.33 0.02 0.77 0.02 0.69 0.05 0.44 yes -0.21 0.13 0.29  0.04 0.26 0.07 0.23 0.10 Data were analyzed within subgroups categorized by age, sex, BMI, smoking status, alcohol consumption, diabetes mellitus, hypertension, and hyperdyslipidemia. Older adults were defined as those aged ≥ 60 years, while younger adults were those aged< 60 years; normal weight indicates 18.5 kg/m 2 2 2 2 2 3.3 Multiple linear regression analysis To further explore the independent relationship between mtDNAcn and thyroid hormone sensitivity, a multiple linear regression analysis was conducted (  Table 3 P Table 3 Relationships between thyroid parameters and mtDNAcn. Variables Model 1 Model 2 B SE β t  P B SE β t  P FT3 -0.098 0.06 -0.106 -1.629 0.104 -0.103 0.061 -0.11 -1.671 0.096 FT4 0.025 0.016 0.084 1.537 0.125 0.023 0.016 0.077 1.403 0.161 TSH 0.036 0.036 0.054 0.999 0.319 0.035 0.036 0.053 0.972 0.332 FT3/FT4 -1.860 0.754 -0.145 -2.465  0.014 -1.857 0.761 -0.145 -2.439  0.015 TSHI 0.106 0.064 0.088 1.642 0.101 0.100 0.064 0.084 1.554 0.121 TT4RI 0.003 0.002 0.073 1.352 0.177 0.003 0.002 0.071 1.313 0.190 TFQI 0.199 0.101 0.106 1.965 0.050 0.184 0.102 0.098 1.809 0.071 Data were analyzed using linear regression models. Model 1: adjusted for age, sex, and BMI; Model 2: adjusted for age, sex, BMI, drinking, smoking, diabetes, hypertension, and hyperlipidemia. Statistical significance was defined at P < 3.4 Subgroup-specific regression findings Partial regression plots were used to visualize adjusted associations between mtDNAcn and the FT3/FT4 ratio across various subgroups (  Figure 2 Figure 2 Associations between mtDNAcn and FT3/FT4, stratified by age (A) (B) (C) (D) (E) (F) (G) (H) P 2 2 2 2 2 Scatter plots A to H show relationships between FT3/FT4 ratios and mtDNAcn across different groups. Each plot has color-coded dots and trend lines, indicating correlation and significance. Groups include age, gender, weight, drinking, smoking, diabetes, hypertension, and hyperlipidemia status. Each graph notes specific correlation coefficients and P-values for the analyzed subgroups. 4 Discussion This study revealed a significant negative correlation between relative mtDNAcn and the FT3/FT4 ratio in a euthyroid population, even after adjusting for potential confounders. Specifically, this inverse relationship remained significant across subgroups, including younger adults, females, individuals with normal BMI, drinkers, non-smokers, and hypertensive patients. However, no significant correlation was found between mtDNAcn and central thyroid hormone sensitivity indices such as TSHI, TT4RI, or TFQI. These findings suggested that relative mtDNAcn levels were negatively associated with peripheral thyroid hormones sensitivity. Subgroup analyses further supported consistent correlations across different demographic and health statuses, offering new insights into the relationship between mtDNAcn and thyroid hormone sensitivity in euthyroid individuals. The FT3/FT4 ratio is a well-established indicator of peripheral thyroid hormone sensitivity, reflecting the efficiency of peripheral tissues in converting T4 to T3 ( 1 15 42 43 45 46 47 48 49 50 Precise quantification of mtDNAcn in cellular and tissue samples is essential for evaluating alterations in mitochondrial function and biogenesis. Quantitative methods for assessing mtDNAcn include Southern and Slot Blot, competitive PCR (cPCR), quantitative real-time PCR (qPCR), fluorescence in situ 21 51 53 54 55 56 58 Our results suggested that decreased peripheral thyroid hormone sensitivity, as indicated by a lower FT3/FT4 ratio, was linked to higher mtDNAcn levels. This finding may reflect a negative feedback mechanism, where peripheral tissues reduce mitochondrial biosynthesis in response to excessive energy production. Previous studies have shown that thyroid hormones regulate mitochondrial biosynthesis and oxidative phosphorylation via nuclear receptors such as TRα and TRβ ( 39 46 36 59 59 60 Moreover, the negative correlation between the FT3/FT4 ratio and mtDNAcn was consistent across subgroups, including younger individuals, females, and those with normal BMI. This suggested that mitochondrial function in these groups was particularly sensitive to thyroid hormone regulation. In younger individuals, higher mitochondrial turnover rates may result in more pronounced regulation of peripheral hormone sensitivity ( 61 62 63 10 64 The clinical implications of our findings are noteworthy. The FT3/FT4 ratio, compared to FT3, FT4, or TSH, may serve as a more sensitive marker of thyroid hormone changes in euthyroid individuals. For example, previous research by wang et al. showed a positive association between FT3/FT4 ratio and grip strength, whereas TSH showed no such relationship ( 16 65 3 9 66 In contrast to the FT3/FT4 ratio, central thyroid hormone sensitivity indices (e.g., TT4RI, TSHI, TFQI) primarily reflect hypothalamic–pituitary–thyroid (HPT) axis function, and are involved in regulating metabolic and nervous system functions. Reduced central sensitivity to thyroid hormones had been associated with conditions such as obesity, diabetes, and metabolic syndrome ( 11 67 68 A reduction in peripheral blood mtDNAcn had been linked to several diseases, such as metabolic syndrome, cardiovascular disease, type 2 diabetes, dementia, and future mortality risk ( 27 29 32 36 64 69 Importantly, this compensatory response may be driven by the established role of thyroid hormones in regulating mitochondrial biogenesis through the PGC-1α/TFAM pathway, where TFAM stabilizes mtDNA and promotes replication ( 39 Our study has some limitations. As a cross-sectional study, we cannot draw conclusions about causality between thyroid hormone sensitivity and mtDNAcn. Longitudinal studies are needed to assess this relationship over time. Additionally, while our study provides insights into the link between mtDNAcn and thyroid hormone sensitivity, the underlying molecular mechanisms remain unclear. Future research should explore these mechanisms through animal and cellular models. Lastly, whether these findings can be translated into diagnostic tools or clinical interventions requires further validation. 5 Conclusion In conclusion, our study suggested that decreased mtDNAcn was associated with impaired peripheral sensitivity to thyroid hormones in euthyroid individuals, with variations across age, sex, BMI, smoking status, and hypertension. These findings highlight the complex interconnection between thyroid hormone sensitivity and mitochondrial function, warranting further investigation to elucidate the underlying mechanisms. Acknowledgments We also sincerely thank participants who contributed to this study. Data availability statement The raw data supporting the conclusions of this article will be made available by the authors, without undue reservation. Ethics statement The studies involving humans were approved by the Ethical Committee of Jiangsu Province Hospital (approval numbers 2019-NT-48 and 2024-SR-087). The studies were conducted in accordance with the local legislation and institutional requirements. The participants provided their written informed consent to participate in this study. Author contributions JL: Validation, Writing – review & editing, Supervision, Funding acquisition. LQ: Writing – review & editing, Writing – original draft, Data curation, Formal analysis. TH: Data curation, Writing – review & editing, Methodology, Investigation. DZ: Methodology, Data curation, Investigation, Writing – review & editing. GL: Investigation, Writing – review & editing, Data curation. LW: Data curation, Writing – review & editing, Investigation. Conflict of interest The authors declare that the research was conducted in the absence of any commercial or financial relationships that could be construed as a potential conflict of interest. Generative AI statement The author(s) declare that no Generative AI was used in the creation of this manuscript. Any alternative text (alt text) provided alongside figures in this article has been generated by Frontiers with the support of artificial intelligence and reasonable efforts have been made to ensure accuracy, including review by the authors wherever possible. If you identify any issues, please contact us. Publisher’s note All claims expressed in this article are solely those of the authors and do not necessarily represent those of their affiliated organizations, or those of the publisher, the editors and the reviewers. Any product that may be evaluated in this article, or claim that may be made by its manufacturer, is not guaranteed or endorsed by the publisher. References 1 Cheng SY Leonard JL Davis PJ Molecular aspects of thyroid hormone actions Endocr Rev 2010 31 139–70 10.1210/er.2009-0007 20051527 PMC2852208 2 Wu Z Jiang Y Li P Wang Y Zhang H Li Z Association of impaired sensitivity to thyroid hormones with hyperuricemia through obesity in the euthyroid population J Transl Med 2023 21 436 10.1186/s12967-023-04276-3 37403157 PMC10320931 3 Wang Z Yu H Wang K Han J Song Y Association between thyroid hormone resistance and obesity: a cross-sectional study and mouse stimulation test Obes (Silver Spring) 2024 32 1483–93 10.1002/oby.24084 39045674 4 Sun H Zhu W Liu J An Y Wang Y Wang G Reduced sensitivity to thyroid hormones is associated with high remnant cholesterol levels in Chinese euthyroid adults J Clin Endocrinol Metab 2022 108 166–74 10.1210/clinem/dgac523 36071542 5 Liu B Wang Z Fu J Guan H Lyu Z Wang W Sensitivity to thyroid hormones and risk of prediabetes: A cross-sectional study Front Endocrinol (Lausanne) 2021 12 657114 10.3389/fendo.2021.657114 34017311 PMC8129566 6 Jabbar A Pingitore A Pearce SH Zaman A Iervasi G Razvi S Thyroid hormones and cardiovascular disease Nat Rev Cardiol 2017 14 39 55 10.1038/nrcardio.2016.174 27811932 7 Yu ZW Pu SD Sun XT Wang XC Gao XY Shan ZY Impaired sensitivity to thyroid hormones is associated with mild cognitive impairment in euthyroid patients with type 2 diabetes Clin Interv Aging 2023 18 1263–74 10.2147/cia.S413584 37554512 PMC10406107 8 Li Y Sun J Jiao Y Li N Zhao W Impaired sensitivity to thyroid hormones is associated with decreased vitamin D levels in the euthyroid population J Clin Endocrinol Metab 2024 109 691 700 10.1210/clinem/dgad607 37831130 9 Lv F Cai X Li Y Zhang X Zhou X Han X Sensitivity to thyroid hormone and risk of components of metabolic syndrome in a Chinese euthyroid population J Diabetes 2023 15 900–10 10.1111/1753-0407.13441 37429739 PMC10590679 10 Lu Y Ye S Gu Y Xia Q Hou L Central and peripheral sensitivity to thyroid hormones correlate to metabolically obesity phenotypes in Chinese euthyroid adults: A cross-sectional study Diabetes Metab Res Rev 2024 40 e3849 10.1002/dmrr.3849 39526379 11 Laclaustra M Moreno-Franco B Lou-Bonafonte JM Mateo-Gallego R Casasnovas JA Guallar-Castillon P Impaired sensitivity to thyroid hormones is associated with diabetes and metabolic syndrome Diabetes Care 2019 42 303–10 10.2337/dc18-1410 30552134 12 Jostel A Ryder WD Shalet SM The use of thyroid function tests in the diagnosis of hypopituitarism: definition and evaluation of the TSH Index Clin Endocrinol (Oxf) 2009 71 529–34 10.1111/j.1365-2265.2009.03534.x 19226261 13 Yagi H Pohlenz J Hayashi Y Sakurai A Refetoff S Resistance to thyroid hormone caused by two mutant thyroid hormone receptors beta, R243Q and R243W, with marked impairment of function that cannot be explained by altered in vitro J Clin Endocrinol Metab 1997 82 1608–14 10.1210/jcem.82.5.3945 9141558 14 Li Y Pan T Wang L Wang Y Gong Y Wang G Increased FT3/FT4 ratio in a certain range is associated with decreased glycemic variability in patients with type 2 diabetes Sci Rep 2024 14 26556 10.1038/s41598-024-76074-w 39489743 PMC11532364 15 Lang X Li Y Zhang D Zhang Y Wu N Zhang Y FT3/FT4 ratio is correlated with all-cause mortality, cardiovascular mortality, and cardiovascular disease risk: NHANES 2007-2012 Front Endocrinol (Lausanne) 2022 13 964822 10.3389/fendo.2022.964822 36060933 PMC9433660 16 Wang Z Wu P Yang J Jiang Y Wang J Lin C Serum FT3/FT4, but not TSH is associated with handgrip strength in euthyroid U.S. population: evidence from NHANES Front Endocrinol (Lausanne) 2024 15 1323026 10.3389/fendo.2024.1323026 38501102 PMC10947195 17 Chen S Sun X Zhou G Jin J Li Z Association between sensitivity to thyroid hormone indices and the risk of osteoarthritis: an NHANES study Eur J Med Res 2022 27 114 10.1186/s40001-022-00749-1 35820977 PMC9275280 18 Liu BH Xu CZ Liu Y Lu ZL Fu TL Li GR Mitochondrial quality control in human health and disease Mil Med Res 2024 11 32 10.1186/s40779-024-00536-5 38812059 PMC11134732 19 Milane L Trivedi M Singh A Talekar M Amiji M Mitochondrial biology, targets, and drug delivery J Control Release 2015 207 40 58 10.1016/j.jconrel.2015.03.036 25841699 20 Sharma P Sampath H Mitochondrial DNA integrity: role in health and disease Cells 2019 8 100 10.3390/cells8020100 30700008 PMC6406942 21 Li B Kalinowski P Kim B Pauls AD Poburko D Emerging methods for and novel insights gained by absolute quantification of mitochondrial DNA copy number and its clinical applications Pharmacol Ther 2022 232 107995 10.1016/j.pharmthera.2021.107995 34592204 22 Bao H Cao J Chen M Chen M Chen W Chen X Biomarkers of aging Sci China Life Sci 2023 66 893 1066 10.1007/s11427-023-2305-0 37076725 PMC10115486 23 Chocron ES Munkácsy E Pickering AM Cause or casualty: The role of mitochondrial DNA in aging and age-associated disease Biochim Biophys Acta Mol Basis Dis 2019 1865 285–97 10.1016/j.bbadis.2018.09.035 30419337 PMC6310633 24 Mengel-From J Thinggaard M Dalgård C Kyvik KO Christensen K Christiansen L Mitochondrial DNA copy number in peripheral blood cells declines with age and is associated with general health among elderly Hum Genet 2014 133 1149–59 10.1007/s00439-014-1458-9 24902542 PMC4127366 25 Qin L Huang T Zhang D Wei L Li G Zhu Q The mitochondrial function of peripheral blood cells in cognitive frailty patients Front Aging Neurosci 2024 16 1503246 10.3389/fnagi.2024.1503246 39723155 PMC11669044 26 Huang T Qin L Zhang D Tong Q Zhu Q Ding G The mitochondrial function of peripheral blood mononuclear cells in frail older patients Exp Gerontol 2024 197 112594 10.1016/j.exger.2024.112594 39326808 27 Fazzini F Lamina C Raftopoulou A Koller A Fuchsberger C Pattaro C Association of mitochondrial DNA copy number with metabolic syndrome and type 2 diabetes in 14 – 176 individuals J Intern Med 2021 290 190 202 10.1111/joim.13242 33453124 PMC8359248 28 Agius R Pace NP Fava S Reduced leukocyte mitochondrial copy number in metabolic syndrome and metabolically healthy obesity Front Endocrinol (Lausanne) 2022 13 886957 10.3389/fendo.2022.886957 35957819 PMC9357898 29 Wang J Liang H Wang Y Zheng X Chen F Shao J Mitochondrial DNA copy number is a potential biomarker for treatment choice between metformin and acarbose Clin Pharmacol Ther 2023 113 1268–73 10.1002/cpt.2877 36841964 30 Stocker H Gentiluomo M Trares K Beyer L Stevenson-Hoare J Rujescu D Mitochondrial DNA abundance in blood is associated with Alzheimer’s disease- and dementia-risk Mol Psychiatry 2025 30 131–9 10.1038/s41380-024-02670-x 39009700 31 Ashar FN Zhang Y Longchamps RJ Lane J Moes A Grove ML Association of mitochondrial DNA copy number with cardiovascular disease JAMA Cardiol 2017 2 1247–55 10.1001/jamacardio.2017.3683 29049454 PMC5710361 32 Mizuno G Yamada H Tsuboi Y Munetsuna E Yamazaki M Ando Y Low mitochondrial DNA copy number in peripheral blood mononuclear cells is associated with future mortality risk: a long-term follow-up study from Japan J Nutr Health Aging 2024 28 100013 10.1016/j.jnha.2023.100013 38267162 33 Muhanhali D Deng L Ai Z Ling Y Impaired thyroid hormone sensitivity increases the risk of papillary thyroid cancer and cervical lymph node metastasis Endocrine 2024 83 659–70 10.1007/s12020-023-03508-2 37668929 34 Sun J Liu J Wu TT Gu ZY Zhang XW Sensitivity to thyroid hormone indices are associated with papillary thyroid carcinoma in Chinese patients with thyroid nodules BMC Endocr Disord 2023 23 126 10.1186/s12902-023-01381-8 37264363 PMC10233979 35 Chen Z Chen Y Li Y Leng Z Li N Xia W Association between sensitivity to thyroid hormones and trabecular bone score in euthyroid individuals: a population-based cross-sectional study BMC Musculoskelet Disord 2024 25 1050 10.1186/s12891-024-08190-7 39702097 PMC11660444 36 Alwehaidah MS Al-Awadhi R Roomy MA Baqer TA Mitochondrial DNA copy number and risk of papillary thyroid carcinoma BMC Endocr Disord 2024 24 138 10.1186/s12902-024-01669-3 39090709 PMC11295319 37 Wang Y Tan J Wang W Duan X Lappe B Shi L The association between polymorphisms in cell-cycle genes and mitochondrial DNA copy number in coke oven workers Front Public Health 2022 10 904856 10.3389/fpubh.2022.904856 35865244 PMC9294400 38 Barbosa de Sousa A Rohr P Silveira HCS Analysis of mitochondrial DNA copy number variation in Brazilian farmers occupationally exposed to pesticides Int J Environ Health Res 2024 34 2913–22 10.1080/09603123.2023.2280147 37967258 39 Chainy GBN Sahoo DK Hormones and oxidative stress: an overview Free Radic Res 2020 54 1 26 10.1080/10715762.2019.1702656 31868060 40 Ohadi H Khalili P Abasnezhad Kasrineh F Esmaeili OS Esmaeili Ranjbar F Manshoori A Umbilical cord blood thyroid hormones are inversely related to telomere length and mitochondrial DNA copy number Sci Rep 2024 14 3164 10.1038/s41598-024-53628-6 38326475 PMC10850477 41 Wu Z Liu L Wang W Cui H Zhang Y Xu J Triglyceride-glucose index in the prediction of adverse cardiovascular events in patients with premature coronary artery disease: a retrospective cohort study Cardiovasc Diabetol 2022 21 142 10.1186/s12933-022-01576-8 35906587 PMC9338459 42 Refetoff S Bassett JH Beck-Peccoz P Bernal J Brent G Chatterjee K Classification and proposed nomenclature for inherited defects of thyroid hormone action, cell transport, and metabolism Thyroid 2014 24 407–9 10.1089/thy.2013.3393.nomen 24588711 PMC3950730 43 Psarra AM Solakidi S Sekeris CE The mitochondrion as a primary site of action of steroid and thyroid hormones: presence and action of steroid and thyroid hormone receptors in mitochondria of animal cells Mol Cell Endocrinol 2006 246 21 33 10.1016/j.mce.2005.11.025 16388892 44 Psarra AM Sekeris CE Steroid and thyroid hormone receptors in mitochondria IUBMB Life 2008 60 210–23 10.1002/iub.37 18344181 45 Davis PJ Goglia F Leonard JL Nongenomic actions of thyroid hormone Nat Rev Endocrinol 2016 12 111–21 10.1038/nrendo.2015.205 26668118 46 Cioffi F Senese R Lanni A Goglia F Thyroid hormones and mitochondria: with a brief look at derivatives and analogues Mol Cell Endocrinol 2013 379 51 61 10.1016/j.mce.2013.06.006 23769708 47 Venediktova NI Mashchenko OV Talanov EY Belosludtseva NV Mironova GD Energy metabolism and oxidative status of rat liver mitochondria in conditions of experimentally induced hyperthyroidism Mitochondrion 2020 52 190–6 10.1016/j.mito.2020.04.005 32278087 48 Napolitano G Fasciolo G Di Meo S Venditti P Vitamin E supplementation and mitochondria in experimental and functional hyperthyroidism: A mini-review Nutrients 2019 11 2900 10.3390/nu11122900 31805673 PMC6950234 49 Romão JS Neto JGO Andrade CBV Carvalho JJ Pazos-Moura CC Oliveira KJ Hypothyroidism modulates mitochondrial dynamics and mitophagy in the heart of rats under fed and fasting conditions Life Sci 2024 359 123254 10.1016/j.lfs.2024.123254 39549934 50 Hoch FL Biochemistry of hyperthyroidism and hypothyroidism Postgrad Med J 1968 44 347–62 10.1136/pgmj.44.511.347 4871771 PMC2466600 51 Fu M Wang C Hong S Guan X Meng H Feng Y Multiple metals exposure and blood mitochondrial DNA copy number: A cross-sectional study from the Dongfeng-Tongji cohort Environ Res 2023 216 114509 10.1016/j.envres.2022.114509 36208786 52 Hu X Lin Y Huang K Xu H Fu CH Ou J 3-Hydroxybutyrate, a metabolite in sustaining neuronal cell vitality: a mendelian randomization and in vitro Nutr Metab (Lond) 2025 22 75 10.1186/s12986-025-00960-x 40646620 PMC12247311 53 Schwarz A Qureshi AR Hernandez L Wennberg L Wernerson A Kublickiene K Reduced mtDNA copy number links to vascular calcification and restores after transplantation Cells 2025 14 917 10.3390/cells14120917 40558544 PMC12190628 54 Pavluch V Špaček T Engstová H Dlasková A Ježek P Possible frequent multiple mitochondrial DNA copies in a single nucleoid in HeLa cells Sci Rep 2023 13 5788 10.1038/s41598-023-33012-6 37031254 PMC10082775 55 Stoldt S Maass F Weber M Dennerlein S Ilgen P Gärtner J Super-resolution microscopy of mitochondrial mRNAs Nat Commun 2025 16 6391 10.1038/s41467-025-61577-5 40640125 PMC12246080 56 Alwehaidah MS Alsabbagh M Al-Kafaji G Comprehensive analysis of mitochondrial DNA variants, mitochondrial DNA copy number and oxidative damage in psoriatic arthritis BioMed Rep 2023 19 85 10.3892/br.2023.1667 37881602 PMC10594069 57 Bulduk BK Tortajada J Valiente-Pallejà A Callado LF Torrell H Vilella E High number of mitochondrial DNA alterations in postmortem brain tissue of patients with schizophrenia compared to healthy controls Psychiatry Res 2024 337 115928 10.1016/j.psychres.2024.115928 38759415 58 Ruiz-Heredia Y Ortiz-Ruiz A Samur MK Garrido V Rufian L Sanchez R Pathogenetic and prognostic implications of increased mitochondrial content in multiple myeloma Cancers (Basel) 2021 13 3189 10.3390/cancers13133189 34202390 PMC8268477 59 Çağlar Çil Ö Metin ÖK Çayır A Evaluation of mitochondrial copy number in thyroid disorders Arch Med Res 2022 53 711–7 10.1016/j.arcmed.2022.10.003 36307229 60 Venediktova N Solomadin I Starinets V Mironova G Structural and dynamic features of liver mitochondria and mitophagy in rats with hyperthyroidism Int J Mol Sci 2022 23 14327 10.3390/ijms232214327 36430802 PMC9695125 61 Gu Y Meng G Zhang Q Liu L Wu H Zhang S Association of longitudinal trends in thyroid function with incident carotid atherosclerosis in middle-aged and older euthyroid subjects: the Tianjin Chronic Low-Grade Systemic Inflammation and Health (TCLSIH) cohort study Age Ageing 2022 51 afab276 10.1093/ageing/afab276 35077556 62 Baksi S Pradhan A Thyroid hormone: sex-dependent role in nervous system regulation and disease Biol Sex Differ 2021 12 25 10.1186/s13293-021-00367-2 33685490 PMC7971120 63 Gong R Wang S Ding H Yu L Xu M Xu S Association between thyroid hormone sensitivity and carotid plaque risk: a health examination cohort-based study Front Endocrinol (Lausanne) 2024 15 1472752 10.3389/fendo.2024.1472752 39722809 PMC11668592 64 Zheng J Cui NH Zhang S Wang XB Ming L Leukocyte mitochondrial DNA copy number and risk of thyroid cancer: A two-stage case-control study Front Endocrinol (Lausanne) 2019 10 421 10.3389/fendo.2019.00421 31312182 PMC6614343 65 Gökmen FY Ahbab S Ataoğlu HE Türker B Çetin F Türker F FT3/FT4 ratio predicts non-alcoholic fatty liver disease independent of metabolic parameters in patients with euthyroidism and hypothyroidism Clinics (Sao Paulo) 2016 71 221–5 10.6061/clinics/2016(04)08 27166773 PMC4825197 66 Chen S Yang W Guo Z Lv X Zou Y Association between serum vitamin D levels and sensitivity to thyroid hormone indices: a cross-sectional observational study in NHANES 2007-2012 Front Endocrinol (Lausanne) 2023 14 1243999 10.3389/fendo.2023.1243999 37745711 PMC10513485 67 Lu Y Wang J An Y Liu J Wang Y Wang G Impaired sensitivity to thyroid hormones is associated with hyperuricemia in a Chinese euthyroid population Front Endocrinol (Lausanne) 2023 14 1132543 10.3389/fendo.2023.1132543 37152966 PMC10154591 68 Ding X Wang Y Liu J Wang G Impaired sensitivity to thyroid hormones is associated with elevated homocysteine levels in the euthyroid population J Clin Endocrinol Metab 2022 107 e3731–7 10.1210/clinem/dgac371 35708733 69 Cox CS McKay SE Holmbeck MA Christian BE Scortea AC Tsay AJ Mitohormesis in mice via sustained basal activation of mitochondrial and antioxidant signaling Cell Metab 2018 28 776 786.e775 10.1016/j.cmet.2018.07.011 30122556 PMC6221994 ",
  "metadata": {
    "Title of this paper": "Mitohormesis in mice via sustained basal activation of mitochondrial and antioxidant signaling",
    "Journal it was published in:": "Frontiers in Endocrinology",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12491005/"
  }
}