{
  "title": "Paper_322",
  "abstract": "pmc Infect Agent Cancer Infect Agent Cancer 439 infagcan Infectious Agents and Cancer 1750-9378 BMC PMC12486763 PMC12486763.1 12486763 12486763 41029323 10.1186/s13027-025-00696-6 696 1 Research Single-cell analysis reveals the regulatory role of ECT2 Huang Shuyi Wei Xiaoning Wang Yong Tan Yudi Yang Shasha Wei Jinkong Wei Yuying Jin Yuxuan Li Linqing Chen Junying dr_chenjunying@163.com https://ror.org/030sc3x20 grid.412594.f Department of Gynecology, The First Affiliated Hospital of Guangxi Medical University, 30 9 2025 2025 20 479098 66 28 2 2025 25 8 2025 30 09 2025 02 10 2025 02 10 2025 © The Author(s) 2025 2025 https://creativecommons.org/licenses/by-nc-nd/4.0/ Open Access http://creativecommons.org/licenses/by-nc-nd/4.0/ Background This study attempted to investigate possible mechanisms of human papillomavirus (HPV) infection from high-grade squamous intraepithelial lesions (HSIL) to cervical cancer (CESC) by combining bulk RNA-seq and scRNA-seq data of CESC. Methods scRNA-seq ( GSE208653 GSE63514 GSE208653 ECT2 Results scRNA-seq data analysis identified 13 distinct cell clusters, including B cells, epithelial cells, and cancer stem cells, etc. Cell-cell communication analysis revealed that changes in epithelial cells may affect CESC progression. Key gene ECT2 ECT2 Conclusion This study probed into relationships among HPV infection, HSIL, and CESC, and identified potential oncogene ECT2 Supplementary Information The online version contains supplementary material available at 10.1186/s13027-025-00696-6. Keywords HPV High-grade squamous intraepithelial lesion CESC ECT2 Epithelial cells scRNA-seq the Guangxi Science and Technology Project - Key Research and Development Plan Guike AB23026003 Huang Shuyi Guangxi Natural Science Foundation Project 2025GXNSFAA069466 Huang Shuyi Medical and Health Appropriate Technology Development and Promotion Application Project of Guangxi Province S2022073 Huang Shuyi Guangxi Province Student Innovation and Entrepreneurship Training Program S202410598181 Huang Shuyi Self-funded project of Guangxi Health Commission Z20210119 Huang Shuyi the Guangxi Medical University Training Program for Distinguished Young Scholars Beijing RongHe Medical Development Foundation RHYX-20250114-0015-2 Huang Shuyi pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement yes pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes issue-copyright-statement © BioMed Central Ltd., part of Springer Nature 2025 Introduction Human papillomavirus (HPV) is a DNA virus that can infect human skin and mucosa tissues, especially the cervix in females [ 1 2 3 4 5 6 8 9 13 14 In recent decades, with the rapid development of cancer genomics and the continuous improvement of sequencing technologies, transcriptome sequencing (RNA-seq) and single-cell RNA sequencing (scRNA-seq) have become the main tools for studying disease progression, especially tumors [ 15 16 17 18 19 20 In this study, we conducted a systematic bioinformatics analysis using scRNA-seq and RNA-seq data to identify cell types, cell-cell communication, potential carcinogenic genes in HPV infection, HSIL, and CESC patients, as well as potential regulatory mechanisms of carcinogenic genes in epithelial cells. These findings generated new insights into associations among HPV infection, HSIL, and CESC, providing references for studies on disease progression in precancerous lesions and CESC patients. Materials and methods Collection of CESC single-cell data and transcriptome data Single-cell data ( GSE208653 GSE63514 https://www.ncbi.nlm.nih.gov/geo/ GSE208653 21 GSE63514 Processing of CESC single-cell data Seurat package was utilized to perform quality control on the single-cell data of GSE208653 22 Cell-cell communication analysis of CESC single-cell data To infer and analyze cell-cell communication, we used the CellChat package to infer and analyze cell-cell communication between different groups (HPV group vs. non-HPV group; HSIL group vs. HPV group; CESC group vs. HSIL group). Due to the low total number of cancer stem cells (CSCs), they were excluded in the process of cell-cell communication analysis [ 23 Identification and analysis of marker genes for intergroup epithelial cells identified by single-cell analysis The COSG package was utilized to analyze epithelial cell marker genes among HPV group, HSIL group, and CESC group. The clusterProfiler package was implemented to perform GO, KEGG, and ReactomePA enrichment analyses on these specific marker genes. Acquisition and analysis of CESC clinical samples and sequencing data This study complied with all relevant ethical standards and the protocol was approved by the Institutional Review Board of The First Affiliated Hospital of Guangxi Medical University. A total of 43 patients were included in this study, including 15 patients diagnosed with HPV infection and histologically normal inflammation (IA), 19 patients diagnosed with HSIL, and 9 patients diagnosed with CESC. All patients aged between 19 and 75 years old, did not have any previous comorbidities or receive any treatment, did not receive HPV vaccination, and have no family history of malignant diseases. Individuals infected with HPV for less than a year were excluded. During colposcopy, cervical samples were collected from each patient and confirmed by histopathology examination conducted by expert pathologists. After resection, specimens were collected and quickly transported to High Precision (Hangzhou) Life Technology Co., LTD for mRNA sequencing. Afterwards, clinical sequencing samples were collected and grouped according to HSIL.vs.IA and CESC.vs.HSIL. Differential analysis was performed using the DEseq2 package (|log2FC|>0.585, padj < 0.05) to obtain differentially expressed genes in the two groups. Identification of oncogenes in epithelial cells using HdWGCNA The hdWGCNA method was highly modular and can identify powerful gene modules and construct co-expression networks across multiple cellular scales and hierarchical structures. A Seurat object was established using the SetupForWGCNA function (fraction = 0.05). Using KNN technology, the average or total expression of these cell groups was summarized, resulting in a sparse supercell gene expression matrix. Then, the SetDatExpr function was used to define the cell types composed of epithelial cells and generate an expression matrix. Parameter scanning was performed on various soft power thresholds (ranging from 1 to 30) using the TestSoftPowers function (networkType=’signed’). By examining the network architecture at different power values, an appropriate soft power threshold for constructing co-expression networks was determined to ensure the robust of the gene-gene adjacency matrix and eliminate weak links. Based on the fitting of the scale-free topology model, the minimum soft threshold value greater than or equal to 0.9 was selected. The ConstructNetwork function (setDatExpr = FALSE) was implemented to create a co-expression network below the optimal soft threshold. The module eigengene (ME) function was applied to perform PCA on the subset of gene expression matrices representing each module to identify MEs and obtain those existed in different modules. GetModuleTraitCorrelation function was applied to analyze correlation between modules and different progression stages (NO_HPV, HPV, HSIL, CESC). The importance of modules was determined based on correlation coefficients and p 24 The differentially upregulated genes in the two clinical sequencing groups (HSIL.vs.IA, CESC.vs.HSIL) were intersected with the MEs of hdWGCNA to obtain the hub gene. The validation of hub gene expression levels was conducted in the GSE63514 t p Evaluation of CESC tumor microenvironment and potential for immunotherapy To understand tumor microenvironment of CESC, we used findAllmarker function to identify cell markers and construct a signature matrix in single-cell CESC samples. In TCGA data, cell abundance ratio was estimated based on the constructed signature matrix using the CIBERSORT package. In TCGA dataset, hub genes were grouped based on the median expression level and subjected to t http://tide.dfci.harvard.edu/ 23 T https://www.gsea-msigdb.org/gsea/msigdb Results Identification of 13 cell clusters in HPV infection, HSIL, and CESC using scRNA-seq data scRNA-seq data showed a strong correlation between the number of genes and sequencing depth, but no correlations were observed between the number of genes and sequencing depth with the percentage of mitochondria (Fig. 1 1 1 1 S1 + + 1 1 1 S2  Fig. 1 Identification of 13 cell clusters in HPV infection, HSIL, and CESC using scRNA-seq data. ( A r r r B C D E F G H Comparison and analysis of cell-cell communication in different groups The analysis of the total number and strength of cell-cell communication interactions in different groups showed that the total number of cell-cell communication interactions increased after HPV infection, decreased when progressing to HSIL, and increased to the highest level when progressing to CESC; while the total strength of cell-cell communication interactions increased after HPV infection, reached the highest level when progressing to HSIL, decreased to some extent when progressing to CESC, but still higher than the normal group (Fig. 2  Fig. 2 Comparison of cell-cell communication in different groups. ( A B C D E F G H I J K At the cellular level, the NO-HPV group exhibited the strongest autocrine signaling in epithelial cells, primarily involving pathways such as MIF-(CD74 + CD44), MDK-NCL, and MDK-(ITGA6 + ITGB1). In the HPV group, both incoming and outgoing signals of CD8 + + 2 Eggshell plot analysis further revealed that HSIL had fewer intercellular interactions but exhibited prominent self-feedback signaling among epithelial cells, suggesting that HSIL is primarily driven by epithelial cell-autonomous abnormalities. Pathways like MIF-(CD74 + CD44), MDK-NCL, and MDK-(ITGA6 + ITGB1) may play a key role in promoting self-proliferation (Fig. 2 2 The group comparison analysis revealed that compared with the NO_HPV group, the interaction strength between fibroblasts, CD4 + + + 2 + + + 2 + + 2 Enrichment analysis of different groups of epithelial cells As we reported, as the disease progresses (especially from HSIL to CESC), epithelial cell interactions change most significantly, suggesting their potential role in CESC progression. Thus, we focused on epithelial cell changes. Single-cell analysis revealed marked epithelial cell heterogeneity (Figure S3 3  Fig. 3 Enrichment analysis of epithelial cells in different groups. ( A B C D E F A E The HPV group exhibited significant enrichment in humoral immunity, T-cell activation, and metal ion metabolism. GO-BP terms included leukocyte/T-cell-mediated immune responses and humoral immunity. GO-CC enrichment centered on immune synapses and T-cell receptor (TCR) complexes, while GO-MF involved cytokine activity and TCR binding. KEGG analysis showed enrichment in TCR signaling, Th1/Th2/Th17 differentiation, and PD-1/PD-L1 pathways. ReactomePA further revealed TCR signal transduction, ZAP-70 trafficking, and CD3/TCRζ chain phosphorylation (Fig. 3 In the HSIL group, upregulated genes were enriched in T-cell activation regulation, skin barrier formation, and viral response pathways. GO-BP terms included responses to copper/cadmium ions and detoxification. GO-CC enrichment featured basal cell regions and lateral plasma membranes, while KEGG highlighted mineral absorption. ReactomePA further linked these genes to metal ion responses (Fig. 3 CESC-specific genes showed strong enrichment in immune response, metal ion stress, and protein translation pathways. GO-BP terms included keratinocyte differentiation, epidermal development, and negative regulation of viral genome replication. GO-CC enrichment involved cornified envelopes and microvillus membranes, while GO-MF emphasized serine-type peptidase activity. KEGG pathways included cornified envelope formation, influenza A, and hepatitis C, whereas ReactomePA revealed interferon signaling and keratinization (Fig. 3 Additionally, to identify key regulatory factors driving functional changes across stages, we assessed transcription factor activity using single-cell data. HSIL showed significantly elevated HNF1B activity but reduced CEBPB, ATF2, JUN, and FOXL2 activity. In contrast, oncogenic transcription factors (IRF9, STAT1/2, IRF1, TWIST1) were highly active in CESC (Fig. 3 In summary, epithelial cells undergo marked functional and immunological shifts during progression from NO-HPV to CESC. Stage-specific genes are differentially enriched in immune response, metal ion metabolism, skin barrier formation, and antiviral signaling, reflecting their diverse roles in disease progression. Transcription factor activity analysis further reveals distinct regulatory networks in HSIL and CESC, suggesting their potential contributions to carcinogenesis. HdWGCNA identification of oncogenes in epithelial cells To screen for hub genes associated with HPV-induced carcinogenesis, we constructed a co-expression network based on single-cell data using the optimal soft threshold of 9 (Fig. 4 4 4 S1 S2 ECT2 4 ECT2 p 4 ECT2 4 GSE63514 ECT2 4 ECT2 4 ECT2 ECT2 4 ECT2 ECT2 P ECT2 ECT2 4 ECT2 Ki-67 TOP2A p 4 ECT2 25 27  Fig. 4 hdWGCNA identification of oncogenes in epithelial cells. ( A B C p p p D E ECT2 F ECT2 G ECT2 GSE63514 H ECT2 I ECT2 ECT2 p J ECT2 K ECT2 Ki-67 TOP2A Analysis of immune levels in ECT2 high and low expression groups, evaluation of immunotherapy response, and exploration of the relationship with glycolysis Immune cell infiltration analysis showed that CD8 + ECT2 5 5 ECT2 5 ECT2 5 ECT2 ECT2 5  Fig. 5 Investigation of pathogenic mechanism of ECT2 A ECT2 B C ECT2 D E ECT2 Discussion As one of the most prevalent malignant tumors worldwide, CESC is becoming more widespread in many nations [ 5 28 29 30 First, we identified 13 independent cell clusters in the scRNA-seq data, including B cells, epithelial cells, CSCs, neutrophils, natural killer cells, CD4 + + + 31 32 33 34 35 Furthermore, we revealed through cell-cell communication analysis that during the HPV stage, T cells and fibroblasts mainly played a role, while during the HSIL stage, it was mainly based on pathologic process of the epithelial cells themselves, and CESC epithelial cells were greatly influenced by tumor microenvironment, and the interaction between cells was more complex. Moreover, interaction between epithelial cells changed the most as the disease progressed, especially from HSIL to CESC. Thus, we speculated that changes in epithelial cells may affect CESC progression. During the process from HPV infection of cervical epithelium to precancerous lesions and then to cancer, epithelial cells undergo transformation [ 21 36 37 38 39 40 41 42 43 44 45 46 Besides, through co-expression network analysis of single-cell data and differential analysis of clinical sequencing datasets, we identified the hub gene ECT2 GSE63514 ECT2 ECT2 ECT2 ECT2 ECT2 47 ECT2 + 48 49 ECT2 In summary, this study comprehensively analyzed scRNA-seq data and transcriptome data of CESC for the first time and investigated changes in cell types and cell-cell communication from HPV infection to HSIL precancerous lesions to CESC at three different stages of the disease. Additionally, this study uncovered potential oncogenes in epithelial cells and preliminarily elucidated possible modulatory mechanisms of oncogenes. These findings generated new insights into relationships among HPV infection, HSIL, and CESC. Reliable biomarkers for CESC progression were also screened. Nonetheless, this study still has many shortcomings: (1) scRNA-seq data sample size is rather limited; (2) the regulatory mechanism of ECT2 Supplementary Information Below is the link to the electronic supplementary material.  Supplementary Material 1 Figure S1  Supplementary Material 2 Figure S2  Supplementary Material 3 Figure S3  Supplementary Material 4 Table S1  Supplementary Material 5 Table S2 Publisher’s note Springer Nature remains neutral with regard to jurisdictional claims in published maps and institutional affiliations. Shuyi Huang and Xiaoning Wei are co first authors. Author contributions Conception and design: Shuyi Huang, Yuying WeiCollection and assembly of data: Linqing Li, Yudi TanData analysis and interpretation: Shasha Yang, Jinkong WeiManuscript drafting: Shuyi Huang, Xiaoning Wei, Yuxuan JinReviewing and editing: Xiaoning Wei, Yong Wang, Junying ChenFinal approval of manuscript: All authors. Funding This work was supported by the Guangxi Science and Technology Project - Key Research and Development Plan (grant no. Guike AB23026003); Guangxi Natural Science Foundation Project (Acceptance number: 2025GXNSFAA069466); Medical and Health Appropriate Technology Development and Promotion Application Project of Guangxi Province (grant no.S2022073); Guangxi Province Student Innovation and Entrepreneurship Training Program (grant no. S202410598181); Self-funded project of Guangxi Health Commission (grant no. Z20210119); the Guangxi Medical University Training Program for Distinguished Young Scholars; and Beijing RongHe Medical Development Foundation (RHYX-20250114-0015-2). Data availability No datasets were generated or analysed during the current study. Declarations Ethics approval and consent to participate The study was approved by the Ethical Committee of The First Affiliated Hospital of Guangxi Medical University (2022-KT-guike-009). Competing interests The authors declare no competing interests. Abbreviations GEO Gene expression omnibus GO Gene ontology KEGG Kyoto encyclopedia of genes and genomes ECT2 Epithelial cell transforming 2 HPV Human papillomavirus CESC Cervical squamous cell carcinoma and endocervical adenocarcinoma hdWGCNA High-dimensional weighted gene co-expression network analysis HSIL High-grade squamous intraepithelial lesion IA Patients with HPV infection and normal histological findings of inflammation CIBERSORT Cell-type identification by estimating relative subsets Of RNA transcripts WHO World health organization SCC Squamous cell carcinoma ADC Adenocarcinoma CSCs Cancer stem cells PCA Principal component analysis TIDE Tumor immune dysfunction and exclusion ICB Immune checkpoint blockade KEGG Kyoto encyclopedia of genes and genomes BP Biological process CC Cellular component MF Molecular function IRF9 Interferon regulatory factor 9 STAT1 Signal transducer and activator of transcription 1 STAT2 Signal transducer and activator of transcription 2 IRF1 Interferon regulatory factor 1 TWIST Twist family BHLH transcription factor 1 References 1. Ekstrom J Forslund O Dillner J Three novel papillomaviruses (HPV109, HPV112 and HPV114) and their presence in cutaneous and mucosal samples Virology 2010 397 331 6 10.1016/j.virol.2009.11.027 19969321 Ekstrom J, Forslund O, Dillner J. Three novel papillomaviruses (HPV109, HPV112 and HPV114) and their presence in cutaneous and mucosal samples. Virology. 2010;397:331–6. 19969321 10.1016/j.virol.2009.11.027 2. Jung WW Chun T Sul D Hwang KW Kang HS Lee DJ Strategies against human papillomavirus infection and cervical cancer J Microbiol 2004 42 255 66 15650698 Jung WW, Chun T, Sul D, Hwang KW, Kang HS, Lee DJ, et al. Strategies against human papillomavirus infection and cervical cancer. J Microbiol. 2004;42:255–66. 15650698 3. Wu Z Qin Y Yu L Lin C Wang H Cui J Association between human papillomavirus (HPV) 16, HPV18, and other HR-HPV viral load and the histological classification of cervical lesions: results from a large-scale cross-sectional study J Med Virol 2017 89 535 41 10.1002/jmv.24645 27464021 Wu Z, Qin Y, Yu L, Lin C, Wang H, Cui J, et al. Association between human papillomavirus (HPV) 16, HPV18, and other HR-HPV viral load and the histological classification of cervical lesions: results from a large-scale cross-sectional study. J Med Virol. 2017;89:535–41. 27464021 10.1002/jmv.24645 4. Wang R Li Y Du P Zhang X Li X Cheng G Hypomethylation of the LncRNA SOX21-AS1 has clinical prognostic value in cervical cancer Life Sci 2019 233 116708 10.1016/j.lfs.2019.116708 31369759 Wang R, Li Y, Du P, Zhang X, Li X, Cheng G. Hypomethylation of the LncRNA SOX21-AS1 has clinical prognostic value in cervical cancer. Life Sci. 2019;233:116708. 31369759 10.1016/j.lfs.2019.116708 5. Sung H Ferlay J Siegel RL Laversanne M Soerjomataram I Jemal A Global cancer statistics 2020: GLOBOCAN estimates of incidence and mortality worldwide for 36 cancers in 185 countries CA Cancer J Clin 2021 71 209 49 33538338 10.3322/caac.21660 Sung H, Ferlay J, Siegel RL, Laversanne M, Soerjomataram I, Jemal A, et al. Global cancer statistics 2020: GLOBOCAN estimates of incidence and mortality worldwide for 36 cancers in 185 countries. CA Cancer J Clin. 2021;71:209–49. 33538338 10.3322/caac.21660 6. Sabatini ME Chiocca S Human papillomavirus as a driver of head and neck cancers Br J Cancer 2020 122 306 14 10.1038/s41416-019-0602-7 31708575 PMC7000688 Sabatini ME, Chiocca S. Human papillomavirus as a driver of head and neck cancers. Br J Cancer. 2020;122:306–14. 31708575 10.1038/s41416-019-0602-7 PMC7000688 7. Roura E Castellsague X Pawlita M Travier N Waterboer T Margall N Smoking as a major risk factor for cervical cancer and pre-cancer: results from the EPIC cohort Int J Cancer 2014 135 453 66 10.1002/ijc.28666 24338632 Roura E, Castellsague X, Pawlita M, Travier N, Waterboer T, Margall N, et al. Smoking as a major risk factor for cervical cancer and pre-cancer: results from the EPIC cohort. Int J Cancer. 2014;135:453–66. 24338632 10.1002/ijc.28666 8. Zhang S Xu H Zhang L Qiao Y Cervical cancer: epidemiology, risk factors and screening Chin J Cancer Res 2020 32 720 8 10.21147/j.issn.1000-9604.2020.06.05 33446995 PMC7797226 Zhang S, Xu H, Zhang L, Qiao Y. Cervical cancer: epidemiology, risk factors and screening. Chin J Cancer Res. 2020;32:720–8. 33446995 10.21147/j.issn.1000-9604.2020.06.05 PMC7797226 9. Salihi R Leunen K Van Limbergen E Moerman P Neven P Vergote I Neoadjuvant chemotherapy followed by large cone resection as fertility-sparing therapy in stage IB cervical cancer Gynecol Oncol 2015 139 447 51 10.1016/j.ygyno.2015.05.043 26050921 Salihi R, Leunen K, Van Limbergen E, Moerman P, Neven P, Vergote I. Neoadjuvant chemotherapy followed by large cone resection as fertility-sparing therapy in stage IB cervical cancer. Gynecol Oncol. 2015;139:447–51. 26050921 10.1016/j.ygyno.2015.05.043 10. Yan H Liu Z Fu X Li Y Che H Mo R Long-term outcomes of radical vaginal trachelectomy and laparoscopic pelvic lymphadenectomy after neoadjuvant chemotherapy for the IB1 cervical cancer: A series of 60 cases Int J Surg 2016 29 38 42 10.1016/j.ijsu.2016.03.019 26975424 Yan H, Liu Z, Fu X, Li Y, Che H, Mo R, et al. Long-term outcomes of radical vaginal trachelectomy and laparoscopic pelvic lymphadenectomy after neoadjuvant chemotherapy for the IB1 cervical cancer: A series of 60 cases. Int J Surg. 2016;29:38–42. 26975424 10.1016/j.ijsu.2016.03.019 11. Potter R Tanderup K Schmid MP Jurgenliemk-Schulz I Haie-Meder C Fokdal LU MRI-guided adaptive brachytherapy in locally advanced cervical cancer (EMBRACE-I): a multicentre prospective cohort study Lancet Oncol 2021 22 538 47 10.1016/S1470-2045(20)30753-1 33794207 Potter R, Tanderup K, Schmid MP, Jurgenliemk-Schulz I, Haie-Meder C, Fokdal LU, et al. MRI-guided adaptive brachytherapy in locally advanced cervical cancer (EMBRACE-I): a multicentre prospective cohort study. Lancet Oncol. 2021;22:538–47. 33794207 10.1016/S1470-2045(20)30753-1 12. Vulpe H Asamoah FA Maganti M Vanderpuye V Fyles A Yarney J External beam radiation therapy and brachytherapy for cervical cancer: the experience of the National centre for radiotherapy in accra, Ghana Int J Radiat Oncol Biol Phys 2018 100 1246 53 10.1016/j.ijrobp.2017.12.270 29395628 Vulpe H, Asamoah FA, Maganti M, Vanderpuye V, Fyles A, Yarney J. External beam radiation therapy and brachytherapy for cervical cancer: the experience of the National centre for radiotherapy in accra, Ghana. Int J Radiat Oncol Biol Phys. 2018;100:1246–53. 29395628 10.1016/j.ijrobp.2017.12.270 13. Falcaro M Castanon A Ndlela B Checchi M Soldan K Lopez-Bernal J The effects of the National HPV vaccination programme in england, UK, on cervical cancer and grade 3 cervical intraepithelial neoplasia incidence: a register-based observational study Lancet 2021 398 2084 92 10.1016/S0140-6736(21)02178-4 34741816 Falcaro M, Castanon A, Ndlela B, Checchi M, Soldan K, Lopez-Bernal J, et al. The effects of the National HPV vaccination programme in england, UK, on cervical cancer and grade 3 cervical intraepithelial neoplasia incidence: a register-based observational study. Lancet. 2021;398:2084–92. 34741816 10.1016/S0140-6736(21)02178-4 14. Akinlotan M Bolin JN Helduser J Ojinnaka C Lichorad A McClellan D Cervical cancer screening barriers and risk factor knowledge among uninsured women J Community Health 2017 42 770 8 10.1007/s10900-017-0316-9 28155005 PMC5494033 Akinlotan M, Bolin JN, Helduser J, Ojinnaka C, Lichorad A, McClellan D. Cervical cancer screening barriers and risk factor knowledge among uninsured women. J Community Health. 2017;42:770–8. 28155005 10.1007/s10900-017-0316-9 PMC5494033 15. Slyper M Porter CBM Ashenberg O Waldman J Drokhlyansky E Wakiro I A single-cell and single-nucleus RNA-Seq toolbox for fresh and frozen human tumors Nat Med 2020 26 792 802 10.1038/s41591-020-0844-1 32405060 PMC7220853 Slyper M, Porter CBM, Ashenberg O, Waldman J, Drokhlyansky E, Wakiro I, et al. A single-cell and single-nucleus RNA-Seq toolbox for fresh and frozen human tumors. Nat Med. 2020;26:792–802. 32405060 10.1038/s41591-020-0844-1 PMC7220853 16. Guo S Liu X Zhang J Huang Z Ye P Shi J Integrated analysis of single-cell RNA-seq and bulk RNA-seq unravels T cell-related prognostic risk model and tumor immune microenvironment modulation in triple-negative breast cancer Comput Biol Med 2023 161 107066 10.1016/j.compbiomed.2023.107066 37263064 Guo S, Liu X, Zhang J, Huang Z, Ye P, Shi J, et al. Integrated analysis of single-cell RNA-seq and bulk RNA-seq unravels T cell-related prognostic risk model and tumor immune microenvironment modulation in triple-negative breast cancer. Comput Biol Med. 2023;161:107066. 37263064 10.1016/j.compbiomed.2023.107066 17. Cassier PA Navaridas R Bellina M Rama N Ducarouge B Hernandez-Vargas H Netrin-1 Blockade inhibits tumour growth and EMT features in endometrial cancer Nature 2023 620 409 16 10.1038/s41586-023-06367-z 37532934 PMC10412451 Cassier PA, Navaridas R, Bellina M, Rama N, Ducarouge B, Hernandez-Vargas H, et al. Netrin-1 Blockade inhibits tumour growth and EMT features in endometrial cancer. Nature. 2023;620:409–16. 37532934 10.1038/s41586-023-06367-z PMC10412451 18. Tan Z Chen X Zuo J Fu S Wang H Wang J Comprehensive analysis of scRNA-Seq and bulk RNA-Seq reveals dynamic changes in the tumor immune microenvironment of bladder cancer and establishes a prognostic model J Transl Med 2023 21 223 10.1186/s12967-023-04056-z 36973787 PMC10044739 Tan Z, Chen X, Zuo J, Fu S, Wang H, Wang J. Comprehensive analysis of scRNA-Seq and bulk RNA-Seq reveals dynamic changes in the tumor immune microenvironment of bladder cancer and establishes a prognostic model. J Transl Med. 2023;21:223. 36973787 10.1186/s12967-023-04056-z PMC10044739 19. Chen J Wang X Ma A Wang QE Liu B Li L Deep transfer learning of cancer drug responses by integrating bulk and single-cell RNA-seq data Nat Commun 2022 13 6494 10.1038/s41467-022-34277-7 36310235 PMC9618578 Chen J, Wang X, Ma A, Wang QE, Liu B, Li L, et al. Deep transfer learning of cancer drug responses by integrating bulk and single-cell RNA-seq data. Nat Commun. 2022;13:6494. 36310235 10.1038/s41467-022-34277-7 PMC9618578 20. Zhang Y Liu G Tao M Ning H Guo W Yin G Integrated transcriptome study of the tumor microenvironment for treatment response prediction in male predominant hypopharyngeal carcinoma Nat Commun 2023 14 1466 10.1038/s41467-023-37159-8 36928331 PMC10020474 Zhang Y, Liu G, Tao M, Ning H, Guo W, Yin G, et al. Integrated transcriptome study of the tumor microenvironment for treatment response prediction in male predominant hypopharyngeal carcinoma. Nat Commun. 2023;14:1466. 36928331 10.1038/s41467-023-37159-8 PMC10020474 21. Guo C Qu X Tang X Song Y Wang J Hua K Spatiotemporally Deciphering the mysterious mechanism of persistent HPV-induced malignant transition and immune remodelling from HPV-infected normal cervix, precancer to cervical cancer: integrating single-cell RNA-sequencing and Spatial transcriptome Clin Transl Med 2023 13 e1219 10.1002/ctm2.1219 36967539 PMC10040725 Guo C, Qu X, Tang X, Song Y, Wang J, Hua K, et al. Spatiotemporally Deciphering the mysterious mechanism of persistent HPV-induced malignant transition and immune remodelling from HPV-infected normal cervix, precancer to cervical cancer: integrating single-cell RNA-sequencing and Spatial transcriptome. Clin Transl Med. 2023;13:e1219. 36967539 10.1002/ctm2.1219 PMC10040725 22. Wang Z Guo X Gao L Wang Y Ma W Xing B Glioblastoma cell differentiation trajectory predicts the immunotherapy response and overall survival of patients Aging 2020 12 18297 321 10.18632/aging.103695 32957084 PMC7585071 Wang Z, Guo X, Gao L, Wang Y, Ma W, Xing B. Glioblastoma cell differentiation trajectory predicts the immunotherapy response and overall survival of patients. Aging. 2020;12:18297–321. 32957084 10.18632/aging.103695 PMC7585071 23. Fang Z Tian Y Sui C Guo Y Hu X Lai Y Single-Cell transcriptomics of proliferative phase endometrium: systems analysis of Cell-Cell communication network using cellchat Front Cell Dev Biol 2022 10 919731 10.3389/fcell.2022.919731 35938159 PMC9352955 Fang Z, Tian Y, Sui C, Guo Y, Hu X, Lai Y, et al. Single-Cell transcriptomics of proliferative phase endometrium: systems analysis of Cell-Cell communication network using cellchat. Front Cell Dev Biol. 2022;10:919731. 35938159 10.3389/fcell.2022.919731 PMC9352955 24. Xu W Jiang T Shen K Zhao D Zhang M Zhu W GADD45B regulates the carcinogenesis process of chronic atrophic gastritis and the metabolic pathways of gastric cancer Front Endocrinol (Lausanne) 2023 14 1224832 10.3389/fendo.2023.1224832 37608794 PMC10441793 Xu W, Jiang T, Shen K, Zhao D, Zhang M, Zhu W, et al. GADD45B regulates the carcinogenesis process of chronic atrophic gastritis and the metabolic pathways of gastric cancer. Front Endocrinol (Lausanne). 2023;14:1224832. 37608794 10.3389/fendo.2023.1224832 PMC10441793 25. Peres AL Paz ESKM de Araujo RF de Lima Filho JL de Melo Junior MR Martins DB Immunocytochemical study of TOP2A and Ki-67 in cervical smears from women under routine gynecological care J Biomed Sci 2016 23 42 10.1186/s12929-016-0258-z 27175798 PMC4864931 Peres AL, Paz ESKM, de Araujo RF, de Lima Filho JL, de Melo Junior MR, Martins DB, et al. Immunocytochemical study of TOP2A and Ki-67 in cervical smears from women under routine gynecological care. J Biomed Sci. 2016;23:42. 27175798 10.1186/s12929-016-0258-z PMC4864931 26. Sahebali S Depuydt CE Segers K Vereecken AJ Van Marck E Bogers JJ Ki-67 immunocytochemistry in liquid based cervical cytology: useful as an adjunctive tool? J Clin Pathol 2003 56 681 6 10.1136/jcp.56.9.681 12944552 PMC1770061 Sahebali S, Depuydt CE, Segers K, Vereecken AJ, Van Marck E, Bogers JJ. Ki-67 immunocytochemistry in liquid based cervical cytology: useful as an adjunctive tool? J Clin Pathol. 2003;56:681–6. 12944552 10.1136/jcp.56.9.681 PMC1770061 27. Branca M Giorgi C Ciotti M Santini D Di Bonito L Costa S Over-expression of topoisomerase iialpha is related to the grade of cervical intraepithelial neoplasia (CIN) and high-risk human papillomavirus (HPV), but does not predict prognosis in cervical cancer or HPV clearance after cone treatment Int J Gynecol Pathol 2006 25 383 92 10.1097/01.pgp.0000209573.54457.32 16990717 Branca M, Giorgi C, Ciotti M, Santini D, Di Bonito L, Costa S, et al. Over-expression of topoisomerase iialpha is related to the grade of cervical intraepithelial neoplasia (CIN) and high-risk human papillomavirus (HPV), but does not predict prognosis in cervical cancer or HPV clearance after cone treatment. Int J Gynecol Pathol. 2006;25:383–92. 16990717 10.1097/01.pgp.0000209573.54457.32 28. Francoeur AA, Liao CI, Caesar MA, Chan A, Kapp DS, Cohen JG et al. The increasing incidence of stage IV cervical cancer in the USA: what factors are related? Int J Gynecol Cancer. 2022;32(9):1115–1122. 10.1136/ijgc-2022-003728 35981903 29. Feng X Zhou J Li J Hou X Li L Chen Y Tubeimoside I induces accumulation of impaired autophagolysosome against cervical cancer cells by both initiating autophagy and inhibiting lysosomal function Cell Death Dis 2018 9 1117 10.1038/s41419-018-1151-3 30389907 PMC6214972 Feng X, Zhou J, Li J, Hou X, Li L, Chen Y, et al. Tubeimoside I induces accumulation of impaired autophagolysosome against cervical cancer cells by both initiating autophagy and inhibiting lysosomal function. Cell Death Dis. 2018;9:1117. 30389907 10.1038/s41419-018-1151-3 PMC6214972 30. Liu J Xie J Dong P Transcriptome and single-cell sequencing analysis in tumor microenvironment J Gene Med 2023 25 e3520 10.1002/jgm.3520 37102577 Liu J, Xie J, Dong P. Transcriptome and single-cell sequencing analysis in tumor microenvironment. J Gene Med. 2023;25:e3520. 37102577 10.1002/jgm.3520 31. Zhang J Meng S Zhang X Shao K Lin C Infiltration patterns of cervical epithelial microenvironment cells during carcinogenesis Front Immunol 2022 13 888176 10.3389/fimmu.2022.888176 35911729 PMC9330475 Zhang J, Meng S, Zhang X, Shao K, Lin C. Infiltration patterns of cervical epithelial microenvironment cells during carcinogenesis. Front Immunol. 2022;13:888176. 35911729 10.3389/fimmu.2022.888176 PMC9330475 32. Mbuya W McHaro R Mhizde J Mnkai J Mahenge A Mwakatima M Depletion and activation of mucosal CD4 T cells in HIV infected women with HPV-associated lesions of the cervix Uteri PLoS ONE 2020 15 e0240154 10.1371/journal.pone.0240154 33007050 PMC7531815 Mbuya W, McHaro R, Mhizde J, Mnkai J, Mahenge A, Mwakatima M, et al. Depletion and activation of mucosal CD4 T cells in HIV infected women with HPV-associated lesions of the cervix Uteri. PLoS ONE. 2020;15:e0240154. 33007050 10.1371/journal.pone.0240154 PMC7531815 33. Schuster R Rockel JS Kapoor M Hinz B The inflammatory speech of fibroblasts Immunol Rev 2021 302 126 46 10.1111/imr.12971 33987902 Schuster R, Rockel JS, Kapoor M, Hinz B. The inflammatory speech of fibroblasts. Immunol Rev. 2021;302:126–46. 33987902 10.1111/imr.12971 34. Gu W Yeo E McMillan N Yu C Silencing oncogene expression in cervical cancer stem-like cells inhibits their cell growth and self-renewal ability Cancer Gene Ther 2011 18 897 905 10.1038/cgt.2011.58 21904396 Gu W, Yeo E, McMillan N, Yu C. Silencing oncogene expression in cervical cancer stem-like cells inhibits their cell growth and self-renewal ability. Cancer Gene Ther. 2011;18:897–905. 21904396 10.1038/cgt.2011.58 35. Yin X Lu Y Zou M Wang L Zhou X Zhang Y Synthesis and characterization of Salinomycin-Loaded High-Density lipoprotein and its effects on cervical cancer cells and cervical cancer stem cells Int J Nanomed 2021 16 6367 82 10.2147/IJN.S326089 PMC8459968 34584409 Yin X, Lu Y, Zou M, Wang L, Zhou X, Zhang Y, et al. Synthesis and characterization of Salinomycin-Loaded High-Density lipoprotein and its effects on cervical cancer cells and cervical cancer stem cells. Int J Nanomed. 2021;16:6367–82. 10.2147/IJN.S326089 PMC8459968 34584409 36. Bobardt M Hopkins S Baugh J Chatterji U Hernandez F Hiscott J HCV NS5A and IRF9 compete for CypA binding J Hepatol 2013 58 16 23 10.1016/j.jhep.2012.08.007 22902549 PMC3527675 Bobardt M, Hopkins S, Baugh J, Chatterji U, Hernandez F, Hiscott J, et al. HCV NS5A and IRF9 compete for CypA binding. J Hepatol. 2013;58:16–23. 22902549 10.1016/j.jhep.2012.08.007 PMC3527675 37. Honda K Taniguchi T IRFs: master regulators of signalling by Toll-like receptors and cytosolic pattern-recognition receptors Nat Rev Immunol 2006 6 644 58 10.1038/nri1900 16932750 Honda K, Taniguchi T. IRFs: master regulators of signalling by Toll-like receptors and cytosolic pattern-recognition receptors. Nat Rev Immunol. 2006;6:644–58. 16932750 10.1038/nri1900 38. Bachmann A Zawatzky R Rosl F Genetic redundancy in human cervical carcinoma cells: identification of cells with normal properties Int J Cancer 2007 120 2119 26 10.1002/ijc.22524 17266037 Bachmann A, Zawatzky R, Rosl F. Genetic redundancy in human cervical carcinoma cells: identification of cells with normal properties. Int J Cancer. 2007;120:2119–26. 17266037 10.1002/ijc.22524 39. Bucciol G, Moens L, Ogishi M, Rinchai D, Matuozzo D, Momenilandi M et al. Human inherited complete STAT2 deficiency underlies inflammatory viral diseases. J Clin Invest. 2023;133(12):e168321. 10.1172/JCI168321 PMC10266780 36976641 40. Liang Z Gao LH Cao LJ Feng DY Cao Y Luo QZ Detection of STAT2 in early stage of cervical premalignancy and in cervical cancer Asian Pac J Trop Med 2012 5 738 42 10.1016/S1995-7645(12)60117-5 22805728 Liang Z, Gao LH, Cao LJ, Feng DY, Cao Y, Luo QZ, et al. Detection of STAT2 in early stage of cervical premalignancy and in cervical cancer. Asian Pac J Trop Med. 2012;5:738–42. 22805728 10.1016/S1995-7645(12)60117-5 41. Raspaglio G Buttarelli M Filippetti F Battaglia A Buzzonetti A Scambia G Stat1 confers sensitivity to radiation in cervical cancer cells by controlling Parp1 Parp1 Cell Death Dis 2021 12 933 10.1038/s41419-021-04229-y 34642300 PMC8511191 Raspaglio G, Buttarelli M, Filippetti F, Battaglia A, Buzzonetti A, Scambia G, et al. Stat1 confers sensitivity to radiation in cervical cancer cells by controlling Parp1 Parp1 34642300 10.1038/s41419-021-04229-y PMC8511191 42. Yang J Tian B Sun H Garofalo RP Brasier AR Epigenetic Silencing of IRF1 dysregulates type III interferon responses to respiratory virus infection in epithelial to mesenchymal transition Nat Microbiol 2017 2 17086 10.1038/nmicrobiol.2017.86 28581456 PMC5501188 Yang J, Tian B, Sun H, Garofalo RP, Brasier AR. Epigenetic Silencing of IRF1 dysregulates type III interferon responses to respiratory virus infection in epithelial to mesenchymal transition. Nat Microbiol. 2017;2:17086. 28581456 10.1038/nmicrobiol.2017.86 PMC5501188 43. Rho SB, Lee SH, Byun HJ, Kim BR, Lee CH. IRF-1 inhibits angiogenic activity of HPV16 E6 oncoprotein in cervical cancer. Int J Mol Sci. 2020;21(20):7622. 10.3390/ijms21207622 PMC7589982 33076322 44. Shibata K Kajiyama H Ino K Terauchi M Yamamoto E Nawa A Twist expression in patients with cervical cancer is associated with poor disease outcome Ann Oncol 2008 19 81 5 10.1093/annonc/mdm344 17925286 Shibata K, Kajiyama H, Ino K, Terauchi M, Yamamoto E, Nawa A, et al. Twist expression in patients with cervical cancer is associated with poor disease outcome. Ann Oncol. 2008;19:81–5. 17925286 10.1093/annonc/mdm344 45. Wang D Li Q Li K Xiao P Yin R Twist-related protein 1-mediated regulation of mesenchymal change contributes to the migration and invasion of cervical cancer cells Oncol Lett 2015 10 3107 12 10.3892/ol.2015.3650 26722297 PMC4665933 Wang D, Li Q, Li K, Xiao P, Yin R. Twist-related protein 1-mediated regulation of mesenchymal change contributes to the migration and invasion of cervical cancer cells. Oncol Lett. 2015;10:3107–12. 26722297 10.3892/ol.2015.3650 PMC4665933 46. Zhu K Chen L Han X Wang J Wang J Short hairpin RNA targeting Twist1 suppresses cell proliferation and improves chemosensitivity to cisplatin in HeLa human cervical cancer cells Oncol Rep 2012 27 1027 34 10.3892/or.2012.1633 22245869 PMC3583405 Zhu K, Chen L, Han X, Wang J, Wang J. Short hairpin RNA targeting Twist1 suppresses cell proliferation and improves chemosensitivity to cisplatin in HeLa human cervical cancer cells. Oncol Rep. 2012;27:1027–34. 22245869 10.3892/or.2012.1633 PMC3583405 47. Xu D Wang Y Wu J Zhang Z Chen J Xie M ECT2 ECT2/PLK1/PTEN Cell Death Dis 2021 12 162 10.1038/s41419-021-03450-z 33558466 PMC7870664 Xu D, Wang Y, Wu J, Zhang Z, Chen J, Xie M, et al. ECT2 ECT2/PLK1/PTEN 33558466 10.1038/s41419-021-03450-z PMC7870664 48. Sitarz K Czamara K Szostek S Kaczor A The impact of HPV infection on human glycogen and lipid metabolism - a review Biochim Biophys Acta Rev Cancer 2022 1877 188646 10.1016/j.bbcan.2021.188646 34763025 Sitarz K, Czamara K, Szostek S, Kaczor A. The impact of HPV infection on human glycogen and lipid metabolism - a review. Biochim Biophys Acta Rev Cancer. 2022;1877:188646. 34763025 10.1016/j.bbcan.2021.188646 49. Wang X Ha T Liu L Hu Y Kao R Kalbfleisch J TLR3 YAP1 Cell Death Differ 2018 25 966 82 10.1038/s41418-017-0036-9 29358670 PMC5943401 Wang X, Ha T, Liu L, Hu Y, Kao R, Kalbfleisch J, et al. TLR3 YAP1 29358670 10.1038/s41418-017-0036-9 PMC5943401 ",
  "metadata": {
    "Title of this paper": null,
    "Journal it was published in:": "Infectious Agents and Cancer",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12486763/"
  }
}