{
  "title": "Paper_852",
  "abstract": "pmc J Cell Mol Med J Cell Mol Med 2233 jcmmopen JCMM Journal of Cellular and Molecular Medicine 1582-1838 1582-4934 Wiley PMC12461418 PMC12461418.1 12461418 12461418 40995818 10.1111/jcmm.70781 JCMM70781 JCMM-01-2025-027.R1 1 Original Article Original Article Nomogram Based on A‐To‐I RNA Zhang Yangyang  1 Zhou Jia  2 Li Hong  3 Chai Dahai  3 Lian Bin  3 Liu Yaobang  3 Guo Li  3 Li Jinping https://orcid.org/0009-0004-0504-7980  3 ac197120@163.com   1 General Hospital of Ningxia Medical University Yinchuan Ningxia China   2 Ningxia Hui Autonomous Region People's Hospital Yinchuan Ningxia China   3 Department of Surgical Oncology General Hospital of Ningxia Medical University Yinchuan Ningxia China * Correspondence: ac197120@163.com 25 9 2025 9 2025 29 18 496923 10.1111/jcmm.v29.18 e70781 12 7 2025 04 1 2025 30 7 2025 25 09 2025 26 09 2025 26 09 2025 © 2025 The Author(s). Journal of Cellular and Molecular Medicine https://creativecommons.org/licenses/by/4.0/ This is an open access article under the terms of the http://creativecommons.org/licenses/by/4.0/ ABSTRACT Adenosine‐to‐inosine RNA editing (ATIRE) is the most common type of RNA editing in higher eukaryotes. Many RNA editing events are associated with the occurrence and development of various tumours. Currently, several ATIRE sites have been used as predictors of cancer prognosis. However, whether some of them can be used as diagnostic and prognostic markers for patients with breast cancer (BRCA) remains unknown. BRCA‐related data and RNA editing data were downloaded from the TCGA database, and the patients were randomly divided into training ( n n p ATIRE breast cancer nomogram overall survival risk score National Natural Science Foundation of China 10.13039/501100001809 82060479 Key Research and Development Program of Ningxia Hui Autonomous Region 10.13039/100016692 2021BEG03062 pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement yes pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes source-schema-version-number 2.0 cover-date September 2025 details-of-publishers-convertor Converter:WILEY_ML3GV2_TO_JATSPMC version:6.6.4 mode:remove_FC converted:25.09.2025  Y. Zhang J. Zhou H. Li Nomogram Based on A‐To‐I RNA Journal of Cellular and Molecular Medicine 29 18 2025 e70781 10.1111/jcmm.70781  Funding: 1 Introduction According to global cancer data statistics for 2020, the number of new cases of breast cancer (BRCA) is 2.26 million, thus replacing lung cancer as the most common malignant tumour worldwide and demonstrating a tendency of rejuvenation. The number of cancer‐related deaths amongst women ranks first worldwide [ 1 RNA editing refers to the biological phenomenon in which nucleotide insertion, deletion, or substitution occurs at the post‐transcriptional level, resulting in changes in the nucleotide sequence. Thus, the amino acid sequence, structure, function, or expression level of the translated protein is different from the genetic information carried by the original gene sequence. RNA editing is more tumour‐specific than gene expression [ 2 3 4 5 2 Data and Methods 2.1 Downloading and Organising Data Figure 1 N T https://portal.gdc.cancer.gov/ https://www.synapse.org/ FIGURE 1 Technical route of screening key ATIRE and constructing a prognostic model. 2.2 Constructing a Prognostic Model The createDataPartition function in the R software was used to randomly divide the samples into training ( n n The risk score for each sample in the training group was calculated using a model formula. The samples were categorised into high‐ and low‐risk groups based on the median value (cut‐off = 50%) of the risk score, and Kaplan–Meier (KM) survival curves were plotted to compare the difference in survival time between the two groups. 2.3 Verifying the Accuracy of the Model Samples were sorted according to the patients' risk scores, and a risk curve was drawn (including a risk score distribution curve graph, survival state scatter plot, and risk heat map). Independent prognostic and clinical correlation analyses were performed using univariate and multivariate Cox risk regression, incorporating the patients' clinical information (age, sex, clinical stage and tumour–node–metastasis [TNM] stage) with the risk scores obtained above. The R package ‘rms’ was used to establish a nomogram to predict the 1‐, 2‐, and 3‐year OS of patients with BRCA. Calibration, receiver operating characteristic (ROC), and decision curve analysis (DCA) were used to test the predictive efficacy of the combined model for consistency with reality. 2.4 Enrichment Analysis of Differential Genes and Functions After removing the normal tissue samples from the expression data and taking the intersection with the risk file, samples from the low‐ and high‐risk groups were extracted for differential gene analysis. The filtering conditions were set to logFC = 0.585, p q 2.5 Gene Expression Correlation and Differential Expression Analysis The correlation between RNA editing and the corresponding gene expression, the correlation between risk score and ADAR expression, and the differential expression of selected ATIRE site editing levels in tumour and normal tissues were analysed. 2.6 Cell Culture and Acquisition of Clinical Samples The normal mammary epithelial cell line MCF‐10A and BRCA cell lines MCF‐7, T47D, BT20 and MDA‐MB‐231 were purchased from the American Type Culture Collection. All cells were cultured in their respective media and incubated in a humidified incubator at 37°C with 5% CO 2 The medium components required for different cell lines are as follows: MCF‐10A cells: Basal medium +5% horse serum +20 ng/mL epidermal growth factor (EGF) + 1% penicillin/streptomycin (P/S). T47D cells: RPMI‐1640 + 10% fetal bovine serum (FBS) + 10 μg/mL insulin +1% P/S. MCF‐7, BT20 and MDA‐MB‐231 cells: DMEM complete medium +10% FBS + 1% P/S. Forty pairs of BRCA and adjacent normal tissues were collected from patients who received surgery at the Department of Surgical Oncology, General Hospital of Ningxia Medical University between October 2024 and May 2025. None of the patients had received antitumor treatment preoperatively, including radiotherapy, chemotherapy, or immunotherapy. Fresh tissues were immediately stored at −80°C after resection. This study was approved by the Medical Research Ethics Committee of the General Hospital of Ningxia Medical University, and all patients provided signed informed consent prior to surgery. 2.7 Reverse Transcription Quantitative Polymerase Chain Reaction Total RNA was extracted from BRCA cells using TRIzol reagent (Invitrogen). Subsequently, 1 μg of total RNA was reverse‐transcribed into cDNA using a HiScript III All‐in‐one RT SuperMix Perfect qPCR kit (Vazyme). Reverse Transcription Quantitative Polymerase Chain Reaction (RT‐qPCR) was performed using the SYBR Green PCR Master Mix with specifically designed primer sequences. Glyceraldehyde‐3‐phosphate dehydrogenase was set as the internal reference gene, and the relative expression level of the target gene was calculated using the 2 −∆∆Ct Primers Sequences ATXN3 Forward: 5′‐AGGGTCCAACAGATGCATCG‐3′ Reverse: 5′‐GACTTAGTGCCAGAGCCCTC‐3′ METTL2A Forward: 5′‐CTTCTGAAACCTGGCGGGAT‐3′ Reverse: 5′‐AGCGTGTCCAGTTCCTCTTG‐3′ PEX26 Forward: 5′‐GTCCTGGAGCTGTGCATTCT‐3′ Reverse: 5′‐CTCCGATAAGCAGCCCAGAG‐3′ UGGT1 Forward: 5′‐AAGGATCATTGGGCCACTGG‐3′ Reverse: 5′‐TACCAAGTCGCTTGCCACAT‐3′ GAPDH  Forward: 5′‐GTCAACGGATTTGGTCTGTATT‐3′ Reverse: 5′‐AGTCTTCTGGGTGGCAGTGAT‐3′ 2.8 Immunohistochemical Staining The paraffin‐embedded tissues were cut into 4–5‐μm thick sections. After dewaxing, hydration, and antigen repair, the endogenous peroxidase was inactivated by 3% H 2 2 2.9 Statistical Analysis The R language statistical software (version 4.4.1) was used. The Wilcoxon rank‐sum test was used for difference analysis, and Pearson correlation was used for correlation analysis. Statistical significance was set at p p 3 Results 3.1 Baseline Data of BRCA TCGA No significant differences in age, sex, grade, or TM stage were observed between the training and validation sets, except for N stage ( p 1 TABLE 1 Baseline data of BRCA in TCGA database. Covariates Type Total Test Train  p Age 0.0828 <= 65 600 (71.68%) 251 (75.15%) 349 (69.38%) > 65 237 (28.32%) 83 (24.85%) 154 (30.62%) Sex 0.4551 Female 828 (98.92%) 332 (99.4%) 496 (98.61%) Male 9 (1.08%) 2 (0.6%) 7 (1.39%) Stage 0 Stage I–II 814 (97.25%) 323 (96.71%) 491 (97.61%) Unknown 23 (2.75%) 11 (3.29%) 12 (2.39%)  T 0.4629 T1–2 715 (85.42%) 281 (84.13%) 434 (86.28%) T3–4 120 (14.34%) 52 (15.57%) 68 (13.52%) Unknown 2 (0.24%) 1 (0.3%) 1 (0.2%)  M 0.9554 M0 750 (89.61%) 299 (89.52%) 451 (89.66%) M1 16 (1.91%) 7 (2.1%) 9 (1.79%) Unknown 71 (8.48%) 28 (8.38%) 43 (8.55%)  N 0.0088 N0 393 (46.95%) 137 (41.02%) 256 (50.89%) N1–3 429 (51.25%) 189 (56.59%) 240 (47.71%) Unknown 15 (1.79%) 8 (2.4%) 7 (1.39%) 3.2 Preliminary Screening for Prognostic Related ATIRE Through univariate Cox regression analysis of the training group, 13 ATIRE sites were identified to be significantly associated with the OS of patients with BRCA ( p 2A,B 2C,D FIGURE 2 Identification of survival‐related ATIRE sites in patients with BRCA. (A) Manhattan plot showing ATIRE sites significantly associated with prognosis using p p 3.3 Model Construction and Preliminary Verification of Accuracy The samples were categorised into high‐ and low‐risk groups based on the median risk score. After analysing the survival differences between the samples, the OS of the high‐risk group in all samples and the training group was significantly lower than that of the low‐risk group ( p 3A–C 3D–F 3G,H 3I FIGURE 3 The relationship between ATIRE risk score and prognosis of patients with BRCA. (A–C) Visualised Kaplan–Meier plots of OS grouped by risk score in all patients (A), training group (B), and validation group (C). (D–F) The distribution of ATIRE risk score, survival status, and editing level of 9 ATIRE sites in all patients (D), training group (E), and validation group (F). G, H Multivariate (G) and univariate (H) Cox regression were used for independent prognostic analysis. (I) Clinical correlation analysis. 3.4 Construction and Performance Evaluation of Nomogram The ATIRE risk score and clinicopathological features including age, sex, clinical stage, and TNM stage were used to construct a nomogram (Figure 4A 4B 4C 4D FIGURE 4 Construction and evaluation of nomogram. (A) Incorporation of ATIRE risk score and clinical parameters to construct a nomogram to predict the 1‐, 2‐ and 3‐year OS of patients with BRCA. (B) The OS observed by the calibration curve at 1, 2, and 3 years was basically consistent with the prediction of the nomogram. (C, D) ROC curve (C) and DCA curve (D) were used to test the clinical benefits of risk model and nomogram. 3.5 Risk Difference and Functional Enrichment Analyses Screening for DEGs in the high‐ and low‐risk groups showed that 30 genes were upregulated in the high‐risk group and 106 genes were upregulated in the low‐risk group (Figure 5A,B 5C 5D 5E,F S1 FIGURE 5 Screening DEGs in high and low risk groups and their functional enrichment analysis. (A, B) Heat map and volcano map of DEGs in high and low risk groups. (C) GO functional enrichment analysis. (D) KEGG functional enrichment analysis. (E, F) GSEA functional enrichment analysis. 3.6 Correlation Analysis of ATIRE The degree of RNA editing of ATXN3 and ZNF554 was negatively correlated with the expression of the corresponding genes; a positive correlation was identified between the degree of RNA editing and the expression of the corresponding genes in CXorf56, PEX26 and SCAND2P, and the difference was statistically significant ( p 6A–G p 6H FIGURE 6 RNA editing correlation analysis. (A–G) Correlation analysis between RNA editing degree and corresponding gene expression level. (H) Correlation analysis between ADAR expression and risk score. 3.7 Analysis of Differences in ATIRE The expression levels of ATXN3 | chr14:92526779, LOC100130744 | chr5:14716392, METTL2A | chr17:60528133, PEX26 | chr22:18572607 and UGGT1 | chr2:128949284 in tumour tissues were significantly higher than those in normal tissues ( p 7A–I FIGURE 7 Differential expression analysis. (A–I) The differential expression of selected ATIRE sites in tumour tissues and normal tissues. 3.8 Reverse Transcription Quantitative Polymerase Chain Reaction ATIRE regulates physiological and pathological processes mainly by affecting the expression of corresponding genes [ 6 7 p 8A–D p 8E FIGURE 8 Expression levels of ATIRE in cell lines and tissues. (A–D) The expression levels of ATXN3, METTL2A, PEX26 and UGGT1 in normal breast epithelial cells and breast cancer cells were detected by RT‐qPCR. (E) The expression levels of ATXN3, METTL2A, PEX26 and UGGT1 in breast cancer tissues and adjacent paracancerous tissues were detected by RT‐qPCR. (* p p p p 3.9 Immunohistochemical Staining Immunohistochemical analysis revealed significantly higher protein expression levels of ATXN3, METTL2A, PEX26 and UGGT1 in BRCA tissues than in adjacent normal tissues (Figure 9A–D FIGURE 9 (A–D) Representative immunohistochemical staining in breast cancer and adjacent non‐tumour tissues. 4 Discussion RNA editing is an important epigenetic modification that occurs at the RNA level [ 8 9 10 11 12 13 In this study, nine ATIRE sites associated with BRCA survival were identified after Cox and Lasso regression analyses of BRCA data in the TCGA database and were used to construct a prognostic model. Survival analysis revealed that patients in the high‐risk group had worse OS, higher mortality, worse tumour T stage, and more RNA editing than those in the low‐risk group, suggesting that ATIRE may lead to poor outcomes in patients with cancer. The nomogram showed that age, tumour grade, and risk score could be independent prognostic factors for patients with BC. The ROC curve and DCA verified that the nomogram and risk model had moderate accuracy in predicting the OS of BRCA, showing a better overall net benefit than stage and age. Functional enrichment analysis revealed that the DEGs were active in immune‐related biological functions, such as immunoglobulin, immune response, and immunodeficiency. In addition, the expression level of ADAR in tumour tissues increased with elevated risk scores. The adenosine deaminases (RNA) family includes three proteins: ADAR1, ADAR2 and ADAR3 [ 14 15 16 17 18 19 20 21 ATXN3 is a deubiquitinating enzyme (DUB) that is ubiquitously expressed in various cell types, including peripheral tissues and neuronal cells, and participates in multiple cellular pathways [ 22 23 24 25 26 27 28 29 30 31 32 33 34 35 This study had some limitations. The risk prognostic model was constructed based on public databases and its clinical utility requires further validation through large‐scale prospective studies. In addition, although we experimentally verified the expression patterns of the identified ATIREs in cells and tissues, more in‐depth functional assays and in vivo experiments are required to elucidate the precise mechanisms of RNA editing in BRCA pathogenesis. 5 | Conclusion This study generated an ATIRE risk assessment model related to OS in patients with BRCA for the first time and demonstrated good predictive performance for OS in such patients. The screened RNA editing sites will be new prognostic markers for BRCA. An in‐depth exploration of how to reduce adverse RNA editing events related to tumours will help provide new ideas for individualised prognostic assessment and medication guidance for patients. The shortcomings of this study are that it is based on public databases. In addition to requiring a large amount of prospective data to verify the practical application of this model in clinical practice, functional experiments are needed to deeply explore the specific mechanisms of RNA editing in BRCA. Author Contributions  Yangyang Zhang: Jia Zhou: Hong Li: Dahai Chai: Bin Lian: Yaobang Liu: Li Guo: Jinping Li: Ethics Statement The authors have nothing to report. Consent All authors have approved the submission to this journal and the final version of the manuscript. Conflicts of Interest The authors declare no conflicts of interest. Supporting information  Appendix S1: Acknowledgements The authors have nothing to report. Data Availability Statement The data and materials that support these findings are available from the corresponding authors upon reasonable request. References 1 H. Sung J. Ferlay R. L. Siegel Global Cancer Statistics 2020: GLOBOCAN Estimates of Incidence and Mortality Worldwide for 36 Cancers in 185 Countries CA: A Cancer Journal for Clinicians 71 3 2021 209 249 33538338 10.3322/caac.21660 2 S. Ben‐Aroya E. Y. Levanon A‐To‐I RNA Editing: An Overlooked Source of Cancer Mutations Cancer Cell 33 5 2018 789 790 29763617 10.1016/j.ccell.2018.04.006 3 M. S. Breen A. Dobbyn Q. Li Global Landscape and Genetic Regulation of RNA Editing in Cortical Samples From Individuals With Schizophrenia Nature Neuroscience 22 9 2019 1402 1412 31455887 10.1038/s41593-019-0463-7 PMC6791127 4 L. M. Hjelmeland Dark Matters in AMD Genetics: Epigenetics and Stochasticity Investigative Ophthalmology & Visual Science 52 3 2011 1622 1631 21429863 10.1167/iovs.10-6765 PMC3101660 5 B. Song Y. Shiromoto M. Minakuchi K. Nishikura The Role of RNA Editing Enzyme ADAR1 in Human Disease Wiley Interdisciplinary Reviews: RNA 13 1 2021 e1665 34105255 10.1002/wrna.1665 PMC8651834 6 K. O. N. S. T. A. N. T. I. N. Licht U. T. K. A. R. S. H. Kapoor F. A. B. I. A. N. Amman A High Resolution A‐To‐I Editing Map in the Mouse Identifies Editing Events Controlled by Pre‐mRNA Splicing Genome Research 29 9 2019 1453 1463 31427386 10.1101/gr.242636.118 PMC6724681 7 U. Kapoor K. Licht F. Amman ADAR‐Deficiency Perturbs the Global Splicing Landscape in Mouse Tissues Genome Research 30 8 2020 1107 1118 32727871 10.1101/gr.256933.119 PMC7462079 8 T. Christofi A. Zaravinos RNA Editing in the Forefront of Epitranscriptomics and Human Health Journal of Translational Medicine 17 1 2019 319 31547885 10.1186/s12967-019-2071-4 PMC6757416 9 N. Paz‐Yaacov L. Bazak I. Buchumenski Elevated RNA Editing Activity Is a Major Contributor to Transcriptomic Diversity in Tumors Cell Reports 13 2 2015 267 276 26440895 10.1016/j.celrep.2015.08.080 10 Y. Pinto I. Buchumenski E. Y. Levanon E. Eisenberg Human Cancer Tissues Exhibit Reduced A‐To‐I Editing of miRNAs Coupled With Elevated Editing of Their Targets Nucleic Acids Research 46 1 2018 71 82 29165639 10.1093/nar/gkx1176 PMC5758889 11 M. Chigaev H. Yu D. C. Samuels Genomic Positional Dissection of RNA Editomes in Tumor and Normal Samples Frontiers in Genetics 10 2019 211 30949194 10.3389/fgene.2019.00211 PMC6435843 12 N. Paz E. Y. Levanon N. Amariglio Altered Adenosine‐To‐Inosine RNA Editing in Human Cancer Genome Research 17 11 2007 1586 1595 17908822 10.1101/gr.6493107 PMC2045141 13 M. J. Blow R. J. Grocock S. VAN Dongen RNA Editing of Human microRNAs Genome Biology 7 4 2006 R27 16594986 10.1186/gb-2006-7-4-r27 PMC1557993 14 J. Quin J. SEDMíK D. Vukić A. Khan L. P. Keegan M. A. O'Connell ADAR RNA Modifications, the Epitranscriptome and Innate Immunity Trends in Biochemical Sciences 46 9 2021 758 771 33736931 10.1016/j.tibs.2021.02.002 15 R. Raghava Kurup E. K. Oakes A. C. Manning P. Mukherjee P. Vadlamani H. A. Hundley RNA Binding by ADAR3 Inhibits Adenosine‐To‐Inosine Editing and Promotes Expression of Immune Response Protein MAVS Journal of Biological Chemistry 298 9 2022 102267 35850307 10.1016/j.jbc.2022.102267 PMC9418441 16 E. Oakes A. Anderson A. Cohen‐Gadol H. A. Hundley Adenosine Deaminase That Acts on RNA 3 (ADAR3) Binding to Glutamate Receptor Subunit B Pre‐mRNA Inhibits RNA Editing in Glioblastoma Journal of Biological Chemistry 292 10 2017 4326 4335 28167531 10.1074/jbc.M117.779868 PMC5354488 17 M. H. Tan Q. Li R. Shanmugam Dynamic Landscape and Regulation of RNA Editing in Mammals Nature 550 7675 2017 249 254 29022589 10.1038/nature24041 PMC5723435 18 L. Han L. Diao S. Yu The Genomic Landscape and Clinical Relevance of A‐To‐I RNA Editing in Human Cancers Cancer Cell 28 2015 515 528 26439496 10.1016/j.ccell.2015.08.013 PMC4605878 19 D. Fumagalli D. Gacquer F. ROTHé Principles Governing A‐To‐I RNA Editing in the Breast Cancer Transcriptome Cell Reports 13 2 2015 277 289 26440892 10.1016/j.celrep.2015.09.032 PMC5326813 20 E. A. Sagredo A. Blanco A. I. Sagredo ADAR1‐Mediated RNA‐Editing of 3′UTRs in Breast Cancer Biological Research 51 1 2018 36 30290838 10.1186/s40659-018-0185-4 PMC6172785 21 L.‐D. Xu M. Öhman ADAR1 Editing and Its Role in Cancer Genes 10 1 2018 12 30585209 10.3390/genes10010012 PMC6356570 22 E. HERNáNDEZ‐CARRALERO G. Quinet R. Freire ATXN3: A Multifunctional Protein Involved in the Polyglutamine Disease Spinocerebellar Ataxia Type 3 Expert Reviews in Molecular Medicine 26 2024 e19 39320846 10.1017/erm.2024.10 PMC11440613 23 H. Zou H. Chen Z. Zhou Y. Wan Z. Liu ATXN3 Promotes Breast Cancer Metastasis by Deubiquitinating KLF4 Cancer Letters 467 2019 19 28 31563563 10.1016/j.canlet.2019.09.012 24 A. Song Y. Wu W. Chu Involvement of miR‐619‐5p in Resistance to Cisplatin by Regulating ATXN3 in Oral Squamous Cell Carcinoma International Journal of Biological Sciences 17 2 2021 430 447 33613103 10.7150/ijbs.54014 PMC7893581 25 A.‐H. Chou T.‐H. Yeh Y.‐L. Kuo Polyglutamine‐Expanded Ataxin‐3 Activates Mitochondrial Apoptotic Pathway by Upregulating Bax and Downregulating Bcl‐xL Neurobiology of Disease 21 2 2006 333 345 16112867 10.1016/j.nbd.2005.07.011 26 S. Zhuang J. Xie J. Zhen The Deubiquitinating Enzyme ATXN3 Promotes the Progression of Anaplastic Thyroid Carcinoma by Stabilizing EIF5A2 Molecular and Cellular Endocrinology 537 2021 111440 34428509 10.1016/j.mce.2021.111440 27 X. Wu X. Zhang P. Liu Y. Wang Involvement of Ataxin‐3 (ATXN3) in the Malignant Progression of Pancreatic Cancer via Deubiquitinating HDAC6 Pancreatology 23 6 2023 630 641 37460341 10.1016/j.pan.2023.06.011 28 Z. Shi J. Chen X. Zhang Ataxin‐3 Promotes Testicular Cancer Cell Proliferation by Inhibiting Anti‐Oncogene PTEN Biochemical and Biophysical Research Communications 503 1 2018 391 396 29902454 10.1016/j.bbrc.2018.06.047 29 J. J. Sacco T. Y. Yau S. Darling The Deubiquitylase Ataxin‐3 Restricts PTEN Transcription in Lung Cancer Cells Oncogene 33 33 2013 4265 4272 24292675 10.1038/onc.2013.512 PMC4351423 30 S. Wang H. Li J. Liu Integrative Analysis of m3C Associated Genes Reveals METTL2A as a Potential Oncogene in Breast Cancer Journal of Translational Medicine 20 1 2022 476 36266694 10.1186/s12967-022-03683-2 PMC9583565 31 H. R. Waterham M. S. Ebberink Genetics and Molecular Basis of Human Peroxisome Biogenesis Disorders Biochimica et Biophysica Acta 1822 9 2012 1430 1441 22871920 10.1016/j.bbadis.2012.04.006 32 B. Yan L. Cao L. Gao PEX26 Functions as a Metastasis Suppressor in Colorectal Cancer Digestive Diseases and Sciences 69 1 2023 112 122 37957408 10.1007/s10620-023-08168-w 33 M. S. Dahabieh F. Huang C. Goncalves Silencing PEX26 as an Unconventional Mode to Kill Drug‐Resistant Cancer Cells and Forestall Drug Resistance Autophagy 18 3 2021 540 558 34074205 10.1080/15548627.2021.1936932 PMC9037551 34 Y. Ito Y. Takeda A. Seko M. Izumi Y. Kajihara Functional Analysis of Endoplasmic Reticulum Glucosyltransferase (UGGT): Synthetic Chemistry's Initiative in Glycobiology Seminars in Cell & Developmental Biology 41 2015 90 98 25481681 10.1016/j.semcdb.2014.11.011 35 B. Wang P. Tian Q. Sun H. Zhang L. Han B. Zhu A Novel, Effective Machine Learning‐Based RNA Editing Profile for Predicting the Prognosis of Lower‐Grade Gliomas Heliyon 9 7 2023 e18075 37483735 10.1016/j.heliyon.2023.e18075 PMC10362151 ",
  "metadata": {
    "Title of this paper": "A Novel, Effective Machine Learning‐Based RNA Editing Profile for Predicting the Prognosis of Lower‐Grade Gliomas",
    "Journal it was published in:": "Journal of Cellular and Molecular Medicine",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12461418/"
  }
}