{
  "title": "Paper_821",
  "abstract": "pmc Obstet Gynecol Sci Obstet Gynecol Sci 2215 ogs Obstetrics & Gynecology Science 2287-8572 2287-8580 Korean Society of Obstetrics and Gynecology PMC12463485 PMC12463485.1 12463485 12463485 40838281 10.5468/ogs.25123 ogs-25123 1 Review Article Reproductive Endocrinology Expression profiles of E-cadherin and N-cadherin in endometriosis and other gynecological diseases towards targeted treatment: a systematic review Adamyan Leila PhD 1 2 http://orcid.org/0000-0002-6844-3321 Pivazyan Laura MD 2 Obosyan Lilia MD 3 Kurbatova Kristina 1 Platonova Elizaveta 4 Mailova Karina MD 1 Stepanian Assia MD 5  1 Russia  2 Russia  3 Russia  4 Russia  5 USA Corresponding author: Laura Pivazyan, MD, National Medical Research Center for Obstetrics, Gynecology and Perinatology named after Academician V.I.Kulakov of the Ministry of Healthcare of the Russian Federation, Oparina, 4 Moscow 117198, Russia, E-mail: laurapivazyan98@gmail.com 9 2025 21 8 2025 68 5 497534 349 371 4 5 2025 22 6 2025 13 7 2025 01 09 2025 26 09 2025 26 09 2025 Copyright © 2025 Korean Society of Obstetrics and Gynecology 2025 https://creativecommons.org/licenses/by-nc/3.0/ Articles published in Obstet Gynecol Sci are open-access, distributed under the terms of the Creative Commons Attribution Non-Commercial License ( http://creativecommons.org/licenses/by-nc/3.0/ This systematic review aimed to summarize all available data and evaluate the roles of E-cadherin, N-cadherin, associated molecules, and signaling pathways in the pathogenesis of endometriosis. The search was conducted on PubMed, Cochrane Library, ClinicalTrials.gov Endometriosis Epithelial-mesenchymal transition E-cadherin N-cadherin pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement yes pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes Introduction Endometriosis is a gynecological disease characterized by the formation of endometrium-like tissue outside the uterus and affects approximately 10% of reproductive-age women [ 1 2 3 5 Despite extensive research, the causes of endometriosis remain unclear owing to its multifactorial nature [ 6 7 8 10 Although benign, endometriosis exhibits neoplastic traits, such as proliferation, apoptosis resistance, angiogenesis, invasiveness, and oncogenic mutations in KRAS, PIK3CA, ARID1A, and CTNNB1 [ 11 14 15 16 EMT is thought to facilitate endometriotic cell implantation and disease progression [ 17 18 E-cadherin, a transmembrane protein encoded by cadherin 1 (CDH1), is a calcium-dependent adhesion molecule that maintains epithelial cell-cell adhesion and polarity [ 19 20 Fig. 1 20 21 22 23 24 25 26 27 28 29 30 31 25 32 33 Several molecules are associated with E-cadherin during the EMT. A hallmark of this process is the switch from E-cadherin to N-cadherin, which enhances cellular mobility and invasiveness [ 34 35 36 38 39 36 40 46 47 48 Dysregulation of E-cadherin in endometriosis underscores its dual diagnostic and therapeutic significance [ 31 34 36 37 39 42 49 53 54 Methods This systematic review was registered in the National Institute for Health Research International Prospective Register of Systematic Reviews (protocol and registration number: CRD42024561057) and was conducted in accordance with the Preferred Reporting Items for Systematic Reviews and Meta-Analyses 2020 (PRISMA) guidelines. Institutional Review Board approval was not required because the present study was a review [ 55 1. Types of studies Case-controlled, cohort, and cross-sectional clinical trials published in English were included. Case reports, preclinical studies or reviews, opinion articles, and studies published as abstracts were excluded. Proceedings of scientific meetings and abstracts were also excluded. 2. Types of participants The participants were non-pregnant reproductive-age women with laparoscopically and histologically confirmed endometriosis (endometriosis group) and those with laparoscopic exclusion of endometriosis and histological confirmation of benign/malignant gynecological diseases or exclusion of gynecological pathology (comparison group). 3. Types of interventions The inclusion criteria for the present systematic review were studies reporting original data concerning the evaluation of E-cadherin expression in the ectopic and eutopic endometrium of patients with endometriosis compared to that in the endometrium of patients without endometriosis (i.e., healthy women or patients with other benign/malignant gynecological diseases). 4. Types of outcomes The primary outcomes were aimed at assessing the levels of E-cadherin protein or messenger RNA (mRNA) expression in the ectopic and eutopic endometrium of patients with and without endometriosis. The secondary outcomes evaluated the level of factors associated with E-cadherin: N-cadherin, ZEB1 and ZEB2, TWIST, vimentin, SNAIL, SLUG, MMP-9, β-catenin protein or mRNA expression, and the level of HIF-1α protein expression in ectopic and eutopic endometrium of patients with and without endometriosis. Moreover, the correlation of E-cadherin concentration with age, endometrioma size, severity of endometriosis symptoms, and American Society for Reproductive Medicine (ASRM) stage of endometriosis was investigated with respect to the secondary outcomes. 5. Study selection An electronic database search was conducted on PubMed, Cochrane Library, ClinicalTrials.gov No restrictions or search filters (publication status, type of article, or language of publication) were applied to verify all potentially relevant studies. Regarding the PubMed electronic database search strategy, the following combinations of keywords were used in the advanced search builder in PubMed: (endometriosis) AND (epithelial-mesenchymal transition) AND (E-cadherin). No filters or limits were applied. As for the Cochrane Library electronic database search strategy, the search combinations were as follows: (endometriosis) AND (epithelial-mesenchymal transition) AND (E-cadherin). No filters or limits were applied. A search was also conducted in the ClinicalTrials.gov Additionally, a search was conducted using MeSH terms in PubMed (“Endometriosis”[Mesh]) AND (“Epithelial-Mesenchymal Transition”[Mesh]) AND (“Cadherins”[Mesh]) and in the Cochrane Library (MeSH descriptor: [Endometriosis] explode all trees and with qualifier(s): [etiology-ET, pathology-PT]). The search was conducted independently by three investigators (L.O., K.K., and E.P.). The search results were saved in a reference manager (Zotero version 6.0.8; Corporation for Digital Scholarship, Vienna, VA, USA). After searching, all articles were reviewed based on their titles and abstracts. The full text of each potentially relevant study was obtained and independently assessed for inclusion by the authors. Additionally, a manual search of the references of the articles was performed to identify additional studies of interest. Any disagreements regarding the inclusion or exclusion of preselected studies and any other disagreements during the review process were resolved with the help of a fourth author (L.P.). 6. Quality assessment A risk-of-bias assessment was performed for each of the included studies using Cochrane Collaboration tools and the Cochrane Handbook for Systematic Reviews of Interventions [ 56 Following the Cochrane Handbook for Systematic Reviews of Interventions, risk of bias in non-randomised studies-of interventions (ROBINS I) was used for nonrandomized studies. Additionally, these tools were used to assess the risk of bias arising from reporting bias due to missing synthesis results [ 57 Results Fig. 2 Seventy reports did not meet the inclusion criteria due to reasons detailed in Fig. 2 Supplementary Table 1 Additionally, 1,134 articles were found in the references of 22 articles included in the qualitative analyses. However, none of these studies were included in the systematic review because most were duplicates of articles found earlier or assessed other outcomes. Therefore, 23 studies were retained for qualitative synthesis [ 17 34 37 40 42 49 53 58 67 Table 1 Table 2 Table 3 Three reviewers (L.O., K.K., and E.P.) independently assessed the risk of bias in each of the included studies using ROBINS I for nonrandomized studies, in accordance with the Cochrane Handbook for Systematic Reviews of Interventions. Any disagreements were resolved through discussion with the fourth author (L.P.). The visualization tools were created using the risk of bias visualization app [ 64 Fig. 3 1. E-cadherin expression E-cadherin levels were assessed using two complementary approaches: immunohistochemical analysis of E-cadherin protein expression and quantitative measurement of E-cadherin mRNA expression. The experimental group comprised 977 samples of patients with endometriosis, whereas the comparison group consisted of patients without endometriosis, including samples from the healthy comparison group (n=205) and patients with benign gynecological diseases (n=73), unexplained (n=98) or tubal infertility (n=34), and malignant diseases such as cervical intraepithelial neoplasia (n=21), endometrial (n=32), and ovarian carcinoma (n=36). 1) Endometriosis vs. healthy comparison group ① E-cadherin protein expression The difference in E-cadherin protein expression between patients with endometriosis and the comparison group was evaluated in nine studies [ 34 36 41 52 60 62 64 67 P 36 41 52 62 64 67 34 35 P P 35 34 34 52 67 P Notably, Matsuzaki et al. [ 60 P P ② E-cadherin mRNA expression The difference in E-cadherin mRNA expression between patients with endometriosis and the comparison group was evaluated in three studies; however, the outcomes were controversial [ 41 60 63 41 P 63 P 60 2) Endometriosis vs. uterine fibroids ① E-cadherin protein expression Differences in E-cadherin protein expression between patients with endometriosis and patients with uterine fibroids were evaluated in three studies [ 37 50 60 50 60 ② E-cadherin mRNA expression E-cadherin mRNA expression in patients with endometriosis and uterine fibroids was assessed in two studies [ 53 60 53 P 60 53 P 3) Endometriosis vs. other benign disease (serous and mucinous cystadenoma of the ovary) Four studies compared E-cadherin expression in endometriosis and benign gynecological conditions [ 35 39 49 58 58 39 P 49 49 35 P 49 35 4) Endometriosis vs. malignant diseases ① Endometriosis vs. endometrial carcinoma Two studies reported conflicting results regarding E-cadherin expression in endometriosis and endometrial carcinoma [ 40 64 40 P 64 P ② Endometriosis vs. ovarian carcinoma Similarly, discordant results emerged from two studies comparing endometriosis and ovarian carcinoma [ 40 51 40 P 51 P ③ Endometriosis vs. cervical intraepithelial neoplasia The difference in E-cadherin protein expression between patients with endometriosis and cervical intraepithelial neoplasia was evaluated by Meng et al. [ 37 P 5) Endometriosis vs. unexplained infertility ① E-cadherin protein expression Two studies assessed E-cadherin protein expression in patients with endometriosis and unexplained infertility [ 42 60 42 P 60 P P ② E-cadherin mRNA expression E-cadherin mRNA expression in patients with endometriosis and unexplained infertility was assessed in four studies [ 17 42 60 65 P 17 65 60 42 P ③ Endometriosis vs. tubal infertility The difference in E-cadherin protein expression between patients with endometriosis and tubal infertility was investigated in a study by Liu et al. [ 59 P P 2. N-cadherin expression 1) N-cadherin protein expression Differences in N-cadherin protein expression between patients with and without endometriosis were evaluated in seven studies [ 34 39 41 42 49 62 67 39 41 42 49 62 However, contradictory findings emerged: Xiong et al. [ 67 P 34 P Discrepancies also existed in ectopic-eutopic comparisons; Xiong et al. [ 67 P 34 2) N-cadherin mRNA expression The difference in N-cadherin mRNA expression between patients with and without endometriosis was evaluated in three studies, all of which demonstrated significantly increased N-cadherin mRNA levels in both ectopic and eutopic samples from patients with endometriosis ( P 41 42 65 Expression patterns of β-catenin, ZEB1, ZEB2, TWIST, vimentin, SNAIL, SLUG, MMP-9, and HIF-1α are detailed in the supporting information ( Supplementary Material 1 Conclusion This review evaluated the expression patterns of E-cadherin, N-cadherin, β-catenin, and other EMT markers across endometriosis, gynecological diseases, and healthy controls using immunohistochemical, Western blot, and polymerase chain reaction (PCR) analyses of ectopic and eutopic endometrium. We identified significant correlations between E-cadherin expression and clinical parameters including age, endometrioma size, symptom severity, and ASRM stage ( Table 1 17 34 36 39 41 42 49 50 52 53 58 60 62 64 65 67 34 35 37 42 49 52 53 59 67 39 51 64 65 67 34 41 42 49 52 62 65 67 34 41 58 17 42 36 37 41 59 62 65 67 17 62 65 17 62 39 64 36 40 59 67 40 51 64 Reduced E-cadherin expression in ectopic lesions supports EMT, representing an intermediate state between benign (high E-cadherin expression) and malignant conditions (low E-cadherin expression) [ 24 68 70 43 45 71 73 74 While systematic reviews on this subject are lacking, Yin et al. [ 13 75 76 77 78 Decreased E-cadherin expression in endometriosis highlights its therapeutic potential as a monoclonal antibody (mAbs) activates E-cadherin to suppress metastasis in breast cancer models. These antibodies increase cell adhesion and reduce cell movement, thereby blocking tumor invasion, intra-and extravasation, and the ability of cancer cells to establish colonies and form distant metastases. The activation of E-cadherin by mAbs may induce tumor cell apoptosis via changes in the adhesion and activation of signaling pathways, including the Hippo and PI3K/AKT pathways [ 79 80 32 14 66 81 83 84 85 86 The strength of our study is the comprehensive analysis of all available data assessing EMT processes and cadherin-associated pathways in the pathogenesis of endometriosis. We conducted the first systematic review of all currently available data describing the impaired expression of E-cadherin in both the eutopic endometrium and ectopic lesions of patients with endometriosis, in comparison with the level of E-cadherin expression in the endometrium of patients without endometriosis (healthy comparison group and patients with other benign or malignant gynecological diseases). Unlike previous reviews that primarily focused on individual biomarkers or specific signaling pathways, our systematic review comprehensively integrated data on E-cadherin, N-cadherin, β-catenin, and associated molecules across various gynecological conditions. This holistic approach provides a broader understanding of the molecular mechanisms underlying the progression of endometriosis and highlights potential diagnostic and therapeutic targets. The practical significance of this study lies in the potential use of cadherins and their associated factors as biomarkers for early and non-invasive diagnosis of endometriosis, which could accelerate diagnosis and improve disease prognosis. Moreover, the findings of this review emphasize the need for targeted therapy aimed at modulating EMT processes in endometriotic lesions. However, this study has some limitations. First, studies comparing the expression of E-cadherin and other molecules in patients with endometriosis and healthy individuals are currently insufficient. Therefore, in our study, we considered the differences in molecular expression between patients with benign and malignant gynecological conditions. To gain a comprehensive understanding of the role of E-cadherin in the pathogenesis of endometrial diseases, studies that include patients with benign endometrial diseases are necessary. In addition, some of the included articles had a critical and serious risk of bias owing to their low quality. Moreover, some studies assessed only mRNA levels, whereas others evaluated only the protein expression of the investigated biomarkers. Several articles failed to provide numerical values for mRNA or protein expression of the assessed molecules, or omitted specifications of benign diseases affecting the comparison group patients. In addition, the methods of diagnostic verification, collection of biopsy samples, and evaluation of the expression of the investigating molecules were different in the included papers. Furthermore, some authors have not provided such information, which makes it difficult to draw conclusions regarding the quality of the studies under review, as indicated in Tables 2 3 The inconsistent reports on E-cadherin across studies likely reflect methodological and biological variables. Immunohistochemistry (IHC)-based protein detection captures functional adhesion loss more reliably than mRNA analysis, which can be influenced by non-epithelial cells. Furthermore, the menstrual cycle phase and endometriosis subtype (e.g., deep infiltrating endometriosis vs. peritoneal) critically affected expression. Future studies should standardize sampling protocols and stratify analyses based on these factors. The variability in E-cadherin measurements may stem from unaccounted cycle phases, subtype heterogeneity, or technical differences (IHC antibodies and PCR primers). Although we excluded studies without histological confirmation, confounding factors precluded definitive quantitative comparisons. Based on the above limitations, some of the results obtained are contradictory. Implications for future research may include conducting studies with larger numbers of participants, taking into account the form and stage of endometriosis, the phase of the menstrual cycle, as well as the treatment of patients, assessing both mRNA and protein expression in eutopic and ectopic endometrium of patients with endometriosis, and comparing the results with their levels in healthy fertile women of reproductive age without any concomitant pathology. Conducting a comprehensive meta-analysis of data from these studies is necessary to objectively identify differences in the expression levels of these molecules in the patient groups under investigation. Moreover, studies measuring the E-cadherin concentration in the peripheral blood of patients are required for the possible use of E-cadherin as a non-invasive biomarker of endometriosis. Conducting experimental studies on E-cadherin reactivation in endometrioid cells is also necessary. It is important to test existing drugs that target tumor cells in endometriosis models and to search for new molecules that can help restore E-cadherin function. These drugs may reduce the risk of endometriotic tissue spread and possibly slow its progression. It is equally important to work towards improving the quality of research on endometriosis within the framework of evidence-based medicine, which includes the development of more appropriate animal models, the adoption of integrative and multidisciplinary research approaches, adherence to rigorous publication and reporting standards, and the standardization of surgical techniques. The aim of numerous scientific studies is to develop a personalized multidisciplinary approach for the treatment of endometriosis that integrates surgical intervention, including the management of adhesions, hormonal therapy, and rehabilitation programs designed to restore the lost quality of life of patients [ 87 This systematic review comprehensively evaluated the role of cadherins and their associated molecular pathways in the pathogenesis of endometriosis. The dysregulation of E-cadherin and N-cadherin expression provides robust experimental support for the transplantation theory of endometriosis development and progression. These findings underscore the therapeutic potential of targeting cadherin-mediated signaling pathways to develop novel treatment strategies for this condition.  Conflicts of interest The authors have no relevant financial or non-financial interests to disclose.  Ethical approval Not applicable.  Patient consent Not applicable.  Funding information The authors declare that no funds, grants, or other support were received during the preparation of this manuscript. Supplementary Information Supplementary Material 1. The difference in β-catenin, ZEB1 and ZEB2, TWIST, vimentin, SNAIL, SLUG, matrix metalloproteinases-9 (MMP-9), and hypoxia-inducible factor-1α (HIF-1α) expression between patients with and without endometriosis Supplementary Table 1. The list of excluded studies References 1 Becker CM Bokor A Heikinheimo O Horne A Jansen F Kiesel L ESHRE guideline: endometriosis Hum Reprod Open 2022 2022 hoac009 35350465 10.1093/hropen/hoac009 PMC8951218 2 WHO Endometriosis [Internet] Geneva WHO c2023 [cited 2025 Jun 13]. Available from: https://www.who.int/news-room/fact-sheets/detail/endometriosis 3 Adamyan L Pivazyan L Krylova E Tarlakyan V Murvatova K Iron metabolism markers in peritoneal fluid of patients with endometriosis: systematic review and meta-analysis J Endometr Uterine Disord 2024 5 100061 4 Mariadas H Chen JH Chen KH The molecular and cellular mechanisms of endometriosis: from basic pathophysiology to clinical implications Int J Mol Sci 2025 26 2458 40141102 10.3390/ijms26062458 PMC11941934 5 Hong J Yi KW What is the link between endometriosis and adiposity? Obstet Gynecol Sci 2022 65 227 33 35081675 10.5468/ogs.21343 PMC9119730 6 Adamyan L Pivazyan L Murvatova K Tarlakyan V Zarova E Stepanian A Association between the level of TGF-β expression and endometriosis: a systematic review and meta-analysis J Endometr Uterine Disord 2025 9 100100 7 Koninckx PR Ussia A Adamyan L Tahlak M Keckstein J Wattiez A The epidemiology of endometriosis is poorly known as the pathophysiology and diagnosis are unclear Best Pract Res Clin Obstet Gynaecol 2021 71 14 26 32978068 10.1016/j.bpobgyn.2020.08.005 8 Koninckx PR Ussia A Adamyan L Wattiez A Gomel V Martin DC Pathogenesis of endometriosis: the genetic/epigenetic theory Fertil Steril 2019 111 327 40 30527836 10.1016/j.fertnstert.2018.10.013 9 Lee HJ Yoon SH Lee JH Chung YJ Park SY Kim SW Clinical evaluation and management of endometriosis: 2024 guideline for Korean patients from the Korean Society of Endometriosis Obstet Gynecol Sci 2025 68 43 58 39659058 10.5468/ogs.24242 PMC11788693 10 Adamyan L Pivazyan L Krylova E Kurbatova K Tarlakyan V Stepanian A Hyaluronic acid in the prevention of adhesions after gynecological surgery: systematic review and meta-analysis J Endometr Uterine Disord 2024 6 100070 11 Adilbayeva A Kunz J Pathogenesis of endometriosis and endometriosis-associated cancers Int J Mol Sci 2024 25 7624 39062866 10.3390/ijms25147624 PMC11277188 12 Ioannidou A Sakellariou M Sarli V Panagopoulos P Machairiotis N New evidence about malignant transformation of endometriosis-a systematic review J Clin Med 2025 14 2975 40364006 10.3390/jcm14092975 PMC12072307 13 Yin W Li X Liu P Li Y Liu J Yu S Digestive system deep infiltrating endometriosis: what do we know J Cell Mol Med 2023 27 3649 61 37632165 10.1111/jcmm.17921 PMC10718155 14 Guo SW Cancer-associated mutations in endometriosis: shedding light on the pathogenesis and pathophysiology Hum Reprod Update 2020 26 423 49 32154564 10.1093/humupd/dmz047 15 Fontana R Mestre-Farrera A Yang J Update on epithelial-mesenchymal plasticity in cancer progression Annu Rev Pathol 2024 19 133 56 37758242 10.1146/annurev-pathmechdis-051222-122423 PMC10872224 16 Xiong W Jin J Liu Y METTL3-dependent m6A modification facilitates decreased endometrial decidualization via attenuation of MET in endometriosis Reproduction 2024 168 e230336 38781072 10.1530/REP-23-0336 17 Proestling K Birner P Gamperl S Nirtl N Marton E Yerlikaya G Enhanced epithelial to mesenchymal transition (EMT) and upregulated MYC in ectopic lesions contribute independently to endometriosis Reprod Biol Endocrinol 2015 13 75 26198055 10.1186/s12958-015-0063-7 PMC4511248 18 Aban CE Lombardi A Neiman G Biani MC La Greca A Waisman A Downregulation of E-cadherin in pluripotent stem cells triggers partial EMT Sci Rep 2021 11 2048 33479502 10.1038/s41598-021-81735-1 PMC7820496 19 Bidot S Li X E-cadherin [Internet] Bingham Farms, MI PathologyOutlines c2021 [cited 2025 Jun 13]. Available from: https://www.pathologyoutlines.com/topic/stainsecadherin.html 20 Jayaraman M En N VL Harikrishnan V A retrospective study on the expression of E-cadherin in endometrial carcinoma Cureus 2024 16 e70767 39493171 10.7759/cureus.70767 PMC11531303 21 cdh1 cadherin 1, type 1, E-cadherin (epithelial) [Danio rerio (zebrafish)] [Internet] Bethesda, MD National Library of Medicine c2025 [cited 2025 Jun 13]. Available from: https://www.ncbi.nlm.nih.gov/gene/114424 22 Morales-Camilo N Liu J Ramírez MJ Canales-Salgado P Alegría JJ Liu X Alternative molecular mechanisms for force transmission at adherens junctions via β-catenin-vinculin interaction Nat Commun 2024 15 5608 38969637 10.1038/s41467-024-49850-5 PMC11226457 23 Callaway DJE Nicholl ID Shi B Reyes G Farago B Bu Z Nanoscale dynamics of the cadherin-catenin complex bound to vinculin revealed by neutron spin echo spectroscopy Proc Natl Acad Sci U S A 2024 121 e2408459121 39298480 10.1073/pnas.2408459121 PMC11441495 24 Ntzeros K Voros C Mavrogianni D Kathopoulis N Kypriotis K Varthaliti A Expression of E-CADHERIN and miR-200b in different forms of endometriosis Biomedicines 2025 13 524 40002936 10.3390/biomedicines13020524 PMC11852903 25 National Center for Biotechnology Information Signaling pathways [Internet] Bethesda, MD National Library of Medicine c2019 [cited 2025 Jun 13]. Available from: https://pubchem.ncbi.nlm.nih.gov/pathway/Reactome:R-DRE-162582 26 Jia Q Wang H Bi B Han X Jia Y Zhang L Amphiregulin downregulates E-cadherin expression by activating YAP/Egr-1/slug signaling in SKOV3 human ovarian cancer cells Reprod Sci 2025 32 404 16 39138796 10.1007/s43032-024-01673-x 27 Bianchi F Sommariva M Cornaghi LB Denti L Nava A Arnaboldi F Mechanical cues, E-cadherin expression and cell “sociality” are crucial crossroads in determining pancreatic ductal adenocarcinoma cells behavior Cells 2022 11 1318 35455997 10.3390/cells11081318 PMC9028873 28 Yim IS Laronde DM Biomarkers of epithelial-mesenchymal transition: E-cadherin and beta-catenin in malignant transformation of oral lesions Can J Dent Hyg 2024 58 111 9 38974823 PMC11223640 29 Samart P Rojanasakul Y Issaragrisil S Luanpitpong S A novel E-cadherin/SOX9 axis regulates cancer stem cells in multiple myeloma by activating Akt and MAPK pathways Exp Hematol Oncol 2022 11 41 35831838 10.1186/s40164-022-00294-x PMC9277902 30 Yurci A Zaman F Sarı U Deveci E E-cadherin and NF-κB expression in the vagina after ovarian ischemia and reperfusion Acta Cir Bras 2024 39 e391724 38629650 10.1590/acb391724 PMC11020660 31 Schoeman EM Bringans S Peters K Casey T Andronis C Chen L Identification of plasma protein biomarkers for endometriosis and the development of statistical models for disease diagnosis Hum Reprod 2025 40 270 9 39719050 10.1093/humrep/deae278 PMC11788222 32 Lialios P Alimperti S Role of E-cadherin in epithelial barrier dysfunction: implications for bacterial infection, inflammation, and disease pathogenesis Front Cell Infect Microbiol 2025 15 1506636 40007608 10.3389/fcimb.2025.1506636 PMC11850337 33 Zhang J Fu L Wang H Yonemura A Semba T Yasuda-Yoshihara N RAC1-mediated integrin alpha-6 expression in E-cadherin-deficient gastric cancer cells promotes interactions with the stroma and peritoneal dissemination Cancer Lett 2024 591 216901 38641311 10.1016/j.canlet.2024.216901 34 Yu Q Wang J Li T Guo X Ding S Che X Recepteur d’origine nantais contributes to the development of endometriosis via promoting epithelial-mesenchymal transition of a endometrial epithelial cells J Cell Mol Med 2021 25 1601 12 33410267 10.1111/jcmm.16261 PMC7875913 35 Sancakli Usta C Turan G Bulbul CB Usta A Adali E Differential expression of Oct-4, CD44, and E-cadherin in eutopic and ectopic endometrium in ovarian endometriomas and their correlations with clinicopathological variables Reprod Biol Endocrinol 2020 18 116 33218351 10.1186/s12958-020-00673-1 PMC7678309 36 Liu H He H Zhang Z Wang L Zhang L Liu Y Upregulation of the long noncoding RNA UBOX5 antisense RNA 1 (UBOX5-AS1) under hypoxic conditions promotes epithelial-mesenchymal transition in endometriosis Ann Transl Med 2021 9 790 34268403 10.21037/atm-20-4546 PMC8246194 37 Meng X Liu J Wang H Chen P Wang D MicroRNA-126-5p downregulates BCAR3 expression to promote cell migration and invasion in endometriosis Mol Cell Endocrinol 2019 494 110486 31233772 10.1016/j.mce.2019.110486 38 Emile MH Emile SH El-Karef AA Ebrahim MA Mohammed IE Ibrahim DA Association between the expression of epithelial-mesenchymal transition (EMT)-related markers and oncologic outcomes of colorectal cancer Updates Surg 2024 76 2181 91 38762631 10.1007/s13304-024-01865-9 PMC11541317 39 Wu T Zhang R Jiang Q Li Z Wu R Expression of cellular adherent and invasive molecules in recurrent ovarian endometriosis J Int Med Res 2020a 48 300060520971993 33249961 10.1177/0300060520971993 PMC7708720 40 Markov D Poryazova E Raycheva R Markov G Expression of HIF-1α, Ki67, SMA and E-cadherin in endometriosis, endometrial and ovarian carcinoma Folia Med (Plovdiv) 2024 66 97 103 38426471 10.3897/folmed.66.e112757 41 Lin D Huang Q Wu R Dai S Huang Z Ren L Long non-coding RNA AFAP1-AS1 promoting epithelial-mesenchymal transition of endometriosis is correlated with transcription factor ZEB1 Am J Reprod Immunol 2019 81 e13074 30506548 10.1111/aji.13074 42 Li J Ma J Fei X Zhang T Zhou J Lin J Roles of cell migration and invasion mediated by Twist in endometriosis J Obstet Gynaecol Res 2019 45 1488 96 31250947 10.1111/jog.14001 43 Wu H Chen Y Lin H Xu Y Guo Z Li Z The clinical significance of SNAIL, TWIST, and E-cadherin expression in gastric mesentery tumor deposits of advanced gastric cancer Indian J Pathol Microbiol 2024 67 21 8 38358184 10.4103/ijpm.ijpm_659_22 44 Sterneck E Poria DK Balamurugan K Slug and E-cadherin: stealth accomplices? Front Mol Biosci 2020 7 138 32760736 10.3389/fmolb.2020.00138 PMC7371942 45 Belsamma LVS Muraleedharan A Jayaram DR Waidha K Jagadeeshan S Sinay R Abstract PO5-06-07: unravelling the role of PKC-eta in modulating the Hippo pathway: a novel therapeutic strategy for triple-negative breast cancer metastasis Cancer Res 2024 84 PO5-06-07 46 Tahara S Nojima S Takashima T Okuzaki D Morii E Mesothelin promotes the migration of endometrioid carcinoma and is associated with the MELF pattern Pathol Res Pract 2024 262 155562 39182448 10.1016/j.prp.2024.155562 47 Tripathi K Maurya N Goel A Singhai A Garg M Immunohistochemical expressions of EMT markers in pan-RAS-pERK1/2-positive tumors improve diagnosis and prognosis assessment of non-muscle invasive bladder cancer and muscle invasive bladder cancer patients Mol Cell Biochem 2023 478 1169 90 36239855 10.1007/s11010-022-04579-x 48 Wang W Jin J Zhou Z Wang Y Min K Zuo X Snail inhibits metastasis via regulation of E-cadherin and is associated with prognosis in colorectal cancer Oncol Lett 2023 25 271 37216162 10.3892/ol.2023.13857 PMC10193364 49 Liu D Yang N Liang Y Chen M Yang F Liu L Increased expression of epithelial cell adhesion molecule and its possible role in epithelial-mesenchymal transition in endometriosis J Obstet Gynaecol Res 2020 46 2066 75 32715572 10.1111/jog.14401 50 Biyik I Kalkan U Simsek S The deep infiltrating endometriosis tissue has lower T-cadherin, E-cadherin, progesterone receptor and oestrogen receptor than endometrioma tissue Taiwan J Obstet Gynecol 2021 60 1059 65 34794738 10.1016/j.tjog.2021.09.017 51 Păvăleanu I Lozneanu L Balan RA Giuşcă SE Avădănei ER Căruntu ID Insights into molecular pathways of endometriosis and endometriosis-related ovarian carcinoma Rom J Morphol Embryol 2020 61 739 49 33817715 10.47162/RJME.61.3.12 PMC8112801 52 Wu J Li X Huang H Xia X Zhang M Fang X TET1 may contribute to hypoxia-induced epithelial to mesenchymal transition of endometrial epithelial cells in endometriosis PeerJ 2020b 8 e9950 32983650 10.7717/peerj.9950 PMC7500323 53 Zubrzycka A Migdalska-Sęk M Jędrzejczyk S Brzeziańska-Lasota E Assessment of BMP7, SMAD4, and CDH1 expression profile and regulatory miRNA-542-3p in eutopic and ectopic endometrium of women with endometriosis Int J Mol Sci 2023 24 6637 37047609 10.3390/ijms24076637 PMC10095043 54 Vercellini P Somigliana E Chapron C Petraglia F Griffith LG Mueller MD “I’m looking through you”: what consumers and manufacturers need to know about non-invasive diagnostic tests for endometriosis” J Endometr Uterine Disord 2023 2 100031 55 Page MJ McKenzie JE Bossuyt PM Boutron I Hoffmann TC Mulrow CD The PRISMA 2020 statement: an updated guideline for reporting systematic reviews BMJ 2021 372 n71 33782057 10.1136/bmj.n71 PMC8005924 56 Higgins JPT Thomas J Chandler J Cumpston M Li T Page MJ Cochrane handbook for systematic reviews of interventions [Internet] London Cochrane c2023 [cited 2025 Jun 13]. Available from: https://training.cochrane.org/handbook 57 Sterne JA Hernán MA Reeves BC Savović J Berkman ND Viswanathan M ROBINS-I: a tool for assessing risk of bias in non-randomised studies of interventions BMJ 2016 355 i4919 27733354 10.1136/bmj.i4919 PMC5062054 58 Furuya M Masuda H Hara K Uchida H Sato K Sato S ZEB1 expression is a potential indicator of invasive endometriosis Acta Obstet Gynecol Scand 2017 96 1128 35 28597474 10.1111/aogs.13179 59 Liu H Du Y Zhang Z Lv L Xiong W Zhang L Autophagy contributes to hypoxia-induced epithelial to mesenchymal transition of endometrial epithelial cells in endometriosis Biol Reprod 2018 99 968 81 29860279 10.1093/biolre/ioy128 PMC6297317 60 Matsuzaki S Darcha C Maleysson E Canis M Mage G Impaired down-regulation of E-cadherin and beta-catenin protein expression in endometrial epithelial cells in the mid-secretory endometrium of infertile patients with endometriosis J Clin Endocrinol Metab 2010 95 3437 45 20410224 10.1210/jc.2009-2713 61 Matsuzaki S Darcha C Pouly JL Canis M Effects of matrix stiffness on epithelial to mesenchymal transition-like processes of endometrial epithelial cells: implications for the pathogenesis of endometriosis Sci Rep 2017 7 44616 28303918 10.1038/srep44616 PMC5356009 62 Qi S Yan L Liu Z Mu YL Li M Zhao X Melatonin inhibits 17β-estradiol-induced migration, invasion and epithelial-mesenchymal transition in normal and endometriotic endometrial epithelial cells Reprod Biol Endocrinol 2018 16 62 29935526 10.1186/s12958-018-0375-5 PMC6015458 63 Saare M Rekker K Laisk-Podar T Sõritsa D Roost AM Simm J High-throughput sequencing approach uncovers the miRNome of peritoneal endometriotic lesions and adjacent healthy tissues PLoS One 2014 9 e112630 25386850 10.1371/journal.pone.0112630 PMC4227690 64 Shaco-Levy R Sharabi S Benharroch D Piura B Sion-Vardy N Matrix metalloproteinases 2 and 9, E-cadherin, and beta-catenin expression in endometriosis, low-grade endometrial carcinoma and non-neoplastic eutopic endometrium Eur J Obstet Gynecol Reprod Biol 2008 139 226 32 18295959 10.1016/j.ejogrb.2008.01.004 65 Wang C Zhang J Fok KL Tsang LL Ye M Liu J CD147 induces epithelial-to-mesenchymal transition by disassembling cellular apoptosis susceptibility protein/E-cadherin/β-catenin complex in human endometriosis Am J Pathol 2018 188 1597 607 29630856 10.1016/j.ajpath.2018.03.004 66 Wu Y Starzinski-Powitz A Guo SW Trichostatin A, a histone deacetylase inhibitor, attenuates invasiveness and reactivates E-cadherin expression in immortalized endometriotic cells Reprod Sci 2007 14 374 82 17644810 10.1177/1933719107302913 67 Xiong Y Liu Y Xiong W Zhang L Liu H Du Y Hypoxia-inducible factor 1α-induced epithelial-mesenchymal transition of endometrial epithelial cells may contribute to the development of endometriosis Hum Reprod 2016 31 1327 38 27094478 10.1093/humrep/dew081 68 Busuioc C Birla RD Ultimescu F Duţulescu S Panaitescu E Berindan-Neagoe I Abberant immunohistochemical expression of OCT3/4 and EMT related markers, vimentin and E-cadherin, is correlated with adverse histopathological features in colorectal adenocarcinoma Chirurgia (Bucur) 2022 117 544 55 36318684 10.21614/chirurgia.2782 69 Li Y Zhang T Qin S Wang R Li Y Zhou Z Effects of UPF1 expression on EMT process by targeting E-cadherin, N-cadherin, vimentin and Twist in a hepatocellular carcinoma cell line Mol Med Rep 2019 19 2137 43 30628676 10.3892/mmr.2019.9838 PMC6390072 70 Said R Hernández-Losa J Derouiche A Moline T de Haro RSL Zouari S Correlation between E-cadherin/β-catenin, vimentin expression, clinicopathologic features and drug resistance prediction in naïve prostate cancer: a molecular and clinical study Genesis 2024 62 e23543 37649322 10.1002/dvg.23543 71 Su W Kochen Rossi J Nuevo-Tapioles C Chen T Kawaler E Branco C UPF1 deficiency enhances mitochondrial ROS which promotes an immunosuppressive microenvironment in pancreatic ductal adenocarcinoma Proc Natl Acad Sci U S A 2024 121 e2401996121 40591563 10.1073/pnas.2401996121 PMC11331118 72 Qiu Y Liu Y Li WH Zhang HQ Tian XX Fang WG P2Y2 receptor promotes the migration and invasion of breast cancer cells via EMT-related genes snail and E-cadherin Oncol Rep 2024 52 111 29115551 10.3892/or.2017.6081 PMC5783596 73 Li Q Hong Y Chen J Zhou X Tian X Yu Y Hypoxia-induced HIF-1α expression promotes neurogenic bladder fibrosis via EMT and pyroptosis Cells 2022 11 3836 36497096 10.3390/cells11233836 PMC9739388 74 Farhan F Niazi Z Masood S Abbas B Immunohistochemical expression of MMP-9 and E-cadherin in subtypes of ameloblastoma Pak J Med Sci 2022 38 207 13 35035427 10.12669/pjms.38.1.4465 PMC8713232 75 Lessey BA Young SL Integrins and other cell adhesion molecules in endometrium and endometriosis Semin Reprod Endocrinol 1997 15 291 9 9383838 10.1055/s-2008-1068759 76 Nasu K Kawano Y Kai K Aoyagi Y Abe W Okamoto M Aberrant histone modification in endometriosis Front Biosci (Landmark Ed) 2014 19 1202 14 24896345 10.2741/4276 77 Nasu K Kawano Y Tsukamoto Y Takano M Takai N Li H Aberrant DNA methylation status of endometriosis: epigenetics as the pathogenesis, biomarker and therapeutic target J Obstet Gynaecol Res 2011 37 683 95 21651673 10.1111/j.1447-0756.2011.01663.x 78 Starzinski-Powitz A Handrow-Metzmacher H Kotzian S The putative role of cell adhesion molecules in endometriosis: can we learn from tumour metastasis? Mol Med Today 1999 5 304 9 10377522 10.1016/s1357-4310(99)01497-5 79 Yang P Li S Atypical Hippo signaling network: uncovering novel insights into head and neck cancer biology and advancements in precision intervention Front Cell Dev Biol 2025 13 1610471 40486910 10.3389/fcell.2025.1610471 PMC12141295 80 Lu G Cai Z Jiang R Tong F Tu J Chen Y Reduced expression of E-cadherin correlates with poor prognosis and unfavorable clinicopathological features in gastric carcinoma: a meta-analysis Aging (Albany NY) 2024 16 10271 98 38870263 10.18632/aging.205929 PMC11236327 81 Wang JH Lee EJ Ji M Park SM HDAC inhibitors, trichostatin A and valproic acid, increase E-cadherin and vimentin expression but inhibit migration and invasion of cholangiocarcinoma cells Oncol Rep 2018 40 346 54 29767267 10.3892/or.2018.6441 82 Lu Y Nie J Liu X Zheng Y Guo SW Trichostatin A, a histone deacetylase inhibitor, reduces lesion growth and hyperalgesia in experimentally induced endometriosis in mice Hum Reprod 2010 25 1014 25 20118114 10.1093/humrep/dep472 83 Liu M Liu X Zhang Y Guo SW Valproic acid and progestin inhibit lesion growth and reduce hyperalgesia in experimentally induced endometriosis in rats Reprod Sci 2012 19 360 73 22344726 10.1177/1933719111424453 84 Yi TZ Li J Han X Guo J Qu Q Guo L DNMT inhibitors and HDAC inhibitors regulate E-cadherin and Bcl-2 expression in endometrial carcinoma in vitro and in vivo Chemotherapy 2012 58 19 29 22343305 10.1159/000333077 85 Decourtye-Espiard L Bougen-Zhukov N Godwin T Brew T Schulpen E Black MA E-cadherin-deficient epithelial cells are sensitive to HDAC inhibitors Cancers (Basel) 2021 14 175 35008338 10.3390/cancers14010175 PMC8749989 86 Yang Y Ma B Djamshidi M Zhang Q Sarkar A Chanda A ING1 inhibits Twist1 expression to block EMT and is antagonized by the HDAC inhibitor vorinostat Eur J Cell Biol 2023 102 151341 37459799 10.1016/j.ejcb.2023.151341 87 Baradwan S Gari A Sabban H Alshahrani MS Khadawardi K Bukhari IA The effect of antioxidant supplementation on dysmenorrhea and endometriosis-associated painful symptoms: a systematic review and meta-analysis of randomized clinical trials Obstet Gynecol Sci 2024 67 186 98 38221738 10.5468/ogs.23210 PMC10948216 Fig. 1 E-cadherin: its structure, expression, functions. RTK, receptor tyrosine kinase; WNT, wingless-related integration site; NF-kB, nuclear factor kappa-light-chain-enhancer of activated B cells; MAPK, mitogen-activated protein kinase; YAP1, yes-associated protein 1; Ca, calcium ion; EC, extracellular cadherin domain; TCF, T-cell factor; LEF, lymphoid enhancer-binding factor; CD, cluster of differentiation; MMP, matrix metalloproteinase; MYC, myelocytomatosis proto-oncogene; GTPase, guanosine triphosphatase; RhoA, ras homolog family member A; EGFR, epidermal growth factor receptor; EMT, epithelial-mesenchymal transition; BCL, B-cell lymphoma; TNF, tumor necrosis factor; IL, interleukin; AKT, serine/threonine kinase AKT (protein kinase B); DC, dendritic cell. Fig. 2 Flow diagram of the literature search and study selection process according to the PRISMA guidelines. PRISMA, Preferred Reporting Items for Systematic Reviews and Meta-Analyses. *Consider, if feasible to do so, reporting the number of records identified from each database or register searched (rather than the total number across all databases/registers). **If automation tools were used, indicate how many records were excluded by a human and how many were excluded by automation tools. Page et al. [ 55 Fig. 3 Traffic light plot and summary plot: ROBINS I for non-randomized studies. ROBINS I, risk of bias in non-randomised studies-of interventions. Table 1 Description of articles included in the systematic review No Study Study design Intervention group Comparison group Outcomes measured Results 1 Biyik et al. [ 50 Case-control Patients with EM: group 1-DIE (n=24) and group 2-OM (n=30) Patients without EM: UF (n=30) -E-cadherin protein expression -Group 1 vs. group 2 vs. UF to 25.0±20.43 vs. 121.0±59.50 vs. 246.0±70.0 ( P -Spearman’s test -Correlation with age - −0.047 ( P -Correlation with endometrioma size -0.162 ( P -Correlation with severity of endometriosis symptoms -0.035 ( P  2 Furuya et al. [ 58 Case-control Patients with EM: group 1-DIE (n=5) and group 2-OM (n=6) Patients without EM (benign diseases): group 3-PP (n=5) and group 4-SP (n=5) -E-cadherin protein expression -Group 1 presented lower expression compared to group 2 -Group 2 presented lower expression compared to groups 3 and 4 -ZEB1 protein expression -Groups 3 and 4 presented no ZEB1-pozitive samples, compared to groups 1 and 2 ( P  3 Li et al. [ 42 Case-control Patients with OM (n=30) Patients without EM: UI (n=30) -E-cadherin protein expression (percent of positive samples) -OM (ectopic) vs. OM (eutopic) vs. UI to 20% vs. 50% vs. 96.7% ( P -N-cadherin protein expression -OM (ectopic) vs. OM (eutopic) vs. UI to 60% vs. 30% vs. 10% ( P -TWIST protein expression -OM (ectopic) vs. OM (eutopic) vs. UI to 96.7% vs. 36.7% vs. 13.3% ( P -E-cadherin mRNA expression -OM (ectopic)<OM (eutopic)<UI ( P -N-cadherin mRNA expression -OM (ectopic)>OM (eutopic)>UI ( P -TWIST mRNA expression -OM (ectopic)>OM (eutopic)>UI ( P  4 Lin et al. [ 41 Case-control Patients with OM (n=18) Patients without EM: healthy comparison group (n=10) -E-cadherin protein expression -Patients with OM presented lower expression compared to patients without EM ( P -N-cadherin protein expression -Patients with OM presented higher expression compared to patients without EM ( P -Vimentin protein expression -Patients with OM presented higher expression compared to patients without EM ( P -ZEB1 protein expression -OM (eutopic)>OM (ectopic)>healthy comparison group ( P -E-cadherin mRNA expression -Patients with OM presented lower expression compared to patients without EM ( P -N-cadherin mRNA expression -Patients with OM presented higher expression compared to patients without EM ( P -Vimentin mRNA expression -Patients with OM presented higher expression compared to patients without EM ( P  5 Liu et al. [ 59 Case-control Patients with OM: eutopic (n=30) and ectopic (n=30) Patients without EM: TI (n=31) -E-cadherin protein expression -TI vs. OM (eutopic) to 6.734±1.165 vs. 6.227±2.762 ( P -TI vs. OM (ectopic) to 6.734±1.165 vs. 2.175±2.260 ( P -OM (eutopic) vs. OM (ectopic) to 6.227±2.762 vs. 2.175±2.260 ( P -Vimentin protein expression -TI vs. OM (eutopic) to 3.720±2.839 vs. 4.122±3.537 ( P -TI vs. OM (ectopic) to 3.720±2.839 vs. 6.421±3.449 ( P -OM (eutopic) vs. OM (ectopic) to 4.122±3.537 vs. 6.421±3.449 ( P -HIF-1α protein expression -TI vs. OM (eutopic) to 3.210±1.273 vs. 4.165±2.305 ( P -TI vs. OM (ectopic) to 3.210±1.273 vs. 8.772±2.732 ( P -OM (eutopic) vs. OM (ectopic) to 4.165±2.305 vs. 8.772±2.732 ( P  6 Liu et al. [ 49 Case-control -Patients with EM: group 1-DIE (n=46) Patients without EM: benign diseases (n=23) -E-cadherin protein expression -Patients with EM presented significantly lower expression than patients without EM ( P -No significant difference in expression between DIE, PEM, and OM -Ectopic lesions presented lower expression than eutopic endometrium ( P -N-cadherin protein expression -Patients with EM presented significantly higher expression than patients without EM ( P -No significant difference in expression between DIE, PEM, and OM -Ectopic lesions presented higher expression than eutopic endometrium ( P  7 Liu et al. [ 36 Case-control Patients with OM: eutopic (n=10) and ectopic (n=9) Patients without EM: healthy comparison group (n=11) -E-cadherin protein expression -Patients with OM presented lower expression compared to patients without EM ( P -Vimentin protein expression -Patients with OM presented higher expression compared to patients without EM ( P -HIF-1α protein expression -Patients with OM presented higher expression compared to patients without EM ( P  8 Markov et al. [ 40 Cohort Patients with EM (n=16) Patients without EM: group 1-EC (n=17) and group 2-OC (n=17) -E-cadherin protein expression -EM vs. EC vs. OC to 6.3% vs. 11.8% vs. 52.9% ( P -HIF-1α protein expression -EM vs. EC vs. OC to 62.5% vs. 11.8% vs. 35.3% ( P  9 Matsuzaki et al. [ 60 Case-control Patients with EM: group 1-DIE (n=53), group 2-OM (n=47), and group 3-PEM (n=51) Patients without EM: group 4-healthy comparison group (n=57), group 5-UF (n=41), and group 6-UI (n=9) -E-cadherin mRNA expression -No significant difference between patients with and without EM -β-catenin mRNA expression -E-cadherin protein expression -No significant difference between patients with and without EM • Early-SP -No significant differences between patients with and without EM • Mid-SP -Patients with EM or UI presented significantly higher expression compared to healthy comparison group ( P • Late-SP -Patients with EM presented significantly lower expression compared to healthy comparison group ( P • PP -No significant differences between patients with and without EM -β-catenin protein expression • Early-SP -No significant differences between patients with and without EM • Mid-SP -Patients with EM or UI presented significantly higher expression compared to healthy comparison group ( P • Late-SP -No significant differences between patients with and without EM • PP -No significant differences between patients with and without EM  10 Meng et al. [ 37 Case-control Patients with OM (n=32) Patients without EM: CIN (n=21) -E-cadherin protein expression -OM (ectopic) presented lower expression compared to OM (eutopic) and endometrium of patients with CIN ( P -Vimentin protein expression -OM (ectopic) presented higher expression compared to OM (eutopic) and endometrium of patients with CIN ( P  11 Proestling et al. [ 17 Case-control Patients with EM: OM (n=40), PEM (n=13), and DIE (n=9) Patients without EM: UI (n=47) -E-cadherin mRNA expression -Patients with EM presented significantly lower expression compared to patients without EM ( P -TWIST mRNA expression -Patients with EM presented significantly higher expression compared to patients without EM ( P -SNAIL mRNA expression -Patients with EM presented significantly higher expression compared to patients without EM ( P -SLUG mRNA expression -Patients with EM presented significantly higher expression compared to patients without EM ( P  12 Păvăleanu et al. [ 51 Case-control Patients with EM (n=31) Patients without EM: OC (n=19) -E-cadherin protein expression -Patients with EM presented significantly higher expression compared to patients with OC ( P -β-catenin protein expression -Patients with EM presented significantly lower expression compared to patients with OC ( P  13 Qi et al. [ 62 Case-control Patients with EM (n=30) Patients without EM: healthy comparison group (n=30) -E-cadherin protein expression -Patients with EM presented significantly lower expression compared to patients without EM ( P -N-cadherin protein expression -Patients with EM presented significantly higher expression compared to patients without EM ( P -Vimentin protein expression -Patients with EM presented significantly higher expression compared to patients without EM ( P -SNAIL protein expression -Patients with EM presented significantly higher expression compared to patients without EM ( P -SLUG protein expression -Patients with EM presented significantly higher expression compared to patients without EM ( P  14 Saare et al. [ 63 Case-control Patients with PEM (n=22) Patients without EM: healthy comparison group (n=14) -E-cadherin mRNA expression -Patients with PEM presented significantly higher expression compared to patients without EM ( P -ZEB1 and ZEB2 mRNA expression -No significant difference between OM (eutopic) and patients without EM  15 Sancakli Usta et al. [ 35 Cross-sectional study Patients with OM (n=32) Patients without EM: healthy comparison group and benign diseases (n=30) -E-cadherin protein expression -OM (ectopic) vs. OM (eutopic) vs. comparison group to 1.72±0.77 vs. 1.90±0.82±2.27±0.73 ( P -Spearman’s test -Expression was lower in PP, compared to SP -Correlation with age -0.0410 ( P -Correlation with endometrioma size -0.3361 ( P -Correlation with ASRM stage -0.0237 ( P  16 Shaco-Levy et al. [ 64 Case-control Patients with EM (n=15) -Patients without EM: healthy comparison group (n=10) and EC (n=15) -E-cadherin protein expression -Healthy comparison group vs. EM vs. EC to 91.0±8.76 vs. 84.67±22.32 vs. 38.0±24.26 ( P -β-catenin protein expression -Healthy comparison group vs. EM vs. EC to 100.0±0.0 vs. 72.00±32.99 vs. 99.33±2.58 ( P -MMP-9 protein expression -Healthy comparison group vs. EM vs. EC to 0.0±0.0 vs. 22.00±26.78 vs. 1.33±3.52 ( P  17 Wang et al. [ 65 Case-control Patients with OM (n=47) Patients without EM: UI (n=12) -E-cadherin mRNA expression -Patients with EM presented lower expression compared to patients without EM -N-cadherin mRNA expression -Patients with EM presented higher expression compared to patients without EM -Vimentin mRNA expression -Patients with EM presented higher expression compared to patients without EM -SNAIL mRNA expression -Patients with EM presented higher expression compared to patients without EM -β-catenin mRNA expression -Patients with EM presented higher expression compared to patients without EM  18 Wu et al. [ 39 Case-control Patients with EM: eutopic (n=15) and ectopic (n=15) Patients without EM: healthy comparison group (n=15) -E-cadherin protein expression -EM (ectopic) vs. comparison group to 2.668±1.174 vs. 91.66±3.196 ( P -EM (eutopic) vs. comparison group to 77.75±4.024 vs. 91.66±3.196 ( P -EM (ectopic) vs. EM (eutopic) to 2.668±1.174 vs. 77.75±4.024 ( P -N-cadherin protein expression -EM (ectopic) vs. comparison group to 60.98±8.858 vs. 2.235±0.339 ( P -EM (eutopic) vs. comparison group to 24.11±2.237 vs. 2.235±0.339 ( P -EM (ectopic) vs. EM (eutopic) to 60.98±8.858 vs. 24.11±2.237 ( P  19 Wu et al. [ 52 Case-control Patients with OM (n=34) Patients without EM: benign diseases (n=15) -E-cadherin protein expression -OM vs. comparison group to 57.4 vs. 93.3 ( P -β-catenin protein expression -OM vs. comparison group to 63.2 vs. 60.0 ( P -MMP-9 protein expression -OM vs. comparison group to 0.106±0.026 vs. 0.071±0.020 ( P  20 Xiong et al. [ 67 Case-control Patients with OM: eutopic (n=21) and ectopic (n=21) Patients without EM: healthy comparison group (n=20) -E-cadherin protein expression -OM (ectopic) vs. comparison group to 5.143±4.328 vs. 8.35±1.843 ( P -OM (eutopic) vs. comparison group to 7.238±2.587 vs. 8.35±1.843 ( P -OM (ectopic) vs. OM (eutopic) to 5.143±4.328 vs. 7.238±2.587 ( P -N-cadherin protein expression -OM (ectopic) vs. comparison group to 3.667±3.307 vs. 1.750±1.713 ( P -OM (eutopic) vs. comparison group to 1.381±2.061 vs. 1.750±1.713 -OM (ectopic) vs. OM (eutopic) to 3.667±3.307 vs. 1.381±2.061 ( P -β-catenin protein expression -OM (ectopic) vs. comparison group to 5.048±3.956 vs. 3.150±1.927 -OM (eutopic) vs. comparison group to 1.667±2.288 vs. 3.150±1.927 -OM (ectopic) vs. OM (eutopic) to 5.048±3.956 vs. 1.667±2.288 ( P -Vimentin protein expression -OM (ectopic) vs. comparison group to 4.714±3.862 vs. 2.200±1.765 -OM (eutopic) vs. comparison group to 3.524±3.010 vs. 2.200±1.765 ( P -OM (ectopic) vs. OM (eutopic) to 4.714±3.862 vs. 3.524±3.010 -HIF-1α protein expression -OM (ectopic) vs. comparison group to 7.667±2.817 vs. 4.400±1.818 -OM (eutopic) vs. comparison group to 3.095±2.508 vs. 4.400±1.818 ( P -OM (ectopic) vs. OM (eutopic) to 7.667±2.817 vs. 3.095±2.508 ( P  21 Yu et al. [ 34 Case-control Patients with OM (n=28) Patients without EM: healthy comparison group (n=13) -E-cadherin protein expression -OM (ectopic) vs. comparison group to 18.8% vs. 84.6% ( P -OM (eutopic) vs. comparison group to 95.2% vs. 84.6% -OM (ectopic) vs. OM (eutopic) to 18.8% vs. 95.2% ( P -N-cadherin protein expression -OM (ectopic) vs. comparison group to 37.5% vs. 100% ( P -OM (eutopic) vs. comparison group to 100% vs. 100% -OM (ectopic) vs. OM (eutopic) to 37.5% vs. 100% ( P -ZEB2 protein expression -Patients with OM presented higher expression compared to patients without EM ( P  22 Zubrzycka et al. [ 53 Cohort Patients with OM: ectopic (n=29) and eutopic (n=25) Patients without EM: UF (n=25) -E-cadherin mRNA expression -Patients with OM presented lower expression compared to patients without EM ( P -OM (eutopic) samples presented lower expression compared to OM (ectopic) samples ( P -Mann-Whitney test • Correlation with age -Expression is higher in patients under 40 years old ( P • Correlation with ASRM stage -Expression is higher in patients with IV stage of endometriosis ( P • Correlation with severity of endometriosis symptoms -Expression is higher in patients with mild symptoms ( P EM, endometriosis; DIE, deep infiltrating endometriosis; OM, ovarian endometriosis; UF, uterine fibroids; PP, proliferative phase; SP, secretory phase; UI, unexplained infertility; mRNA, messenger RNA; TI, tubal infertility; HIF-1α, hypoxia-inducible factor-1α; DIE, deep infiltrating endometriosis; PEM, peritoneal endometriosis; EC, endometrial carcinoma; OC, ovarian carcinoma; CIN, cervical intraepithelial neoplasia; ASRM, American Society for Reproductive Medicine; MMP, matrix metalloproteinase. Table 2 Verification of diagnosis in endometriosis and control group No Study Verification of endometriosis group diagnosis Verification of control group diagnosis 1 Biyik et al. [ 50 Laparoscopic or laparotomic and histological confirmation of endometriosis Laparoscopic and histological confirmation of concomitant pathology 2 Furuya et al. [ 58 Histological confirmation of endometriosis No information (endometrial samples were histologically investigated) 3 Li et al. [ 42 Laparoscopic or laparotomic and histological confirmation of endometriosis Laparoscopic or laparotomic and histological confirmation of concomitant pathology 4 Lin et al. [ 41 Histological confirmation of endometriosis No information (endometrial samples were histologically investigated) 5 Liu et al. [ 59 Laparoscopic and histological confirmation of endometriosis No information (endometrial samples were histologically investigated) 6 Liu et al. [ 49 Laparoscopic and histological confirmation of endometriosis Histological confirmation of concomitant pathology 7 Liu et al. [ 36 Laparoscopic and histological confirmation of endometriosis Laparoscopic and histological exclusion of pathology in healthy comparison group 8 Markov et al. [ 40 Histological confirmation of endometriosis Histological investigation of biopsy samples 9 Matsuzaki et al. [ 60 Laparoscopic and histological confirmation of endometriosis -Laparoscopic confirmation of concomitant pathology 10 Meng et al. [ 37 Histological confirmation of endometriosis Histological confirmation of concomitant pathology 11 Proestling et al. [ 17 Laparoscopic and histological confirmation of endometriosis Hysteroscopic exclusion of pathology due to infertility (endometrial samples were histologically investigated) 12 Păvăleanu et al. [ 51 Histological confirmation of endometriosis Histological confirmation of concomitant pathology 13 Qi et al. [ 62 Surgical and histological confirmation of endometriosis No information (endometrial samples were histologically investigated) 14 Saare et al. [ 63 Histological confirmation of endometriosis Histological exclusion of pathology in healthy comparison group 15 Sancakli Usta et al. [ 35 Laparoscopic and histological confirmation of endometriosis No information (endometrial samples were histologically investigated) 16 Shaco-Levy et al. [ 64 Histological confirmation of endometriosis Histological confirmation of concomitant pathology 17 Wang et al. [ 65 Laparoscopic and histological confirmation of endometriosis Laparoscopic and histological exclusion of endometriosis 18 Wu et al. [ 39 Histological confirmation of endometriosis Laparoscopic and histological exclusion of pathology in healthy comparison group 19 Wu et al. [ 52 Laparoscopic or laparotomic and histological confirmation of endometriosis Laparoscopic or laparotomic exclusion of endometriosis (endometrial samples were histologically investigated) 20 Xiong et al. [ 67 Laparoscopic and histological confirmation of endometriosis No information (endometrial samples were histologically investigated) 21 Yu et al. [ 34 Histological confirmation of endometriosis No information (endometrial samples were histologically investigated) 22 Zubrzycka et al. [ 53 Laparoscopic and histological confirmation of endometriosis Hysteroscopic or laparoscopic and histological exclusion of endometriosis Table 3 Method of biosample’ collection and evaluating the expression of investigating molecules No Study Method of biosample’ collection Method of evaluating the molecules expression 1 Biyik et al. [ 50 No information Immunohistochemistry 2 Furuya et al. [ 58 Hysterectomy Immunohistochemistry 3 Li et al. [ 42 Laparoscopy or laparotomy Western blot and immunohistochemistry 4 Lin et al. [ 41 No information PCR 5 Liu et al. [ 59 Laparoscopy and curettage Immunohistochemistry 6 Liu et al. [ 49 Laparoscopy Immunohistochemistry 7 Liu et al. [ 36 Laparoscopy PCR 8 Markov et al. [ 40 No information Immunohistochemistry 9 Matsuzaki et al. [ 60 Curettage PCR 10 Meng et al. [ 37 Hysterectomy Immunohistochemistry 11 Proestling et al. [ 17 Hysteroscopy and curettage Immunohistochemistry and PCR 12 Păvăleanu et al. [ 51 No information Immunohistochemistry 13 Qi et al. [ 62 Hysterectomy Western blot analysis 14 Saare et al. [ 63 Laparoscopy PCR 15 Sancakli Usta et al. [ 35 Laparoscopy Immunohistochemistry 16 Shaco-Levy et al. [ 64 Curettage Immunohistochemistry 17 Wang et al. [ 65 Laparoscopy and curettage PCR and Western blotting 18 Wu et al. [ 39 Laparoscopy Immunohistochemistry 19 Wu et al. [ 52 Laparoscopy Immunohistochemistry 20 Xiong et al. [ 67 Laparoscopy Immunohistochemistry 21 Yu et al. [ 34 No information Immunohistochemistry and PCR 22 Zubrzycka et al. [ 53 Laparoscopy PCR PCR, polymerase chain reaction. ",
  "metadata": {
    "Title of this paper": "The effect of antioxidant supplementation on dysmenorrhea and endometriosis-associated painful symptoms: a systematic review and meta-analysis of randomized clinical trials",
    "Journal it was published in:": "Obstetrics & Gynecology Science",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12463485/"
  }
}