{
  "title": "Paper_469",
  "abstract": "Cytotechnology Cytotechnology 516 cytotech Cytotechnology 0920-9069 1573-0778 Springer PMC11344742 PMC11344742.1 11344742 11344742 39188651 10.1007/s10616-024-00632-3 632 1 Research Heparanase accelerates the angiogenesis and inhibits the ferroptosis of p53-mutant non-small cell cancers in VEGF-dependent manner Song Yaobo 1 Zhou Dongmei 1 Zhang Ping 1 Zhu Na 1 Guo Ruijuan 1 Wang Tian 1 Zhuang Feifei 1 Sun Dengjun 18663875877@163.com 2 1 https://ror.org/03bt48876 grid.452944.a 0000 0004 7641 244X Department of Medical Oncology, Yantaishan Hospital, 2 https://ror.org/05vawe413 grid.440323.2 0000 0004 1757 3171 Department of Medical Oncology, The Affiliated Yantai Yuhuangding Hospital of Qingdao University, 16 5 2024 10 2024 76 5 469349 503 517 9 11 2023 17 4 2024 01 10 2025 01 10 2025 26 08 2024 01 10 2025 © The Author(s), under exclusive licence to Springer Nature B.V. 2024. Springer Nature or its licensor (e.g. a society or other partner) holds exclusive rights to this article under a publishing agreement with the author(s) or other rightsholder(s); author self-archiving of the accepted manuscript version of this article is solely governed by the terms of such publishing agreement and applicable law. 2024 The aim of this study is to explore the effects and specific mechanisms of heparanase on angiogenesis and iron deficiency anemia in TP53 mutant cancer. For this purpose, we conducted in vitro cell experiments and in vivo animal experiments respectively. In this study, we first analyzed the differential expression of heparanase in TP53 wild-type and mutant cells, and analyzed its effects on iron removal and angiogenesis in two types of CALU-1 and NCI-H358 cells. Secondly, we validated whether the mechanism of action of heparanase on TP53 mutant cells for iron removal and angiogenesis is related to VEGF. We applied the iron removal agonist erastin and VEGF inhibitor bevacizumab in both in vitro and in vivo experiments to validate the relationship between heparanase and VEGF in the mechanisms of iron removal and angiogenesis. The experimental results show that heparanase is highly expressed in TP53 mutated cancer cells, and has anti-ferroptosis and pro-angiogenic effects. Our experiment also confirmed that the effect of heparanase on TP53 mutant cancer’s iron removal and angiogenesis is related to VEGF. In short, heparanase is highly expressed in p53 mutated lung cancer, and the mechanism of ferroptosis tolerance to TP53 mutated cancer is related to VEGF. Keywords Heparanase p53 mutation Lung cancer Ferroptosis Angiogenesis Shandong Province Medical and Health Technology Development Plan Project 202103100394 Song Yaobo pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access no pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement no pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes issue-copyright-statement © Springer Nature B.V. 2024 ",
  "metadata": {
    "Title of this paper": "Heparanase accelerates the angiogenesis and inhibits the ferroptosis of p53-mutant non-small cell cancers in VEGF-dependent manner",
    "Journal it was published in:": "Cytotechnology",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC11344742/"
  }
}