{
  "title": "Paper_611",
  "abstract": "pmc Metabolites Metabolites 2273 metabolites metabolites Metabolites 2218-1989 Multidisciplinary Digital Publishing Institute  (MDPI) PMC12471836 PMC12471836.1 12471836 12471836 41003017 10.3390/metabo15090632 metabolites-15-00632 1 Article Non-Invasive Detection of Nasopharyngeal Carcinoma Using Volatile Organic Compounds https://orcid.org/0000-0002-6919-8188 Gui Chuan Hao Conceptualization Methodology Writing – review & editing Writing – original draft Funding acquisition Project administration Formal analysis Investigation 1 * Jia Zhunan Conceptualization Methodology Investigation Project administration Writing – original draft Writing – review & editing Formal analysis Supervision 2 https://orcid.org/0000-0002-0390-414X Tham Alex Chengyao Conceptualization Methodology Project administration Supervision Funding acquisition Writing – original draft Writing – review & editing Formal analysis Investigation 1 Chong Khai Beng Conceptualization Investigation Supervision Project administration Methodology Writing – original draft Formal analysis Writing – review & editing Funding acquisition 1 Xing Zihao Methodology Software Writing – original draft Writing – review & editing Formal analysis Project administration Investigation 2 Zhang Fuchang Methodology Investigation Project administration Writing – original draft Writing – review & editing Software 2 Du Fang Conceptualization Investigation Project administration Methodology Formal analysis Writing – original draft Writing – review & editing 2 Chong Yaw Khian Supervision Project administration Investigation 1 https://orcid.org/0000-0001-7191-5118 Li Hao Investigation Project administration 1 https://orcid.org/0000-0001-6782-7182 Fu Ernest Weizhong Investigation Project administration 1 https://orcid.org/0000-0001-6877-2347 Gan Jereme Yijin Project administration Investigation 1 Chew Agnes Si Qi Investigation Project administration 1 https://orcid.org/0000-0001-5038-7037 Lim Ming Yann Conceptualization Methodology Validation Formal analysis Writing – review & editing Writing – original draft Funding acquisition Project administration Supervision Investigation Visualization 1 Zhang Menghuan Academic Editor 1 2 * chuanhaogui@gmail.com 22 9 2025 9 2025 15 9 497655 632 08 7 2025 09 9 2025 16 9 2025 22 09 2025 27 09 2025 27 09 2025 © 2025 by the authors. 2025 https://creativecommons.org/licenses/by/4.0/ Licensee MDPI, Basel, Switzerland. This article is an open access article distributed under the terms and conditions of the Creative Commons Attribution (CC BY) license ( https://creativecommons.org/licenses/by/4.0/ Background: Objectives: Methods: Results: m z Conclusions: nasopharyngeal carcinoma volatile organic compounds breath analysis This research received no external funding. pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement no pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes 1. Introduction Nasopharyngeal carcinoma (NPC) is a type of head and neck cancer that originates from the epithelial cells lining the nasopharynx, a region anatomically close to the upper airway and nasal passages [ 1 2 3 4 5 6 7 8 9 Currently, there are no widely available non-invasive screening tests for NPC. The primary screening method, EBV serology, while helpful, has limitations in terms of sensitivity and specificity. Moreover, nasoendoscopy, the gold standard for NPC detection, is not easily accessible outside of specialist settings, which complicates early detection efforts. The lack of effective non-invasive tests underscores a critical gap in NPC diagnosis and screening. Accurate diagnosis of NPC involves a multidisciplinary approach. This typically includes nasopharyngoscopy for visual examination of the nasopharynx, imaging modalities such as magnetic resonance imaging (MRI) and computed tomography (CT) scans for tumor localization and staging, and biopsy for histological confirmation of malignancy [ 10 11 12 However, the diagnostic workup for NPC, including nasopharyngoscopy, imaging studies, and biopsy, can be invasive, time-consuming, and costly. Imaging modalities like MRI and CT scans expose patients to ionizing radiation and require skilled interpretation for accurate tumor localization and staging. Biopsy procedures carry risks of bleeding, infection, and sampling errors, necessitating careful consideration of clinical indications and the potential benefits versus harms. Volatile organic compounds (VOCs) are a diverse group of organic chemicals present in exhaled breath, originating from various metabolic processes within the body [ 13 14 15 Although breath VOC analysis has not yet been widely applied to NPC, previous studies on head and neck squamous cell carcinoma [ 16 15 17 Breath tests are a compelling diagnostic approach because they are non-invasive and easy to administer and allow for rapid analysis [ 18 Breath analysis using PTR-MS and the detection of VOC features represent a promising frontier in medical diagnostics. This approach not only improves our understanding of the metabolic changes associated with disease but also creates opportunities for personalized medicine, where treatments may be tailored to the individual patient’s VOC profile. 2. Materials and Methods 2.1. Study Population The study involved a total of 90 participants, divided into three distinct groups: 50 patients with nasopharyngeal carcinoma (NPC) and 40 healthy controls. All participants were recruited from Tan Tock Seng Hospital Singapore, a major healthcare institution renowned for its comprehensive medical services and research facilities, between May 2022 and June 2024, after obtaining informed consent. The difference in group sizes reflects the practical constraints of recruitment during the study period, with all eligible NPC patients enrolled consecutively and healthy controls recruited on a voluntary basis. Although the groups were modestly unequal in size, both provided adequate statistical power, and confounder-adjusted analyses were subsequently applied to reduce potential bias. Participants in the NPC group were recruited following a confirmed diagnosis of NPC from post-nasal space biopsy results. The control group participants were voluntarily recruited after undergoing nasoendoscopy, which revealed no significant abnormalities and did not meet any of the exclusion criteria outlined below. The exclusion criteria for this study included recent food or beverage consumption within the past hour or adherence to a ketogenic diet, alcohol intake within the past 6 h, a history of cancer, pregnancy, respiratory or heart failure, liver dysfunction or failure, renal failure, and uncontrolled diabetes mellitus. These exclusion criteria were selected based on the proposed framework for conducting and reporting studies on VOCs, with the aim of minimizing confounding factors [ 19 20 The trial was approved by the NHG Domain Specific Review Board (DSRB) (Ref: 2019/00345), and all enrolled subjects gave signed informed consent prior to the study. 2.2. Breath Collection, PTR-TOF-MS Measurement, and Analysis Breath samples were collected from both NPC patients and healthy controls using sterile Tedlar bags in the same clinic room to minimize the influence of ambient air. The participants were instructed to provide three consecutive end-tidal exhalations under study team supervision to ensure the capture of alveolar air. The bags were sealed immediately after collection and transported to the research laboratory on the same day for PTR-MS analysis. This standardized procedure minimized environmental contamination and ensured comparability across the groups. The breath samples were measured using a PTR-MS TOF1000 (Ionicon Analytik GmbH, Innsbruck, Austria), with technical specifications provided in Table 1 21 3 + 3 + 2 3 + m z Key operational parameters of the PTR-MS instrument included a drift tube voltage of 600 V, a temperature of 80 °C, a drift tube pressure of 2.3 mbar, and an E/N ratio of 139 Td. Additionally, the sampling line and buffer tube were maintained at 70 °C. The sampling line and buffer tube were maintained at a temperature of at least 70 °C to minimize the condensation of water vapor and reduce the risk of contamination by viruses and other particulate matter. Elevated temperatures help to prevent the accumulation of moisture, which can act as a carrier for pathogens, thus improving the accuracy and safety of the sample collection process. After the participants registered their personal data and signed consent forms, they were instructed by a study team member to exhale into a Tedlar bag, which was then sealed and transported to the research laboratory on the same day. Before the measurements, the device was calibrated. The Tedlar bag was connected to the PTR-MS device and sealed using laboratory film (Parafilm). Initially, the PTR-MS was connected to the external environment until the pressure parameters stabilized. Once stable, the valve of the Tedlar bag was opened, and the device began drawing air from the bag. Observing the pressure parameters ensured that they were stable before data collection commenced. This procedure minimizes pressure fluctuations in the drift tube, ensuring accurate readings [ 22 23 The procedure described addresses several potential issues and streamlines the collection process. Starting measurements from normal atmospheric pressure avoids the lengthy stabilization period required if starting from lower pressures, which can sometimes result in the device reaching only half the target pressure and significantly skewing the data. Consequently, we avoided switching from standby mode to active measurement mode. Since the Tedlar bag valve is initially closed, if the bag is connected from the start, the lack of gas input prevents the PTR-MS pressure from rising until the valve is opened. This situation is akin to starting from standby mode, which we aim to avoid. The PTR-MS calculates the concentration of all VOCs and saves the data in .h5 files [ 21 2.3. Statistical Analysis All statistical analyses were conducted using R (version 4.2.2; R Foundation for Statistical Computing, Vienna, Austria). Continuous variables (age, BMI) were summarized as mean ± standard deviation and compared between the groups using the Wilcoxon rank-sum test. Categorical variables (gender, smoking status, medication use) were presented as counts and percentages and compared using chi-squared tests. Standardized mean differences (SMDs) were calculated to assess group balance. Significance testing of VOCs between the NPC patients and controls was performed using the Wilcoxon rank-sum test, with p 3. Results Data analysis was performed using R. Multiple dimensions of the data were analyzed, and significance analysis was performed to rank m z p 3.1. Study Characteristics Table 2 3.2. NPC vs. Control Analysis 3.2.1. Significance Analysis In the comparison between NPC patients and control subjects, several VOCs were identified as significant biomarkers. To evaluate the differences in VOC levels between the two groups, the Wilcoxon rank-sum test (also known as the Mann–Whitney U test) was employed. This non-parametric statistical method is particularly suited for small sample sizes or data that do not follow a normal distribution, making it a robust choice for analyzing the metabolic data in this study. Table 3 p p 3.2.2. Assessment of Baseline Characteristics and Group Balance To investigate the potential impact of confounding factors on group assignment, we analyzed the baseline characteristics of the NPC and healthy control groups (including age, sex, BMI, long-term medication use, and smoking status) and assessed the balance of these variables between the two groups. Baseline characteristics between the NPC and healthy control groups were compared using the CreateTableOne function from the tableone package in R. Continuous variables (e.g., age, BMI) were summarized as mean ± standard deviation, and categorical variables (e.g., gender, medication status, smoking status) were presented as counts and percentages. Standardized mean differences (SMDs) were calculated for each variable to assess the balance of baseline characteristics between the groups. All variables were analyzed at all categorical levels to provide a complete comparison. The baseline characteristics analysis as shown in Table 4 p p To visualize the distribution of potential confounding factors between the NPC and healthy control groups, we plotted continuous variables (age and BMI) using boxplots and categorical variables (gender and smoking status) using bar plots as seen in Figure 1 To assess whether potential confounding factors differed between the NPC and control groups as shown in Table 5 Group comparison tests revealed significant differences in gender distribution (χ 2 p 2 p p p 3.2.3. Effects of Confounding Factors on Multiple VOCs A multivariate analysis of variance (MANOVA) was performed to evaluate the effects of potential confounding factors—including age, gender, BMI, medication use, and smoking status—on all measured VOCs under the assumption that the data followed a normal distribution. Pillai’s trace was used as the test statistic to assess the overall multivariate effect of each factor. The corresponding approximate F-values, degrees of freedom, and p The MANOVA results as shown in Table 6 p p p p 3.2.4. Principal Component Analysis (PCA) The PCA plot ( Figure 2 The principal component analysis (PCA) plot in Figure 3 The clustering observed does suggest some variation as the disease progresses, particularly between the early and advanced stages. However, the data lacks statistical significance, with considerable overlap and heterogeneity within stages. This underscores the need for further analysis and larger datasets to identify reliable biomarkers for NPC staging through VOC profiling. To eliminate the influence of confounding factors such as age, gender, BMI, medication use, and smoking status on the analysis of volatile organic compounds (VOCs) and to more clearly identify nasopharyngeal carcinoma (NPC)-specific metabolic signatures, this study employed a confounder-adjusted principal component analysis (PCA) approach. First, we calculated the residuals for each VOC using a linear regression model (VOC ~ age + gender + BMI + medication + smoking) to remove the variance explained by these covariates. Subsequently, PCA was performed on the residual matrix. The results showed that the first two principal components (PC1 and PC2) of the adjusted data explained 54.1% and 21.5% of the variance, respectively, and the NPC patients and healthy controls exhibited clear separation in the PC1-PC2 space (see Figure 4 3.2.5. Heatmap Analysis Figure 5 3.2.6. Correlation Map The correlation map ( Figure 6 3.2.7. Model Performance The random forest model was employed to distinguish between NPC patients and healthy controls. The receiver operating characteristic (ROC) curve, as shown in Figure 7 Figure 8 4. Discussion The results of this study underscore the potential of proton transfer reaction mass spectrometry (PTR-MS) in identifying volatile organic compound (VOC) biomarkers for diagnosing nasopharyngeal carcinoma (NPC). Significant differences in VOC profiles between the NPC patients and control subjects were observed, identifying specific biomarkers that can effectively distinguish between diseased and healthy individuals. In the discussion of the potential identities of m089 and m175, it is essential to hypothesize the possible compounds based on their mass-to-charge ( m z m z M089 and m175 likely represent VOCs that are products of altered metabolic processes in NPC. These compounds may serve as biomarkers for the disease, reflecting the oxidative stress and lipid metabolism disruptions that are critical in the progression of NPC. Further research is required to confirm the exact identities of these VOCs and elucidate their roles in NPC pathophysiology, but their significant presence suggests that they could be valuable for early diagnosis and monitoring. M089 likely corresponds to a molecule with a molecular weight of approximately 88 Da, with butyric acid as a potential candidate. Butyric acid is a short-chain fatty acid involved in essential metabolic processes, including inflammation and immune regulation [ 24 25 Regarding m175, we were unable to conclusively determine the corresponding compound. The m z A key contribution of this research is its novel application of PTR-MS for the non-invasive detection of NPC. Traditional diagnostic methods, such as nasopharyngoscopy for NPC, are invasive, time-consuming, and costly. In contrast, PTR-MS breath analysis offers a rapid, non-invasive, and cost-effective alternative suitable for clinical settings. Detection of significant VOC features, such as m z m z 26 This study also enhances the understanding of the metabolic changes associated with NPC. The correlation analyses reveal potential metabolic pathways involved in this disease, providing insights for future research and therapeutic strategies. The identified VOCs associated with NPC could inform the development of targeted therapies and improve patient outcomes. Improvements over previous studies include a comprehensive analysis of multiple VOCs and the application of advanced statistical techniques to validate the findings. Principal component analysis (PCA), heat maps, and correlation maps provide a robust framework for visualizing and interpreting the data, enhancing the reliability of the results. The demographics of our NPC group closely resemble those of other studies, with a mean age at diagnosis ranging from 55 to 60 years [ 27 28 27 29 30 The identification of VOCs with consistent diagnostic value across different populations is essential for the clinical translation of PTR-MS breath analysis [ 31 23 31 A limitation of this study is that the putative biomarkers m089 and m175 were not chemically confirmed. In future work, we plan to analyze pure standard compounds and compare their PTR-MS spectra with breath measurements to definitively establish compound identities. In summary, this study demonstrates the feasibility and potential of PTR-MS for the non-invasive screening of NPC. This approach offers a promising tool for the early detection and monitoring of this condition, with significant implications for clinical practice and patient care. 5. Conclusions This study demonstrates that PTR-MS breath analysis has potential scientific and clinical utility as a non-invasive screening tool for the early detection of NPC. By identifying disease-specific VOCs such as m089 and m175, this technique offers a rapid and patient-friendly alternative that could complement existing diagnostic pathways, reduce reliance on invasive procedures, and improve accessibility of screening in community settings. Future validation in larger and more diverse cohorts is warranted to establish its role in clinical practice. Disclaimer/Publisher’s Note: Author Contributions Conceptualization, Z.J., A.C.T., M.Y.L. and C.H.G.; methodology, Z.J. and C.H.G.; formal analysis, C.H.G. and F.Z.; investigation, A.C.T., K.B.C., E.W.F., J.Y.G., H.L., Y.K.C., A.S.Q.C. and M.Y.L.; writing—original draft preparation, Z.J. and C.H.G.; writing—review and editing, Z.J., C.H.G., Z.X. and F.Z.; supervision, Z.J., A.C.T., K.B.C., M.Y.L. and C.H.G.; administration, Z.J., A.C.T. and C.H.G.; funding acquisition, C.H.G. and F.D. All authors have read and agreed to the published version of the manuscript. Institutional Review Board Statement This study protocol was approved by the NHG Domain Specific Review Board (DSRB) on 2 September 2019; approval number 2019/00345. Informed Consent Statement Informed consent was obtained from all subjects involved in the study. Data Availability Statement The original contributions presented in the study are included in the article, further inquiries can be directed to the corresponding author. Conflicts of Interest Zhunan Jia, Zihao Xing, Fuchang Zhang, and Fang Du are employees of Breathonix Pte Ltd. The paper reflects the views of the scientists, and not the company. Abbreviations The following abbreviations are used in this manuscript: NPC Nasopharyngeal Carcinoma PTR-MS Proton Transfer Reaction Mass Spectrometry VOC Volatile Organic Compound EBV Epstein–Barr Virus MRI Magnetic Resonance Imaging CT Computed Tomography AJCC American Joint Committee on Cancer TOF-MS Time-of-Flight Mass Spectrometer References 1. Chen Y.-P. Chan A.T.C. Le Q.-T. Blanchard P. Sun Y. Ma J. Nasopharyngeal carcinoma Lancet 2019 394 64 80 10.1016/S0140-6736(19)30956-0 31178151 2. Wu L. Li C. Pan L. Nasopharyngeal carcinoma: A review of current updates Exp. Ther. Med. 2018 15 3687 3692 10.3892/etm.2018.5878 29556258 PMC5844099 3. Chou J. Lin Y. Kim J. You L. Xu Z. He B. Jablons D.M. Nasopharyngeal carcinoma—Review of the molecular mechanisms of tumorigenesis Head Neck 2008 30 946 963 10.1002/hed.20833 18446839 PMC3046044 4. Jeyakumar A. Brickman T.M. Jeyakumar A. Doerr T. Review of nasopharyngeal carcinoma Ear Nose Throat J. 2006 85 168 184 10.1177/014556130608500313 16615599 5. Chang E.T. Ye W. Zeng Y.-X. Adami H.-O. The evolving epidemiology of nasopharyngeal carcinoma Cancer Epidemiol. Biomark. Prev. 2021 30 1035 1047 10.1158/1055-9965.EPI-20-1702 33849968 6. Chua M.L.K. Wee J.T.S. Hui E.P. Chan A.T.C. Nasopharyngeal carcinoma Lancet 2016 387 1012 1024 10.1016/S0140-6736(15)00055-0 26321262 7. Liao L.-J. Hsu W.-L. Chen C.-J. Chiu Y.-L. Feature reviews of the molecular mechanisms of nasopharyngeal carcinoma Biomedicines 2023 11 1528 10.3390/biomedicines11061528 37371623 PMC10295754 8. Adham M. Kurniawan A.N. Muhtadi A.I. Roezin A. Hermani B. Gondhowiardjo S. Tan I.B. Middeldorp J.M. Nasopharyngeal carcinoma in Indonesia: Epidemiology, incidence, signs, and symptoms at presentation Chin. J. Cancer 2012 31 185 196 10.5732/cjc.011.10328 22313595 PMC3777476 9. Lee A.W. Ma B.B. Ng W.T. Chan A.T. Management of nasopharyngeal carcinoma: Current practice and future perspective J. Clin. Oncol. 2015 33 3356 3364 10.1200/JCO.2015.60.9347 26351355 10. Tabuchi K. Nakayama M. Nishimura B. Hayashi K. Hara A. Early Detection of Nasopharyngeal Carcinoma Int. J. Otolaryngol. 2011 2011 638058 10.1155/2011/638058 21716698 PMC3118637 11. Razek A.A.K.A. King A. MRI and CT of nasopharyngeal carcinoma Am. J. Roentgenol. 2012 198 11 18 10.2214/AJR.11.6954 22194474 12. Bossi P. Chan A. Licitra L. Trama A. Orlandi E. Hui E. Halámková J. Mattheis S. Baujat B. Hardillo J. Nasopharyngeal carcinoma: ESMO-EURACAN clinical practice guidelines for diagnosis, treatment and follow-up Ann. Oncol. 2021 32 452 465 10.1016/j.annonc.2020.12.007 33358989 13. Davies S.J. Španěl P. Smith D. Breath analysis of ammonia, volatile organic compounds and deuterated water vapor in chronic kidney disease and during dialysis Bioanalysis 2014 6 843 857 10.4155/bio.14.26 24702114 14. Capone S. Tufariello M. Forleo A. Longo V. Giampetruzzi L. Radogna A.V. Casino F. Siciliano P. Chromatographic analysis of VOC patterns in exhaled breath from smokers and nonsmokers Biomed. Chromatogr. 2017 32 e4132 10.1002/bmc.4132 29131420 15. Moura P.C. Raposo M. Vassilenko V. Breath volatile organic compounds (vocs) as biomarkers for the diagnosis of pathological conditions: A Review Biomed. J. 2023 46 100623 10.1016/j.bj.2023.100623 37336362 PMC10339195 16. Dharmawardana N. Goddard T. Woods C. Watson D.I. Ooi E.H. Yazbeck R. Development of a non-invasive exhaled breath test for the diagnosis of head and neck cancer Br. J. Cancer 2020 123 1775 1781 10.1038/s41416-020-01051-9 32901136 PMC7722848 17. Mahdavifar N. Ghoncheh M. Mohammadian-Hafshejani A. Khosravi B. Salehiniya H. Epidemiology and inequality in the incidence and mortality of nasopharynx cancer in Asia Osong Public Health Res. Perspect. 2016 7 360 372 10.1016/j.phrp.2016.11.002 28053841 PMC5194228 18. Pereira J. Porto-Figueira P. Cavaco C. Taunk K. Rapole S. Dhakne R. Nagarajaram H. Câmara J.S. Breath analysis as a potential and non-invasive frontier in disease diagnosis: An overview Metabolites 2015 5 3 55 10.3390/metabo5010003 25584743 PMC4381289 19. Hanna G.B. Boshier P.R. Markar S.R. Romano A. Accuracy and methodologic challenges of volatile organic compound–based exhaled breath tests for cancer diagnosis JAMA Oncol. 2019 5 e182815 10.1001/jamaoncol.2018.2815 30128487 PMC6439770 20. Zanoni D.K. Patel S.G. Shah J.P. Changes in the 8th edition of the American Joint Committee on Cancer (AJCC) staging of head and neck cancer: Rationale and implications Curr. Oncol. Rep. 2019 21 52 10.1007/s11912-019-0799-x 30997577 PMC6528815 21. Herbig J. Müller M. Schallhart S. Titzmann T. Graus M. Hansel A. On-line breath analysis with PTR-TOF J. Breath Res. 2009 3 027004 10.1088/1752-7155/3/2/027004 21383459 22. Jia Z. Ong W.Q. Zhang F. Du F. Thavasi V. Thirumalai V. A study of 9 common breath vocs in 504 healthy subjects using PTR-TOF-MS Metabolomics 2024 20 79 10.1007/s11306-024-02139-6 39046579 23. Jia Z. Patra A. Kutty V.K. Venkatesan T. Critical review of volatile organic compound analysis in breath and in vitro cell culture for detection of lung cancer Metabolites 2019 9 52 10.3390/metabo9030052 30889835 PMC6468373 24. Siddiqui M.T. Cresci G.A.M. The Immunomodulatory Functions of Butyrate J. Inflamm. Res. 2021 14 6025 6041 10.2147/JIR.S300989 34819742 PMC8608412 25. Ji Y. Chen J. Liu Y. Li X. Breathomics profiling facilitates personalized screening for colorectal cancer Talanta 2026 297 128646 10.1016/j.talanta.2025.128646 40749511 26. Issitt T. Wiggins L. Veysey M. Sweeney S.T. Brackenbury W.J. Redeker K. Volatile compounds in human breath: Critical review and meta-analysis J. Breath Res. 2022 16 024001 10.1088/1752-7163/ac5230 35120340 27. Wu S.-G. Liao X.-L. He Z.-Y. Tang L.-Y. Chen X.-T. Wang Y. Lin Q. Demographic and clinicopathological characteristics of nasopharyngeal carcinoma and survival outcomes according to age at diagnosis: A population-based analysis Oral Oncol. 2017 73 83 87 10.1016/j.oraloncology.2017.08.006 28939081 28. Colaco R. Betts G. Donne A. Swindell R. Yap B. Sykes A. Slevin N. Homer J. Lee L. Nasopharyngeal carcinoma—A retrospective review of demographics, treatment and patient outcome in a single centre Clin. Oncol. 2013 25 171 177 10.1016/j.clon.2012.10.006 23337060 29. Blanchet L. Smolinska A. Baranska A. Tigchelaar E. Swertz M. Zhernakova A. Dallinga J.W. Wijmenga C. van Schooten F.J. Factors that influence the volatile organic compound content in human breath J. Breath Res. 2017 11 016013 10.1088/1752-7163/aa5cc5 28140379 30. Dragonieri S. Quaranta V.N. Carratu P. Ranieri T. Resta O. Influence of age and gender on the profile of exhaled volatile organic compounds analyzed by an electronic nose J. Bras. Pneumol. 2016 42 143 145 10.1590/S1806-37562015000000195 27167436 PMC4853068 31. Jia Z. Thavasi V. Venkatesan T. Lee P. Breath analysis for lung cancer early detection—A clinical study Metabolites 2023 13 1197 10.3390/metabo13121197 38132879 PMC10745549 Figure 1 Baseline characteristics (age, gender, BMI, smoking) distribution in NPC and control groups. Figure 2 PCA plot for NPC vs. control. Figure 3 PCA plot for NPC stages. Figure 4 PCA after adjusting for age, gender, BMI, medication, and smoking. Figure 5 Heatmap for NPC vs. control. Figure 6 Correlation map for NPC and healthy controls. Figure 7 ROC curve of the random forest model for NPC vs. control classification (AUC = 0.71). Figure 8 Confusion matrix of the random forest model. metabolites-15-00632-t001_Table 1 Table 1 Technical specifications of PTR-MS. Parameter Specification Mass resolution >1500 m/Δm (FWHM) for m/z Response time <100 ms Sensitivity >200 cps/ppbv for m/z Detection limits <10 pptv for m/z Linearity range 10 pptv–1 ppmv Adjustable flow 50–800 sccm metabolites-15-00632-t002_Table 2 Table 2 Study population for NPC and control groups.  NPC Control Number 50 40 Age (mean ± SD) 58.98 ± 11.38 43.38 ± 12.70 Gender M/F (%) 43/7 (86.0%/14.0%) 24/16 (60.0%/40.0%) Stage I (%) 3 (6.0%) - Stage II (%) 8 (16.0%) - Stage III (%) 18 (36.0%) - Stage IVa (%) 15 (30.0%) - Stage IVb (%) 6 (12.0%) - metabolites-15-00632-t003_Table 3 Table 3 Biomarkers identified for NPC with their corresponding p Biomarker ( m z p m088 0.019 m088.070 0.041 m089 0.006 m090 0.006 m097.071 Cycloheptene 0.021 m098 0.019 m175 0.001 metabolites-15-00632-t004_Table 4 Table 4 Baseline characteristics and group balance between NPC and healthy controls.  Level Control NPC p Test SMD n  40 50   Age (mean (SD))  43.38 ± 12.70 58.98 ± 11.38 0.117 0.335 Gender Female 16 (40.0) 7 (14.0) 0.010 0.612 Male 24 (60.0) 43 (86.0) BMI (mean (SD))  23.67 ± 2.74 23.81 ± 2.87 0.816 0.050 Medication (%) No 29 (72.5) 37 (74.0) 1.000 0.034 Yes 11 (27.5) 13 (26.0) Smoking (%) Current 6 (15.0) 13 (26.0) 0.007 0.703 Former 8 (20.0) 21 (42.0) Never 26 (65.0) 16 (32.0) metabolites-15-00632-t005_Table 5 Table 5 Baseline confounder comparison between NPC and control groups. Variable Test Statistic df p Age Wilcoxon rank-sum 1219.50 NA 0.08 BMI Wilcoxon rank-sum 991.00 NA 0.94 Gender Chi-squared 6.59 1 0.01 Smoking Chi-squared 9.80 2 0.01 metabolites-15-00632-t006_Table 6 Table 6 Impact of baseline confounders on VOCs.  Df Pillai Approx_F Den_Df p Significance Age 1 0.10 0.79 74 0.6346  Gender 1 0.19 1.77 74 0.0804  BMI 1 0.22 2.09 74 0.0358 * medication 1 0.27 2.73 74 0.0065 ** Smoking 2 0.46 2.22 150 0.0036 ** Residuals 83      ** Indicates statistical significance, while * indicates marginal significance. ",
  "metadata": {
    "Title of this paper": "Breath analysis for lung cancer early detection—A clinical study",
    "Journal it was published in:": "Metabolites",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12471836/"
  }
}