{
  "title": "Paper_389",
  "abstract": "pmc BMC Oral Health BMC Oral Health 53 bmcorhl BMC Oral Health 1472-6831 BMC PMC12482719 PMC12482719.1 12482719 12482719 41023651 10.1186/s12903-025-06889-0 6889 1 Case Report Corticosteroid injection for pyogenic granuloma of the tongue in a rare resembling ulcerative malignancy: a case report Zhang Yinchun 1 Mao Qinghua 2 Wang Yinyan 2 Sun Fei 1 Liu Chuanxia 0014806@zju.edu.cn 2 1 https://ror.org/00g56wy16 grid.509957.7 Shaoxing Stomatological Hospital, 2 https://ror.org/041yj5753 grid.452802.9 Stomatology Hospital, School of Stomatology, Zhejiang University School of Medicine, Clinical Research Center for Oral Diseases of Zhejiang Province, Key Laboratory of Oral Biomedical Research of Zhejiang Province, Cancer Center of Zhejiang University, Stomatology Hospital, School of Stomatology, Zhejiang University School of Medicine, 29 9 2025 2025 25 478159 1500 11 1 2025 2 9 2025 29 09 2025 01 10 2025 01 10 2025 © The Author(s) 2025 2025 https://creativecommons.org/licenses/by/4.0/ Open Access http://creativecommons.org/licenses/by/4.0/ Background Pyogenic granuloma (PG) is a benign vasoproliferative lesion that usually occurs in the skin And mucosa. The clinical manifestations of PG are rapid growth, pedicled or broad base of a single red smooth papule, easily bleeding with minor lesions. Most of the oral lesions occur at the gingiva, And the extra-gingival lesions is less common, and the ulcerative type is even rarer. We present a case of ulcerative lesion located at the lateral margin of the tongue with a peripheral bulge for more than 5 years. It was initially suspected to be tongue cancer and was confirmed to be a PG by microscopic examination, and the ulcer healed and the protrusion subsided after topical steroid corticosteroid injection. Case presentation A 75-year-old woman presented with An ulcer on the right tongue for more than 5 years. Clinical examination revealed a prominence seen on the mid-posterior part of the lateral margin of the right tongue with a tough texture and an ulcerated surface visible in the center. The Lingual cusps of the right lower first And second molars opposite the ulcer was sharp. Interestingly, the patient had undergone partial gastrointestinal resection because of gastric carcinoma And had been on antidepressants for 4 years. Hematoxylin-eosin (HE) staining was suggestive of vascular and vascular endothelial cell hyperplasia in the lamina propria of the ulcer surface, and the pathologic diagnosis was PG. Two injections of triamcinolone acetonide acetate lidocaine hydrochloride bovine basic fibroblast growth factor cetylpyridinium chloride/compound chlorhexidine gargle. Discussion Extragingival PGs in the mouth are relatively rare, and longstanding ulcerative protrusions occurring on the lateral margins of the tongue are often recognized as ulcerative tumors, and pathology is necessary to distinguish malignant tumors from PGs. Trauma, altered hormone levels, and medications can all contribute to the development of PGs, and we hypothesize that the sharp dental cusps, altered estrogen secretion, long-term use of antidepressant medications, and partial gastrointestinal resection may contributed to the development of PG in this woman. The conventional treatment for PG is surgical resection. In this case, good therapeutic effect was achieved after using multi-point topical injection of corticosteroid, combined with wet compress, mouthwash, and medication application, which provides clinical basis for the selection of non-surgical treatment for PG. Keywords Pyogenic granuloma Ulcerative mass Tongue malignancy Corticosteroid injection Case report pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement no pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes issue-copyright-statement © BioMed Central Ltd., part of Springer Nature 2025 Background Pyogenic granuloma (PG) is an acquired, benign, vasoproliferative lesion that usually occurs in the skin or mucosa. When the tissue is irritated, it can lead to proliferation of granulation tissue within the skin or mucosa. Although it often manifests as a tumor-like growth, its essence is nonneoplastic [ 1 2 3 4 5 6 Oral cancer is the sixth most common cancer in the world, posing a serious threat to human health, with an incidence rate of about 1/275,000 [ 7 8 9 10 12 12 13 13 We present a case in which a malignant tumor of the tongue was suspected based on the initial clinical presentation, however, the diagnosis of PG was confirmed by histopathological examination, and the lesion disappeared after intralesional injection of corticosteroid hormones, in conjunction with topical medication. At the same time, we briefly reviewed the clinical presentation and pathology of PG and oral cancer, and analyzed the possible risk causes for the induction of PG in this patient based on her systemic condition, local irritation, and history of medication use. Case presentation A 75-year-old woman presented to the outpatient clinic of the department of oral medicine, Stomatology Hospital, School of Stomatology, Zhejiang University School of Medicine after suffering from a tongue ulcer And constant pain for more than 5 years. She had used mouthwash and oral antibiotics for many times, but the ulcer and recurrent pain was never healed. She denied having bitten through the area prior to the initial appearance of the ulcer. She also told us that she had undergone a partial gastrointestinal resection for her gastric carcinoma many years ago and that she had started taking antidepressant medication for depression four years ago, but did not tell us the exact drug. Allergies and history of other diseases and medications were denied. The patient also denied any history of tobacco use or alcohol consumption.The physical examination revealed a protruding mass of about 3cm×3 cm×2 cm in size at the mid-posterior part of the right Lingual margin, with relatively clear borders, average mobility, peripheral elevation, And tough texture. An ulcer of about 1.5 cm×0.8 cm was visible on the surface of the center of the mass, with no redness around the ulcer (Fig. 1  Fig. 1 Clinical manifestations of therapeutic effects. A B C Based on the patient’s complaints and clinical manifestations, we suspected that the mass on the right side of the tongue might be a malignant lesion. After obtaining the patient’s informed consent and ruling out contraindications to biopsy surgery, the sharp edges of the teeth were polished to make them smooth, and part of the tissue at the border of the tongue ulcer was cut out in preparation for a pathologic examination. Pathology showed ulceration of the mucosal surface of the dorsum of the tongue, hyperplasia of blood vessels and vascular endothelial cells in the lamina propria, and infiltration of neutrophils, eosinophils, lymphocytes, and plasma cells, which led to the diagnosis of “pyogenic granuloma” (Fig. 2 Fig. 2 Histopathology images. A B The therapeutic protocol was performed as follows: (1) Drug preparation and injection: triamcinolone acetonide acetate lidocaine hydrochloride triamcinolone lidocaine triamcinolone acetonide acetate cetylpyridinium chloride gargle bovine bFGF gel At the 2-week follow-up visit, the patient felt a recent reduction in pain and a significant reduction in the size of the lesion was observed (Fig. 1 lidocaine hydrochloride triamcinolone acetonide acetate Cetylpyridinium Chloride ompound chlorhexidine gargle After another 2 weeks, the patient had no pain, and examination revealed that the ulcer surface had healed, with a linear scar visible in the center, and the marginal tissue elevation was significantly less than before, only slightly protruding from the mucosal surface, with a soft texture (Fig. 1 The patient was scheduled for clinical review at 3, 6, And 12 months post-treatment. However, the patient was unable to attend the scheduled reviews due to relocation to Another city. At the 6 months And 1 year after treatment, a telephone follow-up was conducted. The patient reported complete resolution of pain and no recurrence of the lesion, indicating sustained therapeutic efficacy. Discussion and conclusion Ulcers that do not heal for a long time in the mouth have a risk of cancer, especially those located in high-risk areas such as lingual border. They need to be differentiated from oral cancer, and pathology is the gold standard for differentiation. PG is usually difficult to differentiate from oral malignancy when ulceration is present on the surface for a long time. As a limited lesion, PG usually has clear borders and regular shape. Because it is composed of mainly neoplastic capillaries and endothelial cells, it is relatively soft in texture and bleeds easily upon irritation [ 14 10 15 16 17 PG is often caused by traumatic injury, inflammation, hormonal changes, or medications [ 14 18 19 In this case, the patient was at an older age and we hypothesized that the PG might also be related to its altered estrogen secretion levels. At this stage, ovarian function declines, resulting in a significant decrease in estrogen. Estrogen has an important protective effect on the oral mucosa, and under normal conditions, estrogen promotes the proliferation and differentiation of oral mucosal cells and maintains the thickness and elasticity of the mucosa. With decreased estrogen, the self-repairing ability of the oral mucosa decreases [ 20 17 21 This woman has been taking antidepressants for a long time, and the main antidepressants currently in use are Selective Serotonin Reuptake Inhibitors (SSRIs), and there have been no reports of antidepressant-induced PG in the literature. But some scholars have also discovered drug-related PG, and carbamazepine 22 Levothyroxine 23 24 This patient has a history of gastric carcinoma, which increases the incidence of oral cancer. On the other hand, the patient had also undergone a partial gastrointestinal resection, which is associated with impaired absorption of nutrients, and the intake of some nutrients plays an important role in maintaining the integrity and function of the oral mucosa. For example, vitamin B 12 25 26 Oral PG is prone to recurrence, with a recurrence rate of 15%. The recurrence rate of PG in the gingiva is much higher than that in other parts of the oral mucosa [ 27 The conventional treatment is surgical resection, and minimally invasive treatments include laser, corticosteroid injections, cryotherapy, and sclerotherapy [ 28 triamcinolone acetonide acetate lidocaine hydrochloride lidocaine hydrochloride 29 30 31 clobetasol propionate ointment 32 The ulcerated surface of the patient’s PG lesion is highly susceptible to colonization and infection by abundant oral bacteria. These microorganisms and their metabolites act as potent inflammatory stimuli, exacerbating local inflammatory responses. The compound chlorhexidine gargle 33 Cetylpyridinium chloride 34 ompound chlorhexidine gargle cetylpyridinium chloride Bovine bFGF gel 35 36 37 bovine bFGF gel In conclusion, this case highlights the need to differentiate ulcerative PGs from oral malignancies, prioritize the provision of non-surgical treatment options with a clear pathologic diagnosis is more acceptable for older patients, And provides insights for further clinical understanding of extragingival PGs. Despite relocation-related follow-up limitations, 1-year remission supports the efficacy. Long-term monitoring remains crucial, and future research can standardize remote assessment protocols for such cases. Abbreviations PG Pyogenic Granuloma HE Hematoxylin-Eosin OSCC Oral Squamous Cell Carcinomas TNF-α Tumor Necrosis Factor-α IFN-γ Interferon-γ VEGF Vascular Endothelial Growth Factor bFGF basic fibroblast growth factor Publisher’s Note Springer Nature remains neutral with regard to jurisdictional claims in published maps and institutional affiliations. Acknowledgements We are grateful to the patient for the permission of the use of clinical data. And we thank Dr. Yining Li, Department of Pathology, Stomatology Hospital, School of Stomatology, Zhejiang University School of Medicine, for the diagnosis of histopathology. Authors’ contributions YC Z, QH M and CX L developed the concept of the manuscript, YC Z wrote the manuscript, QH M and F S revised the manuscript, YY W collected case data and CX L performed all clinical treatment planning and implementation. All authors have read and approved the final manuscript. Funding No funding. Data availability No datasets were generated or analysed during the current study. Declarations Ethics approval and consent to participate The case report was conducted in accordance with the Declaration of Helsinki regarding medical protocols and ethics. Informed written consent was obtained from the patient before the participation in this study. Consent for publication A written informed consent for publication was obtained from the patient to publish all clinical details and images. Competing interests The authors declare no competing interests. References 1. Vilmann A Vilmann P Vilmann H Pyogenic granuloma: evaluation of oral conditions Br J Oral Maxillofac Surg 1986 24 376 82 10.1016/0266-4356(86)90023-9 2945586 Vilmann A, Vilmann P, Vilmann H. Pyogenic granuloma: evaluation of oral conditions. Br J Oral Maxillofac Surg. 1986;24:376–82. 2945586 10.1016/0266-4356(86)90023-9 2. HARTZELL MB Granuloma pyogenicum J Cutan Dis 1904 22 520 3 HARTZELL MB. Granuloma pyogenicum. J Cutan Dis. 1904;22:520–3. 3. Gomes SR Shakir QJ Thaker PV Tavadia JK Pyogenic granuloma of the gingiva: A misnomer? - A case report and review of literature J Indian Soc Periodontol 2013 17 514 9 10.4103/0972-124X.118327 24174735 PMC3800418 Gomes SR, Shakir QJ, Thaker PV, Tavadia JK. Pyogenic granuloma of the gingiva: A misnomer? - A case report and review of literature. J Indian Soc Periodontol. 2013;17:514–9. 24174735 10.4103/0972-124X.118327 PMC3800418 4. Yao T Nagai E Utsunomiya T Tsuneyoshi M An intestinal counterpart of pyogenic granuloma of the skin. A newly proposed entity Am J Surg Pathol 1995 19 1054 60 10.1097/00000478-199509000-00009 7661279 Yao T, Nagai E, Utsunomiya T, Tsuneyoshi M. An intestinal counterpart of pyogenic granuloma of the skin. A newly proposed entity. Am J Surg Pathol. 1995;19:1054–60. 7661279 10.1097/00000478-199509000-00009 5. Ashok KAK G L Pyogenic granuloma on the upper labial mucosa: a case report J Clin Diagn Res JCDR 2013 7 1244 6 23905151 10.7860/JCDR/2013/4539.3024 PMC3708246 Ashok KAK, G L. Pyogenic granuloma on the upper labial mucosa: a case report. J Clin Diagn Res JCDR. 2013;7:1244–6. 23905151 10.7860/JCDR/2013/4539.3024 PMC3708246 6. Kocaman G Beldüz N Erdogan C Ozbek E Sadik E Kara C The use of surgical nd:yag laser in an oral pyogenic granuloma: a case report J Cosmet Laser Ther Off Publ Eur Soc Laser Dermatol 2014 16 197 200 10.3109/14764172.2014.910078 24689434 Kocaman G, Beldüz N, Erdogan C, Ozbek E, Sadik E, Kara C. The use of surgical nd:yag laser in an oral pyogenic granuloma: a case report. J Cosmet Laser Ther Off Publ Eur Soc Laser Dermatol. 2014;16:197–200. 10.3109/14764172.2014.910078 24689434 7. Warnakulasuriya S Global epidemiology of oral and oropharyngeal cancer Oral Oncol 2009 45 309 16 10.1016/j.oraloncology.2008.06.002 18804401 Warnakulasuriya S. Global epidemiology of oral and oropharyngeal cancer. Oral Oncol. 2009;45:309–16. 18804401 10.1016/j.oraloncology.2008.06.002 8. Maymone MBC Greer RO Kesecker J Sahitya PC Burdine LK Cheng A-D Premalignant and malignant oral mucosal lesions: clinical and pathological findings J Am Acad Dermatol 2019 81 59 71 10.1016/j.jaad.2018.09.060 30447325 Maymone MBC, Greer RO, Kesecker J, Sahitya PC, Burdine LK, Cheng A-D, et al. Premalignant and malignant oral mucosal lesions: clinical and pathological findings. J Am Acad Dermatol. 2019;81:59–71. 30447325 10.1016/j.jaad.2018.09.060 9. Oliver AJ Helfrick JF Gard D Primary oral squamous cell carcinoma: a review of 92 cases J Oral Maxillofac Surg Off J Am Assoc Oral Maxillofac Surg 1996 54 949 54 10.1016/S0278-2391(96)90389-4 8765383 Oliver AJ, Helfrick JF, Gard D. Primary oral squamous cell carcinoma: a review of 92 cases. J Oral Maxillofac Surg Off J Am Assoc Oral Maxillofac Surg. 1996;54:949–54. discussion 955. 10.1016/s0278-2391(96)90389-4 8765383 10. Bagan J Sarrion G Jimenez Y Oral cancer: clinical features Oral Oncol 2010 46 414 7 10.1016/j.oraloncology.2010.03.009 20400366 Bagan J, Sarrion G, Jimenez Y. Oral cancer: clinical features. Oral Oncol. 2010;46:414–7. 20400366 10.1016/j.oraloncology.2010.03.009 11. Gorsky M Epstein JB Oakley C Le ND Hay J Stevenson-Moore P Carcinoma of the tongue: a case series analysis of clinical presentation, risk factors, staging, and outcome Oral Surg Oral Med Oral Pathol Oral Radiol Endod 2004 98 546 52 10.1016/j.tripleo.2003.12.041 15529126 Gorsky M, Epstein JB, Oakley C, Le ND, Hay J, Stevenson-Moore P. Carcinoma of the tongue: a case series analysis of clinical presentation, risk factors, staging, and outcome. Oral Surg Oral Med Oral Pathol Oral Radiol Endod. 2004;98:546–52. 15529126 10.1016/j.tripleo.2003.12.041 12. Howard A Agrawal N Gooi Z Lip and oral cavity squamous cell carcinoma Hematol Oncol Clin North Am 2021 35 895 911 10.1016/j.hoc.2021.05.003 34274176 Howard A, Agrawal N, Gooi Z. Lip and oral cavity squamous cell carcinoma. Hematol Oncol Clin North Am. 2021;35:895–911. 34274176 10.1016/j.hoc.2021.05.003 13. Bruce AJ Dabade TS Burkemper NM Diagnosing oral ulcers JAAPA Off J Am Acad Physician Assist 2015 28 1 10 10.1097/01.JAA.0000459826.63026.67 25621959 Bruce AJ, Dabade TS, Burkemper NM. Diagnosing oral ulcers. JAAPA Off J Am Acad Physician Assist. 2015;28:1–10. 10.1097/01.JAA.0000459826.63026.67 25621959 14. Maymone MBC Greer RO Burdine LK Dao-Cheng A Venkatesh S Sahitya PC Benign oral mucosal lesions: clinical and pathological findings J Am Acad Dermatol 2019 81 43 56 10.1016/j.jaad.2018.09.061 30447312 Maymone MBC, Greer RO, Burdine LK, Dao-Cheng A, Venkatesh S, Sahitya PC, et al. Benign oral mucosal lesions: clinical and pathological findings. J Am Acad Dermatol. 2019;81:43–56. 30447312 10.1016/j.jaad.2018.09.061 15. Wu K Yang X Li L Ruan M Liu W Lu W Neurovascular invasion and histological grade serve as the risk factors of cervical lymph node metastases in early tongue squamous cell carcinoma Mol Neurobiol 2016 53 2920 6 10.1007/s12035-015-9175-5 25911199 Wu K, Yang X, Li L, Ruan M, Liu W, Lu W, et al. Neurovascular invasion and histological grade serve as the risk factors of cervical lymph node metastases in early tongue squamous cell carcinoma. Mol Neurobiol. 2016;53:2920–6. 25911199 10.1007/s12035-015-9175-5 16. Ahmed SQ Junaid M Awan S Kazi M Khan HU Halim S Frequency of cervical nodal metastasis in early-stage squamous cell carcinoma of the tongue Int Arch Otorhinolaryngol 2018 22 136 40 10.1055/s-0037-1603626 29619101 PMC5882373 Ahmed SQ, Junaid M, Awan S, Kazi M, Khan HU, Halim S. Frequency of cervical nodal metastasis in early-stage squamous cell carcinoma of the tongue. Int Arch Otorhinolaryngol. 2018;22:136–40. 29619101 10.1055/s-0037-1603626 PMC5882373 17. Lomeli Martinez SM Carrillo Contreras NG Gómez Sandoval JR Zepeda Nuño JS Gomez Mireles JC Varela Hernández JJ Oral pyogenic granuloma: A narrative review Int J Mol Sci 2023 24 16885 10.3390/ijms242316885 38069207 PMC10706684 Lomeli Martinez SM, Carrillo Contreras NG, Gómez Sandoval JR, Zepeda Nuño JS, Gomez Mireles JC, Varela Hernández JJ, et al. Oral pyogenic granuloma: A narrative review. Int J Mol Sci. 2023;24:16885. 38069207 10.3390/ijms242316885 PMC10706684 18. Ainamo J The effect of habitual toothcleansing on the occurrence of periodontal disease and dental caries Suom Hammaslaakariseuran Toim Fin Tandlakarsallskapets Forh 1971 67 63 70 4396818 Ainamo J. The effect of habitual toothcleansing on the occurrence of periodontal disease and dental caries. Suom Hammaslaakariseuran Toim Fin Tandlakarsallskapets Forh. 1971;67:63–70. 4396818 19. Yuan K Jin YT Lin MT Expression of Tie-2, angiopoietin-1, angiopoietin-2, ephrinB2 and EphB4 in pyogenic granuloma of human gingiva implicates their roles in inflammatory angiogenesis J Periodontal Res 2000 35 165 71 10.1034/j.1600-0765.2000.035003165.x 10929871 Yuan K, Jin YT, Lin MT. Expression of Tie-2, angiopoietin-1, angiopoietin-2, ephrinB2 and EphB4 in pyogenic granuloma of human gingiva implicates their roles in inflammatory angiogenesis. J Periodontal Res. 2000;35:165–71. 10929871 10.1034/j.1600-0765.2000.035003165.x 20. Seko K Kagami H Senga K Ozeki K Mizutani H Ueda M Effects of ovariectomy and Estrogen replacement on rat oral mucosa Maturitas 2005 50 44 51 10.1016/j.maturitas.2004.03.015 15590213 Seko K, Kagami H, Senga K, Ozeki K, Mizutani H, Ueda M. Effects of ovariectomy and Estrogen replacement on rat oral mucosa. Maturitas. 2005;50:44–51. 15590213 10.1016/j.maturitas.2004.03.015 21. Silva de Araujo Figueiredo C Gonçalves Carvalho Rosalem C Costa Cantanhede AL Abreu Fonseca Thomaz ÉB, Fontoura Nogueira Da Cruz MC. Systemic alterations and their oral manifestations in pregnant women J Obstet Gynaecol Res 2017 43 16 22 10.1111/jog.13150 28074549 Silva de Araujo Figueiredo C, Gonçalves Carvalho Rosalem C, Costa Cantanhede AL. Abreu Fonseca Thomaz ÉB, Fontoura Nogueira Da Cruz MC. Systemic alterations and their oral manifestations in pregnant women. J Obstet Gynaecol Res. 2017;43:16–22. 28074549 10.1111/jog.13150 22. Palmero ML Pope E Eruptive pyogenic granulomas developing after drug hypersensitivity reaction J Am Acad Dermatol 2009 60 855 7 10.1016/j.jaad.2008.11.021 19211171 Palmero ML, Pope E. Eruptive pyogenic granulomas developing after drug hypersensitivity reaction. J Am Acad Dermatol. 2009;60:855–7. 19211171 10.1016/j.jaad.2008.11.021 23. Gutiérrez Patiño-Paul AA Un inusual Caso de granuloma Piogeno oral multiple, ¿asociado a Tratamiento Con levotiroxina? Rev Estomatológica Hered 2021 30 294 301 10.20453/reh.v30i4.3883 Gutiérrez Patiño-Paul AA. Un inusual Caso de granuloma Piogeno oral multiple, ¿asociado a Tratamiento Con levotiroxina? Rev Estomatológica Hered. 2021;30:294–301. 24. Warner-Schmidt JL Vanover KE Chen EY Marshall JJ Greengard P Antidepressant effects of selective serotonin reuptake inhibitors (SSRIs) are attenuated by antiinflammatory drugs in mice and humans Proc Natl Acad Sci U S A 2011 108 9262 7 10.1073/pnas.1104836108 21518864 PMC3107316 Warner-Schmidt JL, Vanover KE, Chen EY, Marshall JJ, Greengard P. Antidepressant effects of selective serotonin reuptake inhibitors (SSRIs) are attenuated by antiinflammatory drugs in mice and humans. Proc Natl Acad Sci U S A. 2011;108:9262–7. 21518864 10.1073/pnas.1104836108 PMC3107316 25. Brescoll J Daveluy S A review of vitamin B12 in dermatology Am J Clin Dermatol 2015 16 27 33 10.1007/s40257-014-0107-3 25559140 Brescoll J, Daveluy S. A review of vitamin B12 in dermatology. Am J Clin Dermatol. 2015;16:27–33. 25559140 10.1007/s40257-014-0107-3 26. Kitamoto S Nagao-Kitamoto H Hein R Schmidt TM Kamada N The bacterial connection between the oral cavity and the gut diseases J Dent Res 2020 99 1021 9 10.1177/0022034520924633 32464078 PMC7375741 Kitamoto S, Nagao-Kitamoto H, Hein R, Schmidt TM, Kamada N. The bacterial connection between the oral cavity and the gut diseases. J Dent Res. 2020;99:1021–9. 32464078 10.1177/0022034520924633 PMC7375741 27. Frumkin N Nashef R Shapira L Wilensky A Nonsurgical treatment of recurrent gingival pyogenic granuloma: A case report Quintessence Int Berl Ger 1985 2015 46 539 44 10.3290/j.qi.a33992 25941680 Frumkin N, Nashef R, Shapira L, Wilensky A. Nonsurgical treatment of recurrent gingival pyogenic granuloma: A case report. Quintessence Int Berl Ger 1985. 2015;46:539–44. 10.3290/j.qi.a33992 25941680 28. Deore GD Gurav AN Patil R Shete AR NaikTari RS Khiste SV Sclerotherapy: a novel bloodless approach to treat recurrent oral pyogenic granuloma associated with port-wine stain Ann Vasc Surg 2014 28 e15649 14 10.1016/j.avsg.2014.01.009 24509379 Deore GD, Gurav AN, Patil R, Shete AR, NaikTari RS, Khiste SV, et al. Sclerotherapy: a novel bloodless approach to treat recurrent oral pyogenic granuloma associated with port-wine stain. Ann Vasc Surg. 2014;28:e15649–14. 10.1016/j.avsg.2014.01.009 24509379 29. Narayanan R Kuppermann BD Corticosteroids and Anti-Complement therapy in retinal diseases Handb Exp Pharmacol 2017 242 309 20 10.1007/164_2016_22 27815789 Narayanan R, Kuppermann BD. Corticosteroids and Anti-Complement therapy in retinal diseases. Handb Exp Pharmacol. 2017;242:309–20. 27815789 10.1007/164_2016_22 30. Greenberger S Boscolo E Adini I Mulliken JB Bischoff J Corticosteroid suppression of VEGF-A in infantile hemangioma-derived stem cells N Engl J Med 2010 362 1005 13 10.1056/NEJMoa0903036 20237346 PMC2845924 Greenberger S, Boscolo E, Adini I, Mulliken JB, Bischoff J. Corticosteroid suppression of VEGF-A in infantile hemangioma-derived stem cells. N Engl J Med. 2010;362:1005–13. 20237346 10.1056/NEJMoa0903036 PMC2845924 31. Parisi E Glick PH Glick M Recurrent intraoral pyogenic granuloma with satellitosis treated with corticosteroids Oral Dis 2006 12 70 2 10.1111/j.1601-0825.2005.01158.x 16390473 Parisi E, Glick PH, Glick M. Recurrent intraoral pyogenic granuloma with satellitosis treated with corticosteroids. Oral Dis. 2006;12:70–2. 16390473 10.1111/j.1601-0825.2005.01158.x 32. Bugshan A Patel H Garber K Meiller TF Alternative therapeutic approach in the treatment of oral pyogenic granuloma Case Rep Oncol 2015 8 493 7 10.1159/000441839 26668570 PMC4677718 Bugshan A, Patel H, Garber K, Meiller TF. Alternative therapeutic approach in the treatment of oral pyogenic granuloma. Case Rep Oncol. 2015;8:493–7. 26668570 10.1159/000441839 PMC4677718 33. Cieplik F Jakubovics NS Buchalla W Maisch T Hellwig E Al-Ahmad A Resistance toward chlorhexidine in oral bacteria - is there cause for concern? Front Microbiol 2019 10 587 10.3389/fmicb.2019.00587 30967854 PMC6439480 Cieplik F, Jakubovics NS, Buchalla W, Maisch T, Hellwig E, Al-Ahmad A. Resistance toward chlorhexidine in oral bacteria - is there cause for concern? Front Microbiol. 2019;10:587. 30967854 10.3389/fmicb.2019.00587 PMC6439480 34. An V, Na F, Ks E, Mm S, Vp A. Quaternary ammonium compounds (QACs) and ionic liquids (ILs) as biocides: from simple antiseptics to tunable antimicrobials. Int J Mol Sci. 2021;22(13):6793. 10.3390/ijms22136793 PMC8268321 34202677 35. Tarnawski A Molecular mechanisms of ulcer healing Drug News Perspect 2000 13 158 68 10.1358/dnp.2000.13.3.858438 12937606 Tarnawski A. Molecular mechanisms of ulcer healing. Drug News Perspect. 2000;13:158–68. 12937606 10.1358/dnp.2000.13.3.858438 36. Lin W Peng Z Zheng A Bi J Huang Z [the effect of basic fibroblast growth factor in ovarian cancer growth and angiogenesis]. Zhonghua Yi Xue Yi Chuan Xue Za Zhi Zhonghua Yixue Yichuanxue Zazhi chin J Med Genet 2003 20 532 5 14669225 Lin W, Peng Z, Zheng A, Bi J, Huang Z. [the effect of basic fibroblast growth factor in ovarian cancer growth and angiogenesis]. Zhonghua Yi Xue Yi Chuan Xue Za Zhi Zhonghua Yixue Yichuanxue Zazhi chin. J Med Genet. 2003;20:532–5. 14669225 37. Galzie Z Fernig DG Smith JA Poston GJ Kinsella AR Invasion of human colorectal carcinoma cells is promoted by endogenous basic fibroblast growth factor Int J Cancer 1997 71 390 5 10.1002/(SICI)1097-0215(19970502)71:3&#x0003c;390::AID-IJC15&#x0003e;3.0.CO;2-K 9139874 Galzie Z, Fernig DG, Smith JA, Poston GJ, Kinsella AR. Invasion of human colorectal carcinoma cells is promoted by endogenous basic fibroblast growth factor. Int J Cancer. 1997;71:390–5. 9139874 10.1002/(sici)1097-0215(19970502)71:3<390::aid-ijc15>3.0.co;2-k ",
  "metadata": {
    "Title of this paper": "Invasion of human colorectal carcinoma cells is promoted by endogenous basic fibroblast growth factor",
    "Journal it was published in:": "BMC Oral Health",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12482719/"
  }
}