{
  "title": "Paper_198",
  "abstract": "pmc Biochem Soc Trans Biochem Soc Trans 671 portlandopen bst Biochemical Society Transactions 0300-5127 1470-8752 pmc-is-collection-domain yes pmc-collection-title Portland Press Open Access PMC12493190 PMC12493190.1 12493190 12493190 40827359 10.1042/BST20253050 BST-2025-3050 1 Review Enzymology Molecular Interactions Structural Biology Canonical and alternate mechanisms that regulate ubiquitylation by the E3 ligase parkin Basilone Nicoletta T. conceptualisation original draft figures review and editing nbasilo@uwo.ca Pimenta Viveka M. conceptualisation original draft figures review and editing vpiment2@uwo.ca https://orcid.org/0000-0002-4685-9625 Shaw Gary S. review and editing supervision funding gshaw1@uwo.ca Department of Biochemistry, The University of Western Ontario, London, ON, N6A 5C1, Canada Correspondence: gshaw1@uwo.ca 29 8 2025 18 8 2025 53 4 498259 1 13 24 2 2025 04 6 2025 30 7 2025 18 08 2025 04 10 2025 04 10 2025 © 2025 The Author(s). 2025 https://creativecommons.org/licenses/by/4.0/ This is an open access article published by Portland Press Limited on behalf of the Biochemical Society and distributed under the Creative Commons Attribution License 4.0 (CC BY) Parkin, a Ring-InBetweenRING-Rcat E3 ubiquitin ligase, plays a vital role in the clearance of damaged mitochondria (mitophagy) by ubiquitylating a broad spectrum of mitochondrial proteins. Mutations in the PRKN gene alter parkin ubiquitylation activity and are a leading cause of early-onset Parkinsonism, underlining its critical function in maintaining mitochondrial homeostasis. The structures, substrates, and ubiquitylation mechanisms used by parkin in mitophagy are well established. Yet, early studies as well as more recent proteomics studies identify alternative substrates that reside in the cytosol or other cellular compartments, suggesting potential roles for parkin beyond mitophagy. In addition to its well-documented activation via S65 phosphorylation, numerous other post-translational modifications (PTMs) have been identified in parkin. Some of these modifications have the potential to serve key regulatory mechanisms, perhaps fine-tuning parkin activity or potentially signaling the involvement in alternative cellular pathways beyond mitochondrial quality control. This review examines the canonical mechanism of parkin-mediated ubiquitylation while also exploring alternative regulatory influences that may modulate its enzyme activity. By analyzing emerging evidence on PTMs including phosphorylation, acetylation, ubiquitylation, oxidation, and interaction with alternative activating molecules, we highlight the broader functional landscape of parkin and its implications for cellular stress response. mitochondrial dysfunction parkin Parkinson’s disease protein structure ubiquitin ligases Canadian Institutes of Health Research PJT-166019 Shaw Gary S. Natural Sciences and Engineering Research Council of Canada (NSERC) 2022-04748 Shaw Gary S. NSERC Canada Graduate Scholarship – Doctoral Basilone Nicoletta T. Parkinson’s Society of Southwestern Ontario Graduate Scholarship/MITACS Accelerate Pimenta Viveka M. pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement no pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes article-lifecycle pap Introduction Mutations in the gene PRKN 1 2–7 8 Ubiquitylation involves the passage of the small protein Ub through E1, E2, and E3 enzymes, ultimately linking the C-terminus of Ub to the ε-NH 2 9 2+ 10 11 2+ 12 13 14–17 2 5 18 19–24 Figure 1 28 29 30 31 32 33 Figure 1 Autoinhibited and transthiolation states of parkin. ( A 25 B modelarchive.org 26 27 26 It is now widely recognized that parkin has important roles in mitophagy through its recruitment to mitochondria and ubiquitylation of a broad spectrum of mitochondrial proteins as a signal for removal of these damaged organelles [ 34 35 36 37 38 Canonical mechanism of parkin leading to mitophagy The recruitment of parkin to the outer mitochondrial membrane (OMM) is an initial step for mitophagy, the canonical pathway for parkin function. Under basal conditions, parkin is cytosolic and exists in an auto-inhibited conformation with minimal ubiquitylation activity ( Figure 1 22 25 39 40 41–43 44–46 36 40–42 47 25 39 48 25 39 48 49 50 51 52 Figure 1 53 54 26 26 Figure 1 31 55 56 41 57 34 35 58–60 Alternate modes that regulate parkin activity—phosphorylation In addition to PINK1-mediated S65 phosphorylation of parkin, which occurs exclusively at the OMM, 12 supplemental phosphorylation sites are reproducibly observed in the literature ( Figure 2 phosphosite.org in vivo in vitro 62 63 64 65 66–68 69 70 71 72 73 72 Figure 2 Post-translational modifications of parkin. ( A 25 61 K76, K129, K220, K349 K27, K48, K76, K129, K220, K349, K435 K76 2+ B A https://BioRender.com/sepbsyy Seven phosphorylation sites lie within the 65-residue unstructured linker that joins the Ubl and RING0 domains ( Figure 2 64 64 53 62 63 2+ 74 75 65 69 The remaining two phosphorylation sites lie in the RING1 (S296) and immediately following the IBR (S378) domains. As described above, these sites are constitutively phosphorylated but rapidly turned over due to dephosphorylation in vivo. Polo-like kinase (Plk1)-driven phosphorylation of S378 during mitosis shows enhanced ubiquitylation by parkin of mitotic substrates such as cyclin B1 and securin in a PINK1-independent fashion [ 71 73 72 Phosphorylation of Ub also affects parkin activation. While pUb S65 76 77 78 In vitro S57 S65 76 in vitro 36 79 80 Alternate modes that regulate parkin activity—acetylation and ubiquitylation Acetylation and ubiquitylation of enzymes in ubiquitylation pathways can have dramatic effects on activity and outcomes [ 81 82 21 83 84 Figure 2 36 37 83 83 K6R 85 85 86 87 One ligase found to ubiquitylate parkin is MITOL, which assembles K48-linked chains at K220 of the RING0 domain and targets S65 phosphorylated parkin for degradation [ 84 88 88 28 88 Acetylation is known to modulate autophagy activity, as acetylation of Ub results in the absence and reduced elongation of chains [ 89 PINK1 90 91 92 92 Alternate modes that regulate parkin activity—oxidation Parkin recruited to mitochondria and activated under oxidative stress is highly sensitive to oxidative modification [ 4 93 94 2+ 95 96 2 3 97 98–101 For parkin, the close relationship between cysteine modifications and ubiquitylation activity is highlighted by the sensitivity of PD substitutions to Zn 2+ 2+ 6 7 87 102–105 36 41 2+ 102 2+ 4 2+ Isolated brain tissue lysates of PD patients show increased parkin oxidation and insolubility compared with age-matched controls [ 94 106 Figure 2 94 107 108 94 106 109 107 110 Of the 35 cysteine residues in human parkin, nearly all are capable of being oxidized in vivo in vitro 2 2 94 106 2 3 2 2 Figure 2 Can other Ubl proteins alter parkin activity? The interaction of parkin with pUb is a main driving force to relieve auto-inhibition. Recently, it was observed that mitochondrial substrates such as Miro1 and CISD1, tethered to phosphorylated Ub, are efficiently ubiquitylated even in the absence of parkin phosphorylation by PINK1 [ 111 112 113 114 115 The observation of interacting proteins and possible ubiquitylated substrates for parkin that are not associated with the mitochondria suggests that other activating molecules may exist in the cytosol or other organelles. As described earlier, alternate phosphorylated forms of Ub are capable of activating parkin [ 76 in vitro 45 116 117 in vitro 116 117 118–120 In vitro 20 86 Not surprisingly, several of these Ubls are already known to modify E3s and modulate their activity, function, or localization through covalent modification [ 66 121–124 122 123 123 66 21 48 50 Parkin works with the E1-activating enzyme UBA6 and E2-conjugating enzyme USE1 to add the Ubl protein FAT10 (FAT10ylate) to itself at two or more sites and to the mitochondrial protein mitofusin-2 [ 121 One study shows SUMO1 interacts with parkin noncovalently to promote translocation to the nucleus and increase auto-ubiquitylation; however, the impact this interaction has on substrate ubiquitylation is not yet resolved [ 125 Summary and conclusions The response of parkin to oxidative stress and its subsequent ubiquitylation of mitochondrial proteins that trigger mitophagy is firmly established. However, parkin also localizes to other cellular compartments including nuclei, Golgi network, and secretory vesicles [ 125–128 15 16 63 14 129 130 in vitro in vivo Perspectives Mutations in the gene PRKN Parkin is inactive in the cytosol but is activated through binding to phosphorylated Ub at the outer mitochondrial surface and further phosphorylated by the kinase PINK1. Structural experiments have revealed the mechanisms and conformational changes in parkin needed to trigger Ub transfer, though recognition of substrates is only now being established. More than 25 auxiliary post-translational modifications (phosphorylation, acetylation, oxidation) have been identified in parkin. Future studies are needed to explore many of these alternate modifications to determine how these might modulate or fine-tune parkin regulation under different cellular conditions. This may reveal new mechanisms for parkin’s role in PD. Competing Interests The authors declare that there are no competing interests associated with the manuscript. Funding This work was supported by a research grants from the Canadian Institutes of Health Research [PJT-166019] and the Natural Sciences and Engineering Research Council of Canada (NSERC, 2022-04748) (GSS), an NSERC Canada Graduate Scholarship – Doctoral (NTB), and a Parkinson’s Society of Southwestern Ontario Graduate Scholarship/MITACS Accelerate award (VMP). CRediT Author Contribution N.T. Basilone: conceptualisation, original draft, figures, review and editing. V.M. Pimenta: conceptualisation, original draft, figures, review and editing. G.S. Shaw: review and editing, supervision, funding Abbreviations PD Parkinson’s disease PTMs post-translational modifications RBR Ring-InBetweenRING-Rcat ROS reactive oxygen species Ub ubiquitin Ubl ubiquitin-like References 1 Kitada T. Asakawa S. Hattori N. Matsumine H. Yamamura Y. Minoshima S. et al 1998 Mutations in the parkin gene cause autosomal recessive juvenile parkinsonism Nature 392 605 608 10.1038/33416 9560156 2 Henn I.H. Gostner J.M. Lackner P. Tatzelt J. Winklhofer K.F 2005 Pathogenic mutations inactivate parkin by distinct mechanisms J. Neurochem. 92 114 122 10.1111/j.1471-4159.2004.02854.x 15606901 3 Schlehe J.S. Lutz A.K. Pilsl A. Lämmermann K. Grgur K. Henn I.H. et al 2008 Aberrant folding of pathogenic Parkin mutants: aggregation versus degradation J. Biol. Chem. 283 13771 13779 10.1074/jbc.M707494200 18362144 4 Winklhofer K.F. Henn I.H. Kay-Jackson P.C. Heller U. Tatzelt J 2003 Inactivation of parkin by oxidative stress and c-terminal truncations Journal of Biological Chemistry 278 47199 47208 10.1074/jbc.M306769200 12972428 5 Sriram S.R. Li X. Ko H.S. Chung K.K.K. Wong E. Lim K.L. et al 2005 Familial-associated mutations differentially disrupt the solubility, localization, binding and ubiquitination properties of parkin Hum. Mol. Genet. 14 2571 2586 10.1093/hmg/ddi292 16049031 6 Wang C. Ko H.S. Thomas B. Tsang F. Chew K.C.M. Tay S.P. et al 2005 Stress-induced alterations in parkin solubility promote parkin aggregation and compromise parkin’s protective function Hum. Mol. Genet. 14 3885 3897 10.1093/hmg/ddi413 16278233 7 Gu W.J. Corti O. Araujo F. Hampe C. Jacquier S. Lücking C.B. et al 2003 The C289G and C418R missense mutations cause rapid sequestration of human Parkin into insoluble aggregates Neurobiol. Dis. 14 357 364 10.1016/j.nbd.2003.08.011 14678753 8 Schapira A.H.V. Olanow C.W 2004 Neuroprotection in Parkinson disease: mysteries, myths, and misconceptions JAMA 291 358 364 10.1001/jama.291.3.358 14734599 9 Hershko A. Ciechanover A 1998 THE UBIQUITIN SYSTEM Annu. Rev. Biochem. 67 425 479 10.1146/annurev.biochem.67.1.425 9759494 10 Budhidarmo R. Nakatani Y. Day C.L 2012 RINGs hold the key to ubiquitin transfer Trends Biochem. Sci. 37 58 65 10.1016/j.tibs.2011.11.001 22154517 11 Weber J. Polo S. Maspero E 2019 HECT E3 Ligases: a tale with multiple facets Front. Physiol. 10 370 10.3389/fphys.2019.00370 31001145 PMC6457168 12 Marín I. Ferrús A 2002 Comparative genomics of the RBR family, including the Parkinson’s disease-related gene parkin and the genes of the ariadne subfamily Mol. Biol. Evol. 19 2039 2050 10.1093/oxfordjournals.molbev.a004029 12446796 13 Shimura H. Hattori N. Kubo S. i Mizuno Y. Asakawa S. Minoshima S. et al 2000 Familial Parkinson disease gene product, parkin, is a ubiquitin-protein ligase Nat. Genet. 25 302 305 302 10.1038/77060 10888878 14 Zhang Y. Gao J. Chung K.K.K. Huang H. Dawson V.L. Dawson T.M 2000 Parkin functions as an E2-dependent ubiquitin– protein ligase and promotes the degradation of the synaptic vesicle-associated protein, CDCrel-1 Proc. Natl. Acad. Sci. U.S.A 97 13354 13359 10.1073/pnas.240347797 11078524 PMC27228 15 Shin J.-H. Ko H.S. Kang H. Lee Y. Lee Y.-I. Pletinkova O. et al 2011 PARIS (ZNF746) Repression of PGC-1α contributes to neurodegeneration in Parkinson’s Disease Cell 144 689 702 10.1016/j.cell.2011.02.010 21376232 PMC3063894 16 Imai Y. Soda M. Inoue H. Hattori N. Mizuno Y. Takahashi R 2001 An unfolded putative transmembrane polypeptide, which can lead to endoplasmic reticulum stress, is a substrate of Parkin Cell 105 891 902 10.1016/s0092-8674(01)00407-x 11439185 17 Chung K.K.K. Zhang Y. Lim K.L. Tanaka Y. Huang H. Gao J. et al 2001 Parkin ubiquitinates the α-synuclein–interacting protein, synphilin-1: implications for Lewy-body formation in Parkinson disease Nat. Med. 7 1144 1150 10.1038/nm1001-1144 11590439 18 Aguirre J.D. Dunkerley K.M. Lam R. Rusal M. Shaw G.S 2018 Impact of altered phosphorylation on loss of function of juvenile Parkinsonism-associated genetic variants of the E3 ligase parkin J. Biol. Chem. 293 6337 6348 10.1074/jbc.RA117.000605 29530980 PMC5925814 19 Beasley S.A. Hristova V.A. Shaw G.S 2007 Structure of the Parkin in-between-ring domain provides insights for E3-ligase dysfunction in autosomal recessive Parkinson’s disease Proc. Natl. Acad. Sci. U.S.A. 104 3095 3100 10.1073/pnas.0610548104 17360614 PMC1805599 20 Riley B.E. Lougheed J.C. Callaway K. Velasquez M. Brecht E. Nguyen L. et al 2013 Structure and function of Parkin E3 ubiquitin ligase reveals aspects of RING and HECT ligases Nat. Commun. 4 1982 10.1038/ncomms2982 23770887 PMC3709503 21 Spratt D.E. Martinez-Torres R.J. Noh Y.J. Mercier P. Manczyk N. Barber K.R. et al 2013 A molecular explanation for the recessive nature of parkin-linked Parkinson’s disease Nat. Commun. 4 1983 10.1038/ncomms2983 23770917 PMC3709501 22 Trempe J.F. Sauvé V. Grenier K. Seirafi M. Tang M.Y. Ménade M. et al 2013 Structure of parkin reveals mechanisms for ubiquitin ligase activation Science 340 1451 1455 10.1126/science.1237908 23661642 23 Wauer T. Komander D 2013 Structure of the human Parkin ligase domain in an autoinhibited state EMBO J. 32 2099 2112 10.1038/emboj.2013.125 23727886 PMC3730226 24 Sakata E. Yamaguchi Y. Kurimoto E. Kikuchi J. Yokoyama S. Yamada S. et al 2003 Parkin binds the Rpn10 subunit of 26S proteasomes through its ubiquitin-like domain EMBO Rep. 4 301 306 10.1038/sj.embor.embor764 12634850 PMC1315892 25 Kumar A. Aguirre J.D. Condos T.E.C. Martinez-Torres R.J. Chaugule V.K. Toth R. et al 2015 Disruption of the autoinhibited state primes the E3 ligase parkin for activation and catalysis EMBO J. 34 2506 2521 10.15252/embj.201592337 26254304 PMC4609183 26 Connelly E.M. Rintala-Dempsey A.C. Gundogdu M. Freeman E.A. Koszela J. Aguirre J.D. et al 2024 Capturing the catalytic intermediates of parkin ubiquitination Proc. Natl. Acad. Sci. U.S.A. 121 e2403114121 10.1073/pnas.2403114121 39078678 PMC11317638 27 Wagner J.P. Sauvé V. Saran A. Gehring K 2025 Structural basis for the pathogenicity of parkin catalytic domain mutants Journal of Biological Chemistry 301 108051 10.1016/j.jbc.2024.108051 39631693 PMC11742612 28 Chaugule V.K. Burchell L. Barber K.R. Sidhu A. Leslie S.J. Shaw G.S. et al 2011 Autoregulation of Parkin activity through its ubiquitin-like domain EMBO J. 30 2853 2867 10.1038/emboj.2011.204 21694720 PMC3160258 29 Wenzel D.M. Lissounov A. Brzovic P.S. Klevit R.E 2011 UBCH7 reactivity profile reveals parkin and HHARI to be RING/HECT hybrids Nature 474 105 108 10.1038/nature09966 21532592 PMC3444301 30 Duda D.M. Olszewski J.L. Schuermann J.P. Kurinov I. Miller D.J. Nourse A et al 2013 Structure of HHARI, a RING-IBR-RING ubiquitin ligase: autoinhibition of an Ariadne-family E3 and insights into ligation mechanism Structure 21 1030 1041 10.1016/j.str.2013.04.019 23707686 PMC3747818 31 Lechtenberg B.C. Rajput A. Sanishvili R. Dobaczewska M.K. Ware C.F. Mace P.D. et al 2016 Structure of a HOIP/E2~ubiquitin complex reveals RBR E3 ligase mechanism and regulation Nature 529 546 550 10.1038/nature16511 26789245 PMC4856479 32 Cotton T.R. Cobbold S.A. Bernardini J.P. Richardson L.W. Wang X.S. Lechtenberg B.C 2022 Structural basis of K63-ubiquitin chain formation by the Gordon-Holmes syndrome RBR E3 ubiquitin ligase RNF216 Mol. Cell 82 598 615 10.1016/j.molcel.2021.12.005 34998453 33 Spratt D.E. Walden H. Shaw G.S 2014 RBR E3 ubiquitin ligases: new structures, new insights, new questions Biochem. J. 458 421 437 10.1042/BJ20140006 24576094 PMC3940038 34 Harper J.W. Ordureau A. Heo J.-M 2018 Building and decoding ubiquitin chains for mitophagy Nat. Rev. Mol. Cell Biol. 19 93 108 93 10.1038/nrm.2017.129 29358684 35 Narendra D.P. Youle R.J 2024 The role of PINK1-Parkin in mitochondrial quality control Nat. Cell Biol. 26 1639 1651 10.1038/s41556-024-01513-9 39358449 36 Ordureau A. Sarraf S.A. Duda D.M. Heo J.-M. Jedrychowski M.P. Sviderskiy V.O et al 2014 Quantitative proteomics reveal a feedforward mechanism for mitochondrial PARKIN translocation and ubiquitin chain synthesis Mol. Cell 56 360 375 10.1016/j.molcel.2014.09.007 25284222 PMC4254048 37 Sarraf S.A. Raman M. Guarani-Pereira V. Sowa M.E. Huttlin E.L. Gygi S.P. et al 2013 Landscape of the PARKIN-dependent ubiquitylome in response to mitochondrial depolarization Nature 496 372 376 372 10.1038/nature12043 23503661 PMC3641819 38 Agarwal E. Goldman A.R. Tang H.-Y. Kossenkov A.V. Ghosh J.C. Languino L.R. et al 2021 A cancer ubiquitome landscape identifies metabolic reprogramming as target of Parkin tumor suppression Sci. Adv. 7 eabg7287 10.1126/sciadv.abg7287 34433563 PMC8386929 39 Sauvé V. Lilov A. Seirafi M. Vranas M. Rasool S. Kozlov G. et al 2015 A Ubl/ubiquitin switch in the activation of Parkin EMBO J. 34 2492 2505 10.15252/embj.201592237 26254305 PMC4609182 40 Narendra D. Tanaka A. Suen D.-F. Youle R.J 2008 Parkin is recruited selectively to impaired mitochondria and promotes their autophagy J. Cell Biol. 183 795 803 10.1083/jcb.200809125 19029340 PMC2592826 41 Geisler S. Holmström K.M. Skujat D. Fiesel F.C. Rothfuss O.C. Kahle P.J. et al 2010 PINK1/Parkin-mediated mitophagy is dependent on VDAC1 and p62/SQSTM1 Nat. Cell Biol. 12 119 131 10.1038/ncb2012 20098416 42 Matsuda N. Sato S. Shiba K. Okatsu K. Saisho K. Gautier C.A. et al 2010 PINK1 stabilized by mitochondrial depolarization recruits Parkin to damaged mitochondria and activates latent Parkin for mitophagy J. Cell Biol. 189 211 221 10.1083/jcb.200910140 20404107 PMC2856912 43 Narendra D.P. Jin S.M. Tanaka A. Suen D.F. Gautier C.A. Shen J. et al 2010 PINK1 is selectively stabilized on impaired mitochondria to activate Parkin PLoS Biol. 8 e1000298 10.1371/journal.pbio.1000298 20126261 PMC2811155 44 Kane L.A. Lazarou M. Fogel A.I. Li Y. Yamano K. Sarraf S.A. et al 2014 PINK1 phosphorylates ubiquitin to activate Parkin E3 ubiquitin ligase activity J. Cell Biol. 205 143 153 10.1083/jcb.201402104 24751536 PMC4003245 45 Kazlauskaite A. Kondapalli C. Gourlay R. Campbell D.G. Ritorto M.S. Hofmann K. et al 2014 Parkin is activated by PINK1-dependent phosphorylation of ubiquitin at Ser65 Biochem. J. 460 127 139 10.1042/BJ20140334 24660806 PMC4000136 46 Koyano F. Okatsu K. Kosako H. Tamura Y. Go E. Kimura M. et al 2014 Ubiquitin is phosphorylated by PINK1 to activate parkin Nature 510 162 166 10.1038/nature13392 24784582 47 Shiba-Fukushima K. Arano T. Matsumoto G. Inoshita T. Yoshida S. Ishihama Y. et al 2014 Phosphorylation of Mitochondrial Polyubiquitin by PINK1 Promotes Parkin Mitochondrial Tethering PLOS Genet. 10 e1004861 10.1371/journal.pgen.1004861 25474007 PMC4256268 48 Wauer T. Simicek M. Schubert A. Komander D 2015 Mechanism of phospho-ubiquitin-induced PARKIN activation Nature 524 370 374 10.1038/nature14879 26161729 PMC4984986 49 Condos T.E. Dunkerley K.M. Freeman E.A. Barber K.R. Aguirre J.D. Chaugule V.K. et al 2018 Synergistic recruitment of UbcH7~Ub and phosphorylated Ubl domain triggers parkin activation EMBO J. 37 e100014 10.15252/embj.2018100014 30446597 PMC6276879 50 Kumar A. Chaugule V.K. Condos T.E.C. Barber K.R. Johnson C. Toth R. et al 2017 Parkin-phosphoubiquitin complex reveals cryptic ubiquitin-binding site required for RBR ligase activity Nat. Struct. Mol. Biol. 24 475 483 10.1038/nsmb.3400 28414322 PMC5420311 51 Kondapalli C. Kazlauskaite A. Zhang N. Woodroof H.I. Campbell D.G. Gourlay R. et al 2012 PINK1 is activated by mitochondrial membrane potential depolarization and stimulates Parkin E3 ligase activity by phosphorylating Serine 65 Open Biol. 2 120080 10.1098/rsob.120080 22724072 PMC3376738 52 Shiba-Fukushima K. Imai Y. Yoshida S. Ishihama Y. Kanao T. Sato S. et al 2012 PINK1-mediated phosphorylation of the Parkin ubiquitin-like domain primes mitochondrial translocation of Parkin and regulates mitophagy Sci. Rep. 2 1002 10.1038/srep01002 23256036 PMC3525937 53 Gladkova C. Maslen S.L. Skehel J.M. Komander D 2018 Mechanism of parkin activation by PINK1 Nature 559 410 414 10.1038/s41586-018-0224-x 29995846 PMC6071873 54 Sauvé V. Sung G. Soya N. Kozlov G. Blaimschein N. Miotto L.S. et al 2018 Mechanism of parkin activation by phosphorylation Nat. Struct. Mol. Biol. 25 623 630 10.1038/s41594-018-0088-7 29967542 55 Horn-Ghetko D. Krist D.T. Prabu J.R. Baek K. Mulder M.P.C. Klügel M. et al 2021 Ubiquitin ligation to F-box protein targets by SCF-RBR E3-E3 super-assembly Nature 590 671 676 10.1038/s41586-021-03197-9 33536622 PMC7904520 56 Ordureau A. Heo J.M. Duda D.M. Paulo J.A. Olszewski J.L. Yanishevski D. et al 2015 Defining roles of PARKIN and ubiquitin phosphorylation by PINK1 in mitochondrial quality control using a ubiquitin replacement strategy Proc. Natl. Acad. Sci. U.S.A. 112 6637 6642 10.1073/pnas.1506593112 25969509 PMC4450373 57 Kumar M. Acevedo-Cintrón J. Jhaldiyal A. Wang H. Andrabi S.A. Eacker S et al 2020 Defects in Mitochondrial Biogenesis Drive Mitochondrial Alterations in PARKIN-Deficient Human Dopamine Neurons Stem Cell Reports 15 629 645 10.1016/j.stemcr.2020.07.013 32795422 PMC7486221 58 Connelly E.M. Frankel K.S. Shaw G.S 2023 Parkin and mitochondrial signalling Cell. Signal 106 110631 10.1016/j.cellsig.2023.110631 36803775 59 Gundogdu M. Tadayon R. Salzano G. Shaw G.S. Walden H 2021 A mechanistic review of Parkin activation Biochimica et Biophysica Acta (BBA) - General Subjects 1865 129894 10.1016/j.bbagen.2021.129894 33753174 60 Trempe J.F. Gehring K 2023 Structural mechanisms of mitochondrial quality control mediated by PINK1 and Parkin J. Mol. Biol 435 168090 10.1016/j.jmb.2023.168090 37054910 61 Pettersen E.F. Goddard T.D. Huang C.C. Couch G.S. Greenblatt D.M. Meng E.C. et al 2004 UCSF Chimera—A visualization system for exploratory research and analysis J. Comput. Chem. 25 1605 1612 10.1002/jcc.20084 15264254 62 Lee S.B. Kim J.J. Han S.A. Fan Y. Guo L.S. Aziz K. et al 2019 The AMPK-Parkin axis negatively regulates necroptosis and tumorigenesis by inhibiting the necrosome Nat. Cell Biol. 21 940 951 10.1038/s41556-019-0356-8 31358971 PMC6679774 63 Song P. Peng W. Sauve V. Fakih R. Xie Z. Ysselstein D et al 2023 Parkinson’s disease-linked parkin mutation disrupts recycling of synaptic vesicles in human dopaminergic neurons Neuron 111 3775 3788 10.1016/j.neuron.2023.08.018 37716354 PMC11977536 64 Hung C.M. Lombardo P.S. Malik N. Brun S.N. Hellberg K. Van Nostrand J.L. et al 2021 AMPK/ULK1-mediated phosphorylation of Parkin ACT domain mediates an early step in mitophagy Sci. Adv. 7 eabg4544 10.1126/sciadv.abg4544 33827825 PMC8026119 65 Kapadia B.B. Roychowdhury A. Kayastha F. Nanaji N. Gartenhaus R.B 2022 PARK2 regulates eIF4B-driven lymphomagenesis Mol. Cancer Res. 20 735 748 10.1158/1541-7786.MCR-21-0729 35105670 PMC9339581 66 Im E. Yoo L. Hyun M. Shin W.H. Chung K.C 2016 Covalent ISG15 conjugation positively regulates the ubiquitin E3 ligase activity of parkin Open Biol. 6 160193 10.1098/rsob.160193 27534820 PMC5008018 67 Chen J. Ren Y. Gui C. Zhao M. Wu X. Mao K. et al 2018 Phosphorylation of Parkin at serine 131 by p38 MAPK promotes mitochondrial dysfunction and neuronal death in mutant A53T α-synuclein model of Parkinson’s disease Cell Death Dis. 9 700 10.1038/s41419-018-0722-7 29899409 PMC5999948 68 Zhong J. Li M. Xu J. Dong W. Qin Y. Qiu S. et al 2022 Roflupram attenuates α-synuclein-induced cytotoxicity and promotes the mitochondrial translocation of Parkin in SH-SY5Y cells overexpressing A53T mutant α-synuclein Toxicol. Appl. Pharmacol. 436 115859 10.1016/j.taap.2021.115859 34990728 69 Avraham E. Rott R. Liani E. Szargel R. Engelender S 2007 Phosphorylation of Parkin by the Cyclin-dependent Kinase 5 at the Linker Region Modulates Its Ubiquitin-Ligase Activity and Aggregation Journal of Biological Chemistry 282 12842 12850 10.1074/jbc.M608243200 17327227 70 Ko H.S. Lee Y. Shin J.H. Karuppagounder S.S. Gadad B.S. Koleske A.J. et al 2010 Phosphorylation by the c-Abl protein tyrosine kinase inhibits parkin’s ubiquitination and protective function Proc. Natl. Acad. Sci. U.S.A 107 16691 16696 10.1073/pnas.1006083107 20823226 PMC2944759 71 Lee S.B. Kim J.J. Nam H.J. Gao B. Yin P. Qin B. et al 2015 Parkin Regulates Mitosis and Genomic Stability through Cdc20/Cdh1 Mol. Cell 60 21 34 10.1016/j.molcel.2015.08.011 26387737 PMC4592523 72 Rubio de la Torre E. Luzon-Toro B. Forte-Lago I. Minguez-Castellanos A. Ferrer I. Hilfiker S Combined kinase inhibition modulates parkin inactivation Hum. Mol. Genet. 10.1093/hmg/ddn407 PMC2640208 19050041 73 Yamamoto A. Friedlein A. Imai Y. Takahashi R. Kahle P.J. Haass C 2005 Parkin Phosphorylation and Modulation of Its E3 Ubiquitin Ligase Activity Journal of Biological Chemistry 280 3390 3399 10.1074/jbc.M407724200 15557340 74 Koszela J. Rintala-Dempsey A. Salzano G. Pimenta V. Kamarainen O. Gabrielsen M. et al 2025 A substrate-interacting region of Parkin directs ubiquitination of the mitochondrial GTPase Miro1 Journal of Cell Biology 224 10.1083/jcb.202408025 PMC12203984 40576561 75 Covill-Cooke C. Kwizera B. López-Doménech G. Thompson C.O. Cheung N.J. Cerezo E. et al 2024 Shared structural features of Miro binding control mitochondrial homeostasis EMBO J. 43 595 614 10.1038/s44318-024-00028-1 38267654 PMC10897228 76 George S. Wang S.M. Bi Y. Treidlinger M. Barber K.R. Shaw G.S. et al 2017 Ubiquitin phosphorylated at Ser57 hyper-activates parkin Biochimica et Biophysica Acta (BBA) - General Subjects 1861 3038 3046 10.1016/j.bbagen.2017.06.023 28689991 77 Hepowit N.L. Pereira K.N. Tumolo J.M. Chazin W.J. MacGurn J.A Identification of ubiquitin Ser57 kinases regulating the oxidative stress response in yeast Elife 9 10.7554/eLife.58155 PMC7647399 33074099 78 Hepowit N.L. Kolbe C.C. Zelle S.R. Latz E. MacGurn J.A 2022 Regulation of ubiquitin and ubiquitin-like modifiers by phosphorylation FEBS J. 289 4797 4810 10.1111/febs.16101 34214249 PMC9271371 79 George S. Aguirre J.D. Spratt D.E. Bi Y. Jeffery M. Shaw G.S. et al 2016 Generation of phospho-ubiquitin variants by orthogonal translation reveals codon skipping FEBS Lett. 590 1530 1542 10.1002/1873-3468.12182 27096575 80 Wauer T. Swatek K.N. Wagstaff J.L. Gladkova C. Pruneda J.N. Michel M.A. et al 2015 Ubiquitin Ser65 phosphorylation affects ubiquitin structure, chain assembly and hydrolysis EMBO J. 34 307 325 10.15252/embj.201489847 25527291 PMC4339119 81 Lacoursiere R.E. Hadi D. Shaw G.S 2022 Acetylation, phosphorylation, ubiquitination (Oh My!): following post-translational modifications on the ubiquitin road Biomolecules 12 467 10.3390/biom12030467 35327659 PMC8946176 82 Song L. Luo Z.-Q 2019 Post-translational regulation of ubiquitin signaling J. Cell Biol. 218 1776 1786 10.1083/jcb.201902074 31000580 PMC6548142 83 Durcan T.M. Tang M.Y. Pérusse J.R. Dashti E.A. Aguileta M.A. McLelland G.-L. et al 2014 USP8 regulates mitophagy by removing K6-linked ubiquitin conjugates from parkin EMBO J. 33 2473 2491 10.15252/embj.201489729 25216678 PMC4283406 84 Shiiba I. Takeda K. Nagashima S. Ito N. Tokuyama T. Yamashita S.I. et al 2021 MITOL promotes cell survival by degrading Parkin during mitophagy EMBO Rep. 22 e49097 10.15252/embr.201949097 33565245 PMC7926225 85 Niu K. Fang H. Chen Z. Zhu Y. Tan Q. Wei D. et al 2020 USP33 deubiquitinates PRKN/parkin and antagonizes its role in mitophagy Autophagy 16 724 734 10.1080/15548627.2019.1656957 31432739 PMC7138199 86 Burchell L. Chaugule V.K. Walden H 2012 Small, N-terminal tags activate Parkin E3 ubiquitin ligase activity by disrupting its autoinhibited conformation PLOS ONE 7 e34748 10.1371/journal.pone.0034748 22496854 PMC3319606 87 Matsuda N. Kitami T. Suzuki T. Mizuno Y. Hattori N. Tanaka K 2006 Diverse effects of pathogenic mutations of Parkin that catalyze multiple monoubiquitylation in vitro J. Biol. Chem. 281 3204 3209 10.1074/jbc.M510393200 16339143 88 Liu J.Y. Inoshita T. Shiba-Fukushima K. Yoshida S. Ogata K. Ishihama Y. et al 2022 Ubiquitination at the lysine 27 residue of the Parkin ubiquitin-like domain is suggestive of a new mechanism of Parkin activation Hum. Mol. Genet. 31 2623 2638 10.1093/hmg/ddac064 35313349 PMC9396936 89 Ohtake F. Saeki Y. Sakamoto K. Ohtake K. Nishikawa H. Tsuchiya H. et al 2015 Ubiquitin acetylation inhibits polyubiquitin chain elongation EMBO Rep. 16 192 201 10.15252/embr.201439152 25527407 PMC4328746 90 De Talhouët C Esteras N. Soutar M.P.M. O’Callaghan B. Plun-Favreau H 2024 KAT8 compound inhibition inhibits the initial steps of PINK1-dependant mitophagy Sci. Rep. 14 11721 10.1038/s41598-024-60602-9 38777823 PMC11111795 91 Cartelli D. Amadeo A. Calogero A.M. Casagrande F.V.M. De Gregorio C. Gioria M et al 2018 Parkin absence accelerates microtubule aging in dopaminergic neurons Neurobiol. Aging 61 66 74 10.1016/j.neurobiolaging.2017.09.010 29040870 92 Sun X. Shu Y. Ye G. Wu C. Xu M. Gao R. et al 2022 Histone deacetylase inhibitors inhibit cervical cancer growth through Parkin acetylation-mediated mitophagy Acta Pharm. Sin. B 12 838 852 10.1016/j.apsb.2021.07.003 35256949 PMC8897022 93 LaVoie M.J. Cortese G.P. Ostaszewski B.L. Schlossmacher M.G 2007 The effects of oxidative stress on parkin and other E3 ligases J. Neurochem. 103 2354 2368 10.1111/j.1471-4159.2007.04911.x 17883392 94 Meng F. Yao D. Shi Y. Kabakoff J. Wu W. Reicher J. et al 2011 Oxidation of the cysteine-rich regions of parkin perturbs its E3 ligase activity and contributes to protein aggregation Mol. Neurodegener. 6 34 10.1186/1750-1326-6-34 21595948 PMC3120712 95 Moosmann B. Behl C 2008 Mitochondrially encoded cysteine predicts animal lifespan Aging Cell 7 32 46 10.1111/j.1474-9726.2007.00349.x 18028257 96 Hristova V.A. Beasley S.A. Rylett R.J. Shaw G.S 2009 Identification of a novel Zn2+-binding domain in the autosomal recessive juvenile Parkinson-related E3 ligase parkin J. Biol. Chem. 284 14978 14986 10.1074/jbc.M808700200 19339245 PMC2685680 97 Garrido Ruiz D. Sandoval-Perez A. Rangarajan A.V. Gunderson E.L. Jacobson M.P 2022 Cysteine oxidation in proteins: structure, biophysics, and simulation Biochemistry 61 2165 2176 10.1021/acs.biochem.2c00349 36161872 PMC9583617 98 Weerapana E. Wang C. Simon G.M. Richter F. Khare S. Dillon M.B.D. et al 2010 Quantitative reactivity profiling predicts functional cysteines in proteomes Nature 468 790 795 10.1038/nature09472 21085121 PMC3058684 99 Verrastro I. Pasha S. Jensen K.T. Pitt A.R. Spickett C.M 2015 Mass spectrometry-based methods for identifying oxidized proteins in disease: advances and challenges Biomolecules 5 378 411 10.3390/biom5020378 25874603 PMC4496678 100 Gould N.S. Evans P. Martínez-Acedo P. Marino S.M. Gladyshev V.N. Carroll K.S. et al 2015 Site-Specific Proteomic Mapping Identifies Selectively Modified Regulatory Cysteine Residues in Functionally Distinct Protein Networks Chem. Biol. 22 965 975 10.1016/j.chembiol.2015.06.010 26165157 PMC4515171 101 Kuljanin M. Mitchell D.C. Schweppe D.K. Gikandi A.S. Nusinow D.P. Bulloch N.J. et al 2021 Reimagining high-throughput profiling of reactive cysteines for cell-based screening of large electrophile libraries Nat. Biotechnol. 39 630 641 10.1038/s41587-020-00778-3 33398154 PMC8316984 102 Wong E.S.P. Tan J.M.M. Wang C. Zhang Z. Tay S.P. Zaiden N. et al 2007 Relative sensitivity of parkin and other cysteine-containing enzymes to stress-induced solubility alterations J. Biol. Chem. 282 12310 12318 10.1074/jbc.M609466200 17329252 103 Hampe C. Ardila-Osorio H. Fournier M. Brice A. Corti O 2006 Biochemical analysis of Parkinson’s disease-causing variants of Parkin, an E3 ubiquitin–protein ligase with monoubiquitylation capacity Hum. Mol. Genet. 15 2059 2075 10.1093/hmg/ddl131 16714300 104 Yi W. MacDougall E.J. Tang M.Y. Krahn A.I. Gan-Or Z. Trempe J.F. et al 2019 The landscape of Parkin variants reveals pathogenic mechanisms and therapeutic targets in Parkinson’s disease Hum. Mol. Genet. 28 2811 2825 10.1093/hmg/ddz080 30994895 PMC6736174 105 Fiesel F.C. Caulfield T.R. Moussaud-Lamodière E.L. Ogaki K. Dourado D.F.A.R. Flores S.C. et al 2015 Structural and functional impact of parkinson disease-associated mutations in the E3 Ubiquitin Ligase Parkin Hum. Mutat. 36 774 786 10.1002/humu.22808 25939424 PMC4514554 106 Tokarew J.M. El-Kodsi D.N. Lengacher N.A. Fehr T.K. Nguyen A.P. Shutinoski B. et al 2021 Age-associated insolubility of parkin in human midbrain is linked to redox balance and sequestration of reactive dopamine metabolites Acta Neuropathol. 141 725 754 10.1007/s00401-021-02285-4 33694021 PMC8043881 107 Ardah M.T. Radwan N. Khan E. Kitada T. Haque M.E 2023 Parkin Precipitates on Mitochondria via Aggregation and Autoubiquitination Int. J. Mol. Sci. 24 9027 10.3390/ijms24109027 37240373 PMC10219150 108 Kitada T. Hikita R. Hirose H 2016 Parkinson disease gene product, directly reduces hydrogen peroxide (mitochondrial oxidant), and forms dimerization reversibly Int. J. Latest Res. Sci. Technol 5 20 22 109 Schlossmacher M.G. Frosch M.P. Gai W.P. Medina M. Sharma N. Forno L. et al 2002 Parkin localizes to the Lewy bodies of Parkinson disease and dementia with Lewy bodies Am. J. Pathol. 160 1655 1667 10.1016/S0002-9440(10)61113-3 12000718 PMC1850875 110 El Kodsi D.N. Tokarew J.M. Sengupta R. Lengacher N.A. Chatterji A. Nguyen A.P. et al 2023 Parkin coregulates glutathione metabolism in adult mammalian brain Acta Neuropathol. Commun. 11 19 10.1186/s40478-022-01488-4 36691076 PMC9869535 111 Dunkerley K.M. Rintala-Dempsey A.C. Salzano G. Tadayon R. Hadi D. Barber K.R. et al 2022 Distinct phosphorylation signals drive acceptor versus free ubiquitin chain targeting by parkin Biochem. J. 479 751 766 10.1042/BCJ20210741 35262643 PMC9022993 112 Sauvé V. Sung G. MacDougall E.J. Kozlov G. Saran A. Fakih R. et al 2022 Structural basis for feedforward control in the PINK1/Parkin pathway EMBO J. 41 e109460 10.15252/embj.2021109460 35491809 PMC9194792 113 Fakih R. Sauvé V. Gehring K 2022 Structure of the second phosphoubiquitin-binding site in parkin J. Biol. Chem. 298 102114 10.1016/j.jbc.2022.102114 35690145 PMC9284454 114 Shlevkov E. Murugan P. Montagna D. Stefan E. Hadzipasic A. Harvey J.S. et al 2022 Discovery of small-molecule positive allosteric modulators of Parkin E3 ligase iScience 25 103650 10.1016/j.isci.2021.103650 35024585 PMC8733272 115 Sauvé V. Stefan E. Croteau N. Goiran T. Fakih R. Bansal N. et al 2024 Activation of parkin by a molecular glue Nat. Commun. 15 7707 10.1038/s41467-024-51889-3 39300082 PMC11412986 116 Stuber K. Schneider T. Werner J. Kovermann M. Marx A. Scheffner M 2021 Structural and functional consequences of NEDD8 phosphorylation Nat. Commun. 12 5939 10.1038/s41467-021-26189-9 34642328 PMC9020517 117 Lenka D.R. Chaurasiya S. Ratnakar L. Kumar A 2024 Mechanism of phospho-Ubls’ specificity and conformational changes that regulate Parkin activity Structure 32 2107 2122 10.1016/j.str.2024.09.012 39368463 118 Stichel C.C. Augustin M. Kühn K. Zhu X.R. Engels P. Ullmer C. et al 2000 Parkin expression in the adult mouse brain Eur. J. Neurosci. 12 4181 4194 10.1111/j.1460-9568.2000.01314.x 11122330 119 Corti O. Hampe C. Koutnikova H. Darios F. Jacquier S. Prigent A. et al 2003 The p38 subunit of the aminoacyl-tRNA synthetase complex is a Parkin substrate: linking protein biosynthesis and neurodegeneration Hum. Mol. Genet. 12 1427 1437 10.1093/hmg/ddg159 12783850 120 Cookson M.R. Lockhart P.J. McLendon C. O’Farrell C. Schlossmacher M. Farrer M.J 2003 RING finger 1 mutations in Parkin produce altered localization of the protein Hum. Mol. Genet. 12 2957 2965 10.1093/hmg/ddg328 14519684 121 Roverato N.D. Sailer C. Catone N. Aichem A. Stengel F. Groettrup M 2021 Parkin is an E3 ligase for the ubiquitin-like modifier FAT10, which inhibits Parkin activation and mitophagy Cell Rep 34 108857 10.1016/j.celrep.2021.108857 33730565 122 Choo Y.S. Vogler G. Wang D. Kalvakuri S. Iliuk A. Tao W.A. et al 2012 Regulation of parkin and PINK1 by neddylation Hum. Mol. Genet. 21 2514 2523 10.1093/hmg/dds070 22388932 PMC3349425 123 Um J.W. Han K.A. Im E. Oh Y. Lee K. Chung K.C 2012 Neddylation positively regulates the ubiquitin E3 ligase activity of parkin J. Neurosci. Res. 90 1030 1042 10.1002/jnr.22828 22271254 124 Chakraborty J. Basso V. Ziviani E 2017 Post translational modification of Parkin Biol. Direct 12 6 10.1186/s13062-017-0176-3 28222786 PMC5319146 125 Um J.W. Chung K.C 2006 Functional modulation of parkin through physical interaction with SUMO-1 J. Neurosci. Res. 84 1543 1554 10.1002/jnr.21041 16955485 126 Kubo S. Kitami T. Noda S. Shimura H. Uchiyama Y. Asakawa S. et al 2001 Parkin is associated with cellular vesicles J. Neurochem. 78 42 54 10.1046/j.1471-4159.2001.00364.x 11432972 127 Shires S.E. Quiles J.M. Najor R.H. Leon L.J. Cortez M.Q. Lampert M.A. et al 2020 Nuclear Parkin Activates the ERRα transcriptional program and drives widespread changes in gene expression following hypoxia Sci. Rep. 10 8499 10.1038/s41598-020-65438-7 32444656 PMC7244578 128 Balasubramaniam M. Parcon P.A. Bose C. Liu L. Jones R.A. Farlow M.R. et al 2019 Interleukin-1β drives NEDD8 nuclear-to-cytoplasmic translocation, fostering parkin activation via NEDD8 binding to the P-ubiquitin activating site J. Neuroinflammation 16 275 275 10.1186/s12974-019-1669-z 31882005 PMC6935243 129 Yang F. Jiang Q. Zhao J. Ren Y. Sutton M.D. Feng J 2005 Parkin Stabilizes microtubules through strong binding mediated by three independent domains Journal of Biological Chemistry 280 17154 17162 10.1074/jbc.M500843200 15737990 130 Ren Y. Zhao J. Feng J 2003 Parkin Binds to α/β Tubulin and Increases their Ubiquitination and Degradation J. Neurosci. 23 3316 3324 10.1523/JNEUROSCI.23-08-03316.2003 12716939 PMC1876717 ",
  "metadata": {
    "Title of this paper": "Parkin Binds to α/β Tubulin and Increases their Ubiquitination and Degradation",
    "Journal it was published in:": "Biochemical Society Transactions",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12493190/"
  }
}