{
  "title": "Paper_738",
  "abstract": "pmc Biomedicines Biomedicines 3168 biomedicines biomedicines Biomedicines 2227-9059 Multidisciplinary Digital Publishing Institute  (MDPI) PMC12467582 PMC12467582.1 12467582 12467582 41007657 10.3390/biomedicines13092094 biomedicines-13-02094 1 Article Atypical Mitochondrial Phenotype of Colonic CD4+ and CD8+ T Cells During Experimental Chronic Colitis Negele Jonas Investigation 1 † Franz Tobias Investigation 1 † Krone Anna Investigation 1 Roder Marc Investigation 1 Gelmez Elif Investigation 2 Jantz-Naeem Nouria Writing – review & editing 1 https://orcid.org/0000-0002-3686-9993 Kershaw Olivia Formal analysis 3 Keitel-Anselmino Verena Conceptualization 4 5 Jeron Andreas Methodology 2 6 Bruder Dunja Writing – review & editing 2 5 6 https://orcid.org/0000-0001-8813-1061 Kahlfuß Sascha Project administration 1 5 7 8 * Rimessi Alessandro Academic Editor 1 j-negele@gmx.net tobi.franz@mailbox.org anna.krone@med.ovgu.de marc.roder@st.ovgu.de nouria.jantz-naeem@med.ovgu.de 2 elif.gelmez11@gmail.com andreas.jeron@helmholtz-hzi.de dunja.bruder@med.ovgu.de 3 olivia.kershaw@fu-berlin.de 4 verena.keitel-anselmino@med.ovgu.de 5 3 6 7 8 * sascha.kahlfuss@med.ovgu.de † These authors contributed equally to this work. 28 8 2025 9 2025 13 9 497614 2094 10 6 2025 07 8 2025 18 8 2025 28 08 2025 27 09 2025 29 09 2025 © 2025 by the authors. 2025 https://creativecommons.org/licenses/by/4.0/ Licensee MDPI, Basel, Switzerland. This article is an open access article distributed under the terms and conditions of the Creative Commons Attribution (CC BY) license ( https://creativecommons.org/licenses/by/4.0/ Background: Methods: Results: Conclusions: ulcerative colitis inflammatory bowel disease t cells b cells neutrophils intestinal epithelial cells DSS colitis autoimmune colitis metabolism the Deutsche Forschungsgemeinschaft (DFG, German Research Foundation) 361210922/GRK2408 Else Kroener-Fresenius Stiftung 2023_EKEA.128 This work was supported by the Deutsche Forschungsgemeinschaft (DFG, German Research Foundation)—361210922/GRK2408—(Project 12 to S.K., Project 2 to D.B.) and the Else Kroener-Fresenius Stiftung (2023_EKEA.128) to S.K. pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement yes pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes 1. Introduction Inflammatory bowel disease (IBD), which includes ulcerative colitis (UC) and Crohn’s disease (CD), is characterized by chronic, progressive inflammation of the bowel leading to a variety of digestive and systemic symptoms, including weight loss, diarrhea, intestinal bleeding anemia and fatigue [ 1 2 3 4 5 6 7 8 9 10 9 9 10 11 12 13 Recently it became evident that during IBD, immunometabolism is involved in the pathogenesis of the disease [ 14 15 16 17 18 19 20 21 22 23 PPARGC1A 24 Here, we utilized a mouse model of DSS-induced colitis mimicking several key features of human IBD to investigate metabolic characteristics of colonic CD4+ and CD8+ T cells, B cells, eosinophils, neutrophils and intestinal epithelial cells during acute and chronic IBD-like disease and remission. Acute DSS-induced colitis is induced by short-term administration of DSS, leading to a rapid onset of inflammation, whereas in chronic DSS-induced colitis, repeated cycles of DSS administration with recovery periods in between lead to persistent inflammation and tissue remodeling [ 25 25 Our results show that during chronic DSS-induced colitis, colon CD4+ and CD8+ T cells produce fewer mitochondrial reactive oxygen species (mROS) and have reduced-mitochondria sizes; this phenotype is only transient and normalizes during the remission phase of the disease. Moreover, while CD4+ and CD8+ T cells show increased glucose uptake in acute DSS colitis, they display impaired glucose consumption in its chronic phase, a condition that persists until the remission phase. Together, our data provide evidence of an atypical mitochondrial phenotype of colonic CD4+ and CD8+ T cells during chronic colitis that returns to the initial state during the remission phase of the disease. 2. Materials and Methods 2.1. Mice, Colitis Induction and Disease Scoring All animal experiments were conducted using female C57BL/6JRj mice (Janvier Labs, 22 Rte des Chenes Secs, 53940 Le Genest-Saint-Isle, France), which were 11 weeks old at the start of the experiment. All animals were sourced from the same breeding facility. The mice were kept in a specific pathogen-free environment at the central animal facility of the Medical Faculty, Otto-von-Guericke-University, Magdeburg. Mice were sacrificed by CO 2 w v w v 2.2. Histopathology of Colon Following euthanasia, the colons and cecums were placed in histology cassettes, fixed in 4% PFA and subsequently embedded in paraffin. Sections 5 µm in size were dewaxed and stained with hematoxylin and eosin (HE). Histopathological scoring was conducted using the following parameters: immune cell infiltration, epithelial damage, extent of tissue damage and the proportion of tissue affected by inflammation. The specific scoring criteria are detailed in Table 1 2.3. Isolation of Lamina Propria Leukocytes from Colon Colonic lamina propria leukocytes were extracted following the protocol provided with the Lamina Propria Dissociation Kit from Miltenyi Biotec (Bergisch-Gladbach, Germany). The samples were incubated in a 37 °C shaker incubator. Total leukocytes were isolated from the digested tissue suspension using Percoll (GE Healthcare, Uppsala, Sweden) density gradient centrifugation (~1.041 g/mL) for 20 min at 1800 rpm at room temperature, with the rotor brake turned off. After centrifugation, the supernatant was removed, and the leukocyte pellet was rinsed once with phosphate-buffered saline (PBS). Half of the isolated leukocyte suspension was reserved for fluorescent activated cell sorting (FACS) analysis. 2.4. Flow Cytometry For identifying and characterizing different cell subsets, the isolated cell suspension was stained with fluorochrome-labeled antibody panels and analyzed by flow cytometry. The panel comprised CD45 (BioLegend, San Diego, CA, USA, # 103135), CD4 (BioLegend, # 100516 or # 100423) and CD8 (BioLegend, # 100722), MHCII (BioLegend, # 107636 or # 17620), Siglec-F (BioLegend, # 155507 or # 155504), Ly6G (BioLegend, # 127606 or # 127612), B220 (BioLegend, # 103205 or # 103211) and Ep-CAM (BioLegend, # 118225). Epithelial cells were gated as CD45-CD31-Ep-CAM+ cells, B cells were gated as CD45+B220+MHCII+ cells and CD4+ and CD8+ T cells were gated as CD45+CD4+ and CD45+CD8+, respectively. Eosinophils were gated as CD45+SSC high 2.5. Uptake of Glucose and Amino Acids Glucose uptake was assessed using the fluorescent glucose analog 2-NBDG (Thermo Fisher Scientific, Waltham, MA, USA, # N13195). Following isolation, the cells were incubated in glucose-free RPMI medium with 100 μM 2-NBDG for 90 min in the dark. The quantity of 2-NBDG taken up by the cells was measured using FACS after surface staining. Amino acid uptake was evaluated through flow cytometry with the Amino Acid Uptake Assay Kit (Dojindo Laboratories, Munich, Germany, # UP04-12). After isolation, the cells were incubated in amino acid-free DMEM medium (PAN-Biotech, Aidenbach, Germany, # P04-01507) containing the amino acid analog BPA for 30 min in the dark (BPA uptake solution). After two washing steps, the cells were treated for 10 min with a working solution that includes a fluorescent probe capable of crossing the cell membrane, binding to intracellularly accumulated BPA, and emitting fluorescence (λ ex em 2.6. Measurement of mROS Production and Mitochondrial Volume Following isolation, mitochondrial ROS production was assessed by incubating the cells with 5 μM MitoSOX™ Red Mitochondrial Superoxide Indicator (Thermo Fisher Scientific, # M36008 2.7. Expression of GLUT1, GLUT3 and CD36 Upon isolation and staining for cell-specific surface markers, we analyzed Glut-1 and Glut-3 expression. Cells were stained with Glut-1 (Thermo Fisher Scientific, # MA5-31960) or Glut-3 (Thermo Fisher Scientific, # MA5-32697) in PBS for 30 min on ice after incubation with Fc-block (Thermo Fisher Scientific, # 14-0161-86). After washing, cells were incubated with goat anti-rabbit antibody (Thermo Fisher Scientific, # A32731) and analyzed using flow cytometry. For CD36 staining, we used cell-specific markers and anti-CD36-APC (BD Bioscience, Temse, Belgium # 562744). All of these experiments were conducted using FMOs as control. 2.8. Re-Analysis of Previously Published RNA-Seq Data We used the 5296 significantly altered genes (|fold change| ≥ 1.5, FDR < 0.001) from the comparison of ulcerative colitis (UC) (206 patients) and non-IBD controls (20 patients) stated in supplementary data 1 of [ 23 https://davidbioinformatics.nih.gov/home.jsp p adj 2.9. T Cell Culture and Oligomycin Treatment CD4+ T cells were isolated from the spleen and cervical, submandibular, brachial, axillary, inguinal and mesenterial lymph nodes of WT mice by negative enrichment using the MagniSort Mouse CD4+ T Cell Enrichment Kit (Thermo Fisher Scientific, # 8804-6821-74). The culture plates were coated with rabbit anti-hamster IgG (Jackson Immuno Research, West Grove, PA, USA, # 307-005-003) for 2 h at 37 °C. CD4+ T cells were maintained in RPMI medium containing 10% FCS, 2 mM GlutaMAX (Thermo Fisher Scientific, # 35050038), 50 µM β-mercaptoethanol (Thermo Fisher Scientific, # 31350010), 2% penicillin/streptavidin (Thermo Fisher Scientific, # 15070063) and stimulated with 1 μg/mL anti-CD3ε and 1 μg/mL, as well as anti-CD28 antibodies (BioLegend, # 100340 and 102116). The cells were treated for 72 h in the presence or absence of 3 μM oligomycin (Agilent, Waldbronn, Germany, # 103010-100). 2.10. Statistical Analysis All data were analyzed using GraphPad Prism 8.0 (GraphPad software, Inc., La Jolla, CA, USA) and are presented as the mean ± SEM, if not indicated otherwise. Comparisons between two groups were analyzed using the unpaired Student’s t test, while comparisons across multiple groups (murine DSS-induced colitis models) were performed using ordinary Kruskal–Wallis test (H-test), as the values were non-parametric. p p p p p 3. Results 3.1. Ulcerative Colitis Is Characterized by a Suppression of Mitochondrial Gene Expression Patients with UC suffer from a chronic relapsing-remitting IBD and show a heterogeneous disease severity and therapy response. However, part of the affected patients does not respond to pharmacological therapy, which ultimately requires surgical resection of the inflamed bowel. The latter emphasizes that the pathogenesis of UC and its underlying disease endotypes are still incompletely understood. To date, only a few studies addressed the question whether IBD is associated with changes in the immunometabolism of the immune and non-immune cells involved in the disease pathogenesis and how sustainable potential metabolic changes manifest at the cellular level. In this context, it was recently reported that rectal biopsies from patients with UC show a significant suppression of mitochondrial gene expression during active UC [ 23 We reanalyzed RNA sequencing data from “The Predicting Response to Standardized Pediatric Colitis Therapy” (PROTECT) study [ 23 Figure 1 Figure 1 ETC CPT1A Figure 1 3.2. Dextran Sulfate Sodium-Induced Colitis as a Preclinical Mouse Model to Study Metabolic Characteristics in Colon Immune Cells To study the metabolic characteristics of adaptive and innate immune cells during IBD, we used a mouse model of dextran sulfate sodium (DSS)-induced colitis [ 26 Figure 2 Figure 2 Figure 2 26 Table 1 3.3. Abnormal Mitochondrial Phenotype of Colon Lamina Propria CD4+ and CD8+ T Cells During DSS-Induced Chronic Colitis Is Resolved During the Remission Phase Histopathological analyses of the colons showed that mice undergoing acute DSS colitis had a significant increase (mean score of 11.8) in the histopathology score compared to control mice (mean score 0) ( Table 2 Figure S1 Transcriptomic analyses have shown a significant alteration of mitochondrial gene expression in total rectal biopsies of UC patients ( Figure 2 23 Figure 2 Figure 2 Figure S2 0 Figure 2 n + + 3.4. CD4+ and CD8+ T Cells Show Increased Glucose Uptake During Acute but Defective Glucose Consumption During Chronic DSS Colitis That Persists During Remission During chronic colitis, CD4+ and CD8+ T cells showed an abnormal mitochondrial phenotype which was restored during remission. To test whether CD4+ and CD8+ T cells are metabolically affected in their ability to consume glucose to perform aerobic glycolysis during acute and chronic colitis, we measured their uptake of 2-(7-Nitro-2, 1, 3-benzoxadiazol-4-yl)-D-glucosamine (2-NBDG), a traceable fluorescent derivative of glucose. Interestingly, during acute colitis, colonic CD4+ and CD8+ T cells showed higher glucose consumption, which went back to baseline levels during the remission phase ( Figure 3 Figure S3 Figure S3 RNA sequencing of human rectal biopsies from UC patients revealed an alteration of genes encoding for solute carriers (SLCs) that transport amino acids—another cellular metabolic property ( Figure 3 Figure 3 Figure S4 Figure 3 Table 3 4. Discussion IBD, which includes UC and CD, is a global disease with increasing incidence, particularly in newly industrialized and developing countries [ 27 28 29 23 Our findings highlight the dysfunction and the involvement of mitochondria within T cells during the pathogenesis of IBD as we detect significantly reduced mROS production and decreased mitochondrial volume of CD4 + + 23 30 31 32 33 34 35 Furthermore, as mitochondria derive from bacteria [ 36 37 38 39 40 26 41 The acute-DSS group in our mouse model reflects the first colon inflammatory episode with a loss of the intestinal barrier. Hence, in this period of our model, a plethora of microbial and food antigens trigger a multitude of new T cell responses accompanied by substantial T cell activation. Fulminant T cell stimulation depends on glucose uptake and glycolytic capacity. Thus, enhanced glucose uptake of CD4+ and CD8+ T cells in the acute-DSS group may be interpreted as a proxy for T cell activation. Indeed, T cells switch from mitochondria-dependent oxidative phosphorylation (OXPHOS) to aerobic glycolysis upon activation in order to allow for metabolically expensive cell proliferation. Inversely, the latter scenario could also explain the observed normalization of the glucose uptake capacity during the acute remission phase, accompanied by declining T cell activation processes due to the re-established barrier function of the colon. This leaves behind a plethora of antigen-experienced yet quiescent lamina propria memory T cells with a low rate of metabolism. Together, our findings here reveal an atypical mitochondrial phenotype of colonic CD4+ and CD8+ T cells during chronic colitis that is restored during remission. However, our study also has limitations. Firstly, we do not measure the mitochondrial function in real-time but determine surrogate parameters, including mROS production and mitochondrial volume. Secondly, we do not account for the plasticity of CD4+ T cells, which differentiate into various Th cell populations that take part in the pathophysiology of IBD. Additionally, it is not fully understood to what extent our mouse model replicates human IBD, nor are the possible influences of age and gender differences (only female mice used) on disease development and response taken into account. For the reanalysis of human transcriptomic data, there is no categorization of patients based on their disease severity or treatment status, which may potentially influence the findings. Lastly, all mice were the same age at the start of the experiment (11 weeks) but sampled at different times, which means that age-related differences cannot be entirely excluded, especially for chronic-phase results. Addressing these limitations in future research will help strengthen the translational relevance of our findings. Disclaimer/Publisher’s Note: Supplementary Materials The following supporting information can be downloaded at https://www.mdpi.com/article/10.3390/biomedicines13092094/s1 n n n n n n n Author Contributions Drafting: J.N. and T.F.; Writing: J.N., T.F. and S.K., Experimentation: J.N., T.F., A.K., M.R., E.G., O.K. and A.J.; Editing and approving final manuscript: All authors; Supervision and funding acquisition: D.B. and S.K. All authors have read and agreed to the published version of the manuscript. Institutional Review Board Statement All procedures were approved by local government agencies to D.B. for the DSS-induced colitis model (license ID: 42502-2-1521 Uni MD). All methods were carried out in accordance with relevant guidelines and regulations and are reported in accordance with ARRIVE guidelines. Data Availability Statement PROTECT ( https://www.ncbi.nlm.nih.gov/geo/query/acc.cgi?acc=GSE109142 https://www.ncbi.nlm.nih.gov/geo/query/acc.cgi?acc=GSE117993 23 Conflicts of Interest The authors declare no conflicts of interest. References 1. Seyedian S.S. Nokhostin F. Malamir M.D. A review of the diagnosis, prevention, and treatment methods of inflammatory bowel disease J. Med. Life 2019 12 113 122 10.25122/jml-2018-0075 31406511 PMC6685307 2. Singh N. Bernstein C.N. Environmental risk factors for inflammatory bowel disease United Eur. Gastroenterol. J. 2022 10 1047 1053 10.1002/ueg2.12319 36262056 PMC9752273 3. Nóbrega V.G. Silva I.N.N. Brito B.S. Silva J. Silva M.C.M.D. Santana G.O. The onset of clinical manifestations in inflammatory bowel disease patients Arq. Gastroenterol. 2018 55 290 295 10.1590/s0004-2803.201800000-73 30540094 4. Bisgaard T.H. Allin K.H. Keefer L. Ananthakrishnan A.N. Jess T. Depression and anxiety in inflammatory bowel disease: Epidemiology, mechanisms and treatment Nat. Rev. Gastroenterol. Hepatol. 2022 19 717 726 10.1038/s41575-022-00634-6 35732730 5. Schaubeck M. Clavel T. Calasan J. Lagkouvardos I. Haange S.B. Jehmlich N. Basic M. Dupont A. Hornef M. von Bergen M. Dysbiotic gut microbiota causes transmissible Crohn’s disease-like ileitis independent of failure in antimicrobial defence Gut 2016 65 225 237 10.1136/gutjnl-2015-309333 25887379 PMC4752651 6. Mentella M.C. Scaldaferri F. Pizzoferrato M. Gasbarrini A. Miggiano G.A.D. Nutrition, IBD and Gut Microbiota: A Review Nutrients 2020 12 944 10.3390/nu12040944 32235316 PMC7230231 7. Lakatos P.L. Fischer S. Lakatos L. Gal I. Papp J. Current concept on the pathogenesis of inflammatory bowel disease-crosstalk between genetic and microbial factors: Pathogenic bacteria and altered bacterial sensing or changes in mucosal integrity take “toll”? World J. Gastroenterol. 2006 12 1829 1841 10.3748/wjg.v12.i12.1829 16609988 PMC4087507 8. Gravina A.G. Panarese I. Trotta M.C. D’Amico M. Pellegrino R. Ferraraccio F. Galdiero M. Alfano R. Grieco P. Federico A. Melanocortin 3,5 receptors immunohistochemical expression in colonic mucosa of inflammatory bowel disease patients: A matter of disease activity? World J. Gastroenterol. 2024 30 1132 1142 10.3748/wjg.v30.i9.1132 38577176 PMC10989484 9. Guan Q. A Comprehensive Review and Update on the Pathogenesis of Inflammatory Bowel Disease J. Immunol. Res. 2019 2019 7247238 10.1155/2019/7247238 31886308 PMC6914932 10. Friedrich M. Pohin M. Powrie F. Cytokine Networks in the Pathophysiology of Inflammatory Bowel Disease Immunity 2019 50 992 1006 10.1016/j.immuni.2019.03.017 30995511 11. Neurath M.F. Targeting immune cell circuits and trafficking in inflammatory bowel disease Nat. Immunol. 2019 20 970 979 10.1038/s41590-019-0415-0 31235952 12. Petagna L. Antonelli A. Ganini C. Bellato V. Campanelli M. Divizia A. Efrati C. Franceschilli M. Guida A.M. Ingallinella S. Pathophysiology of Crohn’s disease inflammation and recurrence Biol. Direct 2020 15 23 10.1186/s13062-020-00280-5 33160400 PMC7648997 13. Ungaro R. Mehandru S. Allen P.B. Peyrin-Biroulet L. Colombel J.F. Ulcerative colitis Lancet 2017 389 1756 1770 10.1016/S0140-6736(16)32126-2 27914657 PMC6487890 14. Zaiatz Bittencourt V. Jones F. Doherty G. Ryan E.J. Targeting Immune Cell Metabolism in the Treatment of Inflammatory Bowel Disease Inflamm. Bowel Dis. 2021 27 1684 1693 10.1093/ibd/izab024 33693743 PMC8522790 15. Lee H. Jeon J.H. Kim E.S. Mitochondrial dysfunctions in T cells: Eocus on inflammatory bowel disease Front. Immunol. 2023 14 1219422 10.3389/fimmu.2023.1219422 37809060 PMC10556505 16. Zhou H. Wang L. Liu F. Immunological Impact of Intestinal T Cells on Metabolic Diseases Front Immunol. 2021 12 639902 Erratum in Front Immunol. 2021 12 10.3389/fimmu.2021.639902 33679800 PMC7930072 17. Kim C.H. Park J. Kim M. Gut microbiota-derived short-chain Fatty acids, T cells, and inflammation Immune Netw. 2014 14 277 288 10.4110/in.2014.14.6.277 25550694 PMC4275385 18. Tan J. Taitz J. Sun S.M. Langford L. Ni D. Macia L. Your Regulatory T Cells Are What You Eat: How Diet and Gut Microbiota Affect Regulatory T Cell Development Front. Nutr. 2022 9 878382 10.3389/fnut.2022.878382 35529463 PMC9067578 19. Park J. Kim M. Kang S.G. Jannasch A.H. Cooper B. Patterson J. Kim C.H. Short-chain fatty acids induce both effector and regulatory T cells by suppression of histone deacetylases and regulation of the mTOR-S6K pathway Mucosal. Immunol. 2015 8 80 93 10.1038/mi.2014.44 24917457 PMC4263689 20. Cong J. Liu P. Han Z. Ying W. Li C. Yang Y. Wang S. Yang J. Cao F. Shen J. Bile acids modified by the intestinal microbiota promote colorectal cancer growth by suppressing CD8 + Immunity 2024 57 876 889 10.1016/j.immuni.2024.02.014 38479384 21. Hang S. Paik D. Yao L. Kim E. Trinath J. Lu J. Ha S. Nelson B.N. Kelly S.P. Wu L. Bile acid metabolites control T H reg Nature 2019 576 143 148 Erratum in Nature 2020 579 10.1038/s41586-019-1785-z 31776512 PMC6949019 22. Furusawa Y. Obata Y. Fukuda S. Endo T.A. Nakato G. Takahashi D. Nakanishi Y. Uetake C. Kato K. Kato T. Commensal microbe-derived butyrate induces the differentiation of colonic regulatory T cells Nature 2013 504 446 450 10.1038/nature12721 24226770 23. Haberman Y. Karns R. Dexheimer P.J. Schirmer M. Somekh J. Jurickova I. Braun T. Novak E. Bauman L. Collins M.H. Ulcerative colitis mucosal transcriptomes reveal mitochondriopathy and personalized mechanisms underlying disease severity and treatment response Nat. Commun. 2019 10 38 10.1038/s41467-018-07841-3 30604764 PMC6318335 24. Schulz-Kuhnt A. Rühle K. Javidmehr A. Döbrönti M. Biwank J. Knittel S. Neidlinger P. Leupold J. Liu L.J. Dedden M. ATP citrate lyase (ACLY)-dependent immunometabolism in mucosal T cells drives experimental colitis In Vivo Gut 2024 73 601 612 10.1136/gutjnl-2023-330543 38176897 25. Chassaing B. Aitken J.D. Malleshappa M. Vijay-Kumar M. Dextran sulfate sodium (DSS)-induced colitis in mice Curr. Protoc. Immunol. 2014 104 15 25 10.1002/0471142735.im1525s104 24510619 PMC3980572 26. Gelmez E. Lehr K. Kershaw O. Frentzel S. Vilchez-Vargas R. Bank U. Link A. Schüler T. Jeron A. Bruder D. Characterization of Maladaptive Processes in Acute, Chronic and Remission Phases of Experimental Colitis in C57BL/6 Mice Biomedicines 2022 10 1903 10.3390/biomedicines10081903 36009449 PMC9405850 27. Agrawal M. Jess T. Implications of the changing epidemiology of inflammatory bowel disease in a changing world United Eur. Gastroenterol. J. 2022 10 1113 1120 10.1002/ueg2.12317 36251359 PMC9752308 28. Windsor J.W. Kaplan G.G. Evolving Epidemiology of IBD Curr. Gastroenterol. Rep. 2019 21 40 10.1007/s11894-019-0705-6 31338613 29. Higashiyama M. Hokari R. New and Emerging Treatments for Inflammatory Bowel Disease Digestion 2023 104 74 81 Erratum in Digestion 2023 104 10.1159/000527422 36366823 30. Novak E.A. Mollen K.P. Mitochondrial dysfunction in inflammatory bowel disease Front. Cell Dev. Biol. 2015 3 62 10.3389/fcell.2015.00062 26484345 PMC4589667 31. Ho G.T. Theiss A.L. Mitochondria and Inflammatory Bowel Diseases: Toward a Stratified Therapeutic Intervention Annu. Rev. Physiol. 2022 84 435 459 10.1146/annurev-physiol-060821-083306 34614372 PMC8992742 32. Peña-Cearra A. Song D. Castelo J. Palacios A. Lavín J.L. Azkargorta M. Elortza F. Fuertes M. Pascual-Itoiz M.A. Barriales D. Mitochondrial dysfunction promotes microbial composition that negatively impacts on ulcerative colitis development and progression npj Biofilms Microbiomes 2023 9 74 10.1038/s41522-023-00443-y 37805634 PMC10560208 33. Alarfaj S.J. Bahaa M.M. Elmasry T.A. Elberri E.I. El-Khateeb E. Hamouda A.O. Salahuddin M.M. Kamal M. Gadallah A.A. Eltantawy N. Fenofibrate as an Adjunct Therapy for Ulcerative Colitis: Targeting Inflammation via SIRT1, NLRP3, and AMPK Pathways: A Randomized Controlled Pilot Study Drug Des. Dev. Ther. 2024 18 5239 5253 10.2147/DDDT.S490772 39575188 PMC11578921 34. Erol Doğan Ö. Karaca Çelik K.E. Baş M. Alan E.H. Çağın Y.F. Effects of Mediterranean Diet, Curcumin, and Resveratrol on Mild-to-Moderate Active Ulcerative Colitis: A Multicenter Randomized Clinical Trial Nutrients 2024 16 1504 10.3390/nu16101504 38794742 PMC11123867 35. Bordt E.A. Clerc P. Roelofs B.A. Saladino A.J. Tretter L. Adam-Vizi V. Cherok E. Khalil A. Yadava N. Ge S.X. The Putative Drp1 Inhibitor mdivi-1 Is a Reversible Mitochondrial Complex I Inhibitor that Modulates Reactive Oxygen Species Dev. Cell 2017 40 583 594.e6 10.1016/j.devcel.2017.02.020 28350990 PMC5398851 36. Al Amir Dache Z. Thierry A.R. Mitochondria-derived cell-to-cell communication Cell Rep. 2023 42 112728 10.1016/j.celrep.2023.112728 37440408 37. Spooner R. Yilmaz O. The role of reactive-oxygen-species in microbial persistence and inflammation Int. J. Mol. Sci. 2011 12 334 352 10.3390/ijms12010334 21339989 PMC3039955 38. Ballard J.W.O. Towarnicki S.G. Mitochondria, the gut microbiome and ROS Cell Signal. 2020 75 109737 10.1016/j.cellsig.2020.109737 32810578 39. Ni J. Wu G.D. Albenberg L. Tomov V.T. Gut microbiota and IBD: Causation or correlation? Nat. Rev. Gastroenterol. Hepatol. 2017 14 573 584 10.1038/nrgastro.2017.88 28743984 PMC5880536 40. Lee M. Chang E.B. Inflammatory Bowel Diseases (IBD) and the Microbiome-Searching the Crime Scene for Clues Gastroenterology 2021 160 524 537 10.1053/j.gastro.2020.09.056 33253681 PMC8098834 41. Hirose M. Sekar P. Eladham M.W.A. Albataineh M.T. Rahmani M. Ibrahim S.M. Interaction between mitochondria and microbiota modulating cellular metabolism in inflammatory bowel disease J. Mol. Med. 2023 101 1513 1526 10.1007/s00109-023-02381-w 37819377 PMC10698103 Figure 1 Ulcerative colitis is characterized by a suppression of mitochondrial genes. ( A 23 23 p adj x p B A X C B D 23 B A D 23 Figure 2 DSS-induced colitis results in decreased mitochondrial function within T cells. ( A B 23 p adj X 10 p C B D E Lamina propria A D + + E F D E n n n n n n D E p p p F n F t p Figure 3 Glucose and amino acid uptake of T cells with mitochondrial depression from different stages of DSS-induced colitis. ( A C Figure 2 Lamina propria A + + B 2 C + + D + A C n n n n n n n p p p D n biomedicines-13-02094-t001_Table 1 Table 1 Histological scoring [ 26 Histological Changes Score: 0 Score: 1 Score: 2 Score: 3 Score: 4 Infiltration of immune cells No inflammation Around crypt base Into mucosa Extensive mucosal infiltration and edema Into submucosa Epithelial damage and loss of goblet cells Intact Slight loss of goblet cells Considerable loss of goblet cells and slight loss of intestinal crypts Extensive loss of intestinal crypts  Extent None Mucosa Mucosa and submucosa Transmural  Percent involvement  1–25% 26–50% 51–75% 76–100% biomedicines-13-02094-t002_Table 2 Table 2 Histopathology Score DSS colitis. Conditions Day Histopathological Score Adj. p % Tissue with Colon Inflammation Adj. p Control young 11 0  0  Acute 6 11.8 0.0018 1.8 0.0596 Remission acute 25 5.9 >0.9999 (ns) 1.0 >0.9999 (ns) Control old 56 0  0  Chronic 46 13.3 <0.0001 3.3 <0.0001 Remission chronic 67 7.8 0.1845 3 0.0003 The table presents the histopathology scores, percentage of tissue with colon inflammation, and corresponding adjusted p p Table 1 n n n p p p p biomedicines-13-02094-t003_Table 3 Table 3 Summary of alterations in mitochondrial ROS production, mitochondrial volume and glucose consumption in immune cell subsets during DSS-induced colitis.   Acute Colitis  Remission Acute  Chronic Colitis  Remission Chronic  Mitochondrial ROS production CD4+ T  CD4+ T  CD4+ T  CD4+ T  CD8+ T  CD8+ T  CD8+ T  CD8+ T  B  B  B  B  Neut.  Neut.  Neut.  Neut.  Eos.  Eos.  Eos.  Eos.   Mitochondrial volume CD4+ T  CD4+ T  CD4+ T  CD4+ T  CD8+ T  CD8+ T  CD8+ T  CD8+ T  B  B  B  B  Neut.  Neut.  Neut.  Neut.  Eos.  Eos.  Eos.  Eos.   Glucose consumption CD4+ T  CD4+ T  CD4+ T  CD4+ T  CD8+ T  CD8+ T  CD8+ T  CD8+ T  B  B  B  B  Neut.  Neut.  Neut.  Neut.  Eos.  Eos.  Eos.  Eos.  Arrows indicate the direction of change relative to healthy controls: ↑, increase; ↓, decrease; →, no change. Blue arrows represent changes during acute colitis and its remission; red arrows represent chronic colitis; light-red arrows represent remission after chronic colitis. Immune cell subsets analyzed: CD4 + + ",
  "metadata": {
    "Title of this paper": "Interaction between mitochondria and microbiota modulating cellular metabolism in inflammatory bowel disease",
    "Journal it was published in:": "Biomedicines",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12467582/"
  }
}