{
  "title": "Paper_950",
  "abstract": "pmc Front Med (Lausanne) Front Med (Lausanne) 2657 frontmedicine Front. Med. Frontiers in Medicine 2296-858X Frontiers Media SA PMC12484070 PMC12484070.1 12484070 12484070 41041445 10.3389/fmed.2025.1679910 1 Medicine Original Research Differences in the amplitude of dynamic low-frequency fluctuations in primary angle-closure glaucoma are associated with gene-molecular multi-omics Hu Yuan  1  † Hu Rui-Yang  2  † Yang Hai-Jun  1 Xu Ting-Ting  1  * 1 Nanchang Bright Eye Hospital Nanchang China 2 School of Ophthalmology and Optometry, Jiangxi Medical College, Nanchang University Nanchang China Edited by: Weihua Yang Reviewed by: Chen-Xing Qi Shaoying Tan Wen-Qing Shi Xingxing Yuan *Correspondence: Ting-Ting Xu, 474820547@qq.com † 17 9 2025 2025 12 480650 1679910 05 8 2025 28 8 2025 17 09 2025 02 10 2025 03 10 2025 Copyright © 2025 Hu, Hu, Yang and Xu. 2025 Hu, Hu, Yang and Xu https://creativecommons.org/licenses/by/4.0/ This is an open-access article distributed under the terms of the Creative Commons Attribution License (CC BY). The use, distribution or reproduction in other forums is permitted, provided the original author(s) and the copyright owner(s) are credited and that the original publication in this journal is cited, in accordance with accepted academic practice. No use, distribution or reproduction is permitted which does not comply with these terms. Objective Primary angle-closure glaucoma (PACG), an incurable ophthalmic disease, is a serious risk to human visual health. Previous studies have demonstrated a strong link between PACG and neuroimaging changes in the brain. This study utilizes dynamic low-frequency fluctuation amplitude (dALFF) with the aim of resolving the potential dynamic alterations in neurological function in PACG and integrating transcriptomics profiles with spatial distribution characteristics of neuromodulatory receptors/transporters to systematically elucidate the underlying neurophysiopathological mechanisms. Methods We used sliding time windows of 30TR, 50TR and 80TR to calculate dALFF values and performed partial least squares regression (PLS) analysis of t-values after two-sample test of dALFF values under the sliding window of 50 TR against the Allen Human Brain Atlas (AHBA) to screen genes. Enrichment analysis, tissue-specific expression analysis and protein–protein interactions (PPI) network construction were implemented. The t-values were also analyzed for spatial correlation with neurotransmitter receptor/transporter density profiles distributed throughout the brain. Results The two-sample tests under three sliding windows revealed extensive brain alterations in PACG and each abnormal brain region showed elevation (the Gaussian Random Field method, with significance at the voxel level set at p p p p Conclusion The present study reveals that a wide range of brain regions in PACG patients show significant functional remodeling, elucidating the molecular regulatory network behind this type of pathological alteration. dynamic low-frequency fluctuation amplitude primary angle-closure glaucoma gene receptor/transmission fMRI The author(s) declare that no financial support was received for the research and/or publication of this article. pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement no pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes section-at-acceptance Ophthalmology Introduction Primary angle-closure glaucoma (PACG) is a type of ocular disease characterized by anatomical atresia of the anterior chamber angle. Its pathogenesis stems from mechanical occlusion of the angle triggered by an abnormal iris-cornea anatomical position, which in turn leads to dysfunction of the atrial drainage system and an abnormally high intraocular pressure (IOP), resulting in optic nerve damage as a result of this glaucomatous type of glaucoma. The core anatomical hallmarks of the disease include a markedly shallow anterior chamber (ACD < 2.5 mm), a narrow angle (<20°), and anterior dislocation of the lens, which together result in frequent iris-to-cornea contact (ITC), a set of features that have been confirmed by several imaging studies ( 1–3 4–6 7–10 In recent years, major recent technological innovations have propelled the progressive development of magnetic resonance imaging (MRI) as a highly clinically valuable tool for the early prediction of disease ( 11–15 16 17 18–20 21 20 22 23 Brain-wide slow oscillations are a characteristic feature of the mammalian neocortex that occurs spontaneously in the virtual absence of sensory stimulation. Amplitude of low-frequency fluctuations (ALFF) is a method of blood oxygen level-dependent signal analysis based on resting-state functional magnetic resonance imaging, which quantitatively characterizes the energy intensity of spontaneous neural activity in brain regions by calculating the mean of the square root of the power spectrum of the BOLD signal in a specific low-frequency frequency band (typically ranging from 0.01 to 0.1 Hz) ( 24–26 27 28 29 30 31 32 33 34 35 The current research on rs-fMRI has gradually formed the consensus that the “resting state” subjects are not completely physiologically quiescent, and that their functional neural networks still maintain significant active representations. Even in the absence of external cognitive tasks, the cortex maintains complex neural information processing mechanisms. For example, the default mode network (DMN) is continuously active at rest and forms a dynamic equilibrium with the central executive network (CEN) and salient network (SN) ( 36 37 38–40 41 42 43 44 41 45 46 47 35 Significantly, the pathologic process of PACG exhibits a strong association with specific loci. Genome-wide association studies (GWAS) have revealed that polymorphic profiles at loci such as ABCA1, PMM2, PLEKHA7, and COL11A1 show significant correlations with disease risk ( 48–50 51–53 54–56 57–60 61 62 35 63 In the present study, we aimed to explore the dynamic changes in brain neural activity in PACG patients and its association with the brain genome in order to explore the underlying neural mechanisms and suggest possible early predictors in PACG patients. We propose that PACG patients exhibit significant abnormal dALFF alterations in whole brain regions, which are intrinsically associated with cortical gene expression patterns and neurotransmitter receptor/transporter distribution. In the present study, dALFF metrics of PACG patients were systematically analyzed to characterize their dynamic neural fluctuations from three sliding windows: 30TR, 50TR and 80TR, respectively. Then, the results of dALFF analysis from the 50TR sliding window were analyzed with the AHBA dataset by PLS to find the genes that were positively and negatively correlated with them. Multi-level probes were subsequently carried out, including biological pathway enrichment analysis, cell-specific expression profiling based on transcriptional decoding, and protein interaction network construction. Synchronously, under the 50TR time window parameter, we established the association mapping of neurotransmitter receptor/transporter brain region expression patterns with dALFF variations to explore the key roles of gene transcriptional regulation and neurotransmitter receptor/transporter changes in dALFF. Methods Participants Participants 47 patients diagnosed with PACG were recruited from the same hospital, along with 46 carefully matched controls based on age, gender, and education. All experimental procedures were conducted in accordance with the Declaration of Helsinki, approved by the Ethics Committee of School of Ophthalmology and Optometry, Jiangxi Medical College, Nanchang University, and written informed consent was obtained from each subject. Inclusion criteria for PACG patients were as follows: (1) bilateral narrow angle confirmed by atrial anguloscopy; (2) presence of visual field defects associated with glaucoma; (3) no history of glaucoma medication or surgical treatment; (4) no history of craniocerebral trauma; (5) no neurologic or psychiatric disorders; (6) availability of magnetic resonance imaging (no metallic implants, such as pacemakers); and (7) acceptance of the scans after the resolution of acute symptoms. Exclusion criteria: (1) Comorbid primary open-angle glaucoma (POAG) or secondary glaucoma; (2) Comorbid other ocular or systemic diseases affecting the visual pathway; (3) History of glaucoma or significant ocular disease; (4) History of antiglaucomatous surgery; (5) History of craniocerebral trauma; (6) Severe neurologic/psychiatric disorders; (7) Contraindications to magnetic resonance imaging examination; (8) Long-term use of neurologic medications affecting the brain’s function/structure; and (9) Presence of acute attack symptoms (e.g., eye pain) at the time of scanning; (10) Patients with cerebrovascular disease. Inclusion criteria for the control group: (1) no organic lesions on ophthalmologic examination; (2) no history of craniocerebral trauma; (3) no neurologic/psychiatric disorders; (4) eligibility for magnetic resonance examination; and (5) demographic characteristics matching the PACG group. Exclusion criteria: (1) confirmed diagnosis of any ocular or systemic disorder; (2) severe refractive error (equivalent spherical lens ≥ ± 6.00 D); (3) history of craniocerebral trauma; (4) severe neurologic/psychiatric disorders; (5) contraindications to magnetic resonance examination; and (6) prolonged use of neurologic medications. fMRI data acquisition A 750 T magnetic resonance imaging system manufactured by General Electric, United States, equipped with a novel 3.0-channel phased-array head coil, was used in this experiment. Functional magnetic resonance data of blood oxygen level dependent (BOLD) signals were acquired via a gradient echo planar imaging (EPI) sequence. Key imaging parameters included a repetition time (TR) of 2000 ms, a time to echo (TE) of 25 ms, a layer thickness of 3.0 mm, a layer spacing of 1.2 mm, a receiver matrix of 64 × 64, a radiofrequency flip angle of 90°, and an effective scanning field of 240 × 240 mm 2 3 Before the experiment, participants were explicitly asked to keep both eyes open, maintain wakefulness, and avoid systematic thinking activities as much as possible. During data acquisition, the head was tightly immobilized with custom sponge padding to minimize potential motion artifacts in order to reduce noise. During the post-scanning phase, subjects instantly completed a standardized post-effects questionnaire, which was used to verify the degree of adherence to behavioral norms during the scanning process. fMRI data preprocessing In this study, we used the Data Processing and Analysis Toolbox for Brain Imaging in conjunction with Statistical Parametric Mapping software 1 3 dALFF data processing In the present study, the Time Dynamic Analysis built into DPABI v8.1 software was used for neuroimaging dynamic metrics measurements. Previous studies have shown that insufficient time window span exacerbates the time-series oscillatory characteristics of dynamic low-frequency amplitude fluctuation (dALFF) signals, where as an excessively long window length does not adequately reflect dynamic temporal changes in dALFF ( 64 65 45 66–68 Gene expression data processing Data processing consisted of utilizing the AHBA database available at https://www.brainmap.org 69 70 69 We performed correlation analyses using PLS1 and PLS2 methods, respectively; however, unfortunately in the PLS1 analyses, the p Enrichment analysis Enrichment analysis was performed for genes that were significantly positively and negatively correlated with their dALFF values in the 50TR window, respectively. This analysis utilized the DAVID functional annotation bioinformatics microarray analysis platform to explore biological functions. Gene ontology (GO) terms including biological process (BP) were used to assess biological functions. In addition, related biological pathways were investigated with a focus on the Kyoto Encyclopedia of the Genome (KEGG) pathway. All enrichment analysis maps were generated using Metascape and are available at https://metascape.org/gp/ Specific expression analysis Specific expression analysis was performed for genes significantly positively and negatively correlated within the TR50 window of dALFF. Analyses were performed using the CSEA tool accessible at http://doughertytools.wustl.edu/CSEAtool.html Proteins and protein interactions Protein–protein interaction (PPI) analysis was performed on significantly positively and negatively correlated genes within the TR50 window of dALFF. This analysis was performed using STRING v11.0 2 3 Neurotransmitter receptors/transporters distribution maps The neurotransmitter density map is derived from positron emission tomography (PET) images of over 1,200 healthy individuals, encompassing 19 distinct neurotransmitter receptors and transport proteins from nine different neurotransmitter systems. Twenty different neurotransmitter receptor/transmitter whole-brain density profiles were selected from previous in vivo 4 71–75 t Statistical analysis We statistically analyzed the clinical characteristics of the two groups of patients using the Statistical Package for the Social Sciences (SPSS)26 software from IBM, Armonk, NY, United States. Between-group differences in dALFF values for 30TR, 50TR, and 80TR were assessed by two-sample t test assessed with age, gender and head movement as covariates. Multiple comparisons were corrected using the Gaussian Random Field (GRF) method, with significance at the voxel level set at p p Figure 1 Figure 1 A systematic data analysis process was used in this study. The study first implemented one-sample t-tests and two-sample t-tests for dALFF values calculated in 30TR, 50TR, and 80TR time window conditions for PACG patients and HC subjects, respectively, and used Gaussian Random Field Theory (GRF) multiple comparisons correction method ( p p https://biovisart.com.cn Flowchart depicting analyses in brain research. Left panel: dALFF value extraction from brain images using varying windows, leading to tests. Middle panel: Gene expression from AHBA data, undergoing PLS analysis. Right panel: Gene analysis through enrichment, cell specificity, and protein-protein interactions. Bottom right: Receptor and transporter correlation with a spider plot. Results Demographics and disease characteristics In terms of demographic characteristics, the PACG and HC groups did not present statistically significant differences in gender ( p p p p p Table 1 Table 1 Demographics and visual measurements between two groups. Condition PACG group HC group t/ꭓ 2 p Gender (male/female) 26/21 29/17 0.57 0.45 Age (years) 54.53 ± 10.03 55.91 ± 10.00 −0.184 0.86 Education 14.86 ± 1.56 15.14 ± 1.51 −0.886 0.38 BCVA-OD 0.51 ± 0.17 1.11 ± 0.06 −22.15 <0.001 BCVA-OS 0.49 ± 0.15 1.11 ± 0.06 −26.44 <0.001 IOP-OD 48.42 ± 1.78 14.53 ± 1.06 111.24 <0.001 IOP-OS 48.02 ± 1.53 15.10 ± 1.20 115.04 <0.001 BCVA, best corrected visual acuity; IOP, intraocular pressure; OD, oculus dexter; OS, oculus sinister. * indicate p Values of dALFF in different windows Performing a one-sample test for the PACG and HC groups in 30TR, 50TR, and 80TR sliding windows, respectively, we found that the spatial distribution of dALFF at all three temporal resolutions showed a significant consistency within the groups ( Figure 2 Figure 2 This figure presents the results of the one-sample test of dALFF values in the sliding windows of 30TR (A,B) (C,D) (E,F) Three sets of brain images compare PACG and HC groups at ages thirty, fifty, and eighty. Each section (A-F) shows lateral and medial views with variations in color representing data differences, indicated by adjacent color bars. Two-sample t-tests showed that under 30TR, 50TR, and 80TR dynamic window conditions, PACG patients presented significantly higher dALFF amplitudes in all scan states compared with healthy controls. in the 30TR sliding window, the regions of significant change were the left middle temporal gyrus (Temporal_Mid_L), the left suboccipital gyrus (Occipital_Inf_L), right Cerebellum Superior (Cerebelum_6_R), right periaqueductal cortex (Calcarine_R), right middle temporal gyrus (Temporal_Mid_R), and left middle occipital gyrus (Occipital_Mid_L), right middle occipital gyrus (Occipital_Mid_R), right subparietal marginal angular gyrus (Parietal_Sup_R) ( Table 2 Figure 3A Figure 3B Table 2 Figure 4A Figure 4B Table 2 Figure 5A Figure 5B Table 2 Results of the dALFF two-sample test for the PACG and HC groups under different sliding windows. Condition Voxel MNI coordinate peak t  x  y  z Window size of 30 TR and sliding step of 2 TR Temporal_Mid_L 43 −51 0 −18 3.9026 Occipital_Inf_L 68 −30 −84 −12 4.6844 Cerebelum_6_R 37 36 −60 −21 5.0446 Calcarine_R 34 6 −87 0 4.3162 Temporal_Mid_R 38 45 −72 9 4.2708 Occipital_Mid_L 46 −33 −90 9 4.2042 Occipital_Mid_R_1 67 33 −84 9 4.5182 Occipital_Mid_R_2 36 33 −78 36 4.2371 Parietal_Sup_R 55 24 −69 63 4.6455 Window size of 50 TR and sliding step of 2 TR Cerebelum_6_R 38 36 −60 −21 4.7551 Occipital_Inf_L_1 55 −30 −84 −12 4.4546 Occipital_Inf_L_2 31 −51 −69 −9 4.8652 Occipital_Sup_R 34 30 −75 42 4.2786 Parietal_Sup_R 54 24 −69 63 4.8628 Window size of 80 TR and sliding step of 2 TR Angular_R 18 33 −60 39 3.6643 Temporal_Mid_L, left middle temporal gyrus; Occipital_Inf_L, left suboccipital gyrus; Cerebellum_6_R, right Cerebellum Superior; Calcarine_R, right peri-talar fissure cortex; Temporal_Mid_R, right middle temporal gyrus; Occipital_Mid_L, left middle occipital gyrus; Occipital_Mid_R, right middle occipital gyrus; Parietal_Sup_R, right subparietal marginal angular gyrus; Occipital_Sup_R, right superior occipital gyrus; Angular_R, right angular gyrus; dALFF, dynamic low-frequency fluctuation amplitude; TR, repetition time; PACG, primary angle-closure glaucoma; HC, healthy control; MNI, Montreal Neurological Institute. Figure 3 This figure represents the two-sample t Four brain models at the top highlight regions in red against a color scale from blue to red. Below, MRI images show brain slices with highlighted areas. A bar graph at the bottom compares mean dALFF signal values across various brain regions, distinguished by red bars for PACG and blue for HC. Figure 4 This figure represents the results of the two-sample t-test for dALFF values in the PACG and HC groups in the 50TR sliding window. The results show that compared to the HC group, the PACG group had altered dALFF values in a wide range of brain regions mainly in the occipital lobe and all of them showed elevated dALFF values. occipital_Inf_L, left suboccipital gyrus; Cerebelum_6_R, right Cerebellum Superior; Occipital_Sup_R, right superior occipital gyrus; Parietal_Sup_R, right inferior parietal marginal angle gyrus; dALFF, dynamic low-frequency fluctuation amplitude; TR, repetition time; PACG, primary angle-closure glaucoma; HC, healthy control. Illustration depicting (A) brain slices with highlighted regions showing significant differences in dALFF, color-coded from blue to red, and (B) a bar graph comparing mean dALFF signal values across six brain regions between two groups: PACG (red) and HC (blue). Figure 5 This figure represents the two-sample t-test results of the dALFF values in the PACG and HC groups in the 80 TR sliding window. The results indicate that the dALFF values of the right angular gyrus were altered and elevated in the PACG group compared with the HC group. angular_R, right angular gyrus; dALFF, amplitude of dynamic low-frequency fluctuations; TR, repetition time; PACG, primary angle-closure glaucoma; HC, healthy control. Three-dimensional brain renderings and axial MRI slices show brain activity differences, highlighted by a color scale from blue to red, indicating varying dALFF values. A bar graph compares mean dALFF signal values in the right angular gyrus for PACG and HC groups, with PACG in red and HC in blue. 50TR sliding window dALFF values correlate with cortical gene expression In this study, the PLS system was used to explore the pattern of association between the dALFF feature of the 50TR sliding window ( Figure 6A Figure 6B Figure 6C p Figure 6D Figure 6 dALFF values under the 50TR sliding window correlate with cortical gene expression. (A) (B) (C) (D) Illustration showing brain maps and graphs related to a study. Panel A shows regional differences in dALFF_50 on brain images with a color scale from blue to red. Panel B displays weight gene expression maps with a similar color scale. Panel C shows a scatter plot of PLS2 scores against case-control t-values, indicating a trend line. Panel D presents a histogram of PLS2 weighted Z scores and a table of genes with corresponding z-scores, highlighting significant values in blue and red. Enrichment analysis We performed a systematic enrichment analysis of the finely screened PLS + and PLS- gene clusters to reveal their functional characteristics. We systematically compared the PLS + genome with the Gene Ontology bioprocess and KEGG pathway databases. Ontology terms for PLS + genes ( p Figure 7A Figure 7B Figure 7 Enrichment analysis of genes associated with dALFF values PLS + and PLS- under the 50TR sliding window. (A) p (B) p Panel A displays a gene enrichment bubble chart and network diagram for PLS+ genes, with terms like \"regulation of neuron projection development\" and \"chromosome organization.\" Panel B shows a similar chart and network for PLS- genes, featuring terms like \"membrane organization\" and \"blood circulation.\" Both panels use color gradients to denote statistical significance and bubble size to represent count. A legend indicates corresponding biological processes. Specific expression analysis For genes associated with dALFF values PLS + and PLS- under the 50TR sliding window, we performed cell-specific expression analysis, brain-specific expression analysis, and time-specific expression analysis. Among PLS + genes, Cellspecific expression analysis ( Figure 8A Figure 8B Figure 8C Figure 8D Figure 8E Figure 8F Figure 8 This figure shows the specific expression analysis of genes associated with dALFF values PLS + and PLS- under the 50TR sliding window. (A,D) (B,E) (C,F) p p p p Diagrams displaying brain region and developmental stage analysis using PLS (Partial Least Squares). Images labeled A and D show networks of neurons with nodes sized by significance. Images B and E display simplified region results. Images C and F provide hexagonal matrices for regions such as the amygdala and cerebellum across developmental stages. Color gradients from yellow to red indicate p-values, marking statistical significance. PLS+ and PLS- differentiations suggest distinct data sets or analytic approaches. Protein–protein interaction analysis We performed PPI analysis of PLS + -associated genes and PLS-associated genes separately and selected the genes with the highest degree value for spatiotemporal specific expression analysis. Among PLS + genes, a total of 64 genes formed an interconnected PPI network ( Figure 9A Figure 9B Figure 9C Figure 9D Figure 9 This graph shows the PPI analysis of genes associated with dALFF values PLS + and PLS- under the 50TR sliding window. (A,C) (B,D) Four-panel image showing protein interaction networks and graphs of signal intensity. Panel A: Protein network for PLS+. Panel B: Line graph of NOP58 signal intensity over time, categorized by brain regions, with age on the x-axis. Panel C: Protein network for PLS-. Panel D: Line graph of KRAS signal intensity over time, categorized by brain regions, with age on the x-axis. Legends indicate different brain regions: NCX, STR, HIP, MD, AMY, and CBC. Neurotransmitter receptor/transporter correlation analysis We correlated the dALFF values under the 50TR sliding window with the expression matrix of neurotransmitter receptors/transporters obtained. The results revealed significant correlations for 2 neurotransmitter receptors/transporters, 5-hydroxytryptamine type 4 receptor (5-HT4R) and metabotropic glutamate receptor 5 (mGlu5R) ( Figure 10 Table 3 Figure 10 Results of correlation analysis of dALFF values with receptors/transporters under 50TR sliding window. (A) p p (B) Image A shows a radar chart depicting various neurotransmitter receptors with values ranging from -0.8 to 0.4. Image B includes two scatter plots. The top plot shows a negative correlation between 5HT4 and case-control t-values, with a green trend line. The bottom plot shows a slight negative correlation between mGluR5 and case-control t-values, with a yellow trend line. Table 3 Results of correlation analysis of abnormal dALFF values in 50 TR with significant receptors/transporters. Receptor/Transporter p p spin r 5HT4R 0.03 0.01 0.23 mGluR5R <0.01 0.01 0.27 Discussion In this study, dALFF was analyzed in PACG patients and healthy controls using the 30TR, 50TR and 80TR sliding window methods, and it was found that compared to the HC group, PACG patients showed more significant dALFF enhancement in all three time windows analyzed, and this functional alteration was mainly focused on neuroanatomical structures such as the occipital cortex, the upper cerebellar region and the angular gyrus. A total of 340 genes were identified to show significant associations with neuroimaging features by PLS correlation analysis, including 155 PLS + genes and 185 PLS- genes, and quantitative correlation maps between gene expression and brain function abnormalities were established. Gene ontology enrichment analysis revealed that these genes were significantly enriched in key biological processes such as “neuronal projection developmental regulation” (GO:0031175) and “biofilm organization” (GO:0061024), suggesting that they are involved in the molecular mechanisms of neural circuit remodeling and cell membrane stability. Time-specific expression analysis showed that PLS-associated genes showed significant enrichment (FDR < 0.05) at several key stages of thalamic development, which revealed the potential role of abnormal thalamic development in the pathomechanism of PACG from an ontogenetic point of view. Ppi analysis indicated that most of the genes associated with PACG were involved in the composition of the ppi network, of which the pivotal genes were NOP58 and KRAS. correlation analysis with neurotransmitter receptors/transporters revealed that 5-HT4R and mGlu5R showed significant correlation. These multi-omics findings systematically elucidated the possible molecular regulatory network of PACG, and constructed a multi-scale pathology model from gene expression disorders to clinical phenotypes by integrating brain functional imaging features, genetic regulatory elements and neurotransmitter system abnormalities. The occipital lobe, as a core brain area for visual information processing, has the ability to integrate visual functions at multiple levels. Its primary visual cortex (area V1) is responsible for receiving and parsing visual signals transmitted from the retina and completing the recognition of basic features such as light, shape, and color ( 76 77 78 48 79 34 33 34 34 80 p 34 77 81 79 82 83 The superior cerebellum consists of the anterior, superior-posterior, middle and anterior-superior portions of the earth, which regulate postural coordination, motor planning, sensory integration and balance functions, respectively, and its deeper nuclei such as the dentate nucleus and the raphe nucleus are widely connected to the central nervous system through the midbrain peduncle, and together they are involved in motor execution and cognitive-emotional regulation ( 84–87 48 88 89 85 86 88 34 88 34 88 90 91 33 92 33 88 The angular gyrus is an important brain region in the posterior parietal lobe, located at the junction of the temporal, parietal, and occipital lobes, and its functions are characterized by a high degree of multimodal integration ( 93 94 95 96 97 98 99 100 94 96 101 102 103 102 104 81 101 43 105 “Regulation of neuron projection development” and ‘membrane organization’ affect the pathological process of PACG from the dimensions of neuronal morphology and function establishment and membrane dynamic balance, respectively. The “Regulation of Neuron Projection Development” pathway is involved in the morphogenesis, orientation and functional establishment of neuronal axons and dendrites through the cascade of transcription factors ( 106 107 108 109 110 111 112 113–115 116 117 Specific expression analysis revealed that genes negatively correlated with PACG are greatly involved in most stages of thalamogenesis. The development of thalamus occurs in stages of neurogenesis, nucleus differentiation, axon guidance and establishment of thalamo-cortical connections. Thalamic neurons are formed during the embryonic period, with differences in gene expression in different nuclei determining their functional specificity ( 118 119 120 48 121 122 123 PPI analysis revealed that both PLS + and PLS- genes associated with PACG could be constructed into a PPI network, in which the genes with the highest degree values were NOP58 and KRAS, respectively. NOP58 is a key protein involved in ribosome biosynthesis in the nucleolus accumbens, and forms a complex with NOP56 and NOP1 to regulate the processing and methylation of rRNA precursors ( 124 111 125–127 128 126 48 116 5-HT4R is expressed in the ciliary body, iris, and choroid ( 129 130 131 130 131 132 133 2+ 134 Several limitations of this study remain to be elucidated: (1) Due to the relatively restricted sample size, the current findings may be significantly affected by sampling error, and subsequent studies should confirm the robustness of the results by enlarging the sample size. (2) The limitations of the temporal resolution of the dALFF parameter need to be emphasized - the metric simulates dynamic temporal evolution through a sliding time window simulates dynamic time evolution, which is still essentially a quasi-static metric, and its calculation process is susceptible to systematic interference from rs-fMRI-related confounding variables. (3) The architectural flaws of adopting the AHBA database are noteworthy, as the dataset covers gene expression profiles of the left hemisphere brain regions only, leading to potential bias in neuroimaging studies based on hemispheric asymmetry, especially for dALFF and other brain regions with functional The interpretation of biomarkers characterized by lateralization of brain regions, such as dALFF, needs to be kept cautious. Conclusion Using dALFF analysis, the present study revealed extensive dynamic functional remodeling in the occipital visual cortex of PACG patients by systematically evaluating their dynamic functional variability over multiple time windows, and suggested that both visual pathway damage and neurological compensation exist in this population. By integrating genome-wide transcriptomic profiling and whole-brain quantitative analysis of neurotransmitter receptor/transporter spatial distribution patterns, the present study elucidated the potential association between cortical layer-specific functional abnormalities and alterations in the neuromolecular microenvironment, and laid the foundation of molecular neuroscience for the development of innovative therapeutic strategies for PACG. 1 https://www.fil.ion.ucl.ac.uk/spm/  2 https://string-db.org/  3 https://hbatlas.org/  4 https://neurovault.Org/collections/1206/ Data availability statement The raw data supporting the conclusions of this article will be made available by the authors, without undue reservation. Ethics statement The studies involving humans were approved by the medical ethics committee of the Jiangxi Provincial People’s Hospital and School of Ophthalmology and Optometry, Jiangxi Medical College, Nanchang University, The First Affiliated Hospital of Nanchang Medical College. The studies were conducted in accordance with the local legislation and institutional requirements. The participants provided their written informed consent to participate in this study. Written informed consent was obtained from the individual(s) for the publication of any potentially identifiable images or data included in this article. Author contributions YH: Conceptualization, Data curation, Formal analysis, Funding acquisition, Project administration, Resources, Software, Visualization, Writing – original draft, Writing – review & editing. R-YH: Funding acquisition, Investigation, Methodology, Project administration, Resources, Software, Supervision, Validation, Visualization, Writing – original draft, Writing – review & editing. H-JY: Conceptualization, Funding acquisition, Investigation, Project administration, Resources, Software, Supervision, Validation, Visualization, Writing – original draft, Writing – review & editing. T-TX: Conceptualization, Data curation, Funding acquisition, Investigation, Resources, Software, Supervision, Validation, Visualization, Writing – original draft, Writing – review & editing. Conflict of interest The authors declare that the research was conducted in the absence of any commercial or financial relationships that could be construed as a potential conflict of interest. Generative AI statement The authors declare that no Gen AI was used in the creation of this manuscript. Any alternative text (alt text) provided alongside figures in this article has been generated by Frontiers with the support of artificial intelligence and reasonable efforts have been made to ensure accuracy, including review by the authors wherever possible. If you identify any issues, please contact us. Publisher’s note All claims expressed in this article are solely those of the authors and do not necessarily represent those of their affiliated organizations, or those of the publisher, the editors and the reviewers. Any product that may be evaluated in this article, or claim that may be made by its manufacturer, is not guaranteed or endorsed by the publisher. References 1. Guo L Deng Y Fang L Liu C Guo T Characterization of ocular biometrics and aqueous humor dynamics in primary angle closure suspects Medicine 2017 96 e6096 10.1097/MD.0000000000006096 28207520 PMC5319509 2. Seet L Narayanaswamy A Finger SN Htoon HM Nongpiur ME Toh LZ Distinct iris gene expression profiles of primary angle closure glaucoma and primary open angle glaucoma and their interaction with ocular biometric parameters Clin Experiment Ophthalmol 2016 44 684 92 10.1111/ceo.12743 26988898 PMC5111746 3. Wang S Zhang H Yang W Zhang Y Qin H Wang M Relationship between anterior segment biometry and primary angle-closure glaucoma in Hubei region: a retrospective case-control study Front Med 2024 11 1418566 10.3389/fmed.2024.1418566 39247635 PMC11377215 4. Chen X Chen Y Wiggs JL Pasquale LR Sun X Fan BJ Association of Matrix Metalloproteinase-9 (MMP9) variants with primary angle closure and primary angle closure Glaucoma PLoS One 2016 11 e0157093 10.1371/journal.pone.0157093 27272641 PMC4896618 5. Cheng J-W Zong Y Zeng Y-Y Wei R-L The prevalence of primary angle closure glaucoma in adult Asians: a systematic review and meta-analysis PLoS One 2014 9 e103222 10.1371/journal.pone.0103222 25057993 PMC4110010 6. Zhang N Wang J Chen B Li Y Jiang B Prevalence of primary angle closure glaucoma in the last 20 years: a meta-analysis and systematic review Front Med 2021 7 624179 10.3389/fmed.2020.624179 33537335 PMC7847989 7. Ang LPS Ang LPK Current understanding of the treatment and outcome of acute primary angle-closure glaucoma: an Asian perspective Ann Acad Med Singap 2008 37 210 4 10.47102/annals-acadmedsg.V37N3p210 18392300 8. Chen R-B Zhong Y-L Liu H Huang X Machine learning analysis reveals abnormal functional network hubs in the primary angle-closure glaucoma patients Front Hum Neurosci 2022 16 935213 10.3389/fnhum.2022.935213 36092649 PMC9450012 9. Uhm KB Lee JM Sung HK Comparison of glaucomatous optic nerve damage in primary angle-closure glaucoma with and without acute attack Korean J Ophthalmol 2005 19 201 7 10.3341/kjo.2005.19.3.201 16209282 10. Zhou L Lin D Xu G Wang X Chen Z Wang D Alteration of neurofilament heavy chain and its phosphoforms reveals early subcellular damage beyond the optic nerve head in glaucoma Front Neurol 2023 14 1091697 10.3389/fneur.2023.1091697 37034083 PMC10073422 11. Conaghan PG Østergaard M Troum O Bowes MA Guillard G Wilkinson B Very early MRI responses to therapy as a predictor of later radiographic progression in early rheumatoid arthritis Arthritis Res Ther 2019 21 214 10.1186/s13075-019-2000-1 31639034 PMC6805378 12. Cui Y Liu C Wang Y Xie H Multimodal magnetic resonance scans of patients with mild cognitive impairment Dement Neuropsychol 2023 17 e20230017 10.1590/1980-5764-dn-2023-0017 38111592 PMC10727029 13. Hoffmann O Gold R Meuth SG Linker RA Skripuletz T Wiendl H Prognostic relevance of MRI in early relapsing multiple sclerosis: ready to guide treatment decision making? Ther Adv Neurol Disord 2024 17 229325 10.1177/17562864241229325 38332854 PMC10851744 14. Johnson KA Fox NC Sperling RA Klunk WE Brain imaging in Alzheimer disease Cold Spring Harb Perspect Med 2012 2 a006213 3 10.1101/cshperspect.a006213 22474610 PMC3312396 15. Wakasugi N Hanakawa T It is time to study overlapping molecular and circuit Pathophysiologies in Alzheimer’s and Lewy body disease spectra Front Syst Neurosci 2021 15 777706 10.3389/fnsys.2021.777706 34867224 PMC8637125 16. Glover GH Overview of functional magnetic resonance imaging Neurosurg Clin N Am 2011 22 133 9 10.1016/j.nec.2010.11.001 21435566 PMC3073717 17. Gore JC Principles and practice of functional MRI of the human brain J Clin Invest 2003 112 4 9 10.1172/JCI200319010 12840051 PMC162295 18. Tang Q-Y Huang B-L Huang X Altered functional connectivity between the default mode network in primary angle-closure glaucoma patients Neuroreport 2024 35 129 35 10.1097/WNR.0000000000001995 38251458 19. Tong Y Zhong YL Liu H Huang X Disrupted interhemispheric functional connectivity in primary angle-closure glaucoma: a functional MRI study: voxel-mirrored homotopic connectivity in primary angle-closure glaucoma patients Neuroreport 2022 33 604 11 10.1097/WNR.0000000000001823 36062513 20. Zhong Y-L Liu H Huang X Altered dynamic large-scale brain networks and combined machine learning in primary angle-closure glaucoma Neuroscience 2024 558 11 21 10.1016/j.neuroscience.2024.08.013 39154845 21. Jiang F Zeng F-F Yu C Ye Y-Q Zeng X-J Altered whole-brain gray matter volume in primary angle closure glaucoma patients: a voxel-based morphometry study Neuroreport 2018 29 1405 12 10.1097/WNR.0000000000001126 30199440 22. Wang Y Shu Y Cai G Guo Y Gao J Chen Y Altered static and dynamic functional network connectivity in primary angle-closure glaucoma patients Sci Rep 2024 14 11682 10.1038/s41598-024-62635-6 38778225 PMC11111766 23. Wang Y Xiong C Li S Li J Wang B Yan M Abnormal topological properties and functional-structural coupling of large-scale brain networks in primary angle-closure glaucoma Quant Imaging Med Surg 2025 15 6053 67 10.21037/qims-24-1947 40727359 PMC12290761 24. Golestani AM Kwinta JB Khatamian YB Chen JJ The effect of low-frequency physiological correction on the reproducibility and specificity of resting-state fMRI metrics: functional connectivity, ALFF, and ReHo Front Neurosci 2017 11 546 10.3389/fnins.2017.00546 29051724 PMC5633680 25. Mennes M Zuo X-N Kelly C Di Martino A Zang Y-F Biswal B Linking inter-individual differences in neural activation and behavior to intrinsic brain dynamics NeuroImage 2011 54 2950 9 10.1016/j.neuroimage.2010.10.046 20974260 PMC3091620 26. Zuo X-N Di Martino A Kelly C Shehzad ZE Gee DG Klein DF The oscillating brain: complex and reliable NeuroImage 2010 49 1432 45 10.1016/j.neuroimage.2009.09.037 19782143 PMC2856476 27. Bailes SM Gomez DE Setzer B Lewis LD Resting-state fMRI signals contain spectral signatures of local hemodynamic response timing eLife 2023 12 e86453 10.7554/eLife.86453 37565644 PMC10506795 28. Shi W Tang L Lin Q Li B Jiang N Zhu P Altered spontaneous brain activity patterns in diabetic patients with vitreous hemorrhage using amplitude of low-frequency fluctuation: a resting-state fMRI study Mol Med Rep 2020 22 2291 9 10.3892/mmr.2020.11294 32705185 PMC7411342 29. Liang P Xiang J Liang H Qi Z Li K Altered amplitude of low-frequency fluctuations in early and late mild cognitive impairment and Alzheimer’s disease CAR 2014 11 389 98 10.2174/1567205011666140331225335 24720892 30. Wang Z Yan C Zhao C Qi Z Zhou W Lu J Spatial patterns of intrinsic brain activity in mild cognitive impairment and alzheimer’s disease: a resting-state functional MRI study Hum Brain Mapp 2011 32 1720 40 10.1002/hbm.21140 21077137 PMC6870362 31. Wang L Dai W Su Y Wang G Tan Y Jin Z Amplitude of low-frequency oscillations in first-episode, treatment-naive patients with major depressive disorder: a resting-state functional MRI study PLoS One 2012 7 e48658 10.1371/journal.pone.0048658 23119084 PMC3485382 32. Wu X Wang L Jiang H Fu Y Wang T Ma Z Frequency-dependent and time-variant alterations of neural activity in post-stroke depression: a resting-state fMRI study Neuroimage 2023 38 103445 10.1016/j.nicl.2023.103445 37269698 PMC10244813 33. Huang X Zhong Y-L Zeng X-J Zhou F Liu X-H Hu P-H Disturbed spontaneous brain activity pattern in patients with primary angle-closure glaucoma using amplitude of low-frequency fluctuation: a fMRI study Neuropsychiatr Dis Treat 2015 11 1877 83 10.2147/NDT.S87596 26251603 PMC4524585 34. Jiang F Yu C Zuo M-J Zhang C Wang Y Zhou F-Q Frequency-dependent neural activity in primary angle-closure glaucoma Neuropsychiatr Dis Treat 2019 15 271 82 10.2147/NDT.S187367 30697052 PMC6342137 35. Xt L L C Xm W Cc Z X H Differences in cerebral spontaneous neural activity correlate with gene-specific transcriptional signatures in primary angle-closure glaucoma Neuroscience 2025 565 399 419 10.1016/j.neuroscience.2024.12.012 39653245 36. Becker R Hervais-Adelman A Resolving the connectome, spectrally-specific functional connectivity networks and their distinct contributions to behavior eNeuro 2020 7 2020 10.1523/ENEURO.0101-20.2020 32826259 PMC7484267 37. Sjuls GS Specht K Variability in resting-state functional magnetic resonance imaging: the effect of body mass, blood pressure, hematocrit, and glycated hemoglobin on hemodynamic and neuronal parameters Brain Connect 2022 12 870 82 10.1089/brain.2021.0125 35473334 PMC9807254 38. Chen JJ Herman P Keilholz S Thompson GJ Editorial: origins of the resting-state fMRI signal Front Neurosci 2020 14 594990 10.3389/fnins.2020.594990 33192281 PMC7653173 39. Liu TT Neurovascular factors in resting-state functional MRI Neuroimage 2013 80 339 48 10.1016/j.neuroimage.2013.04.071 23644003 PMC3746765 40. Lu H Jaime S Yang Y Origins of the resting-state functional MRI signal: potential limitations of the “Neurocentric” model Front Neurosci 2019 13 1136 10.3389/fnins.2019.01136 31708731 PMC6819315 41. Chen H Qi G Zhang Y Huang Y Zhang S Yang D Altered dynamic amplitude of low-frequency fluctuations in patients with migraine without Aura Front Hum Neurosci 2021 15 636472 10.3389/fnhum.2021.636472 33679354 PMC7928334 42. Meng X Zheng J Liu Y Yin Y Hua K Fu S Increased dynamic amplitude of low frequency fluctuation in primary insomnia Front Neurol 2020 11 609 10.3389/fneur.2020.00609 32714271 PMC7344192 43. Cui Q Sheng W Chen Y Pang Y Lu F Tang Q Dynamic changes of amplitude of low-frequency fluctuations in patients with generalized anxiety disorder Hum Brain Mapp 2020 41 1667 76 10.1002/hbm.24902 31849148 PMC7267950 44. Ma M Zhang H Liu R Liu H Yang X Yin X Static and dynamic changes of amplitude of low-frequency fluctuations in cervical Discogenic pain Front Neurosci 2020 14 733 10.3389/fnins.2020.00733 32760245 PMC7372087 45. Ji Y Wang Y Cheng Q Fu W Huang S Zhong P Machine learning analysis reveals aberrant dynamic changes in amplitude of low-frequency fluctuations among patients with retinal detachment Front Neurosci 2023 17 1227081 10.3389/fnins.2023.1227081 37547140 PMC10398337 46. Zhang C Dou B Wang J Xu K Zhang H Sami MU Dynamic alterations of spontaneous neural activity in Parkinson’s disease: a resting-state fMRI study Front Neurol 2019 10 1052 10.3389/fneur.2019.01052 31632340 PMC6779791 47. Zhu Q Tian S Zhang L Ding H Gao Y Tang Y Altered dynamic amplitude of low-frequency fluctuation in individuals at high risk for Alzheimer’s disease Eur J Neurosci 2024 59 2391 402 10.1111/ejn.16267 38314647 48. Ahram DF Alward WL Kuehn MH The genetic mechanisms of primary angle closure glaucoma Eye 2015 29 1251 9 10.1038/eye.2015.124 26206529 PMC4815686 49. Sakurada Y Mabuchi F Genetic risk factors for Glaucoma and exfoliation syndrome identified by genome-wide association studies Curr Neuropharmacol 2018 16 933 41 10.2174/1570159X15666170718142406 28721823 PMC6120117 50. Zukerman R Harris A Verticchio Vercellin A Siesky B Pasquale LR Ciulla TA Molecular genetics of Glaucoma: subtype and ethnicity considerations Genes 2020 12 55 10.3390/genes12010055 33396423 PMC7823611 51. Hawrylycz M Miller JA Menon V Feng D Dolbeare T Guillozet-Bongaarts AL Canonical genetic signatures of the adult human brain Nat Neurosci 2015 18 1832 44 10.1038/nn.4171 26571460 PMC4700510 52. Richiardi J Altmann A Milazzo A-C Chang C Chakravarty MM Banaschewski T Correlated gene expression supports synchronous activity in brain networks Science 2015 348 1241 4 10.1126/science.1255905 26068849 PMC4829082 53. Wang G-Z Belgard TG Mao D Chen L Berto S Preuss TM Correspondence between resting-state activity and brain gene expression Neuron 2015 88 659 66 10.1016/j.neuron.2015.10.022 26590343 PMC4694561 54. Estevez-Fraga C Altmann A Parker CS Scahill RI Costa B Chen Z Genetic topography and cortical cell loss in Huntington’s disease link development and neurodegeneration Brain 2023 146 4532 46 10.1093/brain/awad275 37587097 PMC10629790 55. Williams JA Burgess S Suckling J Lalousis PA Batool F Griffiths SL Inflammation and brain structure in schizophrenia and other neuropsychiatric disorders: a Mendelian randomization study JAMA Psychiatry 2022 79 498 507 10.1001/jamapsychiatry.2022.0407 35353173 PMC8968718 56. Yang A Luan J Xu M Du L Lv K Hu P Regional brain iron correlates with transcriptional and cellular signatures in Alzheimer’s disease Alzheimers Dement 2025 21 e14459 10.1002/alz.14459 39876820 PMC11775454 57. Arnatkevičiūtė A Fulcher BD Oldham S Tiego J Paquola C Gerring Z Genetic influences on hub connectivity of the human connectome 2020 12 4237 10.1101/2020.06.21.163915 PMC8271018 34244483 58. Elman JA Panizzon MS Hagler DJ Fennema-Notestine C Eyler LT Gillespie NA Genetic and environmental influences on cortical mean diffusivity NeuroImage 2017 146 90 9 10.1016/j.neuroimage.2016.11.032 27864081 PMC5322245 59. Fornito A Arnatkevičiūtė A Fulcher BD Bridging the gap between connectome and transcriptome Trends Cogn Sci 2019 23 34 50 10.1016/j.tics.2018.10.005 30455082 60. Hibar DP Stein JL Renteria ME Arias-Vasquez A Desrivières S Jahanshad N Common genetic variants influence human subcortical brain structures Nature 2015 520 224 9 10.1038/nature14101 25607358 PMC4393366 61. Huang X He Y-X Wan S Genetic mechanisms of hemispheric functional connectivity in diabetic retinopathy: a joint neuroimaging and transcriptomic study Front Cell Dev Biol 2025 13 1590627 10.3389/fcell.2025.1590627 40406416 PMC12096415 62. Zhong YL Liu H Huang X Genetic mechanisms of dynamic functional connectivity density in diabetic retinopathy brains: a combined transcriptomic and resting-state functional magnetic resonance imaging study Front Cell Neurosci 2025 19 6038 10.3389/fncel.2025.1476038 40276708 PMC12018502 63. Turk E Scholtens LH Van Den Heuvel MP Cortical chemoarchitecture shapes macroscale effective functional connectivity patterns in macaque cerebral cortex Hum Brain Mapp 2016 37 1856 65 10.1002/hbm.23141 26970255 PMC6867501 64. Leonardi N Van De Ville D On spurious and real fluctuations of dynamic functional connectivity during rest NeuroImage 2015 104 430 6 10.1016/j.neuroimage.2014.09.007 25234118 65. Li J Duan X Cui Q Chen H Liao W More than just statics: temporal dynamics of intrinsic brain activity predicts the suicidal ideation in depressed patients Psychol Med 2019 49 852 60 10.1017/S0033291718001502 29909788 66. Cheng X Chen J Zhang X Wang T Sun J Zhou Y Characterizing the temporal dynamics of intrinsic brain activities in depressed adolescents with prior suicide attempts Eur Child Adolesc Psychiatry 2024 33 1179 91 10.1007/s00787-023-02242-4 37284850 PMC11032277 67. Jiang W-H Liu J Zhou J Wu Q Pu X-Y Chen H-H Altered dynamic brain activity and functional connectivity in thyroid-associated ophthalmopathy Hum Brain Mapp 2023 44 5346 56 10.1002/hbm.26437 37515416 PMC10543102 68. Liu W Jiang X Xin Y Deng Z Xie Y Zhou Y Sex effects on differentiating patients with major depressive disorder from bipolar disorder in depressive state: a fMRI study with follow-up J Affect Disord 2023 340 396 404 10.1016/j.jad.2023.08.041 37572701 69. Arnatkeviciute A Fulcher BD Fornito A A practical guide to linking brain-wide gene expression and neuroimaging data NeuroImage 2019 189 353 67 10.1016/j.neuroimage.2019.01.011 30648605 70. Arloth J Bader DM Röh S Altmann A Re-annotator: annotation pipeline for microarray probe sequences PLoS One 2015 10 e0139516 10.1371/journal.pone.0139516 26426330 PMC4591122 71. Beliveau V Ganz M Feng L Ozenne B Højgaard L Fisher PM A high-resolution in vivo atlas of the human brain’s serotonin system J Neurosci 2017 37 120 8 10.1523/JNEUROSCI.2830-16.2016 28053035 PMC5214625 72. Dukart J Holiga Š Chatham C Hawkins P Forsyth A McMillan R Cerebral blood flow predicts differential neurotransmitter activity Sci Rep 2018 8 4074 10.1038/s41598-018-22444-0 29511260 PMC5840131 73. Hesse S Becker G-A Rullmann M Bresch A Luthardt J Hankir MK Central noradrenaline transporter availability in highly obese, non-depressed individuals Eur J Nucl Med Mol Imaging 2017 44 1056 64 10.1007/s00259-016-3590-3 28066877 PMC5538358 74. Liu Y Sun J Jiang J Wan K Tang Y Zhang M Brain functional specialization in obsessive-compulsive disorder associated with neurotransmitter profiles J Affect Disord 2023 329 477 82 10.1016/j.jad.2023.02.146 36871908 75. Savli M Bauer A Mitterhauser M Ding Y-S Hahn A Kroll T Normative database of the serotonergic system in healthy subjects using multi-tracer PET NeuroImage 2012 63 447 59 10.1016/j.neuroimage.2012.07.001 22789740 76. Voelkle MC Lindenberger U Cognitive development Front Young Minds 2014 2 1 10.3389/frym.2014.00001 77. Geng C Wang S Li Z Xu P Bai Y Zhou Y Resting-state functional network topology alterations of the occipital lobe associated with attention impairment in isolated rapid eye movement behavior disorder Front Aging Neurosci 2022 14 844483 10.3389/fnagi.2022.844483 35431890 PMC9012114 78. Liu X Li S-J Hudetz AG Increased precuneus connectivity during propofol sedation Neurosci Lett 2014 561 18 23 10.1016/j.neulet.2013.12.047 24373986 PMC3959727 79. Tirendi S Domenicotti C Bassi AM Vernazza S Genetics and Glaucoma: the state of the art Front Med 2023 10 1289952 10.3389/fmed.2023.1289952 38152303 PMC10751926 80. Tang Q-Y Zhong Y-L Wang X-M Huang B-L Qin W-G Huang X Machine learning analysis classifies patients with primary angle-closure Glaucoma using abnormal brain white matter function Clin Ophthalmol 2024 18 659 70 10.2147/OPTH.S451872 38468914 PMC10926922 81. Shu Y Huang Y Chen J Chen L Cai G Guo Y Effects of primary angle-closure glaucoma on interhemispheric functional connectivity Front Neurosci 2023 17 1053114 10.3389/fnins.2023.1053114 36845423 PMC9947534 82. Wan Y Li S Gao Y Tang L Cao W Sun X COL11A1 polymorphisms are associated with primary angle-closure Glaucoma severity J Ophthalmol 2019 2019 1 7 10.1155/2019/2604386 30809385 PMC6369458 83. Wang S Zhang G Lu H Genetic associations in CHAT and COL11A1 with primary angle-closure glaucoma susceptibility: a systematic review and meta-analysis Indian J Ophthalmol 2023 71 343 9 10.4103/ijo.IJO_1226_22 36727317 PMC10228949 84. Bauer PM Hanson JL Pierson RK Davidson RJ Pollak SD Cerebellar volume and cognitive functioning in children who experienced early deprivation Biol Psychiatry 2009 66 1100 6 10.1016/j.biopsych.2009.06.014 19660739 PMC2878609 85. Dijkstra BW Bekkers EMJ Gilat M De Rond V Hardwick RM Nieuwboer A Functional neuroimaging of human postural control: a systematic review with meta-analysis Neurosci Biobehav Rev 2020 115 351 62 10.1016/j.neubiorev.2020.04.028 32407735 86. Terburg D Van Honk J Schutter DJLG Doubling down on dual systems: a cerebellum–amygdala route towards action- and outcome-based social and affective behavior Cortex 2024 173 175 86 10.1016/j.cortex.2024.02.002 38417390 87. Tiemeier H Lenroot RK Greenstein DK Tran L Pierson R Giedd JN Cerebellum development during childhood and adolescence: a longitudinal morphometric MRI study NeuroImage 2010 49 63 70 10.1016/j.neuroimage.2009.08.016 19683586 PMC2775156 88. Fu Q Liu H Zhong YL The predictive values of changes in local and remote brain functional connectivity in primary angle-closure Glaucoma patients according to support vector machine analysis Front Hum Neurosci 2022 16 910669 10.3389/fnhum.2022.910669 35664342 PMC9160336 89. Shamseldin Shalaby W Reddy R Razeghinejad R Katz LJ Contemporary approach to narrow angles J Ophthalmic Vis Res 2024 19 88 108 10.18502/jovr.v19i1.15443 38638634 PMC11022020 90. Chen Y Wang Y Chen L Ouyang F Yin M Lv L Altered resting-state Amygdalar functional connectivity in primary angle-closure Glaucoma patients J Integr Neurosci 2024 23 75 10.31083/j.jin2304075 38682218 91. Lawrenson C Bares M Kamondi A Kovács A Lumb B Apps R The mystery of the cerebellum: clues from experimental and clinical observations Cerebellum Ataxias 2018 5 8 10.1186/s40673-018-0087-9 29610671 PMC5877388 92. Kishore A Popa T Cerebellum in levodopa-induced Dyskinesias: the unusual suspect in the motor network Front Neurol 2014 5 157 10.3389/fneur.2014.00157 25183959 PMC4135237 93. Bonnici HM Richter FR Yazar Y Simons JS Multimodal feature integration in the angular gyrus during episodic and semantic retrieval J Neurosci 2016 36 5462 71 10.1523/JNEUROSCI.4310-15.2016 27194327 PMC4871983 94. Rockland KS Graves WW The angular gyrus: a special issue on its complex anatomy and function Brain Struct Funct 2023 228 1 5 10.1007/s00429-022-02596-6 36369274 95. Price AR Bonner MF Peelle JE Grossman M Converging evidence for the neuroanatomic basis of combinatorial semantics in the angular gyrus J Neurosci 2015 35 3276 84 10.1523/JNEUROSCI.3446-14.2015 25698762 PMC4331639 96. Ramanan S Bellana B A domain-general role for the angular gyrus in retrieving internal representations of the external world J Neurosci 2019 39 2978 80 10.1523/JNEUROSCI.3231-18.2019 30996013 PMC6468096 97. Bonner MF Peelle JE Cook PA Grossman M Heteromodal conceptual processing in the angular gyrus NeuroImage 2013 71 175 86 10.1016/j.neuroimage.2013.01.006 23333416 PMC3594130 98. Kuhnke P Chapman CA Cheung VKM Turker S Graessner A Martin S The role of the angular gyrus in semantic cognition: a synthesis of five functional neuroimaging studies Brain Struct Funct 2023 228 273 91 10.1007/s00429-022-02493-y 35476027 PMC9813249 99. Andin J Elwér Å Mäki-Torkko E Arithmetic in the signing brain: differences and similarities in arithmetic processing between deaf signers and hearing non-signers J Neurosci Res 2023 101 172 95 10.1002/jnr.25138 36259315 PMC9828253 100. Song Y Wang C Cai H Chen J Liu S Zhu J Functional hierarchy of the angular gyrus and its underlying genetic architecture Hum Brain Mapp 2023 44 2815 28 10.1002/hbm.26247 36852603 PMC10089092 101. Cai F Gao L Gong H Jiang F Pei C Zhang X Network centrality of resting-state fMRI in primary angle-closure glaucoma before and after surgery PLoS One 2015 10 e0141389 10.1371/journal.pone.0141389 26506229 PMC4624709 102. Li D-J Huang B-L Peng Y Liang L-Y Liu H Altered dynamic functional connectivity in the primary visual cortex in patients with primary angle-closure glaucoma Front Neurosci 2023 17 1131247 10.3389/fnins.2023.1131247 36816121 PMC9932926 103. Yang L Xiao A Li Q-Y Zhong H-F Su T Shi W-Q Hyperintensities of middle frontal gyrus in patients with diabetic optic neuropathy: a dynamic amplitude of low-frequency fluctuation study Aging (Albany NY) 2022 14 1336 50 10.18632/aging.203877 35120020 PMC8876911 104. Chen W Zhang L Xu Y-G Zhu K Luo M Primary angle-closure glaucomas disturb regional spontaneous brain activity in the visual pathway: an fMRI study Neuropsychiatr Dis Treat 2017 13 1409 17 10.2147/NDT.S134258 28579788 PMC5449125 105. Fan N Zhao B Liu L Yang W Chen X Lu Z Dynamic and static amplitude of low-frequency fluctuation is a potential biomarker for predicting prognosis of degenerative cervical myelopathy patients: a preliminary resting-state fMRI study Front Neurol 2022 13 829714 10.3389/fneur.2022.829714 35444605 PMC9013796 106. Leone DP Heavner WE Ferenczi EA Dobreva G Huguenard JR Grosschedl R Satb2 regulates the differentiation of both callosal and subcerebral projection neurons in the developing cerebral cortex Cereb Cortex 2015 25 3406 19 10.1093/cercor/bhu156 25037921 PMC4585495 107. Stanton-Turcotte D Hsu K Moore SA Yamada M Fawcett JP Iulianella A Mllt11 regulates migration and neurite outgrowth of cortical projection neurons during development J Neurosci 2022 42 3931 48 10.1523/JNEUROSCI.0124-22.2022 35379703 PMC9097781 108. Greig LC Woodworth MB Galazo MJ Padmanabhan H Macklis JD Molecular logic of neocortical projection neuron specification, development and diversity Nat Rev Neurosci 2013 14 755 69 10.1038/nrn3586 24105342 PMC3876965 109. Gerdts J Brace EJ Sasaki Y DiAntonio A Milbrandt J SARM1 activation triggers axon degeneration locally via NAD + Science 2015 348 453 7 10.1126/science.1258366 25908823 PMC4513950 110. Ho W-L Leung Y Tsang AW-T So K-F Chiu K Chang RC-C Tauopathy in the retina and optic nerve: does it shadow pathological changes in the brain? Mol Vis 2012 18 2700 10 23170062 PMC3501278 111. Liu M Hu F Lei C Fu M Li X Yu L Candidate genes identification and RNA-seq based pathway analysis associated with primary angle-closure glaucoma with cataract BMC Ophthalmol 2023 23 192 10.1186/s12886-023-02950-0 37131205 PMC10152770 112. Tang J Sun M Feng Y Prokosch V Cui H Liu H Cytokine profiling in aqueous humor of glaucoma patients and in retinas from an ex vivo glaucoma animal model Front Biosci (Landmark Ed) 2024 29 29 10.31083/j.fbl2901029 38287812 113. Davis MJ Hanson KA Clark F Fink JL Zhang F Kasukawa T Differential use of signal peptides and membrane domains is a common occurrence in the protein output of transcriptional units PLoS Genet 2006 2 e46 10.1371/journal.pgen.0020046 16683029 PMC1449889 114. Leonard TA Loose M Martens S The membrane surface as a platform that organizes cellular and biochemical processes Dev Cell 2023 58 1315 32 10.1016/j.devcel.2023.06.001 37419118 115. Srivatsav AT Kapoor S The emerging world of membrane vesicles: functional relevance, theranostic avenues and tools for investigating membrane function Front Mol Biosci 2021 8 640355 10.3389/fmolb.2021.640355 33968983 PMC8101706 116. Kondkar AA Updates on genes and genetic mechanisms implicated in primary angle-closure glaucoma Appl Clin Genet 2021 14 89 112 10.2147/TACG.S274884 33727852 PMC7955727 117. Chang D Sha Q Zhang X Liu P Rong S Han T The evaluation of the oxidative stress parameters in patients with primary angle-closure glaucoma PLoS One 2011 6 e27218 10.1371/journal.pone.0027218 22096540 PMC3214032 118. Molnár Z Kwan KY Development and evolution of thalamocortical connectivity Cold Spring Harb Perspect Biol 2024 16 a041503 10.1101/cshperspect.a041503 38167425 PMC10759993 119. Huerga-Gómez I Martini FJ López-Bendito G Building thalamic neuronal networks during mouse development Front Neural Circuits 2023 17 1098913 10.3389/fncir.2023.1098913 36817644 PMC9936079 120. Huh CYL Abdelaal K Salinas KJ Gu D Zeitoun J Figueroa Velez DX Long-term monocular deprivation during juvenile critical period disrupts binocular integration in mouse visual thalamus J Neurosci 2020 40 585 604 10.1523/JNEUROSCI.1626-19.2019 31767678 PMC6961993 121. Chakraborty S Sarma J Roy SS Mitra S Bagchi S Das S Post-GWAS functional analyses of CNTNAP5 suggests its role in glaucomatous neurodegeneration bioRxiv 2024 583830 10.1101/2024.03.14.583830 39637236 PMC11651621 122. Saalmann YB Kastner S Gain control in the visual thalamus during perception and cognition Curr Opin Neurobiol 2009 19 408 14 10.1016/j.conb.2009.05.007 19556121 PMC3140205 123. Wang Y Chen L Cai F Gao J Ouyang F Chen Y Altered functional connectivity of the thalamus in primary angle-closure glaucoma patients: a resting-state fMRI study Front Neurol 2022 13 1015758 10.3389/fneur.2022.1015758 36277918 PMC9583913 124. Gautier T Bergès T Tollervey D Hurt E Nucleolar KKE/D repeat proteins Nop56P and Nop58P interact with Nop1p and are required for ribosome biogenesis Mol Cell Biol 1997 17 7088 98 10.1128/MCB.17.12.7088 9372940 PMC232565 125. Dai M Chen S Teng X Chen K Cheng W KRAS as a key oncogene in the clinical precision diagnosis and treatment of pancreatic cancer J Cancer 2022 13 3209 20 10.7150/jca.76695 36118526 PMC9475360 126. Jiang H Yu Y Yan Y KRAS depletion suppresses ferroptosis and affects hippo pathway in cataract Gen Physiol Biophys 2024 43 243 53 10.4149/gpb_2024009 38774924 127. Kaiser CE Van Ert NA Agrawal P Chawla R Yang D Hurley LH Insight into the complexity of the i-motif and G-quadruplex DNA structures formed in the KRAS promoter and subsequent drug-induced gene repression J Am Chem Soc 2017 139 8522 36 10.1021/jacs.7b02046 28570076 PMC5978000 128. Potop V Dragosloveanu CDM Ciocâlteu AM Burcel MG Marinescu MC Dăscălescu DMC The mirror theory: parallels between open angle and angle closure glaucoma Life (Basel) 2024 14 1154 10.3390/life14091154 39337937 PMC11433309 129. Costagliola C Parmeggiani F Semeraro F Sebastiani A Selective serotonin reuptake inhibitors: a review of its effects on intraocular pressure Curr Neuropharmacol 2008 6 293 310 10.2174/157015908787386104 19587851 PMC2701282 130. Bockaert J Claeysen S Compan V Dumuis A 5-HT4 receptors: history, molecular pharmacology and brain functions Neuropharmacology 2008 55 922 31 10.1016/j.neuropharm.2008.05.013 18603269 131. Roux CM Leger M Freret T Memory disorders related to hippocampal function: the interest of 5-HT4Rs targeting Int J Mol Sci 2021 22 12082 10.3390/ijms222112082 34769511 PMC8584667 132. Hu N-W Nicoll AJ Zhang D Mably AJ O’Malley T Purro SA Mglu5 receptors and cellular prion protein mediate amyloid-β-facilitated synaptic long-term depression in vivo Nat Commun 2014 5 3374 10.1038/ncomms4374 24594908 PMC4354159 133. Tebano MT Martire A Rebola N Pepponi R Domenici MR Grò MC Adenosine A 2A J Neurochem 2005 95 1188 200 10.1111/j.1471-4159.2005.03455.x 16271052 134. Dai J Fu Y Zeng Y Li S Qin Yin Z Improved retinal function in RCS rats after suppressing the over-activation of mGluR5 Sci Rep 2017 7 3546 10.1038/s41598-017-03702-z 28615682 PMC5471183 ",
  "metadata": {
    "Title of this paper": "Improved retinal function in RCS rats after suppressing the over-activation of mGluR5",
    "Journal it was published in:": "Frontiers in Medicine",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12484070/"
  }
}