{
  "title": "Paper_638",
  "abstract": "pmc J Clin Med J Clin Med 2745 jclinmed jcm Journal of Clinical Medicine 2077-0383 Multidisciplinary Digital Publishing Institute  (MDPI) PMC12470539 PMC12470539.1 12470539 12470539 41010651 10.3390/jcm14186447 jcm-14-06447 1 Article Skin Cancers in People Living with Human Immunodeficiency Virus (HIV) Infection https://orcid.org/0000-0001-8363-0195 Ciccarese Giulia 1 * Cecchino Liberato Roberto 2 Lembo Fedele 2 Ferrara Sergio 3 Grillo Chiara 3 Pizzulli Cristina 4 Di Tullio Piergiorgio 5 Romita Paolo 6 Foti Caterina 6 Sanguedolce Francesca 4 Parisi Domenico 2 Drago Francesco 7 Portincasa Aurelio 2 https://orcid.org/0000-0002-4729-7548 Lo Caputo Sergio 3 Katoulis Alexander C. Academic Editor 1 2 liberato.cecchino@unifg.it fedele.lembo@unifg.it domenico.parisi@unifg.it aurelio.portincasa@unifg.it 3 sergio.ferrara@ospedaliriunitifoggia.it chiaragrillo.infettivi@gmail.com sergio.locaputo@unifg.it 4 cristina.pizzulli@unifg.it francesca.sanguedolce@unifg.it 5 pgfg@libero.it 6 paolo.romita@uniba.it caterina.foti@uniba.it 7 francescodrago007@gmail.com * giulia.ciccarese@unifg.it 12 9 2025 9 2025 14 18 497642 6447 16 8 2025 09 9 2025 11 9 2025 12 09 2025 27 09 2025 29 09 2025 © 2025 by the authors. 2025 https://creativecommons.org/licenses/by/4.0/ Licensee MDPI, Basel, Switzerland. This article is an open access article distributed under the terms and conditions of the Creative Commons Attribution (CC BY) license ( https://creativecommons.org/licenses/by/4.0/ Background/Objectives: Methods Results: Conclusions human immunodeficiency virus infection (HIV) skin cancer skin malignancy people living with HIV This research received no external funding. pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement no pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes 1. Introduction 1.1. Pathogenic Mechanisms of Immunosuppression Immunosuppression can result from primary inherited disorders [ 1 2 2 3 4 5 Both branches of the immune system, innate and adaptive, are responsible for identifying and removing neoplastic cells and microbial agents. As part of the innate immune system, macrophages and natural killer (NK) cells can phagocytize cellular debris, cancer cells, and microbes. More specifically, NK cells bind to cancer cells and virus-infected cells, which are characterized by the loss or alteration of their self-markers, resulting in the presentation of these altered self-markers to the major histocompatibility complexes (MHCs) [ 6 7 6 7 6 2 3 4 5 8 1.2. Drug-Induced Immunosuppression Regarding the iatrogenic causes of immunosuppression, immunosuppressive drugs work by depleting T lymphocytes, which is essential in organ transplant recipients (OTRs) to lower acute rejection rates and improve graft survival. At the same time, these drugs reduce immune surveillance, allowing abnormal cells to survive and grow. Among OTRs, the risk of cancer is 2 to 5 times higher compared to the general population, with skin cancers being the most common malignancies in these patients [ 5 9 10 11 In addition, several anti-cancer treatments have immunosuppressive effects and may cause, among their adverse events, skin cancers. The increased risk of skin cancers is linked to classic immunosuppressants such as methotrexate (MTX), chemotherapeutic agents like fludarabine and hydroxyurea (HU), targeted therapies such as ibrutinib and Janus Kinase inhibitors (JAKi), mitogen-activated protein kinase pathway (MAPKP) inhibitors, sonic hedgehog pathway (SHHP) inhibitors, and radiotherapy. The oncogenic mechanisms are diverse [ 12 12 1.3. Ultraviolet-Induced Immunosuppression Beyond medications, ultraviolet radiation (UV) is a key environmental risk factor for skin cancer in OTR. UV damage results from the production of reactive oxygen species (ROS), causing ‘oxidative stress,’ which is an imbalance between these highly reactive molecules and the body’s ability to detoxify them. ROS production leads to skin inflammation and immunosuppression, processes that promote skin cancer either independently or through their connection. These events affect more than just the skin, as UV-damaged biomolecules can enter the bloodstream, causing systemic oxidative stress and inflammation [ 13 13 1.4. HIV-Induced Immunosuppression Regarding infectious conditions that lead to immunosuppression, HIV infection is the primary cause. Before significant depletion of CD4+ T cells, HIV can cause impairments in various CD4+ T cell functions, including T-cell colony formation, autologous mixed lymphocyte reactions, expression of interleukin-2 (IL-2) receptors, and IL-2 production [ 14 15 14 15 16 Beyond its known impact on quality of life, mood, and sexual function of the affected patients, as described in other chronic STIs [ 17 18 1.5. The Risk of Cancers in People Living with HIV (PLWH) Traditionally, malignancies in people living with HIV (PLWH) are classified as AIDS-defining and non-AIDS-defining cancers [ 19 19 20 21 19 20 21 Except for these three tumors, all other cancers occurring in PLWH are considered non-AIDS-defining and include HIV-associated tumors and incidental cancers. HIV-associated cancers are types of cancers that are more likely to occur in PLWH than in HIV-uninfected people (HUPs): Hodgkin lymphoma and cancers of the liver, lung, mouth, throat, and anus. Beyond HIV infection, other factors such as older age, heavy alcohol or tobacco use, and infection with other viruses—such as human papillomavirus (HPV), Epstein–Barr virus (EBV), and hepatitis B or C viruses—may increase the risk of developing these tumors [ 22 23 24 25 26 26 18 24 27 The advent of combination antiretroviral therapy (cART), which includes several drugs from different antiretroviral classes, since the mid-1990s, marked a major turning point in HIV/AIDS treatment, leading to significant reductions in HIV-related illness and death. cART is defined as two or more nucleoside reverse transcriptase inhibitors (NRTIs) combined with at least one protease inhibitor, one non-nucleoside reverse transcriptase inhibitor (NNRTI), or an abacavir-containing regimen of three NRTIs [ 21 25 26 27 28 29 30 31 19 Regarding skin cancer incidence in PLWH, especially after the advent of cART, conflicting data are present in the literature [ 29 30 31 Therefore, the rationale of the present study was to evaluate the risk of skin cancer in a specific category of immunosuppressed subjects, specifically those with PLWH. More specifically, the present study aimed to assess the incidence of cutaneous malignancies in a cohort of PLWH accessing a tertiary hospital in southern Italy (the case group) compared with the incidence of skin cancers in the general population (the control group). Secondary aims included evaluating the potential association between these cancers and immunological parameters, as well as HIV RNA load in plasma and CD4+ T cell count in blood. 2. Materials and Methods This study is based on a retrospective analysis of a prospectively collected database. Between 1 April 2023, and 1 April 2025, patients aged 18 years or older who consecutively visited the HIV outpatient clinic of the Infectious Disease Unit at the Policlinico of Foggia, Italy, were invited for a dermatologic visit to screen for skin cancer. Both patients with a new, recent HIV diagnosis and those with an existing HIV infection undergoing cART treatment were included (cases). A dermatologic examination was performed on the same day as the routine HIV visit at the Dermatology Unit of the same hospital. A trained dermatologist assessed the presence of skin lesions through a thorough, full-body examination supported by a handheld dermoscope (DL5 dermoscope [DermLite, Aliso Viejo, CA, USA]). During the same study period, patients visiting the Dermatology Unit for any reason were invited to undergo a comprehensive full-body skin examination for cancer screening by the same dermatologist. They were also offered a rapid HIV screening test after signing a written informed consent form. The test used was the DetermineTM HIV Early Detect test (Abbott Rapid Diagnostics S.r.l., Sesto San Giovanni, Milano, Italy), which is the first and only World Health Organization (WHO)-prequalified fourth-generation rapid diagnostic test. It detects the HIV-1 p24 antigen using finger-prick blood samples with a sensitivity of 95%. The wait time for results was 20 min [ 32 All suspicious skin lesions, in both groups (cases and controls), were surgically excised in the Plastic Surgery University Unit (Policlinico of Foggia, Foggia, Italy) and evaluated by a trained dermatopathologist of the same Hospital. A dermatologic consultation has been performed after the delivery of the histological results of the surgically excised lesions. All patients who tested positive for skin cancers were discussed in the interdisciplinary team to plan any further surgical approach (when indicated), due to the aggressive behavior of some of these skin cancers [ 33 33 Demographic and clinical data, including the intake of photosensitizing drugs, as well as histopathologic analysis, were collected for both patient groups in an Excel database. For PLWH, the clinical history of HIV infection and laboratory data (CD4+ T cell blood count and HIV RNA load in plasma) were also collected. From both clinical and laboratory perspectives, the definition of an undetectable viral load has evolved. Today, it is most commonly understood as an HIV RNA viral load in plasma of <20 copies/mL, measured by the nucleic acid amplification technology PCR [ 34 Categorical variables were presented as absolute numbers and percentages, while continuous variables were shown as means and standard deviations (SD). The characteristics of patients with and without HIV infection were compared using a chi-square test for categorical variables to evaluate potential associations with skin cancers. Categorical variables were compared with Fisher’s exact test, and continuous variables with the Mann–Whitney U test. The primary outcome results were reported as odds ratios (OR) with 95% confidence intervals (CI). A p The study was conducted following the Declaration of Helsinki and was approved by the Institutional Review Board of OSPEDALI RIUNITI DI FOGGIA (protocol code 104/C.E./2020, dated 30 September 2020). 3. Results During the study period, 91 PLWH (cases) and 91 HUPs (controls) were recruited. Among the cases, most patients were males (78.8%) with a mean age of 52.3 years (±12.0, range 30–80); among the controls, both sexes were equally represented (49.4% males and 50.6% females) with a mean age similar to that of the cases (49.9 years, ±17.8, range 19–84). In both groups, the majority of patients were over 50 years old. The most common phototypes were II and III; however, among the cases, six patients (6.5%) had a dark phototype (IV–VI) compared to only one control (1.1%). A melanoma family history was found in a minority of patients, while signs of photodamage (pigmented spots, wrinkles) were frequently observed in both groups (49.4% of cases and 52.7% of controls). The use of photosensitizing drugs for more than 5 years and immunosuppressive drugs, both of which can increase skin cancer risk, was recorded equally in cases and controls. The total body nevus count was fewer than 50 in most subjects (84.6% of cases and 86.8% of controls). No statistically significant differences were found in the demographic, clinical and histological features between PLWH and HUPs ( p p Table 1 Precancerous skin conditions, such as actinic keratoses and epithelial dysplasia, were identified at similar rates in cases (11/91 (12%)) and controls (12/91 (13.2%)). The diagnosis of actinic keratoses was made clinically with dermoscopy assistance [ 35 The detection rate of skin cancers was similar between the two groups, as well (7/91 PLWH (7.6%) versus 8/91 HUPs (8.7%), OR 0.86, 0.29–2.49) ( Table 2 When focusing attention solely on PLWH, the diagnosis of the infection had been known for an average of 15.5 years (range 0–44 years), and most patients (89/91) were regularly taking cART. Only 2 of the 91 PLWH did not take cART: one patient because his HIV diagnosis had just been established; the other declined to take cART due to personal concerns about potential adverse effects of the medications. Both men were in the AIDS stage at the time of the dermatologic visit (CD4+ T cell < 200 cells/mm 3 19 The average number of CD4+ T lymphocytes in the blood of PLWH was 748.02 cells/mm 3 Among the PLWH, we compared the features of those diagnosed with skin cancer to those who are not. PLWH with skin cancers were slightly older (average age 53.7 years) compared to PLWH without skin cancers (average age 48.0 years). However, no statistically significant differences were found between PLWH with and without skin cancers regarding sex, age over 50 years, phototype, melanoma family history, photodamage, use of photosensitizing and immunosuppressive drugs, and number of nevi. Considering the CD4+ T cell blood count and HIV viral load in plasma, a CD4+ T cell count < 350 cells/μL and an HIV load > 20 copies/mL were significantly associated with skin cancers (respectively, p p We then analyzed the subjects who developed skin cancers to assess potential differences in tumor number, type, and location between PLWH and HUPs. Analyzing only the subjects with skin cancers (7/91 cases and 8/91 controls), we found that all were males and that the average age was lower in PLWH (53.7 years) compared to HUPs (68.1 years). The number of skin cancers detected in PLWH (11 skin cancers in 7 patients, averaging 1.5 tumors per patient) was higher than in HUPs (9 cancers in 8 patients, averaging 1.1 per patient) ( Table 3 The skin cancers in PLWH did not have a worse prognosis compared to HUPs; specifically, the two cutaneous melanomas in PLWH were both superficial spreading melanomas (one “in situ”—Breslow thickness 0—and the other with a Breslow thickness of 0.1 mm). The two melanomas in HUPs were also superficial spreading melanomas (one “in situ” and the other with a Breslow thickness of 0.4 mm). None of these four melanomas showed histological ulceration. Therefore, the two in situ melanomas were staged as Tis melanomas, while the other two were staged as T1a melanomas (American Joint Committee on Cancer [AJCC], 8th edition [ 36 36 37 In both groups, the most common skin cancer was basal cell carcinoma (BCC), accounting for 3 out of 11 cancers in PLWH and 6 out of 9 in HUPs. Cutaneous melanoma was equally represented among cases (2/11 cancers) and controls (2/9 cancers), while KS was more common in PLWH (2/11 cancers) compared to HUPs (1/9 cancers). Certain skin cancers, such as squamous cell carcinoma (SCC), baso-squamous carcinoma (BSC), and dermatofibrosarcoma protuberans (DFSP), were found only in PLWH. The most common site of skin cancers was the trunk in both groups ( Table 3 Figure 1 Figure 2 Figure 3 Finally, we compared the number of patients diagnosed with precancerous skin lesions and the number of these lesions in both groups. Precancerous skin lesions were found at similar rates in PLWH and HUPs (12% versus 13.2% and 7.6% versus 8.7%). Among the PLWH, 11 patients (10 males, 1 female; average age 65.6 years) were diagnosed with AKs and high-grade epithelial dysplasia; among the HUPs, 12 patients (8 males, 4 females; average age 65.0 years) were diagnosed with AKs. The number of precancerous lesions observed in PLWH (50 lesions in 11 patients, averaging 4.5 lesions per patient) was higher than in HUPs (29 lesions in 12 patients, averaging 2.4 lesions per patient). In PLWH, the precancerous lesions consisted of 49 AKs and 1 high-grade epithelial dysplasia; in HUPs, the 29 precancerous skin lesions were all AKs. 4. Discussion In our study, the demographic and clinical features of patients in both groups were similar regarding age, skin phototype, melanoma family history, photodamage, total number of nevi, use of immunosuppressive and photosensitizing drugs, and prior skin cancer diagnoses ( p 38 39 The gender of PLWH in our series aligns with these data: in the group of cases, most patients were males (78.8%), compared with the control group (males: 49.4%). Notably, we found a similar incidence rate of skin cancers in PLWH and in HUPs (7.6% versus 8.7%). The incidence rate of precancerous skin lesions was also similar (12% versus 13.2%). However, it should be emphasized that in our series, the PLWH diagnosed with skin cancers and/or cutaneous precancerous lesions were unaware of the risk associated with their lesions before the dermatologic consultation; therefore, these conditions would have remained undiagnosed indefinitely if they had not undergone a skin cancer screening. Conversely, HUPs had knowingly requested a dermatological consultation, in some cases with the specific aim of receiving a skin cancer screening. Our study also highlighted the importance of regular cART use; indeed, all patients who did not take cART developed skin cancers (100%), as expected [ 19 21 The increased risk of skin cancers in immunosuppressed people compared to immunocompetent individuals is well established. However, most research on skin cancers in immunosuppressed individuals focuses on organ transplant recipients (OTRs). It is estimated that 30–70% of OTRs develop a skin malignancy, with squamous cell carcinomas (SCCs) being the most common, followed by basal cell carcinomas (BCC), Kaposi’s sarcoma (KS), Merkel cell carcinoma, and melanoma. Specifically, the risk of developing SCC in OTRs is 10- to 250-fold higher than in immunocompetent patients [ 3 5 9 10 11 40 41 42 Unlike studies on OTRs, the medical literature on the risk of skin cancer in PLWH is limited, and the results of existing studies are often conflicting [ 29 30 43 44 45 46 47 48 49 47 Only a few studies have examined the risk of skin cancer in PLWH compared to a control group. A Danish nationwide cohort study found a twofold increased risk of BCC and a fivefold increased risk of SCC in PLWH compared with an age- and sex-matched background cohort (that was not necessarily tested for HIV). Low nadir CD4+ T-cell counts were associated with an increased risk of SCC [ 50 48 46 Other studies have looked at the occurrence of skin cancers in people living with HIV (PLWH), but they did not include a control group. A US study with 4490 participants found that 5.7% of PLWH developed at least one skin cancer [ 44 30 In our study, we collected data on both keratinocytic and non-keratinocytic skin cancers. Despite the small sample size, we agree that PLWH are at a higher risk of SCC compared to HUPs [ 45 48 Table 3 44 According to other studies [ 30 49 Therefore, we can conclude that the skin cancers in our series of PLWH were not solely linked to immune status, unlike the population of OTRs, whose risk of skin cancers correlates with a lower CD4+ T cell count [ 44 30 44 44 Considering only our patients diagnosed with skin cancer, PLWH were significantly younger than HUPs (average ages of 53.7 years versus 68.1 years), highlighting the importance of not overlooking skin cancer screening and starting it earlier in high-risk groups like the immunosuppressed. Several pathogenic mechanisms have been proposed to explain the risk of cutaneous malignancies in PLWH, beyond those already established for the general population. PLWH experience a chronic immunosuppressed state that may not be fully reflected by the CD4+ T count or improved by cART. They undergo ongoing antigenic stimulation by HIV, leading to a state of chronic inflammation and cytokine dysregulation that can contribute to the development of lymphomas and other tumors [ 29 44 49 23 50 51 44 Notably, in our study, we identified two rare skin cancers (BSC and DFSP) in PLWH that have not been reported in other similar population studies [ 30 31 43 44 45 46 29 49 52 53 5. Conclusions In conclusion, our study shows that PLWH develop skin cancers and precancerous skin conditions at rates similar to those of HUPs. This comparable detection rate between cases and controls might seem unexpected. However, it is important to note that PLWH in our study were specifically asked to undergo a skin cancer screening, and before this invitation, they were unaware of the potential presence of precancerous or cancerous skin lesions. Therefore, it is advisable to increase awareness among healthcare workers who treat HIV and among PLWH about skin cancers to prevent late diagnoses and serious outcomes. Notably, PLWH develop skin cancers at a younger age and in greater numbers compared to HUPs. Additionally, they may develop uncommon skin cancers such as BSC and DFSP, which often require a multidisciplinary approach (especially for DFSP) at an expert center. The increased risk of multiple and rare skin cancers in PLWH needs to be properly recognized by both providers and patients. PLWH, especially those with a known history of extensive UVR exposure (both natural and artificial), should receive enhanced medical care along with sun-protective behavioral education. In line with other authors [ 47 47 33 54 Disclaimer/Publisher’s Note: Author Contributions G.C.: conceptualization, methodology, formal analysis, writing—review and editing. L.R.C.: investigation, resources, validation, data curation. F.L.: investigation, resources, data curation, validation. S.F.: formal analysis, methodology, investigation, data curation. C.G.: investigation, data curation, validation, formal analysis. C.P.: methodology, investigation, validation, formal analysis. P.D.T.: methodology, data curation, validation, investigation. P.R.: conceptualization, formal analysis, data curation, methodology. C.F.: conceptualization, investigation, data curation, writing—review and editing. F.S.: formal analysis, investigation, methodology, data curation. D.P.: formal analysis, investigation, data curation, conceptualization. F.D.: data curation, conceptualization, analysis, data interpretation. A.P.: data curation, resources, investigation, writing—review and editing. S.L.C.: investigation, resources, project administration, data curation. All authors have read and agreed to the published version of the manuscript. Institutional Review Board Statement This study was conducted in accordance with the Declaration of Helsinki and approved by the Ethics Committee of OSPEDALI RIUNITI DI FOGGIA (protocol code 104/C.E./2020, dated 30 September 2020). Informed Consent Statement Informed consent was obtained from all subjects involved in this study. Data Availability Statement Data are available on reasonable request from the corresponding author. Conflicts of Interest The authors declare no conflicts of interest. Abbreviations The following abbreviations are used in this manuscript: HIV Human immunodeficiency virus PLWH People living with HIV HUPs HIV-uninfected people BCC Basal cell carcinoma SCC Squamous cell carcinoma BSC Baso-squamous carcinoma DFSP Dermatofibrosarcoma protuberans AK Actinic keratosis References 1. McCusker C. Warrington R. Primary immunodeficiency Allergy Asthma Clin. Immunol. 2011 7 (Suppl. 1) S11 10.1186/1710-1492-7-S1-S11 22165913 PMC3245434 2. Daniels P. Muse M.E. Bebb G. Jaskolka M. Crane J.S. Bermudez R. Evaluation and Treatment of Skin Cancer in Patients with Immunosuppression StatPearls [Internet] StatPearls Publishing Treasure Island, FL, USA 2025 40334036 3. Sachedina D. Gibson F. Xia E. Walia A. Behara L. Fazelpour S. Mullins H. Francis J. Sahni D. Skin cancer in renal transplant recipients: Outcomes from a safety net hospital in Boston Int. J. Dermatol. 2024 63 1048 1055 10.1111/ijd.17061 38328999 4. Ciccarese G. Trave I. Herzum A. Gariazzo L. Cozzani E. Rebora A. Parodi A. Drago F. Dermatological infections in organ transplant recipients: A retrospective study on 222 patients J. Eur. Acad. Dermatol. Venereol. 2019 33 e36 e38 10.1111/jdv.15153 29953681 5. Trave I. Ciccarese G. Gasparini G. Canta R. Serviddio G. Herzum A. Drago F. Parodi A. Skin cancers in solid organ transplant recipients: A retrospective study on 218 patients Transpl. Immunol. 2023 80 101896 10.1016/j.trim.2023.101896 37419374 6. Deo A.S. Shrijana S.U.S. Karun S. Bisaria K. Sarkar K. Participation of T cells in generating immune protection against cancers Pathol. Res. Pract. 2024 262 155534 10.1016/j.prp.2024.155534 39180801 7. de Visser K.E. Coussens L.M. The interplay between innate and adaptive immunity regulates cancer development Cancer Immunol. Immunother. 2005 54 1143 1152 10.1007/s00262-005-0702-5 15889249 PMC11032791 8. Ciccarese G. Drago F. Herzum A. Atzori L. Dattola A. Galluzzo M. Maronese C. Patrizi A. Piraccini B.M. Recalcati S. Anti-Herpes zoster vaccination in patients with dermatologic diseases: A position statement from the Italian SIDeMaST group of sexually transmitted, infectious and tropical diseases Ital. J. Dermatol. Venerol. 2024 159 375 379 10.23736/S2784-8671.24.07895-2 38780911 9. Huo Z. Li C. Xu X. Ge F. Wang R. Wen Y. Peng H. Wu X. Liang H. Peng G. Cancer Risks in Solid Organ Transplant Recipients: Results from a Comprehensive Analysis of 72 Cohort Studies Oncoimmunology 2020 9 1848068 10.1080/2162402X.2020.1848068 33299661 PMC7714465 10. Dillibabu T. Laprise C. Nicolau B. Madathil S. Risk of cancer among adult solid organ transplant recipients in Quebec, Canada: 1997–2016 BMC Cancer 2025 25 1004 10.1186/s12885-025-14349-9 40474109 PMC12142811 11. Mittal A. Colegio O.R. Skin Cancers in Organ Transplant Recipients Am. J. Transplant. 2017 17 2509 2530 10.1111/ajt.14382 28556451 12. Starace M. Rapparini L. Cedirian S. Skin Malignancies Due to Anti-Cancer Therapies Cancers 2024 16 1960 10.3390/cancers16111960 38893081 PMC11171349 13. Karampinis E. Koumaki D. Sgouros D. Nechalioti P.M. Toli O. Pappa G. Papadakis M. Georgopoulou K.E. Schulze-Roussaki A.V. Kouretas D. Non-Melanoma Skin Cancer: Assessing the Systemic Burden of the Disease Cancers 2025 17 703 10.3390/cancers17040703 40002296 PMC11853326 14. Coffin J.M. Hughes S.H. Varmus H.E. Immunopathogenic Mechanisms of HIV Infection Retroviruses Cold Spring Harbor Laboratory Press Cold Spring Harbor, NY, USA 1997 Available online: https://www.ncbi.nlm.nih.gov/books/NBK19451/ (accessed on 1 July 2025) 15. Makgoo L. Mosebi S. Mbita Z. Long noncoding RNAs (lncRNAs) in HIV-mediated carcinogenesis: Role in cell homeostasis, cell survival processes and drug resistance Noncoding RNA Res. 2022 7 184 196 10.1016/j.ncrna.2022.07.003 35991514 PMC9361211 16. Tolomeo M. Cascio A. The Complex Dysregulations of CD4 T Cell Subtypes in HIV Infection Int. J. Mol. Sci. 2024 25 7512 10.3390/ijms25147512 39062756 PMC11276885 17. Ciccarese G. Drago F. Copello F. Bodini G. Rebora A. Parodi A. Study on the impact of sexually transmitted infections on Quality of Life, mood and sexual function Ital. J. Dermatol. Venerol. 2021 156 686 691 10.23736/S2784-8671.20.06796-6 33314893 18. Omar A. Marques N. Crawford N. Cancer and HIV: The Molecular Mechanisms of the Deadly Duo Cancers 2024 16 546 10.3390/cancers16030546 38339297 PMC10854577 19. Yarchoan R. Uldrick T.S. HIV-Associated Cancers and Related Diseases N. Engl. J. Med. 2018 378 1029 1041 10.1056/NEJMra1615896 29539283 PMC6890231 20. National Cancer Institute Dictionary Available online: https://www.cancer.gov/publications/dictionaries/cancer-terms/def/aids-defining-cancer (accessed on 14 August 2025) 21. Vangipuram R. Tyring S.K. AIDS-Associated Malignancies Cancer Treat. Res. 2019 177 1 21 30523619 10.1007/978-3-030-03502-0_1 22. National Cancer Institute Non-AIDS-Defining Cancer Available online: https://www.cancer.gov/publications/dictionaries/cancer-terms/def/non-aids-defining-cancer (accessed on 14 August 2025) 23. Ciccarese G. Drago F. Broccolo F. Pastorino A. Pizzatti L. Atzori L. Pilloni L. Santinelli D. Urbani A. Parodi A. Oncoviruses and melanomas: A retrospective study and literature review J. Med. Virol. 2023 95 e27924 10.1002/jmv.27924 35695214 PMC9796782 24. Bautista J. Lopez-Cortes A. Oncogenic viruses rewire the epigenome in human cancer Front. Cell. Infect. Microbiol. 2025 15 1617198 10.3389/fcimb.2025.1617198 40557320 PMC12185521 25. Spano J.P. Costagliola D. Katlama C. Mounier N. Oksenhendler E. Khayat D. AIDS-related malignancies: State of the art and therapeutic challenges J. Clin. Oncol. 2008 26 4834 4842 10.1200/JCO.2008.16.8252 18591544 26. Mathoma A. Sartorius B. Mahomed S. The Trends and Risk Factors of AIDS- Defining Cancers and Non-AIDS-Defining Cancers in Adults Living with and without HIV: A Narrative Review J. Cancer Epidemiol. 2024 2024 7588928 10.1155/2024/7588928 38549952 PMC10978085 27. Piselli P. Tavelli A. Cimaglia C. Muccini C. Bandera A. Marchetti G.C. Torti C. Mazzotta V. Pipitò L. Caioli A. Cancer incidence in people with HIV in Italy: Comparison of the ICONA COHORT with general population data Int. J. Cancer 2025 157 1142 1153 10.1002/ijc.35493 40437996 PMC12280848 28. Vaccher E. Serraino D. Carbone A. De Paoli P. The evolving scenario of non-AIDS-defining cancers: Challenges and opportunities of care Oncologist 2014 19 860 867 10.1634/theoncologist.2014-0024 24969164 PMC4122480 29. Zhao H. Shu G. Wang S. The risk of non-melanoma skin cancer in HIV-infected patients: New data and meta-analysis Int. J. STD AIDS 2016 27 568 575 10.1177/0956462415586316 25999166 30. Latini A. Alei L. Magri F. Eibenschutz L. Cota C. Dona’ M.G. Cameli N. Cristaudo A. Zaccarelli M. Nonmelanoma skin cancer and melanoma in HIV-1-infected patients AIDS 2020 34 1570 1572 10.1097/QAD.0000000000002600 32675567 31. Anastasia A. Mazzucco W. Pipitò L. Fruscione S. Gaudiano R. Trizzino M. Zarcone M. Cascio A. Malignancies in people living with HIV: A 25-years observational study from a tertiary hospital in Italy J. Infect. Public Health 2025 18 102661 10.1016/j.jiph.2025.102661 39813856 32. Guiraud V. Naizet A. Khan H. Benhafoun G. Hernandez P. Piccin L. Pichon A. Leng A.L. Yousfi L. Gautheret-Dejean A. Fourth-Generation HIV Rapid Tests: Enhanced Sensitivity and Reduced Diagnostic Window for HIV-1 Primary Infection Screening J. Med. Virol. 2024 96 e70044 10.1002/jmv.70044 39487652 PMC11600489 33. Magnoni C. De Santis G. Fraccalvieri M. Bellini P. Portincasa A. Giacomelli L. Papa G. Integra in Scalp Reconstruction After Tumor Excision: Recommendations From a Multidisciplinary Advisory Board J. Craniofac. Surg. 2019 30 2416 2420 10.1097/SCS.0000000000005717 31274819 34. Weld E.D. Limits of Detection and Limits of Infection: Quantitative HIV Measurement in the Era of U = U J. Appl. Lab. Med. 2021 6 324 326 10.1093/jalm/jfaa176 33438739 PMC8935681 35. Kandolf L. Peris K. Malvehy J. Mosterd K. Heppt M.V. Fargnoli M.C. Berking C. Arenberger P. Bylaite-Bučinskiene M. Del Marmol V. European consensus-based interdisciplinary guideline for diagnosis, treatment and prevention of actinic keratoses, epithelial UV-induced dysplasia and field cancerization on behalf of European Association of Dermato-Oncology, European Dermatology Forum, European Academy of Dermatology and Venereology and Union of Medical Specialists (Union Européenne des Médecins Spécialistes) J. Eur. Acad. Dermatol. Venereol. 2024 38 1024 1047 38451047 10.1111/jdv.19897 36. Keung E.Z. Gershenwald J.E. The eighth edition American Joint Committee on Cancer (AJCC) melanoma staging system: Implications for melanoma treatment and care Expert. Rev. Anticancer Ther. 2018 18 775 784 10.1080/14737140.2018.1489246 29923435 PMC7652033 37. Elder D.E. Barnhill R.L. Eguchi M. Elmore J.G. Kerr K.F. Knezevich S. Melanoma in situ and low-risk pT1a melanoma: Need for new diagnostic terminology Clin. Dermatol. 2025 43 315 322 10.1016/j.clindermatol.2024.09.006 39278516 38. Mårdh O. Quinten C. Kuchukhidze G. Seguy N. Dara M. Amato-Gauci A.J. Pharris A. ECDC/WHO HIV Surveillance network HIV among women in the WHO European Region—Epidemiological trends and predictors of late diagnosis, 2009–2018 Euro. Surveill. 2019 24 1900696 10.2807/1560-7917.ES.2019.24.48.1900696 31796153 PMC6891943 39. Regine V. Pugliese L. Ferri M. Santaquilani M. Suligoi B. Aggiornamento Delle Nuove Diagnosi di Infezione da Hiv e Dei Casi di Aids in Italia al 31 Dicembre 2023 Not. Ist. Super. Sanità 2024 37 3 59 40. Crow L.D. Jambusaria-Pahlajani A. Chung C.L. Baran D.A. Lowenstein S.E. Abdelmalek M. Ahmed R.L. Anadkat M.J. Arcasoy S.M. Berg D. Initial skin cancer screening for solid organ transplant recipients in the United States: Delphi method development of expert consensus guidelines Transpl. Int. 2019 32 1268 1276 10.1111/tri.13520 31502728 41. Korzeniowski P. Griffith C. Young P.A. Update on skin cancer prevention modalities and screening protocols in solid organ transplant recipients: A scoping review Arch. Dermatol. Res. 2024 317 52 10.1007/s00403-024-03551-7 39589541 42. Cordaro A. Dobbs T.D. Gibson J.A. Whitaker S. Whitaker I.S. Skin cancer screening in organ transplant centres in the United Kingdom: A national survey Eur. J. Dermatol. 2020 30 372 376 10.1684/ejd.2020.3845 32969798 43. Asgari M.M. Ray G.T. Quesenberry C.P. Jr. Katz K.A. Silverberg M.J. Association of Multiple Primary Skin Cancers With Human Immunodeficiency Virus Infection, CD4 Count, and Viral Load JAMA Dermatol. 2017 153 892 896 10.1001/jamadermatol.2017.1716 28700773 PMC5710423 44. Crum-Cianflone N. Hullsiek K.H. Satter E. Marconi V. Weintrob A. Ganesan A. Barthel R.V. Fraser S. Agan B.K. Cutaneous malignancies among HIV-infected persons Arch. Intern. Med. 2009 169 1130 1138 10.1001/archinternmed.2009.104 19546414 PMC2761839 45. Omland S.H. Ahlström M.G. Gerstoft J. Pedersen G. Mohey R. Pedersen C. Kronborg G. Larsen C.S. Kvinesdal B. Gniadecki R. Risk of skin cancer in patients with HIV: A Danish nationwide cohort study J. Am. Acad. Dermatol. 2018 79 689 695 10.1016/j.jaad.2018.03.024 29588249 46. Luu Y.T. Luo Q. Horner M.J. Shiels M. Engels E.A. Sargen M.R. Risk of Nonkeratinocyte Skin Cancers in People Living with HIV during the Era of Antiretroviral Therapy J. Investig. Dermatol. 2023 143 588 595.e3 10.1016/j.jid.2022.09.008 36216206 PMC10038815 47. Reinhart J.P. Leslie K.S. Skin cancer risk in people living with HIV: A call for action Lancet HIV 2024 11 e60 e62 10.1016/S2352-3018(23)00202-3 37865118 48. Silverberg M.J. Leyden W. Warton E.M. Quesenberry C.P. Jr. Engels E.A. Asgari M.M. HIV infection status, immunodeficiency, and the incidence of non-melanoma skin cancer J. Natl. Cancer Inst. 2013 105 350 360 10.1093/jnci/djs529 23291375 PMC3589255 49. Venanzi Rullo E. Maimone M.G. Fiorica F. Ceccarelli M. Guarneri C. Berretta M. Nunnari G. Non-Melanoma Skin Cancer in People Living with HIV: From Epidemiology to Clinical Management Front. Oncol. 2021 11 689789 10.3389/fonc.2021.689789 34422644 PMC8371466 50. Dervenis V. The Role of HPV in the Development of Cutaneous Squamous Cell Carcinoma-Friend or Foe? Cancers 2025 17 1195 10.3390/cancers17071195 40227794 PMC11988061 51. Smola S. Human Papillomaviruses and Skin Cancer Adv. Exp. Med. Biol. 2020 1268 195 209 32918220 10.1007/978-3-030-46227-7_10 52. Kosche C. Chio M.T.W. Arron S.T. Skin cancer and HIV Clin. Dermatol 2023 in press 10.1016/j.clindermatol.2023.12.006 38142792 53. Sapadin A.N. Gelfand J.M. Howe K.L. Phelps R.G. Grand D. Rudikoff D. Dermatofibrosarcoma protuberans in two patients with acquired immunodeficiency syndrome Cutis 2000 65 85 88 10696559 54. Lin L. Li T.S. Multidisciplinary collaborative integrated management of increasingly prominent HIV complications in the post-cART era HIV. Med. 2020 21 683 691 10.1111/hiv.13022 33369030 PMC7839721 Figure 1 Multiple, concurrent skin cancers in a patient with HIV infection; ( A B C D A E B F C Figure 2 Simultaneous presence of precancerous skin lesions and basal cell carcinoma in the same patient living with HIV; ( A C B D Figure 3 Clinical presentation of cutaneous malignancies in different patients living with HIV infection: ( A B C jcm-14-06447-t001_Table 1 Table 1 Demographic and clinical features of the studied patients. Patient’s Features People Living with HIV (%) HIV Negative Subjects (%) p Overall 91 91  Sex    0.000061 Male 71 (78.8%) 45 (49.4%)  Female 20 (21.2%) 46 (50.6%)  Mean age (range, standard deviation) 52.3 (30–80, ±12.0) 49.9 (19–84, ±17.8)  Age   0.099946 ≤50 34 (37.3%) 45 (49.4%)  ≥50 57 (62.7%) 46 (50.6%)  Phototype    II 46 (50.6%) 41 (45.1%) 0.458108 III 39 (42.9%) 49 (53.8%) 0.137993 IV 4 (4.3%) 1 (1.1%) 0.053949 V-VI 2 (2.2%) 0 (0%) Melanoma family history   0.096795 yes 1 (1.1%) 5 (5.4%)  no 90 (98.9%) 86 (94.6%)  Photodamage   0.656423 yes 45 (49.4%) 48 (52.7%)  no 46 (50.6%) 43 (47.3%)  Photosensitizing drugs >5 years   0.850814 yes 17 (18.7%) 18 (19.8%)  no 74 (81.3%) 73 (80.2%)  Immunosuppressive drugs   0.173685 yes 1 (1.1%) 4 (4.4%)  no 90 (98.9%) 87 (95.6%)  Counting nevi   0.671814 <50 77 (84.6%) 79 (86.8%)  >50 14 (15.4%) 12 (13.2%)  Antiretroviral therapy    yes 89 (97.8%)   no 2 (2.2%)   jcm-14-06447-t002_Table 2 Table 2 Detection rate of precancerous skin lesions and of skin cancers in cases and controls (primary aim of the study).  People Living with HIV (%) HIV Negative Subjects (%) p Detection of precancerous skin lesions (n° of patients)   0.823468 yes 11 (12%) 12 (13.2%)  no 80 (88%) 79 (86.8%)  Detection of skin cancers (n° of patients)   0.78751 yes 7 (7.6%) 8 (8.7%)  no 84 (92.4%) 83 (91.3%)  jcm-14-06447-t003_Table 3 Table 3 Characteristics of subjects with skin cancers: clinical and histological features of cutaneous malignancies in PLWH and HUPs. People Living with HIV (PLWH) with Skin Cancers Patient N° Sex Age N° of Skin Cancers Histologically Confirmed Type of Skin Cancer/Cancers Site of Skin Cancers 1 M 48 1 BCC face 2 M 40 1 DFSP trunk 3 M 75 4 2 MM, 1 BCC, 1 BSC 2 trunk, neck, face 4 M 54 1 KS head 5 M 62 2 2 SCC 2 trunk 6 M 34 1 KS trunk 7 M 63 1 BCC neck Total N°  53.7 11 3 BCC, 2 MM, 2 SCC, 2 KS, 1 BSC, 1 DPFP 6 trunk, 5 head-neck region  HIV Uninfected Subjects (HUPs) with Skin Cancers  Patient N°  Sex  Age  N° of Skin Cancers Histologically Confirmed  Type of Skin Cancer/Cancers  Site of Skin Cancers 1 M 66 1 BCC lower limb 2 M 82 1 BCC upper limb 3 M 76 2 2 BCC head 4 M 65 1 MM trunk 5 M 42 1 MM trunk 6 M 82 1 BCC trunk 7 M 48 1 BCC trunk 8 M 84 1 KS lower limb Total N°  68.1 9 6 BCC, 2 MM, 1 KS 4 trunk, 3 limbs, 1 head ",
  "metadata": {
    "Title of this paper": "Multidisciplinary collaborative integrated management of increasingly prominent HIV complications in the post-cART era",
    "Journal it was published in:": "Journal of Clinical Medicine",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12470539/"
  }
}