{
  "title": "Paper_846",
  "abstract": "pmc Bioengineered Bioengineered 1809 bioengineered Bioengineered 2165-5979 2165-5987 Taylor & Francis PMC12461892 PMC12461892.1 12461892 12461892 40990065 10.1080/21655979.2025.2564563 2564563 1 Version of Record Research Article Research Article Technique for decellularization and characterization of rat esophageal extracellular matrix for potential application as a 3D scaffold V. MATHUR ET AL. BIOENGINEERED Mathur Vidhi  a Investigation Methodology Visualization Writing – original draft Writing – review & editing Joshi Jahnavy Madhukar  a Investigation Resources Writing – original draft N C Sreekumar  b Resources N Seetharam Raviraja  a Supervision Validation https://orcid.org/0000-0003-2115-153X Vasanthan Kirthanashri S  a Conceptualization Supervision Validation a Manipal Academy of Higher Education Manipal India b Manipal Academy of Higher Education Manipal India CONTACT Kirthanashri S Vasanthan kirthanashri.sv@manipal.edu Manipal 576104 India 24 9 2025 2025 16 1 480784 2564563 24 09 2025 26 09 2025 26 09 2025 Integra 24 9 2025 Integra 24 9 2025 09 7 2024 01 7 2025 17 9 2025 © 2025 The Author(s). Published by Informa UK Limited, trading as Taylor & Francis Group. 2025 The Author(s) https://creativecommons.org/licenses/by/4.0/ This is an Open Access article distributed under the terms of the Creative Commons Attribution License ( http://creativecommons.org/licenses/by/4.0/ ABSTRACT Conventional treatment for esophageal defects involves surgical removal of the defect area and implant conduit tissues. There exist morbidities and mortalities associated with the treatment including fistula and leakage leading to compromise in quality of life. The aim of this study was to optimize a method for complete decellularization of rat esophagus and to solubilize the decellularized extracellular matrix (dECM) proteins to evaluate in vitro properties for scaffold fabrication. For decellularization, rat esophagi were decellularized using 3-[(3-cholamidopropyl) dimethylammonio]-1-propanesulfonate (CHAPS) and sodium dodecyl sulfate (SDS) buffers for 6 h and overnight, respectively. Post decellularization, the tissue was characterized for DNA, glycosaminoglycans, and elastin quantification; H&E and Masson’s trichrome staining; scanning electron microscopy; and SDS-PAGE to evaluate the quantity and quality of the obtained dECM. DNA quantification and histological analysis revealed complete decellularization, while the retention of sGAGs and elastin showed the presence of extracellular proteins in the tissue. The SEM analysis revealed proper orientation of the extracellular matrix and significant proteins were retained in the dECM, which will enhance the regenerative potential. The decellularized tissues were biocompatible, exhibited no toxicity and were also soluble, which can be adapted for scaffold fabrication. GRAPHICAL ABSTRACT KEYWORDS Detergent based decellularization histological analysis DNA quantification in vitro studies rat model Science and Engineering Research Board (SERB) ECR/2018/000709 Manipal Academy of Higher Education, Manipal, Karnataka, India the Manipal Centre for Biotherapeutics Research and the Manipal Academy of Higher Education The authors want to acknowledge the Science and Engineering Research Board (Science and Engineering Research Board (SERB) – [ECR/2018/000709], Government of India for the research support, and Dr. TMA Pai scholarship, Manipal Academy of Higher Education, Manipal, Karnataka, India, for the fellowship support to the first author. The authors would like to thank the Manipal Centre for Biotherapeutics Research and the Manipal Academy of Higher Education for their infrastructural and equipment support. pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement yes pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes 1. Introduction Esophagus is a tubular hollow organ that extends from pharynx to stomach and is made up of four layers, mucosa, submucosa, muscularis, and adventitia and majorly functions for the passage for food [ 1 2 3 4 5 Tissue engineering-based alternatives are the key for the repair and regenerative of esophageal defects, where cultured cells and biomaterials are used in combination to regenerate native tissue in vitro 6 7 8 9 in vivo 10 11 12 In this study, we have proposed an effective technique of decellularization for harvesting rat esophagus dECM via two-step process using detergents CHAPS and SDS. CHAPS is a zwitterionic detergent and has the properties of both ionic and nonionic detergents and targets lipid–protein interactions and lipid–lipid interactions [ 13 14 15 To the best of our knowledge decellularized ECM is used as a scaffold as a recellularization purpose that can be implanted in the host organ but very few work as they lack clarity wherein the dECM is dissolved and completely used for scaffold fabrication. Unlike previous approaches, our method of decellularization focuses on refining the balance between effective cell removal and ECM preservation. By introducing and evaluating an improved technique, the study contributes in generating more biologically relevant components that can be utilized for creating scaffolds [ 16 2. Materials and methods 2.1. Materials CHAPS (CAT # 21420), SDS (CAT#85369), phenol, chloroform (CAT #84155), isoamyl alcohol (CAT #69931), isopropanol (CAT # 62986), and papain (CAT # 95907) were purchased from Sisco Research Laboratories, India. Ethylenediamine tetra acetic acid (EDTA) (CAT# Q37395 l C2-BIOC 2.2. Animal ethics approval All the animals used in this study were approved by the Institutional Animal Ethics Committee (IAEC) and the Manipal Academy of Higher Education, Manipal, which is in accordance with CPSCEA guidelines (IAEC/KMC/72/2022). All the experiments involving the animals were performed following ARRIVE guidelines. 2.3. Human ethics approval The adipose tissue was used for isolation of adipose tissue-derived mesenchymal stem cells, and approval from the Institutional Ethics Committee (IEC) of Kasturba Medical College (KMC) was obtained for this study (IEC/842/2021). All the studies involving human samples adhered to the declaration of Helsinki. The tissue ( n 3. Methods 3.1. Preparation of rat esophagi Animals were generated by inhouse breeding, as the facility is having license for inhouse breeding (Central Animal Research Facility 94/PO/RReBi/S/99/CPSCEA, dated 29 April 2022) and housed at the Central Animal Facility. Esophagi were harvested under aseptic conditions from male Wistar rats ( Rattus norvegicus 3.2. Decellularization of rat esophagi For the decellularization process, the rat esophagus was thoroughly cleaned to remove residual tissue and remnants of blood with 1× PBS (pH 7.4). Further, the esophagus was cut into four segments (~1 cm) and suspended in CHAPS buffer (8 mM CHAPS, 1 M NaCl, and 25 mM EDTA in 1× PBS, pH 7) for 6 h at stirring condition (340 rpm) in 2% w/v ratio. Following the treatment, the tissue was washed with 1× PBS and further treated with SDS buffer (1.8 mM SDS, 1 M NaCl, and 25 mM EDTA in 1× PBS, pH 7) and kept overnight at room temperature (24°C) and then further washed once with 1× PBS. This cycle was repeated three times in order to obtain complete decellularized esophagus. 3.3. Histological analysis For histological testing, native and decellularized esophagus samples were fixed for 24 h using 10% formaldehyde and then rehydrated, paraffin embedded, and sectioned with a LEICA RM 2125RT microtome to obtain 3 μm sections. To confirm the absence of genetic material and the presence of ECM proteins, the decellularized samples were stained with Hematoxylin and Eosin (H&E), Masson’s trichrome stain and Alcian blue stain to evaluate the presence of cellular contents, collagen, and glycosaminoglycans, respectively. The stained slides were visualized by using EVOS M5000 microscope, and images were acquired. 3.4. Scanning electron microscopy (SEM) Native esophagi and decellularized tissue samples were fixed in 2.5% glutaraldehyde for 2 h at 4℃and the samples were dehydrated in gradient ethanol from 10% to 100%, with 10 min each in 10–80% and 20 min in 90–100% and then the samples were incubated at 37°C to air dry overnight. The samples were mounted on stubs using carbon coated tape and coated with gold using an ion beam coater (Quorum SC7620 sputter coater 120 s, 10 Pa), and the samples were imaged at 10 kV voltage using Zeiss EVO MA18 SEM, Germany. 3.5. Quantification of DNA content The isolation of genomic DNA was performed using an optimized inhouse protocol with phenol: chloroform: isoamyl alcohol extraction method. About 50 mg of native and decellularized samples was weighed and then homogenized with 1× PBS (pH 7.4) using Scilogex SC16 PRO homogenizer, USA. The samples were centrifuged at 8000 rpm for 10 min and the supernatant was discarded. For the tissue pelleting, lysis buffer, Tris-EDTA buffer, and proteinase K were added with volumes 200 µL, 400 µL and 10 µL, respectively. The samples were vortexed and kept at 55°C until the tissue was completely digested. Post digestion, about 600 µL phenol was added and vortexed for 10 min at 25 rpm, followed by centrifugation at 8000 rpm for 10 min at 4°C. The aqueous layer was pipetted out into a fresh 1.5 mL microcentrifuge tube, and 300 µL phenol and chloroform: isoamyl alcohol (CIA) (24:1; 300 µL) was added, and the samples were vortexed for 10 min at 25 rpm, followed by centrifugation at 8000rpm, for 10 min at 4°C. The aqueous layer was separated via pipetting, and an equal volume of CIA was added, and the samples were vortexed for 30 min at 25 rpm, followed by centrifugation at 8000 rpm, for 10 min at 4°C. The aqueous layer is pipetted out carefully into a fresh microcentrifuge tube that contains 600 µL of chilled isopropanol and 60 µL of sodium acetate and the tube is inverted. The samples were kept in −20°C for half an hour and further centrifuged at 13,000 rpm for 20 min at 4°C. Post centrifugation, the supernatant was removed, and 70% ethanol was added to the pellet and centrifuged at 13,000 rpm for 20 min at 4°C. Ethanol was completely removed from the tube, and the samples were left to air dry overnight at room temperature. The pellet was dissolved in the Tris EDTA buffer, and DNA was quantified by Synergy H1 multi-mode microplate reader, USA, at 260 nm and 280 nm. Absorbance values were normalized to the wet weight of samples, further 1% Agarose gel was prepared for running gel electrophoresis to visualize the presence of DNA in the samples. 3.6. Total protein distribution The extraction of proteins from native and decellularized esophagus tissues was carried out using 1X RIPA and protease inhibitor cocktail to digest the tissue for 30 min. For the quantification of proteins, bicinchoninic acid (BCA) assay was employed following the manufacturer’s protocol, and absorbance was read at 562 nm. Protein concentrations in the samples were calculated in accordance with the standard protein values. SDS-PAGE resolving and stacking gels are prepared with concentration 8% and 6%, respectively. For the sample preparation, 20 μg/mL of protein was mixed with a loading buffer and reducing agent (NuPAGE, Thermo Fisher Scientific) and heated for 5 min at 95°C. The stacking gel was run at 80 V, and the resolving gel was run at 100 V until the samples completely ran out of the gel. The gel was stained with Coomassie blue and was visualized using Invitrogen iBright cl1500 imaging system, USA. 3.7. Quantification of sGAGs and elastin content The sGAGs quantification was performed in native and decellularized samples using Pierce™ - sulfated Glycosaminoglycan (sGAG) assay kit as per manufacture’s protocol and photometric measurements were recorded at 656 nm using Microplate Reader (Biotek, SH1M) and compared with the standards that provided in the kit. Fastin Elastin Assay kit was used according to the instructions provided for quantification of elastin, and photometric measurements were quantified at 513 nm using Microplate Reader (Biotek, SH1M). The standard graph was plotted using the elastin, provided in the kit. 3.8. Cytotoxicity assay 3.8.1. AT-MSC cell culture and characterization The adipose tissue was obtained following liposuction surgery at Kasturba Hospital, Manipal, Karnataka. The tissue was transported to the laboratory and washed with saline and 2% antibiotic/antimycotic solution and centrifuged at 900 rpm for 3 min at 37°C. The adipose tissue from the middle fraction was collected in a different tube. 8 mL collagenase II (1 mg/mL) was added to 20 mL of adipose tissue and kept in rotation for 30 min at room temperature and incubated for 15 min at 37°C. Post incubation, the tube was centrifuged at 1200 rpm for 10 min and the lower stromal vascular fraction was collected, and equal volume of complete media (Dulbecco’s modified Eagle medium (DMEM) low glucose, 10% fetal bovine serum (FBS), 1% glutamine, and 1% penicillin/streptomycin solution was added and centrifuged at 1200 rpm for 10 min at 37°C. The pellet was resuspended in 10 mL complete medium and transferred to T 2 For characterization, trilineage differentiation and surface marker analysis of AT-MSCs was performed according to ISCT criteria [ 17 in vitro To perform immunophenotyping, the surface markers of isolated AT-MSCs were analyzed using flow cytometry to assess the levels of CD45, CD34, CD105, and CD73. Flow cytometer antibodies PE conjugated anti-CD34, anti-CD105, anti-CD73, FITC-conjugated anti-CD45 were used. Isolated cells were washed with 1× PBS, incubated with 5 µL fluorophore-stained primary antibody (0.2 mg/mL) for 30 min, and washed using 1× PBS to remove excess unbound antibodies, and were acquired and analyzed using BD Accuri C6 Plus flow cytometer with standard configuration of 533/30 filter in FL1, 585/40 in FL2, 670 long pass in FL3, and 675/25 in FL4. 3.8.2. Preparation of conditioned culture media for assessing cytotoxicity of decellularized tissues The decellularized tissue was sterilized with 2% antibiotic/antimycotic under agitation at room temperature (24–26℃) for 72 h followed by washing in PBS for 72 h under agitation. Post sterilization, decellularized tissue was incubated with AT-MSC cell proliferation media (100 mg tissue per milliliter) for 72 h at 37°C, 5% CO 2 3.8.3. Cell viability assay To analyze the cell viability, three groups were considered: decellularized tissue conditioned media and AT-MSC cultured in DMSO:DMEM (1:1) was the positive control, while AT-MSC cultured in DMEM were negative control (untreated cells). The cell viability of decellularized esophageal tissues was assessed for 72 h using conditioned media for the culture of AT-MSC. After incubating for 72 h, without any media change, MTT assay was performed to determine the cell viability. In all the groups, the media was removed and 500 μL of 0.5 mg/mL MTT was added and incubated for 2.5 h and then the formazan crystals were dissolved in 500 μL DMSO for 15 min in shaking conditions. The optical density was measured at 570 nm by a multimode plate reader. Results were expressed as a percentage of cell viability in treated samples versus untreated cells (100% viability). 3.9. Solubilization of decellularized tissue The decellularized tissue is lyophilized and then further crushed into smaller pieces and is treated with 0.5 M acetic acid containing pepsin (10%w/w) for 72 h at 350 rpm. Pre-solubilization, the pH was 1–1.5, and post-solubilization the pH was neutralized to 7.2–7.5 by adding 10 M NaOH solution. To assess the protein retention post-solubilization, 1%–2% of solubilized dECM was used for SDS-PAGE and BCA assay. For the quantification of proteins, ELISA-based BCA assay following the manufacturer’s protocol and absorbance was observed at 562 nm. Protein concentrations in the samples were calculated in accordance with the standard protein values. SDS-PAGE resolving and stacking gels are prepared with concentrations of 10% and 4%, respectively. For the sample preparation, 20 μg/mL of protein was mixed with a loading buffer and reduction agent (NuPAGE, Thermo Fisher Scientific). Protein samples are heated for 5 min at 95°C. The stacking gel was run at 80 V, and the resolving gel was run at 100 V until the samples were completely run out of the gel. The gel was stained with Coomassie blue and was visualized using Invitrogen iBright cl1500 imaging system, USA. 3.10. Statistical analysis All statistical analyses were performed with the aid of GraphPad Prism version 9.5.1 [ 18 p 4. Results 4.1. Decellularization of rat esophagus The dissected rat esophagus obtained from the male Wistar rat was cleaned with PBS and cut into segments of 1 cm for the decellularization process. The esophagus was decellularized via chemical treatment using CHAPS and SDS for complete removal of cellular content. The macroscopic observation demonstrated the change in tissue color from red (native) to translucent (decellularized) as shown in Figure 1 Figure 1. Decellularized rat esophagus post treatment. The weight of rat esophagus was noted before and after decellularization, and it was observed that there was an increase in wet weight in decellularized tissue. The weight of native and decellularized tissue was noted as 0.278 ± 0.014 g and 0.391 ± 0.027 g, respectively ( Figure 2 Figure 2. The weight change observed in native and decellularized tissue of rat esophagus. ( p 4.2. Scanning electron microscopy To determine the architectural changes in the tissue post decellularization, SEM images were recorded in both native and decellularized. It was observed that the micro architecture of decellularized tissue contains numerous pores as compared to native tissue, as presented in Figure 3 Figure 3. Scanning electron micrographs (A–C) native rat esophagus at magnification 500×, 1000×, and 2000× (D,E) decellularized rat esophagus at magnification 500×, 1000×, and 2000×. 4.3. Histological analysis The removal of cellular content and preservation of native ECM structure was assessed by Hematoxylin and Eosin (H&E) staining, which showed the absence of violet stained (hematoxylin) nuclear content in the decellularized esophagus. The appearance of the pink color suggests an eosin-stained extracellular matrix. Alcian Blue (AB) and Masson’s trichrome (MT) staining revealed the presence and retention of glycosaminoglycans and collagen, respectively, the prominent ECM proteins of the esophagus ( Figure 4 Figure 4. Histological analysis of native and decellularized esophagus using various stain. 4.4. DNA quantification The absence of cellular content in the decellularized tissue was confirmed by DNA quantification as shown in Figure 5 Figure 5. DNA quantification and agarose gel electrophoresis (**** p 4.5. Total protein distribution SDS-PAGE was performed to determine the protein distribution and retention by the decellularized esophagus tissue. Figure 6 Figure 6. SDS-PAGE to determine the protein distribution in native and decellularized esophagus tissue. 4.6. Sulphated glycosaminoglycans (sGAGs) and elastin quantification The sGAGs content was retained significantly in native and decellularized tissue. The sGAGs content in native 10.73 ± 0.232 µg/mg of wet tissue and decellularized tissue had 7.587 ± 0.022 µg/mg of wet tissue. The values are expressed as mean ± SD, with a sample size of 05 in each group ( Figure 7(A) Figure 7. Quantification of A- sGAGs; B- Elastin in native and decellularized esophagus (** p p The elastin content in decellularized esophagus tissue was significantly reduced in comparison to native esophagus tissue. The elastin content in native and decellularized tissue were 115.034 ± 1.804 µg/mg of wet tissue and 31.59 ± 2.73 µg/mg of wet tissue, respectively. The values are expressed as mean ± SD, with a sample size of 05 in each group ( Figure 7(B) 4.7. AT-MSC characterization Isolated AT-MSCs were characterized according to ISCT Criteria by performing trilineage differentiation and immunophenotyping. The AT-MSCs underwent adipogenic, osteogenic and chondrogenic differentiation pertaining to ISCT guidelines. CD34 and CD45 showed less than 5% expression, which are the negative markers. CD105 and CD73 are positive markers which showed more than 95% expression, which fulfilled the ISCT criteria ( Figure 8 Figure 8. Characterization of AT-MSCs. (A) Staining images of trilineage differentiation by oil red o (adipogenic), alizarin red (osteogenic) and Alcian blue (chondrogenic) of control and differentiated cells; (B) immunophenotyping of AT-MSCs at passage 6. 4.8. Cytotoxicity assay After 72 h of exposure period to conditioned media, AT-MSC appeared to be viable and proliferating, reaching about 90% of confluency. The MTT assay revealed that, cells preserved 89% viability when treated with a medium conditioned with decellularized esophageal matrices when compared to untreated cultures. Significant difference (p < 0.0001) was observed between cytotoxic control and dECM groups, suggesting that cell cultures respond appropriately in comparison with the positive control ( Figure 9 Figure 9. Cytocompatibility study (** p p 4.9. Solubilization and protein retention SDS-PAGE was performed to determine the protein distribution and retention by the solubilized dECM. Figure 10 Figure 10. SDS-PAGE to determine the protein retention in solubilised dECM. 5. Discussion The human esophagus lacks the ability to regenerate and various conventional methods used to treat the esophageal defect includes gastric pull up, primary closure, colon interposition which leads to complications and involves high failure risk and fatal morbidities and mortalities [ 19 20 21 22 23 24 In this study, we aim to provide an efficient method for decellularizing the rat esophagus to obtain cell-free liquid dECM containing the protein. Decellularization can be achieved by chemical, enzymatic, and physical methods, and herein we have optimized the use of CHAPS, a zwitterionic detergent, which helps in targeting lipid interactions of tissue and solubilizes the membranes, and SDS, denatures the proteins and helps in solubilizing the membranes, as potent agents for the removal of cells from the esophagus. The role of detergents should also protect ECM proteins from damage and remove genetic material, thus making the dECM compatible. In the present study, we have obtained translucent tissue post decellularization ( Figure 1 Figure 2 25 As observed under SEM, the decellularized tissue showed significant presence of pores with rough architecture at various locations when compared to the native tissue due to the action of detergents that helps in cellular proliferation ( Figure 3 Figure 4(A) Figure 4(B) Figure 4(D) Figure 4(C) The presence of collagen is demonstrated by Masson’s trichrome stain and appearance of blue color in Figure 4(F) DNA quantification showed significant removal of resident cells of esophagus in decellularized tissue compared to native esophagus. About 97% reduction in DNA content proves the efficacy of the technique and the absence of DNA band in Figure 5 The SDS-PAGE analysis of the protein profiles of native and decellularized rat esophagus demonstrates the effectiveness of the decellularization process, depicted in Figure 6 in vivo sGAGs are family of linear and negatively charged polysaccharides that surround most cell types. In esophagus, the inner lining of mucosal squamous epithelium is glycoprotein rich and it also expresses a variety of keratin intermediate filament proteins that helps in providing structural integrity between the cells. The amount of sGAG in native and decellularized tissue was significantly similar, suggesting their retention post treatment. Thus, the chemical method of decellularization did not affect the sGAG content on the decellularized tissue. Though, there is an elastin decrease in dECM as compared to native tissue, the presence of these proteins will also contribute to cell proliferation and adherence. AT-MSCs were selected for the cytotoxicity assay due to their ability to differentiate into epithelial cells [ 26 27 28 17 Figure 8(A) Figure 8(B) 29 Figure 9 30 SDS-PAGE was performed with different concentrations of solubilized decellularized tissue, confirming the retention of key ECM proteins such as collagen, laminin, fibronectin, and glycoprotein. Collagen bands range from 250 kDa to 150 kDa whereas sGAGs are seen around 75 kDa to 110 kDa. These proteins play essential roles in cell adhesion, proliferation, and tissue remodeling, making their preservation critical for scaffold functionality. The presence of major bands across different concentrations of solubilized dECM indicates effective retention of these ECM components post-solubilization. The band intensity decreased as the dECM concentration was reduced from 2% to 1%, reflecting lower protein content at lower concentrations ( Figure 10 The study underscores the significance of optimizing the decellularization technique to effectively remove the cellular components and preserve the essential ECM components. Our method ensures retention of ECM proteins, structural integrity, and biocompatibility. The solubilized dECM demonstrates versatility as a bioink, offering immense potential for fabricating 3D bioprinted scaffolds for esophageal regeneration. 6. Conclusion Decellularization technique differs from species, organ and tissue to suit the application, the selection of cocktail of decellularizing agent is critical to obtain dECM. The ideal conditions for decellularization also retain the prominent proteins and to remove the genetic material to ensure the dECM is non-immunogenic and biocompatible. These resident ECM proteins contribute to regenerative and proliferative capability by providing biochemical cues to the cells. Hence, it is crucial to retain these proteins and maintain the function. Here, we have obtained dECM by using detergent-based method which utilizes CHAPS and SDS to completely remove the cellular content, that satisfies the condition of being non-immunogenic and that can be biocompatible, the option of application of the dECM as scaffold material is innumerable and can be expanded to their use as bioinks for 3D bioprinting or any other typer of scaffold fabrication. Supplementary Material A02_UNSTAINED.fcs A03_CD34.fcs A07_CD73.fcs A04_CD45.fcs A06_CD105.fcs Acknowledgment The authors want to acknowledge Science and Engineering ResearchBoard (SERB- ECR/2018/000709), Government of India for research support and Dr. TMA Pai scholarship, Manipal Academy of Higher Education, Manipal, Karnataka, India, for the fellowship support to the first author. The authors would like to thank the Manipal Centre for Biotherapeutics Research, Manipal Academy of Higher Education for theinfrastructural and equipment support. Disclosure statement No potential conflict of interest was reported by the author(s). Data availability statement The authors confirm that the data supporting the findings of this study are available within the article Author Contribution V.M. – performing experiments, drafting of the paper, revising it critically for intellectual content. J.M.J. – performing experimental work. S.N.C. – performing experimental work. R.N.S. – interpretation and final approval of the version to be published. K.S.V. – conception, design, analysis, interpretation, and final approval of the version to be published Data availability statement Data available within the article and the authors confirm that the data supporting the findings of this study are available within the article. Supplementary Information Supplemental data for this article can be accessed online at https://doi.org/10.1080/21655979.2025.2564563 References [1] Poghosyan T Gaujoux S Vanneaux V In vitro development and characterization of a tissue-engineered conduit resembling esophageal wall using human and pig skeletal myoblast, oral epithelial cells, and biologic scaffolds Tissue Eng Part A 2013 19 19–20 2242 15 10.1089/ten.tea.2012.0565 23672649 PMC3761407 [2] Bray F Ferlay J Soerjomataram I Global cancer statistics 2018: gLOBOCAN estimates of incidence and mortality worldwide for 36 cancers in 185 countries CA Cancer J Clin 2018 68 6 394 424 10.3322/caac.21492 30207593 [3] Barnes JA Willingham FF. Endoscopic management of early esophageal cancer J Clin Gastroenterol 2015 49 8 638 646 10.1097/MCG.0000000000000353 26125458 [4] Patel V Burbridge RA Endoscopic approaches for early-stage esophageal cancer: current options Curr Oncol Rep 2015 17 1 1 6 10.1007/s11912-014-0421-1 25416315 PMC5861347 [5] Arakelian L Kanai N Dua K Esophageal tissue engineering: from bench to bedside Ann N Y Acad Sci 2018 1434 1 156 163 10.1111/nyas.13951 30088660 [6] Poghosyan T Catry J Luong-Nguyen M Esophageal tissue engineering: current status and perspectives J Visc Surg 2016 153 1 21 29 10.1016/j.jviscsurg.2015.11.009 26711880 [7] Jones E Jensen T Sharma I Scaffolds for esophageal tissue engineering Handbook of tissue engineering scaffolds: volume two Woodhead Publishing 2019 565 592 [8] Choudhury D Yee M Sheng ZL Decellularization systems and devices: state-of-the-art Acta Biomater 2020 115 51 59 10.1016/j.actbio.2020.07.060 32771593 [9] Liu C Pei M Li Q Decellularized extracellular matrix mediates tissue construction and regeneration Front Med 2022 16 1 56 82 10.1007/s11684-021-0900-3 34962624 PMC8976706 [10] Kasturi M Vasanthan KS Harvesting decellularized liver extracellular matrix from rodents for 3D scaffold fabrication Artif Cells Nanomed Biotechnol 2024 52 1 175 185 10.1080/21691401.2024.2319893 38423125 [11] Totonelli G Maghsoudlou P Fishman JM Esophageal tissue engineering: a new approach for esophageal replacement World J Gastroenterol 2012 18 47 6900 6908 10.3748/wjg.v18.i47.6900 23322987 PMC3531673 [12] Bhrany AD Beckstead BL Lang TC Development of an esophagus acellular matrix tissue scaffold Tissue Eng 2006 12 2 319 330 10.1089/ten.2006.12.319 16548690 [13] Rodi PM Gianello MB Corregido MC Comparative study of the interaction of CHAPS and Triton X-100 with the erythrocyte membrane Biochim Biophys Acta Biomembr 2014 1838 3 859 866 10.1016/j.bbamem.2013.11.006 24239862 [14] Arakawa T Niikura T Kita Y Sodium dodecyl sulfate analogs as a potential molecular biology reagent Curr Issues Mol Biol 2024 46 1 1 9 10.3390/cimb46010040 PMC10814491 38248342 [15] Elomaa L Almalla A Keshi E Rise of tissue- and species-specific 3D bioprinting based on decellularized extracellular matrix-derived bioinks and bioresins Biomater Biosyst 2023 12 100084 10.1016/j.bbiosy.2023.100084 38035034 PMC10685010 [16] Gupt C Lamba AK Faraz F Histological evaluation of decellularization of freeze-dried and chemically treated indigenously prepared bovine pericardium membrane Cell Tissue Bank 2024 25 3 1 2 10.1007/s10561-024-10139-y 38780817 [17] Dominici M Le Blanc K Mueller I Minimal criteria for defining multipotent mesenchymal stromal cells Int Soc Cellular Ther Position Statement: Cytotherapy 2006 8 4 315 317 10.1080/14653240600855905 16923606 [18] GraphPad Software GraphPad Prism version 9 Available from: www.graphpad.com [19] Bradshaw CJ Sloan K Morandi A Outcomes of esophageal replacement: gastric pull-up and colonic interposition procedures Eur J Pediatr Surg 2018 28 1 22 29 10.1055/s-0037-1607041 28946161 [20] Gilbert TW Sellaro TL Badylak SF Decellularization of tissues and organs Biomaterials 2006 27 3675 3683 10.1016/j.biomaterials.2006.02.014 16519932 [21] Eftekharzadeh S Akbarzadeh A Sabetkish N Esophagus tissue engineering: from decellularization to in vivo recellularization in two sites Cell Tissue Bank 2022 23 2 301 312 10.1007/s10561-021-09944-6 34414549 [22] Crapo PM Gilbert TW Badylak SF An overview of tissue and whole organ decellularization processes Biomaterials 2011 32 12 3233 3243 10.1016/j.biomaterials.2011.01.057 21296410 PMC3084613 [23] Fernández-Pérez J Ahearne M The impact of decellularization methods on extracellular matrix-derived hydrogels Sci Rep 2019 9 1 14933 10.1038/s41598-019-49575-2 31624357 PMC6797749 [24] Yeleswarapu S Chameettachal S Bera AK Smooth muscle matrix bioink promotes myogenic differentiation of encapsulated adipose-derived stem cells J Biomed Mater Res A 2022 110 11 1761 1773 10.1002/jbm.a.37433 36082972 [25] O’Brien FJ Biomaterials & scaffolds for tissue engineering Mater Today 2011 14 3 88 95 10.1016/S1369-7021(11)70058-X [26] Wright A Arthaud-Day ML Weiss ML Therapeutic use of mesenchymal stromal cells: the need for inclusive characterization guidelines to accommodate all tissue sources and species Front Cell Dev Biol 2021 9 632717 10.3389/fcell.2021.632717 33665190 PMC7921162 [27] Hashemi SM Hassan ZM Pourfathollah AA In vitro immunomodulatory properties of osteogenic and adipogenic differentiated mesenchymal stem cells isolated from three inbred mouse strains Biotechnol Lett 2013 Jan 35 1 135 142 10.1007/s10529-012-1051-z 23007445 [28] Almalki SG Adipose-derived mesenchymal stem cells and wound healing: potential clinical applications in wound repair Saudi Med J 2022 Oct 43 10 1075 1086 10.15537/smj.2022.43.10.20220522 36261194 PMC9994497 [29] Nieto-Miguel T Galindo S Reinoso R In vitro simulation of corneal epithelium microenvironment induces a corneal epithelial-like cell phenotype from human adipose tissue mesenchymal stem cells Curr Eye Res 2013 38 9 933 944 10.3109/02713683.2013.802809 23767776 [30] Li W Zhou J Xu Y Study of the in vitro cytotoxicity testing of medical devices Biomed Rep 2015 3 5 617 620 10.3892/br.2015.481 26405534 PMC4535150 ",
  "metadata": {
    "Title of this paper": "Study of the in vitro cytotoxicity testing of medical devices",
    "Journal it was published in:": "Bioengineered",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12461892/"
  }
}