{
  "title": "Paper_108",
  "abstract": "pmc J Contemp Brachytherapy J Contemp Brachytherapy 1978 jcbrachy JCB Journal of Contemporary Brachytherapy 1689-832X 2081-2841 Termedia Publishing PMC12489537 PMC12489537.1 12489537 12489537 10.5114/jcb.2025.154105 56656 1 Original Paper Clinical efficacy of CT-guided iodine-125 seed brachytherapy in unresectable locoregionally recurrent breast cancer Ji Liqiu Graduate student Zhang Wenwen Graduate student Hao Shanhu Graduate student Wang Zhiguo Graduate student Zhang Guoxu Graduate student General Hospital of Northern Theater Command, Shenhe District, Shenyang, Liaoning, China Address for correspondence: zhangguoxu502@sina.com 29 8 2025 8 2025 17 4 498172 221 231 22 4 2025 27 7 2025 01 08 2025 03 10 2025 03 10 2025 Copyright © 2025 Termedia 2025 https://creativecommons.org/licenses/by-nc-sa/4.0/ This is an Open Access article distributed under the terms of the Creative Commons Attribution-NonCommercial-ShareAlike 4.0 International (CC BY-NC-SA 4.0). License ( http://creativecommons.org/licenses/by-nc-sa/4.0/ Purpose Clinical efficacy of computed tomography (CT)-guided iodine-125 ( 125 Material and methods A retrospective analysis was conducted on the clinical data of 68 patients with unresectable locoregionally recurrent breast cancer who underwent radioactive 125 125 Results A total of 89 locally recurrent lesions were identified in the 68 patients. The 125 2 p p p p p 2 p 2 p 2 p n n 2 p 125 Conclusions CT-guided 125 breast cancer local recurrence 125 brachytherapy pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement no pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes Purpose Locally recurrent breast cancer (LRBC) is generally defined as recurrence involving the chest wall, axillary lymph nodes, and supraclavicular lymph nodes on the ipsilateral side of the primary lesion. Local recurrence often represents the initial manifestation of treatment failure in breast cancer, with an incidence ranging from 4% to 32%. Even after adjuvant radiotherapy (RT), the local recurrence rate remains approximately 5% to 15%, and nearly 80% of recurrences typically occur within the first 5 years following initial treatment [ 1 Locally recurrent breast cancer should be tailored to the size, location, and type of recurrent tumors, as well as the initial treatment received, to select an appropriate therapeutic strategy. The most frequently employed treatment modalities for LRBC include surgery, stereotactic radiotherapy, chemotherapy, and hormonal therapy [ 2 In recent years, computed tomography (CT)-guided iodine-125 ( 125 3 5 125 Therefore, this study retrospectively analyzed the clinical efficacy of 125 Material and methods Research object A retrospective analysis was performed on the clinical data of 90 patients with LRBC admitted to our department between January 2018 and October 2023, all of whom had unresectable locoregional recurrent breast cancer or refused surgical resection ( Figure 1 Table 1 125 Fig. 1 Patient inclusion flowchart Table 1 Clinical data of 68 patients with LRBC Characteristics Value, n Age (years) ≥ 45 41/68 < 45 27/68 Pathologic type Invasive ductal carcinoma 39/68 Invasive lobular carcinoma 15/68 Intraductal carcinoma 9/68 Other 5/68 AJCC stage I 7/68 II 18/68 III 39/68 IV 4/68 Progenitor staging T1 + T2 37/68 T3 + T4 31/68 Number of axillary lymph node metastases > 4 27/68 ≤ 4 41/68 Molecular typing Luminal A 37/68 Luminal B 39/68 HER-2 positive 25/68 Triple negative 3/68 ECOG PS 0 41/68 1 27/68 Previous therapy Surgery Modified radical surgery 36/50 Simple excision 10/50 Breast-conserving surgery 4/50 Chemotherapy 61/68 Radiation therapy 1 8/61 2 36/61 3 12/61 4 5/61 Inclusion criteria: Patients with primary breast cancer confirmed by pathological examination (either via Patients with unresectable or difficult-to-resect metastatic lesions; those who refuse surgical resection as treatment; those with metastatic lesions not previously treated with other local therapies; or those with poor general condition that may preclude tolerance of major surgical procedures. Expected survival time of ≥ 3 months. No severe coagulation dysfunction, and anticoagulant therapy was discontinued at least 5-7 days prior to implantation. Exclusion criteria: Comorbidity with other active malignancies. Interval since last radiotherapy of less than 3 months. Poor general condition or presence of malignant cachexia. Incomplete clinical data or loss to follow-up. Some of the included patients had a history of surgery, adjuvant chemotherapy, hormonal intervention, and external beam radiotherapy (EBRT). The prior treatments for locally recurrent lesions were as follows: 1. Chemotherapy: 61 patients received chemotherapy, with anthracycline- and paclitaxel-based regimens as the mainstay. 2. Radiation therapy: 61 patients underwent radiation therapy using 60 Instruments and equipment Iodine-125 seed implantation scanning equipment: A 64-slice CT scanner integrated with GE Discovery VCT PET/CT (GE Healthcare, USA) was used for routine scanning. Implantation instruments: Implantation guns and pushers were procured from Xiangshan, Zhejiang Province, China; puncture needles (15-20 cm × 18G) were supplied by Hakko (Japan). Treatment planning system (TPS): A three-dimensional radiation implantation planning system provided by Beijing Feitian Zhaoye Technology Co., Ltd. was used. Seed source: 125 Methods  125 One week prior to the procedure, enhanced CT scans were imported into the TPS for designing the needle insertion paths, determining the number of seeds to be implanted, and arranging the puncture needles, among other parameters. Preoperative laboratory examinations, including blood tests, liver function assessments, coagulation profiles, and infectious disease screenings, are conducted within 72 hours before the surgery to evaluate procedural risks and ensure safety. Depending on the lesion location, patients were positioned appropriately, and an extracorporeal localization grid was placed on the skin corresponding to the lesion area. The implantation procedure was performed under CT guidance with local anesthesia. CT scanning was conducted to locate the lesion and determine the puncture points, and needles were placed layer by layer in accordance with the TPS plan. 125 90 100 150 Systemic treatment Following 125 6 Observation indicators and efficacy evaluation criteria Follow-up for the 68 patients commenced immediately after 125 7 Intraoperative and postoperative complications were recorded in accordance with the Radiation Therapy Oncology Group (RTOG) acute radiation toxicity grading criteria. Patients were monitored for adverse reactions following seed implantation, including fever, hemorrhage, myelosuppression, skin and mucosal reactions, and seed migration. Skin and mucosal reactions were evaluated in accordance with the Radiation Therapy Oncology Group/European Organization for Research and Treatment of Cancer (RTOG/EORTC) radiation-induced toxicity grading criteria. carcinoembryonic antigen (CEA) and cancer antigen 153 (CA153) levels were compared before and after treatment. These markers were assayed using chemiluminescence, with reference ranges of 0-5 ng/ml and 0-15 U/ml, respectively. Lymphedema was classified into three grades based on the criteria of the International Society of Lymphology [ 8 Statistical analysis Data analysis was performed using IBM SPSS 20.0 software. Quantitative data with a normal distribution were expressed as mean ± standard deviation ( x t 2 p Results Evaluation of efficacy A total of 68 patients were included, with ages ranging from 36 to 82 years at the time of recurrence (median age: 56 years). Among them, 41 were postmenopausal and 27 were premenopausal. There were 89 locally recurrent lesions in total, with 77.94% (53/68) of patients presenting with solitary lesions. The distribution of lesions was as follows: 29.41% (20/68) were confined to the chest wall, 4.41% (3/68) to the supraclavicular lymph nodes, 17.65% (12/68) to the axillary lymph nodes, and 26.47% (18/68) to the breast. Additionally, 22.06% (15/68) of patients had multiple lesions ( Table 2 Table 2 Clinical features of locally recurrent metastases Characteristics Value, n Size of the lesion < 2 cm 38/89 ≥ 2 cm 51/89 Lesion site Chest wall 20/68 Breast, axilla 6/68 Breast 18/68 Chest wall, axilla 3/68 Chest wall, axilla, supraclavicular fossa 3/68 Axilla 12/68 Breast, axilla, supraclavicular fossa 3/68 Supraclavicular fossa 3/68 The success rate of 125 125 t p Figure 2 Fig. 2 Patient female, 65 years old, left breast invasive ductal carcinoma with local recurrence and left axillary lymph node metastasis. A 125 B C 125 D Subgroup analysis of efficacy based on initial clinical data, treatment status, and local recurrence characteristics Efficacy of initial clinical staging in 68 patients Further subgroup analysis revealed the following results based on initial clinical staging: For patients with stage I + II, the LCR was 88.00% (22/25), and the ORR was 80.00% (20/25). For patients with stage III + IV, the LCR was 81.40% (35/43), and the ORR was 67.44% (29/43). Statistical analysis showed no significant difference in LCR between the two groups (χ 2 p 2 p < Efficacy of monotherapy and systemic therapy in 68 patients The ORR and LCR were 75.00% and 86.67%, respectively, in the 60 patients who received systemic therapy, compared with 50.00% and 62.50% in the 8 patients who received monotherapy. Statistical analysis showed that the differences in both ORR and LCR between the two groups were statistically significant (ORR: χ 2 p < 2 p < Efficacy of local regional recurrence sites in 68 patients The ORR and LCR were 60.00% and 73.33%, respectively, in 15 patients with multi-site recurrence, compared with 75.47% and 86.79% in 53 patients with single-site recurrence; the differences were statistically significant (χ 2 p Relief of clinical symptoms All 68 patients presented with pain. At the end of treatment, 50 cases achieved pain relief, resulting in a pain relief effective rate of 73.53%. Pain was re-evaluated 1 month after the procedure: 62 patients experienced pain relief, with the effective rate increasing to 91.18%. Additionally, 2 patients reported aggravated pain compared to the previous assessment, and 4 patients had no pain relief. Notably, one patient with aggravated pain was newly diagnosed with axillary lymph node metastasis. Among these patients, 6 cases developed upper limb edema due to axillary metastasis, including 2 cases of grade I and 4 cases of grade II. After treatment, the edema regressed to varying degrees: 2 cases achieved complete resolution, 3 cases improved to grade I, and 1 case remained at grade II. Serum tumor markers The comparison of serum CEA and CA153 levels before and after treatment is presented in Figure 3 Table 3 t p t p Fig. 3 A) t p B t p Table 3 Adverse reactions associated with 125 Adverse events Total Adverse reaction grade Grade 1 (%) Grade 2 (%) Grade 3 (%) Fever after implantation 19/68 12 (17.65) 7 (10.29) 0 (0.00) Nausea 2/68 2 (2.94) 0 (0.00) 0 (0.00) Localized hardening 6/68 6 (8.82) 0 (0.00) 0 (0.00) Bleeding 0/68 0 (0.00) 0 (0.00) 0 (0.00) Seed shedding 1/68 1 (1.47) 0 (0.00) 0 (0.00) Localized skin pigmentation 9/68 7 (10.29) 2 (2.94) 0 (0.00) Pulmonary radiation fibrosis 0/68 0 (0.00) 0(0.00) 0 (0.00) Implantation metastasis 0/68 0 (0.00) 0 (0.00) 0 (0.00) Pneumonia, pleurisy, pericarditis 0/68 0 (0.00) 0 (0.00) 0 (0.00) Upper limb or breast edema 0/68 0 (0.00) 0 (0.00) 0 (0.00) Nerve damage 0/68 0 (0.00) 0 (0.00) 0 (0.00) Fatigue 25/68 20 (29.41) 5 (7.35) 0 (0.00) Treatment-related adverse events During 125 After 125 Table 4 Table 4 Serum tumor markers before and after treatment were compared Group CEA (ng/ml) CA153 (U/ml) Pre-treatment 42.35 ±18.64 53.27 ±22.36 Post-treatment 32.92 ±22.86 46.25 ±16.42  t 2.636 2.087  p 0.0094 0.0388 Long-term results As of May 31, 2024, all 68 patients had completed follow-up without loss to follow-up. The follow-up duration ranged from 13 to 54 months, with a median of 32 months. By the end of the follow-up period, 40 patients (58.82%) had died, categorized as follows: 14 cases (20.59%) of non-cancer-related deaths, 19 cases (27.94%) of deaths due to systemic tumor metastasis, and 7 cases (10.29%) of deaths from multi-organ failure. The LPFS time was 25.60 months (95% CI: 20.36-26.70). The 1-year, 2-year, and 3-year LPFS rates were 82.35%, 52.94%, and 17.65%, respectively. The OS time was 36.65 months (95% CI: 34.50-40.20). The 1-year, 2-year, and 3-year OS rates were 95.59%, 70.59%, and 51.47%, respectively. In univariate and multivariate analyses, primary tumor stage, molecular subtype, treatment modality, and recurrence site were identified as independent factors influencing survival in patients with locally recurrent breast cancer ( p < Table 5 Table 5 Multivariate risk factor analysis of 125 Variables B OR (95% CI)  p Staging of the primary tumor 0.923 2.473 (1.026-6.128) 0.042 Molecular typing 1.251 1.359 (0.796-4.512) 0.036 Single/Comprehensive treatment 1.208 1.166 (0.631-2.052) 0.011 Pathologic type 2.917 0.657 (0.207-4.172) 0.087 Single/Multiple lesions 0.518 1.997 (1.009-3.195) 0.014 Comparison of survival in patients by initial clinical staging The LPFS time was 28.60 months (95% CI: 25.60-36.20) in patients with initial clinical stage I + II, compared with 20.36 months (95% CI: 15.40-25.60) in those with stage III + IV. The difference in LPFS between the two groups was statistically significant (χ 2 p Figure 4 Fig. 4 Kaplan-Meier curves of localized progression-free survival for initial clinical staging, comparison of survival curves for patients with stage I + II ( n n 2 p The OS time was 47.5 months (95% CI: 42.30-51.60) in patients with stage I + II, compared with 30.80 months (95% CI: 23.20-35.60) in those with stage III + IV. The difference was statistically significant (χ 2 p Comparison of survival in patients by different molecular typing The LPFS times for patients with different molecular subtypes were as follows: 25.95 months (95% CI: 19.20-30.20) for Luminal A, 25.60 months (95% CI: 17.20-30.20) for Luminal B, 20.36 months (95% CI: 11.50-28.60) for HER-2 positive, and 11.55 months (95% CI: 9.80-26.30) for triple-negative. The difference in LPFS among the four subtypes was statistically significant (χ 2 p = Figure 5 Fig. 5 Kaplan-Meier curves for molecularly typed local progression-free survival, Luminal A (26), Luminal B (25), HER-2 positive (11) and triple negative (6) patients were compared (χ 2 p The OS times stratified by molecular subtypes were as follows: 41.25 months (95% CI: 38.05-46.70) for Luminal A, 34.80 months (95% CI: 22.80-46.20) for Luminal B, 35.60 months (95% CI: 22.90-46.80) for HER-2 positive, and 20.15 months (95% CI: 11.60-23.20) for triple-negative subtypes. Statistical analysis showed a significant difference in OS among the four subtypes (χ 2 p = Comparison of survival between monotherapy and systemic therapy patients The LPFS time was 25.60 months (95% CI: 20.36-28.60) in 60 patients who received systemic therapy following 125 125 2 p = Figure 6 Fig. 6 Kaplan-Meier curves of local progression-free survival for different treatment regimens, comparing survival curves of patients treated with systemic therapy ( n n 2 p The two OS times were 38.23 (95% CI: 34.80-45.60) months and 22.85 (95% CI: 11.00-38.40) months, respectively, with a statistically significant difference (χ 2 p = Comparison of survival in patients with localized regional multisite recurrence vs. single-site recurrence The LPFS time was 15.60 months (95% CI: 13.20-26.70) in 15 patients with multi-site recurrence, compared with 25.60 months (95% CI: 22.90-28.60) in 53 patients with single-site recurrence. There was a statistically significant difference in LPFS between the two groups (χ 2 p = Figure 7 Fig. 7 Kaplan-Meier curves of local progression-free survival for different sites of recurrence, comparing the survival curves of patients with multiple sites of recurrence ( n n 2 p The two OS times were 34.90 (95% CI: 20.20-39.20) and 38.05 (95% CI: 34.50-46.62) months, respectively, and the difference was statistically significant (χ 2 p = Discussion Local recurrence in the chest wall or regional lymph nodes (including axillary, supraclavicular, or intramammary nodes) occurs in approximately 10% to 40% of breast cancer patients after initial treatment [ 9 10 11 In recent years, 125 125 in vivo 125 125 12 Yi et al 13 125 125 p = et al Analysis of the relationship between clinicopathological factors and survival in locally recurrent breast cancer revealed statistically significant differences in local control rates among subgroups stratified by primary tumor stage, recurrence site, and clinical staging. These findings suggest that patients with advanced primary disease, multiple recurrence sites, or triple-negative breast cancer have poorer LPFS. In contrast, the pathological type of the tumor did not significantly affect survival in locally recurrent breast cancer. Breast cancer exhibits high heterogeneity, and its diverse clinical and biological manifestations are determined by distinct genetic phenotypes. Breast cancer can be categorized into Luminal A, Luminal B, human epidermal growth factor receptor 2 (HER2)-overexpressing, basal-like, and non-basal-like subtypes based on gene expression clustering analysis [ 14 15 16 17 18 The results of this study demonstrated that the pain relief rate at 1 month postoperatively was 91.18%, with a significant reduction in pain levels compared to those before treatment. Additionally, serum levels of CEA and CA153 were significantly lower than preoperative levels, with statistically significant differences ( p < 125 8 19 This study provides robust evidence for the application of 125 125 125 In summary, 125 125 Funding This research received no external funding. Disclosures The study was approved by the Bioethics Committee of the Institutional Ethics Committee of General Hospital of Northern Theater Command (Approval No. Ethics No. YL2021-07). The authors declare no conflict of interest. 1 Cheng L Swartz MD Zhao H et al Hazard of recurrence among women after primary breast cancer treatment–a 10-year follow-up using data from SEER-Medicare Cancer Epidememiol Biomarkers Prev 2012 21 800 809 10.1158/1055-9965.EPI-11-1089 22426147 2 Siglin J Champ CE Vakhnenko Y et al Radiation therapy for locally recurrent breast cancer Int J Breast Cancer 2012 2012 571946 23091733 10.1155/2012/571946 PMC3471452 3 Castillo-Simón AG Tormo-Ratera M Ferrer-Fuertes A et al Use of 125I seeds in the surgical management of a complex oncological case Rev Esp Med Nucl Imagen Mol (Engl Ed) 2023 42 116 118 36906378 10.1016/j.remnie.2022.01.003 4 Sigdel M Zhang C Hou R et al Biliary metallic stent combined with radioactive 125I seeds strands for malignant hilar obstruction BMC Cancer 2023 25 229 10.1186/s12885-025-13627-w PMC11809024 39930335 5 Song M Zhou X Hou R et al CT-guided radioactive 125I seeds brachytherapy for lung oligometastases from colorectal cancer: initial results BMC Cancer 2023 24 265 10.1186/s12885-024-12013-2 PMC10895717 38403626 6 Gradishar WJ Moran MS Abraham J et al Breast Caneer, Version 3.2024, NCCN Clinical Practice Guidelines in Oncology J Natl Compr Canc Netw 2024 22 331 357 39019058 10.6004/jnccn.2024.0035 7 Eisenhauer EA Thearasse P Bogaerts J et al New response evaluation criteria in solid tumours: revised RECIST guideline (version 1.1) Eur J Cancer 2009 45 228 247 19097774 10.1016/j.ejca.2008.10.026 8 Viehoff PB van Genderen FR Wittink H Upper limb lymphedema 27 (ULL27): Dutch translation and validation of an illness-specific health-related quality of life questionnaire for patients with upper limb lymphedema Lymphology 2008 41 131 138 19013881 9 Shuling L Breast oncology Science and Technology Literature Press, Beijing 2000 471 472 10 Pennery E The role of endocrine therapies in reducing risk of recurrence in postmenopausal women with hormone receptor-positive breast cancer Eur J Oncol Nurs 2008 12 233 243 18372213 10.1016/j.ejon.2008.01.007 11 Fodor J Major T Polgár C et al Prognosis of patients with local recurrence after mastectomy or conservative surgery for early-stage invasive breast cancer Breast 2008 17 302 308 18082403 10.1016/j.breast.2007.11.004 12 Wang J Radiation particle brachytherapy of tumors Peking University Medical Press Beijing 2004 181 13 Yi F Yu YH Wei CY et al Observation on the efficacy of 125 I radioactive particle therapy for locally recurrent or metastatic breast cancer Chinese J Oncol 2016 38 472 475 10.3760/cma.j.issn.0253-3766.2016.06.013 27346407 14 Goldhirsch A Wood WC Coates AS et al Strategies for subtypes–dealing with the diversity of breast cancer: highlights of the St. Gallen International Expert Consensus on the Primary Therapy of Early Breast Cancer 2011 Ann Oncol 2011 22 1736 1747 21709140 10.1093/annonc/mdr304 PMC3144634 15 Goldhirsch A Winer EP Coates AS et al Personalizing the treatment of women with early breast cancer: highlights of the St Gallen International Expert Consensus on the Primary Therapy of Early Breast Cancer 2013 Ann Oncol 2013 24 2206 2223 23917950 10.1093/annonc/mdt303 PMC3755334 16 Ma X Jin Z Li G et al Classification of chronic radiation-induced ulcers in the chest wall after surgery in breast cancers Radiat Oncol 2017 12 135 28810878 10.1186/s13014-017-0876-y PMC5558728 17 García Fernández A Chabrera C García Font M et al Differential patterns of recurrence and specific survival between luminal A and luminal B breast cancer according to recent changes in the 2013 St Gallen immunohistochemical classification Clin Transl Oncol 2015 17 238 246 25270605 10.1007/s12094-014-1220-8 18 Spitale A Mazzola P Soldini D et al Breast cancer classification according to immunohistochemical markers: clinicopathologic features and short-term survival analysis in a population-based study from the South of Switzerland Ann Oncol 2009 20 628 635 19074747 10.1093/annonc/mdn675 19 Zhang TZ Xu GW Oncology Tianjin Science and Technology Press, Tianjin 1996 547 553 ",
  "metadata": {
    "Title of this paper": "Oncology",
    "Journal it was published in:": "Journal of Contemporary Brachytherapy",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12489537/"
  }
}