{
  "title": "Paper_823",
  "abstract": "pmc Obstet Gynecol Sci Obstet Gynecol Sci 2215 ogs Obstetrics & Gynecology Science 2287-8572 2287-8580 Korean Society of Obstetrics and Gynecology PMC12463478 PMC12463478.1 12463478 12463478 40774314 10.5468/ogs.25036 ogs-25036 1 Original Article General Gynecology Isobaric NOTES hysterectomy: an alternative to transvaginal NOTES hysterectomy http://orcid.org/0000-0002-7061-816X Yang Yun Seok MD, PhD 1 Lim Chul Kwon MD 1 Kwack Jae Young MD, PhD 2 Kang Jun-Hyeok MD 3 Kim Seong Hee MD 4 Oh Kwan Young MD, PhD 1  1 Korea  2 Korea  3 Korea  4 Korea Corresponding author: Yun Seok Yang, MD, PhD, Department of Obstetrics and Gynecology, Eulji University Daejeon Eulji Medical Center, 95 Dunsanseo-ro, Seo-gu, Daejeon 35233, Korea, E-mail: womanmed@eulji.ac.kr This study was presented as a featured oral presentation at the 110th Annual Fall Conference of the Korean Society of Obstetrics and Gynecology on November 7, 2024. 9 2025 7 8 2025 68 5 497534 433 441 3 12 2024 12 6 2025 1 7 2025 01 09 2025 26 09 2025 26 09 2025 Copyright © 2025 Korean Society of Obstetrics and Gynecology 2025 https://creativecommons.org/licenses/by-nc/3.0/ Articles published in Obstet Gynecol Sci are open-access, distributed under the terms of the Creative Commons Attribution Non-Commercial License ( http://creativecommons.org/licenses/by-nc/3.0/ Objective Natural orifice transluminal endoscopic surgery (NOTES) for hysterectomy conventionally requires CO 2 2 Methods Between December 2014 and July 2018, 137 patients with benign uterine conditions underwent iNH or single-port laparoscopy-assisted vaginal hysterectomies (SP-LAVH). Clinical outcomes were retrospectively compared. Results Of 137 patients, 59 underwent iNH and 78 underwent SP-LAVH. All iNH procedures were completed without conversion, except for one hybrid NOTES case, with no intraoperative complications reported in the iNH group. While the median operative times and uterine weights were comparable between the groups, iNH demonstrated significantly lower median blood loss, reduced hemoglobin changes on postoperative day 1, and shorter hospital stay than SP-LAVH. Conclusion Using a single-hole vaginal platform without pneumoperitoneum, iNH combines the simplicity of vaginal hysterectomy with the visual advantages of vNH. Therefore, it is a distinct method within the transvaginal hysterectomy spectrum. Further studies are warranted to delineate the specific iNH advantages over conventional pneumoperitoneum-based vNOTES. Vaginal hysterectomy Transvaginal natural orifice transluminal endoscopic surgery (vNOTES) Isobaric technique Laparoscopy pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement no pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes Introduction Hysterectomy can be performed via several surgical approaches, including vaginal, abdominal, laparoscopic, and robot-assisted routes. Among these, the International Society for Gynecologic Endoscopy recommends vaginal hysterectomy (VH) as the first-line approach [ 1 1 4 5 Transvaginal natural orifice transluminal endoscopic surgery (vNOTES) was introduced to overcome some technical limitations associated with VH by providing enhanced visualization through laparoscopic endoscopy. In our initial series, we demonstrated that vNOTES was feasible and safe for vaginal hysterectomies [ 6 7 8 9 11 2 The development of the current technique was based on the hypothesis that, while single-port laparoscopic techniques traditionally rely on pneumoperitoneum, isobaric single-port hysterectomy [ 12 13 2 2 14 11 15 2 6 10 2 16 Materials and methods 1. Patient selection In October 2014, Dr. Yang introduced the iNH technique as an alternative surgical approach for managing benign uterine diseases. This study enrolled all women who underwent either iNH or single-port laparoscopy-assisted SP-LAVH for benign uterine conditions between October 2014 and July 2018. A total of 59 patients who underwent iNH and 78 patients who underwent SP-LAVH during the same period were included in the comparative cohort. Patient demographics, intraoperative data, and postoperative outcomes were retrospectively collected and analyzed. The study protocol was reviewed and approved by the institutional review board at Eulji University Hospital in 2017 (reference number 2017-05-006). Eligible participants were women who met the criteria for conventional laparoscopic hysterectomy. The exclusion criteria were suspected gynecologic malignancy, severe endometriosis, complete obliteration of the cul-de-sac on pelvic examination, and virginity. Patients with uterine prolapse were also excluded. Conversely, nulliparity, a history of pelvic surgeries or cesarean deliveries, and uterine size exceeding 12 weeks of gestation (approximately 280 g) were not considered contraindications for this study. 2. Surgical procedures All procedures, including both iNH and SP-LAVH, were performed using conventional laparoscopic instruments. A rigid 10-mm 30° laparoscope was utilized throughout the study, accompanied by standard 5-mm laparoscopic instruments. Vessel sealing was achieved using a 5–10-mm LigaSure™ vessel sealing system (Medtronic, Mansfield, MA, USA) and Valleylab™ FT10 energy platform (Medtronic), which served as the primary energy source. Either an Alexis ® ® 3. Isobaric NOTES technique for performing hysterectomy The isobaric NOTES technique employs a three-step gasless approach, with all stages performed without pneumoperitoneum. The first stage is completed under direct visualization, whereas the second and third stages are conducted under gasless endoscopic vision a video of iNH using a three-step gasless approach technique ( https://www.youtube.com/watch?v=ZNV3HBdAk30 1) Step 1: establishing the isobaric NOTES setup using the single-hole vaginal platform The first step involves constructing a single-hole vaginal platform rather than utilizing a conventional transvaginal port device. A circumferential incision is made around the cervix to initiate access. For anterior colpotomy, blunt dissection was used to separate the vaginal mucosa from the cervical stroma and the peritoneal cavity was accessed by sharply entering the peritoneum. A right-angle retractor is positioned within the peritoneal cavity to protect the bladder. Posterior colpotomy was performed by identifying and sharply entering the peritoneum using Mayo scissors. After both anterior and posterior colpotomies were completed, the uterosacral and cardinal ligaments were grasped with Kelly clamps, transected, and sutured. Inner rim of the wound retractor was placed transvaginally to establish access to pelvic cavity ( Fig. 1A Fig. 1B Fig. 1B, C Fig. 1D 2) Step 2: performing hysterectomy under gasless endoscopic vision In this step, the remaining hysterectomy was performed under gasless endoscopic visualization. With the establishment of a single-hole vaginal platform, the procedure proceeds without pneumoperitoneum, similar to techniques used in NOTES-assisted vaginal hysterectomy [ 6 Fig. 2A Fig. 2B 3) Step 3: suturing of pedicles and vaginal cuff under gasless endoscopic vision The third step involves suturing of all pedicles and closure of the vaginal cuff under gasless endoscopic vision. Hemostasis was achieved at the dissection site via isobaric coagulation or suturing. The uterosacral and cardinal ligaments were affixed to the vaginal wall using isobaric sutures. All conventional laparoscopic suturing techniques, including continuous suturing with barbed sutures, were performed under isobaric endoscopic vision ( Fig. 2C Fig. 2D 4. Data analysis Patient data were collected retrospectively from our institutional database. The intra-and postoperative outcomes included uterine weight, hemoglobin change (difference between preoperative and postoperative day 1 hemoglobin levels), estimated blood loss, duration of postoperative hospital stay, analgesic usage, operative times, and postoperative complications. Discharge was scheduled on the postoperative day. Age, body mass index (BMI), and parity were treated as continuous variables and presented as mean±standard deviation, whereas other data were reported as medians with ranges and regarded as discrete variables. Statistical analyses were performed using SPSS for Windows version 17.0 (SPSS Inc., Chicago, IL, USA). Statistical significance was set at a two-sided P t U P Results Among the 137 patients included in this study, 59 underwent iNH, and 78 underwent SP-LAVH. There were no statistically significant demographic differences between the groups (iNH vs. SP-LAVH) in terms of age, BMI, parity, nulliparity, and history of pelvic surgery ( Table 1 Surgical outcomes of the two groups are shown in Table 2 There were no significant intergroup differences in additional surgical procedures, including adhesiolysis, adnexal surgery, and cystectomy. Likewise, no differences were noted in other perioperative outcomes such as blood transfusion rates, febrile complications, or the number of analgesic drugs required. Median operative time and median uterine weight were also comparable between the iNH and SP-LAVH groups, with median operative times of 70 minutes (range, 40 to 150) for iNH and 82.5 minutes (range, 40 to 145) for SP-LAVH, and median uterine weights of 273.5 g (range, 87.3 to 897.6) vs. 266.0 g (range, 49.1 to 901.0), respectively. General linear model analysis indicated that operative time was influenced by factors such as uterine weight, patient BMI, and requirement for adhesiolysis ( P Notably, the iNH group demonstrated significant improvements in several intraoperative and postoperative outcomes compared with the SP-LAVH group. The iNH group had significantly lower median estimated blood loss (120 [range, 20 to 400] vs. 200 mL [range, 10 to 800]; P P P Discussion Gas leakage remains a major disadvantage of platforms designed to establish pneumoperitoneum [ 17 18 2 2 12 14 19 19 13 13 14 16 Compared to vNH, iNH offers five distinct advantages. First, iNH creates ample space for instrument manipulation, as the single-hole vaginal platform provides easy access and optimal exposure under gasless conditions. This setup facilitates manipulation even in anatomically challenging situations, such as narrow vaginal canals, nulliparous patients, or large uteri with leiomyomas of up to 895 g. Second, iNH eliminates the need for a closed cavity, allowing surgeons to use continuous suction to clear blood and smoke from the pelvic cavity without affecting the intra-abdominal pressure or destabilizing the working port. This approach aids in maintaining a stable operative field and may reduce operative time, thereby enhancing surgical efficiency. Third, the single-hole platform permits simultaneous use of multiple instruments, thereby improving both suturing efficiency and visualization. Suturing and knotting with barbed sutures at the upper pedicle were smoothly performed using laparoscopic instruments or conventional needle holders under isobaric endoscopic vision. In addition, an assistant can retract the bowel or other tissues using standard instruments to facilitate the procedure. Fourth, iNH mitigates CO 2 20 21 Recent systematic reviews and meta-analyses have further established the efficacy and safety of vNH for benign gynecological indications. Marchand et al. [ 22 23 24 25 A major technical limitation of iNH is the challenge of consistently maintaining a clear operative field. Unlike traditional vNH, which utilizes a CO 2 In conclusion, iNH merges the procedural simplicity of VH with the visual advantages of NOTES, while avoiding pneumoperitoneum. Therefore, it represents a distinct approach within the spectrum of transvaginal hysterectomies ( Table 3  Conflicts of interest The authors have no commercial, proprietary, or financial interest in the products or companies described in this article.  Ethical approval The study protocol was reviewed and approved by the Institutional Review Board of 2017 (reference number: 2017-05-006).  Patient consent This study was approved by the Institutional Review Board of Eulji University Hospital in 2017 (reference number 2017-05-006), and the requirement for individual patient consent was waived due to the retrospective nature of the study.  Funding information This study received no funding. References 1 Chrysostomou A Djokovic D Edridge W van Herendael BJ Evidence-based guidelines for vaginal hysterectomy of the International Society for Gynecologic Endoscopy (ISGE) Eur J Obstet Gynecol Reprod Biol 2018 231 262 7 30447552 10.1016/j.ejogrb.2018.10.058 2 McCracken G Hunter D Morgan D Price JH Comparison of laparoscopic-assisted vaginal hysterectomy, total abdominal hysterectomy and vaginal hysterectomy Ulster Med J 2006 75 54 8 16457405 PMC1891794 3 Spilsbury K Semmens JB Hammond I Bolck A Persistent high rates of hysterectomy in Western Australia: a population-based study of 83 000 procedures over 23 years BJOG 2006 113 804 9 16827764 10.1111/j.1471-0528.2006.00962.x 4 Pandey D Sehgal K Saxena A Hebbar S Nambiar J Bhat RG An audit of indications, complications, and justification of hysterectomies at a teaching hospital in India Int J Reprod Med 2014 2014 279273 25763395 10.1155/2014/279273 PMC4334049 5 Driessen SR Baden NL van Zwet EW Twijnstra AR Jansen FW Trends in the implementation of advanced minimally invasive gynecologic surgical procedures in the Netherlands J Minim Invasive Gynecol 2015 22 642 7 25655043 10.1016/j.jmig.2015.01.026 6 Yang YS Kim SY Hur MH Oh KY Natural orifice transluminal endoscopic surgery-assisted versus single-port laparoscopic-assisted vaginal hysterectomy: a case-matched study J Minim Invasive Gynecol 2014 21 624 31 24462594 10.1016/j.jmig.2014.01.005 7 Yang YS Hur MH Oh KY Kim SY Transvaginal natural orifice transluminal endoscopic surgery for adnexal masses J Obstet Gynaecol Res 2013 39 1604 9 23875997 10.1111/jog.12108 8 Yang YS Robotic glove port technique for the endowristed rigid instruments in robotic single-site transabdominal and transvaginal surgery J Robot Surg 2021 15 241 9 32506299 10.1007/s11701-020-01093-4 9 Interdonato ML Scollo P Bignardi T Massimello F Ferrara M Donatiello G Hysterectomy by transvaginal natural orifice transluminal endoscopic surgery: an Italian initial experience Front Med (Lausanne) 2022 9 1018232 36582280 10.3389/fmed.2022.1018232 PMC9792506 10 Karkia R Giacchino T Taylor J Ghaffar A Gupta A Kovoor E Hysterectomy and adenextomy via transvaginal natural orifice transluminal endoscopic surgery (vNOTES): a UK perspective with a case series of 33 patients Eur J Obstet Gynecol Reprod Biol 2019 242 29 32 31539766 10.1016/j.ejogrb.2019.08.023 11 Atallah S Martin-Perez B Schoonyoung H Albert M Hunter L Quinteros F Vaginal access minimally invasive surgery: a new approach to hysterectomy J Minim Invasive Gynecol 20 14; 21 S116 10.1177/1553350614560273 25432882 12 Fanfani F Gagliardi ML Fagotti A Turco LC Scambia G Laparoendoscopic single-site isobaric hysterectomy in endometrial cancer JSLS 2013 17 354 7 23925037 10.4293/108680813X13693422521232 PMC3771810 13 Sesti F Melgrati L Damiani A Piccione E Isobaric (gasless) laparoscopic uterine myomectomy. An overview Eur J Obstet Gynecol Reprod Biol 2006 129 9 14 16723181 10.1016/j.ejogrb.2006.04.027 14 Yang Y Jin C Oh K Park J Hybrid laparoscopic myomectomy: a novel technique Obstet Gynecol Sci 2015 58 401 4 26430666 10.5468/ogs.2015.58.5.401 PMC4588846 15 Baekelandt J Total vaginal NOTES hysterectomy: a new approach to hysterectomy J Minim Invasive Gynecol 2015 22 1088 94 26009278 10.1016/j.jmig.2015.05.015 16 Yang YS Robotic natural orifice transluminal endoscopic surgery (NOTES) hysterectomy as a scarless and gasless surgery Surg Endosc 2020 34 492 500 31728751 10.1007/s00464-019-07115-z 17 Romanelli JR Earle DB Single-port laparoscopic surgery: an overview Surg Endosc 2009 23 1419 27 19347400 10.1007/s00464-009-0463-x 18 Escobar PF Fader AN Paraiso MF Kaouk JH Falcone T Robotic-assisted laparoendoscopic single-site surgery in gynecology: initial report and technique J Minim Invasive Gynecol 2009 16 589 91 19589731 10.1016/j.jmig.2009.05.004 19 Giraudo G Pantuso G Festa F Farinella E Morino M Clinical role of gasless laparoscopic adrenalectomy Surg Laparosc Endosc Percutan Tech 2009 19 329 32 19692884 10.1097/SLE.0b013e3181ae6240 20 Ishikawa M Nakagawa T Nishioka M Ogata S Miyauchi T Kashiwagi Y Costs and benefits of laparoscopic cholecystectomy: abdominal wall lifting vs. pneumoperitoneum procedure Hepatogastroenterology 2006 53 497 500 16995448 21 Woolley DS Puglisi RN Bilgrami S Quinn JV Slotman GJ Comparison of the hemodynamic effects of gasless abdominal distention and CO2 pneumoperitoneum during incremental positive end-expiratory pressure J Surg Res 1995 58 75 80 7830409 10.1006/jsre.1995.1012 22 Marchand GJ Masoud AT Ulibarri H Arroyo A Moir C Blanco M Systematic review and meta-analysis of vaginal natural orifice transluminal endoscopic surgery vs laparoscopic hysterectomy AJOG Glob Rep 2024 4 100320 38440153 10.1016/j.xagr.2024.100320 PMC10910317 23 Tang Y Fang CL Huang JR Chen XM Cai X Wu J Comparison of rapid recovery outcomes between vNOTES hysterectomy and laparoscopic hysterectomy: a prospective study BMC Surg 2025 25 189 40301814 10.1186/s12893-025-02906-9 PMC12042556 24 Mat E Yıldız P Temoçin RB Kartal Ö Keles E Transvaginal natural orifice endoscopic surgery (vNOTES) for elderly patients Ginekol Pol 2024 95 175 80 10.5603/gpl.95911 37873921 25 Aruparayil N Bolton W Mishra A Bains L Gnanaraj J King R Clinical effectiveness of gasless laparoscopic surgery for abdominal conditions: systematic review and meta-analysis Surg Endosc 2021 35 6427 37 34398284 10.1007/s00464-021-08677-7 PMC8599349 Fig. 1 Construction of a single-hole vaginal platform for isobaric NOTES hysterectomy. Single-hole vaginal platform created using a right-angle retractor to lift the anterior vaginal wall, a wound retractor inserted transvaginally toward the pelvic cavity opening, and a weighted vaginal retractor performing downward traction on the posterior vagina (A). An endoscope was inserted medially, with a laparoscopic traumatic grasper and conventional energy source inserted laterally on each side of the endoscope through single-hole vaginal platform (B). Simultaneous use of multiple operative instruments through the single-hole vaginal platform (C). An anterior colpotomy was completed under isobaric endoscopic vision (D). NOTES, natural orifice transluminal endoscopic surgery. Fig. 2 Managing remaining hysterectomy under isobaric endoscopic vision. Parametria and uterine arteries were disconnected along the uterus using a vessel-sealing device (A). Adhesiolysis using a laparoscopic instrument on adhesion between the uterus and abdominal peritoneum (B). Sutures and knots are performed freely using laparoscopic instruments (C). Vaginal cuff is approximated using continuous sutures (D). Table 1 Patient characteristics for iNH and SP-LAVH (n=137) in this study Variable iNH (n=59) SP-LAVH (n=78) P Age (yr) 47.8±6.1 46.3±4.9 NS BMI (kg/m 2 24.5±3.0 23.8±3.5 NS Parity 1.44±1.1 1.37±1.1 NS Nulliparity 18 (30.6) 24 (30.8) NS Previous pelvic surgery 16 (27.1) 30 (38.5) NS Main pathology Leiomyoma 34 (57.6) 33 (42.3) Adenomyosis 16 (27.1) 21 (26.9) Both adenomyosis and leiomyoma 6 (10.2) 22 (28.2) Endometrial hyperplasia 2 (3.4) 2 (2.6) Other 1 (1.7) 0 (0.0) Values are presented as mean±standard deviation or number (%). iNH, isobaric natural orifice transluminal endoscopic surgery hysterectomy; SP-LAVH, single-port laparoscopy-assisted vaginal hysterectomy; NS, not significant; BMI, body mass index. Table 2 A comparison of operative outcomes for iNH and SP-LAVH groups (n=137) used in this study Variable iNH (n=59) SP-LAVH (n=78) P Combined NOTES with laparoscopy 1 0 Conversion of operative method 0 0 Intraoperative complications 0 2 Additional procedures 12 (20.3) 19 (24.4) NS Adhesiolysis 5 (8.5) 15(19.2) NS Adnexal removal 8 (13.6) 7 (9.0) NS Cystectomy 1 2 Blood transfusion 2 (3.4) 5 (6.4) NS Estimated blood loss (mL) 120 (20 to 400) 200 (10 to 800) 0.004 Hemoglobin change, day 1 (g/dL) 0.9 (0 to 3.2) 1.2 (−0.2 to 4.7) 0.003 Operative time (minutes) 70 (40 to 150) 82.5 (40 to 145) NS Weight of uterus (g) 273.5 (87.3 to 897.6) 266.0 (49.1 to 901.0) NS Febrile complication 4 (6.8) 3 (3.8) NS Analgesics injection 1 (0 to 6) 1 (0 to 5) NS Postoperative hospital stay (days) 3 (2 to 4) 4 (3 to 7) <0.001 Postoperative complication 0 0 Values are presented as number (%) or median (range). iNH, isobaric NOTES hysterectomy; SP-LAVH, single-port laparoscopy-assisted vaginal hysterectomy; NOTES, natural orifice transluminal endoscopic surgery; NS, not significant. Table 3 Taxonomy of transvaginal hysterectomy Abbreviation Name Description VH Vaginal hysterectomy Total hysterectomy performed entirely through vaginal access under direct vision using conventional surgical instruments iNH Isobaric NOTES hysterectomy [ 16 Total hysterectomy, in which the caudal part of the uterus is first dissected vaginally under direct vision, and then the remaining hysterectomy is performed via transvaginal NOTES using a laparoscopic camera and laparoscopic instruments without pneumoperitoneum vNH Transvaginal NOTES hysterectomy [ 6 10 Total hysterectomy, in which the caudal part of the uterus is first dissected vaginally under direct vision, and then the remaining hysterectomy is performed via transvaginal NOTES using a laparoscopic camera and laparoscopic instruments under pneumoperitoneum TNH Total NOTES hysterectomy [ 11 15 Total hysterectomy, in which the entire uterus is dissected via transvaginal NOTES using a laparoscopic camera and laparoscopic instruments under pneumoperitoneum NOTES, natural orifice transluminal endoscopic surgery. ",
  "metadata": {
    "Title of this paper": "Clinical effectiveness of gasless laparoscopic surgery for abdominal conditions: systematic review and meta-analysis",
    "Journal it was published in:": "Obstetrics & Gynecology Science",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12463478/"
  }
}