{
  "title": "Paper_569",
  "abstract": "pmc Vaccines (Basel) Vaccines (Basel) 2764 vaccines vaccines Vaccines 2076-393X Multidisciplinary Digital Publishing Institute  (MDPI) PMC12474226 PMC12474226.1 12474226 12474226 41012143 10.3390/vaccines13090940 vaccines-13-00940 1 Conference Report Online Conference “Chronic Viral Infections and Cancer, Openings for Vaccines and Cure” VIRCAN2024, Monitoring the Progress https://orcid.org/0000-0002-5820-1783 Sokolovska Liba 1 * https://orcid.org/0000-0003-0845-4392 Jansons Juris 1 2 https://orcid.org/0000-0002-7491-7220 Buonaguro Franco M. 3 https://orcid.org/0000-0001-9382-2254 Isaguliants Maria 1 4 * Tripp Ralph A. Academic Editor 1 2 3 4 * liba.sokolovska@rsu.lv maria.issagouliantis@rsu.lv 02 9 2025 9 2025 13 9 497676 940 31 7 2025 23 8 2025 26 8 2025 02 09 2025 28 09 2025 29 09 2025 © 2025 by the authors. 2025 https://creativecommons.org/licenses/by/4.0/ Licensee MDPI, Basel, Switzerland. This article is an open access article distributed under the terms and conditions of the Creative Commons Attribution (CC BY) license ( https://creativecommons.org/licenses/by/4.0/ Chronic viral infections and virus-induced cancers have been actively studied for decades, with many significant advancements in basic science, disease cure, treatment, and prevention. Yet, today, these infections and pathologies remain major contributors to morbidity and mortality worldwide. The international online conference “VIRCAN2024: Chronic viral infections and cancer, openings for Vaccines and Cure” aimed to address the remaining issues, present the research carried out in this broad field, and prognose directions for its development. The conference covered oncogenicity mechanisms and new approaches in the development of treatments and vaccines. VIRCAN2024 was held on the platform of Riga Stradins University, Riga, Latvia. The conference was supported by the Latvian Science Council grant “Human papillomavirus genome associated correlates of disease progression and treatment response for cervical neoplasms and cancer”, and the scientific journal Vaccines vircan2024 virus infection oncovirus vaccine Science Council grant “Human papillomavirus genome associated correlates of disease progression and treatment response for cervical neoplasms and cancer” LZP-2021/1-0484 This research was funded by the Latvian Science Council grant “Human papillomavirus genome associated correlates of disease progression and treatment response for cervical neoplasms and cancer” LZP-2021/1-0484. pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement no pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes 1. Online Conference “VIRCAN2024: Chronic Viral Infections and Cancer, Openings for Vaccines and Cure” Chronic viral infections and virus-induced cancers remain major contributors to the global burden of infectious diseases and cancers, morbidity, and mortality of millions of people, as well as huge pressure on the national health care systems. Over 4% of the global population are living with chronic viral infections, such as HBV and HCV (304 million people) and HIV-1 (40.8 million) [ 1 2 3 4 The lingering problems of viral persistence and oncogenicity were addressed by the international online conference “Chronic viral infections and cancer, openings for Vaccines and Cure” (VIRCAN2024) hosted by Riga Stradins University with the support from the Latvian Science Council grant “Human papillomavirus genome associated correlates of disease progression and treatment response for cervical neoplasms and cancer”, ( https://www.rsu.lv/en/project/human-papillomavirus-genome-associated-correlates-disease-progression-and-treatment https://www.rsu.lv/en/vac-vac-2022 https://www.mdpi.com/journal/vaccines/special_issues/FH7P87X1J4 The VIRCAN2024 Conference gathered nearly 80 participants from 9 countries, including the Czech Republic, France, India, Italy, Latvia, Uganda, Ukraine, Sweden, and the USA. It covered the topics of viral infections which cause cancer, course and outcome of chronic viral infections, and innovations in the viral infection treatment, screening and prevention by vaccination. The conference lasted for two days and was divided into three focused sessions. The first session “Common and Specific Mechanisms of Viral Oncogenicity”, covered topics related to the mechanisms of viral oncogenicity. The second session “Approaches to Chronic Viral Infection and Cancer Cure” focused on the vaccines and treatment for cancer and chronic viral infections. The third session was devoted to one of the most notorious oncogenic viruses, namely high-risk human papillomaviruses (HPV)–“Human Papillomavirus, Chronic Infection and Associated Cancers, on the Way to Protection”. Conference participants with the status of early career researcher (35 years and younger) had the opportunity to participate in the “Early Career Researcher Contest”, with the winners being awarded monetary rewards, and two best presenters, with the vouchers for publication of their data in the special issue of the scientific journal “Vaccines” dedicated to the conference “ Chronic Viral Infections and Cancer: Openings for Vaccines and Cure https://www.mdpi.com/journal/vaccines/special_issues/PD0W1PZ6L6 Conference was opened by the lecture by Dr. Elena Kashuba DNA Tumor Viruses and Their Role in the Development of Epithelial Tumors 2. Common and Specific Mechanisms of Viral Oncogenicity The first session of the conference hosted four plenary lectures and eight oral presentations, with four of them made by the early-career researchers. The session had three sections: [1] Molecular drivers of malignant transformation; [2] Metabolic signatures of chronic viral infections & cancer; [3] Immune response in chronic viral infections and cancer (Inflammation & Immune Evasion), each opened by the invited plenary lecture from the prominent researchers leading the corresponding field. 2.1. Molecular Drivers of Malignant Transformation The section was chaired by Dr. Elena Kashuba and was opened by a plenary lecture presented by Dr Maria Lina Tornesello Mechanisms of Telomerase Reverse Transcriptase Reactivation in Cancer 5 5 6 7 8 9 The next talk “ Role of Voltage Dependent Anion Channels in the HBV Life Cycle Pierre-Louis Schmit-Vergely 2+ 10 11 12 13 14 15 16 17 18 Next talk titled “ HTLV-1C lung disease linked to p16 protein inhibition of efferocytosis in macaques Sarkis Sarkis 19 20 21 orf-I orf-I orf-I 22 23 24 orf-I orf-I orfs II III IV + Dr. Irina Kholodnyuk EBV infection in treatment-naïve patients with chronic lymphocytic leukemia and mobility of the leukemic cells 25 26 27 28 29 30 31 2.2. Metabolic Signatures of Chronic Viral Infections & Cancer This second section was chaired by Dr. Juris Jansons (Latvian Biomedical Research and Study Centers, and Riga Stradins University, Riga, Latvia). It was opened by a plenary lecture “ Metabolic Changes in Viral Infections Ujjwal Neogi 32 33 34 The next presentation “ Viral replication capacity influences HIV-1-induced metabolic and cytokine reprogramming of T Cells Omolara Baiyegunhi 35 36 37 The final talk of the section continued on the topic of HIV. Dr. Alejandra Escós Disrupted alpha-ketoglutarate homeostasis trained monocyte-derived macrophages towards M2-like phenotype increase HIV infectivity in treated infection 38 2.3. Immune Response in Chronic Viral Infections and Cancer (Inflammation & Immune Evasion) The third section of the conference was chaired by Dr. Irina Kholodnyuk (Riga Stradins University) and was opened by the plenary lecture from tenure “ Immune Response in SARS-CoV-2 Infection, Inflammation, and Cancer Immune Evasion and Tumor Progression Dace Pjanova 39 40 41 42 43 44 45 Continuing the topic of COVID-19 association with oncogenesis, one of the Early Career Researchers, Ganna Monchakivska Influence of the COVID-19 disease on the course of Chronic lymphocytic leukemia Another Early Career Researcher Enkhtuul Batbold CCL5 is upregulated and secreted by HDV independently of the IFN response 46 47 48 49 50 51 The next speaker Dr Larysa Kovalevska Identification of the “missing” transcription factors in Chronic leukocytic leukemia B-cells 3. Approaches to Chronic Viral Infection and Cancer Cure The second session of the conference had one plenary lecture and four oral presentations and was chaired by Prof. Franco Maria Buonaguro (National Cancer Institute, Naples, Italy). The session was opened by the plenary lecture “ HBV Vaccination–Success and Barriers to Achieve Eradication Drs Isabelle Chemin Boun Kim Tan 52 53 54 Next speaker, Dr. Ratna Ray Bitter Melon’s Sweet Promise: Role in Oral Cancer Therapy Momordica charantia 55 56 57 58 Continuing on the topic of oral cancers, Dr. Subhayan Sur Exploring the Role of Long Non-Coding RNA in Oral Squamous Cell Carcinoma Development and Therapy 59 60 61 62 63 Dr. Anna Zajakina Viral Vectors and Photosensitive Drugs as Immunomodulators in Cancer Treatment 64 65 66 67 68 The final talk of the session–“Vaccine and SAMT-247 continuous released by intravaginal ring (IVR) decreased risk of SIV acquisition in macaque”, was presented by Dr. Mohammad Arif Rahman (Animal Models and Retroviral Vaccines Section, National Cancer Institute, Bethesda, MD, USA). For years, researchers around the world have tried to develop HIV vaccines. Among the many clinical trials conducted, only one–RV144 (ALVAC) showed a marked vaccine efficacy of 31.2% [ 69 70 71 72 73 73 74 4. Human Papillomavirus, Chronic Infection & Associated Cancers, on the Way to Protection The third and final session of the conference had four plenary lectures and ten oral presentations, with six of them by the early-career researchers. The session was divided into four sections: (1) Epidemiology & Risk Factors; (2) Mechanisms of HPV-associated Carcinogenesis; (3) HPV Infection & Cancer Surveys; (4) Prophylactic and Therapeutic HPV Vaccines & their Implementation. 4.1. Epidemiology & Risk Factors The first section was chaired by Dr. Edward Kumakech (Lira University, Lira Uganda) and was opened by a plenary lecture from Prof. Anda Kivite-Urtane Epidemiology of Infection with High Risk HPVs, Risk Factors in Different Population Groups 75 76 77 76 The next three presentations were from the Early-career researchers. Firstly, Viola Daniela Kiselova Sociodemographic and general health factor association with high-risk human papilloma virus infection in a prospective study of females residing in Riga, Latvia Justine Grundmane Human Papilloma Virus Genotype Distribution Among Young Women in Latvia with Pathological Findings in Cervical Cytology 78 The final early-career researcher presentation of this section continued on the topic of HPV genotype prevalence with a talk titled “ Shift in High-Risk HPV Genotypes in Cervical Lesions in Latvia Liba Sokolovska 79 80 81 4.2. Mechanisms of HPV-Associated Carcinogenesis The second section in the HPV session was chaired by Dr. Maria Isaguliants (Riga Stradins University, and Karolinska Institutet, Stockholm, Sweden) and was opened by the plenary lecture from Prof. Franco Maria Buonaguro HPV-Driven Mucosal Carcinogenesis 82 83 The next two topics were presented by the Early-Career Researchers. The first titled “ HPV16 up-regulates the expression of RNA-binding protein Sam68 in head and neck cancers Andrea Cerasuolo 84 85 86 87 88 89 The second “ Complete genome analysis of the human papillomavirus type 16 (HPV16) isolates from cervical carcinomas in Latvia Nikita Zrelovs 90 n n 91 92 93 94 95 The section was closed by the presentation “ Characteristics of the Oncoproteins E6 and E7 of HPV16 Isolates Circulating in Europe with Focus on the Baltic Region Juris Jansons 96 97 4.3. HPV Infection & Cancer Surveys The third section was chaired by Dr. Vanja Berggren (Karolinska Institutet, Stockholm, Sweden) and was opened by the plenary lecture “ HPV Infection: Present and Future of Diagnostic and Prognostic Surveys Ruth Tachezy 98 99 100 101 102 103 104 105 106 107 108 In the next talk, Deborah Holzapfel Detection of Human Papillomavirus (HPV) Nucleic Acid in FFPE Samples with AMPIVIEW ® ® ® Last of the Early-Career researcher presentations on the conference “ High risk HPV positive cervical squamous cell carcinomas: correlation of tumor grades with virus load and expression of p16, p53 and Ki67 Dr. Karina Biserova 109 110 111 The section was closed by the presentation “ Design and expression of HPV16 oncoproteins E6 and E7 for the dynamic analysis of the levels of specific serum antibodies in women with and without cervical lesions Dr. Maria Isaguliants 112 113 114 E. coli 4.4. Prophylactic and Therapeutic HPV Vaccines & Their Implementation The fourth and final section of the session, chaired by Dr. Maria Isaguliants, was opened by the presentation “ Public and Patient Engagements to Improve Uptake of Cervical Screening and HPV Vaccination in Developing Countries–the Case of Uganda Dr. Edward Kumakech Dr. Vanja Berggren 5. Early-Career Researchers Contest A commission of five researchers from different countries, and in different categories, from the early career researchers to distinguished professors assessed all presentations by the early career researchers in six categories: 1. Originality of research goal/aims; 2. Study design/Planning of the experiments; 3. Quality of obtained data including graphical presentation; 4. Novelty and significance of the results; 5. Overall quality of presentation, presentation skills; 6. Quality of abstract-reflection of study design, experimental part, results, discussion. Evaluation was done by giving points from “1” (the lowest) to “5” (the highest), summarizing points across the categories, and dividing by the number of reviewers. Not all reviewers assessed all presentations, some were excluded from reviewing due to the conflict of interest. The 1st prize for the best presentation and voucher for publication in the Special Issue of “VACCINES” was awarded to Dr Nikita Zrelov for his presentation “ Complete genome analysis of the human papillomavirus type 16 (HPV16) isolates from cervical carcinomas in Latvia Enkhtuul Batbold CCL5 is upregulated and secreted by HDV independently of the IFN response Omolara Baiyegunhi Viral replication capacity influences HIV-1-induced metabolic and cytokine reprogramming of T Cells Thus, thanks to the support from VACCINES (MDPI), early-career researchers got an opportunity to impress a panel of international experts with their research prowess and through promoted publications, attract attention to their research by the broad research community. 6. Conclusions and Remarks Virus-associated cancers are major contributors to global morbidity and mortality, and researchers and clinicians worldwide are actively working towards a better understanding of virus and infection biology, identification of prognostic and predictive biomarkers, as well as new prophylactic and therapeutic approaches. The VIRCAN2024 conference gathered experts, clinicians, and scientists working on various oncogenic viruses, allowing them to exchange results and foster knowledge exchange. Acknowledgments We would like to thank Riga Stradins University, Riga, Latvia, specifically our collegues Jule Mare Rozite, Andris Brugis, Alise Ozola, and Aigars Cervinskis, for the help in organization and management of the event, and of all associated activities. The scientific journal VACCINES (MDPI) is acknowledged for the support of the early career researchers contest and dissemination of the conference materials. Disclaimer/Publisher’s Note: Author Contributions Writing—Original Draft Preparation: L.S.; Writing—Review & Editing; L.S., J.J., F.M.B. and M.I.; Supervision: M.I.; Project Administration: M.I. and J.J.; Funding Acquisition: M.I. All authors have read and agreed to the published version of the manuscript. Conflicts of Interest The authors declare no conflicts of interest. References 1. Hepatitis Available online: https://www.who.int/data/gho/data/themes/chronic-viral-hepatitis?utm_source (accessed on 19 August 2025) 2. Global HIV & AIDS Statistics—Fact Sheet|UNAIDS Available online: https://www.unaids.org/en/resources/fact-sheet?utm_source (accessed on 19 August 2025) 3. Xiao Q. Liu Y. Li T. Wang C. He S. Zhai L. Yang Z. Zhang X. Wu Y. Liu Y. Viral oncogenesis in cancer: From mechanisms to therapeutics Signal Transduct. Target. Ther. 2025 10 151 10.1038/s41392-025-02197-9 40350456 PMC12066790 4. Bencina G. Oliver E. Meiwald A. Hughes R. Morais E. Weston G. Sundström K. Global burden and economic impact of vaccine-preventable cancer mortality J. Med. Econ. 2024 27 (Suppl. 2) 9 19 10.1080/13696998.2024.2350877 38721643 5. Tornesello M.L. Cerasuolo A. Starita N. Amiranda S. Bonelli P. Tuccillo F.M. Buonaguro F.M. Buonaguro L. Tornesello A.L. Reactivation of telomerase reverse transcriptase expression in cancer: The role of TERT promoter mutations Front. Cell Dev. Biol. 2023 11 1286683 10.3389/fcell.2023.1286683 38033865 PMC10684755 6. Annunziata C. Pezzuto F. Greggi S. Ionna F. Losito S. Botti G. Buonaguro L. Buonaguro F.M. Tornesello M.L. Distinct profiles of TERT promoter mutations and telomerase expression in head and neck cancer and cervical carcinoma Int. J. Cancer 2018 143 1153 1161 10.1002/ijc.31412 29603728 7. Starita N. Buonaguro L. Buonaguro F.M. Tornesello M.L. Telomerase promoter mutations in human immunodeficiency virus-related conjunctiva neoplasia J. Transl. Med. 2018 16 77 10.1186/s12967-018-1456-0 29562930 PMC5861639 8. Starita N. Pezzuto F. Sarno S. Losito N.S. Perdonà S. Buonaguro L. Buonaguro F.M. Tornesello M.L. Mutations in the telomerase reverse transcriptase promoter and PIK3CA gene are common events in penile squamous cell carcinoma of Italian and Ugandan patients Int. J. Cancer 2022 150 1879 1888 10.1002/ijc.33990 35253909 PMC9310576 9. Tornesello M.L. Tornesello A.L. Starita N. Cerasuolo A. Izzo F. Buonaguro L. Buonaguro F.M. Telomerase: A good target in hepatocellular carcinoma? An overview of relevant preclinical data Expert Opin. Ther. Targets 2022 26 767 780 10.1080/14728222.2022.2147062 36369706 10. Takada S. Shirakata Y. Kaneniwa N. Koike K. Association of hepatitis B virus X protein with mitochondria causes mitochondrial aggregation at the nuclear periphery, leading to cell death Oncogene 1999 18 6965 6973 10.1038/sj.onc.1203188 10597295 11. Lee Y.I. Hwang J.M. Im J.H. Lee Y.I. Kim N.S. Kim D.G. Yu D.Y. Moon H.B. Park S.K. Human hepatitis B virus-X protein alters mitochondrial function and physiology in human liver cells J. Biol. Chem. 2004 279 15460 15471 10.1074/jbc.M309280200 14724286 12. Clippinger A.J. Bouchard M.J. Hepatitis B Virus HBx Protein Localizes to Mitochondria in Primary Rat Hepatocytes and Modulates Mitochondrial Membrane Potential J. Virol. 2008 82 6798 6811 10.1128/JVI.00154-08 18448529 PMC2446973 13. Mao Y. Da L. Tang H. Yang J. Lei Y. Tiollais P. Li T. Zhao M. Hepatitis B virus X protein reduces starvation-induced cell death through activation of autophagy and inhibition of mitochondrial apoptotic pathway Biochem. Biophys. Res. Commun. 2011 415 68 74 10.1016/j.bbrc.2011.10.013 22020078 14. Casciano J.C. Bouchard M.J. Hepatitis B virus X protein modulates cytosolic Ca 2+ Virus Res. 2018 246 23 27 10.1016/j.virusres.2018.01.001 29307794 15. Mansouri A. Gattolliat C.H. Asselah T. Mitochondrial Dysfunction and Signaling in Chronic Liver Diseases Gastroenterology 2018 155 629 647 10.1053/j.gastro.2018.06.083 30012333 16. Rahmani Z. Huh K.W. Lasher R. Siddiqui A. Hepatitis B virus X protein colocalizes to mitochondria with a human voltage-dependent anion channel, HVDAC3, and alters its transmembrane potential J. Virol. 2000 74 2840 2846 10.1128/JVI.74.6.2840-2846.2000 10684300 PMC111774 17. Camara A.K.S. Zhou Y. Wen P.C. Tajkhorshid E. Kwok W.M. Mitochondrial VDAC1: A Key Gatekeeper as Potential Therapeutic Target Front. Physiol. 2017 8 460 10.3389/fphys.2017.00460 28713289 PMC5491678 18. Duponchel S. Monnier L. Molle J. Bendridi N. Alam M.R. Gaballah A. Grigorov B. Ivanov A. Schmiel M. Odenthal M. Hepatitis C virus replication requires integrity of mitochondria-associated ER membranes JHEP Rep. 2023 5 100647 10.1016/j.jhepr.2022.100647 36718430 PMC9883273 19. Gessain A. Cassar O. Epidemiological Aspects and World Distribution of HTLV-1 Infection Front. Microbiol. 2012 3 388 10.3389/fmicb.2012.00388 23162541 PMC3498738 20. Einsiedel L. Pham H. Wilson K. Walley R. Turpin J. Bangham C. Gessain A. Woodman R.J. Human T-Lymphotropic Virus type 1c subtype proviral loads, chronic lung disease and survival in a prospective cohort of Indigenous Australians PLoS Negl. Trop. Dis. 2018 12 e0006281 10.1371/journal.pntd.0006281 29529032 PMC5874075 21. Einsiedel L. Pham H. Talukder M.R. Taylor K. Wilson K. Kaldor J. Gessain A. Woodman R. Very high prevalence of infection with the human T cell leukaemia virus type 1c in remote Australian Aboriginal communities: Results of a large cross-sectional community survey PLoS Negl. Trop. Dis. 2021 15 e0009915 10.1371/journal.pntd.0009915 34879069 PMC8654171 22. Sarkis S. Galli V. Moles R. Yurick D. Khoury G. Purcell D.F.J. Franchini G. Pise-Masison C.A. Role of HTLV-1 orf-I encoded proteins in viral transmission and persistence Retrovirology 2019 16 43 10.1186/s12977-019-0502-1 31852543 PMC6921521 23. Valeri V.W. Hryniewicz A. Andresen V. Jones K. Fenizia C. Bialuk I. Chung H.K. Fukumoto R. Parks R.W. Ferrari M.G. Requirement of the human T-cell leukemia virus p12 and p30 products for infectivity of human dendritic cells and macaques but not rabbits Blood 2010 116 3809 3817 10.1182/blood-2010-05-284141 20647569 PMC2981536 24. Gutowska A. Sarkis S. Rahman M.A. Goldfarbmuren K.C. Moles R. Bissa M. Doster M. Washington-Parks R. McKinnon K. Silva de Castro I. Complete Rescue of HTLV-1p12KO Infectivity by Depletion of Monocytes Together with NK and CD8+ T Cells Pathogens 2024 13 292 10.3390/pathogens13040292 38668247 PMC11054408 25. Kipps T.J. Stevenson F.K. Wu C.J. Croce C.M. Packham G. Wierda W.G. O’Brien S. Gribben J. Rai K. Chronic lymphocytic leukaemia Nat. Rev. Dis. Primer 2017 3 16096 10.1038/nrdp.2016.96 PMC5336551 28102226 26. Grywalska E. Roliński J. Pasiarski M. Korona-Glowniak I. Maj M. Surdacka A. Grafka A. Stelmach-Gołdyś A. Zgurski M. Góźdź S. High Viral Loads of Epstein-Barr Virus DNA in Peripheral Blood of Patients with Chronic Lymphocytic Leukemia Associated with Unfavorable Prognosis PLoS ONE 2015 10 e0140178 10.1371/journal.pone.0140178 26460692 PMC4603951 27. Visco C. Falisi E. Young K.H. Pascarella M. Perbellini O. Carli G. Novella E. Rossi D. Giaretta I. Cavallini C. Epstein-Barr virus DNA load in chronic lymphocytic leukemia is an independent predictor of clinical course and survival Oncotarget 2015 6 18653 18663 10.18632/oncotarget.4418 26087198 PMC4621917 28. Liang J.H. Gao R. Xia Y. Gale R.P. Chen R.Z. Yang Y.Q. Wang L. Qu X.-Y. Qiu H.-R. Cao L. Prognostic impact of Epstein-Barr virus (EBV)-DNA copy number at diagnosis in chronic lymphocytic leukemia Oncotarget 2016 7 2135 2142 10.18632/oncotarget.6281 26539641 PMC4811522 29. Kholodnyuk I. Rudevica Z. Leonciks A. Ehlin-Henriksson B. Kashuba E. Expression of the chemokine receptors CCR1 and CCR2B is up-regulated in peripheral blood B cells upon EBV infection and in established lymphoblastoid cell lines Virology 2017 512 1 7 10.1016/j.virol.2017.08.034 28892735 30. Kozireva S. Rudevica Z. Baryshev M. Leonciks A. Kashuba E. Kholodnyuk I. Upregulation of the Chemokine Receptor CCR2B in Epstein-Barr Virus-Positive Burkitt Lymphoma Cell Lines with the Latency III Program Viruses 2018 10 239 10.3390/v10050239 29751565 PMC5977232 31. Zvejniece L. Kozireva S. Rudevica Z. Leonciks A. Ehlin-Henriksson B. Kashuba E. Kholodnyuk I. Expression of the Chemokine Receptor CCR1 in Burkitt Lymphoma Cell Lines Is Linked to the CD10-Negative Cell Phenotype and Co-Expression of the EBV Latent Genes EBNA2, LMP1, and LMP2 Int. J. Mol. Sci. 2022 23 3434 10.3390/ijms23073434 35408790 PMC8998437 32. Ambikan A. Akusjärvi S.S. Sperk M. Neogi U. System-level integrative omics analysis to identify the virus-host immunometabolic footprint during infection Adv. Immunol. 2024 164 73 100 39523029 10.1016/bs.ai.2024.08.002 33. Rajaiah R. Pandey K. Acharya A. Ambikan A. Kumar N. Guda R. Avedissian S.N. Montaner L.J. Cohen S.M. Neogi U. Differential immunometabolic responses to Delta and Omicron SARS-CoV-2 variants in golden syrian hamsters iScience 2024 27 110501 10.1016/j.isci.2024.110501 39171289 PMC11338146 34. Kaur Sardarni U. Ambikan A.T. Acharya A. Johnson S.D. Avedissian S.N. Végvári Á. Neogi U. Byrareddy S.N. SARS-CoV-2 variants mediated tissue-specific metabolic reprogramming determines the disease pathophysiology in a hamster model Brain. Behav. Immun. 2025 123 914 927 10.1016/j.bbi.2024.10.032 39481495 PMC12165279 35. Kariuki S.M. Selhorst P. Ariën K.K. Dorfman J.R. The HIV-1 transmission bottleneck Retrovirology 2017 14 22 10.1186/s12977-017-0343-8 28335782 PMC5364581 36. Chohan B. Lavreys L. Rainwater S.M.J. Overbaugh J. Evidence for Frequent Reinfection with Human Immunodeficiency Virus Type 1 of a Different Subtype J. Virol. 2005 79 10701 10708 10.1128/JVI.79.16.10701-10708.2005 16051862 PMC1182664 37. Selhorst P. Combrinck C. Ndabambi N. Ismail S.D. Abrahams M.R. Lacerda M. Samsunder N. Garrett N. Abdool Karim Q. Abdool Karim S.S. Replication Capacity of Viruses from Acute Infection Drives HIV-1 Disease Progression J. Virol. 2017 91 e01806-16 10.1128/JVI.01806-16 28148791 PMC5375681 38. Palmer C.S. Innate metabolic responses against viral infections Nat. Metab. 2022 4 1245 1259 10.1038/s42255-022-00652-3 36266542 39. Hwang C. Izano M.A. Thompson M.A. Gadgeel S.M. Weese J.L. Mikkelsen T. Schrag A. Teka M. Walters S. Wolf F.M. Rapid real-world data analysis of patients with cancer, with and without COVID-19, across distinct health systems Cancer Rep. 2021 4 e1388 10.1002/cnr2.1388 PMC8209944 34014037 40. Grivennikov S.I. Greten F.R. Karin M. Immunity, Inflammation, and Cancer Cell 2010 140 883 899 10.1016/j.cell.2010.01.025 20303878 PMC2866629 41. Craddock V. Mahajan A. Spikes L. Krishnamachary B. Ram A.K. Kumar A. Chen L. Chalise P. Dhillon N.K. Persistent circulation of soluble and extracellular vesicle-linked Spike protein in individuals with postacute sequelae of COVID-19 J. Med. Virol. 2023 95 e28568 10.1002/jmv.28568 36756925 PMC10048846 42. Forsyth C.B. Zhang L. Bhushan A. Swanson B. Zhang L. Mamede J.I. Voigt R.M. Shaikh M. Engen P.A. Keshavarzian A. The SARS-CoV-2 S1 Spike Protein Promotes MAPK and NF-kB Activation in Human Lung Cells and Inflammatory Cytokine Production in Human Lung and Intestinal Epithelial Cells Microorganisms 2022 10 1996 10.3390/microorganisms10101996 36296272 PMC9607240 43. Suzuki Y.J. Nikolaienko S.I. Dibrova V.A. Dibrova Y.V. Vasylyk V.M. Novikov M.Y. Shults N.V. Gychka S.G. SARS-CoV-2 spike protein-mediated cell signaling in lung vascular cells Vascul. Pharmacol. 2021 137 106823 10.1016/j.vph.2020.106823 33232769 PMC7680014 44. Faist A. Schloer S. Mecate-Zambrano A. Janowski J. Schreiber A. Boergeling Y. Conrad B.C.G. Kumar S. Toebben L. Schughart K. Inhibition of p38 signaling curtails the SARS-CoV-2 induced inflammatory response but retains the IFN-dependent antiviral defense of the lung epithelial barrier Antivir. Res. 2023 209 105475 10.1016/j.antiviral.2022.105475 36423831 PMC9677559 45. Nguyen H.N.T. Kawahara M. Vuong C.K. Fukushige M. Yamashita T. Ohneda O. SARS-CoV-2 M Protein Facilitates Malignant Transformation of Breast Cancer Cells Front. Oncol. 2022 12 923467 10.3389/fonc.2022.923467 35747796 PMC9209714 46. Global Hepatitis Report 2024: Action for Access in Low- and Middle-Income Countries Available online: https://www.who.int/publications/i/item/9789240091672 (accessed on 29 July 2025) 47. Rumgay H. Arnold M. Ferlay J. Lesi O. Cabasag C.J. Vignat J. Laversanne M. McGlynn K.A. Soerjomataram I. Global burden of primary liver cancer in 2020 and predictions to 2040 J. Hepatol. 2022 77 1598 1606 10.1016/j.jhep.2022.08.021 36208844 PMC9670241 48. Asselah T. Rizzetto M. Hepatitis D Virus Infection N. Engl. J. Med. 2023 389 58 70 10.1056/NEJMra2212151 37407002 49. Razavi-Shearer D. Child H. Razavi-Shearer K. Voeller A. Razavi H. Buti M. Tacke F. Terrault N. Zeuzem S. Abbas Z. Adjusted estimate of the prevalence of hepatitis delta virus in 25 countries and territories J. Hepatol. 2024 80 232 242 10.1016/j.jhep.2023.10.043 38030035 50. Torrens L. Puigvehí M. Torres-Martín M. Wang H. Maeda M. Haber P.K. Leonel T. García-López M. Esteban-Fabró R. Leow W.Q. Hepatocellular carcinoma in Mongolia delineates unique molecular traits and a mutational signature associated with environmental agents Clin. Cancer Res. Off. J. Am. Assoc. Cancer Res. 2022 28 4509 4520 10.1158/1078-0432.CCR-22-0632 35998012 PMC7613712 51. Montironi C. Castet F. Haber P.K. Pinyol R. Torres-Martin M. Torrens L. Mesropian A. Wang H. Puigvehi M. Maeda M. Inflamed and non-inflamed classes of HCC: A revised immunogenomic classification Gut 2023 72 129 140 10.1136/gutjnl-2021-325918 35197323 PMC9395551 52. Chan S.L. Sun H.C. Xu Y. Zeng H. El-Serag H.B. Lee J.M. Schwartz M.E. Finn R.S. Seong J. Wang X.W. The Lancet Commission on addressing the global hepatocellular carcinoma burden: Comprehensive strategies from prevention to treatment Lancet 2025 406 731 778 10.1016/S0140-6736(25)01042-6 40744051 53. Bsisu I. Rmilah A.A. Global Elimination of Chronic Hepatitis N. Engl. J. Med. 2019 381 589 590 10.1056/NEJMc1908197 31390514 54. Liu T. Wang H. Zhao Y. Wang Y.X. Xing X. Gao P. Drug development for chronic hepatitis B functional cure: Recent progress World J. Hepatol. 2025 17 105797 10.4254/wjh.v17.i4.105797 40308829 PMC12038417 55. Sur S. Steele R. Aurora R. Varvares M. Schwetye K.E. Ray R.B. Bitter Melon Prevents the Development of 4-NQO-Induced Oral Squamous Cell Carcinoma in an Immunocompetent Mouse Model by Modulating Immune Signaling Cancer Prev. Res. 2018 11 191 202 10.1158/1940-6207.CAPR-17-0237 29061560 PMC5882513 56. Bhattacharya S. Muhammad N. Steele R. Peng G. Ray R.B. Immunomodulatory role of bitter melon extract in inhibition of head and neck squamous cell carcinoma growth Oncotarget 2016 7 33202 33209 10.18632/oncotarget.8898 27120805 PMC5078086 57. Bhattacharya S. Muhammad N. Steele R. Kornbluth J. Ray R.B. Bitter Melon Enhances Natural Killer-Mediated Toxicity against Head and Neck Cancer Cells Cancer Prev. Res. 2017 10 337 344 10.1158/1940-6207.CAPR-17-0046 PMC5499682 28465362 58. Sur S. Steele R. Isbell T.S. Venkata K.N. Rateb M.E. Ray R.B. Momordicine-I, a Bitter Melon Bioactive Metabolite, Displays Anti-Tumor Activity in Head and Neck Cancer Involving c-Met and Downstream Signaling Cancers 2021 13 1432 10.3390/cancers13061432 33801016 PMC8003975 59. Qian Y. Shi L. Luo Z. Long Non-coding RNAs in Cancer: Implications for Diagnosis, Prognosis, and Therapy Front. Med. 2020 7 612393 10.3389/fmed.2020.612393 PMC7734181 33330574 60. Uppaluri K.R. Challa H.J. Gaur A. Jain R. Krishna Vardhani K. Geddam A. Natya K. Aswini K. Palasamudram K. Manjari K S. Unlocking the potential of non-coding RNAs in cancer research and therapy Transl. Oncol. 2023 35 101730 10.1016/j.tranon.2023.101730 37406550 PMC10366642 61. Uribe M.L. Marrocco I. Yarden Y. EGFR in Cancer: Signaling Mechanisms, Drugs, and Acquired Resistance Cancers 2021 13 2748 10.3390/cancers13112748 34206026 PMC8197917 62. Sur S. Nakanishi H. Steele R. Zhang D. Varvares M.A. Ray R.B. Long non-coding RNA ELDR enhances oral cancer growth by promoting ILF3-cyclin E1 signaling EMBO Rep. 2020 21 e51042 10.15252/embr.202051042 33043604 PMC7726807 63. Sur S. Steele R. Ko B.C.B. Zhang J. Ray R.B. Long noncoding RNA ELDR promotes cell cycle progression in normal oral keratinocytes through induction of a CTCF-FOXM1-AURKA signaling axis J. Biol. Chem. 2022 298 101895 10.1016/j.jbc.2022.101895 35378133 PMC9079251 64. Spunde K. Korotkaja K. Zajakina A. Recombinant Viral Vectors for Therapeutic Programming of Tumour Microenvironment: Advantages and Limitations Biomedicines 2022 10 2142 10.3390/biomedicines10092142 36140243 PMC9495732 65. Yin S. Wang N. Riabov V. Mossel D.M. Larionova I. Schledzewski K. Trofimova O. Sevastyanova T. Zajakina A. Schmuttermaier C. SI-CLP inhibits the growth of mouse mammary adenocarcinoma by preventing recruitment of tumor-associated macrophages Int. J. Cancer 2020 146 1396 1408 10.1002/ijc.32685 31525266 66. Trofimova O. Korotkaja K. Skrastina D. Jansons J. Spunde K. Isaguliants M. Zajakina A. Alphavirus-Driven Interferon Gamma (IFNg) Expression Inhibits Tumor Growth in Orthotopic 4T1 Breast Cancer Model Vaccines 2021 9 1247 10.3390/vaccines9111247 34835178 PMC8620866 67. Hua J. Wu P. Gan L. Zhang Z. He J. Zhong L. Zhao Y. Huang Y. Current Strategies for Tumor Photodynamic Therapy Combined With Immunotherapy Front. Oncol. 2021 11 738323 10.3389/fonc.2021.738323 34868932 PMC8635494 68. Hak A. Ali M.S. Sankaranarayanan S.A. Shinde V.R. Rengan A.K. Chlorin e6: A Promising Photosensitizer in Photo-Based Cancer Nanomedicine ACS Appl. Bio Mater. 2023 6 349 364 10.1021/acsabm.2c00891 36700563 69. Rerks-Ngarm S. Pitisuttithum P. Nitayaphan S. Kaewkungwal J. Chiu J. Paris R. Premsri N. Namwat C. de Souza M. Adams E. Vaccination with ALVAC and AIDSVAX to Prevent HIV-1 Infection in Thailand N. Engl. J. Med. 2009 361 2209 2220 10.1056/NEJMoa0908492 19843557 70. Vaccari M. Gordon S.N. Fourati S. Schifanella L. Liyanage N.P.M. Cameron M. Keele B.F. Shen X. Tomaras G.D. Billings E. Adjuvant-dependent innate and adaptive immune signatures of risk of SIVmac251 acquisition Nat. Med. 2016 22 762 770 10.1038/nm.4105 27239761 PMC5916782 71. Gorini G. Fourati S. Vaccari M. Rahman M.A. Gordon S.N. Brown D.R. Law L. Chang J. Green R. Barrenäs F. Engagement of monocytes, NK cells, and CD4+ Th1 cells by ALVAC-SIV vaccination results in a decreased risk of SIVmac251 vaginal acquisition PLoS Pathog. 2020 16 e1008377 10.1371/journal.ppat.1008377 32163525 PMC7093029 72. Silva de Castro I. Gorini G. Mason R. Gorman J. Bissa M. Rahman M.A. Arakelyan A. Kalisz I. Whitney S. Becerra-Flores M. Anti-V2 antibodies virus vulnerability revealed by envelope V1 deletion in HIV vaccine candidates iScience 2021 24 102047 10.1016/j.isci.2021.102047 33554060 PMC7847973 73. Rahman M.A. Bissa M. Silva de Castro I. Helmold Hait S. Stamos J.D. Bhuyan F. Hunegnaw R. Sarkis S. Gutowska A. Doster M.N. Vaccine plus microbicide effective in preventing vaginal SIV transmission in macaques Nat. Microbiol. 2023 8 905 918 10.1038/s41564-023-01353-7 37024617 PMC10159859 74. Hait S.H. Hogge C.J. Rahman M.A. Ko E.J. Hunegnaw R. Mushtaq Z. Enyindah-Asonye G. Hoang T. Jenkins L.M.M. Appella E. A SAMT-247 microbicide provides potent protection against intravaginal SIV infection of rhesus macaques while an added vaccine component elicits mixed outcomes J. Immunol. 2020 204 3315 3328 10.4049/jimmunol.2000165 32393514 PMC7392472 75. OECD European Commission EU Country Cancer Profile: Latvia 2025 OECD Publishing Paris, France 2025 Available online: https://www.oecd.org/en/publications/eu-country-cancer-profile-latvia-2025_f23ce73c-en.html (accessed on 25 July 2025) 76. Bruni L. Albero G. Mena M. Collado J. Gomez D. Munoz J. Bosch F. de Sanjose S. Human Papillomavirus and Related Diseases Report. Human Papillomavirus and Related Diseases in the World 2023 Mar Available online: https://hpvcentre.net/statistics/reports/XWX.pdf (accessed on 20 July 2025) 77. Berza N. Zodzika J. Kivite-Urtane A. Baltzer N. Curkste A. Pole I. Nygård M. Pärna K. Stankunas M. Tisler A. Understanding the high-risk human papillomavirus prevalence and associated factors in the European country with a high incidence of cervical cancer Eur. J. Public Health 2024 34 826 832 10.1093/eurpub/ckae075 38822674 PMC11293828 78. Dzemdes Kakla Vēža Profilaktiskā Pārbaude|Slimību Profilakses un Kontroles Centrs Available online: https://www.spkc.gov.lv/lv/dzemdes-kakla-veza-profilaktiska-parbaude (accessed on 30 July 2025) 79. Silins I. Wang X. Tadesse A. Jansen K.U. Schiller J.T. Avall-Lundqvist E. Frankendal B. Dillner J. A population-based study of cervical carcinoma and HPV infection in Latvia Gynecol. Oncol. 2004 93 484 492 10.1016/j.ygyno.2004.01.044 15099967 80. Freire-Salinas J. Benito R. Azueta A. Gil J. Mendoza C. Nicolás M. García-Berbel P. Algarate S. Gómez-Román J. Genotype Distribution Change After Human Papillomavirus Vaccination in Two Autonomous Communities in Spain Front. Cell. Infect. Microbiol. 2021 11 633162 10.3389/fcimb.2021.633162 34631594 PMC8493034 81. Schlecht N.F. Diaz A. Nucci-Sack A. Shyhalla K. Shankar V. Guillot M. Hollman D. Strickler H.D. Burk R.D. Incidence and Types of Human Papillomavirus Infections in Adolescent Girls and Young Women Immunized With the Human Papillomavirus Vaccine JAMA Netw. Open 2021 4 e2121893 10.1001/jamanetworkopen.2021.21893 34424304 PMC8383132 82. Tornesello M.L. Annunziata C. Tornesello A.L. Buonaguro L. Buonaguro F.M. Human Oncoviruses and p53 Tumor Suppressor Pathway Deregulation at the Origin of Human Cancers Cancers 2018 10 213 10.3390/cancers10070213 29932446 PMC6071257 83. Tornesello M.L. Buonaguro F.M. Human Papillomavirus and Cancers Cancers 2020 12 3772 10.3390/cancers12123772 33333750 PMC7765250 84. Del Mistro A. Frayle H. Menegaldo A. Favaretto N. Gori S. Nicolai P. Spinato G. Romeo S. Tirelli G. da Mosto M.C. Age-independent increasing prevalence of Human Papillomavirus-driven oropharyngeal carcinomas in North-East Italy Sci. Rep. 2020 10 9320 10.1038/s41598-020-66323-z 32518378 PMC7283341 85. Fernández-Mateos J. Pérez-García J. Seijas-Tamayo R. Mesía R. Rubió-Casadevall J. García-Girón C. Iglesias L. Carral Maseda A. Adansa Klain J.C. Taberna M. Oncogenic driver mutations predict outcome in a cohort of head and neck squamous cell carcinoma (HNSCC) patients within a clinical trial Sci. Rep. 2020 10 16634 10.1038/s41598-020-72927-2 33024167 PMC7539152 86. Olmedo-Nieva L. Muñoz-Bello J.O. Contreras-Paredes A. Lizano M. The Role of E6 Spliced Isoforms (E6*) in Human Papillomavirus-Induced Carcinogenesis Viruses 2018 10 45 10.3390/v10010045 29346309 PMC5795458 87. Miller D.L. Puricelli M.D. Stack M.S. Virology and Molecular Pathogenesis of Human Papillomavirus (HPV)-Associated Oropharyngeal Squamous Cell Carcinoma Biochem. J. 2012 443 339 353 10.1042/BJ20112017 22452816 PMC3571652 88. Cerasuolo A. Buonaguro L. Buonaguro F.M. Tornesello M.L. The Role of RNA Splicing Factors in Cancer: Regulation of Viral and Human Gene Expression in Human Papillomavirus-Related Cervical Cancer Front. Cell Dev. Biol. 2020 8 474 10.3389/fcell.2020.00474 32596243 PMC7303290 89. Bradley R.K. Anczuków O. RNA splicing dysregulation and the hallmarks of cancer Nat. Rev. Cancer 2023 23 135 155 10.1038/s41568-022-00541-7 36627445 PMC10132032 90. Nelson C.W. Mirabello L. Human papillomavirus genomics: Understanding carcinogenicity Tumour Virus Res. 2023 15 200258 10.1016/j.tvr.2023.200258 36812987 PMC10063409 91. Liu Y. Pan Y. Gao W. Ke Y. Lu Z. Whole-Genome Analysis of Human Papillomavirus Types 16, 18, and 58 Isolated from Cervical Precancer and Cancer Samples in Chinese Women Sci. Rep. 2017 7 263 10.1038/s41598-017-00364-9 28325903 PMC5428204 92. Tsakogiannis D. Nikolaidis M. Zagouri F. Zografos E. Kottaridi C. Kyriakopoulou Z. Tzioga L. Markoulatos P. Amoutzias G.D. Bletsa G. Mutation Profile of HPV16 L1 and L2 Genes in Different Geographic Areas Viruses 2022 15 141 10.3390/v15010141 36680181 PMC9867070 93. Kahla S. Kochbati L. Hammami S. Chanoufi M.B. Maalej M. Oueslati R. Sequence Variation in the E2-Binding Domain of HPV16 and Biological Function Evaluation in Tunisian Cervical Cancers BioMed Res. Int. 2014 2014 639321 10.1155/2014/639321 25032221 PMC4083599 94. Yao Y. Yan Z. Dai S. Li C. Yang L. Liu S. Zhang X. Shi L. Yao Y. Human Papillomavirus Type 16 E1 Mutations Associated with Cervical Cancer in a Han Chinese Population Int. J. Med. Sci. 2019 16 1042 1049 10.7150/ijms.34279 31341418 PMC6643129 95. Kottaridi C. Resta P. Leventakou D. Gioti K. Zygouras I. Gouloumi A.R. Sakagiannis G. Alzahrani K.J. Venetikou M.S. Anthouli-Anagnostopoulou F. The T350G Variation of Human Papillomavirus 16 E6 Gene Prevails in Oropharyngeal Cancer from a Small Cohort of Greek Patients Viruses 2022 14 1724 10.3390/v14081724 36016346 PMC9415711 96. Ose N.J. Campitelli P. Modi T. Kazan I.C. Kumar S. Ozkan S.B. Some mechanistic underpinnings of molecular adaptations of SARS-COV-2 spike protein by integrating candidate adaptive polymorphisms with protein dynamics eLife 2024 12 RP92063 10.7554/eLife.92063.3 38713502 PMC11076047 97. Donlin M.J. Szeto B. Gohara D.W. Aurora R. Tavis J.E. Genome-Wide Networks of Amino Acid Covariances Are Common among Viruses J. Virol. 2012 86 3050 3063 10.1128/JVI.06857-11 22238298 PMC3302335 98. Vojtechova Z. Sabol I. Salakova M. Turek L. Grega M. Smahelova J. Vencalek O. Lukesova E. Klozar J. Tachezy R. Analysis of the integration of human papillomaviruses in head and neck tumours in relation to patients’ prognosis Int. J. Cancer 2016 138 386 395 10.1002/ijc.29712 26239888 99. Nunvar J. Pagacova L. Vojtechova Z. de Azevedo N.T.D. Smahelova J. Salakova M. Tachezy R. Lack of Conserved miRNA Deregulation in HPV-Induced Squamous Cell Carcinomas Biomolecules 2021 11 764 10.3390/biom11050764 34065237 PMC8160722 100. Vojtechova Z. Sabol I. Salakova M. Smahelova J. Zavadil J. Turek L. Grega M. Klozar J. Prochazka B. Tachezy R. Comparison of the miRNA profiles in HPV-positive and HPV-negative tonsillar tumors and a model system of human keratinocyte clones BMC Cancer 2016 16 382 10.1186/s12885-016-2430-y 27377959 PMC4932682 101. Vojtechova Z. Zavadil J. Klozar J. Grega M. Tachezy R. Comparison of the miRNA expression profiles in fresh frozen and formalin-fixed paraffin-embedded tonsillar tumors PLoS ONE 2017 12 e0179645 10.1371/journal.pone.0179645 28644855 PMC5482461 102. Božinović K. Sabol I. Dediol E. Milutin Gašperov N. Manojlović S. Vojtechova Z. Tachezy R. Grce M. Genome-wide miRNA profiling reinforces the importance of miR-9 in human papillomavirus associated oral and oropharyngeal head and neck cancer Sci. Rep. 2019 9 2306 10.1038/s41598-019-38797-z 30783190 PMC6381209 103. Pokrývková B. Grega M. Klozar J. Vencálek O. Nunvář J. Tachezy R. PD1+CD8+ Cells Are an Independent Prognostic Marker in Patients with Head and Neck Cancer Biomedicines 2022 10 2794 10.3390/biomedicines10112794 36359314 PMC9687997 104. Smahelova J. Pokryvkova B. Stovickova E. Grega M. Vencalek O. Smahel M. Koucky V. Malerova S. Klozar J. Tachezy R. Aspartate-β-hydroxylase and hypoxia marker expression in head and neck carcinomas: Implications for HPV-associated tumors Infect. Agent. Cancer 2024 19 26 10.1186/s13027-024-00588-1 38858774 PMC11163809 105. Chera B.S. Kumar S. Shen C. Amdur R. Dagan R. Green R. Goldman E. Weiss J. Grilley-Olson J. Patel S. Plasma Circulating Tumor HPV DNA for the Surveillance of Cancer Recurrence in HPV-Associated Oropharyngeal Cancer J. Clin. Oncol. Off. J. Am. Soc. Clin. Oncol. 2020 38 1050 1058 10.1200/JCO.19.02444 PMC7106982 32017652 106. O’Boyle C.J. Siravegna G. Varmeh S. Queenan N. Michel A. Pang K.C.S. Stein J. Thierauf J.C. Sadow P.M. Faquin W.C. Cell-free human papillomavirus DNA kinetics after surgery for human papillomavirus-associated oropharyngeal cancer Cancer 2022 128 2193 2204 10.1002/cncr.34109 35139236 PMC10032347 107. Warlow S.J. Adamowicz M. Thomson J.P. Wescott R.A. Robert C. Carey L.M. Thain H. Cuschieri K. Li L.Q. Conn B. Longitudinal measurement of HPV copy number in cell-free DNA is associated with patient outcomes in HPV-positive oropharyngeal cancer Eur. J. Surg. Oncol. J. Eur. Soc. Surg. Oncol. Br. Assoc. Surg. Oncol. 2022 48 1224 1234 10.1016/j.ejso.2022.03.232 35431082 108. Das D. Hirayama S. Aye L. Bryan M.E. Naegele S. Zhao B. Efthymiou V. Mendel J. Fisch A.S. Kröller L. Blood-based screening for HPV-associated cancers MedRxiv 2024 10.1101/2024.01.04.24300841 109. Andrés-Sánchez N. Fisher D. Krasinska L. Physiological functions and roles in cancer of the proliferation marker Ki-67 J. Cell Sci. 2022 135 jcs258932 10.1242/jcs.258932 35674256 110. Ouh Y.T. Kim H.Y. Yi K.W. Lee N.W. Kim H.J. Min K.J. Enhancing Cervical Cancer Screening: Review of p16/Ki-67 Dual Staining as a Promising Triage Strategy Diagnostics 2024 14 451 10.3390/diagnostics14040451 38396493 PMC10888225 111. Liu Y. Su Z. Tavana O. Gu W. Understanding the complexity of p53 in a new era of tumor suppression Cancer Cell 2024 42 946 967 10.1016/j.ccell.2024.04.009 38729160 PMC11190820 112. Singini M.G. Singh E. Bradshaw D. Ramaliba T. Chen W.C. Motlhale M. Kamiza A.B. Babb de Villiers C. Muchengeti M. Mathew C.G. Usefulness of high-risk HPV early oncoprotein (E6 and E7) serological markers in the detection of cervical cancer: A systematic review and meta-analysis J. Med. Virol. 2023 95 e27900 10.1002/jmv.27900 35641882 PMC10952611 113. Ewaisha R. Panicker G. Maranian P. Unger E.R. Anderson K.S. Serum Immune Profiling for Early Detection of Cervical Disease Theranostics 2017 7 3814 3823 10.7150/thno.21098 29109779 PMC5667406 114. Kreimer A.R. Johansson M. Waterboer T. Kaaks R. Chang-Claude J. Drogen D. Tjønneland A. Overvad K. Quirós J.R. González C.A. Evaluation of human papillomavirus antibodies and risk of subsequent head and neck cancer J. Clin. Oncol. Off. J. Am. Soc. Clin. Oncol. 2013 31 2708 2715 10.1200/JCO.2012.47.2738 23775966 PMC3709056 ",
  "metadata": {
    "Title of this paper": "Evaluation of human papillomavirus antibodies and risk of subsequent head and neck cancer",
    "Journal it was published in:": "Vaccines",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12474226/"
  }
}