{
  "title": "Paper_658",
  "abstract": "pmc Int J Mol Sci Int J Mol Sci 808 ijms ijms International Journal of Molecular Sciences 1422-0067 Multidisciplinary Digital Publishing Institute  (MDPI) PMC12469894 PMC12469894.1 12469894 12469894 41009442 10.3390/ijms26188874 ijms-26-08874 1 Article Immunopeptidome Landscape During Brucella melitensis Jin Jing Conceptualization Methodology Investigation Writing – original draft 1 † Sheng Yaming Software Writing – original draft 2 † Li Tingting Validation Data curation 1 Wang Kang Validation 3 Geng Fanghao Formal analysis 1 Li Yi Resources 1 Gao Jianfeng 1 * Stear Michael Academic Editor 1 18095982833@163.com 17690571196@163.com 20212006006@stu.shzu.edu.cn liyi12311206@163.com 2 1155174033@link.cuhk.edu.hk 3 15739338631@163.com * jianfengg@shzu.edu.cn † These authors contributed equally to this work. 12 9 2025 9 2025 26 18 497349 8874 20 7 2025 20 8 2025 29 8 2025 12 09 2025 27 09 2025 29 09 2025 © 2025 by the authors. 2025 https://creativecommons.org/licenses/by/4.0/ Licensee MDPI, Basel, Switzerland. This article is an open access article distributed under the terms and conditions of the Creative Commons Attribution (CC BY) license ( https://creativecommons.org/licenses/by/4.0/ Mouse bone marrow-derived dendritic cells (BMDCs) were infected in vitro with the recombinant Brucella melitensis M5 +gfp Brucella melitensis M5 +gfp Brucella melitensis M5 +gfp Brucella melitensis M5 +gfp Brucella melitensis M5 +gfp Brucella melitensis Brucella melitensis Brucella melitensis BMDCs immunoprecipitation mass spectrometry immunopeptidome National Key Basic Research Program of China 2010CB530200 This research was funded by the National Key Basic Research Program of China (973 Program), grant number 2010CB530200. The APC was funded by Corresponding Author. pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement yes pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes 1. Introduction Building upon numerous studies on neoantigen research, Vivek P Chavda et al. [ 1 + 2 3 4 Brucella melitensis Brucella melitensis 5 Brucellosis, the disease caused by Brucella melitensis 6 Brucella melitensis 2. Results and Discussion 2.1. Morphological Observation of BMDCs in Mice As depicted in Figure 1 2.2. Scanning Electron Microscope Observation of Cell Surface Morphology Before and After Brucella melitensis M5 +gfp As demonstrated in Figure 2 Brucella melitensis M5 +gfp p Brucella melitensis 2.3. Laser Confocal Observation of Intracellular Fluorescence After Infestation As presented in Figure 3 Brucella melitensis M5 +gfp 4 n 2.4. Identification of Peptide Sequences of the Brucella melitensis M5 +gfp MHC-II-bound immunopeptides were isolated from hypotonically lysed cell membrane fragments and characterized by liquid chromatography-tandem mass spectrometry (LC-MS/MS). Proteomic analysis identified 289 high-confidence peptide sequences binding to MHC-II complexes, mapping to 183 unique Brucella melitensis M5 +gfp Supplementary Table S1 2.5. GO and KEGG Analysis of Proteins Corresponding to Peptide Sequences of Brucella melitensis M5 +gfp To deeply analyze the functional characteristics of these proteins, we performed Gene Ontology (GO) analysis. As shown in Figure 4 7 8 9 As shown in Figure 5 10 As shown in Figure 6 11 As shown in Figure 7 12 13 14 Pathways governing transmembrane transport (2 entries) directly facilitate immune recognition and response. The antigen processing pathway for MHC class I molecules transports endogenous peptides to the endoplasmic reticulum for loading onto MHC-I complexes, enabling surface presentation to CD8 + 15 16 Section 2.5 Functional, Structural, and Metabolic Classification of MHC-II-Bound Brucella melitensis The 183 source proteins demonstrated significant functional, structural, and pathway diversity, as follows: 1. Functional classification revealed four major categories among the 183 source proteins. (1) Redox Homeostasis (12 proteins), exemplified by superoxide dismutase (SOD) and peroxiredoxin. SOD constitutes the primary intracellular antioxidant defense through metal-dependent (Cu/Zn, Mn, or Fe) catalytic disproportionation of O 2 − 2 2 2 17 2 2 18 0 1 0 1 19 + 20 21 22 23 12 24 25 26 2. Metabolic pathway classification identified three core functional groups. Carbohydrate Metabolism (18 enzymes), exemplified by pyruvate kinase which catalyzes glycolysis’ terminal ATP-generating step. This rate-limiting enzyme balances glycolytic/gluconeogenic flux through allosteric regulation by fructose-2,6-bisphosphate (F2, 6BP) [ 27 28 29 30 2+ 31 3. Structural classification revealed three principal categories. Outer Membrane and Secretory Proteins (25 species), exemplified by Omp31/Omp2a β-barrel channels (2.2 nm pore diameter) enabling transmembrane diffusion of small/nonpolar molecules, with aromatic residue-lined conduits facilitating passive gas transport (e.g., NO) [ 32 33 34 35 0 1 0 36 3. Materials and Methods 3.1. Experimental Materials and Instruments Experimental Animals: Two hundred specific pathogen-free (SPF)-grade Kunming (KM) mice (female, 6–8 weeks old, body weight 18–22 g) were obtained from Henan Skibbes Bio-technology Co. (Zhengzhou, Henan, China). All mice were housed in individually ventilated cages (IVCs) under controlled conditions: temperature 22 ± 1 °C, humidity 45–65%, 12/12 h light/dark cycle. Autoclaved standard rodent chow and filtered water were provided ad libitum. Environmental enrichment included paper nesting material and PVC tunnels. Cage bedding was changed twice weekly by trained staff following aseptic protocols. Animals were acclimatized for 7 days prior to experiments. Ethical approval for animal use was obtained from [Approval Letter of Biology Ethics Committee of Shihezi University. A2024-424] in compliance with NIH Guide for Care and Use of Laboratory Animals (8th ed.). Pain management: No anesthetic or analgesic agents were administered during cervical dislocation euthanasia, as this method induces immediate unconsciousness per American Veterinary Medical Association (AVMA) 2023 Guidelines [ 37 Brucella melitensis M5 +gfp 38 3.2. Main Reagent Preparation 3.2.1. Preparation of Complete RPMI 1640 Culture Medium A sterile, endotoxin-free 50 mL centrifuge tube was prepared. RPMI 1640 medium, fetal bovine serum (FBS; 10% v v v v 3.2.2. Preparation of 10% RPMI 1640 Culture Medium Fetal bovine serum (FBS) and RPMI 1640 medium were combined in a 1:9 ( v v 3.3. Experimental Replication Design All experiments described in Section 3.4 Section 3.5 Section 3.6 Section 3.7 Section 3.8 Section 3.9 Section 3.10 3.4. Induction Culture of Mouse BMDC Two hundred SPF-grade Kunming mice were euthanized by cervical dislocation. Femurs and tibiae were aseptically excised and flushed with PBS to isolate bone marrow cells. The resulting bone marrow cell suspension was collected and red blood cells were lysed by incubation with red blood cell lysis buffer. Following washing with PBS, the cells were resuspended in complete RPMI 1640 medium (prepared as described in Section 3.2.1 2 3.5. Morphological Observation of BMDC in Mice Cellular morphology, including adhesion status, cytoplasmic extensions, cell density, and colony formation, was assessed using an inverted fluorescence microscope on culture days 1, 3, 5, and 7. 3.6. Brucella melitensis M5 +gfp On day 7 of culture, cells were harvested and infected with the Brucella melitensis M5 +gfp 3.7. Scanning Electron Microscope Observation of Cell Surface Morphology Before and After Infestation BMDCs were seeded onto coverslips and divided into two experimental groups: (1) an uninfected control group, and (2) a Brucella melitensis +gfp 3.8. Laser Confocal Observation of Intracellular Fluorescence After Infestation For ultrastructural and spatial analysis, BMDCs were seeded onto glass coverslips and divided into two experimental cohorts: (1) an uninfected control group and (2) a test group infected with Brucella melitensis M5 +gfp 3.9. Acquisition of MHC II-Brucella melitensis M5 +gfp Protein isolation via hypotonic lysis was performed as follows: Post-infection with Brucella melitensis M5 +gfp 3 g 3.10. Isolation, Purification and Characterization of the Brucella melitensis M5 +gfp Immunopeptidome samples were enriched via co-immunoprecipitation (Co-IP) using MHC-II antibodies. The captured complexes were separated and purified by capillary high-performance liquid chromatography (HPLC). Peptide mass spectrometry and bioinformatic analyses were performed by Shanghai Parsonage Biotechnology Co. (Shanghai, China). Raw mass spectrometry files were processed using MaxQuant (v1.6.1.1) with a Brucella melitensis M5 +gfp 4. Conclusions This study successfully identified 289 MHC-II-bound immunopeptides derived from 183 functionally diverse Brucella melitensis M5 +gfp Brucella melitensis Disclaimer/Publisher’s Note: Supplementary Materials The following supporting information can be downloaded at: https://www.mdpi.com/article/10.3390/ijms26188874/s1 Author Contributions J.G. and J.J.; methodology, J.J.; software, Y.S.; validation, J.J., K.W. and T.L.; formal analysis, F.G.; investigation, J.J.; resources, Y.L.; data curation, T.L.; writing—original draft preparation, J.J.; writing—review and editing, Y.S.; visualization, J.G.; supervision, J.G.; project administration, J.J.; funding acquisition, J.G. All authors have read and agreed to the published version of the manuscript. Institutional Review Board Statement The animal study protocol was approved by the Biology Ethics Committee of Shihezi University of A-2024-424. Approve date: 24 February 2024. Informed Consent Statement Not applicable. Data Availability Statement The datasets presented in this article are new. The data are part of an ongoing experiment. Requests can be made to access the datasets. Conflicts of Interest The authors declare no conflicts of interest. Abbreviations The following abbreviations are used in this manuscript: BMDCs Bone marrow-derived dendritic cell MHC II Major Histocompatibility Complex Class II Co-IP Co-immunoprecipitation LC-MS/MS Liquid Chromatography-Tandem Mass Spectrometry APC Antigen-Presenting Cell HLA Human Leukocyte Antigen MOI Multiplicity of Infection LSCM Laser Scanning Confocal Microscopy GM-CSF Granulocyte-Macrophage Colony-Stimulating Factor IL-4 Interleukin-4 TEM Transmission Electron Microscope SEM Scanning Electron Microscope References 1. Chavda V.P. Redwan E.M. SARS-CoV-2: Immunopeptidomics and Other Immunological Studies Vaccines 2022 10 1975 10.3390/vaccines10111975 36423070 PMC9694091 2. Wen F. Smith M.R. Zhao H. Construction and Screening of an Antigen-Derived Peptide Library Displayed on Yeast Cell Surface for CD4+ T Cell Epitope Identification Methods Mol. Biol. 2019 2024 213 234 10.1007/978-1-4939-9597-4_13 31364052 3. Mommen G.P. Marino F. Meiring H.D. Poelen M.C. van Gaans-van den Brink J.A. Mohammed S. Heck A.J. van Els C.A. Sampling From the Proteome to the Human Leukocyte Antigen-DR (HLA-DR) Ligandome Proceeds Via High Specificity Mol. Cell Proteomics 2016 15 1412 1423 10.1074/mcp.M115.055780 26764012 PMC4824864 4. Millot P. The major histocompatibility complex of sheep (OLA) and two minor loci Anim. Blood Groups Biochem. Genet. 1978 9 115 121 10.1111/j.1365-2052.1978.tb01421.x 742735 5. Socorro Ruiz-Palma M.D. Avila-Calderon E.D. Aguilera-Arreola M.G. Lopez-Merino A. Ruiz E.A. Morales-Garcia M.D.R. Lopez-Villegas E.O. Gomez-Lunar Z. Arellano-Reynoso B. Contreras-Rodriguez A. Comparative proteomic analysis of outer membrane vesicles from Brucella suis, Brucella ovis, Brucella canis and Brucella neotomae Arch. Microbiol. 2021 203 1611 1626 10.1007/s00203-020-02170-w 33432377 PMC7799404 6. Shakir R. Brucellosis J. Neurol. Sci. 2021 420 117280 10.1016/j.jns.2020.117280 33358192 7. Yeh H.I. Yu Y.C. Kuo P.L. Tsai C.K. Huang H.T. Hwang T.C. Functional stability of CFTR depends on tight binding of ATP at its degenerate ATP-binding site J. Physiol. 2021 599 4625 4642 10.1113/JP281933 34411298 PMC8527797 8. Gongadze G.M. Korepanov A.P. Korobeinikova A.V. Garber M.B. Bacterial 5S rRNA-binding proteins of the CTC family Biochemistry 2008 73 1405 1417 10.1134/S0006297908130038 19216708 9. Hektor H.J. Kloosterman H. Dijkhuizen L. Identification of a magnesium-dependent NAD(P)(H)-binding domain in the nicotinoprotein methanol dehydrogenase from Bacillus methanolicus J. Biol. Chem. 2002 277 46966 46973 10.1074/jbc.M207547200 12351635 10. Sorokina I. Mushegian A. The role of the backbone torsion in protein folding Biol. Direct 2016 11 64 10.1186/s13062-016-0166-x 27906033 PMC5133741 11. Jentoft I.M.A. Bauerlein F.J.B. Welp L.M. Cooper B.H. Petrovic A. So C. Penir S.M. Politi A.Z. Horokhovskyi Y. Takala I. Mammalian oocytes store proteins for the early embryo on cytoplasmic lattices Cell 2023 186 5308 5327 10.1016/j.cell.2023.10.003 37922900 12. Luciano-Mateo F. Cabre N. Fernandez-Arroyo S. Baiges-Gaya G. Hernandez-Aguilera A. Rodriguez-Tomas E. Munoz-Pinedo C. Menendez J.A. Camps J. Joven J. Chemokine C-C motif ligand 2 overexpression drives tissue-specific metabolic responses in the liver and muscle of mice Sci. Rep. 2020 10 11954 10.1038/s41598-020-68769-7 32686726 PMC7371894 13. Kim W.K. Singh A.K. Wang J. Applegate T. Functional role of branched chain amino acids in poultry: A review Poult. Sci. 2022 101 101715 10.1016/j.psj.2022.101715 35299066 PMC8927823 14. Berod L. Sparwasser T. Influencing immune cell differentiation by microbe-associated immunomodulatory metabolites (meta-MAMPs) J. Reprod. Immunol. 2016 115 48 10.1016/j.jri.2016.04.146 15. Frietze K.K. Pappy A.L. 2nd Melson J.W. O’Driscoll E.E. Tyler C.M. Perlman D.H. Boulanger L.M. Cryptic protein-protein interaction motifs in the cytoplasmic domain of MHCI proteins BMC Immunol. 2016 17 24 10.1186/s12865-016-0154-z 27435737 PMC4950430 16. Ratner D. Orning M.P. Lien E. Bacterial secretion systems and regulation of inflammasome activation J. Leukoc. Biol. 2017 101 165 181 10.1189/jlb.4MR0716-330R 27810946 PMC6608035 17. Tan L. Liu Y. Sun Y. Liu S. Lin Z. Xue Q. Copper only SOD repeat proteins likely act as an extracellular superoxide dismutase in oyster antioxidant defense Sci. Rep. 2025 15 20465 10.1038/s41598-025-06156-w 40594389 PMC12217663 18. Singh E. Gupta A. Singh P. Jain M. Muthukumaran J. Singh R.P. Singh A.K. Exploring mammalian heme peroxidases: A comprehensive review on the structure and function of myeloperoxidase, lactoperoxidase, eosinophil peroxidase, thyroid peroxidase and peroxidasin Arch. Biochem. Biophys. 2024 761 110155 10.1016/j.abb.2024.110155 39278306 19. Kaim G. Prummer M. Sick B. Zumofen G. Renn A. Wild U.P. Dimroth P. Coupled rotation within single F0F1 enzyme complexes during ATP synthesis or hydrolysis FEBS Lett. 2002 525 156 163 10.1016/S0014-5793(02)03097-1 12163180 20. Lee V.M. Szepesi B. Hansen R.J. Gender-linked differences in dietary induction of hepatic glucose-6 phosphate dehydrogenase, 6-phosphogluconate dehydrogenase and malic enzyme in the rat J. Nutr. 1986 116 1547 1554 10.1093/jn/116.8.1547 3761010 21. Rubio Gomez M.A. Ibba M. Aminoacyl-tRNA synthetases RNA 2020 26 910 936 10.1261/rna.071720.119 32303649 PMC7373986 22. Welty R. Rau M. Pabit S. Dunstan M.S. Conn G.L. Pollack L. Hall K.B. Ribosomal Protein L11 Selectively Stabilizes a Tertiary Structure of the GTPase Center rRNA Domain J. Mol. Biol. 2020 432 991 1007 10.1016/j.jmb.2019.12.010 31874150 PMC7325582 23. Segal R. Ron E.Z. Regulation and organization of the groE and dnaK operons in Eubacteria FEMS Microbiol. Lett. 1996 138 1 10 10.1111/j.1574-6968.1996.tb08126.x 8674965 24. Wang R. Xu H. Du L. Chou S.H. Liu H. Liu Y. Liu F. Qian G. A TonB-dependent receptor regulates antifungal HSAF biosynthesis in Lysobacter Sci. Rep. 2016 6 26881 10.1038/srep26881 27241275 PMC4886534 25. Bilsing F.L. Anlauf M.T. Hachani E. Khosa S. Schmitt L. ABC Transporters in Bacterial Nanomachineries Int. J. Mol. Sci. 2023 24 6227 10.3390/ijms24076227 37047196 PMC10094684 26. Smith T.G. Pereira L. Hoover T.R. Helicobacter pylori FlhB processing-deficient variants affect flagellar assembly but not flagellar gene expression Microbiology 2009 155 1170 1180 10.1099/mic.0.022806-0 19332819 27. Grant M.M. Pyruvate Kinase, Inflammation and Periodontal Disease Pathogens 2021 10 784 10.3390/pathogens10070784 34206267 PMC8308603 28. Wang Y. Yu W. Li S. Guo D. He J. Wang Y. Acetyl-CoA Carboxylases and Diseases Front. Oncol. 2022 12 836058 10.3389/fonc.2022.836058 35359351 PMC8963101 29. Boros K. Gal L. Gal C.A. Wäscher M. Tomoiagă R.B. Toşa M.I. Pietruszka J. Bencze L.C. Immobilization of d-amino acid dehydrogenase from Ureibacillus thermosphaericus Process Biochem. 2024 140 45 55 10.1016/j.procbio.2024.02.014 30. Ohnishi T. Ohnishi S.T. Salerno J.C. Five decades of research on mitochondrial NADH-quinone oxidoreductase (complex I) Biol. Chem. 2018 399 1249 1264 10.1515/hsz-2018-0164 30243012 31. Nunn A.V. Norris P. Hawk J.L. Cox T.M. Zinc chelatase in human lymphocytes: Detection of the enzymatic defect in erythropoietic protoporphyria Anal. Biochem. 1988 174 146 150 10.1016/0003-2697(88)90529-5 3218729 32. Cloeckaert A. Verger J.M. Grayon M. Vizcaino N. Molecular and immunological characterization of the major outer membrane proteins of Brucella FEMS Microbiol. Lett. 1996 145 1 8 10.1111/j.1574-6968.1996.tb08547.x 8931319 33. Sinnige T. Weingarth M. Daniels M. Boelens R. Bonvin A.M. Houben K. Baldus M. Conformational Plasticity of the POTRA 5 Domain in the Outer Membrane Protein Assembly Factor BamA Structure 2015 23 1317 1324 10.1016/j.str.2015.04.014 26027731 34. Peng H. Zhao Y. Chen J. Huo J. Zhang Y. Xiao T. Knockdown of ribosomal protein S3 causes preimplantation developmental arrest in mice Theriogenology 2019 129 77 81 10.1016/j.theriogenology.2019.02.022 30826720 35. Stacpoole P.W. Therapeutic Targeting of the Pyruvate Dehydrogenase Complex/Pyruvate Dehydrogenase Kinase (PDC/PDK) Axis in Cancer J. Natl. Cancer Inst. 2017 109 djx071 10.1093/jnci/djx071 29059435 36. Allen-Worthington K. Xie J. Brown J.L. Edmunson A.M. Dowling A. Navratil A.M. Scavelli K. Yoon H. Kim D.G. Bynoe M.S. The F0F1 ATP Synthase Complex Localizes to Membrane Rafts in Gonadotrope Cells Mol. Endocrinol. 2016 30 996 1011 10.1210/me.2015-1324 27482602 PMC5414608 37. Papich M.G. An American Veterinary Medical Association perspective J. Am. Vet. Med. Assoc. 1995 207 871 874 10.2460/javma.1995.207.07.0871 7559008 38. Hu M.W. Liu P.T. Yan G. Gao J. The fluorescent characterization and analysis of two Brucella attenuated vaccine infecting mouse macrophagocyte China Anim. Husb. Vet. Med. 2016 43 1944 1950 10.16431/j.cnki.1671-7236.2016.08.003 Figure 1 Inverted microscope observation of BMDCs morphology in mice at different times. Note: ( a b c d Figure 2 Morphological changes in cell surface before and after Brucella melitensis M5 +gfp a b c d Brucella melitensis M5 +gfp e Brucella melitensis M5 +gfp f Brucella melitensis M5 +gfp g Brucella melitensis M5 +gfp h Brucella melitensis M5 +gfp i Brucella melitensis M5 +gfp Figure 3 Laser confocal microscopy after Brucella melitensis M5 +gfp a b Brucella melitensis c a b Figure 4 GO (MF) analysis of proteins corresponding to MHC II binding peptides in cell membrane fragment suspensions treated by hypotonic swelling. Figure 5 GO (BP) analysis of proteins corresponding to MHC II binding peptides in cell membrane fragment suspensions treated by hypotonic swelling. Figure 6 GO (CC) analysis of proteins corresponding to MHC II binding peptides in cell membrane fragment suspensions treated by hypotonic swelling. Figure 7 KEGG analysis of proteins corresponding to MHC II binding peptides in cell membrane fragment suspensions treated by hypotonic swelling. ",
  "metadata": {
    "Title of this paper": "The fluorescent characterization and analysis of two Brucella attenuated vaccine infecting mouse macrophagocyte",
    "Journal it was published in:": "International Journal of Molecular Sciences",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12469894/"
  }
}