{
  "title": "Paper_964",
  "abstract": "J Vasc Interv Radiol J Vasc Interv Radiol 319 nihpa Journal of vascular and interventional radiology : JVIR 1051-0443 1535-7732 pmc-is-collection-domain yes pmc-collection-title NIHPA Author Manuscripts PMC12483467 PMC12483467.1 12483467 12483467 NIHMS2110186 35504436 10.1016/j.jvir.2022.04.031 NIHMS2110186 NIHPA2110186 1 Article Phase I Dose-Escalation Study of Tirapazamine Chemoembolization for Unresectable Early- and Intermediate-Stage Hepatocellular Carcinoma Liu Chang-Hsien MD Department of Medical Imaging, China Medical University Hsinchu Hospital and China Medical University, Hsinchu, Taiwan, Republic of China; Department of Radiology, Tri-Service General Hospital and National Defense Medical Center, Taipei, Taiwan, Republic of China; Institute of Nuclear Engineering and Science, National Tsing Hua University, Hsinchu, Taiwan, Republic of China Peng Cheng-Ming MD, PhD Department of Surgery, Chung Shan Medical University Hospital, Taichung, Taiwan, Republic of China Hwang Jen-I. MD Department of Radiology, Taichung Veteran General Hospital, and Department of Medical Imaging, Tungs’ Taichung MetroHarbor Hospital, Taichung, Taiwan, Republic of China Liang Po-Chin MD Department of Medical Imaging, National Taiwan University Hospital Hsin-Chu Branch, and National Taiwan University Hospital, Taipei, Taiwan, Republic of China Chen Pei-Jer MD, PhD Department of Internal Medicine, National Taiwan University Hospital, Taipei, Taiwan, Republic of China Abi-Jaoudeh Nadine MD Department of Radiology, University of California, Irvine Medical Center, Orange, California, USA. Giiang Lung-Hui MBA Department of Radiology, Tri-Service General Hospital and National Defense Medical Center, Taipei, Taiwan, Republic of China Tyan Yu-Shen MD, PhD Department of Radiology, Chung Shan Medical University Hospital, Taichung, Taiwan, Republic of China Address correspondence to C.-H.L., Department of Medical Imaging, China Medical University Hsinchu Hospital and China Medical University, Hsinchu, Taiwan, Republic of China; cute610627@gmail.com 8 2022 30 4 2022 33 8 497820 926 933.e1 20 09 2025 30 09 2025 01 10 2025 01 10 2025 Purpose: To investigate the safety of replacing doxorubicin with tirapazamine in conventional transarterial chemoembolization (TACE) in an Asian population with hepatocellular carcinoma (HCC), and to determine the optimal tirapazamine dose for phase II studies. Materials and Methods: This was a phase I, 3 + 3 dose-escalation study for patients with unresectable early- and intermediate-stage HCC who received 5, 10, or 20 mg/m 2 Results: Seventeen patients were enrolled, 59% of whom had progression from a prior HCC therapy and 35% of whom had progression or recurrence after TACE. All patients tolerated the tirapazamine TACE well without any DLT or serious adverse event. Using the modified Response Evaluation Criteria in Solid Tumors, the complete response (CR) rate was 47%, and the CR + partial response rate was 65%. The median duration of response was not reached. The median time to progression was 12.6 months (95% confidence interval, 5.1–not reached). The median overall survival was 29.3 months. The selected phase II dose was set at a fixed dose of 35 mg of IA tirapazamine. Conclusions: IA tirapazamine with transarterial embolization was well tolerated and showed promising efficacy signals in intermediate-stage HCC, justifying pursuit of a phase II study. pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access no pmc-prop-olf no pmc-prop-manuscript yes pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement yes pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes ",
  "metadata": {
    "Title of this paper": "Phase I Dose-Escalation Study of Tirapazamine Chemoembolization for Unresectable Early- and Intermediate-Stage Hepatocellular Carcinoma",
    "Journal it was published in:": "Journal of vascular and interventional radiology : JVIR",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12483467/"
  }
}