{
  "title": "Paper_717",
  "abstract": "pmc Cancers (Basel) Cancers (Basel) 2105 cancers cancers Cancers 2072-6694 Multidisciplinary Digital Publishing Institute  (MDPI) PMC12468352 PMC12468352.1 12468352 12468352 41008854 10.3390/cancers17183010 cancers-17-03010 1 Article Prospective Evaluation of Cervical Scrapings CDO1 and CELF4 Methylation (epiHERA ® https://orcid.org/0000-0002-3175-1144 Lee Ho-Sze Jacqueline Conceptualization Methodology Software Validation Formal analysis Resources Data curation Writing – original draft Writing – review & editing Supervision Project administration Funding acquisition 1 * Wu Shiye Software Formal analysis Data curation Writing – review & editing Project administration 1 Yeung Suet-Ying Data curation Writing – review & editing Project administration 1 Cheung Chun-Wai Data curation Project administration Writing – review & editing 1 Fung Wen-Ying Linda Data curation Project administration Writing – review & editing 1 https://orcid.org/0000-0002-0672-9842 Kwok Pui-Kei Sonia Data curation Project administration Writing – review & editing 1 https://orcid.org/0000-0002-2366-5588 Yung Kar-Kei Data curation Project administration Writing – review & editing 1 Wong Tsz-Kei Sani Data curation Project administration Writing – review & editing 1 https://orcid.org/0000-0002-5559-4534 Kanneganti Abhiram Writing – review & editing Resources 2 https://orcid.org/0000-0003-2315-9690 Lau Tat-San Conceptualization Methodology Validation Investigation Writing – original draft Writing – review & editing 1 Sastre-Garau Xavier Academic Editor 1 zoeysywu@cuhk.edu.hk carolyeung@cuhk.edu.hk kkyung@cuhk.edu.hk lautatsan@cuhk.edu.hk 2 * jaclee@cuhk.edu.hk 15 9 2025 9 2025 17 18 497140 3010 14 8 2025 06 9 2025 10 9 2025 15 09 2025 27 09 2025 29 09 2025 © 2025 by the authors. 2025 https://creativecommons.org/licenses/by/4.0/ Licensee MDPI, Basel, Switzerland. This article is an open access article distributed under the terms and conditions of the Creative Commons Attribution (CC BY) license ( https://creativecommons.org/licenses/by/4.0/ Simple Summary This study evaluates the performance of the CDO1 and CELF4 methylation assay of cervical scrapings in diagnosing endometrial cancer. Cervical scrapings from patients with abnormal uterine bleeding, suspected endometrial pathology on imaging, endometrial hyperplasia, or cancer undergo a methylation assay, with the result being compared to endometrium histology. The assay yields an accuracy of 97.3%, sensitivity of 84.1%, specificity of 98.8%, PPV of 89.2%, and NPV of 98.2%. The AUC is 0.92, the Kappa coefficient is 0.85, and the false-negative rate is 0.8%. Among seven false-positive cases, five have endometrial hyperplasia and two have cervical intraepithelial neoplasia. Eventually, three patients are diagnosed with endometrial cancer and one with cervical cancer 1 to 4 months later. Methylation assay can be a triage to reduce invasive endometrial assessment. All false-positive cases are related to neoplastic processes in the genital tract, indicating that it may be useful for detecting cancer early, before histological change is evident. Abstract Background/Objectives Methods Results Conclusions endometrial cancer abnormal uterine bleeding methylation assay cervical scraping cervical sample diagnostic test screening test Chinese University of Hong Kong 6906279 This research was partly funded by the INEX Innovate Research Matching Grant Scheme from the Chinese University of Hong Kong, project number 6906279. INEX Innovate had no role in the collection, analysis, and interpretation of the data and writing of the manuscript. pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement no pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes 1. Introduction Endometrial cancer is the sixth most common cancer among women globally [ 1 2 1 3 1 3 4 5 6 6 7 5 8 9 9 10 10 The use of DNA hypermethylation as a cancer screening and diagnostic tool has gained popularity recently. To date, studies have identified a plethora of potential molecular markers for endometrial cancer detection, including genetic mutations (POLE, PTEN, CTNNB1, PIK3CA, ARID1A, KRAS, and ARID5B genes) [ 11 12 13 14 15 16 17 14 18 14 19 14 14 20 For endometrial cancer detection, various sample types, including intra-vaginal tampon [ 15 21 22 12 23 13 24 12 Utilizing cervical scrapings as a potential genetic material, coupled with the use of DNA hypermethylation in specific genes, including CDO1, CELF4, BHLHE22, POU4F3, MAGI2, CADM1, MAL, miR124-2, ZSCAN12, and GYPC, has been investigated for endometrial cancer detection [ 13 16 21 24 13 n n 13 13 5 5 5 16 Methylation of CDO1 and CELF4 has been utilized in endometrial cancer detection in patients with postmenopausal bleeding or pre-menopausal abnormal uterine bleeding [ 25 26 27 28 29 ® ® 2. Materials and Methods 2.1. The Patients This was a prospective, cross-sectional diagnostic test accuracy evaluation study of CDO1 and CELF4 methylation assays of cervical scraping samples in diagnosing endometrial cancer. The study was conducted in the Department of Obstetrics and Gynecology of the Prince of Wales Hospital, Hong Kong, from January 2023 to November 2024. Patients of ≥18 years of age attending the gynecology clinic for abnormal uterine bleeding, suspected endometrial pathology on imaging, endometrial hyperplasia, or untreated endometrial cancer, who were clinically indicated for endometrial sampling +/− hysteroscopy +/− hysteroscopic biopsy +/− hysterectomy, were invited to participate. Those who agreed to participate signed a consent form. Clinical data, including demographics (age, BMI, menopausal status), medical co-morbidities, and family history of cancer, were obtained. Endometrial thickness was assessed by transvaginal ultrasound or trans-abdominal ultrasound. Patients were excluded if they were pregnant, menstruating, had pelvic inflammatory disease, had used vaginal contraception or douches 48 h prior to the clinical visit, were using hormone replacement therapy, refused endometrial assessment, or refused to participate. Participating patients underwent standard procedures during their consultation, including history taking, physical examination with speculum and digital vaginal examination, and ultrasound for endometrial thickness and ovarian pathology. Depending on the clinical condition, outpatient hysteroscopy +/− hysteroscopic biopsy and cervical smear for cytology were also performed in some cases. The cervical scrapings for the DNA methylation assay were taken during the speculum examination before performing the outpatient endometrial sampling and hysteroscopy. If the patient was referred for endometrial cancer and planned for a hysterectomy, the cervical scrapings would be taken on the day of the hysterectomy. The DNA methylation assay, an epiHERA ® 2.2. Cervical Scrapings Sampling Technique Excess mucus was removed from the cervical os if required. The central bristles of the broom of the cervical sampler were inserted into the cervical os while the broom was fully in contact with the ectocervix. The sampler would be turned clockwise five times. The broom of the cervical sampler was put into a storage bottle containing 20 mL of Thinprep preservation solution and gently shaken to allow cervical exfoliated cells to stay in the bottle. The specimen was stored at room temperature between 15 °C and 30 °C. If the collected specimen contains excess blood (specimen has a red color), it will be discarded and not used for testing. 2.3. Sample Processing (DNA Extraction, Bisulfite Conversion, and Quantitative Methylation-Specific PCR (qMS-PCR)) Cervical scraping samples preserved in Thinprep ® The methylated-CDO1 (CDO1 meth meth ® meth meth meth meth meth meth meth meth meth meth meth meth meth meth meth meth 2.4. Statistical Analysis Sample size calculation was performed with an online survival sample size calculation tool ( https://wnarifin.github.io/ssc/sssnsp.html 3. Results A total of 689 cases were recruited from January 2023 to December 2024. Twelve cases were excluded due to failure to perform endometrial sampling, and two cases were excluded due to an invalid DNA methylation assay, leaving 675 cases for the final analysis ( Figure 1 Figure 1 Table 1 n n Table 1 The result of the CDO1 and CELF4 methylation (epiHERA ® Table 2 Figure 2 Figure 3 Endometrial thickness, the presence of high-grade or glandular abnormality on cervical cytology, and endometrial hyperplasia were found to affect the accuracy of the methylation assay ( Table 3 Table 3 The accuracy was lower for cases with endometrial hyperplasia versus those without endometrial hyperplasia (54% vs. 98%). There were seven false-positive cases in our study; among them, five were cases of endometrial hyperplasia. Two cases were endometrial hyperplasia without atypia, where endometrial cancer was diagnosed in one case 4 months later. Three cases were endometrial hyperplasia with atypia, where two cases were diagnosed with endometrial cancer 1–2 months later, and one case had a fibroid. The two false-positive cases without endometrial hyperplasia had cervical preinvasive or invasive pathology, one case had ASCH on cervical cytology, and the other was found to have CIN III on endometrial sampling and was diagnosed with cervical cancer 3 months later. Outpatient endometrial samplings were reported as insufficient in 317 cases, 301 (95%) of them being in menopausal patients and 16 (5%) being in pre-menopausal patients. These cases were taken as benign endometrial assessments, in line with the clinical management. The clinical progress of these patients was being checked 4 months after the end of the study in the hospital electronic record system, and none were found to have endometrial cancer. 4. Discussion 4.1. Performance of DNA Methylation Assay Our study demonstrated that a combined CDO1 and CELF4 DNA methylation (epiHERA ® p Our study results are comparable to other similar studies utilizing cervical scraping methylation assay in diagnosing endometrial cancer. Previous studies utilizing methylation assays of CDO1 and BHLHE22 coupled with age and BMI in 494 patients [ 5 21 16 4.2. Triage for Patients at Risk of Endometrial Cancer Based on the high sensitivity and specificity in endometrial cancer detection, the DNA methylation assay has been suggested as a triage for abnormal uterine bleeding investigation to reduce the need for invasive procedures with endometrial sampling, D&C, and hysteroscopy [ 5 16 5 16 Table 1 DNA methylation assay has the advantage of being highly reproducible and less operator-dependent than transvaginal ultrasound [ 5 14 16 4.3. Implication on Endometrial Hyperplasia Management Endometrial hyperplasia is a significant factor affecting the accuracy of the DNA methylation assay in our study ( p 30 8 A previous study found that the number of promoter-methylated loci increases in the progression from normal endometrium to simple hyperplasia to complex hyperplasia among 24 tumor suppressor genes. In addition, aberrant DNA methylation of some tumor suppressor genes was found to be evident before endometrial carcinoma diagnosis [ 18 31 4.4. Detection of Cervical Pre-Invasive and Invasive Disease The presence of high-grade/glandular abnormality on cervical cytology was found to lower the accuracy of the DNA methylation assay (80% vs. 98.6%, p 24 Our study has the largest sample size ( n 8 9 In our study, a high number of outpatient endometrial samplings were reported as insufficient (47%, 317/675). The risk of an insufficient sample was 2% to 60%, as reported in the literature [ 27 32 33 5. Conclusions The DNA methylation assay of CDO1 and CELF4 (epiHERA ® Disclaimer/Publisher’s Note: Author Contributions Conceptualization, H.-S.J.L. and T.-S.L.; Methodology, H.-S.J.L. and T.-S.L.; Software, H.-S.J.L. and S.W.; Validation, H.-S.J.L. and T.-S.L.; Formal analysis, H.-S.J.L. and S.W.; Investigation, T.-S.L. and S.W.; Resources, H.-S.J.L.; Data curation, H.-S.J.L., S.W., S.-Y.Y., C.-W.C., W.-Y.L.F., P.-K.S.K., K.-K.Y. and T.-K.S.W.; Writing—original draft preparation, H.-S.J.L. and T.-S.L.; Writing—review and editing, H.-S.J.L., S.-Y.Y., A.K. and T.-S.L.; Project administration, H.-S.J.L., S.W., S.-Y.Y., C.-W.C., W.-Y.L.F., P.-K.S.K., K.-K.Y. and T.-K.S.W.; Funding acquisition, H.-S.J.L. All authors have read and agreed to the published version of the manuscript. Institutional Review Board Statement The study was conducted in accordance with the Declaration of Helsinki and approved by the Ethics Committee of the Chinese University of Hong Kong (CREC Ref. No.: 2022.455, date of approval 29 November 2022). Informed Consent Statement Informed consent was obtained from all subjects involved in the study. Data Availability Statement Data supporting the reported results are not publicly available. Conflicts of Interest This work was partly funded by the INEX Innovate Research Matching Grant Scheme from the Chinese University of Hong Kong, project number 6906279. INEX Innovate had no role in the collection, analysis, and interpretation of the data and writing of the manuscript. Abbreviations The following abbreviations are used in this manuscript: PPV Positive predictive value NPV Negative predictive value AUC Area under the curve D&C Dilatation and curettage BMI Body mass index PCR Polymerase chain reaction CIN Cervical intraepithelial neoplasia References 1. Bray F. Laversanne M. Sung H. Ferlay J. Siegel R.L. Soerjomataram I. Jemal A. Global cancer statistics 2022: GLOBOCAN estimates of incidence and mortality worldwide for 36 cancers in 185 countries CA A Cancer J. Clin. 2024 74 229 263 10.3322/caac.21834 38572751 2. Cronin K.A. Scott S. Firth A.U. Sung H. Henley S.J. Sherman R.L. Siegel R.L. Anderson R.N. Kohler B.A. Benard V.B. Annual report to the nation on the status of cancer, part 1: National cancer statistics Cancer 2022 128 4251 4284 10.1002/cncr.34479 36301149 PMC10092838 3. Bray F. Ferlay J. Soerjomataram I. Siegel R.L. Torre L.A. Jemal A. Global cancer statistics 2018: GLOBOCAN estimates of incidence and mortality worldwide for 36 cancers in 185 countries CA Cancer J. Clin. 2018 68 394 424 10.3322/caac.21492 30207593 4. Costas L. Frias-Gomez J. Guardiola M. Benavente Y. Pineda M. Pavón M.Á. Martínez J.M. Climent M. Barahona M. Canet J. New perspectives on screening and early detection of endometrial cancer Int. J. Cancer 2019 145 3194 3206 10.1002/ijc.32514 31199503 5. Wen K.-C. Huang R.-L. Chen L.-Y. Wu T.-I. Lu C.-H. Chu T.-Y. Ou Y.-C. Wu C.-H. Hsu S.-T. Ding D.-C. Endometrial Cancer Detection Using a Cervical DNA Methylation Assay (MPap) in Women with Abnormal Uterine Bleeding: A Multicenter Hospital-Based Validation Study Cancers 2022 14 4343 10.3390/cancers14174343 36077877 PMC9454900 6. Wong A. Lao T. Cheung C. Yeung S. Fan H. Ng P. Yuen P. Sahota D. Reappraisal of endometrial thickness for the detection of endometrial cancer in postmenopausal bleeding: A retrospective cohort study BJOG Int. J. Obstet. Gynaecol. 2015 123 439 446 10.1111/1471-0528.13342 25800522 7. Smith-Bindman R. Kerlikowske K. Feldstein V.A. Subak L. Scheidler J. Segal M. Brand R. Grady D. Endovaginal Ultrasound to Exclude Endometrial Cancer and Other Endometrial Abnormalities JAMA 1998 280 1510 1517 10.1001/jama.280.17.1510 9809732 8. Dijkhuizen F.P. Mol B.W. Brölmann H.A. Heintz A.P. The accuracy of endometrial sampling in the diagnosis of patients with endometrial carcinoma and hyperplasia: A meta-analysis Cancer 2000 89 1765 1772 10.1002/1097-0142(20001015)89:8&#x0003c;1765::AID-CNCR17&#x0003e;3.0.CO;2-F 11042572 9. van Hanegem N. Prins M.M. Bongers M.Y. Opmeer B.C. Sahota D.S. Mol B.W.J. Timmermans A. The accuracy of endometrial sampling in women with postmenopausal bleeding: A systematic review and meta-analysis Eur. J. Obstet. Gynecol. Reprod. Biol. 2016 197 147 155 10.1016/j.ejogrb.2015.12.008 26748390 10. Hong Kong cancer registry. Corpus Uteri Cancer in 2022 [Internet]. Hong Kong. Hospital Authority; Oct 2022 Available online: https://www3.ha.org.hk/cancereg/pdf/factsheet/2022/corpus_2022.pdf (accessed on 21 April 2025) 11. Zhou J. Tomashefski J.F. Khiyami A. ThinPrep Pap tests in patients with endometrial cancer: A histo-cytological correlation Diagn. Cytopathol. 2007 35 448 453 10.1002/dc.20672 17580347 12. Wang L. Dong L. Xu J. Guo L. Wang Y. Wan K. Jing W. Zhao L. Feng X. Zhang K. Hypermethylated CDO1 and ZNF454 in Cytological Specimens as Screening Biomarkers for Endometrial Cancer Front. Oncol. 2022 12 714663 10.3389/fonc.2022.714663 35574348 PMC9095965 13. Huang R.-L. Su P.-H. Liao Y.-P. Wu T.-I. Hsu Y.-T. Lin W.-Y. Wang H.-C. Weng Y.-C. Ou Y.-C. Huang T.H.-M. Integrated Epigenomics Analysis Reveals a DNA Methylation Panel for Endometrial Cancer Detection Using Cervical Scrapings Clin. Cancer Res. 2017 23 263 272 10.1158/1078-0432.CCR-16-0863 27507616 14. Locke W.J. Guanzon D. Ma C. Liew Y.J. Duesing K.R. Fung K.Y. Ross J.P. DNA Methylation Cancer Biomarkers: Translation to the Clinic Front. Genet. 2019 10 1150 10.3389/fgene.2019.01150 31803237 PMC6870840 15. Bakkum-Gamez J.N. Wentzensen N. Maurer M.J. Hawthorne K.M. Voss J.S. Kroneman T.N. Famuyide A.O. Clayton A.C. Halling K.C. Kerr S.E. Detection of endometrial cancer via molecular analysis of DNA collected with vaginal tampons Gynecol. Oncol. 2015 137 14 22 10.1016/j.ygyno.2015.01.552 25677060 PMC4380654 16. Evans I. Reisel D. Jones A. Bajrami A. Nijjar S. Solangon S.A. Arora R. Redl E. Schreiberhuber L. Ishaq-Parveen I. Performance of the WID-qEC test versus sonography to detect uterine cancers in women with abnormal uterine bleeding (EPI-SURE): A prospective, consecutive observational cohort study in the UK Lancet Oncol. 2023 24 1375 1386 10.1016/S1470-2045(23)00466-7 37944542 17. Tao M.H. Freudenheim J.L. DNA methylation in endometrial cancer Epigenetics 2010 5 491 498 10.4161/epi.5.6.12431 20543579 PMC2954259 18. Nieminen T.T. Gylling A. Abdel-Rahman W.M. Nuorva K. Aarnio M. Renkonen-Sinisalo L. Järvinen H.J. Mecklin J.-P. Bützow R. Peltomäki P. Molecular Analysis of Endometrial Tumorigenesis: Importance of Complex Hyperplasia Regardless of Atypia Clin. Cancer Res. 2009 15 5772 5783 10.1158/1078-0432.CCR-09-0506 19723644 19. Pan Y. Liu G. Zhou F. Su B. Li Y. DNA methylation profiles in cancer diagnosis and therapeutics Clin. Exp. Med. 2017 18 1 14 10.1007/s10238-017-0467-0 28752221 20. Hao X. Luo H. Krawczyk M. Wei W. Wang W. Wang J. Flagg K. Hou J. Zhang H. Yi S. DNA methylation markers for diagnosis and prognosis of common cancers Proc. Natl. Acad. Sci. USA 2017 114 7414 7419 10.1073/pnas.1703577114 28652331 PMC5514741 21. Chang C.-C. Wang H.-C. Liao Y.-P. Chen Y.-C. Weng Y.-C. Yu M.-H. Lai H.-C. The feasibility of detecting endometrial and ovarian cancer using DNA methylation biomarkers in cervical scrapings J. Gynecol. Oncol. 2018 29 e17 10.3802/jgo.2018.29.e17 29185275 PMC5709527 22. Sangtani A. Wang C. Weaver A. Hoppman N.L. Kerr S.E. Abyzov A. Shridhar V. Staub J. Kocher J.-P.A. Voss J.S. Combining copy number, methylation markers, and mutations as a panel for endometrial cancer detection via intravaginal tampon collection Gynecol. Oncol. 2020 156 387 392 10.1016/j.ygyno.2019.11.028 31787246 PMC7018609 23. Maritschnegg E. Wang Y. Pecha N. Horvat R. Van Nieuwenhuysen E. Vergote I. Heitz F. Sehouli J. Kinde I. Diaz L.A. Lavage of the Uterine Cavity for Molecular Detection of Müllerian Duct Carcinomas: A Proof-of-Concept Study J. Clin. Oncol. 2015 33 4293 4300 10.1200/JCO.2015.61.3083 26552420 PMC4678180 24. A De Strooper L.M. van Zummeren M. Steenbergen R.D.M. Bleeker M.C.G. Hesselink A.T. A Wisman G.B. Snijders P.J.F. Heideman D.A.M. Meijer C.J.L.M. CADM1 MAL miR124-2 J. Clin. Pathol. 2014 67 1067 1071 10.1136/jclinpath-2014-202616 25281766 25. Cai B. Du J. Wang Y. Liu Z. Wang Y. Li L. Liu P. Wang L. Liu Q. Meng Z. The endometrial cancer detection using non-invasive hypermethylation of CDO1 CELF4 Cytojournal 2024 21 15 10.25259/Cytojournal_78_2023 38841418 PMC11152555 26. Zhao X. Yang Y. Fu Y. Lv W. Xu D. DNA methylation detection is a significant biomarker for screening endometrial cancer in premenopausal women with abnormal uterine bleeding Int. J. Gynecol. Cancer 2024 34 1165 1171 10.1136/ijgc-2024-005723 39043572 27. Qi B. Sun Y. Lv Y. Hu P. Ma Y. Gao W. Li S. Zhang X. Jin X. Liou Y. Hypermethylated CDO1 and CELF4 in cytological specimens as triage strategy biomarkers in endometrial malignant lesions Front. Oncol. 2023 13 1289366 10.3389/fonc.2023.1289366 38107069 PMC10722236 28. Chen M. Zhu J.-Y. Mu W.-J. Guo L. Cysteine dioxygenase type 1 (CDO1): Its functional role in physiological and pathophysiological processes Genes Dis. 2023 10 877 890 10.1016/j.gendis.2021.12.023 37396540 PMC10308199 29. Nasiri-Aghdam M. Garcia-Garduño T.C. Jave-Suárez L.F. CELF Family Proteins in Cancer: Highlights on the RNA-Binding Protein/Noncoding RNA Regulatory Axis Int. J. Mol. Sci. 2021 22 11056 10.3390/ijms222011056 34681716 PMC8537729 30. Daud S. Jalil S.S. Griffin M. Ewies A.A. Endometrial hyperplasia – the dilemma of management remains: A retrospective observational study of 280 women Eur. J. Obstet. Gynecol. Reprod. Biol. 2011 159 172 175 10.1016/j.ejogrb.2011.06.023 21764501 31. Giannella L. Piva F. Carpini G.D. Di Giuseppe J. Grelloni C. Giulietti M. Sopracordevole F. Giorda G. Del Fabro A. Clemente N. Concurrent Endometrial Cancer in Women with Atypical Endometrial Hyperplasia: What Is the Predictive Value of Patient Characteristics? Cancers 2023 16 172 10.3390/cancers16010172 38201599 PMC10778118 32. Sadek K.H. Cagampang F.R. Bruce K.D. Shreeve N. Macklon N. Cheong Y. Variation in stability of housekeeping genes in endometrium of healthy and polycystic ovarian syndrome women Hum. Reprod. 2011 27 251 256 10.1093/humrep/der363 22052386 33. Ayakannu T. Taylor A.H. Konje J.C. Selection of Endogenous Control Reference Genes for Studies on Type 1 or Type 2 Endometrial Cancer Sci. Rep. 2020 10 8468 10.1038/s41598-020-64663-4 32439920 PMC7242460 Figure 1 Patient recruitment flowchart. Figure 2 ROC curve for combined CDO1 and CELF4 DNA methylation assay in diagnosing endometrial cancer. Figure 3 Detection of hypermethylated CDO1 and CELF4 in cervical scrapings from patients with and without endometrial cancer (EC) by quantitative methylation-specific PCR (qMS-PCR). Relative expressions normalized with GAPDH (dCT) CDO1meth [left], CELF4meth (middle), and CDO1meth + CELF4meth (right) are shown. Relative expression of CDO1meth + CELF4meth was calculated by the mean with S.E.M of dCT from CDO1meth and CELF4meth (red line). p p cancers-17-03010-t001_Table 1 Table 1 Patient characteristics.  Number of Patients Percentage  Number of Patients Percentage  Age ( n  Pap smear cytology ( n - <30–39 11 1.6% Adenocarcinoma 1 0.5% - 40–49 106 15.7% Abnormal glandular cell 2 1% - 50–59 240 35.6% AGC not otherwise specified 6 2.8% - 60–69 234 34.7% ASCH 1 0.5% - 70–79 74 11% LSIL 2 1% - ≥80 10 1.5% ASCUS 12 5.5% Mean age: 58.7, Median 59 Negative for intra-epithelial neoplasia 194 89%  BMI ( n  Endometrial assessment pathology ( n - <18.5 22 3.3%  Insufficient 317 n n 47% 203 30.1% 70 10.4% 5 0.7% - 18.5–22.9 189 28.1%  Endometrial hyperplasia - 23–24.9 148 22% - With atypia 7 1% - 25–29.9 212 31.5% - Without atypia 4 0.6% - 30–34.9 83 12.4%  Malignant - ≥35 18 2.7% Endometrioid adenocarcinoma grade 1 40 5.9% Mean BMI: 24.8, Median 24.1   Endometrioid adenocarcinoma grade 2 12 1.8% Missing data = 3 Endometrioid adenocarcinoma grade 3 11 1.6%  Menopaused 538/675 79.7% Carcinosarcoma 3 0.4%  Family history of gynecological cancer 46/674 6.8% Clear cell carcinoma 2 0.3% Missing data = 1 SCC 1 0.1%  Hypertension present ( n 205/675 30.4%  Stage of endometrial cancer ( n  Diabetes present ( n 89/675 13.2% - 1A 27 39.7%  Hyperlipidaemia present ( n 92/675 13.6% - 1B 11 16.2%  - II 14 20.6%  Presentation symptoms ( n - IIIA 1 1.5% - Postmenopausal bleeding 444 65.8% - IIIB 2 2.9% - Menorrhagia 82 12.2% - IIIC 12 17.6% - Irregular menstruation 25 3.7% - IVB 1 1.5% - Intermenstrual bleeding 21 3.1% Missing data = 1 - Hypermetabolic activity in endometrium on PET 1 0.1%    - History of endometrial hyperplasia 3 0.4%    - Asymptomatic thickened endometrial thickness or hydrometra 46 6.8%    - Abnormal cervical smear 3 0.4%    - Post-coital bleeding 8 1.2%    - Foul-smelling vaginal discharge 2 0.3%    - Others 39 5.8%    Missing data = 1      cancers-17-03010-t002_Table 2 Table 2 DNA methylation assay versus endometrial assessment pathology in diagnosing endometrial cancer. Combine CDO1 and CELF4 Methylation  Negative Positive Accuracy Sensitivity Specificity PPV NPV PLR NLR AUC Endometrial assessment pathology Pathology: benign/insufficient N = 599 N = 7 97.3% 84.1% (73.3% to 91.8%) 98.8% (97.6% to 99.5%) 89.2% (79.8% to 94.6%) 98.2% (96.9% to 98.9%) 72.8 (34.6 to 153.1) 0.16 (0.09 to 0.28) 0.92 (0.86 to 0.97) Pathology: malignant N = 11 N = 58 PPV: positive predictive value, NPV: negative predictive value, PLR: positive likelihood ratio, NLR: negative likelihood ratio, AUC: area under the curve cancers-17-03010-t003_Table 3 Table 3 Factors affecting DNA methylation assay in diagnosing endometrial cancer.  Accurate Inaccurate p  Age ( n 58.7 (SD 9.53) 59.3 (SD 10.1) 0.78  BMI ( n 24.8 (SD 4.45) 25.5 (SD 4.98) 0.51  Menopausal status ( n Menopause 525 (97.6%) 13 (2.4%) 0.38 Not menopause 132 (96.4%) 5 (3.6%)  Hypertension ( n Present 200 (97.6%) 5 (2.4%) 1.0 Absent 457 (97.2%) 13 (2.8%)  Diabetes ( n - Present 85 (95.5%) 4 (4.5%) 0.28 - Absent 572 (97.6%) 14 (2.4%)  Hyperlipidaemia ( n Present 91 (98.9%) 1 (1.1%) 0.49 Absent 566 (97.1%) 17 (2.9%)  Fibroid ( n - Present 152 (97.4%) 4 (2.6%) 1.0 - Absent 505 (97.5%) 13 (2.5%)  Adenomyosis ( n - Present 10 (100%) 0 (0%) 1.0 - Absent 647 (97.4%) 17 (2.6%)  Time from LMP ( n - ≤ 14 days 40 (97.6%) 1 (2.4%) 1.0 - > 14 days 80 (98.8%) 1 (1.2%)  Endometrial thickness ( n - ≤ 4 mm 281 (99.6%) 1 (0.4%) <0.001 * - > 4 mm 240 (95.6%) 11 (4.4%)  High-grade/Glandular abnormality smear ( n - Yes 8 (80%) 2 (20%) 0.02 * - No 205 (98.6%) 3 (1.4%)  Endometrial hyperplasia ( n  - Present 6 (54.5%) 5 (45%) <0.001 * - Absent 651 (98%) 13 (92%)  Stage of tumor ( n  - Stage 1 31 (79.5%) 8 (20.5%) 0.33 - > Stage 1 27 (90%) 3 (10%)  Histology of tumor ( n  - Endometrioid 53 (84.1%) 10 (15.9%) 1.0 - Non-endometrioid 5 (83.3%) 1 (16.7%)  Grade of tumor ( n - Grade 1 32 (82.1%) 7 (17.9%) 0.18 - Grade 2 12 (100%) 0 (0%) - Grade 3 8 (72.7%) 3 (27.3%) * Statistically significant ",
  "metadata": {
    "Title of this paper": "Selection of Endogenous Control Reference Genes for Studies on Type 1 or Type 2 Endometrial Cancer",
    "Journal it was published in:": "Cancers",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12468352/"
  }
}