{
  "title": "Paper_215",
  "abstract": "pmc Int J Med Sci Int J Med Sci 257 ijmedsci ijms International Journal of Medical Sciences 1449-1907 Ivyspring International Publisher PMC12492353 PMC12492353.1 12492353 12492353 10.7150/ijms.116656 ijmsv22p3828 1 Research Paper Targeting LC3B/MCL-1 expression by Protodioscin induces autophagy and apoptosis in human glioblastoma cells in vitro in vivo Tai Ching-Ting 1 † Hsieh Yi-Hsien 1 2 † Lee Hsiang-Lin 3 4 † Chen Pei-Ni 1 2 Chiou Hui-Ling 5 Wu Tsai-Yun 5 Lin Chia-Liang 6 7 Lin Yi-Chen 1 Chen Chien-Min 8 9 ✉ 1 2 3 4 5 6 7 8 9 ✉ Corresponding author: Dr. Chien-Min Chen, PhD, Division of Neurosurgery, Department of Surgery, Changhua Christian Hospital, Changhua, Taiwan. Email: 96015@cch.org.tw †These authors contributed equally. Competing Interests: The authors have declared that no competing interest exists. 2025 22 8 2025 22 15 498247 3828 3838 29 4 2025 4 8 2025 22 08 2025 04 10 2025 04 10 2025 © The author(s) 2025 https://creativecommons.org/licenses/by/4.0/ This is an open access article distributed under the terms of the Creative Commons Attribution License ( https://creativecommons.org/licenses/by/4.0/ https://ivyspring.com/terms Protodioscin (PD), a natural steroidal saponin extracted from Dioscorea and Tribulus terrestris, has been shown to exhibit anticancer, antimetastatic, and pro-autophagic and apoptotic activities in various malignant tumor cells. However, its antitumor potential and molecular mechanisms in glioblastoma remain unclear. This study aimed to investigate the effects of PD on apoptosis and autophagy in human glioblastoma cells using both in vitro in vivo in vivo Protodioscin Autophagy Apoptosis Glioblastoma LC3 MCL-1 pmc-status-qastatus 0 pmc-status-live yes pmc-status-embargo no pmc-status-released yes pmc-prop-open-access yes pmc-prop-olf no pmc-prop-manuscript no pmc-prop-legally-suppressed no pmc-prop-has-pdf yes pmc-prop-has-supplement no pmc-prop-pdf-only no pmc-prop-suppress-copyright no pmc-prop-is-real-version no pmc-prop-is-scanned-article no pmc-prop-preprint no pmc-prop-in-epmc yes Introduction Human glioblastoma is one of the most dangerous and difficult human tumors to treat due to its rapid growth rate and resistance to chemotherapeutic drugs. The median survival time for most patients is 15 months because of the lack of effective clinical treatment 1 2 3 PD is a natural steroidal saponin with broad biological activity, extracted from the Tribulus terrestris Dioscorea spp 4 5 6 7 8 9 During the autophagy process, cytosolic LC3-A conjugates with phosphatidylethanolamine (PE) to form the LC-3B conjugate, which is then incorporated into autophagosomes. Subsequently, autophagosomes fuse with lysosomes to form autolysosomes, leading to the degradation of LC3-II within the autolysosomal lumen 10 11 12 13 14 7 In this study, we investigated the anti-tumor effects of PD on three glioblastoma cell lines, evaluating its ability to inhibit glioblastoma cell growth and the underlying molecular mechanisms. In addition, a glioblastoma mouse model was used to assess the in vivo Materials and Methods Chemicals, drugs, and reagents PD (C 51 84 22 Cell culture GBM8401 (glioblastoma multiforme; BCRC 60163) was cultured in RPMI 1640 medium. M059K (glioblastoma; BCRC 60381) was cultured in DMED/F12 (Dulbecco's Modified Eagle's and Ham's F12) medium, supplemented with sodium pyruvate (0.5 mM) and non-essential amino acids (NEAA, 0.05 mM). U251 cells (glioblastoma) were maintained in MEM (Eagle's minimal essential) medium supplemented with fetal bovine serum and penicillin-streptomycin solution. Growth of human glioblastoma cells The three glioblastoma cell lines (2 × 10 4 15 Annexin V/PI assay of cell apoptosis Human glioblastoma cells were treated with PD (0.5, 1, and 2 μM) for 24 hours. Cells then were washed with ice-cold PBS twice and treated with the Annexin V & Dead Cell reagents for 15 minutes in the dark. After washing twice with PBS, the fraction of apoptotic cells (%) was determined using a Guava Muse flow cytometer (Cytek, Fremont, CA, USA). Mitochondrial membrane potential Human glioblastoma cells were treated with PD (0.5, 1, and 2 μM) for 24 hours. The MitoPotential Kit was used to treat the cells for 15 minutes in the dark. Cells with loss of mitochondrial membrane potential were detected using the Guava Muse flow cytometer (Cytek, Fremont, CA, USA). Assessment of autophagy by acridine orange staining Human glioblastoma cells (2×10⁵ cells/well) were seeded into 6-well plates, incubated overnight at 37°C, and treated with PD (6, 12, and 18 µM) for 24 hours. The culture medium then was discarded, and the cells were washed for 5 minutes three times with phosphate-buffered saline (PBS). Subsequently, cells were incubated with acridine orange staining solution (final concentration, 5 μg/mL) at 37°C in the dark for 15 minutes and then rinsed three times with PBS. Coverslips were gently removed, mounted onto glass slides, and counterstained with DAPI. Acidic vesicular organelles (AVOs) were then visualized using a fluorescence microscope (emission Wavelength at 650 nm) to evaluate autophagic activity. Small interfering RNA (siRNA) transfection assay Human glioblastoma cells (2×10⁵ cells/well) were plated in 6-cm culture dishes and allowed to adhere overnight. siRNA targeting LC3B (si-LC3B; 20 nM) and control siRNA (si-Con; 20 nM) were each incubated in Opti-MEM for 5 mins. Lipofectamine RNAiMAX (for siRNA delivery) was incubated in Opti-MEM for 5 mins, followed by a 15-minute incubation after mixing to allow complex formation. The siRNA/Lipofectamine RNAiMAX-complex was then added to PD (18 µM)-treated glioblastoma cells in culture medium with 10% FBS, followed by incubation under standard culture conditions for an additional 24 hours before assays for cell growth or apoptosis. Clinical data analysis The mRNA expression level of MCL1 in human glioblastoma tissues was compared with that in adjacent normal tissues using the Gene_DE module of the TIMER2.0 database ( http://timer.cistrome.org/ Western blot analysis Total protein extracted from PD-treated glioblastoma cells in NETN buffer was placed on ice for 20 minutes. A total of 20 μg of protein (as determined by Bradford protein assay) was separated via 10% SDS-PAGE and then transferred to a PVDF membrane using a semi-dry transfer system for 1 hour. Membranes were blocked in TBST containing 2% BSA for 1 hour and then incubated overnight at 4°C with specific primary antibodies. Membranes then were washed with TBST buffer twice and then incubated for 1 hour with HRP-conjugated secondary rabbit or mouse antibodies. Chemiluminescent signals were developed using an ECL detection reagent and visualized using the ImageQuant LAS 4000 Mini imaging system (Cytiva, MA, USA). Band intensities were quantified by densitometry and normalized to GAPDH. In vivo To evaluate the anti-tumorigenic potential of PD, a subcutaneous glioblastoma xenograft model was established using BALB/c nude mice (5-week-old females). GBM8401 cells (1 × 10⁶ cells in 100 μL of PBS mixed with Matrigel at a 1:1 ratio) were injected subcutaneously with a 24-gauge needle into the right flank of nude mice (n = 5). After 7 days and an increase in tumor to 85 mm 3 16 Statistical analysis All experiments were repeated independently at least three times, and the data are presented as the mean ± standard deviation (SD). Statistical analyses were performed using GraphPad Prism software (version 6, GraphPad Software, Statistically Significant Inc., CA, USA). Results were compared between groups using one-way analysis of variance (ANOVA). Results were compared between two groups using Student's t-test. Statistical significance was considered as p < 0.05 or 0.01. Results PD inhibited the growth of human glioblastoma cells The structure of PD is shown in Figure 1 1 1 1 50 50 50 PD induced apoptosis in glioblastoma cells The effect of PD on apoptosis was investigated using flow cytometry of annexin V/PI-stained cells and western blot analysis of apoptosis-related proteins. The percentage of Annexin V/PI-positive cells increased from 7.0% to 26.0% in GBM8401 cells and from 7.7% to 35.8% in M059K cells following PD treatment (Figure 2 2 2 PD induced mitochondrial dysfunction in human glioblastoma cells Mitochondrial membrane dysfunction serves as a critical indicator of apoptosis in mammalian cells 17 3 18 3 3 PD induces autophagy dependent on mitochondrial apoptosis by targeting LC3 expression in human glioblastoma cells When cellular autophagy is activated, acridine orange accumulates in acidic vesicles and emits red fluorescence 19 4 4 4 4 4 PD exhibits antitumor effects in vivo GBM8401 cells were subcutaneously implanted into immunodeficient BALB/c nude mice, and tumor-bearing mice were orally administered PD (5 and 10 mg/kg) twice weekly. PD treatment (5 and 10 mg/kg) significantly suppressed tumor growth compared to control mice (Figure- 5 5 5 in vivo 5 5 in vivo Model predicting molecular docking between PD and LC3B/MCL-1 Molecular docking analysis with AutoDock software was used to explore the potential interactions between PD and LC3B/MCL-1. The resulting 3D docking model shows PD binding to the LC3B protein and MCL-1 structure. Figure 6 6 6 6 6 6 6 Discussion Glioblastoma is an aggressive and lethal brain tumor. Despite multimodal treatment strategies combining surgery, radiotherapy, and temozolomide chemotherapy, patient outcomes remain poor, with a median overall survival of approximately 15 months 20 21 22 23 24 6 PD is reported to exhibit antitumor and pro-apoptotic activities in a variety of tumor cell types. Therefore, evaluation of the effective dosage of PD is essential, as it varies depending on the tumor cell line and is crucial for minimizing toxicity to normal cells. Some studies show that PD induced significant cytotoxic effects at concentrations ranging from 2 to 6 μM in both ER-positive (MCF-7) and ER-negative (MDA-MB-468) breast cancer cells 8 25 7 9 26 27 8 LC3B plays dual roles in tumor cells. Increased LC3B-mediated autophagy often induces tumor cell death under stress conditions such as hypoxia, nutrient deprivation, and chemotherapy 28 29 30 31 32 33 7 34 MCL-1 plays a critical role in the survival of glioblastoma cells by regulating apoptotic pathways. Elevated MCL-1 expression correlates with a poor prognosis in glioblastoma patients. Inhibition of MCL-1 has been shown to increase the sensitivity of glioblastoma cells to chemotherapy and radiotherapy, suggesting that the targeting of MCL-1 could be an effective strategy for treating glioblastoma. Several natural compounds have demonstrated promising effects in modulating MCL-1 to induce cancer cell death. Resveratrol induces mitochondrial apoptosis through the suppression of MCL-1 expression in breast and lung cancer cells 35 36 37 The present study is the first to report that PD induces both apoptosis and autophagy by targeting LC3/MCL-1 in glioblastoma cells both in vitro in vivo StepOnePlus PCR was performed in the Instrument Center of Chung Shan Medical University, which is supported by National Science Council, Ministry of Education and Chung Shan Medical University. Funding This work was supported by grants from Changhua Christian Hospital, Changhua, Taiwan (113-CCH-IRP-010), Chung Shan Medical University Hospital (CSH-2020-A-033) and Chung Shan Medical University (CSMU-INT-103-07). 1 Siminska D Korbecki J Kojder K Kapczuk P Fabianska M Gutowska I Epidemiology of Anthropometric Factors in Glioblastoma Multiforme-Literature Review Brain Sci 2021 11 116 33467126 10.3390/brainsci11010116 PMC7829953 2 Cruz-Martins N Advances in Plants-Derived Bioactives for Cancer Treatment Cells 2023 12 1112 37190022 10.3390/cells12081112 PMC10136607 3 Tagde P Tagde P Tagde S Bhattacharya T Garg V Akter R Natural bioactive molecules: An alternative approach to the treatment and control of glioblastoma multiforme Biomed Pharmacother 2021 141 111928 34323701 10.1016/j.biopha.2021.111928 4 Navarro Del Hierro J Casado-Hidalgo G Reglero G Martin D The hydrolysis of saponin-rich extracts from fenugreek and quinoa improves their pancreatic lipase inhibitory activity and hypocholesterolemic effect Food Chem 2021 338 128113 33092009 10.1016/j.foodchem.2020.128113 5 He X Qiao A Wang X Liu B Jiang M Su L Structural identification of methyl protodioscin metabolites in rats' urine and their antiproliferative activities against human tumor cell lines Steroids 2006 71 828 33 16797625 10.1016/j.steroids.2006.05.013 6 Passos FRS Araujo-Filho HG Monteiro BS Shanmugam S Araujo AAS Almeida J Anti-inflammatory and modulatory effects of steroidal saponins and sapogenins on cytokines: A review of pre-clinical research Phytomedicine 2022 96 153842 34952766 10.1016/j.phymed.2021.153842 7 Huang CF Hsieh YH Yang SF Kuo CH Wang PH Liu CJ Mitophagy Effects of Protodioscin on Human Osteosarcoma Cells by Inhibition of p38MAPK Targeting NIX/LC3 Axis Cells 2023 12 395 36766737 10.3390/cells12030395 PMC9913878 8 Bouchmaa N Ben Mrid R Bouargalne Y Ajouaoi S Cacciola F El Fatimy R In vitro PLoS One 2023 18 e0272781 36757991 10.1371/journal.pone.0272781 PMC9910703 9 Yu CL Lee HL Yang SF Wang SW Lin CP Hsieh YH Protodioscin Induces Mitochondrial Apoptosis of Human Hepatocellular Carcinoma Cells Through Eliciting ER Stress-Mediated IP3R Targeting Mfn1/Bak Expression J Hepatocell Carcinoma 2022 9 327 41 35496076 10.2147/JHC.S355027 PMC9049873 10 Jacquet M Guittaut M Fraichard A Despouy G The functions of Atg8-family proteins in autophagy and cancer: linked or unrelated? Autophagy 2021 17 599 611 32255730 10.1080/15548627.2020.1749367 PMC8032235 11 Liu S Yao S Yang H Liu S Wang Y Autophagy: Regulator of cell death Cell Death Dis 2023 14 648 37794028 10.1038/s41419-023-06154-8 PMC10551038 12 Chen Y Yi H Liao S He J Zhou Y Lei Y LC3B: A microtubule-associated protein influences disease progression and prognosis Cytokine Growth Factor Rev 2025 81 16 26 39701849 10.1016/j.cytogfr.2024.11.006 13 Dikic I Elazar Z Mechanism and medical implications of mammalian autophagy Nat Rev Mol Cell Biol 2018 19 349 64 29618831 10.1038/s41580-018-0003-4 14 Chiang YF Huang KC Chen HY Hamdy NM Huang TC Chang HY Hinokitiol Inhibits Breast Cancer Cells In Vitro Int J Mol Sci 2024 25 3904 38612715 10.3390/ijms25073904 PMC11011552 15 Chen Y-J Chien P-H Chen W-S Chien Y-F Hsu Y-Y Wang L-Y Hepatitis B Virus-Encoded X Protein Downregulates EGFR Expression via Inducing MicroRNA-7 in Hepatocellular Carcinoma Cells Evid Based Complement Alternat Med 2013 2013 682380 23840262 10.1155/2013/682380 PMC3693120 16 Sun WC Lin CL Lee TH Chang CH Ong AZ Yeh YH Critical role of heme oxygenase-1 in chaetoglobosin A by triggering reactive oxygen species mediated mitochondrial apoptosis in colorectal cancer Free Radic Biol Med 2023 208 833 45 37776916 10.1016/j.freeradbiomed.2023.09.027 17 Li RL Wang LY Duan HX Zhang Q Guo X Wu C Regulation of mitochondrial dysfunction induced cell apoptosis is a potential therapeutic strategy for herbal medicine to treat neurodegenerative diseases Front Pharmacol 2022 13 937289 36210852 10.3389/fphar.2022.937289 PMC9535092 18 Wang H Guo M Wei H Chen Y Targeting MCL-1 in cancer: current status and perspectives J Hematol Oncol 2021 14 67 33883020 10.1186/s13045-021-01079-1 PMC8061042 19 Thome MP Filippi-Chiela EC Villodre ES Migliavaca CB Onzi GR Felipe KB Ratiometric analysis of Acridine Orange staining in the study of acidic organelles and autophagy J Cell Sci 2016 129 4622 32 27875278 10.1242/jcs.195057 20 Rana M Liou KC Thakur A Nepali K Liou JP Advancing glioblastoma therapy: Learning from the past and innovations for the future Cancer Lett 2025 617 217601 40037502 10.1016/j.canlet.2025.217601 21 Luo C Chen G Li R Peng S Zhang P Wang F Juglone suppresses vasculogenic mimicry in glioma through inhibition of HuR-mediated VEGF-A expression Biochem Pharmacol 2024 227 116458 39102993 10.1016/j.bcp.2024.116458 22 Ling Z Pan J Zhang Z Chen G Geng J Lin Q Small-molecule Molephantin induces apoptosis and mitophagy flux blockage through ROS production in glioblastoma Cancer Lett 2024 592 216927 38697460 10.1016/j.canlet.2024.216927 23 Beltzig L Christmann M Kaina B Abrogation of Cellular Senescence Induced by Temozolomide in Glioblastoma Cells: Search for Senolytics Cells 2022 11 2588 36010664 10.3390/cells11162588 PMC9406955 24 Cui P Chen F Ma G Liu W Chen L Wang S Oxyphyllanene B overcomes temozolomide resistance in glioblastoma: Structure-activity relationship and mitochondria-associated ER membrane dysfunction Phytomedicine 2022 94 153816 34752969 10.1016/j.phymed.2021.153816 25 Hu K Yao X Protodioscin (NSC-698 796): its spectrum of cytotoxicity against sixty human cancer cell lines in an anticancer drug screen panel Planta Med 2002 68 297 301 11988850 10.1055/s-2002-26743 26 Lin CL Lee CH Chen CM Cheng CW Chen PN Ying TH Protodioscin Induces Apoptosis Through ROS-Mediated Endoplasmic Reticulum Stress via the JNK/p38 Activation Pathways in Human Cervical Cancer Cells Cell Physiol Biochem 2018 46 322 34 29590661 10.1159/000488433 27 Chen YR Wang SC Huang SP Su CC Liu PL Cheng WC Protodioscin inhibits bladder cancer cell migration and growth, and promotes apoptosis through activating JNK and p38 signaling pathways Biomed Pharmacother 2022 156 113929 36411619 10.1016/j.biopha.2022.113929 28 Sun C Gao X Sha S Wang S Shan Y Li L Berberine alleviates Alzheimer's disease by activating autophagy and inhibiting ferroptosis through the JNK-p38MAPK signaling pathway Int Immunopharmacol 2025 155 114550 40215776 10.1016/j.intimp.2025.114550 29 Xing Y Lv X Chen X Du J Hu D He R Maackiain induces apoptosis and autophagy via ROS-mediated endoplasmic reticulum stress in endometrial cancer Int Immunopharmacol 2025 147 113935 39756166 10.1016/j.intimp.2024.113935 30 Odermatt M Miskovic D Siddiqi N Khan J Parvaiz A Short- and long-term outcomes after laparoscopic versus open emergency resection for colon cancer: an observational propensity score-matched study World J Surg 2013 37 2458 67 23846176 10.1007/s00268-013-2146-y 31 Bortnik S Tessier-Cloutier B Leung S Xu J Asleh K Burugu S Differential expression and prognostic relevance of autophagy-related markers ATG4B, GABARAP, and LC3B in breast cancer Breast Cancer Res Treat 2020 183 525 47 32685993 10.1007/s10549-020-05795-z 32 Zielke S Meyer N Mari M Abou-El-Ardat K Reggiori F van Wijk SJL Loperamide, pimozide, and STF-62247 trigger autophagy-dependent cell death in glioblastoma cells Cell Death Dis 2018 9 994 30250198 10.1038/s41419-018-1003-1 PMC6155211 33 Huang X Bai HM Chen L Li B Lu YC Reduced expression of LC3B-II and Beclin 1 in glioblastoma multiforme indicates a down-regulated autophagic capacity that relates to the progression of astrocytic tumors J Clin Neurosci 2010 17 1515 9 20863706 10.1016/j.jocn.2010.03.051 34 Okubo S Ohta T Shoyama Y Uto T Steroidal Saponins Isolated from the Rhizome of Dioscorea tokoro Inhibit Cell Growth and Autophagy in Hepatocellular Carcinoma Cells Life (Basel) 2021 11 749 34440493 10.3390/life11080749 PMC8400091 35 Zhang W Wang X Chen T Resveratrol induces apoptosis via a Bak-mediated intrinsic pathway in human lung adenocarcinoma cells Cell Signal 2012 24 1037 46 22245142 10.1016/j.cellsig.2011.12.025 36 Kotha A Sekharam M Cilenti L Siddiquee K Khaled A Zervos AS Resveratrol inhibits Src and Stat3 signaling and induces the apoptosis of malignant cells containing activated Stat3 protein Mol Cancer Ther 2006 5 621 9 16546976 10.1158/1535-7163.MCT-05-0268 37 Chen WT Hsu FT Liu YC Chen CH Hsu LC Lin SS Fluoxetine Induces Apoptosis through Extrinsic/Intrinsic Pathways and Inhibits ERK/NF-kappaB-Modulated Anti-Apoptotic and Invasive Potential in Hepatocellular Carcinoma Cells In Vitro Int J Mol Sci 2019 20 757 30754643 10.3390/ijms20030757 PMC6386946 Figure 1 Effect of PD on human glioblastoma cell growth. Figure 2 PD induces apoptosis in human glioblastoma cells. Figure 3 PD treatment induces mitochondrial dysfunction in human glioblastoma cells. Figure 4 PD induces autophagy by targeting LC3 in human glioblastoma cells. Figure 5  In vivo Figure 6 PD directly targets LC3B/MCL-1 in molecular docking model. ",
  "metadata": {
    "Title of this paper": "Fluoxetine Induces Apoptosis through Extrinsic/Intrinsic Pathways and Inhibits ERK/NF-kappaB-Modulated Anti-Apoptotic and Invasive Potential in Hepatocellular Carcinoma Cells ",
    "Journal it was published in:": "International Journal of Medical Sciences",
    "URL": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC12492353/"
  }
}